{"id": "http://arxiv.org/abs/0710.5126v2", "guidislink": true, "updated": "2007-10-29T12:55:13Z", "updated_parsed": [2007, 10, 29, 12, 55, 13, 0, 302, 0], "published": "2007-10-26T15:50:25Z", "published_parsed": [2007, 10, 26, 15, 50, 25, 4, 299, 0], "title": "The Dearth of low-luminosity Globular Cluster LMXBs in NGC 3379", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0710.5703%2C0710.4049%2C0710.3974%2C0710.1397%2C0710.0750%2C0710.4576%2C0710.2983%2C0710.1972%2C0710.4143%2C0710.3816%2C0710.3858%2C0710.1678%2C0710.0269%2C0710.3679%2C0710.5126%2C0710.1555%2C0710.0788%2C0710.4305%2C0710.1403%2C0710.0724%2C0710.2345%2C0710.1037%2C0710.4691%2C0710.5926%2C0710.2224%2C0710.0936%2C0710.0312%2C0710.1755%2C0710.0220%2C0710.0938%2C0710.3192%2C0710.5902%2C0710.0761%2C0710.2868%2C0710.5905%2C0710.2236%2C0710.5841%2C0710.0445%2C0710.5483%2C0710.4040%2C0710.2691%2C0710.0171%2C0710.1218%2C0710.5113%2C0710.3785%2C0710.3560%2C0710.3899%2C0710.3798%2C0710.1125%2C0710.5750%2C0710.2499%2C0710.0139%2C0710.5879%2C0710.0926%2C0710.1968%2C0710.2786%2C0710.1853%2C0710.0820%2C0710.5823%2C0710.5485%2C0710.0745%2C0710.3164%2C0710.2471%2C0710.5727%2C0710.0978%2C0710.5602%2C0710.3861%2C0710.3241%2C0710.5605%2C0710.1613%2C0710.3880%2C0710.3236%2C0710.0717%2C0710.4896%2C0710.2805%2C0710.4585%2C0710.5618%2C0710.5056%2C0710.1250%2C0710.2092%2C0710.4606%2C0710.5860%2C0710.3268%2C0710.3576%2C0710.3280%2C0710.4920%2C0710.5074%2C0710.2815%2C0710.5479%2C0710.4253%2C0710.4425%2C0710.4120%2C0710.3288%2C0710.1735%2C0710.0429%2C0710.2164%2C0710.0041%2C0710.0879%2C0710.4897%2C0710.4634%2C0710.4694&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "The Dearth of low-luminosity Globular Cluster LMXBs in NGC 3379"}, "summary": "Our campaign of deep monitoring observations with {\\it Chandra} of the nearby\nelliptical galaxy NGC 3379 has lead to the detection of nine globular cluster\n(GC) and 53 field low mass X-ray binaries (LMXBs) in the joint {\\it\nHubble}/{\\it Chandra} field of view of this galaxy. Comparing these\npopulations, we find a highly significant lack of GC LMXBs at the low (0.3-8\nkeV) X-ray luminosities (in the $\\sim 10^{36}$ to $\\sim 4\\times10^{37}$ erg\ns$^{-1}$ range) probed with our observations. This result conflicts with the\nproposition that all LMXBs are formed in GCs. This lack of low-luminosity\nsources in GCs is consistent with continuous LMXB formation due to stellar\ninteractions and with the transition from persistent to transient LMXBs. The\nobserved cut-off X-ray luminosity favors a predominance of LMXBs with\nmain-sequence donors instead of ultra-compact binaries with white-dwarf donors;\nultra-compacts could contribute significantly only if their disks are not\naffected by X-ray irradiation. Our results suggest that current theories of\nmagnetic stellar wind braking may work rather better for the unevolved\ncompanions of GC LMXBs than for field LMXBs and cataclysmic variables in the\nGalaxy, where these companions may be somewhat evolved.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0710.5703%2C0710.4049%2C0710.3974%2C0710.1397%2C0710.0750%2C0710.4576%2C0710.2983%2C0710.1972%2C0710.4143%2C0710.3816%2C0710.3858%2C0710.1678%2C0710.0269%2C0710.3679%2C0710.5126%2C0710.1555%2C0710.0788%2C0710.4305%2C0710.1403%2C0710.0724%2C0710.2345%2C0710.1037%2C0710.4691%2C0710.5926%2C0710.2224%2C0710.0936%2C0710.0312%2C0710.1755%2C0710.0220%2C0710.0938%2C0710.3192%2C0710.5902%2C0710.0761%2C0710.2868%2C0710.5905%2C0710.2236%2C0710.5841%2C0710.0445%2C0710.5483%2C0710.4040%2C0710.2691%2C0710.0171%2C0710.1218%2C0710.5113%2C0710.3785%2C0710.3560%2C0710.3899%2C0710.3798%2C0710.1125%2C0710.5750%2C0710.2499%2C0710.0139%2C0710.5879%2C0710.0926%2C0710.1968%2C0710.2786%2C0710.1853%2C0710.0820%2C0710.5823%2C0710.5485%2C0710.0745%2C0710.3164%2C0710.2471%2C0710.5727%2C0710.0978%2C0710.5602%2C0710.3861%2C0710.3241%2C0710.5605%2C0710.1613%2C0710.3880%2C0710.3236%2C0710.0717%2C0710.4896%2C0710.2805%2C0710.4585%2C0710.5618%2C0710.5056%2C0710.1250%2C0710.2092%2C0710.4606%2C0710.5860%2C0710.3268%2C0710.3576%2C0710.3280%2C0710.4920%2C0710.5074%2C0710.2815%2C0710.5479%2C0710.4253%2C0710.4425%2C0710.4120%2C0710.3288%2C0710.1735%2C0710.0429%2C0710.2164%2C0710.0041%2C0710.0879%2C0710.4897%2C0710.4634%2C0710.4694&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Our campaign of deep monitoring observations with {\\it Chandra} of the nearby\nelliptical galaxy NGC 3379 has lead to the detection of nine globular cluster\n(GC) and 53 field low mass X-ray binaries (LMXBs) in the joint {\\it\nHubble}/{\\it Chandra} field of view of this galaxy. Comparing these\npopulations, we find a highly significant lack of GC LMXBs at the low (0.3-8\nkeV) X-ray luminosities (in the $\\sim 10^{36}$ to $\\sim 4\\times10^{37}$ erg\ns$^{-1}$ range) probed with our observations. This result conflicts with the\nproposition that all LMXBs are formed in GCs. This lack of low-luminosity\nsources in GCs is consistent with continuous LMXB formation due to stellar\ninteractions and with the transition from persistent to transient LMXBs. The\nobserved cut-off X-ray luminosity favors a predominance of LMXBs with\nmain-sequence donors instead of ultra-compact binaries with white-dwarf donors;\nultra-compacts could contribute significantly only if their disks are not\naffected by X-ray irradiation. Our results suggest that current theories of\nmagnetic stellar wind braking may work rather better for the unevolved\ncompanions of GC LMXBs than for field LMXBs and cataclysmic variables in the\nGalaxy, where these companions may be somewhat evolved."}, "authors": ["G. Fabbiano", "N. J. Brassington", "A. Zezas", "s. Zepf", "L. Angelini", "R. L. Davies", "J. Gallagher", "V. Kalogera", "D. -W. Kim", "A. R. King", "A. Kundu", "S. Pellegrini", "G. Trinchieri"], "author_detail": {"name": "G. Trinchieri"}, "author": "G. Trinchieri", "arxiv_comment": "submitted to ApJ; 3 figs reloaded with correct author's list", "links": [{"href": "http://arxiv.org/abs/0710.5126v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0710.5126v2", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0710.5126v2", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0710.5126v2", "journal_reference": null, "doi": null, "fulltext": "Not to appear in Nonlearned J., 45.\n\narXiv:0710.5126v2 [astro-ph] 29 Oct 2007\n\nThe Dearth of low-luminosity Globular Cluster LMXBs in NGC\n3379\nG. Fabbiano\nHarvard-Smithsonian Center for Astrophysics, 60 Garden St., Cambridge, MA 02138\npepi@cfa.harvard.edu\nN. J. Brassington, A. Zezas\nHarvard-Smithsonian Center for Astrophysics, 60 Garden St., Cambridge, MA 02138\nS. Zepf\nDepartment of Physics and Astronomy, Michigan State University, East Lansing, MI\n48824-2320\nL. Angelini\nLaboratory for X-ray Astrophysics, NASA Goddard Space Flight Center, Greenbelt, MD\n20771\nR. L. Davies\nSub-Department of Astrophysics, University of Oxford, Oxford OX1 3RH, UK\nJ. Gallagher\nDepartment of Astronomy, University of Wisconsin, Madison, WI 53706-1582\nV. Kalogera\nNorthwestern University, Department of Physics and Astronomy, Evanston, IL 60208\nD.-W. Kim\nHarvard-Smithsonian Center for Astrophysics, 60 Garden St., Cambridge, MA 02138\nA. R. King\nTheoretical Astrophysics Group, University of Leicester, Leicester LE1 7RH, UK\n\n\f–2–\nA. Kundu\nDepartment of Physics and Astronomy, Michigan State University, East Lansing, MI\n48824-2320\nS. Pellegrini\nDipartimento di Astronomia, Universita di Bologna, Via Ranzani 1, 40127 Bologna, Italy\nand\nG. Trinchieri\nINAF-Osservatorio Astronomico di Brera, Via Brera 28, 20212 Milano, Italy\nABSTRACT\nOur campaign of deep monitoring observations with Chandra of the nearby\nelliptical galaxy NGC 3379 has lead to the detection of nine globular cluster (GC)\nand 53 field low mass X-ray binaries (LMXBs) in the joint Hubble/Chandra field\nof view of this galaxy. Comparing these populations, we find a highly significant\nlack of GC LMXBs at the low (0.3-8 keV) X-ray luminosities (in the ∼ 1036 to\n∼ 4 × 1037 erg s−1 range) probed with our observations. This result conflicts with\nthe proposition that all LMXBs are formed in GCs. This lack of low-luminosity\nsources in GCs is consistent with continuous LMXB formation due to stellar\ninteractions and with the transition from persistent to transient LMXBs. The\nobserved cut-off X-ray luminosity favors a predominance of LMXBs with mainsequence donors instead of ultra-compact binaries with white-dwarf donors; ultracompacts could contribute significantly only if their disks are not affected by Xray irradiation. Our results suggest that current theories of magnetic stellar wind\nbraking may work rather better for the unevolved companions of GC LMXBs than\nfor field LMXBs and cataclysmic variables in the Galaxy, where these companions\nmay be somewhat evolved.\nSubject headings: globular clusters: general - X-rays: binaries - galaxies: NGC\n3379\n\n1.\n\nIntroduction\n\nSince their discovery in the Milky Way (see Giacconi 1974), the origin and evolution of\nLow-mass X-ray binaries (LMXBs) has been the subject of much discussion. LMXBs are\n\n\f–3–\nfound in both the stellar field and globular clusters (GCs). Their incidence per unit stellar\nmass is much higher in GCs than in the field, requiring a special formation mechanism,\npresumably dynamical (Clark 1975; Katz 1975). The high efficiency of these dynamical\nprocesses led to the suggestion that all LMXBs may form in GCs and then disperse in the\nfield (see e.g., Grindlay 1984; Grindlay & Hertz 1985); however, some primordial field binaries\nare also expected to evolve into LMXBs, suggesting that there may be two populations of\nthese sources, with distinct formation and evolutionary histories (see review by Verbunt &\nvan den Heuvel 1995).\nThe discovery of X-ray source populations in early-type galaxies with Chandra has provided a wider and more diverse observational basis for the study of LMXBs, their association\nwith GCs and the role that GCs may play in LMXB formation (see review Fabbiano 2006).\nHowever, until recently, only the most luminous extra-Galactic LMXBs with (∼0.3-8 keV)\nLX ≥ a few 1037 erg s−1 have been observed, and therefore the study of the GC-LMXB association has been limited to systems with X-ray luminosities in the upper range of Galactic\nLMXB luminosities.\nWith our deep 337 ks Chandra ACIS-S3 observations of the unperturbed elliptical galaxy\nNGC 3379 in the nearby poor group Leo (D∼11 Mpc), we can now pursue this study in a\nluminosity range more typical of the well-studied Galactic LMXBs. In NGC 3379, The GCLMXB association has been previously studied by Kundu, Maccarone & Zepf (2007, hereafter\nKMZ), using the first shorter Chandra observation of this galaxy, which has a typical source\ndetection threshold of ∼ 1 − 2 × 1037 erg s−1 (KMZ). Our data set is ∼10 times deeper (337\nks), allowing the detection of LMXBs at luminosities of ∼ 1036 erg s−1 .\n\n2.\n\nThe Lack of Low-Luminosity GC LMXBs\n\nWe refer to our companion paper for details on the data, analysis and X-ray source\ncatalog (Brassington et al 2007a, hereafter B07). The data set includes a first archival ∼30\nks pointing in 2001 Feb. (obsid 1587, used by KMZ), and four longer exposures distributed\nbetween 2006 Jan. and 2007 Jan. B07 find 9 GC-LMXB matches with the Hubble WFPC2\nuniform set of optical GC detections of Kundu & Withmore (2001). These GC-LMXBs are\ndistributed throughout the entire luminosity range to which we are sensitive (see fig. 9 of\nB07), but are relatively scarce in the (1-10)×1037 erg s−1 range, where instead, the overall\nnumber of sources sharply increases.\nWe have explored the difference in the luminosity distributions of GC and field LMXBs\nsuggested by the B07 results in three different ways, using only sources from the joint Hub-\n\n\f–4–\nble/Chandra field of view. We compared: 1) the number of sources detected by KMZ with\nthose in our 10-fold deeper data set (Table 1); 2) the observed cumulative luminosity functions (source numbers) of field and GC LMXBs, which suffer from comparable incompleteness\nbiases; and 3) the cumulative luminosity distributions (as function of luminosity), including\nthe limit on the low luminosity emission of GC LMXBs, derived from a stacking experiment,\nwhich overcomes detection incompleteness.\nIt is clear from Table 1 that there is a relative lack of GC-LMXB associations at the lower\nLMXB luminosities, since the fraction of GCs associated with an LMXB does not change\nsignificantly as a result of the deeper detection thresholds, while the number of detected\nLMXBs increases by a factor of 2.4. If the number of GC-LMXB associations increased\nlinearly with the number of LMXBs at the lower luminosities, we would expect to detect 17\nGC-LMXB associations, instead of the 9 we detect; based on Poisson statistics, detecting\n9 sources has a low chance probability of 1.2%. Of these 9 sources, 6 are associated with\nred GCs, and 3 are found in blue GCs (using VI = 1.0 as a boundary, from Table 11 of\nB07); although we only have small numbers of GC sources, the predominance of red GCs is\nconsistent with previous studies of GC LMXB populations (e.g., KMZ, Kim E. et al 2006).\nFig. 1 shows the observed cumulative X-ray luminosity functions (XLFs) of field and\nGC LMXBs. These XLFs are not corrected for incompleteness at the low luminosities,\nwhich becomes important below ∼ 8 × 1036 erg s−1 . However, the two samples of sources\nwere extracted from the same field, therefore both XLFs suffer from comparable detection\nbiases, and can be compared directly. It is evident that the GC LMXB XLF lacks low\nluminosity sources, compared to that of field LMXBs. A KS test excludes that the two\ndistributions may be derived from the same parent population at 99.82% confidence. This is\na conservative estimate, because the field-LMXB XLF contains a larger number of sources\nfrom the circum-nuclear regions, which in principle should be more affected by detection\nincompleteness because of the higher background from the hot ISM and source confusion.\nTherefore the statistical significance of the difference can only increase if all biases were\nremoved.\nThe dearth of low luminosity GC LMXBs is reinforced by the results of a stacking\nexperiment, on the GCs with undetected X-ray counterpart. We created 56 source regions,\ncentered on the location of the GCs from Kundu & Withmore (2001; 14 of these 70 GCs\nwere not included, as they either had confirmed X-ray counterparts, or were too close to\nmultiple X-ray sources for reliable photometry, see B07). The radii of these 56 regions\nwere set at the 1.5 keV 95% encircled energy radius, with a minimum of 3\" near the aim\npoint. Background counts were extracted from annuli concentric with source regions, with\ninner and outer radii of two and five times the source radius respectively, excluding areas\n\n\f–5–\nwith detected B07 sources. We obtain 1229 cumulative counts from the source regions, and\n1239.3 background counts (normalized by the ratio of extraction areas). Fig. 2 shows the\nhistograms of the source counts (lower panel) and background subtracted net counts (upper\npanel) extracted from each stacking regions; the median value of the net count distribution\nis -0.08, showing that there are no biases in the determination of the background counts.\nFollowing the same Bayesian approach used in B07, which takes into account the Poisson\nnature of the probability distribution of the source and background counts, as well as the\neffective area at the position of the source (van Dyk et al. 2001; Park et al 2006), we find\nupper bounds on the intensity of a 'stacked' source of 28.8 and 101.1 counts at 68% and\n99.7% confidence, respectively (in both cases the mode is 0). Dividing by the number of\nGCs included in the experiment, source flux and luminosity were calculated in the 0.3-8.0\nkeV band, with an energy conversion factor (ECF) corresponding to an assumed power law\nspectral shape, with Γ = 1.7 and Galactic NH = 2.78 × 1020 cm−2 , where the ECF also\naccounts for the temporal and spatial variations of the ACIS CCD quantum efficiency1 and\nthe vignetting effect (Kim et al 2004). We obtain average upper confidence bounds on the\nX-ray luminosity of a non-detected GC < 1.2 × 1035 erg s−1 (68%) and < 5.4 × 1035 erg s−1\n(99.7%); these limits are well below the distribution of luminosities of detected LMXBs.\nFig. 3 shows the cumulative luminosity distributions of field and GC LMXBs; the stacking upper limit excludes at high statistical significance that incompleteness is responsible\nfor the lack of GC sources at the low luminosities and shows that these sources are really\nabsent down to very low limits. Survival analysis tests (from ASURV; Lavalley, Isobe &\nFeigelson 1992) on these distributions show that the GC and field populations are different\nat the 100% confidence level (both Logrank and Peto-Prentice tests).\n\n3.\n\nVariability Properties of GC LMXBs\n\nB07 identifies seven variable GC sources (out of nine); light-curves of all these sources\ncan be found in B07. Of the three most luminous GC LMXBs, two are highly variable\nbetween observations: sources 41 of B07 (with average 0.3-8.0 keV LX = 2 × 1038 erg s−1 )\nand 42 (LX = 5 × 1038 erg s−1 ); the third (source 67, LX = 3 × 1038 erg s−1 ) does not vary.\nNo short-term variability, within each observation, was detected in B07 in these sources.\nFive of the GC LMXB sources with LX < 1038 erg s−1 vary. Three of these sources are\ndetected only in a single observation (sources 50, 61, 79; B07); the most luminous, source\n1\n\nSee http://asc.harvard.edu/cal/Acis/Cal_prods/qeDegforthelowenergyQEdegradation\n\n\f–6–\n50, is a highly significant transient candidate, with a detected luminosity of 6.3 × 1037 erg\ns−1 , a factor of ∼20 times larger than the non-detected threshold luminosity. Sources 61\nand 79 are fainter: 61 has a peak detection luminosity of 1.6 × 1037 erg s−1 and a ratio\nof peak to non-detected of 7.5, making it a possible transient candidate (see B07); 79 is a\nhighly significant transient candidate (ratio of peak to non-detected luminosity of 22) with\na peak luminosity of 1.3 × 1037 erg s−1 . Source 50 is detected in the first observation after\na 5-year observation hiatus, so that we could be catching the end of a few-years on-state\n(< 5 yr); source 61 is detected only in the first observation, so the duration of its on-state is\nunconstrained; source 79' s on-state instead can be constrained by our sampling to be < 9\nmonths (see also Brassington et al 2007b, in preparation).\n\n4.\n\nDiscussion\n\nOur results strongly suggest a dearth of GC-LMXB associations at luminosities lower\nthan ∼ 4 × 1037 erg s−1 in the 0.3-8 keV band. Above this luminosity, KMZ estimate a 5%\nfraction of GCs with LMXBs, similar to that observed in other elliptical and S0 galaxies for\na comparable luminosity threshold (KMZ, see also Fabbiano 2006 and references therein).\nThe comparison of the XLFs of field and GC LMXBs of E and S0 galaxies (Kim, E. et al\n2006) shows that the two track each other above ∼ 4 × 1037 erg s−1 . In NGC 3379, for the\nfirst time we can probe the the low-luminosity field and GC XLFs of an elliptical galaxy and\nfind that they differ, suggesting a decrease in the number of GCs associated with LMXBs\nat luminosities LX <∼ 4 × 1037 erg s−1 . A similar effect was suggested by the comparison\nof GC and Field XLFs in NGC3115, where source detection extends below 1037 erg s−1 (see\nfig. 6 of KMZ). The study of GC-LMXB populations in M31 and the Milky Way (although\ndistance uncertainties may play a role in the latter) are also consistent with this emerging\npicture (see figures 6 and 7 of Voss & Gilfanov 2007); in both cases, the differential XLFs of\nfield and GC LMXBs differ at the lower luminosities, with the GC LMXB XLF showing a\nsharp downturn at luminosities lower than ∼ 5 × 1036 erg s−1 . Our deep look at NGC 3379\nsuggests that this behavior may be a general feature of LMXB populations.\nOne cause for this effect, which we can discount, could be the presence of multiple\nLMXBs in the most luminous GCs that might 'remove' sources from the fainter portion of\nthe XLF. However, source variability such as we detect in GC LMXBs (see Section 3 and\nB07) suggests that multiple LMXB systems are unlikely to be found in the most luminous\nGCs sources, a conclusion in agreement with the independent evidence of Sivakoff et al\n(2007).\nA possible explanation for the difference in GC and field XLFs could be a relative\n\n\f–7–\nexcess of high luminosity LMXBs in GCs, because of the expected overwhelming presence\nof transients at the high luminosities in the old stellar field population of elliptical galaxies\n(Piro & Bildsten 2002; King 2002). GC binaries with either main sequence (MS), red giant,\nor white dwarf donors, instead, can be bright, persistent X-ray sources, because they form\npredominantly by stellar interactions (Clark 1975; Katz 1975; Ivanova et al. 2007) and so\nescape the age constraints of primordial field binaries. The only ways of making transients\nin GCs are rather unlikely, including either the capture of a giant star - rare, because of their\nshort lifetimes, or a BH+main-sequence binary evolving to BH+giant - also rare, because\nthe nuclear evolution has to beat angular momentum losses. Short-period transients in the\nfield have nuclear-evolved companions because of a complex previous evolution that does not\napply to GC sources made by dynamical stellar interactions.\nEven black hole (BH) sources in GCs could be persistent (Kalogera, King & Rasio\n2004). High luminosity GC LMXBs may be BH binaries, given their luminosities near or\nabove the Eddington limit of an accreting NS and their widespread variability (this paper\nand Maccarone et al 2007); the most luminous GC source we find in NGC 3379 (in a red\ncluster, B07) has a luminosity of 5 × 1038 erg s−1 and is variable. This peak luminosity is\nconsistent either with slightly (by a factor of ∼ 2) super-Eddington luminosities for a NS\naccreting H-rich material or with Eddington luminosity for He-rich material.The detection of\nthree possible transients in the NGC 3379 GC sources, with peak luminosity in the 1037 erg\ns−1 range, may argue against mostly persistent sources, but we must remember that typical\npeak-to-quiescence flux ratios for transients are &100, a range we cannot explore with our\nsensitivity (see §3.).\nAlternatively, we may have a real lack of low-luminosity GC sources because of the\ntransition from persistent to transient X-ray sources, as discussed by Bildsten & Deloye\n(2004, BD4 hereafter) in the context of their model of ultra-compact binaries (UCs) with\nNS accreting from white dwarfs. This conclusion is supported by the very low limits on\nthe luminosity of undetected GC sources found in our stacking experiment (§2.). In the\ndisk instability model (King et al 1997) this transition occurs when the mass transfer rate\ndriven from the donor drops below a critical value. Since in persistent X-ray sources the\nmass transfer rate is thought to be directly connected to the X-ray luminosity, this transition\nwould lead to a dearth of X-ray sources with luminosity lower than the one corresponding to\nthe critical mass transfer rate. BD4 showed that persistent UCs must have a high-luminosity\nXLF consistent with the observed high luminosity XLFs of both GC and field LMXBs (see\nKim & Fabbiano 2004; Kim, E. et al 2006). However, quantitative consideration of this cutoff X-ray luminosity for UCs with He-rich donors leads to rather low cut-off values. Figure\n3 in Deloye & Bildsten (2003) indicates a value of ∼ 5 × 1036 erg s−1 for non-irradiated\naccretion disks, and the cut-off would occur at significantly lower values for irradiated disks\n\n\f–8–\n(see, for example, King, Kolb, & Burderi 1996).\nThere is overwhelming evidence that Galactic LMXB accretion discs are significantly\nirradiated. van Paradijs & McClintock (1994) showed that irradiation fixes their absolute\nvisual magnitudes, and van Paradijs (1996) and King, Kolb & Burderi (1996) that irradiation\ndetermines whether these systems are transient or not. There is of course no reason why\nthis conclusion should change for the GC LMXBs in NGC 3379. Accordingly, we conclude\nthat the observed cut-off luminosity identified here is not consistent with the suggestion that\nthe majority of the GC LMXBs are UCs. We note that the recent self-consistent population\nsimulations with dynamical interactions presented by Ivanova et al (2007) also suggest that\nUCs may not be the dominant LMXB population in GCs, contrary to BD4's assertions.\nFormation rates of UCs are found to be comparable or lower than those of LMXBs with MS\ndonors (see their figure 3), whereas UC lifetimes are found to be ∼ 107 − 108 yr (also C.\nDeloye, private communication), lower or at best comparable to the lifetime of the persistent\nphase for LMXBs with MS donors. Moreover, Ivanova et al. (2007) do not find a significant\ndependence of the number and evolution of ultra-compacts on the metallicity of the parent\nGC, contrary to the prevalent association of LMXBs with red metal-rich GCs in elliptical\ngalaxies (e.g., KMZ; Kim E. et al. 2006).\nIn view of the rather high observed cut-off luminosity of the GC LMXBs and the results\nof Ivanova et al. (2007) we conclude that the GC sources in NGC 3379 are not consistent\nwith UCs being the predominant population. Of the other two donor types, red giants and\nMS, red giants are also disfavored because they are expected to be transient through most of\ntheir lifetime (King et al. 1997); consequently they could not contribute to the formation of\na X-ray luminosity cut-off. The simulations by Ivanova et al. (2007) also indicate that their\nnumbers are low, taking into account their formation rates, short lifetimes truncated by their\nlarge cross sections and frequent stellar interactions, and their transient duty cycles. LMXBs\nwith H-rich MS donors remain as the only possibility for a dominant, persistent X-ray source\npopulation in GCs that would produce the bright systems we observe. For irradiated H-rich\naccretion disks MS donors are expected to transition from persistent to transient behavior at\n∼ 3 × 1037 erg s−1 (King, Kolb, & Burderi 1996; Stehle, Kolb, & Ritter 1997); this transition\nluminosity would also be consistent with the observed peak luminosities of our transient\ncandidates.\nOur results show that any persistent GC LMXBs with MS companion is likely to have\nLX > 4 × 1037 erg s−1 . A qualitatively plausible interpretation is that mass transfer in these\nbright systems is driven by magnetic braking, in the standard form for Pop II systems (Stehle,\nKolb & Ritter, 1997); instead in sources fainter than ∼ 4 × 1037 erg s−1 mass transfer would\nbe driven by gravitational radiation. It is noticeable that this simple interpretation does\n\n\f–9–\nnot work so well for field LMXBs or cataclysmic variables (CVs) in the Galaxy, as magnetic\nbraking does not seem to produce such uniformity. This may relate to the fact that the\ncompanion stars in GC LMXBs are of necessity completely unevolved main sequence stars,\nsince they have been dynamically captured. By contrast, the companion stars in field LMXBs\nand CVs have probably had a previous complex interaction with their neutron star/white\ndwarf primaries, and may well be somewhat evolved despite their current low masses.\nThere is an important immediate implication of our results for the understanding of\nLMXB evolution in galaxies: the difference between field and GC LMXB luminosity functions\nat LX < 4 × 1037 erg s−1 excludes a single formation mechanism in GCs for all LMXBs,\nresolving a long-standing controversy in LMXB formation and evolution (e.g., Grindlay 1984;\nGrindlay & Hertz 1985; review by Verbunt & van den Heuvel 1995). The proposition that\nall field LMXBs were formed in GCs is incompatible with the significant difference between\ntheir luminosity function and that of GC LMXBs. This conclusion is in agreement with the\nobservations of the Sculptor dwarf spheroidal galaxy (Maccarone et al 2005), suggesting that\nthe binary properties of field and GC LMXBs might be different (see KMZ), and with less\ndirect early suggestions, based on LMXB and GC population statistics in elliptical galaxies\n(Irwin 2005; Juett 2005).\n\n5.\n\nConclusions\n\nOur campaign of deep monitoring observations of the nearby elliptical galaxy NGC\n3379 with Chandra ACIS-S3 has led to the detection of nine GC LMXBs in the field studied\noptically with Hubble WFPC2, seven of which were previously detected in a much shorter\nChandra exposure (1/10 of the exposure time; KMZ). The comparison of GC and field\nLMXB statistics in the joint Hubble-Chandra field of view demonstrates a relative lack of\nGC LMXB at luminosities below ∼ 4 × 1037 erg s−1 ; field and GC LMXBs instead are know\nto have closely matching XLFs above this luminosity (Kim E. et al 2006; KMZ). The dearth\nof low-luminosity GC LMXBs in NGC 3379 is consistent with a similar suggested behavior\nin NGC 3115 (KMZ), and with the XLFs of field and GC LMXBs in the Milky Way and\nM31 (Voss & Gilfanov 2007). These differences between low-luminosity field and GC XLFs\nfalsify suggested theories that all LMXBs may have been originated in GCs.\nThe luminosity-dependent differences of field and GC XLFs cannot be explained by high\nluminosity GCs containing multiple LMXBs, because we find clear evidence of source variability for seven out of the nine sources invalidating this hypothesis. Persistent behavior of\nhigh luminosity GC sources, compared with transient field sources of similar high luminosity\nmay explain the discrepancy as excess of luminous GC LMXBs. However, the detection of\n\n\f– 10 –\nthree candidate transient source (with peak luminosity greater than 1037 erg s−1 ) in the GC\nLMXB population of NGC 3379 may not support this explanation.\nThe lack of low-luminosity sources in GCs is consistent with the prediction of Bildsten\nand Deloye (BD4) based on the transition of sources from persistent to transients due to the\nthermal disk instability. However, the value of the observed XLF cut-off is not consistent\nwith their suggestion that GC LMXBs are dominated by ultra-compact binaries, but instead\nfavors LMXBs with H-rich MS donors. The ∼ 4 × 1037 erg s−1 luminosity cut-off is also\nconsistent with current theories of magnetic stellar wind braking, suggesting that this effect\nmay work rather better for the unevolved companions of GC LMXBs than for field LMXBs\nand cataclysmic variables in the Galaxy, where these companions may be somewhat evolved.\nWhile our results firmly establish a dearth of GC sources in NGC3379 at low luminosity,\nthe accurate luminosity (and uncertainty) of the GC XLF cut-off will need the formal analysis\nof the NGC3379 LMXB luminosity function (Kim et al in preparation). The forthcoming\nanalysis of the very deep Chandra observations of NGC4278, a GC-rich galaxy (see Kim,\nD.-W. et al 2006), will provide in the near future stronger constraints on the potential\n'universality' and value of the GC LMXB XLF cut-off luminosity.\nWe thank Chris Deloye and Natalia Ivanova for very very useful discussions. The data\nanalysis was supported by the CXC CIAO software and CALDB. We have used the NASA\nNED and ADS facilities, and have extracted archival data from the Chandra archives. This\nwork was supported by the Chandra GO grant G06-7079A (PI: Fabbiano) and sub-contract\nG06-7079B (PI: Kalogera). We acknowledge partial support from NASA contract NAS839073 (CXC); A. Zezas acknowledges support from NASA LTSA grant NAG5-13056; S.\nPellegrini acknowledges partial financial support from the Italian Space Agency ASI (Agenzia\nSpaziale Italiana) through grant ASI-INAF I/023/05/0.\nFacilities: CXO (ACIS).\n\nREFERENCES\nBildsten, L. & Deloye, C. J. 2004, ApJ, 607, L119\nBrassington, N. J. et al 2007a, in preparation (B07)\nBrassington, N. J. et al 2007b, in preparation\nClark, G. W. 1975, ApJ, 199, L143\n\n\f– 11 –\nFabbiano, G. 2006, ARAA, 44, 323\nGiacconi, R. 1974, in X-ray Astronomy, eds. R. Giacconi & H. Gursky, p. 155, Dordrecht:\nReidel\nGrindlay, J. E. 1984, Adv. Space Res., 3, 19\nGrindlay, J. E. & Hertz, P. 1985, in Cataclysmic variables and low-mass X-ray binaries, p.\n79, Dordrecht: Reidel\nIrwin, J. A. 2005, ApJ, 631, 511\nIvanova, N. & Kalogera, V. 2006, ApJ, 636, 985\nIvanova, N., Heinke, C., Rasio, F. A., Belczynski, K. & Fregeau, J. 2007, submitted (astroph/0706.4096v1)\nJuett, A. M. 2005, ApJ, 621, L25\nKalogera, V., King, A. R. & Rasio, F. A. 2004, ApJ, 601, L171\nKatz, J. I. 1975, Nature, 253, 698\nKim, D.-W. & Fabbiano, G. 2004, ApJ, 611, 846\nKim, D.-W. et al 2004, ApJ, 600, 59\nKim, D.-W. et al 2006, ApJ, 652, 1090\nKim, E. et al 2006, ApJ, 647, 276\nKing, A. R. 2002, MNRAS, 335, L13\nKing, A. R., Frank, J., Kolb, U. & Ritter, H. 1997, ApJ, 484, 844\nKing, A. R., Kolb, U. & Burderi, L. 1996, ApJ, 464, L127\nKundu, A., Maccarone, T. J. & Zepf, S. E. 2007, ApJ, 662, 525 (KMZ)\nKundu, A. & Withmore, B. C. 2001, ApJ, 121, 2950\nLavalley, M., Isobe, T & Feigelson, E. 1992, Astronomical Data Analysis Software and Systems I, A.S.P. Conference Series, Vol. 25, 1992, Diana M. Worrall, Chris Biemesderfer,\nand Jeannette Barnes, eds., p. 245.\n\n\f– 12 –\nMaccarone, T. J., Kundu, A., Zepf, S. E., Piro, A. L. & Bildsten, L. 2005, MNRAS, 364,\nL61\nMaccarone, T. J., Kundu, A. Zepf & S. E. Rhode, K. L. 2007, Nature, 445, 183\nvan Paradijs, J. & McClintock, J. E. 1994, A&A, 290, 133\nPark, T., Kashyap, V., Siemiginowska, A., van Dyk, D., Zezas, A., Heinke, C., & Wargelin,\nB., 2006, ApJ, 652, 610\nPiro, A. L. & Bildsten, L. 2002, ApJ, 571, L103\nSivakoff, G. R. et al 2007, ApJ, 660, 1246\nStehle, R., Kolb, U. & Ritter, H. 1997 A&A, 320, 136\nvan Dyk et al. 2001, ApJ, 548, 224\nvan Paradijs, J 1996, ApJ, 464, L139\nVerbunt, F. & van den Heuvel, E. P. J. 1995, in X-ray Binaries, eds. W. H. G. Lewin, J.\nvan Paradijs, E. P. J. van den Heuvel, p. 457, Cambridge, UK: Cambridge University\nPress\nVoss, R. & Gilfanov, M. 2007, AA, 469, 49\n\nThis preprint was prepared with the AAS LATEX macros v5.2.\n\n\f– 13 –\n\nFig. 1.- Observed cumulative XLFs of field (continuous line) and GC (dashed) LMXBs;\nboth distributions are from the joint Hubble/Chandra field.\n\n\f– 14 –\n\nFig. 2.- Histograms of source counts (lower panel) and background-subtracted net counts\n(upper panel) for the sources included in the stacking. The vertical line in the upper panel\nis the median of the distribution.\n\n\f0.01\n\n0.1\nLX (1038 erg s−1)\n\n1\n\n– 15 –\n\n10\n\n20\nLX (>L)\n\nFig. 3.- Cumulative luminosity distributions of detected field (black) and GC (red) LMXBs;\nboth distributions are from the joint Hubble/Chandra field. The last bin with thearrow\nrepresents the contribution of undetected GC LMXB from our stacking experiment.\n\n\f– 16 –\n\nTable 1: LMXB-GC Associations in NGC 3379\nObservationsa\nTexp. (ks)\n1587\n31\n1587, 7073, 7074, 7075,7076\n337\n\nGCb LMXBc GC-LMXB\n61\n26\n7\n70\n62\n9\n\nfGC fLM XB\n12%\n27%\n13%\n15%\n\nRef.\nKMZ\nB07\n\na\n\nThese observations were all performed with Chandra ACIS-S3; 1587 was obtained in 2001, the other four\nobservations were all taken at few months intervals between 2006 Jan. and 2007 Jan. (see B07).\n\nb\n\nNumber of GCs within the WFPC2 observation of NGC 3379 considered for the LMXB search; no GC was\ndetected within 5\" of the nucleus (Kundu & Withmore 2001, with color cut of 0.5-1.5 in V-I). Note that the\nnumber of GCs in KMZ is slightly smaller because of their restrictive color cut (0.8-1.4 in V-I, see KMZ).\n\nc\n\nNumber of all the LMXB detected in the WFPC2 area, including 5 sources detected within 5\" of the nucleus\nwhere no GC counterpart was detected. Since LMXBs may be confused with Chandra in this inner area,\nfLMXB could be somewhat overestimated. Confusion would affect more the deeper cumulative observation\nof B07, strengthening our conclusion of a lack of GC sources at the lower luminosities\n\n\f"}