{"id": "http://arxiv.org/abs/0802.2552v1", "guidislink": true, "updated": "2008-02-18T21:26:12Z", "updated_parsed": [2008, 2, 18, 21, 26, 12, 0, 49, 0], "published": "2008-02-18T21:26:12Z", "published_parsed": [2008, 2, 18, 21, 26, 12, 0, 49, 0], "title": "A Second Look at the Metal Line Variability of G29-38", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0802.2841%2C0802.4175%2C0802.2959%2C0802.1462%2C0802.2691%2C0802.2524%2C0802.1171%2C0802.4358%2C0802.2301%2C0802.2183%2C0802.2839%2C0802.2016%2C0802.4247%2C0802.0445%2C0802.0427%2C0802.2164%2C0802.1499%2C0802.3052%2C0802.1827%2C0802.4044%2C0802.0142%2C0802.2828%2C0802.3086%2C0802.1198%2C0802.4397%2C0802.1842%2C0802.3421%2C0802.3504%2C0802.0344%2C0802.0712%2C0802.4309%2C0802.1367%2C0802.1947%2C0802.4187%2C0802.3451%2C0802.2526%2C0802.3003%2C0802.0141%2C0802.0176%2C0802.1411%2C0802.3895%2C0802.2797%2C0802.4323%2C0802.2918%2C0802.4275%2C0802.2571%2C0802.2758%2C0802.2739%2C0802.2696%2C0802.4338%2C0802.2305%2C0802.0539%2C0802.0086%2C0802.2238%2C0802.1571%2C0802.2160%2C0802.1734%2C0802.2090%2C0802.1965%2C0802.1228%2C0802.1305%2C0802.1368%2C0802.2720%2C0802.2552%2C0802.1200%2C0802.0939%2C0802.3547%2C0802.0605%2C0802.3876%2C0802.1059%2C0802.1909%2C0802.1881%2C0802.1233%2C0802.1542%2C0802.0793%2C0802.0383%2C0802.3758%2C0802.1393%2C0802.1636%2C0802.4207%2C0802.4449%2C0802.2529%2C0802.0126%2C0802.2832%2C0802.0358%2C0802.1524%2C0802.0573%2C0802.0708%2C0802.0889%2C0802.3084%2C0802.0841%2C0802.0452%2C0802.3077%2C0802.2955%2C0802.2367%2C0802.2378%2C0802.2249%2C0802.0925%2C0802.2921%2C0802.0400%2C0802.1266&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "A Second Look at the Metal Line Variability of G29-38"}, "summary": "The pulsating white dwarf G29-38 possesses a dust disk and metal lines\nattributed to the accretion of its disk material. \\citet{vonhipg29} have\nreported variability in the equivalent width of G29-38's CaII K line on the\ntimescale of days. We use high resolution optical spectroscopy of G29-38's CaII\nK line to test this observation. Over six days spanning in June 2007 and\nOctober 2007 we see no evidence for variability in the equivalent width of the\nCa II K line. We also sample the variability of the Ca II K line over\nintegrated timescales of $\\sim$100-500 seconds, where errors from incomplete\ncoverage of pulsation modes are predicted to be $\\sim$8-15%. We find that the\nscatter of the equivalent widths over this time period is consistent with\nmeasurement errors at the 7% level, slightly weaker than predicted but within\nthe uncertainties of predictions. Weaker Ca and Mg lines observed show no\nsignificant variability on yearly timescales over ten years based on our data\nand other high resolution spectra. We conclude that further study is warranted\nto verify if the accretion onto G29-38 is variable.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0802.2841%2C0802.4175%2C0802.2959%2C0802.1462%2C0802.2691%2C0802.2524%2C0802.1171%2C0802.4358%2C0802.2301%2C0802.2183%2C0802.2839%2C0802.2016%2C0802.4247%2C0802.0445%2C0802.0427%2C0802.2164%2C0802.1499%2C0802.3052%2C0802.1827%2C0802.4044%2C0802.0142%2C0802.2828%2C0802.3086%2C0802.1198%2C0802.4397%2C0802.1842%2C0802.3421%2C0802.3504%2C0802.0344%2C0802.0712%2C0802.4309%2C0802.1367%2C0802.1947%2C0802.4187%2C0802.3451%2C0802.2526%2C0802.3003%2C0802.0141%2C0802.0176%2C0802.1411%2C0802.3895%2C0802.2797%2C0802.4323%2C0802.2918%2C0802.4275%2C0802.2571%2C0802.2758%2C0802.2739%2C0802.2696%2C0802.4338%2C0802.2305%2C0802.0539%2C0802.0086%2C0802.2238%2C0802.1571%2C0802.2160%2C0802.1734%2C0802.2090%2C0802.1965%2C0802.1228%2C0802.1305%2C0802.1368%2C0802.2720%2C0802.2552%2C0802.1200%2C0802.0939%2C0802.3547%2C0802.0605%2C0802.3876%2C0802.1059%2C0802.1909%2C0802.1881%2C0802.1233%2C0802.1542%2C0802.0793%2C0802.0383%2C0802.3758%2C0802.1393%2C0802.1636%2C0802.4207%2C0802.4449%2C0802.2529%2C0802.0126%2C0802.2832%2C0802.0358%2C0802.1524%2C0802.0573%2C0802.0708%2C0802.0889%2C0802.3084%2C0802.0841%2C0802.0452%2C0802.3077%2C0802.2955%2C0802.2367%2C0802.2378%2C0802.2249%2C0802.0925%2C0802.2921%2C0802.0400%2C0802.1266&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "The pulsating white dwarf G29-38 possesses a dust disk and metal lines\nattributed to the accretion of its disk material. \\citet{vonhipg29} have\nreported variability in the equivalent width of G29-38's CaII K line on the\ntimescale of days. We use high resolution optical spectroscopy of G29-38's CaII\nK line to test this observation. Over six days spanning in June 2007 and\nOctober 2007 we see no evidence for variability in the equivalent width of the\nCa II K line. We also sample the variability of the Ca II K line over\nintegrated timescales of $\\sim$100-500 seconds, where errors from incomplete\ncoverage of pulsation modes are predicted to be $\\sim$8-15%. We find that the\nscatter of the equivalent widths over this time period is consistent with\nmeasurement errors at the 7% level, slightly weaker than predicted but within\nthe uncertainties of predictions. Weaker Ca and Mg lines observed show no\nsignificant variability on yearly timescales over ten years based on our data\nand other high resolution spectra. We conclude that further study is warranted\nto verify if the accretion onto G29-38 is variable."}, "authors": ["J. H. Debes", "M. Lopez-Morales"], "author_detail": {"name": "M. Lopez-Morales"}, "author": "M. Lopez-Morales", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1086/587550", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/0802.2552v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0802.2552v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "14 pages, 4 figures, Accepted to ApJL", "arxiv_primary_category": {"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0802.2552v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0802.2552v1", "journal_reference": null, "doi": "10.1086/587550", "fulltext": "A Second Look at the Metal Line Variability of G29-381\nJohn H. Debes2 & Mercedes López-Morales2,3\n\narXiv:0802.2552v1 [astro-ph] 18 Feb 2008\n\nABSTRACT\nThe pulsating white dwarf G29-38 possesses a dust disk and metal lines attributed to the accretion of its disk material. von Hippel & Thompson (2007)\nhave reported variability in the equivalent width of G29-38's CaII K line on the\ntimescale of days. We use high resolution optical spectroscopy of G29-38's CaII\nK line to test this observation. Over six days spanning in June 2007 and October\n2007 we see no evidence for variability in the equivalent width of the Ca II K line.\nWe also sample the variability of the Ca II K line over integrated timescales of\n∼100-500 seconds, where errors from incomplete coverage of pulsation modes are\npredicted to be ∼8-15%. We find that the scatter of the equivalent widths over\nthis time period is consistent with measurement errors at the 7% level, slightly\nweaker than predicted but within the uncertainties of predictions. Weaker Ca\nand Mg lines observed show no significant variability on yearly timescales over\nten years based on our data and other high resolution spectra. We conclude that\nfurther study is warranted to verify if the accretion onto G29-38 is variable.\nSubject headings: stars:individual(G 29-38)–circumstellar disks\n\n1.\n\nIntroduction\n\nG29-38 is a fascinating white dwarf. It is at a distance of 14 pc (van Altena et al.\n2001), it pulsates (Kleinman 1998), it shows an atmosphere polluted with Ca, Mg, and Fe\n(Koester et al. 1997), and it posseses an infrared excess attributed to a dust disk within\nits tidal disruption radius (Zuckerman & Becklin 1987; Jura 2003; Reach et al. 2005). Since\ntidally disrupted planetesimals are a likely explanation for the dust disk and G29-38's metal\n1\n\nBased on data gathered with the 6.5 meter Magellan Telescopes located at Las Campanas Observatory,\nChile\n2\n\nCarnegie Institution of Washington, Department of Terrestrial Magnetism,\n5241 Broad Branch Rd. NW, Washington D.C., 20015, USA\n3\n\nHubble Fellow\n\n\f–2–\npollution, it is tempting to speculate on the presence of a planet or planets perturbing\nobjects close to the white dwarf (Debes & Sigurdsson 2002). This perturbation, which could\nbe constant, periodic, or stochastic, may cause variability in the amount of material that\ndrizzles onto the atmosphere of G29-38 from the disk.\nSeveral factors complicate the search for accretion variability in G29-38. G29-38 is a\nZZ Ceti pulsator at the cool end of the DA variability strip, with peak-to-peak continuum\nchanges of a few percent (Winget et al. 1990; Kleinman 1998). These pulsations change over\nmonthly to yearly timescales, but the dominant modes tend to be around 600 s. Spectroscopic determination of its fundamental atmospheric parameters, i.e. Tef f and log g (cgs),\nare uncertain due to the pulsations. For example, (Koester & Wilken 2006) find Tef f =\n12,900 K and log g = 7.9, while (Bergeron et al. 2004) find Tef f = 11,820 K and log g\n= 8.14. Accurate determination of the temperature and gravity is important in the case\nof G29-38, since diffusion calculations show orders of magnitude different settling times\nbetween 9000 K and 14000 K (see Figure 2 in Koester & Wilken (2006)). With the two\ndifferent measurements, G29-38's predicted settling timescale would vary between 4 and 7\ndays. However, further uncertainties may be present for pulsators. Empirical observations\nof equivalent width variations can directly probe diffusion calculations\nvon Hippel & Thompson (2007, hereafter vHT07) investigated the equivalent width\nvariability of the strong CaII K line by compiling all spectroscopic observations of G2938 from 1996-2000. This data included low resolution datasets used to monitor variability in\nthe line-of-sight velocities and line profiles of hydrogen lines arising from G29-38's pulsations\n(van Kerkwijk et al. 2000; Thompson 2006). This variability is correlated with pulsations of\nthe white dwarf and are shorter than the settling time for metals (Koester & Wilken 2006).\nvHT07 found a significant dip in the equivalent width of the CaII K line of G29-38 between\n1997 and 1999, from averages of the two low-resolution datasets. The measured equivalent\nwidth went from 167±4 mÅ to 280±8 mÅ. They attributed this dip to a change in accretion\nrate, but vHT07 were cautious about the effect of the pulsations on variability of the Ca line\nstrength. They used an analysis of their time series spectra to estimate the effect incomplete\ncoverage pulsations may have on theline strength. They estimated that for observations less\nthan an hour, errors due to pulsations would be less than 5%. However, shorter exposure\ntimes were more sensitive to incomplete pulsation coverage; with errors ranging from 8% for\na ten minute exposure to a 13% error for a five minute exposure were possible. Based on\ntheir time series analysis, they concluded that the CaII K line strength changes they observed\nwere not due to pulsations. vHT07 subsequently combined the two low resolution datasets\nwith several other high resolution spectroscopic observations spanning between 1996 and\n2000 and predicted that the CaII K line must be variable on timescales as short as fifteen\ndays.\n\n\f–3–\nTo test for further variability, we observed G29-38 in two multi-day runs separated by\nfour months for a total of 19 individual observations with exposure times ranging from 100 to\n500 seconds. All individual observations are short enough to determine the extent of possible\nsystematic errors introduced by pulsations. When averaged together, each run covers enough\ntime (∼40 minutes) to average over potential pulsations and get an idea of the true average\nstrength of the line. We therefore expected that our data in aggregate would be accurate to\nless than a few percent, but we expected that any single observation might vary by as much\nas 7-13%. The observations, data analysis, and our conclusions are detailed in the following\nsections of this paper.\n\n2.\n\nObservations\n\nWe observed G29-38 with the blue chip of the MIKE spectrograph (Bernstein et al.\n2003) installed at the 6.5-m Magellan Clay Telescope at Las Campanas Observatory (Chile).\nSix spectra were collected on UT 2007 June 25–26 and another 13 spectra on UT 2007\nOctober 24-27. Both runs used a 0.′′ 7×5.′′ 0 slit, yielding an average spectral resolution of R =\n40000 at 3933 Å. The spectra cover wavelengths between 3335 and 5120 Å. Typically three\nobservations were taken per night with the exception of 24 October, where one 100s exposure\nwas taken and then three 200s exposures. The exposure times in June were determined by\npoor (1′′ -1.′′ 3) seeing and were between 300 and 500 seconds, whereas spectacular (∼0.′′ 5)\nseeing conditions were present for the first two nights of the October run, followed by nominal\nseeing (∼0.′′ 8) the last two nights, allowing shorter exposure times. The signal-to-noise of\neach exposure is roughly 25, for each night is roughly 50, and for the averages between runs\nis about 80.\nThe data were extracted and flatfielded using the MIKE reduction pipeline written by\nD. Kelson, with methodology described in Kelson et al. (2000), Kelson (2003), and Kelson\n(2007). All six individual spectra from the June run, 2400 seconds in total, and all thirteen\nindividual spectra from the October run, 2500 seconds in total, were combined into averaged\nspectra for each run to search for weak lines other than Ca. An example of the fidelity of\nthese combined spectra is presented in Figure 1.\nAbsorption lines from Mg II, Ca I, and Ca II were detected. In particular, the Ca II K\nline and the Mg II λ4481 line fell on two different orders, a feature that we took advantage\nof to minimize systematic errors in the determination of the equivalent widths. Other lines\nfrom Mg I were detected at 3830, 3833, and 3838Å. Ca I was detected at 4227Å, and the Ca\nII H line and another Ca II line at 3737Å were similarly detected.\n\n\f–4–\nIn order to claim variability in a measured equivalent width, a careful examination of\nthe measurement procedure and an accounting of systematic errors must be done. This step\nis important to robustly compare observations done at different telescopes (see §3). To this\nend we developed a method for measuring the equivalent width of a line while ensuring that\nall the line optical depth was measured and that all systematic errors were accounted for.\nInspection of the average spectra from June and October show that the line profile differs\nbetween the two nights and that the lines deviate from pure Gaussian shapes (See Fig 1).\nThe variable profile and slightly asymmetric wings may be caused by shifting velocity fields\non the WD surface (Koester & Kompa 2007). We decided to directly integrate the line\nprofile from the data, rather than fitting the line with a Gaussian and missing contributions\nto th equivalent width.\nThe continuum of some lines is affected by curvature introduced by the proximity of\nstrong hydrogen Balmer lines. That curvature is removed by fitting a high order polynomial. The choice of how to fit the continuum and the size of the continuum window to use\ncan introduce systematic errors in the equivalent width. We used a polynomial fit to the\ncontinuum with a window of at least ±5Å on each side of the line center. To account for\nthe systematic errors, we measured the equivalent width over all combinations of window\nsize from ±5Å to ±10Å and polynomial fits ranging from third to twelfth order. We took\nthe median measure of the equivalent width and the sum in quadrature of the measured\nstandard deviation of measurements (the systematic error) and the estimated error due to\nsignal-to-noise.\nAn appropriate window around a line must be chosen to accurately measure the total\nequivalent width. We determined an optimal window by measuring the equivalent width for\nthe averaged spectra from each run using a range of window sizes. Once the continuum is\nfitted, the equivalent width will peak at a radial distance from the line center where the line\nno longer contributes. In the particular case of the CaII K line, we determined this distance\nto be ±1.2–1.5 Å.\nIn addition to the Ca II K line, we measured the equivalent width for some of the\nweaker lines we detected, Mg II λ4481, Ca I λ4227, and the Ca II H line. For these lines, we\nrestricted ourselves to the averages of the two runs.\n\n3.\n\nTesting Metal Line Variability\n\nFigure 2 shows the equivalent width of the CaII K line from each exposure, in order of\nascending sequential observation, i.e. the first spectrum taken in June is observation 1 and\n\n\f–5–\nthe last spectrum in October is observation 19. Each night has a specific symbol on the plot.\nWe find that the equivalent width of the CaII K line is stable over the time period\nwe observed G29-38. The standard deviation of all 19 measurements is 20 mÅ, while the\nmedian estimated error of the measurements is 20 mÅ. These results suggest that if there is\nvariability due to pulsations for these spectra it is < 7%. This is less than a factor of two\nlower than that predicted by vHT07. We can then add observations over a small number\nof pulsational periods to increase signal-to-noise without fear of being subject to systematic\nerrors.\nAveraging the two runs gives equivalent widths of 262±9 mÅ and 269±7 mÅ for the\nJune and October runs, respectively. These values are thus consistent with no variation in\nline strength over 4 months at the 2% level. If short term variability occurred between the\ntwo measurements we would not have detected it. This implies that the underlying source of\naccretion is steady. Table 1 shows the results for our June and October runs (MJD 54278.5\nand 54399.1, respectively) for all species measured.\nIt is relevant to revisit whether there has been significant variation of the equivalent\nwidth of the CaII K line or any of the other lines since 1997, the dates of the last published\nvalues. There exist eight other measurements, mentioned in vHT07, including results from\nKoester et al. (1997),Zuckerman et al. (2003), and Koester & Wilken (2006). Excluding the\nlow resolution data from vHT07, we are left with six high resolution spectra of G29-38 in\naddition to our own data. Of the six, three are from the Keck Observatory and are publicly\navailable (see Zuckerman et al. 2003), while two spectra from the ESO VLT were kindly\nprovided by D. Koester. We disregard the discovery equivalent width due to its large error.\nWe re-measured the equivalent width of the CaII K line using the same method described\nin §2, and compared the new values to our data. Figure 3 shows the results, including the low\nresolution data reported in vHT07. Neglecting the two low resolution points, the median of\nthe seven high resolution observations is 262 mÅ, with a standard deviation of 7.6 mÅ and a\nmedian measurement error of 10.6 mÅ. With the exception of the low resolution points, the\nunderlying source of accretion for G29-38 is incredibly stable over a timescale of 10 years.\nIf we add the reported measurements of the low resolution data, the 1997 point remains\nsignificantly discrepant. We compare the 1999.65 point with the median and find that it\nis consistent at < 2σ. However, as noted in §4, our measured equivalent widths are higher\non average than vHT07's and so the 1999.65 point may also be discrepant if we were to\nremeasure that data.\nWe also measured the equivalent widths of the other three metal lines in the Keck and\nVLT data. The results, combined with our data, are shown in Figure 4. Similar to the\n\n\f–6–\nstrong Ca II K line, these weaker lines detected in G29-38 show no variability. The Mg II\nλ4481 line is visible in our data as well as the Keck data, but it is not reliably detected in\nthe VLT data due to insufficient resolution. Over the five available observations this line\nis stable at a 12% level, with a median equivalent width of 44±6 mÅ. The Ca I λ4427 line\nwas also detected in our data and the Keck data, but was not detected in the VLT data for\nthe same reason as the MgI line above. Over the five available observations, the Ca I line\nequivalent width is 23±3 mÅ, and is stable at a 13% level. Finally, we measured the Ca II\nH line, which resides in the wings of the Hǫ line. This line also has a stable equivalent width\nof 55±5 mÅover ten years at a 10% level. This line was detected in all the availale data.\nThe results can be found in Table 1\nGiven optically thin conditions for the CaII H and K lines, their strength should be\nin the ratio of H to K of 1:2. We plot the observed line ratios over the Keck, VLT, and\nMagellan data in the bottom diagram in Figure 4 ( The ratio is 22±2%, which can be\nexplained by additional opacity at the H line due to the Hǫ line wings (D. Koester 2007,\npersonal communication).\n\n4.\n\nConclusions\n\nWe have shown that G29-38's Ca II K line has not significantly varied recently, or\nover the past decade, with the exception of one or possibly two observations. A stable\nresult is also obtained for the other metal lines Mg II λ4481, Ca I λ4427, and CaII H.\nWe see no evidence for systematic errors due to pulsations at around the 7% level in our\nobservations, slightly at odds with the predictions of vHT07. However, G29-38's modes are\nvariable in both period and strength, while vHT07 calculated errors for a worst case scenario\ninvolving strong pulsations. The last measurements of G29-38's pulsations that we are aware\nof occurred in 2005 and the strongest modes had flux variations of ∼1%, whereas the flux\nvariations reported for vHT07's low resolution data were ∼3% (M. Montgomery 2008, private\ncommunication). It is therefore not surprising that we don't see evidence for errors due to\npulsations. Other calculations of equivalent width variability due to pulsations also predict\nerrors at the level of 10%, suggesting that when accounted for, these errors have minimal\nimpact on long term observations (Koester & Kompa 2007).\nOne point to note is the different values that we derive in our measurement of the\narchival equivalent widths when compared to those obtained by vHT07. Those differences\ncome from the different techniques used in the mesurement of the equivalent width and in\nthe continuum fitting, which highlights the need for a consistent method when comparing\nobservations from different sources. The fact that our method produces on average larger\n\n\f–7–\nequivalent widths than those reported by vHT07 can be related to incorrect accounting for\nline flux in the wide wings of the CaII K line profile when using Gaussian fits.\nSince the low resolution data are the only points that deviate more than a few percent\nfrom the median equivalent width value, it is important to determine whether low resolution\nobservations could give spurious results at levels greater than their measured errors. The\nlack of any flatfielding in vHT07, as well as changes in the wings of the Hǫ line may all\naffect continuum fitting, something that low resolution data will be more sensitive to. To\ntest this hypothesis, we rebinned our data down to different resolutions that approach the 78Ålevel used in vHT07 to see if we could recover the same equivalent width using our method\noutlined above. At this level of rebinning, our S/N exceeded that reported in vHT07. We\nused a window for measuring the equivalent width of 10Åcentered on the line and fit the\ncontinuum with 10Å on either side of the window. We tried resolutions that ranged from\n0.04 Åto 4 Å. We find for the average spectrum of our October data that the measured\nequivalent widths at the lowest resolutions deviated significantly from our measured value at\nhigh resolution, going as low as 140 mÅ to as high as 350 mÅ. At resolutions less than 0.1 Å,\nour results converge to within 1σ of our previously measured value. It is impossible to tell\nif vHT07's data suffers from a similar problem, but high resolution, high S/N confirmation\nof this variability is desired.\nWhether the accretion onto G29-38 varies or not, the idea of variable accretion onto\nwhite dwarfs is an interesting line of study. Spectroscopic monitoring of DAZs with close\ncompanions and short settling times offers an interesting insight into the stellar wind behavior\nof M dwarfs (Debes 2006), while variability in single DAZs may conceivably determine the\nsource of material that pollutes the surface of these white dwarfs. Both types of polluted\nwhite dwarfs directly test models of white dwarf diffusion times. Few DAZs have been\nmonitored in a systematic way, but the MIKE spectrograph provides a sensitive and stable\nplatform with which to do long term studies.\nMLM acknowledges support provided by NASA through Hubble Fellowship grant HF01210.01-A awarded by the Space Telescope Science Institute, which is operated by the\nAssociation of Universities for Research in Astronomy, Inc., for NASA, under contract NAS526555.\n\nREFERENCES\nBergeron, P., Fontaine, G., Billères, M., Boudreault, S., & Green, E. M. 2004, ApJ, 600, 404\n\n\f–8–\nBernstein, R., Shectman, S. A., Gunnels, S. M., Mochnacki, S., & Athey, A. E. 2003, in\nPresented at the Society of Photo-Optical Instrumentation Engineers (SPIE) Conference, Vol. 4841, Instrument Design and Performance for Optical/Infrared Groundbased Telescopes. Edited by Iye, Masanori; Moorwood, Alan F. M. Proceedings of\nthe SPIE, Volume 4841, pp. 1694-1704 (2003)., ed. M. Iye & A. F. M. Moorwood,\n1694–1704\nDebes, J. H. 2006, ApJ, 652, 636\nDebes, J. H. & Sigurdsson, S. 2002, ApJ, 572, 556\nJura, M. 2003, ApJ, 584, L91\nKelson, D. D. 2003, PASP, 115, 688\n-. 2007, PASP, submitted\nKelson, D. D., Illingworth, G. D., van Dokkum, P. G., & Franx, M. 2000, ApJ, 531, 159\nKleinman, S. J. e. a. 1998, Astrophys. J., 495, 424\nKoester, D. & Kompa, E. 2007, A&A, 473, 239\nKoester, D., Provencal, J., & Shipman, H. L. 1997, A&A, 320, L57\nKoester, D. & Wilken, D. 2006, A&A, 453, 1051\nReach, W. T., Kuchner, M. J., von Hippel, T., Burrows, A., Mullally, F., Kilic, M., &\nWinget, D. E. 2005, ApJ, 635, L161\nThompson, S. E. 2006, in Astronomical Society of the Pacific Conference Series, Vol. 352,\nNew Horizons in Astronomy: Frank N. Bash Symposium, ed. S. J. Kannappan, S. Redfield, J. E. Kessler-Silacci, M. Landriau, & N. Drory, 289–+\nvan Altena, W. F., Lee, J. T., & Hoffleit, E. D. 2001, VizieR Online Data Catalog, 1238, 0\nvan Kerkwijk, M. H., Clemens, J. C., & Wu, Y. 2000, MNRAS, 314, 209\nvon Hippel, T. & Thompson, S. E. 2007, ApJ, 661, 477\nWinget, D. E., et al. 1990, ApJ, 357, 630\nZuckerman, B. & Becklin, E. E. 1987, Nature, 330, 138\nZuckerman, B., Koester, D., Reid, I. N., & Hünsch, M. 2003, ApJ, 596, 477\n\n\f–9–\n\nThis preprint was prepared with the AAS LATEX macros v5.2.\n\n\f– 10 –\n\nTable 1. Equivalent Width Measurements\nMJD\n\nCa II K\n(mÅ)\n\nCa II H\n(mÅ)\n\nCa I\n(mÅ)\n\nMg I\n(mÅ)\n\n50636.577\n51158.200\n51403.463\n51762.681\n51804.670\n54278.500\n54399.100\n\n268±15\n256±9\n248±11\n232±12\n239±7\n262±9\n269 ±7\n\n60±16\n48±10\n55±5\n57±13\n51±6\n50±15\n61±9\n\n24±5\n18±5\n23±2\n\n35±11\n47±17\n44±7\n\n26±4\n23±2\n\n51±20\n43±7\n\n\f– 11 –\n\n1.2\nJune 2007\n\nNormalized Fλ\n\n1.0\n0.8\n0.6\n\nOctober 2007\n\n0.4\n0.2\n0.0\n3930\n\n3932\n3934\n3936\nWavelength (Å)\n\n3938\n\nFig. 1.- Comparison of the CaII K line in G29-38 from the combined spectra between the\nJune 2007 and October 2007 Magellan runs.\n\n\f– 12 –\n\n25−Jun−2007\n26−Jun−2007\n\nEQW (mÅ)\n\n300\n\n250\n\n200\n\n24−Oct−2007\n25−Oct−2007\n26−Oct−2007\n27−Oct−2007\n\n150\n0\n\n5\n\n10\nObservation\n\n15\n\n20\n\nFig. 2.- Equivalent width of G29-38's CaII K line from each observation in our June and\nOctober 2007 runs. The first six points are from theJune run and exposure times range\nbetween 300 and 500 sec in duration, while the last 13 points are from the October run.\nExposure times in this case range betweem 100 and 200 seconds. The median of all the\nobservations, 264±20mÅ, is represented by the horizontal solid line.\n\n\f– 13 –\n\n300\n\nEQW (mÅ)\n\n250\n\n200\n\n150\n1996 1998 2000 2002 2004 2006 2008\nEpoch (Year)\nFig. 3.- Equivalent width of G29-38's CaII K line spanning the past decade. Squares are\nfrom high resolution data, while diamonds are from low resolution data. The horizontal line\nindicates the median of all the observations, not including the low resolution data reported\nin vHT07.\n\n\f– 14 –\n\nMg II EQW (mÅ)\n\n70\n60\n50\n40\n30\n\nCa I EQW (mÅ)\n\n20\n30\n25\n20\n15\n\nCa II H to K Ratio\n\n10\n0.30\n0.25\n0.20\n0.15\n0.10\n1998\n\n2000\n\n2002\n2004\nEpoch (Year)\n\n2006\n\n2008\n\nFig. 4.- (Top) Plot of measured Mg II λ4481 line equivalent width, horizontal line is median\nvalue of 44±6 mÅ. (Middle) Plot of measured Ca I λ4427 line equivalent width,horizontal\nline is median value of 23±3 mÅ. (Bottom) Plot of measured CaII H to K equivalent width\nratios for G29-38, horizontal line is median value of 0.22±0.02\n\n\f"}