{"id": "http://arxiv.org/abs/1009.1902v1", "guidislink": true, "updated": "2010-09-09T22:18:30Z", "updated_parsed": [2010, 9, 9, 22, 18, 30, 3, 252, 0], "published": "2010-09-09T22:18:30Z", "published_parsed": [2010, 9, 9, 22, 18, 30, 3, 252, 0], "title": "Quantitative measurement of the surface charge density", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1009.4676%2C1009.1288%2C1009.4209%2C1009.5744%2C1009.6125%2C1009.5791%2C1009.3661%2C1009.5158%2C1009.3539%2C1009.3930%2C1009.1375%2C1009.0509%2C1009.4967%2C1009.4506%2C1009.1249%2C1009.0993%2C1009.3637%2C1009.0213%2C1009.2114%2C1009.5231%2C1009.1636%2C1009.4660%2C1009.5695%2C1009.3705%2C1009.5160%2C1009.3448%2C1009.1725%2C1009.1178%2C1009.0067%2C1009.4607%2C1009.1293%2C1009.4603%2C1009.0990%2C1009.6206%2C1009.2947%2C1009.2310%2C1009.3172%2C1009.2609%2C1009.4573%2C1009.5277%2C1009.3644%2C1009.2500%2C1009.2062%2C1009.1882%2C1009.4103%2C1009.4083%2C1009.1967%2C1009.4963%2C1009.5404%2C1009.5931%2C1009.4484%2C1009.4894%2C1009.5318%2C1009.5228%2C1009.4059%2C1009.5393%2C1009.1926%2C1009.1515%2C1009.6050%2C1009.1423%2C1009.5835%2C1009.5398%2C1009.3236%2C1009.4033%2C1009.1050%2C1009.4601%2C1009.4882%2C1009.3585%2C1009.3176%2C1009.0956%2C1009.0223%2C1009.0116%2C1009.1772%2C1009.1838%2C1009.0406%2C1009.2515%2C1009.1229%2C1009.1902%2C1009.2624%2C1009.3091%2C1009.4172%2C1009.5784%2C1009.4245%2C1009.1859%2C1009.5697%2C1009.3839%2C1009.5672%2C1009.3308%2C1009.2381%2C1009.1220%2C1009.5862%2C1009.1040%2C1009.6054%2C1009.1492%2C1009.5285%2C1009.5643%2C1009.4909%2C1009.1496%2C1009.4498%2C1009.5002%2C1009.3404&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Quantitative measurement of the surface charge density"}, "summary": "We present a method of measuring the charge density on dielectric surfaces.\nSimilar to electrostatic force microscopy we record the electrostatic\ninteraction between the probe and the sample surface, but at large tip-sample\ndistances. For calibration we use a pyroelectric sample which allows us to\nalter the surface charge density by a known amount via a controlled temperature\nchange. For proof of principle we determined the surface charge density under\nambient conditions of ferroelectric lithium niobate.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1009.4676%2C1009.1288%2C1009.4209%2C1009.5744%2C1009.6125%2C1009.5791%2C1009.3661%2C1009.5158%2C1009.3539%2C1009.3930%2C1009.1375%2C1009.0509%2C1009.4967%2C1009.4506%2C1009.1249%2C1009.0993%2C1009.3637%2C1009.0213%2C1009.2114%2C1009.5231%2C1009.1636%2C1009.4660%2C1009.5695%2C1009.3705%2C1009.5160%2C1009.3448%2C1009.1725%2C1009.1178%2C1009.0067%2C1009.4607%2C1009.1293%2C1009.4603%2C1009.0990%2C1009.6206%2C1009.2947%2C1009.2310%2C1009.3172%2C1009.2609%2C1009.4573%2C1009.5277%2C1009.3644%2C1009.2500%2C1009.2062%2C1009.1882%2C1009.4103%2C1009.4083%2C1009.1967%2C1009.4963%2C1009.5404%2C1009.5931%2C1009.4484%2C1009.4894%2C1009.5318%2C1009.5228%2C1009.4059%2C1009.5393%2C1009.1926%2C1009.1515%2C1009.6050%2C1009.1423%2C1009.5835%2C1009.5398%2C1009.3236%2C1009.4033%2C1009.1050%2C1009.4601%2C1009.4882%2C1009.3585%2C1009.3176%2C1009.0956%2C1009.0223%2C1009.0116%2C1009.1772%2C1009.1838%2C1009.0406%2C1009.2515%2C1009.1229%2C1009.1902%2C1009.2624%2C1009.3091%2C1009.4172%2C1009.5784%2C1009.4245%2C1009.1859%2C1009.5697%2C1009.3839%2C1009.5672%2C1009.3308%2C1009.2381%2C1009.1220%2C1009.5862%2C1009.1040%2C1009.6054%2C1009.1492%2C1009.5285%2C1009.5643%2C1009.4909%2C1009.1496%2C1009.4498%2C1009.5002%2C1009.3404&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We present a method of measuring the charge density on dielectric surfaces.\nSimilar to electrostatic force microscopy we record the electrostatic\ninteraction between the probe and the sample surface, but at large tip-sample\ndistances. For calibration we use a pyroelectric sample which allows us to\nalter the surface charge density by a known amount via a controlled temperature\nchange. For proof of principle we determined the surface charge density under\nambient conditions of ferroelectric lithium niobate."}, "authors": ["Florian Johann", "Elisabeth Soergel"], "author_detail": {"name": "Elisabeth Soergel"}, "author": "Elisabeth Soergel", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1063/1.3269606", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1009.1902v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1009.1902v1", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "cond-mat.mtrl-sci", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cond-mat.mtrl-sci", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1009.1902v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1009.1902v1", "arxiv_comment": null, "journal_reference": "Appl. Phys. Lett. 95, 232906 (2009)", "doi": "10.1063/1.3269606", "fulltext": "APS/123-QED\n\nQuantitative Measurement of the Surface Charge Density\nFlorian Johann and Elisabeth Soergel∗\nInstitute of Physics, University of Bonn,\n\narXiv:1009.1902v1 [cond-mat.mtrl-sci] 9 Sep 2010\n\nWegelerstrasse 8, 53115 Bonn, Germany\n\nAbstract\nWe present a method of measuring the charge density on dielectric surfaces. Similar to electrostatic force microscopy we record the electrostatic interaction between the probe and the sample\nsurface, but at large tip-sample distances. For calibration we use a pyroelectric sample which\nallows us to alter the surface charge density by a known amount via a controlled temperature\nchange. For proof of principle we determined the surface charge density under ambient conditions\nof ferroelectric lithium niobate.\nPACS numbers: 77.70.+a, 07.79.-v, 77.84.Dy\n\n∗\n\nElectronic address: soergel@uni-bonn.de\n\n1\n\n\fThe measurement of charge densities on dielectric surfaces have been investigated for more\nthen fifty years [1]. Initially driven by the investigation of electrets [2] the determination\nof surface charge densities (SCD) has become a vivid area of research, e. g., in semiconductors [3], liquid crystals [4] or hybrid materials [5]. Quantitative data of the SCD can provide\nmaterial specific properties such as information on lattice disruptions, an estimate on the\ndegree of alignment or a further insight into the interaction on the micro-scale in compositions. In addition, SCD measurements allow for the investigation of screening mechanisms\non a quantitative level. Measuring the SCD is generally performed by means of non-contact\nelectrical characterization techniques. In case of semiconductors on can take advantage of\nthe surface photovoltage effect to determine the SCD [6–8]. Because this technique relies\non the generation of electron-hole pairs by illumination, it can not be applied to every material. A more general method to measure SCD is the vibrating probe technique which was\nintroduced in the 1960s [9] and later developed towards a scanning technique [10]. Here an\nelectrode of known area is vibrated in the electric field generated by the charged surface\nto produce a signal which is proportional to the SCD. Several methods based on capacitive\nprobe for surface charge measurements have been discussed since. They all suffer from the\nmandatory knowledge of the capacity of the system which in general requires assumptions\non the geometrical shape of all participating components.\nElectrostatic force microscopy (EFM) is a very powerful tool for imaging charge distributions on dielectric surfaces [11]. Because it is very sensitive, this technique allows the\ndetection of single charges [12] with a high lateral resolution in the nm-regime [13]. Although appropriate when used for mapping surface charge distributions, EFM, however, is a\npriori not applicable for quantitatively determining surface charge densities, again because it\nwould require the exact knowledge of the shape of the probe. When investigating charge distributions extending only some ten nanometers, the probe can be approximated by a sphere\nof radius r and an estimate on the magnitude of the surface charge can be obtained [14].\nThis model, however, applies if and only if the dimensions of the charge distributions to be\nmeasured are of the order of the tip radius.\nWhen investigating SCD the simple model approximating the probe by a sphere does not\napply any more since in general the spatial extend of the charging is large when compared\nto the size of the probe. Explicitly the interaction between the cantilever and the sample\nsurface is no longer negligible. Thus for the quantitative analysis of EFM signals obtained\n2\n\n\fwith homogeneously charged surfaces one has to take into account the whole probe. This is\ninsofar difficult as the probe is geometrically complex. The cantilever for instance can not\nbe approximated by a beam of a certain length and width because the edges, carrying a high\ncharge density due to their small radius of curvature, must also be taken into account. To\ndevelop a model for the situation of a conducting probe above a charged surface that allows\nfor quantitative conclusions is obviously very challenging.\nIn this contribution, we present a possibility to quantitatively determine the surface\ncharge density on dielectric surfaces by means of a technique similar to EFM circumventing\nthe above mentioned difficulties. The key is to calibrate the entire system including the\nwhole probe, and hence to avoid any assumptions on its exact geometry. We were thus able\nto quantitatively determine the surface charge density of ferroelectric lithium niobate under\nambient conditions.\nThe experiments were carried out with a commercial scanning force microscope (SMENA\nfrom NT-MDT) with an alternating voltage of Vac = 10 Vpp at a frequency of some 10 kHz\napplied to the conducting tip (DCP11 from NT-MDT). The electrostatic interaction between\nthe periodically charged tip and the surface charges to be detected leads to oscillations of the\ncantilever that are read out via a lock-in amplifier. For a smooth tip-sample coarse approach\nwe upgraded the SFM with a piezoelectric transducer element that allows for controlled\ndistance changes over a range of 50 μm. Long distance tip-sample approach curves were\nrecorded with the help of this additional piezo.\nThe sample was a pyroelectric crystal of large area (15 × 15 mm2 ) and 500 μm thickness. Because of their high values for the pyroelectric coefficients we chose lithium niobate (dPs /dT = −80 × 10−6 C/Km2 [15]) and lithium tantalate (dPs /dT = −190 ×\n10−6 C/Km2 [16]). A further advantage of this choice is that both materials are easily\navailable with high, optically polished surface quality.\nThe experimental setup is shown in Fig . The crystal is mounted with conductive thermopaste on top of a heater. The rear side of the crystal could therefore be grounded.\nAccording to need, we used either a temperature stabilized oven or a heating resistor for\ncontrolled temperature changes of the crystal. The temperature of the crystal was monitored with a PT100 resistance thermometer. The stabilized oven was slow, and temperature\nchanges of 1 K took several minutes, whereas with the heating resistor the crystals' temperature could be changed within few seconds.\n3\n\n\fSpecial care was taken to control the probe-sample distance. Unfortunately the standard\nnon-contact operation mode can in general not be utilized for surface charge density measurements. This is due to the fact that the electrostatic forces between tip and sample surface\nmight by far exceed the van der Waals forces between tip and sample used for non-contact\noperation. Measurements of the SCD must therefore be performed at large distance (several\nμm) from the sample surface. For long-term measurements, e. g. the temporal evolution of\nthe compensation charging, it is necessary to record data at the same probe-sample distance\nover several hours. As an additional challenge any contact between tip and sample surface\nmust be avoided since this would inevitably influence any eventual compensation charges.\nThe determination of the probe-sample distance can therefore not be based on the contact\nbetween tip and sample as a reference point. Obviously these requirements demand a very\nparticular distance control which will be described below.\nLet us review the experimental situation described above: a periodically charged probe\n(Vac = 10 Vpp ) at a distance z of several microns of large-area sample (> 100 mm2 ) carrying\na homogeneous surface charge density Q. The electrostatic force Fel acting on the probe\nin a homogeneous electric field is proportional to the capacity C of the system. Using\nthe simple model of a conductive sphere opposed to a dielectric plane, Fel follows in the\nfirst approximation a 1/z dependence [17, 18]. Although C is unknown, we can use this\ndependence to fit the data from the tip-sample approach curves according to the following\nempirical relation:\nQ\nQ\n+B =\n+B\n(1)\nz\nz0 + ∆z\nwhere Q is the SCD (to be calibrated in a later step) and B is a constant background. The\nFel (z) ∝\n\ndistance z can be separated into an unknown distance z0 and a known variation ∆z performed\nby the piezoelectric transducer during the tip-sample approach curve. A typical curve on a zcut LiNbO3 crystal is shown in Fig. . From such a measurement, it is possible to determine\nall three parameters of Eq. 1 independently, in particular the tip-sample distance z0 and\nthe surface charge density Q. The deviations at longer distances are due to an increasing\ncontribution of the cantilever to the signal with respect to that of the tip. Therefore the\nsimple sphere model does not hold any more. Since fitting is always performed with the\nsteep part of the curve, the impact of this deviation is negligible.\nThe last step for a quantitative determination of the SCD consists of the calibration of\nFel . For this purpose we took advantage of the pyroelectric effect, i. e. the possibility to\n4\n\n\falter the SCD by a known amount ∆Q via a controlled change of the temperature ∆T . The\nresults of such measurements can be seen in Fig. where we changed the temperature by\ndifferent steps ∆T < 2.5◦ C starting with T = 29◦ C. Obviously this calibration procedure\nis very reliable within the chosen temperature range. Higher steps ∆T could not be used\nbecause of the enormous SCD that built up lead to electrical discharges via the tip. We\nfurthermore changed the time ∆t over which ∆T happened from few seconds to several\nminutes, however, no change in the calibration could be observed. From this we expect any\nexternal compensation or internal relaxation mechanisms to take place on a much longer\ntime scale. To underline the reliability of our calibration procedure we also used a LiTaO3\ncrystal which has a much larger pyroelectric coefficient. The results obtained were consistent\nwithin the precision to which the pyroelectric coefficients of the materials are known.\nFinally we investigated the long-term evolution of the SCD using a single domain zcut LiNbO3 crystal. We therefore mounted the crystal on the temperature stabilized oven,\nwhich was made very steady by a copper block. We recorded Q over a timescale of three\ndays, where we changed the temperature by 1◦ C after half the time – from T0 = 30◦ C to\nT1 = 29◦ C. Figure shows the result of the measurement. For every data point we took a\ntip-sample approach curve as the one shown in Fig. to correct for any drift of the distance\nduring the measurement. From the measurement we could determine the relaxation time\nconstant to be τ ≈ 2 × 104 s and Q = 140 μC/m2 for the reached long-term surface charge\ndensity.\nThe relaxation time constant τ for compensation of the pyroelectric surface charging is\ngiven by [19]\nε * ε0\n(2)\nσ\nwhere is ε the relative permittivity of the crystal, ε0 is the permittivity of free space, and\nτ=\n\nσ is the bulk conductivity of the crystal. For congruent LiNbO3 ε = 28 and σ = 10−16 –\n10−18 (Ωcm)−1 therefore τ = 103 – 105 s. Indeed our experimental result (Fig. ) is in the\nrange of this theoretical value. This is why we suppose that a change of the surface charge\ndue to the pyroelectric effect is compensated by internal relaxation via bulk conductivity.\nIn order to verify our assumption we investigated iron-doped LiNbO3 crystals which exhibit a much higher dark conductivity [20]. As expected, the relaxation time was drastically\nshortened for higher doping levels. For very low doping of only 0.05% the relaxation time τ\ncould not be determined accurately. We explain this by the fact that the controlled tempera5\n\n\fture change of the crystal is slow, of the order of minutes, therefore substantial compensation\noccurred already during heating or cooling.\nFinally we want to comment on the measured value of Q = 140 μC/m2 for the surface\ncharge density on congruently melt, undoped z-faced LiNbO3 crystals. This value signifies\nan attenuation of the spontaneous polarization of 0.7 C/m2 by a factor of 2 × 10−4 [21].\nDifferent scenarios regarding the state of the surface charge of ferroelectric crystals have\nbeen considered and range from unscreened, partly or completely screened up to an over\nscreened scenario [22]. For the determination of the potential difference of oppositely oriented\ndomains, different techniques that probe the electrostatic state of the sample surface such as\nelectrostatic force microscopy (EFM) and scanning surface potential microscopy have been\nemployed (SSPM) [23]. Measurements, however, did not show any significant results [24].\nAlthough the value we measured might be influenced by the ambient conditions, it however\ngives the right order of magnitude for the surface charge density, as was shown by repetitive\nmeasurements. We also investigated etched surfaces, thereby excluding any drastic effect of\nthe polishing procedure on the SCD. Note that for an even more reliable value, controlled\nconditions (i.e. mainly humidity and more stable temperatures) are mandatory. It would\nbe very instructive to repeat such measurements under ultra high vacuum conditions. This,\nhowever, is beyond our possibilities.\nIn conclusion we have demonstrated a straight forward measurement scheme for quantitatively determining real surface charge densities on ferroelectric crystals. We exemplified\nour technique using a lithium niobate crystal, thereby revealing a compensation of the spontaneous polarization for the surface charge density by four orders of magnitude.\nAcknowledgements Many thanks to Akos Hoffmann and Tobias Jungk for fruitful discussions. Financial support from the Deutsche Telekom AG is gratefully acknowledged.\n\n[1] B. Gross and L. Ferreira Denard, Phys. Rev. 67, 253 (1945)\n[2] F. Gutmann, Rev. Mod. Phys. 20, 457 (1948)\n[3] C. G. B. Garrett and W. H. Brattain, Phys. Rev. 99, 376 (1955)\n[4] P. Pagliusi and G. Cipparrone, Appl. Phys. Lett. 80, 168 (2002)\n[5] S. J. Limmer and G. Cao, Adv. Mat. 15, 427 (2003)\n\n6\n\n\f[6] D.K. Schroder, Meas. Sci. Techn. 12, R16 (2001)\n[7] P. Kneschaurek, A. Kamgar, and J. F. Koch, Phys. Rev. B 14, 1610 (1976)\n[8] T. Takahashi and M. Yoshita, Appl. Phys. Lett. 70, 2162 (1997)\n[9] C. W. Reedyk and M. M. Perlman, J. Electrochem. Soc. 115, 49 (1968)\n[10] Y. Majima, Y. Oyama, and M. Iwamoto, Phys. Rev. B 62, 1971 (2000)\n[11] J. E. Stern, B. D. Terris, H. J. Mamin, and D. Rugar, Appl. Phys. Lett. 53, 2717 (1988)\n[12] C. Schönenberger and S. F. Alvarado, Phys. Rev. Lett. 65, 3162 (1990)\n[13] Ch. Sommerhalter, Th. W. Matthes, Th. Glatzel, A. Jager-Waldau, and M. Ch. Lux-Steiner,\nAppl. Phys. Lett. 75, 286 (1999)\n[14] P. M. Bridger, Z. Z. Bandić, E. C. Piquette, and T. C. McGill, Appl. Phys. Lett. 74, 3522\n(1999)\n[15] M. R. R. Gesualdi, C. Jacinto, T. Catunda, M. Muramatsu, and V. Pilla, Appl. Phys. B 93,\n879 (2008)\n[16] A. M. Glass, Phys. Rev. 172, 564 (1968)\n[17] E. Durand Electrostatique ( tome II, Masson et Cie Paris, 1966)\n[18] E. Soergel Untersuchung von Oberflächenladungen auf photorefraktiven Kristallen mit dem\nRasterkraftmikroskop (Utz Verlag, München, 1998)\n[19] G. Rosenman, D. Shur, Ya. E. Krasik, and A. Dunaevsky, J. Appl. Phys. 88, 6109 (2000)\n[20] K. Brands, M. Falk, D. Haertle, Th. Woike, and K. Buse Appl. Phys. B 91, 279 (2008)\n[21] S. H. Wemple, M. DiDomenico, Jr., and I. Camlibel, Appl. Phys. Lett. 12, 209 (1968)\n[22] Chapter 1 by S. Kalinin and D. A. Bonnell in M. Alexe and A. Gruverman, eds., Nanoscale\nCharacterisation of Ferroelectric Materials (Springer, Berlin; New York, 2004) 1st ed.\n[23] D. A. Bonnell, Scanning Probe Microscopy and Spectroscopy: Theory, techniques, and applications (Wiley-VCH, New York, 2001)\n[24] D. A. Scrymgeour and V. Gopalan, Phys. Rev. B 72, 024103 (2005)\n\n7\n\n\fFIG. 1: Schematics of the experimental setup. A scanning force microscope is operated as electrostatic force microscope with an alternating voltage Vac applied to the tip. The tip-sample distance\nz is several μm. Calibration of the setup is performed with the help of a pyroelectric crystal which\nis mounted on a stabilized oven. Upon a temperature change the surface charging σsurf is altered\nin a controlled manner.\n\nFIG. 2: Tip-sample approach curve above a z-cut LiNbO3 crystal surface recording the electrostatic\nforce Fel between probe and sample surface. Measurement and fit according to Eq. 1.\n\nFIG. 3: Calibration of the surface charge density (SCD) measurements with different temperature\nsteps ∆T (starting each time from T = 29◦ C) using a z-cut LiNbO3 crystal.\n\n8\n\n\fFIG. 4: Time evolution of the real surface charge density (SCD) on a z-cut LiNbO3 sample over\nseveral days. The relaxation of the surface charging takes place with a time constant of τ = 17.000 s.\n\n9\n\n\f"}