{"id": "http://arxiv.org/abs/0808.2561v1", "guidislink": true, "updated": "2008-08-19T09:51:42Z", "updated_parsed": [2008, 8, 19, 9, 51, 42, 1, 232, 0], "published": "2008-08-19T09:51:42Z", "published_parsed": [2008, 8, 19, 9, 51, 42, 1, 232, 0], "title": "Quantum Einstein-Rosen waves: Coherent states and n-point functions", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0808.3854%2C0808.1542%2C0808.3850%2C0808.1454%2C0808.1114%2C0808.4154%2C0808.1440%2C0808.2975%2C0808.0206%2C0808.1888%2C0808.2490%2C0808.0734%2C0808.2561%2C0808.2783%2C0808.0084%2C0808.3611%2C0808.1656%2C0808.1089%2C0808.1795%2C0808.1779%2C0808.2236%2C0808.0060%2C0808.3359%2C0808.4048%2C0808.2544%2C0808.0047%2C0808.1517%2C0808.1168%2C0808.0032%2C0808.3971%2C0808.4025%2C0808.1636%2C0808.2499%2C0808.0755%2C0808.0644%2C0808.2337%2C0808.3011%2C0808.0260%2C0808.2669%2C0808.1265%2C0808.1646%2C0808.1700%2C0808.3716%2C0808.3082%2C0808.3132%2C0808.0422%2C0808.3541%2C0808.4075%2C0808.3997%2C0808.2733%2C0808.2102%2C0808.3468%2C0808.0732%2C0808.3243%2C0808.2724%2C0808.2834%2C0808.2191%2C0808.1887%2C0808.3150%2C0808.4081%2C0808.1184%2C0808.2416%2C0808.4086%2C0808.0381%2C0808.3399%2C0808.0168%2C0808.0149%2C0808.2528%2C0808.3968%2C0808.3124%2C0808.1077%2C0808.4009%2C0808.2450%2C0808.0355%2C0808.3788%2C0808.2754%2C0808.1493%2C0808.3083%2C0808.1931%2C0808.0698%2C0808.0482%2C0808.3204%2C0808.2373%2C0808.1132%2C0808.1014%2C0808.0683%2C0808.1844%2C0808.2153%2C0808.2525%2C0808.1593%2C0808.3098%2C0808.1745%2C0808.1842%2C0808.3814%2C0808.2039%2C0808.0525%2C0808.0507%2C0808.2678%2C0808.3708%2C0808.3548%2C0808.0954&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Quantum Einstein-Rosen waves: Coherent states and n-point functions"}, "summary": "We discuss two different types of issues concerning the quantization of\nEinstein-Rosen waves. First of all we study in detail the possibility of using\nthe coherent states corresponding to the dynamics of the auxiliary, free\nHamiltonian appearing in the description of the model to study the full\ndynamics of the system. For time periods of arbitrary length we show that this\nis only possible for states that are close, in a precise mathematical sense, to\nthe vacuum. We do this by comparing the quantum evolutions defined by the\nauxiliary and physical Hamiltonians on the class of coherent states. In the\nsecond part of the paper we study the structure of n-point functions. As we\nwill show their detailed behavior differs from the one corresponding to\nstandard perturbative quantum field theories. We take this as a manifestation\nof the fact that the correct approximation scheme for physically interesting\nobjects in these models does not lead to a power series expansion in the\nrelevant coupling constant but to a more complicated asymptotic behavior.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0808.3854%2C0808.1542%2C0808.3850%2C0808.1454%2C0808.1114%2C0808.4154%2C0808.1440%2C0808.2975%2C0808.0206%2C0808.1888%2C0808.2490%2C0808.0734%2C0808.2561%2C0808.2783%2C0808.0084%2C0808.3611%2C0808.1656%2C0808.1089%2C0808.1795%2C0808.1779%2C0808.2236%2C0808.0060%2C0808.3359%2C0808.4048%2C0808.2544%2C0808.0047%2C0808.1517%2C0808.1168%2C0808.0032%2C0808.3971%2C0808.4025%2C0808.1636%2C0808.2499%2C0808.0755%2C0808.0644%2C0808.2337%2C0808.3011%2C0808.0260%2C0808.2669%2C0808.1265%2C0808.1646%2C0808.1700%2C0808.3716%2C0808.3082%2C0808.3132%2C0808.0422%2C0808.3541%2C0808.4075%2C0808.3997%2C0808.2733%2C0808.2102%2C0808.3468%2C0808.0732%2C0808.3243%2C0808.2724%2C0808.2834%2C0808.2191%2C0808.1887%2C0808.3150%2C0808.4081%2C0808.1184%2C0808.2416%2C0808.4086%2C0808.0381%2C0808.3399%2C0808.0168%2C0808.0149%2C0808.2528%2C0808.3968%2C0808.3124%2C0808.1077%2C0808.4009%2C0808.2450%2C0808.0355%2C0808.3788%2C0808.2754%2C0808.1493%2C0808.3083%2C0808.1931%2C0808.0698%2C0808.0482%2C0808.3204%2C0808.2373%2C0808.1132%2C0808.1014%2C0808.0683%2C0808.1844%2C0808.2153%2C0808.2525%2C0808.1593%2C0808.3098%2C0808.1745%2C0808.1842%2C0808.3814%2C0808.2039%2C0808.0525%2C0808.0507%2C0808.2678%2C0808.3708%2C0808.3548%2C0808.0954&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We discuss two different types of issues concerning the quantization of\nEinstein-Rosen waves. First of all we study in detail the possibility of using\nthe coherent states corresponding to the dynamics of the auxiliary, free\nHamiltonian appearing in the description of the model to study the full\ndynamics of the system. For time periods of arbitrary length we show that this\nis only possible for states that are close, in a precise mathematical sense, to\nthe vacuum. We do this by comparing the quantum evolutions defined by the\nauxiliary and physical Hamiltonians on the class of coherent states. In the\nsecond part of the paper we study the structure of n-point functions. As we\nwill show their detailed behavior differs from the one corresponding to\nstandard perturbative quantum field theories. We take this as a manifestation\nof the fact that the correct approximation scheme for physically interesting\nobjects in these models does not lead to a power series expansion in the\nrelevant coupling constant but to a more complicated asymptotic behavior."}, "authors": ["J. Fernando Barbero G.", "Iñaki Garay", "Eduardo J. S. Villaseñor"], "author_detail": {"name": "Eduardo J. S. Villaseñor"}, "author": "Eduardo J. S. Villaseñor", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1088/0264-9381/25/20/205013", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/0808.2561v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0808.2561v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "24 pages", "arxiv_primary_category": {"term": "gr-qc", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "gr-qc", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0808.2561v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0808.2561v1", "journal_reference": "Class.Quant.Grav.25:205013,2008", "doi": "10.1088/0264-9381/25/20/205013", "fulltext": "Quantum Einstein-Rosen waves: Coherent states and n-point\nfunctions\nJ. Fernando Barbero G.,1, ∗ Iñaki Garay,1, † and Eduardo J. S. Villaseñor2, 1, ‡\n\narXiv:0808.2561v1 [gr-qc] 19 Aug 2008\n\n1 Instituto\n\nde Estructura de la Materia,\nCSIC, Serrano 123, 28006 Madrid, Spain\n2 Instituto Gregorio Millán, Grupo de Modelización y Simulación Numérica,\nUniversidad Carlos III de Madrid, Avda. de la Universidad 30, 28911 Leganés, Spain\n(Dated: July 24, 2008)\nWe discuss two different types of issues concerning the quantization of EinsteinRosen waves. First of all we study in detail the possibility of using the coherent\nstates corresponding to the dynamics of the auxiliary, free Hamiltonian appearing\nin the description of the model to study the full dynamics of the system. For time\nperiods of arbitrary length we show that this is only possible for states that are\nclose, in a precise mathematical sense, to the vacuum. We do this by comparing the\nquantum evolutions defined by the auxiliary and physical Hamiltonians on the class\nof coherent states. In the second part of the paper we study the structure of n-point\nfunctions. As we will show their detailed behavior differs from the one corresponding\nto standard perturbative quantum field theories. We take this as a manifestation\nof the fact that the correct approximation scheme for physically interesting objects\nin these models does not lead to a power series expansion in the relevant coupling\nconstant but to a more complicated asymptotic behavior.\nPACS numbers: 04.60.Ds, 04.60.Kz, 04.62.+v\n\nI.\n\nINTRODUCTION\n\nEinstein-Rosen (ER) waves [1] provide a very interesting toy model to discuss several\nissues relevant for the quantization of general relativity [2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13,\n14, 15, 16, 17]. The reason behind this is the possibility of exactly describing the dynamics\nof the system both classically and quantum mechanically. This is true even after coupling\nsome types of matter fields –massless scalars– to the gravitational degrees of freedom [14, 15].\nThe main purpose of this paper is to discuss two different issues. The first is related to the\nproblem of finding semiclassical states for the dynamics of the system, the second is to\ndiscuss the structure of important physical objects: the n-point functions of the model.\nA Hamiltonian description of ER-waves shows that the dynamics of this system is rather\ninteresting owing to some unexpected features of the model. Probably the most striking\none is that the Hamiltonian is bounded both above and below. This is a direct consequence\nof the fact that it can be written as a bounded function of the Hamiltonian for a free field\ntheory [18, 19]. The origin of this free Hamiltonian can be traced back to the asymptotic\n∗\n\nfbarbero@iem.cfmac.csic.es\nigael@iem.cfmac.csic.es\n‡\nejsanche@math.uc3m.es\n†\n\n\f2\nbehavior chosen for the metric at infinity (in the 2+1 dimensional sense explained in [18]).\nIt is possible to gain a lot of information on the classical and quantum dynamics of the\nsystem by taking advantage of this functional dependence mentioned above. For instance,\nthe quantization can be carried out by using a Fock Hilbert space defined by the auxiliary\nfree Hamiltonian. This is so because the spectral theorem allows us to define the physical\nHamiltonian once we construct the auxiliary one in a suitable Hilbert space.\nThe first issue that we want to discuss here is related to the definition of semiclassical\nstates for the full dynamics and the possibility of using the ones corresponding to the free\nauxiliary Hamiltonian as an approximate substitute. Coherent states play a very important\nrole for systems of coupled harmonic oscillators –including free field theories that can be\nreadily interpreted as models consisting of an infinite number of them. They display a very\ninteresting behavior because they somehow bridge the gap between states with a purely\nquantum behavior and classical solutions to the equations of motion. For example, even\nthough they display the characteristic dispersion of position and momentum observables,\ncoherent states are minimal in the sense that the Heisenberg inequalities are saturated.\nAlso the mean values of position and momenta evolve according to the classical equations\nof motion. For this reason coherent states can be considered as the best semiclassical states\nfor linear systems. In the context of ER-waves, the large quantum gravity effects discovered\nby A. Ashtekar in [5] (see also [6, 7, 8]) were analyzed by using coherent states. The main\nresult in [5] is that if one considers a coherent state ΦC for the quantum scalar field that\ndescribes the local degrees of freedom of an ER-wave and computes the relative uncertainties\n∆ΦC O/hOiΦC of a certain relevant observable O –that can be interpreted as the quantum\ncounterpart of a metric component of the ER-waves– one gets huge uncertainties even for\ncoherent states with low (but no-zero) occupation number1 kCk2 when C is peaked around\na not too low value of the energy. Here, we want to discuss, from a dynamical point of view,\nthe usefulness of coherent states as bona fide semiclassical states. As we will see, the class\nof coherent states can not be considered as semiclassical for the dynamics of the system\nand hence the behavior discussed in [5, 6, 7, 8] is, in fact, rather natural from our point of\nview. The results of this paper should be considered as complementary to those presented\nin [5, 6, 7, 8].\nThe problem of finding semiclassical states for systems different from the harmonic oscillator is a very difficult one whose general solution is not known (in fact, even for such\nimportant systems as the hydrogen atom no such states have been found to date). As a\nconsequence of this it is natural to expect that no coherent states –in the traditional sense–\nexist for the dynamics of the ER-waves (in fact this is a consequence of a simple exercise\nthat can be carried out for the one-dimensional harmonic oscillator [20]). What we want\nto study here is to what extent the coherent states that do exist for the auxiliary dynamics\ncan be used to derive meaningful information for quantum ER-waves. To this end, we will\ncompare the states obtained by evolving a coherent state ΦC for the free Hamiltonian at a\ncertain time t0 = 0 both with the auxiliary dynamics U0 (t) and the full physical dynamics2\nU(t). We do this by considering kU0 (t)ΦC − U(t)ΦC k, and the projection of U(t)ΦC on the\ncoherent state ΦCt labeled by the classical evolution of the classical initial data C. We do\nthis both for small and large values of t. As we will see it is possible to quantify the periods\n1\n2\n\nWritten in terms of the classical initial data C.\nNotice that we can use the same Hilbert space to describe the auxiliary and the full dynamics because\nthe physical Hamiltonian is a function of a free Hamiltonian.\n\n\f3\nof time where free coherent states remain approximately coherent for the full dynamics.\nWe will also show that for large values of t their distance becomes as large as possible (for\northogonal states).\nA second set of questions that we want to address concerns the relationship between\nthe exact quantization of ER-waves and standard perturbative approaches. As the system\ncan be exactly solved it is possible to devise efficient approximation schemes to extract\nphysical information about it. We have done this in the past to discuss, for example, issues\nrelated to microcausality [10, 12, 13]. The main lesson that we have learnt from this type\nof analysis is that the asymptotic behavior of physically interesting objects is not captured\nby simple power series expansions in terms of the relevant coupling constant. Here we\ngive an alternative way to understand this by looking at n-point functions. These are the\nbuilding blocks used in standard perturbative analysis in QFT to obtain the S-matrix and\ndiscuss such important issues as renormalizability. As we will see the structure of n-point\nfunctions is such that one cannot expect a simple perturbative series to appear and, hence,\nthe non-standard asymptotic behaviors found in previous works are natural in this setting.\nThe paper is organized as follows. After this introduction we discuss in section II the\nbasic material needed to describe the canonical reduced phase space for the model. The next\nsection III is devoted to the construction of the one-particle Hilbert space for the auxiliary\nHamiltonian. Section IV deals with the Fock quantization and the quantum dynamics of\nthe system. We discuss several issues related to the definition of coherent states for the free\nauxiliary dynamics of the model in section V. We also study the asymptotics, both for small\nand large times, of some functions that measure the deviation of the states evolved with the\nfull dynamics with respect to the states obtained by evolving the same quantum initial data\nwith the free, auxiliary, dynamics. The main point discussed in section VI is the structure\nof the n-point functions. They can be exactly written in closed form. At every relevant\norder n we uncover a mixing property that characterizes their structure and shows that we\nare dealing with an interacting theory despite the fact that the main building block in its\nconstruction is a free model. We end with the conclusions and an appendix that summarizes\nsome technical results concerning the asymptotic expansions that appear in the main body\nof the paper.\nII.\n\nCANONICAL REDUCED PHASE SPACE\n\n(4)\nEinstein-Rosen waves describe vacuum solutions to the Einstein equations3 Rab\n= 0 for\n(4)\na symmetry reduction of general relativity consisting of space times of the form (R4 , gab\n)\n(4)\nwith four-dimensional metrics gab having two hypersurface orthogonal, commuting, spatial\nKilling vector fields. The isometry group of these space-times is R × U(1) and the metrics\nare regular at a symmetry axis. If we use a single global coordinate chart (x, y, z, t) on R4\nit is possible to take these Killing fields as (∂/∂z)a and (∂/∂σ)a := x(∂/∂y)a − y(∂/∂x)a .\nThe cylindrical coordinates naturally associated to the previous cartesian coordinates allow\nus to write the four-dimensional metric in the form\n\u0002\n\u0003\n(4)\ngab\n= eγ−φ − e−γ∞ (dt)a (dt)b + (dr)a (dr)b + r 2 e−φ (dσ)a (dσ)b + eφ (dz)a (dz)b\n\n3\n\nHere and in the following we use Penrose's abstract index notation.\n\n\f4\np\naxis\nwhere −∞ < t < ∞, 0 < r = x2 + y 2 , 0 < σ < 2π,p−∞ < z < ∞ and the symmetry\np\n2\n2\n2\nlies at r = 0. In the previous expression γ(t, r) = γ(t, x + y ) and φ(t, r) = φ(t, x + y 2)\nare smooth functions4 of (t, x, y) ∈ R3 , and γ∞ (t) := limr→∞ γ(t, r). Notice that eφ is the\nnorm of the translational Killing field (∂/∂z)a . The time coordinate t is chosen in such a\nway that the vector field (∂/∂t)a is an asymptotic (for large r) unit Killing vector field for\nall the 2+1 dimensional metrics of the form\n\u0001\n(4)\ngab = eφ gab\n− eφ (dz)a (dz)b = −eγ−γ∞ (dt)a (dt)b + eγ (dr)a (dr)b + r 2 (dσ)a (dσ)b (2.1)\ndefined on the space of orbits of the translational Killing vector field. This choice makes sense\n[4] because, under certain fall-off conditions for the fields γ and φ, the Einstein equations\nimply that γ∞ is time independent and non-negative. The value of\n2π(1 − e−γ∞ /2 ) ∈ [0, 2π)\n\n(2.2)\n\nrepresents the deficit angle of the asymptotically conical, 2+1 dimensional metrics, belonging\nto the class defined by (2.1). We want to remark at this point that when γ∞ = 0 this\ndeficit angle vanishes and, hence, the asymptotic behavior is exactly given by the auxiliary\nMinkowskian background metric\nηab = −(dt)a (dt)b + (dr)a (dr)b + r 2 (dσ)a (dσ)b .\n\n(2.3)\n\nThis background metric will play an important role in the following.\n(4)\nAs we have mentioned above, the Einstein field equations Rab\n= 0 force γ∞ to be constant\nin t whereas the function γ can be obtained in terms of φ (see, for example, [4, 15]). In\nparticular, once we fix some Cauchy data (Q, P ) for φ at some initial time t = t0 (say,\nt0 = 0), we can compute the quantity\nZ\n\u0011\n1 ∞\u0010 2\n′2\nγ∞ =\nP (r) + Q (r) rdr ,\n2 0\n\n–that will be seen to be a constant of motion under the dynamics defined by the Hamiltonian\ngiven below– solve for φ(t, r) as a solution to the Einstein equations with initial data\neγ∞ /2 φ̇(0, r) = P (r)\n\nφ(0, r) = Q(r) ,\n\nr ∈ [0, ∞)\n\nand, finally, obtain\n1\nγ(t, r) =\n2\n\nZ\n\nr\n0\n\n\u0010\n\u0011\neγ∞ φ̇2 (t, s) + φ′2 (t, s) sds .\n\nAs we can see, the local physical degrees of freedom of the ER waves are described by a\nscalar field φ.\nThe dynamics induced by the Einstein equations on the field φ that we have just described\n4\n\nThese conditions guarantee the smoothness of the axially symmetric scalar function at r = 0. In the\nfollowing when we talk about smoothness in the axis we will refer to this condition.\n\n\f5\nadmits a well-known Hamiltonian formulation [4] for which the Cauchy surfaces are the level\nsurfaces of the asymptotic Minkowskian time coordinate t. In order to describe it let us first\n2\nintroduce C ⊂ C ∞ (R2 ), the linear space whose points are\np smooth real functions on R with\nrapid decay that depend on (x, y) ∈ R2 through r = x2 + y 2 ∈ [0, ∞). The asymptotic\nconditions for the Cauchy data Q(r) and P (r) can be relaxed both at r = 0 and r → ∞. This\nis important for the classical viewpoint but is irrelevant for the Fock quantization considered\nin this paper in the sense that the Fock space of quantum states turns out to be insensitive\nto the detailed choice of these asymptotic conditions. The canonical reduced phase space\nof the Einstein-Rosen waves Υ = (P, ω), with points generically denoted as (Q, P ) ∈ Υ, is\ndefined by endowing P = C × C with the standard (weakly) symplectic structure\nZ ∞\u0010\n\u0011\nω((Q1 , P1 ), (Q2 , P2 )) :=\nQ2 (r)P1 (r) − Q1 (r)P2(r) rdr .\n(2.4)\n0\n\nThe description of the classical dynamics in Υ is done in the form of an autonomous Hamiltonian system (Υ, ω, h) with a Hamiltonian h : Υ → R that is defined in terms of the\nquadratic (free) auxiliary Hamiltonian5\nZ\n\u0011\n1 ∞\u0010 2\nh0 (Q, P ) := γ∞ (Q, P ) =\nP (r) + Q′2 (r) rdr\n2 0\nthrough a non-polynomial map\n\u0011\n1\nh(Q, P ) = 2 − 2 exp − h0 (Q, P ) .\n2\n\u0010\n\n(2.5)\n\nNotice that, in view of (2.2), h(Q, P ) can be interpreted (up to a π factor) as the deficit angle\nof the metrics (2.1). The Hamilton equations derived from this non-quadratic Hamiltonian\nare\nQ̇ = e−h0 (Q,P )/2 P\nṖ = e−h0 (Q,P )/2 ∆Q\nwhere ∆ denotes the Laplacian ∆ : C → C acting on axially symmetric functions as\n(∆F )(r) := F ′′ (r) +\n\nF ′ (r)\nr\n\nNotice that the 1/r term in the previous expression originates in the axial symmetry of the\nsystem.\n5\n\nWe use units such that c = ~ = 8G3 = 1, where G3 denotes the effective Newton constant per unit length\nin the direction of the symmetry axis.\n\n\f6\nIII.\n\nTHE ONE-PARTICLE HILBERT SPACE ADAPTED TO THE\nASYMPTOTIC STRUCTURE\n\nThis section is devoted to the construction of the one-particle Hilbert space that we will\nlater use to build the Fock space where the quantization of this system will take place.\nWe start by pointing out that the Laplacian operator introduced above can be extended\n√\nto a densely defined operator Θ = −∆ on L2 ([0, ∞), rdr). The operators Θ and Θ are\nself-adjoint and non-negative. As usual6 it can be employed to define a complex structure\nJ : Υ → Υ on the canonical phase space according to7\n√ \u0013\u0012 \u0013\n\u0012 \u0013\n\u0012\nΘ\nQ\n0\n−1/\nQ\nJ\n:= √\n.\n(3.1)\nP\nP\nΘ\n0\nThis complex structure is the restriction to the axisymmetric case of the standard complex\nstructure adapted to the Poincaré symmetry of the background metric (2.3). It can be used\nto construct a complex vector space ΥJ whose points are exactly the same as the points of\nΥ and the multiplication by complex numbers8 x + iy ∈ C is defined by\n(x + iy)(Q, P ) := x(Q, P ) + yJ(Q, P ) .\nIt is possible to combine now ω and J to define a positive definite sesquilinear form\nh* , *iJ : ΥJ × ΥJ → C ,\n\ni\n1\nh(Q1 , P1 ), (Q2 , P2 )iJ = ω(J(Q1 , P1 ), (Q2 , P2 )) − ω((Q1 , P1 ), (Q2 , P2 )) .\n2\n2\nproviding us with a scalar product on ΥJ . The one-particle Hilbert space HJ of the ER\nwaves is the Cauchy completion of (ΥJ , h* , *iJ ).\nThere is another useful construction of the one-particle Hilbert space that uses ΥC –the\nC-vector space obtained from Υ by considering complex functions in CC ⊂ C ∞ ([0, ∞), C)\nwith the standard multiplication by complex scalars– as the starting point. In order to see\nthis we notice that the complex structure (3.1) can be diagonalized in ΥC . In fact, the\nvectors\n√\n(C, ∓i ΘC) ∈ ΥC , C ∈ CC ,\nare eigenvectors of J corresponding to the eigenvalues ±i. Hence we can write ΥC as the\ndirect sum ΥC = Υ+ ⊕ Υ− where\n√\nΥ± := {(C, ∓i ΘC) ∈ ΥC | C ∈ CC } .\n6\n7\n\n8\n\nHere we closely follow the ideas developed in [21].\n√\nIn order to make sense of J it is necessary to restrict the domain of Θ ≥ 0 so that 1/ Θ is well defined.\nTo this end it suffices to consider functions F (x, y) such that their Fourier transform f (w1 , w2 ) vanishes in\np\np\na neighborhood of zero. This guarantees that w12 + w22 f (w1 , w2 ) and f (w1 , w2 )/ w12 + w22 are of rapid\ndecay and smooth, even at (w1 , w2 ) = (0, 0), when f (w1 , w2 ) is chosen smooth and of rapid decay. We\nwill implicitly use this domain when needed. Notice however that there are many functions that can be\n2\n2\nused to describe physical situations, for example the gaussian e−x −y , that do not satisfy this restriction.\n√\nHere x, y ∈ R. As usual i = −1 is the imaginary unit.\n\n\f7\nIt is clear that Υ+ ∩ Υ− = {0} and Ῡ+ = Υ− where\n(C, ∓iΘ1/2 C) := (C, ±iΘ1/2 C).\nIf we take a point (Q, P ) ∈ Υ there exists a unique C ∈ CC , given by\n\u0012\n\u0013\n1\n− 21\nC=\nQ + iΘ P ,\n2\nsuch that\n\n√\n√\n(Q, P ) = (C, −i ΘC) + (C, −i ΘC) .\n\n(3.2)\n1\n\nFrom equation (3.2) it is easy to see that given the first component C = 12 (Q + iΘ− 2 P )\n√\nof (C, −i ΘC) ∈ Υ+ ; the other can be then computed without any ambiguity. Hence,\nthe one-particle Hilbert space HJ can be equally well described in terms of the complex\nfunctions C by using the following identification9 κ : HJ → H\n\u0012\n\u0013\n1\n− 21\nC = κ(Q, P ) :=\nQ + iΘ P ,\n(3.3)\n2\n√\n(Q, P ) = κ−1 C = (C + C, −i Θ(C − C)) .\n(3.4)\nThe map κ is adapted to the complex form J in the sense that if κ(Q, P ) = C then\nκ◦J(Q, P ) = iC. According to the previous discussion we can build a Hilbert space\nH = {C : kCk2 = hC, Ci < ∞},\ndefined with the help of the scalar product\nhC1 , C2i :=\n\ni\n1\nω(Jκ−1C1 , κ−1 C2 ) − ω(κ−1 C1 , κ−1 C2 ),\n2\n2\n\nthat is equivalent to the one-particle Hilbert space HJ . The complex structure in H is\ndiagonal (JC = iC for all C ∈ H). At variance with the situation concerning the spaces Υ±\n(for which Ῡ+ = Υ− ), if we work with H the operator is a conjugation in H, that is, H\nis an antilinear map from H to H satisfying C = C.\nThere are several mathematical structures that are easier to handle in H than in HJ .\nFor example, the classical Hamiltonian that describes the dynamics of the Einstein-Rosen\nwaves can be written now in terms of the scalar product and the operator Θ given above by\nnoticing that\n√\n1\nh0 (κ−1 C) = kΘ 4 Ck2 = hC, ΘCi\n√\nh(κ−1 C) = 2 − 2 exp(−hC, ΘCi/2) .\nIt is interesting to point out here that the scalar product h* , *i on H can be written in terms\n9\n\nAt this point, H is just a linear space of complex functions C(r) that will become a Hilbert space once a\nscalar is introduced.\n\n\f8\nof the usual L2 ([0, ∞), rdr) product\nhC1 , C2 iL2 :=\n\nZ\n\n∞\n\nC1 (r)C2 (r) rdr\n\n0\n\n√\nas hC1 , C2 i = 2hC1 , Θ C2 iL2 . This allows to show that Θ is self-adjoint in H. This can be\nseen by using the mode decomposition introduced at the end of subsection III B that allows\nus to write Θ as a multiplication operator.\nA.\n\nClassical dynamics in the one-particle Hilbert space\n\nLet us consider now the dynamics of the scalar field defined by the auxiliary free Hamiltonian\nZ\n\u0011\n√\n1 ∞\u0010 2\nh0 (Q, P ) =\nP (r) + Q′2 (r) rdr = hC, ΘCi (with C = κ(Q, P ))\n2 0\nin the one-particle Hilbert space H. To this end we first write the free (linear) Hamilton\nequations in terms of the fields C,\n√\n(3.5)\nĊt = −i ΘCt , with initial data C0 = C at t = 0.\nThe self-adjointness of Θ in H allows us to write √\nthe general solution Ct0 to the equation\n(3.5) as the action of the unitary operator exp(−it Θ) on the initial data C, i.e.\n√\nCt0 = exp(−it Θ)C .\n√\n0\nIf Cαt\n= exp(−it Θ)Cα denotes the evolution from t = 0 to an arbitrary time t of some\ninitial data that we label as Cα , the unitary character of the classical evolution in H implies\nthat\n0\n0\nhC1t\n, C2t\ni = hC1 , C2 i\n\nfor all t ∈ R .\n\nIn particular the norms of the states remain constant in time.\nThe non-linear dynamics defined by (2.5) on the reduced phase space of the EinsteinRosen waves can be also described in the one-particle Hilbert space H. The solution Ct at\ntime t to the field equations with initial data C at t = 0 can be written now as\n\u0010\n√ \u0011\n−1\nCt = exp −ite−h0 (κ C)/2 Θ C .\n(3.6)\nNotice that Ct depends on the initial data C in a non-linear way. Hence, if we denote by\nC1t , C2t , and C(1+2) t the solutions corresponding to the initial data C1 , C2 , and C1 + C2 it\nis clear that C(1+2) t 6= C1t + C2t . From (3.6) it is also evident that the evolution does not\npreserve the scalar product on H i.e.\nhC1t , C2t i =\n6 hC1 , C2 i .\n\n(3.7)\n\n\f9\nHowever, it is easy to see from (3.6) that\nkCt k = kCk\n\nfor all t ∈ R .\n\nThis is not in conflict with (3.7) because Ct does not depend linearly on C.\nB.\n\nMode decomposition\n\nIn the following we will find it convenient to work with a suitable mode decomposition\nadapted to the axial symmetry of our system. Given any F ∈ C or CC , we will use the\nfollowing Fourier integral representation10\nZ ∞\n1\nF (r) = √\nf (w)J0(wr) dw\n2 0\nrelated to the two-dimensional Fourier transform\nZ\np\np\n1\n2\n2\n(F F )(w) = (F F )( w1 + w2 ) =\nF ( x2 + y 2 ) e−i(xw1 +yw2 ) dw1 dw2\n2π R2\np\n√\naccording to f (w) = 2w(F F )(w). The functions f (w)/w, where w = w12 + w22 , belong\nto the class of C ∞ (R2 ) in the two real variables (ω1 , ω2 )√\nwith rapid decay. Notice that with\nthese conventions f (0) = 0. The action of the operator Θ can be written in a nice way in\nthis Fourier representation\nZ ∞\n√\n1\n( ΘF )(r) = √\nwf (w)J0(wr) dw .\n2 0\nThe mapping κ connecting the (Q, P ) and C descriptions of the one-particle Hilbert space\nalso has a simple expression in this representation. In fact, given\nZ ∞\n1\nq(w)J0(wr) dw\nQ(r) = √\n2 Z0\n∞\n1\nP (r) = √\np(w)J0(wr) dw\n2 0\nthen C = κ(Q, P ) (we will say that C and (Q, P ) are κ-related) if it can be written as\nZ ∞\n1\nc(w)J0 (wr) dw ,\nC(r) = √\n2 0\nwith\n\n10\n\n1\nc(w) =\n2\n\n\u0012\n\u0013\nip(w)\nq(w) +\n.\nw\n\nHere J0 denotes the 0th order Bessel function of the first kind.\n\n\f10\nFinally the scalar product of the one-particle Hilbert space H simplifies to\nZ ∞\nZ ∞\n2\nc1 (w)c2 (w) dw , kCk =\n|c(w)|2 dw ,\nhC1 , C2 i =\n0\n\n0\n\nand also the free Hamiltonian can be written in the simple form\nZ ∞\n−1\nh0 (κ C) =\nw |c(w)|2 dw .\n0\n\nIV.\n\nFOCK QUANTIZATION AND QUANTUM DYNAMICS\n\nThe one-particle Hilbert space H allows us to construct the Hilbert space Fs (H) used\nin standard approaches to the quantization of Einstein-Rosen waves as the symmetric Fock\nspace\n∞\nM\nH ⊗s n\nwith H0 := C,\nFs (H) =\nn=0\n\n⊗s n\n\nwhere H\ndenotes the symmetrized tensor product of n copies of H. We will write the\ninner product in Fs (H) in the form h* | *i.\nFollowing the rules of second quantization [22] we extend certain operators from H to the\nsymmetric Fock space Fs (H). If we are given a unitary operator exp(iA) : H → H written\nin terms of a self-adjoint operator A : D(A) ⊂ H → H, with domain D(A), we can promote\nthem to the Fock space Fs (H). In particular, there exists a self-adjoint operator\ndΓ(A) : D(dΓ(A)) ⊂ Fs (H) → Fs (H)\nand a unitary operator Γ(i exp(A)) such that\nΓ(i exp(A)) = exp(idΓ(A)) : Fs (H) → Fs (H) .\nThe operator dΓ(A) is called the second quantization of A and is defined by\ndΓ(A) :=\n\n∞\nM\n\nA(n)\n\nn=0\n\nwhere\nA(0) := 0\nA(n) := A ⊗ I ⊗ * * * ⊗ I + I ⊗ A ⊗ * * * ⊗ I + * * * + I ⊗ I ⊗ * * * ⊗ A ,\nand I denotes the identity operator on H. In particular we can use this procedure to\nconstruct the\n√ free auxiliary Hamiltonian. This is defined in the one-particle Hilbert space\nin terms of Θ according to\n√\nh0 (Q, P ) = h0 (κ−1 C) = hC, ΘCi .\n\n\f11\n√\nAlso, the classical evolution in H is described\n√ of the unitary operator exp(−it Θ).\n√ in terms\nHence, the second quantization of exp(−it Θ) and Θ will give us the free quantum unitary\nevolution and the free quantum Hamiltonian. Explicitly, the auxiliary free Hamiltonian11\nH0 is defined on Fs (H) as\n√\nH0 := dΓ( Θ) ,\nand the quantum evolution operator is given by\n\u0010\n\u0010\n√ \u0011\n√ \u0011\nU0 (t) := Γ exp(−it Θ) = exp − it dΓ( Θ) = exp(−itH0 ) .\n\n(4.1)\n\nNotice that, given C ⊗n ∈ H⊗s n the action of the free Hamiltonian H0 can be read from the\nformula\nZ\nn\nn\n\u0010X\n\u0011Y\n1\n⊗n\n(H0 C )(r1 , . . . , rn ) = n/2\nwi\nc(wj )J0 (wj rj ) dwj .\n2\n[0,∞)n\ni=1\nj=1\n√\nFurthermore, notice that H0 |H = Θ and hence, if C ∈ H ⊂ Fs (H) belongs to the domain\nof H0 , we have12\nZ ∞\nhC | H0 Ci =\nw|c(w)|2dw = h0 (C).\n0\n\nIn order to make sense of the quantum counterpart of the full (physical) classical Hamiltonian (2.5) we make use of the quantum free Hamiltonian H0 and the functional relation\nbetween the free and physical classical Hamiltonians h0 and h. In particular\nh(Q, P ) = E(h0 (Q, P )) := 2 − 2 exp(−h0 (Q, P )/2)\nwhere E : [0, ∞) → [0, 2) is the function\nE(x) := 2 − 2 exp(−x/2) .\n\n(4.2)\n\nThe spectral theorems then guarantee that the operator\nH := E(H0 )\nis a well defined self-adjoint operator on Fs (H). It is important to notice that H is not the\nsecond quantization of any self-adjoint operator on H. In particular, in spite\n√ of the fact that\nthe restriction of H to the\n√ one-particle Hilbert space satisfies H|H = E( Θ), the quantum\nHamiltonian H 6= dΓ(E( Θ)). Hence the unitary operator evolution\nU(t) = exp(−itH)\ngenerated by H is not the second quantization of any unitary operator on the one-particle\nHilbert space. This is not a surprise because, as we have discussed in section II, the full\n11\n\n12\n\nWe use a lowercase h0 to denote the Hamiltonian quadratic form in the one-particle Hilbert space and H0\nfor the free quantum Hamiltonian operator in the Fock space.\nIn the following we use h0 (C) to refer to h0 (κ−1 C).\n\n\f12\nclassical dynamics is not even described by a linear operator in H. Finally, it is important\nto point out that the n-particle subspaces H⊗s n of the Fock space are stable under the\nquantum evolution generated by H. At first sight this might seem striking because classical\nER-waves are not stationary space-times and, in principle, one would expect particle creation\neffects. However, the asymptotic conditions [4] used to derive the Hamiltonian formulation\ndiscussed in section II restrict the class of ER-waves considered here to those metrics that\nare asymptotically Minkowskian in its 2 + 1 formulation (2.1). In this context it is possible\nto use the preferred Fock quantization associated to the Minkowskian metric (2.3) for which\nthe particle creation effects are absent.\nV.\n\nCOHERENT STATES\n\nAs we have discussed in section II, a vector in the one-particle Hilbert space C ∈ H can\nbe thought of, through the identification (3.3)-(3.4), as the Cauchy data (Q, P ) at a given\ntime for the scalar field that describes the degrees of freedom of an ER-wave. It is well\nknown that there exists a family of quantum states ΦC ∈ Fs (H), parameterized by C ∈ H,\nthat behave semiclassically under the free auxiliary evolution. These are the coherent states\n−kCk2 /2\n\nΦC = e\n\n∞\nM\n1\n√ C ⊗n ,\nn!\nn=0\n\nwhere C ⊗0 = 1 ∈ C and C ⊗n ∈ H⊗s n denotes the tensor product of n copies of the vector\nC ∈ H. Notice that kΦC k = 1 irrespectively of the value of kCk. The scalar product\nof two coherent states ΦC1 and ΦC2 can be expressed in terms of the scalar product in the\none-particle Hilbert space as\n\u0012\n\u0013\n1\n2\nhΦC1 | ΦC2 i = exp − kC1 − C2 k + iImhC1 , C2 i ;\n2\nin particular\n|hΦC1 | ΦC2 i| = exp\n\n\u0012\n\n1\n− kC1 − C2 k2\n2\n\n\u0013\n\n> 0,\n\nfor all C1 , C2 ∈ H .\n\nThe inner product hΦC1 | ΦC2 i never vanishes but |hΦC1 | ΦC2 i| decreases when we increase\nthe distance between the Cauchy data C1 and C2 . The class of coherent states is closed\nunder the free dynamics defined by (4.1),\nU0 (t)ΦC = exp(−itH0 )ΦC = Φexp(−it√Θ)C = ΦCt0 .\nIn other words, at any given time t the free quantum evolution of the coherent state associated to the Cauchy data C is just the coherent state associated to the classical time\nevolution of these Cauchy data.\nFor the full evolution the situation is, on the other hand, quite different because in this\ncase, if C 6= 0, the time evolution defined by the full physical Hamiltonian H is such that\n\u0010\n\u0011\nU(t)ΦC = exp(−itH)ΦC 6= ΦCt = exp − ite−h0 (C)/2 H0 ΦC .\n\n\f13\nAs we can see U(t)ΦC does not give the coherent state labeled by the classical solution Ct .\nFurthermore an argument similar to the one presented in [20] for the harmonic oscillator\nshows that U(t)ΦC , with C 6= 0, does not belong to the class of coherent states. The case\nC = 0 is special because the coherent state Φ0 = 1 ⊕ 0 ⊕ 0 ⊕ * * * ∈ Fs (H) is both the\nFock vacuum and the vacuum for the Hamiltonian H. It satisfies HΦ0 = 0 and hence\nU(t)Φ0 = Φ0 .\nIn the following we will give a quantitative measure of how the time evolution of the free\ncoherent states deviates from the behavior that one would naturally demand for a bona fide\ncoherent state. First, we will study the function\nDC (t) := kU0 (t)ΦC − U(t)ΦC k2\n\u0001\n= 2hΦC | 1 − cos(t(E(H0 ) − H0 )) ΦC i\n∞\nX\n\u0001\n1 ⊗n\n−kCk2\n= 2 − 2e\nhC | cos t(E(H0 ) − H0 ) C ⊗n i\nn!\nn=0\nthat explicitly measures the distance between the states obtained by evolving a given coherent state with the free and the full dynamics. Second, we will consider the function\nPC (t) := hΦCt | U(t)ΦC i = hΦC | exp(it(e−h0 (C)/2 H0 − E(H0 )))ΦC i\n∞\nX\n1 ⊗n\n−kCk2\n= e\nhC | exp(it(e−h0 (C)/2 H0 − E(H0 )))C ⊗n i\nn!\nn=0\nthat tells us how the full evolution of a coherent state defined by some Cauchy data deviates\nfrom the coherent state associated to the full classical evolution of the same initial data.\nThis is done by studying the projection of one state onto the other. In particular we will\nconsider the short and long time limits of DC (t) and PC (t). The short time limit will give\nus information about how fast a coherent state of the auxiliary free dynamics ceases to be\nsemiclassical. The large time limit will lend us some information about how far from each\nother these states are if we let them evolve for a sufficiently long time.\nA.\n\nAsymptotic behavior for short times\n\nThe behavior of these functions for short times can be obtained from the following result\nthat can be easily derived by using a Taylor expansion.\nLet C ∈ D(Θn ) ⊂ H, then\nDC (t) = 2\n\nn\nX\n(−1)k+1 t2k\n\n(2k)!\n\nk=0\n\nPC (t) =\n\nn\nX\n(it)k\nk=0\n\nk!\n\nh(H0 − E(H0 ))2k iΦC + O(t2n+2 ) ,\n\nh(e−h0 (C)/2 H0 − E(H0 ))k iΦC + O(tn+1) ,\n\nwhere, as usual, hOiΨ = hΨ|OΨi denotes the expectation value of the observable O in the\n\n\f14\nnormalized state Ψ. There are several cases that we have to analyze separately\nDC (t) = t2 h(E(H0 ) − H0 )2 iΦC + O(t4 ) .\n\u0010\n\u0011\nt2\nRe PC (t) = 1 − h(e−h0 (C)/2 H0 − E(H0 ))2 iΦC + O(t4 ) .\n2\n\u0010\n\u0011\n−h0 (C)/2\nIm PC (t) = t he\nH0 − E(H0 )iΦC + O(t3) .\nFirst of all we see that DC (0) = 0 and PC (0) = 1. Also, as expected, the short time\nasymptotic behavior is controlled by the energy E(H0 ). For DC (t) we see that, as long\nas we choose states ΦC such that h(E(H0) − H0 )2 iΦC is small the values of DC (t) will be\napproximately zero (they behave as a constant times t2 ). In an analogous way, those states\ngiving a small value for he−h0 (C)/2 H0 − E(H0 )iΦC will force PC (t) to remain close to one for\na longer period of time.\nB.\n\nAsymptotic behavior for long times\n\nThe study of the asymptotic behavior for t → ∞ is not as straightforward as the previous\none and requires some work. In this case we will use the stationary phase method to obtain\nthe sought for asymptotic behaviors. In the following it will be useful to work with finite\nsums instead of infinite series so, for each N ∈ N, we start by defining the truncations\n−kCk2\n\nDC (t, N) := 2 − 2e\n−kCk2\n\nPC (t, N) := e\n\nN\nX\n\u0001\n1 ⊗n\nhC | cos t(E(H0 ) − H0 ) C ⊗n i ,\nn!\nn=0\n\nN\nX\n1 ⊗n\nhC | exp(it(e−h0 (C)/2 H0 − E(H0 )))C ⊗n i .\nn!\nn=0\n\nThese functions DC (t, N) and PC (t, N) involve a finite number of terms and approximate\nthe corresponding DC (t) and PC (t) uniformly 13 in t. This means that if we fix a certain\nelement C ∈ H and ε > 0 there exists a natural number NC (ε) ∈ N such that\n|DC (t) − DC (t, NC (ε))| < 2ε\n|PC (t) − PC (t, NC (ε))| < ε\nirrespective of the value of t. This results allow us to work with the approximations given\nby DC (t, N) and PC (t, N).\nLet us first consider the asymptotic behavior of the squared distance DC (t). If C(r) is a\ncontinuous function given by the expression\nZ ∞\n1\nC(r) = √\nc(w)J0(wr)dw ∈ H\n2 0\nthe approximations provided by DC (t, N) have the following asymptotic behavior for t → ∞\n13\n\nThe auxiliary mathematical results presented in this section are proved in the appendix.\n\n\f15\n(see appendix A)\n−kCk2\n\nDC (t, N) ∼ 2 − 2e\n\n−kCk2\n\n− Bc e\n\nΓ\n\n\u0012\n\nβc + 1\n2\n\n\u0013\n\ncos\n\n\u0010π\n4\n\n(βc + 1)\n\n\u0011 \u0012 4 \u0013 βc2+1\nt\n\n,\n\n(5.1)\n\nwhere Bc and βc ≥ 2 are real numbers depending\non the chosen state C(r). As we can see\n√\n−kCk2\n3\nDC (t, N) approaches 2 − 2e\nas 1/ t (or faster). The distance remains small when\nkCk → 0 (i.e. when C is close, in the k * k-norm, to the value 0 ∈ H that labels the Fock\nvacuum state Φ0 ) and it approaches its maximum value14 when kCk → ∞ (due to the\nexponential decay in kCk2 this limit is reached very fast).\nFinally let us consider PC (t). In this case, for a continuous C ∈ H, the approximations\nPC (t, N) have the following asymptotic behavior\n1\n2\nPC (t, N) = e−kCk + √ exp(it̺(C))F (C, N) + O(1/t) ,\nt\nwhere\n̺(C) := (h0 (C) + 2) e−h0 (C)/2 − 2\n\nand F (C, N) is a fixed factor that depends on C and N. They can be obtained by applying\nthe stationary phase method as explained in the appendix. The main conclusion that we\ndraw from the asymptotic analysis that we have carried out in the large time limit t → ∞ is\nthat the coherent states corresponding to the free dynamics do not behave as semiclassical\nstates for the dynamics defined by the full Hamiltonian of the system as soon as kCk ∼ 1.\nIn particular the quantum evolution U(t)ΦC of the coherent state defined by the initial data\nC, with kCk ≫ 1, and the coherent state ΦCt labeled by the classical evolution of C become\nalmost orthogonal for large times.\nVI.\n\nQUANTUM FIELD OPERATORS AND N-POINT FUNCTIONS\n\nThe main purpose of this section is to look at the problem of quantizing Einstein-Rosen\nwaves and related models from a perturbative perspective. This is an interesting issue\nbecause we have an exact quantization in our hands and, hence, we can compare exact results\nwith those obtained by suitable approximations. In fact, as we have discussed elsewhere\n[10, 12, 13], if we use asymptotic methods to extract the physical behavior of the model in\nterms of the relevant coupling constant (related to the Planck length) we are led to behaviors\nthat cannot be captured by the power series expansions that one expects to get from a\nperturbative approach. The n-point functions play a very important role in quantum field\ntheory. In fact, for the standard physical models, they are the key ingredients to construct\nrelevant physical quantities such as the S-matrix. We will try here to study the structure\nof the n-point functions and compare them with those obtained from familiar QFT's such\nas QED. As we will see the structure of these Green functions is not the standard one\ncorresponding to interactions defined by field-dependent potential terms. This gives us a\ndifferent perspective concerning the failure of standard perturbative treatments to deal with\nthe types of QFT's considered in this paper.\n14\n\nFor unit orthogonal vectors the maximum valued of the norm of their difference is\n\n√\n\n2.\n\n\f16\nIn the following we will use creation and annihilation operators a∗ (C) and a(C) respectively. These are labeled with vectors C ∈ H in the one-particle Hilbert space introduced in\nsection III. They satisfy the usual commutation relations\n[a(C 1 ), a∗ (C2 )] = hC1 , C2 i Id ,\nwhere Id denotes the identity operator on Fs (H). The conjugation  ̄ : H → H introduced\nabove allows us to define subspaces of H consisting of purely real or imaginary vectors\nHR := {C ∈ H | C = C} ,\n\nHI := {C ∈ H | C = −C} .\n\nThey are related by the equality\nHI = iHR .\nNow, given f ∈ HR , we can define the field and momentum operators φ(f ) and π(f ) in\nterms of annihilation and creation operators\nφ(f ) := a(f ) + a∗ (f ) = a(f ) + a∗ (f )\nπ(f ) := a(if ) + a∗ (if ) = −ia(f ) + ia∗ (f ) .\nThey satisfy the commutation relations\n[φ(f1 ), π(f2 )] = 2ihf1 , f2 i Id .\n1\n\nIt is possible to introduce a single operator Υ(C), labeled by C = 12 (Q+ iΘ− 2 P ), to describe\nboth the field and its canonically conjugate momentum\nΥ(C) := a(C) + a∗ (C)\n\u0011\n1\u0010\n∗\n∗\n− 21\n− 21\na(Q) + a(iΘ P ) + a (Q) + a (iΘ P )\n=\n2\n\u0010\n\u0011\n1\n− 21\nφ(Q) + π(Θ P ) .\n=\n2\nThe commutation relations for these operators are simply given in terms of the symplectic\nform (2.4) by\n[Υ(C1 ), Υ(C2 )] = −iω(C1 , C2 ) Id .\n\nWe study now the (Heisenberg image) time evolution of the Υ(C) from an initial instant\nof time t = 0 to a generic time t both under the free auxiliary dynamics and the full dynamics\nintroduced above.\nFree dynamics. In this case we can immediately see that\nΥ0 (t, C) := U0−1 (t)Υ(C)U0 (t) = exp(itH0 )Υ(C) exp(−itH0 ) = Υ(Ct0 )\n√\nwhere Ct0 = exp(−it Θ)C is the free classical evolution of the Cauchy data defined by C.\nThe fact that the free dynamics can be written in such simple terms reflects in the form of\nthe n-point functions Fn0 defined as the vacuum expectation values of products of Υ0 (t, C)\n\n\f17\nfor different instants of time and\nFn0 (t1 , C1; t2 , C2 ; . . . ; tn , Cn ) = hΥ0 (t1 , C1 )Υ0 (t2 , C2 ) . . . Υ0 (tn , Cn )iΦ0\n= hΥ(C10 t1 )Υ(C20 t2 ) . . . Υ(Cn0 tn )iΦ0 .\nIn fact, it is well known that\n0\nF2n+1\n(t1 , C1 ; t2 , C2 ; . . . ; t2n+1 , C2n+1 ) = 0\n0\nand F2n\n(t1 , C1 ; t2 , C2 ; . . . ; t2n , C2n ) can be written in terms of two-point functions\n0\nF2 (ti , Ci ; tj , Cj ). For example the four-point function is given by\n\nF40 (t1 , C1 ; t2 , C2, t3 , C3 ; t4 , C4 ) = F20 (t1 , C1 ; t3 , C3 )F20 (t2 , C2 ; t4 , C4 )\n+ F20 (t1 , C1 ; t4 , C4 )F20 (t2 , C2 ; t3 , C3 )\n+ F20 (t1 , C1 ; t2 , C2 )F20 (t3 , C3 ; t4 , C4 ) .\nFull dynamics. Let us discuss now the evolution defined by the full Hamiltonian of the\nsystem. In this case the (Heisenberg) time evolution of the operators Υ(C) is given by\nΥ(t, C) := U −1 (t)Υ(C)U(t) = exp(itH)Υ(C) exp(−itH) .\nThe unitarity of the time evolution implies that the (equal time) commutation relations\nbetween the Υ(C) operators are independent of t,\n[Υ(t, C1 ), Υ(t, C2 )] = −iω(C1 , C2 )Id .\nHowever, at variance with the free evolution, it is clear now that\n\u0010\n√ \u0001 \u0011\n−1\nΥ(t, C) 6= Υ(Ct ) = Υ exp − ite−h0 (κ C)/2 Θ C\nbecause in this case the classical dynamics\nCt = exp − ite−h0 (κ\n\n−1 C)/2\n\n√ \u0001\nΘ C\n\nhas a non-linear depencence on the initial data C. This also means that it is not possible\nto find any Bogoliubov relation of the form\nU −1 (t)a(C)U(t) = a(At C) − a∗ (Bt C),\n\nfor all t,\n\nfor any pair of operators At and Bt defined on the one-particle Hilbert space. It is important\nto notice at this point that, despite the naive expectation, we have that\n√\nU −1 (t)a(C)U(t) 6= a(exp(itE( Θ))C) .\nIn fact the real situation is the following. The time evolution of the annihilation and creation\n\n\f18\noperators a∗ (C) and a(C) is given by expressions15 of the form\n√\na(t, C) := U −1 (t)a(C)U(t) = exp(−ite−H0 /2 ⊗ E( Θ)right )a(C) ,\n√\na∗ (t, C) := U −1 (t)a∗ (C)U(t) = a∗ (C) exp(ite−H0 /2 ⊗ E( Θ)left ) .\n\n(6.1)\n(6.2)\n\nThis can be easily proved by using the identities\nn\n\n[a(C), H0n ] = H0n a(Θ 2 C) − H0n a(C)\nor equivalently\nn\n\na(C)H0n = H0n a(Θ 2 C) .\nIn the previous formulas (6.1) and (6.2) we have used a notation that tries to convey the\ninterplay between the C's that label the operators and the Hilbert space states upon which\nthey act. Given a n-particle state V ∈ H⊗s n , with Fourier coefficients v(w1 , . . . , wn ), the\nvector\n√\nexp(−ite−H0 /2 ⊗ E( Θ)right )a(C)V ∈ H⊗s (n−1)\nhas the following Fourier coefficients\nZ ∞\n\u0010\n\u0011\n√\n−(w1 +***+wn−1 )/2\nn\nexp − ite\nE(w) c(w)v(w, w1, . . . , wn−1 ) dw .\n0\n\nThis mixing, due to the interaction present in the system, introduces important complications in the computation of n-point functions for n > 2 and makes it quite different from\nthe free case.\nThe n-point functions for the Einstein-Rosen waves considered here are defined as\nFn (t1 , C1 ; t2 , C2 ; . . . ; tn , Cn ) := hΦ0 | Υ(t1 , C1 )Υ(t2 , C2 ) * * * Υ(tn , Cn )Φ0 i .\nOwing to the fact that we are dealing with an effectively interacting model these n-point\nfunctions behave very differently from the free case ones. The two-point function can be\nvery easily computed in this case\nF2 (t1 , C1 ; t2 , C2) = hΦ0 | a(t1 , C1 )a∗ (t2 , C2 )Φ0 i = ha∗ (t1 , C1 )Φ0 | a∗ (t2 , C2 )Φ0 i\n√ \u0001\n√ \u0001\n= hexp it1 E( Θ) C1 | exp it2 E( Θ) C2 i\nZ ∞\n\u0010\n\u0011\n=\nexp i(t2 − t1 )E(w) c1 (w)c2 (w) dw .\n0\n\nThese two-point functions have been studied in detail in [12, 13]. Notice that when the\ncoupling constant of the model16 G = G3 ~ is reintroduced (G = G3 in units ~ = 1) it\nappears in non-polynomial form trough the expressions involving the function E defined\n1\n(1 − e−4Gw ). This is a distinctive feature of the model that\nin (4.2), explicitly E(w) = 4G\nultimately leads to behaviors that cannot be written as powers of the coupling constants.\n15\n16\n\nThese have been derived in a slightly different form in [10].\nG3 is the effective Newton constant per unit length in the direction of the symmetry axis.\n\n\f19\nLikewise, the four-point function can be obtained in a direct way and is given by\nF4 (t1 , C1 ; t2 , C2 ; t3 , C3 ; t4 , C4 ) = ha∗ (t2 , C2 )a∗ (t1 , C1 )Φ0 | a∗ (t3 , C3 )a∗ (t4 , C4 )Φ0 i\n+ F2 (t1 , C1 ; t2 , C2 )F2 (t3 , C3 ; t4 , C4 )\nbut, at variance with the situation for the free four-point function, F4 cannot be written as\na sum of products of two-point functions. The difference lies in what we call a mixing term\nha∗ (t2 , C2 )a∗ (t1 , C1)Φ0 | a∗ (t3 , C3 )a∗ (t4 , C4)Φ0 i\nthat cannot be written as a product of two-point functions. Explicitly,\nha∗ (t2 , C2 )a∗ (t1 , C1 )Φ0 | a∗ (t3 , C3 )a∗ (t4 , C4 )Φ0 i =\n\u0013\nZ ∞ \u0012Z ∞\n\u0010\n\u0011\n−w1 /2\n−w2 /2\n=\nc2 (w2 )c4 (w2 ) exp i(t4 − t2 e\n)E(w2 ) + it3 e\nE(w1 )) dw2 ×\n0\n0\n\u0010\n\u0011\n× c1 (w1 )c3 (w1 ) exp − it1 E(w1 ) dw1 +\n\u0013\nZ ∞ \u0012Z ∞\n\u0010\n\u0011\n−w1 /2\n+\nc2 (w2 )c3 (w2 ) exp i(t3 − t2 )e\nE(w2 ) dw2 ×\n0\n0\n\u0010\n\u0011\n× c1 (w1 )c4 (w1 ) exp i(t4 − t1 )E(w1 ) dw1 .\nWe will refer to this situation by saying that this last term has a mixing order of four.\nNotice again the non-trivial behavior of this function in terms of the coupling constant of\nthe model.\nFinally it can be shown in general that F2n+1 = 0 whereas the 2n-point functions\nF2n (t1 , C1 ; . . . ; t2n , C2n ) =\n= hΦ0 | a(t1 , C 1 )(a(t2 , C 2 ) + a∗ (t2 , C2 )) * * * (a(t2n−1 , C 2n−1 ) + a∗ (t2n−1 , C2n−1 ))a∗ (t2n , C2n )Φ0 i\nalways have a term with maximal mixing order of 2n. In every case there are two extreme\nsituations as far as the mixing order of the different terms is concerned. On one hand17 we\ncan have\nhΦ0 |\n\nn\nY\n\nk=1\n\n∗\n\na(t2k−1 , C 2k−1 )a (t2k , C2k )Φ0 i =\n\nn\nY\n\nF2 (t2k−1 , C2k−1 ; t2k , C2k )\n\nk=1\n\nthat can be written as a product of two-point functions. On the other hand\nhΦ0 |\n\nn\nY\n\nk=1\n\na(tk , Ck )\n\n2n\nY\n\ns=n+1\n\na∗ (ts , Cs )Φ0 i = h\n\nn\nY\n\nk=1\n\na∗ (tk , Ck )Φ0 |\n\n2n\nY\n\ns=n+1\n\na∗ (ts , Cs )Φ0 i\n\nis maximally mixed (in fact the mixing order is higher than the maximum present for 2(n−1)point functions).\n17\n\nWith the aim of simplifying some expressions we will use the following notation for products of operators\nQn\nk=1 Ak := A1 A2 * * * An .\n\n\f20\nVII.\n\nCONCLUSIONS\n\nWe have studied the quantization of Einstein-Rosen waves in the reduced phase space\nobtained by imposing the asymptotic flatness condition of [18] and using an asymptotic,\nunit, timelike, Killing vector field to parameterize the time evolution. We have discussed\ntwo different types of issues that are relevant to understand quantum Einstein-Rosen waves.\nThe first issue that we have considered is related to the semiclassical limit of the system.\nSpecifically we have studied to what extent the coherent states corresponding to the free\nauxiliary dynamics of the model can be thought of as semiclassical states under the evolution\ndefined by the full non-quadratic Hamiltonian. The conclusion that we draw from our\nanalysis is that for short periods of time (with a length determined by the Hamiltonian\nH0 as expected on general grounds) the free coherent states can, indeed, be considered as\nsemiclassical. In the long time limit we recover from a dynamical point of view the results\nof Ashtekar [5] about the existence of large quantum effects in the system. Specifically we\nsee that the free coherent states ΦC with low occupation number (kCk ∼ 1) do not behave\nsemiclassically and it gets worse and worse for larger values of kCk. We have discussed this\nby studying the distance and the mutual projections of certain states obtained by considering\nthe different time evolutions relevant in the model (the auxiliary one given by H0 and the\nfull physical one). If we consider the squared distance, as a function of time, between the\nstates obtained by evolving coherent states with the auxiliary evolution and the full evolution\nwe see that it approaches the value 2 − 2 exp(−kCk2 ). If kCk is very small this distance\nremains small whereas it becomes significant once kCk ∼ 1. Finally for larger values of\nkCk the distance approaches the maximum value for orthogonal states. Similar conclusions\ncan be reached by studying suitable projections. We want to emphasize that we have not\nproved the impossibility of finding good semiclassical states for the model but only that not\nall the semiclassical states for the free auxiliary model can be considered as such for the full\ndynamics. An interesting open problem is to find a sufficiently large class of semiclassical\nstates representing classical ER waves corresponding to arbitrary Cauchy data C.\nA second point that we have studied is the mathematical structure of the n-point functions. The main reason to do this is to get some information about the possible perturbative\nanalysis of the system. We have seen that the structure of the n-point functions is different\nfrom the one corresponding to a free QFT. This is noteworthy because the formalism that\nwe have used here relies on the fact that our model can be conveniently described in terms\nof an auxiliary free model. The structure of the n-point functions, for which we are able\nto give closed form expressions, displays the distinctive features of an interacting model\nbecause they cannot be written simply in terms of two-point functions. Also the type of\nnon-local interaction underlying the model shows up in the detailed form of these objects\nthat differ from the ones obtained for familiar systems where the interaction is just given by\na field-dependent potential. This is compatible with the known fact (discussed elsewhere)\nthat the asymptotic approach to the study of physical observables for this model leads to\nexpansions in terms of the relevant coupling constant (that can be interpreted as an effective\nPlanck length) that are incompatible with any power series [13, 14].\nWe want to conclude by remarking that the present model can be exactly solved. In fact\nthe exact evolution operator and their matrix elements can be exactly written. This means,\nin particular, that there is no need to separately consider the n-point functions to construct\nphysical objects such as the S-matrix. Of course n-point functions are interesting objects\nwith important physical interpretations (see [10, 15]) so it makes sense to understand how\n\n\f21\nthey can be obtained as we have done here.\nAcknowledgments\n\nThe authors want to thank Daniel Gómez Vergel for his comments and careful reading\nof the manuscript. Iñaki Garay acknowledges the financial support provided by the Spanish\nMinistry of Science and Education (MEC) under the FPU program. This work is also\nsupported by the Spanish MEC under the research grant FIS2005-05736-C03-02.\nAPPENDIX A: ASYMPTOTIC EXPANSIONS\n\nThis appendix contains the proofs of several results used to obtain the asymptotic behavior of DC (t) and PC (t) in the large t asymptotic limit studied in subsection V B. We will\nwrite them in the form of propositions.\nProposition A.1. Given C ∈ H and ε > 0 there is a number NC (ε) ∈ N, independent of\nt ∈ R, such that\n|DC (t) − DC (t, NC (ε))| < 2ε\nand\n|PC (t) − PC (t, NC (ε))| < ε .\nThe proof is based on the fact that it is always possible to find NC (ε) ∈ N in such a way\nthat\n∞\nX\n1\n−kCk2\nkCk2n < ε ;\ne\nn!\nn=NC (ε)\n\nand hence,\n−kCk2\n\n|DC (t) − DC (t, NC (ε))| = 2e\n\n2\n\n≤ 2e−kCk\n\n2\n\n≤ 2e−kCk\n\n−kCk2\n\n≤ 2e\n\n∞\nX\n\nn=NC (ε)\n∞\nX\n\nn=NC (ε)\n∞\nX\n\nn=NC (ε)\n∞\nX\n\nn=NC (ε)\n\n\u0001\n1 ⊗n\nhC | cos t(E(H0 ) − H0 ) C ⊗n i\nn!\n\n\u0001\n1\nhC ⊗n | cos t(E(H0 ) − H0 ) C ⊗n i\nn!\n\u0001\n1\nkC ⊗n k * k cos t(E(H0 ) − H0 ) C ⊗n k\nn!\n∞\nX\n1\n⊗n 2\n−kCk2\nkC k = 2e\nn!\n\nn=NC (ε)\n\n1\nkCk2n < 2ε.\nn!\n\n\f22\nWe also have\n∞\nX\n\n−kCk2\n\n|PC (t) − PC (t, NC (ε))| = e\n\nn=NC (ε)\n∞\nX\n\n2\n\n≤ e−kCk\n\n−kCk2\n\n≤ e\n\nn=NC (ε)\n∞\nX\n\nn=NC (ε)\n\n1 ⊗n\nhC | exp(it(e−H0 (C)/2 H0 − E(H0 )))C ⊗n i\nn!\n\n1\nhC ⊗n | exp(it(e−H0 (C)/2 H0 − E(H0 )))C ⊗n i\nn!\n∞\nX\n1\n⊗n\n⊗n\n−kCk2\nkC k * kC k = e\nn!\n\nn=NC (ε)\n\n1\nkCk2n < ε .\nn!\n\nThis result allows us to work with the truncations given by DC (t, N) and PC (t, N).\nProposition A.2. Let\n1\nC(r) = √\n2\n\nZ\n\n∞\n\n0\n\nc(w)J0(wr)dw ∈ H ,\n\nand let us assume |c(w)|2 = Bc w βc + O(w βc +2 ) (w → 0+ ), with Bc 6= 0 and βc ≥ 2 real\nconstants depending on the state C. Then the approximations DC (t, N) satisfy, in the limit\nt → ∞,\n−kCk2\n\nDC (t, N) ∼ 2 − 2e\n\n−kCk2\n\n− Bc e\n\nΓ\n\n\u0012\n\n\u0013\n\u0010π\n\u0011 \u0012 4 \u0013 βc2+1\nβc + 1\ncos\n.\n(βc + 1)\n2\n4\nt\n2\n\nAs a consequence, DC (t, N) approaches 2 − 2e−kCk as (1/t)3/2 or faster.\nThis result follows from\n−kCk2\n\nDC (t, N) = 2 − 2e\n\nN\nX\n1 C\nA ,\nn! n\nn=0\n\nwhere AC0 := 1 and\n\u0001\nACn := hC ⊗n | cos t(E(H0 ) − H0 ) C ⊗n i =\n\u0013\n\u0012 X\nZ\nn\nn\nX\n\u0001\n=\ncos t\nwj − E(\nwj ) |c(w1 )|2 * * * |c(wn )|2 dw1 * * * dwn\n[0,∞)n\n\n1\n=\n2\n\nZ\n\n∞\n\n0\n\nj=1\n\nj=1\n\n1\nexp it z − E(z) Gn (z, C) dz +\n2\n\u0001\u0001\n\nZ\n\n∞\n\n0\n\n\u0001\u0001\nexp − it z − E(z) Gn (z, C) dz .\n\nIn the last integral we have performed the following change of variables\n(w1 , . . . , wn−1 , wn ) 7→ (w1 , . . . , wn−1 , z) , where z =\n\nn\nX\nj=1\n\nwj ,\n\n\f23\nand defined the functions Gn (z, C) as\nGn (z, C) :=\n\nZ\n\nQn−1\n\nk=1 [0,z−\n\nPk−1\nj=1\n\nwj )\n\n|c(z −\n\nn−1\nX\nj=1\n\nwj )|2\n\nn−1\nY\nk=1\n\n|c(wk )|2 dw1 * * * dwn−1 .\n\nThese behave, in the z → 0 limit, as Gn (z, C) ∼ Bcn z n(βc +1)−1 with Bc and βc ≥ 2 real\nconstants that depend on the state that we have chosen to start with (notice that, as we\npointed out in subsection III B, the Fourier coefficients c(w) satisfy c(0) = 0). Hence, the\nstationary phase method [23] gives the following asymptotics for ACn , n ≥ 1, in the t → ∞\nlimit\n\u0013\n\u0012\n\u0010π\n\u0011 \u0012 4 \u0013 n(βc2+1)\nBcn\nn(βc + 1)\nC\nAn (t) ∼\ncos\n.\nΓ\n(n(βc + 1))\n2\n2\n4\nt\nWe conclude that the main contribution to the asymptotic expansion of DC (t, N) is given\n2\n2\nby 2 − 2e−kCk (AC0 + AC1 ) = 2 − 2e−kCk (1 + AC1 ). This way we finally get (5.1).\nProposition A.3. If C ∈ H (regular enough) then PC (t, N) satisfies the identity\n\u0001\nexp it̺(C)\n−kCk2\n√\nPC (t, N) = e\n+\nF (C, N) + O(1/t) (t → ∞) ,\nt\nwhere\n̺(C) := (h0 (C) + 2)e−h0 (C)/2 − 2\n\nand F (C, N) is a function that depends only on C and N ∈ N.\nThe proof is a straightforward application of the stationary phase method [23] to\n\u0013\n\u0012\nZ ∞\n\u0001\n⊗n\n−h0 (C)/2\n⊗n\n−h0 (C)/2\nhC | exp(it(e\nH0 − E(H0 )))C i =\nexp it e\nz − E(z) Gn (z, C) dz\n0\n\u0001\n√\nexp it̺(C) + iπ4\n√\n+ O(t−1) , n ≥ 1 .\n= 4πeh0 (C)/4 Gn (h0 (C), C)\nt\nNotice that\nhC ⊗0 | exp(it(e−h0 (C)/2 H0 − E(H0 )))C ⊗0 i = 1 .\n\n[1]\n[2]\n[3]\n[4]\n[5]\n[6]\n[7]\n\nA. Einstein and N. Rosen, J. Franklin Inst. 223, 43-54 (1937).\nK. Kuchař, Phys. Rev. D4, 955 (1971).\nJ. D. Romano and C. G. Torre, Phys. Rev. D53, 5634-5650 (1996), gr-qc/9509055.\nA. Ashtekar and M. Pierri, J. Math. Phys. 37, 6250 (1996), gr-qc/9606085.\nA. Ashtekar, Phys. Rev. Lett. 77, 4864 (1996), gr-qc/9610008.\nR. Gambini and J. Pullin, Mod. Phys. Lett. A12, 2407-2414 (1997), gr-qc/9703088.\nA. E. Dominguez and M. H. Tiglio, Phys. Rev. D60, 064001 (1999), gr-qc/9905086.\n\n\f24\n[8] M. E. Angulo and G. A. Mena Marugán, Int. J. Mod. Phys. D9, 669-686 (2000), grqc/0002056.\n[9] M. Varadarajan, Class. Quant. Grav. 17, 189-199 (2000) gr-qc/9910043.\n[10] J. F. Barbero G., G. A. Mena Marugán, and E. J. S. Villaseñor, Phys. Rev. D67, 124006\n(2003), gr-qc/0304047.\n[11] J. F. Barbero G., G. A. Mena Marugán, and E. J. S. Villaseñor, Int. J. Mod. Phys. D13,\n1119-1128 (2004), gr-qc/0402096.\n[12] J. F. Barbero G., G. A. Mena Marugán, and E. J. S. Villaseñor, J. Math. Phys. 45, 3498\n(2004), gr-qc/0405075.\n[13] J. F. Barbero G., G. A. Mena Marugán, and E. J. S. Villaseñor, J. Math. Phys. 46, 062306\n(2005), gr-qc/0412028.\n[14] J. F. Barbero G., I. Garay, and E. J. S. Villaseñor, Phys. Rev. Lett. 95, 051301 (2005),\ngr-qc/0506093.\n[15] J. F. Barbero G., I. Garay, and E. J. S. Villaseñor, Phys. Rev. D74, 044004 (2006), grqc/0607053.\n[16] M. Varadarajan, Int. J. Mod. Phys. D15, 1743-1752 (2006).\n[17] D. H. J. Cho and M. Varadarajan, Class. Quant. Grav. 23, 6115-6140 (2006), gr-qc/0605065.\n[18] A. Ashtekar and M. Varadarajan, Phys. Rev. D50, 4944 (1994), gr-qc/9406040.\n[19] M. Varadarajan, Phys. Rev. D52, 2020 (1995), gr-qc/9503006.\n[20] J. F. Barbero G., I. Garay, and E. J. S. Villaseñor, Am. J. Phys. 76, 153-157 (2008),\narXiv:0710.1559.\n[21] R. M. Wald. Quantum Field Theory in Curved Spacetime and Black Hole Thermodynamics.\nThe University of Chicago Press, USA (1994).\n[22] M. Reed and B. Simon. Methods of Modern Mathematical Physics, Vols. 1 and 2. Academic\nPress (1980).\n[23] C. M. Bender and S. A. Orszag. Advanced Mathematical Methods for Scientists and Engineers.\nSpringer (1999).\n\n\f"}