{"id": "http://arxiv.org/abs/0710.1594v7", "guidislink": true, "updated": "2020-11-23T09:31:32Z", "updated_parsed": [2020, 11, 23, 9, 31, 32, 0, 328, 0], "published": "2007-10-08T16:59:49Z", "published_parsed": [2007, 10, 8, 16, 59, 49, 0, 281, 0], "title": "Synchronizing equivalent clocks across inertial frames", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0710.3434%2C0710.4377%2C0710.3777%2C0710.0226%2C0710.4250%2C0710.4255%2C0710.4913%2C0710.4332%2C0710.5419%2C0710.1586%2C0710.2248%2C0710.5564%2C0710.5551%2C0710.5708%2C0710.3940%2C0710.2433%2C0710.0081%2C0710.3637%2C0710.5652%2C0710.0546%2C0710.1475%2C0710.0628%2C0710.5235%2C0710.4874%2C0710.3681%2C0710.5481%2C0710.3229%2C0710.3067%2C0710.1594%2C0710.4192%2C0710.2278%2C0710.3407%2C0710.4512%2C0710.3126%2C0710.0018%2C0710.0569%2C0710.0278%2C0710.3263%2C0710.4784%2C0710.2736%2C0710.2141%2C0710.2464%2C0710.5756%2C0710.5915%2C0710.5648%2C0710.0908%2C0710.2742%2C0710.5839%2C0710.3864%2C0710.3687%2C0710.3000%2C0710.1240%2C0710.1463%2C0710.4622%2C0710.4281%2C0710.4740%2C0710.5086%2C0710.0024%2C0710.0129%2C0710.1820%2C0710.3766%2C0710.4003%2C0710.2933%2C0710.0413%2C0710.1670%2C0710.4834%2C0710.2926%2C0710.3102%2C0710.4338%2C0710.2149%2C0710.4504%2C0710.0214%2C0710.4723%2C0710.1285%2C0710.0961%2C0710.0137%2C0710.1794%2C0710.2917%2C0710.4633%2C0710.1961%2C0710.1260%2C0710.1750%2C0710.3430%2C0710.0117%2C0710.2625%2C0710.2419%2C0710.4230%2C0710.3752%2C0710.5308%2C0710.3199%2C0710.0442%2C0710.2046%2C0710.2728%2C0710.0377%2C0710.1244%2C0710.3523%2C0710.3697%2C0710.1973%2C0710.5903%2C0710.2821%2C0710.3943&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Synchronizing equivalent clocks across inertial frames"}, "summary": "We consider three clocks A B and D moving with respect to each other in\nuniform motion. The three paired meetings AB AD and BD show that the three\nclocks did not run equivalently and hence the three inertial frames co-moving\nwith clocks A B and D may not be considered equivalent. The Michelson-Morley\nexperiment showed the constancy of the circular speed of light when a ray or\nwave of light returns to its starting point after reflections through mirrors.\nThe realization was that the one-way speed of light is indeterminable as it\nrequires synchronization of spatially separated clocks. The development of a\nconvention to synchronize spatially separated clocks by assuming that the\none-way speed of light is constant in all inertial frames sparked a debate as\nto the validity of this convention due to its metaphysical implications. The\nEinstein/Poincare Synchronization convention leads to relativity of\nsimultaneity and the space-time continuum that negates the dynamic emergence of\nfuture from the present. In this paper we compile evidence for the existence of\na unique isotropic inertial frame, an absolute present, and a universal\nsynchronization corresponding to the Einstein Synchronization in the unique\nisotropic inertial frame that maintains simultaneity across all inertial frames\nand conforms to the experimental finding that the round trip speed of light is\nconstant in all inertial frames.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0710.3434%2C0710.4377%2C0710.3777%2C0710.0226%2C0710.4250%2C0710.4255%2C0710.4913%2C0710.4332%2C0710.5419%2C0710.1586%2C0710.2248%2C0710.5564%2C0710.5551%2C0710.5708%2C0710.3940%2C0710.2433%2C0710.0081%2C0710.3637%2C0710.5652%2C0710.0546%2C0710.1475%2C0710.0628%2C0710.5235%2C0710.4874%2C0710.3681%2C0710.5481%2C0710.3229%2C0710.3067%2C0710.1594%2C0710.4192%2C0710.2278%2C0710.3407%2C0710.4512%2C0710.3126%2C0710.0018%2C0710.0569%2C0710.0278%2C0710.3263%2C0710.4784%2C0710.2736%2C0710.2141%2C0710.2464%2C0710.5756%2C0710.5915%2C0710.5648%2C0710.0908%2C0710.2742%2C0710.5839%2C0710.3864%2C0710.3687%2C0710.3000%2C0710.1240%2C0710.1463%2C0710.4622%2C0710.4281%2C0710.4740%2C0710.5086%2C0710.0024%2C0710.0129%2C0710.1820%2C0710.3766%2C0710.4003%2C0710.2933%2C0710.0413%2C0710.1670%2C0710.4834%2C0710.2926%2C0710.3102%2C0710.4338%2C0710.2149%2C0710.4504%2C0710.0214%2C0710.4723%2C0710.1285%2C0710.0961%2C0710.0137%2C0710.1794%2C0710.2917%2C0710.4633%2C0710.1961%2C0710.1260%2C0710.1750%2C0710.3430%2C0710.0117%2C0710.2625%2C0710.2419%2C0710.4230%2C0710.3752%2C0710.5308%2C0710.3199%2C0710.0442%2C0710.2046%2C0710.2728%2C0710.0377%2C0710.1244%2C0710.3523%2C0710.3697%2C0710.1973%2C0710.5903%2C0710.2821%2C0710.3943&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We consider three clocks A B and D moving with respect to each other in\nuniform motion. The three paired meetings AB AD and BD show that the three\nclocks did not run equivalently and hence the three inertial frames co-moving\nwith clocks A B and D may not be considered equivalent. The Michelson-Morley\nexperiment showed the constancy of the circular speed of light when a ray or\nwave of light returns to its starting point after reflections through mirrors.\nThe realization was that the one-way speed of light is indeterminable as it\nrequires synchronization of spatially separated clocks. The development of a\nconvention to synchronize spatially separated clocks by assuming that the\none-way speed of light is constant in all inertial frames sparked a debate as\nto the validity of this convention due to its metaphysical implications. The\nEinstein/Poincare Synchronization convention leads to relativity of\nsimultaneity and the space-time continuum that negates the dynamic emergence of\nfuture from the present. In this paper we compile evidence for the existence of\na unique isotropic inertial frame, an absolute present, and a universal\nsynchronization corresponding to the Einstein Synchronization in the unique\nisotropic inertial frame that maintains simultaneity across all inertial frames\nand conforms to the experimental finding that the round trip speed of light is\nconstant in all inertial frames."}, "authors": ["Chandru Iyer", "G. M. Prabhu"], "author_detail": {"name": "G. M. Prabhu"}, "author": "G. M. Prabhu", "arxiv_comment": "Updated with added references and improvements", "links": [{"href": "http://arxiv.org/abs/0710.1594v7", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0710.1594v7", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "physics.gen-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "physics.gen-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0710.1594v7", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0710.1594v7", "journal_reference": null, "doi": null, "fulltext": "Synchronizing equivalent clocks across inertial frames\nChandru Iyer1\n1\n\nPlant Head, Lydall Performance Materials India LLP, Sohna, India 122103 e-mail\nchandru_i@yahoo.com\nABSTRACT\nThe second postulate of special relativity, namely, the equivalence of inertial frames, implies that\nall clocks must run identically across inertial frames. Under this principle, global clock\nsynchronization may be feasible if an appropriate procedure can be developed. It is well known\nthat synchronization within an inertial frame using the methods of light rays or slow separation of\nclocks results in synchronization that is specific to that inertial frame. This paper describes a new\nprocedure to synchronize clocks co-moving with different inertial frames and analyzes its\neffectiveness. Apart from an algebraic derivation, a numerical example is included to effectively\nconvey the concept. It is shown that clocks in relative uniform motion do not run equivalently and\nthis result is not frame dependent and therefore an objective conclusion and not a subjective one\nassociated with observers comoving with a particular inertial frame.\nKEY WORDS: Special relativity, Lorentz transformation, clock synchronization\nPACS: 3.30SR\n1. INTRODUCTION\nDistances between spatial locations within an inertial frame are measured by an observer \"by\nmarking off his measuring-rod in a straight line as many times as is necessary to take him from\nthe one marked point to the other. Then the number which tells us how often the rod has to be laid\ndown is the required distance\" (Einstein 1961). It is also simple to measure the time interval\nbetween two events happening at the same location in an inertial frame by using a single clock\npresent at that location. However, the measurement of a time interval between events taking place\nat different locations in an inertial frame requires a multitude of clocks situated at various\nlocations. The other option is to send a signal to a location where the reference or standard clock\nis present. The latter option is generally avoided because it involves knowing the distance\nbetween the locations as well as prior knowledge of the signal speed.\nSynchronizing a number of clocks at one location and later separating them to different locations\nis another option. This option was acceptable under classical physics. However with the advent of\nspecial and general relativity this option has its limitations because of the effect of motion on\nclocks.\nUnder the first postulate of special relativity, the signal speed of a light ray is a constant in all\ninertial frames and therefore this has been used in thought experiments by many authors to\nsynchronize clocks equidistant from a reference point by sending a light signal from that\nreference point (Bohm 1965; Resnick 1968).\nThe other possibility is to separate identical clocks very slowly with a limiting speed tending to\nzero, so that their running is not affected. This option was examined by Lorentz (Bohm 1965, p.\n32–34) who demonstrated that even under slow separation, clocks in a \"moving\" reference frame\nwill become asynchronous, whereas they will remain synchronous in an inertial frame at \"rest.\"\n\n1\n\n\fBoth the above procedures give specific synchronicities that are unique to a given inertial frame\nbut different for inertial frames in relative motion. Further, both procedures give identical results\nin a given inertial frame. The resultant synchronicity is widely known as standard Einstein\nsynchronization (Ohanian 2004). Reichenbach (1958, originally in 1927) had argued that this is\nonly a conventional synchronicity and there is no compelling reason to adopt this particular\nsynchronicity. He had proposed that alternate synchronicities can be developed by assuming\ndifferent onward and return speeds for light without affecting causality. The Reichenbach\nsynchronization, as it has been called in (Ohanian 2004), has a parameter, epsilon, 0 < ε < 1 and\nin this method, if the round trip speed of light is c, the onward speed is assumed to be c/(2ε) and\nthe return speed as c/[2(1 – ε)]. The total round trip time (2s/c) is thus divided into two parts\n[(2s/c)ε] for the onward journey and [(2s/c) (1 – ε)] for the return journey. With the value of ε =\n1/2, the onward and return speeds of light become identical and this leads to the Einsteinian\nsynchronization. For other values of ε, with the restriction that it is positive and less than 1, we\nget the Reichenbach synchronization (Ohanian 2004).\nSelleri (1996) has argued in favor of an absolute simultaneity. Rowland (2006), in his concluding\nremarks makes the observation that \"a uniformly accelerating, effectively rigid rod only has\ninstantaneous rest inertial frames, as one might expect it to, if inertial frames use Einstein\nsynchronicity.\" However, he immediately adds that \"while this observation provides yet another\nargument for accepting Einstein synchronicity as the 'natural' choice for a simultaneity\nconvention, it is acknowledged that it does not in fact defeat the 'conventionality of simultaneity'\nthesis.\"\nOhanian (2004) has given a complete review of the debate on the conventions relating to\nsynchronization. He also argues that the dynamical considerations forbid any synchronization\nother than the Einsteinian one, and if an inertial frame adopts a Reichenbach synchronization,\nNewton's laws would be violated. However, Martinez (2005) and Macdonald (2005) are not in\ncomplete agreement with Ohanian (2004).\nMartinez (2005) has discussed the origin of the Einsteinian synchronization. He observes that the\noriginal German word 'festsetzung' used by Einstein (1905) to prescribe the Einsteinian\nsynchronization has been translated into English as 'stipulation' and into French as 'convention.'\nEddington also advanced the concept that the Michelson-Morley experiment only determined the\nround trip speed of a light ray as a constant and a synchronization convention was needed to\nfurther specify that the speed of light remained constant on both the onward and return trips\n(Martinez 2005). Macdonald (2005) argues that Einstein definitely intended the synchronization\nproposed by him as a method or definition. And this is the reason Einstein emphasized that his\ndefinition \"is in reality neither a supposition nor a hypothesis about the physical nature of light,\nbut a stipulation (festsetzung) which I can make of my own free will in order to arrive at a\ndefinition of simultaneity.\"\nIn his reply to the comments by Martinez (2005) and Macdonald (2005), Ohanian (2005) has\nargued that when the Einsteinian synchronization convention is adopted in all inertial reference\nframes, it \"permits us to express the laws of physics in their simplest form.\" He further states that\n\"The adoption of a preferential inertial reference frame in which all the laws of physics take their\nsimplest form compels the E (Einsteinian) synchronization and forbids the R (Reichenbach)\nsynchronization\" (Ohanian 2005).\nIn this paper we propose a constructive procedure for synchronizing a three-clock system using\nthe second postulate of special relativity. We assume that all clocks (even if in relative motion)\n\n2\n\n\frun at the same rate. All the three clocks are under uniform relative motion in relation to each\nother and each one of them falls strictly under the purview of Special Relativity and the Lorentz\ntransformations. The success of the procedure is checked using the Lorentz transformations and it\nis concluded that clocks in relative motion do not run identically.\n2. THE PROPOSED SYNCHRONIZATION PROCEDURE or EXPERIMENT\n\n\n\nThrow a ball (B1) horizontally on a well polished surface so that it slides at a\nconstant speed v1\n\n\n\nThrow a second ball (B2) [on the same surface parallel to B1's line of\nmotion], (after a small time interval after throwing B1) at speed v2 such\nthat v2>v1; so eventually B2 will meet B1 at a later time (Event 1 or E1) .\n\n\n\nSimilarly throw a third ball (B3) at a speed v3 such that v3>v2, such that\nB3 will meet B1 (Event 2 or E2) and then later on B3 will meet B2 (event\n3 or E3)\n\n\n\nAt event E1 clocks on B2 and clock on B1 synchronize their clocks\n\n\n\nAt event E2 clocks on B3 and B1 synchronize their clocks\n\n\n\nNow both B3 and B2 are synchronized with B1 and if all clocks run\nequivalently, when B3 and B2 meet at event E3, they are expected to show\nthe same time (if all clocks run equivalently); however if clocks rate of ticking\nis a function of their speed with respect to the absolute preferred reference\nframe, then they B3 and B2 will not show the same time at event E3.\n\n\n\nIf B2 and B3 show the same time at event E3, time dilation is absent. If\nthey show different times, then that means clocks B1, B2 and B3 did not\nrun equivalently.\n\n3\n\n\f❶->\n❶->v\n\n1\n\n❷->\nEvent E1: Clocks 1 and 2 get synchronized\n\n❶->v\n\n1\n\n❷-> v\n\n2\n\n❶->v\n\n1\n\n❷->v\n❸->v\n\n2\n\n3\n\nEvent E2: Clocks 1 and 3 get synchronized.\n\n❶->v\n\n1\n\n❸->v\n\n3\n\n❷->v\n\n2\n\nIn view of events E1 and E2, clocks 3 and 2 are synchronized with clock 1.\nTherefore, Clocks 3 and 2 are expected to be synchronized assuming all clocks run in the same way.\n\nEvent E3\n\n❶->v\n\n1\n\n❷->v\n\n2\n\n❸->v\n\n3\n\nNow at event E3 when Clocks 2 and 3 meet, there synchronization can be verified.\n\n4\n\n\fSynchronisation may be a complex word; basically, it is comparison of the times shown by two\nclocks. When two clocks are compared, if they show a difference that can be noted down and\nadjusted as a correction in later observations. Or alternately/ optionally one of the clocks can be\ntweaked to show the same time as the other (this is usually called synchronisation); in this case if\nboth the clocks are good, they will show the same time at any later instance.\nIf we didn't tweak one of the clocks, then if both the clocks are good, they will show\nthe same difference in time at any later instance.\n\nHighway cars in uniform motion:\nThe three clock experiment can be re-stated as below in a everyday context:\nOn a high way three cars are cruising at 50 miles/hr, 60 miles/hr and 70 miles/hr. They all\nare cruising at these constant speeds for a while and continue at the same uniform\nconstant speed.\nCar A at speed 50 miles/hr is in the lead and Car B at speed 60 miles/hr is second and Car\nC at speed 70 miles / hr is trailing.\nEventually, At some instance, Car B overtakes car A and the passengers in the two cars\nnote their time difference as (Δ)ab = ta - tb\nNext Car C overtakes car A and the passengers note down the difference as (Δ)ac = ta - tc\nThen Car C overtakes car B and the passengers note down the time difference as (Δ)cb =\ntc – tb\nIf all clocks run equivalently (Δ)ab – (Δ)ac should be equal to (Δ)cb\nIf that was not the case, we can conclude that the clocks did not run equivalently.\n3. RELATION BETWEEN SIMULTANEITY AND LENGTH CONTRACTION\nTime dilation is the phenomenon where the observed time rate of an observer's reference frame is\ndifferent from that of a different reference frame. In special relativity, clocks that are moving with\nspeed v with respect to an inertial system of observations are found to be running slower (Møller\n1952). The formula for determining time dilation in special relativity is:\nt0 = t 1  v 2 / c 2 , where\nt0 is a time interval as measured with a 'moving' clock that is physically present at the\ntwo events under consideration,\nt is that same time interval as measured by another 'stationary' inertial frame with\nspatially separated clocks,\nv is the relative speed between the clock and the stationary system, and\n\n5\n\n\fc is the speed of light.\nThe Lorentz transformations of spatial and temporal event coordinates between two inertial\nframes in relative motion ordain that a particular clock of one frame observed from another frame\nappears to run slow, and the set of clocks in one frame appears asynchronous as well as slowing\ndown when viewed from the other frame. The asynchronicity and the slowing down seem to\ncombine to create a symmetric perception of each other's frame.\nThe question whether a moving clock runs slow or only appears to run slow is an intriguing one.\nFor all practical purposes a moving clock runs slow. However, if an observer A is attached to the\nmoving clock, his perception will be that the set of clocks in the inertial frame B that is observing\nhim are asynchronous and for this reason B concludes that the moving clock A is slowing down.\nFor the observer attached to the moving clock, the rate at which his clock is running is indeed the\n'correct' rate, and any conclusion to the contrary is due to improper synchronization, which\nindeed is the result of the slowing down of the clocks that are 'moving,' in B according to A's\nperception. According to (Sears, Zemansky, and Young 1980), there is no difficulty in\nsynchronizing two clocks in the same frame of reference; only when a clock is moving relative to\na given frame of reference do ambiguities of synchronization or simultaneity arise.\nThe perceived slowing down of clocks and possible asynchronicities between them also\ncontribute to discrepancies in length measurements (Resnick 1968). Consider a train moving at a\nvelocity v and whose length is L as measured by observers on the train. A person on the platform\nmeasures the length of this train as L 1  v 2 / c 2 . Observers on the train explain this\ndiscrepancy by the 'errors' associated with the measurements made on the platform. They\ncontend that: \"A person on the platform stands at one location with a stop watch and measures the\ntime elapsed between the passing of the two ends of the train at his location. Let this\nmeasurement be T. This person calculates the length of the train as vT. Since the clocks on the\nplatform are running slow, he calculates a smaller value for length.\" However, observers on the\nplatform have the following explanation to offer: \"The length of the train was L, when it was\nstationary. While moving at v, it has contracted to L 1  v 2 / c 2 . Since all rulers on the train\nhave also contracted by the same factor, the train continues to measure its length as L, which is in\nactuality L 1  v 2 / c 2 (while the train is moving).\"\nThus we find that the observation of length contraction in moving frames is closely related to the\nobserved slow running of clocks. It is also worthwhile to note that a \"moving\" frame in spite of\n'contracted' lengths and 'slow running' clocks measures the relative velocity correctly. The\n'stationary' observers on the train explain this as follows. The apparent \"movement\" of a point\nobject in the train's inertial frame by a distance x will be interpreted as a movement by a distance\nx' = x / 1  v 2 / c 2 by the platform due to the contraction of rulers in the platform. The time\ninterval will be measured by spatially separated clocks on the platform as\nT ' = (x/v) 1  v 2 / c 2 + (vx) / (c2 1  v 2 / c 2 ).\nThe first term indicates the slow running of clocks on the platform and the second term indicates\nthe asynchronicity in spatially separated clocks on the platform. Simplifying, we get\n\n6\n\n\fT ' = (x / (v\n\n1  v 2 / c 2 )).\n\nThe platform correctly measures the relative speed v = x' / T '. According to observers on the\ntrain, observers on the platform wrongly measured both the distance and the time, but they\ncorrectly estimated the relative speed. Thus we find that the apparent asynchronicity and slow\nrunning of clocks in a moving frame is the cause of all discrepancies in length and time-interval\nmeasurements. But it also has the compensating effect of the relative velocity between the frames\nto be observed as the same value by both the frames.\n\n4. PROCEDURE TO SYNCHRONIZE A THREE CLOCK SYSTEM\nWe describe a three-clock system from some arbitrary inertial frame in the following fashion.\nThree identical clocks k, m and n are in relative motion with velocities v, u, and w, and at some\ninstant appear as below:\nkv\n\nmu\n\nnw\n\nsuch that v > u > w. Furthermore we assume that the spatial separation of the clocks are such that\nthe events E1 (k passing m), E2 (k passing n), and E3 (m passing n) happen in the order E1, E2, E3.\nWe design our thought experiment so that when E1 occurs (that is, when k and m pass each other),\nm synchronizes its clock with k; similarly when E2 occurs (that is, when k and n pass each other),\nn synchronizes its clock with k. Thus we presume that after the event E2, both clocks m and n are\nalso synchronized as they are both synchronized with clock k.\nWe would like to examine the correctness of this presumption by applying the Lorentz\ntransformations and in particular by the actual observations of m and n as they pass each other at\nthe occurrence of event E3.\nWe denote the co-moving frames attached with the clocks k, m, and n as K, M, and N,\nrespectively. For simplicity we take our inertial reference frame to be the co-moving frame N\nattached with clock n. Thus we have w = 0, and we assume the velocities of clocks k and m to be\nv and u respectively as observed by frame N.\n5. ANALYSIS OF THE PROPOSED SYNCHRONIZATION PROCEDURE\nLet us assume that event E1 occurs at a distance s from clock n (in frame N). At this event we\nsynchronize clocks k and m so that tk = 0 and tm = 0. Clock k will reach clock n (event E2) after a\ntime of (s/v).\nHowever, clock k will show a time of tk = (s/v) 1  v 2 / c 2 when it reaches clock n because of\ntime dilation. According to the procedure set out in our thought experiment, we synchronize clock\nn with clock k when they meet at event E2. Therefore, at event E2 , tk = tn = (s/v) 1  v 2 / c 2 .\nAccording to frame N, at this time clock m would have traveled a distance u(s/v) and the distance\nremaining for clock m to reach clock n is (s – u(s/v)). This distance will be covered in a time\ninterval of (s/u) – (s/v). This time will be clocked by clock n between E2 and E3, and thus at E3\nclock n will read\n\n7\n\n\ftn = [(s/u) – (s/v)] + [(s/v) 1  v 2 / c 2 ].\nWhen clock m reaches clock n, clock m will read tm = (s/u) 1  u 2 / c 2 . This is because at E1, tm\nwas 0 and the time taken by m between E1 and E3 is s/u (as observed by frame N). This will be\nclocked as (s/u) 1  u 2 / c 2 by clock m. Thus the difference between clocks n and m when they\nmeet at the occurrence of event E3 is\ntn – tm = [(s/u) – (s/v)] + [(s/v) 1  v 2 / c 2 ] – [(s/u) 1  u 2 / c 2 ].\nThe above quantity is not zero, indicating that t n  tm.\nSince we specified the velocities of K and M with respect to N as v and u respectively, it was\nconvenient to base our reference frame as N to arrive at the time difference between clocks n and\nm. If we base our considerations from any arbitrary frame instead of frame N, then by using the\nrelativistic velocity addition formulae, it can be shown that the expression (t n – tm) remains the\nsame in value; this is as it should be because this is the difference observed by clocks n and m at\nthe same space-time point E3 , and any observation at the same space-time point is independent of\nthe reference frame.\nIn the above analysis, apart form the relative velocities between the inertial frames, we have used\n's', the distance (observed by frame N) between clocks n and k at the occurrence of E1, as a\ncharacterizing parameter of the system. We have given an alternative derivation in the appendix\nusing the time shown by clock k at the occurrence of E2 as a characterizing parameter of the\nsystem. We note that the system has only one additional parameter (apart form the relative\nvelocities between the inertial frames) and the analysis given in the appendix does not use any\ndistance variable as a parameter. Furthermore, the analysis presented in the appendix does not use\nany one inertial frame as a preferred inertial frame. The results are shown to be identical by both\nthe methods.\nHowever, the merit of the analysis presented here is that it is simple, has minimal algebra, and is\nfully in accordance with the Lorentz transformations.\n6. Numerical Example\nIt is best to illustrate the concepts advocated in this work by a numerical example.\n\nLet us say that an inertial observer (A) observes another inertial observer (B) passing\nhim and they both synchronize their clocks to show a time of 0.0 (Event 1)\nAfter some time when the clock with observer A is showing a time of 0.1, Oberver A\nobserves another inertial observer D, passing him (in the same direction as that of B)\nand D sets his time to 0.1 as shown by the clock of A. (Event 2)\nAt a later time, when D crosses B, they both observe that the clock of D is showing a\ntime of 0.28 and the clock of B is showing a time of 0.32 (Event 3)\n\n8\n\n\fOn the basis of above, a scientist may (I hope I am right) that the three clocks of A, B\nand D did not run at the same rate; or clocks in inertial frames in relative motion do not\nrun identically, as otherwise at the meeting of B and D, both clocks would have shown\nthe same time.\nIn the above numerical example, it may appear that we have used one of the three\ninertial frames associated with the three clocks (in this case that of clock A) as a\npreferred inertial frame . However, if we do not do any adjustment of clocks (Don't\nmake time=0 at the first meeting of A and B and don't make time =0.1 at the meeting of\nA and D), but simply note down the difference in time shown by the clocks at their\nrespective meetings, then\n(Δ)ab = time shown by clock A – time shown by clock B when they met at Event 1,\n(Δ)da = time shown by clock D – time shown by clock A when they met at Event 2,\n(Δ)bd = time shown by clock B – time shown by clock D when they met at Event 3,\n\nthe sum of these time differences\n(Δ)ab + (Δ)bd + (Δ)da\n\nshould be equal to zero if the three clocks A, B and D run identically. In the above\nexample, this sum will always remain 0.04 years.\nWhen we look at this in this perspective, we do not use any frame as a preferred frame\nbut yet can see that the three clocks did not run equivalently. The events and\nobservations as described in the beginning of this section in the previous page sets (Δ)ab\n= 0; (Δ)da = 0 and (Δ)bd is observed to be 0.04 years.\nBut if we just note down the difference in time at the meetings of A,B and A,D (without\nsetting the differences at these events as zero and observe the time difference at the\nmeeting of B,D at event 3, then also the above (Δ)ab + (Δ)bd + (Δ)da will remain = 0.04\nyears. Thus we have a general observation without appearing to have used the frame\nassociated with clock A as a preferred frame. This shows that independent of observers\nassociated with any frame of reference, clocks in relative uniform motion do not run\nequivalently. This conclusion is not frame dependent.\n\nExplanation of the results by Special Relativity (By Inertial frame A)\nClock B is moving at 0.6 light years/ year with respect to A\nClock D is moving at 0.8 light years/ year with respect to A\nWhen Event 2 occurred clock A had travelled a distance of 0.1x0.6 = 0.06\n\n9\n\n\fAs clock D is approaching clock B at (0.8-0.6) = 0.2, a time of 0.06/0.2 = 0.3 elapses\nbetween Event 2 and Event 3. [Please note that 0.2 is not the speed of D as observed by\nB. it is the speed of approach of D towards B as observed by A.] Therefore, time at Event\n3 as observed by inertial frame A is, time at event 2+ elapsed time between events 2\nand 3 = 0.1+0.3 = 0.4\nThus, a clock situated at the location of Event 3, in inertial frame A (stationary with\nrespect to clock A) and synchronised with clock A as per standard synchronisation will\nshow a time of 0.4. Since clock B is running slow at a factor of 1.25 with respect to\ninertial frame A, the clock B will show 0.32 at Event 3.\nSince a time of 0.3 elapsed between Event 2 and Event 3 as per inertial frame A, clocks\nin D will run up a time of (0.3/1.66667) = 0.18 as clocks in D are running slow at a rate\n[sqrt(1/1-0.82)] = 1.66667 = (5/3). As the clock D was set at time 0.1 at Event 2, at Event\n3 clock D will show a time of 0.1+0.18 = 0.28\nSimilar explanations by SRT can be constructed from the perspective of each of the\nthree inertial frames associated (co-moving) with the three clocks or any other external\ninertial frame. The explanation by SRT, implicitly assumes at every step that clocks in\ninertial frames do not run equivalently, in whichever inertial frames the observers are\nsituated. The algebraic derivation for the general case is given in the appendix.\n\n7. DISCUSSION\nIn the thought experiment described in Section 2 & 4, we have applied the principle of the\nequivalence of inertial frames and the exact algebraic formulations contained in the Lorentz\ntransformations and reached an inconsistent situation. Since the Lorentz transformations are the\nonly feasible formulation under actual or apparent equivalence of inertial frames, the thought\nexperiment proves that inertial frames are not actually equivalent but only apparently equivalent.\nThe non-zero difference in time shown by clocks n and m when they meet can be explained by\nassuming any one of the following statements:\n1.\n2.\n3.\n4.\n\nFrame K is stationary and isotropic. Clocks m and n run slow with respect to K.\nFrame M is stationary and isotropic. Clocks k and n run slow with respect to M.\nFrame N is stationary and isotropic. Clocks k and m run slow with respect to N.\nAny other arbitrary inertial reference frame S is stationary and isotropic. Clocks k, m, and\nn run slow with respect to S as a function of their velocities.\n\nWe observe that in none of the above scenarios do clocks k, m, and n run identically. So we may\nconclude that clocks in relative motion do not run identically. There are two possible\nconsequences of this result. One possible consequence is that there exists a unique isotropic\n'stationary' reference frame S, with respect to which physical processes and clocks run slow in all\nother inertial frames (which are in relative motion with respect to S).\nThe other possible consequence is that clocks k, m and n are traces on the space-time continuum.\nThe three events E1, E2 and E3 are the intersection of these traces (like vertices of a triangle). This\n\n10\n\n\fpossibility visualizes any particular existence of a clock k, m or n at a space-time point as a\npermanent etching on the space-time continuum. Here the temporal sequences are only an\ninterpretation of a particular inertial frame and in the space-time continuum there is no specific\nsequence, either temporal or spatial.\n8. CONCLUSION\nThe numerical example explained in section 6 clearly establishes that clocks in relative uniform\nmotion do not run equivalently and this result is an objective result (not frame dependent). The\nordered summation of the time differences between the clocks at the three meeting points, should\nadd to null result if the clocks ran equivalently. The result predicted by SRT, proves that the three\nclocks ticked at different rates and this observation is not frame dependent.\nREFERENCES\nBohm, D. (1965). The Special Theory of Relativity. W. A. Benjamin, New York, pp. 68-69.\nEinstein A. (1905). Zur Elektrodynamik bewegter Körper. Ann. Phys. (Leipzig) 17, pp. 891-921.\nEinstein, A. (1961). Relativity, The Special and General Theory, Authorized Translation by\nRobert W. Lawson, Three Rivers Press, New York, p. 32.\nMacdonald, A. (2005). Comment on 'The role of dynamics in the synchronization problem,' by\nH. Ohanian, Am. J. Phys. 72 (2), 141-148 (2004). Am. J. Phys. 73 (5), pp. 454-455.\nMartinez, A. (2005). Conventions and inertial reference frames. Am. J. Phys. 73 (5). pp. 452-454.\nMøller, C. (1952). The Theory of Relativity. Oxford University Press, p 48.\nOhanian, H. (2004). The role of dynamics in the synchronization problem. Am. J. of Phys. 72 (2),\npp. 141-148.\nOhanian, H. (2005). Reply to Comment (s) on 'The role of dynamics in the synchronization\nproblem' by A. Macdonald, [Am. J. Phys. 73, 454 (2005)] and A. Martinez [Am. J. Phys.\n73, 452 (2005). Am. J. Phys. 73 (5), pp. 456-457.\nReichenbach, H. (1958). The Philosophy of Space and Time. Dover, New York, p. 127.\nResnick, R. (1968). Introduction to Special Relativity. John Wiley and Sons, pp. 82-83.\nRowland, D. (2006). Noninertial observers in special relativity and clock synchronization\ndebates. Found Phys. Letters. 19 (2), pp. 103-126.\nSears F., Zemansky M., and Young H. (1980). University Physics, Addison-Wesley, p.254.\nSelleri, F. (1996). Noninvariant one-way velocity of light. Found. Phys. 26, pp. 641-664.\nAPPENDIX: GENERAL ANALYSIS OF RESULT IN SECTION 5\n\n11\n\n\fLet there be three inertial frames, K, M, and N with origins O, O′, and O′′ respectively. Let the\nevent coordinates of any event be (x, t) in frame K, (x′, t′ ) in frame M, and (x′′, t′′) in frame N. Let\nthe event of the meeting of O and O′ be E1, that of O and O′′ be E2, and that of O′ and O′′ be E3.\nLet the time order of occurrence of the three events be E1, E2, and E3, in that order.\nLet the velocity of frame K with respect to frame N be v and that of frame M with respect to\nframe N be u. We assume that v > u.\nBy the principle of the relativistic velocity addition formula, the velocity of frame K with respect\nto frame M is p \n\nvu\nand the velocity of frame M with respect to frame K is –p.\nvu\n1 2\nc\n\nStatement (AA): Let O and O′ synchronize their clocks to t = t′ = 0 at event E1.\nStatement (BB): Let O and O′′ synchronize their clocks to t′′ = t = t0 , where t0 is the time shown\nby a clock at O at the occurrence of event E2. (Note that O does not alter its time.)\nFrom statement (AA) we derive the transformation of event coordinates between frames K and M\nas shown in equation (1).\n\nx \n\nx  pt\n\n; t \n\n1 p2 c2\n\nt  px c 2\n1 p2 c2\n\n(1)\n\nFrom statement (BB) we derive the transformation of event coordinates between frames K and N\nas shown in equation (2).\n\nx \n\nx  v(t  t 0 )\n1 v2 c2\n\n; t   t 0 \n\n(t  t 0 )  vx c 2\n1 v2 c2\n\n(2)\n\nFrom Equation (1), x and t can be written as shown in equation (3).\n\nx\n\nx   pt \n1 p2 c2\n\n;t\n\nt   px  c 2\n1 p2 c2\n\n(3)\n\nSubstituting the values of x and t obtained from equation (3) into equation (2), the direct\ntransformation between frames M and N are as shown in equations (4a) and (4b).\n\n t   px  c 2\n\n v\n t0 \n 1 p2 c2\n\n1 p2 c2\n\n\nx  \n2\n2\n1 v c\nx   pt \n\n(4a)\n\n12\n\n\f t   px  c 2\n v  x   pt \n\n t0   2 \n 1 p2 c2\n c  1 p2 c2\n\n\nt   t 0  \n2\n2\n1 v c\n\n\n\n\n\n\n(4b)\n\nThe event E3 is characterized by x′ = 0 and x′′ = 0. Substituting x′ = 0 into equation (4b) we get\n\n\n v \n\nt\npt \n\n\n t0   2 \n 1 p2 c2\n c  1 p2 c2 \n\n\n\nt   t 0  \n2\n2\n1 v c\nLet  v \n\n1\n1 v2 / c2\n\nand  p \n\nwe obtain after simplification,\n\n1\n\n(5)\n\n. Substituting x′ = 0 and x′′ = 0 into equation (4a),\n\n1 p2 / c2\nt 0  t (1  p v) p\n\n(6)\n\nSubstituting the value of t0 from equation (6) into equation (5), we get\n\n1\npv\n\n\n (1  p / v) p \n\n\n2\n2\n2\n2\n2\nc 1 p c \n 1 p c\nt   t (1  p / v) p  t \n\n1 v2 c2\n\n\n\n\n\n\n= t  p [1  ( p / v)  ( p / v) v \n\npv\n v].\nc2\n\nAfter simplifying, we obtain the ratio of t′′ to t′ as shown in equation (7).\n\n\nt \np\n  p 1  ( p / v) \nt\nv v\n\n\n\n\n\n\n(7)\n\nThe right hand side of equation (7) is not equal to 1, indicating that t   t  . This result is\nindependent of any chosen observing inertial frame. For example, if the analysis is carried out\nfrom frame N (as shown in Section 5), the ratio of times is\n\ntn\nu u\n (1  u / v) u \ntm\nv v\n1\nwhere  u \n.\n1 u2 / c2\n\n(8)\n\n13\n\n\fUsing the relativistic velocity addition formula, p \n\nvu\n, and after simplification, it can be\nvu\n1 2\nc\n\nshown that the expression on the right hand side of equation (8) is identical to the expression on\nthe right hand side of equation (7). Hence the result in equation (7) is the same if the observations\nare made from frames K, M, N, or any other arbitrary inertial frame S.\n\n14\n\n\f"}