{"id": "http://arxiv.org/abs/0810.2934v1", "guidislink": true, "updated": "2008-10-16T14:52:22Z", "updated_parsed": [2008, 10, 16, 14, 52, 22, 3, 290, 0], "published": "2008-10-16T14:52:22Z", "published_parsed": [2008, 10, 16, 14, 52, 22, 3, 290, 0], "title": "Implementing invariant mass cuts and finite lifetime effects in\n  top-antitop production at threshold", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0810.3428%2C0810.2462%2C0810.2923%2C0810.0817%2C0810.0155%2C0810.1681%2C0810.4740%2C0810.1571%2C0810.3610%2C0810.4352%2C0810.0363%2C0810.2352%2C0810.2934%2C0810.4081%2C0810.2998%2C0810.4150%2C0810.4434%2C0810.3239%2C0810.5717%2C0810.3953%2C0810.1575%2C0810.0445%2C0810.1950%2C0810.5366%2C0810.0685%2C0810.0834%2C0810.4812%2C0810.5603%2C0810.1454%2C0810.0231%2C0810.4922%2C0810.2909%2C0810.5449%2C0810.2171%2C0810.3314%2C0810.1818%2C0810.0079%2C0810.4405%2C0810.2625%2C0810.5408%2C0810.2648%2C0810.0241%2C0810.0072%2C0810.5526%2C0810.2691%2C0810.0509%2C0810.3146%2C0810.1265%2C0810.3356%2C0810.2837%2C0810.0496%2C0810.3276%2C0810.0637%2C0810.0774%2C0810.2819%2C0810.3755%2C0810.3892%2C0810.0729%2C0810.4909%2C0810.4333%2C0810.1929%2C0810.1174%2C0810.2568%2C0810.3242%2C0810.4008%2C0810.2460%2C0810.5210%2C0810.4326%2C0810.0660%2C0810.2182%2C0810.1545%2C0810.2311%2C0810.5037%2C0810.3670%2C0810.0201%2C0810.1274%2C0810.0223%2C0810.1714%2C0810.2020%2C0810.3531%2C0810.4448%2C0810.5755%2C0810.1802%2C0810.0437%2C0810.2401%2C0810.1624%2C0810.5546%2C0810.5152%2C0810.2373%2C0810.1198%2C0810.2864%2C0810.0102%2C0810.3592%2C0810.2066%2C0810.4281%2C0810.2358%2C0810.5419%2C0810.0336%2C0810.1605%2C0810.4389%2C0810.2325&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Implementing invariant mass cuts and finite lifetime effects in\n  top-antitop production at threshold"}, "summary": "The effects of the finite top quark width in the top pair production cross\nsection close to the threshold are discussed in this talk. We introduce a\n$t\\bar{t}$ cross section with a cut on the invariant masses of the top and\nantitop that can be calculated theoretically with effective field theory (EFT)\nmethods. The matching procedure to implement the physical phase-space\nboundaries in the NRQCD framework (``phase-space matching'') is briefly\noutlined.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0810.3428%2C0810.2462%2C0810.2923%2C0810.0817%2C0810.0155%2C0810.1681%2C0810.4740%2C0810.1571%2C0810.3610%2C0810.4352%2C0810.0363%2C0810.2352%2C0810.2934%2C0810.4081%2C0810.2998%2C0810.4150%2C0810.4434%2C0810.3239%2C0810.5717%2C0810.3953%2C0810.1575%2C0810.0445%2C0810.1950%2C0810.5366%2C0810.0685%2C0810.0834%2C0810.4812%2C0810.5603%2C0810.1454%2C0810.0231%2C0810.4922%2C0810.2909%2C0810.5449%2C0810.2171%2C0810.3314%2C0810.1818%2C0810.0079%2C0810.4405%2C0810.2625%2C0810.5408%2C0810.2648%2C0810.0241%2C0810.0072%2C0810.5526%2C0810.2691%2C0810.0509%2C0810.3146%2C0810.1265%2C0810.3356%2C0810.2837%2C0810.0496%2C0810.3276%2C0810.0637%2C0810.0774%2C0810.2819%2C0810.3755%2C0810.3892%2C0810.0729%2C0810.4909%2C0810.4333%2C0810.1929%2C0810.1174%2C0810.2568%2C0810.3242%2C0810.4008%2C0810.2460%2C0810.5210%2C0810.4326%2C0810.0660%2C0810.2182%2C0810.1545%2C0810.2311%2C0810.5037%2C0810.3670%2C0810.0201%2C0810.1274%2C0810.0223%2C0810.1714%2C0810.2020%2C0810.3531%2C0810.4448%2C0810.5755%2C0810.1802%2C0810.0437%2C0810.2401%2C0810.1624%2C0810.5546%2C0810.5152%2C0810.2373%2C0810.1198%2C0810.2864%2C0810.0102%2C0810.3592%2C0810.2066%2C0810.4281%2C0810.2358%2C0810.5419%2C0810.0336%2C0810.1605%2C0810.4389%2C0810.2325&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "The effects of the finite top quark width in the top pair production cross\nsection close to the threshold are discussed in this talk. We introduce a\n$t\\bar{t}$ cross section with a cut on the invariant masses of the top and\nantitop that can be calculated theoretically with effective field theory (EFT)\nmethods. The matching procedure to implement the physical phase-space\nboundaries in the NRQCD framework (``phase-space matching'') is briefly\noutlined."}, "authors": ["Andre H. Hoang", "Christoph J. Reisser", "Pedro Ruiz-Femenia"], "author_detail": {"name": "Pedro Ruiz-Femenia"}, "author": "Pedro Ruiz-Femenia", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1016/j.nuclphysbps.2008.12.091", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/0810.2934v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0810.2934v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "4 pages, 4 figures. Talk given at the 14th International QCD\n  Conference (Montpellier 7-12th July 2008)", "arxiv_primary_category": {"term": "hep-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "hep-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0810.2934v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0810.2934v1", "journal_reference": "Nucl.Phys.Proc.Suppl.186:403-406,2009", "doi": "10.1016/j.nuclphysbps.2008.12.091", "fulltext": "arXiv:0810.2934v1 [hep-ph] 16 Oct 2008\n\nImplementing invariant mass cuts and finite lifetime effects in top-antitop\nproduction at threshold\nA. Hoanga , C. Reissera,b and P. Ruiz-Femenı́ac∗\na\nb\nc\n\nMax-Planck-Institut für Physik, Föhringer Ring 6, D–80805 München, Germany\nInstitut für Theoretische Teilchenphysik, Universität Karlsruhe, D-76128 Karlsruhe, Germany\nInstitut für Theoretische Physik E, RWTH Aachen, D–52056 Aachen, Germany\n\nThe effects of the finite top quark width in the top pair production cross section close to the threshold are\ndiscussed in this talk. We introduce a tt̄ cross section with a cut on the invariant masses of the top and antitop that\ncan be calculated theoretically with effective field theory (EFT) methods. The matching procedure to implement\nthe physical phase-space boundaries in the NRQCD framework (\"phase-space matching\") is briefly outlined.\n\nThe measurement of the σ(e+ e− → tt̄) line\nshape at a linear collider (LC) operatingp\nat energies around the top-antitop threshold ( q 2 ∼\n350 GeV) would allow for very accurate determinations of the mass, the width and the couplings\nof the top quark [1]. In view of the accuracy obtainable at the LC the theoretical uncertainties\nfor the cross section predictions should be lowered to a level of a few percent [2].\nClose to threshold the top quark pairs are produced with small velocities v ≪ 1. In the standard QCD perturbative expansion singular terms\n∼ αs /v, αs log v arise from the ratios of the physical scales involved: the top mass mt , the relative\nthree-momentum p ∼ mt v and the nonrelativistic\nenergy E ∼ mt v 2 . The summation of these terms\ncan be achieved systematically by means of nonrelativistic QCD (NRQCD), the low-energy EFT\nthat describes the quantum fluctuations of full\nQCD for the kinematic situation of top quarks\nclose to threshold. Renormalization group improved calculations of the tt̄ total cross section\nwith NNLL order accuracy for the QCD effects\nhave become available in this framework [3].\nA study of electroweak corrections in tt̄ production at threshold beyond leading order has not\nbeen systematically undertaken until recently [4,\n\n5]. The large top width, being of the same order as the nonrelativistic energy, is essential in\nthe description of the tt̄ threshold dynamics. The\ndominant top decay mode in the Standard Model\nis t → bW + , which gives Γt ∼ 1.5 GeV. It was\nshown [6] that in the nonrelativistic limit the topquark width can be consistently implemented by\nthe replacement E → E + iΓt in the results for\nthe total cross section for stable top quarks. This\nreplacement rule accounts for the LL electroweak\ncorrections to the total tt̄ cross section, but a complete treatment at NLL and NNLL requires the\nuse of an extended NRQCD formalism accounting\nfor the top quark instability.\nIn the NRQCD framework the quark width effects are incorporated at leading order through\nthe bilinear quark operators\nX\nX\ni\ni\nδL =\nψp† Γt ψp +\n(1)\nχ†p Γt χp .\n2\n2\np\np\nThey represent a LL effect as compared to the\ntypical energy of a Coulombic top quark, of the\norder of a few GeV. The terms in Eq. (1) describe\nan absorptive on-shell process that has been integrated out from the theory. In this way, the\nEFT does not contain any details and differential information of the decay, but can predict the\ntotal cross section, an inclusive observable. We\ncan use the optical theorem to compute the total\ncross section from the imaginary part of the e+ e−\nforward scattering amplitude (see Fig 1). The\n\n∗I\n\nwould like to thank S.Narison and his crew for the pleasant atmosphere during the conference. This work is partly\nsupported by the DFG, SFB/TR9. Preprint MPP-2008137, SFB/CPP-08-84, PITHA 08/28.\n\n1\n\n\f2\n\nb\n\ne−\n\nt\n\nEFT\n\nW+\n\nt̄\n\n∼\n\n−→\n\nW−\n\ne+\n\np4\n8m3t\n\ne−\n\nVc\n\ne+\n\nb̄\n\nFigure 1. Tree-level double-resonant diagrams in\nthe full and effective theories. The dashed line\nmeans we extract the imaginary part or, equivalently, that we perform the phase space integration along the cut lines.\ncoefficients in Eq. (1) are determined from the\nmatching procedure of the EFT to the full theory (QCD and the electroweak theory). The contributions from real bW final states are thus included through matching conditions of the EFT.\nThe LO bilinear quark terms in the NRQCD Lagrangian lead to the propagator\ni\np0 −\n\np2 /(2m\n\nt)\n\n+ iΓt /2\n\n(2)\n\nfor a top/antitop with momentum (p0 , p) ∼\n(mt v 2 , mt v). The inclusion of a finite width in\nthe top propagator modifies the high-energy behaviour of the phase-space integrations in the\nEFT. Let us illustrate this with an example. Consider the double-resonant diagram of Fig. 1 in\nthe full theory with center of mass momentum\nq = (2mt + E, 0). When the quark lines are close\nto their mass shell the 4-particle phase space integration reduces to\nZ +∞ Z +∞\nΓ2t\n(3)\nσtt̄ ∼\ndp0\nd|p|p2\n|t1 + iǫ|2 |t2 + iǫ|2\n−∞\n0\nwhere the variables t1,2 ≡ t1,2 (p0 , p) = 2mt ( E2 ±\n2\n\n# v 2αs\nm2t ǫ\n\np\np0 − 2m\n) retain the leading order terms in the\nt\nnonrelativistic expansion of the top and antitop off-shellness. The Γ2t factor in the numerator arises from the phase-space integration of\nthe bW + and b̄W − subsystems because in the\nnonrelativistic limit the invariant masses of the\ntop/antitop quark can be set to m2t .\nWe notice that though the phase-space in the\nfull theory is cut-off by the top mass, the nonrelativistic limit formally makes mt → ∞ and the\nphase-space boundaries are thus taken to infin-\n\nFigure 2. (e+ e− )(e+ e− ) scattering amplitude\nwith a kinetic energy correction and a Coulomb\npotential. Its imaginary part gives a NNLO divergent contribution to σtt̄ .\nity2 . The corresponding NRQCD amplitude (diagram on the right in Fig. 1) reproduces Eq. (3)\nwhen Γt is treated as an insertion. The NRQCD\npowercounting, however, tells that the Γt ∼ E\nterm needs to be resummed as part of the top\npropagator (see Eq.(2)), thus effectively replac2\ning replacing\np iǫ → iΓt , to finally give σtt̄ ∝ v/mt ,\nwith v = (E + iΓt )/mt .\nDespite the integration limits, the tree-level\nintegration in Eq. (3) is finite. However the\nintegrand becomes more sensitive to large momentum regions once we include relativistic corrections ∼ p2 /m2t . Using dimensional regularization these subleading contributions can lead\nto 1/ǫ singularities if the high energy behaviour\nof the EFT phase-space integration is logarithmic. This occurs for some of the NNLO matrix elements containing a single insertion of the\nCoulomb potential and a p2 /m2t correction. Figure 2 shows an example. Similar UV divergences\nhad also been noted in Ref. [4], where the imaginary parts of the NRQCD matching conditions\nat NNLL coming from W b cuts in the full theory were determined and inserted into NRQCD\nmatrix elements. These UV divergences would\nnot exist for a stable top quark. These phase\nspace divergences can be handled with the usual\nEFT renormalization techniques. In this specific example the UV divergences are absorbed\nby (e+ e− )(e+ e− ) operators that will thus have\ncomplex Wilson coefficients C̃V /A (μ) [4]. The\nimaginary parts of these Wilson coefficients contribute to the tt̄ cross section through the optical theorem, ∆σt̄t = Im[C̃V + C̃A ]. The renor2 Note\n\nthat the arguments of the delta and step functions\nin the phase-space also have to be expanded out in the\nspirit of the threshold expansion.\n\n\f3\n\n|p2t − m2t | ≤ Λ2 ,\n\n(4)\n\nand similarly for the antitop. In the nonrelativistic limit, the top and antitop off-shellness are\ncharacterized by the variables t1,2 (p0 , p). The\ncutoff Λ divides the phase-space into three different regions: the double-resonant region, with\nboth |t1,2 | < Λ2 , the single-resonant regions, corresponding to (|t1 | < Λ2 , |t2 | > Λ2 ) or (|t2 | < Λ2 ,\n|t1 | > Λ2 ), and the non-resonant region, where\nboth |t1,2 | > Λ2 . The regions are shown in the\nphase-space diagram in Fig. 3 (gray, light-gray\nand white, respectively). The red lines in Fig. 3\ncorrespond to the top and antitop on-shell conditions t1,2 = 0. For the case Γt = 0, the cut\nthrough the top and antitop EFT propagators\nyields a delta function instead of a Breit-Wigner\ndistribution, and the phase-space shrinks to the\npoint given by\n√ the intersection of the two on-shell\nlines (|p| = mE). Restricting the phase-space\nboundaries to the double-resonant region defines\na new threshold tt̄ cross section, σtt̄ (Λ), that\ncorresponds to taking into account only those\n\n40\n20\np0 HGeVL\n\nmalization procedure of course does not determine the matching conditions at the hard scale,\nC̃V /A (μ = mt ), and a matching prescription is required in order to put back into the EFT the information about the physical phase-space boundaries. A possible approach is to define the matching condition as the difference between the full\ntheory computation for the bW + b̄W − total cross\nsection (considering b and W as stable) and the\nNRQCD result, similarly to the procedure used in\nRef. [7] for the case of W + W − threshold production. Obviously, the full theory computation with\nthe 4-particle final state is a rather complicated\ntask beyond tree-level, even if an asymptotic expansion technique is employed.\nAt this point, a different path can be followed,\nthat will reduce the amount of full theory input\nrequired and allow us to make contact with the\nexperimentally measured cross section. Among\nthe experimental cuts that need to be applied to\nselect bW + b̄W − events in tt̄ production, cuts on\nthe top and antitop invariant masses will be essential. Close to the threshold, it is more natural\nto define the cut on the the top invariant mass\nsquared p2t with respect to its on-shell value, i.e.\n\n0\n\n-20\n\n-40\n20\n\n40\n\n60\n80\nÈpÈHGeVL\n\n100\n\n120\n\nFigure 3. Phase-space integration region spanned\nin the (p0 , p) variables. We have chosen E =\n5 GeV and Λ = 80 GeV for this example.\nmeasured bW + and bW − events with invariant\nmasses inside the window given by the condition\n(4). The cutoff captures the double-resonant region where the top and antitop are close to their\nmass-shell and the NRQCD expansion applies. It\nexcludes those parts of the phase space that are\nnot described well by the EFT. The latter is true\nprovided that the value of Λ formally satisfies\n(E, Γ) ≪ Λ2 /mt ≪ mt . The physical meaning\nof the new matching condition,\n.\nIm C̃V /A = σtt̄ (Λ) − σtEFT\n,\n(5)\nt̄\nbecomes thus clear in this approach: it corrects\nfor the wrong behaviour of the effective propagators outside the nonrelativistic domain (σtEFT\nis\nt̄\nthe standard NRQCD result, i.e. for Λ → ∞).\nWe can go a step further by realizing that inside the double-resonant region the full theory\ncutoff cross section σtt̄ (Λ) can be nonrelativistically expanded since Λ ≪ mt . The computation\nof σtt̄ (Λ) can thus be carried out using NRQCD\nFeynman rules and, in this way, the whole approach is interpreted as a matching procedure\nwithin the EFT itself. There are of course contributions with the same bW + b̄W − final state\nthat are not described by the EFT computation\n(the interferences of amplitudes containing a single top/antitop line, for example). The latter\nare part of the irreducible background, whose numerical contribution to σtt̄ (Λ) can be estimated\nusing the tree-level predictions since there is no\nCoulomb-enhancement for these terms at higher\norders in αs .\nThe coefficients C̃V /A provide the corrections to\n\n\f4\n\n−\n\nIm C̃V /A ∼\nΛ2\n\nFigure 4. O(α0s ) phase-space matching.\nthe standard NRQCD result due to phase-space\neffects at a practical level. From a formal point\nof view, we have overlooked the fact that the corrections C̃V /A defined through Eq. (5) are energy\ndependent, and cannot be cast as the Wilson coefficients of local (e+ e− )(e+ e− ) operators. A local\naction is needed in order to use the optical theorem to determine the cross section from the imaginary part of the e+ e− forward scattering amplitude. The natural solution is to write the corrections C̃V /A as the coefficients of an operator product expansion in (e+ e− )(e+ e− ) operators with increasing powers of time derivatives i∂0 ∼ E. This\nis achieved practically by expanding the phasespace effects in powers of E/Λ. For example, the\nmatching of the O(α0s ) diagram shown schematically in Fig. 4 yields the phase-space correction:\n\u0011\nX \u0010 E \u0011n (n)\nmt E\ni Γt \u0010\n1+\n+ ...\n(6)\nC̃V /A ∼ 2\n2\nmt\nmt Λ\n3Λ\nn\nAs expected, the result vanishes for Γt → 0. We\nalso note that the non-local contribution ∝ v in\nthe diagrams of Fig. 4 cancels in the difference.\nThe term proportional to Γt /Λ gives the dominant phase-space correction to the tt̄ cross section, whose relevance will depend on the chosen\nvalue for the cutoff. We mentioned above that\nour approach is formally valid for Λ2 /mt ≪ mt .\nThis condition may seem necessary due to the\nappearance of powers of Λ2 /m2t when higher dimensional operators are considered. However, a\nnumerical analysis of the coefficients of such contributions shows that the OPE series has a good\nconvergence even for values of Λ close to mt , although smaller values (Λ <\n∼ 0.6mt ) are required\nto lower their size below the desired accuracy of\n1%. We shall use the counting Λ ∼ mt to identify the order at which the phase-space matching\ncorrections contribute. In this scheme, the correction from Eq. (6) scales as Γ/Λ ∼ v 2 , and thus\n\nrepresents a NLO correction.\nThe NRQCD calculation of the tt̄ cross section\nsums up the insertions of Coulomb potentials to\nall orders in αs . Since the suggested OPE expansion of the phase-space corrections necessarily involves a matching of diagrams with a given\norder in v and αs , we have to test also the convergence of the matching corrections arising from\nthe addition of Coulomb potentials. The insertion of a Coulomb potential yields a factor αs /v\nfor Λ → ∞; therefore we shall expect a suppression factor αs mt /Λ for every Coulomb exchange\nadded to the matching relation of Fig. 4. An optimal range of values for the cutoff is to be determined in order to find the required suppression of both the (Λ2 /m2t )k power-counting breaking terms and the (αs mt /Λ)k Coulomb phasespace corrections. Let us note that the phasespace matching of the (e+ e− )(e+ e− ) operators at\n2-loops requires the removal of Λ-dependent nonlocal terms by 1-loop diagrams with phase-space\nsubtractions in the production currents, in analogy to the process of removal of subdivergences\nin the usual renormalization procedure.\nResults for all the phase-space corrections\nneeded for a determination of the threshold tt̄\ncross section with NNLL accuracy and a complete numerical analysis shall be presented in a\nforthcoming publication.\nREFERENCES\n1. M. Martinez and R. Miquel, Eur. Phys. J. C\n27 (2003) 49.\n2. A. Hoang, PoS TOP2006 (2006) 032.\n3. A. Hoang et al., Phys. Rev. Lett. 86 (2001)\n1951; A. Hoang et al., Phys. Rev. D65 (2002)\n014014; A. Pineda and A. Signer, Nucl. Phys.\nB 762 (2007) 67.\n4. A. Hoang and C. Reisser, Phys. Rev. D71\n(2005) 074022.\n5. A. Hoang and C. Reisser, Phys. Rev. D74\n(2006) 034002.\n6. V. Fadin and V. Khoze, JETP Lett. 46 (1987)\n525; V. Fadin and V. Khoze, Sov. J. Nucl.\nPhys. 48 (1988) 309.\n7. M. Beneke et al., Nucl. Phys. B792 (2008) 89;\nS. Actis et al., arXiv:0807.0102 [hep-ph].\n\n\f"}