{"id": "http://arxiv.org/abs/1106.5759v2", "guidislink": true, "updated": "2012-04-14T07:12:52Z", "updated_parsed": [2012, 4, 14, 7, 12, 52, 5, 105, 0], "published": "2011-06-28T18:47:54Z", "published_parsed": [2011, 6, 28, 18, 47, 54, 1, 179, 0], "title": "Supercurrent through grain boundaries in the presence of strong\n  correlations", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1106.3834%2C1106.4940%2C1106.4641%2C1106.5117%2C1106.1027%2C1106.5882%2C1106.3536%2C1106.5844%2C1106.5363%2C1106.3341%2C1106.1458%2C1106.1809%2C1106.2305%2C1106.2474%2C1106.4553%2C1106.2711%2C1106.0443%2C1106.1556%2C1106.3990%2C1106.6250%2C1106.1056%2C1106.4980%2C1106.2449%2C1106.5632%2C1106.6174%2C1106.5469%2C1106.0563%2C1106.2756%2C1106.0014%2C1106.3906%2C1106.3403%2C1106.2446%2C1106.4289%2C1106.1972%2C1106.1897%2C1106.1555%2C1106.3952%2C1106.3787%2C1106.1925%2C1106.5650%2C1106.4937%2C1106.5992%2C1106.4115%2C1106.1691%2C1106.3549%2C1106.2793%2C1106.1519%2C1106.4585%2C1106.2476%2C1106.5120%2C1106.2950%2C1106.3842%2C1106.0455%2C1106.4129%2C1106.1180%2C1106.5049%2C1106.5020%2C1106.6143%2C1106.4109%2C1106.6188%2C1106.6272%2C1106.4666%2C1106.3813%2C1106.4648%2C1106.2648%2C1106.5280%2C1106.1030%2C1106.3941%2C1106.3661%2C1106.1545%2C1106.1955%2C1106.5576%2C1106.1909%2C1106.3417%2C1106.5299%2C1106.3104%2C1106.3282%2C1106.2839%2C1106.4928%2C1106.1578%2C1106.4901%2C1106.3830%2C1106.5026%2C1106.0524%2C1106.5842%2C1106.4869%2C1106.5614%2C1106.4307%2C1106.5393%2C1106.4961%2C1106.6325%2C1106.4414%2C1106.2566%2C1106.5418%2C1106.2726%2C1106.4975%2C1106.1176%2C1106.3850%2C1106.5759%2C1106.4556%2C1106.0478&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Supercurrent through grain boundaries in the presence of strong\n  correlations"}, "summary": "Strong correlations are known to severely reduce the mobility of charge\ncarriers near half-filling and thus have an important influence on the current\ncarrying properties of grain boundaries in the high-$T_c$ cuprates. In this\nwork we present an extension of the Gutzwiller projection approach to treat\nelectronic correlations below as well as above half-filling consistently. We\napply this method to investigate the critical current through grain boundaries\nwith a wide range of misalignment angles for electron- and hole-doped systems.\nFor the latter excellent agreement with experimental data is found. We further\nprovide a detailed comparison to an analogous weak-coupling evaluation.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1106.3834%2C1106.4940%2C1106.4641%2C1106.5117%2C1106.1027%2C1106.5882%2C1106.3536%2C1106.5844%2C1106.5363%2C1106.3341%2C1106.1458%2C1106.1809%2C1106.2305%2C1106.2474%2C1106.4553%2C1106.2711%2C1106.0443%2C1106.1556%2C1106.3990%2C1106.6250%2C1106.1056%2C1106.4980%2C1106.2449%2C1106.5632%2C1106.6174%2C1106.5469%2C1106.0563%2C1106.2756%2C1106.0014%2C1106.3906%2C1106.3403%2C1106.2446%2C1106.4289%2C1106.1972%2C1106.1897%2C1106.1555%2C1106.3952%2C1106.3787%2C1106.1925%2C1106.5650%2C1106.4937%2C1106.5992%2C1106.4115%2C1106.1691%2C1106.3549%2C1106.2793%2C1106.1519%2C1106.4585%2C1106.2476%2C1106.5120%2C1106.2950%2C1106.3842%2C1106.0455%2C1106.4129%2C1106.1180%2C1106.5049%2C1106.5020%2C1106.6143%2C1106.4109%2C1106.6188%2C1106.6272%2C1106.4666%2C1106.3813%2C1106.4648%2C1106.2648%2C1106.5280%2C1106.1030%2C1106.3941%2C1106.3661%2C1106.1545%2C1106.1955%2C1106.5576%2C1106.1909%2C1106.3417%2C1106.5299%2C1106.3104%2C1106.3282%2C1106.2839%2C1106.4928%2C1106.1578%2C1106.4901%2C1106.3830%2C1106.5026%2C1106.0524%2C1106.5842%2C1106.4869%2C1106.5614%2C1106.4307%2C1106.5393%2C1106.4961%2C1106.6325%2C1106.4414%2C1106.2566%2C1106.5418%2C1106.2726%2C1106.4975%2C1106.1176%2C1106.3850%2C1106.5759%2C1106.4556%2C1106.0478&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Strong correlations are known to severely reduce the mobility of charge\ncarriers near half-filling and thus have an important influence on the current\ncarrying properties of grain boundaries in the high-$T_c$ cuprates. In this\nwork we present an extension of the Gutzwiller projection approach to treat\nelectronic correlations below as well as above half-filling consistently. We\napply this method to investigate the critical current through grain boundaries\nwith a wide range of misalignment angles for electron- and hole-doped systems.\nFor the latter excellent agreement with experimental data is found. We further\nprovide a detailed comparison to an analogous weak-coupling evaluation."}, "authors": ["F. A. Wolf", "S. Graser", "F. Loder", "T. Kopp"], "author_detail": {"name": "T. Kopp"}, "author": "T. Kopp", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1103/PhysRevLett.108.117002", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1106.5759v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1106.5759v2", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "4 pages, 3 figures", "arxiv_primary_category": {"term": "cond-mat.supr-con", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cond-mat.supr-con", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1106.5759v2", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1106.5759v2", "journal_reference": "Phys. Rev. Lett. 108, 117002 (2012)", "doi": "10.1103/PhysRevLett.108.117002", "fulltext": "Supercurrent through grain boundaries in the presence of strong correlations\nF. A. Wolf, S. Graser, F. Loder, and T. Kopp\n\narXiv:1106.5759v2 [cond-mat.supr-con] 14 Apr 2012\n\nCenter for Electronic Correlations and Magnetism, Institute of Physics,\nUniversity of Augsburg, D-86135 Augsburg, Germany\n(Dated: August 4, 2018)\nStrong correlations are known to severely reduce the mobility of charge carriers near half-filling\nand thus have an important influence on the current carrying properties of grain boundaries in the\nhigh-Tc cuprates. In this work we present an extension of the Gutzwiller projection approach to\ntreat electronic correlations below as well as above half-filling consistently. We apply this method to\ninvestigate the critical current through grain boundaries with a wide range of misalignment angles\nfor electron- and hole-doped systems. For the latter excellent agreement with experimental data is\nfound. We further provide a detailed comparison to an analogous weak-coupling evaluation.\nPACS numbers: 74.81.-g, 74.25.Sv, 74.50.+r, 74.45.+c\n\nIntroduction.- The\nmanufacturing\nof\nhightemperature superconducting cables as well as the\ncharacterization of well-defined interfaces and contacts\nfor superconducting microwave electronics have been\noptimized over the last 20 years so that they are now\nfound in applications ranging from short range power\nsupply to medical instrumentation. This was made\npossible by intensive experimental and theoretical\nresearch, which has led to a better understanding of\nthe bulk as well as the interface properties of high-Tc\nmaterials [1–9]. One of the most complex and puzzling\nproblems in this respect is the strong reduction of the\ncritical current jc as a function of the grain boundary\n(GB) angle, which has been extensively studied on\nsamples with artificially fabricated, well defined GBs [1].\nAlthough great progress has been made to reduce the\ninfluence of large angle GBs on the total current [10] and\nto locally improve their current carrying properties [11],\na full theoretical understanding of the grain boundary\nproblem is hampered by the complexity of the physics\ninvolved. In a recent study the experimentally observed\ndecay of jc with increasing misalignment angle was\nreproduced in a microscopic model in which charge\ninhomogeneities at the grain boundary were identified\nas the main source for the suppression of jc [12]. But\nstill the overall magnitude of jc could not be correctly\ndetermined and it was speculated that strong electronic\ncorrelations present in the high-Tc materials might be\nresponsible for this discrepancy [13].\nIn this article we present an analysis of the dependence\nof the supercurrent on the grain boundary angle in the\npresence of strong Coulomb interactions. In order to describe the generic lattice defects for a certain GB angle,\na theoretically reconstructed sample of a GB should include at least several hundred lattice sites. Due to numerical limitations, this can only be modeled by an effective\none-particle description. To incorporate static correlations nevertheless, we employ a Gutzwiller approximation [14] that should already capture an important part\nof the GB physics. The Gutzwiller approach has had\nconsiderable success for homogeneous models of cuprate\nhigh-Tc superconductors [15]. Only in recent years was it\nrigorously extended to inhomogeneous systems [16, 17],\nbut is now an established method to treat important aspects of the interplay between impurities and supercon-\n\nductivity [18].\nThe model system of a GB is, in a certain respect, a\nparticularly inhomogeneous system that deals with very\nstrong impurities that to our knowledge have not yet\nbeen treated within the Gutzwiller approach. The energy scale of the system is set by the hopping parameter tbulk in the homogeneous bulk regions far away from\nthe GB. In cuprates we typically expect a Coulomb repulsion of U ∼ 20 tbulk and a spin exchange interaction\nJij ∼ tij , where tij is the hopping matrix element for\nnearest and next-nearest neighbor sites. It has been\nshown that charge barriers at the GB lead to local impurity potentials of the order of εi ∼ −20 tbulk [12] or more,\ntherefore close to the GB, the estimate εi ∼ −U applies.\nAlthough in the bulk regions of a hole-doped system, the\nlocal charge densities ni are below half filling, the positive charges in the vicinity of the GB can induce sites\nwith ni well above half filling, even in the presence of\nstrong Coulomb repulsion. As an example, in Fig. 1(c),\n(d) and (e) local charge densities, impurity potentials and\nhopping amplitudes are shown as a function of the distance from a GB with misalignment angle α = 44◦ . Such\nsystems with strongly positively charged regions cannot\nbe described by the standard Gutzwiller approximation.\nIn the first part of this article we present an extended\nGutzwiller formalism appropriate to describe such systems. In the second part we analyze our results for the\ncritical current calculated with the new method and show\nthat they are in excellent agreement with experiments.\nModel and methodology.- We use the Gutzwiller\nprojected t–J model to describe the GB system. Within\nthe Hartree-Fock decoupling scheme it is given by the\nHamiltonian\nX\nt\n(gij\ntij + χ∗ij )c†is cjs\nH=−\nijs\n\n−\n\nX\n\n(∆ij c†j↑ c†i↓ + h.c.) −\n\nij\n\nwith\n\ne ij =\nwhere ∆\nhc†i↓ cj↓ i),\n\nμi n̂i\n\n(1)\n\ni\n\nJ\ne ij ,\n+ 41 )Jij ∆\n∆ij = ( 43 gij\n\nχij =\n\nX\n\nJ\n( 43 gij\n\n−\n\n1\neij ,\n4 )Jij χ\n\n1\neij\n2 (hci↓ cj↑ i + hcj↓ ci↑ i), χ\nP\nn̂i = s c†is cis , and μi = μ −\n\nfor the tunneling amplitudes tij\n\n(2)\n(3)\n=\n\n†\n1\n2 (hci↑ cj↑ i\n\n+\n\nεi . The matrix\nhas non-zero entries for\n\n\f2\n\ngiJ =\n\n2\n.\n|1 − ni | + 1\n\n2|1 − ni |\n,\n|1 − ni | + 1\n\ny [Å]\nni\n\n|∆ij|\n\n10\n0 (a)\n0.3\n0.2\n0.1 (b)\n0\n2\n1.5 (c)\n1\n0.5\n0\n\n(4a)\n\nεi\n\ngit =\n\ns\n\n20\n\n(4b)\n\ntij\n\nnearest and next-nearest neighbor hopping. The tunneling amplitudes tij and the local potentials εi are calculated using the molecular dynamics algorithm of Ref. 12\nand reflect the charge barriers and defects of the lattice at the GB. The spin-interaction coefficients Jij are\nobtained by rescaling the nearest-neighbor entries of tij\nwith a constant factor.\nThe Gutzwiller factors in (1) are defined as follows:\nt\nJ\ngij\n= git gjt and gij\n= giJ gjJ , where\n\nFor local densities ni ≤ 1 these expressions coincide with\nthe commonly employed definitions of Ref. 16. By introducing the absolute values in their definitions we obtain a renormalization that is symmetric with respect to\nhalf filling ni = 1. This is equivalent to a local particlehole transformation for sites where ni > 1. Due to the\nparticle-hole invariance of the Hubbard model from which\nthe t–J model is derived, this treatment is obviously correct for a homogeneous system with ni = n > 1.\nThe rigorous derivation for an inhomogeneous system isQbased on the definition of a projection operator\nP = i Pi that locally projects either doubly occupied\nor empty sites out of a BCS type wave function |ψi0 ,\ndepending on the local density:\n\u001a n̂i\nyi (1 − Di ) if ni ≤ 1\nPi =\n(5)\nyin̂i (1 − Ei ) if ni > 1 .\nHere, yi is a fugacity factor, while Di = n̂i↑ n̂i↓ and\nEi = (1 − n̂i↑ )(1 − n̂i↓ ) denote the projection on doubly occupied and empty sites, respectively. Note that\nthe selection of different projectors depending on the local density is a natural extension of the operator yin̂i : this\noperator assigns different weights to contributions from\nempty and singly occupied sites and thus ensures a projected state |ψi that can be transparently compared with\nthe pre-projected state |ψ0 i due to its common set of local densities [16]. A comparison of expectation values\nevaluated with the wave functions |ψ0 i and |ψi = P|ψ0 i,\ncompletely analogous to the one presented in Ref. 16,\nyields the results of Eq. (4).\nIt remains to be justified that the implementation of a\nsymmetric renormalization around half filling, or equivalently, projecting out empty and doubly occupied sites\nin the free wave function, is physically meaningful. The\nargumentation here is very similar to the original idea\nof Gutzwiller, to project doublons out of the wave function due to their energy cost. Our extension is obviously\njustified for bulk regions: In an environment where μi is\nlarge enough to yield ni > 1, a local particle-hole transformation leads to the removal of empty sites from the\nwave function. Also at the boundary of such a region\nthe definition of Eq. (5) is consistent since on a site with\nμi ∼ U , the gain of potential energy cancels the cost of\ndouble occupancy, independent of the situation on neighboring sites. Thus the energy cost to create a holon at\n\n(i) without correl.\n(ii) with correlations\n\n-15\n\n-30 (d)\n1\n0.5 (e)\n0\n-50 -40\n\nt\nt'\n-30\n\n-20\n\n0\n\n-10\n\n10\n\n20\n\n30\n\n40\n\n50\n\nx [Å]\nFIG. 1. The lattice structure for a (520) GB with misalignment angle α(520) = 44◦ in the x,y-plane (a). Orange lines\nmark the bonds defining the \"channels\" through the GB that\nexplicitly appear in the sum of Eq. (7). Results of a selfconsistent calculation for the (520) GB at a bulk filling of\nn = 0.8 without (i) and with (ii) Gutzwiller factors include\nthe d-wave pairing amplitude ∆ij (b) and the local density\nni (c). In addition the local impurity potentials εi (d) and\nthe averages over all nearest neighbor (t) and next-nearest\nneighbor (t′ ) hopping parameters of single sites i (e) are\nshown. Energies are measured in units of tbulk = 1. The\nspin-interaction is calculated from the nearest-neighbor entries of tij for (i) as Jij = 2.38tij and for (ii) as Jij = 0.9tij\nso that ∆bulk = 0.275tbulk has the same value for both calculations. The precise values of the impurity potentials εi are\nobtained from the charge fluctuations assuming a screening\nlength l = 2Å.\n\nsite i is of the size of U and consequently it is projected\nout.\nNote that this procedure is possible in the Gutzwiller\napproximation only due to its fundamental assumption\nthat inter-site correlations can be neglected. However, in\nthe framework of the Gutzwiller approach it is a consistent improvement of the wave function modeling in the\nspirit of assigning different weights to different sites with\nthe fugacity factor yin̂i . It is a heuristic, very detailed and\nsophisticated method of minimizing the energy of a system described in a phenomenological mean-field picture.\nBelow we will show that this picture is sufficiently realistic to accurately describe the physics of superconducting\ncharge transport through a GB.\nThe renormalized model Hamiltonian of Eq. (1) is evaluated within the Bogoliubov–de Gennes (BdG) framework. We enforce constant phases with a difference\nφ = π/2 on the pairing amplitude ∆ij on either end\nof the sample, in the center of which the GB is situated.\nThe corresponding phase gradient induces finite currents\ngiven by\nt\njij = −2gij\ntij\n\nX\ns\n\nIm(hc†is cjs i).\n\n(6)\n\n\f3\n\nsin(α/2)\nMy x\n\njij ,\n\n(7)\n\ni <0,xj >0\n\njcabs =\n\n∆exp NUC e\njc ,\n∆theo ac ~\n\njc\n\nwhere xi and xj are the x-coordinates of sites on either\nside of the GB, α is the misalignment angle and My the\nsecond Miller index of the (Mx My Mz ) GB. The factor\nsin(α/2)/My normalizes the current to a unit length in\ny-direction. To be able to compare with experimental\nresults we employ the following relation [12] between the\ncurrent jcabs in absolute units A/cm2 and the current in\nunits [tbulk ] = eV\n\njc\n\njc =\n\nX\n\njc\n\nThe normalized total current through the GB is\n\n(8)\n\nwhere NUC = 2 is the number of CuO2 planes per\nunit cell, α the misalignment angle and a = 3.82Å and\nc = 11.7Å the lattice spacing in x- and z-direction, respectively. The values ∆exp ∼ 0.025eV and ∆theo =\n∆bulk = 0.275eV are valid for the bulk regions. In order\nto compensate the smaller magnitude of the experimental\nquantities we employ the factor ∆exp /∆theo ≃ 0.09 where\nwe make use of the fact that jc scales approximately linearly w.r.t. ∆ if ∆ is small. We cannot employ the experimental value ∆exp ∼ 0.025eV in our calculations as\nfor gap values of this order of magnitude, the iterative\nsolution of the BdG equations is non-convergent.\nAngle dependence of the supercurrent.- In Fig. 2(a)\nand (b) we show on a logarithmic scale the dependence of\nthe zero-temperature supercurrent on the GB misalignment angle for a hole-doped system. We compare two\ntypes of calculations with experimental data taken from\nRef. 1: (i) a standard evaluation of the GB-Hamiltonian\nt\nJ\nwithin the BdG framework (i.e. gij\n= gij\n= 1) and (ii)\nan evaluation with the local Gutzwiller factors as defined\nin Eq. (4). In order to provide a meaningful comparison\nof (i) and (ii) we employ the same hopping matrices tij\nand impurity potentials εi for all calculations, but globally scale Jij to obtain identical values for the d-wave\npairing amplitude in the bulk: ∆bulk = 0.275 tbulk. This\napproach is appropriate as jc ∝ ∆bulk and it is in complete analogy to Ref. 18. Note that also at the GB the\npairing amplitude ∆ij shown in Fig. 1(a) does not differ\nqualitatively for the evaluation without (i) and with (ii)\nGutzwiller factors.\nAs can be seen from Fig. 2 the supercurrent decays in\nboth cases (i) and (ii) exponentially with the GB angle.\nWe also find that the current in the correlated system\n(ii) is almost one order of magnitude smaller than in the\nsystem without correlations (i). As the screening length\nl in the CuO2 planes is only approximately known we\nperformed two calculations assuming different values of\nl, with l = 2Å for Fig. 2(a) and l = 1.2Å for Fig. 2(b).\nFor the choice of l = 2Å we obtain excellent agreement\nwith the experimentally determined critical currents over\na wide range of GB angles.\nIn Fig. 2(c) we show the angle dependence of the current for an electron-doped system. Comparing panels\n(b) and (c) of Fig. 2, we find that the current is almost\nparticle-hole symmetric. Correlation effects are known\n\n-3\n\n(a)\n\n-3\n\n(b)\n\n-3\n\n(c)\n\n10\n-4\n10\n-5\n10\n-6\n10\n-7\n10\n10\n-4\n10\n-5\n10\n-6\n10\n-7\n10\n10\n-4\n10\n-5\n10\n-6\n10\n-7\n10\n\n(i) without correl.\n(ii) with correl.\n(iii) experiment\n\n15\n\n20\n\n25\n\n30\n\n35\n\n40\n\n45\n\nGB angle [°]\nFIG. 2. Angular dependence of the critical current for GB\nsamples with electron density n = 0.8 (a,b) and n = 1.2\n(c). We plot results for 11 samples for 6 different angles in\nbetween 15◦ and 45◦ in order to be able to average. This average is calculated as a linear fit to the logarithm of the data\npoints and depicted as colored lines. The impurity potentials\nhave been calculated from the charge fluctuations assuming a\nscreening length of l = 2Å (a) and l = 1.2Å (b,c). The current is given in units of tbulk . Depicted are calculations using\nthe BdG Hamiltonian of Eq. (1) where for (i) all Gutzwiller\nfactors are set to 1 and for (ii) all Gutzwiller factors are taken\nas defined in Eq. (4). The theoretical values in (a) and (b)\nare compared to experimental data (iii) for optimally doped\nYBCO thin films on SrTiO3 taken from Ref. 1. The spininteraction is calculated from the nearest-neighbor entries of\ntij for (i) as Jij = 2.38tij and for (ii) as Jij = 0.9tij so that\n∆bulk = 0.275tbulk has the same value for both calculations.\n\nto be strongest at half filling where a Mott insulator is\nobtained in the Gutzwiller approximation. The dominant reduction of the current due to correlations should\ntherefore be caused by areas in the system where ni ∼ 1.\nThese areas are equally present in the hole- and electrondoped system in the transition region to the bulk. In\nthe hole-doped case such a region is already implied by\nthe fact that, directly at the GB, the system is always\nwell above half filling. In the electron-doped case it is\ncaused by large density fluctuations. These appear due\nto the charge fluctuations with the same magnitude in\nthe electron- and the hole-doped case. For a hole-doped\nexample, Fig. 1(c) shows values for the density with\n0.5 ≤ ni ≤ 2. Obviously, these arguments imply that\nthe correlation effects depend on the charge fluctuations.\nFurthermore, the fact, that the narrow transition regions\nhave the same extension for all angles, explains that the\nexponential behavior w.r.t. the GB angle appears in both\ncalculations (i) and (ii): only the break-up of pairs by i\nmpurities, present in (i) and (ii), causes the exponential\nbehavior while the correlation induced reduction of the\nsupercurrent is constant for all angles.\nFig. 3 displays the microscopic (local) values of the\nt\ncurrents jij , the Gutzwiller factors gij\nand the local po-\n\n\f4\n-4\n\n10\n\njij\n\n10\n\n10\n\n_\n\ngt\n\ngijt\n\n10\n\n10\n\n-6\n\n10\n10\n\n10\n\n-5\n\n10\n\n-7\n\n10\n\n-8\n\n10\n\n-9\n\n10\n(i) without correl.\n(ii) with correl.\n\n-10\n\n0.4\n0.2\n0\n\n0\n\n2\n\n4\n\n(a)\n\n(b)\n\n6\n\nchannel number\n\n1\n0.8 x=-12Å\n0.6\n0.4\n0.2\n-50\n-25\n\n(e)\n\n10\n\n-4\n-5\n-6\n-7\n-8\n-9\n-10\n\n1.1\n1\n(d) 0.9\n0\n\n(c)\n8 10 12 14 16\n\n-10\n(f) -20\n\nεi\n\n10\n\n-30\nx=0\n\n0\n\nx [Å]\n\ntreat strongly inhomogeneous systems, is not only viable for the characterization of the supercurrent through\ngrain boundaries. It should also be instrumental for other\nsystems with intrinsic impurities or artificial structures\n(heterostructures). We emphasize that we achieved convincing agreement with experiment for the supercurrent\nthrough GBs. The reduction of the current was shown to\nbe due to the intertwining effects of large charge fluctuations and strong correlations. It can thus be understood\nthat experimental doping of the GB in order to moderate these fluctuations significantly improves the current\ncarrying properties, which has already been observed for\nCa-doped interfaces [10, 11].\n\n0 1 2 3 4 5 6 7 8 9\n25\n\n50\n\nchannel number\n\nFIG. 3. Cuts parallel to a (520) GB with angle α(520) ∼ 44◦\nin y-direction at x = −12Å (a,c) and x = 0 (b,d,f). In the\nfirst row (a,b) we show the values for the currents jij through\nall channels of a cut. The channels of the x = 0 cut are\ndepicted in Fig. 1(a) as orange lines. Negative currents are\nmarked with a circle around the data point. In the second row\nt\n(c,d) we show the Gutzwiller factors gij\nand in (f) the local\nimpurity potentials εi of the two sites that are connected by\nt\na channel. In panel (e) the average ḡ t of gij\nalong cuts for\nfixed values of x is displayed.\n\ntentials εi for cuts parallel to the GB. Panels (a,c) show\nthese values at the edge of the GB (at x = −12Å) where\npotential fluctuations are minor but where the average ḡ t\nt\nof gij\nalong the cut is minimal, indicating the strongest\nsuppression of hopping by Coulomb repulsion (see panel\n(e)). Panels (b,d,f) refer to a cut along the center of\nthe GB (at x = 0), where the potential fluctuations are\nt\nmaximal but the Gutzwiller factors gij\nare close to 1\ndue to the strong effective electron doping induced by\nt\nthe local impurity potentials. The flat distribution of gij\nin panel (d) leads to the homogeneous reduction for all\nt\nchannels in panel (b) while in panel (c) gij\nvaries significantly which results in a non-homogeneous reduction of\njij in panel (a). Current conservation guarantees that the\ntotal reduction of the supercurrent in (b) equals the total reduction in (a). Both panels (a,b) show that charge\ntransport is carried almost entirely by very few channels. At the GB center these channels are exposed only\nto slightly varying impurity potentials in contrast to the\nones that carry almost no current (panel (f)). Even at\nthe edge of the grain boundary, where almost no potential fluctuations are present, back currents continue to\nexist (panel (a)). They are induced by the impurities\nat the center of the GB and degrade slowly on account\nof the small phase gradient away from the GB. Finally\nwe point out that fluctuations of the critical current are\nstrong in experiment and that they are better reproduced\nby the correlated than by the non-correlated modeling\n(see Fig. 2(a,b)). Random Coulomb blocking of some of\nthe few channels that carry almost all current produces\nthese correlation induced fluctuations.\nConclusion.- We expect that the extension of the\nGutzwiller projection approach, which we introduced to\n\nThe authors gratefully acknowledge discussions with\nC. W. Schneider, B. M. Andersen, P. J. Hirschfeld, and\nJ. Mannhart. This work was supported by the DFG\nthrough TRR80.\n\n[1] H. Hilgenkamp and J. Mannhart, Rev. Mod. Phys. 74,\n485 (2002).\n[2] D. Dimos, P. Chaudhari, J. Mannhart, and F. K.\nLeGoues, Phys. Rev. Lett. 61, 219 (1988).\n[3] A. Gurevich and E. A. Pashitskii, Phys. Rev. B 57, 13878\n(1998).\n[4] S. V. Stolbov, M. K. Mironova, and K. Salama, Supercond. Sci. Technol. 12, 1071 (1999).\n[5] S. J. Pennycook, C. Prouteau, M. F. Chisholm, D. K.\nChristen, D. Verebelyi, D. P. Norton, M. Kim, N. D.\nBrowning, J. P. Buban, Y. Pan, et al., Studies of High\nTemperature Superconductors: Microstructures and Related Studies of High Temperature Superconductors-II,\nvol. 30 (Nova Science Publishers, 2000).\n[6] Y. Tanaka and S. Kashiwaya, Phys. Rev. Lett. 74, 3451\n(1995).\n[7] J. K. Freericks, Transport in Multilayered Nanostructures: The Dynamical Mean-Field Theory Approach (Imperial College Press, 2006).\n[8] T. Yokoyama, Y. Sawa, Y. Tanaka, and A. A. Golubov,\nPhys. Rev. B 75, 020502 (2007).\n[9] U. Schwingenschlögl and C. Schuster, Phys. Rev. B 79,\n092505 (2009).\n[10] G. Hammerl, H. Bielefeldt, S. Leitenmeier, A. Schmehl,\nC. Schneider, A. Weber, and J. Mannhart, Eur. Phys. J.\nB 27, 299 (2002).\n[11] G. Hammerl, A. Schmehl, R. R. Schulz, B. Goetz,\nH. Bielefeldt, C. W. Schneider, H. Hilgenkamp, and\nJ. Mannhart, Nature (London) 407, 162 (2000).\n[12] S. Graser, P. J. Hirschfeld, T. Kopp, R. Gutser, B. M.\nAndersen, and J. Mannhart, Nat. Phys. 6, 609 (2010).\n[13] B. M. Andersen, Y. S. Barash, S. Graser, and P. J.\nHirschfeld, Phys. Rev. B 77, 054501 (2008).\n[14] F. C. Zhang, C. Gros, T. M. Rice, and H. Shiba, Supercond. Sci. Technol. 1, 36 (1988).\n[15] P. W. Anderson, P. A. Lee, M. Randeria, T. M. Rice,\nN. Trivedi, and F. C. Zhang, J. Phys.: Condens. matter\n16, R755 (2004).\n[16] Q.-H. Wang, Z. D. Wang, Y. Chen, and F. C. Zhang,\nPhys. Rev. B 73, 092507 (2006).\n[17] W.-H. Ko, C. P. Nave, and P. A. Lee, Phys. Rev. B 76,\n245113 (2007).\n[18] A. Garg, M. Randeria, and N. Trivedi, Nat. Phys. 4, 762\n(2008).\n\n\f"}