{"id": "http://arxiv.org/abs/0901.1938v1", "guidislink": true, "updated": "2009-01-14T07:13:31Z", "updated_parsed": [2009, 1, 14, 7, 13, 31, 2, 14, 0], "published": "2009-01-14T07:13:31Z", "published_parsed": [2009, 1, 14, 7, 13, 31, 2, 14, 0], "title": "Ostrogradski approach for the Regge-Teitelboim type cosmology", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0901.0163%2C0901.2284%2C0901.0244%2C0901.4681%2C0901.1427%2C0901.3984%2C0901.3195%2C0901.1409%2C0901.2857%2C0901.1633%2C0901.3670%2C0901.4332%2C0901.3585%2C0901.0052%2C0901.3344%2C0901.4608%2C0901.1904%2C0901.3980%2C0901.0553%2C0901.3800%2C0901.4351%2C0901.3366%2C0901.2825%2C0901.4049%2C0901.3611%2C0901.4192%2C0901.3910%2C0901.1938%2C0901.0773%2C0901.2322%2C0901.2418%2C0901.4399%2C0901.2121%2C0901.2503%2C0901.3617%2C0901.2716%2C0901.0293%2C0901.0546%2C0901.1206%2C0901.0211%2C0901.1896%2C0901.0770%2C0901.2476%2C0901.2963%2C0901.4067%2C0901.2145%2C0901.2791%2C0901.3689%2C0901.3221%2C0901.0559%2C0901.3572%2C0901.4272%2C0901.0700%2C0901.1122%2C0901.0909%2C0901.0621%2C0901.1848%2C0901.3080%2C0901.4288%2C0901.2450%2C0901.1568%2C0901.3816%2C0901.1361%2C0901.1760%2C0901.3076%2C0901.4809%2C0901.0273%2C0901.1800%2C0901.4173%2C0901.4907%2C0901.0492%2C0901.4447%2C0901.0096%2C0901.4277%2C0901.3851%2C0901.4461%2C0901.1961%2C0901.4466%2C0901.3289%2C0901.1193%2C0901.0832%2C0901.3561%2C0901.1441%2C0901.0214%2C0901.0603%2C0901.4379%2C0901.3635%2C0901.1854%2C0901.0522%2C0901.4856%2C0901.3839%2C0901.3974%2C0901.3648%2C0901.1108%2C0901.3047%2C0901.1716%2C0901.2780%2C0901.0753%2C0901.0996%2C0901.3296%2C0901.4137&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Ostrogradski approach for the Regge-Teitelboim type cosmology"}, "summary": "We present an alternative geometric inspired derivation of the quantum\ncosmology arising from a brane universe in the context of {\\it geodetic\ngravity}. We set up the Regge-Teitelboim model to describe our universe, and we\nrecover its original dynamics by thinking of such field theory as a\nsecond-order derivative theory. We refer to an Ostrogradski Hamiltonian\nformalism to prepare the system to its quantization. Our analysis highlights\nthe second-order derivative nature of the RT model and the inherited\ngeometrical aspect of the theory. A canonical transformation brings us to the\ninternal physical geometry of the theory and induces its quantization\nstraightforwardly. By using the Dirac canonical quantization method our\napproach comprises the management of both first- and second-class constraints\nwhere the counting of degrees of freedom follows accordingly. At the quantum\nlevel our Wheeler-De Witt Wheeler equation agrees with previous results\nrecently found. On these lines, we also comment upon the compatibility of our\napproach with the Hamiltonian approach proposed by Davidson and coworkers.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0901.0163%2C0901.2284%2C0901.0244%2C0901.4681%2C0901.1427%2C0901.3984%2C0901.3195%2C0901.1409%2C0901.2857%2C0901.1633%2C0901.3670%2C0901.4332%2C0901.3585%2C0901.0052%2C0901.3344%2C0901.4608%2C0901.1904%2C0901.3980%2C0901.0553%2C0901.3800%2C0901.4351%2C0901.3366%2C0901.2825%2C0901.4049%2C0901.3611%2C0901.4192%2C0901.3910%2C0901.1938%2C0901.0773%2C0901.2322%2C0901.2418%2C0901.4399%2C0901.2121%2C0901.2503%2C0901.3617%2C0901.2716%2C0901.0293%2C0901.0546%2C0901.1206%2C0901.0211%2C0901.1896%2C0901.0770%2C0901.2476%2C0901.2963%2C0901.4067%2C0901.2145%2C0901.2791%2C0901.3689%2C0901.3221%2C0901.0559%2C0901.3572%2C0901.4272%2C0901.0700%2C0901.1122%2C0901.0909%2C0901.0621%2C0901.1848%2C0901.3080%2C0901.4288%2C0901.2450%2C0901.1568%2C0901.3816%2C0901.1361%2C0901.1760%2C0901.3076%2C0901.4809%2C0901.0273%2C0901.1800%2C0901.4173%2C0901.4907%2C0901.0492%2C0901.4447%2C0901.0096%2C0901.4277%2C0901.3851%2C0901.4461%2C0901.1961%2C0901.4466%2C0901.3289%2C0901.1193%2C0901.0832%2C0901.3561%2C0901.1441%2C0901.0214%2C0901.0603%2C0901.4379%2C0901.3635%2C0901.1854%2C0901.0522%2C0901.4856%2C0901.3839%2C0901.3974%2C0901.3648%2C0901.1108%2C0901.3047%2C0901.1716%2C0901.2780%2C0901.0753%2C0901.0996%2C0901.3296%2C0901.4137&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We present an alternative geometric inspired derivation of the quantum\ncosmology arising from a brane universe in the context of {\\it geodetic\ngravity}. We set up the Regge-Teitelboim model to describe our universe, and we\nrecover its original dynamics by thinking of such field theory as a\nsecond-order derivative theory. We refer to an Ostrogradski Hamiltonian\nformalism to prepare the system to its quantization. Our analysis highlights\nthe second-order derivative nature of the RT model and the inherited\ngeometrical aspect of the theory. A canonical transformation brings us to the\ninternal physical geometry of the theory and induces its quantization\nstraightforwardly. By using the Dirac canonical quantization method our\napproach comprises the management of both first- and second-class constraints\nwhere the counting of degrees of freedom follows accordingly. At the quantum\nlevel our Wheeler-De Witt Wheeler equation agrees with previous results\nrecently found. On these lines, we also comment upon the compatibility of our\napproach with the Hamiltonian approach proposed by Davidson and coworkers."}, "authors": ["Ruben Cordero", "Alberto Molgado", "Efrain Rojas"], "author_detail": {"name": "Efrain Rojas"}, "author": "Efrain Rojas", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1103/PhysRevD.79.024024", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/0901.1938v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0901.1938v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "11 pages, 2 figures, accepted for publication in Phys. Rev. D", "arxiv_primary_category": {"term": "gr-qc", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "gr-qc", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0901.1938v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0901.1938v1", "journal_reference": "Phys.Rev.D79:024024,2009", "doi": "10.1103/PhysRevD.79.024024", "fulltext": "Ostrogradski approach for the Regge–Teitelboim type cosmology\nRubén Cordero∗\nDepartamento de Fı́sica, Escuela Superior de Fı́sica y Matemáticas del IPN,\nUnidad Adolfo López Mateos, Edificio 9, 07738 México, Distrito Federal, México\n\nAlberto Molgado†\nUnidad Académica de Fı́sica, Universidad Autónoma de Zacatecas,\nCalzada Solidaridad esq. Paseo a la Bufa s/n, 98062 Zacatecas, Zacatecas, México\n\narXiv:0901.1938v1 [gr-qc] 14 Jan 2009\n\nEfraı́n Rojas‡\nDepartamento de Fı́sica, Facultad de Fı́sica e Inteligencia Artificial,\nUniversidad Veracruzana, 91000 Xalapa, Veracruz, México\n(Dated: November 23, 2018)\nWe present an alternative geometric inspired derivation of the quantum cosmology arising from a\nbrane universe in the context of geodetic gravity. We set up the Regge–Teitelboim model to describe\nour universe, and we recover its original dynamics by thinking of such field theory as a second–order\nderivative theory. We refer to an Ostrogradski Hamiltonian formalism to prepare the system to its\nquantization. Our analysis highlights the second-order derivative nature of the RT model and the\ninherited geometrical aspect of the theory. A canonical transformation brings us to the internal\nphysical geometry of the theory and induces its quantization straightforwardly. By using the Dirac\ncanonical quantization method our approach comprises the management of both first- and secondclass constraints where the counting of degrees of freedom follows accordingly. At the quantum\nlevel our Wheeler–De Witt equation agrees with previous results recently found. On these lines, we\nalso comment upon the compatibility of our approach with the Hamiltonian approach proposed by\nDavidson and coworkers.\nPACS numbers: 04.50.-h, 04.60.Kz, 04.60.Ds, 98.80.Jk, 98.80.Qc\n\nI.\n\nINTRODUCTION\n\nThe concept of a relativistic extended object as a surface immersed in a bulk has increased the interest in\nphysics due to its wide range of applications. One can\nmodel, for example, the smallest physical entities, like\nquarks, as vibrations of strings up to the entire universe\nas a relativistic extended object. Along a related line,\nwith the advent of brane world universes, cosmology in\nthe presence of extra dimensions has been the subject of\nintense research. In fact, the idea that our universe could\nbe a 3 + 1 dimensional surface embedded in a higher dimensional spacetime was set up by Regge and Teiltelboim (RT) a long time ago [1] and pursued by many\nauthors [2, 3, 4, 5]. The scope of such a model is that\ngravitation can be described in a point- or stringlike fashion, as the worldvolume swept out by the motion of a\nthree-dimensional spacelike brane evolving in a higherdimensional bulk spacetime [1]. Recently, the RT brane\nmodel has been considered as one of the two main pillars of a unified branelike theory [6], where the RandallSundrum brane theory [7] is included. When one addresses this issue in a Minkowski spacetime, the model is\nnamed geodetic gravity, and it has been extensively stud-\n\n∗ Electronic\n\naddress: cordero@esfm.ipn.mx\naddress: amolgado@planck.reduaz.mx\n‡ Electronic address: efrojas@uv.mx\n† Electronic\n\nied by Davidson and coworkers [8, 9, 10, 11]. Although\nthe RT model is not the most popular theory for brane\nworld universes (at the end of last century, there was a\nrevival of the idea that our universe could be a hypersurface; see, for example, [7, 12]), it is very stimulating while\nthinking in the spirit of brane gravity à la string. The\ncosmology that arises from this model is interesting in its\nown right since it provides an alternative route to better\nunderstand classical cosmology in extra dimensions, and\nalso it supplies a compelling model to apply the canonical\nquantization methods. Indeed, in the context of quantum brane cosmology [13] our universe can be explained\nthrough a tunneling process where the well-known problem of boundary conditions of four-dimensional cosmology is solved [14, 15].\nIn most field theories the action depends usually on\nthe fields and their first derivatives. By contrast, the RT\nmodel is a genuine second-order derivative model in the\nfield variables, which are the embedding functions rather\nthan the induced metric. Generally, one identifies and\nneglects a surface term associated with the linear dependence of the accelerations. Similarly as in general relativity, it is a well-known fact that a \"harmless\" surface term\ncan be neglected or removed at the beginning as occurs\nwith the well-known Gibbons-Hawking-York term into\nthe action. Whichever field context, the extremization\nof the corresponding action yields equations of motion of\nsecond order in derivatives in the field variables. Thus\nthe RT model, like the Einstein-Hilbert action for general\nrelativity, becomes transformed in an effective first-order\n\n\f2\nfield theory. However, by what formally appears to be a\ncustomary procedure, to follow such a strategy raises important limitations especially in the Hamiltonian framework for the RT model where it leads to certain troubles, as was noticed first by Regge and Teitelboim, due\nmainly to the fact that the scalar constraint is not written down in a closed form straightforwardly. In pursuing this endeavor, Davidson and coworkers tackled the\nproblem successfully. They considered an extra nondynamical canonical field λ in the first-order Hamiltonian\nframework in order to get quadratic constraints of the\nphase space that recuperate the dynamics accordingly\n[9, 10, 11]. The explicit handling of the quantum RT\nmodel is made possible by extending the ordinary phase\nspace, which in turn provides a wealth of information of\nthe cosmology that this model possesses.\nIn the present paper we consider an alternative formulation for geodetic gravity which is strongly based in\nthe Ostrogradski program for higher-order derivative theories [16, 17]. For second-order theories this approach\ntreats the velocities as independent fields. This is an unconventional viewpoint for the RT theory, and one might\ntherefore wonder if such a description is viable at all since\nthis does not necessarilly represent a shortcoming: for\nthis special case the addition of more degrees of freedom\nis physically more accurate, but it means then that the\nfirst-order theory is incomplete in some sense. For this\nreason, it seems promising to start directly from the full\nRT model instead of omitting the surface term a priori.\nHence, we pay close attention to a Hamiltonian approach\nfor geodetic gravity constructed by appliying the Ostrogradski scheme which in turn leads to the correct dynamics. In particular, it is of a great interest to use the\nfull model straightforwardly for obtaining the quantum\napproach for brane cosmology. Our intention is to cope\ndirectly with the inherent second-order derivative nature\nof the RT model. As discussed below, we gain certain improvements of clarity by the use of this formalism in comparison with previous works. Contrary to the standard\nquadratic form of the constraints for ordinary first–order\nreparametrization invariant theories, in the Ostrogradski\napproach for RT field theory the constraints are projections of the momenta along the velocities as well as along\nthe unit spacelike normal vector to the brane. To illustrate our development we specialize our considerations\nto a minisuperspace model where the inherent gauge invariance under the reparametrization of time is evident.\nWe show that the canonical Dirac constraint quantization of this model casts into a satisfactory Wheeler–De\nWitt (WDW) equation on the wave function for a branelike universe. The handling of the quantum approach is\nmade possible by a canonical transformation which results to be a Lorentz rotation in phase space. Such a\ntransformation brings our constraints into a physically\nmeaningful set which enable us to follow the standard\nDirac constraint quantization programme. Our quantum\ntreatment hence leads to a well-defined Wheeler-DeWitt\nequation which, even though it is technically complicated\n\nto solve, presents the right behavior for the quantum potential, estimating the accuracy of our approach.\nThe outline of the paper is as follows. In Sec. II we\nbriefly review some geometrical aspects of the RT model\nfor a general d-dimensional brane, which are of interest for the rest of the paper. This section will serve to\nexplain our notation and to gain insight into our Hamiltonian approach. In Sec. III we adapt our approach\nto a minisuperspace model in which we specialize to the\ngeometry generated by the Friedman-Robertson-Walker\n(FRW) model. We explicitly give the Lagrangian density\nassociated to the RT model which includes the surface\nterm. Sec. IV deals with the Ostrogradski approach for\nthe model we are considering, and we develop the corresponding constraint analysis. In Sec. V we propose the\ngauge-fixing for the model in order to completely identify\nthe structure of the reduced phase space. In Sec. VI, we\nstudy the quantization of our model within the scheme\nof Dirac quantization. Finally, in Sec. VII we draw some\nconclusions. As a general feature, our presentation avoids\ncumbersome notation and is intended to be index-free as\npossible.\n\nII.\n\nREGGE–TEITELBOIM MODEL\n\nConsider a brane Σ of dimension d, evolving in a fixed\nMinkowski N dimensional background spacetime with\nmetric ημν . Its trajectory, or worldvolume m of dimension d + 1, is described by the embedding xμ = X μ (ξ a ),\nwhere xμ are local coordinates for the background spacetime, ξ a local coordinates for m, and X μ the embedding\nfunctions (μ, ν = 0, 1, . . . , N − 1; a, b = 0, 1, . . . , d). We\ndenote by eμ a = ∂a X μ the tangent vectors to m. In this\nframework we introduce N − d − 1 unit normal vectors to\nthe worldvolume, denoted by nμ i (i = 1, 2, . . . , N −d−1).\nThese are defined implicitly by ni * ea = 0, and we choose\nto normalize them as ni * nj = δij .\nThe RT model for a d-dimensional brane Σ is defined\nby the action functional\nZ\nZ\n√\n√\nα\nSRT [X] =\ndd+1 ξ −g R −\ndd+1 ξ −g Λ , (1)\n2 m\nm\nwhere the constant α has dimensions [L](1−d) , g denotes\nthe determinant of the induced metric gab = ημν eμ a eν b =\nea * eb . We have also included in this action a cosmological constant term, Λ. The extrinsic curvature of m is\nKab i = −ni * Da eb , where Da = eμ a Dμ and Dμ is the\ncovariant derivative in the bulk spacetime. The mean\nextrinsic curvature is given by the trace K i = g ab Kab i\nwhere g ab denotes the inverse of gab . The scalar curvature R of m can be obtained either directly from\nthe induced metric gab , or, in terms of the extrinsic\ncurvature, via the contracted Gauss–Codazzi equation,\ni\nR = K i Ki − Kab\nKiab [18, 19].\nThe response of the action (1) to a deformation of the\nsurface X → X + δX is characterized by a conserved\n\n\f3\nstress tensor [20]\n\nIII.\n\nf a μ = − αG ab + Λg\n\n\u0001\nab\n\neμ b ,\n\n(2)\n\nwhere Gab = Rab − 12 Rgab is the worldvolume Einstein\ntensor, with Rab being the Ricci tensor. This quantity\nwill provide relevant physical information especially with\nconsistent conservation laws. Following the line of reasoning of [20], the classical brane trajectories can be obtained from the covariant conservation law, ∇a f a μ = 0,\nwhere ∇a is the covariant derivative compatible with the\ninduced metric gab [21]. This yields [22]\nT ab Kab i = 0 ,\n\n(3)\n\nwhere T ab = α G ab + Λg ab . In fact, T ab corresponds\nto the intrinsic\nstress tensor defined in the usual way\n√\nby −2/ −g(δSRT /δgab ). Its conservation is supported\nby the Bianchy identity. The equations of motion (3)\nare of second order in derivatives of the embedding functions because of the presence of the extrinsic curvature.\nThis is so even though in the scalar curvature R we have\nthe presence of the extrinsic curvature. Owing to the\nreparametrization invariance of the RT model, there are\nonly D − d − 1 independent equations, along the normals;\nthe remaining d + 1 tangential components are satisfied\nidentically, as a consequence of the reparametrization invariance of the action (1).\nAn important quantity constructed with the conserved\nstress tensor is given by\n\u0001\nπ μ = ηa f a μ = − αG ab + Λg ab ηa eμ b\n(4)\n\nwhere η a stands for the timelike unit normal vector to the\nbrane Σ when it is viewed into m [23]. In fact, Eq. (4) is\nnothing but the conserved linear momentum associated\nwith the Noether charge of the action (1) specialized to\nbackground translations [20]. The Σ basis, {ǫμ A , η μ , nμ i }\nsatisfies the completeness relation\nη\n\nμν\n\nμi ν\n\n=n n\na\n\ni\n\nb\n\nμ ν\n\n−η η +h\n\nAB μ\n\nǫ\n\nν\n\nAǫ B\n\n,\n\n(5)\n\nwhere hAB = gab ǫ A ǫ B is the spatial metric on Σ and\nǫa A are the tangent vectors to Σ, (A, B = 1, 2, . . . , d).\nThe vector η μ stands for a timelike unit vector to Σ (see\nRefs. [21, 24] for more details).\nIn presence of other\n√ possible matter sources with stress\nab\ntensor Tm\n= (−2/ −g)δSm /δgab , where Sm is a matter action, we do not expect considerable modifications\nin our approach. The equations of motion (3) remain\nunchanged in form. It is sufficient to add the matter\nstress tensor to the original one described in (3). Similarly, the conserved linear momentum (4) is unaffected\nin form when another type of matter is included. It gets\nμ\nab\nan additional contribution of the form πm\n= −Tm\nηa eμ b .\nThese nice features allow us to develop straightforwardly\na Hamiltonian analysis without substantial changes under the inclusion of matter fields. This fact was also\nnoticed in [11].\n\nMINISUPERSPACE MODEL\n\nWe turn now to restrict the RT model itself (1) to\nthe case of a minisuperspace model. Consider a 3-brane\nΣ, evolving in a 5-dimensional Minkowski spacetime,\nds2 = −dt2 + da2 + a2 dΩ23 , where dΩ23 stands for the\nmetric of a unit 3-sphere, i.e., dΩ23 = dχ2 + sin2 χdθ2 +\nsin2 χ sin2 θdφ2 . For the sake of simplicity, we choose the\nfunction sin2 χ in dΩ23 to consider a closed universe. If\nxμ = X μ (ξ a ) = (t(τ ), a(τ ), χ, θ, φ)\n\n(6)\n\nis a parametric representation of the trajectory of Σ, we\nassure that the geometry of the worldvolume generated\nis that of the FRW case. According to the cosmology\njargon, a(τ ) is known as the scale factor.\nThe basis adapted to the worldvolume is given by the\nfour tangent vectors eμ a (a = 0, 1, 2, 3) together with\nthe unit spacelike normal vector\nnμ =\n\n\u0001\n1\n−ȧ, ṫ, 0, 0, 0 ,\nN\n\n(7)\n\nwhere the dot stands for derivation with respect to τ . For\nshort p\nin the notation we have introduced the quantity,\nN = ṫ2 − ȧ2 , which coincides with the lapse function\nwhen we perform an ADM decomposition of the action\n(1) [21, 24].\nThe metric induced on the worldvolume is given by\nds2 = gab dξ a dξ b = −N 2 dτ 2 + a2 dΩ23 .\n\n(8)\n\nThe spatial components of this metric correspond to the\nmetric associated to Σ when this is described by its embedding in the worldvolume itself. Furthermore, for this\nlatter parametrization, we have η a = 1/N (1, 0, 0, 0) such\nthat gab ǫa A η b = 0.\nThe Ricci scalar associated with the metric (8) reads\nR=\n\n6ṫ\na2 N 4\n\n\u0001\naäṫ − aȧẗ + N 2 ṫ .\n\n(9)\n\nThe linear dependence that the Ricci scalar possesses in\nthe accelerations of the variables t(τ ) and a(τ ) is particularly remarkable.\n√\nThe Lagrangian density L = −g( α2 R − Λ) thus becomes\nL=\n\n\u0001 ΥN a3\nΥ a ṫα\n3\n2\naä\nṫ\n−\na\nȧ\nẗ\n+\nṫ\n−\nȧ\nṫ\n−\nΛ,\nN3\n3\n\n(10)\n\nwhere Υ = 3 sin θ sin2 χ. Thus, the RT action specialized to spherical configurations, in terms of an arbitrary\nparameter τ , is reduced to\nZ\n2\nSRT = 6π\ndτ L(a, ȧ, ä, ṫ, ẗ) ,\n(11)\nwhere the Lagrangian function is given by [34]\nL(a, ȧ, ä, ṫ, ẗ) =\n\n\u0001\na ṫ\naäṫ − aȧẗ + N 2 ṫ − N a3 H 2 , (12)\n3\nN\n\n\f4\nwhere we have introduced the constant quantity H 2 :=\nΛ/3α. Thus, we have only a(τ ) and t(τ ) as independent\ndynamical variables. Despite the acceleration dependence in the Lagrangian, as characterizes second-order\nderivative theories, the equations of motion remain second order in the field variables (see Eq. (3)).\nWe proceed now to evaluate both the Einstein and\nthe extrinsic curvature tensors of the worldvolume as described by the metric (8). We have the nonvanishing\nexplicit components\n3ṫ2\n,\na2 N 2\n\u0015\n\u0012 \u0013\n\u0014\nṫ2\nd ȧ\n= − 2 4 2aṫ\n+ N2 ,\na N\ndτ ṫ\n\nGτ τ = −\nGχχ = Gθ θ = Gφφ\nand\n\nKτ τ =\nK χχ = K θ θ = K φφ =\n\nṫ2 d\nN 3 dτ\nṫ\n.\naN\n\n\u0012 \u0013\nȧ\n,\nṫ\n\nClearly, we can read off immediately the spatial components of the extrinsic curvature tensor as well as its mean\nextrinsic curvature given by K = hAB KAB = 3ṫ/aN .\nAs dictated by Eq. (3), there is only one equation of\nmotion given by\n\u0012 \u0013\nN2 Θ\nd ȧ\n=−\n,\n(13)\ndτ ṫ\naṫ Φ\n\nsuch that the highest momentum spacetime vector is\nPμ =\n\n\u0001 a2 ṫ\na2 ṫ\n−ȧ, ṫ, 0, 0, 0 = 2 nμ .\n3\nN\nN\n\n(17)\n\nThough this momentum has not a direct mechanical\nmeaning it will become important to achieve a Legendre\ntransformation in order to obtain the Hamiltonian function for our system (see Eq. (24) below). Note that the\nmomentum Pμ is directed normal to the worldvolume.\nThe conjugate momenta to the position variables {t, a}\nare, respectively\n\u0013\n\u0012\n∂L\nd ∂L\npt =\n−\ndτ ∂ ẗ\n∂ ṫ\n\u0001\u0003\na ṫ \u0002 2\n=\nȧ + N 2 1 − a2 H 2 =: −Ω ,\n(18)\nN3\n\u0012\n\u0013\n∂L\nd ∂L\npa =\n−\n∂ ȧ\ndτ ∂ä\n\u0012 \u0013\n\u0001\u0003\nȧ\na ȧ \u0002 2\n= − 3 ȧ + N 2 1 − a2 H 2 =\nΩ . (19)\nN\nṫ\nImportant to note is the fact that both momenta, pt and\npa , are from a totally different nature. Indeed, while\nthe momentum pt is not influencied at all by the surface\nterms (as expected), the momentum pa is obtained by\ntwo contributions: one coming from the ordinary theory\nand the other by a surface term. In this way, we can\ndenote the momentum pa as\npa := pa + pa ,\n\n(20)\n\nwhere we have introduced the functions\nΘ := ṫ2 − 3N 2 a2 H 2 ,\nΦ := 3ṫ2 − N 2 a2 H 2 ,\n\nwhere\n(14a)\n(14b)\n\nfor simplicity. Eq. (13) obviously only involves second\nderivatives of the field variables a and t. For any solution\nfor a(τ ) we have a gauge freedom to choose a function\nfor t(τ ) as we will see below.\nIV.\n\nOSTROGRADSKI–HAMILTONIAN\nAPPROACH\n\nA deeper insight of the phase space structure of the\ntheory defined by the Lagrangian (12) is achieved by an\nOstrogradski procedure for higher-order derivative systems. (A complete description of the Hamiltonian formulation for branes whose action depends on the extrinsic\ncurvature of their worldvolume is provided in [21,\b24].)\nThe highest conjugate momenta to the velocities ṫ, ȧ\nare, respectively,\n∂L\na2 ȧ ṫ\n=− 3 ,\nN\n∂ ẗ\na2 ṫ2\n∂L\n,\n=\n=\n∂ä\nN3\n\nPt =\n\n(15)\n\nPa\n\n(16)\n\n\u0001\u0003\naȧ \u0002 2\nȧ + N 2 3 − a2 H 2 ,\n3\nN\n2aȧ\n=\n.\nN\n\npa = −\n\n(21)\n\npa\n\n(22)\n\nIt is crucial to recognize them as the canonical momentum worked out in [9] and as the momentum conjugated\nto the a(τ )-variable when considering as the Lagrangian\nonly the surface term Ls = d/dτ (a2 a/N ), respectively.\nTo see the geometrical structure of this momentum, it\nis convenient to write pμ as\npμ =\n\n\u0001 Ω\nΩ\n−ṫ, ȧ, 0, 0, 0 = Ẋμ .\nṫ\nṫ\n\n(23)\n\nWe realize that this momentum is identical with the vector πμ defined on Eq. (4), which is the projection of the\nconserved stress tensor along the unit timelike normal\nvector η a to Σ.\n\b The appropiate phase space of the system, Γ :=\nt, a, ṫ, ȧ; pt , pa , Pt , Pa , has been identified explicitly.\nThus in Γ, the Ostrogradski formalism yields the canonical Hamiltonian\nH0 = p * Ẋ + P * Ẍ − L = pa ȧ + pt ṫ + JR ,\n\n(24)\n\n\f5\nwhere we have defined\nJR = −\n\n\u0001\u0003 N 2\na \u0002 2\nȧ + N 2 1 − a2 H 2 =\nΩ.\nN\nṫ\n\n(25)\n\nThis potential-like term results an implicit function of the\nphase space variables in the combination N 3 P 2 . At first\nglance, this may look as an unnecessary complication to\nwrite the phase space quantities in terms of Ω, but this\nquantity results in a physical observable: It is nothing but\nthe conserved bulk energy. Indeed, squaring the energy\nequation (18), results in the so–called evolution master\nequation [1, 3, 4, 5]\nN 2 + ȧ2 = γ N 2 a2 H 2 ,\n\n(26)\n\nwhere γ = γ(a) satisfies the cubic equation γ(γ − 1)2 =\nΩ2 /a8 H 6 .\n\nA.\n\nConstraint analysis\n\nSince we are dealing just with a second–order derivative theory linear in the accelerations, we have two primary constraints given by the definition of the momenta\n2\nitself, and hence φμ := Pμ − aN 2ṫ nμ = 0. Instead of\nthese constraints, here we will follow a different but convenient route. We choose to project the momentum (17)\nalong the velocity vector as well as the normal vector to\nΣ, where in general nμ = nμ (Ẋ ν ). This is supported\nby using the geometrical completeness relation (5) in\nφμ = ημν φν . Thus, we get the primary constraints\nC1 = P * Ẋ = 0 ,\na2 ṫ\n= 0.\nC2 = N P * n −\nN\n\n(27)\n(28)\n\nTherefore, the total Hamiltonian which generates time\nevolution of the fields is\nHT = H0 + λ1 C1 + λ2 C2 ,\n\n(29)\n\nwhere λ1 and λ2 are Lagrange multipliers enforcing the\nprimary constraints.\nAs customary, time–evolution for any canonical variable z ∈ Γ reads\nż = {z, HT } ,\n\n(30)\n\non the constraint surface, where the generalized Poisson\nbracket for any two functions F (z) and G(z) in Γ is appropriately defined as\n∂F ∂G ∂F ∂G ∂F ∂G ∂F ∂G\n+\n+\n+\n∂t pt\n∂a pa\n∂ ȧ Pa\n∂ ṫ Pt\n− (F ←→ G) .\n(31)\n\n{F, G} =\n\nImportant to mention is the fact that the total Hamiltonian (29) leads us directly to the right equations of\n\nmotion (13) through the conventional Ostrogradski approach for higher-order derivative systems [17].\nWe also note that under the symplectic structure (31),\nthe constraints (27) and (28) result to be in involution,\n{C1 , C2 } = 0. According to the Dirac program for constrained systems, both C1 and C2 must be preserved by\nthe evolution which demands the existence of the secondary constraints\n\u0012\n\u0013\n1 2 2\n3 2\nC3 = H0 = p * Ẋ + N a H − 3 N P\n, (32)\na\nC4 = p * n.\n(33)\nThe vanishing of the canonical Hamiltonian is expected\ncourtesy of the reparametrization invariance of the RT\nmodel. Hence the canonical Hamiltonian H0 generates\ndiffeomorphisms normal to the worldvolume. The secondary constraint (33) is characteristic for every brane\nmodel linear in accelerations. The process of generation\nof further constraints is stopped at this stage since C3\nis preserved under evolution and the requirement of stationarity of C4 only determines a restriction on one of the\nLagrange multipliers, namely, λ2 = N 3 Ω/a2 Φ. Thus, we\nare dealing with a wholly constrained theory with firstand second-class constraints, which is a consequence of\nthe rich gauge symmetry of the RT model. The distintive feature of the constraints (27) and (28) instead of\nφμ is that C1 and C2 are constraints that naturally generate the relationships (32) and (33) as befit a higher-order\nderivative brane theory [24].\nFollowing Dirac's program, the set of constraints\nshould be separated into subsets of first- and second-class\nconstraints [26]. It is quite well known that for each pair\nof second-class constraints there is one degree of freedom\nwhich is not physically important and has to be removed\nfrom the theory, and for each first-class constraint one\ndegree of freedom is removed. For our system we have\ntwo first-class phase space constraints\nF1 = C1 ,\nN 3Ω\nF2 = 2 C2 + C3 ,\na Φ\n\n(34)\n(35)\n\nand two second-class constraints. The selection of the\nsecond-class constraints is straightforward (see the Appendix). We choose them as\nS1 = C2 ,\nS2 = C4 .\n\n(36)\n(37)\n\nNote that as we have two linear independent firstclass constraints, we have the presence of two\ngauge transformations in the RT model.\nIn the\nAppendix we discuss more thoroughly the Poisson brackets among the phase space constraints.\nThe counting of degrees of freedom is as follows:\ndof = [(Total number of canonical variables) − 2 ×\n(first − class constraints) − (number of second − class\nconstraints)]/2 = [8−(2×2)−2]/2 = 1, which agrees with\n\n\f6\nthe number of normals to the worldvolume [24]. Such a\nsingle degree of freedom can be identified as the scale\nfactor a(τ ).\nV.\n\nGAUGE–FIXING\n\nAccording to the conventional Dirac scheme, in order to extract the physical meaningful phase space for\na constrained system we need a gauge–fixing prescription which entails the introduction of extra constraints,\navoiding in this way the gauge freedom generated by constraints (34) and (35). To achieve this we will consider\nthe conventional cosmic gauge condition\np\n(38)\nφ1 = N − 1 = ṫ2 − ȧ2 − 1 ≈ 0 ,\n\nas expected. A transformation of the same kind was considered in [25] for a quantum treatment of a kink model.\nTo understand in a more transparent way the geometric content of this transformation let us go through the\nintrinsic angular momentum density of the RT model\ncalculation carefully. In terms of the new phase space\nvariables the intrinsic angular momentum is given by\nMμν\n= ηa Mai μν = N P [μ Ẋ ν] [20]. Such momentum is\ni\nconserved in the sense that ∇a Mai μν = 0. This contribution shows up as an effect of the finite width of\nthe brane in comparison with flimsy branes described by\nDirac-Nambu-Goto action. The only nonvanishing contribution to the intrinsic angular momentum reads\nMi\n\nηn\n\n=\n\n1\nN Πv ,\n2\n\n(43)\n\nand the generalized evolution Eq. (26)\n\nφ2 = N 2 + ȧ2 − γ N 2 H 2 a2 ≈ 0 ,\n\n(39)\n\nwhere the ≈ symbol stands for weak equality in the Dirac\napproach for constrained systems [26]. From the geometric point of view, this set of gauge conditions is good\nenough since the matrix ({F , φ1,2 }) is nondegenerate in\nthe constraint surface. Indeed, under the Poisson bracket\nstructure (31), it is straightforward to show that gauges\nφ1 and φ2 form a second-class algebra with the constraints F1 and F2\n{φ1 , F1 } = φ1 + 1,\n{φ1 , F2 } = 0,\n\n{φ2 , F1 } = 2φ2 + 2γH 2 a2 ,\n\nIn attempting to take into account the new phase space\nvariables, the first- and second-class constraints (34-37)\nbecome\nF1 = N ΠN ,\nF2 = p * Ẋ + N\n\n\u0012\n\n(44)\n\u0013\n1\n1\na3 H 2 + 3 N 2 Π2N − 3 Π2v , (45)\na\na\n\nand\n(40)\nS1 = Πv −\n\n{φ2 , F2 } = F (a, ȧ, ṫ) ,\n\nwhere F (a, ȧ, ṫ) is a complicated function [35]. Consequently, velocities ṫ and ȧ must be discarded as dynamical degrees of freedom.\nThe use of the completeness relation (5) results efficient\nat this level: It allows us to express the quantity P 2\nby the equivalent expression −(P * η)2 + (P * n)2 . This\nsuggests the implementation of the following canonical\ntransformation to a new set of phase space variables:\np\nN := ṫ2 − ȧ2 ,\n1\nΠN := (P * Ẋ) ,\nN\n\u0013\n\u0012\n(41)\npa\n,\nv := arctanh −\npt\nΠv := N (P * n) ,\ntogether with the coordinate transformation Z μ := X μ −\n{X μ , v} Πv , while the momenta pμ remains unaltered.\nSuch transformation can be physically interpreted as a\nLorentz rotation in phase space which, straightforwardly,\npreserves the structure of the canonical Poisson brackets\n{N, ΠN } = 1 = {v, Πv } ,\n{Z μ , pν } = δ μ ν ,\n\nwhich in turn tell us that our new variable Πv can be\nthought of as an angular momentum component.\n\n(42)\n\na2 ṫ\n= 0,\nN\n\nS2 = pa ṫ + pt ȧ = pa ṫ −\n\n(46)\n2aȧ\nṫ = 0 ,\nN\n\n(47)\n\nrespectively. Note that in the second-class constraint (47)\nwe split the momentum conjugated to a according to relation (20), and hence, the second-class constraint (47)\nresults in identity (22). Furthermore, second-class identities (46) and (47) will become auspicious at the quantum\nlevel since they enclose important operator identities.\nOne can develop further the constraint F2 (45) by expressing \u0002the velocities in terms\n\u0001\u0003 of the momenta, ȧ =\n−(N/a) pa / (γ − 1)a2 H 2 + 2 and ṫ = −ΩN/(γ −\n1)a3 H 2 by using the second gauge (39). Thus, a direct\ncalculation on the first term in (45) yields\n\u0013\nN\np2a\na[(γ − 1)a2 H 2 + 2]\n\u0012\n\u0013\nNΩ\n−\npt + pa ȧ.\n(γ − 1)a3 H 2\n\np * Ẋ = −\n\n\u0012\n\n(48)\n\nFinally, after a lenghty but straightforward computation\nthe constraint F2 can be cast as\n\n\f7\n\nF2 = N\n\n\u001a\n\n\u0014 \u0012\np2a − a −\n\nΩ\n(γ − 1)a3 H 2\n\n\u0013\n\npt +\n\n\u0015\n\u001b\n\u0002\n\u0003\npa ȧ\n1\n1\n+ a3 H 2 + 3 N 2 Π2N − 3 Π2v\n(γ − 1)a2 H 2 + 2 .\nN\na\na\n\nWe could also use Eq. (18) and the second-class condition (47), which impose the identities pt = −Ω and\npa = 2aȧ/N , respectively, to conclude that the constraint\nF2 ≈ 0 gives rise to a quadratic expression for the involved momenta. That is, the second gauge condition\n(39) shifts the problem from the linear dependence in\nthe momenta, to a convenient quadratic expression for\nthe physical momenta. To close this section we must\nmention that the constraints F1 and F2 form an algebra\nisomorphic to the Lie algebra associated to the lower triangular subgroup of SL(2, R) as argued in the Appendix.\nThis is the starting point to achieve an algebraic quantization as we will sketch below.\nVI.\n\nby implementation of the Dirac bracket. Once this is\ndone, the second-class constraints are eliminated off the\ntheory by converting them into strong identities. At the\nquantum level this is mirrored by defining the quantum\ncommutator of two quantum operators as\n\\\n[Â, B̂] := i{A,\nB}∗ ,\n\nd\na2 ṫ\n= 0,\nN\ndȧ\n2a\n= p̂a −\n= 0,\nN\n\nŜ1 = Π̂v −\n\n(51)\n\nŜ2\n\n(52)\n\nwhich, in particular, tell us the character of the quantum\noperators Π̂v and p̂a . For the rest of the variables, we\nchoose to work on the \"position\" representation, where\nwe consider the position operators by multiplication and\ntheir associated momenta operators by −i times the corresponding derivative operator when applied on states\ndefined on a suitable Hilbert space.\nBy defining the quantum first-class constraints as\n\n∂\nF̂1 := −iN\n,\n∂N\n(\n\"\n\u00132 #\n\u0012\n∂2\n∂\n∂\n1\niΩ\n2 2\n2 2\nF̂2 := N − 2 −\n+ 2a(γH a − 1) + a(1 − γ)H a − 3 N\n∂a\n(γ − 1)a3 H 2 ∂t\na\n∂N\n\u0002\n\u0003\n×a (γ − 1)H 2 a2 + 2 ,\nwe will work on the assumption that the commutators\nof these quantum constraints form a closed Lie algebra\nwhich will be also isomorphic to the algebra g. In fact,\nthe classical first-class constraints are isomorphic to the\nalgebra g associated to the lower triangular subgroup G of\nSL(2, R) (see the Appendix). Quantization of the lower\ntriangular subgroup of SL(2, R) by algebraic methods\nwas extensively studied in [27] (see also [28] for comparison). Now we explore the rather different senses in\n\n(50)\n\nwhere the Dirac bracket {*, *}∗ is defined in Eq. (A7).\nThus, with this prescription the operators corresponding\nto second-class constraints are also enforced as operator\nidentities [26]. For our system, this yields the quantum\noperator expressions\n\nQUANTIZATION\n\nIn this section we study the canonical quantization of\nour system. Also, we will sketch an alternative different quantum theory for our model which emerge from\nthe corresponding first-class symmetries. To this end, we\nemphasize the totally dissimilar nature which first- and\nsecond-class constraints play in the quantum theory, and\nalso, we explore the different senses in which the physical\nstates of our theory can be defined.\nWe start in the conventional way by promoting the\nclassical constraints into operators, densely defined on a\ncommon domain in a proper Hilbert space. As it is well\nknown, we can only achieve a consistent classical theory\n\n(49)\n\n(53)\n\n(54)\n\nwhich the quantum constraints can be used to define appropriate physical states.\n\nA.\n\nNaı̈ve Dirac constraints\n\nFirst, we explore the Wheeler–DeWitt equation emerging by considering the physical states Ψ of the theory as\n\n\f8\nFIG. 1: WDW potential for geodetic gravity with naı̈ve Dirac\nconstraints.\n\na\n\nU\n\nfor the Dirac conditions on physical states. Let {Ĉa }\nbe a set of quantum constraints operators that generate a nonunimodular gauge group with the commutators\nc\na\n[Ĉa , Ĉb ] = ifab\nĈc , where fbc\nare the structure constants\nof the corresponding Lie algebra. Thus, the \"unimodularization\" procedure for nonunimodular groups dictates\nthe consideration of the physical states |Ψi as those satisb\nfying Ĉa |Ψi = −(i/2)fab\n|Ψi. Such modified Dirac conditions agree with the naı̈ve Dirac constraints if, and only\nif, the group is unimodular.\nAccordingly, for our theory the modified Dirac conditions for the gauge group invariant quantization of the\nsystem can be shown to be equivalent to\n\u0014\n\nthose defined by naı̈ve Dirac conditions\nF̂1 Ψ = 0 ,\n\n(55)\n\nF̂2 Ψ = 0 .\n\n(56)\n\nEquation (55) simply tells us that our physical states Ψ\nare not explicitly depending on the phase space variable\nN . However, due mainly to the complexity of our WDW\nEq. (56), we have not succeed in finding explicit solutions for the physically admisible quantum states. We\nnote that the last term in the operator (54) will bring a\nvanishing contribution to the WDW equation, and also\nwe see that the t–dependence can be avoided by assuming\nΨ(a, t) := e−iΩt ψ, where ψ := ψ(a) satisfies the WDW\nequation\n\u0014\n\u0015\n∂2\n− 2 + U (a) ψ(a) = 0 ,\n(57)\n∂a\nwhere the potential U (a) is given by\nU (a) = a\n\n2\n\n\u0002\n\n2 2\n\n(γ − 1)H a + 2\n\n\u00032\n\n2 2\n\n1 − γH a\n\n\u0001\n\n,\n\n(58)\n\nwhich is recognized as the potential function found in [9]\nby repeated use of the master evolution constraint (26)\nin Eq. (56). The behavior of this potential is drawn in\nFig. 1, where we can see the characteristic potential barrier. As discussed by Davidson and coworkers, it can\nbe shown that after considering appropriate boundary\nconditions the big–bang singularity in our quantum theory can be neutralized by properly choosing the origin\nas inaccessible to wave packets. For further details on\nthe behavior of the potential U (a), the reader is referred\nto [9].\nB.\n\nModified Dirac constraints\n\nAs discussed in Refs. [29, 30], there exists a procedure which allows us to reduce nonunimodular groups\nto unimodular ones and this in turn brings a remarkable alteration for systems amenable to geometric or\nalgebraic quantization which comprises a modification\n\n\u0015\ni\nF̂1 −\n|Ψi = 0 ,\n2\n\n(59)\n\nF̂2 |Ψi = 0 ,\n\n(60)\n\nwhich consequently define physical states |Ψi. Equation (59) is equivalent to the homogeneity condition\n|Ψ(rN )i = r−1/2 |Ψ(N )i for r > 0 [27]. Further, (59)\ncan be explicity solved by taking |Ψi = NA1/2 |ψi, where\nA is a constant, and |ψi is a function of the variables a\nand t. Once more we also do not have control on the\nexplicit solutions for the physically admisible quantum\nstates. The t–dependence can be avoided by assuming\n|ψ(a, t)i := e−iΩt |φi, where |φi is thought of as a function of the scale factor a only, which satisfies the WDW\nequation\n\u0014\n\n\u0015\n(γ − 1)a2 H 2 + 2\n∂2\n|φ(a)i = 0 , (61)\n− 2 + U (a) +\n∂a\n4a2\n\nwhere the potential U (a) was described in the previous\nsubsection. Hence, we see that our modified quantum\ntheory brings out an extra potential term into our WDW\nequation, which succinctly differs from the one found\nwith the naı̈ve Dirac procedure.\nWe note that the extra term is purely emerging from\nthe modified quantum Dirac Eqs. (59) and (60), and it\nis completely absent while considering the naı̈ve Dirac\nprocedure. This term will be nonvanishing even in the\nEinstein limit (γ → 1), where it goes as a−2 . Further\nstudies about the possible physical implications of this\nterm could be carried out. The behavior of the modified potential is drawn in Fig. 2, where we can notably\nsee that the central barrier potential present in Fig. 1\nis almost vanishing while an infinite barrier emerges at\nthe origin. Until our knowledge, the resulting unbounded\npotential is not realistic despite the first-class constraints\nsuggest this modified description. Nevertheless, one can\nnot resist the speculation of such possible quantum behavior. Thus, rather than a nice potential, this time\nit is a more complicated function with distinct features\nnotwithstanding the internal constraint symmetries that\ndemand an unimodularization procedure.\n\n\f9\nFIG. 2: WDW potential for geodetic gravity with modified\nDirac constraints.\n\na\n\nU\n\nVII.\n\nCONCLUDING REMARKS\n\nBy making use of the Ostrogradski formalism we have\ndeveloped an alternative Hamiltonian description of the\nRT brane model. Unlike the Hamiltonian treatment by\nDavidson and coworkers for this model [10, 11], our analysis above keeps the original variables without the necessity of introducing nondynamical variables. At first\nsight, this may look like an unnecessary complication\nsince the configuration space is initially increased only\nto be reduced again at a later stage by imposing the constraints and fixing the gauge. Nevertheless, it is hoped\nthat despite computational complications we have provided an improvement of physical clarity, in particular,\nconcerning the geometrical meaning of the constraints\nof the theory and the physical content of the achieved\ncanonical transformation. Although the Ostrogradski approach has a price to pay, since neither the momentum\nP has the meaning of mechanical momentum nor H0 has\nto do with the energy of the system, as it is customary, these quantities are adequate for providing a set of\ncanonical equations which correctly describe the evolution of the system. Also, an important point to mention\nis that the formalism is rich enough to demonstrate the\nreal role of the extra terms coming from the surface: the\nphase space constraints of the system impose identities\nfor these quantities which are valid at both classical and\nquantum levels, hence eliminating the unphysical degrees\nof freedom.\nIn spite of the fact that this model is a second-order\nderivative theory and since it is well known that at\nquantum level the energy for higher-order derivative Lagrangians is almost always unbounded below, the RT\nmodel results an exception due to its linear dependence\non the accelerations which in turn contain important\nphysical information commonly absent in higher-order\nderivative theories [31]. Like it or not, until now a Hamiltonian approach for the RT field theory demands the\nuse of extra unphysical degrees of freedom at the beginning which by means of the phase space constraints\nare frozen out. Our adopted treatment renders the passage to a full quantization for the system which can be\n\nachieved by means of an inspired canonical transformation. We conclude further that the Ostrogradski quantum approach has exactly the same unique degree of freedom as the Davidson and coworkers approach. Although\nour Wheeler-DeWitt equation for the scale factor is not\nanalytically manageable, it is good enough to substract\nfrom it some interesting features. In particular, the potential we found is exactly the same as the one extensively discussed by Davidson et al. [9]. Furthermore, our\nHamiltonian approach makes feasible the quantum treatment of Lagrangians with linear higher-order derivative\ndependence in the fields.\nIt is suggesting that relativistic theories linear in the\naccelerations, for which characteristic surface terms are\ncommonly neglected, are, as a generic feature, reluctant\nto quantization. To present day, quantization for these\nkind of systems have been mainly studied by considering\nsome extra degrees of freedom by several other methods.\nFrom this point of view, our intention has also been to\nintroduce the Hamiltonian-Ostrogradski approach as a\ngeometrical powerful method to beset this sort of systems. An specific example of this would be to apply\nour treatment to the almost forgotten idea concerning\nthe rigid bubble electron, for which a linear correction in\nthe extrinsic curvature of the electron surface is added to\nthe Dirac–Nambu–Goto action in contrast to the conventional first order method where a surface term is omitted [32]. It will be worked elsewhere.\n\nAcknowledgments\n\nThis work was partially supported by SNI (Mexico). ER and RC acknowledge support from CONACYT\n(Mexico) research grant J1-60621-I. RC also acknowledge\nsupport from EDI, COFAA–IPN and SIP-20082476. AM\nwas supported by CONACYT (Mexico) grant CB-75629.\nER acknowledge partial support from PROMEP, 20062008 (Mexico).\n\nAPPENDIX A: ALGEBRAIC PROPERTIES OF\nTHE CONSTRAINTS\n\nWe can construct the matrix CAB whose elements are\nthe Poisson brackets of all the constraints CA where\nA, B = 1, 2, 3, 4. Hence,\n\n0 0\n0\n0\n2\n1 0 0\n0\n−a Φ \n(CAB ) =\n,\n0 0\n0\nN 3Ω \naN\n2\n3\n0 a Φ −N Ω\n0\n\n\n(A1)\n\nin the constraint surface. This matrix has rank 2, which\nis a signal that we have two first-class constraints [26]. It\nis also important to mention that constraints C1 and C3\n\n\f10\nby\n\nform an algebra, namely,\n{C1 , C1 } = 0,\n{C1 , C3 } = −C3 ,\n{C3 , C3 } = 0 ,\n\n(A2)\n\n\u0012\n\n0 −1\n1 0\n\n\u0013\n\n,\n\n(A5)\n\nN\naΦ\n\n\u0012\n\n0 1\n−1 0\n\n\u0013\n\n,\n\n(A6)\n\nand its inverse\n\nwhich reflects the invariance under reparametrizations of\nthe RT field theory as a fundamental gauge symmetry.\nIndeed, this algebra results an isomorphism of the Lie\nalgebra g associated to the lower triangular subgroup of\nSL(2, R) with positive diagonal elements, G. Such Lie\nalgebra g is spanned by the matrices [33]\n\u0013\n\u0013\n\u0012\n\u0012\n0 0\n1 0\n,\n(A3)\n, e− :=\nh :=\n1 0\n0 −1\nwhose commutator is\n\u0003\n\u0002\nh , e− = −2e− ,\n\naΦ\n(SIJ ) =\nN\n\n(A4)\n\nand hence we realize the isomorphism through the identification C1 7→ h/2 and C3 7→ e− . Among the relevant\nproperties of the subgroup G we refer that G is two–\ndimensional, non–Abelian, connected, and nonunimodular. This last property plays an important role in our\nquantum theory, as developed in section VI.\nAlso, among the second-class constraints, (36) and\n(37), we can construct the matrix SIJ = {SI , SJ }, given\n\n[1] T. Regge and C. Teitelboim, in Proceedings of the First\nMarcel Grossman Meeting, Trieste, Italy, (1975), ed.\nR. Ruffini (North–Holland, Amsterdam) 77 (1977).\n[2] M. Pavsic, Class. Quantum Grav. 2 869 (1985)\n[3] M. Pavsic, Phys. Lett. A107 66 (1985)\n[4] V. Tapia, Class. Quantum Grav. 6 L49 (1989)\n[5] D. Maia, Class. Quantum Grav. 6 173 (1989)\n[6] A. Davidson and I. Gurwich, Phys. Rev. D74, 044023\n(2006) arXiv:0606098v1 [gr-qc].\n[7] L. Randall and R. Sundrum, Phys. Rev. Lett 83, 3370\n(1999); 83, 4690 (1999).\n[8] A. Davidson, Class. Quantum Grav. 16 653 (1999)\narXiv:9710005v2 [gr-qc].\n[9] A. Davidson, D. Karasik and Y Lederer, Class. Quantum Grav 16 1349 (1999) arXiv:9901003v1 [gr-qc].\n[10] A. Davidson and D. Karasik, Mod. Phys. Lett. A13, 2187\n(1998) arXiv:9901004v1 [gr-qc].\n[11] D. Karasik and A. Davidson, Phys. Rev. D67 064012\n(2003) arXiv:0207061v2 [gr-qc].\n[12] N. Arkani-Hamed, S. Dimopoulos and G. Dvali, Phys.\nLett. B 429, 263 (1998); I. Antoniadis, N. Arkani-Hamed,\nS. Dimopoulos and G. Dvali, Phys. Lett. B436, 257\n(1998).\n[13] S. S. Seahra, H.R. Sepangiand J. Ponce de Leon, Phys.\nRev. D 68, 066009 (2003).\n[14] A. Vilenkin, Phys. Rev. D 50, 2581 (1994)\n[15] R. Cordero and A. Vilenkin, Phys. Rev. D 65, 083519\n(2002).\n[16] M. Ostrogradski, Mem. Ac. St. Petersbourg VI 4 385\n\n(S IJ ) =\n\nwhere I, J = 1, 2. The matrix S IJ will help us to construct a Dirac bracket in the standard way: Let f and g\nbe two arbitrary functions then\nX\n{f, g}∗ := {f, g} −\n{f, SI }S IJ {SJ , g} ,\n(A7)\n\nwhere {*, *} stands for the Poisson bracket defined in (31).\nAs it is well known, classically, the Dirac bracket is essential to eliminate the second-class constraint off the\ntheory by converting them into simple functional identities. The need for the Dirac bracket is also very relevant\nat the quantum theory since we can only reach a consistent quantization procedure through the implementation\nof this bracket [26].\n\n(1850).\n[17] V. Nesterenko, J. Phys. A: Math. and Gen. 22 1673\n(1989).\n[18] R. Capovilla and J. Guven, Phys. Rev. D51, 6736 (1995)\narXiv:9411060v2 [gr-qc].\n[19] M. Spivak, Introduction to Differential Geometry Vols. I\nto 5 (Publish or Perish, Boston MA) (1970).\n[20] G. Arreaga, R. Capovilla and J. Guven, Annals of Phys.\n279, 126 (2000) arXiv:0002088v1 [hep-th].\n[21] R. Capovilla, A. Escalante, J. Guven and E. Rojas,\nHamiltonian dynamics of extended objects: Regge-Teitelboim model, arXiv:0603126v1 [gr-qc].\n[22] B. Carter, in Proceedings of the 2nd Mexican School on Gravitation and Mathematical Physics, Tlaxcala,\nMéxico, (1996), edited by A. Garcı́a, C. Lammerzahl, A.\nMacias and D. Núñez (Science Network Publishing, Konstanz), 1997, arXiv:9705172v1 [hep-th].\n[23] R. Capovilla and J. Guven, Phys. Rev. D55 2388 (1997)\narXiv:9804001v1 [math-ph].\n[24] R. Capovilla, J. Guven and E. Rojas, Class. Quantum Grav. 21, 5563 (2004) arXiv:0404178v1 [hep-th].\n[25] A. A. Kapustnikov, A. Pashnev and A. Pichugin, Phys.\nRev. D55 2257 (1997)\n[26] M. Henneaux and C. Teitelboim, Quantization of gauge\nsystems (Princeton University Press, Princeton New Jersey, 1992).\n[27] J. Louko and A. Molgado, Int. J. Mod. Phys. D14, 1131\n(2005) arXiv:0404100v4 [gr-qc].\n[28] J. Louko and A. Molgado, J. Math. Phys. 45, 1919\n\n\f11\n(2004). arXiv:0312014v2 [gr-qc].\n[29] D. Giulini and D. Marolf, Class. Quantum Grav. 16, 2489\n(1999) arXiv:9902045v2 [gr-qc].\n[30] G. M. Tuynman, J. Math. Phys. 31, 83 (1990).\n[31] Jonathan Z. Simon, Phys. Rev. D41 3720 (1990).\n[32] M. Onder and R. W. Tucker, J. Phys. A: Math. and Gen.\n21 3423 (1988).\n[33] R. Howe and E. C. Tan, Non-Abelian Harmonic Analysis:\nApplications of SL(2, R) (Springer, New York, 1992).\n[34] Indisputably, it can be argued that this Lagrangian\nfunction can be brought into the total derivative\n\nof a surface term plus a function depending up\nto the velocities of the variables a and t, namely,\n`\n ́\n2\na ṫ\nL = N\naäṫ − aȧẗ + ṫ3 − ȧ2 ṫ − N a3 H 2 = − aNȧ +\n3\n\" 2 \"\n`\n ́\nd\na ȧ\na N 1 − a2 H 2 + dτ\n. In this work we avoid to\nN\nfollow the usual shortcut and we maintain the surface\nterm which plays an important role in our calculations.\n[35] This function\nby \"the awkward expression\n\"iF =\nh ` is given\n ́\n2\n2\n4Ω2\n+\n2\n+\nH\nγa\n−\n.\n−(2ȧ/a) ṫ2 Θ\nΦ\nH 6 a6 (γ−1)(3γ−1)\n\n\f"}