{"id": "http://arxiv.org/abs/1203.4499v1", "guidislink": true, "updated": "2012-03-20T16:44:27Z", "updated_parsed": [2012, 3, 20, 16, 44, 27, 1, 80, 0], "published": "2012-03-20T16:44:27Z", "published_parsed": [2012, 3, 20, 16, 44, 27, 1, 80, 0], "title": "Extended Report: The Implicit Calculus", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1203.3996%2C1203.4143%2C1203.5144%2C1203.6481%2C1203.4009%2C1203.6522%2C1203.4232%2C1203.4797%2C1203.3580%2C1203.0268%2C1203.0873%2C1203.5851%2C1203.5683%2C1203.2267%2C1203.2258%2C1203.6354%2C1203.6306%2C1203.3656%2C1203.3754%2C1203.6656%2C1203.4979%2C1203.4665%2C1203.1464%2C1203.2767%2C1203.4387%2C1203.4547%2C1203.2565%2C1203.0541%2C1203.3128%2C1203.2543%2C1203.1797%2C1203.2403%2C1203.1137%2C1203.6134%2C1203.4750%2C1203.0917%2C1203.2765%2C1203.4141%2C1203.3998%2C1203.1405%2C1203.3679%2C1203.0419%2C1203.1301%2C1203.1116%2C1203.0079%2C1203.5227%2C1203.6389%2C1203.2194%2C1203.6468%2C1203.5661%2C1203.4499%2C1203.3691%2C1203.0129%2C1203.3003%2C1203.3729%2C1203.2268%2C1203.2847%2C1203.2706%2C1203.4869%2C1203.3937%2C1203.3015%2C1203.0971%2C1203.6556%2C1203.5188%2C1203.1821%2C1203.3359%2C1203.6625%2C1203.5625%2C1203.1064%2C1203.3810%2C1203.5018%2C1203.3606%2C1203.3818%2C1203.0101%2C1203.3383%2C1203.2947%2C1203.5385%2C1203.0334%2C1203.3977%2C1203.2308%2C1203.1437%2C1203.6746%2C1203.3217%2C1203.5517%2C1203.4354%2C1203.0523%2C1203.0048%2C1203.2861%2C1203.2685%2C1203.5208%2C1203.4549%2C1203.2452%2C1203.3877%2C1203.0032%2C1203.6335%2C1203.3108%2C1203.1122%2C1203.4202%2C1203.3733%2C1203.4895%2C1203.0342&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Extended Report: The Implicit Calculus"}, "summary": "Generic programming (GP) is an increasingly important trend in programming\nlanguages. Well-known GP mechanisms, such as type classes and the C++0x\nconcepts proposal, usually combine two features: 1) a special type of\ninterfaces; and 2) implicit instantiation of implementations of those\ninterfaces.\n  Scala implicits are a GP language mechanism, inspired by type classes, that\nbreak with the tradition of coupling implicit instantiation with a special type\nof interface. Instead, implicits provide only implicit instantiation, which is\ngeneralized to work for any types. This turns out to be quite powerful and\nuseful to address many limitations that show up in other GP mechanisms.\n  This paper synthesizes the key ideas of implicits formally in a minimal and\ngeneral core calculus called the implicit calculus, and it shows how to build\nsource languages supporting implicit instantiation on top of it. A novelty of\nthe calculus is its support for partial resolution and higher-order rules (a\nfeature that has been proposed before, but was never formalized or\nimplemented). Ultimately, the implicit calculus provides a formal model of\nimplicits, which can be used by language designers to study and inform\nimplementations of similar mechanisms in their own languages.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1203.3996%2C1203.4143%2C1203.5144%2C1203.6481%2C1203.4009%2C1203.6522%2C1203.4232%2C1203.4797%2C1203.3580%2C1203.0268%2C1203.0873%2C1203.5851%2C1203.5683%2C1203.2267%2C1203.2258%2C1203.6354%2C1203.6306%2C1203.3656%2C1203.3754%2C1203.6656%2C1203.4979%2C1203.4665%2C1203.1464%2C1203.2767%2C1203.4387%2C1203.4547%2C1203.2565%2C1203.0541%2C1203.3128%2C1203.2543%2C1203.1797%2C1203.2403%2C1203.1137%2C1203.6134%2C1203.4750%2C1203.0917%2C1203.2765%2C1203.4141%2C1203.3998%2C1203.1405%2C1203.3679%2C1203.0419%2C1203.1301%2C1203.1116%2C1203.0079%2C1203.5227%2C1203.6389%2C1203.2194%2C1203.6468%2C1203.5661%2C1203.4499%2C1203.3691%2C1203.0129%2C1203.3003%2C1203.3729%2C1203.2268%2C1203.2847%2C1203.2706%2C1203.4869%2C1203.3937%2C1203.3015%2C1203.0971%2C1203.6556%2C1203.5188%2C1203.1821%2C1203.3359%2C1203.6625%2C1203.5625%2C1203.1064%2C1203.3810%2C1203.5018%2C1203.3606%2C1203.3818%2C1203.0101%2C1203.3383%2C1203.2947%2C1203.5385%2C1203.0334%2C1203.3977%2C1203.2308%2C1203.1437%2C1203.6746%2C1203.3217%2C1203.5517%2C1203.4354%2C1203.0523%2C1203.0048%2C1203.2861%2C1203.2685%2C1203.5208%2C1203.4549%2C1203.2452%2C1203.3877%2C1203.0032%2C1203.6335%2C1203.3108%2C1203.1122%2C1203.4202%2C1203.3733%2C1203.4895%2C1203.0342&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Generic programming (GP) is an increasingly important trend in programming\nlanguages. Well-known GP mechanisms, such as type classes and the C++0x\nconcepts proposal, usually combine two features: 1) a special type of\ninterfaces; and 2) implicit instantiation of implementations of those\ninterfaces.\n  Scala implicits are a GP language mechanism, inspired by type classes, that\nbreak with the tradition of coupling implicit instantiation with a special type\nof interface. Instead, implicits provide only implicit instantiation, which is\ngeneralized to work for any types. This turns out to be quite powerful and\nuseful to address many limitations that show up in other GP mechanisms.\n  This paper synthesizes the key ideas of implicits formally in a minimal and\ngeneral core calculus called the implicit calculus, and it shows how to build\nsource languages supporting implicit instantiation on top of it. A novelty of\nthe calculus is its support for partial resolution and higher-order rules (a\nfeature that has been proposed before, but was never formalized or\nimplemented). Ultimately, the implicit calculus provides a formal model of\nimplicits, which can be used by language designers to study and inform\nimplementations of similar mechanisms in their own languages."}, "authors": ["Bruno C. d. S. Oliveira", "Tom Schrijvers", "Wontae Choi", "Wonchan Lee", "Kwangkeun Yi"], "author_detail": {"name": "Kwangkeun Yi"}, "author": "Kwangkeun Yi", "arxiv_comment": "13 pages, extended report of paper accepted at PLDI 2012", "links": [{"href": "http://arxiv.org/abs/1203.4499v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1203.4499v1", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "cs.PL", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cs.PL", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1203.4499v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1203.4499v1", "journal_reference": null, "doi": null, "fulltext": "Extended Report: The Implicit Calculus\n\narXiv:1203.4499v1 [cs.PL] 20 Mar 2012\n\nA New Foundation for Generic Programming\nBruno C. d. S. Oliveira\n\nTom Schrijvers\n\nWontae Choi\n\nSeoul National University\nbruno@ropas.snu.ac.kr\n\nUniversiteit Gent\ntom.schrijvers@ugent.be\n\nSeoul National University\nwtchoi@ropas.snu.ac.kr\n\nWonchan Lee\n\nKwangkeun Yi\n\nSeoul National University\nwclee@ropas.snu.ac.kr\n\nSeoul National University\nkwang@ropas.snu.ac.kr\n\nAbstract\nGeneric programming (GP) is an increasingly important trend in\nprogramming languages. Well-known GP mechanisms, such as\ntype classes and the C++0x concepts proposal, usually combine\ntwo features: 1) a special type of interfaces; and 2) implicit instantiation of implementations of those interfaces.\nScala implicits are a GP language mechanism, inspired by type\nclasses, that break with the tradition of coupling implicit instantiation with a special type of interface. Instead, implicits provide only\nimplicit instantiation, which is generalized to work for any types.\nThis turns out to be quite powerful and useful to address many limitations that show up in other GP mechanisms.\nThis paper synthesizes the key ideas of implicits formally in\na minimal and general core calculus called the implicit calculus\n(λ⇒ ), and it shows how to build source languages supporting implicit instantiation on top of it. A novelty of the calculus is its support for partial resolution and higher-order rules (a feature that has\nbeen proposed before, but was never formalized or implemented).\nUltimately, the implicit calculus provides a formal model of implicits, which can be used by language designers to study and inform\nimplementations of similar mechanisms in their own languages.\nCategories and Subject Descriptors D.3.2 [Programming Languages]: Language Classifications-Functional Languages, ObjectOriented Languages; F.3.3 [Logics and Meanings of Programs]:\nStudies of Program Constructs\nGeneral Terms\n\nLanguages\n\nKeywords Implicit parameters, type classes, C++ concepts, generic\nprogramming, Haskell, Scala.\n\n1. Introduction\nGeneric programming (GP) [23] is a programming style that decouples algorithms from the concrete types on which they operate. Decoupling is achieved through parametrization. Typical forms\nof parametrization include parametrization by type (for example:\nparametric polymorphism, generics or templates) or parametrization by algebraic structures (such as a monoid or a group).\nA central idea in generic programming is implicit instantiation of generic parameters. Implicit instantiation means that, when\ngeneric algorithms are called with concrete arguments, the generic\narguments (concrete types, algebraic structures, or some other form\nof generic parameters) are automatically determined by the compiler. The benefit is that generic algorithms become as easy to use\n\nas specialized algorithms. To illustrate implicit instantiation and its\nbenefits consider a polymorphic sorting function:\nsort [α] : (α → α → Bool ) → List α → List α\nwith 3 parameters: the type of the elements in the list (α); the\ncomparison operator; and the list to be compared. Instantiating\nall 3 parameters explicitly at every use of sort would be quite\ntedious. It is likely that, for a given type, the sorting function is\ncalled with the same, explicitly passed, comparison function over\nand over again. Moreover it is easy to infer the type parameter α.\nGP greatly simplifies such calls by making the type argument and\nthe comparison operator implicit.\nisort : ∀α.(α → α → Bool ) ⇒ List α → List α\nThe function isort declares that the comparison function is implicit\nby using ⇒ instead of →. It is used as:\nimplicit {cmpInt : Int → Int → Bool } in\n(isort [2, 1, 3], isort [5, 9, 3])\nThe two calls of isort each take only one explicit argument: the list\nto be sorted. Both the concrete type of the elements (Int) and the\ncomparison operator (cmpInt) are implicitly instantiated.\nThe element type is automatically inferred from the type of\nthe list. More interestingly, the implicit comparison operator is\nautomatically determined in a process called resolution. Resolution\nis a type-directed process that uses a set of rules, the implicit\nenvironment, to find a value that matches the type required by\nthe function call. The implicit construct extends the implicit\nenvironment with new rules. In other words, implicit is a scoping\nconstruct for rules similar to a conventional let-binding. Thus, in\nthe subexpression (isort [2, 1, 3], isort [5, 9, 3]), cmpInt is in the\nlocal scope and available for resolution.\n1.1 Existing Approaches to Generic Programming\nThe two main strongholds of GP are the C++ and the functional\nprogramming (FP) communities. Many of the pillars of GP are\nbased on the ideas promoted by Musser and Stepanov [23]. These\nideas were used in C++ libraries such as the Standard Template\nLibrary [24] and Boost [1]. In the FP community, Haskell type\nclasses [42] have proven to be an excellent mechanism for GP,\nalthough their original design did not have that purpose. As years\npassed the FP community created its own forms of GP [14, 10, 21].\nGarcia et al.'s [9] comparative study of programming language\nsupport for GP was an important milestone for both communi-\n\n\fties. According to that study many languages provide some support for GP. However, Haskell did particularly well, largely due to\ntype classes. A direct consequence of that work was to bring the\ntwo main lines of work on GP closer together and promote crosspollination of ideas. Haskell adopted associated types [4, 3], which\nwas the only weak point found in the original comparison. For the\nC++ community, type classes presented an inspiration for developing language support for concepts [23, 11, 34].\nSeveral researchers started working on various approaches to\nconcepts (see Siek's work [33] for a historical overview). Some researchers focused on integrating concepts into C++ [7, 11], while\nothers focused on developing new languages with GP in mind.\nThe work on System F G [34, 35] is an example of the latter approach: Building on the experience from the C++ generic programming community and some of the ideas of type classes, Siek and\nLumsdaine developed a simple core calculus based on System F\nwhich integrates concepts and improves on type classes in several\nrespects. In particular, System F G supports scoping of rules1 .\nDuring the same period Scala emerged as new contender in the\narea of generic programming. Much like Haskell, Scala was not\noriginally developed with generic programming in mind. However\nScala included an alternative to type classes: implicits. Implicits\nwere initially viewed as a poor man's type classes [26]. Yet, ultimately, they proved to be quite flexible and in some ways superior\nto type classes. In fact Scala turns out to have very good support\nfor generic programming [28, 29].\nA distinguishing feature of Scala implicits, and a reason for\ntheir power, is that resolution works for any type. This allows Scala\nto simply reuse standard OO interfaces/classes (which are regular\ntypes) to model concepts, and avoids introducing another type of\ninterface in the language. In contrast, with type classes, or the\nvarious concept proposals, resolution is tightly coupled with the\ntype class or concept-like interfaces.\n1.2 Limitations of Existing Mechanisms\nTwenty years of programming experience with type classes gave\nthe FP community insights about the limitations of type classes.\nSome of these limitations were addressed by concept proposals.\nOther limitations were solved by implicits. However, as far as we\nknow, no existing language or language proposal overcomes all\nlimitations. We discuss these limitations next.\nGlobal scoping: In Haskell, rules2 are global and there can be\nonly a single rule for any given type [18, 2, 6, 8]. Locally scoped\nrules are not available. Several researchers have already proposed to\nfix this issue: with named rules [18] or locally scoped ones [2, 6, 8].\nHowever none of those proposals have been adopted.\nBoth proposals for concepts and Scala implicits offer scoping of\nrules and as such do not suffer from this limitation.\nSecond class interfaces: Haskell type classes are second-class\nconstructs compared to regular types: in Haskell, it is not possible\nto abstract over a type class [13]. Yet, the need for first-class\ntype classes is real in practice. For example, Lämmel and Peyton\nJones [21] desire the following type class for their GP approach:\nclass (Typeable α, cxt α) ⇒ Data cxt α where\ngmapQ :: (∀β.Data cxt β ⇒ β → r ) → α → [r ]\nIn this type class, the intention is that the ctx variable abstracts\nover a concrete type class. Unfortunately, Haskell does not support\ntype class abstraction. Proposals for concepts inherit this limitation\nfrom type classes. Concepts and type classes are usually interpreted\nas predicates on types rather than types, and cannot be abstracted\n1 In\n\nthe context of C++ rules correspond to models or concept maps.\n2 In the context of Haskell rules correspond to type-class instances.\n\nover as regular types. In contrast, because in Scala concepts are\nmodeled with types, it is possible to abstract over concepts. Oliveira\nand Gibbons [28] show how to encode this example in Scala.\nNo higher-order rules: Finally type classes do not support\nhigher-order rules. As noted by Hinze and Peyton Jones [12], nonregular Haskell datatypes like:\ndata Perfect f α = Nil | Cons α (Perfect f (f α))\nrequire type class instances such as:\ninstance (∀β.Show β ⇒ Show (f β), Show α) ⇒\nShow (Perfect f α)\nwhich Haskell does not support, as it restricts instances (or rules) to\nbe first-order. This rule is higher-order because it assumes another\nrule, ∀β.Show β ⇒ Show (f β), that contains an assumption\nitself. Also note that this assumed rule is polymorphic in β.\nBoth concept proposals and Scala implicits inherit the limitation\nof first-order rules.\n1.3 Contributions\nThis paper presents λ⇒ , a minimal and general core calculus for\nimplicits and it shows how to build a source language supporting\nimplicit instantiation on top of it. Perhaps surprisingly the core\ncalculus itself does not provide implicit instantiation: instantiation of generic arguments is explicit. Instead λ⇒ provides two key\nmechanisms for generic programming: 1) a type-directed resolution\nmechanism and 2) scoping constructs for rules. Implicit instantiation is then built as a convenience mechanism on top of λ⇒ by combining type-directed resolution with conventional type-inference.\nWe illustrate this on a simple, but quite expressive source language.\nThe calculus is inspired by Scala implicits and it synthesizes\ncore ideas of that mechanism formally. In particular, like Scala\nimplicits, a key idea is that resolution and implicit instantiation\nwork for any type. This allows those mechanisms to be more widely\nuseful and applicable, since they can be used with other types in\nthe language. The calculus is also closely related to System F G ,\nand like System F G , rules available in the implicit environment\nare lexically scoped and scopes can be nested.\nA novelty of our calculus is its support for partial resolution and\nhigher-order rules. Although Hinze and Peyton Jones [12] have discussed higher-order rules informally and several other researchers\nnoted their usefulness [40, 30, 28], no existing language or calculus\nprovides support for them. Higher-order rules are just the analogue\nof higher-order functions in the implicits world. They arise naturally once we take the view that resolution should work for any\ntype. Partial resolution adds additional expressive power and it is\nespecially useful in the presence of higher-order rules.\nFrom the GP perspective λ⇒ offers a new foundation for\ngeneric programming. The relation between the implicit calculus\nand Scala implicits is comparable to the relation between System\nF G and various concept proposals; or the relation between formal\ncalculi of type classes and Haskell type classes: The implicit calculus is a minimal and general model of implicits useful for language\ndesigners wishing to study and inform implementations of similar\nGP mechanisms in their own languages.\nIn summary, our contributions are as follows.\n• Our implicit calculus λ⇒ provides a simple, expressive and\n\ngeneral formal model for implicits. Despite its expressiveness,\nthe calculus is minimal and provides an ideal setting for the\nformal study of implicits and GP.\n• Of particular interest is our resolution mechanism, which is\n\nsignificantly more expressive than existing mechanisms in the\nliterature. It is based on a simple (logic-programming style)\n\n\fquery language, works for any type, and it supports partial\nresolution as well as higher-order rules.\n• The calculus has a polymorphic type system and an elaboration\n\nsemantics to System F. This also provides an effective implementation of our calculus. The elaboration semantics is proved\nto be type-preserving, ensuring the soundness of the calculus.\n• We present a small, but realistic source language, built on top\n\nof λ⇒ via a type-directed encoding. This language features\nimplicit instantiation and a simple type of interface, which\ncan be used to model simple forms of concepts. This source\nlanguage also supports higher-order rules.\n• Finally, both λ⇒ and the source language have been imple-\n\nmented and the source code for their implementation is available at http://ropas.snu.ac.kr/~ bruno/implicit.\nOrganization Section 2 presents an informal overview of our calculus. Section 3 shows a polymorphic type system that statically\nexcludes ill-behaved programs. Section 4 shows the elaboration\nsemantics of our calculus into System F and correctness results.\nSection 5 presents the source language and its encoding into λ⇒ .\nSection 6 discusses comparisons and related work. Section 7 concludes.\n\n2. Overview of the Implicit Calculus λ⇒\nOur calculus λ⇒ combines standard scoping mechanisms (abstractions and applications) and types à la System F, with a logicprogramming-style query language. At the heart of the language\nis a threefold interpretation of types:\n∼ propositions =\n∼ rules\ntypes =\nFirstly, types have their traditional meaning of classifying terms.\nSecondly, via the Curry-Howard isomorphism, types can also be\ninterpreted as propositions – in the context of GP, the type proposition denotes the availability in the implicit environment of a value\nof the corresponding type. Thirdly, a type is interpreted as a logicprogramming style rule, i.e., a Prolog rule or Horn clause [19]. Resolution [20] connects rules and propositions: it is the means to show\n(the evidence) that a proposition is entailed by a set of rules.\nNext we present the key features of λ⇒ and how these features\nare used for GP. For readability purposes we sometimes omit redundant type annotations and slightly simplify the syntax.\nFetching values by types: A central construct in λ⇒ is a query.\nQueries allow values to be fetched by type, not by name. For\nexample, in the following function call\nfoo ?Int\nthe query ?Int looks up a value of type Int in the implicit environment, to serve as an actual argument.\nConstructing values with type-directed rules: λ⇒ constructs\nvalues, using programmer-defined, type-directed rules (similar to\nfunctions). A rule (or rule abstraction) defines how to compute,\nfrom implicit arguments, a value of a particular type. For example,\nhere is a rule that computes an Int × Bool pair from implicit Int\nand Bool values:\n(|(?Int + 1, ¬ ?Bool ) : {Int , Bool } ⇒ Int ×Bool|)\nThe rule abstraction syntax resembles a type-annotated expression:\nthe expression (?Int +1, ¬ ?Bool ) to the left of the colon is the rule\nbody, and to the right is the rule type {Int , Bool } ⇒ Int ×Bool.\nA rule abstraction abstracts over a set of implicit values (here\n{Int , Bool }), or, more generally, over rules to build values.\nHence, when a value of type Int × Bool is needed (expressed\nby the query ?(Int ×Bool)), the above rule can be used, provided\n\nthat an integer and a boolean value are available in the implicit\nenvironment. In such an environment, the rule returns a pair of the\nincremented Int value and negated Bool value.\nThe implicit environment is extended through rule application\n(analogous to extending the environment with function applications). Rule application is expressed as, for example:\n(|(?Int + 1, ¬ ?Bool ) : {Int , Bool } ⇒ Int ×Bool |)\nwith {1, True }\nWith syntactic sugar similar to a let-expression, a rule abstractionapplication combination is denoted more compactly as:\nimplicit {1, True } in (?Int + 1, ¬ ?Bool )\nwhich returns (2, False).\nHigher-order rules: λ⇒ supports higher-order rules. For example, the rule\n(|?(Int ×Int) : {Int , {Int } ⇒ Int ×Int } ⇒ Int ×Int|),\nwhen applied, will compute an integer pair given an integer and\na rule to compute an integer pair from an integer. Hence, the\nfollowing rule application returns (3, 4):\nimplicit {3, (|(?Int , ?Int + 1) : {Int } ⇒ Int ×Int|)} in\n?(Int ×Int)\nRecursive resolution: Note that resolving the query ?(Int ×Int)\ninvolves applying multiple rules. The current environment does not\ncontain the required integer pair. It does however contain the integer\n3 and a rule (|(?Int , ?Int + 1) : {Int } ⇒ Int ×Int|) to compute\na pair from an integer. Hence, the query is resolved with (3, 4), the\nresult of applying the pair-producing rule to 3.\nPolymorphic rules and queries:\nFor example, the rule\n\nλ⇒ allows polymorphic rules.\n\n(|(?α, ?α) : ∀α.{α} ⇒ α×α|)\ncan be instantiated to multiple rules of monomorphic types\n{Int } ⇒ Int ×Int, {Bool } ⇒ Bool ×Bool, . . .\nMultiple monomorphic queries can be resolved by the same rule.\nThe following expression returns ((3, 3), (True, True)):\nimplicit {3, True, (|(?α, ?α) : ∀α.{α} ⇒ α×α|)} in\n(?(Int ×Int), ?(Bool ×Bool))\nPolymorphic rules can also be used to resolve polymorphic queries:\nimplicit {(|(?α, ?α) : ∀α.{α} ⇒ α×α|)} in\n?(∀α.{α} ⇒ α×α)\nCombining higher-order and polymorphic rules: The rule\n(|(?((Int ×Int)×(Int ×Int ))) : {Int , ∀α.{α} ⇒ α×α} ⇒\n(Int ×Int)×(Int ×Int)|)\nprescribes how to build a pair of integer pairs, inductively from an\ninteger value, by consecutively applying the rule of type\n∀α.{α} ⇒ α×α\ntwice: first to an integer, and again to the result (an integer pair).\nFor example, the following expression returns ((3, 3), (3, 3)):\nimplicit {3, (|(?α, ?α) : ∀α.{α} ⇒ α×α|)} in\n?((Int ×Int)×(Int ×Int))\n\n\fLocally and lexically scoped rules: Rules can be nested and resolution respects the lexical scope of rules. Consider the following\nprogram:\nimplicit {1} in\nimplicit {True, (| if ?Bool then 2 : {Bool } ⇒ Int |)}\nin ?Int\nThe query ?Int is not resolved with the integer value 1. Instead the\nrule that returns an integer from a boolean is applied to the boolean\nTrue, because those two rules can provide an integer value and\nthey are nearer to the query. So, the program returns 2 and not 1.\nOverlapping rules: Two rules overlap if their return types intersect, i.e., when they can both be used to resolve the same query.\nOverlapping rules are allowed in λ⇒ through nested scoping. The\nnearest matching rule takes priority over other matching rules. For\nexample consider the following program:\nimplicit {λx .x : ∀α.α → α} in\nimplicit {λn.n + 1 : Int → Int } in\n?(Int → Int ) 1\nIn this case λn.n + 1 : Int → Int is the lexically nearest match in\nthe implicit environment and evaluating this program results in 2.\nHowever, if we have the following program instead:\nimplicit {λn.n + 1 : Int → Int } in\nimplicit {λx .x : ∀α.α → α} in\n?(Int → Int ) 1\nThen the lexically nearest match is λx .x :∀α.α → α and evaluating\nthis program results in 1.\n\n3. The λ⇒ Calculus\nThis section formalizes the syntax and type system of λ⇒ .\n3.1 Syntax\nThis is the syntax of the calculus:\n(Simple) Types\nRule Types\nExpressions\n\nτ\nρ\ne\n\n::=\n::=\n::=\n|\n\nα | Int | τ1 → τ2 | ρ\n∀~\nα.ρ̄ ⇒ τ\nn | x | λx : τ.e | e1 e2\n?ρ | (|e : ρ|) | e[~τ ] | e with e : ρ\n\nTypes τ are either type variables α, the integer type Int , function\ntypes τ1 → τ2 or rule types ρ. A rule type ρ = ∀~\nα.ρ̄ ⇒ τ\nis a type scheme with universally quantified variables α\n~ and an\n(implicit) context ρ̄. This context summarizes the assumed implicit\nenvironment. Note that we use ~o to denote an ordered sequence\no1 , . . . , on of entities and ō to denote a set {o1 , . . . , on }. Such\nordered sequences and sets can be empty, and we often omit empty\nuniversal quantifiers and empty contexts from a rule type. The base\ncase of rule types is when ρ̄ is the empty set (∀~\nα.{} ⇒ τ ).\nExpressions include integer constants n and the three basic\ntyped λ-calculus expressions (variables, lambda binders and applications). A query ?ρ queries the implicit environment for a value of\ntype ρ. A rule abstraction (|e : ∀~\nα.ρ̄ ⇒ τ |) builds a rule whose\ntype is ∀~\nα.ρ̄ ⇒ τ and whose body is e.\nWithout loss of generality we assume that all variables x and\ntype variables α in binders are distinct. If not, they can be easily\nrenamed apart to be so.\nNote that, unlike System F, our calculus does not have a separate\nΛ binder for type variables. Instead rule abstractions play a dual\nrole in the binding structure: 1) the universal quantification of type\nvariables (which binds types), and 2) the context (which binds a\nrule set). This design choice is due to our interpretation of rules\n\nas logic programming rules3 . After all, in the matching process of\nresolution, a rule is applied as a unit. Hence, separating rules into\nmore primitive binders (à la System F's type and value binders)\nwould only complicate the definition of resolution unnecessarily.\nHowever, elimination can be modularized into two constructs: type\napplication e[τ̄ ] and rule application e with e : ρ.\nUsing rule abstractions and applications we can build the\nimplicit sugar that we have used in Sections 1 and 2.\ndef\n\nimplicit e : ρ in e1 : τ = (|e1 : ρ ⇒ τ |) with e : ρ\nFor readability purposes, when we use implicit we omit the\ntype annotation τ . As we shall see in Section 5 this annotation can\nbe automatically inferred.\nFor brevity and simplicity reasons, we have kept λ⇒ small. In\nexamples we may use additional syntax such as built-in integer\noperators and boolean literals and types.\n3.2 Type System\nFigure 1 presents the static type system of λ⇒ . The typing judgment Γ | ∆ ⊢ e : τ means that expression e has type τ under type\nenvironment Γ and implicit environment ∆. The auxiliary resolution judgment ∆ ⊢r ρ expresses that type ρ is resolvable with\nrespect to ∆. Here, Γ is the conventional type environment that\ncaptures type variables; ∆ is the implicit environment, defined as\na stack of contexts. Figure 1 also presents lookup in the implicit\nenvironment (∆hτ i) and in contexts (ρ̄hτ i).\nWe will not discuss the first four rules ((TyInt), (TyVar),\n(TyAbs) and (TyApp)) because they are entirely standard. For now\nwe also ignore the gray-shaded conditions in the other rules; they\nare explained in Section 3.3.\nRule (TyRule) checks a rule abstraction (|e : ∀~\nα.ρ̄ ⇒ τ |) by\nchecking whether the rule's body e actually has the type τ under the\nassumed implicit type context ρ̄. Rule (TyInst) instantiates a rule\ntype's type variables α\n~ with the given types ~τ , and rule (TyRApp)\ninstantiates the type context ρ̄ with expressions of the required rule\ntypes e : ρ. Finally, rule (TyQuery) delegates queries directly to the\nresolution rule (TyRes).\nResolution Principle The underlying principle of resolution in\nλ⇒ originates from resolution in logic. Following the CurryHoward correspondence, we assign to each type a corresponding\nlogical interpretation with the (*)† function:\nDefinition 3.1 (Logical Interpretation).\nα†\nInt †\n(τ1 → τ2 )†\n\n=\n=\n=\n\n(∀~\nα.ρ̄ ⇒ τ )†\n\n=\n\nα†\nInt †\nτ1† →† τ2†\n^ †\nρ ⇒ τ†\n∀~\nα† .\nρ∈ρ̄\n\nHere, type variables α map to propositional variables α† and the\nprimitive type Int maps to the propositional constant Int † . Unlike\nCurry-Howard, we do not map function types to logical implications; we deliberately restrict our implicational reasoning to rule\ntypes. So, instead we also map the function arrow to an uninterpreted higher-order predicate →† . Finally, as already indicated, we\nmap rule types to logical implications.\nResolution in λ⇒ then corresponds to checking entailment of\nthe logical interpretation. We postulate this property as a theorem\nthat constrains the design of resolution.\nTheorem 3.1 (Resolution Specification).\nIf ∆ ⊢r ρ, then ∆† |= ρ† .\n3 In\n\nProlog these are not separated either.\n\n\fΓ\n∆\n\nType Environments\nImplicit Environments\n\n::=\n::=\n\n* | Γ; x : τ\n* | ∆; ρ̄\n\nΓ|∆⊢e:τ\n(TyInt)\n\nΓ | ∆ ⊢ n : Int\n\n(TyVar)\n\n(x : τ ) ∈ Γ\nΓ|∆⊢x:τ\n\n(TyAbs)\n\nΓ; x : τ1 | ∆ ⊢ e : τ2\nΓ | ∆ ⊢ λx : τ1 .e : τ1 → τ2\n\n(TyApp)\n\nΓ | ∆ ⊢ e1 : τ2 → τ1\nΓ | ∆ ⊢ e2 : τ2\nΓ | ∆ ⊢ e1 e2 : τ1\nρ = ∀~\nα.ρ̄ ⇒ τ\n\n(TyRule)\n\nInt ; ∀α.{α} ⇒ α × α ⊢r Int × Int\n\nunambiguous(ρ)\n\nΓ | ∆; ρ̄ ⊢ e : τ α\n~ ∩ ftv (Γ, ∆) = ∅\nΓ | ∆ ⊢ (|e : ρ|) : ρ\n\n(TyInst)\n\nΓ | ∆ ⊢ e : ∀~\nα.ρ̄ ⇒ τ\nΓ | ∆ ⊢ e[~\nτ ] : [~\nα 7→ ~\nτ ](ρ̄ ⇒ τ )\n\n(TyRApp)\n\nΓ | ∆ ⊢ e : ρ̄ ⇒ τ\nΓ | ∆ ⊢ ei : ρi (∀ei : ρi ∈ e : ρ)\nΓ | ∆ ⊢ (e with e : ρ) : τ\n\n(TyQuery)\n\n∆ ⊢r ρ\n\nunambiguous(ρ)\n\nΓ | ∆ ⊢?ρ : ρ\n\n∆ ⊢r ρ\n(TyRes)\n\n∆hτ i = ρ\n\nResolution for Rule Types So far, so good. Apart from allowing\nany types, recursive querying for simple types is quite similar\nto recursive type class resolution, and λ⇒ carefully captures the\nexpected behavior. However, what is distinctly novel in λ⇒ , is that\nit also provides resolution of rule types, which requires a markedly\ndifferent treatment.\n∆hτ i = ρ̄ ⇒ τ\n(RuleRes)\n∆ ⊢r ∀~\nα.ρ̄ ⇒ τ\nHere we retrieve a whole rule from the environment, including its\ncontext. Resolution again performs a lookup based on a matching\nright-hand side τ , but subsequently also matches the context with\nthe one that is queried. No recursive resolution takes place.\nExample Consider a variant of the above query:\n\nρ̄hτ i = ρ\n\nAgain lookup yields the second rule, instantiated to {Int} ⇒\nInt × Int. The context {Int } of this rule matches the context of\nthe queried rule. Hence, the query is resolved without recursive\nresolution.\n\nno overlap(ρ̄, τ )\n\n(∆; ρ̄)hτ i = ρ\n\nρ ∈ ρ̄\n\nρ = ∀~\nα′ .ρ̄′ ⇒ τ ′\nρ̄hτ i = θ ρ̄′ ⇒ τ\n\nθτ ′ = τ\n\nFigure 1. Type System\n\nResolution for Simple Types The step from the logical interpretation to the (TyRes) rule in Figure 1 is non-trivial. So, let us first\nlook at a simpler incarnation. What does resolution look like for\nsimple types τ like Int ?\n(SimpleRes)\n\nLookup yields the second rule, which produces a tuple, instantiated\nto {Int} ⇒ Int × Int with matching substitution θ = [α 7→ Int].\nIn order to produce a tuple, the rule requires a value of the component type. Hence, resolution proceeds by recursively querying for\nInt. Now lookup yields the first rule, which produces an integer,\nwith empty matching substitution and no further requirements.\n\nInt; ∀α.{α} ⇒ α × α ⊢r {Int} ⇒ Int × Int\n∆hτ i = ρ̄′ ⇒ τ\n∆ ⊢r ρi (∀ρi ∈ ρ̄′ − ρ̄)\n∆ ⊢r ∀~\nα.ρ̄ ⇒ τ\n\nρ̄hτ i = ⊥ ∆hτ i = ρ\n(∆; ρ̄)hτ i = ρ\n\nρ̄hτ i = ρ\n\nbe instantiated to the queried τ using a matching unifier θ. This rule\ntype is then returned in instantiated form.\nThe matching expresses that the looked-up rule produces a value\nof the required type. To do so, the looked-up rule may itself require\nother implicit values. This requirement is captured in the context\nρ̄′ , which must be resolved recursively. Hence, the resolution rule\nis itself a recursive rule. When the context ρ̄′ of the looked-up rule\nis empty, a base case of the recursion has been reached.\nExample Consider this query for a tuple of integers:\n\n∆hτ i = ρ̄′ ⇒ τ\n∆ ⊢r ρi (∀ρi ∈ ρ̄′ )\n∆ ⊢r τ\n\nFirst, it looks up a matching rule type in the implicit environment by\nmeans of the lookup function ∆hτ i defined in Fig. 1. This partial\nfunction respects the nested scopes: it first looks in the topmost\ncontext of the implicit environment, and, only if it does not find a\nmatching rule, does it descend. Within an environment context, the\nlookup function looks for a rule type whose right-hand side τ ′ can\n\nUnified Resolution The feat that our actual resolution rule (TyRes)\naccomplishes is to unify these seemingly disparate forms of resolution into one single inference rule. In fact, both (SimpleRes) and\n(RuleRes) are special cases of (TyRes), which provides some additional expressiveness in the form of partial resolution (explained\nbelow).\nThe first hurdle for (TyRes) is that types τ and rule types ρ are\ndifferent syntactic categories. Judging from its definition, (TyRes)\nonly covers rule types. How do we get it to treat simple types\nthen? Just promote the simple type τ to its corresponding rule\ntype ∀.{} ⇒ τ and (TyRes) will do what we expect for simple\ntypes, including recursive resolution. At the same time, it still\nmatches proper rule types exactly, without recursion, when that is\nappropriate.\nChoosing the right treatment for the context is the second hurdle. This part is managed by recursively resolving ρ̄′ − ρ̄. In the\ncase of promoted simple types, ρ̄ is empty, and the whole of ρ̄′ is\nrecursively solved; which is exactly what we want. In the case ρ̄′\nmatches ρ̄, no recursive resolution takes place. Again this perfectly\ncorresponds to what we have set out above for proper rule types.\nHowever, there is a third case, where ρ̄′ − ρ̄ is a non-empty proper\nsubset of ρ̄′ . We call this situation, where part of the retrieved rule's\ncontext is recursively resolved and part is not, partial resolution.\nExample Here is another query variant:\nBool; ∀α.{Bool , α} ⇒ α × α ⊢r {Int} ⇒ Int × Int\nThe first lookup yields the second rule, instantiated to {Bool , Int} ⇒\nInt × Int, which almost matches the queried rule type. Only Bool\n\n\fin the context is unwelcome, so it is eliminated through a recursive resolution step. Fortunately, the first rule in the environment is\navailable for that.\n\nIf there is a quantified type variable not in type τ , the type may\nyield ambiguous instantiations (e.g. ∀α.{α} ⇒ Int).\n\nSemantic Resolution Within the confines of the semantic constraint of Theorem 3.1 the rule (TyRes) implements a rather syntactic notion of resolution. In contrast, a fully semantic definition\nof resolution would coincide exactly with the semantic constraint\nand satisfy\n\n4. Type-Directed Translation to System F\n\n∆ ⊢r ρ iff ∆† |= ρ†\nFor instance, it would allow to resolve\nChar ; Char ⇒ Int; Bool ⇒ Int ⊢r Int\nIn this example, resolution gets stuck using the topmost rule in the\nenvironment. However, by using the next one down, the query can\nbe resolved. The problem with supporting this semantic notion of\nresolution is that it requires backtracking. Because backtracking\neasily becomes a performance problem and because it is mentally\nhard to reason about for the programmer, we have decided against\nit.\nWe have considered another definition of resolution, that avoids\nbacktracking but is closer to the semantic notion:\n∆hτ i = ρ̄′ ⇒ τ\n∆, ρ̄ ⊢r ρi (∀ρi ∈ ρ̄′ )\n∆ ⊢r ∀~\nα.ρ̄ ⇒ τ\n\nHowever, we prefer our more syntactic definition of resolution,\nrule (TyRes), because it is much simpler: the environment does\nnot grow recursively, but stays the same throughout the whole\nrecursive resolution. We believe that this way it is more manageable\nfor the programmer to perform resolution mentally. Moreover, the\ninvariant environment in rule (TyRes) is much easier for deciding\ntermination.\n3.3 Additional Type System Conditions\nThe gray-shaded conditions in the type system are to check lookup\nerrors (no overlap) and ambiguous instantiations (unambiguous).\nTo prevent lookup failures, we have to\n\n• A lookup has no matching rule in the environment.\n• A lookup has multiple matching rules which have different rule\n\ntypes but can yield values of the same type (overlapping rules).\nThe former condition is directly captured in the definition of lookup\namong a set of rule types. The latter condition is captured in the\nno overlap property, which is defined as:\ndef\n\n∧\n∧\n\nFigure 2 presents the translation rules that convert λ⇒ expressions\ninto ones of System F extended with the integer and unit types. This\nfigure essentially extends Figure 1 with the necessary information\nfor the translation, but for readability we have omitted the earlier\ngray-shaded conditions.\nThe syntax of System F is as follows:\nTypes\nExpressions\n\nT\nE\n\n::=\n::=\n\nα | T → T | ∀α.T | Int | ()\nx | λ(x : T ).E | E E | Λα.E | E T | n | ()\n\nΓ | ∆ ⊢ e : τ ; E,\n\nChar ; Char ⇒ Int; Bool ⇒ Int ⊢r Char ⇒ Int\n\nno overlap({ρ1 , . . . , ρn }, τ ) =\n∀i, j.\nρi = ∀α~i .ρ̄i ⇒ τi\n∧\nρj = ∀α~j .ρ̄j ⇒ τj\n=⇒ i = j\n\n4.1 Type-Directed Translation\n\nThe main translation judgment is\n\nThis rule extends the environment ∆ with the queried rule type's\ncontext ρ̄ for recursive resolution of the matching rule type's context ρ̄′ . It resolves the following query that rule (TyRes) does not:\n\nAvoiding Lookup Errors\ncheck for two situations:\n\nIn this section we define the dynamic semantics of λ⇒ in terms of\nSystem F's dynamic semantics, by means of a type directed translation. This translation turns implicit contexts into explicit parameters and statically resolves all queries, much like Wadler and Blott's\ndictionary passing translation for type classes [42]. The advantage\nof this approach is that we simultaneously provide a meaning to\nwell-typed λ⇒ programs and an effective implementation that resolves all queries statically.\n\n∃θi .θi τi = τ\n∃θj .θj τj = τ\n\nwhich states that the translation of λ⇒ expression e with type τ\nis System F expression E, with respect to type environment Γ and\ntranslation environment ∆. The translation environment ∆ relates\neach rule type in the earlier implicit environment to a System F\nvariable x; this variable serves as value-level explicit evidence for\nthe implicit rule. Lookup in the translation environment is defined\nsimilarly to lookup in the type environment, except that the lookup\nnow returns a pair of a rule type and an evidence variable.\nFigure 2 also defines the type translation function | * | from λ⇒\ntypes τ to System F types T. In order to obtain a unique translation\nof types, we assume that the types in a context are lexicographically\nordered.\nVariables, lambda abstractions and applications are translated\nstraightforwardly. Queries are translated by rule (TrQuery) using\nthe auxiliary resolution judgment ⊢r , defined by rule (TrRes). Note\nthat rule (TrRes) performs the same process that rule (TyRes)\nperforms in the type system except that it additionally collects\nevidence variables.\nRule (TrRule) translates rule abstractions to explicit type and\nvalue abstractions in System F, and rule (TrInst) translates instantiation to type application. Finally, rule (TrRApp) translates rule\napplication to application in System F.\nExample We have that:\n* | * ⊢ (|(?α, ?α) : ∀α.{α} ⇒ α × α|)\n; Λα.λ(x : α).(x, x)\nand also:\n(Int : x1 ), (∀α.{α} ⇒ α × α : x2 ) ⊢r Int × Int\n; x2 Int x1\n\nAvoiding Ambiguous Instantiations We avoid ambiguous instantiations in the same way as Haskell does: all quantified type variables (~\nα) in a rule type (∀~\nα.ρ̄ ⇒ τ ) must occur in τ . We use the\nunambiguous condition to check in (TyRule) and (TyQuery):\n\nFor brevity, Figure 2 omits the case where the context of a rule type\nis empty. To properly handle empty contexts, the translation of rule\ntype should include |{} ⇒ τ | = () → |τ | and the translation\nrules (TrRule), (TrRApp) and (TrRes) should be extended in the\nobvious way.\n\nunambiguous(∀~\nα.ρ̄ ⇒ τ ) = α\n~ ⊆ ftv (τ )\n∧ ∀ρi ∈ ρ̄.unambiguous(ρi ).\n\nTheorem 4.1 (Type-preserving translation). Let e be a λ⇒ expression, τ be a type and E be a System F expression. If * | * ⊢ e : τ ;\nE, then * ⊢ E : |τ |.\n\n\finterface Eq α = {eq : α → α → Bool }\nType Environments\nTranslation Environments\n\nΓ\n∆\n\n::=\n::=\n\nlet (≡) : ∀α. {Eq α} ⇒ α → α → Bool = eq ? in\nlet eqInt1 : Eq Int = Eq {eq = primEqInt } in\nlet eqInt2 : Eq Int = Eq {eq = λx y.isEven x ∧ isEven y } in\nlet eqBool : Eq Bool = Eq {eq = primEqBool } in\nlet eqPair : ∀α β. {Eq α, Eq β } ⇒ Eq (α, β) =\nEq {eq = λx y.fst x ≡ fst y ∧ snd x ≡ snd y } in\nlet p1 : (Int , Bool ) = (4, True) in\nlet p2 : (Int , Bool ) = (8, True) in\nimplicit {eqInt1 , eqBool , eqPair } in\n\n* | Γ; x : τ\n* | ∆; ρ : x\n\nΓ|∆⊢e:τ ;E\n(TrInt)\n\nΓ | ∆ ⊢ n : Int ; n\n\n(TrVar)\n\n(x : τ ) ∈ Γ\nΓ|∆⊢x:τ ;x\n\n(TrAbs)\n\nΓ; x : τ1 | ∆ ⊢ e : τ2 ; E\nΓ | ∆ ⊢ λx : τ1 .e : τ1 → τ2 ; λx : |τ1 |.E\n\nFigure 3. Encoding the Equality Type Class\n\n(TrApp)\n\nΓ | ∆ ⊢ e1 : τ2 → τ1 ; E1\nΓ | ∆ ⊢ e2 : τ2 ; E2\nΓ | ∆ ⊢ e1 e2 : τ1 ; E1 E2\n\nProof. (Sketch) We first prove4 the more general lemma \"if Γ |\n∆ ⊢ e : τ ; E, then |Γ|, |∆| ⊢ E : |τ |\" by induction on the\nderivation of translation. Then, the theorem is trivially proved by\nit.\n\n(TrQuery)\n\n∆ ⊢r ρ ; E\nΓ | ∆ ⊢?ρ : ρ ; E\n\n(TrRule)\n\nρ = ∀~\nα.ρ̄ ⇒ τ α\n~ ∩ ftv (Γ, ∆) = ∅\nΓ | ∆; ρ : x ⊢ e : τ ; E\nx̄ fresh\nΓ | ∆ ⊢ (|e : ρ|) : ρ ; Λ~\nα.λ(~\nx : |~\nρ|).E\n\n(p1 ≡ p2 , implicit {eqInt2 } in p1 ≡ p2 )\n\n4.2 Dynamic Semantics\nFinally, we define the dynamic semantics of λ⇒ as the composition\nof the type-directed translation and System F's dynamic semantics.\nFollowing Siek's notation [34], this dynamic semantics is:\neval (e) = V\n\nwhere * | * ⊢ e : τ ; E and E →∗ V\n\n(TrInst)\n\nΓ | ∆ ⊢ e : ∀~\nα.ρ̄ ⇒ τ ; E\nΓ | ∆ ⊢ e[~\nτ ] : [~\nα 7→ ~\nτ ](ρ̄ ⇒ τ ) ; E |~\nτ|\n\nwith →∗ the reflexive, transitive closure of System F's standard\nsingle-step call-by-value reduction relation.\nNow we can state the conventional type safety theorem for λ⇒ :\n\n(TrRApp)\n\nΓ | ∆ ⊢ e : ρ̄ ⇒ τ ; E\nΓ | ∆ ⊢ ei : ρi ; Ei (∀ei : ρi ∈ e : ρ)\n~\nΓ | ∆ ⊢ (e with e : ρ) : τ ; E E\n\nTheorem 4.2 (Type Safety). If * | * ⊢ e : τ , then eval (e) = V for\nsome System F value V .\n\n∆ ⊢r ρ ; E\n\n5. Source Languages and Implicit Instantiation\n∆(τ ) (\n= ρ̄′ ⇒ τ : E\nx̄ fresh\n∆\n⊢\nρ\n;\nE\n, ρi 6∈ ρ̄\nr\ni\ni\n∀ρi ∈ ρ̄′ :\nEi = xi\n, ρi ∈ ρ̄\n~\n∆ ⊢r ∀~\nα.ρ̄ ⇒ τ ; Λ~\nα.λ(~\nx : |~\nρ|).(E E)\n\n(TrRes)\n\nThe proof follows trivially from Theorem 4.1.\n\n∆hτ i = ρ : E\n\nρ : xhτ i = ρ : E\n(∆; ρ : x)hτ i = ρ : E\nρ : xhτ i = ⊥ ∆hτ i = ρ\n(∆; ρ : x)hτ i = ρ\n\nρ : xhτ i = ρ : E\n\n(ρ : x) ∈ ρ : x\nρ = ∀~\nα′ .ρ̄′ ⇒ τ ′\nθτ ′ = τ\nθ = [~\nα′ 7→ ~\nτ]\nρ : xhτ i = θ ρ̄′ ⇒ τ : x |~\nτ|\n\n|α|\n|Int|\n\n=\n=\n\nα\nInt\n\n|τ1 → τ2 |\n\n=\n\n|τ1 | → |τ2 |\n\n|∀~\nα.{ρ1 , * * * , ρn } ⇒ τ |\n|Γ|\n\n=\n=\n\n∀~\nα.|ρ1 | → * * * → |ρn | → |τ |\n{(x : |τ |) | (x : τ ) ∈ Γ}\n\n|∆|\n\n=\n\n{(x : |ρ|) | (ρ : x) ∈ ∆}\n\nFigure 2. Type-directed Translation to System F\n\nLanguages like Haskell and Scala provide a lot more programmer\nconvenience than λ⇒ (which is a low level core language) because\nof higher-level GP constructs, interfaces and implicit instantiation.\nThis section illustrates how to build a simple source language on\ntop of λ⇒ to add the expected convenience. We should note that\nunlike Haskell this language supports local and nested scoping, and\nunlike both Haskell and Scala it supports higher-order rules. We\npresent the type-directed translation from the source to λ⇒ .\n5.1 Type-directed Translation to λ⇒\nThe full syntax is presented in Figure 4. Its use is illustrated in\nthe program of Figure 3, which comprises an encoding of Haskell's\nequality type class Eq. The example shows that the source language\nfeatures a simple type of interface I T~ (basically records), which\nare used to encode simple forms of type classes. Note that we\nfollow Haskell's conventions for records: field names u are unique\nand they are modeled as regular functions taking a record as the\nfirst argument. So a field u with type T in an interface declaration\nI α\n~ actually has type ∀ᾱ.{} ⇒ I α\n~ → T . There are also other\nconventional programming constructs (such as let expressions,\nlambdas and primitive types).\nUnlike the core language, we strongly differentiate between\nsimple types T and type schemes σ in order to facilitate type inference. Moreover, as the source language provides implicit rather\nthan explicit type instantiation, the order of type variables in a\nquantifier is no longer relevant. Hence, they are represented by a set\n4 in\n\nthe extra material of the submission\n\n\fTypes\nT ::=\n|\n|\n|\nσ ::=\n\nα\nInt\nI T~\nT →T\n∀α. σ ⇒ T\n\n::=\n\nG\n\nType Environments\n\nInterface Declarations\ninterface I α\n~ = u:T\n\n* | G, u : σ | G, x : T\n\nG⊢E:T ;e\nType Variables\nInteger Type\nInterface Type\nFunction\nRule Type\n\nExpressions\nE ::= n\n| x\n| λx.E\n| E1 E2\n| u\n| let u : σ = E1 in E2\n| implicit u in E2\n| ?\n| Iu=E\n\nInteger Literal\nLambda Variable\nAbstraction\nApplication\nLet Variable\nLet\nImplicit Scoping\nImplicit Lookup\nInterface Implementation\n\n(TyIntL)\n\nG ⊢ n : Int ; n\n\n(TyVar)\n\nG(x) = T\nG⊢x:T ;x\n\n(TyAbs)\n\nG, x : T1 ⊢ E ; e\nG ⊢ λx.E : T1 → T2 ; λx : JT1 K.e\n\n(TyApp)\n\nG ⊢ E1 : T1 → T2 ; e1\nG ⊢ E2 : T1 ; e2\nG ⊢ E1 E2 : T2 ; e1 e2\n\n(TyLVar)\n\nG(u) = ∀α. σ ⇒ T ′\nθ = [α 7→ T ] T = θT ′\nqi = (?Jθσi K) : Jθσi K (∀σi ∈ σ)\nG ⊢ u : T ; u[JT~ K] with q\n\n(TyLet)\n\nσ = ∀α.σ ⇒ T1\nG ⊢ E1 : T1 ; e1\nG, u : σ ⊢ E2 : T2 ; e2\nG ⊢ let u : σ = E1 in E2 : T2 ;\n(λu : JσK.e2 ) (|e1 : JσK|)\n\n(TyImp)\n\nG⊢E:T ;e\nG(ui ) = σi qi = ui : Jσi K (∀ui ∈ u)\nG ⊢ implicit u in E : T ;\n(|e : JσK ⇒ JT K|) with q\n\n(TyIVar)\n\nG ⊢? : T ; ?({} ⇒ JT K) with {}\n\nFigure 4. Syntax of Source Language\n\n(∀ᾱ). We also distinguish simply typed variables x from let-bound\nvariables u with polymorphic type σ.\nFigure 5 presents the type-directed translation G ⊢ E : T ; e\nof source language expressions E of type T to core expressions e,\nwith respect to type environment G. The type environment collects\nboth simply and polymorphic variable typings. The connection\nbetween source types T and σ on the one hand and core types τ\nand ρ on the other hand is captured in the auxiliary function J*K.\nNote that this function imposes a canonical ordering α\n~ on the set of\nquantifier variables ᾱ (based on their precedence in the left-to-right\nprefix traversal of the quantified type term). For the translation of\nrecords, we assume that λ⇒ is extended likewise with records.\nlet and let-bound variables The rule (TyLet) in Figure 5 shows\nthe type-directed translation for let expressions. This translation\nbinds the variable u using a regular lambda abstraction in an expression e2 , which is the result of the translation of the body of the\nlet construct (E2 ). Then it applies that abstraction to a rule whose\nrule type is just the corresponding (translated) type of the definition\n(σ1 ), and whose body is the translation of the expression E1 .\nThe source language provides convenience to the user by inferring type arguments and implicit values automatically. This inference happens in rule (TyLVar), i.e., the use of let-bound variables.\nThat rule recovers the type scheme of variable u from the environment G. Then it instantiates the type scheme and fires the necessary\nqueries to resolve the context.\nQueries The source language also includes a query operator (?).\nUnlike λ⇒ this query operator does not explicitly state the type;\nthat information is provided implicitly through type inference. For\nexample, instead of using p1 ≡ p2 in Figure 5, we could have\ndirectly used the field eq as follows:\neq ? p1 p2\nWhen used in this way, the query acts like a Coq placeholder ( ),\nwhich similarly instructs Coq to automatically infer a value.\nThe translation of source language queries, given by the rule\n(TyIVar), is fairly straightforward. To simplify type-inference, the\nquery is limited to types, and does not support partial resolution (although other designs with more powerful queries are possible). In\nthe translated code the query is combined with a rule instantiation\nand application in order to eliminate the empty rule set.\n\n(TyRec)\n\n∀i :\n\n(\n\nG(ui ) = ∀ᾱ.{} ⇒ I α\n~ → Ti\nG ⊢ Ei : θTi ; e θ = [~\nα 7→ T~ ]\n~\nG⊢Iu=E:IT ;Iu=e\n\nJαK\nJInt K\nJT1 → T2 K\nJI T~ K\nJ∀α.σ ⇒ T K\n\n=\n=\n=\n=\n=\n\nα\nInt\nJT1 K → JT2 K\nI JT~ K\n∀J~\nαK.JσK ⇒ JT K\n\nFigure 5. Type-directed Encoding of Source Language in λ⇒\nImplicit scoping The implicit construct, which has been already informally introduced in Section 1, is the core scoping construct of the source language. It is used in our example to first introduce definitions in the implicit environment (eqInt1 , eqBool and\neqPair ) available at the expression\n(p1 ≡ p2 , implicit {eqInt2 } in p1 ≡ p2 )\nWithin this expression there is a second occurrence of implicit,\nwhich introduces an overlapping rule (eqInt2 ) that takes priority\nover eqInt1 for the subexpression p1 ≡ p2 .\nThe translation rule (TyImp) of implicit into λ⇒ also exploits\ntype-information to avoid redundant type annotations. For example,\nit is not necessary to annotate the let-bound variables used in\nthe rule set u because that information can be recovered from the\nenvironment G.\nHigher-order rules and implicit instantiation for any type The\nfollowing example illustrates higher-order rules and implicit instantiation working for any type in the source language.\n\n\flet show : ∀α. {α → String } ⇒ α → String = ? in\nlet showInt : Int → String = . . . in\nlet comma : ∀α. {α → String } ⇒ [α] → String = . . . in\nlet space : ∀α. {α → String } ⇒ [α] → String = . . . in\nlet o : {Int → String, {Int → String } ⇒ [Int ] → String }\n⇒ String = show [1, 2, 3] in\nimplicit showInt in\n(implicit comma in o, implicit space in o)\nFor brevity, we have omitted the implementations of showInt ,\ncomma and space; but showInt renders an Int as a String\nin the conventional way, while comma and space provide two\nways for rendering lists. Evaluation of the expression yields\n(\"1,2,3\", \"1 2 3\"). Thanks to the implicit rule parameters, the\ncontexts of the two calls to o control how the lists are rendered.\nThis example differs from that in Figure 3 in that instead of\nusing a nominal interface type like Eq, it uses standard functions\nto model a simple concept for pretty printing values. The use of\nfunctions as implicit values leads to a programming style akin to\nstructural matching of concepts, since only the type of the function\nmatters for resolution.\n5.2 Extensions\nThe goal of our work is to present a minimal and general framework\nfor implicits. As such we have avoided making assumptions about\nextensions that would be useful for some languages, but not others.\nIn this section we briefly discuss some extensions that would be\nuseful in the context of particular languages and the implications\nthat they would have in our framework.\nFull-blown Concepts The most noticeable feature that was not\ndiscussed is a full-blown notion of concepts. One reason not to\ncommit to a particular notion of concepts is that there is no general\nagreement on what the right notion of concepts is. For example,\nfollowing Haskell type classes, the C++0x concept proposal [11]\nis based on a nominal approach with explicit concept refinement,\nwhile Stroustrup favors a structural approach with implicit concept\nrefinement because that would be more familiar to C++ programmers [37]. Moreover, various other proposals for GP mechanisms\nhave their own notion of interface: Scala uses standard OO hierarchies; Dreyer et al. use ML-modules [8]; and in dependently typed\nsystems (dependent) record types are used [36, 5].\nAn advantage of λ⇒ is that no particular notion of interface is\nimposed on source language designers. Instead, language designers are free to use the one they prefer. In our source language, for\nsimplicity, we opted to add a very simple (and limited) type of interface. But existing language designs [29, 8, 36, 5] offer evidence\nthat more sophisticated types of interfaces, including some form of\nrefinement or associated types, can be built on top of λ⇒ .\nType Constructor Polymorphism and Higher-order Rules Type\nconstructor polymorphism is an advanced, but highly powerful GP\nfeature available in Haskell and Scala, among others. It allows\nabstracting container types like List and Tree with a type variable\nf ; and applying the abstracted container type to different element\ntypes, e.g., f Int and f Bool .\nThis type constructor polymorhism leads to a need for higherorder rules: rules for containers of elements that depend on rules for\nthe elements. The instance for showing values of type Perfect f α\nin Section 1, is a typical example of this need.\nExtending λ⇒ with type constructor polymorphism is not hard.\nBasically, we need to add a kind system and move from a System F\nlike language to System Fω like language.\nSubtyping Languages like Scala or C++ have subtyping. Subtyping would require significant adaptations to λ⇒ . Essentially, instead of targetting System F, we would have to target a version of\n\nSystem F with subtyping. In addition, the notion of matching in the\nlookup function ∆hτ i would have to be adjusted, as well as the\nno overlap condition. While subtyping is a useful feature, some\nlanguage designs do not support it because it makes the system\nmore complex and interferes with type-inference.\nType-inference Languages without subtyping (like Haskell or\nML) make it easier to support better type-inference. Since we\ndo not use subtyping, it is possible to improve support for typeinference in our source language. In particular, we currently require\na type annotation for let expressions, but it should be possible to\nmake that annotation optional, by building on existing work for the\nGHC Haskell compiler [32, 41].\n\n6. Related Work\nThroughout the paper we have already discussed a lot of related\nwork. In what follows, we offer a more detailed technical comparison of λ⇒ versus System F G and Scala implicits, which are the\nclosest to our work. Then we discuss the relation with other work\nin the literature.\nSystem F G Generally speaking our calculus is more primitive\nand general than System F G . In contrast to λ⇒ , System F G has\nboth a notion of concepts and implicit instantiation of concepts5 .\nThis has the advantage that language designers can just reuse that\ninfrastructure, instead of having to implement it. The language\nG [35] is based on System F G and it makes good use of these\nbuilt-in mechanisms. However, System F G also imposes important design choices. Firstly it forces the language designer to use\nthe notion of concepts that is built-in to System F G . In contrast λ⇒\noffers a freedom of choice (see also the discussion in Section 5.2).\nSecondly, fixing implicit instantiation in the core prevents useful alternatives. For example, Scala and several other systems do provide\nimplicit instantiation by default, but also offer the option of explicit\ninstantiation, which is useful to resolve ambiguities [29, 18, 6, 8].\nThis cannot be modeled on top of System F G , because explicit\ninstantiation is not available. In contrast, by taking explicit instantiation (rule application) as a core feature, λ⇒ can serve as a target\nfor languages that offer both styles of instantiation.\nThere are also important differences in terms of scoping and\nresolution of rules. System F G only formalizes a very simple\ntype of resolution, which does not support recursive resolution.\nFurthermore, scoping is less fine-grained than in λ⇒ . For example,\nSystem F G requires a built-in construct for model expressions,\nbut in λ⇒ implicit (which plays a similar role) is just syntactic\nsugar on top of more primitive constructs.\nScala Implicits Scala implicits are integrated in a full-blown language, but they have only been informally described in the literature [29, 27]. Our calculus aims at providing a formal model of\nimplicits, but there are some noteworthy differences between λ⇒\nand Scala implicits. In contrast to λ⇒ , Scala has subtyping. As discussed in Section 5.2 subtyping would require some adaptations to\nour calculus. In Scala, nested scoping can only happen through subclassing and the rules for resolution in the presence of overlapping\ninstances are quite ad-hoc. Furthermore, Scala has no (first-class)\nrule abstractions. Rather, implicit arguments can only be used in\ndefinitions. In contrast λ⇒ provides a more general and disciplined\naccount of scoping for rules.\nType Classes Obviously, the original work on type classes [42]\nand the framework of qualified types [15] around it has greatly\ninfluenced our own work, as well as that of System FG and Scala.\n5 Note\n\nthat instantiation of type variables is still explicit.\n\n\fThere is a lot of work on Haskell type classes in the literature.\nNotably, there have been some proposals for addressing the limitations that arise from global scoping [18, 6]. However in those designs, type classes are still second-class and resolution only works\nfor type classes. The GHC Haskell compiler supports overlapping\ninstances [17], that live in the same global scope. This allows some\nrelief for the lack of local scoping. A lot of recent work on type\nclasses is focused on increasingly more powerful \"type class\" interfaces. Functional dependencies [16], associated types [4, 3] and\ntype families [31] are all examples of this trend. This line of work\nis orthogonal to our work.\nOther Languages and Systems Modular type classes [8] are a\nlanguage design that uses ML-modules to model type classes. The\nmain novelty of this design is that, in addition to explicit instantiation of modules, implicit instantiation is also supported. In contrast\nto λ⇒ , implicit instantiation is limited to modules and, although\nlocal scoping is allowed, it cannot be nested.\nInstance arguments [5] are an Agda extension that is closely related to implicits. However, unlike most GP mechanisms, implicit\nrules are not declared explicitly. Furthermore resolution is limited\nin its expressive power, to avoid introducing a different computational model in Agda. This design differs significantly from λ⇒ ,\nwhere resolution is very expressive and the scoping mechanisms\nallow explicit rule declarations.\nImplicit parameters [22] are a Haskell extension that allows\nnamed arguments to be passed implicitly. Implicit parameters are\nresolved by name, not by type and there is no recursive resolution.\nGP and Logic Programming The connection between Haskell\ntype classes and Prolog is folklore. Neubauer et. al. [25] also\nexplore the connection with Functional Logic Programming and\nconsider different evaluation strategies to deal with overlapping\nrules. With Constraint Handling Rules, Stuckey and Sulzmann [38]\nuse Constraint Logic Programming to implement type classes.\n\n7. Conclusion\nOur main contribution is the development of the implicit calculus\nλ⇒ . This calculus isolates and formalizes the key ideas of Scala\nimplicits and provides a simple model for language designers interested in developing similar mechanisms for their own languages.\nIn addition, λ⇒ supports higher-order rules and partial resolution,\nwhich add considerable expressiveness to the calculus.\nImplicits provide an interesting alternative to conventional GP\nmechanisms like type classes or concepts. By decoupling resolution\nfrom a particular type of interfaces, implicits make resolution more\npowerful and general. Furthermore, this decoupling has other benefits too. For example, by modeling concept interfaces as conventional types, those interfaces can be abstracted as any other types,\navoiding the issue of second class interfaces that arise with type\nclasses or concepts.\nUltimately, all the expressiveness offered by λ⇒ offers a widerange of possibilities for new generic programming applications.\nAcknowledgements We are grateful to Ben Delaware, Derek\nDreyer, Jeremy Gibbons, Scott Kilpatrick, Phil Wadler, Beta Ziliani, the member of ROPAS and the anonymous reviewers for their\ncomments and suggestions. This work was partially supported by\nthe Engineering Research Center of Excellence Program of Korea Ministry of Education, Science and Technology (MEST) /\nKorea Science and Engineering Foundation (KOSEF) grant R112008-007-01002-0 and the Mid-career Researcher Program (20100022061) through NRF grant funded by the MEST. This work\nwas also partially supported by Singapore Ministry of Education\nresearch grant MOE2010-T2-2-073.\n\nReferences\n[1] The Boost C++ libraries. http://www.boost.org/, 2010.\n[2] C. Camarão and L. Figueiredo. Type inference for overloading\nwithout restrictions, declarations or annotations. In FLOPS, 1999.\n[3] M. Chakravarty, G. Keller, and S. L. Peyton Jones. Associated type\nsynonyms. In ICFP, 2005.\n[4] M. Chakravarty, G. Keller, S. L. Peyton Jones, and S. Marlow.\nAssociated types with class. In POPL, 2005.\n[5] D. Devriese and F. Piessens. On the bright side of type classes:\nInstance arguments in agda. In ICFP, 2011.\n[6] A. Dijkstra and S. D. Swierstra. Making implicit parameters explicit.\nTechnical report, Utrecht University, 2005.\n[7] G. Dos Reis and B. Stroustrup. Specifying C++ concepts. In POPL\n'06, pages 295–308, 2006.\n[8] D. Dreyer, R. Harper, M. Chakravarty, and G. Keller. Modular type\nclasses. In POPL, 2007.\n[9] R. Garcia, J. Jarvi, A. Lumsdaine, Jeremy Siek, and J. Willcock. A\ncomparative study of language support for generic programming. In\nOOPSLA, 2003.\n[10] J. Gibbons. Patterns in datatype-generic programming. In The Fun of\nProgramming, Cornerstones in Computing. Palgrave, 2003.\n[11] D. Gregor, J. Järvi, J. G. Siek, B. Stroustrup, G. Dos Reis, and\nA. Lumsdaine. Concepts: linguistic support for generic programming\nin c++. In OOPSLA, 2006.\n[12] R. Hinze and S. L. Peyton Jones. Derivable type classes. Electronic\nNotes in Theoretical Computer Science, 41(1):5 – 35, 2001.\n[13] J. Hughes. Restricted data types in Haskell. In Haskell, 1999.\n[14] P. Jansson and J. Jeuring. Polytypic programming. In AFP. SpringerVerlag, 1996.\n[15] M. P. Jones. Simplifying and improving qualified types. In FPCA,\n1995.\n[16] M. P. Jones. Type classes with functional dependencies. In ESOP,\n2000.\n[17] S. L. Peyton Jones, M. P. Jones, and E. Meijer. Type classes: exploring\nthe design space. In Haskell Workshop, 1997.\n[18] W. Kahl and J. Scheffczyk. Named instances for Haskell type classes.\nIn Haskell Workshop, 2001.\n[19] R. Kowalski. Predicate logic as a programming language. In\nProceedings of IFIP Congress, 1974.\n[20] R. Kowalski, Donald, and Kuehner. Linear resolution with selection\nfunction. Artificial Intelligence, 2, 1971.\n[21] R. Lämmel and S. L. Peyton Jones. Scrap your boilerplate with class:\nextensible generic functions. In ICFP, 2005.\n[22] J. Lewis, J. Launchbury, E. Meijer, and M. Shields. Implicit\nparameters: dynamic scoping with static types. In POPL, 2000.\n[23] D. Musser and A. Stepanov. Generic programming. In Symbolic and\nalgebraic computation: ISSAC 88, pages 13–25. Springer, 1988.\n[24] D. R. Musser and A. Saini. The STL Tutorial and Reference Guide:\nC++ Programming with the Standard Template Library. Addison\nWesley Longman Publishing Co., Inc., 1995.\n[25] M. Neubauer, P. Thiemann, M. Gasbichler, and M. Sperber.\nFunctional logic overloading. In POPL, 2002.\n\n[26] M. Odersky. Poor man's type classes. http://lamp.epfl.ch/~ odersky/talks/wg2\nJuly 2006.\n[27] M. Odersky. The Scala language specification, version 2.8, 2010.\n[28] B. C. d. S. Oliveira and J. Gibbons. Scala for generic programmers.\nJournal of Functional Programming, 20, 2010.\n[29] B. C. d. S. Oliveira, A. Moors, and M. Odersky. Type classes as\nobjects and implicits. In OOPSLA, 2010.\n\n\f[30] A. Rodriguez, J. Jeuring, P. Jansson, A. Gerdes, O. Kiselyov, and\nB. C. d. S. Oliveira. Comparing libraries for generic programming in\nhaskell. In Haskell, 2008.\n[31] T. Schrijvers, S. L. Peyton Jones, M. Chakravarty, and M. Sulzmann.\nType checking with open type functions. In ICFP, 2008.\n[32] T. Schrijvers, S. L. Peyton Jones, M. Sulzmann, and D. Vytiniotis.\nComplete and decidable type inference for GADTs. In ICFP, 2009.\n\nA. Termination of Resolution\nIf we are not careful about which rules are made implicit, the recursive resolution process may not terminate. This section describes\nhow to impose a set of modular syntactic restrictions that prevents\nnon-termination.\nAs an example of non-termination consider\n{{Char } ⇒ Int, {Int } ⇒ Char } ⊢r Int\n\n[33] J. Siek. The C++0x Concepts Effort. http://ecee.colorado.edu/~ siek/concepts_effort.pdf ,\n2011.\nwhich loops, using alternatively the first and second rule in the\nimplicit environment.\n[34] J. G. Siek and A. Lumsdaine. Essential language support for generic\nThe problem of non-termination has been widely studied in the\nprogramming. In PLDI, 2005.\n[35] J. G. Siek and A. Lumsdaine. A language for generic programming\nin the large. Science of Computer Programming, 76(5), 2011.\n[36] M. Sozeau and N. Oury. First-class type classes. In TPHOLs, 2008.\n[37] B. Stroustrup. Simplifying the use of concepts. Technical report,\nTechnical Report N2906, ISO/IEC JTC 1 SC22 WG21, 2009.\n[38] P. J. Stuckey and M. Sulzmann. A theory of overloading. In ICFP,\n2002.\n[39] M. Sulzmann, G. Duck, S. L. Peyton Jones, and P. J. Stuckey.\nUnderstanding functional dependencies via Constraint Handling\nRules. Journal of Functional Programming, 17, 2007.\n\ncontext of Haskell's type classes, and a set of modular syntactic\nrestrictions has been imposed on type class instances to avoid nontermination [39]. Adapting these restrictions to our setting, we\nobtain the following termination condition.\nDefinition A.1 (Termination Condition). An implicit environment\n∆ satisfies the condition, denoted term(∆), iff term(ρ) for every\nρ = (∀~\nα.ρ̄ ⇒ τ ) ∈ dom(∆), where:\nterm(ρ)\n\n[40] V. Trifonov. Simulating quantified class constraints. In Haskell, 2003.\n[41] D. Vytiniotis, S. L. Peyton Jones, T. Schrijvers, and M. Sulzmann.\nO UTSIDE I N(x): Modular type inference with local assumptions.\nJournal of Functional Programming, 21(4–5):333–412, 2011.\n[42] P. L. Wadler and S. Blott. How to make ad-hoc polymorphism less ad\nhoc. In POPL, 1989.\n\ndef\n\n⇔\n\nocc α (τ ′ ) 6 occ α (τ )\n~′ .ρ̄′ ⇒ τ ′ ) ∈ ρ̄, ∀α ∈ ftv (τ, τi )) \\ α\n(∀(∀α\n~ ′)\n\n∧\n∧\n\n|τi | < |τ | (∀τi ∈ ρ̄)\nterm(ρ′ ) (∀ρ′ ∈ ρ̄)\n\nwhere\nocc α (Int )\nocc α (α)\nocc α (α′ )\nocc α (τ1 → τ2 )\n\n=\n=\n=\n=\n\nocc α (∀~\nα.ρ̄ ⇒ τ )\n\n=\n\n|Int|\n|α|\n|τ1 → τ2 |\n\n=\n=\n=\n\n|∀~\nα.ρ̄ ⇒ τ |\n\n=\n\n0\n1\n0\n(α 6= α′ )\nocc α (τ1 ) + occ α (τ2 )\nX\nocc α (ρ)\nocc α (τ ) +\nρ∈ρ̄\n\n1\n1\n1 + |τ1 | + |τ2 |\nX\n|ρ|.\n1 + |τ | +\nρ∈ρ̄\n\nB. Proofs\nThroughout the proofs we refer to the type system rules of System\nF listed in Figure 6.\nLemma B.1. If\nΓ|∆ ⊢ e : τ ; E\nthen\n|Γ|, |∆| ⊢ E : |τ |\nProof. By structural induction on the expression and corresponding\ninference rule.\n(TrInt)\n\nΓ|∆ ⊢ n : Int ; n\n\nIt follows trivially from (F-Int) that\n|Γ|, |∆| ⊢ n : Int\n\n(TrVar)\n\nΓ|∆ ⊢ x : τ ; x\n\n\f(F-Int)\n\nΓ ⊢ n : Int\n\n(F-Var)\n\n(x : T ) ∈ Γ\nΓ⊢x:T\n\n(F-Abs)\n\nΓ, x : T1 ⊢ E : T2\nΓ ⊢ λx : T1 .E : T1 → T2\n\n(F-App)\n\nΓ ⊢ E 1 : T2 → T1\nΓ ⊢ E 2 : T2\nΓ ⊢ E 1 E 2 : T1\n\n(F-TApp)\n\nΓ ⊢ E : ∀α.T2\nΓ ⊢ E T1 : [α 7→ T1 ]T2\n\n(TrQuery)\n\nΓ|∆ ⊢?ρ : ρ ; E\n\nFrom (TrQuery) we have\n∆⊢ρ;E\nBased on Lemma B.2 we then know\n|∆| ⊢ E : |ρ|\nHence, because all variables are unique\n\n(F-TAbs)\n\nΓ ⊢ E : T α 6∈ ftv (Γ)\nΓ ⊢ Λα.E : ∀α.T\n\nFigure 6. System F Type System\n\n|Γ|, |∆| ⊢ E : |ρ|\n\n(TrRule)\n\nΓ|∆ ⊢ (|e : ρ|) : ρ ; Λ~\nα.λ(~x : |~\nρ|).E\n\nBased on (TrRule) and the induction hypothesis, we have\n|Γ|, |∆|, ~x : |~\nρ| ⊢ E : |τ |\nwhere\nρ = ∀ᾱ.ρ̄ ⇒ τ\nThus, based on (F-Abs) we have\n|Γ|, |∆| ⊢ λ(~x : |~\nρ|).E : |ρ1 | → . . . → |ρn | → |τ |\n\nIt follows from (TrVar) that\n(x : τ ) ∈ Γ\n\nor, using the definition of | * |\n|Γ|, |∆| ⊢ λ(~x : |~\nρ|).E : |ρ̄ ⇒ τ |\nMoreover, because of (TrRule), we know\n\nBased on the definition of | * | it follows\n(x : |τ |) ∈ |Γ|\nThus we have by (F-Var) that\n|Γ|, |∆| ⊢ x : |τ |\n\nα\n~ ∩ ftv (Γ, ∆) = ∅\nand hence\nα\n~ ∩ ftv (|Γ|, |∆|) = ∅\nSo, finally, we may conclude from (F-TAbs) that\n|Γ|, |∆| ⊢ Λ~\nα.λ(~x : |~\nρ|).E : ∀~\nα.|ρ̄ ⇒ τ |\n\n(TrAbs)\n\nΓ|∆ ⊢ λx : τ1 .e : τ1 → τ2 ; λx : |τ1 |.E\n\nand again with | * |\n|Γ|, |∆| ⊢ Λ~\nα.λ(~x : |~\nρ|).E : |∀~\nα.ρ̄ ⇒ τ |\n\nIt follows from (TrAbs) that\nΓ; x : τ1 |∆ ⊢ e : τ2 ; E\nand by the indution hypothesis that\n|Γ|, x : |τ1 |, |∆| ⊢ E : |τ2 |\nAs all variables are renamed unique, it is easy to verify that this\nalso holds:\n\n(TrInst)\n\nBy (TrInst) and the induction hypothesis, it follows that\n|Γ|, |∆| ⊢ E : |∀~\nα.ρ̄ ⇒ τ |\nFrom which we have by definition of | * |\n\n|Γ|, |∆|, x : |τ1 | ⊢ E : |τ2 |\nHence, by (F-Abs) we have\n\nΓ|∆ ⊢ e[~τ ] : [~\nα 7→ ~τ ](ρ̄ ⇒ τ ) ; E |~τ |\n\n|Γ|, |∆| ⊢ E : ∀~\nα.|ρ̄ ⇒ τ |\nIt follows from (F-TApp) that\n\n|Γ|, |∆| ⊢ λx : |τ1 |.E : |τ1 → τ2 |\n\n|Γ|, |∆| ⊢ E |~τ | : [~\nα 7→ |~τ |]|ρ̄ ⇒ τ |\nwhich is easily seen to be equal to\n\n(TrApp)\n\n|Γ|, |∆| ⊢ E |~τ | : |[~\nα 7→ ~τ ](ρ̄ ⇒ τ )|\n\nΓ|∆ ⊢ e1 e2 : τ1 ; E1 E2\n\nBy the induction hypothesis, we have:\n|Γ|, |∆| ⊢ E1 : |τ2 → τ1 |\nand\n\n(TrRApp)\n\n~\nΓ|∆ ⊢ e with e : ρ : τ ; E E\n\nFrom (TrApp) and the induction hypothesis we have:\n|Γ|, |∆| ⊢ E2 : |τ2 |\n\nThen it follows by (F-App) that\n|Γ|, |∆| ⊢ E1 E2 : |τ1 |\n\n|Γ|, |∆| ⊢ E : |ρ̄ ⇒ τ |\nand\n|Γ|, |∆| ⊢ Ei : |ρi |(∀i)\n\n\fHence, base on the definition of | * | the first of these means\n|Γ|, |∆| ⊢ E : |ρ1 | → . . . → |ρn | → |τ |\nHence, based on (F-App) we know\n~ : |τ |\n|Γ|, |∆| ⊢ E E\n\nLemma B.2. If\n∆⊢ρ;E\nthen\n|∆| ⊢ E : |ρ|\nProof. By induction on the derivation.\nFrom (TrRes) we have\n~\n∆ ⊢ ρ ; Λ~\nα.λ(~x : |~\nρ|).(E E)\nwhere\nρ = ∀~\nα.ρ̄ ⇒ τ\nAlso from (TrRes) and the induction hypothesis, we have\n|∆| ⊢ Ei : |ρi | (ρi ∈ ρ̄′ − ρ̄)\nAlso from (TrRes) and Lemma B.3, we have\n|∆| ⊢ E : |~\nρ′ ⇒ τ |\nAssembling these parts using (F-App), (F-Abs) and (F-TAbs)\nwe come to\n~\n|∆| ⊢ Λ~\nα.λ(~x : |~\nρ|).(E E)\n\nLemma B.3. If\n∆hτ i = ρ̄ ⇒ τ : E\nthen\n|∆| ⊢ E : |ρ̄ ⇒ τ |\nProof. This follows trivially from Lemma B.4.\nLemma B.4. If\nρ : xhτ i = ρ̄ ⇒ τ : E\nthen\n|ρ : x| ⊢ E : |ρ̄ ⇒ τ |\nProof. From the definintion of lookup we know that iff\nρ : xhτ i = θρ̄′ ⇒ τ : x |~τ |\nthen\n(ρ : x) ∈ ρ : x\nHence, it trivially follows that\n(x : |ρ|) ∈ |ρ : x|\nHence, from (F-Var) we have that\n|ρ : x| ⊢ x : |ρ|\nFollowing the definition of | * | we also know\nα.|ρ̄′ ⇒ τ ′ |\n|ρ : x| ⊢ x : ∀~\nSo\n|ρ : x| ⊢ x |ts| : |θ(ρ̄′ ⇒ τ ′ )|\n\n\f"}