{"id": "http://arxiv.org/abs/1107.2492v2", "guidislink": true, "updated": "2011-07-14T11:51:33Z", "updated_parsed": [2011, 7, 14, 11, 51, 33, 3, 195, 0], "published": "2011-07-13T09:05:31Z", "published_parsed": [2011, 7, 13, 9, 5, 31, 2, 194, 0], "title": "Bloch-wave engineering of quantum dot-micropillars for cavity quantum\n  electrodynamics experiments", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1107.2410%2C1107.3943%2C1107.2492%2C1107.1370%2C1107.5150%2C1107.0105%2C1107.3587%2C1107.1362%2C1107.0229%2C1107.1846%2C1107.3614%2C1107.1597%2C1107.4132%2C1107.0555%2C1107.2731%2C1107.5190%2C1107.0191%2C1107.4469%2C1107.0641%2C1107.0238%2C1107.0711%2C1107.5509%2C1107.0741%2C1107.3623%2C1107.1322%2C1107.4717%2C1107.6001%2C1107.4580%2C1107.0680%2C1107.0598%2C1107.4182%2C1107.0021%2C1107.1382%2C1107.4758%2C1107.3183%2C1107.1449%2C1107.0300%2C1107.5633%2C1107.4081%2C1107.5041%2C1107.2102%2C1107.2901%2C1107.4381%2C1107.5759%2C1107.4841%2C1107.1928%2C1107.3677%2C1107.4630%2C1107.4480%2C1107.5482%2C1107.0423%2C1107.2003%2C1107.0618%2C1107.5312%2C1107.0712%2C1107.3332%2C1107.1804%2C1107.0443%2C1107.0366%2C1107.1730%2C1107.4762%2C1107.5955%2C1107.3506%2C1107.1314%2C1107.1682%2C1107.5675%2C1107.3862%2C1107.2474%2C1107.1926%2C1107.2544%2C1107.0856%2C1107.3500%2C1107.0602%2C1107.0731%2C1107.5260%2C1107.6018%2C1107.2457%2C1107.4755%2C1107.5689%2C1107.4190%2C1107.0570%2C1107.0612%2C1107.5218%2C1107.5732%2C1107.0350%2C1107.0862%2C1107.2673%2C1107.4106%2C1107.1623%2C1107.4468%2C1107.3133%2C1107.2166%2C1107.2162%2C1107.1543%2C1107.4686%2C1107.4163%2C1107.4396%2C1107.0783%2C1107.5381%2C1107.0738%2C1107.2967&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Bloch-wave engineering of quantum dot-micropillars for cavity quantum\n  electrodynamics experiments"}, "summary": "We have employed Bloch-wave engineering to realize submicron diameter\nultra-high quality factor GaAs/AlAs micropillars (MPs). The design features a\ntapered cavity in which the fundamental Bloch mode is subject to an adiabatic\ntransition to match the Bragg mirror Bloch mode. The resulting reduced\nscattering loss leads to record-high visibility of the strong coupling in MPs\nwith modest oscillator strength quantum dots. A quality factor of 13,600 and a\nRabi splitting of 85 \\mueV with an estimated visibility v of 0.38 are observed\nfor a small mode volume MP with a diameter dc of 850 nm.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1107.2410%2C1107.3943%2C1107.2492%2C1107.1370%2C1107.5150%2C1107.0105%2C1107.3587%2C1107.1362%2C1107.0229%2C1107.1846%2C1107.3614%2C1107.1597%2C1107.4132%2C1107.0555%2C1107.2731%2C1107.5190%2C1107.0191%2C1107.4469%2C1107.0641%2C1107.0238%2C1107.0711%2C1107.5509%2C1107.0741%2C1107.3623%2C1107.1322%2C1107.4717%2C1107.6001%2C1107.4580%2C1107.0680%2C1107.0598%2C1107.4182%2C1107.0021%2C1107.1382%2C1107.4758%2C1107.3183%2C1107.1449%2C1107.0300%2C1107.5633%2C1107.4081%2C1107.5041%2C1107.2102%2C1107.2901%2C1107.4381%2C1107.5759%2C1107.4841%2C1107.1928%2C1107.3677%2C1107.4630%2C1107.4480%2C1107.5482%2C1107.0423%2C1107.2003%2C1107.0618%2C1107.5312%2C1107.0712%2C1107.3332%2C1107.1804%2C1107.0443%2C1107.0366%2C1107.1730%2C1107.4762%2C1107.5955%2C1107.3506%2C1107.1314%2C1107.1682%2C1107.5675%2C1107.3862%2C1107.2474%2C1107.1926%2C1107.2544%2C1107.0856%2C1107.3500%2C1107.0602%2C1107.0731%2C1107.5260%2C1107.6018%2C1107.2457%2C1107.4755%2C1107.5689%2C1107.4190%2C1107.0570%2C1107.0612%2C1107.5218%2C1107.5732%2C1107.0350%2C1107.0862%2C1107.2673%2C1107.4106%2C1107.1623%2C1107.4468%2C1107.3133%2C1107.2166%2C1107.2162%2C1107.1543%2C1107.4686%2C1107.4163%2C1107.4396%2C1107.0783%2C1107.5381%2C1107.0738%2C1107.2967&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We have employed Bloch-wave engineering to realize submicron diameter\nultra-high quality factor GaAs/AlAs micropillars (MPs). The design features a\ntapered cavity in which the fundamental Bloch mode is subject to an adiabatic\ntransition to match the Bragg mirror Bloch mode. The resulting reduced\nscattering loss leads to record-high visibility of the strong coupling in MPs\nwith modest oscillator strength quantum dots. A quality factor of 13,600 and a\nRabi splitting of 85 \\mueV with an estimated visibility v of 0.38 are observed\nfor a small mode volume MP with a diameter dc of 850 nm."}, "authors": ["Matthias Lermer", "Niels Gregersen", "Florian Dunzer", "Stephan Reitzenstein", "Sven Höfling", "Jesper Mørk", "Lukas Worschech", "Martin Kamp", "Alfred Forchel"], "author_detail": {"name": "Alfred Forchel"}, "author": "Alfred Forchel", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1103/PhysRevLett.108.057402", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1107.2492v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1107.2492v2", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "4 pages, 3 figures", "arxiv_primary_category": {"term": "physics.optics", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "physics.optics", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1107.2492v2", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1107.2492v2", "journal_reference": null, "doi": "10.1103/PhysRevLett.108.057402", "fulltext": "Bloch-wave engineering of quantum dot-micropillars for cavity quantum\nelectrodynamics experiments\nM. Lermer,1 N. Gregersen,2 F. Dunzer,1 S. Reitzenstein,1 S.\nHöfling,1 J. Mørk,2 L. Worschech,1 M. Kamp,1 and A. Forchel1\n\narXiv:1107.2492v2 [physics.optics] 14 Jul 2011\n\n1\n\nTechnische Physik, Wilhelm Conrad Röntgen Research Center for Complex Material Systems,\nUniversität Würzburg, Am Hubland, D-97074 Würzburg, Germany\n2\nDTU Fotonik, Department of Photonics Engineering,\nTechnical University of Denmark, Building 343, DK-2800 Kongens Lyngby, Denmark\n(Dated: today)\n\nWe have employed Bloch-wave engineering to realize submicron diameter ultra-high quality factor\nGaAs/AlAs micropillars (MPs). The design features a tapered cavity in which the fundamental\nBloch mode is subject to an adiabatic transition to match the Bragg mirror Bloch mode. The\nresulting reduced scattering loss leads to record-high visibility of the strong coupling in MPs with\nmodest oscillator strength quantum dots. A quality factor of 13,600 and a Rabi splitting of 85 μeV\nwith an estimated visibility v of 0.38 are observed for a small mode volume MP with a diameter dc\nof 850 nm.\nPACS numbers: 81.05.Ea, 42.79.Gn, 78.67.Pt, 42.50.Pq\n\nSemiconductor quantum dot (QD) - microcavity systems are highly interesting for the study of fundamental\nlight-matter interaction and the development of innovative quantum devices [1]. As the strength of the lightmatter interaction depends strongly on the electromagnetic field profile, it is central to engineer the photonic\nenvironment in these systems to obtain the desired functionality. In devices featuring invariance along a propagation z-axis, the modal formalism [2] gives a clear physical picture of the governing mechanisms of the propagation and scattering of light, which allows for a simple understanding of the effects of e.g. adiabatic mode\ntransitions, mode coupling and the scattering of a truncated waveguide. Thanks to the Bloch theorem, a similar\nmodal formalism exists for periodic structures, and most\nof the physical concepts used for z-invariant geometries\ncan be carried over to periodic structures. The potential\nof Bloch-wave engineering in microcavities was pointed\nout by Lalanne et al. [3] and has subsequently been experimentally demonstrated in planar 1D photonic crystal\n(PhC) nanobeam cavities [4, 5] and in 2D PhC cavities\n[6]. Furthermore, 'accidental' improvements in cavity figure of merits [7] have subsequently been explained using Bloch-wave concepts [8]. However, in spite of the\nclear potential for investigating light-matter interaction\nin Bloch-wave engineered MP cavities [9], which have previously been utilized as a model system for the demonstration of cavity quantum electrodynamics (cQED) effects such as strong light-matter coupling [10], efficient\nemission of single [11] and indistinguishable [12] photons\nand entangled photon pairs [13], no experimental demonstration of intentionally engineered MP cavities has been\nreported so far.\nIn this Letter, we present a novel tapered MP cavity design in which Bloch-wave engineering is employed\nto significantly enhance the 3D mode confinement and\n\nFIG. 1: (a) Schematic sketch of the layer sequence of the\nadiabatic cavity design illustrating the bottom/top DBR with\n30/25 mirror pairs and a 3 taper cavity region. Inset: Zoomin view of the cavity region. (b) The position of the photonic\nbandgap as function of z is schematically illustrated. The\nresonance wavelength of the cavity mode is represented by\nthe dashed line. (c, d) Electric field amplitude profiles in a\nMP with dc = 750 nm for the reference (c) and the adiabatic\n(d) design, respectively.\n\nthereby the light-matter interaction. For the observation of the Purcell-effect in a weakly coupled QD-cavity\nsystem, the figure of merit is the ratio Q/Vmode [1],\nwhere Q is the quality factor (Q factor) and Vmode is the\nmode volume, and in the strong coupling (SC) regime\nthe normal mode splitting is resolved when the visibility\nv = g/(κ + γ ∗) > 1/4 [14]. Herein, γ ∗ is the pure dephasing rate, κ = ωc /Q represents the full width at half maximum of the fundamental mode with resonance frequency\nωc and the slow decay rate of the isolated emitter is neglected. pThe light-matter coupling constant g is given\nby g = (e2 f /(4ε0 n2c m0 Vmode )) ∝ 1/dc , where f is the\noscillator strength and m0 is the free-electron mass [15].\nIn both regimes it is thus necessary to confine light in mi-\n\n\f2\ncroresonators providing high Q factors and small mode\nvolumes. MP cavities have been demonstrated to support\nphotonic modes with quality factors as large as 165,000\n[16] in the few μm diameter (dc ) range and thus relatively\nlarge Vmode . To observe SC, a large Vmode can generally\nbe compensated by increasing Q, however, when κ < γ ∗ ,\nthe pure dephasing rate limits the visibility. This important effect means that increasing Q beyond ωc /γ ∗ does\nnot improve v, which in the few μm diameter range generally remains ≤ 1/4 for standard QDs [16].\nRather, in the presence of dephasing, the figure of\nmerit for SC becomes g/(κ + γ ∗) [14] and the visibility is\nmaximized by choosing a high Q on the order of ωc /γ ∗\nand by reducing Vmode . To this end, one might simply\ndecrease dc of the pillars. However, in the standard microcavity design, the mode matching between the cavity\nmode and the fundamental Bloch mode of the distributed\nBragg reflectors (DBRs) in the submicron regime is poor,\nleading to intrinsic scattering loss and a Q factor on the\norder of 2,000 for dc < 1μm [17]. Moreover, rather than\nbeing a monotonous function of diameter, coupling of the\ncavity mode to propagating Bloch modes of the DBRs\nhas been shown to result in substantial Q factor oscillations [17–19]. Whereas the Q factor of large-diameter\nMPs with dc > 3μm [16] is mainly limited by scattering from fabrication imperfections and intrinsic loss, the\npoor mode matching is the main limitation for submicron\ndiameter pillars.\nTo reduce the strong scattering due to mode mismatch\nin the submicron regime we have implemented an advanced AlAs/GaAs pillar design inspired by a proposal\nof adiabatic SiO2 /TiO2 MP cavities by Zhang et al. [9].\nThe design features a tapered cavity region in which the\nfundamental DBR Bloch mode experiences an adiabatic\nmode transition [3] out of the bandgap. We obtain a\nstrongly improved mode matching and a reduced coupling to propagating Bloch modes in the DBRs, and this\nallows us to demonstrate remarkably high quality factors\nexceeding 10,000 for MP cavities with diameters below\n1 μm.\nWhereas previous studies on MP cavities required large\noscillator strength QDs to enter the SC regime [10, 20–\n22], fabricated using a highly challenging process, the\ngood mode matching for adiabatic MPs with dc < 1μm\npaves the way for pronounced strong coupling effects even\nfor standard InGaAs QDs with more pronounced quantization effects and oscillator strength f of about 10.\nOur advanced approach consists of employing an adiabatic Bloch mode matching technique for the GaAs/AlAs\ncavity region. A standard design with a regular one-λ\ncavity is also studied as a reference. In the 'adiabatic'\ndesign the regular λ-cavity is replaced by a 3 segment tapered region. The layer thicknesses are gradually reduced\ntowards the center, effectively detuning the bandgap relative to that of the DBRs, allowing for a single localized mode inside the cavity [9]. The geometrical param-\n\neters were determined using full 3D vectorial simulations\nbased on the eigenmode expansion technique [23] for a\ndesign diameter of 1,000 nm and a resonance wavelength\nλc = 2πc/ωc = 950 nm. Fabrication imperfections, i.e.\nthe partial oxidation of the AlAs layers and the coating\nof the pillars with glass (SiOx ) during the dry etching\nstep [18, 19], were taken into account. The DBR layer\nthicknesses were chosen as λef f /4 = λc /(4nef f ), where\nnef f is the effective index of the layer and λef f the effective material wavelength, placing the design resonance at\nthe center of the 1D DBR bandgap. A simple linear decrease of the cavity layer thicknesses was employed and\nthe linear coefficient was adjusted to obtain a resonance\nat λc = 950 nm. Fig. 1(a) shows a schematic of the\nlayer sequence of the adiabatic cavity design. On the\nright hand side a zoom-in of the tapered cavity region is\nshown, illustrating by different colors the decrease of the\nthickness of the layers upon transition from the periodic\nDBR region towards the QD-layer, which is placed in the\ncentral GaAs spacer.\nWhereas the cavity thickness of the reference design\nis λef f = 280 nm, the central GaAs layer in the tapered cavity is only 60 nm thick, corresponding to about\nλef f /5. Regular cavity engineering concepts are thus insufficient to explain the localization of the cavity mode\nin the adiabatic pillar, which demonstrates the necessity\nof Bloch mode formalism in the analysis of the geometry. Instead of considering eigenmodes in z-invariant\nlayers we consider Bloch modes in sections of alternating\nGaAs/AlAs layers. Somewhat surprisingly, Bloch modes\nremain useful even in regions of the adiabatic cavity containing only one period of layer pairs. Furthermore, the\nintroduction of the concept of Bloch modes in these aperiodic regions serves to fully explain the suppressed scattering due to mode mismatch, as we show in the following. The position of the bandgap in the adiabatic cavity\nas function of the vertical z coordinate is illustrated in\nFig. 1(b). Outside the cavity, the bandgap in the DBRs\nis centered at the resonance wavelength to achieve maximum reflectivity. Inside the cavity, the total thickness of\nthe GaAs/AlAs layer pairs is gradually decreased. This\ndecrease leads to a gradual blueshift of the bandgap ensuring an adiabatic transition of the fundamental Bloch\nmode, and in the central region it appears outside the\nbandgap. The Bloch mode can propagate freely over 2\nGaAs/AlAs periods, as illustrated in Fig. 1(b), before\nit is gradually reflected, resulting in the localization of\na cavity mode in the central region combined with suppression of the scattering to higher-order Bloch modes.\nOptical field profiles of MPs with dc = 750 nm are plotted in Fig. 1(c-d). The field profile for the reference\ndesign in Fig. 1(c) depicts a localized mode, but also\nsubstantial field penetration into the DBRs due to coupling to propagating Bloch modes. Figure 1(d) shows the\ncavity mode for the adiabatic cavity design, and here the\nsuppressed coupling to higher-order Bloch modes, the re-\n\n\f3\nduced field penetration into the DBRs and the improved\nconfinement are clearly observable.\nThe computed Q and Vmode for the adiabatic and the\nreference designs are shown in Fig. 2(a). The simulations show diameter dependent oscillatory variations\nwith a small period (≈ 50 nm) of the Q factor between\n100,000 and 300,000 for the adiabatic cavity design (see\nFig. 2(a)). This is a theoretical improvement of Q by\n2 orders of magnitude for the adiabatic cavity design\ncompared to the reference band results from the strong\nimprovement of mode matching between the cavity and\nDBR Bloch modes. Even though the design was optimized for dc = 1, 000 nm, we observe that the Q factor\nremains large in a broad diameter range. Fig. 2(b) shows\nthat the Q factor of MP cavities based on the reference\ndesign is not limited by the amount of mirror pairs for\ndc < 1, 000 nm, confirming that the mode mismatch is\nthe dominating limiting effect on the Q factor in this diameter regime. One also recognizes from Fig. 2(a) that\nVmode of the two designs are almost identical, leading\nin total to a theoretical enhancement of Q/Vmode by 2\norders of magnitude for the adiabatic cavity design compared with the standard λ-thick cavity.\nThe AlAs/GaAs microcavity samples have been grown\nby molecular beam epitaxy on (100) oriented GaAs substrate. Each sample consists of a cavity region, sandwiched between an upper (lower) distributed Bragg reflector with 25 (30) and 28 (33) mirror pairs, composed\nof alternating AlAs and GaAs layers. MP cavities with\nvarious diameters have been fabricated by electron beam\nlithography and dry etching techniques and characterized\nby micro-photoluminescence spectroscopy under above\nband gap excitation at 532 nm.\nFig. 2(c) shows the measured Q factor dependent on\ndc for the reference and adiabatic cavity designs. One\nobserves that of the reference design is limited to values\nof about 2,000 in the submicron diameter range, which\nis in agreement with literature [17]. Similar Q factors\nare observed for both reference samples with 25/30 and\n28/33 DBRs, consistent with the simulations shown in\nFig. 2(b). Significantly higher Q factors are obtained\nfor the MPs based on the adiabatic cavity design. Indeed, all Q values of the improved microcavity design\nare located in the range between 4,000 and 15,000 in the\nsubmicron diameter range. Interestingly, a Q factor as\nhigh as 14,400 has been identified for a MP cavity with\ndc = 860nm which is a factor of 7 higher than stateof-the-art values for submicrometer MPs with standard\nmicrocavity design [17].\nSimulations predict an improvement in Q of two orders\nof magnitude and predict a general increase in Q as dc\ndecreases, whereas the opposite trend is observed experimentally. We attribute these discrepancies to random\nfabrication-induced imperfections not taken into account\nin the simulations. For the perfectly periodic structures\nconsidered in the modeling, the calculations show that\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\nFIG. 2: (a) Computed Q factor and Vmode as function of dc\nfor the reference and the adiabatic cavity designs. (b) Computed Q factor for reference designs with 25/30, 28/33 and\n31/36 DBR mirror layer pairs. (c) Experimentally measured\nmaximum values of the Q factor for the reference (25/30 and\n28/33 mirror pairs) and the adiabatic cavity designs (25/30\nmirror pairs). (d) The visibility as function of diameter dc\nis illustrated for the adiabatic (dashed curve) and reference\ndesign (full curve) for an oscillator strength of f = 10. The\nonset of SC at v = 1/4 is depicted using the dotted line.\n\nthe poor modal overlap in the submicron diameter regime\nis indeed the dominating mechanism limiting the Q factor and the adiabatic transition of the fundamental Bloch\nmode leads to a vast improvement in Q. However, random side-wall imperfections for the experimentally realized pillars are present resulting in a scattering loss inversely proportional to the pillar diameter. While this\nloss is less important for large-diameter pillars [16], scattering by side-wall imperfections is the dominating loss\nmechanism for dc < 1, 000 nm and limits the obtainable\nvalues of Q in this regime.\nThe adiabatic microcavity design is of particular interest for cQED experiments in the SC regime. Due to\nthe combination of a small Vmode and a high Q factor,\nthe observation of normal mode splitting in submicron\npillars with 'standard' QDs having oscillator strengths\nf ∼ 10 should be feasible. For the calculation of the visibility v, we estimate a dephasing rate γ ∗ of ∼ 20 μeV\nat 35 K [22, 24]. The resulting visibility v as function of\n\n\f4\n(b)\n(a)\n\n(c)\n\nFIG. 3: (a) Strong QD (X) - cavity (C) coupling of a MP\nwith dc = 850 nm and Q 13, 600 via temperature tuning.\nTemperature dependent (b) linewidth and (c) peak position\ndetermined from (a).\n\ndc for the adiabatic and the reference designs obtained\nfrom the measured Q factor and the computed Vmode for\na standard oscillator strength of f = 10. The visibility\nof the reference design falls much below the onset for SC\nat 1/4. However, the visibility for the adiabatic cavity\ndesign increases well above 1/4, and the observation of\nSC can be expected. Indeed, we have identified SC for\nvarious submicrometer diameter QD-MPs based on the\nadiabatic cavity design. One example is presented in Fig.\n3, where temperature tuning of a single QD-line (X) with\nthe fundamental mode (C) of a MP with Q = 13, 600 and\ndc = 850 nm (Vmode ≈ 2.3 (λc /n3 )) is applied to demonstrate anticrossing of the two lines (see Fig. 3 (a)) as a\nclear signature of the coherent coupling. At resonance\n(T = 37 K), X and C are indistinguishable in terms of\ntheir widths (see Fig. 3 (b) and (c)) and a Rabi splitting\nof 85 μeV, can be extracted, corresponding to a minimum QD oscillator strength of f ≈ 3 and a visibility v\nof 0.38, to our knowledge representing state-of-the-art in\nmicropillars with standard (f ≈ 10) QDs.\nIn conclusion, we have employed Bloch-wave engineering to realize ultra high Q factor MP cavities in the submicrometer diameter range. Instead of the usual λ-cavity\nthe design features a symmetric 3 segment tapered cavity where adiabatic transition is employed to reduce the\nusual scattering due to poor mode matching occuring in\nstandard submicrometer diameter pillars. The adiabatic\ncavity design has lead to experimentally measured Q factors exceeding 10,000 for pillar diameters dc < 1, 000nm.\nThis improvement makes the design very promising for\nthe observation of pronounced cQED effects, and SC between a single QD line and the fundamental mode of a\nsubmicron diamater MP has been observed. While enor-\n\nmous effort has been invested in tailoring 2D and 3D\nphotonic crystal cavities with small Vmode and high Q\nfactors, Bloch-wave engineering of MP cavity designs has\nso far been largely neglected. The present study shows\nthe large potential of employing Bloch-wave engineering\nfor solid-state cQED.\nWe thank A. Wolf and M. Emmerling for sample preparation and P. K. Nielsen and K. H. Madsen for fruitful\ndiscussions. Financial support by the Federal Ministry\nof Education of Research (project 'QuaHL-Rep') and the\nDanish Research Council for Technology and Production\n(Contract No. 10-080752) is gratefully acknowledged.\n\n[1] J. M. Gerard, Top. Appl. Phys. 90, 269 (2003).\n[2] A. W. Snyder and J. D. Love, Optical waveguide theory\n(Chapman and Hall NY, 1983)\n[3] M. Palamaru and P. Lalanne, Appl. Phys. Lett. 78, 1466\n(2001); P. Lalanne and J. P. Hugonin, IEEE J. Quantum Electron. 39, 1430-1438 (2003); P. Lalanne, S. Mias\nand J. P. Hugonin, Opt. Express 12, 458-467 (2004); C.\nSauvan et al., Opt. Express 13, 245-255 (2005).\n[4] P. Velha et al., Opt. Express 15, 16090-16096 (2007); P.\nB. Deotare et al., Appl. Phys. Lett. 94, 121106 (2009).\n[5] R. Ohta et al., Appl. Phys. Lett. 98, 173104 (2011).\n[6] B. S. Song et al., Nature 4, 207-210 (2005).\n[7] Y. Akahane et al., Nature 425, 944-947 (2003).\n[8] C. Sauvan, P. Lalanne and J. P. Hugonin, Nature,\ndoi:10.1038/nature02602 (2004).\n[9] Y. Zhang, M. Loncar, Opt. Lett. 34, 902 (2009).\n[10] J. P. Reithmaier et al., Nature 432, 197 (2004).\n[11] E. Moreau et al., Appl. Phys. Lett. 79, 2865 (2001); M.\nPelton et al., Phys. Rev. Lett. 89, 233602 (2002).\n[12] C. Santori et al., Nature 419, 594 (2002).\n[13] A. Dousse et al., Nature 466, 217 (2010).\n[14] A. Auffeves et al., Phys. Rev. B. 81, 245419 (2010).\n[15] B. Gayral, J. M. Gerard, Phys. Rev. B 78, 235306 (2008).\n[16] S. Reitzenstein et al., Appl. Phys Lett. 90, 251109 (2007).\n[17] P. Lalanne, J. P. Hugonin, J. M. Gerard, Appl. Phys.\nLett. 84, 4726 (2004); G. Lecamp et al., Appl. Phys. Lett.\n90, 091120 (2007); Chen2005 L. Chen, E. Towe, Appl.\nPhys. Lett. 87, 103111 (2005).\n[18] S. Reitzenstein et al., Appl. Phys. Lett. 94, 061108\n(2009).\n[19] N. Gregersen et al., J. Quan. Electr. 46, 1470 (2010).\n[20] D. Press et al., Phys. rev. Lett. 98, 117402 (2007).\n[21] J. Kasprzak et al., Nature Mat. 9, 304 (2010).\n[22] V. Loo et al., Appl. Phys. Lett. 97, 241110 (2010).\n[23] P. Bienstman and R. Baets, Opt. Quantum Electron. 33,\n327 (2001); N. Gregersen and J. Mørk, Opt. Quantum\nElectron. 40, 957-966 (2008).\n[24] K. H. Madsen et al, Phys. Rev. Lett. 106, 233601 (2011).\n\n\f"}