{"id": "http://arxiv.org/abs/1110.0440v4", "guidislink": true, "updated": "2012-09-17T17:21:56Z", "updated_parsed": [2012, 9, 17, 17, 21, 56, 0, 261, 0], "published": "2011-10-03T18:56:43Z", "published_parsed": [2011, 10, 3, 18, 56, 43, 0, 276, 0], "title": "Towards the Standard Model of Fermi Arcs from a Wilsonian Reduction of\n  the Hubbard Model", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1110.3724%2C1110.5620%2C1110.1795%2C1110.6640%2C1110.0838%2C1110.1387%2C1110.2633%2C1110.6760%2C1110.6112%2C1110.0115%2C1110.5605%2C1110.0123%2C1110.5595%2C1110.0599%2C1110.6174%2C1110.3089%2C1110.2491%2C1110.5754%2C1110.2553%2C1110.2182%2C1110.2619%2C1110.2719%2C1110.1813%2C1110.5241%2C1110.0261%2C1110.1835%2C1110.2853%2C1110.0647%2C1110.6698%2C1110.2593%2C1110.2029%2C1110.1971%2C1110.5866%2C1110.1319%2C1110.3504%2C1110.4789%2C1110.3463%2C1110.6280%2C1110.3461%2C1110.3336%2C1110.0122%2C1110.6010%2C1110.1342%2C1110.3610%2C1110.2647%2C1110.0513%2C1110.4390%2C1110.1750%2C1110.6443%2C1110.4629%2C1110.6065%2C1110.2099%2C1110.1061%2C1110.3741%2C1110.2431%2C1110.1906%2C1110.4071%2C1110.4851%2C1110.1579%2C1110.3984%2C1110.3207%2C1110.2351%2C1110.4259%2C1110.3474%2C1110.5289%2C1110.3627%2C1110.4787%2C1110.0440%2Ccs%2F0303012%2Ccs%2F0303024%2Ccs%2F0303031%2Ccs%2F0303025%2Ccs%2F0303022%2Ccs%2F0303002%2Ccs%2F0303017%2Ccs%2F0303032%2Ccs%2F0303021%2Ccs%2F0303018%2Ccs%2F0303015%2Ccs%2F0303026%2Ccs%2F0303030%2Ccs%2F0303008%2Ccs%2F0303006%2Ccs%2F0303019%2Ccs%2F0303020%2Ccs%2F0303014%2Ccs%2F0303004%2Ccs%2F0303009%2Ccs%2F0303027%2Ccs%2F0303010%2Ccs%2F0303029%2Ccs%2F0303023%2Ccs%2F0303033%2Ccs%2F0303005%2Ccs%2F0303003%2Ccs%2F0303011%2Ccs%2F0303007%2Ccs%2F0303016%2Ccs%2F0303028%2Ccs%2F0303013%2Ccs%2F0303001&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Towards the Standard Model of Fermi Arcs from a Wilsonian Reduction of\n  the Hubbard Model"}, "summary": "Two remarkable features emerge from the exact Wilsonian procedure for\nintegrating out the high-energy scale in the Hubbard model. At low energies,\nthe number of excitations that couple minimally to the electromagnetic gauge is\nless than the conserved charge, thereby implying a breakdown of Fermi liquid\ntheory. In addition, two charge $e$ excitations emerge in the lower band, the\nstandard projected electron and a composite entity (comprised of a hole and a\ncharge $2e$ bosonic field) which give rise to poles and zeros of the\nsingle-particle Green function, respectively. The poles generate spectral\nweight along an arc centered at $(\\pi/2,\\pi/2)$ while the zeros kill the\nspectral intensity on the back-side of the arc. The result is the Fermi arc\nstructure intrinsic to cuprate phenomenology. The presence of composite\nexcitations also produces a broad incoherent pseudogap feature at the $(\\pi,0)$\nregion of the Brillouin zone, thereby providing a mechanism for the\nnodal/anti-nodal dichotomy seen in the cuprates.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1110.3724%2C1110.5620%2C1110.1795%2C1110.6640%2C1110.0838%2C1110.1387%2C1110.2633%2C1110.6760%2C1110.6112%2C1110.0115%2C1110.5605%2C1110.0123%2C1110.5595%2C1110.0599%2C1110.6174%2C1110.3089%2C1110.2491%2C1110.5754%2C1110.2553%2C1110.2182%2C1110.2619%2C1110.2719%2C1110.1813%2C1110.5241%2C1110.0261%2C1110.1835%2C1110.2853%2C1110.0647%2C1110.6698%2C1110.2593%2C1110.2029%2C1110.1971%2C1110.5866%2C1110.1319%2C1110.3504%2C1110.4789%2C1110.3463%2C1110.6280%2C1110.3461%2C1110.3336%2C1110.0122%2C1110.6010%2C1110.1342%2C1110.3610%2C1110.2647%2C1110.0513%2C1110.4390%2C1110.1750%2C1110.6443%2C1110.4629%2C1110.6065%2C1110.2099%2C1110.1061%2C1110.3741%2C1110.2431%2C1110.1906%2C1110.4071%2C1110.4851%2C1110.1579%2C1110.3984%2C1110.3207%2C1110.2351%2C1110.4259%2C1110.3474%2C1110.5289%2C1110.3627%2C1110.4787%2C1110.0440%2Ccs%2F0303012%2Ccs%2F0303024%2Ccs%2F0303031%2Ccs%2F0303025%2Ccs%2F0303022%2Ccs%2F0303002%2Ccs%2F0303017%2Ccs%2F0303032%2Ccs%2F0303021%2Ccs%2F0303018%2Ccs%2F0303015%2Ccs%2F0303026%2Ccs%2F0303030%2Ccs%2F0303008%2Ccs%2F0303006%2Ccs%2F0303019%2Ccs%2F0303020%2Ccs%2F0303014%2Ccs%2F0303004%2Ccs%2F0303009%2Ccs%2F0303027%2Ccs%2F0303010%2Ccs%2F0303029%2Ccs%2F0303023%2Ccs%2F0303033%2Ccs%2F0303005%2Ccs%2F0303003%2Ccs%2F0303011%2Ccs%2F0303007%2Ccs%2F0303016%2Ccs%2F0303028%2Ccs%2F0303013%2Ccs%2F0303001&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Two remarkable features emerge from the exact Wilsonian procedure for\nintegrating out the high-energy scale in the Hubbard model. At low energies,\nthe number of excitations that couple minimally to the electromagnetic gauge is\nless than the conserved charge, thereby implying a breakdown of Fermi liquid\ntheory. In addition, two charge $e$ excitations emerge in the lower band, the\nstandard projected electron and a composite entity (comprised of a hole and a\ncharge $2e$ bosonic field) which give rise to poles and zeros of the\nsingle-particle Green function, respectively. The poles generate spectral\nweight along an arc centered at $(\\pi/2,\\pi/2)$ while the zeros kill the\nspectral intensity on the back-side of the arc. The result is the Fermi arc\nstructure intrinsic to cuprate phenomenology. The presence of composite\nexcitations also produces a broad incoherent pseudogap feature at the $(\\pi,0)$\nregion of the Brillouin zone, thereby providing a mechanism for the\nnodal/anti-nodal dichotomy seen in the cuprates."}, "authors": ["Seungmin Hong", "Philip Phillips"], "author_detail": {"name": "Philip Phillips"}, "author": "Philip Phillips", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1103/PhysRevB.86.115118", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1110.0440v4", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1110.0440v4", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "8 pages, 4 figures: Extended version accepted to PRB. Additions\n  include: 1) proof that the (\\pi,\\pi) solution is a global minimum, 2)\n  extensive discussion of relation to SU(2) gauge theory of t-J model and 3)\n  the meaning of the zero modes given the absence of Luttinger's theorem\n  established in arXiv:1207.4201. New Published version", "arxiv_primary_category": {"term": "cond-mat.str-el", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cond-mat.str-el", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1110.0440v4", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1110.0440v4", "journal_reference": "Phys. Rev. B, vol. 86, 115118 (2012)", "doi": "10.1103/PhysRevB.86.115118", "fulltext": "Towards the Standard Model for Fermi Arcs from a Wilsonian Reduction of the\nHubbard Model\nSeungmin Hong and Philip Phillips\n\narXiv:1110.0440v4 [cond-mat.str-el] 17 Sep 2012\n\nDepartment of Physics, University of Illinois at Urbana-Champaign\n(Dated: October 30, 2018)\nTwo remarkable features emerge from the exact Wilsonian procedure for integrating out the highenergy scale in the Hubbard model. At low energies, the number of excitations that couple minimally\nto the electromagnetic gauge is less than the conserved charge, thereby implying a breakdown of\nFermi liquid theory. In addition, two charge e excitations emerge in the lower band, the standard\nprojected electron and a composite entity (comprised of a hole and a charge 2e bosonic field) which\ngive rise to poles and zeros of the single-particle Green function, respectively. The poles generate\nspectral weight along an arc centered at (π/2, π/2) while the zeros kill the spectral intensity on the\nback-side of the arc. The result is the Fermi arc structure intrinsic to cuprate phenomenology. The\npresence of composite excitations also produces a broad incoherent pseudogap feature at the (π, 0)\nregion of the Brillouin zone, thereby providing a mechanism for the nodal/anti-nodal dichotomy\nseen in the cuprates.\n\nI.\n\nINTRODUCTION\n\nAs revealed by extensive angle-resolved photoemission\n(ARPES) studies1–7 , lightly doped copper-oxide superconductors (cuprates) in the pseudogap regime possess a\nband of excitations that only cross the chemical potential\nonce. Such a single crossing generates a set of coherent\nor pole-like excitations that ultimately form a truncated\nFermi region, termed a Fermi arc, as opposed to the traditional Fermi surface generated by a double crossing. The\ncoherent excitations, centered around (0, 0) → (π, π),\ntraverse the zone diagonal and terminate in the vicinity\nof (π, 0) or (0, π), thereby giving rise to a nodal/antinodal dichotomy8–12 , the former being ungapped while\nthe latter is gapped. While some ARPES experiments13\nperformed on Bi2 Sr2−x Lax CuO6+δ (La-Bi2201) revealed\nclosed hole pockets, and hence consistency with the results from quantum oscillation experiments in high magnetic fields14–18 , this interpretation has been called into\nquestion6 . King, et al.6 observed that the closed pockets seen earlier13 are entirely structural in origin as they\noriginate from overlapping superstructure replicas of the\nmain and shadow bands. Consequently, the preponderance of evidence from ARPES is that the coherent excitations form a disconnected region in momentum space\nconsistent with a single crossing of the chemical potential.\nTheoretically, two questions arise. 1) What suppresses\nthe spectral weight on the back-side of the arc? 2) What\nis the origin of the incoherent excitations or gap at the\nzone boundary? A natural candidate to explain the former is that two kinds of excitations populate a doped\nMott insulator, one of which has no overlap with the\nelectron. Such an excitation will appear in the singleelectron Green function as a zero rather than a pole and\nhence will carry no spectral weight. In this vein, some\nhave proposed neutral composite excitations19 to explain\nthe origin of Fermi arcs. Alternatively, Fermi arcs have\nbeen seen in numerics20–22 on the 2D Hubbard model\nand have been modeled phenomenologically23 (hereafter\n\nYRZ). However, a key assumption of the phenomenological account is that the zero-line is fixed at the diamondshaped Fermi surface of the non-interacting system. That\nthe diamond-shaped Fermi surface of the non-interacting\nsystem constitutes the zero-line of the single-particle\nGreen function is a rigorous mathematical statement24\nonly if the underlying Hamiltonian is particle-hole symmetric. In fact, from the precise condition24–26 for the\nvanishing of the real part of the Green function, maintaining that the zero-line is doping independent requires\nunphysical assumptions regarding the spectral function.\nCertainly such a conservation of the zero-line is not\nborne out by numerics on the Hubbard model27,28 nor\nby analytical arguments24 . In addition, models involving\nCooper pairs, fluctuating or otherwise, have been constructed to either yield arcs5 or hole pockets29,30 . Our\ndiscussion here, however, will focus entirely on arcs as\nthis seems to what the ARPES experiments are about.\nWhile the physical origin of arcs might not be clear,\nthe mathematics is. Any Green function of the form\nGtoy (ω, k) =\n\nZ\nω − ǫk +\n\n|∆(k)|2\nω−εk\n\n(1.1)\n\nwill do. The similarity with the BCS Green function is\nonly perfunctory as there is no anomalous component.\nAside from having poles, Eq. (1.1) has zeros whenever\nεk = 0 assuming of course the chemical potential corresponds to ω = 0. While the two dispersing electronic\nbands, ǫk and εk in Eq. (1.1) are not hard to come by,\nthe parameter ∆(k) is. It requires some sort of order,\nfluctuating or otherwise, or a new bosonic degrees of\nfreedom. While YRZ proposed Eq. (1.1) phenomenologically, their intuition was based on weak-coupling RPA\ndiagramatics31 on 2-leg ladder systems. In the context\nof an algebraic charge liquid (ACL)32 , Qi and Sachdev29\nalso obtained Eq. (1.1). Thus far, the only system shown\nto have the properties of the ACL is one with radically\ndifferent parameters than the cuprates33 .\nOur point here is that ∆(k) arises fundamentally from\na new degree of freedom associated with dynamical spec-\n\n\f2\ntral weight transfer. Ideally, it would be advantageous to\nderive Eq. (1.1) directly from the strong-coupling parameter space of the basic model for a doped Mott insulator,\nfor example the Hubbard model. Such a derivation has\nnot presented in the literature. Hence, it is this problem\nthat we address. Since zeros24,25 arise from a cancellation\nof the spectral weight in the upper and lower Hubbard\nbands (hereafter UHB and LHB), an accurate description\nof the upper band is required in a derivation of Eq. (1.1).\nHence, an attempt to obtain Eq. (1.1) from a model that\nprojects out the UHB, for example the t − J model, is\ninitially a non-starter as this model does not have zeros\nof the type required for Eq. (1.1). Nonetheless, the information regarding the UHB should be correctly encoded\ninto a theory of the lower band if the UHB is integrated\nout (rather than projected out) exactly ala Wilson34 . In\nthis paper, we show how the method we have recently\ndeveloped35–37 for carrying out the Wilsonian program\nfor the Hubbard model can be used to derive Eq. (1.1).\nWe show explicitly that two types of excitations emerge,\nprojected electrons (yielding poles in the propagator) and\na new bound state that gives rise to zeros. The bound\nstate is not made out of the elemental excitations and\nhence is orthogonal to an electron (hence the zero) . It\nrepresents a charge e excitation that originates from the\nnon-rigidity of the Hubbard bands, in other words, the\nwell documented dynamical spectral weight transfer38–40 ,\nthe key fingerprint of the breakdown of the band concept\nin Mott systems. Since the mathematics of Fermi arcs\nrequires two kinds of excitations, one with poles and the\nother with zeros, we refer to a physical model that contains both, such as the one presented here, as the standard model. More exotic models relying on some type\norder would fall outside this framework.\nII.\n\nCHARGE 2e BOSON THEORY\nA.\n\nPreliminaries\n\nUnderlying our toy Green function is a two-pole structure of the form,\n\u0012\n\u0013\ncos2 θ\nsin2 θ\nGtoy (ω, k) = Z\n+\n.\n(2.1)\nω − ω+\nω − ω−\nHere cos2 θ = (ω+ − ε(k))/(ω− − ω+ ) and ω± = 12 (ǫ(k) +\np\nε(k)) ± (ǫ(k) − ε(k))2 + 4|∆(k)|2 . Zeros arise from the\ninterference between the poles at ω− and ω+ . Any model\nthat admits zeros must have at least this two-pole structure. There are two limits of the Hubbard model in which\nthe zero surface can be calculated exactly. In the atomic\nlimit, the zero surface of the exact single-particle Green\nfunction\n1−x\n1+x\n+\n,\n(2.2)\nGR (ω) =\nU\nω−μ+ 2\nω − μ − U2\nis independent of momentum given by ω = μ and x = 0.\nWhen the hopping is non-zero, t 6= 0, the only limit in\n\nwhich the zero surface can be calculated exactly is at\nhalf-filling and particle-hole symmetry. In this limit, the\nzero surface24 for a nearest-neighbour band structure is\nthe magnetic Brillouin zone. Since Fermi arcs are absent\nfrom both the atomic limit and the half-filled system with\nhopping, it follows necessarily that Fermi arcs (if they are\npresent at all in the Hubbard model) arise entirely from\nthe dynamical part of the spectral weight.\nDynamical spectral weight transfer represents a concrete example of more being totally different. As is evident from Eq. (2.2), the weight of the lower band in the\natomic limit is 1 + x. This spectral weight has a natural interpretation in terms of electron states. There are\n2x electron addition and 1 − x electron removal states.\nHence, in the atomic limit, there is a one-to-one correspondence with the spectral intensity and the number of\nelectron states in the lower band. When the hopping is\nturned on, the spectral intensity increases in the lower\nband to 1 + x + α, where\n2t 1 X †\nhf fjσ i + O((t/U )2 )\n(2.3)\nα=\nU N ij,σ iσ\nand the fiσ 's are a rotation of the original fermionic operators in the Hubbard model such that it is block diagonal.\nThe energy of each block is nU , n the number of double occupancies in each block. α is necessarily positive\nbecause any hopping process that creates doubly occupancy decreases the available spectral weight in the upper\nband. Consequently, counting electrons, fractionalized or\notherwise, cannot exhaust the total number of degrees of\nfreedom in the lower band. A new degree of freedom\nmust be present which is distinct and hence orthogonal\nto electron quasiparticles. This degree of freedom will\nappear as a zero in the spectral function in the lower\nband. It is precisely the nature of the states that arise\nfrom the mixing with the upper band that we elucidate\nhere.\nSeveral approaches suggest some kind of composite excitation mediates Fermi arcs. Consider the SU (2) gauge\ntheory of the t-J model proposed by Wen and Lee41\nin which the elemental fields are the appropriate linear\ncombinations of two charge e bosons and two spinons.\nA mean-field calculation41 of the coherent spinon-boson\nGreen function reveals that the spectral weight of the occupied part of the spectrum exceeds 1 − x, acquiring a\nvalue of 1 + x/2 instead. Wen and Lee41 alleviated this\nproblem by introducing an interaction which recombined\nthe bosons and fermions back into the elemental fields.\nThe effect of this interaction with strength U was to enhance the spectral weight in the unoccupied part of the\nspectrum. The correct spectral weights were obtained\nsimply by adjusting the magnitude of U . The unnoccupied part of the spectrum41 shows up as a small hole\npocket centered roughly at (π/2, π/2). The intensity on\nthe back-side of the pocket is greatly suppressed, thereby\nleading to a structure not too distinct from a Fermi\narc. Subsequent work on the U (1) formulation of the\nt-J model with a phenomenological spinon-holon binding\n\n\f3\nterm reached a similar conclusion42 . However, the most\nextensive calculation in the gauge theoretic formulations\nof the Hubbard model reached a rather different conclusion. Working directly with the Hubbard model, Imada\nand colleagues43 used a slave-particle construction with\nthe gauge fluctuations treated at the RPA level and concluded it is actually dynamical spectral weight transfer\nthat leads to a fermi arc structure and a Green function\nof the YRZ form. Aside from suffering from the lack of\na systematic way of treating the gauge fluctuations, this\nformulation generates Fermi arcs from a neutral composite excitation43 . Since neutral entities cannot couple to\nthe current, it is unclear how such entities can influence\nthe spectral function. What we demonstrate here without resorting to a gauge theory is that dynamical spectral\nweight transfer mediates Fermi arcs.\n\nB.\n\nExact Results: The conserved charge and the\nlow energy mode\n\nDynamical spectral weight transfer has two profound\nconsequences. First, we show exactly that the conserved\ncharge (1−x) is not exhausted by counting the degrees of\nfreedom minimally coupled to the electromagnetic gauge.\n\nShUV =\n\nZ\n\n−t\n\nβ\n\ndτ\n\n0\n\nX\n\ni,j,σ\n\nZ\n\nThe remainder are carried by an incoherent background.\nSecond, the dynamically transferred degrees of freedom\ngive rise to zeros in the lower band. In fact, the physics\nwe find here is analogous to the finite U charge processes that contribute to the spectral function measured\nby ARPES in heavy-fermions44.\nWe first start with the procedure to integrate out the\nUHB. Previously, we demonstrated35–37 that a theory of\nthe lower Hubbard band (hole doping) can be obtained\nby introducing a new fermionic field Di 35,36 which represents the excitations in the upper band. This field has\nmass U and hence should be integrated out to construct\nthe exact low-energy theory. As in the derivation of all\ncollective phenomena which dates back to the classic paper of Bohm and Pines45 , a constraint must be introduced so that when solved, the model in the extended\nspace is equivalent to the starting UV-complete theory.\nThe new fermionic degree of freedom enters the action\nin a quadratic fashion and hence the standard fermionic\npath integral techniques can be applied to integrate the\nhigh-energy scale of the UHB. Since the lower and upper\nbands are not rigid in the sense that the spectral weights\nof the two bands are coupled, integrating out the upper\nband will lead to new degrees of freedom in the lower\nband. In Euclidean signature, the Hubbard action in the\nextended space is\n\n\u001a X\nX\nX\nDj∗ Dj\nDi∗ ∂τ Di + U\n(1 − niσ̄ )c∗iσ ∂τ ciσ +\nd2 θ θ̄θ\ni,σ\n\ni\n\nj\n\n\u001b\nh\ni\nX\nφ∗j (Dj − θcj↑ cj↓ ) + c.c. ,\ngij θ̄θ(1 − niσ̄ )(1 − nj σ̄ )c∗iσ cjσ + Di∗ c∗jσ ciσ Dj + (Dj∗ θciσ Vσ cj σ̄ + c.c.) + sθ̄\nj\n\n(2.4)\n\nwhere the matrix gij selects the relevant neighbors, Vσ =\n±1(σ =↑, ↓), the constraint is given by δ(Di − θci↑ ci↓ ),\nθ is a Grassmann, s is a constant with units of energy\nso that φi is dimensionless and ciσ is an electron annihilation operator for site i with spin σ. Because the δfunction constraint appears exponentiated in the action,\nan auxiliary field with charge 2e, φi enters the action\nas a Lagrange multiplier. As a consequence, the field\nφ is not made out of the elemental excitations (thereby\ndistinguishing it from other charge 2e scenarios involving pairs of electrons) but rather arises because the UHB\nand LHB are not rigid bands. In the action, the first\ntwo terms represent the dynamics in the lower and upper Hubbard bands, respectively, the third term the mass\nof the D field, the fourth term the hopping in the lower\nband with matrix element t, the next two the dynamical\nmixing between the upper and lower bands and the last\nterm the constraint. The constant s has units of energy\nand is O(t)46 . It is straightforward to check that solving\n\nthe constraint by integrating out the auxiliary field, φi ,\nfollowed by an integration over Di exactly reduces ShUV\nto the action for the standard Hubbard model. This is\nthe UV limit of our theory. The advantage of the reformulation above is that it cleanly associates the physics\nof the upper band with a fermionic field Di which enters\nthe action in a quadratic fashion. To obtain the IR limit,\none simply has to perform the Gaussian integration over\nthe massive field,\nR Di . The result is the low-energy or IR\naction, ShIR = dτ LIR\nh , with the associated Lagrangian,\n∗\n∗\nLIR\nh = (1 − niσ̄ )ciσ ∂τ ciσ − tgij (1 − niσ̄ )ciσ cjσ (1 − nj σ̄ )\n\u0001\n∗\n− (sφi − tbi ) M−1 ij (sφj − tbj )\n\n− (sφ∗i ci↑ ci↓ + c.c.) −\n\n1\ntr ln M,\nβ\n\n(2.5)\n\nwhere a matrix element of M is given by Mij = (∂τ +\nP\nU )δij − tgij c†jσ ciσ and bi = j gij cjσ Vσ ciσ̄ . Hereafter,\nrepeated indices are implicitly summed unless otherwise\n\n\f4\nstated. It is important to note that no approximations\nhave been made as of yet.\nIn both actions, ShUV and ShIR , global U (1) symmetry\nguarantees the existence of a conserved charge, which\nturns out to be\n∗\n∗\nQUV\nh = (1 − niσ̄ )ciσ ciσ + 2Di Di ,\n\nQIR\nh\n\n= (1 − niσ̄ )c∗iσ ciσ\n+ 2 (sφi − tbi )∗\n\nM−1\n\n\u0001\n\nik\n\n(2.6)\nM−1\n\n\u0001\n\n(sφj − tbj ) .\nkj\n(2.7)\n\nIt is a natural consequence that the conserved charge\nhQUV\nh i is consistent with the number of electrons in the\noriginal Hubbard model since the operator Di† Di counts\nthe number of doubly occupied sites. From the HellmanFeynmann theorem, it is straightforward to check how\nUV/IR\nthe number of double occupancies, ndocc , is related\nUV/IR\nUV/IR\nto\nndocc = β −1 ∂ ln Zh\n/∂U with Zh =\nR Di . Since\nD[* * * ]e−Sh , one can easily observe the second terms\nIR\nin Eq. (2.6) and (2.7) are identical to nUV\ndocc and ndocc ,\nIR\nrespectively. As a result, the conserved charge hQh i is\nidentified with the number of electrons, 1 − x, with x\nthe number of holes. This is one of the indications that\nthe low-energy action, ShIR , retains the structure of the\nHubbard model even after the integration of the massive\nmodes.\nAnother advantage of the low energy theory is that the\nnon-Fermi-liquid nature of the low-energy excitations is\nimmediately manifest. To illustrate this, one can add a\nminimally coupled source term36\n\u0003\n\u0002\nUV\n∗\nθ̄θ(1 − niσ̄ )ciσ + θ̄c∗iσ̄ Vσ Di + c.c. (2.8)\nL′ h = Jiσ\n\nso that when the constraint is solved, the bare electron\noperator is generated36 . What we would like to know is\nwhat is the transformed fermion at low energies. Integrating out the Di fields, results in a source contribution\nto the IR Lagrangian,\n\u0001\nIR\n∗\n∗ ∗\n(2.9)\nL′ h = Jiσ\nψiσ + c.c. − Jiσ\nciσ̄ M−1 ij cj σ̄ Jjσ\nwith a new collective field, ψiσ given by\n\u0001\n∗\nψiσ\n= (1 − niσ̄ )c∗iσ + tb∗j M−1 ji Vσ ciσ̄\n\u0001\n− sφ∗j M−1 ji Vσ ciσ̄ .\n\n(2.10)\n\nNote ψiσ is derived not contrived. It is Eq. (9) in the\nRef. 35. We obtained it by integrating the U V − complete Lagrangian in the presence of the source term that\ngenerates the correct UV current with respect to the massive field Di . ψiσ is the propagating degree of freedom\nin the IR. It contains not only an electron-like quasiparticle affected by nearby spin fluctuations, but also a hole\n(with the opposite spin) that is dressed with a doublycharged bosonic mode. Note, we cannot give ψiσ a simple\ninterpretation in terms of bosons or fermions. At best,\nψiσ corresponds to the physical field that is minimally\n\ncoupled to an external gauge field. That is, these are the\nexcitations that couple to light. Hence, it is the field that\nis probed by an ARPES experiment, for example. While\nψiσ was derived earlier, what we did not show explicitly\nis that it does not stand in a one-to-one correspondence\nwith the bare electrons. This can proven exactly by focusing on the positive-definite quantity,\n∗\nψiσ\nψiσ = (1 − niσ̄ )c∗iσ ciσ\n∗\n\n+ (tb − sφ)j M−1\n=\n\nQIR\nh\n− (tb − sφ)∗j M−1\n\n\u0001\n\nc c∗\nji iσ̄ iσ̄\n\n\u0001\n\nji\n\nM−1\n\n\u0001\n\nij\n\n(tb − sφ)j\n\n(2 + c∗iσ̄ ciσ̄ ) M−1\n\n\u0001\n\n(tb − sφ)j ,\n(2.11)\nij\n\nwhich is essentially the conserved charge less the number of doubly occupied sites. Since the second term in\nthe last line is positive definite, the number of low-energy\ncollective modes which are minimally coupled to the electromagnetic gauge field is less than hQIR\nh i = 1 − x. The\nnatural resolution of this conumdrum is that the number operator only counts those excitations that have a\nparticle-like interpretation. That is, the number operator only counts the coherent part of the spectrum. All\nof the stuff mediated by mixing with the upper band is\nentirely incoherent and hence while it can contribute to\nthe current, it is not enumerated by counting the number\nof particles. The remainder of the charge count is carried\nby the last term in Eq. (2.9).\nThis discrepancy is not a surprise when one considers\nthat the total spectral weight of the lower band exceeds\n1 + x38,40 by a dynamical correction, α > 0, that depends on the hopping integral, t. Since there are only\n1 + x electron states in the lower band, and only charge e\nexcitations contribute to the spectral function, there has\nto be some new charge mode to make up the difference.\nWhat ψiσ lays plain is that there are charge e states that\ncontribute to the current that are completely incoherent.\nIt is a composite excitation of φ† and a hole ciσ̄ . In terms\nof the UV variables, this degree of freedom represents the\nbinding of a doublon and a holon. The new composite\nexcitation, φ∗ M−1 Vσ cσ̄ has internal structure and hence\nis orthogonal to the projected electron. Since there is no\nHilbert space for φ, interpreting φ† ciσ̄ in terms of a particle is not possible. It is this additional degree of freedom\nthat creates the Fermi arc structure–that is, the zeros of\nof the Green function. Hence, hidden in ψiσ is an incoherent contribution to the single-particle Green function.\nWhat this discussion makes clear is that φ should not be\nconsidered to be an independent degree of freedom but\nrather one that is strongly coupled to the fermions.\nWhat we have shown thus far is that there is a dynamical contribution to the charge degrees of freedom\nthat are coupled to the source term that generates the\ncurrent. Such entities are the physical degrees of freedom\nthat create holes in the lower band. Consequently, when\none such excitation is removed from the lower band, the\nchange in the spectral weight should also depend on t.\n\n\f5\nHence, the doping level should receive a dynamical contribution. To this end, we defined47 x′ = x + α and\nhence the weight in the UHB is 1 − x′ and the occupied\nand empty parts of the lower band are 1 − x′ and 2x′ ,\nrespectively.\n\nC.\n\nGreen function and the approximations\n\nThus far, all of our statements are exact. Our calculation of the Green function is not, however. To lend credence to our treatment, we state our assumptions clearly\nand up front. The complexity arises in treating the φ\ndegree of freedom. Our treatment is in the spirit of the\nresults obtained in the previous section, namely that φ\nleads to the creation of a new charge e excitation that\nis orthogonal to a projected electron on account of its\ninternal structure.\nHaving determined the generating functional,\n∗\nL′ h [{Jiσ\n, Jiσ }], we proceed to calculate the Green\nfunction. In the functional formalism, it is given by\nGψ (ri − rj , τ )\nδ2\nIR\n∗\n∗ ln Zh [{Jiσ , Jiσ }]\nδJiσ δJjσ\nJ ∗ =J=0\nE\nD\nE D\n\u0001\n= − Tτ ψi (τ )ψj† (0) + δ(τ )c†iσ̄ M−1 ij cj σ̄ , (2.12)\n=−\n\nwhere Tτ represents time ordering and h* * *i stands for the\naverage over all possible paths. Since the second term is\nindependent of time, this term contributes to the incoherent part of the Green function. To understand the\nfirst term which contains both coherent as well as incoherent responses, it is sufficient to focus on the correlator\nbetween the ψiσ 's. Since ψiσ contains a composite excita†\ntion which has a prefactor of t/U , hTτ ψiσ (τ )ψjσ\n(0)i can,\nin principle, be expanded in power of t/U . The presence\nof the projection operator, (1 − niσ̄ ), however, does not\nnecessarily guarantee that it gives a dominant contribution compared to the composite entities.\nFor the purpose of numerical evaluation, we make an\napproximation to the projection operators, following the\nidea developed by Zhang, et al.48 However, the crucial\ndifference is that we make the substitution the bare hole\nconcentration by the effective hole doping level (x → x′ ),\nsince the physical entities coupled to the external gauge\nfield are not the bare electrons but are rather dynamically\ngenerated. Hence our first approximation is\n(A-1)\n\n(1 − niσ̄ )c∗iσ cjσ (1 − nj σ̄ ) → gt c∗iσ cjσ ,\n\nwhere gt = 2x′ /(1 + x′ ). Interestingly, in the strong coupling limit, (U/t ≫ 1), a mean-field approach to KotliarRuckenstein's slave boson construction49 led to the same\nrenormalization factor for the charged fermion but with\nx′ replaced with x. Likewise,\n(A-2)\n\n(1 − niσ̄ )c†iσ (∂τ + * * * )ciσ → gp c†iσ (∂τ + * * * )ciσ .\n\nwhere gp = (1 − x′ )/(1 − x). The multiplicative factors\nare chosen here for internal consistency with the two assumptions.\nSince the action ShIR has all relevant degrees of freedom\nfor the low-energy sector, including the spin singlet fluctuations (bi ) and mixing between the separate Hubbard\nbands (φ), it is reasonable to expand the action in powers\nof t/U . To leading order, the matrix elements (M−1 )ij is\nU −1 δij . From the fact that the collective boson φi only\nhas dynamics through its coupling to the fermions, we\nassume the dynamics of the boson to be frozen. Operationally this assumption breaks down at O(t/U )2 where\nthe explicit dynamics of φ appears as can be seen from\n2\nan expansion of the M matrix, Us 2 φ∗ (∂τ − U + * * * )φ.\nIn fact, this even at O(t/U )2 , the propagator for φ lays\nplain that it has a pole only in the high-energy sector.\nThis justifies the assumption that\n(A-3) Bosonic field, φ, has no dynamics in the LHB.\nIn other words, it alone is highly massive and is not likely\nto propagate in the low-energy sector. Finally, although\nlocal spin ordering might non-negligible, we will assume it\nto be at most ancillary to the strong interaction physics\narising from the coupled boson-fermion terms. This is\na key assumption and certainly not traditional as most\ntreatments of the LHB focus on the spin physics. However, as our emphasis here is on isolating the source of\nzeros in the LHB, demonstrating that the action possesses such modes in the absence of the spin-spin scattering term would suffice to show that such an interaction is\nindeed ancillary to the essential charge physics. As will\nbecome evident, our treatment does in fact show this to\nbe the case. Under these considerations, the effective low\nenergy action turns into\nShIR =\n\nZ\n\nβ\n0\n\n\u001a\n\u0003\n\u0002\ndτ c∗kσ gp (∂τ − μ)δij − gt ǫk ckσ\n\n1\n∗\n(sφ − tb)q (U + 2μ) (sφ − tb)q\nU2\n\u001b\n− (sφ∗q cq−k↑ ck↓ + c.c.) ,\n(2.13)\n\n−\n\nwhere μ denotes the chemical potential, k and q are the\nmomenta, and ǫk = tgij eik*(rj −ri ) . This action has a\nBCS-like coupling and hence will have a Green function\nof the form of Eq. (1.1). That the Green function must\nbe of the form of Eq. (1.1) is not dependent on the assumptions delineated earlier. It relies solely on the fact\nthat the spectral weight in the lower band exceeds 1 + x\nand hence a new charge e state distinct from the projected electrons must be present. Such an excitation can\nonly be a composite.\nConsequently, for a given amplitude of φq , the\nFourier transformation of the two point correlator G =\n\n\f6\n−hTτ ψi (τ )ψj† (0)i becomes\n\n(a)\n\nwhere ωn = (2n + 1)π/β for n ∈ Z, get = gt /gp , and\nsk,q = 1 − (ǫk + ǫq−k )/U . The ± subscript on the self\nenergy arises from the two choices which are possible\nto treat the dynamics of the charge 2e boson. If φi is\ntreated as an independent degree of freedom that can\ncondense, then it can be absorbed as a redefinition of\nthe interaction strength, s → sφ. This will correspond\nto a simple condensation of φ in a non-zero momentum\nparticle-particle channel, hence the + sign in front of the\ng̃t ǫq−k factor in the denominator of the self energy. As\nwill be clear, this is not the interpretation of φ that is\nultimately consistent with the theory outlined here. Alternatively, φ∗i ciσ̄ could be viewed as a new composite\ncharge e excitation that results from dynamical spectral\nweight transfer. With such bound modes, the interaction\nterm, φ∗ c↑ c↓ , can be interpreted as a particle-hole scattering process. To implement this interpretation in the\nGreen function, we note that since φ∗ c↑ c↓ now describes\nthe scattering of an electron cσ off a composite particle φ∗ Vσ cσ̄ /|φ|, the denominator in the one-loop self energy will resemble that of a particle-hole scattering event,\nthereby leading to a − sign in front of the g̃t ǫq−k term\nin the denominator of the self energy. In additon, the\nellipse in Eq. (2.14a) represents the terms that originate\nfrom the mixing between the composite excitations and\nthe projected electron, which are at least suppressed by\nthe factor t/U . The number get results from the rescal1/2\ning gp ciσ → ciσ . Since get = gt /gp ≃ 2x′ , the t/U\ncorrections in Eq. (2.14a) are comparable to the leading\nterm only for x′ < t/2U ∼ 0.05. For example, at halffilling, the Green function only has the t/U term and the\nspectral weight is governed entirely by the mixing between the projected and composite excitations as shown\npreviously46 . In the current treatment, we will explore\nentirely the contribution from the leading term which is\nof the form of Eq. (1.1).\nD.\n\nFree-energy Minimum approach to 2e boson\n\nEvaluating the Green function is equivalent to a\nrandom-matrix problem. In the most general case, the\nfield φi must be integrated over with a separate value\non each site. However, such a multi-variable integration\nis not tractable in any dimension. From the observation that the collective boson is not canonical, that is, it\ndoes not have its own kinetics, it was previously conjectured that the spatially homogeneous configuration was\nthe most prominent candidate for the ground state35,46 .\n\n-0.1\nφ0=0.1\n0.4\n0.5\n0.6\n0.7\n0.8\n1.0\n\n-0.2\n\n(0,0)\n\n(π,π)\n(qx, qy)\n\n1.2\n\n(π, 0)\n\n(b)\n\nπ\n1.0\n0.8\n0.6\n\n(0,0)\n\nqy\n\n(2.14b)\n\nProbability(φ0)\n\ns2k,q φq φ∗q\nΣ± (iωn , k) =\n,\niωn − μ ± get ǫq−k\n\nΔF (in unit of t)\n\n0.0\n\nt\nget\n+ (* * * ),\nG(iωn , k) =\niωn − μ − get ǫk − Σ± (iωn , k) U\n(2.14a)\n\n0\n0\n\nπ\nqx\n\n0.4\n0.2\n0.0\n0.4\n\n0.6\n\n0.8\n\n1.0\n\n1.2\n\n1.4\n\nφ0\n\nFIG. 1. (Color online) Free energy minimization and probability distribution of charge 2e boson. (a) Plotted here is\nthe ∆F = F (φ0 eiq*r ) − F (φ0 ) as a function of momentum q.\nφ0 is the magnitude of the charge 2e boson. As is evident,\nthe free energy is strongly dependent on momentum. As φ0\nincreases, the minimum of the free energy shifts to (π, π).\nThis corresponds to a sign change for the bosonic excitation\naround a plaquette. (b) Shown here is the probability distribution for φ0 evaluated from the IR action by the relation,\nR\nIR\nP (|φ|) = 1/ZhIR D[{c, c∗ }]e−Sh . The maximum occurs at\nφ0 ≈ 1.2 where the corresponding momentum that minimizes\nthe free energy is q = (π, π).\n\nEven though such an approach was successful in capturing some experimental46 findings, it still leaves an open\nquestion whether the homogeneous solution minimizes\nthe free energy. To this end, we explore some inhomogeneous solutions for φi to see where the free-energy is a\nminimum. In particular, we explore a staggered configuration, φi = eiq*ri |φ0 |. It should be noted that a particular choice of the configuration of φ does not correspond to\nspontaneous symmetry breaking, since the bosonic mode\nis in lack of inherent dynamics.\nIn Fig. 1, we directly compute the free energy difference between a configuration with a spatial texture\nand the homogeneous state, ∆F = F (φ0 eiq*r ) − F (φ0 ),\nwhere q, determines the spatial dependence of φi . Except for small values of φ0 in which the homogeneous\nsolution minimizes the free energy, the distinct minimum\n\n\f7\n\n(2.15)\nThe probability distribution function P (φ) is shown in\nFig. 1b. For completeness, we present in Fig. 2 the band\ndispersion corresponding to the maximum in the spectral function obtained from Eq. (2.14a) for three different\ncases: 1) homogeneous solution, 2) staggered (π, π) phase\nof φi in the particle-particle channel, Σ+ and 3) staggered solution in particle-hole channel, Σ− . For the homogeneous phase, we find a hard gap, Fig. 2(a), because\nno momentum states cross the chemical potential. However, as shown earlier, the homogeneous solution does\nnot correspond to a minimum in the free energy. Consider the staggered solutions shown in panels Fig. 2(b)\nand Fig. 2(c). Fig. 2(b) shows that even a staggered\nsolution in the particle-particle channel, a gap does not\noccur at the (π, 0) region of the Brillouin zone. There\nis also a crossing along the zone diagonal. This indicates that a simple condensation of φ in a non-zero momentum particle-particle channel cannot give rise to the\nnodal/anti-nodal dichotomy. There is in fact a clear reason why φ cannot be treated as an independent degree of\nfreedom that can condense. There is a one-to-one correspondence between Eq. (2.10) and its analogue (Eq. (19)\nof Ref.39 ) in the standard perturbative treatment of the\nHubbard model. In essence, the charge 2e boson replaces\na string of operators that account for the mixing of double\noccupancy into the lower band. This is why this approach\nis simpler. As it would be completely incorrect to replace that string of operators with an average value, it is\nequally wrong to treat φ as a variable that can condense.\nIn fact, it is well known40 that such mean-field truncations fail to describe dynamical spectral weight transfer\nin the Hubbard model.\nConsider the third dispersion, Fig. 2(c) in which φ is\n\n(a)\n\nHigh\n\nEnergy (t)\n\n1.5\n1.0\n0.5\n0.0\n\n-0.5\nLow\n\n(b)\n\nHigh\n\nEnergy (t)\n\n1.5\n1.0\n0.5\n0.0\n\n-0.5\nLow\n\n(c)\n\nHigh\n\n1.5\n\nEnergy (t)\n\noccurs at (π, π) when the magnitude of the bosonic field,\nφ0 , approaches unity. This is significant because the\nprobability distribution of φ0 computed from P (|φ|) =\nR\nIR\n1/ZhIR D[{c, c∗ }]e−Sh , has a distinct maximum precisely at the value of φ where the (π, π) solution minimizes the free energy. This state of affairs obtains because a quick inspection of the action reveals that for a\nstaggered configuration of φ, the φ† b term actually vanishes. This results in a lowering of the energy relative to\nthe homogeneous solution.\nThat the (π, π) configuration of φi minimizes the free\nenergy is highly significant because the evaluation any\nintegral over φi will be dominated by the staggered solution. What about the single-particle Green function?\nIn our previous treatment of this problem in which we\nassumed that the mixing with the UHB was mediated\nby a homogeneous boson, φ0 for all sites, we obtained\na completely gapped structure at the chemical potential\nfor the spectral function. Given that q = (π, π) is the\nblobal minimum, our expression for the Green function\nsimplifies to\nZ\nG(iωn , k) = d|φ||φ|P (φ)G(iωn , k)|φq =δq,π |φ| .\n\n1.0\n0.5\n0.0\n\n-0.5\nLow\n\nFIG. 2. (Color online) The low energy band dispersion along\nhigh symmetry directions for (a) a homogeneous configuration, φi = φ0 , (b) a staggered configuration (φi = |φ0 |eıπ*ri )\nevaluated by Eq. (2.14a), and (c) a staggered one evaluated by\nEq. (2.14a). Here, we take the broadening factor η = 0.025t\nfor a typical value U/t = 10, t′ /t = −0.3, t′′ /t = 0.1, and\nthe bare hole doping level as x = 0.12. In the evaluation, the\nparameters, α = x′ − x are taken from the numerical estimates of the number of double occupancies from Liebsch and\nTong50 .\n\nthe mediator of a composite charge e state. This corresponds to a self-energy given by Σ− . The break in the\ndispersion just above the chemical potential is not followed by a re-entrant crossing at a higher momentum.\nSuch a re-entrant crossing would give rise to a closed\nFermi surface. It is the presence of the additional propagating degree of freedom which thwarts this re-entrance.\nIn addition, there is no crossing at (π, 0), but a broad\nincoherent feature indicative of the pseudogap. Since the\nbreak-up of the bound state results in a band crossing\nnear the (π, 0) region, the root cause of the pseudogap is\nthe bound state formed between the bosonic field, φ and\na hole as we have advocated previously46 . Consequently,\nthe pseudogap problem is one of confinement. The corresponding Fermi surfaces are shown in Fig. 3. The arc-like\nstructure is evident. The line of zeros is given by the divergence of the self-energy and hence it is doublon-holon\nbinding that is responsible for killing the intensity on the\nback side of the arc. The Fermi surfaces evolve smoothly\nfor the doping levels shown from x = 0.05 to x = 0.18.\n\n\f8\n1.0\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\n0.5\n\n0.0\n1.0\n\nHigh\n\n0.5\n\nLow\n0.0\n\n0.5\n\n1.0 0.0\n\n0.5\n\n1.0\n\nFIG. 3. (Color online) The spectral function of the low energy\ntheory for each hole doping level, (a) x = 0.05, (b) x = 0.08,\n(c) x = 0.12, and (d) x = 0.18. In the present figures, an\nincoherent background is removed and the intensities of the\nspectral function are normalized for the first quadrant of the\nfull Brillouin zone.\n\nNote also the broad feature at the zone boundary. While\nit is tempting to interpret the broad peak near the antinodal region as an electron pocket, the lack of coherent\nexcitations makes this view untenable.\nIII.\n\nFINAL REMARKS\n\nThe key point this work demonstrates is that two types\nof charge carriers go into forming Fermi arcs. The projected electrons are present in any low-energy reduction\nof the Hubbard model and create the spectral weight on\nthe high-intensity side of the arc. The zeros correspond\nto composite excitations which are present as a result of\ndynamical spectral weight transfer and hence are present\nonly if the UHB is retained or treated appropriately.\nSuch composite excitations enter the self-energy through\nthe particle-hole channel, as the relevant scattering pro-\n\n1\n\n2\n\n3\n\ncess is that of a fermion from the composite excitation.\nBoth of these features leading to an effective two-fluid\nmodel46,51 are present within a Wilsonian reduction of\nthe high-energy scale in the Hubbard model. The treatment we have derived here should be valid as long as the\nUHB provides a relevant perturbation to the physics of\nthe LHB. Hence, it cannot describe the crossover to the\nFermi liquid regime in which φ is unbound. Experimentally, a decoupling of the UHB from the LHB appears to\ntake place around x ≈ 0.2552. Accompanying the collapse is a transition from a small Fermi surface scaling\nwith x to a large one with effective area 1−x. The precise\nnature of this transition will be the subject of a future\nstudy. However, a prediction of this work is that the in\nthe pseudogap regime, the volume of the Fermi arc region should be given by x′ rather than x. This follows\nfrom the fact that the number of particle-like excitations\nthat minimally couple to the electromagnetic gauge is less\nthan 1 − x′ < 1 − x. Hence, the hole Fermi surface should\nbe given by x′ . High precision ARPES measurements can\nbe employed to verify this result.\nSince our scheme of two type of charge carriers, one\ngiving rise to zeros and the other to poles, seems quite\ngeneral, it is tempting to rewrite the IR theory in terms\nof the composite and projected excitations. This would\nrequire integrating in an additional field for the composite, fiσ degree of freedom. The composite fermion is not\ncanonical, however, and treating it as such would destroy\nthe key feature leading to a suppression of the spectral\non the back-side of the arc. Thus far, we have found no\nconsistent way of doing this. Hence, an open problem remains precisely how the new composite excitation should\nbe treated. But that it is present in any standard model\nof Fermi arcs is not in doubt.\n\nA. G. Loeser, Z.-X. Shen, D. S. Dessau, D. S. Marshall,\nC. H. Park, P. Fournier, and A. Kapitulnik, Science 273,\n325 (1996)\nD. S. Marshall, D. S. Dessau, A. G. Loeser, C.-H. Park,\nA. Y. Matsuura, J. N. Eckstein, I. Bozovic, P. Fournier,\nA. Kapitulnik, W. E. Spicer, and Z.-X. Shen, Phys. Rev.\nLett. 76, 4841 (1996)\nM. R. Norman, H. Ding, M. Randeria, J. C. Campuzano,\nT. Yokoya, T. Takeuchi, T. Takahashi, T. Mochiku,\n\nACKNOWLEDGMENTS\n\nWe thank P. Johnson for sharing his data with us and\nextensive discussions and P. Ghaemi for his comments\non this manuscript and for pointing out Ref. 41. We\nalso acknowledge financial support from the NSF-DMR0940992 and DMR-1104909 and the Center for Emergent\nsuperconductivity, a DOE Energy Frontier Research Center, Award Number DE-AC0298CH1088.\n\nK. Kadowaki, P. Guptasarma, and D. G. Hinks, Nature\n392, 157 (1998)\nKey: norman98\nAnnotation: 10.1038/32366.\n4\n\n.\nA. Kanigel, M. R. Norman, M. Randeria, U. Chatterjee,\nS. Souma, A. Kaminski, H. M. Fretwell, S. Rosenkranz,\nM. Shi, T. Sato, T. Takahashi, Z. Z. Li, H. Raffy, K. Kad-\n\n\f9\nowaki, D. Hinks, L. Ozyuzer, and J. C. Campuzano, Nat.\nPhys. 2, 447 (2006)\nKey: KanigelA06\nAnnotation: 10.1038/nphys334.\n5\n\n6\n\n7\n\n8\n\n.\nM. R. Norman, A. Kanigel, M. Randeria, U. Chatterjee,\nand J. C. Campuzano, Phys. Rev. B 76, 174501 (2007)\nP. D. C. King, J. A. Rosen, W. Meevasana, A. Tamai,\nE. Rozbicki, R. Comin, G. Levy, D. Fournier, Y. Yoshida,\nH. Eisaki, K. M. Shen, N. J. C. Ingle, A. Damascelli, and\nF. Baumberger, Phys. Rev. Lett. 106, 127005 (2011)\nH.-B. Yang, J. D. Rameau, Z.-H. Pan, G. D. Gu, P. D.\nJohnson, H. Claus, D. G. Hinks, and T. E. Kidd, Phys.\nRev. Lett. 107, 047003 (2011)\nG. Deutscher, Nature 397, 410 (1999)\nKey: Deutscher99\nAnnotation: 10.1038/17075.\n\n9\n\n.\nM. Le Tacon, A. Sacuto, A. Georges, G. Kotliar, Y. Gallais,\nD. Colson, and A. Forget, Nat Phys 2, 537 (2006)\nKey: LeTacon06\nAnnotation: 10.1038/nphys362.\n\n10\n\n11\n\n12\n\n.\nK. Tanaka, W. S. Lee, D. H. Lu, A. Fujimori, T. Fujii,\nRisdiana, I. Terasaki, D. J. Scalapino, T. P. Devereaux,\nZ. Hussain, and Z.-X. Shen, Science 314, 1910 (2006)\nT. Kondo, T. Takeuchi, A. Kaminski, S. Tsuda, and\nS. Shin, Phys. Rev. Lett. 98, 267004 (2007)\nM. C. Boyer, W. D. Wise, K. Chatterjee, M. Yi, T. Kondo,\nT. Takeuchi, H. Ikuta, and E. W. Hudson, Nat. Phys. 3,\n802 (2007)\nKey: Boyer07\nAnnotation: 10.1038/nphys725.\n\n13\n\n.\nJ. Meng, G. Liu, W. Zhang, L. Zhao, H. Liu, X. Jia, D. Mu,\nS. Liu, X. Dong, J. Zhang, W. Lu, G. Wang, Y. Zhou,\nY. Zhu, X. Wang, Z. Xu, C. Chen, and X. J. Zhou, Nature\n462, 335 (2009)\nKey: MengJ09\nAnnotation: 10.1038/nature08521.\n\n14\n\n.\nS. E. Sebastian, N. Harrison, E. Palm, T. P. Murphy, C. H.\nMielke, R. Liang, D. A. Bonn, W. N. Hardy, and G. G.\nLonzarich, Nature 454, 200 (2008)\nKey: SebastianS08\nAnnotation: 10.1038/nature07095.\n\n15\n\n16\n\n.\nC. Jaudet, D. Vignolles, A. Audouard, J. Levallois,\nD. LeBoeuf, N. Doiron-Leyraud, B. Vignolle, M. Nardone,\nA. Zitouni, R. Liang, D. A. Bonn, W. N. Hardy, L. Taillefer, and C. Proust, Phys. Rev. Lett. 100, 187005 (2008)\nD. LeBoeuf, N. Doiron-Leyraud, J. Levallois, R. Daou,\nJ. B. Bonnemaison, N. E. Hussey, L. Balicas, B. J.\nRamshaw, R. Liang, D. A. Bonn, W. N. Hardy, S. Adachi,\nC. Proust, and L. Taillefer, Nature 450, 533 (2007)\nKey: leBoeufD07\nAnnotation: 10.1038/nature06332.\n.\n\n17\n\n18\n\nA. F. Bangura, J. D. Fletcher, A. Carrington, J. Levallois,\nM. Nardone, B. Vignolle, P. J. Heard, N. Doiron-Leyraud,\nD. LeBoeuf, L. Taillefer, S. Adachi, C. Proust, and N. E.\nHussey, Phys. Rev. Lett. 100, 047004 (2008)\nN. Doiron-Leyraud, C. Proust, D. LeBoeuf, J. Levallois,\nJ.-B. Bonnemaison, R. Liang, D. A. Bonn, W. N. Hardy,\nand L. Taillefer, Nature 447, 565 (2007)\nKey: DN07\nAnnotation: 10.1038/nature05872.\n\n19\n\n20\n\n21\n\n22\n\n23\n\n24\n\n25\n26\n27\n28\n29\n30\n\n31\n\n32\n\n33\n\n34\n35\n\n36\n\n37\n\n38\n39\n\n40\n\n41\n\n42\n\n43\n\n44\n\n45\n46\n\n47\n\n.\nY. Yamaji and M. Imada, Phys. Rev. Lett. 106, 016404\n(2011)\nC. Berthod, T. Giamarchi, S. Biermann, and A. Georges,\nPhys. Rev. Lett. 97, 136401 (2006)\nT. D. Stanescu and G. Kotliar, Phys. Rev. B 74, 125110\n(2006)\nS. Sakai, Y. Motome, and M. Imada, Phys. Rev. B 82,\n134505 (2010)\nK.-Y. Yang, T. M. Rice, and F.-C. Zhang, Phys. Rev. B\n73, 174501 (2006)\nT. D. Stanescu, P. Phillips, and T.-P. Choy, Phys. Rev. B\n75, 104503 (2007)\nI. Dzyaloshinskii, Phys. Rev. B 68, 085113 (2003)\nA. Rosch, Eur. Phys. J. B 59, 495 (2007)\nJ. Kokalj and P. Prelovšek, Phys. Rev. B 75, 045111 (2007)\nP. P. Kokalj, J., Eur. Phys. J. B 63, 431 (2008)\nY. Qi and S. Sachdev, Phys. Rev. B 81, 115129 (2010)\nN. Harrison, R. D. McDonald, and J. Singleton, Phys. Rev.\nLett. 99, 206406 (2007)\nR. M. Konik, T. M. Rice, and A. M. Tsvelik, Phys. Rev.\nLett. 96, 086407 (2006)\nE. G. Moon and S. Sachdev, Phys. Rev. B 80, 035117\n(2009)\nM. Khodas and A. M. Tsvelik, Phys. Rev. B 81, 155102\n(2010)\nK. G. Wilson, Phys. Rev. B 4, 3174 (1971)\nR. G. Leigh, P. Phillips, and T.-P. Choy, Phys. Rev. Lett.\n99, 046404 (2007)\nT.-P. Choy, R. G. Leigh, P. Phillips, and P. D. Powell,\nPhys. Rev. B 77, 014512 (2008)\nT.-P. Choy, R. G. Leigh, and P. Phillips, Phys. Rev. B 77,\n104524 (2008)\nA. B. Harris and R. V. Lange, Phys. Rev. 157, 295 (1967)\nH. Eskes, A. M. Oleś, M. B. J. Meinders, and W. Stephan,\nPhys. Rev. B 50, 17980 (1994)\nM. B. J. Meinders, H. Eskes, and G. A. Sawatzky, Phys.\nRev. B 48, 3916 (1993)\nX.-G.\nWen\nand\nP.\nA.\nLee,\nPhys. Rev. Lett.\n76,\n503\n(Jan\n1996),\nhttp://link.aps.org/doi/10.1103/PhysRevLett.76.503\nT.-K. Ng, Phys. Rev. B 71, 172509 (May 2005),\nhttp://link.aps.org/doi/10.1103/PhysRevB.71.172509\nY.\nYamaji\nand\nM.\nImada,\nPhys. Rev. Lett.\n106,\n016404\n(Jan\n2011),\nhttp://link.aps.org/doi/10.1103/PhysRevLett.106.016404\nP. Ghaemi, T. Senthil, and P. Coleman, Phys. Rev. B 77,\n245108 (2008)\nD. Bohm and D. Pines, Phys. Rev. 92, 609 (1953)\nP. Phillips, T.-P. Choy, and R. G. Leigh, Rep. Prog. Phys.\n72, 036501 (2009)\nS. Chakraborty, S. Hong, and P. Phillips, Phys. Rev. B 81,\n235135 (2010)\n\n\f10\n48\n\n49\n\n50\n\nF. C. Zhang, C. Gros, T. M. Rice, and H. Shiba, Supercond. Sci. Technol. 1, 36 (1988)\nG. Kotliar and A. E. Ruckenstein, Phys. Rev. Lett. 57,\n1362 (1986)\nA. Liebsch and N.-H. Tong, Phys. Rev. B 80, 165126 (2009)\n\n51\n\n52\n\nS. Chakraborty and P. Phillips, Phys. Rev. B 80, 132505\n(2009)\nD. C. Peets, D. G. Hawthorn, K. M. Shen, Y.-J. Kim, D. S.\nEllis, H. Zhang, S. Komiya, Y. Ando, G. A. Sawatzky,\nR. Liang, D. A. Bonn, and W. N. Hardy, Phys. Rev. Lett.\n103, 087402 (2009)\n\n\f"}