{"id": "http://arxiv.org/abs/0706.4157v1", "guidislink": true, "updated": "2007-06-28T07:43:02Z", "updated_parsed": [2007, 6, 28, 7, 43, 2, 3, 179, 0], "published": "2007-06-28T07:43:02Z", "published_parsed": [2007, 6, 28, 7, 43, 2, 3, 179, 0], "title": "Adaptive dynamics in logistic branching populations", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0706.1461%2C0706.4208%2C0706.3820%2C0706.3247%2C0706.3715%2C0706.1630%2C0706.2184%2C0706.2776%2C0706.1761%2C0706.4170%2C0706.0402%2C0706.3952%2C0706.3981%2C0706.3288%2C0706.0389%2C0706.0604%2C0706.3620%2C0706.3965%2C0706.1982%2C0706.4127%2C0706.3137%2C0706.4453%2C0706.0214%2C0706.0523%2C0706.1507%2C0706.1164%2C0706.4190%2C0706.3085%2C0706.0788%2C0706.0168%2C0706.1816%2C0706.0757%2C0706.3650%2C0706.4277%2C0706.1881%2C0706.1149%2C0706.1907%2C0706.0360%2C0706.2211%2C0706.1515%2C0706.1390%2C0706.0658%2C0706.1872%2C0706.3905%2C0706.3527%2C0706.4108%2C0706.2144%2C0706.0525%2C0706.0184%2C0706.1897%2C0706.3322%2C0706.2257%2C0706.0424%2C0706.0541%2C0706.2289%2C0706.3103%2C0706.0283%2C0706.3665%2C0706.3740%2C0706.3366%2C0706.3767%2C0706.2883%2C0706.0355%2C0706.4157%2C0706.2966%2C0706.2861%2C0706.3525%2C0706.0654%2C0706.1411%2C0706.1576%2C0706.1941%2C0706.2577%2C0706.3918%2C0706.0516%2C0706.2213%2C0706.0495%2C0706.3419%2C0706.1657%2C0706.2112%2C0706.0975%2C0706.0187%2C0706.1629%2C0706.3225%2C0706.2245%2C0706.3005%2C0706.0866%2C0706.1558%2C0706.3186%2C0706.0342%2C0706.0418%2C0706.2593%2C0706.3395%2C0706.3711%2C0706.1965%2C0706.2376%2C0706.0507%2C0706.2410%2C0706.1838%2C0706.2544%2C0706.3437%2C0706.3279&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Adaptive dynamics in logistic branching populations"}, "summary": "We consider a trait-structured population subject to mutation, birth and\ncompetition of logistic type, where the number of coexisting types may\nfluctuate. Applying a limit of rare mutations to this population while keeping\nthe population size finite leads to a jump process, the so-called `trait\nsubstitution sequence', where evolution proceeds by successive invasions and\nfixations of mutant types. The probability of fixation of a mutant is\ninterpreted as a fitness landscape that depends on the current state of the\npopulation. It was in adaptive dynamics that this kind of model was first\ninvented and studied, under the additional assumption of large population.\nAssuming also small mutation steps, adaptive dynamics' theory provides a\ndeterministic ODE approximating the evolutionary dynamics of the dominant trait\nof the population, called `canonical equation of adaptive dynamics'. In this\nwork, we want to include genetic drift in this models by keeping the population\nfinite. Rescaling mutation steps (weak selection) yields in this case a\ndiffusion on the trait space that we call `canonical diffusion of adaptive\ndynamics', in which genetic drift (diffusive term) is combined with directional\nselection (deterministic term) driven by the fitness gradient. Finally, in\norder to compute the coefficients of this diffusion, we seek explicit\nfirst-order formulae for the probability of fixation of a nearly neutral mutant\nappearing in a resident population. These formulae are expressed in terms of\n`invasibility coefficients' associated with fertility, defense, aggressiveness\nand isolation, which measure the robustness (stability w.r.t. selective\nstrengths) of the resident type. Some numerical results on the canonical\ndiffusion are also given.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0706.1461%2C0706.4208%2C0706.3820%2C0706.3247%2C0706.3715%2C0706.1630%2C0706.2184%2C0706.2776%2C0706.1761%2C0706.4170%2C0706.0402%2C0706.3952%2C0706.3981%2C0706.3288%2C0706.0389%2C0706.0604%2C0706.3620%2C0706.3965%2C0706.1982%2C0706.4127%2C0706.3137%2C0706.4453%2C0706.0214%2C0706.0523%2C0706.1507%2C0706.1164%2C0706.4190%2C0706.3085%2C0706.0788%2C0706.0168%2C0706.1816%2C0706.0757%2C0706.3650%2C0706.4277%2C0706.1881%2C0706.1149%2C0706.1907%2C0706.0360%2C0706.2211%2C0706.1515%2C0706.1390%2C0706.0658%2C0706.1872%2C0706.3905%2C0706.3527%2C0706.4108%2C0706.2144%2C0706.0525%2C0706.0184%2C0706.1897%2C0706.3322%2C0706.2257%2C0706.0424%2C0706.0541%2C0706.2289%2C0706.3103%2C0706.0283%2C0706.3665%2C0706.3740%2C0706.3366%2C0706.3767%2C0706.2883%2C0706.0355%2C0706.4157%2C0706.2966%2C0706.2861%2C0706.3525%2C0706.0654%2C0706.1411%2C0706.1576%2C0706.1941%2C0706.2577%2C0706.3918%2C0706.0516%2C0706.2213%2C0706.0495%2C0706.3419%2C0706.1657%2C0706.2112%2C0706.0975%2C0706.0187%2C0706.1629%2C0706.3225%2C0706.2245%2C0706.3005%2C0706.0866%2C0706.1558%2C0706.3186%2C0706.0342%2C0706.0418%2C0706.2593%2C0706.3395%2C0706.3711%2C0706.1965%2C0706.2376%2C0706.0507%2C0706.2410%2C0706.1838%2C0706.2544%2C0706.3437%2C0706.3279&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We consider a trait-structured population subject to mutation, birth and\ncompetition of logistic type, where the number of coexisting types may\nfluctuate. Applying a limit of rare mutations to this population while keeping\nthe population size finite leads to a jump process, the so-called `trait\nsubstitution sequence', where evolution proceeds by successive invasions and\nfixations of mutant types. The probability of fixation of a mutant is\ninterpreted as a fitness landscape that depends on the current state of the\npopulation. It was in adaptive dynamics that this kind of model was first\ninvented and studied, under the additional assumption of large population.\nAssuming also small mutation steps, adaptive dynamics' theory provides a\ndeterministic ODE approximating the evolutionary dynamics of the dominant trait\nof the population, called `canonical equation of adaptive dynamics'. In this\nwork, we want to include genetic drift in this models by keeping the population\nfinite. Rescaling mutation steps (weak selection) yields in this case a\ndiffusion on the trait space that we call `canonical diffusion of adaptive\ndynamics', in which genetic drift (diffusive term) is combined with directional\nselection (deterministic term) driven by the fitness gradient. Finally, in\norder to compute the coefficients of this diffusion, we seek explicit\nfirst-order formulae for the probability of fixation of a nearly neutral mutant\nappearing in a resident population. These formulae are expressed in terms of\n`invasibility coefficients' associated with fertility, defense, aggressiveness\nand isolation, which measure the robustness (stability w.r.t. selective\nstrengths) of the resident type. Some numerical results on the canonical\ndiffusion are also given."}, "authors": ["Nicolas Champagnat", "Amaury Lambert"], "author_detail": {"name": "Amaury Lambert"}, "author": "Amaury Lambert", "links": [{"title": "doi", "href": "http://dx.doi.org/10.4064/bc80-0-14", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/0706.4157v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0706.4157v1", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "math.PR", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "math.PR", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0706.4157v1", "affiliation": "FESE", "arxiv_url": "http://arxiv.org/abs/0706.4157v1", "arxiv_comment": null, "journal_reference": "Banach Center Publ., vol. 80 (2008) 235-244", "doi": "10.4064/bc80-0-14", "fulltext": "arXiv:0706.4157v1 [math.PR] 28 Jun 2007\n\nAdaptive dynamics in logistic branching\npopulations\nNicolas Champagnat∗, Amaury Lambert†\nOctober 25, 2018\n\nMSC 2000 subject. Primary 60J80; secondary 60J25, 60J70, 60J75,\n60J85, 60K35, 92D10, 92D15, 92D25, 92D40.\n\n1\n\nIntroduction\n\nThe recent biological theory of adaptive dynamics [6,9] proposes a description of the long term evolution of an asexual population by putting emphasis\non the ecological interactions between individuals, in contrast with classical population genetics models which focus on the genetic structure of the\npopulation. The basic models are individual-based models in which the\npopulation dynamics is precisely described and includes birth, death, competition and mutation. The basic idea of the theory of adaptive dynamics\nis to try to get insights about the interplay between ecology and evolution\nby studying the invasion of a single mutant type appearing in a simplified\n(monotype stable) resident population. The evolution of the population can\nthen be described as a sequence of mutant invasions in the population. If\nthe resident type goes extinct when the mutant type invades (we say that\nthe mutant type fixates), the evolution is described by the so-called 'trait\nsubstitution sequence' (TSS) [10]. This appraoch has revealed powerful to\npredict the qualitative behaviour of complicated evolutionary dynamics. In\nparticular, it allows to determine the (local) direction of evolution in the\nspace of phenotypic traits (or simply traits) from the individual ecological\n∗\nProject-team TOSCA, INRIA Sophia Antipolis\ne-mail: Nicolas.Champagnat@sophia.inria.fr\n†\nUnit of Mathematical Evolutionary Biology, Laboratoire d'Écologie et Évolution, Université Pierre et Marie Curie-Paris 6 and École Normale Supérieure, Paris\ne-mail: amaury.lambert@ens.fr\n\n1\n\n\fparameters, and to predict and explain the phenomenon of evolutionary\nbranching [10], where a population, initially composed of individuals with\ntraits concentrated around a single trait value, divides into two (or more)\nsubpopulations concentrated around distinct trait values that stably coexist\nbecause of their ecological interactions. The description of this phenomenon\nis an important achievement of this theory, as well as the 'canonical equation of adaptive dynamics' [3], which describes the evolution of the dominant\ntrait of the population as a deterministic \"hill-climbing\" process on a fitness\nlandscape which depends on the current state of the population (see (1)\nbelow).\nMore formally, as soon as eternal coexistence of two or more types is not\npermitted by the model, the evolution can be described by the sequences\n(Tn )n and (Vn )n , where Tn is the n-th time where the population becomes\nmonomorphic (i.e. composed of only one type) and Vn is the surviving type\nat time Tn . The sequence (Vn ) is the above-mentionned TSS. It is possible\nto prove the convergence of an individual-based model to the TSS under\ntwo biologically motivated assumptions [10,1]. First, the assumption of rare\nmutations guarantees that, in the timescale of mutations, the widths of\ntime intervals during which the population is polymorphic vanish, so that\nthere is only one type surviving at any time t. To prevent the population\nfrom rapidly becoming extinct in the new timescale, one also has to rescale\npopulation sizes, thereby making the assumption of large populations.\nSubsequently, the TSS is a Markov jump process on the trait space whose\nsemigroup is shown [1] to depend on the invasion fitnesses (as defined in [9])\nf (x, y), x, y ∈ X , where f (x, y) is defined as the expected growth rate of\na single individual of type y - the mutant - entering a monomorphic\npopulation of type x 'at equilibrium' - the residents. Note that this fitness\nis not given a priori, but derived from the microscopic model of individual\ninteractions. Because of the assumption of large population, the sign of this\nfitness determines the possibility of invasion of a mutant type: if f (x, y) < 0,\nthe mutant type y cannot invade a resident population of type x. Thus,\nevolution proceeds by successive invasions of (only) advantageous mutant\ntypes replacing the resident one.\nThe 'canonical equation of adaptive dynamics' [3], which describes the\nevolution of a one-dimensional trait x as the solution of the following ODE,\nis obtained from the TSS in the limit of small mutations:\n1\n∂\ndx\n= σ(x)2 μ(x)n̄(x) f (x, x),\ndt\n2\n∂y\n\n(1)\n\nwhere σ(x)2 stands for the (rescaled) variance of the mutation step law,\n2\n\n\fn̄(x) for the equilibrium size of a pure x-type population, and f (x, y) for the\ninvasion fitness mentioned above. Note how only advantageous types get\nfixed (the trait follows the fitness gradient) and how the fitness landscape\ny 7→ f (x, y) depends on the current state x of the population.\nHowever, it is well-known that slightly deleterious types can be fixed by\nchance in finite populations. This phenomenon is known under the name of\ngenetic drift. Depending on the strength of genetic drift, selection is said to\nbe strong (genetic drift has negligible effects) or weak. In the large population asymptotic from which the TSS of adaptive dynamics is derived, genetic\ndrift has negligible impact compared to the action of selection. Therefore,\nthe fixation of slightly deleterious types cannot be observed. Our goal here\nis to include genetic drift in the adaptive dynamics models by considering\nfinite populations under weak selection. We continue using the bottom-up\napproach of adaptive dynamics; that is, model (macroscopic) evolution from\n(microscopic) populations. In particular, we allow the population sizes to\nfluctuate randomly through time and we aim to reconstruct a fitness function\nfrom the microscopic parameters.\nAfter the description of the model (Section 2), we derive a new TSS in\nthe limit of rare mutations (Section 3), from which a limit of small mutations gives what we call the 'canonical diffusion of adaptive dynamics'\n(Section 4). The coefficients of this diffusion involve the first-order derivatives of the fixation probabilities, which are computed in Section 5 as a linear\ncombination of four fundamental components associated to fertility, defence,\naggressiveness and isolation. New numerical results on the robustness of the\npopulation with respect to these fundamental components are also given, as\nwell as some consequences on the canonical diffusion of adaptive dynamics\nin large populations.\n\n2\n\nThe microscopic model\n\nWe will restrict here to logistic interaction. More general models are considered in [2].\nA monotype (binary) logistic branching process (LBP, see [7]) with dynamical parameters (b, c, d) is a Markov chain in continuous time (Xt ; t ≥ 0)\nwith nonnegative integer values and transition rates\n\nbi\nif\nj =i+1\n\n\n\nci(i − 1)\nif\nj =i−1\nqij =\n−i(b + c(i − 1)) if\nj=i\n\n\n\n0\notherwise.\n3\n\n\fThe non-linear term ci(i−1) describes competition mortality due to random\nencounters between individuals. Other terms correspond to independent\nbirth events with constant individual rates. This Markov chain is positiverecurrent and converges in distribution to a r.v. ξ, where ξ is a Poisson\nvariable of parameter θ := b/c conditioned on being nonzero\nP(ξ = i) =\n\ne−θ θ i\n1 − e−θ i!\n\ni ≥ 1.\n\n(2)\n\nWe consider in the sequel, a multitype asexual birth and death process with mutation, generalizing this LBP. At any time t, the population is\ncomposed of a finite number N (t) of individuals characterized by their phenotypic traits x1 (t), . . . , xN (t) (t) belonging to a given trait space X , assumed\nto be a closed subset of Rk . The population state at time t is represented\nby the counting measure on X\nN (t)\n\nνt =\n\nX\n\nδxi (t) .\n\ni=1\n\nThe population dynamics is governed by the following parameters.\n• b(x) is the rate of birth from an individual of type x. The function b\nis assumed to be Cb2 .\n• c(x, y) is the rate of death of an individual of type x due to the competition with another individual of type y. Therefore, the total death\nrate\nof an individual of type x in a population ν may be written as\nR\nc(x, y)(ν(dy) − δx (dy)). In this expression, the Dirac mass at x substracted to the measure ν means that the individual does not compete\nwith himself. The function c is assumed to be Cb2 and bounded away\nfrom 0 on X 2 .\n• γμ(x) is the probability that a birth from an individual with trait x\nproduces a mutant individual, where μ(x) ∈ [0, 1] and where γ ∈ (0, 1]\nis a parameter scaling the frequence of mutations. When there is no\nmutation, the new individual inherits the trait of its progenitor. In\nSection 3, we will be interested in the limit of rare mutations (γ → 0).\n• M (x, dh) is the law of the trait difference h = y − x between a mutant\nindividual with trait y born from an individual with traitRx. We assume\nthat M (x, dh) has 0 expectation (no mutation bias), i.e. hM (x, dh) =\n0, and has a density on Rk which is uniformly bounded in x ∈ X by\nsome function M̄ (h) with finite third-order moment.\n4\n\n\fWe will denote the dependence of νt on the parameter γ with the notation\nνtγ . Observe that such a population cannot go extinct because the death\nrate is 0 when there is only one individual in the population. Since we want\nto apply a limit of rare mutations while keeping the population size finite,\nthis is necessary to prevent the population to become extinct before any\nmutation occur.\nLet ξ(x) be a random variable whose law is the stationary distribution\nof a pure x-type population with no mutation (μ ≡ 0). This law is given\nby (2) where θ is replaced by θ(x) := b(x)/c(x, x).\nThe last notation needed concerns a population with initially only two\ntypes x and y and with no mutation. Then νt = Xt δx + Yt δy , where (Xt , Yt :\nt ≥ 0) is a bivariate Markov chain. For this Markov chain, P(T < ∞) = 1,\nwhere T is the first time where either Xt or Yt reach 0. We call fixation\n(of the mutant y) the event {XT = 0}. The probability of fixation will be\ndenoted by un,m (x, y)\nun,m (x, y) := P(XT = 0 | X0 = n, Y0 = m).\n\n3\n\nThe trait substitution sequence in finite populations\n\nIn this section, we apply the limit of rare mutations (γ → 0) to the process\nν γ , in order to describe the evolution of the population as a TSS in finite\npopulation. This limit requires to rescale time properly, as t/γ, to describe\nthe evolution on the mutation timescale.\nTheorem 3.1 Fix x ∈ X . Assume that ν0γ = N0γ δx where supγ∈(0,1) E((N0γ )p ) <\n∞ for some p > 1. Then, for any 0 < t1 < . . . < tn , the n-tuple (νtγ1 /γ , . . . , νtγn /γ )\nconverges in law for the weak topology to (Nt1 δSt1 , . . . , Ntn δStn ) where\n(1) (St ; t ≥ 0) is a Markov jump process on X with initial value S0 = x and\nwhose jumping rates q(x, dh) from x to x + h are given by\nq(x, dh) = β(x)χ(x, x + h)M (x, dh),\nwhere β(x) = μ(x)b(x)E(ξ(x)) = μ(x)b(x)θ(x)/(1 − e−θ(x) ) and\nχ(x, y) =\n\nX nP(ξ(x) = n)\n\nn≥1\n\nE(ξ(x))\n\nun,1 (x, y) =\n\nX\n\nn≥1\n\ne−θ(x)\n\nθ(x)n−1\nun,1 (x, y).\n(n − 1)!\n(3)\n\n5\n\n\f(2) Conditional on (St1 , . . . , Stn ) = (x1 , . . . , xn ), the Nti are independent\nand respectively distributed as ξ(xi ).\nTherefore, in the limit of rare mutations, on the mutation timescale, the\npopulation is always monomorphic and the dominant trait of the population\nevolves as a jump process over the trait space, where a jump corresponds to\nthe appearance and fixation of a mutant type. Moreover, at any time, the\npopulation size stationary (i.e. has the stationary distribution corresponding\nto the dominant trait of the population). The fixation rate of a mutant is\ngoverned by the function χ(x, y), which is therefore the random analogue of\nthe traditional invasion fitness [9], defined as the probability of invasion of\na mutant type y is a resident population of type x at equilibrium. Observe\nthat, as usual in adaptive dynamics, the fitness landscape depends on the\ncurrent state of the population. Moreover, in contrast with the classical\nTSS [10], from a given monomorphic resident population, any mutant trait\nhas a positive probability to invade (by genetic drift). Therefore, evolution is\npossible in any direction of the trait space. However, a directional selection\nstill exists, as will appear in the next section.\nWe refer to [2] for the proof of this result. However, this convergence is\nnatural in view of the following interpretation of each parameter. β(x) can\nbe seen as the mean mutant production rate of a stationary x-type population\n(i.e. with size ξ(x)), and χ(x, y) is the probability of fixation of a single ytype mutant entering a pure x-type population with size-biased stationary\nsize. The size bias comes from the fact that the mutant appears at a birth\ntime in the stationary population (since the birth rate is proportional to\nthe population size, the population size after a birth event in the stationary\npopulation is given by the size-biaised stationary population size).\n\n4\n\nThe canonical diffusion of adaptive dynamics\n\nLet us assume for simplicity that X = Rk . Let σ(x) be the square root\nmatrix of the covariance matrix of M (x, *). We also need to assume that the\nmatrix σ(x) is a Lipschitz function of x.\nIn order to obtain the equivalent of the canonical equation of adaptive\ndynamics in a finite population, we want to apply a limit of small mutation\nsteps (weak selection) to the TSS S. To this aim, we introduce a parameter ǫ > 0 and replace the mutation kernels M (x, *) by their image by the\napplication h 7→ ǫh. Time also has to be rescaled in order to obtain a\nnon-degenerate limit. The correct time scaling is 1/ǫ2 , which leads to the\n\n6\n\n\ffollowing generator for the rescaled TSS (Stǫ ; t ≥ 0)\nZ\n1\nAǫ φ(x) = 2\n(φ(x + ǫh) − φ(x))β(x)χ(x, x + ǫh)M (x, dh).\nǫ Rk\nUsing the assumption that the mutation kernels M (x, *) have 0 expectation,\nit is elementary to compute the limit of this expression as ǫ → 0 (for sufficiently regular φ). This limit, which takes the form of a diffusion generator,\nexplains the following result (its full proof can be found in [2]).\nTheorem 4.1 If the family (S0ǫ )ǫ>0 has bounded first-order moments and\nconverges in law as ǫ → 0 to a random variable Z0 , then the process S ǫ with\ninitial state S0ǫ converges in law for the Skorohod topology on D(R+ , Rk ) to\nthe diffusion process (Zt ; t ≥ 0) with initial state Z0 unique solution to the\nstochastic differential equation\np\ndZt = β(Zt )σ 2 (Zt ) * ∇2 χ(Zt , Zt )dt + β(Zt )χ(Zt , Zt )σ(Zt ) * dBt\n(4)\n\nwhere ∇2 χ denotes the gradient w.r.t. the second variable y of χ(x, y) and\nB is a standard k-dimensional Brownian motion.\n\nThis result gives the equivalent of the canonical equation of adaptive\ndynamics (1) when the population is finite. It is no longer a deterministic\nODE, but a diffusion process, in which the genetic drift remains present (in\nthe form of a stochastic diffusion term), as a consequence of the population\nfiniteness and of the limit of weak selection. The deterministic drift part\nof (4) is very similar to the standard canonical equation of adaptive dynamics (1), and involves in particular the gradient of the fitness function χ. The\nprocess (4) provides a diffusion model describing the evolution of the dominant trait value in a population [8,5], grounded on a precise microscopic\ndensity-dependent modelling of the population dynamics. It also gives the\nprecise balance between directional selection and genetic drift as a function\nof the individual's dynamical parameters.\n\n5\n\nFixation probability near neutrality\n\nThe SDE (4) involves the fixation probability χ(x, x) and the fitness gradient\nwith respect to the second variable ∇2 χ(x, x). In this section, we explain\nhow these quantities can be explicitly computed.\nWe need to compute the derivatives of the fixation probabilities un,m (x, y)\nwhen y is close to x. Recall that the law of the two-types LBP without mutation (X, Y ) used to define un,m in the end of Section 2 is characterized by\n7\n\n\fthe birth vector B and the competition matrix C\n\u0012\n\u0013\n\u0012\n\u0013\nb(x)\nc(x, x) c(x, y)\nB=\n, C=\n.\nb(y)\nc(y, x) c(y, y)\nWe will say that the mutant is neutral if all individuals are exchangeable,\ni.e. when b(y) = b(x) and c(x, y) = c(y, x) = c(y, y) = c(x, x) (this holds in\nparticular when y = x). As will appear below, using the notation (b, c) :=\n(b(x), c(x, x)), it is natural to focus on deviations from the neutral case\nexpressed as\n\u0012 \u0013\n\u0012\n\u0013 \u0012\n\u0013 \u0012\n\u0013\n0\n0 0\n0 α\n0 ε\nB = b1 +\n, C = c1 −\n+\n−\nλ\nδ δ\n0 α\nε 0\nIn words, deviations from the neutral case are a linear combination of four\nfundamental selection coefficients λ, δ, α, ε, that are chosen to be positive\nwhen they confer an advantage to the mutant. It is convenient to assess\nthese deviations to the neutral case in terms of\n1. fertility (λ): positive λ means increased mutant birth rate\n2. defence capacity (δ): positive δ means reduced competition sensitivity of mutant individuals w.r.t. the total population size\n3. aggressiveness (α): positive α means raised competition pressure\nexerted from any mutant individual onto the rest of the population\n4. isolation (ε): positive ε means lighter cross-competition between the\ntwo different types, that would lead, if harsher, to a greater probability\nof exclusion of the less abundant one\nUnder neutrality, an elementary martingale argument shows that the fixation probability equals the initial mutant frequency p := m/(m + n). This\nimplies in particular that\nχ(x, x) =\n\ne−θ(x) − 1 + θ(x)\n.\nθ(x)2\n\n(5)\n\nThe following theorem unveils the dependence of u upon λ, δ, α, ε, when\nthey slightly deviate from 0, and explains why these four selection coefficients\nprovide a natural basis to decompose the gradient of the fixation probability.\n\n8\n\n\fTheorem 5.1 As a function of the multidimensional selection coefficient\ns = (λ, δ, α, ε), the probability u is differentiable, and in a neighbourhood of\ns = 0 (selective neutrality),\nu = p + v ′ .s + o(s),\n\n(6)\n\nwhere the selection gradient v = (v λ , v δ , v α , v ε ) can be expressed as\nι\nι\nvn,m\n= p (1 − p) gn+m\nι 6= ε,\nε\nε\nvn,m = p (1 − p) (1 − 2p) gn+m\n\nwhere the g's depend solely on the resident's characteristics b, c, and on the\ntotal initial population size n+m. They are called the invasibility coefficients.\nThe invasibility coefficients of a pure resident population are interesting\nto study, as they provide insights about how the fixation probability deviates from p as the selection coefficients of the mutant deviate from 0. They\nalso provide information about the robustness of the resident population,\ni.e. its resistance to mutant invasions. In particular, this allows to compare\nthe sensitivity of the invasion probability in a given monomorphic resident\npopulation with respect to the four fundamental selection coefficients. In\nthe simplest case where mutations in the parameter space are isotropic,\nthe biggest invasibility coefficent gives the direction of the parameter space\nwhere a mutant is more likely to invade. More generally, when there are\ncorrelations between mutations in the parameter space (either because of\nthe phenotypic structure in the functions b(*) and c(*, *), or because the covariance matrix of the mutation steps is non-diagonal), the likeliest direction\nof evolution in the trait space is given by the deterministic coefficient of the\ncanonical diffusion (4), in which the fitness gradient is given by\n∇2 χ(x, x) = aλ (x)∇b(x) − aδ (x)∇1 c(x, x) + aα (x)∇2 c(x, x),\n\n(7)\n\nwhere, for ι = λ, δ, α,\naι (x) = e−θ(x)\n\n∞\nι\nX\n(x)θ(x)n−1\nngn+1\n\nn=1\n\n(n + 1)2 (n − 1)!\n\n.\n\nIt is possible to obtain explicit expressions for the invasibility coefficients\nas series. We refer to [2] for the exact expressions. In particular, these\nexpressions yield that aι (x) = âι (θ(x))/c(x, x) for some function âι . Moreover, they allow one to compute numerically the invasibility coefficients, and\ntherefore the quantities âι for ι = λ, δ, α as functions of the parameter θ(x).\ngι\n\n9\n\n\f0.6\nâα (θ)\nâλ (θ)\nâδ (θ)\n\n0.5\n0.4\n0.3\n0.2\n0.1\n0\n0\n\n5\n\n10\n\n15\n\n20\n\n25\n\n30\n\n35\n\n40\n\nFigure 1: The functions âλ , âδ and âα as functions of θ.\n\n0.6\nθâα (θ)\nθâλ (θ)\n\n0.5\n0.4\n0.3\n0.2\n0.1\n0\n0\n\n5\n\n10\n\n15\n\n20\n\n25\n\n30\n\n35\n\nFigure 2: The functions θ 7→ θâλ (θ) and θ 7→ θâα(θ).\n\n10\n\n40\n\n\fThese numerical results can be used to make simulations of the canonical\ndiffusion of adaptive dynamics in various ecological examples. In particular,\nin contrast with the classical canonical equation of adaptive dynamics, the\npresence of a genetic drift can induce the evolutionary dynamics to drift\naway from evolutionary stable strategies, where the fitness gradient is zero.\nWhen the fitness gradient admits several zeros, it can visit several basins of\nattraction on various timescales.\nThis numerical study is a work in progress, that is quite delicate because\nthe series involved in the computation of gι are slowly converging, with first\nterms that grow exponentially fast with θ. We shall give here our first\nresults. Fig. 1 shows the functions âι for ι = λ, δ, α. Several comments can\nbe made from this figure. First, for any θ > 0, âδ (θ) > âα (θ) > âλ (θ). This\nmeans that, for equal mutation steps in the parameter space, a mutation is\nalways more advantageous in the direction δ than in the direction α, which\nis itself more advantageous than in the direction λ. In other words, in a\ngiven population, a better defence capacity is more beneficial than a better\naggressiveness, which is more beneficial than a better fertility.\nMoreover, as θ goes to infinity, these functions have different asymptotic\nbehaviors. âδ seems to converges to 1/2, whereas âλ (θ) and âα (θ) are both\nequivalent to 1/2θ (see Fig. 2). However, this does not mean that mutations\nare much more likely to fixate in the δ direction, because, when θ is large,\nb = θc is larger than c, and, in (7), aδ and aα are multiplied by ∇1 c and ∇2 c\nrespectively, whereas aλ is multiplied by ∇b. More formally, to compute\nthe limit of the canonical diffusion when θ goes to infinity, one can divide\nthe competition kernel c(*, *) by a constant K in the microscopic model and\nthen let K go to infinity in the canonical diffusion. Denoting by χK (*, *) the\nfitness function obtained this way and using the asymptotic behaviors given\nabove, one gets that\nlim ∇2 χK (x, x) =\n\nK→+∞\n\n1\n(∇b(x) − θ(x)∇1 c(x, x)).\n2b(x)\n\nMoreover, by (5), χK (x, x) converges to 0 when K → ∞. Now, as proved\nin [1], with our notation, the fitness function of the canonical equation of\nadaptive dynamics (1) is given by f (x, y) = b(y) − c(y, x)θ(x). Therefore,\nas K → +∞, the canonical diffusion converges to a deterministic ODE\nwhich is precisely the canonical equation of adaptive dynamics. This gives\na new justification of this equation, and this also allows one to study the\nfluctuations around the canonical diffusion when K is large. In particular,\nthis diffusion equation with small diffusion term enters the framework of\nFreidlin-Wentzell's theory [4], which can be applied to predict the long time\n11\n\n\fbehaviour of the diffusion, and its chain of visit of basins of attractions when\nK is large. This kind of information is biologically very relevant, since it\nallows one to predict in which order all the evolutionary stable strategies\nwill be visited by the population and on which timescale.\n\nReferences\n[1] N. Champagnat, A microscopic interpretation for adaptive dynamics\ntrait substitution sequence models, Stoch. Proc. Appl. 116 (2006), 1127–\n1160.\n[2] N. Champagnat and A. Lambert, Evolution of discrete populations and\nthe canonical diffusion of adaptive dynamics, to appear in Ann. Appl.\nProb.\n[3] U. Dieckmann and R. Law, The dynamical theory of coevolution: A\nderivation from stochastic ecological processes, J. Math. Biol. 34 (1996),\n579–612.\n[4] M.I. Freidlin and A.D. Wentzell, Random Perturbations of Dynamical\nSystems. Springer-Verlag, Berlin, 1984.\n[5] T.F. Hansen, Stabilizing selection and the comparative analysis of adaptation, Evolution 51 (1997), 1341–1351.\n[6] J. Hofbauer and R. Sigmund, Adaptive dynamics and evolutionary stability, Appl. Math. Letters 3 (1990), 75–79.\n[7] A. Lambert, The branching process with logistic growth, Ann. Appl.\nProb. 15 (2005), 1506–1535.\n[8] R. Lande, Natural selection and random genetic drift in phenotypic\nevolution, Evolution 30 (1976), 314–334.\n[9] J.A.J. Metz, R.M. Nisbet and S.A.H. Geritz, How should we define\n'fitness' for general ecological scenarios ? , Trends in Ecology and Evolution 7 (1992), 198–202.\n[10] J.A.J. Metz, S.A.H. Geritz, G. Meszéna, F.A.J. Jacobs and J.S. van\nHeerwaarden, Adaptive Dynamics, a geometrical study of the consequences of nearly faithful reproduction, in: Stochastic and Spatial Structures of Dynamical Systems, S.J. van Strien and S.M. Verduyn Lunel\n(eds.), North Holland, Amsterdam, 1996, 183–231.\n\n12\n\n\f"}