{"id": "http://arxiv.org/abs/0809.2286v3", "guidislink": true, "updated": "2009-06-26T16:56:30Z", "updated_parsed": [2009, 6, 26, 16, 56, 30, 4, 177, 0], "published": "2008-09-12T20:36:44Z", "published_parsed": [2008, 9, 12, 20, 36, 44, 4, 256, 0], "title": "The Parton Bubble Model(PBM) is Connected to the Glasma Flux Tube\n  Model(GFTM), and predicts the Ridge and Strong CP violation", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0809.2185%2C0809.0759%2C0809.4834%2C0809.1639%2C0809.1054%2C0809.3220%2C0809.4723%2C0809.1973%2C0809.3607%2C0809.4296%2C0809.0916%2C0809.5094%2C0809.2099%2C0809.0579%2C0809.5202%2C0809.1686%2C0809.0631%2C0809.1500%2C0809.4978%2C0809.2390%2C0809.0763%2C0809.4754%2C0809.0423%2C0809.2228%2C0809.0724%2C0809.3249%2C0809.3779%2C0809.2883%2C0809.1233%2C0809.4227%2C0809.3194%2C0809.4818%2C0809.3614%2C0809.0514%2C0809.5085%2C0809.2406%2C0809.0592%2C0809.3892%2C0809.2469%2C0809.1927%2C0809.2198%2C0809.3726%2C0809.4233%2C0809.3469%2C0809.2404%2C0809.1055%2C0809.0352%2C0809.0957%2C0809.2286%2C0809.1942%2C0809.0104%2C0809.3603%2C0809.0807%2C0809.0305%2C0809.2304%2C0809.1045%2C0809.1882%2C0809.3211%2C0809.3708%2C0809.4592%2C0809.1371%2C0809.0242%2C0809.5273%2C0809.0245%2C0809.3547%2C0809.4710%2C0809.5276%2C0809.2590%2C0809.2045%2C0809.0722%2C0809.1554%2C0809.2628%2C0809.4774%2C0809.1820%2C0809.0911%2C0809.2488%2C0809.3615%2C0809.2153%2C0809.0072%2C0809.3906%2C0809.4673%2C0809.4038%2C0809.4167%2C0809.0282%2C0809.4443%2C0809.0994%2C0809.4183%2C0809.3336%2C0809.2605%2C0809.1572%2C0809.1730%2C0809.3567%2C0809.2121%2C0809.1795%2C0809.4910%2C0809.1380%2C0809.2041%2C0809.4559%2C0809.1574%2C0809.0703%2C0809.1843&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "The Parton Bubble Model(PBM) is Connected to the Glasma Flux Tube\n  Model(GFTM), and predicts the Ridge and Strong CP violation"}, "summary": "In an earlier paper we developed a Parton Bubble Model (PBM) for RHIC/LHC,\nbased on a substructure of a ring of localized bubbles which initially contain\n3-4 partons of almost entirely gluons. A Glasma Flux Tube Model (GFTM) which\nformed longitudinal flux tubes in the transverse plane of two colliding sheets\nof Color Glass Condensate (CGC) which pass through one another had been\ndeveloped. These sheets create boost invariant flux tubes of longitudinal color\nelectric and magnetic fields. A blast wave gives the tubes near the surface\ntransverse flow in the same way it gave flow to the bubbles in the PBM. In this\npaper we connect the equivalent characteristics of the PBM to the GFTM and show\nthat the intermediate transverse momentum charged-two-particle angular\ncorrelations of the most central and highest energy RHIC Au + Au collisions are\nexplained. When one considers a 3-4 GeV/c transverse momentum tagged charged\ntrigger particle in combination with other intermediate transverse momentum\ncharged particles, the ridge correlation is generated and explained. The\nlongitudinal color electric and magnetic fields of GFTM have a non-zero\ntopological charge density $F \\widetilde $F. These fields cause a local strong\nCP violation which effects charged particle production coming from quarks and\nanti-quarks created in the tube or bubble. We developed four-charged-particle\ncorrelations which show this CP effect and accumulate from bubble to bubble\nindependent of whether particles are pushed or pulled and rotated in a right or\nleft handed direction, We demonstrate strong evidence for the predicted color\nelectric field using previously published experimental data. We developed 4\nparticle correlations for obtaining evidence for the predicted color magnetic\nfield.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0809.2185%2C0809.0759%2C0809.4834%2C0809.1639%2C0809.1054%2C0809.3220%2C0809.4723%2C0809.1973%2C0809.3607%2C0809.4296%2C0809.0916%2C0809.5094%2C0809.2099%2C0809.0579%2C0809.5202%2C0809.1686%2C0809.0631%2C0809.1500%2C0809.4978%2C0809.2390%2C0809.0763%2C0809.4754%2C0809.0423%2C0809.2228%2C0809.0724%2C0809.3249%2C0809.3779%2C0809.2883%2C0809.1233%2C0809.4227%2C0809.3194%2C0809.4818%2C0809.3614%2C0809.0514%2C0809.5085%2C0809.2406%2C0809.0592%2C0809.3892%2C0809.2469%2C0809.1927%2C0809.2198%2C0809.3726%2C0809.4233%2C0809.3469%2C0809.2404%2C0809.1055%2C0809.0352%2C0809.0957%2C0809.2286%2C0809.1942%2C0809.0104%2C0809.3603%2C0809.0807%2C0809.0305%2C0809.2304%2C0809.1045%2C0809.1882%2C0809.3211%2C0809.3708%2C0809.4592%2C0809.1371%2C0809.0242%2C0809.5273%2C0809.0245%2C0809.3547%2C0809.4710%2C0809.5276%2C0809.2590%2C0809.2045%2C0809.0722%2C0809.1554%2C0809.2628%2C0809.4774%2C0809.1820%2C0809.0911%2C0809.2488%2C0809.3615%2C0809.2153%2C0809.0072%2C0809.3906%2C0809.4673%2C0809.4038%2C0809.4167%2C0809.0282%2C0809.4443%2C0809.0994%2C0809.4183%2C0809.3336%2C0809.2605%2C0809.1572%2C0809.1730%2C0809.3567%2C0809.2121%2C0809.1795%2C0809.4910%2C0809.1380%2C0809.2041%2C0809.4559%2C0809.1574%2C0809.0703%2C0809.1843&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "In an earlier paper we developed a Parton Bubble Model (PBM) for RHIC/LHC,\nbased on a substructure of a ring of localized bubbles which initially contain\n3-4 partons of almost entirely gluons. A Glasma Flux Tube Model (GFTM) which\nformed longitudinal flux tubes in the transverse plane of two colliding sheets\nof Color Glass Condensate (CGC) which pass through one another had been\ndeveloped. These sheets create boost invariant flux tubes of longitudinal color\nelectric and magnetic fields. A blast wave gives the tubes near the surface\ntransverse flow in the same way it gave flow to the bubbles in the PBM. In this\npaper we connect the equivalent characteristics of the PBM to the GFTM and show\nthat the intermediate transverse momentum charged-two-particle angular\ncorrelations of the most central and highest energy RHIC Au + Au collisions are\nexplained. When one considers a 3-4 GeV/c transverse momentum tagged charged\ntrigger particle in combination with other intermediate transverse momentum\ncharged particles, the ridge correlation is generated and explained. The\nlongitudinal color electric and magnetic fields of GFTM have a non-zero\ntopological charge density $F \\widetilde $F. These fields cause a local strong\nCP violation which effects charged particle production coming from quarks and\nanti-quarks created in the tube or bubble. We developed four-charged-particle\ncorrelations which show this CP effect and accumulate from bubble to bubble\nindependent of whether particles are pushed or pulled and rotated in a right or\nleft handed direction, We demonstrate strong evidence for the predicted color\nelectric field using previously published experimental data. We developed 4\nparticle correlations for obtaining evidence for the predicted color magnetic\nfield."}, "authors": ["S. J. Lindenbaum", "R. S. Longacre"], "author_detail": {"name": "R. S. Longacre"}, "author": "R. S. Longacre", "arxiv_comment": "21 pages, 14 figures Significant additional text has been added", "links": [{"href": "http://arxiv.org/abs/0809.2286v3", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0809.2286v3", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "nucl-th", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "nucl-th", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0809.2286v3", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0809.2286v3", "journal_reference": null, "doi": null, "fulltext": "The parton bubble model (PBM) is connected to the glasma flux tube model\n(GFTM), and predicts the ridge and strong CP violation.\nS.J. Lindenbaum1, 2 and R.S. Longacre2\n\narXiv:0809.2286v3 [nucl-th] 26 Jun 2009\n\n1\n\nCity College of New York, New York City, New York 10031\n2\nBrookhaven National Laboratory, Upton, New York 11973\n(Dated: December 4, 2018)\n\nIn an earlier paper we developed a Parton Bubble Model (PBM) for RHIC, high-energy heavy-ion\ncollisions. PBM was based on a substructure of a ring of localized bubbles (gluonic hot spots) which\ninitially contain 3-4 partons composed of almost entirely gluons. The bubble ring was perpendicular\nto the collider beam direction, centered on the beam, at midrapidity, and located on the expanding\n√\nfireball surface of Au + Au central collisions (0-10%) at sNN =200 GeV. The bubbles emitted\ncorrelated particles at kinetic freezeout, leading to a lumpy fireball surface. For a selection of charged\nparticles (0.8 GeV/c < pt < 4.0 GeV/c), the PBM reasonably quantitatively (within a few percent)\nexplained high precision RHIC experimental correlation analyses in a manner which was consistent\nwith the small observed HBT source size in this transverse momentum range. We demonstrated\nthat surface emission from a distributed set of surface sources (as in the PBM) was necessary to\nobtain this consistency. A Glasma Flux Tube Model (GFTM) that formed longitudinal flux tubes in\nthe transverse plane of two colliding sheets of Color Glass Condensate (CGC), which pass through\none another had been developed. These sheets create boost invariant flux tubes of longitudinal color\nelectric and magnetic fields. A blast wave gives the tubes near the surface transverse flow in the\nsame way it gave transverse flow to the bubbles in the PBM. In this paper we consider the equivalent\ncharacteristics of the PBM and GFTM and connect the two models. The PBM results discussed\nabove were all obtained without a jet trigger. Therefore while investigating the ridge in this paper\nwe add a jet trigger to the PBM. When one considers a 3-4 GeV/c transverse momentum tagged\ncharged particle in combination with another intermediate transverse momentum charged particle\nin the PBM, the ridge correlation is generated and explained. In the GFTM the longitudinal color\nelectric and magnetic fields have a non-zero topological charge density F Fe. These fields cause a local\nstrong CP violation which effects charged particle production coming from quarks and anti-quarks\ncreated in the tube or bubble. For investigating these phenomena we use the PBM alone, without\na jet trigger. We developed four charged particle correlations which show this strong CP violation\neffect and accumulate from bubble to bubble independent of whether particles are pushed or pulled\n(by the color electric field), and rotated in a right or left handed direction (by the color magnetic\nfield). We also show that from previously published analyses of experimental data there is already\nstrong evidence for the longitudinal color electric fields, and predict correlations which can be used\nto search for color magnetic field effects.\nPACS numbers: 25.75.Nq, 11.30.Er, 25.75.Gz, 12.38.Mh\n\nI.\n\nINTRODUCTION AND REVIEW OF\nMODELS\n\nIn this paper we discuss the characteristics of the\nparton bubble model (PBM)[1] and connect them\nto related characteristics of the glasma flux tube\nmodel (GFTM)[2]. We will then proceed to use\nthe PBM to discuss and explain the observed ridge\nphenomenon by adding appropriate trigger requirements to the PBM. A successful comparison with\nexperimental data is made. We then show how the\nPBM can be used to search for strong CP violations\nor Chern-Simons topological charge[3]. We develop\nfour charged particle correlations that can be used to\ndetect the presence of these color electric and color\nmagnetic fields. Then we show that existing published analyses can be used to already provide strong\nexperimental evidence for the longitudinal color elec-\n\ntric fields. Our predicted specific four charged particle correlations can be used to search for experimental evidence for the color magnetic fields.\n\nA.\n\nParton bubble model development\n\nOur interest in and the eventual development of\nthe PBM goes back many years to the early nineteen\neighties. Van Hove's work[4] in the early eighties\nconsidered the bubbles as small droplets of quarkgluon plasma (QGP) assumed to be produced in\nultra-relativistic collisions of hadrons and/or nuclei. His work recognized that experimental detectors only see what is emitted in the final state at\nkinetic freezeout. Therefore final state predictions\nof his string model work on plasma bubbles or any\nother theory required specific convincing predictions\n\n\f2\nthat are observable in the final state which can be\nmeasured by experiment. His work predicted that\nthe final state rapidity distribution dn/dy of hadrons\nwould exhibit isolated maxima of width ∆y ∼ 1 (single bubble) or rapidity bumps of a few units (due to\nthose cases producing a few bubbles). These rapidity regions would also contain traditional signals of\nQGP formation. Even this early work by Van Hove\nneeded his bubbles near the surface of the final state\nfireball in order to experimentally measure the particles emitted in the final state at kinetic freezeout.\nWe and other searched for these Van Hove bubbles,\nbut no one ever found any significant evidence for\nthem.\nOur next paper[5] was our final attempt to make a\ntheoretical treatment of the single bubble case (similar to the Van Hove case) which could be experimentally verified. It is possible that with enough\nstatistics one in principle could find single to a few\nbubble events. We developed a number of event generators which could possibly provide evidence for\nstriking signals resulting from these bubbles. One\nshould note that in that paper we had included in\nSec. 11 mathematical expressions describing how\ncharged pions are effected by strong color electric\nand color magnetic fields which are present and parallel in a CP-odd bubble of metastable vacuum. This\nsection was motivated by the work of Kharzeev and\nPisarski[6]. For example eq. 3-4 of the section show\nthe boosts of the π + and the π − we estimated. Thus\nin 2000 we were already interested in and were investigating and publishing predictions for this phenomenon.\nWhen we considered the RHIC quantum interference data in 2000[7] it became clear that the fireball surface was rapidly moving outward. This implied a very large phase space region covered by the\nfireball, and also implied that it would be very unlikely for there to be only one isolated bubble (small\nsourcesize) with a large amount of energy sitting on\nthe surface. It seemed more likely that there would\nbe many bubbles or gluonic hot spots around the\nexpanding surface. This led to a paper[8] which\nwas our earlier version of Ref.[1]. In that paper\nwe concluded that the behavior of the HanburyBrown and Twiss (HBT) measurements[7, 9] should\nbe interpreted as evidence of a substructure of bubbles located on the surface of the final state fireball\nin the central rapidity region at kinetic freezeout.\nThe HBT radii were decreasing almost linearly with\ntransverse momentum and implying to us a source\nsize of ∼2 fm radii bubbles were on the surface and\ncould be selected for if we considered transverse momenta above 0.8 GeV/c. These momenta would allow sufficient resolution to resolve individual bubbles\nof ∼2 fm radii. We further concluded that these\n\nHBT quantum interference observations were likely\ndue to phase space focusing of the bubbles pushed\nby the expanding fireball. Thus the HBT measurements of source size extrapolated to transverse momenta above 0.8 GeV/c were images of the bubbles.\nThe HBT correlation has the property of focusing\nthese images on top of each other for a ring of bubbles transverse to and centered on the beam forming\nan average HBT radius.\nThus our model was a ring of bubbles sitting on\nthe freezeout surface with average size ∼2 fm radius perpendicular to the beam at mid-rapidity. The\nphase space focusing would also lead to angular correlations between particles emitted by the bubbles\nand be observable. Fig. 1 of that paper shows such\na bubble geometry. For the background particles\nthat account for particles in addition to the bubble particles we used unquenched HIJING[10] with\nits jets removed. We assumed that most of the jets\nwere eliminated from the central events because of\nthe strong jet quenching observed at RHIC[11]. We\ninvestigated the feasibility of using charged particle pair correlations as a function of angles which\nshould be observable due to the phase space focusing of the particles coming from individual bubbles.\nAt that point we fully expected that these correlations would be observable in the STAR detector[12]\nat RHIC if one analyzed central Au + Au collisions.\nCorrelation analyses are powerful tools in detecting substructures. Historically substructures have\nplayed an important role in advancing our understanding of strong (non perturbative) interactions.\nOur earlier paper explained the general characteristics of the angular correlation data, and was also\nconsistent with HBT measurements in a qualitative\nmanner. This motivated us to develop a reasonably quantitative model, the parton bubble model[1]\nwhich is discussed in the following.\n\nB.\n\nParton bubble model[1]\n\nIn this publication[1] we developed a QCD inspired parton bubble model (PBM) for central (impact parameter near zero) high energy heavy ion collisions at RHIC. The PBM is based on a substructure consisting of a single ring of a dozen adjoining\n2-fm-radius bubbles (gluonic hot spots) transverse to\nthe collider beam direction, centered on the beam,\nand located at or near mid-rapidity. The ring resides on the fireball blast wave surface (see Fig. 1 of\nRef.[1]). We assumed these bubbles are likely the final state result of quark-gluon-plasma (QGP) formation since the energy densities produced experimentally are greater than those estimated as necessary\nfor formation of a quark-gluon-plasma. Thus this is\n\n\f3\nthe geometry for the final state kinetic freezeout of\nthe QGP bubbles on the surface of the expanding\nfireball treated in a blast wave model.\nThe twelve bubble ring creates the average behavior of bubble formation driven by the energy density\nnear the surface of the expanding fire ball of the\nblast wave; that forms the final state surface bubbles\nthat emit the final state particles at kinetic freezeout. One should note that the blast wave surface is\nmoving at its maximum velocity at freezeout (3c/4).\nFor central events each of the twelve bubbles have\n3-4 partons per bubble each at a fixed φ for a given\nbubble. The transverse momentum (pt ) distribution\nof the charged particles is similar to pQCD but has\na suppression at high pt like the data.\nThe bubble ring radius of our model was estimated\nby blast wave, HBT and other general considerations\nto be approximately 8 fm. The bubbles emit correlated charged particles at final-state kinetic freezeout where we select a pt range (0.8 GeV/c < pt <\n4.0 GeV/c) in order to increase signal to background.\nThe 0.8 GeV/c pt cut increases the resolution to allow resolving individual bubbles which have a radius\nof ∼2 fm. This space momentum correlation of the\nblast wave provides us with a strong angular correlation signal. PYTHIA fragmentation functions[13]\nwere used for the bubbles fragmentation that generate the final state particles emitted from the bubbles.\nThe PBM explained the high precision Au + Au cen√\ntral (0-10%) collisions at sN N = 200 GeV[14] (the\nhighest RHIC energy). The PBM fit to the angular correlation data was reasonably quantitative to\nwithin a few percent (see Sec. 4 of Ref.[1]).\nThe correlation functions we employed (like the\nHBT correlation functions) have the property that\nfor the difference in angles (difference of momentum\nfor HBT) these correlations will image all 12 bubbles on top of each other. This leads to average\nobserved angles of approximately 30◦ in ∆φ, 70◦ in\n∆η, originating from a source size of about ∼2 fm\nradius which is consistent with the HBT correlation.\nThus the PBM generates ∆φ vs ∆η charged-particlepair correlations for charged particles with pt in the\nrange 0.8 Gev/c to 4.0 GeV/c as displayed in Fig.\n1. See Sec. 4 of Ref.[1] for a reasonably quantitative successful comparison with data. Furthermore\nthe model results were consistent with the HanburyBrown and Twiss (HBT) observations[9] that the\nobserved source radii determined by quantum statistical interference were reducing by a considerable\nfactor with increasing transverse momentum (pt ).\nThe HBT radii are interpreted to reduce from ∼6\nfm at pt ∼0.2 GeV/c to ∼2 fm at pt ∼1 GeV/c for\nour pt range. The generally accepted explanation\nfor this behavior is that as pt increases radial flow\nincreasingly focused the viewed region of the final\n\nstate into smaller volumes. If just one small HBT\nsize bubble were emitting all the correlated particles, this phenomena would lead to large spikes of\nparticles emitted at one limited φ angular region in\nindividual events. This is definitely not observed in\nthe Au + Au or other collision data at RHIC. Therefore, a distributed ring of small sources around the\nbeam as assumed in the PBM is necessary to explain both the HBT results[9] and the correlation\ndata[14]. The particles emitted from the same bubble are virtually uncorrelated to particles emitted\nfrom any other bubble except for momentum conservation requirements. An away side peak in the\ntotal correlation is built up from momentum conservation between the bubbles.\nThe PBM was also recently extended to\nPBME[15] which is identical to the PBM for central collisions (0-5%). For centralities running from\n30-80% jet quenching is not strong enough to make\njets negligible therefore, a jet component was added\nwhich was based on HIJING calculations. This jet\ncomponent accounts for more of the correlation as\none moves toward peripheral bins, and explains all of\nit for the most peripheral collisions. The PBME explained in a reasonably quantitative manner (within\na few percent) the behavior of the recent quantitative experimental analysis of charge pair correlations\nas a function of centrality[16]. This further strengthened the substantial evidence for bubble substructure. The agreement of the PBM and the PBME\nsurface emission models with experimental analyses\nstrongly implied that at kinetic freezeout the fireball was dense and opaque in the central region and\nmost centralities (except the peripheral region) in\nthe intermediate transverse momentum region (0.8\n< pt < 4.0 GeV/c). Thus we conclude that the observed correlated particles are both formed and emitted from or near the surface of the fireball. In the\nperipheral region the path to the surface is always\nsmall.\nIn the PBM and the PBME the bubbles are produced in large numbers, are most symmetric, and\nhave unusual features in the most central collisions\nthat can be related to the GFTM. Therefore the central region PBM is the model most suitable for comparing to the GFTM.\nThe PBM fit to the central production Au + Au\ncorrelation data[14] which was observed in the STAR\nTPC detector reasonably quantitatively fit the data.\nThe average observed angles were approximately 30◦\nin ∆φ and 70◦ in ∆η, originating from a source\nsize of ∼2 fm radius. Thus the PBM generates\n∆φ vs ∆η charged-particle-pair correlations for the\ncharged particles with pt in the range 0.8 GeV/c\nto 4.0 GeV/c as displayed in Fig. 1 of the present\npaper. See Sec. 4 of Ref.[1] for a reasonably quanti-\n\n\f4\ntative successful comparison with data (within a few\npercent of the observed correlations).\nThe CI correlation used in Fig. 1 and the PBM[1]\nis defined below. The two different types of chargedparticle-pair correlations are the unlike-sign charge\npairs (US) and the like-sign charge pairs (LS). The\ncharge-independent correlation (CI) is defined as the\ncorrelation made up of charged-particle-pairs independent of what the sign is, which is the average of\nthe US plus the LS correlations. Thus CI = (US\n+ LS)/2. Therefore the CI is the total charge pair\ncorrelation observed in the experimental detection\nsystem within its acceptance.\nWe utilize a two particle correlation function in\nthe two dimensional (2-D) space1 of ∆φ versus ∆η\n(see Ref.[1] Sec. 2.1). The PBM generated the two\ndimensional differences for a pair of particles ∆φ versus ∆η contributing to the correlation function. The\nsum over all pairs coming from the same event and\nthen summed over all events is our numerator in the\ncorrelation function. We then divide this numerator by a sum over all pairs coming from created\nmixed pairs where, the two particles are produced\nin different events, and then summed over all mixed\nevents. The sum over all the particle pair entries\nin the mixed event denominator is normalized to\nequal the sum over all particle pairs in the numerator. This rescales the CI such that the ratio of the\nnumerator divided by the denominator has a mean\nof 1.\n√\nThe CI was generated for sN N = 200 GeV central (0-5%) Au + Au collisions in the pt range\n0.8 GeV/c to 4.0 GeV/c at RHIC. When the CI\nwas compared to the corresponding experimental\nanalyses[14, 16] a reasonably quantitative agreement\nwithin a few percent of the observed CI was attained.\nSee Ref.[1] Sec. 4.2, Ref.[15] Sec. V, and Ref.[16]\nSec. VI B2 . The CI correlation for the 0-5% centrality bin is shown in Fig. 1. This analysis and our previous work[1, 15] was done without using a jet trigger. In fact jet production in the central region was\nnegligible due to strong jet quenching[11, 17, 18]. As\none can see in Fig. 1 the central CI correlation of\n∆φ on the near side (∆φ < 90◦ ), is sharp and approximately jetlike at all ∆η. In contrast the ∆η dependence is relatively flat. In the central production\n\n1\n\n2\n\n∆φ = φ1 − φ2 where φ is the azimuthal angle of a particle\nmeasured in a clockwise direction about the beam. ∆η =\nη1 − η2 which is the difference of the psuedorapidity of the\npair of particles\nThe STAR collaboration preferred to use the conventional\ndefinition of CI = US + LS which is larger by a factor of\n2 than the CI definition used in this present paper that is\ndirectly physically meaningful.\n\nthe average observed angles are approximately 30◦\nin ∆φ and 70◦ in ∆η. It is of interest to note that the\nsharp jetlike collimation in ∆φ persists at all centralities (0-80%). The elongation in ∆η persists in the\n0-30% centrality range and then decreases with decreasing centrality becoming jetlike in the peripheral\nbins. These characteristics are in reasonable quantitative agreement with the fits of the PBM and the\nPBME to experimental data analyses[1, 14, 15, 16].\nThe difference of the US and LS correlations is defined as the charge-dependent (CD) correlation (CD\n= US - LS). The 2-D experimental CD correlation\nfor centralities (0-80%) has a jetlike shape which is\nconsistent with PYTHIA jets (vacuum fragmentation) for all centralities. This clearly implies that\nboth particle hadroniztion and emission occur from\nthe fireball surface region as explained in Ref.[15]\nSec. II.\n\nC.\n\nGlasma flux tube model\n\nA glasma flux tube model (GFTM)[2] that had\nbeen developed considers that the wavefunctions of\nthe incoming projectiles, form sheets of color glass\ncondensates (CGC)[19] that at high energies collide,\ninteract, and evolve into high intensity color electric and magnetic fields. This collection of primordial fields is the Glasma[20, 21], and initially it is\ncomposed of only rapidity independent longitudinal\ncolor electric and magnetic fields. An essential feature of the Glasma is that the fields are localized\nin the transverse space of the collision zone with a\nsize of 1/Qs . Qs is the saturation momentum of partons in the nuclear wavefunction. These longitudinal\ncolor electric and magnetic fields generate topological Chern-Simons charge[3] which becomes a source\nfor particle production.\nThe transverse space is filled with flux tubes of\nlarge longitudinal extent but small transverse size\n∼Q−1\ns . Particle production from a flux tube is a\nPoisson process, since the flux tube is a coherent\nstate. As the partons emitted from these flux tubes\nlocally equilibrate, transverse flow builds due to the\nradial flow of the blast wave[22]. The flux tubes that\nare near the surface of the fireball get the largest\nradial flow and are emitted from the surface. As in\nthe parton bubble model these partons shower and\nthe higher pt particles escape the surface and do not\ninteract. These flux tubes are in the present paper\nconsidered strongly connected to the bubbles of the\nPBM. The method used to connect the PBM and\nthe GFTM is described and discussed in the next\nsubsection ID.\nQs is around 1 GeV/c thus the transverse size of\nthe flux tube is about 1/4 fm. The flux tubes near\n\n\f5\n\nNo Trigger\n\n0 to 5% Centrality\n\n1.012\n1.011\n1.01\n1.009\n1.008\n1.007\n1.006\n1.5\n1\n\n∆η 0.5\n\n0\n-0.5\n-1\n-1.5\n\n-50\n-150 -100\n\n0\n\n50\n\n100\n\n150\n\n)\n\n∆φ (deg\n\nFIG. 1: The CI (sum of all charged-particle-pairs) correlation for the 0-5% centrality bin with a charged particle pt\nselection (0.8 < pt < 4.0 GeV/c), generated by the PBM. It is plotted as a two dimensional ∆φ vs. ∆η perspective\nplot.\n\nthe surface are initially at a radius ∼5 fm. The φ angle wedge of the flux tube is ∼1/20 radians or ∼3◦ .\nThus the flux tube initially has a narrow range in\nφ. The large width in the ∆η correlation which in\nthe PBM depended on the large spread in ∆η of the\nbubble partons results from the independent longitudinal color electric and magnetic fields that created\nthe Glasma flux tubes. How much of these longitudinal color electric and magnetic fields are still present\nin the surface flux tubes when they have been pushed\nby the blast wave will be a speculation of this paper\nfor measuring strong CP violation?\nIt has been noted that significant features of\nthe PBM that generated final state correlations\nwhich fit the experimentally observed correlation\ndata[1, 14, 15, 16] are similar to those predicted by\nthe GFTM[2]. Therefore in the immediately following subsection we assume a direct connection of the\nPBM and the GTM, give reasons to justify it, and\nthen discuss its consequences, predictions and successes.\n\nsubsection we show that the characteristics of our\nPBM originally developed to fit the precision STAR\nAu + Au correlation data in a manner consistent\nwith the HBT data; implies that the bubble substructure we originally used to fit these previous data\nis closely related to the GFTM.\n\nThe connection of the PBM and the GFTM\n\nA natural way to connect the PBM bubbles to the\nGFTM flux tubes is to assume that the final state\nat kinetic freezeout of a flux tube is a PBM final\nstate bubble. Thus the initial transverse size of a\nflux tube ∼1/4 fm has expanded to the size of ∼2\nfm at kinetic freezeout. With this assumption we\nfind consistency with the theoretical expectations of\nthe GFTM. We can generate and explain the triggered ridge phenomenon and data (see Sec. II), thus\nimplying the ridge is connected to the bubble substructure. We can predict and obtain very strong evidence for the color electric field of the glasma from\ncomparing our multi-particle charged particle correlation predictions, and existing experimental correlation publications (see Sec. III). We have also\npredicted correlations which can be used to search\nfor evidence for the glasma color magnetic field (Sec.\nIII).\n\nThe successes of the PBM have strongly implied\nthat the final state surface region bubbles of the\nPBM represent a significant substructure. In this\n\nOf course an obvious question that arises is that\nsince a flux tube is an isolated system does a PBM\nbubble, that we assume is the final state of a\nflux tube at kinetic freezeout, also act as an iso-\n\nD.\n\n\f6\nlated system when emitting the final state particles? The near side correlations signals since the\noriginal PBM[1] have always come virtually entirely\nfrom particles emitted from the same bubble. Thus\neach bubble has always acted as an isolated system\nsimilar to the behavior of a flux tube.\n\nII. THE RIDGE IS FORMED BY THE\nBUBBLES WHEN A JET TRIGGER IS\nADDED TO THE PBM\n\nIn heavy ion collisions at RHIC there has been\nobserved a phenomenon called the ridge which has\nmany different explanations[2, 23, 24, 25, 26, 27, 28,\n29, 30]. The ridge is a long range charged particle\ncorrelation in ∆η (very flat), while the ∆φ correlation is approximately jet-like (a narrow Gaussian).\nThere also appears with the ridge a jet-like chargedparticle-pair correlation which is symmetric in ∆η\nand ∆φ such that the peak on the jet-like correlation is at ∆η = 0 and ∆φ = 0. The ∆φ correlation of\nthe jet and the ridge are approximately the same and\nsmoothly blend into each other. The ridge correlation is generated when one triggers on an intermediate pt range charged particle and then forms pairs\nbetween that trigger particle and each of all other intermediate charged particles with a smaller pt down\nto some lower limit. The first case we will study\nin this paper is a trigger charged particle between\n3.0 to 4.0 GeV/c correlated with all other charged\nparticles which have a pt between 1.1 GeV/c to 3.0\nGeV/c.\nIn this paper we will investigate whether the PBM\ncan account for the ridge once we add a jet trigger\nto our PBM generator[1]. However this trigger will\nalso select jets which previously could be neglected\nbecause there was such strong quenching[11, 17, 18]\nof jets in central collisions. A jet trigger had not\nbeen used in the PBM comparison to all previous\ndata. We use HIJING[10] merely to determine the\nexpected number of jets to add for our added jet trigger. These jet particles were added to our PBM generator. Thus our PBM generator now had HIJING\ngenerated background particles, bubbles of the PBM\nand added jet particles from HIJING. We have already shown that our final state particles come from\nhadrons at or near the fireball surface. We reduce\nthe number of jets by 80% which corresponds to the\nestimate that only the parton interactions on or near\nthe surface are not quenched away, and thus at kinetic freezeout form and emit hadrons which enter\nthe detector. This 80% reduction is consistent with\nsingle π 0 suppression observed in Ref.[18]. We find\nfor the reduced HIJING jets that 4% of the Au +\n√\nAu central events (0-5%) centrality at sN N = 200\n\nhave a charged particle with a pt between 3.0 and 4.0\nGeV/c with at least one other charged particle with\nits pt greater than 1.1 GeV/c coming from the same\njet. The addition of the jets to the PBM generator\nprovides the appropriate particles which are picked\nup by the trigger in order to form a narrow ∆η correlation signal at 0 which is also a narrow signal in\n∆φ at 0 (Fig. 10). This narrow jet signal is present\nin the data and is what remains of jets after 80% are\nquenched away.\nWe then form two-charged-particle correlations\nbetween one-charged-particle with a pt between 3.0\nto 4.0 GeV/c and another charged-particle whose\npt is greater than 1.1 GeV/c. The results of these\ncorrelations are shown in Fig. 2. Fig. 2 is the CI\ncorrelation for the 0-5% centrality bin with the just\nabove stated pt selections on charge pairs. Since we\nknow in our Monte Carlo which particles are emitted from bubbles and thus form the ridge, we can\npredict the shape of the ridge for the above pt cut\nby plotting only the correlation formed from pairs of\nparticles that are emitted by the same bubble (see\nFig. 3). The charge pair correlations are virtually\nall emitted from the same bubble. Those charge\npair correlations formed from particles originating\nfrom different bubbles are small contributors which\nmainly have some effect on the away side correlation. Thus Fig. 3 is the ridge signal which is the\npiece of the CI correlation for the 0-5% centrality\nof Fig. 2, after removing all other pairs except the\npairs emitted from the same bubble.\n\nA.\n\nParton pt correlated vs. random\n\nA very important aspect of the GFTM is the boost\nthat the flux tubes get from the radial flow of the\nblast wave. This boost is the same all along the flux\ntube and only depends on how far away from the\ncenter axis of the blast wave the flux tube is. In\nthe PBM the partons in the bubble received a boost\nin pt from the radial flow field in the blast wave;\nthat after final state fragmentation of the bubbles\ngave the generated particles a consistent pt spectrum\nwith the data. Since the boost from the blast wave\ndepended on the position of the bubble in the radial flow field, there should be a correlation between\npartons pt within a bubble. If one redistributed the\npartons with their pt boosts uniformly among the\nbubbles, the over all results for the generated correlations without a trigger would be unchanged. One\nshould note none of our prior work (i.e.PBM[1] or\nPBME[15]) contained a trigger. We have only added\na trigger here to treat the \"triggered ridge\" which\nobviously requires it. In our treatment of the GFTM\n(Sec. III) we have removed the trigger.\n\n\f7\n\nTriggered particles\n\n0 to 5% Centrality\n\n1.04\n1.03\n1.02\n1.01\n1\n0.99\n0.98\n1.5\n\n1\n\n∆η\n\n0\n0.5\n\n0\n\n-0.5\n\n-1\n\n-1.5\n\n-50\n-100\n-150\n\n50\n\n∆φ\n\n150\n100\n\ng)\n\n(de\n\nFIG. 2: The CI correlation for the 0-5% centrality bin that results from requiring one trigger particle pt above 3\nGeV/c and another particle pt above 1.1 GeV/c. It is plotted as a two dimensional ∆φ vs. ∆η perspective plot.\n\nOnce we require a trigger demanding higher pt\nparticles, we start picking out bubbles which have\nmore radial flow (harder particles). Thus correlated\nparticles which pass our pt selection and trigger come\nalmost entirely from the harder bubbles with more\nradial flow, while the softer bubbles which were subject to less radial flow mainly generate low enough\npt particles that become background particles or are\nlost to the correlation analysis due to pt selection.\nFigure 2 shows the result of our trigger and pt selection. If one redistributed the partons with their\npt radial flow boost among all the bubbles, then all\nbubbles become equal and there is no longer soft\nand hard bubbles. With this change we can generate\nbubble events. We find that both the non-triggered\ncorrelation and the ∆φ correlation are virtually unchanged in the region less than about 120◦ (see Fig.\n4). It seems that we move from the situation where\nwe have a few bubbles with a lot of correlated particles above our pt cut to a lot of bubbles that have few\ncorrelated particles above our cuts. However there is\na difference in the triggered correlation's away side\nor ∆φ near the 180◦ peak.\nIn Ref.[1] we discuss this away side effect and attributed this peak to momentum conservation. This\nis however not the whole story. The away side peak\nis generated by the geometry of the bubble ring\nwhich requires that for every bubble there is another\nbubble nearly 180◦ away that is emitting particles.\n\nThese symmetry requirements on the geometry contribute more to the away side peak especially for\nthe case without a trigger or redistributed random\npartons.\nThis geometry effect is what causes the away side\ncorrelation of elliptic flow in a peripheral heavy ion\ncollision. In such a collision there is a higher energy density aligned with the reaction plane. On\none side of the reaction plane there are more particles produced because of increased energy density,\nand because of the geometry of the situation. On\nthe other side of the reaction plane there are also\nmore particles produced for the same reasons. Thus\nthere is a correlation between particles that are near\neach other on one side of the reaction plane and a\ncorrelation between particles that are on both sides\nof the reaction plane. Momentum conservation requires particle communication by bouncing into each\nother, while geometry has no such communication.\nThe right hand does not need to know what the left\nhand is doing. However, if physics symmetry makes\nthem do the same thing then they can show a correlation.\n\nB.\n\nThe away side peak\n\nThe away side peak depends on the fragmentation of the away side bubble. For the triggered case\n\n\f8\n\nRidge signal\n\n0 to 5% Centrality\n\n0.05\n0.04\n0.03\n0.02\n0.01\n0\n1.5\n\n1\n\n∆η\n\n0\n0.5\n\n0\n\n-0.5\n\n-1\n\n-1.5\n\n-50\n-100\n-150\n\n50\n\n∆φ\n\n150\n100\n\ng)\n\n(de\n\nFIG. 3: The ridge signal is the piece of the CI correlation for the 0-5% centrality of Fig. 2 after removing all other\nparticle pairs except the pairs that come from the same bubble. It is plotted as a two dimensional ∆φ vs. ∆η\nperspective plot. As explained in the text charge pair correlations formed by particles emitted from different bubbles\nare small contributors which mainly have some effect on the away side correlation for ∆φ greater than about 120◦ .\n\nwhere there is a hard bubble with a strong correlation of parton pt inside the bubble (GFTM like),\nwe will have more correlated particles adding to the\nsignal on the near side. On the other hand the away\nside bubble will be on average a softer bubble which\nwill have a lot less particles passing the pt cuts and\nthus have a smaller signal. If we consider the case\nof a random parton pt bubble the particles passing\nthe pt cuts should be very similar on the near and\nthe away side. In Fig. 4 we compare the two correlations generated by the correlated and the random cases. We compare the ∆φ correlation for the\ntwo cases (solid is correlated and open is random)for\neach of the five ∆η bins which cover the entire ∆η\nrange (0.0 to 1.5). The vertical correlation scale is\nnot offset and is correct for the largest ∆η bin, 1.2\n< ∆η < 1.5, which is the lowest bin on the figure.\nAs one proceeds upwards to the next ∆η bin the\ncorrelation is offset by +0.05. This is added to the\ncorrelation of each subsequent ∆η bin. The smallest\n∆η bin on top of Fig. 4 has a +0.2 offset. A solid\nstraight horizontal line shows the offset for each ∆η\nbin. Each solid straight horizontal line is at 1.0 in\ncorrelation strength. We see that the away side correlation in the ∆φ region greater than about 120◦ is\nlarger for the random case.\n\nC.\n\nPredicted transverse momentum\ndependence of correlation\n\nParticles which come from bubbles that satisfy the\ntrigger (3.0 < pt < 4.0 GeV/c) are harder and have a\ndifferent pt distribution compared to the case without trigger requirements. In a given triggered event\nif one could select particles that come from the bubble or ridge, one would find that the pt spectrum is\nharder than the average pt spectrum. In Fig. 5 we\nshow how one can by trigger choose particles that\nare rich with ridge particles. We consider a typical trigger particle and the associated regions in the\navailable experimental φ and η ranges. The ridge\nparticles we consider are separated from the trigger\nparticle by 0.7 in η. This is done to eliminate particles coming from jet production that could also be\nassociated with the trigger particle. The bulk of the\nridge particles lie within 20◦ of the φ of the trigger\nparticle. The width of the φ spread is ∆φ = 40◦ .\nTherefore on a trigger by trigger basis we accumulate particles from the ridge region (see Fig. 5) and\nform a pt spectrum of charged-particles-pairs. We\nthen form a ratio of the pt spectrum for the ridge\nregion particles divided by the pt spectrum for all\nparticles in central Au + Au events. This ratio is\nhighly dependent on our ridge cut area. We can vir-\n\n\f9\n\nCorrelation pt greater 1.1 GeV/c and less 4.0 GeV/c\nAu Au 200 GeV Centrality B 0.0 to 2.9\nOne particle greater than 3.0 GeV/c\nThe other particle greater than 1.1 GeV/c\nCorrelated parton pt in bubble\nRandom parton pt in bubble\n0.0 ≤ |∆η| ≤ 0.3\n\nCorr\n\n0.3 ≤ |∆η| ≤ 0.6\n0.6 ≤ |∆η| ≤ 0.9\n0.9 ≤ |∆η| ≤ 1.2\n1.2 ≤ |∆η| ≤ 1.5\n∆φ (DEG)\nFIG. 4: The ∆φ CI correlation for the 0-5% centrality bin requiring one trigger particle pt above 3 GeV/c and another\nparticle pt above 1.1 GeV/c. We compare the two correlations generated by the correlated and the random cases.\nWe compare the ∆φ correlation for the two cases (solid is correlated and open is random) for each of the five ∆η bins\nwhich cover the entire ∆η range (0.0 to 1.5). The vertical correlation scale is not offset and is correct for the largest\n∆η bin, 1.2 < ∆η < 1.5, which is the lowest bin on the figure. As one proceeds upwards to the next ∆η bin the\ncorrelation is offset by +0.05. This is added to the correlation of each subsequent ∆η bin. The smallest ∆η bin on\ntop of Fig. 4 has a +0.2 offset. A solid straight horizontal line shows the offset for each ∆η bin. Each solid straight\nhorizontal line is at 1.0 in correlation strength. We see that the away side correlation for ∆φ greater than about 120◦\nis larger for the random case.\n\ntually remove this dependency by normalizing the\ntwo pt spectra to have the same counts for the 2.0\nGeV/c bin. Figure 6 is this ratio which can be considered a correlation of particles as a function of pt\nin the ridge region compared to particles from the\nevent in general. In Fig. 6 we form this ratio or\ncorrelation for the bubbles which have a correlated\npt among the partons (GFTM like). We also show\nthe correlation for bubbles which have a random pt\ndistribution among partons in the bubble. For the\nrandom case the pt spectrum does not differ much\nfrom the average pt spectrum while there is a big difference for the flux tube like case. This correlation\n\ncould be easily measured in the RHIC data.\n\nD.\n\nComparison to data\n\nTriggered angular correlation data showing the\nridge was presented at Quark Matter 2006[31]. Figure 7 shows the experimental ∆φ vs. ∆η CI correlation for the 0-10% central Au + Au collisions at\n√\nsN N = 200 GeV; requiring one trigger particle pt\nbetween 3 and 4 GeV/c and an associated particle\npt above 2.0 GeV/c. The yield is corrected for the\nfinite ∆η pair acceptance. For the PBM generator,\n\n\f10\n\n<\n\n∆η\n\n><\n∆η\ntrigger particle\n\n>\n\n<∆φ >\n\nφ\n\nRidge Particles are inside the 2 Boxes\n∆η = 0.7\n∆φ = 400\n\nη\nFIG. 5: In this figure we display the φ and η ranges considered for producing ridge particles in the Au + Au central\ncollisions. A typical trigger particle (pt between 3.0 to 4.0 GeV/c) implies two associated regions in the considered φ\nand η ranges where the ridge particles lie. The ridge particles we consider are separated by 0.7 in η (∆η) so that one\neliminates particles coming from jet production. The bulk of the ridge particles lie within 20◦ of the φ of the trigger\nparticle. The width of the φ spread is ∆φ = 40◦ .\n\nwe then form a two-charged-particle correlation between one charged particle with a pt between 3.0 to\n4.0 GeV/c and another charged particle whose pt is\ngreater than 2.0 GeV/c. The results of this correlation is shown in Fig. 8. Figure 7 shows the corrected\npair yield determined in the central data whereas\nFig. 8 shows the correlation function generated by\nthe PBM which does not depend on the number of\nevents analyzed. We can compare the two figures,\nif we realize that the away side ridge has around\n420,000 pairs in Fig. 7 while in Fig. 8 the away\nside ridge has a correlation of around 0.995. If we\nmultiply the correlation scale of Fig. 8 by 422,111\nin order to achieve the number of pairs seen in Fig.\n7, the away side ridge would be at 420,000 and the\npeak would be at 465,000. This would make a good\nagreement between the two figures.\n\nWe know in our Monte Carlo which particles come\nfrom bubbles and which particles form the ridge.\nThe correlation formed by the ridge particles is generated almost entirely by particles emitted by the\nsame bubble. We have shown in all our publications that the same side correlation signals are almost entirely formed by particles coming from the\nsame bubble. Thus we can predict the shape and\nthe yield of the ridge for the above pt trigger selection and lower cut, by plotting only the correlation\ncoming from pairs of particles that are emitted by\nthe same bubble (see Fig. 9).\nIn Ref.[31] it was assumed that the ridge yield\nwas flat across the acceptance while in Fig. 9 we see\nthat this is not the case. Therefore our ridge yield is\napproximately 35% larger than estimated in Ref.[31].\nFinally we can plot the jet yield that we had put into\n\n\f11\n\nBubbles with correlated pt\n\nratio\n\nBubbles with random pt\n\nPt GeV/c\nFIG. 6: On a trigger by trigger basis we accumulate particles from the ridge region (see Fig. 5). We then form a\nratio the of pt spectrum for the ridge region particles divided by the pt spectrum for all particles in central Au +\nAu events. We normalize the two pt spectra to have the same counts in the 2.0 GeV/c bin. This ratio or correlation\nfor the bubbles which have a correlated pt among the partons (GFTM like) are the solid points. The random pt\ndistribution among partons in the bubble are the open points.\n\nour Monte Carlo. We used HIJING[10] to determine\nthe number of expected jets, and then reduced the\nnumber of jets by 80%. This assumes that only the\nparton interactions on or near the surface that form\nhadrons at kinetic freezeout are not quenched away\nand thus enter the detector. This 80% reduction\nis consistent with single π 0 suppression observed in\nRef.[18]. This jet yield is plotted in Fig. 10 where\nwe subtracted contributions from the bubbles and\nthe background particles from Fig. 7.\n\nIII. STRONG CP VIOLATIONS OR\nCHERN-SIMONS TOPOLOGICAL CHARGE\nA.\n\nThe Source F Fe.\n\nThe strong CP problem remains one of the most\noutstanding puzzles of the Standard Model. Even\nthough several possible solutions have been put forward it is not clear why CP invariance is respected\nby the strong interaction. It was shown however\nthrough a theorem by Vafa-Witten[32] that the true\nground state of QCD cannot break CP. The part of\nthe QCD Lagrangian that breaks CP is related to\nthe gluon-gluon interaction term F Fe .\n\n\f12\n\nFIG. 7: Raw ∆φ vs. ∆η CI preliminary correlation data[31] for the 0-10% centrality bin for Au + Au collisions at\n√\nsNN = 200 GeV requiring one trigger particle pt between 3 to 4 GeV/c and an associated particle pt above 2.0\nGeV/c.\n\nTriggered particles\n\n0 to 5% Centrality\n\n1.1\n1.08\n1.06\n1.04\n1.02\n1\n0.98\n-150\n\n1.5\n-100\n\n1\n\n-50\n\n0\n\n∆φ\n\n∆η\n\n0.5\n0\n\n50\n\n(de100\ng)\n\n-0.5\n150\n\n-1\n-1.5\n\nFIG. 8: The PBM generated CI correlation for the 0-5% centrality bin requiring one trigger particle pt above 3\nGeV/c and another particle pt above 2.0 GeV/c plotted as a two dimensional ∆φ vs. ∆η perspective plot. The\ntrigger requirements on this figure are the same as those on the experimental data in Fig. 7.\n\n\f13\n\nRidge\n\n0 to 5% Centrality\n\n0.08\n0.06\n0.04\n0.02\n0\n-150\n\n1.5\n-100\n\n1\n\n-50\n\n0\n\n∆φ\n\n∆η\n\n0.5\n0\n\n50\n\n(de100\ng)\n\n-0.5\n150\n\n-1\n-1.5\n\nFIG. 9: The ridge signal is the piece of the CI correlation for the 0-5% centrality of Fig. 8 after removing all other\nparticle pairs except the pairs that come from the same bubble. It is plotted as a two dimensional ∆φ vs. ∆η\nperspective plot.\n\nJet Signal\n\n0 to 5% Centrality\n\n0.05\n0.04\n0.03\n0.02\n0.01\n0\n-150\n\n1.5\n-100\n\n1\n\n-50\n\n0\n\n∆φ\n\n∆η\n\n0.5\n0\n\n50\n\n(de100\ng)\n\n-0.5\n150\n\n-1\n-1.5\n\nFIG. 10: The jet signal is left in the CI correlation after the contributions from the background and all the bubble\nparticles are removed from the 0-5% centrality (with trigger requirements) of Fig. 8. It is plotted as a two dimensional\n∆φ vs. ∆η perspective plot.\n\n\f14\nThe part of F Fe related to CP violations can\nbe separated into a separate term which then can\nbe varied by multiplying this term by a parameter called θ. For the true QCD ground state θ =\n0 (Vafa-Witten theorem). In the vicinity of the\ndeconfined QCD vacuum metastable domains[33] θ\nnon-zero could exist and not contradict the VafaWitten theorem since these are not the QCD ground\nstate. The metastable domains CP phenomenon\nwould manifest itself in specific correlations of pion\nmomenta[6, 33].\n\nB.\n\nPionic measures of CP violation.\n\nThe glasma flux tube model (GFTM)[2] considers\nthe wavefunctions of the incoming projectiles, form\nsheets of CGC[19] at high energies that collide, interact, and evolve into high intensity color electric\nand magnetic fields. This collection of primordial\nfields is the Glasma[20, 21]. Initially the Glasma\nis composed of only rapidity independent longitudinal (along the beam axis) color electric and magnetic fields. These longitudinal color electric and\nmagnetic fields generate topological Chern-Simons\ncharge[3] through the F Fe term and becomes a source\nof CP violation. How much of these longitudinal\ncolor electric and magnetic fields are still present in\nthe surface flux tubes when they have been pushed\nby the blast wave is a speculation of this paper for\nmeasuring strong CP violation? The color electric\nfield which points along the flux tube axis causes an\nup quark to be accelerated in one direction along\nthe beam axis, while the anti-up quark is accelerated in the other direction. So when a pair of quarks\nand anti-quarks are formed they separate along the\nbeam axis leading to a separated π + π − pair along\nthis axis. The color magnetic field which also points\nalong the flux tube axis (which is parallel to the\nbeam axis) causes an up quark to rotate around the\nflux tube axis in one direction, while the anti-up\nquark is rotated in the other direction. So when a\npair of quarks and anti-quarks are formed they will\npickup or lose transverse momentum. These changes\nin pt will be transmitted to the π + π − pairs.\nIt is important to note that the CP violating asymmetries in π + and π − momenta arise through the\nWitten-Wess-Zumino[34, 35] term. The quarks and\nanti quarks which, later form the π + and π − , directly respond to the color electric and color magnetic fields and receive their boosts at the quark and\nanti quark level before they are pions. These boosts\nare transmitted to the pions at hadronization. Thus\nno external magnetic field is required in the methodology followed in this paper. The following references\ndemonstrate this:[5, 6, 33, 36].\n\nTo represent the color electric field effect we assume as the first step for the results being shown\nin this paper; that we generate bubbles which have\nan added boost of 100 MeV/c to the quarks in the\nlongitudinal momentum which represents the color\nelectric effect. The π + and the π − which form a pair\nare boosted in opposite directions along the beam\naxis. In a given bubble all the boosts are the same\nbut vary in direction from bubble to bubble. For\nthe color magnetic field effect, we give 100 MeV/c\nboosts to the transverse momentum in an opposite\nway to the π + and the π − which form a pair. For\neach pair on one side of a bubble one of the charged\npions boost is increased and the other is decreased.\nWhile on the other side of the bubble the pion for\nwhich the boost was increased is now decreased and\nthe pion which was decreased is now increased by the\n100 MeV/c. All pairs for a given bubble are treated\nin the same way however each bubble is random on\nthe sign of the pion which is chosen to be boosted\non a given side. This addition to our model is used\nin the simulations of the following subsections.\n\nC.\n\nColor electric field pionic measure.\n\nAbove we saw that pairs of positive and negative pions should show a charge separation along the\nbeam axis due to a boost in longitudinal momentum caused by the color electric field. A measure of\nthis separation should be a difference in the pseudorapidity (∆η) of the opposite sign pairs. This ∆η\nmeasure has a well defined sign since we defined this\ndifference measuring from the π − to the π + . In order to form a correlation we must pick two pairs for\ncomparison. The pairs have to come from the same\nbubble (a final state of an expanded flux tube) since\nwe have shown by investigating the events generated\nby the model that pairs originating from different\nbubbles will not show this correlation. Therefore we\nrequire the π + and the π − differ by 20◦ or less in φ.\nLet us call the first pair ∆η1 . The next pair (∆η2\nhaving the same φ requirement) has to also lie inside\nthe same bubble to show this correlation. Thus we\nrequire that there is only 10◦ between the average φ\nof each bubble. This implies that at most in φ no\ntwo pions can differ by more than 30◦ . In Fig. 11 we\nshow two pairs which would fall into the above cuts.\n∆η1 and ∆η2 are positive in Fig. 11. However if we\nwould interchange the π + and π − on either pair the\nvalue of its ∆η would change sign. Finally the mean\nvalue shown on Fig. 11 is the mid-point between the\nπ + and the π − where one really uses the vector sum\nof the π + and the π − which moves this point toward\nthe harder pion.\nConsidering the above cuts we defined a correla-\n\n\f15\ntion function where we combine pairs each having a\n∆η. Our variable is related to the sum of the absolute values of the individual ∆η's (|∆η1 |+|∆η2 |). We\nassign a sign to this sum such that if the sign of the\nindividual ∆η's are the same it is a plus sign, while if\nthey are different it is a minus sign. For the flux tube\nthe color electric field extends over a large pseudorapidity range therefore let us consider the separation\nof pairs |∆η| greater than 0.9. For the numerator of\nthe correlation function we consider all combinations\nof unique pairs (sign (|∆η1 | + |∆η2 |)) from a given\ncentral Au + Au event divided by a mixed event denominator created from pairs in different events. We\ndetermine the rescale of the mixed event denominator by considering the number of pairs of pairs for\nthe case |∆φ| lying between 50◦ and 60◦ for events\nand mixed events so that the overall ratio of this\nsample numerator to denominator is 1. By picking\n50◦ < |∆φ| < 60◦ we make sure we are not choosing\npairs from the same bubble. For a simpler notation\nlet (sign (|∆η1 | + |∆η2 |)) = ∆η1 + ∆η2 which varies\nfrom -4 to +4 since we have an over all η acceptance\n-1 to +1 (for the STAR TPC detector for which we\ncalculated). The value being near ± 4 can happen\nwhen one has a hard pion with pt of 4 GeV/c (upper\ncut) at η = 1 with a soft pion pt of 0.8 GeV/c (lower\ncut) at η = -1 combined with another pair; a hard\npion with pt of 4 GeV/c at η = -1 with a soft pion\nwith pt of 0.8 GeV/c at η = 1.\nIn Fig. 12 we show the correlation function of opposite sign charge-particle-pairs paired and binned\nby the variable ∆η1 + ∆η2 with a cut |∆η| greater\nthan 0.9 between the vector sums of the two pairs.\nThe events are generated by the PBM[1] and are\ncharged particles of 0.8 < pt < 4.0 GeV/c, and |η|\n√\n< 1, from Au + Au collisions at sN N = 200 GeV.\nSince we select pairs of pairs which are near each\nother in φ they all together pick up the bubble correlation and thus these pairs of pairs over all show\nabout a 4% correlation. In the 1.0 < ∆η1 +∆η2 < 2.0\nregion the correlation is 0.5% larger than the -2.0 <\n∆η1 + ∆η2 < -1.0 region. This means there are more\npairs of pairs aligned in the same direction compared\nto pairs of pairs not aligned. This alignment is what\nis predicted by the color electric field effect presented\nabove. In fact if one has plus minus pairs all aligned\nin the same direction and spread across a pseudorapidity range, locally at any place in the pseudorapidity range one would observe an increase of unlike sign charge pairs compared to like sign charge\npairs. At small ∆η unlike sign charge pairs are much\nlarger than like sign charge pairs in both the PBM\nand the data which agree. See Figs. 10, 11, and 14\nof Ref.[1]. Figure 11 of Ref.[1] compares the total\ncorrelation for unlike-sign charge pairs and like-sign\ncharge pairs in the precision STAR central produc-\n\ntion experiment for Au + Au central collisions (0√\n10% centrality) at sN N =200 GeV, in the transverse momentum range 0.8 < pt < 2.0 GeV/c[14].\nThe unlike-sign charge pairs are clearly larger in the\nregion near ∆φ = ∆η = 0.0. The increased correlation of the unlike-sign pairs is 0.8% ± 0.002%.\nFigure 10 of Ref.[1] shows that the PBM fit to these\ndata gives the same results. Figure 14 of Ref.[1]\nshows that the CD = unlike-sign charge pairs minus\nlike-sign charge pairs is positive for the experimental\nanalysis. Therefore the unlike-sign charge pairs are\nconsiderably larger than the like-sign charge pairs.\nIn fact this effect is so large and the alignment is so\ngreat that when one adds the unlike and like sign\ncharge pairs correlations together there is still a dip\nat small ∆η and ∆φ see Fig. 1 and Fig. 3 of the\npresent paper. The statistical significance of this\ndip in the two high precision experiments done independently from different data sets gathered 2 years\napart[14, 16] is huge. It would require a fluctuation\nof 14σ to remove the dip. This dip is also not due to\nany systematic error since both of the just cited precision experiments carefully investigated that possibility; and found no evidence to challenge the reality\nof this dip. This highly significant dip (∼14σ) means\nthat like-sign pairs are removed as one approaches\nthe region ∆η = ∆φ = 0.0. Thus this is very strong\nevidence for the predicted effect of the color electric\nfield.\n\nD.\n\nColor magnetic pionic measure.\n\nAfter considering the color electric effect we turn\nto the color magnetic effect which causes up quarks\nto rotate around the flux tube axis in one direction,\nwhile the anti-up quarks rotate in the other direction. So when a pair of quarks and anti-quarks are\nformed they will pickup or lose transverse momentum. These changes in pt will be transmitted to\nthe π + and π − pairs. It was previously shown in\nSec. III A that the CP violating asymmetries in the\nπ + and the π − momenta arise through the WittenWess-Zumino term. The quarks and anti quarks\nwhich, later form the π + and the π − , directly respond to the color electric and color magnetic fields\nand receive their boosts at the quark and anti quark\nlevel before they hadronize into pions. These boosts\nare transmitted to the π + and the π − .\nIn order to observe these differential pt changes\none must select pairs on one side of the bubble in φ\nand compare to other pairs on the other side of the\nsame bubble which would lie around 40◦ to 48◦ away\nin φ. We defined a pair as a plus particle and minus\nparticle with an opening angle (θ) of 16◦ or less. We\nare also interested in pairs that are directly on the\n\n\f16\n\n∆η1 = 0.4\n\n∆η2 = 0.6\n\n|∆φ1| = 20\n\n|∆φ2| = 20\n\n|∆η| = 1.1\n\n|∆φ| = 100\n\nφ\n\n0\n\n0\n\n+\n-\n\n-\n\n< ∆φ >\n\n1\n\n<\n\n2\n∆η\n\n>\n\n+\n\nη\nFIG. 11: Pairs of pairs selected for forming a correlation due to the boost in longitudinal momentum caused by the\ncolor electric field. The largest separation we allow in φ for plus minus pair 1 is ∆φ1 = 200 . This assures the pair is\nin the same bubble. The same is true for pair 2 so that it will also be contained in this same bubble. The mid-point\nfor pair 1 and 2 represents the vector sum of pair 1 and 2 which moves toward the harder particle when the momenta\ndiffer. These mid-points can not be separated by more than 100 in ∆φ in order to keep all four particles inside the\nsame bubble since the correlation function is almost entirely generated within the same bubble. The ∆η measure is\nthe angle between the vector sum 1 compared to the vector sum 2 along the beam axis (for this case |∆η| = 1.1).\nThe positive sign for ∆η1 comes from the fact that one moves in a positive η direction from negative to positive. The\nsame is true for ∆η2 . If we would interchange the charge of the particles of the pairs the sign would change.\n\nother side of the bubble. We require they are near in\npseudorapidity (∆η < 0.2). The above requirements\nconstrain the four charged particles comprising both\npairs to be contained in the same bubble and be close\nto being directly on opposite sides of the bubble (a\nfinal state expanded flux tube). The difference in pt\nchanges due to and predicted by the color magnetic\neffect should give the π + on one side of the bubble\nan increased pt and a decreased pt on the other side,\nwhile for the π − it will be the other way around.\nThis will lead to an anti-alignment between pairs.\nIn Fig. 13 we show two pairs which would fall into\nthe above cuts. Both pairs are at the limit of the\n\nopening angle cut θ1 and θ2 equal 16◦ . The pt of the\nplus particle for pair number 1 is 1.14 GeV/c, while\nthe minus particle is 1.39 GeV/c. Thus ∆Pt1 is equal\nto -0.25 GeV/c. The pt of the plus particle for pair\nnumber 2 is 1.31 GeV/c, the minus particle is 0.91\nGeV/c and ∆Pt2 is equal to 0.40 GeV/c. Finally\nthe mean value shown on Fig. 13 is the mid-point\nbetween the π + and the π − where one really uses\nthe vector sum of the π + and the π − which moves\nthis point toward the harder pion.\nConsidering the above cuts we defined a correlation function where we combine pairs each having a\n∆Pt . Our variable is related to the sum of the abso-\n\n\f17\n\nCorr\n\nCorrelation pt greater 0.8 and less 4.0 GeV/c\nAu Au Central 200 GeV |∆η| > 0.9\nParton Bubble Model\n\n∆η1+∆η2\nFIG. 12: Correlation function of pairs formed to exhibit the effects of longitudinal momentum boosts by the color\nelectric field as defined in the text. This correlation shows that there are more aligned pairs (correlation is larger\nby ∼0.5% between 1.0 < ∆η1 + ∆η2 < 2.0 compared to between -2.0 < ∆η1 + ∆η2 < -1.0). ∆η1 + ∆η2 is equal\nto |∆η1 | + |∆η2 |. As explained in the text this means there are more pairs of pairs aligned in the same direction\ncompared to pairs not aligned as predicted by the color electric field. The signs and more detail are also explained\nin the text.\n\nlute values of the individual ∆Pt 's (|∆Pt1 |+ |∆Pt2 |).\nWe assign a sign to this sum such that if the sign of\nthe individual ∆Pt 's are the same it is a plus sign,\nwhile if they are different it is a minus sign. For\nthe flux tube the color magnetic field extends over\na large pseudorapidity range where quarks and antiquarks rotate around the flux tube axis, therefore\nwe want to sample pairs at the different sides of the\ntube making a separation in φ (∆φ) between 40◦ to\n48◦ . We are interested in sampling the pairs on the\nother side so we require the separation in η (∆η)\nbe 0.2 or less. For the numerator of the correlation\nfunction we consider all combinations of unique pairs\n(sign (|∆Pt1 | + |∆Pt2 |)) from a given central Au +\nAu event divided by a mixed event denominator created from pairs in different events. We determine the\n\nrescale of the mixed event denominator by considering the number of pairs of pairs for the case |∆η|\nlying between 1.2 and 1.5 plus any value of |∆φ| for\nevents and mixed events so that the overall ratio of\nthis sample numerator to denominator is 1. By picking this ∆η bin for all |∆φ| we have around the same\npair count as the signal cut with the ∆φ correlation\nof the bubbles being washed out. For a simpler notation let (sign (|∆Pt1 | + |∆Pt2 |)) = ∆Pt1 + ∆Pt2\nwhich we plot in the range from -4 to +4 since we\nhave an over all pt range 0.8 to 4.0 GeV/c. Thus the\nmaximum magnitude of ∆Pt 's is 3.2 GeV/c which\nmakes ∆Pt1 + ∆Pt2 have a range of ±6.4. However\nthe larger values near these range limits occur very\nrarely.\nIn Fig. 14 we show the correlation function of op-\n\n\f18\n\nθ1 = 160\nθ2 = 16\n\n0\n\n∆Pt1 = -.25 GeV/c\n\n-\n\n∆φ\n\n|∆η| = 0.19\n|∆φ| = 450\n+\n\n∆η>\n2\n-\n\n<\n\nφ\n\n∆Pt2 = .40 GeV/c\n\n>\n\n+\n\n1\n\nη\nFIG. 13: Pairs of pairs selected for forming a correlation exhibiting the effect of changes in pt due to the color\nmagnetic field. The largest opening angle θ for plus minus pairs is 16◦ or less. This opening angle assures that each\npair has a high probability that it arises from a quark anti-quark pair. In this figure we have picked two pairs at\nthis limit (θ1 = 16◦ and θ2 = 16◦ ). The mid-point for pair 1 and 2 represents the vector sum of pair 1 and 2 which\nmoves toward the harder particle when the momenta differ. These mid-points are chosen to have 40◦ < |∆φ| < 48◦\nin order for the pairs to be on opposite sides of the bubble. Since we are interested in pairs directly across the bubble\nwe make the ∆η separation be no more than 0.2. The difference in pt for pair 1 is ∆Pt1 = -0.25 GeV/c, while the\ndifference in pt for pair 2 is ∆Pt2 = 0.40 GeV/c. The minus sign for 1 follows from the fact that the plus particle has\n1.14 GeV/c and the minus particle has 1.39 GeV/c. The plus sign for 2 follows from the fact that the plus particle\nhas 1.31 GeV/c and the minus particle has 0.91 GeV/c.\n\nposite sign charged-particle-pairs paired and binned\nby the variable ∆Pt1 + ∆Pt2 with a cut |∆η| less\nthan 0.2 between the vector sums of the two pairs,\nand with 40◦ < |∆φ| < 48◦ . The events are generated by the PBM[1] and are charged particles of\n0.8 < pt < 4.0 GeV/c, with |η| < 1, from Au +\n√\nAu collisions at sN N = 200 GeV. Since we select\npairs of pairs which are near each other in φ (40◦ to\n48◦ ) they all together pick up the bubble correlation\nand thus these pairs of pairs over all show about a\n0.4% correlation. In the -4.0 < ∆Pt1 + ∆Pt2 < -1.0\nregion the correlation increases from 0.4% to 1%,\n\nwhile in the 1.0 < ∆Pt1 + ∆Pt2 < 4.0 region the correlation decreases from 0.4% to -0.2%. This means\nthe pairs of pairs are anti-aligned at a higher rate\nthan aligned. This anti-alignment is what is predicted by the color magnetic field effect presented\nabove. In fact the anti-alignment increases with pt\nas the ratio bubble particle to background increases.\nHowever these predicted color magnetic effects have\nnot been searched for yet and therefore there is no\nexperimental evidence for them. Experimental investigations of our presented four charged particle\ncorrelations provide a method of obtaining experi-\n\n\f19\n\nCorrelation pt greater 0.8 and less 4.0 GeV/c\nAu Au Central 200 GeV\n\nCorr\n\n|∆η| < 0.2 and 400< |∆φ| < 480\n\n∆Pt1+∆Pt2\nFIG. 14: Correlation function of pairs of pairs formed for exhibiting the effect of changes in pt due to the color\nmagnetic field as defined in the text. This correlation shows that there are more anti-aligned pairs. The correlation\nis larger by ∼1.2% for ∆Pt1 + ∆Pt2 = -4.0 compared to ∆Pt1 + ∆Pt2 = 4.0. ∆Pt1 + ∆Pt2 is equal to |∆Pt1 | + |∆Pt2 |\nwhere the sign is also explained in the text.\n\nmental confirmation of the anti-alignment caused by\nthe color magnetic field.\n\nIV.\n\nSUMMARY AND DISCUSSION\n\nIn this article we have made a direct connection\nbetween our Parton Bubble Model (PBM[1]) and\nthe Glasma Flux Tube Model (GFTM)[2]). In the\nGFTM a flux tube is formed right after the initial\ncollision of the Au + Au system. This flux tube extends over many units of pseudorapidity (∆η). In\nthe PBM this flux tube is approximated by a sum of\npartons which are distributed over this same large\n∆η region. A blast wave gives the tubes near the\nsurface transverse flow in the same way it gave flow\nto the bubbles in the PBM. This means the transverse momentum (pt ) distribution of the flux tube is\n\ndirectly translated to the pt spectrum of the PBM.\nInitially the transverse space is filled with flux\ntubes of large longitudinal extent but small transverse size ∼Q−1\ns . The flux tubes that are near the\nsurface of the fireball get the largest radial flow and\nare emitted from the surface. As in the parton bubble model these partons shower and the higher pt\nparticles escape the surface and do not interact. Qs\nis around 1 GeV/c thus the size of the flux tube is\nabout 1/4f initially. The flux tubes near the surface\nare initially at a radius ∼5 fm. The φ angle wedge\nof the flux tube ∼ 1/20 radians or ∼3◦ . In Sec. I\nD (also see Sec. I C) we connect the GFTM to the\nPBM (see Sec. I B): by assuming the bubbles are\nthe final state of a flux tube at kinetic freezeout,\nand discussing evidence for this connection which is\nfurther developed in Sec. II and Sec. III.\nWith the connection of the PBM to the GFTM\n\n\f20\ntwo new predictions become possible for our PBM.\nThe first is related to the fact that the blast wave\nradial flow given to the flux tube depends on where\nthe tube is initially in the transverse plane of the\ncolliding Au + Au system. The tube gets the same\nradial boost all along its longitudinal length. This\nmeans that there is correlated pt among the partons\nof the bubble. In this paper we consider predictions\nwe can make in regard to interesting topics and comparisons with relevant data which exist by utilizing\nthe parton bubble model (PBM[1]), and its features\nrelated to the glasma flux tube model (GFTM)[2]).\nTopic 1: The ridge is treated in Sec. II.\nTopic 2: Strong CP violation (Chern-Simons\ntopological charge) is treated in Sec. III.\nWe show in Sec. II that if we trigger on particles\nwith 3 to 4 GeV/c and correlate this trigger particle\nwith an other charged particle of greater than 1.1\nGeV/c, the PBM can produce a phenomenon very\nsimilar to the ridge[2, 23, 24, 25, 26, 27, 28, 29, 30].\n(See Figs. 2-8). We then selected charged particles\ninside the ridge and predicted the correlation that\none should observe when compared to the average\ncharged particles of the central Au + Au collisions\n√\nat sN N = 200 GeV[14, 16].\nIn Sec. II D (Comparison to data): Triggered\nexperimental angular correlations showing the ridge\nwere presented at Quark Matter 2006[31]. Figure\n7 shows the experimental ∆φ vs. ∆η CI correla√\ntion for 0-10% central Au + Au collisions at sN N\n= 200; requiring one trigger particle pt between 3\nto 4 GeV/c and an associated particle pt above 2.0\nGeV/c. The yield is corrected for the finite ∆η pair\nacceptance.\nFor the PBM generator, we then form a two\ncharged particle correlation between one charged\nparticle with a pt between 3.0 to 4.0 GeV/c and another charged particle whose pt is geater than 2.0\nGeV/c. These are the same trigger conditions as\nin Ref.[31] which is shown in Fig. 7, that shows\nthe corrected pair yield in the central data. Fig.\n8 shows the correlation function generated by the\nPBM which does not depend on the number of\nevents analyzed. The two figures were shown to be in\nreasonable agreement when compared as explained\npreviously in Sec. II D. In Fig. 9 we show the ridge\nsignal predicted by the PBM for very similar data\nbut with 0-5% centrality. Figure 10 shows the extraction of the jet signal. Explanations are given in\nthe text.\nThe second prediction is a development of a predictive pionic measure of the strong CP Violation.\nThe GFTM flux tubes are made up of longitudinal color electric and magnetic fields which generate\ntopological Chern-Simons charge[3] through the F Fe\nterm that becomes a source of CP violation. The\n\ncolor electric field which points along the flux tube\naxis causes an up quark to be accelerated in one direction along the beam axis, while the anti-up quark\nis accelerated in the other direction. So when a pair\nof quarks and anti-quarks are formed they separate\nalong the beam axis leading to a separated π + and\nπ − pair along this axis. The color magnetic field\nwhich also points along the flux tube axis (which\nis parallel to the beam axis) causes an up quark to\nrotate around the flux tube axis in one direction,\nwhile the anti-up quark rotates in the other direction. So when a pair of quarks and anti-quarks are\nformed they will pickup or lose transverse momentum. These changes in pt will be transmitted to the\nπ + and π − pairs.\nThe above pionic measures of strong CP violation are used to form correlation functions based on\nfour particles composed of two pairs which are opposite sign charge-particle-pairs that are paired and\nbinned. These four particle correlations accumulate\nfrom bubble to bubble by particles that are pushed\nor pulled (by the color electric field) and rotated (by\nthe color magnetic field) in a right or left handed direction. The longitudinal color electric field predicts\naligned pairs in a pseudorapidity or ∆η measure.\nThe longitudinal color magnetic field predicts antialigned pairs in a transverse momentum or ∆Pt measure. The observations of these correlations would\nbe a strong confirmation of this theory. The much\nlarger unlike-sign pairs than like-sign pairs in the\nPBM and the data; and the strong dip of the CI\ncorrelation at small ∆η (see Fig. 1 and Sec. III\nC for full details) shows very strong evidence supporting the color electric alignment prediction in the\n√\nsN N = 200 GeV central Au + Au collision data\nanalyses at RHIC[1, 14]. This highly significant dip\n(∼14σ) means that like-sign pairs are removed as\none approaches the region ∆η = ∆φ = 0.0. Thus\nthis is very strong evidence for the predicted effect\nof the color electric field. The color magnetic antialigned pairs in the transverse momentum prediction, treated in Sec. III C as of now has not been\nobserved or looked for. However our predicted specific four charged particle correlations can be used to\nsearch for experimental evidence for the color magnetic fields.\nOur success in demonstrating strong experimental\nevidence for the expected color electric field effects\nfrom previously published data suggests that the\nunique detailed correlations we have presented for\nsearching for evidence for the predicted color magnetic field effects should be urgently investigated.\nIf we are lucky and the predicted color magnetic effects can be confirmed experimentally we would have\nstrong evidence for the following:\n1) CP is violated in the strong interaction in\n\n\f21\nisolated local space time regions where topological\ncharge[3] is generated.\n2) The glasma flux tube model (GFTM) which\nwas evolved from the color glass condensate (CGC)\nwould be found to be consistent with a very significant experimental check.\n3) The parton bubble model event generator\n(PBM) is clearly closely connected to the GFTM.\nThe bubble substructure strongly supported by the\nPBM is likely due to the final state of the flux tube\nat kinetic freezeout.\n\n[1] S.J. Lindenbaum, R.S. Longacre, Eur. Phys. J. C.\n49, 767-782 (2007).\n[2] A. Dumitru, F. Gelis, L. McLerran and R. Venugopalan, Nucl. Phys. A 810, 91 (2008).\n[3] D. Kharzeev, A. Krasnitz and R. Venugopalan,\nPhys. Lett. B 545, 298 (2002).\n[4] L. Van Hove, Z. Phys. C 27, 135 (1985).\n[5] S.J. Lindenbaum, R.S. Longacre, J. Phys. G 26, 937\n(2000).\n[6] D. Kharzeev, R.D. Pisarski, Phys. Rev. D 61,\n111901 (2000).\n[7] C. Adler et al., Phys. Rev. Lett. 87, 082301 (2001).\n[8] S.J. Lindenbaum, R.S. Longacre M. Kramer, Eur.\nPhys. J. C. 30, 241 (2003).\n[9] J. Adams et al., Phys. Rev. C. 71, 044906 (2005),\nS.S. Adler et al., Phys Rev. Lett. 93, 152302 (2004).\n[10] X.N. Wang and M. Gyulassy, Phys. Rev. D 44, 3501\n(1991).\n[11] K. Adcox et al., Phys. Rev. Lett. 88, 022301 (2001).\n[12] Nucl. Instrum. Meth. A 499,(2003), C. Adler et\nal., 433-436, K.H. Ackermann et al.(STAR Collaboration), 624-632, M. Anderson et al., 659-678,\nF.S. Bieser et al., 766-777.\n[13] T. Sjostrand, M. van Zijil, Phys. Rev. D 36, 2019\n(1987).\n[14] J. Adams et al., Phys. Rev. C 75, 034901 (2007).\n[15] S.J. Lindenbaum and R.S. Longacre, Phys. Rev. C\n78, 054904 (2008).\n[16] B.I. Abelev et al., arXiv:0806.0513[nucl-ex].\n[17] J. Adams et al., Phys. Rev. Lett. 91, 172302 (2003).\n[18] A. Adare et al., arXiv:0801.4020[nucl-ex].\n\nV.\n\nACKNOWLEDGMENTS\n\nThis research was supported by the U.S. Department of Energy under Contract No. DE-AC0298CH10886 and the City College of New York\nPhysics Department. The authors thank William\nLove for valuable discussion and assistance in production of figures.\n\n[19] L. McLerran and R. Venugopalan, Phys. Rev. D 49,\n2233 (1994); Phys. Rev. D 49, 3352 (1994); Phys.\nRev. D 50, 2225 (1994).\n[20] T. Lappi and L. McLerran, Nucl. Phys. A 772, 200\n(2006).\n[21] F. Gelis and R. Venugopalan, Acta Phys. Polon. B\n37, 3253 (2006).\n[22] S. Gavin, L. McLerran and G. Moschelli,\narXiv:0806.4718[nucl-th].\n[23] N. Armesto, C. Salgado, U.A. Wiedemann, Phys\nRev. Lett. 93, 242301 (2004).\n[24] P. Romatschke, Phys. Rev. C. 75, 014901 (2007).\n[25] E. Shuryak, Phys. Rev. C. 76, 047901 (2007).\n[26] A. Dumitru, Y. Nara, B. Schenke, M. Strickland,\narXiv:0710.1223[hep-ph].\n[27] V.S. Pantuev, arXiv:0710.1882[hep-ph].\n[28] R. Mizukawa, T. Hirano, M. Isse, Y. Nara,\nA. Ohnishi, arXiv:0805.2795[nucl-th].\n[29] C.Y. Wong, arXiv:0806.2154[hep-ph].\n[30] R.C. Hwa, arXiv:0708.1508[nucl-th].\n[31] J. Putschke, J.Phys. G: Nucl. Part. Phys. 34, S679\n(2007).\n[32] C. Vafa, E. Witten, Phys. Rev. Lett. 53, 535 (1984),\nNucl. Phys. B 234, 173 (1984).\n[33] D. Kharzeev, R.D. Pisarski, M.H.G. Tytgat, Phys.\nRev. Lett. 81, 512 (1998).\n[34] C. Vafa, E. Witten, Nucl. Phys. B 233, 422 (1983).\n[35] J. Wess, and B. Zumino, Phys. Lett. 37B, 95 (1971)\n[36] L.E. Finch et al., Phys. Rev. C 65, 014908 (2001).\n\n\f"}