{"id": "http://arxiv.org/abs/1004.3307v3", "guidislink": true, "updated": "2010-12-21T04:46:53Z", "updated_parsed": [2010, 12, 21, 4, 46, 53, 1, 355, 0], "published": "2010-04-19T21:08:13Z", "published_parsed": [2010, 4, 19, 21, 8, 13, 0, 109, 0], "title": "Parity-Violating Electron-Deuteron Scattering with a Twist", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1004.3416%2C1004.2810%2C1004.4078%2C1004.1627%2C1004.1894%2C1004.2874%2C1004.4318%2C1004.4705%2C1004.0141%2C1004.4867%2C1004.3190%2C1004.2191%2C1004.2821%2C1004.4759%2C1004.5450%2C1004.0138%2C1004.0933%2C1004.2649%2C1004.1154%2C1004.1540%2C1004.2182%2C1004.4479%2C1004.1339%2C1004.0147%2C1004.4900%2C1004.2802%2C1004.1013%2C1004.4279%2C1004.3039%2C1004.5365%2C1004.5006%2C1004.4586%2C1004.5583%2C1004.4044%2C1004.5265%2C1004.0521%2C1004.5208%2C1004.2189%2C1004.3654%2C1004.0450%2C1004.1919%2C1004.5543%2C1004.3307%2C1004.4350%2C1004.2256%2C1004.5524%2C1004.1733%2C1004.5567%2C1004.4527%2C1004.0572%2C1004.0339%2C1004.2495%2C1004.5573%2C1004.2818%2C1004.2061%2C1004.0614%2C1004.0290%2C1004.2890%2C1004.3535%2C1004.2503%2C1004.0418%2C1004.5015%2C1004.4801%2C1004.1033%2C1004.3136%2C1004.1650%2C1004.4626%2C1004.4715%2C1004.0121%2C1004.3286%2C1004.3570%2C1004.0292%2C1004.5508%2C1004.5293%2C1004.2927%2C1004.3590%2C1004.4001%2C1004.1195%2C1004.3912%2C1004.1034%2C1004.4055%2C1004.4877%2C1004.4122%2C1004.1518%2C1004.2206%2C1004.1964%2C1004.1038%2C1004.2654%2C1004.0123%2C1004.4672%2C1004.1379%2C1004.4945%2C1004.1864%2C1004.0652%2C1004.0679%2C1004.2389%2C1004.1307%2C1004.1146%2C1004.1588%2C1004.5244%2C1004.4499&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Parity-Violating Electron-Deuteron Scattering with a Twist"}, "summary": "We show that Parity-Violating Deep Inelastic Scattering (PVDIS) of\nlongitudinally polarized electrons from deuterium can in principle be a\nrelatively clean probe of higher twist quark-quark correlations beyond the\nparton model. As first observed by Bjorken and Wolfenstein, the dominant\ncontribution to the electron polarization asymmetry, proportional to the axial\nvector electron coupling, receives corrections at twist-four from the matrix\nelement of a single four-quark operator. We reformulate the Bjorken/Wolfenstein\nargument in a matter suitable for the interpretation of experiments planned at\nthe Thomas Jefferson National Accelerator Facility (JLab). In particular, we\nobserve that because the contribution of the relevant twist four operator\nsatisfies the Callan-Gross relation, the ratio of parity-violating longitudinal\nand transverse cross sections, R_{\\gamma Z}, is identical to that for purely\nelectromagnetic scattering, R_{\\gamma}, up to perturbative and power suppressed\ncontributions. This result simplifies the interpretation of the asymmetry in\nterms of other possible novel hadronic and electroweak contributions. We use\nthe results of MIT Bag Model calculations to estimate contributions of the\nrelevant twist four operator to the leading term in the asymmetry as a function\nof Bjorken x and Q2 . We compare these estimates with possible leading twist\ncorrections due to violation of charge symmetry in the parton distribution\nfunctions.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1004.3416%2C1004.2810%2C1004.4078%2C1004.1627%2C1004.1894%2C1004.2874%2C1004.4318%2C1004.4705%2C1004.0141%2C1004.4867%2C1004.3190%2C1004.2191%2C1004.2821%2C1004.4759%2C1004.5450%2C1004.0138%2C1004.0933%2C1004.2649%2C1004.1154%2C1004.1540%2C1004.2182%2C1004.4479%2C1004.1339%2C1004.0147%2C1004.4900%2C1004.2802%2C1004.1013%2C1004.4279%2C1004.3039%2C1004.5365%2C1004.5006%2C1004.4586%2C1004.5583%2C1004.4044%2C1004.5265%2C1004.0521%2C1004.5208%2C1004.2189%2C1004.3654%2C1004.0450%2C1004.1919%2C1004.5543%2C1004.3307%2C1004.4350%2C1004.2256%2C1004.5524%2C1004.1733%2C1004.5567%2C1004.4527%2C1004.0572%2C1004.0339%2C1004.2495%2C1004.5573%2C1004.2818%2C1004.2061%2C1004.0614%2C1004.0290%2C1004.2890%2C1004.3535%2C1004.2503%2C1004.0418%2C1004.5015%2C1004.4801%2C1004.1033%2C1004.3136%2C1004.1650%2C1004.4626%2C1004.4715%2C1004.0121%2C1004.3286%2C1004.3570%2C1004.0292%2C1004.5508%2C1004.5293%2C1004.2927%2C1004.3590%2C1004.4001%2C1004.1195%2C1004.3912%2C1004.1034%2C1004.4055%2C1004.4877%2C1004.4122%2C1004.1518%2C1004.2206%2C1004.1964%2C1004.1038%2C1004.2654%2C1004.0123%2C1004.4672%2C1004.1379%2C1004.4945%2C1004.1864%2C1004.0652%2C1004.0679%2C1004.2389%2C1004.1307%2C1004.1146%2C1004.1588%2C1004.5244%2C1004.4499&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We show that Parity-Violating Deep Inelastic Scattering (PVDIS) of\nlongitudinally polarized electrons from deuterium can in principle be a\nrelatively clean probe of higher twist quark-quark correlations beyond the\nparton model. As first observed by Bjorken and Wolfenstein, the dominant\ncontribution to the electron polarization asymmetry, proportional to the axial\nvector electron coupling, receives corrections at twist-four from the matrix\nelement of a single four-quark operator. We reformulate the Bjorken/Wolfenstein\nargument in a matter suitable for the interpretation of experiments planned at\nthe Thomas Jefferson National Accelerator Facility (JLab). In particular, we\nobserve that because the contribution of the relevant twist four operator\nsatisfies the Callan-Gross relation, the ratio of parity-violating longitudinal\nand transverse cross sections, R_{\\gamma Z}, is identical to that for purely\nelectromagnetic scattering, R_{\\gamma}, up to perturbative and power suppressed\ncontributions. This result simplifies the interpretation of the asymmetry in\nterms of other possible novel hadronic and electroweak contributions. We use\nthe results of MIT Bag Model calculations to estimate contributions of the\nrelevant twist four operator to the leading term in the asymmetry as a function\nof Bjorken x and Q2 . We compare these estimates with possible leading twist\ncorrections due to violation of charge symmetry in the parton distribution\nfunctions."}, "authors": ["Sonny Mantry", "Michael J. Ramsey-Musolf", "Gian Franco Sacco"], "author_detail": {"name": "Gian Franco Sacco"}, "author": "Gian Franco Sacco", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1103/PhysRevC.82.065205", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1004.3307v3", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1004.3307v3", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "27 pages, 3 figures, typos fixed, version accepted for publication in\n  Physical Review C", "arxiv_primary_category": {"term": "hep-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "hep-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "nucl-ex", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "nucl-th", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1004.3307v3", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1004.3307v3", "journal_reference": "Phys.Rev.C82:065205,2010", "doi": "10.1103/PhysRevC.82.065205", "fulltext": "NPAC-10-06\n\nParity-Violating Electron-Deuteron Scattering with a Twist\nSonny Mantry,1, ∗ Michael J. Ramsey-Musolf,1, 2, † and Gian Franco Sacco3, ‡\n1 University\n\nof Wisconsin-Madison, Madison, WI 53706\nInstitute of Technology, Pasadena, CA 91125\n3 Jet Propulsion Lab/ California Institute of Technology, Pasadena, CA, 91109\n2 California\n\narXiv:1004.3307v3 [hep-ph] 21 Dec 2010\n\nWe show that Parity-Violating Deep Inelastic Scattering (PVDIS) of longitudinally polarized electrons from deuterium can in principle be a relatively clean probe\nof higher twist quark-quark correlations beyond the parton model. As first observed\nby Bjorken and Wolfenstein, the dominant contribution to the electron polarization\nasymmetry, proportional to the axial vector electron coupling, receives corrections\nat twist-four from the matrix element of a single four-quark operator. We reformulate the Bjorken/Wolfenstein argument in a matter suitable for the interpretation of\nexperiments planned at the Thomas Jefferson National Accelerator Facility (JLab).\nIn particular, we observe that because the contribution of the relevant twist four\noperator satisfies the Callan-Gross relation, the ratio of parity-violating longitudinal\nand transverse cross sections, RγZ , is identical to that for purely electromagnetic\nscattering, Rγ , up to perturbative and power suppressed contributions. This result simplifies the interpretation of the asymmetry in terms of other possible novel\nhadronic and electroweak contributions. We use the results of MIT Bag Model calculations to estimate contributions of the relevant twist four operator to the leading\nterm in the asymmetry as a function of Bjorken x and Q2 . We compare these estimates with possible leading twist corrections due to violation of charge symmetry in\nthe parton distribution functions.\n\n∗\n\nmantry147@gmail.com\nmjrm@physics.wisc.edu\n‡\ngianfranco.sacco@jpl.nasa.gov\n†\n\n\f2\nI.\n\nINTRODUCTION\n\nIn the 1970s parity-violating deep inelastic scattering (PVDIS) of longitudinally polarized\nelectrons from deuterium played an important role in confirming the Standard Model (SM)\nof particle physics [1–3]. The asymmetry\nσR − σL\n,\n(1)\nARL =\nσR + σL\nwith σR,L corresponding to the scattering cross-section with positive and negative helicity\nelectrons respectively, is an excellent probe of the parity-violating electroweak interactions\nin the SM. The results of measuring this asymmetry in the early experiments at SLAC\nled to the correct description of neutral weak interactions well before the discovery of the\nZ boson at CERN and provided a measurement of the weak mixing angle sin2 θW . Since\nthen parity-violating electron scattering from various targets has been studied at JLab [4–7],\nMIT/Bates [8, 9], Mainz [10, 11], and SLAC[12] as a tool for probing physics beyond the\nSM and hadronic structure.\nCurrently, an active program is underway at JLab to continue these studies with a new\nlevel of precision. The Q-Weak experiment [13], which will measure the weak charge of\nthe proton at low electron momentum transfer (Q2 ), is expected to determine sin2 θW to\n0.3% precision, making it the most precise test of the running of the weak mixing angle to\ndate. Furthermore, the recently approved 12 GeV upgrade of CEBAF at JLab, expected\nto be completed by 2014, aims to begin the next generation Moller and electron-deuteron\nscattering experiments. The SOLID proposal [14] for precision parity-violating electrondeuteron scattering, approved as part of the 12 GeV upgrade, will measure ARL over a wide\nkinematic range in Q2 and Bjorken-x to within 1% at each kinematic point. In addition,\none high-precision PVDIS experiment with deuterium has completed data taking at selected\nkinematic points with the 6 GeV [15] beam and another is approved to run at the 12 GeV [16]\nbeam. These present and prospective high-precision experimental measurements present new\nchallenges for their theoretical interpretation. In particular, substantial uncertainties in the\ntheoretical interpretation of the deep inelastic asymmetries will remain unless various effects\ncontributing to the asymmetry such as new physics beyond the SM, sea quark distributions,\nCharge Symmetry Violation (CSV), and higher twist contributions are well understood and\ndisentangled from each other. Addressing one aspect of these issues is the subject of this\npaper.\nThe theoretical interpretation of the deuterium asymmetry can be facilitated by expressing it in the following form\n!\"\n#\nγZ\nγZ\ne\nF\ng\nF\nGF Q2\n1\n3\nV\nARL = − √\ngAe Y1 γ +\nY3 γ .\n(2)\nF1\n2\nF1\n4 2πα\nHere, gVe (gAe ) are the vector (axial vector) couplings of the Z-boson to the electron; F1γ , F1γZ ,\nand F3γZ are the structure functions arising, respectively, from hadronic matrix elements of\n\n\f3\nthe vector electromagnetic (EM) current, interference of the vector EM and vector weak\nneutral current (WNC), and interference of the vector EM current and axial vector WNC;\nand Y1,3 are functions of kinematic variables and the ratios Rγ and RγZ of longitudinal\nand transverse cross sections for purely EM and WNC-EM vector current interference cross\nsections. In the SM, at leading twist and in the absence of CSV effects, the Y1 term in Eq.(2)\nis independent of y and depends only on gAe and the vector current coupling of the Z-boson\nto quarks [3]. Since gVe = −1 + 4 sin2 θW ∼ −0.1, the Y1 -term dominates the asymmetry,\nmaking its scrutiny particularly important for the interpretation of the Jefferson Lab PVDIS\nprogram.\nConsiderable theoretical effort has been devoted to disentangling the various contributions to the asymmetry. The effect of twist-four contributions to the asymmetry was first\nconsidered in papers by Bjorken and Wolfenstein [17, 18] more than thirty years ago, where\nit was shown to arise in the dominant axial electron coupling term from a single, non-local\nfour-quark operator in the limit of good isospin, negligible sea-quark and CSV effects, and\nup to corrections in αs (Q2 ). Quantitative estimates of twist-four effects were first obtained\nin [19] where the contribution of the spin-two operators was estimated using the MIT Bag\nModel. This analysis was extended in [20] to include corrections to the F3γZ structure function. More recently, higher twist effects to the asymmetry were estimated by the authors\nof Ref. [21], who considered the possibility that Rγ and RγZ receive substantially different contributions from finite-Q2 effects. These authors argued that such a difference could\nintroduce hadronic uncertainties that might impede the extraction of CSV effects from ARL .\nIn this paper, we draw on the observations of [17, 18] that the twist-four contribution to\nthe Y1 term in ARL for deuterium, given in Eq. (2), arises from a single four-quark operator\ninvolving up- and down-quark fields\n1\nμν\nOud\n(x) = [ū(x)γ μ u(x)d(0)γ ν d(0) + (u ↔ d)]\n2\n\n(3)\n\nμν\nto revisit the analysis of Ref. [21]. Noting that the contribution of Oud\n(x) to the electroweak\nstructure functions satisfies the Callan-Gross relation at leading order in the strong coupling,\nwe find that\n\nRγZ = Rγ\n\nand\n\nY1 = 1,\n\n(4)\n\nat twist-four up to perturbative corrections. Consequently, all twist-four effects entering the\ndominant term in the asymmetry reside in the ratio F1γZ /F1γ .\nUsing the power law dependence in Q2 of the twist-four effects to the Y1 -term it may be\npossible, with the precision and the wide kinematic range of the PVDIS program at JLab\nand its possible extension at an electron-ion collider [22] , to disentangle twist-four effects\nfrom CSV effects depending on their relative overall sizes. To provide theoretical guidance\nfor such a program, we utilize the MIT Bag Model[23] to estimate the size and variation of\nthe twist-four contribution with Bjorken-x and Q2 . These estimates extend the earlier work\n\n\f4\nof Ref. [20] by allowing for the x-dependences of the twist-two and twist-four contributions\nγ(γZ)\nto F1\nto differ. We find that if the MIT Bag Model reasonably estimates the magnitude\nμν\nof the twist-four contribution from Oud\n(x), the impact on the asymmetry would likely be\ntoo small to be extracted without further improvements in experimental precision. In this\ncase, however, the planned PVDIS experiments could in principle provide a theoretically\nclean probe of possible contributions from CSV and/or physics beyond the SM. Conversely,\nthe observation of significant power corrections to the Y1 term would signal the presence\nof relatively large and theoretically interesting quark-quark correlation contributions to the\nelectroweak structure functions.\nOur analysis leading to these conclusions is organized in the remainder of the paper as\nfollows. In Section II, we provide an overview of the structure of the deuterium asymmetry,\nsetting the context for our analysis of the twist-four contributions in Section III. In Section\nIV we give our MIT Bag Model estimates and compare these with recent parameterizations of\nCSV contributions as well as possible effects from \"new physics\" in Section V. We summarize\nour conclusions in Section VI. In appendix A, we also recast the argument of [24–26] in the\nlanguage of the Soft-Collinear Effective Theory(SCET) [27–29] that shows manifestly that\nthe twist-four matrix element contributing to the Y1 -term satisfies the Callan-Gross relation\nat tree level in the matching.\nII.\n\nOVERVIEW\n\nBefore presenting the formalism and derivation of our results, we provide an overview of\nthe structure of the deuterium asymmetry and the context for the higher twist contributions. The SM parity violating interactions of the electron with the quarks, obtained after\nintegrating out the Z-boson, are parameterized as\n\u0001\n\u0001i\nGF h\n ̄ μ d + ēγ μ e C2u ūγμ γ5 u + C2d dγ\n ̄ μ γ5 d ,\n(5)\nL = √ ēγ μ γ5 e C1u ūγμ u + C1d dγ\n2\nwhere the coefficients C1q and C1q are given by\n\u0010\n\u0011\nC1q = 2ρ̂N C I3e I3q − 2Qq κ̂ sin2 θ̂W −\n\u0010\n\u0011\nC2q = 2ρ̂N C I3q I3e − 2Qe κ̂ sin2 θ̂W −\n\n1 q\nλ̂\n2 1\n1 q\nλ̂\n2 2\n\n(6)\n.\n\n(7)\n\nHere I3f is the third component of weak isospin for fermion f , Qf is the electromagnetic\ncharge, and θ̂W is the weak mixing in the MS scheme. The quantities ρ̂N C , κ̂, and λ̂qj encode\nthe effects of electroweak radiative corrections and take on the values one, one, and zero,\nrespectively, at tree-level, leading to\n1 4\ntree\n= − + sin2 θW ,\nC1u\n2 3\n1\ntree\nC2u\n= − + 2 sin2 θW ,\n2\n\n1 2 2\n− sin θW ,\n2 3\n1\n= − 2 sin2 θW .\n2\n\ntree\n=\nC1d\ntree\nC2d\n\n(8)\n\n\f5\nThe reason for the high sensitivity of ARL to these interactions is that in the limit of\ngood isospin and negligible sea quark effects, all hadronic effects are known to cancel in the\nasymmetry at leading order in the twist expansion (corresponding to the parton model limit).\nThe resulting expression for the asymmetry, known as the Cahn-Gilman (CG) formula [3],\nis given at tree-level by1\n\u0001 1 − (1 − y)2 i\n20 2 \u0001\nGF Q2 9 h\n2\n√\n1\n−\nsin\nθ\n+\n1\n−\n4\nsin\nθ\n.\nARL\n=\n−\nW\nW\nCG\n9\n1 + (1 − y)2\n2 2πα 10\n\n(9)\n\nHere y is the kinematic variable defined as\n2P * (` − `0 )\n,\n2P * `\n\n(10)\n\nGF Q2 9 h\n1 − (1 − y)2 i\n= − √\nã1 + ã2\n,\n1 + (1 − y)2\n2 2πα 10\n\n(11)\n\ny =\n\nwhere Pμ , `μ , and `0μ denote the four momenta of the deuteron, the incoming electron, and\nthe outgoing electron respectively. In the lab frame, one has y = (E − E 0 )/E where E and\nE 0 denote of the energies of the incoming and and outgoing electrons. The corrections to\nthis Cahn-Gilman formula can be parameterized by writing the asymmetry as\nARL\n\nwhere the parameters ãj (j = 1, 2) are schematically written as\n\u0002\n\u0003\n2\nãj = − (2Cju − Cjd ) 1 + Rj (new) + Rj (sea) + Rj (CSV) + Rj (TMC) + Rj (HT) (12)\n3\nand Rj (new), Rj (sea), Rj (CSV), Rj (TMC), and Rj (HT) denote respectively corrections\narising from possible new physics beyond the SM, sea quark effects, CSV, target mass\ncorrections (TMC) [31, 32], and higher twist (HT) contributions. If one is interested in\nlooking for signals of new physics beyond the SM that can leave a footprint in the asymmetry\nvia the contributions R1,2 (new), it is crucial that all the SM electroweak and hadronic\ncorrections to the Cahn-Gilman formula in Eq. (12) are under theoretical and experimental\ncontrol. One can take an alternative viewpoint and instead view a precision measurement of\nARL as a probe of hadronic physics that modifies the Cahn-Gilman formula as in Eqs.(11)\nand (12).\nThe analysis of this paper is focused on the higher twist correction R1 (HT) that enters\nthe ã1 term of the asymmetry. The leading contribution to R1 (HT) appears at twist-four,\ngiving rise to a 1/Q2 power law dependence. In contrast, the leading contribution from\nR1 (TMC), which will also have a 1/Q2 power law contribution, will be suppressed relative\nto R1 (HT). The relative suppression of R1 (TMC) can be understood by noting that the\nderivation of the Cahn-Gilman formula is valid even for a finite target mass so that target\n1\n\nWe observe that the RHS of Eq.(4.89) of Ref. [30] should be multiplied by (-1).\n\n\f6\nmass corrections will always appear in conjunction with at least one of the already small\neffects that correct the Cahn-Gilman formula.\nGiven that all the remaining contributions to ã1 in Eq. (12) have at most a logarithmic\ndependence on Q2 , one can, in principle, make a clean extraction of R1 (HT) by studing the\nQ2 dependence of the ã1 term in the asymmetry. Similar statements can be made for the\nhigher twist effects R2 (HT) that contribute to the ã2 term of the asymmetry. However, the\nstudy of R1 (HT) is particularly interesting because the leading contribution to R1 (HT) that\narises at twist-four is given entirely by a single matrix element that characterizes quark-quark\ncorrelations in the deuteron as first observed in [17, 18]. This is in contrast to R2 (HT), which\nreceives contributions from several different twist-four matrix elements making it difficult\nto interpret the effect of correlations among quarks and gluons in terms of any one of the\nthese matrix elements.\nBefore giving the explicit expression for R1 (HT) that we derive below, we first review\nsome of the standard notation used in PVDIS pehenomenology. The general expression for\nγ\nγZ\nthe asymmetry ARL is given in terms of the five structure functions F1,2\nand F1,2,3\ntakes the\nform [21]\n\u0010 G Q2 \u0011 g e 2xyF γZ − 2\u00021 − 1/y + xM \u0003F γZ \u0001 + g e x(2 − y)F γZ\nF\n1\n2\n3\nA\nE\n\u0002\n\u0003 Vγ\n.\n(13)\nARL = − √\n2xyF1γ − 2 1 − 1/y + xM\nF\n4 2πα\n2\nE\nThis general expression reduces to the Cahn-Gilman formula when the leading twist and\nisospin limits are applied to structure functions and when sea quark and CSV effects are\nγZ\nignored. The F1,2\nand F3γZ structure functions arise from the interference of the electromagnetic current with the vector and axial part of the weak neutral current respectively.\nThe asymmetry is often parameterized in terms of the ratio of the longitudinal to transverse\nvirtual neutral vector boson cross-sections\nγ(γZ)\n\nRγ(γZ) ≡\n\nσL\n\nγ(γZ)\n\nσT\n\nγ(γZ)\n\n= r2\n\nF2\n\nγ(γZ)\n\n2xF1\n\n− 1,\n\nr2 = 1 +\n\n4M 2 x2\n.\nQ2\n\n(14)\n\nIn terms of Rγ(γZ) the asymmetry in Eq. (13) takes the form given in Eq. (2), where the\nquantities Y1,3 are defined as\nh\ni\n!\n2\n2\n2\nγZ\n1 + RγZ 1 + (1 − y) − y 1 − r /(1 + R ) − 2xyM/E\nh\ni\nY1 =\n,\n1 + Rγ\n2\n2\n2\nγ\n1 + (1 − y) − y 1 − r /(1 + R ) − 2xyM/E\n!\nr2\n1 − (1 − y)2\nh\ni\nY3 =\n.\n1 + Rγ 1 + (1 − y)2 − y 2 1 − r2 /(1 + Rγ ) − 2xyM/E\n(15)\nIn this notation, the Y1 and Y3 terms arise from the interference of the electromagnetic\ncurrent with the vector and axial-vector weak neutal current respectively.\n\n\f7\nOne of the main results of this paper is that the relation\nRγ = RγZ = r2 − 1,\n\n(16)\n\nknown to hold at leading twist due to the Callan-Gross relations of the structure functions,\nalso holds even after the twist-four contributions to R1 (HT) are included at tree level.\nEquivalently, the relation\nY1 = 1,\n\n(17)\n\nis valid at twist-four up to perturbative corrections in αs (Q2 ). However, the the twist-four\ncontribution does affect the ratio F1γZ /F1γ in the Y1 -term of Eq. (2) as\n#\n\"\nh\ni\n6\nF1γZ\n=\n−\n(2C\n−\nC\n)\n1\n+\nR\n(HT\n)\n(18)\n1u\n1d\n1\nF1γ\n5\nCG + HT\nh\ni\n9\n20 2\n= (1 −\nsin θW ) 1 + R1 (HT) ,\n5\n9\nwhere the first term corresponds to the Cahn-Gilman limit and where, in the second line we\nhave omitted the electroweak radiative corrections for simplicity of presentation as we will\ndo throughout much of the remainder of the paper.\nIII.\n\nISOLATING THE TWIST-FOUR CONTRIBUTION\nA.\n\nStructure Functions\n\nIn this section we review the basic phenomenology and conventions for electron-deuteron\nPVDIS. The differential cross-section for electron-deuteron scattering takes the general form\nd2 σ\nα2 E 0 \u0010 γ\nGF Q2 γZ μν \u0011\nμν\n√\n=\nL\nW\n−\nLμν WγZ ,\n(19)\nμν\nγ\ndΩdE 0\nQ4 E\n4 2πα\nwhere E and E 0 denote the energies of the incoming and outgoing electron respectively in\nthe lab frame. The square of the momentum transfer via the exchanged photon or Z-boson\nis Q2 = −q 2 = −(` − `0 )2 where `μ and `0μ denote the four-momenta of the incoming and\noutgoing electron respectively. The leptonic tensors in Eq. (19) are given by\n0\n\nLγμν = 2(`μ `0ν + `0μ `ν − ` * `0 gμν − iλ\u000fμναβ `α ` β ),\n\ne\ne\nγ\nLγZ\nμν = (gV + λgA )Lμν ,\n\n(20)\n\nwhere λ denotes the sign of the initial electron helicity with λ = 1, −1 for positive and\nnegative helicity states respectively. The hadronic tensors in Eq. (19) take the form\n1 X\nγ(γZ)\n=\n(2π)3 δ (4) (pX − P − q)\nWμν\n2M X\nn\no\n× hX|Jμγ(Z) |D(P )i∗ hX|Jνγ |D(P )i + hX|Jμγ |D(P )i∗ hX|Jνγ(Z) |D(P )i , (21)\n\n\f8\nwhere Jμγ and JμZ denote the quark current coupling to the exchanged photon and Z-boson\nrespectively and M denotes the deuteron mass. The hadronic tensors are parameterized in\nγ\nγZ\nterms of the structure functions F1,2\nand F1,2,3\nas\nγ\nWμν\n\n=\n\n− gμν\n\nγZ\nWμν\n=\n\n− gμν\n\nqμ qν \u0001 F1γ\nP *q \u0001\nP * q \u0001 F2γ\n+ 2\n+ Pμ − 2 q μ Pν − 2 q ν\n,\nq\nM\nq\nq\nMP * q\nqμ qν \u0001 F1γZ\nP *q \u0001\ni\u000fμναβ P α q β γZ\nP * q \u0001 F2γZ\n+ 2\n+ Pμ − 2 q μ P ν − 2 q ν\n+\nF .\nq\nM\nq\nq\nMP * q\n2M P * q 3\n(22)\n\nThe structure functions depend on two variables conventionally taken to be Q2 and Bjorken\nγZ\nx = Q2 /(2P * q). The definitions of the F1,2,3\nstructure functions in terms of the vector and\naxial vector neutral weak current operators can be obtained by first breaking up the weak\nZ\nneutral current into its vector (JVZμ ) and axial-vector (JAμ\n) parts so that\nZ\nJμZ = JVZμ + JAμ\n,\n\n(23)\n\nγZ\nwhich allows a decomposition of the hadronic tensor Wαβ\nin Eq. (21) as\nγZ\nV ;γZ\nA;γZ\nWαβ\n= Wαβ\n+ Wαβ\n,\n\n(24)\n\nV (A);γZ\n\nwhere Wαβ\ncorrespond to the hadronic tensors arising from the interference of the\nelectromagnetic current with the vector and axial-vector weak neutral current respectively\nand are given by\n1 X\n(2π)3 δ (4) (pX − P − q)\n2M X\nn\no\n× hX|JVZ(A)μ |D(P )i∗ hX|Jνγ |D(P )i + hX|Jμγ |D(P )i∗ hX|JVZ(A)ν |D(P )i .\n\nV (A);γZ\nWμν\n=\n\n(25)\nγZ\nIn terms of the above hadronic tensors the F1,2,3\nstructure functions are given by\nV ;γZ\nWμν\nA;γZ\nWμν\n\nqμ qν \u0001 F1γZ\nP *q \u0001\nP * q \u0001 F2γZ\n= − gμν + 2\n+ Pμ − 2 q μ Pν − 2 q ν\n,\nq\nM\nq\nq\nMP * q\ni\u000fμναβ P α q β γZ\n=\nF .\n2M P * q 3\n\nB.\n\n(26)\n\nIsospin decomposition of structure functions\n\nWe now show in the limit of good isospin and negligible sea quark contributions, the\ntwist-four contributions to the Y1 term in Eq. (2) come purely from four-quark twist-four\noperators up to possible higher order perturbative mixing effects involving quark-gluon or\n\n\f9\npurely gluonic operators. This result was first pointed out in [17, 18]. Here we recast the\nargument in the more modern language, derive an explicit expression for the matrix element\nof the four-quark twist-four operator as a linear combination of the structure functions F1γ\nand F1γZ , and provide a corresponding formula for the shift in the asymmetry, R1 (HT).\nMoreover, the matrix elements of four-quark twist-four operators are known [24, 25] to\nsatisfy the Callan-Gross relation. We exploit this property to show that Y1 = 1 up to twistfour and that the twist-four contribution in the Y1 term lies entirely in the factor F1γZ /F1γ .\nThis result implies that the Y1 term in Eq. (2) is in principle a relatively clean probe of\ntwist-four quark-quark correlations.\nFollowing the notation of Ref. [18], we start with an isospin decomposition of the electromagnetic current and the vector part of the WNC as\n1\n1\nJγμ = vμ + sμ − λμ ,\n3\n3\n\u0003\n\u0002\n1 2\n2\nJZV μ = 2 (1 − 2 sin2 θW )vμ − sin2 θW sμ − ( − sin2 θW )λμ ,\n3\n2 3\nwhere the isovector, isoscalar, and strange quark currents are, respectively,\n1\n ̄ μ d),\nvμ = (ūγμ u − dγ\n2\n\n1\n ̄ μ d),\nsμ = (ūγμ u + dγ\n2\n\nλμ = s̄γμ s\n\n(27)\n\n(28)\n\nand where we have omitted heavy quark contributions or simplicity (including them is\nstraightforward). Using this isospin decomposition of the currents in the expressions for\nV ;γZ\nγ\ngiven in Eqs.(21) and (25) respectively, we arrive at the following isospin\nand Wμν\nWμν\ndecomposition for the hadronic tensors\n1 ss\nγ\nvv\nWμν\n= Wμν\n+ Wμν\n+ *** ,\n9\n4 2\nss\nsin θW Wμν\n+ *** ,\n(29)\n9\nwhere the dots indicate contributions from strange and heavier quarks and the hadronic\nvv,ss\ntensors Wμν\nare defined as\nV ;γZ\nvv\nWμν\n= 2(1 − 2 sin2 θW )Wμν\n−\n\n1 X\n(2π)3 δ (4) (pX − P − q)hX|vμ |D(P )i∗ hX|vν |D(P )i,\nM X\nZ\n1\n=\nd4 x eiq*x hD(P )|vμ (x)vν (0)|D(P )i,\n2πM\n1 X\n=\n(2π)3 δ (4) (pX − P − q)hX|sμ |D(P )i∗ hX|sν |D(P )i,\nM X\nZ\n1\n=\nd4 x eiq*x hD(P )|sμ (x)sν (0)|D(P )i.\n2πM\n\nvv\nWμν\n=\n\nss\nWμν\n\n(30)\nWe ignore subleading contributions arising from the strange and heavier quarks in this\nanalysis for simplicity. Contributions to the hadronic tensors involving a product of the\n\n\f10\nisovector vμ current with the isosinglet sν current vanish by isospin symmetry since the\ndeuteron is an isoscalar state.\ndu\nss\nvv\nhadronic tensors is given by Wμν\nand Wμν\nNext we note that the difference of the Wμν\ndu\nss\nvv\nWμν\n= Wμν\n− Wμν\n,\nZ\n1\n1  ̄\n=\nd4 x eiq*x hD(P )| {d(x)γ\nμ d(x) ū(0)γν u(0) + (u ↔ d)}|D(P )i.\n2πM\n2\n\n(31)\ndu\nAs seen above, the operator in Wμν\nis just Odu (x) of Eq.(3) which is manifestly a twist-four,\nfour-quark operator involving the different up and down flavors of quark bilinears. In the\ncontext of the light cone operator product expansion (OPE), it contains no local operators\ninvolving only two quark or two gluon fields as occur at twist-two since the fields located at\ndifferent positions along the light-cone have different flavor.\nss\nvv\ngiven in\nand Wμν\nThe relation in Eq. (31) can be understood from the definitions of Wμν\nEq. (30) and noting that\n\n1  ̄\nvμ (x)vν (0) − sμ (x)sν (0) = − {d(x)γ\nμ d(x) ū(0)γν u(0) + (u ↔ d)}.\n2\n\n(32)\n\nvv,ss,du\nWe now define flavor-dependent structure functions F1,2\ncorresponding to the hadronic\nvv,ss,du\nas\ntensors Wμν\n\nvv,ss,du\nWμν\n\n=\n\n− gμν\n\nqμ qν \u0001 F1vv,ss,du\nP *q \u0001\nP * q \u0001 F2vv,ss,du\n+ 2\n+ Pμ − 2 q μ P ν − 2 q ν\n,\nq\nM\nq\nq\nMP * q\n\n(33)\n\nso that from Eq. (31) we have the relation\nvv\nss\ndu\nF1,2\n= F1,2\n− F1,2\n,\n\n(34)\n\nvv\nss\ndu\nwhich allows us to eliminate the F1,2\nstructure functions in favor of F1,2\nand F1,2\n. The\nγ(γZ)\nvv,ss,du\nstructure functions F1,2\ncan be related to the F1,2\nstructure functions via Eqs. (29)\nand (33) as\n\n10 ss\n1 ss\nγ\nvv\ndu\nF1,2\n= F1,2\n+ F1,2\n= F1,2\n− F1,2\n,\n9\n9\n20 2\nγZ\nss\ndu\nF1,2\n= 2(1 −\nsin θW )F1,2\n− 2(1 − 2 sin2 θW )F1,2\n,\n9\nvv\nss\ndu\nwhere we have used Eq. (34) to eliminate F1,2\nin favor of F1,2\nand F1,2\n.\n\n(35)\n\n\f11\nC.\n\nIsolating twist-four contribution to the asymmetry\nγ(γZ)\n\nUsing Eq. (35) for the structure functions F1,2\nthat appear in Eq. (13), the electron\npolarization asymmetry can be brought into the form\n\u0010\n\u0010\n\u0011\n\u0011\n2\n2\nss\ne\n\u0010 G Q2 \u0011 2gAe 1 − 20\nsin θW F − 2gA 1 − 2 sin θW F du + gVe x(2 − y)F3γZ\n9\nF\n,\nARL = − √\n10 ss\nF − F du\n4 2πα\n9\n(36)\nwhere we have introduced the shorthand notation\nh\nxM i ss\nF ss ≡ 2xyF1ss − 2 1 − 1/y +\nF2 ,\nE\nh\nxM i du\nF du ≡ 2xyF1du − 2 1 − 1/y +\nF2 .\n(37)\nE\nNext we note that the leading twist contribution to F1ss and F2ss satisfies the Callan-Gross\nrelation so that\nss\nss\nF2;LT\n= 2xF1;LT\n,\n\n(38)\n\nwhere the subscript LT indicates that this relation generally holds only for the leading twist\ncontributions. It has also been shown [24–26] that the four-quark twist-four contribution to\nF1du and F2du satisfies the Callan-Gross relation so that\nF2du = 2xF1du .\n\n(39)\n\ndu\nWe outline an alternate derivation of this Callan-Gross relation for F1,2\nin Appendix A.\nEquations (38) and (39) allow us to write\nh\n2xM i\nss\nss\nFLT\n,\n= 2xF1;LT\ny − 2 + 2/y −\nE\nh\n2xM i\ndu\ndu\nF = 2xF1 y − 2 + 2/y −\n,\n(40)\nE\nThese relations allow us to write\nF du\nF1du\n=\n,\n(41)\nss\nss\nFLT\nF1;LT\n\nUsing Eqs.(37), (38), (39), and (41) the terms in Eq. (36) proportional to gAe can be brought\ninto the form\n\u0010\n\u0011\n\u0010\n\u0011 du\n2\n2\nF\ne\n\u0010 G Q2 \u0011 2gAe 1 − 20\nsin\nθ\n−\n2g\n1\n−\n2\nsin\nθ\nW\nW F ss\nA\n9\nF\nLT\nV\n,\nARL = − √\n10\n9 F du\n4 2πα\n(1 − 10 F ss )\n9\n\u0010\n\u0011\n\u0010 LT\n\u0011 du\n2\n20\ne\ne\n\u0010 G Q2 \u0011 gA 1 − 9 sin θW − gA 1 − 2 sin2 θW FFss1\nF\n1;LT\n= − √\n,\ndu\nF\n10\n9\n1\n2 2πα\n(1 −\n)\nss\n9\n\n10 F1;LT\n\no\n9 \u0010 GF Q2 \u0011 e n\u0010\n20 2 \u0011\n1 F1du\n√\n= −\ng\n1−\nsin θW −\n+ *** ,\nss\n10 2 2πα A\n9\n10 F1;LT\n(42)\n\n\f12\nwhere we have used the symbol AVRL to denote the part of the asymmetry ARL proportional\nto gAe that arises from an interference of the electromagnetic current with the vector weak\nneutral current. The first equality in Eq. (42) is obtained by dividing the numerator and\ndenominator of the terms proportional to gAe in Eq. (36) by F ss and using\nF du\nF du\n+ subleading terms,\n=\nss\nF ss\nFLT\ndu\n\n(43)\n\ndu\n\nto make the replacement FF ss → FFss . The subleading terms above denote contributions\nLT\narising from the twist-four matrix element F du multiplying subleading twist contributions\nto F ss . The second equality in Eq. (42) is obtained by using Eq. (41) and the last equality is\nss\nobtained by expanding to linear order in the quantity F1du /F1;LT\n. The expression for ARL\nV in\nEq. (42) is just the sum of the leading twist Cahn-Gilman term and a twist-four contribution\nfrom a single four-quark matrix element F1du . Comparing to Eqs. (11) and (12) we obtain\nthe main result of this paper:\nR1 (HT) = −\n\n1\nF1du\n9\nss\n10 (9 − 20 sin2 θW ) F1;LT\n\n.\n\n(44)\nγ(γZ)\n\nss\nstructure functions\nand F1du in terms of the F1,2\nWe now derive expressions for F1;LT\nwhich will be useful for phenomenological analyses. The leading twist structure function\nγ(γZ)\nss\ncan be related to the leading twist F1;LT structure functions as\nF1;LT\nss\nF1;LT\n=\n\n9 γ\n1\nF1;LT =\nF γZ ,\n20\n10\n2(1 − 9 sin2 θW ) 1;LT\n\n(45)\n\nγ\nwhich follows directly from Eq. (35). At leading twist the structure function F1;LT\ntakes the\nwell known form\n1X 2\nγ\nF1;LT\n(x) =\ne (qD (x) + q̄D (x)),\n(46)\n2 q q\n\nwhere qD (x) and q̄D (x) denote the quark and anti-quark deuteron PDFs respectively. Treating the deuteron as an isoscalar combination of the proton and neutron so that we have the\nrelation\n1\nqD (x) = (qp (x) + qn (x)),\n2\n\n(47)\n\nwhere qp,n (x) denote the proton and neutron PDFs respectively and ignoring sea-quark\ncontributions we get\n\u0003\n\u0002\n\u0003i\n1h 2\u0002\nγ\neu up (x) + un (x) + e2d dp (x) + dn (x)\nF1;LT\n(x) =\n4\n\u0003 10 ss\n5\u0002\n=\nup (x) + dp (x) = F1;LT\n,\n(48)\n36\n9\n\n\f13\nwhere we have used the isospin relations up,n (x) = dn,p (x) and where the last equality follows\nss\nfrom Eq. (45). Thus, the leading twist structure function F1;LT\ncan be simply expressed in\nterms of known proton PDFs. Substituting the resulting expression into Eq. (44) leads to\nthe result\n#\n\"\nF1du\n−4\n.\nR1 (HT) =\n5(1 − 20\nsin2 θW ) up (x) + dp (x)\n9\n(49)\n\nNext we turn to the four-quark twist-four contribution F1du . From Eq. (35), F1du is given\nin terms of the standard structure functions F1γ and F1γZ , which can be extracted from\nexperiment, as\nh\ni\n(50)\nF1du = (9 − 20 sin2 θW )F1γ − 5F1γZ .\nNote that the LHS of Eq. (50) is manifestly a four-quark twist-four matrix element while the\nRHS includes twist-2 contributions, two-quark twist-four contributions and four-quark twistfour contributions. This implies that the twist-2 and two-quark twist-four contributions on\nthe RHS cancel out. This allows us to write Eq. (50) as\ni\nh\nF1du = (9 − 20 sin2 θW )F1γ;4q − 5F1γZ;4q ,\n(51)\nwhere the superscript 4q indicates that only the four-quark twist-four operator contributions\nγ(γZ)\nto F1\nare kept. This makes the four-quark twist-four nature of the RHS in Eq. (50)\nmanifest.\nUsing Eqs.(48) and (51) in Eq. (44), the twist-four contribution R1 (HT ) to the asymmetry\nfrom the interference of the electromagnetic current and the vector weak neutral current is\ngiven by\nh\ni\nγ;4q\nγZ;4q\n2\n(9\n−\n20\nsin\nθ\n)F\n−\n5F\nW\n1\n1\n4\n\u0011h\ni.\nR1 (HT) = − \u0010\n(52)\n5 1 − 20 sin2 θ\nu (x) + d (x)\n9\n\nD.\n\nW\n\np\n\np\n\nEquality of Rγ and RγZ at twist-four\n\nWhile the results in Eqs. (44) and (49) embody the observation of Refs. [17, 18] in\nthe form of structure functions, the relationship to the parameterization of Eq. (2) for the\nasymmetry is not manifest. To make the implications for the latter apparent, we draw on\nthe analysis of the previous section to show that the relation\nRγ = RγZ\n\n(53)\n\n\f14\nis valid at twist-four, implying that Y1 = 1 up to perturbative corrections in αs (Q2 ). Using\nthe following decomposition of the structure functions\nγ(γZ)\n\nF1,2\n\nγ(γZ)\n\nγ(γZ)\n\n= F1,2;LT + δF1,2\n\nγ(γZ)\n\n,\n\nγ(γZ)\n\nwhere F1,2;LT denotes the leading twist contribution to F1,2\ntwist contributions, we can write\nγ(γZ)\n\nR\n\nγ(γZ)\n\n= r\n\n2\n\nγ(γZ)\n\nF2;LT + δF2\n\nγ(γZ)\n\n2xF1;LT\n\n(54)\nγ(γZ)\n\nand δF1,2\n\ndenotes the higher\n\nγ(γZ)\n\u0002\n\u0003\nδF1\n1 − γ(γZ)\n− 1 + *** ,\nF1;LT\n\nγ(γZ)\nγ(γZ)\n\u0002\n\u0003\nδF\n− 2xδF1\n= r2 1 + 2\n− 1 + *** ,\nγ(γZ)\n2xF1;LT\n\n(55)\n\nγ(γZ)\n\nwhere we have expanded F1,2\nand the dots denote terms suppressed by higher powers\nof Q2 . In what follows we only keep terms up to twist-four and suppress + * * * terms in\nEq.(55). From this relation it follows that\nδF2γZ − 2xδF1γZ\nδF2γ − 2xδF1γ\n1 + RγZ\n= 1+\n−\n.\nγ\nγZ\n1 + Rγ\n2xF1;LT\n2xF1;LT\n\n(56)\n\nUsing Eq. (35) we can write\n10 ss\n20 2\nγZ\nss\nF1,2;LT ,\nF1,2;LT\nsin θW )F1,2;LT\n,\n= 2(1 −\n9\n9\n10 ss\n20 2\nγ\nγZ\ndu\nss\ndu\nδF1,2\n=\nδF1,2 − F1,2\n,\nδF1,2\n= 2(1 −\nsin θW )δF1,2\n− 2(1 − 2 sin2 θW )F1,2\n,(57)\n9\n9\nss\nss\nfrom terms beyond twist-2. Using the expresdenotes the contribution to F1,2\nwhere δF1,2\nsions in Eq. (57) in Eq. (56) we arrive at\n1 + RγZ\n(F2du − 2xF1du ) h 9\n1 − 2 sin2 θW i\n=\n1\n+\n−\n.\n(58)\nss\n1 + Rγ\n2xF1;LT\n10 1 − 20\nsin2 θW\n9\nγ\nF1,2;LT\n=\n\nNow using Eq. (39) we arrive at the result\n1 + RγZ\n= 1,\n1 + Rγ\n\n(59)\n\nvalid up to twist-four, neglecting perturvative corrections in αs (Q2 ). This leads to the result\nY1 = 1,\n\n(60)\n\nup to corrections in αs (Q2 ) and power suppressed terms beyond twist-four. Finally, using\nEqs.(35) and (54), the ratio F1γZ /F1γ which appears in the Y1 term of Eq. (2) can be written\nas\nF1γZ\n9h\n20 2\n1 F1du i\n=\n(1\n−\nsin\nθ\n)\n−\n,\n(61)\nW\nss\nF1γ\n5\n9\n10 F1;LT\nleading immediately to Eq. (42).\n\n\f15\nIV.\n\nMODEL ESTIMATES OF HIGHER TWIST EFFECTS\n\nGiven the unique sensitivity of the Y1 term in the deuterium asymmetry to the fourμν\nquark HT operator Oud\n(x), it is useful to provide model estimates of its contribution as a\nbenchmark for the Jefferson Lab PVDIS program. To that end, we utilize the MIT Bag\nModel[23], following the analysis of Refs. [33, 34]. In principle, one may consider the use\nμν\n(x), such as QCD sum rules (see,\nof other models to estimate the matrix element of Oud\ne.g. Ref. [35] and references therein) or the instanton vacuum approximation[36] that have\nbeen applied more extensively to HT effects in polarized structure functions. In addition, a\nnonperturbative QCD computation would yield a result from first principles. To our knowledge, the particular nucleon matrix element of interest here has not been computed in any\nof these approaches, though some indications may be inferred from related calculations. For\nexample, the authors of Ref. [36] showed that in the instanton vacuum approximation, four\nquark matrix elements are suppressed relative to those of two-quark/gluon HT operators.\nThe authors of Ref. [37] have carried out a quenched lattice computation of the contribution\nof the isospin two, four quark operator to the pion structure function using Wilson fermions,\nand find that its scale is set by the square of the pion decay constant, Fπ2 . These authors\nsuggested that the scale of the corresponding nucleon matrix elements would be set by mN\nrather than Fπ , presumably leading to a larger value than in the constituent quark picture.\nIn both cases, only contributions to the leading moments were considered.\nIn what follows, we will use the MIT Bag Model to estimate not only the overall magnitude\nof the HT four quark contribution but also its dependence on xB . We note that the MIT\nBag Model was previously employed by the authors of Refs. [20, 38]. In applying their\ncomputation to the deuterium asymmetry, these authors assumed that the xB -dependence\nof the twist-two and twist-four contributions to the structure functions were similar and\nobtained the twist-four contributions by rescaling the twist-two contributions by the ratio\nof their leading moments. Under these approximations, they obtained\nR1 (HT) ≈ −\n\n5.7 × 10−3\nQ2 /(GeV)2\n\n.\n\n(62)\n\nIn what follows, we extend the analysis of Ref. [20] by allowing differences in the xB dependences of the twist-two and -four contributions to the structure functions. To this\nend, we compute a series of twist-four structure function moments, fit these moments to a\nparameterization in moment number N , and perform an inverse Mellin transform to obtain\nthe structure function. This procedure is subject to several uncertainties, including the\ntruncation of the tower of moments before carrying out the inverse Mellin transform and\nthe choice of parameterization to which they are fit. In addition, we have neglected the\nlogarithmic evolution of the moments from the hadronic scale to the Q2 of interest, as a\nfull computation of the anomalous dimension matrix – including the effects mixing between\nthe four-quark and twist-four quark-quark gluon and purely gluonic operators remains to be\n\n\f16\ncompleted. Nonetheless, we believe the computation described below provides a reasonable\nmodel estimate for the four-quark structure function relevant to R1 (HT). We find that the\nvalue of the structure function moments decreases rapidly with N , justifying the neglect\nof higher moments in the inversion, and that our results for the inverse Mellin transforms\ndo not vary appreciably as we change the parameterization used in fitting them. To the\nextent that the logarithmic Q2 evolution of the moments at these scales is gentle and that\nthe quark-quark correlations embodied in the MIT Bag Model capture the dominant twistfour physics, then the estimates described below and illustrated in Fig. 1 should provide a\nreasonable benchmark.\nγ(γZ)\nThe four-quark twist-four contributions to F1\nare given by[24, 25]\nZ\nh\nxB Λ 2 X\nγ;4q\n2\ndxdydz\neq eq0 U1 (x, y, z) ∆(x, y, z, xB ) + ∆(y − x, y, y − z, xB )\nF1 (xB , Q ) =\n2 Q2 q,q0\n\u0001\n− ∆(y − x, y, z, xB ) − ∆(x, y, y − z, xB )\n\n+ eq eq0 U2 (x, y, z) ∆(x, y, z, xB ) + ∆(y − x, y, y − z, xB )\n\u0001i\n+ ∆(y − x, y, z, xB ) + ∆(x, y, y − z, xB ) ,\nZ\nh\nxB Λ 2 X\nγZ;4q\n2\ndxdydz\neq gqV0 U1 (x, y, z) ∆(x, y, z, xB ) + ∆(y − x, y, y − z, xB )\nF1\n(xB , Q ) =\n2 Q2 q,q0\n\u0001\n− ∆(y − x, y, z, xB ) − ∆(x, y, y − z, xB )\n+ eq gqV0 U2 (x, y, z) ∆(x, y, z, xB ) + ∆(y − x, y, y − z, xB )\n\u0001i\n+ ∆(y − x, y, z, xB ) + ∆(x, y, y − z, xB ) ,\n\n(63)\nwhere eq and gqV are, respectively, the quark electric charge and vector coupling to the\nZ-boson with C1q = −gAe gqV /2 and\n∆(x, y, z, xB ) =\n\nδ(x − xB )\nδ(y − xB )\nδ(z − xB )\n+\n+\n(y − x)(z − x) (x − y)(z − y) (y − z)(x − z)\n\n,\n\n(64)\n\nand the deuteron four-quark operator matrix elements U1 and U2 are given by\nZ\ng2\ndλ dμ dν iλx iμ(y−x) iν(z−y)\n0\nU1 (x, y, z) =\ne e\ne\nhD|ψ̄ q (0)n/ta ψ q (νn)ψ̄(μn)n/ta ψ q (λn)|Di, (65)\n2\n4Λ\n2π 2π 2π\n2 Z\ng\ndλ dμ dν iλx iμ(y−x) iν(z−y)\n0\nU2 (x, y, z) =\ne e\ne\nhD|ψ̄ q (0)n/γ5 ta ψ q (νn)ψ̄(μn)n/γ5 ta ψ q (λn)|Di,\n2\n4Λ\n2π 2π 2π\n(66)\nwhere g is the SU (3)C color coupling constant and ta denote the generators of SU (3)C in\nthe fundamental representation. We have introduced the hadronic scale Λ in Eqs. (63,65)\nin order to express the structure functions in terms of dimensionless functions, though the\n\n\f17\nγ (γZ)\n\nF1\nare independent of this scale. The N-th moment of a structure function F (x) is\ndefined as\nZ 1\ndxxN −1 F (x),\n(67)\nM (N ) =\n0\n\nand the structure function can be obtained from its N-th moment via the inverse Mellin\ntransform\nZ c+i∞\n1\nF (x) =\ndN x−N M (N ).\n(68)\n2πi c−i∞\nγ(γZ);4q\n\nThe second, fourth, and sixth moments of the U1,2 contributions to F1\nhave been\ncomputed in the MIT Bag Model in [33, 34]. These results are given in Table. I and\nbelow we give a brief summary of the computation (for more of the moment calculation, see\nRefs. [33, 34]).\nThe N-th moment of the structure function is parameterized as\nj+2\nX\nai\nM (N ) =\n.\nNi\ni=j\n\n(69)\n\nAfter the inverse Mellin transform, the corresponding structure function takes the form\nF (x) =\n\n4\nX\ni=2\n\nai\n\n(− log x)i−1\n.\n(i − 1)!\n\n(70)\n\nγ(γZ);4q\n\nThe structure functions F1\nreceive contributions from two terms corresponding to the\nU1 and U2 contributions in Eq.(63)\nF1γ;4q = F1γ;4q;U1 + F1γ;4q;U2 ,\nF1γZ;4q = F1γZ;4q;U1 + F1γZ;4q;U2 .\n(71)\nFor the numerical estimates we use the results of the fit for the U1 and U2 contributions at\nQ2 = 1 GeV2 which are given by\nF1γ;4q;U 1 ' F1γZ;4q;U 1 : a2 = 9.45 × 10−4 , a3 = −277 × 10−4 , a4 = 516.7 × 10−4 ,\n\nF1γ;4q;U 2 ' F1γZ;4q;U 2 : a2 = 164.5 × 10−4 , a3 = −1197.0 × 10−4 , a4 = 1191.4 × 10−4 ,\n(72)\n\nIn order to determine the correction R1 (HT), we substitute these results into the numerator of Eq. (52). For the denominator we use the CTEQ5 pdfs [39]. The resulting shift\nin the asymmetry, for different representative values of Q2 , is plotted in Fig.(1). For the\nrange of xB shown, the correction is largest in the valence region, reaching a magnitude\n\n\f18\n\nM (N ) of F1γZ;4q;U 1 (xB )\nM (2)\n0\nM (4) −1.72 × 10−4\nM (6) −0.62 × 10−4\n\nM (N ) of F1γZ;4q;U 2 (x)\nM (2) −34.00 × 10−4\nM (4) −3.77 × 10−4\nM (6) −0.05 × 10−4\n\nM (N ) of F1γ;4q;U 1 (xB )\nM (2)\n0\nM (4) −1.71 × 10−4\nM (6) −0.61 × 10−4\n\nM (N ) of F1γ;4q;U 2 (x)\nM (2) −33.72 × 10−4\nM (4) −3.74 × 10−4\nM (6) −0.05 × 10−4\n\nTABLE I: The first few moments for the structure functions F1γZ;4q;U 1 (x), F1γZ;4q;U 2 (x), F1γ;4q;U 1 (x),\nand F1γ;4q;U 2 (x) in the MIT Bag model at Q2 = 1 GeV2 . These are updated numbers after correcting\nsome numerical errors discovered in [33, 34].\n\ncommensurate with that obtained by the authors of Ref. [20]. The growth for xB near one\nis a result of the relatively quicker fall off with xB of the pdfs; the twist four contribution in\nthe numerator is falling less quickly in this region2 . One can also perform this analysis with\nalternative parameterizations of the structure function moments. This was done in Ref. [33]\nwith similar results and we refer the reader to it for more details.\nFor the kinematic range that will be accessible in the planned JLab experiments, the Bag\nModel estimate for the magnitude of the correction R1 (HT) lies below the expected experimental sensitivity. To the extent that the Y1 term can be separated experimentally from\nthe remaining contributions to the asymmetry, one could test this Bag Model expectation\nby looking for an appreciable Q2 dependence in the data. The presence of such a dependence would point to stronger correlations between quarks of different flavors than implied\nby the Bag Model picture, which correlates the up- and down-quarks largely through the\nconfinement radius and the Pauli exclusion principle. On the other hand, the absence of\nlarge power corrections would imply that the Y1 term can be interpreted primarily in terms\nof the underlying electroweak interactions and/or possible CSV in the parton distributions.\nWe comment on the implications for probes of CSV and new physics in the following section.\nV.\n\nCHARGE SYMMETRY VIOLATION AND NEW PHYSICS\n\nTo the extent that R1 (HT) is either tiny as suggested by the MIT Bag Model estimates\nor large enough to be extracted utilizing the 1/Q2 -dependence, one may hope to use the\n2\n\nIn general, the implementation of the parton model in the threshold region xB → 1 introduces theoretical ambiguities, so we avoid this kinematic regime in computing the relative correction. For a general\ndiscussion and references, see, e.g., Ref. [40].\n\n\f19\n\n0.003\n\nTwist-Four Contribution to the Asymmetry\n(MIT Bag Model Estimate)\n\n0.002\n0.001\nR1 (HT )\n\n0.000\n!0.001\n!0.002\n!0.003\n0.2\n\n0.3\n\n0.4\n\n0.5\n\n0.6\n\nx\n\n0.7\n\n0.8\n\nFIG. 1: The estimate of R1 (HT ) as a function of the Bjorken variable x for different values of Q2 in\nthe MIT Bag Model. The curves from the bottom to top correspond to the values Q2 = 4, 6, 8, 10, 12\nGeV2 respectively.\n\ndeuterium asymmetry as a probe of CSV and/or new physics. In terms of the former, it has\nrecently been suggested that HT contributions to the Y1 term in the deuterium asymmetry\nmay be too large and too theoretically uncertain to utilize this term as a probe of CSV [21].\nThese suggestions were based on the possibility that Rγ and RγZ could differ substantially.\nWe have shown that at finite Q2 where a twist expansion is still valid, such a possibility\ncannot apply at twist four since Rγ = RγZ at this order in the twist expansion, up to\nperturbative corrections. We now compare the MIT Bag Model estimate of R1 (HT) to\nthe CSV correction, R1 (CSV). To that end, we follow the parameterization of CSV effects\nutilized in Ref. [21]:\nδu\n2\nδd\ndp = d +\n2\nδd\nun = d −\n2\nδu\ndn = u −\n2\nup = u +\n\n(73)\n\n.\n(74)\n\n\f20\nIn terms of the δu and δd one has\n\u0014 \u0012\n\u0013\n\u0015\u0012\n\u0013\n1 2C1u + C1d\n3\nδu − δd\nR1 (CSV) =\n−\n2 2C1u − C1d\n10\nu+d\n\n.\n\n(75)\n\nThe δu and δd have been constrained by structure function data utilizing the ansatz\nδu − δd = 2κf (x)\n\nf (x) = x−1/2 (1 − x)4 (x − 0.0909) ,\n\n(76)\n\nwith κ lying in the range −0.8 ≤ κ ≤ +0.65. Detailed phenomenological and theoretical\nanalyses of CSV effects can be found in Refs.[21, 41, 42]. In Fig. 2, we show the relative\nmagnitudes of R1 (HT) and R1 (CSV) for a representative value of Q2 = 6 GeV2 and κ\ngiven by the extremes of the allowed range. We observe that the Bag Model higher twist\ncorrection is considerably smaller than the possible range for CSV effects. To the extent that\nthe Bag Model provides a realistic guide for the magnitude of R1 (HT), a series of precise\nmeasurements of the leading term in the asymmetry could provide a powerful probe of CSV\neffects.\nThe implications for probing new physics via R1 (new) are less clear. To be concrete, we\nfollow Ref. [43] and consider new parity-violating contact interactions\nLnew =\n\nX f\n4πκ2 μ\nhV f ̄γ μ f\nēγ\nγ\ne\n5\n2\nΛ\nf\n\n,\n\n(77)\n\nwhere Λ is the mass scale associated with the new physics, κ2 gives the overall coupling\nstrength, and the hfV are the specific vector current couplings to each fermion f . Retaining\nonly contributions from up- and down-quarks, we obtain the corresponding contribution to\nthe correction R1 (new):\n\u0012\n\u0013\n\u0012\n\u0013\n−16πκ2 \u0010 v \u00112\n2huV − hdV\nR1 (new) =\n,\n(78)\n3\nΛ\n1 − 20 sin2 θW /9\nwhere we have expressed the Fermi constant in terms of the Higgs vaccum expectation value\nv = 246 GeV.\nA given scenario for new physics will determine the specific values of κ, Λ, and the hfV .\nFor example, E6 grand unified models contain additional U(1) gauge groups that may lead\nto the existence of a TeV-scale Z 0 boson. To illustrate the sensitivity of the Y1 -term to\nthis scenario, we consider a particular pattern of symmetry-breaking that gives rise to a\nlow-mass Zχ boson. In this case, the correction R1 (new) arises from tree-level exchange of\nthe Zχ . In terms of the parameters appearing in Eqs. (77,78) one has κ2 = 2.2α, Λ = Mχ ,\nhuV = 0, and hdV = −1/20. For Mχ = 1 TeV, we obtain R1 (new) = 1.85 × 10−3 independent\nof Q2 . Comparing with Figures 1 and 2, we observe that the scale of this correction is\ncommensurate with that of R1 (HT) in the MIT Bag Model and well below the allowed\n\n\f21\n\n0.03\n\nR1 (CSV )\n\n0.02\n0.01\n\nκ = −0.8\n\n0.00\n\nR1 (HT )\n\n!0.01\n!0.02\n\nκ = 0.65\nR1 (CSV )\n\n!0.03\n0.3\n\n0.4\n\n0.5\n\nx\n\n0.6\n\n0.7\n\n0.8\n\nFIG. 2: The relative magnitudes of R1 (HT ) and R1 (CSV ) as a function of the Bjorken-x variable\nfor a representative value of Q2 = 6 GeV2 . using δu − δd = 2κf (x) where f (x) = x−1/2 (1 − x)4 (x −\n0.0909) for κ = −0.8. The top curve and bottom curves give R1 (CSV ) for the choices κ = −0.8\nand κ = 0.65 respectively in Eqs.(75) and (76). The middle curve is the MIT Bag Model estimate\nfor R1 (HT ).\n\nbands for the possible CSV correction. In order for a measurement of the Y1 -term to probe\nthis scenario, one would need an experimental sensitivity of ∼ 0.2% with knowledge of the\nCSV and HT corrections at a similar or better level theoretical precision. On the other\nhand, the planned 4% measurement of the proton's weak charge by the Q-Weak experiment\nat Jefferson Lab will probe the same scenario for a one TeV Zχ . A similar comparison with\nother scenarios suggests that for a determination of R1 (new) to be competitive with the\nQ-Weak experiment as a probe of new physics3 , one would need a combined experimental\nand theoretical uncertainty of better than ∼ 0.5%. At present, then, it appears that a study\n3\n\nWe note that the RHS of Eq. (45) of Ref. [43] contains an error and should be multiplied by a factor of\n√\neight. As a result, the mass bound scale factor for δ̃1 in Table I should be multiplied by 2 2. The same\nfactor should be applied to the last entries in Tables II-IV.\n\n\f22\nof the Y1 term in the deuterium asymmetry is better suited as a probe of hadron structure\nthan of new physics4 .\nVI.\n\nCONCLUSIONS\n\nParity-violating electron scattering has become a powerful tool for probing both novel\naspects of hadronic and nuclear structure as well as possible indirect signatures of physics\nbeyond the Standard Model. Its efficacy depends on both significant experimental advances\nin controlling systematic uncertainties and attaining high statistics as well as on substantial\ndevelopments in the theoretical interpretation of the parity-violating asymmetries. PVDIS\nrepresents a prime example of this synergy between experiment and theory. The first measurements of the deep inelastic asymmetry for a deuterium target relied on the simplest\nparton-level description of hadrons, yet the result with a 17% experimental uncertainty (for\nthe two highest energy points) was sufficient to single out the Standard Model description of the weak neutral current interaction from other alternatives. Today, one anticipates\nlower-energy measurements at Jefferson Lab with experimental errors below one percent for\nindividual kinematic points, making for O(0.5%) combined uncertainties on quantities of\ninterest. The challenge for theory is to provide a framework for interpreting such precise\nresults.\nIn this study, we have attempted to do so for the leading term in the deuterium asymmetry. In principle, it can be kinematically separated from the subleading term (suppressed by\n1 − 4 sin2 θW ), making it an object of interest in its own right. In going beyond the simplest\nparton model description of the deuteron structure and the Standard Model description of\nthe weak neutral current interaction, one may expect contributions to this term arising from\nhigher twist operators, the violation of charge symmetry in the leading twist (parton model)\nterms, and new physics. Drawing on early work by Bjorken and Wolfenstein, who showed\nthat this term depends on the matrix element of a single, non-local twist four operator, we\nhave delineated the twist four contribution from those that may arise from CSV and new\nphysics. In doing so, we have shown that that to this order in the twist expansion, one has\nRγ = RγZ up to perturbative corrections, making for a theoretically cleaner interpretation\nof the asymmetry than recently suggested in the literature. We have also utilized the MIT\nBag Model to estimate the xB -dependent twist-four correction and find that it is small compared to the range of possible CSV effects as implied by global fits to structure function\ndata. Typical contributions from new physics are also smaller than the allowed CSV range.\n4\n\nWe note that the possible contributions from supersymmeric extensions of the SM have been analyzed\nrecently in Ref. [44], though the analysis applied to the asymmetry as a whole and not the Y1 term alone.\nAfter taking into considerations constraints from other electroweak precision observables and direct search\nlimits, corrections of up to 1.5% on the asymmetry are currently allowed in supersymmetric models.\n\n\f23\nTo the extent that the Bag Model provides a reasonable guide to higher twist quark-quark\ncorrelations, one would not expect to observe appreciable sub-leading power dependence on\nQ2 in the leading term but would, on the other hand, be able to make a clean interpretation\nof this term in terms of CSV. On the other hand, experimental evidence for a substantial\nQ2 power dependence would point to interesting non-perturbative dynamics underlying the\nhigher-twist matrix elements. Either way, a determination of this leading term at the level\nof precision expected for the Jefferson Lab experiments would provide new insights into the\nbehavior of non-perturbative QCD.\nAcknowledgments\n\nWe thank A. Belitsky, C. Keppel, K. Kumar, T. Hobbs, T. Longergan, W. Melnitchouk,\nP. Mulders, P. Reimer, P. Souder, and C. Weiss for helpful exchanges and references to the\nliterature. This work was supported in part under U.S. Department of Energy contract\nDE-FG02-08ER4153, the Wisconsin Alumni Research Foundation, and the Alfred P. Sloan\nfoundation.\nAppendix A: Callan-Gross relation: F2du = 2xF1du\n\nIt has been shown [24–26] that the contribution from the four-quark twist-four operator\nγ(γZ)\nin Eq. (31) to the structure functions F1,2\nsatisfies the Callan-Gross relation. Here we\nrecast this argument using the language of the Soft-Collinear Effective Theory(SCET) [27–\n29], which is an effective field theory for describing the interactions of collinear and soft\ndegrees of freedom and can be applied to electron-deuteron scattering in the Breit frame. In\nthe language of SCET, the argument for the Callan-Gross relation becomes manifest via the\nstructure of the leading order SCET operator that appears at twist-four from a tree-level\nmatching.\nRecall that the contribution of the twist-four four-quark operator to the hadronic tensor\nZ\n1  ̄\n1\ndu\nd4 x eiq*x hD(P )| {dγ\nWμν =\nμ d(x) ūγν u(0) + (u ↔ d)}|D(P )i,\n2πM\n2\n(A1)\ndu\nis parameterized in terms of the structure functions F1,2\nas\n\ndu\nWμν\n=\n\n− gμν +\n\nqμ qν \u0001 F1du\nP *q \u0001\nP * q \u0001 F2du\n+\nP\n−\nq\nP\n−\nqν\n,\nμ\nμ\nν\nq2 M\nq2\nq2\nMP * q\n\n(A2)\n\nas first written in Eq. (33). From this parameterization we note that the Lorentz invariant\n\n\f24\n\ndu onto the SCET operator in the Breit frame. The\nFIG. 3: Tree level matching of the operator Oμν\ndashed fermion lines indicate collinear fields in the standard notation of SCET.\ndu\nis given by\nquantity P μ P ν Wμν\ndu\nP μ P ν Wμν\n=\n\n(P * q)2 h du F2du i\nF1 −\n.\nq2M\n2x\n(A3)\n\nIf it can be shown that this quantity vanishes, it implies the Callan-Gross relation\nF2du = 2xF1du .\n\n(A4)\n\nWe formulate the argument in the Breit frame where the momentum of the virtual photon\nor Z-boson is\nn̄μ − nμ\n,\n(A5)\nqμ = Q\n2\nand the momentum of the deuteron is\nnμ\nM 2 n̄μ\n+\n,\n2\nn̄ * P 2\nwhere we have introduced the light-cone vectors\nP μ = n̄ * P\n\nnμ = (1, 0, 0, 1),\n\nn̄μ = (1, 0, 0, −1),\n\nn2 = n̄2 = 0,\n\n(A6)\n\nn̄ * n = 2.\n\n(A7)\n\nFrom these relations and using momentum conservation in the Breit frame we have\nM2\nn*P\n' 2 \u001c 1,\nn̄ * P\nQ\n\n(A8)\n\nso that the deuteron momentum is entirely along the light-cone nμ up to power corrections\nin M 2 /Q2 .\nIn SCET in the Breit frame, at leading order in the power counting in Λ2QCD /Q2 and at\ndu\ntree level, the four-quark operator in Wμν\nwill be matched onto an SCET operator [45]\nZ\n ̄ μ d(x) ūγ ν u(0) = nμ nν dω1 dω2 dω3 dω4 C(ω1 , ω2 , ω3 , ω4 )\ndγ\n×\n\n1  ̄d\nn̄/\nn̄/\n{(ξn W )ω1 (W † ξnd )ω2 (ξ ̄nu W )ω3 (W † ξnu )ω4 + (u ↔ d)},\n2\n2\n2\n(A9)\n\n\f25\nwhere we have used standard SCET notation, a detailed explanation of which, can be\nfound in [27–29]. This is schematically shown in Fig. 3. Here C(ω1 , ω2 , ω3 , ω4 ) denotes the\nmatching Wilson coefficient. W denotes the momentum space Wilson lines\nhX\n\u0010 −g\n\u0011i\nW =\nexp\nn̄ * An,p (x) ,\n(A10)\nP̄\nperms\nand the fields An,p , ξn,p denote collinear gluon and quark fields which are fourier transformed\nto momentum space with respect to large light cone momentum component in the nμ direction. The Wilson lines W , determined by collinear gauge invariance in SCET, generate\nall the spin terms at twist-four. The labels p, ωi on the SCET fields denote the large part\nof the light cone momentum and the x dependence of the collinear gluon and quark fields\ncorresponds to residual momentum fluctuations. For more details of the matching and the\nSCET notation used here see [45]. What is relevant to our discussion is that the collinear\nquark fields ξn that appear in the SCET operator satisfy the equation of motion\nn/ξn = 0,\n\n(A11)\n\nwhich is the reason that there are no terms proportional to n̄μ n̄ν in the tree level matching\nin Eq. (A9). Thus, contracting Eq. (A9) with nμ nν gives zero using the property n2 = 0.\nApplying these considerations to Eq. (A1) we get the relation\ndu\ndu\nP μ P ν Wμν\n' Q2 nμ nν Wμν\n,\n\n= 0,\n\n(A12)\n\nwhich from Eq. (A3) implies the tree level Callan-Gross relation of Eq. (A4) up to power\ncorrections in Λ2QCD /Q2 .\n\n[1]\n[2]\n[3]\n[4]\n[5]\n[6]\n[7]\n[8]\n[9]\n[10]\n[11]\n[12]\n[13]\n[14]\n\nC. Y. Prescott et al., Phys. Lett. B77, 347 (1978).\nC. Y. Prescott et al., Phys. Lett. B84, 524 (1979).\nR. N. Cahn and F. J. Gilman, Phys. Rev. D17, 1313 (1978).\nG0, D. S. Armstrong et al., Phys. Rev. Lett. 95, 092001 (2005).\nHAPPEX, A. Acha et al., Phys. Rev. Lett. 98, 032301 (2007).\nHAPPEX, K. Aniol, Eur. Phys. J. A31, 597 (2007).\nG0, D. Androic et al., Phys. Rev. Lett. 104, 012001 (2010).\nSAMPLE, T. M. Ito et al., Phys. Rev. Lett. 92, 102003 (2004).\nSAMPLE, D. T. Spayde et al., Phys. Lett. B583, 79 (2004).\nW. Heil et al., Nucl. Phys. B327, 1 (1989).\nS. Baunack et al., Phys. Rev. Lett. 102, 151803 (2009).\nSLAC E158, P. L. Anthony et al., Phys. Rev. Lett. 95, 081601 (2005).\nQweak, W. T. H. Van Oers, Nucl. Phys. A790, 81 (2007).\nP. Souder, Prepared for 16th International Workshop on Deep Inelastic Scattering and Related\nSubjects (DIS 2008), London, England, 7-11 Apr 2008.\n\n\f26\n[15] X. Zheng, P. Reimer, and e. a. R. Michaels, http://www.jlab.org/exp prog/proposals/08/PR08-011.pdf.\n[16] P. Reimer, X. Zheng, and e. a. K. Paschke, http://www.jlab.org/exp prog/proposals/07/PR1207-102.pdf.\n[17] J. D. Bjorken, Phys. Rev. D18, 3239 (1978).\n[18] L. Wolfenstein, Nucl. Phys. B146, 477 (1978).\n[19] S. Fajfer and R. J. Oakes, Phys. Rev. D30, 1585 (1984).\n[20] P. Castorina and P. J. Mulders, Phys. Rev. D31, 2760 (1985).\n[21] T. Hobbs and W. Melnitchouk, Phys. Rev. D77, 114023 (2008).\n[22] K. Kumar, private communication .\n[23] A. Chodos, R. L. Jaffe, K. Johnson, C. B. Thorn, and V. F. Weisskopf, Phys. Rev. D9, 3471\n(1974).\n[24] R. K. Ellis, W. Furmanski, and R. Petronzio, Nucl. Phys. B212, 29 (1983).\n[25] X.-D. Ji, Nucl. Phys. B402, 217 (1993).\n[26] J.-W. Qiu, Phys. Rev. D42, 30 (1990).\n[27] C. W. Bauer, S. Fleming, D. Pirjol, and I. W. Stewart, Phys. Rev. D63, 114020 (2001).\n[28] C. W. Bauer, D. Pirjol, and I. W. Stewart, Phys. Rev. D65, 054022 (2002).\n[29] C. W. Bauer, S. Fleming, D. Pirjol, I. Z. Rothstein, and I. W. Stewart, Phys. Rev. D66,\n014017 (2002).\n[30] M. J. Musolf et al., Phys. Rept. 239, 1 (1994).\n[31] I. Schienbein et al., J. Phys. G35, 053101 (2008).\n[32] A. Accardi and J.-W. Qiu, JHEP 07, 090 (2008).\n[33] G. F. Sacco, UMI-31-66015.\n[34] G. F. Sacco, (2009).\n[35] E. Stein, P. Gornicki, L. Mankiewicz, and A. Schafer, Phys. Lett. B353, 107 (1995).\n[36] B. Dressler, M. Maul, and C. Weiss, Nucl. Phys. B578, 293 (2000).\n[37] S. Capitani et al., Nucl. Phys. B570, 393 (2000).\n[38] P. Castorina and P. J. Mulders, Phys. Rev. D31, 2753 (1985).\n[39] CTEQ, H. L. Lai et al., Eur. Phys. J. C12, 375 (2000).\n[40] F. M. Steffens and W. Melnitchouk, Phys. Rev. C73, 055202 (2006).\n[41] A. D. Martin, R. G. Roberts, W. J. Stirling, and R. S. Thorne, Eur. Phys. J. C35, 325 (2004).\n[42] J. Londergan, J. Peng, and A. Thomas, Rev.Mod.Phys. 82, 2009 (2010).\n[43] M. J. Ramsey-Musolf, Phys. Rev. C60, 015501 (1999).\n[44] A. Kurylov, M. J. Ramsey-Musolf, and S. Su, Phys. Lett. B582, 222 (2004).\n[45] C. Marcantonini and I. W. Stewart, Phys. Rev. D79, 065028 (2009).\n\n\f"}