{"id": "http://arxiv.org/abs/1001.1351v1", "guidislink": true, "updated": "2010-01-08T22:07:20Z", "updated_parsed": [2010, 1, 8, 22, 7, 20, 4, 8, 0], "published": "2010-01-08T22:07:20Z", "published_parsed": [2010, 1, 8, 22, 7, 20, 4, 8, 0], "title": "The extreme luminosity states of Sagittarius A*", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1001.2897%2C1001.3282%2C1001.5361%2C1001.1873%2C1001.0666%2C1001.0537%2C1001.3697%2C1001.1950%2C1001.2869%2C1001.3016%2C1001.2760%2C1001.4310%2C1001.2552%2C1001.3302%2C1001.4511%2C1001.1513%2C1001.4981%2C1001.0927%2C1001.4468%2C1001.0071%2C1001.4699%2C1001.2285%2C1001.5268%2C1001.4218%2C1001.1382%2C1001.0043%2C1001.0365%2C1001.4106%2C1001.4876%2C1001.1067%2C1001.1207%2C1001.0143%2C1001.1038%2C1001.5359%2C1001.1461%2C1001.3138%2C1001.2812%2C1001.4196%2C1001.3936%2C1001.1147%2C1001.5156%2C1001.4103%2C1001.3737%2C1001.1371%2C1001.4851%2C1001.2698%2C1001.5341%2C1001.2452%2C1001.4967%2C1001.5388%2C1001.3588%2C1001.4585%2C1001.3233%2C1001.0596%2C1001.3423%2C1001.0050%2C1001.1361%2C1001.1464%2C1001.5118%2C1001.1817%2C1001.3568%2C1001.3552%2C1001.3682%2C1001.2800%2C1001.1585%2C1001.1777%2C1001.3366%2C1001.1713%2C1001.1940%2C1001.3017%2C1001.4358%2C1001.0849%2C1001.0971%2C1001.4122%2C1001.0547%2C1001.1824%2C1001.1758%2C1001.1757%2C1001.4543%2C1001.4153%2C1001.4473%2C1001.0726%2C1001.3950%2C1001.2540%2C1001.0734%2C1001.0244%2C1001.2402%2C1001.5309%2C1001.1566%2C1001.2655%2C1001.1310%2C1001.3421%2C1001.3757%2C1001.1351%2C1001.4280%2C1001.1549%2C1001.3208%2C1001.4059%2C1001.4680%2C1001.0123%2C1001.1822&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "The extreme luminosity states of Sagittarius A*"}, "summary": "We discuss mm-wavelength radio, 2.2-11.8um NIR and 2-10 keV X-ray light\ncurves of the super massive black hole (SMBH) counterpart of Sagittarius A*\n(SgrA*) near its lowest and highest observed luminosity states. The luminosity\nduring the low state can be interpreted as synchrotron emission from a\ncontinuous or even spotted accretion disk. For the high luminosity state SSC\nemission from THz peaked source components can fully account for the flux\ndensity variations observed in the NIR and X-ray domain. We conclude that at\nnear-infrared wavelengths the SSC mechanism is responsible for all emission\nfrom the lowest to the brightest flare from SgrA*. For the bright flare event\nof 4 April 2007 that was covered from the radio to the X-ray domain, the SSC\nmodel combined with adiabatic expansion can explain the related peak\nluminosities and different widths of the flare profiles obtained in the NIR and\nX-ray regime as well as the non detection in the radio domain.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1001.2897%2C1001.3282%2C1001.5361%2C1001.1873%2C1001.0666%2C1001.0537%2C1001.3697%2C1001.1950%2C1001.2869%2C1001.3016%2C1001.2760%2C1001.4310%2C1001.2552%2C1001.3302%2C1001.4511%2C1001.1513%2C1001.4981%2C1001.0927%2C1001.4468%2C1001.0071%2C1001.4699%2C1001.2285%2C1001.5268%2C1001.4218%2C1001.1382%2C1001.0043%2C1001.0365%2C1001.4106%2C1001.4876%2C1001.1067%2C1001.1207%2C1001.0143%2C1001.1038%2C1001.5359%2C1001.1461%2C1001.3138%2C1001.2812%2C1001.4196%2C1001.3936%2C1001.1147%2C1001.5156%2C1001.4103%2C1001.3737%2C1001.1371%2C1001.4851%2C1001.2698%2C1001.5341%2C1001.2452%2C1001.4967%2C1001.5388%2C1001.3588%2C1001.4585%2C1001.3233%2C1001.0596%2C1001.3423%2C1001.0050%2C1001.1361%2C1001.1464%2C1001.5118%2C1001.1817%2C1001.3568%2C1001.3552%2C1001.3682%2C1001.2800%2C1001.1585%2C1001.1777%2C1001.3366%2C1001.1713%2C1001.1940%2C1001.3017%2C1001.4358%2C1001.0849%2C1001.0971%2C1001.4122%2C1001.0547%2C1001.1824%2C1001.1758%2C1001.1757%2C1001.4543%2C1001.4153%2C1001.4473%2C1001.0726%2C1001.3950%2C1001.2540%2C1001.0734%2C1001.0244%2C1001.2402%2C1001.5309%2C1001.1566%2C1001.2655%2C1001.1310%2C1001.3421%2C1001.3757%2C1001.1351%2C1001.4280%2C1001.1549%2C1001.3208%2C1001.4059%2C1001.4680%2C1001.0123%2C1001.1822&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We discuss mm-wavelength radio, 2.2-11.8um NIR and 2-10 keV X-ray light\ncurves of the super massive black hole (SMBH) counterpart of Sagittarius A*\n(SgrA*) near its lowest and highest observed luminosity states. The luminosity\nduring the low state can be interpreted as synchrotron emission from a\ncontinuous or even spotted accretion disk. For the high luminosity state SSC\nemission from THz peaked source components can fully account for the flux\ndensity variations observed in the NIR and X-ray domain. We conclude that at\nnear-infrared wavelengths the SSC mechanism is responsible for all emission\nfrom the lowest to the brightest flare from SgrA*. For the bright flare event\nof 4 April 2007 that was covered from the radio to the X-ray domain, the SSC\nmodel combined with adiabatic expansion can explain the related peak\nluminosities and different widths of the flare profiles obtained in the NIR and\nX-ray regime as well as the non detection in the radio domain."}, "authors": ["N. Sabha", "G. Witzel", "A. Eckart", "R. M. Buchholz", "M. Bremer", "R. Giessuebel", "M. Garcia-Marin", "D. Kunneriath", "K. Muzic", "R. Schoedel", "C. Straubmeier", "M. Zamaninasab", "A. Zernickel"], "author_detail": {"name": "A. Zernickel"}, "author": "A. Zernickel", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1051/0004-6361/200913186", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1001.1351v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1001.1351v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "18 pages, 13 figures, accepted by A&A", "arxiv_primary_category": {"term": "astro-ph.GA", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "astro-ph.GA", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1001.1351v1", "affiliation": "I.Physikalisches Institut, University of Cologne, Germany", "arxiv_url": "http://arxiv.org/abs/1001.1351v1", "journal_reference": null, "doi": "10.1051/0004-6361/200913186", "fulltext": "c ESO 2018\n\nAstronomy & Astrophysics manuscript no. ms-sabha-new\nOctober 11, 2018\n\nThe extreme luminosity states of Sagittarius A*\nN. Sabha1 , G. Witzel1 , A. Eckart1,2 , R.M. Buchholz1 , M. Bremer1 , R. Giessübel2,1 , M. Garcı́a-Marı́n1 , D. Kunneriath1,2 ,\nK. Muzic1 , R. Schödel3 , C. Straubmeier1 , M. Zamaninasab2,1 , and A. Zernickel1\n1\n2\n\narXiv:1001.1351v1 [astro-ph.GA] 8 Jan 2010\n\n3\n\nI.Physikalisches Institut, Universität zu Köln, Zülpicher Str.77, 50937 Köln, Germany\ne-mail: sabha, witzel, eckart@ph1.uni-koeln.de\nMax-Planck-Institut für Radioastronomie, Auf dem Hügel 69, 53121 Bonn, Germany\nInstituto de Astrofı́sica de Andalucı́a (CSIC), Camino Bajo de Huétor 50, 18008 Granada, Spain\ne-mail: rainer@iaa.es\n\nReceived / Accepted\nABSTRACT\n\nWe discuss mm-wavelength radio, 2.2-11.8μm NIR and 2-10 keV X-ray light curves of the super massive black hole (SMBH) counterpart of Sagittarius A* (SgrA*) near its lowest and highest observed luminosity states. We investigate the structure and brightness\nof the central S-star cluster harboring the SMBH to obtain reliable flux density estimates of SgrA* during its low luminosity phases.\nWe then discuss the physical processes responsible for the brightest flare as well as the faintest flare or quiescent emission in the\nNIR and X-ray domain. To investigate the low state of SgrA* we use three independent methods to remove or strongly suppress\nthe flux density contributions of stars in the central 2\" diameter region around SgrA*. The three methods are: a) low-pass filtering\nthe image; b) iterative identification and removal of individual stars; c) automatic point spread function (PSF) subtraction. For the\nlowest observed flux density state all 3 image reduction methods result in the detection of faint extended emission with a diameter\nof 0.5\" - 1.0\" and centered on the position of SgrA*. We analyzed two datasets that cover the lowest luminosity states of SgrA* we\nobserved to date. In one case we detect a faint K-band (2.2μm) source of ∼4 mJy brightness (de-reddened with AK =2.8) which we\nidentify as SgrA* in its low state. In the other case no source brighter or equal to a de-reddened K-band flux density of ∼2 mJy was\ndetected at that position. As physical emission mechanisms for SgrA* we discuss bremsstrahlung, thermal emission of a hypothetical\noptically thick disk, synchrotron and synchrotron self-Compton (SSC) emission, and in the case of a bright flare the associated radio\nresponse due to adiabatic expansion of the synchrotron radiation emitting source component. The luminosity during the low state can\nbe interpreted as synchrotron emission from a continuous or even spotted accretion disk. For the high luminosity state SSC emission\nfrom THz peaked source components can fully account for the flux density variations observed in the NIR and X-ray domain. We\nconclude that at near-infrared wavelengths the SSC mechanism is responsible for all emission from the lowest to the brightest flare\nfrom SgrA*. For the bright flare event of 4 April 2007 that was covered from the radio to the X-ray domain, the SSC model combined\nwith adiabatic expansion can explain the related peak luminosities and different widths of the flare profiles obtained in the NIR and\nX-ray regime as well as the non detection in the radio domain.\nKey words. black hole physics, X-rays: general, infrared: general, accretion, accretion disks, Galaxy: center, Galaxy: nucleus\n\n1. Introduction\nAt the center of the Milky Way stellar motions and variable\nemission allow us to firmly associate Sagittarius A* (SgrA*)\nwith a 4×106 M⊙ super-massive black hole (Eckart & Genzel\n1996, Genzel et al. 1997, 2000, Ghez et al. 1998, 2000, 2003,\n2005a, 2008, Eckart et al. 2002, Schödel et al. 2002, 2003, 2009,\nEisenhauer 2003, 2005, Gillessen et al. 2009).\nRecent radio, near-infrared and X-ray observations have detected variable and polarized emission and give detailed insight\ninto the physical emission mechanisms at work in SgrA*,which\nmay include any or all of synchrotron, SSC, and bremsstrahlung\nemission (e.g. Baganoff et al. 2001, 2002, 2003, Eckart et al.\n2003, 2004, 2006ab, 2008ab, 2009, Porquet et al. 2003, 2008,\nGoldwurm et al. 2003, Genzel et al. 2003, Ghez et al. 2004ab,\nEisenhauer et al. 2005, Belanger et al. 2006, Hornstein et al.\n2007, Yusef-Zadeh et al. 2006ab, 2007, 2008, 2009, Marrone et\nal. 2009, Dodds-Eden et al. 2009). Multi wavelength detections\nof the radio point source at sub-millimeter, X-ray, and infrared\nwavelengths have also been made, showing that the luminosity\nassociated with SgrA* is on the order of 10−9...−10 times below\nSend offprint requests to: N. Sabha (sabha@ph1.uni-koeln.de)\n\nthe Eddington luminosity LEdd and many orders of magnitudes\nbelow that of SMBHs in active galactic nuclei (AGN) with comparable masses (of about 4×106 M⊙ ). The surprisingly low luminosity has motivated many theoretical and observational efforts\nto explain the processes that are at work in Sgr A*. For a recent\nsummary of accretion models and variable accretion of stellar\nwinds onto Sgr A* see Yuan (2006) and Cuadra & Nayakshin\n(2006, 2009).\nSgr A* is - in terms of Eddington luminosity - the faintest\nsuper-massive black hole known. However, due to its proximity\nit is bright enough to be studied in great detail. With the possible\nexception of the closest galaxies, no extragalactic super-massive\nblack hole with a similar feeble Eddington rate would be observable. Motivated by the need to explain the variable luminosity of\nSgrA* we have analyzed data from it highest and lowest states.\nIn order to separate the weak NIR emission of Sgr A* from the\nsurrounding stars, the use of large telescopes and adaptive optics\n(AO) is required. Here we present the first attempt to do this with\nnear-infrared data obtained with the VLT. Likewise, high resolution is needed in the X-ray regime to separate Sgr A* from the\nsurrounding diffuse X-ray background.\n\n\f2\n\nSabha, Witzel, Eckart et al.: The Extreme Luminosity States of SgrA*\n\nTable 1. The brightest X-ray flares from SgrA*. For references see text.\nlabel\n\ndate\n\nObservatory\n\nα= Γ−1\n\nα\nβ\nγ\n\nOct. 26/27, 2000\nOct. 3, 2002\nApr. 4, 2007\n\nChandra\nXMM\nXMM\n\n0.0±0.8\n1.2±0.3\n1.3±0.3\n\nX-ray flux\ndensity\n(μJy)\n0.65±0.07\n2.7±0.4\n1.7±0.3\n\nNIR L-band\nflux density\n(mJy)\n20±2\n\n11.8μm\nflux density\n(mJy)\n<3σ=57\n\nTable 2. Details on observing runs during which SgrA* was in a very low NIR luminosity state.\nTelescope\nObserving ID\nVLT UT 4\n\nInstrument\n\nλ\n\nNACO\n\n2.2 μm\n\nVLT UT 4\n\nNACO\n\n2.2 μm\n\nUT and JD\nStart Time\n2004 23 Sept. 23:20:45\nJD 2453272.47969\n2004 30 Aug. 23:49:36\nJD 2453248.48375\n\nThe temporal correlation between the rapid variability of the\nnear-infrared (NIR) and X-ray emission suggests that the emission showing 1033−35 erg/s flares arises from a compact source\nwithin a few tens of Schwarzschild radii of the SMBH. For\nSgrA* we assume R s =2Rg =2GM/c2 ∼1010 m for a ∼4×106M⊙\nblack hole. Here R s is one Schwarzschild radius and Rg the gravitational radius of the SMBH. One R s then corresponds to an\nangular diameter of ∼8 μas at a distance to the Galactic center of d = 8 kpc (Reid 1993, Eisenhauer et al. 2003, Ghez et\nal. 2005ab). These observations can be explained in a model\nof an intrinsically faint accretion disk that is dominated by rednoise and temporarily harbors a bright orbiting spot possibly in\nconjunction with a short jet (Eckart et al. 2006b, Meyer et al.\n2006ab, 2007). The phenomenon can best be studied through\nthe brightest flares that allow us to derive high signal to noise\nlight curves and multi wavelength observations throughout the\nelectromagnetic spectrum.\nIn its lowest luminosity states SgrA* is difficult to detect\nthough due to the presence of a strong diffuse background at Xray wavelengths and the confusion with nearby stellar sources\nin the near-infrared. Here we discuss the relative importance of\nthe bremsstrahlung and SSC process for the low state of SgrA*\nand investigate if the brightest flares of SgrA* can be explained\nvia a SSC model involving up-scattered sub-millimeter photons\nfrom compact source components. In Sects. 2 and 3 we describe\nthe observations, the data reduction and the algorithms we used\nto extract SgrA* in its low state from the background emission\nof the dense cluster of high velocity stars at angular separations\nof less than about 1\" from the position of SgrA*. Below we will\nrefer to this association of stars as the 'S-star cluster'. In Sect. 4\nwe present and discuss results. We start by summarizing the results of our deep Ks imaging in subsections 4.1 and 4.2. In the\nfollowing subsections we then discuss various emission mechanisms for the low and high luminosity states of SgrA*. We show\nthat the SSC process can successfully discribe both the low and\nhigh luminosity states and that - in particular for the high states\n- no extra mechanisms need to be involved (discussion in e.g.\nDodds-Eden et al. 2009, Eckart et al. 2009). A brief summary\nand conclusions are presented in Sect. 5.\nThroughout the paper we quote de-reddened infrared flux\ndensities using a Ks-band (2.2μm) extinction correction of AK s =\n2.8 (Scoville et al. 2003, Schödel et al. 2007, Schödel et al. 2010\nin prep., Buchholz, Schoedel, Eckart 2009). In Sect. 4.1 we use\nΓ and γ to describe the projected and three dimensional structure\nof the central stellar cluster respectively. In Table 1 and starting\n\nUT and JD\nStop Time\n2004 24 Sept. 01:45:11\nJD 2453272.57304\n2004 31 Aug. 01:28:19\nJD 2454466.50000\n\nwith subsection 4.4 we use Γ and γ as the bulk boosting factor\nand the relativistic electron Lorentz factor.\n\n2. Observations and data reduction\nNear-infrared (NIR) observations of the Galactic center (GC)\nwere carried out with the NIR camera CONICA and the adaptive optics (AO) module NAOS (briefly \"NACO\") at the ESO\nVLT unit telescope 4 (YEPUN) on Paranal, Chile. The data were\ntaken on the night of 30 August and 23 September, 2004. The\ndataset taken on 23 September 2004 turned out to be the best\navailable set in which SgrA* is in a quiet state. During the 30\nAugust observations some weak activity at 2.2μm could be detected, making this dataset well-suited to determine the position\nof SgrA* with respect to neighboring stars. The combination of\nboth datasets is ideally suited to obtain a flux density estimate or\nlimit of SgrA* in its quiet state.\nFor all observations the infrared wavefront sensor of NAOS\nwas used to lock the AO loop on the NIR bright (Ks-band magnitude ∼6.5) supergiant IRS 7, located about 5.6′′ north of Sgr A*.\nThe pixel scale was 13.27 mas.\nThe atmospheric conditions (and consequently the AO correction) were stable during the observations. The seeing at the\ntelescope measured in the optical was ∼0.6\". We used an integration time of DIT=2 seconds and a number of integrated images of NDIT=15. Details on start and stop times are listed in\nTable 2.\nAll observations in the Ks-band (2.2 μm) were dithered to\ncover a larger area of the GC by mosaic imaging. The sky background for the Ks-band observations was extracted from the median of stacks of dithered exposures of a dark cloud – a region\npractically empty of stars – about 400\" north and 713\" west of\nthe target. All exposures were sky-subtracted, flat-fielded, and\ncorrected for dead or bad pixels. The images were shifted and\nstacked in a cube with a mean average to get a mosaic image\nof the GC. All of these steps were performed with the DPUSER\nsoftware for astronomical image analysis (T. Ott, MPE; see also\nEckart & Duhoux 1990). Subsequently, PSFs were extracted\nfrom these images with StarFinder (Diolaiti et al. 2000) both\nfor deconvolution with the Lucy-Richardson (LR Lucy 1974) algorithm and for PSF subtraction.\nThe flux densities of the sources were measured by aperture photometry with circular apertures of 40 mas radius and\ncorrected for extinction, using AK = 2.8 (Scoville et al. 2003,\n\n\fSabha, Witzel, Eckart et al.: The Extreme Luminosity States of SgrA*\n\n3\n\nposition\n\n0.5''\nFig. 1. Identification of individual sources that were used for the iterative subtraction of the Ks-band datasets (Table 2). Here we show the image\nderived from the 23 September 2004 data. The nomenclature was taken from the deconvolved H-band image given in Fig.1 by Gillessen et al.\n(2006). Sources that are not contained in there have labels starting with 'N'. Relative positions and flux densities of the labeled sources are given\nin Table 3.\n\nSchödel et al. 2007, Schödel et al. 2010 in prep., Buchholz,\nSchoedel, Eckart 2009). Possible uncertainties in the extinction\nby a few tenths of a magnitude alter the infrared flux densities\nof SgrA* by a few 10%. These variations are easily compensated for by insignificant variations in the spectral indices or the\nboosting which do not influence the general results obtained in\nthis paper.\nThe flux density calibration was carried out with the known\nKs-band flux densities of IRS16C, IRS16NE, and IRS21 by\nBlum, Sellgren & Depoy (1996). Subsequently the relative photometry for Sgr A* was done using 10 sources within 1.′′ 6 of\nSgr A* as secondary calibrators (S67, S92, S35, S8, S76, S1,\nS2, S87, S65, S30; Gillessen et al. 2006). This results in a Ksband flux density of the high velocity star S2 of 22±1 mJy,\nwhich compares well with the magnitude and flux for S2 quoted\nby Ghez et al. (2005b) and Genzel et al. (2003). The measurement uncertainties for Sgr A* were obtained on the nearby reference star S2. The background flux in the immediate vicinity\nof Sgr A* was obtained by averaging the measurements at six\nrandom locations in a field located about 0.′′ 6 west of Sgr A*\nthat is free of obvious stellar sources. A Ks-band image of the\ncentral 4.3\"×2.5\" is shown in Fig. 1. This field is at the center\nof the stellar cluster of which we show a 15\"×15\" overview in\nFig. 2a). The source positions and relative astrometry was established via StarFinder. The positions in Table 3 are given relative\nto the position of SgrA* as determined from the 23 September\n2004 data. We list the name following the nomenclature used by\nGillessen et al. (2009) and in the second column the name used\nby Do et al. (2009b). Sources labeled with N had not been identified before. Identifications with question marks are tentative\n\nand suffer most likely from the proper motion of faint sources\nbetween the present date and the date used for identification by\nGillessen et al. (2009). Then we list in Table 3 the sky projected\nrelative offsets ∆α, ∆δ and radial distance R from SgrA* in arcseconds. The uncertainties in the offsets are better than a third\nof a pixel i.e. 0.004\" We then list in Table 3 the observed Ks\nmagnitude derived in this paper and the observed K' magnitude\nlisted by Do et al. (2009b) corrected by an offset value of -0.2\nmagnitudes. The scatter between both values after correction for\nthis offset is 0.2 magnitudes, so that the offset corresponds to\n1σ in magnitudes (20% in flux) and is well within the expected\ncalibration uncertainties for faint stars in the crowded field. The\ndifference between both mangitude values is listed in the last\ncolumn. For sources S0-8, S0-18 and S0-38 no magnitudes are\ngiven by Do et al. (2009b). The large magnitude difference in\nthe case of S0-12 is most likely due to the blend of S59 and S60.\nThe two NIR filters K s and K' (Do et al. 2009b) are very similar with Ks(NACO): λcenter =2.18μm and width ∆λ=0.35μm and\nK'(NIRC): λcenter =2.124μm and width ∆λ=0.351μm. No transformation between magnitudes derived with these filters was applied. The 0.2 mag scatter relates to stars of different brightnesses at different epochs between which they are moving at\ndifferent locations in the cluster with respect to different local\nbackgrounds. The relative flux density uncertainty for the star S2\n- which we use as an estimate for SgrA* - is determined within\na single epoch at fixed position.\n\n\f4\n\nSabha, Witzel, Eckart et al.: The Extreme Luminosity States of SgrA*\n\nTable 3. Sources used for iterative source subtraction for the 23 September 2004 data.\nname\nS62\nS17\nS38?\nS55\nS40\nS2\nS13?\nS19\nS14\nS18\nS44\nS20\nS39\nS1\nS63\nS4\nS22\nS12\nS23\nS52\nNS2\nS21\nS36\nS60/59\nS41\nS10\nS5\nS42\nS9\nS57\nS25\nS47\nS28\nS6\nS8\nS32\nNS1\nS37\nS7\nS43\nS29\nS27\nS49\nS45\nS24\nS53\nS34\nS11\nS46\nS48\nS35\n\nother\nname\nS0-17\n\nS0-2\nS0-8\nS0-38\n\nS0-1\nS0-3\n\nS0-12\nS0-6\nS0-5\nS0-18\n\nS0-4\n\nS0-11\nS0-27\nS0-28\nS0-9\nS0-13\n\n∆α\narcsec\n0.01\n0.02\n-0.08\n0.07\n0.12\n0.02\n-0.11\n0.06\n0.16\n-0.20\n-0.08\n0.21\n-0.10\n0.00\n0.24\n0.29\n0.17\n-0.06\n0.32\n0.19\n0.18\n-0.33\n0.27\n-0.29\n-0.23\n0.04\n0.34\n-0.17\n0.18\n0.42\n-0.11\n0.38\n-0.01\n0.47\n0.39\n0.33\n0.27\n0.33\n0.51\n-0.51\n-0.21\n0.14\n0.56\n0.19\n-0.16\n0.29\n0.32\n0.17\n0.24\n0.44\n0.54\n\n∆δ\nacrsec\n-0.02\n-0.09\n0.05\n-0.09\n0.00\n0.13\n0.09\n-0.15\n0.12\n-0.06\n-0.23\n0.12\n0.23\n-0.25\n-0.13\n0.12\n-0.27\n0.31\n-0.08\n0.27\n0.32\n-0.14\n0.25\n0.24\n-0.31\n-0.38\n0.19\n-0.37\n-0.36\n-0.14\n-0.43\n0.23\n0.46\n0.09\n-0.28\n-0.36\n0.42\n0.38\n-0.05\n-0.15\n0.49\n0.53\n0.04\n-0.52\n-0.54\n0.49\n-0.47\n-0.58\n-0.56\n0.45\n-0.43\n\n3. Subtracting stars\nTo investigate the low luminosity state of SgrA* we use three\nindependent methods to remove or strongly suppress the flux\ndensity contributions of stars in the central 2\" diameter region\naround SgrA*. All three methods give comparable results and\nallow us to clearly determine the stellar light background at the\ncenter of the Milky Way against which SgrA* has to be detected.\nWe assume that the PSF as determined from stars in the central few arcseconds of the image is uniform across the central Sstar cluster. Investigations of larger images (e.g. Buchholz et al.\n\nR\narcsec\n0.03\n0.09\n0.10\n0.11\n0.12\n0.13\n0.14\n0.16\n0.20\n0.21\n0.24\n0.24\n0.25\n0.25\n0.28\n0.31\n0.32\n0.32\n0.33\n0.33\n0.36\n0.36\n0.36\n0.37\n0.38\n0.38\n0.39\n0.40\n0.40\n0.44\n0.44\n0.45\n0.46\n0.48\n0.48\n0.49\n0.50\n0.50\n0.51\n0.53\n0.54\n0.55\n0.56\n0.56\n0.56\n0.57\n0.57\n0.60\n0.61\n0.63\n0.69\n\nflux\nmJy\n1.52\n8.06\n1.27\n0.71\n1.88\n22.00\n7.04\n1.79\n7.41\n2.19\n1.13\n8.80\n1.37\n14.00\n1.20\n14.02\n2.39\n8.04\n1.01\n0.98\n1.06\n2.03\n3.66\n6.70\n1.10\n21.99\n9.47\n1.62\n12.66\n0.89\n10.71\n2.73\n1.56\n8.02\n17.72\n2.85\n1.81\n2.74\n10.38\n1.30\n2.33\n7.34\n1.60\n7.59\n6.26\n1.30\n8.55\n23.79\n6.92\n3.21\n45.90\n\nKs\n17.0\n15.2\n17.2\n17.9\n16.8\n14.1\n15.4\n16.9\n15.3\n16.7\n17.4\n15.1\n17.2\n14.6\n17.3\n14.6\n16.6\n15.2\n17.5\n17.5\n17.4\n16.7\n16.1\n15.4\n17.4\n14.1\n15.1\n17.0\n14.7\n17.6\n14.9\n16.4\n17.0\n15.2\n14.4\n16.4\n16.9\n16.4\n15.0\n17.2\n16.6\n15.3\n17.0\n15.3\n15.5\n17.2\n15.2\n14.1\n15.4\n16.2\n13.3\n\nK'-0.2\n\n∆mag\n\n15.5\n\n-0.3\n\n13.9\n?\n\n0.2\n\n?\n\n14.5\n\n0.1\n\n14.3\n\n0.3\n\n14.2\n\n1.2\n\n14.0\n\n0.1\n\n14.9\n\n-0.2\n\n?\n\n14.3\n\n0.1\n\n15.1\n\n-0.1\n\n15.5\n\n-0.2\n\n15.6\n\n-0.1\n\n14.2\n\n-0.1\n\n13.3\n\n0.0\n\n2009) show that on scales of a few arcesconds this is a reasonable\nassumption and that PSF variations have to be taken into account\nonly for fields ≥10\". Whether the residual extended emission we\nfind close to SgrA* is due to rsiduals from the subtracting algorithms or associated with additional stellar emission from the\nS-star cluster is discussed in Sect. 4.1.\n\n\fSabha, Witzel, Eckart et al.: The Extreme Luminosity States of SgrA*\n\n3.1. Linear extraction of extended flux density\n\nWith the point spread function P and the object distribution O\nwe can write the formation of an image I as\nI = O ∗ P = (∆ + E) ∗ P = ∆ ∗ P + E ∗ P .\n\n(1)\n\nHere the symbol ∗ denotes the convolution operator. The\nvariable ∆ denotes the distribution of stellar sources and E the\ndistribution of extended emission. Both types of sources are assumed to be ideally unresolved or resolved with respect to the\npoint spread function. To produce a high-pass filtered image we\ncan calculate a smooth-subtracted image Σ as\nΣ = I ∗ G − I = (∆ + E) ∗ P ∗ G − (∆ + E) ∗ P .\n\n(2)\n\nHere we use a narrow Gaussian G normalized to an integral\npower of unity. This can be rewritten as\nΣ = ∆ ∗ (P ∗ G − P) + (E ∗ P ∗ G − E ∗ P) .\n\n(3)\n\nSince the width of the extended emission is expected to be\nmuch larger than the full width at half maximum of the PSF, and\nin particular since the Gaussian G is narrow with respect to P,\nwe can infer that E ∗ P ∗ G ∼ E ∗ P. Then the differential point\nspread function P ∗ G − P is the PSF of the high-pass filtered\ndifferential image\nΣ ∼ ∆ ∗ (P ∗ G − P) .\n\n(4)\n\nSince Σ is fully dominated by the contribution of the distribution of unresolved stellar sources, this distribution ∆ can be\nretrieved via a linear deconvolution of the differential image with\nthe differential PSF\n∆ ∼ Σ % (P ∗ G − P) .\n\n(5)\n\nHere the symbol % denotes the deconvolution operation.\nConsequently the distribution of extended flux (i.e. a low-passed\nfiltered version of the image) E ∗ P can now be isolated via\nE∗P= I−∆∗P\n\n(6)\n\nor\nI − Σ ∗ P % (P ∗ G − P) = ∆ ∗ P + E ∗ P − ∆ ∗ P = E ∗ P . (7)\nThe advantage of this new method is that it is independent\nof input models, i.e. it does not depend on the identification of\nindividual stars or on assumptions on the existence or properties of a diffuse background flux density distribution. Also the\nmethod only uses linear operations, i.e. image subtraction and\nlinear convolution and deconvolution (Fourier multiplications\nand divisions). Therefore it is not dependent on the flux density of sources and numbers of iterations, as is the case for many\nnon-linear algorithms (e.g. the Lucy-Richardson or maximum\nentropy algorithm). In order to demonstrate the validity of the\napproach we show the results we obtained on the central 15\"×\n15\" of the 23 September data in Fig. 2. For all the prominent\nextended Ks-band sources (Fig. 2) the extended Ks-band emission can be retrieved and its structure compares very well to the\npreviously published results (e.g. Ott, Eckart & Genzel 1999,\nTanner et al. 2002, 2005). (A comparison of different deconvolution algorithms used in the crowded Galactic center field is given\nin Ott, Eckart & Genzel 1999.) At a dynamic range of about\n\n5\n\n100:1 we show in Fig. 2b) a low-pass filtered version of the Ksband image that was obtained by following the algorithm outlined above. The prominent sources have been labeled with their\nnames. In Figs. 2c), d) and e) we show the extended flux density\ndistribution of the following sources: IRS 1W, IRS 21, IRS 10W.\nThese bow-shock structures are shown at the angular resolution\nof about 0.1\" as delivered by the AO system. They compare very\nwell with the source structures published by Tanner et al. 2005.\nHere the algorithm detects very bright sources like IRS 7 also\nas an extended object since the star is overexposed and not well\ndescribed by the used PSF. In Fig. 3 we show results of the algorithm on the central 2\"× 2\". In addition to residuals of the filter\nprocess around the position of bright stars, we see an increased\nflux density level within the dashed 0.5\" diameter circle centered\non the position of SgrA*. The disadvantage of this algorithm is\nthat any point-like emission from SgrA* is also strongly suppressed. The residuals (ringing) still evident around the bright\nstars are a consequence of the choice of the apodization filter\nthat needs to be defined in the case of linear deconvolution. This\nfilter is used to suppress the usual high spatial frequency noise\nthat arises due to small number division problems. We used a\ncosine-bell shaped filter that preserves the high angular resolution but results in some residual ringing. However, the result on\nthe background emission is not strongly influenced by this, since\nthe bright stars are sufficiently far away from the central position. The comparison to the results of the other two algorithms\nused to remove the contributions of stars near SgrA* shows that\nthe result is also little affected by the much fainter stars close to\nSgrA*. Their contribution has been efficiently suppressed by the\nalgorithm.\n3.2. Iterative PSF subtraction\n\nThe iterative PSF subtraction was carried out within the central\n2\" to 3\" around the position of SgrA*. This was performed by resizing, shifting and scaling the PSF to the position and the value\nof each star and then subtract it. The sources used for this process are listed in Table 3 and are shown in Fig. 1. A total number\nof 51 stars were subtracted so that the resulting background was\nas smooth as possible. In Fig. 4 we show the resulting subtracted\nimage of the area of interest around SgrA*. All stars brighter\nthan about 17.5m (see KLF in Fig. 6) have been subtracted with\na scaled version of the PSF. The thin lines in Figs. 4a) and b) are\nused to triangulate the position of SgrA*. Fig. 4a) shows the image obtained from a section of the 30 August dataset with SgrA*\nflaring. Compared to S2 with ∼22 mJy SgrA* has a brightness of\nabout 4 mJy. Fig. 4b) shows the image obtained from a section of\nthe 23 September dataset with SgrA* in a quiescent phase. Here\nSgrA* is clearly not detected and is fainter than about 2 mJy\n(de-reddened).\nFigure 4 also reveals the presence of faint residual extended\nemission - centered on the position of SgrA*. This residual emission is most likely from the central S-star cluster of high velocity\nstars. We determined the position of SgrA* from the data with\nSgrA* in a flare state taken on 30 August, 2004. Taking an upper\nlimit of the observed two dimensional projected stellar velocity\ndispersion of ∼1000 km/s and the fact that for the Galactic center proper motion of 1 mas/yr corresponds to about 39 km/s, the\nrelative positional uncertainty for stars observed between both\nepochs is expected to be well below 2 mas. Thin lines in Figs. 4a)\nand b) are used to triangulate the position of SgrA*. Figure 4\nshows that for the dataset taken on 23 September 2004 no NIR\ncounterpart of SgrA* was detected. For 30 August 2004 we find\na NIR counterpart of SgrA* with a dereddened flux density of\n\n\f6\n\nSabha, Witzel, Eckart et al.: The Extreme Luminosity States of SgrA*\n\nFig. 2. The Ks-band image of the Galactic center region (a) taken on\n23 September 2004. The central 15\"×15\" image was taken with the\nadaptive optics system NACO at the ESO VLT and the results of the\nlow-pass filter algorithm. (b,c,d,e). The contour lines are separated by\n8% of the peak brightness of IRS10W.\n\nFig. 4. Results of the iterative star subtraction obtained for the 30\nAugust (a) 23 September data (b) as described in Sect. 3.2.\n\nFig. 3. The inner 2\"×2\" of the central stellar cluster (23 September\n2004). The position of SgrA* is at the center of the images a) and b). In\npanel a) we show the corresponding image section taken out of the Ksband image in Fig. 2 a). In panel b) we show the corresponding image\nsection taken out of the low-pass filtered version in Fig. 2 b).\n\nabout 4 mJy with a 3σ uncertainty of about 2 mJy. Estimates of\nthe flux density limits and uncertainties are given in Sect. 4.2.\n3.3. Automatic PSF subtraction\n\nWe also analyzed the images with the StarFinder (Diolaiti et\nal. 2000) program package. It not only provides accurate point\nsource photometry but also a reliable estimation of the diffuse\nbackground emission. With a point spread function (PSF) extracted from bright stars near the guide star (in this case IRS 7),\nwe performed photometry and astrometry on the deconvolved\nimage via PSF fitting with the StarFinder package. The resulting\ndiffuse background emission is shown in Fig. 5. In addition to\nsome residual emission from unresolved stars this method also\nreveals extended emission centered on the position of SrgA*\nwithin the dashed 0.5\" diameter circle centered on the position\nof SgrA*. This finding agrees with the low-pass filtered image\nin Fig. 3.\n\nFig. 5. Result of the automatic PSF subtraction obtained for the 23\nSeptember 2004 data.\n\n4. Results and discussion\nFirst we analyze the properties of the central cluster of high velocity stars and compare them to the results of published investigations. We can then confidently derive the flux density limits\non SgrA* and show that contributions to the lowest luminosity states from bremsstrahlung are unlikely. We then discuss the\nextreme luminosity states of SgrA* in the framework of a synchrotron self-Compton mechanism.\n4.1. Imaging the S-star cluster and the detection of SgrA* in\nits low luminosity state\n\nThe detected number of 51 stars within a radial distance of\nabout 0.5\" from SgrA* results in a surface number density of\n68±8 arcsec−2 , taking the square-root as the uncertainty of that\nvalue. This result agrees with the central number density of\n\n\fSabha, Witzel, Eckart et al.: The Extreme Luminosity States of SgrA*\n\n7\n30 August 2004\n23:49:36 to 01:28:19\n\n1.0\n\n20\n\n1\n\nflux [mJy]\n\nlog(N)\n\n15\n\n0.5\n\n10\n\n0.5\n\n5\n\n0.0\n\n0\n\n12\n\n14\n\n12\n\n16\n\n14\n16\nKs magnitude\n\n18\n\nfrom the 23 September 2004 data. The straight full and dashed lines\nindicate the KLF slope of 0.21±0.02 found for radii of less than 6\" by\nBuchholz et al. (2009).\n\n0\n\n20\n\n40\n\n0\n\n20\n\n40\n\n60\n\n80\n\n100\n\n60\n\n80\n\n100\n\n0.3\n0.2\n0.1\n\n18\n\nFig. 6. KLF histogram of the stars detected in the central field derived\n\ntime [min]\n\nFig. 8. The 30 August 2004 light curve of the flux density measured\nin a 40 mas radius circular aperture centered on the position of SgrA*\n(black). We show the light curve of the reference star S2 in green. The\nbottom panel shows the FWHM seeing in arcseconds measured on the\nPSF extracted for the field. The grey points show the background counts\nnear SgrA*. The width of the error bars is close to the size of the data\npoints.\n\n1.0\n\n23 September 2004\n\n1E0\n\n23:20:45 to 01:45:11\n\n0.8\n\n20\n\nflux [mJy]\n\n15\n\n0.5\n\n10\n\n5\n\n0\n1E−2\n\n1E−1\n\n0.02\n\n0.1\n0.2 0.3\nradius in arcseconds\n\nFig. 7. Azimuthal average of the diffuse background emission as derived from the three different methods applied: low pass filtering (red),\nmanual PSF subtraction (green), and automatic PSF subtraction (blue).\nThe curves (mean flux and 1σ uncertainty per pixel) have been calculated in anuli of 39.8 mas (3 pixels) width and normalized to the value\nat 30 mas radius corresponding to one resolution element at 2.2μm. The\nblack dashed line marks a profile with an exponential decrease of 0.2.\n\n60±10 arcsec−2 given by Do et al. (2009b) in their Figs. 9 and\n10.\nFigure 6 shows the KLF histogram (K-band luminosity function) that can be derived for the stars detected in the central field.\nThe binning of 0.75 magnitudes allows for a sufficient number of\nbins to clearly detect the linear slope in the double logarithmic\nplot and to have a sufficiently large number of sources per bin\n(about 10) at the same time. With d log(N)/d log(Ks)=0.3±0.1\nthe data compare well with the KLF slope of 0.21±0.02 found\nfor the inner field (R < 6′′ ) by Buchholz et al. (2009).\nWithin the central 0.5 arcsecond radius region around SgrA*\nand in the magnitude interval ranging from Ks=16.75 to 17.50\n\npsf fwhm [arcsec]\n\nrelative azimuthally averaged intensity\n\npsf fwhm [arcsec]\n\n0\n0.4\n\n0\n\n50\n\n0\n\n50\n\n100\n\n150\n\n100\n\n150\n\n0.4\n0.3\n0.2\n0.1\n\ntime [min]\n\nFig. 9. The same as Fig.8 but for 23 September 2004.\nno significant deviation from a straight powerlaw line can be\ndetected - implying that the completeness is high and probably\ncomparable to the ∼70% value derived for magK =17 by Schödel\net al. (2007). In the interval ranging from Ks=17.50 to 18.25 the\nstellar counts drop quickly to about 20% of the value expected\nfrom the straight powerlaw line.\nAll three methods we used to correct for the flux density\ncontribution of the stars in the central 2\" reveal faint extended\nemission around SgrA* (see Figs. 3b, Fig. 4b and Fig. 5). For\nthe iterative and automatic PSF subtraction the PSFs were extracted with a radius of 1\", which is about twice the FWHM of\nthe S-star cluster. In case of a PSF misplacement a significant\nflux density contribution to the central position can only come\nfrom the about five stars that are located within one FWHM of\nSgrA*. They have a median brightness of about 2 mJy. To ex-\n\n\f8\n\nSabha, Witzel, Eckart et al.: The Extreme Luminosity States of SgrA*\n\nplain all of the ∼2 mJy at the center by this effect, each star\nwould have to provide about 0.4 mJy or 20% of its flux density.\nThis can only be realized by a systematic positional shift of these\nstars towards the center by about 1 pixel∼13 mas each. Still, the\npositional accuracy which is typically reached is on the order of\na few tenths of a pixel. Larger displacements result in a clearly\nidentifiable characteristic plus/minus pattern in the residual flux\ndistribution along the shift direction. However, allowing for a\nmaximum positional uncertainty of 1 pixel and approximating\nthe independent shifts of five stars by five shifts of a single star\nthat follows a random\nwalk pattern, the expected effective dis√\nplacement is 1/ 5 pixels for a single shift of each star. It will\nresult in a 5% peak flux contribution of each of the 5 stars assuming that the displacements are systematically towards the\ncenter, i.e. a total maximum contribution of 0.4 mJy. This implies that about one 20%-30% of the flux density detected at\nthe center may be explained by a positional misplacement of the\nneighboring stars. Therefore we assume that the bulk (more than\n2/3) of this extended emission toward the center can be associated with the ∼0.5\"-1\" diameter S-star cluster around SgrA* and\nis due to faint stars at or beyond the completeness limit reached\nin the KLF.\nThe extended residual emission is not distributed azimuthally uniform about the position of SgrA*. This is not expected either. The shape of the residual emission will always be\ndominated by the randomly distributed few brightest stars that\ncontribute to it. Also the light of the central stellar cluster is not\ndistributed azimuthally uniform on any scale: On scales larger\nthan 0.5 pc it is affected by dust absorption (e.g. extinction map\nby Buchholz et al. 2009), on scales less than 0.5 pc the bright\nmembers of the IRS16 cluster are predominantly located to the\neast, and during the past decade in the central arcsecond most\nof the brighter S-stars have been located to the south and east of\nSgrA*.\nThe diffuse background emission can be compared to the\nprojected distribution of stars Σ(R)∝R−Γ , with R being the projected radius. Independent of the applied method we find that the\nazimuthally averaged residual diffuse background emission centered at the position of SgrA* decreases very gently as a function\nof radius (Fig. 7). The ratio between the brightness measured\nwithin or at the edge of the central resolution element (R∼0.03\")\nand at a projected radius of e.g. R=0.2\" is 1.5±0.15, corresponding to Γdi f f use =0.20±0.05. This is consistent with the distribution\nof number density counts of the stellar populations in the central\narcseconds derived from imaging VLT and Keck data. Buchholz\net al. (2009) and Do et al. (2009b) find a Γ∼1.5±0.2 for the young\nstars, but a much flatter distribution for the late-type (old) stars\nwith Γ∼0.17±0.09 or even Γ∼-0.12±0.09, respectively. For pure\nimaging Do et al. (2009b) quote Γinner =0.19±0.06 inside a radius\nof R=3\".\nIn case of a relaxed stellar cluster around a supermassive\nblack hole, stellar dynamics predicts to observe a cusp, i.e. a\ndensity increase toward the black hole with Γ = γ − 1 = 0.5 to\n0.75 (Bahcall & Wolf 1976, Murphy 1991; Lightman & Shapiro\n1977; Alexander & Hopman 2009). Here γ denotes the exponent\nof the three dimensional distribution which does not suffer from\nprojection effects but is harder to deduce from observed data.\nOnly in the case of very extreme stellar densities collisions can\nlead to a Γ as low as 0.5. But the required high densities are not\nreached in the Galactic center.\nThe observed values of Γ are significantly lower than what\nis predicted by theory. The principal reason is probably to be\nsought in the stellar population in the central arcseconds, which\ntowards Sgr A* becomes increasingly dominated by young mas-\n\nsive stars that are too young to be dynamically relaxed. The small\nvalue of the projected diffuse light exponent Γdi f f use ∼Γinner may\ntherefore imply the absence of a pronounced, relaxed cusp of\nstars.\nHowever, there may in fact exist a deficit of late-type stars\nnear Sgr A* (see also Genzel et al. 2003, Fig. 7). It may well\nbe that most of the spectroscopically identified late type stars at\nsmall projected distances are at larger three dimensional radii r\nR from SgrA*. In this case the observed Γdi f f use ∼Γinner will be a\nmixture between the much steeper Γearly for early type stars and\nthe lower value Γlate for late type stars. A detailed discussion is\ngiven in Do et al. (2009b), Buchholz et al. (2009), Schödel et al.\n(2007), and Genzel et al. (2003).\nThe main result for the present analysis of faint luminosity states of SgrA* is that the observed flat background\nlight and number density distribution described by the exponent Γdi f f use ∼Γinner as well as the high degree of completeness\nreached around Ks=17.5 allows us to clearly distinguish the\nemission of SgrA* against the stellar light background at the\ncenter of the Milky Way. This also shows that SgrA* is ideally\nsuited to perform a case study to investigate this super-massive\nblack hole in its lowest activity state.\n4.2. Observing SgrA* at low luminosities\n\nHigh angular resolution images in the near-infrared allow us to\nunambiguously attribute bright dereddened flux levels to SgrA*\n(e.g. Genzel et al. 2003, Eckart et al. 2004, Ghez et al. 2004ab,\nHornstein et al. 2006, Do et al. 2009a). The identification of\nfainter emission from SgrA* becomes increasingly difficult,\nsince one can expect confusion from the ∼1\" diameter S-star\ncluster that is centered on the location of Sgr A*. Due to the high\nproper motions of the stars within the S-star cluster this confusion also changes on the time scales of months to years. From the\nlocation of SgrA* Do et al. (2009a) find observed 0.082 ± 0.017\nmJy (K ′ = 17.2) or dereddened 1.75±0.36 mJy (assuming their\nvalue of AK ′ = 3.3) as the the faintest observed K ′ flux density\n(see also Hornstein et al. 2002 and Eckart et al. 2006). Using\nAK ′ = 2.8 this results in a flux density of 1.1±0.2 mJy\nFor the low flux density state Do et al. (2009a) reported red\ncolors and variability compared to stellar sources. For the very\nlow luminosity levels they report with an average power law exponent of -0.17±0.32 a bluer spectrum than that reported earlier\nby Hornstein et al. (2002) with a power law slope of 0.6 ± 0.2.\nThe contamination from nearby (predominantly blue) stars is estimated to contribute a maximum of about 35% of the flux to account for this difference in the spectral slope. Do et al. (2009a)\nconclude that even when the emission is faint a large fraction of\nthe flux arising from the location of SgrA* is likely non-stellar\nand can be attributed to physical processes associated with the\nblack hole.\nOur data allow us to provide a new independent estimate on\nthe flux density of SgrA* in some of its lowest states based on\nVLT data.\nIn a circular aperture of a diameter of 66 mas diameter (5\npixels or about one resolution element) we measure dereddened\nflux densities (using AK = 2.8) 1.5±0.4 mJy, 1.3±0.3 mJy, and\n1.3±0.2 mJy for the low-pass filtering, iterative, and automatic\nPSF subtraction method, respectively.\nThe uncertainties have been derived from the flux density\nmeasurements in the central 5×5 pixel aperture and the upper limits of the measurement uncertainties per pixel as plotted in Fig. 7. These upper limits are 0.33 mJy, 0.24 mJy and\n0.17 mJy for the three methods, respectively. Based on these\n\n\fSabha, Witzel, Eckart et al.: The Extreme Luminosity States of SgrA*\n\ndata we derived an upper limit on the formal uncertainties in\nany random 5×5 pixel aperture in the central 0.6\" diameter field\nof 0.066 mJy, 0.048 mJy and 0.034 mJy for the three methods,\nrespectively. We adopted these values for the central aperture. In\norder to obtain a conservative estimate we added in each case\nthese values five times, so that the final uncertainty amounts to\nsix times the value expected for an aperture of this size - based\non the radial averages. There is no clear detection of a source\nat that position. If the observed flux density limit is fully attributed to SgrA* this corresponds to a clear non-detection of\nany point source at that position with a flux density limit of\n2.4 mJy for SgrA* (K s ∼16.3; observed reddened magnitude).\nIf all of it is stellar, the upper limit is defined by the uncertainty of the measurement and the limit for a flux density from\na non-stellar source at the position of SgrA* is 0.9 mJy (3σ,\nde-reddened and K s ∼17.3 as an observed reddened magnitude).\nWhile our data do not allow us to confirm the existance of a constant quiescent state, our flux density limit is consistent with the\nflux given by Do et al. (2009a). This flux density limit is also\nconsistent with the light curves of SgrA* shown in Figs.8 and\n9. They were obtained in a 40 mas radius aperture centered at\nthe position of SgrA*. The light curves were taken without removing any stars from the sourroundings and the aperture size\nof only 40 mas was chosen to minimize the contamination from\nneighboring stars. The bottom parts of Figs.8 and 9 show the\nFWHM of the PSF extracted on a nearby star. These graphs show\nthat the seeing and AO performance were very stable and similar\nduring the measurements on both dates. Especially in the second\nhalf of the 30 August light curve in Fig.8 SgrA* was sufficiently\nbright to be detected, while it was in a low state during the entire time during which the 23 September light curve in Fig.9 was\ntaken. Our flux density limit for the 23 September data is consistent with the completeness limit we reached in the central star\ncounts (see Sect. 4.1).\n\n4.3. Bremsstrahlung emission from SgrA*\n4.3.1. The quiescent state X-ray emission from SgrA*\n\nBaganoff et al. (2001, 2003) reported an extended (R>103 R s )\nthermal bremsstrahlung source co-spatial with the position of the\nstrongly variable point source at the location of SgrA* (see also\nQuataert 2003). The authors derive 1.4\"±0.14\" for the intrinsic\nFWHM size of the source. This corresponds to ∼8×104RS for a\n4×106 M⊙ black hole. The scale of the extended structure centered on SgrA* is consistent with the expected Bondi accretion\nradius (1\"- 2\"; Bondi 1952) for matter accreting hydrodynamically onto the SMBH. For the bright flare emission of the X-ray\npoint source bremsstrahlung is not a likely mechanism to produce the observed NIR flux density excursions (Genzel et al.\n2003, Yuan et al. 2003, Quataert, 2002). In part motivated by\nthe blue spectrum reported by Do et al. (2009a) - assuming that\nnot all of the blue character is due to stellar contamination - we\ninvestigate here if the lowest NIR flux density values can be explained by a bremsstrahlung contribution from a hot disk.\n4.3.2. Possible low state bremsstrahlung NIR luminosity?\n\nWe now estimate the possible contribution of the X-ray emitting gas that is associated with the compact disk or jet footpoint of SgrA* to its Ks-band luminosity. The frequency\nand temperature dependency of the volume emissivity for the\nhν\n)dν. Here the Gaunt\nbremsstrahlung is Eν dν ∼ g(ν,T)×exp(- kT\n\n9\n\n0\n\n1\n\n2\n\n3\n\n4\n\n10 10 10 10 10 10\n\n5\n\nFig. 10. Sketch of the SgrA* surroundings within a 105 Schwarzschild\nradius. The SMBH encloses the central 1 Rs volume surrounded by an\nedge on seen disk with indicated spots. The circles are logarithmically\nscaled and labeled with their radii in units of Rs . During and after flares\nthe spots expand to meet the accretion flow density of about 107 cm−3\nat an approximate radius of 1000 Rs . The edge of the 1.4\" FWHM size\nBondi sphere is located at a radius of about ∼8×104 RS for a 4×106 M⊙\n(Baganoff et al. 2001, 2003).\nfactor is g(ν,T)∼0.54×ln(4.7×1010 T/ν). For the X-ray luminosity in the 2-10 keV range of a H/He plasma this results in\n33 2 1/2 3\nL( erg\ns ) ≈ 10 ne T 8 R with the source radius R given in pc, the\nelectron density ne given in cm−3 , and the temperature T 8 given\nin unity of 108 K. The Gaunt factor implies that for a change in\nthe observing frequency from ∼1018 Hz in the X-rays to ∼1014 Hz\nin the NIR for constant T>>hν/k the Gaunt factor changes significantly by a factor of ln(104)∼10. So in total the Ks-band luminosity expected over this frequency range is about 1000 times\nlower than the X-ray luminosity. However, already for a ∼1 mJy\nKs-band flux density contribution and high temperatures above\n108 K the predicted X-ray flux would well exceed the measured\nvalues.\nSubstantial flux density contributions due to bremsstrahlung\ncan only occur if a sufficient amount of 'cooler' gas (i.e.\n<<108 K) is mixed into the central accretion flow or disk. Such\na two phase medium has already been discussed in the context\nof flares from SgrA* (Yuan et al. 2003, see also Page et al. 2004,\nNayakshin & Sunyaev 2003). A possible quiescent phase at low\ninfrared Ks-band flux density could in principle be provided\nthrough bremsstrahlung emission from a cooler denser phase\nembedded in the hot accretion flow or in the outer parts of a\npotential accretion disk. In luminous AGN a cool optically thick\ndisk with T∼105 K is believed to coexist with a hot optically thin\ncorona with T∼109 K. At the lower SMBH mass and luminosity\nof SgrA* such material could have an even lower temperature.\nHowever, a lower limit to the temperature of such cool inclosure\nis given by the fact that no strong recombination line emission is\nobserved towards SgrA*. Only for temperatures above 106 K the\ncontribution to the total luminosity from thermal bremsstrahlung\nis greater than that from recombination radiation. This implies\n29 2 3\nfor 106 K a Ks-band luminosity of L( erg\ns ) ∼ 10 ne R . At a dis-\n\n\f10\n\nSabha, Witzel, Eckart et al.: The Extreme Luminosity States of SgrA*\n\nTable 4. Source component parameters for SSC models of the brightest X-ray flares from SgrA*.\nmodel\n\nγ1\n\nγ2\n\nlabel\n\nSmax,\n\nαsynch\n\nR0\n\nνmax\n\nB\n\nobs\n\nobs\n\n[Jy]\n\n[GHz]\n\n[G]\n\nS MIR,\n\nSNIR,\n\nSNIR,\n\nSNIR,\n\nsynch\n\nsynch\n\nsynch\n\nSSC\n\nSX−ray,\nSSC\n\n[mJy]\n@3.8μm\n±1.0\n15\n20\n18\n\n[mJy]\n@2.2μm\n±1.0\n8.0\n10\n10\n\n[mJy]\n@2.2μm\n±1.0\n0\n0\n0\n\n[μJy]\n@2-10 keV\n±20\n0.65\n2.6\n1.8\n\n360\n360\n360\n\n2900\n2900\n2900\n\n±0.1\n1.9\n3.2\n1.3\n\n±0.1\n1.19\n1.25\n1.05\n\n±0.1\n0.3\n0.3\n0.2\n\n±250\n1850\n1850\n1850\n\n±10\n18\n12\n11\n\n[mJy]\n@11.8μm\n±1.0\n59\n82\n58\n\n6\n6\n6\n\n1300\n1300\n1300\n\n2.8\n4.3\n3.3\n\n1.10\n0.98\n1.01\n\n0.3\n0.3\n0.3\n\n2190\n2190\n2190\n\n26\n18\n20\n\n133\n226\n219\n\n20\n26\n17\n\n0.0\n0.0\n0\n\n11\n15\n10\n\n0.65\n2.6\n1.8\n\nξ\n\n360\n\n2900\n\n11.5\n\n1.40\n\n20.5\n\n480\n\n6\n\n0\n\n0\n\n0\n\n0\n\n<0.04\n\nAlow\nBlow\nQspot\n\n360\n6\n70\n\n2900\n1300\n2050\n\n0.5\n0.8\n0.08\n\n1.10\n1.30\n1.30\n\n0.1\n0.2\n0.1\n\n2360\n1230\n1080\n\n51\n15\n44\n\n23\n15\n0.58\n\n6.7\n3.6\n0.18\n\n3.7\n0\n0.1\n\n0\n3.7\n<0.01\n\n0.038\n0.037\n<0.010\n\n1σ→\nAα\nAβ\nAγ\nBα\nBβ\nBγ\n\nTable 5. Model densities, lower SSC cutoff frequencies and lower limits on the source component masses\n\nAα\nAβ\nAγ\n\nN0\nerg cm−3\n0.25\n0.22\n14\n\nc(γ12 νmax,obs )−1\nnm\n1.3\n1.3\n1.3\n\nρ\ncm−3\n3×107\n6×107\n2×108\n\nmass\nM⊙\n3×10−16\n5×10−16\n5×10−16\n\nBα\nBβ\nBγ\n\n0.74\n13\n7\n\n4100\n4100\n4100\n\n2×1011\n3×1011\n2×1011\n\n2×10−12\n3×10−12\n2×10−12\n\nξ\n\n4×10−4\n\n4.8\n\n1×106\n\n3×10−12\n\nAlow\nBlow\nQspot\n\n0.39\n0.013\n7×10−4\n\n1.0\n7300\n56\n\n1×107\n3×1011\n3×107\n\n3×10−18\n8×10−13\n9×10−18\n\nmodel\n\n−1\n\ntance of ∼8 kpc and a wavelength of 2.2μm 1 mJy of dereddened flux density corresponds to a luminostity of νLν =1.2×1034\nergs/s=3.1 L⊙ .\nIn order to obtain 1 mJy Ks-band flux density the product n2e R3 needs to be on the order of 8×104 . This allows us to\nestimate the required densities: The Ks-band diffraction limit\nof the VLT UT4 corresponds to a projected linear size of\n2.4×10−3pc∼8000 RS at the distance of SgrA*. Similarly, 1 RS\ncorresponds to 3×10−7 pc.\n\n4.4. Synchrotron Self-Compton emission from SgrA*\n\nRapid variability on time scales of a few minutes and the strong\nindication of synchronous (polarized) NIR and X-ray flux density variations linked with time delayed sub-mm/mm flux excursions clearly suggests that a nonthermal emission mechanism\nis at work. Synchrotron emission from compact source components that unavoidably scatter electromagnetic power into the Xray domain appear to be a prime choice for such a mechanism.\nBelow we investigate the highest and lowest luminosity states to\nvalidate the applicability of the SSC mechanism.\n4.4.1. Essentials of current SgrA* SED modeling\n\nFor such an unresolved or even more compact source with\nsizes ranging from 1 to 8000 RS we find electron densities\nfrom 2×1012 cm−3 to 2×106cm−3 and Thompson scattering optical depths on the order of 1 to 0.01, respectively. This implies\nthat for an 'unresolved' bremsstrahlung emitting Ks-band source\nthe electron density is several orders of magnitude higher than\nthe estimated density of 107 cm−3 of hotter gas in the accretion\nflow (Yuan et al. 2003). Combined with the high optical depths\nthis shows that a substantial bremsstrahlung contribution of a\ncompact source to the Ks-band flux density even in the quiescent phase can therefore be regarded to be very unlikely (see\nalso Yuan et al. 2003).\n\nGenerally the electron energy distribution N(E) responsible for\nthe overall SED of SgrA* is described by a power-law N(E) =\nN0 E −p = N0 (mc2 γ)−p with a Lorentz factor γ and an electron\npower-law index p. This power-law exhibits several breaks at\nγmin < γcool < γmax ,\n\n(8)\n\nwhere γmin , γmax and γcool are the minimum, maximum, and\nthe 'cooling break' Lorentz factors, respectively (Yuan et al.\n2003, Quataert 2002, Mahadevan & Quataert 1997). Here γcool\nmarks the difference between the emission of a thermal distribution of electrons with γmin,thermal =γmin and γmax,thermal ∼γcool and\n\n\fSabha, Witzel, Eckart et al.: The Extreme Luminosity States of SgrA*\n\nthe synchrotron emitting, relativistic electron distribution with\nγmin,synch ∼γcool and γmax,synch =γmax . The spectral number density\nN synch\nratio of both distributions is assumed to be Nthermal\n∼ 1...5% (e.g.\nYuan et al. 2003). For values at and below γcool the heating of\nthe thermal electrons through synchrotron self-absorption is important. For values above γcool a more efficient cooling through\nsynchrotron radiation is important.\nA further usually higher frequency break occurs due to a\nmodification of the underlying relativistic electron distribution\nas a consequence of synchrotron cooling losses (Özel, Psaltis\n& Narayan 2000, Kardashev 1962). For an electron power-law\nindex p and for Lorentz factors larger than γmin the resulting optically thin electromagnetic spectrum will follow a power-law\ndistribution with a spectral index α = (p − 1)/2. In the case of no\nfurther injection of fresh electrons with the powerlaw index p the\nspectrum will steepen at the frequency νbreak towards a spectral\nindex of (2p −1)/3. If fresh electron injection occurs the spectral\nindex will only steepen towards p/2 and is therefore closer to the\noriginal index of α = (p − 1)/2.\nAt this frequency νbreak the synchrotron cooling time equals\nthe time within which the relativistic electrons can escape the\nsource. In the case of SgrA* and at about 3.5 R s (approximate\nradius of the last stable orbit) it can be written as\nνbreak ∼ 2.6\n\nB\n1014 Hz\n30 G\n\n(9)\n\n(Kardashev 1962, Özel, Psaltis & Narayan 2000, Yuan et al.\n2003, Dodds-Eden et al. 2009). The frequency νbreak is relevant\nif photons are emitted above that frequency, i.e.\nνmax = 2.8 × 106 Bγ2 ≥ νbreak\n\n(10)\n\n(e.g. Marscher 1983). For B>30G and γmax ≥ 1400 both νbreak\nand νmax lie just shortward of the NIR domain. Here the values\nfor B and γmax result from model calculations that allow us to describe the NIR and X-ray flare emission in the framework of an\nSSC model. At frequencies above νmax the inverse self-Compton\nemission dominates the overall spectrum.\nIn most cases modeling of the overall SED of SgrA* assumes\nthat the synchrotron quiescent emission (see Fig.1 in Yuan et al.\n2003) is dominated by the relativistic tail of the otherwise thermal Boltzmann distribution that describes the quiescent (bulk)\nof the radio to sub-mm/FIR spectrum. Flares are then attributed\nto a variation in the distribution of this relativistic part of the\naccretion flow. In addition the bulk of the quiescent X-ray spectrum is explained by thermal bremsstrahlung due to the extended\nX-ray bright Bondi sphere surrounding SgrA* (Baganoff et al.\n2001, 2003, Liu et al. 2006, Yuan et al. 2003, Quataert 2002,\nMahadevan & Quataert 1997).\nHere we consider the following additional points: the flare\nspectrum of SgrA* can be explained independently of the steady,\nquiescent emission from the accretion flow. We consider 'fresh'\nsynchrotron components that become optically thick at THz frequencies and inverse Compton scatter into the X-ray domain.\nWe also investigate synchrotron, bremsstrahlung, and thermal\nemission from the foot point of the accretion flow or a temporary disk as possible significant contributors for the unresolved\nsource components seen in the NIR during the low luminosity\nstates of SgrA*.\n4.4.2. Description and properties of the SSC model\n\nWe have employed a simple SSC model to describe the observed\nradio to X-ray properties of SgrA* with the nomenclature given\n\n11\n\nby Gould (1979) and Marscher (1983). Inverse Compton scattering models provide an explanation for both the compact NIR\nand X-ray emission by up-scattering sub-mm-wavelength photons into these spectral domains. These models are considered\nas a possibility in most of the recent modeling approaches and\nmay provide important insights into some fundamental physical properties of the source. The models do not explain the entire low frequency radio spectrum and the bremsstrahlung X-ray\nemission that dominates the luminosity between X-ray flares.\nThey do successfully account for the flare events observed in recent radio to X-ray campaigns though (Eckart et al. 2003, 2004,\n2006ab, 2008ab, 2009, Yusef-Zadeh et al. 2006ab, 2007, 2008,\nMarrone et al. 2009).\nWe assume a synchrotron source of an angular extent θ. The\nsource size can be as big as a few Schwarzschild radii. The\nemitting source is assumed to become optically thick at a frequency νm with a flux density S m and has an optically thin spectral index α following the law S ν ∝ν−α . This allows us to calculate the magnetic field strength B and the inverse Compton\nscattered flux density S S S C as a function of the X-ray photon energy EkeV . The synchrotron self-Compton spectrum has the same\nspectral index as the synchrotron spectrum that is up-scattered\ni.e., S S S C ∝EkeV −α , and is valid within the limits Emin and Emax\ncorresponding to the wavelengths λmax and λmin (see Marscher\net al. 1983 for further details).\nThe emitting electrons follow a power-law distribution\nN(E) = N0 E −(2α+1) with energies γ1 mc2 < E < γ2 mc2 . Here γ1\nand γ2 are the electron Lorenz factors. Maximum Lorentz factors for the emitting electrons of the order of typically 103 are\nrequired to produce a sufficient SSC flux in the observed X-ray\ndomain.\nA possible relativistic bulk motion of the emitting source results in a Doppler boosting factor δ=Γ−1 (1-βcosφ)−1. Here φ is\nthe angle of the velocity vector to the line of sight, β the velocity\nv in units of the speed of light c, and Γ=(1-β2 )−1/2 Lorentz factor for the bulk motion. Relativistic bulk motion is not needed\nto produce sufficient SSC flux density, but we have used modest values for Γ=1.2-2 and δ ranging between 1.3 and 2.0 (i.e.\nangles φ between 10◦ and 45◦ ) since they will occur in cases of\nrelativistically orbiting gas as well as relativistic outflows - both\nof which are likely to be relevant to SgrA*.\nThe electron spectral number density in units of cm−3 keV −1\nis given by\nN0 = κ(α, d)θ−(4α+7) ν−(4α+5)\nS m2α+3 δ−(2α+4) .\nm\n\n(11)\n\nHere Sm and and νm are given in units of Janskys and GHz, respectively. For κ(α, d) see Marscher (1983). With E = γmc2 this\nresults in a total number density in cm−3 of electrons that participate in the SSC emission process of\nZ γ2\n(mc2 )−2α −2α\nρ = mc2 N0\nN(γ)dγ = N0\n(γ1 − γ2−2α ) .\n(12)\n2α\nγ1\nThis quantity can be used to validate the emission mechanism\nin comparison to other number density estimates obtained for\ndifferent source regions.\nThe radio polarization data of SgrA* (Bower et al. 2004,\nMarrone et al. 2007) indicate that of the total available stellar\nmass loss of 10−3 M⊙ yr−1 only a small fraction of 10−7 M⊙ yr−1\nis close to the central black hole and available for accretion. This\napplies a mean daily accretion of 3×10−10M⊙ . Assuming a flare\nlasts for 100 minutes this corresponds to an accretion mass load\nof typically 2×10−11 M⊙ per flare. The SSC models in Table 5\nresult in estimates that lie one to five orders of magnitude below\n\n\f12\n\nSabha, Witzel, Eckart et al.: The Extreme Luminosity States of SgrA*\n\nthis upper mass limit per flare. Here models Aα to Aγ, in which\nthe NIR fluxes are produced via optically thin synchrotron radiation, are favored since the required masses lie well below the\navailable accretion mass load (as it is for the quiescent models).\n4.4.3. SSC model of the bright flares of SgrA*\n\nFor X-ray flares of up to several times the quiescent emission\nthe SSC models with source components that become optically\nthick in the few THz domain provide a successful description\nof the compact flare emission that originates from the immediate vicinity of the central black hole (e.g. Eckart et al. 2009 and\nreferences therein, Marrone et al. 2009; see also Fig 10). This description also allows the explanation of the correlation between\nNIR/X-ray flares and time delayed radio flares (e.g. Eckart et al.\n2008ab, 2009, Yusef-Zadeh et al. 2008, Marrone et al. 2009). In\norder to validate the applicability of this emission mechanism\nit is useful to study the bright flare emission associated with\nSgrA*.\nIn Table 1 we list important properties of the three brightest\nX-ray flares that have been observed to date (Baganoff et al.\n2001, Porquet et al. 2003, 2008). The NIR flare emission\nshows observed spectral indices of α∼0.6 (Ghez et al. 2005ab,\nHornstein et al. 2006) or even steeper (Eisenhauer et al. 2005,\nGillessen et al. 2006). If the X-ray flare flux density is due to\nthe SSC spectrum of the synchrotron component that gives rise\nto emission in the NIR then the spectral indices should be the\nsame. While a spectral index of ∼0.6 is consistent with the\nChandra value, the XMM flares require a steeper spectral index.\nThe spectral index averaged over several flares observed with\nChandra results in α=Γ-1=0.3±0.5 (Baganoff et al. 2001). This\nis consistent with both the XMM data and the index of α∼0.6\nreported by Ghez et al. (2005ab) and Hornstein et al. (2006).\nGeneral modeling results: Our modeling results show that\nsynchrotron flare components that become optically thick in the\nfew THz domain stay optically thin throughout the MIR/NIR\ndomain, and self-Compton scatter into the X-ray domain can\nfully account for the observed properties of the brightest flares\nfrom SgrA*. We use maximum electron Lorenz factors γ2 ∼103\nresulting in the fact that the X-ray emission is always inverse\nself-Compton scattered. This delivers synchrotron radiation\nup to near-infrared wavelengths and results in the fact that\nthe X-ray emission is always inverse self-Compton scattered.\nSource component parameters for SSC models of the brightest\nX-ray flares from SgrA* are given in Tables 4 and 5.\nHere model labels (col. 1) α, β and γ indicate the bright flares\nlisted in Table 1. Model labels A and B indicate models in which\nthe the MIR/NIR flux densities are accounted for in different\nways. In particular in models Aα-γ the observed peak MIR/NIR\nflux densities are accounted for by the high frequency end of the\nsynchrotron spectrum. In models Bα-γ they are accounted for\nby the low frequency end of the inverse self-Compton scattered\nspectrum. Among themselves the A models (straight red line in\nFig.11) and the B models (black long dashed line in Fig.11) look\nvery similar for the different flares labeled with α, β and γ in\nFig.1. Within the uncertainties infrared and X-ray flux densities as well as the X-ray spectral indices are met by the required\nmodel spectral indices. As an example (and since it this model is\ndiscussed in more detail) we show the synchrotron flare spectra\nand the corresponding SSC spectra in Fig.11 for the models Aα\nand Bα.\nA global variation of a single parameter by the value listed in\nthe first row and the corresponding column of Table 4 results in\n\nan increase of ∆χ = 1. Here global variation means: adding the\n1σ uncertainty for a single model parameter but for all source\ncomponents in a way that a maximum positive or negative flux\ndensity deviation is reached. Models with significantly different\ncomponent fluxes, sizes, and cut-off frequencies fail to match\nthe observed fluxes by more than 30%. A more detailed description of the modeling procedure is given in Eckart et al. (2009).\nModels Alow and Blow give the source component for a single\nand multiple spot (multiples of the dominant spot described by\nmodel Q spot ) quiescent state model.\nThere are two approaches to model the NIR/X-ray spectra:\n1) The observed peak MIR/NIR flux densities can be accounted\nfor either by the high frequency end and of the synchrotron\nspectrum (models Aα-γ, in Tables 4 and 5) or 2) by the low\nfrequency end of the inverse self-Compton scattered spectrum (models Bα-γ). Here the upper cutoff frequency of the\nscatter spectrum γ12 νmax,obs has a special importance. With\nνmax,obs ∼ 2.2 T Hz and γ1 ∼ 6 we find that this cutoff lies in\nthe few micrometer MIR/NIR domain. With γ1 ∼ 1300 it lies\nat about 1keV just below the lower energy cutoff of the X-ray\nChandra and XMM observatories. In general the models Aα\nto Aγ are constrained by the synchrotron spectral index α synch\ndefined by the THz and NIR/MIR flux densities. Models Bα-γ\nare constrained by the SSC spectral index (that equals α synch )\ndefined by the NIR/MIR, the X-ray flux densities and spectral\nindex. Therefore α synch cannot be steeper than about unity in\nthese SSC models.\nPossible peculiarities in the relativistic electron spectrum:\nA modification in the upper cutoff of the relativistic electron\nspectrum (e.g. Lorentz factor γ2 ) may also have a strong\ninfluence on the X-ray output of the emitting source component.\nAn increase in γ2 may reflect a more efficient acceleration\nmechanism. Synchrotron losses will lead to a decrease in γ2\nor to the involvement of a cooling break. The width of the\nrelativistic electron distribution for flare models Aα to Aγ is\nnarrower than that of models Bα to Bγ or even models which\nexplain additionally the low frequency radio part of the SgrA*\nSED (Yuan et al. 2003, Quataert 2002, Mahadevan & Quataert\n1997). Kardashev (1962) points out that the higher frequency\nsynchrotron cooling break does not become displaced towards\nlower frequencies with time if the energy distribution of the\ninjected relativistic electron spectrum has a very small width.\nA narrow relativistic electron spectrum may therefore support\na less variable cooling break frequency during the main part of\nthe flare.\nFor models A the lower energy cutoff γ1 lies above the\ntypical values for γcool at which efficient cooling through\nsynchrotron radiation sets in. This suggests that the electron\nspectra responsible for the brightest SgrA* flares may have\na different origin from those in the lower energy Boltzmann\ndistribution which explain the radio spectrum.\nThe April 4, 2007, flare: The flare event of April 4, 2007\n(see Table 1), has also been simultaneously observed at the\n11.8μm and 3.8μm wavelength. Dodds-Eden et al. (2009)\ndiscuss several emission mechanisms. They rejected a pure\ninverse Compton model because of too high magnetic fields and\na pure power-law model due to a mismatch of the MIR/NIR\nflux densities and spectral index information. They strongly\ndisfavor their SSC model in which the flare component becomes\noptically thick in the NIR with an exceptionally high magnetic\nfield strength (see the comment in Sect. 4.1.3 of Eckart et al.\n2009). Their favorite model for the flare consists of a power-law\n\n\fSabha, Witzel, Eckart et al.: The Extreme Luminosity States of SgrA*\n\n13\n\n2.0\n2\n\nνcool\n\nν2\n\nγ 21 νm,obs\n\ncount rate in μJy\n\nlog[ νL ν(erg s−1)]\n\nSgrA*\nXMM\n2−10 keV\n\n1.0\n1\n\n0.0\n0\n\nlog[ ν(Hz)]\n\n5\n\n6\n\n5\n30\n\nflux density in mJy\n\nApril 4 2007, flare data (see Table 1, Tables 4 and 5).\n\n30\n\nVLT\n3.8 μm\n20\n\n20\n\n10\n\n10\n\n0\n\n0\n5\n\n6\n\n5\n\n7\n\n6\n\n7\n\nUT in hours\n1.6\n\n1.6\n\nflux density in mJy\n\nThe SSC model that we present here for the the April 4,\n2007, flare is not covered by Dodds-Eden et al. (2009). Here we\ncover it in more detail and take it as an example for the bright\nluminosity state of SgrA*. The results may be used to explain\nthe properties of mm/sub-mm flux density variations that have\nbeen observed in several other cases (e.g. Eckart et al. 2008ab,\n2009, Yusef-Zadeh et al. 2008, Marrone et al. 2009).\nFor the April 4, 2007 flare event our SSC model Aγ agrees\nwith the simultaneous 3.8μm flux density, the 3σ flux limit at\n11.8μm and also the spectral index in the X-ray domain corrected for hydrogen absorption. A spectral decomposition is\ngiven in Fig. 11 and a comparison of the light curves with model\nAγ and ξ (see below) is displayed in Fig. 12. For the favored\nmodel A in Fig. 11 the relevant cutoff frequencies are labeled and\nmarked with a vertical thin solid line. For model B these frequencies are all close to 7×1013 Hz. The model data are compared to\nthe SED of SgrA* in its quiet state. The radio to sub-mm measurements (Markoff et al. 2001; Zhao et al. 2003) are time averaged measurements, and the error bars include variable emission\nof up to 50%. As open black circles we show 30μm, 24.5μm and\n8.6μm upper limits taken from Melia & Falcke (2001). The Xray information is taken from Porquet et al. (2008). The short\ndashed line shows the quiescent model by Yuan et al. (2003).\nWith a magnetic field of 10 G the optically thin synchrotron\nspectrum extends up to νbreak =c (3.4μm)−1 with a spectral index\nof α synch =1.05. Above this the spectrum steepens until the upper synchrotron cutoff νmax =c (0.85μm)−1. For a spectral index\nof unity, i.e. p∼3, and with the assumption of a fresh injection\n\n7\n\nUT in hours\n\nFig. 11. Two SSC models A (red) and B (black dashed) describing the\n\nspectrum in combination with a cooling break in the NIR/optical\nwavelength domain. They do not discuss the unavoidable selfCompton contribution to the emission that must originate from\nthe bulk of the photons at the self-absorption turnover scattered\nby the relativistic electrons. The lower cut-off frequency of\nthis power-law solution remains unspecified as well. Previous\nstrong X-ray or NIR flare events have been shown to be linked\nto delayed radio flares (Eckart et al. 2006a, 2008b, 2009,\nYusef-Zadeh et al. 2007, 2008, 2009, Marrone et al. 2009). So\nthe relation of the power-law flare solution to the mm/radio\nregime remains unclear.\n\n7\n\n6\n\nIRAM\n240GHz\n1.4\n\n1.4\n\nVLA\n43GHz\n\n1.2\n\n1.2\n\n5\n\n5\n\n10\n\n10\n\nUT in hours\n\n15\n\n15\n\nFig. 12. A combined SSC and adiabatic expansion model compared\nto the SgrA* flare event on April 4, 2007. The data are described in\nPorquet et al. (2003), Dodds-Eden et al. (2009), Yusef-Zadeh et al.\n(2009). The 240 GHz and 43 GHz response of the NIR/X-ray flare is\nplotted as a solid and dashed red line, respecitvely. The probably unrelated 43 GHz response of the flare component ξ with the parameters\nlisted in Table 4 is plotted as a solid magenta line.\n\n\f14\n\nSabha, Witzel, Eckart et al.: The Extreme Luminosity States of SgrA*\n\nof relativistic electroms the spectrum will steepen to a value of\np/2∼1.5. This value fully agrees with the spectral index between\nthe infrared H- and Ks-band of αHK =1.4±0.2 which was used as\nan additional fitting criterion by Dodds-Eden et al. (2009).\nThe model can be further validated by comparing the involved electron spectral number density with values inferred\nfrom other data or different models. The value of 14cm−3 keV −1\nof the electron spectral number density results in number densities for the relativistic electrons of 2×108 cm−3 . Part of the emitting particles may be due to electron/positron pairs. Integrating\nover the SSC source component volume of 0.2 R0 diameter\nwe obtain 5×10−16 M⊙ as a lower limit to the total mass of\nthis source component within a compact jet base that feeds an\nextended overall jet or outflow with a low surface brightness\n(Falcke & Markoff 2000, 2001, Markoff 2005, Markoff et al.\n2007). If a structure of the size and density described above expands at highly relativistic velocities, it can reach the flow density of 107 cm−3 (Yuan et al. 2003). This can happen on an orbital\ntime scale of a spot which is close to the last stable orbit and on\nless than one flare time scale (see Fig. 10).\nFor the SSC model Bγ explains the NIR flux densities\nshortward of about 4μm through the self-Compton scattered\nspectrum the electron spectral number density and source\ncomponent mass. This mass is four orders of magnitudes higher\nthan for model Aγ. Reaching the flow density of 107 cm−3 in one\nflare time scale and matching the total estimated accretion rate\nonto SgrA* is possible as well. Still, the predicted 11.8μm flux\ndensity is well above the upper limit obtained for the April 4,\n2007 flare. Therefore models in which the Ks- and L-band flux\ndensities are produced via the self-Compton scattered spectrum\nare not favored.\nModeling the April 4, 2007 NIR/X-ray light curves: DoddsEden et al. (2009) report that the width of the X-ray flare is\nsignificantly smaller than the on of the corresponding overall\nL-band flare. This implies that the efficiency of producing\nX-ray emission was lower before and after the main part of the\nflare. In the framework of the evolving spot model presented\nin Eckart et al. (2008a) this may be explained by an evolution\nof the spot characteristics similar to the models presented by\nHawley & Balbus (1991, 1998) and Yuan et al. (2008). The\nrecent theoretical approach of hot spot evolution due to shearing\nis highlighted in Eckart et al. (2008a) and Zamaninasab et al.\n(2008, 2009; see also Pecháček et al., 2008). Yuan et al. (2008)\nexplicitly solved the relativistic hydrodynamics and found initial\nexpansion velocities of less than 0.01c close to the accretion\ndisk followed by relativistic expansion towards the end of the\nflare. A compression of a single spot or merging of two spots\ndue to differential rotation within a viscous disk may explain the\ndifferent widths of the flares in the X-ray and L-band light curve.\nA variation of the source size θ or the peak flux density S ν of\nthe scattered synchrotron component by only 20% to 30% will\nresult in the required significant increase or decrease in the SSC\nscattering efficiency, i.e. the scattered SSC X-ray flux density\nS S S C,X−ray ∝S m2(α+2) θ−2(2α+3) . Similarly other differences between\nthe NIR and X-ray light curves may be due to different or even\nvarying flux density contributions and scattering efficiencies\nfrom a source component responsible for an underlying main\nflare and components responsible for the sub-structures.\nModeling the April 4, 2007 radio light curves: Yusef-Zadeh\net al. (2009) report radio measurements that were carried\nout at 240 GHz (30m IRAM) during and at 43 GHz (VLA)\nfollowing the April four NIR/X-ray flare. The 240 GHz data\n\ncover the entire NIR/X-ray flare event at a flux density level of\nabout 1.2 Jy with no significant flux density variation. After a\n('transatlantic') gap in the data a strong increase and decrease of\nthe 43 GHz flux density with a peak of about 0.4 Jy is detected.\nThe entire 43 GHz flare has a full bottom width (at a level of\nabout 1.1 Jy) of about 4 hours and peaks at 43 GHz about 6.5\nhours past the NIR/X-ray peak.\nPerforming an adiabatic expansion calculation (van der\nLaan, 1966) based on models Aγ and Bγ using an expansion\nspeed of 0.007c places the 43 GHz afterglow of the NIR/X-ray\nflare close to or even into the gap between the 100 GHz and\n43 GHz measurements. We use 0.007c as a typical value close\nto the expansion speeds found for other SgrA* flare events for\nwhich adiabatic expansion models have been applied (see e.g.\nEckart et al. 2008b, 2009, Yusef-Zadeh et al. 2008). As an example of such a calculation we show in Fig. 11 a combined SSC\nand adiabatic expansion model based on the data for Aγ given in\nTable 4. Here we assume that the 240 GHz and 43 GHz flux density level above which we have to consider the excess flare flux\nis at 1.08 Jy - which is at the minimum flux density level given\nby the data for this event. The predicted 240 GHz and 43 GHz\npeak brightnesses lie well within the noise of the IRAM measurements and the following 43 GHz data.\nA lower expansion velocity like 0.002c gives the time delay needed to meet the bight 43 GHz flare peaking at about\n12:30 UT but still fails to reproduce its high radio flux. Since\nmeasurements around this time have not given any hint for a\npossible NIR or X-ray counterpart for this event, it can only be\nexplained by a low frequency flare that originated from a synchrotron component with low turnover frequency and no significant predicted NIR or X-ray flux density (like component ξ given\nin Table 4). We therefore regard component ξ as unrelated to the\nmain NIR/X-ray flare which happened six hour earlier.\nThe SSC models listed in Table 4 have small source component sizes to provide a sufficient inverse Compton scattering efficiency to explain the large observed X-ray flux densities. This\nresults in comparatively narrow light curves of the individual\ncomponents and requires the observed broader flare profile to be\nmodeled with six source components. This may explain the presence of substructure in the NIR and X-ray light curves. We place\nthe components 1 through 6 at 5:24, 5:37, 5:51, 6:00, 6:15, and\n6:21 UT with the flux ratios between them of 0.6:1:1:0.8:0.5:0.4.\nWe also allowed components 1, 5, and 6 to be larger by ∼ 20%\ncompared to the central components. An increase in size or a decrease in flux density lowers the scattering efficiency (see above)\nin a way that the weaker components 1, 5, and 6 do not contribute significantly to the X-ray flare. With a spectral index of\n1.05 and the dependency in scattering efficiency given above this\nresults in an X-ray flux density ratio between the components of\n0.01:1:1:0.3:0.003:0.001. This may explain the different widths\nof the flares in X-ray and L-band light curve and allows us to\nmodel the broader NIR flare profile.\nModel Bγ in Table 4 is not well suited to explain the wings of\nthe NIR light curve in comparison to the X-ray flare profile since\nthe flux densities in both wavelength domains are described by\nthe same SSC scattered spectrum. Involving steeper SSC spectra\nfor the wings violates the 11.8μm flux density limit. Therefore\nthe 4 April, 2007, flare event provides additional support for the\nassumption that - at least in this case - the NIR luminosity is due\nto optically thin synchrotron emission rather than SSC scattered\nflux.\n\n\fSabha, Witzel, Eckart et al.: The Extreme Luminosity States of SgrA*\n\n15\n\n4.4.4. SSC modeling of a weak X-ray flare\n\nSgrA*\nlog[ νL ν(erg s−1)]\n\nIn Tables 4 and 5 we also list modeling results for the so far\nweakest statistically significant X-ray flare that was modeled\n(Eckart et al. 2002). This flare was also the first that was detected simultaneously in both the NIR and X-ray domain. The\nSSC model Alow which explains the NIR flux densities through\nthe high frequency end of the associated synchrotron spectrum\ndescribes the flare successfully.\nSSC models (B in Tables 4 and 5) that explain the NIR\nfluxes through the inverse Compton scattered part of the spectrum are strongly constrained by the NIR/X-ray spectral index\ndetermined by α synch ∼ 1.0. While they do not result in a satisfactory fit of the observed data for the very bright X-ray flares\n(see Sect. 4.4.3), the situation for weak X-ray flares is different.\nHere α synch ∼1.3 and the corresponding electron spectral number\ndensity and source component masses are of the same order as\nfor the SSC models Aα − γ. Therefore both model approaches,\nAlow and Blow , result in acceptable explanations for the NIR and\nX-ray fluxes and the spectral indices during weak flares.\n\nν\n\ncool\n\nν2\n\n2\n\nγ νm\n1\n\nlog[ ν(Hz)]\nFig. 13. A single spot SSC quiescent spectrum (black dashed) and a\ncorresponding multi-spot SSC quiescent spectrum.\n\n4.4.5. SSC modeling of the lowest states of SgrA*\n\nEckart et al. (2006) have modeled the emission from SgrA* in its\nlow flux density state. They find that the upper limits of the compact X-ray emission in the 'interim-quiescent' (IQ), low-level\nluminosity states of SgrA* are consistent with a SSC model that\nallows for substantial contributions from both the SSC and the\nsynchrotron part of the modeled spectrum. In these models the\nX-ray emission of the point source is well below 20−30 nJy and\ncontributes considerably less than half of the X-ray flux density\nduring the weak flare event reported by Eckart et al. (2004). The\nflux densities at a wavelength of 2.2μm are of the order of 1 to\n3 mJy (see Table 2 and Figs. 8 and 9). Eckart et al. (2006) list\nrepresentative SSC models for the low flux state. For their models IQ1-IQ3 the source component has a size on the order of\n0.2 to 2 Schwarzschild radii with an optically thin radio/sub-mm\nspectral index ranging from α∼1.0 to 1.3, a value similar to the\nobserved spectral index between the NIR and X-ray domain.\nIn Tables 4 and 5 we give the detailed model data for a single spot in which the MIR/NIR flux densities are accounted for\nby the high frequency end of the synchrotron spectrum (Alow )\nor by the low frequency end of the inverse self-Compton scattered spectrum (Blow ). These models account for the quiescent\nsource spectrum given by Yuan et al. (2003), as shown in Fig. 13.\nFor model Blow the electron spectral number density value and\ntotal masses integrated over the SSC source component volume are large for a quiescent state compared to the flaring state\n(∼3×1011cm−3 and 8×10−13 M⊙ ) and to the assumed accretion\nflow density of 107 cm−3 . Therefore model Alow is favored.\nAs an alternative to a larger continuous disk component one\nmay assume a continuous disk or a disk consisting of several\nspots with dominant source components that contribute only\nabout 0.1 mJy (model Q spot ) to the Ks-band flux density each\nand have electron spectral number densities on the order of\n∼107 cm−3 and total masses integrated over small SSC source\ncomponent sizes of 0.1 R s with a diameter of a few times\n10−19 M⊙ . Here the magnetic field strengths are comparable to\nthose of the larger flare components, and the densities are comparable to the assumed accretion flow density of 107 cm−3 . In\nFig. 13 - as an example - 20 spots as described by model Q spot in\nTables 4 and 5 produce a significant part of the quiescent spectrum of SgrA* in the Ks-band, as one would expect for a low\n\nlevel quiescent state of SgrA*. The 20 spots we used in Fig. 13\nhave different relativistic boosting factors as they would occur\non an inclined circular orbit of a few Schwarzschild radii around\nthe SgrA* SMBH (see Tables 4 and 5, and data in Eckart et\nal. 2004). In Fig. 13 relevant cutoff frequencies are labeled and\nmarked with a vertical thin solid line. The quiescent X-ray information is taken from Baganoff et al. (2001, 2003). The short\ndashed line shows the quiescent model by Yuan et al. (2003). The\ndouble-dot-dashed line shows the contribution of the relativistic\nelectrons to this quiescent model.\nTherefore both a larger continuous synchrotron emitting disk\nor a faint disk spotted with SSC components are attractive models that may explain a possible low state of SgrA*. Any quiescent\nstate flux density (e.g. measured in the NIR) would then be expected to be variable and polarized. High angular resolution and\nsensitivity - as it will be provided by the future large telescopes\n(ELTs) - are required to measure the quiescent state flux density\ncontribution with sufficient precision.\n4.5. Thin disk NIR luminosity\n\nAs another way to explain the Ks-band flux density especially\nin an assumed quiescent state of SgrA*, we explore the possible\npresence of a small permanent disk that radiates as a black body.\nEckart et al. (2006) show that at least for the flaring state of\nSgrA* a disk may exist. For an optically thick disk seen at an\ninclination angle i and radiating like a black body one finds a\nluminosity of\nLν = 2.4 × 10−18 R2S cos(i)T 8/3 ν1/3 (erg/s)\n\n(13)\n\n(Peterson 1997, see also Ishibashi & Courvoisier 2009,\nKishimoto et al. 2008). At infrared wavelengths and shorter the\nspectrum is dominated by the emission of the inner disk radii.\nIn the NIR Ks-band 1 mJy corresponds to 3 L⊙ . For cos(i)∼1,\na Schwarzschild radius of RS =1012 cm, and an observing frequency of 136.364 THz for a wavelength of 2.2μm we obtain\nLν = 1.235 × 1011 T 8/3 (erg/s). So a minimum disk temperature\nof T = 2.6 × 108 K is required to obtain Lν = 1L⊙ . For higher\ntemperatures one needs to introduce a surface filling factor of\nless than unity to explain the Ks-band emission in this model.\n\n\f16\n\nSabha, Witzel, Eckart et al.: The Extreme Luminosity States of SgrA*\n\nHowever, one requires a high number density to have an optically thick disk. In addition the ν1/3 dependency is in contradiction with the steep infrared spectra that have also been observed during flares (Ghez et al. 2005ab, Eisenhauer et al. 2005,\nGillessen et al. 2006, Hornstein et al. 2006, Krabbe et al. 2006).\nThese facts make a geometrically thin and optically thick disk a\nvery unlikely dominant contributer to explain a possible quiescent Ks-band luminosity of SgrA*.\n\n5. Summary and conclusion\nWe have discussed the variable infrared and X-ray emission of\nSgrA* in its extreme luminosity states. We reported on Ks-band\nimaging of the SMBH counter part of SgrA* in its low state\nand investigated the structure and brightness of the central Sstar cluster that surrounds the SMBH at the position of SgrA*.\nWe have used three independent methods to remove or strongly\nsuppress the flux density contributions of stars in the central 2\"\ndiameter region around SgrA*. All methods revealed faint extended emission around the SgrA* position. De-reddened with\nAK =2.8 the peak emission of the extended S-star cluster is about\n1.3 mJy within one resolution element, corresponding to a surface flux density of about 0.5 Jy (dereddened) per square arcsecond. For the dataset taken on 23 September 2004 no NIR counterpart of SgrA* was detected with a flux density limit of about\n2 mJy (dereddened). For 30 August 2004 we find a NIR counterpart of SgrA* with a dereddened flux density of about 4 mJy.\nWe find that the luminosity during the low state can most likely\nbe accounted for by synchrotron emission from a continuous or\nspotted accretion disk. In this case we expect the possible quiescent source associated with SgrA* to be significantly polarized.\nSteep spectral indices observed in the NIR wavelength domain may reflect the presence of typical cutoff frequencies. In\naddition to the cooling break νbreak as discussed in Sect. 4.4.1\nthere may be a cutoff in the relativistic electron spectrum at work\n(e.g. Eckart et al. 2006a, Liu et al. 2006). This will result in a\nmodulation of the intrinsically flat spectra with an exponential\ncutoff proportional to exp[−(λ0 /λ)0.5 ] (see e.g. Bregman 1985,\nand Bogdan & Schlickeiser 1985) and a cutoff wavelength λ0 in\nthe infrared. If λ0 lies in the 4-8μm wavelength range (Eckart et\nal. 2006a), the variation in the spectral index is on the order of\n∆α∼1.0. In a number of extragalactic jets these cutoffs have been\nobserved to be relevant in the NIR wavelength domain (3C 293:\nFloyd et al. 2006, M87: Perlman et al. 2001; Perlman & Wilson\n2005; 3C 273: Jester et al. 2001, 2005). In these sources the cutoff frequency at which synchrotron losses become dominant is\nν jet,break =4×1013 Hz (or 7.5μm wavelength), which is remarkably\nsimilar to what may be required in the case of the Galactic center\n(Eckart et al. 2006a). For SgrA* such a cutoff can quite naturally\nexplain the steep NIR spectral indices reported by (Eisenhauer\net al. 2005, Gillessen et al. 2006, Krabbe et al. 2006) despite the\nlow upper flux density limits in the MIR.\nFor the three brightest X-ray flares the SSC emission from\nTHz peaked source components can fully account for the observed flux density variations observed in the NIR and X-ray\ndomain. Here models in which the MIR/NIR flux density contributions are due to the high frequency tail of the associated\nsynchrotron spectrum are favored (models A in Tables 4 and 5).\nCombined with the source component size of 0.2-0.3 R0 and relativistic expansion within or towards the end of the flare, the\nspectral energy densities of relativistic electrons are compatible\nwith the electron number density derived for the accretion flow\nat 10 R s distance and the estimated upper limits of the mass accretion rate onto SgrA*. For the weak X-ray flare first discussed\n\nby Eckart et al. (2004) these boundary conditions are fulfilled\nfor both model approaches (A and B). For model Alow we expect significant polarization of the NIR flux density, whereas for\nmodel Blow the scattering process should lead to a significantly\nlower degree of polarization.\nFor the 4 April 2007 flare our favored model Aγ of the peak\nfluxes meets the 11.8μm 3σ limit and is only by 1σ off the expected flux density at 3.8μm wavelength. In the X-ray domain\nit matches the mean flux exactly and the spectral slope by 0.8σ.\nGiving these four quantities the same weight we obtain a reduced\nχ2red value of χ2red =10.7/d.o.f=3.7. The X-ray data cover a comparatively large and rather densely sampled spectral range. We\nget χ2red ≤2 if the X-ray information is weighted higher by a factor\nof two or more (see Porquet et al. 2008, Dodds-Eden et al. 2009).\nA χ2 -based comparison of different single component emission\nmodels over a large wavelength range (radio or infrared till Xray) is, however, only of limited value. More adequate physical\nmodels of the compact emission from SgrA* contain on some\nlevel contributions from several source components, like the hotspot/disk (Eckart et al. 2006b, Broderick & Loeb 2006) or multispot models (Eckart et al. 2008a , see also Pecháček et al., 2008),\nthe spiral arm models (Karas et al. 2007, Falanga et al. 2007), the\nmore elaborate evolving hot-spot model by (Yuan et al. 2008), or\nthe jet/jet-base models (Falcke & Markoff 2000, 2001, Markoff\n2005, Markoff et al. 2007). This implies that in addition to a possible dominant emission component, secondary source or spectral components will contribute to the flux and spectral index\ninformation in the different wavelength bands across the electromagnetic spectrum. This complicates the comparison of different models. Distinguishing between emission mechanisms requires more work on detailed flare modeling, using time dependent dense flux density sampling across a broad frequency band,\npreferentially including polarization and spatial information.\nHere we presented a new SSC model for the flare event on\nApril 4, 2007 that accounts for the available simultaneous peak\nflux density and spectral index information. Variations in the\nSSC scattering explain that the flare profile in the X-ray domain is narrower than that at NIR wavelengths. This suggests\nat least for this flare event that models in which the NIR flares\nare due to optically thin synchrotron radiation rather than inverse Compton scattered light are preferred. In general models\nin which the MIR/NIR flux densities are explained through the\nlow frequency tail of the inverse Compton scattered spectrum are\ndisfavored. They result in higher masses for the emitting sources.\nWe conclude that both weak and bright flares from SgrA*\ncan be explained by the synchrotron self-Compton mechanism.\nThis emission mechanism may explain the flare activity over up\nto two orders in magnitude in the NIR or X-ray flux density and\nover six orders of magnitude in frequency. No other dominant\nemission mechanisms are required. Densities of relativistic electrons of a few times 107 cm− 3 (comparable to what is derived\nfrom X-ray data on a 1000 Schwarzschild radii scale) are also\nrequired close to the SgrA* black hole to explain the flare emission.\nThe variable synchrotron emission may be limited at short\nwavelengths by a NIR cutoff (cooling break) due to synchrotron\nlosses. The self-Compton scattered spectrum may be limited at\nthe longest wavelengths by the low energy cutoff in the relativistic electron distribution. If future sub-mm and X-ray obervations allow for a simultaneous detection of the THz turnover\nfrequency (νm ) and a low energy cutoff of the SSC spectrum\n(νS S C,upper ), information on the low energy cutoff in the relativistic electron distribution can be obtained via γ1 2 ∼νS S C,upper ν−1\nm . In\na few years further polarimetric NIR observations at high angu-\n\n\fSabha, Witzel, Eckart et al.: The Extreme Luminosity States of SgrA*\n\nlar resolution and sensitivity will help to distinguish between the\nimportance of the different emission mechanisms in the low state\nof SgrA*. Interferometric observations in the near-infrared using\nGRAVITY at the VLTI (Eisenhauer et al. 2008, Straubmeier et\nal. 2008, Zamaninasab et al. 2009) and in the mm-wavelength\ndomain (e.g. Fish et al. 2009, Doeleman et al. 2009) will be important to understand the emission from SgrA*.\nAcknowledgements. N. Sabha is member of the Bonn Cologne Graduate School\nfor Physics and Astronomy. This work was supported in part by the Deutsche\nForschungsgemeinschaft (DFG) via grant SFB 494, the Max Planck Society\nthrough the International Max Planck Research School, as well as special funds\nthrough the University of Cologne. We are grateful to all members of the\nNAOS/CONICA and the ESO PARANAL team. Macarena Garcı́a-Marı́n is supported by the German federal department for education and research (BMBF)\nunder the project numbers 50OS0502 & 50OS0801. M. Zamaninasab and D.\nKunneriath are members of the International Max Planck Research School\n(IMPRS) for Astronomy and Astrophysics at the MPIfR and the Universities of\nBonn and Cologne. R. Schödel acknowledges support by the Ramón y Cajal programme by the Ministerio de Ciencia e Innovación of the government of Spain.\n\nAlexander, T.; Hopman, C., 2009, ApJ 697, 1861\nBondi, H., 1952, MNRAS 112, 195\nBaganoff, F.K., Bautz, M.W., Brandt, W.N., et al. 2001, Nature,\n413, 45\nBaganoff, F. K., et al., 2002, 201st AAS Meeting, #31.08;\nBulletin of the American Astronomical Society, Vol. 34,\n1153\nBaganoff, F. K., Maeda, Y., Morris, M., et al. 2003, ApJ 591, 891\nBahcall, J. N.; Wolf, R. A., 1976, ApJ 209, 214\nBélanger, G.; Terrier, R.; de Jager, O. C.; Goldwurm, A.; Melia,\nF., 2006, JPhCS 54, 420\nBlum, R. D.; Sellgren, K.; Depoy, D. L., 1996, ApJ 470, 864\nBogdan, T.J., & Schlickeiser, R., 1985, å, 143, 23\nBower, G. C., Falcke, H., Herrnstein, R. M., Zhao, J., Goss,\nW. M., & Backer, D. C. 2004, Science, 304, 704\nBregman, J.N., 1985, AJ, 288, 32\nBroderick, A.E., Loeb, A., 2006, MNRAS 367, 905\nBuchholz, R. M.; Schödel, R.; Eckart, A, 2009, A&A 499, 483\nCuadra, J.; Nayakshin, S., 2006, JPhCS 54, 436\nCuadra, J.; Nayakshin, S.; Martins, F., 2008, MNRAS 383, 458\nDiolaiti, E. Bendinelli, O., Bonaccini, D., Close, L., Currie, D.,\nParmeggiani, G., A&AS 147, 335-346, 2000\nDo, T.; Ghez, A.M.; Morris, M.R.; Yelda, S.; Meyer, L.; Lu, J.R.;\nHornstein, S.D.; Matthews, K., 2009a, ApJ 691, 1021.\nDo, T.; Ghez, A.M.; Morris, M.R.; Lu, J.R.; Matthews, K.;\nYelda, S.; Larkin, J., 2009b, 2009arXiv0908.0311D\nDoeleman, S.S.; Fish, V.L.; Broderick, A.E.; Loeb, A.; Rogers,\nA.E.E., 2009, ApJ 695, 59D\nDodds-Eden, K.; Porquet, D.; Trap, G.; Quataert, E.; Haubois,\nX.; Gillessen, S.; and 19 coauthors, 2009, ApJ 698, 676\nEckart, A.; Duhoux, P. R. M. 1990, ASPC, 14, 336\nEckart, A. & Genzel, R. 1996, Nature 383, 415\nEckart, A., Genzel, R., Ott, T. and Schödel, R. 2002, MNRAS,\n331, 917\nEckart, A.; Moultaka, J.; Viehmann, T.; Straubmeier, C.;\nMouawad, N.; Genzel, R.; Ott, T.; Schödel, R.; Baganoff, F.\nK.; Morris, M. R, 2003, ANS 324, 557\nEckart, A.; Baganoff, F. K.; Morris, M.; and 11 coauthors, 2004,\nA&A 427, 1\nEckart, A.; Baganoff, F. K.; Schödel, R.; Morris, M.; Genzel, R.;\nBower, G. C.; Marrone, D.; et al. 2006a, A&A 450, 535\nEckart, A.; Schödel, R.; Meyer, L.; Trippe, S.; Ott, T.; Genzel,\nR., 2006b, A&A 455, 1\n\n17\n\nEckart, A.; Baganoff, F. K.; Zamaninasab, M.; Morris, M. R.;\nSchödel, R.; and 16 coauthors, 2008a, A&A 479, 625\nEckart, A.; Schödel, R.; Garcia-Marin, M.; Witzel, G.; Weiss,\nA.; Baganoff, F. K.; Morris, M. R.; Bertram, T.; Dovciak,\nM.; Duschl, W. J.; and 21 coauthors, 2008b, A&A 492, 337\nEckart, A.; Baganoff, F. K.; Morris, M. R.; Kunneriath, D.;\nZamaninasab, M.; Witzel, G.; Schödel, R.; Garcia-Marin,\nM.; Meyer, L.; Bower, G. C.; and 10 coauthors, 2009, A&A\n500, 935.\nEisenhauer, F.; Schödel, R.; Genzel, R.; Ott, T.; Tecza, M.;\nAbuter, R.; Eckart, A.; Alexander, T., 2003, ApJ 597, L121\nEisenhauer, F.; Genzel, R.; Alexander, T.; Abuter, R.; Paumard,\nT.; Ott, T.; ; and 15 coauthors, 2005, ApJ 628, 246\nEisenhauer, F.; Perrin, G.; Brandner, W.; Straubmeier, C.;\nRichichi, A.; Gillessen, S.; Berger, J. P.; Hippler, S.; Eckart,\nA.; Schöller, M.; and 38 coauthors, 2008, SPIE 7013, 69\nFish, V.L.; Doeleman, S.S.; Broderick, A.E.; Loeb, A.; Rogers,\nA.E.E., 2009, ApJ 706, 1353\nFalanga, M., Melia, F., Tagger, M., Goldwurm, A., Belanger, G.,\n2007, ApJ 662, L15\nFalcke, H.; Markoff, S.; Fender, R., 2001, AGM 18, 107\nFalcke, H.; Markoff, S., 2000, A&A 362, 113\nFloyd D.J.E., Eric Perlman, E., Leahy, J.P., and 5 coauthors,\n2006, ApJ 639, 23\nGenzel, T., Eckart, A., Ott, T. & Eisenhauer, MNRAS 1997, 291,\n219\nGenzel, R., Pichon, C., Eckart, A., Gerhard, O.E., Ott, T. 2000,\nMNRAS 317, 348\nGenzel, R., Schödel, R., Ott, T., et al. 2003, Nature, 425, 934\nGezari, S., Ghez, A. M., Becklin, E. E., Larkin, J., McLean, I. S.,\nMorris, M., ApJ 576, 790, 2002\nGhez, A., Klein, B.L., Morris, M. & Becklin, E.E. 1998, ApJ,\n509, 678\nGhez, A., Morris, M., Becklin, E.E., Tanner, A. & Kremenek, T.\n2000, Nature 407, 349\nGhez, A. M., Duchéne, G., Matthews, K., et al. 2003, ApJ, 586,\nL127\nGhez, A.M., Wright, S.A., Matthews, K., et al. 2004a, ApJ 601,\n159\nGhez, A.M., Hornstein, S.D., Bouchez, A., Le Mignant, D., Lu,\nJ., Matthews, K., Morris, M., Wizinowich, P., Becklin, E.E.,\n2004b, AAS 205, 2406\nGhez, A.M., Salim, S., Hornstein, S. D., Tanner, A., Lu, J. R.,\nMorris, M., Becklin, E. E., Duchêne, G., 2005a, ApJ 620,\n744\nGhez, A. M.; Hornstein, S. D.; Lu, J. R.; Bouchez, A.; Le\nMignant, D.; van Dam, M. A.; Wizinowich, P.; Matthews,\nK.; Morris, M.; Becklin, E. E.; and 7 coauthors, 2005b, ApJ\n635, 1087\nGillessen, S.; Eisenhauer, F.; Trippe, S.; Alexander, T.; Genzel,\nR.; Martins, F.; Ott, T., 2009, ApJ 692, 1075\nGillessen, S.; Eisenhauer, F.; Quataert, E.; Genzel, R.; Paumard,\nT.; Trippe, S.; Ott, T.; Abuter, R.; Eckart, A.; and 4 coauthors,\n2006, ApJ 640, L163\nGoldwurm, A., Brion, E., Goldoni, P. et al. 2003, ApJ, 584, 751\nGould, R.J., 1979, A&A 76, 306\nHawley, J.F.; Balbus, S.A., 1991, ApJ 376, 223\nHawley, J.F.; Stone, J.M., 1998, ApJ 501, 758,\nHornstein, S.D.; Ghez, A.M.; Tanner, A.; Morris, M.; Becklin,\nE. E.; Wizinowich, P., 2002, ApJ 577, L9\nHornstein, S.D., et al., 2006, JPhCS 54, 399\nHornstein, S. D., Matthews, K., Ghez, A. M., Lu, J. R., Morris,\nM., Becklin, E. E., Rafelski, M., & Baganoff, F. K. 2007,\nApJ, 667, 900\n\n\f18\n\nSabha, Witzel, Eckart et al.: The Extreme Luminosity States of SgrA*\n\nIgumenshchev, I.V., 2002, ApJ 577, 31\nIshibashi, W.; Courvoisier, T. J.-L., 2009, A&A 495, 113\nJester, S., Röser, H.-J., Meisenheimer, K., & Perley, R. 2005,\nA&A, 431, 477\nJester, S., Röser, H.-J., Meisenheimer, K., Perley, R., & Conway,\nR. 2001, A&A, 373, 447\nKaras, V., Dovciak, M., Eckart, A., Meyer, L., 2007, Proceedings\nof the Workshop on the Black Holes and Neutron Stars, eds.\nS. Hledik and Z. Stuchlik, 19-21 September 2007 (Silesian\nUniversity, Opava), pp. 99-108, arXiv:0709.3836\nKardashev, N.S., 1962, SvA 6, 317\nKishimoto, M.; Antonucci, R.; Blaes, O.; Lawrence, A.;\nBoisson, C.; Albrecht, M.; Leipski, C., 2008, Nature 454,\n492\nKrabbe, A.; Iserlohe, C.; Larkin, J. E.; Barczys, M.; McElwain,\nM.; Weiss, J.; Wright, S. A.; Quirrenbach, A. 2006, ApJ 642,\nL145\nLightman, A. P., & Shapiro, S. L. 1977, ApJ, 211, 244\nLiu, S.; Petrosian, V.; Melia, F; Fryer, C, 2006, ApJ 648, 1020\nLucy, L. B. 1974, AJ, 79, L745\nMahadevan, R. & Quataert, E. 1997, ApJ, 490, 605\nMarkoff, S., Falcke, H., Yuan, F. & Biermann, P.L. 2001, A&A,\n379, L13\nMarkoff, S., 2005, ApJ 618, L103\nMarkoff, S.; Bower, G.C.; Falcke, H., 2007, MNRAS 379, 1519\nMarrone, D.P.; Moran, J.M.; Zhao, J.-H.; Rao, R. 2007, ApJ 654,\nL57\nMarrone, D. P.; Baganoff, F. K.; Morris, M.; and 14 coauthors,\n2008, ApJ 682, 373\nMarscher, A.P. 1983, ApJ, 264, 296\nMelia, F. & Falcke, H. 2001, ARA&A 39, 309\nMeyer, L., Eckart, A., Schödel, R., Dovciak, M., Karas, V.,\nDuschl, W.J., 2007, A&A 473, 707\nMeyer, L., Eckart, A., Schödel, R., Duschl, W. J., Muciz, K.,\nDovciak, M., Karas, V., 2006a, A&A 460, 15\nMeyer, L., Schödel, R., Eckart, A., Karas, V., Dovciak, M.,\nDuschl, W. J., 2006b, A&A 458, L25\nMurphy, B. W., Cohn, H. N., & Durisen, R. H. 1991, ApJ, 370,\n60\nNayakshin, S.; Sunyaev, R., 2003, MNRAS 343, L15\nÖzel, F., Psaltis, D., & Narayan, R. 2000, ApJ, 541, 234\nOtt, T.; Eckart, A.; Genzel, R., 1999, ApJ 523, 248\nPage, K.L.; Reeves, J.N.; O'Brien, P.T.; Turner, M.J. L.; Worrall,\nD.M., 2004, MNRAS 353, 133\nPecháček, T., Karas, V., Czerny, B., 2008, A&A 487, 815\nPerlman, E. S., Biretta, J. A., Sparks, W. B., Macchetto, F. D., &\nLeahy, J. P. 2001, ApJ, 551, 206\nPerlman, E. S., & Wilson, A. S. 2005, ApJ, 627, 140\nPeterson, B.M., 1997, 'An introduction to active galactic nuclei',\np. 44, Cambridge University Press\nPorquet, D., Predehl, P., Aschenbach, et al. 2003, A&A 407, L17\nPorquet, D.; Grosso, N.; Predehl, P.; Hasinger, G.; Yusef-Zadeh,\nF.; and 11 coauthors; 2008, A&A 488, 549\nQuataert, E. 2002, ApJ, 575, 855\nQuataert, E., Astron. Nachr., Vol. 324, No. S1 (2003), Special\nSupplement \"The central 300 parsecs of the Milky Way\",\nEds. A. Cotera, H. Falcke, T. R. Geballe, S. Markoff, p. 435\n(astro-ph/0304099)\nReid, Mark J., 1993, ARA&A 31, 345\nStraubmeier, Christian; Eisenhauer, Frank; Perrin, Guy;\nBrandner, Wolfgang; Eckart, Andreas, 2008, SPIE 7013, 93\nSchödel, R.; Merritt, D.; Eckart, A., 2009, A&A 502 91\n\nSchödel, R.; Eckart, A.; Alexander, T.; Merritt, D.; Genzel, R.;\nSternberg, A.; Meyer, L.; Kul, F.; Moultaka, J.; Ott, T.;\nStraubmeier, C. 2007, A&A 469, 125\nSchödel, R., Genzel, R., Ott, et al. 2003, ApJ, 596, 1015\nSchödel, R., Ott, T., Genzel, R. et al. 2002, Nature, 419, 694\nScoville, N. Z.; Stolovy, S. R.; Rieke, M.; Christopher, M.;\nYusef-Zadeh, F., 2003, ApJ 594, 294\nTanner, A.; Ghez, A. M.; Morris, M.; Becklin, E. E.; Cotera, A.;\nand 3 coauthors, 2002, ApJ 575, 860\nTanner, A.; Ghez, A. M.; Morris, M. R.; Christou, J. C., 2005,\nApJ 624, 742\nvan der Laan, H., 1966, Nature 211, 1131\nYuan, F., Quataert, E., & Narayan, R. 2003, ApJ, 598, 301\nYuan, F., 2006, JPhCS 54, 427\nYuan, F., Lin, J.; Wu, K.; Ho, Luis C., 2008, MNRAS 395, 2183\nYusef-Zadeh, F., Roberts, D., Wardle, M., Heinke, C. O., Bower,\nG. C., 2006a, ApJ 650, 189\nYusef-Zadeh, F., et al., 2006b, ApJ 644, 198\nYusef-Zadeh, F.; Wardle, M.; Cotton, W. D.; Heinke, C. O.;\nRoberts, D. A., 2007, ApJ 668, L47\nYusef-Zadeh, F.; Wardle, M.; Heinke, C.; Dowell, C. D.;\nRoberts, D.; Baganoff, F. K.; Bower, G. C., 2008, ApJ 682,\n361\nYusef-Zadeh, F.; Bushouse, H.; Wardle, M.; Heinke, C.; Roberts,\nD. A.; and 16 coauthors, 2009, 2009arXiv0907.3786Y\nZamaninasab, M., Eckart, A., Meyer, L., Schödel, R., Dovciak,\nM., Karas, V., Kunneriath, D., Witzel, G., Giessuebel, R.,\nKönig, S., Straubmeier, C., Zensus, A., 2008, Proc. of a\nconference on 'Astrophysics at High Angular Resolution\n(AHAR 08)' held 21-25 April 2008 in Bad Honnef,\nGermany, 2008, JPhCS 131, 12008\nZamaninasab, M.; Eckart, A.; Witzel, G.; Dovciak, M.; Karas,\nV.; Giessuebel, R. Schödel R.; Bremer, M.; Garcia-Marin,\nM.; Kunneriath, D.; Muzic, K.; and 4 coauthors 2009,\narXiv0911.4659, A&A in press\nZhao, J.-H., Young, K.H., Herrnstein, R.M., Ho, P.T.P.,\nTsutsumi, T., Lo, K.Y., Goss, W.M. & Bower, G.C., 2003,\nApJL, 586, L29.\n\n\f"}