{"id": "http://arxiv.org/abs/0804.2539v1", "guidislink": true, "updated": "2008-04-16T07:59:37Z", "updated_parsed": [2008, 4, 16, 7, 59, 37, 2, 107, 0], "published": "2008-04-16T07:59:37Z", "published_parsed": [2008, 4, 16, 7, 59, 37, 2, 107, 0], "title": "Identifying the outflow driving sources in Orion-KL", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0804.0600%2C0804.4748%2C0804.0603%2C0804.2917%2C0804.4755%2C0804.3546%2C0804.1427%2C0804.1609%2C0804.1753%2C0804.3566%2C0804.4332%2C0804.3047%2C0804.3098%2C0804.2836%2C0804.3489%2C0804.3330%2C0804.2132%2C0804.1121%2C0804.1204%2C0804.1853%2C0804.4074%2C0804.3216%2C0804.3346%2C0804.1597%2C0804.3360%2C0804.0305%2C0804.1087%2C0804.1336%2C0804.3232%2C0804.1780%2C0804.0218%2C0804.1737%2C0804.4778%2C0804.3652%2C0804.1345%2C0804.4243%2C0804.3166%2C0804.0120%2C0804.3792%2C0804.4561%2C0804.1067%2C0804.0628%2C0804.0196%2C0804.3004%2C0804.2889%2C0804.4314%2C0804.0545%2C0804.4587%2C0804.3527%2C0804.2827%2C0804.4383%2C0804.4399%2C0804.2460%2C0804.3332%2C0804.3184%2C0804.3585%2C0804.3815%2C0804.4637%2C0804.2500%2C0804.0912%2C0804.2290%2C0804.1275%2C0804.4802%2C0804.4773%2C0804.1929%2C0804.1498%2C0804.3280%2C0804.1071%2C0804.3443%2C0804.0409%2C0804.0090%2C0804.4389%2C0804.1421%2C0804.3258%2C0804.3055%2C0804.3977%2C0804.1049%2C0804.4741%2C0804.4169%2C0804.0050%2C0804.2069%2C0804.0102%2C0804.0936%2C0804.3717%2C0804.3914%2C0804.1854%2C0804.3688%2C0804.2859%2C0804.2213%2C0804.2682%2C0804.0989%2C0804.0098%2C0804.4531%2C0804.1667%2C0804.2635%2C0804.0950%2C0804.4269%2C0804.4305%2C0804.2539%2C0804.2483%2C0804.3062&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Identifying the outflow driving sources in Orion-KL"}, "summary": "The enigmatic outflows of the Orion-KL region have raised discussions about\ntheir potential driving sources for several decades. Here, we present C18O(2-1)\nobservations combined from the Submillimeter Array and the IRAM30m telescope.\nThe molecular gas is associated on large scales with the famous\nnorthwest-southeast high-velocity outflow whereas the high-velocity gas on\nsmall spatial scales traces back to the recently identified submm source SMA1.\nTherefore, we infer that SMA1 may host the driving source of this outflow.\nBased on the previously published thermal and maser SiO data, source I is the\nprime candidate to drive the northeast-southwest low-velocity outflow. The\nsource SMA1 is peculiar because it is only detected in several submm wavelength\nbands but neither in the infrared nor cm regime. We discuss that it may be a\nvery young intermediate- to high-mass protostar. The estimated outflow masses\nare high whereas the dynamical time-scale of the outflow is short of the order\n10^3yrs.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0804.0600%2C0804.4748%2C0804.0603%2C0804.2917%2C0804.4755%2C0804.3546%2C0804.1427%2C0804.1609%2C0804.1753%2C0804.3566%2C0804.4332%2C0804.3047%2C0804.3098%2C0804.2836%2C0804.3489%2C0804.3330%2C0804.2132%2C0804.1121%2C0804.1204%2C0804.1853%2C0804.4074%2C0804.3216%2C0804.3346%2C0804.1597%2C0804.3360%2C0804.0305%2C0804.1087%2C0804.1336%2C0804.3232%2C0804.1780%2C0804.0218%2C0804.1737%2C0804.4778%2C0804.3652%2C0804.1345%2C0804.4243%2C0804.3166%2C0804.0120%2C0804.3792%2C0804.4561%2C0804.1067%2C0804.0628%2C0804.0196%2C0804.3004%2C0804.2889%2C0804.4314%2C0804.0545%2C0804.4587%2C0804.3527%2C0804.2827%2C0804.4383%2C0804.4399%2C0804.2460%2C0804.3332%2C0804.3184%2C0804.3585%2C0804.3815%2C0804.4637%2C0804.2500%2C0804.0912%2C0804.2290%2C0804.1275%2C0804.4802%2C0804.4773%2C0804.1929%2C0804.1498%2C0804.3280%2C0804.1071%2C0804.3443%2C0804.0409%2C0804.0090%2C0804.4389%2C0804.1421%2C0804.3258%2C0804.3055%2C0804.3977%2C0804.1049%2C0804.4741%2C0804.4169%2C0804.0050%2C0804.2069%2C0804.0102%2C0804.0936%2C0804.3717%2C0804.3914%2C0804.1854%2C0804.3688%2C0804.2859%2C0804.2213%2C0804.2682%2C0804.0989%2C0804.0098%2C0804.4531%2C0804.1667%2C0804.2635%2C0804.0950%2C0804.4269%2C0804.4305%2C0804.2539%2C0804.2483%2C0804.3062&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "The enigmatic outflows of the Orion-KL region have raised discussions about\ntheir potential driving sources for several decades. Here, we present C18O(2-1)\nobservations combined from the Submillimeter Array and the IRAM30m telescope.\nThe molecular gas is associated on large scales with the famous\nnorthwest-southeast high-velocity outflow whereas the high-velocity gas on\nsmall spatial scales traces back to the recently identified submm source SMA1.\nTherefore, we infer that SMA1 may host the driving source of this outflow.\nBased on the previously published thermal and maser SiO data, source I is the\nprime candidate to drive the northeast-southwest low-velocity outflow. The\nsource SMA1 is peculiar because it is only detected in several submm wavelength\nbands but neither in the infrared nor cm regime. We discuss that it may be a\nvery young intermediate- to high-mass protostar. The estimated outflow masses\nare high whereas the dynamical time-scale of the outflow is short of the order\n10^3yrs."}, "authors": ["H. Beuther", "H. D. Nissen"], "author_detail": {"name": "H. D. Nissen"}, "author": "H. D. Nissen", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1086/589330", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/0804.2539v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0804.2539v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "4 pages, 3 figures, Astrophysical Journal Letters in press, a\n  high-resolution version is available at\n  http://www.mpia.de/homes/beuther/papers.html", "arxiv_primary_category": {"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0804.2539v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0804.2539v1", "journal_reference": null, "doi": "10.1086/589330", "fulltext": "Draft version from October 25, 2018, accepted for ApJL\nPreprint typeset using LATEX style emulateapj v. 14/09/00\n\nIDENTIFYING THE OUTFLOW DRIVING SOURCES IN ORION-KL\nH. Beuther1 & H.D. Nissen2\n\narXiv:0804.2539v1 [astro-ph] 16 Apr 2008\n\nbeuther@mpia.de, hdn@phys.au.dk\nDraft version from October 25, 2018, accepted for ApJL\n\nABSTRACT\nThe enigmatic outflows of the Orion-KL region have raised discussions about their potential driving\nsources for several decades. Here, we present C18 O(2–1) observations combined from the Submillimeter\nArray and the IRAM 30 m telescope. The molecular gas is associated on large scales with the famous\nnorthwest-southeast high-velocity outflow whereas the high-velocity gas on small spatial scales traces\nback to the recently identified submm source SMA1. Therefore, we infer that SMA1 may host the\ndriving source of this outflow. Based on the previously published thermal and maser SiO data, source\nI is the prime candidate to drive the northeast-southwest low-velocity outflow. The source SMA1 is\npeculiar because it is only detected in several submm wavelength bands but neither in the infrared nor\ncm regime. We discuss that it may be a very young intermediate- to high-mass protostar. The estimated\noutflow masses are high whereas the dynamical time-scale of the outflow is short of the order 103 yrs.\nSubject headings: stars: formation – stars: early-type – stars: individual (Orion-KL) – ISM: jets and\noutflows\n(e.g., Schilke et al. 1997), the combination of the thermal\nand maser SiO emission strongly favors source I as the\ndriving source of the low-velocity northeast-southwest outflow. Source n has also been discussed as a possible driving\nsource of the northeast-southwest low-velocity outflow. It\nshows an elongation along position angle 100–130◦ in the\nmid-infrared which could be due to a disk (Shuping et al.\n2004; Greenhill et al. 2004), and a roughly perpendicular elongation in the radio at 8.4 GHz which may be\ncaused by an outflow (Menten & Reid 1995). The relationship between sources I and n in driving the northeastsouthwest outflow(s) is unknown (for a discussion see, e.g.,\nShuping et al. 2004; Nissen et al. 2007).\nThat leaves as an open question which source is the\nculprit for driving the large-scale high-velocity northwestsoutheast outflow? Bally (2008) recently suggested that\nthis outflow may be powered by the dynamical decay of\na massive star system, but other scenarios are possible\nas well. Based on low-resolution data, de Vicente et al.\n(2002) proposed the existence of another luminous source\napproximately 2′′ south of source I. This source was unambiguously identified in the first sub-arcsecond resolution\n865 μm submm continuum image obtained with the Submillimeter Array (SMA), and henceforth labeled SMA1\n(Beuther et al. 2004, see also Fig. 1). Follow-up SMA observations at 440 μm detected the source at these shorter\nwavelengths as well (Beuther et al. 2006). In this work we\nshow that the high-velocity gas, as traced by C18 O, apparently traces back to this relatively unknown source rather\nthan to sources I or n.\n\n1. introduction\n\nThe explosive large-scale northwest-southeast outflow\nin the Orion-KL region is one of the best studied but\nprobably also least understood outflows in the sky. No\nother region shows that many H2 bow shocks distributed\nin a fan-like fashion with red- and blue-shifted emission features on both sides of the central region (e.g.,\nSchultz et al. 1999; Nissen et al. 2007). Furthermore, the\nmolecular emission as traced in CO shows extremely broad\nline-wings up to > 50 km s−1 , but the morphological\nstructure has so far been unclear and difficult to match\nclosely to the H2 outflow (e.g., Chernin & Wright 1996;\nRodrı́guez-Franco et al. 1999). In addition to this outflow, also known as the high-velocity outflow, there exists a\nsecond outflow in the northeast-southwest direction which\nwas first detected by H2 O maser emission and which is often labeled as the low-velocity outflow (e.g., Genzel et al.\n1981; Genzel & Stutzki 1989).\nThe major question is which sources drive the different outflows. While originally the infrared source IRc2\nwas a suspect, it was soon realized that one of the prime\npowering sources of the region is the very close-by radio\nsource I (Menten & Reid 1995). This source is the site of\nvibrationally excited SiO maser emission, and the orientation of these masers allowed different interpretations of\nthe associated outflow direction. While early work favored\nsource I to drive the large-scale northwest-southeast outflow (e.g., Wright et al. 1995; Greenhill et al. 1998), more\nrecent work on the maser data indicates that it rather\nbelongs to the low-velocity northeast-southwest outflow\n(Greenhill et al. 2003). The latter interpretation finds additional support in thermal SiO observations that show an\nelongated structure centered on source I with an orientation also in the northeast-southwest (Blake et al. 1996;\nBeuther et al. 2005, see also Fig. 1). Since thermal SiO\nemission is usually attributed to shocks within outflows\n1\n2\n\n2. observations\n\nOrion-KL was observed with the SMA in the compact\nconfiguration simultaneously at 690 GHz and 230 GHz\non 2005 February 19th.\nTo accomplish the highfrequency observations the weather conditions were excellent with zenith opacities τ (230 GHz) between 0.03 and\n\nMax Planck Institute for Astronomy, Königstuhl 17, 69117 Heidelberg, Germany\nDepartment of Physics and Astronomy, University of Aarhus, 8000 Aarhus C, Denmark\n\n1\n\n\f2\n\nBeuther & Nissen\n\n0.04 throughout the night. The phase center was the\nnominal position of source I R.A.(J2000) 05h35m14.50s\nand decl.(J2000) 05◦ 22′ 30.′′ 45, and the vlsr was ∼5 km s−1 .\nThe double-sideband receivers covered the frequency\nranges 218.85 to 220.85 GHz and 228.85 to 230.85 GHz.\nThe phase was calibrated with regularly interleaved observations of the quasar 0607-157, flux and bandpass calibration were performed with Callisto observations. The\nhigh-frequency data along with more observational details\nare published in Beuther et al. (2006), here we are only\ninterested in a small subset of the low-frequency data.\nComplimentary C18 O(2–1) data were obtained with the 9\npixel HERA array on the IRAM 30 m telescope in September 2007. The observations covered a region of 1′ × 1′\naround source I and were conducted in the on-the-fly mode\nwith on-source integration times per position of ∼3.7 secs.\nThe OFF-source reference position was 15′ east of source\nI. The single-dish data were converted to visibilities and\nsubsequently processed with the SMA data within the\nMIRIAD package using standard tools (e.g., UVMODEL).\nThe weighting of the two datasets was chosen to recover\nlarge-scale emission but maintain at the same time the\nhigh spatial resolution to resolve small-scale structure.\nThe synthesized beam of the combined data is 4.2′′ × 3.3′′ ,\nand the 1σ rms per 5 km s−1 channel is ∼50 mJy beam−1 .\n3. results\n\nThe whole low-frequency SMA dataset will be presented\nin a forthcoming publication by Nissen et al. (in prep.),\nhere we are only interested in the C18 O(2–1) emission. Although the SMA and IRAM 30 m observations also covered\nthe more abundant isotopologues 12 CO(2–1) and 13 CO(2–\n1), in Orion-KL it turns out that because of their high optical depth these two lines strongly suffer from confusion\nproblems with the ambient cloud complicating any interpretation of the data. In contrast to that, the rarer isotopologue C18 O(2–1) penetrates the ambient cloud more\ndeeply and hence traces the outflow associated gas far better, allowing us a deeper analysis of the outflow structure,\nits mass flow rate, kinematics and energetics, as well as\npinpointing the likely driving source. Fig. 2 presents the\ncombined SMA+30 m C18 O(2–1) channel map. Excluding the channels with strongest emission closest to the vlsr\n(approximately four channels between 0 and 15 km s−1 ),\ntwo main features can be distinguished in the remaining\nchannels:\n(1) The large-scale gas emission exhibits a V-shaped\ncone-like open structure to the northwest, particularly\nprominent in the red-shifted channels ≥ 20 km s−1 but\nalso visible in the blue-shifted channels between −20 and\n−10 km s−1 . This cone-like structure approximately encompasses the main features of shocked strong H2 emission in this direction (Fig. 3). Finding both blue- and\nred-shifted gas to the northwest indicates a wide opening\nangle of the flow where the main outflow axis is not too\nfar from the plane of the sky. The less pronounced emission to the southeast was already previously observed, and\nChernin & Wright (1996) argue that the outflow may be\nblocked in this direction by the hot core3 . It is interesting\nto note that the main southeastern emission features are\n\nwell correlated with a lack of H2 emission indicating particularly high column densities in this direction. Furthermore, we find high-velocity gas toward the southwest and\nnortheast (Fig. 3). Since Nissen et al. (2007) find H2 emission with velocities up to 40 km s−1 toward the southwest\nas well, it is likely that this high-velocity gas is associated\nwith the low-velocity outflow.\n(2) We find that the high-velocity gas on the blueand red-shifted side of the spectrum traces back to the\nsource SMA1. Although the synthesized beam is larger\nthan the spatial separation of source I and SMA1 (∼ 2′′ or\n∼830 AU), the peak positions can be determined with a\nmuch higher spatial accuracy depending on the signalto-noise ratio S/N. For point sources, one can in principle achieve an accuracy of 0.45 HPBW/(S/N) (Reid et al.\n1988), however, this may be less applicable for extended\nemission like C18 O in this case. The channel with the lowest S/N ratio still detects the main peak position toward\nSMA1 at higher than 15σ values (at −30 km s−1 ). For\na point source, this would imply that the peak positions\ncould be determined to better than 0.125′′ . Although the\nC18 O emission is more extended, the shape of the highvelocity gas close to SMA1 can to first order be described\nby a two-dimensional Gaussian. Therefore, being more\nconservative for the C18 O high-velocity gas, it should still\nbe possible to infer the emission peak positions to an accuracy of better than 1′′ . Based on this, the blue- and\nred-shifted high-velocity gas is spatially mainly associated\nwith SMA1, and not with the previously often discussed\nsources I or n.\nThe blue- and red-shifted maps shown in Figure 3 (integrated from −35 to −20 and from 22.5 to 37.5 km s−1 ,\nrespectively) can be used to calculate the masses, kinematic and energetic parameters of the outflow following\nBeuther et al. (2002b) (time-scale t, outflow rate Ṁout ,\nmomentum rate p, and energy E). Assuming optically\nthin C18 O(2–1) emission at 30 K with a C18 O/H2 conversion factor of 1.7 × 10−7 (Frerking et al. 1982), the derived\nvalues are given in Table 1. While the masses have uncertainties of approximately a factor 5, the kinematic and\nenergetic values are uncertain within an order of magnitude (Cabrit & Bertout 1990). The derived masses, outflow and momentum rates are at the upper end of typically\nfound massive outflows, whereas the time-scale is relatively\nshort (compared with the outflow sample in Beuther et al.\n2002b).\n4. discussion and conclusions\n\nThe large-scale cone-like morphology of the C18 O outflow approximately following the H2 bow-shock emission\nin the northwest direction suggests that C18 O and H2 are\ntracing the same outflow. Furthermore, the spatial association of the C18 O high-velocity emission with the submm\nsource SMA1 indicates that SMA1 may harbor the driving source of the enigmatic large-scale Orion-KL outflow.\nOnly the combination of the single-dish 30 m data, tracing the large-scale structure, with the SMA high-spatialresolution observations allows us to see all relevant structures and to trace the outflow back to pinpoint its origin.\n\n3 The hot core traced in NH (Wilson et al. 2000) actually extends further southeast of SMA1 than indicated by the hot core continuum peak\n3\nin Fig. 1. The proposed blocking of the outflow by the hot core may also be responsible for some of the large-scale asymmetries of the H2\nemission.\n\n\fOutflow driving sources in Orion-KL\nIn combination with the thermal and maser SiO data,\nwe suggest that the two driving sources of the two known\noutflows can be identified: (1) SMA1 may host the driving\nsource of the large-scale northwest-southeast high-velocity\noutflow, whereas (2) source I is likely the origin of the\nnortheast-southwest low-velocity outflow.\nThe nature of source I has been subject to many investigations for more than a decade (e.g., Menten & Reid\n1995; Beuther et al. 2006; Reid et al. 2007), however, we\ndo not know much about SMA1. So far SMA1 has only\nbeen detected at submm wavelengths (865 and 440 μm,\nBeuther et al. 2004, 2006) but neither at shorter infrared\nnor at longer cm wavelengths (e.g., Menten & Reid 1995;\nGreenhill et al. 2004). The submm-only detection is indicative of a very young age of the source which is supported by the short dynamical time-scale of the molecular outflow. Although deriving a luminosity with just\ntwo data-points is impossible, based on the large outflow\nmasses, it is likely that SMA1 is in the process of forming a massive star. The non-detection at cm wavelengths\ncould either be due to quenching of an underlying hypercompact Hii region by very high accretion rates and/or\ngravitational trapping of the ionized gas (e.g., Walmsley\n1995; Keto 2003), or the source is still in such a young evolutionary phase that the central object has not yet enough\nionizing flux to produce a detectable hypercompact Hii\nregion. In the framework of the recently proposed evolutionary sequence by Beuther et al. (2007), it may be an\nintermediate-mass protostar destined to become massive\nin the future.\nAssuming optically thin dust emission at 100 K with\na dust opacity index β = 2 (e.g., Hildebrand 1983;\nBeuther et al. 2002a), the spatially resolved submm fluxes\n(Beuther et al. 2004, 2006) correspond to a gas mass and\n\n3\n\ncolumn density of ∼0.1 M⊙ and 3 × 1024 , respectively.\nWhile the large column densities confirm that this source\nis undetectable at near-infrared wavelengths with current\ninstrumentation, at first sight the mass appears small.\nHowever, as discussed in (Beuther et al. 2004), more than\n90% of the total flux is filtered out by the SMA observations, and hence the mass estimates are correspondingly\nunreliable. The total luminosity of the region of about\n105 L⊙ (e.g., Menten & Reid 1995) cannot be produced\nby the sources previously discussed in the literature (e.g.,\nGreenhill et al. 2004), and it is well possible that SMA1\ncontributes a significant fraction of the overall Orion-KL\nluminosity.\nWe note that the short dynamical outflow time-scale\nof the order 103 yrs is consistent with both recently discussed scenarios for the proper motions in this region: Tan\n(2005) proposed that the recent passage of the BN-object\nhas triggered the outflow burst in this region, whereas\nRodrı́guez et al. (2005) and Gómez et al. (2005) suggest\nthat a dynamically decaying multiple system is at the root\nof the observed proper motions. Both events are suggested\nto have taken place about 500 yrs ago. Our data do not\nallow to differentiate between these scenarios, however, it\nis interesting that all recent observations are indicative of\nstrong activity within the last 103 yrs.\nH.B. acknowledges financial support by the EmmyNoether-Programm of the Deutsche Forschungsgemeinschaft (DFG, grant BE2578). H.D.N. acknowledges the\nsupport of the Aarhus Centre for Atomic Physics (ACAP),\nfunded by the Danish Basic Research Foundation and the\nfinancial support from the Instrument Centre for Danish\nAstrophysics (IDA), funded by the Danish National Science Committee (FNU).\n\nREFERENCES\nBally, J. 2008, ASP Conference Series 387, Proceedings to conference\n\"The Formation of Massive Stars: Observations Confront Theory\",\nastroph/0712.1997\nBeuther, H., Churchwell, E. B., McKee, C. F., & Tan, J. C. 2007, in\nProtostars and Planets V, ed. B. Reipurth, D. Jewitt, & K. Keil,\n165–180\nBeuther, H., Schilke, P., Menten, K. M., et al. 2002a, ApJ, 566, 945\nBeuther, H., Schilke, P., Sridharan, T. K., et al. 2002b, A&A, 383,\n892\nBeuther, H., Zhang, Q., Greenhill, L. J., et al. 2004, ApJ, 616, L31\n-. 2005, ApJ, 632, 355\nBeuther, H., Zhang, Q., Reid, M. J., et al. 2006, ApJ, 636, 323\nBlake, G. A., Mundy, L. G., Carlstrom, J. E., et al. 1996, ApJ, 472,\nL49\nCabrit, S. & Bertout, C. 1990, ApJ, 348, 530\nChernin, L. M. & Wright, M. C. H. 1996, ApJ, 467, 676\nde Vicente, P., Martı́n-Pintado, J., Neri, R., & Rodrı́guez-Franco, A.\n2002, ApJ, 574, L163\nFrerking, M. A., Langer, W. D., & Wilson, R. W. 1982, ApJ, 262,\n590\nGenzel, R., Reid, M. J., Moran, J. M., & Downes, D. 1981, ApJ, 244,\n884\nGenzel, R. & Stutzki, J. 1989, ARA&A, 27, 41\nGómez, L., Rodrı́guez, L. F., Loinard, L., et al. 2005, ApJ, 635, 1166\nGreenhill, L. J., Chandler, C. J., Reid, M. J., et al. 2003, in IAU\nSymposium\nGreenhill, L. J., Gezari, D. Y., Danchi, W. C., et al. 2004, ApJ, 605,\nL57\n\nGreenhill, L. J., Gwinn, C. R., Schwartz, C., Moran, J. M., &\nDiamond, P. J. 1998, Nature, 396, 650\nHildebrand, R. H. 1983, QJRAS, 24, 267\nKeto, E. 2003, ApJ, 599, 1196\nMenten, K. M. & Reid, M. J. 1995, ApJ, 445, L157\nNissen, H. D., Gustafsson, M., Lemaire, J. L., et al. 2007, A&A, 466,\n949\nReid, M. J., Menten, K. M., Greenhill, L. J., & Chandler, C. J. 2007,\nApJ, 664, 950\nReid, M. J., Schneps, M. H., Moran, J. M., et al. 1988, ApJ, 330, 809\nRodrı́guez, L. F., Garay, G., Brooks, K. J., & Mardones, D. 2005,\nApJ, 626, 953\nRodrı́guez-Franco, A., Martı́n-Pintado, J., & Wilson, T. L. 1999,\nA&A, 351, 1103\nSchilke, P., Walmsley, C. M., Pineau des Forets, G., & Flower, D. R.\n1997, A&A, 321, 293\nSchultz, A. S. B., Colgan, S. W. J., Erickson, E. F., et al. 1999, ApJ,\n511, 282\nShuping, R. Y., Morris, M., & Bally, J. 2004, AJ, 128, 363\nTan, J. C. 2005, in IAU Symposium, ed. R. Cesaroni, M. Felli,\nE. Churchwell, & M. Walmsley, 318–327\nWalmsley, M. 1995, in Revista Mexicana de Astronomia y Astrofisica\nConference Series, 137\nWilson, T. L., Gaume, R. A., Gensheimer, P., & Johnston, K. J.\n2000, ApJ, 538, 665\nWright, M. C. H., Plambeck, R. L., Mundy, L. G., & Looney, L. W.\n1995, ApJ, 455, L185\n\n\f4\n\nBeuther & Nissen\nTable 1\nOutflow parameter\n\nMblue [M⊙ ]\nMred [M⊙ ]\nMtotal [M⊙ ]\nt [yr]\nṀout [M⊙ yr−1 ]\np [M⊙ km s−1 ]\nE [erg]\n\n33\n81\n124\n971\n1.2 × 10−1\n3980\n1.4 × 1048\n\n\fOutflow driving sources in Orion-KL\n\nFig. 1.- SiO(8–7) integrated emission as contour overlay on the grey-scale 865 μm submm continuum emission obtained with the SMA. This\nfigure is an adaption of the 865 μm continuum and SiO(8–7) line data from Beuther et al. (2004, 2005). The grey-scale continuum contours\nstart at the 3σ level of 0.105 mJy beam−1 and continues in 2σ steps. The SiO emission is contoured from ±10 to ±90% (step ±10%) of the\npeak emission of 2.1 Jy beam−1 with full and dashed contours as positive and negative features (due to missing short spacings), respectively.\n\nFig. 2.- C18 O(2–1) channel map with 5 km s−1 of the combined SMA+30m data. The contours start at the 3σ levels of 150 mJy beam−1\nand continue in 6σ steps for all panels except of the 0, 5 and 10 km s−1 panels that follow 12, 12 and 14σ steps for clarity reasons. Negative\nfeatures are draw as dashed contours. The stars mark the positions of the five main continuum source with labels in the top-left panel. The\nsynthesized beam is shown at the bottom-left of each panel.\n\n5\n\n\f6\n\nBeuther & Nissen\n\nFig. 3.- Overlay of the H2 emission in grey-scale (Nissen et al. 2007) with the blue- and red-shifted C18 O(2–1) emission in color-contours.\nThe integration ranges are [−35.0/−20.0] and [22.5,37.5] km s−1 , respectively. The contours are in 3σ steps of 150 mJy beam−1 . The stars\nmark the positions of the same continuum sources as in Figure 2, the synthesized beam is shown at the top-right of each panel. The large\ncircle in the left panel shows the size of the SMA primary beam, whereas the squared box marks the size of the inlay-box shown in the right\npanel. The outflow directions of the high- and low-velocity outflow are sketched in the left panel.\n\n\fThis figure \"f3.jpg\" is available in \"jpg\" format from:\nhttp://arxiv.org/ps/0804.2539v1\n\n\f"}