{"id": "http://arxiv.org/abs/1205.0512v1", "guidislink": true, "updated": "2012-05-02T18:17:08Z", "updated_parsed": [2012, 5, 2, 18, 17, 8, 2, 123, 0], "published": "2012-05-02T18:17:08Z", "published_parsed": [2012, 5, 2, 18, 17, 8, 2, 123, 0], "title": "Solvable models of resonances and decays", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1205.1464%2C1205.3025%2C1205.4082%2C1205.1495%2C1205.0267%2C1205.0797%2C1205.4203%2C1205.2054%2C1205.1136%2C1205.0020%2C1205.2183%2C1205.3785%2C1205.1506%2C1205.0892%2C1205.3023%2C1205.1226%2C1205.1362%2C1205.0589%2C1205.2833%2C1205.0515%2C1205.2843%2C1205.4488%2C1205.0501%2C1205.1954%2C1205.1688%2C1205.2231%2C1205.4269%2C1205.3523%2C1205.2767%2C1205.2139%2C1205.0392%2C1205.3434%2C1205.1726%2C1205.3102%2C1205.2854%2C1205.0841%2C1205.1878%2C1205.2803%2C1205.1107%2C1205.1958%2C1205.1698%2C1205.0766%2C1205.3841%2C1205.0133%2C1205.1148%2C1205.2459%2C1205.0003%2C1205.2850%2C1205.4044%2C1205.3737%2C1205.2816%2C1205.3560%2C1205.3553%2C1205.1311%2C1205.2354%2C1205.1135%2C1205.0452%2C1205.3492%2C1205.2111%2C1205.1390%2C1205.3787%2C1205.1661%2C1205.0007%2C1205.0780%2C1205.2710%2C1205.0667%2C1205.0512%2C1205.2041%2C1205.2531%2C1205.1935%2C1205.3772%2C1205.0034%2C1205.3716%2C1205.3801%2C1205.0430%2C1205.1995%2C1205.0001%2C1205.0925%2C1205.2434%2C1205.0166%2C1205.2076%2C1205.4307%2C1205.3439%2C1205.3637%2C1205.0455%2C1205.1209%2C1205.0119%2C1205.2909%2C1205.1929%2C1205.2342%2C1205.0565%2C1205.1210%2C1205.0367%2C1205.2589%2C1205.1453%2C1205.1121%2C1205.2057%2C1205.4317%2C1205.2322%2C1205.3244%2C1205.0377&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Solvable models of resonances and decays"}, "summary": "Resonance and decay phenomena are ubiquitous in the quantum world. To\nunderstand them in their complexity it is useful to study solvable models in a\nwide sense, that is, systems which can be treated by analytical means. The\npresent review offers a survey of such models starting the classical Friedrichs\nresult and carrying further to recent developments in the theory of quantum\ngraphs. Our attention concentrates on dynamical mechanism underlying resonance\neffects and at time evolution of the related unstable systems.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1205.1464%2C1205.3025%2C1205.4082%2C1205.1495%2C1205.0267%2C1205.0797%2C1205.4203%2C1205.2054%2C1205.1136%2C1205.0020%2C1205.2183%2C1205.3785%2C1205.1506%2C1205.0892%2C1205.3023%2C1205.1226%2C1205.1362%2C1205.0589%2C1205.2833%2C1205.0515%2C1205.2843%2C1205.4488%2C1205.0501%2C1205.1954%2C1205.1688%2C1205.2231%2C1205.4269%2C1205.3523%2C1205.2767%2C1205.2139%2C1205.0392%2C1205.3434%2C1205.1726%2C1205.3102%2C1205.2854%2C1205.0841%2C1205.1878%2C1205.2803%2C1205.1107%2C1205.1958%2C1205.1698%2C1205.0766%2C1205.3841%2C1205.0133%2C1205.1148%2C1205.2459%2C1205.0003%2C1205.2850%2C1205.4044%2C1205.3737%2C1205.2816%2C1205.3560%2C1205.3553%2C1205.1311%2C1205.2354%2C1205.1135%2C1205.0452%2C1205.3492%2C1205.2111%2C1205.1390%2C1205.3787%2C1205.1661%2C1205.0007%2C1205.0780%2C1205.2710%2C1205.0667%2C1205.0512%2C1205.2041%2C1205.2531%2C1205.1935%2C1205.3772%2C1205.0034%2C1205.3716%2C1205.3801%2C1205.0430%2C1205.1995%2C1205.0001%2C1205.0925%2C1205.2434%2C1205.0166%2C1205.2076%2C1205.4307%2C1205.3439%2C1205.3637%2C1205.0455%2C1205.1209%2C1205.0119%2C1205.2909%2C1205.1929%2C1205.2342%2C1205.0565%2C1205.1210%2C1205.0367%2C1205.2589%2C1205.1453%2C1205.1121%2C1205.2057%2C1205.4317%2C1205.2322%2C1205.3244%2C1205.0377&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Resonance and decay phenomena are ubiquitous in the quantum world. To\nunderstand them in their complexity it is useful to study solvable models in a\nwide sense, that is, systems which can be treated by analytical means. The\npresent review offers a survey of such models starting the classical Friedrichs\nresult and carrying further to recent developments in the theory of quantum\ngraphs. Our attention concentrates on dynamical mechanism underlying resonance\neffects and at time evolution of the related unstable systems."}, "authors": ["Pavel Exner"], "author_detail": {"name": "Pavel Exner"}, "author": "Pavel Exner", "arxiv_comment": "Written for proceedings of the conference \"Mathematical Physics,\n  Spectral Theory and Stochastic Analysis\" (Goslar 2011)", "links": [{"href": "http://arxiv.org/abs/1205.0512v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1205.0512v1", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "math-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "math-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "math.MP", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "math.SP", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "quant-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "81Q80, 35Q40, 81Q35, 81U15", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1205.0512v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1205.0512v1", "journal_reference": null, "doi": null, "fulltext": "arXiv:1205.0512v1 [math-ph] 2 May 2012\n\nSolvable models of resonances and decays\nPavel Exner\nAbstract. Resonance and decay phenomena are ubiquitous in the quantum\nworld. To understand them in their complexity it is useful to study solvable\nmodels in a wide sense, that is, systems which can be treated by analytical\nmeans. The present review offers a survey of such models starting the classical\nFriedrichs result and carrying further to recent developments in the theory of\nquantum graphs. Our attention concentrates on dynamical mechanism underlying resonance effects and at time evolution of the related unstable systems.\n\nContents\n1. Introduction\n2. Preliminaries\n3. A progenitor: Friedrichs model\n4. Resonances from perturbed symmetry\n5. Point contacts\n6. More about the decay laws\n7. Quantum graphs\n8. High-energy behavior of quantum-graph resonances\n9. Leaky graphs: a caricature of quantum wire and dots\n10. Generalized graphs\nReferences\n\n1\n2\n4\n7\n12\n20\n26\n35\n42\n46\n51\n\n1. Introduction\nAny general physical theory deals not only with objects as they are but also\nhas to ask how they emerge and disappear in the time evolution and what one\ncan learn from their temporary existence. In the quantum realm such processes\nare even more important than in classical physics. With few notable exceptions\nthe elementary particles are unstable and also among nuclei, atoms and molecules\nunstable systems widely outnumber stable ones, even if the lack of permanence is a\n1991 Mathematics Subject Classification. Primary 81Q80; Secondary 35Q40, 81Q35, 81U15.\nKey words and phrases. Open systems, resonances, decay law, complex scaling, perturbation\ntheory, solvable models, contact interactions, quantum graphs, geometric scatterers.\nThe project was partially supported by the Czech Science Foundation project P203/11/0701.\n1\n\n\f2\n\nPAVEL EXNER\n\nrelative notion - it is enough to recall that the observed lifetime scale of particles\nand nuclei ranges from femtoseconds to geological times.\nIt is natural that the quantum theory had to deal with such temporarily existent\nobjects already in its nascent period, and it did it using simple means suggested by\nthe intuition of the founding fathers. As time went, of course, a need appeared for\na better understanding of these phenomena even if there was no substantial doubt\nabout their mechanism; one can cite. e.g., a critical discussion of the textbook\nderivation of the 'Fermi golden rule' [Fe, lecture 23] in [RS, notes to Sec. XII.6],\nor the necessarily non-exponential character of decay laws [Ex, notes to Sec. I.3]\nwhich surprisingly keeps to puzzle some people to this day.\nThe quest for mathematically consistent description of resonance effects brought\nmany results. It is worth to mention that some of them were rather practical.\nMaybe the best example of the last claim is the method of determining resonance\npoles using the so-called complex scaling. It has distinctively mathematical roots, in\nparticular, in the papers [AC71, BC71, Si79], however, its applications in molecular physics were so successful that people in this area refer typically to secondary\nsources such as [Mo98] instead giving credit to the original authors.\nDescription of resonances and unstable system dynamics is a rich subject with\nmany aspects. To grasp them in their full complexity it is useful to develop a variety\nof tools among which an important place belongs to various solvable models of such\nsystems. Those are the main topic of the present review paper which summarizes\nresults obtained in this area over a long time period by various people including\nthe author and his collaborators. As a caveat, however, one has say also that the\nsubject has so many aspects that a review like this one cannot cover all of them;\nour ambition is to give just a reasonably complete picture. We also remain for\nthe moment vague about what the adjective 'solvable' could mean in the present\ncontext; we will return to this question in Section 5 below.\n2. Preliminaries\nBefore starting the review it is useful to recall some notions we will need frequently in the following. Let us start with resonances. While from the physics\npoint of view we usually have in mind a single phenomenon when speaking of a\nresonance in a quantum system, mathematically it may refer to different concepts.\nWe will describe two most important definitions starting from that of a resolvent resonance. A conservative quantum system is characterized by a family of\nobservables represented by self-adjoint operators on an appropriate state Hilbert\nspace. A prominent role among them is played by its Hamiltonian H, or operator\nof total energy. As a self-adjoint operator it has the spectrum which is a subset of\nthe real line while the rest of the complex plane belongs to its resolvent set %(H)\nand the resolvent z 7→ (H − z)−1 is an analytic function on it having thus no singularities. It may happen, however, that it has an analytic continuation, typically\nacross the cut given by the continuous spectrum of H - one usually speaks in this\nconnection about another sheet of the 'energy surface' - and that this continuation\nis meromorhic having pole singularities which we identify with resonances.\nAn alternative concept is to associate resonances with scattering. Given a pair\n(H, H0 ) of self-adjoint operators regarded as the full and free Hamiltonian of the\nsystem we can construct scattering theory in the standard way [AJS, RS], in\nparticular, we can check existence of the scattering operator and demonstrate that\n\n\fSOLVABLE MODELS OF RESONANCES AND DECAYS\n\n3\n\nit can be written in the form of a direct integral, the corresponding fiber operators\nbeing called on-shell scattering matrices. The latter can be extended to meromorhic\nfunction and resonances are identified in this case with their poles.\nWhile the resonances defined in the two above described ways often coincide,\nespecially in the situations when H = −∆ + V is a Schrödinger operator and H0 =\n−∆ its free counterpart, there is no a priori reason why it should be always true; it\nis enough to realize that resolvent resonances characterize a single operator while\nthe scattering ones are given by a pair of them. Establishing equivalence between\nthe two notions is usually one of the first tasks when investigating resonances.\nIn order to explain how resonances are related to temporarily existing objects\nwe have to recall basic facts about unstable quantum systems. To describe such a\nsystem we must not regard it as isolated, rather as a part of a larger system including\nits decay products. We associated with the latter a state space H on which unitary\nevolution operator U : U (t) = e−iHt related to a self-adjoint Hamiltonian H acts.\nThe unstable system corresponds to a proper subspace Hu ⊂ H associated with\na projection Eu . To get a nontrivial model we assume that Hu is not invariant\nw.r.t. U (t) for any t > 0; in that case we have kEu U (t)ψk < kψk for ψ ∈ Hu and\nthe state which is at the initial instant t = 0 represented by the vector ψ evolves\ninto a superposition containing a component in Hu⊥ describing the decay products.\nEvolution of the unstable system alone is determined by the reduced propagator\nV : V (t) = Eu U (t) |\\ Hu ,\nwhich is a contraction satisfying V (t)∗ = V (−t) for any t ∈ R, strongly continuous\nwith respect to the time variable. For a unit vector ψ ∈ Hu the decay law\nPψ : Pψ (t) = kV (t)ψk2 = kEu U (t)ψk2\n\n(2.1)\n\nis a continuous function such that 0 ≤ Pψ (t) ≤ Pψ (0) = 1 meaning the probability\nthat the system undisturbed by measurement with be found undecayed at time t.\nUnder our assumptions the reduced evolution cannot be a group, however, it\nis not excluded that it has the semigroup property, V (s)V (t) = V (s + t) for all\ns, t ∈ R. As a example consider the situation where Hu is one-dimensional being\nspanned by a unit vector ψ ∈ H and the reduced propagator is a multiplication by\nZ\nv(t) := (ψ, U (t)ψ) =\ne−iλt d(ψ, EλH ψ) ,\nR\n\nEλH\n\nwhere\n= EH (−∞, λ] is the spectral projection of H. If ψ and H are such that\n\u0002\n\u0003−1\nΓ\n(λ − λ0 )2 + 14 Γ2\ndλ for\nthe measure has Breit-Wigner shape, d(ψ, EλH ψ) = 2π\nsome λ0 ∈ R and Γ > 0, we get v(t) = e−iλ0 t−Γ|t|/2 giving exponential decay law.\nNote that the indicated choice of the measure requires σ(H) = R; this conclusion\nis not restricted to the one-dimensional case but it holds generally.\nTheorem 2.1. [Si72] Under the stated assumptions the reduced propagator can\nhave the semigroup property only if σ(H) = R.\nAt a glance, this seems to be a problem since the exponential character of the\ndecay laws conforms with experimental evidence in most cases, and at the same\ntime Hamiltonians are usually supposed to be below bounded. However, such a\nspectral restriction excludes only the exact validity of semigroup reduced evolution\nallowing it to be an approximation, possibly a rather good one. To understand\nbetter its nature, let us express the reduced evolution by means of the reduced\n\n\f4\n\nPAVEL EXNER\n\nu\nresolvent, RH\n(z) := Eu RH (z) |\\ Hu . Using the spectral decomposition of H we can\nwrite the reduced propagator as Fourier image,\nZ\n(2.2)\nV (t)ψ =\ne−iλt dFλ ψ\nR\n\nfor any ψ ∈ Hu , of the operator-valued measure on R determined by the relation\n(H)\nF (−∞, λ] := Eu Eλ |\\ Hu . By Stone formula, we can express the measure as\nZ λ2\n\u0002 u\n\u0003\n1\b\n1\nu\nF [λ1 , λ2 ] + F (λ1 , λ2 ) =\ns lim\nRH (ξ +iη) − RH\n(ξ −iη) dξ ;\nη→0+\n2\n2πi\nλ1\nthe formula simplifies if the spectrum is purely absolutely continuous and the lefthand side can be simply written as F (λ1 , λ2 ). The support of F (*)ψ\nS is obviously contained in the spectrum of H and the same is true for supp F = ψ∈Hu supp F (*)ψ,\nif fact, the latter coincides with σ(H) [Ex76].\nIn view of that the reduced resolvent makes no sense at the points ξ ∈ supp F\nu\n(ξ ± iη) may exist; if they are bounded on the interval\nbut the limits s limη→0+ RH\n(λ1 , λ2 ) we may interchange the limit with the integral. Furthermore, since the\nu\n(*). At the points\nresolvent is analytic in ρ(H) = C \\ σ(H) the same is true for RH\nof supp F it has a singularity but it may have an analytic continuation across it;\nthe situation is particularly interesting when this continuation has a meromorphic\nstructure, i.e. isolated poles in the lower halfplane. For the sake of simplicity\nconsider again the situation with dim Hu = 1 when the reduced resolvent acts as a\nu\n(z) and suppose its continuation has a single pole,\nmultiplication by rH\nA\nu\n(2.3)\nrH\n(z) =\n+ f (z)\nzp − z\nfor Im z > 0, where A 6= 0, f is holomorphic, and zp := λp − iδp is a point in the\nu\nu (λ+iη), the measure in question is\n(λ−iη) = rH\nlower halfplane. Since rH\n\u0012\n\u0013\nA\n1\n1\n1\ndFλ =\n−\ndλ + Im f (λ) dλ ,\n2πi λ−z p\nλ−zp\nπ\nand evaluating the reduced propagator using the residue theorem we get\nZ\n1\n(2.4)\nv(t) = A e−iλp t−δp |t| +\ne−iλt Im f (λ) dλ ,\nπ R\nwhich is close to a semigroup, giving an approximately exponential decay law with\nΓ = 2δp , if the second term is small and A does not differ much from one. At the\nsame time, the presence of the pole in the analytic continuation provides a link to\nthe concept of (resolvent) resonance quoted above.\nThe main question in investigation of resonances and decays is to analyze how\nsuch singularities can arise from the dynamics of the systems involved. A discussion\nof this question in a variety of models will be our main topic in the following sections.\n3. A progenitor: Friedrichs model\nWe start with the mother of all resonance models for which we are indebted\nto Kurt O. Friedrichs who formulated it in his seminal paper [Fr48]. This is not\nto say it was recognized as seminal immediately, quite the contrary. Only after\nT.D. Lee six years later came with a caricature model of decay in quantum field\ntheory, it was slowly recognized that its essence was already analyzed by Friedrichs;\nreferences to an early work on the model can be found in [Ex, notes to Sec. 3.2].\n\n\fSOLVABLE MODELS OF RESONANCES AND DECAYS\n\n5\n\nThe model exists in numerous modifications; we describe here the simplest one.\nWe suppose that the state Hilbert space of the system has the form H := C⊕L2 (R+ )\nwhere the one-dimensional subspace is identified with\nthe space Hu mentioned\n\u0001\nabove; the states are thus described by the pairs αf with α ∈ C and f ∈ L2 (R+ ).\nThe Hamiltonian is the self-adjoint operator on H, or rather the family of selfadjoint operators labelled by the coupling constant g ∈ R, defined by\n\u0012 \u0013\n\u0012\n\u0013\nα\nλ0 α g(v, f )\n(3.1)\nHg = H0 + gV , Hg\n:=\n,\ngαv\nQf\nf\nwhere λ0 is a positive parameter, v ∈ L2 (R+ ) is sometimes called form factor, and\nQ is the operator of multiplication, (Qf )(ξ) = ξf (ξ). This in particular means that\nthe continuous spectrum of H0 covers the positive real axis and the eigenvalue λ0 is\nembedded in it; one expects that the perturbation gV can move the corresponding\nresolvent pole from the real axis to the complex plane.\nTo see that it is indeed the case we have to find the reduced resolvent. The\nmodel is solvable in view of the Friedrichs condition, Ed V Ed = 0 where Ed is the\nprojection to Hd := L2 (R+ ), which means that the continuum states do not interact\nmutually. Using the second resolvent formula and the commutativity of operators\nEu and RH0 (z) together with Eu + Ed = I we can write Eu RHg (z)Eu as\nEu RH0 (z)Eu − gEu RH0 (z)Eu V Eu RHg (z)Eu − gEu RH0 (z)Eu V Ed RHg (z)Eu ;\nin a similar way we can express the 'off-diagonal' part of the resolvent as\nEd RHg (z)Eu = −gEd RH0 (z)Ed V Eu RHg (z)Eu ,\nwhere we have also employed the Friedrichs condition. Substituting from the last\nrelation to the previous one and using (H0 − z)Eu RH0 (z) = Eu together with the\nu\n(z) acts for Im z 6= 0 on\nexplicit form of the operators H0 , V , we find that RH\ng\nHu = C as multiplication by the function\n\u0013−1\n\u0012\nZ ∞\n|v(λ)|2\ndλ\n.\n(3.2)\nrgu : rgu (z) := −z + λ0 + g 2\nz−λ\n0\nTo make use of this result we need an assumption about the form factor, for instance\n(a) there is an entire f : C → C such that |v(λ)|2 = f (λ) holds for all λ ∈ (0, ∞) ;\nfor the sake of notational simplicity one usually writes f (z) = |v(z)|2 for nonreal\nz too keeping in mind that it is a complex quantity. This allows us to construct\nanalytic continuation of rgu (*) over σc (Hg ) = R+ to the lower complex halfplane in\nthe form r(z) = [−z + w(z, g)]−1 , where\n(3.3)\n\nw(λ, g) := λ0 + g 2 I(λ) − πig 2 |v(λ)|2\nZ ∞\n|v(ξ)|2\n2\nw(z, g) := λ0 + g\ndξ − 2πig 2 |v(z)|2\nz−ξ\n0\n\n...\n\nλ>0\n\n...\n\nIm z < 0\n\nand I(λ) is defined as the principal value of the integral,\nZ ∞\nZ λ−ε Z ∞ !\n|v(ξ)|2\n|v(ξ)|2\nI(λ) := P\ndξ := lim\n+\ndξ ;\nε→0+\nλ−ξ\nλ−ξ\n0\n0\nλ+ε\nthe analyticity can be checked using the edge-of-the-wedge theorem .\nThese properties of the reduced resolvent make it possible to prove the meromorphic structure of its analytic continuation. Resonances in the model are then\n\n\f6\n\nPAVEL EXNER\n\ngiven by zeros of the function z 7→ w(z, g) − z. An argument using the implicitfunction theorem [Ex, sec. 3.2] leads to the following conclusion:\nTheorem 3.1. Assume (a) and v(λ0 ) =\n6 0, then r(*) has for all sufficiently\nsmall |g| exactly one simple pole zp (g) := λp (g) − iδp (g). The function zp (*) is\ninfinitely differentiable and the expansions\n(3.4)\n\nλP (g) = λ0 + g 2 I(λ0 ) + O(g 4 ) ,\n\nδp (g) = πg 2 |v(λ0 )|2 + O(g 4 ) ,\n\nare valid in the vicinity of the point g = 0 referring to the unperturbed Hamiltonian.\nTo summarize the above reasoning we have seen that resonance poles can arise\nfrom perturbation of eigenvalues embedded in the continuous spectrum and that,\nat least locally, their distance from the real axis is the smaller the weaker is the\nperturbation. Moreover, one observes here the phenomenon called spectral concentration: it is not difficult to check that the spectral projections of Hg to the\nintervals Ig := (λ0 − βg, λ0 − βg) with a fixed β > 0 satisfy the relation\ns lim EHg (Ig ) = Eu .\ng→0\n\nFriedrichs model also allows us to illustrate other typical features of resonant systems. We have mentioned already the deep insight contained in the Fermi golden\nrule, which in the present context can be written as\n\u0011\nd \u0010\n(0)\nΓF (g) = 2πg 2\nV ψu , Eλ Pc (H0 )V ψu\n,\ndλ\nλ=λ0\n(0)\n\nwhere {Eλ } is the spectral decomposition of H0 and Pc (H0 ) the projection to the\ncontinuous spectral subspace of this operator. To realize that this is indeed what we\nknown from quantum-mechanical textbooks, it is enough to realize that we use the\n(0)\nd\nEλ Pc (H0 ) = |λihλ|. Using the explicit\nconvention ~ = 1 and formally it holds dλ\nform of the operators involved we find\nZ λ\nd\nΓF (g) = 2πg 2\n|v(ξ)|2 dξ\n= 2πg 2 |v(λ0 )|2 ,\ndλ 0\nλ=λ0\nwhich is nothing else than the first nonzero term in the Taylor expansion (3.4). On\nthe other hand, a formal use of the rule may turn its gold into brass: a warning\nexample concerning the situation when the unperturbed eigenvalue is situated at\nthe threshold of σc (H0 ) is due to J. Howland [Ho74], see also [Ex, Example 3.2.5].\nRecent analysis of near-threshold effects in a generalized Friedrichs model together\nwith a rich bibliography can be found in [DJN11].\nResonances discussed so far have been resolvent resonances. One can also\nconsider the pair (Hg , H0 ) as a scattering system. Existence and completeness of\nthe wave operators is easy to establish since the perturbation gV has rank two.\nWhat we are interested in is the on-shell S-matrix: if v is piecewise continuous and\nbounded in R+ one can check [Ex, Prop. 3.2.6] that it acts as multiplication by\nS(λ) = 1 + 2πig 2 lim |v(λ)|2 ru (λ + i\u000f) .\n\u000f→0+\n\nIf v satisfies in addition the assumption (a) above, the function S(*) can be analytically continued across R+ . It is obvious that if such a continuation has a pole at a\npoint zp of the lower complex halfplane, the same is true for r(*), on the other hand,\nit may happen that a resolvent resonance is not a scattering resonance, namely if\nthe continuation of |v(*)|2 has a zero at the point zp .\n\n\fSOLVABLE MODELS OF RESONANCES AND DECAYS\n\n7\n\nFinally, the model can also describe a decaying system if\n\u0001 we suppose that at\nthe initial instant t = 0 the state is described by the vector 10 which span the onedimensional subspace Hu . The main question here is whether one can approximate\nthe reduced evolution by a semigroup in the sense of (2.4); a natural guess is that\nit should be possible in case of a weak coupling. Since the reduced resolvent is\nof the form (2.3) we can express the corresponding measure, calculate the reduced\npropagator according to (2.2) and estimate the influence of the second term in (2.4).\nThis leads to the following conclusion, essentially due to [De76]:\nTheorem 3.2. Under the stated assumptions there are positive C, g0 such that\nCg 2\nt\nholds for all t > 0 and |g| < g0 with A := [1 − g 2 I 0 (zp )]−1 , where I(z) is the integral\nappearing in the second one of the formulae (3.3).\nv(t) − A e−izp t <\n\nThe simple Friedrichs model described here has many extensions and in no way\nwe intend to review and discuss them here limiting ourselves to a few brief remarks:\n(a) Some generalization of the model cast it into a more abstract setting, cf. for\nexample [Mo96, DR07, DJN11]. Others are more 'realistic' regarding it as\na description of a system interacting with a field, either a caricature one-mode\none [DE87-89] or considerably closer to physical reality [BFS98, HHH08] in\na sense returning the model to its Lee version which stimulated interest to it.\n(b) Friedrichs model clones typically use the simple procedure - attributed to\nSchur or Feshbach, and sometimes also to other people - we employed to\nget relation (3.2) expressing projection of the resolvent to the subspace Hu ;\nsometimes it is combined with a complex scaling.\n(c) While most Friedrichs-type models concern perturbations of embedded eigenvalues some go further. As an example, let us mention a caricature model of a\ncrystal interacting with a field [DEH04] in which the unperturbed Hamiltonian has a spectral band embedded in the continuous spectrum halfline referring\nto states of a lower band plus a field quantum. The perturbation turns the\nembedded band into a curve-shaped singularity in the lower complex halfplane\nwith endpoints at the real axis. One can investigate in this framework decay\nof 'valence-band' states analogous to Theorem 3.2, etc.\n(d) The weak-coupling behavior described in Theorem 3.2 can be viewed also from\na different point of view, namely that the decay law converges to a fixed exponential function as g → 0 when we pass to the rescaled time t0 = g −2 t. This is\nusually referred to as van Hove limit in recognition of the paper [vH55]; the\nfirst rigorous treatment of the limit belongs to E.B. Davies, cf. [Da].\n4. Resonances from perturbed symmetry\nThe previous section illustrates the most common mechanism of resonance\nemergence, namely perturbations of eigenvalues embedded in the continuum. A\ntypical source of embedded eigenvalues is a symmetry of the system which prevents\ntransitions from the corresponding localized state into a continuum one. Once such\na symmetry is violated, resonances usually occur. Let us demonstrate that in a\nmodel describing a Schrödinger particle in a straight waveguide, perturbed by a\npotential or by a magnetic field, the idea of which belongs to J. Nöckel [Nö92].\n\n\f8\n\nPAVEL EXNER\n\n4.1. Nöckel model. We consider two-dimensional 'electrons' moving in a\nchannel with a potential well. The guide is supposed to be either a hard-wall\nstrip Ω := R × S with S = (−a, a), or alternatively the transverse confinement can\nbe modelled by a potential in which case we have S = R. The full Hamiltonian\nacting on H := L2 (Ω) is given by\n(4.1)\n\n2\n\nH(B, λ) := (−i∂x − By) + V (x) − ∂y2 + W (y) + λU (x, y) ;\n\nif Ω is a strip of width 2a the transverse potential W may be absent and we\nimpose Dirichlet conditions at the boundary, |y| = a. The real-valued functions V\ndescribing the well in the waveguide - or a caricature quantum dot if you wish\n- and W are measurable, and the same is true for the potential perturbation\nU ; further hypotheses will be given below. The number B is the intensity of the\nhomogeneous magnetic field perpendicular to Ω to which the system is exposed.\nThe unperturbed Hamiltonian H(0) := H(0, 0) can be written in the form\nhV ⊗ I + I ⊗ hW which means its spectrum is the 'sum' of the corresponding\ncomponent spectra. If the spectrum of the transverse part hW is discrete the\nembedded eigenvalues can naturally occur; we are going to see what happens with\nthem under influence of the potential perturbation λU and/or the √\nmagnetic field.\nLet us first list the assumptions using the common notation hxi := 1+x2 .\n(a) lim|x|→∞ W (x) = +∞ holds if S = R ,\nR\n(b) V 6= 0 and |V (x)| ≤ const hxi−2−ε for some ε > 0, with R V (x) dx ≤ 0 ,\n(c) the potential V extends to a function analytic in Mα0 := {z ∈ C : | arg z| ≤ α0 }\nfor some α0 > 0 and obeys there the bound of assumption (b),\n(d) |U (x, y)| ≤ const hxi−2−ε holds for some ε > 0 and all (x, y) ∈ Ω. In addition,\nit does not factorize, U (x, y) 6= U1 (x)+U2 (y), and U (*, y) extends for each fixed\ny ∈ S to an analytic function in Mα0 satisfying there the same bound.\nThe assumption (a) ensures that the spectrum of hW := −∂y2 + W (y), denoted\nas {νj }∞\nj=1 , is discrete and simple, νj+1 > νj . The same is true if S = (−a, a)\nwhen we impose Dirichlet condition at y = ±a, naturally except the case when W\ngrows fast enough as y → ±a to make the operator essentially self-adjoint. The\nassumption (b) says, in particular, that the local perturbation responsible for the\noccurrence of localized states is short-ranged and non-repulsive in the mean; it is\nwell known that in this situation the longitudinal part hV := −∂x2 + V (x) of the\nunperturbed Hamiltonian has a nonempty discrete spectrum,\nμ1 < μ2 < * * * μN < 0 ,\nwhich is simple and finite [Si76, BGS77]; the corresponding normalized eigenfunctions φn , n = 1, . . . , N , are exponentially decaying.\nTo be able to treat the resonances we need to adopt analyticity hypotheses\nstated in assumptions (c) and (d). Note that in addition to the matter of our interest\nthe system can also have 'intrinsic' resonances associated with the operator hV ,\nhowever, the corresponding poles do not approach the real axis as the perturbation\nis switched off. In addition, they do not accumulate except possibly at the threshold\n[AC71], and if V decays exponentially even that is excluded [Je78, Lemma 3.4].\nSince σc (hV ) = [0, ∞), the spectrum of the unperturbed Hamiltonian consists\nof the continuous part, σc (H(0)) = σess (H(0)) = [ν1 , ∞), and the infinite family of\neigenvalues\nσp (H(0)) = { μn +νj : n = 1, . . . , N , j = 1, 2, . . . } .\n\n\fSOLVABLE MODELS OF RESONANCES AND DECAYS\n\n9\n\nA finite number of them are isolated, while the remaining ones satisfying the condition μn + νj > ν1 are embedded in the continuum; let us suppose for simplicity\nthat they coincide with none of the thresholds, μn + νj 6= νk for any k.\nTo analyze the resonance problem it is useful to employ the transverse-mode\ndecomposition, in other words, to replace the original PDE problem by a matrix\nODE one. Using the transverse eigenfunctions, hW χj = νj χj , we introduce the\nembeddings Jj and their adjoints acting as projections by\nJj : L2 (R) → L2 (Ω) ,\n\nJj f = f ⊗ χj ,\n\nJj∗\n\n(Jj∗ g)(x) = (χj , g(x, *))L2 (S) ;\n\n2\n\n2\n\n: L (Ω) → L (R) ,\n\nthen we replace H(B, λ) by the matrix differential operator {Hjk (B, λ)}∞\nj,k=1 with\n\u0001\nHjk (B, λ) := Jj∗ H(B, λ)Jk = −∂x2 + V (x) + νj δjk + Ujk (B, λ) ,\n(1)\n\n(2)\n\nUjk (B, λ) := 2iB mjk ∂x + B 2 mjk + λUjk (x) ,\nR\nR\n(r)\nwhere mjk := S y r χj (y)χk (y) dy and Ujk (x) := S U (x, y)χj (y)χk (y) dy.\n4.2. Resonances by complex scaling. Nöckel model gives us an opportunity to illustrate how the complex scaling method mentioned in the introduction\ncan be used in a concrete situation. We apply here the scaling transformation to\nthe longitudinal variable starting from the unitary operator\nSθ : (Sθ ψ)(x, y) = eθ/2 ψ(eθ x, y) ,\n\nθ ∈ R,\n\nand extending this map analytically to Mα0 which is possible since the transformed\nHamiltonians are of the form Hθ (B, λ) := Sθ H(B, λ)Sθ −1 = Hθ (0) + Uθ (B, λ) with\n(4.2)\n\nHθ (0) := −e−2θ ∂x2 − ∂y2 + Vθ (x) + W (y) ,\n\nwhere Vθ (x) := V (eθx ) and the interaction part\nUθ (B, λ) := 2i e−θ By ∂x + B 2 y 2 + λUθ (x, y)\nwith Uθ (x, y) := U (eθx , y). Thus in view of the assumptions (c) and (d) they\nconstitute a type (A) analytic family of m-sectorial operators in the sense of [Ka] for\n|Im θ| < min{α0 , π/4} . Denoting Rθ (z) := (Hθ (0) − z)−1 one can check [DEM01]\nthat\n(4.3)\n\nkUθ (B, λ)Rθ (ν1 + μ1 − 1)k ≤ c(|B| + |B|2 + |λ|)\n\nholds for |Im θ| < min{α0 , π/4}, and consequently, the operators Hθ (B, λ) also\nform a type (A) analytic family for B and λ small enough. The free part (4.2) of\nthe transformed operator separates variables, hence its spectrum is\n(4.4)\n\nσ (Hθ (0)) =\n\n∞\n[\n\b\n\nνj + σ hVθ\n\n\u0001\n\n,\n\nj=1\n\nwhere hVθ := −e−2θ ∂x2 + Vθ (x). Since the potential is dilation-analytic by assumption, we have a typical picture: the essential spectrum is rotated into the lower\nhalfplane revealing (fully or partly) the discrete spectrum of the non-selfadjoint\noperator hVθ which is independent of θ; we have\n\u0001\n(4.5)\nσ hVθ = e−2θ R+ ∪ {μ1 , . . . , μN } ∪ {ρ1 , ρ2 . . . } ,\n\n\f10\n\nPAVEL EXNER\n\nwhere ρr are the 'intrinsic' resonances of hV . In view of the assumptions (c) and\nμn + νj 6= νk for no k the supremum of Im ρk over any finite region of the complex\nplane which does not contain any of the points νk is negative, hence each eigenvalue\nμn + νj has a neighbourhood containing none of the points ρk + νj 0 . Consequently,\nthe eigenvalues of Hθ (0) become isolated once Im θ > 0. Using the relative boundedness (4.3) we can draw a contour around an unperturbed eigenvalue and apply\nperturbation theory; for simplicity we shall consider only the non-degenerate case\nwhen μn + νj 6= μn0 + νj 0 for different pairs of indices.\nWe fix an unperturbed eigenvalue e0 = μn + νj and choose θ = iβ with a\nβ > 0; then in view of (4.4) and (4.5) we may chose a contour Γ in the resolvent\nset of Hθ (0) which encircles just the eigenvalue e0 . We use the symbol Pθ for the\neigenprojection of Hθ (0) referring to e0 and set\nZ\nRθ (z)\n1\n(p)\ndz\nSθ :=\n2πi Γ (e0 − z)p\n(0)\n\n(1)\n\nfor p = 0, 1, . . . , in particular, Sθ = −Pθ and R̂θ (z) := Sθ is the reduced resolvent\nof Hθ (0) at the point z. The bound (4.3) implies easily\n\u0001−p\n|Γ|\n(p)\nUθ (B, λ)Sθ\n≤c\ndist(Γ, e0 )\n(|B| + |B|2 + |λ|)\n2π\nwith some constant c for all Im θ ∈ (0, α0 ) and p ≥ 0. It allows us to write the\nperturbation expansion. Since e0 = μn + νj holds by assumption for a unique pair\nof the indices, we obtain using [Ka, Sec. II.2] the following convergent series\n∞\nX\n(4.6)\ne(B, λ) = μn + νj +\nem (B, λ) ,\nm=1\n(−1)m\np1 +***+pm =m−1\nm\n\nQm\n(p )\nwhere em (B, λ) =\nTr i=1 Uθ (B, λ)Sθ i . Using the above\nestimate we can estimate\nthe order\u0001of each term with respect to the parameters. We\nPm\nfind em (B, λ) = l=0 O B l λm−l , in particular, we have em (B) = O(B m ), and\nem (λ) = O(λm ) for pure magnetic and pure potential perturbations, respectively.\nThe lowest-order terms in the expansion (4.6) can be computed explicitly. In\nthe non-degenerate case, dim Pθ = 1, we have ej,n\n1 (B, λ) = Tr (Uθ (B, λ)Pθ ). After\na short calculation we can rewrite the expression at the right-hand side in the form\n(2)\n(1)\n2iBmjj (φn , φ0n ) + B 2 mjj + λ (φn , Ujj φn ). Moreover, i (φn , φ0n ) = (φn , i∂x φn ) is\n(up to a sign) the group velocity of the wavepacket, which is zero in a stationary\nstate; recall that eigenfunction φn of hV is real-valued up to a phase factor. In\nother words,\nZ\nZ\n2\n2\n2\n2\n(4.7)\nej,n\n(B,\nλ)\n=\nB\ny\n|χ\n(y)|\ndy\n+\nλ\nU (x, y) |φn (x)χj (y)| dx dy\nj\n1\nP\n\nS\n\nR×S\n\nwith the magnetic part independent of n. As usual in such situations the first-order\ncorrection is real-valued and thus does not contribute to the resonance width.\nThe second term in the expansion (4.6) can be computed in the standard way\n[RS, Sec.XII.6]; taking the limit Im θ → 0 in the obtained expression we get\n∞ \u0010\n\u0010\n\u0011\nX\n\u0001−1 \u0011ˆ\nUjk (B, λ)φn , hV −e0 + νk −i0\nUjk (B, λ)φn .\n(4.8) ej,n\n2 (B, λ) = −\nk=1\n\nWe shall calculate the imaginary part which determines the resonance width in the\nleading order. First we note that it can be in fact expressed as a finite sum. Indeed,\n\n\fSOLVABLE MODELS OF RESONANCES AND DECAYS\n\n11\n\nke0 := max{k : e0 − νk > 0} is finite and nonzero if the eigenvalue e0 is embedded,\n\u0001−1 \u0001ˆ\notherwise we set it equal to zero. It is obvious that Rk := hV −e0 + νk −i0\nis Hermitean for k > ke0 , hence the corresponding terms in (4.8) are real and\nIm ej,n\n2 (B, λ) =\n\nke0\nX\n\n(Ujk (B, λ)φn , (Im Rk )Ujk (B, λ)φn ) .\n\nk=1\n\nThe operators Im Rk can be expressed by a straightforward computation [DEM01].\n\u0002\n\u0003−1\nTo write the result we need ω(z) := I +|V |1/2 (−∂x2 −z)−1 |V |1/2 sgn (V ) , in other\nwords, the inverse to the operator acting as\nZ √\n\u0001\n0\ni|V (x)|1/2\n√\nω −1 (z)f (x) = f (x) +\nei z|x−x | |V (x0 )|1/2 sgn V (x0 ) f (x0 ) dx0 .\n2 z\nR\nσ\n1\nWe also need the trace\n√ operator τE : H → C which acts on the first Sobolev space\n1,2\nσ\nW\nas τE φ := φ̂(σ E) for σ = ± and E > 0 where φ̂ is the Fourier transform\nof φ. Armed with these notions we can write the imaginary part of the resonance\npole position up to higher-order terms as\n\n(4.9)\n\nIm ej,n\n2 (B, λ)\n\n=\n\nke0\nX\nX\nk=1\n\nπ\n√\nτeσ0−νk ω(e0 −νk +i0) Ujk (B, λ)φn\n2\ne\n−ν\n0\nk\nσ=±\n\n2\n\nke0\n\n=\n\nn\nπ\n2\n(1)\n− 2B 2 |mjk |2 τeσ0−νk ω(e0 −νk +i0)φ0n\ne\n−ν\n0\nk\nk=1 σ=±\n\u0010\n\u0011\n(1)\n+2λB mjk Im τeσ0−νk ω(e0 −νk +i0)φ0n , τeσ0−νk ω(e0 −νk +i0)Ujk φn\nXX\n\n√\n\no\nλ2 σ\n2\nτe0−νk ω(e0 −νk +i0) Ujk φn\n+ O(B 3 ) + O(B 2 λ) ,\n2\nwhere as usual f (E + i0) = limε→0+ f (E + iε). Let us summarize the results:\n−\n\nTheorem 4.1. Assume (a)–(d) and suppose that an unperturbed eigenvalue\ne0 = μn +νj > ν1 is simple and coincides with no threshold νk . For small enough B\nand λ the Nöckel model Hamiltonian (4.1) has a simple resonance pole the position\nof which is given by the relations (4.6)–(4.8). The leading order in the expansion\nobtained by neglecting the error terms in (4.9) is the Fermi golden rule in this case.\nThe symmetry in this example is somewhat hidden; it consists of the factorized\nform of the unperturbed Hamiltonian H(0) which makes it reducible by projections\nto subspaces associated with the transverse modes. It is obvious that both the\npotential perturbation - recall that we assumed U (x, y) 6= U1 (x)+U2 (y) - and the\nmagnetic field destroy this symmetry turning thus embedded eigenvalues coming\nfrom higher transverse modes into resonances. At the same time, the described\ndecomposition may include other, more obvious symmetries. For instance, if the\npotential W is even with respect to the strip axis - including the case when\nS = (−a, a) and W = 0 - the unperturbed Hamiltonian commutes with the\ntransverse parity operator, ψ(x, y) 7→ ψ(x, −y), and the transversally odd states\nare orthogonal to the even ones so embedded eigenvalues arise.\nNöckel model is by far not the only example of this type. We limit ourselves here\nto quoting one more. Consider an acoustic waveguide in the form of a planar strip\nof width 2a into which we place an axially symmetric obstacle; the corresponding\n\n\f12\n\nPAVEL EXNER\n\nHamiltonian acts as Laplacian with Neumann condition at the boundary, both of\nthe strip and the obstacle. Due to the axial symmetry the odd\u0001 part of the operator\ngives rise to at least one eigenvalue in the interval 0, 14 ( πa )2 which is embedded\ninto the continuous spectrum covering the whole positive real axis [ELV94]. If the\nobstacle is shifted by ε in the direction perpendicular to the axis, such an eigenvalue\nturns again into a resonance for the position of which one can derive an expansion\nin powers of ε analogous to Theorem 4.1, cf. [APV00].\n5. Point contacts\nThe resonance models discussed in the previous two sections show that we\nshould be more precise speaking about solvable models. The question naturally is\nwhat we have finally to solve when trying to get conclusions such as formulae for\nresonance pole positions. In both cases we have been able to derive weak-coupling\nexpansions with explicit leading terms which could be regarded as confirmation of\nthe Fermi golden rule for the particular model. One have to look, however, into\nwhich sort of problem the search for resonances was turned. For the Friedrichs\nmodel it was the functional equation w(z, g) = z with the left-hand side given by\n(3.3), and a similar claim is true for its clones, while in the Nöckel model case we\nhad to perform spectral analysis of the non-selfadjoint operator1 Hθ (B, λ).\nNot only the latter has been more difficult in the above discussion, the difference\nbecomes even more apparent if we try to go beyond the weak-coupling approximation. Following the pole trajectory over a large interval of coupling parameters\nmay not be easy even if its position is determined by a functional equation and\none have to resort usually to numerical methods, however, it is still much easier\nthan to analyze a modification of the original spectral problem. Recall that for the\nFriedrichs model pole trajectories were investigated already in [Hö58] where it had\nbeen shown, in particular, that for strong enough coupling the pole may return to\nthe (negative part of the) real axis becoming again a bound state.\nIn the rest of this review we will deal with models which are 'solvable' at least\nin the sense of the Friedrichs model, that is, their resonances are found as roots\nof a functional - sometimes even algebraic - equation. In this section we will\ngive examples showing that this is often the case in situations where the interaction\nresponsible for occurrence of the resonances is of point or contact type.\n5.1. A simple two-channel model. The first model to consider here will\ndescribe a system the state space of which has two subspaces corresponding to two\ninternal states; the coupling between them is of a contact nature. To be specific,\none can think of a system consisting of a neutron and a nucleus having just two\nstates, the ground state and an excited one. Their relative motion can be described\nin the Hilbert space L2 (R3 ) ⊕ L2 (R3 ); we suppose that the reduced masses is the\ntwo channels are the same and equal to 12 so that the Hamiltonian acts on functions\nsupported away from the origin of the coordinates as −∆ and −∆+E, respectively,\nwhere E > 0 is the energy difference between the ground and the excited states.\nBefore proceeding further, let us note that the above physical interpretation\nof the model coming from [Ex91] is not the only possible. The two channels can\n1The same is true also for most 'realistic' descriptions of resonances using complex scaling,\nin particular, in the area of atomic and molecular physics - see, e.g., [RS, Sec. XII.6] or [Mo98].\n\n\fSOLVABLE MODELS OF RESONANCES AND DECAYS\n\n13\n\nbe alternatively associated, for instance, with two spin states; this version of the\nmodel was worked out in [CCF09], also in dimensions one and two.\nTo construct the Hamiltonian we start from the direct sum A0 = A0,1 ⊕ A0,2\nwhere the component operators act as A0,1 := −∆ and A0,2 := −∆ + E, respectively, being defined on W 2,2 (R3 \\ {0}). It is not difficult to check that A0 is a\nsymmetric operator with deficiency indices (2, 2); we will choose the model Hamiltonian among its self-adjoint extensions. The analysis can be simplified using the\nrotational symmetry, since the components of A0 referring to nonzero values of the\nangular momentum are essentially self-adjoint, and therefore a nontrivial coupling\nis possible in the s-wave only. As usual we pass to reduced radial wave functions\nf : f (r) := rψ(r) ; we take H = H1 ⊕ H2 with Hj := L2 (R+ ) as the state space of\nthe problem. The construction starts from the operator H0 = H0,1 ⊕ H0,2 , where\nd2\nd2\n, H0,2 := − 2 + E , D(H0,j ) = W02,2 (R+ ) ,\n2\ndr\ndr\nwhich has again deficiency indices (2, 2) and thus a four-parameter family of selfadjoint extensions. They\u0001 can be characterized by means of boundary conditions:\nfor each matrix A = ac̄ bc with a, b ∈ R and c ∈ C we denote by HA the operator\ngiven by the same differential expression as H0 with the domain D(HA ) ⊂ D(H0∗ ) =\nW 2,2 (R+ ) ⊕ W 2,2 (R+ ) specified by the conditions\nH0,1 := −\n\n(5.1)\n\nf10 (0) = af1 (0) + cf2 (0) ,\n\nf20 (0) = c̄f1 (0) + bf2 (0) ;\n\nit is easy to check that any such HA is a self-adjoint extension of H0 . There may be\nother extensions, say, with decoupled channels corresponding to a = ∞ or b = ∞\nbut it is enough for us to consider 'most part' of them given by (5.1).\nIf the matrix A is real the operator HA is invariant with respect to time reversal. The channels are not coupled if c = 0 ; in that case HA = Ha ⊕ Hb\nwhere the two operators correspond to the s-wave parts of the point-interaction\nHamiltonians Hα,0 and Hβ,0 in the two channels [AGHH] with the interaction\na\nb\nstrengths α := 4π\nand β := 4π\n, respectively, and its spectrum is easily found. To\ndetermine σ(HA ) in the coupled case, we have to know its resolvent which can be\ndetermined by means of Krein's formula using the integral kernel GD (r, r0 ; k) =\n0\n0 \u0001\n0\n√\nik|r+r 0 |\n−eik|r−r | eiκ|r+r | −eiκ|r−r |\ndiag e\n,\n, where κ := k 2 −E, of the operator HD\n2ik\n2iκ\nwith Dirichlet decoupled channels. The kernel of (HA −z)−1 for z ∈ ρ(HA ) equals\n\u0012\n\u0013\n0\n0\n(b−iκ) eik(r+r )\n− c e(ikr+κr )\nGA (r, r0 ; k) = GD (r, r0 ; k) + D(k)−1\n,\n0\n0\n− c̄ ei(κr+kr )\n(a−ik) eiκ(r+r )\n√\nwhere as usual k := z and D(k) := (a−ik)(b−iκ) − |c|2 .\nIt is straightforward to check that pole singularities of the above the resolvent\ncan come only from zeros\nof the 'discriminant' D(k). In the decoupled case, i.e. if\n\u0001\na 0\nc = 0 and A0 = 0 b , the expression factorizes, and consequently, it vanishes iff\nk = −ia or κ = −ib. Several different situations may arise:\n• If a < 0 the operator HA0 has eigenvalue −a2 corresponding to the eigenfunction\n√\nar \u0001\nf (r) = −2a e0 while for a ≥ 0 the pole now corresponds to a zero-energy\nresonance or an antibound state\n√\n\u0001\n• If b < 0, then HA0 has eigenvalue E − b2 corresponding to f (r) = −2b e0br ,\notherwise it has a zero-energy resonance or an antibound state.\n\n\f14\n\nPAVEL EXNER\n\nThe continuous spectrum of the decoupled operator covers the positive real axis\nbeing simple in [0, E) and of multiplicity two in [E, ∞). We are interested mainly\nin the case when both a, b are negative and b2 < E ; under the last condition the\neigenvalue of Hb is embedded in the continuous spectrum of Ha .\nLet us next turn to the interacting case, c 6= 0. Since the deficiency indices of\nH0 are finite, the essential spectrum is not affected by the coupling. To find the\neigenvalues and/or resonances of HA , we have to solve the equation\n\u0011\n\u0010\np\n(5.2)\n(a−ik) b−i k 2 −E = |c|2 .\nIt reduces to a quartic equation, and can therefore be solved in terms of radicals;\nfor simplicity we limit ourselves to the weak-coupling case when one can make the\nfollowing conclusion [Ex91].\n\u0001\nTheorem 5.1. (a) Let σp HA0 be simple, −a2 6= E −b2 , then the perturbed\nfirst-channel bound/antibound state behaves for small |c| as\n√\na2 − E − b a2 + E\n2a|c|2\n4\n6\n2\n√\n+√\ne1 (c) = −a +\n√\n\u00013 |c| + O(|c| ) .\nb + a2 + E\na2 + E b + a2 + E\nIn particular, zero-energy resonance corresponding to a = 0 turns into√an antibound\nstate if HA0 has an isolated eigenvalue in the second channel, b < − E, and into\na bound state otherwise.\n(b) Under the same simplicity\nassumption, if HA0 has isolated eigenvalue in the\n√\nsecond channel, b < − E , the perturbation shifts it as follows\n√\n2b|c|2\nb2 + E − a b2 −E\n2\n4\n6\n√\ne2 (c) = E − b +\n+√\n√\n\u00013 |c| + O(|c| ) .\na + b2 −E\nb2 −E a + b2 −E\n√\nOn the other hand, if HA0 has embedded eigenvalue, − E < b < 0, it turns under\nthe perturbation into a pole of the analytically continued resolvent with\nRe e2 (c) = E − b2 +\n\n2ab|c|2\n+ O(|c|4 ) ,\na2 −b2 + E\n\n√\n2b|c|2 E −b2\nIm e2 (c) =\n+ O(|c|4 ) .\na2 −b2 + E\n\n√\n(c) Finally, let HA0 have an isolated eigenvalue of multiplicity two, b = − a2 + E,;\nthen under the perturbation it splits into\n√ p\n2a4 + 4a2 E +E 2 2\n4\ne1,2 (c) = −a2 ∓ 2 −a a2 + E |c| +\n|c| + O(|c|3 ) .\n2a(a2 + E)3/2\nThe model can be investigated also from the scattering point of view. Since\nthe couplings is a rank-two perturbation of the free resolvent, the existence and\ncompleteness of the wave operators Ω± (HA , HA0 ) follow from Birman-Kuroda theorem [RS, Sec. XI.3]. It is also easy to check that the scattering is asymptotically\ncomplete, what is more interesting is the explicit form of the S-matrix. To find it\n\u0001T\nwe look for generalized eigenfunctions of the form f (r) = e−ikr −Aeikr , Beiκr\nwhich belong locally to the domain of HA . Using boundary conditions (5.1) we find\nA = S0 (k) =\n\n(a+ik)(b−iκ) − |c|2\n,\nD(k)\n\nB=\n\n2ikc̄\n.\nD(k)\n\n\fSOLVABLE MODELS OF RESONANCES AND DECAYS\n\n15\n\nIf the second channel is closed, k 2 ≤ E, the scattering is elastic, |A| = 1. We are\ninterested primarily in the case when HA0 has an embedded eigenvalue which turns\nunder the perturbation into a resonant state whose lifetime is\nT (c) := −\n\n\u0001\na2 −b2 + E\n√\n1 + O(|c|2 ) ;\n2\n2\n4b|c| E −b\n\ninspecting the phase shift we see that it has a jump by π in the interval of width of\nthe order 2 Im e2 (c) around Re e2 (c). More specifically, writing the on-shell S-matrix\nconventionally through the phase shift as S0 (k) = e2iδ0 (k) we have\n√\nk(b+ E −k 2 )\n√\nδ0 (k) = arctan\na(b + E −k 2 ) − |c|2\n\n(mod π) .\n\nThe resonance is then seen as a local change of the transmission probability (and\nrelated quantities such as the scattering cross section), the sharper it is the closer\nthe pole is to the real axis. This is probably the most common way in which\nresonances are manifested, employed in papers too numerous to be quoted here.\nOn the other hand, if the second channel is open, k 2 > E, the reflection and\ntransmission amplitudes given above satisfy |A|2 + κk |B|2 = 1. The elastic scattering\nis now non-unitary since B 6= 0 which means that the 'nucleus' may now leave the\ninteraction region in the excited state. The said relation between the amplitudes\ncan alternatively be written as |S0,1→1 (k)|2 + |S0,1→2 (k)|2 = 1 which is a part of\nthe full two-channel S-matrix unitarity condition.\nThe model also allows us to follow the time evolution of the resonant state,\nin particular, to analyze the pole approximation (2.4) in this particular case. The\nnatural choice for the 'compound nucleus' wave function is the eigenstate of the\nunperturbed Hamiltonian,\n\u0013\n\u0012\n√\n0\n.\n(5.3)\nf : f (r) = −2b\nebr\nUsing the explicit expression of the resolvent we find\n(f, (HA −k 2 )−1 f ) =\n\n|c|2 + (a−ik)(b+iκ)\n\u0002\n\u0003.\n(b+iκ)2 |c|2 − (a−ik)(b−iκ)\n\nThe reduced evolution is given by (2.2); using the last formula, evaluating the\nintegral by means of the residue theorem and estimating the remainder we arrive\nafter a straightforward computation to the following conclusion [Ex91].\n√\nTheorem 5.2. Assume a 6= 0 and − E < b < 0. The reduced propagator of\nthe resonant state (5.3) is given by\n(\n\"\n2\n2\n2\n2(|a|−a)b\nib\n√\nvA (t) = e−ik2 t − |c|2\ne−ik1 t + √\ne−ik2 t\n2\n2\n2\n(a2 −b2 + E)2\nE −b (a − i E −b )\n#)\nZ ∞\n2\n\u0001\n4b −πi/4\nz 2 e−z t dz\n+\ne\n1 + O(|c|2 )\n2\n2\n2\n2\n2\nπ\n(z + ia )(z − i(E −b ))\n0\n\n\f16\n\nPAVEL EXNER\n\nand the decay law is\n(\nPA (t) =\n\n\"\n\ne2(Im e2 )t − 2|c|2 Re\n\n2\n2\n2(|a|−a)b\ne−i(k1−k̄2 )t\n(a2 −b2 + E)2\n\nib\n√\ne2(Im e2 )t\n− i E −b2 )2\n#)\nZ\n2\n\u0001\n4b i(k̄22 t−π/4) ∞\nz 2 e−z t dz\n+\ne\n1 + O(|c|2 ) ,\n2 + ia2 )(z 2 − i(E −b2 ))2\nπ\n(z\n0\n+ √\n\nE −b2 (a\n\nwhere ej = ej (c) =: kj2 , j = 1, 2 , are specified in Theorem 5.1.\nHence we have explicit formula for deviations from the exponential decay law.\nSome of its properties, however, may not be fully obvious. For instance, the initial\ndecay rate vanishes, ṖA (0+) = 0, since Im (f, (HA −λ)−1 f ) = O(λ−5/2 ) as λ → ∞,\ncf. Proposition 6.1 below. On the other hand, the long-time behavior depends\nsubstantially on the spectrum of the unperturbed Hamiltonian. If HA0 has an\neigenvalue in the first channel, then the decay law contains a term of order of |c|4 ,\nwhich does not vanish as t → ∞; it comes from the component of the first-channel\nbound state contained in the resonant state (5.3).\nThe last name fact it is useful to keep in mind when we speak about an unstable\nstate lifetime. It is a common habit, motiveted by the approximation (2.4), to\nidentify the latter with the inverse distance of the pole from the real axis as we\ndid above when writing T (c). If the decay law is differentiable, however, −ṖA (t)\nexpresses the probability density of decay at the instant t and a simple integration\nby parts Rallows us to express the average time for which the initial state survives\n∞\nas TA = 0 PA (t) dt; this quantity naturally diverges if limt→∞ PA (t) 6= 0.\n5.2. K-shell capture model: comparison to stochastic mechanics. The\nabove model has many modifications, we will describe briefly two of them. The first\ndescribes a β-decay process in which an atomic electron is absorbed by the nucleus\nand decays through the reaction e+p → n+ν with a neutrino emitted. One usually\nspeaks about a K-shell capture because the electron comes most often from the\nlowest energy orbital, however, from the theoretical point any orbital mode can be\nconsidered. We assume again spherical symmetry and take H = H1 ⊕ H2 with\nHj := L2 (R+ ) as the state space. The first component refers to the (s-wave part\nof) atomic wave function, the other is a caricature description of the decayed states;\nwe neglect the fact that neutrino is a relativistic particle.\nThe departing point of the construction is again a non-selfadjoint operator of\nthe form H0 = H0,1 ⊕ H0,2 , the components of which act as\n(5.4)\n\nH0,1 := −\n\n1 d2\n+ V` (r) ,\n2m dr2\n\nH0,2 := −\n\n1 d2\n−E\n2M dx2\n\nwith the domains D(H0,1 ) = {f ∈ W 2,2 (R+ ) : u(Rj −) = u(Rj +) = 0} for fixed\n0 < R1 < R2 < * * * < RN - we add the requirement f (0+) = 0 if the angular\nmomentum ` = 0 - and D(H0,2 ) = {W 2,2 (R+ ) : f (0+) = f 0 (0+) = 0}. Here as\nusual V` (r) = V (r) + `(`+1)\n2mr 2 and the potential is supposed to satisfy the conditions\nlim V (r) = 0 ,\n\nr→∞\n\nlim sup rV (r) = γ < ∞ ,\nr→0\n\n\fSOLVABLE MODELS OF RESONANCES AND DECAYS\n\n17\n\nunder which the operator H0 is symmetric with deficiency indices (N + 1, N + 1).\nOf all its self-adjoint extensions we choose a subclass that (i) allows us to switch\noff the coupling and (ii) couples each sphere locally to the other space. The adjoint\noperator H0∗ acts again as (5.4); the extensions H(a) described by a = (a1 , . . . , aN )\nare specified by the boundary conditions\nu0 (Rj +)−u0 (Rj −) = aj f 0 (0+) ,\n\nj = 1, . . . , N\n\nand\n\nN\nX\n\nāj u(Rj ) = −\n\nj=1\n\nm\nf (0+) ;\nM\n\nit is easy to see that under them the appropriate boundary form vanishes, the channels are decoupled for a = 0, and the Hamiltonians Ha are time-reversal invariant.\nTo solve the resonance problem in the model we have to find the resolvent of\nH(a) which can be again done using Krein's formula. We will describe the resolvent\nprojection to the 'atomic' channel referring for the full expression and the proof to\n[ET92]. We introduce the kernel\nG1 (r, s; k 2 ) =\n\n1\nuk (r< )vk (r> ) ,\nW (vk , uk )\n\nwhere as usual r< := min{r, s}, r> := max{r, s}, and the functions uk , vk are\n1\nk2\nsolutions to − 2m\nu00 + V u = 2m\nu such that uk (0+) = 0 and vk is L2 around ∞,\nand furthermore, W (vk , uk ) := vk (r)u0k (r) − vk0 (r)uk (r) is their Wronskian.\nBefore stating the result, let us mention that the model can also cover the\nsituation when the electron can be absorbed anywhere within the volume of the\nnucleus approximating this behavior by a family of equidistant spheres with Rj :=\njR/N, j = 1, . . . , N , where R is the nucleon radius. Let a : [0, R] → R be a\nbounded piecewise continuous function \u0001understood as 'decay density', and take\njR\nR\nH(aN ) corresponding to aN\nj := N a N . On a formal level, the limit N → ∞\nleads to an operator describing the two channels coupled through the boundary\nconditions\nZ R\nm\nu00 (r) = a(r)f 0 (0+) ,\na(s)u(s) ds = −\nf (0+) ,\nM\n0\nhowever, we limit ourselves to checking the strong resolvent convergence [ET92].\nTheorem 5.3. The projection of the resolvent (H(a) − z)−1 to the 'atomic'\nchannel is an integral operator with the kernel\nG1 (r, s; z) +\n\nN\nX\niκM aj āk G1 (r, Rj ; z)G1 (Rk , s; z)\n.\nPN\nm\n− iκM i,l=1 ai āl G1 (Rl , Ri ; z)\nj,k=1\n\nThe projections of (H(aN ) − z)−1 converge as N → ∞ to operator with the kernel\nG1 (r, s; z) +\nwhere φk :=\n\nRR\n0\n\niκM φk (r)φk (s)\n,\nRRRR\nm − iκM 0 0 a(r)a(s)G1 (r, s; z) drds\n\na(s)G1 (*, s; z) ds, in the strong resolvent sense.\n\nThe singularities correspond to zeros of the denominators in the above expression. As an example, consider the 'atom' with Coulomb potential,\nV` (r) =\n\nγ\n`(`+1)\n+\n,\nr\n2mr2\n\nγ < 0,\n\n\f18\n\nPAVEL EXNER\n\nwhich has in the decoupled case, a = 0, poles at kn = − imγ\nn , n = 1, 2, . . . . The\nGreen function G1 can be expressed in terms of the standard Coulomb wave functions ψn`m (r, θ, φ) = Rn` (r)Y`m (θ, φ). To analyze weak-coupling behavior of the\npoles, we restrict ourselves to two cases, a surface-supported decay when N = 1\nand a volume-supported decay with\nwhen a(r) = a is a constant\nqa constant 'density'\n\u0001\nmγ 2\nand introduce the form factor\nfunction on [0, R]. We put κn := 2mE − n\n(\nR Rn` (r)\n...\nsurface-supported decay\nBn (r) :=\nRR\nr Rn` (r) dr\n...\nvolume-supported decay\n0\nA straightforward calculation [ET92] then yields the shifted pole positions,\nkn2 (a)\nmγ 2\ni\n=−\n− a2 mκn γ 3 (2` + 1)! Bn (R)2 + O(a4 ) .\n2m\n2n\n4\nWe are interestedqparticularly in the situation where the unperturbed eigenvalue is\n2\n\nmγ\nembedded, n >\n2E , when κn is real and the coupling shifts the pole into the\nlower complex halfplane giving rise to the resonant state with the lifetime\n\nTn (a) =\n\n8a2 (Bn (R))−2\n+ O(a0 ) .\nmκn γ 3 (2` + 1)!\n\nIn the case of the real decay, of course, all the unperturbed eigenvalues are embedded\nand the K-shell contribution is dominating. It has the shortest lifetime since Rn` (0)\nis nonzero for ` = 0 only and mγR \u001c 1, typically of order 10−4 , so the form factor\nvalue is essentially determined by the wave function value at the origin.\nThe K-shell capture model allows us to make an important reflection concerning relations between quantum and stochastic mechanics. The two theories are\nsometimes claim to lead to the same results [Ne] and there are cases when such a\nclaim can be verified. The present model shows that in general there is a principal\ndifference between the two. One can model such a decay in stochastic mechanics\ntoo considering random electron trajectories and summing the decay probabilities\nfor their parts situated within the nucleus. The formula is given in [ET92] and\nwe are not going to reproduce it here; what is important that the total probability\nis expressed as the sum of probabilities of all the contributing processes. In the\nquantum-mechanical model discussed here, on the other hand, one adds the amplitudes - it is obvious from the form factor expression in case of a volume-supported\ndecay - and the total probability is the squared modulus of the sum.\n5.3. A model of heavy quarkonia decay. Let us finally mention one more\nmodification of the model, this time aiming at description of decays of charmonium\nor bottomium, which are bound states of heavy quark-antiquark pairs, into a mesonantimeson pair. Such processes are known to be essentially non-relativistic; as an\nexample one can take the decay ψ 00 (3770) → DD̄ where the D meson mass is\n2\n≈ 1865 MeV/c , thus rest energy of the meson pair is two orders of magnitude\nlarger than the kinetic one released in the decay.\nIf the interaction responsible for the decay is switched off the quark and meson\npairs are described by the operators\nĤ0,j := −\n\n1\n1\n∆j1 −\n∆j2 + Vj (|~xj1 −~xj2 |) + 2mj c2 ,\n2mj\n2mj\n\n\fSOLVABLE MODELS OF RESONANCES AND DECAYS\n\n19\n\nwhere m1 and m2 are the quark and meson masses, respectively. As before we\nseparate the center-of-mass motion and use the rotational invariance. Adjusting\nthe energy threshold to 2m2 c2 we can reduce the problem to investigation of self(`)\n(`)\n(`)\nadjoint extensions of the operator H0 := H0,1 ⊕ H0,2 on L2 (R1 , ∞) ⊕ L2 (R2 , ∞)\ndefined by\n(`)\n\nH0,j := −\n\n`(` + 1)\n1 d2\n+ Vj (rj ) +\n+ 2(mj − m2 )c2\n2\nmj drj\nmj rj2\n\n(`)\n\nwith D(H0,j ) := C0∞ (Rj , ∞). Let us list the assumptions. We suppose that the\nquarks can annihilate only they 'hit each other', R1 = 0, while for mesons we allow\nexistence of a hard core, R2 = R ≥ 0. One the other hand, the mesons are supposed\nto be non-interacting, V2 = 0; this may not be realistic if they are charged but it\nsimplifies the treatment. In contrast to that, the interquark potential is confining,\nlimr→∞ V1 (r) = ∞; we also assume that V1 ∈ L1loc and a finite limr→0+ V1 (r) exists.\n(`)\nTo couple the two channels the deficiency indices of H0 have to be (2, 2);\nsince we have put R1 = 0 it happens only if ` = 0 and we drop thus the index `\nin the following. We will not strive again to describe all the extensions and choose\na particular one-parameter family: the domain of the extension Ha will consist of\nfunctions f ∈ W 2,2 (R+ ) ⊕ W 2,2 (R, ∞) satisfying the conditions\nm2\n(5.5)\nf1 (0) = a f20 (R) , f2 (R) =\nā f10 (0) ,\nm1\nwith a ∈ C. In the decoupled case, a = 0, we get Dirichlet boundary condition in\nboth channels as expected; for a ∈ R the Hamiltonian is time-reversal invariant.\nAs the first thing we have to find the resolvent of Ha , in particular its projection\nto the quark channel. In analogy with the previous section we can write its integral\nkernel G0 (r, s; z) in terms of two solutions of the equation\n\u0010\n\u0011\n1 d2\n2\n−\n+\nV\n(r)\n+\n2(m\n−\nm\n)c\nf (r) = zf (r)\n1\n1\n2\nmj dr2\nfor z 6∈ R such that u(0) = 0 and v is L2 at infinity. Krein's formula helps again;\nby a straightforward computation [AEŠS94] we get\nGa (r, s; z) = G0 (r, s; z) +\n\n−ikm2 |a|2 v(r; z)v(s; z)\n,\nm1 v(0; z)D(v, a; z)\n\nwhere the denominator is given by\nm2 0\nv (0; z) .\nm1\nThe singularities are again determined by zeros of the last expression. One can work\nout examples such a natural confining potential, V1 (r) = αr+V0 +2(m2−m1 )c2 , and\nits modifications, in which the resonance width can be expressed through the value\nof the quark wave function at the origin. This appears to be the case generally.\nD(v, a; z) := v(0; z) − ik|a|2\n\nTheorem 5.4. [AEŠS94] Under the stated assumptions, the quarkonium decay\nwidth is given for the n-th s-wave state by\np\nm2\n(5.6)\nΓn (a) = 8πkn 2 |a|2 |ψn (0)|2 + O(|a|6 ) , kn := m1 En ,\nm1\nprovided the bound-state energy En , adjusted by the difference of the rest energies,\nis positive; ψn (0) is the value of the corresponding wave function at the origin.\n\n\f20\n\nPAVEL EXNER\n\nNote that while we have assumed the quark potential to be below bounded at\nthe origin, the assumption can be relaxed. The theorem holds also for potentials\nwith sufficiently weak singularity, in particular, for the physically interesting case\nof a linear confinement combined with a Coulomb potential.\n6. More about the decay laws\nLet us return to the time evolution of unstable systems, in particular, to properties of the decay laws. In addition to the elementary properties mentioned together\nwith the definition (2.1) we know so far only that in the weak-coupling situation\nthey do not differ much from an exponential function coming from the leading term\nof the pole approximation. This says nothing about local properties of the decay\nlaws which is the topic we are going to investigate in this section.\nHistorically the first consequence of non-exponentiality associated with the below bounded energy spectrum concerned the long-time behavior of the decay laws;\nalready in [Kh57] it was observed that a sharp energy cut-off leads to the O(t−3/2 )\nbehavior as t → ∞, and other examples of that type followed. Moreover, it is even\npossible that a part of the initial state survives the decay; we have seen a simple\nexample at the end of Sec. 5.1 and another one will be given in Sec. 9 below. Here\nwe concentrate on two other local properties of decay laws.\n6.1. Initial decay rate and its implications. The first one concerns the\nbehavior of the system immediately after its preparation. Exponential decay has a\nconstant decay rate which, in particular, means it is nonzero at t = 0. This may\nnot be true for other decay laws. We note, for example, that Pψ is by definition\nan even function of t, hence if the (two-sided) derivative Ṗψ (0) exists it has to be\nzero. This happens for vectors from the form domain of the Hamiltonian: we have\n|(ψ, e−iHt ψ)|2 ≤ Pψ (t) ≤ 1 which leads easily to the following conclusion [HE73].\nProposition 6.1. If ψ ∈ Q(H) the decay law satisfies Ṗψ (0+) = 0.\nThe importance of this result stems from the peculiar behavior of unstable systems subject to frequently repeated measurements knows as quantum Zeno effect,\nnamely that in the limit of permanent measurement the system cannot decay. This\nfact was known essentially already to von Neumann and Turing, in the context\nof unstable particle decay it was first described by Beskow and Nilsson [BN67]\nfollowed by a serious mathematical work [Fr72, Ch] which elucidated the mechanism. It became truly popular, however, only after the flashy name referring to\nZeno's aporia about a flying arrow was proposed in [MS77]. Since then the effect\nwas a subject of numerous investigations, in part because it became interesting\nalso from experimental and application points of view. However, since Zeno-type\nproblems are not the subject of this survey we limit ourselves to quoting the review\npapers [Sch04, FP08] as a guide to further reading, and will discuss the topic only\ninasmuch it concerns the initial decay rate.\nSuppose that we perform on an unstable system a series of measurements at\ntimes t/n, 2t/n . . . , t, in which we ascertain that it is still undecayed. If the outcome of each of them is positive, the state reduction returns the state vector into\nthe subspace Hu and the resulting non-decay probability is\nMn (t) = Pψ (t/n)Pψ1 (t/n) * * * Pψn−1 (t/n) ,\n\n\fSOLVABLE MODELS OF RESONANCES AND DECAYS\n\n21\n\nwhere ψj+1 is the normalized projection of e−iHt/n ψj on Hu and ψ0 := ψ, in\nparticular, Mn (t) = (Pψ (t/n))n if dim Hu = 1 and all the vectors ψj coincide with\nψ up to a phase factor. Since limn→∞ (f (t/n)n = exp{−f ̇(0+)t} holds whenever\nf (0) = 1 and the one-sided derivative f ̇(0+) exists, we see that Ṗψ (0+) = 0 implies\nthe Zeno effect, M (t) := limn→∞ Mn (t) = 1 for all t > 0, and the same is true if\ndim Hu > 1 provided the derivative Ṗψ (0+) has such a property for any ψ ∈ Hu .\nAt the same time the above simple argument suggests that an opposite situation, an anti-Zeno effect, is possible when Ṗψ (0+) is negative infinite; then M (t) = 0\nfor any t > 0 which means that the decay is accelerated and the unstable system\ndisappears once the measurement started. The possibility of such a behavior was\nmentioned early [CSM77], however, the attention to it is of a recent date only -\nwe refer again to the review work quoted above. Before proceeding further we have\nto say that the two effects are understood differently in different communities. For\nexperimental physicists the important question is the change of the observed lifetime when the measurement are performed with a certain frequency, on the other\nhand a theoretical or mathematical physicist typically asks what happens if the\nperiod between two successive measurements tends to zero.\nLet us return to the initial decay rate. It is clear we have to estimate 1−Pψ (t) for\nsmall values of t, which we can write as 2 Re (ψ, Eu (I−e−iHt )ψ)−kEu (I−e−iHt )ψk2 ,\nor alternatively cast it using spectral theorem into the form\nZ ∞\nZ ∞\n2\nλt\nλt\ne−iλt/2 sin\ndkEλH ψk2 − 4\ndEu EλH ψ ,\n4\nsin2\n2\n2\n−∞\n−∞\nwhere the non-decreasing projection-valued function λ 7→ EλH := EH ((−∞, λ])\ngenerates spectral measure EH of the Hamiltonian H. By Schwarz inequality the\nabove expression is non-negative; we want to find tighter upper and lower bounds.\nTo this aim we choose an orthonormal basis {χj } P\nin the unstablePsystem subspace Hu and expand the initial state vector as ψ = j cj χj with j |cj |2 = 1.\nThe second term in the above expression can be then written as\n2\nX X Z ∞\nλt\ncj\ne−iλt/2 sin\nd(χm , EλH χj ) ,\n−4\n2\n−∞\nm\nj\nwhere dωjk (λ) := d(χj , EλH χk ) are real-valued measures symmetric with respect to\ninterchange of the indices.\nP Since the measure appearing in the first term can be\nwritten as dkEλH ψk2 = jk c̄j ck dωjk (λ), the decay probability becomes\n\u001aZ ∞\nX\nλt\n1 − Pψ (t) = 4\nc̄j ck\nsin2\ndωjk (λ)\n2\n−∞\njk\n\u001b\nZ ∞\nXZ ∞\nμt\nλt\n−\ne−iλt/2 sin\ndωjm (λ)\neiμt/2 sin\ndωkm (μ) ;\n2\n2\n−∞\n−∞\nm\nif dim Hu = ∞ the involved series canReasily be seen to converge using Parseval\n∞\nrelation. Using next the normalization −∞ dωjk (λ) = δjk we arrive after a simple\ncalculation [Ex05] at the formula\nZ ∞Z ∞\nX\n(λ − μ)t\n(6.1)\n1 − Pψ (t) = 2\nc̄j ck\nsin2\ndωjm (λ)dωkm (μ) .\n2\n−∞ −∞\njkm\n\n\f22\n\nPAVEL EXNER\n\nConsider first an upper bound. We fix α ∈ (0, 2] and use the inequalities |x|α ≥\n| sin x|α ≥ sin2 x together with |λ − μ|α ≤ 2α (|λ|α + |μ|α ) to infer that\nZ ∞Z ∞\nX\n1 − Pψ (t)\n1−α\n|λ − μ|α dωjm (λ)dωkm (μ)\n≤\n2\nc̄\nc\nj k\ntα\n−∞ −∞\njkm\nZ ∞Z ∞\nX\n(|λ|α + |μ|α ) dωjm (λ)dωkm (μ) ≤ 4h|H|α iψ ,\n≤2\nc̄j ck\n−∞\n\njkm\n\n−∞\n\nwhich means that 1 − Pψ (t) = O(tα ) if ψ ∈ Dom (|H|α/2 ). If this is true for some\nα > 1 we get Ṗψ (0+) = 0 which a slightly weaker result than Proposition 6.1. Note\nalso that if dim Hu = 1 and the spectrum of H is absolutely continuous there is an\nalternative way to justify the claim using Lipschitz regularity,\n|ω̂(t)|2 in\nR since P (t) =\nα\nthis case and ω̂ is bounded and uniformly α-Lipschitz iff R ω(λ)(1 + |λ| ) dλ < ∞.\nA lower bound is more subtle. We use the inequality sin (λ−μ)t\n≥ C|λ − μ|t\n2\nwhich holds with a suitable C > 0 for λ, μ ∈ [−1/t, 1/t] to estimate (6.1) as follows\nZ 1/t Z 1/t\n1 − Pψ (t) ≥ 2C 2 t2\n(λ − μ)2 (ψ, dEλH Eu dEμH ψ)\n−1/t\n\n2 2\n\n\u001aZ\n\n1/t\n\nZ\n\n−1/t\n\n1/t\n2\n\n= 4C t\n\n(λ −\n−1/t\n\n−1/t\n\n\u001b\n\nλμ) (ψ, dEλH Eu dEμH ψ)\n\nn\no\n2\n= 4C 2 t2 (ψ, H1/t\nEu I1/t ψ) − kP H1/t ψk2 ,\nwhere HN denotes the cut-off Hamiltonian, HEH (∆N ) with ∆N := (−N, N ). Dividing the expression at the right-hand side by t and choosing t = N −1 , we arrive\nat the following conclusion.\nProposition 6.2. The initial decay rate of ψ ∈ Hu satisfies Ṗψ (0+) = −∞\n\u0001−1\n2\nprovided hHN\nEu EH (∆N )iψ − kP HN ψk2\n= o(N ) holds as N → ∞.\nTo illustrate how does the initial decay rate depend on spectral properties of\nthe decaying state, consider an example in which dim Hu = 1, the Hamiltonian is\nbounded from below and ψ from its absolutely continuous spectral subspace is such\nthat d(ψ, EλH ψ) = ω(λ) dλ where ω(λ) ≈ cλ−β as λ → +∞ for some c > 0 and\nβ > 1. If β > 2, Proposition 6.1 implies Ṗψ (0+) = 0. On the other hand, one can\neasily find the asymptotic behavior of the quantity appearing in Proposition 6.2:\nRN\nω(λ) dλ tends to one, while the other two integrals diverge giving\n−N\nZ\n\nN\n2\n\nZ\n\nN\n\nλ dω(λ)\n−N\n\nZ\ndω(λ) −\n\n−N\n\n!2\n\nN\n\nλ dω(λ)\n−N\n\n≈\n\nc\nN 3−β −\n3−β\n\n\u0012\n\nc\n2−β\n\n\u00132\n\nN 4−2β\n\nas N → +∞, and consequently, Ṗ (0+) = −∞ holds for β ∈ (1, 2). This shows that\nthe exponential decay - which requires, of course, σ(H) = R by Theorem 2.1 -\nwalks a thin line between the two extreme initial-decay-rate possibilities. Let us\nremark finally that while 'Zeno' limit is trivial for the exponential decay, it may\nnot exist in other cases with β = 2; in [Ex, Rem. 2.4.9] the reader can find an\nexample of such a distribution with a sharp cut-off leading to rapid oscillations of\nthe function t 7→ (ψ, e−iHt ψ) which obscure existence of the limit.\n\n\fSOLVABLE MODELS OF RESONANCES AND DECAYS\n\n23\n\n6.2. Irregular decay: example of Winter model. Now we turn to another\ndecay law property. In the literature it is usually tacitly assumed that Pψ (*) is a\n'nice', i.e. sufficiently regular function, typically by dealing with its derivatives.\nOur aim is to show that this property cannot be taken for granted which we are\ngoing to illustrate on another well-known solvable model of decay.\nAn inspiration comes from the striking behavior of some wave functions in a\none-dimensional hard-wall potential well observed in [Be96, Th]. The simplest\nexample concerns the situation when the initial function is constant (and thus\nnot belonging to the domain of the Dirichlet Laplacian): it evolves into a steplike\nψ(x, t) for times which are rational multiples of the period, t = qT with q = N/M ,\nand the number of steps increases with growing M , while for an irrational q the\nfunction ψ(x, t) is fractal with respect to the variable x. One may expect that such\na behavior will not disappear completely if the hard wall is replaced by a singular\npotential barrier. It was illustrated in a 'double well' system [VDS02]; here we\ninstead let the initial state decay into continuum through the tunneling.\nDecay due to a barrier tunneling is among the core problem of quantum mechanics which can be traced back to Gamow's paper [Ga28]. The model in which\nthe barrier is a spherical δ-shell is usually referred to as Winter model after the\npaper [Wi61] where it was introduced. A thorough analysis of this model can be\nfound in [AGS87]; it has also various generalizations, we refer to [AGHH] for a\nbibliography. The Hamiltonian acting in L2 (R3 ) is of the form\nHα = −∆ + αδ(|~r| − R) ,\n\nα > 0,\n\nwith a fixed R > 0; as usual we employ rational units, ~ = 2m = 1. For simplicity\nwe restrict our attention to the s-wave part of the problem, using the reduced wave\nfunctions ψ(~r, t) = √14π r−1 φ(r, t) and the corresponding Hamiltonian part,\nhα = −\n\nd2\n+ αδ(r − R) ;\ndr2\n\nwe are interested in the time evolution, ψ(~r, t) = e−iHα t ψ(~r, 0) for a fixed initial\ncondition ψ(~r, 0) with the support inside the ball of radius R, and the corresponding\nRR\ndecay law Pψ (t) = 0 |φ(r, t)|2 dr referring to Hu = L2 (BR (0)).\nIt is straightforward to check [AGS87] that Hα has no bound states, on the\nother hand, it has infinitely many resonances with the widths increasing logarithmically with respect to the resonance index [EF06]; a natural idea is to employ\nthem as a tool to expand the quantities of interest [GMM95]. In order to express\nreduced evolution in the way described in Sec. 2 we need to know Green's function\nof the Hamiltonian hα which can be obtained from Krein's formula,\n(hα − k 2 )−1 (r, r0 ) = (h0 − k 2 )−1 (r, r0 ) + λ(k)Φk (r)Φk (r0 ) ,\nwhere Φk (r) := G0 (r, R) is the free Green function with one argument fixed, in\nparticular, Φk (r) = k1 sin(kr) eikR holds for r < R, and λ(k) is determined by\nδ-interaction matching conditions at r = R; by a direct calculation one finds\nλ(k) = −\n\n1+\n\nα\n.\n− e2ikR )\n\niα\n2k (1\n\n\f24\n\nPAVEL EXNER\n\nUsing it weR can write the integral kernel of e−ihα t as Fourier transformation,\n2\n∞\nu(t, r, r0 ) = 0 p(k, r, r0 )e−ik t 2k dk, where the explicit form of the resolvent gives\n2k sin(kr) sin(kr0 )\n.\nπ(2k 2 + 2α2 sin2 kR + 2kα sin 2kR)\nThe resonances understood as poles of the resolvent continued to the lower halfplane\nappear in pairs, those in the fourth quadrant, denoted as kn in the increasing order\nof their real parts, and −k̄n ; we denote S = {kn , −kn , k̄n , −k̄n : n ∈ N}. In the\nvicinity of kn the function p(*, r, r0 ) can be written as\np(k, r, r0 ) =\n\np(k, r, r0 ) =\n\ni vn (r)vn (r0 )\n+ χ(k, r, r0 ) ,\n2π k 2 − kn2\n\nwhere vn (r) solves the differential equation hα vn (r) = kn2 vn (r) and χ is locally analytic. It is not difficult to see that the function p(*, r, r0 ) decreases in every direction\nof the k-plane, hence it can be expressed as the sum over the pole singularities,\nX 1\np(k, r, r0 ) =\nResk̃ p(k, r, r0 )\nk − k̃\nk̃∈S\nP\nand the residue theorem implies k̃∈S Resk̃ p(k, r, r0 ) = 0. Using these relations\nand denoting k−n := −k̄n with v−n being the associated solution of the equation\n2\nHα v−n (r) = k−n\nv−n (r), we arrive after a short computation [EF07] at\nX\nu(t, r, r0 ) =\nM (kn , t)vn (r)vn (r0 )\nn∈Z\n\nwith M (kn , t) =\n\n1\n2\n\ne\n\nu2n\n\n√\nerfc(un ) and un := −e−iπ/4 kn t, leading to the decay law\nX\nPψ (t) =\nCn C̄l Inl M (kn , t)M (kl , t)\nn,l\n\nRR\n\nRR\nwith Cn := 0 φ(r, 0)vn (r) dr and Inl := 0 vn (r)v̄l (r) dr ; in our particular case\n√\nwe have vn (r) = 2Qn sin(kn r) with the coefficient Qn equal to\n\u00131/2\n\u0012\n−2ikn2\n.\n2kn + α2 R sin 2kn R + α sin 2kn R + 2kn αR cos 2kn R\nThese explicit formulae allow us to find Pψ (t) numerically. Let us quote an example\nworked out in [EF07] in which R = 1 and α = 500; the initial wave function is\nchosen to be constant, i.e. the ground √\nstate of the Neumann Laplacian in L2 (BR (0))\n−3/2\nwhich corresponds to φ(r, 0) = R\n3r χ[0,R] (r) .\nThe respective decay law is plotted in Figure 1; we see that it is irregular\nhaving 'steps', the most pronounced at the period T = 2R2 /π and its simple rational\nmultiples. This is made even more visible from the plot of its logarithmic derivative\n(for numerical reasons it is locally smeared, otherwise the picture would be a fuzzy\nband). It is reasonable to conjecture that the function is in fact fractal.\nLet us add a few heuristic considerations in favor of this conjecture concerning\nthe behaviorPof the derivative in the limit α → ∞. We can write the wave function\nas φ(r, t) ≈ n cn exp(−ikn2 t)vn (r) where resonance position expands for a fixed n\n2\naround kn,0 := nπ/R as kn ≈ kn,0 − kn,0 (αR)−1 + kn,0 (αR)−2 − ikn,0\n(α2 R)−1 . In\nq\nthe leading order we have vn (r) ≈ R2 sin(kn r) and the substantial contribution to\nthe expansion of φ(r, t) comes from terms with n . [α1−ε R\nπ ] for some 0 < ε < 1/3.\n\n\fSOLVABLE MODELS OF RESONANCES AND DECAYS\n\n25\n\n1\n0\n-0.05\n-0.1\nP'(t)/P(t)\n\n0.99\n\n0.98\n\n-0.15\n-0.2\n-0.25\n-0.3\n\nP(t)\n\n-0.35\n-0.4\n\n0.97\n\n-0.45\nT/2\n\nT\nt\n\n0.96\n\n0.95\n\n0.94\nT/3\n\nT/2\n\nT\nt\n\n√\nFigure 1. Decay law for the initial state φ(r, 0) = R−3/2 3r;\nthe inset shows its logarithmic derivative averaged over intervals\nof the length approximately T /200.\n\nThe derivative of the decay law Pψ,α (*) can be identified with the probability\ncurrent through the sphere, Ṗψ,α (t) = −2Im (φ0 (R, t)φ̄(R, t)). To use it we have to\nknow the expressions on the right-hand side; using the above expansion we find\nr\n\u0012\n∞\n3\n2 \u0013\n2kn,0\nkn,0\n2\n2\nkn,0\n2 X\nφ(R, t) ≈\n(−1)n cn e−ikn,0 t(1− αR ) e− α2 R t −\n−i 2\nR n=1\nα\nα\nand a similar expansion for φ0 (R, t) with the last bracket replaced by kn,0 . We\n\u0011\n\u0010\n\u0001\nP∞\nk3\nj\nR (j+1)/3 2(j+1)/3\nt\nkn,0\n≈R\nobserve that n=1 exp −2 αn,0\nα\nIj holds for j > −1\n2R\nπ 2t\n\u0001\nR ∞ −x3 j\nwhere on the right-hand side we have denoted Ij := 0 e\nx dx = 31 Γ j+1\n.\n3\nUsing this result we can argue that the decay law regularity depends on the\nasymptotic behavior of the coefficients cn . Suppose for simplicity that it is power−p\n) as n → ∞. If the decay is fast enough, p > 1, we find that\nlike, cn = O(kn,0\n|Ṗψ,α (t)| ≤ const α4/3−4/3p → 0 holds as α → ∞ uniformly in the time variable.\nThe situation is different if the decay is slow, p ≤ 1. Consider the example men√\ntioned above leading to the decay law featured in Figure 1 where cn = (−1)n+1 Rk6n .\nSince the real parts of the resonance poles change with α, it is natural to look at\nthe limit of Ṗψ,α (tα ) as α → ∞ at the moving time value tα := t(1 + 2/αR).\nFor irrational multiples of T we use the fact [BG88] that the modulus of\nPL\niπn2 t\n1−ε\nis for an irrational tP\nbound by C LP\nwhere\nn=1 e\nPn C, ε depend on t only. In\n∞\n∞\ncombination with the estimate, n=1 an bn ≤ n=1 | j=1 aj | |bn − bn+1 | we find\n∞\nX\nn=1\n\n2\n\ne−ikn,0 t e−\n\n2\n2kn,0\nα2 R\n\nt j\nkn,0\n\n. const α2/3(j+1−ε) ,\n\n\f26\n\nPAVEL EXNER\n\nand consequently, Ṗψ,α (tα ) → 0 as α → ∞. Assume next that t = pq T with\nPL\n2\np, q ∈ N. If pq is odd then SL (t) := n=1 eiπn t repeatedly retraces according to\n[BG88] the same pattern, hence Ṗψ,α (tα ) → 0 - an illustration can be seen in\nFig. 1 at the half period. On the other hand, for pq even |SL (t)| grows linearly with\nL, and consequently, limα→∞ Ṗψ,α (tα ) > 0. For instance, a direct computation\n4\n≈ −0.77.\n[EF07] yields the value at the period, limα→∞ Ṗψ,α (Tα ) = − 3√\n3\nAs the last remark in this section, we note that there is a relation between a lack\nof local regularity of the decay law and the 'anti-Zeno' property of Proposition 6.2;\nboth occur if the energy distribution of the decaying state has a slow enough decay\nat high energies. The connection is no doubt worth of further exploration.\n7. Quantum graphs\nMany quantum systems, both spontaneously emerging in Nature and resulting\nfrom an experimentalist's design, no doubt intelligent one, have complicated geometrical and topological structure which can be conveniently modeled as a graph\nto which the particle motion is confined. Such a concept was first developed for\nthe purpose of quantum chemistry [RS53], however, it became a subject of intense investigation only at the end of the 1980's when tiny graph-like structures\nof semiconductor and other materials gained a prominent position in experimental\nphysics. The literature on quantum graphs is vast at present; we limit ourselves\nwith referring to the proceedings volume [EKKST] as a guide for further reading.\nQuantum graphs are usually rich in resonances; the reason, as we see below, is\nthat their spectra often exhibit embedded eigenvalues which, as we know, are typically sources of resonance effects. Before we turn to the review let us briefly mention that while describing real-world quantum system through graphs is certainly\nan idealization, they can be approximated by more realistic 'fat-graph' structures\nin a well-defined mathematical sense; from our point of view here it is important\nthan such approximations also include convergence of resonances [EP07].\n7.1. Basic notions. As a preliminary, let us recall some basic notions about\nquantum graph models we shall need in the following. For the purpose of this\nreview, a graph Γ consists of a set of vertices V = {Xj : j ∈ I}, a set of finite edges2\nL = {Ljn : (Xj , Xn ) ∈ IL ⊂ I × I}, and a set of infinite edges, sometimes also called\nleads, L∞ = {Lj∞ : Xj ∈ IC } attached to them. We consider metric graphs which\nmeans that each edge of Γ is isomorphic to a line segment; the notions of finiteness\nor (semi)infiniteness refer to the length of those segments. As indicated, we regard\nΓ as the configuration space of a quantum system with the Hilbert space\nM\nM\nH=\nL2 ([0, lj ]) ⊕\nL2 ([0, ∞)) ,\nLj ∈L\n\nLj∞ ∈L∞\n\nthe elements of which are columns Ψ = ({fj : Lj ∈ L}, {gj : Lj∞ ∈ L∞ })T .\nFor most part of this section we will suppose that the motion on the graph edges\nd2\nis free, i.e. governed by the Hamiltonian which acts there as − dx\n2 with respect to\nthe arc-length variable parametrizing the particular edge. In order to make it a\nself-adjoint operator, we have to impose appropriate boundary conditions which\n2We assume here implicitly that any two vertices are connected by not more than a single\nedge and that the graph has no loops, which is possible to do without loss of generality since we\nare always able to insert 'dummy' vertices into 'superfluous' edges.\n\n\fSOLVABLE MODELS OF RESONANCES AND DECAYS\n\n27\n\nl2\n\nl3\n\nl1\nl4\nlN\nFigure 2. The model Γ0 for a quantum graph Γ with N internal\nfinite edges and M external leads\ncouple the wave functions at the graph vertices. One of the possible general forms\nof such conditions [GG, Ha00, KS00] is\n(7.1)\n\n(Uj − I)Ψj + i(Uj + I)Ψ0j = 0 ,\n\nwhere Uj are unitary matrices, and Ψj and Ψ0j are vectors of the functional values\nand of the (outward) derivatives at the vertex Xj ; in other words, the domain of\nthe Hamiltonian consists of all functions on Γ which are locally W 2,2 and satisfy\nconditions (7.1). Note that coupling is local connecting boundary values in Xj only.\nSince handling Hamiltonians of graphs with a complicated topology may be\ncumbersome, one can employ a trick proposed in [Ku08] replacing Γ with the graph\nΓ0 in which all edge ends meet in a single vertex as sketched in Fig. 2; the actual\ntopology of Γ will be then encoded into the matrix which describes the coupling in\nthe vertex. Denoting N = ] L and M = ] L∞ we introduce the (2N + M )-dimensional vector of functional values by Ψ = (ΨT1 , . . . , ΨT]V )T and similarly the vector\nof derivatives Ψ0 at the vertex; the conditions (7.1) can be concisely rewritten as\ncoupling on Γ0 characterized by (2N + M ) × (2N + M ) unitary block-diagonal\nmatrix U , consisting of the blocks Uj , in the form\n(7.2)\n\n(U − I)Ψ + i(U + I)Ψ0 = 0 ;\n\nit is obvious that one can treat the replacement as a unitary equivalence which does\nnot alter spectral properties and preserves the system resonances (if there are any).\n7.2. Equivalence of resonance notions. In Section 2 we made it clear how\nimportant it is to establish connection between different objects labeled as resonances. Let us look now how this question looks like in the quantum graph setting.\nLet us begin with the resolvent resonances. One can write the resolvent of the\ngraph Hamiltonian [Pa10], however, it is sufficient to inspect the spectral condition encoded in it and its behavior in the complex plane.\nWe employ an external complex scaling in which the external part are the\nsemi-infinite leads where the functions are scaled as gjθ (x) = eθ/2 gj (xeθ ) with an\nimaginary θ; as usual this rotates the essential spectrum of the transformed (nonselfadjoint) Hamiltonian into the lower complex halfplane and reveals the secondsheet poles. In particular the 'exterior' boundary values, to be inserted into (7.2),\ncan be for gj (x) = cj eikx written as gj (0) = e−θ/2 gjθ and gj0 (0) = ike−θ/2 gjθ\nwith an appropriate gjθ . On the other hand, the internal part of the graph is left\nunscaled. Choosing the solution on the j-th edge in the form fj (x) = aj sin kx +\nbj cos kx we easily find its boundary values; for x = 0 it is trivial, for x = lj we\nuse the standard transfer matrix. This allows us to express both (fj (0), fj (lj ))T\n\n\f28\n\nPAVEL EXNER\n\nand (fj0 (0), −fj0 (lj ))T through the coefficients aj , bj , cf. [EL10] and note the sign\nof fj0 (lj ) reflecting the fact that the derivatives entering (7.2) are outward ones.\nInserting these boundary values into the coupling condition we arrive at the system\n\n\n\n\na1\na1\n\n\n\n\nb1\nb1\n\n\n\n\n\n\n\n\na\na\n2\n2\n\n\n\n\n..\n..\n\n\n\n\n\n\n\n\n.\n.\n = 0,\n + ik(U + I)C2 (k) \n(7.3)\n(U − I)C1 (k) \n\n\n\n\nbN\nbN\n\n −θ/2\n\n −θ/2\n\n\n e\ng1θ \ng1θ \n\n e\n\n\n\n\n\n..\n..\n\n\n\n\n.\n.\ne−θ/2 gM θ\n\ne−θ/2 gM θ\n(1)\n\n(2)\n\n(N )\n\nwhere we have set C1 (k) = diag (C1 (k), C1 (k), . . . , C1 (k), IM ×M ) and C2 =\n(1)\n(2)\n(N )\ndiag (C2 (k), C2 (k), . . . , C2 (k), iIM ×M ) with\n\u0012\n\u0013\n\u0012\n\u0013\n0\n1\n1\n0\n(j)\n(j)\nC1 (k) =\n, C2 (k) =\n,\nsin klj cos klj\n− cos klj sin klj\nand IM ×M being the M × M unit matrix. The solvability condition of the system\n(7.3) determines eigenvalues of the scaled non-selfadjoint operator, and mutatis\nmutandis, poles of the analytically continued resolvent of the original Hamiltonian.\nLooking at the same system from the scattering point of view we use the same\nsolution as above on the internal edges while on the leads we take appropriate\ncombinations of two planar waves, gj = cj e−ikx + dj eikx . We look for the on-shell\nS-matrix S = S(k) which maps the vector of amplitudes of the incoming waves\nc = {cn } into the vector of amplitudes of the outgoing waves d = {dn }, and ask\nabout its complex singularities, det S −1 = 0. This leads to the system\n\n\n\n\na1\na1\n\n\n\n\nb1\nb1\n\n\n\n\n\n\n\n\na\na\n2\n2\n\n\n\n\n\n\n\n\n..\n..\n\n\n\n\n.\n.\n + ik(U + I)C2 (k) \n = 0;\n(U − I)C1 (k) \n\n\n\n\nbN\nbN\n\n\n\n\n c1 + d1 \n d1 − c1 \n\n\n\n\n\n\n\n\n..\n..\n\n\n\n\n.\n.\ncM + dM\ndM − cM\neliminating the variables aj , bj one can rewrite it as a system of M equations\nexpressing the map S −1 d = c. The condition under which the latter is not solvable,\nwhich is equivalent to our original question since S is unitary, reads\n(7.4)\n\ndet [(U − I) C1 (k) + ik(U + I) C2 (k)] = 0 ,\n\nhowever, this is nothing else than the condition of solvability of the system (7.3).\nThus we can make the following conclusion [EL10].\nTheorem 7.1. The notions of resolvent and scattering resonances coincide for\nquantum graph Hamiltonians described above.\nBefore proceeding further, let us mention one more way in which the resonance\nproblem on a graph can be reformulated. To this purpose we rearrange the matrix\n\n\fSOLVABLE MODELS OF RESONANCES AND DECAYS\n\n29\n\n\u0001\nU1 U2\nU permuting its rows and columns into the form U = U\n, where U1 is the\n3 U4\n2N × 2N square matrix referring to the compact subgraph, U4 is the M × M square\nmatrix related to the exterior part, and U2 and U3 are rectangular matrices of the\nsize M × 2N and 2N × M , respectively, connecting the two. The system (7.3) can\nbe then rewritten by elimination of the lead variables [EL10] as\n(Ũ (k) − I)F + i(Ũ (k) + I)F 0 = 0 ,\n\n(7.5)\n\nwhere F := (f1 , . . . , f2N )T , and similarly for F 0 , are the internal boundary values,\nand the effective coupling matrix appearing in this condition is given by\nŨ (k) = U1 − (1 − k)U2 [(1 − k)U4 − (k + 1)I]−1 U3 .\n\n(7.6)\n\nIn other words, we have been able to cast the problem into the form of spectral\nquestion for the compact core of the graph with the effective coupling replacing the\nleads by the non-unitary and energy-dependent matrix (7.6).\n7.3. Line with a stub. Next we will present several simple examples. In the\nfirst one Γ is a line to which a segment is attached at the point x = 0. The Hilbert\n\u0001\nspace is thus H := L2 (R) ⊕ L2 (0, l) and we write its elements as columns ψ = uf .\nTo make the problem more interesting we suppose that the particle on the stub is\nexposed to a potential; the Hamiltonian acts\n(Hψ)1 (x) = −f 00 (x) ,\n\n(Hψ)2 (x) = (−u00 + V u)(x) ,\n\noutside the junction, where V ∈ L1loc (0, l) having finite limits at both endpoints\nof the segment so - if the domain consists of functions vanishing in the vicinity\nof the junction - the corresponding deficiency indices are (3, 3). The admissible\nHamiltonians will be identified with self-adjoint extensions which, as before, can\nbe conveniently characterized by appropriate boundary conditions. We will not\nexplore all of them and restrict our attention to a subclass of those having the line\ncomponent of the wave function continuous at the the junction, namely\n(7.7)\n\nf (0+) = f (0−) =: f (0) ,\nf 0 (0+) − f 0 (0−) = df (0) − bu0 (0) ,\n\nu(0) = bf (0) + cu0 (0) ,\nu(`) = 0 ;\n\nat the\n\u0001 free end of the stub we fix Dirichlet condition. The coefficient matrix K =\nb c\nd −b is real; we restrict our attention to time-reversal invariant dynamics. The\noperator specified by the conditions (7.7) will be denoted as HK . The parameter\nb controls the coupling; if b = 0 the graph decomposes into the line with a point\nd2\ninteraction at x = 0 and the stub supporting Schrödinger operator hc := − dx\n2 +V\nwith Robin condition u(0) = cu0 (0) at the junction referring again to x = 0.\nLet us begin with the scattering. To find the on-shell S-matrix we use the\nstandard Ansatz, f (x) = eikx + r e−ikx and t eikx on the line for x < 0 and x > 0,\nrespectively, while on the stub we take u(x) = βul (x) where ul is a solution to\n−u00 + V u = k 2 u corresponding to the boundary conditions ul (l) = 0, unique up to\na multiplicative constant. Using the coupling conditions (7.7) we find\nt(k) =\n\n−2ik(cu0` − u` )(0)\n,\n2ikD(k)\n\nr(k) = −\n\nb2 u0` (0) + d(cu0` − u` )(0)\n;\n2ikD(k)\n\nwhere 2ikD(k) := b2 u0` (0) + (d − 2ik)(cu0` − u` )(0); it is easy to check that these\namplitudes satisfy |t(k)|2 + |r(k)|2 = 1. We note that HK can have also an isolated\neigenvalue; this happens if D(iκ) = 0 with κ > 0. If b = 0 such an eigenvalue exists\nprovided d < 0 and equals − 14 d2 ; it remains isolated for |b| small enough.\n\n\f30\n\nPAVEL EXNER\n\nIt is also not difficult to find the resolvent of HK . The tool is as usual Krein's\nformula; we choose for comparison HK0 corresponding to K0 = 0. In that case the\ni ik|x−y|\noperator decomposes, the kernel of line part being G1 (x, y; z) = 2k\ne\nwhere\n√\nu0 (x< )u` (x> )\nk := z as usual; the stub part is − W (u0 ,ul ) , where ul has been introduced\nabove, u0 is similarly a solution corresponding to the condition u0 (0) = cu00 (0), and\nW (u0 , ul ) is the Wronskian of the two functions. The sought kernel then equals\nX\n(HK − z)−1 (x, y) = (HK0 − z)−1 (x, y) +\nλjk (k)Fj (x)Fk (y) ,\nj=1,2\n\n\u0001\n\u0001\nwhere the vectors Fj can be chosen as F1 (x) := R1 (x,0)\nand F2 (x) := ul0(x) ;\n0\nnote that the stub part vanishes at x = 0. The coefficients are obtained from the\nrequirement that the resolvent must map any vector of H into the domain of HK ;\na straightforward computation [EŠ94] gives\n\u0012\n\u0013\nb2 u0` (0) + d(cu0` − u` )(0)\nu` (0)−1\ncd + b2\nλ11 (k) =\n, λ22 (k) =\nc+ i\n,\nD(k)\nD(k)\n2k\ntogether with λ12 (k) = λ21 (k) = bD(k)−1 . We see, in particular, that the coefficient\ndenominator zeros in the complex plane coincide with those of the on-shell S-matrix\nas we expect based on Theorem 7.1 proved above.\nIn the decoupled case, b = 0, the expression for D(k) factorizes giving rise\nto eigenvalues of the operator hc introduced above which are embedded in the\ncontinuous spectrum of the line Hamiltonian; the coupling turns them generally\ninto resonances. In the case case of weak coupling, i.e. for small |b| one can solve\nthe condition D(k) = 0 perturbatively arriving at the following conclusion [EŠ94].\nProposition 7.2. Let kn refer to the n-th eigenvalue of hc and denote by χn\nthe corresponding normalized eigenfunction; then for all sufficiently small |b| there\nis a unique resolvent pole in the vicinity of kn given by\nkn (b) = kn −\n\nib2 χ0n (0)2\n+ O(b4 ) .\n2kn (2kn + id)\n\nThis gives, in particular, the inverse value of resonance lifetime in the weakcoupling case, Im zn (b) = ib2 χ0n (0)2 (2kn + id)−1 + O(b4 ). The simple form of the\ncondition D(k) = 0 allows us, however, to go beyond the weak coupling and to\ntrace numerically the pole trajectories as the coupling constant b runs over the\nreals. Examples are worked out in [EŠ94] but we will not describe them here and\nlimit ourselves with mentioning an important particular situation.\nIt concerns the case when the motion in the stub is free and the decoupled\noperator is specified by the Dirichlet boundary condition, i.e. V = 0 and c = d = 0.\nThe condition D(k) = 0 can be then solved analytically. Indeed, the embedded\niβ 2\neigenvalues are kn2 with kn := nπ\n` and the equation reduces to tan k` = − 2 solved\nby\n√\n( nπ\ni\n2−b2\n. . . |b| < 2\n` + 2l ln 2+b2\n(7.8)\nkn (b) =\n√\n2\n(2n−1)π\n+ 2li ln bb2 −2\n. . . |b| > 2\n2`\n+2\nHence√the poles move with the increasing |b| vertically down in the k-plane and for\n|b| > 2 they ascend, again vertically, returning to eigenvalues of Neumann version\nof hc as |b| → ∞. An important conclusion from this example is that poles may\n\n\fSOLVABLE MODELS OF RESONANCES AND DECAYS\n\n31\n\ndisappear to infinite distance from the real axis\n√and a quantum graph may have no\nresonances at all, as it happens here for |b| = 2.\n7.4. Regeneration in decay: a lasso graph. Let us next describe another\nsimple example, now with a lasso-shaped Γ consisting of a circular loop of radius R\nto which a halfline lead is attached. This time we shall suppose that the particle is\ncharged and the graph is placed into a homogeneous magnetic field of intensity B\nperpendicular to the loop plane3. The vector potential can be then chosen tangent\nto the loop with the modulus A = 21 BR = Φ\nL , where Φ is the flux through the\nloop and L is its perimeter. With the convention we use, e = c = 2m = ~ = 1, the\nφ\nnatural flux unit is hc\ne = 2π, so we can also write A = R where φ is the flux value in\nthese units. The Hilbert space of the lasso-graph model\nis H := L2 (0, L) ⊕ L2 (R+ );\n\u0001\nu\nthe wave functions are written as columns, ψ = f .\nTo construct the Hamiltonian we begin with the operator describing the free\nmotion on the loop and the lead under the assumption that the graph vertex is\n'fully disconnected', in other words H∞ = Hloop (B) ⊕ Hhalfline , where\n\u0010\n\u00112\nd\nd2\nHloop (B) = − i\n+ A , Hhalfline = − 2\ndx\ndx\nwith Dirichlet condition, u(0) = u(L) = f (0) = 0 at the junction. The spectrum\n\u0001\n−iAx\nnx\nof Hloop is discrete of multiplicity two; the eigenfunctions χn (x) = e√πR sin 2R\n\u0001\nn 2\nwhich are embedded into the\nwith n = 1, 2, . . . correspond to the eigenvalues 2R\ncontinuous spectrum of Hhalfline covering the interval [0, ∞); note that the effect\nof the magnetic field on the disconnected loop amounts to a unitary equivalence,\nHloop (B) = U−A Hloop (0)UA where (UA u)(x) := eiAx u(x).\nRestricting the domain of H∞ to functions vanishing in the vicinity of the\njunction we get a symmetric operator with deficiency indices (3, 3). We are going\nto consider a subclass of its self-adjoint extensions analogous to (7.7) characterized\nby three real parameters; the Hamiltonian will act as\n\u0012 \u0013 \u0012 00\n\u0013\nu\n−u − 2iAu0 + A2 u\nHα,μ,ω (B)\n=\nf\n−f 00\n2,2\non functions from Wloc\n(Γ) continuous on the loop, u(0) = u(L), which satisfy\n\n(7.9)\n\nf (0) = ωu(0) + μf 0 (0) ,\n\nu0 (0) − u0 (L) = αu(0) − ωf 0 (0) ,\n\nfor some α, μ, ω ∈ R the latter being the coupling constant. This includes a particular case of δ-coupling corresponding to μ = 0 and ω = 1 in which case the wave\nfunctions are fully continuous,\n(7.10)\n\nu(0) = u(L) = f (0) ,\n\nu0 (0) − u0 (L) + f 0 (0) = αf (0) ;\n\nin the fully decoupled case we have α = ∞ as the notation suggests. For simplicity\nwe will write Hα,0,1 = Hα . Note that in general the vector potential enters the\n~ at the\ncoupling conditions [KS03] but here the outward tangent components of A\njunction have opposite signs so their contributions cancel mutually.\nLet us start again with scattering, i.e. the reflection of the particle traveling\nalong the halfline from the magnetic-loop end. To find the generalized eigenvectors,\n3The assumptions of homogeneity and field direction are here for simplicity only, in fact the\nonly thing which matters in the model is the magnetic flux through the loop.\n\n\f32\n\nPAVEL EXNER\n\nHα,μ,ω (B)ψ = k 2 ψ, we use u(x) = β e−iAx sin(kx + γ) and f (x) = e−ikx + r eikx as\nthe Ansatz; using the coupling conditions (7.9) we get after a simple algebra\n\u0002\n\u0003\n(1 + ikμ) α − sin2kkL (cos Φ − cos kL) + iω 2 k\n\u0003\n\u0002\nr(k) = −\n(1 − ikμ) α − sin2kkL (cos Φ − cos kL) − iω 2 k\nfor the reflection amplitude. The Hamiltonian Hα,μ,ω (B) can have also isolated\neigenvalues but we shall skip this effect referring to [Ex97]. On the other hand,\nit is important to mention that there may exist positive eigenvalues embedded in\nthe continuous spectrum even if ω 6= 0. In view of (7.9) it is possible if u(0) =\nu0 (0)− u0 (L) = 0, hence such bound states exist only at integer/halfinteger values\nof the magnetic flux (in the natural units) and the corresponding eigenfunctions\nare the χn 's mentioned above with even n for φ integer and odd n for φ halfinteger.\nNext we find the resolvent of Hα,μ,ω (B) using again Krein's formula to compare\nk(x> −L) sin kx< eikx> \u0001\n.\n,\nit to that of H∞ with the kernel diag e−iA(x−y) sin kx<k sin\nsin kL\nk\nThe sought resolvent kernel can be then written as\nGα,μ,ω (x, y; k) = G∞ (x, y; k) +\n\n2\nX\n\nλj` (k)Fj (x)F` (y) ,\n\nj,`=1\n\nwhere the deficiency subspaces involved are chosen in the form\n\u0012\n\u0013\n\u0012\n\u0013\nw(x)\n0\nF1 (x) :=\n,\nF2 (x) := ikx\n0\ne\nwith w(x) := eiAx\n\ne−iΦ sin kx−sin k(x−L)\nsin kL\n\nλ11 = −\n\n1 − iμk\n,\nD(k)\n\nλ22\n\nand the coefficients λj` (k) given by [Ex97]\n\u0002\n\u0003\nkL\nμ 2k cos Φ−cos\n− α − ω2\nsin kL\n=\nD(k)\n\nω\ntogether with λ12 = λ21 = − D(k)\n, where\n\n\u0015\n\u0014\ncos Φ − cos kL\n− α − iω 2 k .\nD(k) ≡ D(α, μ ω; k) := (1 − iμk) 2k\nsin kL\nIn the case of a δ-coupling, in particular, the coefficients acquire a simple form,\nλjl (k) = −D(k)−1 , j, l = 1, 2 . As expected, the denominator D(k) determining the\nsingularities is the same as for the on-shell S-matrix. A simple form of the condition\nD(k) = 0 allows us to follow the pole trajectories, both with respect to the coupling\nparameters and the flux Φ. At the same time, knowing the resolvent of Hα,μ,ω (B)\nwe can express the decay law for states supported at the initial moment t = 0 on\nthe loop only; we will not go into details and refer the reader to [Ex97] where the\nappropriate formulae and graphs are worked out.\nLet us just mention one amusing feature of this model which can be regarded\nas an analogue of the effect known in particle physics as regeneration in decay of\nneutral kaons and illustrates that intuition may misguide you when dealing with\nquantum systems. Consider the lasso graph with the initial wave function u on\nthe loop such that x 7→ eiAx u(x) has no definite symmetry with respect to the\nconnection point x = 0. If the flux value φ is integer, the A-even component\nrepresents a superposition of embedded-eigenvalue bound states mentioned above,\nthus it survives, while the A-odd one dies out. Suppose that after a sufficiently long\ntime we decouple the lead and attach it at a different point (or we may have a loop\nwith two leads which may be switched on and off independently). For the decay\n\n\fSOLVABLE MODELS OF RESONANCES AND DECAYS\n\n33\n\nof the surviving state the symmetry with respect to the new junction is important;\nfrom this point of view it is again a superposition of an A-even and an A-odd part,\npossibly even with same weights if the distance between the two junctions is 14 L.\n7.5. Resonances from rationality violation. The above simple examples\nillustrated that resonances are a frequent phenomenon in quantum graph models.\nTo underline this point we shall describe in this section another mechanism giving\nrise to resonances, this time without need to change the coupling parameters. The\nobservation behind this claim is that quantum-graph Hamiltonians may have embedded eigenvalues even if no edges are disconnected which is related to the fact\nthat the unique continuation principle is generally not valid here and one can have\ncompactly supported eigenfunctions. Indeed, eigenfunctions of a graph Laplacian\nare trigonometric functions, hence it may happen that the graph has a loop and the\nvertices on it have rationally related distances such that the eigenfunction has zeros\nthere and the rest of the graph 'does not know' about it. Let us present briefly two\nsuch examples referring to [EL10] for more details.\n7.5.1. A loop with two leads. In this case Γ consists of two internal edges of\nlengths l1 , l2 and one halfline attached at each of their endpoints, corresponding to\nthe Hilbert space is L2 (R+ ) ⊕ L2 (R+ ) ⊕ L2 ([0, l1 ]) ⊕ L2 ([0, l2 ]); states of the system\nare correspondingly described by columns ψ = (g1 , g2 , f1 , f2 )T . The Hamiltonian\nH is supposed to act as negative Laplacian, ψ 7→ −ψ 00 , separately on each edge.\nWe consider coupling analogous to (7.7) assuming that the functions of Dom H are\ncontinuous on the loop, f1 (0) = f2 (0) and f1 (l1 ) = f2 (l2 ), and satisfy\nf1 (0) = α1−1 (f10 (0) + f20 (0)) + γ1 g10 (0) ,\n\nf1 (l1 ) = −α2−1 (f10 (l1 ) + f20 (l2 )) + γ2 g20 (0) ,\n\ng1 (0) = γ1 (f10 (0) + f20 (0)) + α̃1−1 g10 (0) ,\n\ng2 (0) = −γ2 (f10 (l1 ) + f20 (l2 )) + α̃2−1 g20 (0) ,\n\nfor some αj , α̃j , γj ∈ R. Since we want to examine behavior of the model with\nrespect to the lengths of internal edges, let us parametrize them as l1 = l(1−λ), l2 =\nl(1 + λ) with λ ∈ [0, 1]; changing λ thus effectively means moving one of the\nconnections points around the loop from the antipolar position for λ = 0 to merging\nof the two vertices for λ = 1. Due to the presence of the semi-infinite leads the\nessential (continuous) spectrum of H is [0, ∞). If we consider the loop itself, it\nhas a discrete spectrum consisting of eigenvalues kn2 where kn = πn\nl with n ∈ Z.\nl\nThe corresponding eigenfunctions have nodes spaced by n for n 6= 0, hence H has\nembedded eigenvalues if the leads are attached to the loop at some of them.\nIf the rationality of the junction distances is violated these eigenvalues turn\ninto resonances. The condition determining the singularities can be found in the\nsame way as in the previous examples; it reads\nh 1\n4k 2\n1 i\nsin2 kl + k\n+\nsin 2kl = 0 ,\nsin kl(1 − λ) sin kl(1 + λ) −\nβ1 (k)β2 (k)\nβ1 (k) β2 (k)\nwhere βi−1 (k) := αi−1 +\n\nik|γi |2\n.\n1−ikα̃−1\ni\n\nOne can solve it perturbatively but also to find\n\nnumerically its solution describing pole trajectories as λ runs through [0, 1]. The\nanalysis presented in [EL10] shows that various situations may occur, for instance,\na pole returning to the real axis after one or more loops in the complex plane -\nan example is shown in Fig. 3 - or a trajectory ending up in the lower halfplane\nat the endpoint of the parameter interval.\n\n\f34\n\nPAVEL EXNER\n\nFigure 3. Trajectory of the resonance pole in the momentum\nplane starting from k0 = 2π corresponding to λ = 0 for l = 1\nand the coefficients values α1−1 = 1, α̃1−1 = −2, γ1 = 1, α2−1 = 0,\nα̃2−1 = 1, γ2 = 1, n = 2.\n7.5.2. A cross-shaped graph. We add one more simple example to illustrate that\nthe same effect may occur even if the graph has no loops. Consider a cross-shaped\nΓ consisting of two leads and two internal edges attached to the leads at one point;\nthe lengths of the internal edges will be l1 = l(1 − λ) and l2 = l(1 + λ). The\nHamiltonian acts again as −d2 /dx2 on the corresponding Hilbert space L2 (R+ ) ⊕\nL2 (R+ ) ⊕ L2 ([0, l1 ]) ⊕ L2 ([0, l2 ]) the elements of which are described by columns\nψ = (g1 , g2 , f1 , f2 )T . For simplicity we restrict our attention to the δ coupling at the\nvertex and Dirichlet conditions at the loose ends, i.e. f1 (0) = f2 (0) = g1 (0) = g2 (0)\nand f1 (l1 ) = f2 (l2 ) = 0 together with the requirement\nf10 (0) + f20 (0) + g10 (0) + g20 (0) = αf1 (0)\nfor α ∈ R. In the same way as above we can derive resonance condition in the form\nk sin 2kl + (α − 2ik) sin kl(1 − λ) sin kl(1 + λ) = 0, or equivalently\n2k sin 2kl + (α − 2ik)(cos 2klλ − cos 2kl) = 0 .\nAsking when the solution is real we note that this happens if the real and imaginary\nparts of the left-hand side vanish. We find easily that it is the case if λ = 1−2m/n ,\nN0 3 m ≤ n/2, while if this rationality relation is violated the poles move into\nthe lower halfplane. The condition can be again solved numerically giving pole\ntrajectories for various parameter values; in addition to the possibilities mentioned\nabove we can have trajectories returning to different embedded eigenvalues - an\nexample shown in Fig. 4 calls to mind the effect of quantum anholonomy [Ch98]\n- as well as avoided trajectory crossings, etc., see [EL10] for more details.\n7.5.3. Local multiplicity preservation. Let us turn from examples to the general case and consider an eigenvalue k02 with multiplicity d of a quantum-graph\nHamiltonian H which is embedded in the continuous spectrum due to rationality\nrelations between the edges of Γ. We consider graphs Γε with modified edge lengths\nlj0 = l0 (nj + εj ) assuming that nj ∈ N for j ∈ {1, . . . , n} while nj may not be an\ninteger for j ∈ {n + 1, . . . , N } where N := ]L. The analysis of the perturbation is\na bit involved, see [EL10] for details, leading to the following conclusion.\n\n\fSOLVABLE MODELS OF RESONANCES AND DECAYS\n\n35\n\nFigure 4. Resonance pole trajectory for α = 1 and n = 2.\nTheorem 7.3. Let Γ be a quantum graph with N finite edges of the\u0001 lengths\nU1 U2\nlj , M infinite edges, and the coupling described by the matrix U = U\n, where\n3 U4\nU4 corresponds to the coupling between the infinite edges. Let k0 > 0 correspond\nto a pole of the resolvent (H − k02 )−1 of multiplicity d. Let Γε be a geometrically\nperturbed quantum graph with edge lengths l0 (nj + εj ) described above and the same\ncoupling as Γ. Then there exists an ε0 > 0 such that for all ~ε ∈ Uε0 (0) the sum of\nmultiplicities of the resolvent poles in the vicinity of k0 is d.\n8. High-energy behavior of quantum-graph resonances\nNow we will look at quantum-graph resonances from a different point of view\nand ask about asymptotics of their numbers at high energies. Following the papers\n[DP11, DEL10] we are going to show, in particular, that it may often happen\nthat this asymptotics does not follow the usual Weyl's law. Following the standard\nconvention we will count in this section embedded eigenvalues among resonances\nspeaking about the poles in the open lower halfplane as of 'true' resonances.\n8.1. Weyl asymptotics criterion. It is useful for our purpose to rewrite the\ncondition (7.5) in terms of the exponentials eiklj and e−iklj using\nPn for brevity the\n±\n±iklj\n±\nN\n±ikV\nsymbols e±\n:=\ne\nand\ne\n:=\nΠ\ne\n=\ne\n,\nwhere\nV\n=\nj=1 j\nj\nj=1 lj is the size of\nthe finite part of Γ. The condition then becomes\n\u001a\n1\n1\nF (k) := det\n[(U −I) + k(U +I)]E1 (k) + [(U −I) − k(U +I)]E2 (k)\n2\n2\n\u001b\n+k(U +I)E3 + (U −I)E4 + [(U −I) − k(U +I)] diag (0, . . . , 0, IM ×M ) = 0 ,\n\u0010\n\u0011\n(1)\n(2)\n(N )\nwhere Ei (k) = diag Ei , Ei , . . . , Ei , 0, . . . , 0 , i = 1, 2, 3, 4, are matrices consisting of N nontrivial 2 × 2 blocks\n\u0012\n\u0013\n\u0012\n\u0013\n\u0012\n\u0013\n\u0012\n\u0013\ni 0\n0 1\n0\n0\n0\n0\n(j)\n(j)\n(j)\n(j)\n=\n,\nE\n=\n,\nE\n=\n.\nE1 =\n,\nE\n2\n3\n4\n−ie+\ne+\nie−\ne−\n0 0\n0 0\nj\nj\nj\nj\nand a trivial M ×M part. To analyze the asymptotics we employ the usual counting\nfunction N (R, F ) defined for an entire function F (*) by\nN (R, F ) = ]{k : F (k) = 0 and |k| < R} ,\n\n\f36\n\nPAVEL EXNER\n\nwhere the algebraic multiplicities of the zeros are taken into account. With the\nabove spectral condition in mind we have to apply it to trigonometric polynomials\nwith rational-function coefficients. We need the following result [DEL10] which is\na simple consequence of a classical theorem by Langer [La31].\nPn\nTheorem 8.1. Let F (k) = r=0 ar (k) eikσr , where ar (k) are rational functions\nof the complex variable k with complex coefficients, and σr ∈ R, σ0 < σ1 < * * * < σn .\nSuppose that limk→∞ a0 (k) 6= 0 and limk→∞ an (k) 6= 0. There exists a compact set\nΩ ⊂ C, real numbers mr and positive Kr , r = 1, . . . , n, such that the zeros of F (k)\noutside Ω lie in one of n logarithmic strips, each one bounded between the curves\n−Im k + mr log |k| = ±Kr . The counting function behaves in the limit R → ∞ as\nσn − σ0\nR + O(1) .\nN (R, F ) =\nπ\nTo apply this result it is useful to pass to effective energy-dependent coupling\n(7.6) which makes it possible to cast the spectral condition into a simpler form,\n\u001a\n1\n(8.1)\n[(Ũ (k) − I) + k(Ũ (k) + I)]Ẽ1 (k)\nF (k) = det\n2\n\u001b\n1\n+ [(Ũ (k) − I) − k(Ũ (k) + I)]Ẽ2 (k) + k(Ũ (k) + I)Ẽ3 + (Ũ (k) − I)Ẽ4 = 0 ,\n2\nwhere Ẽj are the nontrivial 2N × 2N parts of the matrices Ej , the first two of them\nbeing energy-dependent, and I denotes the 2N × 2N unit matrix. Then we have\nthe following criterion [DEL10] for the asymptotics to be of Weyl type.\nTheorem 8.2. Assume a quantum graph (Γ, HU ) corresponding to Γ with\nfinitely many edges and the coupling at vertices Xj given by unitary matrices Uj .\nThe asymptotics of the resonance counting function as R → ∞ is of the form\n2W\nN (R, F ) =\nR + O(1) ,\nπ\nPN\nwhere the effective size of the graph W satisfies 0 ≤ W ≤ V := j=1 lj . Moreover, W < V holds if and only if there exists a vertex where the corresponding\n1+k\nenergy-dependent coupling matrix Ũj (k) has an eigenvalue 1−k\n1+k or 1−k for all k.\nTo prove the theorem one has to realize that σn = V and σ0 = −V , hence\nthe asymptotics is not of Weyl type iff either the senior or the junior coefficient\nin expression of F (k), i.e. those of e± , vanish. By a straightforward computation\n\u0001N\n[DEL10] we find that they equal 2i\ndet [(Ũ (k) − I) ± k(Ũ (k) + I)], respectively,\nand therefore they vanish under the condition stated in the theorem.\nBefore proceeding further, let us mention that the asymptotic number of resonances is not the only thing of interest. One can investigate other asymptotic\nproperties such as the distribution of resonance pole spacings; quantum graphs are\nknown to be a suitable laboratory to study quantum chaotic effects [KoS03].\n8.2. Permutation-symmetric coupling. Let us first look what the above\ncriterion means in a particular class of vertex couplings which are invariant with\nrespect to permutations of the edges connected at the vertex. It is easy to see that\nsuch couplings are described by matrices of the form Uj = aj J + bj I, where aj ,\nbj are complex numbers satisfying |bj | = 1 and |bj + aj deg Xj | = 1; the symbol J\ndenotes the square matrix all of whose entries equal to one and I stands for the\n\n\fSOLVABLE MODELS OF RESONANCES AND DECAYS\n\n37\n\nunit matrix. Important examples are the δ-coupling analogous to (7.10), with the\nfunctions continuous at the vertex and the sum of outward derivatives proportional\n2\nto their common value, corresponding to Uj = dj +iα\nJ − I, where dj is the number\nj\nof edges emanating from the vertex Xj and αj ∈ R is the coupling strength, and the\n2\nJ + I with βj ∈ R for which the roles of\nδs0 -coupling corresponding to Uj = − dj −iβ\nj\nfunctions and derivatives are interchanged. The particular cases αj = 0 and βj = 0\nare usually referred to as the Kirchhoff and anti-Kirchhoff condition, respectively.\nConsider a vertex which connects p internal and q external edges. For matrices\nof the form Uj = aj J + bj I it is an easy exercise to invert them and to find the\neffective energy-dependent coupling; this allows us to make the following claim.\nTheorem 8.3. Let (Γ, HU ) be a quantum graph with permutation-symmetric\ncoupling conditions at the vertices, Uj = aj J + bj I. Then it has a non-Weyl asymptotics if and only if at least one of its vertices is balanced in the sense that p = q,\nand the coupling at this vertex satisfies one the following conditions:\nP2p\n0\n(a) fm = fn , ∀m, n ≤ 2p,\n= 0, i.e. U = p1 J2p×2p − I2p×2p ,\nfm\nPm=1\n2p\n0\n0\ni.e. U = − p1 J2p×2p + I2p×2p .\n(b) fm = fn , ∀m, n ≤ 2p,\nm=1 fj = 0,\nIn other words, if the graph has a balanced vertex there are exactly two situations\nwhen the asymptotics is non-Weyl, either if the coupling is Kirchhoff - which is\nthe case where the effect was first noted in [DP11] - or if it is anti-Kirchhoff.\n8.2.1. An example: a loop with two leads. To illustrate the above claim let us\nreturn to the graph of Example 7.5.1. It is balanced if the two leads are attached at\nthe same point. Changing slightly the notation we suppose that the loop length is l\nand consider negative Laplacian on the Hilbert space is L2 (0, l) ⊕ L2 (R+ ) ⊕ L2 (R+ )\n2,2\nwith its elements written as (u, f1 , f2 )T defined on functions from Wloc\n(Γ) satisfying\nthe requirements u(0) = f1 (0) and u(l) = f2 (0) together with\nαu(0) = u0 (0) + f10 (0) + β(−u0 (l) + f20 (0)) ,\n\nαu(l) = β(u0 (0) + f10 (0)) − u0 (l) + f20 (0)\n\nwith real parameters α and β; the choice β = 1 corresponds to the 'overall' δcoupling of strength α, while β = 0 decouples two 'inner-outer' pairs of mutually\nmeeting edges turning Γ into a line with two δ-interactions at the distance l. In\nterms of the quatities e± = e±ikl the pole condition can be written [DEL10] as\n8\n\niα2 e+ + 4kαβ − i[α(α − 4ik) + 4k 2 (β 2 − 1)] e−\n= 0.\n4(β 2 − 1) + α(α − 4i)\n\nThe coefficient of e+ vanishes iff α = 0, the one in the second term for β = 0 or if\n|β| 6= 1 and α = 0, while the coefficient e− does not vanish for any combination of\nα and β. The graph has thus a non-Weyl asymptotics iff α = 0. If, in addition,\n|β| =\n6 1, then all resonances are confined to a circle, i.e. the graph has zero 'effective\nsize'. The only exceptions are the Kirchhoff condition, β = 1 and α = 0, and its\nanti-Kirhhoff counterpart, β = −1 and α = 0, for which one half of the resonances\nis asymptotically preserved, in other words, the effective size of the graph is 21 l.\nWe can demonstrate how a 'half' of the resonances disappears using the example\nof the δ-coupling, β = 1. The resonance equation in this case becomes\n−α sin kl + 2k(1 + i sin kl − cos kl)\n= 0.\nα − 4i\nA simple calculation shows that the graph Hamiltonian has a sequence of embedded\neigenvalues k 2 with k = 2πn\nl , n ∈ Z, and a family of resonances given by solutions\n\n\f38\n\nPAVEL EXNER\n\nU (2)\n\nU (1)\n\nΓ0\nl0\nFigure 5. Graph with a balanced vertex\nto eikl = −1 +\n\n4ik\nα .\n\nThe former do not depend on α, while the latter behave like\n\n1 1\nIm k = − ln + O(1) , Re k = nπ + O(α) ,\nl\nα\nas α → 0, hence all the 'true' resonances escape to the imaginary infinity in the\nlimit, in analogy with the similar pole behavior described by relation (7.8).\n8.3. The mechanism behind a non-Weyl asymptotics. One naturally\nasks about reasons why graphs with balanced vertices and Kirchhoff/anti-Kirchhoff\ncoupling have smaller than expected effective size. A simple observation is that if\nsuch a vertex has degree one, then Kirchhoff coupling between an external and\ninternal edge is in fact no coupling at all, hence the internal edge can be regarded\nas a part of the lead and the effective size is diminished by its length. We are going\nto show that this remains true in a sense also when the degree is larger than one.\n8.3.1. Kirchhoff 'size reduction'. A graph with a balanced vertex can be always\nthought as having the shape sketched in Fig. 5: with a vertex X1 which connects\np internal edges of the same length l0 and p external edges; if the internal ones\nhave different lengths we simply add a needed number of 'dummy' vertices. We\nwill suppose that the coupling at X1 is invariant with respect to edge permutations\nbeing described by a unitary matrix U (1) = aJ2p×2p + bI2p×2p ; the coupling of the\nother internal edge ends to the rest of the graph, denoted here as Γ0 , is described\nby a q × q matrix U (2) , where q ≥ p (which may express also the topology of Γ0 ).\nTo find how the effective size of such a quantum graph may look like we employ\nthe following property which can be derived easily from coupling condition (7.2).\nProposition 8.4. Let Γ be the graph described above with the coupling given by\narbitrary U (1) and U (2) . Let further V be an arbitrary unitary p × p matrix, V (1) :=\ndiag (V, V ) and V (2) := diag (I(q−p)×(q−p) , V ) be 2p × 2p and q × q block diagonal\nmatrices, respectively. Then H on Γ is unitarily equivalent to the Hamiltonian\nHV on the graph with the same topology and the coupling given by the matrices\n[V (1) ]−1 U (1) V (1) and [V (2) ]−1 U (2) V (2) , respectively.\nApplication to the couplings described by U (1) = aJ2p×2p + bI2p×2p at X1 is\nstraightforward. One has to choose the columns of V as an orthonormal set of\neigenvectors of the corresponding p × p block aJp×p + bIp×p of U (1) , the first one of\nthem being √1p (1, 1, . . . , 1)T . The transformed matrix [V (1) ]−1 U (1) V (1) decouples\nthen into blocks connecting only the pairs (vj , gj ). The first one of these, corresponding to a symmetrization of all the uj 's and fj 's, leads to the 2 × 2 matrix\nU2×2 = apJ2×2 +bI2×2 , while the other lead to separation of the corresponding internal and external edges described by Robin conditions (b−1)vj (0)+i(b+1)vj0 (0) = 0\n\n\fSOLVABLE MODELS OF RESONANCES AND DECAYS\n\nl\n\n39\n\nl\n\nl\n\nl\nl\n\nFigure 6. A polygonal balanced graph.\n\nand (b − 1)gj (0) + i(b + 1)gj0 (0) = 0 for j = 2, . . . , p. We note that it resembles the\nreduction procedure of a tree graph due to Solomyak [SS02].\nIt is easy to see that the 'overall' Kirchhoff/anti-Kirchhoff condition at X1\nis transformed to the 'line' Kirchhoff/anti-Kirchhoff condition in the subspace of\npermutation-symmetric functions, leading to reduction of the graph effective size as\nmentioned above. In all the other cases the point interaction corresponding to the\nmatrix apJ2×2 + bI2×2 is nontrivial, and consequently, the graph size is preserved.\n8.3.2. Global character of non-Weyl asymptotics. The above reasoning might\nlead one to the conclusion that the effect discussed here is of a local character. We\nwant to show now that while this is true concerning the occurrence of non-Weyl\nasymptotics, the effective size of a non-Weyl quantum graph is a global property\nbecause it may depend on the graph Γ as a whole.\nWe will use an example to justify this claim. We shall consider the graph Γn\nwith an integer n ≥ 3 which contains a regular n-gon, each edge of which has length\nl. To each of its vertices two semi-infinite leads are attached, cf. Fig. 6. Hence all\nthe vertices of Γn are balanced, and if the coupling in them is of Kirchhoff type the\neffective size Wn of the graph is by Theorem 8.3 strictly less than the actual size\nVn = n`. It appears, however, that the actual value of the effective size depends in\nthis case on the number n of polygon vertices.\nSince all the internal edges have the same length, the system has a rotational\nsymmetry. One can thus perform a 'discrete Floquet' analysis and investigate cells\nconsisting of two internal and two external edges; the wave functions at the ends\nof the former have to differ by a multiplicative factor ω such that ω n = 1. After a\nsimple computation [DEL10] we conclude that there is a resonance at k 2 iff\n(8.2)\n\n− 2(ω 2 + 1) + 4ωe−ik` = 0.\n\nThe 'Floquet component' Hω of H has thus effective size Wω = 21 l if ω 2 + 1 6= 0\nwhile for ω 2 + 1 = 0 we have no resonances, Wω = 0. Summing finally over all the\nω with ω n = 1 we arrive at the following conclusion.\nTheorem 8.5. The effective size of the graph Γn with Kirhhoff coupling is\n(\n1\nif n 6= 0 mod 4\n2 nl\nWn =\n1\nif n = 0 mod 4\n2 (n−2)l\n\n\f40\n\nPAVEL EXNER\n\nNote that if one puts ω = eiθ in (8.2) the resonance poles behave according to\n\u0011\n1\u0010\nk=\ni ln(cos θ) + 2πn\nl\nwhere n ∈ Z is arbitrary, hence they escape to imaginary infinity as θ → ± 12 π.\nOf course, the Floquet variable is discrete, θ = 2πj\nn , j = 0, 1, . . . , n−1, nevertheless, the limit still illustrates the mechanism of the resonance 'disappearance'; it is\nillustrative to look at the behavior of the solutions for large values of n.\n8.4. Non-Weyl graphs with non-balanced vertices. Now we are going\nto show that there are many more graphs with non-Weyl asymptotics once we\nabandon the assumption of permutation symmetry of the vertex couplings. For the\nsake of brevity, we limit ourselves again to a simple example. In order to formulate\nit, however, we state first a general property of the type of Proposition 8.4 above.\nSpecifically, we will ask what happens if the coupling matrix U of a guantum graph\nis replaced by W −1 U W , where W is a block diagonal matrix of the form\n\u0012 iφ\n\u0013\ne Ip×p 0\nW =\n0\nW4\nand W4 is a unitary q × q matrix. The following claim is obtained easily from (7.2).\nProposition 8.6. The family of resonances of a quantum-graph Hamiltonian\nHU does not change if the original coupling matrix U is replaced by W −1 U W .\nLet us turn now to the example which concerns the graph investigated in\nSec. 7.3, a line with a stub of length l, this time without a potential. Changing\nslightly the notation we use the symbols fj for wave function on the two halflines\nand u for the stub. The function from the domain of any Hamiltonian HU are\nlocally W 2,2 and satisfy the conditions u(l) + cu0 (l) = 0 with c ∈ R ∪ {∞} and\n(U − I) (u(0), f1 (0), f2 (0))T + i(U + I) (u0 (0), f10 (0), f20 (0))T = 0 .\nWe split Γ into two parts in \u0001a way\u0001 different from Sec. 7.3 choosing the coupling\ndescribed by U0 := diag 01 10 , eiψ which gives two halflines with the conditions\nu(l) + cu0 (l) = 0 and f2 (0) + cot ψ2 f20 (0) = 0, respectively, at their endpoints;\nthe first part consists of the halfline number one and the stub joined by Kirchhoff\ncoupling. It is obvious that such a graph has at most two resonances, and thus a\nnon-Weyl asymptotics. We now replace U0 by UW = W −1 U0 W with\n\n\n1\n0\n0\n√\n1 − r2 eiφ2 \nW =  0 √ reiφ1\n0\n1 − r2 eiφ3 −rei(φ2 +φ3 −φ1 )\nfor some r ∈ [0, 1] and obtain for every fixed value of ψ and c a three-parameter\nfamily of coupling conditions described by the unitary matrix\n√\n\n\n0\nreiφ1\n1 − r2 eiφ2\n√\n2 iψ\nUW =  √ re−iφ1\n)e\n−r 1 − r2 e−i(−ψ+φ1 −φ2 )  ,\n√ (1 − r i(ψ+φ\n−iφ2\n2\n2\n1 −φ2 )\n1−r e\n−r 1 − r e\nr2 eiψ\neach of which has the same resonances as U0 by Proposition 8.6. The associated\nquantum graphs are thus of non-Weyl type despite the fact that their edges are\nconnected in a single vertex of Γ which is not balanced.\n\n\fSOLVABLE MODELS OF RESONANCES AND DECAYS\n\n41\n\nNote that among these couplings one can find, in particular, the one mentioned\nabove in connection with relation (7.8); choosing ψ = π and c = 0, and furthermore,\nφ1 = φ2 = 0 and r = 2−1/2 , we get the conditions\n√\n√\nf1 (0) = f2 (0), u(0) = 2f1 (0), f10 (0) − f20 (0) = − 2u0 (0) ,\n√\n√\nor (7.7) with b = 2 and c = d = 0. Similarly, such conditions with b = − 2 and\nc = d = 0 correspond to φ1 = φ2 = π and r = 2−1/2 ; both these quantum graphs\nhave no resonances at all. This fact is easily understandable, for instance, if we\nregard the line with the stub as a tree with the root at the end of the stub and\napply the Solomyak reduction procedure [SS02] mentioned above.\n8.5. Magnetic field influence. Let us finally look how can the high-energy\nasymptotics be influenced by a magnetic field. We have encountered magnetic\nquantum graphs already in the example of Sec. 7.4, now we look at them in more\ngenerality. We consider a graph Γ with a set of vertices {Xj } and set of edges {Ej }\ncontaining N finite edges and M infinite leads. We assume that it is equipped with\nd\nd2\n2\non the\nthe operator H acting as − dx\n2 on the infinite leads and as −( dx + iAj (x))\ninternal edges, where Aj is the tangent component of the vector potential; without\nloss of generality we may neglect it on external leads because one can always remove\nit there by a gauge transformation. The Hamiltonian domain consists of functions\n2,2\nfrom Wloc\n(Γ) which satisfy (Uj −I)Ψj +i(Uj +I)(Ψ0j +iAj Ψj ) = 0 at the vertex Xj .\nAs before it is useful to pass to a graph Γ0 with a single vertex of degree (2N + M )\nin which the coupling is described by the condition\n(U − I)Ψ + i(U + I)(Ψ0 + iAΨ) = 0 ,\nwhere the matrix U consists of the blocks Uj corresponding to the vertices of Γ\nand the matrix A is composed of tangent components of the vector potential at the\nvertices, A = diag (A1 (0), −A1 (l1 ), . . . , AN (0), −AN (lN ), 0, . . . , 0).\nUsing the local gauge transformation ψj (x) 7→ ψj (x)e−iχj (x) with χj (x)0 =\nAj (x) one can get rid of the explicit dependence of coupling conditions on the\nd2\nmagnetic field and arrive thus at the Hamiltonian acting as − dx\n2 with the coupling\nconditions given by a transformed unitary matrix,\n(8.3)\n\n(UA − I)Ψ + i(UA + I)Ψ0 = 0 ,\n\nUA := FU F −1 ,\n\nwith F = diag (1, exp (iΦ1 ), . . . , 1, exp (iΦN ), 1, . . . , 1) containing magnetic fluxes\nRl\nΦj = 0 j Aj (x) dx. Furthermore, one can reduce the analysis to investigation of\nthe compact core of Γ with an effective energy-dependent coupling described by the\nmatrix ŨA (k) obtained from UA in analogy with (7.5).\nTo answer the question mentioned above we employ another property of the\ntype of Proposition\n8.4. This time we consider replacement of U by V −1 U V where\n\u0001\nV1 0\nV = 0 V2 is unitary block-diagonal matrix consisting of a 2N × 2N block V1\nand an M × M block V2 ; resonances are again invariant under this transformation.\nWith respect to the relation between U and ŨA we get the following result [EL11].\nTheorem 8.7. A quantum graph with a magnetic field described by a vector\npotential A is of non-Weyl type if and only if the same is true for A = 0.\nIn other words, magnetic field alone cannot switch a graph with non-Weyl\nasymptotics into Weyl type and vice versa. On the other hand, the magnetic field\ncan change the effective size of a non-Weyl graph. To illustrate this claim, let\n\n\f42\n\nPAVEL EXNER\n\nus return to the example discussed in Sec. 7.5.1, a loop with two external leads\nKirchhoff-coupled to a single point, now we add a magnetic field. It is straightforward to check [EL11] that the condition determining the resonance pole becomes\n−2 cos Φ + e−ikl = 0 ,\nwhere Φ is the magnetic flux through the loop. The graph is non-Weyl as the term\nwith eikl is missing on the left-hand side; if Φ = ±π/2 (mod π), that is, for odd\nmultiples of a quarter of the flux quantum 2π, the l-independent term disappears\nand the effective size of the graph becomes zero.\nThe conclusions of the example can be generalized [EL11] to any graph with\na single internal edge: if the elements of the effective 2 × 2 coupling matrix satisfy\n|ũ12 (k)| = |ũ21 (k)| for any k > 0 there is a magnetic field such that the graph under\nits influence has at most finite number of resonances.\n9. Leaky graphs: a caricature of quantum wire and dots\nA different class of quantum graph models employs Schrödinger operators which\ncan be formally written as −∆ − αδ(x − Γ) where Γ ⊂ Rd is a graph; one usually\nspeaks about 'leaky' graphs. Their advantage is that they can take into account\ntunneling between different parts of the graph as well as its geometry beyond just\nthe edge lengths. A survey of results concerning these models can be found in\n[Ex08]. In particular, even a simple Γ like an infinite non-straight curve can give\nrise to resonances [EN03], however, one needs a numerical analysis to reveal them.\n9.1. The model. Instead we will describe here a simple model of this type\nwhich can be regarded as a caricature description of a system consisting of a quantum wire and one or several quantum dots. The state Hilbert space of the model\nis L2 (R2 ) and the Hamiltonian can be formally written as\n−∆ − αδ(x − Σ) +\n\nn\nX\n\nβ̃i δ(x − y (i) ) ,\n\ni=1\n\nwhere α > 0, Σ := {(x1 , 0); x1 ∈ R2 }, and Π := {y (i) }ni=1 ⊂ R2 \\ Σ. The formal\ncoupling constants of the two-dimensional δ potentials are marked by tildes to\nstress they are not identical with the proper coupling parameters βi which we shall\nintroduce below. Following the standard prescription [AGHH] one can define the\noperator rigorously [EK04] by introducing appropriated boundary conditions on\n2,2\nΣ∪Π. Consider functions ψ ∈ Wloc\n(R2 \\(Σ∪Π))∩L2 continuous on Σ. For a small\nenough ρ > 0 the restriction ψ \u0016Cρ,i to the circle Cρ,i := {q ∈ R2 : |q − y (i) | = ρ} is\nwell defined; we say that ψ belongs to D(Ḣα,β ) iff (∂x21 + ∂x22 )ψ on R2 \\ (Σ ∪ Π)\nbelongs to L2 in the sense of distributions and the limits\n1\nψ \u0016Cρ,i , Ωi (ψ) := lim [ψ \u0016Cρ,i +Ξi (ψ) ln ρ] , i = 1, . . . , n ,\nρ→0\nρ→0 ln ρ\nΞΣ (ψ)(x1 ) := ∂x2 ψ(x1 , 0+) − ∂x2 ψ(x1 , 0−) , ΩΣ (ψ)(x1 ) := ψ(x1 , 0)\nΞi (ψ) := − lim\n\nexist, they are finite, and satisfy the relations\n(9.1)\n\n2πβi Ξi (ψ) = Ωi (ψ) ,\n\nΞΣ (ψ)(x1 ) = −αΩΣ (ψ)(x1 ) ,\n\n\fSOLVABLE MODELS OF RESONANCES AND DECAYS\n\n43\n\nwhere βi ∈ R are the true coupling parameters; we put β = (β1 , . . . , βn ) in the\nfollowing. On this domain we define the operator Ḣα,β : D(Ḣα,β ) → L2 (R2 ) by\nḢα,β ψ(x) = −∆ψ(x)\n\nfor x ∈ R2 \\ (Σ ∪ Π) .\n\nIt is now a standard thing to check that Ḣα,β is essentially self-adjoint [EK04]; we\nshall regard in the following its closure denoted as Hα,β as the rigorous counterpart\nto the above mentioned formal model Hamiltonian.\nTo find the resolvent of Hα,β we start from R(z) = (−∆ − z)−1 which\n√ is for any\n1\nK0 ( −z|x − x0 |),\nz ∈ C \\ [0, ∞) an integral operator with the kernel Gz (x, x0 ) = 2π\n√\nwhere K0 is the Macdonald function and z 7→ z has conventionally a cut along\nthe positive halfline; we denote by R(z) the unitary operator with the same kernel\nacting from L2 (R2 ) to W 2,2 (R2 ). We need two auxiliary spaces, H0 := L2 (R) and\nH1 := Cn , and the corresponding trace maps τj : W 2,2 (R2 ) → Hj which act as\n\u0001\nτ0 ψ := ψ \u0016 Σ , τ1 ψ := ψ \u0016 Π = ψ \u0016 {y(1) } , . . . , ψ \u0016 {y(n) } ,\nrespectively; they allow us to define the canonical embeddings of R(z) to Hi , i.e.\nRiL (z) = τi R(z) : L2 → Hi ,\n\nRLi (z) = [RiL (z)]∗ : Hi → L2 ,\n\nand Rji (z) = τj RLi (z) : Hi → Hj , all expressed naturally through the free Green's\nfunction in their kernels, with the variable range corresponding to a given Hi . The\noperator-valued matrix Γ(z) = [Γij (z)] : H0 ⊕ H1 → H0 ⊕ H1 is defined by\nΓij (z)g := −Rij (z)g\nfor i 6= j and g ∈ Hj ,\n\u0002 −1\n\u0003\nΓ00 (z)f := α − R00 (z) f\nif f ∈ H0 ,\nh\nin\nΓ11 (z)φ := sβl (z)δkl − Gz (y (k) , y (l) )(1−δkl )\nφ for φ ∈ H1 ,\nk,l=1\n\n√\nz\n1\n2π (ln 2i\n\n− ψ(1)) and −ψ(1) is the Euler number.\nwhere sβl (z) = βl + s(z) := βl +\nFor z from ρ(Hα,β ) the operator Γ(z) is boundedly invertible. In particular, Γ00 (z)\nis invertible which makes it possible to employ the Schur reduction procedure one\nmore time and to define the map D(z) : H1 → H1 by\nD(z) = Γ11 (z) − Γ10 (z)Γ00 (z)−1 Γ01 (z) .\n\n(9.2)\n\nWe call it the reduced determinant of Γ; it allows us to write the inverse of Γ(z) as\n[Γ(z)]−1 : H0 ⊕ H1 → H0 ⊕ H1 with the 'block elements' defined by\n−1\n\n= D(z)−1 ,\n\n−1\n\n=\n\n−1\n\n= −Γ00 (z)−1 Γ01 (z)D(z)−1 ,\n\n−1\n\n= −D(z)−1 Γ10 (z)Γ00 (z)−1 ;\n\n[Γ(z)]11\n\n[Γ(z)]00\n\n[Γ(z)]01\n[Γ(z)]10\n\nΓ00 (z)−1 + Γ00 (z)−1 Γ01 (z)D(z)−1 Γ10 (z)Γ00 (z)−1 ,\n\nin the above formulae we use the notation Γij (z)−1 for the inverse of Γij (z) and\n−1\n[Γ(z)]−1\n.\nij for the matrix element of [Γ(z)]\nBefore using this to express the resolvent Rα,β (z) := (Hα,β − z)−1 we introduce\nanother notation which allow us to write Rα,β (z) through a perturbation of the\n'line only' Hamiltonian H̃α describing the system without the point interactions,\ni.e. βi = ∞, i = 1, . . . , n. By [BEKŠ94] the resolvent of H̃α is equal to\nRα (z) = R(z) + RL0 (z)Γ−1\n00 R0L (z)\n\n\f44\n\nPAVEL EXNER\n\nfor z ∈ C\\[− 14 α2 , ∞). We define the map Rα;L1 (z) : H1 → L2 (R2 ) by Rα;1L (z)ψ :=\nRα (z)ψ \u0016Π and Rα;1L (z) : L2 (R2 ) → H1 as its adjoint, Rα;L1 (z) := R∗α;1L (z).\nThe resolvent difference between Hα,β and H̃α is then given by Krein's formula\n[AGHH]. A straightforward computation [EK04] yields now the following result.\nTheorem 9.1. For any z ∈ ρ(Hα,β ) with Im z > 0 we have\nRα,β (z) = R(z) +\n\n1\nX\n\n−1\nRLi (z)[Γ(z)]−1\nRα;1L (z) .\nij RjL (z) = Rα (z) + Rα;L1 (z)D(z)\n\ni,j=0\n\nThe obtained resolvent expressions allow us to investigate various spectral properties of the operator Hα,β [EK04]; here we concentrate only on those related to the\nsubject of the paper, namely to perturbations of embedded eigenvalues.\n9.2. Resonance poles. The mechanism governing resonance and decay phenomena in this model is the tunneling between the points and the line. This interaction can be 'switched off' if the line is removed, in other words, put to infinite\ndistance from the points. Consequently, the 'free' Hamiltonian H̃β := H0,β has the\npoint interactions only. It has m eigenvalues, 1 ≤ m ≤ n of which we assume\n1\n(9.3)\n− α2 < \u000f1 < * * * < \u000fm < 0 ,\n4\ni.e. that the discrete spectrum of H̃β is simple and contained in (the negative\npart of) σ(H̃α ) = σac (Hα,β ) = [− 14 α2 , ∞); this can be always achieved by an\nappropriate choice of the configuration of the set Π and the coupling parameters β.\nLet us specify the interactions sites by their Cartesian coordinates, y (i) = (ci , ai ).\nIt is also useful to introduce the notations a = (a1 , ..., an ) and dij = |y (i) − y (j) | for\nthe distances between the point interactions.\nResolvent poles will be found through zeros of the operator-valued function\n(9.2), more exactly, through the analytical continuation of D(*) to a subset Ω− of\nthe lower halfplane across the segment (− 41 α2 , 0) of the real axis, in a similar way\nto what we did for Friedrichs model using formula (3.3). For the sake of definiteness\nwe employ the notation D(*)(l) , where l = −1, 0, 1 refers to the argument z from\nΩ− , the segment (− 41 α2 , 0), and the upper halfplane, Im z > 0, respectively. Using\nthe resolvent formula of the previous section we see that the first component of the\noperator-valued function D(*)(l) is an n × n matrix with the elements\n\u0001\n√ \u0001\n√\n1\nΓ11;jk (z)(l) = −(1 − δjk )\nK0 djk −z + δjk βj + 1/2π(ln −z − ψ(1))\n2π\nfor all the l. To find an explicit form of the second component let us introduce\n1/2\n\nμij (z, t) :=\n\niα (α − 2i(z − t)1/2 ) ei(z−t)\n25 π\nt1/2 (z − t)1/2\n\n(|ai |+|aj |)\n\neit\n\n1/2\n\n(ci −cj )\n\nand μ0ij (λ, t) := limη→0+ μij (λ + iη, t). Using this notation we can rewrite the\n(l)\nmatrix elements of (Γ10 Γ−1\n00 Γ01 ) (z) appearing in (9.2) in the following form,\nZ ∞\n\u0001\nμ0ij (λ, t)\n(0)\nθij (λ) = P\nλ ∈ − 41 α2 , 0\n1 2 dt + gα,ij (λ) ,\nt − λ − 4α\n0\nZ ∞\nμij (z, t)\n(l)\nθij (z) = l\ndt + (l − 1)gα,ij (z) for l = 1, −1\nt\n−\nz − 41 α2\n0\n\n\fSOLVABLE MODELS OF RESONANCES AND DECAYS\n\n45\n\nwhere P indicates again principal value of the integral, and\ngα,ij (z) :=\n\n2\n1/2\niα\ne−α(|ai |+|aj |)/2 ei(z+α /4) (ci −cj ) .\n2\n1/2\n(z + α /4)\n\nUsing these formulae one has to find zeros of det D(*)(−1) ; we shall sketch the argument referring to [EK04, EIK07] for details. We have mentioned that resonances\nare caused by tunneling between the parts of the interaction support, hence it is\nconvenient to introduce the following reparametrization,\n√\n\nb(a) = (b1 (a), . . . , bn (a))\n\nwith bi (a) := e−|ai |\n\n−\u000fi\n\nand to put η(b(a), z) := det D(z)(−1) . Since the absence of the line-supported\ninteraction can be regarded as putting the line to an infinite distance from the\npoints, it corresponds to b = 0 in which case we have η(0, z) = det Γ11 (z) and the\nzeros are nothing else than the eigenvalues of the point-interaction Hamiltonian H̃β ,\nin other words, η(0, \u000fi ) = 0 , i = 1, . . . , m. Then, in analogy with Sec. 3, we have\nto check that the hypotheses of the implicit-function theorem are satisfied which\nmakes it possible to formulate the following conclusion.\nProposition 9.2. The equation η(b, z) = 0 has for all the bi small enough\nexactly m zeros which admit the following weak-coupling asymptotic expansion,\nzi (b) = \u000fi + O(|b|) + iO(|b|)\n\nwhere\n\n|b| := max bi .\n1≤i≤m\n\nThis result is not very strong, because it does provides just a bound on the\nasymptotic behavior and it does not guarantee that the interaction turns embedded\neigenvalues of H̃β into true resonances. This can be checked in the case n = 1\n[EK04] but it may not be true already for n = 2. The simplest example involves a\npair of point interactions with the same coupling placed in a mirror-symmetric way\nwith respect to Σ. The Hamiltonian can be then decomposed according to parity,\nits part acting on functions even with respect to Σ has a resonance, exponentially\nnarrow in terms of the distance between the points and the line, while the odd one\nhas a embedded eigenvalue independently of the distance. On the other hand, if\nthe mirror symmetry is violated, be it by changing one of the point distances or\none of the coupling constants, the latter turns into a resonance and one can derive\na weak-perturbation expansion [EK04] in a way similar to those of Sec. 4.1.\nLet us also note that the explicit form of the resolvent given in Theorem 9.1\nmakes it possible to find the on-shell S-matrix from energies from the interval\n(− 14 α2 , 0), that is, for states traveling along the 'wire', and to show that their poles\ncoincide with the resolvent poles; for m = 1 this is done in [EK04].\n9.3. Decay of the 'dot' states. The present model gives us one more opportunity to illustrate relations between resonances and time evolution of unstable\nsystems, this time on bound states of the quantum 'dots' decaying due to tunneling\nbetween them and the 'wire'. By assumption (9.3) there is a nontrivial discrete\nspectrum of H̃β embedded in (− 41 α2 , 0), and the respective eigenfunctions are\nr\nm\nX\n\u0001\np\n\u000fj\n(j) (j)\n(j)\nψj (x) =\n−\u000fj |x − y (i) | ,\ndi φi (x) , j = 1, . . . , m , φi (x) := − K0\nπ\ni=1\n\n\f46\n\nPAVEL EXNER\n\nwhere in accordance with [AGHH, Sec. II.3] the coefficient vectors d(j) ∈ Cm solve\n(j)\nthe equation Γ11 (\u000fj )d(j) = 0 and the normalization condition kφi k = 1 gives\n|d(j) |2 + 2Re\n\nm X\ni−1\nX\n\n(j) (j)\n\n(j)\n\n(j)\n\ndi dk (φi , φk ) = 1 .\n\ni=2 k=1\n(1)\n\nIn particular, d = 1 if n = m = 1; if m > 1 and the distances between the points\nof Π are large, the natural length scale being given by (−\u000fj )−1/2 , the cross terms\nare small and the vector lengths |d(j) | are close to one.\nLet us now identify the unstable system Hilbert space Hu = Eu L2 (R2 ) with\nthe span of the vectors ψ1 , . . . , ψm . The decay law of the system prepared at the\ninitial instant t = 0 at a state ψ ∈ Hu is according to (2.1) given by the formula\nPψ (t) = kEu e−iHα,β t ψk2 .\nWe are particularly interested in the weak-coupling situation which in the present\ncase means that the distance between Σ and Π is a large at the scale given by\n(−\u000fm )−1/2 . Let us denote by Ej the one-dimensional projection associated with\nthe eigenfunction ψj , the one can make the following claim [EIK07].\nTheorem 9.3. Suppose that Hα,β has no embedded eigenvalues. Then, with\nthe notation introduced above, we have in the limit |b| → 0, i.e. dist (Σ, Π) → ∞\nkEj e−iHα,β t ψj − e−izj t ψj k → 0 ,\npointwise in t ∈ (0, ∞), which for n = 1 implies |Pψ1 (t) − e2Im z1 t | → 0 as |b| → 0.\nLet us add a couple of remarks. The result implies more generally that for large\nvalues of dist (Σ, Π) the reduced evolution can be approximated by a semigroup.\nOn the other hand, despite the\nR ∞approximately exponential decay in the case n = 1\nthe lifetime defined as Tψ1 = 0 Pψ1 (t) dt diverges; the situation is similar to those\nmentioned is Sections 3 and 5.1: the operator Hα,β has a bound state which is\nnot exactly orthogonal to ψ1 for b 6= 0, cf. [EK04], hence limt→∞ Pψ1 (t) 6= 0.\nFurthermore, the decay of the 'dot' states in this model offers a possibility to\ncompare the 'stable' dynamics, i.e. evolution of vector in Hu governed e−iH̃β t , with\nthe Zeno dynamics obtained from e−iHα,β t by permanent observation. cf. [EIK07]\nfor details. Finally, let us finally mention that a related model with a singular\ninteraction in R3 supported by a line and a circle and resonances coming from a\nsymmetry violation has been investigated recently in [Ko12].\n10. Generalized graphs\nIn the closing section we will mention another class of solvable models in which\nresonances can be studied, which may be regarded as another generalization of the\nquantum graphs discussed in Section 7. What they have in common is that the\nconfiguration space consists of parts connected together through point contacts. In\nthe present case, however, we consider parts of different dimensions; for simplicity\nwe limit ourselves to the simplest situation when the dimensions are one and two.\n10.1. Coupling different dimensions. To begin with we have to explain\nhow such a coupling can be constructed. The technique is known since [EŠ87],\nwe demonstrate it on the simplest example in which a halfline lead is coupled to a\nplane. In this case the state Hilbert space is L2 (R− ) ⊕ L2 (R2 ) and the Hamiltonian\n\n\fSOLVABLE MODELS OF RESONANCES AND DECAYS\n\n47\n\n\u0001\n\u0001\n00\n−ψlead\nlead\nacts on its elements ψψplane\n(belonging locally to W 2,2 ) as −∆ψ\n; to make\nplane\nsuch an operator self-adjoint one has to impose suitable boundary conditions which\ncouple the wave functions at the junction.\nThe boundary values to enter such boundary condition are obvious on the\n0\nlead side being the columns of the values ψlead (0+) and ψlead\n(0+). On the other\nhand, in the plane we have to use generalized ones analogous to those appearing\nin the first relation of (9.1). If we restrict two-dimensional Laplacian to functions\nvanishing at the origin and take an adjoint to such an operator, the functions in\nthe corresponding domain will have a logarithmic singularity at the origin and the\ngeneralized boundary values will be the coefficients in the corresponding expansion,\n1\nL0 (ψplane ) ln |x| + L1 (ψplane ) + o(|x|) ;\nψplane (x) = −\n2π\nusing them we can write the sought coupling conditions as\n(10.1)\n\n0\nψlead\n(0+)\n\nL1 (ψplane )\n\n= Aψlead (0+) + 2π C̄L0 (ψplane ) ,\n= Cψlead (0+) + DL0 (ψplane ) ,\n\nwhere A, D ∈ R and C is a complex number, or more generally\n\u0012\n\u0013\n\u0012 0\n\u0013\nψlead (0+)\nψlead (0+)\nA\n+B\n=0\nL0 (ψplane )\nL1 (ψplane )\nwith appropriately chosen matrices A, B in analogy with (7.2), however, for our\npurpose here the generic conditions (10.1) are sufficient.\nAs in the case of quantum graphs the choice of the coupling based on the\nprobability current conservations leaves many possibilities open and the question\nis which ones are physically plausible. This is in general a difficult problem. A\nnatural strategy would be to consider leads of finite girth coupled to a surface and\nthe limit when the transverse size tends to zero. While for quantum graphs such\nlimits are reasonably well understood nowadays [Gr08, EP09, CET10], for mixed\ndimensions the current knowledge is limited to heuristic results such as the one in\n[EŠ97] which suggests that an appropriate parameter choice in (10.1) might be\nr\n2π\n1\n1\n, B=\n, C=√\n, D = − ln ρ ,\n(10.2)\nA=\n2ρ\nρ\n2πρ\nwhere ρ is the contact radius. At the same time, other possibilities have been considered such as the simplest choice keeping just the coupling term, A = D = 0, or an\nindirect approach based on fixing the singularity of the Hamiltonian Green's function at the junction which avoids using the coupling conditions explicitly [Ki97].\nWhile the example concerned a particular case, the obtained coupling conditions are of a local character and can be employed whenever we couple a onedimensional lead to a locally smooth surface. In this way one can treat a wide class\nof such systems, in particular to formulate the scattering theory on configuration\nspaces consisting of a finite numbers of manifolds, finite and infinite edges - one\nsometimes speaks about 'hedgehog manifolds' - cf. [BG03].\nBefore turning to an example of resonances on such a 'manifold' let us mention\nthat while the system of a plane and a halfline lead considered above has at most\ntwo resonances coming from the coupling, one can produce an infinite series of them\nif the motion in the plane is under influence of a magnetic field. The same is true\neven if Laplacian is replaced by a more complicated Hamiltonian describing other\nphysical effects such as spin-orbit interaction - cf. [CE11].\n\n\f48\n\nPAVEL EXNER\n\n10.2. Transport through a geometric scatterer. Let us look in more detail into an important example in which we have a 'geometric scatterer' consisting\nof a compact and connected manifold Ω, which may or may not have a boundary,\nto which two semi-infinite leads are attached at two different points x1 , x2 from the\ninterior of Ω. One may regard such a system as a motion on the line which is cut\nand the loose ends are attached to a black-box\nwhich\ncan be characterized\n\u0001 object\n\u0001\nu(0−)\nby the appropriate transfer matrix, uu(0+)\n=\nL\n.\nTo\nfind the latter one\n0 (0+)\nu0 (0−)\nhas to fix the dynamics: we suppose that the motion on the line is free being described by the negative Laplacian, while the manifold part of the Hamiltonian is\nLaplace-Beltrami operator on the state Hilbert space L2 (Ω) of the scatterer; they\nare coupled by conditions (10.1) with the coefficients indexed by j = 1, 2 referring\nto the 'left' and 'right' lead, respectively.\nWe need the Green function G(., .; k) of the Laplace-Beltrami operator which\nexists whenever the k 2 does not belong to the spectrum. Its actual form depends on\nthe geometry of Ω but the diagonal singularity does not: the manifold Ω admits in\nthe vicinity of any point a local Cartesian chart and the Green's function behaves\nwith respect to those variables as that of Laplacian in the plane,\n1\nln |x−y| + O(1) ,\n|x−y| → 0 .\n2π\nLooking for transient solutions to the Schrödinger equation at energy k 2 , we note\nthat its manifold part can be written as u(x) = a1 G(x, x1 ; k) + a2 G(x, x2 ; k),\ncf. [Ki97], which allows us to find the generalized boundary values\naj\nL0 (xj ) = −\n,\nL1 (xj ) = aj ξ(xj , k) + a3−j G(x1 , x2 ; k)\n2π\nfor j = 1, 2, where we have employed the regularized Green's function at xj ,\n\u0014\n\u0015\nln |x−xj |\n(10.3)\nξ(xj ; k) := lim G(x, xj ; k) +\n.\nx→xj\n2π\nG(x, y; k) = −\n\nLet uj be the wave function on the j-th lead; using the abbreviations uj , u0j for\nits boundary values we get from the conditions (10.1) a linear system which can\nbe easily solved [ETV01]; it yields the transfer matrix in terms of the quantities\nd\nZj := 2πj + ξj and ∆ := g 2 − Z1 Z2 , where ξj := ξ(xj ; k) and g := G(x1 , x2 ; k).\nThe expression simplifies if the couplings are the same at the two junctions; then\ndet L = 1 and the transfer matrix is given by\n!\nZ2 + CA2 ∆\n−2 C∆2\n1\n.\nL=\n2\ng\nC 2 − A(Z1 +Z2 ) − A2 ∆ A2 ∆ + Z1\nC\n\nC\n\nFrom here one can further derive the on-shell scattering matrix [ETV01], in particular, the reflection and transmission amplitudes are\nr=−\n\nL21 + ik(L22 −L11 ) + k 2 L12\n,\nL21 − ik(L22 +L11 ) − k 2 L12\n\nt=−\n\n2ik\n;\nL21 − ik(L22 +L11 ) − k 2 L12\n\nthey naturally depend on k through ξ and g, and satisfy |r|2 +|t|2 = 1. To find these\nquantities for a particular Ω we may use the fact that it is compact by assumption, hence the Laplace-Beltrami operator on it has a purely discrete spectrum. We\nemploy the eigenvalues, {λn }∞\nn=1 , numbered in ascending order and with the multiplicity taken into account, corresponding to eigenfunctions {φn }∞\nn=1 which form an\n\n\fSOLVABLE MODELS OF RESONANCES AND DECAYS\n\n49\n\northonormal basis in L2 (Ω). The common Green's function expression then gives\ng(k) =\n\n∞\nX\nφn (x1 )φn (x2 )\n,\nλn − k 2\nn=1\n\nwhile the regularized value (10.3) can be expressed [EŠ97] as\n\u0013\n∞ \u0012\nX\n|φn (xj )|2\n1\nξ(xj , k) =\n−\n+ c(Ω) ,\nλn − k 2\n4πn\nn=1\nwhere the series is absolutely convergent and the constant c(Ω) depends on the\nmanifold G. Note that a nonzero value of c(Ω) amounts in fact just to a coupling\nparameter renormalization: Dj has to be changed to Dj + 2πc(Ω) .\nSeveral examples of such a scattering has been worked out in the literature,\nmostly for the case when Ω is a sphere. If the coupling is chosen according to (10.2)\nand the leads are attached at opposite poles, the transmission probability has resonance peaks around the values λn where the transmission probability is close to one,\nand a background, dominating at high energies, which behaves as O(k −2 (ln k)−1 ),\ncf. [ETV01]. Similar behavior can be demonstrated for other couplings at the junctions [Ki97]; the background suppression is faster if the junctions are not antipolar\n[BGMP02]. Recall also that this resonance behavior is manifested in conductance\nproperties of such systems as a function of the electrochemical potential given by\nthe Landauer-Büttiker formula, see e.g. [BGMP02].\n10.3. Equivalence of the resonance notions. Let us return finally to a\nmore general situation4 and consider a 'hedgehog' consisting of a two-dimensional\nRiemannian manifold Ω, compact, connected, and for simplicity supposed to be\nembedded into R3 , endowed with a metric grs , to which a finite number nj of\nhalfline leads is attached at points\nP xj , j = 1, . . . , n belonging to a finite subset {xj }\nof the interior of Ω; by M = j nj we denote the total number of the leads. The\np\nLM\n(i)\nHilbert space will be correspondingly H = L2 (Ω, |g| dx) ⊕ i=1 L2 (R+ ).\n−1/2\nLet H0 be the closure of the Laplace-Beltrami operator −g\n∂r (g 1/2 g rs ∂s )\n∞\ndefined on functions from C0 (Ω); if ∂Ω 6= ∅ we require that they satisfy there\nappropriate boundary conditions, either Neumann/Robin, (∂n + γ)f |∂Ω = 0, or\nDirichlet, f |∂Ω = 0. The restriction H00 of H0 to the domain {f ∈ D(H0 ) : f (xj ) =\n0, j = 1, . . . , n} is a symmetric operator with deficiency indices (n, n). Further(i)\nmore, we denote by Hi the negative Laplacian on L2 (R+ ) referring to the i-th\nlead and by Hi0 its restriction to functions which vanish together with their first\n0\nis\nderivative at the halfline endpoint. The direct sum H 0 = H00 ⊕ H10 ⊕ * * * ⊕ HM\nobviously a symmetric operator with deficiency indices (n + M, n + M ).\nAs before admissible Hamiltonians are identified with self-adjoint extensions\nof the operator H 0 being described by the conditions (7.2) where U is now an\n(n+M )×(n+M ) unitary matrix, I the corresponding unit matrix, and furthermore,\nΨ = (L1,1 (f ), . . . , L1,n (f ), f1 (0), . . . , fn (0))T and is Ψ0 the analogous column of\n(generalized) boundary values with L1,j (f ) replaced by L0,j (f ) and f1 (0) by fj0 (0),\nrespectively. The first n entries correspond to the manifold part being equal to the\n4Considerations of this section follow the paper [EL12]. Similarly one can treat 'hedgehogs'\nwith three-dimensional manifolds, just replacing logarithmic singularities by polar ones.\n\n\f50\n\nPAVEL EXNER\n\nappropriate coefficients in the expansion of functions f ∈ D(H0∗ ) the asymptotic\nexpansion near xj , namely f (x) = L0,j (f )F0 (x, xj ) + L1,j (f ) + O(r(x, xj )), where\nq2 (x, xj )\nln r(x, xj )\n2π\nwith r(x, xj ) being the geodetic distance on Ω; according to Lemma 4 in [BG03] q2\nis a continuous functions of x with qi (xj , xj ) = 1. The extension described by such\nconditions will be denoted as HU . We are naturally interested in local couplings;\nin analogy with considerations of Section 7.1 we can work with one 'large' matrix\nU and encode the junction geometry in its block structure.\nAnother useful thing we can adopt from the previous discussion is the possibility\nto employ conditions (Ũj (k) − I)dj (f ) + i(Ũj (k) + I)cj (f ) = 0 on the manifold Ω\nitself with the effective, energy-dependent coupling described by the matrix\nF0 (x, xj ) = −\n\nUj (k) = U1j − (1 − k)U2j [(1 − k)U4j − (k + 1)I]−1 U3j\nat the j-th lead endpoint, where U1j denotes top-left entry of Uj , U2j the rest of\nthe first row, U3j the rest of the first column and U4j is nj × nj part corresponding\nto the coupling between the leads attached to the manifold at the same point.\nTo find the on-shell scattering matrix at energy k 2 one has to couple solutions\naj (k)e−ikx + bj (k)eikx on the leads to solution on the manifold and to look at\nthe continuation of the result to the complex plane. On the other hand to find\nthe resolvent singularities, we can again employ the complex scaling and to find\ncomplex eigenvalues of the resulting non-selfadjoint operator. In both cases we\nneed the solution on the manifold; modifying the conclusions\nPn of [Ki97] mentioned\nabove we can infer that it has to be of the form f (x, k) = j=1 cj G(x, xj ; k),\nConsider first the scattering resonances. Denoting the coefficient vector of\nf (x, k) as c and using similar abbreviations a for the vector of the amplitudes of\nthe incoming waves, (a1 (k), . . . , aM (k))T , and b for the vector of the amplitudes of\nthe outgoing waves, one obtains in general a system of equations,\nA(k)a + B(k)b + C(k)c = 0 ,\nin which A and B are (n+M )×M matrices and C is (n+M )×n matrix the elements\nof which are exponentials and Green's functions, regularized if necessary; what is\nimportant that all the entries of the mentioned matrices allow for an analytical\ncontinuation which makes it possible to ask for complex k for which the above\nsystem is solvable. For k02 6∈ R the columns of C(k0 ) are linearly independent and\none can eliminate c and rewrite the above system as\nÃ(k0 )a + B̃(k0 )b = 0 ,\nwhere Ã(k0 ) and B̃(k0 ) are M × M matrices the entries of which are rational\nfunctions of the entries of the previous ones. If det Ã(k0 ) = 0 there is a solution\nwith b = 0, and consequently, k0 should be an eigenvalue of H since Im k0 < 0\nand the corresponding eigenfunction belongs to L2 , however, this contradicts to the\nself-adjointness of H. Next we notice that the S-matrix analytically continued to\nthe point k0 equals −B̃(k0 )−1 Ã(k0 ) hence its singularities must solve det B̃(k) = 0.\nOn the other hand, for resolvent resonances we use exterior complex scaling\nwith arg θ > arg k0 , then the solution aj (k)e−ikx on the j-th lead, analytically\ncontinued to the point k = k0 , is after the transformation by Uθ exponentially\nincreasing, while bj (k)eikx becomes square integrable. This means that solving in\nL2 the eigenvalue problem for the complex-scaled operator one has to find solutions\n\n\fSOLVABLE MODELS OF RESONANCES AND DECAYS\n\n51\n\nof the above system with a = 0 which leads again to the condition det B̃(k) = 0.\nThis allows us to make the following conclusion.\nTheorem 10.1. In the described setting, the hedgehog system has a scattering\nresonance at k0 with Im k0 < 0 and k02 6∈ R iff there is a resolvent resonance at k0 .\nAlgebraic multiplicities of the resonances defined in both ways coincide.\nReferences\n[AC71] J. Aguilar, J.-M. Combes: A class of analytic perturbation for one-body Schrödinger\nHamiltonians, Commun. Math. Phys. 22 (1971), 269–262.\n[AGHH] S. Albeverio, F. Gesztesy, R. Hoegh-Krohn, and H. Holden: Solvable Models in Quantum\nMechanics, 2nd ed. with appendix by P. Exner, AMS Chelsea, Rhode Island, 2005.\n[AJS] W.O. Amrein, J.M. Jauch, K.B. Sinha: Scattering theory in quantum mechanics: physical\nprinciples and mathematical methods, W.A. Benjamin, Reading, Mass. 1977.\n[AEŠS94] J.-P. Antoine, P. Exner, P. Šeba, J. Shabani: A mathematical model of heavy–quarkonia\nmesonic decays, Ann. Phys. 233 (1994), 1–16.\n[AGS87] J.-P. Antoine, F. Gesztesy, J. Shabani: Exactly solvable models of sphere interactions in\nquantum mechanics, J. Phys. A: Math. Gen. 20 (1987), 3687–3712.\n[APV00] A. Aslanyan, L. Parnovski, D. Vassiliev: Complex resonances in acoustic waveguides,\nQuart. J. Mech. Appl. Math. 53 (2000), 429–447.\n[BFS98] V. Bach, J. Fröhlich, I.M. Sigal: Quantum Electrodynamics of confined nonrelativistic\nparticles, Adv. Math. 137 (1998), 299–395.\n[BC71] E. Balslev and J.-M. Combes: Spectral properties of many-body Schrödinger operators\nwith dilatation-analytic interactions, Commun. Math. Phys. 22 (1971), 280–294.\n[Be96] M.V. Berry: Quantum fractals in boxes, J. Phys. A: Math. Gen. 29 (1996), 6617–6629.\n[BG88] M.V. Berry, J. Goldberg: Renormalization of curlicues, Nonlinearity 1 (1988), 1–26.\n[BN67] J. Beskow, J. Nilsson: The concept of wave function and the irreducible representations\nof the Poincaré group, II. Unstable systems and the exponential decay law, Arkiv Fys. 34\n(1967), 561–569.\n[BGS77] R. Blanckenbecler, M.L. Goldberger, B. Simon: The bound states of weakly coupled\nlong-range one-dimensional quantum Hamiltonians, Ann. Phys. 108 (1977), 69–78.\n[BEKŠ94] J.F. Brasche, P. Exner, Yu.A. Kuperin, P. Šeba: Schrödinger operators with singular\ninteractions, J. Math. Anal. Appl. 184 (1994), 112–139.\n[BG03] J.Brüning, V.A. Geyler: Scattering on compact manifolds with infinitely thin horns, J.\nMath. Phys. 44 (2003), 371-405.\n[BGMP02] J.Brüning, V.A. Geyler, V.A. Margulis, M.A. Pyataev: Ballistic conductance of a\nquantum sphere, J. Phys. A: Math. Gen. 35 (2002), 4239-4247.\n[CCF09] C. Cacciapuoti, R. Carlone, R. Figari: Resonances in models of spin-dependent point\ninteractions, J. Phys. A: Math. Theor. 42 (2009), 035202\n[CE11] R. Carlone, P. Exner: Dynamics of an electron confined to a \"hybrid plane\" and interacting\nwith a magnetic field, Rep. Math. Phys. 67 (2011), 211–227.\n[Ch98] Taksu Cheon: Double spiral energy surface in one-dimensional quantum mechanics of\ngeneralized pointlike potentials, Phys. Lett. A248 (1998), 285-289.\n[CET10] T. Cheon, P. Exner, O. Turek: Approximation of a general singular vertex coupling in\nquantum graphs, Ann. Phys. 325 (2010), 548–578.\n[Ch] P.R. Chernoff: Product Formulas, Nonlinear Semigroups, and Addition of Unbounded Operators, Mem. Amer. Math. Soc., vol. 140; Providence, R.I. 1974.\n[CSM77] C.B. Chiu, E.C.G. Sudarshan, B. Misra: Time evolution of unstable states and a resolution to Zeno's paradox, Phys. Rev. D16 (1977), 520–529.\n[Da] E.B. Davies: Quantum Theory of Open Systems, Academic Press, London 1976.\n[DEL10] E.B. Davies, P. Exner, J. Lipovský: Non-Weyl asymptotics for quantum graphs with\ngeneral coupling conditions, J. Phys. A: Math. Theor. 43 (2010), 474013.\n[DP11] E.B. Davies, A. Pushnitski: Non-Weyl resonance asymptotics for quantum graphs, Analysis and PDE 4 (2011), 729-756.\n[De76] M. Demuth: Pole approximation and spectral concentration, Math. Nachr. 73 (1976),\n65–72.\n\n\f52\n\nPAVEL EXNER\n\n[DR07] J. Dereziński, W. De Roeck: Extended weak coupling limit for Friedrichs Hamiltonians,\nJ. Math. Phys. 48 (2007), 012103.\n[DJN11] V. Dinu, A. Jensen, G. Nenciu: Perturbations of near threshold eigenvalues: crossover\nfrom exponential to non-exponential decay laws, Rev. Math. Phys. 23 (2011), 83–125.\n[DE87-89] J. Dittrich, P. Exner: A non–relativistic model of two–particle decay I–IV, Czech. J.\nPhys. B37 (1987), 503–515, 1028–1034, B38 (1988), 591–610, B39 (1989), 121–138.\n[DEH04] J. Dittrich, P. Exner, M. Hirokawa: A model of interband radiative transition, J. Math.\nSoc. Japan 56 (2004), 753–786.\n[DEM01] P. Duclos, P. Exner, B. Meller: Open quantum dots: resonances from perturbed symmetry and bound states in strong magnetic fields, Rep. Math. Phys. 47 (2001), 253–267.\n[ELV94] D.V. Evans, D.M. Levitin, D. Vassiliev: Existence theorem for trapped modes, J. Fluid\nMech. 261 (1994), 21–31.\n[Ex76] P. Exner: Remark on the energy spectrum of a decaying system, Commun. Math. Phys.\n50 (1976), 1–10.\n[Ex] P. Exner: Open Quantum Systems and Feynman Integrals; Fundamental Theories of Physics,\nvol. 6, D. Reidel, Dordrecht 1985.\n[Ex91] P. Exner: A solvable model of two-channel scattering, Helv. Phys. Acta 64 (1991), 592–\n609.\n[Ex97] P. Exner: Magnetoresonances on a lasso graph, Found. Phys. 27 (1997), 171–190.\n[Ex05] P. Exner: Sufficient conditions for the anti-Zeno effect, J. Phys. A: Math. Gen. 38 (2005),\nL449–454.\n[Ex08] P. Exner: Leaky quantum graphs: a review, in [EKKST], pp. 523–564.\n[EF06] P. Exner, M. Fraas: Resonance asymptotics in the generalized Winter model, Phys. Lett.\nA360 (2006), 57–61.\n[EF07] P. Exner, M. Fraas: The decay law can have an irregular character, J. Phys. A: Math.\nTheor. A40 (2007), 1333–1340.\n[EIK07] P. Exner, T. Ichinose, S. Kondej: On relations between stable and Zeno dynamics in\na leaky graph decay model, in Proceedings of the Conference \"Operator Theory and Mathematical Physics\" (Bȩdlewo 2004); Operator Theory: Advances and Applications, vol. 174,\nBirkhäuser, Basel 2007; pp. 21–34.\n[EKKST] P. Exner, J.P. Keating, P. Kuchment, T. Sunada, A. Teplayaev, eds.: Analysis on\ngraphs and its applications, Proc. Symp. Pure Math., vol. 77; Amer. Math. Soc., Providence,\nR.I., 2008.\n[EK04] P. Exner, S. Kondej: Schrödinger operators with singular interactions: a model of tunneling resonances, J. Phys. A: Math. Gen. 37 (2004), 8255–8277.\n[EL10] P. Exner, J. Lipovský: Resonances from perturbations of quantum graphs with rationally\nrelated edges, J. Phys. A: Math. Theor. 43 (2010), 105301.\n[EL11] P. Exner, J. Lipovský: Non-Weyl resonance asymptotics for quantum graphs in a magnetic\nfield, Phys. Lett. A375 (2011), 805–807.\n[EL12] P. Exner, J. Lipovský: Resonances on hedgehog manifolds, in preparation\n[EN03] P. Exner, K. Němcová: Leaky quantum graphs: approximations by point interaction\nHamiltonians, J. Phys. A: Math. Gen. 36 (2003), 10173–10193.\n[EP07] P. Exner, O. Post: Convergence of resonances on thin branched quantum wave guides, J.\nMath. Phys. 48 (2007), 092104.\n[EP09] P. Exner, O. Post: Approximation of quantum graph vertex couplings by scaled\nSchrödinger operators on thin branched manifolds, J. Phys. A: Math. Theor. 42 (2009),\n415305.\n[EŠ87] P. Exner, P. Šeba: Quantum motion on a halfline connected to a plane, J. Math. Phys.\n28 (1987), 386–391; erratum p. 2254.\n[EŠ97] P. Exner, P. Šeba: Resonance statistics in a microwave cavity with a thin antenna, Phys.\nLett. A228 (1997), 146–150.\n[EŠ94] P. Exner, E. Šerešová: Appendix resonances on a simple graph, J. Phys. A: Math. Gen.\n27 (1994), 8269–8278.\n[ETV01] P. Exner, M. Tater, D. Vaněk: A single-mode quantum transport in serial-structure\ngeometric scatterers, J. Math. Phys. 42 (2001), 4050–4078.\n[ET92] P. Exner, A. Truman: Models of K–capture decay: stochastic vs. quantum mechanics,\nin Proc. of the Conference on Stochastic and Quantum Mechanics (Swansea 1990); World\nScientific, Singapore 1992;pp. 130–150.\n\n\fSOLVABLE MODELS OF RESONANCES AND DECAYS\n\n53\n\n[FP08] P. Facchi, S. Pascazio: Quantum Zeno dynamics: mathematical and physical aspects, J.\nPhys. A: Math. Theor. 41 (2008), 493001.\n[Fe] E. Fermi: Notes on Quantum Mechanics. A Course given at the University of Chicago in\n1954, edited by E. Segré, University of Chicago Press 1960.\n[Fr72] C. Friedman: Semigroup product formulas, compressions and continuous observation in\nquantum mechanics, Indiana Math. J. 21 (1971/72), 1001–1011.\n[Fr48] K.O. Friedrichs: On the perturbation of continuous spectra, Commun. (Pure and) Appl.\nMath. 1 (1948), 361–406.\n[Ga28] G. Gamow: Zur Quantentheorie des Atomkernes, Z. Phys. 51 (1928), 204–212.\n[GMM95] G. Garcı́a-Calderón, J.L. Mateos, M .Moshinsky: Resonant spectra and the time evolution of the survival and nonescape probabilities, Phys. Rev. Lett. 74 (1995), 337–340.\n[GG] V.I. Gorbachuk, M.L. Gorbachuk: Boundary Value Problems for Operator Differential\nEquations, Kluwer, Dordrecht 1991.\n[Gr08] D. Grieser: Spectra of graph neighborhoods and scattering, Proc. London Math. Soc. 97\n(2008), 718–752.\n[Ha00] M. Harmer: Hermitian symplectic geometry and extension theory, J. Phys. A: Math. Gen.\n33 (2000), 9193–9203.\n[HHH08] D. Hasler, I. Herbst, M. Huber: On the lifetime of quasi-stationary states in nonrelativistic QED, Ann. H. Poincaré 9 (2008),1005–1028.\n[HE73] M. Havlı́ček, P. Exner: Note on the description of an unstable system, Czech. J. Phys.\nB23 (1973), 594–600.\n[Hö58] G. Höhler: Über Exponential näherung beim Teilchenzerfall, Z. Phys. 152 (1958), 546–\n565.\n[vH55] L. van Hove: Quantum-mechanical perturbations giving rise to a statistical transport\nequation, Physica 21 (1955), 517–540.\n[Ho74] J.S. Howland: Puiseux series for resonances at an embedded eigenvalue, Pacific J. Math.\n55 (1974), 157–176.\n[Je78] A. Jensen: Local decay in time of solutions to Schrödinger equation with a dilation-analytic\ninteraction, Manuscripta Math. 25 (1978), 61–77.\n[Ka] T. Kato: Perturbation Theory for Linear Operators, 2nd edition, Springer, Berlin 1976.\n[Kh57] L.A. Khalfin: Contribution to the decay theory of a quasi-stationary state, Soviet Phys.\nJETP 33 (1958), 1371–1382; transl. 6 (1958), 1053–1063.\n[Ki97] A. Kiselev: Some examples in one-dimensional 'geometric' scattering on manifolds, J.\nMath. Anal. Appl. 212 (1997), 263–280.\n[Ko12] S. Kondej: Resonances induced by broken symmetry in a system with a singular potential,\nAnn. H. Poincaré 13 (2012), to appear\n[KS00] V. Kostrykin, R. Schrader: Kirchhoff's rule for quantum wires II: The inverse problem\nwith possible applications to quantum computers, Fortschr. Phys. 48 (2000), 703–716.\n[KS03] V. Kostrykin, R. Schrader: Quantum wires with magnetic fluxes, Comm. Math. Phys.\n237 (2003), 161–179.\n[KoS03] T. Kottos, U. Smilansky: Quantum graphs: a simple model for chaotic scattering, J.\nPhys. A: Math. Gen. 36 (2003), 3501–3524.\n[Ku08] P. Kuchment: Quantum graphs: an introduction and a brief survey, in [EKKST], pp. 291–\n314.\n[La31] R.E. Langer: On the zeros of exponential sums and integrals, Bull. Amer. Math. Soc. 37\n(1931), 213–239.\n[Lee54] T.D. Lee: Some special examples in renormalizable field theory, Phys. Rev. 95 (1954),\n1329-1334.\n[MS77] B. Misra, E.C.G. Sudarshan: The Zeno's paradox in quantum theory, J. Math. Phys. 18\n(1977), 756–763.\n[Mo98] N. Moiseyev: Quantum theory of resonances : calculating energies, widths and crosssections by complex scaling, Phys. Rep. 302 (1998), 211–293.\n[Mo96] A.K. Motovilov: Removal of the resolvent-like dependence on the spectral parameter from\nperturbations, Z. Angew. Math. Mech., Special Issue 2 (ISBN 3-05-501745-5) (1996), 229–232.\n[Ne] E. Nelson: Dynamical Theories of Brownian Motion, Princeton University Press 1967.\n[Nö92] J.U. Nöckel: Resonances in quantum–dot transport, Phys. Rev. B46 (1992), 15348–15356.\n[Pa10] K. Pankrashkin: Sur l'analyse de modeles mathématiques issus de la mécanique quantique,\nHDR thèse, University Paris-Sud 2010.\n\n\f54\n\nPAVEL EXNER\n\n[RS] M. Reed and B. Simon: Methods of Modern Mathematical Physics, I. Functional Analysis,\nII. Fourier Analysis. Self-Adjointness, III. Scattering Theory, IV. Analysis of Operators,\nAcademic Press, New York 1972–79.\n[RS53] K. Ruedenberg, C.W. Scherr: Free-electron network model for conjugated systems, I.\nTheory, J. Chem. Phys. 21 (1953), 1565–1581.\n[Sch04] A.U. Schmidt: Mathematics of the quantum Zeno effect, in Mathematical Physics Research on Leading Edge (Ch. Benton, ed.), Nova Sci, Hauppauge NY, 2004; pp. 113-143.\n[Si76] B. Simon: The bound state of weakly coupled Schrdinger operators in one and two dimensions, Ann. Phys. 97 (1976), 279–288.\n[Si79] B. Simon: The definition of molecular resonance curves by the method of exterior complex\nscaling, Phys. Lett. A71 (1979), 211–214.\n[Si72] K.B. Sinha: On the decay of an ustable particle, Helv. Phys. Acta 45 (1972), 619–628.\n[SS02] A.V. Sobolev, M.Z. Solomyak: Schrödinger operator on homogeneous metric trees: spectrum in gaps, Rev. Math. Phys. 14 (2002), 421–467.\n[Th] B. Thaller: Visual Quantum Mechanics, Springer, Heidelberg 2000.\n[VDS02] G.A. Vugalter, A.K. Das, V.A. Sorokin: Revivals in an infinite square well in the presence\nof a δ well, Phys. Rev. A66 (2002), 012104.\n[Wi61] R.G. Winter: Evolution of a quasi-stationary state, Phys. Rev. 123 (1961), 1503–1507.\nDepartment of Theoretical Physics, Nuclear Physics Institute, Czech Academy of\nSciences, 25068 Řež near Prague, and Doppler Institute for Mathematical Physics and\nApplied Mathematics, Czech Technical University, Břehová 7, 11519 Prague, Czechia\nE-mail address: exner@ujf.cas.cz\n\n\f"}