{"id": "http://arxiv.org/abs/1205.2540v1", "guidislink": true, "updated": "2012-05-11T14:45:11Z", "updated_parsed": [2012, 5, 11, 14, 45, 11, 4, 132, 0], "published": "2012-05-11T14:45:11Z", "published_parsed": [2012, 5, 11, 14, 45, 11, 4, 132, 0], "title": "Ultra-High Energy Probes of Classicalization", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1205.3146%2C1205.2061%2C1205.4086%2C1205.1476%2C1205.2779%2C1205.2404%2C1205.1523%2C1205.0274%2C1205.3795%2C1205.3619%2C1205.3206%2C1205.1570%2C1205.3773%2C1205.1982%2C1205.3903%2C1205.3404%2C1205.3546%2C1205.1533%2C1205.1898%2C1205.3520%2C1205.0338%2C1205.3725%2C1205.0856%2C1205.4486%2C1205.1727%2C1205.3931%2C1205.2044%2C1205.1264%2C1205.0912%2C1205.3212%2C1205.0546%2C1205.3514%2C1205.1090%2C1205.2469%2C1205.3476%2C1205.2305%2C1205.3318%2C1205.1879%2C1205.2540%2C1205.1167%2C1205.2618%2C1205.3118%2C1205.3774%2C1205.2347%2C1205.3270%2C1205.2955%2C1205.3482%2C1205.1412%2C1205.0670%2C1205.3496%2C1205.1492%2C1205.2635%2C1205.1616%2C1205.4431%2C1205.1908%2C1205.4059%2C1205.0474%2C1205.0954%2C1205.2941%2C1205.3288%2C1205.2194%2C1205.0303%2C1205.3550%2C1205.0835%2C1205.1819%2C1205.4000%2C1205.3307%2C1205.1236%2C1205.4054%2C1205.1175%2C1205.0295%2C1205.2420%2C1205.0932%2C1205.0900%2C1205.3513%2C1205.2634%2C1205.0541%2C1205.4134%2C1205.1486%2C1205.1831%2C1205.2712%2C1205.2961%2C1205.4352%2C1205.0628%2C1205.1916%2C1205.2291%2C1205.0763%2C1205.1946%2C1205.3277%2C1205.0733%2C1205.3472%2C1205.2975%2C1205.3175%2C1205.0393%2C1205.3378%2C1205.0558%2C1205.3570%2C1205.3512%2C1205.2567%2C1205.2906%2C1205.2538&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Ultra-High Energy Probes of Classicalization"}, "summary": "Classicalizing theories are characterized by a rapid growth of the scattering\ncross section. This growth converts these sort of theories in interesting\nprobes for ultra-high energy experiments even at relatively low luminosity,\nsuch as cosmic rays or Plasma Wakefield accelerators. The microscopic reason\nbehind this growth is the production of N-particle states, classicalons, that\nrepresent self-sustained lumps of soft Bosons. For spin-2 theories this is the\nquantum portrait of what in the classical limit are known as black holes. We\nemphasize the importance of this quantum picture which liberates us from the\nartifacts of the classical geometric limit and allows to scan a much wider\nlandscape of experimentally-interesting quantum theories. We identify a\nphenomenologically-viable class of spin-2 theories for which the growth of\nclassicalon production cross section can be as efficient as to compete with QCD\ncross section already at 100 TeV energy, signaling production of quantum black\nholes with graviton occupation number of order 10^4.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1205.3146%2C1205.2061%2C1205.4086%2C1205.1476%2C1205.2779%2C1205.2404%2C1205.1523%2C1205.0274%2C1205.3795%2C1205.3619%2C1205.3206%2C1205.1570%2C1205.3773%2C1205.1982%2C1205.3903%2C1205.3404%2C1205.3546%2C1205.1533%2C1205.1898%2C1205.3520%2C1205.0338%2C1205.3725%2C1205.0856%2C1205.4486%2C1205.1727%2C1205.3931%2C1205.2044%2C1205.1264%2C1205.0912%2C1205.3212%2C1205.0546%2C1205.3514%2C1205.1090%2C1205.2469%2C1205.3476%2C1205.2305%2C1205.3318%2C1205.1879%2C1205.2540%2C1205.1167%2C1205.2618%2C1205.3118%2C1205.3774%2C1205.2347%2C1205.3270%2C1205.2955%2C1205.3482%2C1205.1412%2C1205.0670%2C1205.3496%2C1205.1492%2C1205.2635%2C1205.1616%2C1205.4431%2C1205.1908%2C1205.4059%2C1205.0474%2C1205.0954%2C1205.2941%2C1205.3288%2C1205.2194%2C1205.0303%2C1205.3550%2C1205.0835%2C1205.1819%2C1205.4000%2C1205.3307%2C1205.1236%2C1205.4054%2C1205.1175%2C1205.0295%2C1205.2420%2C1205.0932%2C1205.0900%2C1205.3513%2C1205.2634%2C1205.0541%2C1205.4134%2C1205.1486%2C1205.1831%2C1205.2712%2C1205.2961%2C1205.4352%2C1205.0628%2C1205.1916%2C1205.2291%2C1205.0763%2C1205.1946%2C1205.3277%2C1205.0733%2C1205.3472%2C1205.2975%2C1205.3175%2C1205.0393%2C1205.3378%2C1205.0558%2C1205.3570%2C1205.3512%2C1205.2567%2C1205.2906%2C1205.2538&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Classicalizing theories are characterized by a rapid growth of the scattering\ncross section. This growth converts these sort of theories in interesting\nprobes for ultra-high energy experiments even at relatively low luminosity,\nsuch as cosmic rays or Plasma Wakefield accelerators. The microscopic reason\nbehind this growth is the production of N-particle states, classicalons, that\nrepresent self-sustained lumps of soft Bosons. For spin-2 theories this is the\nquantum portrait of what in the classical limit are known as black holes. We\nemphasize the importance of this quantum picture which liberates us from the\nartifacts of the classical geometric limit and allows to scan a much wider\nlandscape of experimentally-interesting quantum theories. We identify a\nphenomenologically-viable class of spin-2 theories for which the growth of\nclassicalon production cross section can be as efficient as to compete with QCD\ncross section already at 100 TeV energy, signaling production of quantum black\nholes with graviton occupation number of order 10^4."}, "authors": ["Gia Dvali", "Cesar Gomez"], "author_detail": {"name": "Cesar Gomez"}, "author": "Cesar Gomez", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1088/1475-7516/2012/07/015", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1205.2540v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1205.2540v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "23 pages, latex", "arxiv_primary_category": {"term": "hep-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "hep-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1205.2540v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1205.2540v1", "journal_reference": null, "doi": "10.1088/1475-7516/2012/07/015", "fulltext": "Ultra-High Energy Probes of Classicalization\n\narXiv:1205.2540v1 [hep-ph] 11 May 2012\n\nGia Dvalia,b,c,d1 and Cesar Gomeza,e2\na\n\nArnold Sommerfeld Center for Theoretical Physics\nDepartment für Physik, Ludwig-Maximilians-Universität München\nTheresienstr. 37, 80333 München, Germany\nb\nMax-Planck-Institut für Physik\nFöhringer Ring 6, 80805 München, Germany\nc\nCERN, Theory Department\n1211 Geneva 23, Switzerland\nd\nCenter for Cosmology and Particle Physics\nDepartment of Physics, New York University\n4 Washington Place, New York, NY 10003, USA\ne\nInstituto de Fı́sica Teórica UAM-CSIC, C-XVI\nUniversidad Autónoma de Madrid, Cantoblanco, 28049 Madrid, Spain\nAbstract\n\n1\n2\n\nClassicalizing theories are characterized by a rapid growth of the\nscattering cross section. This growth converts these sort of theories in\ninteresting probes for ultra-high energy experiments even at relatively\nlow luminosity, such as cosmic rays or Plasma Wakefield accelerators. The microscopic reason behind this growth is the production\nof N -particle states, classicalons, that represent self-sustained lumps\nof soft Bosons. For spin-2 theories this is the quantum portrait of\nwhat in the classical limit are known as black holes. We emphasize\nthe importance of this quantum picture which liberates us from the\nartifacts of the classical geometric limit and allows to scan a much\nwider landscape of experimentally-interesting quantum theories. We\nidentify a phenomenologically-viable class of spin-2 theories for which\nthe growth of classicalon production cross section can be as efficient\nas to compete with QCD cross section already at 100TeV energy, signaling production of quantum black holes with graviton occupation\nnumber N ∼ 104 .\ngeorgi.dvali@cern.ch\ncesar.gomez@uam.es\n\n\f1\n\nClassicalization Versus Wilsonian Physics\n\nOne of the fundamental goals of high-energy physics is to understand the\nnature of UV-completion of the Standard Model. In the standard (Wilsonian)\nparadigm of UV-completion, the new high-energy physics comes in form of\nweakly-coupled quantum particles that become relevant degrees of freedom at\nscales shorter than the weak interaction length, approximately 10−16 − 10−17\ncm. For example, a low scale supersymmetry is a typical representative of\nsuch a Wilsonian UV-completion. As it is well-known, the above energy\nfrontier is currently being probed by the LHC experiments.\nIt is natural to ask, what are the prospects of experimentally testing\nideas about UV-completion in the collisions at even higher energes? One\nrare opportunity is provided by ultra-high energy cosmic rays (see [1] for a\nreview). Interestingly, there are also proposals of earth-based accelerators of\nultra-high energies, such as Plasma Wakefield accelerators (see [2]).\nIn both of these cases the potential difficulty is a relatively low luminosity, which makes the test of Wilsonian UV-completions exceedingly difficult. For example, the high energy cosmic ray collisions in the atmosphere\nare dominated by soft exchanges and the statistics for the events with high\nmomentum-transfer is low. The purpose of the present paper is to identify a\nclass of theories, based on the concept of non-Wilsonian self-completion [3]\nby classicalization [4], for which the ultra-high energy experiments can represent efficient probes even at relatively low luminosity, due to an efficiently\ngrowing cross-section at high energies. A potential importance of this general\nproperty for compensating the expected low luminosity of Plasma Wakefield\naccelerators was noted in [2].\nIn order to probe the short-distance physics, one needs events with high\nmomentum-transfer. In weakly-coupled (Wilsonian) UV-completions of the\nStandard Model such events are predicted to be extremely rare as compared\nto low momentum-transfer soft events mediated by the strong interaction\nforce. The reason is that in any weakly-coupled UV-completion of the standard model the (all-inclusive) cross section diminishes with the increase of\nthe center of mass energy E. As a result, the cross section is dominated by\nsoft QCD events. This is why, at least for the current statistics, the high energy cosmic rays do not represent good probes of Wilsonian UV-completions\nof the standard model.\nRecently, a concept of non-Wilsonian self-UV-completion was introduced\n[3, 4], in which no new weakly-coupled physics is required above certain cut2\n\n\foff energy scale M∗ with the corresponding cutoff length L∗ ≡ ~/M∗ . In\nthese theories low energy degrees of freedom (e.g., gravitons) naively become\nstrongly interacting at distances shorter than L∗ where perturbative expansion in E L∗ breaks down. However, in contrast to the Wilsonian picture,\nthis breakdown does not imply the need for any new weakly-coupled physics\nthat must be integrated-in at distances less than L∗ . Instead, the theory\ncures itself in the following way. The would-be strongly-coupled particles\nget replaced by collective weakly-coupled degrees of freedom with an effective interaction strength suppressed by powers of 1/(L∗ E). These collective\ndegrees of freedom represent many-particle states of large wavelength. By\nlarge wave-length we mean the wavelengths that exceed L∗ . This characteristic length is set by an energy-dependent scale which we denote by r∗ (E).\nThe necessary property is the increase of r∗ (E) with E, so that r∗ (E) ≫ L∗\nfor E ≫ M∗ . As a result, the UV-theory when described in terms of collective degrees of freedom is weaker and weaker coupled and probes larger and\nlarger distances with increasing E. This phenomenon describes the essence of\nwhat was termed as the non-Wilsonian self-completion by classicalization [4].\nVarious aspects of this idea where studied in [5] - [13]. Intrinsic feature of\nthe classicalization phenomenon, which makes this picture phenomenologically distinct from Wilsonian completion is the efficient growth of the cross\nsection at trans-cutoff energies as some positive power of EL∗ ,\nσ ∝ (EL∗ )α ,\n\nα > 0\n\n(1)\n\nThis growth can be understood as the result of creation of states composed\nof many soft quanta, which behave more and more classically at high-energies.\nThese are so-called classicalons. Let us briefly describe their essence. In the\nclassical limit (~ = 0) classicalons represent static (usually singular) solutions of the classical equations of motion of characteristic radius r∗ (E) and\nenergy (mass) E. These parameters appear as integration constants that can\ntake arbitrary values. A well-known example of such solutions is the celebrated Schwarzschild black hole in classical general relativity. However, this\ngeometric picture is only valid in an idealized classical limit. In reality nature\nis quantum and ~ is non-zero. A quantum theory of black holes and other\nclassicalons was developed in [9,14]. According to the latter theory, these objects represent self-sustained bound-states of many bosons of characteristic\nwave-length λ = r∗ (E) and occupation number,\nN(E) = E r∗ (E) /~ .\n3\n\n(2)\n\n\fDue to their large wave-length and derivative coupling, these bosons interact\nextremely weakly, with the effective coupling constant\nαef f = 1/N(E) .\n\n(3)\n\nThus [14], physics of classicalons in general, and black holes in particular,\nis a weakly-coupled large-N physics in t'Hooft's sense [15]. This property\nemerges as the result of maximal packing. The classicalons represent maximally packed states per given wave-length. The maximized occupation number density results into the oversimplification of the system and effectively\nconverts it into a system with a single characteristics, N. In this way, classicalization replaces a would-be strongly coupled physics of few hard quanta\nat energy E ≫ M∗ by an extremely weakly-coupled physics in which the\nsame energy is distributed among many soft quanta of wavelength r∗ ≫ L∗ .\nThis picture defines the quantum N-portrait of black holes and other\nclassicalons. The reason for the efficient production rate of these objects in\nhigh energy particle collisions is the exponential degeneracy of micro-states\nthat over-compensates the usual exponential suppression of many-particle\nstates. At high energies the cross-section grows as\nσ ∼ (~ N(E)/E)2 .\n\n(4)\n\nThis cross section for large N(E) can be interpreted as a geometric cross\nsection\nσ ∼ r∗ (E)2 .\n(5)\n\nThe relations (2), (3), (4) and (5) describe the essence of classicalizing\ntheories. Unlike in ordinary Wilsonian case, the high energy behavior of these\ntheories , instead of probing short distances, in reality probes large distance\nphysics, due to the fact that the high energy scattering is dominated by\nproduction of states with large occupation number of very soft quanta.\nThus, deep-UV quantum behavior of classicalizing theories can be understood in terms of the classical IR dynamics of the same theory! For example,\nthe behavior of deep-UV cross section can be derived by finding out the Edependence of the r∗ (E) radius of a static source of mass E. The radius r∗\ncan be defined as the shortest distance for which the linearized approximation is valid. This property simplifies enormously the predictive power of the\ntheory for high-energies, since the dependence of σ on center of mass energy\nE can be read-off by solving the linearized classical equations of motion for\na source of the same energy E.\n4\n\n\fHowever, we need to be extremely careful not to be mislead by this simplification. In order to understand properly the classicalon dynamics we must\ncontinuously monitor the information obtained in an idealized classical limit\n(~ = 0) by translating it into the language of the underlying quantum portrait. Without this guideline, the (semi) classical picture alone can lead us\nto wrong conclusions. This becomes obvious, ones we identify the correct\nclassical and semi-classical limits. These limits correspond to taking\nE → ∞,\n\nL∗ → 0\n\nr∗ = fixed .\n\n(6)\n\nIn addition, we may take ~ 6= 0 or ~ = 0 depending whether we want to be\nin semi-classical or classical treatment. For example, most of (if not all) the\nprevious semi-classical analysis of the black hole physics is performed in this\nlimit.\nThe quantum N portrait shows that none of these limits are correct approximations. This becomes very clear by realizing that in both limits, irrespective whether we keep ~ finite or zero, the occupation number of quanta\nbecomes infinite, N → ∞. This immediately tells us that all the subtleties\nof 1/N expansion become hidden. The typical example of the invalidity of\nthis approximation is the application of the semi-classical limit for microblack holes that can be produced at LHC. It is obvious that in reality these\nblack holes correspond to the quantum states with N ∼ 1. Thus, to apply to\ntheir properties the semi-classical limit (N = ∞) gives invalid predictions,\nsuch as thermality and democracy of their decay products. In reality, the\nmicro-black hole if accessible at LHC will behave simply as unstable quantum\nparticles.\nLikewise, for classicalons (including black holes) with large N – that as\nwe shall argue can be observed in high energy cosmic ray experiments – the\nclassical limit can serve as an useful guideline. But at the same time the\nquantum N portrait makes an essential difference at all the scales, since it\nallows us to bypass huge technical complications of extracting information\nfrom the classical analysis.\nFor example, in the classical limit the question of black hole formation\nis complicated with all possible technical subtleties, such as the question of\nhorizon formation. Since in such a limit the quantum nature is completely\nhidden, the only remaining characteristics are geometric and one has to be\nextremely precise to prove the black hole formation. These technicalities,\nif the only guideline used is the geometric picture, make the outcome of\nhigh-energy scattering inconclusive.\n5\n\n\fInstead, the large N portrait sheds a very powerful light on this process. It makes clear that all the geometric issues, such as horizon-formation\nare secondary if we are interested in the question of formation of large-N\nquantum states. For large N, this question can be answered reliably in 1/N\nexpansion, which is an excellent approximation for the cases of interest.\nWith the large-N quantum portrait in mind, the questions whether the\nlarge-N states are formed can be reliably answered already by linearized\nclassical analysis properly translated into the underlying quantum language.\nEquipped with the above knowledge, in the present note we shall focus\non a class of theoretically-motivated classicalizing theories that can be of\ninterest for high energy cosmic rays as well as for other high-energy but\nlow luminosity experimental searches, with the signatures that can be cross\ncorrelated with the signatures at LHC.\nThe class of theories of our interest represents UV-modification of Einstein's gravity that classicalize at energies above M∗ ∼ TeV and thus are theoretically motivated for solving the hierarchy problem. They can be viewed as\na generalization of large extra dimensional scenario [18], but we shall abandon\nthe geometrical framework allowing ourselves to characterize the dynamics\nin terms of degrees of freedom and their occupation number. As we shall\nsee, this approach since it liberates us from the frame of geometric thinking,\nallows us to uncover a much wider class of phenomenologically-interesting\npossibilities.\nWe shall show that in the most efficiently classicalizing scenario, the highenergy growth of the cross section can be as steep as\nσ(E) ≃ π (E 2 L4∗ ) .\n\n(7)\n\nThis approximately-quadratic growth takes place until the energy Ec ≡\n(L2∗ m)−1 , where, m is the mass of the new spin-2 degrees of freedom. Above\nEc the power-law growth of the cross section changes to a logarithmic growth\naccording to\n!\n2\nEL\n∗\nσ(E) = π m−2 ln2 p\n.\n(8)\nσ(E)/π\n\nWe estimate the phenomenological lower bound on the scale m, and show\nthat for M∗ ∼ T eV it can be as low as ∼ 20MeV. This lower bound comes\nfrom the combined constraints of supernova cooling and the big bang nucleosynthesis.\n6\n\n\fTo conclude, we show that in the interval of phenomenologically interesting energies, classicalons with occupation number as large as N ∼ 104\ncan be produced in high energy cosmic ray collisions with atmosphere at\nenergies as low as 100 TeV, with their production cross-section competing or even exceeding the typical low-momentum-transfer QCD cross-section\nσQCD ∼ 100mb ∼ 250GeV−2 .\nOf course, the possibility of micro black hole production in above-TeVenergy collisions is not new and was already suggested in [19] and in a number\nof subsequent papers (see, e.g., [20]). This suggestion was based on combining\nthe intuition about the classical black hole formation in untra-Planckian energies pioneered in earlier papers [21–23] with the new input of possibility of\nlowering the fundamental Planck mass down to TeV energies [18]. Therefore,\nmost of the previous studies were done within the classical geometric frameworks such as [18], which cannot capture the underlying quantum large-N\nstructure of black holes. By abandoning the pure geometric limit we manage\nto identify classes of theories with more efficient growth of the cross section. The purpose of the present paper is not to confront these models with\nany particular experimental data, but to point out their phenomenological\nviability and their potential experimental importance for ultra-high energy\nexperiments, both cosmic ray as well as the earth based accelerators.\nA very interesting representative of such an earth-based ultra-high-energy\naccelerator is a currently-planned proton-driven wakefield accelerator [2].\nThese experiments have a potential of going significantly above the current\naccelerator capacities, but with relatively low luminosity. However, for probing classicalizing theories the low luminosity is not a fatal problem since the\nlarge cross section can make up for it. Hence, such ultra-high energy experiments represent potentially very interesting probes for the classicalization\nphenomenon.\n\n2\n\nSpin-2 Classicalizers\n\nWe shall discuss the phenomenological implications of classicalizing theories\nin which the classicalizer fields are spin-2 bosons. Our aim is to identify\nthe most efficient low-energy classicalizers that could be of potential interest\nfor cosmic ray physics. These theories are in the same universality class as\nthe original large extra dimensions in which fundamental scale of gravity is\nM∗ ∼ TeV [18]. In the latter class of theories, above the energy scale set\n7\n\n\fby the inverse compactification radius, the theory is effectively described by\nEinstein gravity in 4 + d dimensions, with the fundamental Planck length\nbeing L∗ . Such a theory classicalizes above the energy scale M∗ . According\nto the large-N quantum portrait, the classicalons of this theory are manygraviton states of wavelength,\n1\n\nλ = r∗ (E) = L∗ (E L∗ ) 1+d ,\n\n(9)\n\nand occupation number\n2+d\n\nN = ~−1 E r∗ (E) = ~−1 (E L∗ ) 1+d .\n\n(10)\n\nPutting it shortly, black holes are graviton Bose-condensates. Given the\nwave-length, the quantum interaction strength between graviton pairs is\ngiven by\n2+d\n(11)\nαgr = ~ (E L∗ )− 1+d .\nNotice that all these quantities can be expressed in terms of N as,\n1\n\nλ = N 2+d L∗\n\nαgr = 1/N .\n\n(12)\n\nIn the limit ~ = 0, L∗ → 0, N → ∞, these objects can be viewed as 4 + ddimensional Schwarzschild black holes of radius r∗ . Thus, physics of black\nholes is the same large-N physics that was used by t'Hooft for SU(N) gauge\ntheories, except the role of N is played by graviton occupation number.\nHowever, the large-N quantum portrait of black holes makes it clear that\noveremphasizing the geometric meaning is not always very useful. First , for\nmoderate values of N the geometric picture is simply not a good description.\nSecondly, it illustrates that restricting the analysis to the configurations that\nhave well-known geometric interpretation in the ~ = 0 limit, leaves aside a\nhuge class of potentially interesting cases which can be easier to access in high\nenergy experiments and could have more spectacular experimental signatures\nthan the \"canonical\" cases which have been studied in the geometric classical\nlimit.\nTherefore, the correct attitude in this search would be to adopt the fully\nquantum mechanical view in which the main role is played by the degrees of\nfreedom and their occupation number, with a geometric interpretation being\nsecondary.\n\n8\n\n\fGravity viewed as a quantum field theory is a theory of a dynamical\nmetric, gμν (x), which can be represented as a background metric hgμν i plus\na small perturbation, δgμν ,\ngμν = hgμν i + δgμν .\n\n(13)\n\nWe shall be interested in dynamics of the sources on asymptotically-Minkowski\nspaces, which is an excellent approximation for the problems we shall study.\nIn such a case, the metric created by a static source sufficiently far from\nit, is approximately Minkowskian and can be described as,\ngμν = ημν + δgμν ,\n\n(14)\n\nwhere δgμν ≪ 1. The key approach of the quantum N-portrait is to think\nof such a geometry as a quantum state (a sort of Bose-condensate) that is\ncharacterized by the occupation number N, the wavelengths of gravitons λ\nand by their interactions strength αgr . Classicalons are then the special states\nin which all these parameters assume values that are fully determined by N,\nin such a way that a self-sustainability condition is satisfied. For example,\nthe quantum counterparts of Schwarzschild black holes are given by (12).\nThe dictionary between the quantum and classical characteristics can be\nestablished as follows.\nMetric perturbation δgμν can be written in terms of linear perturbations\nof canonically-normalized fields that can be classified by their transformation\nproperties with respect to the Poincare group. Approaching the source from\ninfinity, we shall measure δgμν which can be found by solving the appropriate\nlinear equations, in which it is sourced by an effective energy-momentum\ntensor Tμν of energy E. Assume that this approximation breaks down at\nsome distance r ≡ r∗ for which δgμν becomes order one. We shall call the\ncorresponding radius, r∗ the classicalization scale.\nThe quantum mechanical meaning of r∗ is that we are dealing with a\nquantum-mechanical state with graviton occupation number given by (2)\nand the characteristic wavelength,\nλ = r∗\n\n(15)\n\nThe term classicalization radius has an obvious meaning. It is enough\nto notice that N ≫ 1 whenever r∗ exceeds the Compton wavelength of\nthe source (~/E). That is, we are dealing with a large occupation number\n9\n\n\fstate that can approximately be treated as a classical object. In a quantum\nUniverse like ours, this is the only consistent meaning of classicality.\nAlso, r∗ acquires a classical geometric meaning in the formal limit ~ → 0\nand N → ∞. For example, in Einstein theory, in such a limit r∗ becomes\na geometric Schwarzschild radius. However, we shall not use this meaning.\nTreating r∗ quantum-mechanically shall allows us to bypass unnecessary details emerging in exact classical limit, which in any case represent an idealized\napproximation of the real world and are only approximately applicable to a\nrealistic scattering processes.\nFollowing the large-N quantum portrait of black holes and classicalons,\nfor us r∗ will be the scale (the characteristic wave-length) for which the\ninteraction of N-gravitons becomes strong and the system enters the regime\nin which a self-sustained bound-state starts to form.\nThis picture allows us to draw important conclusions about the quantum dynamics of this self-sustained bound-state without going beyond the\nlinearized approximation on the IR side.\nThe key is to identify the energy dependence of the cross section. As we\nshall show this is determined by the number and the couplings of gravitational\nspecies that δgμν propagates. The number of new graviton species n which\nis a fixed input characteristics of a given theory, should not be confused with\nthe occupation number, N, of graviton quanta in a given black hole. The\nlatter number depending on the black hole mass and takes different values\nfor different black holes in one and the same theory.\nThe most general expansion of the linearized metric perturbation in terms\nof graviton species has the following form,\nδgμν =\n\n1 X (2) (m)\n1 X (0)\ngm hμν +\ng ημν φ(m) ,\nMP m\nMP m m\n\n(16)\n\n(m)\n\nwhere hμν and φ(m) stand for spin-2 and spin-0 degrees of freedom respec(2)\n(0)\ntively. The constants gm and gm parameterize the strength of their coupling\n(0)\n(2)\nrelative to the zero-mode Einstein graviton (hμν ), for which we have g0 = 1\n3\n.\n3\n\nNotice, that since we couple the metric perturbation only to the conserved energy\nmomentum tensor, the would-be contribution from the derivatively-coupled scalars of the\nform ∂μ ∂ν φ(m) as well as the contributions from spin-1 states, vanishes. These are therefore\nneglected in the expansion (16).\n\n10\n\n\fConsider now a localized static source of some characteristic wave-length\nλ = R. Classically, such a source can be approximated by a static energy momentum tensor smeared over a spherical shell of radius R, Tμν =\nE\nδμ0 δν0 4πR\n2 δ(r − R). For such a source, the linear graviton perturbations can\nbe easily obtained by solving appropriate linearized equations which are wellknown and we shall not display. In particular, for the Newtonian components\nwe get,\n(0)\n\nh00 =\n\nLP E\n,\n2r\n\n(m)\n\nh00 =\n\n2 (2) LP E −mr\ng\ne\n,\n3 m r\n\n(0)\nφ(m) = gm\n\nLP E −mr\ne\n.\nr\n\n(17)\n\nSubstituting this expression into (16) we get for the total metric perturbation\nthe following expression,\nδg00 =\n\nL2P E X\nρm e−mr ,\nr m\n\n(18)\n\nwhere ρm parameterize the relative strengths of massive spin-2 states with\n(2)\n(0)\nrespect to the massless graviton. That is, ρm ≡ 32 (gm )2 + (gm )2 , whereas\nρ0 = 1/2.\nIt is clear that the sum in (18) measures the relative strength of gravity\nwith respect to pure Einstein gravity, and can be written as,\nδg00\n(Einstein)\nδg00\n\n=\n\nX\n\nρm e−mr .\n\n(19)\n\nm\n\nThe quantum-mechanical picture described by the metric perturbation\n(18) is that a source of energy E induces a state of graviton occupation\nnumber,\nX\nX\nN =\nNm = (E 2 L2P )\nρm e−mR .\n(20)\nm\n\nm\n\nThus, each graviton of mass m and coupling ρm contributes the partial number Nm = N0 ρm e−mR , where N0 ≡ E 2 L2P is the occupation number of the\nmassless gravitons.\nIn our parameterization the classicalization self-completion threshold is\nset by the source of the Compton wave-length L∗ that creates an order-one\nmetric perturbation at the distance r ∼ L∗ . That is, δg00 (r = L∗ ) = 1. Or\nequivalently, in the quantum language this is a source for which the occupation number of gravitons, N, exceeds one. In other words, such a source\nmarks the boundary between the one-particle and multi-particle states.\n11\n\n\fLet us see, what relation this imposes on the spectrum of gravitational\nmessenger species. Since each graviton species of mass m contributes only at\ndistances r < 1/m, at any given distance r we are allowed to only take into\nthe account modes that are not heavier than 1/r. Thus, for the estimate we\ncan truncate the sum at m = 1/r. At the same time we can approximate the\nexponential factors for all the light modes by one. The sum then simplifies\nto,\nm=1/r\nrg X\nδg00 (r) =\nρm .\n(21)\nr m=0\n\nNow, the criterion that sources heavier than L−1\n∗ must classicalize reads\nL2\nδg00 (r = L∗ ) = P2\nL∗\n\nm=1/L∗\n\nX\n\nρm = 1.\n\n(22)\n\nm=0\n\nThe bottom-line is that the cumulative strength of all the new degrees of\nfreedom at the scale L∗ must be L2∗ /L2P times the strength of Einstein's gravity. This condition only constraints the overall sum of coupling strengths as\ngiven by (22). This constraint can be accommodated in different ways. For\nexample, one can introduce many weakly-coupled gravitons or few strongly\ncoupled ones. By changing coupling strengths ρm and the number of gravitons we can scan an entire landscape of classicalizing spin-2 theories.\nSources of energy E ≫ M∗ classicalize and represent N-particle states.\nThis applies both to static sources as well as to scattering two-particle states\nwith center of mass energy E. Our task is to single out the class of theories\nfor which the classicalization radius can exhibit the most efficient growth at\nphenomenologically-interesting low energies i.e above M∗ ∼TeV. This task is\nsimple to accomplish. Each member of the graviton tower of mass mj and of\nstrength ρmj contributes into the classicalization process at distances shorter\nthan its Compton wavelength m−1\nand decouples at larger distances. Since\nj\nthe integrated over-all strength of gravitons is fixed by (22) the most efficient\ngrowth of r∗ (E) with E will be achieved if we make all the new gravitons\nmaximally light.\nThe classicalization radius of any source of energy E ≫ M∗ is determined\nby the relation,\n\"\n#\nX\nE\nδg00 (r∗ ) =\ne−mj r∗ ρmj + 1 ≃ 1\n(23)\nMP2 r∗ j\n12\n\n\fWe now wish to find such consistent values of mj and ρj that would ensure\nthe largest possible value of r∗ for a given mass E. This is obviously achieved\nin the case when most of the graviton masses are pushed down as much as\npossible. At any given energy E the gravitons contributing efficiently into\nthe growth of r∗ will be the ones that satisfy,\nM∗2\nmj < m =\n.\nE\n\n(24)\n\nThe extreme case is achieved when all the gravitons open up at the same\nuniversal mass m. Since what is important is the integrated strength, we can\ntake all the graviton species to be coupled with the uniform strength set by\ntheir inverse number, n,\n1\nρm = L2∗ /L2P .\n(25)\nn\nIn other words, for a given center of mass energy E, the largest classicalization\nradius r∗ (E) is achieved when all the n graviton species open up at the\ncommon Compton wavelength m−1 ≫ L∗ . The r∗ (E) radius of such a\nclassicalon is then determined by the condition:\n\u0014\n\u0015\nM∗2\nE 1\n−mr∗\ne\n+\n= 1\n(26)\nM∗2 r∗\nMP2\nIn order to translate this result into the relation between the classicalon\nproduction cross-section (σ) and the center of mass energy (E), all we need\nto do is to identify σ = πr∗2 and plug it in (26). This identification gives us\nthe relation,\np\nE =\n\nM∗2\n\ne−\n\n√σ\n\nπ\n\nσ\nπ\n\nm\n\n+ M∗2 /MP2\n\n.\n\n(27)\n\nWe can further simplify the above relation by noticing that for the values\nof interest M∗ ∼TeV, the term M∗2 /MP2 is of order 10−32 and is absolutely\nnegligible. The value of r∗ (E) is then determined by the condition\nE e−mr∗\n=1\nM∗2 r∗\nor equivalently,\nE = M∗2\n\n−\n\ne\n13\n\npσ\n\n√ πσ\n\nπ\n\nm\n\n(28)\n\n.\n\n(29)\n\n\fWhich in terms of cross-section gives us (8). For m < (EL2∗ )−1 the value of\nr∗ is given by\n\u0001\nr∗ ≃ E L2∗ 1 − mEL2∗ ,\n(30)\n\nwhich in terms of cross-section gives us leading expansion of (8) in mEL2∗ .\nThe latter expression is no longer applicable after the center of mass energy\nreaches Ec = (mL2∗ )−1 , or equivalently the r∗ radius reaches m−1 . Above\nthis energy we have to use the expression (29) (which implies (8)), which\nindicates that the growth of cross section becomes logarithmic,\nσ = πm−2 ln2 (mEL2∗ ) .\n\n(31)\n\nAs it is clear from (27), this logarithmic growth persists till the energies of\norder E ∼ MP2 /m, after which one enters into the regime in which classicalization is taken over by the Einsteinian massless graviton via production of\nEinsteinian black holes. Obviously, this regime is way beyond the reach of\ncurrent cosmic ray experiments. So the signature that is of interest for the\ncurrent observations is given by the cross section (8). As we shall show in the\nnext section, the phenomenological lower bound on m is as low as ∼ MeV,\nallowing the classicalization cross section to compete with or even dominate\nthe QCD cross section at the energies around ∼ 100TeV.\n\n3\n\nPhenomenological Constraints on m\n\nAs we have shown above, the efficiency of the cross section growth in deepUV is determined by the Compton wave-length of the gravitons. This is\na very peculiar characteristics of classicalizing theories and is not present\nin weakly-coupled Wilsonian UV completions. For example, the behavior\nof the cross section at energy E ≫ L−1\ninstead of being determined by\n∗\nthe strength of the interaction at distance ~/E, is rather determined by the\nstrength at distance r∗ ≫ L∗ . The gravitons of Compton wavelength shorter\nthan r∗ effectively do not participate in formation of classicalons. Thus for\nthe efficient growth of the cross section at energy E it is important to have\nas many light gravitons as possible with the Compton wavelength exceeding\nr∗ (E). However, graviton masses and couplings are constrained from below\nby various observations. In case of large extra dimensions this constraints\nhave been studied in great detail [24]. We shall now apply the similar analysis\nin our more general case.\n14\n\n\fThe number and couplings of gravitons available at each mass level m\nare constrained by various high-energy processes as well as by the tabletop\nmeasurements. We shall now briefly evaluate these constraints.\n\n3.1\n\nStar Cooling\n\nWe shall consider the star-cooling constraints first. These constraints come\nfrom the fact that gravitons can be produced in the interiors of the stars and\ncontribute to their cooling. The requirement that this is not disturbing the\nusual cooling rate, places the constraint on the masses and couplings of the\ngraviton species.\nWe can consider two different regimes depending whether mean free path\nof produced gravitons is longer or shorter than the star radius Rstar . In the\nfirst case the gravitons escape freely, whereas in the second case they can\ndeposit the energy back into the star before escaping. We shall consider a\nfree-escape regime first.\n3.1.1\n\nFree escape regime\n\nIn such a regime the star-cooling rate is essentially given by the graviton\nproduction rate, since probability of the re-capture is small.\nFor a star with an interior temperature T , the cooling rate due to emission\nof massive gravitons is,\nΓstar → graviton ∼\n\nT3 X\nρj e−mj /T ,\nMP2 j\n\n(32)\n\n(where for simplicity we do not make distinction between the spin-2 and spin0 cases). The exponent comes from the Boltzmann suppression. This rate\nmust be less than the standard cooling rate. The most stringent bound comes\nfrom supernova 1987A, with the core temperature T = 30MeV. In order to\nmake a quick estimate, we can use the knowledge from the previous analysis\n(such as production of axion [25] or Kaluza-Klein gravitons [24]) indicating\nthat the cooling rate into new states should not exceed the quantity\nΓmax ∼\n\nT3\n.\n1018 GeV 2\n\n15\n\n(33)\n\n\fDemanding that (32) does not exceed (33) gives the following constraint,\nX\nρj e−mj /30M eV < 1020 .\n(34)\nj\n\nLet us recall, that according to (19) the sum entering on the right hand\nside of (34) measures the strength of gravity relative to pure Einstein at\ndistances r = (30MeV )−1 . This means that the star-cooling constraints\ncould still tolerate modified gravity that at distances r ∼ (30MeV )−1 could\nbecome 1020 -times stronger relative to standard Einstein gravity. With this\nconstraint in mind let us evaluate the case which could give the largest possible cross section in the range of energies that can be potentially probed by\nhigh energy cosmic ray experiments.\nThe two choices of the parameters that tend to enhance the classicalon\nproduction cross section are: 1) Pushing the scale M∗ as low as possible; and\n2) increasing the Compton wavelengths of gravitons as much as possible. So\nthe maximal effect is achieved when almost all the new graviton species open\nup at the same mass scale m.\nIn such a case, the ratio of the supernova cooling rate into the gravitons\nto the maximal allowed cooling rate (33) becomes,\nΓstar → graviton\n∼\nΓstandard\n\n\u0012\n\n109 GeV\nM∗\n\n\u00132\n\ne−m/30M eV .\n\n(35)\n\nLHC experiments already set the lowest bound on scale M∗ in the ∼ TeV\nrange. Substituting this lower limit in (35) and demanding that the ratio\nmust be below one we arrive to the lower bound on m of few hundred MeV.\n3.1.2\n\nEnergy recapture regime\n\nWe shall now consider a different regime in which the individual gravitons\nare strongly enough coupled so that their mean free path is less than the\nstar radius. Such a situation, for example, can take place when gravitons\nthat are produced in a hot inner core of the star decay into the ordinary\nparticles before reaching the surface. In such a case they deposit energy in\nthe interior of the star before escaping and this suppresses their contribution\ninto the cooling. Let us evaluate constraints for such a regime. The lifetime of\na graviton of mass mj and coupling ρj /MP2 produced at temperature T & m\n16\n\n\fin the interior of the star is\nT MP2\nτ ∼\n.\nmj ρj m3j\n\n(36)\n\nThe coefficient T /mj comes from a relativistic gamma factor. This lifetime\nsets the distance that gravitons travel before decaying. Demanding that this\ndistance is less than the radius of a proto-neutron star, τ < Rstar ∼ 10km,\nwe get the following bound on the mass,\nm4j &\n\nT MP2\n.\nRstar ρj\n\n(37)\n\nFor the case, in which all the graviton species have the same mass m, we can\ntranslate the above bound in terms of their number, n, using the relation\n(25),\nT M∗2 n\nm4 &\n.\n(38)\nRstar\nThis has a clear physical meaning. For less number of graviton species, in\norder to accommodate the same collective strength, the individual couplings\nmust be stronger. Thus, the probability of re-capture for each graviton becomes higher. As an extreme case we can take n = 1. In this case taking\nM∗ ∼TeV, we get the following re-capture bound,\nm & MeV .\n\n(39)\n\nNotice that in approximating the mean free path by (36) we assumed that\nthe particles into which gravitons decay are off-shell (due to thermal bath)\nby a sufficiently small amount so that the decay is still allowed. This is a\nreasonable approximation for the current estimate.\nTo summarize, the supernova gives the following constraints on the scale\nm in two different regimes. In a free-streaming regime, when gravitons are\nmany and weakly coupled, the lower bound is about of few 100MeV. In the\nrecapture regime, when gravitons are less and strongly coupled, the bound\nis ∼ MeV .\n\n3.2\n\nOther Atro-Cosmo Constraints\n\nWith the above bounds being satisfied the other astro-cosmo constraints\n(e.g., such as nucleosynthesis or the diffused gamma ray background) are\neither automatically satisfied or are much milder.\n17\n\n\fLet us consider for example a big bang nucleosynthesis (BBN) bound.\nThis bound can be estimated from the requirement that graviton production\nrate at the BBN temperature TBBN ∼ MeV, should be subdominant to the\n2\nexpansion rate of the Universe which in that epoch is HBBN ∼ TBBN\n/MP .\nThis requirement gives the bound,\nX\nρmj e−mj /M eV < 1022 .\n(40)\nj\n\nThis bound is milder than (34) and thus is automatically satisfied when supernova cooling constraint is met in the free-streaming regime. For example,\nwhen all the graviton species have a common mass ∼ 100 MeV.\nIn the recapture case, when the number of graviton species is smaller and\nthey are stronger coupled, BBN bound is slightly stronger than the supernova\nbound and gives m & 20MeV.\nGiven the constraints from supernova and BBN the constraints from the\ndiffused photon background are easy to accomodate. This constraint usually\ncomes from a possible late decay of the gravitons [18].\nEven if produced with a maximal abundance, for the value of m even at\nits lowest bound 20 MeV, the lifetime of gravitons can be easily made shorter\nthan the age of the Universe. Indeed, for number of graviton species being\nn, the lifetime of graviton of mass m is,\nτgravitons ∼ M∗2 n/m3 .\n\n(41)\n\nRequiring that this is less than the age of the Universe, τ < H0−1 ∼ 1028 cm,\nwe get a very mild upper constraint on the total number of gravitational\nspecies n . 1032 , which in any case is satisfied due to the constraints on the\nnumber of gravitational species implicit in equation (22).\n\n3.3\n\nTabletop Measurements\n\nOther constraints on the Compton wavelengths of new graviton species come\nfrom tabletop measurement of deviations from Newton's law. These experiments have been probing distances down to the micron range and are placing\nbounds on gravity competing forces of various strengths.\nIn case when all the new gravitons are heavier than the star cooling\nconstraint, the Compton wavelengths are too short to be of interest for the\nabove-mentioned table top measurements.\n18\n\n\fHowever, as we have shown above, the combined star-cooling and BBN\nconstraints allow existence of longer Compton wave-length gravitons as long\nas their cumulative strength is less than ∼ 1020 times the strength of Einstein gravity. This bound leaves a huge room for the existence of lighter\ngravitons that could be of interest for table top experiments. The absolute\nupper bound on Compton wave-length of any new graviton interacting with\napproximately the same (or larger) strength as a massless graviton, comes\nfrom the torsion balance experiment and is 0.5 mm [26]. Shorter scale experiments are sensitive to stronger forces.\n\n4\n\nConcluding Remarks\n\nThe point of this note was to outline the potential importance of classicalizing\ntheories for ultra-high energy experiments with relatively low luminosity, such\nas the high-energy cosmic ray or plasma Wakefield accelerators [2]. We have\nidentified some phenomenologically-consistent theories that exhibit a most\nefficient growth of the cross section at the energies of experimental interest.\nWe have stressed importance of underlying quantum picture [14] according to which the black holes (or classicalons in general) are Bose condensates\nof maximal (for a given size) occupation number N. All the characteristics\nof this system can be understood in terms of N. For the phenomenological\nstudies in the ultra-high cosmic ray energy range, this quantum picture is\nimportant because of at least two reasons. First, it allows to map the linear\nanalysis on an underlying quantum portrait, which would be impossible in\nthe classical limit N = ∞, r∗ = f ixed. Secondly, it allows to cross correlate\nexpected events at LHC with the ones in ultra-high energy searches. For\nexample, in the considered classicalizing models within the energy interval\nbetween ∼ 1 − 100 TeV we scan the classicalons states with occupation number ranging in an interval N ∼ 1 − 104 . Thus, we predicts, that the two-jet\nevents at LHC that are expected to come from the decay of the lightest\nclassicalon resonances (N ∼ 1) must be cross-correlated with the multi-jet\nevents in higher energy collisions.\nWe have identified a phenomenologically-viable class of classicalizing spin2 theories, and have shown that the current observational constraints put\na limit on the saturation point of the cross-section-growth at about σ ∼\n(20MeV )2 . This cross section dominates over the soft QCD cross section\nand thus represents an interesting potential target for the experiments with\n19\n\n\fhigh energy but low luminosity collisions, such that are expected in cosmic\nrays or at plasma wakefield accelerators.\n\nAcknowledgements\nIt is a great pleasure to thank Allen Caldwell for sharing his expertise on\nPlasma Wakefield accelerators and their prospect for particle physics. We\nalso gratefully acknowledge earlier discussions with Masahiro Teshima and\nAlexey Boyarsky on topics related to physics of micro black holes in cosmic\nrays. The work of G.D. was supported in part by Humboldt Foundation under Alexander von Humboldt Professorship, by European Commission under\nthe ERC advanced grant 226371, by European Commission under the ERC\nadvanced grant 226371, by TRR 33 \"The Dark Universe\" and by the NSF\ngrant PHY-0758032. The work of C.G. was supported in part by Grants:\nFPA 2009-07908, CPAN (CSD2007-00042) and HEPHACOS S2009/ESP1473 and by Alexander von Humboldt Foundation.\n\nReferences\n[1] A.W. Strong, I.V. Moskalenko, and V.S. Ptuskin, \"Cosmic-Ray Propagation and Interactions in the Galaxy\", Annual Review of Nuclear and\nParticle Science Vol. 57: 285-327\n[2] A. Caldwell, \"Proton-driven plasma Wakefield Acceleration\", talk given\nat CERN colloquium (2012),\nhttp://indico.cern.ch/conferenceDisplay.py?confId=182516;\nFor the discussions about the Plasma Wakefield Acceleration as giving\nthe possibility of reaching high energies but with lower luminosities than\ndiscussed for ILC or CLIC, see,\nA. Caldwell, K. Lotov Phys. Plasmas 18, 103101 (2011)\nT. Tajima, M. Kando, M. Teshima, Prog.Theor.Phys. 125 (2011) 617631\n[3] G. Dvali and C. Gomez, Self-Completeness of Einstein Gravity,\narXiv:1005.3497 [hep-th];\n\n20\n\n\fG. Dvali, S. Folkerts, C. Germani, Physics of Trans-Planckian Gravity,\n[ arXiv:1006.0984 [hep-th]] Phys.Rev.D84:024039,2011.\n[4] G. Dvali, G. F. Giudice, C. Gomez, A. Kehagias, UV-Completion by\nClassicalization, JHEP 2011 (2011) 108; arXiv:1010.1415 [hep-ph].\nFor recent discussions, see\n[5] G. Dvali, D. Pirtskhalava, Dynamics of Unitarization by Classicalization, Phys.Lett. B699 (2011) 78-86, arXiv:1011.0114 [hep-ph]\nG. Dvali, Classicalize or not to Classicalize?, arXiv:1101.2661 [hep-th]\n[6] E. Spallucci, S. Ansoldi, Regular black holes in UV self-complete quantum gravity, Phys.Lett. B701 (2011) 471-474, arXiv:1101.2760 [hep-th]\n[7] F. Berkhahn, D. D. Dietrich, S. Hofmann, Cosmological Classicalization: Maintaining Unitarity under Relevant Deformations\nof the Einstein-Hilbert Action, Phys.Rev.Lett. 106 (2011) 191102,\narXiv:1102.0313 [hep-th]\nF. Berkhahn, D. D. Dietrich, S. Hofmann Consistency of Relevant\nCosmological Deformations on all Scales. JCAP 1109 (2011) 024 e-Print:\narXiv:1104.2534 [hep-th]\nF. Berkhahn, S. Hofmann, F. Kuhnel, P. Moyassari, Dennis Dietrich,\nIsland of Stability for Consistent Deformations of Einstein's Gravity.\narXiv:1106.3566 [hep-th]\n[8] B. Bajc, A. Momen, G. Senjanovic, Classicalization via Path Integral,\narXiv:1102.3679 [hep-ph]\n[9] G. Dvali, C. Gomez, A. Kehagias, Classicalization of Gravitons and\nGoldstones. arXiv:1103.5963 [hep-th], JHEP 1111 (2011) 070\n[10] C. Grojean, R. S. Gupta, Theory and LHC Phenomenology of Classicalon Decays, arXiv:1110.5317 [hep-ph].\n[11] J. Rizos, N. Tetradis, Dynamical classicalization, arXiv:1112.5546 [hepth]\nN. Brouzakis, J. Rizos, N. Tetradis, On the dynamics of classicalization,\nPhys.Lett. B708 (2012) 170-173, arXiv:1109.6174 [hep-th]\n21\n\n\f[12] R. Akhoury, S. Mukohyama, R. Saotome, No Classicalization Beyond\nSpherical Symmetry, arXiv:1109.3820 [hep-th]\n[13] R. Percacci, L. Rachwal, On classicalization in nonlinear sigma models,\narXiv:1202.1101 [hep-th]\n[14] G. Dvali, C. Gomez, Black Hole's Quantum N-Portrait, arXiv:1112.3359\n[hep-th]; Landau-Ginzburg Limit of Black Hole's Quantum Portrait: Self\nSimilarity and Critical Exponent, arXiv:1203.3372 [hep-th]; Black Hole's\n1/N Hair, arXiv:1203.6575 [hep-th].\n[15] Gerard 't Hooft, A Planar Diagram Theory for Strong Interactions. Nucl.\nPhys. B72 (1974) 461\n[16] E. Witten, Baryons in the 1/n Expansion. Nucl.Phys. B160 (1979) 57\n[17] G. t Hooft, Phys. Lett. B198, 61-63 (1987).\n[18] N. Arkani-Hamed, S. Dimopoulos and G. R. Dvali, \"The hierarchy problem and new dimensions at a millimeter,\" Phys. Lett. B 429, 263 (1998)\n[arXiv:hep-ph/9803315];\n[19] I. Antoniadis, N. Arkani-Hamed, S. Dimopoulos and G. R. Dvali, \"New\ndimensions at a millimeter to a Fermi and superstrings at a TeV,\" Phys.\nLett. B 436, 257 (1998) [arXiv:hep-ph/9804398].\n[20] G. Dvali, G. Gabadadze, M. Kolanovic and F. Nitti, Phys. Rev. D 65\n(2002) 024031 [arXiv:hep-th/0106058];\nS.B. Giddings and S.D. Thomas, Phys. Rev. D 65 (2002) 056010\n[arXiv:hep-ph/0106219];\nS. Dimopoulos and G.L. Landsberg, Phys. Rev. Lett. 87 (2001) 161602\n[arXiv:hep-ph/0106295].\n[21] G. 't Hooft, \"Graviton Dominance in Ultrahigh-Energy Scattering,\"\nPhys. Lett. B198, 61-63 (1987).\n[22] D. Amati, M. Ciafaloni, G. Veneziano, \"Superstring Collisions at\nPlanckian Energies,\" Phys. Lett. B197, 81 (1987); \"Classical and Quantum Gravity Effects from Planckian Energy Superstring Collisions,\" Int.\nJ. Mod. Phys. A3, 1615-1661 (1988);\n22\n\n\f[23] D. J. Gross, P. F. Mende, Nucl. Phys. B 303 (1988) 407;\n[24] N. Arkani-Hamed, S. Dimopoulos, G.R. Dvali, Phenomenology,\nastrophysics and cosmology of theories with submillimeter dimensions and TeV scale quantum gravity, Phys.Rev. D59 (1999) 086004,\nhep-ph/9807344.\n[25] G. G. Raffelt, Lect. Notes Phys. 741, 51 (2008).\n[26] S. Schlamminger, K.-Y. Choi, T.A. Wagner, J.H. Gundlach, E.G. Adelberger, Test of the equivalence principle using a rotating torsion balance,\nPhys.Rev.Lett. 100 (2008) 041101; arXiv:0712.0607 [gr-qc]\n\n23\n\n\f"}