{"id": "http://arxiv.org/abs/0706.2916v2", "guidislink": true, "updated": "2007-10-23T06:55:28Z", "updated_parsed": [2007, 10, 23, 6, 55, 28, 1, 296, 0], "published": "2007-06-20T05:24:30Z", "published_parsed": [2007, 6, 20, 5, 24, 30, 2, 171, 0], "title": "Factor Two Discrepancy of Hawking Radiation Temperature", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0706.2528%2C0706.0236%2C0706.0217%2C0706.3783%2C0706.3649%2C0706.0049%2C0706.0324%2C0706.0433%2C0706.0797%2C0706.1198%2C0706.0147%2C0706.1810%2C0706.2336%2C0706.4080%2C0706.2041%2C0706.2643%2C0706.0166%2C0706.1994%2C0706.0513%2C0706.2001%2C0706.0191%2C0706.4028%2C0706.3992%2C0706.1052%2C0706.1600%2C0706.4203%2C0706.3236%2C0706.0350%2C0706.4121%2C0706.0704%2C0706.2633%2C0706.3871%2C0706.0835%2C0706.2091%2C0706.0234%2C0706.4118%2C0706.1575%2C0706.1667%2C0706.1784%2C0706.0248%2C0706.3048%2C0706.0585%2C0706.0961%2C0706.3076%2C0706.2916%2C0706.3199%2C0706.1269%2C0706.1126%2C0706.1621%2C0706.0047%2C0706.0632%2C0706.0103%2C0706.1147%2C0706.4468%2C0706.0587%2C0706.3018%2C0706.3833%2C0706.3962%2C0706.2965%2C0706.3428%2C0706.3243%2C0706.4027%2C0706.0520%2C0706.3685%2C0706.4034%2C0706.3200%2C0706.0091%2C0706.0589%2C0706.2721%2C0706.1768%2C0706.0066%2C0706.0998%2C0706.0030%2C0706.1658%2C0706.1968%2C0706.0880%2C0706.2898%2C0706.4252%2C0706.3563%2C0706.2864%2C0706.3375%2C0706.2717%2C0706.1796%2C0706.4341%2C0706.1000%2C0706.0485%2C0706.4260%2C0706.1413%2C0706.4379%2C0706.1380%2C0706.0440%2C0706.0405%2C0706.1711%2C0706.2316%2C0706.4286%2C0706.0783%2C0706.3750%2C0706.3634%2C0706.2503%2C0706.2747%2C0706.3908&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Factor Two Discrepancy of Hawking Radiation Temperature"}, "summary": "The possibility of an alternative way to formulate the Hawking radiation in a\nstatic Schwarzschild spacetime has been explored. To calculate the Hawking\nradiation, there can be two possible choices of the spacetime wedge pairs in\nthe Krucal-Szekeres coordinates. One is the wedge pair consists of exterior\nspacetime of a black hole and the exterior spacetime of a white hole, and the\nother is that of exterior and interior spacetimes of one black hole. The\nradiation from the former is the Hawking's original one. Though the the latter\nhas been often regarded as the same phenomena as the former, the result here\nsuggests it is not; its radiation has a temperature twice as high as the\nHawking temperature.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0706.2528%2C0706.0236%2C0706.0217%2C0706.3783%2C0706.3649%2C0706.0049%2C0706.0324%2C0706.0433%2C0706.0797%2C0706.1198%2C0706.0147%2C0706.1810%2C0706.2336%2C0706.4080%2C0706.2041%2C0706.2643%2C0706.0166%2C0706.1994%2C0706.0513%2C0706.2001%2C0706.0191%2C0706.4028%2C0706.3992%2C0706.1052%2C0706.1600%2C0706.4203%2C0706.3236%2C0706.0350%2C0706.4121%2C0706.0704%2C0706.2633%2C0706.3871%2C0706.0835%2C0706.2091%2C0706.0234%2C0706.4118%2C0706.1575%2C0706.1667%2C0706.1784%2C0706.0248%2C0706.3048%2C0706.0585%2C0706.0961%2C0706.3076%2C0706.2916%2C0706.3199%2C0706.1269%2C0706.1126%2C0706.1621%2C0706.0047%2C0706.0632%2C0706.0103%2C0706.1147%2C0706.4468%2C0706.0587%2C0706.3018%2C0706.3833%2C0706.3962%2C0706.2965%2C0706.3428%2C0706.3243%2C0706.4027%2C0706.0520%2C0706.3685%2C0706.4034%2C0706.3200%2C0706.0091%2C0706.0589%2C0706.2721%2C0706.1768%2C0706.0066%2C0706.0998%2C0706.0030%2C0706.1658%2C0706.1968%2C0706.0880%2C0706.2898%2C0706.4252%2C0706.3563%2C0706.2864%2C0706.3375%2C0706.2717%2C0706.1796%2C0706.4341%2C0706.1000%2C0706.0485%2C0706.4260%2C0706.1413%2C0706.4379%2C0706.1380%2C0706.0440%2C0706.0405%2C0706.1711%2C0706.2316%2C0706.4286%2C0706.0783%2C0706.3750%2C0706.3634%2C0706.2503%2C0706.2747%2C0706.3908&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "The possibility of an alternative way to formulate the Hawking radiation in a\nstatic Schwarzschild spacetime has been explored. To calculate the Hawking\nradiation, there can be two possible choices of the spacetime wedge pairs in\nthe Krucal-Szekeres coordinates. One is the wedge pair consists of exterior\nspacetime of a black hole and the exterior spacetime of a white hole, and the\nother is that of exterior and interior spacetimes of one black hole. The\nradiation from the former is the Hawking's original one. Though the the latter\nhas been often regarded as the same phenomena as the former, the result here\nsuggests it is not; its radiation has a temperature twice as high as the\nHawking temperature."}, "authors": ["Tadas K. Nakamura"], "author_detail": {"name": "Tadas K. Nakamura"}, "author": "Tadas K. Nakamura", "arxiv_comment": "10 pages, 1 figure, v2: abstract, introduction, discussions section\n  revised", "links": [{"href": "http://arxiv.org/abs/0706.2916v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0706.2916v2", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "hep-th", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "hep-th", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0706.2916v2", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0706.2916v2", "journal_reference": null, "doi": null, "fulltext": "Factor Two Discrepancy of Hawking\nRadiation Temperature\n\narXiv:0706.2916v2 [hep-th] 23 Oct 2007\n\nTadas K. Nakamura\nFukui Prefectural University, 4-1-1 Eiheiji, Fukui 910-0095, Japan\n\nAbstract\nThe possibility of an alternative way to formulate the Hawking radiation in a static\nSchwarzschild spacetime has been explored. To calculate the Hawking radiation,\nthere can be two possible choices of the spacetime wedge pairs in the Krucal-Szekeres\ncoordinates. One is the wedge pair consists of exterior spacetime of a black hole and\nthe exterior spacetime of a white hole, and the other is that of exterior and interior\nspacetimes of one black hole. The radiation from the former is the Hawking's original\none. Though the the latter has been often regarded as the same phenomena as the\nformer, the result here suggests it is not; its radiation has a temperature twice as\nhigh as the Hawking temperature.\nKey words:\nPACS: 04.62.+v, 04.70.Dy\n\n1\n\nIntroduction\n\nRight after the Hawking's original paper [1], attempts have been made to derive the Hawking radiation from a vacuum in a static Schwarzschild spacetime\n[2,4,3,5,6]. The choice of the correct vacuum is crucial in such attempts. It is\nwell known that the definition of a vacuum is not unique in curved spacetimes,\nand there is no general prescription to define a natural vacuum. Therefore\nwe have to determine somehow which vacuum is actually realized, depending on each problem. The difficulty to find such a vacuum in a Schwarzschild\nspacetime comes from its bifurcating Killing horizons. The horizons divide the\nextended Schwarzschild spacetime into four spacetime wedges, and we have\nseveral choices of wedges or wedge pairs to define the vacuum.\nEmail address: tadas@fpu.ac.jp (Tadas K. Nakamura).\nURL: http://mira.bio.fpu.ac.jp/tadas/ (Tadas K. Nakamura).\n\nPreprint submitted to Elsevier\n\n2007/10/20\n\n\fUnruh [4] compared two distinct definitions of vacua, called η definition and\nξ definition in his paper. The vacuum in ξ definition is often referred as the\nHartle-Hawking vacuum, which is calculated from analytic functions across the\nexterior spacetime of a black hole and the exterior spacetime of a white hole.\nOn the other hand, it is also possible to define a vacuum state on the exterior\nwedge of a black hole alone, which is the η definition; the vacuum with this\ndefinition is often called Boulware vacuum. Unruh [4] considered the HaretleHawking vacuum is preferable because Boulware vacuum has singularity on\nphysical quantities such as energy. This point has been examined extensively\nby several authors [5,6], and it was shown that under some basic assumptions,\nthe Hartle-Hawking vacuum is the only mathematically reasonable one in a\nwide class of spacetimes with Killing horizons [7].\nThe legitimacy of the Hartle-Hawking vacuum shown in the above mentioned\npapers is, however, based on the particle number (or a conserved quantity\nalong the Killing field, in general) defined on a Cauchy surface in the KruscalSzekeres coorinates. The vacua are calculated with analytic functions across\nthe two exterior spacetime wedges; one is of a black hole and the other is of a\nwhite hole. Therefore, what have shown is that the Hartle-Hawking vacuum\nis the natural vacuum among the vacua across these two exterior spacetime\nwedges.\nIn the present paper we explore another possibility of vacuum that spans across\nthe interior and exterior spacetime wedges of a black hole; we will call this R-F\nvacuum hereafter. This is the vacuum defined with the particle number on a\nsurface with t = constant. There have been several papers [8,9,10] that regard\nthe R-F vacuum as the source of the Hawking radiation, however, it seems its\ndifference from the Hartle-Hawking vacuum was not well recognized; most of\npapers consider the radiation from the R-F vacuum is the same phenomena\nas that from the Hartle-Hawking vacuum. However, our calculation shows the\ntemperature of the radiation from the R-F vacuum is twice as large as the\none with the Hartle-Hawking vacuum, which means the R-F vacuum is not\nidentical to the Hartle-Hawking vacuum.\nThis temperature discrepancy of factor two was first reported by Akhmedov\net al. [12]. In relatively recent years, an approach based on the tunneling effect\nhas been extensively investigated ([11,12] and references therein). Akhmedov\net al. [12] have carefully examined the integration contour in the tunneling\ncalculation, and concluded the resulting radiation temperature is twice as\nlarge as the Hawking's original value. The view point with tunneling effect may\nnot physically well founded, however, it can be reinterpreted in the context\nof canonical quantization in the R-F wedge pair when back reaction of the\nparticles to the metric is neglected. Then what calculated by Akhmedov et al.\n[12] (or other papers with tunneling picture) coincides with the radiation from\nthe R-F vacuum in the present paper. Therefore, the factor two discrepancy\n2\n\n\freported by Akhmedov et al. [12] can be explained by the difference of vacua\n(R-F or Hartle-Hawking) from which the radiation comes from.\nWe first examine the case of Unruh effect in the next section. Though the R-F\nvacuum has little physical significance in the Minkowski spacetime, its radiation is mathematically simpler and can be a good example for this type of\nvacua in other spacetimes. Its results are readily applied to the Schwarzschild\nspacetime since the structure near the bifurcating horizons are the same\nin both spacetimes. The application to the Schwarzschild spacetime is then\nsketched in the following section. A brief discussion on the validity of our\napproach is provided in the last section of this paper.\n\n2\n\nRadiation from Minkowski Vacua\n\n2.1 Canonical Quantization with Horizons\nSuppose two dimensional coordinate system (η, ξ) with the following metric:\nds2 = A(ξ) dη 2 − B(ξ)−1 dξ 2.\n\n(1)\n\nThe wave equation of a massless scalar particle may be written as\n1 ∂2\nφ−\nA ∂η 2\n\ns\n\n∂\nB ∂√\nAB φ = 0.\nA ∂ξ\n∂ξ\n\n(2)\n\nNow let us assume there is one and only one point where A(ξ)B(ξ) = 0.\nWe choose ξ coordinate such that ξ = 0 at that point; we call ξ > 0 region\n\"positive side\" and ξ < 0 region \"negative side\".\nSeparating the variables, we write eigenfunctions with respect to ξ on the\npositive/negative side as\n\n\n uP\n\nuPk = \n\n\nk\n\n0\n\n(ξ ≥ 0)\n\n,\n\n(ξ < 0)\n\n\n\n0\n\nuN\nk = \n\n\n(ξ ≥ 0)\n\nuN\n(ξ < 0)\nk\n\n.\n\n(3)\n\nWe assume the inner product h* * *i is properly defined from the metric, and\nuP,N\nare normalized as\nk\nD\n\nE\n\nD\n\nE\n\nN\nuPk , uPk′ = uN\nk , uk ′ = δkk ′ .\n\n(4)\n\n3\n\n\fWe can construct a solution e−ikη Uk (ξ) that satisfies Eq (2) over −∞ < ξ < ∞\nacross ξ = 0 in the following:\n\nUk =\n\n\n\n θP\nk\n\n\n θN\nk\n\nuPk\n\n(ξ ≥ 0)\n\nuN\n(ξ < 0)\nk\n\n.\n\n(5)\n\nThe wave equation Eq (2) is satisfied when we adjust the coefficients θkP,N\nso that Uk (ξ) becomes analytic across ξ = 0; at the same time θkP,N should\nsatisfy the normalization condition hUk , Uk i = 1. Then we can expand a wave\nsolution φ as\nφ(η, ξ) =\n\nX\n\na(η) Uk (ξ)\n\nk\n\nDecomposing a(η) into the positive and negative frequency modes and calculating Boglubov coefficients from θkP,N , we can obtain the spectrum of Hawking/Unruh radiation,\n\n2.2 R-L (Right-Left) vacuum\n\nThis vacuum corresponds to the Hartle-Hawking vacuum in a extended Schwarzschild\nspacetime; we call this type of vacuum R-L vacuum in this paper. Obviously\nthis vacuum is the usual vacuum realized in a flat spacetime.\nLet us define the Rindler coordinate system as\nt = ξ sinh aη, x = ξ cosh aη ,\n\n(6)\n\nwhere t and x are ordinary time and space coordinates in the Minkowski\nspacetime. The range of the space coordinate ξ spans −∞ < ξ < ∞ so that\nthe above equation covers both R and L regions (referred as Wedge R and\nWedge L hereafter) illustrated in Figure 1.\n4\n\n\fThe inner product is defined as\n′\n\nhφ, φ i =\n\nZ∞\n\nξ −1 φ φ′∗ dξ .\n\n(7)\n\n−∞\n\nand the eigenfunctions on Wedges R and L become\nuR\nk\n\n!\n\n!\n\nik\nik\nln ξ , uLk = exp − ln |ξ| .\n= exp\na\na\n\n(8)\n\nIt should be noted that the norm of the above eigenfunctions calculated from\nEq (7) diverges as usually we encounter in this type of calculations. In the following we assume an appropriate prescription, such as wave packet treatment,\nhas been applied implicitly to avoid this difficulty.\nWe wish to obtain the solution across R and L Wedges in the form of Uk in\nEq (5). To this end, we must choose θkP,N such that Eq (2) holds across the\npoint of ξ = 0. If we choose arbitrary θkP,N then discontinuity occurs at ξ = 0,\nand the right hand side of Eq (2) will have a δ-function shaped \"source term\"\nat ξ = 0. To avoid this we have to adjust θkP,N so that Uk becomes analytic\nacross ξ = 0. Using the analytic continuation of the logarithmic function,\nln(−ξ) = iπ + ln ξ, such coefficients θkP,N can be calculated in the following:\n1\n√\n1 − e−πk/a\nθkP =\neπk\n\n\n\n√\n1 − eπk/a\n\n\n\n\n\n\n(k ≥ 0)\n(k < 0)\n\n,\n\n\n\n\n\n\n\ne−πk/a\n1 − e−πk/a\nθkN =\n\n1\n\n\n√\n1 − eπk/a\n5\n\n√\n\n(k ≥ 0)\n(k < 0)\n\n.\n\n(9)\n\n\fThe Unruh radiation spectrum becomes\n1\n1\nP (k) ∝ (θkP 2 + θkN 2 − 1) =\n2\nexp(2πk/a) − 1\n\n(10)\n\nfor k > 0 (see, eg., Birrel and Davies [13], p105 for details of calculation).\n\n2.3 R-F (Right-Future) vacuum\nThe above calculation has been done with the solution that spans over Wedges\nof R and L in Figure 1. We perform the same calculations with the solution over\nWedges R and F in this subsection. This does not have physical significance\nfor a flat spacetime, however, the similar calculation becomes important in\nthe Schwarzschild spacetime as we will see in the next section. We examine\nthe R-F case with a flat spacetime because it has essentially the same but\nmathematically simpler spacetime structure.\nWe define the coordinates (η ′ , ξ ′) in Wedge F by\nt = ξ ′ cosh aη ′ , x = ξ ′ sinh aη ′ ,\n\n(11)\n\nwhere η ′ and ξ ′ are real numbers, The eigenfunction with respect to ξ ′ in\nWedge F becomes\nik\nuFk = exp\nln ξ ′\na\n\n!\n\n.\n\n(12)\n\nLet us recall that the key point in the previous calculation is in the process\nto construct the solution Uk that satisfies Eq (2) across the singular point of\nξ = 0. There we utilized the analyticity of Uk as a function of ξ across the both\nwedges. The reason why this works is that the coordinate ξ is itself analytic\nacross the wedges, in other words, we can express any point in both wedges\nwith the same single expression of Eq (6).\nWe wish to take the same approach here, that is, to express points in Wedge\nF with Eq (11). This can be done by complexifing η and ξ as\nη=\n\niπ\n− η′,\n2\n\nξ = iξ ′ ,\n\n(13)\n\nthen the complex numbers (η, ξ) can express any points in Wedges F and R\nwith Eq (6). Having done that, uFk may be expressed using logarithmic analytic\n6\n\n\fcontinuation (ln iξ ′ = iπ/2 + ln ξ ′ ) as\nuFk\n\n!\n\nik\nik\n= exp\nln ξ = eπk/2a exp\nln ξ ′\na\na\n\n!\n\n.\n\n(14)\n\nThen the same calculation as in the R-L case gives the radiation spectrum as\nP (k) ∝\n\n1\n,\nexp(πk/a) − 1\n\n(15)\n\nwhich has the temperature twice as large as in the R-L case.\n\n3\n\nSchwarzschild coordinates\n\nNow let us move on to the Schwarzschild coordinate system whose metric is\ngiven by\n\u0012\n\nds2 = − 1 −\n\n2M\n2M\ndt2 + 1 −\nr\nr\n\u0013\n\n\u0012\n\n\u0013−1\n\ndr 2 + r 2 dΩ2 .\n\n(16)\n\nwhere symbols have conventional meaning. The Rindler coordinates (η, ξ) correspond to (t, r − 2M) in the above Schwarzschild coordinates. Wedges R and\nF in Figure 1 correspond to the interior and exterior spacetimes of a black\nhole respectively, and Wedges L and P correspond to the \"white hole\" in\nthe extended Schwarzschild coordinates. Since the spacetime structure near\nKilling horizons are the same in the Rindler and Schwarzschild coordinates\n(see, eg., [14], p128), the arguments in the previous subsections are valid for\nthe Schwarzschild coordinates with a = 1/4M. We briefly sketch in the following the procedure of analytic continuation that leads us to this result.\nThe the solutions to the wave equation Eq (2) have the form of\nuR,L\n∝ exp ik[ξ + 2M + 2M ln(ξ/2M)]\nk\n\n(17)\n\nwhere ξ = r − 2M. The coordinates (t, ξ) naturally covers Wedge R with\nξ > 0 and Wedge L with ξ < 0. Using ln(−ξ/2M) = ln(ξ/2M) + iπ, we\nobtain the amplitude discontinuity as exp(−πMk). This means the radiation\ntemperature is twice as large as the Hawking's prediction.\nContinuation from Wedge R to Wedge L is not that straightforward. We notice\nin the above calculation the discontinuity comes from the analytic continuation\nof the logarithmic function, therefore we have to find an appropriate way to\n7\n\n\fanalytically extend the logarithmic function from Wedge R to Wedge L. To\nthis end, we express the Schwarzschild coordinates in Wedge L as (t′ , ξ ′ ) and\nexamine the analytic relation of ln ξ in Wedge R and ln ξ ′ in Wedge L. The\nfollowing Kruscal Szekeres coordinates (U, V ) are analytical across Wedges R\nand L,\nξ\nUV = −2Mξ exp\n+1\n2M\n\u0012\n\u0013\nt\n|U/V | = exp\n,\n2M\n\n!\n\n(18)\n\ntherefore, expressing ξ by U and V gives the analyticity across the Wedges.\nNear ξ = 0 we can approximate\nV −U ≃\n\nq\n\n2Mξ .\n\n(19)\n\nat t = 0. In Wedge R this is equivalent to\nln(V − U) =\n\n1\nln 2Mξ ,\n2\n\n(20)\n\nsince V − U > 0; its analytic continuation to the region of V − U < 0 (Wedge\nL) is\nln(V − U) = πi + ln |V − U| .\n\n(21)\n\nTherefore the analytic continuation of the logarithmic function from Wedge\nR to Wedge L may be written as\nln ξ ′ = 2πi + ln ξ .\n\n(22)\n\nThe above expression inserted into Eq (17) results in the amplitude jump of\nexp(−2πMk). The rest of the calculation is the same as in the Rindler case,\nand we obtain the temperature predicted in the Hawking's original paper [1].\n\n4\n\nConcluding Remarks\n\nThe present paper has explored the possibility of an alternative vacuum to\nobtain Hawking radiation; the difference is in the choice of the wedge pair to\ndefine the vacuum. Most of past papers with a static Schwarzschild spacetime\n[4,2,3,5,6,7] were based on the vacuum across the exterior spacetime of a black\n8\n\n\fhole and the exterior space of a white hole, which is referred as R-L vacuum in\nthe present paper. On the other hand, several attempts have made to calculate\nthe radiation with the vacuum across the interior and exterior spacetimes\nof a black hole (R-F vacuum) [8,9,10,11,12]. To the author's knowledge, the\ndifference of these two vacua is not well recognized so far, and the radiation\nform R-L and R-F vacua are regarded as the same phenomena. The result\nof the present paper suggests these two are distinct; the temperature of the\nradiation from the R-F vacuum is twice as large as that of R-L vacuum.\nAt the present we do not know which (R-F or R-L) vacuum should be realized\naround a black hole. The R-L vacuum requires the Kruscal extension, or a\n\"white hole\", which is usually considered unphysical. On the other hand, the\nquantum construction for R-F vacuum may be questionable. In general, the\nprocedure of quantization in a curved spacetime is based on a Cauchy surface\nwith timelike normal vectors. However, if we choose the surface of t = constant\nin the Schwarzschild coordinates for a R-F vacuum, it is not a Cauchy surface\nbecause its normal vectors become spacelike in Wedge F.\nThere may be two approaches to avoid this problem of R-F vacuum. One\nis to extend the method of quantization to be able to utilize surfaces with\nspacelike normal vectors instead of Cauchy surfaces. Recently several papers\nhave been published proposing a quantization method in which an arbitrary\nclosed surface can play the role of the Cauchy surface [15,16,17]. This method\nmay be applicable to the quantization for R-F vacuum. The other way is to\nstay in the conventional quantization with a Cauchy surface, but define the\nparticle number on the surface with t = constant. Then the surface to define\nthe particle number can have spacelike normal vector within the conventional\nframework. Now the author of the present paper is working on this direction\nand the result will be reported in a forthcoming paper.\nBefore closing this paper, let us briefly take a look at the original derivation\nby Hawking [1]. The R-F vacuum means the ground state with respect to the\ntotal \"energy\" in the interior and exterior spacetimes. (Here \"energy\" means\nthe conserved quantity that agrees with the usual energy in a flat spacetime at\nthe region far away from the black hole.) Hawking [1] examined the process of\na star collapse, assuming a vacuum state long before the star collapse remains\nunchanged long after the black hole formation. With this assumption, what\nrealized at the later time is the Hartle-Hawking vacuum. It was the ground\nstate at the initial time, but it is not after the black hole formation; the ground\nsate at a later time is the R-F vacuum. The author of the present paper feels\nthe state is likely to settle down to the ground state somehow long after the\nblack hole formation, however, further investigation will be required to verify\nthis point. The scope of the present paper is just to point out the possibility of\nR-F vacuum and cannot tell which vacuum is actually realized around black\nholes at the present.\n9\n\n\fAcknowledgment: The author would like to thank M. Maeno for suggestions\nand discussions.\n\nReferences\n[1] Hawking, S. W., Comm. Math. Phys. 43, 199 (1975).\n[2] Hartle, J. B. and S. W. Hawking, Phys. Rev. D189, 13 (1976).\n[3] Israel, W., Phys. Lett. A57, 107 (1976).\n[4] Unruh, W.G., Phys. Rev. D14, 870 (1976).\n[5] Fulling, S.A., J. Phys. A10, 917 (1977).\n[6] Kay, S.B., Commun. Math. Phys. 100, 57 (1985).\n[7] Kay, S.B and M. Wald, Phys. Reports 207 49 (1991).\n[8] Unruh, W. G., Phys. Rev. D15 367 (1977).\n[9] Fredenhagen, K., and R. Haag, Commun. Math. Phys. 127 273 (1990).\n[10] Jacobson, T., gr-qc/0308048.\n[11] Parikh, M. K. and F. Wilczek, Phys. Rev. Lett. 85, 5042 (2000),\nhep-th/9907001.\n[12] Akhmedov E. T., V. Akhmedova, and D. Singleton, Phys. Lett. B642, 124\n(2006), hep-th/0608098; Akhmedov E. T., V. Akhmedova, P. Terry, and D.\nSingleton, Int. J. Mod. Phys A22, 1705 (2007), hep-th/0605137.\n[13] Birrell, N. D., and P. C. W. Davis, Quantum fields in curved space, Cambridge\nUniv. Prs. (1982).\n[14] Wald, R. M., Quantum field theory in curved spacetime and black hole\nthermodynamics, Univ. Chicago Prs, (1994).\n[15] Oeckl, R. Phys. Lett. B575 318 (2003).\n[16] Conrady, F., C. Rovelli, Int. J. Mod. Phys. A19 4037 (2004), hep-th/0310246.\n[17] Doplicher, L., Phys. Rev. D70 64037 (2004), gr-qc/0505006.\n\n10\n\n\f"}