{"id": "http://arxiv.org/abs/1008.2256v1", "guidislink": true, "updated": "2010-08-13T06:48:06Z", "updated_parsed": [2010, 8, 13, 6, 48, 6, 4, 225, 0], "published": "2010-08-13T06:48:06Z", "published_parsed": [2010, 8, 13, 6, 48, 6, 4, 225, 0], "title": "Carrier Localization, Metal-Insulator Transitions and Stripe Formation\n  in Inhomogeneous Hole-Doped Cuprates", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1008.1715%2C1008.0159%2C1008.0689%2C1008.3262%2C1008.3233%2C1008.0041%2C1008.3861%2C1008.4032%2C1008.3430%2C1008.5016%2C1008.0602%2C1008.0687%2C1008.4275%2C1008.5316%2C1008.3202%2C1008.0095%2C1008.4224%2C1008.1706%2C1008.2640%2C1008.3471%2C1008.4361%2C1008.4673%2C1008.4934%2C1008.5143%2C1008.1078%2C1008.1543%2C1008.0242%2C1008.4779%2C1008.2835%2C1008.5349%2C1008.0415%2C1008.4517%2C1008.5291%2C1008.3037%2C1008.4402%2C1008.2576%2C1008.0974%2C1008.3879%2C1008.2629%2C1008.1663%2C1008.1809%2C1008.5298%2C1008.0115%2C1008.4080%2C1008.3256%2C1008.4774%2C1008.0006%2C1008.3683%2C1008.3088%2C1008.3391%2C1008.2323%2C1008.1451%2C1008.4004%2C1008.1218%2C1008.1795%2C1008.1745%2C1008.1507%2C1008.0680%2C1008.3528%2C1008.3243%2C1008.1421%2C1008.4797%2C1008.0553%2C1008.0857%2C1008.4316%2C1008.2256%2C1008.4564%2C1008.0125%2C1008.2176%2C1008.5176%2C1008.4931%2C1008.3200%2C1008.4194%2C1008.0178%2C1008.0062%2C1008.4595%2C1008.1547%2C1008.5297%2C1008.4108%2C1008.4738%2C1008.4695%2C1008.4889%2C1008.0620%2C1008.2017%2C1008.0710%2C1008.5203%2C1008.4765%2C1008.2584%2C1008.0310%2C1008.5336%2C1008.3207%2C1008.1873%2C1008.1052%2C1008.3829%2C1008.4867%2C1008.4831%2C1008.0900%2C1008.4143%2C1008.2995%2C1008.5338%2C1008.2672&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Carrier Localization, Metal-Insulator Transitions and Stripe Formation\n  in Inhomogeneous Hole-Doped Cuprates"}, "summary": "We propose a unified approach for describing the carrier localization,\nmetal-insulator transitions (MITs) and stripe formation in high-$T_c$ cuprates.\nThe ground-state energy of a carrier interacting with a defect and with lattice\nvibrations is calculated within the continuum model and adiabatic\napproximation. At low doping levels, hole carriers in $\\rm{La}$-based systems\nwith large-radius dopants are localized near the dopants with the formation of\nhydrogenic impurity centers.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1008.1715%2C1008.0159%2C1008.0689%2C1008.3262%2C1008.3233%2C1008.0041%2C1008.3861%2C1008.4032%2C1008.3430%2C1008.5016%2C1008.0602%2C1008.0687%2C1008.4275%2C1008.5316%2C1008.3202%2C1008.0095%2C1008.4224%2C1008.1706%2C1008.2640%2C1008.3471%2C1008.4361%2C1008.4673%2C1008.4934%2C1008.5143%2C1008.1078%2C1008.1543%2C1008.0242%2C1008.4779%2C1008.2835%2C1008.5349%2C1008.0415%2C1008.4517%2C1008.5291%2C1008.3037%2C1008.4402%2C1008.2576%2C1008.0974%2C1008.3879%2C1008.2629%2C1008.1663%2C1008.1809%2C1008.5298%2C1008.0115%2C1008.4080%2C1008.3256%2C1008.4774%2C1008.0006%2C1008.3683%2C1008.3088%2C1008.3391%2C1008.2323%2C1008.1451%2C1008.4004%2C1008.1218%2C1008.1795%2C1008.1745%2C1008.1507%2C1008.0680%2C1008.3528%2C1008.3243%2C1008.1421%2C1008.4797%2C1008.0553%2C1008.0857%2C1008.4316%2C1008.2256%2C1008.4564%2C1008.0125%2C1008.2176%2C1008.5176%2C1008.4931%2C1008.3200%2C1008.4194%2C1008.0178%2C1008.0062%2C1008.4595%2C1008.1547%2C1008.5297%2C1008.4108%2C1008.4738%2C1008.4695%2C1008.4889%2C1008.0620%2C1008.2017%2C1008.0710%2C1008.5203%2C1008.4765%2C1008.2584%2C1008.0310%2C1008.5336%2C1008.3207%2C1008.1873%2C1008.1052%2C1008.3829%2C1008.4867%2C1008.4831%2C1008.0900%2C1008.4143%2C1008.2995%2C1008.5338%2C1008.2672&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We propose a unified approach for describing the carrier localization,\nmetal-insulator transitions (MITs) and stripe formation in high-$T_c$ cuprates.\nThe ground-state energy of a carrier interacting with a defect and with lattice\nvibrations is calculated within the continuum model and adiabatic\napproximation. At low doping levels, hole carriers in $\\rm{La}$-based systems\nwith large-radius dopants are localized near the dopants with the formation of\nhydrogenic impurity centers."}, "authors": ["S. Dzhumanov", "O. K. Ganiev", "Z. S. Khudayberdiev"], "author_detail": {"name": "Z. S. Khudayberdiev"}, "author": "Z. S. Khudayberdiev", "arxiv_comment": "10 pages, 2 figures, one table", "links": [{"href": "http://arxiv.org/abs/1008.2256v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1008.2256v1", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "cond-mat.supr-con", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cond-mat.supr-con", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "cond-mat.soft", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "F.2.2; I.2.7", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1008.2256v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1008.2256v1", "journal_reference": null, "doi": null, "fulltext": "APS/123-QED\n\nCarrier Localization, Metal-Insulator Transitions and Stripe Formation in\nInhomogeneous Hole-Doped Cuprates\nS. Dzhumanov,∗ O.K. Ganiev, and Z.S. Khudayberdiev\n\narXiv:1008.2256v1 [cond-mat.supr-con] 13 Aug 2010\n\nInstitute of Nuclear Physics, 100214, Ulughbek, Tashkent, Uzbekistan\n(Dated: November 2, 2018)\nWe propose a unified approach for describing the carrier localization, metal-insulator transitions\n(MITs) and stripe formation in inhomogeneous hole-doped cuprates. The ground-state energy of\na carrier interacting with a defect and with lattice vibrations is calculated variationally within\nthe continuum model and adiabatic approximation. At low doping levels, hole carriers in La-based\nsystems with large-radius dopants are localized near the dopants with the formation of hydrogen-like\nimpurity centers. As the doping increases, the carriers are liberated from the hydrogen-like impurity\ncenters and are self-trapped in a defect-free deformable lattice with the formation of intrinsic large\npolarons. In La-based cuprates with small-radius dopants, hole carriers are self-trapped near the\ndopants with the formation of non-hydrogen-like impurity centers or extrinsic large polarons. The\ncharge ordering and formation of different superlattices and energy bands of dopants and intrinsic\nlarge polarons at their inhomogeneous spatial distribution trigger the MITs in cuprates. We analyse\nthe validity of the criteria for the Mott and Anderson MITs in La-based cuprates with hydrogenlike impurity centers and show that such MITs in these systems are unlikely possible. Using the\nuncertainty principle we derive the quantitative criteria for the new MITs caused by strong carrierdopant-phonon and carrier-phonon interactions. We show that the MITs in La-based cuprates with\nlarge-radius dopants are driven by intrinsic self-trapping and charge ordering, while the anisotropy\nof dielectric constants fosters the MITs accompanied by the formation of static stripes (in carrierpoor domains) and dynamic ones (in carrier-rich domains) in the range of doping x ≃0.04-0.125.\nThe so-called 1/8 anomaly is especially pronounced in these systems. The small-radius dopants\nand the anisotropy of dielectric constants favor carrier localization, MITs and stripe formation in\na wide range of doping (including also \"magic\" doping x=1/8) in other La-based cuprates, where\nx=1/8 is no longer \"magic\" doping. Finally, the MIT and 1/8 anomaly in cuprates caused by\nthe commensurate ordering of planar large bipolarons and their condensation into a liquid are also\ndiscussed. The obtained results are in quantitative agrement with the experimental data on polaron\nformation, MITs and stripe formation in La-based cuprates.\nPACS numbers: 71.30.+h, 71.38.+i, 71.55.-i, 74.20.Mn, 74.72.-h, 74.72.Dn\n\nI.\n\nINTRODUCTION\n\nThe carrier localization, metal-insulator transitions\n(MITs) and stripe formation in hole-doped cuprates\nare the most challenging problems in condensed matter\nphysics. These phenomena have attracted much attention because they are closely related to high-Tc superconductivity in cuprates1–15 . The mechanisms for carrier localization and MITs in the cuprates and related materials\nhave been under discussion since the discovery of highTc superconductivity1–10,12,15,17–19 . Another important\nproblem of the physics of high-Tc cuprates is the role of\nthe electronic inhomogeneity and charge ordering in the\nstripe formation11,14,20,21 , which is intimately related to\ncarrier localization and MITs in these materials. For\ncuprates within the insulating antiferromagnetic (AF)\nphase, the electron correlation is likely to dominate the\ncarrier localization; when a MIT is approached, it is not\nobvious which process will dominate12,22 . Actually, the\nMITs in the cuprates might be different from the Mott\nand Anderson transitions. In these systems, the phenomena of carrier localization seem to be much more complicated by electron-defect-lattice and/or electron-lattice\ninteraction effects which become very pronounced close\nto the MIT9,22 . Generally, the electron-defect-lattice\n\nand/or electron-lattice interactions and the electronic inhomogeneity are known to foster carrier localization in\nsolids. In particular, the strong electron-defect-phonon\nand electron-phonon interactions foster carrier localization by causing extrinsic and intrinsic self-trapping. At\nthe same time the gross electronic inhomogeneities might\nplay an important role in carrier localization, MITs\nand formation of insulating and metallic stripes in the\ncuprates. There is now increasing experimental evidence\nfor the existence of extrinsic polarons (i.e., charge carriers self-trapped near the dopants or impurities), intrinsic polarons (or charge carriers self-trapped in a defectfree deformable lattice) and electronic inhomogeneities\nin these materials9,20,21,23,24 . In addition, various experiments on hole-doped La-based cuprates show that\nthe MITs and stripe formation occur in underdoped (at\ndoping levels x = 0.05 − 0.125)25,26 , optimally doped\n(x = 0.15−0.16)8, and overdoped (x = 0.16−0.25)16,21,27\nregimes. However, the role of electronic inhomogeneities\nand strong carrier-defect-phonon and carrier-phonon interactions, which is known to be very important in the\nvicinity of the MITs20,22,28 , has not been fully explored\nin the underdoped regime. While the effects of ionic (or\ndopant) size and anisotropy of dielectric constants, which\nmay play a key role in carrier localization and MITs,\n\n\f2\nhave not been studied theoretically in inhomogeneous\nLa-based cuprates in a wide hole concentration range\nfrom x ∼ 0.02 (lightly doped regime) to x ∼ 0.25 (heavily overdoped regime). In this work we examine such\ninhomogeneous systems in which the electronic charge\ninhomogeneities in conjunction with the strong carrierdefect-phonon and/or carrier-phonon interactions induce\nthe carrier localization and MITs accompanied by the\nstripe formation in a wide range of doping. In so doing, we study the MITs and stripe formation in highTc cuprates driven by the inhomogeneous local doping,\ncharge ordering and self-trapping of hole-carriers near defects (impurities) or in a defect-free deformable lattice.\nThis paper is organized as follows. First, in Sec. II, we\ninvestigate the extrinsic (or defect-assisted) and intrinsic\nself-trapping of carriers, and analyze the possibility of\nformation of extrinsic (hydrogen-like and non-hydrogenlike) and intrinsic self-trapped states in hole-doped Labased cuprates. Then, in Sec. III, we consider the possible forms of charge ordering and the formation of different superlattices and energy bands of dopants (i.e., acceptors) and intrinsic large polarons at their inhomogeneous\nspatial distribution. In Sec. IV, we examine the validity\nof the criteria for the Mott and Anderson transitions in\nLa-based cuprates with hydrogenic impurity centers. We\nargue that such transitions in the cuprates are unlikely\npossible. We give our view of the new MITs in La-based\ncuprates with extrinsic large polarons (non-hydrogen-like\nimpurity centers) or intrinsic large polarons and derive\nthe quantitative criteria for the MITs by using the pertinent uncertainty relation. We show that in these systems\nthe extrinsic and/or intrinsic self-trapping of hole carriers\nand the distinctly different charge ordering result in the\nnew MITs which occur at different doping levels. Further, we find that, the ionic radius of dopants and the\nanisotropy of dielectric constants strongly influence on\ncarrier localization, MITs, stripe formation and so-called\n1/8 anomaly in La-based cuprates. These predictions are\nconsistent with distinctive features of MITs, stripe formation and 1/8 anomaly observed in the cuprates. Finally, we briefly discuss the other type of MIT and the\n1/8 anomaly in hole-doped cuprates caused by the commensurate ordering of planar large bipolarons and their\ncondensation into a liquid. The paper concludes with\nSec. V, in which the principle results are summarized.\n\nII. EXTRINSIC AND INTRINSIC\nSELF-TRAPPING OF HOLE CARRIERS\n\nThe undoped layered cuprates are typical chargetransfer (CT)-type Mott insulators. According to the\nband calculations and spectroscopic data10,29 , the electronic structure of these parent CuO2 -based compounds\nis well described by the three-band Hubbard model and\nthe oxygen valence band lies within the Mott-Hubbard\ngap. Upon hole doping, the oxygen valence band of the\ncuprates is occupied by free holes. The hole carriers are\n\nassumed to be within both a three-dimensional (3D) and\ntwo-dimensional (2D) deformable medium, the last one\nbeing CuO2 layers1,6 . The large static dielectric constant\nε0 (>> 10) both parallel and perpendicular to the CuO2\nlayers1,9 indicate that lattice ions may be significantly\ndisplaced in all three directions. In reality, the CuO2\nbased materials may be approximated as a 3D deformable\nmedium1 . As it was pointed out in Ref.30 , the existence\nof the 3D bismuth oxide high-Tc superconductors, which\nbelong to the same class of materials as the copper oxides, casts an extra doubt on the theories based mainly\non the low dimensionality of the crystal structure. There\nis also convincing experimental evidence that the consideration of cuprates as 3D systems may appear to be more\nappropriate (see Ref.12,31 ). In these anisotropic 3D polar\nmaterials, the hole carriers interacting both with lattice\nvibrations (i.e., acoustic and optical phonons) and with\nlattice defects (e.g., dopants or impurities), can easily\nbe self-trapped near the lattice defects. Such extrinsic\nself-trapping of hole carriers leads to the formation of\na moderately deep extrinsic polaronic or a shallow hydrogenic state in the CT gap of the parent cuprates.\nThe theory of carrier self-trapping has been developed\nin Refs.1,5,6,32,33 in the framework of the continuum approach. As shown in Refs.33,34 , the continuum theory of\ncarrier self-trapping in a defect-free system can be easily extended to the system consisting of a defect and a\nbound charge carrier. Such a continuum approach is better suited for the quantitative analysis. In the framework\nof the continuum model, we make an attempt to analyze\nthe possibility of the formation of hydrogen-like and nonhydrogen-like impurity states as well as polaronic ones in\nthe CT gap of the cuprates.\nThe ground-state energy of a hole carrier in 3D polar\ncrystals can be calculated variationally in the continuum\nmodel and adiabatic approximation, taking into account\nthe short- and long-range carrier-defect-phonon interactions. The total energy of the interacting carrier-defectphonon system is given by the functional34\nZ\n~2\nψ(r)∇2 ψ(r)d3 r −\n2m∗\nZ 2\nψ (r)ψ 2 (r′ ) 3 3 ′\ne2\nd rd r −\n2ε̃\n|r − r′ |\nZ\nZ 2\nZe2\nψ (r) 3\nEd2\nd r+\nψ 4 (r)d3 r −\n2K\nε0\nr\n\u0013Z\n\u0012\nEd EdD\nV0 −\nψ 2 (r)δ(r)d3 r,\nK\n\nE{ψ(r)} = −\n\n(1)\n\nwhere ψ(r) and m∗ are the wave function and effective\nmass of a carrier, ε̃ = ε∞ /(1−η) is the effective dielectric\nconstant, η = ε∞ /ε0 , ε∞ is the high frequency dielectric\nconstant, K is an elastic constant, Ed and EdD are the\ndeformation potentials of the carrier and the defect, respectively, V0 is the short-range defect potential, Z is the\ncharge state of the defect.\nNow, we may choose the trial wave function ψ(r) in\n\n\f3\nthe Gaussian form\n\u0003\nψ(r) = N exp −(σr)2\n\u0002\n\n(2)\n\nand make a variational calculation of Eq. (1) with respect to the parameters contained in ψ(r), where\nN =\n√\n(2/π)3/4 σ 3/2 is the normalization factor, σ = πβ/a0 is\nthe variational parameter, β = a0 /a is the localization\nparameter, a is the radius of localization limited between\na0 (the lattice constant) and ∞ (free carrier). Inserting\nEq. (2) into Eq. (1) and performing the r integration in\nEq. (1), one can obtain the following functional\nE(β) = B[β 2 − g1 β 3 − g2 β],\n\n4B\n3/2\n[1 − 3g1 g2 ] .\n27g12\n\nIII. POSSIBLE TYPES OF CHARGE\nORDERING AND FORMATION OF DIFFERENT\nSUPERLATTICES\n\n(3)\n\n2\n∗ 2\n2\n3\nwhere B =\n0 B)(1 + bs ),\n\u0002 3π~ /2m a0 , g1 2 \u0003= (Ed /2Ka\n5/2\n2\nbs = 2\nEdD /Ed − KV0 /Ed , g2 = (e /ε∞ a0 B)(1 −\nη + bl η), bl = 23/2 Z.\nWhen 3g1\u0002g2 <√ 1 the functional\n(3) has a minimum\n\u0003\nat βmin = 1 − 1 − 3g1 g2 /3g1 which corresponds to\nthe formation of a large-radius impurity state or extrinsic polaronic state in the CT gap of the doped cuprates.\nA carrier interacting with lattice vibrations becomes a\nlarge polaron with a polarization (or deformation) cloud\nextending over a wide region. We can determine the\nground-state energy of such an intrinsic large polaron\nfrom Eq.(3) at bs =0 and Z = 0. At 3g1 g2 < 1 the potential barrier height separating large- and small-radius\nself-trapped states of a hole carrier is equal to34,35\n\nEa =\n\ntheir very large ratio of static to high frequency dielectric constants1,39 . This situation is favorable for carriers attracted to polarization well created by the other\nones or to Coulomb centers (dopants) to form 3D intrinsic or extrinsic large bipolarons. Such bipolarons with\nsmall binding energies can be formed in the lightly doped\ncuprates at η < 0.136 and they become unstable in the\nunderdoped regime.\n\n(4)\n\nWhile the ground-state energy of a self-trapped carrier\nis given by36\ni\nB h\n3/2\n(5)\n2\n−\n9g\ng\n−\n2(1\n−\n3g\ng\n)\nE(βmin ) =\n1\n2\n1\n2\n27g12\nThe signs of Ed and EdD for holes and small-radius\ndefects always positive, while EdD for large-radius defects is negative34 . In La2−x Srx CuO4 (LSCO) the radius of Sr2+ ions is larger than that of La3+ ions37 , so\nthat for Sr2+ ion Z = 1, EdD < 0 and bs < 0. In\nthis case, the short-range part of the impurity potential\nin Eq. (1) is repulsive and the hole-lattice interactions\nnear such dopants are suppressed by this repulsive defect potential. At a weak carrier-lattice interaction the\nlocalized impurity state may have hydrogen-like character described by a rigid lattice model38 . Therefore, in\norder to study the Mott MIT in LSCO, we can consider the hydrogenic impurity centers having the Bohr\nradius aH = 0.529ε0(me /m∗ )Å and the ionization energy\nEI = e2 /2ε0aH in the Hubbard model, where me is the\nfree electron mass. However, the substitution of smallradius cations (e.g., Ca2+ and Nd3+ ions) for La3+ ions in\nLa2 CuO4 and for Sr2+ ions in LSCO leads to the formation of the non-hydrogenic impurity centers or extrinsic\nlarge polarons for which the Hubbard model is already\ninapplicable. The distinctive feature of the cuprates is\n\nThe hole-doped cuprates are inhomogeneous or disordered systems, where the dopants and charge carriers are\ndistributed inhomogeneously. Such dopant-driven and\ncarrier-driven inhomogeneities may produce regions with\ndifferent doping levels. The electronic inhomogeneity\ncommonly exists in high-Tc cuprates regardless of doping\nlevel and the underdoped cuprates become more inhomogeneous than overdoped ones20 . Inhomogeneous distributions of carriers result from their interaction with one\nanother (e.g. phase separation) and/or from their interaction with an inhomogeneous distribution of dopants\nor micro-structural defects such as dislocations39 . One\ncan assume that the electronic disorder or inhomogeneity in the cuprates leads to the charge segregation into\ncarrier-rich and carrier-poor regions. As the doping level\nincreases towards underdoped region, specific charge ordering takes place in these regions and distinctly different superlattices and energy bands of dopants (impurities\nwith trapped free carriers or large polarons) and selftrapped carriers (intrinsic large polarons) are formed at\ntheir inhomogeneous spatial distribution. In particular,\nthe hydrogenic impurity centers (impurities with loosely\nbound free carriers or large polarons) and non-hydrogenic\nones (impurities with tightly bound large polarons) are\nassumed to form the superlattices with the lattice constant aI and coordination number z. The charge ordering in carrier-poor and carrier-rich domains results in the\nformation of simple cubic, body-centered cubic and facecentered cubic superlattices with coordination numbers\nz =6, 8 and 12, respectively. In this case the formation\nof different impurity bands in the cuprates is described\nby the tight-binding approximation and the widths of the\nimpurity bands can be determined from the relation\nWI = 2zJI ,\n2\n\n(6)\n\n/2m∗I a2I\n\nwhere JI = ~\nis the hopping integral between\nnearest-neighbour impurity centers, m∗I is the effective\nmass of charge carriers in the impurity band.\nFurther, we believe that the intrinsic large polarons\njust like impurity centers form different superlattices with\nthe lattice constant ap and the widths of the polaronic\nbands just as the widths of the small-polaron bands40 are\ndetermined from the expression\nWp = 2zJp ,\n\n(7)\n\n\f4\nwhere Jp = ~2 /2m∗p a2p is the hopping integral between\nnearest-neighbour sites of the polaronic superlattice, m∗p\nis the effective mass of large polarons.\nAt low doping level the extrinsic (or intrinsic) large\npolarons form a simple cubic superlattice with aI or\nap > 2Rp , where Rp is the radius of the polaron. The\nwidth of the impurity band decreases with increasing\ninter-dopant separation, so that the impurity-band effective mass mI increases with inter-dopant separation or\nwith decreasing doping level. Clearly, in the lightly doped\nregime the narrow impurity and/or polaronic bands are\nformed in the CT gap of the parent cuprates and the energy gaps exist between the oxygen valence band and the\nimpurity or polaronic bands. These energy gaps (or pseudogaps) disappear in sequence when the polaronic effects\ndisappear in carrier-rich and carrier-poor domains in the\noverdoped regime.\nWe now make some remarks about the confinement energy of a large polaron and the width of the large-polaron\nband in the cuprates. The large-polaron confinement energy is about ~2 /mp Rp2 39,41 . When the Fröhlich electronphonon coupling constant α is large (α ≫ 1) the effective\nmass of a large polaron is given by the formula40\nmp =\n\n16m∗ 4\nα\n81π 4\n\n(8)\n\nThe Fröhlich coupling constant α for LSCO is estimated to be α = 5.739,42 . For m∗ = me 9 , we then obtain from (8), mp ≃ 2.14me , which is close to the measured value of mp = 2me in LSCO9 . Using the Bohr\nradius of the polaron Rp = 0.529ε0(me /mp )Å ≃ 7.42Å\n(at ε0 = 30) we obtain ~2 /mp Rp2 ≃ 0.065eV , which is less\nthan Ep (see Sec. IV) and is larger than the characteristic\nphonon energies ~ω = 0.04−0.06eV in the cuprates9,23,43 .\nAs the doping level is increased to underdoped levels\nat which the insulator-to-metal transition takes place,\nthe distance between large polarons decreases and they\ncan form closely packed simple cubic superlattice with\nap = 2Rp . In this case the large-polaron bandwidth is\nabout Wp ≃ 0.1eV (i.e., Wp & Ep ). In contrast, the\nsmall-polaron band will be very narrow (Wp ≪ ~ω) since\nthe effective mass of a small polaron is much larger than\na free-electron mass.\nIV.\n\nMETAL-INSULATOR TRANSITIONS AND\nSTRIPE FORMATION\n\nNow, we discuss how the extrinsic and/or intrinsic self-trapping of carriers, the dopant- and carrierdriven charge inhomogeneities and the charge ordering\nare related to the MITs and stripe formation in holedoped cuprates. Various experiments have confirmed\nthat for light doping, La2 CuO4 behaves like a conventional semiconductor9 . As described above, large-radius\ndopants or impurities with EdD < 0 and bs < 0 may form\nthe hydrogenic acceptor centers in La-based cuprates\nand the Hubbard model based on the strong on-center\n\nCoulomb repulsion U is applicable for studying the MIT\nin these systems. Then, the Mott MIT point is determined from the condition WI = EI = 1.16U which was\nused in the derivation of the following criteria for the\n1/3\n1/3\nMott MITs19 : nc aH ≃ 0.289 (z = 6), nc aH ≃ 0.315\n1/3\n(z = 8) and nc aH ≃ 0.324 (z = 12), where nc is the\ncritical concentration of the hydrogenic impurities initiating the Mott MIT in doped systems. If we take m∗ = me\n(for free carriers) and ε0 = 30, we find aH = 15.87Å in\nLSCO. According to the above Mott criteria, the MITs\nwould occur at the dimensionless hole concentrations\nxc = nc /na ≃ 0.00115 − 0.00161, where na = 1/Va is\nthe density of the host lattice atoms, Va ≃ 190A3 is\nthe volume per CuO2 unit in the orthorhombic LSCO.\nThe above values of xc are much smaller than the value\nof xc ≃ 0.02 at which the destruction of the antiferromagnetic (AF) order is observed in LSCO9 . However,\nthe large-radius dopant and large polaron may form the\nhydrogenic impurity center in LSCO. When bs < 0 (or\nEdD < 0), the defect and the self-trapped hole repel each\nother at short distance but attract each other at long\ndistance. Therefore, the hydrogenic self-trapped state of\na large polaron in LSCO has an effective Bohr radius\naH = 0.529ε0(me /mp )Å. The existence of such hydrogenic acceptor centers in La-based cuprates is now experimentally well established9 .\nAccording to Mott and Davis38 , the Mott's criterion\nfor the MIT can be used as the condition for the metallic\nbehavior of a degenerate polaron gas if the Bohr radius\naH of polarons is larger than the interatomic distance. If\nwe take mp = 2me and ε0 = 27, we find aH ≃ 7.14Å,\nso that the above Mott criteria for the MITs can be\napplied to the cuprates. In this case the Mott transitions would occur at xc =0.0112-0.0178. The quantita1/3\ntive criteria for the Anderson MITs, nc aH ≃ 0.289 (for\n1/3\n1/3\nz=6), nc aH ≃ 0.293 (for z=8), and nc aH ≃ 0.272\n(for z=12), derived in Ref.19 predict nearly the same values of xc . We see that the Mott transition (for shallow impurity centers) would occur at a much smaller\ndopant concentration than the critical doping concentration for the MIT in the cuprates. For example, the\nMITs in LSCO are observed at more higher doping levels\nxc ≃ 0.05 − 0.072,3,10,16,25 and these experimental results\ncannot be reconciled with the above criteria for the Mott\nMITs. In our opinion, the hole carriers liberated from\nthe large-radius dopants or hydrogenic impurity centers\nat xc & 0.02 are constrained to remain away from these\nimpurities and they are self-trapped in a defect-free deformable lattice with the formation of strong-coupling\nintrinsic large polarons, which can acquire itineracy at\nhigher doping levels28 .\nAnother possibility is that small-radius dopants (e.g.,\nCa2+ and Nd3+ ) with EdD > 0 (or bs > 0) favor the formation of the extrinsic large polarons (non-hydrogenic\nimpurity centers) in La-based cuprates. In the present\ncase, both the short and long range parts of the carrierdefect interaction is attractive, so that hole carriers are\n\n\f5\nself-trapped near such dopants. Polaronic effects will be\nstronger near the small-radius dopants, leading to carrier localization over a broader range of doping. We can\nevaluate the possibility for the existence of a potential\nbarrier separating large- and small-radius intrinsic polaronic states in 3D hole-doped La-based cuprates using\nthe relation (4).\nAccording to the spectroscopic data, the Fermi energy\nof the undoped cuprates is about EF ≃ 7eV 44,45 . To determine the value of the short-range carrier-phonon coupling constant g1 , we estimate Ed as Ed = (2/3)EF . The\nvalues of other parameters are K = 1.4 * 1012 dyn/cm246 ,\nm∗ = me 9 , ε∞ = 3 − 51 , a0 ≃ 6Å (for orthorhombic\nLSCO), bs = 0 and Z = 0. Then B = 1 eV, g1 ≃ 0.0576\nand g2 ≃ 2.4(1 − η)/ε∞ . For the cuprates, typical values\nof η range from 0.02 to 0.129 . Using Eq.(4), we obtain\nEa value of ∼ 38 eV at ε∞ = 4 and η = 0.06. As already seen, the large- and small-radius polaronic states\nare separated by very high potential barrier. This barrier prevents the formation of small polarons in the 3D\ncuprates. At bs = 0.5 and Z = 1 the height of such a\npotential barrier separating large- and small-radius extrinsic polaronic states is ∼ 14 eV. It follows that the\nrelevant charge carriers in the anisotropic 3D cuprates\nare the large intrinsic and extrinsic polarons (or bipolarons). While the small polarons and bipolarons may\nbe formed in the CuO2 layers of the cuprates, where the\nself-trapping of carriers may occur more easily due to the\nabsence of the potential barrier between the large- and\nsmall-radius self-trapped states in 2D systems47,48 . However, such (bi)polarons having very large effective masses\nand narrow energy bands tend to be localized rather than\nmobile.\nSmall or large polarons may be expected in polar materials with a small or large hopping integral J between\nnearest-neighbour sites of the crystal lattice. The radius of the polaron Rp is of order a0 (2J/Ep ) and the\nformation of a polaron whose radius is large compared\nto the lattice constant a0 requires that 2J/Ep ≫ 1 (see\nalso Ref.49 ) or Wp /Ep > 150 . In hole-doped cuprates\n(LSCO, YBa2 Cu3 O7−δ and Bi2 Sr2 CaCu2 O8+δ ) large polarons have the effective masses mp ≃ (2 ÷ 4)me 9,51 .\nTherefore, WI and Wp may be comparable with the binding energies EpI and Ep of the extrinsic and intrinsic large\npolarons since mp , mI (& mp ), aI and ap would decrease\nwith increasing carrier concentration. At mI . 2me\nand mp . 2me the magnitudes of WI and Wp may become larger than EpI and Ep , which are determined from\nEq.(5) by using the above presented values of parameters. The obtained results are summarized in Table 1.\nWhen η increases, the ionization energy EpI of the nonhydrogenic impurity centers (with Z = 1) increases. On\nthe contrary, the binding energy of the intrinsic large polarons Ep decreases. Interestingly, EpI and Ep increases\nmarkedly with decreasing ε∞ from 5 to 3. We see that\nthe value of EpI =0.13 eV obtained at η=0.10 and Z=1 is\nconsistent with the experimental data for lightly doped\nLa2 CuO4+y 9 and the impurity band observed in these\n\nTABLE I: Binding energies of intrinsic and extrinsic large\npolarons for ε∞ = 4, bs = 0.5 and different values of η.\nη\n0.00\n0.02\n0.04\n0.06\n0.08\n0.10\n0.12\nEp , eV 0.0916 0.0879 0.0844 0.0809 0.0774 0.0741 0.0708\nZ=0\nEpI , eV 0.0925 0.0888 0.0851 0.0816 0.0781 0.0747 0.0714\nZ=1\nEpI , eV 0.0925 0.0995 0.1067 0.1142 0.1220 0.1301 0.1384\n\nsystems at 0.13 eV is associated with the extrinsic large\npolarons rather than the small polarons bound to impurities.\nAs we have discussed above, the extrinsic large polarons bound to dopants may also form different superlattices in inhomogeneous hole-doped cuprates and the\nenergy bands (which are formed in the lightly doped\ncuprates) of such polarons may exist, thus permitting\ncharge transport by means of intra-band conduction. In\ncase of narrow polaronic bands, charge transport becomes hopping-like and is caused by intra-band hopping\nprocesses52 . One can assume that if the bandwidth of\nthe extrinsic large polarons exceeds some critical value,\ntheir intra-band conduction becomes metal-like. We attempt to find the new criteria for such MITs in doped\nmaterials.\nWhen the carrier concentration is low, the carriers occupy low-lying bound states (i.e., extrinsic or intrinsic\npolaronic states) first. As soon as all the localized states\nwere filled at some critical carrier concentration n = nc\n(or x = xc ), the carriers start to occupy the itinerant\nstates and the transition of the system from the insulating phase to the metallic one occurs. The possible values\nof nc at which extrinsic or intrinsic large polarons forming\ndifferent superlattices acquire itineracy are determined\nfrom the appropriate criteria for the MITs. The conditions for carrier localization or delocalization can be obtained by using the uncertainty principle: ∆p∆x ≥ ~/2,\nwhere ∆p and ∆x are the uncertainties in the momentum\nand coordinate, respectively. This uncertainty relation\ncan be written as\n∆x * ∆E ≃\n\n~2 (∆k)2\n1\n*\n,\n2m∗\n2∆k\n\n(9)\n\nwhere ∆E and ∆k are the uncertainties in the energy and\nwave vector, respectively. The expression ~2 (∆k)2 /2m∗\nin Eq. (9) represents the uncertainty in the energy of\nfree carriers. Taking into account that the uncertainties\nin the energy and wave vector in the impurity band are\nabout WI and 1/aI , respectively, the relation (9) can\nbe rewritten in the form (cf. a similar relation formerly\nderived by Ridley41 using the uncertainty principle)\n∆x * ∆E ∼\n= WI aI /2\n\n(10)\n\nOn the other hand, the uncertainty in the energy ∆E\nof the localized state of carriers is of the order of EpI ,\n\n\f6\nwhereas the uncertainty in the coordinate ∆x of the extrinsic large polarons is of the order of the polaron radius\nRI . Then, the condition for the setting-in of carrier localization can be written as\nEpI RI & WI aI /2,\n\n(11)\n\nso that the new criterion for the MIT can be derived from\nthis condition and written as\nEpI\nWI\n\n= 0.5\n\naI\n,\nRI\n\n(12)\n\nwhich is similar to the results for analogous problems of Holstein localization, Mott and Anderson MITs.\nIn particular, localization in the one-dimensional Holstein molecular-crystal model is governed by the ratio\nof the local polaron binding energy to the inter-site\nbandwidth39,53 . Similarly, Anderson's localization in Anderson's disorder model is governed by the ratio of the\nlocal-site energy (or the random potential V0 ) to the electron bandwidth and Mott's MIT is governed by the ratio\nof the Hubbard on-site Coulomb interaction energy U\nto the W 38,41,52 . For intrinsic large polarons, instead of\n(12), we could write\nap\nEp\n= 0.5 .\nWp\nRp\n\n(13)\n\nWith increasing the inter-polaron distance R, the polaron band is continuously narrowed, finally ending in\nthe discrete levels (at R ≫ Rp ) of the non-interacting\npolarons. On the contrary, with decreasing R, the large\npolarons begin to interact one another through the overlap of their structural distortions and the polaronic states\nare broadened into an energy band. As long as the distance between nearest-neighbour polarons is larger than\n2Rp and the overlap of the deformation clouds of polarons\nis small, one would expect the large-polaron bands to be\nvery narrow. In this case large polarons are localized or\nconfined to their potential wells and the system is converted into an insulator. For R = 2Rp (which is assumed\nto correspond to the packing of spheres with radii equal\nto the polaron radius), the deformation clouds of large\npolarons begin to overlap strongly and the large polarons\nare delocalized and characterized by metal-like transport\nin sufficiently broadened energy bands.\nIf the extrinsic large polarons form such closely packed\nsimple cubic, body-centered cubic and face-centered\n√ cu3)RI\nbic superlattices with\na\n=\n2R\n(z\n=\n6),\na\n=\n(4/\nI\nI\nI\n√\n(z = 8) and aI = (2 2)RI (z = 12), the appropriate densities of such carriers per unit cells of the superlattices\nare n = 1/a3I , n = 2/a3I and n = 4/a3I , respectively. For\nthese cases, three successive MITs are feasible and the\nlocalized extrinsic large polarons in the cuprates start to\noccupy the itinerant states at different hole concentrations determined from relation (12). This means that\nthe system gradually changes from the insulating phase\nto the metallic one. When the extrinsic large polarons\nform simple cubic and face-centered cubic superlattices,\n\nsuch insulator-to-metal transitions occur at WI = EpI and\n√\nWI = EpI / 2, respectively. We argue that the electronic\ninhomogeneities and the ordering of polaronic carriers\nwith the formation of different superlattices can produce\nvarious types of self-organized electronic structures in the\nform of stripes. Using the relation (12), we obtain the\nfollowing criteria for the new MITs:\nnc =\n\n1\nnc = √\n2\n\nnc = 2\n\n5/4\n\nmI EpI\nz~2\n\n!3/2\n\nfor z = 6,\n\n!3/2\n√\n3mI EpI\nz~2\n\n2mI EpI\nz~2\n\n!3/2\n\n(14)\n\nfor z = 8,\n\n(15)\n\nfor z = 12.\n\n(16)\n\nWe are now in a position to evaluate nc in La-based\ncuprates using Eqs. (14), (15) and (16). The effective\nmasses of carriers in cuprates deduced from ARPES and\nelectronic specific heat data (see Ref.54 ) at different doping levels are slightly different and equal to 2.1 - 2.5 times\nthe free electron mass. Therefore, we can evaluate nc\nby taking mI = 2.5me for La2−x Cax CuO4 . Then for\nη = 0.02 and EpI = 0.10eV we find xc ≃ 0.065 − 0.080.\nWhen ε∞ = 4, η = 0.02 − 0.12 and EpI = 0.100 − 0.138\neV (see Table 1), the MITs and stripe formation occur\nin these systems at xc ≃ 0.065 − 0.131. At ε∞ = 3\nand η = 0.06 we obtain EpI ≃ 0.2eV . Then the metalinsulator boundary of La2−x Cax CuO4 lies in the overdoped regime at xc ≃ 0.226 (for z = 8).\nFurther, the double substitution of smaller cations\nfor host lattice ions and dopants may also favor the\nMITs and stripe formation occurring in a wide range\nof doping of La-based cuprates. When the doping increases, there is a significant probability of at least two\nneighbouring La2+ ions replaced by large-radius Sr2+\nSr\nion (with Z = 1, V0Sr > 0 and EdD\n< 0) and by\n3+\nsmall-radius Nd\nion (with Z = 0, V0N d > 0 and\nNd\n> 0) in La2−x−y Ndy Srx CuO4 (where y >> x).\nEdD\nThe attractive potentials of these two-dopant centers\nmay be greater than those of more separated dopants.\nFor La2−x−y Ndy Srx CuO4 with such two-dopant centers,\nwe should replace V0 and EdD by V0Sr + V0N d and\nSr\nNd\nEdD\n+ EdD\nin Eq.(1) or in the expression for bs . At\nSr\nNd\nEdD + EdD > 0 (i.e., bs > 0) the short-range part of\nthe two-dopant potential is attractive and the hole carriers are self-trapped near the two neighbouring dopants\nwith the formation of the extrinsic large polarons. The\ntwo-dopant-driven charge inhomogeneity and ordering\nlead to formation of the superlattices of such extrinsic large polarons. In order to illustrate the effects\nof anisotropy of ε∞ and the short-range defect potential on xc , we show in Fig.1 results of our calculations\n\n\f7\n0.14\n\n0.25\n\n0.12\n0.20\n\nbs =1.5\n0.10\nbs =0.1\n\n0.08\nxc\n\nxc\n\n0.15\n\n0.06\n\n0.10\n\n0.04\n0.05\n0.02\n0.00\n3.0\n\n3.5\n\n4.0\n\n4.5\n\n5.0\n\n0.00\n0.00\n\n0.02\n\n0.04\n\nΕ¥\n\n0.06\n\n0.08\n\n0.10\n\n0.12\n\nΗ\n\nFIG. 1: Critical carrier concentration xc as a function of ε∞ at\nz = 8, η = 0.06, bs = 0.1 and bs = 1.5.\n\nFIG. 2: Critical carrier concentration xc as a function of η at\n\nfor hole-doped La-based cuprates with two-dopant centers for which Z = 1 and bs > 0. Fig.1 shows that\nthe anisotropy of ε∞ and the size effect of small-radius\ndopants are the main driving forces for the new MITs\nand stripe formation in a wide range of doping (including also x = 1/8) in La-based cuprates containing two\ntypes of dopants (i.e., large- and small-radius dopants).\nIndeed, in hole-doped cuprates La2−x−y Ndy Srx CuO4 and\nLa2−x−y Euy Srx CuO4 with small-radius dopants Nd3+\nand Eu3+ , the static stripe phases are observed in a wide\nrange of carrier concentration and not restricted to a narrow range around x = 1/8 in which superconductivity is\nsuppressed16,27,55 .\nAs mentioned above, the size of impurities is also a\nkey parameter in the cuprates containing large-radius\ndopants and the formation of intrinsic large polarons in\nthese systems becomes possible at distances far from the\nimpurities. Such materials are the compounds LSCO and\nLa2−x Bax CuO4 (LBCO) in which large polarons form\ndifferent superlattices and acquire itineracy at some critical carrier concentrations nc determined from the relations (14), (15) and (16) by replacing mI and EpI by mp\nand Ep in these relations. Using the values of η = 0.02,\nε∞ = 4, mp = 2.1me and Ep ≃ 0.088eV (see Table 1)\nfor LSCO and LBCO, we find xc ≃ 0.049 (for z=6) and\nxc ≃ 0.051 (for z=8). These values of xc are in excellent agreement with the experimental value xc = 0.05 in\nLSCO10 . If we take into account a possible anisotropy\nof ε∞ = 3 − 4 and η = 0.02 − 0.10, then we obtain\nxc ≃ 0.04 − 0.125, which are also well consistent with existing experimental data on MITs and stripe formation in\nLCSO and LBCO (see Refs.10,22,26,55 ). In Fig. 2 we plot\nthe dependence of xc on η for z = 8, bs = 0.5 and ε∞ = 4.\nFig.2 shows that the value of xc increases markedly\nwith increasing η for the cuprates containing large-radius\ndopants. Our results clearly indicate that x = 1/8 is\ntruly \"magic\" or particular doping level for hole-doped\ncuprates LSCO and LBCO. In these systems, the suppression of superconductivity should be expected for x\n\nclose to 1/8. However, the doping level x = 1/8 is not\n\"magic\" doping level for the formation of stripes in other\nhole-doped cuprates, where the effects of small-radius\ndopants on MITs and static stripe formation are strong\nenough. The stripe formation driven by the MITs occurs\nin such systems not only at x = 1/8 but also at much\nmore higher doping levels. Indeed, experimental studies\non La2−x Bax−y My CuO4 (where M = Sr, Ca) show that\nthe 1/8 anomaly is reduced by substituting smaller divalent cations instead of large-radius Ba2+55 . In contrast,\nthe ordering of intrinsic large polarons is important for\nthe MITs and stripe formation in LSCO and LBCO. Double doping experiments on La2−x−y Bax Thy CuO4 indicate that superconductivity is suppressed when the hole\nconcentration p = x − y (not the individual or total\ndopant concentrations x, y and x + y) is 1/856,57 . In\nthis system, the Th4+ ion acts to compensate the negative effective charge of Ba-site, so that the hole concentration is now given by p = x − y. This means\nthat the presumed superlattice and stripe formation accompanied by the suppression of superconductivity in\nLa2−x−y Bax Thy CuO4 are associated with the ordering\nof intrinsic large polarons39 rather than dopants.\nThe formation of 3D and 2D large bipolarons is also\nexpected in the cuprates1,5,6,58–60 . Such bipolarons can\nonly exist if the Fröhlich coupling constant α is greater\nthan the critical value αc and when η is smaller than the\ncritical value ηc . For instance, for 3D and 2D systems,\nthe following critical parameters were obtained by us(3D)\ning the Gaussian type trial wave functions: αc\n≃ 5.8,\n(3D)\n(2D)\n(2D)\nηc\n≃ 0.136,59 and αc\n≃ 2.94, ηc\n≃ 0.167 (for\n(2D)\nα = 5), ηc\n≃ 0.173 (for α = 10)60 . The ratio of 3D\nbipolaron binding energy EbB to twice the polaron energy 2Ep is about EbB /2Ep ≃ 0.22 at η → 061 , whereas\nI\nthe ratio of 3D extrinsic bipolaron binding energy EbB\nI\nto twice the extrinsic polaron energy 2Ep is somewhat\nsmaller than the value of EbB /2Ep 62 . Furthermore, the\nbinding energies of 3D extrinsic and intrinsic large bipo-\n\nz = 8, bs = 0.5 and ε∞ = 4.\n\n\f8\nlarons decrease with the increase of η. Therefore, such\nbipolarons may exist at low doping levels. As the carrier concentration increases, 3D large bipolarons dissociate first into two large polarons and then these polarons acquire itineracy at a higher doping level x = xc\nwhich corresponds to the onset of the metallic behavior of the system. However, the properties of 2D large\n(bi)polarons may be quite different from those of 3D\nlarge (bi)polarons. It is clear that the binding energy and\nthe effective mass of a bipolaron would increase greatly\nwith decreasing dimensionality. In particular, the bind(2D)\ning energy of 2D large bipolarons EbB is expected to be\n(3D)\nmuch greater than EbB . The 2D polaron and bipolaron\n(2D)\n(2D)\nground-state energies Ep\nand EbB can be obtained\napproximately using the scaling relations58,63 :\nEp(2D) (α) =\n\n2 (3D)\nE\n((3π/4)α)\n3 p\n\n(17)\n\nand\n(2D)\nEB (α, U )\n(3D)\n\n2 (3D)\n= EB\n3\n\n\u0012\n\n3π 3π\nα,\nU\n4\n4\n\n\u0013\n\n,\n\n(18)\n\n(3D)\n\nwhere Ep\nand EB are the 3D polaron and bipolaron\nground-state energies, respectively, U is the strength of\nthe Coulomb repulsion between the pairing carriers.\nIn the strong coupling regime α > αc , the ground-state\nenergies of 3D large polaron and bipolaron are proportional to α259 . In this case the 2D large bipolaron binding\nenergy is given by\n\u0012 \u00132\n2 3π\n(3D)\n(3D)\n(2D)\nEbB ≃ 3.7EbB\n(19)\nEbB =\n3 4\nfrom which it follows that the bipolaron binding energy\nwill be much larger in 2D systems as compared to 3D\nones and, therefore, 2D bipolarons will be strongly localized. Such 2D large bipolarons will unlikely be dissociated in underdoped and optimally doped cuprates. According to Emin5,39,64,65 , quasi-2D large bipolarons are\nattracted to one another via the phonon-mediated interaction that fosters their condensation into a normal\nliquid. Carriers are assumed to condense into droplets\nand form a liquid prior to their condensing further into\na superconducting state39 . The concentration of such\nlarge bipolarons above which they condense into a normal liquid at a reasonable temperature is assumed to\nbe xcrit\n∼ 0.1/nbi 5,39 , where nbi is the number of unit\nbi\ncells involved in a large bipolaron. To form one bipolaron, two carriers are required from two dopants, then\nthe critical doping level is xc = 2xcrit\nbi . Envisioning a\nlarge bipolaron involving about five cells, one cell and\nits four neighbors, the critical carrier concentration for\nforming a large-bipolaron liquid is about xc ≃ 0.2/5 =\n0.045,39 . It was also suggested5,39 that in the cuprates,\nsuperconductivity occurs when the dopant density exceeds the density of a large bipolaron liquid, namely,\nat xc & 0.05, and large-bipolaron superconductivity of\n\nthe cuprates is determined by the competition between\nlarge-bipolarons' attraction for one another and their attraction to dopants. At the same time the condensation of attracting large bipolarons (including also Cooper\npairs of large polarons) into a superfluid Bose-liquid in\nthe cuprates below the superconducting transition temperature Tc was suggested in Refs.66,67 . The condensation of large bipolarons into a superfluid Bose-liquid\nat sufficiently low temperatures in the cuprates can be\nregarded as an insulator-to-superconductor transition28 .\nEmin argued5,39,64,65 that (bi)polarons in the cuprates\norder in a manner commensurate with the underlying\nlattice, thereby forming a superlattice. For the square\nstructure of CuO2 planes such a commensurate ordering\nof large bipolarons can occur at x = 1/8 and lead to the\nconversion of a cuprate superconductor to an insulator\ncomposed of ordered large bipolarons68 . Thus, the type\nof transition proposed by Emin is another possibility of\nthe metal-to-insulator (at T > Tc ) or superconductor-toinsulator (at T . Tc ) transition which is driven by the\ncommensurate ordering of quasi-2D large bipolarons and\npresumed superlattice formation. It is believed39 that\nsuch transitions are neither a Mott transition nor an Anderson transition.\n\nV.\n\nCONCLUSIONS\n\nIn this paper we have studied the carrier localization, MITs and stripe formation in inhomogeneous holedoped cuprates driven by the gross electronic inhomogeneities, charge ordering and extrinsic and/or intrinsic\nself-trapping of hole carriers. To model the real situation in cuprates, the hole carriers are presumed to exist\nin a 3D ionic continuum medium and interact with the\ndopants (or impurities) via short and long-range carrierdefect-lattice interactions and with the lattice vibrations\nvia short and long-range carrier-lattice interactions. We\nhave investigated the self-trapping of carriers near the\ndefects and away from the defects (i.e., in a defect-free\ndeformable lattice) within the continuum model and adiabatic approximation. Then, the possibility of the formation of extrinsic self-trapped states (i.e., hydrogenic\nand non-hydrogenic acceptor states) and intrinsic ones\n(large-polaronic states) in the CT gap of the cuprates is\nexamined. We think that the large-radius dopants with\nthe short-range repulsive potential can form hydrogenic\nimpurity centers in LSCO and LBCO, where the hole\ncarriers liberated from such impurity centers are selftrapped in a defect-free deformable lattice due to the\nstrong short and long-range carrier-lattice interactions.\nWhen such hydrogenic impurity centers are distributed\ninhomogeneously and ordered differently with the formation of distinctly different superlattices, the narrow\nHubbard impurity bands are formed in the CT gap of\nthe cuprates. We have analyzed the applicability of the\nnewly derived criteria for the Mott and Anderson MITs\nto the La-based cuprates. It is found that such MITs in\n\n\f9\nthe cuprates with the hydrogenic impurity centers are unlikely possible. The situation in La-based cuprates with\nsmall-radius dopants is quite different from LSCO and\nLBCO cases. In these systems, the short- and long-range\nparts of the small-radius dopant potential are attractive\nand the combined effect of the strong carrier-defect and\ncarrier-lattice interactions fosters carrier localization (or\ndefect-assisted self-trapping of carriers) and formation of\nextrinsic large polarons. We have calculated the ground\nstate energies (i.e., binding energies) of extrinsic and intrinsic large polarons in La-based cuprates. The obtained\nresults are consistent with experimental results on polaron formation in these systems.\nFurther, we have demonstrated that the driving forces\nfor carrier localization, MITs and stripe formation in\nLa-based cuprates are the extrinsic and/or intrinsic selftrapping of hole carriers, the dopant and carrier-driven\nelectronic inhomogeneities, the charge ordering and the\nanisotropy of dielectric constants. Under the certain conditions, the narrow energy bands of extrinsic and intrinsic large polarons are assumed to prelude itinerant motion of such polarons. These conditions and quantitative\ncriteria for the new MITs in inhomogeneous La-based\ncuprates are obtained by using the pertinent uncertainty\nrelation. We showed that the new MITs are accompanied by the formation of static and dynamic stripes, and\nwould occur at different critical carrier concentrations\ndepending on the ionic size of dopants (or impurities),\nthe anisotropy of dielectric constants and the type of the\nordering of extrinsic and/or intrinsic large polarons. In\nparticular, the ordering of 3D intrinsic large polarons,\nthe formation of different polaronic superlattices (z = 6\nand 8) and the anisotropy of dielectric constants favor\nthe MITs and stripe formation in the range of doping\nx = 0.04 − 0.125 in La-based cuprates with large-radius\ndopants. We argue that the x = 1/8 anomaly is characteristic of these cuprates, where the suppression of superconductivity due to the formation of static stripes should\nbe especially pronounced for the doping level x = 1/8.\nWhile the effects of the substitution of smaller cations\nfor host lattice ions or dopants (e.g., Nd3+ in LSCO),\nthe anisotropy of dielectric constants and the ordering of\nextrinsic large polarons with the formation of different\nsuperlattices (z = 6 and 8) extend the metal-insulator\n\n∗\n1\n2\n\n3\n\n4\n5\n\nElectronic address: dzhumanov@rambler.ru\nD. Emin and M.S. Hillery, Phys. Rev. B39, 6575 (1989)\nJ.Fink, N. Nücker, M.Alexander, H. Romberg, M. Knupeer, M. Merkel, P.Adelmann, R. Claessen, G. Mante,\nT.Buslaps, S.Harm,R.Manzke and M. Skibowski, Physica\nC 185-189, 45 (1991)\nM. Cieplak, S. Guha, H. Kojima, P. Lindenfeld, G. Xiao,\nJ.Q. Xiao and C.L. Chien, Physica C 185-189, 1233 (1991)\nK. Nasu, Physica C 185-189, 1595 (1991)\nD. Emin, Phys.Rev.Lett. 72, 1052 (1994); Phys.Rev. B49,\n9157 (1994); (private communication)\n\ncrossover region from the heavily underdoped (x = 0.04)\nto the overdoped (x > 0.2) regime. Our results suggest\nthat the new MITs and the formation of static stripes (in\ncarrier-poor domains) and dynamic ones (in carrier-rich\ndomains) occur in a wide range of doping (including also\nthe \"magic\" doping 1/8) in La-based cuprates containing\nsmall-radius dopants (e.g., Ca2+ and Nd3+ ions), where\nthe hole concentration x = 1/8 is not already particular doping level corresponding to the formation of static\nstripes.\nWhen 3D extrinsic and intrinsic large bipolarons are\nformed in the cuprates at η < ηc , such bipolarons will\ndissociate first into two large polarons at low carrier concentration and then these polarons become mobile or acquire itineracy at high doping levels x ≥ xc ≃ 0.05. The\nessence of the above driving forces for carrier localization,\nMITs and static stripe formation in La-based cuprates\nhas been mimicked by the theoretical predictions which\ncapture the main characteristics of experiment. Thus,\nwe have succeeded in explaining the experimental results on carrier localization, MITs and stripe formation\nin hole-doped La-based cuprates with large- and smallradius dopants in the two characteristic doping regimes\n0.05 ≤ x ≤ 0.125 and 0.05 ≤ x ≤ 0.25, respectively.\nFinally, it should be noted that carrier localization and\nmetal (or superconductor)-to-insulator transition accompanied by the 1/8 anomaly in hole-doped cuprates might\nbe also driven by the commensurate ordering of quasi-2D\n(or planar) large bipolarons which will condense into a\nliquid above some critical carrier concentration.\nACKNOWLEDGMENTS\nOver the years we have benefited through collaboration, communication and discussions on the copper-oxide\nproblem by D. Emin. We thank D. Emin for his careful\nreading of and for comments on the manuscript. Discussions with B. Yavidov and E.I. Ibragimova on aspect of\ncarrier self-trapping and metal-insulator transition phenomena are also gratefully acknowledged. This work was\nsupported by the STCU grant 3505 and the Foundation\nof the Fundamental Research of Uzbek Academy of Sciences, Grant FA-F2-F070.\n\n6\n\n7\n8\n\n9\n\n10\n\n11\n\nS. Dzhumanov, P.J. Baimatov, A.A. Baratov and P.K.\nKhabibullaev, Physica C254, 311 (1995)\nP.Quemerias, Mod.Phys.Lett. B 9, 1665 (1995)\nG.S. Boebinger, Y. Ando, A. Passner, T. Kimura, M.\nOkuya, J. Shimoyama, K. Kishio, K. Tamasaku, N.\nIchikawa and S. Uchida, Phys.Rev.Lett. 77, 5417 (1996)\nM.A. Kastner, R.J. Birgeneau, G. Shirane and Y. Endoh,\nRev.Mod.Phys. 70, 897 (1998)\nM. Imada, A. Fujimori and Y.Tokura, Rev.Mod.Phys. 70,\n1039 (1998)\nC. Castellani, C. Di Castro and M. Grilli, J.Phys.Chem.\n\n\f10\n\n12\n\n13\n14\n\n15\n16\n\n17\n\n18\n\n19\n\n20\n\n21\n\n22\n\n23\n24\n\n25\n\n26\n\n27\n\n28\n29\n\n30\n31\n\n32\n\n33\n34\n35\n\n36\n37\n\n38\n\n39\n40\n\n41\n\nSolids. 59,1694 (1998)\nA.N. Lavrov and V.F. Gandmakher, Phys. Usp. 41, 223\n(1998)\nJ. Zaanen, eprint, cond-mat/0103255\nS.A. Kivelson, I. Bindloos, E. Fradkin, V. Oganesyan, J.\nTranquada, A. Kapitulnik and C. Howard, Rev.Mod.Phys.\n75, 1201 (2003)\nA.A. Abrikosov, Physica C 460-462, 1 (2007)\nM. Hücker, G.D. Gu, J.M. Tranquada , M.V. Zimmerman,\nH.-H. Klauss, N.J. Curro, M. Braden and B. Büchner,\nPhysica C 460-462 170 (2007)\nA.J. Millis, P.B. Littlewood and B.I. Shraiman, Phys. Rev.\nLett. 74, 5144 (1995)\nW.E. Pickett and D.J. Singh, Phys.Rev. B 55, R8642\n(1997)\nS. Dzhumanov, U.T. Kurbanov and A. Kurmantayev, Int.\nJ. Mod. Phys. B21,169 (2007)\nT. Kato, T. Noguchi, R. Saito, T. Machida, and H. Sakata,\nPhysica C 460-462, 880 (2007)\nK. Omori, T. Adachi, Y. Tanabe and Y. Koike, Physica C\n460-462, 1184 (2007)\nP.A. Lee, N. Nagoasa and X.-G. Wen, Rev. Mod. Phys. 78,\n17 (2006)\nS. Sugai, Physica C 185-189, 76 (1991)\nD. Mihailovic, C.M. Foster, K. Voss and A.J. Heeger, Phys.\nRev. B42, 7989 (1990)\nZ. Konstantinovic, Z.Z. Li and H. Raffy, Physica C 351,\n163 (2001)\nS. Ono, Y. Ando, T. Murayama, F.F. Balakirev, J.B. Betts\nand G.S. Boebinger, Physica C357-360, 138 (2001)\nP.M. Singer, A.W. Hunt, A.F. Cederström and T. Imai,\nPhys. Rev. B60, 15345 (1999-II)\nS. Dzhumanov, Solid State Commun. 115, 155 (2000)\nA. Damascelli, Z. Hussian and Z.-X. Shen, Rev. Mod. Phys.\n75, 473 (2003)\nL.M. Falicov, IEEE Quantum Electronics. 35, 2358 (1989)\nH.E. Hussey and J.R. Copper, IRC Research Review 1998.\nHigh Temperature Superconductivity, edited by W.Y.\nLiang (Cambridge Univercity Press, Cambridge, 1998)\nP.52\nY. Toyozawa, Technical Report ISSP, Japan. Ser. A, N648\n(1974)\nD. Emin and Holstein, Phys. Rev. Lett. 36, 323 (1976)\nY. Toyozawa, Physica B 116, 7 (1983)\nP.K. Khabibullaev and S. Dzhumanov, Dokl. Akad. Nauk\nUSSR. 267, 1361 (1982)\nS. Dzhumanov, preprint, IC/IR/2001/17 (Trieste, Italy)\nJ.T. Markert, Y. Dalichaoch and M.B. Maple, in Physical\nProperties of High Temperature Superconductors I, edited\nby D.M. Ginsberg (Mir, Moscow, 1990) P.265\nN.F. Mott and E.A. Devis, Electronic Proceses in NonCrystaline Materials (Mir, Moskow, 1982)\nD. Emin, private communication\nJ. Appel, in Polarons, edited by Ya.A. Firsov (Nauka,\nMoscow, 1975)\nB.K. Ridley, Quantum Processes in Semiconductors (Mir,\n\n42\n\n43\n\n44\n\n45\n46\n47\n48\n\n49\n\n50\n51\n\n52\n53\n54\n\n55\n\n56\n\n57\n\n58\n\n59\n\n60\n\n61\n\n62\n\n63\n\n64\n65\n\n66\n\n67\n\n68\n\nMoscow, 1986)\nJ.P. Falck, A. Levy, M.A. Kastner and R.J. Birgeneau,\nPhys. Rev. Lett. 69 1109 (1992)\nA. Lanzara, P.V. Bogdanov, S.A. Kellar, X.J. Zhou, E.D.\nLu, G. Gu, J.-I. Shimoyama, K. Kishio, Z. Hussain and\nZ.-X. Shen, J. Phys. Chem. Solids 62, 21 (2001)\nCh. Lushchik, I. Kuusmann, E. Feldbach, F. Savikhin, I.\nBitov, J. Kolk, T. Leib, P. Liblik, A. Maaroos and I. Meriloo, Proc Inst. Phys. Acad. Sci. Est. SSR. 63, 137 (1987)\nJ.P. Lu and Q. Si, Phys. Rev. B 42, 950 (1990)\nR.C. Baetzold. Phys. Rev. B 42, 56 (1990)\nD. Emin, Adv. Phys. 22, 57 (1973)\nY. Toyozawa and Y. Shinozuka, J.Phys.Soc.Jpn. 48, 472\n(1980)\nH. Böttger and V.V. Bryksin, Hopping Conduction in\nSolids (Akademie-Verlag, Berlin, 1985)\nK. Nasu. Phys. Rev. B35, 4, P.1748-1763, 1987.\nA.V. Puchkov, D.N. Basov and T. Timusk, J. Phys.: Condens. Matter 8, 10049 (1996)\nF. Walz, J. Phys.: Condens. Matter. 14, R285 (2002)\nT. Holstein, Ann. Phys. (N.Y.) 8, 325 (1959)\nA. Ino, C. Kim, M. Nakamura, T. Yoshida, T. Mizokawa,\nA. Fujimori, Z.-X. Shen, T. Kakeshita, H. Eisaki and S.\nUchida, Phys. Rev. B65, 094504 (2002)\nSh. Sakita, F. Nakamura, T. Suzuki and T. Fujita J. Phys.\nSoc. Jon. 68, 2755 (1999)\nY. Maeno, N. Kakehi,M. Kato, Y. Tanaka and T. Fujita,\nPhysica C185-189, 909 (1991)\nY. Maeno, N. Kakehi, M. Kato and T. Fujita, Phys. Rev.\nB44, 7753 (1991)\nVerbist, F.M. Peeters and J.T. Devreese, Solid State Commun. 76, 1005 (1990); Phys. Rev. B43, 2712 (1991)\nP.J. Baimatov, D.Ch. Khuzhakulov and Kh.T. Sharipov,\nFiz. Tverd. Tela 39, 284 (1997)\nS. Dzhumanov, P.J.Baymatov, N.P. Baymatova, Sh.T. Inoyatov and O. Ahmedov, eprint, arXiv:0909.2414\nS. Dzhumanov, A.A. Baratov and S. Abboudy, Phys. Rev.\nB54, 13121 (1996-II)\nS. Dzhumanov, B. Yavidov and N.A. Makhmudov, Superlattices and Microstructures. 21, 325 (1997)\nWu Xiaoguang, F.M. Peeters and J.T.Devreese, Phys. Rev.\n31, 3420 (1985)\nD. Emin, Phys. Rev. B52, 13874 (1995-I)\nD. Emin, in Polarons and Bipolarons in High-Tc Superconductors and Related Materials, ed. E.K.H. Salje, A.S.\nAlexandrov and W.Y. Liang (Cambridge University Press,\nCambridge, 1995) P.80\nS. Dzhumanov, P.J. Baimatov, A.A. Baratov and N.I. Rahmatov, Physica C235-240, 2339 (1994)\nS. Dzhumanov and P.K. Khabibullaev Pramana - J. Phys.\n45, 385 (1995)\nD. Emin, in: Models and Methods of High-Tc Superconductivity, V. 2, edited by J.K. Srivastava and S.M. Rao\n(Nova Science Publisher, Inc., 2003), pp. 343-367\n\n\farXiv:1008.2256v1 [cond-mat.supr-con] 13 Aug 2010\n\n(Dated: November 2, 2018)\n\nAbstract\n\n1\n\n\f2\n\n\f"}