{"id": "http://arxiv.org/abs/0901.1493v1", "guidislink": true, "updated": "2009-01-12T01:55:53Z", "updated_parsed": [2009, 1, 12, 1, 55, 53, 0, 12, 0], "published": "2009-01-12T01:55:53Z", "published_parsed": [2009, 1, 12, 1, 55, 53, 0, 12, 0], "title": "Conclusions from the image analysis of the VSOP Survey", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0901.1958%2C0901.4054%2C0901.0600%2C0901.0072%2C0901.4718%2C0901.2483%2C0901.3162%2C0901.1615%2C0901.3671%2C0901.0117%2C0901.2301%2C0901.4364%2C0901.4093%2C0901.1297%2C0901.3352%2C0901.1736%2C0901.4406%2C0901.0845%2C0901.1317%2C0901.1216%2C0901.1277%2C0901.0302%2C0901.2816%2C0901.3446%2C0901.1260%2C0901.2282%2C0901.4022%2C0901.0186%2C0901.2641%2C0901.3275%2C0901.0771%2C0901.1039%2C0901.4625%2C0901.4839%2C0901.2191%2C0901.3081%2C0901.3103%2C0901.0897%2C0901.3440%2C0901.1214%2C0901.0159%2C0901.0296%2C0901.2062%2C0901.1411%2C0901.1516%2C0901.2781%2C0901.4627%2C0901.3761%2C0901.2255%2C0901.2715%2C0901.1163%2C0901.3028%2C0901.1664%2C0901.3772%2C0901.0657%2C0901.0876%2C0901.3286%2C0901.4319%2C0901.0355%2C0901.1006%2C0901.0739%2C0901.4476%2C0901.1392%2C0901.0004%2C0901.1458%2C0901.0333%2C0901.3448%2C0901.0002%2C0901.1976%2C0901.1231%2C0901.3790%2C0901.3435%2C0901.0582%2C0901.0729%2C0901.1304%2C0901.0228%2C0901.1656%2C0901.1067%2C0901.0915%2C0901.1351%2C0901.1636%2C0901.1342%2C0901.1940%2C0901.2092%2C0901.4458%2C0901.0871%2C0901.2709%2C0901.1493%2C0901.3506%2C0901.4894%2C0901.3629%2C0901.0271%2C0901.4615%2C0901.1280%2C0901.0823%2C0901.1874%2C0901.3680%2C0901.4925%2C0901.4968%2C0901.2583%2C0901.0399&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Conclusions from the image analysis of the VSOP Survey"}, "summary": "In February 1997, the Japanese radio astronomy satellite HALCA was launched\nto provide the space-bourne element for the VLBI Space Observatory Programme\n(VSOP) mission. A significant fraction of the mission time was to be dedicated\nto the VSOP Survey of bright compact Active Galactic Nuclei (AGN) at 5 GHz,\nwhich was lead by ISAS. The VSOP Survey Sources are an unbiased dataset of 294\ntargets, of which 82% were successfully observed. These are now undergoing\nstatistical analysis to tease out the characteristics of typical AGN sources.\nWe present here the summary of the imaging and conclusions we have reached.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0901.1958%2C0901.4054%2C0901.0600%2C0901.0072%2C0901.4718%2C0901.2483%2C0901.3162%2C0901.1615%2C0901.3671%2C0901.0117%2C0901.2301%2C0901.4364%2C0901.4093%2C0901.1297%2C0901.3352%2C0901.1736%2C0901.4406%2C0901.0845%2C0901.1317%2C0901.1216%2C0901.1277%2C0901.0302%2C0901.2816%2C0901.3446%2C0901.1260%2C0901.2282%2C0901.4022%2C0901.0186%2C0901.2641%2C0901.3275%2C0901.0771%2C0901.1039%2C0901.4625%2C0901.4839%2C0901.2191%2C0901.3081%2C0901.3103%2C0901.0897%2C0901.3440%2C0901.1214%2C0901.0159%2C0901.0296%2C0901.2062%2C0901.1411%2C0901.1516%2C0901.2781%2C0901.4627%2C0901.3761%2C0901.2255%2C0901.2715%2C0901.1163%2C0901.3028%2C0901.1664%2C0901.3772%2C0901.0657%2C0901.0876%2C0901.3286%2C0901.4319%2C0901.0355%2C0901.1006%2C0901.0739%2C0901.4476%2C0901.1392%2C0901.0004%2C0901.1458%2C0901.0333%2C0901.3448%2C0901.0002%2C0901.1976%2C0901.1231%2C0901.3790%2C0901.3435%2C0901.0582%2C0901.0729%2C0901.1304%2C0901.0228%2C0901.1656%2C0901.1067%2C0901.0915%2C0901.1351%2C0901.1636%2C0901.1342%2C0901.1940%2C0901.2092%2C0901.4458%2C0901.0871%2C0901.2709%2C0901.1493%2C0901.3506%2C0901.4894%2C0901.3629%2C0901.0271%2C0901.4615%2C0901.1280%2C0901.0823%2C0901.1874%2C0901.3680%2C0901.4925%2C0901.4968%2C0901.2583%2C0901.0399&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "In February 1997, the Japanese radio astronomy satellite HALCA was launched\nto provide the space-bourne element for the VLBI Space Observatory Programme\n(VSOP) mission. A significant fraction of the mission time was to be dedicated\nto the VSOP Survey of bright compact Active Galactic Nuclei (AGN) at 5 GHz,\nwhich was lead by ISAS. The VSOP Survey Sources are an unbiased dataset of 294\ntargets, of which 82% were successfully observed. These are now undergoing\nstatistical analysis to tease out the characteristics of typical AGN sources.\nWe present here the summary of the imaging and conclusions we have reached."}, "authors": ["R. Dodson", "E. Fomalont", "K. Wiik"], "author_detail": {"name": "K. Wiik"}, "author": "K. Wiik", "arxiv_comment": "Approaching Micro-Arcsecond Resolution with VSOP-2 Symposium, Dec\n  2007", "links": [{"href": "http://arxiv.org/abs/0901.1493v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0901.1493v1", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "astro-ph.GA", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "astro-ph.GA", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0901.1493v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0901.1493v1", "journal_reference": null, "doi": null, "fulltext": "**FULL TITLE**\nASP Conference Series, Vol. **VOLUME**, **YEAR OF PUBLICATION**\n**NAMES OF EDITORS**\n\narXiv:0901.1493v1 [astro-ph.GA] 12 Jan 2009\n\nConclusions from the image analysis of the VSOP Survey\nR. Dodson\nObservatório Astronomico Nacional, Madrid, Spain\nE. Fomalont\nNRAO, USA\nK. Wiik\nTuorla Obs., Finland\nVSOP Survey Working Group\n\nAbstract.\nIn February 1997, the Japanese radio astronomy satellite HALCA\nwas launched to provide the space-bourne element for the VLBI Space Observatory Programme (VSOP) mission. A significant fraction of the mission time was\nto be dedicated to the VSOP Survey of bright compact Active Galactic Nuclei\n(AGN) at 5 GHz, which was lead by ISAS. The VSOP Survey Sources are an\nunbiased dataset of 294 targets, of which 82% were successfully observed. These\nare now undergoing statistical analysis to tease out the characteristics of typical\nAGN sources. We present here the summary of the imaging and conclusions we\nhave reached.\n\n1.\n\nIntroduction\n\nThe radio astronomy satellite HALCA (Highly Advanced Laboratory for Communications and Astronomy) was launched by the Institute of Space and Astronautical Science in February 1997 to participate in Very Long Baseline Interferometry (VLBI) observations with arrays of ground radio telescopes. HALCA\nprovides the longest baselines of the VSOP, an international endeavour that has\ninvolved over 28 ground radio telescopes, five tracking stations and three correlators (Hirabayashi et al. 1998, 2000a). HALCA was placed in an orbit with\nan apogee height above the Earth's surface of 21,400 km, a perigee height of\n560 km, and an orbital period of 6.3 hours.\nDuring the seven years of HALCA's mission lifetime, most of the observing time was used for General Observing Time (GOT). The remaining observing time was devoted to a mission-led survey of active galactic nuclei at\n5 GHz: the VSOP Survey Program. The major goal of the Survey was to determine the statistical properties of the sub-milliarcsecond structure of a complete\nsample of AGNs. (Hirabayashi et al. 2000b; Fomalont et al. 2000a). Following the end of the formal international mission period in February 2002, the\n1\n\n\f2\nJapanese-dominated effort continued survey observations until October 2003,\nwhen HALCA lost its attitude control capability.\nThis paper presents the summary of the Survey imaging analysis, which\nhas been completed, and some early conclusions from the statistical analysis. Early papers in the VSOP Survey series include Scott et al. (2004) and\nDodson et al. (2008), which present the 242 images and models (P-III and PV), and Horiuchi et al. (2004) (P-IV) which presents the statistical conclusions\nbased on data in P-III. They analyzed the cumulative visibilities of those sources\nto obtain the 'typical source structure'. We repeated this with the entire sample\nof sources, and discuss the the brightness temperature properties.\n\n2.\n\nThe Observations\n\nThe VSOP mission and the 5 GHz AGN Survey are fully discussed in Hirabayashi et al.\n(1998); Fomalont et al. (2000b); Hirabayashi et al. (2000a,b). Briefly, in order\nto be included in the VSOP Survey, a source was required to have:\n• a total flux density at 5 GHz, S5 ≥ 5.0 Jy\nor\n• a total flux density at 5 GHz, S5 ≥ 0.95 Jy and\n• a spectral index α ≥ −0.45 (S ∝ ν α ) and\n• a galactic latitude |b| ≥ 10◦ .\nThe finding surveys from which sources were selected were primarily the\nGreen Bank GB6 Catalog for the northern sky (Gregory et al. 1996), and the\nParkes-MIT-NRAO (PMN) Survey (Lawrence et al. 1986; Griffith & Wright 1993)\nfor the southern sky. As this was compiled from single dish catalogues, some\nof the selected sources would not be detectable by HALCA due to insufficient\ncorrelated flux density on baselines longer than about 1000 km. Therefore,\nsources with declination > −44◦ were observed in a VLBA pre-launch survey\n(VLBApls, Fomalont et al. 2000b) and a cutoff criterion, a minimum flux density of 0.32 Jy at 140 Mλ, was established for inclusion of a source in the VSOP\nSurvey (Fomalont et al. 2000a). For sources south of −44◦ this cutoff could not\nbe determined, so all sources were included. Of the 402 sources in the complete\nsample, 294 were selected for VSOP observations, and this sample is designated\nas the VSOP Source Sample (VSS) (Hirabayashi et al. 2000b; Edwards et al.\n2002). Observations of the VSS were made between August 1997 and October\n2003. Of the VSS sample all but 29 were observed. Fig. 1 graphically presents\nthe outcomes; not observed, failed, no space fringes or sucessful.\nThe VSOP survey observations were made at 5 GHz, with two left-circularly\npolarized 16 MHz IF bandwidths, sampled with two bits (Hirabayashi et al.\n2000a). GOT observations of survey sources which were made with a similar configuration, were also included (see P-III for discussion of this). Data were\nusually correlated at either the DRAO Penticton correlator (Carlson et al. 1999)\n(54%) or the NAOJ Mitaka correlator (Shibata et al. 1998) (18%), with one nonGOT experiment processed at the Socorro correlator (Napier et al. 1994) along\nwith two dozen GOT extractions and a test experiment (a total of 28%) (see\nDodson et al. 2008, for details). After correlation, the data were sent to ISAS\nfor distribution to the Survey Reduction Team members.\n\n\f3\n3.\n\nData Reduction\n\nThe data were imported into AIPS (Greisen 1988), amplitude calibrated (with\nthe measured or expected system temperature and, if needed, the autocorrelation\nnormalised) then fringe fitted. After satisfactory delay and rate calibration, the\ndata for all spectral channels were summed to a single channel per 16 MHz subband (i.e. two) and exported to DIFMAP (Shepherd 1997) for self calibration\nand model fitting. Scripts were used as much as possible to ensure that the\nmethods were standardized.\nFor the entire VSOP survey programme, 265 of the 294 sources were observed. The observations are listed in P-III Table 1 and P-V Table 2, which\nincludes source names, experiment code, Ground Radio Telescopes, Tracking\nstations and Correlator used, time over which fringes were detected and the optical ID and redshift. Table 1 in P-V contains the entire summary of all the VSS\ntargets, whether observed or not, with contemporary values of total density flux\nat 5 GHz (where avaliable), the redshift, relevant references, best fit (or lower\nlimit) observer frame brightness temperatures of the core, detected area, and flux\ndensity on the longest baselines. For some of the observed sources, fringes to the\nspacecraft were not detected. Many of the sources were significantly resolved on\nshorter ground-only baselines, so that the lack of space fringes (RMS detection\nis typically 0.1 Jy) is consistent with the resolving structure seen on shorter\nbaselines. However, for others, ground observations suggested that the space\nbaselines (typically greater than 150 Mλ) should have been detected. These\nwere considered failures, with the reasons unknown.\n4.\n4.1.\n\nThe Results\nThe (u,v) Coverage, Visibility Amplitudes and Images\n\nThe graphical results for most of the survey sources are given in P-III Fig. 2\nand P-V Fig. 1, which shows the (u,v) coverage, the visibility amplitude versus\nprojected (u,v) distance, and the image displayed in contour form. The VSOP\ndata were able to indicate the strength and angular size of a core component,\neven if, in some cases, most of the most extended emission, shown with lowerresolution images, was resolved out in the VSOP data.\nLister et al. (2001) investigated the effect of the limited (u,v) sampling on\nthe imaging for HALCA and the VLBA, with simulations. In Lister, et al. (2000)\nthe effects on fidelity of using few ground baselines with HALCA (i.e. Survey\nobservations) was investigated by comparison of survey datasets with the complete GOT dataset from which it was drawn. The conclusions therein were that:\ndue to poor CLEAN deconvolution stability image fidelity was about 30:1 to\n100:1, that the Survey datasets would have poorer dynamic range, yet would\ngive reasonable measures of the core brightness temperatures. Hence we expect\na typical image fidelity of 20:1.\n4.2.\n\nThe Brightness Temperature distribution\n\nA histogram depicting the brightness temperature distribution in the source\nframe for the sources with known redshifts is shown in Fig. 2. Most cores\n\n\f4\nhave Tb > 1011 K, with approximately 56% of the sources having a measured\nbrightness temperature in excess of 1012 K in the source frame and 8% have\ngreater than 5 × 1012 K. The distribution presented in Kovalev et al. (2005) is\nfrom VLBA observations at 15 GHz. They find also a median value of 1012 K,\nbut the distribution towards 1013 and beyond is largely made up of lower limits,\nrather than actual measurements as we have here. We have compared the Tb\nfor the source in common with Kovalev et al. (2005) by selecting the data with\nthe closest observation dates. The Tb in the VSS tend to be higher, as expected\nsince the majority of the brightness temperatures in Kovalev et al. (2005) are\nlower limits (70% of the compared sources), with a median ratio of 2.4. Detailed\ncomparison of individual sources, in particular those with very different Tb , will\nbe presented in a future paper.\n4.3.\n\nThe Cumulative Visibility\n\nWe have repeated the analysis of Horiuchi et al. (2004) on the complete VSS\ndataset, but have yet to fully understand the differences we find. We formed\nthe cumulative visibilities from the scalar average of the amplitudes, binned by\n(u,v) radius. We include the bias correction, due to the scalar averaging. We\nwill continue to work on this.\n4.4.\n\nThe Brightness Temperatures vs IDV\n\nIDV and Tb are both measures of compactness, as is the detected core area, A.\nWe were given early access to the MASIV dataset (Lovell et al. 2003), which we\nsearched for correlations between their IDV measure (μ) and our measures; A\nand Tb . Unfortunately the errors on these values swamps any detected correlation. We will explore the use of more robust statistical analyses to attempt to\ntease out the correlations.\n\n5.\n\nVSOP Survey II\n\nFor scheduling reasons we can expect that for a considerable fraction of the\nmission lifetime there will be very limited ground radio telescope avaliability.\nIt is important to use the satellite time as profitably as possibility, therefore\nwe consider what might be the best use of such limited baselines. Two major\nproblems affected the VSS experiments; limited GRT coverage and poor amplitude calibration. Furthermore a repeat of a survey of AGN cores with Space\nbaselines at a different frequency does not have a high science return. The\nmaximum Brightness Temperature measurable depends only on the physical\nbaseline length, which is the same for VSOP-2 as it was for HALCA. Therefore\nwe propose the most suitable target for a survey would be H2 O masers. The\nautocorrelation can be used for amplitude calibration and the maser structures\nin individual channels are usually simple, which fits the constraints for the likely\nSurvey-II configuration. The obvious science target for such a minimal array\nwould be to make finely sampled observations of the proper motion of the maser\ncomponents.\n\n\f5\nSurvey\nCode a b c d e f g h i j k l m n o p q r s t 11\nu v w11\nxy z\n00\n00\n00\n11\n00\nS 5.5 Jy\nVS 01\n00 11\n11\n00 3.3\n11\n000\n111\n00\n11\nJy S 5.2 Jy\n02\n00\n11\n000\n111\n000\n111\n00\n11\n00\n11\n000\n111\n2.7 Jy S 3.3 Jy\n03\n00\n11\n000\n111\n000\n111\n00\n11\n00\n11\n2.2 Jy S 2.6 Jy\n04\n00011\n111\n00 11\n11\n00 11\n00\n00\n11\n00\n00\n11\n00\n11\nJy S 2.2 Jy\n05111\n000\n00\n000\n00\n0011\n11\n00 11\n11\n00111\n11\n00\n11\n001.9\n11\n000\n00\n11\n000\n111\n00\n11\n1.7 Jy S 1.9 Jy\n06111\n000\n111\n00\n11\n000\n111\n00\n11\n00\n11\n00\n11\n000\n111\n1.5 Jy S 1.7 Jy\n07111\n000\n000\n111\n00\n11\n00\n11\n00\n11\n00\n11\n000 1.3 Jy S 1.5 Jy\n111\n000\n000\n00\n11\n00\n08111\n000\n111\n000\n111\n000\n000\n111\n00\n11\n00\n000111\n000\n111\n0011\n11\n00\n11\n000\n111\n000111\n111\n000\n111\n000\n111\n00 11\n00\n11\n1.2 Jy S 1.3 Jy\n09111\n000 11\n111\n000 11\n111\n00011\n111\n00111\n11\n00\n000\n111\n00\n11\n000\n111\n00\n00\n11\n000\nJy S 1.2 Jy\n10 11\n00\n00\n11\n00\n11\n00\n11\n00\n11\n00\n000\n111\n00 11\n11\n00011\n111\n00\n11\n00 11\n11\n000 1.1\n111\n00\n11\n00\n00\n11\n00\n00\n1.0 Jy S 1.1 Jy\n11 11\n00 11\n11\n0011\n00 11\n00 11\n00\n00\n11\nS= 1.0 Jy\n12\n00\n000\n111\n13 11\n\n00\n11\n000\n111\n\nPaper III\n000\n111\n000\nSpace fringes, but in P−V\nPaper V111\n000No\n111\n000Failed\nNot observed111\n\n000\n111\n\nFig. 1) Graphical representation of the VSS, by source code, and the final status: reported in which paper, whether space fringes were detected, or whether\nobservations failed or were not made.\nFig. 2) The distribution of Tb in the source frame for the subset of 222 sources\nwhich also have a measured redshift. Measurements are shown with a filled bar,\nwhilst lower limits are shown with an open bar.\n6.\n\nConclusions\n\nThe imaging portion of the VSOP Survey has been completed with 242 or the\n294 sources modelfitted to measure the brightness temperature of the core. The\ndistribution of these Tb confirms the distributions previously found: about 50%\ngreater than 1012 , but less than 10% are greater than 5 × 1012 .\nReferences\nCarlson, B. R., et al., 1999, PASP, 111, 1025\nDodson, R., et al., 2008, ApJS, in press (Paper V)\nEdwards, P. G., et al., 2002, 8th Asian-Pacific Regional Meeting, Volume II 375\nFomalont, E., et al., 2000a, in Proceedings of the VSOP Symposium, January 2000, 167\nFomalont, E. B., et al., 2000b, ApJS, 131, 95\nGregory, P. C., Scott, W. K., Douglas, K., & Condon, J. J. 1996, ApJS, 103, 427\nGreisen, E. 1988, in Acquistion, Processing & Archiving of Astronomical Images, 125\nGriffith, M. R., & Wright, A. E. 1993, AJ, 105, 1066\nHirabayashi, H., et al., 1998, Science, 281, 1825 (erratum 282, 1995)\nHirabayashi, H., et al., 2000a, PASJ, 52, 6, 955\nHirabayashi, H., et al., 2000b, PASJ, 52, 6, 997 (Paper I)\nHoriuchi et al, 2004, ApJ, 616, 110 (Paper IV)\nKovalev, Y. Y. et al., 2005, AJ, 130, 2473\nLawrence, C. R., et al., 1986, ApJS, 61, 105\nLister, M. L. et al., 2000, in Proceedings of the VSOP Symposium, January 2000, 189\nLister, M. L., et al., 2001, ApJ, 554, L948\nLovell J., et al., 2003, in ASP Conf. Ser. 290, 347\nNapier, P. J., et al., 1994, IEEE Proc. 82, 658\nScott, W. K., et al., 2004, ApJS, 155, 33 (Paper III)\nShepherd, M. C. 1997, in ASP Conf. Ser. 125, 77\nShibata, K. M., et al., 1998, in ASP Conf. Ser. 144, 397\n\n\f"}