{"id": "http://arxiv.org/abs/1105.4500v2", "guidislink": true, "updated": "2011-06-28T07:34:02Z", "updated_parsed": [2011, 6, 28, 7, 34, 2, 1, 179, 0], "published": "2011-05-23T13:40:24Z", "published_parsed": [2011, 5, 23, 13, 40, 24, 0, 143, 0], "title": "Rigidity in Solids", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1105.5291%2C1105.5507%2C1105.4221%2C1105.4523%2C1105.6068%2C1105.0687%2C1105.1102%2C1105.3434%2C1105.2348%2C1105.6072%2C1105.4542%2C1105.4282%2C1105.2307%2C1105.5520%2C1105.4186%2C1105.1005%2C1105.1337%2C1105.2574%2C1105.1757%2C1105.4974%2C1105.3133%2C1105.3926%2C1105.5927%2C1105.0663%2C1105.3888%2C1105.3762%2C1105.1008%2C1105.3992%2C1105.0158%2C1105.4768%2C1105.6135%2C1105.2488%2C1105.4956%2C1105.2323%2C1105.0778%2C1105.3837%2C1105.4954%2C1105.2021%2C1105.5655%2C1105.0603%2C1105.4953%2C1105.1063%2C1105.4247%2C1105.6193%2C1105.4864%2C1105.3896%2C1105.0609%2C1105.2004%2C1105.5470%2C1105.5680%2C1105.2737%2C1105.5734%2C1105.5553%2C1105.1934%2C1105.4211%2C1105.1053%2C1105.1205%2C1105.3440%2C1105.0869%2C1105.2710%2C1105.2580%2C1105.4929%2C1105.0643%2C1105.5029%2C1105.1536%2C1105.0602%2C1105.4630%2C1105.4794%2C1105.4837%2C1105.3891%2C1105.2284%2C1105.1664%2C1105.5535%2C1105.5825%2C1105.4847%2C1105.1550%2C1105.4584%2C1105.3710%2C1105.2963%2C1105.6326%2C1105.2465%2C1105.4332%2C1105.0929%2C1105.0449%2C1105.3931%2C1105.3998%2C1105.2493%2C1105.5220%2C1105.1218%2C1105.5932%2C1105.3594%2C1105.4500%2C1105.3963%2C1105.5902%2C1105.5671%2C1105.4815%2C1105.3036%2C1105.5293%2C1105.6174%2C1105.5248%2C1105.2275&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Rigidity in Solids"}, "summary": "We address the question of whether solids may be distinguished from fluids by\ntheir response to shear stress", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1105.5291%2C1105.5507%2C1105.4221%2C1105.4523%2C1105.6068%2C1105.0687%2C1105.1102%2C1105.3434%2C1105.2348%2C1105.6072%2C1105.4542%2C1105.4282%2C1105.2307%2C1105.5520%2C1105.4186%2C1105.1005%2C1105.1337%2C1105.2574%2C1105.1757%2C1105.4974%2C1105.3133%2C1105.3926%2C1105.5927%2C1105.0663%2C1105.3888%2C1105.3762%2C1105.1008%2C1105.3992%2C1105.0158%2C1105.4768%2C1105.6135%2C1105.2488%2C1105.4956%2C1105.2323%2C1105.0778%2C1105.3837%2C1105.4954%2C1105.2021%2C1105.5655%2C1105.0603%2C1105.4953%2C1105.1063%2C1105.4247%2C1105.6193%2C1105.4864%2C1105.3896%2C1105.0609%2C1105.2004%2C1105.5470%2C1105.5680%2C1105.2737%2C1105.5734%2C1105.5553%2C1105.1934%2C1105.4211%2C1105.1053%2C1105.1205%2C1105.3440%2C1105.0869%2C1105.2710%2C1105.2580%2C1105.4929%2C1105.0643%2C1105.5029%2C1105.1536%2C1105.0602%2C1105.4630%2C1105.4794%2C1105.4837%2C1105.3891%2C1105.2284%2C1105.1664%2C1105.5535%2C1105.5825%2C1105.4847%2C1105.1550%2C1105.4584%2C1105.3710%2C1105.2963%2C1105.6326%2C1105.2465%2C1105.4332%2C1105.0929%2C1105.0449%2C1105.3931%2C1105.3998%2C1105.2493%2C1105.5220%2C1105.1218%2C1105.5932%2C1105.3594%2C1105.4500%2C1105.3963%2C1105.5902%2C1105.5671%2C1105.4815%2C1105.3036%2C1105.5293%2C1105.6174%2C1105.5248%2C1105.2275&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We address the question of whether solids may be distinguished from fluids by\ntheir response to shear stress"}, "authors": ["David Aristoff", "Charles Radin"], "author_detail": {"name": "Charles Radin"}, "author": "Charles Radin", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1007/s10955-011-0304-x", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1105.4500v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1105.4500v2", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "future versions may be obtained from\n  http://www.ma.utexas.edu/users/radin/papers.html", "arxiv_primary_category": {"term": "cond-mat.stat-mech", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cond-mat.stat-mech", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1105.4500v2", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1105.4500v2", "journal_reference": "J. Stat. Phys. 144(2011) 1247-1255", "doi": "10.1007/s10955-011-0304-x", "fulltext": "arXiv:1105.4500v2 [cond-mat.stat-mech] 28 Jun 2011\n\nRigidity in Solids\nby\nDavid Aristoff and Charles Radin *\nMathematics Department, University of Texas, Austin, TX 78712\n\nAbstract\nWe address the question of whether solids may be distinguished from fluids by their\nresponse to shear stress.\n\n* Research supported in part by NSF Grant DMS-0700120\n\n\fI. Introduction\nOur focus is the theoretical modeling, within statistical mechanics, of the\nsolid/fluid phase transition of matter in thermal equilibrium, for instance the\nice/water transition, at high pressure and temperature, and in particular the use of\nrigidity to distinguish the phases.\nThere are no analytic proofs of a solid/fluid transition in any statistical mechanics model which uses particles in space interacting through simple short range\nforces (see however [1]), though there are many simulations showing the transition,\nboth Monte Carlo and molecular dynamics. Since we concentrate on the transition at high pressure and temperature, at which short range repulsion dominates\nthe interparticle interaction, the classical hard sphere model is appropriate [2, page\n84]; again there are no proofs of a phase transition in this model, but there are\nmany simulations [2,3]. Traditionally such a transition is \"understood\" theoretically through an order parameter associated with some global (emergent) property\nof the bulk material, in particular the molecular-level crystalline symmetry which\ncan be detected experimentally in X-ray scattering [4]. This paper follows an alternative proposal of Anderson [5], namely the use of rigidity, the response to stress,\nto distinguish the phases, for instance in a hard sphere model.\nStress, both pressure and shear, will be understood here as an external influence (force per unit area) on the boundary of a finite sample of the material, with\npressure acting on the volume and shear on the shape; its extension to a uniform\nstress field inside the material is an important issue to be addressed. Pressure is\ncommonly modeled in statistical mechanics as a parameter in a pressure ensemble\nwhich controls the deformations of volume. A similar approach can be followed for\nshear stress, using a set of parameters controlling fluctuations of the shape of the\ncontainer, though this is much less common; see however [6,7].\nOne might in principle be able to model the distinction between ice and water\nthrough statistical mechanics estimates of compressibility (−[∂V /∂p]/V ), in which\nV is volume and p is pressure. Unfortunately the compressibility of ice and water\nare both high and the difference is relatively small, a common circumstance for a\nsolid/fluid transition. However the difference in the corresponding elastic shear constants is, experimentally, much greater, since elastic shear constants are negligible\nfor (isotropic) fluids. This suggests an advantage in using shear instead of pressure\nto distinguish a solid from its melt.\nBut, as emphasized for instance in the recent paper of Sausset et al [8], for a\nmaterial in equilibrium any linear response to macroscopic shear must be transient\nin time, making it harder to model an elastic shear constant within equilibrium statistical mechanics. Indeed, there are proofs that in equilibrium statistical mechanics\nthe free energy is independent of the shape of the material [9,10], which suggests\nthat shear stress be properly considered as taking a material out of equilibrium. In\n[8] solids are treated as highly viscous fluids and solids are distinguished from fluids\nby a dynamical feature, the divergence of the viscosity as the shear stress rate vanishes. Since we are using an equilibrium model we focus instead on a spatial issue,\n1\n\n\fnamely the question of whether the response to shear is localized at a small part of\nthe material or is (uniformly) distributed throughout the material. We concentrate\non the response to shear stress in the limit of zero shear, computed before any bulk\nlimit. (At zero shear stress the shape of the material is unconstrained; imagine a\ntriaxial shear cell, with negligible friction and in zero gravity.) Mathematically, we\nare taking advantage of the fact that the limit of vanishing shear need not commute\nwith the infinite volume limit.\nOur approach is based on the following idea. A configuration of hard spheres\nat high pressure must be approximately crystalline, with most particles trapped in\na cage of neighbors. A macroscopic change in container shape can be accommodated by adjustments only near the boundary, without affecting the structure in\nthe bulk interior; see Fig. 1. On the contrary a very small change of shape cannot\nbe accommodated in this way and might result in a small deformation of internal\nstructure throughout the configuration rather than just near the boundary; see Fig.\n2.\n\nB)\n\nA)\n\nFigure 1. The result of a macroscopic change of strain: the interiors of A) and B)\nare the same.\n\nA)\n\nB)\n\nFigure 2. The result of a small change of strain: the interiors of A) and B) are\ndifferent, the underlying lattice becoming distorted.\nIn other words, there may be a regime in which the response to shear is linear\nand extends throughout the material, but such a regime, measured by the angle\nof deformation, would have to vanish with the size of the system, constituting an\nequilibrium alternative to the dynamical effect discussed by Sausset et al. If indeed\n2\n\n\fthe response extends throughout the material, which is by no means evident, it\nwould be appropriate to measure it, in a finite system at constant high pressure, by\nthe rate of change in density φ with respect to shear stress f , computed at f = 0.\nWe expect this to be large in magnitude at high pressure, in the solid phase. At\nlow pressure the model should represent a fluid with negligible response, and we\npropose this difference as a means of detecting the solid/fluid phase transition.\nIn the remainder of this paper we give indirect support to the proposition\nthat for infinitesimal shear the material responds linearly throughout the finite\nsample. We do this by simulation of the two dimensional hard disk model, in\na stress (pressure and shear) ensemble. Our measurements in this model show\nan emerging resistance to shear at volume fraction about 0.7, very close to the\nknown transition(s) for hard disks. Our simulation does not show the details of\nthe transition, which are well displayed in the recent tour-de-force by Bernard and\nKrauth [11]. Instead, the point of this work is merely to illustrate the feasibility of\nusing density response to infinitesimal shear to probe a solid/fluid phase transition,\nin the tradition of Anderson [5].\nII. The Model and Simulations\nWe consider arrangements of a fixed number N of hard disks of fixed radius\nσ inside various parallelograms, with the volume and shape of the parallelograms\nallowed to vary. More precisely, we consider arrangements of such disks inside\nboundaries formed by placing disks along the edges of parallelograms at regular\nintervals as in Fig. 3. These boundary disks lie on a regular triangular lattice\nwhen the underlying parallelogram is rectangular, and all the parallelograms are\nrelated to each other via maps (on the boundary disk centers) of the form (x, y) →\n(λx + νλy, λy) for real λ, ν, with λ > 0.\nWe employ a \"stress ensemble\" which uses parameters p and f to control the\nvolume V and deformations of shape α, respectively, of the parallelograms. (We\nwant to use the Lagrange multipliers p and f to model pressure and shear stress.)\nMore precisely, we consider probability measures (states) which minimize the free\nenergy\nF (p, f ) = S − βpV + βf αV.\n(1)\n\nHere β is the inverse temperature and α is the angle of inclination of a parallelogram,\nwith α = 0 representing a rectangle (see Fig. 3). Such an ensemble has partition\nfunction\n\u0013\nZ ∞ Z ∞ \u0012Z\ndC exp(−βpV + βf αV )dV dα,\n(2)\nZp,f =\n0\nV,α\n0\nR\nwhere V,α dC represents integration over all arrangements of hard disks in a parallelogram of volume V and shape α. (Temperature plays a simple role in hard core\nmodels such as this, so we will assume that numerically β = 1 where convenient.\nAlso we are using the usual \"reduced\" ensemble in which the velocity variables have\nbeen integrated out.) By the change of coordinates\nψV,α : (x, y) → (V −1/2 (x − tan(α)y), V −1/2 y),\n3\n\n(3)\n\n\fconsidered as a function on the disk centers, the partition function may be rewritten\nas\nZ ∞Z ∞Z\n−1\nΦ(ψV,α\n(Q))V N exp(−βpV + βf αV )dQdV dα,\n(4)\nZp,f =\n0\n\n0\n\nΩ\n\nwhere Φ(C) = 1 if no two disks of radius σ with centers from C overlap, Φ(C) = 0\notherwise, and Ω ⊂ R2 is a fixed rectangular area. The probability density of an\narrangement of (nonoverlapping) hard disks in a parallelogram of volume V and\nshape α is then proportional to\nV N exp(−βpV + βf αV ).\n\n(5)\n\nBecause we are interested only in infinitesimal shear, we impose the restriction\n0 ≤ α ≤ 0.01, with α measured in radians. (For the densities and α we consider,\nthe boundary disks do not come close to overlapping.)\n\nα\n\nFigure 3. An arrangement of disks in a parallelogram. Boundary disks are in bold;\nα is the angle formed between the boundary disks and a vertical line.\nLet φp,f be the average volume fraction of arrangements at fixed p and f . To\nmeasure the volume response of arrangements of disks to an infinitesimal change in\nshape, we estimate the derivative\nΓ(p) :=\n\n∂φp,f\n∂f\n\n.\n\n(6)\n\nf =0\n\nBy definition the average volume fraction φp,f is given by\nZ ∞Z ∞Z\n−1\n(Q))(N πσ 2/V )V N exp(−βpV + βf αV )dQdV dα. (7)\nφp,f =\nΦ(ψV,α\n0\n\n0\n\nΩ\n\n4\n\n\fDifferentiating with respect to f , one obtains\n2\n\nΓ(p) = βN πσ [hαip,0 −\n\nD1E\nV\n\np,0\n\nhV αip,0 ]\n\n(8)\n\nwith h*ip,f representing an average value at fixed p and f . Applying equation (8),\nwe obtain Γ(p) from the average values of α, 1/V and V α, in our simulations at\npressure p with f = 0.\na)\n\nb)\n\n0.78\n\n0.78\n\n2\n\nβ p (2σ) = 7.40\n\n2\n\nβ p (2σ) = 8.72\n\nβ p (2σ)2 = 9.40\n\n0.77\n\n0.76\n0.76\n0.74\n\n0.75\n\nφ\n\nφ\n\n0.74\n0.72\n\n0.73\n0.72\n\n0.7\n\n0.71\n0.68\n0.7\n0.66\n\n0\n\n20\n\n40\n\n60\n\n80\n\n0.69\n\n100\n\n0\n\n20\n\n40\n\n60\n\nd)\n\n100\n\nc)\n0.012\n\n0.012\n\nβ p (2σ)2 = 7.4\n\n2\n\nβ p (2σ) = 8.72\n\n2\n\nβ p (2σ) = 9.4\n\n2\n\nβ p (2σ) = 9.4\n0.01\n\n0.01\n\n0.008\n\n0.008\n\n0.006\n\n0.006\n\nα\n\nα\n\n80\n\nt\n\nt\n\n0.004\n\n0.004\n\n0.002\n\n0.002\n\n0\n\n0\n0\n\n20\n\n40\n\n60\n\n80\n\n100\n\n0\n\n20\n\n40\n\n60\n\n80\n\n100\n\nt\n\nt\n\nFigure 4. Time series for systems of N = 10656 disks, with t in units of 3.5 × 108\nMonte Carlo steps, and at f = 0, clockwise from top left: a,b) Volume fraction φ\nvs. t; c,d) shape α vs. t.\nThe change from Γ(p) ≡ 0 to Γ(p) << 0 represents the development of rigidity\nin the system, in the sense that the system has to overcome pressure p to expand\n5\n\n\fin response to infinitesimal shear.\nOur simulations use Monte Carlo steps consisting of moves which change the\nsize and shape of the arrangements of disks, as well as so-called \"event-chain\"\nmovements of multiple disks [11]. In the former types of moves, the coordinates\nof disk centers (x, y) are mapped to (λx, λy) or (x + ρy, y), respectively. Here\nλ = (V + ηǫ)1/2 /V 1/2 and ρ = νδ, where η, ν are (independent) random variables\ndistributed uniformly in (−1, 1), and ǫ and δ are positive real parameters.\na)\n\nb)\n\n0.74\n\n0.03\n\nN=13970\n0.73\n\nN=13970\n\nN=10656\n\n0.72\n\nN=10656\n\n0.02\n\nN=7790\n\nN=7790\n\nN=5451\n\nN=5451\n\nN=3520\n\nN=3520\n\n0.01\n\nφ\n\nΓ\n\np,0\n\n0.71\n0\n\n0.7\n\n0.69\n\n−0.01\n\n0.68\n\n−0.02\n\n0.67\n−0.03\n8\n\n8.5\nβ p (2σ)2\n\nd)\n\n9\n\n8\n\n9.5\n\n8.5\n2\nβ p (2σ)\n\nc)\n\n9\n\n0.03\n\n0.35\n\nN=13970\n\nN=13970\n0.3\n\nN=10656\n\nN=10656\n\n0.02\n\nN=7790\n\nN=7790\nN=5451\n\nN=5451\nN=3520\n\nN=3520\n\n0.01\n\n0.2\nΓ\n\nmixing time\n\n0.25\n\n9.5\n\n0\n\n0.15\n−0.01\n0.1\n−0.02\n0.05\n\n0\n0.66\n\n−0.03\n0.68\n\n0.7\nφ\n\n0.72\n\n0.74\n\n0.67\n\n0.68\n\n0.69\n\n0.7\nφ\n\n0.71\n\n0.72\n\n0.73\n\n0.74\n\np,0\n\np,0\n\nFigure 5. Volume fraction data, clockwise from top left: a) Average volume fraction φp,0 vs. pressure βp(2σ)2 , with confidence intervals smaller than the data\nmarkers; b) Differential volume response Γ vs. pressure βp(2σ)2 ; c) Differential\nvolume response Γ vs. average volume fraction φp,0 ; d) Mixing time, as a fraction\nof total number of Monte Carlo steps, vs. φp,0 .\n6\n\n\fIf such a move results in overlap of disks, it is rejected. These types of moves are\n(each) attempted with frequency N −1/2 /4. In the latter type of move, employed\nrecently in [11], a non-boundary disk and a random direction are selected, with the\ndirection being up, down, left or right (that is, parallel to one of the coordinate\naxes). Additionally\na displacement L is selected uniformly at random from the\n√\ninterval (0, V − N πσ 2 /2). The particle is then moved along the chosen direction\na)\n\nb)\n0.005\n\n0.005\n\nN = 5451\n\nN = 3520\n\n−0.005\n\n−0.005\n\n−0.01\n\n−0.01\n\nΓ\n\n0\n\nΓ\n\n0\n\n−0.015\n\n−0.015\n\n−0.02\n\n−0.02\n\n−0.025\n\n−0.025\n8\n\n8.5\nβ p (2σ)2\n\n9\n\n9.5\n\n8\n\n8.5\n2\nβ p (2σ)\n\n9\n\n9.5\n\nc)\n\nd)\n0.02\n\nN = 10656\n\nN = 7790\n\n0.01\n\n0.005\n\n0.01\n\n0\n0\n\nΓ\n\nΓ\n\n−0.005\n−0.01\n\n−0.01\n\n−0.015\n\n−0.02\n\n−0.02\n−0.03\n−0.025\n−0.04\n\n8\n\n8.5\nβ p (2σ)2\n\n9\n\n−0.03\n\n9.5\n\n8\n\n8.5\nβ p (2σ)2\n\n9\n\n9.5\n\nFigure 6. Confidence intervals for differential volume response Γ vs. pressure\nβp(2σ)2 , for systems with (clockwise from top left) N = 3520, N = 5451, N = 7790,\nand N = 10656.\n\n7\n\n\funtil it strikes another particle, at which point that particle moves in the same\ndirection until it strikes another particle, and so on. The process continues until\na total displacement of L is obtained, the total displacement being the sum of the\ndisplacements of all the particles. If the process results in the displacement of a\nboundary particle, then the move is rejected. (It is in principle possible that such\nmoves result in disks moving outside the boundary, but this does not occur for the\npressures we simulate.) Such moves are attempted with frequency 1 − N −1/2 /2.\nWe investigate systems with N = 3520, N = 5451, N = 7790, N = 10656, and\nN = 13970 disks, beginning with perfectly crystalline arrangements of the disks. At\neach pressure p we run these systems to 2 × 1010 , 2.5 × 1010 , 3 × 1010 , 3.5 × 1010 , and\n4×1010 Monte Carlo steps, respectively. This results in about 2×107 displacements\nper particle, and about 107 fluctuations in volume and shape, for each p and system\nsize N . We checked that our runs were long enough for volume fraction φ and\nshape α to equilibrate, after a burn-in time of at most about 10% of the run (with\nthe exception of the shape α at large p, as discussed below); see Fig. 4. Therefore\nin our main data, shown in Fig. 5 (with confidence intervals in Fig. 6), we have\nthrown away the first 10% of each Monte Carlo run. Along with our main data we\nalso measured mixing times, defined as the number of Monte Carlo steps before the\nstandard (unbiased) autocorrelation of the time series for φp,0 first crosses zero; see\nFig. 5. Excluding the largest system (N = 13970), mixing times were no more than\n15% of our Monte Carlo runs. For 90% confidence intervals, we run 10 independent\ncopies of every simulation and use Student's t-distribution with 9 degrees of freedom\non the average values obtained from each of the 10 copies; see Fig. 6. We do not\ncompute confidence intervals for the largest system, N = 13970.\nWe find the volume response parameter Γ(p) defined in (8) exhibits the following behavior (see Fig. 5). At low pressure p or volume fraction φ = φp,0 , Γ(p)\nis approximately zero, indicating there is no volume response to an infinitesimal\nshear. We interpret this as meaning the hard disk fluid does not resist a small shear\nstress. As φ rises above 0.70, the volume response Γ begins to deviate from zero.\nOur data is not fine enough to distinguish the details of the transitions shown in\n[11], and in particular does not justify estimating specific transition values for p.\nWe note that the volume response Γ measured in our simulations tapers off to\nzero at large p (or high density). We do not expect this tapering to be accurate;\ninstead we interpret this as a sign that the simulations begin to get \"stuck\" as\ndensities increase. This is confirmed by checking that the simulations no longer\nexplore the full range of shapes α; see Fig. 4c) -d). We expect the true behavior of\nΓ, as a function of φ, to be non-increasing, indicating a volume response into the\nnonfluid phases. We conclude, then, that the hard disk solid resists a small positive\nshear stress, while the fluid does not.\nIII. Summary\nThe rigidity of solids can be modeled in various ways. We have chosen to use\nequilibrium statistical mechanics, in large extent because it is the most convincing\n8\n\n\fformalism in which to distinguish solids from fluids, which is our motivation for\nstudying rigidity, following Anderson [5]. Even within equilibrium statistical mechanics one could model response to shear more simply with a harmonic crystal\nmodel [12: Chapter 22], with long range quadratic forces between particles assigned\nneighboring equilibrium sites. In fact this is commonly used to model sound (pressure) propagation, but does not exhibit a fluid phase and therefore does not allow\ncomparison between solid and fluid phases, which is the purpose of our work.\nThe most awkward consequence of using equilibrium statistical mechanics is\nthat to obtain the sharp solid/fluid distinction one must take the infinite volume\nlimit while for infinite systems one cannot model shear stress, as noted in the introduction. Our solution to this was to model the shear in finite volume – where there\nare no well defined solid or fluid phases but the system can model shear stress –\nand measure the volume response in the limit of vanishing shear, before taking the\ninfinite volume limit.\nThe other weakness of our approach is technical: in order to measure the\nvolume response to stress we employed variation in both strain and volume, which\nis costly in simulation time compared to the usual Monte Carlo technique for the\nhard disk system, which uses fixed volume, strain and particle number. We favor\nthis ensemble for its theoretical advantages: calculating response to stress in our\nensemble is far simpler than in an ensemble which fixes, say, density and strain –\nin our ensemble we can calculate the density response directly from fluctuations,\nwhereas an equivalent analysis in the latter model would require taking a numerical\nderivative of average pressure as shear strain vanishes, with pressure computed\napproximately (perhaps from a virial expansion; see [11]). Our data, due to the\nlarge computation time associated with fluctuations in volume and strain, is not\nsufficient to demonstrate the details of the transitions, as is done in [11]. We feel\nthis is acceptable in exchange for demonstrating the feasibility of shear response as\na theoretical tool to analyze the solid/fluid transition.\nIn conclusion we note that our approach is similar to the analysis of the dilatancy transition recently found experimentally [13] in (nonequilibrium) static,\ngranular matter, and its modeling [14] with a stress ensemble. In effect we are\nproposing to model the solid/fluid transition of equilibrium matter as a dilatancy\ntransition, a sharp change between the solid and fluid equilibrium phases in their\nvolume response to (infinitesimal) shear, instead of by a change in symmetry of the\nmolecular pattern, as is the common practice.\nAcknowledgements. It is a pleasure to acknowledge useful discussions with Giulio\nBiroli, Daan Frenkel and Dan Stein.\n\n9\n\n\fBibliography\n[1] L. Bowen et al, Fluid-solid transition in a hard-core system, Phys. Rev. Lett.\n96(2006), 025701.\n[2] B. J. Alder, W. G. Hoover, Numerical statistical mechanics, in Physics of Simple Liquids, edited by H. N. V. Temperley, J. S. Rowlinson and G. S. Rushbrooke, John Wiley, New York, 1968, 79-113.\n[3] H. Löwen, Statistical Physics and Spatial Statistics: The art of analyzing spatial structures and pattern formation, ed. K. Mecke and D. Stoyan, Springer,\n2000.\n[4] J.M. Yeomans, Statistical Mechanics of Phase Transitions, Clarendon Press,\nOxford, 1992.\n[5] P. W. Anderson, Basic Notions of Condensed Matter Physics, Benjamin/Cummings,\nMenlo Park, 1984, Chapter 2.\n[6] M. Parrinello and A. Rahman, Strain fluctuations and elastic constants, J.\nChem. Phys. 76(1982), 2662.\n[7] I.R. MacDonald, NpT-ensemble Monte Carlo calculations for binary liquid mixtures, Molecular Physics Vol 100(2002), 95.\n[8] F. Sausset, G. Biroli and J. Kurchan, Do solids flow?, J. Stat. Phys. 140(2010),\n718-727.\n[9] J. Lebowitz, Statistical mechanics – a review of selected rigorous results, Ann.\nRev. Phys. Chem. 19(1968) 389-418.\n[10] D. Ruelle, Statistical Mechanics; Rigorous Results, Benjamin, New York, 1969.\n[11] E.P. Bernard and W. Krauth, First-order liquid-hexatic phase transition in\nhard disks, arXiv:1102.4094.\n[12] N.W. Ashcroft and N.D. Mermin, Solid State Physics, Saunders College, Philadelphia, 1976.\n[13] J.-F. Métayer et al, Shearing of frictional sphere packings, EPL 93(2011), 64003.\n[14] D. Aristoff and C. Radin, Dilatancy transition in a granular model, J. Stat.\nPhys. 143(2011), 215-225.\n\n10\n\n\f"}