{"id": "http://arxiv.org/abs/0708.3418v1", "guidislink": true, "updated": "2007-08-25T03:18:10Z", "updated_parsed": [2007, 8, 25, 3, 18, 10, 5, 237, 0], "published": "2007-08-25T03:18:10Z", "published_parsed": [2007, 8, 25, 3, 18, 10, 5, 237, 0], "title": "Quiver coefficients of Dynkin type", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0708.3558%2C0708.1281%2C0708.2384%2C0708.2426%2C0708.1428%2C0708.4154%2C0708.3429%2C0708.0016%2C0708.2510%2C0708.1956%2C0708.2315%2C0708.2020%2C0708.0457%2C0708.0518%2C0708.2729%2C0708.3919%2C0708.1971%2C0708.2648%2C0708.3418%2C0708.0313%2C0708.3599%2C0708.3367%2C0708.2371%2C0708.3904%2C0708.2988%2C0708.1856%2C0708.1650%2C0708.2247%2C0708.2037%2C0708.1011%2C0708.2443%2C0708.3553%2C0708.1686%2C0708.3834%2C0708.2962%2C0708.2782%2C0708.1215%2C0708.3411%2C0708.1311%2C0708.3792%2C0708.0168%2C0708.0209%2C0708.4094%2C0708.2074%2C0708.0927%2C0708.1899%2C0708.2345%2C0708.3375%2C0708.1935%2C0708.0501%2C0708.0591%2C0708.1827%2C0708.2158%2C0708.0902%2C0708.0008%2C0708.2846%2C0708.0161%2C0708.2015%2C0708.2302%2C0708.1262%2C0708.2781%2C0708.1561%2C0708.0853%2C0708.1902%2C0708.2901%2C0708.0897%2C0708.0633%2C0708.1436%2C0708.2232%2C0708.0367%2C0708.3074%2C0708.3365%2C0708.4220%2C0708.1410%2C0708.2865%2C0708.4358%2C0708.2847%2C0708.0487%2C0708.1367%2C0708.1633%2C0708.2073%2C0708.2102%2C0708.0774%2C0708.3575%2C0708.1407%2C0708.2786%2C0708.2530%2C0708.3967%2C0708.1241%2C0708.3676%2C0708.2798%2C0708.3784%2C0708.3738%2C0708.0534%2C0708.1586%2C0708.1093%2C0708.0615%2C0708.2359%2C0708.0039%2C0708.3798%2C0708.1749&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Quiver coefficients of Dynkin type"}, "summary": "We study the Grothendieck classes of quiver cycles, i.e. invariant closed\nsubvarieties of the representation space of a quiver. For quivers without\noriented loops we show that the class of a quiver cycle is determined by quiver\ncoefficients, which generalize the earlier studied quiver coefficients for\nequioriented quivers of type A. We conjecture that quiver coefficients satisfy\npositivity and finiteness properties. Our main result is a formula for the\nquiver coefficients for orbit closures of Dynkin type with rational\nsingularities, which confirms the finiteness conjecture. This formula is based\non Reineke's desingularization of such orbit closures. For quivers of type A3,\nwe give positive combinatorial formulas for the quiver coefficients, which\nconfirm the full conjecture. We also interpret quiver coefficients as formulas\nfor degeneracy loci defined by quivers of vector bundle maps.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0708.3558%2C0708.1281%2C0708.2384%2C0708.2426%2C0708.1428%2C0708.4154%2C0708.3429%2C0708.0016%2C0708.2510%2C0708.1956%2C0708.2315%2C0708.2020%2C0708.0457%2C0708.0518%2C0708.2729%2C0708.3919%2C0708.1971%2C0708.2648%2C0708.3418%2C0708.0313%2C0708.3599%2C0708.3367%2C0708.2371%2C0708.3904%2C0708.2988%2C0708.1856%2C0708.1650%2C0708.2247%2C0708.2037%2C0708.1011%2C0708.2443%2C0708.3553%2C0708.1686%2C0708.3834%2C0708.2962%2C0708.2782%2C0708.1215%2C0708.3411%2C0708.1311%2C0708.3792%2C0708.0168%2C0708.0209%2C0708.4094%2C0708.2074%2C0708.0927%2C0708.1899%2C0708.2345%2C0708.3375%2C0708.1935%2C0708.0501%2C0708.0591%2C0708.1827%2C0708.2158%2C0708.0902%2C0708.0008%2C0708.2846%2C0708.0161%2C0708.2015%2C0708.2302%2C0708.1262%2C0708.2781%2C0708.1561%2C0708.0853%2C0708.1902%2C0708.2901%2C0708.0897%2C0708.0633%2C0708.1436%2C0708.2232%2C0708.0367%2C0708.3074%2C0708.3365%2C0708.4220%2C0708.1410%2C0708.2865%2C0708.4358%2C0708.2847%2C0708.0487%2C0708.1367%2C0708.1633%2C0708.2073%2C0708.2102%2C0708.0774%2C0708.3575%2C0708.1407%2C0708.2786%2C0708.2530%2C0708.3967%2C0708.1241%2C0708.3676%2C0708.2798%2C0708.3784%2C0708.3738%2C0708.0534%2C0708.1586%2C0708.1093%2C0708.0615%2C0708.2359%2C0708.0039%2C0708.3798%2C0708.1749&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We study the Grothendieck classes of quiver cycles, i.e. invariant closed\nsubvarieties of the representation space of a quiver. For quivers without\noriented loops we show that the class of a quiver cycle is determined by quiver\ncoefficients, which generalize the earlier studied quiver coefficients for\nequioriented quivers of type A. We conjecture that quiver coefficients satisfy\npositivity and finiteness properties. Our main result is a formula for the\nquiver coefficients for orbit closures of Dynkin type with rational\nsingularities, which confirms the finiteness conjecture. This formula is based\non Reineke's desingularization of such orbit closures. For quivers of type A3,\nwe give positive combinatorial formulas for the quiver coefficients, which\nconfirm the full conjecture. We also interpret quiver coefficients as formulas\nfor degeneracy loci defined by quivers of vector bundle maps."}, "authors": ["Anders Skovsted Buch"], "author_detail": {"name": "Anders Skovsted Buch"}, "author": "Anders Skovsted Buch", "links": [{"href": "http://arxiv.org/abs/0708.3418v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0708.3418v1", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "math.AG", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "math.AG", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "math.CO", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "math.RT", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "14M12, 05E15, 19E08", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0708.3418v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0708.3418v1", "arxiv_comment": null, "journal_reference": null, "doi": null, "fulltext": "arXiv:0708.3418v1 [math.AG] 25 Aug 2007\n\nQUIVER COEFFICIENTS OF DYNKIN TYPE\nANDERS SKOVSTED BUCH\n\n1. Introduction\nLet Q = (Q0 , Q1 ) be a quiver, consisting of a finite set of vertices Q0 and a\nfinite set of arrows Q1 . Each arrow a ∈ Q1 has a head h(a) and a tail t(a) in\nQ0 . For convenience we will assume that the vertex set is an integer interval,\nQ0 = {1, 2, . . . , n}. Let e = (e1 , . . . , en ) ∈ Nn be a dimension vector, and fix vector\nspaces Ei = Kei for i ∈ Q0 over a field\nL K. The representations of Q on these vector\nspaces form the affine space V =\na∈Q1 Hom(Et(a) , Eh(a) ), which has a natural\naction of the group G = GL(E1 ) × * * * × GL(En ) given by (g1 , . . . , gn ).(φa )a∈Q1 =\n−1\n(gh(a) φa gt(a)\n)a∈Q1 .\nDefine a quiver cycle to be any G-stable closed irreducible subvariety Ω in V . A\nquiver cycle determines an equivariant (Chow) cohomology class [Ω] ∈ HG∗ (V ) and\nan equivariant Grothendieck class [OΩ ] ∈ KG (V ). These classes are well understood\nwhen the quiver Q is equioriented of type A, that is, a sequence {1 → 2 → * * * → n}\nof arrows in the same direction. In this case, a formula for the cohomology class\n[Ω] was given in joint work with Fulton [11], and this formula was generalized to\nK-theory in [8]. The K-theory formula states that the Grothendieck class [OΩ ] is\ngiven by\nX\n[OΩ ] =\ncμ (Ω) Gμ1 (E2 − E1 )Gμ2 (E3 − E2 ) * * * Gμn−1 (En − En−1 ) ∈ KG (V )\nμ\n\nwhere the sum is over finitely many sequences μ = (μ1 , . . . , μn−1 ) of partitions\nμi . Each factor Gμi (Ei+1 − Ei ) is obtained by applying the stable Grothendieck\npolynomial for μi to the standard representations of G on Ei+1 and Ei . This\nnotation will be explained in section 3.\nThe coefficients cμ (Ω) are interesting geometric and combinatorial invariants\ncalled (equioriented)\nquiver coefficients. They are integers and are non-zero only\nP\nwhen the sum\n|μi | of the weights of the partitions is greater than or equal to\nthe codimension of Ω. The coefficients for which this sum equals codim(Ω) describe the cohomology class of Ω and are called cohomological quiver coefficients.\nIt was proved in [25] that cohomological quiver coefficients are non-negative, and\nin [10, 29] that the more general\nK-theoretic quiver coefficients have alternating\nP\nsigns, in the sense that (−1) |μi |−codim(Ω) cμ (Ω) is a non-negative integer. These\nproperties had earlier been conjectured in [11, 8], and special cases had been proved\nin [6, 13, 14]. The equioriented quiver coefficients can furthermore be expressed in\nterms of counting factor sequences [11, 6, 25, 10, 12]. They are known to generalize Littlewood-Richardson coefficients [11], (K-theoretic) Stanley coefficients [7, 8],\nand the monomial coefficients of Schubert and Grothendieck polynomials [13, 14].\nDate: March 17, 2007; Revised August 21, 2007.\nThe author was partially supported by NSF Grant DMS-0603822.\n1\n\n\f2\n\nANDERS SKOVSTED BUCH\n\nThe equioriented quiver coefficients are themselves special cases of the K-theoretic\nSchubert structure constants on flag manifolds [28, 10, 16].\nThe purpose of this paper is to introduce and study a more general notion of\nquiver coefficients, which can be defined for an L\narbitrary quiver Q without oriented\nloops. For each vertex i ∈ Q0 , we define Mi = a:h(a)=i Et(a) to be the direct sum\nof all vertex vector spaces at the tails of arrows pointing to i. (If there are two or\nmore arrows to i from a vertex j, then Ej is included multiple times as a summand\nof Mi .) Given a quiver cycle Ω ⊂ V , we show that there are unique coefficients\ncμ (Ω) ∈ Z, indexed by sequences μ = (μ1 , . . . , μn ) of partitions such that the length\nl(μi ) is at most ei , for which\nX\n(1)\n[OΩ ] =\ncμ (Ω) Gμ1 (E1 − M1 )Gμ2 (E2 − M2 ) * * * Gμn (En − Mn ) .\nμ\n\nP\nAs in the equioriented case, a coefficient cμ (Ω) can be non-zero only if\n|μi | ≥\ncodim(Ω), and the lowest degree coefficients describe the cohomology class [Ω].\nHowever, the defining linear combination (1) might possibly be infinite, which makes\nsense modulo the gamma filtration on KG (V ). We pose the following.\n\nConjecture 1.1. Let Q be a quiver without oriented loops and Ω ⊂ V a quiver\ncycle.\n(a) Only finitely many of the quiver coefficients cμ (Ω) for Ω are non-zero. In\nother words, the sum (1) is finite.\nP\n(b) All cohomological quiver coefficients cμ (Ω), with\n|μi | = codim(Ω), are\nnon-negative.\n(c) If Ω has rationalP singularities, then the quiver coefficients for Ω have alternating signs, i.e. (−1) |μi |−codim(Ω) cμ (Ω) ≥ 0.\nOur main result is a formula for the quiver coefficients when the quiver Q is of\nDynkin type and Ω has rational singularities. A quiver is of Dynkin type if the underlying (un-directed) graph is a simply-laced Dynkin diagram, i.e. a disjoint union\nof Dynkin diagrams of types A, D, and E. In this case, every quiver cycle is an orbit\nclosure [22]. Bobiński and Zwara have proved that all orbit closures have rational\nsingularities if Q is a quiver of type A and K is an algebraically closed field [1], or\nif Q is of type D and K is algebraically closed of characteristic zero [2] (see also [27]\nfor the equioriented case). Our formula relies on an explicit desingularization of an\norbit closure given by Reineke [31], as well as a list of geometric and combinatorial\nproperties of stable Grothendieck polynomials established in [9, 8], and it proves\nthe finiteness part (a) of Conjecture 1.1. Our new formula generalizes the formula\nfor equioriented quiver coefficients proved in [8], but requires more operations on\nGrothendieck polynomials, including multiplication and Grothendieck polynomials\nindexed by sequences of negative integers. For quivers of type A3 , we prove the\nfull statement of Conjecture 1.1, and we provide positive combinatorial formulas\nfor the quiver coefficients in terms of counting set-valued tableaux.\nWe remark that the positivity properties of quiver cycles suggested by Conjecture 1.1 are analogous to positivity properties satisfied by a closed and irreducible\nsubvariety Y of a homogeneous space G/P . In fact, the cohomology class of Y\ncan be uniquely written as a positive linear combination of Schubert classes, where\nthe coefficients count the intersection points of Y with the dual Schubert varieties\nplaced in general position. Furthermore, Brion has proved that if Y has rational\n\n\fQUIVER COEFFICIENTS OF DYNKIN TYPE\n\n3\n\nsingularities, then the Grothendieck class of Y is an alternating linear combination of K-theoretic Schubert classes [5]. Aside from this analogy, our conjecture is\nsupported by computer experiments.\nSome other formulas for quiver cycles of Dynkin type have been given, which do\nnot involve quiver coefficients. First of all, Fehér and Rimányi have proved that the\ncohomology class of an orbit closure of Dynkin type is uniquely determined, up to\na constant, by the property that its restriction to any disjoint orbit vanishes [18].\nRimányi and the author have used this result to prove a positive combinatorial formula for the cohomology class of any orbit closure for a (non-equioriented) quiver of\ntype A, which expresses this class as a sum of products of Schubert polynomials [15].\nA conjectured K-theory version furthermore expresses the Grothendieck classes of\nsuch orbit closures as alternating sums of products of Grothendieck polynomials.\nThese formulas generalize the (non-stable) component formulas for equioriented\nquivers proved by Knutson, Miller, and Shimozono in cohomology [25] and by the\nauthor in K-theory [10]. Despite the positivity displayed by the generalized component formulas, we have not been able to relate them to positivity properties of\nquiver coefficients in the non-equioriented cases. Finally, a recent preprint of Knutson and Shimozono [26] contains a formula for the Grothendieck class of any orbit\nclosure of Dynkin type which has rational singularities. This formula is stated in\nterms of Demazure operators, but does not to our knowledge suggest any positivity\nproperties of quiver cycles.\nThis paper is organized as follows. In section 2 we recall the definition and\nrequired properties of stable Grothendieck polynomials. Section 3 describes the\nequivariant Grothendieck class of a quiver cycle, defines the corresponding quiver\ncoefficients, and discusses the available evidence for Conjecture 1.1. We also give\nan example of an orbit closure for which the associated quiver coefficients do not\nhave alternating signs. This orbit closure was earlier studied by Zwara [35], who\nproved that it does not have rational singularities. In section 4 we interpret quiver\ncoefficients in terms of formulas for degeneracy loci defined by a quiver of vector\nbundles over a base variety. In section 5 we describe Reineke's desingularization of\norbit closures of Dynkin type. This desingularization is used in section 6 to prove\na combinatorial formula for quiver coefficients of Dynkin type. The last section\ncontains the proof of Conjecture 1.1 for quivers of type A3 .\nOur formula for orbit closures of Dynkin type was proved at the time the preprint\n[26] became available. We do, however, thank Allen Knutson for earlier suggesting\nthat resolutions that we used to compute quiver coefficients of types A and D might\nbe special cases of Reineke's general construction. We have benefited from many\ndiscussions with Richárd Rimányi on this general subject, and from answers to\nquestions and useful references provided by Wilbert van der Kallen and Michel\nBrion regarding group actions and equivariant K-theory. We also thank Johan de\nJong, Friedrich Knop, Chris Woodward, and Bobiński Zwara for helpful comments\nand answers to questions.\n2. Grothendieck polynomials\nIn this section we fix notation for stable Grothendieck polynomials and state the\nrequired properties. We refer to [9, 8] for more details.\nA partition is a weakly decreasing sequence of non-negative\nintegers λ = (λ1 ≥\nP\nλ2 ≥ * * * ≥ λl ≥ 0). The weight of λ is the sum |λ| =\nλi of its parts and the\n\n\f4\n\nANDERS SKOVSTED BUCH\n\nlength l(λ) is the number of non-zero parts. We will identify the partition λ with its\nYoung diagram, which has λ1 boxes in the top row, λ2 boxes in the next row, etc.\nA set-valued tableau of shape λ is a filling T of the boxes of λ with finite non-empty\nsets of positive integers, such that the largest integer in any box is smaller than\nor equal to the smallest integer in the box to the right of it, and strictly smaller\nthan the smallest integer in the box below it. Given an infinite set of commuting\nvariables x = (x1 , x2 , . . . ), we let xT denote the monomial in which the exponent\nof xi is the number of boxes of T containing i, and we let |T | be the (total) degree\nof xT . For example, the set-valued tableau\nT =\n\n1,2 2 2,5,8\n4 7,8\n\nhas shape λ = (3, 2) and gives xT = x1 x23 x4 x5 x7 x82 and |T | = 9.\nThe single stable Grothendieck polynomial for the partition λ is defined as the\nformal power series\nX\nGλ = Gλ (x) =\n(−1)|T |−|λ| xT ,\nT\n\nwhere the sum is over all set-valued tableaux T of shape λ. This power series is\nsymmetric, and its term of lowest degree is the Schur function sλ . It was proved\nin [9] to be a special case of the stable Grothendieck polynomials indexed by permutations of Fomin and Kirillov [19], which in turn were constructed as limits of\nLascoux and Schützenberger's ordinary Grothendieck polynomials. By convention,\na stable Grothendieck polynomial applied to a finite set of variables is defined by\nGλ (x1 , . . . , xp ) = Gλ (x1 , . . . , xp , 0, 0, . . . ).\nGiven a set-valued tableau T , define its word w(T ) to be the sequence of integers\nin its boxes when read one row at the time from left to right, with the rows ordered\nfrom bottom to top. Integers in the same box are arranged in increasing order. For\nexample, the tableau displayed above gives w(T ) = (4, 7, 8, 1, 2, 2, 2, 5, 8). A word\nof positive integers is called a reverse lattice word if every occurrence of an integer\ni ≥ 2 is followed by more occurrences of i − 1 than of i. The content of a word\nis the sequence ν = (ν1 , ν2 , . . . ) where νi is the number of occurrences of i in the\nword. For any partition μ = (μ1 , . . . , μl ), let u(μ) = (lμl , . . . , 2μ2 , 1μ1 ) be the word\nof the tableau of shape μ in which all boxes in row i contains the single integer\ni. We need the following generalization of the classical Littlewood-Richardson rule\nfrom [9, Thm. 5.4] (an alternative proof can be found in [12, §3.5]).\nTheorem 2.1. The product of two stable Grothendieck polynomials is given by\nX\nGλ * Gμ =\ncνλμ Gν\nν\n\nwhere the sum is over all partitions ν, and cνλμ is equal to (−1)|ν|−|λ|−|μ| times the\nnumber of set-valued tableaux T of shape λ for which the composition w(T )u(μ) is\na reverse lattice word with content ν.\nFor example, the set-valued tableaux 1 , 2 , and 1,2 correspond to the terms\n+ G − G . If a coefficient cνλμ is non-zero, then\nof the product G * G = G\n|λ| + |μ| ≤ |ν| and (the Young diagrams of) λ and μ can be contained in ν.\n\n\fQUIVER COEFFICIENTS OF DYNKIN TYPE\n\n5\n\nL\nTheorem 2.1 implies that the linear span Γ =\nZGλ of all stable Grothendieck\npolynomials is a commutative ring. The stable Grothendieck polynomials are linearly independent since the term of lowest degree in Gλ is the Schur function sλ .\nIf λ, μ, and ν are partitions such that λ and μ fit inside a rectangular partition\nR, we define\ndνλμ\n\n=\n\ncρR ν\n\nR\n, where ρ = (R + μ, λ) =\n\nμ\n\nλ\n\nis the partition obtained by attaching λ and μ to the bottom and right sides of R.\nThis constant dνλμ is independent of the choice of rectangle R, and it is non-zero\nonly if |ν| ≤ |λ|+|μ| and λ, μ ⊂ ν [9,PThm. 6.6]. These constants define a coproduct\n∆ : Γ → Γ ⊗ Γ given by ∆(Gν ) = λ,μ dνλμ Gλ ⊗ Gμ , which gives Γ a structure of\ncommutative and cocommutative bialgebra with unit and counit [9, Cor. 6.7].\nGiven an additional set of commuting variables y = (y1 , y2 , . . . ), define the double\nstable Grothendieck polynomial for the partition ν by\nX\nGν (x; y) =\ndνλμ Gλ (x) * Gμ′ (y) ,\nλ,μ\n\n′\n\nwhere μ is the conjugate partition of μ, obtained by interchanging the rows and\ncolumns of μ. These power series are separately symmetric in each set of variables\nx and y, and they satisfy the identities\n\n(2)\n\nGν (1 − a−1 , x ; 1 − a, y) = Gν (x; y)\n\nfor any indeterminate a [19], and\n(3)\n\nGν (x, z; y, w) =\n\nX\n\ndνλ,μ Gλ (x; y) Gμ (z; w)\n\nλ,μ\n\nfor arbitrary sets of variables x, y, z, and w [9, (6.1)]. Another useful identity is\nthe factorization formula [9, Cor. 6.3], which states that\n(4) GR+μ,λ (x1 , . . . , xp ; y1 , . . . , yq ) =\nGλ (0; y1 , . . . , yq ) * GR (x1 , . . . , xp ; y1 , . . . , yq ) * Gμ (x1 , . . . , xp )\nwhenever λ and μ are partitions with λ1 ≤ q and l(μ) ≤ p, and R = (q p ) is the\nrectangular partition with p rows and q columns.\nLemma 2.2. Let R be a commutative ring that is complete with respect to the ideal\nm ⊂ R, R = lim R/mi , and let y1 , . . . , yq ∈ m. Any symmetric formal power series\nf ∈ RJx1 , . . . , xp KΣp can be written uniquely as an (infinite) linear combination\nX\n(5)\nf=\nbλ Gλ (x1 , . . . , xp ; y1 , . . . , yq )\nλ\n\nwhere the sum is over all partitions λ with l(λ) ≤ p, and bλ ∈ R.\n\nProof. Write x = (x1 , . . .P\n, xp ) and y = (y1 , . . . , yq ). Set z = (z1 , . . . , zq ) where\nzi = 1 − (1 − yi )−1 = − k≥1 yik ∈ R, which is well defined because yi ∈ m. If\ny1 = * * * = yq = 0, then the lemma follows because the term of lowest degree in\nGλ (x) is the Schur polynomial sλ (x). Given an expression\nX\n(6)\nf=\nb′λ Gλ (x)\nλ\n\n\f6\n\nANDERS SKOVSTED BUCH\n\nP\nwe can define coefficients bλ ∈ R by (*) bλ = ν,μ b′ν dνλμ Gμ (z). This infinite sum\nis well defined in R because zi ∈ m and dνλμ is non-zero only when |μ| ≥ |ν| − |λ|.\nBy (2) and (3) we furthermore have\nX\nX\nX\nf=\nb′ν Gν (z, x ; y) =\nb′ν dνλμ Gμ (z) Gλ (x; y) =\nbλ Gλ (x; y) .\nν\n\nν,λ,μ\n\nλ\n\nSimilarly, given coefficients bλ ∈ R suchPthat (5) holds, we obtain coefficients b′λ ∈ R\nν\nfor which (6) holds by setting b′λ =\nν,μ bν dλμ Gμ′ (y). If f = 0 then all these\n′\ncoefficients bλ must be zero. On the other hand, the coefficients bλ can be recovered\nfrom the b′λ by (*) since for any fixed partition λ we have\n!\nX\nX X\nbσ dσντ Gτ ′ (y) dνλμ Gμ (z) =\nbσ dσλν dνμτ Gμ (z)Gτ ′ (y)\nν,μ\n\nσ,τ\n\nσ,ν,μ,τ\n\n=\n\nX\n\nbσ dσλν Gν (z; y) = bλ .\n\nσ,ν\n\nThe first equality holds because ∆ is a coproduct and the last follows from (2)\nbecause Gν (z; y) is equal to one if ν is the empty partition and is zero otherwise. \u0003\nThe stable Grothendieck polynomials given by partitions can be generalized to\nstable polynomials GI indexed by arbitrary finite sequences of integers. These can\nbe defined by the recursive identities\n(7)\n\nGI,p,q,J =\n\nq\nX\n\nk=p+1\n\nGI,q,k,J −\n\nq−1\nX\n\nGI,q−1,k,J\n\nk=p+1\n\nwhenever I and J are integer sequences and p < q are integers, as well as the\nidentity GI,p = GI for any integer sequence I and negative integer p. Thus any\nfinite integer sequence I gives a well defined element GI ∈ Γ. This notation is\nrequired in our formula for quiver coefficients of Dynkin type given in section 6.\n3. Quiver coefficients\nIn this section we define quiver coefficients and discuss their conjectured positivity properties. We start by giving an elementary construction of the Grothendieck\nclass of an invariant closed subvariety in a representation.\n3.1. Grothendieck classes. Let G be a linear algebraic group over the field K\nand let V be a rational representation of G, i.e. V is a K-vector space of finite\ndimension and the G-action is given by a map of varieties G → GL(V ). Then the\ncoordinate ring K[V ] = Sym• (V ∨ ) of polynomial functions on V has a locally finite\nlinear G-action, which in set-theoretic notation is given by (g.f )(v) = f (g −1 .v) for\ng ∈ G, f ∈ K[V ], and v ∈ V . Locally finite means that K[V ] is a union of rational\nrepresentations of G. Define a (K[V ], G)-module to be a module M over K[V ]\ntogether with a locally finite linear G-action on M which satisfies that g.(f m) =\n(g.f ) (g.m) for m ∈ M . We will say that M is finitely generated (resp. free) if\nthis is true as a K[V ]-module. If M is finitely generated, then there exists a finite\ndimensional G-stable vector subspace U ⊂ M which contains a set of generators.\nNotice that K[V ] ⊗K U has a natural structure of (K[V ], G)-module, where K[V ]\nacts on the first factor and G acts on both factors. The map K[V ] ⊗ U → M given\nby f ⊗ u 7→ f u is a surjective G-equivariant map. Since M has finite projective\n\n\fQUIVER COEFFICIENTS OF DYNKIN TYPE\n\n7\n\ndimension as a module over the polynomial ring K[V ], and all projective K[V ]modules are free, it follows that M has a finite equivariant resolution by finitely\ngenerated free (K[V ], G)-modules.\nLet Ω ⊂ V be a G-stable closed subvariety. Then the coordinate ring OΩ =\nK[V ]/I(Ω) is a finitely generated (K[V ], G)-module, so it has an equivariant resolution\n(8)\n\n0 → Fp → Fp−1 → * * * → F0 → OΩ → 0\n\nwhere Fi is a finitely generated free (K[V ], G)-module. Notice that Fi /mFi is a\nrational representation of G for each i, where m = I(0) ⊂ K[V ] is the maximal\nideal of functions vanishing at the origin of V .\nLet R(G) be the ring of virtual representations of G, i.e. formal linear combinations of irreducible rational representations. Multiplication in this ring is defined\nby tensor products. We define the G-equivariant Grothendieck class of Ω to be the\nvirtual representation\nX\n[OΩ ] =\n(−1)i [Fi /mFi ] ∈ R(G) .\ni≥0\n\nIt follows from results of Thomason [33] that this class can be identified with the\nclass of the structure sheaf of Ω in the equivariant K-theory of V , see section 4.\nL\n3.2. Classes of quiver cycles. Let V = a∈Q1 Hom(Et(a) , Eh(a) ) be the vector\nspace of representations\nof the quiver Q. Then V is a rational representation of\nQn\nthe group G = i=1 GL(Ei ). It follows that any quiver cycle Ω ⊂ V defines a\nGrothendieck class [OΩ ] ∈ R(G).\nChoose a decomposition of each vertex vector space as a sum of one dimensional\nvector spaces, Ei = Li1 ⊕ * * * ⊕ Liei , and let T ⊂ G be the maximal torus that\npreserves these decompositions. Then the virtual representations of T form the\nLaurent polynomial ring R(T) = Z[ [Lij ]±1 ]. It follows from [24, Cor. II.2.7] that\nthe restriction map R(G) → R(T) is injective, and the image must consist of\nLaurent polynomials that are simultaneously symmetric in each group of variables\n{[Li1 ], . . . , [Liei ]}. Since all such polynomials can be generated by the exterior powers\nVj\n[ Ei ] ∈ R(G), it follows that R(G) ⊂ R(T) is the subring of simultaneously\nsymmetric Laurent polynomials.\nSet xij = 1 − [Lij ]−1 for 1 ≤ i ≤ n and 1 ≤ j ≤ ei , and let ZJxij K be the ring\nof formal power series\nP in these variables. We will consider R(T) as a subring of\nZJxij K, with [Lij ] = p≥0 (xij )p . In particular, the Grothendieck class [OΩ ] can be\nregarded as a power series in ZJxij K. The T-equivariant cohomology of V can be\nidentified with the polynomial ring HT∗ (V ) = Z[xij ], and HG∗ (V ) ⊂ HT∗ (V ) is the\nsubring of simultaneously symmetric polynomials. The power series [OΩ ] ∈ ZJxij K\nhas no non-zero terms of total degree smaller than d = codim(Ω; V ), and the term\nof degree d is the cohomology class [Ω] ∈ HGd (V ), see section 4.2.\nIf U is any rational representation of G, we can write it as a direct sum of one\ndimensional T-representations, U = L1 ⊕ * * * ⊕ Lu . Given a partition ν we then\ndefine Gν (U ) = Gν (1 − [L1 ]−1 , . . . , 1 − [Lu ]−1 ) ∈ R(G) ⊂ R(T). For example,\nGν (Ei ) = Gν (xi1 , . . . , xiei ). More generally, given two rational G-representations U1\n\n\f8\n\nANDERS SKOVSTED BUCH\n\nand U2 we define\nGν (U1 − U2 ) =\n\n(9)\n\nX\n\ndνλμ Gλ (U1 ) Gμ′ (U2∨ ) ∈ R(G)\n\nλ,μ\n\nU2∨\n\nwhere\nis the dual representation of U2 . The Schur function sν (U1 − U2 ) is\ndefined as the term of total (and lowest) degree |ν| in Gν (U1 − U2 ) when considered\nas a power series in ZJxij K.\nFrom now on we assume that Q is a quiver without oriented loops. Our definition\nof quiver\nL coefficients is based on the following proposition. Recall that we set\nMi = a:h(a)=i Et(a) for i ∈ Q0 .\nProposition 3.1. Let Q be a quiver without oriented loops. Every element of R(G)\ncan be expressed uniquely as a (possibly infinite) Z-linear combination of products\nGμ1 (E1 − M1 ) Gμ2 (E2 − M2 ) * * * Gμn (En − Mn )\ngiven by partitions μ1 , . . . , μn such that l(μi ) ≤ ei for each i.\nProof. Let l ∈ Q0 be a vertex which is not the tail of any arrow in Q. Since every\nelement of R(G) ⊂ ZJxij K is symmetric in the variables xl1 , . . . , xlel , we can use\nLemma 2.2 to write it as an (infinite) linear combination of the elements Gμl (El −\nMl ) given by partitions μl with at most el rows, and with coefficients in the subring\nR = ZJxij : i 6= lK. By induction on n, applied to the quiver obtained from Q by\nremoving the vertex l and all arrows to it, it follows\nQ that each of the coefficients\n\u0003\nare unique Z-linear combinations of the products i6=l Gμi (Ei − Mi ).\nDefinition 3.2. Let Ω ⊂ V be a quiver cycle for a quiver Q without oriented\nloops. The quiver coefficients of Ω are the unique integers cμ (Ω) ∈ Z, indexed by\nsequences μ = (μ1 , . . . , μn ) of partitions μi with l(μi ) ≤ ei , such that\nX\n[OΩ ] =\ncμ (Ω) Gμ1 (E1 − M1 ) Gμ2 (E2 − M2 ) * * * Gμn (En − Mn ) ∈ R(G) .\nμ\n\nThe cohomological quiver coefficients of Ω are the coefficients cμ (Ω) for which\nP\n|μi | = codim(Ω).\n\nIt follows from Corollary 4.3 below that these coefficients generalize the equioriented quiver coefficients from [11, 8]. The cohomological quiver coefficients determine the cohomology class of Ω as\nX\ncμ (Ω) sμ1 (E1 − M1 ) sμ2 (E2 − M2 ) * * * sμn (En − Mn ) ∈ HG∗ (V ) .\n[Ω] =\nP\n\n|μi |=codim(Ω)\n\nExample 3.3. Let Q = {1 → 2} be a quiver of type A2 . Then any quiver cycle\nin V = Hom(E1 , E2 ) has the form Ωr = {φ ∈ V | rank(φ) ≤ r}. It follows\nfrom the Thom-Porteous formula of [8, Thm. 2.3] and Corollary 4.3 that [OΩr ] =\nGR (E2 − E1 ), where R = (e1 − r)e2 −r is the rectangular partition with e2 − r rows\nand e1 − r columns. We have c(R) (Ωr ) = 1, and all other quiver coefficients of Ωr\nare zero.\n3.3. Properties of quiver coefficients. We do not know a good reason why the\nquiver coefficients should satisfy the finiteness and positivity properties stated in\nConjecture 1.1. In the case of equioriented quivers where this conjecture is known,\nthese properties are consequences of explicit formulas for quiver coefficients that are\nproved with a combination of geometric and combinatorial methods. This is also\n\n\fQUIVER COEFFICIENTS OF DYNKIN TYPE\n\n9\n\ntrue for our proof of the finiteness part (a) for quivers of Dynkin type in section 6,\nand our proof of the full conjecture for quivers of type A3 in section 7. However,\nif the full conjecture is true, then it is natural to expect that some underlying\ngeometric principle is in play.\nOne might try to express the classes of quiver cycles as linear combinations of\nother products of Grothendieck polynomials than those used in Definition 3.2, but\nmost choices do not lead to finiteness or positivity properties of the coefficients (or\nthey lead to such properties that follow from Conjecture 1.1). The one interesting\nalternative choice that we know about is to define dual quiver coefficients e\ncμ (Ω) of\na quiver cycle Ω by the identity\nX\n[OΩ ] =\ne\ncμ (Ω) Gμ1 (N1 − E1 ) Gμ2 (N2 − E2 ) * * * Gμn (Nn − En ) ,\nμ\n\nwhere the sum is over sequences μ = (μ1 ,L\n. . . , μn ) of partitions such that μi has\nat most ei columns for each i, and Ni = a:t(a)=i Eh(a) . These dual coefficients\nare nothing but the ordinary quiver coefficients for Ω when considered as a cycle\nof quiver representations on the dual vector spaces Ei∨ , for the quiver obtained\nfrom Q by reversing all arrows. This follows from the identity Gλ (U1 − U2 ) =\nGλ′ (U2∨ − U1∨ ) which holds for arbitrary rational representations U1 and U2 of G\n[9, Lemma 3.4]. We note that for an equioriented quiver Q = {1 → 2 → * * * → n},\nthe two notions of quiver coefficients also coincide without modifying the quiver.\nIn fact, an equioriented coefficient c(μ1 ,...,μn ) (Ω) is non-zero only if μ1 is the empty\npartition, in which case we have c(∅,μ2 ,...,μn ) (Ω) = e\nc(μ2 ,...,μn ,∅) (Ω). On the other\nhand, for quivers that are not equioriented, it appears to be difficult to relate the\nproperties of quiver coefficients and dual quiver coefficients of the same quiver cycle.\nFor the simplest example, the reader is invited to compare the formulas for inbound\nand outbound A3 -quivers proved in section 7.\nIt is convenient to encode the quiver coefficients for Ω as a linear combination of\ntensors,\nX\n(10)\nPΩ =\ncμ (Ω) Gμ1 ⊗ Gμ2 ⊗ * * * ⊗ Gμn .\nμ\n\nIf Conjecture 1.1 (a) is true, then this is an element of the tensor power Γ⊗n\nof the ring of stable Grothendieck polynomials Γ; otherwise PΩ lives in a completion\nP of this ring. We will use the notation that for any linear combination\nP = μ cμ Gμ1 ⊗ * * * ⊗ Gμn and classes α1 , . . . , αn ∈ R(G), we set P (α1 , . . . , αn ) =\nP\nμ cμ Gμ1 (α1 ) * * * Gμn (αn ). The definition of quiver coefficients then states that\n[OΩ ] = PΩ (E1 − M1 , . . . , En − Mn ) ∈ R(G).\nIn addition to the evidence for Conjecture 1.1 mentioned above, we have used\nMacaulay 2 [23] and other software to compute the quiver coefficients of many\nquiver cycles, including some that are not orbit closures (and not of Dynkin type).\nIn almost all cases where Macaulay 2 was able to produce a free resolution of the\ncoordinate ring of a quiver cycle, we could convert the corresponding expression for\nits Grothendieck class into a finite linear combination of products of Grothendieck\npolynomials as in Definition 3.2. In a few cases we did not succeed in this, but expect\nthat this was caused by lack of computing power. We have never encountered any\nnegative cohomological quiver coefficients; and when the general quiver coefficients\nfailed to have alternating signs, we could often show that the corresponding quiver\n\n\f10\n\nANDERS SKOVSTED BUCH\n\ncycle did not have rational singularities, for example by using Brion's theorem\ndescribed in the introduction [5].\nExample 3.4. Let Q = {1 →\n→ 2} be the Kronecker quiver and fix the dimension\nvector e = (3, 3). Let Ω ⊂ V be the closure of the orbit through the point\n\u0010h 0 0 0 i h 1 0 0 i\u0011\n100 , 000\n.\n010\n\n001\n\nZwara has shown in [35] that this orbit closure has ugly singularities, in particular\nthey are not rational. With help from Macaulay 2 [23], we have determined the\nquiver coefficients for Ω. There are finitely many of them, and they are encoded in\nthe following expression PΩ satisfying that PΩ (E1 , E2 − E1 ⊕ E1 ) = [OΩ ] :\nPΩ = 3 ⊗ G3,1 + 4 G1 ⊗ G3 + 1 ⊗ G2,2 + 2 G1 ⊗ G2,1 + 3 G2 ⊗ G2 + G2 ⊗ G1,1\n+ 2 G3 ⊗ G1 + G4 ⊗ 1\n− 3 ⊗ G3,2 − 8 G1 ⊗ G3,1 − 6 G2 ⊗ G3 − 2 G1 ⊗ G2,2 − 5 G2 ⊗ G2,1 − 4 G3 ⊗ G2\n− 2 G3 ⊗ G1,1 − 2 G4 ⊗ G1\n− 1 ⊗ G4,2 − 3 ⊗ G4,1,1 − 6 G1 ⊗ G4,1 − 3 G2 ⊗ G4 − 6 G1,1 ⊗ G4 + 4 G1 ⊗ G3,2\n+ 7 G2 ⊗ G3,1 + 2 G3 ⊗ G3 + G2 ⊗ G2,2 + 4 G3 ⊗ G2,1 + G4 ⊗ G2 + G4 ⊗ G1,1\n+ 1 ⊗ G4,3 + 5 ⊗ G4,2,1 + 10 G1 ⊗ G4,2 + 10 G1 ⊗ G4,1,1 + 14 G2 ⊗ G4,1\n+ 15 G1,1 ⊗ G4,1 + 4 G3 ⊗ G4 + 12 G2,1 ⊗ G4 − G2 ⊗ G3,2\n− 2 G3 ⊗ G3,1 − G4 ⊗ G2,1\n− 2 ⊗ G4,3,1 − 4 G1 ⊗ G4,3 − 1 ⊗ G4,2,2 − 16 G1 ⊗ G4,2,1 − 16 G2 ⊗ G4,2\n− 12 G1,1 ⊗ G4,2 − 12 G2 ⊗ G4,1,1 − 10 G1,1 ⊗ G4,1,1 − 10 G3 ⊗ G4,1\n− 29 G2,1 ⊗ G4,1 − G4 ⊗ G4 − 7 G3,1 ⊗ G4 − 3 G2,2 ⊗ G4\n+ 1 ⊗ G4,3,2 + 6 G1 ⊗ G4,3,1 + 5 G2 ⊗ G4,3 + 3 G1,1 ⊗ G4,3 + 2 G1 ⊗ G4,2,2\n+ 18 G2 ⊗ G4,2,1 + 14 G1,1 ⊗ G4,2,1 + 8 G3 ⊗ G4,2 + 22 G2,1 ⊗ G4,2\n+ 6 G3 ⊗ G4,1,1 + 18 G2,1 ⊗ G4,1,1 + 2 G4 ⊗ G4,1 + 16 G3,1 ⊗ G4,1\n+ 6 G2,2 ⊗ G4,1 + G4,1 ⊗ G4 + 3 G3,2 ⊗ G4\n− 2 G1 ⊗ G4,3,2 − 6 G2 ⊗ G4,3,1 − 4 G1,1 ⊗ G4,3,1 − 2 G3 ⊗ G4,3 − 5 G2,1 ⊗ G4,3\n− G2 ⊗ G4,2,2 − G1,1 ⊗ G4,2,2 − 8 G3 ⊗ G4,2,1 − 24 G2,1 ⊗ G4,2,1 − G4 ⊗ G4,2\n− 11 G3,1 ⊗ G4,2 − 3 G2,2 ⊗ G4,2 − G4 ⊗ G4,1,1 − 9 G3,1 ⊗ G4,1,1\n− 3 G2,2 ⊗ G4,1,1 − 2 G4,1 ⊗ G4,1 − 6 G3,2 ⊗ G4,1\n+ G2 ⊗ G4,3,2 + G1,1 ⊗ G4,3,2 + 2 G3 ⊗ G4,3,1 + 6 G2,1 ⊗ G4,3,1 + 2 G3,1 ⊗ G4,3\n+ G2,1 ⊗ G4,2,2 + G4 ⊗ G4,2,1 + 11 G3,1 ⊗ G4,2,1 + 3 G2,2 ⊗ G4,2,1\n+ G4,1 ⊗ G4,2 + 3 G3,2 ⊗ G4,2 + G4,1 ⊗ G4,1,1 + 3 G3,2 ⊗ G4,1,1\n− G2,1 ⊗ G4,3,2 − 2 G3,1 ⊗ G4,3,1 − G4,1 ⊗ G4,2,1 − 3 G3,2 ⊗ G4,2,1\nWe note that while this expression fails to have alternating signs, the signs\nare still periodic in a curious way. In fact, the terms Gλ ⊗ Gν of PΩ displayed\nabove are sorted according to the lexicographic order on the partitions, with ν\ntaking precedence over λ, which makes the periodicity readily visible. Furthermore,\nstarting from the degree 8 term, the signs of the quiver coefficients are the opposite\nof the expected. We have also observed this phenomenon for other quiver cycles\nwithout rational singularities, but have no explanation for it.\nOur calculation also shows that Ω is the cone over a subvariety of P17 with\nGrothendieck class equal to\n51 h4 − 132 h5 + 70 h6 + 144 h7 − 261 h8 + 184 h9 − 66 h10 + 12 h11 − h12\nwhere h is the class of a hyperplane. Using Brion's result [5], this gives an alternative\nproof that Ω lacks rational singularities.\n\n\fQUIVER COEFFICIENTS OF DYNKIN TYPE\n\n11\n\nFinally, if the cohomology class of Ω is expressed in the basis of products\nsμ1 (E1 ) sμ2 (E2 − E1 ), then we obtain\n[Ω] = 3s3,1 (E2 −E1 ) + s1 (E1 )s3 (E2 −E1 ) + s2,2 (E2 −E1 ) − 2s1 (E1 )s2,1 (E2 −E1 )\n− 2s1,1 (E1 )s2 (E2 −E1 ) + s1,1 (E1 )s1,1 (E2 −E1 ) + 3s1,1,1 (E1 )s1 (E2 −E1 ) .\nThis illustrates that our choice of basis is essential to the positivity conjecture. It is\nalso essential to the finiteness conjecture, since in general it requires an infinite linear\ncombination of products Gμ1 (E1 )Gμ2 (E2 − E1 ) to express a class Gλ (E2 − E1 ⊕ E1 ).\n4. Degeneracy loci\nThis section interprets quiver coefficients as formulas for degeneracy loci defined\nby quivers of vector bundles over a base variety. We start by summarizing some\nfacts about equivariant K-theory of schemes based on Thomason's paper [33].\n4.1. K-theory. Let G be an algebraic group over the field K and let X be an\nalgebraic G-scheme over K. A G-equivariant sheaf on X is a coherent OX -module\nF together with a given isomorphism I : a∗ F ∼\n= p∗2 F , where a : G × X → X is the\naction and p2 : G × X → X is the projection. This isomorphism must satisfy that\n(m × idX )∗ I = p∗23 I ◦ (idG ×a)∗ I as morphisms of sheaves on G × G × X, where\nm is the group operation on G and p23 is the projection to the last two factors of\nG × G × X. A G-equivariant vector bundle on X is a locally free G-equivariant\nsheaf of constant rank.\nThe G-equivariant K-homology of X is the Grothendieck group KG (X) generated by isomorphism classes of G-equivariant sheaves, modulo relations saying\nthat [F ] = [F ′ ] + [F ′′ ] if there exists a G-equivariant short exact sequence 0 →\nF ′ → F → F ′′ → 0. The G-equivariant K-cohomology of X is the Grothendieck\nring K G (X) of G-equivariant vector bundles. The group KG (X) is a module over\nthe ring K G (X); both the ring structure of K G (X) and its action on KG (X)\nare defined by tensor products. If X is a non-singular variety and G is a linear\nalgebraic group, then the implicit map K G (X) → KG (X) that sends an equivariant vector bundle to its sheaf of sections is an isomorphism [33, Thm. 1.8]. The\nequivariant K-theory of a point is the ring K G (point) = R(G) of virtual representations of G. Any G-equivariant map f : X → Y defines a ring homomorphism\nf ∗ : K G (Y ) → K G (X) given by pullback of vector bundles. If f is flat then it\nalso defines a pullback map f ∗ : KG (Y ) → KG (X) on Grothendieck groups. The\nsame is true\nP if f is a regular embedding, in which case the pullback is given by\nf ∗ [F ] = i≥0 (−1)i [TorYi (OX , F )]. A proper equivariant map f : X → Y defines\nP\na pushforward map f∗ : KG (X) → KG (Y ) given by f∗ [F ] = i≥0 (−1)i [Ri f∗ F ].\nThis pushforward map is a homomorphism of K G (Y )-modules by the projection\nformula. If π : E → X is (the total space of) a G-equivariant vector bundle, then\nπ ∗ : KG (X) → KG (E) is an isomorphism [33, Thm. 1.7], and we will identify\nKG (E) with KG (X) using this map. The inverse map is pullback along any equivariant section X → E. When G = {e} is the trivial group, we will use the notation\nK ◦ (X) = K {e} (X) and K◦ (X) = K{e} (X) for the ordinary K-theory groups of X.\nStable Grothendieck polynomials can be used to define K-theory classes as follows. Given a vector bundle over X which can be written as a direct sum of line\nbundles E = L1 ⊕ * * * ⊕ Lr , and a partition ν, we define\n(11)\n\n−1\n◦\nGν (E) = Gν (1 − L−1\n1 , . . . , 1 − Lr ) ∈ K (X) .\n\n\f12\n\nANDERS SKOVSTED BUCH\n\nThe symmetry of Gν implies that this class is a polynomial in the exterior powers\nof the dual bundle E ∨ , so it is well defined even when E is not a direct sum of line\nbundles. Furthermore, if X is a G-scheme and E is a G-equivariant vector bundle,\nthen (11) defines a class Gν (E) ∈ K G (X). Given two G-vector bundles E1 and E2\nwe define\nX\n(12)\nGν (E1 − E2 ) =\ndνλμ Gλ (E1 ) Gμ′ (E2∨ ) ∈ K G (X) .\nλ,μ\n\nThis extends (9). The linear map Γ → K G (X) given by Gν 7→ Gν (E1 − E2 ) is a ring\nhomomorphism. The identity (2) implies that Gν (E1 ⊕ E3 − E2 ⊕ E3 ) = Gν (E1 − E2 )\nfor any third G-vector bundle E3 . Equivalently, the stable Grothendieck polynomial\nfor ν defines P\na linear operator Gν : K G (X) → K G (X). Equation (3) implies that\nGν (α + β) = λ,μ dνλμ Gλ (α)Gμ (β) for all classes α, β ∈ K G (X).\n\n4.2. Interpretations of Grothendieck classes. Assume that G is a connected\nreductive linear algebraic group containing a K-split maximal torus T ⊂ G, i.e.\nT ∼\n= (Gm )r is defined over K. Let V be a rational representation of G and let\nΩ ⊂ V be a G-stable closed subvariety. Then the structure sheaf OΩ is a Gequivariant sheaf on V , so it defines a class [OΩ ] ∈ KG (V ). If we use the fact that\nV is an equivariant vector bundle over a point to identify KG (V ) with R(G), then\nthis class agrees with the Grothendieck class of Ω defined in Section 3.1.\nLet X be an algebraic scheme equipped with a principal G-bundle P → X, i.e.\nG acts freely on P and X equals P/G as a geometric quotient [30]. For a G-variety\nY we write YG = P ×G Y = (P × Y )/G. We will use this notation only when Y is\nequivariantly embedded as a closed subvariety of a non-singular variety, in which\ncase it follows from [17, Prop. 23] that YG is defined as a scheme. Using that the\ncategory of G-equivariant sheaves on P is equivalent to the category of coherent\nOX -modules [4, Thm. 6.1.4], it follows that VG is a vector bundle over X with\nfibers isomorphic to V [17, Lemma 1], and the closed subscheme ΩG ⊂ VG is a\ntranslated degeneracy locus, consisting of one copy of Ω in each fiber. It's structure\nsheaf defines a Grothendieck class [OΩG ] ∈ K◦ (VG ) = K◦ (X).\nMore generally, let H be a second algebraic group over K, and assume that P\nand X are H-schemes so that the map P → X is equivariant and the H-action\non P commutes with the G-action. In this case VG is an H-vector bundle over\nX, and ΩG defines an equivariant class [OΩG ] ∈ KH (VG ) = KH (X). Let φG :\nR(G) → K H (X) be the ring homomorphism defined by φG (U ) = [UG ] for any\nrational G-representation U . The following lemma interprets the Grothendieck\nclass [OΩ ] ∈ R(G) as a formula for degeneracy loci.\nProposition 4.1. The H-equivariant Grothendieck class of ΩG ⊂ VG is given by\n[OΩG ] = φG ([OΩ ]) ∈ KH (X).\nProof. A finitely generated free (K[V ], G)-module F corresponds to a G-equivariant\nvector bundle Fe = Spec(Sym• F ∨ ) over V , which in turn defines the H-equivariant\nvector bundle FeG = P ×G Fe on VG [17, Lemma 1]. This construction applied to\n(8) produces an exact sequence\n0 → (Fer )G → (Fer−1 )G → * * * → (Fe0 )G → OΩG → 0\n\nof H-equivariant coherent sheaves on VG . Let s : X → VG be the zero section.\nSince the fiber of Fei over the origin of V equals Fi /mFi , it follows that s∗ (Fei )G =\n\n\fQUIVER COEFFICIENTS OF DYNKIN TYPE\n\n(Fi /mFi )G . We conclude that\nX\nX\n[OΩG ] =\n(−1)i s∗ [(Fei )G ] =\n(−1)i [(Fi /mFi )G ] = φG ([OΩ ])\ni≥0\n\n13\n\ni≥0\n\nin KH (X), as required.\n\n\u0003\n\nWrite T = (Gm )r as a product of multiplicative groups, and define one-dimensional T -representations L1 , . . . , Lr by Li = K and (t1 , . . . , tr ).v = ti v for v ∈ Li .\n−1\n±1\nThen we have R(T ) = Z[L±1\n1 , . . . , Lr ] ⊂ ZJx1 , . . . , xr K where xi = 1 − Li . Since\nR(G) ⊂ R(T ) by [24, Cor. II.2.7], we may regard the class [OΩ ] as a power series.\nThe variety Ω ⊂ V also defines a class [Ω] in the equivariant Chow cohomology ring HT∗ (V ). If we abuse notation and write xi also for the Chern root\nc1 (Li ) ∈ HT∗ (point) = HT∗ (V ), then this ring is the polynomial ring HT∗ (V ) =\nZ[x1 , . . . , xr ] by [34, §15], and the class [Ω] coincides with the term of total degree\nd = codim(Ω; V ) in the power series [OΩ ]. To see this, we need Totaro's algebraic\u0001\nQr\napproximation of the classifying space for T [34]. Set P = i=1 L⊕d+1\nr {0}\ni\nQr\nand X = P/T = i=1 Pd . Then HTi (V ) = H i (VT ) = H i (X) for i ≤ d by [34,\nThm. 1.1] or [17, Prop. 4], where VT = P ×T V and xi ∈ HTi (V ) corresponds to a\nhyperplane class in the i-th factor of X. The cohomology class of Ω is defined by\n[Ω] := [ΩT ] ∈ H d (VT ). Let ch : K ◦ (VT ) → H ∗ (VT ) ⊗ Q be the Chern character, i.e.\nthe ring homomorphism defined formally by ch(L) = exp(c1 (L)) for any line bundle\nL on VT [20, Ex. 3.2.3]. Then we have ch(φT (xi )) = 1 − exp(−xi ), so the lowest\nterm of [OΩ ] agrees with the lowest term of ch(φT ([OΩ ])). Now Proposition 4.1\nand [20, Ex. 15.2.16] imply that ch(φT ([OΩ ])) = ch([OΩT ]) = [ΩT ] + higher terms.\nThis shows that [Ω] is the lowest term in [OΩ ], and also that [OΩ ] has no non-zero\nterms of degree smaller than codim(Ω; V ).\nWe finally prove that the Grothendieck class of Ω is uniquely determined by the\nformula it provides in ordinary K-theory.\nProposition 4.2. The equivariant Grothendieck class of Ω is the unique virtual\nrepresentation [OΩ ] ∈ R(G) for which [OΩG ] = φG ([OΩ ]) ∈ K◦ (X) for every nonsingular variety X and principal G-bundle P → X.\nProof. In view of Proposition 4.1, it is enough to show that if α 6= 0 ∈ R(G), then\nfor some principal G-bundle P → X with X non-singular we have φG (α) 6= 0 ∈\nK◦ (X).\nLet d be the degree of the lowest non-zero term of α ∈ ZJx1 , . . . , xr K. As in [17,\nLemma 9] we embed G in GL(m) for some m and let P be the set of all m × (m + d)\nmatrices of full rank. Then G acts freely on P , the quotients X = P/G and P/T\nare non-singular varieties, and since P has codimension d + 1 in the vector space\nof all m × (m + d) matrices, it follows from [34, Thm. 1.1] or [17, Prop. 4] that\nH i (P/T ) = HTi (V ) for i ≤ d. Consider the commutative diagram\nR(G)\nφG\n\n\u000f\u000f\nK ◦ (X)\n\n// R(T )\nφT\n\n\u000f\u000f\n// K ◦ (P/T )\n\nch\n\n// H ∗ (P/T ) ⊗ Q\n\nwhere the bottom-left map is pullback along P/T → P/G = X. Since the image of\nα in H d (P/T ) ⊗ Q = HTd (V ) ⊗ Q is non-zero, we conclude that φG (α) ∈ K ◦ (X) =\nK◦ (X) is non-zero as well.\n\u0003\n\n\f14\n\nANDERS SKOVSTED BUCH\n\n4.3. Degeneracy loci defined by quiver cycles. Let V and G be as in section 3.2, and let Ω ⊂ V be a quiver cycle. We will use the constructions given\nabove to interpret the quiver coefficients of Ω in terms of formulas for degeneracy loci. Let X be an algebraic scheme over K equipped with vector bundles\nE1 , . . . , EnLof ranks given by the dimension vector e = (e1 , . . . , en ). Define the bundle V = a∈Q1 Hom(Et(a) , Eh(a) ) over X. Since the fibers of V are isomorphic to\nthe representation space V , any quiver cycle Ω ⊂ V defines a translated degeneracy\ne ⊂ V. To be precise, let π : P → X be the principal G-bundle such that\nlocus Ω\nEi = (Ei )G = P ×G Ei for each i. This bundle can be constructed as a multi-frame\nbundle P ⊂ E1⊕e1 ⊕ * * * ⊕ En⊕en , with fibers π −1 (x) consisting of lists of bases of the\ne = ΩG ⊂ V.\nfibers Ei (x). Then we have V = VG and Ω\ne ⊂V\nCorollary 4.3. The Grothendieck class of the translated degeneracy locus Ω\nis given by\nX\n[OΩ\ncμ (Ω) Gμ1 (E1 − M1 ) * * * Gμn (En − Mn ) ∈ K◦ (V) ,\ne] =\nμ\n\nL\n\nwhere Mi = a:h(a)=i Et(a) = P ×G Mi . Furthermore, the quiver coefficients for Ω\nare uniquely determined by the truth of this identity for all non-singular varieties\nX and vector bundles E1 , . . . , En .\nProof. This follows from Proposition 4.2 and the definition of quiver coefficients,\n\u0003\nsince φG (Gμi (Ei − Mi )) = Gμi (Ei − Mi ).\nDefine a representation E• of Q on the vector bundles E1 , . . . , En over X to be\na collection of bundle maps Et(a) → Eh(a) corresponding to the arrows a ∈ Q1 .\nSuch a representation defines a section s : X → V. We define the degeneracy locus\ne ⊂ X. This degeneracy\nΩ(E• ) as the scheme-theoretic inverse image Ω(E• ) = s−1 (Ω)\nlocus consists of all points in X over which the bundle maps of E• degenerate to\nrepresentations in Ω. For example, if Ee• denotes the tautological representation\nof Q over V, defined by the universal maps between the pullbacks of the vector\ne = Ω(Ee• ).\nbundles Ei to V, then Ω\nAssume that X has an action of an algebraic group H over K and the representation E• consists of H-equivariant vector bundles and bundle maps. Then P has\na commuting H-action as in section 4.2 and V is an H-vector bundle, so it follows\nfrom Proposition 4.1 that the identity of Corollary 4.3 holds in KH (V). It also\nfollows that s : X → V is an equivariant section.\nWe can define a localized class Ω(E• ) in KH (Ω(E• )) by\nX\nΩ(E• ) = s! ([OΩ\n(−1)j [TorV\ne ]) =\ne )] .\nj (OX , OΩ\nj≥0\n\nThis definition is compatible with (H-equivariant) flat or regular pullback and\nproper pushforward [21], and the image of Ω(E• ) in KH (X) is given by\nX\nΩ(E• ) = s∗ [OΩ\ncμ (Ω) Gμ1 (E1 − M1 ) * * * Gμn (En − Mn ) .\ne] =\nμ\n\nFurthermore, if X and Ω are Cohen-Macaulay and the codimension of Ω(E• ) in X is\nequal to the codimension of Ω in V , then we have Ω(E• ) = [OΩ(E• ) ] ∈ KH (Ω(E• )).\nThis is true because a local regular sequence generating the ideal of X in V restricts\ne [20, Lemma A.7.1].\nto a local regular sequence defining the ideal of Ω(E• ) in Ω\n\n\fQUIVER COEFFICIENTS OF DYNKIN TYPE\n\n15\n\nThis implies that TorV\ne] =\ne ) = 0 for all j > 0, so Ω(E• ) = [OX ⊗OV OΩ\nj (OX , OΩ\n[OΩ(E• ) ]. We note that if Q is a Dynkin quiver of type A or D and K is algebraically\nclosed, then any orbit closure Ω ⊂ V is Cohen-Macaulay [27, 1, 2]. The following\ncorollary generalize all the above formulas involving quiver coefficients, including\nDefinition 3.2.\nCorollary 4.4. Let E• be a representation of Q consisting of H-equivariant vector\nbundles and bundle maps over X. Assume that both X and Ω are Cohen-Macaulay\nand that the codimension of Ω(E• ) in X is equal to the codimension of Ω in V .\nThen we have\nX\n[OΩ(E• ) ] =\ncμ (Ω) Gμ1 (E1 − M1 ) * * * Gμn (En − Mn ) ∈ KH (X) .\nμ\n\nLet X be a non-singular variety. Subject to mild conditions, corollaries 4.3 and\n4.4 have cohomological analogues. For a partition λ = (λ1 , . . . , λl ) and vector\nbundles A and B over X,Pdefine sλ (A − B) = det(hλi +j−i )l×l ∈ H ∗ (X), where the\nclasses hi are defined by i≥0 hi = c(B ∨ )/c(A∨ ), and c(A∨ ) = 1 − c1 (A) + c2 (A) −\n* * * is the total Chern class of A∨ .\nCorollary 4.5. If X admits an ample line bundle or if Q is a quiver of Dynkin\ne ⊂ V is given by\ntype, then the Chow class of the translated degeneracy locus Ω\nX\ne =\ncμ (Ω) sμ1 (E1 − M1 ) * * * sμn (En − Mn ) ∩ [V] ∈ H∗ (V) .\n[Ω]\nP\n\n|μi |=codim(Ω)\n\nWithout these conditions, this identity holds in H ∗ (V) ⊗ Q.\n\nIf X has an ample line bundle, then one can deduce this statement from the\nexpression for [Ω] ∈ HG∗ (V ) along the lines of [15, §2.5], and if Q is of Dynkin\ntype, then one can replace Grothendieck polynomials with Schur polynomials in\nthe proof of the formula for quiver coefficients given in section 6. The formula with\nrational coefficients follows from Corollary 4.3 by using the Chern character [20,\nEx. 15.2.16]. If H is a linear algebraic group, then a cohomological analogue of\nCorollary 4.4 can be proved from Corollary 4.5 by first replacing X with the Borel\nconstruction P ×H X, where P/H is an algebraic approximation of the classifying\nspace of H [34, 17], and then applying [20, Prop. 7.1]. We leave the details to the\nreader. We expect that Corollary 4.5 is true without the assumptions, but have not\nfound a proof.\n5. Resolution of singularities\nOur formula for quiver coefficients of Dynkin type is based on Reineke's resolution of the singularities of orbit closures for Dynkin quivers [31]. It will be\nconvenient to formulate Reineke's construction for an arbitrary quiver Q, together\nwith a representation of Q on vector bundles over a base scheme X.\nLet X be an algebraic scheme over K equipped with a representation E• of Q on\nvector bundles over X, with rank(Ei ) = ei . Let i ∈ Q0 be a quiver vertex and let r\nbe an integer with 1 ≤ r ≤ ei . Let ρ : Y = Gr(ei − r, Ei ) → X be the Grassmann\nbundle of rank r quotients of Ei , with universal exact sequence 0 → S → Ei →\nQ → 0. (We will avoid explicit notation for pullback of vector bundles.) We define\nthe scheme XL\ni,r = Xi,r (E• ) to be the zero scheme Xi,r = Z(Mi → Q) ⊂ Y ,\nwhere Mi = a:h(a)=i Et(a) and the map Mi → Q is obtained by composing the\n\n\f16\n\nANDERS SKOVSTED BUCH\n\nprojection Ei → Q with the sum of the bundle maps Ej → Ei of the representation\nE• . This scheme has a natural projection ρ : Xi,r → X. Notice that on Xi,r , all the\nmaps Ej → Ei can be factored through the subbundle S ⊂ Ei . Using the factored\nmaps, we obtain an induced representation E•′ over Xi,r on vector bundles given by\nEj′ = Ej for j 6= i and Ei′ = S.\nMore generally, let i = (i1 , . . . , im ) be a sequence of quiver vertices and r =\n(r1 , . P\n. . , rm ) a sequence of positive integers, such that for each i ∈ Q0 we have\nei ≥ ij =i rj . We can iterate the above construction and define\nXi,r = Xi,r (E• ) = (* * * ((Xi1 ,r1 )i2 ,r2 ) * * * )im ,rm .\n\nThe variety (Xi1 ,r1 )i2 ,r2 is constructed using the induced representation E•′ on\nXi1 ,r1 , etc. Let π : Xi,r → X denote the projection. In general, this map may\nhave fibers of positive dimension.\nNow let Q be a quiver of Dynkin type and let Φ+ ⊂ Nn be the set of positive\nroots for the underlying Dynkin diagram. Here we identify the simple roots with\nthe unit vectors ǫi ∈ Nn , 1 ≤ i ≤ n. According to Gabriel's classification [22],\nthere is a unique indecomposable representation of Q with dimension vector α for\nevery positive root α ∈ Φ+ , and all indecomposable representations have this form.\n+\nThis implies that the G-orbits in V correspond to sequences (mα ) ∈ NΦ for which\nP\nmα α is equal to the dimension vector e. Furthermore, since the number of orbits\nis finite, it follows that every quiver cycle in V is anP\norbit closure.P\nn\nFor dimension vectors α, β ∈ Nn , let hα, βi =\na∈Q1 αt(a) βh(a)\ni=1 αi βi −\n′\n+\ndenote the Euler form for Q. Let Φ ⊂ Φ be any subset of the positive roots.\nA partition Φ′ = I1 ∪ * * * ∪ Is of this set is called directed if hα, βi ≥ 0 for all\nα, β ∈ Ij , 1 ≤ j ≤ s, and hα, βi ≥ 0 ≥ hβ, αi for all α ∈ Ii and β ∈ Ij with i < j.\nA directed partition always exists because the category of representations of Q is\nrepresentation-directed [32].\n+\nLet (mα ) ∈ NΦ be a sequence representing an orbit closure Ω ⊂ V , let Φ′ ⊂ Φ+\nbe a subset containing {α : mα 6= 0}, and let Φ′ = I1 ∪ * * * ∪ Is be a directed\nP\npartition. For each j ∈ [1, s], write α∈Ij mα α = (pj1 , . . . , pjn ) ∈ Nn . Then let\n\nij = (i1 , . . . , il ) be any sequence of the vertices i ∈ Q0 for which pji 6= 0, with no\nvertices repeated, and ordered so that the tail of any arrow of Q comes before the\nhead. Set rj = (pji1 , . . . , pjil ). Finally, let i and r be the concatenated sequences\ni = i1 i2 * * * is and r = r1 r2 * * * rs . We will call any pair of sequences (i, r) arising in\nthis way for a resolution pair for Ω.\ne• denote the representation of Q on the vector bundles E\nei = V × Ei over\nLet E\nV , defined by the tautological maps Et(a) → Eh(a) , (φ, y) 7→ (φ, φa (y)), for a ∈ Q1 .\n\nTheorem 5.1 (Reineke). Let Q be a quiver of Dynkin type, Ω ⊂ V an orbit closure,\ne• ) → V has image Ω and\nand (i, r) a resolution pair for Ω. Then the map π : Vi,r (E\ne\nis a birational isomorphism of Vi,r (E• ) with Ω.\n\nWe note that Reineke's paper [31] states this theorem only in the case where\nthe resolution pair (i, r) is constructed from a directed partition of the set of all\npositive roots Φ+ , but the proof covers the more general statement.\nOur formula for quiver coefficients given in the next section uses a resolution\npair (i, r) and requires a number of steps proportional to the common length of\ni and r. It is therefore desirable to make these sequences as short as possible.\n\n\fQUIVER COEFFICIENTS OF DYNKIN TYPE\n\n17\n\nOne reasonable choice is to take the minimal set Φ′ = {α : mα 6= 0} and use the\nfollowing 'greedy' algorithm to produce a shortest possible directed partition of Φ′ .\nDefine I(Φ′ ) to be the (unique) largest subset of Φ′ for which every element α in\nI(Φ′ ) satisfies that hα, βi ≥ 0 for all β ∈ Φ′ , and hβ, αi ≤ 0 for all β ∈ Φ′ r I(Φ′ ).\nThis set can be constructed by starting with all roots α ∈ Φ′ for which the first\ninequality holds, and then discarding roots until the second inequality is satisfied.\nSince at least one directed partition for Φ′ exists, it follows that I(Φ′ ) 6= ∅. We\nnow obtain a shortest possible directed partition of Φ′ by setting I1 = I(Φ′ ),\nI2 = I(Φ′ r I1 ), I3 = I(Φ′ r (I1 ∪ I2 )), etc.\nExample 5.2. Let Q = {1 → 2 ← 3} be the quiver of type A3 in which both arrows\npoint toward the center. The set of positive roots is Φ+ = {αij | 1 ≤ i < j ≤ 3},\nPj\nwhere αij = p=i εp . Given an arbitrary partition Φ+ = I1 ∪ * * * ∪ Is , we write\nη(α) = j for α ∈ Ij . The partition is directed if and only if η(α) ≤ η(β) whenever\nthe following graph has an arrow from α to β, and η(α) < η(β) when the graph\nhas a solid arrow from α to β.\n// α33\nα12\ny<<\ny<< E E\ny\ny\nE\ny\nE\"\" y y\ny\n// α13\nα22 E\ny<< E E\nE\ny\nE\nE\nE\"\"\nE\"\" y y\n// α11\nα23\nThis graph is constructed by drawing a solid arrow from α to β if hβ, αi < 0, and\na dotted arrow from α to β if hβ, αi ≥ 0 and hα, βi > 0. The shortest directed\npartition of the positive roots is Φ+ = {α22 , α12 , α23 } ∪ {α13 , α11 , α33 }.\nLet Ω ⊂ V = Hom(E1 , E2 ) ⊕ Hom(E3 , E2 ) be an orbit closure, corresponding\nP\n+\nto the integer sequence (mij ) ∈ NΦ with\nmij αij = e = (e1 , e2 , e3 ). Then Ω is\ndefined set-theoretically by\nΩ = {(φ1 , φ3 ) ∈ V | rank(φ1 ) ≤ m12 + m13 and rank(φ3 ) ≤ m23 + m13\nand rank(φ1 + φ3 : E1 ⊕ E3 → E2 ) ≤ m12 + m23 + m13 } .\nAs preparation for section 7, we will work out the desingularization of Ω obtained\nfrom the directed partition Φ+ = {α22 } ∪ {α12 , α23 , α13 } ∪ {α11 , α33 }. The corresponding resolution pair (i, r) is given by i = (2, 1, 3, 2, 1, 3) and r = (m22 , m12 +\nm13 , m23 + m13 , e2 − m22 , m11 , m33 ). Form the product of Grassmann varieties\nP = Gr(m11 , E1 ) × Gr(e2 − m22 , E2 ) × Gr(m33 , E3 ). The desingularization of Ω\ndefined by (i, r) is the variety\ne• ) = {(S1 , S2 , S3 , φ1 , φ3 ) ∈ P × V | φi (Ei ) ⊂ S2 and φi (Si ) = 0 for i = 1, 3} .\nVi,r (E\n6. A formula for Quiver coefficients\n\nLet Q be an arbitrary quiver, and let X be an algebraic scheme over K equipped\nwith vector bundles E1 , . . . , En such that rank(Ei ) = ei for each i. Over the scheme\nL\nV = a∈Q1 Hom(Et(a) , Eh(a) ) we have a tautological representation Ee• of Q on (the\npullbacks of) the bundles Ei . Any pair of sequences i = (i1 , . . . , im ) ∈ Qm\n0 and r =\nP\nm\n(r1 , . . . , rm ) ∈ N , with ij =i rj ≤ ei for each i, defines a map π : Vi,r (Ee• ) → V.\n\n\f18\n\nANDERS SKOVSTED BUCH\n\nIn this section we give a formula for coefficients cμ (i, r) ∈ Z, indexed by sequences\nof partitions μ = (μ1 , . . . , μn ) with l(μi ) ≤ ei , such that\nX\nπ∗ [OVi,r ] =\ncμ (i, r) Gμ1 (E1 − M1 ) Gμ2 (E2 − M2 ) * * * Gμn (En − Mn ) ∈ K◦ (V) ,\nμ\n\nwhere π∗ : K◦ (Vi,r ) → K◦ (V) is the proper pushforward along π. If Q is a quiver of\nDynkin type and (i, r) is a resolution pair for an orbit closure Ω ⊂ V with rational\nsingularities, then cμ (Ω) = cμ (i, r). Our formula is stated in terms of operators on\ntensors of Grothendieck polynomials which we proceed to define.\nLet i ∈ Q0 be a quiver vertex. We let ψi : Γ⊗n+1 → Γ⊗n+1 denote the linear\noperator which applies the coproduct ∆ to the i-th factor and multiplies one of the\ncomponents of this coproduct to the last factor. More precisely, ψi is defined by\nψi (Gμ1 ⊗ * * * ⊗ Gμn ⊗ Gλ ) =\n!\nX X\nμi ν\ndστ cτ λ Gμ1 ⊗ * * * ⊗ Gμi−1 ⊗ Gσ ⊗ Gμi+1 ⊗ * * * ⊗ Gμn ⊗ Gν ,\nσ,ν\n\nτ\n\nwhere the sum is over all partitions σ, τ , and ν, and the constants dμστi and cντ λ are\ndefined in section 2.\nFor integers r, c with r ≥ 0, define the linear map Ai,r×c : Γ⊗n+1 → Γ⊗n by\nAi,r×c (Gμ1 ⊗ * * * ⊗ Gμn ⊗ Gν ) = Gμ1 ⊗ * * * ⊗ Gμi−1 ⊗ G(c)r +ν,μi ⊗ Gμi+1 ⊗ * * * ⊗ Gμn\nif l(ν) ≤ r, and Ai,r×c (Gμ1 ⊗ * * *⊗ Gμn ⊗ Gν ) = 0 otherwise. Here (c)r + ν, μi denotes\nthe concatenation of the integer sequence (c + ν1 , . . . , c + νr ) with the partition\nμi . When this does not result in a partition, then the Grothendieck polynomial\nG(c)r +ν,μi is defined by equation (7). The operator Ai,r×c will be applied with\nnegative as well as positive integers c.\nLet a1 , . . . , al ∈ Q1 be the arrows starting at i, i.e. t(aj ) = i for each j. Define\n⊗n\nthe linear map ΦQ,e\n→ Γ⊗n by\ni,r : Γ\nΦQ,e\ni,r (P ) = Ai,r×c ψh(a1 ) * * * ψh(al ) (P ⊗ 1)\nwhere c = rank(Mi ) − ei + r.\nm\nas above, we\nGiven sequences i = (i1 , . . . , im ) ∈ Qm\n0 and r = (r1 , . . . , rm ) ∈ N\nQ,e\nQ,e\n⊗n\ndefine a tensor Pi,r ∈ Γ\nas follows. If m = 0, then we set Pi,r = 1 ⊗ * * * ⊗ 1.\n′\n\n⊗n\nOtherwise we may assume by induction that PiQ,e\nhas already been defined,\n′ ,r′ ∈ Γ\n′\n′\n′\nwhere i = (i2 , . . . , im ) and r = (r2 , . . . , rm ), and e is the dimension vector defined\nQ,e\nQ,e′\n= ΦQ,e\nby e′j = ej for j 6= i1 and e′i1 = ei1 − r1 . In this case we set Pi,r\ni1 ,r1 (Pi′ ,r′ ).\nWe define the coefficients cμ (i, r) as the coefficients in the expansion\nX\nQ,e\nPi,r\n=\ncμ (i, r) Gμ1 ⊗ Gμ2 ⊗ * * * ⊗ Gμn .\nμ\n\nIt follows from this definition\nl(μi ) ≤ ei for each i.\nPthat cμ (i, r) is zero unless\nGiven any element P P\n=\ncμ Gμ1 ⊗ * * * ⊗ Gμn ∈ Γ⊗n and α1 , . . . , αn ∈ K ◦ (X),\nwe set P (α1 , . . . , αn ) =\ncμ Gμ1 (α1 ) Gμ2 (α2 ) * * * Gμn (αn ) ∈ K ◦ (X). The following\ntheorem gives the geometric interpretation of the coefficients cμ (i, r).\nTheorem 6.1. Let π : Vi,r (Ee• ) → V be the map associated to sequences i, r. Then\nQ,e\nπ∗ ([OVi,r ]) = Pi,r\n(E1 − M1 , . . . , En − Mn ) ∈ K ◦ (V).\n\n\fQUIVER COEFFICIENTS OF DYNKIN TYPE\n\n19\n\nCorollary 6.2. Let Q be a quiver of Dynkin type, Ω ⊂ V an orbit closure, and\nQ,e\n(i, r) a resolution pair for Ω. If Ω has rational singularities then PΩ = Pi,r\n, or\nequivalently, the quiver coefficients of Ω are given by cμ (Ω) = cμ (i, r). Furthermore,\nthis identity is true for all cohomological quiver coefficients, without the assumption\nabout rational singularities.\nProof. If X is a non-singular variety, then it follows from Reineke's theorem that\ne is a desingularization of the translated degeneracy locus Ω\ne ⊂ V.\nπ : Vi,r (Ee• ) → Ω\nIf Ω has rational singularities, then π∗ ([OVi,r ]) = [OΩ\ne ] ∈ K◦ (V), so the corollary\nfollows by comparing Theorem 6.1 to Corollary 4.3. Without this assumption, we\ne in the Chow ring of V, which suffices to determine the\nstill have π∗ [Vi,r ] = [Ω]\ncohomological quiver coefficients.\n\u0003\nRemark 6.3. If Ω ⊂ V is an orbit closure of Dynkin type, then the quiver coefficients for Ω are identical to the quiver coefficients for Ω = Ω×Spec(K) Spec(K), where\nK is an algebraic closure of K. Corollary 6.2 therefore applies also if Ω has rational\nsingularities, which has been proved for quivers of type A in any characteristic and\nfor quivers of type D in characteristic zero [27, 1, 2].\n\nWe have computed the coefficients cμ (i, r) for lots of randomly chosen quivers Q\nand sequences i and r, and in all cases they had alternating signs in the following\nsense.\nP\n\nConjecture 6.4. We have (−1)\nquences of partitions μ and μ′ .\n\n|μi |+\n\nP\n\n|μ′i |\n\ncμ (i, r) cμ′ (i, r) ≥ 0 for arbitrary se-\n\nIn almost all examples that we computed, the coefficients cμ (i, r) of lowest degree\nwere positive. However, we also found examples where the lowest degree coefficients\nwere negative, the next degree up were positive, etc. We speculate that in many\nexamples, the class π∗ ([OVi,r ]) has been equal to the Grothendieck class of the\nimage of π, which is always a quiver cycle in V . We therefore regard our verification of Conjecture 6.4 as additional evidence for Conjecture 1.1. For the proof of\nTheorem 6.1, we need the following Gysin formula from [8, Thm. 7.3].\nTheorem 6.5. Let F and B be vector bundles on X. Write rank(F ) = s + q and\nlet ρ : Gr(s, F ) → X be the Grassmann bundle of s-planes in F with universal\nexact sequence 0 → S → ρ∗ F → Q → 0. Let I = (I1 , . . . , Iq ) and J = (J1 , J2 , . . . )\nbe finite sequences of integers such that Ij ≥ rank(B) for all j. Then\nρ∗ (GI (Q − ρ∗ B) * GJ (S − ρ∗ B)) = GI−(sq ),J (F − B) ∈ K◦ (X) ,\nwhere I − (sq ), J = (I1 − s, . . . , Iq − s, J1 , J2 , . . . ).\nConsider a variety Vi,r = Z(Mi → Q) ⊂ Y = Gr(ei − r, Ei ) as in the previous\nsection, where 0 → S → Ei → Q → 0 is the universal exact sequence on Y . Let\nρ : Vi,r → V be the projection and let E•′ be the induced representation on Vi,r .\nLemma 6.6. Let P ′ ∈ Γ⊗n+1 and set P = ψi (P ′ ). Then P ′ (α1 , . . . , αn , Q) =\nP (α1 , . . . , αi−1 , αi − Q, αi+1 , . . . , αn , Q) for any elements α1 , . . . , αn ∈ K ◦ (Vi,r ).\nProof.\nFor partitions μi and λ we have GP\nμi (αi ) * Gλ (Q) = Gμi (α\nP\nPi −νQ + Q) * Gλ (Q) =\nμi\nμi\nG\n(α\n−\nQ)\n*\nG\n(Q)\n*\nG\n(Q)\n=\nd\nG\n(α\n−\nQ)\nd\n\u0003\ni\nτ\nλ\ni\nσ,τ στ σ\nσ,τ στ σ\nν cτ λ Gν (Q).\nL\n′\n′\nProposition 6.7. Let P ′ ∈ Γ⊗n and set P = ΦQ,e\ni,r (P ) and Mi =\nh(a)=i Et(a) .\n′\n′\n′\n′\n′\nThen ρ∗ (P (E1 − M1 , . . . , En − Mn )) = P (E1 − M1 , . . . , En − Mn ) in K◦ (V).\n\n\f20\n\nANDERS SKOVSTED BUCH\n\nProof. For each j ∈ Q0 we have [Mj ] = [M′j ]+p[Q] ∈ K ◦ (Vi,r ), where p is the number of arrows from i to j. Lemma 6.6 therefore implies that P ′ (E1′ − M′1 , . . . , En′ −\nM′n ) = P ′′ (E1′ − M1 , . . . , En′ − Mn , Q) where P ′′ = ψh(a1 ) * * * ψh(al ) (P ′ ⊗ 1).\nIt follows from Example 3.3 that [OVi,r ] = GR (Q − Mi ) in K◦ (Y ), where R =\n(rank(Mi )r ). The pushforward of P ′ (E1′ − M′1 , . . . , En′ − M′n ) from Vi,r to Y is\ntherefore equal to P ′′ (E1′ − M1 , . . . , En′ − Mn , Q) * GR (Q).\nLet μi and ν be partitions. If l(ν) > r then Gν (Q) = 0. Otherwise it follows\nfrom the factorization formula (4) that Gν (Q)GR (Q − Mi ) = GR+ν (Q − Mi ), and\nTheorem 6.5 implies that ρ′∗ (GR+ν (Q − Mi ) * Gμi (S − Mi )) = G(c)r +ν,μi (Ei − Mi ),\nwhere ρ′ : Y → V is the projection and c = rank(Mi ) − ei + r. We conclude that\nρ∗ (P ′ (E1′ −M′1 , . . . , En′ −M′n )) = P (E1 −M1 , . . . , En −Mn ) where P = Ai,r×c (P ′′ ) =\n′\nΦQ,e\n\u0003\ni,r (P ).\nProof of Theorem 6.1. Let X ′ = Gr(ei1 − r1 , Ei1 ) → X be the Grassmann bun′\n′\ndle of rank r1 quotients of Ei1 . Then the bundles\nL Ej are defined on X , and\n′\nY = V ×X X can be constructed as the bundle a∈Q1 HomOX ′ (Et(a) , Eh(a) ) over\nX ′ . LIt follows that Vi1 ,r1 = Z(Mi → Ei /Ei′ ) ⊂ Y is isomorphic to the bun′\n), which implies that Vi1 ,r1 is an affine bundle over\ndle a∈Q1 HomOX ′ (Et(a) , Eh(a)\nL\n′\n′\n′\n). We furthermore have a fiber square:\nV = a∈Q1 HomOX ′ (Et(a) , Eh(a)\nVi,r\n\n// Vi′′ ,r′ (E•′ )\nβ′\n\nβ\n\n\u000f\u000f\n\nVi1 ,r1\n\n\u000f\u000f\n// V ′\n′\n\n′\n′\n′\n′\n′\nBy induction on m we know that β∗′ (1) = PiQ,e\n′ ,r′ (E1 − M1 , . . . , En − Mn ) ∈ K◦ (V ),\nand since the horizontal maps are flat, this implies that β∗ ([OVi,r ]) = β∗ (1) =\n′\n\n′\n′\n′\n′\nPiQ,e\nProposition 6.7 finally shows that\n′ ,r′ (E1 − M1 , . . . , En − Mn ) ∈ K◦ (Vi1 ,r1 ).\n′\n\nQ,e\n′\n′\n′\n′\nπ∗ ([OVi,r ]) = ρ∗ (PiQ,e\n′ ,r′ (E1 − M1 , . . . , En − Mn )) = Pi,r (E1 − M1 , . . . , En − Mn ) ∈\nK◦ (V), as required.\n\u0003\n\nRemark 6.8. For applications of our formula, it would be useful to know the\nreduced equations generating the ideal of an orbit closure Ω ⊂ V for a quiver Q of\nDynkin type. For example, such equations will result in a more explicit construction\nof the degeneracy loci Ω(E• ) defined by Ω.\nLet φ ∈ V be a representation of Q on the vector spaces E1 , . . . , En , and fix another representation ψ = (ψa )a∈Q1 on vector spaces F1 , . . . , Fn . A homomorphism\nfrom ψ to φ is a collection β of linear maps βi : Fi → Ei such that φa βt(a) = βh(a) ψa\nas a map from Ft(a) to Eh(a) for all a ∈ Q1 . Let Hom(ψ, φ) denote the vector space\nof all such homomorphisms. Bongartz has proved in [3, Prop. 3.2] that φ′ belongs\n′\nto the orbit closure Ω = G.φ if and only if dim Hom(ψ, φL\n) ≥ dim Hom(ψ, φ) for\nall (indecomposable) representations ψ of Q. Set A =\ni∈Q0 Hom(Fi , Ei ) and\nL\nB = a∈Q1 Hom(Ft(a) , Eh(a) ), and let γψ,φ : A → B be the linear map given by\nγψ,φ (β) = (βh(a) ψa − φa βt(a) )a∈Q1 . Define rankψ (φ) = rank(γψ,φ ). We then have\n(13) Ω = {φ′ ∈ V | rankψ (φ′ ) ≤ rankψ (φ) ∀ indecomp. representations ψ of Q} .\n\nThis description of the orbit closure Ω gives rise to set-theoretic equations for Ω in\nterms of minors of the matrices γψ,φ . It is interesting to ask if these equations in\n\n\fQUIVER COEFFICIENTS OF DYNKIN TYPE\n\n21\n\nfact generate the ideal I(Ω) ⊂ k[V ]. This has been proved for equioriented quivers\nof type A by Lakshmibai and Magyar [27], but reduced equations for orbit closures\nappear to be unknown for quivers of other types. We have used Macaulay 2 [23]\nto check that minors of the matrices γψ,φ in fact generate the ideal of the inbound\nA3 -orbit closure given by mij = 1 for 1 ≤ i < j ≤ 3 (see Example 5.2).\nIf E• is a representation of Q on vector bundles over X,\nL then each fixed representation ψ of Q defines a vector bundle map from A = i∈Q0 Hom(Fi ⊗ OX , Ei )\nL\nto B = a∈Q1 Hom(Ft(a) ⊗ OX , Eh(a) ), and the degeneracy locus Ω(E• ) is the set\nof points x ∈ X where the rank of this bundle map is at most rankψ (φ) for all ψ.\nAssuming that (13) gives the reduced equations of Ω, this description of Ω(E• ) also\ncaptures its scheme structure.\n7. Quiver coefficients of type A3\nIn this section we prove combinatorial formulas for the (non-equioriented) quiver\ncoefficients of type A3 . These formulas are based on counting set-valued tableaux,\nand show that the coefficients have alternating signs.\n7.1. Inbound A3 quiver. Let Q = {1 → 2 ← 3} be the inbound quiver of type\n+\nA3 from Example 5.2, and let Ω ⊂ V be the orbit closure given by (mij ) ∈ NΦ .\nFor partitions λ, μ, and ν, define the coefficient\nX (m )m12\n(m11 )m23 μ\ncλ,μ,ν =\ndτ,ν\ncστ ,\ndλ,σ33\nσ,τ\n\nwhere the sum is over all partitions σ and τ .\n\nProposition 7.1. The coefficient cλ,μ,ν is equal to (−1)|λ|+|μ|+|ν|−m33 m12 −m11 m23\ntimes the number of pairs (σ, T ) of a partition σ contained in the rectangle (m33 )m12\nwith m12 rows and m33 columns, and a set-valued tableau T whose shape is a\npartition contained in (m11 )m23 , satisfying the following conditions.\n(i) If σ is placed in the upper-left corner of the rectangle (m33 )m12 and the 180\ndegree rotation of λ is placed in the lower-right corner, then their union\nis the whole rectangle and their overlap is a rook-strip, i.e. the the overlap\ncontains at most one box in any row or column.\n(ii) If T is placed in the upper-left corner of the rectangle (m11 )m23 and the 180\ndegree rotation of ν is placed in the lower-right corner, then their union is\nthe whole rectangle and their overlap is a rook-strip.\n(iii) The composition w(T )u(σ) is a reverse lattice word with content μ (with\nthe terminology of Theorem 2.1.)\n(m\n\nProof. This follows from Theorem 2.1 because dλ,σ33\n\n)m12\n\nis non-zero exactly when\n\n(m )m12\ndλ,σ33\n\n= (−1)|λ|+|σ|−m33 m12 . Notice\nthe condition (i) is satisfied, in which case\n\u0003\nalso that (i) and (ii) can only be satisfied if λ ⊂ (m33 )m12 and ν ⊂ (m11 )m23 .\nTheorem 7.2. The quiver coefficients of the inbound quiver of type A3 are given\nby\nX\nPΩ =\ncλ,μ,ν Gλ ⊗ G(m11 +m13 +m33 )m22 ,μ ⊗ Gν .\nλ,μ,ν\n\nLemma 7.3. In the situation of Theorem 6.5, let λ be a partition such that λ1 =\nλb = s, where b = rank(B). Then ρ∗ (Gλ (ρ∗ B − S)) = G(λq+1 ,λq+2 ,... ) (B − F ).\n\n\f22\n\nANDERS SKOVSTED BUCH\n\nProof. The Grassmann bundle Gr(s, F ) of s-planes in F is identical to the bundle\nGr(q, F ∨ ) of q-planes in F ∨ , with tautological exact sequence 0 → Q∨ → ρ∗ F ∨ →\nS ∨ → 0. The lemma follows from Theorem 6.5 by using the identity Gλ (ρ∗ B − S) =\n\u0003\nGλ′ (S ∨ − ρ∗ B ∨ ).\nProof of Theorem 7.2. Let X be a smooth variety with vector bundles E1 , E2 , E3\ne ⊂ V = Hom(E1 , E2 ) ⊕ Hom(E3 , E2 ) be the translated\nof ranks e1 , e2 , e3 , and let Ω\ndegeneracy locus. Form the product of Grassmann bundles\nπ\n\nP = Gr(m11 , E1 ) ×V Gr(e2 − m22 , E2 ) ×V Gr(m33 , E3 ) −−→ V\n\ne is the\nwith tautological subbundles Ei′ ⊂ Ei , 1 ≤ i ≤ 3. The desingularization of Ω\niterated zero section Vi,r = Z(E1′ ⊕ E3′ → E2′ ) ⊂ Z(E1 ⊕ E3 → E2 /E2′ ) ⊂ P . The\nThom-Porteous formula (Example 3.3) implies that the Grothendieck class of this\nlocus in K◦ (P ) is given by\n[OVi,r ] = G(m11 )e2 −m22 (E2′ − E1′ ) G(m33 )e2 −m22 (E2′ − E3′ ) G(e1 +e2 )m22 (E2 /E2′ − E1 ⊕ E3 ) .\nThe pushforward of this class along the projection P → Gr(e2 − m22 , E2 ) is equal\nto G(m11 )m23 (E2′ − E1 ) G(m33 )m12 (E2′ − E3 ) G(e1 +e3 )m22 (E2 /E2′ − E1 ⊕ E3 ) by Lemma 7.3.\nThe first two factors of this product can be rewritten as\nG(m11 )m23 (E2′ − E1 ) G(m33 )m12 (E2′ − E3 )\nX (m )m12\n(m11 )m23\n=\nGλ (E1 ) Gσ (E2′ − E1 ⊕ E3 ) Gτ (E2′ − E1 ⊕ E3 ) Gν (E3 )\ndτ,ν\ndλ,σ33\nλ,σ,τ,ν\n\n=\n\nX\n\ncλ,μ,ν Gλ (E1 ) Gμ (E2′ − E1 ⊕ E3 ) Gν (E3 ) .\n\nλ,μ,ν\n\nTheorem 6.5 applied to the bundle Gr(e2 − m22 , E2 ) → V therefore shows that\nX\nπ∗ ([OVi,r ]) =\ncλ,μ,ν Gλ (E1 ) G(m11 +m13 +m33 )m22 ,μ (E2 − E1 ⊕ E3 ) Gν (E3 )\nλ,μ,ν\n\nin K◦ (V), as required.\n\n\u0003\n\n7.2. Outbound A3 quiver. Now let Q = {1 ← 2 → 3} be the quiver of type A3\nwith both arrows pointing away from the center, and let Ω ⊂ V be the orbit closure\n+\ncorresponding to the sequence (mij ) ∈ NΦ , where Φ+ = {αij | 1 ≤ i < j ≤ 3}.\nLet R = (m22 )m13 be the rectangle with m13 rows and m22 columns. For partitions\n2\nλ, μ, ν, we let dR\nλ,μ,ν denote the 2-fold coproduct coefficients defined by ∆ (GR ) =\nP\nR\nλ,μ,ν dλ,μ,ν Gλ ⊗ Gμ ⊗ Gν .\nProposition 7.4. The coefficient dR\nλ,μ,ν is zero unless λ, μ, and ν are contained\nin R, in which case it is equal to (−1)|λ|+|μ|+|ν|−m22 m13 times the number of triples\n(σ, τ, T ), where σ and τ are partitions such that σ ⊂ τ ⊂ R, and T is a set-valued\ntableau of skew shape τ /σ, satisfying the following conditions.\n(i) The Young diagram σ is contained in λ, and λ/σ is a rook-strip.\n(ii) If τ is placed in the upper-left corner of R and the 180 degree rotation of ν\nis placed in the lower-right corner, then their union is R and their overlap\nis a rook-strip.\n(iii) The word w(T ) is a reverse lattice word with content μ.\n\n\fQUIVER COEFFICIENTS OF DYNKIN TYPE\n\n23\n\nP\nProof. It follows from [9, Lemma 6.1] that ∆2 (GR ) = (−1)|λ|+|τ /σ|+|ν|−|R| Gλ ⊗\nGτ /σ ⊗ Gν , where the sum is over all partitions λ, σ, τ, μ ⊂ R satisfying (i) and (ii).\nThe coefficient of Gμ in Gτ /σ is equal to (−1)|μ|−|τ /σ| times the number of set-valued\ntableaux T of shape τ /σ satisfying (iii) by [9, Thm. 6.9].\n\u0003\nTheorem 7.5. The quiver coefficients of the outbound quiver of type A3 are given\nby\nX\nPΩ =\ndR\nλ,μ,ν G(m22 +m23 )m11 ,λ ⊗ Gμ ⊗ G(m22 +m12 )m33 ,ν .\nλ,μ,ν\n\nProof. We use the directed partition Φ+ = {α11 } ∪ {α33 , α23 , α13 } ∪ {α22 , α12 }, and\nresolution pair i = (1, 2, 1, 3, 2, 1) and r = (m11 , m23 +m13 , m13 , e3 , m22 +m12 , m12 ).\nGiven a non-singular variety X with vector bundles E1 , E2 , E3 of ranks e1 , e2 , e3 ,\nform the product P = Fl(m12 , m12 + m13 ; E1 ) ×V Gr(m22 + m12 , E2 ) → V, with\ne ⊂V\nuniversal subbundles E1′′ ⊂ E1′ ⊂ E1 and E2′ ⊂ E2 . The desingularization of Ω\n′\n′\n′′\ncorresponding to (i, r) is the iterated zero section Vi,r = Z(E2 → E1 /E1 ⊕ E3 ) ⊂\nZ(E2 → E1 /E1′ ) ⊂ P . The Grothendieck class of this locus in K◦ (P ) is\n[OVi,r ] = G(e2 )m11 (E1 /E1′ − E2 ) G(m22 +m12 )m13 (E1′ /E1′′ − E2′ ) G(m22 +m12 )e3 (E3 − E2′ ) ,\nand by Theorem 6.5, the pushforward of this class along the projection P → P ′ =\nGr(m12 + m13 , E1 ) ×V Gr(m22 + m12 , E2 ) is equal to\nG(e2 )m11 (E1 /E1′ − E2 ) GR (E1′ − E2′ ) G(m22 +m12 )e3 (E3 − E2′ )\nin K◦ (P ′ ). After using the three-fold coproduct identity\nX\n′\n′\nGR (E1′ − E2′ ) =\ndR\nλ,μ,ν Gλ (E1 − E2 ) Gμ (E2 ) Gν (−E2 ) ,\n\nas well as the factorization identity\n\nGν (−E2′ ) G(m22 +m12 )e3 (E3 − E2′ ) = G(m22 +m12 )e3 ,ν (E3 − E2′ ) ,\nit follows from Theorem 6.5 and Lemma 7.3 that the pushforward of the class in\nK◦ (P ′ ) along P ′ → V is equal to\nX\nπ∗ ([OVi,r ]) =\ndR\nλ,μ,ν G(m22 +m23 )m11 ,λ (E1 − E2 ) Gμ (E2 ) G(m22 +m12 )m33 ,ν (E3 − E2 ) ,\nλ,μ,ν\n\nas required.\n\n\u0003\n\nReferences\n[1] G. Bobiński and G. Zwara, Normality of orbit closures for Dynkin quivers of type An ,\nManuscripta Math. 105 (2001), no. 1, 103–109. MR MR1885816 (2002k:14077)\n[2]\n, Schubert varieties and representations of Dynkin quivers, Colloq. Math. 94 (2002),\nno. 2, 285–309. MR MR1967381 (2004a:16026)\n[3] K. Bongartz, On degenerations and extensions of finite-dimensional modules, Adv. Math.\n121 (1996), no. 2, 245–287. MR MR1402728 (98e:16012)\n[4] S. Bosch, W. Lütkebohmert, and M. Raynaud, Néron models, Ergebnisse der Mathematik und\nihrer Grenzgebiete (3), vol. 21, Springer-Verlag, Berlin, 1990. MR MR1045822 (91i:14034)\n[5] M. Brion, Positivity in the Grothendieck group of complex flag varieties, J. Algebra 258\n(2002), no. 1, 137–159. MR MR1958901 (2003m:14017)\n[6] A. S. Buch, On a conjectured formula for quiver varieties, J. Algebraic Combin. 13 (2001),\nno. 2, 151–172. MR MR1826950 (2002g:14074)\n[7]\n, Stanley symmetric functions and quiver varieties, J. Algebra 235 (2001), no. 1,\n243–260. MR MR1807664 (2001m:05257)\n[8]\n, Grothendieck classes of quiver varieties, Duke Math. J. 115 (2002), no. 1, 75–103.\nMR MR1932326 (2003m:14018)\n\n\f24\n\n[9]\n[10]\n[11]\n[12]\n[13]\n[14]\n[15]\n[16]\n[17]\n[18]\n[19]\n[20]\n[21]\n[22]\n[23]\n[24]\n[25]\n[26]\n[27]\n[28]\n[29]\n[30]\n[31]\n[32]\n[33]\n[34]\n\n[35]\n\nANDERS SKOVSTED BUCH\n\n, A Littlewood-Richardson rule for the K-theory of Grassmannians, Acta Math. 189\n(2002), no. 1, 37–78. MR MR1946917 (2003j:14062)\n, Alternating signs of quiver coefficients, J. Amer. Math. Soc. 18 (2005), no. 1, 217–\n237. MR MR2114821 (2006d:14052)\nA. S. Buch and W. Fulton, Chern class formulas for quiver varieties, Invent. Math. 135\n(1999), no. 3, 665–687. MR MR1669280 (2000f:14087)\nA. S. Buch, A. Kresch, M. Shimozono, H. Tamvakis, and A. Yong, Stable Grothendieck\npolynomials and K-theoretic factor sequences, preprint, 2006.\nA. S. Buch, A. Kresch, H. Tamvakis, and A. Yong, Schubert polynomials and quiver formulas,\nDuke Math. J. 122 (2004), no. 1, 125–143. MR MR2046809 (2005b:05218)\n, Grothendieck polynomials and quiver formulas, Amer. J. Math. 127 (2005), no. 3,\n551–567. MR MR2141644 (2007d:14018)\nA. S. Buch and R. Rimányi, A formula for non-equioriented quiver orbits of type A, J.\nAlgebraic Geom. 16 (2007), no. 3, 531–546. MR MR2306279\nA. S. Buch, F. Sottile, and A. Yong, Quiver coefficients are Schubert structure constants,\nMath. Res. Lett. 12 (2005), no. 4, 567–574. MR MR2155232 (2006g:14082)\nD. Edidin and W. Graham, Equivariant intersection theory, Invent. Math. 131 (1998), no. 3,\n595–634. MR MR1614555 (99j:14003a)\nL. Fehér and R. Rimányi, Classes of degeneracy loci for quivers: the Thom polynomial point\nof view, Duke Math. J. 114 (2002), no. 2, 193–213. MR MR1920187 (2003j:14005)\nS. Fomin and A. N. Kirillov, Grothendieck polynomials and the Yang-Baxter equation, Proc.\nFormal Power Series and Alg. Comb. (1994), 183–190.\nW. Fulton, Intersection theory, second ed., Ergebnisse der Mathematik und ihrer Grenzgebiete (3), vol. 2, Springer-Verlag, Berlin, 1998. MR MR1644323 (99d:14003)\nW. Fulton and R. MacPherson, Categorical framework for the study of singular spaces, Mem.\nAmer. Math. Soc. 31 (1981), no. 243, vi+165. MR MR609831 (83a:55015)\nP. Gabriel, Unzerlegbare Darstellungen. I, Manuscripta Math. 6 (1972), 71–103; correction,\nibid. 6 (1972), 309. MR MR0332887 (48 #11212)\nD. R. Grayson and M. E. Stillman, Macaulay 2, a software system for research in algebraic\ngeometry, Available at http://www.math.uiuc.edu/Macaulay2/.\nJ. C. Jantzen, Representations of algebraic groups, second ed., Mathematical Surveys and\nMonographs, vol. 107, AMS, Providence, RI, 2003. MR MR2015057 (2004h:20061)\nA. Knutson, E. Miller, and M. Shimozono, Four positive formulae for type A quiver polynomials, Invent. Math. 166 (2006), no. 2, 229–325. MR MR2249801\nA. Knutson and M. Shimozono, Kempf collapsing and quiver loci, preprint, 2006.\nV. Lakshmibai and P. Magyar, Degeneracy schemes, quiver schemes, and Schubert varieties,\nInternat. Math. Res. Notices (1998), no. 12, 627–640. MR MR1635873 (99g:14065)\nC. Lenart, S. Robinson, and F. Sottile, Grothendieck polynomials via permutation patterns\nand chains in the Bruhat order, Amer. J. Math. 128 (2006), no. 4, 805–848. MR MR2251587\nE. Miller, Alternating formulas for K-theoretic quiver polynomials, Duke Math. J. 128\n(2005), no. 1, 1–17. MR MR2137947 (2006e:05181)\nD. Mumford, Geometric invariant theory, Ergebnisse der Mathematik und ihrer Grenzgebiete,\nNeue Folge, Band 34, Springer-Verlag, Berlin, 1965. MR MR0214602 (35 #5451)\nM. Reineke, Quivers, desingularizations and canonical bases, Progr. Math., vol. 210,\nBirkhäuser Boston, Boston, MA, 2003, pp. 325–344. MR MR1985731 (2004j:16017)\nC. M. Ringel, Tame algebras and integral quadratic forms, Lecture Notes in Mathematics,\nvol. 1099, Springer-Verlag, Berlin, 1984. MR MR774589 (87f:16027)\nR. W. Thomason, Equivariant algebraic vs. topological K-homology Atiyah-Segal-style, Duke\nMath. J. 56 (1988), no. 3, 589–636. MR MR948534 (89f:14015)\nB. Totaro, The Chow ring of a classifying space, Algebraic K-theory (Seattle, WA, 1997),\nProc. Sympos. Pure Math., vol. 67, Amer. Math. Soc., Providence, RI, 1999, pp. 249–281.\nMR MR1743244 (2001f:14011)\nG. Zwara, An orbit closure for a representation of the Kronecker quiver with bad singularities,\nColloq. Math. 97 (2003), no. 1, 81–86. MR MR2010544 (2004j:16018)\n\nDepartment of Mathematics, Rutgers University, 110 Frelinghuysen Road, Piscataway, NJ 08854, USA\nE-mail address: asbuch@math.rutgers.edu\n\n\f"}