{"id": "http://arxiv.org/abs/1012.5361v2", "guidislink": true, "updated": "2010-12-28T07:28:55Z", "updated_parsed": [2010, 12, 28, 7, 28, 55, 1, 362, 0], "published": "2010-12-24T08:14:58Z", "published_parsed": [2010, 12, 24, 8, 14, 58, 4, 358, 0], "title": "Physical Equivalence of Pure States and Derivation of Qubit in General\n  Probabilistic Theories", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1012.4165%2C1012.2877%2C1012.0463%2C1012.0097%2C1012.4859%2C1012.4299%2C1012.4845%2C1012.1607%2C1012.4987%2C1012.3585%2C1012.5139%2C1012.5451%2C1012.5128%2C1012.4150%2C1012.2861%2C1012.4451%2C1012.3209%2C1012.4022%2C1012.4101%2C1012.5138%2C1012.4757%2C1012.2137%2C1012.0210%2C1012.5425%2C1012.3121%2C1012.4240%2C1012.5782%2C1012.0708%2C1012.1115%2C1012.3628%2C1012.4518%2C1012.0469%2C1012.2456%2C1012.3149%2C1012.1035%2C1012.4705%2C1012.2767%2C1012.3309%2C1012.0807%2C1012.6025%2C1012.3420%2C1012.1630%2C1012.4172%2C1012.3949%2C1012.5967%2C1012.1277%2C1012.3370%2C1012.5392%2C1012.4378%2C1012.1480%2C1012.4553%2C1012.2784%2C1012.2885%2C1012.2141%2C1012.3632%2C1012.1799%2C1012.1112%2C1012.5566%2C1012.0513%2C1012.2976%2C1012.4840%2C1012.1388%2C1012.0835%2C1012.2433%2C1012.5997%2C1012.1108%2C1012.5612%2C1012.4336%2C1012.3424%2C1012.4176%2C1012.1038%2C1012.2923%2C1012.1243%2C1012.5302%2C1012.4290%2C1012.3676%2C1012.3282%2C1012.4661%2C1012.0275%2C1012.4062%2C1012.2509%2C1012.0175%2C1012.5581%2C1012.5489%2C1012.0179%2C1012.3837%2C1012.4348%2C1012.4909%2C1012.2426%2C1012.2219%2C1012.2647%2C1012.1292%2C1012.4109%2C1012.1005%2C1012.5115%2C1012.5905%2C1012.3028%2C1012.5150%2C1012.0086%2C1012.5361%2C1012.2284&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Physical Equivalence of Pure States and Derivation of Qubit in General\n  Probabilistic Theories"}, "summary": "In this paper, we investigate a characterization of Quantum Mechanics by two\nphysical principles based on general probabilistic theories. We first give the\noperationally motivated definition of the physical equivalence of states and\nconsider the principle of the physical equivalence of pure states, which turns\nout to be equivalent to the symmetric structure of the state space. We further\nconsider another principle of the decomposability with distinguishable pure\nstates. We give classification theorems of the state spaces for each principle,\nand derive the Bloch ball in 2 and 3 dimensional systems by these principles.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1012.4165%2C1012.2877%2C1012.0463%2C1012.0097%2C1012.4859%2C1012.4299%2C1012.4845%2C1012.1607%2C1012.4987%2C1012.3585%2C1012.5139%2C1012.5451%2C1012.5128%2C1012.4150%2C1012.2861%2C1012.4451%2C1012.3209%2C1012.4022%2C1012.4101%2C1012.5138%2C1012.4757%2C1012.2137%2C1012.0210%2C1012.5425%2C1012.3121%2C1012.4240%2C1012.5782%2C1012.0708%2C1012.1115%2C1012.3628%2C1012.4518%2C1012.0469%2C1012.2456%2C1012.3149%2C1012.1035%2C1012.4705%2C1012.2767%2C1012.3309%2C1012.0807%2C1012.6025%2C1012.3420%2C1012.1630%2C1012.4172%2C1012.3949%2C1012.5967%2C1012.1277%2C1012.3370%2C1012.5392%2C1012.4378%2C1012.1480%2C1012.4553%2C1012.2784%2C1012.2885%2C1012.2141%2C1012.3632%2C1012.1799%2C1012.1112%2C1012.5566%2C1012.0513%2C1012.2976%2C1012.4840%2C1012.1388%2C1012.0835%2C1012.2433%2C1012.5997%2C1012.1108%2C1012.5612%2C1012.4336%2C1012.3424%2C1012.4176%2C1012.1038%2C1012.2923%2C1012.1243%2C1012.5302%2C1012.4290%2C1012.3676%2C1012.3282%2C1012.4661%2C1012.0275%2C1012.4062%2C1012.2509%2C1012.0175%2C1012.5581%2C1012.5489%2C1012.0179%2C1012.3837%2C1012.4348%2C1012.4909%2C1012.2426%2C1012.2219%2C1012.2647%2C1012.1292%2C1012.4109%2C1012.1005%2C1012.5115%2C1012.5905%2C1012.3028%2C1012.5150%2C1012.0086%2C1012.5361%2C1012.2284&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "In this paper, we investigate a characterization of Quantum Mechanics by two\nphysical principles based on general probabilistic theories. We first give the\noperationally motivated definition of the physical equivalence of states and\nconsider the principle of the physical equivalence of pure states, which turns\nout to be equivalent to the symmetric structure of the state space. We further\nconsider another principle of the decomposability with distinguishable pure\nstates. We give classification theorems of the state spaces for each principle,\nand derive the Bloch ball in 2 and 3 dimensional systems by these principles."}, "authors": ["Gen Kimura", "Koji Nuida", "Hideki Imai"], "author_detail": {"name": "Hideki Imai"}, "author": "Hideki Imai", "arxiv_comment": "13 pages; in v2, we added the information of our paper\n  arXiv:1012.5350", "links": [{"href": "http://arxiv.org/abs/1012.5361v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1012.5361v2", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "quant-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "quant-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "math-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "math.MP", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1012.5361v2", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1012.5361v2", "journal_reference": null, "doi": null, "fulltext": "Physical Equivalence of Pure States and Derivation of Qubit in General Probabilistic\nTheories\nGen Kimura\n\n[a,b] ∗\n\n, Koji Nuida\n\n[b] †\n\n, and Hideki Imai\n\n[b],[c]\n\narXiv:1012.5361v2 [quant-ph] 28 Dec 2010\n\n[a] Research and Development Initiative, Chuo University,\n1- 13-27 Kasuga, Bunkyo-ku, Tokyo 112-8551, Japan and\n[b] Research Center for Information Security (RCIS),\nNational Institute of Advanced Industrial Science and Technology (AIST). Daibiru building 1003,\n1-18-13 Sotokanda, Chiyoda-ku, Tokyo, 101-0021, Japan\n[c] Graduate School of Science and Engineering,\nChuo University. 1-13-27 Kasuga, Bunkyo-ku, Tokyo 112-8551, Japan\nIn this paper, we investigate a characterization of Quantum Mechanics by two physical principles\nbased on general probabilistic theories. We first give the operationally motivated definition of the\nphysical equivalence of states and consider the principle of the physical equivalence of pure states,\nwhich turns out to be equivalent to the symmetric structure of the state space. We further consider\nanother principle of the decomposability with distinguishable pure states. We give classification\ntheorems of the state spaces for each principle, and derive the Bloch ball in 2 and 3 dimensional\nsystems by these principles.\nI.\n\nINTRODUCTION\n\nAfter the completion of von Neumann's celebrated axioms [1] of Quantum Mechanics (QM), one of the theoretical and philosophical interests of QM shifted to derive the theory using solely physical principles. Here the\nphysical principle means a physical statement which is,\nin principle, testable by experiments. For instance, a\nstatement such as \"a quantum observable is represented\nby a self-adjoint operator on a Hilbert space\" is not a\nphysical principle, but a statement such as \"the speed of\nlight is constant independent of observer's motion\" gives\na typical example of a physical principle. Indeed, the\nstandard axioms of QM presuppose a priori mathematical structures such as Hilbert space and linear operators\n- as the former example is one of the axioms - and\nthen gives a recipe (Born's rule) of how to predict physical phenomena by combining such mathematical objects.\nThis non-physical characterization of QM is sometimes\nconsidered as one of the causes why QM is difficult to\nintuitively understand - in the end, many students who\nlearns QM for the first time naively ask themselves \"Why\nobservables are described by (non-commutative) operators?\" On the other hand, if QM was constructed solely\nwith physical principles and if, moreover, they are tested\nby experiments, then QM would be intuitively more acceptable than the present situation, as all the \"weird\"\nquantum phenomena (such as the uncertainty principle\nand an entanglement) automatically follow from experimentally established phenomena. (For instance, most\nphysicists feel to intuitively understand the relativity of\ntime, even though contrary to our common sense, since\nthey know that the invariance of the speed of light is ex-\n\n∗ Electronic\n† Electronic\n\naddress: gen-kimura[at]aist.go.jp\naddress: k.nuida[at]aist.go.jp\n\nTypeset by REVTEX\n\nperimentally confirmed and the fact naturally leads the\nrelativity of time.)\nTherefore, a desire to derive axioms of QM which are\npurely described by physical principles is natural as many\nresearchers indeed have tackled this problem so far [2–\n7], and some of recent developments in [8–10] and [11]\ncontribute the goal in each ways.\nOne of the lines of this research starts by recognizing that QM is one of the probabilistic theories. Indeed,\nwith the standard interpretation of QM and indeed with\na practical method to compare with experimental data,\nwhat QM predicts is a probability to obtain an outcome\nby performing a measurement under a given state. However, the structure of the theory is more complicated than\na classical probability theory (based on Kolmogorov's axioms). Therefore, it is convenient to first establish a general framework for all the possible probabilistic models\nincluding both classical theory and QM. Then, we can\nlook for particular conditions (described by physical principles) which narrow down the general models to be QM.\nIndeed, such a general framework has been well investigated (for instance see [12–16]) and recently is called\nGeneral Probabilistic Theories (GPTs) [17–19].\nFor this purpose, we first give an operationally motivated definition of the physical equivalence between\nstates and propose a physical principle of [P5] Physical\nEquivalence of Pure States. Then we show that the principle is equivalently described by a symmetric structure\nof state space (See Theorem 2 and the principle [P5']).\nNext, we consider another principle of [P6] the decomposability with distinguishable pure states. We give representation theorems for state spaces for each principle\n(See Proposition 5, Theorems 5, 6 for [P5], and Theorem 7 for [P6]). By combining these results, we derive that GPTs with 2 or 3 dimensional state spaces are\neither classical or quantum (See Theorem 8). Our results are closely related to those in [8–10] and [11], where\nthe general Bloch ball is obtained. However, the definition of the Bloch ball there is given by a system with at\n\n\f2\nmost two distinguishable states. On the other hand, we\ndo not require the maximum number of distinguishable\nstates and discuss how the state space is characterized.\nTo understand this non-triviality, we notice that a state\nspace is not uniquely determined under the above two\nprinciples but on the contrary still there admits a complicated state space, where the typical example is given\nby QM itself with more than or equal to 3 dimensional\nHilbert spaces (see [20]). Notice that in this paper we do\nnot deal with a dynamics, a measurement process, nor a\ncomposite system, which are another important notions\nfor GPTs. Rather, we are interested in how GPTs are\ncharacterized with the above minimum restrictions (principles) posed only on states and measurements.\nThis paper is organized as follows. In Sec. II, we\nreview and reconstruct GPTs with natural physical principles [P1-P3], especially explaining the basic notions of\nstates and measurements and how mathematical structures such as vectors in a real vector space appear to\nrepresent them. In Sec. III, we introduce and investigate\nthe principles [P5] and [P6], including general discussion\nof the invariant states under any affine bijection on the\nstate space. In Sec. IV, we give a concluding remark and\ndiscussion.\nII.\n\nREVIEW OF GENERAL PROBABILISTIC\nTHEORIES\n\nIn this section, we briefly review General Probabilistic\nTheories (GPTs) as a general framework of operationally\nwell-defined probabilistic models, focusing on the notions\nof states and measurements. Based on operationally motivated principles, we explain how states and measurements are mathematically represented by vectors in a\ncompact convex set and effects, respectively. It is important to recognize that these mathematical structures\nare not introduced a priori but they are the consequences\nfrom physical principles.\nA.\n\nStates and Measurements on GPTs\n\nThe basic ingredients of GPTs are the notions of states\nand measurements with a physical law (e.g., Born's Rule\nin quantum mechanics) to predict a probability to obtain a measurement outcome. Formally, we assume the\nfollowing:\n[P1] (Probability Assignment Principle) A probability\nPr{M = mi |s} to get an outcome mi is given when performing a measurement M under a state s:\nPr{M = mi |s} ≥ 0,\n\nn\nX\n\nPr{M = mi |s} = 1.\n\n(1)\n\ni=1\n\nIn this paper, we assume for mathematical simplicity\nthat each measurement M has a discrete (and finite)\nset of measurement outcomes {mi }ni=1 with n ≥ 1 [38].\n\nIn particular, 2-valued measurements with n = 2 (YesNo measurements) play a fundamental role as building\nblocks of any measurements (See for instance Chapter\n6 in [21]). In the following, the symbols s, s1 , s2 , * * * ,\nM, M1 , M2 , * * * and m, m1 , m2 , * * * represent states, measurements and measurement outcomes, respectively.\nWith an operational view, we naturally identify states\ns1 and s2 if there are no physical differences between\nthem. In our case, the only method to compare physical properties of states is to observe probabilities given\nthrough possible measurements. Thus we may assume\nthe following:\n[P2-1] (Separation Principles for States) States s1 and\ns2 are identified iff Pr{M = mi |s1 } = Pr{M = mi |s2 }\nfor any measurement M and measurement outcome mi .\nIndeed, the preliminary notion of \"state\" in an operational view is defined by a preparation of experimental\ninstruments (settings). Then, a state is defined by the\nequivalence class among all the \"states\" having the same\nphysical properties, which in our case are the probability\ndistributions among possible measurements. Therefore,\none may interpret [P2-1] as one aspect of a natural definition of states.\nThe similar argument follows for measurements.\nNamely, we identify measurements if there are no physical differences among them under any states. It is also\nconvenient to drop the information of measurement outcome mi by identifying them just as an ith outcome. By\ndoing so, we denote by Pr{M = i|s} := Pr{M = mi |s}\nthe probability to get ith outcome when performing a\nmeasurement M under a state s. Thus we identify nvalued measurements M and M ′ irrespective of the set\nof outcome if their statistical properties are identical for\neach outcome. Therefore, we assume the following:\n[P2-2] (Separation Principles for Measurements) Measurements M1 and M2 with the same number of outcomes\nare identified iff Pr{M1 = i|s} = Pr{M2 = i|s} for any i\nand state s.\nIt is operationally natural to allow a probabilistic mixture of states as one of the procedures to prepare states.\nNamely, if states s1 and s2 can be prepared, a preparation\nof state s1 with probability p and state s2 with probability 1−p can also be prepared. With this preparation, the\nprobability for any measurement should satisfy the mixing property due to the union rule of the probability and\nthe definition of the conditional probability. Formally,\nwe thus assume the following:\n[P3-1] (Mixing Principle for States) For any state s1 ,\ns2 and for any p ∈ [0, 1], there exists a state s satisfying\nPr{M = i|s} = pPr{M = i|s1 } + (1 − p)Pr{M = i|s2 }\nfor any measurement M and i.\nOf course, we implicitly suppose that the above state\ns can be prepared as a probabilistic mixture of s1 and s2\nwith probabilities p and 1 − p. From [P2-1], it is uniquely\ndetermined with given s1 , s2 and p, and is denoted by s =\nhp; s1 , s2 i [14]. Note that the trivial mixtures s = hp; s, si\nand s = h1; s, s′ i = h0; s′ , si follow for any state s, s′ and\np ∈ [0, 1]. A state is called a pure state iff there exist no\n\n\f3\nmeans to prepare it with nontrivial probabilistic mixture.\nNamely, s is a pure state iff s = hp; s1 , s2 i for states s1 , s2\nand p ∈ (0, 1) implies s1 = s2 . Otherwise, a state is called\na mixed state. In the following, we denote the set of all\nstates and pure states by S and Spure , respectively. S is\ncalled the state space.\nSimilarly, it is operationally legitimate to allow a probabilistic mixture of measurements: Namely, if n-valued\nmeasurements M1 and M2 can be performed, then a measurement to perform M1 with probability p and M2 with\nprobability 1 − p is also possible:\n[P3-2] (Mixing Principle for Measurements) For any nvalued measurement M1 , M2 , and for any p ∈ [0, 1] there\nexists an n-valued measurement M satisfying Pr{M =\ni|s} = pPr{M1 = i|s} + (1 − p)Pr{M2 = i|s} for any\ni = 1, . . . , n and state s.\nFrom [P2-2], the measurement M with given M1 , M2 , p\nin [P3-2] is uniquely determined up to arbitrary choice of\nmeasurement outcomes.\nSo far, we have only assumed natural principles [P1][P3] resorting to no a priori mathematical structures.\nHowever, it turns out that states and measurements are\nrepresented by vectors in a real vector space as follows:\n[Representation 1] (i) A state is represented by a vector in a real vector space V such that a convex combination of states s1 and s2 with weight p represents the state\nhp; s1 , s2 i; Thus the state space S is a convex subset of V\nand pure states correspond to extreme points of S . (ii)\nAn n-valued measurement M is represented\nby an n-tuple\nP\nof effects (ei )ni=1 on S such that i ei = u, meaning that\nei (s) is the probability to get ith outcome when performing the measurement M under a state s.\nRemind the following mathematical terminologies: a\nsubset W in a real vector space is called a convex subset\niff it is closed under any convex combinations. A vector\nw ∈ W is called an extreme point iff w has no non-trivial\nconvex decompositions in W , i.e., w = pw1 +(1−p)w2 for\nsome w1 , w2 ∈ W and p ∈ (0, 1) implies w = w1 = w2 . A\nreal functional f : W → R is called an affine functional\non W iff f (pw1 + (1 − p)w2 ) = pf (w1 ) + (1 − p)f (w2 ) for\nany w1 , w2 ∈ W and p ∈ [0, 1]. An affine functional e on\nW is called an effect on W iff the range is in [0, 1]. The\nunit effect and the zero effect, denoted by u and 0, are\neffects defined by u(s) = 1, 0(s) = 0 for all s ∈ W . For\nthe readers' convenience, we present the precise proof of\nRepresentation 1 in Appendix A (See Theorem 9).\nNotice that a representation of states and measurements is of course not unique. GPTs with state representations S ⊂ V and S ′ ⊂ V ′ in real vector spaces V, V ′\nare equivalent (hereafter affine isomorphic) iff there exists an affine bijection Λ : S → S ′ such that the correspondent of measurement M = (ei )ni=1 on S is given by\nM ′ = (ei ◦ Λ−1 )ni=1 on S ′ . In particular, if the (affine) dimension of S is finite, one may represent states as vectors\nin an Euclidean space.\nIn the following, we use the Representation 1 and let\nS be a state space of a vector representation as above.\nWe denote by A(S ) and E (S ) (or simply A and E ) the\n\nsets of all the affine functionals and effects on S . It is\neasy to show that A(S ) is a real vector space with pointwise sum and multiplication and E (S ) is a convex subset\nof A(S ). An extreme point of E (S ) is called a decision\neffect (or a pure effect) [4, 19].\nNotice that, while any measurement M is represented\nP\nby an n-tuples (ei )ni=1 of effects on S satisfying i ei = u,\nthe opposite might not hold in general. However, as it\nis satisfied in both classical and quantum systems (see\nSec. II B), in this paper we assume the following postulate:\n[P4] Given a state space S , any mathematically welldefined measurement on S is feasible.\nNamely, for any\nP\nn-tuples of effects (ei )ni=1 with\ni ei = u, there exists\nthe corresponding measurement M such that M is represented by (ei )i .\nWith this condition, it turns out that only one has\nto specify is the state space of GPT, since then feasible\nmeasurements are automatically given by effects on S .\nIn this paper, we assume [P1-P4] as basic principles for\noperationally well-defined probabilistic models.\nNext, we explain that a natural topology is introduced\ninto a state space. Note that any physical measurements\nare accompanied by a finite (even small) error. Thus, it\nis operationally natural to say that states s1 and s2 are\nclose iff for arbitrary but finite numbers of measurements\nthe probabilities by measuring them under s1 and s2 are\nwithin an arbitrary small error. This defines the so-called\nphysical topology [13]. With this natural topology, we can\ngo further from the Representation 1:\n[Representation 2] A state is represented by a vector\nin a locally convex Hausdorff topological vector space V\nsuch that the topology is given by the physical topology\nand - without loss of generality - the state space is a\ncompact convex subset of V . In particular, if dim(S ) =:\nd < ∞, a state is represented by a vector in Rd such that\nthe physical topology is the Euclidean topology and S is a\ncompact (i.e., closed and bounded) convex subset in Rd .\nNote thatPdim S is the dimension\nPof the affine hull\nAff(S ) := { i λi si | wi ∈ S , λi ∈ R, i λi = 1}. We refer [22] for a (locally convex Hausdorff) topological vector space V . Remind that if V is finite dimensional,\nthen the topology is unique. Thus, if V = Rd , then\nthe unique topology is given by the Euclidean topology\nof Rd . Any non-empty compact convex subset W of V\nhas the non-empty set of extreme points of W and is the\nclosed convex hull of extreme points (Krein-Milman Theorem). In finite dimensional case, any vector w ∈ W has\na convex decomposition\nwith finite numbers of extreme\nPm\npoints: w = i=1 pi wi with extreme points {wi }i and\na probability distribution (pi )m\ni=1 (see, for instance, Theorem 5.6 in [23]). Therefore, in any GPTs, there exist\nenough pure states so that S is a closed convex hull of\nSpure . Physically speaking, any state s is approximately\n(in the sense of the physical topology) prepared with a\nprobabilistic mixture of finite numbers of pure states. If\ndim Aff(S ) < ∞, any state s is exactly prepared with\na probabilistic mixture of finite numbers of pure states\n\n\f4\n(hereafter, a pure-state decomposition). For the readers'\nconvenience, Representation 2 is explained in details in\nthe case of finite dimension in Appendix B. Indeed, one\ncan introduce a natural norm on V and all the topological\nissues can be described with this norm in the finite dimensional case. (See [13] and [18] for infinite dimensional\ncases.)\nIn the following, we restrict ourselves to finite dimensional GPTs where the state space S is embedded into\na finite dimensional vector space V . For the underlying\nvector space, we assume without loss of generality V :=\nAff(S ). In particular, one can assume S to be a compact\n(i.e., closed and bounded) convex subset in a Euclidean\nspace Rd noting that the Euclidean topology coincides\nwith the physical topology.\nNotice that, for any state s, one can define an affine\nfunctional Λs : E → [0, 1] by\nΛs (e) := e(s) (∀e ∈ E ),\nwhich satisfies Λs (u) = 1 and Λs (0) = 0. From [P2-1],\nwe have Λs1 = Λs2 iff s1 = s2 . Therefore, a state is represented by an affine functional Λ : E → [0, 1] satisfying\nΛ(u) = 1 and Λ(0) = 0. (Indeed, in Appendix A, a vector representation of states is introduced in this way.) It\nis interesting to notice that the converse is also true:\nTheorem 1 Let Λ be an affine functional on E = E (S )\nsuch that Λ(e) ∈ [0, 1] for any e ∈ E and Λ(u) = 1, Λ(0) =\n0. Then, there exists the unique state s ∈ S such that\nΛ(e) = e(s) for any e ∈ E .\n(The proof of this theorem is given in Appendix D.)\nTherefore, one can identify states and affine functionals\non E satisfying the above properties. In the following, we\nomit the symbol Λs and just write\ns(e) = e(s),\n\n(2)\n\nmeaning that s(e) := Λs (e).\nTo complete the framework of GPTs, one still needs\nanother important notions of transformation (dynamics),\nmeasurement process [24], and especially composition of\nsystems. In this paper, we consider GPTs only from\nthe viewpoints of states and measurements by considering how physical principles posed only on states and\nmeasurements can narrow down GPTs. This means, of\ncourse, that there remains a freedom to further specify\nGPTs by using another principles on dynamcis, composition of systems, etc. [8–10].\nB.\n\nExamples of GPTs\n\nThe typical examples of GPTs are Classical Probability Theory and QM. Here, we briefly review the finite\ncases for classical theory and QM:\n[Example 1] (Finite Classical Probability Theory) A\nstate of a finite classical probability theory is described\nby a probability distribution p = (p1 , . . . , pc ) on a sample\n\nspace Ωc = {ω1 , ω2 , . . . , ωc }, and the state\nP space is given\nby Scl := {p = (p1 , . . . , pc ) | pi ≥ 0, i pi = 1} ⊂ Rc .\nThere exist c numbers of pure states (vertices): p(1) =\n(1, 0, . . . , 0), . . . , p(c) = (0, . . . , 0, 1). Geometrically Scl is\nthe c − 1 dimensional (standard) simplex. [39].\nAny classical state p = (p1 , . . . , pc ) ∈ P\nScl has the\nc\nunique decomposition into pure states: p = j=1 pj p(j) ,\nand it is convenient to represent an effect e by c dic\n(j)\nmensional vector\nP (x1 , . . . , xc ) ∈ [0, 1] by xi := e(p )\nwith e(p) =\nj pj xj . We write e ≃ (x1 , . . . , xc ) in\nthis case. Note that u ≃ (1, . . . , 1) and 0 ≃ (0, . . . , 0).\nIt is easy to see that E (Scl ) =: Ecl ≃ [0, 1]c , so\nthere are 2c decision effects (i.e., extreme points of Ecl ):\nei1 i2 ***ic ≃ (i1 , i2 , . . . , ic ) where i1 , . . . , ic = 0, 1. Any\nmeasurement M = (ei )ni=1 is represented by n vectors\nP (i)\n(i)\n(i)\n= 1.\nei ≃ (x1 , . . . , xc ) ∈ [0, 1]c such that\nj xj\nTypical measurement is given by that of random variable\n:=\nP1c, . . . , mn } where Pr{f = mi |p}\nP f : Ωc → {m\nc\nj;mi =f (j) pj =\ni=1 δmi f (j) pj . Since (δmi f (j) )j=1 is\none of decision effects, a measurement of random variable corresponds to a measurement with respect to decision effects.\nNote that any c-simplex is affine isomorphic to the cdimensional standard simplex. Therefore, any GPT with\nsimplex-state space is a classical system.\n[Example 2] (Finite Quantum Mechanics) A state of a\nfinite QM is represented by a density operator ρ (a positive operator with unit trace, denoted as ρ ≥ 0 and\ntr ρ = 1) on a c dimensional Hilbert space Hc . The\nstate space is thus given by Sq := {ρ ∈ L(Hc ) | ρ ≥\n0, tr ρ = 1} ⊂ L(Hc )h , where L(Hc ) (L(Hc )h ) is the\nset of all the linear (Hermitian) operators on Hc . Pure\nstates correspond to the one dimensional projection operators, i.e., ρ = |ψihψ| with unit vector ψ ∈ Hc . A\nquantum effect e is usually represented by a positive operator P\nE ∈ L(Hc ) such that e(ρ) = tr(Eρ) given by\nc\nE :=\ni,j=1 ẽ(|ψi ihψj |)|ψj ihψi | with an arbitrary orthonormal basis {ψi }ci=1 of Hc , where ẽ is a linear extension of e to L(Hc ) (See Appendix C). Note that the\nunit and zero effects u, 0 correspond to the unit and zero\noperators I and 0, respectively. It is easy to see that\nEq := E (Sq ) ≃ L(Hc )povm := {E ∈ L(Hc )|0 ≤ E ≤ I},\nthe element of which is called a POVM (positive operator valued measure) element. Thus, any measurement\nM = (ei )ni=1 is represented by n-tuple of\nelePPOVM\nn\nments ei ≃ Ei ∈ L(Hc )povm such that\ni=1 Ei = I,\nwhich is called a (discrete) POVM. The decision effects\ncorrespond to projection operators.\nThe most elementary quantum system is a qubit system with 2 dimensional Hilbert space H2 . For a qubit\nsystem, the Bloch vector b = (b1 , b2 , b3 ) ∈ R3 , defined by\nSq ∋ ρ 7→ bi = tr(σi ρ) (i = 1, 2, 3), gives a useful state\nrepresentation. (Here, σi (i = 1, 2, 3) are Pauli spin matrices). Remind that thePstate space is then given by a\nunit ball B := {b ∈ R3 | i b2i = 1} ⊂ R3 [25].\nNotice again that both classical and quantum theories\nsatisfy [P4], i.e., any mathematically well-defined mea-\n\n\f5\nsurement corresponds to a feasible measurement by admitting the so-called indirect measurement [40].\n\nIII.\n\nADDITIONAL PRINCIPLES\n\nIn the previous section, GPTs are explained as operationally well-defined probability models based on natural\nprinciples [P1]-[P4]. In this section, we further consider\nadditional two principles of [P5] physical equivalence of\npure states and [P6] decomposability with distinguishable\npure states.\n\nA.\n\nPhysical Equivalence of Pure States\n\nIntuitively, it seems natural to assume that all the pure\nstates are physically equivalent, i.e., there are no physically exceptional pure states in nature due to its symmetry. This would be acceptable if one reminds both\nclassical and quantum cases, where in both cases there\nare no structural differences in the set of pure states.\n(For instance, consider a one dimensional classical particle, where the set of pure states is the phase space R2\nof the position and the momentum. Obviously, there are\nno exceptional points in R2 . Also in quantum systems,\nthere are no exceptional vectors (pure states) in Hilbert\nspace.) As this argument yet resorts to a rough intuition,\nwe consider here what we exactly mean by the physically\nequivalence of states with an operational view point of\nmeasurements.\nFirst of all, we would like to express that states s1 , s2 ∈\nS are physically equivalent if there are no different physical structures on s1 and s2 through measurements. This\nwould be naturally characterized by saying the following:\nFor any measurement E = (ei )ni=1 , there uniquely exists\nthe corresponding measurement F = (fi )ni=1 such that\nthe probability distributions on s1 by E and s2 by F are\nthe same: ei (s1 ) = fi (s2 ); Next, this correspondence of\nthe measurements should preserve the affine structures\nfor a convex combination of measurements. Indeed, one\ncan perform a convex combination of measurements by\na probabilistic mixture of each measurement. Therefore,\nthe corresponding measurement of a convex combination\nof E and E ′ should also be performed by the probabilistic\nmixture of F and F ′ (the corresponding measurements\nof E and E ′ ) with the same weight. Finally, the correspondent of the trivial measurement (u) (i.e., 1-valued\nmeasurement) should be again the trivial measurement\n(u). From these considerations (in particular for yesno measurements), we can give the formal definition of\nstate-equivalence as follows:\nDefinition 1 (Physical Equivalence of States) We say\nthat state s1 is physically equivalent to state s2 if there\nexists a unit-preserving affine bijection Φ : E → E such\nthat e(s1 ) = Φ(e)(s2 ) for any e ∈ E .\n\nWe denote by s1 ≃ s2 iff s1 is physically equivalent to\ns2 . It is easy to see that ≃ is an equivalence relation: (i)\ns ≃ s, (ii) s1 ≃ s2 ⇒ s2 ≃ s1 and (iii) s1 ≃ s2 , s2 ≃ s3 ⇒\ns1 ≃ s3 for any s, s1 , s2 , s3 ∈ S . (Use identity map on\nE , an inverse map and composition of maps on E as the\nabove map Φ):\nProposition 1 Physical equivalence ≃ is an equivalence\nrelation.\nBased on this operationally motivated definition, we consider the following principle:\n[P5] (Physical Equivalence of Pure States) Any pure\nstates s1 and s2 are physically equivalent.\nThe following result gives an equivalent characterization of the physical equivalence in terms of the structure\nof state space:\nTheorem 2 States s1 and s2 are physically equivalent\niff there exists an affine bijection Ψ : S → S such that\ns1 = Ψ(s2 ).\nTo prove this theorem, we start from the following fact\non effects: The set of effect E = E (S ) has a natural order\nrelation defined by\ne ≥ f ⇔ e(s) ≥ f (s) ∀s ∈ S\nfor effects e, f ∈ E . Note that u and 0 are maximum and\nminimum effects.\nLemma 1 Let Φ : E → E be an affine bijection. Then\nthe following three conditions are equivalent:\n1. Φ(0) = 0\n2. If e, f ∈ E and e ≤ f , then Φ(e) ≤ Φ(f )\n3. Φ(u) = u\n(The proof is given in Appendix D. This lemma is used\njust for justifying that we have assumed in Definition 1\nonly the latter one of the two conditions Φ(0) = 0 and\nΦ(u) = u.)\nNow we introduce the dual maps of affine bijections on\nand\nE\nS , respectively.\nFirst, let Φ : E → E be an affine bijection on E such\nthat Φ(u) = u (and thus Φ(0) = 0 from Lemma 1). Then,\nthe dual map Φ∗ : S → S on S is defined by\nΦ∗ (s)(e) := s(Φ(e)) (∀s ∈ S , e ∈ E ).\n\n(3)\n\n(See Eq. (2) for the notation.) We notice that Eq. (3)\nfor fixed s ∈ S defines an affine functional on E satisfying conditions in Theorem 1. To see this, let Λ := Φ∗ (s).\nFor any λ ∈ [0, 1], e1 , e2 ∈ E , we have Λ(λe1 +(1−λ)e2 ) =\ns(Φ(λe1 + (1 − λ)e2 )) = s(λΦ(e1 ) + (1 − λ)Φ(e2 )) =\nλs(Φ(e1 )) + (1 − λ)s(Φ(e2 )) = λΛ(e1 ) + (1 − λ)Λ(e2 ), and\nthus Λ is an affine functional on E . Since s(e) ∈ [0, 1] for\nany e ∈ E , the range of Λ is in [0, 1]. Finally, Λ(u) =\ns(Φ(u)) = s(u) = 1 and Λ(0) = s(Φ(0)) = s(0) = 0.\nThus Φ∗ is a well-defined map on S from Theorem 1.\nNotice that, for any λ ∈ [0, 1], s1 , s2 ∈ S , one has\nΦ∗ (λs1 + (1 − λ)s2 )(e) = (λs1 + (1 − λ)s2 )Φ(e) =\n\n\f6\n(λΦ∗ (s1 ) + (1 − λ)Φ∗ (s2 ))(e) (∀e ∈ E ), hence Φ∗ is affine\non S . Let Φ∗ (s1 ) = Φ∗ (s2 ) for some states s1 , s2 ∈ S .\nThen, since f := Φ−1 (e) ∈ E for any e ∈ E , we have\ns1 (e) = s1 (Φ(Φ−1 (e))) = Φ∗ (s1 )(f ) = Φ∗ (s2 )(f ) =\ns2 (Φ(Φ−1 (e))) = s2 (e). Therefore, from the separation\nhypothesis for states, we have s1 = s2 , i.e., Φ∗ is injective\n(one-to-one). Notice that Φ−1 is also an affine bijection\non E such that Φ−1 (u) = u and Φ−1 (0) = 0. For an\narbitrary s ∈ S , define t := (Φ−1 )∗ (s) ∈ S , and it follows\nthat for any e ∈ E\nΦ∗ (t)(e) = t(Φ(e)) = s(Φ−1 (Φ(e))) = s(e),\nand again from the separation hypothesis for states, we\nhave s = Φ∗ (t). Therefore, Φ∗ is surjective, hence an\naffine bijection on S .\nOn the other hand, the dual map of the affine bijection\nΨ : S → S is easily defined by\nΨ∗ (e)(s) := e(Ψ(s)) (∀e ∈ E , s ∈ S ).\n\n(4)\n\nSince the above defined Ψ∗ (e) is obviously an affine functional on S to [0, 1], Ψ∗ (e) is an effect. It is easy to see\nthat Ψ∗ is bijective on E and satisfies Ψ∗ (u) = u (and\nΨ∗ (0) = 0).\nFinally, it is also easy to see that both dual maps on\nE and S satisfy (Φ∗ )∗ = Φ and (Ψ∗ )∗ = Ψ from the\ndefinitions. To sum up, we have obtained\nProposition 2 (i) For any affine bijection Φ : E → E\nsuch that Φ(u) = u (and thus Φ(0) = 0), the dual map\nΦ∗ : S → S is well-defined by Eq. (3) and is affine bijective. (ii) For any affine bijection Ψ : S → S , the dual\nmap Ψ∗ is well-defined by Eq. (4) and is affine bijective\nsatisfying Ψ∗ (u) = u (and thus Ψ∗ (0) = 0). (iii) For both\nbijections, (Φ∗ )∗ = Φ and (Ψ∗ )∗ = Ψ.\nNow we can give the proof of Theorem 2:\n[Proof of Theorem 2] Let s1 , s2 be physically equivalent, i.e., there exists a bijective affine Φ : E → E such\nthat e(s1 ) = Φ(e)(s2 ) for any e ∈ E and Φ(u) = u (and\nthus Φ(0) = 0 from Lemma 1). From Proposition 2 (i),\nΨ := Φ∗ gives an affine bijection on S . From Eq. (3), we\nhave Ψ(s2 )(e) = s2 (Φ(e)) = Φ(e)(s2 ) = e(s1 ) = s1 (e) for\nany e ∈ E , and thus s1 = Ψ(s2 ).\nConversely, assume that there exists an affine bijection\nΨ : S → S such that s1 = Ψ(s2 ). Then, from Proposition\n2 (ii), the dual map Φ := Ψ∗ is an affine bijection on E\nsatisfying that Φ(e)(s2 ) = Ψ∗ (e)(s2 ) = e(Ψ(s2 )) = e(s1 )\nand Φ(u) = u. Therefore, states s1 , s2 are physically\nequivalent.\n\u0004\nFrom Theorem 2, [P5] is equivalently rephrased as follows:\n[P5']For any given pure states s1 , s2 ∈ S , there exists\na bijective affine map Ψ on S such that s2 = Ψ(s1 ).\nIn [19], we introduced the principle of equality of pure\nstates intuitively meaning [P5] but have used [P5'] as its\nformal definition. Theorem 2 establishes its operational\nmeaning as an equivalence of pure states. Some authors\n\n[8–10] also have used [P5'] meaning that there are reversible transformations (dynamics) which connects any\npure states. Thus, we have shown the equivalence of two\nsuperficially different physical principles.\nOn the other hand, from the mathematical and physical interests, Davies [26] have investigated the following\ncondition:\n[P5\"] The group of affine bijections on S acts transitively on the set of extreme points of S .\nIt turns out that [P5], [P5'], and [P5\"] are all equivalent: To see this, let Ab (S , S ) be the set of affine bijections on S . One can show that Ab (S , S ) forms a compact\ngroup which acts continuously on S [26]. Note that an\naffine bijection on S maps a pure state to a pure state\n[41]. Therefore, it is straightforward that [P5'] holds\niff affine bijections on S acts transitively on Spure , i.e.,\nSpure = {Ψ(s) | Ψ ∈ Ab (S , S )} with arbitrary reference\npure state s ∈ Spure .\nIn the following, we prefer to interpret the above equivalent conditions as a physical equivalence among any\npure states [P5]. Indeed, as is the case for any basic\nphysical theories so far, a symmetry is one of the key\nfactor to understand our world, and [P5] enables us to\ninterpret, without appealing to dynamics, that there exists an operationally motivated symmetry in the set of\npure states. Of course, this is a matter of taste, and the\nfollowing argument follows for those who prefer [P5'] or\n[P5\"]. However, following Davies, we call GPTs satisfying [P5] (or equivalently [P5'] or [P5\"]) symmetric GPTs.\n\n1.\n\nExamples of Symmetric GPTs\n\nBoth classical theory and QM are symmetric GPTs.\nIndeed, for any pure states p(μ) , p(ν) ∈ Scl with some\nμ, ν = 1, . . . , d, let Ψ be a map on Scl defined by\n[Ψ(p)]μ = pν , [Ψ(p)]ν = pμ and [Ψ(p)]i = pi (i 6=\nμ, ν). Obviously Ψ is an affine bijection on Scl satisfying\nΨ(pμ ) = pν . In quantum system, for any pure states\nρ1 := |ψ1 ihψ1 |, ρ2 := |ψ2 ihψ2 | ∈ Sq , one can easily find a\nunitary operator U : Hd → Hd such that U ψ2 = ψ1 [42].\nThen it is easy to see that Ψ(ρ) := U ρU † is an affine\nbijection on Sq satisfying ρ1 = Ψ(ρ2 ).\nAnother simple example of symmetric GPTs are\ncuboid systems [27]:\n[Example 3] (Cuboid Systems) We call GPTs cuboid systems if the state spaces are represented by hypercubes:\nScube := {x ∈ Rd | 0 ≤ xi ≤ 1 (i = 1, . . . , d)}.\nThere are 2d pure states (vertices): x(i1 ,i2 ,...,id ) :=\n(i1 , i2 , . . . , id ) (i1 , . . . , id = 0, 1).\nIt is easy to see that the cuboid system Scube is also\nsymmetric. In general, any isogonal figure is symmetric\nfrom the definition:\n[Example 4] (Systems with Isogonal Figures) A polytope\nin Euclidean space is said to be isogonal iff for any vertices there exists an isometrical map which surjectively\nconnects them [28]. (Notice that any isometrical map on\nEnclidean space is automatically affine.) Therefore, any\n\n\f7\nGPTs with state space being isogonal figure are symmetric.\n\nwith polytope state space, where the set of pure states is\n{s1 , . . . , sn }, we have\nn\n\n2.\n\nsM =\n\nInvariant States\n\nIn this section, we discuss an invariant state (the maximal mixed state) in GPTs.\nIn general GPTs, the existence of an invariant state\nwith respect to all the bijective affine maps on S can be\nshown based on Ryll-Rardzewski fixed point theorem.\nTheorem 3 For any GPT, there exists an invariant\nstate sinv ∈ S with respect to all the bijective affine maps\non S .\n[Proof ] We refer to [29, 30] for Ryll-Rardzewski fixed\npoint theorem. Using the norm in Appendix B, the underlying vector space V of S is a Banach space w.r.t.\nthe sup-norm and S is a compact convex subset of V .\nSince we assumed dim V < ∞, all topologies in the RyllNardzewski theorem are equivalent to the norm topology.\nLet G = Ab (S , S ) be the set of all the bijective affine\nmaps on S . Then, it is easy to show that G is a semigroup\nof (weakly) continuous affine maps of S . In particular,\nG is noncontractive on S , since the norm || * || satisfies\ninf Φ∈G ||Φ(s1 ) − Φ(s2 )|| = ||s1 − s2 || > 0 (∀s1 6= s2 ∈ S )\nfrom Lemma 4 in Appendix B. Applying the RyllNardzewski theorem, the assertion of the theorem holds.\n\u0004\nIn general GPT, an invariant state is not necessarily\nunique. (For instance, consider a GPT with the state\nspace being a circular sector S = {(r cos θ, r sin θ)|0 ≤\nr ≤ 1, 0 ≤ θ ≤ π2 }. Then, there are only two affine bijections on S : the identity map and the reflection map with\nrespect to the 45 degree axis. Then, all the states on the\naxis are invariant under these maps.) However, in a symmetric GPT, the unique invariant state is determined.\nTheorem 4 In a symmetric GPT, an invariant state is\nunique.\n[Proof ] Assume that there exist distinct invariant states\ns1 , s2 on S . Then, any state of the form ps1 + (1 − p)s2 ∈\nS for any p ∈ R is invariant under any bijective affine\nΨ : S → S (See Lemma 5 in Appendix C). In particular,\nthere exists such state s3 on a boundary of S . Let H ⊂ V\nbe\nPnthe supporting hyperplane of S on s3 and let s3 =\ni=0 pi ti (pi > 0) (n ∈ N) be a convex decomposition of\ns3 with respect to pure states {ti }. Then, since s3 ∈ H\nand H is a supporting hyperplane of S , we have ti ∈ H∩S\nfor every ti . Notice that there exists a pure state s0 ∈ S\nnot in H. (Otherwise, S ⊂ H.) Since S is symmetric,\nthere exists an affine bijective map Ψ which\nPn connects t0\nand s0 : sP\n=\nf\n(t\n).\nHowever,\nwe\nhave\n0\n0\ni=0 pi ti = s3 =\nn\nf (s3 ) =\np\nf\n(t\n)\n=\np\ns\n+\np\nf\n(t\n)\n*\ni\n0 0\n1\n1 * * , and this is\ni=0 i\ncontradictory.\n\u0004\nIn the following, sM denotes an invariant state, which\nis uniquely determined for symmetric GPTs. For a GPT\n\n1X\nsi .\nn i=1\n\n(5)\n\nIndeed, as any bijective affine Φ on S maps any pure state\nto a pure state, Φ just permutes P\nfinite numbers of pure\nn\nstates, and we have Φ(sM ) = n1 i=1 Φ(si ) = sM . In\nparticular, in classical system, sM is the uniform distribution on Ω: sM = (1/d, . . . , 1/d). For cuboid systems,\nwe have sM = (1/2, 1/2, . . . , 1/2), i.e., the center of Scube .\nIn the case of finite quantum systems, notice that bijective affine map on Sq is unitary map or anti-unitary map\non the density operators [31]. Therefore, the maximally\nmixed state\nsM =\n\n1\nI\nd\n\nis the unique invariant state.\nIn general, the construction [26] of sM is given by the\ntwo-sided Haar measure [32]: Using the two-sided Haar\nmeasure on the set G of all the affine bijection on S , we\nhave\nZ\nΨ(s0 )dμ(Ψ),\n(6)\nsM =\nG\n\nwhere s0 ∈ S is an arbitrary reference state (See also\n[33] for the mathematical details). Indeed, the unique\nexistence of the invariant states of Symmetric GPTs is\nfirst shown by Davies [26] by means of the Haar measure.\nNote that an operationally natural entropy in general\nGPTs is defined by\nS(s) :=\n\ninf\n\nM=(mj )j ∈Mind\n\nH(mj (s)),\n\n(7)\n\nP\nwhere H(pj ) := − j pj log2 pj is the Shannon entropy\nand the infimum is taken over the set Mind of all the\nindecomposable measurements [19, 34]. S is concave on\nS , generalizing Shannon and von Neumann entropies in\nclassical and quantum systems, respectively. In a symmetric GPT, S takes minimum value 0 on pure states,\nand thus S provides a proper measure of mixedness [19].\nTherefore, the following proposition implies that we may\ncall sM the maximal mixed state in general (symmetric)\nGPT.\nProposition 3 In any GPT, the entropy S takes the\nmaximal value on an invariant state.\n[Proof ] Notice that for a bijective affine Ψ on S and\nindecomposable measurement M = (mj )j , (mj ◦ Ψ)j is\nan indecomposable measurement [19]. Thus, we have\nS(Ψ(s)) = S(s) for any state s. Then, from the concavity of S, for any state s, the invariant state sM obtained\nby (6) from the reference state s0 := s satisfies\nZ\nZ\nS(sM ) ≥\nS(Ψ(s))dμ(Ψ) =\nS(s)dμ(Ψ) = S(s).\nG\n\nG\n\n\f8\n\u0004\nThe next result shows a global picture of a state space\nS in symmetric GPT. Let D be a distance function which\nhave the monotonicity properties under affine bijection\non S , i.e., for any states s1 , s2 ∈ S and any affine bijection Ψ : S → S , D(s1 , s2 ) ≥ D(Ψ(s1 ), Ψ(s2 )). The typical example is given by the Kolmogorov distance (See\nAppendix B).\nProposition 4 In symmetric GPTs, for any distance\nfunction D on S with the monotonicity property, the distances between sM and arbitrary pure states are constant.\nNamely, for any pure states s1 , s2 ,\nD(s1 , sM ) = D(s2 , sM )\n\n(8)\n\n[Proof ] From the symmetry of S , there exists an affine\nbijection Ψ on S such that s1 = Ψ(s2 ). From the monotonicity of D and the invariance of sM , we have\nD(s1 , sM ) = D(Ψ(s2 ), Ψ(sM )) ≤ D(s2 , sM ).\nThe opposite inequality follows by a symmetric argument.\n\u0004\nGeometrically speaking, all the pure states of symmetric GPTs lie on the sphere with respect to the distance\nwith the monotonicity property, e.g. Kolmogorov distance. In the case of Kolmogorov distance (B2), physical\nmeaning of (8) is that the optimal success probability to\ndistinguish between the invariant state sM and any pure\nstate s is constant on s (See Eq. (B2) in Appendix B).\n\nTheorem 5 The state space S of symmetric GPTs with\ndim(Aff S ) = 2 is either an isogonal figure or a unit disk.\nTheorem 6 The state space S of symmetric GPTs with\ndim(Aff S ) = 3 is any one of an isogonal figure, a circular\ncylinder, or a unit disk (ball).\nB.\n\nDecomposability of states with distinguishable\npure states\n\nIn this section, we consider another principle of the\ndecomposability of states with respect to distinguishable\npure states.\nRemind that states {s1 , . . . , sn } are said to be distinguishable if they can be distinguishable with probability\n1 in a single shot measurement; namely if there exists a\nmeasurement M = (ei )ni=1 such that ei (sj ) = δij for any\ni, j = 1, . . . , n. The maximum number of distinguishable\nstates is an important parameter to characterize GPTs,\nand is denoted as c. In classical systems, c is the number\n(cardinality) of the sample space Ωc , while in quantum\nsystems it is the dimension of the corresponding Hilbert\nspace Hc . In general GPT, c has the following upper\nbound:\nProposition 6 In GPT with state space S , we have\nc ≤ dim(S ) + 1.\n\n(9)\n\nThe equality holds iff S is a simplex.\nTo see this, observe the following lemma:\n\n3.\n\nClassification of Symmetric GPTs\n\nNow we proceed to the classification theorem of Symmetric GPTs. First, remind that without loss of generality, S is a compact subset of Rd , and by the parallel\nshift, we can assume the invariant state sM of G to be\nthe origin of Rd .\nUsing the Haar measure on the set of G of all the affine\nbijection on S , one\nR can define a G-invariant inner product by hx, yiG := G hΨx, Ψyidμ(Ψ) where the right-hand\nside is the Haar integral and hx, yi denotes the Euclidean\ninner product of x, y ∈ Rd . Then, using an orthonormal basis w.r.t. this G-invariant basis, we get to a new\nstate-representation in Rd such that Ψ ∈ G acts isometrically on states. Remind that, in Sec. III A 1(Example\n4), we have just illustrated symmetric GPTs with state\nspaces being isogonal figures, but now it earns the general symmetric GPTs if the numbers of pure states are\nfinite:\nProposition 5 The state space S of a symmetric GPT\nis either one of isogonal figures or with infinite pure\nstates.\nIn [33], we further obtain the following classification theorems of symmetric GPTs in 2 and 3 dimensional cases:\n\nLemma 2 A distinguishable set of states {s1 , . . . , sn } is\naffinely independent. Therefore, Conv{si } is an (n − 1)\ndimensional simplex.\nPn\nPn\n[Proof ] Let i=1 pi si = i=1 qi si be convex combinations of {si }i w.r.t. probability distributions (pi )i and\n(qi )i . Then, applying a measurement M = (ei )i which\ndistinguishes {si }i , we get pi = qi , and thus {si }i is\naffinely independent (See [39]).\n\u0004\n[Proof of Proposition 6] Let {s1 , . . . , sc } be a set of\ndistinguishable states. Then, from Lemma 2, Conv{si }\nis a (c − 1) dimensional simplex. As Conv{si } ⊂ S , we\nhave c − 1 ≤ dim(S ).\nLet the equality of Eq. (9) holds. Let d := dim(S ) and\nlet {s1 , . . . , sd+1 } be distinguishable states with a measurement M = (mj )d+1\nj=1 which distinguishes them. Note\nthat, from Lemma 2, Conv {si }d+1\ni=1 is a d-dimensional\nTo see\nsimplex. We show that S = Conv{si }d+1\ni=1 .\nthis, notice that the dimension of Aff {si }d+1\nis\nd and\ni=1\nd+1\nd+1\n{si }i=1 ⊂ S , and thus Aff {si }i=1 = Aff S . Therefore,\nP\nany s ∈ S can be written\nas s = d+1\ni=1 λi si with some\nP\nλ\n=\n1.\nApplying\nmi to s (See\nλi ∈ R satisfying\ni\ni\nLemma 5 in Appendix C), we obtain λi = mi (s) ≥ 0,\nand thus s ∈ Conv{si }d+1\ni=1 . Therefore, we have S ⊂\n.\nAs\ns\n∈\n, we obtain S = Conv{si }d+1\nConv{si }d+1\nS\ni\ni=1 .\ni=1\nNamely, S is d dimensional simplex.\n\u0004\n\n\f9\nIn both classical and quantum systems, any state is\nwritten as a convex combination of distinguishable pure\nstates. (Note that any classical state p = (p1 , . . . , pd ) has\nPd\nthe decomposition p = μ=1 pμ pμ , while any quantum\nP\nstate ρ has a decomposition ρ = ci=1 pi |ψi ihψi | as an\neigenvalue decomposition of ρ.) This property can be\nphysically phrased as following physical principle:\n[P6] (Decomposability with Distinguishable Pure\nStates) Any state can be prepared as a probabilistic mixture of distinguishable pure states.\nIt is interesting to consider GPTs satisfying this principle, which include both classical and quantum systems.\nWe notice that this property is derived from their axioms\nin [11].\nThe following result provides the general classification\nof such GPTs:\nTheorem 7 GPTs satisfying [P6] is either classical system or systems with infinite pure states.\nTo prove this, we use the following lemma:\nLemma 3 If S is a d dimensional polytope satisfying the\nprinciple [P6], then there exist d+1 distinguishable states.\n[Proof ] The case d = 0 is trivial. Let d ≥ 1. Let F be\nthe family of all subsets of S such that it is the convex\nhull of at most d pure states of S . Since S is a polytope,\nthe number of pure states is finite, therefore the size of\nF is also finite. Now each subset of S in F is at most\n(d−1)-dimensional,Stherefore its d-dimensional volume is\n0. Hence the union F of all (finitely many) members of\nF also has d-dimensional volume 0, while S has positive\nd-dimensional volume. This implies\nthat S contains a\nS\nstate s that does not belong to F . By the principle of\n[P6], s is a convex combination of distinguishable pure\nstates s1 , . . . , sk , and now k > d by the definition of F\nand s. Hence the claim holds.\n\u0004\n[Proof of Theorem 7] Let the number of pure states be\nfinite, i.e., S be a polytope. From Lemma 3, there exist\nd + 1 distinguishable states. Therefore, the equality of\nEq. (9) holds and thus from Proposition 6, S is simplex,\ni.e., a state space with a classical system.\n\u0004\nC.\n\nClassification of GPTs with [P5] and [P6]\n\nCombining the classifications of GPTs with [P5] and\n[P6], i.e., Theorem 5, Theorem 6 for [P5] and Theorem 7\nfor [P6], we obtain the following:\nTheorem 8 The state space S of GPTs satisfying [P5]\nand [P6] with dim S = 2, 3 is either simplex or unit disk.\nThis result implies that GPTs with principles [P5] and\n[P6] such that the state space is embedded in 2 or 3 dimensional real vector space is restricted to either classical\nsystem or quantum system (qubit).\nNotice that this does not hold in higher dimensional\nGPTs as quantum systems with more than or equal to 3\nlevel systems satisfy both [P5] and [P6] while the state\nspace is neither the simplex nor the ball [35].\n\nIV.\n\nCONCLUSION AND DISCUSSION\n\nIn this paper, after confirming our basis of general\nGPTs (namely, Principles [P1]-[P4]), we have introduced\nand investigated two physical principles [P5] (Physical\nEquivalence of Pure States) and [P6] (Decomposability\nwith Distinguishable Pure States). In particular, the former is established with the operationally motivated definition of physical equivalence of states, which turns out\nto be equivalent to the symmetric structure of the state\nspace (See Sec. III A). In each principle, we gave a classification of state spaces (Theorems 5, 6 for [P5] and 7)\nfor [P6]) and by combining them, we showed that GPTs\nwith 2 or 3 dimensional state spaces are either classical\nor quantum system (with the Bloch ball) (Theorem 8).\nNote that similar characterizations of the Bloch ball are\nderived in [8–11]. However, the definition of the Bloch\nball there is the state space of systems with at most two\ndistinguishable states, while our derivation does not assume the maximum number of distinguishable states. In\nthis paper, we focused on simple principles on states and\nmeasurements, and showed how each principle narrows\ndown GPTs close to classical and quantum systems. In\nnear future, we further consider other principles on especially correlations on composite systems, and discuss the\ncharacterization of QM by purely physical principles.\nAcknowledgment\nWe are grateful to Dr. Miyadera and Dr. Imafuku for\ntheir useful discussion. One of the authors (G.K.) would\nlike to thank Prof. D'Ariano, Dr. Chiribella, and Dr.\nPerinotti for their fruitful discussion and comments at\nNagoya Winter Workshop, 18-24 February (2010). This\nwork was partially supported by Grant-in-Aid for Young\nScientists (B) (No.20700017 and No.22740079), The Ministry of Education, Culture, Sports, Science and Technology (MEXT), Japan.\nAppendix A\n\nIn this appendix, we give a proof of Representation 1\nwhich is formally described by the following Theorem:\nTheorem 9 Assume [P1]-[P3] and let S be the state\nspace. Then, there exist a real vector space V and a representation map ˆ : S → V such that (i) the map ˆ is injective (one-to-one) and hp;\\\ns1 , s2 i = psˆ1 +(1−p)sˆ2 ; (thus\nŜ is a convex subset of V and pure states correspond to\nextreme points of Ŝ ), and (ii) an n-valued measurement\nM is represented by an n-tuple of effects (ei )ni=1 on Ŝ\nsuch\nP that Pr{M = i|s} = ei (ŝ) for any s ∈ S (and thus\ni ei = u where u is the unit effect).\n[Proof ] We call a real functional f : S → R an \"affine\"\nfunctional iff f (hp; s1 , s2 i) = pf (s1 )+ (1 − p)f (s2 ) for any\ns1 , s2 ∈ S and p ∈ [0, 1]. Also an \"affine\" functional e on\nS is called an \"effect\" if the range is in [0, 1]. The unit\n\n\f10\n\"effect\" u is the effect such that u(s) = 1 for any s ∈ S .\nWe denote by A(S ) and E (S ) the set of all the \"affine\"\nfunctionals and \"effects\" on S . It is easy to see that\nA(S ) forms a real vector space with pointwise addition\nand scalar multiplication, while E (S ) is a convex subset\nof A(S ).\nLet M be an n-valued measurement. Then, the probability Pr{M = i|s} with a fixed i is considered as a map\nfrom S to [0, 1]:\ns ∈ S → ei (s) := Pr{M = i|s} (i = 1, . . . , n),\n\n(A1)\n\nwhich are clearly \"effects\" from [P3-1]. Remind that\nmeasurements are characterized only through probabilities from [P2-2]. Thus M is characterized by n-tuple\nof \"effects\" (ei )ni=1 where ei ∈ E (S ) is defined by (A1).\nFrom P\nthe normalization condition of the probability, we\nn\nIn the following, we denote by\nhave\ni=1 ei = u.\nM = (ei )ni=1 an n-valued measurement meaning that\nei (s) is the probability to get ith outcome when performing M under state s. Note that the part (ii) of Theorem\n9 is an easy consequence of this representation of measurements. (See the last part of this proof.)\nNext, let V be the set of all the affine functionals on\nE (S ) with bounded ranges. It is easy to see that V is\na real vector space with pointwise addition and scalar\nmultiplication. Now we define a state-representation map\nˆ: S → V by\nŝ(e) := e(s) (∀e ∈ E (S )).\n\n(A2)\n\nNote that ŝ is an affine functional on E (S ) by the definition, while the range of ŝ is bounded since 0 ≤ e(s) ≤ 1,\nthus ˆ maps any state to a vector in V . Let sˆ1 = sˆ2 for\ns1 , s2 ∈ S . Then e(s1 ) = sˆ1 (e) = sˆ2 (e) = e(s2 ) for any\n\"effect\" e. Therefore, for any measurement M = (ei )ni=1 ,\nPr{M = mi |s1 } = ei (s1 ) = ei (s2 ) = Pr{M = mi |s2 },\nwhich implies s1 = s2 from [P2-1]. Thus, ˆ is injective. From the \"affinity of effect\", hp;\\\ns1 , s2 i(e) =\ne(hp; s1 , s2 i) = pe(s1 ) + (1 − p)e(s2) = (psˆ1 + (1 − p)sˆ2)(e)\nfor any e ∈ E (S ). Thus, the state s = hp; s1 , s2 i is\nmapped to be a convex combination of sˆ1 and sˆ2 :\nhp;\\\ns1 , s2 i = psˆ1 + (1 − p)sˆ2 .\n\n(A3)\n\nNotice that from [P3-1] the set Ŝ := {ŝ ∈ V |s ∈ S },\nwhich is the state-space of this representation, is a convex\nsubset of V . It is straightforward from the definition that\npure states are mapped to extreme points of Ŝ , and vice\nversa. This completes the proof of part (i) of Theorem 9.\nFinally, letˇbe a representation map on E (S ) to the set\nof affine functionals on Ŝ defined by ě(ŝ) := e(s) (∀s ∈ S ).\nIt is easy to see the injectivity and the affinity of ˇ. Since\nthe range of ě for e ∈ E is in [0, 1], ě is an effect on Ŝ .\nTherefore, any n-valued measurement M is represented\nP\nby an n-tuple of effects (eˇi )ni=1 on Ŝ such that i eˇi is\nthe unit effect and Pr{M = i|s} = eˇi (ŝ) for any s ∈ S .\n\u0004\nThe representation symbols ˆ and ˇ are all omitted\nthroughout this paper except in the above proof.\n\nAppendix B: \"Physical Topology\" on State Space\n\nIn this appendix, we review a physical topology and\nshow Representation 2 in finite dimensional cases. For\nthe readers' convenience and mathematical simplicity, we\nexplain these using a Kolmogorov distance.\nRemind from Appendix A that each vector in V is a\nbounded affine functional on E (S ). Then, one can introduce a natural norm on V by\n||v|| := sup |v(e)|.\n\n(B1)\n\ne∈E\n\n(Notice that ||v|| < ∞ as v is a bounded functional on\nE ; it is clear that (i) ||v|| ≥ 0; (ii) ||v|| = 0 iff v = 0;\n(iii) ||αv|| = |α|||v||; (iv) ||v + w|| ≤ ||v|| + ||w|| for all\nv, w ∈ V and α ∈ R.) Notice that the norm of any state\ns is 1 as |e(s)| ≤ 1 for all e ∈ E and u(s) = 1. Thus, S\nlies on the unit sphere with respect to this norm. The\ninduced metric\nDkol (v, w) := ||v − w|| (v, w ∈ V )\nis called the Kolmogorov distance [36], since it is a\nstraightforward generalization of the Kolmogorov distance in classical systems. In QM, the norm and distance\nare the trace norm and trace distance. The Kolmogorov\ndistance on S has an operational meaning through the\nrelation\nDkol (s1 , s2 ) = 2P (s1 , s2 ) − 1,\n\n(B2)\n\nwhere P (s1 , s2 ) is the optimal success probability to distinguish states s1 and s2 which are prepared with probabilities 1/2 and 1/2 (see [19] and references therein).\nTherefore, the topology with respect to this norm has an\noperational meaning as states s1 and s2 are close w.r.t.\nthis norm iff the optimal success probability to distinguish them are close to 1/2.\nFrom (B2), state space S is bounded in V with this\nnorm as probabilities are in [0, 1]. In general, S might\nnot be closed. However, with a physical consideration, it\nturns out that without loss of generality one can assume\nS is closed. Indeed, even if there exists an \"imaginary\nstate\" v ∈ V in the closure of S which is not in S , there\nexists a state s ∈ S arbitrary close to v with this norm.\nNamely, for any small ε > 0, there exists a state s such\nthat |v(e) − s(e)| < ε for any e ∈ E . Thus, under the\npresence of an (arbitrary small but) finite error as always\nthe cases in the real experiments, it is impossible to (even\nstatistically) distinguish the \"imaginary state\" and state\ns through all the possible measurements. Therefore, it\nis a matter of taste to include or not every \"imaginary\nstates\" as states.\nTo sum up, one can assume that S is represented as\na closed and bounded convex subset of a normed space\nV . Note that, if dim V < ∞, compactness and closed\nboundedness are equivalent from the Heine-Borel Theorem for general normed space [37]. Moreover, in that\ncase, this topology is the same as the physical topology\n\n\f11\n[13] due to the uniqueness of the topology of the locally\nconvex Hausdorff topological vector space.\nWe note the monotonicity holds [19] for any affine map\nΨ on S :\n||Ψ(s)|| ≤ ||s||.\n\n(B3)\n\nand thus\n||Ψ(s1 ) − Ψ(s2 )|| ≤ ||s1 − s2 || (∀s1 , s2 ∈ S ).\n\n(B4)\n\nApplying this for an affine bijection on S , we get the\nfollowing:\nLemma 4 Any affine bijection Ψ on S preserves the\nKolmogorov distance:\n||Ψ(s1 ) − Ψ(s2 )|| = ||s1 − s2 ||.\nProof Apply (B4) for Ψ and Ψ−1 .\n\n\u0004\n\nAppendix C: Extension of affine maps\n\nLet V1 , V2 be real vector spaces and W be a convex\nsubset of V1 . Then, any affine map Λ : W → V2 has an\naffine extension to V1 . With some additional conditions,\nΛ is further extended to a linear map on V1 .\nIn this appendix, we present the proof of these facts for\nfinite dimensional cases [43]: Let dim V1 < ∞. Throughout this section, Λ is an affine map from W to V2 .\nLemma\n5 LetPwi ∈ W and λi ∈ R (i = 1, . . . , m) with\nP\nm\nλ\n=\n1.\nIf i=1 λi wi ∈ W , then\ni\ni\nm\nm\nX\nX\nλi Λ(wi ).\nλi wi ) =\nΛ(\n\n(C1)\n\ni=1\n\ni=1\n\nProof. Let C+ := {i = {1, . . . , m}|λ\nPm i ≥ 0} and C− :=\n{i = {1, . P\n. . , m}|λi < 0}.PSince i=1 λi = 1, it follows\nthat 1 + i∈C− |λi | =\ni∈C+ |λi |, and thus C+ 6= ∅,\nP\n|λ\n|\n=:\nλ\n≥\n1,\n|λ\n|\ni\ni ≤ λ for any i = 1, . . . , m.\ni∈C+\nPm\nLetting w := i=1 λi wi ∈ W , we have\nX |λi |\nX |λi |\n1\nw+\nwi =\nwi ,\nλ\nλ\nλ\ni∈C−\n\ni∈C+\n\nwhere both right and left sides are convex combinations\nof vectors from W . From the affinity of Λ, we have\nX |λi |\nX |λi |\n1\nΛ(w) +\nΛ(wi ) =\nΛ(wi ),\nλ\nλ\nλ\ni∈C−\n\ni∈C+\n\nwhich implies (C1).\n\n\u0004\n\nProposition 7 Λ has an affine extension Λ̃ to V1 with\nthe form\nΛ̃(v) = Av + b\n\n(C2)\n\nwhere A is a linear map from V1 to V2 and b ∈ V2 . If\nAff(W ) = V1 , then the extension is unique.\n\nProof. Let dim Aff(W ) = n and dim V1 = n+m (m ≥ 0).\nLet wi ∈ W (i = 0, . . . , n) be affinely independent set so\nthat wi − w0 (i = 1, . . . , n) are linearly independent. Let\n{vi }n+m\ni=1 be a basis of V1 such that vi = wi − w0 for\ni = 1, . . . , n. Then, define a map Λ̃ : V1 → V2 in (C2)\nwith a linear map A : V1 → V2 and b ∈ V2 given by\n\u001a\nΛ(wi ) − Λ(w0 )\ni = 1, . . . , n\nAvi :=\nvi′\ni = n + 1, . . . , n + m\nb := Λ(w0 ) − Aw0\nwhere vi′ are arbitrary vectors in V2 . Then, one can show\nthat Λ̃ is an affine extension of Λ. To see this,Pnote first\nn\nthat any w ∈ W is uniquely\nPnwritten by w = i=0 λinwi\nwith λi ∈ R such that\ni=0 λi = 1 since {wi }i=0\nare affinely independent\nand\nn is the dimension of W .\nPn\nThen, for any w =\nλi wi ∈ W , it follows that\ni=0\nPn\nΛ̃(w)\nPn = ( i=1 λi Awi ) + λ0 Aw0 + (Λ(w0 ) − Aw0 ) =\nλi (Aw0 +Λ(wi )−Λ(w0 ))+λ0 Aw0 +(Λ(w0 )−Aw0 ) =\nPi=1\nn\ni=0 λi Λ(wi ) − λ0 Λ(w0 ) + (1 − λ0 )(Aw0 − Λ(w0 )) +\nλ0 Aw0 + (Λ(w0 ) − Aw0 ) = Λ(w), where we have used\nLemma 5 in the final equation. Affinity of Λ̃ follows from\nthe form of (C2).\nLet Aff(W ) = V1 . Assume that Λ̃ and Λ̃′ are affine extensions of Λ. Noting that any\n= Aff(W )\nPnvector v ∈ V1 P\nn\nis uniquely written by v = i=0 λi wi with i=0 λi =\nPn\nPn\n1, we have Λ̃(v) =\ni=0 λi Λ(wi ) =\ni=0 λi Λ̃(wi ) =\nPn\n′\n′\nΛ̃\n(w\n)\n=\nΛ̃\n(v)\nby\nthe\nsame\nargument\nas Lemma\nλ\ni\ni\ni=0\n5 (note that each wi is in the domain W of Λ). Thus the\nuniqueness of the extension follows.\n\u0004\nThe following result gives a linear extension of Λ:\nProposition 8 (i) If 0 6∈ Aff(W ), Λ has always a linear\nextension to V1 . In particular, if dim V1 = dim Aff(W )\n+ 1, the extension is unique. (ii) If 0 ∈ Aff(W ), then Λ\ndoes not necessarily have linear extensions. In particular,\nin the case 0 ∈ W , Λ has a linear extension to V1 iff\nΛ(0) = 0.\nProof. Here we use the same notation as in the proof of\nProposition 7.\n(i) Let 0 6∈ Aff(W ). Obviously, Aff(W ) 6= V1 and\nPn+m\nm ≥ 1. Using the basis {vi }n+m\ni=1 , let −w0 =\ni=1 xi vi\nwith some xi ∈ R. Then, there exists at least one nonzero coefficient\nxi (i = n + 1, . . . , m); Otherwise\nwe have\nPn\nPn\n−w\n=\nx\n(w\n−\nw\n)\nand\nthus\n0\n=\nx\nw\n0\ni\ni\n0\ni\ni + (1 −\ni=1\ni=1\nPn\nx\n)w\n∈\nAff(W\n),\nwhich\ncontradicts\n0\n∈\n6\nAff(W\n).\ni\n0\ni=1\nWithout loss of generality,\nlet\nx\n=\n6\n0\nand\nchoose\nn+1\nPn\n1\n′\nvn+1\n= − xn+1\n(Λ(w0 ) + i=1 xi (Λ(wi ) − Λ(w0 ))) and\nvi′ = 0 (i = n + 2, . . . , n + m). Then, a direct computation shows that Aw0 = Λ(w0 ), i.e., b = 0.\nNext, we show the uniqueness of the linear extension\nfor the case dim V = dim Aff(W ) + 1, i.e., m = 1. In\nn+1\nthis case, one\nPn can choose vn+1 := w0 in a basis {vi }i=1 .\nIndeed, if i=1 αi (wi − w0 ) + αn+1 w0 = 0 and at least\none αi is non-zero, then αn+1 6= 0 by linear independence\nof wi − w0 = vi (1 ≤ i ≤ n), but this implies 0 ∈Aff(W ),\nwhich is a contradiction. Therefore, {vi }ni=1 with vi =\n\n\f12\nwi − w0 and vn+1 = w0 is an independent system of\nV and thus gives its basis. Let A and A′ give linear\nextensions of Λ. Then, using\nP the above basis, any vector\nv ∈ V is written as v = i xi (wi − w0 ) + xn+1 w0 . Since\nAw = Λ(w) = A′ w for any w ∈ W , we have Av = A′ v for\nany v ∈ V . This proves the uniqueness of the extension.\n(ii) Let 0 ∈ W . Then b = Λ(0). Therefore, in this case,\nan affine map can be linearly extended iff Λ(0) = 0. \u0004\nIt is well-known that a quantum operation Λ on the set\nSq of density operators is uniquely extended to a linear\nmap on a vector space L(Hd ) of all the linear operators\non a Hilbert space Hd . While there are several ways to\nshow this extension, it can be derived from Proposition\n8 as an easy corollary. Indeed, it is easy to check that\nSq is a convex subset of a real vector space V1 := L(H)h\nof the set of Hermitian operators, satisfying 0 6∈ Aff(Sq )\nand dim L(H)h = dim Aff(Sq ) + 1. Therefore, one can\nuniquely extend Λ to a linear map Λ̃ on L(H)h . Next,\nnoting that any linear operator A ∈ L(H) is uniquely\ndecomposed into the sum of real and imaginary parts,\ni.e., A = AR + iAI where AR := 12 (A + A† ) and AI :=\n ̃\n1\n(A − A† ), one can further extend Λ̃ to a linear map Λ̃\n2i\n\n ̃\non L(H) by Λ̃(A)\n:= Λ̃(AR ) + iΛ̃(AI ).\nWe notice that, in general GPTs, one can also treat\noperations (including dynamical map and measurement\nprocesses) described by its linear extension in a similar\nmanner.\nIn the following, we assume Aff(W ) = V1 = V2 and\nlet Λ : W → W be an affine map on W . We show that\nany surjective affine map on W is affinely extended to a\nbijective map on V := V1 .\nLemma 6 If Λ is surjective on W , so is the affine extension Λ̃ : V → V on V .\nProof As\nPnAff(W ) = V , an arbitrary y ∈ VPis written\nas y =\ni λi = 1.\ni=0 λi wi with some λi ∈ R and\nFrom the surjectivity of Λ on W , there exists wi′ such\nthat P\nwi = Λ(wi′ ) (∀i\nwe have\nP = 0, . . . , n). Therefore,\nP\ny = i λi Λ(wi′ ) = i λi (Awi′ + b) = A( i λi wi′ ) + b =\nP\n\u0004\nΛ̃( i λi wi′ ). Thus, Λ̃ is surjective on V .\nProposition 9 If Λ is surjective on W , then Λ̃ : V → V\nand Λ are bijective.\n\nProof From the previous Lemma, Λ̃ is surjective on V\nand so is the linear map A : V → V which composes\nΛ. Remind that a linear map on a finite dimensional\nvector space is surjective iff it is injective. Therefore,\nA is bijective and so is Λ̃ on V . Injectivity of Λ on W\nfollows since it is a restriction of the injective map Λ̃ to\nW.\n\u0004\n\n[Proof of Lemma 1] (1 ⇒ 2) If e ≤ f , then g := f /2\nand k := f − e are clearly effects. As g = (f + 0)/2 =\n(e + k)/2 ∈ E, we have Φ(g) = (Φ(f )+ Φ(0))/2 = (Φ(e)+\nΦ(k))/2. Since Φ(0) = 0, we have Φ(f ) = Φ(e) + Φ(k),\nand thus Φ(e) ≤ Φ(f ). (2 ⇒ 3) By the relation Φ−1 (u) ≤\nu and the assumption, we have u = Φ(Φ−1 (u)) ≤ Φ(u),\ntherefore Φ(u) = u. (3 ⇒ 1) For any g ∈ E , u − g ∈ E\nand thus (Φ(g) + Φ(u − g))/2 = (Φ(u) + Φ(0))/2 ∈ E .\nSince Φ(u) = u, we get Φ(g) + Φ(u − g) − Φ(0) = u ≥\nΦ(u − g), therefore Φ(g) ≥ Φ(0). Put g = Φ−1 (0), we\nhave 0 ≥ Φ(0), and thus 0 = Φ(0).\n\u0004\nLet S ⊂ Rd with Aff (S ) = Rd , then from Proposition\n7, any effect e ∈ E is uniquely represented by a ∈ Rd , b ∈\nR such that\ne(s) = ha, si + b,\nwhere h*, *i represents the Euclidean inner product in Rn .\n(Remind that any real linear functional A : Rd → R\nis uniquely represented by a vector a ∈ Rn such that\nAx = ha, xi for any x ∈ Rd .) Let a map  ̃ : E → Rd+1\nbe defined by ẽ = (a, b), then it is easy to see that  ̃ is\ne is a convex subset in Rd+1 . In\nan affine injection and E\nparticular, ũ = (0, 1) and 0̃ = (0, 0).\n\n[Proof of Theorem 1] Let Λ̃ be an affine functional\non Ee defined by Λ̃(ẽ) := Λ(e). Note that (0, 0) = 0̃ ∈ Ẽ\nand Λ̃(0, 0) = Λ(0) = 0. Thus, from Proposition 8, Λ̃ can\nbe represented by a vector (x, y) ∈ Rd × R = Rd+1 such\nthat\nΛ̃(a, b) = h(x, y), (a, b)i = hx, ai + yb.\nSince 1 = Λ(u) = Λ̃(0, 1), we have y = 1:\nΛ̃(a, b) = hx, ai + b.\n\nIn the following, we prove that s := x ∈ S , and thus\nfor any effect e ∈ E with ẽ =: (a, b), we have Λ(e) =\nΛ̃(a, b) = hs, ai + b = e(s).\nTo prove this, assume contrary that x 6∈ S , then\nthere exists a hyperplane which strictly separates {x}\nand S (see Theorem 4.12 in [23]); Equivalently, there exists a (continuous) affine functional f : Rd → R such\nthat f (x) < 0 and f (t) > 0 for any t ∈ S . Then,\n1\n′\nf ′ := maxt∈S\nf (t) f is an effect such that 0 > f (x). Note\n′\n′\nthat f can be represented as f (z) = ha0 , zi+b0 (z ∈ Rd ),\nand thus f ̃′ = (a0 , b0 ) from the uniqueness of the representation of effects. Thus, we have\n0 > f ′ (x) = ha0 , xi + b0 = Λ̃(a0 , b0 ) = Λ(f ′ ).\n\nAppendix D\n\nIn this appendix, we give proofs of Lemma 1 and Theorem 1.\n\nThis contradicts that Λ(e) ≥ 0 for any e ∈ E .\nFinally, the uniqueness follows from the separation hypothesis for states [P2-1].\n\u0004\n\n\f13\n\n[1] J. von Neumann, Mathematische Grundlagen der Quantenmechanik (Springer, Berlin, 1932).\n[2] G. Birkhoff and J. von Neumann, Ann. Math. 37, 823\n(1936); A. M. Gleason, J. Math, Mech. 6, 885 (1957); C.\nPiron, Helv. Phys. Acta, 37, 439 (1964); S. Pulmannova,\nInt. J. Theor. Phys. 35, 2309 (1996).\n[3] P. Jordan, et al., Ann. Math. 35, 29 (1934); I. E. Segal,\nAnn. Math. 48, 930 (1947).\n[4] G. Ludwig, Foundations of Quantum Mechanics I,II\n(Springer, 1983).\n[5] C. A. Fuchs, quant-ph/0205039.\n[6] R. Clifton, et al., Found. Phys. 33, 1561 (2003).\n[7] G. M.D'Ariano, arXiv:0807.4383. To appear in \"Philosophy of Quantum Information and Entanglement\" (Cambridge University Press, Cambridge UK); G. Chiribella,\nG. M. D'Ariano, and P. Perinotti, Phys. Rev. A 81,\n062348 (2010).\n[8] L. Hardy, arXiv:quant-ph/0101012.\n[9] B. Dakić and C. Brukner, arXiv:0911.0695.\n[10] L. Masanes, arXiv:1004.1483.\n[11] G. Chiribella, G. M. D'Ariano, and P. Perinotti,\narXiv:1011.6451.\n[12] G. Mackey, Mathematical Foundations of Quantum Mechanics (Dover, 1963).\n[13] H. Araki, Einfuhrung in die Axiomatische Quantenfeldtheorie, I, II (Lecture note distributed by Swiss Federal Institute of Technology, 1962); Mathematical Theory\nof Quantum Fields (Oxford University Press, 1999).\n[14] S. P. Gudder, Stochastic Method in Quantum Mechanics\n(Dover, 1979).\n[15] M. Ozawa, Rep. Math. Phys. 18, 11 (1980).\n[16] A. S . Holevo, Probabilistic and Statistical Aspects of\nQuantum Theory (North-Holland, Amsterdam,1982).\n[17] H. Barnum, J. Barrett, M. Leifer, and A. Wilce, Phys.\nRev. Lett. 99, 240501 (2007); ibid, arXiv:0805.3553.\n[18] K. Nuida, G. Kimura, and T. Miyadera, J. Math. Phys.\n51 093505 (2010).\n[19] G. Kimura, K. Nuida, and H. Imai, Rep. Math. Phys. 66\n175 (2010); arXiv:0910.0994.\n[20] G. Kimura, Phys. Lett. A, 314, 339 (2003); G. Kimura\nand A. Kossakowski, Open Sys. Information Dyn,, 12,\n207 (2005).\n[21] K. Kraus States, Effects, and Operations: Fundamental\nNotions of Quantum Theory (Lecture Notes in Physics\nvol 190) (Berlin, 1983).\n[22] H. H. Schaefer, Topological Vector Spaces (2nd edition,\nSpringer, 1999); G. Köthe, Topological Vector Spaces\n(Springer-Verlag, 1979).\n[23] S. R. Lay, Convex Sets and Their Applications (Krieger\nPublishing Company, 1982).\n[24] B. Davies and J. T. Lewis, Comm. Math. Phys. 17, 239\n(1970); M. Ozawa, J. Math. Phys. 25, 79 (1984).\n[25] M. A. Nielsen and I. L. Chuang, Quantum Computation\nand Quantum Information (Cambridge University Press,\nCambridge) 2000.\n[26] E. B. Davies, Quart. J. Math. Oxford Ser. 25 323 (1974).\n[27] G. Kimura, T. Miyadera, and H. Imai, Phys. Rev. A 79,\n062306 (2009).\n[28] P. R. Cromwell, Polyhedra (Cambridge University Press,\n\n1997), p. 369.\n[29] C. Ryll-Nardzewski, Bull. Acad. Polon. Sci. Ser. Sci.\nMath. Astronom. Phys. 10, 271 (1962); Proc. 5-th Berkeley Symp. Probab. Math. Stat., 2: 1, Univ. California\nPress, 55 (1967).\n[30] S. Stratila, L. Zsido, Lectures on von Neumann algebra\n(Abacus Press, 1979).\n[31] R. Kadison, Ann. Math. 54, 325 (1951).\n[32] K. H. Hofmann, S. A. Morris, The Structure of Compact\nGroups (Walter de Gruyter, 1998).\n[33] G. Kimura and K. Nuida, arXiv:1012.5350.\n[34] A. J. Short, S. Wehner, New J. Phys. 12, 033023 (2010).\nH. Barnum, et al., arXiv:0909.5075.\n[35] G. Kimura, Phys. Lett. A 314, 339 (2003); G. Kimura,\nA. Kossakowski, Open Sys. Information Dyn. 12, 207\n(2005).\n[36] C. A. Fuchs, J. Graaf, IEEE Trans. Info. Theory 45(4):\n1216 (1999).\n[37] J. L. Kelley, General Topology (Springer, 1955).\n[38] In general setting, one may assume that each measurement M has a measurable space (Ω, F) where Ω is a\nsample space for measurement outcomes and F is a σ\nalgebra for measurement events, e.g., Ω = R, F = B(R).\nThen, for each event ∆ ∈ F and state s, a probability\nPr{∆ ∈ B(R)|s} to get an outcome in ∆ is determined.\n[39] A subset W is called a c dimensional simplex if it is a\nconvex hull of affinely independent set {wi }c+1\ni=1 . Remind\nthat {vi ∈ V }m+1\nis called an affinely independent set\ni=1\nPm+1\nPm+1\niff λi ∈ R with\ni=1 λi = 0 and\ni=1 λi vi = 0 implies λi = 0 (∀i = 1, . . . , m + 1). It is an easy exercise to show that the followings are all equivalent: (i)\n{vi }m+1\ni=1 is an affinely independent set; (ii) For any i0 ,\n{vi − vi0 }i6=i0 is a linearly independent set; (iii) Convex decomposition w.r.t. {vi }m+1\ni=1 is unique. (Namely, if\nPm+1\nPm+1\np\nv\n=\nq\nv\nwith\nprobability distributions\ni\ni\ni\ni\ni=1\ni=1\n(pi )i and (qi )i , then pi = qi (∀i = 1, . . . , m + 1)).\n[40] In QM, we usually admit, especially in finite systems,\nthat any Hermitian operator (called an observable) and\nunitary operation correspond to feasible measurement\nand dynamics, respectively. Then, given any POVM\n(Ei )n\ni=1 in quantum system, there exists an ancilla system described by Hilbert space Hn , an initial state σ\non Hn , and unitary operatorP\nU on Htot := Hd ⊗ Hn ,\nand a meter observable M = i mi Pi on Hn such that\ntr(Ei ρ) = trtot (U (ρ ⊗ σ)U † I ⊗Pi ).\n[41] Let Ψ : S → S be an affine bijection and let s ∈ S be a\npure state. Let Ψ(s) = ps1 +(1−p)s2 with some t1 , t2 ∈ S\nand p ∈ (0, 1). Applying Ψ−1 , we have s = pΨ−1 (s1 ) +\n(1 − p)Ψ−1 (s2 ) and thus s = Ψ−1 (s1 ) = Ψ−1 (s2 ), as s\nis a pure state. Therefore, we have Ψ(s) = s1 = s2 , and\nΨ(s) is a pure state.\n[42] For instance, let {φi }di=1 and {φ′j }dj=1 be orthonormal\n′\nbases of Hd such that φP\n1 = ψ1 and φ1 = ψ2 . Then, use a\nd\n′\nunitary operator U := i=1 |φi ihφi |\n[43] For infinite dimensional cases, by noting the existence of\na basis of V1 (guaranteed by Zorn's lemma), essentially\nthe same proofs are applied.\n\n\f"}