{"id": "http://arxiv.org/abs/1007.5380v2", "guidislink": true, "updated": "2010-09-08T19:25:16Z", "updated_parsed": [2010, 9, 8, 19, 25, 16, 2, 251, 0], "published": "2010-07-30T06:50:20Z", "published_parsed": [2010, 7, 30, 6, 50, 20, 4, 211, 0], "title": "Phase-space description of the magneto-optical trap", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1007.2627%2C1007.3536%2C1007.4791%2C1007.2914%2C1007.0810%2C1007.2807%2C1007.0211%2C1007.1309%2C1007.3964%2C1007.3376%2C1007.4608%2C1007.2652%2C1007.1763%2C1007.4177%2C1007.4042%2C1007.3546%2C1007.3769%2C1007.0704%2C1007.4890%2C1007.1124%2C1007.3029%2C1007.2640%2C1007.1202%2C1007.4339%2C1007.3500%2C1007.3183%2C1007.3707%2C1007.3505%2C1007.4697%2C1007.2921%2C1007.1983%2C1007.1978%2C1007.2166%2C1007.4388%2C1007.4531%2C1007.1595%2C1007.1842%2C1007.3527%2C1007.3648%2C1007.1311%2C1007.2451%2C1007.5442%2C1007.4121%2C1007.2111%2C1007.4423%2C1007.4024%2C1007.2487%2C1007.4864%2C1007.2333%2C1007.0353%2C1007.0292%2C1007.4952%2C1007.4429%2C1007.5029%2C1007.2095%2C1007.1249%2C1007.0032%2C1007.4067%2C1007.5352%2C1007.0187%2C1007.2513%2C1007.1770%2C1007.5380%2C1007.0711%2C1007.3937%2C1007.3925%2C1007.5007%2C1007.4901%2C1007.2777%2C1007.1452%2C1007.4238%2C1007.5022%2C1007.4845%2C1007.2585%2C1007.1468%2C1007.3839%2C1007.0870%2C1007.5243%2C1007.1049%2C1007.4691%2C1007.2474%2C1007.0102%2C1007.5014%2C1007.2541%2C1007.5179%2C1007.1273%2C1007.3918%2C1007.3384%2C1007.1149%2C1007.3332%2C1007.0707%2C1007.2908%2C1007.2121%2C1007.0693%2C1007.2330%2C1007.4918%2C1007.4244%2C1007.0510%2C1007.3336%2C1007.3195%2C1007.1633&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Phase-space description of the magneto-optical trap"}, "summary": "An exhaustive kinetic model for the atoms in a 1D Magneto-Optical Trap is\nderived, without any approximations. It is shown that the atomic density is\ndescribed by a Vlasov-Fokker-Planck equation, coupled with two simple\ndifferential equations describing the trap beam propagation. The analogy of\nsuch a system with plasmas is discussed. This set of equations is then\nsimplified through some approximations, and it is shown that corrective terms\nhave to be added to the models usually used in this context.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1007.2627%2C1007.3536%2C1007.4791%2C1007.2914%2C1007.0810%2C1007.2807%2C1007.0211%2C1007.1309%2C1007.3964%2C1007.3376%2C1007.4608%2C1007.2652%2C1007.1763%2C1007.4177%2C1007.4042%2C1007.3546%2C1007.3769%2C1007.0704%2C1007.4890%2C1007.1124%2C1007.3029%2C1007.2640%2C1007.1202%2C1007.4339%2C1007.3500%2C1007.3183%2C1007.3707%2C1007.3505%2C1007.4697%2C1007.2921%2C1007.1983%2C1007.1978%2C1007.2166%2C1007.4388%2C1007.4531%2C1007.1595%2C1007.1842%2C1007.3527%2C1007.3648%2C1007.1311%2C1007.2451%2C1007.5442%2C1007.4121%2C1007.2111%2C1007.4423%2C1007.4024%2C1007.2487%2C1007.4864%2C1007.2333%2C1007.0353%2C1007.0292%2C1007.4952%2C1007.4429%2C1007.5029%2C1007.2095%2C1007.1249%2C1007.0032%2C1007.4067%2C1007.5352%2C1007.0187%2C1007.2513%2C1007.1770%2C1007.5380%2C1007.0711%2C1007.3937%2C1007.3925%2C1007.5007%2C1007.4901%2C1007.2777%2C1007.1452%2C1007.4238%2C1007.5022%2C1007.4845%2C1007.2585%2C1007.1468%2C1007.3839%2C1007.0870%2C1007.5243%2C1007.1049%2C1007.4691%2C1007.2474%2C1007.0102%2C1007.5014%2C1007.2541%2C1007.5179%2C1007.1273%2C1007.3918%2C1007.3384%2C1007.1149%2C1007.3332%2C1007.0707%2C1007.2908%2C1007.2121%2C1007.0693%2C1007.2330%2C1007.4918%2C1007.4244%2C1007.0510%2C1007.3336%2C1007.3195%2C1007.1633&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "An exhaustive kinetic model for the atoms in a 1D Magneto-Optical Trap is\nderived, without any approximations. It is shown that the atomic density is\ndescribed by a Vlasov-Fokker-Planck equation, coupled with two simple\ndifferential equations describing the trap beam propagation. The analogy of\nsuch a system with plasmas is discussed. This set of equations is then\nsimplified through some approximations, and it is shown that corrective terms\nhave to be added to the models usually used in this context."}, "authors": ["Rudy Romain", "Daniel Hennequin", "Philippe Verkerk"], "author_detail": {"name": "Philippe Verkerk"}, "author": "Philippe Verkerk", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1140/epjd/e2010-00260-y", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1007.5380v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1007.5380v2", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "physics.atom-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "physics.atom-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1007.5380v2", "affiliation": "PhLAM", "arxiv_url": "http://arxiv.org/abs/1007.5380v2", "arxiv_comment": null, "journal_reference": null, "doi": "10.1140/epjd/e2010-00260-y", "fulltext": "EPJ manuscript No.\n(will be inserted by the editor)\n\nPhase-space description of the magneto-optical trap\nRudy Romain, Daniel Hennequin and Philippe Verkerk\n\narXiv:1007.5380v2 [physics.atom-ph] 8 Sep 2010\n\nLaboratoire PhLAM, CNRS UMR 8523, Bât. P5 - Université Lille1, 59655 Villeneuve d'Ascq cedex, FRANCE\nthe date of receipt and acceptance should be inserted later\nRésumé An exhaustive kinetic model for the atoms in a 1D Magneto-Optical Trap is derived, without\nany approximations. It is shown that the atomic density is described by a Vlasov-Fokker-Planck equation,\ncoupled with two simple differential equations describing the trap beam propagation. The analogy of such\na system with plasmas is discussed. This set of equations is then simplified through some approximations,\nand it is shown that corrective terms have to be added to the models usually used in this context.\nPACS. 37.10.De Atom cooling methods – 05.45.-a Nonlinear dynamics and chaos – 32.30.-r Atomic spectra\n\n1 Introduction\nThe magneto-optical trap (MOT) is the primary tool\nto cool atoms. The development of this technique led to\nspectacular breakthroughs in experimental quantum physics : MOTs are the first step in the realization of optical\nlattices [1], cold molecules [2], or Bose-Einstein condensates [3]. But the MOT is also an interesting object per\nse. It produces a cloud of cold atoms, the physics of which\nis complex. In particular, spatio-temporal instabilities of\nthis cloud are commonly observed [4,5]. Several models\nwith different approaches have been proposed to describe\nthese dynamics, and to identify the mechanisms leading\nto instabilities. Unfortunately, none of these models gives\na satisfying description of the observed dynamics. In [4],\na very simple model allowed to describe experimentally\nobserved instabilities. This model, improved in [6], predicted another type of instabilities, which were effectively\nobserved in [7,8]. However, the agreement between the model and the experiments was only qualitative. Moreover,\nit concerned the particular case where the counterpropagating trap beams are obtained by retro-reflection, i.e. a\nglobal asymmetry is introduced in the trap.\nRecently, it has been proposed to describe the symmetric MOT, with all trap beams which are independent,\nas a weakly damped plasma [5,9]. Indeed, the cloud of\ncold atoms in a MOT is a confined dilute object with\nlong-range interactions, as in plasmas [10,11]. This model\npredicted the existence of instabilities above a relatively\nhigh threshold, so that instabilities should exist only in\nlarge MOTs. This seems in contradiction with the observations related in [6]. Moreover, no direct comparison with\nthe experimental temporal regimes allowed validating this\nmodel. More recently, a more complete description was\nderived using the methods of waves and oscillations in\nplasmas, leading to interesting predictions [12]. But as in\nthe previous case, this study is based upon intermediate\n\nwell-established results, valid only in specific cases (e.g. a\nlow beam intensity or a negligible viscosity). These conditions do not correspond in general to the experimental\nsituations, and indeed, these results were not compared\nto experimental results.\nIt appears from these numerous works that a reference\nmodel for MOT atom clouds lacks. Such a model should\nbe as general as possible, and should at least describe the\nusual experimental situations. In particular, such approximations as the low saturation limit should not be done a\npriori. Another interest of such a model is that it could\nhelp in determining precisely the analogies between MOT\natom clouds and other systems, such as plasmas.\nThe present work is a first step towards such a model.\nIts aim is to build a model, with the least possible hypotheses and approximations, of a 1D symmetric MOT. The\nresulting set of equations describes as precisely as possible\nthe dynamics of atoms inside a 1D MOT, and constitutes\na basis model. If simplifications are necessary, approximations should be applied on this model, a posteriori.\nThe paper is organized as follows : section 2 defines\nthe bases of the model, while in section 3, we show that\nthe dynamics of the MOT phase space density can be described by a Vlasov-Fokker-Planck equation with two relaxation processes. In section 4, we derive the different\nterms of this equation of evolution as a function of the\nusual experimental parameters. In section 5, we establish\nthe equations of propagation of the trapping beams. We\nobtain a set of coupled equations fully describing our system, in the general case. This set of equation can be solved\nnumerically to obtain solutions of the general system. However, to have a better understanding of the MOT, it is\ninteresting to go further in the analytical approach, simplifying a posteriori the model, as discussed above. This\nis done in section 6, where we examine an approximation\nfor the atomic response.\n\n\f2\n\nRudy Romain, Daniel Hennequin and Philippe Verkerk: Phase-space description of the magneto-optical trap\n\nσ+\n\nσ−\nk−\n\nk+\n(a)\n\nI+(x,t)\n\nI−(x,t)\n\nx\n\nJ = 1, m = 1\nJ = 1, m = −1\n\nJ = 1, m = 0\n\n∆+\n\n∆−\nσ−\n\nσ+\nk+= −k\nωL + kv\nΩ+\n\nk−= k\nωL − kv\nΩ−\n\n(b)\n\nJ=0\n\nFigure 1. Sketch of the 1D system considered here. a) the\ntwo contrapropagating beams have opposite circular polarizations. b) The laser beams interact with \"three-level\"\natoms on a J = 0 → J ′ = 1 transition, the degeneracy of\nwhich is lifted by an inhomogeneous magnetic field. Ω±\nare the Rabi frequencies associated with the beams ; ∆±\nare the effective detunings (see section 4.1).\n\n2 Definition of the model\nAs discussed above, we consider here a 1D configuration. Two counterpropagating laser beams with opposite\ncircular polarizations interact with the atoms, as sketched\non Figure 1a. The beam with the σ − polarization comes\nfrom the negative abscissa, and is denoted by the minus\nsign (intensity I− (x, t), wave vector k− ). In the same way,\nthe beam with the σ + polarization comes from the positive\nabscissa (intensity I+ (x, t), wave vector k+ ). Forces originate from the exchange of momentum between the atoms\nand the electromagnetic field. We consider here that the\natoms are the simplest ones for which the magneto-optical\ntrapping is possible. The laser frequency ωL is tuned in the\nvicinity of a J = 0 → J ′ = 1 transition with a frequency\nω0 (Fig. 1b).\nIn the 2D phase space, a point has the coordinates\n(x, p), where x is the position and p is the momentum. To\ndescribe the cloud of cold atoms, we introduce the phase\nspace density ρ (x, p, t). Formally, the complete atomic system is described by a phase space density including both\nthe hot and the cold atoms. However, laser cooling acts\nonly in a limited region of space, typically the intersection of the laser beams, and for moderate velocities. As a\nconsequence, the surrounding hot atoms are considered as\na large reservoir which remain in a thermal equilibrium at\nroom temperature. In the following, we neglect the action\nof the cold atoms on the hot background. These approximations lead to a huge simplification in the description\nof the collisions. Thus, to describe the cold atom dynamics, we have just to derive the equation of evolution of\n\nρ (x, p, t) from the basic principles of atomic physics. This\napproach allows us to go beyond the Wieman description\nof multiple scattering in terms of absorption cross sections [10,13]. ρ (x, p, t) influences the propagation of the\ntrapping beams, and reciprocally the modification in the\nbeam intensities changes the evolution of the phase space\ndensity. Thus, we expect to obtain a system of coupled\nnonlinear differential equations. As our aim is to build a\ntheoretical frame in which most of the experimental situations can be explored, we limit as much as possible the\ninitial approximations. In particular, we do not restrict\nour study to the low saturation limit, as in [12].\nTo derive the system of coupled equations, we proceed\nin two steps. We first assume that we know the intensities\nof the beams everywhere in the sample, and we derive the\nequation of evolution of the density in phase space (section\n3 et 4). Then, we write the equations of propagation of the\nbeams assuming that we know the atomic density in phase\nspace (section 5).\n\n3 Evolution of the phase space density\nTo derive the equation of evolution of the phase space\ndensity ρ (x, p, t), we consider an elementary cell centered\nin (x0 , p0 ), with dimensions δx and δp. The number of\natoms contained in this cell is N (t) = ρ (x0 , p0 , t) δx δp,\nwhere we assume that δx and δp have been chosen small\nenough to neglect higher order corrections. The variations\nof N between t and t + δt are governed by three distinct\nphenomena : (i) an atom is kicked in or out by a collision\nwith the hot background gas or (ii) an atom crosses the\nborder of the cell because of the evolution of either its\nposition or (iii) its momentum. The simultaneous change\nin position and in momentum would lead to second order\nterms in δt, which are neglected.\nThe collisional processes lead to two terms, one for\nlosses and one for gains :\nN δt\n+ λ δx δp δt\n(1)\nτ\nwhere τ is the mean time interval between two collisions\nwith the hot atoms. The source term λ is due to the collisions between two hot atoms that tend to restore the\nMaxwell-Boltzmann distribution for the phase space density (uniform in x, gaussian in p). A contribution from\nthe collisions between cold atoms could also be considered\nbut, in the conditions where instabilities are observed in\na MOT, this last contribution can be neglected.\nThe second mechanism is the variation of N due to the\nvelocity of the atoms. As depicted in Fig. 2a, the atoms\nthat cross the borders in x0 ± δx/2 with a velocity p0 /m,\nwhere m is the atomic mass, between t and t+δt are those\nin the close vicinity of that border. The area of these zones\nis simply δp p0 δt/m. The variation δNx in N due to the\nvelocity of the atoms can then be written :\n\u0014 \u0012\n\u0013\n\u0012\n\u0013\u0015\nδp p0 δt\nδx\nδx\nδNx =\nρ x0 −\n, p0 , t − ρ x0 +\n, p0 , t\nm\n2\n2\np0 ∂\nρ (x0 , p0 , t)\n(2)\n= − (δx δp δt)\nm ∂x\nδNcoll = −\n\n\fRudy Romain, Daniel Hennequin and Philippe Verkerk: Phase-space description of the magneto-optical trap\nδx\n\nIt appears natural to introduce the mean values of q\nand q 2 :\nˆ 2~k\nF (x, p, t) =\nq dq P (x, p, t, q)\n(4)\n\nq<0\n\nδx\n\nq>0\n(x0,p0)\n\n(x0,p0)\n\nδp\n\nδp\n\n2ħk\n\n−2~k\n2~k\n\nD (x, p, t) =\n\nq<0\n\np0\n\np0\n\nδt\n\n(a)\n\nδt\n\nm\n\n(b)\n\nFigure 2. Modification of the number of atoms contained\nin the elementary cell due to the evolution of (a) the position and (b) the momentum. The dashed regions contribute to losses, while dotted regions contribute to gains.\nIn (a), all the atoms in the indicated regions will cross\na boundary (we assume that p0 > 0), and the areas are\nproportional to δt. In (b), a small fraction of the atoms,\nproportional to δt, will receive a momentum kick. We have\nto consider separately the momentum kicks with q > 0 and\nthose with q < 0.\n\nThe last mechanism that changes N is due to the\nchanges in atomic momentum, which is more tricky to\nevaluate. The atoms undergo cycles where one photon is\nabsorbed and another one is emitted. We consider that all\nthe underlying physics is described by a probability per\nunit of time P (x, p, t, q) : the probability to change the\natomic momentum by a quantity q between t and t + δt is\nsimply δt P (x, p, t, q). We assume that the time interval δt\nis small enough so that an atom can undergo at most one\nphoton scattering event. In such a case, q = ~ (ka − ks )\nwhere ka and ks are respectively the wavevector of the absorbed and emitted photon. As a consequence, q is bounded to the range [−2~k, 2~k]. A fraction, proportional to\nδt, of the atoms contained in this region will change their\nmomentum by q. On the side p+ = p0 + δp/2, the atom\nnumber variation δNp+ is the difference between the incoming atoms (q < 0) and the lost atoms (q > 0) :\n\nδNp+ = (δx δt)\n\nˆ\n\n0\n\n2~k\n\ndq\n\nˆ\n\n0\n\nq\n\ndq ′ (N+ − N− )\n\nˆ\n\n−2~k\n\nq>0\nm\n\n3\n\n(3)\n\nwith N± = P (x, p+ ± q ′ , t, ∓q) ρ (x, p+ ± q ′ , t)\nTo simplify this expression, we assume that the product\nP (x, p, t, q) ρ (x, p, t) varies slowly with p. Then, the integrand can be approximated by its Taylor expansion in the\nvicinity of p+ . To recover the momentum diffusion process responsible for the non-zero temperature of the trapped atoms, we have to expand the integrand up to first\norder in q ′ . The inner integration is then straightforward\nbecause the integrand becomes a linear function of q ′ . The\nsame calculation has to be done on the opposite side in\np− = p0 − δp/2, which gives an analogous expression for\nδNp− .\n\nq2\ndq P (x, p, t, q)\n2\n\n(5)\n\nThese quantities can be interpreted as the mean force and\nthe momentum diffusion coefficient. The variation δNp =\nδNp+ + δNp− in N due to the change in momentum can\nbe written as :\n\u0014\n\u0015\n∂\n∂2\nδNp = − (δx δp δt)\n(6)\n(F ρ) − 2 (Dρ)\n∂p\n∂p\nCollecting all the contributions (1), (2) and (6) and going\nto the limit δt → 0, we obtain the equation of evolution\nfor the atomic density\np ∂\n∂\n∂2\nρ\n∂\nρ+\nρ+\n(F ρ) − 2 (Dρ) = − + λ\n∂t\nm ∂x\n∂p\n∂p\nτ\n\n(7)\n\nThe three left terms of this equation are characteristic\nof a Vlasov type kinetic model, except for the third term,\nas here the force depends on the velocity of the particles.\nThus this last term is a drift term, and together with the\nfourth term, which is a relaxation term, they denote a\nFokker-Planck description. So the motion of cold atoms\nin a MOT appears to be described by a Vlasov-FokkerPlanck (VFP) equation. Thus MOTs are part of a large\nclass of systems described by the VFP equations, as e.g.\nplasmas [14], stars [15], granular media [16] or electrons in\na storage ring [17]. The different systems are characterized\nby the dependence of the force F on the phase space density ρ. For example, for a plasma without magnetic fields,\nthe Vlasov-Poisson-Fokker-Planck is used.\nIn these systems, the Fokker-Planck terms denote the\nimmersion of the particles in a thermal bath, which corresponds for the cold atoms to the laser light. But in the case\nof cold atoms, a second bath, namely the hot atoms of the\nresidual gas, produces a second relaxation term, as well\nas a source term (the right hand terms of Eq. 7) : indeed,\nthe standard MOT is an open system, where the total population can vary. This last point is crucial and cannot be\nneglected, as the collision processes between hot atoms are\nthe one and only source of velocity redistribution allowing\nfor a high MOT population.\nBecause of the two relaxation processes involved in the\nMOTs, the question of the mechanism in which originate\nthe instabilities is far from being trivial. Indeed, it is well\nknown that the VFP equation may have, for adequate\nparameters, unstable solutions. But as in [7], instabilities\nlead to variations of population, it is clear that the loss and\nsource terms can also generate unstable solutions. Therefore, instabilities may originate in two different mechanisms, and it would be interesting to search if one of them\nprevails. An interesting case is that of the lower MOT in\na double cell system. In this case, the gas pressure in the\ncell is so low that the collision losses are negligible. If the\n\n\f4\n\nRudy Romain, Daniel Hennequin and Philippe Verkerk: Phase-space description of the magneto-optical trap\n\nloading process by the upper MOT is stopped, Eq. (7)\nbecomes fully equivalent to plasmas equations, and only\none relaxation process remains. Thus it would be interesting to study experimentally such a system, as the fact\nthat instabilities persist or not in this case could help in\nunderstanding the origin of these instabilities.\nTo go further, we need to evaluate the force (4) and the\ndiffusion coefficient (5) for a specific atom. To do so, we\nhave to calculate the probability P (x, p, t, q) associated\nwith the momentum exchange q = ~ (ka − ks ). However,\nas the probability to emit a spontaneous photon in the\ndirection ks is always identical to that for the opposite\ndirection −ks , the contribution of spontaneous emission\ncancels in F , while in D the cross-term in q 2 vanishes. As\na consequence, it is not necessary to evaluate completely\nP (x, p, t, q), but only the absorption rate for a photon of\nwavevector ka .\n\n4 Radiative forces and coefficients of diffusion\nAs stated above, we consider the simple scheme of a laser frequency ωL tuned in the vicinity of a J = 0 → J ′ = 1\ntransition with a frequency ω0 . These atoms are not suited for sub-Doppler cooling mechanisms [18], but these\nsubtle processes are not needed to describe the temperatures measured experimentally in the cold atomic cloud\nobtained with high intensities and small detunings for the\ntrapping beams [7]. In the case of retroreflected trapping\nbeams, this simple atom allows to develop a model which\nconvincingly reproduces the experimental observations of\ninstabilities, both deterministic [8] and stochastic [6].\nAs usual in problems of laser cooling, we will extensively use the fact that the time scales for the different\nprocesses are quite different. The first time scale is given\nby the time a photon needs to go through the sample.\nThis time scale is so short that we can consider that the\nlight follows immediately any change in the sample. A second time scale is given by the atomic response time Γ −1 ,\nwhich is in turn shorter than the third one related to the\nevolution of the external degrees of freedom (the atomic\nposition and velocity). This inequality allows us to consider that the atomic internal state has always reached its\nsteady state.\nIn the following, we consider an atom in X with a velocity V , where we use capital letters to distinguish the\nposition and velocity of this \"real atom\" from the coordinates (x, p) of a point in the phase space. The atoms are\nexcited on a J = 0 → J ′ = 1 transition by two counterpropagating laser beams with opposite circular polarizations. They also see a \"bath\" of photons which are spontaneously emitted by all the other atoms in the sample.\nThese photons propagate in all directions of the real 3D\nspace and they have a broad spectrum. Although it is not\nalways true, we consider here that the effect of the bath\nof spontaneous photons can be treated as a perturbation.\nThen, we split the force and the diffusion coefficient into\ntwo parts : one due to the trapping beams and the second one due to multiple scattering : F = Ft + Fm and\nD = Dt + Dm .\n\n4.1 Effect of the trapping beams\n\nThe trap consists in two counterpropagating beams\nwith the same frequency ωL and opposite polarizations\n(Fig. 1a). The σ − beam has a wavevector k− = k ≡ ωL /c\nand has an intensity I− (X, t), while the σ + beam has\na wavevector k+ = −k and an intensity I+ (X, t). The\nfrequency ωL is slightly lower than the frequency ω0 of the\natomic transition to insure an efficient Doppler cooling.\nThe sample is submitted to an inhomogeneous magnetic\nfield aligned on the propagation axis of the beams. For the\nsake of simplicity, we assume that the magnetic field varies\nlinearly : Bx = bX. The Zeeman effect together with the\ncooling beams lead to a restoring force that gathers the\natoms in the vicinity of X = 0.\nIn the atomic rest frame, the apparent frequencies of\nthe trapping beams are Doppler shifted : ω± = ωL ± kV .\nAs the two beams have opposite circular polarizations, the\nrelevant detunings are ∆± = ∆ ± δ, where we have introduced the detuning ∆ = ωL − ω0 for an atom at rest with\nno magnetic field, and the sum δ = kV + μB bX/~ of the\nDoppler shift kV and the Zeeman shift μB Bx /~. As the\ntwo beams are circularly polarized, the excited state |0i\nplays no role in the present configuration. The coupling\nbetween the ground state |gi and the excited states\n|±i\np\nis described by the Rabi frequencies |Ω± | = Γ I± /2Is ,\nwhere Is is the saturation intensity. It is then possible to\nfind exactly the steady state of the density matrix, by solving the master equation. We are not interested here in\nthe explicit form of the populations or of the coherences,\nwhich are given in a previous article [6]. The only important point is that the stationary populations Π± in\nthe excited states |±i can be written as a function of the\nrelevant parameters ∆, δ, I+ and I− . Note that these stationary populations do not depend on the position or the\nvelocity of the atom explicitly, but only through δ, I+ and\nI− .\nThe key point is that the simplicity of the atomic\nstructure means that γ± = Γ Π± are the emission rates\nof spontaneous σ ± polarized photons. The exact expressions of Π± can be found in [6]. Again because of the\nsimple J = 0 → J ′ = 1 transition, a photon with the\nsame polarization has to be absorbed before each spontaneous emission process. As a consequence, we obtain a\nvery simple expression for the radiative force due to the\ntrapping beams, together with the expression for the diffusion coefficient due to the trapping beams :\nFt = ~k (γ− − γ+ )\n7\nDt = ~2 k 2 (γ− + γ+ )\n5\n\n(8a)\n(8b)\n\nwhere a contribution 2k 2 /5 in Dt comes from the mean value of the square of the projected component of the spontaneous wavevector. To evaluate this average, we consider\nthe diagram of emission of a circular electric dipole (3/10\nin the plane and 2/5 in the orthogonal direction).\n\n\fRudy Romain, Daniel Hennequin and Philippe Verkerk: Phase-space description of the magneto-optical trap\n\n4.2 Effect of multiple scattering\nThe contribution of multiple scattering is trickier to\nevaluate. We have to consider our atom in a bath of incoherent photons which propagate in all directions. Because\nof their physical origin, photons do not differ in spectrum\nwherever the scatterer is and whatever their direction of\npropagation is. Therefore, the rate of absorption of photons going in a given direction is simply proportional to\nthe flux of photons that travel in this direction. The contribution to that flux of photons scattered just once is easy\nto evaluate. The flux of photons scattered more than once\nis more difficult to estimate, but it is in general much\nsmaller than the previous one, and we neglect it in the\nfollowing. The flux Ψ+ (resp. Ψ− ) of photons, travelling to\nthe right (resp. to the left) and impinging on an atom in\nX, is just half of the total number of photons scattered\nby the atoms on the left (resp. on the right) of X.\nˆ\nˆ\n1 X\ndx′ dp ρ (x′ , p, t) (γ− + γ+ ) (9a)\nΨ+ (X, t) =\n2 −∞\nˆ\nˆ\n1 +∞ ′\ndx\ndp ρ (x′ , p, t) (γ− + γ+ )(9b)\nΨ− (X, t) =\n2 X\nIn these expressions, we do not differentiate the polarization of the scattered photons. We just sum up the contribution γ+ of the mainly σ + polarized photons and the\ncontribution γ− of the mainly σ − polarized photons. It\nis interesting to note that the sum Ψ+ + Ψ− of these two\nfluxes does not depend on X. We shall see in the next\nsection that these fluxes have much simpler expressions.\nTo evaluate the force exerted by the scattered photons\non the atoms, we have to know the fraction of photons\nwhich are absorbed and the momentum carried by each\nphoton. This momentum is smaller than ~k, because we\nhave to keep here only the on-axis component for photons\ntravelling in all directions of the real 3D space. Considering the emission diagram of a circular dipole, we obtain\nhka i = 9k/16 and ka2 = 2k 2 /5. This leads to the following expressions for Fm and Dm :\n9\n~k (Ψ+ − Ψ− )\n16\n4\n= σR ~2 k 2 (Ψ− + Ψ+ )\n5\n\nFm = σR\n\n(10a)\n\nDm\n\n(10b)\n\nwhere we have introduced re-absorption cross-section σR .\nIn the limit of very low intensities (Ω ≪ Γ ), we can\ngive an estimate of σR . In this case, it is well-known that\nfor a 2-level atom, the emission spectrum is mainly elastic\n[19]. This result holds for the J = 0 → J ′ = 1 transition\nconsidered here and the scattered photons have the same\nfrequency ωL as the trapping lasers. To be rigorous, Doppler broadening should be taken into account, as the scatters are moving and the emitted photons do not propagate\nin the direction of the trapping beams. However, we neglect this broadening here, because it is smaller than both\nthe detuning and the natural linewidth. We also neglect\nthe Zeeman shift and the Doppler shift for the absorber.\nThe absorption cross-section is thus reduced by a factor\n\n5\n\n\u0001\nΓ 2 / 4∆2 + Γ 2 with respect to the cross-section at resonance σ0 = 3λ2 /2π . In the very low intensity limit, we\nhave :\nσR = σ0\n\nΓ2\n4∆2 + Γ 2\n\nFor higher but still modest intensities, a new contribution shows up : the blue sideband of the Mollow triplet\n[20], which excites resonantly\nthe atomic transition, grows\n\u0001\nup as Ω 2 / 4∆2 + Γ 2 . As soon as Ω ≫ Γ , this new resonant contribution dominates,\n\u0001 even in the low saturation\nregime (1 ≫ Ω 2 / 4∆2 + Γ 2 ).\nFor even higher intensities, as we know the exact steady\nstate of the density matrix, we can, in principle, compute\nthe spectrum of the scattered light and the absorption\ncross-section, following what is usually done for 2-level\natoms [11]. However, contrary to the previous publications\n[11,13], we do not evaluate σR for a 2-level atom, to remain\nconsistent with the model of a J = 0 → J ′ = 1 transition\nwhere at least one of the excited state sub-levels does not\ninteract with the trapping beams. As the exact calculation\nis quite heavy, we shall not make here the full calculation\nin the general case, but we shall restrict ourselves to the\nsimpler situation considered in section 6.\n\n5 Propagation of the trapping beams\nIn this section, we derive the equation of propagation\nfor the trapping beams assuming that we know the atomic\ndensity ρ (x, p, t). We are not interested in the phase of the\nlaser beams, but just in their intensities. We have seen in\nthe previous section that the rates γ± = Γ Π± are the\nabsorption rates of σ ± polarized photons for an atom in\nX moving with velocity V . To know how many photons\nare absorbed between x and x + δx, we just have to sum\nthe contributions of all atoms in X = x with all possible\nvelocities V = p/m. These photons are taken from the\ntrapping beam with the appropriate polarization, so we\nget :\nˆ +∞\n∂I+\n= +~ωL\ndp ρ (x, p, t) γ+\n(11a)\n∂x\n−∞\nˆ +∞\n∂I−\n= −~ωL\ndp ρ (x, p, t) γ−\n(11b)\n∂x\n−∞\nThe plus sign in (11a) comes from the fact that the σ + polarized beam propagates backwards. So I+ (x, t) increases\nwith x, while I− (x, t) decreases.\nPlugging (11) in the fluxes (9) and performing formally\nthe integration on positions, we get :\nI+ (x, t) − I− (x, t) − I+ (−∞, t) + I− (−∞, t)\n2~ωL\nI+ (∞, t) − I− (∞, t) − I+ (x, t) + I− (x, t)\nΨ− (x, t) =\n2~ωL\nΨ+ (x, t) =\n\nThe intensities I− (−∞, t) and I+ (∞, t) are the incoming\nlaser intensities, which are assumed to be constant. As\n\n\f6\n\nRudy Romain, Daniel Hennequin and Philippe Verkerk: Phase-space description of the magneto-optical trap\n\nsoon as we know the atomic phase space density ρ (x, p, t),\nwe can solve the equations (11) to get the spatial evolution of the intensities. However, the evolution of the phase\nspace density depends on the laser intensities through the\nradiative forces and the diffusion coefficients. Thus, the\nequations (7) and (11) form a set of coupled equations\nwhich have to be solved together.\nIt is important to note that Eqs (11) introduce in the\nforce a term which, in general, is not present in other\nsystems described by the VFP equation. This difference\nhas to be taken into account if we want to apply results\nobtained for plasmas to the dynamics of MOTs. Indeed,\nin plasmas, the particles do not act, by definition, on the\nthermal bath. On the contrary, in MOTs, atoms act on\nthe beams (the equivalent of the thermal bath, as seen\nabove), through the absorption and the so-called shadow\neffect. Thus it leads to another indirect dependence of the\nforce on the density.\n\n6 Approximation for the atomic response\nIn the general case, the equations (7) and (11) describing the MOT are highly non linear, and have no simple\nsolution. Numerical simulations could give some solutions,\nbut they could not give any physical insight of the phenomenon. However, starting from this general model, we\ncan now consider some approximations allowing going further in the understanding of the MOT dynamics. Through\nthese approximations, we aim to determine the expressions (8) of the trapping beam contribution and (10) of\nthe multiple scattering contribution to the mean force and\ndiffusion coefficient of the MOT.\n\ndone, but the cross-terms do not allow any simple interpretation. Moreover, to evaluate the effect of multiple scattering, we need to know the absorption cross section for\nthe bath of photons that have been scattered elsewhere. It\nrequires one more step of perturbation by an extra weak\nfield, which is not easy to implement.\nThis first approximation is usually followed by another\napproximation, namely the low velocity limit, where the\ntotal trapping force is linearized in V . It naturally splits\nin a term due to the intensity imbalance and in a friction\nterm. In the same way, the gradient of the magnetic field\nintroduces a restoring force, linear in X. The condition\nof validity for this approximation is |δ| ≪ max (|∆| , Γ ),\nwhere δ is the sum of the Doppler and Zeeman shifts, as\nintroduced in section 4.\nLet us consider here another approach, where the approximation δ is applied before going to the low saturation\nlimit. The total shift δ is considered as a perturbation, that\nis expanded to first order only. At a first glance, this choice\nseems quite surprising, as the \"perturbation\" is diagonal\nin the natural basis {|gi , |+i , |−i}. However, the good basis to do the calculation is not the natural one, and then\nthe shift δ leads to off-diagonal terms.\nAt zeroth order, the case δ = 0 corresponds to an atom\ninteracting with a field which has both σ ± components.\nIt is thus natural to introduce the coupled |Ci and noncoupled |N i states :\nΩ+ |+i + Ω− |−i\nΩ\n∗\n∗\nΩ−\n|+i − Ω+\n|−i\n|N i =\nΩ\n|Ci =\n\nwhere Ω± are the generalized (C-number) Rabi frequencies that include the complex phase of the fields and Ω =\nq\n2\n\n6.1 Trapping forces\nConcerning the trapping beam components, Eqs (8)\nshows that we need essentially to explicit the scattering\nrates γ± = Γ Π± , introduced as the emission rates of\nspontaneous σ ± polarized photons, and also as the absorption rates of the corresponding trapping photons. In\nthe case of a J = 0 → J ′ = 1 transition, these rates are\nexactly computable, as in [6]. However, the obtained expressions are very heavy and difficult to interpret. To have\na better physical insight, we will simplify these expressions\nthrough approximations valid in our domain of interest.\nThe usual approach consists in considering the low saturation limit. In this case, each wave acts on the atoms\nindependently, and the forces and the diffusion coefficient\ncan be computed. But experiments are seldom realized\nin this low intensity limit. For slightly higher intensities,\nthe calculation of the next order of perturbation (fourth\norder in field) must be considered. But this calculation\nis not straightforward. Indeed, the third order of perturbation builds up Zeeman coherence between the excited\nsublevels, which lead to non-trivial modifications of the\npopulations at the fourth order. The calculation can be\n\n2\n\n|Ω+ | + |Ω− | describes the coupling between the ground\nstate and the coupled one. Then the problem reduces to\nthat of a 2-level atom interacting with a single laser field.\nThe steady state population of the coupled state is simply :\nΩ2\n(0)\nΠC =\n2\n4∆ + 2Ω 2 + Γ 2\nwhich gives the value of the scattering rates :\n(0)\n\nγ± = Γ\n\n2\nΩ±\n4∆2 + 2Ω 2 + Γ 2\n\nThe radiative force due to the beam imbalance and the\ncoefficient of diffusion follows :\n\u0010\n\u0011\n~kΓ\n(0)\n2\n2\nFt =\n|Ω− | − |Ω+ |\n2\n2\n2\n4∆ + 2Ω + Γ\nΩ2\n7\n(0)\nD t = ~2 k 2 Γ\n5\n4∆2 + 2Ω 2 + Γ 2\nIt is interesting to note that, in these expressions, we get\nthe same result if we replace, in the expressions obtained in the \u0001low saturation regime,\u0001 the usual denominator\n4∆2 + Γ 2 by 4∆2 + 2Ω 2 + Γ 2 .\n\n\fRudy Romain, Daniel Hennequin and Philippe Verkerk: Phase-space description of the magneto-optical trap\n\nAt first order, when δ 6= 0, we introduce the same\ncoupled and non-coupled states as above, and a first order\nperturbation in δ gives the friction and restoring forces.\nThe diagonal (in the natural basis) part of the hamiltonian\nHA writes :\n\nwith\n\nHA = − (∆+ |+i h+| + ∆− |−i h−|)\n= −∆N |N i hN | − ∆C |Ci hC|\n\u0001\nδ\n∗ ∗\nΩ− |Ci hN |\n−2 2 Ω+ Ω− |N i hC| + Ω+\nΩ\n2\n\n2\n\n|Ω+ | − |Ω− |\nΩ2\n2\n|Ω+ | − |Ω− |2\n= ∆−δ\nΩ2\n\n7\n\ncorresponds to what is guessed from the unsaturated\nex\u0001\n2\n2\npression : the original\ndenominator\n4∆\n+\nΓ\nbecomes\n\u0001\n4∆2 + 2Ω 2 + Γ 2 . However, a second term is needed to\ntake into account properly the cross-saturation effects.\nThis term is often forgotten by the authors, as for instance in [9], whereas it can modify significantly the spring\nconstant of the trap, as it is of the same order of magnitude\nas Ω 2 . In particular, the minus sign means that, depending on the parameters, the spring constant is increased\nor decreased significantly. On the contrary, the correction\n(1)\nDt to the coefficient of diffusion is usually very small,\n2\n2\nbecause |Ω− | ≃ |Ω+ | .\n\n∆C = ∆ + δ\n∆N\n\n6.2 Multiple scattering\n\nThe slight change from ∆ to ∆C introduces a first order\ncorrection in the population of the excited coupled state.\n\u0011\n\u0010\n2\n2\n8 ∆ δ |Ω− | − |Ω+ |\n(1)\nΠC =\n(13)\n2\n(4∆2 + 2Ω 2 + Γ 2 )\nThe off-diagonal perturbation terms induce, at the first\norder, coherences between the non-coupled state and the\ntwo other states. But only the coherences in the excited\nstate are needed to evaluate the populations Π±\nE\n−2 δ Ω+ Ω−\n4Γ\n(14)\nN σ (1) C =\n2\n2\n2\n4∆ + 2Ω + Γ 4Γ ∆ − i (2Γ 2 + Ω 2 )\nD\nE D\nE∗\nC σ (1) N = N σ (1) C\n(15)\n\nD\n\nThe correction in the scattering rates is deduced from the\nexpressions of the population (13) and of the coherences\n(14) and (15) :\nγ± =\n\n(4∆2\n\n∓8 ∆ δ Γ\n\n+ 2Ω 2 + Γ 2 )\n2\n\n2\n\n2\n\n× |Ω± | + 2 |Ω− | |Ω+ |\n\n2\n\n4Γ 2 − Ω 2\n\n2\n\n16Γ 2∆2 + (2Γ 2 + Ω 2 )\n\n!\n\nThe evaluation of the friction force is then straightforward :\n(1)\n\nFt\n\n=\n\n~kΓ 8∆δ\n(4∆2 + 2Ω 2 + Γ 2 )2\n2\n\n2\n\n× Ω + 4 |Ω− | |Ω+ |\n(1)\n\nDt\n\n=\n\n2\n\n4Γ 2 − Ω 2\n\n2\n\n16Γ 2 ∆2 + (2Γ 2 + Ω 2 )\n\u0011\n\u0010\n2\n2\n8 ∆ δ |Ω− | − |Ω+ |\n\n!\n\n7 2 2\n~ k Γ\n2\n5\n(4∆2 + 2Ω 2 + Γ 2 )\n\nIt is easy to check that the force calculated in this way\nis rather a friction force, as soon as ∆ < 0. The first\nterm of the parenthesis, Ω 2 , together with the prefactor,\n\nTo evaluate the effect of multiple scattering, we neglect, as usual, the Doppler broadening due to the motion\nof the emitter and the Doppler and Zeeman shifts for the\nre-absorber. Thus, we consider that δ vanishes. Eqs (10)\nshows that we have to evaluate the re-absorption crosssection σR , taking into account the fluorescence spectrum\nand the absorption spectrum, which are affected by the\nintense trapping field.\nWhen the laser field is intense enough, the dressed\natom in the secular limit allows a simple evaluation of\nthe fluorescence spectrum and of the re-absorption crosssection [11,19]. However, instead of considering a 2-level\natom, we remain consistent with the model of a J = 0 →\nJ ′ = 1 transition where we have three sublevels in the\nexcited state. We have also to consider that the polarization of the photon scattered by an atom somewhere in\nthe sample will not match exactly the polarization of the\nlocal field. For the sake of simplicity, let us consider here\nthe case where the trapping beams have the same intensity, resulting in a linear polarization for the total trapping field. The consequence of the polarization mismatch\nis that, on average, one half of the scattered photons has\nthe polarization of the local field while the other half has\nthe orthogonal polarization. The detailed calculation is\ndone in the appendix. The energy levels of the dressed\natom are sketched in Fig. 3. In Fig. 3a, we have evidenced the fluorescence transitions that lead to the Mollow\ntriplet. On the other hand, the absorption lines are drawn\non Fig. 3b, considering all the possible polarizations for\nthe incident photon. Schematically, we have to consider\nthe overlap of the four components of the Mollow triplet\nwith the four absorption lines of the 3-level atom, as represented in Fig. 3c. Some care has to be taken to compare\nthe various contributions in the different regimes. Let us\nnow examine the four main situations :\n(i) Ω, |∆| ≫ Γ . In general, for large√detunings and in\u0001\n∆2 + Ω 2 − |∆| ≫\ntensities and large light-shifts (δr = 21\nΓ ), the resonant term of the 2-level system dominates the\nsum, and all the other terms should be dropped to remain consistent with the secular approximation done before. The resulting re-absorption cross-section has thus the\n\n\f8\n\nRudy Romain, Daniel Hennequin and Philippe Verkerk: Phase-space description of the magneto-optical trap\n\n(a)\n\n(b)\n\n|1,N+1>\n\nδr\n\n|2,N+1>\n\nωL\n\nωL + Ω G\n\nωL\nωL + ΩG\n\nωL − δ r\n\nωL − Ω G\nωL\n\nThe above results allow us to write in the different regimes the contribution of the multiple scattering to the\nMOT dynamics. These expressions are rather simple as\ncompared to those found in the literature. It is interesting\nto note that σR is always larger than the absorption crosssection for the trapping beams. This is very often assumed\nin previous papers, as stated in [13]. We have demonstrated here that, in the secular regime for three level atoms,\nit is always true. The above expressions of σR , together\nwith the expression of the trapping force derived in the\nprevious paragraph, allow us to write a full model of the\nMOT, which can be used as a basis for future analyses.\n\nωL − Ω G\n\nωL+ ΩG− δr\n|1,N>\n\nΩG\n\n|2,N>\n\n(c)\n\n7 Conclusion\nωL − Ω G\n\nωL\n\nω L+ Ω G\n\nFigure 3. Sketch of the energy levels of the dressed-atom.\na) Spontaneous emission lines leading to the Mollow triplet. b) Absorption lines. c) Overlap of the fluorescence\nspectrum (solid line) with the absorption lines of the 2level system (dotted lines) and with those due to the third\nlevel (dashed lines).\nfollowing simple expression :\nσR =\n\nσ0\n∆2 Ω 2\n4 4∆4 + 8∆2 Ω 2 + 3Ω 4\n\n(16)\n\nThis result is consistent, within a factor of 2, with the\nlimit values given for Ω ≫ |∆| ≫ Γ and |∆| ≫ Ω ≫ Γ in\nthe appendix of Ref. [11].\n(ii) |∆| ≫ Ω. The contribution due to the non-coupled\nlevel is never exactly resonant. However, in this case, the\nlight-shift, δr ≃ Ω 2 /4 |∆|, can be arbitrarily small, leading\nto an almost resonant behaviour if δr . Γ . In the case\nwhere |∆| ≫ Ω ≫ Γ and Γ ≫ Ω 2 /4 |∆|, we take into\naccount the quasi resonant contribution of the third level :\nσR =\n\nσ0 Ω 2\n8 ∆2\n\n(17)\n\nNote that (17) is not the limit of (16) when |∆| ≫ Ω,\nalthough it has the same form.\n(iii) Ω ≪ Γ . When the intensity is very small, the\nresonant or quasi-resonant contributions go to zero and\nthe leading term corresponds to the reabsorption of the\nelastic component :\nσR =\n\nσ0 Γ 2\n4 ∆2\n\n(18)\n\n(iv) |∆| ≪ Γ . For small detunings, the reabsorption\nby a 2-level atom goes to zero because the transition is\nstrongly saturated. Then, the contribution of the third\nlevel, although it is non-resonant, has to be taken into\naccount. We have :\nσR = σ0\n\n25 Γ 2\n48 Ω 2\n\nIn this paper, we built a model for a 1D MagnetoOptical Trap as general as possible. We show that such a\ntrap is described by a Vlasov-Fokker-Planck equation with\na second relaxation term and a source term, both originating in the bath of hot atoms of the atomic vapor. This\nVFP equation is coupled to a set of two differential equations describing the beam propagation in the cold atoms.\nThis system could be considered as relatively similar to\nplasmas, where the role of the thermal bath is played by\nthe trapping beams. However, it appears that the MOT\ndiffers from plasmas on two important points : the second\nthermal bath, formed by the hot atoms, induces new interactions as compared to plasmas ; the trapping beams are\nnot a \"thermal\" bath, as the atoms act on them through\nthe absorption.\nIn the last section of this paper, we derive in a more\ndetailed way the equations established in the previous sections, and compare the results with those found in the litterature. We show that important correction terms must\nbe taken into account in the evaluation of the trapping\nforces, and we establish the expression of the multiple\nscattering in different situations.\nThese equations aimed to be a basis for future developments. They should contribute to obtain a better\nagreement between the experimental observations and the\ntheoretical predictions. Let us remember that the previous\nexisting models were only in qualitative agreement with\nthe experimental observations, in particular for the situations out of equilibrium. Using this model to study the\ninstabilities in the cold atoms should give a better insight\nof the mechanism in which they originate. Thus a natural\ncontinuation of the present work would be to extend this\nmodel to the 3D traps.\n\n(19)\n\n8 Appendix\nIn this appendix, we present the detailed calculations\nof the re-absorption cross section, resulting from the overlap of the fluorescence spectrum of an atom somewhere in\nthe sample with the absorption spectrum of another atom\nelsewhere. In the J = 0 → J ′ = 1 transition considered here, we have three sublevels in the excited state, and\n\n\fRudy Romain, Daniel Hennequin and Philippe Verkerk: Phase-space description of the magneto-optical trap\n\nthe polarization of the scattered photon will not match\nexactly the polarization of the local field. For the sake of\nsimplicity, let us consider here the case where the trapping beams have the same intensity. In real experiments,\nit cannot be true everywhere in the sample because of\nthe shadow effect, but the deviation remains on the order\nof 10%. In this simple case, the resulting polarization of\nthe total trapping field is everywhere linear, but its direction follows an helix. The laser wavelength is the scale for\nchanging the relative phase between Ω+ and Ω− , because\nthe two beams are contrapropagating. As soon as we are\nnot interested in what happens at length scales smaller\nthan the laser wavelength, we can estimate that one half\nof the photons in the bath will interact with the transition\nbetween the ground state and the coupled one, while the\nother half of them can excite the atom to the non-coupled\nlevel. The total re-absorption cross-section, σR , is thus the\n(2)\naverage of the usual cross-section, σR , calculated with a\n(3)\n2-level atom [11] and of a new contribution, σR , coming\nfrom the presence of an excited level which is not coupled to the trapping field. The empty non-coupled state\nallows a strong absorption of the scattered light, while the\nabsorption by the coupled state can be saturated by the\ntrapping field.\nAs usual, when one works with the dressed atom model, the calculations are much simpler in the secular approximation. This approximation is valid as soon as the\nenergy splitting is larger than the typical width of the\nlevels, which is expressed by the condition :\n\n9\n\nfluorescence spectrum is given by :\n\u00012\n\u00012\n2c2 s2\nc2 − s2\nδ (ω − ωL ) + 4\nL (ω − ωL , Γp )\nS (ω) =\nc4 + s4\nc + s4\n+c2 s2 L (ω − ωL − ΩG , Γc )\n+c2 s2 L (ω − ωL + ΩG , Γc )\n√\nwhere ΩG = ∆2 + Ω 2 is the generalized Rabi frequency.\nThe transformation from the bare basis to the dressed\none is given by c = cos (θ), s = sin (θ), with the angle\nΩ\nθ defined by tg (2θ) = − ∆\n. δ (ω − ωL ) is the Dirac delta\nfunction, and L (ω, Γ ) is the normalized Lorentzian :\nL (ω, Γ ) =\n\nΓ\n1\n2\nπ ω + Γ2\n\nand the relaxation rates for the populations and the coherences are :\n\u0001\n(22)\nΓp = Γ 1 − 2c2 s2\n\u0001\nΓ\nΓc =\n1 + 2c2 s2\n(23)\n2\nThe first term in S (ω) corresponds to the elastic scattering, while the three other terms are inelastic components.\nThe last two terms are the sidebands of the Mollow triplet, centered in ωL ± ΩG , which are proportional to the\nintensity when |∆| ≫ Ω.\nThe absorption spectra are given by :\nπΓ c2 − s2 4\nc L (ω − ωL − ΩG , Γc )\n2 c4 + s4\nπΓ c2 − s2 4\n−σ0\ns L (ω − ωL + ΩG , Γc )\n2 c4 + s4\nπΓ 6\n(3)\nσA (ω) = σ0\nc L (ω − ωL − ΩG + δr , Γ2 )\n2\nπΓ 6\ns L (ω − ωL + δr , Γ1 )\n+σ0\n2\n(2)\n\np\n∆2 + Ω 2 ≫ Γ\n\n(20)\n\nPlease note that this relation does not require that both\nthe detuning and the intensity are large, and some interesting limits can be examined with either Ω . Γ or |∆| . Γ ,\nin the secular limit. First, we calculate the emission spectral density, S (ω), for an atom illuminated with the two\ntrapping beams. Then, we evaluate the absorption spectra\nof another atom, also interacting with the trapping field.\nTwo contributions appear in the absorption process : on\none hand, the coupled excited level can still absorb light,\nleading to a contribution which is the one of a 2-level atom,\n(2)\nσA (ω), and on the other hand, the non-coupled level has\n(3)\nto contribute with σA (ω). Finally, we evaluate the total\nre-absorption cross-section, σR , with :\n\nσR =\n(2)\nσR\n(3)\n\n=\n\nσR =\n\n\u0011\n1 \u0010 (2)\n(3)\nσR + σR\nˆ2\n(2)\nσA\n\nˆ\n\n(21)\n\n(ω) S (ω) dω\n\n(3)\n\nσA (ω) S (ω) dω\n\nAll these calculations are done using the formalism of the\ndressed atom, in the secular limit (20). The normalized\n\nσA (ω) = σ0\n\nwhere δr is the light-shift, and Γ1,2 are the relaxation rates\nfor the coherences between the non-coupled level and the\ndressed states.\n\u0011\np\n1\u0010\n∆ + ∆2 + Ω 2\nδr =\n(24)\n2\n\u0001\nΓ\n1 + c2\n(25)\nΓ1 =\n2\n\u0001\nΓ\nΓ2 =\n(26)\n1 + s2\n2\n\nThe absorption spectrum of the 2-level part consists in\ntwo lines centred in ωL ± ΩG , which means that they are\nresonantly excited by the two sidebands of the Mollow\ntriplet. The two absorption lines due to the third level\nare centred in ωL + ΩG − δr and in ωL − δr , then the\nexcitation by the fluorescence light is not resonant if δr ≫\nΓ . Because of the secular approximation we made for the\ncalculation, it is incorrect to write σR as the sum of 16\nterms, coming from the overlap of the four components of\n\n\f10\n\nRudy Romain, Daniel Hennequin and Philippe Verkerk: Phase-space description of the magneto-optical trap\n\nthe fluorescence with the four absorption lines. We have\nto consider separately the different cases.\nIn general, for large detunings and intensities (Ω, |∆| ≫\nΓ ) and large light-shifts (δr ≫ Γ ), the resonant term of\nthe 2-level system dominates the sum, and one should drop\nall the other terms to be consistent with the secular approximation done before. The resulting cross-section has\nthus the following simple expression :\nσR =\n\n∆2 Ω 2\nσ0\n4 4∆4 + 8∆2 Ω 2 + 3Ω 4\n\n(27)\n\nAs already mentioned, the contribution due to the noncoupled level is never exactly resonant. However, if |∆| ≫\nΩ, the light-shift, δr ≃ Ω 2 /4 |∆|, can be arbitrarily small,\nleading to an almost resonant behaviour if δr . Γ . In the\ncase where |∆| ≫ Ω ≫ Γ and Γ & Ω 2 /4 |∆|, we take into\naccount the quasi resonant contribution of the third level :\n\u001a\n\u001b\n16 ∆2 Γ 2\nσ0 Ω 2\n1+ 4\n(28)\nσR =\n16 ∆2\nΩ + 16 ∆2 Γ 2\n\nRéférences\n1. L. Guidoni and P. Verkerk, J. Opt. B : Quantum Semiclass.\nOpt. 1 R23 (1999)\n2. Cold Molecules : Theory, Experiment, Applications, edited by Roman Krems, Bretislav Friedrich and William C\nStwalley (CRC Press, Boca Raton, 2009)\n3. M. H. Anderson, J. R. Ensher, M. R. Matthews, C. E.\nWieman and E. A. Cornell, Science 269 198-201 (1995)\n4. D. Wilkowski, J. Ringot, D. Hennequin and J. C. Garreau,\nPhys. Rev. Lett. 85 1839-1842 (2000)\n5. G. Labeyrie, F. Michaud and R. Kaiser, Phys. Rev. Lett.\n96, 023003 (2006)\n6. D. Hennequin, Eur. Phys. J. D 28 135-147 (2004)\n7. A. di Stefano, M. Fauquembergue, P. Verkerk and D. Hennequin, Phys. Rev. A 67 033404 (2003)\n8. A. di Stefano, P. Verkerk and D. Hennequin, Eur. Phys. J.\nD 30 243-258 (2004)\n9. T. Pohl, G. Labeyrie, and R. Kaiser, Phys. Rev. A 74,\n023409 (2006)\n10. T.G. Walker, D.W. Sesko, and C. Wieman, Phys. Rev.\nLett. 64, 408 (1990)\n11. L. Pruvost, I. Serre, H. T. Duong, and J. Jortner, Phys.\nRev. A 61, 053408 (2000)\n12. J. T. Mendonça, R. Kaiser, H. Terças, and J. Loureiro,\nPhys. Rev. A 78, 013408 (2008)\n13. D.W. Sesko, T.G. Walker, and C. Wieman, J. Opt. Soc.\nAm. B 8 946 (1991)\n14. H. Neunzert, M. Pulvirenti and L. Triolo, Math. Methods\nAppl. Sci. 6 527-538 (1984)\n15. Javier Ramos-Caro and Guillermo A González, Class.\nQuantum Grav. 25 045011 (2008)\n16. Dario Benedetto, Emanuele Caglioti, François Golse, and\nMario Pulvirenti, Comm. Math. Sci. 2, 121 (2004)\n\n17. R. Warnock, Nucl. Instrum. Methods Phys. Res., Sect. A\n561, 186 (2006).\n18. J. Dalibard and C. Cohen-Tannoudji, J. Opt. Soc. Am. B\n6, 2023 (1989)\n19. C. Cohen-Tannoudji, J. Dupont-Roc, and G. Grynberg,\nAtom-Photon Interactions (Wiley, New York, 2004)\n20. B.R. Mollow, Phys. Rev. 188, 1969 (1969)\n\n\f"}