{"id": "http://arxiv.org/abs/1110.4769v2", "guidislink": true, "updated": "2011-12-16T13:32:51Z", "updated_parsed": [2011, 12, 16, 13, 32, 51, 4, 350, 0], "published": "2011-10-21T12:14:00Z", "published_parsed": [2011, 10, 21, 12, 14, 0, 4, 294, 0], "title": "WIMP-nucleon cross-section results from the second science run of\n  ZEPLIN-III", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1110.1462%2C1110.5232%2C1110.0879%2C1110.0099%2C1110.0141%2C1110.3747%2C1110.3305%2C1110.4220%2C1110.2806%2C1110.2492%2C1110.6565%2C1110.2159%2C1110.3006%2C1110.5599%2C1110.2527%2C1110.1082%2C1110.2156%2C1110.0584%2C1110.1150%2C1110.3279%2C1110.2232%2C1110.2038%2C1110.5793%2C1110.4919%2C1110.2848%2C1110.6543%2C1110.3354%2C1110.0333%2C1110.4190%2C1110.3317%2C1110.0809%2C1110.1280%2C1110.3856%2C1110.2646%2C1110.4675%2C1110.2664%2C1110.5284%2C1110.5984%2C1110.0672%2C1110.5498%2C1110.3534%2C1110.6482%2C1110.0312%2C1110.4591%2C1110.0942%2C1110.2063%2C1110.4089%2C1110.1161%2C1110.3700%2C1110.4769%2C1110.0414%2C1110.3087%2C1110.3684%2C1110.2043%2C1110.4861%2C1110.5813%2C1110.5397%2C1110.0745%2C1110.4978%2C1110.1855%2C1110.5349%2C1110.3886%2C1110.0914%2C1110.2426%2C1110.5512%2C1110.2892%2C1110.4004%2C1110.6926%2C1110.4867%2C1110.6539%2C1110.1601%2C1110.1067%2C1110.0875%2C1110.4443%2C1110.2150%2C1110.6651%2C1110.4383%2C1110.6326%2C1110.5867%2C1110.1439%2C1110.6767%2C1110.0686%2C1110.5073%2C1110.0394%2C1110.0946%2C1110.1591%2C1110.1923%2C1110.2814%2C1110.0411%2C1110.0426%2C1110.3242%2C1110.6458%2C1110.2387%2C1110.1542%2C1110.0388%2C1110.3032%2C1110.4927%2C1110.4690%2C1110.2142%2C1110.5615%2C1110.3901&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "WIMP-nucleon cross-section results from the second science run of\n  ZEPLIN-III"}, "summary": "We report experimental upper limits on WIMP-nucleon elastic scattering cross\nsections from the second science run of ZEPLIN-III at the Boulby Underground\nLaboratory. A raw fiducial exposure of 1,344 kg.days was accrued over 319 days\nof continuous operation between June 2010 and May 2011. A total of eight events\nwas observed in the signal acceptance region in the nuclear recoil energy range\n7-29 keV, which is compatible with background expectations. This allows the\nexclusion of the scalar cross-section above 4.8E-8 pb near 50 GeV/c^2 WIMP mass\nwith 90% confidence. Combined with data from the first run, this result\nimproves to 3.9E-8 pb. The corresponding WIMP-neutron spin-dependent\ncross-section limit is 8.0E-3 pb. The ZEPLIN programme reaches thus its\nconclusion at Boulby, having deployed and exploited successfully three liquid\nxenon experiments of increasing reach.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1110.1462%2C1110.5232%2C1110.0879%2C1110.0099%2C1110.0141%2C1110.3747%2C1110.3305%2C1110.4220%2C1110.2806%2C1110.2492%2C1110.6565%2C1110.2159%2C1110.3006%2C1110.5599%2C1110.2527%2C1110.1082%2C1110.2156%2C1110.0584%2C1110.1150%2C1110.3279%2C1110.2232%2C1110.2038%2C1110.5793%2C1110.4919%2C1110.2848%2C1110.6543%2C1110.3354%2C1110.0333%2C1110.4190%2C1110.3317%2C1110.0809%2C1110.1280%2C1110.3856%2C1110.2646%2C1110.4675%2C1110.2664%2C1110.5284%2C1110.5984%2C1110.0672%2C1110.5498%2C1110.3534%2C1110.6482%2C1110.0312%2C1110.4591%2C1110.0942%2C1110.2063%2C1110.4089%2C1110.1161%2C1110.3700%2C1110.4769%2C1110.0414%2C1110.3087%2C1110.3684%2C1110.2043%2C1110.4861%2C1110.5813%2C1110.5397%2C1110.0745%2C1110.4978%2C1110.1855%2C1110.5349%2C1110.3886%2C1110.0914%2C1110.2426%2C1110.5512%2C1110.2892%2C1110.4004%2C1110.6926%2C1110.4867%2C1110.6539%2C1110.1601%2C1110.1067%2C1110.0875%2C1110.4443%2C1110.2150%2C1110.6651%2C1110.4383%2C1110.6326%2C1110.5867%2C1110.1439%2C1110.6767%2C1110.0686%2C1110.5073%2C1110.0394%2C1110.0946%2C1110.1591%2C1110.1923%2C1110.2814%2C1110.0411%2C1110.0426%2C1110.3242%2C1110.6458%2C1110.2387%2C1110.1542%2C1110.0388%2C1110.3032%2C1110.4927%2C1110.4690%2C1110.2142%2C1110.5615%2C1110.3901&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We report experimental upper limits on WIMP-nucleon elastic scattering cross\nsections from the second science run of ZEPLIN-III at the Boulby Underground\nLaboratory. A raw fiducial exposure of 1,344 kg.days was accrued over 319 days\nof continuous operation between June 2010 and May 2011. A total of eight events\nwas observed in the signal acceptance region in the nuclear recoil energy range\n7-29 keV, which is compatible with background expectations. This allows the\nexclusion of the scalar cross-section above 4.8E-8 pb near 50 GeV/c^2 WIMP mass\nwith 90% confidence. Combined with data from the first run, this result\nimproves to 3.9E-8 pb. The corresponding WIMP-neutron spin-dependent\ncross-section limit is 8.0E-3 pb. The ZEPLIN programme reaches thus its\nconclusion at Boulby, having deployed and exploited successfully three liquid\nxenon experiments of increasing reach."}, "authors": ["D. Yu. Akimov", "H. M. Araujo", "E. J. Barnes", "V. A. Belov", "A. Bewick", "A. A. Burenkov", "V. Chepel", "A. Currie", "L. DeViveiros", "B. Edwards", "C. Ghag", "A. Hollingsworth", "M. Horn", "W. G. Jones", "G. E. Kalmus", "A. S. Kobyakin", "A. G. Kovalenko", "V. N. Lebedenko", "A. Lindote", "M. I. Lopes", "R. Luscher", "P. Majewski", "A. StJ. Murphy", "F. Neves", "S. M. Paling", "J. Pinto da Cunha", "R. Preece", "J. J. Quenby", "L. Reichhart", "P. R. Scovell", "C. Silva", "V. N. Solovov", "N. J. T. Smith", "V. N. Stekhanov", "T. J. Sumner", "C. Thorne", "R. J. Walker"], "author_detail": {"name": "R. J. Walker"}, "author": "R. J. Walker", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1016/j.physletb.2012.01.064", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1110.4769v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1110.4769v2", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "astro-ph.CO", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "astro-ph.CO", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "hep-ex", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1110.4769v2", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1110.4769v2", "arxiv_comment": null, "journal_reference": null, "doi": "10.1016/j.physletb.2012.01.064", "fulltext": "WIMP-nucleon cross-section results\nfrom the second science run of ZEPLIN-III\nD.Yu. Akimova , H.M. Araújob,∗, E.J. Barnesc , V.A. Belova , A. Bewickb , A.A. Burenkova, V. Chepeld , A. Currieb ,\nL. DeViveirosd , B. Edwardse , C. Ghagc , A. Hollingsworthc , M. Hornb , W.G. Jonesb , G.E. Kalmuse , A.S. Kobyakina,\nA.G. Kovalenkoa, V.N. Lebedenkob , A. Lindoted,e , M.I. Lopesd , R. Lüschere , P. Majewskie , A.St J. Murphyc ,\nF. Nevesd,b , S.M. Palinge , J. Pinto da Cunhad , R. Preecee , J.J. Quenbyb , L. Reichhartc , P.R. Scovellc , C. Silvad ,\nV.N. Solovovd, N.J.T. Smithe , V.N. Stekhanova , T.J. Sumnerb , C. Thorneb , R.J. Walkerb\n\narXiv:1110.4769v2 [astro-ph.CO] 16 Dec 2011\n\na Institute\n\nfor Theoretical and Experimental Physics, Moscow, Russia\nEnergy Physics group, Blackett Laboratory, Imperial College London, UK\nc School of Physics & Astronomy, SUPA University of Edinburgh, UK\nd LIP–Coimbra & Department of Physics of the University of Coimbra, Portugal\ne Particle Physics Department, STFC Rutherford Appleton Laboratory, Chilton, UK\nb High\n\nAbstract\nWe report experimental upper limits on WIMP-nucleon elastic scattering cross sections from the second science run of\nZEPLIN-III at the Boulby Underground Laboratory. A raw fiducial exposure of 1,344 kg*days was accrued over 319 days\nof continuous operation between June 2010 and May 2011. A total of eight events was observed in the signal acceptance\nregion in the nuclear recoil energy range 7–29 keV, which is compatible with background expectations. This allows the\nexclusion of the scalar cross-section above 4.8×10−8 pb near 50 GeV/c2 WIMP mass with 90% confidence. Combined\nwith data from the first run, this result improves to 3.9×10−8 pb. The corresponding WIMP-neutron spin-dependent\ncross-section limit is 8.0×10−3 pb. The ZEPLIN programme reaches thus its conclusion at Boulby, having deployed and\nexploited successfully three liquid xenon experiments of increasing reach.\nKeywords: ZEPLIN-III, dark matter, WIMPs, liquid xenon detectors\n1. Introduction\nDirect, indirect and accelerator searches for neutralino\ndark matter are now probing regions of parameter space\nfavoured by minimal supersymmetric (SUSY) extensions\nto the standard model, in particular those constrained at\nthe unification scale and by measurements of cosmological cold dark matter abundance. SUSY is motivated by\nthe need to stabilise the weak scale, but it is remarkably\npersuasive that R-parity conserving flavours of the theory lead to an excellent WIMP dark matter candidate in\nthe form of the lightest SUSY particle. However, at a\ntime when no evidence for SUSY has yet emerged at the\nLHC [1, 2, 3, 4, 5], it is worth noting that direct searches,\nsuch as the one reported here, aim to detect any WIMP,\nnot just neutralinos. Such experiments exploit the possibility that WIMPs may scatter off ordinary baryonic matter. The experimental challenge lies in conducting a rare\nevent search (.1 evt/kg/yr) whilst maintaining efficient\ndetection of very low energy signatures (few keV). Liquid\nxenon (LXe) is an excellent target material for intermediate mass WIMPs due to its high atomic mass and sensitivity in two response channels (scintillation and ionisation).\n∗ Corresponding\n\nauthor\nEmail address: h.araujo@imperial.ac.uk (H.M. Araújo)\n\nPreprint submitted to Elsevier\n\nSignificantly, these allow discrimination between electron\nrecoils resulting from radioactivity backgrounds and the\nnuclear recoils expected from WIMP elastic scattering.\nThe ZEPLIN-III experiment operated at the Boulby laboratory (UK) under a rock overburden of 2,850 m water\nequivalent. This two-phase xenon emission detector measures both scintillation and ionisation responses from particle interactions in its 12-kg LXe target. Approximately\nhalf of this mass forms a 'fiducial' region with well understood performance and backgrounds. The ionisation\nreleased at an interaction site is drifted upward and emitted into a thin (few mm) vapour phase above the liquid,\nwhere it is converted into an optical signal via electroluminescence. This is achieved with a strong electric field\nof 3–4 kV/cm in the liquid phase (approximately twice as\nstrong in the gas). An array of 31 photomultiplier tubes\n(PMTs) is located within the cold liquid and views the\n36.5-mm thick active region above it. The array responds\nto the prompt scintillation and the delayed electroluminescence signals (termed S1 and S2, respectively). A detailed\ndescription of the detector design and construction can be\nfound in Refs. [6, 7]. This time projection chamber configuration allows very good position reconstruction in three\ndimensions, as well as electron/nuclear recoil discrimination which is critical for WIMP searches [8, 9, 10].\nDecember 19, 2011\n\n\fThe first science run (FSR) of the experiment in 2008\nplaced very competitive upper limits on the WIMPnucleon scattering cross sections in several interaction\nmodels [11, 12, 13]. The FSR sensitivity was limited by\nbackground originating from PMT γ-rays. In particular,\nthe most challenging event topology in ZEPLIN-III comes\nfrom multiple-scintillation single-ionisation (MSSI) events,\nwhereby a single interaction vertex in the active region\n(producing both S1 and S2) is accompanied by one or\nmore scatters in a region yielding no charge (S1 only). As\nthe scintillation responses are effectively time-coincident,\nS2/S1 ratios reconstructed for these γ-ray events are essentially lower than typical for single-scatter electron recoils,\nand they can leak down to the nuclear recoil acceptance\nregion. Nevertheless, we were able to achieve an average\nelectron/nuclear recoil discrimination power of 7,800:1 in\nthe 2–16 keVee WIMP search region, which is the best\nreported for a LXe detector (hereafter, 'keVee' represents\nthe electron-equivalent energy as calibrated by 122 keV\n57\nCo γ-rays and 'keVr' denotes nuclear recoil energy).\nTwo upgrades of the experiment had been planned from\nits inception. The first was the replacement of the PMT\narray, which dominated the γ-ray and neutron background\nbudgets in the FSR by a large factor. A new PMT model\n(ETEL D766Q [14]) was developed in collaboration with\nthe manufacturers, which delivered a 40-fold improvement\nin γ-ray activity per unit. This allowed an 18-fold reduction in overall electron recoil background at low energies\nrelative to the FSR. In Ref. [15] we analysed the radioactivity backgrounds affecting the experiment in the second run\nand showed that they were predicted with good precision.\nUnfortunately, the optical and electrical performances of\nthe new PMTs were substantially poorer than those of\nthe previous tubes; worse still, the dispersion of gains and\nquantum efficiencies (QE) posed very considerable problems to data analysis. Obtaining a set of working PMTs\nand coping with this variability across the array became\nthe main challenge of the second run.\nThe second major upgrade was the addition of an anticoincidence veto system, which was retrofitted around the\nZEPLIN-III target [16, 17]. This 52-module plastic scintillator detector envelops a Gd-loaded polypropylene shield\n(≈3π coverage) which provides moderation and radiative\ncapture of internal neutrons; the mean capture time is\n10.7±0.5 μs. The assembly fits inside the lead shield used\nin the FSR. The veto provides 60% tagging efficiency for\ninternal neutrons, mostly derived from a 0.2–70 μs delayed\ncoincidence window from the ZEPLIN-III trigger point\n(58%); elastic recoils in the plastic scintillator within a\nnarrow prompt window (±0.2 μs) make up the remaining\nneutron efficiency. The tagging efficiency for γ-rays in the\nprompt window was 28%. Adding to its background rejection capability, this tonne-scale detector provides a useful\nsource of diagnostic for the radiation environment around\nthe instrument.\nMinor upgrades were also implemented to aid with calibration of ZEPLIN-III. The radioactive source delivery\n\nsystem was fully automated. A copper structure ('phantom' grid) was installed above the anode mirror; this cast\na shadow from 57 Co γ-rays onto the LXe surface, thus providing calibration of the position reconstruction algorithm.\nA new fibre-coupled LED light gun helped with calibration of the PMT single photoelectron responses. All of the\nabove upgrades were manufactured from low background\ncomponents.\n2. Second science run\nIn the second science run (SSR), WIMP-search data\nwere acquired over 319 days between 24th Jun 2010 and\n7th May 2011, giving a fiducial exposure of 1,344 kg*days.\nA 20% reduction from the FSR fiducial mass to 5.1 kg was\nmotivated by the poor performance of peripheral PMTs.\nEven so, the SSR accumulated 3 times more exposure,\nand achieved the longest continuous WIMP run of a xenon\ndetector to date. A daily operational duty cycle of 96%\nwas achieved consistently, with 1 hr per day reserved for\n57\nCo calibration and cryogen re-filling; these tasks were\nautomated and controlled remotely. On a weekly basis,\nthe system levelling was adjusted (to compensate for local geological movement) and the target and veto PMTs\nwere calibrated with their respective fibre-coupled LED\nsystems. The gas phase was ∼3.5 mm thick and kept at\n1.6 bar, with 13 mbar rms variability within the dataset.\nThe electric field in the liquid was 3.4 kV/cm. A free\nelectron lifetime of 14 μs was achieved by prior purification with a hot getter (comparable to the 13-μs drift time\nfor the deepest fiducial interactions). As observed in the\nFSR, the lifetime increased steadily without external purification during the run, and eventually reached ∼45 μs.\nData acquisition procedures were described with the\nFSR results [11] and we provide only a brief summary\nhere. The ZEPLIN-III trigger is derived from the 31-PMT\nsum signal; the SSR hardware threshold corresponded to\nthe electroluminescence of ≈5 electrons; this translates to\n≈10 ionisation electrons in the liquid (average over fiducial interactions in the dataset) when the finite electron\nlifetime and 66% emission probability at the surface are\naccounted for. Single emitted electrons generate a mean\nresponse of 11.8±0.4 photoelectrons (phe); a study of the\nsingle electron signature can be found in Ref. [18]. This S2derived signal also triggers the veto data acquisition. The\ntwo data streams are recorded and reduced separately, and\nsynchronised offline. The ZEPLIN-III waveforms are digitised at 500 MS/s for ±18 μs around the trigger point. Key\ndetector and environmental data from the 'slow control'\nacquisition system were embedded into the main data.\n2.1. Data analysis\nPulse-finding and parametrisation of the waveforms\nwere carried out by ZE3RA [19], our event reduction software. The reduced data were then searched for single scatter events (single S1 and S2 pulses) which were retained for\n2\n\n\ffurther analysis. Several corrections were applied, mainly\nto the S2 response, based either on the slow-control information embedded with each event, or on historical trends\nderived from the daily calibration. The mean electron\nlifetime correction was 37%, averaged over the fiducial\ndataset; also corrected were the electronics gain drift (4.7%\nrms), detector tilt (1.9%) and pressure variations (1.1%).\nA vertex reconstruction algorithm estimated the energy\n(E) and position (x,y) of the interactions, with a maximum likelihood fit to the S1 response and a least squares\nfit to the S2 channel [20]. The algorithm fits to 31 empirical response functions simultaneously. These model the\nresponse of a PMT as a function of distance to its axis,\nand are derived from calibration data in an iterative procedure which also 'flat-fields' the array. The spatial resolution thus achieved was 13 mm in S1 and 1.6 mm in\nS2 (FWHM) for the inner 100 mm radius. The (E,x,y)\nparameter space was navigated with a simplex method to\nobtain the best fit point for each event; spatial maps of\nlikelihood and χ2 could also be produced to help identify\nmultiple vertices.\nFinally, fiducialisation and quality cuts were applied to\nthe data. A central region of 140 mm radius containing 5.1 kg of LXe was retained. The quality cuts eliminate likely MSSI events and outliers in several parameters\n(e.g. goodness-of-fit of S1 and S2 reconstructions). An S1\npulse timing cut was also used to exploit modest pulse\nshape discrimination at the higher energies [21]. The inefficiencies incurred from these cuts are described in the\nnext section. Unsurprisingly, they are more severe than\nhad been required for FSR data.\nA blind analysis was conducted during the initial optimisation of the quality cuts and definition of the WIMP acceptance region: low energy events in and around the signal region were kept hidden from visualisation and reduction using a 'blindness manager' implemented in ZE3RA.\nVetoed events (mostly γ-rays) were excluded from this\nlist, thus providing a (practically) signal-free population\nof background events. This blind analysis was not pursued to its ultimate conclusion but the acceptance region\n(which had been defined blindly) was retained in order to\navoid major bias in estimating a potential signal.\n\n0.2\n0\nlog(S2/S1)\n\n-0.2\n-0.4\n-0.6\n-0.8\n-1\n-1.2\n0\n\n0.25 0.5 0.75\n\n1\n\n1.25 1.5 1.75\n\n2\n\n2.25 2.5\n\nlog(S1 energy/keVee)\n\nFigure 1: Discrimination parameter as a function of S1-derived energy for Am-Be neutron calibration. The recoil population median\nand ±2-σ lines are shown (in blue), along with the 2–12 keVee search\nbox (dashed green).\n\nmicroscopic anti-correlation yielded 16.4% (FWHM) for\nthe new array, against a very impressive 8.4% achieved for\nFSR data using the same analysis codes. In thin LXe targets like ZEPLIN-III individual PMTs collect a large fraction of the scintillation light of an event; the uniformity of\nresponse in the array becomes therefore more critical than\nin high-reflectance chambers with deeper geometries. In\nspite of this, a spatial resolution of 1.6 mm (FWHM) in\nthe horizontal plane was achieved in the SSR, measured\nfrom the shadow pattern cast by the new phantom grid\nfor 57 Co γ-rays [20].\nThe electron-recoil population was calibrated with a\n4.6 kBq 137 Cs source located above the instrument, producing a rate of 150 c/s in the detector. The number\nof low-energy events thus obtained was similar to that of\nbackground electron recoils in the search data.\nThree neutron calibrations took place during SSR datataking, totalling 10 hours of exposure to an Am-Be\n(α, n) source emitting 1,321±14 n/s [22]; absolute differential rates of nuclear recoils from elastic scatters agreed\nwithin statistical errors for these datasets. The delayedcoincidence veto efficiency for such events was 58% independently of recoil energy [17] (the delayed detection is\nprovided by 158 Gd γ-rays rather than by the neutrons\ndirectly). One such run is depicted in Figure 1. The\nrecoil band populated by neutron elastic scattering was\nparametrised by Gaussian fitting to the discrimination\nparameter log10 (S2/S1) in 1 keVee (S1) bins. Energydependent mean (μ) and width (σ) parameters were used\nto define a signal acceptance region in the range 2–12 keVee\nand including approximately the lower half of signal acceptance as indicated in the same figure: from 2.3% (μ − 2σ)\nto 45% (μ − 0.126σ). This region was defined after a gradual unblinding of surrounding data in the WIMP search\ndataset, with outer regions progressively discarded and\nthen opened for analysis as 'sidebands'.\n\n2.2. Calibration and efficiencies\nDaily calibration with 57 Co γ-rays (mostly 122 keV) defined the S1 and S2 energy scales and monitored their\nstability throughout the run; it also provided a regular\nmeasurement of the detector tilt (through the spatial dependence of the S2 pulse width) and of the free electron\nlifetime (by S2/S1 ratio with interaction depth). The latter parameter was confirmed independently with a new\nmethod based on single electron counting operating on the\nactual science data waveforms [18].\nIn the SSR the light yield of the chamber (fiducial average) was 1.3 phe/keVee, down from 1.8 phe/keVee in the\nFSR. The energy resolution was similarly affected; a linear\ncombination of S1 and S2 responses which exploits their\n3\n\n\fdetection efficiencies\n\nrelative scintillation efficiency\n\n1.2\n\n2.9\n\n7.5\n\n22.8\n\nand the laboratory rock; muon-induced neutrons contribute negligibly. The overall predicted rate is 3.05±0.5\nevents/year in 5–50 keVr assuming unity detection efficiency, as detailed in Ref. [15]. Translated to the\nSSR effective exposure and search region this gives only\n0.06±0.01 events in anti-coincidence with the veto.\nA low-energy electron recoil background rate of\n0.75 evts/kg/day/keVee ('dru') was measured in the fiducial volume (with no quality cuts applied), which represents a 20-fold reduction brought about by the new phototubes. Monte Carlo predictions from a comprehensive inventory of background sources, based on component-level\nradio-assays, indicated 0.86±0.05 dru [15]. Background\nelectron recoils are promptly tagged in the external veto\nwith 28% efficiency below ∼100 keVee. This confirms that\ninternal β − emitters are insignificant, since the veto efficiency for coincident γ-rays is practically identical to this\nvalue. Independently, we measured the 85 Kr decay rate at\n7±2 mdru [15].\nAssuming the discrimination factor achieved in the first\nrun, electron-recoil event leakage into the WIMP acceptance region should represent <1 event, in line with the\naspiration of a background-free second run which motivated the experiment upgrades. However, analysis of the\nprompt-vetoed γ-rays revealed that this was unlikely to be\nthe case. Background predictions (discussed below) based\non extrapolation of the electron recoil population into the\nsignal box and from low-energy 137 Cs data indicated that\na handful of unvetoed events (7–9) were expected, confirming a loss of discrimination power.\n\n48.1 keVee\n\n0.3\nsearch region\n0.2\nLeff\n0.1\n\n0\n0.4\n\nη3η0\n\nη1η0\n\nη2η0\n\n0.3\n0.2\n\nη\n\n0.1\n0\n5\n\n10\n\n20\n\n50\n\n100\n\nnuclear recoil energy, keVr\n\nFigure 2: Nuclear recoil efficiencies. Above: relative scintillation\nefficiency for nuclear recoils in LXe at zero electric field; the thick\nblue curve (adopted) combines the measurements and uncertainties\nreported in Ref. [23] for FSR data (68% confidence region, in red) and\nSSR data (green). Below: recoil detection efficiencies; η subsumes a\nflat component η0 =39.8% (dominated by signal acceptance in S2/S1)\nand three energy-dependent factors: η1 is the S1 detection efficiency\nfrom the 3-fold PMT coincidence required in software; η2 is incurred\nfrom quality cuts; η3 relates to the timing cut on S1 pulses.\n\nNew measurements of the relative scintillation efficiency\nfor nuclear recoils in LXe (Leff ) were derived from FSR\nand SSR calibration data [23]. The decreasing Leff curves\nobtained therein were mutually consistent and agree,\nwithin experimental errors, with recent neutron beam\ndata [24, 25]. For the purpose of converting between\nelectron and nuclear recoil energies we combined the two\nZEPLIN-III measurements into the curve shown in Figure 2 (upper panel). The SSR WIMP search region corresponds to 7.4–29 keVr.\nThe nuclear recoil detection efficiency comprises several components. A set of constant factors combine to\nη0 =39.8%, including: DAQ livetime fraction (99.2%),\nwaveform quality cuts (98.3%), cuts on robustness of\npulse parametrisation (96.9%), veto random coincidences\n(99.6% and 99.0% for the prompt and delayed windows,\nrespectively) and the above signal acceptance fraction\n(42.7%). Three additional curves, shown in Figure 2 (lower\npanel), describe the detection efficiency for S1 pulses (3fold requirement in software), the efficiency of the data\nquality cuts and the additional timing cut on S1 signals\nfor pulse shape discrimination. The effective exposure for\na 50 GeV/c2 WIMP was 251 kg*days.\n\n3. WIMP-search results\nUpon unblinding, 12 events were observed in the acceptance region. A detailed waveform inspection revealed\nlarger than expected cross-talk artifacts due to the poor\nelectrical performance of the SSR PMTs: gains differed\nby as much as 100 times within the array, and the extra\namplification required in some channels exposed contamination from the higher gain channels (the array is powered\nby a single HV supply using common dynode electrodes\ninternally). Tighter cuts on the goodness-of-fit of the reconstructed vertex were required to deal with this issue\n(Figure 2 already reflects this). The result of the final\n(non-blind) analysis is shown in Figure 3. Eight events remained in the box. The event reconstructed at 3.2 keVee\nin S1 and 1.1 keVee in S2 appears far below the mean\nlog10 (S2/S1) for typical electron recoils with that S1 signal, but this is not necessarily anomalous: a median S2\nsignal of 1.1 keVee corresponds to electron recoils with\nonly 0.6 keVee in S1 (cf. yellow line in Figure 3). Given\n1.3 phe/keVee scintillation yield, 0.8% of all events with\nthat S1 expected would generate ≥4 phe due to Poisson\nfluctuation, thereby producing the observed log10 (S2/S1)\nratio or lower. Considering the detected rate of electron\nrecoils, one such low-lying event is consistent with background.\n\n2.3. Experiment backgrounds\nNuclear recoils from neutron single elastic scattering\npose an irreducible background to direct WIMP searches.\nIn ZEPLIN-III, detected radioactivity neutrons are most\nlikely to arise in the ceramic feedthroughs, the PMTs\n4\n\n\fTable 1: Observations (nobs ), background estimates (μb1,2 ) and limits on the signal expectation (μs ) for the first (FSR) and second (SSR)\nruns of ZEPLIN-III. Fiducial and net effective exposures (50 GeV/c2 WIMP) are presented along with relevant signal acceptance parameters.\nElectron recoil background expectations are estimated from Skew-Gaussian (SG) fits to data above the search region in 2 keVee bins and also\nfrom 137 Cs calibration. The 90% CL limit on the number of signal events in each run is derived with the Profile Likelihood Ratio method.\n\nrun\nFSR\nSSR\n\nkg*days\n(net)\n437.0\n(107.3)\n1,343.8\n(251.0)\n\nacceptance\nkeVr fraction\n7–35 29–50%\n2–29%\n7–29 24–45%\n2–24%\n\nnobs\n4\n1\n7\n1\n\nneutrons\nμb1\n0.5±0.3\n0.7±0.3\n0.03±0.005\n0.03±0.005\n\nNo delayed coincidences were recorded below the nuclear\nrecoil median and those registered above it are statistically consistent with random coincidences. This allows\nus to set an upper limit of 0.75 neutron events for the\nsearch region (90% CL), confirming the successful mitigation of the neutron background. Two methods were used\nto predict counts from electron recoil backgrounds; both\nare in good agreement with the observation, suggesting\nno significant signal. Binned Skew-Gaussian (SG) fits to\nthe log10 (S2/S1) parameter above the search region, as in\nthe FSR analysis [11], predict a total of 6.5±3.4 events\n(cf. 8 observed). 137 Cs calibration data provided independent confirmation of this background within the available\naccuracy, with no contamination from signal and no assumption of a functional dependence for electron recoils;\nthis yielded 9 events for 96% equivalent exposure.\nTo account for non-uniform background in log10 (S2/S1)\nwe partitioned the search region in two; this was done explicitly to maximise sensitivity given the SG background\ndistributions. Note that the contents of the search region were not considered in this optimisation. To achieve\nthis the partition was incremented systematically and the\nbackground distribution was sampled by Monte Carlo under the null hypothesis; the best sensitivity, calculated by\nthe Feldman-Cousins (FC) method [26], is reached at 24%\nacceptance. The observations in the resulting bins were\nseven and one events, as shown in Figure 3 (lower). Table 1 confronts observations and background estimates for\nthe partitioned search region.\nReanalysis of FSR data with updated SSR software, motivated by the new Leff measurements of Ref. [23], revealed\nfive events in the FSR search region (which we kept unchanged from the original analysis). Background expectations from SG fitting to these data are also presented\nin Table 1. In this instance the 137 Cs calibration overpredicted the observations very significantly, which may be\ncaused by rate-dependent photocathode charging effects in\nthis (FSR) run [27] or other systematic differences between\nthe two calibrations. We consider, however, that the SG\nfunction provides an appropriate description of our background as validated by the SSR 137 Cs calibration. Once\nthe non-negligible neutron contribution is included, the\nFSR prediction is 7.9±4.8 (cf. 5 observed). The same\ndata-blind optimisation procedure led to a partition at\n\nelectron recoils, μb2\nSG fit\nCs-137\n5.2±3.1\n–\n1.5±1.7\n–\n5.5±2.2 8.3±2.9\n1.0±1.2 1.0±1.0\n\nμs\n90% CL\n<4.2\n<5.1\n\n29%; in this run one event was just below that division\nin log10 (S2/S1), at 28.8% acceptance.\n3.1. Signal inference\nA confidence interval for the signal expectation (μs ) in\nthe SSR acceptance region was obtained with a Profile\nLikelihood Ratio (PLR) method which accounts for the\nuncertainty in the background predictions (see, e.g. [28,\n29]). We included estimators of the nuisance parameter\nμb2 from both the SG fits and the 137 Cs calibration; the\nlatter is Poisson distributed and the SG predictions are\ntreated as Gaussian truncated at zero. The distribution of\nprofile likelihood ratio was determined by Monte Carlo to\nensure correct statistical coverage. The double-sided 90%\nCL interval for μs was 0 − 5.1 events. The same procedure\napplied to FSR data (without a 137 Cs prediction in this\ninstance) yielded 0 − 4.2 events with 90% confidence.\nThese results are quite robust with respect to the particular choice of binning and test statistic. For example, we\nconducted two-bin FC calculations with background predictions capped at observation when μb > nobs (so as not\nto benefit from downward fluctuations of background) and\nusing a 10% acceptance upper bin (as in the original FSR\nanalysis [11]). This yielded the same 4.2 events at 90%\nCL for the first run and 4.8 for the SSR. These are reassuringly close to the PLR results in Table 1, which treat\nbackground uncertainties more formally.\nExperimental upper limits on the scalar WIMP-nucleon\nelastic cross section are shown in Figure 4, calculated with\nthe standard galactic halo model (ρo =0.3 GeV/c2 /cm3 ,\nvo =220 km/s, vesc =544 km/s, and vE =232 km/s) and the\nHelm form factor [30] parametrised in Ref. [31]. A minimum cross-section limit of 8.4×10−8 pb (90% CL, double\nsided) is reached at 55 GeV/c2 WIMP mass for the FSR\n(similar to the original result [11] and slightly lower than\nthe result reported in Ref. [23] from a single-sided 'maximum patch' test statistic [32]). The minimum of the SSR\ncurve is 4.8×10−8 pb, reached at 51 GeV/c2 . Adopting\nLeff curves at the ±1σ levels from Figure 2 does not affect\nthe result at curve minimum significantly, but the value at\n10 GeV/c2 mass varies in the range (2.2–9.3)×10−6 pb.\nThe combined result for the ZEPLIN-III experiment\nwith mean Leff , obtained from a four-bin PLR calculation which returns μs <6.0 events for the aggregate expo5\n\n\f0.8\n10\n\n0.6\n\n-4\n\ncMSSM\nmSUGRA\n\nWIMP-nucleon (SI) cross-section, pb\n\n0.4\n\nlog(S2/S1)\n\n0.2\n0\n-0.2\n-0.4\n-0.6\n-0.8\n-1\n\nrecoil acceptance percentile in log(S2/S1)\n\n-1.2\n\n0\n\n5\n\n10\n15\n20\n25\n30\nenergy (S1 channel), keVee\n\n35\n\n40\n\n10\n\n10\n\n10\n\n10\n\n-5\n\n-6\n\n-7\n\n-8\n\n10\n\n100\n\n10\n\n2\n\nWIMP mass, GeV/c\n\n90\n\n10\n\n3\n\n2\n\n80\n\nFigure 4: 90%-CL limits on WIMP-nucleon spin-independent cross\nsections from ZEPLIN-III (FSR, SSR and combined) and from\nXENON100 [34], XENON10 (low energy analysis [35]), CDMS-II [36]\nand EDELWEISS-II [37]. Previous results from the ZEPLIN programme are also indicated [38, 39]. In blue we represent the 3- and\n5-σ DAMA/LIBRA contours (2008 data, no ion channelling [40]) interpreted in Ref. [41]. The magenta contour is the fit to CoGeNT\ndata under the light WIMP hypothesis [42]; in cyan is the 2-σ region\nfrom CRESST-II [43]. The crosses are the original SUSY benchmark points [44]. Favoured regions of parameter space from a 2008\nBayesian analysis in mSUGRA [45] and the likelihood analysis of\nLHC data within cMSSM [3] are also shown.\n\n70\n60\n50\n40\n30\n20\n10\n0\n\n0\n\n2\n\n4\n\n6\n\n8\n\n10\n\n12\n\n14\n\nenergy (S1 channel), keVee\n\n4. Conclusion\n\nFigure 3: Above: fiducial events in full SSR exposure. Green markers label prompt veto coincidences (mostly γ-rays); events in the\ndelayed window (mostly accidental coincidences) are in red. There\nare 8 unvetoed events in the WIMP acceptance region. The dashed\nlines show the nuclear and electron recoil band medians (in blue\nand yellow, respectively). Below: Distribution in signal acceptance\n(recoils from WIMPs and neutrons are distributed uniformly in the\ny-axis). There were seven (one) events in the upper (lower) region.\n\nIn this article we presented experimental upper limits\non WIMP-nucleon elastic scattering cross sections from\nthe second run of ZEPLIN-III at Boulby. These were derived from analysis of 1,344 kg*days of fiducial exposure\nacquired between June 2010 and May 2011. A 90% CL\nupper limit on the signal content from this exposure allows the exclusion of a scalar WIMP scattering cross section above 4.8×10−8 pb/nucleon near 50 GeV/c2 mass.\nThe combined result for the two runs constrains the scalar\ncross section to 3.9×10−8 pb and the WIMP-neutron\nspin-dependent cross section to 8.0×10−3 pb. Along\nwith XENON100 [34], XENON10 [35], CDMS-II [36] and\nEDELWEISS-II [37] these results disfavour an interpretation of DAMA in terms of nuclear recoils from WIMPs as\nwell as recent results from CRESST-II under the canonical dark halo [43]. Models favoured by CoGeNT [42] are\nharder to rule out completely from our data.\nThis second run followed the upgrade of the experiment\nwith a new array of purpose-developed, low-radioactivity\nPMTs, a veto detector based on Gd-loaded polypropylene\nand plastic scintillator, and new calibration hardware. The\nautomation of the system enabled a 319-day run with excellent stability and reduced manpower underground.\n\nsure, is also shown in the figure; the curve minimum is\n3.9×10−8 pb at 52 GeV/c2 .\nExcellent sensitivity to spin-dependent WIMP-neutron\ninteractions is afforded by the odd-neutron isotopes 129 Xe\nand 131 Xe. The spin-dependent result is calculated as described in Ref. [12], accounting for the composition of our\nxenon (depleted in 136 Xe) and using Bonn-CD nucleonnucleon potentials. The FSR+SSR combined curve, shown\nin Figure 5, has a minimum of 8.0×10−3 pb at 50 GeV/c2\nmass. At the time of writing there is no corresponding\nresult from XENON100; this is expected to be a few times\nlower. The original XENON10 result [33] is not shown in\nthe figure since this had assumed a constant scintillation\nefficiency and the more favourable (∼2) Bonn A potential; a fair comparison would raise this result to above the\nZEPLIN-III curve.\n6\n\n\fing designed and constructed around the world with tonnescale fiducial masses, the ZEPLIN programme can claim\nto have pioneered some of the techniques that helped twophase xenon become a leading technology in the race to\ndiscover WIMPs.\n\nWIMP-neutron (SD) cross-section, pb\n\ncMSSM\n\n10\n\n5. Acknowledgements\n\n1\n\n10\n\n10\n\n10\n\nThe UK groups acknowledge support from the Science & Technology Facilities Council (STFC) for the\nZEPLIN-III project and for operation of the Boulby laboratory. LIP-Coimbra acknowledges financial support\nfrom Fundação para a Ciência e a Tecnologia (FCT)\nthrough project grant CERN/FP/116374/2010 and postdoctoral grants SFRH/BPD/27054/2006, /47320/2008,\n/63096/2009 and /73676/2010. ITEP acknowledge support from the Russian Foundation of Basic Research (grant\n08-02-91851 KO a) and SC Rosatom (H.4e.45.90.11.1059\nfrom 10.03.2011). We are also grateful for support provided jointly to ITEP and Imperial from the UK Royal\nSociety. ZEPLIN-III was hosted by Cleveland Potash Ltd\nat the Boulby Mine and we thank CPL management and\nstaff for their long-standing support. We also express our\ngratitude to the Boulby facility staff for their dedication.\nThe University of Edinburgh is a charitable body registered in Scotland (SC005336).\n\n-1\n\n-2\n\n-3\n\n10\n\n10\n\n2\n\nWIMP mass, GeV/c\n\n10\n\n3\n\n2\n\nFigure 5: Limits on spin-dependent WIMP-neutron cross section\n(assuming no proton interaction) from ZEPLIN-III (FSR+SSR, with\nBonn CD potentials [46]) as well as CDMS-II (2004-09 data [47, 36]\nplus low-energy (LE) analysis [48]), ZEPLIN-I [49] and ZEPLINII [50]. Also shown is the 3-σ DAMA evidence region (2008 data, no\nion channelling [40]) interpreted in Ref. [41]. The green hatched area\nis the tip of the 95% probability region for cMSSM neutralinos [51].\n\nReferences\nThe new photomultipliers were a critical item to reach\nthe design sensitivity of 1×10−8 pb*year. Although their\nradiological background was excellent (35–50 mBq/PMT),\ntheir performance compromised the experimental sensitivity by a factor of ∼4 (from reduction in fiducial mass,\nof signal acceptance fraction, of cut efficiency and from\npoorer discrimination). Electron-recoil leakage to below\nthe nuclear recoil median had been 7,800:1 in the FSR\ncompared to only 280:1 in the SSR; no other significant\nchanges were made to the internal hardware.\nThe addition of a new veto detector proved very valuable, confirming negligible neutron background and providing a useful unbiased sample of γ-ray background for\nopen analysis. In our experience, high-efficiency veto systems will be extremely important in future experiments,\nfrom the point of view of background reduction, diagnostics and enhancing their discovery power [17].\nZEPLIN-III concludes a successful series of three different LXe-based experiments operated at Boulby since the\nmid 1990s, with progressively stronger electric fields applied to their active targets. ZEPLIN-I exploited pulse\nshape discrimination at zero field and produced worldleading results [38, 49]. Delivering 1 kV/cm to the liquid\ntarget, ZEPLIN-II was the first two-phase xenon WIMP\ndetector in the world [39, 50]. ZEPLIN-III operated at\nnearly 4 kV/cm in the first run and achieved the best discrimination of any xenon detector, along with competitive\nWIMP results in general. As several systems are now be-\n\n[1]\n[2]\n[3]\n[4]\n[5]\n[6]\n[7]\n[8]\n[9]\n[10]\n[11]\n[12]\n[13]\n[14]\n[15]\n[16]\n[17]\n[18]\n[19]\n[20]\n[21]\n[22]\n[23]\n[24]\n[25]\n[26]\n[27]\n[28]\n[29]\n[30]\n[31]\n[32]\n\n7\n\nATLAS Collaboration, arXiv:1109.6606v1.\nCMS Collaboration, arXiv:1109.2352v1.\nO. Buchmueller, et al., Eur. Phys. J. C 71 (2011) 1634.\nO. Buchmueller, et al., Eur. Phys. J. C 71 (2011) 1722.\nO. Buchmueller, et al., arXiv:hep-ph/1110.3568v1.\nD. Y. Akimov, et al., Astropart. Phys. 27 (2007) 46.\nH. M. Araújo, et al., Astropart. Phys. 26 (2006) 140.\nB. A. Dolgoshein, V. N. Lebedenko, B. U. Rodionov, JETP\nLett. 11 (1970) 351.\nA. Barabash, A. Bolozdynya, JETP Lett. 49 (1989) 356.\nA. Bolozdynya, et al., IEEE Trans. Nuc. Sci. 42 (1995) 565.\nV. N. Lebedenko, et al., Phys. Rev. D 80 (2009) 052010.\nV. N. Lebedenko, et al., Phys. Rev. Lett. 103 (2009) 151302.\nD. Y. Akimov, et al., Phys. Lett. B 692 (2010) 180.\nETEL, http://www.et-enterprises.com.\nH. M. Araújo, et al., arXiv:1104.3538.\nD. Y. Akimov, et al., Astropart. Phys. 34 (2010) 151.\nC. Ghag, et al., Astropart. Phys. 35 (2) (2011) 76.\nE. Santos, et al., arXiv:1110.3056v1.\nF. Neves, et al., JINST 6 (2011) P11004.\nV. Solovov, et al., arXiv:1112.1481.\nD. Y. Akimov, et al., Phys. Lett. B 524 (2002) 245.\nTech. Rep. N887, National Physics Laboratory (UK) (2009).\nM. Horn, et al., Phys. Lett. B 705 (2011) 471.\nA. Manzur, et al., Phys. Rev. C 81 (2010) 25808.\nG. Plante, et al., arXiv:1104.2587.\nG. Feldman, R. Cousins, Phys. Rev. D 57 (7) (1998) 3873.\nH. M. Araújo, et al., Nucl. Instrum. Meth. A 521 (2004) 407.\nB. Sen, M. Walker, M. Woodroofe, Statist. Sinica 19 (2011) 201.\nW. Rolke, A. López, J. Conrad, Nucl. Instrum. Meth. A 551\n(2005) 493.\nR. H. Helm, Phys. Rev. 104 (1956) 1466.\nJ. D. Lewin, P. F. Smith, Astropart. Phys. 6 (2006) 87.\nS. Henderson, J. Monroe, P. Fisher, Phys. Rev. D 78 (2008)\n015020.\n\n\f[33]\n[34]\n[35]\n[36]\n[37]\n[38]\n[39]\n[40]\n[41]\n[42]\n[43]\n[44]\n[45]\n[46]\n[47]\n[48]\n[49]\n\nJ. Angle, et al., Phys. Rev. Lett. 100 (2008) 021303.\nE. Aprile, et al., Phys. Rev. Lett. 107 (2011) 131302.\nJ. Angle, et al., Phys. Rev. Lett. 107 (2011) 051301.\nZ. Ahmed, et al., Science 327 (2010) 1619.\nE. Armengaud, et al., Phys. Lett. B 702 (2011) 329.\nG. J. Alner, et al., Astropart. Phys. 23 (2005) 444.\nG. J. Alner, et al., Astropart. Phys. 28 (2007) 287.\nR. Barnabei, et al., Eur. Phys. J. C 56 (2008) 333.\nC. Savage, et al., JCAP 09 036.\nC. Aalseth, et al., Phys. Rev. Lett. 106 (2011) 131301.\nG. Angloher, et al., arXiv:astro-ph/1109.0702v1.\nJ. Ellis, et al., Eur. Phys. J. C 24 (2002) 311.\nR. Trotta, et al., JHEP 12 024.\nP. Toivanen, et al., Phys. Lett. B 666 (2008) 1.\nZ. Ahmed, et al., Phys. Rev. Lett. 102 (2009) 011301.\nZ. Ahmed, et al., Phys. Rev. Lett. 106 (2011) 131302.\nG. J. Alner, et al., in: N. Spooner, V. Kudryavtsev (Eds.), Proc.\nIDM'05, World Scientific, 2005, p. 218.\n[50] G. J. Alner, et al., Phys. Lett. B 653 (2007) 161.\n[51] L. Roszkowski, R. R. de Austri, R. Trotta, J. High Energy Phys.\n07 (2007) 075.\n\n8\n\n\f"}