{"id": "http://arxiv.org/abs/1103.2778v1", "guidislink": true, "updated": "2011-03-14T20:21:16Z", "updated_parsed": [2011, 3, 14, 20, 21, 16, 0, 73, 0], "published": "2011-03-14T20:21:16Z", "published_parsed": [2011, 3, 14, 20, 21, 16, 0, 73, 0], "title": "Improving the spatial resolution by effective subtraction technique at\n  Irkutsk incoherent scatter radar: the theory and experiment", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1103.5413%2C1103.5642%2C1103.2123%2C1103.2778%2C1103.3195%2C1103.2848%2C1103.4236%2C1103.2231%2C1103.0261%2C1103.1509%2C1103.3460%2C1103.4133%2C1103.5438%2C1103.5301%2C1103.3551%2C1103.0271%2C1103.2516%2C1103.2744%2C1103.4181%2C1103.0396%2C1103.5740%2C1103.4098%2C1103.4722%2C1103.5159%2C1103.0041%2C1103.5749%2C1103.5044%2C1103.1449%2C1103.6116%2C1103.1736%2C1103.3336%2C1103.0351%2C1103.3621%2C1103.4340%2C1103.4937%2C1103.2332%2C1103.4989%2C1103.0911%2C1103.4446%2C1103.3878%2C1103.1002%2C1103.3252%2C1103.5258%2C1103.3203%2C1103.1770%2C1103.3065%2C1103.4447%2C1103.0105%2C1103.6089%2C1103.1029%2C1103.1187%2C1103.5339%2C1103.1070%2C1103.0133%2C1103.2849%2C1103.0642%2C1103.3438%2C1103.4443%2C1103.1040%2C1103.0867%2C1103.5809%2C1103.6191%2C1103.3856%2C1103.2255%2C1103.0290%2C1103.1894%2C1103.4386%2C1103.0792%2C1103.4614%2C1103.0779%2C1103.4372%2C1103.3865%2C1103.5649%2C1103.3963%2C1103.4785%2C1103.3665%2C1103.1097%2C1103.0492%2C1103.4202%2C1103.2569%2C1103.1734%2C1103.1880%2C1103.1582%2C1103.0057%2C1103.3647%2C1103.3853%2C1103.5668%2C1103.3613%2C1103.2660%2C1103.0980%2C1103.1123%2C1103.6054%2C1103.1567%2C1103.1870%2C1103.0526%2C1103.2446%2C1103.2707%2C1103.2134%2C1103.6078%2C1103.3863%2C1103.5989&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Improving the spatial resolution by effective subtraction technique at\n  Irkutsk incoherent scatter radar: the theory and experiment"}, "summary": "We describe a sounding technique that allows us to improve spatial resolution\nof Irkutsk Incoherent Scatter Radar without loosing spectral resolution. The\ntechnique is based on transmitting of rectangle pulses of different duration in\nvarious sounding runs and subtracting correlation matrixes. Theoretically and\nexperimentally we have shown, that subtraction of the mean-square parameters of\nthe scattered signal for different kinds of the sounding signal one from\nanother allows us to solve the problem within the framework of quasi-static\nionospheric parameters approximation.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1103.5413%2C1103.5642%2C1103.2123%2C1103.2778%2C1103.3195%2C1103.2848%2C1103.4236%2C1103.2231%2C1103.0261%2C1103.1509%2C1103.3460%2C1103.4133%2C1103.5438%2C1103.5301%2C1103.3551%2C1103.0271%2C1103.2516%2C1103.2744%2C1103.4181%2C1103.0396%2C1103.5740%2C1103.4098%2C1103.4722%2C1103.5159%2C1103.0041%2C1103.5749%2C1103.5044%2C1103.1449%2C1103.6116%2C1103.1736%2C1103.3336%2C1103.0351%2C1103.3621%2C1103.4340%2C1103.4937%2C1103.2332%2C1103.4989%2C1103.0911%2C1103.4446%2C1103.3878%2C1103.1002%2C1103.3252%2C1103.5258%2C1103.3203%2C1103.1770%2C1103.3065%2C1103.4447%2C1103.0105%2C1103.6089%2C1103.1029%2C1103.1187%2C1103.5339%2C1103.1070%2C1103.0133%2C1103.2849%2C1103.0642%2C1103.3438%2C1103.4443%2C1103.1040%2C1103.0867%2C1103.5809%2C1103.6191%2C1103.3856%2C1103.2255%2C1103.0290%2C1103.1894%2C1103.4386%2C1103.0792%2C1103.4614%2C1103.0779%2C1103.4372%2C1103.3865%2C1103.5649%2C1103.3963%2C1103.4785%2C1103.3665%2C1103.1097%2C1103.0492%2C1103.4202%2C1103.2569%2C1103.1734%2C1103.1880%2C1103.1582%2C1103.0057%2C1103.3647%2C1103.3853%2C1103.5668%2C1103.3613%2C1103.2660%2C1103.0980%2C1103.1123%2C1103.6054%2C1103.1567%2C1103.1870%2C1103.0526%2C1103.2446%2C1103.2707%2C1103.2134%2C1103.6078%2C1103.3863%2C1103.5989&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We describe a sounding technique that allows us to improve spatial resolution\nof Irkutsk Incoherent Scatter Radar without loosing spectral resolution. The\ntechnique is based on transmitting of rectangle pulses of different duration in\nvarious sounding runs and subtracting correlation matrixes. Theoretically and\nexperimentally we have shown, that subtraction of the mean-square parameters of\nthe scattered signal for different kinds of the sounding signal one from\nanother allows us to solve the problem within the framework of quasi-static\nionospheric parameters approximation."}, "authors": ["Oleg I. Berngardt", "Dmitry S. Kushnarev"], "author_detail": {"name": "Dmitry S. Kushnarev"}, "author": "Dmitry S. Kushnarev", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1016/j.jastp.2013.03.023", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1103.2778v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1103.2778v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "4 pages, 3 figures, to appear at URSI-2011 conference", "arxiv_primary_category": {"term": "physics.space-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "physics.space-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "physics.ao-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "physics.geo-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "physics.plasm-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1103.2778v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1103.2778v1", "journal_reference": null, "doi": "10.1016/j.jastp.2013.03.023", "fulltext": "Improving the spatial resolution by effective subtraction technique at Irkutsk\nincoherent scatter radar: the theory and experiment.\nBerngardt O.I. and Kushnarev D.S.\nInstitute of Solar-Terrestrial physics SB RAS, 664033, Irkutsk, Lermontova Str., 126a, P.O.Box 291,\nRussia. berng@iszf.irk.ru\n\narXiv:1103.2778v1 [physics.space-ph] 14 Mar 2011\n\nAbstract\nWe describe a sounding technique that allows us to improve spatial resolution of Irkutsk Incoherent Scatter Radar without loosing spectral resolution. The technique is based on transmitting of rectangle pulses\nof different duration in various sounding runs and subtracting correlation matrixes. Theoretically and experimentally we have shown, that subtraction of the mean-square parameters of the scattered signal for\ndifferent kinds of the sounding signal one from another allows us to solve the problem within the framework\nof quasi-static ionospheric parameters approximation.\n\n1\n\nProblem\n\nThe problem of the spatial resolution improvement without loosing spectral resolution is one of the basic\ntechnical problems of the incoherent scatter (IS) technique (as well as other remote sensing techniques, based\non weak single backscattering from random media). In such techniques the basic parameters that provide\ninformation about media properties are spectral power, correlation function and correlation matrix of the\nscattered signal (see [1]). One can show that first two functions can be easily obtained from the third one.\nFrom scattering theory it is also known that correlation matrix of the received signal is an average of the\nirregularities correlation function over the altitudes. The integration over altitudes is made with the weight\ndefined by sounding signal shape and processing technique, and statistical averaging < ... > corresponds to\nthe averaging over the sounding runs, see [1]:\nZ\ncT\nrc\nrc\n< W (r −\n< u(T )u(T + τ ) >=\n, τ )P (r)σ(r, τ ) > dr; W (r, τ ) = a( )a( + τ )\n(1)\n2\n2\n2\nIn the literature the integration weight W (r, τ ) is referred as 'ambiguity function'. The power profile value\nP (r) takes into account the radiowaves propagation, antenna pattern and cross-section dependence on radar\nrange, σ(r, τ ) - correlation characteristics of the scatterers and a(t) - sounding signal shape.\nSo, the practical problem of the spatial resolution improvement (formulated as obtaining information\nabout correlation characteristics of the scatterers σ(r, τ ) with integration over the smallest distances range)\nmathematically leads to the problem of the sounding and processing techniques synthesis that gives the\nambiguity function W (r, τ ) with necessary characteristics.\nThe problem is currently under investigation (see [2]). But, for now, there are two most useful techniques\nfor spatial resolution improvement: with using static amplitude-modulated signals (see [3]) and with phasemodulated signals, that change theirs shape from one sounding to another (see [4]). Constructing of these\ntechniques is valid in the approximation of quasistationary media. In this approximation one can neglect\nchanges of the irregularities correlation characteristics during averaging time and averaging over the sounding\nruns becomes equivalent to the statistical averaging. The use of such techniques allows, from one side, to\nobtain high spatial resolution, defined by discrete of temporal variation of the sounding signal, and from the\nother side to obtain correlation characteristics of the irregularities at large delays (lags), defined by duration\nof the whole signal.\nThe well known difficulty of these techniques is impossibility to obtain the correlation function at all\nthe lags with the same high spatial resolution and signal-to-noise ratio. This is caused by the following\npeculiarities of these techniques: correlation function of the irregularities at zero lag can not be obtained\n\n\fwith high spatial resolution; correlation function can not be obtained at all the real lags within pulse duration,\nbut only at discrete number of lags; the number of the 'correct' correlation function lags and spatial resolution\nare usually connected: the higher spatial resolution - the more lags in correlation function you get. So one\ncan not obtian a lot of lags, necessary for correct estimation of the correlation function, when one need to\nobtain average spatial resolution (about 1/4 - 1/5 of the whole pulse length).\nWe present sounding technique that allows to improve spatial resolution of incoherent scatter technique\nwithout the problems described above.\n\n2\n\nSolution\n\nFrom (1) one can see that independence of irregularities correlation function on sounding signal shape\nallows one to use any linear combination of the correlation matrixes obtained during experiment instead\nof simple summarizing over the sounding runs(i.e. averaging over the sounding runs). In this case the\nambiguity function will be (with accuracy of the custom multiplier) the same linear combination of the\nambiguity functions for different sounding runs, summarized over the sounding run number j (the fact, for\nexample, is used in summation rules of the alternating code technique, see [4]):\nZ\nX\ncT\n, τ ) >< P (r)σ(r, τ ) > dr;\n(2)\n< W (r −\nDj uj (T )uj (T + τ ) =\n2\nX\nrc\nrc\n< W (r, τ ) >=\nDj aj ( )aj ( + τ )\n(3)\n2\n2\nThe ideal ambiguity function must allow to determine irregularities correlation function without distortion\neffects, caused by power profile P (r). At Irkutsk IS radar power profile is very irregular due to both electron\ndensity profile and Faraday variations profile (see [5]). One can show that the ideal ambiguity function must\nhave the shape:\n< W (r, τ ) >= A(r)B(τ )\n(4)\nWe have found that for obtaining the almost ideal ambiguity function we should use a simple rectangle pulse\nas a sounding signal, with constant amplitude and with two custom durations, the pulse duration should\nchange from one sounding to another: dom(a2n ) = [0, Tlong ]; dom(a2n+1 ) = [0, Tshort ]; during processing\nwe should subtract the correlation matrix for shorter pulse from the correlation matrix for longer pulse.\nIn this case D2n = 1; D2n+1 = −1 in (2). During the subtraction some parts of the ambiguity functions\nare effectively compensate each other, so we call this technique 'effective subtraction technique' (EST). It\nis important to note that (for accurate positioning the ambiguity function) the correlation matrix must be\ncalculated in the form:\n\u001a\n\u001b\nuj (T − τ )uj (T ) f or τ ≥ 0\nRj (T, τ ) =\n(5)\nuj (T )uj (T + τ ) f or τ < 0\nDuring the experiment, we should calculate correlation matrix (5), but separately for sounding by the\nlonger pulse Rlong,2n (T, τ ), and by shorter pulse Rshort,2n+1 (T, τ ). The correlation matrix REST (T, τ ) that\nprovides ambiguity function with the almost ideal shape (4) is calculated as combination of Rlong,2n (T, τ )\nand Rshort,2n+1 (T, τ ):\nX\nX\n< REST (T, τ ) >=\nRlong,2n (T, τ ) −\nRshort,2n+1 (T, τ )\n(6)\nThe delay T corresponding to the radar range should be measured from the sounding pulse start. Ambiguity\nfunctions of the correlation matrix (5) for longer pulse, shorter pulse and the difference between them (6)\nare shown at Fig.1. From the Fig.1 one can see that ambiguity function of correlation matrix (6) is close to\nthe ideal one (4). One can show that the size of ambiguity function over the range (i.e. spatial resolution)\nis proportional to the difference of the pulses duration. Also, one can see, that the size of the ambiguity\nfunction over the lags (i.e. lag resolution) is proportional to the half-sum of the pulses durations.\n\n\fFigure 1: Ambiguity function for EST (5-6): for correlation matrix for longer pulse sounding (A),for correlation matrix for shorter pulse sounding(B), and for theirs difference (C). Range and lag are in longer pulse\nduration units.\n\nFigure 2: The EST correlation matrix (5-6) for scattering from localized space scatterer during experiment\n23/12/2010.\n\n3\n\nExperimental results\n\nThe EST was tested at Irkutsk IS radar [5] during the experiment 22-23/12/2010. As a sounding pulse\nwe used a simple rectangle signal. Its duration was changed during sounding runs and was 900mks for\nlonger pulse and 675mks for shorter pulse. The amplitude of the signal remains constant. Using received\nsignal, we calculated correlation matrix (5) separately for longer pulse sounding runs Rlong,2n (T, τ ) and for\nshorter pulse Rshort,2n+1 (T, τ ) sounding runs. Correlation matrix that provides high spatial resolution was\ncalculated as theirs combination (6).\nFor direct estimation of the ambiguity function we have used sounding runs with observations of the\nlocalized space scatterers. It can be shown that correlation matrix (2) in this case becomes close to the\nambiguity function:\nσ(r, τ ) = δ(r − R0 ); < REST (T, τ ) >=< P (R0 ) >< W (R0 −\n\ncT\n, τ) >\n2\n\n(7)\n\nThe correlation matrix for localized scatterer (i.e. ambiguity function shape) obtained experimentally for\nEST is shown at Fig.2. As one can see, new technique actually improves the spatial resolution, as expected\ntheoretically.\nAt Fig.3 we present altitude dynamics of the spectral power for daytime and nighttime data, obtained\nwith the technique described and with standard technique based only on longer pulse data. From the data\npresented one can see that spectral power valley near zero frequency for the new technique becomes deeper\nand can be observed even at the night data. It should be noted that such a spectral power shape actually\ntheoretically expected for the ionospheric conditions (see [1]), so the new technique not only improves spatial\nresolution in comparison with standard technique, but slightly improves spectral resolution too.\n\n\fFigure 3: Spectral power obtained with use of EST (dashed line), and standard Irkutsk IS radar technique\n(solid line) over the same data, obtained during experiment. (A,C,E,G) daytime data, (B,D,F,H) nighttime\ndata. Altitudes: (G,H) - 230km, (E,F) - 260km, (C,D) - 290km, (A,B) - 320km\n\n4\n\nConclusion\n\nIn conclusion we summarize some properties of the new effective subtraction technique (5-6): the spatial\nresolution is equal for all the lags including zero lag, and correlation matrix can be calculated at any lag with\nalmost equal signal-to-noise ratio; the EST uses only long enough simple pulses without any modulation,\nso in the case of the low signal-to-noise ratio (for example at high altitudes) we can use standard signal\nprocessing technique for both pulses separately with standard spatial resolution, and for high signal-to-noise\nratio (at low altitudes) - use EST with high spatial resolution; the spatial resolution of EST is defined by\npulse duration difference, and maximal allowed lags are defined by half-sum of the pulses durations.\n\n5\n\nReferences\n\n1. Hagfors T. \"Plasma Fluctuations Excited by Charged Particle Motion and their Detection by Weak\nScattering of Radio Waves\" in D.Alcayde (ed.), Incoherent Scatter Theory, Practice and Science, Collection\nof lectures given in Cargese, Corsica, 1995. EISCAT Technical Report 97/53, 1997, pp. 1-32.\n2. M.S.Lehtinen , I.I.Virtanen, J.Vierinen, \"Fast comparison of IS radar code sequences for lag profile\ninversion\" Ann.Geophysicae, 26, 2008, pp. 2291-2301.\n3. M.P.Sulzer, \"A radar technique for high range resolution incoherent scatter autocorrelation function\nmeasurements utilizing the full average power of klystron radars,\" Radio Sci, 21(6), 1986, pp. 1033-1040.\n4. A.Huuskonen, M.S.Lehtinen, J.Pirttil , \"Fractional lags in alternating codes: Improving incoherent\nscatter measurements by using lag estimates at noninteger multiples of baud length,\" Radio Sci., 32(6), 1996,\npp. 2271-2282.\n5. G.A.Zherebtsov, A.V.Zavorin, A.V.Medvedev , V.E.Nosov, A.P.Potekhin, B.G.Shpynev, \"Irkutsk\nIncoherent Scatter Radar,\" Radiotekh. Elektron. (Moscow), 47(11), 2002, pp. 13391345.\n\n\f"}