{"id": "http://arxiv.org/abs/1101.5429v2", "guidislink": true, "updated": "2011-02-04T05:00:07Z", "updated_parsed": [2011, 2, 4, 5, 0, 7, 4, 35, 0], "published": "2011-01-28T02:26:46Z", "published_parsed": [2011, 1, 28, 2, 26, 46, 4, 28, 0], "title": "Sudden death and robustness of quantum discord and entanglement of two\n  atoms in dissipative cavities in dispersive limit", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1101.5519%2C1101.0007%2C1101.4306%2C1101.5896%2C1101.2699%2C1101.4249%2C1101.5772%2C1101.4268%2C1101.2943%2C1101.5684%2C1101.0416%2C1101.2997%2C1101.4644%2C1101.0873%2C1101.1408%2C1101.1307%2C1101.0236%2C1101.4218%2C1101.3343%2C1101.5709%2C1101.1750%2C1101.4598%2C1101.4773%2C1101.3487%2C1101.5669%2C1101.2240%2C1101.3856%2C1101.4213%2C1101.2430%2C1101.4069%2C1101.5511%2C1101.2179%2C1101.2488%2C1101.4834%2C1101.5734%2C1101.0059%2C1101.0730%2C1101.1700%2C1101.3124%2C1101.4127%2C1101.5550%2C1101.5212%2C1101.5442%2C1101.2615%2C1101.1611%2C1101.0682%2C1101.2089%2C1101.3898%2C1101.1740%2C1101.0788%2C1101.0530%2C1101.3984%2C1101.3275%2C1101.3516%2C1101.2738%2C1101.5032%2C1101.0681%2C1101.1057%2C1101.2434%2C1101.0053%2C1101.1535%2C1101.5370%2C1101.5475%2C1101.1730%2C1101.1234%2C1101.5333%2C1101.5429%2C1101.0014%2C1101.1907%2C1101.2227%2C1101.3895%2C1101.5673%2C1101.4867%2C1101.1720%2C1101.1763%2C1101.6048%2C1101.1606%2C1101.0277%2C1101.0197%2C1101.0137%2C1101.5464%2C1101.1462%2C1101.4242%2C1101.5390%2C1101.2767%2C1101.2661%2C1101.5058%2C1101.0179%2C1101.4124%2C1101.2793%2C1101.1420%2C1101.5361%2C1101.1651%2C1101.1368%2C1101.4819%2C1101.5803%2C1101.1977%2C1101.2104%2C1101.2399%2C1101.3952%2C1101.4702&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Sudden death and robustness of quantum discord and entanglement of two\n  atoms in dissipative cavities in dispersive limit"}, "summary": "The quantum dynamics of two entangled two-level atoms initially in extended\nWerner-like (EWL) states is studied. Each of the two atoms is located within an\nisolated and dissipative cavity. If the interaction time of atoms and cavities\nis not very long, the amount of quantum discord and entanglement between two\natoms decreases as the system evolves. The sudden death of quantum discord and\nentanglement of two atoms occurs within a short interaction time. However,\nafter a long interaction time, quantum discord and entanglement of two atoms\ncould be partially preserved due to the long-lived nature of quantum discord\nand entanglement. Surprisingly, we find the amount of long-lived quantum\ndiscord could be smaller than that of long-lived entanglement. Thus,\nentanglement may be more robust than quantum discord against decoherence.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1101.5519%2C1101.0007%2C1101.4306%2C1101.5896%2C1101.2699%2C1101.4249%2C1101.5772%2C1101.4268%2C1101.2943%2C1101.5684%2C1101.0416%2C1101.2997%2C1101.4644%2C1101.0873%2C1101.1408%2C1101.1307%2C1101.0236%2C1101.4218%2C1101.3343%2C1101.5709%2C1101.1750%2C1101.4598%2C1101.4773%2C1101.3487%2C1101.5669%2C1101.2240%2C1101.3856%2C1101.4213%2C1101.2430%2C1101.4069%2C1101.5511%2C1101.2179%2C1101.2488%2C1101.4834%2C1101.5734%2C1101.0059%2C1101.0730%2C1101.1700%2C1101.3124%2C1101.4127%2C1101.5550%2C1101.5212%2C1101.5442%2C1101.2615%2C1101.1611%2C1101.0682%2C1101.2089%2C1101.3898%2C1101.1740%2C1101.0788%2C1101.0530%2C1101.3984%2C1101.3275%2C1101.3516%2C1101.2738%2C1101.5032%2C1101.0681%2C1101.1057%2C1101.2434%2C1101.0053%2C1101.1535%2C1101.5370%2C1101.5475%2C1101.1730%2C1101.1234%2C1101.5333%2C1101.5429%2C1101.0014%2C1101.1907%2C1101.2227%2C1101.3895%2C1101.5673%2C1101.4867%2C1101.1720%2C1101.1763%2C1101.6048%2C1101.1606%2C1101.0277%2C1101.0197%2C1101.0137%2C1101.5464%2C1101.1462%2C1101.4242%2C1101.5390%2C1101.2767%2C1101.2661%2C1101.5058%2C1101.0179%2C1101.4124%2C1101.2793%2C1101.1420%2C1101.5361%2C1101.1651%2C1101.1368%2C1101.4819%2C1101.5803%2C1101.1977%2C1101.2104%2C1101.2399%2C1101.3952%2C1101.4702&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "The quantum dynamics of two entangled two-level atoms initially in extended\nWerner-like (EWL) states is studied. Each of the two atoms is located within an\nisolated and dissipative cavity. If the interaction time of atoms and cavities\nis not very long, the amount of quantum discord and entanglement between two\natoms decreases as the system evolves. The sudden death of quantum discord and\nentanglement of two atoms occurs within a short interaction time. However,\nafter a long interaction time, quantum discord and entanglement of two atoms\ncould be partially preserved due to the long-lived nature of quantum discord\nand entanglement. Surprisingly, we find the amount of long-lived quantum\ndiscord could be smaller than that of long-lived entanglement. Thus,\nentanglement may be more robust than quantum discord against decoherence."}, "authors": ["Jian-Song Zhang", "Lin Chen", "M. Abdel-Aty", "Ai-Xi Chen"], "author_detail": {"name": "Ai-Xi Chen"}, "author": "Ai-Xi Chen", "arxiv_comment": "Ref.[46](Phys. Rev. A 81,042105 (2010)) of the original version is\n  replaced by Phys. Rev. A, 77 (2008) 042303(see Ref.[36] of the revised\n  version). Quantum discord is calculated using the results of Phys. Rev. A, 77\n  (2008) 042303. The results of our present paper are not effected", "links": [{"href": "http://arxiv.org/abs/1101.5429v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1101.5429v2", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "quant-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "quant-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1101.5429v2", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1101.5429v2", "journal_reference": null, "doi": null, "fulltext": "epl draft\n\nSudden death and robustness of quantum discord and entanglement in cavity QED\nJ. S. Zhang1,∗ , L. Chen1 , M. Abdel-Aty3 and A. X. Chen1,4\n\narXiv:1101.5429v2 [quant-ph] 4 Feb 2011\n\n1\n\nDepartment of Applied Physics, East China Jiaotong University, Nanchang 330013, People's Republic of China\nCentre for Quantum Technologies, National University of Singapore, Singapore 117542\n3\nMathematics Department, Faculty of Science, Sohag University, 82524 Sohag, Egypt\n4\nCentre for Atom Optics and Ultrafast Spectroscopy, Swinburne University of Technology, Melbourne 3122, Australia\n∗\nCorresponding author: jszhang1981@zju.edu.cn\n\n2\n\nPACS\nPACS\nPACS\n\n03.67.-a – Quantum information\n03.65.Yz – Decoherence; open systems; quantum statistical methods\n03.65.Ud – Entanglement and quantum nonlocality (e.g. EPR paradox, Bells inequalities,\nGHZ states, etc.)\n\nAbstract. - The quantum dynamics of two entangled two-level atoms is studied. Each of the two\natoms is located within an isolated and dissipative cavity. If the interaction time of atoms and\ncavities is not very long, the amount of quantum discord and entanglement between two atoms\ndecreases as the system evolves. The sudden death of quantum discord and entanglement of two\natoms occurs within a short interaction time. However, after a long interaction time, quantum\ndiscord and entanglement of two atoms could be partially preserved due to the long-lived nature\nof quantum discord and entanglement. Surprisingly, we find the amount of long-lived quantum\ndiscord could be smaller than that of long-lived entanglement. Thus, entanglement may be more\nrobust than quantum discord against decoherence.\n\nIntroduction. – Quantum entanglement is at the\nheart of quantum information processing and quantum\ncomputation [1–3]. In recent years, many efforts have\nbeen invested in the study of the evolution of joint systems formed by two subsystems (each system locally interacts with its environment) [4–9]. In particular, the entanglement of a two-qubit system may disappear for a finite time during the dynamics evolution. The nonsmooth\nfinite-time disappearance of entanglement is called \"entanglement sudden death\" (ESD). Experimentally, the ESD\nphenomenon has been observed in the laboratory by several groups for optical setups [10,11] and atomic ensembles\n[12].\n\nqubit [24]. Quantum discord introduced in [25, 26] is another kind of quantum correlation different from entanglement. Very recently, quantum discord has been investigated widely [27–30]. Note that all the previous studies [27–30] have shown that, for several quantum systems,\nthere is no quantum discord sudden death (DSD). However, quantum discord is a kind of quantum correlation in\ncomposite quantum systems. Since entanglement of quantum systems can stay zero for a finite time (ESD), a natural question is whether there is DSD in quantum systems\nwith ESD. Here, we present a quantum system where there\nexists DSD as well as ESD. We also explain why there is\nno DSD in [30]. Furthermore, we find that there is also\nOne the other hand, quantum entanglement is not the long-lived quantum discord. In recent years, many efforts\nonly kind of quantum correlation useful for quantum in- has been devoted to the study of the long-lived entangleformation processing [13–15]. In fact, it was shown both ment in cavity QED [31–34] or solid state systems [35]. To\ntheoretically [16–23] and experimentally [24] that some the best of our knowledge, there is few study on the longtasks can be sped up over their classical counterparts us- term behavior of quantum discord. Thus, an investigation\ning fully separable and highly mixed states. These results of quantum discord of a quantum system in the presence\nclearly show that separable states with quantum discord of decoherence in the limit t → ∞ is highly desired. This\ncan be used to implement quantum information process- question is also addressed in the present work.\ning such as deterministic quantum computation with one\nIn the present paper, we investigate the dynamics of\np-1\n\n\fJ. S. Zhang et al.\nquantum discord and entanglement of a quantum system\nformed by two two-level atoms within two spatially separated and dissipative cavities in the dispersive limit using\nthe results of [36]. The two atoms are initially prepared\nin the Werner states [6] and the cavities are initially prepared in coherent states. We show that both DSD and\nESD can appear in the present system. The amount of\nquantum discord and entanglement of two atoms decreases\nwith time in the short-term. However, the long-term behavior is very different since a long survival of quantum\ndiscord and entanglement are shown in the system. This\nimplies that quantum discord and entanglement of two\natoms could be partially preserved even they are put into\ndissipative cavities. Unlike the results in [27, 30], our results show that the amount of long-lived quantum discord\ncould be smaller than that of long-lived entanglement. In\nother words, quantum entanglement may be more robust\nthan quantum discord in the present model.\n\nwhere ρe is the density matrix of the atom-field\n\u0013\n\u0012 system.\nζa ζc\nIf the initial state of the two-level atom is\nζc∗ ζb\nand the field P\nis initially prepared in a coherent state\nn\n2\n∞\n|αi = e−|α| /2 n=0 √αn! |ni with α being a complex number. Here, |ni is the Fock state with a† a|ni = n|ni. Then,\nthe reduced density matrix of the atom is obtained by\ntracing out the variables of the field from the atom-field\ndensity matrix [39]\nρeatom (t) =\n\nf (t) =\n\nζa |eihe| + ζb |gihg| + [ζc f (t)|eihg| + h.c],\n\nexp {−iΩt + |α|2 (e−2γt − 1)}\n|α|2 γ\n× exp {\n[1 − e−2(γ+iΩ)t ]}\nγ + iΩ\n× exp{|α|2 e−2γt (e−2iΩt − 1)},\n\n(5)\n\nwhere h.c denotes the Hermitian conjugate.\nThen, we consider a quantum system consisting of two\nThe model. – We first consider a quantum system noninteracting atoms each locally interacts with its own\nconsisting of a two-level atom interacting with a single- coherent field of a dissipative cavity. The interactions bemode cavity. Under the electric dipole and rotating wave tween each atom and its own dissipative cavity is described\napproximation, the Hamiltonian of the present system is by Eq. (4). We assume the two atoms are initially pre(h̄ = 1) [37]\npared in Werner states defined by [6]\nω\n0\nσz + g(a† σ− + aσ+ ),\n(1)\nH = ωa† a +\n1−p\n2\nI,\nρΦ = p|ΦihΦ| +\n4\nwhere g is the atom-field coupling constant, σ± are the\n1−p\nρΨ = p|ΨihΨ| +\nI,\natomic spin flip operators characterizing the effective two4\nlevel atom with frequency ω0 , and σz = |eihe| − |gihg|.\n1\n|Φi = √ (|egi + |gei),\nNote that the symbols |ei and |gi refer to the excited and\n2\nground states for the two-level atom. Here, a† and a are\n1\nthe creation and annihilation operators of the field with\n|Ψi = √ (|eei + |ggi),\n(6)\n2\nfrequency ω, respectively. The dispersive\nlimit\nis\nobtained\n√\nwhen the condition |∆| = |ω0 − ω| ≫ n + 1g is satisfied where p is a real number which indicates the purity of\nfor any relevant n. Then, the interaction Hamiltonian initial states, I is a 4 × 4 identity matrix. The parameter\ng(a† σ− + aσ+ ) can be regarded as a small perturbation. p is 1 for pure sates and 0 for completely mixed states.\nHence the effective Hamiltonian of the present model can The two fields are prepared in coherent states |α i and\n1\nbe rewritten as [38]\n|α2 i. For the sake of simplicity, we assume α1 = α2 = α,\nω0\nthe decay rates of the two cavities are equal, and the atomσz + Ω[(a† a + 1)|eihe| − a† a|gihg|],\nHe = ωa† a +\nfield coupling constants are the same. Using the method\n2\n(2) introduced in [6], we can obtain the reduced density matrix\nof two atoms conveniently.\nwith Ω = g 2 /∆. In the interaction picture, the interaction\nThe reduced density matrix of two atoms can be obHamiltonian is\ntained by using the superoperator method [39–41]. As one\nV = Ω[(a† a + 1)|eihe| − a† a|gihg|].\n(3) can see below, the quantum discord and entanglement of\nthe present system can be calculated conveniently by emWe assume the two-level atom interacting with a co- ploying the results of [36]. We assume the initial state of\nherent field in a dissipative environment. This interaction two atoms is ρφ . Using the results of [39] and Eq. (6), we\ncauses the losses in the cavity which is presented by the obtain the density matrix of two atoms ρ(t) as follow\nsuperoperator D = γ(2a * a† − a† a * − * a† a), where γ is\n\n 1−p\n0\n0\n0\nthe decay constant. For the sake of simplicity, we confine\n4\n\n\np|f (t)|2\n1+p\nour consideration in the case of zero temperature cavity.\n0 \n 0\n4\n2\n(7)\n,\n\n2\np|f\n(t)|\n1+p\nThen, the master equation that governs the dynamics of\n 0\n0 \n2\n4\n1−p\nthe system can be written as follows\n0\n0\n0\n4\nde\nρ\n= −i[V, ρe] + De\nρ,\n(4) where f (t) is given by Eq. (5).\ndt\np-2\n\n\fSudden death and robustness of quantum discord and entanglement\nQuantum discord and entanglement. – In gen- with the help of the results of [36]\neral, a composite quantum system contains both quantum\nand classical correlations, the total amount of which are D(ρAB ) = 1 [(1 − d1 − d2 − d3 ) log2 (1 − d1 − d2 − d3 )\n4\nquantified by quantum mutual information. Precisely, the\n+(1\n− d1 + d2 + d3 ) log2 (1 − d1 + d2 + d3 )]\nquantum mutual information of a composite bipartite sysAB\n+(1 + d1 − d2 + d3 ) log2 (1 + d1 − d2 + d3 )]\ntem ρ\nis defined as\n+(1 + d1 + d2 − d3 ) log2 (1 + d1 + d2 − d3 )]\nI(ρAB ) = S(ρA ) + S(ρB ) − S(ρAB ),\n(8)\n1−d\n1−d 1+d\n1+d\n−\nlog2\n−\nlog2\n,\nP\n2\n2\n2\n2\nwhere S(ρ) = −T r(ρ log2 ρ) = − i (λi log2 λi ) is the von\n2\nd1 = d2 = p|f (t)| , d3 = −p,\nNeumann entropy of density matrix ρ with λi being the\neigenvalues of density matrix ρ. We note that 0 log2 0 is\nd = max {|d1 |, |d2 |, |d3 |}.\n(14)\ndefined to be 0 and ρA (ρB ) is the reduced density matrix\nIn order to investigate the entanglement of two-qubit\nof ρAB by tracing out system B(A).\nQuantum discord [25, 26] is another kind of quantum systems, we adopt the entanglement measure concurrence\ncorrelation different from entanglement. In order to quan- introduced in [42]\ntify quantum discord, the authors of [25] proposed to use\nC = max {0, χ1 − χ2 − χ3 − χ4 },\n(15)\nthe von Neumann type measurements consisting of onedimensional\nprojector {Bi } (acts on system B only), such\nP\nwhere χi (i = 1, 2, 3, 4) are the square roots of the eigenthat i Bi = 1. The conditional density matrix of the\nvalues in decreasing order of the magnitude of the \"spintotal system after the von Neumann type measurements\n∗\nflipped\" density matrix operator R = ρ(σ\n\u0012y ⊗σy )ρ (σ\n\u0013 y ⊗σy )\nis [25]\n0 −i\nand σy is the Pauli Y matrix, i.e., σy =\n. Coni 0\n1\nAB\n(I\n⊗\nB\n)ρ\n(I\n⊗\nB\n),\n=\nρAB\ni\ni\nBi\ncurrence of a quantum state ranges from 0, which correpi\nsponds to an unentangled state, to 1, which corresponds\nAB\npi = T r((I ⊗ Bi )ρ (I ⊗ Bi )),\n(9)\nto a maximally entangled state. The concurrence of the\nwhere pi is the probability of the corresponding measure- above state is\nment. The quantum conditional entropy with respect to\n1−p\n}.\n(16)\nC(t) = max {0, p|f (t)|2 −\nthis kind of measurement is defined as\n2\nX\n(10) We will use this equation to calculate the entanglement of\npi S(ρAB\nS(ρAB |{Bi }) =\nBi ),\nthe quantum system presented in this work.\ni\nand the corresponding quantum mutual information with\nrespect to the measurement is defined by\nI(ρAB |{Bi }) = S(ρA ) − S(ρAB |{Bi }).\n\n(11)\n\nThe quantity I(ρAB |{Bi }) is the information gained about\nsystem A if one performs measurement Bi on system B.\nThe resulting classical correlation according to [25, 26] is\ndefined as\nJ (ρAB ) =\n=\n\nsup I(ρAB |{Bi })\n\n{Bi }\n\nS(ρA ) − min[S(ρAB |{Bi })].\n{Bi }\n\n(12)\n\nThe quantum discord is obtained by subtracting J from\nthe quantum mutual information I\nD(ρAB ) = I(ρAB ) − J (ρAB ).\n\n(13)\n\nAs one can see from the above equations, the minimization\nprocedure should be done over all possible von Neumann\nmeasurements Bi on system B. Thus, the main difficulty\nof calculating quantum discord lies in the elaborate minimization process in the term min{Bi } [S(ρAB |{Bi })]. Fortunately, the quantum discord of Eq. (7) can be calculated\n\nResults and discussions. –\nSudden death of quantum discord and entanglement.\nWe now want to investigate the dynamics of quantum discord and entanglement. In Fig. 1, quantum discord and\nentanglement are plotted as functions of the dimensionless\nscaled time Ωt for α = 0.5 (upper panel) and α = 1 (lower\npanel). Clearly, there is ESD in the present model as one\ncan see from Fig. 1. From the upper panel of Fig. 1, one\nmay conclude that there is no DSD, which is consistent\nwith the results of [27, 30]. However, this is not always\ncorrect. As one can easily observe from the lower panel of\nFig. 1, if we increase the intensity of the coherent fields\nthat is proportional to |α|2 , there is DSD. We note that in\nthis figure, quantum discord is larger than entanglement,\nwhich is coincidence with the observations of [27,30]. However, this is not a general result since quantum discord and\nentanglement are two different quantities and there is no\nsimple relative ordering between them. For example, for\nthe Werner states defined by ρ = p|ψ− ihψ− | + 1−p\n4 , where\n√\n|ψ− i = (|egi − |gei)/ 2, quantum discord may be lager\nor smaller than entanglement [36].\nWe now want to explain why there is no DSD in the case\nof dephasing channel in [30]. At first sight, the elements\nof the density matrix of the dephasing case is very similar\n\np-3\n\n\fJ. S. Zhang et al.\n0.3\n\n0.20\n0.15\n\n0.2\n\n0.10\n0.05\n0.00\n\n0\n\n2\n\nΩt\n\n4\n\n6\n\n0.1\n\n8\n\n0.20\n0.0\n\n0.15\n\n0\n\n100\n\n200\n\n300\n\n400\n\n500\n\n300\n\n400\n\n500\n\nΩt\n\n0.10\n0.8\n\n0.05\n0.00\n\n0\n\n2\n\nΩt\n\n4\n\n6\n\n0.6\n\n8\n\n0.4\n\nFig. 1: Quantum discord (solid line) and entanglement (dotted\nline) of two atoms are plotted as functions of the dimensionless\nscaled time Ωt with γ/Ω = 0.01 and p = 0.4. Upper panel:\nα = 0.5. Lower panel: α = 1. There is no DSD in the upper\npanel with α = 0.5. However, the lower panel clearly shows\nthe existence of DSD in the case of α = 1.\n\nto the matrix elements of Eq. (7). Let us focus on the offdiagonal elements ρ23 (t) of [30], i.e., ρ23 (t) = e−Γt ρ23 (0),\nwhere Γ is the decay rate. Obviously, the term e−Γt becomes zero only in the asymptotic limit t → ∞. Quantum\ndiscord vanishes only in the asymptotic limit, which behaves similarly to decoherence of each atom [30]. In the\npresent work, the off-diagonal element ρ23 (t) is much more\ncomplicated than that of [30] and it is possible for quantum discord to stay zero for a finite time. Physically, the\ninfluence of the interactions between atoms and cavities,\nand the mean photon number and decay rate of dissipative cavities upon quantum discord has not bee considered\nin [30]. Here, all the above influence upon the dynamics\nof quantum discord and entanglement is taken into accounted. In this sense, the results of [30] can only reveal parts of the properties of quantum discord (no DSD),\nwhich is consistent with the upper panel of Fig. 1. However, the lower panel of Fig. 1, which indicates the existence of DSD, can not appear in [30].\n\n0.2\n0.0\n0\n\n100\n\n200 Ωt\n\nFig. 2: Quantum discord (solid line) and entanglement (dotted\nline) of two atoms are plotted as functions of the dimensionless\nscaled time Ωt with γ/Ω = 0.01, and α = 0.5. Upper panel:\np = 0.5. Lower panel: p = 0.8. Comparing the upper and lower\npanel, we see that long-lived quantum discord could be larger\n(upper panel) or smaller (lower panel) than long-lived entanglement. In other words, quantum entanglement may be more\nrobust than quantum discord in the presence of decoherence.\nThis result is different from the previous work [27, 30]\n\nwith the increase of the parameter p. The relative ordering\nof quantum discord and entanglement depends heavily on\nthe purity p. For example, in the case of p = 0.5, long-lived\nquantum discord is larger than long-lived entanglement.\nHowever, in the case of p = 0.8, we find that, in contrast\nto the results of [27,30], the amount of long-lived quantum\ndiscord could be smaller than that of long-lived entanglement. In other words, quantum entanglement could be\nmore robust than discord against decoherence. Thus, it\nis difficult for us to make a general statement whether or\nnot quantum discord is more robust against decoherence\nthan entanglement. Intuitively, quantum discord is different from entanglement and it is difficult to make a general\nconclusion about the relative ordering of the amount of\nquantum discord and entanglement in the presence of decoherence. In order to show the influence of decoherence of\ncavities upon the quantum discord of two atoms, we plot\nthe quantum discord of two atoms in Fig.3. Note that it\nhas been proved that white noise of cavity fields can play\na constructive role in the generation of entanglement in\ncavity QED systems [43]. Here, Fig. 3 demonstrates that\nthe dissipation of cavity fields may also play a constructive role in the generation of quantum discord. Note that\nin Figs. (1)-(3), we have assumed the atoms are initially\nprepared in ρφ . One can also consider the dynamics of\nquantum discord and entanglement if the initial state of\natoms is ρψ and the results are similar.\n\nLong-lived quantum discord and entanglement. As we\nhave pointed out previously, little attention has been paid\nto long-lived quantum discord even though lots of work\nhas been made on long-lived entanglement [31–35]. Here,\nwe consider the question of whether there is long-lived\nquantum discord and entanglement in the present model.\nThe influence of the purity of the initial state of atoms\nupon the long-time behavior of quantum discord and entanglement is also discussed.\nIn Fig. 2, quantum discord and entanglement as functions of the dimensionless scaled time Ωt are plotted for\np = 0.5 (upper panel) and p = 0.8 (lower panel). It is\neasy to observe that the long-time behavior of quantum\ndiscord and entanglement depends on the purity of the initial state of atoms. This figure is a direct evidence of the\nConclusions. – In the present work, we have studpresence of long-lived quantum discord and entanglement\nin the present system. Comparing the upper panel with ied the dynamics of quantum discord and entanglement\nthe lower one of Fig. 2, one can see that the amount of of two two-level atoms without direct interactions. Each\nlong-lived quantum discord and entanglement will increase atom is put into a spatially separated and dissipative cavp-4\n\n\fSudden death and robustness of quantum discord and entanglement\n\n0.8\n0.6\n0.4\nD\n0.2\n1\n0.8\n0.6\n0.4 Γ\u0090W\n\n0\n2\n4\nWt\n\n6\n0.2\n\n8\n10 0\n\nFig. 3: Quantum discord of two atoms are plotted as functions\nof the dimensionless scaled time Ωt and parameter γ/Ω with\nα = 1 and p = 0.8.\n\nity in the dispersive limit. We first investigated the shorttime behavior of quantum discord and entanglement in\nthe presence of dissipation. The amount of quantum discord and entanglement of two atoms decreases with time\nif the interaction time is not very long. Particularly, we\nhave shown that both DSD and ESD could appear simultaneously in the present system. This is different from the\nresults of [27, 30]. Then, we discussed the long-time behavior of quantum discord and entanglement of two atoms.\nWe show there is long-lived quantum discord and entanglement in the presence of the dissipation of cavities. Our\nresults show that quantum entanglement may be more robust against decoherence than quantum discord. Finally,\nwe would like to point out that it could be possible to\nstudy quantum discord of any dimensional bipartite states\nfrom a geometrical point of view [44]. It is also interesting\nto compare the results of any dimensional bipartite states\nin the presence of decoherence with our work.\n∗∗∗\nThis project is supported by the National Natural Science Foundation of China (Grant Nos 11047115\nand 11065007), the Scientific Research Foundation of\nJiangxi Provincial Department of Education (Grant Nos\nGJJ10135 and GJJ09504), and the Foundation of Talent\nof Jinggang of Jiangxi Province (Grant No 2008DQ00400).\nREFERENCES\n[1] Nielsen M. A. and Chuang I. L., Quantum Computation and Quantum Information (Cambridge University\nPress, Cambridge) 2000.\n[2] Raimond J. M., Brune M. and Haroche S., Rev. Mod.\nPhys., 73 (2001) 565.\n[3] Chen L., Chitambar E., Duan R. Y., Ji Z. F. and\nWinter A., Phys. Rev. Lett., 105 (2010) 200501.\n\n[4] Yu T. and Eberly J. H., Phys. Rev. Lett., 93 (2004)\n140404.\n[5] Yu T. and Eberly J. H., Science (London), 323 (2009)\n598.\n[6] Bellomo B., Lo Franco R. and Compagno G., Phys.\nRev. A, 77 (2008) 032342.\n[7] Rau A. R. P., Ali M. and Alber G., Europhys. Lett.,\n82 (2008) 4002.\n[8] Zhang J. S., Xu J.B. and Lin Q., Eur. Phys. J. D, 51\n(2009) 283.\n[9] Jamróz A., J. Phys. A: Math. Theor. , 39 (2006) 7727.\n[10] Almeida M. P., deMelo F., Hor-Meyll M., Salles\nA., Walborn S. P., Ribeiro P. H. S. and Davidovich\nL., Science (London), 316 (2007) 579.\n[11] Salles A., deMelo F., Almeida M. P., Hor-Meyll\nM., Walborn S. P. S., Ribeiro P. H. S. and Davidovich L., Phys. Rev. A, 78 (2008) 022322.\n[12] Laurat J., Choi K. S., Deng H., Chou C. W. and\nKimble H. J., Phys. Rev. Lett., 99 (2007) 180504.\n[13] Bennett C. H., DiVincenzo D. P., Fuchs C. A., Mor\nT., Rains E., Shor P. W., Smolin J. A. and Wootters W. K., Phys. Rev. A, 59 (1999) 1070.\n[14] Horodecki M., Horodecki P., Horodecki R., Oppenheim J., Sen A., Sen U. and Synak-Radtke B.,\nPhys. Rev. A, 71 (2005) 062307.\n[15] Niset J. and Cerf N. J., Phys. Rev. A, 74 (2006)\n052103.\n[16] Braunstein S. L., Caves C. M., Jozsa R., Linden N.,\nPopescu S. and Schack R., Phys. Rev. Lett., 83 (1999)\n1054.\n[17] Meyer D. A., Phys. Rev. Lett., 85 (2000) 2014.\n[18] Datta A., Flammia S. T. and Caves C. M., Phys. Rev.\nA, 72 (2005) 042316.\n[19] Datta A. and Vidal G., Phys. Rev. A, 75 (2007) 042310.\n[20] Datta A., Shaji A. and Caves C. M., Phys. Rev. Lett.,\n100 (2008) 050502.\n[21] Dillenschneider R., Phys. Rev. B, 78 (2008) 224413.\n[22] Sarandy M. S., Phys. Rev. A, 80 (2009) 022108.\n[23] Cui J. and Fan H., J. Phys. A: Math. Theor., 43 (2010)\n045305.\n[24] Lanyon B. P., Barbieri M., Almeida M. P. and\nWhite A. G., Phys. Rev. Lett., 101 (2008) 200501.\n[25] Ollivier H. and Zurek W. H., Phys. Rev. Lett., 88\n(2001) 017901.\n[26] Henderson L. and Vedral V., J. Phys. A: Math.\nTheor., 34 (2001) 6899.\n[27] Wang B., Xu Z. Y., Chen Z. Q. and Feng M., Phys.\nRev. A, 81 (2010) 014101.\n[28] Auyuanet A. and Davidovich L., Phys. Rev. A, 82\n(2010) 032112.\n[29] Sun Z. Y., Li L., Yao K. L., Du G. H., Liu J. W., Luo\nB., Li N. and Li H. N., Phys. Rev. A, 82 (2010) 032310.\n[30] Werlang T., Souza S., Fanchini F. F. and Boas C.\nJ. V., Phys. Rev. A, 80 (2009) 024103.\n[31] Yu T. and Eberly J. H., Opt. Commun., 264 (2006)\n393.\n[32] Xu J. B. and Li S. B., New J. Phys., 7 (2005) 72.\n[33] Abdel-Aty M. and Moya-Cessa H., Phys. Lett. A, 369\n(2007) 372.\n[34] Dajka J., Mierzejewski M. and Luczka J., J. Phys.\nA: Math. Theor., 40 (2007) F879.\n[35] Abdel-Aty M., J. Phys. A: Math. Theor. , 41 (2008)\n\np-5\n\n\fJ. S. Zhang et al.\n185304.\n[36] Luo S., Phys. Rev. A, 77 (2008) 042303.\n[37] Scully M. and Zubairy M. S., Quantum Optics (Cambridge University Press, Cambridge) 1997.\n[38] Meystre P., Phys. Rep., 219 (1992) 243.\n[39] Zhang J. S., Chen A. X. and Abdel-Aty M., J. Phys.\nB: At. Mol. Opt. Phys., 43 (2010) 025501.\n[40] Zhang J. S. and Xu J. B., Opt. Commun., 282 (2009)\n2543.\n[41] Zhang J. S. and Xu J. B., Can. J. Phys., 87 (2009)\n1031.\n[42] Wootters W. K., Phys. Rev. Lett., 80 (1998) 2245.\n[43] Plenio M. B. and Huelga S. F., Phys. Rev. Lett., 88\n(2002) 197901.\n[44] Dakic B., Vedral V. and Brukner C., Phys. Rev.\nLett., 105 (2010) 190502.\n\np-6\n\n\f"}