{"id": "http://arxiv.org/abs/0903.5128v1", "guidislink": true, "updated": "2009-03-30T05:04:00Z", "updated_parsed": [2009, 3, 30, 5, 4, 0, 0, 89, 0], "published": "2009-03-30T05:04:00Z", "published_parsed": [2009, 3, 30, 5, 4, 0, 0, 89, 0], "title": "Accelerating spaceships paradox and physical meaning of length\n  contraction", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0903.4319%2C0903.1777%2C0903.5056%2C0903.0650%2C0903.3430%2C0903.2796%2C0903.0317%2C0903.0833%2C0903.5393%2C0903.1535%2C0903.5348%2C0903.1589%2C0903.3378%2C0903.1480%2C0903.5253%2C0903.3638%2C0903.1891%2C0903.4210%2C0903.3265%2C0903.1863%2C0903.2591%2C0903.3006%2C0903.0172%2C0903.2220%2C0903.3806%2C0903.5115%2C0903.4333%2C0903.4651%2C0903.5511%2C0903.4738%2C0903.1935%2C0903.1115%2C0903.3251%2C0903.1279%2C0903.2285%2C0903.1145%2C0903.3688%2C0903.4480%2C0903.3798%2C0903.0687%2C0903.1429%2C0903.1137%2C0903.5437%2C0903.3272%2C0903.5297%2C0903.4746%2C0903.5128%2C0903.2919%2C0903.1258%2C0903.3017%2C0903.2951%2C0903.3562%2C0903.4343%2C0903.1247%2C0903.2958%2C0903.2072%2C0903.4220%2C0903.3425%2C0903.5252%2C0903.5470%2C0903.2243%2C0903.1941%2C0903.3386%2C0903.2686%2C0903.0641%2C0903.3074%2C0903.3556%2C0903.1175%2C0903.0206%2C0903.3476%2C0903.2064%2C0903.3722%2C0903.3441%2C0903.0267%2C0903.4927%2C0903.3471%2C0903.0993%2C0903.0718%2C0903.5408%2C0903.2920%2C0903.4701%2C0903.1668%2C0903.3613%2C0903.4728%2C0903.0966%2C0903.5073%2C0903.4016%2C0903.2847%2C0903.0147%2C0903.3548%2C0903.4218%2C0903.4708%2C0903.0995%2C0903.0096%2C0903.4941%2C0903.4141%2C0903.1893%2C0903.2868%2C0903.1192%2C0903.3075%2C0903.4872&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Accelerating spaceships paradox and physical meaning of length\n  contraction"}, "summary": "A fifty-year old apparently paradoxical thought experiment involving two\naccelerating spaceships and a thread hat connects them states that the thread\nwill break due to length contraction. This paradox still appears to be regarded\nby some physicists as a proof that (i) only physical bodies, but not space,\nundergo relativistic length contraction and (ii) a relativistically contracted\nbody experiences a stress. This note, dedicated to the one hundredth\nanniversary of Hermann Minkowski's paper \"Space and Time\", shows that a proper\nrelativistic treatment of the paradox demonstrates that it is a manifestation\nof a specific relativistic acceleration phenomenon, which does not have a\nclassical analog. This means that length contraction plays no role in the\nresolution of the paradox. It is also shown that no stress is involved in the\nlength contraction effect.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0903.4319%2C0903.1777%2C0903.5056%2C0903.0650%2C0903.3430%2C0903.2796%2C0903.0317%2C0903.0833%2C0903.5393%2C0903.1535%2C0903.5348%2C0903.1589%2C0903.3378%2C0903.1480%2C0903.5253%2C0903.3638%2C0903.1891%2C0903.4210%2C0903.3265%2C0903.1863%2C0903.2591%2C0903.3006%2C0903.0172%2C0903.2220%2C0903.3806%2C0903.5115%2C0903.4333%2C0903.4651%2C0903.5511%2C0903.4738%2C0903.1935%2C0903.1115%2C0903.3251%2C0903.1279%2C0903.2285%2C0903.1145%2C0903.3688%2C0903.4480%2C0903.3798%2C0903.0687%2C0903.1429%2C0903.1137%2C0903.5437%2C0903.3272%2C0903.5297%2C0903.4746%2C0903.5128%2C0903.2919%2C0903.1258%2C0903.3017%2C0903.2951%2C0903.3562%2C0903.4343%2C0903.1247%2C0903.2958%2C0903.2072%2C0903.4220%2C0903.3425%2C0903.5252%2C0903.5470%2C0903.2243%2C0903.1941%2C0903.3386%2C0903.2686%2C0903.0641%2C0903.3074%2C0903.3556%2C0903.1175%2C0903.0206%2C0903.3476%2C0903.2064%2C0903.3722%2C0903.3441%2C0903.0267%2C0903.4927%2C0903.3471%2C0903.0993%2C0903.0718%2C0903.5408%2C0903.2920%2C0903.4701%2C0903.1668%2C0903.3613%2C0903.4728%2C0903.0966%2C0903.5073%2C0903.4016%2C0903.2847%2C0903.0147%2C0903.3548%2C0903.4218%2C0903.4708%2C0903.0995%2C0903.0096%2C0903.4941%2C0903.4141%2C0903.1893%2C0903.2868%2C0903.1192%2C0903.3075%2C0903.4872&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "A fifty-year old apparently paradoxical thought experiment involving two\naccelerating spaceships and a thread hat connects them states that the thread\nwill break due to length contraction. This paradox still appears to be regarded\nby some physicists as a proof that (i) only physical bodies, but not space,\nundergo relativistic length contraction and (ii) a relativistically contracted\nbody experiences a stress. This note, dedicated to the one hundredth\nanniversary of Hermann Minkowski's paper \"Space and Time\", shows that a proper\nrelativistic treatment of the paradox demonstrates that it is a manifestation\nof a specific relativistic acceleration phenomenon, which does not have a\nclassical analog. This means that length contraction plays no role in the\nresolution of the paradox. It is also shown that no stress is involved in the\nlength contraction effect."}, "authors": ["Vesselin Petkov"], "author_detail": {"name": "Vesselin Petkov"}, "author": "Vesselin Petkov", "arxiv_comment": "8 pages", "links": [{"href": "http://arxiv.org/abs/0903.5128v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0903.5128v1", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "physics.class-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "physics.class-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0903.5128v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0903.5128v1", "journal_reference": null, "doi": null, "fulltext": "arXiv:0903.5128v1 [physics.class-ph] 30 Mar 2009\n\nAccelerating spaceships paradox and physical meaning of\nlength contraction\nVesselin Petkov\nScience College, Concordia University\n1455 De Maisonneuve Boulevard West\nMontreal, Quebec, Canada H3G 1M8\nE-mail: vpetkov@alcor.concordia.ca\nAbstract\nA fifty-year old apparently paradoxical thought experiment involving two accelerating\nspaceships and a thread that connects them states that the thread will break due to length\ncontraction. This paradox still appears to be regarded by some physicists as a proof that\n(i) only physical bodies, but not space, undergo relativistic length contraction and (ii)\na relativistically contracted body experiences a stress. This note, dedicated to the one\nhundredth anniversary of Hermann Minkowski's paper \"Space and Time\", shows that a\nproper relativistic treatment of the paradox demonstrates that it is a manifestation of\na specific relativistic acceleration phenomenon, which does not have a classical analog.\nThis means that length contraction plays no role in the resolution of the paradox. It is\nalso shown that no stress is involved in the length contraction effect.\n\nIn 1959 in a \"Note on Stress Effects due to Relativistic Contraction\" Dewan and Beran\n[1] (see also [2]-[5]) proposed a thought experiment intended to demonstrate the existence of\na stress in a relativistically contracted body. In the seventies J. Bell revived that apparently\nparadoxical thought experiment in a debate with colleagues at CERN. In 1976 he summarized\nhis view in the paper \"How to teach special relativity\" (reprinted in 1987 in [6]) and here is\nhis formulation of the thought experiment [6, p. 67]:\nThree small spaceships, A, B, and C, drift freely in a region of space remote\nfrom other matter, without rotation and without relative motion, with B and C\nequidistant from A (Fig. 1).\nOn reception of a signal from A the motors of B and C are ignited and they\naccelerate gently... Let ships B and C be identical, and have identical acceleration\nprogrammes. Then (as reckoned by an observer in A) they will have at every\nmoment the same velocity, and so remain displaced one from the other by a fixed\ndistance. Suppose that a fragile thread is tied initially between projections from\nB and C. If it is just long enough to span the required distance initially, then as\nthe rockets speed up, it will become too short, because of its need to Fitzgerald\ncontract, and must finally break. It must break when, at a sufficiently high velocity,\nthe artificial prevention of the natural contraction imposes intolerable stress.\nBell's motivation for reviving this thought experiment was to demonstrate the need to teach\nspecial relativity by emphasizing \"the continuity with earlier ideas\" [6, p. 67]. According to\nhim the conclusion that the thread would break \"is perfectly trivial in terms of A's account\nof things, including the Fitzgerald contraction\" [6, p. 68]. His reasoning, which appears to be\nstill shared by some physicists, is the following: the atoms of the thread are deformed due to\n1\n\n\fB\na\n\nA\n\nL\n\nC\n\nFigure 1: Three spaceships A, B, and C are initially at rest. At a given moment in A's\nreference frame B and C, which are connected with a thread, start to accelerate with the\nsame proper acceleration. According to Bell, the thread will break due to stress caused by\nlength contraction. His conclusion is based on the assumption that physical bodies contract\nrelativistically, but space does not.\nthe distortion of their charges' fields and as a result the moving thread will be shorter; as there\nare no charges and fields in empty space there is nothing that can cause the contraction of\nspace and therefore the distance between B and C will not contract (which appears consistent\nwith the condition that that distance should remain constant for A), but the thread will, which\nmeans that it will break.\nThe very formulation of the thought experiment itself – that the distance between the\naccelerating spaceships B and C, as measured by A, remains constant – appears to be paradoxical because according to special relativity any length should contract relativistically. As\nthe distance between B and C must remain constant for an observer in A due to the same\nproper accelerations of B and C (which ensures that at any moment in A, B and C have\nequal velocities relative to A), the only correct relativistic explanation of the constant distance between B and C (from A's point of view) is that the proper distance between B and\nC, measured by any of them, constantly increases as they accelerate [7, 8]. And the distance\nbetween B and C must increase for B and C exactly as much as it decreases for A due to\nlength contraction. As we will see this is precisely the case, which means that the constant\nincrease of the proper distance between B and C, which are accelerating with the same proper\naccelerations, causes the break of the thread, not length contraction. Such an increase of the\ndistance between equally accelerating bodies does not have a classical analog.\nIf it were the relativistic contraction of the thread, as explained by Bell, that caused its\nbreak, there would be a real paradox. From A's point of view the thread would break not\nbecause of the acceleration of B and C, as Bell argued, but due to length contraction. However,\nthe proper distance between B and C should be constant as required by the length contraction\neffect and therefore the break of the thread for B and C could not be explained. This can\nbe demonstrated by taking into account (i) the relativity of motion in the length contraction\neffect and (ii) the reciprocity of length contraction.\nSuppose that it is A that accelerates, whereas B and C remain stationary (Fig. 2). This\nmeans that the proper distance between B and C (as measured by them) is constant since\nB and C do not change their state of motion. As the speed of A increases the length of the\nthread decreases relativistically as monitored by an observer in A. If the distance between B\nand C did not suffer relativistic length contraction (as Bell supposed) an observer in A would\nconclude that the thread would break. This means that B and C should also observe the same\nevent. But for them the break of the thread would be a miracle. The correct explanation of the\nsituation depicted in Fig. 2 is that from A's point of view, both the distance between B and C\nand the thread contract relativistically, which means that the thread is not subjected to any\nstress and will not break. So, the thread will break in the original thought experiment shown\nin Fig. 1, but will remain perfectly intact in the situation represented in Fig. 2. What makes\nthe two thought experiments different is the acceleration of the rockets – B and C accelerate\n2\n\n\fin Fig. 1, whereas it is A that accelerates in Fig. 2.\n\nB\nA\n\nL\n\na\nC\n\nFigure 2: Three spaceships A, B, and C are initially at rest. But unlike the thought experiment\ndepicted in Fig. 1 it is spaceship A that starts to accelerate in this case. If the thread in Fig. 1\nbroke not because of the acceleration of B and C, but because of stress caused by length\ncontraction, then in the case depicted here an observer in A would conclude that the thread\nshould also break. However, that would be a total mystery for observers in B and C since\nB and C are stationary and the proper distance between them remains the same, which also\nimplies that the thread is subjected to no stress. So taking into account the relativity of\nmotion in the length contraction effect demonstrates that no stress is involved in this effect\nand therefore the thread in Fig. 1 does not break because of length contraction.\nThat proper length remains constant in the length contraction effect can be also seen from\nits reciprocity as shown in Fig. 3. Consider a fourth spaceship A′ which is at rest with respect\nto A. The stationary spaceships A and A′ are also connected with a thread whose length\nremains constant for observers in A and A′ . As the speed of B and C increases the length\nof the thread decreases relativistically as monitored by observers in B and C. If the distance\nbetween A and A′ did not suffer relativistic length contraction (as Bell assumed) observers\nin B and C would conclude that the thread would break. This means that observers in A\nand A′ should also observe the same event. But for them the break of the thread would be a\ncomplete mystery since their state of motion has not changed and the proper distance between\nthem stayed the same. The correct explanation of the situation depicted in Fig. 3 is that\nfrom B's and C's point of view, both the distance between A and A′ and the thread contract\nrelativistically, which means that the thread is not subjected to any stress and will not break.\nAgain, what makes the situations represented in Fig. 1 and Fig. 3 different is the acceleration\nof B and C.\n\nB\n\nA'\na\n\nL\n\nL\n\nC\n\nA\n\nFigure 3: Another spaceship A′ is added to the thought experiment depicted in Fig. 1. Spaceships A and A′ are also connected with a thread. If the thread in Fig. 1 broke not because of\nthe acceleration of B and C, but because of stress caused by length contraction, then observers\nin B and C would conclude that the thread connecting A and A′ should also break. However,\nthat would be a total mystery for observers in A and A′ since the proper distance between A\nand A′ stays constant and the thread suffers no stress. So taking into account the reciprocity\nof length contraction demonstrates that no stress is involved in this effect and therefore the\nthread in Fig. 1 does not break because of length contraction.\n\n3\n\n\fAs for fifty years the accelerating spaceships paradox has been confusing some physicists\nand even relativists I will briefly summarize the reasons which clearly demonstrate that (i) what\ncauses the break of the thread connecting B and C is their acceleration, not length contraction,\nand (ii) no stress is involved in the length contraction effect. A proper relativistic treatment of\nthis thought experiment shows that Bell's explanation is based on a pre-relativistic intuition\nand as a result is incorrect on five counts.\n1. Bell assumes that the thread contracts but space does not. However, both special\nrelativity and the experimental evidence, which confirmed length contraction, tell us unambiguously that everything – physical objects and space – contract relativistically. When we use\nthe Lorentz transformations to determine the length contraction between two points it does\nnot matter whether these points are two points of space or are the end points of the thread.\nThe muon experiment [9, 10], which confirmed length contraction (in the rest frame of the\nmuon), demonstrated that space itself contracts relativistically.\n2. Bell thought that the thread breaks as a result of a stress arising in it since a stress,\naccording to him, is always present when there is length contraction. But stress is an absolute\n(frame-independent) physical quantity, which is represented by a tensor. This means that if the\nstress tensor is zero in one reference frame it should be zero in all reference frames. Therefore,\nfor observers in B and C, who measure the constant proper length of the thread in Fig. 2, the\nstress tensor should be zero, which means that from A's viewpoint there should be no stress in\nthe relativistically contracted thread either. This point, taken even alone, demonstrates that\nno stress is involved in length contraction, which clearly indicates that length contraction does\nnot cause the break of the thread in Fig. 1.\n3. Bell insisted that the thread breaks due to length contraction – the distance between\nB and C remains constant for A (space does not contract relativistically, according to Bell),\nbut the thread contracts and ultimately breaks. He apparently took it as self-evident that the\nthread did not break as a result of the acceleration of B and C. But as we saw above taking\ninto account relativity of motion and the reciprocity of length contraction demonstrates that\nthe thread would not break, if only length contraction were involved in the thought experiment.\n4. If the reason for the break of the thread were length contraction, the proper length of\nthe thread must be constant as required by this effect and as we saw above, which is not the\ncase in the discussed thought experiment as Bell himself acknowledges: \"B, for example, sees\nC drifting further and further behind, so that a given piece of thread can no longer span the\ndistance\" [6, p. 68]. If the proper distance increases, it is the acceleration of B and C that\ncauses the break of the thread, not length contraction.\n5. The very fact that this old paradox still manages to cause confusion demonstrates\nthat Minkowski's view of macroscopic physical bodies as four-dimensional worldtubes has not\nalways been taken seriously. And indeed in this paradox the authors who argued that there was\na stress involved in a relativistically contracted body, including Bell, assumed what appears\nto be self-evident – that observers in A measure the same three-dimensional thread that is\nmeasured by observers in B and C, which means that the same three-dimensional thread is\nsubjected to stress and deformation when it contracts. However, Minkowski pointed out a\nhundred years ago that relativistic length contraction could not be understood as some kind\nof deformation effect [11, p. 81]:\nAccording to Lorentz any moving body must have undergone a contraction in the\ndirection in the direction of its motion [. . .] This hypothesis sounds extremely fantastical, for the contraction is not to be looked upon as a consequence of resistances\nin the ether, or anything of that kind, but simply as a gift from above, – as an\naccompanying circumstance of the circumstance of motion.\nThen Minkowski [11, pp. 81-82] explained that the profound physical meaning of length\ncontraction is that while measuring the same Lorentzian electron two observers in relative\n\n4\n\n\fmotion measure two different three-dimensional cross-sections of the worldtube of the electron, which means that the observers measure two different three-dimensional electrons (what\nis 'the same electron' is its worldtube). Minkowski stressed that it is the fact that the observers measure two three-dimensional cross-sections, which have different lengths, that \"is\nthe meaning of Lorentz's hypothesis of the contraction of electrons in motion\" [11, p. 82].\nIn fact, it is Minkowski's attempt to reveal the physical meaning of relativity of simultaneity\nthat led him to the discovery of spacetime (length contraction is a specific manifestation of\nrelativity of simultaneity) – he realized that relativity of simultaneity implies many spaces since\na space is defined as one class of simultaneous events; hence relative simultaneity and therefore\nmany spaces cannot exist in a three-dimensional world. Minkowski wrote: \"We should then\nhave in the world no longer space, but an infinite number of spaces, analogously as there are\nin three-dimensional space an infinite number of planes. Three-dimensional geometry becomes\na chapter in four-dimensional physics\" [11, pp. 79-80].\nMost probably, he took into account that a spatially extended body is defined in terms of\nsimultaneity – as all parts of the body taken at a given moment of time. Then, it does follow\nfrom relativity of simultaneity that when measuring the same body two observers in relative\nmotion (who have different classes of simultaneous events), in fact, measure two different\nthree-dimensional bodies. But this is only possible if the worldtube of the body is a real fourdimensional object. In other words, the spaces of the two observers intersect the worldtube at\ndifferent angles and the three-dimensional cross-section of the observer moving with respect\nto the body is shorter.\nHowever, the two cross-sections have no objective meaning since they are merely a description of the body's worldtube in terms of our three-dimensional language. This fact explains\nwhy there is no stress present in the relativistically contracted body – the measured contracted body is not a real three-dimensional object that is shortened and therefore deformed\nsince there are no three-dimensional objects in spacetime; what is measured by an observer\nmoving with respect to the body (or more precisely, whose worldtube forms an angle with the\nbody's worldtube) is simply a three-dimensional cross-section whose length is shorter than the\nlength of the cross-section measured by an observer at rest with respect to the body. The\ntwo cross-sections have equal status – they are imaginary intersections of the observers' spaces\nand the body's worldtube. Due to their equal status and since they do not represent real\nthree-dimensional objects in spacetime neither of the cross-sections involves any stress (an\nimaginary intersection cannot produce real deformation and stress).\nMinkowski's explanation of the physical meaning of length contraction is not just a different\ndescription as some relativists often say. It is the only description that does not contradict\nrelativity. Let me stress – no length contraction of a meter stick would be possible if the\nmeter stick's worldtube did not exist as a four-dimensional object. If the meter stick were\na three-dimensional body, both observers would measure the same three-dimensional meter\nstick (the same set of simultaneously existing parts of the meter stick), which would mean that\nthe observers would have a common (absolute) class of simultaneous events in contradiction\nwith relativity [12, 13].\nLet me now show that it is the constantly increasing proper distance between the accelerating B and C that (i) causes the break of the thread connecting them, and (ii) keeps the\ndistance between B and C constant as reckoned by an observer in A. To calculate the proper\ndistance between B and C at different events as measured by an observer in spaceship C suppose that B and C are connected with a wire (instead of a thread) whose diameter at its end,\nwhich connects it with C, is significantly smaller than the diameter of the rest of the wire. So,\nwhen the wire breaks, it breaks at the end that connects it to C.\nAs shown in Fig. 4 the spaceships are represented by their worldtubes and the wire is\nrepresented by its worldstrip. Along the path of C there are devices in the inertial reference\nframe SA of spaceship A, which monitor the break of the wire. Assume the wire breaks at\nevent c2 . Then the device situated at the closest distance to c2 sends signals to B and C which\n5\n\n\fSA\n\nS'C ct'C\n\nctA\nSC\n'\n\nL\n\nc3\n\nb3\n\nL\n\nxC Lines of simultaneity in SA\n\nc2\nWorldtube of\nspaceship C\n\nx' C\n\nctC\n\nc1\nc0\n\nL\n\nb2\n\nxA\n\nb0\nWorldtube of spaceship B\n\nLight cone\n\nWorldstrip of the thread\n\nFigure 4: The spaceships B and C, represented by their worldtubes, start to accelerate simultaneously in the reference frame SA of spaceship A at events b0 and c0 , respectively. The\nwire connecting B and C is represented by its worldstrip. At event c2 the wire breaks and the\nmotors of B and C stop simultaneously in SA at events b2 and c2 , respectively; after that the\nspaceships continue to move at a constant velocity relative to SA . In SA the distance between\nB and C (i.e. the distance between the simultaneous events b2 and c2 ) is L = xb2 − xc2 . The\n′\ninstantaneously comoving inertial reference frames SC and SC\ncorresponding to the events c1\nand c2 , respectively, are used to determine the increasing proper distance L′ between B and\nC.\nshut down their motors simultaneously in SA . Despite that the signal sent to B requires more\ntime to reach B, it is possible to stop B's and C's motors simultaneously in SA ; for instance,\nC's motor can be stopped a little later after receiving the shut down signal. In such a way B\nand C start moving simultaneously in SA at t = t2 with constant velocity with respect to SA\n(this is represented in the spacetime diagram by the straight worldlines of B and C after the\nevents b2 and c2 , respectively).\nIn SA at moment t = t0 the distance between spaceship B and spaceship C is the distance\nbetween the simultaneous events c0 and b0 : L = xb0 − xc0 . As that distance remains constant\nin SA the distance between the simultaneous events c2 and b2 at t = t2 , when the wire breaks,\nis the same L = xb2 − xc2 . In the instantaneous comoving inertial frame at event c2 the proper\ndistance between B and C is L′ = x′b3 − x′c2 . The proper distance L′ measured by observers\nin B and C is greater than the initial separation L between B and C and is also greater than\nthe proper length L′ = x′b3 − x′c2 measured in the instantaneously comoving inertial frame\nat event c1 . The constant increase of L′ is a relativistic acceleration effect (with no classical\nanalog) resulting from the fact that the worldtubes of the accelerating spaceships B and C\nare hyperbolae between the events b0 and c0 and b2 and c2 , respectively. So, it is clearly seen\nin Fig. 4 that the wire breaks because the proper distance between B and C increases, not\nbecause of length contraction.\nThe assumption that B and C start moving at a constant velocity relative to SA at events\nb2 and c2 makes it possible to use Lorentz transformations to calculate the proper distance\nbetween B and C as measured by an observer in C at event c2 . The increase of the proper\ndistance between B and C (as measured by any of them) in the case of constantly accelerating\nB and C is calculated in [8].\n′\nIn SC\nat the moment t′c2 = t′b3 when the wire breaks the proper distance between B and\n′\nC is L = x′b3 − x′c2 . L′ can be calculated by using the Lorentz transformations\nx′b3 = γ(xb3 − vtb3 )\n6\n\n\fx′c2 = γ(xc2 − vtc2 )\nwhere γ = (1 − v 2 /c2 )−1/2 . As L′ = x′b3 − x′c2\nL′ = γ(xb3 − xc2 ) − vγ(tb3 − tc2 )\n\n(1)\n\nIn SA the x-coordinate of event b3 is\nxb3 = xc3 + L\nwhere L = xb3 − xc3 in SA . But as\nxc3 = xc2 + v(tb3 − tb2 )\nwe can write\nxb3 = xc2 + L + v(tb3 − tb2 ).\nThen\nxb3 − xc2 = L + v(tb3 − tc2 )\n\n(2)\n\nwhere we took into account that tb2 = tc2 in SA . Now we can substitute (2) in (1) and obtain\n′\nthe relation between L′ and L measured at c2 in SC\nand SA , respectively:\nL′ = γL.\nThen the contracted length measured at c2 in SA is\nLcontr = γ −1 L′ = L.\n\n(3)\n\nAs the conceptual analysis demonstrated the proper distance between B and C, measured\nby observers there, increases exactly as much as the distance between B and C, measured\nby an observer in A, shortens due to length contraction. So, indeed the correct relativistic\nexplanation of the constant distance between B and C, as reckoned by an observer in A, is\nthat the proper distance between B and C, measured by any of them, increases. But the\nquestion of the physical meaning of the increased proper distance as measured by B or C\nremains unclear if it is assumed that the spaceships exist as three-dimensional bodies – as B\nand C accelerate with the same proper acceleration the question is: Why does the proper\ndistance between them increase?\nTaking into account the reality of the worldtubes of B and C and of the worldstrip of the\nwire provides a complete explanation of the constant increase of the proper distance between\nB and C as measured by any of them – the spaces of the instantaneously comoving inertial reference frames corresponding to consecutive events of the worldtube of C intersect the existing\nworldtubes of B and C at different angles as shown in Fig. 4. At first sight it appears that the\nfact of the constant increase of the proper distance between B and C as the spaceships continue\nto accelerate, explains why the wire breaks. But this is not quite so. Due to the reality of the\nworldtubes of B and C and the worldstrip of the wire it follows that the increasing proper\ndistance, which is defined as the intersection of the space of the instantaneously comoving\ninertial frame at consecutive events, belonging to C's worldtube, and the worldtubes of B and\nC, does not have any objective meaning. This is best demonstrated by the fact that we can\nchoose the same non-orthogonal coordinate systems in all inertial reference frames (SA , SC ,\n′\nand SC\n), which means that the intersection defining the proper distance between B and C\ndepends on the convention used.\nIf the proper distance between B and C depends on our choice, how could the increase\nof something that does not reflect anything objective cause the physical break of the wire?\nIt seems to me the only remaining explanation is the following. Before the beginning of the\nacceleration of B and C their worldtubes are parallel as seen in Fig. 4 and the worldstrip of\n7\n\n\fthe wire attached to them is not stretched and does not experience any stress. But starting\nat events b0 and c0 the two worldtubes are deformed which means that the worldstrip of the\nwire is stretched by the deformation of the worldtubes of B and C and ultimately broken. It\nshould be stressed that nothing happens in spacetime – simply at some time-like distance from\nthe events b0 and c0 the worldstrip of the wire is broken.\nHad Bell taken seriously the reality of Minkowski spacetime and of worldtubes of macroscopic bodies he would have realized that what causes the break of the wire is the permanently\nincreasing proper distance between B and C resulting from their acceleration, not because of\nlength contraction. As it is the acceleration of B and C that breaks the wire, it would break\neven if there were no length contraction.\n\nReferences\n[1] E. Dewan, M.Beran: Note on stress effects due to relativistic contraction, American\nJournal of Physics 27, 517–518 (1959)\n[2] A.A. Evett and R.K. Wangsness: Note on the Separation of Relativistically Moving Rockets, American Journal of Physics 28, 521–606 (1960)\n[3] P.J. Nawrocki: Stress Effects due to Relativistic Contraction, American Journal of Physics\n30, 771–772 (1962)\n[4] E.M. Dewan: Stress Effects due to Lorentz Contraction, American Journal of Physics 31\n(5), 383–386 (1963)\n[5] A.A. Evett: A Relativistic Rocket Discussion Problem, American Journal of Physics 40,\n1170–1171 (1972)\n[6] J. S. Bell: Speakable and Unspeakable in Quantum Mechanics (Cambridge University\nPress, Cambridge 1987)\n[7] D. G. Boulware: Radiation from a Uniformly Accelerated Charge, Annals of Physics 124,\n169–188 (1980)\n[8] S.N. Lyle: Uniformly Accelerating Charged Particles: A Threat to the Equivalence Principle (Springer, Berlin 2008) p. 194\n[9] B. Rossi and D. B. Hall: Variation of the Rate of Decay of Mesotrons with Momentum,\nPhysical Review 59 (1941) pp. 223–228\n[10] G. F. R. Ellis and R. M. Williams: Flat and Curved Space-Times (Oxford University\nPress, Oxford 1988) p. 104\n[11] H. Minkowski: Space and Time. In: H. A. Lorentz, A. Einstein, H. Minkowski, H. Weyl:\nThe Principle of Relativity (Dover, New York 1952).\n[12] V. Petkov: Relativity and the Nature of Spacetime (Springer, Berlin 2005) Sect. 5.3\n[13] V. Petkov: On the Reality of Minkowski Space, Foundations of Physics 37, 1499–1502\n(2007)\n\n8\n\n\f"}