{"id": "http://arxiv.org/abs/1001.1258v1", "guidislink": true, "updated": "2010-01-08T12:41:15Z", "updated_parsed": [2010, 1, 8, 12, 41, 15, 4, 8, 0], "published": "2010-01-08T12:41:15Z", "published_parsed": [2010, 1, 8, 12, 41, 15, 4, 8, 0], "title": "Surface waves versus negative refractive index in layered\n  superconductors", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1001.2419%2C1001.4917%2C1001.3439%2C1001.5094%2C1001.2902%2C1001.3586%2C1001.4091%2C1001.0663%2C1001.5166%2C1001.1850%2C1001.4039%2C1001.0479%2C1001.1353%2C1001.1591%2C1001.1200%2C1001.1123%2C1001.0361%2C1001.4131%2C1001.3590%2C1001.2647%2C1001.5111%2C1001.3161%2C1001.1090%2C1001.2922%2C1001.4316%2C1001.3192%2C1001.0889%2C1001.0934%2C1001.0170%2C1001.3695%2C1001.0442%2C1001.5412%2C1001.1969%2C1001.2581%2C1001.4706%2C1001.2218%2C1001.2383%2C1001.4743%2C1001.3422%2C1001.2951%2C1001.2249%2C1001.4798%2C1001.1770%2C1001.1395%2C1001.3716%2C1001.2494%2C1001.3486%2C1001.4177%2C1001.3212%2C1001.4277%2C1001.3196%2C1001.0664%2C1001.0661%2C1001.3780%2C1001.3830%2C1001.4164%2C1001.1258%2C1001.2028%2C1001.1631%2C1001.5289%2C1001.0137%2C1001.5212%2C1001.2278%2C1001.2762%2C1001.0020%2C1001.5448%2C1001.0204%2C1001.2845%2C1001.0049%2C1001.1294%2C1001.0931%2C1001.3853%2C1001.4561%2C1001.2190%2C1001.0883%2C1001.2562%2C1001.3036%2C1001.1327%2C1001.1916%2C1001.3896%2C1001.2307%2C1001.4624%2C1001.3694%2C1001.0106%2C1001.4197%2C1001.3748%2C1001.5175%2C1001.3051%2C1001.3472%2C1001.2953%2C1001.2873%2C1001.2196%2C1001.1680%2C1001.1704%2C1001.0018%2C1001.1662%2C1001.2604%2C1001.2035%2C1001.2005%2C1001.0156%2C1001.0575&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Surface waves versus negative refractive index in layered\n  superconductors"}, "summary": "We predict a new branch of surface Josephson plasma waves (SJPWs) in layered\nsuperconductors for frequencies higher than the Josephson plasma frequency. In\nthis frequency range, the permittivity tensor components along and transverse\nto the layers have different signs, which is usually associated with negative\nrefraction. However, for these frequencies, the bulk Josephson plasma waves\ncannot be matched with the incident and reflected waves in the vacuum, and,\ninstead of the negative-refractive properties, abnormal surface modes appear\nwithin the frequency band expected for bulk modes. We also discuss the\nexcitation of high-frequency SJPWs by means of the attenuated-total-reflection\nmethod.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1001.2419%2C1001.4917%2C1001.3439%2C1001.5094%2C1001.2902%2C1001.3586%2C1001.4091%2C1001.0663%2C1001.5166%2C1001.1850%2C1001.4039%2C1001.0479%2C1001.1353%2C1001.1591%2C1001.1200%2C1001.1123%2C1001.0361%2C1001.4131%2C1001.3590%2C1001.2647%2C1001.5111%2C1001.3161%2C1001.1090%2C1001.2922%2C1001.4316%2C1001.3192%2C1001.0889%2C1001.0934%2C1001.0170%2C1001.3695%2C1001.0442%2C1001.5412%2C1001.1969%2C1001.2581%2C1001.4706%2C1001.2218%2C1001.2383%2C1001.4743%2C1001.3422%2C1001.2951%2C1001.2249%2C1001.4798%2C1001.1770%2C1001.1395%2C1001.3716%2C1001.2494%2C1001.3486%2C1001.4177%2C1001.3212%2C1001.4277%2C1001.3196%2C1001.0664%2C1001.0661%2C1001.3780%2C1001.3830%2C1001.4164%2C1001.1258%2C1001.2028%2C1001.1631%2C1001.5289%2C1001.0137%2C1001.5212%2C1001.2278%2C1001.2762%2C1001.0020%2C1001.5448%2C1001.0204%2C1001.2845%2C1001.0049%2C1001.1294%2C1001.0931%2C1001.3853%2C1001.4561%2C1001.2190%2C1001.0883%2C1001.2562%2C1001.3036%2C1001.1327%2C1001.1916%2C1001.3896%2C1001.2307%2C1001.4624%2C1001.3694%2C1001.0106%2C1001.4197%2C1001.3748%2C1001.5175%2C1001.3051%2C1001.3472%2C1001.2953%2C1001.2873%2C1001.2196%2C1001.1680%2C1001.1704%2C1001.0018%2C1001.1662%2C1001.2604%2C1001.2035%2C1001.2005%2C1001.0156%2C1001.0575&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We predict a new branch of surface Josephson plasma waves (SJPWs) in layered\nsuperconductors for frequencies higher than the Josephson plasma frequency. In\nthis frequency range, the permittivity tensor components along and transverse\nto the layers have different signs, which is usually associated with negative\nrefraction. However, for these frequencies, the bulk Josephson plasma waves\ncannot be matched with the incident and reflected waves in the vacuum, and,\ninstead of the negative-refractive properties, abnormal surface modes appear\nwithin the frequency band expected for bulk modes. We also discuss the\nexcitation of high-frequency SJPWs by means of the attenuated-total-reflection\nmethod."}, "authors": ["V. A. Golick", "D. V. Kadygrob", "V. A. Yampol'skii", "A. L. Rakhmanov", "B. A. Ivanov", "Franco Nori"], "author_detail": {"name": "Franco Nori"}, "author": "Franco Nori", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1103/PhysRevLett.104.187003", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1001.1258v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1001.1258v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "4 figures", "arxiv_primary_category": {"term": "cond-mat.supr-con", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cond-mat.supr-con", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1001.1258v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1001.1258v1", "journal_reference": "Phys. Rev. Lett. 104, 187003 (2010) [4 pages]", "doi": "10.1103/PhysRevLett.104.187003", "fulltext": "Surface waves versus negative refractive index in layered\nsuperconductors\n\narXiv:1001.1258v1 [cond-mat.supr-con] 8 Jan 2010\n\nV.A. Golick,1 D.V. Kadygrob,2 V.A. Yampol'skii,1, 2, 3\nA.L. Rakhmanov,3, 4 B.A. Ivanov,3, 5, 6 and Franco Nori3, 7\n1\n\nV.N. Karazin Kharkov National University, 61077 Kharkov, Ukraine\n2\n\nA.Ya. Usikov Institute for Radiophysics and Electronics,\n\nUkrainian Academy of Sciences, 61085 Kharkov, Ukraine\n3\n\nAdvanced Science Institute, The Institute of Physical and\nChemical Research (RIKEN), Saitama, 351-0198, Japan\n4\n\nInstitute for Theoretical and Applied Electrodynamics\nRussian Acad. Sci., 125412 Moscow, Russia\n\n5\n\nInstitute of Magnetism, Ukrainian Academy of Sciences, 03142 Kiev, Ukraine\n6\n\n7\n\nNational T. Shevchenko University of Kiev, 03127 Kiev, Ukraine\n\nDepartment of Physics, University of Michigan, Ann Arbor, MI 48109, USA\n\nAbstract\nWe predict a new branch of surface Josephson plasma waves (SJPWs) in layered superconductors\nfor frequencies higher than the Josephson plasma frequency. In this frequency range, the permittivity tensor components along and transverse to the layers have different signs, which is usually\nassociated with negative refraction. However, for these frequencies, the bulk Josephson plasma\nwaves cannot be matched with the incident and reflected waves in the vacuum, and, instead of\nthe negative-refractive properties, abnormal surface modes appear within the frequency band expected for bulk modes. We also discuss the excitation of high-frequency SJPWs by means of the\nattenuated-total-reflection method.\nPACS numbers: 74.25.N-, 42.25.Bs\n\n1\n\n\fHigh-Tc layered cuprate superconductors are important candidates for negative-refractiveindex (NRI) metamaterials (see, e.g., [1, 2]). Indeed, being uniaxial strongly anisotropic\nmaterials, they provide different signs of the permittivity tensor components along, εab , and\ntransverse, εc , to the layers in a wide frequency range (see, e.g., [3]), providing a possibility\nof NRI. These metamaterials are attracting considerable attention because they have the potential for subwavelength resolution and aberration-free imaging. Layered superconductors\nare very promising metamaterials because they are relatively straightforward to fabricate\n(compared to double negative metamaterials) and do not require negative permeability.\nExperiments for the c-axis conductivity in layered superconductors prove the use of a\nmodel in which the superconducting CuO2 layers are coupled by the intrinsic Josephson\neffect through the layers [4]. Thus, a Josephson plasma with anisotropic current capability\nis produced in layered superconductors. Moreover, the physical mechanisms of the currents along and across the layers are fundamentally different. The current along the layers\nis similar to the current in bulk superconductors, while the current across the layers is\nJosephson-type.\nThe Josephson current along the c-axis couples with the electromagnetic field inside the\ninsulating dielectric layers, forming Josephson plasma waves (JPWs) (see the review [5] and\nreferences therein). Thus, the propagation of electromagnetic waves through the layers is\nfavored by the layered structure. The study of these waves is very important because of\ntheir Terahertz frequency range, which is still hardly reachable for electronic and optical\ndevices.\nLike in common plasma waves, JPWs propagate with frequencies above some threshold\nvalue (the Josephson plasma frequency ωJ ). However, in the frequency range below ωJ , the\npresence of the sample boundary can produce surface Josephson plasma waves (SJPWs) [6],\nwhich are analog to the surface plasmon polaritons in metals [7, 8]. Such waves can propagate\nalong the vacuum-layered superconductor interface and damp away from it.\nAt frequencies ω higher than the Josephson plasma frequency ωJ , the normal-to-the-layers\ncomponents of both the group velocity and the Poynting vector of propagating JPWs, have\nsigns opposite to the sign of the normal component of the wave-vector ks . This corresponds\nto a NRI. However, the condition ω > ωJ is not sufficient for NRI. This NRI effect can\nbe observed at the vacuum-layered superconductor boundary only in a relatively narrow\nfrequency range, ωJ < ω < ω1vac = ωJ [ε/(ε − 1)]1/2 , where ε is the interlayer dielectric\n2\n\n\fconstant. A similar limitation exists for any insulator-layered superconductor boundary, if\nthe dielectric constant εext of the insulator is less than ε. The above conditions follow from\nthe dispersion relation for the JPWs and the natural limitation for the tangential component\nq (q = k sin θ < k,\n\nk = ω/c) of the wave-vector for a wave incident at an angle θ from the\n\nvacuum onto the layered superconductor. A simple analysis shows that the above inequality\nis compatible with the dispersion relation for JPWs only for frequencies ωJ < ω < ω1vac . In\nother words, any wave with frequency ω > ω1vac incident from the vacuum cannot propagate\nfurther in a layered superconductor. JPWs with ω > ω1vac can only match evanescent waves\nin the vacuum. As for frequencies ωJ < ω < ω1vac , the NRI can be observed, but only for\nincident angles θ higher than some critical value θcrit .\nFor frequencies in the interval\nω1vac < ω < ω2 ,\n\nω2 = ωJ γ,\n\n(1)\n\nwe predict the existence of a new branch of surface waves (here γ = λc /λab ≫ 1 is the\n\ncurrent-anisotropy parameter, λc = c/ωJ ε1/2 and λab are the magnetic-field penetration\ndepths along and across the layers, respectively). Despite numerous works on this issue,\n\nSJPWs with frequencies higher than ωJ were not discussed before. Here we study them and\nprove that the SJPWs spectrum consists of two branches. The low-frequency branch was\ndescribed in detail in [6]. Its spectrum ω(q) follows the \"vacuum light line\", q = ω/c, and\ndeviates from it at frequencies close to ωJ . The new branch of SJPWs predicted here starts\nat the frequency ω = ω1vac and follows the vacuum light line for ω ≪ ω2 . For frequencies of\nthe order of ω2 , the dispersion curve ω(q) strongly deviates from the vacuum light line and\nstops at the frequency ω = ω2 when q ≈ 1/λab .\n\nThus, SJPWs do not exist within the frequency gap ωJ < ω < ω1vac . On the other\n\nhand, as shown here, this is actually the range where the NRI can be observed (for waves\nincident from the vacuum onto the layered-superconductor boundary). Hence, some kind of\ncomplementarity between the NRI and surface waves is established in this paper.\nConditions for the observation of NRI.- Consider a layered structure consisting of superconducting and dielectric layers with thicknesses s and d, respectively (see Fig. 1). We\nstudy the transverse-magnetic JPWs propagating with wave-vector ks = (q, 0, κs ) and having the electric, Es = {Exs , 0, Ezs }, and magnetic, Hs = {0, H s, 0}, components proportional\nto exp[i(qx + κs z − ωt)]. The coordinate system is shown in Fig. 1.\n3\n\n\fFIG. 1: (Color online) Geometry for studying waves in layered superconductors. The interface\nz = 0 divides the layered superconductor from an insulator with dielectric constant εext .\n\nThe electromagnetic field inside the layered superconductor is determined by the distribution of the gauge invariant phase difference φ(x, z, t) of the order parameter between\nneighboring layers. This phase difference can be described by a set of coupled sine-Gordon\nequations (see review [5]). In the continuum and linear approximation, φ(x, z, t) can be\nexcluded from the set of equations for electromagnetic fields, and the electrodynamics of\nlayered superconductors can be described in terms of an anisotropic frequency-dependent\ndielectric permittivity with components εc (Ω) and εab (Ω) across and along the layers, respectively [2]. In Ref. [9], the effect of spatial dispersion in εc , related to the capacitive\ninterlayer coupling, was taken into account. Here we do not consider this effect because it\nis only important for a very narrow frequency range near ωJ [9].\nIn the limit s/d ≪ 1, the equations for εc (Ω) and εab (Ω) can be written as\n\u0013\n\u0012\n1\n1\n,\nεc (Ω) = ε 1 − 2 + iνc\nΩ\nΩ\n\u0012\n\u0013\n1 2\n1 2\nεab (Ω) = ε 1 − 2 γ + iνab γ .\nΩ\nΩ\n\n(2)\n\nHere we introduce the dimensionless parameters Ω = ω/ωJ , νab = 4πσab /εωJ γ 2 , and νc =\n4πσc /εωJ . The relaxation frequencies νab and νc are proportional to the averaged quasi4\n\n\fparticle conductivities σab (along the layers) and σc (across the layers), respectively; ωJ =\n(8πeDjc /~ε)1/2 is the Josephson plasma frequency. The latter is determined by the critical\nJosephson current density jc , the interlayer dielectric constant ε, and the spatial period of\nthe layered structure D = s + d ≈ d.\nAnalyzing the relations for εc (Ω) and εab (Ω), we conclude that their real parts have\ndifferent signs in a wide frequency range: ωJ < ω < ω2 = ωJ γ (or 1 < Ω < Ω2 = γ ≫ 1). In\nthis frequency range, the z-components of the group velocity and the Poynting vector of the\nbulk JPWs are directed opposite to the z-component of the wave-vector ks , and this, at first\nsight, corresponds to having a NRI. However, a more careful analysis shows that this can\nonly be observed for a much narrower frequency interval. To verify this, one can consider\nthe well-known dispersion relation for the normal component κs of the JPW wave-vector,\n\u0014\n\u0015\nq2\n2\n2\nκs = εab (Ω) k −\n,\n(3)\nεc (Ω)\nthat follows directly from Maxwell's equations. Obviously, the JPWs can propagate only\nwhen Re(κs2 ) > 0, where \"Re\" stands for the real part. Neglecting dissipation, the permittivity εab is negative for the frequency region ωJ < ω < ω2 considered here. Consequently,\nJPWs can propagate if the factor [k 2 − q 2 /εc (Ω)] in Eq. (3) is negative. Using Eq. (2) for\n\nεc (Ω), one can conclude that this factor is negative only when 1 < Ω2 < 1 + q 2 λ2c . For a\nwave incident, at an angle θ, from the insulator with dielectric constant εext onto the layered\n1/2\n\nsuperconductor, we have q = (ωεext /c) sin θ. Thus, a NRI can be observed for waves with\nincident angles higher than the critical value θcrit defined by the equation,\nsin(θcrit ) =\n\np\n\nεc (Ω)/εext .\n\n(4)\n\nIt is important to note that, due to the negative sign of the permittivity εab in Eq. (3), the\nincident wave penetrates the superconductor for θ > θcrit , and totally reflects from it for\nθ < θcrit , contrary to the standard case of waves incident onto the interface dividing two\nusual right-handed media.\nFor εext < ε, Eqs. (2), (4), and the inequality sin(θcrit ) ≤ 1, provide the conditions,\nωJ < ω < ω1 = ωJ\n\n\u0012\n\nε\nε − εext\n\n\u00131/2\n\n.\n\n(5)\n\nThus, the NRI for a layered superconductor bounded by an insulator with εext < ε can\nonly be observed in the frequency range ωJ < ω < ω1 = ωJ Ω1 . This frequency window\n5\n\n\fcan be expanded if one uses an insulator with large enough permittivity εext . Only for\ninsulators with very high permittivity εext > ε, the negative refraction can occur in the whole\nfrequency interval ωJ < ω < ω2 . The frequency range for the existence of the bulk JPWs\nin superconductors with capacitive interlayer coupling was derived in [10]. If the constant\nof this coupling tends to zero, the frequency range obtained in [10] coincides with Eq. (5).\nBelow we consider waves in the insulator-layered superconductor system with εext < ε for\nfrequencies ω > ω1 .\nSurface Josephson plasma waves above ω1 .- When ωJ < ω < ω2 and the factor in Eq. (3)\nis positive, the z-component κs of the wave-vector ks becomes imaginary. This means that\n√\nthe wave damps into the layered superconductor. On the other hand, for q > ω εext /c\nthe wave damps also into the insulator above the layered superconductor. These are the\ncharacteristic features of the surface waves discussed in this section.\nConsider an interface (the xy-plane) separating an insulator (z > 0 in Fig. 1) and a\nlayered superconductor (z ≤ 0). We now consider a linear surface transverse-magnetic\nmonochromatic wave propagating along the x-axis (i.e., proportional to exp[i(qx − ωt)]) and\ndecaying into both, the insulator and layered superconductor, away from the interface z = 0.\nPerforming the standard procedure for searching surface waves (i.e., solving the Maxwell\nequations for the insulator and layered superconductor with proper boundary conditions\nat the interface between them) we obtain the dispersion relation for the surface Josephson\nplasma waves:\n\u00131/2\nεext − εab (Ω)\n,\nκ(Ω) = Ω εc (Ω) 2\nεext − εc (Ω)εab (Ω)\nor, neglecting dissipation,\n\u0012\n\u00131/2\nγ 2 − Ω2 + Ω2 εext /ε\nκ(Ω) = Ω\n.\nγ 2 − Ω2 + Ω4 ε2ext /(Ω2 − 1)ε2\n\u0012\n\n(6)\n\n(7)\n\n1/2\n\nHere the dimensionless wave-vector is defined as κ = cq/ωJ εext . Equation (7) describes two\nbranches of the dispersion curve for the SJPWs (see Fig. 2). The first branch exists in the\nlow frequency range, 0 < ω < ωJ , and it was studied before in [6]. The second (predicted\n1/2\n\nhere) branch starts from the light line ω = cq/εext (or Ω = κ) at ω = ω1 (point A in Fig. 2),\nthen follows this line, deviates from it at ω ∼ ω2 = γωJ , and stops at the point where\n\nq = γωJ ε1/2 /c, ω = ω2 (point B in Fig. 2).\n\nThus, there exists a frequency gap, ωJ < ω < ω1 , in the spectrum of the SJPWs. We\nemphasize that the NRI should only exist within this gap. When the permittivity εext of the\n6\n\n\f1/2\n\nFIG. 2: (Color online) The dispersion curve (Ω = ω/ωJ versus κ = cq/ωJ εext ) for SJPWs at the\nvacuum-layered superconductor interface. The values of the parameters are: γ = 200, ε = 16.\nInset: zoom-in of the spectrum near the point (κ = 1, Ω = 1). Points A and B correspond to the\nbeginning and end of the high-frequency branch. The green dashed line is the vacuum light line\nΩ = κ.\n\ninsulator increases, the point A in Fig. 2 moves towards point B, and the gap in the SJPW\nspectrum increases. When εext = ε(1 − 1/γ 2 ) ≈ ε, the points A and B coincide, and the\nhigh-frequency branch in the SJPWs spectrum disappears.\nNote that the Josephson current is small with respect to the displacement current at\nhigh frequencies, Ω ≫ 1. In this case, we can omit 1 in the denominator in Eq. (7).\nThis corresponds to the dispersion relation for a periodic layered structure without coupling\nbetween superconducting layers. Specifically, the interlayer Josephson coupling is responsible\nfor the appearance of a frequency gap, ωJ < ω < ω1 , in the spectrum of SJPWs.\nExcitation of the SJPWs above ω1 .- It is known that the excitation of surface waves is\naccompanied by the so-called Wood anomalies of the reflectivity and transmissivity coeffi7\n\n\fcients (see, e.g., [8]). These resonance anomalies can result in the complete suppression of\nthe reflectivity by a proper choice of parameters. Here we consider the excitation of highfrequency SJPWs (Ω ≫ 1) by a wave incident from a dielectric prism with permittivity εp\nonto a layered superconductor separated from the prism by a vacuum gap of thickness δ (the\nso-called \"attenuated-total-reflection\" method for producing surface waves, see Fig. 3).\nThe suppression of the specular reflectivity |R|2 = |H r /H i |2 due to the resonant excitation\nof the surface waves can be observed by changing the incident angle at a given frequency or\nby changing the frequency at a given incident angle, as demonstrated in Fig. 4 (a, b). Here\nH i and H r are the magnetic field amplitudes of the incident and reflected waves, respectively.\nFigure 4 (c) shows the sharp decrease of the reflectivity in the (θ, Ω) plane.\nConclusions.- Here we predict the existence of a new branch of SJPWs in layered superconductors for the frequency range higher than the Josephson plasma frequency, which\nis a very unusual phenomenon for plasma-like media. It is important that a NRI can only\nbe observed for frequencies within the gap in the spectrum of the SJPWs. Thus, some kind\nof complementarity between NRI and surface waves is established in this paper. We have\nalso described the excitation of these SJPWs by means of the attenuated-total-reflection\nmethod.\nWe gratefully acknowledge partial support from the NSA, LPS, ARO, and NSF grant\nNo. 0726909.\n\n[1] M. Ricci et al., Appl. Phys. Lett. 87, 034102 (2005); C. Du et al., Phys. Rev. B 74, 113105\n(2006); B. Wood et al., J. Phys.: Condens. Matter 19, 076208 (2007); F. Magnus et al., Nature\nMaterials 7, 295 (2008); E. Narimanov, ibid. 7, 273 (2008); M.B. Romanowsky et al., Phys.\nRev. A 78, 041110 (2008); K.Y. Bliokh et al., Rev. Mod. Phys. 80, 1201 (2008).\n[2] A.L. Rakhmanov et al., arXiv:0907.3564 (2009).\n[3] V.A. Podolskiy and E. E. Narimanov, Phys. Rev. B 71, 201101 (2005); J.B. Pendry, Science\n306, 1353 (2004); A. Alu et al., J. Opt. Soc. Am. B 23, 571 (2006); O.V. Ivanov et al.,\nCrystallogr. Rep. 45, 487 (2000).\n[4] R. Kleiner et al., Phys. Rev. Lett. 68, 2394 (1992); R. Kleiner and P. Muller, Phys. Rev. B\n49, 1327 (1994).\n[5] S. Savel'ev et al., arXiv:0903.2969; Rep. Prog. Phys. (to be published).\n\n8\n\n\fFIG. 3: (Color online) A dielectric prism with permittivity εp is separated from a layered superconductor by a vacuum gap of thickness δ. An electromagnetic wave with incident angle θ, exceeding\n−1/2\n\nthe limit angle θt = arcsin(εp\n\n) for total internal reflection, can excite surface waves that sat1/2\n\nisfy the following resonance condition: ωεp sin θ = cq. Here ki and kr are the wave-vectors of\nthe incident and reflected waves associated with the magnetic field amplitudes Hi and Hr . The\nresonance excitation of surface waves by the incident wave produces a strong suppression of the\nreflected wave.\n[6] S. Savel'ev et al., Phys. Rev. Lett. 95, 187002 (2005); V. A. Yampol'skii, et al., Phys. Rev. B\n76, 224504 (2007); V. A. Yampol'skii et al., ibid 79, 214501 (2009).\n[7] P. M. Platzman and P. A. Wolff, Waves and Interactions in Solid State Plasmas (Academic,\nLondon, 1973).\n\n9\n\n\fFIG. 4: (Color online) (a) The reflectivity coefficient |R|2 versus the incident angle θ calculated\nnumerically for the parameters νab = 10−3 , γ = 200, ε = 16, εp = 4, and Ω = 135. These\nparameters correspond to the solid square on the dispersion curve in Fig. 2. The thickness δ of\nthe vacuum gap (see Fig. 3) is one wavelength, kδ = 2π. The vertical dashed line at θ = 30◦\ncorresponds to the limit angle of the total internal reflection. (b) The reflectivity coefficient |R|2\nversus frequency, Ω = ω/ωJ , for θ = 30.6◦ . (c) Color contour plot of the reflectivity coefficient\n|R|2 in the plane (θ, Ω). The dispersion relation for the waves in the dielectric-vacuum-layered\nsuperconductor system in Fig. 3 is presented by the solid white curve.\n\n10\n\n\f[8] V. M. Agranovich and D. L. Mills, Surface Polaritons (Nauka, Moscow, 1985); H. Raether,\nSurface Plasmons (Springer, New York, 1988).\n[9] L.N. Bulaevskii et al., Europhys. Lett. 58, 415 (2002).\n[10] Ch. Helm and L.N. Bulaevskii, Phys. Rev. B 66, 094514 (2002).\n\n11\n\n\f"}