{"id": "http://arxiv.org/abs/1007.2657v4", "guidislink": true, "updated": "2011-02-26T11:34:55Z", "updated_parsed": [2011, 2, 26, 11, 34, 55, 5, 57, 0], "published": "2010-07-15T21:11:24Z", "published_parsed": [2010, 7, 15, 21, 11, 24, 3, 196, 0], "title": "Selective growth of perovskite oxides on SrTiO3 (001) by control of\n  surface reconstructions", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1007.4682%2C1007.1826%2C1007.0910%2C1007.0161%2C1007.0661%2C1007.3118%2C1007.4587%2C1007.3263%2C1007.4536%2C1007.4460%2C1007.0929%2C1007.1080%2C1007.2151%2C1007.0570%2C1007.3986%2C1007.0567%2C1007.4996%2C1007.0249%2C1007.2198%2C1007.2244%2C1007.3145%2C1007.2678%2C1007.0450%2C1007.5006%2C1007.4886%2C1007.1970%2C1007.4798%2C1007.2801%2C1007.1315%2C1007.1221%2C1007.2623%2C1007.0034%2C1007.2805%2C1007.4038%2C1007.5053%2C1007.4087%2C1007.5182%2C1007.2971%2C1007.4173%2C1007.3956%2C1007.2515%2C1007.4225%2C1007.4031%2C1007.3407%2C1007.0232%2C1007.0853%2C1007.3036%2C1007.4315%2C1007.0002%2C1007.5438%2C1007.0389%2C1007.3941%2C1007.2725%2C1007.3539%2C1007.4453%2C1007.0186%2C1007.3799%2C1007.2778%2C1007.2553%2C1007.1540%2C1007.4243%2C1007.2116%2C1007.0737%2C1007.3392%2C1007.1613%2C1007.0494%2C1007.3612%2C1007.0490%2C1007.2978%2C1007.3084%2C1007.2657%2C1007.1892%2C1007.1394%2C1007.3679%2C1007.4440%2C1007.4743%2C1007.3359%2C1007.0965%2C1007.4739%2C1007.5217%2C1007.4994%2C1007.3709%2C1007.0212%2C1007.1361%2C1007.4184%2C1007.4748%2C1007.3699%2C1007.1312%2C1007.0344%2C1007.2025%2C1007.3601%2C1007.3005%2C1007.3635%2C1007.4271%2C1007.2859%2C1007.0524%2C1007.3706%2C1007.1639%2C1007.1924%2C1007.5447%2C1007.3303&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Selective growth of perovskite oxides on SrTiO3 (001) by control of\n  surface reconstructions"}, "summary": "We report surface reconstruction (RC)-dependent growths of SrTiO3 and SrVO3\non a SrTiO3 (001) surface with two different coexisting surface RCs, namely\n(2x1) and c(6x2). Up to the coverage of several layers, epitaxial growth was\nforbidden on the c(6x2) RC under the growth conditions that permitted\nlayer-by-layer epitaxial growth on the (2x1) RC. Scanning tunneling microscopy\nexamination of the lattice structure of the c(6x2) RC revealed that this\nRC-selective growth mainly originated from the significant\nstructural/stoichiometric dissimilarity between the c(6x2) RC and the cubic\nperovskite films. As a result, the formation of SrTiO3 islands was forbidden\nfrom the nucleation stage.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1007.4682%2C1007.1826%2C1007.0910%2C1007.0161%2C1007.0661%2C1007.3118%2C1007.4587%2C1007.3263%2C1007.4536%2C1007.4460%2C1007.0929%2C1007.1080%2C1007.2151%2C1007.0570%2C1007.3986%2C1007.0567%2C1007.4996%2C1007.0249%2C1007.2198%2C1007.2244%2C1007.3145%2C1007.2678%2C1007.0450%2C1007.5006%2C1007.4886%2C1007.1970%2C1007.4798%2C1007.2801%2C1007.1315%2C1007.1221%2C1007.2623%2C1007.0034%2C1007.2805%2C1007.4038%2C1007.5053%2C1007.4087%2C1007.5182%2C1007.2971%2C1007.4173%2C1007.3956%2C1007.2515%2C1007.4225%2C1007.4031%2C1007.3407%2C1007.0232%2C1007.0853%2C1007.3036%2C1007.4315%2C1007.0002%2C1007.5438%2C1007.0389%2C1007.3941%2C1007.2725%2C1007.3539%2C1007.4453%2C1007.0186%2C1007.3799%2C1007.2778%2C1007.2553%2C1007.1540%2C1007.4243%2C1007.2116%2C1007.0737%2C1007.3392%2C1007.1613%2C1007.0494%2C1007.3612%2C1007.0490%2C1007.2978%2C1007.3084%2C1007.2657%2C1007.1892%2C1007.1394%2C1007.3679%2C1007.4440%2C1007.4743%2C1007.3359%2C1007.0965%2C1007.4739%2C1007.5217%2C1007.4994%2C1007.3709%2C1007.0212%2C1007.1361%2C1007.4184%2C1007.4748%2C1007.3699%2C1007.1312%2C1007.0344%2C1007.2025%2C1007.3601%2C1007.3005%2C1007.3635%2C1007.4271%2C1007.2859%2C1007.0524%2C1007.3706%2C1007.1639%2C1007.1924%2C1007.5447%2C1007.3303&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We report surface reconstruction (RC)-dependent growths of SrTiO3 and SrVO3\non a SrTiO3 (001) surface with two different coexisting surface RCs, namely\n(2x1) and c(6x2). Up to the coverage of several layers, epitaxial growth was\nforbidden on the c(6x2) RC under the growth conditions that permitted\nlayer-by-layer epitaxial growth on the (2x1) RC. Scanning tunneling microscopy\nexamination of the lattice structure of the c(6x2) RC revealed that this\nRC-selective growth mainly originated from the significant\nstructural/stoichiometric dissimilarity between the c(6x2) RC and the cubic\nperovskite films. As a result, the formation of SrTiO3 islands was forbidden\nfrom the nucleation stage."}, "authors": ["Soo-hyon Phark", "Young Jun Chang", "Tae Won Noh"], "author_detail": {"name": "Tae Won Noh"}, "author": "Tae Won Noh", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1063/1.3583443", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1007.2657v4", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1007.2657v4", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "cond-mat.mtrl-sci", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cond-mat.mtrl-sci", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "cond-mat.mes-hall", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1007.2657v4", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1007.2657v4", "arxiv_comment": null, "journal_reference": null, "doi": "10.1063/1.3583443", "fulltext": "Selective growth of perovskite oxides on SrTiO3 (001) by control\nof surface reconstructions\n\narXiv:1007.2657v4 [cond-mat.mtrl-sci] 26 Feb 2011\n\nSoo-hyon Phark,∗ Young Jun Chang,† and Tae Won Noh\nReCOE and FPRD, Department of Physics and Astronomy,\nSeoul National University, Seoul 151-747, Korea\n(Dated: April 15, 2019)\n\nAbstract\nWe report surface reconstruction (RC)-dependent growths of SrTiO3 and SrVO3 on a SrTiO3\n(001) surface with two different coexisting surface RCs, namely (2×1) and c(6×2). Up to the\ncoverage of several layers, epitaxial growth was forbidden on the c(6×2) RC under the growth\nconditions that permitted layer-by-layer epitaxial growth on the (2×1) RC. Scanning tunneling\nmicroscopy on the lattice structure of the c(6×2) RC revealed that this RC-selective growth mainly\noriginated from the significant structural/stoichiometric dissimilarity between the c(6×2) RC and\nthe cubic perovskite films. As a result, the formation of SrTiO3 islands was forbidden from the\nnucleation stage.\n\n∗\n\n†\n\nphark@mpi-halle.mpg.de; present address: Max-Planck-Institut für Mikrostrukturphysik, Weinberg 2,\n06120 Halle, Germany\npresent address: Advanced Light Source, Lawrence Berkeley National Laboratory, Berkeley, California\n94720, USA\n\n1\n\n\fThin film engineering via the atomic-scale control of surfaces and interfaces is one of the\nmost important technological assets for regulating and utilizing the functionalities of oxide\nmaterials.[1, 2] In particular, SrTiO3 (STO) single crystalline substrates have been widely\nused to realize low-dimensional oxide structures such as ultrathin films[3] and nanowires,[4]\nwith properties that are radically different from those of their bulk hosts.\nWhen utilized as a substrate for films composed of other materials, a STO (001) surface\nterminated with a TiO2 plane and followed by the formation of a (2×1) reconstruction (RC)\nconstitutes a well-defined surface structure.[5–8] However, slight changes in temperature\nand/or oxygen partial pressure (P O2 ) during surface preparation are frequently accompanied\nby a substantial fraction of other type of RCs.[7, 9]\nWhen growing films on STO (001) surfaces, growth mode and rate often change in accordance with the terminations and/or RCs of the substrate surfaces. These growth behaviors\nhave been used to obtain nanometer-sized patterned structures, such as arrangement of\nmolecules,[10] oxide nanowires,[4] and catalytic metal nanoparticles,[11] and control their\nelectrical properties. Such self-organized nanostructures show great potential as an alternative, cost-effective, bottom-up approach, but existing microscopic investigations of their\nphysical/chemical growth mechanisms are inadequate.\nIn this paper, we report scanning tunneling microscopy (STM) observation on the growth\nbehavior of STO and SrVO3 (SVO) films on STO (001) surfaces, on which (2×1) and\nc(6×2)[9, 12] RCs coexist. In contrast to (2×1) RC, we found that the epitaxial growth of\nboth types of film was prohibited on c(6×2) RC. Close STM examination on atomic networks\nof c(6×2) RC revealed that the perovskite phase was not allowed from the nucleation stage.\nExperiments were carried out with an STM system (base pressure < 2×10−10 Torr)\ncombined with a pulsed-laser deposition chamber (base pressure < 2×10−9 Torr). We used\nNb(0.1%)-doped STO (001) single crystals (CrysTec-GmbH) as substrates. After a NH4 F\nbuffered HF treatment, followed by thermal annealing at P O2 = 1×10−2 Torr and a substrate\ntemperature (T sub ) of 900◦ C for about 30 min, in-situ STM and reflection of high energy\nelectron diffraction (RHEED) on the surfaces showed well organized (2×1) RC terraces\nseparated by STO steps of one unit cell (uc) (0.3905 nm) in height.[6] To obtain the c(6×2)\nRC, we annealed the substrates at T sub = 950◦C. In order to deposit STO and SVO films,\na STO single crystal and a sintered polycrystalline Sr2 V2 O7 target were ablated at P O2\n= 1×10−4 Torr and T sub = 600−700◦C using a KrF excimer laser (λ = 248 nm) with a\n2\n\n\frepetition rate of 1 Hz and an energy density of ∼ 3 J/cm2 on the target surfaces.\nFigure 1 (a) shows the STO (001) substrate surface annealed at P O2 = 1×10−2 Torr and\nT sub = 950◦C for 60 min. The surface exhibits atomically flat terraces. However, the profile\nalong line A, shown in Fig. 1 (c), reveals some regions half a uc (∼ 0.2 nm) higher/lower\nthan normal terraces of the STO (001). The portion of such regions increased with the\nlonger annealing time.\nFigure 1(b) is the atomic resolution STM image of such a region. It clearly shows the\nstripe patterns running along [100] with the protruding zigzag atomic networks. As shown\nin Figure 1(d), the profile perpendicular to the stripe patterns (line B) revealed large hillvalley structures. Note that the corrugation of ∼ 0.1 nm is larger than the nominal atomic\ncorrugations by the factor of ∼ 10, and the stripe patterns clearly showed a periodicity\nof 1.2 nm which is three times larger than the STO lattice constant. We also confirmed\nthis periodicity by two additional spots[13] between the 0th and 1st diffraction peaks in the\nRHEED pattern, as shown in the inset of Fig. 1(b). Such structures have been identified as\nthe c(6×2) RC of the STO (001),[9, 12] as the uc is denoted by the rectangular box in Fig.\n1(b).\nSince STM has been known to image mostly Ti atoms for STO surfaces,[14] the characteristic features of the c(6×2) RCs observed in this study seem to originate from the\narrangement of Ti atoms. In addition, a model study on the STO c(6×2) RC predicted that\nthe incorporations of Ti atoms with different valences in the near-surface TiOx phases can\nresult in zig-zag ordering of truncated Ti octahedras at the center of a stripe and considerable vertical corrugations of the stripe patterns.[12] Our observations are consistent with\nthose earlier works.\nFigure 1(e) shows the power spectrum of the fast Fourier transform (FFT) of Fig. 1 (b).\nThe (1 0) and (1/6 1/2) spots represent the (1×1) and c(6×2) surface structures, respectively.\nOf greater interest is the existence of substructures, indicated by the black mesh in Fig. 1\n(b). This corresponds to the strong (1/2 1/2) spots in Fig. 1 (d), representing c(2×2)\nstructure.\nTo investigate the growth behavior of the perovskite oxides on this surface of mixed RCs,\nwe deposited a series of STO films, as shown in Figs. 2(a) and (b). Nominal growths followed the layer-by-layer mode. However, we observed disordered structures in some regions,\ndenoted by the black arrows in both images. A magnified STM view (inset of Fig. 2(b))of\n3\n\n\fsuch a region revealed only the nano-sized grains created by random aggregation of particlelike structures with sizes less than 1 nm. One may infer that those regions were created\nfrom the deposition of STO on the c(6×2) RC by assuming the preservation of the c(6×2)\nRC portions on the substrate during growth.\nFigure 2 (d) displays the profile along line A in Fig. 2 (b). Aside from the irregular\nstructures, some areas inside the c(6×2) RC region exhibit STM heights even lower than\nthat of the substrate surface, as indicated by the red arrows. Since the STM height strongly\ndepends on the electronic density of the local position, the observation of such unphysical\nheights implies that such regions should have different electronic properties from those of\nthe perovskite STO islands.\nTo understand the microscopic origin of those abnormal growth behaviors, we examined\nhow the island nucleates during the very initial growth stage, realized by extremely small\namount of STO influx. We deposited STO by laser ablating the STO target with only three\npulses. Figures 2 (c) and (e) show the resulting surface and the height profile, respectively,\nalong the line B. As indicated by the arrows, we observed nucleation of the STO islands,\nwith the well-known 1 uc height of ∼ 0.39 nm, in the (2×1) region. In the c(6×2) region,\nhowever, we could find no such island formation but defective structures of the type shown\nin Fig. 2 (c). This observation clearly indicates that the island growth was prohibited in\nthe c(6×2) RC region of STO substrate from the nucleation process.\nTo investigate the role of surface RCs in heteroepitaxial growth, we performed similar\nexperiments on a SVO thin film. Figures 3(a) and (b) show STM images of 0.7 and 1.2 ML\nSVO films, respectively. The existence of islands with uniform 1-uc heights indicates the\nlayer-by-layer epitaxial growth of the SVO film. In contrast, disordered structures in the\nregions around the steps can be seen in both images. The inset of Fig. 3 (b) is a magnified\nview of such a region. The underlying stripes along the [100] direction verify that these\nregions correspond to c(6×2) RCs. The SVO films also formed disordered phases on the\nc(6×2) RCs of the STO (001) surface, as STO did on similar substrate surfaces.\nWhen c(6×2) RC and a (001) oriented perovskite film form an interface, free-standing\nstructures of both sides cannot be preserved due to the large lattice mismatch arising from\nboth incommensurate substructure and large vertical deformation of the c(6×2) RC. Instead,\ngrowth could occur with unexpected film orientations: for example, when CdTe film is\ngrown on the STO, the c(6×2) RC permits the growth of (211) oriented films with the low\n4\n\n\fcrystallinity, whereas the substrate of no RC allows the (111) oriented films.[15] However,\nthis does not fully explain the growth behaviors of STO and SVO films in our cases, since no\ncrystalline phase with preferred orientation seemed to grow on the c(6×2) RCs, as observed\nin the STM images.\nNear-surface stoichiometry of c(6×2) RC could also play an important role of prohibiting\nthe formation of perovskite films by inducing the electrical dissimilarity at the interface.\nUnder harsh preparatory conditions, such as prolonged sputtering and/or high-temperature\nannealing, it is known that numerous titanium oxide (TiOx ) phases and/or nanostructures\ncan be formed on STO (001) surfaces.[10, 16] Therefore, it is quite plausible that the surface\nlayer stoichiometry of the c(6×2) RC could be extremely different from that of the ideal\nSTO (001) termination.[12] Additionally, it is known that the c(6×2) RC is quite chemically\nstable in both O2 and the air in spite of structural complexities.[9] Free-standing (001)\nSTO or SVO surfaces have surface electronic neutrality with uc periodicity. However, the\narrangement of the Ti atoms with different valences (see Fig. 1 (b) and description in the\ntext) in the c(6×2) RC would result in an electrical polarity modulation with a very short\nperiodicity at the interface. This charge modulation could also produce a significant increase\nin the interface energy.\nTherefore, the growth of the perovskite film on c(6×2) RC, even for that with a low textured orientation, would require large excessive structural deformation and/or stoichiometry\nchanges in the interfacial region.\nWe demonstrated the significant influence of surface RCs on the initial growth of perovskite epitaxial thin films by using the STO (001) substrate, whose surface were composed of\ntwo RCs, (2×1), c(6×2). The STM observations revealed that the structural/stoichiometric\ndissimilarity between the c(6×2) RCs and the perovskite structure primarily contribute to\nthe selective growth of perovskite films only on (2×1)RC regions of such substrate. These\nobservations suggest the possibility of applying mixed RC surfaces to the field of oxide\nheterostructure engineering.\nThe authors are grateful to M. R. Castell for valuable discussions. This research was\nsupported by the Basic Science Research Program through the National Research Foundation of Korea (NRF) funded by the Ministry of Education, Science and Technology (No.\n5\n\n\f2009-0080567)\n\n[1] A. Ohtomo and H. Y. Hwang, Nature, 427, 423 (2004).\n[2] A. Brinkman, M. Huijben, M. van Zalk, J. Huijben, U. Zeitler, J. C. Maan, W. G. van der\nWiel, G. Rijnders, D. H. A. Blank, and H. Hilgenkamp, Nature Mater., 6, 493 (2007).\n[3] Y. J. Chang, C. H. Kim, S. H. Phark, Y. S. Kim, J. Yu, and T. W. Noh, Phys. Rev. Lett.,\n103, 057201 (2009).\n[4] E. Vasco, S. Karthauser, R. Dittmann, J. Q. He, C. L. Jia, K. Szot, and R. Waser, Adv.\nMater., 17, 281 (2005).\n[5] Y. J. Chang, A. Bostwick, Y. S. Kim, K. Horn, and E. Rotenberg, Phys. Rev. B, 81, 235109\n(2010).\n[6] M. Kawasaki, K. Takahashi, T. Maeda, R. Tsuchiya, M. Shinohara, O. Ishiyama, T. Yonezawa,\nM. Yoshimoto, and H. Koinuma, Science, 266, 1540 (1994).\n[7] M. R. Castell, Surf. Sci., 505, 1 (2002).\n[8] N. Erdman, K. R. Poeppelmeier, M. Asta, O. Warschkow, D. E. Ellis, and L. D. Marks,\nNature, 419, 55 (2002).\n[9] Q. Jiang and J. Zegenhagen, Surf. Sci., 425, 343 (1999).\n[10] D. S. Deak, F. Silly, K. Porfyrakis, and M. R. Castell, J. Am. Chem. Soc., 128, 13976 (2006).\n[11] F. Silly and M. R. Castell, Phys. Rev. Lett., 94, 046103 (2005).\n[12] C. H. Lanier, A. van de Walle, N. Erdman, E. Landree, O. Warschkow, A. Kazimirov, K. R.\nPoeppelmeier, J. Zegenhagen, M. Asta, and L. D. Marks, Phys. Rev. B, 76, 045421 (2007).\n[13] G. Koster, G. Rijnders, D. H. A. Blank, and H. Rogalla, Physica C, 339, 215 (2000).\n[14] K. Johnston, M. R. Castell, A. T. Paxton, and M. W. Finnis, Phys. Rev. B, 70, 085415\n(2007).\n[15] S. Neretina, R. A. Hughes, G. A. Devenyi, N. V. Sochinskii, J. S. Preston, and P. Mascher,\nAppl. Surf. Sci., 255, 5674 (2009).\n[16] F. Silly and M. R. Castell, Appl. Phys. Lett., 85, 3223 (2004).\n\n6\n\n\f[010]\n\n(a)\n\n(c) (nm)\n0.6\n\n[100]\n\nA\n\n0.4\n0.2\n0.0\n0\n\n(d) (nm)\n\n50\n\n100\n\n(nm)\n\n150\n\n1.2 nm\n\nB\n\n0.10\n\nA\n\n0.05\n\n60nm\n\n0.1 nm\n\n0.00\n0\n\n(b)\n\nB\n\n[010]\n\n[100]\n\n(e)\n(0 1)\n\n1\n\n2\n\n3\n\n(1/2 1/2)\n\n4 (nm)\n\n(1 0)\n\n(1/2 1/6)\n\n3 nm\n\nFIG. 1. (Color online) (a) and (c) show an STM image of the substrate and the profile along line\nA, respectively. The red solid (dotted) line denotes the vertical positions of surface terminations\nwith uc (half-uc) heights. (b) and (e) show an STM image and its FFT power spectrum taken from\nthe region denoted by the blue arrows in (a). The inset of (b) displays RHEED patterns taken\nfrom the substrate on which such regions covered more than 50 % of the surface. (d) shows the\nprofile along line B. (V S = 2.5 V and I set = 50 pA)\n\n7\n\n\f(a)\n\n0.7 ML\n\n(c)\n\n3 pulses\n\nc(6x2)\n\nB\n\n[010]\n\n100nm\n\n[010]\n\n[100]\n\n(b)\n\n2.5 ML\n\n(d)(nm)\n2.4\n1.8\n1.2\n0.6\n0.0\n\nA\n\n[100]\n\n(2x1)\n\n3rd\n2nd\n1st\n\n3rd\n2nd\n1st\n\nA\n0\n\n50 100 150 200 (nm)\n\n(e) (nm)\n100nm\n\n[010]\n\n0.6\n0.4\n0.2\n0.0\n\n[100]\n\n0.4 nm\n\nB\n0\n\n5\n\n10\n\n15\n\n20 (nm)\n\nFIG. 2. (Color online) (a) and (b) show STM images of 0.7 and 2.5 ML STO films. (c) is an\nSTM image of the STO (001) surface obtained by applying three laser pulses to the STO target at\nP O2 = 1 × 10−4 Torr and T sub = 600 ◦ C. (d) and (e) show the profiles along lines A and B. Red\nsolid(dotted) lines indicate the surface terminations of the substrate with uc (half-uc) heights, and\nblue lines show the heights of deposited STO layers. The sky-blue thick line denotes the substrate\nsurface. (V S = 2.5 V and I set = 50 pA)\n\n8\n\n\f(a)\n\n(b)\n\n0.7 ML\n\n1.2 ML\n2nd\n\nSTO\n\nep\n\nst\n\n1st\n\n1st\n\n1st\nSTO\n\nep\n\n24nm\n\nst\n\n[010]\n\n2nd\n\n[100]\n\n24nm\n1st\n\nFIG. 3. (Color online) STM images of (a) 0.7 ML and (b) 1.2 ML SVO films. 'STO' denotes\nthe surface of the substrate. '1st' and '2nd' indicate the first and second layers of the SVO film,\nrespectively. The inset of (b) is a magnified view of the region of disordered growth. (V S = 2.5 V\nand I set = 50 pA)\n\n9\n\n\f"}