{"id": "http://arxiv.org/abs/0911.5232v1", "guidislink": true, "updated": "2009-11-27T10:15:29Z", "updated_parsed": [2009, 11, 27, 10, 15, 29, 4, 331, 0], "published": "2009-11-27T10:15:29Z", "published_parsed": [2009, 11, 27, 10, 15, 29, 4, 331, 0], "title": "Interface free energy or surface tension: definition and basic\n  properties", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0911.1691%2C0911.1081%2C0911.0774%2C0911.4462%2C0911.3201%2C0911.0656%2C0911.0067%2C0911.0624%2C0911.1687%2C0911.4605%2C0911.4243%2C0911.5203%2C0911.4986%2C0911.1939%2C0911.3348%2C0911.0868%2C0911.2065%2C0911.0631%2C0911.0294%2C0911.4726%2C0911.1548%2C0911.4922%2C0911.4034%2C0911.1186%2C0911.3459%2C0911.1516%2C0911.1071%2C0911.0265%2C0911.3197%2C0911.5424%2C0911.3159%2C0911.3842%2C0911.5716%2C0911.5685%2C0911.4033%2C0911.5070%2C0911.5063%2C0911.4707%2C0911.2802%2C0911.0947%2C0911.5054%2C0911.1159%2C0911.3093%2C0911.1248%2C0911.0307%2C0911.0137%2C0911.3676%2C0911.1936%2C0911.3677%2C0911.0667%2C0911.0734%2C0911.5522%2C0911.0215%2C0911.5033%2C0911.4351%2C0911.5381%2C0911.4463%2C0911.2893%2C0911.2026%2C0911.2211%2C0911.0316%2C0911.5045%2C0911.3663%2C0911.0704%2C0911.1103%2C0911.5529%2C0911.5263%2C0911.2025%2C0911.3215%2C0911.2050%2C0911.0576%2C0911.4364%2C0911.4371%2C0911.2874%2C0911.5227%2C0911.2937%2C0911.0978%2C0911.1968%2C0911.4794%2C0911.5637%2C0911.0586%2C0911.5621%2C0911.0414%2C0911.4680%2C0911.3539%2C0911.4185%2C0911.1954%2C0911.1725%2C0911.1924%2C0911.5660%2C0911.1778%2C0911.2189%2C0911.5487%2C0911.5232%2C0911.2163%2C0911.3427%2C0911.3823%2C0911.2239%2C0911.5590%2C0911.0488%2C0911.4554&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Interface free energy or surface tension: definition and basic\n  properties"}, "summary": "Interface free energy is the contribution to the free energy of a system due\nto the presence of an interface separating two coexisting phases at\nequilibrium. It is also called surface tension. The content of the paper is 1)\nthe definition of the interface free energy from first principles of\nstatistical mechanics; 2) a detailed exposition of its basic properties. We\nconsider lattice models with short range interactions, like the Ising model. A\nnice feature of lattice models is that the interface free energy is anisotropic\nso that some results are pertinent to the case of a crystal in equilibrium with\nits vapor. The results of section 2 hold in full generality.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0911.1691%2C0911.1081%2C0911.0774%2C0911.4462%2C0911.3201%2C0911.0656%2C0911.0067%2C0911.0624%2C0911.1687%2C0911.4605%2C0911.4243%2C0911.5203%2C0911.4986%2C0911.1939%2C0911.3348%2C0911.0868%2C0911.2065%2C0911.0631%2C0911.0294%2C0911.4726%2C0911.1548%2C0911.4922%2C0911.4034%2C0911.1186%2C0911.3459%2C0911.1516%2C0911.1071%2C0911.0265%2C0911.3197%2C0911.5424%2C0911.3159%2C0911.3842%2C0911.5716%2C0911.5685%2C0911.4033%2C0911.5070%2C0911.5063%2C0911.4707%2C0911.2802%2C0911.0947%2C0911.5054%2C0911.1159%2C0911.3093%2C0911.1248%2C0911.0307%2C0911.0137%2C0911.3676%2C0911.1936%2C0911.3677%2C0911.0667%2C0911.0734%2C0911.5522%2C0911.0215%2C0911.5033%2C0911.4351%2C0911.5381%2C0911.4463%2C0911.2893%2C0911.2026%2C0911.2211%2C0911.0316%2C0911.5045%2C0911.3663%2C0911.0704%2C0911.1103%2C0911.5529%2C0911.5263%2C0911.2025%2C0911.3215%2C0911.2050%2C0911.0576%2C0911.4364%2C0911.4371%2C0911.2874%2C0911.5227%2C0911.2937%2C0911.0978%2C0911.1968%2C0911.4794%2C0911.5637%2C0911.0586%2C0911.5621%2C0911.0414%2C0911.4680%2C0911.3539%2C0911.4185%2C0911.1954%2C0911.1725%2C0911.1924%2C0911.5660%2C0911.1778%2C0911.2189%2C0911.5487%2C0911.5232%2C0911.2163%2C0911.3427%2C0911.3823%2C0911.2239%2C0911.5590%2C0911.0488%2C0911.4554&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Interface free energy is the contribution to the free energy of a system due\nto the presence of an interface separating two coexisting phases at\nequilibrium. It is also called surface tension. The content of the paper is 1)\nthe definition of the interface free energy from first principles of\nstatistical mechanics; 2) a detailed exposition of its basic properties. We\nconsider lattice models with short range interactions, like the Ising model. A\nnice feature of lattice models is that the interface free energy is anisotropic\nso that some results are pertinent to the case of a crystal in equilibrium with\nits vapor. The results of section 2 hold in full generality."}, "authors": ["C. -E. Pfister"], "author_detail": {"name": "C. -E. Pfister"}, "author": "C. -E. Pfister", "arxiv_comment": "20 pages, 2 figures", "links": [{"href": "http://arxiv.org/abs/0911.5232v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0911.5232v1", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "cond-mat.stat-mech", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cond-mat.stat-mech", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0911.5232v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0911.5232v1", "journal_reference": null, "doi": null, "fulltext": "arXiv:0911.5232v1 [cond-mat.stat-mech] 27 Nov 2009\n\nInterface Free Energy or Surface Tension:\ndefinition and basic properties\nC.-E. Pfister\nEPF-L, Institut d'analyse et calcul scientifique\nBâtiment MA, Station 8\nCH-1015 Lausanne, Switzerland\ne-mail: charles.pfister@epfl.ch\nNovember 2009\nAbstract\nInterface free energy is the contribution to the free energy of a system due\nto the presence of an interface separating two coexisting phases at equilibrium. It\nis also called interfacial free energy or surface tension. The content of the paper is\n1) the definition of the interface free energy from first principles of statistical mechanics;\n2) a detailed exposition of its basic properties.\nWe consider lattice models with short range interactions, like the Ising model. A\nnice feature of lattice models is that the interface free energy is anisotropic so that\nsome results are pertinent to the case of a crystal in equilibrium with its vapor.\nThe results of section 2 hold in full generality.\n\n1\n1.1\n\nInterface free energy in Statistical mechanical\nDefinition of the interface free energy\n\nConsider a physical system at equilibrium in a vessel V , at a first order phase transition\npoint, where two bulk phases, say A and B, coexist (for example, an Ising model at zero\nmagnetic field and low temperature). If, when we bring into contact the phases A and\nB, the state of the system is inhomogeneous and there is spatial separation of the two\nphases, then at the common boundary of the two phases emerges a spatially localized\nstructure, called the interface. In spite of the low dimensionality of these interfaces and\ntheir negligible contribution towards the global overall properties of the physical system\ntheir presence is essential for a wealth of important processes in physics, chemistry and\nbiology. Here we consider only systems at equilibrium, which is a rather severe restriction.\nThe interface free energy is a thermodynamical quantity and it is best explained\nwhen we consider the macroscopic scale, in which the length of the vessel containing\n1\n\n\f2\nthe system is the reference length. Under this scale the interface is well-defined and\nlocalized. In the case of a flat interface perpendicular to a unit vector n it is described\nmathematically by a plane perpendicular to n, which separates the bulk phases, and\nthe state of the system is specified above this plane by giving the value of the orderparameter of one of the bulk phases, say A, and below the interface that of the other\nbulk phase. The interface free energy or surface tension (per unit area) τ (n) describes the\nthermodynamical properties of the interface at equilibrium. How does one obtain τ (n)\nonce the interatomic interactions of the system are given? We can answer this question\nso that we get interesting information about τ (n) only for few models. However, the way\nof defining τ (n) is quite general and can be applied in principle to most systems, and its\norigin can be traced back to the monumental work of J.W. Gibbs, On the Equilibrium\nof Heterogeneous Substances (1875-1878). In statistical mechanics the thermodynamical\nfunctions are obtained by computing the partition function. The system is enclosed in\na vessel V ; taking into account the interations of the system with the walls of V we\ncan write an expression for the overall free energy of the system. The basic postulate is\nthat we can separate the various contributions to the overall free energy F (V ) at inverse\ntemperature β into two parts, up to a small correction term; one part is proportional\nto the volume of V , which is the bulk free energy of the system, and another one is\nproportional to the area of the surface of V , which is interpreted as the wall free energy.\nThus, at a point of first order phase transition, when only phase A is present,\n1\nFA (V ) = − ln ZA (V ) = fbulk (A)|V | + fwall (A)|∂V | + o(|∂V |) ,\nβ\n\n(1.1)\n\nwhere ZA (V ) denotes the partition function of the system for phase A, |V | the volume\nof V and |∂V | the area of the boundary ∂V of the vessel. A similar expression holds\nfor phase B. The bulk terms fbulk (A) and fbulk (B) are the same because the system\nis at a first order phase transition point, but the surface terms fwall (A) and fwall (B)\nmay be different. Under specific conditions on the walls, we can obtain (macroscopic)\ninhomogeneous states with planar interfaces separating the two coexisting bulk phases.\nIn such cases there is an additional contribution to the overall free energy and we postulate\nthat the free energy can be written as\n1\nFAB (V ) = − ln ZAB (V ) = fbulk (AB)|V | + fwall (AB)|∂V | + τ (n)|I(n)| + o(|∂V |) , (1.2)\nβ\nwith\nfwall (AB) = αfwall (A) + (1 − α)fwall (B) .\nThe term |I(n)| = O(|∂V |) is the area of the interface perpendicular to the unit vector\nn, and α is the proportion of the walls in contact with phase A. Since the system is\nat a first order transition point fbulk (AB) = fbulk (A) = fbulk (B). Extracting wall free\nenergies is not easy, but it is not necessary to do this if our postulate is correct, because\nwe can eliminate the terms involving fwall (AB) and fwall (AB) by considering the ratio of\npartition functions,\n−\n\n1\nZAB (V )\nln\n= τ (n)|I(n)| + o(|∂V |) .\nβ ZA (V )α ZB (V )1−α\n\nNotice that (1.3) is always a term of order O(|∂V |).\n\n(1.3)\n\n\f3\nAn obvious difficulty in getting τ (n) is that we must know the values of thermodynamical parameters of the system for which there is phase coexistence. Indeed, for other\nvalues of these parameters the system has only one bulk phase and there is no interface.\nHence the surface tension is non-zero only for a specific range of values of the thermodynamical parameters of the system. This is why in many situations one proceeds differently\nin Physics. One models directly the interface in order to bypass these problems and then\nthe interface free energy is simply identified with the free energy of the model for which\none has standard methods for evaluating it. This is often an adequate way to proceed,\nbut it cannot be applied always. For example when one is studying how the coexisting\nphases are spatially distributed inside the vessel V , we cannot avoid considering the free\nenergy of interfaces between coexisting phases.\n\n1.2\n\nA paradigm, the Ising model\n\nWe implement the ideas of section 1.1 for the Ising model, for which the mathematical\nresults are the most complete. We consider the three-dimensional Ising model. The\ntwo-dimensional case is also of interest. Let Z3 := {t = (t1 , t2 , t3 ) : ti ∈ Z} and\nΛLM := {t ∈ Z3 : max(|t1 |, |t2 |) ≤ L , |t3 | ≤ M} .\nFor each t ∈ ΛLM , we introduce a variable σ(t), called hereafter spin, which specifies the\nstate of the system at t; there are only two possible states labeled by 1 and −1, hence\nσ(t) = ±1. The configurations of the system are written σ and are specified by giving\nfor each site t the value of σ(t). The spin σ(t) interacts with an external real magnetic\nfield h, the interaction energy being −h σ(t), and it interacts with the spin σ(t′ ), the\ninteraction energy being −J(t, t′ ) σ(t)σ(t′ ). The energy of the system is equal to\nHLM (σ) = −\n\n1 X\n2 t∈Λ\n\nLM\n\nX\n\nJ(t, t′ ) σ(t)σ(t′ ) −\n\nX\n\nh σ(t) .\n\nt∈ΛLM\n\nt′ ∈ΛLM\n\nWe choose the coupling constants J(t, t′ ) = 0, except if t, t′ are nearest neighbors, in\nwhich case J(t, t′ ) = J > 0, a fixed value. This interaction favors the alignment of spins,\nsince the energy is minimal when σ(t) = σ(t′ ). To model the interaction of the system\nwith the walls, we introduce an inhomogeneous magnetic field J ′ η(t) acting only on the\nspins located at the boundary of the box ΛL,M ,\nX\nη\nWLM\n(σ) := −\nJ ′ η(t)σ(t) ,\nt∈ΛLM : |t3 |=M\nor max(|t1 |, |t2 |) = L\n\nwith J ′ > 0 and η(t) = 1 or η(t) = −1, but fixed. Different kind of walls are modeled by\nspecifying different values for η(t) (see below) and choosing different values for J ′ . The\nη\noverall energy of the system is HLM + WLM\n.\nAccording to statistical mechanics, the state of the system at equilibrium and at\ninverse temperature β is the Gibbs measure, so that\nη\n\ne−β(HLM (σ)+WLM (σ))\nProb(σ) =\nη\nZLM\n\nη\nwhere ZLM\n=\n\nX\nσ′\n\n′\n\nη\n\n′\n\ne−β(HLM (σ )+WLM (σ )) .\n\n\f4\nη\nThe normalization constant ZLM\nis the partition function and the overall free energy of\nthe system in the box ΛLM is\n1\nη\nη\n.\nFLM\n(β, h, J ′) := − ln ZLM\nβ\n\nAt the thermodynamical limit (infinite-volume limit), the bulk free energy per spin\nis independent on the choice of J ′ > 0 and of η,\n1\nη\nfbulk (β, h) = lim\nFLL\n(β, h, J ′ ) .\nd\nL→∞ (2L + 1)\nThe model exhibits a first order phase transition with the magnetization as order-parameter\nif the external magnetic field h = 0 and the inverse temperature β > βc (d), where βc (d)\nis the inverse critical temperature of the d-dimensional Ising model (0 < βc (3) < βc (2)).\nFor h = 0 and β > βc (d) the spin-flip symmetry of HLM is broken. There is a phase\nwith positive magnetization m∗ (β) and another with negative magnetization −m∗ (β);\nthe bulk free energy fbulk (β, h) is not differentiable at h = 0,\nd\nd\nfbulk (β, h)|h=0+ = − fbulk (β, h)|h=0− .\ndh\ndh\nIf we choose η(t) ≡ +1, respectively η(t) ≡ −1, that is pure boundary conditions, then\none can prove that for any value of J ′ > 0 the interactions with the walls favor the bulk\nphase with positive, respectively negative, magnetization. We are also interested in the\ncase of mixed boundary conditions, which is related to the emergence of a planar interface\nperpendicular to n. Let n = (n1 , n2 , n3 ). We set\n(\n+1 if t1 n1 + t2 n2 + t3 n3 ≥ 0,\nη n (t) :=\n−1 if t1 n1 + t2 n2 + t3 n3 < 0.\n0 < m∗ (β) =\n\nThus η n (t) = 1 iff t is above or in the plane π(n) perpendicular to n and passing through\nηn\nn\n.\nthe origin, otherwise η n (t) = −1. We set ZLM\n:= ZLM\n+++++++++++++++++\n+\n+\n+✑✑\n+\nπ(n)\n✑\n+\n✑✑ +\n✑\n✑\n+\n✑\n+\n✑\n✑\n+\n❪❏✑✑\nn❏\n+\n✑\n✑\n+\n✑\n✑\n+\n✑\n+\n✑\n+ ✑✑\n✑\n+\n✑\n✑✑\n- - - - - - - - - - - - - - - - The field J ′ η n acting on the boundary spins of ΛL,L .\n\n\f5\n1.2.1\n\nMacroscopic limit and definition of τ in the Ising model\n\nWe suppose that the external magnetic field h = 0 and β > βc (d), d = 2, 3. We choose\n0 < a < 1 and we partition the set ΛLL into cubic cells Ci of linear size La ; for each cell\nCi we introduce the empirical magnetization (averaged magnetization over the cell Ci )\nX\nmCi (σ) := |Ci |−1\nσ(t) .\nt∈Ci\n\nWe scale all lengths by L−1 , so that the distance between neighboring spins is L−1 .\nIn the fixed reference macroscopic box V = {(x1 , x2 , x3 ) ∈ Rd : |xi | ≤ 1} we make a\ncoarse-grained description of the state of the system by specifying the coarse-grained\nmagnetization profile,\nρL (x|σ) := mC (σ) if (Lx1 , Lx2 , Lx3 ) ∈ Ci , ∀ (x1 , x2 , x3 ) ∈ V .\nBy definition the probability of the profile ρL (x|σ) is the joint probability of the blockspins mCi (σ) induced by the Gibbs measure. The macroscopic limit is the limit when\nL−1 tends to 0. If we choose η ≡ +1, when L−1 tends to 0, then for any value of\nJ ′ > 0 the probability measure on the density profiles becomes concentrated on the unique\nmagnetization profile ρ(x) ≡ m∗ (β); this constant profile describes the macroscopic state\nof the +-phase of the model. The macroscopic limit corresponds to the regime of the law\nof large numbers in probability theory.\n+\n−\nTo obtain τ (n) we use (1.3) and the fact that by symmetry of the model ZLL\n= ZLL\n,\n+\nn\nso that we only need to compare ZLL\nand ZLL\n. We set\n\nτ (n) := −\n\n1\n1\nZn\nlim d−1 ln LL\n+ .\nβ|π(n) ∩ V | L→∞ L\nZLL\n\n(1.4)\n\nThe term |π(n) ∩ V | is the area of the intersection of the plane π(n) with V . One can\nprove: the limit (1.4) is independent on J ′ ≥ J, and for β > βc (d) the function τ (n)\nverifies properties a), b) and c) of (2.7); in the macroscopic limit the measure on the\ndensity profiles is concentrated on the unique magnetization profile\n(\n+m∗ (β) if x is above π(n)\nρn (x) :=\n−m∗ (β) if x is below π(n).\nThis profile describes a macroscopic state with a planar interface perpendicular to n.\nTherefore τ (n) can be interpreted as the free energy of that interface perpendicular to n.\nThe condition J ′ ≥ J is important, because for some values of J ′ < J and β the\nphysics near the walls of the system is different: a surface phase transition may take\nplace and portions of the interface may be pinned to the walls. As a consequence of this\nphenomenon in the macroscopic limit the interaction of the system with the walls given by\nη n may not induce an interface perpendicular to n. For example, in the two-dimensional\ncase, the macroscopic state may have an interface making an angle with the vertical walls\nof the vessel, whose value is given by the Young-Herring equation, so that (1.4) may not\nbe equal to τ (n), or, if J ′ is small enough and the macroscopic box is a square, then the\nwhole interface may even be pinned to the walls, so that there is no interface through the\n\n\f6\nmacroscopic box. In such cases the limit (1.4) depends on J ′ . The condition J ′ ≥ J has a\nsimple physical interpretation; it ensures that the walls of the box V are in the complete\nwetting regime, so that the interface cannot be pinned to the walls. In the literature\nthe standard choice for ferromagnetic models is J ′ = J, so that (1.4) gives the correct\ndefinition of τ (n). These results illustrate the fact that it is important to choose correctly\nthe interactions of the system with the walls in order to use definition (1.3). One must\navoid the possibility of pinning of the interface to the walls. Any wall interactions which\ninduce a macroscopic state with an interface perpendicular to n and such that otherwise\n(1.3) is independent of the chosen interactions are admissible for defining the interface\nfree energy.\nSeveral other definitions for τ (n) have been proposed for the Ising or similar models.\nMost of them involve a ratio of partition functions and are based on the same pattern\nleading to (1.4) so that we shall not review them here (see section 3 for references). A\npossibility of avoiding the above problem with the walls is to suppress (partially) the\nwalls of the system by taking (partial) periodic boundary conditions. Then one imposes\na condition implying the existence of a single planar interface perpendicular to n. There\nare also variants of (1.4) where one considers a box ΛLM instead of ΛLL and take first\nthe limit M → ∞ before taking L → ∞. When J ′ < J this limit may give a different\nanswer as the limit (1.4). On the other hand, if J ′ ≥ J, then one can take the limits\nin any order, first L → ∞ and then M → ∞ or vice-versa, or simultaneously L → ∞\nand M → ∞. The reason is that the walls are in the complete wetting regime and the\ninterface is not pinned to the walls. In general it is not easy to show that reasonable\ndefinitions give the same value for τ (n).\nThe surface tension for the two-dimensional Ising model can be computed exactly.\nOnsager computed the interface free energy for n = (0, 1),\nβτ ((0, 1)) = 2(K − K ∗ ) , β > βc (2) and τ ((0, 1)) = 0 , otherwise,\nwhere K ∗ is defined by exp(−2K ∗ ) = tanh K and K = βJ. Onsager did not use the\ndefinition (1.4); the computation of τ ((0, 1)) defined by (1.4) is due to Abraham and\nMartin-Löf. The full interface free energy has been computed by McCoy and Wu.\n1.2.2\n\nInequalities for τ in the Ising model\n\nWe set in this subsection\nn(θ) := (0, − sin θ, cos θ) and τ (θ) := τ (n(θ)) .\nThere are two inequalities which relate the interface free energy and the order-parameter,\n\nand\n\nτ (0) ≤ 2(m∗ (β))2 ,\n\n(1.5)\n\nd(βτ (0))\n≥ 2(m∗ (β))2 .\ndβ\n\n(1.6)\n\nThese inequalities indicate that τ (0) > 0 iff there is a phase transition. Since τ (0) is a\nminimal value, we have τ (n) > 0 iff h = 0 and β > βc (d).\n\n\f7\nWe now introduce the step free energy τstep . This quantity is interesting only for\nd = 3. Let η ∗ (t) be defined as\n(\n+1 if t3 > 0 or if t3 = 0 and t2 ≥ 0,\nη ∗ (t) :=\n−1 if t3 < 0 or if t3 = 0 and t2 < 0.\nBy definition, if d = 3,\n∗\n\nτstep\n\n1\nZη\n1\nln LL\n:= − lim\nn∗\nβ L→∞ 2L + 1 ZLL\n\nwith n∗ = (0, 0, 1) .\n\nOne has τstep ≥ 0 and we state two important inequalities. The first inequality\nτ (θ) − τ (0) ≥ | sin θ|τstep\n\n(1.7)\n\ngives information about the non-differentiability of τ at θ = 0. Positivity of τstep implies\nthat τ (θ) is not differentiable at θ = 0 since τ has a minimum at θ = 0 and\nlim\nθ↓0\n\nd\nτ (θ) ≥ τstep .\ndθ\n\nThe physical consequence of the non-differentiability of τ is explained at the end of\nsection 2.2.3; non-differentiability of τ implies the existence of a facet for the equilibrium\nshape Wτ defined in (2.1). The second inequality relates the step free energy of the\nthree-dimensional model to the two-dimensional interface free energy, which we write\nhere τ2 (θ),\nτstep ≥ τ2 (0) .\n(1.8)\nTherefore, if β > βc (2) then τstep > 0.\n\n2\n\nBasic properties of the interface free energy\n\nWe examine in this section what are the basic properties of τ and we discuss the thermodynamical stability of interfaces.\n\n2.1\n\nConvexity of the interface free energy\n\nWe assume that τ (n) > 0 for each unit vector n. We consider the three-dimensional case.\nElements of the Euclidean space E3 are written x = (x1 , x2 , x3 ); we denote the Euclidean\nscalar product by\nh x|y i := x1 y1 + x2 y2 + x3 y3 ,\nand the Euclidean norm by kxk.\nBy convention τ (n), with knk = 1, is the physical value of the interface free energy\nof an interface perpendicular to n. It is convenient to extend the definition of τ to E3 ,\nas a positively homogeneous function, by setting\nτ (x) := kxkτ (x/kxk) .\n\n\f8\nWe introduce the half-space\nH(n) := {x : h x|n i ≤ τ (n)} ,\nwhose boundary is the plane ∂H(n) = {x : h x|n i = τ (n)}. Notice that H(n) = H(tn)\nfor all t > 0. Besides we define the equilibrium shape Wτ as the convex set, which is\nthe intersection of the half-spaces H(n), that is\nWτ := {x : h x|n i ≤ τ (n) , ∀ n} .\n\n(2.1)\n\nThe next argument is due to Herring [H (1951)]; it is reproduced almost in its original\nform. Let T (A0 , A1 , A2 , A3 ) be the tetrahedron with vertices A0 , A1 , A2 , A3 . The face\nopposite to the vertex Ai is denoted by ∆i ; it contains all vertices Aj , j 6= i, and its area\nis |∆i |. Let ni be the outward unit normal to the face ∆i . We have\n|∆0 |n0 + |∆1 |n1 + |∆2 |n2 + |∆3 |n3 = 0 .\nSet\nn := −n0 =\n\n|∆1 |\n|∆2 |\n|∆3 |\nn1 +\nn2 +\nn3 .\n|∆0 |\n|∆0 |\n|∆0 |\n\nWe compare the free energies |∆0 |τ (n) and |∆1 |τ (n1 ) + |∆2 |τ (n2 ) + |∆3 |τ (n3 ), or which\nis the same, τ (n) and\n|∆2 |\n|∆3 |\n|∆1 |\nτ (n1 ) +\nτ (n2 ) +\nτ (n3 ) .\n|∆0 |\n|∆0 |\n|∆0 |\nLet m1 , m2 , m3 be reciprocal vectors to n1 , n2 , n3 , defined by the relations h mi |nj i = 0\nif i 6= j and h mi |ni i = 1 otherwise. We have h mi |ni = |∆i |/|∆0 |, so that\n3\n3\nX\nX\n|∆i |\nτ (ni ) = h\nτ (ni )mi |n i ≡ h y|n i .\n|∆0 |\ni=1\ni=1\n\nP\nThe vector y = 3i=1 τ (ni )mi verifies the identities h y|ni i = τ (ni ), i = 1, 2, 3, i.e. y is\nthe intersection point of the three planes ∂H(n1 ), ∂H(n2 ) and ∂H(n3 ). We have three\ncases.\n(1). If h y|n i < τ (n), then the intersection of the plane ∂H(n) with Wτ is empty, since Wτ\nis a subset of H(n1 )∩H(n2 )∩H(n3 ). A (hypothetical) planar interface perpendicular to n\nwith interface free energy τ (n) can be deformed using the tetrahedron T (A0 , A1 , A2 , A3 )\nby lowering its free energy. Hence, at nonzero temperature such a planar interface with\ninterface free energy τ (n) is unstable and cannot exist at equilibrium since the free energy\nis minimal. Therefore we must have\n|∆0 |τ (n) ≤ |∆1 |τ (n1 ) + |∆2 |τ (n2 ) + |∆3 |τ (n3 ) .\n\n(2.2)\n\n(2). The case h y|n i = τ (n) is a borderline case. Here the intersection of ∂H(n) with\nWτ is at most one point. If ∂H(n) ∩ Wτ = ∅, then one also show that the interface\nis also unstable and cannot exist at equilibrium. If ∂H(n) ∩ Wτ = {y}, then y ∈\nWτ ∩ ∂H(n1 ) ∩ ∂H(n2 ) ∩ ∂H(n3 ) is called a corner of Wτ . In this case ∂H(n) is a\n\n\f9\nsupport plane of Wτ at y, that is Wτ ⊂ H(n) and Wτ ∩ ∂H(n) ∋ y, but it is not a\ntangent plane of Wτ . Notice that if Wτ has no corner, then at equilibrium we only have\nthe next case (3).\n(3). If h y|n i > τ (n), then\n|∆0 |τ (n) < |∆1 |τ (n1 ) + |∆2 |τ (n2 ) + |∆3 |τ (n3 ) .\n\n(2.3)\n\nWe can repeat the same argument with a right prism whose base is a triangle with\nvertices A0 , A1 , A2 and whose length is very large. Let li be the side of the triangle\nopposite to the vertex Ai , |li | be its length, and ni the outward unit normal to the side\nli in the plane of the triangle. Again we have\n|l0 |n0 + |l1 |n1 + |l2 |n2 = 0 ,\nand we set n := −n0 = |l1 |/|l0|n1 + |l2 |/|l0|n2 . In the plane spanned by n1 and n2 let\nm1 and m2 be reciprocal vectors to n1 and n2 . Then\n2\n2\nX\nX\n|li |\nτ (ni ) = h\nτ (ni )mi |n i ≡ h z|ni .\n|l\n|\n0\ni=1\ni=1\n\nP2\nThe vector z =\ni=1 τ (ni )mi belongs to the intersection of the planes ∂H(n1 ) and\n∂H(n2 ). We can draw similar conclusions as above. If h z|ni < τ (n), then the interface\n∂H(n) with interface free energy τ (n) is unstable and does not exist at equilibrium.\nHence, at equilibrium,\n|l0 |τ (n) ≤ |l1 |τ (n1 ) + |l2 |τ (n2 ) .\n(2.4)\nIf h z|ni = τ (n), then either ∂H(n) ∩ Wτ = ∅ or ∂H(n) ∩ Wτ 6= ∅; in the latter case Wτ\nhas an edge or a corner and ∂H(n) is a support plane (but not a tangent plane of Wτ ).\nIf h z|ni > τ (n), then\n|l0 |τ (n) < |l1 |τ (n1 ) + |l2 |τ (n2 ) .\n(2.5)\nSince τ has been defined as a positively homogeneous function, it is immediate to see\nthat (2.4) for all choices of n1 , n2 , l1 and l2 is equivalent to\nτ (x + y) ≤ τ (x) + τ (y) ∀ x, y .\n\n(2.6)\n\nFrom (2.6) one easily gets (2.2) for any tetrahedron. Conversely, if (2.2) is valid for any\ntetrahedron, then we get (2.6) by deforming a tetrahedron into a prism, sending one of\nthe vertex to infinity. The important inequality is (2.6) (or (2.4)).\nTo summarize, for two distinct phases at equilibrium, the interface free energy is a\ncontinuous convex function, which is positive and sublinear, that is\n(a)\n(b)\n(c)\n\nτ (x) > 0 x 6= 0 ,\nτ (tx) = t τ (x) ∀x and all t ≥ 0 ,\nτ (x + y) ≤ τ (x) + τ (y) ∀ x, y.\n\n(2.7)\n\nBy a classical result of Minkowski it is the support function of the convex set Wτ , that is\nτ (x) = sup{h x|y i : y ∈ Wτ } .\n\n(2.8)\n\n\f10\n\nWe say that an interface perpendicular to n is (thermodynamically) stable if\nτ (x + y) < τ (x) + τ (y) ∀ x, y linearly independent, such that x + y = n .\n\n(2.9)\n\nIn that case (2.3) and (2.5) hold. In general the choice of the normal to the interface\ndoes not matter, so that we also have τ (n) = τ (−n). This means that τ (n) defines a\nnorm on E3 .\n\n2.2\n\nInterface free energy and equilibrium shape Wτ\n\nWe suppose that τ is given, verifying properties a), b) and c) of (2.7) (we do not assume\nthat τ (n) = τ (−n)). Under these assumptions Wτ is a convex body, i.e. Wτ ⊂ E3 is a\nbounded, closed convex set with non-empty interior. The point 0 is an interior point of\nWτ , because the continuity of τ implies that τ (n) ≥ a > 0 for all n, knk = 1.\n2.2.1\n\nEquilibrium shape Wτ and its polar dual Wτ∗\n\nA face F of a convex set K ⊂ E3 is a convex subset F ⊂ K, such that\n1\nx , y ∈ K and (x + y) ∈ F\n2\n\nimply x , y ∈ F .\n\nTwo-dimensional faces are called facets of K and one-dimensional faces are called edges\nof K. An extremal point z of K is a face F = {z}. Equivalently, z is an extremal\npoint if it cannot be written as z = λx + (1 − λ)y with x, y ∈ K and λ ∈ (0, 1), except by\ntaking z = x = y. The set of extremal points is denoted by extK. Minkowski's theorem\nstates that a convex body K is equal to the convex hull of its extremal points, that is\n(\n)\nk\nk\nX\nX\nK = x:\nλi xi : λi ≥ 0 ,\nλi = 1 , xi ∈ extK ∀ i , k arbitrary .\ni=1\n\ni=1\n\nRemark. In dimension two we call \"facets\" the one-dimensional faces of K ⊂ E2 .\nTo study the convex set Wτ we introduce its polar dual Wτ∗ . The definition of Wτ∗\nis based on the dual relationship between non-zero vectors v and closed half-spaces v∗\ncontaining the origin,\nv∗ := {x : h v|x i ≤ 1} .\nThe polar dual or polar set Wτ∗ of Wτ is\n\\\nWτ∗ := {x∗ : x ∈ Wτ } = {u : h x|u i ≤ 1 ∀ x ∈ Wτ } .\n\nFrom the definition it is immediate that Wτ∗ is a convex set. It is a closed set, since the\nscalar product is continuous, and 0 is an interior point of Wτ∗ . Hence Wτ∗ is a convex body.\nSince for x ∈ Wτ we have h x|u i ≤ 1 for all u ∈ Wτ∗ , we deduce that Wτ∗∗ ⊃ Wτ . Since\nWτ is a convex body having the origin as an interior point, we also have Wτ = Wτ∗∗ .\n\n\f11\nIndeed, suppose that z 6∈ Wτ . Since Wτ is a closed convex set, there exists a plane\n{x : h x|u i = α} which separates z and Wτ , i.e.\nWτ ⊂ {x : h x|u i ≤ α} and h z|u i > α .\nSince 0 is an interior point of Wτ , we can choose u so that α > 0. Therefore, for all\ny ∈ Wτ , hy|u/α i ≤ 1, i.e. u/α ∈ Wτ∗ . Since hz|u/α i > 1 we conclude that z 6∈ Wτ∗∗ , so\nthat\nWτ = Wτ∗∗ .\nThere is a simple description of Wτ∗ in terms of τ . If τ (u) ≤ 1, it follows from (2.1) that\nu ∈ Wτ∗ . Conversely, since τ is the support function of Wτ , there exists for any u a point\nz ∈ Wτ such that h z|u i = τ (u). Therefore, when u ∈ Wτ∗ , we have τ (u) = h z|u i ≤ 1.\nHence\nWτ∗ = {u : τ (u) ≤ 1} and τ (x) = min{t ≥ 0 : x/t ∈ Wτ∗ } .\n(2.10)\nThe statements in (2.10) mean that τ is the gauge function of Wτ∗ . We can interpret\nthe interface free energy either as the support function of Wτ , or as the gauge function\nof Wτ∗ . The boundary ∂Wτ∗ of the polar set is simply the level-1 surface of τ . Since τ\nis positively homogeneous, the level-t surface is obtained from the level-1 surface by a\ndilation of factor t. Since (∂Wτ∗ )∗ = Wτ∗∗ and n∗ = H(n) for any n ∈ ∂Wτ∗ , the boundary\npoints of Wτ∗ give a natural labeling of the support planes of Wτ (see also section 2.2.2).\n\nPolar set and equilibrium shape. 2D Ising model J = 1, β = 3.\nRemark. Since Wτ = Wτ∗∗ we can exchange the roles of Wτ and Wτ∗ . Let ρ be the\nsupport function of Wτ∗ . This function is the gauge function of the equilibrium shape\nWτ , so that\nWτ = {x : ρ(x) ≤ 1} .\nBy definition of the support function (see (2.8)) we have\nρ(x) = sup{h x|y i : y ∈ Wτ∗ } = sup\ny6=0\n\nh x|y i\nτ (y)\n\n=⇒\n\nh x|y i ≤ ρ(x)τ (y) .\n\nExample. The Hölder norms on E3 are defined by\n( P\n\u00011/p\n3\n|xi |\nif 1 ≤ p < ∞,\ni=1\nkxkp :=\nmax{|xi | , i = 1, 2, 3} if p = ∞.\n\n\f12\nSuppose that τ (x) = kxkp . Then\nWτ = {x : kxkq ≤ 1} and Wτ∗ = {x : kxkp ≤ 1} ,\nwhere q verifies 1/p + 1/q = 1.\nThere is another way of expressing the equilibrium shape using τ . For any y we\nintroduce the affine functional\nx 7→ φy (x) := h x|y i − τ (y) .\nThe half-space H(n) = {x ∈ R3 : φn (x) ≤ 0}. The equilibrium shape can be written\nWτ = {x : sup φy (x) ≤ 0} .\ny\n\nSince τ is sublinear it is easy to verify that\n(\n0 if x ∈ Wτ\nτ ∗ (x) := sup(h x|y i − τ (y)) =\n∞ otherwise.\ny\nThus the Legendre transform τ ∗ of the interface free energy is the indicator function of\nthe equilibrium shape Wτ .\n2.2.2\n\nExtremal support planes and stability of interfaces\n\nWe say that ∂H(n) is an extremal support plane of Wτ iff φn (x) cannot be written\nas\nφn (x) = c1 φn1 (x) + c2 φn2 (x) c1 > 0 , c2 > 0 ,\nexcept by taking n1 = t1 n and n2 = t2 n, t1 > 0 and t2 > 0. Let H(n1 ) 6= H(n2 ), c1 > 0\nand c2 > 0 be given. Let n = c1 n1 + c2 n2 and x ∈ Wτ . Then, by sublinearity of τ ,\n0 ≥ φn (x) = h x|c1 n1 + c2 n2 i − τ (c1 n1 + c2 n2 ) ≥ c1 φn1 (x) + c2 φn2 (x) .\nFrom this we conclude that ∂H(n) is extremal iff\nτ (n) < c1 τ (n1 ) + c2 τ (n2 ) ∀ n1 , n2 linearly independent, such that c1 n1 + c2 n2 = n ,\nthat is, iff the interface perpendicular to n is stable (see (2.9)). When the support planes\n∂H(n) are parametrized by n ∈ ∂Wτ∗ , ∂H(n) is extremal iff n is an extremal point of\nWτ∗ . Indeed, if n = λn1 + (1 − λ)n2 is a non-extremal boundary point of Wτ∗ , then\n1 = τ (n) ≤ λτ (n1 ) + (1 − λ)τ (n2 ) ≤ 1 =⇒ τ (n) = λτ (n1 ) + (1 − λ)τ (n2 ) ,\nso that ∂H(n) is non-extremal. Conversely, if ∂H(n) is non-extremal, then there exist\nc1 > 0, c2 > 0, n1 and n2 so that n = c1 n1 + c2 n2 and τ (n) = c1 τ (n1 ) + c2 τ (n2 ). Putting\nu = n/τ (n), u1 = n1 /τ (n1 ) and u2 = n2 /τ (n2 ), we get\nu=\n\nc2 τ (n2 )\nc1 τ (n1 )\nu1 +\nu2\nτ (n)\nτ (n)\n\nand\n\nc1 τ (n1 ) c2 τ (n2 )\n+\n= 1,\nτ (n)\nτ (n)\n\n\f13\nso that u ∈ ∂Wτ∗ is non-extremal. To summarize, the support plane ∂H(n) of Wτ , with\nn ∈ ∂Wτ∗ , is extremal iff n is an extremal point of Wτ∗ . This happens iff the interface\nperpendicular to n is stable.\nWe can rewrite (2.1) as\nWτ = {x : h x|n i ≤ τ (n) , ∀ n ∈ extWτ∗ } .\n\n(2.11)\n\nOnly the interfaces perpendicular to n ∈ extWτ∗ are stable. For those n, τ (n) is welldefined and can be measured experimentally. For n ∈ ∂Wτ∗ , but not extremal, a flat\ninterface perpendicular to n is unstable and is subject to a hill-and-valley formation built\non the interfaces perpendicular to the m ∈ extWτ∗ entering into the extremal decomposition of n (see [H (1951)]).\nRemark. For a relation between these deformations of the unstable interfaces and the\nphenomenon of thermal faceting, see [H (1951)] and [W (1988)] pp.391-393. It should\nbe stressed however that experiments with crystals and interfaces are rarely done at\nequilibrium so that the thermal faceting is basically a non-equilibrium phenomenon.\nMathematically, the support function of Wτ is defined for any n, and it can be used\nto extend the definition of τ . Equivalently, by taking the convex hull of extWτ∗ we can\ndefine τ for all n ∈ ∂Wτ∗ . Hence the hypothesis (2.7) done at the beginning of section\n2.2 are not restrictive.\nExample. There is a tangent plane to Wτ at x iff there is a unique support plane ∂H(n)\ncontaining x; the outward normal to Wτ at x is well-defined and equal to n. A tangent\nplane is always an extremal support plane. Indeed, suppose that n = λn1 + (1 − λ)n2\nwith 0 < λ < 1 and n1 , n2 ∈ extWτ∗ ; suppose that ∂H(n) is the unique support plane at\nx ∈ ∂Wτ . Then τ (n) = h x|n i and\n1 = τ (n) = λh x|n1 i + (1 − λ)h x|n2 i ≤ λτ (n1 ) + (1 − λ)τ (n2 ) = 1 .\nTherefore\nλ (τ (n1 ) − h x|n1 i) +(1 − λ)(τ (n2 ) − h x|n2 i) = 0 ,\n{z\n}\n|\n≥0\n\nand τ (ni ) = h x|ni i so that ∂H(ni ) is a support plane at x. Hence n = n1 = n2 , the\ndecomposition of n is trivial and n is an extremal point of Wτ∗ . We have extremal support\nplanes which are not tangent planes when Wτ has an edge or a corner.\n2.2.3\n\nSubdifferentials of τ\n\nThe subdifferential of τ at x is the set\n∂τ (x) := {u ∈ E3 : τ (y) ≥ τ (x) + h u|y − x i ∀ y} .\nIt is a closed convex set. An element of ∂τ (x) is a subgradient of τ at x. One can\nprove that differentiability of τ at x is equivalent to the uniqueness of subgradient; the\nunique subgradient is the gradient of τ at x, that is, ∂τ (x) = {gradτ (x)} and\n\u0013\n\u0012\n∂τ (x) ∂τ (x) ∂τ (x)\ngradτ (x) =\n,\n,\n.\n∂x1\n∂x2\n∂x3\n\n\f14\nFor x ∈ ∂Wτ∗ , gradτ (x) is normal to the tangent plane of the polar set Wτ∗ at x. Since τ\nis sublinear,\n∂τ (x) = ∂τ (tx) ∀ t > 0 .\nFrom the definition of the subdifferential of τ at x = 0 one gets another characterization\nof Wτ (τ (0) = 0)\nWτ = ∂τ (0) .\nFor any n 6= 0, the subdifferential ∂τ (n) is the subset of the boundary of the equilibrium\nshape Wτ , which is given by the intersection of Wτ and the support plane ∂H(n), that is\n∂τ (n) = Wτ ∩ ∂H(n)\n\nwhen n 6= 0 .\n\nMoreover, v ∈ ∂τ (n) iff ∂v∗ is a support plane of Wτ∗ at n/τ (n).\nIndeed, suppose that v ∈ ∂τ (n). Then\nτ (u) ≥ τ (n) + h v|u − n i ∀ u .\nChoosing u = 0, we get h v|n i ≥ τ (n). Choosing u = 2n and using the homogeneity of\nτ , we get τ (n) ≥ h v|n i. Therefore τ (n) = h v|n i and v ∈ ∂H(n). But this also implies\nτ (u) ≥ τ (n) + h v|u − n i = h v|u i ∀ u ,\nso that v ∈ Wτ . Conversely, if τ (n) = hv|n i and τ (u) ≥ h v|u i for all u, then\nτ (u) ≥ hv|u i = τ (n) + h v|u − n i ∀ u .\nFor the second part notice that if v ∈ ∂τ (n), then τ (n) = h v|n i, so that ∂v∗ is a\nsupport plane of Wτ∗ at n/τ (n). Conversely, if ∂v∗ is a support plane of Wτ∗ at n/τ (n),\nthen v ∈ ∂H(n) and h v|u i ≤ 1 for all u ∈ Wτ∗ , so that v ∈ Wτ∗∗ = Wτ .\nIn summary, a corner of Wτ∗ at x corresponds to a facet of Wτ perpendicular to x\nsince the subdifferential at x is two-dimensional. Edges of Wτ∗ correspond to edges of Wτ .\nA facet of Wτ∗ corresponds to a corner of Wτ since for each x of the facet of Wτ∗ gradτ (x)\nis the same and each point of the facet labels a different support plane at gradτ (x). For\nthe other points x ∈ ∂Wτ∗ the gradient exists and h gradτ (x)|x i = 1; at gradτ (x) ∈ Wτ\nthere is a unique (extremal) support plane perpendicular to x ∈ Wτ∗ .\nExample. For the Ising model, at zero temperature, Wτ = {x : kxk∞ ≤ 1} and Wτ∗ =\n{x : kxk1 ≤ 1}. In dimension d there are only 2d extremal points for Wτ∗ corresponding to\nthe 2d facets of Wτ . All other interfaces are unstable. For d = 2, at non-zero temperature,\nthe corners of Wτ∗ are smoothed out, so that Wτ has no facet. Moreover, Wτ∗ is strictly\nconvex, so that Wτ has no corner and all points of ∂Wτ∗ are extremal points, hence all\ninterfaces are stable. The disappearing of facets is called roughening transition; here\nthe temperature of the roughening transition is zero. In the rough phase, i.e. above\nzero temperature, τ is differentiable. This situation is generic for two-dimensional cases\nat non-zero temperature. For d = 3, if the temperature is strictly positive and strictly\nsmaller than the two-dimensional critical temperature, inequalities (1.7) and (1.8) imply\nthat there are facets for Wτ corresponding to corners for Wτ∗ . Notice that by symmetry,\ninstead of taking n(θ) = (0, − sin θ, cos θ) as in subsection 1.2.2, we may also choose\nn(θ) = (− sin θ, 0, cos θ) or n(θ) = (− sin θ, cos θ, 0). At a higher temperature the system\nundergoes a roughening transition with the disappearing of facets, but this result has not\nyet been mathematically established for the Ising model.\n\n\f15\n2.2.4\n\nRadius of curvature and stability of interfaces\n\nIn this subsection we assume that τ is strictly convex and smooth (except at the origin).\nAt each point of ∂Wτ there is a well-defined normal n and Wτ ∩ ∂H(n) = {gradτ (n)}.\nWe consider the two-dimensional case Wτ ⊂ E2 . We set for α ∈ [0, 2π),\nn(α) := (cos α, sin α) and m(α) := (− sin α, cos α) .\nThe vectors n and m are orthonormal and we can decompose gradτ (n) as\ngradτ (n) = h gradτ (n)|n in + h gradτ (n)|m im = τ (n)n + h gradτ (n)|m im ,\nsince τ (n) = h gradτ (n)|n i. We also have\nd\nτ (n(α)) = h gradτ (n(α))|m(α) i .\ndα\nTherefore we can parametrize ∂Wτ by\nα 7→ gradτ (n(α)) = τ (n(α)) n(α) +\n\nd\nτ (n(α)) m(α) ,\ndα\n\nα ∈ [0, 2π) .\n\nFrom this expression one obtains\nd\ngradτ (n(α)) =\ndα\n\n\u0012\n\u0013\nd2\nτ (n(α)) + 2 τ (n(α)) m(α) ,\ndα\n\nand the radius of curvature ρ(α) at gradτ (n(α)), which is given by\nρ(α) = τ (n(α)) +\n\nd2\nτ (n(α)) .\ndα2\n\n(2.12)\n\nStrict positivity of ρ(α) means absence of corner at gradτ (n(α)). There is an interesting\ninequality, noticed by Ioffe, which strengthens the stability condition (2.9). If the radius\nof curvature ρ(α) is bounded below uniformly,\ninf ρ(α) = χ > 0 ,\nα\n\nthen\nτ (x) + τ (y) − τ (x + y) ≥ χ(kxk + kyk − kx + yk) ∀ x, y .\n\n(2.13)\n\nThe constant χ is the best possible constant.\nIn the three-dimensional case, at gradτ (n) ∈ ∂Wτ , n is normal to ∂Wτ . To study\nthe curvature at this point one can slice Wτ by planes containing n. This reduces the\nproblem to two-dimensional situations. If the radius of curvature in each slice is bounded\nbelow uniformly by χ > 0, then we get a stronger version of stability inequality (2.3): for\nany tetrahedron T (A0 , A1 , A3 , A3 )\n|∆1 |τ (n1 ) + |∆2 |τ (n2 ) + |∆3 |τ (n3 ) − |∆0 |τ (n) ≥ χ(|∆1 | + |∆2 | + |∆3 | − |∆0 |) .\nIndeed, for x = |∆1 |n1 , y = |∆2 |n2 and z = |∆3 |n3\nτ (x) + τ (y + z) − τ (x + y + z) ≥ χ(kxk + ky + zk − kx + y + zk)\nand\nτ (y) + τ (z) − τ (y + z) ≥ χ(kyk + kzk − ky + zk) .\n\n\f16\n2.2.5\n\nIsoperimetric inequality\n\nGibbs (1878) and Curie (1885) studied a special case of the following variational problem\nconcerning the equilibrium shape of a crystal, and Wulff (1901) gave the geometrical\ninterpretation of the solution showing that the equilibrium shape is obtained by the\nconstruction leading to (2.1). For this reason the equilibrium shape Wτ is often called\nWulff crystal.\nSuppose that V ⊂ Rd , d = 3 or 2, and that n(s) denotes the outward unit normal to\nits boundary ∂V at s. The surface free energy of this set is given by the surface integral\nZ\nFτ (∂V ) :=\nτ (n(s)) dHd−1 (s) .\n∂V\n\nd−1\n\n(dH\nis the (d − 1)-Hausdorff measure in Rd .) The problem considered by Wulff was\nto determine the set V , which minimizes the functional Fτ (∂V ) among a class of subsets\nwith fixed volume. We state an isoperimetric inequality which gives the solution to this\nproblem. Roughly speaking, the subsets which can be considered are those subsets for\nwhich the functional Fτ is well-defined. Denote by |C| the volume of the subset C ⊂ Rd .\nThen\nFτ (∂V ) ≥ d|Wτ |1/d |V |(d−1)/d .\n(2.14)\nEquality holds if and only iff V = Wτ up to dilation and translation.\n\n2.3\n\nSummary\n\nThe subject of this article is the definition of the interface free energy τ and its thermodynamical properties once the interatomic interactions of the system are given. Provided\nthat one can construct a macroscopic state with a planar interface perpendicular to n,\none can use formula (1.3) to obtain τ (n). The fundamental property of the interface free\nenergy is that it is a convex function. The interface free energy can be measured experimentally at equilibrium only for the interfaces which are thermodynamically stable. By\nconvention the physical value of the interface free energy τ (n) is given for a unit vector n.\nBut, using the extension of τ as an homogeneous function, this function can be interpreted\neither as the support function of the equilibrium shape Wτ = {x : h x|n i ≤ τ (n) , ∀ n},\nor as the gauge function of Wτ∗ = {x : τ (x) ≤ 1}. Stable interfaces are labeled by the\nextremal points of Wτ∗ .\nThe interface free energy is considered here only from the macroscopic viewpoint; for\nthat reason the macroscopic states of are the relevant states. These states should not\nbe confused with the infinite-volume Gibbs measures, which describe the states of the\nsystem at the microscopic scale, when one chooses as reference length the lattice spacing.\nFor example, for the two-dimensional Ising model one has macroscopic states with stable\ninterfaces for all directions n, while there are only translation invariant infinite-volume\nGibbs measures. The study of interfaces at the microscopic scale, when the interfaces\nare stochastic geometrical objects, is of course an important, related but different topic\n(see references for section 1). When one studies interfaces at the microscopic scale, it is\noften natural and more convenient to replace the definition of the interface free energy by\nanother definition, which is based on specific microscopic properties of the system. One\nessential point is to prove that the definition used is the same as the definition (1.3).\n\n\f17\n\n3\n\nBibliographical Notes\n\nSection 1. [H (1953)], [RW (1984)], [W (1988)], [Z (1988)] are reviews of physics on\ninterfaces and equilibrium shapes of crystals. The reviews [A (1986)] and [P (1983)] are\nmore specifically concentrated on the interface free energy; they are reviews of mathematical physics. The excellent review [A (1986)] also contains a lot of information on\nrelated subjects. Some results concerning the study of interfaces at the microscopic scale\nare discussed in [P (1983)]. The book [Pr (2009)] contains a lot of material related to the\ninterface free energy, which is not presented here.\nThe problem of the spatial distribution of the coexisting phases, starting with the\nmonograph [DKS (1992)], and the papers [ACC (1990)] and [P (1991)], has been one of\nthe major research themes in mathematical statistical mechanics during the last decade\nof the XXth century, for which deep mathematical results have been obtained for several\nmodels. The interface free energy (as defined in section 1.2.1) enters in an essential way\nin the formulation of the results, and interfaces are studied at the microscopic scale. See\nthe review paper [BIV (2000)], the mathematical monograph [C (2004)] and [Pr (2009)].\nSection 1.2. In relation with the topic of the article, chapter 6 of [G (1999)] is a good\nintroduction to the Ising model, but contains few recent results. An up-to-date good\nreference is [V (2009)].\nSection 1.2.1. The macroscopic limit for the two-dimensional Ising model is discussed\nin [PV (1999)]. Using the methods exposed in [BIV (2000)] analogous results can be\nobtain for the three-dimensional case. The up-to-date reference concerning proofs of\nexistence and convexity of surface tension for ferromagnetic models is [MMR (1992)].\nFor more general models see [BP (2003)]. The role of the complete wetting of the walls\nin the definition (1.4) has been explicitly emphasized in [PV (1999)]. The physics of a\nsituation where the interface is partially pinned to the wall had been studied for the\ntwo-dimensional Ising model by Abraham and Ko already in [AK (1989)]. Mathematical\nresults on wetting phenomenon for Ising systems are in [FP (1987)] and [PV (1996)].\nWall free energies are treated in [FC (1977)].\nComparisons of several definitions of the interface free energy are carefully discussed\nin [A (1986)] and references can be found there. The computation of Onsager is in\nhis famous paper where he solved two-dimensional Ising model at zero magnetic field\n[O (1944)]; the computation of Abraham and Martin-Löf is in [AM (1973)]. The computation of the full interface free energy is detailed in the treatise of McCoy and Wu\n[MW (1973)]. A reference where the results of the computation can be easily found is\n[RW (1981)].\nSection 1.2.2. Inequality (1.5) is proven in [BLP (1980)] and (1.6) in [LP (1981)]. Step\nfree energy is discussed in [A (1986)] and in [BEF (1986)]. Inequality (1.7) is proven in\n[BEF (1986)] and inequality (1.8) in [BFL (1982)].\nSection 2.1. The basic reference is [H (1951)].\nSection 2.2. The basic reference is [H (1951)], but Herring uses the surface tension\nplot, which is the set of points\n{x ∈ E3 : x = τ (n) n , knk = 1} ,\n\n\f18\nfor studying τ . This is the standard way of presenting τ in physics. One gets the\nsurface tension plot from ∂Wτ∗ by an inversion on the unit sphere (or the unit circle\nin dimension 2). Affine parts of ∂Wτ∗ become spherical parts, or circular parts, of the\nsurface tension plot. Using the surface tension plot the fundamental convexity property\nof τ is hidden (this property is not stated explicitly in [H (1951)]); one also looses the\nnatural labeling of the stable interfaces by the extremal points of Wτ∗ of subsection 2.2.2.\nThe duality between non-zero x and half-spaces x∗ is the natural language for discussing\nthe geometry of the equilibrium shape. The use of the polar set Wτ∗ as an alternative to\nthe surface tension plot is mentioned in [MMR (1992)]. The surface tension plot of the\ntwo-dimensional Ising model is analyzed in [RW (1981)].\nInequality (2.13) appears in [I (1994)] in a slightly different form; the formulation\ngiven is taken from [PV (1999)].\nThe mathematics of subsections 2.2.1 to 2.2.4 is classical and treated thoroughly in\n[M (1911)]. An accessible modern reference is chapter 1 of [S (1993)].\nThe isoperimetric inequality is a classical topic in analysis. There are many papers on\ninequality (2.14), e.g. [D (1944)] (one of the early proofs), [T (1978)] and [F (1991)]. The\nproof of (2.14) in these papers is based on Brunn-Minkowski inequality. In dimension\ntwo a different approach is possible [DP (1992)].\n\nReferences\n[A (1986)]\n\nAbraham D.B.: Surface Structures and Phase Transitions–Exact Results,\npp. 1–74 in Phase Transitions and Critical Phenomena vol 10, eds Domb\nC., Lebowitz J.L., Academic Press, London (1986).\n\n[AK (1989)]\n\nAbraham D.B., Ko L.-F.: Exact derivation of the modified Young equation for partial wetting, Phys. Rev. Lett. 63, 275–278 (1989);\n\n[AM (1973)]\n\nAbraham D.B., Martin-Löf A.: The transfer matrix for a pure phase\nin the two dimensional Ising model Commun. Math. Phys. 32, 245-268\n(1973).\n\n[ACC (1990)] Alexander K.S., Chayes J.T., Chayes L.: The Wulff construction\nand asymptotics of the finite cluster distribution for two-dimensional\nBernoulli percolation, Commun. Math. Phys. 131, 1-50 (1990).\n[BIV (2000)]\n\nBodineau T., Ioffe D., Velenik Y.: Rigorous probabilistic analysis on\nequilibrium crystal shapes, J. Math. Phys. 41, 1033–1098 (2000).\n\n[BP (2003)]\n\nBodineau T., Presutti E.: Surface tension and Wulff shape for a lattice model without spin flip symmetry, Annales Henri Poincaré 4, 1–52\n(2003).\n\n[BFL (1982)]\n\nBricmont J., Fontaine J.-R., Lebowitz J.L.: Surface tension, percolation,\nand roughening, J. Stat. Phys. 29, 193–203 (1982).\n\n\f19\n[BEF (1986)]\n\nBricmont J., El Mellouki A., Fröhlich J.: Random surfaces in statistical\nmechanics: roughning, rounding, wetting, * * * , J. Stat. Phys. 42, 743–798\n(1986).\n\n[BLP (1980)]\n\nBricmont J., Lebowitz J.L., Pfister C.-E.: On the surface tension of lattice\nsystems, Annals of the New York Academy of Sciences 337, 214–223\n(1980).\n\n[C (2004)]\n\nCerf R.: The Wulff Crystal in Ising and Percolation Models, Lecture\nNotes in Mathematics 1878, Springer, Berlin, Heidelberg (2006).\n\n[D (1944)]\n\nDinghas A.: Uber einen geometrischen Satz von Wulff fur die Gleichtgewichtsform von Kristallen, Zeitschrift fur Kristallographie 105, 301–\n314 (1944).\n\n[DP (1992)]\n\nDacorogna B., Pfister C.-E.: Wulff theorem and best constant in Sobolev\ninequality, J. Math. Pures Appl. 71 97–118 (1992).\n\n[DKS (1992)]\n\nDobrushin R.L., Kotecký R., Shlosman S.: Wulff construction: a global\nshape from local interaction, AMS translations series (1992).\n\n[FC (1977)]\n\nFisher M.E., Caginalp G.: Wall and Boundary Free Energy I, Commun.\nMath. Phys. 56, 11–56 (1977).\n\n[F (1991)]\n\nFonseca I.: The Wulff theorem revisited, Proc.R.Soc. Lond. A 432, 125–\n145 (1991).\n\n[FP (1987)]\n\nFröhlich J., Pfister C.-E.: The wetting and layering transitions in the\nhalf–infinite Ising model, Europhys. Lett. 3, 845–852 (1987);\nSemi-infinite Ising model I. Thermodynamic functions and phase diagram\nin absense of magnetic field, Commun. Math. Phys. 109, 493-523 (1987);\nSemi-infinite Ising model II. The wetting and layering transitions, Commun. Math. Phys. 112, 51-74 (1987).\n\n[G (1999)]\n\nGallavotti G.: Statistical Mechanics. A Short Treatise, Springer, Berlin,\nHeidelberg (1999).\n\n[H (1951)]\n\nHerring C.: Some Theorems on the Free Energies of Crystal Surfaces,\nPhys. Rev. 82, 87–93 (1951).\n\n[H (1953)]\n\nHerring C.: The Use of Classical Macroscopic Concepts in Surface-Energy\nProblems pp.5–81 in Structure and Properties of Solid Surfaces, eds.\nGomer R., Smith C.S., The University of Chicago Press, Chicago (1953).\n\n[I (1994)]\n\nIoffe D.: Large deviations for the 2D Ising model: a lower bound without\ncluster expansions, J. Stat. Phys. 74 411–432 (1994).\n\n[LP (1981)]\n\nLebowitz J.L., Pfister C.-E.: Surface tension and phase coexistence, Phys.\nRev. Lett. 46, 1031–1033 (1981).\n\n[MW (1973)]\n\nMcCoy B.M., Wu T.T.: The Two-Dimensional Ising Model, Cambridge,\nMA, Harvard University Press (1973).\n\n\f20\n[MMR (1992)] Messager A., Miracle-Solé S., Ruiz J.: Convexity Properties of the Surface\nTension and Equilibrium Crystals, J. Stat. Phys. 67, 449–470 (1992).\n[M (1911)]\n\nMinkowski H.: Theorie der konvexen Körper, insbesondere Begründung\nihres Oberflächenbegriffs pp. 131–229 in Gesammelte Abhandlungen,\nzweiter Band, Teubner, Leipzig und Berlin (1911).\n\n[O (1944)]\n\nOnsager L.: Crystal Statistics I. A two-dimensional model with an orderdisorder transition, Phys. rev. 65, 117-149 (1944).\n\n[P (1983)]\n\nPfister C.-E.: Interface and surface tension in Ising model, pp. 139–161 in\nScaling and Self–Similarity in Physics, ed. J. Fröhlich, Birkhäuser, Basel,\n(1983).\n\n[P (1991)]\n\nPfister C.-E.: Large deviations and phase separation in the two–\ndimensional Ising model, Helv. Phys. Acta 64, 953–1054 (1991).\n\n[PV (1996)]\n\nPfister C.-E., Velenik Y.: Mathematical Theory of the Wetting Phenomenon in the 2D Ising Model, Helv. Phys. Acta 64, 949–973 (1996).\n\n[PV (1999)]\n\nPfister C.-E., Velenik Y.: Interface, Surface Tension and Reentrant Pinning Transition in the 2D Ising Model, Commum. Math. Phys. 204, 269–\n312 (1999).\n\n[Pr (2009)]\n\nPresutti E.: Scaling Limits in Statistical Mechanics and Microstructures\nin Continuum Mechanics, Springer, Berlin, Heidelberg (2009).\n\n[RW (1981)]\n\nRotman C., Wortis M.: Exact equilibrium crystal shapes at nonzero temperature in two dimensions, Phys. Rev. B 11, 6274–6277 (1981).\n\n[RW (1984)]\n\nRotman C., Wortis M.: Statistical mechanics of equilibrium crystal\nshapes: Interfacial phase diagrams and phase transitions, Phys. Rep.\n103, 59–79 (1984).\n\n[S (1993)]\n\nSchneider R.: Convex Bodies: The Brunn-Minkowski Theory, Encyclopedia of Mathematics and its Applications 44 (chapters 1 and 2), Cambridge\nUniversity Press, Cambridge (1993).\n\n[T (1978)]\n\nTaylor J.E.: Crystalline Vatiational Problems, Bull. Amer. Math. Soc.\n84, 568–588 (1978).\n\n[V (2009)]\n\nVelenik Y.: Le modèle d'Ising http://cel.archives-ouvertes.fr/cel-00392289 v1\n(2009).\n\n[W (1988)]\n\nWortis M.: Equilibrium Crystal Shapes and Interfacial Phase Transitions pp. 367–405 in Chemistry and Physics of Solid Surfaces VII, eds.\nVanselow R., Howe R. Springer (1988).\n\n[Z (1988)]\n\nZia R.K.P.: Anisotropic surface tension and equilibrium crystal shapes,\npp. 303–357 in Progress in Statistical Physics, C.K. Hu, ed., World\nScinetific, Singapore (1988).\n\n\f"}