{"id": "http://arxiv.org/abs/1112.6109v1", "guidislink": true, "updated": "2011-12-28T12:32:57Z", "updated_parsed": [2011, 12, 28, 12, 32, 57, 2, 362, 0], "published": "2011-12-28T12:32:57Z", "published_parsed": [2011, 12, 28, 12, 32, 57, 2, 362, 0], "title": "Manipulating Edge Majorana Fermions in Vortex State", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1112.0603%2C1112.0797%2C1112.1130%2C1112.5609%2C1112.4491%2C1112.3639%2C1112.5776%2C1112.0792%2C1112.0376%2C1112.4262%2C1112.5591%2C1112.6224%2C1112.2752%2C1112.3151%2C1112.4427%2C1112.1719%2C1112.1496%2C1112.6109%2C1112.5904%2C1112.1722%2C1112.3004%2C1112.6006%2C1112.1770%2C1112.2052%2C1112.3326%2C1112.3052%2C1112.6097%2C1112.0932%2C1112.5352%2C1112.0045%2C1112.3844%2C1112.4297%2C1112.2916%2C1112.2821%2C1112.5740%2C1112.0798%2C1112.1571%2C1112.6033%2C1112.2805%2C1112.0987%2C1112.4248%2C1112.5894%2C1112.3408%2C1112.5759%2C1112.5989%2C1112.6211%2C1112.2145%2C1112.5274%2C1112.1118%2C1112.3393%2C1112.2085%2C1112.6243%2C1112.4128%2C1112.4173%2C1112.4831%2C1112.2270%2C1112.5473%2C1112.3988%2C1112.3305%2C1112.2686%2C1112.3609%2C1112.4937%2C1112.1037%2C1112.4446%2C1112.2766%2C1112.1872%2C1112.5371%2C1112.6167%2C1112.2208%2C1112.0838%2C1112.6023%2C1112.5645%2C1112.4688%2C1112.5396%2C1112.1402%2C1112.1875%2C1112.2290%2C1112.6058%2C1112.4796%2C1112.5903%2C1112.5333%2C1112.2327%2C1112.4712%2C1112.5402%2C1112.4589%2C1112.4612%2C1112.6373%2C1112.0914%2C1112.2063%2C1112.5040%2C1112.5104%2C1112.4707%2C1112.1362%2C1112.5204%2C1112.2306%2C1112.5530%2C1112.4204%2C1112.2689%2C1112.5822%2C1112.0596%2C1112.2334&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Manipulating Edge Majorana Fermions in Vortex State"}, "summary": "A vortex in a model spinless px+ipy superconductor induces two Majorana\nfermions (MFs), one in the core and the other at the sample edge. In the\npresent work, we show that edge MF can be generated, fused, transported, and\nbraided easily by tuning gate voltages at point-like constriction junctions.\nSolving the time-dependent Bogoliubov-de Gennes equation, we demonstrate that\nthe braiding of edge MFs obeys the non-Abelian statistics. The present setup is\ntherefore a promising implementation for topological quantum computation, and\nhas the advantage of easy manipulation and simple device structure.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1112.0603%2C1112.0797%2C1112.1130%2C1112.5609%2C1112.4491%2C1112.3639%2C1112.5776%2C1112.0792%2C1112.0376%2C1112.4262%2C1112.5591%2C1112.6224%2C1112.2752%2C1112.3151%2C1112.4427%2C1112.1719%2C1112.1496%2C1112.6109%2C1112.5904%2C1112.1722%2C1112.3004%2C1112.6006%2C1112.1770%2C1112.2052%2C1112.3326%2C1112.3052%2C1112.6097%2C1112.0932%2C1112.5352%2C1112.0045%2C1112.3844%2C1112.4297%2C1112.2916%2C1112.2821%2C1112.5740%2C1112.0798%2C1112.1571%2C1112.6033%2C1112.2805%2C1112.0987%2C1112.4248%2C1112.5894%2C1112.3408%2C1112.5759%2C1112.5989%2C1112.6211%2C1112.2145%2C1112.5274%2C1112.1118%2C1112.3393%2C1112.2085%2C1112.6243%2C1112.4128%2C1112.4173%2C1112.4831%2C1112.2270%2C1112.5473%2C1112.3988%2C1112.3305%2C1112.2686%2C1112.3609%2C1112.4937%2C1112.1037%2C1112.4446%2C1112.2766%2C1112.1872%2C1112.5371%2C1112.6167%2C1112.2208%2C1112.0838%2C1112.6023%2C1112.5645%2C1112.4688%2C1112.5396%2C1112.1402%2C1112.1875%2C1112.2290%2C1112.6058%2C1112.4796%2C1112.5903%2C1112.5333%2C1112.2327%2C1112.4712%2C1112.5402%2C1112.4589%2C1112.4612%2C1112.6373%2C1112.0914%2C1112.2063%2C1112.5040%2C1112.5104%2C1112.4707%2C1112.1362%2C1112.5204%2C1112.2306%2C1112.5530%2C1112.4204%2C1112.2689%2C1112.5822%2C1112.0596%2C1112.2334&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "A vortex in a model spinless px+ipy superconductor induces two Majorana\nfermions (MFs), one in the core and the other at the sample edge. In the\npresent work, we show that edge MF can be generated, fused, transported, and\nbraided easily by tuning gate voltages at point-like constriction junctions.\nSolving the time-dependent Bogoliubov-de Gennes equation, we demonstrate that\nthe braiding of edge MFs obeys the non-Abelian statistics. The present setup is\ntherefore a promising implementation for topological quantum computation, and\nhas the advantage of easy manipulation and simple device structure."}, "authors": ["Qi-Feng Liang", "Zhi Wang", "Xiao Hu"], "author_detail": {"name": "Xiao Hu"}, "author": "Xiao Hu", "arxiv_comment": "7 pages, 6 figures", "links": [{"href": "http://arxiv.org/abs/1112.6109v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1112.6109v1", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "cond-mat.supr-con", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cond-mat.supr-con", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "quant-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1112.6109v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1112.6109v1", "journal_reference": null, "doi": null, "fulltext": "Manipulating Edge Majorana Fermions in Vortex State\nQi-Feng Liang,1, 2 Zhi Wang,1 and Xiao Hu1\n1\n\narXiv:1112.6109v1 [cond-mat.supr-con] 28 Dec 2011\n\nInternational Center for Materials Nanoarchitectornics (WPI-MANA)\nNational Institute for Materials Science, Tsukuba 305-0044, Japan\n2\nDepartment of Physics, Shaoxing University, Shaoxing 312000, China\n(Dated: August 4, 2018)\nA vortex in a model spinless px + ipy superconductor induces two Majorana fermions (MFs), one\nin the core and the other at the sample edge. In the present work, we show that edge MF can be\ngenerated, fused, transported, and braided easily by tuning gate voltages at point-like constriction\njunctions. Solving the time-dependent Bogoliubov-de Gennes equation, we demonstrate that the\nbraiding of edge MFs obeys the non-Abelian statistics. The present setup is therefore a promising\nimplementation for topological quantum computation, and has the advantage of easy manipulation\nand simple device structure.\nPACS numbers:\n\nTopological quantum computation is attracting considerable interests due to the unique feature of fault tolerance, where quantum information is stored non-locally\nand robust against decoherence caused by interaction\nwith environment [1, 2]. Ground state degeneracy and\nrotations within the degenerate subspace with unitary\nnon-Abelian transformation are the two important ingredients for its implementation. Systems with Majorana\nfermions (MFs) [3–24], particles equivalent to their antiparticles, as zero-energy excitations are promising, since\nthey are half of conventional fermions and can form nonlocal qubits. Superconducting state provides a natural\nhost for these zero-energy MFs where Bogoliubov quasiparticles are composed by both electrons and holes.\nIt was illustrated that a vortex in spinless px + ipy\nsuperconductor can accommodate a zero-energy MF at\nits core [5], and the braiding of vortices obeys the nonAbelian statistics [6]. A hetero structure of s-wave superconductor (S) and topological insulator (TI) [25–27]\nwas then proposed to behave similarly to the spinless pwave superconductor due to strong spin-orbit coupling,\nand circuits of S/TI/S junctions can achieve creation,\nmanipulation and fusion of MFs by tuning the superconductivity phases [11]. Very recently, it was demonstrated that a spin-orbit coupling semiconductor (SM)\nin proximity to a ferromagnetic insulator (FI) plays a\nsimilar role as TI, and thus a S/SM/FI hetero structure\ncan be a generic platform to provide topological phase\n[15]. It was also illustrated clearly by a toy model that\na one-dimensional (1D) spinless superconductor carries\ntwo zero-energy MFs at its two ends [7], which can be\nrealized by a 1D spin-orbit coupling semiconductor under a magnetic field and in proximity to an s-wave superconductor [18, 19]. The non-Abelian braiding of end\nMFs has been demonstrated very recently in a network\nof these nanowires with voltage applications [20].\nIn the present work, we notice that the edge MF realized in a finite sample with a superconducting vortex is\nvery useful. Since MFs always come as pairs, the zeroenergy MF bounded at the vortex core has its counterpart, which appears at the sample edge (see Fig. 1(a)).\n\nFIG. 1: (a) Schematic device setup for generating and braiding of edge MFs by tuning gate voltage at point-like constriction junctions. (b) Each of the four finite samples (called\nbricks) consists of a hetero structure of s-wave superconductor with a vortex, spin-orbit coupling semiconductor and a\nferromagnetic insulator. (c) Tuning chemical potential to the\ngap between the two bands, a superconducting gap is opened\nat the outside one.\n\nThe edge MFs have important advantages in manipulation, namely they can be created, fused, transported\nand braided easily by applying gate voltages on constriction junctions between finite samples as revealed in the\npresent work. In contrast, motion of core MFs should\nalways be accompanied by vortices, which is not an easy\ntask practically. Comparing with previous proposals\nbased on control of superconductivity phases in circuit\nof S/TI/S junctions [11] and manipulation of end MFs in\nnetwork of 1D nanowires [20], gate voltages are applied at\nthe point-like constriction junctions in the present setup,\nwhich makes the device structure and operations simpler. As a drawback of the present device, the energy\n\n\f2\ngap between edge zero-energy MFs and finite-energy excitations is smaller compared with the core counterparts,\nthus requiring manipulation at lower temperature. It is\nexpected, however, that this difficulty can be overcome\nrelatively easier by using superconductor with large energy gap.\nExplicitly we consider a finite sample of the S/SM/FI\nhetero structure with a superconducting vortex at the\nsample center [15, 18], which we call a brick. Bricks are\nconnected by constriction junctions, where gate voltages\ncan be tuned to connect and disconnect the constriction\njunctions adiabatically. We show that edge MFs can be\ncreated, fused, transported, and braided with sequences\nof switching on and off the gate voltages in the system. Solving the time-dependent Bogoliubov-de Gennes\n(BdG) equation, we monitor the time evolution of the\nwave functions, and demonstrate clearly that braiding of\nedge MFs obeys the non-Abelian statistics.\nBogoliubov-de Gennes Hamiltonian\nOur elementary system is schematically depicted in\nFig. 1(b). The Hamiltonian of a spin-orbit coupling semiconductor in proximity to a ferromagnetic insulator is\ngiven by\n\u0014→\n\u0015\n−\np2\n→\n−\n→\n−\nH0 = d~rc̃ (~r)\n− μ + αR ( σ × p ) * ẑ + Vz σ̂z c̃(~r)\n2m∗\n(1)\nwith m∗ , μ, αR and Vz being the effective electron\nmass, chemical potential, strength of the Rashba spinorbit coupling, and Zeeman field, respectively, and ~σ =\n(σ̂x , σ̂y , σ̂z ) the Pauli matrices and c̃ = (ĉ↑ ĉ↓ )T the electron annihilation operators. The proximity effect from\nthe s-wave superconductor is described by\nZ\nHsc = d~r[∆(~r)ĉ†↑ (~r)ĉ†↓ (~r) + h.c.],\n(2)\nZ\n\none can always achieve Ψ = σ̂y τ̂y Ψ∗ , for which the\nquasiparticle operator defined by\nγ̂ † =\n\nZ\n\nd~r\n\nX\n\nuσ (~r)ĉ†σ (~r) + vσ (~r)ĉσ (~r)\n\n(4)\n\nσ\n\nsatisfies the relation γ̂ † = γ̂. Therefore, the zero-energy\nexcitations of the system are actually pairs of MFs.\nIt has been shown [10, 29, 30] that the system Eq. (3)\nwith a vortex in the superconductor accommodates a MF\nat the vortex core. For the case that there is only one\nvortex in the system, its twin should appear at the edge\nof the system [28, 31]. While the core MF has been investigated in many previous studies, little attention has\nbeen paid on the edge MF (see [11]), which is the main\nfocus of the present work.\nIn order to explore the edge MF, we resort to numerical\nanalysis. For this purpose, we derive the tight-binding\nversion of H0 on a square grid,\nH̃0 =\n\n−t0\n\nX\n\nĉ†iσ ĉjσ − μ\n\ni,j,σ\n\n+itα\n\nXh\ni,δ\n\nX\ni,σ\n\nĉ†i+δx σ̂y ĉi\n\n−\n\nĉ†iσ ĉiσ +\n\nX\n\nVz (ĉ†i↑ ĉi↑ − ĉ†i↓ ĉi↓ )\n\ni\n\nĉ†i+δy σ̂x ĉi\n\ni\n+ h.c. ,\n\n†\n\nwhere ∆(~r) is the effective s-wave pairing potential. The\ntotal Hamitonian\nis Htot = H0 + Hsc . For chemical pop\ntential ∆2 + μ2 < Vz , the system behaves effectively as\na 2D spinless px +ipy superconductor with the dispersion\nand spin configuration given in Fig. 1(c) [5, 10, 28–30].\nThe quasiparticle excitations in the system are described by the following Bogoliubov-de-Gennes (BdG)\nequation\n\u0012\n\u0013\nH0\n∆\nΨ(~r) = EΨ(~r),\n(3)\n∆† −σ̂y H0∗ σ̂y\nwhere the Nambu spinor notation Ψ(~r)\n=\n[u↑ (~r), u↓ (~r), v↓ (~r), −v↑ (~r)] is adopted.\nSince H0 is\nHermitian, any eigen vector Ψ of Eq.(3) with energy E\nhas its twin σ̂y τ̂y Ψ∗ with energy −E, where τ̂y is the\nPauli matrix in Nambu spinor space. Because the BdG\nequation is defined by an even dimensional Hamiltonian,\nzero-energy eigen modes, if any, should appear in pairs.\nBy recombining these zero-energy eigen wave functions,\n\nwhere both spin-reserved hopping t0 = ~2 /2m∗ a2 and\nspin-flipped hopping tα = αR ~/2a are between nearest\nneighbors with a the grid spacing, and μ is measured\nfrom band bottom.\nThe tight-binding BdG equation has the same form of\nEq.(3), and becomes 4N coupled linear equations with\nN being the total number of grid sites. The energy spectrum and all wave functions of excitations including those\nof MFs can be obtained by diagonalizing the 4N × 4N\nmatrix. In the present study, the square sample is divided into a grid of 100 × 100 sites. Although the size\nof the Hamiltonian matrix can be large typically in the\norder of 105 , in most cases only several states near E = 0\nare relevant, for which a powerful numerical technique is\navailable [32].\nEdge Majorana Fermions\nWe first study a square sample (see Fig. 1(b)) with a vor2\ntex at the center ∆(~r) = ∆0 [1 − e−(r/s) ]eiθ with s = 4a,\nnamely the brick. As shown in the energy spectrum in\nFig. 2(a), we found a pair of zero-energy excitations in\nthe system. By recombination, we get two wave functions, one at the vortex core and the other on the sample\nedge with their norms plotted in the inset of Fig. 2(a),\nboth satisfying the generic relation for MF. We define\nthem as core MF and edge MF. This treatment of wave\nfunctions is understood for all discussions through the\npresent work.\nNext we study two bricks connected by a constriction\njunction. As shown in Fig. 2(b), we find again two zeroenergy MFs, each bounded by one of the two vortices.\n\n(5)\n\n\f3\n\nFIG. 2: Energy spectrum of several lowest excitations and\ndistribution of wave-function norms of zero-energy MFs, (a)\nfor one brick with two MFs, one at vortex core and the other\nat brick edge, and (b) for two connected bricks with two core\nMFs. Results are for ∆0 = 0.5t0 , Vz = 0.8t0 , μ = 0 and\ntα = 0.9t0 , with 100 × 100 sites for the brick and 10 × 10 sites\nfor the constriction junction.\n\nThere is no edge MF this time (see inset of Fig. 2(b)),\nsince the two edge MFs in the two bricks meet each other\nat the constriction junction and fuse into a Bogoliubov\nquasiparticle with finite energy.\nWe proceed to investigate a system of three bricks,\nand introduce dynamic process of switching on and off\nconstriction junctions. This is implemented by tuning\nthe hopping integrals at the constriction junctions among\nbricks, which can be realized practically by adjusting gate\nvoltage. At the initial state, the left brick is isolated\nwhile the other two are connected. There are three core\nand one edge MFs as revealed above. As confirmed by\ncalculation, the core MFs remain unchanged (in an exponential accuracy) during the switching process, we omit\nthem in the following discussions for simplicity. The constriction junction between the left and central bricks is\nthen turned on adiabatically. As displayed in Fig. 3(a),\nit is interesting to observe that, the edge MF on the left\nbrick spreads its wave function to the central and right\nbricks, since now there is only one unified edge of the\nthree bricks. We emphasize that this is one of the clearest manifestations of the mobility of the edge state.\nWe then turn off the constriction junction between the\ncentral brick and the right one adiabatically. As shown\nin Fig. 3(a), the wave function of edge MF now shrinks\nto the right brick. As the result of these two switchings,\nthe edge MF initially at the left brick is transported to\nthe right brick.\nDuring the whole process, we monitor the energy spectrum and make sure that the gap between the zero-energy\nMFs and excitations of finite energy remains open (see\n\nFIG. 3: (a) Diagram for transport of edge MF prepared at\nthe left brick to the right brick and distributions of calculated wave-function norms. (b) Evolution of the energy spectrum, where the two zero-energy excitations are associated\nwith three core and one edge MFs, when the left junction\nis turned on adiabatically parameterized by λ1 , and then the\nright junction is turned off adiabatically parameterized by λ2 .\n\nFig. 3(b)), which protects the topological phase of the\nsystem. Compared with previous prescriptions [11, 20],\nthe present manipulations on edge MFs are performed by\napplications of point-like gate voltages, which makes the\ndevice simpler.\nBraiding with Non-Abelian Statistics\nBased on the above results, we can exchange edge MFs\npairwisely. The simplest structure for this purpose consists of four bricks, as depicted in Fig. 1(a), and the diagram of exchange process of two edge MFs are demonstrated in Fig. 4. As the initial state (step-0), there are\ntwo edge MFs located at the left and right bricks, whereas\nthe central and top bricks are connected (thus no edge\nMFs). Following the process for transportation revealed\nabove, we first transport the red edge MF to the top brick\n(step-1, -2). We then transport the green edge MF from\nthe right brick to left brick (step-3, -4). Finally, we bring\nthe red edge MF tentatively stored at the top brick to\nthe right brick (step-5, -6). After these operations, the\nsetup of the system, or the Hamiltonian, returns to the\ninitial one, but leaving the two edge MFs exchanged.\nNow let us reveal the impact of this exchange to the\nwave function of system. For this purpose, we evaluate the time evolution of wave function upon adiabatic\nswitchings by using the time-dependent BdG (TDBdG)\nmethod [33–35]. We first derive the wave functions of\nedge MFs at the left and right bricks by diagonalizing the\n\n\f4\n\nFIG. 4: Diagram for exchanging two edge MFs (red and green for eye-guide) and distribution of wave-function norms.\n\nand -6), OR becomes positive and then achieves OR = +1\nby the time the whole process is finished.\nTherefore, during the process of exchanging the two\nedge MFs illustrated in Fig. 4, the wave function of the\nsystem evolves as\n\nProjection\n\n1.0\n\n0.5\n\n0.0\n\nO\nO\n\n-0.5\n\nL\n\nR\n\n|Ψ(t = 0)i = |φL i + |φR i ⇒ |Ψ(t = 6T )i = −|φL i + |φR i,\n(7)\nor in terms of operators,\n\n-1.0\n0\n\n1\n\n2\n\n3\n\n4\n\n5\n\n6\n\ntime [ T ]\n\nFIG. 5: Time evolution of the wave function of edge MFs for\nthe exchange process in Fig. 4, in terms of its projections OL\nand OR to the two edge MFs prepared at the initial stage.\nThe time for a transport process is taken as T = 40000~/t0 .\n\nHamitonian Eq.(3), with which the initial wave function\nfor the total system is given by |Ψ(t = 0)i = |φL i + |φR i.\nUpon on the switching process illustrated in Fig. 4, the\nwave function evolves with time according to the TDBdG\nequation:\n\nγˆL → γˆR ,\n\nγˆR → −γˆL ,\n\nwhich can be presented by a unitary transformation\nπ\nULR = e 4 γ̂R γ̂L , the same form observed first for core\nMFs [6] (see also [20]).\nThe above exchange rule of edge MFs can be understood in the following way. Let us start from the MF\ntransport in Fig. 3. An effective Hamiltonian for the\nlow-energy physics of the adiabatic transport is given by\nĤeff (t) = iλ1 (t)ΓLC γ̂L γ̂C + iλ2 (t)ΓCR γ̂C γ̂R ,\n\ni~\n\nd|Ψ(t)i\n= Htot (t)|Ψ(t)i.\ndt\n\n(6)\n\nThe evolution of wave function can be monitored by its\nprojections to the initial wave functions of the two edge\nMFs, OL ≡ hφL |Ψ(t)i and OR ≡ hφR |Ψ(t)i. At the initial\nstate (step-0), one has OL = OR = +1 by definition. As\nshown in Fig. 5, the order parameter OL drops gradually\nsince the wave function of the red edge MF spreads to the\nthree bricks when the left junction is turned on (step1 in Fig. 4); it drops to zero when the red edge MF\nis totally transported to the top brick (step-2). When\nthe right junction is then turned on and thus the green\nedge MF spreads its wave function to the central and left\nbricks (step-3), OL becomes finite, and most intriguingly\nit acquires a minus sign. It achieves OL = −1 when\nthe left junction is switched off (step-4), and remains its\nvalue for the final two steps.\nThe evolution of the order parameter OR up to step-4\nis straightforward. When the red edge MF stored tentatively at the top brick spreads to the right brick (step-5\n\n(8)\n\n(9)\n\nwhere Γij = −Γji denotes interaction between MFs, and\nfor edge MF transport λ1 (t) increases from 0 to 1 from\nt = 0 to t = T while λ2 remains unity, and from t = T\nto t = 2T λ2 (t) decreases from 1 to 0 while λ1 remains\nunity. A zero-energy edge MF can be composed from the\nthree MF creation operators at any moment provided the\ntopological phase is protected by the adiabatic processes\nγ̂L λ2 (t)\nγ̂R λ1 (t)ΓLC /ΓCR\nγ̂(t) = q\n+q\n,\nΓLC 2\n2\nLC 2\n] + λ22 (t)\n[λ1 (t) ΓCR ] + λ2 (t)\n[λ1 (t) ΓΓCR\n(10)\nwith γ̂(t = 0) = γ̂L and γ̂(t = 2T ) = sgn(ΓLC /ΓCR )γ̂R .\nAn interaction between γL and γR can be included, but\nit is easy to see that the result of transport remains the\nsame.\nThe exchanging process which consists of three transport processes with two edge MFs as shown in Fig. 4\nis then described in the following way: γ̂1 (t = 2T ) =\nsgn(ΓLC /ΓCT )γ̂T and γ̂2 (t = 2T ) = γ̂R , γ̂1 (t = 4T ) =\n\n\f5\n\nFIG. 6: Diagrams for two braiding processes of three edge\nMFs (red, green and blue for eye-guide) and time evolution\nof the wave function of edge MFs, in terms of its projections\nOL , OR and OT to the three edge MFs prepared at the initial\nstage.\n\nγ̂1 (t = 2T ) and γ̂2 (t = 4T ) = sgn(ΓRC /ΓCL )γ̂L ,\nγ̂1 (t = 6T ) = sgn(ΓT C /ΓCR )sgn(ΓLC /ΓCT )γ̂R =\n−sgn(ΓLC /ΓCR )γ̂R and γ̂2 (t = 6T ) = γ̂2 (t = 4T ). It\nis then clear that after the braiding, the two MFs at the\nleft and right bricks acquire opposite signs, as revealed\nin Fig. 5.\nNow we are ready to exhibit that the braiding of edge\nMFs obeys the non-Abelian statistics. As illustrated in\nFig. 6 with five bricks and three edge MFs, starting from\nthe same initial state, the two processes of different orders\nof braiding generate two different final states, which corresponds directly to the inequality ULT UT R 6= UT R ULT ,\nnamely the non-Abelian feature of braiding.\n\nsetup based on edge MFs than an implementation using\ncore MFs simply because the edge MFs are distributed\nover the sample edge. Quantitatively, the excitation gap\nis about 0.01∆0 for parameters ∆0 = 0.5t0 , Vz = 0.8t0\nand αR = 0.9t0 . For a superconductivity gap ∆0 ∼ 1meV\n[29, 36], the corresponding temperature of the excitation gap will be ∼ 100mK, which is not hard for lowtemperature technologies in these days.\nWhile not appearing p\napparently in the criterion for\nchemical potential Vz > ∆2 + μ2 supporting the topological phase, the spin-orbit coupling αR does play an\nimportant role in determining the magnitude of effective\np-wave pairing and thus the excitation gap. Besides InAs\n[15], the layered polar semiconductor BiTeI with giant\nspin-orbit coupling can be a promising material for our\ndevice [37]. The Zeeman splitting Vz of order of several\nmeV can be realized in the thin film of strong ferromagnetic insulator [38] according to a recent work [29].\nThe present setup has good scalability, and an array\nof the units in Fig. 1(a) supports a ground state wave\nfunction consisted of a linear combination of the manybody Majorana edge states. The ground state can be\nrotated in the degenerate subspace by exchanging pairwisely the Majorana edge states, which is given by a multidimensional unitary matrix representation of the 2D\nbraid group, and governed by the non-Abelian statistics.\nTo conclude, we have demonstrated that the edge MFs\ninduced by vortices in topological superconductor can\nbe manipulated easily by application of gate voltages at\npoint-like constriction junctions. Adiabatic braidings of\nedge MFs have been simulated by TDBdG method, and\nthe non-Ableian statistics is proved. The present proposal therefore provides a promising way for implementing quantum topological computation based on zeroenergy MFs, and has the advantage of easy operation\nand simple device structure.\nMethods\nIn this work, we use TDBdG method to simulate the\nadiabatic braiding of edge MFs upon switching on\nand off the constriction junctions. The main task\nof the simulation is to solve the TDBdG equation\n(6). TheR formal solution of the equation is |Ψ(t)i =\nexp(−i~ H(t)dt)|Ψ(0)i. To solve it numerically, we first\ndivide the total simulation time into small steps of ∆t, in\nwhich the Hamiltonian can be considered as time independent, and thus |Ψ(t + ∆t)i ≃ exp(−i~H(t)∆t)|Ψ(t)i.\nThe exponential can be expanded by the Chebyshev polynomials Tn (H)\ne−i~H(t)∆t =\n\n∞\nX\n\ncm (∆t)Tm (H).\n\n(11)\n\nm\n\nDiscussions\nIn an implementation of topological quantum computation based on the zero-energy MF modes, the working\ntemperature is limited by the energy gap to the lowest\nexcitation. The excitation gap is smaller in the present\n\nBecause the coefficients cm decrease exponentially [33,\n34], only a finite number (Mmax ) of terms in the above expansion are needed for sufficient accuracy. Using the recursive relations of the Chebyshev polynomials Tm (H) =\n2HTm−1 (H) − Tm−2 (H), the summation in Eq.(11) can\n\n\f6\nbe performed by Mmax times matrix-multiplication. For\na sparse matrix H in our system, the computation time\nis of O(N ) [33].\nThe time-dependent part of the Hamiltonian is the\nhopping integrals at the sites on constriction junctions\nbetween bricks. In the present study, we use a parameter\n0 ≤ λ(t) ≤ 1 to scale the hopping integrals between zero\nto t0 . In order to simulate adiabatic processes, the function λ(t) should vary slowly with t, and thus the total\nevolution time T is taken sufficiently long as compared\nwith the inverse of the lowest excitation energy. Further-\n\nmore, we use λ(t) = (t/T )2 rather than a linear function\nof t, which suppresses efficiently excitations from zeroenergy MFs to states with finite energy.\n\n[1] Kitaev, A. Y. Fault-tolerant quantum computation by\nanyons. Ann. Phys. 303, 2 (2003).\n[2] Nayak, C., Simon, S. H., Stern, A., Freedman, M. & Das\nSarma, S. Non-Abelian anyons and topological quantum\ncomputation. Rev. Mod. Phys. 80, 1083 (2008).\n[3] Moore, G. & Read, N. Nonabelions in the fractional\nquantum hall effect. Nuc. Phys. B 360, 362 (1991).\n[4] Wen, X. G. Non-Abelian topological order in ν=1/2\nquantum hall state. Phys. Rev. Lett. 70, 355358 (1993).\n[5] Read, N. & Green, D. Paired states of fermions in two dimensions with breaking of parity and time-reversal symmetries and the fractional quantum hall effect. Phys. Rev.\nB 61, 10267 (2000).\n[6] Ivanov, D. A. Non-Abelian statistics of half-quantum vortices in p-wave superconductors. Phys. Rev. Lett. 86, 268\n(2001).\n[7] Kitaev, A. Y. Unpaired majorana fermions in quantum\nwires. Phys. -Usp. 44, 131 (2001).\n[8] Das Sarma, S., Freedman, M. & Nayak, C. Topologically\nprotected qubits from a possible non-Abelian fractional\nquantum hall state. Phys. Rev. Lett. 94, 166802 (2005).\n[9] Tewari, S., Das Sarma, S., Nayak, C., Zhang, C. -W.\n& Zoller, P. Quamtum computation using vortices and\nmajorana zero modes of a px +ipy superfluid of fermionic\ncold atoms. Phys. Rev. Lett 98, 010506 (2007).\n[10] Gurarie, V. & Radzihovsky, L. Zero modes of twodimensional chrial p-wave superconductors. Phys. Rev.\nB 75, 212509 (2007).\n[11] Fu, L. & Kane, C. L. Superconducting proximity effect\nand majorana fermions at the surface of a topological\ninsulator. Phys. Rev. Lett. 100, 096407 (2008).\n[12] Wilczek, F. Majorana returns. Nat. Phys. 5, 614(2009).\n[13] Law, K. T., Lee, P. A. & Ng, T. K. Majorana fermion induced resonant andreev reflection. Phys. Rev. Lett. 103,\n237001 (2009).\n[14] You, J. Q., Shi, X. F., Hu, X. D. & Nori, F. Quantum\nemulation of a spin system with topological protected\nground states using superconducting quantum circuits.\nPhys. Rev. B 81, 014505 (2010).\n[15] Sau, J. D., Lutchyn, R. M., Tewari, S. & Das Sarma, S.\nGeneric new platform for topological quantum computation using semiconductor heterostructures. Phys. Rev.\nLett. 104, 040502 (2010).\n[16] Wimmer, M., Akhmerov, A. R., Medvedyeva, M. V.,\nTworzydlo, J. & Beenakker, C. W. J. Majorana bound\nstates without vortices in topological superconductors\nwith electrostatic defects. Phys. Rev. Lett. 105, 046803\n\n(2010).\n[17] Linder, J., Tanaka, Y., Yokoyama, T., Sudb, A. & Nagaosa, N. Unconventional Superconductivity on a Topological Insulator. Phys. Rev. Lett. 104, 067001 (2010).\n[18] Lutchyn, R. M., Sau, J. D. & Das Sarma, S. Majorana fermions and a topological phase transition\nin semiconductor-superconductor heterostructures. Phy.\nRev. Lett. 105, 077001 (2010)\n[19] Oreg, Y., Rafael, G. & von Oppen, F. Helical liguids\nand majorana bound states in quantum wires. Phys. Rev.\nLett. 105, 177002 (2010).\n[20] Alicea, J., Oreg, Y., Refael, G., von Oppen, F. & Fisher,\nM. P. A. Non-Abelian statistics and topological quantum\ninformation processing in 1D wire networks. Nat. Phys.\n7, 412 (2011).\n[21] Zhou, B. & Shen, S. Q. Crossover from majorana edgeto end-state in quasi-one-dimensional p-wave superconductors. Phys. Rev. B 84, 054532 (2011).\n[22] Hosur, P., Ghaemi, P., Mong, R. S. K. & Vishwanath,\nA. Majorana modes at the ends of superconductor vortices in doped topological insulator. Phys. Rev. Lett. 107,\n097001 (2011).\n[23] Mao, L., Shi, J. R., Niu, Q. & Zhang, C. W. Superconducting phase with a chiral f-Wave pairing symmetry\nand majorana fermions induced in a Hole-Doped Semiconductor Phys. Rev. Lett. 106, 157003 (2011).\n[24] Jang, J., Ferguson, D. G., Vakaryuk, V., Budakian, R.,\nChung, S. B., Goldbart, P. M. & Maeno, Y. Observation\nof half-height magnetization steps in Sr2 RuO4 . Science.\n331, 186 (2011).\n[25] Hasan, M. Z. & Kane, C. L. colloquium:topological insulators. Rev. Mod. Phys. 82, 3045 (2010).\n[26] Yu, R., Zhang, W., Zhang, H. J., Zhang, S. C., Dai, X.\n& Fang, Z. Quantized anomalous hall effect in magnetic\ntopological insulators. Science 329, 61 (2010).\n[27] Qi, X. L. & Zhang, S. C. Topological insulators and superconductors. Rev. Mod. Phys. 83, 1057 (2011).\n[28] Tewari, S., Das Sarma, S. & Lee, D. -H., Index theorem\nfor the zero modes of majorana fermion vortices in chiral p-wave superconductors. Phys. Rev. Lett. 99, 037001\n(2007).\n[29] Sau, J. D., Tewari, S., Lutchyn, R. M., Stanescu, T. D. &\nDas Sarma, S. Non-Abelian quantum order in spin-orbitcoupled semiconductors: search for topological majorana\nparticles in solid-state systems. Phys. Rev. B 82, 214509\n(2010).\n[30] Mao, L & Zhang, C. W. Robustness of Majorana modes\n\nAcknowledgements\nThis work was supported by WPI Initiative on Materials Nanoarchitectonics, MEXT of Japan, and Grantsin-Aid for Scientific Research (No.22540377), JSPS, and\npartially by CREST, JST. Q.F.L. is also supported by\nNSFC under grants 10904092.\n\n\f7\n\n[31]\n\n[32]\n\n[33]\n[34]\n\nand minigaps in a spin-orbit-coupled semiconductorsuperconductor hererostructure. Phys. Rev. B 82, 174506\n(2010).\nGrofeld, E. & Stern, A. Observing majorana bound\nstates of josephson vortices in topological superconductors. Proc. Nat. Acad. Sci. 108, 11810 (2011).\nBollhöfer, M. & Notay, Y. JADAMILU:a software code\nfor computing selected eigenvalues of large sparse symmetric matrices. Comp. Phys. Com. 177, 951 (2007).\nRoche, S. Quantum transport by means of O(N) realspace methods. Phys. Rev. B 59, 2284 (1999).\nLoh, Y. L., Taraskin, S. N. & Elliott, S. R. Fast timeevolution method for dynamical system. Phys. Rev. Lett.\n\n84, 2290 (2000).\n[35] Weisse, A., Wellein, G., Alveman, A. & Fehske, H. The\nKernel polynomials method. Rev. Mod. Phys. 78, 275\n(2006).\n[36] Chrestin, A., Matsuyama, T. & Merkt, U. Evidence for a\nproximity-induced energy gap in Nb/InAs/Nb junctions.\nPhys. Rev. B 55 ,8457 (1997).\n[37] Ishizaka, K. et al., Giant Rashba-type spin splitting in\nbulk BiTeI. Nat. Mat. 10, 521 (2011).\n[38] Matthias, B. T., Bozorth, R. N. & Van Vleck, J. H. Ferromagnetic interaction in EuO. Phys. Rev. Lett. 7, 160\n(1961).\n\n\f"}