{"id": "http://arxiv.org/abs/0902.0361v2", "guidislink": true, "updated": "2009-02-03T10:09:20Z", "updated_parsed": [2009, 2, 3, 10, 9, 20, 1, 34, 0], "published": "2009-02-02T20:56:53Z", "published_parsed": [2009, 2, 2, 20, 56, 53, 0, 33, 0], "title": "The elaboration of spiral galaxies: morpho-kinematics analyses of their\n  progenitors with IMAGES", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0902.2013%2C0902.3589%2C0902.0848%2C0902.3004%2C0902.1045%2C0902.3090%2C0902.4166%2C0902.2687%2C0902.4413%2C0902.1567%2C0902.4564%2C0902.2273%2C0902.3059%2C0902.4160%2C0902.0244%2C0902.2915%2C0902.2949%2C0902.0197%2C0902.4681%2C0902.4609%2C0902.4153%2C0902.0946%2C0902.1715%2C0902.2437%2C0902.3892%2C0902.4102%2C0902.1206%2C0902.0260%2C0902.0507%2C0902.1880%2C0902.0913%2C0902.3645%2C0902.2907%2C0902.0050%2C0902.1166%2C0902.2310%2C0902.4702%2C0902.3679%2C0902.4674%2C0902.1118%2C0902.0872%2C0902.0361%2C0902.4064%2C0902.4100%2C0902.4740%2C0902.4091%2C0902.0219%2C0902.2830%2C0902.0124%2C0902.3453%2C0902.1078%2C0902.4853%2C0902.3436%2C0902.3758%2C0902.2659%2C0902.3275%2C0902.0380%2C0902.0045%2C0902.4110%2C0902.0247%2C0902.1710%2C0902.4647%2C0902.1489%2C0902.0876%2C0902.3320%2C0902.2639%2C0902.1695%2C0902.0161%2C0902.2017%2C0902.2697%2C0902.1259%2C0902.3670%2C0902.4415%2C0902.4831%2C0902.2995%2C0902.4807%2C0902.2354%2C0902.2261%2C0902.3652%2C0902.3871%2C0902.3361%2C0902.1649%2C0902.4892%2C0902.3725%2C0902.0817%2C0902.4397%2C0902.0807%2C0902.3887%2C0902.4522%2C0902.2232%2C0902.4421%2C0902.1759%2C0902.2286%2C0902.3942%2C0902.1815%2C0902.1412%2C0902.3178%2C0902.0362%2C0902.2937%2C0902.4743%2C0902.4199&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "The elaboration of spiral galaxies: morpho-kinematics analyses of their\n  progenitors with IMAGES"}, "summary": "The IMAGES project aims at measuring the velocity fields of a representative\nsample of 100 massive galaxies at z=0.4-0.75, selected in the CDFS, the CFRS\nand the HDFS fields. It uses the world-unique mode of multiple integral field\nunits of FLAMES/ GIRAFFE at VLT. The resolved-kinematics data allow us to\nsample the large scale motions at ~ few kpc scale for each galaxy. They have\nbeen combined with the deepest HST/ACS, Spitzer (MIPS and IRAC) and VLT/FORS2\never achieved observations. Most intermediate redshift galaxies show anomalous\nvelocity fields: 6 Gyrs ago, half of the present day spirals were out of\nequilibrium and had peculiar morphologies. The wealth of the data in these\nfields allow us to modelize the physical processes in each galaxy with an\naccuracy almost similar to what is done in the local Universe. These detailed\nanalyses reveal the importance of merger processes, including their remnant\nphases. Together with the large evolution of spiral properties, this points out\nthe importance of disk survival and strengthens the disk rebuilding scenario.\nThis suggests that the hierarchical scenario may apply to the elaboration of\ndisk galaxies as it does for ellipticals.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0902.2013%2C0902.3589%2C0902.0848%2C0902.3004%2C0902.1045%2C0902.3090%2C0902.4166%2C0902.2687%2C0902.4413%2C0902.1567%2C0902.4564%2C0902.2273%2C0902.3059%2C0902.4160%2C0902.0244%2C0902.2915%2C0902.2949%2C0902.0197%2C0902.4681%2C0902.4609%2C0902.4153%2C0902.0946%2C0902.1715%2C0902.2437%2C0902.3892%2C0902.4102%2C0902.1206%2C0902.0260%2C0902.0507%2C0902.1880%2C0902.0913%2C0902.3645%2C0902.2907%2C0902.0050%2C0902.1166%2C0902.2310%2C0902.4702%2C0902.3679%2C0902.4674%2C0902.1118%2C0902.0872%2C0902.0361%2C0902.4064%2C0902.4100%2C0902.4740%2C0902.4091%2C0902.0219%2C0902.2830%2C0902.0124%2C0902.3453%2C0902.1078%2C0902.4853%2C0902.3436%2C0902.3758%2C0902.2659%2C0902.3275%2C0902.0380%2C0902.0045%2C0902.4110%2C0902.0247%2C0902.1710%2C0902.4647%2C0902.1489%2C0902.0876%2C0902.3320%2C0902.2639%2C0902.1695%2C0902.0161%2C0902.2017%2C0902.2697%2C0902.1259%2C0902.3670%2C0902.4415%2C0902.4831%2C0902.2995%2C0902.4807%2C0902.2354%2C0902.2261%2C0902.3652%2C0902.3871%2C0902.3361%2C0902.1649%2C0902.4892%2C0902.3725%2C0902.0817%2C0902.4397%2C0902.0807%2C0902.3887%2C0902.4522%2C0902.2232%2C0902.4421%2C0902.1759%2C0902.2286%2C0902.3942%2C0902.1815%2C0902.1412%2C0902.3178%2C0902.0362%2C0902.2937%2C0902.4743%2C0902.4199&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "The IMAGES project aims at measuring the velocity fields of a representative\nsample of 100 massive galaxies at z=0.4-0.75, selected in the CDFS, the CFRS\nand the HDFS fields. It uses the world-unique mode of multiple integral field\nunits of FLAMES/ GIRAFFE at VLT. The resolved-kinematics data allow us to\nsample the large scale motions at ~ few kpc scale for each galaxy. They have\nbeen combined with the deepest HST/ACS, Spitzer (MIPS and IRAC) and VLT/FORS2\never achieved observations. Most intermediate redshift galaxies show anomalous\nvelocity fields: 6 Gyrs ago, half of the present day spirals were out of\nequilibrium and had peculiar morphologies. The wealth of the data in these\nfields allow us to modelize the physical processes in each galaxy with an\naccuracy almost similar to what is done in the local Universe. These detailed\nanalyses reveal the importance of merger processes, including their remnant\nphases. Together with the large evolution of spiral properties, this points out\nthe importance of disk survival and strengthens the disk rebuilding scenario.\nThis suggests that the hierarchical scenario may apply to the elaboration of\ndisk galaxies as it does for ellipticals."}, "authors": ["F. Hammer"], "author_detail": {"name": "F. Hammer"}, "author": "F. Hammer", "arxiv_comment": "On behalf of the IMAGES collaboration. Proceedings \"Galaxy Evolution:\n  Emerging Insights and Future Challenges\", 11-14 November 2008", "links": [{"href": "http://arxiv.org/abs/0902.0361v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0902.0361v2", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "astro-ph.CO", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "astro-ph.CO", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0902.0361v2", "affiliation": "GEPI, Observatoire de Paris Meudon", "arxiv_url": "http://arxiv.org/abs/0902.0361v2", "journal_reference": null, "doi": null, "fulltext": "Galaxy Evolution: Emerging Insights and Future Challenges\nASP Conference Series, Vol. **VOLUME**, 2009\nShardha Jogee, Lei Hao, Guillermo Blanc, Irina Marinova\n\nThe elaboration of spiral galaxies: morpho-kinematics\nanalyses of their progenitors with IMAGES\n\narXiv:0902.0361v2 [astro-ph.CO] 3 Feb 2009\n\nF. Hammer, on behalf of the IMAGES collaboration\nGEPI, Observatoire de Paris & CNRS\nAbstract.\nThe IMAGES (Intermediate MAss Galaxy Evolution Sequence)\nproject aims at measuring the velocity fields of a representative sample of 100\nmassive galaxies at z=0.4-0.75, selected in the CDFS, the CFRS and the HDFS\nfields. It uses the world-unique mode of multiple integral field units of FLAMES/\nGIRAFFE at VLT. The resolved-kinematics data allow us to sample the large\nscale motions at ∼ few kpc scale for each galaxy. They have been combined\nwith the deepest HST/ACS, Spitzer (MIPS and IRAC) and VLT/FORS2 ever\nachieved observations. Most intermediate redshift galaxies show anomalous velocity fields: 6 Gyrs ago, half of the present day spirals were out of equilibrium\nand had peculiar morphologies.\nThe wealth of the data in these fields allow us to modelize the physical processes\nin each galaxy with an accuracy almost similar to what is done in the local\nUniverse. These detailed analyses reveal the importance of merger processes,\nincluding their remnant phases. Together with the large evolution of spiral\nproperties, this points out the importance of disk survival and strengthens the\ndisk rebuilding scenario. This suggests that the hierarchical scenario may apply\nto the elaboration of disk galaxies as it does for ellipticals.\n\n1.\n\nIntroduction\n\nHalf of the present-day stellar mass density has been formed since z=1, during\nthe last 8 Gyr (Dickinson et al. 2003; Fontana et al. 2003). This result is\nparticularly robust as it has been derived from two independent methods: the\nevolution of the cosmic stellar mass density and by integrating the universal star\nformation density including infra-red measurements (Flores et al, 1999). The two\nmethods have their own weaknesses depending on the contribution of massive\nstars to the near-IR light (e.g. Maraston et al., 2006) or to the conversion of the\nmid-IR luminosity in star formation rate. However the good agreement between\ntheir predictions -at least below z=1- is rather compelling.\nHammer et al. (2005) and Bell et al. (2005) have shown that most of\nthe stellar mass formation during the last 8 Gyrs is associated to Luminous IR\nGalaxies (LIRGs, SFR> 19 M ) which may account from 50% to 100% of the\nstar formation density in the z=0.5-1 range. Most LIRGs have stellar masses\nranging from 2 to 20× 1010 M , those being responsible for the bulk of the star\nformation density reported by deep galaxy surveys (e.g. CFRS) and by studies\nof the past history of present-day galaxies (e.g. Heavens et al., 2004). Presentday intermediate mass galaxies are mostly spiral galaxies (70% of them from\nthe SDSS, Nakamura et al., 2004). How galaxies, mostly spirals with masses\nsimilar to that of the Milky Way, have assembled half of their stars over the\npast 8 Gyrs? To identify the main physical processes at the origin of the star\nformation, we are now embarked in a complete study of their progenitors, i.e.\ngalaxies having emitted their light 4 to 7 Gyrs ago.\n1\n\n\f2\n2.\n\nOne hundred distant galaxies with spatially resolved kinematics\nfrom the IMAGES survey\n\nWe gathered a sample of 100 galaxies selected on the sole basis of their absolute\nmagnitude in J band (MJ (AB)<-20.3 corresponding to Mstellar > 1.5 1010 M )\nand their redshift (0.4 < z < 0.9). A considerable effort was made to ensure that\nour sample is representative of the intermediate mass galaxies at z∼ 0.6. First,\nobservations of their kinematics with VLT/GIRAFFE require the presence of\nthe [OII]λ3726,3729 doublet in their spectra. Flores et al. (2006) and Yang et\nal. (2008a) convincingly demonstrated that for all the targets with W0 ([OII]) >\n15Å, sufficiently high S/N velocity fields may be retrieved after exposure times\nfrom 8 to 24 hours with VLT/GIRAFFE. However, this does not account for\ngalaxies without or with faint emission lines that represent 40% of the galaxies\nat z∼ 0.6 (e.g. Hammer et al., 1997). These galaxies are quiescent galaxies\nmostly made of E/S0 and quiescent spirals (e.g. Zheng et al. 2005; Delgado\net al. 2009, in preparation). In the following they will be considered as having\nrelaxed kinematics, either supported by dispersion or by rotation. Second we\nhave verified that our sample is representative of the galaxy luminosity function\nobserved at z∼ 0.6 (see e.g. Ravikumar et al, 2007). In the latter study it was\nshown that the luminosity density in UV, near-IR and mid-IR of our sample is\nindeed representative of the median value observed in the same redshift range.\nThird, galaxies were selected in 4 different fields of view (Yang et al. 2008)\nto minimise possible cosmological variance effects.Thus our sample is mostly\nlimited by the Poisson statistical variance related to the number of galaxies with\nresolved kinematics. Notice that it is by far the much larger existing sample of\ndistant galaxies with spatially resolved kinematics, because GIRAFFE at VLT\nis still the unique multi-IFU spectrograph allowing the observation of 15 galaxies\nat the same time.\nAn important step is the methodology used in identifying the nature of the\nvelocity fields of distant galaxies. Because of their distances, the GIRAFFE IFU\ncannot resolve rotation curves as it can be done for local galaxies. This had let\nFlores et al. (2006) to propose a robust method to classify their velocity fields by\nusing the supplementary information of their dispersion maps. To illustrate this,\nlet us consider a rotating disk. In its outskirts the dispersion map with 0.52 arcsec pixel (∼ 3 kpc) is able to recover the random motions within the disk, while\nin the centre it samples the convolution of these motions with the large gradient\nof the rotational curve. This unavoidably results in a dispersion peak located\nat the mass centre, in the middle of the two extrema velocities. A diagnostic\ndiagram thus tests the discrepancy of the dispersion peak both in location and\nintensity, through a comparison with expectations from the observed/modeled\nvelocity field (see details in Flores et al., 2006; Yang et al., 2008a)1 . Notice\nalso that the high spectral resolution of GIRAFFE (R∼13000) ensures a proper\nremoval of sky lines, the large exposure time warrants a very high S/N (>3 for\neach pixel, average of 10) and and the presence of the [OII]λ3726,3729 doublet\nprovides reproducible measurements of the kinematics.\n\n1\n\nThis has been allowed by the absence of cross talks in the GIRAFFE design.\n\n\f3\n\nFigure 1.\nImages of z∼ 0.6 galaxies are combined b+v, i and z frames\nfrom HST/ACS. On each galaxy are superimposed the dynamical axis (dotted lines) and the dispersion peak (box with vertical size of 0.5 arcsecond).\nMorphological and kinematics classifications from Neichel et al (2008) and\nYang et al (2008), respectively.\n\nThree kinds of velocity fields were retrieved by Flores et al. (2006), including\nrotating disks (rotation axis following the main optical axis and dispersion peak\nin the centre), perturbed rotations (rotation axis following the main optical axis\nbut offset of the dispersion peak) and complex kinematics (kinematical axis not\naligned with the optical axis, or chaotic velocity fields and dispersion maps).\nExamples can be found in Flores et al. (2006), Puech et al. (2006), Yang et\nal. (2008a) and Figure 1. It results that among the 63 velocity fields studied in\nYang et al., 32% are rotationally supported, 25% are perturbed rotation, 43%\nare complex. Notice that 9% are too compact for being resolved with GIRAFFE\nand in the following, they are assumed to follow the same distribution than the\nabove. Accounting for the whole population of z∼ 0.6 galaxies, this reveals 33%\nof rotating disks, while 41% have anomalous kinematics, including 26% with\ncomplex velocities. GIRAFFE is only sensitive to large scale motions and not\nto small variations as those caused by bars or by ordinary warps. Thus galaxy\nkinematics evolve strongly since the last 6 Gyrs (Yang et al., 2008a). Galaxies\nwith anomalous kinematics are responsible for all the observed dispersion of the\nTully-Fisher relation at z∼ 0.6 (Flores et al. 2006; Puech et al. 2008a): it\nevidences how strong their kinematics are perturbed.\n3.\n\nHalf of the present-day spirals had peculiar morphologies and\nanomalous kinematics, 6 Gyr ago\n\nThe fields in which IMAGES galaxies have been studied all possess deep and\nhigh resolution imaging with two to four colours, mostly from deep exposures\nwith HST/ACS. For a spiral galaxy, this ensures that we are able to identify\ngalaxy morphological features within the optical radius up to z=0.5. Neichel\net al. (2008) described a semi-automatic decision tree to classify the distant\ngalaxy morphologies, based on the systematic use of the GALFIT software, of\nthe calibrated and S/N weighted colour maps (Zheng et al., 2005) and finally\nvisual inspections by three independent co-workers. We chose a very conservative method to classify galaxy morphology, keeping in mind the well known\nmorphologies of local galaxies that populate the Hubble sequence. For example,\nwe did not try to evaluate the morphology of compact galaxies (classified as\ncompact), all galaxies for which the GALFIT sofware failed were classified as\npeculiar or merger, and we further imposed that spiral galaxies, whenever they\npossess a bulge, it should have a redder colour than the disk.\nApplying this classification to emission line galaxies observed by GIRAFFE,\nwe find only 29% of spiral galaxies. We have thus compared our morphologi-\n\n\f4\nTable 1.\nMorpho-kinematical classification of z∼ 0.6 galaxies from Neichel\net al.; for comparison, the last column shows the fractions derived from the\nSDSS (Nakamura et al; 2004) for galaxies in the same mass range.\n\nE/S0\nRotating spiral\nPeculiar/comp./merger\n\n0%\n27%\n73%\n\nz ∼ 0.6\nW0 (OII) <15Å\nZheng et al.\nDelgado et al.\n57%\n43%\n0%\n\nWith anomalous kinematics\n\n68%\n\n0%\n\nType\n\nz ∼ 0.6\nW0 (OII) ≥15Å\nNeichel et al.\n\nz ∼ 0.6\nall galaxies\nNeichel et al.\n\n41%\n\n23%\n33%\n44%\n\nlocal\ngalaxies\nNakamura et al.\nHammer et al.\n27%\n70%\n∼ 3%\n\ncal classification to that of their kinematics, and found a remarkable agreement\n(e.g. Neichel et al., 2008). Almost all (95%) but one galaxy with complex velocity fields have peculiar, compact or merger morphologies and most galaxies\n(80%) with rotational velocity fields have spiral morphologies. Such an excellent agreement brings a considerable support to our conservative classification\nscheme. It should not be very sensitive to star formation since all the GALFIT\nmeasurements were done in the observed z band (rest-frame V band at z∼ 0.7).\nIn contrast, semi-automatic classification methods such as C-A or Gini-M20 are\nnot predictive of their kinematics and strongly overestimate the number of spiral\ngalaxies.\nThe combination of morphological and kinematical classifications results\nin a quite small fraction (16%) of rotational spiral disks with emission lines\n(W0 (OII) ≥ 15Å). Table 1 summarises the statistics at z∼ 0.6 and compares\nthem to local galaxies from SDSS (Nakamura et al.). We were conservative\nin doing such a comparison assuming that rotating spirals should have spiral\nmorphologies and have a rotating velocity field. Similar statistics combining\nkinematics and morphology does not exist for local galaxies, although this is in\nprogress (Puech et al., 2009, in preparation).\nTable 1 evidences that E/S0 were mostly in place at z∼ 0.6, while half of\nrotating spirals were not. Six Gyrs ago, half of the local spirals had peculiar\nmorphologies and anomalous kinematics. This result supersedes earlier results\nfrom Lilly et al. (1998) which were based on lower spatial resolution and S/N\nimagery, without kinematics. Most of the star formation is related to LIRGs\nthat number density evolves also considerably (by factors 30 to 40, e.g. Elbaz\nand Cesarsky, 2003). Thus spiral galaxies are aggregating half of their stellar\nmasses during violent star formation episodes (Hammer et al. 2005), and half\nof them are transformed from unstable kinematics and peculiar morphologies\nto regular, relaxed galaxies dominated by thin disks. This suggests that galaxy\ncollisions and their reminiscence may play a major role during the elaboration\nof their disks. Another line of support for such a suggestion is provided by\nRodrigues et al. (2008, see also Rodrigues et al., this volume). The evolution of\nchemical abundance of the gaseous phases of galaxies shows a linear slope from\nz=0 to z=3, in strong contradiction with close box models that predict a much\nmoderate evolution at z=0.4-0.8. Thus galaxies are not isolated systems and are\nexchanging gas, as expected during interactions.\n\n\f5\n4.\n\nThe elaboration of disk galaxies and of the Hubble sequence: disk\nrebuilt after mergers?\n\nThere is a considerably growing set of evidences that the elaboration of disks\nis linked with galaxy mergers. The spiral rebuilding scenario was proposed by\nHammer et al. (2005) to explain the observations of distant galaxies, including\nthe simultaneous evolution of the global stellar mass, Luminosity-Metallicity\nrelationship, pair statistics, IR light density, colors of spiral cores and number\ndensity of peculiar galaxies. This is supported by a similar evolution of their\nkinematics. Since Barnes et al. (2002), simulations have shown that under the\ncondition of enough large gas content (generally fgas ≥ 50%), major mergers\nmay lead to the formation of a new disk (Robertson et al., 2006; Governato et\nal., 2007; Hopkins et al., 2008). Such high gas fractions are currently observed\nin the distant Universe at z∼ 2 (Erb et al. 2007) and even at z∼ 1 (Liang et al.\n2006; Rodrigues et al. 2008).\nIs the high fraction of anomalous kinematics consistent with a merger hypothesis? The most robust quantity derived to estimate the merger rate is the\npair fraction of intermediate mass galaxies at z∼ 0.6, for which all studies find\n5±1% (see e.g. Bell et al., 2006 and more recently, Lotz et al. 2008; Rawat et al.\n2008). At first glance this appears to be contradictory with the higher fraction\n(26%) of galaxies with complex kinematics. However the latter are found in\npairs or could be merger remnants, so they could be quite numerous. Galaxy\nsimulations predict a relatively small time scale for pairs to merge(τpair =0.35-0.5\nGyrs for M* galaxies). There are 5 times more galaxies with complex kinematics\nthan galaxies in pairs: this is consistent if the complex velocity fields are related\nto merging, either during the first interaction in the pair or during the remnant\nphase. Such a reminiscence phase duration would be: τremnant = 3-5 × τpair .\nSuch values (τremnant = 1.2-2 Gyrs) are indeed predicted by simulations of gas\nrich mergers to rebuilt significant disks (e.g. Robertson et al., 2006; Governato\net al., 2007; Hopkins et al., 2008).\nIs the merger hypothesis consistent with the evolution of Tully Fisher relation and angular momentum? Puech et al. (2007a) have shown that galaxies\nwith anomalous kinematics are outliers in the Tully Fisher and the jdisk -Vrot\nrelations. They demonstrated that major mergers can easily explain such a deviation during which galaxies are experiencing a random walk evolution in such\nplanes.\nHow this could be reconciled with the past history of the Milky Way? The\nMilky Way disk is well known to have not been impacted by significant collisions\nsince z=3-4. However, many evidences show that other spirals in the same mass\nrange (e.g. M31, M81) have had a much more tumultuous past history (Ibata et\nal. 2005; Brown et al., 2008 and in this volume, Davidge, 2008). By comparing\nMilky Way properties to those of other spirals from the SDSS, Hammer et al.\n(2007) have shown that the Milky Way is rather exceptional, having a too small\nradius, angular momentum and stellar mass. Only 7±1% of local spirals are\nMilky Way-like, conversely to M31 which is a rather ordinary spiral. Milky Way\ncould be even more exceptional: it is still the only known galaxy in its mass\nrange with an essentially primordial halo.\n\n\f6\n5.\n\nModelling z ∼ 0.6 galaxies with a similar accuracy than for local\ngalaxies and concluding remarks\n\nWhether galactic disks have been produced as a by product of the last major\nmerger may considerable change the theory of galaxy formation by superseding\nthe tidal torque theory. Hopkins et al. (2008) have demonstrated that most\nof the process in the disk rebuilding phase is fundamentally dynamical, while\nfeedback mostly remove part of the gas at large radii and preserve the disk\nfrom fragmentation. A crucial test is to examine with sufficient details the real\ngalaxies and derive their accurate properties.\nAt z∼ 0.6, the IMAGES galaxies sample an epoch of decreasing star formation, although significantly higher than at present epoch. To examine them we\nhave a huge amount of details provided by the combination of their kinematics\nat ∼ 3kpc scales, their morphologies at ∼ 200 pc scales, their star formation\nrate (from Spitzer/MIPS photometry), and their stellar population properties\n(from their VLT/FORS2 spectra). For example Puech et al. (2007b) have been\nable to identify the impact of a 1:18 satellite infall in J033226.23-274222.8 at z=\n0.66713 (see Figure 1, third panel), which is reponsible for only a small fraction\nof the star formation activity in this galaxy. The modelling of z∼ 0.6 galaxies\nmay be done following the steps of former models of nearby systems. The giant\nand star-bursting bar as well as the complex kinematics of J033239.72-275154.7\n(see Figure 2) has been modelled by Peirani et al. (2008) by a 1:3 merger, the\nresulting galaxy being an S0a . Yang et al. (2009, submitted) has shown that for\nJ033210.76-274234.6 (see Figure 1, fifth panel), the 1:6 satellite has impacted the\nmain galaxy with a very inclined orbit and near its core, letting the disk survive\nto the collision. Hammer et al. (2009) show that a compact LIRG (J033245.11274724.0 at z=0.43462, see Figure 2) may have all its very peculiar properties\n(disk redder than the bulge, dynamical axis well offset from the optical main\naxis) reproduced by a 1:1 gaseous rich merger remnant leading to a Sc galaxy.\nPuech et al. (2008b, see arXiv0811.3893) has identified that for a significant\npart of J033241.88-274853.9, a gas rich galaxy at z=0.66702, the gas is ionised\nby shocks, revealed to large gas dispersions, which is predicted by a model of a\n1:1 gas rich merger remnant.\nMore detailed analyses are in progress. Having been done for a representative mass selected sample of galaxies at z∼ 0.6, they will definitively probe\nwhether the present-day Hubble sequence has been elaborated from the last major merger, from ellipticals to late type spirals. Comparison with state of the art\nsimulations would be invaluable for understanding the detailed paths of angular\nmomentum built-up, the influence of gas viscosity, the way the expelled material\ncan be re-accreted during the post-merger stage and possibly the formation of\nbars, rings and other spiral disk features. A detailed examination of the physics\nof the galaxy formation is now within our range: we may revisit how the Hubble sequence has been elaborated as well as how disks have acquired their large\nangular momentum and thin disks.\nAcknowledgments. I express my gratefulness to the organisers, the administrative\npersons and students for organising such an excellent meeting.\nReferences\nBarnes, J.E. 2002, MNRAS, 333, 481\n\n\f7\nBell, E. F. et al. 2006, ApJ, 652, 270\nBrown, T., et al. 2008, ApJ, 685, 121\nDavidge, T. et al. 2008, PASP, 120, 1145\nDickinson, M. et al. 2003 ApJ587, 25\nElbaz, D. & Cesarsky, C. J. Science 300, 270-274 (2003)\nErb, D. K. et al. 2006, ApJ, 644, 813\nFlores, H. et al. 2006, A&A, 455, 107\nFontana, A. et al. 2003 ApJ594, 9\nGovernato, F. et al. 2007, MNRAS, 374, 1479\nHammer, F. et al. 1997, ApJ, 481, 49\nHammer, F. et al. 2005, A&A, 430, 115\nHammer, F. et al. 2007, ApJ, 662, 322\nHammer, F. et al. 2009, A&A, in press (arxiv/0901.0718)\nHeavens, A. et al. 2004 Nature 428, 625\nHopkins, P. et al. 2008, ApJ, accepted (arxiv/0806.2861)\nIbata, R. et al. 2005, ApJ, 634, 287\nLiang, Y. C., Hammer, F., & Flores, H. 2006, A&A, 447, 113\nLilly, S. et al. 1998, ApJ, 500, 75\nLotz, J. M. et al. 2008, ApJ, 672, 177\nMaraston, C. et al. 2006, ApJ, 652, 85\nNakamura et al. AJ 127, 2511N (2004)\nNeichel, B., et al. 2008, A&A, 484, 159\nPeirani, S. et al. 2008, A&A, in press (arxiv/0812.1593)\nPuech, M. et al. 2006, A&A, 455, 119\nPuech, M. et al. 2007, A&A, 484, 173\nPuech, M. et al. 2007, A&A, 476, 21\nPuech, M. et al. 2008, A&A, 484, 173\nPuech, M. et al. 2008, A&A, in press (arXiv0811.3893)\nRavikumar, C. et al. 2008, A&A, 465, 1099\nRawat, A. et al. 2008, ApJ681, 1089\nRobertson, B. et al. 2006, ApJ, 645, 986\nRodrigues, M. et al. 2008, A&A, 492, 371\nYang, Y. et al. 2007, A&A, 477, 789\nZheng, X. Z. et al. 2005, A&A, 435, 507\n\n\f8\n\nFigure 2.\nMorphologies and kinematics (same symbols than in Figure 1)\nfor two distant galaxies. On the left, J033239.72-275154.7 at z=0.4158\n(modelled with GADGET2 including velocity field in the bottom); on the\nright, J033245.11-274724.0 at z=0.43462 (bottom: modelled with ZONE from\nBarnes et al, 2002, with dispersions seen in red colors).\n\n\f"}