{"id": "http://arxiv.org/abs/0711.1804v1", "guidislink": true, "updated": "2007-11-12T17:56:16Z", "updated_parsed": [2007, 11, 12, 17, 56, 16, 0, 316, 0], "published": "2007-11-12T17:56:16Z", "published_parsed": [2007, 11, 12, 17, 56, 16, 0, 316, 0], "title": "Transverse $Λ^0$ polarization in inclusive quasi-real\n  photoproduction at the current fragmentation", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0711.1366%2C0711.3047%2C0711.4461%2C0711.4977%2C0711.2505%2C0711.4726%2C0711.1517%2C0711.3194%2C0711.0090%2C0711.1824%2C0711.3135%2C0711.2725%2C0711.3998%2C0711.0596%2C0711.2980%2C0711.3168%2C0711.0112%2C0711.4017%2C0711.1315%2C0711.4983%2C0711.2218%2C0711.1017%2C0711.1687%2C0711.2240%2C0711.3221%2C0711.4991%2C0711.1590%2C0711.3853%2C0711.1195%2C0711.1203%2C0711.4936%2C0711.0357%2C0711.2490%2C0711.1990%2C0711.1301%2C0711.3621%2C0711.4906%2C0711.1128%2C0711.0556%2C0711.5004%2C0711.3013%2C0711.3009%2C0711.2696%2C0711.0413%2C0711.1795%2C0711.1403%2C0711.2877%2C0711.1925%2C0711.3538%2C0711.4561%2C0711.1804%2C0711.4473%2C0711.2402%2C0711.1331%2C0711.1471%2C0711.2715%2C0711.3254%2C0711.3197%2C0711.2897%2C0711.3293%2C0711.2507%2C0711.2734%2C0711.0972%2C0711.1102%2C0711.0958%2C0711.0506%2C0711.3832%2C0711.3176%2C0711.0670%2C0711.3762%2C0711.2898%2C0711.0328%2C0711.1568%2C0711.0078%2C0711.4538%2C0711.0998%2C0711.4358%2C0711.0351%2C0711.2457%2C0711.1294%2C0711.1806%2C0711.3156%2C0711.1305%2C0711.1778%2C0711.3307%2C0711.3893%2C0711.1783%2C0711.4940%2C0711.1510%2C0711.3019%2C0711.2867%2C0711.1528%2C0711.1117%2C0711.1258%2C0711.3563%2C0711.3344%2C0711.2390%2C0711.4418%2C0711.4813%2C0711.1274%2C0711.1038&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Transverse $Λ^0$ polarization in inclusive quasi-real\n  photoproduction at the current fragmentation"}, "summary": "It is shown that the recent HERMES data on the transverse $\\Lambda^0$\npolarization in the inclusive quasi-real photoproduction at $x_F>0$ can be\naccommodated by the strange quark scattering model. Relations with the quark\nrecombination approach are discussed.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0711.1366%2C0711.3047%2C0711.4461%2C0711.4977%2C0711.2505%2C0711.4726%2C0711.1517%2C0711.3194%2C0711.0090%2C0711.1824%2C0711.3135%2C0711.2725%2C0711.3998%2C0711.0596%2C0711.2980%2C0711.3168%2C0711.0112%2C0711.4017%2C0711.1315%2C0711.4983%2C0711.2218%2C0711.1017%2C0711.1687%2C0711.2240%2C0711.3221%2C0711.4991%2C0711.1590%2C0711.3853%2C0711.1195%2C0711.1203%2C0711.4936%2C0711.0357%2C0711.2490%2C0711.1990%2C0711.1301%2C0711.3621%2C0711.4906%2C0711.1128%2C0711.0556%2C0711.5004%2C0711.3013%2C0711.3009%2C0711.2696%2C0711.0413%2C0711.1795%2C0711.1403%2C0711.2877%2C0711.1925%2C0711.3538%2C0711.4561%2C0711.1804%2C0711.4473%2C0711.2402%2C0711.1331%2C0711.1471%2C0711.2715%2C0711.3254%2C0711.3197%2C0711.2897%2C0711.3293%2C0711.2507%2C0711.2734%2C0711.0972%2C0711.1102%2C0711.0958%2C0711.0506%2C0711.3832%2C0711.3176%2C0711.0670%2C0711.3762%2C0711.2898%2C0711.0328%2C0711.1568%2C0711.0078%2C0711.4538%2C0711.0998%2C0711.4358%2C0711.0351%2C0711.2457%2C0711.1294%2C0711.1806%2C0711.3156%2C0711.1305%2C0711.1778%2C0711.3307%2C0711.3893%2C0711.1783%2C0711.4940%2C0711.1510%2C0711.3019%2C0711.2867%2C0711.1528%2C0711.1117%2C0711.1258%2C0711.3563%2C0711.3344%2C0711.2390%2C0711.4418%2C0711.4813%2C0711.1274%2C0711.1038&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "It is shown that the recent HERMES data on the transverse $\\Lambda^0$\npolarization in the inclusive quasi-real photoproduction at $x_F>0$ can be\naccommodated by the strange quark scattering model. Relations with the quark\nrecombination approach are discussed."}, "authors": ["I. Alikhanov", "O. Grebenyuk"], "author_detail": {"name": "O. Grebenyuk"}, "author": "O. Grebenyuk", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1140/epjc/s10052-007-0502-5", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/0711.1804v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0711.1804v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "5 pages, 3 figures, accepted by Eur. Phys. J. C", "arxiv_primary_category": {"term": "hep-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "hep-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0711.1804v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0711.1804v1", "journal_reference": "Eur.Phys.J.C54:123-127,2008", "doi": "10.1140/epjc/s10052-007-0502-5", "fulltext": "accepted by Eur. Phys. J. C\n\narXiv:0711.1804v1 [hep-ph] 12 Nov 2007\n\nTransverse Λ0 polarization in inclusive quasi-real photoproduction\nat the current fragmentation\nI. Alikhanov1a and O. Grebenyuk2\n1\n2\n\nSaint Petersburg State University, Saint Petersburg 198904, Russia\nPetersburg Nuclear Physics Institute, Leningrad District, Gatchina 188350, Russia\n\nAbstract. It is shown that the recent HERMES data on the transverse Λ0 polarization in the inclusive\nquasi-real photoproduction at xF > 0 can be accommodated by the strange quark scattering model.\nRelations with the quark recombination approach are discussed.\nPACS. 13.60.-r – 13.88.+e\n\n1 Introduction\nPolarization of Λ0 hyperons has been under scrutiny almost since the very moment of its discovery. Investigations\nof the phenomenon received especially great impetus in\n1976 due to the striking experimental results obtained at\nFERMILAB, where the hyperons produced in pN collisions at 300 GeV proton beam energy were highly polarized [1]. The polarization was transverse and negative, directed opposite to the unit vector n ∝ [pb × pΛ ], where pb\nand pΛ are the beam and hyperon momenta, respectively.\nOnly this direction is allowed by the parity conservation in strong interactions provided the incident particles\nare unpolarized (henceforth, under polarization we imply\njust transverse one unless otherwise stated). The results\nturned out to be in disagreement with predictions of perturbative QCD, no polarization had been expected to play\nany significant role in high energy processes as the helicity\nis conserved in the limit of massless quarks.\nThe polarization has been also observed in other hadronhadron reactions at different kinematic regimes [2]. Its\nfeatures qualitatively coincide in almost all the reactions,\nfor instance, being insensitive to the incident particle energy, exhibiting roughly linear growth by magnitude with\nthe hyperon transverse momentum pT and being negative.\nThe only known exception is the K − p process, where the\npolarization sign has been found to be positive [3].\nCertainly, there have been proposed many models attempting to account for the results, e.g. [4,5,6,7,8,9,10,\n11,12,13,14,15,16], however neither of them is able to describe the complete set of the available measurements.\nThe Λ0 wave function facilitates theoretical studies allowing to describe the phenomenon in a reasonable way.\nThe exact SU(6) symmetry, requires the spin-flavor part\nof the wave function to be combined of the ud diquark\na\n\ne-mail: ialspbu@mail.ru\n\nin a singlet spin state and the strange quark of spin 1/2,\nor formally |Λi1/2 = |udi0 |si1/2 , where the subscriptions\ndenote the spin states. Therefore, the total spin of Λ0 is\nentirely given by the spin of its valence s quark. There is\nalso an alternative look at the spin transfer in fragmentation appeared after publication of the polarized deep inelastic lepton-nucleon scattering (DIS) data of the EMC\nCollaboration [17]. It suggests that the spin carried by the\nvalence quarks is only a part of the total nucleon spin, the\nrest one being attributed, for example, to the orbital angular momenta of the valence quarks and to the nucleon\nsea (sea quarks, antiquarks and gluons). Which picture,\nSU(6) or DIS, is suitable for the description of the process\nremains still an important issue [18,19,20,21,22,23]. The\nΛ0 hyperon can provide here a useful instrument for the\nstudy of the spin effects in strong interactions.\nWe used the SU(6) approach throughout this paper.\nThe choice was dictated by a wish to keep the quark scattering model as it is, encouraged by the SU(6) based calculations of the longitudinal Λ0 polarization in e+ e− annihilation at the Z 0 pole [24] and their successful experimental\nverification [25,26].\nAccording to the empirical rules proposed by DeGrand\nand Miettinen, the polarization sign depends on whether\nthe s quark is accelerated (increases its energy) or decelerated (decreases its energy) in the Λ0 formation process\n[5]. To illustrate, there are no valence s quarks in the initial state of the pp reaction so that they come from the\nquark sea to form the final Λ0 . But the sea quarks predominantly populate small x-states (x is Bjorken variable) and\nconsequently increase their average energy coming in the\nvalence content of Λ0 . Here the polarization is negative.\nContrary, incident pseudoscalar kaons of the K − p reaction already contain valence strange quarks mostly decelerated in the hadronization because the average energy of\nthe created Λ0 -s is less than that of the K − beam. In this\n\n\fI. Alikhanov, O. Grebenyuk: Transverse Λ0 polarization in quasi-real photoproduction\n\n2\n\ncase the sign is positive. Similar ideas were implemented\nin flux-tube models with orbital angular momentum [4].\nIt was natural to wonder whether the polarization took\nplace in Λ0 electro and/or photoproduction. Would one\nobserve here the same features with hadron-hadron reactions? These questions have been investigated, for example, in experiments on high energy γN scattering performed at CERN [27] and SLAC [28] in the beginning of\nthe eighties. However, their statistical accuracy is indecisive and would hardly enable one to conclude on the\nmagnitude or on the sign of the polarization.\nThe transverse Λ0 polarization has been also measured in unpolarized e+ e− annihilations, for example, by\nTASSO Collaboration at 14, 22 and 34 GeV center-ofmass (cms) energies [29] and near the Z 0 pole by OPAL\n[26]. The polarization observed in both experiments is\nconsistent with zero. Practically, this process can be a\ngood place for deriving some important information on\nthe hadronization phase. In particular, it can assist understanding in which extent final state interactions contribute\nto the transverse polarization [30].\nIn light of the scarce statistics for the Λ0 photoproduction process, the HERMES experiments on the 27.6 GeV\npositron beam scattering off the nucleon target acquires a\nparticular status providing a good opportunity for observation of the polarization in electroproduction. The collaboration has measured nonzero positive transverse polarization, when most of the intermediate photons are quite\nclose to the mass shell, i.e. Q2 = −(pei − pef )2 ≈ 0 GeV2\n[31], where pei and pef are the 4-momenta of the initial\nand scattered electrons, respectively (quasi-real photoproduction).\nExperimental properties of the polarization at HERMES turned out to be very reminiscent of those in the\nK − p reaction [3], which has been successfully described\nby a model assuming the polarization to appear mostly\nvia strange quark scattering in a color field [6,7].\nThus, there are indications that mechanisms responsible for the phenomenon in the K − p and ep may be similar,\nat least, within the covered kinematic region. These arguments inspired us to apply the model to the Λ0 quasi-real\nphotoproduction data obtained by HERMES.\nAnother goal of this paper is qualitatively to discuss\nsome relations between the calculations presented herein\nand the quark recombination model (QRM) [14].\n\nElectrons, when scattering off nuclei, have been known\nto be able to acquire polarization. Analytically, it can\nbe found within QED by considering a process of Dirac\npointlike particle scattering off static Coulomb potential\nprovided next-to-leading order amplitudes are taken into\naccount [32,33] (see also Ref. [34]). The corresponding formula reads\nsin3 θ/2 ln(sin θ/2)\n2αem mp\nn,\nE 2 [1 − p2 /E 2 sin2 θ/2] cos θ/2\n\nζi(f ) =\n\nEi(f ) + pzi(f )\n,\nEb + pzb\n\n(2)\n\nhere the subscription b denotes the beam. We note that ζ\nis invariant under Lorentz boosts being useful in its application.\nAccording to recipes given in Ref. [7], one should move\nto a frame, where the magnitudes of the initial and final s\nquark momenta are the same (originally called S-frame).\nIt is reached by performing a Lorentz transformation along\nthe proton momentum. For this purpose, one can write\n(pi * pf ) = p2 (1 − cos θ) + m2s ,\n\n(3)\n\npT f = pT = p sin θ,\n\n(4)\n\nwhere pi(f ) are the 4-momenta of the scattering quark,\npT f is the transverse momentum of the scattered quark\n−\nin the\np center-of-mass frame of the K p reaction, while\n2\n2\np = E − ms , pT and θ refer to the S-frame.\nOn the other hand, using Eq. (2) leads to\nm2s (ζi − ζf )2\n2\nζi ζf\n\u0014\n\u0015\n1 2 ζf\n2 ζi\np\n+ (pT i * pT f ),\n+ pT f\n+\n2 T i ζi\nζf\n\n(pi * pf ) − m2s =\n\n2 Quark scattering model for Λ0\n\nP =\n\nwhere E, p, m and θ are the energy, momentum by magnitude, mass and scattering angle of the electron, respectively, αem is the fine structure constant, n ∝ [pi × pf ],\npi and pf are the vectors of the electron momenta in the\ninitial (i) and final (f ) states.\nIn Ref. [6], Szwed proposed to explain the Λ0 polarization as polarization of its valence strange quark in scattering using Eq. (1), the Λ0 wave function favors such a\nconsideration quite well. The idea is to perform the following interchanges in Eq. (1): electron ↔ quark, αem ↔\nCαs (Coulomb potential ↔ color field), where αs is the\nstrong coupling and C is the color factor.\nThis approach has been applied to describe the polarization in the K − p reaction and successfully reproduced\nits main features at 2Cαs = 5.0 and the s quark mass\nms = 0.5 GeV [7].\nDue to some peculiarities of the HERMES experiment,\nthe polarization was not measured√in the traditional form\nof the dependence on xF = 2pz / s (pz is the longitude\n√\ncomponent of the detected particle momentum, s is the\ntotal cms energy). Therefore, we have expressed the model\nin terms of the light cone variable ζ the available data\ndepend on [31]. It is defined as\n\n(1)\n\n(5)\n\nwhere (pT i * pT f ) is the ordinary scalar product of the\ntransverse momentum vectors.\nNeglecting, as a first approximation, the incident quark\ntransverse momentum (pT i =0), after some algebra, one\ncan obtain from Eqs. (3)-(5) that\ncos\n\nθ\nξVT2\n=\n,\n2\n(1 − ξ)2 + VT2\n\n(6)\n\n\fI. Alikhanov, O. Grebenyuk: Transverse Λ0 polarization in quasi-real photoproduction\n\nf(ζi)\n\n(7)\n\nwith the variables V(T ) , and ξ defined by\nV(T )\n\np(T )\n,\n=\nms\n\nζf\nξ= .\nζi\n\n(8)\n\narbitrary value\n\n(1 − ξ)2 + VT2\nV = √ p\n,\n2 ξ (1 − ξ)2 + (1 − ξ)VT2\n\n3\n\n2500\n\nPYTHIA (e\n\n2000\n\ns)\n\nfit\nevents contributing to ζ > 0.25 region\n\n1500\n\nBy using relations (6) and (7), Eq. (1) can be rewritten as\nP (ξ, VT ) = −\n\nsin3 θ/2 ln(sin θ/2)\n2Cαs V\n.\n1 + V 2 cos2 θ/2\ncos θ/2\n\n1000\n\n(9)\n500\n\nNote that the minus sign in Eq. (9) appeared to satisfy\nthe rule of DeGrand and Miettinen in the region of our\ninterest (ξ < 1).\n\n0\n0.3\n\n0.4\n\n0.5\n\n0.6\n\n0.7\n\n0.8\n\n0.9\n\n1\n\nζi\n\n3 Calculations and results\nOur calculations concern the polarization in the region\nof 0.25 . ζΛ . 0.5, which, according to Ref. [31], corresponds to the events of xF > 0 in the cms frame of\nthe γ ∗ p reaction (current fragmentation). The procedure\nis now straightforward. In the model discussed above, one\nsubstitutes the K − meson by the intermediate quasi-real\nphoton γ ∗ . Since the considered hyperons are produced in\nthe photon fragmentation region, we assumed that the Λ0\nkinematic is determined here in the main by the quarks\noriginated from the photon. The (ud)0 diquarks are supposed to come mostly from the proton target. The polarization process is schematically shown in Fig. 1. Note that\na similar diagram, corresponding to the s quark scattering\noff the scalar diquark (ud)0 , appears also in the QRM [14]\nwhen one calculates the polarization in the K − p reaction,\nhowever the interaction is chosen to be scalar.\n\nFig. 1. A schematic diagram of the Λ0 polarization process in\nquasi-real photoproduction. The s quarks originated from the\nphoton scatters off the target color field, getting thus polarized,\nand form the final hyperon recombining with a (ud)0 diquarks\nfrom the proton target. An arrow over a letter indicates the\npolarization.\n\nWithin the present approach, one needs to know the\nζi distribution of the incident s quarks originated from\nthe quasi-real photons emitted by the positron beam. To\nfind it, we used the PYTHIA 6.2 program [35], adopting\nthus the positron-to-quark transition mechanisms implemented therein. The obtained distribution is shown in Fig.\n2 (scattered plot) together with its fit (solid line).\n\nFig. 2. The ζi distribution of the quarks originated from the\npositron beam according to the PYTHIA program (scattered\nplot). The corresponding fit is presented by the solid line.\nEvents assumed to contribute to the region of ζ > 0.25 are\nhatched.\n\nThe final s quark kinematic was determined according\nto the following\nζf =\n\nms\nζΛ ,\nmΛ\n\nVT =\n\npT Λ\n,\nmΛ\n\n(10)\n\nwhere ζΛ and pT Λ refer to the detected Λ0 hyperons. Let\nus omit in the sequel the index Λ. The relations in Eq.\n(10) define the quark momenta as fixed fractions of the\ncorresponding final hyperon momenta. In particular, the\ndirection of the s quark transverse momentum is assumed\nto point in most cases in the direction of pT Λ [6]. It is,\nof course, only an approximate picture. One should take\ninto account that the quarks are just constituents of the\nhyperon but not free. In fact, a momentum component of\na quark inside a hadron is not fixed but has an intrinsic\ndistribution.\nNote that there should be a threshold for the Λ0 production in the region of ζ > 0.25 initiated by the incoming\nquarks due to the undetected hadron system always exists and carries also away some part of the energy. In other\nwords, not all the ζi events will contribute to the ζ > 0.25\nregion. Thus, in the calculations, we took into account\nonly those quarks with 0.5 ≤ ζi ≤ 1 (hatched area in Fig.\n2).\nAs the experimental ζ dependence of the polarization\nis available integrally over pT , we additionally introduced\naveraging over the transverse momentum of the detected\nΛ0 -s. In this case, the polarization was determined as\nPζ =\n\nZ\n\ndζi dpT h(pT )P\n\n\u0012\n\n\u0013\nζ\n, pT f (ζi ).\nζi\n\n(11)\n\nHere, h(pT ) and f (ζi ) are the pT and ζi distribution\nfunctions of the detected Λ0 -s and the incident quarks\n\n\fI. Alikhanov, O. Grebenyuk: Transverse Λ0 polarization in quasi-real photoproduction\n\n4\n\nrespectively, P (ζ/ζi , pT ) is the polarization defined by Eq.\n(9).\nFor similar reasons, we determined the pT dependence\nof the polarization as\n\u0013\n\u0012\nZ\nζ\n(12)\n, pT f (ζi ),\nPpT = dζi dζ g(ζ)P\nζi\n\nPζ (%)\n\nwhere g(ζ) is the ζ distribution function of the detected\nhyperons.\nUsing Eqs. (11) and (12), we carried out the calculations. We used a typical ζ distribution of the detected Λ0 -s\n(0.25 ≤ ζ ≤ 0.5). For h(pT ), we adopted that obtained by\nHERMES (0.2 GeV ≤ pT ≤ 1.2 GeV) [36]. Note that all\nthe distributions were prenormalized to unity. As the free\nparameter values, we have taken 2Cαs = 5.0 and ms = 0.5\nGeV.\nThe numerical results in comparison with the HERMES data are shown in Fig. 3. One can see that the experiment is reasonably reproduced.\n\n12\nHERMES\nnumeric.\n\n10\n8\n\nthe contributions from the heavier resonances, such as Σ 0 ,\nΞ and Σ ∗ , into account, their values are presumably considerable in Λ0 polarization [24,37,38]. A difficulty is also\ncaused by the impossibility to derive the running coupling\nconstant αs from the HERMES data.\nIn fact, the calculations by Eqs. (11) and (12) have\nbeen carried out similarly with the quark recombination\nmodel [14], the latter describes the polarization in more\nquantitative manner. In the QRM, the central point is the\nsquared subprocess amplitude averaged over the Bjorken\nvariables in the initial and final states, their role, in our\ncase, were played by ζi and ζ. A substantial distinction\nbetween the QRM and the present quark scattering approach (QSM) is the interaction. For the QRM, it has\nbeen assumed to be a scalar force, while the QSM calculations are based on QCD. Thus it seems to be attractive\nalternatively to specify the QRM interaction by the color\none. Doing it could be regarded as a further development\nof the present approach. It will include, in particular, the\ntransverse momentum of the incident quarks, the structure functions of the projectile as well as the outgoing\nhyperon instead of the approximations of Eq. (10), it will\nalso more explicate the underlying subprocesses. An estimation of the contributions of the heavier resonances is in\nprogress now.\n\n6\n4\n\nReferences\n\n2\n0\n\nPpT (%)\n\n0\n\n0.1\n\n0.2\n\n0.3\n\n0.4\n\n0.5\n\n0.6\n\nζ\n\n16\n14\n\nHERMES (ζ > 0.25)\n\n12\n\nnumeric.\n\n10\n8\n6\n4\n2\n0\n0\n\n0.2\n\n0.4\n\n0.6\n\n0.8\n\n1\n\n1.2\n\npT (GeV)\n\nFig. 3. Numerical results (lines) in comparison with the HERMES data (solid points). The ζ (pT ) dependence of the Λ0 polarization is presented in the upper (lower) panel. The data are\ntaken from Ref. [31].\n\n4 Conclusion\nThe results obtained herein should be regarded only as\nqualitative. We neglected the transverse momentum of the\nincident quarks (pT i ), while, certainly, a strict consideration would require taking it into account. However, for the\ngoal, the present work aimed at, such an approximation\nreflects the general tendencies. It would be fair to expect a\nrelatively narrow pT i distribution for the events contributing to the region of ζ > 0.25. To find the ζi distribution, we\nused the PYTHIA program, which gives, in turn, rather\nqualitative than quantitative predictions. We did not take\n\n1.\n2.\n3.\n4.\n\nG. Bunce et al., Phys. Rev. Lett. 36, 1113 (1976).\nA. D. Panagiotou, Int. J. Mod. Phys. A 5, 1197 (1990).\nS. A. Gourlay et al., Phys. Rev. Lett. 56, 2244 (1986).\nB. Andersson, G. Gustafson and G. Ingelman, Phys. Lett.\nB 85, 417 (1979).\n5. T. A. DeGrand and H. I. Miettinen, Phys. Rev. D 23, 1227\n(1981).\n6. J. Szwed, Phys. Lett. B 105, 403 (1981).\n7. J. M. Gago R. V. Mendes and P. Vaz, Phys. Lett. B 183,\n357 (1987).\n8. P. Cea, P. Chiappetta, J.-Ph. Guillet and G. Nardulli, Phys.\nLett. B 193, 361 (1987).\n9. M. G. Ryskin, Sov. J. Nucl. Phys. 48, 708 (1988).\n10. T. Fujita and N. Suzuki, Nucl. Phys. A 503, 899 (1989).\n11. J. Soffer and N. A. Törnqvist, Phys. Rev. Lett. 68, 907\n(1992).\n12. R. Barni, G. Preparata and P. G. Ratcliffe, Phys. Lett. B\n296, 251 (1992).\n13. S. M. Troshin and N. E. Tyurin, Phys. Rev. D 55, 1265\n(1997).\n14. Y. Yamamoto, K.-I. Kubo and H. Toki, Prog. Theor. Phys.\n98, 95 (1997).\n15. M. Anselmino, D. Boer, U. D'Alesio and F. Murgia, Phys.\nRev. D 63, 054029 (2001).\n16. Dong Hui and Liang Zuo-tang, Phys. Rev. D 70, 014019\n(2004).\n17. EMC Collaboration, J. Ashman et al., Phys. Lett. B 206,\n(1988) 364; Nucl. Phys. B 328, 1 (1989).\n18. M. Burkardt and R. L. Jaffe, Phys. Rev. Lett. 70, 2537\n(1993).\n19. R. L. Jaffe, Phys. Rev. D 54, R6581 (1996).\n20. C. Boros, Liang Zuo-tang, Phys. Rev. D 57, 4491 (1998).\n\n\fI. Alikhanov, O. Grebenyuk: Transverse Λ0 polarization in quasi-real photoproduction\n21. A. Kotzinian, A. Bravar, D. von Harrach, Eur. Phys. J. C\n2, 329 (1998).\n22. Liu Chun-xiu, Xu Qing-hua, Liang Zuo-tang, Phys. Rev.\nD 64, 073004 (2001).\n23. J. Ellis, A. Kotzinian, D. Naumov, M. Sapozhnikov, Eur.\nPhys. J. C 52, 283 (2007).\n24. G. Gustafson and J. Häkkinen, Phys. Lett. B 303, 350\n(1993).\n25. ALEPH Collaboration, D. Buskulic et al., Phys. Lett. B\n374, 319 (1996).\n26. OPAL Collaboration, K. Ackerstaff et al., Eur. Phys. J. C\n2, 49 (1998).\n27. CERN-WA-004 Collaboration, D. Aston et al., Nucl. Phys.\nB 195, 189 (1982).\n28. SLAC-BC-072 Collaboration, K. Abe et al., Phys. Rev. D\n29, 1877 (1984).\n29. TASSO Collaboration, M. Althoff et al., Z. Phys. C 27, 27\n(1985).\n30. Wei Lu, Phys. Rev. D 51, 5305 (1995).\n31. HERMES Collaboration, A. Airapetian et al.,\narXiv:0704.3133v1.\n32. A. W. McKinley and H. Feshbach, Phys. Rev. 74, 1759\n(1948).\n33. R. H. Dalitz, Proc. R. Soc. (London) A 206, 509 (1951).\n34. W. G. D. Dharmaratna and G. R. Goldstein, Phys. Rev.\nD 53, 1073 (1996).\n35. T. Sjöstrand, L. Lönnblad and S. Mrena, hep-ph/0108264.\n36. HERMES Collaboration, S. Belostotski, O. Grebenyuk\nand Yu. Naryshkin, Acta Phys. Polon. B 33, 3785 (2002).\n37. R. Gatto, Phys. Rev. 109, 610 (1958).\n38. Liang Zuo-tang and Liu Chun-xiu, Phys. Rev. D 66,\n057302 (2002).\n\nList of Figures\n1\n\n2\n\n3\n\nA schematic diagram of the Λ0 polarization\nprocess in quasi-real photoproduction. The\ns quarks originated from the photon scatters off the target color field, getting thus\npolarized, and form the final hyperon recombining with a (ud)0 diquarks from the\nproton target. An arrow over a letter indicates the polarization. . . . . . . . . . . . .\nThe ζi distribution of the quarks originated\nfrom the positron beam according to the\nPYTHIA program (scattered plot). The corresponding fit is presented by the solid line.\nEvents assumed to contribute to the region\nof ζ > 0.25 are hatched. . . . . . . . . . . .\nNumerical results (lines) in comparison with\nthe HERMES data (solid points). The ζ\n(pT ) dependence of the Λ0 polarization is\npresented in the upper (lower) panel. The\ndata are taken from Ref. [31]. . . . . . . . .\n\n3\n\n3\n\n4\n\n5\n\n\f"}