{"id": "http://arxiv.org/abs/1012.5096v2", "guidislink": true, "updated": "2011-02-11T20:54:13Z", "updated_parsed": [2011, 2, 11, 20, 54, 13, 4, 42, 0], "published": "2010-12-22T20:55:57Z", "published_parsed": [2010, 12, 22, 20, 55, 57, 2, 356, 0], "title": "Dislocations Jam At Any Density", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1012.1444%2C1012.0127%2C1012.1961%2C1012.1793%2C1012.4889%2C1012.1225%2C1012.3748%2C1012.1252%2C1012.5287%2C1012.2021%2C1012.5981%2C1012.1747%2C1012.5634%2C1012.0311%2C1012.1010%2C1012.3955%2C1012.5830%2C1012.5534%2C1012.1659%2C1012.0075%2C1012.5468%2C1012.4466%2C1012.0971%2C1012.1074%2C1012.0726%2C1012.5739%2C1012.5790%2C1012.2570%2C1012.5475%2C1012.5798%2C1012.0856%2C1012.0727%2C1012.3441%2C1012.4281%2C1012.0713%2C1012.3200%2C1012.4193%2C1012.2845%2C1012.4320%2C1012.1241%2C1012.1530%2C1012.1154%2C1012.0161%2C1012.2876%2C1012.4013%2C1012.2310%2C1012.3379%2C1012.0927%2C1012.5869%2C1012.1931%2C1012.0004%2C1012.1968%2C1012.1310%2C1012.3316%2C1012.1506%2C1012.0299%2C1012.0170%2C1012.4034%2C1012.5284%2C1012.5676%2C1012.5285%2C1012.3310%2C1012.4720%2C1012.5096%2C1012.2253%2C1012.4199%2C1012.3849%2C1012.1997%2C1012.1856%2C1012.3718%2C1012.4937%2C1012.3279%2C1012.5720%2C1012.4365%2C1012.5433%2C1012.5734%2C1012.1177%2C1012.4322%2C1012.5529%2C1012.2520%2C1012.5377%2C1012.0542%2C1012.5577%2C1012.5693%2C1012.3507%2C1012.2511%2C1012.2824%2C1012.5952%2C1012.0617%2C1012.2066%2C1012.3876%2C1012.2335%2C1012.1329%2C1012.0430%2C1012.5770%2C1012.2904%2C1012.4203%2C1012.3877%2C1012.0414%2C1012.4257%2C1012.1210&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Dislocations Jam At Any Density"}, "summary": "Crystalline materials deform in an intermittent way via dislocation-slip\navalanches. Below a critical stress, the dislocations are jammed within their\nglide plane due to long-range elastic interactions and the material exhibits\nplastic response, while above this critical stress the dislocations are mobile\n(the unjammed phase) and the material fails. We use dislocation dynamics and\nscaling arguments in two dimensions to show that the critical stress grows with\nthe square root of the dislocation density. Consequently, dislocations jam at\nany density, in contrast to granular materials, which only jam below a critical\ndensity.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1012.1444%2C1012.0127%2C1012.1961%2C1012.1793%2C1012.4889%2C1012.1225%2C1012.3748%2C1012.1252%2C1012.5287%2C1012.2021%2C1012.5981%2C1012.1747%2C1012.5634%2C1012.0311%2C1012.1010%2C1012.3955%2C1012.5830%2C1012.5534%2C1012.1659%2C1012.0075%2C1012.5468%2C1012.4466%2C1012.0971%2C1012.1074%2C1012.0726%2C1012.5739%2C1012.5790%2C1012.2570%2C1012.5475%2C1012.5798%2C1012.0856%2C1012.0727%2C1012.3441%2C1012.4281%2C1012.0713%2C1012.3200%2C1012.4193%2C1012.2845%2C1012.4320%2C1012.1241%2C1012.1530%2C1012.1154%2C1012.0161%2C1012.2876%2C1012.4013%2C1012.2310%2C1012.3379%2C1012.0927%2C1012.5869%2C1012.1931%2C1012.0004%2C1012.1968%2C1012.1310%2C1012.3316%2C1012.1506%2C1012.0299%2C1012.0170%2C1012.4034%2C1012.5284%2C1012.5676%2C1012.5285%2C1012.3310%2C1012.4720%2C1012.5096%2C1012.2253%2C1012.4199%2C1012.3849%2C1012.1997%2C1012.1856%2C1012.3718%2C1012.4937%2C1012.3279%2C1012.5720%2C1012.4365%2C1012.5433%2C1012.5734%2C1012.1177%2C1012.4322%2C1012.5529%2C1012.2520%2C1012.5377%2C1012.0542%2C1012.5577%2C1012.5693%2C1012.3507%2C1012.2511%2C1012.2824%2C1012.5952%2C1012.0617%2C1012.2066%2C1012.3876%2C1012.2335%2C1012.1329%2C1012.0430%2C1012.5770%2C1012.2904%2C1012.4203%2C1012.3877%2C1012.0414%2C1012.4257%2C1012.1210&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Crystalline materials deform in an intermittent way via dislocation-slip\navalanches. Below a critical stress, the dislocations are jammed within their\nglide plane due to long-range elastic interactions and the material exhibits\nplastic response, while above this critical stress the dislocations are mobile\n(the unjammed phase) and the material fails. We use dislocation dynamics and\nscaling arguments in two dimensions to show that the critical stress grows with\nthe square root of the dislocation density. Consequently, dislocations jam at\nany density, in contrast to granular materials, which only jam below a critical\ndensity."}, "authors": ["Georgios Tsekenis", "Nigel Goldenfeld", "Karin A. Dahmen"], "author_detail": {"name": "Karin A. Dahmen"}, "author": "Karin A. Dahmen", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1103/PhysRevLett.106.105501", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1012.5096v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1012.5096v2", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "cond-mat.soft", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cond-mat.soft", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "cond-mat.mtrl-sci", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "physics.comp-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1012.5096v2", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1012.5096v2", "arxiv_comment": null, "journal_reference": null, "doi": "10.1103/PhysRevLett.106.105501", "fulltext": "Dislocations Jam At Any Density\nGeorgios Tsekenis, Nigel Goldenfeld and Karin A. Dahmen\nDepartment of Physics, University of Illinois at Urbana-Champaign,\nLoomis Laboratory of Physics, 1110 West Green Street, Urbana, Illinois, 61801-3080.\n\narXiv:1012.5096v2 [cond-mat.soft] 11 Feb 2011\n\nCrystalline materials deform in an intermittent way via dislocation-slip avalanches. Below a critical stress, the dislocations are jammed within their glide plane due to long-range elastic interactions\nand the material exhibits plastic response, while above this critical stress the dislocations are mobile\n(the unjammed phase) and the material flows. We use dislocation dynamics and scaling arguments\nin two dimensions to show that the critical stress grows with the square root of the dislocation\ndensity. Consequently, dislocations jam at any density, in contrast to granular materials, which only\njam below a critical density.\nPACS numbers: 61.72.Hh, 61.72.Ff, 61.72.Lk, 62.20.fq, 89.75.Da, 64.60.av\n\nWhen a crystalline material is sufficiently deformed,\nit undergoes irreversible, or plastic deformation. Traditionally, plastic deformation of crystalline solids has\nbeen considered to be a smooth process in time, and homogeneous in space, since fluctuations are expected to\naverage out at sufficiently large spatial scales. On small\nspatial scales, however, intermittent motion of dislocations is observed, resulting in a pattern of deformation\nthat is spatially inhomogeneous and intermittent in time.\nThis behavior is associated with a coherent motion of the\ndislocations that releases stress by slip avalanches: sequences of events with long-range correlations in space\nand in time. The slip avalanches span several orders of\nmagnitude in size and the energy released is distributed\naccording to a power law [1–6].\nTheoretical models, including discrete dislocation dynamics models [1, 7–11], continuum models [7, 11–13],\nphase field models [11, 14] and phase field crystal models [15] are able to reproduce many of the experimental\nfindings and reveal scale invariant, power-law distributed\nphenomena that are indicative of a non-equilibrium critical point [16]. The dislocation system is jammed below a\ncritical value of the external stress. Applying a constant\nexternal stress above the critical (yield) stress allows the\nsystem to flow, and the dislocations are unjammed. It is\nimportant to stress that in the glide plane of the dislocations, there is effectively no external potential, so that\nthe jamming is an emergent phenomenon. However, recent work has shown that the behavior of the transition\nappears to be in the universality class of the interface\npinning-depinning transition [11, 15], as if there was an\neffective external potential induced by the collective interactions between the dislocations.\nIn this Letter we study connections between the plastic yield point of systems with long range interactions,\nsuch as dislocation systems and the jamming transition\nof systems with short range interactions, such as sheared\ngranular materials and molecular liquids [17–20]. When\na system jams it undergoes a transition from a flowing\nstate (analogous to a depinned phase) to a rigid state\n(analogous to a pinned phase). In contrast to the or-\n\nFIG. 1: (color online) Proposed phase diagram for dislocation\nsystems. Notice the absence of a jamming point.\n\ndered solid phase obtainable via crystallization, the solid\nphase reached via jamming remains disordered. Liu and\nNagel [17], O'Hern et al. [18, 19] and others [20] studied\njamming of granular materials with short range interactions in simulations and experiments. They found that\nbelow a critical density these materials do not jam at any\nstress. This critical density is called the jamming point\nJ of granular materials. In contrast, we show here that\ndislocations jam at any nonzero density, i.e. dislocations\nhave no jamming point. The physical reason is that dislocations have long range interactions that can lead to\npinning for arbitrarily large distances between the dislocations. Fig. 1 sketches the putative jamming phase\ndiagram (in the absence of screening) for dislocationmediated plasticity. It is closely related to the jamming\nphase diagram of [20] for granular materials, except for\nthe absence of a jamming point J for dislocations.\nIn the following we employ analytical calculations and\n\n\f2\n\nτint (~r) =\n\nx(x2 − y 2 )\nbμ\n2π(1 − ν) (x2 + y 2 )2\n\n(1)\n\nwhere μ is the shear modulus and ν is the Poisson ratio\nof the host medium [21]. This is anisotropicp\nin the (x,y)plane and decays as τint ∼ 1/r at large r = x2 + y 2 . If\nan external shear stress τext is applied the overdamped\nequation of motion of a dislocation along the shear direction is described by,\nN\nX\ndxi\nτint (~rj − ~ri ) − τext )\nη\n= bi (\ndt\n\n(2)\n\nj6=i\n\nfor i, j = 1, ..., N where xi is the x coordinate of the\nith dislocation at point ~ri with Burgers vector bi , ~rj with\nj 6= i are the coordinates of the other N −1 dislocations, t\nis time and η is the effective viscosity in the host medium\n[1, 7, 8]. Here we have set the temperature to T = 0. For\nthe computer simulations we have set the distance scale\nb = 1 and the time scale t0 = η/(μ/(2π(1 − ν)) = 1.\nTo simulate bulk materials we employ periodic boundary\nconditions in both x and y directions.\nTo treat the long-range character of the dislocation interaction, we found the Lekner method [22] of image cells\nparticularly straight forward. The equations of motion\nare solved by the adaptive-step fifth-order Runge-Kutta\nmethod [23]. The dislocation number is constant, since\nso far we considered neither dislocation creation nor annihilation. Equal numbers of dislocations with positive,\n~b = +x̂, and negative, ~b = −x̂, Burgers vectors, render\nthe system neutral. The dislocation collective speed (also\nPN\ncalled activity) V (t), is defined as, V (t) = i=1 |vi (t)|\nwhere vi = dxi /dt. The acoustic emission signal is proportional to the dislocation\nPNcollective speed. Another\npopular choice is V (t) = i=1 bi vi (t), which is proportional to the strain rate [11].\nAdiabatic Increase of External Stress:- First we consider the quasi-static or adiabatic case. After randomly\nplacing the dislocations in the square cell, we let the system relax to the nearest (metastable) equilibrium state.\n\nequilibration\nadiabatic stress increase\nthreshold\n\n8\n\nV(t)\n\n6\n4\n2\n0\n\nstart finish\n\n-2\n0.0e0\n\n4.0e4\n\n8.0e4\ntime\n\n1.2e5\n\n1.6e5\n\n0.16\n0.12\nstress\n\ndiscrete dislocation dynamics simulations to study how\nthe critical yield stress depends on the dislocation density\nρ. Our analytical calculations verify and generalize the\nnumerical findings.\nThe Model:- We place N straight edge dislocations parallel to the z-axis in a square box of side L. They are\nallowed to glide only along the shear direction (x-axis),\nwhile they can interact in the x and y directions. This\nsimulates a single-slip system. Materials, like ice, with\nstrong plastic anisotropy, deform by glide on a single\nplane [1]. In these systems dislocation climb is negligible due to high plastic anisotropy. The z direction has\nbeen shown to be irrelevant to scaling [1, 7–10] effectivelly\nrendering the problem two-dimensional. An edge dislocation with Burgers vector ~b = (b, 0) produces in the host\nmedium an elastic shear stress at a distance ~r = (x, y),\n\n0.08\n\nstart finish\n\n0.04\nequilibration\nadiabatic stress increase\n0\n0.0e0\n\n1.0e6\n2.0e6\ndisplacement\n\n3.0e6\n\nFIG. 2: (color online) (top) Time dependence of the collective\nspeed of all N = 64 dislocations in a square box of side L =\n100. (bottom) The stress plotted against the total dislocation\ndisplacement for the same run. Displacement at time t is the\ntotal distance all the dislocations traveled\nfrom the beginning\nRt P\nN\nof the simulation (t = 0) till time t: 0 dt0 i=1 bi dxi (t0 ). The\narrows indicate the start and finish of the last large avalanche.\n(Note that in the stress vs displacement bottom figure the\nequilibration occurs at zero external stress.)\n\nDuring that procedure we apply zero external stress. As\nthe system approaches the nearest energy minimum the\ndislocation motion slows down. A simple eigenmode\nanalysis shows that the time needed for the system to\nreach zero activity diverges. We assume that the system\nis sufficiently close to the energy minimum when the dislocation activity has fallen below a threshold, Vth = 0.1,\nwhich is roughly 100 times less than the initial activity\nof the N = 64 dislocation system. Once the system's\nactivity has fallen below the specified threshold we start\nincreasing the external stress adiabatically slowly. As\nsoon as the adiabatically slowly increased stress pushes\nthe system's activity above the threshold, V (t) > Vth and\nthe system produces an avalanche, we keep the external\nstress constant until the avalanche stops (Fig. 2). The\nscaling behavior is insensitive to the threshold for a value\nup to ten times larger and smaller.\nThe system starts with small avalanches and as the\nstress τ approaches the flow stress τc , it responds with\n\n\f3\n1\n\nfor smaller densities, as does the mean critical stress of\nthe ensemble. The scaling collapse shown in bottom Fig.\n√\n3 gives the relationship τc ∼ ρ.\n\n0.6\n\n0.12\n\n0.4\n\nN=64, L=100\nN=48, L=100\nN=32, L=100\nN=24, L=100\nN=16, L=100\n\n0.2\n\n0.1\n0.08\n\n0\n0\n\n0.05\n\n0.1\n\n0.15\n\n0.2\n\n0.25\n\nτc\n\n0.02\n\nλ'=-0.5\nλ=0.0\n\n0\n0\n\nλ\n\nP(τ > τc)/ρ\n\n0.06\n0.04\n\n1\n0.8\n\n<τc>\n\nP(τ > τc)\n\n0.8\n\n0.6\n0.4\n\nN=64, L=100\nN=48, L=100\nN=32, L=100\nN=24, L=100\nN=16, L=100\n\n0.2\n0\n0\n\n0.5\n\n1\n\n1.5\nτc ρλ'\n\n2\n\n2.5\n\n3\n\nFIG. 3: (color online) (top) The cumulative distribution of\ncritical stresses τc for 5 different numerical densities. Each\ncurve is extracted from 288 runs with N = 64, 32, 16 dislocations and 96 runs with N = 48, 24 dislocations in a square\nbox of side L = 100. The smaller the density, the narrower the distribution and smaller the mean τc (see next\nFig. 4). (bottom) We obtain a good collapse using the\ncurves with the three larger densities based on the expres0\nsion p(τc , ρ) ∼ ρλ f [τc ρλ ]. The collapse quantifies the fact\nthat the distributions get steeper and have a smaller mean\nfor lower density ρ. λ = 0 since the cumulative probability\nis restricted in [0, 1]. λ0 = −0.5 ± 0.02. The rescaling of the\nhorizontal axis indicates that τc ∼ ρ0.5 .\n\nlarger and larger avalanches until at τc it finally flows\nsteadily with an infinite avalanche. For τ > τc , the dislocations keep moving indefinitely, exiting from one side\nof the simulation cell and reemerging at the other due to\nthe periodic boundary conditions, without ever getting\njammed (pinned) again. In a deformation experiment,\nthis is the point when the sample yields. In summary,\nfor τ < τc the system is jammed (pinned). For τ > τc\nthe system is constantly flowing (yielding) (Fig. 2).\nJamming:- The critical stress τc is not a universal\nquantity and every system with the same number of dislocations and box size has a different τc . We performed\nan adiabatically slow increase of the stress for different\ndislocation densities, ρ = N/L2 . The cumulative distributions of the critical stresses is shown in top Fig. 3.\nOne can observe that the distributions become narrower\n\n200 400 600 800 1000 1200 1400\n1/ρ\n\nFIG. 4: (color online) The mean critical stress hτc i plotted against the inverse numerical density ρ. The system is\njammed for τ < τc and unjammed above it. Each point is\nextracted from 288 runs with N = 64, 32, 16, 8 dislocations\nand 96 runs with N = 48, 24, 12 dislocations in a square box\nof side L = 100. The critical stress has a similar qualitative dependence on the density as in the proposed jamming\nphase diagram by Liu and Nagel [17]. However for dislocations τc (ρ) > 0 for all non-zero densities ρ.\n\nThe dislocation system exhibits jamming for τ < τc\nanalogous to the work of Liu and Nagel [17] and O'Hern\net al. [18, 19]. Their systems are different from ours in\nthat they had exclusively short range interactions (contact interactions of soft spheres) and we have long-range\n(besides the core interactions that are enforcing the \"no\nclimb\" constraint). They observed similar distributions\nof depinning stresses and a similar concave up dependence of the flow stress on the density (Fig. 4). However\nin contrast to their results, we neither expect nor find a\njamming point equivalent to their jamming point J where\nτc = 0. This means there can be no density, however\nsmall, that will unjam our system at zero applied external stress. The reason is that dislocations have longrange interactions [20]. No matter how far apart they\nare, they always feel each other.\nTheoretical Calculation of Critical Stress:- Consider\n+\n−\nNR,∆R\npositive and NR,∆R\nnegative edge dislocations\nparallel to the z-axis randomly distributed on a ring of radius R and thickness ∆R on the (x, y)-plane. The stress\nexerted at the origin is given by,\nZ R+∆R\nρ+ (r, θ) − ρ− (r, θ)\nK(θ)\n(3)\nτR,∆R =\nd2 r\nr\nR\nadapted from [24] using Eq.(1) where K(θ) ∼\n±\nPNR,∆R\nδ(r−ri )\ncos(θ) cos(2θ) and ρ± (r, θ) =\nδ(θ − θi ).\ni=1\nr d−1\nWe express all distances in terms of l, the mean dislocation distance, i.e. ρ = N/Ld = 1/ld in d dimensions, i.e.\n\n\f4\nX = R/l and x = r/l. For any power law r−α interac+\n−\nd R X+∆X\n(x,θ)\ndd x ρ (x,θ)−ρ\nK(θ)\ntion, we get τX,∆X = llα X\nxα\n±\nPNX,∆X\nδ(x−xi )\n1\n±\nδ(θ − θi ). For small\nwith ρ (x, θ) = ld i=1\nxd−1\nring thickness we can approximate the integral with the\nvalue of the integrand at X times ∆X. The average over\nthe number of the dislocations to first order gives\nhτX,∆X i ∼\n\n1 ∆X\n+\n−\n(hNX,∆X\ni − hNX,∆X\ni) = 0\nlα X α\n\n(4)\n\nwith hN + i = hN − i = hN i. The effect of the number\nfluctuations on the stress per ring thickness is:\n+\n−\nh(NX,∆X\n− NX,∆X\n)2 i\nτX,∆X 2\n1 hNX,∆X i\nh(\n∼ 2α\n(5)\n) i∼\n∆X\nl2α X 2α\nl\nX 2α\n\nsince N ± are independent random variables, Poisson distributed with the same mean and variance. Assuming\nthat there are N dislocations of each kind in the entire\narea Ld where XL = L/l >> 1, their mean number in the\nd−1\nring can be expressed as hNX,∆X i ∼ N X X d∆X . SubstiL\n\nτ\n\n2\ntuting into Eq.(5) we find, h( X,∆X\n∆X ) i ∼\nIntegrating over the entire region,\n\nτ2\n≡\nXLd\n\nZ\nh(\n\nτX,∆X 2\n1 N\n) i ∼ 2α d\n∆X\nl XL\n\nZ\n\nXL\n\nXmin\n\n1 N\n∆X\nd X 2α−d+1\nl2α XL\n\ndX\nX 2α−d+1\n\n(6)\n\nwith Xmin ∼ O(1) the closest possible q\ndistance between\nτ\n1\n1\n1\n1\n2 dislocations gives: √N ∼ lα √2α−d X 2α−d\n− X 2α−d\nmin\n\nL\n\nfor 2α > d. In the thermodynamic limit, XL → ∞,\nα\nthis translates to the stress scaling as √τN ∼ l1α ∼ ρ d .\nq\nd−2α\n1\nFor 2α < d, √τN ∼ l1α √d−2α\nXLd−2α − Xmin\nand the\nthermodynamic limit doesn't exist. For parallel straight\nedge dislocations in 2 dimensions 2α = d = 2 and\n1p\nτ\n√ p\n√ ∼\nln(L/l) ∼ ρ ln(L/l)\nl\nN\n\n(7)\n\nThis agrees with our numerical result in bottom Fig. 3.\nThe extraction of logarithmic corrections requires much\nlarger systems than the ones that can be simulated.\nDiscussion:- We were able to show, using a discrete dislocation dynamics model, that the mean critical stress of\nan ensemble of dislocation systems with long-range interactions, τint ∼ 1/r, scales with the square root of the\n√\ndislocation density, hτc i ∼ ρ, for straight parallel edge\ndislocations. Eq. (7) also agrees with the Taylor hardening relation [21] and is analogous to the effective velocity\nof a point vortex in 2 dimensional hydrodynamics [25].\nWe were able to perform the analytical calculation for\nany power law interaction, τint ∼ 1/rα , and for arbitrary d dimensions. The theoretical result agrees with\nour simulation up to logarithmic corrections which are\ndifficult to measure at system sizes amenable to simulation. Our results, both numerical and theoretical, show\n\nthat for dislocations or particles with long-range interactions there can be no jamming point at a finite density\n(only at ρ = 0), provided there is no screening.\nAcknowledgements: We thank M. -C. Miguel, M.\nZaiser, J. Weiss, S. Zapperi, L. Laurson, M. Alava, D.\nCeperley, V. Paschalidis, K. Schulten, R. Brunner, J.\nEstabrook, J. T. Uhl, Y. Ben-Zion, S. Papanikolaou,\nJ. Sethna, B. Brinkman, L. Angheluta, H. Jaeger, A.\nLiu and S. Nagel for helpful conversations. We acknowledge NSF grant DMR 03-25939 ITR (MCC) and DMR\n1005209, the University of Illinois Turing cluster, the\nKITP at UCSB (KD) and NSF grant TG-DMR090061\nfor TeraGrid TACC and NCSA resources.\n\n[1] M. Miguel, A. Vespignani, S. Zapperi, J. Weiss, and\nJ. Grasso, Nature 410, 667 (2001).\n[2] T. Richeton, P. Dobron, F. Chmelik, J. Weiss, and\nF. Louchet, Mat.Sc.Eng. A 424, 190 (2006).\n[3] T. Richeton, J. Weiss, and F. Louchet, Acta Mat. 53,\n4463 (2005).\n[4] J. Weiss, F. Lahaie, and J. Grasso, J. Geo. Res, 105, 433\n(2000).\n[5] J. Weiss and J. Grasso, J. Phys. Chem. B 101, 6113\n(1997).\n[6] D. Dimiduk, C. Woodward, R. LeSar, and M. Uchic, Science 312, 1188 (2006).\n[7] M. Zaiser, B. Marmo, and P. Moretti, Proceedings of\nScience (Statistical Mechanics of Plasticity and Related\nInstabilities) 053 (2005).\n[8] L. Laurson and M. Alava, Phys. Rev. E 74, 066106\n(2006).\n[9] F. F. Csikor, C. Motz, D. Weygand, M. Zaiser, and\nS. Zapperi, Science 318, 251 (2007).\n[10] P. D. Ispanovity, I. Groma, G. Gyorgyi, F. F. Csikor, and\nD. Weygand, Phys. Rev. Lett. 105, 085503 (2010).\n[11] M. Zaiser, Advances in Physics 55, 185 (2006).\n[12] M. Zaiser and P. Moretti, J. Stat. Mech. P08004 (2005).\n[13] M. Zaiser and N. Nikitas, J. Stat. Mech. P04013 (2007).\n[14] M. Koslowski, Phil. Mag. 87, 11 (2007).\n[15] P. Chan, G. Tsekenis, J. Dantzig, K. Dahmen, and\nN. Goldenfeld, Phys. Rev. Lett. 105, 015502 (2010).\n[16] J. Sethna, K. Dahmen, and C. Myers, Nature 410, 242\n(2001).\n[17] A. Liu and S. Nagel, Nature 396, 21 (1998).\n[18] C. O'Hern, S. Langer, A. Liu, and S. Nagel, Phys. Rev.\nLett. 88, 7 (2002).\n[19] C. O'Hern, L. Silbert, A. Liu, and S. Nagel, Phys. Rev.\nE 68, 011306 (2003).\n[20] A. Liu and S. Nagel, Annu. Rev. Condens. Matter Phys.\n1, 347 (2010).\n[21] J. Hirth and J. Lothe, Theory of Dislocations (John Wiley and Sons, Inc., 1982).\n[22] J. Lekner, Physica A 176, 485 (1991).\n[23] W. Press, S. Teukolsky, W. Vetterling, and B. Flannery,\nNumerical Recipes in C: The Art of Scientific Computing\n(Cambridge University Press, 1992), 2nd ed.\n[24] I. Groma and B. Bako, Phys. Rev. B 58, 2969 (1998).\n[25] P. H. Chavanis, Phys. Rev. E 65, 056302 (2002).\n\n\f"}