{"id": "http://arxiv.org/abs/0810.4096v1", "guidislink": true, "updated": "2008-10-22T15:55:58Z", "updated_parsed": [2008, 10, 22, 15, 55, 58, 2, 296, 0], "published": "2008-10-22T15:55:58Z", "published_parsed": [2008, 10, 22, 15, 55, 58, 2, 296, 0], "title": "Determination and prediction of the fretting crack initiation:\n  introduction of the (P,Q,N) representation and definition of a variable\n  process volume", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0810.4096%2C0810.2081%2C0810.2792%2C0810.4833%2C0810.2034%2C0810.2420%2C0810.4365%2C0810.0465%2C0810.5552%2C0810.5732%2C0810.5032%2C0810.3622%2C0810.2377%2C0810.3270%2C0810.3653%2C0810.3194%2C0810.1520%2C0810.1283%2C0810.1856%2C0810.4731%2C0810.3581%2C0810.0554%2C0810.0655%2C0810.0890%2C0810.1350%2C0810.1257%2C0810.3278%2C0810.2891%2C0810.0008%2C0810.0681%2C0810.0991%2C0810.4944%2C0810.0868%2C0810.3932%2C0810.0479%2C0810.4312%2C0810.2010%2C0810.2347%2C0810.3983%2C0810.4190%2C0810.0302%2C0810.3984%2C0810.2783%2C0810.2816%2C0810.5690%2C0810.5503%2C0810.3028%2C0810.3486%2C0810.1238%2C0810.4271%2C0810.2287%2C0810.5492%2C0810.5540%2C0810.3494%2C0810.2587%2C0810.3442%2C0810.4997%2C0810.4832%2C0810.3431%2C0810.3579%2C0810.2841%2C0810.1262%2C0810.3820%2C0810.1465%2C0810.0121%2C0810.4458%2C0810.1288%2C0810.1307%2C0810.4261%2C0810.2116%2C0810.2511%2C0810.3593%2C0810.1526%2C0810.1654%2C0810.1290%2C0810.3698%2C0810.3335%2C0810.2674%2C0810.5426%2C0810.1117%2C0810.3094%2C0810.0942%2C0810.3400%2C0810.5305%2C0810.1291%2C0810.0650%2C0810.0074%2C0810.1195%2C0810.2878%2C0810.3222%2C0810.1378%2C0810.3746%2C0810.1959%2C0810.4370%2C0810.4062%2C0810.3760%2C0810.1817%2C0810.3017%2C0810.0207%2C0810.1740%2C0810.5585&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Determination and prediction of the fretting crack initiation:\n  introduction of the (P,Q,N) representation and definition of a variable\n  process volume"}, "summary": "In this work, the crack nucleation under fretting loading is investigated\nexperimentally with a damage tolerant 2024 aluminium alloy. A new method is\nintroduced to determine its condition with respect to all loading parameters\nincluding the number of fretting cycles. Further work deals with the prediction\nof this threshold using the Smith-Watson-Topper criterion. New developments are\npresented, in particular a process volume of variable size is introduced in the\ncomputations of the fretting crack initiation.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0810.4096%2C0810.2081%2C0810.2792%2C0810.4833%2C0810.2034%2C0810.2420%2C0810.4365%2C0810.0465%2C0810.5552%2C0810.5732%2C0810.5032%2C0810.3622%2C0810.2377%2C0810.3270%2C0810.3653%2C0810.3194%2C0810.1520%2C0810.1283%2C0810.1856%2C0810.4731%2C0810.3581%2C0810.0554%2C0810.0655%2C0810.0890%2C0810.1350%2C0810.1257%2C0810.3278%2C0810.2891%2C0810.0008%2C0810.0681%2C0810.0991%2C0810.4944%2C0810.0868%2C0810.3932%2C0810.0479%2C0810.4312%2C0810.2010%2C0810.2347%2C0810.3983%2C0810.4190%2C0810.0302%2C0810.3984%2C0810.2783%2C0810.2816%2C0810.5690%2C0810.5503%2C0810.3028%2C0810.3486%2C0810.1238%2C0810.4271%2C0810.2287%2C0810.5492%2C0810.5540%2C0810.3494%2C0810.2587%2C0810.3442%2C0810.4997%2C0810.4832%2C0810.3431%2C0810.3579%2C0810.2841%2C0810.1262%2C0810.3820%2C0810.1465%2C0810.0121%2C0810.4458%2C0810.1288%2C0810.1307%2C0810.4261%2C0810.2116%2C0810.2511%2C0810.3593%2C0810.1526%2C0810.1654%2C0810.1290%2C0810.3698%2C0810.3335%2C0810.2674%2C0810.5426%2C0810.1117%2C0810.3094%2C0810.0942%2C0810.3400%2C0810.5305%2C0810.1291%2C0810.0650%2C0810.0074%2C0810.1195%2C0810.2878%2C0810.3222%2C0810.1378%2C0810.3746%2C0810.1959%2C0810.4370%2C0810.4062%2C0810.3760%2C0810.1817%2C0810.3017%2C0810.0207%2C0810.1740%2C0810.5585&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "In this work, the crack nucleation under fretting loading is investigated\nexperimentally with a damage tolerant 2024 aluminium alloy. A new method is\nintroduced to determine its condition with respect to all loading parameters\nincluding the number of fretting cycles. Further work deals with the prediction\nof this threshold using the Smith-Watson-Topper criterion. New developments are\npresented, in particular a process volume of variable size is introduced in the\ncomputations of the fretting crack initiation."}, "authors": ["H. Proudhon", "S. Fouvry", "G. R. Yantio"], "author_detail": {"name": "G. R. Yantio"}, "author": "G. R. Yantio", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1016/j.ijfatigue.2005.09.005", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/0810.4096v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0810.4096v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "6 pages, 9 figures", "arxiv_primary_category": {"term": "cond-mat.mtrl-sci", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cond-mat.mtrl-sci", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0810.4096v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0810.4096v1", "journal_reference": "International Journal of Fatigue, 28(7), p. 707-713, July 2006", "doi": "10.1016/j.ijfatigue.2005.09.005", "fulltext": "Determination and prediction of the fretting crack initiation: introduction of the (P,Q,N)\nrepresentation and definition of a variable process volume\nH. Proudhon,1, ∗ S. Fouvry,1, † and G. R. Yantio1\n1\n\narXiv:0810.4096v1 [cond-mat.mtrl-sci] 22 Oct 2008\n\nLaboratoire de Tribologie et de dynamique des systèmes, UMR 5513,\nEcole Centrale de Lyon, 36 Avenue Guy de Collongue, 69134 Ecully Cedex, France\nIn this work, the crack nucleation under fretting loading is investigated experimentally with a damage tolerant\n2024 aluminium alloy. A new method is introduced to determine its condition with respect to all loading\nparameters including the number of fretting cycles. Further work deals with the prediction of this threshold\nusing the Smith-Watson-Topper criterion. New developments are presented, in particular a process volume of\nvariable size is introduced in the computations of the fretting crack initiation.\nPACS numbers: 62.20Mk, 62.20Qp\nKeywords: Fretting, Crack initiation, SWT fatigue criterion, Size effect, Stress Gradient\n\nI.\n\nINTRODUCTION\n\nFretting damage has been recognized as a problem in several industrial applications for years now. The first studies\ndefined the concept of fretting [1], while further work introduced more rationalization with precise concepts such as fretting cycles and fretting maps [2, 3]. Depending on the contact\nparameters and especially the displacement amplitude, it has\nbeen shown that two main regimes can be defined. First, In\nthe large displacement range, the full sliding regime exists,\nwhich can induce wear of the surfaces in contact. Second, In\nthe low displacement amplitude range, the contact causes a\npartial slip condition and severe stress gradients at the contact\nborder. This can induce very rapid crack nucleation compared\nto classical fatigue testing. In this paper we focus on the latter regime and particularly on the crack nucleation condition.\nThis has been recognized as a critical issue for industry in the\npast ten years.\nThanks to recent work, different methods are now available to model the propagation of fretting fatigue cracks using\nfor example the \"Crack analogue\" model, fracture mechanics\n[4, 5] and also weight functions [6]. But due to the possible drastic reduction of the fatigue limit induced by fretting\n[7], a great part of the work has been devoted to determining the fretting crack initiation conditions in various types of\nmaterials [8, 9, 10]. This process is quite complex due to high\nstress and strain gradients, oxidation phenomena and other tribological phenomenon (TTS formation [11]), surface deformation and wear, and debris formation. Until now the main\nmethod used to describe quantitatively crack nucleation deals\nonly with the mechanical state under the fretting conditions\nand relies on computing a multiaxial fatigue criterion (this\nwas first attempted by Petiot et al. [12]). This can be done\neither by using analytical solutions of the stress/strain state\nunder fretting contact (as it can be found in [13]), or more recently by numerous author with finite elements [10, 14, 15].\nThe latter method is more constrained but allows one to test\n\n∗ Electronic\n\naddress: henry.proudhon@ec-lyon.fr\nauthor. Tel.: +33-472-186-562; fax: +33-472-433-383.\n\n† Corresponding\n\nmore general geometries and more complex loading conditions. Due to the very strong gradients located at the contact\nborder, one must use a process volume approach, which consists of averaging the stress/strain state in a micro-volume of\nmaterial prior applying the multiaxial criterion. This method\nhas popularized and has been investigated with various fatigue\ncriteria [9, 14, 16]. These investigations have been capable of\npredicting, in some cases, the crack nucleation threshold ; but,\nthe significance of the process volume is not yet fully understood, and as a consequence cannot be truly estimated without doing experiments. For completeness, it must be pointed\nout that some alternative methods exists such as the asymptotic stress intensity analysis [17]. In this kind of approach,\nthe stress singularity induced by the contact configuration is\ncaptured by asymptotic analysis in order to deduce a stress\nintensity factor at the contact edge.\nIn this paper we restrict the analysis to the prediction of the\ncrack nucleation condition in the fretting wear configuration\nby the Smith-Watson-Topper criterion. We present an new vision of the process volume and apply the method to a complete\nexperiment series with various fretting wear conditions. This\nwork attempts to clarify the physical meaning of the process\nvolume and to set up a systematical way of characterizing the\ncrack nucleation condition with respect to parameters relevant\nfor the industrial applications (contact pressure, shear stress\namplitude and number of cycles).\n\nII.\n\nEXPERIMENTAL WORK\n\nPart of the experimental work has been presented elsewhere. The reader is referred to [16] for more details on\nthe experimental setup, though general information is summarized here. A general fretting wear apparatus is used in\ncylinder/plane configuration and under partial slip regime. A\nnormal force P is applied on the counter-body to maintain the\nsurface in contact causing an elliptic pressure p(x) over the\ncontact zone |x| < a ; a cyclic relative displacement is imposed to the interface leading to a classical shear stress q(x)\nwhich exhibits its maximum at the stick zone limit x = ±c (cf.\nfig. 1). The flat specimen being maintained in a fixed position,\n\n\f2\nthis displacement gives rise to a cyclic shear force1 of magnitude Q which is measured during the test via a force sensor.\nRegarding the materials, an aluminium/aluminium contact is\nstudied, with plane samples in a 2024T351 alloy (see table I\nfor mechanical properties) and a cylindrical counter body of\n49 mm radius made of a Al7075T6 alloy.\nTABLE I: Mechanical properties of the studied Al2024\nE (GPa) ν σ0.2% (MPa) σd (MPa)\n72\n0.33\n325\n140\n\nP\nq(x)\n\nR\n\np(x)\n\nQ\n\ny\n\nA previous study (with the same geometry and material)\nconducted to 50 000 fretting cycles was described in [16].\nAccording to these experiments, the crack nucleation condition was found to be mainly independent of the normal load\n(see fig. 8 where the experimental results have been replotted), leading to the crack nucleation threshold in terms of the\ntangential load Qth ≃ 240 N/mm.\nThough this value defines a boundary between safe and\na crack risk zones, the number of cycle needed to be more\ndeeply investigated. Indeed a rapid calculation of the stress\nstate at the contact border does show that the contact is subjected to loading conditions equivalent to low cycle fatigue.\nWe consider the simple analysis of the two-dimensional plane\nstrain cylinder/flat contact with the Hertz theory from which\nwe can write the peak contact pressure p0 :\n2P\np0 =\n=\nπa\n\nc\na\n\nx\n\nFIG. 2: Experimental method to investigated cracking after a fretting\ntest ; see the text for details.\n\nFIG. 1: Schematic of the fretting wear cylinder/plane configuration.\n\nThe fretting crack nucleation has been investigated in the\nfollowing way (cf. fig. 2):\n\n\u0012\n\nP E∗\nπR\n\n• chemical etching can be performed after a first optical micrograph observation in order to avoid a possible\nblurring of the crack by the polishing process (fig. 2d).\n• depending on the previous investigations, new fretting\nconditions are determined to refine or confirm the results.\na)\n\nb)\n\nfretting\nscar\nmassive\nsample\n\nc)\n\ntransparent\nepoxy\n\n1\n\nface\nto polish\n\n(1)\n\nR being the radius of the cylinder and E ∗ the effective\nYoung modulus.\nThe stress field is known in partial slip conditions from the\nanalytical solutions (see for instance [13]). At the contact border (x = a, y = 0), σyy = σxy = 0 so the stress tensor\nmatches the principal stress state (σ1 , σ2 , σ3 ) which is biaxial\n(the contact pressure vanishes):\n\n• fretting test is conducted on the sample for chosen loading conditions (fig. 2a).\n• fretting crack presence is investigated by cutting the\nsample in the middle of the scars and polishing the\nnewly created face (fig. 2b,c).\n\n\u00131/2\n\nσ1 = σxx = 2p0\n\nr\n\nμQ\nP\n\nσ2 = σyy = 0\nσ3 = σzz = νσxx\n\n(2)\n\nwith μ the friction coefficient in partial slip condition (μ\nwas determined to be close to 1,1 in our case [16]). The equivalent Von Mises stress σe can be easily expressed:\n\u00011/2\n1\nσe = √ (σ1 − σ3 )2 + σ12 + σ32\n2\n\u00011/2\n1\n= √ 2σ12 + 2σ32 − 2σ1 σ3\n2\n\u0012\n\u00131/2\nσ3\nσ3\n= σ1 1 + ( )2 −\nσ1\nσ1\n\n(3)\n\ncombining with equation 2:\n\nd)\n\nμQ 2\n(ν − ν + 1)1/2\nP\nr\nμE ∗ Q 2\n(ν − ν + 1)1/2\n= 2p0\nπR\n\nσe (x = a, y = 0) = 2p0\n\n20μm\ncenter of the contact\n\nnote that in fretting wear experiments, there is no bulk load imposed\n\nr\n\n(4)\n\nThus the shear force leading to the conventional yield at\n0.2% of deformation σY , in the slip zone, can be written as:\n\n\f3\nstudied in [16℄\n\n(5)\n\nWith σY = σ0.2% , this expression gives QY = 117 N/mm.\nIt is clear that an aluminium/aluminium contact with a friction coefficient greater than unity (like in our case) will induce very high contact stresses and it can be seen that all the\ntests carried out in this study operates under low cycle fatigue\nrange (Q > QY ). It is therefore expected that the number of\nfretting cycles must have an influence on the crack nucleation\ncondition.\nTo fully determine the crack nucleation condition, the experimental study was completed as follows: for a chosen normal pressure, additional fretting tests were conducted with\ndifferent numbers of cycles. The initiation threshold is then\ndetermined for each new number of fretting cycles. The crack\nnucleation boundary is then expressed as a function of the\nthree loading parameters P , Q and N . The whole experimental procedure is described in fig. 3.\n\nP\n\n⋄\n\nra k nu leation\nondition\n\n⋄\n⋄\n⋄\n5.104\n105\n\n⋄ P = 400N/mm\n⋄\n⋄\nQ\n⋄\n\nexperimental thresholds\n\ns\nr\n\n200\n\nsr\n\nnon ra king\nzone\n\n150\n\n100\n0\n\n200\n\n400\n\n600\n\nNumber of fretting\n\n800\ny les\n\n1000 1200\nN × 1000\n\nFIG. 4: Evolution of the critical tangential force Qth to initiate a\nfretting crack (determined as shown in fig. 3a), with the number of\nfretting cycles (P = 400 N/mm).\n\nto a saturation value around 160–170 N/mm ,although more\nexperiment are needed to establish the exact value. In particular, experiments with N > 106 cycles, which are very time\nconsuming, are required. In addition, it has been shown elsewhere that with this material in this configuration, 106 cycle\ndoes correspond to a stabilized condition [18].\nAssuming a homotetic behaviour with respect to P , the\nwhole crack nucleation condition can be plotted in a 3D diagram f (P, Q, N ) as shown in figure 5.\n\nion\n\nnsit\nslip tra\n\n106\n\nN\n\n= f (P, Q, N )\n\ns\nr\n\n250\nthreshold (N/mm)\n\nσY2\nπR\n∗\n2\n4μE ν − ν + 1\n\nQth\n\nQY =\n\n240\n\n170\n\nFIG. 3: Methodology used to determine the crack nucleation condition with respect to the , Q, N parameters, a) tests at constant N, b)\ntests at constant P, c) whole (P,Q,N) representation.\n\nHere, new tests have been performed with a constant normal load P = 400 N/mm. Two different numbers of fretting\ncycles have been investigated: 5.105 and 106 cycles. The corresponding crack nucleation threshold are determined according to fig. 3a ; values have been reported in table II and plotted\non fig. 4.\nTABLE II: Influence of the number of fretting cycles on the crack\nnucleation threshold (P = 400 N/mm).\nNumber of cycles Threshold (N/mm)\n5.104\n240\n5.105\n190\n1.106\n170\n\nAs expected, the number of applied fretting cycles has\nan influence on Qth . The more fretting cycles applied, the\nless the threshold value. Moreover, the evolution of Qth (N )\nshows first a rapid reduction with increasing N , and then tends\n\nFIG. 5: Representation of the crack nucleation condition in the\n(P,Q,N) space.\n\nThis defines completely both the safe and cracking domains\nby the boundary f (P, Q, N ). The advantage is the strong\nphysical meaning of these parameters, which can be extended\nto other test configurations and more generally to any structure. In fretting fatigue tests for instance, the definition of P\nis unchanged but there is an additional load (bulk stress) in\nthe material; the parameter Q must take that bulk stress into\naccount and N would be the number of fatigue cycles. In a\n\n\f4\nmore complicated case like an industrial component, first step\nwill be to locate the contact area and then calculate the contact pressure P , for example by finite elements (integrating\nthe normal stresses over the contact surface). Then Q can be\ndefined as the maximum shear force transmitted through the\ncontact during a cycle and should be estimated in the same\nway, integrating this time the shear stresses over the contact\nsurface (this will, however, require a detailed contact analysis\nwhich must capture the partial slip contact conditions). N can\nthen be identified as the number of cycles associated to the\nload responsible of the relative displacement of the surfaces.\nTo conclude, this new representation aims to narrow the gap\nbetween ideal test configuration and actual structures encountered in real industrial problems.\n\nIII.\n\nPREDICTION OF THE CRACK NUCLEATION\nCONDITION\n\nThe purpose of this section is to use a multiaxial fatigue criterion to predict the crack nucleation condition. The\nstress/strain state is computed from the analytical solutions of\nthe cylinder plane contact ; these fields are averaged2 on a circular shaped process volume to soften the contact gradients\nand then the cracking risk is evaluated. Among the numerous\nstudies on the subject, it has been shown that no criterion is\nable to predict the location of nucleation, the crack angle and\nload leading to crack initiation together.\nIn this study we consider the SWT parameter despite the\nfact that it has been shown to be unable to predict the crack\ninitiation angle (the investigated cracks are very often inclined\ntoward the centre of the contact). The hypothesis to identify\nthe crack initiation plane as the critical plane of the criterion\nis not obvious and the crack initiation process may be much\nmore complicated as recently pointed out by another study\n[19]. On the other hand the SWT criterion has a low cycle\nfatigue behaviour which has been shown to be effective for\nfinite life [20] and also was used recently be Fridrici et al. to\ntackle the same kind of problems in titanium alloys [21]. In\naddition, the material coefficients for this criterion are given\nby Szolwinski et al. [8].\n\nA.\n\nPrediction of the crack nucleation boundary at 50000\nfretting cycles\n\nThe use of the SWT criterion for fretting is now well documented (see for example [15, 16, 21]). Thus, only the general equation is reproduced here. According to this model, the\ninitiation is likely to occur on the plane where the SWT parameter is maximum. The SWT parameter Γ is evaluated in\nthe current plane by the product between the amplitude of the\nstrain εa and the maximum stress normal to this plane σmax .\n\n(σf′ )2\n′\n′\n′\n(2N )2b + σf′ ε′f (2N )b +c\n(6)\nE\nwhere σf′ is the fatigue strength coefficient, b′ is the fatigue\nstrain exponent, ε′f is the fatigue ductility coefficient and c′\nis the fatigue ductility exponent. The mechanical and fatigue\nproperties of the studied alloy are listed in tables I and III\nrespectively.\nΓ = σmax × εa =\n\nTABLE III: Fatigue properties of the studied Al2024 (from [8])\nσf′ (MPa) b′\nε′f\nc′\n714\n-0.078 0.166 -0.538\n\nThis approach has been previously used to study the crack\nnucleation at 50 000 cycles [16]. The results can be summarized as follow:\n• the crack nucleation threshold predicted by the analysis of the local analytical stresses is very far from the\nexperimental result (≃ 100 N/mm to be compared to\nQth = 240 N/mm).\n• performing size effect calculations allowed for fitting\nof the average experimental result but the precise behaviour (i.e. the effect of the loading pressure) cannot\nbe captured.\n• the average process volume showing the best correlation was found to be correlated to the mean grain radius (which was measured by Electron BackScattered\nDiffraction analysis giving 75 μm).\nThe physical meaning of the process volume size is still an\nopen question. The most often quoted significance is the grain\nsize. Indeed it is argued here that the stress/strain state inducing initiation must be sufficiently widespread to make the very\nshort crack propagate in the adjacent grain. Looking at several\nstudies on different materials, a large range of sizes have been\nused for the process volume. 5 μm in steel [20], 30 μm in titanium alloy [21] and 80 μm in aluminium alloy [16], each time\ncorrelated to the grain size. On the other hand, the grain size\ncannot be the only significant parameter due to other cases\nwhere no correlation has been found. Moreover, this parameter does not take into account any mechanical quantity such\nas for example the slip amplitude which is certainly relevant\nfor the crack initiation condition.\nWe consider here a new approach using a variable process\nvolume. This idea comes from the fact that the crack initiation\nmay be strongly monitored by the stress state in the slip zone\nonly. More precisely, the severity of the stress gradient located\nin the slip zone may be responsible of the crack initiation risk.\nThis is illustrated by figure 6 where two distributions of the\nsurface traction3 (σxx ) are plotted for the same conditions but\n\n3\n2\n\nthis process is sometimes referred to as a size effect\n\nOne should note that the σxx component is dominant in the slip zone,\ncompared to the other stress values, (they vanish when x 7→ a where the\nstress state becomes purely uniaxial)\n\n\f5\nwith different normal loads (P1 < P2 ).\nσxx (MPa)\n\n250\n\n250\n\n150\n\n150\n\n50\n\nγ = 0.26\n⇓\nr1 = 110μm\n\n−50\n−150\n\nri = γ(ai − ci )\nΓi\n\n50\n\nγ = 0.26\n⇓\nr2 = 57μm\n\n−50\n\nΓi = Γ c ?\n\n−250\n\nNo\n\nQi ց\n\n0 c2\n\nx\n1\n\na2\n\nFIG. 6: Illustration of the radius of the process volume needed to\naverage the stress gradient with two different normal loads P1 and\nP2 .\n\nIt is clear that the severity of the stress gradient can be related to the slip zone width a − c due to the quasi-linear evolution of σxx . Keeping the process volume size constant would\nintroduce a strong effect of the pressure, which can actually\nbe seen looking at the solid line prediction replotted on fig. 8\nfor the calculation with r = 80 μm. From here the radius of\nthe process volume zone is no longer constant. We introduce\na new variable γ defined as the ratio of the process volume\nradius r and the slip zone width a − c:\nr\nγ=\na−c\n\n(7)\n\nThe value of γ is identified once for all for the conditions\nwhich gave r=80μm. For the corresponding loading conditions (P = 318 N/mm, Q = 240 N/mm) one can calculate\na = 700 μm and c = 393 μm. This leads to the value of\nγ = 0.26. The crack nucleation threshold is then computed\nthrough this new approach according to the flowchart shown\nin fig. 7.\nPrediction of the crack nucleation boundary for 50 000 fretting cycles with γ = 0.26 is presented in fig. 8. This approach\ngives, a very good correlation with the experimental results.\nIn particular, the pressure effect is well described.\nThis result highlights the reliability of the approach and\nshows that the process volume size, in addition to be related\nto some microstructural characteristic of the material, must be\nlinked to the mechanical state as well, such as the slip zone\nwidth, to be able to predict the crack nucleation precisely.\n\nB. Prediction of the low cycle fretting behaviour\n\nThe same model is applied to test the experimental results\nobtained for 5.105 and 106 fretting cycles (see §II). The γ parameter is kept constant at the same value identified for 50 000\n\nFIG. 7: Flowchart of the different steps required to predict the critical\nload Qth for each pressure level Pi ; the third step has been added to\nthe conventional constant process volume approach.\n\nbc\n\n1200\n\nr\n\n1\n\na1\n\na2 − c2\n\nNormal load P (N/mm)\n\n0 c1\n\nx\n\nΓi < Γc ?\n\nQth = Qi\n\nr2\n\nr1\na1 − c1\n\nYes\n\nNo\n\nYes\n\n−150\n\n−250\n\nQi ր\n\nr\n\n350\n\nexperimental\nthreshold from [16]\n\nbc\n\n1000\n\nr\n\n350\n\ncompute ai and ci\n\nbc\n\n800\n600\n\nbc\n\nr\n\n450\n\npredicted with bc\nr/(a-c)=constant bc\n\nrr r r\nr\n\n450\n\npredicted with\nr=constant\n\nbc\n\nbc\n\n400\n200\n0\n100\n\nrr\n\nσxx (MPa)\n\nPi , Qi\nP2 = 500 N/mm\nQ2 = 240 N/mm\n\nbc\nbc\nbc\nbc\n\nr r rr\n\nP1 = 240 N/mm\nQ1 = 240 N/mm\n\nslip\ntransition\n\n200\n300\n400\nTangential load amplitude Q (N/mm)\n\n500\n\nFIG. 8: Prediction of the crack nucleation boundary at 50 000 fretting\ncycles with the variable process volume approach.\n\ncycles (γ = 0.26, see §III A). The prediction is done in the\nsame way by varying the number of cycles in equation 6. The\nresults of these computations are gathered in figure 9.\nThe experimental behaviour appears well correlated with\nthe prediction of the SWT parameter. In particular one can see\na very rapid decrease of the critical tangential force needed to\nnucleate a fretting crack, as the number of cycles increases.\nAround 106 cycles a plateau is reached, corresponding to endurance conditions. This behaviour is consistent with another\nstudy on the same alloy and another 7xxx series alloy [18]\nwhere 106 fretting cycles are clearly identified as a stabilized\ncondition.\n\n\f6\nIV.\n\nCONCLUSION\n\nsr\n\n(N/mm)\n\n200\n\nsr\n\nQth\n150\n\nsr\n\nthreshold\n\nCra k nu leation\n\nsr\n\n250\n\nexperimental threshold\npredi tion by SWT with γ = 0.26\n\n100\n0\n\n200\n\n400\n\n600\n\nNomber of fretting\n\n800\ny les\n\n1000 1200\nN × 1000\n\nFIG. 9: Prediction of the evolution of Qth with the number of cycles,\nby application of the SWT criterion suited with a variable process\nvolume size.\n\n[1] R. B. Waterhouse, Fretting Fatigue (Applied Science publishers, London, 1981), ISBN 852989407.\n[2] L. Vincent, Y. Berthier, and M. Godet, in Standardization of\nFretting Fatigue Test Methods and Equipment., edited by M. H.\nAttia and R. Waterhouse (1992), vol. 1159 of ASTM-STP, pp.\n33–48.\n[3] S. Fouvry, P. Kapsa, and L. Vincent, Wear 200, 186 (1996).\n[4] M. Ciavarella and G. Demelio, International Journal of Solids\nand Structures 38, 1791 (2001).\n[5] A. E. Giannakopoulos, T. C. Lindley, and S. Suresh, Acta Materialia 46, 2955 (1998).\n[6] C. Navarro, M. Garcia, and J. Dominguez, Fatigue and Fracture\nof Engineering Materials and Structures vol. 26, 459 (2003).\n[7] T. C. Lindley and K. J. Nix, in Standardization of Fretting Fatigue Test Methods and Equipment, edited by M. H. Attia and\nR. Waterhouse (1992), vol. 1159 of ASTM-STP, pp. 153–169.\n[8] M. Szolwinski and T. Farris, Wear 198, 93 (1996).\n[9] S. Fouvry, P. Kapsa, F. Sidoroff, and L. Vincent, J. Phys. IV\nFrance 8 Pr8, 159 (1998).\n[10] A. T. Bernardo, J. A. Araujo, and E. N. Mamiya, in Proceedings\nof the 4th International Symposium on Fretting Fatigue (Lyon,\n2004).\n[11] E. Sauger, S. Fouvry, L. Ponsonnet, P. Kapsa, J. Martin, and\n\nTwo main results have been presented in this paper. On the\nexperimental point of view, a new representation of the crack\nnucleation condition is introduced through the (P, Q, N ) diagram, leading to a concrete and complete description of the\nmaterial fretting resistance to initiation and this with a limited, although still quite important, number of tests. In order to predict this initiation condition, the SWT criterion is\nused and the classical computation is extended with a variable\nprocess volume size. This further opens the question of the\nsignificance of this parameter as it appears not to be only related to a microstructure characteristic length. The use of the\nslip zone width to determine the process volume radius clearly\nidentifies a mechanical significance. Eventually the final answer may require a mix of the microstructural/mechanical behaviour. This could at last be answered by extending the approach to different materials as for instance steels and titanium\nalloys.\n\nL. Vincent, Wear 245, 39 (2000).\n[12] C. Petiot, L. Vincent, K. D. Vang, N. Moauche, J. Foulquier,\nand B. Journet, Wear 185, 101 (1995).\n[13] D. A. Hills and D. Nowell, Mechanics of Fretting Fatigue,\n0792328663 (Kluwer Academic Publishers, Dordrecht, Boston,\n1994), ISBN 792328663.\n[14] S. Naboulsi and S. Mall, Tribology International vol. 36, 121\n(2003).\n[15] W. S. Sum, E. J. Williams, and S. B. Lean, International Journal\nof Fatigue vol. 27, 403 (2005).\n[16] H. Proudhon, S. Fouvry, and J.-Y. Buffière, International Journal of fatigue 27, 569 (2005), URL arXiv:0710.3715.\n[17] A. Mugadu and D. A. Hills, International Journal of Solids and\nStructures vol. 39, 1327 (2002).\n[18] S. Munoz, H. Proudhon, J. Dominguez, and S. Fouvry, International Journal of Fatigue 12, 1769 (2006).\n[19] H. Proudhon, J.-Y. Buffière, and S. Fouvry, Engineering Fracture Mechanics 74, 782 (2007).\n[20] S. Fouvry, K. Elleuch, and G. Simeon, Journal of strain analysis\n6, 549 (2002).\n[21] V. Fridrici, S. Fouvry, P. Kapsa, and P. Perruchaut, Wear 259,\n300 (2005).\n\n\f"}