{"id": "http://arxiv.org/abs/1201.1649v1", "guidislink": true, "updated": "2012-01-08T18:42:05Z", "updated_parsed": [2012, 1, 8, 18, 42, 5, 6, 8, 0], "published": "2012-01-08T18:42:05Z", "published_parsed": [2012, 1, 8, 18, 42, 5, 6, 8, 0], "title": "Nodal gap structure in the noncentrosymmetric superconductor LaNiC2 from\n  magnetic-penetration-depth measurements", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1201.5045%2C1201.2944%2C1201.6039%2C1201.3481%2C1201.2761%2C1201.1756%2C1201.0479%2C1201.3895%2C1201.3122%2C1201.1420%2C1201.3340%2C1201.0795%2C1201.3437%2C1201.0916%2C1201.2874%2C1201.5484%2C1201.1833%2C1201.0491%2C1201.0633%2C1201.2636%2C1201.6442%2C1201.3266%2C1201.5070%2C1201.5009%2C1201.3180%2C1201.4580%2C1201.0606%2C1201.5039%2C1201.6030%2C1201.6065%2C1201.3421%2C1201.1266%2C1201.1883%2C1201.3595%2C1201.5810%2C1201.4791%2C1201.5100%2C1201.1638%2C1201.4197%2C1201.0743%2C1201.2407%2C1201.1370%2C1201.6537%2C1201.2235%2C1201.1667%2C1201.2739%2C1201.4477%2C1201.4482%2C1201.5877%2C1201.3879%2C1201.3665%2C1201.1851%2C1201.0346%2C1201.4465%2C1201.5143%2C1201.6433%2C1201.5305%2C1201.5805%2C1201.6263%2C1201.4706%2C1201.1662%2C1201.3851%2C1201.5585%2C1201.0233%2C1201.1827%2C1201.3484%2C1201.3962%2C1201.3852%2C1201.2778%2C1201.5647%2C1201.0871%2C1201.5207%2C1201.1057%2C1201.3668%2C1201.5615%2C1201.6278%2C1201.6113%2C1201.2165%2C1201.5200%2C1201.5142%2C1201.4859%2C1201.4328%2C1201.0912%2C1201.3780%2C1201.0091%2C1201.6478%2C1201.1743%2C1201.5860%2C1201.0945%2C1201.4883%2C1201.0959%2C1201.4038%2C1201.4082%2C1201.4755%2C1201.2387%2C1201.1649%2C1201.1015%2C1201.4489%2C1201.4222%2C1201.1515%2C1201.4643&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Nodal gap structure in the noncentrosymmetric superconductor LaNiC2 from\n  magnetic-penetration-depth measurements"}, "summary": "We report measurements of the temperature dependence of the magnetic\npenetration depth in different quality polycrystalline samples of\nnoncentrosymmetric LaNiC2 down to 0.05 K. This compound has no magnetic phases\nand breaks time-reversal symmetry. In our highest quality sample we observe a\nT^2 dependence below 0.4Tc indicative of nodes in the energy gap. We argue that\nprevious results suggesting conventional s-wave behavior may have been affected\nby magnetic impurities.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1201.5045%2C1201.2944%2C1201.6039%2C1201.3481%2C1201.2761%2C1201.1756%2C1201.0479%2C1201.3895%2C1201.3122%2C1201.1420%2C1201.3340%2C1201.0795%2C1201.3437%2C1201.0916%2C1201.2874%2C1201.5484%2C1201.1833%2C1201.0491%2C1201.0633%2C1201.2636%2C1201.6442%2C1201.3266%2C1201.5070%2C1201.5009%2C1201.3180%2C1201.4580%2C1201.0606%2C1201.5039%2C1201.6030%2C1201.6065%2C1201.3421%2C1201.1266%2C1201.1883%2C1201.3595%2C1201.5810%2C1201.4791%2C1201.5100%2C1201.1638%2C1201.4197%2C1201.0743%2C1201.2407%2C1201.1370%2C1201.6537%2C1201.2235%2C1201.1667%2C1201.2739%2C1201.4477%2C1201.4482%2C1201.5877%2C1201.3879%2C1201.3665%2C1201.1851%2C1201.0346%2C1201.4465%2C1201.5143%2C1201.6433%2C1201.5305%2C1201.5805%2C1201.6263%2C1201.4706%2C1201.1662%2C1201.3851%2C1201.5585%2C1201.0233%2C1201.1827%2C1201.3484%2C1201.3962%2C1201.3852%2C1201.2778%2C1201.5647%2C1201.0871%2C1201.5207%2C1201.1057%2C1201.3668%2C1201.5615%2C1201.6278%2C1201.6113%2C1201.2165%2C1201.5200%2C1201.5142%2C1201.4859%2C1201.4328%2C1201.0912%2C1201.3780%2C1201.0091%2C1201.6478%2C1201.1743%2C1201.5860%2C1201.0945%2C1201.4883%2C1201.0959%2C1201.4038%2C1201.4082%2C1201.4755%2C1201.2387%2C1201.1649%2C1201.1015%2C1201.4489%2C1201.4222%2C1201.1515%2C1201.4643&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We report measurements of the temperature dependence of the magnetic\npenetration depth in different quality polycrystalline samples of\nnoncentrosymmetric LaNiC2 down to 0.05 K. This compound has no magnetic phases\nand breaks time-reversal symmetry. In our highest quality sample we observe a\nT^2 dependence below 0.4Tc indicative of nodes in the energy gap. We argue that\nprevious results suggesting conventional s-wave behavior may have been affected\nby magnetic impurities."}, "authors": ["I. Bonalde", "R. L. Ribeiro", "K. J. Syu", "H. H. Sung", "W. H. Lee"], "author_detail": {"name": "W. H. Lee"}, "author": "W. H. Lee", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1088/1367-2630/13/12/123022", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1201.1649v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1201.1649v1", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "cond-mat.supr-con", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cond-mat.supr-con", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1201.1649v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1201.1649v1", "arxiv_comment": null, "journal_reference": "New J. Phys. 13, 123022 (2011)", "doi": "10.1088/1367-2630/13/12/123022", "fulltext": "arXiv:1201.1649v1 [cond-mat.supr-con] 8 Jan 2012\n\nNodal gap structure in the noncentrosymmetric\nsuperconductor LaNiC2 from\nmagnetic-penetration-depth measurements\nI Bonalde1 , R L Ribeiro1 ‡, K J Syu2 , H H Sung2 and W H Lee2\n1\n\nCentro de Fı́sica, Instituto Venezolano de Investigaciones Cientı́ficas, Apartado\n20632, Caracas 1020-A, Venezuela\n2\nDepartment of Physics, National Chung Cheng University, Ming-Hsiung, Chia-Yi\n62199, Taiwan, ROC\n\nAbstract. We report measurements of the temperature dependence of the magnetic\npenetration depth in different quality polycrystalline samples of noncentrosymmetric\nLaNiC2 down to 0.05 K. This compound has no magnetic phases and breaks timereversal symmetry. In our highest quality sample we observe a T 2 dependence below\n0.4Tc indicative of nodes in the energy gap. We argue that previous results suggesting\nconventional s-wave behavior may have been affected by magnetic impurities.\n\nPACS numbers: 74.20.Rp, 74.25.Nf, 74.70.Dd\nE-mail: ijbonalde@gmail.com\n\n‡ Present address: Laboratoire National des Champs Magnétiques Intenses, INSA UPS UJF CNRS,\nUPR 3228, Université de Toulouse, 143 av. de Rangueil, 31400 Toulouse, France.\n\n\f2\n1. Introduction\nNoncentrosymmetric superconductors have gained interest since the discovery of\nsuperconductivity in CePt3 Si [1]. The absence of inversion symmetry leads to the\nindistinguishability of spin-singlet and spin-triplet states and to the appearance of an\nantisymmetric spin-orbit coupling (ASOC) that splits the electron bands by lifting the\nspin degeneracy. Thus unusual superconducting properties have been expected in all\nthese materials, though to date such properties have been observed only in a small\ngroup: CePt3 Si [2, 3], Li2 Pt3 B [4, 5], CeIrSi3 , CeRhSi3 , CeCoGe3 , and CeIrGe3 [6, 7, 8].\nWith the notable exception of Li2 Pt3 B, in this group superconductivity appears inside an\nantiferromagnetic order and mostly around a quantum critical point. This suggests that\nthe unusual behaviors may originate from the interplay of antiferromagnetic interaction\nand ASOC [9, 10].\nNonmagnetic LaNiC2 is an intriguing noncentrosymmetric superconductor [11]\nin which both unconventional and conventional behaviors have been uncovered.\nUnconventional characteristics were found in early specific-heat measurements [11] that\nshowed a low-temperature T 3 dependence expected when the energy gap has nodes\nand in recent muon-spin-relaxation results [12] that suggested the lack of time-reversal\nsymmetry (TRS). NQR-1/T1 [13] and recent specific-heat [14] data were interpreted in\nterms of conventional BCS superconductivity. On the other hand, theoretical approaches\n[9, 10, 15] imply that LaNiC2 should behave like a conventional superconductor. The\nfact that LaNiC2 is nonmagnetic and has a relatively strong ASOC [16] makes the\ndetermination of its pairing symmetry important for the understanding of the physics of\nnoncentrosymmetric superconductors. Moreover, the symmetry of the order parameter\nof LaNiC2 may be relevant for superconductivity in general, because a) in the absence\nof inversion symmetry only some spin-triplet states are allowed [17], b) in the absence of\nTRS spin-singlet states are forbidden, and c) TRS is required by the presence of ASOC\n[17].\nThe conflicting experimental results in LaNiC2 may have been caused by the poor\nquality of the samples and the not-so-low temperatures of the experiments. It is known\nthat in order to determine energy gap structures from thermodynamic and transport\nproperties temperatures below 0.3Tc are needed. Here, we present measurements of the\nmagnetic penetration depth λ(T ) in different quality samples of LaNiC2 down to 50 mK\n(∼ 0.017Tc ). Penetration depth is highly recognized as a unique probe of the structure\nand symmetry of the superconducting order parameter. In our highest quality sample\nwe found that λ(T ) ∝ T 2 as T −→ 0, which suggests the existence of nodes in the\nenergy gap.\n2. Experimental methods\nLaNiC2 crystallizes in the orthorhombic CeNiC2 -type structure with space group Amm2\n[11]. We studied four different polycrystalline samples (labeled A, B, C, and D) prepared\n\n\f111\n\n(a)\n\nSample D\n\nSample B\n\nLaNiC2 (annealed)\n\n30\n\n40\n\n200\n013\n022\n211\n113\n122\n\n102\n020\n\n011\n002\n\n100\n\n004\n220\n031\n204\n131213\n222\n300\n024 211\n033\n\nLaNiC2 (as cast)\n* La2Ni5C3\n+ LaC2\n\nLaNiC2 (as cast)\n* La2Ni5C3\n\n*211\n\nSample C\n\n50\n\n60\n\n2θ (deg)\n\n70\n\n80 20\n\n30\n\n*221\n*311\n*410\n\n020\n\n102\n\n200\n013\n022\n211113\n122\n\nSample A\n\n*211\n*221\n*311\n*410\n\n011\n002\n\n100\n\n+ 101\n\nIntensity (arb. units)\n\nLaNiC2(annealed)\n\n20\n\n(b)\n\n004\n220\n031\n204\n131213\n300222\n024\n211\n033\n\n111\n\n3\n\n40\n\n50\n\n60\n\n70\n\n80\n\n2θ (deg)\n\nFigure 1. Room-temperature powder x-ray diffraction patterns for our LaNiC2\nsamples prepared with (a) 99.9% Ni and (b) 99.995% Ni.\n\nby arc melting suited amounts of La (99.9%, Ames Lab), C (99.9995%, Alpha Aesar)\nand Ni in two degrees of purity. Samples A and B were prepared with 99.9% Ni (40\nppm of Fe, Alpha Aesar) and samples C and D with 99.995% Ni (13 ppm of Fe, Alpha\nAesar). Samples B and D were then sealed under argon in quartz tubes and annealed\nat 1273 ◦ C for 10 days, and finally water quenched to room temperature. To check for\nimpurity phases in the samples, we performed powder x-ray diffraction measurements\nusing a microcomputer controlled MXP3 diffractometer with graphite monochromated\nCu Kα radiation. Annealed samples B and D displayed sharp diffraction lines and no\nadditional reflections (see upper spectra in Fig. 1), which is taken as evidence of single\nphases. In contrast, as-cast samples A and C showed additional reflection lines (see\nlower spectra in Fig. 1) corresponding to the secondary phases LaC2 and La2 Ni5 C3 . In\nsamples A, B and C the transition temperature Tc ≈ 3.6 K, whereas in sample D Tc ≈ 3\nK.\nPenetration-depth measurements were carried out utilizing a 14 MHz tunnel diode\noscillator. The deviation of the penetration depth λ(T ) from its value at the lowest\nmeasured temperature, ∆λ(T ) = λ(T ) − λ(0.05 K), was obtained up to T ∼ 0.99Tc\nfrom the corresponding change in the measured resonance frequency ∆f (T ): ∆f (T ) =\nG∆λ(T ). Here G is a constant factor that depends on the sample and coil geometries\nand that includes the demagnetizing factor of the sample. We estimated G by measuring\na sample of known behavior and of the same dimensions as the test sample [18]. To\n\n\f4\n6000\n\n4000\n\ndP/dH (a.u.)\n\n∆λ (Å)\n\n5000\n\nFe\n20000\n\n3+\ng = 2.005\n\ngpar= 9.6\n\ngperp = 4.26\n100 K\n\n0\n\n300 K\n\n3000\n2000\n\n-20000\n2000\n\n4000\n\nH (Gauss)\n\nsample A\nsample B\n\n1000\n0\n0.0\n\n0.1\n\n0.2\n\n0.3\n\n0.4\n\n0.5\n\n0.6\n\nT/TC\nFigure 2. Low-temperature ∆λ(T ) of samples A and B. The upturns below 0.2Tc are\ndue to a contribution coming from Fe impurities in the samples. Inset: EPR spectra\nat different temperatures for sample B that clearly indicate the presence of interstitial\nFe3+ . gpar and gperp are the parallel and perpendicular components of the g-factor,\nrespectively.\n\nwithin this calibration factor, ∆λ(T ) is raw data.\nWe note here that the low-temperature dependence of λ(T ) does not seem to be\naffected by the sample type (single crystal, polycrystal, etc.) [3, 19]. In any case,\nintergrain or proximity effects are not expected to be relevant in the present results,\nbecause the measuring magnetic field is very small (about 5 mOe) [20]. For comparison,\nwe measured a pure (99.999%) polycrystalline sample of the s-wave superconductor In\n(Tc = 3.4 K). Intergranular susceptibility normally saturates at low temperatures.\n3. Results and Discussion\nFigure 2 displays the low-temperature region of ∆λ(T ) of samples A and B. Both\ncurves have an upturn below 0.2Tc that in polycrystalline samples is usually caused\nby the competition between the superconducting screening effect and the magnetic\npermeability (whose thermal response is due to magnetic-impurity effects) [21]. To\ncheck for the presence of magnetic impurities in samples A and B, we performed EPR\nspectroscopy at 100 and 300 K. In both samples the spectra indicate the presence of\ninterstitial Fe3+ in the orthorhombic structure of LaNiC2 (see the spectra of sample\nB in the inset to Fig. 2). Thus, the upturns in the penetration-depth data of these\nsamples could indeed be produced by magnetic impurities. Previous measurements in\nLaNiC2 samples prepared with 99.9% Ni, i.e. similar to samples A and B, were carried\nout with probes sensitive to magnetic impurities and were thus most likely affected by\nthe Fe3+ impurities. Notably, the results of all these measurements -1/T1-NQR [13],\nmagnetization and heat capacity [14]- point to conventional BCS behavior.\n\n\f5\n1.0\n\n(a)\n\nSample C\n\n∆λ(Τ)/∆λ0\n\n0.8\n\nSample D\n\n0.6\n0.4\n\nindium\n0.2\n0.0\n0.0\n\n0.2\n\n0.4\n\n0.6\n\n0.8\n\n1.0\n\nT/TC\n\n∆λ (Å)\n\n∆λ (Å)\n\n1500\n\n(b)\n\n1500\n\n2000\n\n1000\n500\n\n1000\n\nSample D\nSample C\n\nsample D\n\n500\n0\n0.0\n\n0.1\n\n0.2\n\n(T/Tc)\n\n2\n\n0.3\n\nsample C\nindium\n\n0\n0.0\n\n0.2\n\n0.4\n\n0.6\n\nT/TC\nFigure 3. (a) Normalized ∆λ(T ) against T /Tc of samples C and D and of conventional\nindium. (b) Closeup of the low-temperature region showing that LaNiC2 data follow\na power law instead of an exponential behavior (as the indium data do). Inset: Lowtemperature data plotted as a function of (T /Tc )2 , where ∆λ(T ) ∝ T 2 is observed\nbelow 0.4Tc in sample D.\n\nFigure 3a shows ∆λ(T )/∆λ0 of sample C, sample D, and indium. The data were\nscaled by the corresponding total penetration depth shift ∆λ0 so as to compare them.\nThe superconducting transitions in these LaNiC2 samples are quite broad compared\nwith the one in indium. Similar wide transitions are seen in samples A and B. The\nbroadness is different from sample to sample which suggests that the wide transitions\nin LaNiC2 are due to defects or high inhomogeneity.\nFigure 3b depicts the low-temperature region of ∆λ(T ) of samples C and D along\nwith that of indium. No upturn is observed in these samples of LaNiC2 , prepared with\nthe purest Ni (99.995%), which could imply that the level of Fe impurities is so small\nas to affect significantly the superconducting properties. In samples C and D the lowtemperature magnetic penetration depth goes as T n , with n ∼ 2 − 2.4, as opposed to\nthe distinctly different exponential behavior observed in the sample of the fully-gapped\nsuperconductor indium (see figure). Inset to Fig. 3b displays ∆λ(T ) versus (T /Tc )2 for\nsamples C and D in the temperature region T ≤ 0.55Tc . Clearly, ∆λ(T ) ∝ T 2 up to\nabout 0.4Tc in sample D. Since the annealed sample D has the sharpest transition and\n\n\f6\nthe smallest exponent n in a larger temperature region, we consider the result in this\nsample to be the closest to the true superconducting behavior in LaNiC2 .\nA T 2 dependence of λ(T ) at the lowest temperatures would only result if the\nsuperconducting energy gap has nodes or conventional gapless superconductivity occurs\n(due to strong scattering effects) [22]. We note that ∆λ(T ) ∝ T 2 is the limiting\nbehavior of gapless superconductivity under impurity scattering; thus the fact that\nwe see a higher exponent n in somewhat lower quality samples would rule out gapless\nsuperconductivity. Moreover, gapless superconductivity leads to linear temperature\nbehaviors in the electronic specific heat Ce and the NMR relaxation time 1/T1 [23]. In\nprevious works it was found that Ce ∝ T 3 in a sample of the same quality as D [11] and\nthat Ce and 1/T1 go exponentially with temperature in lower quality samples [13, 14].\nThus, we argue here that the T 2 dependence of λ(T ) suggests the existence of nodes in\nthe gap function and, therefore, that superconductivity is unconventional in LaNiC2 .\nWe now discuss the node origin of ∆λ(T ) ∝ T 2 . Since we used polycrystalline\nsamples both the in-plane and the out-of-plane component of λ(T ) contributed to our\nmeasured signals. Unfortunately, the available information for LaNiC2 is not sufficient\nto estimate its anisotropy that would allow us to weight the contribution from each\npenetration-depth component. A T 2 response can appear in the out-of-plane component\n∆λc (T ) if point nodes are present. This would be in agreement with the result Ce ∝ T 3\nfound earlier [11] that implies the existence of point nodes in the gap. We notice that\nthe TRS-breaking states proposed under symmetry arguments [12, 24] as the candidates\nfor the order parameter of LaNiC2 do not posses point nodes.\nA T 2 dependence could also be displayed in the in-plane component ∆λab (T )\nbecause of symmetry-imposed line nodes in the presence of unitary scattering. In this\ncase, the quadratic response would be the result of a crossover from the linear behavior of\n∆λab (T ) expected for a clean and pure material [25]. In LaNiC2 impurities/defects may\nact as strong scatterers,qsince they change the low-T behavior of λ(T ). The crossover\ntemperature T ∗ ∼ ∆(0) (Tc0 − Tc )/Tc0 (with Tc0 the impurity-free Tc ) [25], may apply\nup to a correction factor of order one in noncentrosymmetric superconductors [3, 26, 27].\nIn LaNiC2 Tc0 is unknown and a fit to the crossover expression ∆λ(T ) = aT 2 /(T ∗ + T )\nyielded T ∗ > Tc , consistent with the fact that ∆λ(T ) ∝ T 2 up to high temperatures.\nThis result indicates that the impurity-free critical temperature should be appreciably\nhigher than 3-3.6 K, and there is not evidence of it. Thus, it is unclear whether line nodes\naffected by impurities/defects may cause the T 2 dependence. It is worth mentioning that\nin the noncentrosymmetric superconductor CePt3 Si the linear behavior of λ(T ) at low\ntemperatures was found to be robust against impurities/defects [3].\nEven though the present results indicate that the energy gap of LaNiC2 has nodes,\nwe believe that the type of node would be only elucidated when pure single crystals\nbecome available.\nIn Fig. 4 we compare the superfluid density ρ(T ) ∝ λ2 (0)/λ2 (T ) of sample D with\nthe numerical data of a conventional s-wave local model. We estimated λ(0) ∼ 1230\nÅ from γn ≈ 7 mJ/mol*K2 and Hc2(0) ∼ 1250 Oe [11, 13]. Since λ(0) has not been\n\n\f7\n1.0\n\nλ(0)\n\n2000 Å\n1600 Å\n1230 Å\n800 Å\n\nλ(0) = 2000 Å\n\n1.0\n\n2\n\n0.2\n\n1.2\n\n0.8\n\n2\n\n0.4\nλ (0)/λ (T)\n\n2\n\n0.6\n\n2\n\nλ (0)/λ (T)\n\n0.8\n\n0.6\n\nλ(0) = 1230 Å\n\n0.00\n\n0.0\n0.0\n\n0.04\n\n2\n\n0.08\n\n(T/Tc)\n\n0.2\n\n0.4\n\n0.6\n\n0.8\n\n1.0\n\nT/Tc\nFigure 4. Superfluid density ρ(T ) ∝ λ2 (0)/λ2 (T ) of sample D and the numerical data\nof a conventional s-wave local model (dashed line). Due to the uncertainty in λ(0),\nρ(T ) was plotted for several values of λ(0). Inset: Low-temperature ρ(T ) as a function\nof (T /Tc )2 for λ(0) = 1230 Å and λ(0) = 2000 Å. In both cases the data follow a T 2\nlaw. The solid lines are guides to the eye.\n\nexperimentally obtained, in Fig. 4 we plotted ρ(T ) for several values of λ(0). In all\ncases the disagreement between theory and experiment is evident, which supports the\nargument that LaNiC2 does not behave as a conventional s-wave superconductor. The\ninset to this figure shows that at low temperatures the superfluid density goes as T 2\nindependently of the value of λ(0), in accordance with the penetration-depth data.\nThe strong suppression of the superfluid density at high temperatures is similar to\nthat found in other noncentrosymmetric superconductors with and without nodes [28,\n29]. Moreover, in the well-established d-wave superconductors κ-(ET)2 Cu[N(CN)2 ]Br\nand κ-(ET)2 Cu(NCS)2 the superfluid density shows upward curvature [30]. Recently,\nhowever, it has been widely considered that an upward curvature in the superfluid\ndensity is a signature of two-gap superconductivity. We argue that, regardless of the\ncurvature of the superfluid density, in the true low-temperature limit two-isotropic-gap\nsuperconductors display a temperature-independent behavior, whereas superconductors\nwith nodes in the energy gap show a power-law response. That is, as T −→ 0 a\ntemperature-independent behavior of λ(T ) or ρ(T ) implies a nodeless energy gap, while\na power-law response is a very strong evidence of nodes.\nOur results indicate that (1) previous measurements in low-quality samples that\nsuggest conventional s-wave behaviors may have been affected by magnetic impurities\nand (2) in higher quality samples (like our sample D) the superconducting properties\nof LaNiC2 are characterized by an energy gap with nodes. Thus, LaNiC2 is only the\nsecond noncentrosymmetric superconductor without magnetic phases or strong electron\ncorrelations found to have nodes in the energy gap. Until now Li2 Pt3 B, which also has a\n\n\f8\nrelatively strong ASOC, was the only example of such a superconductor. Based on the\nresults in CePt3 Si, CeIrSi3 , and CeRhSi3 , most recent models for noncentrosymmetric\nsuperconductors point out that the existence of (accidental) nodes requires the presence\nof both an antiferromagnetic interaction and a sizable ASOC [9, 10]. Our results in\nLaNiC2 suggest that an antiferromagnetic coupling may not be required for the existence\nof nodes in superconductors without inversion symmetry.\n4. Conclusions\nIn summary, we reported measurements of the magnetic penetration depth in\npolycrystalline samples of noncentrosymmetric LaNiC2 . The very-low-temperature\npenetration depth of our highest quality sample followed a T 2 law that strongly suggest\nnodes in the energy gap. We believe that previous results indicating conventional s-wave\nbehaviors were most probably affected by magnetic impurities.\nAcknowledgments\nWe would like to thank Dr Marisel Dı́az at Instituto Venezolano de Investigaciones\nCientı́ficas (IVIC) for the EPR spectra. This work was supported by IVIC Project No.\n441.\nReferences\n[1] Bauer E, Hilscher G, Michor H, Paul C, Scheidt E W, Gribanov A, Seropegin Y, Noël H, Sigrist M\nand Rogl P 2004 Phys. Rev. Lett. 92 027003\n[2] Bauer E, Kaldarar H, Prokofiev A, Royanian E, Amato A, Sereni J, Brämer-Escamilla W and\nBonalde I 2007 J. Phys. Soc. Jpn. 76 051009\n[3] Bonalde I, Ribeiro R L, Brämer-Escamilla W, Rojas C, Bauer E, Prokofiev A, Haga Y, Yasuda T\nand Ōnuki Y 2009 New J. Phys. 11 055054\n[4] Yuan H Q, Agterberg D F, Hayashi N, Badica P, Vandervelde D, Togano K, Sigrist M and Salamon\nM B 2006 Phys. Rev. Lett. 97 017006\n[5] Nishiyama M, Inada Y and Zheng G Q 2007 Phys. Rev. Lett. 98 047002\n[6] Kimura N, Ito K, Aoki H, Uji S and Terashima T 2007 Phys. Rev. Lett. 98 197001\n[7] Méasson M A, Muranaka H, Kawai T, Ota Y, Sugiyama K, Hagiwara M, Kindo K, Takeuchi T,\nShimizu K, Honda F, Settai R and Ōnuki Y 2009 J. Phys. Soc. Jpn. 78 124713\n[8] Honda F, Bonalde I, Shimizu K, Yoshiuchi S, Hirose Y, Nakamura T, Settai R and Ōnuki Y 2010\nPhys. Rev. B 81 140507(R)\n[9] Fujimoto S 2006 J. Phys. Soc. Jpn. 75 083704\n[10] Yanase Y and Sigrist M 2007 J. Phys. Soc. Jpn. 76 043712\n[11] Lee W H, Zeng H K, Yao Y D and Chen Y Y 1996 Physica C 266 138\n[12] Hillier A D, Quintanilla J and Cywinski R 2009 Phys. Rev. Lett. 102 117007\n[13] Iwamoto Y, Iwasaki Y, Ueda K and Kohara T 1998 Phys. Lett. A 250 439\n[14] Pecharsky V K, Miller L L and Gschneidner K A 1998 Phys. Rev. B 58 497\n[15] Subedi A and Singh D J 2009 Phys. Rev. B 80 092506\n[16] Hase I and Yanagisawa T 2009 J. Phys. Soc. Jpn. 78 084724\n[17] Frigeri P A, Agterberg D F, Koga A and Sigrist M 2004 Phys. Rev. Lett. 92 097001\n\n\f9\n[18] Bonalde I, Ribeiro R, Brämer-Escamilla W, Yamaura J, Nagao Y and Hiroi Z 2007 Phys. Rev.\nLett. 98 227003\n[19] Bonalde I, Brämer-Escamilla W and Bauer E 2005 Phys. Rev. Lett. 94 207002\n[20] Goldfarb R B, Lelental M and Thompson C A 1991 Magnetic Susceptibility of Superconductors\nand Other Spin Systems ed Hein R A (New York: Plenum Press) p 49\n[21] Cooper J R 1996 Phys. Rev. B 54 R3753\n[22] Gross F, Chandrasekhar B S, Eizel D, Andres K, Hirschfeld P J, Ott H R, Beuers J, Fisk Z and\nSmith J L 1986 Z. Phys. B 64 175\n[23] Sigrist M and Ueda K 1991 Rev. Mod. Phys. 63 239\n[24] Quintanilla J, Hillier A D, Annettt J F and Cywinski R 2010 Phys. Rev. B 82 174511\n[25] Hirschfeld P J and Goldenfeld N 1993 Phys. Rev. B 48 4219\n[26] Frigeri P A, Agterberg D F, Milat I and Sigrist M 2006 Eur. Phys. J. B 54 435\n[27] Mineev V P and Samokhin K V 2007 Phys. Rev. B 75 184529\n[28] Bonalde I, Brämer-Escamilla W, Haga Y, Bauer E, Yasuda T and Ōnuki Y 2007 Physica C 460\n659\n[29] Ribeiro R L, Bonalde I, Haga Y, Settai R and Ōnuki Y 2009 J. Phys. Soc. Jpn. 78 115002\n[30] Carrington A, Bonalde I J, Prozorov R, Giannetta R W, Kini A M, Schlueter J, Wang H H, Geiser\nU and Williams J M 1999 Phys. Rev. Lett. 83 4172\n\n\f"}