{"id": "http://arxiv.org/abs/1201.4697v1", "guidislink": true, "updated": "2012-01-23T12:13:25Z", "updated_parsed": [2012, 1, 23, 12, 13, 25, 0, 23, 0], "published": "2012-01-23T12:13:25Z", "published_parsed": [2012, 1, 23, 12, 13, 25, 0, 23, 0], "title": "Spontaneous generation of geometry in four dimensions", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1201.0680%2C1201.2008%2C1201.0852%2C1201.5346%2C1201.4208%2C1201.6661%2C1201.3843%2C1201.3046%2C1201.3431%2C1201.2957%2C1201.5923%2C1201.5240%2C1201.3328%2C1201.4925%2C1201.2004%2C1201.4968%2C1201.5150%2C1201.4376%2C1201.5266%2C1201.4194%2C1201.2231%2C1201.0088%2C1201.6338%2C1201.1533%2C1201.4156%2C1201.6088%2C1201.3073%2C1201.3859%2C1201.0297%2C1201.2535%2C1201.3634%2C1201.0443%2C1201.5409%2C1201.3385%2C1201.6679%2C1201.1960%2C1201.3407%2C1201.2673%2C1201.6564%2C1201.1178%2C1201.5641%2C1201.3200%2C1201.5427%2C1201.6210%2C1201.4354%2C1201.0400%2C1201.4496%2C1201.6125%2C1201.3041%2C1201.5107%2C1201.0557%2C1201.4170%2C1201.2450%2C1201.3064%2C1201.2892%2C1201.3727%2C1201.1820%2C1201.0568%2C1201.6352%2C1201.2414%2C1201.1899%2C1201.3739%2C1201.4304%2C1201.0074%2C1201.0694%2C1201.3392%2C1201.0877%2C1201.5148%2C1201.4969%2C1201.1413%2C1201.3970%2C1201.1606%2C1201.3747%2C1201.5262%2C1201.2973%2C1201.5040%2C1201.0699%2C1201.4695%2C1201.5245%2C1201.5768%2C1201.0317%2C1201.3614%2C1201.1678%2C1201.2349%2C1201.0070%2C1201.6506%2C1201.4009%2C1201.1551%2C1201.1356%2C1201.5884%2C1201.0717%2C1201.4697%2C1201.2338%2C1201.1890%2C1201.3650%2C1201.5008%2C1201.4948%2C1201.0950%2C1201.3234%2C1201.6178%2C1201.2456&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Spontaneous generation of geometry in four dimensions"}, "summary": "We present the extension to 4 dimensions of an euclidean 2-dimensional model\nthat exhibits spontaneous generation of a metric. In this model gravitons\nemerge as Goldstone bosons of a global SO(D) X GL(D) symmetry broken down to\nSO(D). The microscopic theory can be formulated without having to appeal to any\nparticular space-time metric and only assumes the pre-existence of a manifold\nendowed with an affine connection. We emphasize that not even a flat metric\nneeds to be assumed; in this sense the microscopic theory is quasi-topological.\nThe vierbein appears as a condensate of the fundamental fermions. In spite of\nhaving non-standard characteristics, the microscopic theory appears to be\nrenormalizable. The effective long-distance theory is obtained perturbatively\naround a vacuum that, if the background affine connection is set to zero, is\n(euclidean) de Sitter space-time. If perturbatively small connections are\nintroduced on this background, fluctuations of the metric (i.e. gravitons)\nappear; they are described by an effective theory at long distances whose more\nrelevant operators correspond to the Einstein-Hilbert action with a\ncosmological constant. This effective action is derived in the large N limit, N\nbeing the number of fermion species in the fundamental theory. The counterterms\nrequired by the microscopic theory are directly related to the cosmological\nconstant and Newton constant and their couplings could eventually be adjusted\nto the physical values of Mp and \\Lambda.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1201.0680%2C1201.2008%2C1201.0852%2C1201.5346%2C1201.4208%2C1201.6661%2C1201.3843%2C1201.3046%2C1201.3431%2C1201.2957%2C1201.5923%2C1201.5240%2C1201.3328%2C1201.4925%2C1201.2004%2C1201.4968%2C1201.5150%2C1201.4376%2C1201.5266%2C1201.4194%2C1201.2231%2C1201.0088%2C1201.6338%2C1201.1533%2C1201.4156%2C1201.6088%2C1201.3073%2C1201.3859%2C1201.0297%2C1201.2535%2C1201.3634%2C1201.0443%2C1201.5409%2C1201.3385%2C1201.6679%2C1201.1960%2C1201.3407%2C1201.2673%2C1201.6564%2C1201.1178%2C1201.5641%2C1201.3200%2C1201.5427%2C1201.6210%2C1201.4354%2C1201.0400%2C1201.4496%2C1201.6125%2C1201.3041%2C1201.5107%2C1201.0557%2C1201.4170%2C1201.2450%2C1201.3064%2C1201.2892%2C1201.3727%2C1201.1820%2C1201.0568%2C1201.6352%2C1201.2414%2C1201.1899%2C1201.3739%2C1201.4304%2C1201.0074%2C1201.0694%2C1201.3392%2C1201.0877%2C1201.5148%2C1201.4969%2C1201.1413%2C1201.3970%2C1201.1606%2C1201.3747%2C1201.5262%2C1201.2973%2C1201.5040%2C1201.0699%2C1201.4695%2C1201.5245%2C1201.5768%2C1201.0317%2C1201.3614%2C1201.1678%2C1201.2349%2C1201.0070%2C1201.6506%2C1201.4009%2C1201.1551%2C1201.1356%2C1201.5884%2C1201.0717%2C1201.4697%2C1201.2338%2C1201.1890%2C1201.3650%2C1201.5008%2C1201.4948%2C1201.0950%2C1201.3234%2C1201.6178%2C1201.2456&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We present the extension to 4 dimensions of an euclidean 2-dimensional model\nthat exhibits spontaneous generation of a metric. In this model gravitons\nemerge as Goldstone bosons of a global SO(D) X GL(D) symmetry broken down to\nSO(D). The microscopic theory can be formulated without having to appeal to any\nparticular space-time metric and only assumes the pre-existence of a manifold\nendowed with an affine connection. We emphasize that not even a flat metric\nneeds to be assumed; in this sense the microscopic theory is quasi-topological.\nThe vierbein appears as a condensate of the fundamental fermions. In spite of\nhaving non-standard characteristics, the microscopic theory appears to be\nrenormalizable. The effective long-distance theory is obtained perturbatively\naround a vacuum that, if the background affine connection is set to zero, is\n(euclidean) de Sitter space-time. If perturbatively small connections are\nintroduced on this background, fluctuations of the metric (i.e. gravitons)\nappear; they are described by an effective theory at long distances whose more\nrelevant operators correspond to the Einstein-Hilbert action with a\ncosmological constant. This effective action is derived in the large N limit, N\nbeing the number of fermion species in the fundamental theory. The counterterms\nrequired by the microscopic theory are directly related to the cosmological\nconstant and Newton constant and their couplings could eventually be adjusted\nto the physical values of Mp and \\Lambda."}, "authors": ["Jorge Alfaro", "Domènec Espriu", "Daniel Puigdomènech"], "author_detail": {"name": "Daniel Puigdomènech"}, "author": "Daniel Puigdomènech", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1103/PhysRevD.86.025015", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1201.4697v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1201.4697v1", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "hep-th", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "hep-th", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "gr-qc", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1201.4697v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1201.4697v1", "arxiv_comment": null, "journal_reference": "Phys. Rev. D 86, 025015 (2012)", "doi": "10.1103/PhysRevD.86.025015", "fulltext": "Spontaneous generation of geometry in four dimensions\n\narXiv:1201.4697v1 [hep-th] 23 Jan 2012\n\nJorge Alfaro\nPontificia Universidad Católica de Chile, Av. Vicuña Mackenna 4860, Santiago, Chile,\nDomènec Espriu and Daniel Puigdomènech\nDepartament d'Estructura i Constituents de la Matèria,\nInstitut de Ciències del Cosmos (ICCUB)\nUniversitat de Barcelona\nMartı́ i Franquès, 1, 08028 Barcelona, Spain.\n\nAbstract\nWe present the extension to 4 dimensions of an euclidean 2-dimensional model that\nexhibits spontaneous generation of a metric. In this model gravitons emerge as Goldstone\nbosons of a global SO(D) × GL(D) symmetry broken down to SO(D). The microscopic\ntheory can be formulated without having to appeal to any particular space-time metric\nand only assumes the pre-existence of a manifold endowed with an affine connection. We\nemphasize that not even a flat metric needs to be assumed; in this sense the microscopic\ntheory is quasi-topological. The vierbein appears as a condensate of the fundamental\nfermions. In spite of having non-standard characteristics, the microscopic theory appears to be renormalizable. The effective long-distance theory is obtained perturbatively\naround a vacuum that, if the background affine connection is set to zero, is (euclidean) de\nSitter space-time. If perturbatively small connections are introduced on this background,\nfluctuations of the metric (i.e. gravitons) appear; they are described by an effective theory at long distances whose more relevant operators correspond to the Einstein-Hilbert\naction with a cosmological constant. This effective action is derived in the large N limit,\nN being the number of fermion species in the fundamental theory. The counterterms\nrequired by the microscopic theory are directly related to the cosmological constant and\nNewton constant and their couplings could eventually be adjusted to the physical values\nof Mp and Λ.\nPACS: 11.15.Ex, 04.60.Rt\n\nJanuary 2012\nUB-ECM-FP-66/12\nICCUB-12-002\n1\n\n\f1\n\nIntroduction\n\nIt has been pointed out several times in the literature (see e.g. [1, 2, 3, 4]) that gravitons could\nbe considered as Goldstone bosons of some broken symmetry. The non-renormalizability of\ngravity would therefore be analogous to the bad ultraviolet properties of effective models of\nhadrons, for instance. This is exactly the point of view that we adopt in this paper. This\nwork is the extension to four dimensions of a previous analysis in two dimensions[5].\nIn our view, concrete implementations of this idea have been lacking so far (see however\n[7, 8]). By concrete proposal we mean a field theory that does not contain the graviton field\nas an elementary degree of freedom. It should not even contain the tensor ημν either, as\nthis already implies the use of some background metric and thus the notion of geometry;\ngravitons being fluctuations around this flat background. Instead, one would like to see all\nthe metric degrees of freedom emerging dynamically, like pions appear dynamically after\nchiral symmetry breaking in QCD. We would also like the underlying theory to be in some\nsense 'simpler' than gravity, in particular it should be renormalizable. It was shown in [5]\nthat a theory with all these characteristics can be found in two dimensions.\nThe purpose of the present work is to extend the 2D model to the far more interesting case\nof four dimensions. In spite of the complications brought up by the higher dimensionality,\nthe nice features of the 2D case persist. The amount of divergent terms remains under\ncontrol, at least on shell, and the use of the equations of motion ensures that the final\neffective theory is precisely that of Einstein-Hilbert plus a cosmological term, complemented\nby higher dimensional terms normalized by a computable dimensionful constant.\nThe topic of 'emergent gravity' has recently been a popular one[6] but with the exceptions\nof the earlier works of [7] and [8] we have been unable to find any proposal meeting our rather\nrestricted criteria of not assuming any pre-existing metric structure whatsoever. On the other\nhand the proposals in [7, 8] appear to be untractable and quantitative results are hard or\nimpossible to get.\nTraditionally a major stumbling block in the program that will be developed below is the\nso-called Weinberg-Witten theorem [9] (see also [10]). The apparent pathology of theories\nintending to generate dynamically gauge bosons (including gravitons in this category) lies in\nthe fact that the energy-momentum tensor has to be identically zero if massless particles with\nspin ≥ 1 appear and one insists in the energy momentum tensor being Lorentz covariant.\nHowever, our results, while not constituting a mathematical proof, strongly indicate that one\ncan indeed get in 4D an effective low-energy theory with massless composite gravitons, so it\nis legitimate to ask why Weinberg and Witten theorem would not apply. We note something\npeculiar in our model, namely the energy-momentum tensor (derived in [5] for 2D and which\nis exactly the same in 4D) does not have tangent (Lorentz) indices. In fact Lorentz indices are\nof an internal nature in the present approach as we will see below. The connection between\nLorentz and world indices appears only after a vierbein is dynamically generated. But then\none is exactly in the same situation as General Relativity where the applicability of [9] is\nexcluded.\nThe dynamical generation of geometry, combined with the usual renormalization group\narguments have rather interesting consequences. Geometry and distance are induced rather\nthan fundamental concepts. At sufficiently short scales, when the effective action does not\nmake sense anymore, the physical degrees of freedom are fermionic. Below that scale there\nis not even the notion of distance: in a sense that is the shortest scale that can exist. This\nprecludes the existence of an ultraviolet fixed point advocated by some [11] but also indicates\nthat at short distances gravity is non-Wilsonian, suggested by others [12] in an holographic\n2\n\n\fcontext.\nThis paper is organized as follows: in Section 2 we review the similarities and differences\nbetween the 2D and 4D theories and discuss possible counterterms. In Section 3 we study the\nequations of motion and revise the calculational set-up. Section 4 is devoted to the explicit\n1-loop calculation of the one, two and three point functions of the model. In Section 5 we\nsummarize the divergent content of the effective theory and make use of the equations of\nmotion to prove the on-shell renormalizability of the model at leading order. In Section 6 the\nfinal effective action is written down and the connection between the free constants of the\ntheory and the physical universal constants of gravity is discussed. Finally in Section 7 we\nsummarize our results and discuss possible extensions.\n\n2\n\n2-dimensional model review and 4 dimensional extension\n\nWe showed in [5] that a consistent and renormalizable 2D model reproducing gravity at long\ndistances could be built. The same model can be considered in 4D. The free Lagrangian\ndensity is\n\u0010\n\u0011\n\u0010\n\u0011\n(1)\nL0 = iψ̄a γ a ∂μ + iwμbc σbc χμ + iχ̄μ γ a ∂μ + iwμbc σbc ψa ,\n\nwhere ψa and χμ are two species of fermions transforming, respectively, under Lorentz (a, b...\nare tangent space indices) and Diffeomorphisms (μ, ν... are world indices). A spin connection\nis added to the derivative to preserve the Lorentz×Diff symmetry1 under local coordinate\ntransformations. It is important to notice that there is no metric to start with; there is no\nneed of one as long as χμ transforms as a spinorial density. The interaction term in the\nmodel, in euclidean conventions, is provided by\n\u0001\nLI = iBμa (ψ̄a χμ + χ̄μ ψa ) + c det Bμa ,\n(2)\n\nwhich obviously does not require any metric to be formulated either. We will assume that\nwe have N species of the previous fermions but we will not add an additional index to avoid\ncomplicating the notation. Note that for all practical purposes, Lorentz symmetry is an\ninternal symmetry at this point.\nThe object of the interaction (2) is to trigger the spontaneous breaking of the global\nsymmetry via fermion condensation. Upon use of the equations of motion for the auxiliary\nfield Bμa\n1\n(3)\nǫaa ...a ǫμμ2 ...μD Bμa22 ...BμaD\nψ̄a χμ + χ̄μ ψa = −ic\nD\n(D − 1)! 2 D\nand thus\n\nhψ̄a χμ + χ̄μ ψa i 6= 0 ←→ Bμa 6= 0.\n\n(4)\n\nIf a non-zero value for the fermion condensate appears the field Bμa acquires an expectation\nvalue. Such condensation was seen to happen in 2D (in the large N limit) and it will be\npresent in 4D even for finite values of N as we will see in a moment. Small perturbations\nabove this vacuum expectation value will yield the effective theory of quantum excitations of\nthe theory. Our approach will be a perturbative one and it will correspond to a weak field\nexpansion around the solution for wμab = 0.\n1\n\nWe actually use euclidean conventions but still refer to SO(D) as Lorentz symmetry. Note that (1) is not\nthe usual Dirac coupling of fermions to a connection (that requires use of a metric). The field χμ in general\nhas a spin 1/2 and 3/2 components in general, although this statement really makes no sense until a metric\nis defined.\n\n3\n\n\fOn translational invariance grounds, for wμab = 0 the vacuum of the theory is obtained\nfrom the gap equation for the potential\nZ\ndD k\na\nVef f = c det(Bμ ) − 2N\ntr(log(γ a kμ + iBμa )).\n(5)\n(2π)D\nNote that the 2N preceding the integral comes from the 2N species of fermions present.\nDeriving (5) w.r.t. Bμa we obtain\nD\nc\nǫaa ...a ǫμμ2 ...μD Bμa22 ...BμaD\n− 2N i tr\nD\nD! 2 D\n\nZ\n\ndD k\n(γ a kμ + iBμa )−1 |μa = 0.\n(2π)D\n\n(6)\n\nThis equation has a general non-trivial solution corresponding to Bμa = M δμa (or any SO(D)×\nGL(D) global transformations of this). This is analogous to the more familiar phenomenon of\nchiral symmetry breaking in strong interactions and any value of Bμa in the SO(D) × GL(D)\norbit is equivalent. For simplicity we will take Bμa = M δμa and then the gap equation reduces\nto an equation for M . In 4D\nZ\nM\ndD k\n3\n=0\ncM − 2N\nD\n2\n(2π) k + M 2\n(7)\n\u0013\n\u0012\nM3 2\nM2\n3\ncM + N 2\n− log\n− γ + 1 =0,\n8π\nǫ\n4πμ2\nwhose formal solution is\nM 2 = μ2 e8π\ndc\nμ dμ\n\n2 c(μ)/N\n\n,\n\n(8)\n\nN\n− 4π\n2,\n\n=\nmaking M a renormalization-group invariant. In the previous, we inwhere\ntroduced the usual mass scale μ to preserve the correct dimensionality of the D-dimensional\nintegral as dimensional regularization is used. For the solution to actually exist we have to\nrequire c > 0 if M > μ. If μ > M the solution exists only if c < 0. Therefore c > 0 will be\nthe case we are interested in on physical grounds.\nNote that Bμa has the right structure to be identified as the vierbein, and as it was shown\nin [5], it consistently reemerges in the 2D effective theory to form the determinant of the\nspontaneously generated metric.\nThe free fermion propagator of the theory in the broken phase can then be easily found\nafter replacing Bμa by its vacuum expectation value. With a 4D matrix notation\n∆\n\n−1\n\ni\n\n(k)\n\nj\n\n−i\n=\nM\n\n\u0012\n\nγ i (6 k − iM )kj\nδj−\nk2 + M 2\ni\n\n\u0013\n\n.\n\n(9)\n\nA particularity of 2D was that the most general form for Bμa (in euclidean conventions)\nis a conformal factor times a scale M times a δμa . This means that perturbations around\nthe minimum of the potential can only have one physical degree of freedom, the conformal\nparameter. The other degrees of freedom in Bμa can be removed by suitable coordinate\ntransformations and are thus unphysical (recall that the microscopic theory is fully generally\ncovariant –even without a metric).\nThe main difference of the 4D case with respect to the 2D case is that the maximum\nnumber of possible physical degrees of freedom for a perturbation around the value Bμa =\nM δμa grows up to six instead of one, making the calculation much more complex. Clearly,\nconsidering a uni-parametric family of perturbations is far too simple in 4D and does not\n4\n\n\fyield enough information to find the long-distance effective action unambiguously. To by-pass\nthis difficulty, but still keeping the calculation manageable, we have chosen to restrict our\nconsiderations to diagonal perturbations, where\nBji (x) = M δji e−\n\nσi (x)\n2\n\n( no sum over i ).\n\n(10)\n\nThis form contains four degrees of freedom (rather than six) but is rich enough for our\npurposes. The validity of our conclusions rely on the assumption that the effective action\nshould be covariant (exactly as the microscopic theory is). This was actually checked in the\n2D case using heat kernel techniques. Here we have performed partial checks but we have to\nassume that covariance holds to draw our conclusions.\nAnother difference with respect to the 2D case is that the integrals involved in the perturbative calculation have potentially a much worse ultraviolet behavior in 4D. We postpone to\nSections 3 and 4 the explicit calculations that indicate that the nice characteristics found in\nthe 2D model, in particular renormalizability, persist in the 4D case. However the ultimate\nreason for renormalizability lies in the very limited number of counterterms that can be written without a metric (and the usual assumption that the ultraviolet behavior is unaltered by\nthe phenomenon of spontaneous symmetry breaking).\n\n2.1\n\nPossible counterterms\n\nBefore tackling the perturbative derivation of the effective action it is important to list the\npossible invariants one can write in this theory without making use of a metric. In 2D we\nhad, as already explained, two invariants that could be constructed without having to appeal\nσ\nto a metric, namely L0 and LI . The latter, upon use of the parametrization Bμa = M e− 2 ,\nreduces to\nZ\nZ\n1\n√ 2\na b μν\n2\n2\ng d x,\n(11)\nBμ Bν ǫ ǫab d x = M\n2!\ni.e. is the cosmological term. In addition,\nthere is the curvature term which in 2D, which in\nR\nterms of the connection is simply d2 x dw, purely topological; therefore we do not expect\nit to appear in the perturbative calculation. Then, apart from the free kinetic term for the\nfermions, there is only one invariant term that can be written down without a metric. Or what\nit is tantamount, only one possible counterterm remains to absorb any divergence appearing\nin the perturbative calculation after integrating out the fermions. This fact enforces the\nrenormalizability of the 2D model in the large N limit in spite of the bad ultraviolet behavior\nof the integrals. This argument was supported by the explicit calculations presented in [5].\nNow in 4D we can write, in addition to L0 and LI , three more counterterms\nZ\n1\nSD =\nBμa Bνb Bρc Bσd ǫabcd ǫμνρσ d4 x\n(12)\n4!\nZ\n1\nR[μν]ab Bρa Bσb ǫμνρσ d4 x\n(13)\nSR =\n2\n\nwhere R[μν]ab = [∇μac , ∇νcb ]. Note that SD corresponds to the integral over the manifold\nof the determinant of Bμa . After integrating the fermion fields only SD and SR can appear\nif general covariance is preserved. We will denote by LD and LR the respective Lagrangian\ndensities.\nFinally, there is yet another counterterm one could write without making use of a metric, namely the Gauss-Bonnet topological invariant in 4D, which is of O(p4 ) in the usual\nmomentum counting.\n5\n\n\fWe did not include the term SR in our action to start with because it does not contain\nthe fermionic fields. It modifies neither the equation of motion (3) for the auxiliary field Bμa\nnor the gap equation (7) if the connection wμ is set to zero as we initially do (recall that we\nuse a weak field expansion and wμ = 0 is used to determine the vacuum). However, we see\nthat SR is an allowed counterterm in 4D and therefore it needs to be included in the initial\naction. In fact, any divergence in the theory must be reabsorbable in the two terms SD and\nSR , as they are the only local counterterms one can write before the symmetry breaking, i.e.\nbefore the generation of the metric.\nWhen the auxiliary field Bμa is identified with the vierbein, the parametrization (10) and\nthe equations of motion are used the two counterterms reduce to\nZ\nZ\n√\n√ 4\n2\n4\ng d x,\nM\ngR d4 x,\n(14)\nM\nrespectively; i.e. the familiar cosmological and Einstein terms. This will be explained in more\ndetail in the next section.\n\n3\n\nEquations of motion\n\nLet us write explicitly what the 4D counterterms look like once we replace Bμa by its vacuum\nexpectation value plus perturbations around it. To keep the notation simple, let us consider\nthe case in (10) when σi (x) = σ(x) (conformally flat metric). For Bμa = M eaμ = M e−σ/2 δμa\nwe have\n1\nLD = Bμa Bνb Bρc Bσd ǫabcd ǫμνρσ = M 4 e−2σ\n(15)\n4!\nand\n1\n1\nR\nB a B b ǫμνρσ = (∂μ wνμν − ∂ν wμμν + wμμc wνcν − wνμc wμcν )e−σ M 2 .\n(16)\n2 [μν]ab ρ σ\n2\nNote that because eaμ = δμa we can use indistinctively greek and latin indices; they are lowered\nand raised with a trivially flat metric. This is somewhat similar to what happens in linearized\ngravity where indices are lowered and raised with ημν .\nLet us now work out the equations of motion for the full Lagrangian L0 + LI + LR . In\nSection 2 we already discussed the equations of motion for the field Bμa when wμab = 0. In\naddition we have\n\u0013\n\u0012\nδL\nδ(L0 + LI + LR )\nδ(L0 + LI + LR )\n=∂ρ\n−\n=0\nab\nab\nδwμ\nδ∂ρ wμ\nδwμab\n\u0001\n1\n(17)\n= −∂a σδbμ + ∂b σδaμ − δaμ wνbν − δbμ wννa + wabμ + wbμa e−σ\n2\n1\n− 2 (ψ̄c γ c σab χμ + χ̄μ γ c σab ψc ) = 0.\nM\nTo solve (17) we will only consider the lowest order term in the 1/M 2 expansion, following the\nusual counting rules in effective Lagrangians based on a momentum expansion. The general\nsolution for the connection is then\n1\n(18)\nwμab = (∂ a σδμb − ∂ b σδμa ).\n2\nThis is precisely the usual condition between the spin connection and the vierbein in General\nRelativity (19), characteristic of the Palatini formalism[13]\nwμab = eaν ∂μ E νb + eaν E ρb Γνμρ\n6\n\n(19)\n\n\fparticularized to a conformally flat metric given by eaμ = δμa (E ρb is the inverse vierbein).\nMaking use of (18) in (16) we are now allowed to identify the curvature in terms of the scalar\nfield σ\n\u0013\n\u0012\n1\n3\nμ\n2√\n(20)\n\u0003σ − ∂μ σ∂ σ e−σ M 2\nLR |(on shell) = M gR =\n2\n2\nNote that in the particular case of a vierbein corresponding to a conformally flat metric one\ncan integrate by parts either of the terms in (20) to obtain the other\n√\n\n3\n1\n3\nσ2 σ3\ngR = M 2 (\u0003σ − ∂μ σ∂ μ σ)e−σ = M 2 (\u0003σ)(1 − σ +\n−\n+ ...)\n2\n2\n4\n2\n6\n\n(21)\n\nThis term plus a constant times (15) are the only divergences that should appear in the final\neffective theory upon integration of the fermionic fields for this particular type of perturbations above the vacuum (i.e. those interpretable as a conformally flat metric).\nAs previously mentioned we shall consider a more general type of perturbations; namely,\nwe will use the diagonal parametrization of the perturbations around the vacuum solution\ngiven by (10). This is not the most general one in 4D, but it is enough for our purposes.\nAfter the identification of Bμa with the vierbein, this corresponds to a metric\n\ngμν\n\n\n −σ1 (x)\ne\n0\n0\n0\n 0\ne−σ2 (x)\n0\n0 \n.\n=\n−σ\n(x)\n 0\n0\ne 3\n0 \n0\n0\n0\ne−σ4 (x)\n\n(22)\n\nThis parametrization provides enough generality to the calculation. We can now derive the\nequivalent expression to (18) for the general diagonal perturbation using (19) to obtain 2\n σ\naρ \nb\nσ1\n1\n0\n0\n0\n0\n0\n0\ne2\n∂ρ σ1 e− 2\n\nσ2\nσ2\n \n\n1\n0\n0  \n0\n0\n0\n∂ρ σ2 e− 2\n 0 e2\n\nab\n\nσ3\nσ3\nwμ =  \n \n\n−\n2\n2\n2  0\n\n0 e\n0\n0\n∂ρ σ3 e\n0  \n0\nσ4\nσ4\n− 2\n2\n0\n0\n0 e\n0\n0\n0\n∂ρ σ4 e\nμ\n σ1\nbρ \na \nσ1\n−\n0\n0\n0\n0\n0\n0\ne2\n∂ρ σ1 e 2\nσ2\nσ\n\n\n\n \n− 22\n2\n0\ne\n0\n∂\nσ\ne\n0\n0\n0\n0\n\n \n \nρ 2\nσ3\nσ3\n−\n.\n \n \n−\n 0\n \n0  \n0\n0 e2\n0\n0\n∂ρ σ3 e 2\n\nσ4\nσ4\n0\n0\n0 e2\n0\n0\n0\n∂ρ σ4 e− 2 μ\n(23)\nMaking use of the equations of motion one can compute the corresponding LR for the general\n2\n\nAgain we emphasize that although it may seem strange to see latin indices in the derivatives this should\nnot confuse the reader. After the symmetry breaking a vierbein is generated relating world indices with\ntangent space ones through δμa . In the expression (23) we have compiled the entries for wμab in a bi-matrix\nform, but they should not be multiplied; only the index ρ is summed up.\n\n7\n\n\fcase and expand it in the σ fields. The result up to two sigma fields reads\n\u0002\n√\nLR |(on shell) =M 2 gR = M 2 ∂32 σ4 + ∂22 σ4 + ∂12 σ4 + ∂42 σ3 + ∂22 σ3 + ∂12 σ3\n\n+∂42 σ2 + ∂32 σ2 + ∂12 σ2 + ∂42 σ1 + ∂32 σ1 + ∂22 σ1\n1\n− (∂3 σ1 ∂3 σ2 + ∂4 σ1 ∂4 σ2 + ∂2 σ1 ∂2 σ3 + ∂4 σ1 ∂4 σ3 + ∂2 σ1 ∂2 σ4 + ∂3 σ1 ∂3 σ4\n2\n+∂1 σ2 ∂1 σ3 + ∂4 σ2 ∂4 σ3 + ∂1 σ2 ∂1 σ4 + ∂3 σ2 ∂3 σ4 + ∂1 σ3 ∂1 σ4 + ∂2 σ3 ∂2 σ4 )\n\u0003\n+O(σ 3 ) .\n(24)\nMore details on the calculation of (24) can be found in the Appendix. Ignoring for a moment\nthe Gauss-Bonnet invariant, the divergent terms from the perturbative calculation for the\ngeneral perturbation should match on shell either with (24) or with\n√\nLD |(on shell) = M 4 g = M 4 e−\n\nP\n\ni σi\n2\n\n.\n\n(25)\n\nAn extension to the most general perturbation with the full six degrees of freedom should\nbe possible but would require much more effort, which we consider unnecessary at this point as\nthe above parametrization provides enough redundancy. Since the coefficients for the terms in\nthe effective action are universal there should be no loss of generality in the present approach.\nThis of course assumes that general covariance is kept all along the derivation of the effective\naction and by the regulator, as it should be the case in dimensional regularization.\nSo far we have explained how the 2D model can be consistently extended to 4D preserving\nthe key features. We study small perturbations around a constant vacuum expectation value\nfor the field Bμa (which does not need to be small itself) corresponding to the solution of the\ngap equation for wμab = 0. In such a theory one can write a limited number of counterterms\nwithout making use of a metric. These counterterms are consistent with the usual terms of\nGR once used the equations of motion. With all these ingredients we are ready to move to\nthe actual perturbative derivation of the effective action.\n\n4\n\n1-loop structure for a general diagonal perturbation\n\nThe effective action that describes perturbations above the trivial vacuum\nwμab = 0,\n\nBμa = M δμa ,\n\n(26)\n\nwill be given by a polynomial expansion in powers of wμ (x), σi (x) and their derivatives\nobtained after integration of the fundamental degrees of freedom. In this section we will\nderive this effective action diagrammatically.\nWe shall use the diagonal perturbation (10) with 4 degrees of freedom for the vierbein\nperturbations. For simplicity, we will calculate only the one-point and two-point functions\nfor this rather general case and then particularize to the conformal case (σi (x) = σ(x)) to\ncompute some three-point functions.\nSince perturbation theory in this model has some peculiar features (note in particular the\nbehavior of the fermion propagator) in what follows we shall provide enough details so that\nthe diagrammatic calculation can be reproduced.\nStarting from the Lagrangian density L0 +LI described in Section 2 (note that LR plays no\nrole whatsoever in the integration of the N species of fermions), and using a parametrization\nof Bμa given by (10), the interaction vertices are\n8\n\n\f\u0001\n\u0001\n\u0001\n\n1\ni M δiμ\n2\n\nσi\n\nσi\n\n1\n− i M δi μ\n8\n\n(27)\n\nσi\n\nσi\nσi\n\ni\n\n1\nM δi μ\n48\n\nσi\n\n4.1\n\nOne and two point functions for the fields σi\n\nWith the rules described above and using the propagator (9) we can calculate the first 1-loop\ndiagrams for D = 4 − ǫ. We will not include the factor N in the diagrammatic results presented below. The vacuum bubble diagram is\n\n\u0001\u0002\nk\n\nk\n\n+\n\n= −2Tr\n\n\u0014Z\n\n(28)\n\n\u0012\n\u0012\n\u0013\n\u0013\n\u0015\nM2\ndD k −1 μ\nM3 2\na\n∆\n(k)\n(−i)δ\n−\nlog\n−\nγ\n+\n1\n.\n=\n−\na\nμ\n(2π)D\n2π 2 ǫ\n4πμ2\n\n\u0001\u0002\n\nWe also compute the one-point function for the different vertices\nk\n\nσj\n\n=−\n\n4\nX\nj=1\n\n2\nσj Tr\n2\n\n\u0014Z\n\nk\n\n+ σj\n\n\u0012\n\u0012\n\u0013\n\u0013\n\u0015 X\n4\ndD k −1 μ\nM2\nσj M 4 2\nj\n∆ (k) j (i)M δ μ =\n− log\n−γ+1 ,\n(2π)D\n16π 2 ǫ\n4πμ2\nj=1\n\n(29)\n\n9\n\n\f\u0001\u0002\n\nσj\n\nσj\n\nk\n\nk\n\n+\n\n=−\n\n4\nX\n\nσj2\n\nj=1\n\n2! 2\nTr\n2! 2 * 2\n\nσj\n\u0014Z\n\nσj\n\n\u0012\n\u0012\n\u0013\n\u0013\n\u0015\n4\n4\nX\ndD k −1 μ\nM2\n2\n2 M\nj\nσj\n∆ (k) j (−i)M δ μ = −\n− log\n−γ+1 .\n(2π)D\n32π 2 ǫ\n4πμ2\nj=1\n\n(30)\nLet us, for this particular diagram, clarify what the origin of the numerical factor is. In the\nnumerator, the 2! comes from the combinatorial possible connections of the external fields\nσi . The other 2 is due to the two species of fermions and it is present in all diagrams. In\nthe denominator, 2!2 * 2 comes from the vertex. Since it is a one point function there are no\nadditional factors, however for n-point functions the corresponding n! will be present in the\ndenominator.\n\n\u0001\u0002\n\u0001\u0002\nσj\n\nσj\n\nk\n\nσj\n\n=−\n\n4\nX\nj=1\n\n3! 2\nTr\n3! 2 * 2 * 2\n\nk\n\n+ σj\n\nσj\n\u0014Z\n\nσj\n\n\u0012\n\u0012\n\u0013\n\u0013\n\u0015 X\n4\nσj3 M 4 2\nM2\ndD k −1 μ\nj\n− log\n∆ (k) j (i)M δ μ =\n−γ+1 .\n(2π)D\n64π 2 ǫ\n4πμ2\nj=1\n\n(31)\n\nNext diagram is the two-point function\nk+p\n\nσj\n\n=−\n=\n\n4\n4 X\nX\nj=1 l=1\n\n4\nX\nj=1\n\nσj σl\n\n2! 2\nTr\n2! * 2 * 2\n\nk+p\n\nσl + σj\n\nk\n\u0014Z\n\nσl\n\nk\n\ndD k\n\niM δl μ ∆−1 (k)μj iM δjν ∆−1 (k + p)νl\n(2π)D\n\n\u0015\n\n\u0014\n\u0012\n\u0012\n\u0012\n\u0013\n\u0012\n\u0013\n\u0013\n\u0013\n4\nX\nσj σl M 4 2\nσj σl p 2 M 2 2\nM2\nM2\n2\n1\n−\n−\nlog\n−\nlog\n−\nγ\n+\n−\nγ\n−\n−\n16π 2\nǫ\n4πμ2\n3\n48π 2\nǫ\n4πμ2\n3\nl=1\nl 6= j\n\n\u0012\n\u0012\n\u0013\n\u0013#\nσj σl (p2j + p2l )M 2 2\nM2\n1\n− log\n−γ−\n+\n48π 2\nǫ\n4πμ2\n2\n#\n\"\n4\nX\nσj2 M 4 σj2 M 2 p2 σj2 M 2 p2j\n+\n−\n+ O(p4 ).\n+\n+\n32π 2\n32π 2\n32π 2\nj=1\n\n10\n\n(32)\n\n\fThe numerical factor in this case is composed by 2! 2 in the numerator from the possible\ncontractions of external fields times the two species of fermions. And 2! in the denominator\nfrom the diagram being a two-point function and finally the 1/2 from each vertex. We will\nnot elaborate on the combinatorial factors anymore but we write all factors explicitly, even\nif the notation may be a bit cumbersome, in order to facilitate the check of our results. By\nO(p4 ) we mean finite higher order in p2 contributions.\n\n4.2\n\nDiagrams with wμab\n\n\u0001\n\nNow we turn to the diagrams that contain a field wμab . The corresponding vertex is\n\nwμbc\n\niγ a wμbc σbc =\n\nγa\n[γb , γc ].\n4\n\n\u0001 \u0002\n\u0001 \u0002\n\n(33)\n\nThe one and two point functions yield\nk\n\nwμ\n\n= −2Tr\nthen\n\nk\n\n+ wμ\n\n\u0014Z\n\n\u0015\ndD k a\n−1\nμ\niγ σbc ∆ (k) a = 0\n(2π)D\n\nk+p\n\nwμ\n\nk+p\n\nσj + wμ\n\nk\n\n=−\n\n4\nX\nj=1\n\n2\nTr\nσj\n2! * 2\n\n\u0014Z\n\n(34)\n\nσj\n\nk\n\n\u0015\ndD k a\nμ\n−1\nd\n−1\nν\niγ σbc ∆ (k) d iM δ ν ∆ (k + p) a = 0.\n(2π)D\n\n11\n\n(35)\n\n\f\u0001 \u0002\n\nSuggesting that diagrams containing only one field wμab are zero. For two wμab fields we have\nk+p\n\nwμ\n\nk+p\n\nwν + wμ\n\nk\n\n\u0014Z\n\ndD k\n\nwν\n\nk\u0015\n\n2! * 2\nTr\niγ a σbc ∆−1 (k)μd iγ d σef ∆−1 (k + p)νa\n=−\n2!\n(2π)D\n\u0012\n\u0012 2 \u0013\n\u0013\u0014 2\n2\nM\nM\n1\n(36)\n=\n− log\n(δbe δcν δfμ − δbe δcf δμν + δbf δce δμν − δbf δcν δeμ\n−γ+\n2\nǫ\n4πμ\n4\n4π 2\ni\n\u0001\nM2\n+δbν δcf δeμ − δbν δce δfμ ) +\nδbf δeν δcμ − δbe δcμ δfν + δbμ δce δfν − δbμ δeν δcf\n2\n16π\n1 μν\n2\n2\n+ F bcef (p ) + O(p )\n\u0012 2 \u0013\n\u0015\n\u0013\u0014 2\n\u0012 ǫ\nM\nM 2 μν\n1\nM\n1\n2\nμν\n− log\nD\n+\nE bcef + F μνbcef (p2 ) + O(p2 )\n−\nγ\n+\n=\nbcef\n2\n2\n2\nǫ\n4πμ\n4\n4π\n16π\nǫ\n\nWhere F μνbcef is a complicated structure composed of external momenta and Kronecker\ndeltas of order O(p2 ). This divergence is of higher order, in the 1/M 2 expansion, than the\none of D μν bcef . Now, taking into account that wμbc = −wμcb , we can show that\nD μν bcef wμbc wνef = 4wμνb wνμb − 2wμbe wμbe = 0;\n\nE μν bcef wμbc wνef = 4wμμb wνbν\n\n(37)\n\nMore details can be found in the appendix.\n\n4.3\n\nThree-point functions\nσ(x)\n\nIn order to keep the calculations simple, we particularize to the case Bμa = M e− 2 δμa . The\nprevious results, (28-37) are all valid taking σi = σ, i = 1, 2, 3, 4. With this simplification we\ncan easily further compute more diagrams. For the field σ we have\n\n\u0001\u0002\u0003\u0004\n\nσ\n\nσ\n\nk+p+q\n\nk+p+q\n\nk\n\nk+p+q\n\nσ\n\n+σ\n\nk\n\nσ\n\n\u0014Z\n\nσ\n\nσ +σ\n\nσ+\n\nσ\n\nk+p+q\n\nk\n\ndD k\n\nσ\n\nk\n\nσ\n\n\u0015\n\n222\nTr\n(−i)M δaμ ∆−1 (k)μb iM δbν ∆−1 (k + p + q)νa\n2! 2! * 2 * 2 * 2\n(2π)D\n\u0014Z\n\u0015\ndD k\n222\nμ\na\n−1\nb\n−1\nν\n−\nTr\n(−i)M δ μ ∆ (k + p) b iM δ ν ∆ (k + p + q) a\n2! 2! * 2 * 2 * 2\n(2π)D\n\u0014Z\n\u0015\ndD k\n222\nμ\na\n−1\nb\n−1\nν\nTr\n(−i)M δ μ ∆ (k + q) b iM δ ν ∆ (k + p + q) a\n−\n2! 2! * 2 * 2 * 2\n(2π)D\n\u0012\n\u0012\n\u0013\n\u0013\nM2\n1\n9M 4 2\n− log\n−γ+\n=\n16π 2 ǫ\n4πμ2\n3\n\u0012 2 \u0013\n\u0012\n\u0013\n2\n2\n2\n2\nM\nM (p + (p + q) + q ) 2\n2\n+\n−\nlog\n−\nγ\n−\n+ O(p4 )\n32π 2\nǫ\n4πμ2\n3\n\n=−\n\n+....\n\n12\n\n(38)\n\n\fAnd also\n\n\u0001\u0002\n\nσ\n\nσ\n\nk+p+q\nσ +\n\nk+p\n\nσ\n\nk\n\nσ\n\u0014Z\n\ndD k\n\nσ\n\n\u0015\n3! 2\nμ\nd\n−1\nρ\n−1\nb\n−1\nν\nTr\niM ∆ (k) b iM δ ν ∆ (k + p + q) d iM δ ρ ∆ (k + p) a\n=−\n3! 2 * 2 * 2\n(2π)D\n\u0014Z\n\u0015\ndD k\n3! 2\nμ\n−1\nb\n−1\nν\nd\n−1\nρ\n−\nTr\niM ∆ (k) b iM δ ν ∆ (k + p + q) d iM δ ρ ∆ (k + q) a\n3! 2 * 2 * 2\n(2π)D\n\u0012\n\u0012\n\u0013\n\u0013\n\u0013\n\u0012 2\nM2\n(p + q)2\nq2\n2\np\n3M 4 2\n2\n− log\n+\n+\n−γ−\n+ O(p4 )\n−M\n= 2\n8π\nǫ\n4πμ2\n3\n32π 2\n32π 2\n32π 2\n\n\u0001\u0002\n\n(39)\n\nOn the other hand, for the field wμab we can compute\nσ\n\nk+p\n\nσ\n\nk+p+q\nwμ +\n\nwμ\n\nk\n\nσ\n\u0014Z\n\ndD k\n\nσ\n\n\u0015\n2! 2\nμ\na\n−1\nd\n−1\nν\ne\n−1\nρ\n=−\nTr\niγ σbc ∆ (k) d iM δ ν ∆ (k + p + q) e iM δ ρ ∆ (k + p) a\n3! 2 * 2\n(2π)D\n\u0014Z\n\u0015\ndD k a\n2! 2\nμ\n−1\nd\n−1\nν\ne\n−1\nρ\nTr\niγ\nσ\n∆\n(k)\niM\nδ\n∆\n(k\n+\np\n+\nq)\niM\nδ\n∆\n(k\n+\nq)\n−\nbc\nν\ne\nρ\na = 0.\nd\n3! 2 * 2\n(2π)D\n(40)\nAnd finally\n\n\u0001\u0002 \u0003\u0004\n\nwν\n\nk+p\n\nwμ\n\nwν\n\nk+p+q\nσ +\n\nσ + k+p\n\nk\n\nwν +....\n\nk\n\nwμ\n\nσ\n\nwμ\n\n\u0014Z\n\nσ\n\nk+p+q\nwν +\n\nwμ\n\ndD k\n\n\u0015\n3 2! 2\nμ d\na\n−1\n−1\nν\ng\n−1\nρ\n=−\nTr\niγ σbc ∆ (k) d γ σef ∆ (k + p + q) g iM δ ρ ∆ (k + p) a\n3! * 2\n(2π)D\n\u0014Z\n\u0015\ndD k a\n3 2! 2\nμ\n−1\nd\n−1\nν\ng\n−1\nρ\nTr\niγ σbc ∆ (k) d iγ σef ∆ (k + p + q) g iM δ ρ ∆ (k + q) a\n−\n3! * 2\n(2π)D\n\u0012 2 \u0013\n\u0013\u0014\n\u0015\n\u0012\nM\n3\nM 2 μν\nM 2 μν\n2\n− log\nD\nE bcef + O(p2 ).\n−\nγ\n−\n−\n−\n=\nbcef\nǫ\n4πμ2\n4\n4π 2\n16π 2\nWith D μν bcef and E μν bcef being the same as in (36)\n\n13\n\n(41)\n\n\f5\n\nSummary of divergences\n\nIn the previous section we obtained the results of the one-, two- and three-point functions\nfor a general diagonal perturbation, sometimes particularizing to a conformally flat metric to\nease the notation. Let us now summarize the results.\nThe divergent part of diagrams (28-31) together with the M 4 piece of diagram (32) add\nup in the effective action to3\nP\n\nM 4 e−\n8π 2\n\ni σi\n2\n\n\u0012\n\n2\n− log\nǫ\n\n\u0012\n\nM2\nμ2\n\n\u0013\u0013\n\n.\n\n(42)\n\nNote that this term's dimensionality matches (15). Furthermore, it can be proved that the\ndivergent terms in (32) proportional to M 2 p2 are precisely those corresponding to (24) in\nmomentum space, thus allowing us to recover the first orders of LR for the general diagonal\n√\nperturbation, which on shell correspond to gR.\nDiagram (36) has two divergent terms and neither seem to immediately correspond to\nany of the possible counterterms discussed so far. The first one, that corresponding to\n√\nD μν bcef , is of order M 2 gR. The other, corresponding to F μνbcef is of higher order, i.e.\n√ 2\nO( gR ). Before addressing these apparent new divergences let us particularize to the case\nof a conformally flat perturbation above the vacuum. Taking σi = σ, (28-31) plus (32) add\nup in the effective action to\n\u0012 2 −σ \u0013\n\u0012\n\u0012\n\u0013\n\u0013\n\u0013\nσ \u0012\nM e\nM2\n3\n3\nM 4 e−2σ+ 2 ǫ 2\nM 4 e−2σ 2\n− log\n− log\n−γ+\n−γ+\n=\n. (43)\n8π 2\nǫ\n4πμ2\n2\n8π 2\nǫ\n4πμ2\n2\nσ\n\nAn important remark is in order at this point. Note the peculiar form of e−2σ+ 2 ǫ : this factor\ncorresponds to the determinant of a conformally flat metric in D = 4 − ǫ dimensions and it is\na remanent of the fact that we used dimensional regularization to calculate the momentum\n√\n√\nintegrals. Of course limǫ→0 gD = g (where gD is the determinant of the D-dimensional\nmetric), but this is telling us that in order to regularize our integrals it is not enough to add\na mass scale to match the dimensionality; an ǫ power of the determinant of the metric is also\nneeded to ensure diffeomorphism invariance. That is μ2 → μ2 e−σ . Then (43) would read\n\u0012 2 \u0013\n\u0012\n\u0013\nM\n3\nM 4 e−2σ 2\n− log\n−γ+\n.\n(44)\n8π 2\nǫ\n4πμ2\n2\nContinuing with the divergences, diagrams (38) and (39) contain terms of order M 4 that are\nthe subsequent orders of the expansion of (43) in terms of σ. As for the terms of order p2 ,\none has to express them in position space. The result of diagram (32) for instance is\n\u0012 2\u0013\n\u0012\n\u0013\nσp2 σM 2 2\nM\n2\n−\n−\nlog\n−\nγ\n−\n(45)\n16π 2\nǫ\n4π\n3\nthat in position space reads\nσ\u0003σM 2\n16π 2\n\n\u0012\n\n2\n− log\nǫ\n\n\u0012\n\nM2\n4π\n\n\u0013\n\n−γ−\n\n2\n3\n\n\u0013\n\n.\n\n(46)\n\n3\nNote that factors 1/n!, where n is the number of identical external legs, and a sign flip, are needed to\nreconstruct the term in the effective action from the diagrammatic calculation.\n\n14\n\n\fThe next diagrams we consider are (38) plus (39)\n\u0012 2\u0013\n\u0012\n\u0013\nM\nM 2 σ 2 (p2 + (p + q)2 + q 2 )σ 2\n5\n− log\n−γ−\n,\n32π 2\nǫ\n4π\n3\nor in position space\n−\n\n3M 2 σ 2 \u0003σ\n32π 2\n\n\u0012\n\n2\n− log\nǫ\n\n\u0012\n\nM2\n4π\n\n\u0013\n\n−γ−\n\n5\n3\n\n\u0013\n\n.\n\n(47)\n\n(48)\n\nNow it is clear that the full calculation at order M 2 p2 resums to the following term in the\neffective action\n\u0012\n\u0012\n\u0013\n\u0013\nM2\n1\nM 2 \u0003σe−σ 2\n−\nlog\n−\nγ\n+\n.\n(49)\n32π 2\nǫ\n4πμ2\n3\n√\nNote that this term has the same structure that gR for a conformally flat metric. This\ndivergence can be absorbed by redefining LR and using the equations of motion. This is\nalready telling us that the theory is renormalizable only on shell4 . Namely when the spin\nconnection wμab corresponds to the Levi-Civita one. In our approach this identification is\nforced by the use of the equations of motion.\nFor a general diagonal perturbation one has to consider the momentum dependent O(p2 )\ndivergent pieces in (32) and similar diagrams with more external scalar legs. As a check\nwe can see that the momentum dependent terms with two σi fields faithfully reproduce the\nO(σ 2 ) piece in the curvature term (24) thus confirming the general covariance of the effective\naction. Details are relegated to the Appendix.\nLet us now retake the issue of the apparent new divergences emerging from (36). To\nsee if they really contribute to the final effective action we have to express them in terms\nof the σ fields using the available equations of motion. Then in principle, they must either\nvanish or correspond to a valid counterterm. We argued in Section 2 that there is a third\npossible counterterm in 4D, the Gauss-Bonnet term, which is a total derivative and should\nnot contribute to the dynamics. But it is reasonable that the higher order divergence in (32)\nconstitutes a piece of that term that will ultimately cancel. Full details of this calculation\ncan be found in the appendix showing how the lower order divergence vanishes and how the\nhigher order term indeed corresponds to a piece of the Gauss-Bonnet term, and in particular\nvanishes for the conformally flat parametrization of the metric.\n\n6\n\nEffective action and physical constants\n\nWe are now ready to write the effective action we obtain on shell; that is once the spin\nconnection is set to the value obtained after use of the equations of motion and the gap\nequation is used. We shall present details only for a vierbein corresponding to a conformally\nflat metric but as previously discussed we have a good check of its validity for the divergent\nparts of a general diagonal perturbation above the vacuum.\nWe recall our conventions. We have used euclidean conventions so that the (emerging)\nmetric has signature (+,+,+,+). The effective action at long distances is defined by the\nfunctional integral\nZ\n[dg] exp (−S[g]) ,\n\n4\n\n(50)\n\nPlease note that this is quite unrelated to the well known fact that pure gravity at one loop is finite\non-shell. The latter result corresponds to performing a one-loop calculation with gravitons. Here instead\nwe integrate the microscopic degrees of freedom that supposedly generate the gravitons after spontaneous\nsymmetry breaking and generation of the metric degrees of freedom.\n\n15\n\n\fwhere\ngμν = ηab eaμ ebν =\n\n1\nηab Bμa Bνb ,\nM2\n\n(51)\n\naccording to our discussion in Section 2.\nThe effective action obtained after the diagrammatic calculation of the previous sections\nis\n\u0012 \u0012 2\u0013\n\u0013\n\u0012\nZ\nM\n3\nM 4 −2σ\n4\n′\n4 −2σ\n−\nlog\nSef f =\nd x cM e\n− N 2e\n8π\nμ2\n2\n(52)\n\u0013\n\u0012\n\u0012\n\u0013\u0013\n2\n2\nM\nM\n28\n′\n2\n−σ\n−σ\n+A M \u0003σe − N\n\u0003σe\n−\nlog\n+ ...,\n32π 2\nμ2\n3\n\u0001\n\u0001\nN\nN\n2\n2\n′\nwhere c′ = c + 8π\n2\nǫ + log 4π − γ and A = A + 8π 2 ǫ + log 4π − γ are renormalized coupling constants that have absorbed the divergences. The M S subtraction scheme is assumed.\nNote that the finite part of the term proportional to M 2 has received a contribution from\nthe diagrams containing only wμab fields, see the appendix. Making use of the gap equation,\nwe can write the previous expression as\n\u0012\n\u0013\u0013\n\u0012 \u0012 2\u0013\nZ\nM2\nM\n28\nM 4 −2σ\n′\n−σ\n2\n−σ\n4\ne\n+ A \u0003σe M − N\n\u0003σe\n−\nSef f =\nd x N\n+ ...,\nlog\n16π 2\n32π 2\nμ2\n3\n(53)\nThe resulting effective theory thus describes a geometry with a cosmological term. Sometimes\nit is stated in the literature[15] that if gravity is an emergent phenomenon and gravitons\nare Goldstone bosons all interactions should be of a derivative nature and the cosmological\nconstant problem would be in a sense solved. This is not so, as we see a cosmological terms\nis generated necessarily (both in 2D and 4D), at least in the present approach.\nThe previous result is not exact of course. The effective action is in fact an infinite series\n√\ncontaining higher order derivatives, starting with terms of O( gR2 ) and so on, which are\nrepresented by the dots in the previous expression. In fact, as we have seen, a counterterm\n√\nproportional to Gauss-Bonnet (of order O( gR2 )) is required; finite terms will appear too.\nThe effective action should also contain a non-local finite piece corresponding to the conformal\nanomaly (of dimension four in 4D[14]). The conformal anomaly was indeed reproduced in\nthe previous work in 2D [5]. Note that any dimension four term that is generated will be\naccompanied by a factor of N . The dimension six terms will be of O(N/M 2 ) and so forth.\nIt would be natural to redefine the constant A′ to include this factor of N in order to keep\nthe counting of powers of N homogeneous.\nAppealing to covariance arguments we can now express (52) in terms of invariants\n\u0012 \u0012 2\u0013\n\u0013\u0013\n\u0012\n\u0015\n\u0014\nZ\nM\n28\nN\nN\n4√\n2√\n′\n4\nM g+ A −\nlog\n−\nM gR + ... .\n(54)\nSef f =\nd x\n16π 2\n48π 2\nμ2\n3\nNext we recall that the classical Einstein action corresponding to the euclidean conventions\nis[16]\nZ\nMP2\n√\n(55)\nS=−\nd4 x g(R − 2Λ).\n32π\nNow identifying\n\nMP2\nN\n4\nM\n=\n2Λ\n2\n32π\n\u0012\n\u0012 \u0012 2 \u0013 16π \u0013\u0013\nMP2\nM\nN\n28\nM 2 A′ −\n,\nlog\n−\n=\n−\n48π 2\nμ2\n3\n32π\n16\n\n(56)\n\n\fwe indeed obtain\nSef f\n\nMp2\n=−\n32π\n\nZ\n\nd4 x\n\n√\ng(R − 2Λ) + O(p4 ).\n\n(57)\n\nAs we see from the previous discussion, the integration of the fermions (assumed to be the\nfundamental degrees of freedom in the theory) yields a positive cosmological constant. As\nfor the value of MP2 , the Planck mass squared, the sign is not really automatically defined.\nMore on this latter.\n\n6.1\n\nFine-tuning and running of the constants\n\nTo ensure that the action is renormalization group invariant, thus observable, the following\nbeta function for each free constant in the theory must be obeyed\nN\ndc′\n=− 2\ndμ\n4π\nN\ndA′\n=−\nμ\ndμ\n24π 2\nμ\n\n(58)\n\nThis running has nothing to do with the one generated by graviton exchange and it is thus\nunrelated to the presence or absence of asymptotic safety that some authors advocate for\ngravity. At scales μ ≫ M the relevant degrees of freedom are not gravitons, but the 2N\nfermions appearing in the microscopic Lagrangian. On the other hand, at the moment that\nfermions become the relevant degrees of freedom, geometry loses its meaning. There is then\nno 'shorter' distance than M −1 , or at the very least this regime cannot be probed. Note that\nto realize our physical assumption of having the fermions as fundamental degrees of freedom\nwe should have c > 0 as discussed in Section 2.\nThese equations do not reflect the complete running of the dimensionless couplings associated to LD and LR , i.e. the constants associated to the cosmological and Einstein-Hilbert\nterms, but only the one obtained at leading order in N . That is, the 'graviton' loops are not\nincluded here; they are suppressed by one power of N if N is large. To see this last statement\nwe recall that the usual power counting rules show that the exchange of the vierbein degrees\nof freedom would be accompanied by a factor of MP−2 , suppressed by 1/N . Leaving these\ncorrections aside, we note that the two free couplings of the theory have a running that is\nopposed in sign to the one found in 2D.\nTo understand the issue it is probably useful to appeal to the QCD analogy. At long\ndistances strong interactions are well described by the pion chiral Lagrangian, parametrized\nby fπ or the O(p4 ) coefficients, generically named low energy constants (LEC). The LEC\nare a complicated function of αs , the coupling constant of QCD. The microscopic theory\nproposed in this paper is the analogous of QCD, while the resulting effective theory (57) is\nthe counterpart of the chiral effective Lagrangian. Then MP and Λ are the LEC of the present\ntheory. The running of αs does not have an immediate translation on the LEC while in the\npresent model, because of its simplicity, the consequences of the running in the microscopic\nparticle reflects directly in Λ and MP . But in addition these constants have an additional\nrunning (analogous to doing pion loops in the chiral Lagrangian). The counting of powers of\nN disentangles both types of running.\nAt some scale, q ∼ M the effective theory stops making sense. At that moment the\nrelevant degrees of freedom change and, as a result, the metric disappears. Exactly in the\nsame way as for large momentum transfers we do not see pions but quarks. Of course, if\n\n17\n\n\fthere is no metric there is no geometry and, in particular, the notion of distance disappears\naltogether at length scales below M −1 . From this point of view, gravity is non-Wilsonian.\nLet us now try to make contact with the value that the LEC take in gravity. Clearly, there\nis enough freedom in the theory (by adjusting A′ and M ) to reproduce any values of Λ and\nMP . But we also want higher order terms to be small for the effective theory to make sense\nin a reasonable range of momenta. We may even get rid of all of the high order (O(p4 ) and\nbeyond) if we take M → ∞ and at the same time we take N → 0 in a prescribed form. Then,\nin the actual limit, which corresponds to a 'quenched' approximation, we exactly reproduce\nEinstein-Hilbert Lagrangian, with a cosmological constant, and nothing else. Of course in\nthis limit, the presumed fundamental degrees of freedom disappear completely and we have\nall the way up to μ = ∞ Einstein's theory -with all its ultraviolet problems; there are\nno fundamental degrees of freedom providing form factors to cut off the offending divergent\nintegrals.\nOf course the N → 0 limit is just the opposite one to the one we have used. All our\ndiagrammatic results are exact in the N → ∞ limit and presumably get large corrections as\nN approaches zero, but the general features of the model should survive.\nNote that M is a fixed quantity in the model and if MP2 increases, Λ decreases. Taking the\nactual observed or estimated values of these two parameters we get the value N M 4 ∼ 1018\nm−4 , which is a very low scale. One may think that this may already represent unacceptably\nlarge corrections from higher order operators. However, this is not necessarily so because the\nbounds on R2 terms are very weak. For instance, the bound k < 1074 has been quoted for a\ngeneric coefficient[17] k of the O(p4 ) terms. Thus, a relatively low scale for M cannot be really\nexcluded observationally by studying gravitational effects alone and one should be aware of\nthis. However, our own perception tells us that M should be much larger than the value\nquoted above as the notion of metric certainly makes sense at much shorter distances. We\ncan increase the value of M as much as we want by decreasing the value of N , as previously\nindicated. We shall not elaborate further on this as it seems too premature an speculation.\nFinally we note that the sign of Newton's constant is not determined a priori in this\ntheory due to the subtraction required from the counterterm in LR . This ties nicely with\nsome of the early discussions on induced gravity[18].\n\n7\n\nSummary\n\nLet us summarize our findings and comment on possible implications of our work. We have\nproposed a model where 4D gravity emerges from a theory without any predefined metric.\nThe minimal input is provided by assuming a differential manifold structure endowed with an\naffine connection. Nothing more. The Lagrangian can be defined without having to appeal\nto a particular metric or vierbein.\nGravity and distance are induced rather than fundamental concepts in this proposal. At\nsufficiently short scales, when the effective action does not make sense anymore, the physical\ndegrees of freedom are fermionic. At such short scales there is not even the notion of a smaller\nscale.\nThe relative technical simplicity of this proposal constitutes its main virtue when compared with previous proposals [7, 8], where even semiquantitative discussions appear impossible. Here one is able to derive in full detail the effective action.\nA very important aspect of the model is the improvement of the ultraviolet behavior.\nAfter integration of the fundamental degrees of freedom all the divergences can be absorbed\nin the redefinition of the cosmological constant and the Planck mass (as seen from the effective\n18\n\n\ftheory point of view, even though the respective counterterms do not have this meaning in\nthe underlying theory. With the running, dictated by the corresponding beta functions, both\nquantities are renormalization group invariant. In addition the Gauss-Bonnet invariant is\nrenormalized too. This happens in spite of the bad ultraviolet behavior of the propagator\nand the ultimate reason, we think, is that these are the only counterterms that can be\nwritten without having to assume an underlying metric that does not exist before spontaneous\nsymmetry breaking takes place.\nAt long distances the fluctuations around the broken vacuum are the relevant degrees\nof freedom and are described by an effective theory whose lowest dimensional operators are\njust those of ordinary 4D gravity. They of course exhibit the usual divergences of quantum\ngravity but this now poses in principle no problem as we know that at very high energies this\nis not the right theory. For q ∼ M one starts seeing the fundamental degrees of freedom.\nGravitons are the Goldstone bosons of a broken global symmetry. We have seen how the\nbarrier of the Weinberg-Witten no-go theorem could be overcome.\nIn a sense the fundamental fermions resolve the point-like 3-graviton, 4-graviton, etc.\ninteractions into extended form factors and this is the reason for the mitigation of the terrible\nultraviolet behavior of quantum gravity. However this is only part of the story, because this\ncould be equally achieved by using Dirac fermions coupled to gravity (or any other field\nfor that matter). This would in fact be just a reproduction of the old program of induced\ngravity[18] and therefore not that interesting. The really novel point in this proposal is that\nthe microscopic fermion action does not contain any metric tensor at all. Then not only\nis the metric and its fluctuations –the gravitons– spontaneously generated, but the possible\ncounterterms are severely limited in number.\nWe stop short of making any strong claims about the renormalizability of the model. We\ncan just say that, from our calculations and our experience with the model, renormalizability\nis a plausible hypothesis (our results actually amount to an heuristic proof in the large N\nlimit). Likewise we do not insist in that the one presented is the sole possibility to carry\nout the present program, although it looks fairly unique. Clearly a number of issues need\nfurther study before the present proposal can be taken seriously but we think that the results\npresented here are of sufficient interest to make them known to researchers in the field.\nA number of extensions and applications come to our mind. Perhaps the most intriguing\none from a physical point of view would be to investigate in this framework singular solutions\nin GR such as black holes. A more in-depth study of the renormalizability issue is certainly\nrequired too as there are issues related to the renormalization group to be addressed in the\npresent setting.\n\nAcknowledgements\nWe acknowledge the financial support of projects FPA2010-20807 and SGR2009SGR502.\nThis research is supported by the Consolider CPAN project. The work of J.A. is partially\nsupported by VRAID/DID/46/2010 and Fondecyt 1110378. D.E. and D.P. would like to\nthank the Faculty of Physics of PUC and the CERN PH-TH Unit, where part of this research\nwas done, for hospitality.\n\nReferences\n[1] C.J. Isham, A. Salam and J.A. Strathdee, Annals Phys.62:98-119,1971.\n\n19\n\n\f[2] A.B. Borisov and V.I. Ogievetsky, Theor.Math.Phys.21:1179,1975; E.A. Ivanov and V.I.\nOgievetsky, Lett.Math.Phys.1:309-313,1976.\n[3] H.C. Ohanian Phys. Rev. D 184, 1305 (1969).\n[4] P. Kraus and E.T. Tomboulis, Phys. Rev. D 66, 045015 (2002); V. A. Kostelecky and\nR. Potting, Phys.Rev.D79:065018,2009; G. E. Volovik, Physica B 162 (1990) 222-230.\n[5] J. Alfaro, D. Espriu, D. Puigdomènech, Phys. Rev. D82 (2010) 045018.\n[6] In adddtion to those listed in [4]: S.C. Zhang and J. Hu, Science 294, 823 (2001); C.\nBarcelo and M. Visser, Int.J.Mod.Phys. D10 (2001) 799-806; H. Grosse, H. Steinacker\nand M. Wohlgenannt, JHEP 0804 (2008) 023 B. McElrath, arXiv:0812.2696; F.\nGirelli, S. Liberati and L. Sindoni, Phys.Rev.D79:044019 (2009);T. Padmanabhan,\nInt.J.Mod.Phys. D17 (2008) 591-596; P. Horava, JHEP 0903, 020 (2009);M. Anber, U.\nAydemir and J.F. Donoghue, Phys.Rev. D81 (2010) 084059; C. Xu and P. Horava, Phys.\nRev. D81, 104033 (2010); W. Mielke, Phys. Rev. D 83, 044004 (2011); L. Sindoni,\narXiv:1110.0686.\n[7] D. Amati and J. Russo, Phys.Lett. B 248, 44 (1990); J. Russo, Phys.Lett. B 254, 61\n(1991).\n[8] A. Hebecker, C. Wetterich, Phys.Lett.B574:269-275,2003; C. Wetterich, Phys. Rev. D\n70: 105004, 2004.\n[9] S. Weinberg and E. Witten, Phys.Lett.B96:59,1980.\n[10] A. Jenkins, Int. J. Mod. Phys. D18 (2009) 2249-2255.\n[11] S. Weinberg, in General Relativity: An Einstein centenary survey, edited by S.\nW.Hawking and W.Israel (Cambridge University Press, 1979), chapter 16, p. 790.\n[12] See e.g.: I. Heemskerk and J. Polchinski, JHEP 1106:031 (2011); G. Dvali and C. Gomez,\narXiv:1005.3497.\n[13] A. Palatini, Rend. Circ. Mat. Palermo 43, (1919) 203.\n[14] See e.g.: M. Asorey, E. V. Gorbar and I.L. Shapiro, Class. Quantum Grav. 21, 163\n(2004).\n[15] P. Kraus and E. Tomboulis, Phys. Rev. D 66, 045015 (2002).\n[16] S.M. Christensen and M.J. Duff, Nucl. Phys B170, 480-506 (1980); Phys. Lett 76B, 571\n(1978).\n[17] K.S. Stelle, Gen. Rel. Grav. 9, 353 (1978).\n[18] Ya.B. Zeldovich, JETP Lett., 6, 316 (1967); A. Sakharov, SOv. Phys. Dokl., 12, 1040\n(1968); O. Klein, Phys. Scr. 9, 69 (1974); S. Adler, Rev. Mod. Phys., 54, 729 (1982).\n\n20\n\n\fA\n\nAppendix\n\nIn this appendix we include the explicit calculation of the different terms appearing in (36)\nshowing how they correspond on shell to different terms in the action. We also include, for\ncompleteness, how the result of (32) in the diagonal parametrization of the metric used in\nthe text yields precisely (24).\n\nA.1\n\nD μν\n\nbcef ,\n\nE μν\n\nbcef\n\nand F μν bcef\n\nWe saw in subsection (4.2) that diagram (36) contains three different terms, two of them\nbeing divergent, let us show how they either cancel or can be accommodated in the available\ncounterterms. Let us write them down together with the wμab fields.\nD μν bcef wμbc wνef =4wμνb wνμb − 2wμbe wμbe = 2(w112 )2 − 2(w121 )2 + 2(w113 )2 − 2(w131 )2\n+ 2(w114 )2 − 2(w141 )2 + ... + 2(w434 )2 − 2(w443 )2 = 0.\n\n(A.1)\n\nSo this divergence cancels regardless of the parametrization we choose.\nLet us write the second one now considering a conformally flat parametrization of the\nmetric\ngμν = e−σ(x) δμν .\n(A.2)\nThen we have\n\nE μν bcef wμbc wνef = 4wμμb wνbν\n\n(A.3)\n\nMaking use of equation (18), that is\nwμab =\n\n1 a b\n(∂ σδμ − ∂ b σδμa ),\n2\n\n(A.4)\n\nwe obtain\nE μν bcef wμbc wνef = −9[(∂1 σ)2 + (∂2 σ)2 + (∂3 σ)2 + (∂4 σ)2 ] = −9∂μ σ∂μ σ.\n\n(A.5)\n\nRecall this term appeared both in (36) and in (41). Summing their contributions in the way\nwe did to reconstruct the effective action for the σ field diagrams we obtain\n9M 2\n9M 2\n9M 2 −σ\n−σ\n∂\nσ∂\nσ(1\n−\nσ\n+\n...)\n→\n∂\nσ∂\nσe\n→\ne \u0003σ.\nμ\nμ\nμ\nμ\n32π 2\n32π 2\n32π 2\n√\nThis is just a finite contribution to gR and it is reflected in (52)\nThe Gauss-Bonnet term corresponding to such a metric perturbation reads\nLGB =\n\n(A.6)\n\n√\ng(R2 + 4Rμν Rμν − Rμνρσ Rμνρσ )\n\n= −4∂3 ∂4 σ∂3 ∂4 σ + 4∂42 σ∂32 σ − 4∂2 ∂4 σ∂2 ∂4 σ + 4∂42 σ∂22 σ − 4∂2 ∂3 σ∂2 ∂3 σ + 4∂32 σ∂22 σ\n\n− 4∂1 ∂4 σ∂1 ∂4 σ + 4∂42 σ∂12 σ − 4∂1 ∂2 σ∂1 ∂2 σ + 4∂22 σ∂12 σ − 4∂1 ∂3 σ∂1 ∂3 σ + 4∂32 σ∂12 σ\n\n− 3∂4 σ∂4 σ∂42 σ − ∂42 σ∂3 σ∂3 σ − 4∂4 σ∂3 σ∂3 ∂4 σ − ∂4 σ∂4 σ∂32 σ − 3∂3 σ∂3 σ∂32 σ − ∂42 σ∂2 σ∂2 σ\n\n− ∂32 σ∂2 σ∂2 σ − 4∂4 σ∂2 σ∂2 ∂4 σ − 4∂3 σ∂2 σ∂2 ∂3 σ − ∂4 σ∂4 σ∂22 σ − ∂3 σ∂3 σ∂22 σ − 3∂2 σ∂2 σ∂22 σ\n\n− ∂42 σ∂1 σ∂1 σ − ∂32 σ∂1 σ∂1 σ − ∂22 σ∂1 σ∂1 σ − 4∂4 σ∂1 σ∂1 ∂4 σ − 4∂3 σ∂1 σ∂1 ∂3 σ − 4∂2 σ∂1 σ∂1 ∂2 σ\n− ∂4 σ∂4 σ∂12 σ − ∂3 σ∂3 σ∂12 σ − ∂2 σ∂2 σ∂12 σ − 3∂1 σ∂1 σ∂12 σ.\n\n21\n\n(A.7)\n\n\fThe last term we have to explore is the piece\ntogether with the wμbc fields\n\n1 μν\nǫ F bcef .\n\nLet us explicitly write this term\n\n\u0014 μν\nμ\nδμν δbf pe pc δμν δce pb pf\nδμν δcf pb pe δb δeν δcf p2\nδ δbe pc pf\n1 μν\n1\nbc ef\nF bcef wμ wν = −\n+\n+\n−\n−\nǫ\nǫ\n12π 2\n12π 2\n12π 2\n12π 2\n12π 2\nδbμ δfν δce p2 δbμ δfν pe pc δeμ δbf pν pc δeμ δbν pc pf\nδ μ δ ν pc pf\n−\n−\n+\n+ b e 2 +\n12π\n12π 2\n12π 2\n12π 2\n12π 2\nμ\nμ ν\nμ\nμ\nμ\nδc δfν δbe p2\nδe δc pb pf\nδe δcf pν pb δc δeν δbf p2 δc δeν pb pf\n−\n+\n+\n−\n−\n12π 2\n12π 2\n12π 2\n12π 2\n12π 2\nμ\nμ\nμ\nμ\nμ ν\nν\nν\nν\nδc δf pb pe δf δbe p pc δf δb pe pc δf δc pb pe δf δce pν pb\n+\n+\n−\n+\n−\n12π 2\n12π 2\n12π 2\n12π 2\n12π 2\nμ\nμ\nν\nν\nμ\nν\nμ\nν\nδbe δcf p p\nδbf δc p pe δbf δce p p\nδbν δce pμ pf\nδbe δc p pf\n−\n−\n+\n−\n+\n12π 2 \u0015\n12π 2\n12π 2\n12π 2\n12π 2\nν\nμ\nδ δcf p pe\n+ b\nwμbc wνef\n12π 2\n1 1h\n∂c wμbc ∂e wμbe + wμμc \u0003wννc − ∂c wμμc ∂e wννe − ∂c wμbc ∂e wbμe\n= 2\n3π ǫ\n\u0015\n1 μ bc ν bc\nbc ν μb\nμ bν\neb\n+∂c wμ ∂ wν + ∂ wμ ∂e wν + ∂ wμ ∂ wν\n2\n(A.8)\n6 1\u0002\n1 μν\nF bcef wμbc wνef = 2 −∂42 σ∂12 σ + ∂1 ∂4 σ∂1 ∂4 σ − ∂32 σ∂42 σ + ∂3 ∂4 σ∂3 ∂4 σ\nǫ\nπ ǫ\n−∂22 σ∂42 σ + ∂2 ∂4 σ∂2 ∂4 σ − ∂22 σ∂32 σ + ∂2 ∂3 σ∂2 ∂3 σ\n\u0003\n−∂32 σ∂12 σ + ∂1 ∂3 σ∂1 ∂3 σ − ∂22 σ∂12 σ + ∂1 ∂2 σ∂1 ∂2 σ .\n\n(A.9)\n\nNow it is easy to see that (A.9) corresponds to the second and third lines in (A.7). This divergent contribution is part of the Gauss-Bonnet term, which, although being a total derivative,\nis a valid counterterm. The rest of (A.7) contains three sigma fields and is not present in\n(36) as it should be the case. These remaining terms would be generated in the triangular\ndiagram with three external wμab fields and would come with a divergent coefficient (we have\nnot computed such diagram). Note also that both (A.9) and the first two lines of (A.7) can\nbe integrated by parts to make them vanish. This happens because in the conformally flat\nmetric perturbations terms from the diagrams with two and three external w fields can not\nbe related to each other integrating by parts. Therefore, they must vanish independently as\nthe Gauss-Bonnet term is a total derivative after all.\nThis is a particularity of the conformally flat parametrization of the metric perturbation\nand would not hold for a generally diagonal parametrization. In that case terms generated\nin the two point function can be transformed into the terms appearing in the three point\nfunction by integration by parts and one would require a full calculation to show there is a\nmatch with an independent calculation of the Gauss-Bonnet term.\n\n22\n\n\fA.2\n\n√\n\ngR for the general diagonal parametrization of the metric\n\nLet us consider a generally diagonal metric with four degrees of freedom\n\n −σ1 (x)\ne\n0\n0\n0\n 0\ne−σ2 (x)\n0\n0 \n.\ngμν = \n−σ\n(x)\n 0\n3\n0\ne\n0 \n0\n0\n0\ne−σ4 (x)\n\n(A.10)\n\nWe saw that the corresponding expression for the curvature is Eq. (24)\n\u0002\n√\nLR |(on shell) =M 2 gR = M 2 ∂32 σ4 + ∂22 σ4 + ∂12 σ4 + ∂42 σ3 + ∂22 σ3 + ∂12 σ3\n\n+∂42 σ2 + ∂32 σ2 + ∂12 σ2 + ∂42 σ1 + ∂32 σ1 + ∂22 σ1\n1\n− (∂3 σ1 ∂3 σ2 + ∂4 σ1 ∂4 σ2 + ∂2 σ1 ∂2 σ3 + ∂4 σ1 ∂4 σ3 + ∂2 σ1 ∂2 σ4 + ∂3 σ1 ∂3 σ4\n2\n+∂1 σ2 ∂1 σ3 + ∂4 σ2 ∂4 σ3 + ∂1 σ2 ∂1 σ4 + ∂3 σ2 ∂3 σ4 + ∂1 σ3 ∂1 σ4 + ∂2 σ3 ∂2 σ4 )\n\u0003\n+O(σ 3 ) .\n(A.11)\nWe consider now the divergent part proportional to M 2 of the result of (32)\n\"\n#\n4\n4\n2X X\nσj σl p2 M 2 σj σl (p2j + p2l )M 2\n−\n+\nǫ\n48π 2\n48π 2\nj=1\nl=1\nl 6= j\n\n2 M2 \u0002 2\n−p (σ1 σ2 + σ1 σ3 + σ1 σ4 + σ2 σ3 + σ2 σ4 + σ3 σ4 )\nǫ 48π 2\n+σ1 σ2 (p21 + p22 ) + σ1 σ3 (p21 + p23 ) + σ1 σ4 (p21 + p24 ) + σ2 σ3 (p22 + p23 )\n\u0003\n+σ2 σ4 (p22 + p24 ) + σ3 σ4 (p23 + p24 )\n2 M2 \u0002\n−σ1 σ2 (p23 + p24 ) − σ1 σ3 (p22 + p24 ) − σ1 σ4 (p22 + p23 ) − σ2 σ3 (p21 + p24 )\n=\nǫ 48π 2\n\u0003\n−σ2 σ4 (p21 + p23 ) − σ3 σ4 (p21 + p22 ) .\n=\n\n(A.12)\n\nThis last expression, when expressed in position space, corresponds exactly to (A.11) except\nfor a numerical factor and minus the second derivatives of the fields which are total derivatives\nand do not appear in the perturbative calculation.\n\n23\n\n\f"}