{"id": "http://arxiv.org/abs/1008.4043v1", "guidislink": true, "updated": "2010-08-24T13:33:56Z", "updated_parsed": [2010, 8, 24, 13, 33, 56, 1, 236, 0], "published": "2010-08-24T13:33:56Z", "published_parsed": [2010, 8, 24, 13, 33, 56, 1, 236, 0], "title": "Metabifurcation analysis of a mean field model of the cortex", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1008.2625%2C1008.1039%2C1008.3397%2C1008.2311%2C1008.4074%2C1008.3094%2C1008.1840%2C1008.4583%2C1008.3630%2C1008.2388%2C1008.5252%2C1008.1286%2C1008.1770%2C1008.4788%2C1008.3343%2C1008.2252%2C1008.4562%2C1008.4481%2C1008.4835%2C1008.3936%2C1008.4043%2C1008.3761%2C1008.2191%2C1008.0658%2C1008.2298%2C1008.3301%2C1008.1949%2C1008.4717%2C1008.4264%2C1008.0659%2C1008.3247%2C1008.5216%2C1008.0856%2C1008.4227%2C1008.0032%2C1008.0631%2C1008.5325%2C1008.0326%2C1008.1773%2C1008.2026%2C1008.1771%2C1008.0677%2C1008.4398%2C1008.1071%2C1008.1819%2C1008.3570%2C1008.2335%2C1008.0714%2C1008.2519%2C1008.4363%2C1008.1912%2C1008.2123%2C1008.4131%2C1008.4784%2C1008.2578%2C1008.0380%2C1008.2169%2C1008.1726%2C1008.4048%2C1008.2186%2C1008.2526%2C1008.1549%2C1008.5230%2C1008.5007%2C1008.1087%2C1008.4378%2C1008.4088%2C1008.5083%2C1008.3557%2C1008.2982%2C1008.0329%2C1008.4698%2C1008.5021%2C1008.0324%2C1008.3752%2C1008.5128%2C1008.3173%2C1008.3726%2C1008.4272%2C1008.3116%2C1008.0467%2C1008.3564%2C1008.0436%2C1008.4580%2C1008.2531%2C1008.1764%2C1008.1281%2C1008.1076%2C1008.1837%2C1008.4922%2C1008.0091%2C1008.3810%2C1008.5157%2C1008.3242%2C1008.3892%2C1008.0754%2C1008.3128%2C1008.0044%2C1008.1022%2C1008.0439%2C1008.5265&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Metabifurcation analysis of a mean field model of the cortex"}, "summary": "Mean field models (MFMs) of cortical tissue incorporate salient features of\nneural masses to model activity at the population level. One of the common\naspects of MFM descriptions is the presence of a high dimensional parameter\nspace capturing neurobiological attributes relevant to brain dynamics. We study\nthe physiological parameter space of a MFM of electrocortical activity and\ndiscover robust correlations between physiological attributes of the model\ncortex and its dynamical features. These correlations are revealed by the study\nof bifurcation plots, which show that the model responses to changes in\ninhibition belong to two families. After investigating and characterizing\nthese, we discuss their essential differences in terms of four important\naspects: power responses with respect to the modeled action of anesthetics,\nreaction to exogenous stimuli, distribution of model parameters and oscillatory\nrepertoires when inhibition is enhanced. Furthermore, while the complexity of\nsustained periodic orbits differs significantly between families, we are able\nto show how metamorphoses between the families can be brought about by\nexogenous stimuli. We unveil links between measurable physiological attributes\nof the brain and dynamical patterns that are not accessible by linear methods.\nThey emerge when the parameter space is partitioned according to bifurcation\nresponses. This partitioning cannot be achieved by the investigation of only a\nsmall number of parameter sets, but is the result of an automated bifurcation\nanalysis of a representative sample of 73,454 physiologically admissible sets.\nOur approach generalizes straightforwardly and is well suited to probing the\ndynamics of other models with large and complex parameter spaces.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1008.2625%2C1008.1039%2C1008.3397%2C1008.2311%2C1008.4074%2C1008.3094%2C1008.1840%2C1008.4583%2C1008.3630%2C1008.2388%2C1008.5252%2C1008.1286%2C1008.1770%2C1008.4788%2C1008.3343%2C1008.2252%2C1008.4562%2C1008.4481%2C1008.4835%2C1008.3936%2C1008.4043%2C1008.3761%2C1008.2191%2C1008.0658%2C1008.2298%2C1008.3301%2C1008.1949%2C1008.4717%2C1008.4264%2C1008.0659%2C1008.3247%2C1008.5216%2C1008.0856%2C1008.4227%2C1008.0032%2C1008.0631%2C1008.5325%2C1008.0326%2C1008.1773%2C1008.2026%2C1008.1771%2C1008.0677%2C1008.4398%2C1008.1071%2C1008.1819%2C1008.3570%2C1008.2335%2C1008.0714%2C1008.2519%2C1008.4363%2C1008.1912%2C1008.2123%2C1008.4131%2C1008.4784%2C1008.2578%2C1008.0380%2C1008.2169%2C1008.1726%2C1008.4048%2C1008.2186%2C1008.2526%2C1008.1549%2C1008.5230%2C1008.5007%2C1008.1087%2C1008.4378%2C1008.4088%2C1008.5083%2C1008.3557%2C1008.2982%2C1008.0329%2C1008.4698%2C1008.5021%2C1008.0324%2C1008.3752%2C1008.5128%2C1008.3173%2C1008.3726%2C1008.4272%2C1008.3116%2C1008.0467%2C1008.3564%2C1008.0436%2C1008.4580%2C1008.2531%2C1008.1764%2C1008.1281%2C1008.1076%2C1008.1837%2C1008.4922%2C1008.0091%2C1008.3810%2C1008.5157%2C1008.3242%2C1008.3892%2C1008.0754%2C1008.3128%2C1008.0044%2C1008.1022%2C1008.0439%2C1008.5265&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Mean field models (MFMs) of cortical tissue incorporate salient features of\nneural masses to model activity at the population level. One of the common\naspects of MFM descriptions is the presence of a high dimensional parameter\nspace capturing neurobiological attributes relevant to brain dynamics. We study\nthe physiological parameter space of a MFM of electrocortical activity and\ndiscover robust correlations between physiological attributes of the model\ncortex and its dynamical features. These correlations are revealed by the study\nof bifurcation plots, which show that the model responses to changes in\ninhibition belong to two families. After investigating and characterizing\nthese, we discuss their essential differences in terms of four important\naspects: power responses with respect to the modeled action of anesthetics,\nreaction to exogenous stimuli, distribution of model parameters and oscillatory\nrepertoires when inhibition is enhanced. Furthermore, while the complexity of\nsustained periodic orbits differs significantly between families, we are able\nto show how metamorphoses between the families can be brought about by\nexogenous stimuli. We unveil links between measurable physiological attributes\nof the brain and dynamical patterns that are not accessible by linear methods.\nThey emerge when the parameter space is partitioned according to bifurcation\nresponses. This partitioning cannot be achieved by the investigation of only a\nsmall number of parameter sets, but is the result of an automated bifurcation\nanalysis of a representative sample of 73,454 physiologically admissible sets.\nOur approach generalizes straightforwardly and is well suited to probing the\ndynamics of other models with large and complex parameter spaces."}, "authors": ["Federico Frascoli", "Lennaert van Veen", "Ingo Bojak", "David T J Liley"], "author_detail": {"name": "David T J Liley"}, "author": "David T J Liley", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1016/j.physd.2011.02.002", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1008.4043v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1008.4043v1", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "math.DS", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "math.DS", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "physics.bio-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "q-bio.NC", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "37G99, 65P99", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1008.4043v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1008.4043v1", "arxiv_comment": null, "journal_reference": null, "doi": "10.1016/j.physd.2011.02.002", "fulltext": "arXiv:1008.4043v1 [math.DS] 24 Aug 2010\n\nMetabifurcation analysis of a mean field model of the\ncortex\nFederico Frascoli∗\nBrain Dynamics Research Unit\nBrain Sciences Institute\nSwinburne University of Technology\nHawthorn, Victoria\nAUSTRALIA\n\nLennaert van Veen\nFaculty of Science\nUniversity of Ontario Institute of Technology\nOshawa, Ontario\nCANADA\n\nIngo Bojak\nDonders Institute for Brain, Cognition and Behaviour\nCentre for Neuroscience\nRadboud University Nijmegen (Medical Centre)\nNijmegen\nTHE NETHERLANDS\n\nDavid T J Liley\nBrain Dynamics Research Unit\nBrain Sciences Institute\nSwinburne University of Technology\nHawthorn, Victoria\nAUSTRALIA\n\nAbstract\nMean field models (MFMs) of cortical tissue incorporate salient, average features of neural masses in order to model activity at the population level,\n∗\n\nCorresponding author\nEmail address: ffrascoli@swin.edu.au (Federico Frascoli )\n\nPreprint submitted to Elsevier\n\nAugust 15, 2018\n\n\fthereby linking microscopic physiology to macroscopic observations, e.g.,\nwith the electroencephalogram (EEG). One of the common aspects of MFM\ndescriptions is the presence of a high dimensional parameter space capturing\nneurobiological attributes deemed relevant to the brain dynamics of interest.\nWe study the physiological parameter space of a MFM of electrocortical\nactivity and discover robust correlations between physiological attributes of\nthe model cortex and its dynamical features. These correlations are revealed\nby the study of bifurcation plots, which show that the model responses to\nchanges in inhibition belong to two archetypal categories or \"families\". After\ninvestigating and characterizing them in depth, we discuss their essential\ndifferences in terms of four important aspects: power responses with respect\nto the modeled action of anesthetics, reaction to exogenous stimuli such as\nthalamic input, distribution of model parameters and oscillatory repertoires\nwhen inhibition is enhanced. Furthermore, while the complexity of sustained\nperiodic orbits differs significantly between families, we are able to show how\nmetamorphoses between the families can be brought about by exogenous\nstimuli.\nWe here unveil links between measurable physiological attributes of the\nbrain and dynamical patterns that are not accessible by linear methods.\nThey instead emerge when the nonlinear structure of parameter space is\npartitioned according to bifurcation responses. This partitioning cannot be\nachieved by the investigation of only a small number of parameter sets and\nis instead the result of an automated bifurcation analysis of a representative\nsample of 73,454 physiologically admissible parameter sets. Our approach\ngeneralizes straightforwardly and is well suited to probing the dynamics of\nother models with large and complex parameter spaces.\nKeywords: bifurcation analysis, brain dynamics, mean field model,\nelectroencephalogram (EEG), anesthesia, thalamus\n1. Introduction\nUnderstanding brain function is one of the longstanding and unresolved\nquests of science. Despite the efforts and contributions of a wide range of\nscientists from different disciplines, we are still very far from a comprehensive account of what the brain does, and how and why it does it. The\nformidable hardness of this problem is embodied in the complexity of the\nstructure and organization of this organ, which supports interactions over a\n2\n\n\fwide range of temporal and spatial scales. One of the scientific approaches\nthat aims to shed some light on the complexity of brain activity is the use\nof realistic mathematical models and computer simulations: constrained by\nknown physiology and anatomy, these theories try to recreate and understand\nthe patterns emerging in the electrical activity of the cortex. In particular,\nso-called mean field models (MFMs) [17, 33, 22] try to capture the results\nof neuronal interactions through spatial and/or temporal averaging, which\nthen describe the population activity of regions of cortex in a parsimonious\nmanner. Accompanied by a sufficiently flexible parametrization, MFMs take\ninto account existing uncertainties in cortical anatomy and physiology in an\neffective way.\nDespite the apparent biological simplicity of MFMs, such theories produce\nphysiologically and behaviorally plausible dynamics. Since their birth forty\nyears ago, they have been employed successfully to investigate a large number\nof cognitively and clinically relevant phenomena, such as the action pharmacological agents have on the activity of cortical tissue [42, 43, 25, 14, 26, 45],\nthe origin of evoked potentials [16, 30], the sleep-wake cycle and circadian\nrhythm [37, 29], the emergence of gamma band oscillations and its relationship to cognition [44, 31, 4] and the onset and characteristics of epileptic\nseizures [41, 32, 24, 18, 21]; c.f. Ref. [8] for a recent review. We use here\nLiley's MFM [22], which is capable of reproducing the main spectral features\nof spontaneous (i.e., not stimulus-locked) EEG, in particular the ubiquitous\nalpha rhythm [20]. Firstly, this model is biologically constituted: all state\nvariables and parameters can be constrained on the basis of existing anatomical and physiological measurements in the literature. Secondly, it supports a\nrich repertoire of behaviors both physiologically relevant and dynamically interesting. For example, parametrically widespread, robust chaotic activity of\nvarious origins has been found [7, 39, 13], and multistability, i.e., the presence\nof various coexisting dynamical regimes, has been demonstrated. Multistability has been speculated to correspond neurobiologically to the formation\nof memories [6].\nIn the spirit of the dynamical approach [15], in this paper we link nonlinear electrical activity and neurobiologically significant attributes of cortex.\nTo this end, we consider a representative sample of parameter sets that have\npreviously been found to generate physiologically plausible behavior [3]. This\nsample contains 73,454 sets and for each of these we computed the bifurcation\nplots when varying two parameters related to inhibition, i.e., the qualitative\nchanges of recurrent activity patterns, when neuronal inhibition is altered.\n3\n\n\fIt turns out that we can sort the sets into two distinct \"families\" of dynamical behavior. These families are found to correlate with EEG signal power\nand responses to anesthetics, whereas family membership is determined by\nspecific neurobiological parameters.\nThe paper is divided into three main sections. First, we briefly introduce Liley's ordinary differential Equations (ODEs). We next discuss the\ntheoretical and numerical tools employed in some detail, in particular how\none arrives at a systematic bifurcation analysis procedure to show the qualitative changes of the model solutions when inhibition is varied. Then, we\npresent the main distinctive features of the families, such as their responses\nto the simulated induction of anesthetics and their correlations with model\nparameters of interest. We are also able to show how exogenous agents,\ni.e., input from the thalamus to the cortex, can induce dramatic changes\nin those patterns and stimulate transitions from one type of family to the\nother. That, in particular, provides a compelling example for the modulation\nthalamus is thought to exert on the cortex [35]. All these relations cannot\nbe discovered with standard linear or nonlinear analyses of the physiological\nparameter space, and represent the main result of this work. A discussion of\nopen problems concludes the paper.\n2. Neuronal mean field equations\nLiley's MFM aims to provide a mathematically and physiologically parsimonious description of average neuronal activity in a human cortex, with spatially coarse-grained but temporally precise dynamics. One excitatory and\none inhibitory neuronal population, respectively, is considered per macrocolumn, which is a barrel-shaped region of approximately 0.5 − 3 mm diameter\ncomprising the whole thickness of cortex (thus ≈ 3 − 4 mm deep). Cortical activity is locally described by the mean soma membrane potentials of\nthe excitatory (he ) and inhibitory (hi ) neuronal populations, along with four\nmean synaptic inputs Iee , Iie , Iei , and Iii . These inputs convey the reciprocal\ninteraction between neuronal populations, where double subscripts indicate\nfirst source then target (each either excitatory e or inhibitory i). The connection with measurements is through he , which is linearly related to the\nEEG signal [28]. Lumped neuron populations are modeled as passive RC\ncompartments, into which all synaptically induced ionic currents terminate.\nAccording to population types (j, k) = e, i, synaptic activity drives the mean\nsoma membrane potentials from their resting values. The equations for he\n4\n\n\fand hi are given by\ndhe\nheq − he (t)\nheq\nie − he (t)\n= hre − he (t) + eeeq\nI\n(t)\n+\nIie (t) ,\nee\nr\nr\ndt\n|hee − he |\n|heq\nie − he |\ndhi\nheq − hi (t)\nheq\nii − hi (t)\nτi\n= hri − hi (t) + eieq\nI\n(t)\n+\nIii (t) ,\nei\nr\nr\ndt\n|hei − hi |\n|heq\nii − hi |\n\nτe\n\n(1)\n(2)\n\nwhere hre and hri are mean resting potentials, and τe and τi are the membrane time constants of the respective neuronal populations. The reversal\npotentials of the transmembrane ionic fluxes mediating excitation and inhieq\nbition are given by heq\nek and hik , respectively. Note that the synaptic inputs\nare weighted with +1 (excitatory Iek ) and −1 (inhibitory Iik ) at the resting\npotential of the respective excitatory or inhibitory neuronal population, and\nthat these weights then vary linearly with voltage.\nThe mean synaptic inputs describe the postsynaptic activation of ionotropic\nneurotransmitter receptors by presynaptic action potentials, arising from the\ncollective activity of neurons both nearby and distant. The time course of\nsuch activity, based on well-established experimental data [38], is modeled by\na critically damped oscillator driven by the mean rate of incoming excitatory\nor inhibitory axonal pulses. We thus have, for k = e, i:\n\u00132\n\u0012\nn\no\nd\nβ\n+ γek Iek (t) = Γek γek e Nek\nSe [he (t)] + pek (t) + φek (t) , (3)\ndt\n\u00132\n\u0012\nn\no\nd\nβ\n+ γik Iik (t) = Γik γik e Nik\nSi [hi (t)] + pik (t) ,\n(4)\ndt\nwhere the terms in curly brackets correspond to sources of the axonal pulses\nfrom three origins: local, i.e., in the same macrocolumn of the cortex Nlkβ Sl ,\narriving through long-range, excitatory cortico-cortical connections from other\nmacrocolumns φek , and extracortical, i.e., primarily of thalamic origin plk .\nFor subsequent simplicity we assume the absence of any extracortical inhibitory input, i.e. pik ≡ 0. Nlkβ quantifies the strength of anatomical population connectivity. The maximal postsynaptic potential (PSP) amplitude\nΓlk occurs in the target population k = e, i at time 1/γlk after the arrival of\nthe presynaptic spike from the source population l = e, i. A schematic illustration of the architecture of interactions in the Liley model can be found in\nFig. 1.\n\n5\n\n\fNβei\nNβii\n\nI\n\nI\nSi\n\nNαei\n\nNβie\n\nE\n\nE\nN\n\nα\nee\n\nNβee\n\nSe\nΦek\nplk\n\nFigure 1: Architecture of Liley's mean field model. Two separate model macrocolumns are shown, each containing one excitatory and one inhibitory neuronal population. Note that long-range connections are exclusively excitatory and that self-couplings\ncorrespond to connections of neurons of the same type within the local populations.\n\nLocal mean soma potentials hk are nonlinearly transformed to mean neuronal population firing rates with a sigmoidal function\n\u0015\u001b\n\u001a\n\u0014\n√ hk (t) − μk −1\nmax\n,\n(5)\nSk [hk (t)] = Sk\n1 + exp − 2\nσk\nwhere μk and σk indicate the firing thresholds and their associated standard\ndeviations for the respective neural population. The chosen form is a computationally convenient approximation to the error function, which results\nwhen one assumes a Gaussian distribution of firing thresholds.\nThe final part of the model concerns the propagation of excitatory axonal\nactivity in long-range fibers. In the full formulation, the following inhomogeneous, two-dimensional damped wave equation is used:\n#\n\"\u0012\n\u00132\n∂\n3 2 2\nα 2 2\nv Λ Se [he (~x, t)] .\n(6)\n+ vΛ − v ∇ φek (~x, t) = Nek\n∂t\n2\nTwo core assumptions form the basis of this equation: first, action potentials\ntraverse much larger distances in the cortico-cortical fibres than the local\n6\n\n\f(intra-columnar) axonal fibres, and thus their conduction delays can no longer\nbe considered negligible. Second, cortical areas further away share fewer\nlong range connections. Given the average number of long range excitatory\nα\nconnections onto a local neuron Nek\n, experiments suggest that the fraction\nthereof that stems from distant neurons decays approximately exponentially\nwith distance, with a scale constant Λ. Activity is then modeled as spreading\nomnidirectionally with constant conduction speed v. We have also made\nthe additional assumption that long-distance propagation dynamics is not\ndifferentiated according to excitatory and inhibitory targets, i.e., Λee = Λei =\nΛ and vee = vei = v.\nIn the following, we force the term ∇2 φek → 0 and thus consider only\nbulk dynamics for our model cortex. Furthermore, we neglect the spatially\ninhomogeneous effects of long-range fibre systems. Thus, Eq. (6) now becomes\n\u0012\n\u00132\nd\nα 2\n+ ω φek (t) = Nek\nω Se [he (t)] ,\n(7)\ndt\n\nwith ω = vΛ. We see that Eq. (7) has turned into an inhomogeneous critically\ndamped oscillator. This is in contrast to simulating an unconnected local\npopulation only, which would involve dropping Eq. (6) altogether. However,\nα\nit is clear that the steady state solution to Eq. (7), φek (t) = Nek\nSe [he (t)],\nβ\nβ\nα\nsimply changes Nek → Nek + Nek in Eq. (3). Thus, the steady state of bulk\noscillations corresponds to local activity with increased connectivity.\nThe fourteen ODEs of Eqs. (2)-(4) and (7) are studied in the present paper. We note for the interested reader that a thorough discussion of realistic\naxonal velocity distributions in MFMs has been recently published by Bojak\nand Liley [5] and that Liley et al. [22] contains more in-depth discussions\nof the physiological and mathematical arguments that lead to Eqs. (2)-(6).\nAlso, parameters used in the equations and their physiological ranges are\nshown in Tab. 1.\n3. Methods\nParameter sets and bifurcation parameters\nA large number of parameter sets is considered in this study, representing a significant sample of the physiologically admissible parameter space of\nLiley's MFM. To generate such realistic parameter sets, the properties of the\nmodel have been studied around fixed points of linearized version of Eqs. (2)(6). Biologically plausible selection criteria were then invoked concerning the\n7\n\n\fproperties of the simulated EEG and the firing rates of their associated neuronal populations. Limits on the admissible ranges of parameter values were\nalso applied, so that they are consistent with well-established neurophysiological features of mammalian cortex. Details on the methods and the\nconstraints applied in this search can be found in Bojak and Liley [3]. As\na result, a collection of 73,454 physiologically meaningful parameter sets is\navailable and considered in this study as representative of physiologically realistic parametric instantiations of model cortical activity in Liley's MFM.\nBifurcation theory is an essential tool for discussing the qualitative changes\nthat solutions of dynamical systems undergo under variations of their parameters. Loosely speaking, this type of analysis provides a picture similar to a\nphase diagram for physical systems, so that changes in the properties of the\nsolutions (i.e., bifurcations) may be considered as a generalization of phase\ntransitions [36]. This allows us to explore parametric boundaries between\nqualitatively different activities.\nOne of the a priori strongest motivations for the use of this approach is\nrepresented by the failure of standard methods of statistical linear analysis, which are unable to supply relevant information about the model's 29dimensional parameter space. An example of this is illustrated in Fig. 2. As\na result of a Principal Component Analysis (PCA) over the parameters of\nthe 73,454 sets, the percentage of total variance explained by the first ten\nPCs is plotted, individually and cumulatively. Essentially, if the parameter\nspace presented strongly linear correlations among the variables, it would\nbe possible to identify a limited number of components capturing the vast\nmajority of the variance, indicating that the significant degrees of freedom\nin the space were in fact much less than its dimension. This is clearly not\nthe case, since the first ten components cumulatively account for only about\n42% of the total variance, with low and very similar singular contributions.\nIt is not possible to find a linear combination of parameters that expresses\nthe \"bulk\" properties of the parameter space. If we want to extract valuable statistical information, a different, non standard method of analysis is\nneeded. On this basis, the aim of this paper is to highlight correlates between\ndynamical \"snapshots\" of the model, i.e. two parameters bifurcation plots,\nand spectral and parametric properties of Liley's MFM.\nIn choosing the parameters to vary for our bifurcation analysis, we are\nguided by the existence of literature pointing to inhibition being a sensitive\nlocus of control of brain dynamical responses. For instance, it is well-known\nthat pharmacological agents alter cortical activity primarily through act8\n\n\fing on inhibition [34]. Factors that modify inhibitory PSP amplitudes and\nanatomical coupling strengths of the inhibitory neural population are thus\nselected as continuation parameters. This is in line with previous work [4]\nand implies changes in Equation 4 for the inhibitory PSP amplitudes\nΓie → RΓie ,\n\nΓii → RΓii ,\n\n(8)\n\nand local inhibitory-inhibitory connectivity\nNiiβ → kNiiβ ,\n\n(9)\n\nwhere R and k are chosen as our bifurcation parameters.\nThis choice is not exclusive and other parameters or factors could have\nreasonably been varied, possibly highlighting other poignant features that\nhave not emerged through continuations in R and k. Nonetheless, these two\nparameters allow biologically plausible control: R changes the amplitude of\nthe inhibitory PSPs for both the excitatory and inhibitory populations, which\nfor example general anesthetics and sedative agents can affect to a large degree. At the same time inhibitory-inhibitory connection strengths are altered\nvia k, which changes the impact on the inhibitory feedback loop largely responsible for generating specific oscillations [22]. Note that since pik ≡ 0 in\nEq. 4, the effect of inhibition on the excitatory population scales precisely\nwith R, but on the inhibitory population with R * k. Thus, for example,\nsetting k = 1/R would simulate an exclusive impact on the excitatory population. Essentially then, we can control overall inhibitory \"potency\" with R\nand \"specificity\" with k.\nOne and two parameters bifurcation analysis procedure\nThere are two types of bifurcation plots that will be discussed: one parameter (1par) plots in R and two parameters (2par) graphs in R and k. Let\nus first explain how the diagrams are obtained: we integrate Eqs. (2)-(4) and\n(7) for a chosen parameter set up to an equilibrium solution for R = 1 and\nk = 1, i.e., in the absence of changes to inhibition. Initial conditions are\ngiven at t = 0 by he (0) = hi (0) = −70 mV, while all the other state variables are set to zero. Once an equilibrium solution is found, it is continued\nin R and a 1par plot is obtained. In all the R-plots there are always two\ntypes of codimension one (cod1) bifurcations present: saddle-node and Hopf\npoints, respectively. The presence of Hopf bifurcations gives us some information about the character of sustained oscillations produced by the action\nof inhibition, which we will discuss below.\n9\n\n\fThe saddle-node and Hopf bifurcations are subsequently continued in\nparameters R and k. In our diagrams, lines describing the loci of saddlenodes are labeled sn, and similarly for the Hopf points hb.\nPhysiological limits for minimal and maximal parameters intervals are\nset at Rmin = kmin = 0.75, Rmax = 2.00 and kmax = 1.25. Higher or\nlower values of R, k are considered to alter inhibitory PSP amplitudes and\ninhibitory-inhibitory connectivity strengths either to unphysiological values\nor to unusually large or small figures, which, for example, do not capture the\ncommonly observed effects of pharmacological agents on the cortex. However,\nas discussed below, continuations are performed till particular features of\nthe bifurcation topology become apparent. Typically, this occurs far outside\nof the physiological range. Bifurcation analysis is performed here with the\nwidely used continuation software packages AUTO-07P and MATCONT [10,\n9].\n4. Results\nTwo parameters bifurcation patterns\nTo establish our findings, we proceeded with a two-step analysis. First,\n2par bifurcation plots for a reduced sample of sets were obtained and analyzed, visually and numerically. Analysis of plots in R, k for 405 randomly\nselected sets out of the 73,454 in the generated sample revealed the existence\nof two unique, and clearly distinct, categories of patterns which recurrently\nappear. Our primary aim in this subsection is to describe these archetypal\npatterns and discuss their shared and distinct features. In the next subsection, a third parameter (pei ) is varied and this shows that the two families are\n\"transformable\": it is possible to metamorphose one family into the other,\nby varying exogenous stimuli. Once the two families are characterized, generalization through the whole batch is straightforward and global features of\nthe physiological parameter space naturally emerge.\nThe general character and topology of the 2par plots for Liley's MFM\nis reproduced in Fig. 3. These represent two archetypal Rk-plots for solabelled Family 1 (F1) and Family 2 (F2) types of sets. The major difference\namong the two families is represented by how the sn lines are organized and\ndivide the parameter space in areas with different dynamical properties. In\ngeneral, because of the form of the MFM's equations, a region bound by sn\nlines has always three equilibria, whereas the region outside has only one.\nFor F1, see Fig. 3A, sn lines travel almost parallel for the whole range of\n10\n\n\fthe space, and do not form cusp points (c), dividing the space essentially in\nthree major regions: one inside sn lines and two outside. In contrast, F2, see\nFig. 3B, is characterized by the presence of two cusp points c1 and c2 , so that\nthe region containing three equilibria is the union of two separated \"wedgeshaped\" areas, with cusps as their vertices. The way hb and sn lines interact\nis, for the majority of cases, by so-called fold-Hopf (fh) points, which appear\nas tangencies between such lines. Other cases we saw but are not present in\nFig. 3 happen when hb lines connect two Bogdanov-Takens (bt) points. These\ninstead correspond in the diagram to points where a hb line terminates on a\nsn line. In general, these bt points occur on the left, lower wedge of the sn\nlines, close to fh1 for F1 and F2. We will give examples of these bifurcations\nin the next subsection.\nFor both families, there are also other cases that slightly differ from Figure\n3, although the structure of the sn lines never changes. Variations are minimal\nand local, i.e. one of the fh points can be missing or a small difference in the\nshape of the hb lines can be present, but the essential structure of the plot is\nnot altered. What instead shows high variation, independently of the family,\nis the extension of the plots, i.e., the values of R and k at which bifurcation\npoints appear. It is important to realize that the physiological region is\ntypically a tiny area of the plots, as indicated by the rectangles in Fig. 3.\nThere are plots, as those shown in Fig. 3, where the whole pattern is contained\nwithin 3 − 4 orders of magnitude of the bifurcation parameters, but there\nare also a large number of patterns for which hb and sn lines extend up to\nimmense values, like R ≈ 109 . This is an interesting, important point: scales\nvary widely, but the nature and structure of the patterns are invariant, and\nthis is appreciated only if plots are considered in their complete extension in\nRk-space. Moreover, it appears that similar bifurcations maintain the same\ntype of normal forms among equivalent patterns, no matter what scale is\ninvolved. This implies that the dynamics in the proximity of bifurcations\nis topologically equivalent, i.e. qualitatively very similar, among plots in\nthe same family. Thus, parameter sets in the same family share not only\nthe topology of the saddle-node bifurcation lines, but also yield qualitatively\nsimilar dynamics close to the codimension two points.\nThalamic input and pattern family metamorphosis\nThe magnitude of extracortical (thalamic) input to inhibitory neurons\npei is chosen as a third continuation parameter for investigating the transition between families. Our choice of pei has an intuitive meaning: unlike Γie\n11\n\n\fand Γii , whose variation represent endogenously driven effects on the cortex,\nchanges in the thalamic input capture the action of exogenous causes. Furthermore, pei excites the inhibitory population and hence can be expected to\naffect significantly the dynamical repertoire of families based on variations\nof inhibitory PSPs.\nLet us discuss a prototypical transition from F1 to F2. To follow our\ndescription the reader will need to refer to Fig. 4 . We start at a very large\nand unphysiological value of pei = 26, 000/s, indicated in Fig. 4A, where a\nrepresentative of F1 is present. Compared to the (standard) diagram depicted\nin Fig. 3, two fh points on the left wedge of line sn1 are not yet formed.\nWhen the input is decreased to pei = 14, 000/s in Fig. 4B, thus approaching\nthe physiologically plausible range of 0/s ≤ pei ≤ 10, 000/s, the hb branch\nextends towards lower values of R, creating the fh1 point, as found in the\nstandard F1 type in Fig. 3. Analogously, the fh3 point is created at larger\nvalues of R and k. At the same time, on the right wedge sn2 , two cusps c1\nand c2 appear in Fig. 4B. This happens in a so-called swallow tail bifurcation\n(see, e.g., Ref. [1]). All equilibria belong to the same branch, meaning that\nthey are connected at the saddle-node bifurcations, at which the branch is\nfolded. At this swallow tail bifurcation, a pair of saddle-node bifurcations\nappears on the unique branch of equilibria. Notice in the inset that the fh2\npoint is now on the right wedge of the little triangle formed by the two cusps\nc1 and c2 . Moreover, the single branch hb has lost its previous elliptical\nshape, and has produced intersections. However, these are not bifurcation\npoints since only one unique branch of hb lines is present, and the diagram\nstill represents a type of plot belonging to F1. The emergence of the two\ncusps is not considered a major change, since the topological characteristic\nthat we choose in discriminating F1 from F2 is the global shape of the sn\nlines. When separate sn1 and sn2 do not intersect but keep almost parallel,\nas in Fig. 4A and B, a diagram of F1 type is still present.\nAs the extracortical input is further decreased to pei = 7, 000/s in Fig. 4C,\nthe triangle of line sn2 with the two cusps c1 and c2 expands and moves\nto the left of the diagram, intersecting the opposite sn1 branch (see also\nthe inset in Fig. 4C). Now c2 is overlapping the line of saddle-nodes sn1 ,\nand the cusp c1 has crossed sn1 and is above it. Notice, in particular, the\nvicinity of the blue and green lines of sn in the inset: this represents a stage\nvery close to the transition of F1 into F2. In fact, at smaller pei values,\nthe cusp c2 further lowers and separation between the two branches of sn\nfurther diminishes, so that increasing portions of sn1 and sn2 become nearly\n12\n\n\ftangent. This condition persists up to a value of pei where sn lines finally\nexchange, so that at pei = 6, 800/s the two cusps no longer belong to the same\nbranch, as Fig. 4D and its inset show. The cusp c1 is now part of sn1 and c2\nbelongs to sn2 : a second swallow tail bifurcation has taken place, signaling\nthe appearance of an F2 type of diagram. In other words, two regions of\nthe Rk-space having triangular shapes have formed and overlapped, and c2\nnow tends to move towards the right as pei is decreased, separating further\nfrom c1 . A further decrease of the thalamic input will eventually result in\nthe same plot as in Fig. 3B, i.e., the prototypical F2 with two disjoint V and\nΛ-shaped curves of saddle-nodes.\nA physiologically relevant observation can be made at this point. One\ncan investigate the effect of varying the excitatory thalamic input to either\ninhibitory (pei ) or excitatory (pee ) cortical neurons. It turns out that there\nis a relatively robust family-specific effect of thalamic excitation, which is\nopposed for inhibitory and excitatory cortical targets: F1 (F2) is the preferred family at high (low) values of pei , whereas F1 (F2) is the preferred\nfamily at low (high) values of pee . The incidence of family metamorphosis for\nvariations within the physiological interval of thalamic input 0/s − 10, 000/s\nis quite strong: about 56% of the 73,454 sets undergo a transition when pei\nis varied and approximately 42% when pee is. Once again, inhibition seems\nto be somewhat more effective in controlling the global dynamical properties\nof the cortex, in this case as driven by excitatory exogenous inputs.\nChanges within families due to thalamic input\nTo complete our analysis of 2par plots, let us make some remarks on the\nother instantiations of F1 and F2 that have not been illustrated yet, but\ndo occur in the 405 analyzed sets. These diagrams are only slight, local\nvariations of the ones shown so far, and still exhibit the global common\ncharacteristics typical of the respective families. As an example, patterns\nbelonging to F1 very similar to Fig. 4A are present, but they miss the fh3\npoint. This type of diagram is still considered as part of F1, because the\nstructure of its sn lines does not change. If we start looking at the transition\nbetween F1 and F2 from this particular plot, rather than from Fig. 4A, the\nfate of the pattern as pei is decreased is the same, i.e., it metamorphoses into\nan F2 diagram.\nThere is one final example of possible variations, regarding the appearance of Bogdanov-Takens (bt) points, which we anticipated in the previous\nsubsection. Remarkably, these changes can be accessed as well by varying\n13\n\n\fthe same parameter pei : exogenous agents do not only produce transitions\nbetween families, but can also trigger modifications within the same family.\nWe study here the annihilation of a couple of bt points, by increasing pei for\nthe same parameter set employed in Fig. 4. Once again the reader is asked\nto look closely at Fig. 5 and its insets to follow our description. If we start at\na low, physiological pei = 3, 720/s, two Bogdanov-Takens points, bt1 and bt2 ,\nare present just below fh1 and we want to demonstrate how they disappear\nfor larger pei . These bts occur on the left wedge of the sn line culminating\nin the cusp point c1 . Notice also that the branch hb1 is responsible for the\npoint fh2 close to c1 , in analogy with the F2 in Fig. 3. The similarity between\nthe two plots is evident. As the thalamic input is increased to pei = 3, 724/s\nin Fig. 5B, a couple of generalized Hopf (gh) points appear on hb1 . These\npoints signal a change in the hb line from subcritical to supercritical, i.e. the\nHopf bifurcation associated to the branch switches from a hard to a soft type\n[19].\nIf pei is made even larger, the two hb lines come closer and closer, up to a\nvalue of the input where they glue together and separate, as shown in Fig. 5C\nfor pei = 3, 729/s. After this, hb1 acquires a large portion of what previously\nwas hb2 , with the latter now extending over a much smaller distance. The\nsplit occurs in between gh1 and gh2 , each of which now belongs to a separate\nHopf branch: the tiny hb2 reaches from bt1 to bt2 and the long hb1 bends\nin proximity of gh2 and continues to larger R and k values. Notice in the\ninset of Fig. 5C that also hb2 (in green) bends close to gh1 and heads back to\nbt1 , where it stops. Then, when pei is further incremented, see Fig. 5D with\npei = 3, 735/s, gh2 annihilates and the smaller branch hb2 further shrinks,\nwith the bt points getting closer and closer as pei grows. In the end, these two\nbt points coalesce, and we are left with only a single branch, as in Fig. 3B.\nWe note that this line of hb delimited by bt1 and bt2 only exists at positive\nvalues of R and k. For the interested reader, we point out that the plot\nin Fig. 5A is responsible for chaos in an unphysiological range of R and k,\nand its route through a so-called homoclinic doubling cascade is analyzed in\ndetail in [13].\nLet us conclude with some observations. First, the tiny hb2 branch exists\nfor a very limited interval of pei and this is reflected in its very low occurrence\nin the 405 sets: it was found only twice. Second, an identical mechanism\nfor F1 is also present, where the creation or annihilation of bt points takes\nplace on the left sn1 lines in Fig. 3A. Finally, the diagrams that have been\npresented for the annihilation of bt points in F2, the similar plots for F1 (not\n14\n\n\fshown), and the plots in Figs. 3 and 4 with their small, local variations, are\nthe only ones that have emerged in our analysis of the reduced batch of 405\nsets. Within the previously discussed assumptions, we conclude that these\ndiagrams constitute all the possible modeled cortical responses to inhibition\nthat are physiologically meaningful in Liley's MFM.\nPartition of parameter space: families reaction to anesthetics and distributions of parameters\nHaving shown the properties of F1 and F2 types of diagrams, and concluded that any of the 405 plots of the preliminary sets falls into one of the\ntwo, we process the whole 73,454 sets in search of global, statistically relevant, correlations between family membership and parameter distributions.\nThe approximation we introduce to cope with the large number of sets in\nan automated fashion is simple: F1 and F2 are those sets respectively without and with separate lines of sn, which are divided by the exchange of sn\nbranches illustrated in Figs. 4C-D. Hence, Figs. 3A and 4A-C are considered\nas F1, Figs. 3B and 4D as F2. The second swallow tail bifurcation mentioned previously is the boundary between the so-defined F1 and F2. The\nalgorithm we employed searches for the position and number of cusps on sn\nlines, and assigns the family type consequently. Equilibration, continuation\nand attribution of a single set to its family takes on average 9 seconds on an\neveryday desktop computer.\nThe first, global difference between families we wish to show lies in their\nresponse to modeled anesthetic action. According to the methods explained\nin Bojak and Liley [3], it is possible to simulate the increase or decrease\nin EEG power when anesthetics are induced, and extract the ratio between\nthe power of the anesthetized cortex and the cortex at rest. Herein power\nis predicted for the system at a stable equilibrium subject to fluctuations\ninduced by noise added to the thalamocortical input pee . In line with clinical practice, they adopted the minimum alveolar concentration (MAC) of\nanesthetic agent at 1 atm pressure as the reference measure for describing\nthe behavior of the anesthetized cortex. One MAC is the inspired anesthetic\nconcentration needed to prevent movement in 50% of people to a noxious\n(surgical) stimulus. For example, assuming that isoflurane, a common anesthetics, is employed during surgery, a patient would be maintained usually\nat 0.9 to 2.2 MAC isoflurane in an oxygen-70% nitrous oxide mixture, or at\n1.3 − 3 MAC without the nitrous oxide. According to previous studies, it is\n15\n\n\fassumed that 1 MAC is equal to a 1.17 vol% for isoflurane, which corresponds\nto c = 0.243 mM aqueous concentration [27, 12].\nThe distributions of family responses to anesthetics according to power\nratios are depicted in Fig. 6, with F2 types being in the majority in the\nwhole batch, since they turn out to be about one and half times as many\nas F1. The histograms look similar in shape but are shifted with respect\nto one another. They are characterized by similar averages, with a relative\ndifference of only about 5%, but are strikingly different at the respective\ntails. At low ratios, F1 sets have a tendency of appearing more frequently\nthan F2 sets, and vice versa for high ratios. For example, for power ratio\nvalues smaller than 0.7, the cumulative probability for F1 is almost three\ntimes that of F2, whereas for ratios bigger than 1.0 the situation is reversed,\nwith F2 having a cumulative probability more than three times that of F1.\nThis shows that global, dynamical patterns have an interesting degree of\ncorrelation with total EEG power when responding to modeled isoflurane,\nwhose mode of action is representative of most anesthetics.\nIntuitively, anesthetized cortices should show a decrease in total EEG\npower when anesthetics are induced, as behavior is impaired as the cortex\n\"slows down\", with power ratios at 1 MAC expected to be smaller than one.\nThis is not always true, and it is not uncommon to rather observe a transient\nsurge in EEG power that is clinically known as the biphasic response [2]. For\nthe generated 73,454 sets, a power increase larger than 1.4 at 1 MAC, has\nbeen taken as indicative of a biphasic response in [3], i.e., the simulated total\npower integrated over all frequencies was at least 1.4 times larger with than\nwithout the presence of 1 MAC isoflurane. Only 86 sets out of the whole\nbatch show a biphasic response, of which around 90% are of F2 type. This is\ninteresting, but the statistics are too poor to draw a general conclusion about\nthe relation of F2 to the appearance of a biphasic response. It is possible that\nthe predominance of F2 for high ratios is related to the cortical mechanism\neliciting a surge in power when anesthesia is present.\nBesides responses to anesthetics, our family partition also shows that\nsome frequency distributions of parameters exhibit significant differences for\nF1 and F2. In order to objectively assess these differences, we use the following procedure: first, we construct parameter frequency histograms with\nn = 20 bins within the limits provided for each parameter by Tab. 1, separately for the two families. Two particular cases arise in this procedure.\neq\nOn one hand for heq\nie and hii , which have flexible upper limits, we choose\nthe maximum possible one (−65 mV) as bin limit. On the other hand, γii\n16\n\n\foccupies almost exclusively the lower part of the allowed parameter range.\nFor the sake of better accuracy with the same number of bins, we set 120/s\nas the upper bin limit for γii . Parameter sets with larger values, i.e. 12\nout of 29,131 for F1 and 24 out of 44,323 for F2, are counted in the highest\nbin. Second, we now compute the square root of the information radius (also\nknown as the Jensen-Shannon divergence) between the histograms for each\nparameter j – gij for F1 and hji for F2 – with i = 1, . . . , n bins\nv\nu n \u0014\n\u0015\nuX 1 j\nj\nj\nj\nj\u0001\nt\ndIR =\ng log2 gi + hi log2 hi − ai log2 ai ,\n2 i\n(10)\ni=1\n\n\u0001\n1 j\ngi + hji ,\n2\nwhich is a proper metric for the similarity of discrete probability distributions [11]. Note that for empty bins, one defines 0 log2 0 ≡ 0. Identical\ndistributions have dIR = 0, whereas maximal dissimilarity is indicated by\ndIR = 1. An example for maximal dissimilarity would be histograms gij = δik\nand hji = δil with Kronecker deltas and k 6= l.\nThe eight largest dissimilarities between the frequency distributions of\nthe families are found for the parameters τe (0.42), σe (0.33), heq\nie (0.16),\nγei (0.15), γii (0.15), Γie (0.12), Γii (0.11) and Nieβ (0.11), where the number\nin brackets is the corresponding djIR value. These distributions are shown in\nFigs. 7 and 8. In the case of τe , see Fig. 7A, F1 reaches a maximum around\n0.03 s, with a slow decline for higher values, while F2 has a steadily increasing\ntrend, perhaps saturating above 0.1 s. This is also the case for F2 sets in\nσe , see Fig. 7B, whereas F1 gives rise to a broad unimodal distribution with\na maximum around 4.2 mV. For both τe and σe , the difference in frequency\nfor F1 and F2 at the edges of the intervals is striking. This strongly suggests\nthat τe and σe play a relevant role in selecting the global dynamics of the\nmodel, with a clear bias for one type of family over the other.\nAlthough differences in the distributions of other parameters are still\nsignificant, they do have a minor effect in predicting family membership,\nsince the information radius distance of τe and σe is by far the largest of\nall the distributions. For example, heq\nie in Fig. 7C and γei in Fig. 7D retain\nseparated maxima for the occurrence of F1 and F2, showing a tendency\nfor larger likelihood of F1 at low physiological values and a faster decrease\nin frequency as the parameters increase. Notice how γii in Fig. 8A shows\nbell-shaped distributions concentrated in the subinterval 10 − 100/s, in a\nwith ai =\n\n17\n\n\fsimilar configuration to that of total power ratios discussed above in Fig. 6.\nIn contrast, for PSP amplitudes Γie , Γii , and connection strengths Niiβ , see\nFig. 8B-D, we observe larger changes for F2, while F1 is closer to constant\nthroughout the allowed parameter range. In these three cases at the edges of\nthe physiological parameter interval one finds clear bias for one family over\nthe other, but overall the difference is not as strong as for τe and σe . The\ndistributions of the remaining parameters do not show marked differences\nbetween F1 and F2, with djIR values between 0.012 and 0.10.\nDifferent oscillatory responses of families to altered inhibition\nBelonging to F1 or F2 only weakly predicts the presence of a surge or\ndecrease in power when isoflurane action is simulated, since only the tails in\nFig. 6 have a predominant presence of one family over the other. Nevertheless, the variabilities of patterns belonging to F1 and F2 embody different\nresponses to changes in inhibition. Thus we focus now on the oscillatory\nactivity associated with F1 and F2, when changes in inhibition are modeled\nsolely via alteration of the parameter R, to see how alterations in inhibitory\nPSP modify the oscillatory \"landscape\" families can produce. To this end\nwe inspected recurrent 1par plots at fixed k, within a physiological range of\n0.75 ≤ k ≤ 1.25, and characterize the oscillatory activity.\nExamples of this are depicted in Figs. 9 and 10, obtained from selected\nsets in the initial batch of 405. We want to stress that the variations within\neach family are extensive: the plots proposed are only schematic indications\nand are not meant to exhaustively describe the behaviors of F1 or F2 types.\nNonetheless, some general conclusions can be drawn, based on the most\ncommonly appearing dynamical traits in the continuations in R. Firstly,\nF1 seems to be less prone to stable oscillatory activity in the physiological\nrange than F2. Changes of R, and thus of Γie and Γii , tend to trigger unstable\nperiodic orbits with a limited parameter span for F1, whereas F2 shows stable\ncycles in a larger parameter range. In particular, plots where the size of the\nparameter interval of stable orbits is either very limited (Fig. 9A) or zero\n(Fig. 9B) are frequently observed in F1 types, whereas plots with significant\noscillatory regimes (Fig. 9C and D) are infrequent.\nSecondly, the presence of two or more stable regimes is rarer in sets belonging to F1, as compared to F2, and furthermore they typically extend\nover more limited R ranges within the physiological interval. Hence the occurrence of separate periodic orbits at the same value of R is much rarer\nin F1 than in F2. In other words, multistability is distinctive of F2. For\n18\n\n\finstance, the plots in Fig. 9C and D have a very limited extension of stable\norbits for physiological values of R compared with Figure 10B, C and D.\nSince a relation between multistability and memory has been hypothesized,\nthis could suggest that F2 types possess dynamical structure that facilitates\nthe formation of memory. In general and on average, it appears that F1 is\nassociated with a more restricted dynamical repertoire than that of F2, and\nthat F2 responds to the changes in inhibition with more activity than F1.\nThe distribution of the Hopf bifurcations in different families gives some\ninsight into this. In F1, the curve of Hopf bifurcations can simply be closed,\nwith no interaction with the saddle-node bifurcation. This is responsible for\nthe dynamics in Fig. 9A and B. In this case, there exists a time-periodic\nsolution but it is stable only on a small domain. A slightly more complicated\nsituation arises if the Hopf bifurcation intersects with the saddle-node bifurcation at the fh points, as in Fig. 3A. This leads to a more folded branch\nof periodic solutions, as shown in Fig. 9C and D. Again, stable oscillatory\nbehavior is observed only in a small domain. In F2 instead the hb curve is\nstretched out and interacts with both branches of sn curves and generally\nwith both sides of the Λ-shaped branch, as in Fig. 3B. This last interaction\nis, in particular, closer to the physiological range than the fh points usually\nobserved for F1. Hence, the configuration in F2 does have a greater potential\nfor sustained oscillations and the coexistence of stable periodic solutions, as\nshown in Fig. 10B.\n5. Discussion\nWe have illustrated how bifurcation diagrams of Liley's MFM in two parameters, R and k, account for core effects of inhibition over the cortex and\ncan be classified into two topologically distinct families. These parameters\nmodify inhibitory PSPs and inhibitory self-coupling, respectively, and the\ntwo archetypal families are identifiable by invariant dynamical features of\nmodel cortex. Across a large number of parameter sets, we have listed and\nidentified all the possible diagrams. The relatively small number of bifurcations and combinations between branches we have found indicates that\nLiley's MFM, when it supports \"realistic alpha activity\" at nominal parameter values [3], results in a relatively limited dynamical repertoire for cortical\nactivity in response to parametric variations within physiologically admissible space. These dynamical structures have been classified into families\naccording to their shared global topology and equivalent local properties of\n19\n\n\fthe solutions around their bifurcations. Family membership weakly correlates with typical changes in total spectral power when the cortex is acted\nupon by anesthetic agents, but strongly with unusually large changes. At the\nsame time, the likelihood for family membership is sensitive to changes in\nspecific neurophysiological attributes, in particular to the standard deviation\nof the excitatory neural population firing threshold σe (i.e. the steepness of\nthe neuronal firing rate function Sk ) and the excitatory membrane decay time\nconstant τe . As far as we are aware, these connections between dynamical\nproperties of a MFM, physiological attributes of cortex and changes in EEG\npower spectra under anesthesia have never been found before.\nIt is important to appreciate the generality and relative simplicity of the\nmethods we have used here. We have chosen two meaningful parameters\nfor the bifurcation analysis, R and k, and have then classified bifurcation\ndiagrams into two families, F1 and F2, according to the absence or presence\nof separate sn lines. Family membership turned out to be separated by a\nswallow tail bifurcation. More sophisticated criteria for labeling resulting\n2par plots could be envisaged. For example, families might have been categorized by the number, location and types of bifurcation they presented, or\nby the values of the coefficients in their normal forms. However, in our case\nthe simple approach proved sufficient. The main methodological result we\nwish to underline is that by grouping the global dynamics for a representative sample of 73,454 parameter sets of an EEG model according to agreed\ncriteria, strong, distinctive and robust correlations with EEG power spectra\non one hand and some of the physiological parameters on the other hand\nhave been derived. This is novel per se, because it shows that systematic\npartitioning of complex parameter spaces according to global dynamical patterns can lead to significant results which are not otherwise accessible. This\nmethod seems to be one the few viable strategy for unveiling interesting relations in high dimensional nonlinear spaces and exploring typical responses\nin complex models.\nIn this paper, we have focused on the action of anesthetics and ratios of\ntotal power, but many other developments are possible. For example, we\ncould select those sets which give rise to epileptic activity or have a high\npower in the EEG gamma band, categorize their dynamical patterns and\nlook for parameter correlations. Our approach is hence promising for other\ntheoretical studies of the EEG, or neural activity in general.\nWe want to stress that the proposed method is not dependent on Liley's\nMFM: in general, any other set of coupled, nonlinear ODEs with a compli20\n\n\fcated but meaningful parameter space can be treated likewise. The difficulties in extracting relevant information from equations with many parameters\nand involved feedback and feedforward mechanisms should not be underestimated, and our dynamical approach can offer new guidance. Here a PCA\non the 73,453 analyzed parameter sets turns out to be completely useless.\nThis is also true if we employ a PCA after dividing the sets into F1 and F2:\nthe first ten principal components then account for about 55% of the total\nvariance, up from 42%. Again, no valuable information on parameter relations can be gleaned from these types of statistical methods. If we compare\nFig. 2 with the clear separation between distributions in power ratio in Fig. 6\nor in Fig. 7 for parameters τe and σe , we can appreciate the strength of our\nmethod to tease out hidden correlations.\nWhat is the biological meaning of family differences with respect to parameters such as τe and σe ? First, a small excitatory rate constant τe enhances the speed with which he (t) adapts to changes in PSP inputs, as is\nclear from Eq. 2. For τe = 0, the mean excitatory soma membrane potential\nsimply becomes a weighted sum of the PSPs. Thus, low τe enslave he (t)\nmore directly to synaptic input and results in a depression of self-sustained\noscillations, which is characteristic for F1. σe parametrizes the local excitatory firing rate response, see Eq. 3, and hence does not directly act upon\nhe (t) dynamics, as τe does. However, a smaller σe means that the excitatory firing rate changes more rapidly for variations of he (t), although over\na more limited range. In the limit of σe = 0, one obtains a step function\nwhich instantaneously switches the population from zero to maximal firing\nat the threshold value μe . As mentioned above, in a steady state situation\nα\nβ\nexcitatory self-feedback is essentially proportional to (Nee\n+ Nee\n) * Se [he (t)],\nand a low σe increases this self-feedback. Thus, as for τe , the reaction of he (t)\nto changing synaptic input will be more rapid for low σe , limiting the presence of self-sustained oscillations and hence favoring membership in F1. One\ncan then view the somewhat lesser differentiation of σe with regards to the\nfamilies due to its boosting excitatory reactivity more indirectly. Overall, enhancements in the reactivity of excitatory populations result in a diminished\ndynamical repertoire.\nThese considerations on the primary role of σe and τe in influencing family\nmembership are not weakened by the presence of complex feedbacks between\nneuronal populations in Liley's model, c.f. Fig. 1. Sets of F1 types appearing\nat low τe or σe show homogeneous distributions for all the other parameters,\nwith no formation of clusters or any other form of bias. This suggests that\n21\n\n\fthe model cortex generally can be pushed towards F1 by appropriately reducing the excitatory membrane decay constant or the excitatory standard\ndeviation of the firing threshold, and towards F2 by increasing them. Thus,\nwe can also identify excitatory reactivity as an endogenous counterpart to\nthe exogenous control. In fact, it has been shown in detail here also how\nexogenous activity, namely the excitatory thalamic input to inhibitory (excitatory) cortical populations described by pei (pee ), can cause changes across\nand within families. There exists a kind of mirror symmetry between pee and\npei : at the increase of pei , or decrease of pee , we have observed a transition\nfrom F2 to F1, see Fig. 4, corresponding to a transition from complex to\nsimple dynamics. This indicates that the exogenous driving of inhibition (or\na reduction in the driving of excitation) moves the cortex to dynamics which,\non average, appear simpler.\nThalamic input appears in Liley's MFM as an active source of control on\nthe complexity of brain dynamics, having the role of modulator in cortical\ninteractions. This is quite different to the classical view of thalamus as being\nthe gateway through which peripherally derived sensory information reaches\ncortex[40]. For example, retinal axons project to the lateral geniculate nucleus of the thalamus, which then projects to visual cortex. In this way the\nthalamus is seen as the conduit through which all information about lower\nlevels of the nervous system reaches the cortex for \"processing\". Viewed from\nthe perspective of our model, this would imply that thalamic input simply\ndrives the cortex. However, based on our metabifurcation analysis we predict\nthat such input also configures (i.e. \"modulates\") local and global dynamical\nresponses from the cortex.\nIt is now known that all areas of cortex, not just the primary sensory\ncortices (somatosensory, visual, auditory) receive thalamic input, and that\nmost areas of cortex, in some reciprocal manner, innervate thalamus[35]. As a\nconsequence, contemporary approaches to understanding the role of thalamus\nare now aimed towards better articulating the functional inter-relationships\nthat exist between cortex and thalamus. One popular approach has been\nthe modeling of integrated dynamics of thalamo-cortical activity. On this\nbasis, it has been speculated that the human alpha rhythm emerges as a\nconsequence of reverberant activity between cortex and thalamus. While we\nhave not here considered such thalamo-cortical feedback, doing so in the context of our results leads to a number of interesting speculations regarding the\nauto-regulation of cortical dynamics: cortical feedback through the thalamus\ncould initiate a sequence of transitions between bifurcation pattern families,\n22\n\n\fproviding a way of reconfiguring cortical dynamics \"on the fly\" and thus on a\ntime scale quite different to that associated with activity dependent synaptic\nplasticity. Unfortunately, not enough is known experimentally about thalamocortical feedback at present to turn such speculations into strong model\npredictions.\nOn the other hand, thalamus also appears to stimulate internal variations\nwithin families, since a lower value of pei (higher value of pee ) corresponds to\nmore complex bifurcations as depicted in Fig. 5. As said, this type of 2par\nplot with two bt points has been shown to produce chaotic activity, meaning\nthat \"cortical state\" F2 is capable of producing highly nonlinear events, and\nan exogenous enhancement of cortical inhibition tends to reduce this ability. This and the fact that F2 types have shown to occur with the largest\nlikelihood in parameter space (i.e., their total number is one and a half time\nmore than F1), stimulates some speculations. F2 may be considered as the\ncortical default state of Liley's MFM, associated with the richest dynamical\nresponses to inhibition and acting as a sort of cognitive readiness state. Both\nendogenous (cortical) enhancements of excitatory reactivity and exogenous,\nsubcortical increases (decreases) of inhibitory (excitatory) activity reduce the\ncortical state to much simpler behavior.\nFinally, we have implemented a partition of the parameter space according to the bifurcation plots. As mentioned, types of normal forms appear to\nbe constant within each family and continuation lines of the diagrams are\nsimilar, whilst the extensions of these patterns in the Rk-space vary wildly.\nThis suggest the hypothesis that a single, high dimensional master bifurcation diagram exists and governs all sets, and that changes in parameters only\nchange its orientation, position and scale in the (hyper)volume. By continuing in R and k, we intersect the master diagram with a plane. The position\nof this plane determines whether we see F1 or F2 diagrams, and the two can\nbe continuously deformed into each other.\nWe would like to conclude with some future directions. First, an inventory\nof all the possible types of oscillatory dynamics associated with F1 and F2\nis surely attractive. How do many of them support complex events such as\nchaos and how is this reflected in parameter space? Do chaos and complex\ndynamics occur for limited, selected intervals in the parameters? The great\nhurdle is represented by the computational demand: it is still unfeasible\nto process all sets one by one and see what types of orbits are present.\nSecond, a systematic study of the unfolding of the bifurcations in 2par plots\nthat characterize families should be attempted. This has the potential to\n23\n\n\fincrease our knowledge about the type of dynamics these parameter sets\ncan produce. Finally, there is an interesting theoretical question concerning\nthe optimization of the method we presented in this paper. What is the\nbest choice of continuation parameters for achieving the highest degree of\nseparation among bifurcation plots? We wonder if it would be possible to\nchoose parameters or combinations of parameters such that their degree of\nclustering with respect to families is maximal. Some canonical discriminant\nanalysis on the sets has been preliminarily performed, but results are not\nparticularly illuminating. Achieving optimal partitioning has the potential\nto uncover biologically relevant dependencies among parameters that are still\nunknown, and to shed more light on clinically or pharmacologically relevant\nquestions.\n6. Acknowledgements\nFF was supported by Australian Research Council Discovery Grant DP\n0879137 and the Swinburne University of Technology Researcher Development Scheme 2010. FF would like to acknowledge the hospitality of the\nDepartment of Mathematics at Concordia University, Canada, where the\nidea for this study was conceived. LvV was supported by NSERC Discovery\nGrant 355849-2008. IB would like to thank Prof. Rolf Kötter for the time\ngranted to complete this project.\nReferences\n[1] V. Arnold, The theory of singularities and its applications, Cambridge\nUniversity Press, 1993.\n[2] V. Billard, P. L. Gambus, N. G. Chamoun, D. R. Stanski, S. L. Shafer,\nA comparison of spectral edge, delta power, and bispectral index as\neeg measures of alfentanil, propofol, and midazolam drug effect, Clin.\nPharmacol. Ther. 61 (1997) 45–58.\n[3] I. Bojak, D. T. J. Liley, Modeling the effects of anesthesia on the electroencephalogram, Phys. Rev. E 71 (2005) 041902.\n[4] I. Bojak, D. T. J. Liley, Self-organized 40 hz synchronization in a physiological theory of EEG, Neurocomputing 70 (2007) 2085–2090.\n\n24\n\n\f[5] I. Bojak, D. T. J. Liley, Axonal velocity distributions in neural field\nequations, PLoS Comput. Biol. 6 (2010) e1000653.\n[6] M. P. Dafilis, F. Frascoli, P. J. Cadusch, D. T. J. Liley, Chaos and generalised multistability in a mesoscopic model of the electroencephalogram,\nPhysica D 13 (2009) 1056–1060.\n[7] M. P. Dafilis, D. T. J. Liley, P. J. Cadusch, Robust chaos in a model of\nthe electroencephalogram: Implications for brain dynamics, Chaos 11\n(2001) 474–478.\n[8] G. R. Deco, V. K. Jirsa, P. A. Robinson, M. Breakspear, K. J. Friston,\nThe dynamic brain: From spiking neurons to neural masses and cortical\nfields, PLoS Comput. Biol. 4 (2008) e1000092.\n[9] A. Dhooge, W. J. F. Govaerts, Y. A. Kuznetsov, Matcont: A MATLAB\npackage for numerical bifurcation analysis of ODEs, ACM T. Math.\nSoftware 29 (2003) 141–164.\n[10] E. J. Doedel, Auto: A program for the automatic bifurcation analysis\nof autonomous systems, Congressus Numerantium 30 (1981) 265–284.\n[11] D. M. Endres, J. E. Schindelin, A new metric for probability distributions, IEEE Trans. Inf. Theory 49 (2003) 1858–1860.\n[12] N. P. Franks, W. R. Lieb, Temperature dependence of the potency of\nvolatile general anesthetics: Implications for in vitro experiments, Anesthesiology 84 (1996) 716–720.\n[13] F. Frascoli, L. van Veen, I. Bojak, M. P. Dafilis, D. T. J. Liley, Dynamical complexity in a mean-field model of human EEG, Proc. SPIE 7270\n(2008) 72700V.\n[14] W. J. Freeman, Mass action in the nervous system: Examination of the\nneurophysiological basis of adaptive behavior through the EEG, 1st ed.,\nAcademic Press, New York, 1975.\n[15] W. J. Freeman, How brains make up their minds, 1st ed., Columbia\nUniversity Press, New York, 2001.\n\n25\n\n\f[16] B. H. Jansen, V. G. Rit, Electroencephalogram and visual evoked potential generation in a mathematical model of coupled cortical columns,\nBiol. Cybern. 73 (1995) 357–366.\n[17] V. K. Jirsa, H. Haken, Field theory of electromagnetic brain activity,\nPhys. Rev. Lett. 77 (1996) 960–963.\n[18] M. A. Kramer, H. E. Kirsch, A. J. Szeri, Pathological pattern formation and cortical propagation of epileptic seizures, J. R. Soc. Interface 2\n(2005) 113–127.\n[19] Y. A. Kuznetsov, Elements of applied bifurcation theory, 3rd ed.,\nSpringer-Verlag, New York, 2004.\n[20] D. T. J. Liley, D. M. Alexander, J. J. Wright, M. D. Aldous, Alpha\nrhythm emerges from large-scale networks of realistically coupled multicompartmental model cortical neurons, Netw.: Comput. Neural Syst.\n10 (1999) 79–92.\n[21] D. T. J. Liley, I. Bojak, Understanding the transition to seizure by\nmodeling the epileptiform activity of general anesthetic agents, J. Clin.\nNeurophysiol. 22 (2005) 300–313.\n[22] D. T. J. Liley, P. J. Cadusch, M. P. Dafilis, A spatially continuous mean\nfield theory of electrocortical activity, Netw.: Comput. Neural Syst. 13\n(2002) 67–113, cf. [23].\n[23] D. T. J. Liley, P. J. Cadusch, M. P. Dafilis, Corrigendum, Netw.: Comput. Neural Syst. 14 (2003) 369, cf. [22].\n[24] F. H. Lopes da Silva, W. Blanes, S. N. Kalitzin, J. Parra, P. Suffczyński,\nD. N. Velis, Dynamical diseases of brain systems: Different routes to\nepileptic seizures, IEEE Trans. Biomed. Eng. 50 (2003) 540–548.\n[25] F. H. Lopes da Silva, A. Hoeks, H. Smits, L. H. Zetterberg, Model of\nbrain rhythmic activity: The alpha-rhythm of the thalamus, Kybernetik\n15 (1973) 27–37.\n[26] F. H. Lopes da Silva, A. van Rotterdam, P. Barts, E. van Heusden,\nW. Burr, Models of neuronal populations: The basic mechanism of\nrhythmicity, Prog. Brain Res. 45 (1975) 281–308.\n26\n\n\f[27] W. W. Mapleson, Effect of age on mac in humans: A meta-analysis, Br.\nJ. Anaesth. 76 (1996) 179–185.\n[28] P. L. Nunez, Electric fields of the brain: The neurophysics of EEG, 1st\ned., Oxford University Press, New York, 1981.\n[29] A. J. K. Phillips, P. A. Robinson, A quantitative model of sleep-wake\ndynamics based on the physiology of the brainstem ascending arousal\nsystem, J. Biol. Rhythms 22 (2007) 167–179.\n[30] C. J. Rennie, P. A. Robinson, J. J. Wright, Unified neurophysical model\nof EEG spectra and evoked potentials, Biol. Cybern. 86 (2002) 457–471.\n[31] C. J. Rennie, J. J. Wright, P. A. Robinson, Mechanisms of cortical\nelectrical activity and emergence of gamma rhythm, J. Theor. Biol. 205\n(2000) 17–35.\n[32] P. A. Robinson, C. J. Rennie, D. L. Rowe, Dynamics of large-scale brain\nactivity in normal arousal states and epileptic seizures, Phys. Rev. E 65\n(2002) 041924.\n[33] P. A. Robinson, C. J. Rennie, J. J. Wright, Propagation and stability\nof waves of electrical activity in the cerebral cortex, Phys. Rev. E 56\n(1997) 826–840.\n[34] U. Rudolph, B. Antkowiak, Molecular and neuronal substrates for general anaesthetics, Nat. Rev. Neurosci. (2004) 709–720.\n[35] S. M. Sherman, R. W. Guillery, Exploring the thalamus and its role in\ncortical function, The MIT Press, Cambridge, MA, 2005.\n[36] D. A. Steyn-Ross, M. L. Steyn-Ross (eds.), Modeling phase transitions\nin the brain, Springer-Verlag, Berlin, 2010.\n[37] D. A. Steyn-Ross, M. L. Steyn-Ross, J. W. Sleigh, M. T. Wilson, I. P.\nGillies, J. J. Wright, The sleep cycle modelled as a cortical phase transition, J. Biol. Phys. 31 (2005) 547–569.\n[38] H. C. Tuckwell, Introduction to theoretical neurobiology: Linear cable\ntheory and dendritic structure, vol. 1 of Cambridge Studies in Mathematical Biology, Cambridge University Press, Cambridge, 1988.\n27\n\n\f[39] L. van Veen, D. T. J. Liley, Chaos via Shilnikov's saddle-node bifurcation\nin a theory of the electroencephalogram, Phys. Rev. Lett. 97 (2006)\n208101.\n[40] A. E. Walker, The Primate Thalamus, University of Chicago Press,\nChicago, 1938.\n[41] F. Wendling, J.-J. Bellanger, F. Bartolomei, P. Y. Chauvel, Relevance\nof nonlinear lumped-parameter models in the analysis of depth-EEG\nepileptic signals, Biol. Cybern. 83 (2000) 367–378.\n[42] H. R. Wilson, J. D. Cowan, Excitatory and inhibitory interactions in\nlocalized populations of model neuron, Biophys. J. 12 (1972) 1–24.\n[43] H. R. Wilson, J. D. Cowan, A mathematical theory of the functional\ndynamics of cortical and thalamic nervous tissue, Kybernetik 13 (1973)\n55–80.\n[44] J. J. Wright, EEG simulation: Variation of spectral envelope, pulse\nsynchrony and ≈40 hz oscillation, Biol. Cybern. 76 (1997) 181–194.\n[45] L. H. Zetterberg, L. Kristiansson, K. H. Mossberg, Performance of a\nmodel for a local neuron population, Biol. Cybern. 31 (1978) 15–26.\n\n28\n\n\f29\n\nParameter\nhrk\nτk\nheq\nek\nheq\nik\nΓek\nΓik\nγek\nγik\nα\nNee\nα\nNei\nβ\nNek\nβ\nNek\nv\n1/Λ\nSkmax\nμk\nσk\npek\n\nDefinition\nresting membrane potential\npassive membrane decay time\nexcitatory reversal potential\ninhibitory reversal potential\nEPSP peak amplitude\nIPSP peak amplitude\nEPSP characteristic rate constant‡\nIPSP characteristic rate constant‡\nno. of cortico-cortical synapses, target excitatory\nno. of cortico-cortical synapses, target inhibitory\nno. of excitatory intracortical synapses\nno. of inhibitory intracortical synapses\naxonal conduction velocity\ndecay scale of cortico-cortical connectivity\nmaximum firing rate\nfiring threshold\nstandard deviation of firing threshold\nextracortical synaptic input rate\n\nMinimum\n−80\n5\n−20\n−90\n0.1\n0.1\n100\n10\n2000\n1000\n2000\n100\n100\n1\n0.05\n−55\n2\n0\n\nMaximum\n−60\n150\n10\nhrk − 5†\n2.0\n2.0\n1, 000\n500\n5000\n3000\n5000\n1000\n1, 000\n10\n0.5\n−40\n7\n10, 000\n\nUnits\nmV\nms\nmV\nmV\nmV\nmV\ns−1\ns−1\n–\n–\n–\n–\ncm s−1\ncm\nms−1\nmV\nmV\ns−1\n\nTable 1: Physiological ranges for spatially averaged model parameters. Common ranges does not imply shared values\nfor different types k = e, i of neuronal target populations, hence physiological parameter space is 32-dimensional. For bulk\nβ\noscillations and for absent inhibitory extracortical input, vΛ and Γik Nik\noccur only in combination: this makes parameter\neq\nspace effectively 29-dimensional. † The upper limit for hie should be hre − 5 mV, but was erroneously set to hri − 5 mV in\nRef. [3]. Since power spectra were obtained around a chosen fixed point with h∗e > heq\nie for all parameter sets, this has no\nsignificant consequences. ‡ Equivalently time to peak PSP amplitude given by 1/γlk .\n\n\f60\nindividual\ncumulative\n\nexplained variance in %\n\n50\n\n40\n\n30\n\n20\n\n10\n\n0\n\n1\n\n2\n\n3\n\n4\n\n5\n6\n7\nprincipal component\n\n8\n\n9\n\n10\n\nFigure 2: Principal Component Analysis of the model parameter space. Fraction\nof the total variance of parameters explained by the first ten principal components for all\n73,454 sets. Parameter space has 32 physiological dimensions, of which 29 are effectively\ndistinguished here, c.f. Tab. 1. Orange bars indicate individual contributions, brown ones\ntheir cumulative sum. The evident absence of strong linear correlations within parameters\nmeans parameter space cannot be reduced easily to a lower number of effective degrees of\nfreedom.\n\n30\n\n\f2\n\n10\n\nA\n\n1\n\n10\n\nfh\n\nfh\n\n4\n\nk\n\n3\n\n0\n\n10\n\nfh\n\n1\n\nfh\n\n2\n\nsn\n\n−1\n\n10\n\n1\n\nhb\nsn\n\n2\n\n−2\n\n10\n\n2\n\n10\n\nB\n\nfh\n\n1\n\n10\n\n3\n\nc\n\nk\n\n4\n\nfh\nc\n\n1\n\n2\n\nfh\n\n1\n\n0\n\n10\n\nfh\n\n2\n\n−1\n\nsn1\n\n10\n\nhb\nsn\n\n2\n\n−2\n\n10\n\n−3\n\n10\n\n−2\n\n10\n\n−1\n\n10\n\n0\n\n10\n\n1\n\n10\n\n2\n\nR\n\n10\n\n3\n\n10\n\n4\n\n10\n\n5\n\n10\n\nFigure 3: Typical bifurcation structure of families. Continuations for two distinct\nparameter sets belonging to F1 (A) and F2 (B), respectively. Note in B that fold-Hopf\npoints fh2 and fh3 of F2 occur close to the cusps c2 and c1 , respectively. The two saddlenode lines are shown in blue sn1 and green sn2 , respectively, and the Hopf line hb in red.\nThe number of equilibria is 3 for areas bounded by the saddle-node lines sn, and 1 outside.\nThe rectangle shows the physiologically relevant range of Rk-space.\n\n31\n\n\f2\n\n10\n\n10\nsn\n\nB\n\nA\n\n1\n\nhb\nsn\n\nc\n\n1\n\n2\n\nfh2\nc\n\n1\n\n10\n\n10\n\n2\n\nk\n\nfh\n\nfh\n\n4\n\n4\n\nc\n\nfh\n\n0\n\n1\n\n10\n\n1\n\n10\n\nfh\n\n3\n\nfh\n\n2\n\nc\n\nfh\n\n2\n\n2\n\np =26,000/s\n\np =14,000/s\n\nei\n\n−1\n\nei\n\n10\n\n10\n\n2\n\n10\n\n10\nC\n\nfh\nc\nc\n1\n\n2\n\nc\n\nD\n1\n\n1\n\nfh\n\n2\n\n2\n\n10\n\nc\n\n10\n\n2\n\nfh\n\n4\n\nk\n\nfh\n\n4\n\nfh\n\nfh\n\n2\n\nc\n0\n\n10\n\nc\n\n2\n\nc\n\n1\n\nfh\n\n2\n\n3\n\nc\n\nfh1\n\n1\n3\n\nfh\n\n1\n\np =7,000/s\n\np =6,800/s\n\nei\n\n−1\n\n10\n\n−2\n\n10\n\n10\n\nfh\n2\n\n−1\n\n10\n\n0\n\n1\n\n10\n\n10\n\n2\n\n10\n\nei\n\n3\n\n−2\n\n10 10\n\nR\n\n−1\n\n10\n\n0\n\n1\n\n10\n\n10\n\n2\n\n10\n\n10\n3\n10\n\nR\n\nFigure 4: Exogenous effects: inter-familiar transition. Metamorphosis from F1 to\nF2 through two swallow tail bifurcations, induced by decreasing thalamic excitation to\ninhibitory neurons: A F1 at pei = 26, 000/s, B F1 at pei = 14, 000/s, C just before\nbifurcation at pei = 7, 000/s, and D just after bifurcation pei = 6, 800/s. The separation\nbetween the cusps c1 and c2 further increases for even lower values of pei , and a pattern\nidentical to the typical F2 in Fig. 3B appears at pei ≈ 6, 000/s. Analogous transitions\noccur for increasing thalamic excitation to excitatory neurons (pee ). The overwhelming\nmajority of the inspected sample of 405 sets metamorphose similarly.\n\n32\n\n\f1\nc\n0.10\n\nB\n\nA\n\nsn\n\n1\n\n1\n\nhb\n\n1\n\nfh\n\nhb\n\n2\n\n2\n\n0.08\n\nfh\n\n1\n\nbt\n\n1\n\nbt\n\n1\n\n0.1\n\nbt\n\ngh\n\nk\n\n1\n\n1\n\nbt\n\ngh\n\n2\n\n2\n\n0.1\n\nbt\n\n2\n\nbt\n\n0.06\n\n0.06\n\n2\n\np =3,724/s\n\np =3,720/s\n\nei\n\nei\n\nD\n\nC\n0.07226\n0.08\n\n0.08\ngh1\n\nk\n\n0.07222\ngh\n0.029038\n\n1\n\n0.029040\nbt\n\n1\n\ngh\n\n2\n\nbt\n\n1\n\nbt\n\n2\n\nbt\n\n2\n\n0.06\np =3,729/s\n0.02818\n\n0.02884\nR\n\n0.06\np =3,735/s\n\nei\n\nei\n\n0.02951\n\n0.02818\n\n0.02884\nR\n\n0.02951\n\nFigure 5: Exogenous effects: annihilation of bt points. Increasing thalamic excitation to inhibitory neurons results in the annihilation of the bt points: A pei = 3, 720/s, B\npei = 3, 724/s, C pei = 3, 729/s and D pei = 3, 735/s. The inset in A shows the triangular\nregion of F2 where the bifurcations take place. Further increase of pei shrinks hb1 up to the\ncoalescence and disappearance of the bt points. Note that the transformations induced by\nthe thalamic input occur over a very small range of pei and within even smaller intervals\nfor R and k, demonstrating the sensitivity of the parameters. To improve visualization,\ncontinuation lines have a larger linewidth and the sn branch is dashed.\n\n33\n\n\f0.12\n\nFamily 1\n0.04\n\nFamily 2\n\n0.10\n\n0.03\n\n0.02\n\n0.08\nNormalized frequency of sets\n\n0.01\n\n0.00\n0.0\n0.06\n\n0.2\n\n0.4\n\n0.6\n\n0.006\n\n0.004\n0.04\n\n0.002\n\n0.02\n0.000\n1\n\n0.00\n0.0\n\n0.2\n\n0.4\n\n0.6\n\n1.2\n\n0.8\n1.0\n1.2\nPower Ratio at 1 MAC\n\n1.4\n\n1.4\n\n1.6\n\n1.6\n\n1.8\n\n1.8\n\n2.0\n\n2.0\n\nFigure 6: Distributions of power ratios sorted by families. The normalized distributions of power rations for the analyzed 73,454 sets, with F1 in blue and F2 in red, and\nmagnifications of their tails in the insets. There are 29,131 sets of F1 type (39.7% of the\ntotal) and 44,323 sets of F2 type (60.3%). The total number of bins is 250 for power ratios\n0 − 4, of which only 0 − 2 is shown. Average and standard deviation of the power ratios are\n0.77 ± 0.09 for F1 and 0.82 ± 0.09 for F2. Cumulative probabilities for the distributions\nat the tails are P (power ratio ≤ 0.7|F 1) = 0.161, P (power ratio ≤ 0.7|F 2) = 0.060, and\nP (power ratio ≥ 1.0|F 1) = 0.012, P (power ratio ≥ 1.0|F 2) = 0.037.\n\n34\n\n\f0.12\n\nA\n\nFamily 1\n\nB\n\n0.12\n\nNormalized frequency of sets\n\nFamily 2\n0.10\n\n0.10\n\n0.08\n\n0.08\n\n0.06\n\n0.06\n\n0.04\n\n0.04\n\n0.02\n\n0.02\n\n0.00\n\n0.05\n\nτ [s]\n\n0.10\n\n0.15\n\n3\n\ne\n\nσ [mV]\n\n0.00\n7\n\n5\n\ne\n\n0.12\n\n0.12\n\nNormalized frequency of sets\n\nC\n\nD\n\n0.10\n\n0.10\n\n0.08\n\n0.08\n\n0.06\n\n0.06\n\n0.04\n\n0.04\n\n0.02\n\n0.02\n\n0.00\n\n−85\n\neq\nie\n\nh\n\n−75\n[mV]\n\n−65\n\n250\n\n500\nγ [1/s]\n\n750\n\n0.00\n1,000\n\nei\n\nFigure 7: Normalized frequencies of parameter values by families, part 1. Blue\nbars are for F1, red ones for F2. The total number of bins is 20, within the intervals of\nphysiological validity indicated in Tab. 1. Histograms A and B represent the distributions\nwith the most striking differences.\n\n35\n\n\fA\n\nB\n\nFamily 1\n\n0.10\n\nFamily 2\n\nNormalized frequency of sets\n\n0.15\n\n0.08\n\n0.06\n0.10\n\n0.04\n0.05\n0.02\n\n0.00\n\n20\n\n40\n\n60 −1\nγii [s ]\n\n80\n\n100\n\n120\n\n0.5\n\n1\nΓie [mV]\n\n1.5\n\n0.00\n2\n\n0.10\n\n0.10\n\nNormalized frequency of sets\n\nC\n\nD\n\n0.08\n\n0.08\n\n0.06\n\n0.06\n\n0.04\n\n0.04\n\n0.02\n\n0.02\n\n0.00\n\n0.5\n\n1\nΓii [mV]\n\n1.5\n\n2\n\n200\n\n400\n\n600\nNβie\n\n800\n\n0.00\n1000\n\nFigure 8: Normalized frequencies of parameters values by families, part 2. See\ncaption of Fig. 7 for details. γii is here binned only in the interval 0 − 120/s, since larger\nvalues are extremely rare. Also note the different y-axis scales.\n\n36\n\n\fA\n\nB\n\n−71\n−72\n\n−20\n\n−20\n\n−73\n−74\nhb\n\nsn\n−75\n−45\n\n−45\n\n[mV]\n\n−76\n0.92\n\n0.94\n\n0.96\n\n0.98\n\nsn\n\nhe\n\nmax\n\n0.90\n\nhb\n\nsn\n−70\n\n−70\n\nhb\nhb\n\nsn\n0\n\n0.5\n\n1.0\n\n1.5\n\n2.0\n\n−30\n\nC\n\n0.5\n\n1.0\n\nD\n\n1.5\n\n2.0\n\n−40\n\n−35\n\n−20\n\n−20\n\n−40\n−60\n−45\n0\n\n0.5\n\n0\n\nsn\n\n−45\n[mV]\n\nt [s]\n\nt [s]\n\n0.5\n\nhb\n\nhb\n\n−45\nsn\n\nsn\n\nhe\n\nmax\n\n−20\nhb\n\n−58\n\nsn\n\nhb\n−60\n\n−70\n−70\n0\n0\n\nt [s]\n0.5\n\n0\n\n0.5\n1.0\nR\n\n1.5\n\n2.0\n\n0.5\n\n1.0\nR\n\n−70\nt [s]\n1.5\n\n0.5\n2.0\n\nFigure 9: Continuations in R of four different F1 parameter sets at fixed values\nof k. The interval 0.75 ≤ R ≤ 2.00 is considered physiologically meaningful, as are the\nchosen values of k (A k = 1.25, B k = 1.25, C k = 1.00 and D k = 1.00). Green lines\ndenote equilibria, blue lines correspond to stable and red to unstable periodic orbits, i.e.,\nself-sustained oscillations. To avoid clutter, only the maximal he of orbits are plotted and\nchanges to the stability of equilibria between the sns and hbs are not shown. Examples of\nperiodic orbits from stable and unstable branches in physiologically meaningful intervals\nare also depicted as insets: in C an unstable oscillation converging to equilibrium in red,\nand a stable one in alpha frequency range (8 − 13 Hz) in blue; in D two stable orbits\nwith different amplitudes, the top one in beta (13 − 30 Hz) and the bottom one in alpha\nfrequency range, respectively. Note that the latter two orbits partly overlap in R, and\nthus constitute an example of multistability.\n\n37\n\n\fA\n\nB\n−40\n\n−20\n\n−20\n\n−80\n0.0\n−58\n\n0.5\n\nhb\n−45\nhmax\n\n−45\n\ne\n\nhb\n−68\n0.0\n\nhb\n\nhb\n\n−70\n\n0\n\n0.5\n\n1.0\n\n1.5\n\n2.0\n\n−50\n\nC\n\n0.5\nD\n\n−55\n\n1.0\n\n1.5\n\n2.0\n\n−30\n−20\n\n−40\n−45\n\nhb\n\n0.5\n\n−70\n\n−35\n\n−20\n\n−60\n\nsn\n\n−50\n−55\n\n−45\n\nt [s]\n\nsn\n\n−65\n0\n\n0.5\n\nt [s]\n\nhb\n\nsn\n\n−60\n\n−45\n\nhmax\n\n−65\ne\n\n0.1\n\n0.2\n\n0.3\n\n0.4\n\nhb\nsn\n\nhb\n\nhb\n\n−70\n\n0\n\n0.5\n\n1.0\nR\n\n1.5\n\n2.0\n\n0.5\n\n1.0\nR\n\n−70\n\n1.5\n\n2.0\n\nFigure 10: Continuations in R of four different F2 parameter sets at fixed values\nof k. As in Fig. 9, but for F2 and with the following values of k: A k = 1.00, B k = 1.25,\nC k = 1.25 and D k = 1.25. Note how the extension of stable orbits and the existence\nof multistable regimes (i.e., multiple, different orbits occurring at the same R) is more\npronounced compared to F1 in Fig. 9. In B and C stable periodic orbits at physiologically\nmeaningful values are also shown as insets. In B, where a multistable regime is present,\nfrequencies are in the beta and alpha bands for the higher and lower inset, respectively,\nwhereas in C a typical alpha oscillation is depicted. The inset in D is a magnification\nshowing more clearly the presence of multistability in the non physiological R range.\n\n38\n\n\f"}