{"id": "http://arxiv.org/abs/0906.0124v1", "guidislink": true, "updated": "2009-06-01T14:57:17Z", "updated_parsed": [2009, 6, 1, 14, 57, 17, 0, 152, 0], "published": "2009-06-01T14:57:17Z", "published_parsed": [2009, 6, 1, 14, 57, 17, 0, 152, 0], "title": "Topological Defects in Gravitational Lensing Shear Fields", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0906.3155%2C0906.4572%2C0906.5425%2C0906.5342%2C0906.3412%2C0906.5076%2C0906.2152%2C0906.3977%2C0906.4561%2C0906.5508%2C0906.3046%2C0906.3748%2C0906.2753%2C0906.4958%2C0906.3230%2C0906.3366%2C0906.1470%2C0906.2955%2C0906.3767%2C0906.2529%2C0906.0899%2C0906.1278%2C0906.1627%2C0906.2306%2C0906.1688%2C0906.5320%2C0906.0081%2C0906.2794%2C0906.5432%2C0906.2648%2C0906.0957%2C0906.2744%2C0906.1537%2C0906.2960%2C0906.3307%2C0906.0948%2C0906.0377%2C0906.4910%2C0906.1722%2C0906.5544%2C0906.2131%2C0906.0612%2C0906.1708%2C0906.1457%2C0906.0309%2C0906.2577%2C0906.2695%2C0906.2376%2C0906.4751%2C0906.3143%2C0906.3864%2C0906.5596%2C0906.3833%2C0906.0213%2C0906.3283%2C0906.1487%2C0906.2493%2C0906.2408%2C0906.1189%2C0906.3053%2C0906.1948%2C0906.5378%2C0906.4295%2C0906.1680%2C0906.4195%2C0906.4414%2C0906.0712%2C0906.2930%2C0906.1586%2C0906.5353%2C0906.0124%2C0906.4693%2C0906.3181%2C0906.3613%2C0906.1551%2C0906.4335%2C0906.1075%2C0906.1356%2C0906.4190%2C0906.5406%2C0906.0237%2C0906.2642%2C0906.1534%2C0906.1012%2C0906.4786%2C0906.5501%2C0906.4495%2C0906.3386%2C0906.0961%2C0906.0886%2C0906.0741%2C0906.0219%2C0906.4559%2C0906.2033%2C0906.2617%2C0906.0289%2C0906.0504%2C0906.4518%2C0906.1807%2C0906.5456%2C0906.2433&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Topological Defects in Gravitational Lensing Shear Fields"}, "summary": "Shear fields due to weak gravitational lensing have characteristic coherent\npatterns. We describe the topological defects in shear fields in terms of the\ncurvature of the surface described by the lensing potential. A simple\ninterpretation of the characteristic defects is given in terms of the the\numbilical points of the potential surface produced by ellipsoidal halos. We\nshow simulated lensing shear maps and point out the typical defect\nconfigurations. Finally, we show how statistical properties such as the\nabundance of defects can be expressed in terms of the correlation function of\nthe lensing potential.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0906.3155%2C0906.4572%2C0906.5425%2C0906.5342%2C0906.3412%2C0906.5076%2C0906.2152%2C0906.3977%2C0906.4561%2C0906.5508%2C0906.3046%2C0906.3748%2C0906.2753%2C0906.4958%2C0906.3230%2C0906.3366%2C0906.1470%2C0906.2955%2C0906.3767%2C0906.2529%2C0906.0899%2C0906.1278%2C0906.1627%2C0906.2306%2C0906.1688%2C0906.5320%2C0906.0081%2C0906.2794%2C0906.5432%2C0906.2648%2C0906.0957%2C0906.2744%2C0906.1537%2C0906.2960%2C0906.3307%2C0906.0948%2C0906.0377%2C0906.4910%2C0906.1722%2C0906.5544%2C0906.2131%2C0906.0612%2C0906.1708%2C0906.1457%2C0906.0309%2C0906.2577%2C0906.2695%2C0906.2376%2C0906.4751%2C0906.3143%2C0906.3864%2C0906.5596%2C0906.3833%2C0906.0213%2C0906.3283%2C0906.1487%2C0906.2493%2C0906.2408%2C0906.1189%2C0906.3053%2C0906.1948%2C0906.5378%2C0906.4295%2C0906.1680%2C0906.4195%2C0906.4414%2C0906.0712%2C0906.2930%2C0906.1586%2C0906.5353%2C0906.0124%2C0906.4693%2C0906.3181%2C0906.3613%2C0906.1551%2C0906.4335%2C0906.1075%2C0906.1356%2C0906.4190%2C0906.5406%2C0906.0237%2C0906.2642%2C0906.1534%2C0906.1012%2C0906.4786%2C0906.5501%2C0906.4495%2C0906.3386%2C0906.0961%2C0906.0886%2C0906.0741%2C0906.0219%2C0906.4559%2C0906.2033%2C0906.2617%2C0906.0289%2C0906.0504%2C0906.4518%2C0906.1807%2C0906.5456%2C0906.2433&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Shear fields due to weak gravitational lensing have characteristic coherent\npatterns. We describe the topological defects in shear fields in terms of the\ncurvature of the surface described by the lensing potential. A simple\ninterpretation of the characteristic defects is given in terms of the the\numbilical points of the potential surface produced by ellipsoidal halos. We\nshow simulated lensing shear maps and point out the typical defect\nconfigurations. Finally, we show how statistical properties such as the\nabundance of defects can be expressed in terms of the correlation function of\nthe lensing potential."}, "authors": ["Vincenzo Vitelli", "Bhuvnesh Jain", "Randall D. Kamien"], "author_detail": {"name": "Randall D. Kamien"}, "author": "Randall D. Kamien", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1088/1475-7516/2009/09/034", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/0906.0124v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0906.0124v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "17 pages, 4 figures", "arxiv_primary_category": {"term": "astro-ph.CO", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "astro-ph.CO", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "cond-mat.stat-mech", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0906.0124v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0906.0124v1", "journal_reference": "JCAP 0909:034,2009", "doi": "10.1088/1475-7516/2009/09/034", "fulltext": "APS/123-QED\n\nTopological Defects in Gravitational Lensing Shear Fields\nVincenzo Vitelli, Bhuvnesh Jain, Randall D. Kamien1\n1\n\nDepartment of Physics and Astronomy,\n\narXiv:0906.0124v1 [astro-ph.CO] 1 Jun 2009\n\nUniversity of Pennsylvania, Philadelphia PA, 19104\n\nAbstract\nShear fields due to weak gravitational lensing have characteristic coherent patterns. We describe\nthe topological defects in shear fields in terms of the curvature of the surface described by the lensing\npotential. A simple interpretation of the characteristic defects is given in terms of the the umbilical\npoints of the potential surface produced by ellipsoidal halos. We show simulated lensing shear maps\nand point out the typical defect configurations. Finally, we show how statistical properties such\nas the abundance of defects can be expressed in terms of the correlation function of the lensing\npotential.\nPACS numbers: Valid PACS appear here\n\n1\n\n\fI.\n\nINTRODUCTION\n\nThe central tenet of Einstein's General Relativity is that massive bodies curve spacetime. As a result, light from distant galaxies is deflected by mass distributions encountered\nalong the line of sight. The images of distant galaxies, that act as sources, are magnified\nand sheared – this effect is known as gravitational lensing. The most striking manifestation\nof gravitational lensing effects, know as strong lensing, consists in the formation of multiple\nimages of a single background galaxy. In the special case in which a source, a very large\nmass and the observer happen to be approximately aligned an Einstein ring can be observed\nand from its diameter the lensing mass can be inferred [1].\nAlong typical lines of sight the lensing effect is weak, leading to percent level magnifications and shears. However, such a small signal can still be detected from a statistical\nanalysis that relies on the coherence of the shear field over the sky. This allows us to infer\nhow the dark matter is concentrated around galaxies and galaxy clusters, as well as providing\na testing ground for dark energy and modified gravity theories [2, 3].\nIn this paper we explore the connection between the theory of topological defects and\nthe spatial patterns of shear fields due to weak gravitational lensing. The starting point\nof our approach rests on an analogy between gravitational lensing shear fields, as a probe\nof structure formation on cosmological scales, and the anisotropic optical or mechanical\nresponse of materials, as a probe of their inhomogeneous structure on microscopic scales. As\nan illustration, the topological defects in the local shear field of an elastic medium reflect the\nexternal deformations applied to the solid [4]. Similarly for thin liquid crystal films confined\non a curved substrate, the density of topological defects depends on the inhomogeneous\ncurvature of the underlying surface [5, 6, 7]. In a somewhat different context, the distribution\nof optical singularities can be used to shed light on the statistics of randomly polarized light\nfields [8]. Here we suggest that topological defects in the cosmic shear can be used as a probe\nof the gravitational potential generated by the lensing mass fluctuations on large scales.\nThe outline of this work is as follows. In §2, the basic formalism of weak gravitational\nlensing and the criteria to identify topological defects in shear fields are presented. Our\ngeometric approach is presented in §3 where the defects in the shear field are related to\nthe properties of an imaginary surface whose lines of constant height are defined by the\ncontour lines of the underlying gravitational potential responsible for the lensing. This\n2\n\n\fmapping is applied to describe the characteristic behavior of ellipsoidal structures in the\nmass distribution and to more realistic shear lensing maps obtained using N-body computer\nsimulations. In §4 we turn to the case of a random mass distribution whose gravitational\npotential is a Gaussian variable that describes the stochastic geometry of a surface. This\nassumption (valid on large angular scales) allows us to express the defect density in terms of\nthe two point correlation function of the gravitational potential. The latter is estimated for\nthe standard Cold Dark Matter model for large-scale structure in the universe and compared\nto the results of simulations. Corrections for weakly non-Gaussian fields can be calculated\nusing perturbation theory as discussed in §5 where ideas for further work are briefly sketched.\nII.\n\nTOPOLOGICAL DEFECTS IN LENSING SHEAR FIELDS\n\nIn this section, we review the basic formalism of gravitational lensing that relates the\ndeformation of the shapes of background galaxy images to the projected mass density responsible for lensing.\n\nA.\n\nBasics of Gravitational Lensing\n\nConsider a source whose true angular position on the sky makes an angle β with an\narbitrary optic axis. As a result of the lensing, an observer sees the light ray as coming\nfrom an image at an angle θ (from the optic axis) that differs from β by the (reduced)\ndeflection angle α. These angular displacements can also be viewed as two dimensional\n~ ~θ} on a locally flat sky (see [9] for a review). These vectors are related by:\nvectors {~\nα, β,\nβ~ = ~θ − α\n~.\nIn this notation, the image distortion caused by gravitational lensing is locally described\nby Aij , the Jacobian matrix of the transformation between β~ and ~θ which reads\nAij ≡\n\n~\n∂βi\n∂αi (θ)\n∂ 2 ψ(~θ)\n= δij −\n= δij −\n∂θj\n∂θj\n∂θi ∂θj\n\n(1)\n\nwhere we used the relation α\n~ = ∇θ~ ψ between the deflection angle and the gradient of\nthe projected (two-dimensional) Newtonian potential ψ(~θ). The latter satisfies the Poisson\nequation\n1\n1\n(ψ11 + ψ22 ) ≡ ∇2θ ψ = κ(~θ)\n2\n2\n3\n\n(2)\n\n\fwhere the convergence, κ(~θ), is given by the weighted projection of the mass density fluctuation field, see Ref. [10] for precise definitions. Equation (2) fixes the trace of the deformation\nmatrix Aij . The other two independent components of Aij can be rewritten in terms of a\nshear tensor γ = {γ1 , γ2} and the angle α as\nh\ni\n1\n(ψ11 − ψ22 ) ≡ γ(~θ) cos 2α(~θ)\n2\nh\ni\n~\n~\n~\nγ2 (θ) = ψ12 = ψ21 ≡ γ(θ) sin 2α(θ)\nγ1 (~θ) =\n\nwhere γ = (γ12 + γ22 )\n\n1/2\n\n(3)\n\n≥ 0 and α is the orientation angle of γ. The physical interpretation\n\nof the shear tensor is straightforward once the components of the Hessian ψij are expressed\nin terms of γ1 , γ2 and κ with the aid of Equations (2-3) and then substituted into Eq. (1).\nThe result reads\n\n1\nAij = (1 − κ) \n0\n\n\n\ncos 2α sin 2α\n0\n\n−γ\nsin 2α − cos 2α\n1\n\n\n(4)\n\nThe eigenvalues of this matrix are {1 − κ − γ, 1 − κ + γ} with eigenvectors v1 = [cos α, sin α]\nand v2 = [− sin α, cos α], respectively. The direction of shear is v1 : when the deformation\ntensor (A−1 )ij acts on a test circular source, it magnifies the image isotropically, by the first\nterm in Eq. (4), and it deforms it into an ellipse with major axis of magnitude (1 − κ − γ)−1\noriented in the α direction, by the second term (see Fig. 1).\nIn the sub-section below we will consider the pattern of the shear on the sky induced\nby the spatial variation of ψ(~θ). Over patches of order a degree on a side, characteristic\ntangential patterns around lensing galaxy clusters and galaxy groups are observable.\nThus measuring the anisotropy introduced in the light distribution from distant galaxies allows us to infer information about mass inhomogeneities along the line of sight that\ngenerated the lensing shear.\n\nB.\n\nTopological defects\n\nThe local orientation of the shear can be visualized by means of a line field, that is to\nsay a vector n with both ends identified n = −n. This is analogous to the description of\ninteracting liquid crystal molecules in condensed matter physics, where the director field n\ndenotes the local orientation of the molecules. In that context, it is often useful to develop\n4\n\n\fθ2\n\nα\n\nθ1\n\nFIG. 1: The light from a distant source of circular shape (drawn as a dashed line) is deformed into\nan ellipse (continuous line). The local direction of the major axis of the ellipse can be represented\nby a double headed vector that forms an angle α with the x̂ axis of a cartesian coordinate system.\nThe positions in a small patch of the sky are measured by the angles {θ1 , θ2 } within the flat sky\napproximation.\n\na coarse grained view of the many-body system by concentrating on global configurations of\nthe director field called disclinations [11]. Disclinations are topological defects like vortices\nin fluid mechanics that can be classified according to the index of the streamlines around\nthem.\nFor example , the shear field angle α(θ1 , θ2 ) has a topological defect of index m if\nI\n∇α(θ1 , θ2 ) * dl = 2πm\n\n(5)\n\naround any contour that surrounds the location of the defect θ~d . Upon using Stokes theorem,\nEq. (5) can be cast in the differential form\n2 ~\n(θ − θ~d )\n∇ × ∇α(θ1 , θ2 ) = 2πm δD\n\n(6)\n\n2 ~\nwhere δD\n(θ − θ~d ) denotes the Dirac delta function at the location of the defect. As a result,\n\ntopological defects are analogous to localized regions of quantized magnetic flux with charge\nproportional to the winding number m, and ∇α plays the role of the electromagnetic gauge\n5\n\n\f− 12\n\n1\n2\n\n−1\n\n1\n\nFIG. 2: (Color Online) Basic classification of topological defects labeled by their respective index.\nThe index m is found by evaluating a line integral of ∇α around any contour surrounding the\nsingularity at the core of the topological defect and dividing by 2π, see Equations (1) and (2).\n\nfield. The (shear) field lines corresponding to topological defects of different indexes are\nreproduced schematically in Fig. 2. The symmetry of the shear field requires that the defect\nindex m must be a half-integer. The negatively charged defects correspond to the case in\nwhich the shear field changes in the clockwise direction while travelling counter-clockwise\naround the contour encircling the defect.\nGlobal rotations by a constant angle at every point in the flat sky, α(~θ) → α(~θ) + c, do\nnot change the index of a topological defect since the definition in Eq. (4) depends only\non the gradient of α. For example, the vortex-like defect in Fig. 2 has the same m = 1\nindex as a sink which is obtained from the vortex by a c = π/2 rotation. This invariance\ndistinguishes the topological classification adopted in this work from the more common EB modes classification adopted in previous studies of the CMB polarization field and of\ngravitational lensing. For example a 45 degree rotation of each shear around an m = 1\ndefect does not change its topological charge, but it changes an E mode to a B mode. In\nthis study, we concentrate on global topological features of the shear field whose positions\non the sky are related (non-locally) to the large scale mass fluctuations responsible for the\nlensing.\n\n6\n\n\fIII.\n\nTHE INDUCED GEOMETRY OF THE LENSING SHEAR\n\nIn this section, we derive the connection that exists between the topological defects\nin the shear field and the projected gravitational potential ψ(~θ) generated by the mass\nfluctuations. It is convenient to view ψ(θ1 , θ2 ) as the height function of a non-intersecting\ntwo dimensional surface. In the weak lensing regime, the derivatives of the potential ψ are\nsmall; the differential geometry of the surface is then approximated by the properties of the\nHessian ψij [12]. We show that the shear direction corresponds to the principal direction of\nmaximal curvature on the surface, provided that |κ|, γ ≪ 1.\nA.\n\nDefects as umbilical points\n\nOn such a two dimensional surface, we can step away from any given point in an infinite\nnumber of directions so that for each direction a curvature is defined. As the direction is\nsmoothly varied, two perpendicular directions of principal curvatures can be found for which\nthe curvature is maximal and minimal. The two principal curvatures, henceforth denoted\nby {κ1 , κ2 }, are the eigenvalues of the Hessian matrix ψij :\n\u0012\n\u0013\nq\n1\n2\n2\n{κ1 , κ2 } =\nψ11 + ψ22 ± 4ψ12 + (ψ11 − ψ22 ) = κ ± γ\n2\n\n(7)\n\nThe eigenvectors give the local directions of the principal axes. Since the magnitude of\nthe shear field γ is positive, κ1 = κ + γ corresponds to the principal direction of maximal\ncurvature. The Hessian matrix ψij determines the deformation matrix Aij according to Eq.\n(1). Upon comparing Eq. (7) with Eq. (4) and the discussion following it, we can conclude\nthat the direction of maximal curvature is the shear direction along which a reference circular\nsource is stretched most by the lensing potential (eg. it points along the major axis of the\nellipse in Fig. 1).\n2\nThe two principal curvatures are equal when 4ψ12\n+ (ψ11 − ψ22 )2 is equal to zero. This\n\ndefines the umbilical points of the surface: points where the principal directions are undefined\nand the surface is locally spherical or flat [13].\nWe can now connect the geometry of the surface which represents the gravitational potential and the topological defects in the lensing shear field. At points where the shear field\nγ has a topological defect, both of its components, see Eq. (3) must vanish, because its\nlocal direction is undetermined. This ensures that the two principal curvatures are equal.\n7\n\n\fAs a result, topological defects of the shear field can be identified as the umbilical points of\nthe induced surface. Indeed the umbilical points can be classified according to the index of\nthe principal direction vector field, which is either + 12 or − 12 at an umbilical point. As we\n\nshall see this corresponds to topological defects of index ± 21 in the shear field.\n\nThe local angle α̃(θ1 , θ2 ) by which the coordinate axis needs to be rotated to overlap with\nthe principal axes (given by the eigenvectors of the Hessian of the height function ψ) is\ntan 2α̃ =\n\n2ψ12\nψ11 − ψ22\n\n(8)\n\nA comparison of Eq. (8) with the definition of the shear components γ1 and γ2 in Eq. (3)\nshows that α̃ = α, the angle that specifies the orientation of the shear γ. Thus the principal\ndirection of maximal curvature on the surface tracks the shear field.\nIn the next sections we will show how this mathematical mapping leads to connections\nbetween the defect locations and the distribution of mass that generates the gravitational\npotential. In addition the identification between topological defects and umbilical points of\na random surface will allow us to relate the density of defects to statistical quantities such\nas the two-point correlation function of the projected gravitational field.\nIn practice, one would attempt to identify defects either in direct experimental measurements of shear using galaxy images, or ray tracing computer simulations that provide the\nshear field on a discrete grid. In both cases, it is necessary to consider how to interpret the\nnotion of a defect (introduced via Eq. (5) in the continuum limit) on a square grid. We have\ncarried out such a measurement using the net change in the angle α around closed loops at\neach pixel vertex, using techniques similar to those of [14]. Further details of the numerical\naspects will be presented elsewhere.\n\nB.\n\nThe ellipticity of haloes\n\nTo illustrate the formal ideas presented in the last section consider the simple case of an\nelliptical potential field ψ(x, y) generated, for example, by an isolated distribution of mass\nwhich is not axisymmetric, namely an elliptical halo. (Note, however, that even if the mass\ndistribution is locally axisymmetric the corresponding potential can be perturbed into an\nelliptical shape by the tidal field of nearby objects, see next section [15].).\nFor simplicity, consider two simple models of elliptical haloes whose gravitational poten8\n\n\fFIG. 3: Panel (a) and (b) show contour plots of the gravitational potentials for the elliptical halos\nin Eq. (9) and Eq. (10) respectively (dark blue is most negative). The parameters were set to\nǫ = 0.3 and c = 0.2. The two black dots indicate the umbilical points that correspond to the two\n+1/2 topological defects in the shear field. The wiskers represent the local direction of the cosmic\nshear which is oriented along the principal direction with maximum curvature.\n\ntials are given in dimensionless variables by\n\u0014 \u0012 2\n\u0013\u0015\nθ1\nθ22\nψ(θ1 , θ2 ) = − exp −\n+\n1+ǫ 1−ǫ\n\n(9)\n\nand\nψ(θ1 , θ2 ) = − q\n\n1\nθ12\n\n1+ǫ\n\n+\n\nθ22\n1−ǫ\n\n.\n\n(10)\n\n+c\n\nFigures 3(a) and 3(b) show the contours plots of the two potentials in Eqs. (9) and (10) respectively, overlayed onto the corresponding (normalized) shear fields represented by wiskers.\nThe umbilical points are labelled by black dots. Comparison of the shear field around each\ndefect in this figure with the defects shown in Fig. 2 allows a clear identification of the\ntwo umbilical points with two +1/2 topological defects. The line joining the two defects is\nperpendicular to the major axis of the ellipsoidal contours of the potential (and of the mass).\nThis follows from the fact that the shear field is oriented along the principal direction of\n9\n\n\fmaximal curvature. The defects separation, s, measured in the same units of the angular\ndistances {θ1 , θ2 } adopted for the potential in Eq. (9), reads\nr\n(1 − ǫ)ǫ\n.\ns=2\n1+ǫ\nwhile the separation for the potential in Eq. (10) reads\nr\n2c(1 − ǫ)ǫ\n.\ns=2\n3+ǫ\nIn the limit of zero ellipticity, ǫ = 0 and the separation between the two defects, s ∼\n\n(11)\n\n(12)\n√\n\nǫ,\n\ngoes to zero. The two +1/2 defects coalesce into a single vortex of index +1 which is\nexpected from an isolated axisymmetric mass distribution [9]. Qualitatively similar behavior\nis expected for ellipsoidal haloes with different potential profiles. We have also checked this\nfor a non-singular logarithmic potential.\nHence, the separation of the two nearby defects is a measure of the ellipticity of the\nhaloes. This is potentially useful since large-scale structure studies have shown that the mass\ndistribution in the universe can be well approximated (especially for statistical purposes) as\na network of elliptical halos of varying mass and concentration [16, 17]. Thus our approach\nfacilitates the interpretation of observed shear fields, as we discuss further below.\nWe note that the analysis presented here applies to non-singular mass distributions which\ngenerate a gravitational potential that is both continuous and finite everywhere, so that\nthe induced surface is smooth. In the case of either a point mass or an isothermal mass\ndistribution, the lensing potential diverges at the origin and would require further refined\ntechniques. We expect that realistic mass profiles and the ellipsoidal nature of halos avoids\nsuch a divergence.\n\nC.\n\nComplex defects patterns in realistic shear maps\n\nThe geometric analysis developed in this work can be applied to shear maps generated by\nmore realistic mass distributions than the isolated halo considered in the previous section.\nFor instance, tidal effects between nearby mass distributions can generate complex defect\npatterns that capture the skeleton of the contour lines of the corresponding gravitational\npotential. In order to demonstrate this point, we have generated shear lensing maps by\nmeans of N-body simulations combined with a ray tracing algorithm [18, 19].\n10\n\n\fFigure 4 shows a patch of the observed sky with the simulated (normalized) shear field\nplotted as whiskers at each pixel with the overlaid color map of the projected mass distribution (contours of κ). The continuous line interpolates the whiskers to facilitate comparison\nwith the defect patterns reproduced in Fig. 2. The red and black dots indicate negative\nor positive defects whose index has magnitude 1/2 (top row in Fig. 2). They have been\nidentified by measuring the net change, ∆α, accumulated by the shear angle in going around\neach pixel, see Ref. [14].\nThe top left part of the plot shows a prominent mass over-density of irregular shape\nwhich generates at large scales shear field lines topologically equivalent to a vortex. Upon\nmagnification, two +1/2 defects can be resolved. The line along which the two defects lie\nis approximately oriented perpendicularly to the major axis of the nearly elliptical mass\ndistribution, as indicated by our geometric analysis in the previous section.\nIn addition, note the presence of the isolated −1/2 defect (red dot) generated by tidal\neffects at the center of three mass over densities. The local projected gravitational potential\nresembles a monkey saddle when plotted as a height function with an umbilical point (the 1/2 defect) at its center. Note, in addition, that the dipole of ±1/2 defects in close proximity\n(on the right side of the picture) has no significant effect on the field lines at large scales\nsince the two defects cancel each other.\n\nIV.\n\nSTOCHASTIC GEOMETRY AND MASS FLUCTUATIONS\n\nIn this section, we consider the case of a random mass distribution and present a field\ntheory from which the density of topological defects can be read off from the statistics of\nthe stationary random function ψ(x, y). The gravitational potential is first assumed to be a\nGaussian random variable (deviations from Gaussianity can be calculated using perturbation\ntheory, this is beyond the scope of this paper). Light coming from very distant sources\nundergoes deflections from a number of intervening lensing planes. Assuming that the mass\ndistribution in different redshift slices is uncorrelated, the projected gravitational potential\nresulting from a large number of such lensing planes is well described by a Gaussian random\nvariable according to the central limit theorem. In addition, with a large smoothing scale, the\nlensing mass distribution itself is well approximated by a Gaussian random field. In practice,\nthere are not sufficiently many uncorrelated lens planes and the Gaussian assumption is valid\n11\n\n\fFIG. 4: Shear lensing map generated from ray tracing simulations on a patch of the sky with\nangular size around 4 arcminutes. The wiskers represent the local direction of the shear field\ninterpolated by the continuous line. The colour plot is the projected mass distribution and the\ndefects of index plus or minus 1/2 are indicated by black and red dots respectively.\n\nonly on angular scales sufficiently larger than 10 arcminutes (it is a better approximation\nfor sources at higher redshift).\n\nA.\n\nDefect density\n\nIn order to count N, the number of topological defects (where the magintude of γ = 0)\nin a patch of the sky, we need to evaluate the surface integral\nZ Z\n∂(ψ11 − ψ22 , ψ12 )\nN=\ndθ1 dθ2 δD (ψ11 − ψ22 ) δD (ψ12 ) det\n∂(θ1 , θ2 )\n\n(13)\n\nwhere δD indicates a delta function and the appropriate Jacobian determinant for the change\nof variable has been inserted [20]. This integral can be performed explicitly once the gravitational potential ψ(θ1 , θ2 ) and its derivatives are specified. Note that the third spatial\nderivatives are also needed to evaluate the determinant in Eq. (13).\nIn the case of Gaussian fluctuations of the lensing potential, the average defect density\ncan be obtained by performing a functional integral that averages over the unknown fields\nwith a probability density which is simply given by the exponential of a quadratic function\n12\n\n\fof ψ and its derivatives. Following the seminal work of Berry and Hannay [20], we can write\ndown explicit formulas for the density and other statistical properties of the detects using\n~ are completely determined by\nstandard field theoretic manipulations. The statistics of ψ(θ)\nspecifying either the autocorrelation function C(θ) or its power spectrum P (k) defined by\nZ\nC(θ) = hψ(θ0 )ψ(θ0 + θ)i = d2 kP (k)eik*θ\n(14)\nThe number density of defects, d, can then be related to the autocorrelation function of the\nlensing potential\n(6)\n\n3C0\n\nd=\n(6)\n\nwhere the derivative C0\n\n(4)\n\n10πC0\n\n(15)\n\nindicates the sixth spatial derivative of the correlation function\n\nC(θ) evaluated at θ = 0 [20, 21].\nThis formula can also be cast in terms of the moments of the power spectrum P (k) from\nEq. (14). The result reads\nM6\n4πM4\n\nd=\n\nwhere the nth moment of the power spectrum is defined as\nZ ∞\nMn ≡ 2π\ndk k n+1 P (k)\n\n(16)\n\n(17)\n\n0\n\nThe two correlation functions of topological charges with equal or opposite sign,\n{g++ (θ) = g−− (θ), g+− (θ)}, can be readily obtained from Eq. (13) in terms of θ, the angular\ndistance in the projected sky between two defects of equal or opposite index. The resulting\nmathematical expressions are too complicated to list here, see [21] and references therein\nfor more details. The topological defects correlation functions depend on the full functional\nform of C(θ) and its derivatives, not only its asymptotic value for θ → 0. As a result, they\nare a more sensitive probe of the underlying cosmological processes than the defect density\nin Eq. (15).\nThe mathematical techniques adopted to study the topology of the shear field can be\napplied successfully to the study of the cosmic microwave polarization field [14, 22, 23]. The\ncomponents of the lensing shear field are always correlated because in the standard weak\nlensing approximation they are derived, via Eq. (3), from the Hessian of the gravitational\npotential which is the fundamental physical field that controls the statistics. (Departures\nfrom this behavior are indicative of systematic errors in the data or physical effects distinct\n13\n\n\ffrom lensing. ) The CMB polarization components have a B-mode contribution from primordial tensor mode fluctuations and from lensing along the line-of-sight, so one generally\nrequires both a scalar and pseudoscalar potential to describe them [24].\n\nB.\n\nApplication to the cold dark matter model\n\nThe relations in Equations (15-16) express the number density of defects d in terms of\nthe correlation function or power spectrum of the projected gravitational potential. We can\nevaluate these for the current cosmological best fit Λ-CDM model, with the caveat that\nthe Gaussian approximation breaks down on scales below about 10 arcminutes (or angular wavenumbers l above about 1000), the precise value of the angle requires careful tests\nand depends on the source redshift. The breakdown occurs due to nonlinear gravitational\ndynamics which couples the initially random Fourier modes that comprise the perturbed\npotential [10]. While nonlinear effects are evident in measures like the lensing power spectrum on larger scales, the Gaussian approximation may still be valid to study topological\nfeatures which can be altered only by orbit crossings or mergers.\nThe potential is obtained from the projected density field via the Poisson equation as\ndiscussed in §II. The density field is characterized by its power spectrum, which can be\napproximated analytically by\nP (k) ≈ AkT 2 (k)\n\n(18)\n\nwhere the transfer function T (k) can be approximated analytically in terms of q = k/Ωm h2\n(Bardeen et al 1984)\nT (q) ≈\n\n\u0003−1/4\nln(1 + 2.34q) \u0002\n1 + 3.89q + (16.1q)2 + (5.46q)3 + (6.71q)4\n2.34q\n\n(19)\n\nThis power spectrum, evolved in time using linear perturbation theory, and projected\nappropriately along the line of sight gives C(θ), the two-point correlation function of ψ [18].\nUpon evaluating Eq. (15) above, we find (for comparison with simulations, evaluating the\nexpression at an arcminute), the predicted number density of defects is ∼ 107 per steradian.\nThe two main approximations made are the assumption of Gaussianity/linear evolution and\nthe assumption that the asymptotic behavior as θ approaches 0 is recovered at scales of\norder an arcminute.\n\n14\n\n\fWe compare the analytical prediction made above with the measured number of ±1/2\ndefects in ten independent ∼ 6 square degree patches obtained from simulated shear maps.\n\nWe estimate the measured density is 2 × 106 . (The error estimated from the standard\ndeviation is less than 5% .). We may expect that non-Gaussianity, due to the mergers of\nseveral small halos into larger ones, tends to reduce the number of defects. Hence, a difference\nwithin a factor of order unity is perhaps not surprising. A more careful comparison will be\nattempted by making perturbative corrections to the Gaussian formula in future work.\n\nV.\n\nCONCLUSION\n\nIn this paper we have studied topological defects in the shear field generated from weak\ngravitational lensing. Our geometric approach rests on the observation that topological\ndefects correspond to umbilical point of an imaginary surface whose height function is given\nby the projected gravitational potential. This allows us, for example, to relate the ellipticity\nof a gravitational halo to the distance between two defects of index +1/2. We describe the\noverall pattern of the shear field in terms of the defects generated by clustered halos, as\nshown in Figure 4. Moreover the density of the defects can yield information on the two\npoint correlation function of the gravitational potential if the fluctuations are assumed to be\nGaussian. In this case, the statistical properties of the shear field can be readily calculated\nfrom a simple field theory.\nTopological defects in the shear field provide a different view than direct measurements\nof shear correlations, which is the standard approach in lensing cosmology. Whether the\nstudy of defects can provide cosmological information is an open question. We have not\nstudied the robustness of defect identification or their statistical properties in the presence\nof measurement noise. This should be straightforward to carry out, at least with Gaussian\nnoise added to simulated shear fields.\nThe analytical results in Section IV rely on the statistics of a Gaussian random field. On\nsmall scales, the lensing shear has distinct non-Gaussian features, so the Gaussian description\nis valid only on large enough scales or alternatively from sources at very high redshift. It\nmay however be a suitable starting point for perturbative calculations of the effects of weak\nnon-Gaussianities associated with the onset of the non-linear gravitational dynamics regime.\nIn general, measurements from simulations can be used to test analytical results, to compare\n15\n\n\fwith data and to find signatures of non-Gaussian features in the defect statistics.\n\nAcknowledgments\n\nWe wish to thank M. Dennis, W. Irvine, M. Jarvis, M. Lima, T. Lubensky, and R. Sheth\nfor stimulating discussions. We are grateful to H. Stabenau for help with simulation data and\nseveral useful coversations. This work is partially funded by NSF grants AST-0607667 and\nDMR05-47230, the Research Corporation, and gifts from L.J. Bernstein and H.H. Coburn.\nVV acknowledges financial support from grant DOE-DE-FG02-05ER46199.\n\n[1] R. Narayan and. B. Bartelman. Lectures on gravitational lensing, in Proceedings of the\nJerusalem Winter School, (1995).\n[2] Y. Mellier, Annu. Rev. Astron. Astrophys. 37, 127 (1999).\n[3] H. Hoekstra and B. Jain, Annual Review of Nuclear and Particle Systems 58, 99 (2008).\n[4] W. T. M. Irvine, A. D. Hollingsworth, D. G. Grier and P. M. Chaikin, submitted.\n[5] A. Fernandez-Nieves, V. Vitelli, A. Utada, D. R. Link, D. R. Nelson and D. A. Weitz, Phys.\nRev. Lett. 99, 157801 (2007).\n[6] C. Santangelo, V. Vitelli, R. D. Kamien and D. R. Nelson, Phys. Rev. Lett. 99, 017801 (2007).\n[7] V. Vitelli and D. R. Nelson, Phys. Rev. E 70, 051105 (2004).\n[8] F. Flossmann, K. O'Holleran, M. R. Dennis and M. Padgett, Phys. Rev. Lett. 100, 203902\n(2008).\n[9] M. Bartelmann and P. Schneider, Phys. Rept. 340, 291(2001).\n[10] S. Dodelson, Modern Cosmology, (Academic Press, 2003).\n[11] D. R. Nelson, Defects and Geometry in Condensed Matter Physics, (Cambridge University\nPress, Cambridge, 2002).\n[12] R. D. Kamien, Rev. Mod. Phys. 74, 953 (2002).\n[13] D. Hilbert and S. Cohn-Vossen, Geometry and the Imagination, New York: Chelsea, (1952).\n[14] D. Huterer and T. Vachaspati, Phys. Rev. D 72, 043004 (2005).\n[15] P. Schneider, C. Kochanek, J. Wambsganss, and G. Meylan, Gravitational Lensing: Strong,\nWeak and Micro, (Springer, New York, 2006).\n\n16\n\n\f[16] R. K. Sheth and G. Tormen, MNRAS 329, 61 (2002).\n[17] A. Cooray and R. Sheth, Phys. Rep. 372, 1 (2002).\n[18] B. Jain, U. Seljak, S. D. M. White, Astrophys. J. 530, 547 (2000).\n[19] H. F. Stabenau and B. Jain, Phys. Rev. D 74, 084007 (2006).\n[20] M. V. Berry and J. H. Hannay, J. Phys. A: Math. Gen. 10, 11 (1977).\n[21] M. R. D. Dennis, J. Phys. A: Math. Gen. 36, 6611 (2003).\n[22] T. Vachaspati and A. Lue, Phys. Rev. D 67, 121302(R) (2003).\n[23] P. D. Naselsky and D. I. Novikov, Astrophys. J. 431, 507 (1998); A. Dolgov, A. Doroshkevich,\nD. I. Novikov, and I. D. Novikov, JETP Lett. 69, 427 (1999); A. Dolgov, A. Doroshkevich, D.\nNovikov, and I. Novikov, Int. J. Mod. Phys. D 8, 189 (1999).\n[24] W. Hu and M. White, New Astronomy 2, 223 (1997).\n\n17\n\n\f"}