{"id": "http://arxiv.org/abs/0907.1230v1", "guidislink": true, "updated": "2009-07-07T14:24:37Z", "updated_parsed": [2009, 7, 7, 14, 24, 37, 1, 188, 0], "published": "2009-07-07T14:24:37Z", "published_parsed": [2009, 7, 7, 14, 24, 37, 1, 188, 0], "title": "Inelastic neutron scattering studies of the quantum frustrated magnet\n  clinoatacamite, $γ$-Cu2(OD)3Cl, a proposed valence bond solid (VBS)", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0907.1424%2C0907.1724%2C0907.4489%2C0907.4259%2C0907.2317%2C0907.4742%2C0907.3095%2C0907.0905%2C0907.4769%2C0907.0686%2C0907.3200%2C0907.3088%2C0907.5591%2C0907.3527%2C0907.5341%2C0907.0929%2C0907.4828%2C0907.4996%2C0907.2732%2C0907.3617%2C0907.4748%2C0907.4886%2C0907.3585%2C0907.2349%2C0907.3653%2C0907.1230%2C0907.2393%2C0907.4842%2C0907.1363%2C0907.0887%2C0907.2377%2C0907.3242%2C0907.2456%2C0907.0427%2C0907.0219%2C0907.0819%2C0907.2899%2C0907.1159%2C0907.3251%2C0907.4894%2C0907.3867%2C0907.1967%2C0907.3032%2C0907.4056%2C0907.3738%2C0907.0494%2C0907.5365%2C0907.0821%2C0907.1790%2C0907.4218%2C0907.3921%2C0907.2421%2C0907.3741%2C0907.4055%2C0907.5096%2C0907.2057%2C0907.4359%2C0907.3910%2C0907.2629%2C0907.1228%2C0907.3968%2C0907.2685%2C0907.2268%2C0907.3194%2C0907.3124%2C0907.5574%2C0907.1256%2C0907.4467%2C0907.3156%2C0907.4123%2C0907.2425%2C0907.1584%2C0907.2337%2C0907.0837%2C0907.5358%2C0907.5323%2C0907.1137%2C0907.2680%2C0907.0431%2C0907.0564%2C0907.2163%2C0907.5396%2C0907.4896%2C0907.0003%2C0907.1510%2C0907.3757%2C0907.1130%2C0907.1165%2C0907.3330%2C0907.4964%2C0907.4431%2C0907.4855%2C0907.0768%2C0907.2760%2C0907.0282%2C0907.3317%2C0907.4008%2C0907.1888%2C0907.1750%2C0907.0043%2C0907.3491&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Inelastic neutron scattering studies of the quantum frustrated magnet\n  clinoatacamite, $γ$-Cu2(OD)3Cl, a proposed valence bond solid (VBS)"}, "summary": "The frustrated magnet clinoatacamite, $\\gamma$-Cu$_2$(OH)$_3$Cl, is\nattracting a lot of interest after suggestions that at low temperature it forms\nan exotic quantum state termed a Valence Bond Solid (VBS) made from dimerised\nCu$^{2+}$ ($S=1/2$) spins.\\cite{Lee_clinoatacamite} Key to the arguments\nsurrounding this proposal were suggestions that the kagom\\'e planes in the\nmagnetic pyrochlore lattice of clinoatacamite are only weakly coupled, causing\nthe system to behave as a quasi-2-dimensional magnet. This was reasoned from\nthe near 95$^\\circ$ angles made at the bridging oxygens that mediate exchange\nbetween the Cu ions that link the kagom\\'e planes.\n  Recent work pointed out that this exchange model is inappropriate for\n$\\gamma$-Cu$_2$(OH)$_3$Cl, where the oxygen is present as a\n$\\mu_3$-OH.\\cite{Wills_JPC} Further, it used symmetry calculations and neutron\npowder diffraction to show that the low temperature magnetic structure ($T<6$\nK) was canted and involved significant spin ordering on all the Cu$^{2+}$\nspins, which is incompatible with the interpretation of simultaneous VBS and\nN\\'eel ordering. Correspondingly, clinoatacamite is best considered a distorted\npyrochlore magnet. In this report we show detailed inelastic neutron scattering\nspectra and revisit the responses of this frustrated quantum magnet.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0907.1424%2C0907.1724%2C0907.4489%2C0907.4259%2C0907.2317%2C0907.4742%2C0907.3095%2C0907.0905%2C0907.4769%2C0907.0686%2C0907.3200%2C0907.3088%2C0907.5591%2C0907.3527%2C0907.5341%2C0907.0929%2C0907.4828%2C0907.4996%2C0907.2732%2C0907.3617%2C0907.4748%2C0907.4886%2C0907.3585%2C0907.2349%2C0907.3653%2C0907.1230%2C0907.2393%2C0907.4842%2C0907.1363%2C0907.0887%2C0907.2377%2C0907.3242%2C0907.2456%2C0907.0427%2C0907.0219%2C0907.0819%2C0907.2899%2C0907.1159%2C0907.3251%2C0907.4894%2C0907.3867%2C0907.1967%2C0907.3032%2C0907.4056%2C0907.3738%2C0907.0494%2C0907.5365%2C0907.0821%2C0907.1790%2C0907.4218%2C0907.3921%2C0907.2421%2C0907.3741%2C0907.4055%2C0907.5096%2C0907.2057%2C0907.4359%2C0907.3910%2C0907.2629%2C0907.1228%2C0907.3968%2C0907.2685%2C0907.2268%2C0907.3194%2C0907.3124%2C0907.5574%2C0907.1256%2C0907.4467%2C0907.3156%2C0907.4123%2C0907.2425%2C0907.1584%2C0907.2337%2C0907.0837%2C0907.5358%2C0907.5323%2C0907.1137%2C0907.2680%2C0907.0431%2C0907.0564%2C0907.2163%2C0907.5396%2C0907.4896%2C0907.0003%2C0907.1510%2C0907.3757%2C0907.1130%2C0907.1165%2C0907.3330%2C0907.4964%2C0907.4431%2C0907.4855%2C0907.0768%2C0907.2760%2C0907.0282%2C0907.3317%2C0907.4008%2C0907.1888%2C0907.1750%2C0907.0043%2C0907.3491&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "The frustrated magnet clinoatacamite, $\\gamma$-Cu$_2$(OH)$_3$Cl, is\nattracting a lot of interest after suggestions that at low temperature it forms\nan exotic quantum state termed a Valence Bond Solid (VBS) made from dimerised\nCu$^{2+}$ ($S=1/2$) spins.\\cite{Lee_clinoatacamite} Key to the arguments\nsurrounding this proposal were suggestions that the kagom\\'e planes in the\nmagnetic pyrochlore lattice of clinoatacamite are only weakly coupled, causing\nthe system to behave as a quasi-2-dimensional magnet. This was reasoned from\nthe near 95$^\\circ$ angles made at the bridging oxygens that mediate exchange\nbetween the Cu ions that link the kagom\\'e planes.\n  Recent work pointed out that this exchange model is inappropriate for\n$\\gamma$-Cu$_2$(OH)$_3$Cl, where the oxygen is present as a\n$\\mu_3$-OH.\\cite{Wills_JPC} Further, it used symmetry calculations and neutron\npowder diffraction to show that the low temperature magnetic structure ($T<6$\nK) was canted and involved significant spin ordering on all the Cu$^{2+}$\nspins, which is incompatible with the interpretation of simultaneous VBS and\nN\\'eel ordering. Correspondingly, clinoatacamite is best considered a distorted\npyrochlore magnet. In this report we show detailed inelastic neutron scattering\nspectra and revisit the responses of this frustrated quantum magnet."}, "authors": ["A. S. Wills", "T. G. Perring", "S. Raymond", "B. Fak", "J. -Y. Henry", "M. Telling"], "author_detail": {"name": "M. Telling"}, "author": "M. Telling", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1088/1742-6596/145/1/012056", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/0907.1230v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0907.1230v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "Proceedings of The International Conference on Highly Frustrated\n  Magnetism 2008 (HFM2008)", "arxiv_primary_category": {"term": "cond-mat.str-el", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cond-mat.str-el", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0907.1230v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0907.1230v1", "journal_reference": "J. Phys.: Conf. Ser. 145 (2009) 012056", "doi": "10.1088/1742-6596/145/1/012056", "fulltext": "arXiv:0907.1230v1 [cond-mat.str-el] 7 Jul 2009\n\nInelastic neutron scattering studies of the quantum\nfrustrated magnet clinoatacamite, γ-Cu2(OD)3Cl, a\nproposed valence bond solid (VBS)\nA. S. Wills1,2 , T. G. Perring3 , S. Raymond4 , B. Fåk4 , J.-Y. Henry4\nand M. Telling3\n1\n\nDepartment of Chemistry, University College London, 20 Gordon Street, London, WC1H\n0AJ, UK\n2\nThe London Centre for Nanotechnolgy, 17-19 Gordon Street, London WC1H 0AH, UK\n3\nISIS Facility, Rutherford Appleton Laboratory, Rutherford Laboratory, Chilton, Didcot,\nOX11 0QX, UK\n4\nCommissariat à l'Energie Atomique, INAC,SPSMS, 38054 Grenoble, France\nE-mail: a.s.wills@ucl.ac.uk\nAbstract.\nThe frustrated magnet clinoatacamite, γ-Cu2 (OH)3 Cl, is attracting a lot of interest after\nsuggestions that at low temperature it forms an exotic quantum state termed a Valence Bond\nSolid (VBS) made from dimerised Cu2+ (S = 12 ) spins.[12] Key to the arguments surrounding\nthis proposal were suggestions that the kagomé planes in the magnetic pyrochlore lattice of\nclinoatacamite are only weakly coupled, causing the system to behave as a quasi-2-dimensional\nmagnet. This was reasoned from the near 95◦ angles made at the bridging oxygens that mediate\nexchange between the Cu ions that link the kagomé planes.\nRecent work pointed out that this exchange model is inappropriate for γ-Cu2 (OH)3 Cl, where\nthe oxygen is present as a μ3 -OH.[11] Further, it used symmetry calculations and neutron\npowder diffraction to show that the low temperature magnetic structure (T < 6 K) was canted\nand involved significant spin ordering on all the Cu2+ spins, which is incompatible with the\ninterpretation of simultaneous VBS and Néel ordering. Correspondingly, clinoatacamite is best\nconsidered a distorted pyrochlore magnet. In this report we show detailed inelastic neutron\nscattering spectra and revisit the responses of this frustrated quantum magnet.\n\nFrustration in magnetic systems is an underlying theme that links together many of the\nproperties that are captivating modern condensed matter science. It creates degeneracies and\ndestabilises conventional order, allowing exotic effects to occur, such as spin ices,[1, 2] colossal\nmagneto-resistance,[3] topological spin glasses[4] and the anomalous Hall effect.[5] Despite the\nextensive theoretical studies made over the last two decades, little is known about the effects of\nfrustration in experimental systems in the S=1/2 quantum limit due to the rarity of useful model\nmaterials. In particular, model systems based on the pyrochlore lattice: a network of cornersharing tetrahedra that provides the framework upon which many frustrated 3-D magnets are\nbased.[6, 7]\nPrevious studies of clinoatacamite showed it to be frustrated with the strong exchange,\nθCW ≤ 180 K leading to ordering transitions at the suppressed temperatures of TC2 ∼ 6 K[8] and\nTC1 ∼ 18 K[9, 10]. The small amount of entropy released at both of these transitions is indicative\n\n\fof a ground state with extensive fluctuations. A canted and weakly ferromagnetic spin structure\nhas been observed below the sequential transitions at 6.1 and 5.8 K.[11] The details of the 18 K\ntransition are less clear. Recently, Lee et al. proposed that the elastic and inelastic neutron\nscattering spectra are compatible with the formation of a valence bond solid (VBS) at 18 K\nthat survives the formation of collinear magnetic order at ∼ 6 K.[12] This is hard to reconcile\nwith the ferromagnetism and canting observed in the low temperature magnetic structure[11]\nand the static components observed in the MuSR spectra.[10] The proposal of the VBS state\narose from arguments, now shown to be unfounded,[11] that the geometry of the superexchange\nleads to an effective decoupling of the 3-D distorted pyrochlore into separated kagomé planes,\nreminiscent of the responses seen in Li2 Mn2 O4 and the spinel series Lix Mn2 O4 .[14, 15]\nThe main details of the crystal structure of clinoatacamite were determined by Oswald and\nGuentier.[13] A complete description, including the positions of the deuteriums, are given in a\nrecent neutron powder diffraction study.[11] The crystal structure of clinoatacamite is distorted\naway from the rhombohedral symmetry of the parent atacamite structure due to the presence\nof a cooperative Jahn-Teller effect, and is described in the monoclinic space group P 1 21 n 1.\nUsing the notation in [11] the magnetic pyrochlore-like lattice is made up from chains of Cu1\nions that run parallel to the b-axis, and approximately perpendicular chains parallel to the\na-axis made from alternating Cu2 and Cu3. A key feature for the magnetic exchange is the\nbridging μ3 -hydroxide group. Defining the Cu– (μ3 -OH)–Cu bridging angle as φ, angles in the\nrange 91 < φ < 102◦ are found in clinoatacamite which will mediate a range of competing\nferromagnetic and antiferromagnetic interactions.\nInelastic neutron scattering experiments were performed using the thermal and cold energy\ntime-of-flight (TOF) spectrometers MARI and OSIRIS respectively at the ISIS Facility, and IN22\nof the ILL. 5g of fully deuterated γ-Cu2 (OD)3 Cl powder were prepared following the method\ndescribed in [11] and held in a cylindrical aluminium can in an annular configuration for the\nTOF instruments and a cylindrical can for triple axis spectrometer IN22.\nThe first feature to note is the diffuse response in the time-of-flight inelastic spectra centred\nat Q ∼ 1 Å−1 , E ∼ 7 meV (Figure 1). Its continued presence over the wide temperature\nrange 1.6 < T < 30 K and the close agreement of the energy with the mean field result\n< J >= 3θW /[2zS(S + 1)] ∼ −60 K ≈ 5.2 meV for a pyrochlore antiferromagnet with z = 6,\nshow it to be a fundamental response of this highly frustrated system and allows confirmation\nof the mean value of J. The reciprocal distance Q ∼ 1 Å−1 of this excitation corresponds to\ntwice the mean nearest neighbour Cu-Cu distances, 2 < rCu−Cu > 6.43 Å. Upon cooling to\nlow temperatures only a small change is seen in the form of the scattering that corresponds to\na broadening of the contribution towards low Q, signifying an increase in the spatial extension\nof these correlations in real space.\nThe observation of this diffuse excitation over such a wide range of temperature shows that\nit is a fundamental signature of the frustration in this quantum magnet. The insensitivity of\nboth the energy responses and spatial extents of the excitation to temperature indicate that this\nlow-temperature phase resembles the system above TC1 ∼ 18 K, and that the spins are therefore\nfluctuating rapidly in a spin liquid phase. The continued presence of this well-defined resonance\nbelow both TC1 and TC2 and the similarity between the responses at high and low temperatures\ndemonstrates that the excitation is of fundamental clusters of spins that are robust to the\nformation of the magnetic orderings associated with both of these transitions. Its presence in\nall the zero-field magnetic phases of γ-Cu2 (OD)3 Cl shows that both magnetic phase transitions\ninvolve incomplete ordering. Such a juxtaposition of components with different orderings is a\nparticular property of highly frustrated systems and occurs when subsets of the macroscopically\ndegenerate ground state remain robust to the formation of some partial ordering. In [12] this\nwas attributed this diffuse scattering to singlet-triplet excitations of the spin dimers in the VBS\nstate. Our data show that the broadness of the response and the lack of structure prevents its\n\n\fFigure 1. Inelastic neutron scattering spectra of clinoatacamite. (Left) The inelastic neutron\nscattering spectrum of γ-Cu2 (OD)3 Cl collected using the thermal time-of-flight spectrometer\nMARI shows the Q and ω-dependence of the diffuse excitation characteristic of the spin liquid\nphase centred at Q ∼ 1 Å−1 and E ∼ 7 meV (data collected with incident neutron energy\n40 meV) as a function of temperature (Figures a and b). Figure c shows the temperature\ndependence of χ′′ taken at (Q, E) = (1.2 Å−1 , 7 meV). Right) The Q and E dependence of\nthe low energy excitation spectrum measured using the cold neutron time-of-flight spectrometer\nOSIRIS. A nearly dispersionless band at E = 1.3meV appears below TC2 ∼ 6 K. b) The\nintegrated scattering between 0.2Å−1 ≤ Q ≤ 1.0Å−1 show how this mode grows out from the\nelastic line upon cooling. c) This characteristic excitation of the low temperature phase T < TC2\nwas isolated by subtraction of the data collected at 10K from that at 1.3K. A cut centred on\nE = 1.3 meV as a function of Q does not follow the squared magnetic form factor dependence\nexpected for free Cu2+ ions (dashed line), indicating that the excitation involves correlated\nCu2+ spins. The data shown in a) and b) were collected using the 002 reflection of the pyrolytic\ngraphite (PG) analysers and those shown in c) were collected using the 002 and 004 reflections\nas indicated. The analysed scattered neutron energies are 1.846 meV and 7.385 meV for the 002\nand 004 reflections respectively.\n\n\fform from being particularly characteristic of a single type of excitation and it is not possible\nto say anything conclusive about its origin without more detailed modelling.\nComparison of inelastic scattering data collected between 1.5 and 20 K using cold neutrons\nshows that while there is no change in the low energy (Q, E) spectra at TC1 ∼ 18 K, an\nexcitation at 1.3 meV grows out of diffuse elastic scattering upon cooling below TC2 ∼ 6 K.\nOur previous studies showed that this mode is a fundamental signature of the low temperature\nphysics of clinoatacamite as its energy corresponds to the gap used to fit the thermally activated\nspecific heat below 6 K.[8] At first glance the excitation appears to be both non-dispersive and\ngapped by an energy of ∆ ∼ 1.3 meV in agreement with our earlier report. Close examination,\nhowever, reveals that there is a weak dispersion within the excitation band that gives it a halfwidth of ∼ 0.1 meV. The Q dependence of the scattering integrated over the full band-width\nof the excitation shows that the excitations involve correlated spins as there is a deviation from\nthe form factor dependence characteristic of a free Cu2+ ion.\nThe small dispersion given the large < J > implies that the excitation cannot be described\nby standard spin wave theory in the limit of weak anisotropy and that such anisotropy needs to\nbe taken into account in future investigations. The well-defined nature and width of the band\nis remarkable given that the sample is a powder and raises the possibility that quantum effects\nare involved in the definition of a single sharp energy scale. The weak intraband dispersion\nis indicative of additional further neighbour magnetic interactions and can be used directly to\nestablish their energy scale as ∼ 0.1 meV. These findings, together with the deviation from the\nfree ion form factor, are generally at variance with the suggestion in [12] relating the 1.3 meV\nresponse to single-ionic excitations of uncoupled spins.\nIn conclusion we show using inelastic neutron scattering that despite the substantial distortion\nto its structure, the low temperature physics of γ-Cu2 (OD)3 Cl is dominated by the frustration\nassociated with the underlying pyrochlore lattice. There are two distinct excitation types in the\nsystem: high energy short-ranged excitations (7 meV) characteristic of the spin liquid phase\ncoexist at low temperature with well-defined low energy modes (1.3 meV).\nAcknowledgments\nASW would like to thank the Marie-Curie project of the EU, the Royal Society and EPSRC\n(grant number EP/C534654) for financial support and Steve Bramwell, Peter Holdsworth and\nPhilippe Mendels for discussions.\nReferences\n[1] Harris M J, Bramwell S T, McMorrow D F and Zeiske T 1997 Phys. Rev. Lett. 79 2554\n[2] Wills A S, Ballou R, Lacroix C 2002 Phys. Rev. B 66 14407\n[3] Parker D R, Green M A, Bramwell S T, Wills A S, Gardner J S and Neumann D A 2004 J. Am. Chem. Soc.\n126 2710\n[4] Wills A S 2001 Can. J. Phys. 79 1501\n[5] Yoshii S, Iikubo S, Kageyama T, Oda K, Kondo Y, Murata K and Sato M 2000 J. Phys. Soc. Jpn. 69 3777\n[6] Wills A S, Zhitomirsky M E, Canals B, Sanchez J P, Bonville P, de Reotier P D, Yaouanc A 2006 J. Phys.\nCondens. Mat. 18 L37\n[7] Poole A, Wills A S and Lelièvre-Berna E 2007 J. Phys. Condens. Mat. 19 452201\n[8] Wills A S, Raymond S, Henry J-Y 2004 Physica B, 272 850\n[9] Zheng X G, Kawae T, et al. 2005 Phys. Rev. B 71 052409\n[10] Zheng X G, Kubozono H, et al 2005 Phys. Rev. Lett. 95 057201\n[11] Wills A S, Henry J-Y, 2008 J. Phys. Condens. Mat., Awaiting Publication\n[12] Lee S-H , Kikuchi H, Qiu Y, Lake B, Huang Q., Habicht K and Kiefer K 2007 Nature Materials 6 853\n[13] Oswald H R and Guentier J R 1971 J. Appl. Cryst. 4 530\n[14] Wills A S, Raju N P, et al., 1999 Chem. Mater. 11,1936; Wiebe C R, Russo P L 2005 J. Phys. Condens.\nMat. 17 6469\n[15] Greedan J E, Weibe C R, Wills A S, and Stewart J R 2002 Phys. Rev. B 65 184424; Greedan J E , Raju N P\net al. 1998 Chem. Mater. 10 3058; Wills A S, Raju N P, and Greedan J E 1999 Chem. Mater. 11 1510\n\n\f"}