{"id": "http://arxiv.org/abs/1105.5575v1", "guidislink": true, "updated": "2011-05-27T14:45:38Z", "updated_parsed": [2011, 5, 27, 14, 45, 38, 4, 147, 0], "published": "2011-05-27T14:45:38Z", "published_parsed": [2011, 5, 27, 14, 45, 38, 4, 147, 0], "title": "Comprehensive online Atomic Database Management System (DBMS) with\n  Highly Qualified Computing Capabilities", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1105.5961%2C1105.5959%2C1105.6109%2C1105.5074%2C1105.0799%2C1105.0519%2C1105.3661%2C1105.5150%2C1105.2135%2C1105.0184%2C1105.1211%2C1105.3227%2C1105.0306%2C1105.1805%2C1105.0347%2C1105.1084%2C1105.3427%2C1105.3712%2C1105.0373%2C1105.6320%2C1105.2173%2C1105.5557%2C1105.1087%2C1105.5584%2C1105.2065%2C1105.0377%2C1105.1387%2C1105.2996%2C1105.1598%2C1105.5114%2C1105.0736%2C1105.2720%2C1105.1576%2C1105.6327%2C1105.6009%2C1105.3789%2C1105.5858%2C1105.4395%2C1105.2043%2C1105.2881%2C1105.4842%2C1105.5256%2C1105.2205%2C1105.5418%2C1105.1165%2C1105.3995%2C1105.3214%2C1105.2644%2C1105.2127%2C1105.6152%2C1105.0275%2C1105.4006%2C1105.1544%2C1105.2870%2C1105.2973%2C1105.2461%2C1105.5378%2C1105.5269%2C1105.5133%2C1105.4678%2C1105.3766%2C1105.5572%2C1105.4210%2C1105.2833%2C1105.4147%2C1105.6369%2C1105.4322%2C1105.3231%2C1105.4707%2C1105.5920%2C1105.4766%2C1105.0625%2C1105.2797%2C1105.4749%2C1105.5930%2C1105.1950%2C1105.4145%2C1105.0069%2C1105.2317%2C1105.1682%2C1105.2325%2C1105.3755%2C1105.2700%2C1105.3157%2C1105.2266%2C1105.1569%2C1105.0420%2C1105.2837%2C1105.5591%2C1105.0451%2C1105.5575%2C1105.3703%2C1105.1260%2C1105.2454%2C1105.3044%2C1105.2556%2C1105.0327%2C1105.3268%2C1105.3179%2C1105.6199%2C1105.0231&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Comprehensive online Atomic Database Management System (DBMS) with\n  Highly Qualified Computing Capabilities"}, "summary": "The intensive need of atomic data is expanding continuously in a wide variety\nof applications (e.g. fusion energy and astrophysics, laser-produced, plasma\nresearches, and plasma processing).This paper will introduce our ongoing\nresearch work to build a comprehensive, complete, up-to-date, user friendly and\nonline atomic Database Management System (DBMS) namely called AIMS by using\nSQLite (http://www.sqlite.org/about.html)(8). Programming language tools and\ntechniques will not be covered here. The system allows the generation of\nvarious atomic data based on professional online atomic calculators. The\nongoing work is a step forward to bring detailed atomic model accessible to a\nwide community of laboratory and astrophysical plasma diagnostics. AIMS is a\nprofessional worldwide tool for supporting several educational purposes and can\nbe considered as a complementary database of IAEA atomic databases. Moreover,\nit will be an exceptional strategy of incorporating the output data of several\natomic codes to external spectral models.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1105.5961%2C1105.5959%2C1105.6109%2C1105.5074%2C1105.0799%2C1105.0519%2C1105.3661%2C1105.5150%2C1105.2135%2C1105.0184%2C1105.1211%2C1105.3227%2C1105.0306%2C1105.1805%2C1105.0347%2C1105.1084%2C1105.3427%2C1105.3712%2C1105.0373%2C1105.6320%2C1105.2173%2C1105.5557%2C1105.1087%2C1105.5584%2C1105.2065%2C1105.0377%2C1105.1387%2C1105.2996%2C1105.1598%2C1105.5114%2C1105.0736%2C1105.2720%2C1105.1576%2C1105.6327%2C1105.6009%2C1105.3789%2C1105.5858%2C1105.4395%2C1105.2043%2C1105.2881%2C1105.4842%2C1105.5256%2C1105.2205%2C1105.5418%2C1105.1165%2C1105.3995%2C1105.3214%2C1105.2644%2C1105.2127%2C1105.6152%2C1105.0275%2C1105.4006%2C1105.1544%2C1105.2870%2C1105.2973%2C1105.2461%2C1105.5378%2C1105.5269%2C1105.5133%2C1105.4678%2C1105.3766%2C1105.5572%2C1105.4210%2C1105.2833%2C1105.4147%2C1105.6369%2C1105.4322%2C1105.3231%2C1105.4707%2C1105.5920%2C1105.4766%2C1105.0625%2C1105.2797%2C1105.4749%2C1105.5930%2C1105.1950%2C1105.4145%2C1105.0069%2C1105.2317%2C1105.1682%2C1105.2325%2C1105.3755%2C1105.2700%2C1105.3157%2C1105.2266%2C1105.1569%2C1105.0420%2C1105.2837%2C1105.5591%2C1105.0451%2C1105.5575%2C1105.3703%2C1105.1260%2C1105.2454%2C1105.3044%2C1105.2556%2C1105.0327%2C1105.3268%2C1105.3179%2C1105.6199%2C1105.0231&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "The intensive need of atomic data is expanding continuously in a wide variety\nof applications (e.g. fusion energy and astrophysics, laser-produced, plasma\nresearches, and plasma processing).This paper will introduce our ongoing\nresearch work to build a comprehensive, complete, up-to-date, user friendly and\nonline atomic Database Management System (DBMS) namely called AIMS by using\nSQLite (http://www.sqlite.org/about.html)(8). Programming language tools and\ntechniques will not be covered here. The system allows the generation of\nvarious atomic data based on professional online atomic calculators. The\nongoing work is a step forward to bring detailed atomic model accessible to a\nwide community of laboratory and astrophysical plasma diagnostics. AIMS is a\nprofessional worldwide tool for supporting several educational purposes and can\nbe considered as a complementary database of IAEA atomic databases. Moreover,\nit will be an exceptional strategy of incorporating the output data of several\natomic codes to external spectral models."}, "authors": ["Amani Tahat", "Wa'el Salah"], "author_detail": {"name": "Wa'el Salah"}, "author": "Wa'el Salah", "arxiv_comment": "20 pages,4 figures, 5 tables, 2 appendixes; International Journal of\n  Database Management Systems (IJDMS), Vol.3, No.2, May 2011", "links": [{"href": "http://arxiv.org/abs/1105.5575v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1105.5575v1", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "physics.atom-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "physics.atom-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "astro-ph.CO", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "astro-ph.IM", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "cs.DB", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1105.5575v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1105.5575v1", "journal_reference": null, "doi": null, "fulltext": "International Journal of Database Management Systems ( IJDMS ), Vol.3, No.2, May 2011\n\nComprehensive online Atomic Database\nManagement System (DBMS) with Highly\nQualified Computing Capabilities\nAmani Tahat and Wa'el Salah\nSynchrotron-light for Experimental Science and Application in the Middle East\n(SESAME), Allan 19252, Jordan\n\nCorresponding author: \"AIMS-Think Energy \", An International Company for Building &\nDeveloping Energy Management Information Systems, Amman, 11185 ,Jordan, email:\namanitahat@yahoo.com , amanitahat@ AIMS-Think Energy.org\nURL: http://www.aims-thinkenergy.org/\n\nKeywords: Atomic DBMS, SQLite, Pixe Spectra, Hydrogenic Model, Online Computing,\ninterelement fluorescence model, Atomic structure\n\nSecondary\n\nAbstract\nThe intensive need of atomic data is expanding continuously in a wide variety of applications (e.g, fusion\nenergy and astrophysics, laser-produced, plasma researches, and plasma processing).This paper will\nintroduce our ongoing research work to build a comprehensive, complete, up-to-date, user friendly and\nonline atomic Database Management System (DBMS) namely called AIMS by using SQLite\n(http://www.sqlite.org/about.html)(8). Programming language tools and techniques will not be covered\nhere. The system allows the generation of various atomic data based on professional online atomic\ncalculators. The ongoing work is a step forward to bring detailed atomic model accessible to a wide\ncommunity of laboratory and astrophysical plasma diagnostics. AIMS is a professional worldwide tool for\nsupporting several educational purposes and can be considered as a complementary database of IAEA\natomic databases. Moreover, it will be an exceptional strategy of incorporating the output data of several\natomic codes to external spectral models.\n\n1. Introduction\nThis document presents the initial design of our new atomic DBMS. We assume the reader is\nalready familiar with the objectives and architecture of the atomic databases environment. This\nsection presents an introduction of the concept and the need of atomic databases at present. The\nremainder of this document is organized as follows. Section 2 provides the objectives of this\nproject, besides describing related work and characterizing the difference between the current\nDOI: 10.5121/ijdms.2011.3201\n\n1\n\n\fInternational Journal of Database Management Systems ( IJDMS ), Vol.3, No.2, May 2011\n\nused atomic databases and AIMS. Section 3 then provides brief description of the online\ncomputing capabilities by means of screenshots, functionality as well as performing the validity\nof the developed calculations. The paper concludes with a summary and discussion of future\nwork in Section 4 and 5.\nNowadays both developing and developed countries are using nuclear based technologies in\nmany industrial applications. Atomic data are required for implementing these technologies. For\nexample, the design and safe operation of modern nuclear installations along with nuclear\ninstrumentation, is only possible on the basis of accurate calculations by using up-to-date nuclear\nconstants so called nuclear and atomic data to be its input. The amount of data needed for such\ncalculations, can be massive. For instance, it is well known that a collection of data for 130\nnuclides with more than 10 000 numbers in it must be used for the calculation of the physical\nbehavior of the core of a research reactor as well as its safe operation (http://wwwnds.iaea.org/broch.html).Also a set of data of about the same size is used for calculating the\nradioactive inventory buildup in the reactor and for developing an optimal waste management\nstrategy for the spent fuel of such a reactor. Even more detailed data are mandatory to design an\nup to date nuclear reactor for the purpose of electricity production and to make decisions on the\nfuel cycle for today and for the near future. The strict safety regulations must confirm this design\nand still remain cost effective. The requirements for the quality and accuracy of data for this\npurpose are very high and need evaluation to be verified and confirmed. On the other hand,\nradiation therapy of cancer patients is a common application of using nuclear technique in health\ncare. (Electrons, photons, neutrons along with charged particles) are some example of dissimilar\ntypes of nuclear radiations that used for this purpose. As a result, the matter of minimizing the\ndamage to the surrounding normal tissue is very important and deepens on the accurateness of the\ndose delivery at the specified location where it must be better than 5%. In order to determine the\ndose delivery with such precision, the comprehensive atomic, molecular and nuclear data are\nrequired. Someone may ask where I can get such data.\nAtomic data can be mainly produced from results of experimental measurements, and software\nfor atomic physics calculations. Laying down on the consideration of each, there are some\nobstacles. For example, there are several computer programs that can perform atomic\ncalculations. CIV3 [1], SUPER STRUCTURE [2], and the COWAN code [3]. HULLAC [4],\nATOM package [5] and the flexible atomic code FAC [6]. Some of these codes are expensive;\nbut most of them are open source and freely distributed for the developments purposes. Although\na wide range of codes are exclusive and have never been distributed beyond the producer lab.\nOn the other hand, consider NIST physics laboratory as a well known atomic database. Yuri\nRalchenko (2005) of NIST has kindly provided a description of the new NIST Atomic spectra\ndatabase which can be found at: http://www.nist.gov/physlab/index.cfm, it contains critically\nevaluated NIST data for radiative transitions in atomic species, (e.g; Version 3) contains data for\nthe observed transitions of 99 elements and energy levels of 57 elements ). Furthermore, it is an\nexcellent starting place for this kind of material, but the experimental data are not available for all\ntransitions and conditions. In some cases, the theoretical values are preferred to the experimental\nones by the NIST evaluators such as calculating the value of oscillator strength gf [7]. However,\nthe process of obtaining experimental data from atomic laboratory still exclusive to certain\ncountries without the other; because they are very expensive and track for political purposes. This\nunderlines the importance of developing the production process of theoretical atomic data and\n2\n\n\fInternational Journal of Database Management Systems ( IJDMS ), Vol.3, No.2, May 2011\n\npresents how important the subject of this research. Therefore the use of atomic software will be\nthe best way for producing atomic data.\nWe are doing this project in order to carry out the problems of atomic data recourses as users of\natomic data rather than of a producer of atomic data. We carry our responsibility to find the best\nways to get accurate, documented, and clear, up-to- date atomic data along with distributing it\nfreely worldwide for scientific research and peaceful purposes. Herby, our group believes that the\nOn-line implementation of an electronic database management system in the company of online\ncomputing capability will be an excellent atomic data resource. This contribution will show how\nthe tools of computer aided process engineering can be applied to the optimization of a laboratory\nmeasurement.\n\n2. The objectives of this project:\nCharacterizing the difference between the current used atomic databases and AIMS is based on\nour objectives and they are:\na)\n\nThe building of AIMS [9], the online Database Management System (DBMS) to facilitate\nthe process of executing queries, data entrance, data manipulation, in addition to sharing data\nworldwide and effectively contribute the establishment of the complementary atomic\ndatabase of the currently used atomic database ( e.g., IAEA databases[10] ((http://wwwamdis.iaea.org/). Appendix 3 presents more examples of related work.\n\nb) Providing an online competent large set of atomic, and X-ray technology computer programs\nfor generating atomic data. Those programs are proffitional, easy to use and freely\ndistributed. Users can download these programs after his online registration. these sets of\nprograms were created based on:\na) Some open source atomic codes [6] that are freely distributed and available on\nthe internet for the purpose of evaluation, testing, and development besides some\nwell know physicals formulas. Accordingly, a brief description about each\nprogram is presented in section two.\nb) The bulk of AIMS software package based on experimental results that have\nbeen conducted through a series of experiments in France laboratories and the\nSynchrotron-light for Experimental Science and Applications in the Middle\nEast as well. The results were confirmed and published in scientific journals to\nbe addressed as an outcome of continuous work since 2001 in references [1112].We will describe them in a separated paper.\nThe currently used atomic database (see appendix 3) are based on an overview of data contained\nin the database. Using other words, the majority of atomic like IAEA database provides access\nand search capability for critically evaluated data on some atomic quantities (e.g. energy levels,\nwavelengths, and transition probabilities that are reasonably up-to-date which is good) and they\nhave gateway to the set of atomic physics codes for providing solutions to any user willing\n3\n\n\fInternational Journal of Database Management Systems ( IJDMS ), Vol.3, No.2, May 2011\n\natomic data which can not be easily accessed on the web or which simply do not exist in the\ndatabase.\nFor example, the Code Centre Network (CCN) (http://www-amdis.iaea.org/CCN/services/)\nmakes available code capabilities (e.g. online computing and \"downloadable\" codes ) without\ncreating a database system based on the output generated data . However in AIMS, the DBMS\nwill automatically store the output tabulated data in the database. User can create his own profile\nand has his own (online or offline) database. Many services are available (e.g. edit, search, save,\nsave as, update, creating a query based on the input parameters, different output files extensions,\nretrieve data, reset input, online physics consulting ...etc). If this user is the system administrator\nthen gusts can only do search inside this database and they are not authorized to generate and/or\nstore data. This new DBMS supported both (online commuting and downloadable codes (offline)\n.In both cases, user can build his atomic database based on his generated data. This new atomic\nDBMS has been initially considered as qualified program to register for a software patent in\nJordan. More details will be covered in a series of papers after the patent has been issued and is\nbeing announced.\n\n3. Overview of the online computing capabilities:\nThis project is still under construction. Currently we are ready with two complete online\ncomputing programs: the Atomic Structure and Hydrogenic model. Figure 1 and 2 present the\nmain panel of atomic structure window and the Hydrogenic model in the HTML page,\nrespectively. Users can easily switch between them by using the general tab. User manuals are\navailable in two forms HTML and PDF that can be downloaded directly from the website.\n\nFigure 1: Screenshot of the main panel of atomic structure program which represents the input file.\n4\n\n\fInternational Journal of Database Management Systems ( IJDMS ), Vol.3, No.2, May 2011\n\nFigure 2: Screenshot of the main panel of Hydrogenic model which represents the input file.\n\n3.1 Atomic structure program :\nThis program computes tabulated atomic structure data, that can be easily interfaced with any\nother program such as (XSPEC) [13], the output files includes energy levels, oscillator strengths,\nradiative transition rates, mixing coefficients and reduced multipole matrix elements in addition\nto a variety of other atomic quantities .The computation process are based on the Configuration\nInteraction Method (CIM) adopted from the FAC code[6]. It combines the strengths of some\navailable and currently used codes with modifications to numerical methods. User needs to select\nthe option atomic structure from the standard tab, to start working under online dialog mode by\nfilling the input data and choosing the output quantity from the output menu to be calculated on\nclicking the calculate button in an easy and simple way; user doesn't need to go through the\ndetails and complications of the operating systems or the programming languages [14]. Table 2\npresents the validity of these calculations. Furthermore the online calculation provides an option\n(UTA) for improving atomic calculation of wavelengths, oscillator strengths by implementing\nthe so-called unresolved transition array (UTA) which has been identified in many soft X-ray\nsources as a convenient tool for their interpretation due to low resolution of the soft-X-ray spectra\nemitted by hot plasmas [15]. In 2001, Behar et al, calculated a complete set of atomic data for\nsuch modeling using the Hebrew University Lawrence Livermore Atomic Code (HULLAC) [16],\nand provided an abbreviated list of transition wavelengths, oscillator strengths, besides some\nother important atomic quantity. That complete data set has also been included in some\ncommonly used plasma modeling codes. For using this feature user needs to switch to the UTA\nmode marking the UTA box from option tab (see figure 1). New columns will be added to the\noutput tables to illustrate the UTA effect contains the UTA related transition data. Namely, the\ntransition energy including the UTA shift, the UTA Gaussian width, and the configuration\ninteraction multipler.\n5\n\n\fInternational Journal of Database Management Systems ( IJDMS ), Vol.3, No.2, May 2011\n\nNo\n\nConfiguration\n\nJ\n\n1\n\n1s21/22s21/2\n\n2\n\nΠ\n\nNIST\n\nAIMS\n\n0e\n\n0.0000\n\n0.0000\n\n1s21/2 2s1/22p 1/2\n\n0o\n\n21.0528\n\n21.2349\n\n3\n\n1s21/2 2s1/22p1/2\n\n1o\n\n21.3431\n\n21.5185\n\n4\n\n1s21/22s1/22p3/2\n\n2o\n\n21.9846\n\n22.1472\n\n5\n\n1s2 1/2 2s 1/2 2p3/2\n\n1o\n\n40.8750\n\n41.8458\n\n6\n\n1s21/2 2p21/2\n\n0e\n\n55.0081\n\n55.6194\n\n7\n\n1s21/2 2p1/22p3/2\n\n1e\n\n55.3582\n\n55.9604\n\n8\n\n1s21/22p23/2\n\n2e\n\n55.9125\n\n56.5043\n\n9\n\n1s21/22p1/22p3/2\n\n2e\n\n61.3971\n\n62.6257\n\n10\n\n1s21/22p23/2\n\n0e\n\n75.4764\n\n77.3522\n\n11\n\n1s1/22s21/22p1/2\n\n0o\n\n1816.7572\n\n12\n\n1s1/22s21/22p1/2\n\n1o\n\n1816.8417\n\n13\n\n1s1/22s21/22p3/2\n\n2o\n\n1817.6862\n\n14\n\n1s1/22s1/22p21/2\n\n1e\n\n1821.7062\n\n15\n\n1s1/22s1/22p1/22p3/2\n\n2e\n\n1822.0689\n\n16\n\n1s1/22s1/22p23/2\n\n3e\n\n1822.5149\n\nTable 2: Target levels of Si xi and their threshold energies (in eV). Portion of table is shown.\nComplete table will be available electronically in AIMS database. The present results\nreported\nhere\nagree with\nthe\nresults compiled\nin the NIST\ndatabase\n[http://www.nist.gov/physlab/data/asd.cfm]. Moreover experimental measurements are not\navailable for all conditions as shown in this table so that the theoretical measurements\nwill be more practice, active and reliable as mentioned in the introduction.\n\n3.2 Hydrogenic Ions model:\nThis online atomic code is planned to be a complete atomic package for calculating various\natomic data with an online user friendly interface. This part is mainly provides a hydrogen like\nions model by assuming only one electron in the system that has an effective charge state. The\n6\n\n\fInternational Journal of Database Management Systems ( IJDMS ), Vol.3, No.2, May 2011\n\ntheoretical methods used in this model are similar to those Hydrogenic functions of M. F. Gu\n[17,37] in addition to the functions of Ferland (1996) [18] and Seaton (1959)[19] for calculating\nthe radiative recombination of hydrogenic ions. The hydrogenic model handles mainly the\ntransition probabilities, transition rates, radiative recombination rates, photoionization cross\nsections, radiative recombination cross sections for the hydrogenic ions beside the calculating of\nthe two-photon decay rate of H-like and He-like transitions 2s1/2 ! 1s1/2 and 1s2sS0 ! 1s2S0. The\ncalculated data will be very useful for astrophysical and plasma's applications due to lack of such\ndata [6, 17, 20].\nHydrogenic Ions model user guide [21] presents more explanation (e.g., describing input files,\noutput files, clarifications of the parameters that must be defined by user in order to use this\nmodel online by providing some important screenshots of the main panels of this model , along\nwith providing the validity of it.\nAIMS provides a gate for obtaining more accurate results to get the best atomic data by\nimplementing additional formulas for calculating recombination rate coefficients and other\natomic quantities to allow comparing results. Data accuracy is recommended in extensively\nastrophysical applications. These formulas are:\n1. The (D. A. Verner & G. J. Ferland) 1996 formulas for H-like ions besides He-like, Li-like\nand Na-like ions over a broad range of temperature [22]. Theory and fitting parameters as\nwell\nas\nlimitations\nare\navailable\nto\npublic\nin\nthe\nweb\nsite\nhttp://www.pa.uky.edu/~verner/rec.html.\n2. Seaton (1959): For the hydrogenic species, Arnaud & Rothenflug (1985) recommended\nthis formula but it is not valid at high tempretures T> 106 Z2. See reference ( D. A.\nVerner and G. J. Ferland,1995).\n3. Power-law fits to the rates of radiative recombination. S. M. V. Aldrovandi & D.\nPequignot[23 ], J. M. Shull & M. Van Steenberg [24 ], M. Arnaud & R. Rothenflug [25\n].We create our c++ function to calculate the radiative recombination rates by using the\n\n(\n\n)\n\n−B\n\nAvailable with its fitting parameters\nfollowing fitting formula α r (T ) = A T / 10 4\nA and B , on ftp://gradj.pa.uky.edu//dima//rec//pl.txt .Table 3 presents a comparison\nbetween the current results and those from literate.AIMS shows a good agreements with\nthem.\n\nIon\n\nAIMS\n\nGould(1978)\nx 10\n\n- 12\n\n7.32 x 10\n\na\n\nOld fit\n\n-12\n\n5.5 x 10-12\n\nSi IV\n\n7.015029\n\nC IV\n\n8.202417 x 10 - 12\n\n8.45 x 10-12\n\n9.16 x 10-12\n\nMg II\n\n1.215735 x 10 - 12\n\n1.35 x 10-12\n\n8.8 x 10-13\n\nTable 3: Radiative recombination coefficients (in cm3 s-1), at T= 104K, a Arnaud & Rothenflug ( 1985) for\nC IV , Aldrovandi & Pequignot ( 1973) for Mg II and Si IV.\n\n7\n\n\fInternational Journal of Database Management Systems ( IJDMS ), Vol.3, No.2, May 2011\n\nTemperatur\ne\n\nRRRate coefficient\nCm3 s-1\nQuantum number = 1\n\n(k)\n\nRRRate\ncoefficient\nCm3 s-1\nQuantum number = 1\n\nRRRate\ncoefficient\nCm3 s-1\nQuantum number = 1\n\nD. A. Verner\n\nSeaton\n\n(Gu,2008)\n\n3\n3.5\n4\n4.5\n5\n5.5\n6\n6.5\n7\n7.5\n8\n8.5\n9\n9.5\n101\n102\n103\n104\n105\n106\n107\n108\n109\n\n-8\n\n2.4859 x10\n2.3013 x10-8\n2.1525 x10-8\n2.0293 x10-8\n1.9250 x10-8\n1.8352 x10-8\n1.7570 x10-8\n1.6879 x10-8\n1.6264 x10-8\n1.5711 x10-8\n1.5211 x10-8\n1.4755 x10-8\n1.4339 x10-8\n1.3955 x10-8\n1.3601 x10-8\n4.2406 x10-9\n1.1886 x10-9\n2.1225 x10-10\n1.9210 x10-11\n0.9453 x10-11\n1.1827 x10-12\n-0.0780x10-13\n-0.1580x10-14\n\n-8\n\n2.4027 x 10\n2.2215 x 10-8\n2.0754 x 10-8\n1.9544 x 10-8\n1.8521 x 10-8\n1.7641 x 10-8\n1.6873 x 10-8\n1.6196 x 10-8\n1.5593 x 10-8\n1.5051 x 10-8\n1.4561 x 10-8\n1.4114 x 10-8\n1.3706 x 10-8\n1.3330 x 10-8\n1.2983 x 10-8\n3.8814 x 10-9\n1.0847 x 10-9\n2.7956 x 10-10\n6.7295 x 10-11\n1.4993 x 10-11\n2.8404 x 10-12\n3.7748 x 10-13\n2.9238 x 10-14\n\n2.9974 x 10-8\n2.7505 x 10-8\n2.5530 x 10-8\n2.3904 x 10-8\n2.2537 x 10-8\n2.1367 x 10-8\n2.0352 x 10-8\n1.9460 x 10-8\n1.8668 x 10-8\n1.7960 x 10-8\n1.7322 x 10-8\n1.6743 x 10-8\n1.6214 x 10-8\n1.5730 x 10-8\n1.5283 x 10-8\n4.1479 x 10-9\n1.0957 x 10-9\n2.7870 x 10-10\n6.7021 x 10-11\n1.4742 x 10-11\n2.7752 x 10-12\n3.8534 x 10-13\n3.7306 x 10-14\n\nTable 4: present a comparison between the calculated values of the recombination rate (RRRate) coefficient\nof Ci XVII, by using three formulas Gu, Verner, Seaton.\n\n\u0001 Results annalysis :\nIt is extremely important; among other things to know with certainty the radiative recombination\ncoefficient rate. Detecting the accuracy is recommended in all energy, plasma, atomic researches\nas well as atmosphere studies .For example; researchers may need to calculate the rate of\n8\n\n\fInternational Journal of Database Management Systems ( IJDMS ), Vol.3, No.2, May 2011\n\nradiative recombination for some atoms along with ions of the upper atmosphere. In that case, our\nprogram provides three options to investigate the suitable value when computing accurate rate\ncoefficients for the radiative recombination. Simple expressions are also presented for their quick\nestimation far away from losing time when trying to compare the obtained results with other\nprograms results. In general, as shown in the figure (3) below all methods behave the same\nbehavior, as its producing results show the same behavior depending on the temperature rising or\ndeclining. More precisely, the selection mechanism of the value at a certain\ntemperature; extremely affects the results in a very large scale in terms of atmosphere studies\nlanguage.\n\nFigure 3 : RRRate coefficient versus tempreture ,by using Gu,Verner and Seaton\n\n3.3 Spectroscopy:\nThis part is a very important part of the created database. Because the convenient access and the\neffective use of atomic physics data have long been goals of X-ray spectroscopy researches.\nAdditionally, the very considerable advances in computing technology now allow the use of\nextensive radiative models. Unfortunately, the goal of convenient access and effective use of\natomic data remains hard to pin down. Although the propagation of computing capabilities has\nmade it progressively easier to carry out large-scale atomic rate calculations, these advances have\nbeen offset by difficulties in managing and evaluating the data. For the purposes of\nunderstanding, it is important that the data which goes into the model atoms could be readily\nexamined, compared and manipulated. We are undertaking to develop a set of computational\ncapabilities which will facilitate the access, manipulation, and understanding of atomic data in\ncalculations of x-ray spectral modeling to be worked online from AIMS website. In this present\nlimited description we will emphasize the objectives for this part of the whole project, the design\nphilosophy, and aspects of the atomic database. A complete description of this work is avai1able\nin [26].\n9\n\n\fInternational Journal of Database Management Systems ( IJDMS ), Vol.3, No.2, May 2011\n\nOriginally, spectroscopy is the study of the interaction between radiation and matter as a function\nof wavelength (λ). Common types of it are Absorption and Fluorescence. X-ray spectroscopy can\nbe considered as a gathering name for several spectroscopic tools that are usually used for\ndetermining the electronic structure of materials by using x-ray excitation. Interaction between\naccelerated charged particles and matter leads to the emission of characteristic x-rays. X-Ray\nFluorescence, which is also known as Secondary interelement. Fluorescence occurs where the\nsecondary X-rays emitted by a heavier element are sufficiently energetic to stimulate additional\nsecondary emission from a lighter element. This phenomenon can also be modeled, and\ncorrections can be made providing that the full matrix composition can be deduced. It is also\npossible to create a characteristic secondary X-ray emission using other incident radiation to\nexcite the sample: 1) electron beam: electron microprobe or Castaing microprobe, 2) ion beam:\nparticle induced X-ray emission (PIXE), where particle-induced X-ray emission (PIXE) is a well\nknown analytical tools for the determination of elemental concentrations of various types of\nsamples of biological, geological, archaeological or environmental nature. On the other hand,\nsecondary X-ray Fluorescence (XRF) and Synchrotron Radiation are very important related\ntopics when it comes to utilize the x-rays that produced by using Electron Probe Microanalysis\n(EPMA) for many research applications. In particular:\n•\n\n•\n\n•\n\nXRF (X-Ray Fluorescence), where x-rays from (a sealed tube) are used to produce xrays by secondary fluorescence in samples of interest. Usually it will be a macrotechnique.\nSynchrotron Radiation, where electrons are accelerated in ~10s-100s meters diameter\nrings, and then made to produce highly focused beams of extremely intense x-rays or\nlight, which will then fed into many different types of experiments.\nThe benefits of secondary x-ray fluorescence include very low detection limits (10s of\nppm easy in 10 seconds, no backgrounds)\n\nIn this part of AIMS we designed, wrote and examined several PIXE spectra in a utility program\nnamely called WPASS-2[26, 27, and 28] based on the existing PIXE analysis software package\nPIXAN [29] with new features that consider the secondary interelement fluorescence in order to\nimprove the basic capabilities and accuracy of PIXAN. Development of such programs handles a\nfew computer codes, is quite meaningful.\nSeries of papers have been published by the authors to evaluate the academic values of this\nprogram as well as describing the PIXE method that used for the analysis of PIXE spectra [28,\n27]. Moreover, in order to handle the matter of secondary interelement fluorescence of PIXE..etc,\nwe create a model namely called integrals [30] for presenting an exact but computationally\ntreatment of Quantitative X-ray fluorescence analysis using the fundamental parameter method of\nsparks (1975) [31], where physical parameters such as photoelectric cross-sections, total mass\nattenuation cross-sections, fluorescence yields, X-ray branching ratio, detector efficiency\n(calculated theoretically) are given as inputs. The program then theoretically generates\nfluorescent X-rays and mainly calculate Secondary enhancement (intensity).\nFluorescent intensity as well as that excited by the incident radiation may be excited by the\nfluorescence from other elements in the sample .For example , in Ni-fe alloys the Ni K radiation\nis of sufficient energy to excite Fe K radiation giving an additional intensity of Fe K radiation\n, ∆I FeK , over that calculated equation 17 ,see figure 4. Ignoring these enhancement effects would\n10\n\n\fInternational Journal of Database Management Systems ( IJDMS ), Vol.3, No.2, May 2011\n\nlimit the application of x-ray florescence to bulk samples comprising a few elements widely\nseparated in atomic number, to samples composed only of trace elements and to very thin samples\nsuch as air filters where enhancement effects are negligible because of specimen thinness.\n\nFigure 4 : Equation 17 adapted from sparks(1975)[34].\nOur model employs the fundamental parameter method for quantitative analysis by iteration via\ntwo easy to use interfaces (customize and general) by choosing the specified interface depended\non the available parameters (see appendix 3 and the manual [26]). The model is described for\nquantitative energy dispersive X-ray fluorescence analysis. We compare the present results with\n(sparks, 1975) results to show the validity of our model, since this work provides a computational\nsolution for the same method of sparks.\nGiven in appendix 1 are necessary parameters and results of a calculation using equation 17 for\nthe secondary enhancement of FeK α radiation resulting from Nikα and NiK β radiation in\n\nNi − Fe alloys excited by M o kα radiation .The comparison of our results and those of sparks is\npresented in table 5,and it is based on the information from both (appendix1 and appendix 2) .\n\n11\n\n\fInternational Journal of Database Management Systems ( IJDMS ), Vol.3, No.2, May 2011\n\nSecondary enhancement by\n\nSecondary enhancement\nby\n\nTotal\nNikα + K β\n\nNikα\nNiK β\n\n(∆I / I )FeKα , NiKα\nSPARKS\n\nAIMS\n\n0.019\n\n(∆I / I )FeK , NiK\nα\n\n(∆I / I )FeK\nβ\n\nα\n\n, NiK\n\nSPARKS\n\nAIMS\n\nSPARKS\n\nAIMS\n\n0.049\n\n0.002\n\n0.032\n\n0.021\n\n0.051\n\n0.039\n\n0.069\n\n0.009\n\n0.039\n\n0.044\n\n0.074\n\n0.085\n\n0.115\n\n0.011\n\n0.041\n\n0.096\n\n0.126\n\n0.140\n\n0.170\n\n0.018\n\n0.048\n\n0.158\n\n0.188\n\n0.206\n\n0.236\n\n0.027\n\n0.057\n\n0.232\n\n0.262\n\n0.288\n\n0.318\n\n0.037\n\n0.067\n\n0.325\n\n0.355\n\n0.393\n\n0.423\n\n0.050\n\n0.080\n\n0.443\n\n0.473\n\n0.531\n\n0.561\n\n0.068\n\n0.098\n\n0.599\n\n0.629\n\n0.723\n\n0.753\n\n0.091\n\n0.121\n\n0.815\n\n0.845\n\n1.008\n\n1.038\n\n0.126\n\n0.156\n\n1.134\n\n1.164\n\nTable (5): The comparison of our finding and those of sparks, 1975 (fundamental method).\n\n\u0002 Comparison analysis:\nThe shortcomings of reliability coefficients in most statistical studies suggest that a more useful\nmeasure of test reliability is to be found in the standard error of measurement SEM (See, for\nexample, Norcini, 2000) [32] test performance .Furthermore, The standard error of measurement\n(SEM) is an estimate of error to be used in interpreting an individual's test score where the test\nscore is an estimate of a person's \"true\" by using a reliability coefficient and the test's standard\ndeviation. The (SEM) is helpful for quantifying the margin of error that occurs on every test.\nHereby, the current comparison analysis attempt to calculate SEM based on \"the Standard Error\nof Measurement module \"that has been produced by (Harvill (1991) [33] including the theory of\nmental tests of Gulliksen (1950) [34] as discussed in Harvill (1991). However, the data in\n12\n\n\fInternational Journal of Database Management Systems ( IJDMS ), Vol.3, No.2, May 2011\n\nAppendix 2 are real performance data and has been generated by using: 1) generated data of\nSparks's fundamental parameters; 2) generated data of AIMS.\nBased on the foregoing; we can read the following from appendix 2.\n1. The table has two columns give the total enhancement of FeK α intensity caused by both\nthe\n\nNikα\n\nand\n\nNiK β\n\nradiations from both Sparks and AIMS.\n\n2. Two sample sizes =10 (each sample consists of 10scores).\n3. Reliability indicates the degree to test scores to which they are free of errors of\nmeasurement. Sparks score and AIMS score variances are equal, then the test reliability\nequals the highest possible value (r =1), this leads to (SEM) value equals Zero (SEM=0).\nOur finding means that test is perfectly reliable, scores are consistent, dependable,\nrepeatable, that is, no errors of measurements with perfectly reliable test ,a set of errors\nall equal to zero has no variability .\n\n4. Standard deviation values of both (sparks and AIMS) tests are equaled and have the\nvalue of δ = 0.34725 , but the mean of sparks scores is greater than the mean of\nAIMS scores they are (0.3867 and0.4167 )respectively .Furthermore , The mean\ndescribes what is being measured, while the standard deviation represents noise and other\ninterference. In these cases, the standard deviation is not important in itself, but only in\ncomparison to the mean. In some situations, two other terms need to be mentioned: 1)\nsignal-to-noise ratio (SNR), which is equal to the mean divided by the standard deviation,\n2) the coefficient of variation (CV). This is defined as the standard deviation divided by\nthe mean, multiplied by 100 percent. Better data means a higher value for the SNR and a\nlower value for the CV. Implementing this issue to our calculation we can read the\nfollowing:\nIndex\n\nSparks\n\nAIMS\n\nStandard\ndeviation\n\n0.34725\n\n0.34725\n\nMean\n\n0.3867\n\n0.4167\n\nSNR\n\n1.1\n\n1.2\n\nCV\n\n0.89%\n\n0.83%\n\nGenerally , SNR'S and CV'S values are very close to each other this indicate that both sparks\nand AIMS tests have a better and performance data where each of them has a higher value for\nthe SNR and a lower value for the CV. After all, using AIMS will be a good strategy for\nreexamining SPARK's measured values easily with a very short time. The following two\nexamples can explain the idea:\n13\n\n\fInternational Journal of Database Management Systems ( IJDMS ), Vol.3, No.2, May 2011\n\n1) For instance, comparing appendix 2 with appendix 1 ,user need to use the customer\ninterface of this model to compose his input file by fitting the entire fundamental\nparameters and setting them to those of sparks from the main panel of model,see\nappendix 3.In the main time user can avoid details and use the general interface that has\n7 parameters each of them consist of a set of some other parameters like the\nangles(ψ 1 ,ψ 2 ),\n\nC Ni C Fe μ ρ\n,\n,\n, ...etc,\n\n2) Calculating the secondary enhancement correction as a function of the angles\n(ψ 1 ,ψ 2 ),shows the dependence to become significant when the enhancement is large\nsee appendix 1.In AIMS any arbitrary input can proof this property and others by\nfurthermore ,in such cases AIMS has two limitations\nWhen h→ 0 ⇒ S→ 0; where S is the intensity\nWhen h→ ∞ ⇒ S→ A6 K, These two conditions has been applied perfectly with what\nhas been explained in the theory of Spark. Finally Sparks measurements has been evaluated and\ntested by based on (Shiraiwa and Fujino, 1966) [35] by using the same factors with equation 17\nand presents a good agreement with a results published by (Muller). Consequently, this can\nimprove the validity of using AIMS as well as raise its accuracy.\n\n4. Future work:\nWe are working on adding a program for x-ray microprobe imaging and allow it to be worked\nonline, besides adding the following atomic programs:\n1. colliosonal ionaization model\n2. Collision Strength Measurement for Electron-Impact Excitation model\n3. Radiative recombination and photoionization model .\n\n5. Summary and Conclusion\nWe have successfully proposed and designed an online database management system namely\ncalled AIMS, with current and anticipated communication needs in mind. By using fully scalable\narchitecture optimized for speed and accuracy that manages and support efficient access to very\nlarge amount of data and support concurrent access to online computing models. Thus provide\nfull service web-based solutions. Following are some of our most requested online services:\n•\n•\n\n•\n•\n\nDynamic Website Design\nCustom programming contains several computer models for producing atomic data based\non the most reliable atomic theories besides some experimental models .user can use\nthem online or download them freely on his personal computer.\nDatabase creation and integration(Expandability ),Data Collection(Data Entry, Batch\nControls, file enhancements, file verification),Output: Queries and Profiles\nInternet atomic physics online consulting\n\n14\n\n\fInternational Journal of Database Management Systems ( IJDMS ), Vol.3, No.2, May 2011\n\nAs atomic research grows, demands on atomic database will be greater. Physicists need to make\nsure that the data going into the on-line database are clean and accurate. They want to make sure\nthe product has the functionality they are looking for now and in the future. They want to make\nsure that our data are safe. For this reason, we developed a series of computational models which\nwere convincing to physicists and could quantify the performance advantages of using database\nand object management technologies. These models are :Atomic structure program ,Hydrogenic\nmodel, spectroscopy model including wpass program and Several models based on our\nexperimental result .Also we have described and verified the validity of our system by\ncomparing the analysis of atomic physics data using a AIMS with NIST , Sparks ,Seaton and D.\nA. Verner as well as ming fing Gu data. Our results show a good agreements with literature data\n,for instance ,when finding the standard error of measurement (SEM) for the spectroscopy model\n,Sparks score and AIMS score variances were equaled , and test reliability equaled the highest\npossible value (r =1), with (SEM) equals Zero (SEM=0).thus means that our test result are\nperfectly reliable, scores are consistent, dependable, repeatable, that is, no errors of measurements\nonce we have got the perfectly reliable test .\nWith the proofing -of-our concept system, we demonstrated that analysis of atomic physics data\ncould be completed about an order of magnitude faster than with existing production codes where\nmost of them are expensive and exclusive to their producers .Furthermore, AIMS_DBMS can be\nconsidered as a complementary database of the currently used atomic database such as the IAEA\ndatabases as well as working as a professional worldwide tool for supporting several educational\npurposes. Finally AIMS package is freely distributed online from its official website and still\nunder construction. Many publications about the AIMS theoretical background and programming\nlanguages have been published and mentioned as references during the bulk of the research.\nThis project was an initiative of us purely for scientific purposes and we continue the\ndevelopment and presentation of information for free, but given the importance of the subject\nmatter, and the world urgent need for such a project, we make a public call for all interested to\nexpand this work by supporting us with scientific participations.\n\nReferences:\n1.\n\nA. Hibbert , 1975, CIV3 - a general program to calculate configuration interaction wave functions\nand electric-dipole oscillator strengths, (C.P.C. 9(1975)141).\nhttp://www.cpc.cs.qub.ac.uk/summaries/AAKM_v1_0.html\n\n2.\n\nW. Eissner,1991 SUPERSTRUCTURE - AN ATOMIC STRUCTURE CODE, J. Phys. IV France\n01 (1991) C1-3-C1-13\nhttp://hal.archives-ouvertes.fr/jpa-00249739/en/\n\n3.\n\nR.D.Cowan, Theory of Atomic Structure and Spectra (University of California Press, Berkeley,\n1981).\n\n4.\n\nBar-Shalom A.; Klapisch M. Oreg , HULLAC, an integrated computer package for atomic\nprocesses in plasmas, Journal of Quantitative Spectroscopy and Radiative Transfer, Volume\n71, Number\n2,\n15\nOctober\n2001\n,\npp.\n169-188(20).\nhttp://www.ingentaconnect.com/content/els/00224073/2001/00000071/00000002/art00066\n\n15\n\n\fInternational Journal of Database Management Systems ( IJDMS ), Vol.3, No.2, May 2011\n\n5.\n\nM.Y.Amusia and L.V.Chernysheva,Computation of Atomic Prosses: A Handbook For ATOM\nprograms ( Institue of physics publishing ,Bristol,1997).\n\n6.\n\nGu, M.F. (2008). Review / Synthese. The flexible atomic code, Canadian Journal of\nPhysics.Vol.86. Pages 675-689.\n\n7.\n\nS.J. Adelman,2005, On Atomic Physics Data for Stellar Atmospheres Research, Mem. S.A.It.\nSuppl. Vol. 8, 103\n\n8.\n\nhttp://www.sqlite.org/about.html\n\n9.\n\nAmani Tahat and Wa'el Salah,AIMS:Online atomic and nuclear database management system\n,ISBN,3711/9/2010, National Library Of Jordan.\n\n10. http://www-amdis.iaea.org/\n\ng\n\n11. W. Salah ,Experimental Measurements of the Landé J Factor of Some Levels in Argon Atom\nSituated Near the First Limit of Ionization, Nucl. Inst. & meth. B, 196 (2002) 25.\n12. W. Salah.L-Shell Fluorescence Cross-Sections and relative intensities for La, Pr, Nd, Sm, Eu, Gd,\nTb, Dy, Ho, Tm, Yb, and Lu at 16.9 keV'' Eur. Phys. J. AP.,19 ( 2002 ) 69.\n13. Arnaud, K.A., 1996, Astronomical Data Analysis Software and Systems V, eds. Jacoby G. and\nBarnes J., p17, ASP Conf. Series volume 101.\nhttp://heasarc.gsfc.nasa.gov/docs/xanadu/xspec/\n14. Wa'el Salah and Amani Tahat, Improved Atomic Structure Program,ISBN,3713/9/2010,National\nLibrary Of Jordan.\n15. J Bauche et al, 1988. Unresolved transition arrays,Phys. Scr. 37 659\n16. Bar-Shalom, A., Klapisch, M., & Oreg, J. 2001, HULLAC, an integrated computer package for\natomic processes in plasmas ,J. Quant. Spectrosc. Radiat. Transfer, 71, 169\n17.\n\nM. F. Gu , FAC 1.1.0 Manual,2003\n\n18. Ferland, G. J. 1996, HAZY, a Brief Introduction to CLOUDY, Univ. Kentucky Dept. Phys.\nAstron. Internal Report, 565 pages\n19. Seaton, M. J. 1959, Radiative recombination of hydrogenic ions ,MNRAS, 119, 81\n20. M. F. Gu, Radiative Recombination Rate Coefficients for Bare through F-like Isosequences of\nMg, Si, S, Ar, Ca, Fe, and Ni, The Astrophysical Journal, 589:1085-1088, 2003 June 1.\n21. Hydrogenic ions model User Guide, ISBN, 3714/9/2010, International Library Of Jordan.\n22. D. A. Verner & G. J. Ferland, 1996, Atomic data for astrophysics. I. Radiative recombination rates\nfor H-like, He-like, Li-like and Na-like ions over a broad range of temperature., ApJS, 103, 467.\n23. S. M. V. Aldrovandi & D. Pequignot (1973, A&A, 25, 137),\n16\n\n\fInternational Journal of Database Management Systems ( IJDMS ), Vol.3, No.2, May 2011\n\n24. J. M. Shull & M. Van Steenberg (1982, ApJS, 48, 95),\n25. M. Arnaud & R. Rothenflug (1985, A&AS, 60, 425\n26. Wpass2: Improved Spectroscopy user guide,ISBN,3715/9/2010.National Library Of Jordan.\n27. A. Tahat, W. Salah, and a. B. Hallak, (2010), PASS(Pixe Analysis Shell Software):'A computer\nutility program for the evaluation of PIXE spectra.Iternational journal of pixe. Volume: 20, Issues:\n3-4(2010) pp. 63-76 DOI: 10.1142/S0129083510001987.\nhttp://www.worldscinet.com/ijpixe/20/2003n04/S0129083510001987.html\n28. Amani Tahat, Wa'el salah , PASS (PIXE ANALYSIS SHELL SOFTWARE) manual, ISBN\n2009/3/876, national library of Jordan.\n29. E. Clayton et. al., A discussion of PIXAN and PIXANPC: The AAEC PIXE analysis computer\npackages, Nucl. Instr. and Meth. B, 22 (1-3), (1987) 64-67\n30. Wa'el Salah &Amani Tahat, Secondary interelement florescence,ISBN,3710/9/2010,\nNational Library Of Jordan\n31. C. J. Sparks, Quantitative X-ray fluorescent analysis using fundamental parameters, Advances in\nX-Ray analysis, Vol. 19, Ed. Plenum Press, 1975\n32. Norcini JJ,. The validity of long cases. Med Educ 2001; 35: 735–736\n33. Harvill, L. M. (1991), Standard Error of Measurement. Educational Measurement: Issues and\nPractice, 10: 33–41. doi: 10.1111/j.1745-3992.1991.tb00195.x\n34. Gulliksen ,H,1950,Theory of mental tests .New York,John Wiley and sons.\n35. Toshio Shiraiwa and Nobukatsu Fujino, 1966, Theoretical Calculation of Fluorescent X-Ray\nIntensities of Nickel-Iron-Chromium Ternary Alloys, Jpn J appi Phys 5, 886\n36. W. Salah, , M. S. Del-Rio, H.Hoorani ,Ray Tracing Flux Calculation for the Small and Wide angle\nX-Ray Diffraction (SAXS/WAXS) Station at the SESAME Synchrotron Radiation Facility,Rev.\nSci. Instrum. 80(9) (2009) 095106\n37. Amani Naser Tahat, Mofleh Tahat, Wa'el Salah, 2011. Python GUI Scripting Interface for\nRunning Atomic Physics Applications, The Python paper source codes, 3(2).\nhttp://ojs.pythonpapers.org/index.php/tppsc/article/view/169\n\n17\n\n\fInternational Journal of Database Management Systems ( IJDMS ), Vol.3, No.2, May 2011\n\nAppendix 1\n\n18\n\n\fInternational Journal of Database Management Systems ( IJDMS ), Vol.3, No.2, May 2011\n\nAppendix2\n\n19\n\n\fInternational Journal of Database Management Systems ( IJDMS ), Vol.3, No.2, May 2011\n\nAppendix 3\nName\n\nWebsite\n\nThe NIST Atomic Spectra Database\n\nhttp://www.nist.gov/pml/data/asd.cfm\n\nNIFS Database\n\nhttp://dbshino.nifs.ac.jp/\n\nAtomic & Molecular Numerical\nDatabases\n\nLAMDA\n\nhttp://www.strw.leidenuniv.nl/~moldata/\n\nLeiden atomic and molecular\nDatabase\n\nCHIANTI\n\nhttp://www.chianti.rl.ac.uk/\n\nAn Atomic Database for\nSpectroscopic Diagnostics of\nAstrophysical Plasmas\n\nALADDIN Database\n\nhttp://www-amdis.iaea.org/ALADDIN/\n\nElectron Collisions\nHeavy Particle Collisions\nAMBDAS\nAtomic and Molecular\nBibliographic Data System\n\nhttp://www-amdis.iaea.org/AMBDAS/\n\nAtomic Database\n\nhttp://www.camdb.ac.cn/e/\n\nAtomic & Molecular Database\n\n20\n\n\f"}