{"id": "http://arxiv.org/abs/1005.0245v1", "guidislink": true, "updated": "2010-05-03T09:56:42Z", "updated_parsed": [2010, 5, 3, 9, 56, 42, 0, 123, 0], "published": "2010-05-03T09:56:42Z", "published_parsed": [2010, 5, 3, 9, 56, 42, 0, 123, 0], "title": "ΔY/ ΔZ from the analysis of local K dwarfs", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1005.0077%2C1005.0579%2C1005.5635%2C1005.2700%2C1005.3931%2C1005.2819%2C1005.2959%2C1005.4796%2C1005.4729%2C1005.4509%2C1005.0283%2C1005.1428%2C1005.2971%2C1005.2680%2C1005.1819%2C1005.3669%2C1005.4084%2C1005.3461%2C1005.0263%2C1005.0158%2C1005.3281%2C1005.1421%2C1005.4852%2C1005.1849%2C1005.3596%2C1005.4100%2C1005.5319%2C1005.5216%2C1005.3246%2C1005.1277%2C1005.2993%2C1005.4058%2C1005.3707%2C1005.1978%2C1005.4083%2C1005.2751%2C1005.0641%2C1005.3156%2C1005.5099%2C1005.0429%2C1005.3880%2C1005.4412%2C1005.4045%2C1005.1892%2C1005.3305%2C1005.3604%2C1005.4326%2C1005.3023%2C1005.0215%2C1005.1418%2C1005.0751%2C1005.0209%2C1005.3646%2C1005.5115%2C1005.2455%2C1005.5466%2C1005.5202%2C1005.1551%2C1005.1884%2C1005.5293%2C1005.0306%2C1005.3663%2C1005.0879%2C1005.3888%2C1005.3766%2C1005.1530%2C1005.1807%2C1005.2879%2C1005.0245%2C1005.2328%2C1005.0725%2C1005.5591%2C1005.3036%2C1005.5610%2C1005.4541%2C1005.0610%2C1005.0704%2C1005.5279%2C1005.1586%2C1005.2646%2C1005.4844%2C1005.2386%2C1005.2299%2C1005.3718%2C1005.3215%2C1005.5133%2C1005.5493%2C1005.4135%2C1005.2416%2C1005.0423%2C1005.5659%2C1005.0956%2C1005.3260%2C1005.1630%2C1005.5262%2C1005.3235%2C1005.5121%2C1005.1947%2C1005.1340%2C1005.1264%2C1005.3982&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "ΔY/ ΔZ from the analysis of local K dwarfs"}, "summary": "The stellar helium-to-metal enrichment ratio, \\Delta Y/\\Delta Z, is a widely\nstudied astrophysical quantity. However, its value is still not precisely\nconstrained. This paper is focused on the study of the main sources of\nuncertainty which affect the \\Delta Y/\\Delta Z derived from the analysis of the\nlow-main sequence (MS) stars in the solar neighborhood. The possibility to\ninfer the value of \\Delta Y/\\Delta Z from the study of low-MS stars relies on\nthe dependence of the stellar luminosity and effective temperature on the\ninitial Y and Z. The \\Delta Y/\\Delta Z ratio is obtained by comparing the\nmagnitude difference between the observed stars and a reference theoretical\nzero age main sequence (ZAMS) with the related theoretical magnitude\ndifferences computed from a new set of stellar models with up-to-date input\nphysics and a fine grid of chemical compositions. A Monte Carlo approach has\nbeen used to evaluate the impact on the result of different sources of\nuncertainty, i.e. observational errors, evolutionary effects, systematic\nuncertainties of the models. As a check of the procedure, the method has been\napplied to a different data set, namely the low-MS of the Hyades. Once a set of\nZAMS and atmosphere models have been chosen, we found that the inferred value\nof \\Delta Y/\\Delta Z is sensitive to the age of the stellar sample, even if we\nrestricted the data set to low luminosity stars. The lack of an accurate age\nestimate of low mass field stars leads to an underestimate of the inferred\n\\Delta Y/\\Delta Z of ~2 units. On the contrary the method firmly recovers the\n\\Delta Y/\\Delta Z value for not evolved samples of stars such as the Hyades\nlow-MS. Adopting a solar calibrated mixing-length parameter and the PHOENIX\nGAIA v2.6.1 atmospheric models, we found \\Delta Y/\\Delta Z = 5.3 +/- 1.4 once\nthe age correction has been applied. The Hyades sample provided a perfectly\nconsistent value.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1005.0077%2C1005.0579%2C1005.5635%2C1005.2700%2C1005.3931%2C1005.2819%2C1005.2959%2C1005.4796%2C1005.4729%2C1005.4509%2C1005.0283%2C1005.1428%2C1005.2971%2C1005.2680%2C1005.1819%2C1005.3669%2C1005.4084%2C1005.3461%2C1005.0263%2C1005.0158%2C1005.3281%2C1005.1421%2C1005.4852%2C1005.1849%2C1005.3596%2C1005.4100%2C1005.5319%2C1005.5216%2C1005.3246%2C1005.1277%2C1005.2993%2C1005.4058%2C1005.3707%2C1005.1978%2C1005.4083%2C1005.2751%2C1005.0641%2C1005.3156%2C1005.5099%2C1005.0429%2C1005.3880%2C1005.4412%2C1005.4045%2C1005.1892%2C1005.3305%2C1005.3604%2C1005.4326%2C1005.3023%2C1005.0215%2C1005.1418%2C1005.0751%2C1005.0209%2C1005.3646%2C1005.5115%2C1005.2455%2C1005.5466%2C1005.5202%2C1005.1551%2C1005.1884%2C1005.5293%2C1005.0306%2C1005.3663%2C1005.0879%2C1005.3888%2C1005.3766%2C1005.1530%2C1005.1807%2C1005.2879%2C1005.0245%2C1005.2328%2C1005.0725%2C1005.5591%2C1005.3036%2C1005.5610%2C1005.4541%2C1005.0610%2C1005.0704%2C1005.5279%2C1005.1586%2C1005.2646%2C1005.4844%2C1005.2386%2C1005.2299%2C1005.3718%2C1005.3215%2C1005.5133%2C1005.5493%2C1005.4135%2C1005.2416%2C1005.0423%2C1005.5659%2C1005.0956%2C1005.3260%2C1005.1630%2C1005.5262%2C1005.3235%2C1005.5121%2C1005.1947%2C1005.1340%2C1005.1264%2C1005.3982&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "The stellar helium-to-metal enrichment ratio, \\Delta Y/\\Delta Z, is a widely\nstudied astrophysical quantity. However, its value is still not precisely\nconstrained. This paper is focused on the study of the main sources of\nuncertainty which affect the \\Delta Y/\\Delta Z derived from the analysis of the\nlow-main sequence (MS) stars in the solar neighborhood. The possibility to\ninfer the value of \\Delta Y/\\Delta Z from the study of low-MS stars relies on\nthe dependence of the stellar luminosity and effective temperature on the\ninitial Y and Z. The \\Delta Y/\\Delta Z ratio is obtained by comparing the\nmagnitude difference between the observed stars and a reference theoretical\nzero age main sequence (ZAMS) with the related theoretical magnitude\ndifferences computed from a new set of stellar models with up-to-date input\nphysics and a fine grid of chemical compositions. A Monte Carlo approach has\nbeen used to evaluate the impact on the result of different sources of\nuncertainty, i.e. observational errors, evolutionary effects, systematic\nuncertainties of the models. As a check of the procedure, the method has been\napplied to a different data set, namely the low-MS of the Hyades. Once a set of\nZAMS and atmosphere models have been chosen, we found that the inferred value\nof \\Delta Y/\\Delta Z is sensitive to the age of the stellar sample, even if we\nrestricted the data set to low luminosity stars. The lack of an accurate age\nestimate of low mass field stars leads to an underestimate of the inferred\n\\Delta Y/\\Delta Z of ~2 units. On the contrary the method firmly recovers the\n\\Delta Y/\\Delta Z value for not evolved samples of stars such as the Hyades\nlow-MS. Adopting a solar calibrated mixing-length parameter and the PHOENIX\nGAIA v2.6.1 atmospheric models, we found \\Delta Y/\\Delta Z = 5.3 +/- 1.4 once\nthe age correction has been applied. The Hyades sample provided a perfectly\nconsistent value."}, "authors": ["Mario Gennaro", "Pier Giorgio Prada Moroni", "Scilla Degl'Innocenti"], "author_detail": {"name": "Scilla Degl'Innocenti"}, "author": "Scilla Degl'Innocenti", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1051/0004-6361/201014227", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1005.0245v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1005.0245v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "Accepted for publication in Astronomy & Astrophysics", "arxiv_primary_category": {"term": "astro-ph.GA", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "astro-ph.GA", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1005.0245v1", "affiliation": "INFN, Pisa", "arxiv_url": "http://arxiv.org/abs/1005.0245v1", "journal_reference": null, "doi": "10.1051/0004-6361/201014227", "fulltext": "c ESO 2018\n\nAstronomy & Astrophysics manuscript no. gennaro ̇accepted\nMarch 28, 2018\n\n∆Y/∆Z from the analysis of local K dwarfs\nM. Gennaro1 ⋆ , P. G. Prada Moroni2,3 , and S. Degl'Innocenti2,3\n1\n2\n\narXiv:1005.0245v1 [astro-ph.GA] 3 May 2010\n\n3\n\nMax Planck Institute for Astronomy, Königsthul 17, D-69117 Heidelberg, Germany\ne-mail: gennaro@mpia.de\nPhysics Department \"E. Fermi\", University of Pisa, Largo B. Pontecorvo 3, I-56127, Pisa, Italy\nINFN, Largo B. Pontecorvo 3, I-56127, Pisa, Italy\ne-mail: prada@df.unipi.it, scilla@df.unipi.it\n\nReceived February 9, 2010; accepted April 29, 2010\nABSTRACT\n\nContext. The stellar helium-to-metal enrichment ratio, ∆Y/∆Z, is a widely studied astrophysical quantity. However, its value is still\nnot precisely constrained.\nAims. This paper is focused on the study of the main sources of uncertainty which affect the ∆Y/∆Z ratio derived from the analysis of\nthe low-main sequence (MS) stars in the solar neighborhood.\nMethods. The possibility to infer the value of the helium-to-metal enrichment ratio from the study of low-MS stars relies on the dependence of the stellar luminosity and effective temperature on the initial helium and metal abundances. The ∆Y/∆Z ratio is obtained\nby comparing the magnitude difference between the observed stars and a reference theoretical zero age main sequence (ZAMS) with\nthe related theoretical magnitude differences computed from a new set of stellar models with up-to-date input physics and a fine grid\nof chemical compositions. A Monte Carlo approach has been used to evaluate the impact on the result of different sources of uncertainty, i.e. observational errors, evolutionary effects, systematic uncertainties of the models. As a check of the procedure, the method\nhas been applied to a different data set, namely the low-MS of the Hyades.\nResults. Once a set of ZAMS and atmosphere models have been chosen, we found that the inferred value of ∆Y/∆Z is sensitive to the\nage of the stellar sample, even if we restricted the data set to low luminosity stars. The lack of an accurate age estimate of low mass\nfield stars leads to an underestimate of the inferred ∆Y/∆Z of ∼ 2 units. On the contrary the method firmly recovers the ∆Y/∆Z value\nfor not evolved samples of stars such as the Hyades low-MS. Adopting a solar calibrated mixing-length parameter and the PHOENIX\nGAIA v2.6.1 atmospheric models, we found ∆Y/∆Z = 5.3 ± 1.4 once the age correction has been applied. The Hyades sample\nprovided a perfectly consistent value.\nConclusions. We have demonstrated that the assumption that low-mass stars in the solar neighborhood can be considered as unevolved, does not necessarily hold, and it may indeed lead to a bias in the inferred ∆Y/∆Z. The effect of the still poorly constrained\nefficiency of the superadiabatic convection and of different atmosphere models adopted to transform luminosities and effective temperature into colors and magnitudes have been discussed, too.\nKey words. Galaxy: fundamental parameters – solar neighborhood – Stars: abundances – Stars: low-mass\n\n1. Introduction\nIt is a well known and firm result of stellar evolution studies that\nthe main structural, observational and evolutionary characteristics of a star of given mass depend sensitively on the original\nchemical composition, i.e. the initial helium and metal abundances, Y and Z, respectively. As a consequence, these parameters affect also the observable quantities of stellar systems, from\nstar clusters to galaxies.\nWhile the present Z in a stellar atmosphere can be obtained\nby the direct spectroscopic measurements of some tracer element, mainly iron, with the additional assumption on the mixture\nof heavy elements, the situation of Y is completely different. In\nthe vast majority of stars the helium lines can not be observed,\nwith the exception of those hotter than 20 000 K. This means that\nfor the low-mass stars, which are the most common and longlasting objects in the Universe, helium can be directly observed\nonly in advanced evolutionary phases, as the blue part of the horizontal branch or in the post-asymptotic giant branch. Thus, the\n⋆\n\nMember of the International Max Planck Research School for\nAstronomy and Cosmic Physics at the University of Heidelberg,\nIMPRS-HD, Germany\n\nactually measured helium abundance is not the original one, but\nthe result of several complex processes, like dredge-up of nuclearly processed material, diffusion and radiative levitation, which\nseverely alter the surface chemical composition.\nAs a consequence, in order to evaluate the original Y, the\nonly possibility is to rely on indirect methods. This explains why\nsuch an important parameter is still poorly constrained.\nAs early suggested by Peimbert & Torres-Peimbert (1974)\nfrom the analysis of the chemical composition of the HII regions\nin the Large Magellanic Cloud, a common approach in both stellar and population synthesis models is to assume a linear relationship between the original Y and Z,\nY = YP +\n\n∆Y\n×Z\n∆Z\n\n(1)\n\nwhere YP is the primordial helium content, i.e. the result of the\nBig Bang nucleosynthesis, and ∆Y/∆Z the ratio which provides\nthe stellar nucleosynthesis enrichment.\nIn the last four decades there has been a continuous effort to try to constrain both the YP (see e.g.\nPeebles 1966; Churchwell, Mezger & Huchtmeier 1974;\nPeimbert & Torres-Peimbert 1974, 1976; Lequeux et al. 1979;\n\n\f2\n\nM. Gennaro et al.: ∆Y/∆Z from the analysis of local K dwarfs\n\nKunth & Sargent 1983; Pagel, Terlevich & Melnick 1986;\nKunth 1986; Pagel et al. 1992; Mathews, Boyd & Fuller\n1993;\nIzotov, Thuan & Lipovetsky\n1994;\nOlive & Steigman\n1995;\nIzotov, Thuan & Lipovetsky\n1997;\nOlive, Steigman & Skillman\n1997;\nPeimbert, Peimbert & Luridiana 2002; Izotov, Thuan & Stasi\n2007; Peimbert et al. 2007; Spergel et al. 2007; Dunkley et al.\n2009) and the ratio ∆Y/∆Z (Faulkner 1967; Perrin et al.\n1977; Lequeux et al. 1979; Peimbert & Serrano 1980;\nPeimbert\n1986; Pagel et al.\n1992; Renzini\n1994;\nFernandes, Lebreton & Baglin\n1996;\nPagel & Portinari\n1998;\nJimenez et al.\n2003;\nIzotov & Thuan\n2004;\nFukugita & Kawasaki 2006; Casagrande et al. 2007).\nIndeed, as previously mentioned, the relationship between Y\nand Z adopted in stellar models directly affects some important\nquantities of stellar systems, both resolved and not, inferred by\ncomparing observations and theoretical predictions. Thus, a precise determination of YP and ∆Y/∆Z is of paramount importance\nfor the studies not only of stellar evolution, but also of galaxy\nevolution. Furthermore, an accurate estimate of YP is of great\ncosmological interest, as it constrains the early evolution of the\nUniverse, when the Big Bang nucleosynthesis occurred. In this\npaper we will focus on the value of the ∆Y/∆Z ratio.\nIn the past, several techniques have been used to determine\nsuch a ratio by means of HII regions, both galactic and extragalactic, planetary nebulae (PNe), the Sun and chemical evolution models of the Galaxy (see Sect. 9 for a brief summary of\nthese results).\nAn alternative and well established way to determine the\nvalue of the helium-to-metallicity enrichment ratio takes advantage of the dependence of the location of stars in the\nHertzsprung-Russell (HR) diagram on their helium content.\nFrom the study of stellar populations in the galactic bulge\nRenzini (1994) inferred 2 ≤ ∆Y/∆Z ≤ 3. A frequently adopted\napproach relies on the analysis of the fine structure of the lowMS of the local field stars in the HR diagram. Pioneers of such\nan approach have been Faulkner, who found ∆Y/∆Z = 3.5\n(Faulkner 1967) and Perrin and collaborators, who obtained\n∆Y/∆Z = 5 (Perrin et al. 1977). Following these early studies, Fernandes, Lebreton & Baglin (1996) constrained the value\nof ∆Y/∆Z to be larger than 2, by comparing the broadening in\nthe HR diagram of the low-mass MS stars in the solar neighborhood and the theoretical ZAMS of several Y and Z. With\na similar approach but taking advantage of Hipparcos data,\nPagel & Portinari (1998) inferred ∆Y/∆Z = 3 ± 2. This kind\nof approach culminated recently in the works by Jimenez et al.\n(2003) and Casagrande et al. (2007) who provided, respectively,\n∆Y/∆Z = 2.1 ± 0.4 and 2.1 ± 0.9.\nThe present analysis deals with the determination of the\n∆Y/∆Z ratio by means of the comparison between the local K\ndwarf stars, for which accurate measures of both the [Fe/H] and\nparallaxes are available, and state-of-the-art stellar models. A\ngreat effort has been devoted to discuss the effect of the main\nuncertainties still present in stellar models on the inferred value\nof ∆Y/∆Z.\nIn Sect. 2 we present the set of low-mass stellar models we\nhave computed for this paper; in Sect. 3 we describe the data set\nwe have used; Section 4 contains the description of the analysis\nmethod, while Sect. 5 deals with the possible sources of uncertainty that could affect the method itself. Results for the adopted\ndata set are presented in Sect. 6. In Sect. 7 we investigate the possibility of a non linear relation between Y and Z. In Sect. 8 we\napply our method to an independent and unevolved set of stars,\ni.e. the Hyades low-main sequence. We compare our results to\n\nthose obtained by other authors, with independent methods, in\nSect. 9. Section 10 contains the final discussion and summary of\nthe whole paper.\n\n2. The models\nThe stellar models have been computed on purpose for the\npresent work with an updated version of the FRANEC evolutionary code which includes the state-of the art input physics\n(see e.g. Chieffi & Straniero 1989; Degl'Innocenti et al. 2008;\nValle et al. 2009; Tognelli, Prada Moroni & Degl'Innocenti\n2010). The main updating of the code with respect to previous\nversions include the 2006 release of the OPAL Equation of\nstate (EOS) 1 (see also Rogers et al. 1996) and, for temperatures higher than 12000 K, radiative opacity tables2 (see also\nIglesias & Rogers 1996), while the opacities by Ferguson et al.\n(2005) are adopted for lower temperatures 3 . The electronconduction opacities are by Shternin & Yakovlev (2006) (see\nalso Potekhin 1999). The opacity tables have been calculated\nby assuming the solar mixture by Asplund et al. (2005).\nThe extension of the convectively unstable regions is determined by using the classical Schwarzschild criterion. The mixing length formalism (Böhm-Vitense 1958) is used to model the\nsuper-adiabatic convection typical of the outer layers. As it is\nwell known, within this simplified scheme, the efficiency of convective transport depends on a free parameter that has to be calibrated using observations. We adopted the usual \"solar\" calibration of the α of the mixing-length. More in detail, this means\nthat we chose the value of α = 1.97 provided by a standard solar model (SSM) computed with the same FRANEC code and\nthe same input physics we used to compute all the other stellar\ntracks.\nNote that the \"solar\" calibrated value of the α parameter strongly depends on the chosen outer boundary conditions needed to solve the differential equations describing the\ninner stellar structure, that is, the main physical quantities\nat the base of the photosphere (e.g. Montalban et al. 2004;\nTognelli, Prada Moroni & Degl'Innocenti 2010). In order to get\nthese quantities, we followed the procedure commonly adopted\nin stellar computations, which consists in a direct integration of\nthe equations describing a 1D atmosphere in hydrostatic equilibrium and in the diffusive approximation of radiative transport,\nplus a grey T(τ) relationship between the temperature and the\noptical depth. The classical semiempirical T(τ) relationship by\nKrishna Swamy (1966) has been chosen. If a non-grey and more\nrealistic model atmosphere is used, the solar calibrated value of\nα is different (see e.g. Tognelli, Prada Moroni & Degl'Innocenti\n2010, for a detailed discussion).\nMoreover, the \"solar\" calibrated value of the α parameter depends also on the input physics adopted in the SSM computation.\nThus, to the sake of consistency, if the solar calibration approach\nis followed to fix the α parameter of a set of stellar models, the\ninput physics and boundary conditions adopted to compute these\nmodels have to be the same as those used in the reference SSM.\nIn spite of its widespread use, the solar calibration of the\nmixing-length does not rely on a firm theoretical ground, since\nthere are not compelling reasons to guarantee that the efficiency\nof superadiabatic convective transport should be same in stars of\ndifferent mass and/or in different stages of evolution (see e.g.\nMontalban et al. 2004, and references therein). However, for\n1\n2\n3\n\nhttp://www-phys.llnl.gov/Research/OPAL/EOS 2005/\nhttp://www-phys.llnl.gov/Research/OPAL/opal.html\nhttp://webs.wichita.edu/physics/opacity\n\n\fM. Gennaro et al.: ∆Y/∆Z from the analysis of local K dwarfs\n\n3\n\nwhat concerns the present paper, such an approach should be\nquite safe, since we deal with stars in the mass range 0.7-0.9\nM⊙ and that are on the Main Sequence.\nWe also computed models with a different value of α, namely\n2.4, in order to quantify the effect of an uncertainty in the efficiency of the mixing-length on the inferred ∆Y/∆Z ratio.\nOur reference theoretical models have been transformed\nfrom the (log T eff , log L/L⊙ ) to the (B − V, MV ) diagram by\nmeans of synthetic photometry using the spectra database\nGAIA v2.6.1 calculated from PHOENIX model atmospheres\n(Brott et al. 2005). We performed additional simulations adopting the Castelli & Kurucz (2003) model atmospheres, to check\nthe effect of the adopted color transformations on the inferred\n∆Y/∆Z ratio.\nThe original helium abundance in the stellar models has been\nobtained following Equation (1), where Z, once a solar mixture\nis assumed, is directly related to the observable [Fe/H] by\nZ=\n\n1+\n\n∆Y\n∆Z\n\n+\n\n1 − YP\n1\n−[Fe/H]\n(Z/X)⊙ × 10\n\n(2)\n\nWe used for YP the value 0.248, from Izotov, Thuan & Stasi\n(2007) and Peimbert et al. (2007), and for (Z/X)⊙, the solar\nmetals-to-hydrogen ratio, 0.0165 from Asplund et al. (2005).\nStellar models have been calculated for 9 ∆Y/∆Z values (0.5,\n1, 2 ... 8) and 5 [Fe/H] values (from -0.6 to +0.2 in steps of\n0.2 dex). For each of these 45 combinations we calculated evolutionary tracks for 11 stellar masses (from 0.5 to 1.0 M⊙ in\nsteps of 0.05 M⊙ ) in order to build zero age main sequence\n(ZAMS) curves that cover the whole HR region corresponding\nto the adopted data set (see Sect. 3). For each stellar mass we calculated its evolution starting from the pre-main sequence (PMS)\nphase.\nTo determine the ZAMS position we used the following\noperative criterion: we calculated the local Kelvin-Helmoltz\ntimescale for each model, i.e. tKH = |Ω|/L, where Ω and L are\nthe gravitational binding energy and the total luminosity; then\nwe compared this number with the local evolutionary timescale,\n\u0010\n\u0011−1\ntev = L1 dL\n, i.e. the inverse of the instantaneous rate of\ndt\nchange of the luminosity. We found that a good operative definition of ZAMS is obtained by taking the first model for which\ntKH < 100 × tev .\nAs previously mentioned, an additional set of models, with\nthe related ZAMS, has been computed for a value of the mixinglength parameter, α = 2.4.\nThus, the present analysis can rely on a very fine grid of stellar models consisting of about a thousand evolutionary tracks\ncalculated from the PMS phase to the central hydrogen exhaustion.\n\n3. The data set\nThe stars of our sample have been selected among the\nHIPPARCOS (ESA 1997) stars with relative error on the parallax less than 5%. B and V band photometry are also taken from\nHIPPARCOS data set and they have typical errors between 0.01\nand 0.02 mag; combining them gives (B − V) colors with errors\nof the order of 0.03 mag. From the parallax and the observed V\nmagnitude we computed the absolute magnitude MV ; with the\nquoted typical errors on V and parallax, the error on the absolute magnitude is ∼ 0.1 mag, largely dominated by the error on\nthe parallax. Given the small values of the distances, always less\nthan 30 pc for the stars in our sample, we also assume that the\n\nFig. 1. The data color-magnitude diagram. Overplotted are three\nZAMS all computed with ∆Y/∆Z = 2 and [Fe/H] values of -0.6\n(dotted), 0.0 (solid), 0.2 (dash-dotted).\nreddening is negligible, so that (B − V)0 = (B − V). Our sample\nhas been restricted only to those stars with MV ≥ 6 in order to\ntake objects with long evolutionary time scales and hence minimize evolutionary effects.\n[Fe/H] determinations are taken from the GenevaCopenhagen survey of the Solar neighborhood catalog\n(Nordström et al. 2004, hereafter N04), for 86 objects, and\nfrom the catalog by Taylor (Taylor 2005, hereafter T05) for\n21 objects. Of these 107 objects, 4 have [Fe/H] determinations\nfrom both catalogs; in these cases we only count the stars once,\nusing their T05 metallicities. The total number is then reduced\nto 103 stars. N04 metallicity values are derived by a calibrated\nrelation between Strömgren photometry measurements and\nspectroscopic determinations of metal abundances for a subset\nof objects. The T05 catalog is instead a collection of spectroscopic determinations of metal abundances from the literature,\nwhere different results are put by the author on the same\ntemperature scale; if more determinations are available for the\nsame object, they are weight-averaged according to their quality.\nAs pointed out in Taylor (2005), determination of [Fe/H] from\ndifferent authors may suffer strong systematic deviations, due to\nthe different temperature scale chosen. The author showed that\nit is possible to reach a very good zero-point accuracy when\ndata from different sources are put together in an appropriate\nway. Indeed a systematic difference in metallicity can be seen\nfor the 4 stars that we have in common in our subsamples of the\nN04 and T05 catalogs. The metallicities for these objects are\nshown in Table 1. There we also show the new determinations\nof Geneva-Copenhagen metallicities using an improved calibration (Holmberg et al. 2007, hereafter H07). As shown by the\nauthors, the N04 and H07 spectro-photometric calibrations give\ninternally consistent results; only one of the 4 stars in common\nshows a small change in the [Fe/H] between the two catalogs.\nThe average shift in [Fe/H] on this small sample and its standard\ndeviation is < [Fe/H]T05 − [Fe/H]N04 >= −0.084 ± 0.021 dex.\nTaylor (2005) calculates the expected offset between his\nmetallicity scale and the Nordström et al. (2004) one; according\nto his Table 10, for all the stars in our N04 sub-sample this offset\nis expected to be −0.023 ± 0.017 dex, somewhat lower than what\nwe find for our stars in common, which, anyway are only 4. We\n\n\f4\n\nM. Gennaro et al.: ∆Y/∆Z from the analysis of local K dwarfs\n\nTable 1. [Fe/H] for the 4 stars in common in the Taylor\n(2005) and Geneva-Copenhagen catalogs. T05, N04, H07 refer\nto Taylor (2005), Nordström et al. (2004) and Holmberg et al.\n(2007) respectively.\nHIPPARCOS ID\nHIP 79190\nHIP 88972\nHIP 99711\nHIP 116745\n\nT05\n-0.410\n-0.157\n-0.006\n-0.336\n\nN04\n-0.340\n-0.080\n0.070\n-0.220\n\nH07\n-0.300\n-0.080\n0.070\n-0.220\n\ndecided to apply the -0.023 offset to the Geneva-Copenhagen\nmetallicities in their old version, i.e. the N04, since it is for the\nNordström et al. (2004) calibration that Taylor (2005) evaluates\nthe zero-point offset.\nIn the Geneva-Copenhagen survey the repeated radial velocity measurements allow detections of almost all the possible binaries in the sample; we flagged out all the suspect binaries in\nthe catalog. The Taylor (2005) [Fe/H] catalog is instead free of\nsuch contaminants, given its spectroscopic nature.\nOur final sample is made of 103 stars with good parallaxes, photometry and [Fe/H] determinations. The typical errors\nare given by: σ(MV ) ≃ 0.1 mag, σ(B − V) ≃ 0.03 mag and\nσ([Fe/H]) ≃ 0.1 dex. The error on the absolute magnitude is\nmainly due to the error on the parallax.\nMetallicities range from [Fe/H] = -0.6 dex to +0.2 dex; magnitudes range from MV = 6.0 mag to MV = 7.5 mag. The colormagnitude diagram (CMD) for the data is shown in Fig. 1, where\nthe data are grouped in [Fe/H] bins 0.2 dex wide.\n\n4. The method\nThe idea to determine the ∆Y/∆Z ratio using the position of lowmass MS stars in the HR diagram relies on the well known dependence of their luminosity and effective temperature on the\noriginal Y and Z. It is in fact firmly established that an increase\nof Y at fixed Z makes a star brighter and hotter. A decrease of Z\nat fixed Y leads to the same result. Such a behavior is the consequence of the effect on the opacity and mean molecular weight,\ni.e. the former gets higher as Z increases, while the latter grows\nwith Y.\nAs early shown by Faulkner (1967), who studied the effect\nof chemical composition variations on the position of theoretical ZAMS, a simple but instructive explanation of this behavior can be obtained by means of homology relations (see also\nFernandes, Lebreton & Baglin 1996). Within this framework, it\ncan be shown that varying Y and Z in such a way that ∆Y ≈ 5 ∆Z,\nleaves the bolometric magnitude Mbol of ZAMS at fixed effective temperature unchanged. This explains why the broadening\nof the local low-MS provides a ∆Y/∆Z indicator.\nHowever, this is not the whole story, as clearly proven\nby Castellani, Degl'Innocenti & Marconi (1999), who computed a fine grid of full evolutionary models of ZAMS stars\nwith several metal and helium abundances. They showed that\nthe Mbol of ZAMS at a given T eff depends quadratically\non log Z and that only in a narrow range around the solar\nmetallicity such a dependence can be reasonably linearized\nto ∆Y/∆Z= 5 (see also Fernandes, Lebreton & Baglin 1996).\nIn addition, when comparing ZAMS models with real stars,\none has to take into account the effect on the color indices.\nCastellani, Degl'Innocenti & Marconi (1999) showed that a\n∆Y/∆Z ≈ 7 is required to keep unchanged the B − V color at\nMV =6 in a narrow range around Z⊙ . The discrepancy between\n\nthe ∆Y/∆Z required to keep the Mbol and B−V unchanged clearly\nproves the crucial role played by the model atmospheres. In Sect.\n5.4 we will further discuss the effect of different assumptions on\nthe color-transformations on the inferred ∆Y/∆Z.\nThe use of ZAMS models is allowed as long as observational\ndata really lie on the ZAMS, or very close to it. Although this\nassumption is implicit in many studies which derive the ∆Y/∆Z\nfrom the fine structure of the low-MS, a detailed discussion on\nthe effect of a deviation from such an assumption on the inferred\nvalue of the helium-to-metal enrichment ratio is still lacking.\nThe reason is that very faint (MV ≥6) local MS stars are usually considered as if they were still on the ZAMS, since their\nevolutionary timescales are longer than the Galactic Disk age.\nWe will show in Sect. 5.2 that this assumption is indeed critical,\nsince underestimating the effects of age on both the position of\nthe stars in the CMD and the diffusion of heavy elements below\nthe photosphere leads to a severe bias in the final estimate of the\nenrichment ratio. We take this bias into account when giving the\nfinal result on ∆Y/∆Z for our work.\nFollowing Jimenez et al. (2003), we did not directly use\nthe broadening of the local low-MS in the CMD, instead, we\ncompared models and data in a diagram like that of Fig. 2,\nright panel. After choosing a reference ZAMS, theoretical differences in magnitude, ∆MV , between that reference ZAMS and\nthe other ZAMS curves, computed for different values of [Fe/H]\nand ∆Y/∆Z, are measured at a fixed value of the color index B−V\n(see Fig. 2, left panel). We checked that, within the current accuracy of the data, the derived ∆Y/∆Z value it is not affected by\nchanging the reference ZAMS and/or the color index value. In\nfact, the ZAMS loci, in the range of magnitudes and colors that\nis involved here, are almost parallel to each other and the effect\nof the uncertain position of the star caused by the observational\nerrors is much larger then that caused by a different choice of the\nreference ZAMS and/or the color index value.\nThe differences ∆MV obviously depend on the chemical\ncomposition, i.e. on both ∆Y/∆Z and [Fe/H], as is clearly visible in Fig. 2 (right panel). Observational differences between\nthe data set and the same reference ZAMS are also measured in\nthe way illustrated in Fig. 2 (left panel) and are plotted in Fig. 2\n(right panel) as a function of [Fe/H].\nTo find the value of ∆Y/∆Z that gives the best fit to the data,\nwe assign to each star errors in the three quantities MV , B−V and\n[Fe/H]. The errors in MV and B − V are assigned in the CMD,\ni.e. before the differences ∆MV are calculated; then the error\nin [Fe/H] is assigned in the (∆MV , [Fe/H]) diagram. Magnitude\nand color errors are considered to be distributed as gaussian with\nσ equal to the quoted uncertainty for that star; the assumption of\ngaussian errors is reasonable, considering that they come from\nthe HIPPARCOS photometric errors plus (for the absolute magnitude) the HIPPARCOS parallax error; these two sources of error are independent and our objects are all close by and have well\ndetermined parallaxes, so that they don't suffer the Lutz-Kelker\nbias. Regarding the [Fe/H] value the situation is different, since\nthe errors associated to each value are highly affected by systematic effects like the choice of the temperature scale; for this reason, and since we can not reconstruct the real error distribution\nin [Fe/H], we adopted an uniform distribution of [Fe/H] errors.\nAnyway, we have also checked that a gaussian distribution for\n[Fe/H] values leaves the results essentially unaffected.\n\n\fM. Gennaro et al.: ∆Y/∆Z from the analysis of local K dwarfs\n\n5\n\nFig. 2. Illustrative example of how theoretichal and observational differences are computed and used to produce a ∆MV vs. [Fe/H]\ndiagram. Left: Theoretical differences are obtained with respect to a reference ZAMS computed using ∆Y/∆Z = 2 and [Fe/H] = 0.0\ndex (solid line) at the reference color of B − V = 0.95 (dotted vertical line); the dashed lines are ZAMS computed for ∆Y/∆Z = 4\nand [Fe/H] ∈ [−0.6, 0.2]. Observational differences (represented by the distance between filled and empty stars) are calculated for\nan observed star at a given color with respect to the same reference ZAMS. Right: The differences are used to place both ZAMS\nand stars in the ∆MV vs. [Fe/H] diagram. The solid line corresponds to the curve of ∆Y/∆Z = 4 (the ZAMS of the left panel); the\ndot-dashed line to ∆Y/∆Z = 0.5; the dotted line to ∆Y/∆Z = 8.\nOnce a \"new\" data set is created from the original value plus\nthe errors, we determine the theoretical curve which minimizes\nthe quantity:\nDj =\n\nX \" ∆MV,i − ∆MV, j ([Fe/H]i ) #2\ni\n\nσ(∆MV,i )\n\n,\n\n(3)\n\nwhere j runs over the curves (i.e. over different ∆Y/∆Z values)\nand i over the data. The quantity ∆MV, j ([Fe/H]i ) is the value of\nthe magnitude difference for the j-th theoretichal ZAMS, calculated for the [Fe/H] value of the i-th star. The scheme is iterated\nin order to obtain not only the best fitting value but also an estimate of the error on the final result due to the observational uncertainties. For each iteration we take the value that minimizes\nEquation (3) and then plot an histogram of the number of best-fit\noccurrences for each ∆Y/∆Z in our models grid. A gaussian fit\nto the histogram is performed and the mean and the standard deviation of this gaussian are used as estimators of the true ∆Y/∆Z\nand its error. Figure 3 shows the histogram of occurrences for a\nMonte Carlo simulation with a total of 105 iterations using our\ndata set of 103 stars; superimposed is the best-fitting gaussian.\nWe will discuss in Sect. 6 why, in this particular case, a gaussian\ncurve does not fit well the histogram of occurrences, with the\ncentral part of the histogram which is too broad and flat to be\nwell approximated by a single gaussian. We just anticipate that\nthis discrepancy is mainly due to the offsets in the [Fe/H] scales\nfor N04 and T05, even after the correction of Table 10 of Taylor\n(2005) is applied to the N04 data.\n\n5. Analysis of possible sources of uncertainty\nusing artificial data sets\nTo check the reliability of the procedure described above and\nto evaluate the contribution of the various possible sources of\nuncertainty, we applied our method to a number of artificial data\nsets with controlled input parameters.\n\nFig. 3. Results of 105 simulation runs to determine the best fitting\n∆Y/∆Z value for our 103 stars data set, according to Equation\n(3). The best-fitting gaussian is also shown, together with its\nmean value and standard deviation.\n\nThese sets have been created by interpolation in our fine grid\nof stellar models. Stellar masses are randomly generated from a\n−α\npower law initial mass function (IMF) dN\nwith a slope\ndm = c × m\nof α = 2.3 (Salpeter 1955; Kroupa 2001); an IMF with a unique\nvalue of the exponent is a good law in our range of simulated\nmasses (0.5 ≤ Msim /M⊙ ≤ 1). The chemical composition is\ncalculated by fixing the input value of (∆Y/∆Z)in and extracting\nrandom values for [Fe/H] for each star; Y and Z are then calculated using the two Equations (1) and (2). In what concerns the\nstellar ages generation, we performed different kind of simulations, adopting three age-laws (i.e. star formation rates, SFRs),\nnamely a Dirac's delta centered about a given age (i.e. coeval\n\n\f6\n\nM. Gennaro et al.: ∆Y/∆Z from the analysis of local K dwarfs\n\nstars), a uniform and an exponentially decaying age distribution,\nrespectively, in the range 0-7 Gyr, a reasonable approximation\nfor the age of the galactic disk.\nSince the FRANEC code includes a treatment of diffusion\nof the elements, given a star of age τ, we take from the models\nthe corresponding surface value of [Fe/H]τ, which is different\nfrom the initial value [Fe/H]0 because of diffusion itself. This\nis the value that we use for the recovery, because in a real star\nthe observed [Fe/H] is the present one and not the initial. Note\nthat neglecting diffusion may lead to a bias (an underestimate,\nindeed) in the final ∆Y/∆Z if the sample of stars is old enough to\nhave experienced a not negligible amount of diffusion of heavy\nelements; we will show this in Sect. 5.2.\nWhen generating the stellar models parameters for our sets\nof stars, we do not take into account any age-metallicity relation,\nhence [Fe/H] and age values are independently and randomly extracted. Recent works (Nordström et al. 2004; Holmberg et al.\n2007) have indeed shown that there is no evidence of an agemetallicity relation for local disk stars. Given mass, age and\nchemical composition, we interpolated in our fine grid of stellar\nmodels to obtain the observational properties of the simulated\nstars. The number of stars in each simulated set is 110, a number\ncomparable to the 103 stars of our real data sample.\nIn the following and in the related figures, we will refer to the\ninput parameters of our simulated samples using the subscript in\nand to the output of the recovery method using the subscript out.\n\nFig. 4. Results of a test for a sample of 110 simulated stars lying\non the ZAMS (see text for more details). Overplotted is the bestfit gaussian.\n\n5.1. The effect of measurements errors\n\nThe first test we have performed was made to check whether our\nrecovery method was able to get the right ∆Y/∆Z from an \"ideal\"\nsample of stars affected only by observational errors on the magnitude, color and [Fe/H] values. By ideal we mean a sample that,\nregardless of masses and [Fe/H] distribution (which indeed were\ngenerated in a completely random fashion), contains only stars\nreally lying on the ZAMS. It is worth to point out that in the case\nof the real data, this is only a simplifying assumption, which\ncan not be exactly fulfilled, since the observed stars in our sample have unknown ages that span the whole range of ages in the\nGalactic disk.\nOnce the artificial sample has been generated, we associated\nto each star an error in absolute magnitude, color and [Fe/H]\ntypical of our real sample of data, i.e., 0.1 mag, 0.03 mag and\n0.1 dex respectively (see Sect. 3) .\nWe found that our recovery method is not affected by observational errors of this order of magnitude. As it is possible to\nsee in Fig. 4, given a (∆Y/∆Z)in of 4, the best value that comes\nout from our Monte Carlo method and the gaussian fit to the histogram of occurrences is indeed (∆Y/∆Z)out = 3.87 ± 0.63. So\nthe outcome of the method is perfectly consistent with the input\nvalue and; moreover it has a very small range of 1.26 at a level of\n1σ, which is comparable to the resolution in our models grid (1\nunit), and which we may quote as the nominal or intrinsic error\nof the method, associated to the typical error of the actual data.\n5.2. The effects of age and heavy elements diffusion\n\nAlthough our stellar sample has been obtained by selecting very\nfaint stars (MV > 6 mag, i.e. M . 0.9M⊙ , the actual value depending on the chemical composition), we found that evolutionary effects strongly affect the final result introducing a non negligible bias. This is actually one of the most important results of\nthis work. Thus, one should be very careful in properly taking\n\nFig. 5. Results of a test for a sample of 110 simulated stars not\nlying on the ZAMS. Ages are uniformly distributed between 0\nand 7 Gyr. The solid line gives the result when heavy elements\ndiffusion is taken into account, while the dashed line corresponds\nto the case where [Fe/H]t is equal to [Fe/H]ZAMS . Overplotted are\nthe best-fit gaussians.\n\ninto account the evolutionary effects, i.e. the displacement from\nthe ZAMS, when helium-to-metals enrichment ratio is derived\nfrom the low MS fine structure.\nIndeed, by creating artificial stellar data sets with\n(∆Y/∆Z)in = 4, but no longer on their ZAMS position, we found\nan output value of our recovery method of (∆Y/∆Z)out ∼ 2.\nThe actual best-fit value for each simulated data set depends\non the exact parameters used to generate the artificial sample,\nlike the maximum age or the functional form of the age distribution (uniform or with an exponentially decaying SFR). The total\nnumber of stars, their [Fe/H] and magnitude ranges are always\nkept the same between the different simulated data set. Figure\n5 shows the results of our method using data sets where the\n\n\fM. Gennaro et al.: ∆Y/∆Z from the analysis of local K dwarfs\n\nFig. 6. The evolution of stars mimics lower values of the enrichment ratio. A 7 Gyr isochrone calculated for ∆Y/∆Z = 4\nand [Fe/H]=0 is very similar to a ZAMS with ∆Y/∆Z = 2 and\n[Fe/H]=0. The arrow indicates the effect of evolution on the position of the isochrones.\nsimulated stars have ages uniformly distributed between 0 and\n7 Gyr. The dashed line indicates the results when the [Fe/H] values associated to each star at a given age are the same as the\nones at the ZAMS; whereas the solid line indicates the results\nwhen diffusion is taken into account, i.e. the value at a given\ntime [Fe/H]t is different from [Fe/H]ZAMS . Even without taking into account diffusion, the method gives an output value of\n(∆Y/∆Z)out = 2.24 ± 0.51, quite different from (∆Y/∆Z)in = 4.\nWhen also diffusion is taken into account, the best fit value suffers an additional shift, with (∆Y/∆Z)out = 1.81 ± 0.63. Since\nwe don't know what is the real age distribution of the stars of\nour sample we can not really quantify the bias, but after many\nexperiments with several data set, we conclude that it must be of\nthe order of Bage (∆Y/∆Z) = −2 ± 0.5.\nThe effect of evolution on the derived enrichment ratio is\neasy to understand by looking at Fig. 6. Here two ZAMS\nwith different values of ∆Y/∆Z, namely 2 and 4, and same\n[Fe/H] = 0.0 are shown together with isochrones of 1 and 7 Gyr,\ncalculated with ∆Y/∆Z = 4 and [Fe/H] = 0.0; it is clear that evolution causes a shift of the whole curve towards redder colors4 in\na completely indistinguishable fashion as a lower ∆Y/∆Z does.\nAs a summary, this means that, even if our observational data\nset has been selected with a very strict cutoff of MV = 6 mag,\nevolutionary effects still play an important role. The real, unbiased value of ∆Y/∆Z coming out from our analisys has then to\nbe corrected, by subtracting Bage from the nominal value given\nby the Monte Carlo method. We then expect that the real value\nis higher by about two units than what can be found by blindly\napplying this method to the data.\n5.3. The effects of the uncertainty on the mixing-length\nefficiency\n\nThe current generation of stellar models is not yet able to firmly\npredict the effective temperature of stars with a convective envelope, such as those belonging to our sample. The reason is\nthat a satisfactory and fully consistent theory of convection in\n4\n\nA single star becomes hotter and more luminous after leaving the\nZAMS, here we are referring to the overall shape of the isochrones and\nZAMS in this range of magnitudes and colors.\n\n7\n\nFig. 7. Effect of changing the mixing length parameter from α =\n1.97 to 2.4 on the calculated ZAMS; all the models shown are\ncalculated for [Fe/H] = +0.2 dex. The arrows indicate in which\ndirection the ZAMS move in the CMD when increasing α (upper\narrow) or ∆Y/∆Z (lower arrow).\n\nsuperadiabatic regimes is still lacking, hence a very simplified\napproach is usually followed. The approach commonly adopted\nin the vast majority of evolutionary codes is to implement the\nmixing-length theory (Böhm-Vitense 1958), in which the average efficiency of convective energy transport depends on a free\nparameter α that must be calibrated. Our reference set of stellar\nmodels has been computed adopting our solar calibrated value\nof the mixing length parameter, namely α = 1.97. Nevertheless,\nwe calculated a whole new grid of models using α = 2.4 in order to evaluate the effect of this still uncertain parameter on the\nderived value of ∆Y/∆Z. As well known, the predicted effective\ntemperature of a stellar model with a convective envelope is an\nincreasing function of the value of the mixing length parameter\nα, as a consequence of the shallower temperature gradient due\nto a more efficient convective energy transfer.\nFigure 7 shows the effect of different adopted α values on the\ncalculated ZAMS. The assumed mixing-length parameter affects\nalso the inferred ∆Y/∆Z ratio, since it directly influences the predicted position in the HR diagram of the ZAMS models. As one\ncan easily see in Fig. 7, in order to recover the ZAMS locus of\nmodels computed with an higher value of α, a lower ∆Y/∆Z ratio is needed. Notice also that, the impact of the mixing-length\nefficiency on the predicted effective temperature of ZAMS models of the same chemical composition becomes progressively\nsmaller at faint magnitudes, i.e. for very low-masses. Such a behavior is the consequence of the almost adiabatic nature of convection in the envelopes of very-low mass stars (M . 0.7M⊙ ),\ncharacterized by high densities and low temperatures.\nSince an increase in α affects the models in the same direction as an increase in ∆Y/∆Z, we find, as expected, that our recovery method gives a lower value of the enrichment ratio when\nZAMS calculated for α = 2.4 are used, that is, (∆Y/∆Z)out =\n2.00 ± 0.61, quite different from (∆Y/∆Z)in = 4. This is shown in\nFig. 8 which reports the output of the Monte Carlo method, when\nthe same data set of Sect. 5.1 is used, i.e. a set of stars lying on\nthe ZAMS calculated with α = 1.97. We already mentioned that\nthe use of the solar calibration should be the safer choice when\ndealing with Main Sequence stars of solar-like masses such those\nof our data set. On the other hand, this numeric experiment allows to quantify the effect of a wrong assumption of the mixing\n\n\f8\n\nM. Gennaro et al.: ∆Y/∆Z from the analysis of local K dwarfs\n\nFig. 8. Results for the same data set of Fig.4. In this case we ran\nour Monte Carlo method using ZAMS calculated with a mixing\nlength parameter α = 2.4. Overplotted is the best-fit gaussian.\n\nFig. 9. ZAMS transformed into the observational plane using\nPHOENIX (solid lines) and ATLAS9 (dashed lines) model atmospheres. All the ZAMS shown have been calculated with\n∆Y/∆Z = 4 and [Fe/H] = -0.6 (left) or +0.2 (right).\n\nGlass photometric system zero points are those of Table A1 in\nBessel, Castelli & Plez (1999).\nBoth model atmosphere grids completely cover our range of\nT eff , log g and [Fe/H]. An exhaustive description of these models\nis far beyond the scope of this paper, nevertheless we want to\nmention briefly some of the most important differences between\nthem. The ATLAS9 code solves the radiative transfer equation\nin a plane parallel atmosphere, while PHOENIX code takes into\naccount the curvature of the atmosphere, even though in spherical symmetry, i.e. keeping a 1D approach. This difference is not\nvery important for dwarf stars, for which the curvature (i.e. the\nratio of the extent of the atmosphere to the radius of the base\nof the atmosphere) is very small. More important is the different database of molecular opacities for the two models. While\natomic opacities databases are similar between the two models,\nPHOENIX models include a lot of molecular species (∼ 650)\nand molecular transitions (∼ 550 millions) which play an important role for low mass stars, specially as the metallicity increases.\nFigure 9 shows the comparison between ZAMS models\ntransformed using the two sets of model atmosphere. It is evident how the PHOENIX ZAMS are always redder in the B − V\ncolor than the ATLAS9 ones at fixed magnitude. Moreover the\ndifferences in stellar colors increase with decreasing mass (increasing magnitude) and also, at a given magnitude, the differences increase with increasing metallicity (from left to right in\nFig. 9). Note that both a lower temperature and a higher metal\ncontent favor the formation of chemical composites; in particular\nthe first molecules start forming when the effective temperatures\ndrops below ∼ 4000K.\nThe sizeable difference in magnitude and color index between the same theoretical ZAMS transformed into the observational plane by the two quoted model atmospheres, directly\ntranslates into a large difference in the inferred ∆Y/∆Z value.\nWe used the ATLAS9 ZAMS, running our recovery method on\na simulated data set with (∆Y/∆Z)in = 4 but generated using the\nPHOENIX ZAMS. The ATLAS9 ZAMS are so much bluer than\nthe PHOENIX ones that in each iteration of the method we always find the lowest possible value of (∆Y/∆Z)out available in\nour grid of models, i.e. 0.5.\nThe uncertainty due to the chosen model atmosphere is then\nby far the most severe source of uncertainty affecting the final\nvalue of the enrichment ratio, at least among the uncertainties\ncoming from the models side.\n5.5. The effects of different choices for the heavy elements\nmixture\n\nlength parameter in the adopted stellar models on the inferred\nhelium-to-metals enrichment ratio.\n5.4. The effects of different transformations from the\ntheoretical to the observational plane\n\nTo compare observational data with stellar models, one needs to\ntransform the theoretical predictions of evolutionary codes from\nthe (log T eff , log L/L⊙ ) plane (HR diagram) to the observational\nplane, in our case the (B − V, MV ) Color-Magnitude diagram. A\ncommon procedure is to use synthetic stellar spectra, calculated\nusing model atmosphere codes, and to convolve them with the\nfilter throughput of the photometric system needed; this technique, referred to as synthetic photometry is described in detail\nin, e.g. Girardi et al. (2002). We transformed our models using\nPHOENIX (Brott et al. 2005) and ATLAS9 (Castelli & Kurucz\n2003) model atmospheres; the UBVRIJHKL Johnson-Cousin-\n\nAs previously explained, all the models in our grid have\nbeen calculated using the solar-scaled mixture by Asplund et al.\n(2005), hereafter AGS05. A new version of the solar mixture\nhas been recently published by the same group in Asplund et al.\n(2009), hereafter AGSS09. The true dependence of the inferred\n∆Y/∆Z on the mixture choice could be evaluated only by recalculating an equivalent grid of models using the new mixture\nand by re-running the whole procedure illustrated in this work.\nHowever, the exact determination of the solar mixture is still\nan open problem, thus a recalculation of all the models is not\nneeded, in our opinion, until this issue will be definitively settled. Nevertheless, to have an idea of the influence of a variation\nof the solar mixture on our results, we computed two new sets\nof ZAMS with different mixtures and compared them with our\nreference AGS05 ZAMS in the CMD. This gives at least an indication of how the inferred enrichment ratio may depend on the\nmixture. In addition to the ZAMS for AGS05 and AGSS09 mix-\n\n\fM. Gennaro et al.: ∆Y/∆Z from the analysis of local K dwarfs\n\n9\n\nTable 2. Y and Z values for the three different adopted mixtures\n(see text in Sect. 5.5), for two reference values of [Fe/H] and\n∆Y/∆Z = 4. The solar (Z/X)⊙ values corresponding to the three\nmixtures are also indicated.\n\n[Fe/H] = -0.6\n[Fe/H] = 0.2\n\nFig. 10. ZAMS calculated for the three different mixtures,\nGN93, AGS05 and AGSS09, with ∆Y/∆Z = 4 and [Fe/H] = 0.6 (lower B-V values) or [Fe/H] = +0.2 (higher B-V values).\ntures, we also computed and compared ZAMS calculated with\nthe older mixture by Grevesse & Noels (1993), hereafter GN93,\nstill widely used in the literature. We highlight the fact that\nwe can control the effect of the mixture changes on the stellar\nstructure, by using opacity tables calculated with different mixtures both for the high-temperature (OPAL) and low-temperature\n(Ferguson et al. (2005)) opacities. On the other hand we can not\nevaluate the effects of different mixtures on the model atmosphere, i.e. on the transformation of our theoretical models from\nthe theoretical HR diagram to the CMD, since PHOENIX synthetic spectra are available only for a single mixture of heavy\nelements.\nThe effect of the adopted solar mixture on the models is\ntwofold. First, for a given global metallicity Z, changing the internal distribution of metals will mainly affect the opacity and\nthe nuclear burning efficiency (via the CNO abundances). For\nmodels with the same Y and Z, the ZAMS computed with the\nGN93 mixture are bluer than that with the AGSS09 one, which,\nin turn, is bluer than the ZAMS computed with the AGS05\nmixture (see e.g. Degl'Innocenti, Prada Moroni & Ricci 2006;\nTognelli, Prada Moroni & Degl'Innocenti 2010). Second, for a\ngiven choice of the two values of ∆Y/∆Z and [Fe/H], it is clear\nfrom the coupled equations (1) and (2) that the values of Y and\nZ will be different, given the different values of (Z/X)⊙. More in\ndetail, the GN93 mixture provides models with higher Z. These\nmodels are thus redder on the CMD, than those calculated with\nAGSS09 mixture. The latter mixture, in turn, provides models\nthat have higher Z and appear redder than the AGS05 mixture.\nThus, the effects on the opacity and on the scaling, i.e. the actual value of Z given [Fe/H] and the different (Z/X)⊙, affect the\nZAMS position in opposite directions.\nWe calculated models for the two additional mixtures by fixing ∆Y/∆Z = 4 and choosing the two values [Fe/H] = -0.6 and\n0.2. The results of the calculations are shown in Fig. 10. The\ncorresponding Y and Z values for each mixture are shown in\nTable 2. From Fig. 10 one can see that GN93 models seem to be\nslightly redder than our reference AGS05 models; when compared to observational data, an higher value of ∆Y/∆Z would\nthen be needed to reproduce observations, as compared to the\nAS05 mixture. AGSS09 ZAMS go in the opposite direction\nmeaning that the inferred value of the enrichment ratio would\nbe lower when compared to AGS05. In the comparison between\nAGS05 and AGSS09, which have quite similar (Z/X)⊙, the ef-\n\n\u0010 \u0011 GN93\nZ\n= 0.0245\nX ⊙\nY = 0.2660\nZ = 0.00449\nY = 0.3458\nZ = 0.0245\n\n\u0010 \u0011 AGS05\nZ\n= 0.0165\nX ⊙\nY = 0.2602\nZ = 0.00305\nY = 0.3178\nZ = 0.0174\n\n\u0010 \u0011AGSS09\nZ\n= 0.0181\nX ⊙\nY = 0.2614\nZ = 0.00334\nY = 0.3235\nZ = 0.0189\n\nfect on the opacity and burning efficiency seems to prevail on the\nscaling; viceversa in the comparison between AGS05 and GN93,\nthe huge difference in (Z/X)⊙ compensates for the opacity effect,\nand the much higher Z value in the GN93 case brings the ZAMS\nmodels toward redder colors when compared to AGS05.\nThe relative behavior of different ZAMS is moreover a non\ntrivial function of the actual value of [Fe/H], given the non linear\nrelation between the two couples of values (∆Y/∆Z, [Fe/H]) 7→\n(Y, Z), represented by the two equations (1) and (2). Overall it\nseems that changing the mixture affects our method in a non\nnegligible way, but a totally consistent check could be done\nonly when the appropriate model atmospheres are used to do\nthe transformation from the HR diagram to the CMD and only\ncalculating complete grids of models for different mixtures.\n\n6. Results using the observational data\nAfter having carefully checked the capability of our recovery\nmethod and having studied many uncertainty sources by means\nof controlled artificial data sets, we applied the above technique\non the sample of real observational data described in Sect. 3.\nFigure 3 shows the result of the Monte Carlo recovery\nmethod applied to the local low-MS field stars, which provides a\nnominal value of the enrichment ratio of ∆Y/∆Z = 3.32 ± 1.29.\nThis result for the enrichment ratio is obtained using our\nfavorite set of models, i.e. ZAMS calculated with the solar\nα = 1.97 and transformed using the PHOENIX model atmospheres. We showed in Sects. 5.3 and 5.4 the significative effects\non the inferred helium-to-metals enrichment ratio of a different\nchoice of the mixing length parameter α and of the model atmosphere, respectively, in the case of synthetic data. The recovery\nprocedure applied to the real observational data provides a nominal value of the enrichment ratio of ∆Y/∆Z = 1.59 ± 1.01 adopting the set of theoretical models computed with α = 2.4 and\ntransformed into the observational plane by means of PHOENIX\natmosphere models and ∆Y/∆Z = 0.5 adopting our standard set\nof models with α = 1.97 but the ATLAS9 atmosphere models.\nMoreover, we will show a self-consistency check in Sect. 8,\nto prove that inside our choice the result we obtain for ∆Y/∆Z\ncan be used to calculate models that fit very well an independent\ndata set, in particular the Hyades main sequence.\nIn Sect. 3 we mentioned the fact that the fit of a gaussian distribution to the histogram of occurrences of Fig. 3 is\nnot perfect. The actual distribution looks quite flat in the range\n∆Y/∆Z ∈ [2, 4] and the σ of the fitting gaussian is twice as\nlarge than what we would expect from the observational uncertainties alone (see Sect. 5.1). We also mentioned that our\n[Fe/H] estimates come from two different catalogs, and that the\nN04 data have been re-zeroed according to T05 transformations.\nNevertheless, when considering the two subsets of data separately, a large difference in the final result is still visible, as if the\n\n\f10\n\nM. Gennaro et al.: ∆Y/∆Z from the analysis of local K dwarfs\n\nFig. 11. Results of our Monte Carlo method when applied separately to the subsets of objects with [Fe/H] from T05 and N04\n(the latter corrected using Table 10 of T05). The solid lines are\nfor T05, the dashed for N04. Overplotted are the best-fit gaussians.\ndifferent [Fe/H] scale adopted, even after the re-zeroing, would\nmimic a bimodal chemical composition distribution. From Fig.\n11 it is clear that the two results for the separate subsets are inconsistent at 1σ level. The final result we get for the whole set, is\nthen an average of the two distributions of Fig. 11; unfortunately\nthis method is quite sensitive to the adopted scale of [Fe/H] determinations. We won't choose any of the two subsets as the best\none, we just state that systematics is probably still affecting the\n[Fe/H] of our objects, even after the correction of N04 zero point.\nAnyway, in order to proceed further with the analysis we will\nuse the results of the gaussian fit to the histogram of occurrences\nfor the whole sample of data as our nominal value for ∆Y/∆Z.\nAs we showed in Sect. 5.2, to obtain the real ∆Y/∆Z value, the\nnominal value of ∆Y/∆Z = 3.32 ± 1.29 provided by the recovery method must be corrected for the age-bias, i.e. the artificial\nshift in the recovered value of the enrichment ratio caused by\nneglecting evolutionary effects and diffusion. We estimated the\nextent of such a correction to be of Bage = −2 ± 0.5 by means of\nMonte Carlo simulations. Thus, the final corrected value of the\nhelium-to-metals enrichment, combining the errors in quadrature is ∆Y/∆Z = 5.3 ± 1.4.\n\n7. A possible non-linear relation between Y and Z ?\nIn their recent work, Casagrande et al. (2007) suggested that the\nassumption of a linear relation between metals and helium enrichment of the ISM, which leads to the definition of the enrichment ratio itself (see Equation 1) may not necessarily be valid.\nWe tried to check whether it is possible to unambiguously infer such a non linear behavior from the presently available data\naccurateness. We performed the test by means of an artificial\nand controlled data set built interpolating our stellar models. The\nsynthetic stellar sample mimics the main characteristics of the\nreal data set. In particular, we simulated stars divided in metallicity bins 0.1 dex wide in the range [Fe/H] ∈ [−0.6, +0.2], with\nthe same number of stars in each bin as our observational data,\nfor a total number of 103 objects. To avoid the additional difficulties introduced by the age-bias, the simulated stars were taken\n\non their ZAMS position. We then ran our Monte Carlo method\nbin by bin to see whether our recovery is able to recover the input value for ∆Y/∆Z in each bin, given the typical observational\nerrors on our objects.\nFigure 12 shows the outcome of such an experiment. On the\ntwo panels each point represents the result of the Monte Carlo\nmethod when applied to the corresponding [Fe/H] bin, with its\n1σ uncertainty; both values come from the gaussian fitting of\nthe histogram of occurrences. The dashed lines represent the results of the gaussian fit the histogram of occurrences when the\nmethod is applied to the whole sample of simulated stars; the\nshaded area corresponds to the 1σ uncertainty around the mean.\nThe two panels represent results for two different ways of binning the data; on the left panel we show the results when data\nare binned in 0.1 dex wide non overlapping bins; on the right\npanel the results are for 0.2 dex wide bins, in this case adjacent\nbins have an overlap of 0.1 dex, meaning e.g. that a [Fe/H] =\n-0.35 star can be found in both the [-0.5, -0.3] and the [-0.4, 0.2] bins. Regardless from the way the binning is performed, it\nfollows from this numerical experiment that the method works\nfine only for [Fe/H] values equal or greater than -0.3 dex. ∆Y/∆Z\ndeterminations with this method, considering only lower values\nof the metallicity are unreliable. The missing points in the two\npanel, correspond to bins where the gaussian fit failed, simply\nbecause the histogram of occurrences is too irregular to be fitted\nby a gaussian.\nHence any discussion on a possible non linearity of the\nhelium-to-metals enrichment relation, extending over a wide\nrange of metallicities, can not be carried on when Y and Z value\nare determined from low-main sequence fitting. The fine structure of the low main sequence at values of the metallicity lower\nthan -0.3 dex is indeed too weakly dependent on the chemical\ncomposition, to be used to infer any non linear behavior of the\nISM enrichment in helium and metals. This is quite clear from\nthe right panel of Fig. 2, which shows that the separation among\ncurves with different ∆Y/∆Z becomes progressively smaller and\nsmaller as the [Fe/H] decreases. At low enough values of [Fe/H],\nthis separation is simply too small with respect to the spread of\nthe observed point, due to the current uncertainties in both magnitudes and [Fe/H], which are of the order of 0.1 mag and 0.1 dex\nrespectively, to allow a correct determination of the stars chemical composition. This uncertainty is reflected in the large error\nbars of the lower metallicity bins of Fig. 12.\nWe are not claiming that any non linear law for the heliumto-metals enrichment of the ISM must be ruled out; we are just\nstating that better data are needed to confirm this possibility by\nmaking use of the fine structure of the low main sequence. The\nGAIA mission will provide us with better parallaxes, which will\nyield better absolute magnitude determinations. Advances in 3D\nand NLTE stellar atmospheres modeling will also produce better constrained spectroscopic abundances determinations in the\nfuture.\n\n8. The Hyades test\nAs previously discussed, the ∆Y/∆Z provided by the recovery\nprocedure must be corrected for the age-bias, since the above\ndescribed technique uses the theoretical ZAMS loci as reference\nmile stones in the CMD. Hence, any unaccounted displacements\nof the observed stars from the ZAMS due to evolutionary effects\ntranslates directly in an underestimate of the inferred ∆Y/∆Z.\nClearly, the younger the stellar sample analyzed, the smaller\nsuch unaccounted displacements and the smaller the related agebias.\n\n\fM. Gennaro et al.: ∆Y/∆Z from the analysis of local K dwarfs\n\n11\n\nFig. 12. Output values of the recovery method when data are binned in metallicity (see text for details). The green dashed lines\nrepresent the (∆Y/∆Z)out when the whole simulated sample is used. The input value is (∆Y/∆Z)in = 4.\nTo safely neglect any possible bias due to evolution,\nwe also applied our recovery method to a very young stellar sample: the stars of the lowest part (MV ≥ 5.2) of the\nHyades MS. For this well studied cluster an age of about\n500 ÷ 600 Myr is generally estimated (see e.g. Perryman et al.\n1998;\nCastellani, Degl'Innocenti & Prada Moroni\n2001;\nCastellani et al. 2002). Thus, the selected low luminosity\nstars, which correspond to masses lower than about 0.9M⊙ ,\nare really on, or at least very close to, their ZAMS position.\nMoreover, the data available for this cluster are even more\nprecise than those of our data set for field stars in the solar\nneighborhood; using the kinematically corrected parallaxes\ndata from Madsen, Dravins & Lindegren (2002) the typical\nerrors are σ(MV ) ≃ 0.05 mag and σ(B − V) ≃ 0.02 mag.\nThe metallicity value we use for the Hyades is taken from\nPerryman et al. (1998): [Fe/H] = 0.14 ± 0.05 dex.\nBy running our Monte Carlo method, the value found for\nthe enrichment ratio is (∆Y/∆Z)Hyad = 4.75 ± 0.35, in perfect\nagreement with what we found using local MS stars and taking\ninto account the evolutionary bias.\nTo further check the consistency of this final result, we calculated isochrones using the closest value of the enrichment ratio in our grid, i.e. ∆Y/∆Z = 5, and for the extreme values of\nPerryman et al. (1998) [Fe/H] interval, i.e. 0.09 and 0.19 dex.\nModels are calculated for our solar calibrated value of the mixing length parameter and transformed to the observational plane\nusing PHOENIX model atmosphere. Average extinction towards\nthe Hyades is negligible and this cluster is old enough not to\npresent any intra-cluster material, so also differential extinction\ncan be ignored; hence we assume (B − V)0 = (B − V)obs .\nFigure 13 shows the CMD of the Hyades with overimposed\nour isochrones. The good agreement between our models with\nthe chemical composition derived by the recovery method and\nthe Hyades data is quite encouraging and make us confident\nabout the adopted procedure. Even more important is that the\nfit to the Hyades MS is good also at higher luminosities. Stars\nwith M & 1.2M⊙ (corresponding to a magnitude MV . 3.6, the\nexact value depending on chemical composition and age) have\nessentially radiative envelopes, meaning that their predicted temperatures are not affected by the choice on the mixing length\nparameter, α.\n\nFig. 13. The CMD for the Hyades Main Sequence. Isochrones\nfor two values of the age are overplotted: 500 Myr (black lines)\nand 600 Myr (red lines). Dashed and solid lines correspond to\ntwo different values of the chemical composition. Y and Z values\nare obtained from Equations (1) and (2) using [Fe/H] = 0.09 dex\n(dashed lines) and [Fe/H] = 0.19 dex (solid lines).\n\n9. Comparison with independent methods\nMany independent approaches have been followed in the past\nto determine the helium-to-metals enrichment ratio. A detailed\ncomparison between the value of helium-to-metal enrichment\nratio ∆Y/∆Z obtained by means of different techniques is beyond\nthe aim of the paper, since it would require a careful discussion\nof the different uncertainty sources, both systematics and random, affecting the various techniques. Furthermore, the primordial helium abundance Y p adopted by different authors and/or\nin different periods can be very different, affecting the inferred\n∆Y/∆Z value. On the other hand, we think that a brief description of the results provided by different approaches might be of\ninterest.\nOne of the most fruitful consists in observing HII regions in the Milky Way and in other galaxies. The pioneering papers by Peimbert & Torres-Peimbert (1974, 1976) and by\nLequeux et al. (1979), devoted respectively to the HII regions\n\n\f12\n\nM. Gennaro et al.: ∆Y/∆Z from the analysis of local K dwarfs\n\nin the Magellanic Clouds and in irregular and blue compact\ngalaxies, derived a value of the helium to metals enrichment ratio of ∆Y/∆Z ≈ 3. From observations of extragalactic HII regions, Pagel et al. (1992) found that ∆Y/∆Z ≥ 3, with a preferred value close to 4, while Peimbert et al. (2000) obtained\n∆Y/∆O = 3.5 ± 0.9 from NGC346, the brightest HII region in\nSMC. A detailed study of a very large sample of spectroscopic\nobservations of HII regions in blue compact galaxies performed\nby Izotov & Thuan (2004) led to ∆Y/∆Z = 2.8 ± 0.5. However,\na reanalysis of the same data by Fukugita & Kawasaki (2006)\nprovides ∆Y/∆Z = 4 − 5, values that becomes as low as 1.1± 1\nif stellar absorption is taken into account.\nFrom observations of galactic HII regions, such as the Orion\nnebula, M8 and M17, various authors found ∆Y/∆Z > 2 (see\nalso Esteban at al. 1999; Deharveng et al. 2000). As an example Peimbert et al. (2000) found ∆Y/∆Z = 2.1 ± 0.6 adopting\na temperature fluctuation parameter t2 = 0.037 (recommended)\nand 3.8 ± 1.1 adopting t2 = 0.000. More recently, Balser (2006)\nderived ∆Y/∆Z = 1.41 ± 0.62 from the analysis of the sole M17\nand S206, whereas taking into account also the HII regions belonging to the Magellanic Clouds and metal-poor galaxies, she\nfound ∆Y/∆Z = 1.6. The last author warns also on the systematic underestimation of the measured helium abundance caused\nby a clumping in HII regions (see also Mathis & Wood 2005).\nFinally, a new estimate of the chemical composition of M17\nby Carigi & Peimbert (2008) yields ∆Y/∆Z = 1.97 ± 0.41 and\n4.00 ± 0.75 adopting t2 = 0.036 and 0.000, respectively.\nA useful technique to empirically constrain the stellar\nhelium to heavier elements enrichment ratio is the analysis of\nthe chemical composition of planetary nebulae (PNe). These\nobjects present the advantage of being numerous in a large\nrange of metallicity and of allowing precise estimates of helium\nabundance. On the other hand, it is a well established result\nof stellar evolution that the chemical composition of low and\nintermediate mass stars, i.e. the PNe's progenitors, is strongly\nmodified by the dredge-up episodes, which enrich the envelope\nwith inner material previously processed by nuclear reactions,\nthat is mainly with fresh helium and, in the case of III dredge-up\nin thermally pulsating AGB stars, also with heavier elements,\nmainly carbon. Thus, the chemical composition of PNe is not\nrepresentative of the protostellar cloud and in order to derive\nthe original interstellar abundances a correction must be applied\nwhich takes into account the evolution of the surface abundances\nof the progenitor star. In the early attempts to determine the\n∆Y/∆Z ratio using the PNe in the late '70s, such a correction was\nneglected and values in the range 2.2-3.6 were obtained (see e.g.\nDodorico, Peimbert & Sabbadin 1976; Peimbert & Serrano\n1980). In our knowledge, Chiappini & Maciel (1994) were the\nfirst to take into account the correction due to the evolution of\nthe progenitor star and they obtained 4 ≤ ∆Y/∆Z ≤ 6.3. More\nrecently, Maciel (2001) found 2.8 ≤ ∆Y/∆Z ≤ 3.6 adopting\nYP = 0.23 and 2.0 ≤ ∆Y/∆Z ≤ 2.8 with YP = 0.24.\nAn important independent constraint on the stellar helium to\nheavier elements enrichment ratio is provided by the Sun, for\nwhich very detailed and accurate data are available. In order to\nderive the ∆Y/∆Z ratio from the Sun, the precise spectroscopic\nestimates of the solar photospheric chemical composition are not\nenough because they significantly differ from the original ones\ndue to diffusion and gravitational settling. Thus, one has to rely\non a standard solar model (SSM), that is, a stellar model of 1\nM⊙ which at the age of the Sun (i.e. ≈4.56 Gyr) fits the solar observables. As a result of such a procedure, the initial metallicity\nZ⊙ and helium Y⊙ abundance are inferred. As largely debated\nin recent years (see e.g Bahcall et al. 2005b; Basu & Antia\n\nTable 3. Initial helium Yini and metal Zini abundances provided\nby recent standard solar models by different authors (see footnotes). Models are computed adopting the heavy element mixture by Asplund et al. (2005).\nModels\nPisaa\nB2005b\nG2006c\nS2009d\nS2009be\na\nb\nc\nd\ne\n\nYini\n0.2532\n0.2614\n0.2570\n0.2593\n0.2617\n\nZini\n0.0137\n0.0140\n0.0135\n0.0139\n0.0149\n\n∆Y/∆Z\n0.380\n0.957\n0.666\n0.813\n0.919\n\nTognelli, Prada Moroni & Degl'Innocenti (2010)\nBahcall, Serenelli & Basu (2005)\nGuzik, Watson & Cox (2005)\nSerenelli et al. (2009)\nSerenelli et al. (2009), mixture by Asplund et al. (2009)\n\n2008; Christensen-Dalsgaard et al. 2009; Serenelli et al. 2009,\nand references therein), the very good agreement between the\nSSM and the helioseismological constraints, mainly the sound\nspeed profile, the extension of the convective envelope and the\nsurface helium abundance, achieved at the end of the last century\nhas been compromised by the new determinations of the metal\nabundances based on 3D photospheric models by Asplund et al.\n(2005), and only slightly alleviated by the very recent release by\nAsplund et al. (2009). With these caveats, the initial helium and\nmetal abundance of the Sun provided by the current SSMs allow\nto constrain the ∆Y/∆Z, once a primordial helium abundance YP\nis chosen. Table 3 shows the results of SSMs computed by different groups by assuming different solar heavy elements mixtures. As can be easily seen, different authors provide values in\ngood mutual agreement, values that translate in ∆Y/∆Z < 1, if\nYP = 0.248 by Izotov, Thuan & Stasi (2007) is used.\nIn principle the ∆Y/∆Z ratio can also be theoretically\npredicted by models of galactic chemical evolution. These\npredictions rely on several assumption on the initial mass\nfunction, star formation rate, star formation efficiency, stellar\nyields from intermediate and massive stars, ISM mixing; so\neven though they are quite powerful, due to the uncertainties on each of the aforementioned quantities they are still\nquite uncertain in predicting the expected helium to metals\nenrichment ratio and provide values which span a range\nof ∆Y/∆Z between about 1 and 4 (Serrano & Peimbert\n1981; Timmes, Woosley & Weaver\n1995; Tosi\n1996;\nChiappini, Matteucci & Gratton\n1997;\nFields & Olive\n1998; Carigi 2000; Chiappini, Renda & Matteucci 2002;\nRomano et al. 2005; Carigi & Peimbert 2008). Among the parameters that mostly affect the outcomes of chemical evolution\nmodels we mention some of the most important, such as the\nSN Ia rate, which strongly affects the iron enrichment, the star\nformation history and the initial mass function, since stars of\ndifferent mass, which evolve on different time scales, contribute\ndifferently to the production of Y and Z; the maximum stellar\nmass that enriches the interstellar medium is an other important\nparameter. Moreover, as far as the chemical enrichment of\nthe interstellar medium is concerned, stellar models, which\nprovide the yields to chemical models, are still significantly\naffected by poorly understood physical processes, such as convection, which affects the stellar yields through the efficiency\nof dredge-up phenomena and hot-bottom burning, mass-loss,\nwhich directly influence the enrichment, and rotation, which\nhas a strong impact on the helium, carbon, nitrogen and oxygen\n\n\fM. Gennaro et al.: ∆Y/∆Z from the analysis of local K dwarfs\n\nyields (Meynet & Maeder 2002). As a consequence, stellar\nyields provided by different authors still show not negligible\ndiscrepancies. Thus, the results of chemical evolution models\ndepend on the adopted set of stellar yields (Fields & Olive\n1998; Carigi 2000; Chiappini, Matteucci & Meynet 2003). For\nexample, it has long been known that the ∆Y/∆Z ratio grows by\nincreasing the mass-loss rate of both intermediate and massive\nstars (see e.g. Iben & Truran 1978; Renzini & Voli 1981;\nPeimbert 1986).\nChiappini, Matteucci & Meynet (2003) predicted a value\nof the enrichment ratio ∆Y/∆Z ∼ 2.4, if the stellar models by Meynet & Maeder (2002), which take into account rotation, are adopted in their chemical evolution model, whereas\na value of 1.5 is obtained, if the stellar computations by\nvan den Hoek & Groenewegen (1997), for the low and intermediate mass stars, and Woosley & Weaver (1995), for the massive ones, are used. The recent version of the chemical evolution\nmodel by Carigi & Peimbert (2008) provides ∆Y/∆Z =1.70 and\n1.62, if high or low wind yields are adopted, respectively.\n\n10. Conclusions\nThe principal aim of this work was to test the reliability of the\ndetermination of ∆Y/∆Z by the comparison between low-MS\nstars and theoretical ZAMS models. A very fine grid of stellar\nmodels has been computed for many values of ∆Y/∆Z, [Fe/H]\nand masses adopting two different mixing-length parameters α,\nnamely 1.97 (our solar calibration) and 2.4, and two different sets\nof atmosphere models to transform luminosities and effective\ntemperatures into magnitudes and color indices, the PHOENIX\nGAIA v2.6.1 models (Brott et al. 2005) and the ATLAS9 ones\n(Castelli & Kurucz 2003), respectively.\nA detailed analysis of the capabilities of the method and of\nthe main uncertainty sources affecting the derived results has\nbeen performed by means of many numerical experiments on\nsynthetic data set produced under controlled conditions and with\nprecisely known properties.\nOne of the main findings of the paper is that the inferred\nvalue of ∆Y/∆Z is quite sensitive to the age of the stellar sample,\neven in the case in which only very faint (i.e. MV > 6 mag) MS\nstars are selected. By means of numerical experiment we showed\nthat the lack of an age estimate of low mass field stars leads to\nan underestimate of the inferred ∆Y/∆Z of about 2 units. As a\nconsequence, the face value of the helium-to-metals enrichment\nratio provided by the recovery procedure applied to the solar\nneighborhood stellar sample must be corrected for this age-bias.\nAdopting our reference set of models (i.e. those with our \"solar\" calibrated α) transformed into the observational plane using the PHOENIX GAIA v2.6.1 model atmospheres, we found\n∆Y/∆Z = 5.3 ± 1.4.\nSuch a result has been checked against an independent and\nvery accurate data set, that is, the low-MS of the Hyades cluster.\nThis sample has the additional advantage to be unaffected by the\nage-bias, since its very young age (i.e. 500÷600 Myr) guarantees\nthat the low-mass (< 0.9M⊙ ) MS stars which constitutes the\nsample are essentially unevolved. The recovery method provided\nagain ∆Y/∆Z = 4.75 ± 0.35, in perfect agreement with the result\nfor field stars.\nTo further check the consistency of this final result, we calculated isochrones with ∆Y/∆Z = 5 (the closest in our grid of\nmodels) and the measured [Fe/H] of Hyades. The good agreement between these isochrones and the Hyades MS, not only in\nthe faint part belonging to the sample but also at higher luminosi-\n\n13\n\nties, is a further proof of the internal consistency of the recovery\nprocedure.\nThe effect of a change in the assumed efficiency of the superadiabatic convection (i.e. the α parameter) in the stellar models used to build the ZAMS and in the adopted atmosphere\nmodels used to transform luminosities and effectives temperatures into magnitudes and color indices has been discussed, too.\nMore in detail, the recovery method yield a nominal value of\n∆Y/∆Z = 1.59 ± 1.01 when adopting the set of theoretical models computed with α = 2.4 and transformed into the observational plane by means of PHOENIX atmosphere models and\n∆Y/∆Z = 0.5 when adopting our standard set of models with\nα = 1.97 but the ATLAS9 atmosphere models. These values become about 3.6 and 2.5, respectively, once corrected for the age\nbias.\nOur data have [Fe/H] determinations coming from two different sources, i.e. Nordström et al. (2004) and Taylor (2005)\ncatalogs. The 4 stars we have in common from the two catalogs\nshow a disagreement in the [Fe/H] scale between the two catalogs. This disagreement was already identified in Taylor (2005)\nand the author provides a Table to account for it and put the two\ncatalogs on the same [Fe/H] scale. Nevertheless, even after the\nre-zeroing procedure suggested by Taylor (2005), we still find\nsome disagreement in the final results on ∆Y/∆Z when the two\ncatalogs are considered separately. Probably an even more accurate study of the zero points of metallicity determinations is\nneeded.\nAcknowledgements. We are very grateful to Emanuele Tognelli for his contribution to the updating of the code and to Steven N. Shore for the many pleasant\ndiscussions on the topic. PGPM thanks Wolfgang Brandner for the kind hospitality at Max-Planck-Institute for Astronomy, Heidelberg, where a part of the paper\nhas been written. This work has been supported by PRIN-MIUR 2007 (Multiple\nstellar populations in globular clusters: census, characterizations and origin, PI\nG. Piotto)\n\nReferences\nAsplund, M., Grevesse, N., & Sauval, A.J. 2005, in \"Cosmic Abundances as\nRecords of Stellar Evolution and Nucleosynthesis\", eds. F.N. Bash, & T.J.\nBarnes, ASP Conf. Series, 336, 25\nAsplund, M., Grevesse, N., Sauval, A. J., Scott, P. 2009, ARA&A, 47, 481\nBahcall, J. N., Basu, Pinsonneault, M., S.Serenelli, A. M. 2005b, ApJ, 618, 1049\nBahcall, J. N., Serenelli, A. M., & Basu, S. 2005, ApJ, 621, L85\nBalser, D. S. 2006, AJ, 132, 2326\nBasu, S., & Antia, H. M. 2008, Phys. Rep., 457, 217\nBöhm-Vitense, E. 1958, Zs.f.Ap., 46, 108\nBessell, M. S., Castelli, F. & Plez, B. 1999, A&A, 333, 231\nBrott, I., & Hauschildt, P. H. 2005, ESA Special Publication, 576, 565\nCarigi, L. 2000, RMxAA, 36, 171\nCarigi, L., & Peimbert, M. 2008, RMxAA, 44, 341\nCasagrande, L., Flynn, C., Portinari, L., Girardi, L., Jimenez, R. 2007, MNRAS,\n382, 1516\nCastellani, V., Degl'Innocenti, S., & Marconi, M. 1999, A&A, 349, 834\nCastellani, V., Degl'Innocenti, S., & Prada Moroni, P. G. 2001, MNRAS, 320,\n66\nCastellani, V., Degl'Innocenti, S., Prada Moroni, P. G., Tordiglione, V. 2002,\nMNRAS, 334, 193\nCastelli, F. & Kurucz, R. L., IAU Symposium, 210, 20\nChiappini, C., & Maciel, W. J. 1994, A&A, 288, 921\nChiappini, C., Matteucci, F., & Gratton, R. 1997, ApJ, 477, 765\nChiappini, C., Matteucci, F., Meynet, G. 2003, A&A, 410, 257\nChiappini, C.; Renda, A.; Matteucci, F. 2002, A&A, 395, 789\nChieffi, A., & Straniero, O. 1989, ApJS, 71, 47\nChristensen-Dalsgaard, J., di Mauro, M. P., Houdek, G., Pijpers, F. 2009, A&A,\n494, 205\nChurchwell, E., Mezger, P. G., & Huchtmeier, W. 1974, A&A, 32, 283\nDeharveng, L., Pena, M., Caplan, J., Costero, R. 2000, MNRAS, 311, 329\nDegl'Innocenti, S., Prada Moroni, P.G., & Ricci, B. 2006, Ap&SS, 305, 67\nDegl'Innocenti, S., Prada Moroni, P.G., Marconi, M., & Ruoppo, A. 2008,\nAp&SS, 316, 25\n\n\f14\n\nM. Gennaro et al.: ∆Y/∆Z from the analysis of local K dwarfs\n\nDodorico, S., Peimbert, M., & Sabbadin, F. 1976, A&A, 47, 341\nDunkley, J., et al. 2009, ApJS, 180, 306\nThe Hipparcos and Tycho Catalogues (ESA 1997)\nEsteban, C., Peimbert, M., Torres-Peimbert, S., Garcia-Rojas, J. 1999, RMxAA,\n35, 65\nFaulkner, J., 1967, ApJ, 147, 617\nFields, B. D., & Olive, K. A. 1998, ApJ, 506, 177\nFerguson, J.W., Alexander, D.R., Allard, F., et al. 2005, ApJ, 623, 585\nFernandes, J., Lebreton, Y., Baglin, A. 1996, A&A, 311, 127\nFukugita, M., & Kawasaki, M. 2006, ApJ, 646, 691\nGirardi, L., Bertelli, G., Bressan, A. et al. 2002, A&a, 391, 195\nGrevesse, N., & Noels, A. 1993, Origin and Evolution of the Elements, 15\nGuzik, J. A., Watson, L. S., & Cox, A. N. 2005, ApJ, 627, 1049\nHolmberg, J., Nordström, B. & Andersen, J. 2007, A&A, 475, 519\nIben, I., Jr., & Truran, J. W. 1978, ApJ, 220, 980\nIglesias, C., & Rogers, F.J. 1996, ApJ, 464, 943\nIzotov, Y. I., & Thuan, T. X. 2004, ApJ, 602, 200\nIzotov, Y. I., Thuan, T. X., & Lipovetsky V. A. 1994, ApJ, 435, 647\nIzotov, Y. I., Thuan, T. X., & Lipovetsky V. A. 1997, ApJS, 108, 1\nIzotov, Y. I., Thuan, T. X., & Stasińska, G. 2007, ApJ, 662, 15\nJimenez, R., Flynn, C., MacDonald, J., Gibson, B. K. 2003, Science, 299, 1552\nKrishna Swamy, K. S. 1966, ApJ, 145, 174\nKroupa, P. 2001, MNRAS, 322, 231\nKunth, D. 1986, PASP, 98, 984\nKunth, D., & Sargent, W. L. W. 1983, ApJ, 273, 81\nLequeux, J., Peimbert, M., Rayo, J. F., Serrano, A., Torres-Peimbert, S. 1979,\nA&A, 80, 155\nMaciel, W. J. 2001, Ap&SS, 277, 545\nMadsen, S., Dravins, D. & Lindegren, L. 2002, A&A, 381, 446\nMathews, G. J., Boyd, R. N., & Fuller, G. M. 1993, ApJ, 403, 65\nMathis, J. S., & Wood, K. 2005, MNRAS, 360, 227\nMeynet, G., & Maeder, A. 2002, A&A, 390, 561\nMontalban, J., D'Antona, F., Kupka, F., Heiter, U. 2004, A&A, 416, 1081\nNordtröm B., Mayor, M., Andersen, J. et al 2004, A&A, 418, 989\nOlive, K. A., & Steigman, G. 1995, ApJS, 97, 49\nOlive, K. A., Steigman, G., & Skillman, E. D. 1997, ApJ, 483, 788\nPagel, B. E. J., & Portinari, L. 1998, MNRAS, 298, 747\nPagel, B. E. J., Terlevich, R. J., Melnick, J. 1986, PASP, 98, 1005\nPagel, B. E. J., Simonson, E. A., Terlevich, R. J., Edmunds, M. G. 1992,\nMNRAS, 255, 325\nPeebles, P. J. E. 1966, ApJ, 146, 542\nPeimbert, M. 1986, PASP, 98, 1057\nPeimbert, M., Carigi, L., & Peimbert, A. 2001, ApSSS, 277, 147\nPeimbert, M., & Serrano, A. 1980, RMxAA, 5, 9\nPeimbert, M., & Torres-Peimbert, S. 1974, ApJ, 193, 327\nPeimbert, M., & Torres-Peimbert, S. 1976, ApJ, 203, 581\nPeimbert, A., Peimbert, M., & Luridiana, V. 2002, ApJ, 565, 668\nPeimbert, M., Peimbert, A., & Ruiz, M. T. 2000, ApJ, 541, 688\nPeimbert, M., Luridiana, V., Peimbert, A., & Carigi, L. 2007, Astr. Soc. of the\nPac. Conf. Series, 374, 81\nPerrin, M.-N., de Strobel, G. C., Cayrel, R., Hejlesen, P. M. 1977, A&A, 54, 779\nPerryman, M. A. C., Brown, A. G. A., Lebreton, Y. et al. 1998, A&A, 331, 81\nPotekhin, A.Y. 1999, A&A, 351, 787\nRenzini, A. 1994, A&A, 285L, 5\nRenzini, A., & Voli, M. 1981, A&A, 94, 175\nRogers, F.J., Swenson, F.J., & Iglesias, C.A. 1996, ApJ, 456, 902\nRomano, D., Chiappini, C., Matteucci, F., Tosi, M. 2005, A&A, 430, 491\nSalpeter, E. E. 1955, ApJ, 121, 161\nSerenelli, A. M., Basu, S., Ferguson, J. W., Asplund, M. 2009, ApJ, 705, L123\nSerrano, A., & Peimbert, M. 1981, RMxAA, 5, 109\nShternin, P.S. & Yakovlev, D.G. 2006, PhRvD, 74(4), 3004\nSpergel, D. N., et al. 2007, ApJS, 170, 377\nTaylor, B. J., ApJS, 161, 444\nTimmes, F. X., Woosley, S. E., & Weaver, T. A. 1995, ApJS, 98, 617\nTognelli, E., Prada Moroni, P. G., & Degl'Innocenti, S. 2010, A&A, in press\nTosi, M. 1996, ASP Conf. Ser., 98, 299\nValle, G., Marconi, M., Degl'Innocenti, S., Prada Moroni, P. G. 2009, A&A, in\npress\nvan den Hoek, L. B., & Groenewegen, M. A. T. 1997, A&AS, 123, 305\nWoosley, S. E., & Weaver, T. A. 1995, ApJS, 101, 181\n\n\f"}