{"id": "http://arxiv.org/abs/1102.3338v1", "guidislink": true, "updated": "2011-02-16T13:55:35Z", "updated_parsed": [2011, 2, 16, 13, 55, 35, 2, 47, 0], "published": "2011-02-16T13:55:35Z", "published_parsed": [2011, 2, 16, 13, 55, 35, 2, 47, 0], "title": "Revisiting the Gaia Hypothesis: Maximum Entropy, Kauffman's 'Fourth Law'\n  and Physiosemeiosis", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1102.0228%2C1102.5271%2C1102.5681%2C1102.2223%2C1102.5207%2C1102.4729%2C1102.5379%2C1102.4154%2C1102.1025%2C1102.1771%2C1102.3064%2C1102.0285%2C1102.0569%2C1102.5148%2C1102.5620%2C1102.1657%2C1102.0061%2C1102.5036%2C1102.5663%2C1102.0011%2C1102.3336%2C1102.3504%2C1102.5363%2C1102.4877%2C1102.4735%2C1102.4404%2C1102.3282%2C1102.2466%2C1102.3310%2C1102.3420%2C1102.2543%2C1102.5702%2C1102.1255%2C1102.2153%2C1102.5149%2C1102.3657%2C1102.4631%2C1102.3921%2C1102.2308%2C1102.5671%2C1102.1655%2C1102.4832%2C1102.2243%2C1102.5059%2C1102.3656%2C1102.2014%2C1102.3183%2C1102.3676%2C1102.1437%2C1102.3658%2C1102.1395%2C1102.2779%2C1102.2598%2C1102.5655%2C1102.5122%2C1102.2045%2C1102.0014%2C1102.3312%2C1102.5615%2C1102.4956%2C1102.0484%2C1102.5218%2C1102.1830%2C1102.0625%2C1102.2744%2C1102.4326%2C1102.4515%2C1102.3463%2C1102.1672%2C1102.3275%2C1102.0545%2C1102.0676%2C1102.3338%2C1102.3294%2C1102.0041%2C1102.4075%2C1102.5747%2C1102.3980%2C1102.4004%2C1102.1797%2C1102.3903%2C1102.1658%2C1102.4514%2C1102.2694%2C1102.3759%2C1102.1171%2C1102.3252%2C1102.1277%2C1102.3034%2C1102.1060%2C1102.5199%2C1102.2768%2C1102.2382%2C1102.2698%2C1102.4833%2C1102.2747%2C1102.2405%2C1102.2136%2C1102.2133%2C1102.3618%2C1102.4854&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Revisiting the Gaia Hypothesis: Maximum Entropy, Kauffman's 'Fourth Law'\n  and Physiosemeiosis"}, "summary": "Recently, Kleidon suggested to analyze Gaia as a non-equilibrium\nthermodynamic system that continuously moves away from equilibrium, driven by\nmaximum entropy production which materializes in hierarchically coupled\nmechanisms of energetic flows via dissipation and physical work. I relate this\nview with Kauffman's 'Fourth Law of Thermodynamics', which I interprete as a\nproposition about the accumulation of information in evolutionary processes.\nThe concept of physical work is expanded to including work directed at the\ncapacity to work: I offer a twofold specification of Kauffman's concept of an\n'autonomous agent', one as a 'self-referential heat engine', and the other in\nterms of physiosemeiosis, which is a naturalized application of Peirce's theory\nof signs. The conjunction of these three theoretical sources, Maximum Entropy,\nKauffman's Fourth Law, and physiosemeiosis, shows that the Kleidon restatement\nof the Gaia hypothesis is equivalent to the proposition that the biosphere is\ngenerating, processing and storing information, thus directly treating\ninformation as a physical phenomenon. There is a fundamental ontological\ncontinuity between the biological processes and the human economy, as both are\nseen as information processing and entropy producing systems. Knowledge and\nenergy are not substitutes, with energy and information being two aspects of\nthe same underlying physical process.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1102.0228%2C1102.5271%2C1102.5681%2C1102.2223%2C1102.5207%2C1102.4729%2C1102.5379%2C1102.4154%2C1102.1025%2C1102.1771%2C1102.3064%2C1102.0285%2C1102.0569%2C1102.5148%2C1102.5620%2C1102.1657%2C1102.0061%2C1102.5036%2C1102.5663%2C1102.0011%2C1102.3336%2C1102.3504%2C1102.5363%2C1102.4877%2C1102.4735%2C1102.4404%2C1102.3282%2C1102.2466%2C1102.3310%2C1102.3420%2C1102.2543%2C1102.5702%2C1102.1255%2C1102.2153%2C1102.5149%2C1102.3657%2C1102.4631%2C1102.3921%2C1102.2308%2C1102.5671%2C1102.1655%2C1102.4832%2C1102.2243%2C1102.5059%2C1102.3656%2C1102.2014%2C1102.3183%2C1102.3676%2C1102.1437%2C1102.3658%2C1102.1395%2C1102.2779%2C1102.2598%2C1102.5655%2C1102.5122%2C1102.2045%2C1102.0014%2C1102.3312%2C1102.5615%2C1102.4956%2C1102.0484%2C1102.5218%2C1102.1830%2C1102.0625%2C1102.2744%2C1102.4326%2C1102.4515%2C1102.3463%2C1102.1672%2C1102.3275%2C1102.0545%2C1102.0676%2C1102.3338%2C1102.3294%2C1102.0041%2C1102.4075%2C1102.5747%2C1102.3980%2C1102.4004%2C1102.1797%2C1102.3903%2C1102.1658%2C1102.4514%2C1102.2694%2C1102.3759%2C1102.1171%2C1102.3252%2C1102.1277%2C1102.3034%2C1102.1060%2C1102.5199%2C1102.2768%2C1102.2382%2C1102.2698%2C1102.4833%2C1102.2747%2C1102.2405%2C1102.2136%2C1102.2133%2C1102.3618%2C1102.4854&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Recently, Kleidon suggested to analyze Gaia as a non-equilibrium\nthermodynamic system that continuously moves away from equilibrium, driven by\nmaximum entropy production which materializes in hierarchically coupled\nmechanisms of energetic flows via dissipation and physical work. I relate this\nview with Kauffman's 'Fourth Law of Thermodynamics', which I interprete as a\nproposition about the accumulation of information in evolutionary processes.\nThe concept of physical work is expanded to including work directed at the\ncapacity to work: I offer a twofold specification of Kauffman's concept of an\n'autonomous agent', one as a 'self-referential heat engine', and the other in\nterms of physiosemeiosis, which is a naturalized application of Peirce's theory\nof signs. The conjunction of these three theoretical sources, Maximum Entropy,\nKauffman's Fourth Law, and physiosemeiosis, shows that the Kleidon restatement\nof the Gaia hypothesis is equivalent to the proposition that the biosphere is\ngenerating, processing and storing information, thus directly treating\ninformation as a physical phenomenon. There is a fundamental ontological\ncontinuity between the biological processes and the human economy, as both are\nseen as information processing and entropy producing systems. Knowledge and\nenergy are not substitutes, with energy and information being two aspects of\nthe same underlying physical process."}, "authors": ["Carsten Herrmann-Pillath"], "author_detail": {"name": "Carsten Herrmann-Pillath"}, "author": "Carsten Herrmann-Pillath", "links": [{"href": "http://arxiv.org/abs/1102.3338v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1102.3338v1", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "nlin.AO", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "nlin.AO", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1102.3338v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1102.3338v1", "arxiv_comment": null, "journal_reference": null, "doi": null, "fulltext": "Revisiting the Gaia Hypothesis:\nMaximum Entropy, Kauffman's 'Fourth Law' and\nPhysiosemeiosis\nby\nCarsten Herrmann-Pillath\nEast-West Centre for Business Studies and Cultural Science\nFrankfurt School of Finance and Management\nSonnemannstrasse 9-11\n60314 Frankfurt am Main, Germany\nEmail c.herrmann-pillath@fs.de\nAbstract\nRecently, Kleidon suggested a restatement of the Gaia hypothesis based on Maximum\nEntropy approaches to the Earth system. Refuting conceptions of Gaia as a homeostatic\nsystem, Gaia is seen as a non-equilibrium thermodynamic system which continuously moves\naway from equilibrium, driven by maximum entropy production which materializes in\nhierarchically coupled mechanisms of energetic flows via dissipation and physical work. I\npropose to relate this view with Kauffman's 'Fourth Law of Thermodynamics', which I\ninterprete as a proposition about the accumulation of information in evolutionary processes.\nThen, beyond its use in the Kleidon model, the concept of physical work is expanded to\nincluding work directed at the capacity to work: I offer a twofold specification of Kauffman's\nconcept of an 'autonomous agent', one as a 'self-referential heat engine', and the other in\nterms of physiosemeiosis, which is a naturalized application of Peirce's theory of signs\nemerging from recent biosemiotic research. I argue that the conjunction of these three\ntheoretical sources, Maximum Entropy, Kauffman's Fourth Law, and physiosemeiosis, allows\nto show that the Kleidon restatement of the Gaia hypothesis is equivalent to the proposition\nthat the biosphere is a system of generating, processing and storing information, thus directly\ntreating information as a physical phenomenon. I substantiate this argument by proposing a\nmore detailed analysis of the notion of hierarchy in the Kleidon model. In this view, there is a\nfundamental ontological continuity between the biological processes and the human economy,\nas both are seen as information processing and entropy producing systems. As with other\nprevious transitions in evolution, the human economy leverages the mechanisms by which\nGaia moves further away from equilibrium. This implies that information and natural\nresources or energy are not substitutes, i.e. the knowledge economy continues to build on the\nsame physical principles as the biosphere, with energy and information being two aspects of\nthe same underlying physical process.\nKeywords: Gaia, non-equilibrium systems, Fourth Law, work, Peirce, triadism, hierarchy,\neconomic growth\nJEL classification: Q40, Q57\n1\n\n\f1. Introduction: 'Information is physical'\nIn recent work on the Earth System, there is an increasing interest in establishing the\nMaximum Entropy Framework as an encompassing paradigm to understand the systemic\ninteractions between the different constituent parts of the system (Kleidon and Lorenz 2005).\nOriginally, the Maximum Entropy Production (MEP) hypothesis has been developed in the\ncontext of exploring climate dynamics (Paltridge 2009). This extends on Maximum Entropy\nmethod in predicting the behavior of complex systems, which is an estimation technique\nwidely used across many domains (e.g. in economics see Golan 2002). The MaxEnt\nformalism posits that in order to predict future states of complex systems, it is sufficient to\nspecify the constraints on systems processes, and given the general laws of the domain in\nquestion, such as the laws of physics, to assume that the processes will converge towards\nthose system states which have the highest probability to occur. Therefore, the MaxEnt\nformalism builds on a Bayesian approach to statistical mechanics, in particular, as a general\nanalytical stance towards complex systems (Jaynes 2003).\nIn the MEP approach, this MaxEnt formalism is given a much stronger, ontological meaning\nin stating that the systems under scrutiny also maximize entropy in the thermodynamic sense.\nThis conclusion is not warranted by the MaxEnt formalism alone, and even misleading, if\nonly based on it (Jaynes 2003: 350f.). So, the ontological interpretation needs to build on\nadditional physical propositions about the nature of the processes, especially in terms of\nidentifying the causal mechanisms. However, there is a clear and neat connection between\nMEP and MaxEnt in stating that systems evolve into states which have the highest probability\nto occur, given a certain space of possible states (Whitfield 2005, 2007). This thermodynamic\ninterpretation has to specify the physical mechanisms of energy transformation and\nconduction, that drive the evolution towards these states. This is precisely the gist of the\nrecent research on the Earth system.\nIn this paper, I will present a conceptual framework for the MEP approach in the Earth system\nsciences that focuses on the discussion and interpretation of Kleidon's (2011) most recent and\nmagistral synthesis of the pertinent literature. Kleidon's approach is also of central\nsignificance for ecological economics, because it explicitely refers to the Gaia hypothesis.\nThe original Gaia hypothesis states that the Earth system is a tightly integrated complex\nsystem in which life evolves in a way to maintain the biogeochemical, climatic and other\nphysical conditions that are the necessary conditions of its viability (e.g. Lovelock and\nMargulis 1974, Lovelock 1990). The original Gaia hypothesis has raised a lot of controversies\n2\n\n\f(for a critical review, see Smil 2003: 230f.). In the Kleidon view, the biosphere also plays a\ncentral role in the Gaia system, but Kleidon extends the original argument in one substantial\nway, which is to conceive the Earth system as a hierarchical system of different levels and\nmechanisms of entropy production. This implies that Gaia is not an equilibrium system\nmainly building on homeostatic mechanisms, but represents a steady state system out of\nequilibrium (thus offering an alternative approach to views such as in Margulis 1999, who\nsees evolution as a sequence of moving equilibria). Even more so, the steady state is seen as\nmoving through time, such that Earth system is driven further away from thermodynamic\nequilibrium continuously.\nThis substitution of the homeostasis hypothesis by the hypothesis of an evolving steady state\nis of substantial interest for ecological economics, because the Gaia hypothesis is frequently\ninvoked in stating positions of 'deep ecology', which see the economy as a subsystem of the\necological system that has disturbing effects on Gaia as homeostatic system (e.g. Faber et al.\n1996: 18; Šunde 2008: 179; Eriksson and Andersson 2010: 28). The Kleidon approach raises\nthe opposite question: In which way can we conceive of the human economy as following the\nsame forces that drive the evolving steady state of Gaia? Are the 'disequilibrating' forces at\nthe interface between the economy and ecology just the same forces that drive the interaction\nbetween the biosphere and the Earth System in toto?\nMy paper builds on the Kleidon approach and adds an explicit analysis of the underlying\nprinciples of the supposed hierarchy of entropy production. I argue that what is still missing is\nthe analysis of the role of the biosphere and biological evolution beyond the mere\nidentification of chemical and physical causal pathways. I propose that the central\nphenomenon is the accumulation of semantic information in the structural features of the\nbiosphere, driven by the entropic forces: This is what I call the 'physiosemeiotic' view (Deely\n2001, Salthe 2007). This extension can build on a recent proposal by Stuart Kauffman (2000)\nto expand the set of thermodynamic laws by a 'Fourth Law' that is specific to the biosphere,\nand which highlights the growth of diversity and complexity via the evolution of informationprocessing physical entities with certain thermodynamic properties. In the context of\necological economics, there is a direct conceptual link to Ayres' (1994) distinction between\nthermodynamic information and evolutionary information ('survival relevant information'). I\npropose that the MEP hypothesis corresponds to Kauffman's Fourth Law, with the former\nfocusing on the energetic flows and entropy production, and the latter on the semantic aspect\nof the evolutionary processes driven by the entropic forces. Kauffman presents a general\nconceptualization of the causal principles that undergird the Gaia hierarchy in Kleidon's\n3\n\n\fmodel, and which I specify as 'self-referential heat engines', i.e. heat engines that apply work\non themselves. This approach generalizes over generic biological theories which relate\nevolution with both an increasing potential of harnessing energy throughputs and\naccumulating information in relation to the environment, especially in the context of originof-life research (see e.g. Lahav et al. 2000, Elitzur 2005, Ben-Jacob et al. 2006; for an\napproach bridging biology and economics, see Corning 2005). In other words, I claim that\nentropy production and information accumulation are two sides of the same coin (compare\nChaisson 2001, 2005). This view would allow to present an account of Gaia which focuses on\none defining characteristic of life, i.e. the processing and storage of information in selforganizing biochemical structures, and, at the same time, would allow for establishing a\nfundamental ontological continuity between life and the human economy, if the latter,\nfollowing evolutionary economics, is also seen as a knowledge system in the most general\nsense.\nThis approach needs further analytical detail in two respects, which are major tasks of this\npaper. The first is to make the semantic processes more explicit, which is possible when\nadopting a physiosemeiotic perspective that generalizes over Peirce's theory of signs\n(following Stone 2007, henceforth I use the spelling 'semeiosis' to distinguish the Peircian\nview from other strands of semiotics), which is also pointed out by Kauffman, but not further\nelaborated on (Kauffman 2000: 111; for similar allusions, see Corning 2005: 374f.). The\nsecond is to analyze the notion of hierarchy more deeply, which remains intuitive in the\nKleidon approach, and which can also build on the Peircian framework. Extending on earlier\ncontributions (Herrmann-Pillath 2010, Herrmann-Pillath and Salthe 2011, Herrmann-Pillath\n2011), I argue that the nature of Gaia can only be fully explained if it is seen as a physical\nsystem of evolving, hierarchically structured semantic information, which in turn exerts\ntransformative power on the physical environment. The ultimate theoretical core of this\nphysiosemeiotic view is the thermodynamic approach to information which has been\ndeveloped especially in the sciences of computing, in which the question of the\nthermodynamic costs of information processing has been pursued with great rigour, yet still\ncontroversially (following Landauer 1961, overview in Maroney 2009). Further, the\nconceptual connection between information processing, hierarchy and transformative power\ncomes close to the biological notion of niche construction (Odling-Smee et al. 2001), which\ncan in turn be related to biosemiotics, following classical contributions by von Uexkuell.\nThe paper proceeds as follows. In section 2 I summarize the Kleidon model of Gaia. Section 3\nintroduces the Kauffman conception of autonomous agents and the related Fourth Law, which\n4\n\n\fI further specify in two ways, namely by introducing the notion of self-referential heat engines\nand by putting the Kauffman argument into the triadic framework of Peircian semeiosis.\nSection 4 refers the so conceived Kauffman model back to the Kleidon approach and adds a\nsubstantial analytical extension with regard to the concept of hierarchy. In concluding, I\ncontinue with a view on the implications of the restated Gaia hypothesis for the analysis of\nhuman economy.\n\n2. Restatement of the Gaia hypothesis in terms of Kleidon's MEP\nframework\nKleidon (2011; see also Kleidon 2009, 2010) argues that the basic fact about the Earth System\nis that it constitutes a non-equilibrium system which is mainly driven by external energy\nthroughputs flowing from solar radiation and by the endogenous processes that resulted from\nthe emergence of life on Earth. To this familiar starting point, he adds two central notions.\nOne is the Maximum Entropy hypothesis as such, the other is the notion of a hierarchy of\nenergetic transmission mechanisms, which amounts to an explicit and quantifiable analysis of\ncausal mechanisms.\nThe MEP hypothesis states that non-equilibrium thermodynamic processes will approach\nsteady states in which the production of entropy relative to the environment is maximal: What\nmatters is the export of entropy, and not the status of the exporting system. This is important\nto emphasize because one standard argument against the relevance of thermodynamics for\nanalyzing complex living systems is that their evolution runs against the Second Law (which\ngoes back to the famous Schrödinger 1944 contribution). The MEP hypothesis relates the\nSecond Law to the ensemble of systems and their environments and assumes that the\nmaximization of ensemble entropy is the driving force of the evolution of the exporting\nsystem (on the general methodological importance of the ensemble perspective in\nthermodynamic analysis, see Zeh 2005: 68ff.). Thus, MEP refers to the structural evolution of\ncertain physical systems, which differs fundamentally from the uses of thermodynamics for\nequilibrium systems, in which the working of the Second Law is tantamount to the loss of\nstructure by means of flows that tend to maximize the probability of realized states, given\ncertain constraints, such as in the case of the diffusion of a gas in a container. The upshot of\nthe MEP argument is that increasing structural complexity does not contradict the Second\nLaw, because it speeds up the production of entropy in the ensemble of system and\nenvironment. This implies, that the MEP hypothesis is a most simple and straightforward way\n5\n\n\fto explain the increasing distance between realized states of the Earth System from\nthermodynamic equilibrium, which is the physical expression of the ongoing evolution of life,\nincluding human beings. In other words, the claim is made that the evolution of life is a direct\nphysical expression of the Second Law (compare Annila and Salthe 2010, Mäkelä and Annila\n2010).\nIn the Kleidon approach, the central concept to analyze structural complexity is the notion of\nhierarchy (for a related view, see Annila and Kuismanen 2009). The Earth system is\nconceived as a hierarchical system in the following sense. There are certain levels and\nsubsystems of the Earth system in which thermodynamic disequilibrium is generated and\nmaintained by energy throughputs that are exogenous to this level and subsystem. These\nstates of disequilibrium are a potential for work generated by the release, dissipation and\ntransformation of free energy. The physical mechanism generating work is contingent to other\nlevels and subsystems on which thermodynamic forces operate, given their structural features.\nThe result of this causal impact is to drive those other subsystems further away from\nthermodynamic equilibrium, thus creating a further potential for work. So, the entire process\nappears to be like a fountain with different levels, in which an initial thermodynamic\ndisequilibrium propagates through a manifold of levels which are connected via energy flows\nthat reflect the causal impact of work outputs which are generated by the receiving levels in\nthe flow of energy.\nIn other words, if viewed dynamically in the time dimension, the thermodynamic machinery\nof the Earth System is conceived as a hierarchical system of power flows. In this system, two\nsources of energy loom especially large. One is solar radiation, the other is photosynthesis,\nwhich depends on the former. The latter is central to the entire system, because without\nphotosynthesis, the low thermodynamic efficiency of all other physical processes would only\nmaintain relatively small deviations from thermodynamic equilibrium.\nIt is important to emphasize that this view focuses on average entropy production per unit of\ntime (a distinction that is also important in the generic thermodynamics of information, see\nMaroney 2009). The First and the Second Law of thermodynamics imply that there is an\nupper bound of the energy budget of the entire process, hence also for the potential of entropy\nproduction. The MEP hypothesis, as applied on the hierarchical Earth System, claims that the\nemergence of hierarchy firstly, increases the speed by which energy is dissipated (cf. Vallino\n2010), and secondly, increases the variety of mechanisms how this can happen (cf. Niven\n2010), given the constraints of physical laws, and given the basic requirement of maintaining\nthe structural viability of the hierarchy. In other words, a sudden entropic collapse of the\n6\n\n\fstructure would contradict physical laws, given the current boundary conditions, and would\ndiminish the speed of entropy production in the relevant local segment of the universe. So, the\nEarth System appears to be a physically viable local hot spot of entropy production.\nEmpirically, this approach requires to establish causal chains in which transformations across\ndifferent forms of energy take place. So, the differentiated analysis of material fluxes that are\nconcomitant to the fundamental thermodynamic processes is the core of Kleidon's approach.\nThe basic form is the free (Helmholtz) energy that is generated from heat gradients, both\ncaused by solar radiation and by the the heating in inner Earth. The other forms are\nmechanical energy, geopotential energy, kinetic energy and chemical energy. The release of\nthese forms of energy results into processes that work towards thermodynamic equilibrium,\nhence maximize entropy. So, the fundamental heat gradient generates the process of diffusion,\nmechanical and kinetic energy result into mass transport and friction, or chemical energy\nresults into chemical reactions. All of these processes, taken in isolation, would simply result\ninto the dissipation of free energy. However, in a causally connected Earth system the\nprocesses impact on each other, especially in the form of chains, networks and, most\nimportant, cycles. In order to analyze these processes, the physical notion of 'work' is central.\nIn this view, the change of entropy of the entire system can be expressed as (Kleidon 2011, eq.\n14):\n\ndS tot =\n\ndU + dW\n≡ dS heat + dS diseq\nT\n\n(1)\n\nwhich results from the combination of the First Law with the standard definition of entropy.\nIn this formulation, dSdiseq corresponds to the work done or exerted upon a system. From this\nfollows, when considering changes through time, that the change of free energy is directly\nproportional to degree how far disequilibrium is diminishing in a process (Kleidon 2011, eq.\n16):\ndS diseq\ndS\ndA dU\n=\n− T ⋅ tot = −T ⋅\ndt\ndt\ndt\ndt\n\n(2)\n\nBased on this, one can define the net work that is exerted on a thermodynamic variable as\nresulting from the interaction between two forces, one is the inflow of power, the other is the\ndissipation rate of free energy. It is important to realize that for this interaction, time scales\nmatter essentially, that is, the processes resulting in equilibrium depend on the rates of power\ninputs and the dissipation rates, which in turn are determined by certain structural properties\nof the processes (e.g. soil erosion as compared to a taifun).\nIn this framework, Kleidon defines the notion of 'entropic force', which results from the\ninteraction between different subsystems of the Earth system. The entropic force strictly\n7\n\n\fobeys the Second Law in the sense that the resulting dynamics follows the gradient of energy\ndissipation and hence entropy generation over a certain distance dx (Kleidon 2011, eq. 23):\nr r\ndW = F ⋅ dx = TdS\n(3)\nAnd for the rate D of the dissipation of free energy (Kleidon 2011, eq. 24):\nD =T ⋅\n\ndS diseq\ndt\n\nr r\n= F ⋅v\n\n(4)\n\nNow, for positing the MEP hypothesis, it is essential to establish the correspondence between\nentropy production and power production, i.e. work generated per unit of time. Power\nextraction can be measured by Carnot efficiency, however, one has to consider the role of heat\ngeneration and competing processes in a system. In this case, the MEP hypothesis\ncorresponds to the Maximum Power extraction state. Thus, the Kleidon approach stands in a\nlong tradition of theories which claim that evolution and natural selection are the causal\ndrivers of the emergence of states of living systems which maximize power fluxes in different\nforms (Lotka 1922a,b, Vermeij 2004), and which see the Maximum Power theorem as a pillar\nof ecological analysis (Odum 2007).\nThe MEP framework is completed in considering the causal interaction between subsystems\nwhich results from the impact of power fluxes across subsystems with different modes of\nenergy, such as the impact of heat transport on water flows. For every subsystem, one can\nformulate a basis descriptor of thermodynamic fluxes which result from the impact of power\non the subsystem. The power input drives the system away from equilibrium, which generates\nanother source of power fluxes. Since the adaptive forces driving the subsystem back to\nequilibrium do not operate instantaneously, the subsystem maintains a state of disequlibrium,\ndepending on the continuous power flux, and therefore can in turn become a continuous\nsource of power inputs for other subsystems. As has been emphasized previously, the time\nstructure of the processes matters much (relative speeds and scales).\nThe entire argument rests upon one essential assumption, namely that the physical\n(sub)systems have sufficient degrees of freedom to adapt structurally in a way such that\nmaximum power states can be achieved and maintained. For example, river flows can adapt in\na given landscape in terms of branching patterns that maximize flows. Evidently, the Kleidon\napproach is also close to the literature on the so-called 'constructal law' (Bejan and Lorente\n2006, 2010), which states that physical systems with sufficient degrees of freedom will\nalways change in the direction of maximizing access to flows. Degrees of freedom always\nemerge if there are competing processes which interact in dissipating existing entropic\ngradients.\n8\n\n\fEmpirically, this approach requires the identification of the main sources of energy that\ngenerate entropic forces, which can be quantified to a large degree. The other central task is to\nidentify the structural features of the hierarchy of the Earth system. On first sight, this is also\nstraightforward, as there are two major top-down processes, one resulting from solar radiation,\nthe other from heat generation in inner Earth. So, the radiation balance of the Earth\natmosphere creates radiation gradients, which drive temperature gradients. These in turn\ncreates motion in the Earth atmosphere, which influences other material flows, in particular,\nthe hydrologic cycles. Geochemical cycles emerge from the hydrological cycles, and\nultimately connect with the biosphere. A similar causal chain can be recognized for inner\nEarth, where steps include the causal link between mantel convection and crust cycling, for\nexample. The two chains meet at the Earth's surface, and especially in the biosphere.\nConsidering the processes on different levels in isolation, and adding up, Kleidon estimates a\nglobal work budget that also allows for putting the relative magnitudes into perspective. So,\nfor example, atmospheric motion is estimated to generate a magnitude of 900TW, whereas the\ngeological forces sum up for only about 40TW. The terrestial productivity of the biosphere is\nestimated about 150TW, and the role of human activity is scaled about almost 50TW,\nincluding primary energy consumption. The pivotal role of the biosphere results from the\neffects of phototrophic life on Earth, because it creates a source of power flows which is\nindependent from the original hierarchy, and directly tapping radiation as a source for\ngenerating chemical energy gradients which can in turn generate power fluxes in the system.\nKleidon draws on a number of studies for the different levels involved which suggest that\nthese values approximate the maximum power values, which would also support the\nassumption that the entire system maximizes entropy production. However, this question is\nthe core issue for confirming or falsifying the entire theory, and the evidence is only\nsupportive, so far, but not conclusive.\nFurther, this simple hierarchical view needs to be enhanced by considering feedback effects,\nsuch as the effects of the hydrological cycles on the upper-level gradients via atmospheric\nchanges. This is particularly true in the context of the Gaia hypothesis which states the central\nimportance of the bottom-up processes, i.e. the role of the biosphere in determining all\nprocesses in the Earth System. Therefore, the concept of hierarchy seems to refer only to the\ncausal flows that underlie the energy transformations in the system, and which necessarily\nstart with the exogenous sources, i.e. the sun and inner Earth. Further, the view presented so\nfar is simplified as it does not make the role of the temporal structure explicit, which can be\ncausal force of its own, such as the effects of seasonal variations of radiation impact.\n9\n\n\fOut of this complex analysis of the thermodynamic hierarchy of planet Earth, Kleidon\npresents his version of the Gaia hypothesis:\nThe Earth system has evolved further and further away from a state of thermodynamic\nequilibrium in time mostly by the increased generation rate of chemical free energy by life.\nThe underlying physical principle is the MEP hypothesis. The MEP hypothesis can be\nsupported in different ways. One is tracing energy flows empirically and to show that these\ncorrespond or approximate to MEP states. However, this does not yet provide for a fullyfledged theoretical foundation of the MEP hypothesis. In the current debate over the MEP, the\ncentral issue is how the MEP relates with the MaxEnt principle (Martyushev and Seleznev\n2006; Dewar 2005, 2009). This reflects the fact that in the corresponding mathematical\nmodels, the MaxEnt approach is a way to analyze complex systems by means of a particular\nstatistical approach which is based on Statistical Mechanics. In the argument presented so far,\nthe MEP is exclusively based on phenomenological thermodynamics. In the MaxEnt approach\nit is argued that complex systems in thermodynamic disequilibrium can be analyzed into a set\nof constraints and the processes that operate under the constraints. If the observer has only\nlimited information about a system, one way to solve the prediction problem is to assume that\nthe processes will move towards establishing the state with the highest probability, given the\nconstraints. So, the MaxEnt approach is not a physical theory, but a methodology which\nallows for the adjustment of observers' knowledge in a dynamic prediction task (Jaynes 1957,\n1965; Dewar 2009). If the observer fails to establish MaxEnt, the constraints have been\nmisspecified.\nThere is no dispute about the methodological value of MaxEnt, for example, in estimating\ncomplex atmospheric processes. But this does not necessarily establish a theoretical rationale\nthat the Earth System processes, especially the processes in the biosphere, also maximize\nentropy in the physical sense. Indeed, there is a long history of conceptually flawed uses of\nthe entropy concept in biology and economics (for a critical overview, see Corning 2005:\n313ff.). Subsequently, I present an argument why this might be the case. I want to show why\nthe Gaia hypothesis and the union of MaxEnt and MEP are necessary complements. Before\ntackling this task, one principled methodological point needs emphasis. In the debate about\nthe relation between MaxEnt and MEP, the question looms large whether systems actually\nstay in MEP steady states, which would be an empirical confirmation. But on the other hand,\nif a system does not actually stay in the MEP steady state, this cannot be interpreted as a final\nempirical refutation of the theory. On surface, this relates with the physical fact that time\nscales of causally interconnected subsystems differ vastly, and disturbances occur recurrently\n10\n\n\fon different size scales. But more fundamentally, there are strong reasons why the underlying\nontology of the MEP hypothesis needs to be an indeterministic one (Popper 1982). In an\nindeterministic world, MEP relates with fundamental propensities of physical processes,\nwhich includes the persistence of deviations. Even more fundamentally, the increasing variety\nof possibilities in an evolving state space has to be regarded as an expression of MEP on its\nown. Then, it is a question of the ontological position adopted, whether empirical violations of\nMEP are regarded to be refutations of the theory, which implicitly posits a deterministic view\nof MEP, or whether they are seen either as expressions of the fact that MEP itself cannot be\nstated as a law in an indeterministic setting (Ulanowicz 1997, who therefore rejects\nthermodynamic approaches in ecology), or as reflecting the fact that indeterminism and MEP\nare necessary correlates. In the latter case, Kleidon's argument is sufficiently strong in\nempirical terms to corroborate the MEP hypothesis.\n\n3. The Fourth Law of Thermodynamics in a physiosemeiotic perspective\n3.1. Central theoretical propositions\nThe essence of the problem is how to conceive of the processes in the biosphere in\nthermodynamic terms. Stuart Kauffman has proposed that these processes follow what he\ncalls a Fourth Law of Thermoydynamics which states, in vernacular, that \"the biosphere\nmaximizes the average secular construction of the diversity of autonomous agents and the\nways how these agents make a living and propagate further\" (Kauffman 2000: 4f.).\nKauffman needs a set of other hypotheses and principles to generate this hypothesis. The first\nis the concept of an 'autonomous agent'. An autonomous agent is defined as a reproducing\nsystem that carries out at least one thermodynamic work cycle. So, the notion of agency is\ndirectly related with the notion of thermodynamic disequilibrium: An agent manifests agency\nbecause it is able to generate work. A further criterion is that the processes are cyclic, in the\nsense of a simple thermodynamic engine, such that the state of disequilibrium is reproduced\nconcomitant to the throughput of energy.\nThis definition presupposes two other concepts. The first is that of an 'autocatalytic cycle'.\nAn autocatalytic cycle is a system of chemical reactions which produce catalysts for other\nchemical reactions in a way that the reaction chain closes to a cycle. This autocatalytic closure\nimplies that the entire cycle assumes certain collective properties, in particular its structural\n\n11\n\n\ffeatures and the collective lowering of the energetic thresholds for the reactions involved. All\nautonomous agents are or build on autocatalytic cycles.\nThe second concept is 'work'. Kauffman argues that the physical concept of work is\nunderspecified in the sense that, mostly, the structure of constraints is only posited implicitely\nwhich determines the distinction between energy dissipation, i.e. heat, and work. For example,\na mechanical construction that generates work such as moving a weight is actually designed\nby an experimenter in a way such that a certain amount of energy is released under the\nconstraints. However, the same is true of any sort of work, which operates under naturally\nemerged physical constraints (Salthe 2007b). From this follows that 'work' is a physical\nmagnitude that cannot be defined independent from context, that is, the physical structure that\nreceives the energy throughput, which is not a universal regularity in nature, but a singular\ncombination of physical properties specific to particular spacetime coordinates.\nNow, a special case of work is work directed at constructing the constraints under which work\nis generated. This is a defining feature of autonomous agents: Autonomous agents work on\ntheir environment in a way that some of the causal effects feed back on the constraints under\nwhich they operate, including the structural features of their autocatalytic processes. These\nfeedback cycles are driven by the actions of autonomous agents. The most general feature of\nthese actions is an input-output linkage which connects a measurement with work.\nMeasurement inheres the processes which lead autonomous agents to open up sources of\nenergy that feed their autocatalytic processes. Work output includes actions that are directed\nat those sources. Thus, e.g. a bacterium detects nutrient gradients in the environment and\nmoves accordingly.\nNow, thinking about populations of autonomous agents that compete over a set of possible\nsources of energy, we can say that a given spatiotemporal distribution of agents and their\nstructural properties reflects the history of the interaction between agents and the environment.\nThis history is non-ergodic for simple mathematical reasons, as the space of possible states\nincreases with the number of possible combinations and partitions of the state space. The\nnumber of realized states increases much less than proportionally, such that the probability of\nreturning to the same states is arbitrarily close to zero.\nThis principle is the most fundamental ontological root of the Fourth Law as stated by\nKauffman. He introduces the notion of the 'adjacent possible'. When referring to the set of\nrealized chemical entities in the universe, the adjacent possible is the next reaction step that\ncan result from their interactions and its product. This reaction step can lead towards the\ncreation of a new chemical entity which manifests properties that did not exist previously. In\n12\n\n\fthis sense, the evolution of the chemical universe manifests growth in the dimensions of its\nstate space. It is essential to notice that this process is driven by the fundamental\nthermodynamic forces, because chemical reactions are driven by energy dissipation. Further,\nit is also evident that the possibility of autocatalysis and cycles is a mover of the emergence of\nnew structural features. Stable autocatalytic cycles can in turn interact with other chemical\nentities, thus possibly connecting to other higher-level entities and so forth.\nThis conception of the dimensionality of the chemical state space provides the reference for\nthe diversity of autonomous agents as stated in the Fourth Law. Thus, we can think of two\ndifferent kinds of diversity. One is the diversity of the dimensions of the state space, the other\nis the diversity of single instantiations under these dimensions. This distinction corresponds to\nthe distinction between species diversity and individual diversity in biology, for example.\nThese are the major building blocks that I need for establishing the conceptual connection\nbetween the Kauffman approach and the MEP framework. Kauffman relates his approach\nwith his previous work (Kauffman 1993) on the emergence of order in chemical networks,\napplying certain mathematical models of how connectivity of different kinds emerges and\nresults into pattern formation. From these models he generates the specific assumption that\nliving systems and the systems consisting of living systems operate at the 'edge of chaos'.\nThis refers to a state which is close to the transition to chaotic states, thus just maintaining\nstructural stability while at the same time releasing forces of change at a maximum possible\nrate, just avoiding collapse into disorganization.\nThe Kauffman approach still lacks a precise account for the physical equivalence between the\nconcepts used in the Fourth Law (such as 'diversity'), and the established thermodynamic\nconcepts in the first three Laws. I think that this requires a direct physical equivalence\nbetween entropy and information which goes beyond the purely mathematical homology\nbetween Boltzmann and Shannon entropy. One most simple possibility is offered in Zurek's\n(1989a,b) treatment of the classical problem of Maxwell's demon, which has loomed large in\nthe related discussions for a century now (overview in Maroney 2009; for Kauffman's\ndiscussion of this, see 2000: 87ff.). This is to argue that an information processing entity that\ninteracts with an environment to create ordered states with lower entropy (so, like the demon\nsorting gas molecules between two departments of a container) will always accumulate\ninformation which is singular, that is, being algorithmically irreducible. Zurek argued that the\nthermodynamic entropy of this representation is a part of the ensemble entropy, so that the\nSecond Law still holds. One way to present this idea is to consider the fact that the demon\nalso needs to read its memory, and that this self-referential process will always need to grow\n13\n\n\fin terms of its own complexity when processing algorithmically incompressible memory\nitems. This would match with Kauffman's notion of the expanding state space, because the\nalgorithmically irreducible memory of the 'demon' represents an entirely new possible state\nwhich can causally interact with other states, as in the case of chemical reactions leading to\nnew products. So, if we interpret 'diversity' in Kauffman's Fourth Law in terms of\ninformational\n\ncomplexity,\n\nZurek's\n\nargument\n\nprovides\n\na\n\ndirect\n\nconnection\n\nwith\n\nthermodynamics. This directs the attention to the fundamental distinction between what\nKauffman (2000: 103) calls 'records', i.e. physical storages of information, or, 'memories',\nand work as a flow. The role of those physical storages is theoretically essential as the relation\nbetween information and entropy only can be established via the entropic costs of the erasure\nof information during the process of accumulating new information (the 'reset' costs in the\ntheory of reversible computing, see Bennett 2003).\nHowever, this line of reasoning still operates on a highly abstract level. What is lacking is an\nexplicit account of the causal mechanisms that would drive the fundamental thermodynamic\nprocesses and, at the same time, the evolution of life. This would also allow for connecting\nthe MEP framework to Kauffman's approach. Currently, I think that the Kauffman framework\nneeds to be extended in two directions in order to fit with the MEP analysis of Gaia. One is\nrelatively straightforward, namely the more detailed conceptualization of the thermodynamic\nwork cycle. The other is to add further detail to the notions of diversity and the state space,\nwhich, as we are going to argue, requires the extension into semeiotics.\n\n3.2. Self-referential heat engines\nRegarding the first, it is important to notice that the notion of autocatalysis is a most general\none and does not only include the case of chemical autocatalysis (Maynard Smith and\nSzáthmary 1995, Ulanowicz 1997). All systems in which component processes connect\ncyclically, with the effect of lowering energetic thresholds in process generation, manifest\nfeatures of autocatalysis. As such, for example, a cell can be seen as an autocatalytic structure,\nas well as an ecological system. Given this broad reference of the notion, we can generalize\nKauffman's conception as an element in the Gaia framework in the sense of defining an\nautonomous agent as a self-referential thermodynamic engine along the lines proposed by\nGarrett (2009) (with 'self-referential' my terminological addition).\nAs in the Kauffman approach, Garrett distinguishes between an entity and its environment,\nwith the line of separation drawn by a permeable boundary such as a membrane (see fig. 1).\nThe system consisting of the entity and its environment is embedded into a surroundings with\n14\n\n\flower temperature T < Ts such that heat can be exported. The interface between the entity x\nand its environment constitutes an energy potential DG. The available potential energy in the\nenvironment is transformed into unavailable forms by means of transfer of matter across the\nboundary, which can be measured at the rate a = aDG, where a is a system-specific\ncoefficient which reflects the intrinsic physical characteristics of the system that influence the\navailability of energy throughputs (such as access to flows, or conductivity etc.). The energy\nmade available to the entity is transformed by its operations into either work output w or into\nheat dissipation a - w.\n\nFigure 1: The self-referential heat engine\n\nThe notion of a self-referential heat engine means that the work output is directed at creating,\nmaintaining and expanding the energy potential DG, such that a = aDG and dDG/dt = w. The\nefficiency of the heat engine is defined as e = w/a. Garrett concludes that a system of this kind\nmanifests a growth process, where a rate of return h can be defined as (Garrett eq. 2):\nda\nd (ΔG )\n=α\n= α ⋅ w = α ⋅ε ⋅ a ≡η ⋅ a\ndt\ndt\nThus, a self-referential heat engine manifests continuous growth of energy throughputs,\ndepending on the efficiency of the engine.\nBased on this argument, we can give a more precise analytical definition of the\nthermodynamics underlying autonomous agents. At the same time, we can demonstrate how\nautonomous agents can drive the processes in the Gaia system, in the sense of providing a\nmicrofoundation for the analysis of the macro patterns in energy flows. It is important to\n15\n\n\femphasize that the Garrett model does not imply any particular level of interpretation, that\nmeans, the scale and scope of the 'system' in question is not determined. We can analyze a\nsingle organism in this way, or a more complex ecosystem with interacting organisms. On all\nlevels, the model describes an endogenous pattern of growth. What is left out of the picture is\nthe fact that all living systems undergo developmental cycles with senescence and decay\n(Salthe 1993). In this sense, the pure Garrett model may only apply for Gaia in its entirety,\nwith the manifold of developmental processes that form Gaia as contributing forces to the\noverall growth process.\nIn this picture, however, growth does not necessarily coincide with MEP. We will argue now\nthat this can be confirmed by analyzing the semeiotic process that is the other defining feature\nof autonomous agents. The conceptual linkage between Garrett's model and the current\nbiosemiotics is provided by the pivotal role of the boundary, such as a membrane (Hoffmeyer\n2000). A boundary establishes a physical correlate to the semantic conception of 'meaning',\nin the sense that in a self-referential heat engine, all energy throughputs that result into work\nhave a physical format that matches with the internal functioning of the system, and which\ntherefore can pass the system boundary. Physical formats that mismatch with the system\ntrigger processes of entropic decay (wind supports the flight of the bird, the hurricane is a\ndeadly blow). Therefore, all self-referential heat engines can be interpreted as functions. A\nfunction is defined as a physical entity which has a causal consequence which is also the\ncause of the existence of that entity (in more detail, see Herrmann-Pillath 2010, building on\nWright 1973). So, a self-referential heat engine produces work that maintains and further\nexpands its difference with the environment, i.e. the energy potential DG. Once we conceive\nof those physical entities as functions, it is straightforward to expand into semeiotic analysis.\n\n3.2. A restatement of Kauffman's approach in terms of semeiotics\nKauffman refers to Peirce's theory of signs when discussing the specific workings of\nautocatalytic systems and autonomous agents (Kauffman 2000: 111ff.). This follows from the\nobservation that any kind of physical measurement involves a categorization. Categorizations\nimply that in the causal interaction between the system and its environment, only a particular\naspect of the environment becomes relevant for the further causal processes. Which aspect, is\ndetermined by the internal workings of the system. Thus, the semantic concept of meaning\ncan be directly related with the notion of function (for a related philosophical account in\n'teleosemantics', see Millikan 1989, MacDonald and Papineau 2006, Neander 2009). The\nnotion of function also establishes a close connection with cybernetic approaches such as\n16\n\n\fproposed by Corning (2005), which I see as complements, but not alternatives to the view\npresented here.\nFollowing Herrmann-Pillath and Salthe (2011), I will now proceed in interpreting Kaufman's\napproach in terms of Peircian semeiotics. I aim at showing that the Fourth Law directly\nfollows from the workings of semeiotic processes, which establishes a physiosemeiotic\nperspective, or, a naturalization of Peircian semeiotics (Vehkavaara 2002, Herrmann-Pillath\n2010). In order to achieve this, we have to introduce the conceptual tool of triadic analysis.\nTriadic analysis allows for the systematic exploration of two essential process characteristics\nof autonomous agents, namely categorization and evolution. The term 'triadic' refers to the\nfundamental Peircian distinction between object, sign and interpretant, and to the confluence\nof different causal modes in the dynamic unfolding of semeiosis (for a comprehensive\noverview, see Stone 2007, also Burch 2010).\nSemeiosis always involves different modes of causation, efficient, final and formal, in the\nclassical Aristotelian sense. This distinction corresponds to notions of teleonomy that are part\nof the cybernetic analysis of functions (Corning 2005: 321, Ellis 2008), but makes the\nsemantic dimension of information explicit. It is essential to recognize that the corresponding\nphysical processes interact in the establishment of the fundamental mechanism in the\nKauffman approach, namely the autocatalytic cycle, which is the basis of autonomous agents;\nthe autocatalytic cycle is also the fundamental physical mechanisms that relates those\ndifferent causal modes with energetic throughput (in more detail, see Ulanowicz 1997: 41ff.).\nFirst, every autocatalytic cycle consists of efficient-causal chains of interactions between\nentities, such as the sequence of singular chemical reactions. Second, once autocatalytic\nclosure is achieved, the property of closure emerges as a property of the collective of entities.\nIn the interaction with the environment, this structure operates as a constraint on the possible\nvariations of the cycles, given a possibility space of many variants which can emerge in a\npopulation of entities (such as a chemical solution of different constituent substances). This is\ndownward causation, or formal causation (in a similar vein, see Kauffman 2000: 128ff.).\nThirdly, in a population of cycles, those cycles with the highest degree of productivity and\nenergetic efficiency will outgrow other possible cycles, thus creating the directedness of the\nchanges in the composition of a population. This reflects final causality. In this triadic\nframework, the efficient-causal chains are constitutive in the sense of providing the\nontological substrate on which the other forces supervene. Final causality does not establish\nteleology, but refers to the general property of selection to be both selection of and selection\nfor, hence teleonomy (Stone 2007: 94ff.). In the generic autocatalytic model, this is selection\n17\n\n\ffor throughputs of matter and energy, i.e. maximizing chemical potential, which drives the\ndirectedness of physical changes. Formal causality is reflected in the emergence of new\nconceptual levels in ontological hierarchies, such as molecules with irreducible properties\n(Vemulapalli 2006).\nThis triadic approach to causality also inheres the semeiotic triad in the narrow sense.\nFollowing the naturalistic approach to semeiosis which was developed by Stone (2007) and\nRobinson and Southgate (2010), I distinguish between three modes of causal interaction, and\nintroduce a different terminology in treating the 'interpretant' as a 'response' R. Figure 2\nshows the relations between these different modes which should be read as a conceptual map\nof the underlying ontology, i.e. the three core constituents (object, sign and\ninterpretant/response), the three causal modes and their relation, and the directions of\ncausalities which are driven by the fundamental force of selection that works on both the\nlevels of signs and interpretants (for more detail see Herrmann-Pillath and Salthe 2011). The\ncentral idea of Peircian semeiosis is that in considering a living system, hence an autonomous\nagent in Kauffman's sense, we need to differentiate between an object in the environment and\nthe response (interpretant) of the system: That means, semeiosis relates to physical effects of\nan environmental input on the output of the system, and these effects are seen as interpreting\nthe environment. The response of the system is in turn embedded into a larger system, in\nwhich the response relates with a function. The function relates in turn with a general purpose\nP, which is the formal characteristic of the relevant selection process that guided the\nemergence of the function. A function, for example, is the harvesting of nutrients by the\nbacterium, enabled by its reponse to nutrient gradients (signs) in the environment (i.e.\nmovements as interpretants), serving to maintain its energetic metabolism, which relates with\nthe general purpose that drives the selection of the specific action patterns of bacteria.\nThe response is impacted by two different causal mechanisms. One is the efficient-causal\nchain that connects the object impact with the response via the specific physical mechanisms\nQ (the chain OQR in figure 2). The other is the impact of the sign X, hence OXR. Both\nchannels co-evolve in a process of selection, in which the conjugation of the three modes of\ncausality materializes. This means, in particular, that the OXR channel puts constraints on the\nrange of possible OQR linkages between a particular input and output, and that the way how\nthe environment is represented in the response patterns changes through time (in the original\nPeircian analysis, this refers to the distinction between immediate, dynamical and final\nobjects). Thus, the coevolution of the two levels results into the generation of information\nabout O in R, physically embodied in both causal chains.\n18\n\n\fFigure 2: The basic semeiotic triad\n\nFigure 3: The semeiotic conception of the autonomous agent\n\nIn Kauffman's terminology, the sign corresponds to the measurement, in the sense of\nassigning an object to a class of measures, which therefore turns into a most simple form of\nrepresenting the environment to the autonomous agent. Measurements define ranges and\nscopes of causal interactions between system and environment, and relate with certain classes\nof responses (compare Dretske 1981). In particular, measurements introduce a gap between\nthe set of all possibly relevant microstates of the environment and the macrostates as\n19\n\n\frepresented by signs that become causally relevant for the response R. So, we end up with two\nversions of the original semeiotic triangle, with one directly adapting to the Kauffman\nterminology (figure 3). In the latter version, we can immediately recognize that the notions of\nwork and of function are complementary in the sense of 'tasks', which has also been proposed\nby Kauffman (2000: 104f.).\nI call this kind of semeiotic structure a 'physical inference device' (for a general definition,\nsee Wolpert 2008). Autonomous agents are physical inference devices, because they are able\nto infer certain properties of the environment from measurements. Now, the central question\nis how this inference operates. In this context, the Peircian approach is again helpful. This is\nbecause any kind of evolutionary process that involves the fundamental mechanism of\nselection manifests the logical properties of abduction, the logical type of inference that\nPeirce had added to the classical dualism of induction and deduction. One of the standard\napproaches in evolutionary epistemology is to equate evolution with the process of\nfalsification (Popper 1972). However, this leaves the question open how the original\nhypotheses are created, which corresponds to the problem in evolutionary theory how the\noriginal forms of life emerge that are then subject to selection (compare Kauffman 1993).\nPeirce introduced the notion of abduction, which relates the hypotheses to a previous result of\naccumulating experience (that is, an observation is seen in the light of its most plausible\nexplanation, given previous experience). In contrast, the concept of falsification relies on the\nlogical form of deduction. Deduction refers to the logical deduction of a consequence from a\npremise; abduction refers to the logical conclusion from the consequence to the premise. The\nlatter step would be logically wrong, unless it is seen in the context of a process of generating\nand testing hypotheses. The abduction leads to a hypothesis that can be tested subsequently\naccording to Popperian criteria of falsification. This exactly mirrors semeiosis in an\nevolutionary context. Abduction results from the interpretation of a certain sign X, given the\nrecords of previous experience. However, whether the resulting prediction holds true, depends\non the outcome of the subsequent selection. Hence, abduction does not establish truth, but\nhypotheses. In this view, the response R of the autonomous agent is equal to a hypothesis that\nis subsequently tested by selection, i.e. is confirmed or falsified, where the fulfilment of the\nfunction, relative to a fitness landscape in which selection proceeds, is the criterion of\nfalsification.\nHowever, this view of selection needs to be further specified in one important sense. As we\ncan see from fig. 3, the semeiotic approach implies that the role selection plays in the\nevolutionary process needs to be reversed in a certain sense, because the environment\n20\n\n\fbecomes dependent on the outcome of selection, and cannot be simply seen as an exogenous\nforce that drives selection. This corresponds to the notion of niche creation and selection in\nbiosemiotics and other recent restatements of evolutionary theory. In the triadic framework,\nthe physical causality of selection is always intermediated by the categorizations that emerge\nfrom semeiosis, such that the semeiotically intermediated environment, called 'niche' in\nbiology, and the response patterns co-evolve. In Kauffman's approach (2000: 73ff.), this is\nexplicitely recognized when he argues that populations of autonomous agents evolve such that\ntheir environments are changed in a way so that the evolved strategies of problem solutions –\ntheir response patterns - match the evolving fitness landscape.\nI now propose the following. The process of abduction by means of selection can be\nformalized according to the MaxEnt principle (on the role of MaxEnt in systematizing\nobserved distributions of results of selection, see Frank 2009a,b; for related approaches see\nGrönholm and Annila 2007 and Dewar and Porté 2008). This is because the MaxEnt principle\nmeans that for any kind of predictions over populations of complex phenomena, the most\nparsimonious way to accumulate information about this domain is to consider the constraints\ngoverning the processes in the domain, and then to assume that the domain will evolve\ntowards a state which is the most probable one, thus maximizing entropy in the sense of\nstatistical mechanics. If the prediction fails, this is an indicator that the constraints have been\nmisspecified. This means, the MaxEnt principle drastically reduces the information\nrequirements of predictions (Dewar 2009). This can be stated in the micro/macro distinction,\nsuch that the direct conceptual equivalence with the framework of Statistical Mechanics\ncomes to the fore: Signs and response are two causally linked macrostates, whereas the causal\nchain OQR operates on the level of the microstates. Given the constraints to process\ninformation about all microstates, the MaxEnt inference mechanism is the optimal one. It is\nstraightforward to relate this to the triadic framework. Then, we can say that the evolutionary\nprocess results into a mapping between between properties of the population of autonomous\nagents and the environment, such that the former reflect the constraints operating on the\nenvironment in a way that simultaneously the diversity of non-essential variations is\nmaximized. In this formulation, it is straightforward to see how the MaxEnt formalism and\nthe evolutionary mechanisms correspond (fig. 4).\n\n21\n\n\fFigure 4: MaxEnt in the triadic framework\n\nFigure 5: Physiosemiosis of biological evolution\n\nSo, the triadic framework enables us to deduce Kauffman's Fourth Law as a consequence of\nthe general properties of the evolutionary process, conceived of as a process of accumulating\ninformation: The process of abduction is the force driving the different possibilities of\ncategorizing the state space of the environment, and the MaxEnt process maximizes the\ndiversity of actions, given a certain categorization. So, evolution both increases the\ndimensionality of the state space, and the number of individual actualizations, which\nvindicates the Fourth Law. Then we can present a triadic map of the fundamental structure of\nevolutionary theory, which we call the 'physiosemeiotic' view on evolution (fig. 5). In this\n22\n\n\fview, the species is seen as a set of evolved patterns how to categorize an environment, i.e. is\ntantamanount to a set of signs. Categorizations elicit individual response patterns, which\nrefers to the population of individuals of a species. These patterns manifest maximum\ndiversity, following MaxEnt, given the constraints elicited by the working of formal causality\nin the triadic scheme. Ultimately, environment and species co-evolve via the process of niche\nconstruction.\n\n3.3. Completing the physiosemeiotic synthesis: The 'Fourth Law' restated\nIf we put the results of this and the previous section together, we can further state that the\nprocess of information accumulation is driven by the fundamental energetic dynamics of\nautonomous agents: physical inference devices are self-referential heat engines. Whereas the\nabduction cum MaxEnt logic corresponds to the Statistical Mechanics view, the energetic\nview corresponds to phenomenological thermodynamics. Then we can see that the process of\ninformation accumulation corresponds to the increasing potential for work, in the sense of the\nMaximum Power theorem seminally proposed by Lotka. The possibility of work emerges\nfrom the physiosemeiotic process that establishes a complex causal connection between\nmacrostates (signs and responses qua functions) that supervene on the microstates, i.e.\nefficient causality. Work and information are physical correlates.\n\nFigure 6: The physiosemeiotic process: The 'Fourth Law'\n\n23\n\n\fThe role of work is twofold. One is that the autonomous agent changes the capacity of the\nenvironment to produce work (which is reflected in the Peircian 'interpretation'). That is, a\ngiven energy potential is dissipated in a different way when an autonomous agent is present.\nThis is the central piece in developing the general theory of Gaia as proposed by Kleidon. The\nemergence of autonomous agents changes the physical causality of energy dissipation, i.e. the\nmanifestation of the Second Law. At the same time, this energy throughput, given the\ninformation accumulated in the agent (Kauffman's 'records'), enables the agent to exert work\non its environment, in order to maintain its functioning. On the population level, this process\nis evident in two macrotrends. The first is niche construction, such that the potential of the\nenvironment is carved out differently by different species, the other is the emergence of\nspecies-specific kinds of work, i.e. organismic functionings. At the same time, these\nfunctionings concur with a maximum of non-functional variety, which is pure dissipation, at a\ncertain point of time, and given the constraints. But this maximum entropy state also\nmaintains a maximum of information capacity, which is harnessed by the evolutionary\nprocess. So, we claim that fig. 6 details the Fourth Law as proposed by Kauffman.\nKauffman's Fourth Law, in this formulation, directly relates information-theoretic and\nthermodynamic approaches to entropy.\nThe theoretical core of this view, which is also the conceptual bridge to the Kleidon model of\nGaia, is the physical concept of work. The accumulation of information means, in physical\nterms, that new forms of energy transduction and transformation emerge which leverage the\nexisting gradients of dissipation. To give one example: Zehe et al. (2010) present an analysis\nof soil structures with gradients in water flows, which dissipate kinetic energy. Earthworms\ncan leverage the dissipative gradients, while at the same time exploiting nutrients and other\nenergetic potentials in this environment. The entire system increases the thermodynamic rates\nin the local environment. Physically, this implies that earthworms represent new qualitative\nforms of work which are based in their physical structure, which includes the biological\nstorage of information. In my approach, earthworms are physical inference devices which\nprocess information about the environment in order to harness energetic throughputs for\nsurvival and reproduction, and which thereby maximize entropy production in the\nsoil/earthworm ensemble, their ecological niche.\n\n24\n\n\f4. Hierarchies in the physiosemeiosis of Gaia\nWe will now connect the physiosemeiotic argument with the Kleidon picture. Synthesizing\nKauffmann and Kleidon in the triadic framework implies the general hypothesis that the\nevolution of Gaia is just the dual of the accumulation of information in the biosphere. In other\nwords, the two processes of maximizing entropy and energy throughputs and the process of\naccumulating information are two sides of the same coin. This view can be vindicated if we\nreconsider the notion of hierarchy.\nIn the original Kleidon approach, the notion of hierarchy is intuitive, but also inexact. In fact,\nKleidon seems to have two different aspects in mind. One is the causal chain of energetic\nflows. This chain links up solar radiation with subsequent effects, such as the hydrological\nfluxes. However, a causal chain does not necessarily imply a hierarchy, in the sense of control\nmechanisms or the distinction of ontological levels. One cannot say, for example, that solar\nradiation controls the metabolism of plants, it is just an input that is being controlled. So, the\nnotion of hierarchy seems to flow out from an intuitive idea, which in fact relates with the\nsecond aspect, that solar radiation is a more general or encompassing causal force than the\nmore specific ones. But this idea is also not exactly related to scale, as it might appear on first\nsight, because the causal mechanisms working, for example, in the case of radiation can be\nbroken down to the molecular level and below, with the aggregate of these effects not\nnecessarily being more than the sum of its parts. An exact notion of scale would have to refer\nto the scope and reach of certain functions. Again, this leads to an inverted view of the\nintuitive hierarchy, because increasing scope and reach of functions are emergent properties\nof the evolutionary processes. So, Kleidon's use of the term 'hierarchy' seems to refer\nimplicitly to the conceptual order of the physical theories and propositions that describe the\nEarth system, so that 'radiation' is a more general concept than a local ecosystem, also related\nwith physical processes of larger reach (such as hydrologic cycles). However, considering the\nunderlying causal mechanisms, one cannot speak of a hierarchy in the ontological sense,\nbecause all efficient-causal changes are located in particular segments of time and space.\nA more precise notion of hierarchy refers to two different uses of the term. One refers to\ncontrol hierarchies, in which lower level processes are constrained and controlled by higherlevel processes. This equates with a hierarchy of functions. The other use refers to semantic\nhierachies, which are reflected in nested conceptual structures used by observers who describe\nthem, and which reflect the result of an historical process of emerging differentiations in a\nparticular domain. So, I distinguish between two kind of hierarchies, the compositional or\n25\n\n\fscale hierarchy and the subsumptive hierarchy (following Salthe 1986, 2002). The two differ\nfundamentally in relation to the dimensions of time and space, and we can also speak of the\ndistinction between diachronic and synchronic hierarchy (fig. 7).\n\nFigure 7: Two kinds of hierarchies\n\nIn this view, one problem with the Kleidon approach springs to the eye. The Kleidon picture\nonly focuses on the synchronic hierarchy, and even here it does not further specify the role of\nfunctions in the energetic flows. So, only the causal chain flowing from outer to inner circles\nis part of the picture, but this leaves out the physical mechanisms that ultimately enable the\nGaia system to increase the rate of dissipation and to further its distance from thermodynamic\nequilibrium. Strictly spoken, we can even say that the synchronic hierarchy is irrelevant for\nanalyzing the thermodynamic processes because it leaves the dimension of time apart.\nEntropic processes occur through time, and hence an explicit treatment of the diachronic\nhierarchy is necessary. In the triadic framework, Gaia needs to be analyzed as a\nphysiosemeiotic process in which the two dimensions of time and space are considered\nsimultaneously and hence, the two kinds of hierarchies are seen as conjoined phenomena.\nThis argument can be best illustrated with the primordial process of the emergence of life, as\nit is conceptualized by Elitzur (Lahav et al. 2001, Elitzur 2005). Elitzur argues that one\ndefining characteristic of life is the emergence of information that increases the potential of its\ncarrier to harness energy in its environment. In this sense, the feature that distinguishes\nhierarchical levels is the emergence of control information (compare Corning 2005: 360ff.).\n26\n\n\fControl information integrates a set of efficient-causal mechanisms such that, following\nLotka's seminal conjecture, power is maximized, given constraints, under natural selection.\nThe other defining characteristic of life, according to Elitzur, is the emergence of forms, that\nis, organizational patterns which are autonomous in relation to local conditioned causal forces.\nForms can be reflected in conceptual structures, such as the phylogenetic tree of life.\nAlthough the evolution of these forms is driven by local forces (variation and selection), the\nforms coalesce into a non-local structure. This non-local nature of the form is reflected in the\nevolutionary phenomenon of stasis, that is, the remarkable stability of the characteristics of\nhigher-level biological units such as species (see Gould 2002: 874ff.). This results into\nanother kind of hierarchy, the semantic one, in my previous parlance (for a seminal\ncontribution in this vein, see Riedl 1983).\n\nFigure 8: Hierarchies in physiosemeiosis\n\nIn figure 8 I put the two kinds of hierarchies into the triadic conceptual framework. The point\nin doing this lies in the fact that only in the triadic framework full account can be given of the\nrole of information in evolution. Following Robinson and Southgate (2010), we can say that\nthe relationship between a particular response R and a function is embedded into a\ncompositional relation of responses on different scales, which ultimately connect with a most\ngeneral purpose, ultimately harnessing energy potentials. For example, if we look at the\nresponses of a bacterium in a Petri dish, we can analyze its response patterns in a very narrow\ncompositional hierarchy, which is limited to the artificial environment created by the\nexperimenter. If we analyze a bacterium in the human intestinal tract, we can analyze its\nresponse patterns in functional interdependencies which reach from the immediate response to\n27\n\n\fthe internal environment of the human body, and further would include the causal loops which\nreach from the effects of bacterial actions on the human organism through the functions of the\nlatter onwards to the entire ecological system in which both the bacterium and the human\norganism are embedded. The energy budget of the bacterium is part and parcel of the\ncompositional hierarchy of ecosystem functions with increasing scale and scope, thus\nreflecting the original Kleidon view.\nHowever, as this example also shows, the relation between bacterium and human body also\nreflects a particular state in the evolution of the subsumptive hierarchy. In the context of\nanalyzing the biosphere, the subsumptive hierarchy inheres the genealogical tree that has\nunfolded since the emergence of life. The subsumptive hierarchy implies an intricate relation\nbetween simple and complex semeieotic structures, as reflected in co-evolving patterns of\nspecies and their niches. On simple and early stages of evolution, the mapping between signs\nand functions is direct and close to the ultimate purpose, such as dissipation of energy via\nchemical reaction cycles. On later stages, the immediate responses of organisms are more and\nmore specified, and therefore in larger distance to the ultimate purpose, but at the same time\nembedded into the emergent semeiotic hierarchy, in which the phylogenetically older\nsemeiotic structures obtain the role of more general, hence subsumptive concepts that relate\nmore directly with the generic functions closer to the general purpose P. So, for example,\nbroader categories in the phylogenetic tree share certain 'Bauplan' features which relate with\nmore generic functions, whereas the defining characteristics of species and subspecies relate\nwith more nuanced features of the niche which had been carved out physiosemeiotically. In\nfig. 8, this is visualized by the concatenation of signs, which reflects the increasing specificity\nand complexity of the information processing in evolution, relating semantic categories in the\nphylogenetic tree with the evolving diversity of niches. For example, in case of the bacterium\nin the intestinal tract, the symbiotic relation between the bacterium and its host body is\nregulated by complex systems of signalling which establish and maintain biochemical\nidentities, such that the functional interdependecies can be maintained. This sign system has\nevolved together with the functional system but cannot be simply reduced to it (on the related\nissues in analyzing the immune system, see Tauber 2006).\nThis is not the place to detail this view further, so suffice to state that the peculiar role of the\nbiosphere in the Gaia processes results from two aspects. One is the increasing potential for\nenergy dissipation which emerged in the unfolding of the compositional hierarchy, the other is\nthe energetic flow which is embodied in the unfolding of the subsumptive or diachronic\nhierarchy through time, and which corresponds to its increasing semantic complexity. In this\n28\n\n\fsense, the distinction of the two hierachies comes close to the economic distinction between\nstocks and flows, with the flows corresponding to the fulfilment of the functions, and the\nstocks corresponding to the evolved physical structure of signs. The connection between the\ntwo aspects of the same underlying process can be established by referring back to my\nprevious analysis of the Fourth Law. One aspect relates with the production of entropy, which\nis leveraged by the evolving functional hierarchies, the other aspect is the energy throughput\nthat is embodied in the growing complexity of the information stored in the system, with\n'storage' actually referring to the recurrent reproduction and change of that information,\nwhich requires the continuous maintainance and expansion of physical structures of\nembodiment. The second aspect relates with the physical conditions that make the first aspect\npossible. The two aspects corresponds to the two results of my conceptualization of\nKauffman's Fourth Law. The accumulation of information happens in the subsumptive\nhierarchy, the accumulation of information capacity happens in the compositional hierarchy.\nIn ecological theory, a framework that comes close to this is the notion of 'ascendency' that\nhas been proposed by Ulanowicz (1997) and Ulanowicz et al. (2009), who also speak\nprogrammatically of the 'return of information theory' with reference to ecology. Ascendency\nis an information-theoretic measure that relates throughputs with the average mutual\ninformation in a system, which reflects increasing complexity and determinacy of structure,\nrelative to a space of possible alternative states, hence accumulated information in my sense\n(e.g. realized network connection in a food web as compared to possible connections, scaled\nby total throughputs). Ascendency is the scaffold of evolvability, which at the same time\ndepends on what Ulanowicz calls 'overhead', which is unconstrained complexity, hence\naccumulated information capacity in my sense. This overhead is fed by four main sources.\nThe first is system inputs, hence corresponding to Lotka's conjecture of maximizing energy\nthroughputs. Second is system outputs, which relates with outputs that are functional in the\nsense of establishing positive feedbacks with the system in question. This corresponds to\nGarret's conception of self-referential heat engines and Kauffman's notion of work, as\nadopted in my framework. Third is dissipation, which is energy throughput that is not work in\nthe previous sense, and fourth is redundancy of internal structure, which corresponds to the\nnotion of diversity.\nRelated to this, the concurrence of the two expressions of the Fourth Law, i.e. the\naccumulation of information in the subsumptive hierarchy and the accumulation of\ninformation capacity in the compositional hierarchy, can be summarily represented in one\nmeasure that has been proposed by Chaisson (2001), namely the 'free energy rate intensity'\n29\n\n\fΦm (measured in erg/s/g) which measures the energy throughput per unit of time and mass.\nThis measure is continuously increasing throughout evolution and directly reflects the\nincreasing intensity of information processing in physical entities, or, autonomous agents in\nKauffman's sense.\nThe resulting grand view is summarized in figure 9, which draws on a diagram in Kleidon\n(2011), but presents some substantial modifications, while simplifying other parts, to avoid\ncluttering.\n\nFigure 9: The physiosemeiotic view on Gaia\n\nThe Gaia system is driven by the energetic flows generated exogenously, i.e. mainly solar\nradiation and Earth inner heat (subsequently, we leave the latter out of the discussion and the\ndiagram, in order to avoid cluttering). The biosphere is a phenomenon close to the surface of\nthe Earth, but extending beyond in both directions. It stands out as a second source of\nenergetic flows resulting from phototrophic life. The diagram does not present the details\nabout the levels of gradients across which the entropic forces generate work which connects\ninto chains and loops (compare the original, more detailed Kleidon diagram). This is the\n30\n\n\fefficient-causal process that underlies the physiosemeiotic process, thus providing the\nultimate justification for extending the notion of semeiosis into physiosemeiosis.\nOur diagram differs in opening up the black box of the biosphere. We distinguish between\nthree analytical layers. One is provided by the most general notion of a self-referential heat\nengine, which catches the Kauffman conception of work as energy dissipated under\nconstraints, and inpacting on those constraints. As we have seen, this notion of a selfreferential heat engine is essential to explain the evolutionary directedness of the biospheric\nchanges through time, in the sense of driving Gaia further and further away from\nthermodynamic equilibrium (Kleidon's definition). Thus, the entire biosphere is a selfreferential heat engine. Further, we distinguish between this generic case, which applies for\nall kinds of ecosystems, and the more specific analytical layer of autonomous agents.\nIn this context, it is essential to highlight two points. The first is that the biosphere influences\nthe chain of energetic flows (and hence, entropy production) by changing their rates. This is a\nphysical effect that is emergent on the entire biosphere, even though triggered by the single\nevents and action patterns on the constituent individual level of the biosphere (i.e. the\norganisms). For example, even climate change triggered by human action cannot simply be\nreduced to the latter alone, but on the entire network of feedback effects in the biosphere.\nSecond, the distinction between autonomous agents and self-referential heat engines refers to\nthe fact that the interaction of autonomous agents triggers emergent phenomena on the\necosystem level which do not imply agency. This distinction is necessary to avoid teleological\ninterpretations of the Gaia hypothesis, but keeps the fundamental teleonomic structure. These\nemergent properties, in the current context, center around the features of self-referential heat\nengines, in the sense of intermediating causal chains that redirect work on the constraints\nunder which the biosphere evolves.\nAutonomous agents have the properties outlined in the previous sections. Especially, they\nbuild on autocatalytic cycles, which are the physical foundation for the emergence of\nsupervening triadic causal mechanism in Gaia. Thus, we argue that a fully-fledged analysis of\nGaia needs to move beyond the analysis of efficient-causal chains of entropic forces in order\nto explain the directedness of changes and the continuous tendency to move away from\nthermodynamic equilibrium. In the context of autonomous agents, this interplay of causal\nforces stays at the core of physiosemeiosis, which opens the view on the dual of the entropic\nflows, namely the emergence and evolution of information that is embodied in the structure of\nthe biosphere. Physiosemiosis is governed by Kauffman's 'Fourth Law' and follows the\npattern that was analyzed previously, especially in figure 6.\n31\n\n\fNow, physiosemiosis also establishes the second major feedback mechanism in the evolution\nof Gaia, which is the process of niche construction. This results into the twofold hierarchical\nstructure of compositional and subsumptive hierarchies, which changes the nature of the\nefficient-causal entropic forces fundamentally, as they become embedded into the structure of\nniches. The concept of niche reflects the principle that has been highlighted by Kauffman,\nnamely that the physical conception of work, as applied in empirical contexts, is\nfundamentally dependent on the structure of constraints that channels the dissipation of free\nenergy. Therefore, evolving niches continuously transform the physical expression of work.\nIn sum, analyzing Gaia solely in terms of the causal chains of entropic remains a purely\ndescriptive statement. The more fundamental causal hypothesis of Maximum Entropy\nProduction requires a more powerful explanatory approach, which adds Kauffman's Fourth\nLaw. However, the Fourth Law as such requires explanation, in turn. So, the ultimate\nexplanation is the physiosemiotic one, which shows that the MaxEnt principle and the MEP\nprinciple are inherent features of evolution as a process of accumulation information via the\nemergence of novelty, i.e. the exploration of the adjacent possible in the sense of Kauffman's.\n\n5. In lieu of conclusion: Gaia and the human economy\nIn this grand picture, what is the role for the human economy? The first fundamental insight is\nthat we can no longer speak of a possible contradiction between the human economy and Gaia\nprocesses. The human economy extends the information processing mechanisms of evolution,\nbut does not change them in a principled way (compare Jablonka and Lamb 2006). Gaia and\nthe human economy share the feature of driving the Earth System away from thermodynamic\nequilibrium. Both happen in a unified physiosemeiotic framework, in which the increasing\ncomplexity and diversity of information is accompanied by an increasing rate of energetic\ndissipation and hence entropy production.\nThis view implies a major rethinking about economic growth, which meets with similar ideas\nventilated in the context of the bioeconomics literature (e.g. Vermeij 2009). In a nutshell,\neconomic growth is nothing but another physical expression of the maximum entropy\nmechanisms that underlie Gaia's evolution away from thermodynamic equilibrium. There is a\nfundamental ontological continuity between processes in nature and growth of the human\ntechno-ecology. In other words, we can no longer use any notion of 'ecological equilibrium'\nto identify disturbances caused by human economic activity. From another angle, this implies\n32\n\n\fthat the emerging functional systems as human artefacts become part and parcel of Gaia. This\nfundamental fact is reflected in the data about human energy consumption, which, as has been\nemphasized by Kleidon, is already more than the energy flows that work in the geological\nprocesses. There is one prediction generated from this fundamental idea: The human economy\nwill always increase energy throughputs, in the average. Energy and knowledge are no\nsubstitutes, but two aspects of the same underlying physical process.\nOne pertinent empirical observation relates to the so-called 'rebounce effect', which refers to\nthe observation that technological improvements in energetic efficiency did never result into\nan absolute reduction of energy throughputs in the economy (Ayres 2005, Ayres et al. 2005,\n2008, Warr et al. 2008). This concurrence between economic growth and energy throughputs\nis a familiar proposition in ecological economics (see e.g. Kümmel 1998, Smil 2008: 335ff.),\nwhich could not be supported empirically with the required rigour unless in the recent\nreformulation presented by Ayres, which refers to exergy throughputs that, depending on\ntechnological parameters, transform into throughput of useful work. This restatement of the\nenergy/growth connection exactly matches with Kauffman's Fourth Law framework as\noutlined in this paper: Growth relates with work, and the external effects of growth relate with\ndissipation. So, I argue that the Ayres approach is the formal equivalent to the Kleidon model\nof Gaia in the context of the analysis of economic growth. Clearly, this leads to a fundamental\nreconsideration of the nature of economic growth; especially, the idea that growth and\necology are opposing principles is obsolete.\nIn this respect, there is one central question: What is the relation between economic growth\nand the growth of knowledge? The Gaia framework established in this paper starts out from\nthe fundamental assumption that all information is physical. In the economic setting, this\nwould imply that concepts and measures of economic growth, the growth of knowledge and\nthe growth of energy throughputs are just different ways to approach the same reality. This\nwould overturn common conceptions in many economic theories, where knowledge is just\ntreated as a non-material resource, i.e. a set of 'ideas' (Jones 2002). This is also true for\nconceptions of the 'noosphere' in philosophical approaches to ecology (for a survey, see Smil\n2003: 12f., 266f.), because in the concept of physiosemeiosis, all mental facts are physical\nfacts, too, hence part and parcel of the biosphere. In fact, all knowledge is 'recorded' in\nphysical structures which are being created, maintained, evolve or decay. Can we make sense\nof this idea in the context of economics?\nIn fact, energetic throughputs are increasingly harnessed by information processing activities\nin the economy, as compared to production in the sense of transformation of inputs into\n33\n\n\foutputs. The exact magnitude of these evolving proportions are difficult to assess, because\nexisting statistical categories do not directly match the required analytical categories. Further,\nthere is a strong impact of the evolving international division of labour which makes it\ndifficult to assess trends. For example, the importance of industry as the major consumer of\nenergy is further driven by the rise of emerging economies such as China, which rapidly\nincrease their material living standards. At the same time, this also triggers diverging\nstructural shifts in different countries, such as in the United States, which, partly a mirror\nimage to the Chinese development, specialize even more on information processing industries\nsuch as finance. That being said, the following back-on-the-envelope observations may give\nsome reliable hints at the developments.\nFollowing North (1990), we can distinguish between transformation costs and transaction\ncosts in the economy. Transaction costs are the costs of information processing in the broadest\nsense. The share of transaction costs in GDP is increasing continuously and seems to reach\nabout two thirds in advanced economies today (for a survey of the pertinent literature, see\nWang 2003, which goes back to the seminal work by North and Wallis 1986). The\nmethodology is intricate, because, for example, transaction costs in the financial industry\nactually refer to the information costs of information processing, which in turn relates with\ntransaction costs in other sectors of the economy. However, the essential observation is that\nthe share increases at all: The standard New Institutional Economics approach to transaction\ncosts would predict that economic development implies a decrease of transaction costs in the\neconomy: The transaction cost 'sector' would offer the service of reducing transaction costs.\nSo, the empirical observation contradicts the economic theory. In my framework, this\nobservation is plausible: transaction costs reflect the increasing energetic costs of information\nprocessing in the economy. This is different from the costs of organizing market transactions,\nbecause the increasing complexity of market transactions is driven by the increasing amount\nof information that is processed by markets, but what is mainly exogenous to them (such as\ntechnological knowledge).\nOne simple way to identify the energetic costs of information processing would be to assign\nthe measured energy throughput accordingly. The existing data on energy use go via the\ndifferent kinds of inputs which are measured in physical quantities and then transformed into\ncomparable energy measures (International Energy Agency 2010). We can then assign the\nsources to the sectors, which are defined according to the standard criteria. The problem is\nthat the sectoral activities also include a large element of information processing (e.g. an\nindustrial robot contains an advanced computer). On the other hand, the services sector\n34\n\n\fcertainly has a focus on information processing, but at the same time includes many\ntransformative processes (such as the haircut). In spite of these many inaccuracies, we can\nstate that especially for electricity, the share of industry and transport is decreasing, while\ntotal consumption of the 'others' category, which includes agriculture and services, is\ngrowing more than proportionally (between 1971 and 2008, total electricity consumption has\nrisen from 439 to 1446 Mtoe, with the 'others' category increasing from 194 to 819,9 Mtoe).\nThe same is true for gas. The picture is different for coal, where industry absolutely dominates,\nbut on a lower absolute level. Oil makes a strong difference, where transport is dominating\n(growing from 2250 to 3502 Mtoe). However, transport also includes a larger share of\ninformation processing costs, not only related to logistics, but also to the kind of transport (e.g.\nbusiness trips). In the aggregate, the 'others' category hovers around 30 percent between 1971\nand 2008. This has to be seen against a secular trend of declining shares of industry in total\nenergy consumption (Smil 2003: 56ff.). The strong role of transport in the recent decades\nseems to be also related to the evolution of offshoring industries and other forms of\ndistributed industrial processing, which in turn requires advanced information processing.\nOne indicator for this is the extremely high share of value-added that accrues to\nintermediators such as WalMart and which is shown in the large gap between the producer\nprice e.g. in China and the consumer end price: Transport costs in the narrow sense are only a\nminor part of these (Head et al. 2010).\nAnother difficulty is the estimation of the role of human costs of information processing. One\nalternative approach is just to use the shift in employment across sectors, which involves a\nrapid increase of the share of services employment in economic development. After all,\nhuman beings interact with all other information processing artefacts, and they do much of the\ninformation processing in the transformative activities. In this case, it is close to impossible to\nseparate the transformation costs from information processing costs, with the human brain\nbeing the most energy-intensive organ in the body. But there are illuminating additional\nobservations. One approach is to look at the energetic costs of buildings, which one can\nfurther distinguish across sectors (Smil 2008: 260ff.). The energetic costs of buildings\nincrease rapidly in developed nations and account already for a higher share than industry and\ntransport in the EU, 37 percent as compared to 28 and 32 percent (Pérez-Lombard et al. 2008).\nOf this, 26 percent is dwellings. According to forecasts, the building sector will be the\nstrongest growing user of energy in the future, which matches with an equal observation on\nthe services sector as the main driver of energy consumption. However, regarding my\nargument it is difficult to distinguish between information processing related costs and\n35\n\n\fconsumption: For example, heating and cooling of dwellings may count differently than of\noffice buildings. Yet, one can argue that one phenomenon clearly reflects the interaction\nbetween people and physical structures in the context of information processing, which is\nurbanization. Treating urbanization as a proxy for the information / energy link would have\nthe advantage to grasp the role of externalities in urban knowledge systems, which is also\nseen as a major driver of agglomeration. Then, one can argue that the distinction between\ndwellings and office buildings can be neglected, and the increasing energetic flows through\nurban structures would be the relevant measure, which can be also calculated as power density\n(Smil 2008: 308ff.).\nAnother possible approach is to measure the embodied energy in physical structures that\nrelate with information processing. The difficulty is that all physical structures also embody\ninformation, as has been seminally explored by Ayres (1994). This proposal comes close to\nChaisson's measure of free energy rate intensity, and after all, the embodied energy of chips\nby far surpasses those of other industrial goods (Smil 2008: 291). In this context, Odum's\n(2008) measure of emergy is also pertinent, if broken down to information processing\nstructures and activities.From these summary observations I conclude that the human economy reveals the same\nfeature as the Gaia system, that is, the conjoint expansion of information processing and\nrelated capacities and energetic throughputs. This is a profound insight, because it questions\none assumption that is at least intuitively present in many economic analyses of\nenvironmental issues, namely that knowledge and information are substitutes for energy or\ngenerally, the use of environmental resources. This assumption is false. The more information\naccumulates in the human economy, the larger the energetic throughputs become. In the\nphysiosemeiotic view, these two phenomena are actually one.\nI conclude. The Gaia hypothesis is one of the much-quoted, yet controversial conceptual\nframes in ecological economics. Recently, Kleidon has proposed a comprehensive view on\nthe Earth System that allows to reconsider its role. The central idea is to treat Gaia no longer\nas a homeostatic system, but to analyze it as a non-equilibrium thermodynamic system that\napproaches steady states which are defined according to the principle of Maximum Entropy\nProduction. I have shown that the central physical concept in analyzing Gaia, work, can be\nrelated to Kauffman's proposed 'Fourth Law' in thermodynamics, which can in turn be\nrendered as a precise hypothesis about the generation and the growth of information in Gaia if\nwe adopt a naturalistic version of Peirce's notion of semeiosis. That is, Gaia is a co-evolving\nsystem of signs and correlated functions driven by energetic throughputs and approaching\n36\n\n\fmaximum entropy production steady states indeterministically. This view allows for a richer\ndescription and analysis of the notion of hierarchy, which is also central in Kleidon's model.\nIn this overarching conception, we can also define a new naturalistic approach to the human\neconomy as an evolving knowledge system.\n\nReferences\nAnnila, Arto / Kuismanen, Esa (2009): Natural Hierarchy Emerges from Energy\nDispersal, BioSystems 95: 227-233.\nAnnila, Arto / Salthe, Stanley N. (2010): Physical Foundations of\nEvolutionary Theory, Journal of Non-Equilibrium Thermodynamics 35: 301321.\nAyres, Robert U. (1994): Information, Entropy, and Progress. A New\nEvolutionary Paradigm, New York: AIP Press.\nAyres, Robert U. (2005): Resources, Scarcity, Technology, and Growth, in:\nSimpson et al. (2005): 142-154.\nAyres, Robert U. / Warr, Benjamin (2003): Exergy, Power and Work in the US\nEconomy in: Energy- The International Journal 28: 219-273\nAyres, Robert U. / Warr, Benjamin (2005):. Accounting for Growth: The Role\nof Physical Work, in: Structural Change and Economic Dynamics 16(2):\n181-209.\nBejan, Adrian / Lorente, Sylvie (2006): Constructal Theory of Generation of\nConfiguration in Nature and Engineering, Journal of Applied Physics 100:\n041301.\nBejan, Adrian / Lorente, Sylvie (2010): The Constructal Law of Design and\nEvolution in Nature, Philosophical Transactions of the Royal Society B,\n365: 1335-1347.\nBen Jacob, Eshel / Shapira, Yoash / Tauber, Alfred I (2006): Seeking the\nFoundations of Cognition in Bacteria: From Schrödinger's Negative\nEntropy to Latent Information, in: Physica A 359: 495-524.\nBennett, Charles H. (2003): Notes on Landauer's Principle, Reversible\nComputation, and Maxwell's Demon, arXiv:physics/0210005\nBurch, Robert, \"Charles Sanders Peirce\", The Stanford Encyclopedia of\nPhilosophy (Spring 2010 Edition), Edward N. Zalta (ed.), forthcoming\nURL = <http://plato.stanford.edu/archives/spr2010/entries/peirce/>.\nCorning, Peter A. (2005): Holistic Darwinism. Synergy, Cybernetics, and the\nBioeconomics of Evolution, Chicago and London: Chicago University Press.\nDeely, J. (2001) Physiosemiosis in the semiotic spiral: a play of musement.\nSign Systems Studies 29: 27-48.\nDewar, Roderick C. (2005): Maximum-Entropy Production and Non-Equilibrium\nStatistical Mechanics, in: Kleidon and Lorenz (2005): 41-55.\nDewar, Roderick C. (2009): Maximum Entropy Production as an Inference\nAlgorithm that Translates Physical Assumptions into Macroscopic\nPredictions: Don' Shoot the Messenger, Entropy 2009, 11: 931-944.\nDewar, Roderick, C. / Porté, Annabel (2008): Statistical Mechanics Unifies\nDifferent Ecological Patterns, Journal of Theoretical Biology 251: 389403.\nDretske, Fred (1981/1999): Knowledge and the Flow of Information, Reprint,\nStanford: CSLI Publications.\nElitzur, A. / Dolev, S. / Kolenda, N., eds. (2005): Quo Vadis Quantum\nMechanics? Berlin et al.: Springer.\nElitzur, A. C. ( 2005) When form outlasts its medium: A definition of life\nintegrating Platonism and thermodynamics. In Seckbach, J. (Editor) Life\nas We Know it. Dordrecht: Kluwer Academic Publishers, 607-620.\n\n37\n\n\fEllis, George F. (2008): On the Nature of Causation in Complex Systems,\nhttp://www.mth.uct.ac.za/~ellis/Top-down%20Ellis.pdf (accessed January\n24, 2010).\nEriksson, Ralf / Anderssson, Jan Otto (2010): Elements of Ecological\nEconomics, Bingdon and New York: Routledge.\nFaber, Malte Michael, Manstetten Reiner, Proops John L. R. (1996):\nEcological Economics: Concepts and Methods, Edward Elgar.\nFrank, Steven A. (2009a): Natural Selection Maximizes Fisher Information,\nJournal of Evolutionary Biology 22: 231-244.\nFrank, Steven A. (2009b): The Common Patterns in Nature, Journal of\nEvolutionary Biology 22: 1563-1585.\nGarrett, Timothy J. (2009): Are There Basic Physical Constraints on Future\nAnthropogenic Emissions of Carbon Dioxide? Climatic Change, DOI\n10.1007/s10584-009-9717-9\nGarrett, Timothy J. (2009): Are There Basic Physical Constraints on Future\nAnthropogenic Emmissions of Carbon Dioxide? Climatic Change, DOI\n10.1007/s10584-009-9717-9\nGolan, Amos (2002): Information and Entropy Econometrics – Editor's View,\nJournal of Econometrics 107: 1-15.\nGould, Stephen Jay (2002): The Structure of Evolutionary Theory. Cambridge\nand London: Belknap.\nGrene, Marjorie, ed. (1983): Dimensions of Darwinism. Themes and\nCounterthemes in Twenti-eth-Century Evolutionary Theory, Cambridge et\nal. / Paris: Cambridge University Press / Editions de la Maison des\nSciences de l'Homme.\nGrönholm, Tiia / Annila, Arto (2007): Natural Distribution, Mathematical\nBiosciences 210: 659-667.\nHead, Keith, Jing Ran and Deborah L. Swenson (2010): From Beijing to\nBentonville: Do Multinational Retailers Link Markets? NBER Working\nPaper 16288.\nHerrmann-Pillath, Carsten (2010): Entropy, Function, and Evolution:\nNaturalizing Peircian Semiosis, Entropy 12, no. 2: 197-242,\nhttp://www.mdpi.com/1099-4300/12/2/197.\nHerrmann-Pillath, Carsten (2011): The Evolutionary Approach to Entropy:\nReconciling Georgescu-Roegen's Natural Philosophy with the Maximum\nEntropy Framework, Ecological Economics 70 (2011) 606–616.\nHerrmann-Pillath, Carsten / Salthe, Stanley N. (2011): Triadic Conceptual\nStructure of the Maximum Entropy Approach to Evolution, forthcoming in:\nBioSystems, penultimate version: http://arxiv.org/abs/1006.5505\nHoffmeyer, Jesper (2000): The Biology of Signification, Perspectives in\nBiology and Medicine 43(2): 252-268.\nInternational Energy Agency (2010): Key World Energy Statistics, Paris: IEA.\nJablonka, Eva / Lamb, Marion J. (2006): Evolution in Four Dimensions.\nGenetic, Epigenetic, Behavioral and Symbolic Variation in the History\nof Life, Cambridge and London: MIT Press.\nJaynes, E.T. (2003): Probability Theory. The Logic of Science, Cambridge:\nCambridge University Press.\nJaynes, Edward T. (1957a): Information Theory and Statistical Mechanics,\nThe Physical Review 106(4): 620-630.\nJaynes, Edward T. (1965): Gibbs vs. Boltzmann Entropies, American Journal\nof Physics, 33(5): 391-398.\nJones, Charles I. (2002): Sources of U.S. Economic Growth in a World of\nIdeas, American Economic Review 92(1): 220-239.\nKauffman, Stuart (2000): Investigations, Oxford: Oxford University Press.\nKauffman, Stuart A. (1993): The Origins of Order, Self-Organization and\nSelection in Evolution, New York/Oxford: Oxford University Press.\nKleidon, Axel (2009): Non-equilibrium Thermodynamics and Maximum Entropy\nProduction in the Earth System: Applications and Implications,\nNaturwissenschaften 96: 653-677.\nKleidon, Axel (2010): Non-equilibrium Thermodynamics, Maximum Entropy\nProduction and Earth-system evolution, Philosophical Transactions of\nthe Royal Society A, 368: 181-196.\n\n38\n\n\fKleidon, Axel (2011): Life, Hierarchy, and the Thermodynamic Machinery of\nPlanet Earth, Physics of Life Reviews 7: 424-460.\nKleidon, Axel and Ralph Lorenz, eds. (2005): Non-equilibrium Thermodynamics\nand the Production of Entropy. Life, Earth, and Beyond, Heidelberg et\nal.: Springer.\nKümmel, Reiner (1998): Energie und Kreativität. Stuttgart / Leipzig:\nTeubner.\nLahav, Noam / Nir, Shlomo / Elitzur, Avshalom C. (2001): The Emergence of\nLife on Earth, in: Progress in Biophysics and Molecular Biology 75: 75120.\nLandauer, Rolf (1961/2000): Irreversibility and Heat Generation in the\nComputing Process (reprint), IBM Journal of Research and Development\nVol. 44 (1/2): 261-269.\nLotka, Alfred (1922a): Contribution to the Energetics of Evolution, in:\nProceedings of the National Academy of Sciences 8: 147-151.\nLotka, Alfred (1922b): Natural Selection as a Physical Principle,\nProceedings of the National Academy of Sciences 8: 151-154.\nLovelock, James E. (19909: Hands up for the Gaia hypothesis, Nature 344\n(6262): 100–102.\nLovelock, James E. / Margulis, Lynn (1974): Atmospheric Homeostasis For and\nBy the Biosphere: The Gaia Hypothesis, Tellus 26 (1-2): 2-10.\nMacdonald, Graham / Papineau, David, eds. (2006b): Teleosemantics. New\nPhilosophical Essays, Oxford / New York: Oxford University Press.\nMäkelä, Teemu / Annila, Arto (2010): Natural Patterns of Energy Dispersal,\nPhysics of Life Reviews 7: 477-498.\nMargulis, Lynn (1999): Symbiotic Planet: A New Look At Evolution. Houston:\nBasic Book.\nMaroney, Owen (2009): Information Processing and Thermodynamic Entropy, The\nStanford Encyclopedia of Philosophy (Fall 2009 Edition), Edward N.\nZalta (ed.), URL =\n<http://plato.stanford.edu/archives/fall2009/entries/informationentropy/>.\nMartyushev, L.M. / Seleznev, V.D. (2006): Maximum Entropy Production\nPrinciple in Physics, Chemistry and Biology, Physics Reports 426: 1-45.\nMaynard Smith, John/Szathmáry, Eörs (1995): The Major Transitions in\nEvolution, Oxford/New York: Freeman.\nMillikan, Ruth (1989): Biosemantics, Journal of Philosophy 86: 281-297.\nNeander, Karen, \"Teleological Theories of Mental Content\", The Stanford\nEncyclopedia of Philosophy (Winter 2009 Edition), Edward N. Zalta (ed.),\nURL = <http://plato.stanford.edu/archives/win2009/entries/contentteleological/>.\nNiven, Robert K. (2010): Minimization of a Free-energy-like Potential for\nNon-Equilibrium Flow Systems as Steady State, Philosophical\nTransactions of the Royal Society B 365: 1323-1331.\nNorth, Douglass C. (1990): Institutions, Institutional Change, and Economic\nPerformance, Cambridge et al.: Cambridge University Press.\nWallis, John Joseph and Douglass C. North. 1986. \"Measuring the transaction\nsector in the American economy, 1870-1970,\" with a Comment by Lance\nDavis. In Long-Term Factors in American Economic Growth, edited by\nStanley L. Engerman and Robert E. Gallman. University of Chicago Press.\nOdling Smee, F. John / Laland, Kevin N. / Feldman, Marcus W. (2003): Niche\nConstruction. The Neglected Process in Evolution, Princeton:Princeton\nUniversity Press.\nOdum, Howard T. (2007): Environment, Power, and Society for the TwentyFirst Century. The Hierarchy of Energy, New York: Columbia University\nPress.\nPaltridge, Garth W. (2009): A Story and a Recommendation about the\nPrinciple of Maximum Entropy Production, Entropy 2009, 11: 945-948.\nPatterson, Murray / Glavovic, Bruce, eds. (2008): Ecological Economics of\nthe Oceans and Coasts, Edward Elgar.\nPérez-Lombard, Luis / Ortiz, José / Pout, Christine (2008): A Review on\nBuildings Energy Consumption Information, Energy and Bulidings 40: 394398.\n\n39\n\n\fPopper, K.R. (1972): Objective Knowledge. An Evolutionary Approach, Oxford:\nClarendon.\nPopper, Karl R. (1982): The Open Universe. An Argument for Indeterminism.\nLondon et al.: Hutchinson.\nRiedl, Rupert (1983): The Role of Morphology in the Theory of Evolution, in:\nGrene (1983): 205-240.\nRobinson, Andrew / Southgate, Christopher (2010): A General Definition of\nInterpretation and Its Application in Origin of Life Research, Biology\n& Philosophy 25: 163-181.\nSalthe, Stanley N. (1986): Evolving Hierarchical Systems: Their Structure\nand Representation. New York: Columbia Uiversity Press.\nSalthe, Stanley N. (1993): Development and Evolution. Complexity and Change\nin Biology, Cambridge/London: MIT Press.\nSalthe, Stanley N. (2002): Summary of the principles of hierarchy theory,\nGeneral Systems Bulletin 31: 13-17.\nSalthe, Stanley N. (2007a): Meaning in Nature: placing biosemiotics in\npansemiotics. In M. Barbieri (ed) Biosemiotics: Information, Codes and\nSigns in Living Systems. New York: Nova Publishers. Chapter 10.\nSalthe, Stanley N. (2007b): The Natural Philosophy of Work, Entropy 9: 8399.\nSchrödinger, E. (1944): What Is Life? The Physical Aspect of the Living\nCell, Cambridge: Cambridge University Press:.\nSmil, Vaclav (2002): The Earth's Biosphere. Evolution, Dynamics, and Change,\nCambridge and London: MIT Press.\nSmil, Vaclav (2003): Energy at the Crossroads. Global Perspectives and\nUncertainties, Cambridge and London: MIT Press.\nSmil, Vaclav (2008): Energy in Nature and Society. General Energetics of\nComplex Systems, Cambridge and London: MIT Press.\nStone, Thomas L. (2007): Peirce's Theory of Signs, Cambridge: Cambridge\nUniversity Press.\nŠunde, Charlotte (2008): The Open Horizon: Exploring the Spiritual and\nCultural Values of Our Oceans and Coasts, in: Patterson and Glavovic\n(2008): 166-186.\nTauber, Alfred (2006): The Biological Notion of Self and Non-self, The\nStanford Encyclopedia of Philosophy (Spring 2006 Edition), Edward N.\nZalta (ed.), URL =\n<http://plato.stanford.edu/archives/spr2006/entries/biology-self/>.\nUlanowicz, Robert E. (1997): Ecology, the Ascendent Perspective, New York:\nColumbia University Press.\nUlanowicz, Robert E. (1997): Ecology, the Ascendent Perspective, New York:\nColumbia University Press.\nUlanowicz, Robert E. / Goerner, Sally J. / Lietaer, Bernard / Gomez, Rocio\n(2009): Quantifying Sustainability: Resilience, Efficiency and the\nReturn of Information Theory, Ecological Complexity 6(2009): 27-36.\nVallino, Joseph J. (2010): Ecosystem Biogeochemistry Considered as a\nDistributed Metabolic Network Ordered by Maximum Entropy Production,\nPhilosophical Transactions of the Royal Society B, 365: 1417-1427.\nVehkavaara, Tommi (2002): Why and How to Naturalize Semiotic Concepts for\nBiosemiotics, Sign System Studies 30(1):293-313.\nVemulapalli, G.K. (2006): Physics in the Crucible of Chemistry: Ontological\nBoundaries and Epistemological Blueprints, in: Baird et al. (2006):\n191-206.\nVermeij, Geerat J. (2004): Nature: An Economic History, Princeton and\nOxford: Princeton University Press.\nVermeij, Geraat J. (2009): Comparative Economics: Evolution and the Modern\nEconomy, Journal of Bioeconomics 11: 105-134.\nWallis, John Joseph and North, Douglass C. (1986): Measuring the\ntransaction sector in the American economy, 1870-1970, In Long-Term\nFactors in American Economic Growth, edited by Stanley L. Engerman and\nRobert E. Gallman. University of Chicago Press.\nWarr, Benjamin / Schandl, Heinz / Ayres, Robert U. (2008): Long Term Trends\nin Resource Exergy Consumption and Useful Work Supplies in the UK, 1900\nto 2000, Ecological Economics 68: 126-140.\n\n40\n\n\fWhitfield, John (2005): Order Out of Chaos. Nature 436: 905-907.\nWhitfield, John (2007): Survival of the Likeliest? PloS Biology 5(5): 962965.\nWolpert, David H. (2008): Physical Limits to Inference, arXiv:0708.1362v2.\nWright, L. (1973): Functions, Philosophical Review 82: 139-168.\nZeh, H. Dieter (2005): Entropie, Frankfurt: Fischer.\nZehe, Erwin / Blume, Theresa / Blöschl, Günter (2010): The Principle of\n'Maximum Energy Dissipation': A Novel Thermodynamic Perspective on\nRapid Water Flows in Connected Soil Structures, Philosophical\nTransactions of the Royal Society B 365: 1377-1386.\n\n41\n\n\f"}