{"id": "http://arxiv.org/abs/0908.2395v3", "guidislink": true, "updated": "2010-02-01T15:51:48Z", "updated_parsed": [2010, 2, 1, 15, 51, 48, 0, 32, 0], "published": "2009-08-17T16:53:47Z", "published_parsed": [2009, 8, 17, 16, 53, 47, 0, 229, 0], "title": "Dynamics of Moduli and Gaugino Condensates in an Expanding Universe", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0908.0818%2C0908.1022%2C0908.1816%2C0908.0098%2C0908.0056%2C0908.4089%2C0908.3482%2C0908.2359%2C0908.1102%2C0908.4444%2C0908.3524%2C0908.0187%2C0908.0355%2C0908.0555%2C0908.3192%2C0908.2395%2C0908.1566%2C0908.2903%2C0908.0303%2C0908.2663%2C0908.3412%2C0908.0450%2C0908.1233%2C0908.3591%2C0908.4465%2C0908.2968%2C0908.1687%2C0908.2961%2C0908.0613%2C0908.4512%2C0908.3509%2C0908.0225%2C0908.4473%2C0908.4299%2C0908.3698%2C0908.1447%2C0908.4509%2C0908.1113%2C0908.2798%2C0908.3480%2C0908.1428%2C0908.0136%2C0908.0632%2C0908.2149%2C0908.0316%2C0908.4255%2C0908.1408%2C0908.4454%2C0908.2681%2C0908.3597%2C0908.1705%2C0908.0939%2C0908.0104%2C0908.3882%2C0908.3443%2C0908.2932%2C0908.0195%2C0908.1801%2C0908.0236%2C0908.4460%2C0908.3990%2C0908.3666%2C0908.2613%2C0908.0362%2C0908.3830%2C0908.0110%2C0908.1605%2C0908.0301%2C0908.3457%2C0908.4167%2C0908.4195%2C0908.2720%2C0908.3642%2C0908.0773%2C0908.3984%2C0908.3510%2C0908.3635%2C0908.2969%2C0908.1715%2C0908.3281%2C0908.4087%2C0908.0145%2C0908.1476%2C0908.2065%2C0908.0556%2C0908.3809%2C0908.2609%2C0908.3704%2C0908.2693%2C0908.0844%2C0908.2186%2C0908.0414%2C0908.3459%2C0908.4136%2C0908.0783%2C0908.1788%2C0908.3784%2C0908.0576%2C0908.0129%2C0908.3371%2C0908.1190&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Dynamics of Moduli and Gaugino Condensates in an Expanding Universe"}, "summary": "We study dynamical moduli stabilization driven by gaugino condensation in\nsupergravity. In the presence of background radiation, there exists a region of\ninitial conditions leading to successful stabilization. We point out that most\nof the allowed region corresponds to initial Hubble rate H close to the scale\nof condensation \\Lambda, which is the natural cutoff of the effective theory.\nWe first show that including the condensate dynamics sets a strong bound on the\ninitial conditions. We then find that (complete) decoupling of the condensate\nhappens at H about two orders of magnitude below \\Lambda. This bound implies\nthat in the usual scenario with the condensate integrated out, only the\nvicinity of the minimum leads to stabilization. Finally, we discuss the effects\nof thermal corrections.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0908.0818%2C0908.1022%2C0908.1816%2C0908.0098%2C0908.0056%2C0908.4089%2C0908.3482%2C0908.2359%2C0908.1102%2C0908.4444%2C0908.3524%2C0908.0187%2C0908.0355%2C0908.0555%2C0908.3192%2C0908.2395%2C0908.1566%2C0908.2903%2C0908.0303%2C0908.2663%2C0908.3412%2C0908.0450%2C0908.1233%2C0908.3591%2C0908.4465%2C0908.2968%2C0908.1687%2C0908.2961%2C0908.0613%2C0908.4512%2C0908.3509%2C0908.0225%2C0908.4473%2C0908.4299%2C0908.3698%2C0908.1447%2C0908.4509%2C0908.1113%2C0908.2798%2C0908.3480%2C0908.1428%2C0908.0136%2C0908.0632%2C0908.2149%2C0908.0316%2C0908.4255%2C0908.1408%2C0908.4454%2C0908.2681%2C0908.3597%2C0908.1705%2C0908.0939%2C0908.0104%2C0908.3882%2C0908.3443%2C0908.2932%2C0908.0195%2C0908.1801%2C0908.0236%2C0908.4460%2C0908.3990%2C0908.3666%2C0908.2613%2C0908.0362%2C0908.3830%2C0908.0110%2C0908.1605%2C0908.0301%2C0908.3457%2C0908.4167%2C0908.4195%2C0908.2720%2C0908.3642%2C0908.0773%2C0908.3984%2C0908.3510%2C0908.3635%2C0908.2969%2C0908.1715%2C0908.3281%2C0908.4087%2C0908.0145%2C0908.1476%2C0908.2065%2C0908.0556%2C0908.3809%2C0908.2609%2C0908.3704%2C0908.2693%2C0908.0844%2C0908.2186%2C0908.0414%2C0908.3459%2C0908.4136%2C0908.0783%2C0908.1788%2C0908.3784%2C0908.0576%2C0908.0129%2C0908.3371%2C0908.1190&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We study dynamical moduli stabilization driven by gaugino condensation in\nsupergravity. In the presence of background radiation, there exists a region of\ninitial conditions leading to successful stabilization. We point out that most\nof the allowed region corresponds to initial Hubble rate H close to the scale\nof condensation \\Lambda, which is the natural cutoff of the effective theory.\nWe first show that including the condensate dynamics sets a strong bound on the\ninitial conditions. We then find that (complete) decoupling of the condensate\nhappens at H about two orders of magnitude below \\Lambda. This bound implies\nthat in the usual scenario with the condensate integrated out, only the\nvicinity of the minimum leads to stabilization. Finally, we discuss the effects\nof thermal corrections."}, "authors": ["Chloe Papineau", "Marieke Postma", "Saul Ramos-Sanchez"], "author_detail": {"name": "Saul Ramos-Sanchez"}, "author": "Saul Ramos-Sanchez", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1088/1475-7516/2010/02/017", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/0908.2395v3", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0908.2395v3", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "15 pages, 6 figures; v2: fig. 6 corrected, sec. 4 clarified,\n  reference added; v3: matches the version published in JCAP", "arxiv_primary_category": {"term": "hep-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "hep-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "hep-th", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0908.2395v3", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0908.2395v3", "journal_reference": "JCAP 1002:017,2010", "doi": "10.1088/1475-7516/2010/02/017", "fulltext": "arXiv:0908.2395v3 [hep-ph] 1 Feb 2010\n\nDESY-09-126\nNIKHEF/2009-017\n\nDynamics of Moduli and Gaugino Condensates in an\nExpanding Universe\nChloé Papineaua, Marieke Postmab and Saúl Ramos-Sáncheza\n\na\nb\n\nDeutsches Elektronen-Synchrotron DESY, Hamburg, Germany\nNIKHEF, Kruislaan 409, 1098 Amsterdam, The Netherlands\n\nAbstract\nWe study dynamical moduli stabilization driven by gaugino condensation in supergravity. In\nthe presence of background radiation, there exists a region of initial conditions leading to\nsuccessful stabilization. We point out that most of the allowed region corresponds to initial\nHubble rate H close to the scale of condensation Λ, which is the natural cutoff of the effective\ntheory. We first show that including the condensate dynamics sets a strong bound on the\ninitial conditions. We then find that (complete) decoupling of the condensate happens at H\nabout two orders of magnitude below Λ. This bound implies that in the usual scenario with\nthe condensate integrated out, only the vicinity of the minimum leads to stabilization. Finally,\nwe discuss the effects of thermal corrections.\n\n\f1\n\nIntroduction\n\nHigher dimensional supersymmetric theories such as string theory are good candidates to explain\nthe origin of four-dimensional physics at low energies. In general, compactification of the additional dimensions yields a large vacuum degeneracy, parametrized in terms of the so-called moduli\nfields. In order to reproduce our observable universe and its particle content, consistent higher dimensional theories must offer some mechanisms to fix the mass and the vacuum expectation value\n(vev) of the moduli. In type IIB string compactifications, nontrivial background fluxes stabilize\nmost of the geometrical moduli [1], but leave some other flat directions unlifted. In particular, the\noverall volume parametrized by a Kähler modulus σ is not fixed and hence requires the inclusion\nof nonperturbative effects [2–4].\nGaugino condensation [5,6] is perhaps the best understood and most successful such mechanism\ncapable of providing masses to moduli. It is a key ingredient in racetrack models [7], models with\nKähler stabilization [8], and the Kachru-Kallosh-Linde-Trivedi (KKLT) scenario [9]. The success\nof these models relies on the assumption that the condensate forms at a high scale, inducing an\neffective scalar potential for moduli. However, it is known that dynamical stabilization of moduli is\nfragile and depends on the particulars of the universe evolution [10]. If the cosmological expansion\nis dominated by some energy source other than the moduli, such as radiation or vacuum energy,\nthe initial conditions leading to stabilization may be less restricted than in a modulus dominated\nuniverse. This statement has been confirmed in matter and radiation dominated scenarios [11–13]\nincluding finite temperature corrections [14].\nDespite this progress, there is no reason to believe that only moduli dynamics will be affected\nby the evolution of the universe. Indeed, it has been recently shown that in a universe undergoing\nfast expansion, the condensate itself may be destabilized leading to unsuccessful moduli stabilization [15]. Thus, also the condensate is altered by the presence of additional sources of energy.\nWhether gaugino condensation occurs depends on the dynamics of the gaugino pairs, which can be\ndescribed in terms of a complex (super)field u in the Veneziano–Yankielowicz (VY) approach [5].\nIn the present work we take this view seriously and study the consequences of the interaction\nbetween the condensate and background radiation upon moduli stabilization. The main questions\nwe will be concerned with are:\n• when can the condensate field u be safely integrated out without introducing inconsistencies\nin the theory?\n• for which initial conditions does gaugino condensation lead dynamically to moduli stabilization?\nWe shall show that for most configurations that lead to moduli stabilization, the condensate cannot\nbe integrated out and its dynamics must be considered. Although, for illustrative purposes, we\nshall focus on the KKLT model, it is straightforward to extend our findings to any model of moduli\nstabilization driven by gaugino condensation, where similar results are expected.\n\n2\n\nSingle field dynamics\n\nAs mentioned above, we consider the KKLT model [9] for moduli stabilization in the context of\ntype IIB string theory. After fixing the complex structure moduli and the dilaton, the effective low\nenergy N = 1 four-dimensional supergravity theory only contains the volume modulus σ, which is\n2\n\n\fstabilized by gaugino condensation.1 More specifically, an SU(N ) gauge theory localized on D7branes wrapped around the compactification volume has a field-dependent coupling2 g2 = 1/σr .\nIf this sector is asymptotically free, it undergoes gaugino condensation below a dynamical scale\nΛ. Using the VY approach [5], it has been shown [17] that the only Kähler and superpotential\nconsistent with all symmetries are\n\u0010\nuū \u0011\n,\n(2.1)\nK = −3 ln σ + σ̄ −\n3\nW = u3 ( σ + 2c ln u ) ,\n3\na\na\na a\nwhere the chiral superfield\n\u0001 u ∝ Tr W W admits the condensate λ λ as lowest component. The\n2\nconstant c = 3N/ 16π is the one-loop beta function coefficient.\nIn supergravity, the scalar potential is given by\ni\nh\n,\n(2.2)\nV = eK K i ̄ Di W D ̄ W − 3 |W |2\n\nwhere K i ̄ = (Kı̄j )−1 is the inverse Kähler metric, and Di W = Wi + Ki W is the usual covariant\nderivative defined over the Kähler manifold. In the limit of small u ≪ 1, the dominant contribution\nto the potential is\nVF ≃ eK |Du W |2 K uū ,\n\n(2.3)\n\nwhich has as extrema W = 0, Wu ≃ 0 and Wuu ≃ 0, or\n\u0013\n\u0012\n\u0013\n\u0012\n1\n5\nσ\nσ\n,\nu = umax = exp − −\n.\nu = 0,\nu = umin = exp − −\n2c 3\n2c 6\n\n(2.4)\n\nThe first solution W = u = 0 formally corresponds to a supersymmetric chirally invariant vacuum.\nHowever, the existence of such a vacuum is inconsistent [18, 19]. Arguably, this minimum can\nbe interpreted as an unstable nonsupersymmetric state [20], where the VY potential cannot be\ntrusted. The other two solutions correspond to a minimum and a barrier separating it from the\nunphysical state at the origin. Note that they are close in field space. The minimum umin is the\nVY-solution corresponding to gaugino condensation. Thus, we define the condensation scale\nΛ ≡ umin .\n\n(2.5)\n\nThe mass of the field u around the minimum is of order Λ, and therefore the field can be integrated\nout at energies below this scale. Plugging the result into (2.1), expanding in small uū and adding\na constant W0 arising from integrating out the flux-stabilized moduli, we recover the familiar\nKKLT potential\nK = −3 ln (σ + σ̄) ,\nW\n\n= W0 + WNP = W0 + A e−aσ ,\n\n(2.6)\n\nand identify A = −1/ (ae), a = 3/ (2c). Note that for reasonable gauge groups, the constant a is\nbigger than one. Also, the inclusion of W0 in (2.1) does not significantly displace the position of\nthe extrema (2.4).\n1\n\nNote that a similar scenario arises in the weakly coupled heterotic string [16], where σ has to be replaced by\nthe dilaton S.\n2\nFrom now on, the subscripts r and i denote respectively real and imaginary parts of the fields.\n\n3\n\n\fHaving clarified how gaugino condensation generates an effective potential for the modulus,\nwe turn our attention to the single field KKLT model. As is well known, the scalar potential (2.2)\nfor σ exhibits a supersymmetric minimum\n\u001b\n\u001a\na (σmin + σ̄min )\n−aσmin\nW0 = − Ae\n,\n(2.7)\n1 +\n3\nVmin = −\n\nA2 a2 e−a(σmin +σ̄min )\n< 0,\n3 (σmin + σ̄min )\n\nof negative energy. We include a supersymmetry-breaking uplifting term\nVup =\n\nC\n,\nXp\n\n(2.8)\n\nwhere X = e−K/3 and C may be tuned so as to obtain a Minkowski vacuum. In the KKLT\nscenario the uplift is provided by an anti D3-brane in a throat (in the bulk) of the compactification\nmanifold, which gives p = 2 (p = 3). The minimum (2.7) is then separated from the runaway\nsolution by a barrier whose height is set by the gravitino mass.\nBefore discussing the dynamics of the system, let us comment on the approximations upon\nwhich we rely in the remainder of the paper. It is known that (warped) string-inspired constructions, such as KKLT, receive additional contributions, e.g. α′ corrections [21], open-string loop\ncorrections [22] and corrections due to (strong) warping [23, 24]. Although they may significantly\nalter the form (2.1) of the supergravity action [25], we do not incorporate these effects in our\nstudy. Our main concern is to understand whether a gaugino condensate can be integrated in/out\nwhen the dynamics of a modulus is taken into account. As such, we perform a comparative study\nbetween the single field behavior and the full system evolution. The corrections mentioned above\nare in this sense somewhat orthogonal to our purpose, and should not affect our conclusions.\nMoreover, let us emphasize again that we focus on the KKLT model as an illustrative example.\nOur observations hold for all moduli stabilization scenarios which rely on gaugino condensation,\nincluding for instance those without warping.\n\n2.1\n\nDynamical stabilization\n\nThe barrier separating the KKLT minimum from the runaway solution at infinity is small compared to any other natural scales in the problem. This is true, in particular, for the phenomenologically favored case of low-energy supersymmetry breaking. At the same time, the scalar potential\nis exponentially steep. One can therefore wonder how likely it is that the modulus will end up in\nthe right minimum and not roll off to infinity. This is known as the overshoot problem, and has\nfirst been recognized in [26]. Dynamically, the higher the energy with which the field starts its\ndynamical evolution, the more friction is needed in order to slow it down so that it finally settles\nin the minimum.\nIn [10–14], it was shown that the presence of a background fluid can help avoiding the overshoot problem by providing the necessary friction. Indeed, there exists a relatively large range of\ninitial conditions that lead to successful stabilization. Clearly, this range grows with the initial\nbackground density, see e.g. Fig. 1 and 2 in [14]. Throughout this paper, we consider the background fluid to be composed of radiation. This allows us to work in a model-independent way. If\nthe expansion of the universe were instead driven by matter or vacuum energy density, the condensate would acquire a large mass of order H 2 with a model dependent coefficient. Moreover, as\n4\n\n\fwas shown in [15], if the background field gives the dominant contribution to SUSY breaking, the\ninduced mass term destabilizes the gaugino minimum at a scale H ∼ cΛ, with c ≪ 1, somewhat\nbelow the condensation scale (2.5). In a radiation dominated universe, the Hubble induced mass\nfor the condensate and the volume modulus is small and can be neglected at tree level [27]. For\ninstance, a coupling of the form uu∗ Tμμ , where T is the stress-energy tensor of radiation, vanishes\nat tree level. One might however worry that this is not necessarily the case at one loop. We will\ncome back to this point in Section 4 when we consider finite temperature corrections.\nIn supergravity, the dynamics of a set of fields φi with non-canonical kinetic terms is described\nby the equations of motion\nφ̈i + 3H φ̇i + Γij k φ̇j φ̇k + K i ̄ ∂̄ V = 0 ,\nwhere the Christoffel symbols are Γij k = K i l̄\nconstraint:\n3H 2 = Lkin + V + ργ\n\n(2.9)\n\n∂Kj l̄\n.\n∂φk\n\nThe Hubble radius is subject to the Friedmann\n(2.10)\n\n,\n\nwhere Lkin = Ki ̄ φ̇i φ̄ ̇ ̄ , and the energy density of the background radiation satisfies\nρ̇γ + 4Hργ = 0\n\n⇒\n\nργ = ργ, ini e−4N ,\n\n(2.11)\n\nwhere in the last equality, we have used as time variable the number of e-folds N = ln R, with R the\nscale factor (recall that H = Ṙ/R). Here and in the following we use a subscript ini to denote the\ncorresponding quantity at the initial time N = 0. Without the background component, any initial\nconditions satisfying V (σini ) > V (σmax ) will lead to overshoot of the fields and consequently to a\nphenomenologically unacceptable runaway solution. However, as mentioned before, if the energy\ndensity in the universe is dominated by radiation, the evolution of the scalar fields is damped,\nand a much larger range of initial conditions leads to modulus\nstabilization. This effect enters the\np\nequations of motion (2.9) via a large Hubble rate H ≃ ργ /3.\nThe explicit equations of motion derived from (2.9) for the KKLT model are given in Appendix A. Eqs. (A.5) in the case of the potential (2.6) can be solved numerically. With this\npurpose, we assume that the field has vanishing initial velocity Πσ, ini = 0. Following [12, 14], we\nparametrize the initial radiation as\nργ, ini =\n\nΩγ\nV (σr, ini ) ,\n1 − Ωγ\n\n(2.12)\n\nwhere we used the fractional energy density in radiation Ωγ = ργ,ini /(3H 2 ). Note that for Ωγ ≥ 1/2\nradiation initially dominates. An example of modulus stabilization is given in Fig. 1, where we\nhave taken Ωγ = 0.99. The rest of the parameters is given as in [9, 12], i.e A = 1, a = 0.1 and\nm3/2 ≃ 1 TeV. The constant W0 and C are deduced from (2.7) and (2.8).\n\n2.2\n\nConsistency Condition\n\nAs σr rolls down the KKLT potential in the presence of the thermal fluid (2.11), the corresponding\nscale Λ = umin = exp [− (aσr + 1) /3] evolves as well. Indeed, only when the modulus is settled\nin its minimum does the gauge coupling of the hidden sector stabilize as well. In order for the\npotential to follow effectively from (2.6), we have to ensure that condensation does occur even as\n\n5\n\n\f350\nΣmin\n\n300\n\n0.15\n250\n200\n150\n\n0.10\n\nΣr HNL\n\nLHNL\n0.05\n\n100\n50\n0\n0\n\nHHNL\n0.00\n5\n\n10\n\n0\n\n15\n\n5\n\n10\n\n15\n\nN\n\nN\n\nFigure 1: Example of initial condition leading to stabilization. The left panel shows the evolution of the\nfield with time, in this case σr, ini ≃ 40. The dashed green line gives the position of the minimum. On the\nright figure is plotted the evolution of Λ (red, dashed line) and H (blue, solid line) with time.\n25\n\n-1\n\n15\n\nHini > Lini\n\nHini > 10 Lini\n\nΣi,ini\n\n20\n\n10\n5\n0\n\n50\n\n100\n\n150\n\n200\nΣr,ini\n\n250\n\n300\n\n350\n\nFigure 2: Set of initial conditions {σr, ini , σi, ini } leading to stabilization at the minimum of the KKLT\npotential for ργ, ini = 10−4 , A = 1, a = 0.1 and m3/2 = 1 TeV. The solid line corresponds to the result\nof [14]. The darker region can be excluded since Hini > Λini .\n\nthe modulus is dynamically evolving. In other words, there is a natural consistency condition:\nthe Hubble rate H has to be smaller than the condensation scale Λ at all times.\nIt can be seen from the right plot of Fig. 1 that the scale Λ for this specific example is indeed\nhigher than H and remains as such with time. Actually, because the field starts with vanishing\nvelocity, it is clear that if Hini . Λini , then the same holds at later times.\nIn Fig. 2 we show how the region of successful initial conditions for σ found in [12] is modified\nonce we require that these points are consistent with having the condensate initially formed.\nActually, even if the condensate is initially formed, and thus remains so at later times, it is\nlegitimate to wonder below which scale it can be safely integrated out. This is why we also show\nthe bound Hini ≤ 10−1 Λini in Fig. 2. Formally, a field can be integrated out once its oscillations\naround its minimum are negligible. Hence, for a large range of initial parameters, consistency\nrequires that we integrate the condensate in, and consider the whole system (2.1) together with\nW0 . In the next section, we let the two fields evolve and study the region of stabilization, putting\nparticular emphasis on the way the condensate may be integrated back out.\n\n6\n\n\f3\n\nDynamics of the gaugino-modulus system\n\nIn this section we discuss the dynamics of the Kähler modulus with the gaugino condensate\nintegrated in. For simplicity, in what follows, we concentrate on the real parts of σ and u, and\nomit subscripts. Dynamics of the imaginary parts shall be treated elsewhere [28].\nThe VY effective potential for gaugino condensate u is given in (2.1), the additional uplift\nterm in (2.8). As the Hubble scale approaches the condensation scale, the evolution of the full\ncondensate-modulus system starts to deviate from the KKLT description, which is only a good\napproximation for small u when (2.3) is valid. This can be seen explicitly from the F-term potential\n\u0014\n\u0015\n1\n1\n6\n3\n2 4\nVF = 2 −2W0 u + (2c + 3σ + 6c ln u) u + (4c + 2σ)u\nX\n3\n\n(3.1)\n\nwith X = e−K/3 , as before. The quartic term in VF is proportional to |Wu |2 . In the limit that\nu ≪ 1 and W0 small, both the cubic and the u6 term are subdominant, and we recover the VY\nresult that Wu = 0 minimizes the potential. The scalar potential is a surface; it exhibits a valley\nof attraction corresponding to the direction umin (σ). This valley is much steeper in the condensate\ndirection than along the modulus direction. Along the u direction there is a barrier separating\nthe \"good\" minimum, from the state at u = 0; in the modulus direction there is the usual barrier\nseparating the \"good\" KKLT minimum from the runaway solution at infinity.\nThe equations of motion for σ and u momenta in a spatially flat Friedmann-Robertson-Walker\nspacetime are given by (A.4). As before, we assume an homogeneous background radiation energy\ndensity, which evolves in an expanding universe according to (2.11).\nWe integrated numerically the equations of motion for the real fields {σ, u} keeping the phases\nfixed at their instantaneous minimum. The free parameters in the model are c, W0 (which determines the vacuum gravitino mass), and Ωγ . In what follows, we choose c = 1/7 and a)\nW0 = 10−6 and b) W0 = 10−8 . For these parameters, the minimum with the modulus stabilized is at σmin = 1.22 (1.68) and u0 = umin (σmin ) = 0.01 (0.002) for W0 = 10−6 (10−8 ).\nDemanding a Minkowski vacuum, we obtain the uplifting parameter C ∼ 3 * 10−13 (3 * 10−17 ) for\nW0 = 10−6 (10−8 ). We used relatively large values of W0 , giving rise to high scale supersymmetry\nbreaking, because of numerical convenience. Nevertheless, we expect that our qualitative results\ncan be straightforwardly extrapolated to lower scales.\nIn our study, we take a conservative approach and assume that whenever u jumps the barrier at\numax and is driven towards the state at the origin, the gauginos do not condense and, consequently,\nσ does not get stabilized. Apart from an understanding of the physics at the minimum u = 0,\ndiscussing the dynamics of u in this case requires to include quantum effects, such as particle\nproduction of fields which are light at the special symmetry point at the origin [29]. Particle\nproduction damp the motion of u, possibly trapping it in the region |u| < umax and leaving our\nresults untouched. Another possibility is that the field has enough momentum to go through the\norigin and bounce back over the barrier to end up at umin . This could open up an additional\nregion of preferable initial conditions, which nonetheless will strongly depend on the details of the\npotential near the origin.\n\n3.1\n\nWhen can the gaugino condensate safely be integrated out?\n\nThe first issue to address is to determine for which initial energy scales Hini it is a good approximation to integrate out the gaugino condensate and work in the low energy effective KKLT theory,\n7\n\n\fb)\n\na)\n\n1.00\n\n1.00\n\nHini > -3\n10 L\n\nini\n\n0.95\n\n0.2\n\n0.4\n\n0.6\n\n0.80\n0.75\n\n-6\n\nW0 = 10\n\n0.70\n\n0.8\n\n1.0\n\n0.2\n\nΣini\n\n0.4\n\nHini > 10 -3L\nini\n\n0.85\nHini > 10 -2L\nini\n\n0.85\n\n0.90\nWΓ\n\nini\n\nHini > -2\n10 L\n\n0.90\n\nHini > Lini\n\nWΓ\n\n0.95\n\n0.6\n\n0.8\nΣini\n\nW0 = 10\n1.0\n\n1.2\n\n-8\n\n1.4\n\nFigure 3: The regions bounded by the curves correspond to initial conditions leading to modulus stabilization in the KKLT model with c = 1/7 and a) W0 = 10−6 and b) W0 = 10−8 as a function of the initial\nabundance Ωγ . The thin/red curve is obtained in absence of u and the thick/blue curve is for u integrated\nin and initially at its minimum umin. Black dotted lines correspond to (H/Λ)ini = 1, 10−2 , 10−3 .\n\nand for which initial conditions the dynamics of the full system should be taken into account. To\nanswer this question we determined the range of initial conditions for σini leading to modulus\nstabilization in the effective KKLT model, with u integrated out. We compared the results with\nthe range of σini leading to stabilization in the full system, where both u and σ are kept as dynamical fields, starting with u initially lying in the valley of attraction, i.e. uini = umin (σini ). We\nnumerically determined this uini , as the analytic approximation (2.4) breaks down for small σini\n(which corresponds to large u). In both cases we started with zero momenta for all fields.\nThe space of initial conditions {σini , Ωγ } for which the system evolves to the overall minimum\nis plotted in Fig. 3; for all other initial conditions, u and/or σ overshoot. The thin/red curve\ngives the stabilization region for the KKLT potential with u integrated out. The results agree\nwith previous findings [12]: provided that the initial energy density is dominated by radiation,\nthere is a large range of initial σini leading to stabilization. Starting with initial values σini to the\nleft of the curve, the modulus picks up too much momentum and overshoots; starting with initial\nvalues σini to the right of the curve, the modulus is too close to the minimum and there is not\nenough time to damp the field, with overshoot as result. Finally, we note that there is another\nsmall stabilization region for σini close to the minimum σmin (that is not displayed in the plot),\nfor which the initial potential energy is less than the height of the barrier Vini < Vmax .\nThe equivalent curve for the full system is the thick/blue line. As expected, there are large\ndiscrepancies for small σini , and thus large umin (σini ), whereas for larger σini both systems give the\nsame results. In terms of n = (H/Λ)ini , the deviations are negligible when this ratio drops below\nn = 10−2 , and become large around n = 10−1 - Fig. 3 shows the lines for n = 1, 10−2 , 10−3 .\nThis is almost independent of W0 , i.e. of the vacuum gravitino mass; the reason is that for such\ninitial conditions the cubic term in the potential (3.1) is negligible, and all W0 dependence drops\nout. This allows to restate the results in terms of Vini as well: for Vini . 10−7 the KKLT and full\npotential behave very similarly, whereas for Vini & 10−5 they deviate significantly.\nWe note that the smaller W0 is, the longer it takes for the fields to roll down to their minima,\nand the longer they are exposed to damping; this explains why less initial radiation Ωγ is needed\n\n8\n\n\ffor stabilization. Hence, for a TeV gravitino mass, W0 ∼ 10−14 and c = 1/10, it is natural to\nexpect the same behavior as in Fig. 3, with an even larger accessible range of Ωγ . In that case,\none can further show that stabilization occurs at the unification-compatible point g2 = 1/2.\nAs already stressed, the main reason for the breakdown of the KKLT approximation at large\ninitial energy densities is due to the way the condensate is integrated out. Formally, the field u\nshould be integrated out at the level of the scalar potential. In the KKLT approach, however,\nthis is not the case: the field u is sent to zero in the Kähler potential, and replaced by its vev in\nthe superpotential. The difference between the two approaches is easy to understand by studying\nthe structure of the scalar potential (2.2); it gives rise to extra terms when the first approach\nis followed. The way heavy fields can be integrated out consistently in supergravity has been\nthe center of renewed attention in the past months [30–32]. In this paper, we are dealing with\nintermediate energy ranges for which the extra terms in the scalar potential are not negligible.\nThey have an impact on the dynamics of the system. Therefore, for small σini , the solution\nfor umin (2.4) is no longer a good approximation, and thus higher order terms in u (the u6 term in eq. (3.1)) have to be taken into account. Numerically, we find that the exact and the\nanalytical solutions start to deviate more and more as we increase Vini . Notice that for σini < 0.2\n(or Vini & 10−3 ), the nontrivial minimum of VF (σ = σini , u) along the u direction disappears\naltogether, implying that gaugino condensation cannot occur. This explains the cutoff in the\nstabilization region in both plots. For σini < 0.2, any uini leads to overshoot.\n\n3.2\n\nInitial conditions leading to modulus stabilization\n\nWe now determine the stabilization region in {σini , uini } space, considering initial conditions with\nboth the modulus and the condensate displaced from the instantaneous minimum. Once again\nthe fields start their evolution at rest.\nThe results for W0 = 10−6 and Ωγ = 0.95 are shown in Fig. 4. The initial conditions {σini , δu ≡\nuini − umin (σini )} leading to stabilization lie in the shaded/green area. A large range of modulus\ninitial values leads to stabilization 0.2 . σini . 0.6, whereas only a small displacement in δu is\nallowed. The reason for this is simple: the potential is much steeper in the condensate direction,\neven a comparatively small displacement |δu| . 2 × 10−2 implies a large increase in Vini , and\nconsequently leads to overshoot.\nTo address the likelihood of initial conditions leading to stabilization, it is therefore useful to\nconsider not the initial field displacement, but rather the corresponding change in energy Vini .\nGiven an initial energy Vini , and random initial conditions for both the modulus and condensate\n(but such that Vini remains fixed), how large is the stabilization region in the space of initial conditions? In Fig. 4 are plotted the equipotential lines corresponding to Vini = 10−1 , 10−2 , . . . , 10−8 .\nThe lines are approximately orthogonal to δu = 0 for small σini . Considering all initial conditions along one such line to be equally likely, the stabilization region is very small. Most initial\nconditions lead to overshoot. This is quite a different result than the conclusion one (naively)\ndraws from the one-dimensional system with the condensate integrated out. Confining to initial\nconditions to the left of the maximum, a good proportion of initial conditions leads to stabilization.\nThe solid/orange line at δu = 0 in Fig. 4 corresponds to a similar study in the effective KKLT\nmodel, without the dynamics of u. The points along that line at the left of the shaded/green area\nare initial conditions that appear to lead to stabilization from the one-dimensional standpoint.\nOnce the dynamics of the condensate are considered, it is clear that those points are inconsistent.\n\n9\n\n\f0.04\n\n∆u\n\n0.02\n0.00\n-0.02\n-0.04\n0.0\n\n0.2\n\n0.4\n\n0.6\n\n0.8\n\n1.0\n\nΣini\n\nFigure 4: Initial conditions {σini , uini − umin (σini )} leading to modulus stabilization for W0 = 10−6 . The\nblack dashed lines correspond respectively to Vini = 10−1 , 10−2 , . . . , 10−8 from left to right.\n\n4\n\nFinite temperature corrections\n\nIn this section we study the effect of thermal corrections on the evolution of the moduluscondensate system. These corrections arise because the gauge kinetic term W a W a of the thermal\nsector acquires an expectation value at one loop [33, 34], and because the particles in the thermal\nbath may have a field dependent gauge or Yukawa coupling. As an example, let us consider that\nthe background thermal fluid ργ originates from an SU(Nc ) gauge sector with Nf matter multiplets\n(in the fundamental representation) and a modulus-dependent gauge coupling, g2 = 1/σ. Even\nthough the (real) modulus σ does not thermalize, its potential receives corrections through the\ngauge coupling of the thermal bath. Hence, at a constant temperature T , the effective potential\nenergy of the modulus is\n(4.1)\n\nV (σ) + F (g, T ) ,\n\nwhere V (σ) is the zero-temperature potential (3.1) and the induced free energy is given by3\n\u0001\nF (g, T ) = a0 + a2 g2 T 4 ,\n(4.2)\n\u0001\n\u0001\n2\n1\nNc2 − 1 (Nc + 3Nf ). Note that for a sufficiently\nwhere a0 = − π24 Nc2 + 2Nc Nf − 1 and a2 = 64\nhigh temperature Tcrit , the minimum of the potential gets lifted and, if the modulus is already in\nits minimum, it gets destabilized [36, 37].\nSimilarly, since the trace of the stress-energy tensor no longer vanishes, a mass term for the\ncondensate may be generated4 via a coupling uu∗ hT μμ i T . It is however easy to show that the\ncorresponding destabilization temperature is (much) higher than the one affecting the modulus,\nTcrit . We have confirmed numerically that such a mass term can be neglected.\n3\nFormally, eq. (4.2) is valid only in the weak coupling regime. If g ∼ O(1), additional corrections become\nimportant. However, explicit computations have shown that the g 2 term contains already the correct qualitative\nbehavior [35].\n4\nWe thank Oleg Lebedev for drawing our attention to this issue.\n\n10\n\n\fThe existence of a thermal bath affects the moduli dynamics. First, the solution of Friedmann's\nequations for the radiation density becomes\n\u00131/3\n\u0012\n1 + rg 2 (σinit )\ninit −4N\n,\n(4.3)\nργ = ργ e\n1 + rg2 (σ)\nwhere r denotes the ratio5 a2 /a0 and N = ln R as before. Since ργ enters the Hubble rate H,\neq. (4.3) implies that temperature corrections introduce an additional source of friction which\ndecreases as the universe expands. As a result, the equations of motion (2.9) are modified as\nfollows\n∂̄ V → ∂̄ (V + F ) = ∂̄ V −\n\n1 rργ\n∂̄ g2 ,\n3 1 + rg2\n\n(4.4)\n\nwhere we have used the relation between the energy density and the temperature of the thermal\nfluid ργ = −pγ + T dpγ /dT = −3a0 (1 + rg2 ) T 4 with the pressure given by pγ = −F (g, T ). This\nnew contribution to the equations of motion renders manifest the effect of the effective potential (4.1). Note that irrespective of whether the initial temperature is larger than the temperature\nat which the minimum of the potential gets lifted, Tini > Tcrit , the modulus can still be stabilized.\nIf the friction is large enough, the minimum emerges before the modulus has had time to approach\nit. Some of the initial conditions that lead to stabilization at zero temperature are however erased.\nThus, the region of admissible conditions reduces under the influence of the thermal bath.\nWe note that it is possible that a subset of the thermal degrees of freedom do not have a\nmodulus dependent gauge or Yukawa coupling, and only interact gravitationally with the modulus\nsector. If this subset is large, the parameter |r| can be made arbitrarily small, and the results of\nthe previous section apply.\n\n4.1\n\nInitial conditions leading to modulus stabilization\n\nAs before, we consider the KKLT model with the condensate field u integrated in and the parameters c = 1/7 and W0 = 10−6 . In addition, we take the initial radiation abundance to be\nΩγ = 0.99 and consider two different configurations with r = −3/4π 2 and r = −0.04 to illustrate\nthe dependence on thermal corrections. The first case corresponds to an SU(2) pure Yang-Mills\nthermal sector and is thus the minimal |r| achievable when the contribution (4.2) is the only\ncomponent in radiation. Fig. 5 shows the set of admissible initial conditions {σini , δu} that lead\nto stabilization. The region surrounded by the dashed line corresponds to the result obtained in\nthe previous section for zero temperature (cf. Fig. 4). Inside this region, we find those admissible\ninitial conditions for r = −0.04 (light shaded) and r = −3/4π 2 ≈ −0.076 (dark shaded).\nA few comments are in order. The region of stabilization clearly reduces when |r| increases.\nFor the SM gauge group SU(3)×SU(2), one finds r ∼ −0.1, which leads to a considerable reduction\nof the allowed region. This implies that only for an even more fine-tuned value Ωγ ∼ 1 does stabilization occur in a more realistic scenario. Also, the smallest value that the modulus can initially\ntake depends on the thermal background. This happens because the higher the potential energy\nof the modulus Vini is, the faster it rolls down to the position of the minimum. If the temperature\nis not sufficiently low, the modulus finds no minimum and consequently runs away. Similarly, if\n5\n\nOur definition of r differs by a factor 4π compared to [14]. This originates from the different dependence of\nthe gauge coupling on σ.\n\n11\n\n\f0.04\n\n∆u\n\n0.02\n0.00\n-0.02\n-0.04\n0.0\n\n0.2\n\n0.4\n\n0.6\n\n0.8\n\n1.0\n\nΣini\n\nFigure 5: Region of initial conditions leading to σ stabilization in the KKLT model. The dashed line\nsurrounds all admissible initial values in the absence of thermal corrections. The light-shaded (darkshaded) region corresponds to the allowed parameters in presence of thermal corrections, with r = −0.04\n(r = −3/4π 2 ). The chosen parameters are c = 1/7, W0 = 10−6 , Ωγ = 0.99.\n\nσ starts too close to the local maximum of the modulus potential, at higher temperatures the\nmodulus does not feel the attraction of the minimum and escapes.\nWe explore also how the stabilization of the modulus depends on the initial radiation abundance Ωγ . In Fig. 6, we present our results including the condensate dynamics (blue/thick curves).\nIn the left (right) panel we have set W0 = 10−6 (10−8 ). The area over the solid (blue/thick) curve is\nthe set of stabilization-compatible initial conditions at zero temperature. The area over the dashed\n(blue/thick) curve describes stabilization when thermal effects are included, with r = −3/4π 2 .\nAs expected, for low initial radiation abundance, the modulus runs away before the temperature\ndecreases below Tcrit and, therefore, stabilization is not possible. This sets a bound on the initial\nvalue of Ωγ , which in our examples is Ωγ,min ≈ 0.98 (0.92) for W0 = 10−6 (10−8 ) with r = −3/4π 2 .\nWe contrast these findings with those results obtained in the traditional way, i.e. in absence of\nthe dynamical condensate field u (red/thin curves). Note that the thin and the thick curves only\ncoincide in a narrow region close to the stabilization point of σ (σmin ≈ 1.22 for W0 = 10−6 and\nσmin ≈ 1.68 for W0 = 10−8 ). This implies that, integrating out the condensate is only valid for\nthese points, that is, for initial conditions such that the Hubble rate Hini is between two and three\norders of magnitude lower than the condensation scale Λini at the beginning of modulus evolution\nThis observation is rather model independent and has to be taken into account in general when\ndealing with moduli stabilization driven by gaugino condensate in an evolving universe.\n\n5\n\nConclusions\n\nWe have studied the cosmological evolution of a modulus coupled to a gaugino condensate and its\nconsequences for moduli stabilization. Using the KKLT model as an illustrative example, we have\nshown that, in presence of background radiation, most of the region yielding modulus stabilization\ncorresponds to points in parameter space for which the Hubble parameter Hini is close to the scale\nat which the gauginos condense Λini . Once the dynamics of the gaugino pairs is included, we have\nshown that:\n• integrating out the condensate directly in the superpotential and the Kähler potential fails\n12\n\n\fb)\n\na)\n\n1.00\n\n1.00\nr=-3\u00904Π2\nini\n\nHini > -3\n10 L\n\n0.2\n\n0.4\n\n0.6\n\nWΓ\n\n0.85\n0.80\n0.75\n\n-6\n\nW0 = 10\n\n0.70\n\n0.8\n\n1.0\n\n0.2\n\nΣini\n\n0.4\n\nHini > 10 -3L\nini\n\n0.85\n\n0.90\n\nHini > 10 -2L\nini\n\nHini > -2\n10 L\n\nini\n\nHini > Lini\n\nWΓ\n\n0.95\n\n0.90\n\nr=-3\u00904Π2\n\n0.95\n\n0.6\n\n0.8\nΣini\n\nW0 = 10\n1.0\n\n1.2\n\n-8\n\n1.4\n\nFigure 6: The regions enclosed by the curves correspond to initial conditions leading to modulus stabilization in the KKLT model with c = 1/7 and a) W0 = 10−6 and b) W0 = 10−8 as a function of the initial\nabundance Ωγ . The thin/red curves are obtained in absence of the field u for r = 0 (solid) and r = −3/4π 2\n(dashed). The thick/blue curves are obtained for u integrated in and initially at its minimum umin for\nr = 0 (solid) and r = −3/4π 2 (dashed). Black dotted lines correspond to (H/Λ)ini = 1, 10−2 , 10−3 .\n\nto describe moduli dynamics unless Hini is about two orders of magnitude smaller than Λini ,\n• the dynamics of the condensate sets a stronger bound on the initial conditions leading to\nstabilization.\nThe former point implies that if one is to consider that the condensate has been integrated\nout before the modulus starts its evolution, then only the vicinity of the minimum leads to\nstabilization.\nWe have also discussed the role of thermal corrections and shown that they do not affect the\nconclusions above. Thermal effects impact on the initial friction needed to damp the modulus\nand stabilize it, constraining further the range of initial conditions that lead to stabilization.\nTo conclude, we point out that our observations are model independent and have to be taken\ninto account in general when dealing with moduli stabilization driven by gaugino condensate in an\nevolving universe. Also, our results are expected to hold independently of the choice of parameters.\nIn particular, they should be valid in settings with a realistic supersymmetry breaking scale.\n\nAcknowledgments\nWe are grateful to Emilian Dudas and Oleg Lebedev for valuable discussions.\n\nA\n\nEquations of motion\n\nThe equations of motion (2.9)\nφ̈i + 3H φ̇i + Γij k φ̇j φ̇k + K i ̄ ∂̄ V = 0 ,\n\n(A.1)\n\ncan be separated into real and imaginary parts (resp. denoted φr and φi ) and read\n\u0011\n\u0010\n∂V\n1\nl m\n+ K k l̄ l = 0 ,\nφ̈kr + 3H φ̇kr + Γklm φ̇lr φ̇m\nr − φ̇i φ̇i\n2\n∂φr\n13\n\n\f\u0011\n\u0010\n1\n∂V\nl m\n+ K k l̄ l = 0 .\n+\nφ̇\nφ̇\nφ̈ki + 3H φ̇ki + Γklm φ̇li φ̇m\nr\nr i\n2\n∂φi\n\n(A.2)\n\nApplied to the KKLT system (2.6), we have\n\u0001 2σ 2 ∂V\n1\nσ ̇r 2 − σ̇i 2 + r\n= 0 ,\nσr\n3 ∂σr\n2\n2σ 2 ∂V\nσ̈i + 3H σ̇i − σ ̇r σ̇i + r\n= 0 .\nσr\n3 ∂σi\n\nσ ̈r + 3H σ ̇r −\n\n(A.3)\n\nIn section 3, we aim at comparing the region of stabilization with the results obtained in [12].\nHowever, from then on, we concentrate on the real parts of σ and u. Dynamics of the imaginary\nparts shall be treated elsewhere.\nFor the exact system (2.1), the first equation in (A.2) becomes\n\u0010\n\u0011 2σ − u2 /3\nur\n2\nr\nr\n2\nσ\n ̇\n−\nu\n ̇\nσ\n ̇\n(2σr ∂σr V + ur ∂ur V ) = 0 ,\nr\nr r +\n2σr − u2r /3\n3\n6\n\u0010u\n\u0011 2σ − u2 /3\n2\nr\nr\nr\n2\nu ̈r + 3H u ̇r −\n+\nu\n ̇\n−\nu\n ̇\nσ\n ̇\n(ur ∂σr V + 3∂ur V ) = 0 . (A.4)\nr\nr\nr\n2σr − u2r /3 3\n6\n\nσ ̈r + 3H σ ̇r −\n\nIn general, it proves much easier to re-express eqs. (2.9) in terms of the canonical momenta\nassociated to the fields Πi = ∂Lkin /∂ φ̇i\n1 i\nφ̇ (Πi ) ,\nH\n\u0001\n1 ∂\nLkin − V (φi ) ,\n= − 3Πi +\ni\nH ∂φ\n\nφ′i =\nΠi′\n\n(A.5)\n\nwhere prime denotes derivative with respect to N (i.e ẋ = Hx′ ). These equations can then be\nintegrated numerically in order to obtain the solutions φi (N ).\n\nReferences\n[1] S. B. Giddings, S. Kachru, and J. Polchinski, Phys. Rev. D66 (2002), 106006,\n[hep-th/0105097].\n[2] M. Dine, R. Rohm, N. Seiberg, and E. Witten, Phys. Lett. B156 (1985), 55.\n[3] T. Banks and M. Dine, Phys. Rev. D50 (1994), 7454–7466, [hep-th/9406132].\n[4] T. Barreiro, B. de Carlos, and E. J. Copeland, Phys. Rev. D57 (1998), 7354–7360,\n[hep-ph/9712443].\n[5] G. Veneziano and S. Yankielowicz, Phys. Lett. B113 (1982), 231.\n[6] T. R. Taylor, G. Veneziano, and S. Yankielowicz, Nucl. Phys. B218 (1983), 493.\n[7] N. V. Krasnikov, Phys. Lett. B193 (1987), 37–40.\n[8] J. A. Casas, Phys. Lett. B384 (1996), 103–110, [hep-th/9605180].\n\n14\n\n\f[9] S. Kachru, R. Kallosh, A. Linde, and S. P. Trivedi, Phys. Rev. D68 (2003), 046005,\n[hep-th/0301240].\n[10] T. Barreiro, B. de Carlos, and E. J. Copeland, Phys. Rev. D58 (1998), 083513,\n[hep-th/9805005].\n[11] R. Brustein, S. P. de Alwis, and P. Martens, Phys. Rev. D70 (2004), 126012,\n[hep-th/0408160].\n[12] T. Barreiro, B. de Carlos, E. Copeland, and N. J. Nunes, Phys. Rev. D72 (2005), 106004,\n[hep-ph/0506045].\n[13] C. van de Bruck, K.-Y. Choi, and L. M. H. Hall, JCAP 0711 (2007), 018, [0709.2810].\n[14] T. Barreiro, B. de Carlos, E. J. Copeland, and N. J. Nunes, Phys. Rev. D78 (2008), 063502,\n[0712.2394].\n[15] O. Lebedev, C. Papineau, and M. Postma, (2009), 0907.4630.\n[16] R. Kappl et al., Phys. Rev. Lett. 102 (2009), 121602, [0812.2120].\n[17] C. P. Burgess, J. P. Derendinger, F. Quevedo, and M. Quiros, Annals Phys. 250 (1996),\n193–233, [hep-th/9505171].\n[18] F. Cachazo, M. R. Douglas, N. Seiberg, and E. Witten, JHEP 12 (2002), 071,\n[hep-th/0211170].\n[19] E. Witten, Nucl. Phys. B202 (1982), 253.\n[20] M. A. Shifman and A. I. Vainshtein, (1999), hep-th/9902018.\n[21] K. Becker, M. Becker, M. Haack, and J. Louis, JHEP 06 (2002), 060, [hep-th/0204254].\n[22] M. Berg, M. Haack, and B. Kors, JHEP 11 (2005), 030, [hep-th/0508043].\n[23] O. DeWolfe and S. B. Giddings, Phys. Rev. D67 (2003), 066008, [hep-th/0208123].\n[24] H.-Y. Chen, Y. Nakayama, and G. Shiu, (2009), 0905.4463.\n[25] S. B. Giddings and A. Maharana, Phys. Rev. D73 (2006), 126003, [hep-th/0507158].\n[26] R. Brustein and P. J. Steinhardt, Phys. Lett. B302 (1993), 196–201, [hep-th/9212049].\n[27] D. H. Lyth and T. Moroi, JHEP 05 (2004), 004, [hep-ph/0402174].\n[28] C. Papineau, M. Postma, and S. Ramos-Sánchez, work in progress.\n[29] L. Kofman et al., JHEP 05 (2004), 030, [hep-th/0403001].\n[30] A. Achucarro, S. Hardeman, and K. Sousa, Phys. Rev. D78 (2008), 101901, [0806.4364].\n[31] D. Gallego and M. Serone, JHEP 01 (2009), 056, [0812.0369].\n[32] L. Brizi, M. Gómez-Reino, and C. A. Scrucca, Nucl. Phys. B820 (2009), 193–212, [0904.0370].\n15\n\n\f[33] M. T. Grisaru and P. C. West, Nucl. Phys. B254 (1985), 249.\n[34] W. Buchmüller, K. Hamaguchi, and M. Ratz, Phys. Lett. B574 (2003), 156–161,\n[hep-ph/0307181].\n[35] K. Kajantie, M. Laine, K. Rummukainen, and Y. Schroder, Phys. Rev. D67 (2003), 105008,\n[hep-ph/0211321].\n[36] W. Buchmüller, K. Hamaguchi, O. Lebedev, and M. Ratz, Nucl. Phys. B699 (2004), 292–308,\n[hep-th/0404168].\n[37] W. Buchmüller, K. Hamaguchi, O. Lebedev, and M. Ratz, JCAP 0501 (2005), 004,\n[hep-th/0411109].\n\n16\n\n\f"}