{"id": "http://arxiv.org/abs/1107.1319v3", "guidislink": true, "updated": "2011-09-16T16:40:41Z", "updated_parsed": [2011, 9, 16, 16, 40, 41, 4, 259, 0], "published": "2011-07-07T09:06:48Z", "published_parsed": [2011, 7, 7, 9, 6, 48, 3, 188, 0], "title": "Rapidly Rotating Lenses: Repeating features in the lightcurves of short\n  period binary microlenses", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1107.3147%2C1107.5466%2C1107.1672%2C1107.0466%2C1107.0278%2C1107.3974%2C1107.2376%2C1107.0697%2C1107.2137%2C1107.2615%2C1107.3456%2C1107.1335%2C1107.0950%2C1107.5274%2C1107.2797%2C1107.3521%2C1107.5863%2C1107.0943%2C1107.2205%2C1107.2124%2C1107.3306%2C1107.3318%2C1107.0582%2C1107.0349%2C1107.4174%2C1107.2903%2C1107.4003%2C1107.3254%2C1107.0078%2C1107.1227%2C1107.1319%2C1107.2352%2C1107.4842%2C1107.4171%2C1107.5835%2C1107.5977%2C1107.3021%2C1107.4409%2C1107.3234%2C1107.0936%2C1107.5615%2C1107.2741%2C1107.2222%2C1107.2555%2C1107.5185%2C1107.2157%2C1107.5872%2C1107.3089%2C1107.4765%2C1107.0908%2C1107.5929%2C1107.0459%2C1107.0518%2C1107.5186%2C1107.5890%2C1107.0094%2C1107.0675%2C1107.3423%2C1107.3098%2C1107.1793%2C1107.4528%2C1107.1733%2C1107.5546%2C1107.4703%2C1107.5479%2C1107.1574%2C1107.1323%2C1107.5491%2C1107.2816%2C1107.1706%2C1107.3942%2C1107.2304%2C1107.0127%2C1107.5056%2C1107.2759%2C1107.0860%2C1107.5829%2C1107.5336%2C1107.5744%2C1107.5299%2C1107.3956%2C1107.1775%2C1107.0869%2C1107.0589%2C1107.4446%2C1107.4166%2C1107.1050%2C1107.0450%2C1107.0113%2C1107.4393%2C1107.1000%2C1107.2140%2C1107.3900%2C1107.1627%2C1107.3362%2C1107.4401%2C1107.4159%2C1107.1232%2C1107.2625%2C1107.3999%2C1107.5516&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Rapidly Rotating Lenses: Repeating features in the lightcurves of short\n  period binary microlenses"}, "summary": "Microlensing is most sensitive to binary lenses with relatively large orbital\nseparations, and as such, typical binary microlensing events show little or no\norbital motion during the event. However, despite the strength of binary\nmicrolensing features falling off rapidly as the lens separation decreases, we\nshow that it is possible to detect repeating features in the lightcurve of\nbinary microlenses that complete several orbits during the microlensing event.\nWe investigate the lightcurve features of such Rapidly Rotating Lens (RRL)\nevents. We derive analytical limits on the range of parameters where these\neffects are detectable, and confirm these numerically. Using a population\nsynthesis Galactic model we estimate the RRL event rate for a ground-based and\nspace-based microlensing survey to be 0.32fb and 7.8fb events per year\nrespectively, assuming year-round monitoring and where fb is the binary\nfraction. We detail how RRL event parameters can be quickly estimated from\ntheir lightcurves, and suggest a method to model RRL events using timing\nmeasurements of lightcurve features. Modelling RRL lightcurves will yield the\nlens orbital period and possibly measurements of all orbital elements including\nthe inclination and eccentricity. Measurement of the period from the lightcurve\nallows a mass-distance relation to be defined, which when combined with a\nmeasurement of microlens parallax or finite source effects, can yield a mass\nmeasurement to a two-fold degeneracy. With sub-percent accuracy photometry it\nis possible to detect planetary companions, but the likelihood of this is very\nsmall.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1107.3147%2C1107.5466%2C1107.1672%2C1107.0466%2C1107.0278%2C1107.3974%2C1107.2376%2C1107.0697%2C1107.2137%2C1107.2615%2C1107.3456%2C1107.1335%2C1107.0950%2C1107.5274%2C1107.2797%2C1107.3521%2C1107.5863%2C1107.0943%2C1107.2205%2C1107.2124%2C1107.3306%2C1107.3318%2C1107.0582%2C1107.0349%2C1107.4174%2C1107.2903%2C1107.4003%2C1107.3254%2C1107.0078%2C1107.1227%2C1107.1319%2C1107.2352%2C1107.4842%2C1107.4171%2C1107.5835%2C1107.5977%2C1107.3021%2C1107.4409%2C1107.3234%2C1107.0936%2C1107.5615%2C1107.2741%2C1107.2222%2C1107.2555%2C1107.5185%2C1107.2157%2C1107.5872%2C1107.3089%2C1107.4765%2C1107.0908%2C1107.5929%2C1107.0459%2C1107.0518%2C1107.5186%2C1107.5890%2C1107.0094%2C1107.0675%2C1107.3423%2C1107.3098%2C1107.1793%2C1107.4528%2C1107.1733%2C1107.5546%2C1107.4703%2C1107.5479%2C1107.1574%2C1107.1323%2C1107.5491%2C1107.2816%2C1107.1706%2C1107.3942%2C1107.2304%2C1107.0127%2C1107.5056%2C1107.2759%2C1107.0860%2C1107.5829%2C1107.5336%2C1107.5744%2C1107.5299%2C1107.3956%2C1107.1775%2C1107.0869%2C1107.0589%2C1107.4446%2C1107.4166%2C1107.1050%2C1107.0450%2C1107.0113%2C1107.4393%2C1107.1000%2C1107.2140%2C1107.3900%2C1107.1627%2C1107.3362%2C1107.4401%2C1107.4159%2C1107.1232%2C1107.2625%2C1107.3999%2C1107.5516&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Microlensing is most sensitive to binary lenses with relatively large orbital\nseparations, and as such, typical binary microlensing events show little or no\norbital motion during the event. However, despite the strength of binary\nmicrolensing features falling off rapidly as the lens separation decreases, we\nshow that it is possible to detect repeating features in the lightcurve of\nbinary microlenses that complete several orbits during the microlensing event.\nWe investigate the lightcurve features of such Rapidly Rotating Lens (RRL)\nevents. We derive analytical limits on the range of parameters where these\neffects are detectable, and confirm these numerically. Using a population\nsynthesis Galactic model we estimate the RRL event rate for a ground-based and\nspace-based microlensing survey to be 0.32fb and 7.8fb events per year\nrespectively, assuming year-round monitoring and where fb is the binary\nfraction. We detail how RRL event parameters can be quickly estimated from\ntheir lightcurves, and suggest a method to model RRL events using timing\nmeasurements of lightcurve features. Modelling RRL lightcurves will yield the\nlens orbital period and possibly measurements of all orbital elements including\nthe inclination and eccentricity. Measurement of the period from the lightcurve\nallows a mass-distance relation to be defined, which when combined with a\nmeasurement of microlens parallax or finite source effects, can yield a mass\nmeasurement to a two-fold degeneracy. With sub-percent accuracy photometry it\nis possible to detect planetary companions, but the likelihood of this is very\nsmall."}, "authors": ["Matthew T. Penny", "Eamonn Kerins", "Shude Mao"], "author_detail": {"name": "Shude Mao"}, "author": "Shude Mao", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1111/j.1365-2966.2011.19403.x", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1107.1319v3", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1107.1319v3", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "16 pages, 14 figures, accepted for publication in MNRAS. Equation 21\n  simplified", "arxiv_primary_category": {"term": "astro-ph.GA", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "astro-ph.GA", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "astro-ph.EP", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1107.1319v3", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1107.1319v3", "journal_reference": "Mon. Not. R. Astron. Soc. 417, 2216-2229 (2011)", "doi": "10.1111/j.1365-2966.2011.19403.x", "fulltext": "Mon. Not. R. Astron. Soc. 000, 000–000 (0000)\n\nPrinted 29 September 2018\n\n(MN LaTEX style file v2.2)\n\narXiv:1107.1319v3 [astro-ph.GA] 16 Sep 2011\n\nRapidly Rotating Lenses: Repeating features in the\nlightcurves of short period binary microlenses\nMatthew\nT. Penny,1⋆ Eamonn Kerins,1 Shude Mao2,1\n1\n\nJodrell Bank Centre for Astrophysics, The Alan Turing Building, School of Physics and Astronomy,\nThe University of Manchester, Oxford Rd, Manchester, M13 9PL, UK\n2 National Astronomical Observatories, Chinese Academy of Sciences, A20 Datun Road, Chaoyang District, Beijing 100012, China\n\nAccepted 2011 July 7. Received 2011 July 5; in original form 2011 May 7\n\nABSTRACT\n\nMicrolensing is most sensitive to binary lenses with relatively large orbital separations,\nand as such, typical binary microlensing events show little or no orbital motion during\nthe event. However, despite the strength of binary microlensing features falling off\nrapidly as the lens separation decreases, we show that it is possible to detect repeating\nfeatures in the lightcurve of binary microlenses that complete several orbits during the\nmicrolensing event. We investigate the lightcurve features of such Rapidly Rotating\nLens (RRL) events. We derive analytical limits on the range of parameters where these\neffects are detectable, and confirm these numerically. Using a population synthesis\nGalactic model we estimate the RRL event rate for a ground-based and space-based\nmicrolensing survey to be 0.32fb and 7.8fb events per year respectively, assuming\nyear-round monitoring and where fb is the binary fraction. We detail how RRL event\nparameters can be quickly estimated from their lightcurves, and suggest a method to\nmodel RRL events using timing measurements of lightcurve features. Modelling RRL\nlightcurves will yield the lens orbital period and possibly measurements of all orbital\nelements including the inclination and eccentricity. Measurement of the period from\nthe lightcurve allows a mass-distance relation to be defined, which when combined\nwith a measurement of microlens parallax or finite-source effects, can yield a mass\nmeasurement to a two-fold degeneracy. With sub-percent accuracy photometry it is\npossible to detect planetary companions, but the likelihood of this is very small.\nKey words: gravitational lensing: micro – celestial mechanics – binaries: general –\nplanetary systems – Galaxy: bulge\n\n1\n\nINTRODUCTION\n\nBy monitoring hundreds of millions of stars towards the\nGalactic bulge and Magellanic clouds, Gravitational microlensing surveys such as OGLE (Udalski 2003) and\nMOA (Hearnshaw et al. 2006) detect ∼ 1000 microlensing\nevents per year. The lightcurves of most microlensing events\nfollow the typical Paczyński (1986) form of a point-mass\nlens with a point source. However, many event lightcurves\nhave a more complex form due to the effects of a binary or planetary companion to the lens (Mao & Paczyński\n1991; Gould & Loeb 1992), a binary companion to the\nsource (Griest & Hu 1992), microlens parallax (Refsdal\n1966; Gould 1992), finite-source size (Gould 1994;\nWitt & Mao 1994; Nemiroff & Wickramasinghe 1994), or a\ncombination of such. These effects provide additional information about the lens, such as the mass ratio and pro-\n\n⋆\n\nmpenny@jb.man.ac.uk\n\njected separation in binary or planetary lens events, or massdistance relationships with parallax or finite-source effects.\nMeasurement of both the finite-source size and microlensing\nparallax allow the lens mass to be solved for uniquely (Gould\n1992), and if these occur in a binary or planetary lensing\nevent, also allow measurement of the companion mass.\nThe complexities of microlensing lightcurves, to a\ngreater or lesser extent, can all be considered as deviations from the single lens Paczyński form. The deviations\nmay be relatively minor and can cover the entire lightcurve,\nas in most parallax events (e.g. Smith et al. 2002a), or\nthey can be large and cover only a small fraction of the\nlightcurve, as in many binary lens events (e.g. Kubas et al.\n2005; Beaulieu et al. 2006). In binary lens events, these deviations from the single lens form are caused by a difference\nin the magnification pattern of the lens. The most prominent 'features' of the binary lens magnification pattern are\ncaustics, where the magnification of a point source diverges\n(see Figure 1). A source passing over a caustic will show a\n\n\f2\n\nM. T. Penny, E. Kerins and S. Mao\n\nsharp rise in its magnification as it enters it and a sharp\nfall as it leaves. Other, more smooth magnification pattern\n'features' can be associated with the caustics in some way.\nThe caustic features of a binary lens magnification pattern are a natural feature of the binary lens mapping\n\u0013\n\u0012\nq\n1\n1\n,\n(1)\n+\nzs = z −\n1 + q z − z1\nz − z2\nwhich maps the angular position of the source to image positions under the influence of the lens, and where we have used\ncomplex coordinates (e.g. z = x + iy, Witt 1990); bars represent complex conjugation, zs is the position of the source,\nz the position of the image, z1 and z2 the positions of the\nprimary and secondary lens components respectively, and\nq = M2 /M1 is the mass ratio of the lens components. All\nangles have been normalized to the Einstein ring radius\nr\nrE\n1\n4G\nθE =\n=\nx(1 − x)Ds M ,\n(2)\nDl\nDl\nc2\nwhere rE is the physical Einstein radius, Dl and Ds the\ndistance to the lens and source respectively, M = M1 +M2 is\nthe total lens mass, x = Dl /Ds is the fractional lens distance,\nand G and c are the gravitational constant and speed of light\nrespectively. The magnification μ of an image is given by the\ndeterminant of the Jacobian of the lens mapping\n1\n.\n(3)\ndet J\nThe magnification diverges when det J = 0, and the solutions of this equation form smooth, closed curves in the\nimage plane called critical curves, which when mapped back\nto the source plane form closed, cuspy curves: the caustics\n(see Figures 1 and 8).\nIn a binary lens event, the caustics are largest when the\nprojected lens separation s = |z2 −z1 | ∼ 1, i.e., the lens components orbit with semimajor axis a ∼ rE ∼ 2–3 au. At these\nseparations there is only a single, so-called resonant, caustic. Lenses with wider separations have two caustics, while\nthose with closer separations have three (Schneider & Weiss\n1986). The caustics of close and wide systems have smaller\ncaustics than resonant systems, and so the source is less\nlikely to encounter them. Far from the caustics, the binary\nlens features tend to be weak, and therefore, the lightcurves\nof binary lenses with very close or very wide orbits (which\nhave correspondingly very small caustics), in most cases,\nwill be indistinguishable from those of a single lens (e.g.\nGaudi & Gould 1997).\nThe binary lenses with the strongest lightcurve features,\nthus have orbital periods T ∼ 1000 d, much longer than the\nmicrolensing event timescale\nrE\ntE =\n∼ 20d,\n(4)\nvt\nμ=\n\nfor a typical Galactic microlensing event, where vt is the relative lens-source transverse velocity (source velocity). The\nlenses therefore complete only a small fraction of their orbit\nduring the course of the microlensing event, and only a fraction of the events are expected to show detectable signs of\norbital motion in their lightcurves (Gaudi & Gould 1997;\nDominik 1998; Konno & Kojima 1999; Ioka et al. 1999;\nRattenbury et al. 2002; Penny et al. 2011). Those events\nwhere it has been detected typically involve caustic crossings, because the sharp caustic crossing features on the\n\nlightcurve allow precise timing, which can be used to constrain even small lens motions (Albrow et al. 2000; An et al.\n2002; Gaudi et al. 2008; Ryu et al. 2010; Hwang et al. 2010;\nSkowron et al. 2011; Batista et al. 2011). In these events,\nthe orbital motion has constrained the properties of the lens\norbit, and in one case allowed the measurement of several\norbital parameters (Bennett et al. 2010).\nIn a previous paper, we have shown that with accurate photometry and dense enough lightcurve coverage, it\nis possible to detect orbital motion in lenses with closer orbits, and weaker, smooth lightcurve features (Penny et al.\n2011). Typically occurring in events with longer microlensing timescales, tE ∼ 100 d, the shorter orbital periods means\nthat the lens completes a much larger fraction of the orbit\nduring the event. In this paper we investigate the extreme\ncase, where the lens completes at least one orbit during the\nmicrolensing event. In events involving such rapidly rotating lenses, magnification pattern features can sweep over the\nsource more than once, and if detected in the lightcurve,\nthese repeating features allow an accurate measurement of\nthe lens period. Knowledge of the period places constraints\non the lens mass, and if combined with a measurement of\nthe finite-source effect or parallax, can be used to measure\nthe lens mass to a two-fold degeneracy (Dominik 1998).\nWe begin the paper by defining when a binary lens is\na rapidly rotating lens in Section 2. In Section 3 we look\nat whether rapidly rotating lenses are detectable, and the\nrate at which they are expected to occur. In Section 4,\nwe then look at what information can be gained from observing a rapidly rotating lens, and suggest a method for\nmodelling such events. In two appendices we examine how\nrapidly rotating lenses affect the microlensed images, and\nintroduce additional effects that can affect rapidly rotating\nlens lightcurves.\n\n2\n\nWHAT IS A RAPIDLY ROTATING LENS?\n\nWe define a rapidly rotating lens (RRL) to be a binary microlens, which if monitored continuously with suitable photometric accuracy, would guarantee that at least one feature\nof its magnification pattern would be seen to repeat at least\nonce in its lightcurve, due to the lens orbital motion. This\nimplies that the lens completes at least two orbits during\nthe time in which its binary lensing features are detectable.\nWe choose this definition over the more simple comparison\nof microlensing and orbital timescales (e.g. T < tE ) because\nwithout detecting binary features it is impossible to measure\nthe binary's rotation. As mentioned in the previous section,\nthe strength of binary features declines as the orbital separation and period decrease, so simply decreasing the period\ndoes not necessarily increase the prospects of detecting a repeated feature. A rapidly rotating lens must therefore compromise between a fast rotation rate and detectable binary\nlensing features.\nThroughout the paper we shall focus on close topology\nlenses, which have separations s . 0.7 (Schneider & Weiss\n1986; Erdl & Schneider 1993), a choice we shall justify in\nSection 3. Figure 1 shows the magnification pattern of a\nclose topology lens, and labels a number of features. The\nstructure and features of the magnification pattern depend\nonly on the projected separation of the lens components s,\n\n\fRapidly Rotating Lenses\n-1.5\n\nMagnification\narm\n\ny/rE\n\n0.5\n\n-0.3\nFacing\ncusps\n\n0\n\nCentral\ncaustic\n\n-1\n\n-0.5\n-1\n\nEi\n\nte\nns\n\nin\n\nri n\n\ng\n\nMagnitude difference\n\n-0.1\n\n1\n\n0\n\n-0.03\n-0.02\n-0.01\n0\n0.01\n0.02\n0.03\n-200\n\n-100\n\n0\n\n100\n\n200\n\n300\n\nTime (days)\n\n-10\n-0.5\n\n-0.5\n\n-300\n\n-3\n\n-1.5\n-1\n\n-1\n\n0\n\nResidual\n\nSecondary\ncaustic\n\nMagnitude difference\n\n-0.03\n1.5\n\n3\n\n0.5\n\n1\n\nx/rE\nFigure 1. The magnification pattern of a close topology microlens. The dots denote the lens positions, with the primary lens\nat negative x. The lens has a mass ratio q = 0.3 and projected\nseparation s = 0.6. Notable features of the magnification pattern\nare labelled.\n\nand the mass ratio q (Erdl & Schneider 1993). The most\nimportant features of the close magnification pattern are\na central caustic, located at the lens centre of mass, and\ntwo secondary caustics which lie away from the lens centre.\nStretched between the central and secondary caustics are\ntwo 'arms' of excess magnification (relative to the magnification that would be caused by a single lens of mass equal\nto the total binary mass). During a microlensing event, a\nsource will travel across the magnification pattern, and we\nwill observe the source to change in brightness, the form of\nthis lightcurve being determined by the trajectory that the\nsource takes. As the source moves, the magnification pattern\nwill not stay fixed, as the binary will also move in its orbit.\nShould the lens orbit lie face-on to the line of sight, then the\nmagnification pattern will rotate as the source moves across\nit. Should the orbit be inclined or eccentric, the structure of\nthe magnification pattern will also change, as it depends on\nthe projected lens separation s (Schneider & Weiss 1986).\nFigure 2 shows the lightcurve (thick black line) of a RRL\nwith a similar magnification pattern to that shown in Figure 1. It closely resembles the lightcurve of a single lens, the\nPaczyński lightcurve (grey line), but with a quasi-periodic\nvariation over the entire lightcurve that only becomes obvious in the residual that is left once the Paczyński curve\nis subtracted from the lightcurve. These periodic features\ncorrespond to the magnification arms that extend between\nthe secondary and central caustics, which sweep over the\nsource as the lens rotates. The microlensing timescale of the\nlightcurve shown is tE = 60 d, but it is clear that repeating\nbinary features remain in the lightcurve at time from peak\nmagnification much greater than this, which corresponds to\na source position far outside the Einstein ring. This is because the secondary caustics can lie far outside the Einstein\n\nFigure 2. The lightcurve of a rapidly rotating lens. The upper panel shows the RRL lightcurve in black, and the Paczyński\nlightcurve of a single lens with the same total mass in grey. The\nlower panel shows the residual with respect to the Paczyński\nlens lightcurve. Features due to the magnification arms appear\nas peaks in the residual, while between them there are relative\ndemagnifications. Large, short duration spikes occur when the\nsecondary caustic passes close to or over the source. The system\nhas parameters tE = 61 d, T = 92 d, s = 0.23, q = 0.8, u0 = 0.3,\nφ0 = 1.75 (see Section 4 for definitions of u0 and φ0 ).\n\nring, their distance from the lens centre increasing as the\nbinary separation decreases. However, their size, and the\nstrength of the magnification arm connecting them with the\ncentral caustic, decrease with decreasing binary separation.\nWe note at this point, that despite the large separation of\nthe secondary caustics, we need not consider relativistic effects of superluminal caustics (Zheng & Gould 2000) as the\nratio of the caustic rotational speed to the speed of light in\nall the cases we will consider is ∼ 10−3 .\nAn RRL can clearly exhibit interesting, repeating\nlightcurve features if the binary period and separation conspire, but until now we have only considered RRLs in relation to parameters normalized to the typical microlensing\nlength- and time-scales. In order to see if RRL events will\nbe detectable in real microlensing surveys we must consider\nhow their properties relate to the physical parameters of the\nlensing system.\n\n3\n\nARE RRLS DETECTABLE?\n\nIn the previous section we defined a criterion for a lens to\nbe a rapidly rotating lens, and described the features of an\nRRL event. In this section we put the definition on a more\nquantitative basis, and investigate whether RRLs will occur\namongst the microlenses that are probed by microlensing\nsurveys. To determine if detection is plausible, we investigate the range of physical parameters required to produce\na microlensing event with repeating features, first analytically and then numerically. Finally we apply our numerical\nmethod to simulated microlensing surveys to estimate the\nexpected rate of RRL detections.\n\n\f4\n\nM. T. Penny, E. Kerins and S. Mao\n\n3.1\n\nAn analytical approach\n\nTo see repeating features in a microlensing event, the most\nfundamental requirement of the system is that the lens completes more than one orbit during the event. The magnification pattern of a binary lens is complicated, but the essential\nfeatures of a close binary lens can be captured by assuming\nit to be composed of two straight, radial arms that extend\nfrom the centre of mass to the position of the secondary\ncaustics. Under this assumption, and assuming a random\ninitial phase angle, repeating features are guaranteed to be\nobserved if the lens completes two orbits in the time that\nthe source spends within the radius swept out by the arms.\nWe can write this as an inequality\nπ\n(5)\n2T < u± tE ,\n2\nwhere u± is the radial position of the secondary caustics in\nunits of Einstein radii (see Figure 8), and the factor of π2 is\nthe mean chord length across a unit circle, and accounts for\nthe random impact parameter of source trajectories relative\nto the lens centre of mass. It should be noted that it is possible for a feature to repeat if the binary completes between\none and two orbits, but this requires a coincidence in the\ntiming of the first feature.\nBoth the orbital period and the Einstein timescale depend on the lens mass, and the period also depends on the\nlens semimajor axis, so it is possible to write this constraint\nin terms of M and a. For projected lens separations s ≪ 1,\nBozza (2000) has derived an analytical approximation for\nthe secondary caustic positions (see Equation 18), which if\nwe keep only the first order terms is\nu± (s, q) ≃ s−1 .\n\n(6)\n\nUsing equations 2 and 4 and Kepler's third law, with a little\nalgebra we can then write Equation 5 as a constraint on the\nsemimajor axis of the binary\n−2/5\n\na < 4.51 AU [x(1 − x)]2/5 Ds2/5 vt\n\nM 3/5 ,\n\n(7)\n\nwhere we have assumed a face-on orbit so that s = a/rE ,\nand where M is the total lens mass in solar masses, Ds the\nsource distance in kpc, x ≡ Dl /Ds is the ratio of lens and\nsource distances and vt the relative lens-source velocity in\nkm s−1 .\nWhile we have an upper limit on the lens semimajor\naxis, in order to detect the RRL lightcurve features, they\nmust be strong enough to be detectable in the photometry\nof the microlensing event. This requirement is somewhat ambiguous, but as the magnification pattern depends only on s\nand q, and the strength of features decreases with decreasing\ns, we can assume that for a given photometric precision and\nmass ratio, magnification pattern features will be detectable\nonly when the separation is larger than a certain value, i.e.\ns > sdet ,\n\n(8)\n\nwhere sdet depends on q and the photometric accuracy. For\nstellar binary mass ratios, there will only be a small dependence on q, but there will be a strong dependence on the\nphotometric accuracy; a value of sdet = 0.3 is reasonable,\nhowever (see Section 3.2). We can again write this constraint\nas a limit on the semimajor axis\na > 2.85 AU sdet [x(1 − x)]1/2 Ds1/2 M 1/2 .\n\n(9)\n\na/au\n\n10\n\n1\n\n0.1\n0.1\n\n1\n\n10\n\nM/M⊙\n\nFigure 3. Plot showing the region of the total mass-semimajor\naxis plane where repeating features are observable. The red line\nshows the upper limit on a, provided by the constraint in Equation 7, while blue lines show the lower limit on a, provided by the\nconstraint in Equation 9, with values of sdet = 0.3, 0.2 and 0.1\nfrom top to bottom. The other parameters are set at x = 0.75,\nDs = 8 kpc and vt = 50 km s−1 . The region where repeating\nfeatures are detectable for sdet = 0.3 is shaded grey.\n\nWe now have two constraints on a, an upper and a lower\nlimit, which are dependent on other parameters of the lensing system, the most interesting being the total lens mass.\nFigure 3 shows the two constraints on semimajor axis as a\nfunction of mass, for a lens system with x = 0.75, Ds = 8 kpc\nand vt = 50 km s−1 , with values of sdet = 0.3, 0.2 and 0.1.\nOther than the slow lens-source velocity (hvt i ≈ 200 km s−1\nfor a Bulge microlensing event), these values are typical of\na microlensing event towards the Galactic Bulge. The plot\nshows that most of the parameter space is excluded, but\nthanks to the differing power-law indices on the mass dependence, there is a small range of parameters over which\nrepeating features should be detectable. For the parameters\nshown, the 'detectable region' opens up at M ∼ 1M⊙ and\na ∼ 1 au, and widens to 3.3 < a/au < 4.4 by M = 10M⊙ .\nThe dependence of the limits on other parameters means\nthat the region of detectability will get smaller, and move\nto larger a as the source distance grows, will get larger and\nmove to smaller a and M as the lens moves closer to the\nsource or the observer, and will get smaller as the relative\nlens-source velocity increases. A small but significant fraction of binary stars will have total masses and semimajor\naxes in the range of detectability (e.g. Duquennoy & Mayor\n1991), especially if improved photometric accuracy can reduce sdet .\n\n3.2\n\nA numerical approach\n\nIn deriving analytical limits on the range of lens parameters\nwe have had to make assumptions about the magnification\npattern and strength of features. If we instead proceed numerically, we need not make these assumptions as we can\ndetermine precisely the regions of the magnification pattern\nwhere features are detectable for any given photometric accuracy. We define a detectability ε that is the probability\nthat, for a given lens system and photometric precision, an\n\n\fRapidly Rotating Lenses\n10\n\n0\n\n0.2\n\n1\n\nε\n\na/au\n\n0.4\n\n0.6\n\n0.8\n\n0.1\n\n1\n0.1\n\n1\n\n10\n\nM/M⊙\n\nFigure 4. Plot of the average detectability ε against total lens\nmass M and semimajor axis a, for a lens with mass ratio q =\n0.3. The lens and source distances and relative velocity are the\nsame as in Figure 3. The red line is the analytical upper limit\nof Equation 7, while the blue line is the analytical lower limit of\nEquation 9 with a value of sdet = 0.28 for a photometric precision\n∆mmin = 0.01. The green line at the top of the figure marks the\nboundary between regions of close and resonant topology lenses\n– we only calculate ε for close topology lenses. The green points\nlower in the figure mark points where our calculation of ε failed\n(see text for details).\n\nRRL with a face-on orbit will exhibit at least one detectable\nrepeating feature in its lightcurve. A feature is said to be detectable at a radial position u, if the range of magnifications\nμ over a circle of radius u satisfies\n\u0015\n\u0014\nμmax (u)\n> ∆mmin ,\n(10)\n∆m ≡ 2.5 log\nμmin (u)\nwhere we have expressed the range of magnifications\n(μmin → μmax ) as a magnitude difference ∆m, and ∆mmin is\nthe photometric detection threshold, which can be taken to\nmean the typical uncertainty in magnitude on a data point\nin the baseline of the lightcurve. In calculating ε we average\nover the random parameters of the source trajectory and\nphase angle.\nWe can now test the predictions we made in Section 3.1,\nby mapping the detectability ε against total mass M and\nsemimajor axis a, for the set of parameters we used for Figure 3. Figure 4 shows regions of finite detectability in shades\nof gray up to black when ε = 1. Green points in the plot show\nwhere the calculation of the detectability, which requires several numerical minimization and root finding steps, failed.\nThe green line at the top shows the boundary between the\nclose and resonant caustic regimes, where the three caustics\nof the close topology merge into a single resonant caustic.\nWe do not calculate the detectability in the resonant regime.\nThe red and blue lines show the analytical upper and lower\nlimits of Equations 7 and 9, however with sdet = 0.28 as\nopposed to 0.3. It can be seen in the figure that the analytical upper limit of Equation 7 agrees very well with the\nnumerical region of detectability, coinciding with the boundary where ε begins to fall from unity with increasing a over\nthe entire range of M shown. Equation 7, without the factor\nof 2 that was introduced on the left-hand side of Equation 5\nto guarantee a repeated feature, also describes well the re-\n\n5\n\ngion where detection becomes possible but is not guaranteed\n(i.e. 0 < ε < 1).\nThe analytical lower limit, once the parameter sdet has\nbeen adjusted to 0.28 for a guaranteed repeating feature,\nalso agrees well with the numerical region of detectability.\nIt should be noted however, that the slope of the lower edge\nof the numerical region is slightly shallower than the analytical lower limit. This becomes more pronounced when the\nlens gets closer to the source, the total mass increases or\nthe source velocity decreases. This is because the assumption, that there are detectable features over the entire magnification pattern within u < u± , breaks down, and the\ndetectable features lie in two disjoint regions, a disc surrounding the central caustic and an annulus containing the\nsecondary caustics. The size of these regions depends on s,\nand the lower limit on a (Equation 9) becomes a shallower\nfunction of M . This effect is more important in determining\nthe slope of the lower limit on a where ε = 0.\nHaving looked at the role of mass and orbital separation, it is important to investigate how the detectability of\nrepeating features depends on other factors. Figure 5 shows\ndetectability maps similar to that in Figure 4, but for a mass\nratio q = 0.99 and various values of the lens distance, source\nvelocity and photometric detection threshold. The maps are\narranged into four panels with different photometric threshold values of ∆mmin = 0.005, 0.01, 0.02 and 0.04 from left\nto right, top to bottom. Each panel is made up of a grid of\na-M maps showing detectability for different fractional lens\ndistances x in each column, and different source velocities\nin each row. Looking first at the grid with ∆mmin = 0.01\n(top right), it is clear that the source velocity has a large\neffect on the detectability, with large regions of detectability\nfor vt = 50 km s−1 at all lens positions, which are reduced\ndrastically for vt = 100 km s−1 . Once vt = 150 km s−1\nthere is only a tiny region of low detectability for lenses\nvery close to the source (or to the observer, as x(1 − x) is\nsymmetric about x = 0.5). For vt = 200 km s−1 there is only\ndetectability in the most favourable cases of very high photometric accuracy and fractional lens distance. This strong\ndependence on vt occurs because the number of orbits com−2/5\npleted by the lens decreases as vt increases (the vt\nterm\nin Equation 7) but does not affect the strength of binary\nfeatures (Equation 9 is independent of vt ) – there is no cancellation of the vt term in the ratio of upper to lower limits,\nwhile there is a partial cancellation for all the other physical parameters. Unfortunately, the microlensing event rate\npeaks at vt ∼ 200 km s−1 , but there is a significant fraction\nof events with vt < 100 km s−1 (e.g. Dominik 2006).\nThe lens distance does not affect the size of the detectable region as strongly as the source velocity does, as\nthe upper and lower limits of the detectable region scale with\nx(1 − x) as similar power laws (−0.4 and −0.5 respectively).\nHowever, this similar scaling means that the detectable regions move as x changes, occurring at lower a, and increasing\nin size slightly, as the product x(1 − x) decreases. For microlensing events towards the Galactic Bulge, the event rate\npeaks at x ∼ 0.8 (e.g Dominik 2006), whereas for self lensing\nin the Magellanic clouds x will be close to unity, x ≈ 0.98.\nThe photometric precision of the observations strongly\naffects the detectability of repeating features. For ∆mmin =\n0.005 and 0.01 we see large regions of detectability for small\nsource velocities, and for ∆mmin = 0.005 even some de-\n\n\f6\n\nM. T. Penny, E. Kerins and S. Mao\n\nq = 0.99, ∆mmin = 0.005\nx\n0.5\n\n0.75\n\n0.9\n\n0.95\n\n0.98\n\nvt /km s−1\n\nε\n\nq = 0.99, ∆mmin = 0.01\nx\n0.5\n\n0.75\n\n0.9\n\n0.95\n\n0.98\n\n0\n\n1\n\n1\n\n200\n\n200\n\n0.2\n\n0.2\n\n0.1\n\n0.1\n\n1\n0.4\n\n1\n\n150\n\n0.4\n\n0.1\n0.6\n\n1\n\n100\n\n0.1\n\n0.6\n\n100\n\n0.1\n0.8\n\n1\n\n50\n\n0.1\n\na/au\n\na/au\n\n150\n\n0.1\n\n1\n\n1 0.1\n\nM/M⊙\nq = 0.99, ∆mmin = 0.02\nx\n0.5\n\n1 0.1\n\n0.75\n\n1 0.1\n\n0.9\n\n1 0.1\n\n0.95\n\n1\n\n0.98\n\n0.8\n\n1\n\n50\n\n0.1\n\n1\n0.1\n\n1\n0.1\n\nvt /km s−1\n\nε\n\n1 0.1\n\nM/M⊙\nq = 0.99, ∆mmin = 0.04\nx\n0.5\n\n1 0.1\n\n0.75\n\n1 0.1\n\n0.9\n\n1 0.1\n\n0.95\n\n1\n\n0.98\n\n0\n1\n\nvt /km s−1\n\nε\n0\n\n1\n\n200\n\n200\n\n0.2\n\n0.2\n\n0.1\n\n0.1\n\n1\n0.4\n\n1\n\n150\n\n0.4\n\n0.1\n\n150\n\n0.1\n\n1\n\n0.6\n\n1\n\n100\n\n0.1\n\n0.6\n\n100\n\n0.1\n0.8\n\n1\n\n50\n\n0.1\n\n1\n0.1\n\n1 0.1\n\n1 0.1\n\n1 0.1\n\n1 0.1\n\n1\n\nM/M⊙\n\na/au\n\na/au\n\nvt /km s−1\n\nε\n\n0\n\n0.8\n\n1\n\n50\n\n0.1\n\n1\n0.1\n\n1 0.1\n\n1 0.1\n\n1 0.1\n\n1 0.1\n\n1\n\nM/M⊙\n\nFigure 5. Maps of detectability ε plotted against a and M for a binary of mass ratio q = 0.99 and various values of the fractional lens\ndistance x = Dl /Ds , source velocity vt and photometric detection threshold ∆mmin . Each small sub-panel is essentially the same as the\nplot in Figure 4, but with different parameter values and a slightly restricted range 0.1 6 M/M⊙ 6 3, 0.1 6 a/au 6 3. From left to right,\ntop to bottom panel have increasing values of the photometric threshold ∆mmin = 0.005, 0.01, 0.02 and 0.04. Moving from left to right,\nsub-panels have different fractional lens distances x = 0.5, 0.75, 0.9, 0.95 and 0.98; the results remain the same under the transformation\nx → (1 − x), i.e. there is reflectional symmetry about x = 0.5. Moving from bottom to top, sub-panels have different source velocity\nvt = 50, 100, 150 and 200 km s−1 . The source distance is fixed at Ds = 8 kpc. The black line shows the boundary between close and\nresonant caustic structures, above which we do not plot ε. As in Figure 4, there are points where the calculation of ε fails, but these are\nnot shown for clarity, as they do not impinge on the regions of detectability.\n\ntectability when vt = 200 km s−1 . As ∆mmin increases to\n0.02, the detectable regions shrink significantly and all but\ndisappeared for vt > 100 km s−1 . For ∆mmin = 0.04 there\nis virtually no detectability, with only a small chance of detection for the smallest velocities and largest lens distances.\nIncreasing the threshold effectively increases the lower limit\nof a at which binary features are detectable, while leaving the upper limit unchanged, and like the source velocity, the photometric threshold has a large effect on the size\nof the detectability region. It should be noted that the detection threshold ∆mmin is in fact a combination of the effects of photometric precision and the blending by unrelated\nstarlight, which acts to add a noise component to the measurement of the magnification caused by the lens. The effect\nof blending is discussed further in Appendix B1.\nEven in the most favourable case of low photometric\nthreshold and source velocity, and high fractional lens distance, the region of detectability does not reach the boundary between close and resonant caustic topologies. This\nis because as the projected separation increases, near the\ntopology boundary, the secondary caustics move inwards\n\nrapidly before merging with the central caustic, decreasing\nthe range over which binary features are detectable. At the\nsame time the orbital period will increase rapidly as the\nsemimajor axis increases. These combined effects mean that\nin order to see repeating features from a lens with resonant\ntopology, an extremely low source velocity is necessary to\nallow the lens to orbit in the time the source spends near\nthe resonant caustic.\nFigure 6 shows the same maps as Figure 5 but for differing q, and the threshold fixed at ∆mmin = 0.01. The maps\nfor q = 0.3 are similar to those for q = 0.99, and there\nis little difference in the size of the region of detectability.\nHowever, once q has fallen to 0.1, the size of the detectable\nregion has begun to shrink, such that for higher values of\n∆mmin (not shown) there is only a very small chance of detection with small source velocities. For lower mass ratios\nstill, there are only very small regions of detectability for\nq = 0.03 and effectively zero detectability for q = 0.01. If we\ntake the boundary between brown dwarfs and planets to be\nat 13MJupiter , there is a very small region of detectability\nwhere the secondary lens is a planet, but the point of the\n\n\fRapidly Rotating Lenses\nq = 0.3, ∆mmin = 0.01\nx\n0.5\n\n0.75\n\n0.9\n\n0.95\n\n0.98\n\nvt /km s−1\n\nε\n\nq = 0.1, ∆mmin = 0.01\nx\n0.5\n\n0.75\n\n0.9\n\n0.95\n\n0.98\n\n0\n\n1\n\n1\n\n200\n\n200\n\n0.2\n\n0.2\n\n0.1\n\n0.1\n\n1\n0.4\n\n1\n\n150\n\n0.4\n\n0.1\n0.6\n\n1\n\n100\n\n0.1\n\n0.6\n\n100\n\n0.1\n0.8\n\n1\n\n50\n\n0.1\n\na/au\n\na/au\n\n150\n\n0.1\n\n1\n\n1 0.1\n\n1 0.1\n\n1 0.1\n\n1 0.1\n\n0.8\n\n1\n\n50\n\n0.1\n\n1\n0.1\n\n1\n\n1\n0.1\n\nM/M⊙\nq = 0.03, ∆mmin = 0.01\nx\n0.5\n\n1 0.1\n\n1 0.1\n\n1 0.1\n\n1 0.1\n\n1\n\nM/M⊙\n\n0.75\n\n0.9\n\n0.95\n\n0.98\n\nvt /km s−1\n\nε\n\nq = 0.01, ∆mmin = 0.01\nx\n0.5\n\n0.75\n\n0.9\n\n0.95\n\n0.98\n\n0\n1\n\nvt /km s−1\n\nε\n0\n\n1\n\n200\n\n200\n\n0.2\n\n0.2\n\n0.1\n\n0.1\n\n1\n0.4\n\n1\n\n150\n\n0.4\n\n0.1\n\n150\n\n0.1\n\n1\n\n0.6\n\n1\n\n100\n\n0.1\n\n0.6\n\n100\n\n0.1\n0.8\n\n1\n\n50\n\n0.1\n\n1\n0.1\n\n1 0.1\n\n1 0.1\n\n1 0.1\n\n1 0.1\n\n1\n\nM/M⊙\n\na/au\n\na/au\n\nvt /km s−1\n\nε\n\n0\n\n7\n\n0.8\n\n1\n\n50\n\n0.1\n\n1\n0.1\n\n1 0.1\n\n1 0.1\n\n1 0.1\n\n1 0.1\n\n1\n\nM/M⊙\n\nFigure 6. As Figure 5, but for differing mass ratios. Moving from top left to bottom right the detectability is plotted for q = 0.3, 0.1, 0.03\nand 0.01. The total mass corresponding to a secondary below the deuterium burning limit, MD ≈ 13MJupiter , is M < 0.054M⊙ ,\nM < 0.14M⊙ , M < 0.43M⊙ and M < 1.25M⊙ respectively for each value of q. The photometric detection threshold in each case is\n∆mmin = 0.01.\n\ndetectable region where the upper and lower limits meet occurs close to this point, regardless of the mass ratio. So, there\nis little chance of detecting repeating features from a planetary system, unless the photometry is very accurate, the lens\nvery close to the source, or the source velocity is significantly\nsmaller than 50 km s−1 . Such low velocity events are rare,\nbut are known to occur, e.g. the event OGLE-1999-BLG-19\nhad a source velocity vt = 12.5 ± 1.1 km s−1 (Smith et al.\n2002b).\n\n3.3\n\nHow many RRL events will we detect?\n\nTo estimate the RRL event rate we conducted a simulation of a space-based H-band microlensing survey, such\nas Euclid (Beaulieu et al. 2010) or WFIRST (Bennett\n2011), and a ground-based I-band survey, based on\nOGLE-III (Udalski et al. 1997; Udalski 2003). Using the Besançon population synthesis model of the\nGalaxy (Robin et al. 2003), including a three dimensional\nextinction model (Marshall et al. 2006), we produced a\ncatalogue of possible microlensing events following the\nrecipe of Kerins et al. (2009). Source stars with magnitudes\nHs < 25 and Is < 21 are drawn from the Besançon model\nand lensed by stars of any magnitude in the space- and\n\nground-based simulations respectively. The lens mass is\nsplit up into two components with a mass ratio q distributed\nlogarithmically in the range 0.1 6 q < 1, and orbit with\na semimajor axis a distributed logarithmically in the\nrange 0.1 6 a/au < 4. Each event is assigned a weighting\nw = 2rE vt u0,max proportional to its event rate, where\nu0,max is the maximum impact parameter that the event\ncould have and its peak single lens magnification remain\ndetected at 5σ above baseline, taking into account blending.\nEach event was assigned a blending fraction fs′ 6 1 drawn\nfrom the blending distributions of Smith et al. (2007),\nwith source density 131 stars per square arcmin, and\nseeing 0.7 arcsec and 1.05 arcsec for the space-based and\nground-based simulations respectively. This will overestimate the blending effect for the space-based simulation, as\nthe diffraction limited PSF for a 1 m telescope will have\na full width half maximum ∼ 0.4 arcsec, but Smith et al.\n(2007) do not simulate seeing better than 0.7 arcsec. The\nfinal blending suffered by the source fs also includes flux\nfrom the lens, which is obtained from the Besançon model\nassuming it is a single star. The severity of blending is\nthus overestimated, especially for the space-based survey,\nand as blending has a large effect on the detectability (see\nAppendix B1), the event rates we estimate will be con-\n\n\fM. T. Penny, E. Kerins and S. Mao\n\nservative. However, we do not include the effect of orbital\ninclination, which can decrease the amplitude of lightcurve\nfeatures slightly (see Appendix B3), so this optimistic\nassumption will likely balance the pessimistic blending we\napply. The photometric detection threshold was calculated,\nbased approximately on the proposed design of the Euclid\nmission (Euclid Payload Definition Document 2009) for the\nspace-based survey, and the OGLE-III setup (Udalski et al.\n1997) for the ground-based setup. Total event rates are\nnormalized to rates ΓμL = 7000 yr−1 for the space-based\nsurvey (e.g. Bennett & Rhie 2002), and ΓμL = 600 yr−1 for\nthe ground based survey, corresponding roughly with the\nOGLE-III survey. The rate of RRL events ΓRRL is taken to\nbe\nΓμL X\nΓRRL =\nwi ε i ,\n(11)\nW i\nthe normalized sum of the product of εi and wi , the detectability and weight of eventPi respectively, over all microlensing events, where W =\nwi again summed over all\nevents.\nThe simulations do not account for the observing strategy, and assume that frequent monitoring (a few data points\nper night or greater) is conducted for a significant fraction\nof the year (6 months or greater). It is difficult to assess the\nimpact of seasonal observability on the probability of detecting repeating features, without performing detailed detection efficiency simulations. To account for this we introduce a factor fseas , the fraction of a year spent continuously\nobserving, which is approximately the probability that an\nindividual feature is 'caught'. We must also account for the\nfact that not every lens is binary. Raghavan et al. (2010)\nfind that 44 percent of stellar systems are multiple, with\nmass ratios q > 0.1, and of these about 20 percent lie in the\nappropriate semi-major axis range, so we adopt a binary\nfraction fb ≈ 0.1.\nFor our entire sample of space-based survey events we\nfind that RRL events make up a fraction (1.1 ± 0.2) × 10−3\nof the total microlensing event rate, which corresponds\nto an event rate ΓRRL = (7.8 ± 1.5)fseas fb yr−1 . Similarly for the ground-based survey we find that a fraction\n(0.5 ± 0.1) × 10−3 of the total microlensing event rate is\nmade up of RRLs, which corresponds to an event rate\nΓRRL = (0.32 ± 0.06)fseas fb yr−1 . In all cases the errors\nare statistical.\nFigure 7 shows the distribution of microlensing\ntimescales for the detectable RRL events and all microlensing events in the space-based simulation. The results are\nvery similar for the ground-based survey, other than the\noverall normalization. The distributions do not take into\naccount any timescale dependence on detection efficiency,\nor the binary fraction. The timescale distribution for RRLs\nshows a peak at tE ∼ 200 d that is at timescales a factor\nof ten longer than the overall microlensing timescale distribution. Even at this timescale however, detectable RRL\nevents make up less than one percent of the whole. As the\ntimescale increases, the fraction of RRL events increases.\nLong timescale events are intrinsically rare, but RRL events\nmake up a significant fraction of all events with these\ntimescales, and so such events are good targets to search\nfor RRL signals. Additionally, their long timescales mean\nthat each event is observable for many years, and it is pos-\n\n10000\n\nAll\nRRL\n\n1000\n100\ndΓ/d log tE\n\n8\n\n10\n1\n0.1\n0.01\n0.001\n0.1\n\n1\n\n10\n\n100\n\n1000\n\n10000\n\ntE /d\n\nFigure 7. Microlensing timescale distributions for detectable\nRRL events (solid line) and all microlensing events (dashed line)\nfor the space-based survey. Other than the overall normalization,\nthe distribution for a ground based survey is very similar. The dotdashed lines show the expected asymptotic slope of the timescale\ndistribution, with power law indices ±3 (Mao & Paczyński 1996)\n\nsible to obtain dense coverage of the lightcurve with standard survey-mode observations. The timescale distribution\nfor all events agrees well with the expected asymptotic behaviour (Mao & Paczyński 1996), except for the points at\nvery small and large tE , where small number statistics are\nin effect.\nVarious microlensing surveys have targeted the Galactic\nbulge, pretty much continuously for roughly twenty years.\nThese survey-mode observations take place over much of\nthe year, so the seasonal observability factor fseas will be\nclose to unity. There is therefore a good chance that there\nis of the order of one RRL event in current microlensing\ndata sets. New ground based microlensing surveys, already\nin operation and due to start in the near future will increase\nthe overall microlensing event rate significantly, and so there\nis also a reasonable chance of detecting of the order of one\nRRL over a timescale ∼ 5 years.\nA space-based microlensing survey is proposed for two\nspace missions which would launch at the end of the\ndecade: ESA's Euclid (Beaulieu et al. 2010) and NASA's\nWFIRST (Bennett 2011). Such a mission may only spend\n2–3 months per year performing a microlensing survey, as\nthe majority of observing time would be spent on dark energy surveys. As such the seasonal observability fseas ∼ 0.2\nfactor would be low, as a high degree of coincidence would\nbe necessary for multiple RRL features to fall within the\nobserving windows. The number of space based RRL detections is therefore likely to be low in reality. However, a dedicated space-based microlensing survey, possibly as a mission\nextension to Euclid or WFIRST, observing the bulge continuously for most of the year would be very likely to detect\nRRL events.\n\n4\n\nPHYSICAL PARAMETERS FROM RRLS\n\nThe lightcurve of a static binary microlensing event contains\ninformation on the lens, which can be found by fitting the\nlightcurve with a static binary microlensing model. Simi-\n\n\fRapidly Rotating Lenses\n\nsignificantly reduce the range of parameters it is necessary\nto search in order to find a suitable event model. In Appendix B3 we briefly discuss the effects of orbital inclination and eccentricity on the lightcurves and detectability of\nRRLs, and in Appendix B4 we discuss the effect of parallax\non an RRL lightcurve.\nWe choose a coordinate system fixed with respect to\nthe sky, with its origin the lens centre of mass. As such, the\nlens components are not fixed. For convenience, we recast\nthe angle α → φ0 , where φ0 is the angle subtended by the\nprimary mass relative to the x-axis at time t0 , and we fix the\nangle of the source trajectory, such that the source travels\nparallel to the y-axis. At time t the source is at the (complex)\nposition\n\u0012\n\u0013\nt − t0\nzs (t) = u0 ,\n,\n(12)\ntE\n\n1\n\n0\n\nNegative u0 trajectory\n\ny\n0.5\n\nω\n\nBA\n\nu+\nψ+\nφ(t)\nx\n\nθ(t)\n\n9\n\nzs (t)\n-0.5\n\nand subtends the angle\n-0.5\n\n0\n\n0.5\n\n1\n\nFigure 8. Parametrization of the rapidly rotating lenses. Caustics are shown as solid red lines, the lens positions as red circles,\nwith the primary lens in the positive quadrant, and the source\ntrajectory as a solid green line at positive x. The green line at negative x shows the trajectory of a source with negative u0 (see text\nfor more details). The binary axis (BA), which subtends an angle\nφ(t) relative to the fixed x-axis, rotates at a frequency ω = 2π/T .\n(u+ ,ψ+ ) is the position of the secondary caustic in polar coordinates fixed to the binary axis. The blue dotted line shows the\nBozza (2000) approximation to the position of the centre of the\nsecondary caustic (Equation 18) for this lens. The lens has the\nparameters s = 0.65 and q = 0.1, and lengths are in units of\nEinstein radii.\n\nlarly, the lightcurve of a rapidly rotating lens contains information about the lens and its orbit. In this section we investigate the information it is possible to extract from RRL\nlightcurves, and how this can be done.\nThe static binary lens lightcurve for a point source, can\nbe described with a minimum of seven parameters: three to\ndescribe the source trajectory, usually an impact parameter\nu0 and angle α, and the time of closest approach to the origin\nt0 ; one for the lightcurve baseline mb ; two to describe the\nlens, the mass ratio q and projected separation s in units of\nEinstein radii; and finally the Einstein radius crossing time\ntE . The coordinate system is usually chosen so that both\nlenses lie on the x-axis, and the origin is the centre of mass;\nwe shall refer to it as the static centre of mass system.\nThe simplest RRL, with a face-on, circular orbit requires just one additional parameter, the orbital period T ,\nfor a total of eight parameters. In contrast, a full Keplerian orbit requires five additional parameters (including the\nperiod), bringing the total to thirteen parameters, many of\nwhich will be hard to constrain. We demonstrate below that\nthe eight parameters of the face-on, circular model can be\nwell constrained by the lightcurve, and parameters can effectively be 'read off' the lightcurve with only a small amount\nof algebraic manipulation. It should be possible to use these\nparameter estimates in a more detailed modelling analysis,\neither using the face-on, circular model (which will be well\nconstrained, should the face-on, circular orbit approximation apply), or as partial constraints for a full Keplerian\nmodel. This analysis, which we describe briefly later, can\n\nθ(t) = arctan\n\n\u0012\n\nt − t0\nu0 tE\n\n\u0013\n\n(13)\n\nwith respect to the x-axis. Similarly, the binary axis, which\nwe define as the line extending from the centre of mass\nthrough the primary mass, subtends an angle\nφ(t) =\n\n2π\n(t − t0 ) + φ0\nT\n\n(14)\n\nwith respect to the x-axis. This parametrization is shown\nin Figure 8. The parametrization differs from that recently\nproposed by Skowron et al. (2011) for orbiting binary lenses,\nwhich is best suited for binaries with orbits much longer\nthan the microlensing timescale. The Skowron et al. (2011)\nparametrization is expressed in terms of the 3-dimensional\nposition and velocity of one lens component, as the \"onsky\" position components will be well constrained, the \"onsky\" velocity components may be well constrained and the\nradial position and velocity are likely to be poorly or not\nconstrained. However, as we will show, for an RRL it is the\norbital period and phase angles that will be well constrained,\nso it is better to couch the problem in terms of these quantities.\nMany of the features in a close binary lens magnification map are radial, or approximately so. This makes them\nideal for measuring the rotation rate of the lens. A feature\noccurs on the lightcurve when a magnification pattern feature sweeps over the source. A radial feature that subtends\nthe angle ψf relative to the binary axis will occur on the\nlightcurve when\nθ(t) = φ(t) + ψf .\n\n(15)\n\nBy solving this equation we can use the timing of repeated\nfeatures to easily obtain approximate measurements of some\nof the lens parameters. This means that many of the lens\nparameters can be 'read-off' the lightcurve, and it is possible to build an approximate model of the lens quickly,\nwithout complex analysis. For such estimations, the most\nimportant magnification map features are the magnification\narms (shown in Figure 1, which extend from the central\ncaustic to the secondary caustics), and a planetary demagnification, a feature that is only present for lenses with small\nmass ratios, which is a region of demagnification relative to\nthe single lens that lies between the secondary caustics, with\n\n\f10\n\nM. T. Penny, E. Kerins and S. Mao\n-0.6\n\ns\n\n∆m\n\n-0.4\n|u0 |\n\n-0.2\n\ntE\n\n0\nT\n\nResidual\n\n-0.02\n\nφ0\n\nq\n\n0\n0.02\n-150\n\n-100\n\n-50\n\n0\n\n50\n\n100\n\n150\n\n(t − t0 )/d\n\nFigure 9. An example lightcurve by an RRL showing how\nlightcurve features relate to the parameters of the lens. The lens\nhas parameters tE = 30 d, T = 38 d, s = 0.3, q = 0.1, u0 = 0.8,\nφ0 = 2.14\n\nits minimum lying along the binary axis. Both features are\ncomplementary, as in equal mass ratio binaries the planetary demagnification does not occur, but the magnification\narms are strong and very close to radial, while in low mass\nratio binaries, the magnification arms are weaker and less\nradial, but the demagnification region is strong.\nFigure 9 shows a lightcurve where features repeat\nstrongly five times. The first step to estimating RRL parameters is to fit the lightcurve with a Paczyński curve. This\nis relatively trivial, and most RRL lightcurves will approximate a Paczyński curve with only small deviations. This fit\nallows an accurate estimation of the parameters t0 , tE and\n|u0 |, the last down to an ambiguity in sign, which corresponds to the source passing the lens centre on its left (positive u0 ) or right (negative u0 ) and imposing that the lens\nalways rotates anti-clockwise. This Paczyński model completely describes the source trajectory, and hence defines the\nleft hand side of equation 15. The orbital period can now be\nestimated by timing two occurrences of the same magnification pattern feature. The period is not simply the time\nelapsed between two features, because the source moves during this time. Instead, by solving equation 15 we can find the\nrelation between the period T , and the time of two consecutive occurrences of the same magnification pattern feature\nat times t1 and t2\n2π\nT =\n(t2 − t1 ) ,\n(16)\n2π + [θ(t2 ) − θ(t1 )]\nwhere the fraction is the number of orbits the source completes between the two source encounters. The degeneracy\nin the measurement of the sign of u0 affects this equation,\ndue to the presence of the θ(t) terms, but can be resolved\nif more than one pair of features is available for estimating\nT , as only one value of u0 will give consistent estimates of\nT for different feature pairs.\nWith an estimate of the period, if we know the angle\nsubtended by a feature on the magnification map ψf , we can\nalso estimate the phase angle φ0 , again taking into account\nthe source motion\n2π\nφ0 = θ(tf ) − ψf −\n(tf − t0 ).\n(17)\nT\nThe planetary demagnification region has ψf = 0, which\n\nmakes this task simple. However, the demagnification may\nnot be obvious, or if the mass ratio of the lens is high, may\nnot be present. In these cases it is necessary to know ψf\nfor the magnification arms. Knowing that they extend from\nthe central caustic (roughly at the centre of mass) to the\nsecondary caustics, we need only know the position of the\nsecondary caustics to estimate ψf . Bozza (2000) has derived\nanalytical approximations to the position and shape of secondary caustics in close lenses using a series expansion of\nthe Jacobian, critical curves and caustics for s ≪ 1. He\nfinds that the secondary caustics are located at\n\u0014\n\u0015\n1\n(1 − q)(1 − s2 )\n√\nz± ≃\n,\n(18)\n± q(2 − s2 )\ns(1 + q)\n\nin the static centre of mass system. Figure 8 shows that\nthis expression is reasonable even when s is quite large. If\nwe assume the magnification arms are radial, we can use\nEquation 18 to approximate the angle of the magnification\narms, to second order in s, as\n\" √\n#\n± q(2 + s2 )\nψ± ≃ arctan\n,\n(19)\n1−q\n\nwhich is relatively insensitive to the lens separation s. It is\nuseful to note the asymptotic behaviour: ψ± ≃ ±2q 1/2 as\nq → 0 and ψ± → ±π as q → 1. While the dependence of\nψ± on q implies an ambiguity in the estimation of φ0 , the\ncorollary is that we can estimate the mass ratio from the\ntiming of features as well. Using the times of consecutive\nmagnification arm crossings, t+ and t− , we have\n|ψ± | =\n\n1\n2π\nθ(t− ) − θ(t+ ) −\n(t− − t+ ) .\n2\nT\n\n(20)\n\nThis value can be substituted into equation 17, and equation 19 can then be solved for q.\nThe remaining parameter that we are interested in is\nthe lens separation s. The angle of features is essentially independent of s, so it is not possible to estimate s by timing\nfeatures. However, by noting that the magnification pattern\nbecomes essentially featureless beyond the secondary caustics (see Figure 1), and that the position of the caustics does\ndepend on s, it is possible to estimate s from the lightcurve.\nUnfortunately the secondary caustics are very small, and\nin most events, they will not pass directly over the source,\nso the estimate will not be very accurate. The best estimate of the position of the caustic will be derived from the\nlargest peak due to a magnification arm in the wings of the\nlightcurve (e.g. the peak at t ≈ −90 d in Figure 9). This will\noccur when the radial source position approximately coincides with the radial caustic position, so that |zs |2 ≈ |z± |2 .\nUsing Equation 6, to first order, we can write\n\"\n\u0012\n\u00132 #−1/2\ntc − t0\n2\ns ≈ u0 +\n,\n(21)\ntE\nwhere tc is the time of the peak due to the caustic.\nWe have outlined how the parameters of an RRL can\nbe estimated from pairs of feature timings in the case of the\nsimplest RRL. However, in a given event there may be many\nrepetitions, and better parameter estimates can be obtained\nby considering all the lightcurve features simultaneously. For\na given magnification pattern and source trajectory it is possible to compute a timing model by finding all possible solutions of equation 15, θ(t) = φ(t) + ψf for each feature. By\n\n\fRapidly Rotating Lenses\n10000\n\npiece of information is needed to break the degeneracy. This\ncan be done by measuring πE = au(1−x)/rE , the microlensing parallax (Gould 1992), or by measuring θE = rE /Dl ,\nthe angular Einstein radius, through detection of finitesource effects (Gould 1994; Nemiroff & Wickramasinghe\n1994; Witt & Mao 1994), or direct detection of the lens\nonce it has separated from the source (Alcock et al. 2001;\nBennett et al. 2006, 2007; Kozlowski et al. 2007). Measurement of either πE or θE allow a second mass-distance relation\nto be written, for πE (Gould 1992)\n\nT = 0.25 yr\nπE = 0.028\nθE = 0.23 mas\n\n1000\n100\n\nM/M⊙\n\n10\n1\n0.1\n0.01\n\nM=\n\n0.001\n0.0001\n0\n\n0.2\n\n0.4\n\n0.6\n\n0.8\n\n1\n\nx\n\nFigure 10. Plot of the various mass-distance relations for the\nevent shown in Figure 9, labelled by the parameter measurement\nthat would allow their definition. The arrows point into the region\nthat is allowed should only an upper limit on T , πE or θE be\navailable. If the period T is measured along with only one of πE\nor θE , the mass and distance to the lens can not be determined\nuniquely, but even a relatively weak upper limit on the other\nparameter may be sufficient to rule out one possible solution;\nnote however that a lack of finite-source effects places a lower\nlimit on θE .\n\nextracting the occurrence time of all the lightcurve features\nit is possible to fit timing models to this timing data. It is\nalso possible to add additional features to this timing model,\nsuch as the effects of inclination and eccentricity by modifying the function φ(t), or microlensing parallax by modifying\nθ(t). This modelling may be significantly faster than a full\nlightcurve fitting analysis, especially when additional effects\nare included, as there is no need to calculate finite-source\nmagnifications. While it will not fully remove the need for\nlightcurve fitting, it will significantly narrow down the range\nof parameters over which lightcurve fitting has to search.\nWe have shown that it is possible to estimate the parameters of an RRL lightcurve, but what we would really\nlike is to be able to measure the physical parameters of the\nlens, most importantly the lens mass and the binary separation in physical units. Compared to a static binary lens, we\nhave one additional piece of information with which to infer\nM and a: the orbital period. Dominik (1998) has shown that\nby combining the orbital period T and the lens separation\ns, it is possible to write down a mass-distance relation\nM=\n\nT4\n,\nC 6 s6 x3 (1 − x)3 Ds3\n\n11\n\n(22)\n\nwhich relates the mass to the lens distance through\nknown quantities, assuming the source distance is known\nfrom its colour and magnitude; the constant C =\n−1/2\n2.85M⊙\nau kpc−1/2 when the period is measured in years\nand the source distance in kpc. As demonstrated in Appendix B3 it is likely that if the orbit is inclined it will be\npossible to measure the inclination and account for projection, so that the value of s measured is a good approximation\nof a/rE . This means that as equation 22 has a minimum at\nx = 0.5, we can place a firm lower limit on the mass of the\nlens, and an upper limit on the semi-major axis.\nTo improve on the mass-distance relation, an additional\n\nau2 (1 − x)\n,\n2\nC 2 xDs πE\n\nor\nsimilarly\nfor\nθE\nNemiroff & Wickramasinghe 1994)\nM=\n\n(23)\n(Gould\n\n2\nθE\nxDs\n,\n2\nC (1 − x)\n\n1994;\n\n(24)\n\nif θE is measured in mas. One of these relations can then be\ncombined with equation 22 to yield two possible solutions to\nthe mass and distance. This can be seen in Figure 10, which\nplots the mass-distance relations for the event shown in Figure 9.1 The πE - and θE -lines cross the T -line in two places:\nonce at the true parameter values x = 0.95, M = 1M⊙ ,\nand once at other values of M and x which are different\nfor each relation. With a measurement of only one of πE or\nθE , it is not possible to uniquely determine the mass and\nthe distance. This is likely to be the case, as finite-source\neffects are most likely in lenses close to the source, while\nparallax is most likely in lenses close to the observer. However, even a crude limit on the unmeasured parameter may\nbe enough to rule out one possible solution; e.g. an upper\nlimit on πE from the lack of parallax effects may allow the\nsolution with smaller x to be ruled out, or a lower limit on\nθE from the lack of finite-source effects may allow the solution with larger x to be ruled out. Direct detection of the\nlens may require a very long time baseline as RRL features\nare most detectable in events with low lens-source proper\nmotions. However, RRLs are more likely to be more massive\nthan the average lens, and hence brighter, and the diffraction\nlimit of 30–40 m class telescopes, such as the Thirty Metre\nTelescope (TMT),2 the Giant Magellan Telescope (GMT),3\nor the European Extremely Large Telescope (E-ELT),4 may\nbe sufficient to resolve the lens and source in a reasonable\ntime.\n\n5\n\nDISCUSSION AND CONCLUSION\n\nAlthough the phenomena of microlensing by lenses with\nrapid orbital motion has been discussed in the literature\npreviously (Dominik 1998; Dubath et al. 2007), the realities\nrequired to estimate its occurrence rate have not properly\nbeen accounted for. In this paper, we have established a\nfirm theoretical basis for rapidly rotating lenses, and used\nit to estimate the range of parameters over which they are\n1 Note that parallax or finite-source effects were not included in\nthe model used to plot the lightcurve\n2 http://www.tmt.org\n3 http://www.gmto.org\n4 http://www.eso.org/public/teles-instr/e-elt.html\n\n\f12\n\nM. T. Penny, E. Kerins and S. Mao\n\ndetectable and the rate that they are expected to be observed. We find that RRLs with masses and orbital radii\ntypical of binary stars are detectable, and that there is a\nreasonable chance that they will be detected, either in current microlensing data sets or in ongoing or near-future microlensing surveys.\nIn calculating these rates we have actually used the\nrelatively stringent criteria of requiring that two or more\nlightcurve features from the same orbital phase are detected\nin the lightcurve. If we relax this repetition requirement\nsomewhat, to include lenses that display significant signs\nof orbital motion (say several degrees rotation per tE ), the\nevent rate will increase significantly, as lenses can then have\nlarger orbits and hence stronger lightcurve features. We have\nshown in a previous paper that orbital motion is detectable\nin a large fraction (∼ 15 percent) of binary lenses with detectable binary lensing features and orbital periods comparable to the microlensing timescale (Penny et al. 2011).\nWe have detailed how the features of an RRL lightcurve\ncan be used to measure its period and potentially measure\nits mass. Even if features do not repeat, if several features\nare detectable in the lightcurves of binary lens events, then\nthe techniques we have outlined for timing features and extracting parameter estimates may be of some use in their\nanalysis. Without repeating features, the orbital period may\nnot be constrained as accurately, but it should be possible to\nplace constraints on the lens mass and orbit in many cases.\nSo far, we have neglected to discuss the prospects for\npositively identifying RRL events from other events which\nmay mimic their features. Periodic features may also be induced by orbital motion in the observer and source planes,\nor intrinsic variability in the source or a blend star. In the\nobserver plane, the period of orbital parallax effects is well\ndefined, and unless the lens has an orbital period similar\nto 1 yr it is unlikely the effects will be confused. Even if\nthe orbital period is close to one year, the shape of features\nin the lightcurve are likely to be different. Orbital effects\nin the source plane may be more difficult to exclude, as\nthe period is not fixed. If there is only a single luminous\nsource (the xallarap case, Paczynski 1997; Han & Gould\n1997; Rahvar & Dominik 2009), a timing analysis similar to\nthe one we proposed for the lens can be performed for the\nsource. This analysis is somewhat easier and more precise for\nxallarap as there are no complicated features in the magnification pattern. If this analysis is insufficient to separate\nthe two cases then the shape of lightcurve features should\ndifferentiate the two interpretations. In the case where both\nsources are luminous, the lightcurve can take a more complicated shape, which may more closely resemble that of an\nRRL (e.g. Cherepashchuk et al. 1995; Han & Gould 1997).\nEven in this case, timing analysis for maxima and minima\nof the lightcurve should be easier than for RRLs, and full\nlightcurve modelling starting from timing analysis solutions\nwill likely be able to differentiate the two scenarios. Finally,\nsource variability that is not detectable at baseline, but becomes detectable with the increased photometric accuracy\nthanks to microlensing magnification may also produce similar lightcurve features.\nIt is worth noting that we should naively expect the\nrate of RRL/significant lens orbital motion events to be\nsimilar to the rate of binary source orbital motion events,\nas the factors that govern their occurrence, such as the ra-\n\ntio of orbital separation to the Einstein ring, and the ratio\nof orbital to microlensing timescales will have similar distributions in the lens and source populations. Naively, we\nwould expect the rate of parallax events to be roughly ten\ntimes greater than the rate of RRL events with orbital periods ∼ 1 yr, as the binary fraction is ∼ 0.1 while the observer is always orbiting. It is worth comparing this with\nthe number of reported single lens parallax events, ∼ 20–\n50 (e.g. Poindexter et al. 2005; Smith et al. 2005, and references therein), while ∼ 10 events have been successfully fit\nwith xallarap models (Smith et al. 2003; Poindexter et al.\n2005). In contrast, only one binary lens event has been successfully fit with a binary lens model that shows significant\nrotation, MACHO-97-BLG-41 (Albrow et al. 2000), which\nrotates at a rate ∼ 4◦ per tE , a low rate compared to RRLs,\nthat is detected thanks to the source crossing the central\nand one secondary caustic, as opposed to the smaller, more\ncontinuous features of RRLs. It is possible therefore that\nmany events with significant rotational orbital motion signatures have not been modelled, or have been interpreted\nas xallarap events. It is thus important that any event that\nis modelled with xallarap also be tested with an orbiting\nbinary lens model.\n\nACKNOWLEDGEMENTS\nWe would like to thank the referee Andy Gould for helpful\ncomments that have improved the paper. MP acknowledges\nthe support of an STFC studentship.\n\nREFERENCES\nAlbrow M. D. et al., 2000, ApJ, 534, 894\nAlcock C. et al., 2001, Nature, 414, 617\nAn J. H. et al., 2002, ApJ, 572, 521\nBatista V. et al., 2011, A&A, 529, A102\nBeaulieu J. P. et al., 2010, in V. Coudé Du Foresto,\nD. M. Gelino, & I. Ribas, eds, ASP Conf. Ser. Vol. 430,\nPathways Towards Habitable Planets. Astron. Soc. Pac.,\nSan Francisco, p. 266\nBeaulieu J.-P. et al., 2006, Nature, 439, 437\nBennett D. P., 2011, BAAS, 43, 318.01\nBennett D. P., Rhie S. H., 2002, ApJ, 574, 985\nBennett D. P., Anderson J., Bond I. A., Udalski A., Gould\nA., 2006, ApJ, 647, L171\nBennett D. P., Anderson J., Gaudi B. S., 2007, ApJ, 660,\n781\nBennett D. P. et al., 2010, ApJ, 713, 837\nBozza V., 2000, A&A, 359, 1\nBuchalter A., Kamionkowski M., 1997, ApJ, 482, 782\nCherepashchuk A. M., Sazhin M. V., Trifalenkov I. A.,\n1995, Ap&SS, 229, 265\nDominik M., 1998, A&A, 329, 361\nDominik M., 2006, MNRAS, 367, 669\nDong S., et al., 2009, ApJ, 698, 1826\nDubath F., Gasparini M. A., Durrer R., 2007, Phys. Rev. D,\n75, 024015\nDuquennoy A., Mayor M., 1991, A&A, 248, 485\nErdl H., Schneider P., 1993, A&A, 268, 453\nGaudi B. S., Gould A., 1997, ApJ, 482, 83\n\n\fRapidly Rotating Lenses\nGaudi B. S. et al., 2008, Science, 319, 927\nGould A., 1992, ApJ, 392, 442\nGould A., 1994, ApJ, 421, L71\nGould A., Loeb A., 1992, ApJ, 396, 104\nGriest K., Hu W., 1992, ApJ, 397, 362\nHan C., 2009, ApJ, 691, L9\nHan C., Gould A., 1997, ApJ, 480, 196\nHearnshaw J. B. et al., 2006, in Sutantyo W., Premadi P. W., Mahasena P., Hidayat T., & Mineshige S.,\neds, Proc. 9th Asian-Pacific Regional IAU Meeting, Institut Teknologi Bandung Press, p. 272\nHwang K. et al., 2010, ApJ, 723, 797\nIoka K., Nishi R., Kan-Ya Y., 1999, Prog. Theor. Phys.,\n102, 983\nKerins E., Robin A. C., Marshall D. J., 2009, MNRAS, 396,\n1202\nKonno K., Kojima Y., 1999, Prog. Theor. Phys., 101, 885\nKozlowski S., Woźniak P. R., Mao S., Wood A., 2007, ApJ,\n671, 420\nKubas D. et al., 2005, A&A, 435, 941\nLiebes S. J., 1964, Phys. Rev., 133, 835\nMao S., Paczyński B., 1991, ApJ, 374, L37\nMao S., Paczyński B., 1996, ApJ, 473, 57\nMarshall D. J., Robin A. C., Reylé C., Schultheis M., Picaud S., 2006, A&A, 453, 635\nNemiroff R. J., Wickramasinghe W. A. D. T., 1994, ApJ,\n424, L21\nPaczyński B., 1986, ApJ, 304, 1\nPaczynski B., 1997, arXiv:astro-ph/9711007\nEuclid Payload Definition Document, 2009, ESA Science\ndocument, SCI-PA/2008-038, issue 4, revision 2\nPenny M. T., Mao S., Kerins E., 2011, MNRAS, 412, 607\nPoindexter S., Afonso C., Bennett D. P., Glicenstein J.-F.,\nGould A., Szymański M. K., Udalski A., 2005, ApJ, 633,\n914\nRaghavan D. et al., 2010, ApJS, 190, 1\nRahvar S., Dominik M., 2009, MNRAS, 392, 1193\nRattenbury N. J., Bond I. A., Skuljan J., Yock P. C. M.,\n2002, MNRAS, 335, 159\nRefsdal S., 1964, MNRAS, 128, 295\nRefsdal S., 1966, MNRAS, 134, 315\nRobin A. C., Reylé C., Derrière S., Picaud S., 2003, A&A,\n409, 523\nRyu Y. et al., 2010, ApJ, 723, 81\nSchneider P., Weiss A., 1986, A&A, 164, 237\nSkowron J. et al., 2011, arXiv:1101.3312\nSmith M. C., Belokurov V., Evans N. W., Mao S., An J. H.,\n2005, MNRAS, 361, 128\nSmith M. C., Mao S., Paczyński B., 2003, MNRAS, 339,\n925\nSmith M. C., Mao S., Woźniak P., 2002a, MNRAS, 332,\n962\nSmith M. C. et al., 2002b, MNRAS, 336, 670\nSmith M. C., Woźniak P., Mao S., Sumi T., 2007, MNRAS,\n380, 805\nUdalski A., 2003, Acta Astron., 53, 291\nUdalski A., Kubiak M., Szymanski M., 1997, Acta Astron.,\n47, 319\nWitt H. J., 1990, A&A, 236, 311\nWitt H. J., Mao S., 1994, ApJ, 430, 505\nZheng Z., Gould A., 2000, ApJ, 541, 728\n\n13\n\nAPPENDIX A: WHAT IS HAPPENING TO THE\nIMAGES?\nThe image configuration of a point-mass lens consists of two\nimages: a major image, of positive parity and magnification\nμ+ > 1, outside the Einstein ring and a minor image of\nnegative parity and magnification μ− < 0, inside the Einstein ring (e.g. Refsdal 1964; Liebes 1964). The addition of\na second mass to the lens causes an additional image of negative parity to be produced if the source does not lie within\na caustic (Schneider & Weiss 1986). If the lens is far from\nresonance, i.e. s ≪ 1 or s ≫ 1, two of the three images can\nstill be associated with the major and minor images of the\nsingle lens, while the new third image is labelled a tertiary\nimage.\nIt is interesting to study what is happening to each\nof the three images during the course of an RRL event.\nDubath, Gasparini & Durrer (2007) study the effects of an\norbiting close binary lens on the major image, by casting\nthe lensing potential as a time varying quadrupole. They\nshow that the major image can exhibit significant time dependent deviations from the single lens form when it is\nhighly magnified, and go on to calculate the expected rate\nof events showing such deviations. Unfortunately, they neglect to treat both the tertiary image and the minor image,\nthe latter of which will be magnified to a similar degree, as\n|μ+ | − |μ− | = 1 (e.g Refsdal 1964; Liebes 1964).\nIn Figure A1 we plot the lightcurves of all three images for an unrealistic lens with repeating features. In the\ntop panel of the figure the combined lightcurve (that which\nwould be observed) is shown in red, and the absolute magnification of the major |μ+ |, minor |μ− | and tertiary images |μ3 | is plotted in green, blue and magenta respectively.\nThe second panel from the top shows the residual of the\nlightcurve relative to the lightcurve of a single lens of the\nsame total mass, and the third and fourth panels show the\nabsolute magnification residuals of the major and minor images with respect to their single lens counterparts; the bottom panel shows the absolute magnification of the tertiary\nimage (note the different scale), which does not have a counterpart for the single lens. Each image shows a strikingly\ndifferent pattern of features: the major image is only significantly perturbed from its single lens form when the source\nis within ∼ rE of the centre of mass, while the minor image\nshows significant perturbations out to the position of the\nsecondary caustics. It is only when the source is close to the\nsecondary caustics that the tertiary image is magnified significantly. However, the most important aspects in relation\nto the Dubath et al. (2007) event rate calculation are that\nfirstly, the minor image can experience larger perturbations\nthan the primary image, and secondly that the perturbations of the major and minor images are out of phase by\nπ, in such a way that the peak to trough amplitude of the\ndeviations in the total amplification lightcurve can be significantly reduced from those of the lightcurves of individual\nimages.\n\nAPPENDIX B: ADDITIONAL FACTORS\nAFFECTING RRL DETECTABILITY\nIn the main text we have mentioned a number of additional effects that can affect the form of an RRL lightcurve\n\n\f14\n\nM. T. Penny, E. Kerins and S. Mao\n\nand its detectability. Here we briefly outline the three most\nimportant effects and the impact they will have on RRL\nlightcurves and detectability.\n\nB1\n\nBlending\n\nFor a given photometric precision σm magnitudes, the effective threshold at the event baseline is\n\u0001\n∆mmin = 2.5 log \u0010100.4σm − 1 \u0011+ fs − 2.5 log fs\n(B1)\n≃ 2.5 log 1 + 0.92 σfm\n,\ns\n\nwhere the approximation applies for small σm and fs is the\nfraction of the total light at baseline contributed by the unlensed source. Figure B1 shows this for various values of the\nphotometric threshold. It is clear that only with the most\naccurate photometry will it be possible to detect RRL features when the blend contributes most of the flux, and for\nless accurate photometry, σm ≈ 0.02 even a small amount\nof blending will significantly affect the detectability of features. The effect of blending decreases as the magnification increases, but we wish to see features over the entire\nlightcurve, and only a small region of the lightcurve will be\nmagnified enough to significantly reduce the effect of blending.\n\nB2\n\nFinite-source effects\n\nFigure B2 shows the lightcurve of an RRL lensing a giant\nsource of radius 100R⊙ , in comparison to the same RRL\nlensing a point source. The effect of the finite source on the\nlightcurve is clear, as it causes a wider, lower peak magnification. Whilst the lens centre of mass transits the source, there\nis effectively no deviation from the finite-source point-lens\nlightcurve, except for spikes in the residual at t ≈ ±20 d,\nwhich are characteristic of a large source crossing a small\ncentral caustic (Dong et al. 2009; Han 2009). In the wings\nof the lightcurve there is very little difference between the\nfinite- and point-source lightcurves, and most of the features in the residuals have the same amplitude. Only when\nthe source is very close to the secondary caustic is there\nany deviation from the point-source lightcurve in the wings.\nThe left inset of Figure B2 shows that the peak in the finitesource lightcurve at t ≈ −210 d is slightly broader and about\nhalf the amplitude of the point-source lightcurve. Interestingly, this peak, although broadened by the finite-source, is\nstill much narrower than the source crossing time, which determines the width of the central peak. Its width is instead\ndetermined by the time taken for the secondary caustic to\ncross a source diameter.\nThe example we have shown is very extreme, with a very\nlarge source, very close to the lens, and even then the finitesource effects only render binary features undetectable over\na relatively small fraction of the lightcurve. A typical giant\nsource star will be up to a factor of ten smaller, so the part of\nthe lightcurve severely affected by finite-source effects will be\ncorrespondingly smaller. As the source has to be transited by\nthe lens centre for finite-source effects to become apparent\nat the lightcurve peak, the probability of this occurring is\nalso reduced by the same factor. This means that finitesource effects will not affect the detectability of repeating\nfeatures very much. If finite-source effects are detected in an\n\nevent, the measurement of the source radius, combined with\na measurement of the lens period can be used together to\nmeasure the lens mass to a two fold degeneracy (Dominik\n1998).\nB3\n\nInclination and eccentricity\n\nInclination and eccentricity of the lens orbit will act to make\nthe magnification pattern motion much more complicated,\nas changes in the projected lens separation cause the caustics to move and change shape (see e.g. Figures 21 and 22 of\nPenny et al. 2011). The effects are too complicated to investigate in detail, but it is worth considering them in brief. For\na lens with a given semimajor axis, inclining the orbit should\nreduce the detectability of features over part of the orbit, as\ns decreases. Figure B3 shows the effect of inclination on the\nlightcurve of an RRL. It shows that inclination tends to decrease the amplitude of features, but does not completely\nwipe them out, even when the inclination i = 90◦ . In this\nextreme case, rather than rotating, the secondary caustics\nmove along diagonal lines as the projected separation of the\nlenses changes, but their angle does not, except for flips by π\nevery half period. Inclination significantly changes the morphology of the lightcurve, and can also change the timing of\npeaks (see e.g. those at t ≈ −300 d), which implies that it\nmay be possible to measure the inclination of the lens orbit\nfrom the lightcurve.\nIn contrast to inclination, eccentricity may increase the\ndetectability of features. For a given semimajor axis, eccentricity can both increase and decrease the projected separation. However, Kepler's second law implies that the lens\nwill spend longer at larger projected separations (assuming\nno inclination). As with inclination, eccentricity will also\nchange the lightcurve morphology and timing of features, so\nit may also be possible to measure the eccentricity of the lens\nfrom the lightcurve. Simultaneously including the effects of\ninclination and eccentricity in the modelling of an RRL event\nwill likely be difficult, as together they require an additional\nfour parameters over the standard RRL parametrization.\nHowever, as the angle of magnification pattern features does\nnot depend strongly on the projected separation, it will be\npossible to include inclination and eccentricity in the timing analysis proposed in Section 4, which may significantly\nease the analysis by narrowing down the search space to the\nrange of parameters compatible with timing measurements.\nB4\n\nParallax\n\nParallax effects due to the motion of the Earth about the\nSun will cause the source to appear to take a curved path\nthrough the plane of the sky, and will affect the lightcurve\nof an RRL event. If the magnitude of the parallax effect\nis small then it will cause only small perturbations to the\nshape of the lightcurve and the timing of features. Larger\neffects may cause significant changes to the RRL lightcurve,\nsignificantly changing the timing of features, and possibly\nmaking them appear less periodic, or adding a stronger annual periodicity to the lightcurve. However, while parallax\nmay significantly complicate the interpretation of an RRL\nevent, it does not affect the magnification map, and the detectability of RRL features should remain the same. Moreover, the detection of parallax in an RRL event will allow the\n\n\fRapidly Rotating Lenses\nlens mass to be measured, at least to a two-fold degeneracy\n(see Section 4). Due to the photometric accuracy required\nto detect RRLs, and the long timescales of the events, the\nprobability of detecting parallax along with RRL features is\nsignificant (Buchalter & Kamionkowski 1997).\n\n15\n\n2.5\n|μ|\n\n2\n\n|μ|\n\n1.5\n|μ+ |\n1\n|μ− |\n\n0.5\n|μ3 |\n\n∆|μ|\n\n0\n0.2\n0\n\n∆|μ+ |\n\n-0.2\n0.2\n0\n\n∆|μ− |\n\n-0.2\n0.2\n0\n-0.2\n\n|μ3 |\n\n0.02\n0\n-0.02\n-4\n\n-3\n\n-2\n\n-1\n\n0\n\n1\n\n2\n\n3\n\n4\n\nt/tE\nFigure A1. Lightcurves and residuals for each image of a microlensing event with repeating features. The top panel shows\nthe absolute magnification of the combined images (|μ|), and the\nindividual major (|μ+ |), minor (|μ− |) and tertiary (|μ3 |) images\nin different shades of grey. The central panels show the absolute\nmagnification residual with respect to the single lens form for all\nimages combined, the major image and the minor image, going\nfrom top to bottom, respectively; the bottom panel shows the\nabsolute magnification of the tertiary image, which has no single lens counterpart. The event has the unrealistic parameters\nu0 = 0.4, s = 0.3, q = 1.0 and tE /T = 10.\n\n\f16\n\nM. T. Penny, E. Kerins and S. Mao\n0.04\nMagnitude difference\n\n0.035\n0.03\nσm = 0.02\n\n0.025\n∆mmin\n\ni = 0◦\ni = 30◦\ni = 60◦\ni = 90◦\n\n-0.5\n-0.4\n-0.3\n-0.2\n-0.1\n0\n-0.02\n\n0.02\nσm = 0.01\n0.015\nResidual\n\nσm = 0.005\n0.01\n0.005\n\n-0.01\n0\n0.01\n\n0\n0\n\n0.2\n\n0.4\n\n0.6\n\n0.8\n\n1\n\nFigure B1. The effect of blending on the photometric detection\nthreshold. The effective threshold ∆mmin is plotted against the\nratio of source to total blend flux fs for three values of photometric precision σm . The solid lines show the exact value, whereas\nthe dashed line shows the approximation for small σm .\n\nMagnitude difference\n\n-2.5\n-0.02\n\n-2 -0.04\n\n0\n\n-1.5 -0.02\n-1\n-0.5\n\n0.02\n\n0\n-220\n\n0.04\n-200\n\n-50\n\n-180\n\n0\n\n50\n\nResidual\n\n0\n-0.04\n-0.02\n0\n0.02\n0.04\n-300\n\n-200\n\n-100\n\n-400\n\n-300\n\n-200\n\n-100\n\n0\n\n100\n\n200\n\n300\n\n400\n\nTime (days)\n\nfs\n\n0\n\n100\n\n200\n\n300\n\nTime (days)\n\nFigure B2. The lightcurve of an RRL lensing a finite source\nof radius 100R⊙ (black) compared to the lightcurve of the same\nRRL lensing a point source (grey). The inset figures show in more\ndetail the residuals when the source is close to the secondary caustic (on the left) and the central caustic (on the right). The lens\nhas a mass M = 0.8M⊙ , semimajor axis a = 0.4 au, mass ratio q = 0.3, fractional lens distance x = 0.95, source distance\nDs = 8 kpc, source velocity vt = 50 km s−1 , impact parameter\nu0 = 0.1 and phase angle φ0 = π/4. The ratio of source to Einstein angular radii ρs = θs /θE = 0.28 is very large. The effects\nof finite sources are only significant when the source is near the\ncentral or secondary caustics.\n\nFigure B3. The lightcurves of RRLs with different orbital inclinations relative to the line of sight. For each lightcurve, the\nlens has mass M = 0.58M⊙ , semimajor axis a = 0.54 au, mass\nratio q = 0.52, fractional lens distance x = 0.86, source distance\nDs = 9.5 kpc, source velocity vt = 61 km s−1 , impact parameter\nu0 = 0.77, phase angle φ0 = 4.3 measured in the plane of the\norbit. The orbit was circular, and inclined about the x-axis as\ndefined in Figure 8.\n\n\f"}