{"id": "http://arxiv.org/abs/0811.2767v1", "guidislink": true, "updated": "2008-11-17T18:12:05Z", "updated_parsed": [2008, 11, 17, 18, 12, 5, 0, 322, 0], "published": "2008-11-17T18:12:05Z", "published_parsed": [2008, 11, 17, 18, 12, 5, 0, 322, 0], "title": "Dark Matter Annihilation in the light of EGRET, HEAT, WMAP, INTEGRAL and\n  ROSAT", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0811.2483%2C0811.1236%2C0811.1171%2C0811.0407%2C0811.0725%2C0811.4459%2C0811.4707%2C0811.0339%2C0811.4715%2C0811.3664%2C0811.0783%2C0811.4177%2C0811.4618%2C0811.2135%2C0811.1711%2C0811.0045%2C0811.3815%2C0811.4386%2C0811.3792%2C0811.2522%2C0811.2366%2C0811.4027%2C0811.4531%2C0811.4500%2C0811.4050%2C0811.0260%2C0811.0344%2C0811.0710%2C0811.1761%2C0811.3293%2C0811.1580%2C0811.1239%2C0811.3309%2C0811.4258%2C0811.3375%2C0811.2879%2C0811.3641%2C0811.1825%2C0811.1187%2C0811.2162%2C0811.0306%2C0811.1373%2C0811.0718%2C0811.4718%2C0811.0902%2C0811.0418%2C0811.2796%2C0811.3978%2C0811.4019%2C0811.2060%2C0811.2365%2C0811.3143%2C0811.0940%2C0811.3228%2C0811.0523%2C0811.0307%2C0811.4342%2C0811.4344%2C0811.1326%2C0811.1339%2C0811.4744%2C0811.4115%2C0811.1602%2C0811.1026%2C0811.4473%2C0811.4691%2C0811.0912%2C0811.3146%2C0811.0639%2C0811.0096%2C0811.2872%2C0811.0105%2C0811.4764%2C0811.2857%2C0811.3926%2C0811.3981%2C0811.0123%2C0811.0657%2C0811.3043%2C0811.2271%2C0811.3989%2C0811.2426%2C0811.3040%2C0811.3919%2C0811.0682%2C0811.3742%2C0811.0802%2C0811.2767%2C0811.1943%2C0811.1892%2C0811.1591%2C0811.1341%2C0811.4265%2C0811.0392%2C0811.4461%2C0811.4293%2C0811.2258%2C0811.1229%2C0811.0174%2C0811.4338%2C0811.1422&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Dark Matter Annihilation in the light of EGRET, HEAT, WMAP, INTEGRAL and\n  ROSAT"}, "summary": "The ROSAT Galactic wind observations confirm that our Galaxy launches\nsupernova driven Galactic winds with wind speeds of about 150 km/s in the\nGalactic plane. Galactic winds of this strength are incompatible with current\nisotropic models for Cosmic Ray transport. In order to reproduce our local CRs\nin the presence of Galactic winds, charged CRs are required to be much more\nlocalized than in the standard isotropic GALPROP models. This requires that\nanisotropic diffusion is the dominant diffusion mode in the interstellar\nmedium, particularly that the diffusion in the disk and in the halo are\ndifferent. In addition small scale phenomena such as trapping by molecular\ncloud complexes and the structure of our local environment might influence the\nsecondary CR production rate and our local CR density gradients. We introduce\nan anisotropic convection driven transport model (aCDM) which is consistent\nwith the Galactic wind observations by ROSAT. This also explains the large\nbulge/disk ratio as observed by INTEGRAL. Furthermore such models predict an\nincrease in the $e^+/(e^++e^-)$-fraction as observed by PAMELA and HEAT, if the\nsynchrotron constraints in the 408 MHz and WMAP range are taken into account.\nNo additional contribution from Dark Matter is required. The aCDM is able to\nexplain the absence of a positron annihilation signal from molecular clouds as\nobserved by INTEGRAL by virtue of a mechanism which confines and isotropizes\nCRs between MCs. We find that the EGRET excess of diffuse $\\gamma$-rays\ncurrently cannot be explained by astrophysical effects in this type of model\nand that the interpretation of the EGRET excess as Dark Matter annihilation is\nperfectly consistent with all observational constraints from local CR fluxes\nand synchrotron radiation.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0811.2483%2C0811.1236%2C0811.1171%2C0811.0407%2C0811.0725%2C0811.4459%2C0811.4707%2C0811.0339%2C0811.4715%2C0811.3664%2C0811.0783%2C0811.4177%2C0811.4618%2C0811.2135%2C0811.1711%2C0811.0045%2C0811.3815%2C0811.4386%2C0811.3792%2C0811.2522%2C0811.2366%2C0811.4027%2C0811.4531%2C0811.4500%2C0811.4050%2C0811.0260%2C0811.0344%2C0811.0710%2C0811.1761%2C0811.3293%2C0811.1580%2C0811.1239%2C0811.3309%2C0811.4258%2C0811.3375%2C0811.2879%2C0811.3641%2C0811.1825%2C0811.1187%2C0811.2162%2C0811.0306%2C0811.1373%2C0811.0718%2C0811.4718%2C0811.0902%2C0811.0418%2C0811.2796%2C0811.3978%2C0811.4019%2C0811.2060%2C0811.2365%2C0811.3143%2C0811.0940%2C0811.3228%2C0811.0523%2C0811.0307%2C0811.4342%2C0811.4344%2C0811.1326%2C0811.1339%2C0811.4744%2C0811.4115%2C0811.1602%2C0811.1026%2C0811.4473%2C0811.4691%2C0811.0912%2C0811.3146%2C0811.0639%2C0811.0096%2C0811.2872%2C0811.0105%2C0811.4764%2C0811.2857%2C0811.3926%2C0811.3981%2C0811.0123%2C0811.0657%2C0811.3043%2C0811.2271%2C0811.3989%2C0811.2426%2C0811.3040%2C0811.3919%2C0811.0682%2C0811.3742%2C0811.0802%2C0811.2767%2C0811.1943%2C0811.1892%2C0811.1591%2C0811.1341%2C0811.4265%2C0811.0392%2C0811.4461%2C0811.4293%2C0811.2258%2C0811.1229%2C0811.0174%2C0811.4338%2C0811.1422&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "The ROSAT Galactic wind observations confirm that our Galaxy launches\nsupernova driven Galactic winds with wind speeds of about 150 km/s in the\nGalactic plane. Galactic winds of this strength are incompatible with current\nisotropic models for Cosmic Ray transport. In order to reproduce our local CRs\nin the presence of Galactic winds, charged CRs are required to be much more\nlocalized than in the standard isotropic GALPROP models. This requires that\nanisotropic diffusion is the dominant diffusion mode in the interstellar\nmedium, particularly that the diffusion in the disk and in the halo are\ndifferent. In addition small scale phenomena such as trapping by molecular\ncloud complexes and the structure of our local environment might influence the\nsecondary CR production rate and our local CR density gradients. We introduce\nan anisotropic convection driven transport model (aCDM) which is consistent\nwith the Galactic wind observations by ROSAT. This also explains the large\nbulge/disk ratio as observed by INTEGRAL. Furthermore such models predict an\nincrease in the $e^+/(e^++e^-)$-fraction as observed by PAMELA and HEAT, if the\nsynchrotron constraints in the 408 MHz and WMAP range are taken into account.\nNo additional contribution from Dark Matter is required. The aCDM is able to\nexplain the absence of a positron annihilation signal from molecular clouds as\nobserved by INTEGRAL by virtue of a mechanism which confines and isotropizes\nCRs between MCs. We find that the EGRET excess of diffuse $\\gamma$-rays\ncurrently cannot be explained by astrophysical effects in this type of model\nand that the interpretation of the EGRET excess as Dark Matter annihilation is\nperfectly consistent with all observational constraints from local CR fluxes\nand synchrotron radiation."}, "authors": ["Iris Gebauer"], "author_detail": {"name": "Iris Gebauer"}, "author": "Iris Gebauer", "arxiv_comment": "5 pages, 9 figures, to appear in the proceedings of the\n  Identification of Dark Matter conference (IDM 2008), Stockholm, Sweden, 18-22\n  August, 2008", "links": [{"href": "http://arxiv.org/abs/0811.2767v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0811.2767v1", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0811.2767v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0811.2767v1", "journal_reference": "PoS idm2008:030,2008", "doi": null, "fulltext": "arXiv:0811.2767v1 [astro-ph] 17 Nov 2008\n\nDark Matter Annihilation in the light of EGRET,\nHEAT, WMAP, INTEGRAL and ROSAT\n\nIris Gebauer∗\nInstitut für Experimentelle Kernphysik, Universiät Karlsruhe\nE-mail: gebauer@ekp.uni-karlsruhe.de\nThe ROSAT Galactic wind observations confirm that our Galaxy launches supernova (SN) driven\nGalactic winds with wind speeds of about 150 km/s in the Galactic plane. Galactic winds of this\nstrength are incompatible with current isotropic models for Cosmic Ray (CR) transport as implemented in the GALPROP code.\nIn order to reproduce our local CRs in the presence of Galactic winds, charged CRs are required\nto be much more localized than in the standard isotropic GALPROP models. This requires that\nanisotropic diffusion is the dominant diffusion mode in the interstellar medium (ISM), particularly that the diffusion in the disk and in the halo are different. In addition small scale phenomena\nsuch as trapping by molecular cloud complexes and the structure of our local environment (the\nlocal bubble or the local fluff) might influence the secondary CR production rate and our local CR\ndensity gradients.\nWe introduce an anisotropic convection driven transport model (aCDM) which is consistent with\nthe Galactic wind observations by ROSAT. This automatically explains the large bulge/disk ratio\nas observed by INTEGRAL. Furthermore such models predict an increase in the e+ /(e+ + e− )fraction as observed by PAMELA and HEAT, if the synchrotron constraints in the 408 MHz and\nWMAP range are taken into account. This increase originates entirely from the transport properties of electrons and positrons, no additional contribution from Dark Matter (DM) is required.\nThe aCDM is able to explain the absence of a positron annihilation signal from molecular clouds\n(MCs) as observed by INTEGRAL by virtue of a mechanism which confines and isotropizes CRs\nbetween MCs. Unlike isotropic models, this model does not rely on a flattened source distribution\nor a strong increase in the XCO scaling factor, but uses the supernova remnant (SNR) distribution\nas source distribution for CRs and a flat XCO scaling factor. We find that the EGRET excess of\ndiffuse γ -rays currently cannot be explained by astrophysical effects in this type of model and that\nthe interpretation of the EGRET excess as Dark Matter annihilation (DMA) is perfectly consistent\nwith all observational constraints from local CR fluxes and synchrotron radiation.\nIdentification of dark matter 2008\nAugust 18-22, 2008\nStockholm, Sweden\n\n∗ Speaker.\n\nc Copyright owned by the author(s) under the terms of the Creative Commons Attribution-NonCommercial-ShareAlike Licence.\n\nhttp://pos.sissa.it/\n\n\fDMA in the light of EGRET, HEAT, WMAP, INTEGRAL and ROSAT\n\nIris Gebauer\n\n1. Introduction\nCurrent CR transport models as implemented in the GALPROP code1 are able to either explain\nour local charged CRs (conventional models) or the diffuse Galactic γ -rays (optimized models).\nThe reason for this is that the locally observed proton spectrum is incompatible with the observed\nγ -rays by both, spectral shape and absolute flux. In isotropic diffusion dominated transport models this inconsistency cannot be explained by transport effects, because our local CRs are strongly\nlinked to the interstellar CR population. As a possible explanation an additional component from\nDMA has been proposed (1). However, in this case isotropic transport models predict too many\nlocal antiprotons (2). It is shown that anisotropic diffusion models are constistent with the DMA\ninterpretation of the EGRET excess.\n\n2. Anisotropic Convection Driven Transport Models\nThe EGRET excess is not the only challenge for Galactic transport models. Self-consistent\nGalactic wind calculations have led to the conclusion that convective transport plays a non-negligible\nrôle in our Galaxy. A recent analysis of the ROSAT X-ray data has confirmed that our Galaxy indeed launches winds with speeds of 150 km/s in the plane at the position of the sun and up to 800\nkm/s in the halo (3). Although this is a comparably low speed (starburst Galaxies launch winds\nwith speeds up to 3000 km/s), the impact upon CR transport is significant, because convective\ntransport occurs only in the direction perpendicular to the plane. As expected, the wind velocities\nappear to be roughly proportional to the SNR distribution. Transport models with isotropic diffusion can allow for convection velocity gradients of only 10 km/s/kpc (with zero wind speed at z=0\nkpc), since for larger velocities the constraints from radioactive isotopes and secondary particle\nproduction cannot be met (4). To account for the observed wind velocities anisotropic diffusion\nmodes have to be considered. Convection velocities compatible with the ROSAT observations significantly reduce the distance CRs travel in our Galaxy before they enter the convection zone and\nescape, thus leading to a model which allows for both - an effective decoupling of local CRs from\nthe global CR population as required by an astrophysical explanation of the EGRET excess and a\nsmall collection volume for all CR species including antiprotons from DMA. Such a model not only\ndecouples the local CR spectra from the Galactic average, it also explains the large bulge/disk ratio\nas observed in the 511 keV line by INTEGRAL (5) purely by the properties of CR transport. The\nbasic observation is the high intensity from the region of the Galactic bulge and a rather low signal\nfrom the disk, although the opposite is expected (6). The annihilation signal in the disk can be\nentirely explained by the decay of 26 Al from core collapse SNs, leaving no room for positrons from\nSNIa. Isotropic transport models have to invoke additional sources which are confined to the bulge\nin order to partially (7) or entirely (8) explain the observed signal from the bulge, but they cannot\nexplain why there is no annihilation signal from SNIa in the disk. In an aCDM positrons from SNIa\nare produced predominantly in regions with strong Galactic winds and so the MeV positrons from\nSNIa are almost immediately blown into the halo. In the bulge, where the lower SN rate and the\nstrong gravitational potential reduce the wind strength, positrons have enough time to annihilate.\n1 The\n\nGALPROP code is publicly available from http://galprop.stanford.edu\n\n2\n\n\fDMA in the light of EGRET, HEAT, WMAP, INTEGRAL and ROSAT\n\nIris Gebauer\n\nA second surprising result from INTEGRAL is the observation that positrons do not annihilate in\nmolecular clouds (MCs). A spectral analysis of the annihilation line indicates that practically all\nannihilation takes place in the atomic component of the gas, although molecular clouds have an\naverage density of more than half of the gas (9). One could argue that the volume filling factor of\nmolecular clouds is too small to be found by positrons. However, the high magnetic field inside\nMCs appears to correlate with the interstellar magnetic field (author?) (10). In such a model MCs\nwill act as magnetic mirrors and positrons are likely to be reflected and confined between MCs\n(11).\nNote, that Galactic winds in agreement with ROSAT are also able to explain the observed soft\ngradient in diffuse γ -rays without invoking a flattened source distribution or an increase in the XCO scaling factor: the peak in the gas distribution coincides with the peak in the SNR distribution,\nconsequently the CR interaction rate in this region, which leads to a relative overproduction of\ndiffuse γ -rays in the isotropic models, is reduced in an aCDM.\nINTEGRAL and ROSAT form strong constraints for any transport model. We have implemented\nthe transport picture described above into the publicly available GALPROP code. The main features of our implementation are: i) fast propagation perpendicular to the disk by turbulent diffusion\nand convection in agreement with the ROSAT X-ray data ii) slow diffusion in the disk and a possible trapping mechanism by molecular clouds which would increase the CR interaction rate in the\natomic component of the gas. In addition we allow for local variations in all transport parameters\nin order to account for our local Galactic environment. Compared to isotropic models CRs travel\nsmaller distances in an aCDM leading to a stronger impact of local transport phenomena.\nWe tune the transport parameters for local CR spectra and allow for an additional contribution from\nDMA in order to describe both, the diffuse γ -rays and local CR spectra (conventional aCDM). Local protons, electrons, B/C-fraction, 10 Be/9 Be-fraction, e+ /(e+ + e− )-fraction, diffuse γ -rays and\nthe 22 GHz synchrotron profile for the haze region are shown in figures 1 to 3. A breakless proton injection spectrum and a breakless diffusion coefficient turn out to be sufficient to describe\nthe locally observed CR fluxes and the diffuse γ -rays. Note, that in this model the increase in\ne+ /(e+ + e− )-fraction, as observed by PAMELA, is a natural consequence of CR transport: the\nbreaks in e+ /(e+ + e− )-fraction are mainly determined by the electron and proton injection spectra,\nmomentum losses and gains only play a minor rôle. In a conventional aCDM this naturally yields a\npositron spectrum which is slightly harder than the electron spectrum and consequently gives rise\nto the observed increase in e+ /(e+ + e− )-fraction (this interpretation is strongly supported by the\nproton and electron measuments from AMS up to 30 GeV, which show an even steeper increase\nin the p/(p + e− )-fraction). Compared to isotropic models the contribution from DMA in local\nCRs is small, since most of the positrons and antiprotons from DMA are produced in the halo,\nthus drifting away by convection. Note, that in an aCDM no additional fine-tuning is required to\ndescribe the data on local antiprotons: convection speeds are fixed by the ROSAT observations\nand transport parameters are fixed by local CR spectra and constraints from synchrotron radiation.\nThe right side of figure 3 shows the latitude profile of the synchrotron radiation in the so-called\nWMAP haze region for 22GHz. The WMAP haze consists of an excess of microwave emission\nfrom a small region close to the Galactic center. It has been suggested that this signal could be\nsynchrotron emission from relativistic electrons and positrons, possibly originating from DMA in\na cuspy halo (13). However, even in a cored profile the synchrotron radiation from the disk shows\n3\n\n\fDMA in the light of EGRET, HEAT, WMAP, INTEGRAL and ROSAT\n\nPROTONS galdef ID XX.4_Ch1278/Ch1273\n\n0.4\n\n10\n\n10\n\nPHI=600MV\n\n10\n\nconventional aCDM\noptimized aCDM\n\n104\n\nunmodulated\n\n5\n\n3\n\ninjection (arbitrary norm)\n\n10\n\n2\n\n10\n\n10\n1\n10-1\n10-2\n\nconventional aCDM\noptimized aCDM\n\n5\n\n10\n\nAMS I\n\noptimized aCDM\n0.25\n\nunmodulated\n\n10\n10-1\n\n0.2\n\nHEAO-3\nACE\n\n0.15\n\n-3\n\n10\n\nAMS I\nCAPRICE 94\n\n-5\n\n10\n\n0.1\n\nSanriku\nHEAT 94-95\n\n10-7\n\n-3\n\n10\n\nPHI=350MV\nconventional aCDM\n\n0.3\n\nunmodulated\ninjection (arbitrary norm)\n\n3\n\n10\n\nB/C ratio galdef ID XX.4_Ch1278/Ch1273\n\n0.35\n\nB/C\n\n6\n\n10\n\nPHI=600MV\n\n107\nFlux [m-2 sr -1 s-1 GeV-1]\n\n107\n\nFlux [m-2 sr -1 s-1 GeV-1]\n\nELECTRONS galdef ID XX.4_Ch1278/Ch1273\n\n9\n\n8\n\nIris Gebauer\n\n0.05\n\n-9\n\n10-4 -3\n10\n\n10\n-2\n\n10\n\n-1\n\n10\n\n1\n\n2\n\n3\n\n4\n\n10\n10\n10 10\nEnergy/nucleon [GeV]\n\n5\n\n10\n\n6\n\n10\n\n-3\n\n7\n\n10\n\n10\n\n-2\n\n10\n\n10-1\n\n1\n\n3\n\n2\n\n10\n10 10\nEnergy[GeV]\n\n104\n\n5\n\n6\n\n10\n\n0 -3\n10\n\n107\n\n10\n\n10-2\n\n10-1\n\n3\n\n10\n102\n1\n10\nEnergy/nucleon [GeV]\n\n104\n\n5\n\n10\n\nFigure 1: Left: Local proton flux for a conventional (red) and optimized aCDM (green). The full lines\ncorrespond to local modulated fluxes, the dotted lines are local unmodulated spectra and the dashed lines are\nthe injection spectra. Center: Local electron spectrum, line coding as for protons. Right: Local B/C ratio in\nan aCDM, line coding as for protons.\nBe10/Be9 ratio galdef ID XX.4_Ch1278/Ch1273\n\nFlux [m-2 sr -1 s-1 GeV-1]\n\noptimized aCDM\nconventional aCDM (+variations in electron\ninjection spectrum and magnetic field)\n\nconventional aCDM\n\n1\n\nsolar modulation tuned for averaged data\n\ne+/(e ++e-)\n\nBe10/Be9\n\noptimized aCDM\nunmodulated\n\nISOMAX\nACE\nVoyager\nUlysses\n\n10-1\n\nCDM Antiprotons\n\ne+/e+e- fraction galdef ID XX.4_Ch1278/Chan833/Ch1273/Ch1485\n\nPHI=600MV\n\nne\n\nAntiprotons\nDM\nCosmic Rays\n\n10-2\n\nle\n\nib\n\nig\n\ngl\n\nDM\n\n10-1\n\nPAMELA preliminary!\n\nDM\n10-3\n\nCR\n\naveraged data\n(without PAMELA)\nPAMELA 2008\n10-4\n\n-3\n\n10\n\n10-2\n\n10-1\n\n3\n\n10\n102\n1\n10\nEnergy/nucleon [GeV]\n\n104\n\n5\n\n10\n\n-3\n\n10\n\n10-2\n\n10-1\n\n1\n10\nEnergy [GeV]\n\n102\n\n3\n\n10\n\n10-3\n\n10-2\n\n10-1\n\n1\n\n10\n103\n102\nEnergy/nucleon [GeV]\n\nFigure 2: Left: Local 10 Be/9 Be-fraction for an aCDM, line coding as for protons in figure 1. Center: Local\ne+ /e+ + e− -fraction for an optimized aCDM (green) and a conventional aCDM (red). For the conventional\naCDM the different red lines correspond to different combinations of electron injection spectra and magnetic\nfields, which are correlated by a fit to the synchrotron radiation spectra of the Haslam skymap and WMAP\ndata. The averaged data are taken from (14) and do not include the PAMELA results. Right: Local antiprotons in a conventional aCDM. The contribution from CRs is very similar to the predictions of the isotropic\nmodels, while the contribution from DMA is reduced by virtue of the smaller collection volume.\n\na steep increase as shown in figure 3, while the intensity of synchrotron radiation from DMA (as\nrequired to explain the EGRET excess) is much lower. In order to check for astrophysical sources\nof the EGRET excess we tune the transport parameters with respect to diffuse γ -rays and try to reproduce our local charged CRs by variations of our local transport parameters (optimized aCDM).\nFigures 1 to 3 show the local protons, electrons, B/C-fraction, 10 Be/9 Be-fraction, e+ /(e+ + e− )fraction and diffuse γ -rays in an optimized aCDM. As in the isotropic model the γ -rays require a\nbreak in the proton injection spectrum at 10 GeV which is not expected from the acceleration of\nprotons by SN explosions (12). Unlike the isotropic models, in this type of model we are able to\ndescribe the observed spectra of protons and nuclei reasonably well by choosing our local transport\nparameters accordingly. Still, in an optimized aCDM local electrons seem to be incompatible with\nthe locally observed proton spectrum as can be seen from the e+ /(e+ + e− )-fraction in figure 2.\n\n3. Conclusion\nWe have presented a transport model for Galactic CRs compatible with the wind velocities\nobserved by ROSAT. In such a model the INTEGRAL 511 keV line and its spectral morphology, the\n4\n\n\fDMA in the light of EGRET, HEAT, WMAP, INTEGRAL and ROSAT\n\nA_galdef ID XX.4_Ch1278\n\nIris Gebauer\n\nSynchrotron latitude profile\n\nA_galdef ID 42.4_Ch1315\n0.50<l<29.50 , 330.50<l<359.50\n-4.50<b<-0.50 , 0.50<b< 4.50\n\ngaldef ID XX.4_Ch1278\n\n0.50<l<29.50 , 330.50<l<359.50\n-4.50<b<-0.50 , 0.50<b< 4.50\n\n20978 - 25174 MHz\n0.5<l< 10.5 , 349.5<l<359.5\n\ntotal background\n\n10-2\n\nCR\n\ntotal background\n\n10-2\n\nIC\n\nDM\n\n-3\n\nEB\n\n10\n\n10\n\n-3\n\nEB\n\n10\n\nπo\n\ntotal\n\n104\n\nIC\n\nFlux [Jy sr -1]\n\nE2. intensity [cm-2 sr-1 s-1 MeV]\n\nE2. intensity [cm-2 sr-1 s-1 MeV]\n\nDM\n\ntotal\n\n3\n\nπo\nbremss\n\nbremss\n\n10-4\n\n1\n\n10\n\n102\n3\n\n10\n102\nEnergy [MeV]\n\n104\n\n5\n\n10\n\n6\n\n10\n\n10-4\n\n1\n\n10\n\n3\n\n10\n102\nEnergy [MeV]\n\n104\n\n5\n\n10\n\n6\n\n10\n\n-80\n\n-60\n\n-40\n\n-20\n0\n20\nGalactic latitude\n\n40\n\n60\n\n80\n\nFigure 3: Diffuse γ -rays from the Galactic center region in a conventional (left) and optimized (center)\naCDM. Right: Latitude distribution of the synchrotron radiation in the small longitude range where the haze\nhas been measured. The top solid curve is the total flux, the red dots represent the haze and the lower curve\nis the contribution from the DMA interpretation of the EGRET excess.\n\nsynchrotron radiation observed by WMAP and the locally observed positron and electron spectra\nare explained entirely as a consequence of CR transport. However, without DMA this type of\nmodel is currently not able to explain the diffuse γ -rays as observed by EGRET by astrophysical\neffects in concordance with the local CR spectra. We showed that the DMA interpretation of the\nEGRET excess is compatible with the constraints from CR transport.\n\nReferences\n[1] W. de Boer, C. Sander, V. Zhukov, A. V. Gladyshev and D. I. Kazakov, A&A 444 51 (2005).\n[2] L. Bergström et al., JCAP 0605 006 (2006).\n[3] D. Breitschwerdt, Nature 452, 7189 826 (2008) and references therein.\n[4] A. W. Strong, I. V. Moskalenko and V. S. Ptuskin, Ann. Rev. Nucl. Part. Sci. 57 285 (2007).\n[5] J. Knödlseder et al., A&A 441 513 (2005).\n[6] N. Prantzos, N. A&A 449 869 (2005) and [astro-ph/0809.2491].\n[7] G. Weidenspointner et al., Nature 451 159 (2008).\n[8] C. Boehm, D. Hooper, J. Silk, M. Casse, and J. Paul, Phys. Rev. Lett. 92 101301 (2004).\n[9] P. Jean et al. Astron. Astrophys. 445 579 (2005) 579.\n[10] J. L. Han and J. S. Zhang, astro-ph/0611213.\n[11] B.D.G. Chandran, Space Sci. Rev. 99 271 (2000).\n[12] V. L. Ginzburg, V. A. Dogiel, V. S. Berezinsky, S. V. Bulanov and V. S. Ptuskin, Astrophysics\nof cosmic rays, Amsterdam, Netherlands: North-Holland (1990) 534 p\n[13] D. P. Finkbeiner, Astrophys. J. 614 186 (2004) and Phys. Rev. D 76 083012 (2007).\n[14] C. H. Chung, H. Gast, J. Olzem and S. Schael, The anomaly in the cosmic-ray positron\nspectrum, in Proc. of SUSY07, July 26 - August 1, 2007 Karlsruhe, Germany.\n5\n\n\f"}