{"id": "http://arxiv.org/abs/0709.2563v1", "guidislink": true, "updated": "2007-09-17T09:27:15Z", "updated_parsed": [2007, 9, 17, 9, 27, 15, 0, 260, 0], "published": "2007-09-17T09:27:15Z", "published_parsed": [2007, 9, 17, 9, 27, 15, 0, 260, 0], "title": "Nulling interferometry: performance comparison between Antarctica and\n  other ground-based sites", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0709.1306%2C0709.0247%2C0709.2455%2C0709.1425%2C0709.2845%2C0709.0879%2C0709.3646%2C0709.4072%2C0709.1018%2C0709.1987%2C0709.3734%2C0709.2401%2C0709.4095%2C0709.0476%2C0709.0713%2C0709.3299%2C0709.1288%2C0709.0562%2C0709.1577%2C0709.1710%2C0709.2180%2C0709.2225%2C0709.2843%2C0709.1203%2C0709.0194%2C0709.3990%2C0709.2087%2C0709.0125%2C0709.2563%2C0709.2402%2C0709.3327%2C0709.3084%2C0709.1052%2C0709.2258%2C0709.3280%2C0709.4199%2C0709.4211%2C0709.4381%2C0709.2542%2C0709.0762%2C0709.0628%2C0709.4545%2C0709.3231%2C0709.0443%2C0709.4333%2C0709.2609%2C0709.3316%2C0709.1861%2C0709.2644%2C0709.0677%2C0709.1963%2C0709.2048%2C0709.0109%2C0709.1713%2C0709.1711%2C0709.2916%2C0709.1041%2C0709.0383%2C0709.2896%2C0709.0075%2C0709.2094%2C0709.2842%2C0709.3186%2C0709.3839%2C0709.4050%2C0709.2387%2C0709.1962%2C0709.2633%2C0709.1714%2C0709.3537%2C0709.1448%2C0709.2358%2C0709.4334%2C0709.3943%2C0709.4197%2C0709.1989%2C0709.0165%2C0709.2256%2C0709.1894%2C0709.1801%2C0709.3830%2C0709.0839%2C0709.1974%2C0709.0323%2C0709.0117%2C0709.2991%2C0709.2727%2C0709.1176%2C0709.2482%2C0709.2857%2C0709.4236%2C0709.2471%2C0709.2613%2C0709.0511%2C0709.1128%2C0709.1402%2C0709.2421%2C0709.0234%2C0709.2439%2C0709.0926%2C0709.2289&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Nulling interferometry: performance comparison between Antarctica and\n  other ground-based sites"}, "summary": "Detecting the presence of circumstellar dust around nearby solar-type main\nsequence stars is an important pre-requisite for the design of future\nlife-finding space missions such as ESA's Darwin or NASA's Terrestrial Planet\nFinder (TPF). The high Antarctic plateau may provide appropriate conditions to\nperform such a survey from the ground. We investigate the performance of a\nnulling interferometer optimised for the detection of exozodiacal discs at Dome\nC, on the high Antarctic plateau, and compare it to the expected performance of\nsimilar instruments at temperate sites. Based on the currently available\nmeasurements of the turbulence characteristics at Dome C, we adapt the GENIEsim\nsoftware (Absil et al. 2006, A&A 448) to simulate the performance of a nulling\ninterferometer on the high Antarctic plateau. To feed a realistic instrumental\nconfiguration into the simulator, we propose a conceptual design for ALADDIN,\nthe Antarctic L-band Astrophysics Discovery Demonstrator for Interferometric\nNulling. We assume that this instrument can be placed above the 30-m high\nboundary layer, where most of the atmospheric turbulence originates. We show\nthat an optimised nulling interferometer operating on a pair of 1-m class\ntelescopes located 30 m above the ground could achieve a better sensitivity\nthan a similar instrument working with two 8-m class telescopes at a temperate\nsite such as Cerro Paranal. The detection of circumstellar discs about 20 times\nas dense as our local zodiacal cloud seems within reach for typical Darwin/TPF\ntargets in a integration time of a few hours. Moreover, the exceptional\nturbulence conditions significantly relax the requirements on real-time control\nloops, which has favourable consequences on the feasibility of the nulling\ninstrument.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0709.1306%2C0709.0247%2C0709.2455%2C0709.1425%2C0709.2845%2C0709.0879%2C0709.3646%2C0709.4072%2C0709.1018%2C0709.1987%2C0709.3734%2C0709.2401%2C0709.4095%2C0709.0476%2C0709.0713%2C0709.3299%2C0709.1288%2C0709.0562%2C0709.1577%2C0709.1710%2C0709.2180%2C0709.2225%2C0709.2843%2C0709.1203%2C0709.0194%2C0709.3990%2C0709.2087%2C0709.0125%2C0709.2563%2C0709.2402%2C0709.3327%2C0709.3084%2C0709.1052%2C0709.2258%2C0709.3280%2C0709.4199%2C0709.4211%2C0709.4381%2C0709.2542%2C0709.0762%2C0709.0628%2C0709.4545%2C0709.3231%2C0709.0443%2C0709.4333%2C0709.2609%2C0709.3316%2C0709.1861%2C0709.2644%2C0709.0677%2C0709.1963%2C0709.2048%2C0709.0109%2C0709.1713%2C0709.1711%2C0709.2916%2C0709.1041%2C0709.0383%2C0709.2896%2C0709.0075%2C0709.2094%2C0709.2842%2C0709.3186%2C0709.3839%2C0709.4050%2C0709.2387%2C0709.1962%2C0709.2633%2C0709.1714%2C0709.3537%2C0709.1448%2C0709.2358%2C0709.4334%2C0709.3943%2C0709.4197%2C0709.1989%2C0709.0165%2C0709.2256%2C0709.1894%2C0709.1801%2C0709.3830%2C0709.0839%2C0709.1974%2C0709.0323%2C0709.0117%2C0709.2991%2C0709.2727%2C0709.1176%2C0709.2482%2C0709.2857%2C0709.4236%2C0709.2471%2C0709.2613%2C0709.0511%2C0709.1128%2C0709.1402%2C0709.2421%2C0709.0234%2C0709.2439%2C0709.0926%2C0709.2289&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Detecting the presence of circumstellar dust around nearby solar-type main\nsequence stars is an important pre-requisite for the design of future\nlife-finding space missions such as ESA's Darwin or NASA's Terrestrial Planet\nFinder (TPF). The high Antarctic plateau may provide appropriate conditions to\nperform such a survey from the ground. We investigate the performance of a\nnulling interferometer optimised for the detection of exozodiacal discs at Dome\nC, on the high Antarctic plateau, and compare it to the expected performance of\nsimilar instruments at temperate sites. Based on the currently available\nmeasurements of the turbulence characteristics at Dome C, we adapt the GENIEsim\nsoftware (Absil et al. 2006, A&A 448) to simulate the performance of a nulling\ninterferometer on the high Antarctic plateau. To feed a realistic instrumental\nconfiguration into the simulator, we propose a conceptual design for ALADDIN,\nthe Antarctic L-band Astrophysics Discovery Demonstrator for Interferometric\nNulling. We assume that this instrument can be placed above the 30-m high\nboundary layer, where most of the atmospheric turbulence originates. We show\nthat an optimised nulling interferometer operating on a pair of 1-m class\ntelescopes located 30 m above the ground could achieve a better sensitivity\nthan a similar instrument working with two 8-m class telescopes at a temperate\nsite such as Cerro Paranal. The detection of circumstellar discs about 20 times\nas dense as our local zodiacal cloud seems within reach for typical Darwin/TPF\ntargets in a integration time of a few hours. Moreover, the exceptional\nturbulence conditions significantly relax the requirements on real-time control\nloops, which has favourable consequences on the feasibility of the nulling\ninstrument."}, "authors": ["O. Absil", "V. Coude du Foresto", "M. Barillot", "M. R. Swain"], "author_detail": {"name": "M. R. Swain"}, "author": "M. R. Swain", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1051/0004-6361:20077582", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/0709.2563v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0709.2563v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "10 pages, accepted for publication in A&A", "arxiv_primary_category": {"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0709.2563v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0709.2563v1", "journal_reference": null, "doi": "10.1051/0004-6361:20077582", "fulltext": "c ESO 2018\n\nAstronomy & Astrophysics manuscript no. 7582\nOctober 30, 2018\n\nNulling interferometry: performance comparison between\nAntarctica and other ground-based sites\nO. Absil1,2,⋆ , V. Coudé du Foresto3 , M. Barillot4 , and M. R. Swain5\n\narXiv:0709.2563v1 [astro-ph] 17 Sep 2007\n\n1\n2\n3\n4\n5\n\nLAOG, Université Joseph Fourier, CNRS, 414 rue de la Piscine, F-38400 Grenoble, France\ne-mail: olivier.absil@obs.ujf-grenoble.fr\nInstitut d'Astrophysique et de Géophysique, Université de Liège, 17 Allée du Six Août, B-4000 Liège, Belgium\nLESIA, Observatoire de Paris-Meudon, CNRS, 5 place Jules Janssen, F-92195 Meudon, France\nThales Alenia Space, 100 bd du Midi, F-06156 Cannes La Bocca, France\nJet Propulsion Laboratory, California Institute of Technology, 4800 Oak Grove Drive, Pasadena, CA 91109\n\nReceived 2 April 2007 / Accepted 28 August 2007\nABSTRACT\n\nContext. Detecting the presence of circumstellar dust around nearby solar-type main sequence stars is an important pre-requisite for\nthe design of future life-finding space missions such as ESA's Darwin or NASA's Terrestrial Planet Finder (TPF). The high Antarctic\nplateau may provide appropriate conditions to perform such a survey from the ground.\nAims. We investigate the performance of a nulling interferometer optimised for the detection of exozodiacal discs at Dome C, on the\nhigh Antarctic plateau, and compare it to the expected performance of similar instruments at temperate sites.\nMethods. Based on the currently available measurements of the turbulence characteristics at Dome C, we adapt the GENIEsim\nsoftware (Absil et al. 2006, A&A 448) to simulate the performance of a nulling interferometer on the high Antarctic plateau. To\nfeed a realistic instrumental configuration into the simulator, we propose a conceptual design for ALADDIN, the Antarctic L-band\nAstrophysics Discovery Demonstrator for Interferometric Nulling. We assume that this instrument can be placed above the 30-m high\nboundary layer, where most of the atmospheric turbulence originates.\nResults. We show that an optimised nulling interferometer operating on a pair of 1-m class telescopes located 30 m above the ground\ncould achieve a better sensitivity than a similar instrument working with two 8-m class telescopes at a temperate site such as Cerro\nParanal. The detection of circumstellar discs about 20 times as dense as our local zodiacal cloud seems within reach for typical\nDarwin/TPF targets in a integration time of a few hours. Moreover, the exceptional turbulence conditions significantly relax the\nrequirements on real-time control loops, which has favourable consequences on the feasibility of the nulling instrument.\nConclusions. The perspectives for high dynamic range, high angular resolution infrared astronomy on the high Antarctic plateau look\nvery promising.\nKey words. Atmospheric effects – Instrumentation: high angular resolution – Techniques: interferometric – Circumstellar matter\n\n1. Introduction\nNulling interferometry is considered to be the technique that can\nenable the spectroscopic characterisation of the atmosphere of\nhabitable extrasolar planets in the thermal infrared, where markers of biological activity have been identified (Kaltenegger et al.\n2007). This is actually the objective of the Darwin and TPF-I\nmissions studied by ESA and NASA, respectively (Fridlund\n2004; Beichman et al. 1999). While the spectral domain (6 −\n20 μm, where the atmosphere is mostly opaque) and required dynamic range (∼ 107 ) mandate a space interferometer to achieve\nthis goal, a ground-based pathfinder might be needed to demonstrate the technique in an operational context, carry out precursor\nscience, and therefore pave the way for space missions.\nOne of the main limitations of ground-based nulling interferometers is related to the influence of atmospheric turbulence.\nActive compensation of the harmful effects of turbulence requires real-time control systems to be designed with challenging\nrequirements (Absil et al. 2006a, hereafter Paper I). The choice\nof a good astronomical site with (s)low turbulence is therefore of\ncritical importance. In this respect, recent studies suggest that the\nSend offprint requests to: O. Absil\n⋆\nMarie-Curie EIF Postdoctoral Fellow\n\nhigh Antarctic plateau might be the best place on Earth to perform high-resolution observations in the infrared domain, thanks\nto its very stable atmospheric conditions.\nThe Antarctic plateau has long been recognised as a highquality site for observational astronomy, mainly in the context of\nsub-millimetric and infrared applications, for which the low temperature and low water vapour content bring a substantial gain\nin sensitivity. However, the only site that has been extensively\nused for astronomy so far is the South Pole, where high wind\nvelocity causes poor turbulence conditions and thereby prevents\nhigh-resolution applications in the near-infrared. The construction of the French-Italian Concordia station at Dome C (75◦S,\n123◦ E) has recently opened the path to new and exciting astronomical studies (Candidi & Lori 2003). Its main peculiarity\nwith respect to the South Pole station is that it resides on a local\nsummit of the plateau (3250 m), where katabatic winds have not\nyet acquired a significant velocity nor a large thickness by flowing down the slope of the plateau. For this reason, it is expected\nthat Dome C could become the best accessible site on the continent, and, given its promising environmental characteristics, it is\nworthwhile to investigate its potential for a ground-based nulling\ninterferometer.\n\n\f2\n\nO. Absil et al.: Nulling interferometry: performance comparison between Antarctica and other ground-based sites\n\n2. Mission definition\nIn order to provide a valid comparison with respect to a temperate site, we chose to study the potential of the Antarctic\nplateau in the context of a well specified mission, i.e., the\nground-based Darwin demonstrator that has been identified and\nstudied by ESA at the phase A level (Gondoin et al. 2004). In\nits original version, GENIE (Ground-based European Nulling\nInterferometer Experiment) is conceived as a focal instrument\nof the VLTI and its science objective is the study of the exozodiacal dust around nearby solar-type stars like the Darwin targets.\nIndeed, our knowledge of the dust distribution in the first few\nAUs around solar-type stars is currently mostly limited to the\nobservation of the solar zodiacal disc, a sparse structure of warm\nsilicate grains 10 to 100 μm in diameter, which is the most luminous component of the solar system after the Sun. The presence\nof similar discs around the Darwin targets (exozodiacal discs)\nmay present a severe limitation to the Earth-like planet detection\ncapabilities of this mission, as warm exozodiacal dust becomes\nthe main source of noise if it is more than 20 times as dense\nas in the solar zodiacal disc (Beichman et al. 2006). On-going\ninterferometric studies are indeed suggesting that dense exozodiacal discs may be more common than anticipated (Absil et al.\n2006b; Di Folco et al. 2007). The prevalence of dust in the habitable zone around nearby solar-type stars must therefore be assessed before finalising the design of the Darwin mission.\nBesides its scientific goals, the demonstrator also serves as a\ntechnology test bench to validate the operation of nulling interferometry on the sky.\n\n3. Atmospheric parameters at Dome C\nSeveral locations on the Antarctic plateau are expected to provide excellent atmospheric conditions for high-angular resolution astronomy. Because Dome C has been extensively characterised during the past years, it is taken as a reference site\nfor the present study. It might well turn out in the future that\nother sites, such as Dome A or Dome F, are better suited than\nDome C for the considered mission. One the one hand, the height\nof the turbulent ground layer might be thinner than at Dome C\n(Swain & Gallée 2006b), while on the other hand, free air seeing1 could be somewhat smaller at Antarctic sites located closer\nto the centre of the polar vortex (Marks 2002).\n3.1. Atmospheric turbulence\n\nIntensive site characterisation at Dome C has been carried\nout since the austral summer 2002–03, with the deployment\nof several instruments (Aristidi et al. 2003; Lawrence et al.\n2003). First, daytime seeing measurements with a Differential\nImage Motion Monitor (DIMM) were used to derive a median seeing value of 1.′′ 2 (Aristidi et al. 2003). Later on,\nusing a Multi-Aperture Scintillation Sensor (MASS) and a\nSonic radar (SODAR) in automated mode during wintertime,\nLawrence et al. (2004) reported a median seeing of 0.′′ 27. The\nisoplanatic angle θ0 and coherence time τ0 were also derived\nfrom MASS measurements, with average values of 5.′′ 7 and\n7.9 msec respectively. For comparison, the corresponding values at Cerro Paranal are θ0 = 2.′′ 5 and τ0 = 3.3 msec. These outstanding atmospheric conditions are however valid only above\n30 m, as the SODAR measures the distribution of turbulence in\nan atmospheric layer comprised between 30 and 900 m above\n1\n\nseeing above the turbulent ground layer\n\nthe ground, while the MASS is insensitive to seeing below about\n500 m.\nThese first results suggest that most of the atmospheric turbulence is concentrated in a thin boundary layer, about 30 m\nthick. The simultaneous use of two DIMMs at different heights\n(3 m and 8 m above the ice surface) further confirms this fact,\nshowing that half of the turbulence is concentrated into the first\n5 m above the surface (Aristidi et al. 2005). A similar behaviour\nhad already been reported at the South Pole, where SODAR\nmeasurements showed that turbulence was mostly confined to\na boundary layer sitting below 270 m (Travouillon et al. 2003).\nThis behaviour can be explained by the horizontal katabatic\nwind, whose altitude profile closely matches the turbulence profile.\nIn 2005, the first winter-over mission at Dome C has allowed\nDIMM measurements and balloon-borne thermal measurements\nto be obtained during the long Antarctic night. Preliminary results reported by Agabi et al. (2006) confirm the two-layered\nstructure of atmospheric turbulence at Dome C. A 36-m thick\nsurface layer is responsible for 87% of the turbulence, resulting\nin a total seeing of 1.′′ 9 ± 0.′′ 5, while the very stable free atmosphere has a median seeing of 0.′′ 36 ± 0.′′ 19 above 30 m. This\nvalue is remarkably similar to the median free air seeing of 0.′′ 32\nreported at South Pole by Marks et al. (1999).\n3.2. Water vapour seeing\n\nAnother critical parameter for infrared observations is the water\nvapour content of the atmosphere. On one hand, it strongly influences the sky transparency as a function of wavelength, and on\nthe other hand, its temporal fluctuations are an important source\nof noise for infrared observations. The water vapour content of\nthe Antarctic atmosphere has been measured at South Pole by radiosonde, giving an exceptionally low average value of 250 μm\nduring austral winter (Chamberlin et al. 1997; Bussmann et al.\n2005), where temperate sites typically have a few millimetres\nof precipitable water vapour (PWV). This is mainly due to the\nextreme coldness of the air, with a ground-level temperature of\nabout −61◦ C (212 K) at the South Pole during winter,2 which\ninduces a low saturation pressure for water vapour. The winter time PWV at Dome C is estimated to be between 160 μm\n(Lawrence 2004) and 350 μm (Swain & Gallée 2006a).\nThe very low water vapour content of the Dome C atmosphere has an important advantage in the context of highprecision infrared interferometry: longitudinal dispersion, created by the fluctuations of the water vapour column density\nabove the telescopes (Colavita et al. 2004), is greatly reduced\nwith respect to temperate sites. The standard deviation of PWV\n(σPWV ) can be estimated at Dome C assuming that water vapour\nseeing follows the same statistics as the piston, as suggested by\nLay (1997). In that case, the standard deviation of PWV fluctuation depends on the Fried parameter r0 viz. σPWV ∝ r0−5/6 according to Roddier (1981). Assuming that σPWV is also proportional to hPWVi, the average PWV content, its value at Dome C\ncan then be obtained by means of a comparison with the data\nobtained at temperate sites:\n!−5/6\nhPWViDC r0, DC\nσPWV (DC) =\nσPWV (i) ,\n(1)\nhPWVii\nr0, i\nwhere i represents a (well-characterised) temperate site. The application of this relation with the atmospheric parameters of ei2\nDome C is even colder during winter, with an average ground temperature of −65◦ C (208 K).\n\n\fO. Absil et al.: Nulling interferometry: performance comparison between Antarctica and other ground-based sites\n\n3\n\nTable 1. Water vapour seeing at three astronomical sites. The Fried parameter r0 is given at 500 nm, adapted from the values of\nRacine (2005). References for the PWV data are given in the last column. The standard deviation of water vapour seeing at Dome C\nis deduced from the data at Cerro Paranal and Mauna Kea following Equation 1. Water vapour seeing was measured on a baseline of\n66 m (resp. 100 m) at Paranal (resp. Mauna Kea), and we assume that our estimate at Dome C is valid for a similar range of baseline\nlengths.\nSite\nCerro Paranal\nMauna Kea\nDome C\n\nr0\n14.5 cm\n17.8 cm\n38.2 cm\n\nhPWVi\n3 mm\n1.6 mm\n0.25 mm\n\nther Cerro Paranal or Mauna Kea taken as a reference gives very\nsimilar estimates of 1.0 and 0.91 μm for σPWV at Dome C (see\nTable 1), using an average PWV content of 250 μm for Dome C.\nFor this calculation, we assumed a seeing of 0.′′ 27, which is valid\nonly above 30 m (Lawrence et al. 2004). Using this value is recommended in the present case for two reasons: on one hand, telescopes are contemplated to be placed above the turbulent ground\nlayer, and on the other hand, the study of Bussmann et al. (2005)\nshows that most of the PWV is concentrated between 200 m and\n2 km above the ground, so that water vapour seeing is suspected\nto be only weakly affected by the ground layer.\n3.3. Atmospheric transmission and sky brightness\n\nAnother benefit from the low water vapour content is to widen\nand improve the overall transmission of the infrared atmospheric\nwindows. Lawrence (2004) shows that the K band is extended up\nto 2.5 μm and the L band from 2.9 to 4.2 μm. The transmission\nof the M band around 5 μm is also significantly improved.\nThe infrared sky brightness is also partially determined\nby the water vapour content, which affects its wavelengthdependent emissivity factor. The other parameter influencing\nthe sky emission is its effective temperature, which depends\non the altitude of the main opacity layer at a given wavelength. The effective temperature above South Pole has been\nmeasured by Chamberlain et al. (2000) in the mid-infrared, with\nvalues ranging from 210 K to 239 K depending on wavelength.\nMost of the winter sky background emission is in fact assumed to emanate from an atmospheric layer just above the\ntemperature inversion layer, located between 50 and 200 m at\nDome C (Chamberlain et al. 2000; Lawrence 2004). The atmospheric temperature at this altitude is about 230 K in wintertime (Agabi et al. 2006). As a result of both low temperature\nand low emissivity, the sky background is exceptionally low in\nAntarctica. The measurements obtained at South Pole show that\nis it reduced by a factor ranging between 10 and 100 in the infrared domain with respect to temperate sites. The largest gain in\nsensitivity for astronomical observations is expected to arise in\nthe K, L and M bands. It is estimated that 1-m class telescopes\nat Dome C would reach almost the same sensitivity as 8-m class\ntelescopes at a temperate site at these wavelengths.\nThe atmospheric parameters discussed in this section are\nsummarised in Table 2.\n\n4. The ALADDIN nulling interferometer concept\nTo provide plausible inputs in terms of instrumental parameters\nfor the performance simulation, a conceptual design is needed\nfor our Antarctic nulling interferometer. The main design guidelines that have been adopted are the minimisation of the number\nof open air reflections, the preservation of the full symmetry be-\n\nσPWV\n27 μm\n11 μm\n1 μm\n\nReferences\nMeisner & Le Poole (2003)\nColavita et al. (2004)\nBussmann et al. (2005)\n\nTable 2. Atmospheric parameters adopted for the performance\nsimulation of ALADDIN at Dome C, assuming that the instrument is located about 30 m above the ground level. The equivalent wind speed is the wind speed integrated across the whole\nturbulence profile (above 30 m).\nAtmospheric parameters\nFried parameter r0 at 500 nm\n38 cm\nEquivalent seeing\n0.′′ 27\nCoherence time τ0\n7.9 msec\nEquivalent wind speed\n15 m/s\nOuter scale Lout\n100 m\nSky temperature\n230 K\nAmbient temperature at h = 30 m\n230 K\nMean PWV\n250 μm\nrms PWV\n1 μm\nPressure\n640 mbar\n\ntween the two beams and the optimisation of the range of baselines for typical Darwin target stars. Another critical guideline\nto benefit from the outstanding free air seeing is to place the instrument above the boundary layer (i.e., about 30 m above the\nground at Dome C). The following sections describe a practical\nconcept of a nulling interferometer dedicated to exozodiacal disc\ndetection, which follows these recommendations without pretending to be optimal. This concept is referred to as ALADDIN,\nthe Antarctic L-band Astrophysics Discovery Demonstrator for\nInterferometric Nulling.\n4.1. The interferometric infrastructure\n\nThe concept proposed here consists in a 40 m long rotating truss\ninstalled on top of a 30 m tower, and on which are placed two\nmoveable siderostats feeding off-axis telescopes (Fig. 1). Such\na design has two main advantages: first, thanks to the moveable\nsiderostats, the baseline length can be optimised to the observed\ntarget and second, thanks to the rotating truss, the baseline can\nalways be chosen perpendicular to the line of sight so that neither\nlong delay lines nor dispersion correctors are needed. Moreover,\npolarisation issues, which are especially harmful in nulling interferometry (Serabyn & Colavita 2001), are mitigated by this fully\nsymmetric design. The available baseline lengths range from 4\nto 30 m and provide a maximum angular resolution of 10 mas in\nthe L band. This is largely sufficient to study the habitable zones\naround Darwin/TPF-I candidate targets, since they are typically\nseparated by a few tens of milliarcseconds from their parent star\n(Kaltenegger et al. 2006).\nFor the baseline version of the ALADDIN design shown in\nFig. 1, the diameter of the siderostats has been set to 1 m, which\nis expected to provide similar performance to 8-m class tele-\n\n\f4\n\nO. Absil et al.: Nulling interferometry: performance comparison between Antarctica and other ground-based sites\n\nFig. 1. Overview of the ALADDIN infrastructure. A 40-m rotating truss bearing the siderostats is mounted on a 30-m high structure\n(not represented). The light beams collected by the two siderostats are fed into off-axis telescopes and routed towards the nulling\ninstrument cryostat by fixed relay optics (only five reflections outside the cryostat).\nTable 3. Summary of the instrumental parameters assumed for\nthe performance simulation of ALADDIN. The throughput and\nemissivity are directly computed from the baseline instrumental\ndesign, which is based on a simplified version of the GENIE\ninstrument.\nInstrumental parameters\nBaselines\n4 − 30 m\nTelescope diameter\n1m\nNumber of warm optics\n5\nWarm optics temperature\n230 K\nWarm throughput\n80%\nWarm emissivity\n20%\nNumber of cold optics\n15\nCryogenic temperature\n77 K\nCold throughput\n10%\nScience waveband\n3.1 − 4.1 μm (L)\nFringe sensing waveband\n2.0 − 2.4 μm (K)\nTip-tilt sensing waveband 1.15 − 1.3 μm (J)\n\nscopes at a temperate site. Only five reflections are required to\nlead the light from the sky down to the instrument, which is accommodated under the rotating truss, at the rotation centre. All\nrelay mirrors are at ambient temperature, i.e., about 230 K at that\naltitude during wintertime (Agabi et al. 2006). Note that an alternative design, where the instrument is placed on the ground, was\nintroduced earlier (Barillot et al. 2006). In the latter version the\ncryostat does not need to be rotated with the truss and remains\nfully static, at the cost of a more complex optical train which\nenables symmetric de-rotation of the beams and preservation of\nthe polarisation. The harmful influence of ground-layer seeing is\nthen mitigated by propagating compressed beams about 40 mm\nin diameter, i.e., smaller than the typical Fried parameter in the\nground layer.\n\n4.2. The nulling instrument\n\nThe ALADDIN interferometer feeds a nulling instrument whose\ndesign is directly inherited from GENIE, a nulling instrument originally designed to be installed at ESO's Very Large\nTelescope Interferometer (VLTI) on top of Cerro Paranal. Using\na common base design has the advantage of improving the\ncomparative value of the performance simulations. Indeed,\nALADDIN is foreseen to operate in the same wavelength\nregime, the L band (ranging from 2.8 to 4.2 μm at Dome C),\nwhich is very appropriate to investigate the inner region of extrasolar zodiacal discs. The whole nulling instrument is assumed\nto be enclosed in a cryostat, in order to improve its overall stability and to mitigate the influence of temperature variations between seasons at the ground level (the mean temperature during the austral summer is about 40◦ C higher than during winter,\nwhile the instrument should be usable during the whole year).\nThe lower temperature of the optics inside the cryostat (77 K)\nalso further decreases the background emission produced by the\ninstrument. Since (as is shown below) two subsystems needed\nfor GENIE are no longer needed for the Antarctic version, the\ninstrument is expected to be smaller and therefore easier to enclose into a cryostat.\nThe ALADDIN instrument comprises the same basic functionalities as GENIE (fringe tracking, tip-tilt correction, phase\nshifting, beam combination, modal filtering, spectral dispersion\nand detection), except for two critical control loops that are not\nneeded any more. As demonstrated in Section 5, ALADDIN can\non the one hand be operated without any dispersion correction\nthanks to the rotating baseline and to the very low water vapour\nseeing, provided that the observing waveband is restricted to the\n3.1 − 4.1 μm region, while on the other hand, real-time intensity\ncontrol is not required any more since the size of the collectors\nis significantly smaller than the Fried parameter in the L band\n(r0,L ≃ 4 m). A block diagram of the optical path and control\nsystem of ALADDIN is shown in Fig. 2. Most optical functions\nare kept at low temperature inside a vacuum enclosure. The op-\n\n\fO. Absil et al.: Nulling interferometry: performance comparison between Antarctica and other ground-based sites\nSiderostat\n\nSiderostat\n\nAfocal\nTelescope\n\nAfocal\nTelescope\n\nTip-Tilt\nMirror\n\nTip-Tilt\nMirror\n\nπ\nPhase -shift\n\nπ\nPhase -shift\n\nPassive\nDelay Line\n\nActive\nDelay Line\n\n5\n\nfor the GENIE instrument, has been used for performance\nestimation to provide a fair comparison with GENIE.\nThe control system involves three control loops only, respectively dedicated to the stabilisation of one OPD and two tip-tilt\nparameters. They are expected to be operated at lower repetition\nfrequencies than at a temperate site thanks to the slowness of\natmospheric turbulence, which represents a significant simplification. The control loops are based on conventional and separated PID controllers involving separated sensors and actuators.\nThe location of the tip-tilt mirrors in the output pupil of the telescopes ensures proper uncoupling between tip-tilt actuation and\nOPD.\n\n5. Performance study at Dome C\nTip-Tilt\nSensor\n\nBeam\nCombiner\n\nTip-Tilt\nSensor\nOPD\nSensor\n\nModal Filter\n\nCold Enclosure\n\nScience\nDetection\n\nFig. 2. Block diagram of the ALADDIN optical architecture.\nFeed-back signals driving the control of the tip-tilt and OPD parameters are shown in dashed lines. The entrance windows of the\ncold enclosure are not represented, for simplicity.\n\ntical arrangement has been significantly simplified with respect\nto the original VLTI/GENIE design:\n– The two-mirror afocal telescopes are off-axis. Thanks to the\nnarrow field-of-view, high wavefront quality is expected.\n– Tip-tilt correction is performed at the level of the collecting\ntelescopes assemblies, so that the optical paths downstream\nare kept identical whatever the baseline and orientations of\nthe siderostats and structural beam.\n– The achromatic π phase-shift is achieved geometrically, by\nmeans of opposite periscopes.\n– The beam splitters shown in Fig. 2 are actually dichroic beam\nsplitters, which separate the signal between the science wave\nband and the tip-tilt and OPD sensing wave bands.\n– Optical delay lines are of the short stroke/high accuracy kind,\nsince long stroke is not necessary in the rotating beam architecture. Their design is expected to be greatly simplified\nwith respect to usual delay lines: one-stage actuators based\non linear piezoelectric motors translating a small and light\nplane mirror are expected to be sufficient.\n– The preferred beam combiner arrangement is the Modified\nMach-Zehnder (MMZ, Serabyn & Colavita 2001).\n– The modal filter is a single-mode optical fibre. Fluoride glass\nfibres are appropriate for ALADDIN's science wavelengths.\n– OPD detection may be achieved downstream the beam combiner, by means of an ABCD algorithm, provided that one\nof the two nulled outputs of the MMZ receives a π/2 phase\nshift. Alternately, the separation between OPD sensor and\nscience bands may be implemented upstream the beam combiner and a second beam combiner accommodated for the\nOPD measurement. The latter option, which was the baseline\n\nIn order to evaluate the performance of ALADDIN, we use the\nGENIE simulation software (GENIEsim), which performs endto-end simulations of ground-based nulling interferometers with\na system-based architecture. All the building blocks and physical processes included in GENIEsim are described in detail in\nPaper I. They include the simulation of astronomical sources\n(star, circumstellar disc, planets, background emission), atmospheric turbulence (piston, longitudinal dispersion, wavefront\nerrors, scintillation), as well as a realistic implementation of\nclosed-loop compensation of atmospheric effects by means of\na fringe tracking system and of a wavefront correction system. The output of the simulator basically consists in time series of photo-electrons recorded by the detector at the two outputs of the nulling beam combiner (constructive and destructive outputs). Various information on the sub-systems are also\navailable on output for diagnostic. Routines dedicated to the\npost-processing of nulling data are also included, as described\nin Paper I. GENIEsim is written in the IDL language. It has\nbeen originally designed to simulate the GENIE instrument at\nthe VLTI interferometer, and has been extensively validated in\nthat context either by comparison with on-sky data when available (e.g., MACAO and STRAP for adaptive optics, FINITO for\nfringe tracking) or by comparison with performance estimations\ncarried out by industrial partners during the GENIE phase A\nstudy.\nThanks to the versatility of the simulator, only a few input\nparameters have to be changed to switch from the original configuration (GENIE at Cerro Paranal) to ALADDIN at Dome C.\nThese changes include the atmospheric transmission (Lawrence\n2004), as well as the atmospheric and instrumental parameters\nlisted in Tables 2 and 3. It must be noted that the ALADDIN\nperformance can be modelled with greater confidence than in\nthe case of GENIE as it does not rely on the nominal performance of an external system such as the VLTI. Furthermore, the\nperformance should remain similar across most of the Antarctic\nplateau, as free air seeing is not expected to change drastically\nfor sites located within the polar vortex. The only requirement is\nthen to adapt the height of the structure on which the instrument\nis placed. In this regard, Dome C might not be the best possible\nsite, as the boundary layer is suspected to be about 10 m thinner\nat Dome F (Swain & Gallée 2006b).\nAs in the case of GENIE, the performance is measured in\nterms of sensitivity to faint exozodiacal dust clouds. We assume\nthat these dust clouds follow the same density and temperature\ndistribution as in the solar system (Kelsall et al. 1998), except for\na global density scaling factor. To account for this, we introduce\nthe unit zodi, which corresponds to the global dust density in our\nlocal zodiacal cloud.\n\n\f6\n\nO. Absil et al.: Nulling interferometry: performance comparison between Antarctica and other ground-based sites\n\nTable 4. Control loop performance and optimum repetition frequencies (0 Hz means that no control loop is used) as simulated on\na 100 sec observation sequence, for the GENIE instrument working on the 8-m Unit Telescopes (UT) at the VLTI (results taken\nfrom Paper I) and the ALADDIN instrument at Dome C. The observations are carried out in the L band for a Sun-like G2V star\nlocated at 20 pc using either the 47-m UT2-UT3 baseline at the VLTI (waveband: 3.5–4.1 μm) or a baseline length of 20 m for\nALADDIN (waveband: 3.1–4.1 μm). The goal performance for exozodiacal disc detection discussed in Paper I appears in the last\ncolumn. The total null is the mean nulling ratio including both the geometric and instrumental leakage contributions. The last line\ngives the standard deviation of the instrumental nulling ratio for this 100 sec sequence (note that we give here the standard deviation\nof the mean instrumental nulling ratio computed on the whole time sequence, which is more representative than the frame-to-frame\ndeviation presented in Paper I).\n\nPiston\nInter-band disp.\nIntra-band disp.\nTip-tilt\nIntensity mismatch\nTotal null\nInstrumental null\nrms null\n\nGENIE – UT\nWorst case\nBest case\n17 nm @ 20 kHz 6.2 nm @ 13 kHz\n17 nm @ 200 Hz 4.4 nm @ 300 Hz\n4.1 nm @ 200 Hz 1.0 nm @ 300 Hz\n11 mas @ 1 kHz\n11 mas @ 1 kHz\n4% @ 1 kHz\n4% @ 1 kHz\n9.7 × 10−4\n6.2 × 10−4\n5.0 × 10−4\n1.5 × 10−4\n4.5 × 10−6\n2.0 × 10−6\n\n5.1. Control loop performance\n\nBecause dispersion and intensity control loops are not expected\nto be required in the case of ALADDIN, we have disabled these\ntwo loops in the GENIEsim software when simulating the residual atmospheric turbulence at beam combination. The simulation results are presented in Table 4, where the absence of dispersion and intensity control is represented by a 0 Hz repetition frequency. For these simulations, we have used two different assumptions on the atmospheric turbulence characteristics.\nThe worst case scenario does not take into account the effect\nof pupil averaging, which is expected to reduce the power spectral density (PSD) of piston and dispersion at high frequencies\n(Conan et al. 1995). This scenario thereby assumes a logarithmic slope of −8/3 at high frequencies for the PSD of these two\nquantities. Conversely, the best case scenario takes into account\nthe effect of pupil averaging at high frequencies where it produces a −17/3 logarithmic slope. The rationale for introducing\nthe worst-case scenario is that the −17/3 slope has never been\nobserved to our best knowledge (most probably due to instrumental limitations), while spurious instrumental effects might\npotentially increase the high-frequency content of piston. It must\nbe noted that the PSDs of higher order Zernike modes (tilt and\nabove) remain the same in both scenarios and take into account\npupil averaging.\nThe results listed in Table 4 confirm that two critical control loops (dispersion and intensity control) are not required any\nmore: the input atmospheric perturbations for these two quantities are either well below other contributions (e.g., piston) or\nmarginally compliant with the goal performance taken from\nPaper I.3 A second important conclusion is that, in order to reach\na residual piston similar to that of GENIE, fringe tracking can be\ncarried out at a much lower frequency (about 3 kHz instead of\n20 kHz). The technical feasibility of the instrument directly benefits from these two features. Finally, it must be noted that the\ntwo models for atmospheric turbulence provide similar results.\nThere are two reasons for this: the actual shape of the power\nspectral density has no influence on the global fluctuation of the\nquantities that are not subject to real-time control, and the cut-off\nfrequency at which the effect of pupil averaging becomes impor3\nNote that the strength of dispersion decreases for shorter baselines,\nand is only about 3 nm rms for a 4-m baseline.\n\nALADDIN\nWorst case\nBest case\n14 nm @ 3 kHz 10 nm @ 2 kHz\n7.0 nm @ 0 Hz\n7.0 nm @ 0 Hz\n7.4 nm @ 0 Hz\n7.4 nm @ 0 Hz\n9 mas @ 1 kHz 9 mas @ 1 kHz\n1.2% @ 0 Hz\n1.2% @ 0 Hz\n2.9 × 10−4\n2.2 × 10−4\n2.0 × 10−4\n1.3 × 10−4\n5.0 × 10−6\n3.5 × 10−6\n\nGoal\n< 4 nm\n< 4 nm\n< 4 nm\n(see intensity)\n< 1%\nf (baseline)\n10−5\n10−5\n\ntant is significantly higher than in the case of GENIE due to the\nreduced pupil diameter (see Paper I).\nDespite its smaller collecting area, the overall performance\nof ALADDIN in terms of instrumental null is slightly improved\nwith respect to GENIE's, by a factor up to 2.5 in the worst-case\nscenario. However, the mean instrumental nulling ratio achieved\nby ALADDIN is still a factor ∼ 10 above the performance required to detect 20-zodi discs without calibrating the instrumental response. This shows that, as in the case of GENIE, the calibration of instrumental stellar leakage will be mandatory to approach the goal sensitivity of 20 zodi.\n5.2. Estimated sensitivity\n\nUsing the parameters of Tables 2 and 3, we have simulated the\ndetection performance of ALADDIN for exozodiacal discs. The\nsimulations take into account the same calibration procedures\nas discussed in Paper I in the context of GENIE, i.e., background subtraction, geometric leakage calibration and instrumental leakage calibration. Four hypothetic targets, representative of the Darwin star catalogue, have been chosen for this\nperformance study: a K0V at 5 pc, a G5V at 10 pc, a G0V at\n20 pc and a G0V at 30 pc. The integration time has been fixed\nto 30 min as in the case of GENIE. Unless specified, we have\nassumed a typical uncertainty ∆θ∗ of 1% on the diameters of\nthe target stars (see Paper I) and we have used the worst case\nscenario for atmospheric turbulence with the −8/3 logarithmic\nslope of the power spectra at high frequencies. As demonstrated\nin Table 4, using the best case scenario would not significantly\nchange the final results.\nIn Fig. 3, we present the results of the simulations in terms\nof detectable exozodiacal density level as a function of baseline length. As in Paper I, the threshold for detection is set at a\nglobal signal-to-noise of 5, including the residuals from background subtraction and from geometric and instrumental stellar\nleakage calibration. Fig. 3 shows that the optimum baseline for\nstudying typical Darwin target stars is comprised between about\n4 and 40 m, which closely matches the baseline range offered\nby ALADDIN. With its 1 m class telescopes, ALADDIN significantly outperforms GENIE for the same integration time in the\ncase of nearby targets (see Table 6 for a thorough comparison).\nThis fact is not only due to the exceptional atmospheric condi-\n\n\fO. Absil et al.: Nulling interferometry: performance comparison between Antarctica and other ground-based sites\n\nFig. 3. Simulated performance of ALADDIN in terms of exozodiacal disc detection for four typical Darwin targets. The\nbaseline design for ALADDIN has been used (see Table 3),\nassuming an integration time of 30 min, an uncertainty of 1%\non the knowledge of the stellar angular diameter, and using the\nworst-case scenario for atmospheric turbulence (see text). The\ntwo vertical lines indicate the baseline range proposed for the\nALADDIN conceptual design.\nTable 5. Comparison of the angular resolution provided by the\noptimum ALADDIN baseline length (4 ≤ b ≤ 30 m) with the\ncharacteristic position of the habitable zone of the target systems.\n\nK0V 5 pc\nG5V 10 pc\nG0V 20 pc\nG0V 30 pc\n\nOptimum\nbaseline\n4m\n10 m\n24 m\n30 m\n\nAng. resol.\n(λ/2b)\n93 mas\n37 mas\n15 mas\n12 mas\n\nPosition HZ\n(rHZ /d)\n135 mas\n85 mas\n58 mas\n39 mas\n\ntions, but also to the optimisation of ALADDIN both regarding\nthe available baselines and the instrumental design.\nTo check the relevance of ALADDIN in the context of the\nDarwin preparatory science, it is useful to compare the angular\nresolution provided by the optimum baseline length with respect\nto the position of the habitable zone for the various targets, because Darwin will be most sensitive to dust located in that particular zone where it will search for Earth-like planets. According\nto Kasting et al. (1993), the position of the habitable zone expressed in AU is given in good approximation by the following\nequation:\nrHZ =\n\nT⋆\nT⊙\n\n!2\n\nR⋆\n,\nR⊙\n\n(2)\n\nwhich yields 0.68, 0.85 and 1.16 AU for a K0V, a G5V and\na G0V star respectively. The angular distance of the habitable\nzone to its parent star is compared to the angular resolution of\nALADDIN in Table 5. The first bright fringe of the optimised\nnulling interferometer always falls between the star and the habitable zone, and the associated angular resolution is compatible\nwith the study of this most important region of the exozodiacal\ndisc. This also validates a posteriori the choice of the L band for\nthe study of exozodiacal dust around the Darwin target stars.\n\n7\n\nFig. 4. Simulated performance of ALADDIN in terms of exozodiacal disc detection for various assumptions on the uncertainty\non the stellar angular diameters.\n\n5.3. Calibration of stellar angular diameters\n\nAn important parameter influencing the performance of a nulling\ninterferometer is the uncertainty on the angular diameter of the\ntarget star (∆θ⋆ ). It is the main contributor to the quality of calibration not only for geometric stellar leakage but also for instrumental stellar leakage, which relies on the estimation of the\ninstrumental nulling ratio on a well-known calibration star. In\nFig. 4, we investigate the influence of this ∆θ⋆ parameter on the\nALADDIN sensitivity. The baseline length is optimised in each\ncase within the specified range (4−30 m). This simulation shows\nthat, similarly to the GENIE case, an improved accuracy on stellar diameters would largely improve the detection capabilities of\nALADDIN.\nThe very good sensitivity obtained for a perfect knowledge\nof the stellar diameter gives an idea of the gain that could be\nachieved by using more elaborate nulling configurations that\nare almost insensitive to stellar leakage. An example of such a\nconfiguration is the Degenerate Angel Cross (Mennesson et al.\n2005), which uses three aligned telescopes to provide a central\ntransmission proportional to the fourth power of the angular distance to the optical axis (θ4 ) instead of the second power (θ2 )\nfor a two-telescope Bracewell interferometer. The use of phase\nchopping with multi-telescope configurations would have almost\nthe same effect, as geometric stellar leakage would then be removed by the chopping process. Fig. 4 shows that an advanced\nnulling interferometer at Dome C should be capable of reaching\na sensitivity ranging between 10 and 20 zodi around most of the\nDarwin targets. Multi-telescope configurations are however not\ncontemplated in the context of ALADDIN, for which simplicity\nis strongly advocated.\nTable 6 compares the expected sensitivity of ALADDIN, operated on 1-m telescopes, with that of GENIE on either 8-m Unit\nTelescopes or 1.8-m Auxiliary Telescopes at the VLTI, using\nvarious assumptions on the stellar diameter knowledge. A significant gain (up to a factor 4) is obtained with ALADDIN, except\nin the case of the G0V at 30 pc where the 8-m telescopes are providing a more suited collecting area. The gain with ALADDIN\nis all the larger when the target star is closer, because the use\nof short baselines is crucial for stars with relatively large angular diameters (&1 mas). As obvious from Table 6, an accurate\nknowledge of the stellar angular diameter (< 0.5%) at the ob-\n\n\f8\n\nO. Absil et al.: Nulling interferometry: performance comparison between Antarctica and other ground-based sites\n\nTable 6. Comparison of the GENIE and ALADDIN performance expressed in detectable exozodiacal disc densities as\ncompared to the solar zodiacal disc. Four different levels of uncertainty have been assumed on the angular diameter of the target stars. The simulations are performed in the L band, which\nextends from 3.5 to 4.1 μm in the case of GENIE and from 3.1 to\n4.1 μm in the case of ALADDIN. An integration time of 30 min\nis assumed in all cases.\nStar\nK0V – 5pc\nG5V – 10pc\nG0V – 20pc\nG0V – 30pc\n\n0.25%\n72\n114\n20\n111\n30\n15\n255\n21\n19\n575\n36\n62\n\n0.5%\n90\n227\n33\n130\n59\n24\n261\n29\n25\n585\n46\n63\n\n1%\n125\n455\n55\n154\n117\n37\n278\n50\n37\n604\n59\n67\n\n1.5%\n154\n682\n79\n176\n176\n51\n297\n73\n48\n615\n71\n72\n\nInstrument\nGENIE – AT\nGENIE – UT\nALADDIN\nGENIE – AT\nGENIE – UT\nALADDIN\nGENIE – AT\nGENIE – UT\nALADDIN\nGENIE – AT\nGENIE – UT\nALADDIN\n\nserving wavelength is mandatory to reach our goal sensitivity of\n20 zodi.\nAngular diameters in the L band are however currently\nnot well constrained, due to the lack of actual measurements.\nFurthermore, it is not guaranteed that an interferometer will operate in this band in a near future to provide angular diameter\nmeasurements with the required accuracy, while extrapolating\nstellar models from the visible or near-infrared (H, K bands)\ntowards the L band is not straightforward (see Paper I). An integrated concept as ALADDIN presents a significant advantage in\nthis respect, as the continuous range of available baselines can\nbe used to fit the stellar angular diameter simultaneously with\nthe exozodiacal disc parameters. This procedure is illustrated in\nFig. 5, where we have simulated ten 30-min observations of a\nK0V star at 5 pc surrounded by a 50-zodi disc, using ten baseline\nlengths ranging between 4 and 30 m. All standard calibrations\nhave been applied in these observations, except for the calibration of the geometric stellar leakage (which is actually the main\ncontributor to the observed nulling ratio). The simultaneous fit of\nthe stellar radius and the exozodiacal dust density level provides\nencouraging results, and confirms that the a priori knowledge of\nthe stellar radius is not required if a sufficient baseline coverage\nis used.\n5.4. Influence of integration time\n\nAnother advantage of the ALADDIN concept is its ability to perform very long on-source integrations. The interferometer is assumed to be continuously operated during the long winter night,\nbut also during the equinox twilight and the summer day thanks\nto the low sky temperature in all seasons and to the very low\naerosol and dust content in the atmosphere (coronal sky). The\nsummertime performance will of course be somewhat degraded\ndue to the unavoidable stray light in the instrument and to the\nhigher temperature of the sky and optical train, which produces\na larger background emission. Long integrations are also enabled\nby the fact that ALADDIN would be dedicated to the survey of\nexozodiacal discs, while an instrument like GENIE would have\nto compete with other instruments at the VLT (especially when\nusing the 8-m Unit Telescopes). Therefore, it makes sense to in-\n\nFig. 5. Simultaneous fit of the stellar radius and the exozodiacal density level using ten 30-min observations of a K0V star\nat 5 pc (actual radius of 0.85R⊙), surrounded by a 50-zodi disc.\nThe nulling ratio is computed as the ratio between the destructive\nand constructive outputs of the beam combiner. The contribution\nof instrumental stellar leakage to the nulling ratio has been subtracted from this data using the same procedure than elaborated\nfor GENIE: the observation of a calibration target of similar type\nand distance, but without circumstellar material.\nvestigate the gain in sensitivity that can be achieved by longer\nintegrations. The computation of this gain is not trivial, as all\nthe noise sources do not have the same temporal behaviour. For\ninstance, shot noise, detector noise and instability noise (to the\nfirst order) have the classical t1/2 dependence, while the imperfect calibration of geometric and instrumental stellar leakage is\nproportional to time (it actually acts as a bias).\nIn Fig. 6, we simulate the sensitivity of ALADDIN as a function of integration time. Because increasing the integration time\ndoes not improve the accuracy of both geometric and instrumental stellar leakage calibration, which are among of the main contributors to the noise budget (especially for very nearby stars),\nthe overall performance does not largely improve for long exposures (except for the fainter targets, for which sensitivity is\nbackground-limited). It must still be noted that the goal sensitivity of 20 zodi is within reach after 8 hours of integration for G0V\nstars located closer than 20 pc.\nA side effect of increasing the integration time is that the optimum baseline is decreased. Indeed, shorter baselines allow for\nless exozodiacal light to make it through the transmission pattern, but also for a better cancellation of the stellar light. The result is an improved signal-to-noise ratio regarding stellar leakage\ncalibration, while the relative increase of the shot noise contribution with respect to the transmitted exozodiacal signal is compensated by the longer integration time. For instance, in the case\nof a G0V star at 20 pc, the optimum baseline decreases from\n24 m for a 30 min integration to 12 m for an 8 h integration.\nReducing the optimum baseline is favourable to the global feasibility of the concept, as it reduces the required size of the truss\nsupporting the siderostats.\n5.5. Influence of pupil diameter\n\nFinally, in order to choose the most appropriate diameter for the\nALADDIN siderostats, we study the influence of the collecting\narea on the sensitivity of the instrument. To keep the system ar-\n\n\fO. Absil et al.: Nulling interferometry: performance comparison between Antarctica and other ground-based sites\n\nFig. 6. Simulated performance of ALADDIN in terms of exozodiacal disc detection for increasing integration times.\nchitecture unchanged, we restrict the pupil diameter to 2 m at\nmost, since larger pupils would become comparable to the size\nof turbulent cells above the boundary layer (about 4 m in the L\nband) and would therefore require either adaptive optics or additional intensity control to be implemented.\nFig. 7 shows the simulated performance of ALADDIN for\nthree different sizes of the siderostats. By increasing the diameter from 0.5 m to 1 m, the performance improves by a factor\nranging from 25% to 75%, while a typical gain between 25%\nand 50% is observed when increasing the telescope size from\n1 m to 2 m. The G0V star at 30 pc shows the most significant\nimprovement as a function of pupil size, due to its faintness (shot\nnoise from the background emission is dominant for such a faint\nstar). It must be noted that the performance of ALADDIN with\n50-cm collectors is still better than that of GENIE at the VLTI\nfor the two closest targets. Reducing the size of the siderostats\ncould thus make sense if the feasibility of the project was found\nto be jeopardised by the requirement to put 1-m siderostats on\na 40-m truss located 30 m above the ground. Increasing the integration times by a factor about 4 would then be required to\nachieve similar performance as with 1-m collectors. A beneficial\nside-effect of increasing the integration time will be to reduce\nthe optimum baselines down to an acceptable length, because\n50-cm siderostats are associated with optimum baselines typically twice as large as for the original 1-m collectors. In practice,\nthe final choice of the pupil diameter will result from a trade-off\nbetween feasibility, performance, integration time and available\nbaselines.\n\n6. Site impact on performance\nIn this section, we estimate the gain in performance that is actually related to the outstanding observing conditions above the\nboundary layer on the Antarctic plateau (and not to the optimised\ninstrumental design). For that purpose, we simulate the performance of ALADDIN at two other locations: first on the ground at\nDome C (below the boundary layer) and then at Cerro Paranal. In\nthe first case, we use the ground-level wintertime seeing conditions recently reported at Dome C by Agabi et al. (2006): a median seeing of 1.′′ 9 (i.e., a Fried parameter of 5.4 cm at 500 nm)\nand a coherence time of about 2.9 msec (i.e., equivalent wind\nspeed of 5.8 m/s). In the second case, we use the standard atmospheric conditions of Cerro Paranal already presented in Paper I.\n\n9\n\nFig. 7. Simulated performance of ALADDIN in terms of exozodiacal disc detection for three different pupil diameters (50 cm,\n1 m and 2 m).\n\n6.1. Ground-level performance at Dome C\n\nOne of the main limitations of ground-level observations comes\nfrom the fact that the Fried parameter in the L band (∼ 57 cm)\nbecomes smaller than the size of the apertures, so that multiple speckles are formed in the image plane. Assuming only tiptilt control at 1 kHz, which provides a residual tip-tilt of about\n15 mas, the typical fluctuations of the relative intensity mismatch between the two beams after modal filtering would be\nabout 18%. This is much too large to ensure a high and stable\ninstrumental nulling ratio, and the use of adaptive optics (or of\nan intensity matching device) is therefore required to stabilise\nthe injection into the single mode waveguides. Another limitation comes from the increased strength of the piston effect.\nAssuming fringe tracking to be performed at a maximum frequency of 10 kHz, the residual OPD would range between 15\nand 35 nm rms depending on the target star. Here again, the stability of the nulling ratio would be significantly degraded with\nrespect to the baseline ALADDIN concept. On the contrary, longitudinal dispersion is not expected to increase very significantly\nsince the precipitable water vapour content of the first 30 m of\nthe atmosphere is relatively small due to the very low temperature right above the ice.\nTaking all these effects into account, the instability of the\nnulling ratio (instability noise) would become the main source\nof noise in the budget of a ground-level ALADDIN. The simulations performed with GENIEsim show that the sensitivity in the\ncase of a G0V star located at 20 pc would only be about 200 zodi\ninstead of 37 zodi for the original ALADDIN concept on top of\na 30-m tower. In order to match the baseline ALADDIN performance with a ground-level instrument, higher repetition frequencies would be required for piston and tip-tilt control (both\nabout 6 kHz), while adaptive optics (or intensity control) should\nbe used to stabilise the injection efficiency into the waveguides.\nDispersion control might also be required. Preliminary estimations show that deformable mirrors using 20 × 20 actuators at a\nrepetition frequency around 1 kHz would be required to reduce\nthe intensity fluctuations down to 1%. In that case, a sensitivity\naround 50 zodi would be reachable for a G0V star at 20 pc.\nObviously, placing the instrument above the ground layer is\nrecommended to obtain a significant gain on both the perfor-\n\n\f10\n\nO. Absil et al.: Nulling interferometry: performance comparison between Antarctica and other ground-based sites\n\nmance and feasibility aspects with respect to an instrument installed at a temperate site such as Cerro Paranal.\n6.2. Ground-level performance at Cerro Paranal\n\nTo better emphasise the attractiveness of Antarctic sites in the\ncontext of high dynamic range interferometry, let us now virtually move the ALADDIN experiment to Cerro Paranal while\nkeeping the design unchanged. Because the Fried parameter is\nlarger at Paranal (r0 ∼ 1.2 m in the L band) than at the ground\nlevel at Dome C, while the coherence time is of the same order\nof magnitude (τ0 ∼ 3 msec), the performance should be somewhat better than on the ground at Dome C. Simulations indeed\nshow that the residual OPD is slightly improved (now between\n10 and 30 nm), while the residual intensity fluctuation is significantly reduced (now about 7%, but still well above the goal of\n1%).\nHowever, two other parameters significantly degrade the situation: the large background emission and the increased PWV\ncontent in the atmosphere. The main effect of the former is to\nincrease the integration time to reach a given sensitivity limit,\nwhile the fluctuations of the latter produce large variations of\nlongitudinal dispersion, which can reach about 0.7 radian if they\nare not reduced by a real-time control loop as in the case of\nGENIE (see Paper I). This corresponds to an additional OPD error of about 400 nm at the edges of the observing waveband\n(ranging from 3.5 to 4.1 μm in the case of Cerro Paranal). All in\nall, a sensitivity of about 3000 zodi is expected for a replica of\nALADDIN installed at Cerro Paranal. By introducing a dispersion control loop similar to that described in Paper I and operating it at a typical frequency of 50 Hz, longitudinal dispersion\ncould be reduced down to about 0.05 radian (30 nm), in which\ncase the sensitivity would reach about 250 zodi. This would\nhowever significantly increase the technical complexity of the\ninstrument, which is not desired.\n\n7. Conclusion\nIn this paper, we have investigated a potential solution to a welldefined scientific need, viz. characterising the dusty environment\nof candidate target stars for future life-finding missions such as\nDarwin or TPF. In a previous study (Paper I), we have shown that\nan infrared nulling interferometer installed on a temperate site,\nsuch as the GENIE project at Cerro Paranal, would provide useful information on candidate targets, but (1) that its technical feasibility could be jeopardised by the requirement to design complicated control loops for mitigating the effects of atmospheric\nturbulence, and (2) that its sensitivity would not reach the desired\nlevel of 20 times the density of our local zodiacal cloud.\nTo overcome these two limitations, we propose in this paper\na conceptual design for a nulling interferometer (ALADDIN) to\nbe installed at Dome C, on the high Antarctic plateau. Based\non the atmospheric turbulence measurements obtained so far at\nDome C, we have updated the GENIEsim software (Paper I) to\nsimulate the performance of such an instrument. These simulations show that, using 1-m collectors, this instrument would\nhave an improved sensitivity with respect to GENIE working\non 8-m telescopes, provided that it is placed above the turbulence boundary layer, which is about 30 m thick at Dome C.\nIn particular, the 20-zodi sensitivity goal seems within reach for\ntypical Darwin/TPF target stars. Moreover, the exceptional turbulence conditions above the boundary layer significantly relax\nthe requirements on the real-time compensation of atmospheric\neffects, improving the feasibility of the instrument. It must also\n\nbe noted that, thanks to the optimised range of adjustable baselines, the harmful influence of our imperfect knowledge of stellar\nangular diameters can be largely mitigated by simultaneously fitting a photospheric model and an exozodiacal disc model to the\ncollected data, yet at the price of an increased observing time.\nWhile we assumed the instrument would be deployed above\nthe boundary layer at Dome C, site of the Concordia station, it\nmight turn out that other sites on the Antarctic plateau provide\nsimultaneously a thinner boundary layer and an improved free\nair seeing, and hence better performance. The final choice for the\nsite will have to trade off the practical advantages of feasibility\nand performance vs. logistical support.\nThis paper illustrates the potential of Antarctic sites for highangular, high-dynamic range astrophysics in the infrared domain. In the particular, well specified case of a nulling interferometer, we were able to realistically quantify the relative gain\nwith respect to a temperate site, showing that a pair of 1 m telescopes on the plateau will perform better than a pair of 8 m\ntelescopes at Cerro Paranal. Other applications would result in\ndifferent gains, but it is clear that there are niches where the\nAntarctic plateau enables observations that would otherwise require access to space.\nAcknowledgements. The authors are indebted to R. den Hartog and D. Defrère\nfor their major contributions to the development of the GENIEsim software,\nwhich has been used throughout this paper. The authors also wish to thank the\nengineers at Thales Alenia Space that have contributed to the preliminary design\nof the ALADDIN instrument, as well as T. Fusco for the simulation of adaptive\noptics performance at Dome C. O.A. acknowledges the financial support of the\nBelgian National Fund for Scientific Research (FNRS) while at IAGL and of a\nMarie Curie Intra-European Fellowship (EIF) while at LAOG.\n\nReferences\nAbsil, O., den Hartog, R., Gondoin, P., et al. 2006a, A&A, 448, 787\nAbsil, O., Di Folco, E., Mérand, A., et al. 2006b, A&A, 452, 237\nAgabi, A., Aristidi, E., Azouit, M., et al. 2006, PASP, 118, 344\nAristidi, E., Agabi, A., Fossat, E., et al. 2005, A&A, 444, 651\nAristidi, E., Agabi, A., Vernin, J., et al. 2003, A&A, 406, L19\nBarillot, M., Courteau, P., Absil, O., Coudé du Foresto, V., & Swain, M. 2006, in\nProc. SPIE, Vol. 6268, Advances in Stellar Interferometry, ed. J. D. Monnier,\nM. Schöller, & W. C. Danchi, 2Z–1\nBeichman, C. A., Bryden, G., Stapelfeldt, K. R., et al. 2006, ApJ, 652, 1674\nBeichman, C. A., Woolf, N. J., & Lindensmith, C. A., eds. 1999, The Terrestrial\nPlanet Finder (TPF): a NASA Origins Program to search for habitable planets\n(Pasadena: JPL Publication 99-3)\nBussmann, R. S., Holzapfel, W. L., & Kuo, C. L. 2005, ApJ, 622, 1343\nCandidi, M. & Lori, A. 2003, Memorie della Societa Astronomica Italiana, 74,\n29\nChamberlain, M. A., Ashley, M. C. B., Burton, M. G., et al. 2000, ApJ, 535, 501\nChamberlin, R. A., Lane, A. P., & Stark, A. A. 1997, ApJ, 476, 428\nColavita, M. M., Swain, M. R., Akeson, R. L., Koresko, C. D., & Hill, R. J. 2004,\nPASP, 116, 876\nConan, J.-M., Rousset, G., & Madec, P.-Y. 1995, J. Opt. Soc. Am. A, 12, 1559\nDi Folco, E., Absil, O., Augereau, J.-C., et al. 2007, A&A, in press\nFridlund, C. V. M. 2004, Advances in Space Research, 34, 613\nGondoin, P. A., Absil, O., den Hartog, R. H., et al. 2004, in Proc. SPIE, Vol.\n5491, New Frontiers in Stellar Interferometry, ed. W. Traub, 775–786\nKaltenegger, L., Eiroa, C., Stankov, A., & Fridlund, M. 2006, in Proc. IAU\nColloquium, Vol. 200, Direct Imaging of Exoplanet: Science & Techniques,\ned. C. Aimé & F. Vakili, 255–258\nKaltenegger, L., Traub, W. A., & Jucks, K. W. 2007, ApJ, 658, 598\nKasting, J. F., Whitmire, D. P., & Reynolds, R. T. 1993, Icarus, 101, 108\nKelsall, T., Weiland, J. L., Franz, B. A., et al. 1998, ApJ, 508, 44\nLawrence, J. S. 2004, PASP, 116, 482\nLawrence, J. S., Ashley, M. C. B., Burton, M. G., et al. 2003, in Toward Other\nEarths: Darwin/TPF and the Search for Extrasolar Terrestrial Planets, Vol.\nSP-539 (ESA's Publication Division), 497–501\nLawrence, J. S., Ashley, M. C. B., Tokovinin, A., & Travouillon, T. 2004, Nature,\n431, 278\nLay, O. P. 1997, A&AS, 122, 535\nMarks, R. D. 2002, A&A, 385, 328\n\n\fO. Absil et al.: Nulling interferometry: performance comparison between Antarctica and other ground-based sites\nMarks, R. D., Vernin, J., Azouit, M., Manigault, J. F., & Clevelin, C. 1999,\nA&AS, 134, 161\nMeisner, J. A. & Le Poole, R. S. 2003, in Proc. SPIE, Vol. 4838, Interferometry\nin Optical Astronomy II, ed. W. Traub, 609–624\nMennesson, B., Léger, A., & Ollivier, M. 2005, Icarus, 178, 570\nRacine, R. 2005, PASP, 117, 401\nRoddier, F. 1981, in Progress in optics, ed. E. Wolf, Vol. XIX (Amsterdam:\nNorth-Holland), 281\nSerabyn, E. & Colavita, M. M. 2001, Appl. Opt., 40, 1668\nSwain, M. R. & Gallée, H. 2006a, in Proc. SPIE, Vol. 6267, Ground-based and\nAirborne Telescopes, ed. L. M. Stepp, 1K\nSwain, M. R. & Gallée, H. 2006b, PASP, 118, 1190\nTravouillon, T., Ashley, M. C. B., Burton, M. G., Storey, J. W. V., &\nLoewenstein, R. F. 2003, A&A, 400, 1163\n\n11\n\n\f"}