{"id": "http://arxiv.org/abs/1002.3087v3", "guidislink": true, "updated": "2010-12-24T08:47:15Z", "updated_parsed": [2010, 12, 24, 8, 47, 15, 4, 358, 0], "published": "2010-02-16T14:25:10Z", "published_parsed": [2010, 2, 16, 14, 25, 10, 1, 47, 0], "title": "Dynamic Nuclear Polarization and Nuclear Magnetic Resonance in the\n  Simplest Pseudospin Quantum Hall Ferromagnet", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1002.3631%2C1002.2543%2C1002.0975%2C1002.0161%2C1002.2536%2C1002.4868%2C1002.2708%2C1002.0305%2C1002.0295%2C1002.3348%2C1002.1932%2C1002.1526%2C1002.0738%2C1002.3943%2C1002.0311%2C1002.2213%2C1002.2065%2C1002.2320%2C1002.1227%2C1002.0965%2C1002.3936%2C1002.2476%2C1002.4883%2C1002.4651%2C1002.3381%2C1002.0897%2C1002.2007%2C1002.2235%2C1002.0060%2C1002.2156%2C1002.3802%2C1002.1531%2C1002.2825%2C1002.0194%2C1002.4398%2C1002.1644%2C1002.3087%2C1002.0739%2C1002.4615%2C1002.0573%2C1002.3549%2C1002.1561%2C1002.4838%2C1002.1942%2C1002.3561%2C1002.3715%2C1002.0857%2C1002.1004%2C1002.2848%2C1002.1032%2C1002.1948%2C1002.4544%2C1002.1993%2C1002.1685%2C1002.0672%2C1002.1458%2C1002.4520%2C1002.3543%2C1002.1854%2C1002.3806%2C1002.2139%2C1002.1101%2C1002.3831%2C1002.3292%2C1002.0562%2C1002.3746%2C1002.3985%2C1002.4950%2C1002.4369%2C1002.2739%2C1002.3649%2C1002.3024%2C1002.1018%2C1002.0593%2C1002.4118%2C1002.4889%2C1002.0278%2C1002.0079%2C1002.4048%2C1002.0331%2C1002.4800%2C1002.0088%2C1002.1928%2C1002.4298%2C1002.2341%2C1002.2171%2C1002.2649%2C1002.1377%2C1002.2885%2C1002.4472%2C1002.4152%2C1002.3541%2C1002.3346%2C1002.2211%2C1002.0392%2C1002.3497%2C1002.4698%2C1002.0052%2C1002.4938%2C1002.1510%2C1002.3605&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Dynamic Nuclear Polarization and Nuclear Magnetic Resonance in the\n  Simplest Pseudospin Quantum Hall Ferromagnet"}, "summary": "We present dynamic nuclear polarization (DNP) in the simplest pseudospin\nquantum Hall ferromagnet (QHF) of an InSb two-dimensional electron gas with a\nlarge g factor using tilted magnetic fields. The DNP-induced amplitude change\nof a resistance spike of the QHF at large current enables observation of the\nresistively detected nuclear magnetic resonance of the high nuclear spin\nisotope 115In with nine quadrupole splittings. Our results demonstrate the\nimportance of domain structures in the DNP process. The nuclear spin relaxation\ntime T1 in this QHF was relatively short (~ 120 s), and almost temperature\nindependent.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1002.3631%2C1002.2543%2C1002.0975%2C1002.0161%2C1002.2536%2C1002.4868%2C1002.2708%2C1002.0305%2C1002.0295%2C1002.3348%2C1002.1932%2C1002.1526%2C1002.0738%2C1002.3943%2C1002.0311%2C1002.2213%2C1002.2065%2C1002.2320%2C1002.1227%2C1002.0965%2C1002.3936%2C1002.2476%2C1002.4883%2C1002.4651%2C1002.3381%2C1002.0897%2C1002.2007%2C1002.2235%2C1002.0060%2C1002.2156%2C1002.3802%2C1002.1531%2C1002.2825%2C1002.0194%2C1002.4398%2C1002.1644%2C1002.3087%2C1002.0739%2C1002.4615%2C1002.0573%2C1002.3549%2C1002.1561%2C1002.4838%2C1002.1942%2C1002.3561%2C1002.3715%2C1002.0857%2C1002.1004%2C1002.2848%2C1002.1032%2C1002.1948%2C1002.4544%2C1002.1993%2C1002.1685%2C1002.0672%2C1002.1458%2C1002.4520%2C1002.3543%2C1002.1854%2C1002.3806%2C1002.2139%2C1002.1101%2C1002.3831%2C1002.3292%2C1002.0562%2C1002.3746%2C1002.3985%2C1002.4950%2C1002.4369%2C1002.2739%2C1002.3649%2C1002.3024%2C1002.1018%2C1002.0593%2C1002.4118%2C1002.4889%2C1002.0278%2C1002.0079%2C1002.4048%2C1002.0331%2C1002.4800%2C1002.0088%2C1002.1928%2C1002.4298%2C1002.2341%2C1002.2171%2C1002.2649%2C1002.1377%2C1002.2885%2C1002.4472%2C1002.4152%2C1002.3541%2C1002.3346%2C1002.2211%2C1002.0392%2C1002.3497%2C1002.4698%2C1002.0052%2C1002.4938%2C1002.1510%2C1002.3605&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We present dynamic nuclear polarization (DNP) in the simplest pseudospin\nquantum Hall ferromagnet (QHF) of an InSb two-dimensional electron gas with a\nlarge g factor using tilted magnetic fields. The DNP-induced amplitude change\nof a resistance spike of the QHF at large current enables observation of the\nresistively detected nuclear magnetic resonance of the high nuclear spin\nisotope 115In with nine quadrupole splittings. Our results demonstrate the\nimportance of domain structures in the DNP process. The nuclear spin relaxation\ntime T1 in this QHF was relatively short (~ 120 s), and almost temperature\nindependent."}, "authors": ["H. W. Liu", "K. F. Yang", "T. D. Mishima", "M. B. Santos", "Y. Hirayama"], "author_detail": {"name": "Y. Hirayama"}, "author": "Y. Hirayama", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1103/PhysRevB.82.241304", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1002.3087v3", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1002.3087v3", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "16 pages, 4 figures, PRB rapid communications, selected as an\n  Editors' suggestion", "arxiv_primary_category": {"term": "cond-mat.mes-hall", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cond-mat.mes-hall", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1002.3087v3", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1002.3087v3", "journal_reference": "Phy. Rev. B 82, 241304 (R) (2010)", "doi": "10.1103/PhysRevB.82.241304", "fulltext": "Dynamic nuclear polarization and nuclear magnetic resonance in the simplest\npseudospin quantum Hall ferromagnet\nH. W. Liu,1,2,* K. F. Yang,1 T. D. Mishima,3 M. B. Santos,3 and Y. Hirayama1,4,†\n1\n\nERATO Nuclear Spin Electronics Project, Sendai, Miyagi 980-8578, Japan\n\n2\n\nState Key Lab of Superhard Materials and Institute of Atomic and Molecular Physics, Jilin University,\n\nChangchun 130012, P. R. China\n3\n\nHomer L. Dodge Department of Physics and Astronomy, University of Oklahoma, Norman, OK\n\n73019-2061, USA\n4\n\nDepartment of Physics, Tohoku University, Sendai, Miyagi 980-8578, Japan\n\n*\n\nliuhw@ncspin.jst.go.jp\n\n†\n\nhirayama@m.tohoku.ac.jp\n\nPACS numbers: 73.43.-f, 31.30.Gs, 76.60.-k\n\nWe present dynamic nuclear polarization (DNP) in the simplest pseudospin quantum Hall ferromagnet\n(QHF) of an InSb two-dimensional electron gas with a large g factor using tilted magnetic fields. The\nDNP-induced amplitude change of a resistance spike of the QHF at large current enables observation of\nthe resistively detected nuclear magnetic resonance of the high nuclear spin isotope\n\n115\n\nIn with nine\n\nquadrupole splittings. Our results demonstrate the importance of domain structures in the DNP process.\nThe nuclear spin relaxation time T1 in this QHF was relatively short (~ 120 s), and almost temperature\nindependent.\n\n1\n\n\fDynamic nuclear polarization (DNP), resulting from the transfer of spin polarization from electrons\nto nuclei, has recently attracted considerable attention because of its significance in the study of spin\ndynamics and spin-based information processing.1 A two-dimensional electron gas (2DEG) at a\nsemiconductor heterointerface is promising for this study. Although the coupling of nuclear spins to\nelectrons in the single 2DEG is weak, resistively or optically detected nuclear magnetic resonance (RD\nNMR or ODNMR) has proven to be a highly sensitive probe of DNP.2,3 Recent experiments have explored\ningenious DNP methods for the coherent control of nuclear spins in a 2DEG4,5 and for the discovery of\nfascinating 2-D electronic features (e.g., collective spin texture, low-frequency spin fluctuations, and\nquantum phase dynamics) in the integer or fractional quantum Hall (IQH or FQH) regime.6-12 However, in\nthe past 20 years, all of these DNP studies have been applied only to the GaAs 2DEG (each nucleus has\nnuclear spin I = 3/2), mainly because of the small g factor (~ -0.44) and high mobility at low temperatures.\nIn this work, we present a novel DNP approach for the first demonstration of RDNMR in a 2DEG\nwithin the typical narrow-gap semiconductor InSb. The large effective g factor (g*, over 39 in magnitude)\nof the InSb 2DEG increases the ratio of Zeeman to cyclotron energies and thereby contributes to the\nspin-flip Landau level (LL) intersection around the filling factor (the number of occupied LLs) of ν = 2 in\ntilted magnetic fields. The simplest pseudospin quantum Hall ferromagnet (QHF) with domain structures\nis formed therein, involving the lowest two LLs with only the orbital (n = 0,1) and spin (σ = ↑,↓) indices.\nThe QHF is characterized by a resistance spike within persistent longitudinal resistance Rxx minima. DNP\noccurs when a large current flows through the QHF, resulting in the successful RDNMR detection of the\nhigh-nuclear-spin isotopes of both In and Sb. The present results are of fundamental interest for a better\nunderstanding of the simplest pseudospin QHF and DNP in low-dimensional semiconductor structures and\nare of practical relevance for quantum information processing.\n\n2\n\n\fThe 2DEG used here was confined to a 30-nm-wide InSb quantum well with symmetrically doped\nAl0.09In0.91Sb barriers13 and was processed in a Hall bar (170×40 mm). RDNMR and tilted-magnetic-field\nmeasurements were performed using a dilution refrigerator with an in situ rotator. A small RF field (~ mT,\ncontinuous wave) for NMR studies was generated by a single turn coil wound around the sample and a\nstandard AC lock-in technique at 13.3 Hz was used to measure Rxx. Our 2DEG had an electron density of\nns = 1.83 × 1015 m-2 and a low-temperature electron mobility of m = 14.3 m2/Vs.\nAs a 2DEG sample rotates around a magnetic field Btot [inset, Fig. 1(b)], the perpendicular field\ncomponent B^ drives electrons to occupy LLs separated by the cyclotron energy, hωc = heB⊥ /m* (where\n\nh is the reduced Planck's constant and m* is the effective mass). Btot also couples the electron spins and\nsplits each LL into two sublevels with the Zeeman energy, hωs = g* μB Btot = g* μB B⊥ / cos θ (where μB is\nthe Bohr magneton and θ is the tilt angle). The LL energy gap results in the vanishing of Rxx as a signature\nof the IQH effect. The ratio of hωc and hωs can be tuned by tilting θ. For a constant B^ (or hωc ),\n\nhωs increases linearly with increasing 1/cosθ [Fig. 1(a)], leading to a spin-flip LL intersection at\n14\nrhωs = hωc with integer coincidence ratios r. The LL energy gap collapses at the intersection in the\n\nabsence of electron-electron interactions, showing a resistance peak instead of an Rxx minimum. However,\nricher physics is expected at the LL intersection in the presence of strong electron-electron interactions15-17\n(see also below). Because g* of the InSb 2DEG is extremely large,18 the remarkable enhancement of hωs\nplaces the LL degeneracy at easily accessible fields, a phenomenon that motivated the studies reported\nhere.\nThe evolution of LLs was mapped by measuring the peak positions of Rxx at different θ with a small\ncurrent of Isd = 3 nA [Fig. 1(b)]. Two types of LL intersections were prominent. The first was characterized\nby a coalescence of Rxx minima (circle), as also depicted in Fig. 1(a), and the other by a resistance spike\n\n3\n\n\fwithin persistent Rxx minima (solid line). The resistance spike occurred at the LL intersection in the region\nof high B^ and small ν, where the exchange energy is expected to be large.16 Electrons therein prefer to\noccupy aligned LLs in the ordered state to gain the exchange energy prior the single-particle energy cross.\nBecause the intersecting LLs have different orbit and spin indices, the pseudospin quantum number is used\nto describe the phase transition from a paramagnetic state to a ferromagnetic state.15 For instance,\npseudospin-down and pseudospin-up at the ν = 2 LL intersection correspond to the states of (n, σ) = (0,↓)\nand (n, σ) = (1, ↑). In this case, the QHF has easy-axis (Ising) anisotropy with discrete preferred\npseudospin orientations (also called quantum Hall Ising ferromagnet). Disorder or a finite temperature\nproduces a domain wall separating domains with different pseudospin polarizations.17 Charge transport\nthrough the domain wall results in the resistance spike.17,19 The ν = 2 QHF is the simplest pseudospin\nQHF involving only the lowest two LLs, providing an ideal basis for understanding the physics of the\nQHF. However, the previous studies of the ν = 2 QHF have been limited to conventional magnetotransport\nmeasurements.13,20\nThe dependence of Rxx on B^ around ν = 2 is shown in Fig. 2(a). The resistance spikes (arrow) were\nevident between θ = 58.7° and θ = 61.2° in the magnetotransport measurement. We will see later that the\nfollowing high-sensitivity RDNMR approach can even probe the spike inside the LL peak. The resistance\nspike was found to depend on Isd (Figs. S1 and S2 of Ref. 21). At relatively large Isd, Rxx exhibited an\nexponential increase over time [inset, Fig. 2(b)]. As Rxx became saturated, the RF was set to irradiate the\n2DEG while sweeping the frequency f through the Larmor resonance of each nucleus. Figure 2(b) shows\nRxx vs. f for 115In. A dip with a resistance change ΔRxx appeared at resonance frequency fNMR = 65.42 MHz,\nrepresenting an RDNMR signal of\n\n115\n\nIn. In a similar way, the RDNMR signals of\n\nalso obtained (Fig. S3 of Ref. 21). We did not observe the RDNMR signal of\n\n4\n\n113\n\n121\n\nSb and\n\n123\n\nSb were\n\nIn as expected from its\n\n\flow nuclear abundance (4.3%). The fNMR value gives the gyromagnetic ratio γ = 2πf NMR / Btot :\n\nγ115 In = 58.7MHz / T , γ121 Sb = 64MHz / T , and γ123 Sb = 34.7 MHz / T , in accordance with those in bulk\nInSb.22\nThe observed RDNMR in the InSb 2DEG relies on the contact hyperfine interaction.23 Because the\nspin reversal energy of nuclei is one-thousandth of that of electrons, electron-nuclear flip-flop requires a\nsignificant energy reduction in electron spin-flip. The domains with different pseudospin polarizations are\nenergetically degenerate in the ν = 2 QHF, probably allowing for the flip-flop. A large current is applied to\ndrive more electrons to move from one domain to the next with spin flip, simultaneously making the\nrelevant nuclei flop. Because the nuclear polarization occurs only at or near the domain wall with respect\nto electron spin-flip, the distributions of the DNP sites are inhomogeneous. This inhomogeneity induces\nadditional domain disorder via the Overhauser shift,24 leading to an increase of Rxx due to extra dissipation\nbetween extended LL states. In contrast, the depolarization reduces the domain disorder and results in a\ndecrease of Rxx. Therefore, the RDNMR shows a dip in Rxx [Fig. 2(b)]. Note that the RDNMR signals at\nmost of the LL intersections around ν = 2 show a dip in Rxx, but exhibit a hump in Rxx at the LL\nintersections at θ = 53.2° (data not shown) and θ = 64.3° [Fig. 3(a)]. The spike after the DNP (called\npolarized spike) might shift relative to the original one (unpolarized spike) owing to the influence of the\nLL peak, with the result that Rxx in one flank of the polarized spike is smaller than that of the unpolarized\nspike, thereby accounting for the hump feature. The current dependence of |ΔRxx|/Rxx of\n\n115\n\nIn is shown in\n\nFig. 2(c), in which |ΔRxx|/Rxx appears at ~ 0.6 mA and increases with Isd but decreases at higher Isd as\nexpected from the current-induced heating effect. This result is indicative of a current-dependent DNP.\nThe regions with detectable RDNMR around ν = 2 were identified by dots in Fig. 2(a). Apparently,\nthe DNP always occurred around the resistance spike, indicating the domain structure crucial for DNP.\n\n5\n\n\fMore interestingly, the high-sensitivity RDNMR allowed us to probe the spike inside the LL peak and to\ndetermine the whole area of the ν = 2 QHF between θ = 53.2° and θ = 64.3°.\nFurther reducing the RF sweep rate enabled the observation of the quadrupole splittings (QSs) of\n115\n\nIn. A distinct QS spectrum was observed in the RDNMR signal taken from the spike inside the LL peak\n\n[Fig. 3(a)]. The fit in Fig. 3(a), as indicated by a solid line composed of nine nearly equally spaced\nGaussian curves (dashed line), was in good agreement with the data. These nine curves are responsible for\nresonant transitions among ten quadrupole levels of 115In with equal splitting intervals,25 as depicted in Fig.\n3(b). The splitting (ɷq/2π ~ 57 kHz) in Fig. 3(a) gives an estimate of the deformation tensor element ezz of\n~ 0.2% in the case of uniaxial strain along the growth direction,26 suggesting low strain at relevant DNP\nsites. This estimate also coincides with our expectation that the lattice mismatch in our InSb QW is small\n(~ 0.7%).\nThe developed RDNMR also enables the measurement of the nuclear spin relaxation time (T1) in the\nsimplest pseudospin QHF. The procedure for measuring T111,27 is shown in the inset of Fig. 4. Note that T1\nis not determined by the current-pumped DNP.28 T1 was found to be about 120 s and almost temperature\n(T) independent (Fig. 4). This T1 value was nearly the same as that of the QHF in a two-subband GaAs\n2DEG, where collective spin excitations in the domain wall account for the short T1.27 Furthermore, the\nT-independent T1 suggests that the nuclear spin relaxation is dominated by disordered spin-textured\nquasiparticles9,11. In future work, the T1 measurement of an InSb 2DEG with gate-controlled electron\ndensity is expected to elucidate the properties of the low-energy spin excitations in the simplest\npseudospin QHF.\nWe also performed the RDNMR measurement at other LL intersections. No RDNMR was observed\nat the LL intersections marked with circles in Fig. 1(b). This result further suggests the domain required\n\n6\n\n\ffor the DNP at the LL intersection. However, we found that not all LL intersections with this domain\nstructure favor DNP. RDNMR was not observed at the spikes around ν = 3 and ν = 4 [Fig. 1(b)]. It is\npossible that the partially polarized ground states (0, ↑), (1, ↑), (0, ↓)\n\nand (0, ↑), (1, ↑), (2, ↑), (0, ↓)\n\nof\n\nthe ν = 3 and ν = 4 QHFs, respectively, weaken electron spin flip, and accordingly smear out the DNP.\nMoreover, the DNP can be suppressed by the mobility of domains, which is expected to be different at\ndifferent LL intersections.29\nIn conclusion, we have successfully demonstrated DNP and RDNMR in a single InSb 2DEG.\nPseudospin domain structures have been shown to account for the DNP in the simplest pseudospin QHF\ncharacterized by a relatively short and temperature-independent T1. The obtained QSs of\n\n115\n\nIn are of\n\npractical importance for the coherent control of the ten nuclear-spin quantum levels and for the\nimplementation of multiple NMR-based quantum bits (¥ 2). Our results advance the understanding of\nDNP in semiconductors and the domain dynamics in the QHF, and pave the way for NMR studies\naddressing low-dimensional structures made of narrow-gap semiconductors.\nWe acknowledge helpful discussions with K. Hashimoto, N. Shibata, S. Watanabe, and K. Muraki.\nH.W.L. thanks the Program for New Century Excellent Talents of the University in China.\n\n7\n\n\f1\n\nI. Zutic, J. Fabian, and S. Das Sarma, Rev. Mod. Phys. 76, 323 (2004); Y. Hirayama, G. Yusa, K. Hashimoto,\n\nN. Kumada, T. Ota, and K. Muraki, Semicond. Sci. Technol. 24, 023001(2009).\n2\n\nM. Dobers, K. von Klitzing, J. Schneider, G. Weimann, and K. Ploog, Phys. Rev. Lett. 61, 1650 (1988).\n\n3\n\nG. P. Flinn, R. T. Harley, M. J. Snelling, A. C. Tropper, and T. M. Kerr, Semicond. Sci. Technol. 5, 533\n\n(1994); G. Salis, D. T. Fuchs, J. M. Kikkawa, D. D. Awschalom, Y. Ohno, and H. Ohno, Phys. Rev. Lett. 86,\n2677 (2001).\n4\n\nG. Yusa, K. Muraki, K. Takashina, K. Hashimoto, Y. Hirayama, Nature (London) 434, 1001(2005); H.\n\nTakahashi, M. Kawamura, S. Masubuchi, K. Hamaya, T. Machida, Y. Hashimoto, and S. Katsumoto, Appl.\nPhys. Lett. 91, 092120 (2007).\n5\n\nY. Kondo, M. Ono, S. Matsuzaka, K. Morita, H. Sanada, Y. Ohno, and H. Ohno, Phys. Rev. Lett. 101,\n\n207601 (2008).\n6\n\nS. Kronmüller, W. Dietsche, K. v. Klitzing, G. Denninger, W. Wegscheider, and M. Bichler, Phys. Rev. Lett.\n\n82, 4070 (1999); J. H. Smet, R. A. Deutschmann, F. Ertl, W. Wegscheider, G. Absteiter, and K. von Klitzing,\nNature 415, 281 (2002).\n7\n\nK. Hashimoto, K. Muraki, T. Saku, and Y. Hirayama, Phys. Rev. Lett. 88, 176601 (2002).\n\n8\n\nO. Stern, N. Freytag, A. Fay, W. Dietsche, J. H. Smet, K. von Klitzing, D. Schuh, and W. Wegscheider,\n\nPhys. Rev. B 70, 075318 (2004).\n9\n\nN. Kumada, K. Muraki, and Y. Hirayama, Science 313, 329 (2006).\n\n10\n\nL. A. Tracy, J. P. Eisenstein, L. N. Pfeiffer, and K. W. West, Phys. Rev. Lett. 98, 086801 (2007).\n\n11\n\nX. C. Zhang, G. D. Scott, and H. W. Jiang, Phys. Rev. Lett. 98, 246802 (2007).\n\n12\n\nN. Kumada, K. Muraki, and Y. Hirayama, Phys. Rev. Lett. 99, 076805 (2007).\n\n13\n\nJ. C. Chokomakoua, N. Goel, S. J. Chung, M. B. Santos, J. L. Hicks, M. B. Johnson, and S. Q. Murphy,\n\nPhys. Rev. B 69, 235315 (2004).\n8\n\n\f14\n\nR. J. Nicholas, R. J. Haug, K. von Klitzing, and G. Weimann, Phys. Rev. B 37, 1294 (1988).\n\n15\n\nT. Jungwirth and A. H. MacDonald, Phys. Rev. B 63, 035305 (2000).\n\n16\n\nE. P. De Poortere, E. Tutuc, S. J. Papadakis, and M. Shayegan, Science 290, 1546 (2000).\n\n17\n\nT. Jungwirth and A. H. MacDonald, Phys. Rev. Lett. 87, 216801 (2001).\n\n18\n\nTo calculate g* we measure m* = 0.016 me (where me is the free electron mass) by analyzing the\n\ntemperature-dependent amplitude of low-field SdH oscillations (so-called Dingle plot). The spin\nsusceptibility measurement enables the extraction of the product of m*g* in our InSb 2DEGs. Then, g* is\ngiven from 39 to 88 in magnitude, depending on the degree of spin polarization P = r/v [K. F. Yang, H. W.\nLiu, T. D. Mishima, M. B. Santos, K. Nagase, and Y. Hirayama, arXiv: 1006.3456 (2010), also see B.\nNedniyom, R. J. Nicholas, M. T. Emeny, L. Buckle, A. M. Gilbertson, P. D. Buckle, and T. Ashley, Phys. Rev.\nB 80, 125328 (2009)].\n19\n\n20\n\nL. Brey and C. Tejedor, Phys. Rev .B 66, 041308 (R) (2002).\nJ. Jaroszyński, T. Andrearczyk, G. Karczewski, J. Wrobel, T. Wojtowicz, E. Papis, E. Kaminska, A.\n\nPiotrowska, D. Popovic, and T. Dietl, Phys. Rev. Lett. 89, 266802 (2002); G. M. Gusev, A. A. Quivy, T. E.\nLamas, J. R. Leite, O. Estibals, J. C. Portal, Phys. Rev. B 67, 155313 (2003); K. Vakili, Y. P. Shkolnikov, E.\nTutuc, N. C. Bishop, E. P. De Poortere, and M. Shayegan, Phys. Rev. Lett. 94, 176402 (2005); M.V. Yakunin,\nS. M. Podgornykh, N. N. Mikhailov, and S. A. Dvoretsky, Physica E 42, 948 (2010).\n21\n\nSee supplementary material at http://link.aps.org/supplemental/10.1103/PhysRevB.82.241304 for text and\n\nfigures.\n22\n\nW. G. Clark and G. Feher, Phys. Rev. Lett. 10, 134 (1963).\n\n23\n\nM. Gueron, Phys. Rev. 135, A200 (1964).\n\n24\n\nA. W. Overhauser, Phys. Rev. 89, 689 (1953).\n\n25\n\nR. K. Sundfors, Phys. Rev. 185, 458 (1969).\n9\n\n\f26\n\nR. I. Dzhioev and V. L. Korenev, Phys. Rev. Lett. 99, R037401 (2007).\n\n27\n\nG. P. Guo, X, J. Hao, T. Tu, Y. J. Zhao, Z. R. Lin, G. Gao, H. O. Li, C. Zhou, G. C. Guo, and H. W. Jiang,\n\nPhys. Rev. B 81, 041306 (R) (2010).\n28\n\nWe confirmed that T1 did not depend on DNP by the following experiment. As DNP became saturated\n\n[inset, Fig. 2(b)], the current was turned off over a certain time (τ) and then switched on to measure Rxx\nimmediately. By repeating this process in different time periods, we obtained the plot of Rxx vs.τ, from which\nT1 was determined. T1 measured in this way was comparable to that in the inset of Fig. 4.\n29\n\nY. Hirayama, K. Muraki, K. Hashimoto, K. Takashina, T. Saku, Physica E 20, 133 (2003); T. Jungwirth, S.\n\nP. Shukla, L. Smrcka, M. Shayegan, and A. H. MacDonald, Phys. Rev. Lett. 81, 2328 (1998).\n\n10\n\n\fFIG. 1 (color online). (a) Diagram of the Landau levels in the 2DEG, showing the intersection of\nspin-down (σ = ↓) and spin-up (σ = ↑) levels with different orbital numbers (n) as 1/cosθ [where θ is the\ntilt angle, inset of (b)] increases, but keeping the perpendicular field B^ (or cyclotron energy hωc )\nconstant. The level intersection occurs at integer r (= hωs / hωc , hωs is the Zeeman energy). Integers inside\nthe diagram denote the filling factor ν. (b) Peak positions (dots) of Rxx vs. B^ (or ν) and 1/cosθ (or θ) at Isd\n= 3 nA and T = 200 mK. The circle guides the LL intersection with a coalescence of Rxx minima and the\nsolid line marks the resistance spike of QHF (see text). In contrast to (a), the unevenly spaced LLs were\ncaused by the change of B^. The dashed lines indicate the LL intersections at the same integer r. As B^\nincreases, g* is enhanced,18 moving the LL intersection to small θ (or 1/cosθ) for fixed r. Inset: Setup of\nour tilted-field experiments. θ was determined from the Hall resistance.\nFIG. 2. (a) Rxx vs. B^ at several angles [raw data around ν = 2 in Fig. 1(b)]. The curves are offset for clarity.\nThe arrows point out the distinguishable resistance spikes in the magnetotransport measurement. We also\nsuperimposed the data (dots) obtained from the RDNMR measurement, which pointed out the DNP region\naround ν = 2. The dot diameter denotes the ratio between the DNP-induced resistance change ΔRxx [(b)] in\nterms of the absolute value (|ΔRxx|) and Rxx of\n\n115\n\nIn. (b) RDNMR signal of\n\n115\n\nIn at an RF sweep rate of 60\n\nkHz/min and T = 100 mK. The data were obtained from the spike at θ = 59.5° in (a). The RDNMR\nmeasurement was initiated by sweeping Btot to 7 T (B^ = 3.55 T) at Isd = 3 nA. Then, a large current of 1.4 mA\nwas applied and time dependent Rxx was obtained (inset). The RF field was set to illuminate the 2DEG after\nRxx became saturated. (c) |ΔRxx|/Rxx in (b) vs. Isd.\nFIG. 3 (color online). (a) RDNMR signal of 115In at a slow RF sweep rate of 3 kHz/min and T = 100 mK. The\ndata was obtained from the spike inside the LL peak at θ = 64.3° in Fig. 2(a). The solid line is a fit with nine\nGaussian curves (dashed line). (b) Energy diagram of the ten nuclear spin states |m> of 115In (I = 9/2) in the\n\n11\n\n\fpresence of electric quadrupole coupling. ɷ0 and ɷq are the Zeeman and quadrupole frequencies,\nrespectively.\nFIG. 4 (color online). Temperature (T)-dependent T1 of\n\n115\n\nIn. As Rxx became saturated [inset, Fig. 2(b)], the\n\nRF frequency was tuned to fNMR = 65.42 MHz (on resonance). Rxx decreased due to the nuclear\ndepolarization and then reached a steady state (inset). After that, f moved away from fNMR (off resonance)\nand Rxx decayed to the original value. The time (t) dependent Rxx at off-resonance followed Rxx ∝ e-t/T1, from\nwhich T1 was determined. Note that the T1 measurement was independent of the current amplitude (Fig. S4\nof Ref. 21).\n\n12\n\n\fFIG.1\n\n13\n\n\fFIG. 2\n\n14\n\n\fFIG. 3\n\n15\n\n\fFIG. 4\n\n16\n\n\f"}