{"id": "http://arxiv.org/abs/0910.1262v1", "guidislink": true, "updated": "2009-10-07T14:02:01Z", "updated_parsed": [2009, 10, 7, 14, 2, 1, 2, 280, 0], "published": "2009-10-07T14:02:01Z", "published_parsed": [2009, 10, 7, 14, 2, 1, 2, 280, 0], "title": "The Dark Side of the Electroweak Phase Transition", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0910.1192%2C0910.5153%2C0910.4032%2C0910.0082%2C0910.0689%2C0910.3593%2C0910.5035%2C0910.1923%2C0910.4043%2C0910.0499%2C0910.4679%2C0910.2378%2C0910.2260%2C0910.2894%2C0910.0099%2C0910.0491%2C0910.1833%2C0910.2743%2C0910.3093%2C0910.4937%2C0910.5541%2C0910.2721%2C0910.0403%2C0910.5658%2C0910.0556%2C0910.5639%2C0910.5070%2C0910.5893%2C0910.2540%2C0910.2953%2C0910.1671%2C0910.1509%2C0910.4210%2C0910.5775%2C0910.3216%2C0910.3513%2C0910.5912%2C0910.2915%2C0910.0867%2C0910.0463%2C0910.4532%2C0910.3191%2C0910.2041%2C0910.0008%2C0910.0810%2C0910.3834%2C0910.0691%2C0910.2034%2C0910.0432%2C0910.1887%2C0910.0803%2C0910.1595%2C0910.5228%2C0910.0931%2C0910.2859%2C0910.2818%2C0910.1262%2C0910.4786%2C0910.2522%2C0910.1819%2C0910.1859%2C0910.1017%2C0910.0409%2C0910.5578%2C0910.2498%2C0910.5635%2C0910.2239%2C0910.5117%2C0910.4821%2C0910.2870%2C0910.1295%2C0910.1489%2C0910.4930%2C0910.0612%2C0910.4263%2C0910.2301%2C0910.4512%2C0910.5523%2C0910.3619%2C0910.3360%2C0910.2703%2C0910.5920%2C0910.4525%2C0910.2612%2C0910.0299%2C0910.0001%2C0910.1415%2C0910.5555%2C0910.5582%2C0910.4455%2C0910.5048%2C0910.2276%2C0910.4605%2C0910.3595%2C0910.4499%2C0910.3015%2C0910.4034%2C0910.4084%2C0910.2998%2C0910.2421%2C0910.5545&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "The Dark Side of the Electroweak Phase Transition"}, "summary": "Recent data from cosmic ray experiments may be explained by a new GeV scale\nof physics. In addition the fine-tuning of supersymmetric models may be\nalleviated by new O(GeV) states into which the Higgs boson could decay. The\npresence of these new, light states can affect early universe cosmology. We\nexplore the consequences of a light (~ GeV) scalar on the electroweak phase\ntransition. We find that trilinear interactions between the light state and the\nHiggs can allow a first order electroweak phase transition and a Higgs mass\nconsistent with experimental bounds, which may allow electroweak baryogenesis\nto explain the cosmological baryon asymmetry. We show, within the context of a\nspecific supersymmetric model, how the physics responsible for the first order\nphase transition may also be responsible for the recent cosmic ray excesses of\nPAMELA, FERMI etc. We consider the production of gravity waves from this\ntransition and the possible detectability at LISA and BBO.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0910.1192%2C0910.5153%2C0910.4032%2C0910.0082%2C0910.0689%2C0910.3593%2C0910.5035%2C0910.1923%2C0910.4043%2C0910.0499%2C0910.4679%2C0910.2378%2C0910.2260%2C0910.2894%2C0910.0099%2C0910.0491%2C0910.1833%2C0910.2743%2C0910.3093%2C0910.4937%2C0910.5541%2C0910.2721%2C0910.0403%2C0910.5658%2C0910.0556%2C0910.5639%2C0910.5070%2C0910.5893%2C0910.2540%2C0910.2953%2C0910.1671%2C0910.1509%2C0910.4210%2C0910.5775%2C0910.3216%2C0910.3513%2C0910.5912%2C0910.2915%2C0910.0867%2C0910.0463%2C0910.4532%2C0910.3191%2C0910.2041%2C0910.0008%2C0910.0810%2C0910.3834%2C0910.0691%2C0910.2034%2C0910.0432%2C0910.1887%2C0910.0803%2C0910.1595%2C0910.5228%2C0910.0931%2C0910.2859%2C0910.2818%2C0910.1262%2C0910.4786%2C0910.2522%2C0910.1819%2C0910.1859%2C0910.1017%2C0910.0409%2C0910.5578%2C0910.2498%2C0910.5635%2C0910.2239%2C0910.5117%2C0910.4821%2C0910.2870%2C0910.1295%2C0910.1489%2C0910.4930%2C0910.0612%2C0910.4263%2C0910.2301%2C0910.4512%2C0910.5523%2C0910.3619%2C0910.3360%2C0910.2703%2C0910.5920%2C0910.4525%2C0910.2612%2C0910.0299%2C0910.0001%2C0910.1415%2C0910.5555%2C0910.5582%2C0910.4455%2C0910.5048%2C0910.2276%2C0910.4605%2C0910.3595%2C0910.4499%2C0910.3015%2C0910.4034%2C0910.4084%2C0910.2998%2C0910.2421%2C0910.5545&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Recent data from cosmic ray experiments may be explained by a new GeV scale\nof physics. In addition the fine-tuning of supersymmetric models may be\nalleviated by new O(GeV) states into which the Higgs boson could decay. The\npresence of these new, light states can affect early universe cosmology. We\nexplore the consequences of a light (~ GeV) scalar on the electroweak phase\ntransition. We find that trilinear interactions between the light state and the\nHiggs can allow a first order electroweak phase transition and a Higgs mass\nconsistent with experimental bounds, which may allow electroweak baryogenesis\nto explain the cosmological baryon asymmetry. We show, within the context of a\nspecific supersymmetric model, how the physics responsible for the first order\nphase transition may also be responsible for the recent cosmic ray excesses of\nPAMELA, FERMI etc. We consider the production of gravity waves from this\ntransition and the possible detectability at LISA and BBO."}, "authors": ["Subinoy Das", "Patrick J. Fox", "Abhishek Kumar", "Neal Weiner"], "author_detail": {"name": "Neal Weiner"}, "author": "Neal Weiner", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1007/JHEP11(2010)108", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/0910.1262v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0910.1262v1", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "hep-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "hep-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0910.1262v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0910.1262v1", "arxiv_comment": null, "journal_reference": "JHEP 1011:108,2010", "doi": "10.1007/JHEP11(2010)108", "fulltext": "FERMILAB-PUB-09-090-T\n\nThe Dark Side of the Electroweak Phase Transition\nSubinoy Das,1 Patrick J. Fox,2 Abhishek Kumar,3 and Neal Weiner3\n1\n\nDepartment of Physics and Astronomy,\n\nUniversity Of British Columbia, BC, V6T 1Z1 Canada\n2\n\nTheoretical Physics Department, Fermilab, Batavia, IL 60510, USA\n\narXiv:0910.1262v1 [hep-ph] 7 Oct 2009\n\n3\n\nCenter for Cosmology and Particle Physics,\n\nDept. of Physics, New York University, New York, NY 10003\n(Dated: November 11, 2018)\n\nAbstract\nRecent data from cosmic ray experiments may be explained by a new GeV scale of physics.\nIn addition the fine-tuning of supersymmetric models may be alleviated by new O(GeV) states\ninto which the Higgs boson could decay. The presence of these new, light states can affect early\nuniverse cosmology. We explore the consequences of a light (∼ GeV) scalar on the electroweak\nphase transition. We find that trilinear interactions between the light state and the Higgs can allow\na first order electroweak phase transition and a Higgs mass consistent with experimental bounds,\nwhich may allow electroweak baryogenesis to explain the cosmological baryon asymmetry. We\nshow, within the context of a specific supersymmetric model, how the physics responsible for the\nfirst order phase transition may also be responsible for the recent cosmic ray excesses of PAMELA,\nFERMI etc. We consider the production of gravity waves from this transition and the possible\ndetectability at LISA and BBO.\n\n1\n\n\fI.\n\nINTRODUCTION\n\nThe central unresolved question of high energy physics is the nature of electroweak symmetry breaking. Many issues are raised by this: what stabilizes the weak scale against\nradiative corrections? Is there a fundamental Higgs or is it composite, or is the symmetry\nbreaking due to strong dynamics?\nThe nature of the electroweak phase transition may be particularly important for our\nuniverse. If the electroweak phase transition is first order, it provides one of the essential\nconditions for baryogenesis [1, 2]. The transition must be strongly first order to prevent\nwashout of the generated baryon number by sphalerons in thermal equilibrium. Within the\nstandard model [66] achieving sufficient strength requires a Higgs lighter than ∼ 42 GeV,\nstrongly excluded by existing LEP2 Higgs searches [3, 4].\nHowever, in moving beyond the standard model, there is again the possibility of a first\norder electroweak phase transition. For instance, in supersymmetric theories, couplings to\nthe top squark [3] can allow a larger thermal cubic term in the potential, to compensate\nfor the larger quartic associated with the Higgs mass. In the NMSSM, the presence of an\nadditional singlet can provide a first order phase transition [5]. Similar physics can arise\nwithin the context of the singlet Majoron model for neutrino masses [6]. The presence of\neffective dimension six Higgs operators, generated when heavy states are integrated out, also\nincrease the strength of the phase transition [7].\nTo generate a first order phase transition, there must be new physics at or below the\nweak scale. Because of the hierarchy problem, new fields are naturally expected at O(MW ).\nMore recently, however, there have been possible indications of new physics at the ∼ GeV\nscale. Evidence for an excess of cosmic ray positrons from PAMELA [8], coupled with the\nabsence of anti-protons [9], as well as possible signals at ATIC [10], PPB-BETS [11] and\nWMAP [12, 13, 14] provide a motivation for a new, light scale of physics [15]. The large cross\nsection necessary to explain the excess can be understood from a Sommerfeld enhancement\nfrom some new, light force carrier [15, 16][67], while the hard lepton spectrum (without\nanti-protons) can be realized from the new mediator [17, 18][68]. Finally, the INTEGRAL\n511 keV excess can be explained in the XDM scenario [19], which postulates the existence\nof a sub-GeV force carrier. While such a scale is unnatural in the standard model, it can\narise naturally, for instance, in supersymmetric theories [20, 21].\n2\n\n\fMoreover, theories with additional standard model singlets can allow a Higgs lighter\nthan the present LEP bound of 114.4 GeV [22, 23, 24, 25, 26, 27, 28]. This occurs when\nneutral particles much lighter than the Higgs open up additional decay modes, which are\nless constrained than for a standard model Higgs. In particular, the new states must be\nsufficiently light that they do not decay into b-quarks, for which the bounds are stronger,\nmotivating again masses in the few GeV range or lower. Finally, some have suggested that\nthe excess of multi-muon events at CDF [29] might be explained by new, light states with\nmasses 3.6, 7.3 and 15 GeV [30].\nIn this paper, we consider the effects of a light scalar on the electroweak phase transition.\nWe consider in some senses a \"minimal\" model, with simply a trilinear interaction between\nthe Higgs boson and the singlet s. As a consequence, when the Higgs acquires a vev,\nthere is a mixing between the states allowing the lighter to be constrained from Higgsstrahlung searches at LEP. We find there are regions of parameter space consistent with these\nLEP limits which generate the strong first order phase transition necessary for electroweak\nbaryogenesis. All regions have ms <\n∼ 12GeV. This study is distinct from and complementary\nto that of the parameter scan of [31], where no viable models were found with states below\n12 GeV. It adds to the analysis of the Majoron model for neutrino masses of [6] in that we\nare not tied to connections to neutrino mass, and we can consider scalars lighter than 5 GeV\nbecause of a broader particle content.\nModels with simply a trilinear interaction between the Higgs and the singlet occur in\ncertain scenarios of supersymmetry breaking [32, 33]. Furthermore, if such models are\nextended to include dark matter (DM) the singlet may not only generate a strong electroweak\nphase transition but can also lead to a low velocity enhancement in the DM-DM annihilation\ncross section that may explain recent cosmic-ray anomalies.\nThe layout of this paper is as follows: in the next section, we explain, simply, why a\nsinglet with a trilinear gives rise to a strong first order phase transition, and study the\neffects on the sphaleron energy in the case when it is weakly mixed, as well as discussing\nLEP experimental constraints. In section III we consider a supersymmetric realization of\nthis model. In section IV we consider the nucleation of bubbles in these scenarios and find\nthe amplitude of the GW signal is probably too small to be detected in upcoming gravity\nwave experiments. Finally, in section V we conclude.\n\n3\n\n\fII.\n\nA FIRST ORDER PHASE TRANSITION FROM A NEW LIGHT BOSON\n\nWe consider the standard model (SM) Higgs, φ, coupled to a light neutral singlet scalar,\ns. At zero temperature the potential is\nλ\n1\nV = −DT02 φ2 + φ4 + m2s s2 + κ φ2 s .\n4\n2\n\n(1)\n\nThe parameters in the potential can be re-expressed in terms of the physical masses (mH ,\nmS ), mixing angle and vev (v = 246 GeV) as:\nm2H m2S\n, m2s\n4(m2S c2θ +m2H s2θ )\n\nDT02 =\nλ\n\n=\n\n= m2S c2θ + m2H s2θ\n\nm2H c2θ +m2S s2θ\n,κ\n2v2\n\n=\n\n(m2H − m2S )s2θ\n.\n4v\n\n(2)\n\nAt finite temperature, for a light Higgs, this receives corrections:\nV =\n\nD(T 2 − T02 )φ2 − ET φ3 +\n\nλT 4\nφ\n4\n\n1\nκ\n+ m2s s2 + κ φ2 s + T 2 s ,\n2\n12\nwith E =\n\n1\n(2m3W\n4πv3\n\n+ m3Z ) ≈ 10−2 , D =\n\n1\n(2m2W\n8v2\n\n(3)\n\n+ m2Z + 2m2t ) ≈ 1/6, λT is logarithmically\n\nsensitive to T [34, 35]. Since we will be interested in the case of small mixing (κ ≪ 1)\nwe have dropped terms higher order in κ. This leads to a first order phase transition at a\ncritical temperature,\nTc = s\n\nT0\n1−\n\n2\n«\n„ E\n2\nD λT −2 κ 2\n\n.\n−\n\n(4)\n\nκ2\n12m2s D\n\nms\n\nThe scalar vevs at the second minimum are\n2ETc\nφc =\n,\nκ2\nλ − 2m\n2\ns\n\nκ\nsc = − 2\nms\n\n\u0012\n\u0013\nTc2\n2\nφc +\n.\n12\n\n(5)\n\nThe presence of the light scalar alters both the critical temperature and the Higgs vev. As\nwe will see in the next subsection, when discussing the strength of the phase transition in\nthis model, the figure of merit is φc /Tc just as it is in the SM. The trilinear coupling increases\nthis ratio, making the phase transition stronger. It is also possible in this model to greatly\nlower the temperature of the phase transition. In a particular region of parameter space\nthe potential is such that the critical temperature is considerably lower than the symmetry\nbreaking scale (Figure 1), the phase transition takes place at late times. This is significantly\n4\n\n\f0.5\n0.4\n0.3\n\nsin θ\n0.2\n\n25 GeV\n30 GeV\n\n0.1\n\n40 GeV\n50 GeV\n\n0\n\n0\n\n2\n\n4\n\n6\n\n8\n\nmS\n\n10\n\n12\n\n14\n\nFIG. 1: The critical temperature of the phase transition, for mH = 115 GeV, there is little\ndependence on mH . From the right the lines correspond to Tc = 50 GeV (solid), 40 GeV (dashes),\n30 GeV (short dashes), 25 GeV (dot-dashed) respectively. At the boundary on the left the critical\ntemperature grows rapidly. Here the transition becomes a second order phase transition, the\nminimum near the origin is never the true minimum of the potential.\n\nlower than what occurs in the SM. Such a late phase transition opens the possibility, if the\nDark Matter (DM) is coupled to the scalar sector, of appreciably changing the properties of\nDM between the early universe and today [36].\nThe critical temperature is shown in Figure 1, for physical Higgs mass, mH = 115 GeV.\nFor a given singlet mass there is a maximum value of the mixing angle, beyond which there\nis no first order phase transition. For mixing angles larger than this maximum the coupling\nbetween φ and s is large enough that the negative s-vev (5), which scales with T 2 , destabilizes\nthe origin and the true minimum is always the symmetry breaking minimum away from the\norigin. Symmetry is not restored at high temperature [37, 38].\nNote that the increase in the strength of the phase transition is a tree-level effect that\nappears in the denominator, due to the (cubic) mixing term κ in the Lagrangian. Since it is\ntree level the effect is potentially large. Alternative approaches to increasing the strength of\nthe phase transition [31] often rely upon loop generated contributions to the terms appearing\nin the numerator, e.g. stop loops increasing E. At the same time, this is distinct from\ntree-level effects of higher dimension operators [7]. If one considers the decoupling limit\n(ms ≫ mh ) of this model, while keeping the first order phase transition intact with a\n\n5\n\n\fconstant κ2 /m2s , one finds the first order nature arises because decoupling the singlet simply\nsuppressed the Higgs quartic directly. That is, the decoupling limit of this model, rather\nthan yielding important higher dimension operators, merely yields a theory with a light\nHiggs boson, which generates a first order phase transition simply due to the light Higgs.\nIt is only because the singlet is light that we have a consistent phenomenology of both the\nO(100) GeV Higgs boson and the first order phase transition simultaneously.\n\nA.\n\nEffects on sphaleron energy\n\nIn the SM B − L is a good symmetry whereas B + L is anomalous. The breaking of\nB + L is mediated by the sphaleron field configuration and the sphaleron energy [39] is\n\u0010 \u0011\n)\nλ\nEsph = 4πv(T\nB\nwhere B(x) is a numerical factor varying between B(0) ≈ 1.6 and\ng2\ng2\n\nB(∞) ≈ 2.7.\n\nAt finite temperature this field configuration may be formed by a thermal fluctuation.\nThe sphaleron has size Rsph ∼ 1/MW , far larger than its Compton wavelength, and contains\nO(1/αW ) fields so its probability of production is given by the classical thermal Boltzman\ndistribution, Γ ∼ e−Esph (T )/T . The requirement that the net B + L charge is not washed out\nleads to a constraint on the order of the phase transition, Esph /T >\n∼ 40. Using knowledge of\n\u0010 \u0011\nB gλ2 this becomes\nv(T )\n>1.\n(6)\nT ∼\nThis is the famous statement that the phase transition must be strongly first order. Including\nan extra singlet coupled to the Higgs will alter the sphaleron energy and hence the constraint,\nwhich we now discuss.\nWe take an ansatz for the gauge fields and scalar fields of,\n \n0\n2i\nWia σ a = − f (ξ)dU U −1 , φ = √v2 h(ξ)U   , s = xs(ξ)\ng2\n1\n\nwhere\n\nU=\n\n\n\n\n\nx + iy\n1 z\n\nr −x + iy\nz\n\n(7)\n\n(8)\n\nWhere the asymptotic form of the profiles are\n\nf (ξ → 0) = f0 ξ 2 , h(ξ → 0) = h0 ξ, s(ξ → 0) = s0\nf (ξ → ∞) = 1,\n\nh(ξ → ∞) = 1,\n6\n\ns(ξ → ∞) = 1\n\n(9)\n\n\f0.6\n0.8\n1.0\n\n0.5\n\n0.4\n\n0.3\n\nsin θ\n\n0.2\n\n0.1\n0\n\n2\n\n4\n\n6\n\n8\n\n10\n\n12\n\n14\n\nmS\nFIG. 2: Sphaleron energy for mH = 115 GeV, again there is only weak dependence on Higgs mass.\nFrom the top the contours correspond to Esph / (4πv/g) = 1.82, 1.84, 1.86, 1.88 respectively. In\nthe SM, Esph / (4πv/g) ≈ 1.9.\n\nTo solve for the field profiles, and hence calculate the sphaleron energy in this model [69],\nwe use a shooting technique. Initial guesses are made for the profiles at small and large\nradii, consistent with (9). These are then evolved up and down respectively and compared\nat some intermediate radius. A solution is found by varying the boundary conditions and\nminimising the difference between the upper and lower solutions at the intermediate point.\nThe resulting sphaleron energy is shown in Figure 2. The addition of the singlet does not\nappreciably change the energy of the sphaleron configuration and so the constraint on the\norder of the phase transition is not greatly altered. This is easily understood: the light scalar\nvaries on scales larger than the size of the sphaleron so the Higgs profile acts like a delta\nfunction source to the singlet, and causes it to turn on. Since the singlet profile is slowly\nvarying on the length associated with the Higgs profile it may be approximated as a constant\n\u00012\nvev. Its only effect is to shift the mass of the Higgs from its SM value, m2φ = mSM\n+ 2κx.\nH\n\nSince the sphaleron energy has a weak dependence on the Higgs mass [39] the addition of a\nlight singlet does not greatly alter the requirement of (6).\n\nB.\n\nA strongly first order phase transition and experimental constraints\n\nThe mixing between the singlet and the Higgs, due to κ, means that both mass eigenstates\nhave couplings to Z and so have strong constraints from LEP Higgsstrahlung processes [4,\n7\n\n\f0.5\n\n0.5\n\nα > 0.5\n\n0.4 NPT\n\n0.4 NPT\n\nLEP\nDisallowed\n\n0.3\n\nsin θ\n\n0.2\n\n0.2\n\nLEP\nAllowed\nNot Strong\n\n0.1\n\nmH = 115 GeV\n\nLEP\nDisallowed\n\n0.3\n\nsin θ\n\nmH = 90 GeV\n\nα > 0.5\n\n0\n\n2\n\n4\n\n6\n\n8\n\nmS\n\n10\n\nNot Strong\n\n0.1\n\nmH = 90 GeV\n0\n\nLEP\nAllowed\n\n12\n\n14\n\nmH = 115 GeV\n\n0\n\n0\n\n2\n\n4\n\n6\n\n8\n\n10\n\n12\n\n14\n\nmS\n\nFIG. 3: For mH = 90 GeV (left) and mH = 115 GeV (right) we plot the region allowed by LEP\nconstraints and the requirement of a strong enough first order phase transition. The dark green\n(larger) region assumes the singlet decays to jets or τ 's and so applies the strongest LEP bound\nwhereas the light green (smaller) region assumes the singlet decays some other way and applies\nonly the model independent bound. NPT denotes that for these parameters there is no phase\ntransition, and the red (diagonal) band is the region where the latent heat released during the\nphase transition is sizeable.\n\n40]. The same coupling is also responsible for the decays of the mostly-singlet eigenstate.\nThus, for a singlet mass above approximately 12 GeV the dominant decay will be to bb̄ while\nbelow this threshold it will decay mainly to cc̄ with a smaller branching ratio to τ + τ − . There\nis the additional possibility that the singlet may have other couplings that do not affect the\nHiggs, and the discussion so far, but do alter the decays of s in such a way that neither of\nthe above bounds apply. In this case the model independent [40] Higgs bound applies; note\nthis bound only applies for states lighter than 82 GeV. Taking these bounds into account\nand requiring that (5) leads to a sufficiently strong phase transition, satisfying (6), we find\nthe allowed regions of parameter space. These are shown in Figure 3 for physical Higgs\nmasses above and below the LEP bound.\nThe mostly-Higgs mass eigenstate has a new decay mode, into 2s, which raises the intriguing possibility that the Higgs may have evaded the LEP bound [27]. To allow for a\nHiggs much lighter than 114.4 GeV the branching ratio to b quarks must be greatly suppressed, for this reason we concentrate on a singlet lighter than 12 GeV. Such a scenario\nof a strongly first order phase transition with a light singlet emerges in a model defined by\n8\n\n\f(1). While the potential in (1) does not yield an 80% BR of h → ss, which is needed to\nappreciably lower the LEP limit on the Higgs mass, a small additional s2 h† h operator would\nachieve this [27].\nIn the simplest model we have considered, there is a considerable bound for ms <\n∼ 5 GeV\nfrom B → Xs decays, where s → μ+ μ− [41, 42, 43, 44]. Indeed, the light region where\nα is large enough that a gravity wave signal is possible, would seem to be excluded. As\nwe shall see momentarily, in general there is both a scalar (s) and pseudoscalar (a) added\nto the theory. While the scalar mixes with the Higgs, the pseudoscalar can easily remain\nlight, offering a new decay channel, which can dominate over the Yukawa-suppressed decays\nwithout much difficulty. In this case, we have s → aa, with a → μμ or a → ee, which are\nfar more weakly constrained.\n\nIII.\n\nCONNECTING TO THE DARK SECTOR\n\nIn addition to having renormalizable couplings to the SM Higgs a singlet such as s may\nhave relevant couplings to new fields that are neutral under the SM. If the new fields carry a\nconserved charge then they are stable and act as DM. This is appealing since recent excesses\nin cosmic ray measurements [8, 9, 12, 13, 14, 45] can be explained by a DM annihilating\npredominantly to leptonic final states. The results suggest a DM mass of >\n∼ O(1TeV) and\nan annihilation cross section substantially larger than that expected from WIMP freeze out.\nThis enhancement of the annihilation cross section can be understood from a Sommerfeld\nenhancement from some new, light force carrier [15, 16][70], while the hard lepton spectrum\n(without anti-protons) can be realized from the new mediator [17, 18]. This mediator is\ntypically taken to be a vector but here the light scalar fills this role. Indeed, our model will\nbe very similar in phenomenology to that of [46], in that the natural annihilation channel is\nχχ → as.\nHowever, a light scalar coupled to a massive field will not remain light under quantum\ncorrections, unless there is a symmetry protecting its mass. If the DM sector is highly\nsupersymmetric then, as we will show, the scalar mass remains small. In supersymmetry the\ncoupling between the singlet and the Higgs may be generated from NMSSM type couplings\nsuch as SHu Hd in the superpotential. Generically, since supersymmetry is broken in our\nsector, this will lead to a large mass for the scalar. Instead we couple to the scalar using\n9\n\n\fthe \"supersoft\" operators\n\nR\n\nd2 θ Wα′ W α S and\n\nR\n\nd2 θWα′ W ′α S 2 [32, 33] which generate masses\n\nfor the scalars, as well as a Dirac mass between the singlino s̃ and the bino B̃, but do not\ngenerate large scalar masses through radiative effects once supersymmetry is broken. Here\nW ′ = θ2 D ′ is a spurion for SUSY breaking. Such supersoft operators also generate the\nHiggs-singlet coupling necessary to raise the strength of the electroweak phase transition.\nIncluding the DM mass term, the relevant part of the superpotential is,\nW = M χχ + λSχχ +\n\nκ̃\nκ ′ α\nWα W S + 2 Wα′ W ′α S 2 + h.c.\nM\nM\n\n(10)\n\nThe κ term generates the singlet-Higgs coupling term of (1), as well as a Dirac mass between\nthe singlino s̃ and the bino B̃. Both κ and κ̃ terms lead to scalar mass terms; κ generates\na mass for Re(s), naturally of the same size as the singlet-Higgs coupling, and κ̃ splits the\nscalar and psuedoscalar masses. The coupling of the DM to the singlet is responsible for the\nDM annihilation and the cross section is given by,\n\u0012 \u00134 \u0012\n\u00132\n|λ|\n1000 GeV\nhσann vi ∼\n6 × 10−26 cm3 s−1 .\n0.5\nMχ\n\n(11)\n\nThe correct relic abundance is achieved if |λ| ∼ 1/2.\n\nWe assume that in the MSSM sector there are additional sources of SUSY breaking\nwhich generate, amongst others, a Majorana mass term for the U(1) gaugino, but that these\nsources of SUSY breaking are not coupled to the dark sector. This arrangement, where the\ndark sector feels one source of supersymmetry breaking (supersoft breaking) and the MSSM\nexperiences another (F-term breaking) can occur through sequestering. If the MSSM is\nconstrained to lie on the same brane as the source of supersymmetry breaking and the dark\nsector lives on a separate brane with the U(1)′ that acquires a D-term propagating in the\nbulk then the only source of supersymmetry breaking felt by the dark sector would come\nthrough supersoft operators [47].\nIn general the parameters in (10) are complex, but by rephasing of the fields we may\nwork in a basis where the Majorana gaugino mass term, the dark matter mass M, and κ\nare real. This has the advantage that it does not alter the discussion of previous sections.\nThe remaining phases, in λ and κ̃, make the singlet scalar mass eigenstates an admixture\nof the scalar and psuedoscalar and the state that couples to the DM is no longer the same\ncombination that couples to the Higgs.\nThe light scalars mix with the Higgs and thus have couplings to SM fermions which\nare essential to enable these states to decay before BBN. If these scalars also have sizable\n10\n\n\fcoupling to the DM, as is needed for a large Sommerfeld enhancement to the annihilation\ncross section, then one would expect a large DM-nucleon effective coupling and an observable\nrate for DM-nuclear recoils. For mixings of the size discussed earlier, sin θ ∼ O(0.1), the\n−3\nDM-scalar coupling must be <\n∼ 10 . However, the phases of the parameters in (10) can\nbe chosen such that this occurs and the decay rates, and annihilation rates, are large but\n\nthe scattering cross section of DM off nuclei are small, thus evading current direct detection\nlimits. This can happen, for instance, if the CP symmetries in the SM and dark sectors\nare not aligned, the necessary smallness of the DM-scalar coupling is achieved if the two\nsymmetries are almost anti-aligned. The chiral superfield S contains a complex scalar, s+ia,\nand with the couplings κ̃ and λ such that one is almost purely real and one is almost purely\nimaginary, the CP-even eigenstate in the dark sector will be orthogonal to the CP-even\neigenstate in the SM sector. Thus, the state that has large mixing with the Higgs, s, will\nnot have a large coupling to the DM, and instead a, which has small mixing with the Higgs,\nis responsible for the Sommerfeld enhancement. It would be interesting to arrange for this\nto occur dynamically.\nThe singlino-bino system contains one light state, comparable to the singlet mass, which\nis mostly singlino with a small admixture θ ∼ κD ′ /(MMB̃ ) of bino. In models with high\nscale supersymmetry breaking this would be the visible sector LSP and would result in too\nmuch DM and overclosure of the universe. In models of low scale supersymmetry breaking\nwith a light gravitino the singlino will decay, long before BBN, to a gravitino and a scalar\nsinglet. The scalar superpartners of the DM are also stable since they are charged under the\nDM-parity. For the case of low scale breaking of supersymmetry they will also decay down\nto the DM through emission of a gravitino.\nAt freeze-out the annihilation cross section of the DM is given by (11). Under the\nassumption that dark matter is the fermionic component of χ, the dominant annihilation is\nχχ → sa. For ms > 5GeV, we can have s → hadrons, while for lighter s, we assume s → aa,\nin order to evade B-meson decay limits. The pseudoscalar will decay through its CP-violating\nmixing a → f f ̄. At late-times, and low velocities, this annihilation may be enhanced by\na DM-DM attractive potential induced by the exchange of the light scalar singlets, such a\n2\nSommerfeld enhancement requires mS <\n∼ λ Mχ /4π. Amazingly these requirements coming\nfrom the dark sector are compatible with the requirement of a first order phase transition\n\nand are consistent with LEP constraints. Thus, the sector responsible for the FOPT can\n11\n\n\feasily be the \"new force\" needed for Sommerfeld models, and in particular for models along\nthe lines of [46].\n\nIV.\n\nBUBBLE NUCLEATION\n\nFirst-order phase transitions proceed via nucleation of bubbles of the broken phase within\nthe symmetric phase. The subsequent collisions of bubbles and the interactions of the bubble\nwalls with the surrounding plasma are a source of gravitational radiation. In this section,\nwe study the possibility of gravity wave detection, by future experiments such as LISA [48]\nand BBO [49], in our model.\nThe gravitational wave spectrum is characterized by two quantities α and β [50, 51, 52].\nα is the ratio of the vacuum energy density liberated at the phase transition, ǫ, to the energy\ndensity of the symmetric phase, commonly radiation, thus α = ǫ/ρrad . β determines the size\nof bubbles at the time of collision and thus the characteristic frequency of the gravitational\nradiation, f∗ . It is determined from the rate of variation of the bubble nucleation rate,\nβ ≈ d log Γ/dt. The duration of the phase transition is given by β −1 .\nIn terms of these two quantites the energy density in gravity waves, from the phase\ntransition is [50],\n2\n\n−6 2\n\nΩGW h ≈ 1.1 × 10 κ\n\n\u0012\n\nH∗\nβ\n\n\u00132 \u0012\n\nα\n1+α\n\n\u00132 \u0012\n\nv3\n0.24 + v 3\n\n\u0013\u0012\n\n100\ng∗\n\n\u00131/3\n\n,\n\n(12)\n\nwhere κ is the fraction of vacuum energy that is transferred to the bulk motions of the\nplasma and for the ranges of α we are interested in κ ≈ 1/2. The peak frequency of the\nwaves occurs at,\n−8\n\nfmax ≈ 5.2 × 10 Hz\n\n\u0012\n\nβ\nH∗\n\n\u0013\u0012\n\nT∗\n1 GeV\n\n\u0013\u0010\n\ng∗ \u00111/6\n.\n100\n\n(13)\n\n−11\nLISA has sensitivity ranging from ΩGW h2 >\nat f ≈ 3 × 10−4 Hz to ΩGW h2 >\n∼ 2 × 10\n∼ 2×\n10−12 at f ≈ 10−2 Hz while the sensitivity drops off considerably outside this range [48].\n\nCalculating both parameters requires determining the field profiles during the tunnelling\nprocess, over a range of temperatures; a difficult numerical problem for more than one field.\nHowever, inspection of the potential in our case shows that there is a path between the two\nminima, along which s is given by its vev s = −κ(φ2 + T 2 /12)/m2s , which minimizes the\npotential. We assume that the tunneling process will follow this path in field space and this\n12\n\n\f0.2\n0.3\n0.4\n0.5\n\nreduces the search for the bubble action, S3 , to a one field problem that can be solved by\n0\n\nthe usual methods [53].\n\n2\n\nFinding the bubble profiles for φ and s we are able to determine the temperature, T∗ , at\n4\n\nwhich the bubble nucleation rate is comparable to the Hubble expansion, i.e. T∗4 e−S3 /T∗ ∼\n6\n\nH 4 , once this is satisfied the bubbles are guaranteed to percolate. At this time the bubble\n8\n\naction is given approximately by S3 ≈ S0 − β(t − t∗ ), so once t∗ is reached the transition\n10\n\nends approximately time ∼ 1/β later, and the bubble size at this time is R ∼ β −1 . With\n12\nthese bubble profiles, and transition temperature\nin hand we can determine α and β and\n14 4. Although, in part of parameter space,\nthus ΩGW h2 and fmax , which are shown in Figure\nPSfrag replacements\n\nf\n\nthe frequency is in the correct range to be seenmax\nby LISA the amplitude of the gravity waves\nis too small. This is due, in part, to the fact that the phase transition happens late, as\ndiscussed earlier, consequently T∗ is low. The transition happens close to Tc where β/H\n\nis large, pushing the frequency into the observable ranges, despite this low T∗ , but at the\nexpense of lowering the amplitude: the amplitude of the signal is determined by number\nof bubbles available for collision and the number of bubbles per Hubble volume is given by\nβ −1 Γ/H 3 ∼ H/β. Even for BBO the signal is not large enough in the frequency range to\n−17\nwhich they are sensitive; BBO's sensitivity range is estimated to be Ωh2 >\nover\n∼ 2 × 10\nthe range 0.1 Hz <\n∼ 1 Hz [54].\n∼f <\n\nfmax\n\n0.5\n\nΩGW h2\n\n0.5\n\n0.4\n\n0.4\n\n0.3\n\n0.3\n\nsin θ\n\nsin θ\n\n0.2\n\n0.2\n\n0.1\n\n0.1\n\n00\n\n2\n\n4\n\n6\n\n8\n\nmS\n\n10\n\n12\n\n00\n\n14\n\n2\n\n4\n\n6\n\n8\n\nmS\n\n10\n\n12\n\n14\n\nFIG. 4: Plots of fmax and ΩGW h2 for mH = 115 GeV. In the fmax plot, the red (upper) region is\nin the sensitivity band of LISA and the blue (lower) in that of BBO. In the ΩGW h2 plot, reading\nfrom the top, the contours correspond to 10−15 , 10−16 , 10−17 , 10−18 , and 10−20 respectively.\n\n13\n\n\fV.\n\nCONCLUSIONS\n\nNew data from cosmic rays may suggest the presence of a new scale of physics with mass\n∼ GeV. Such states may also allow a lighter Higgs boson consistent with LEP limits by\nmodifying its decays. If the new state s couples to the Higgs with a trilinear coupling, it can\nnaturally generate a first-order electroweak phase transition, which is a necessary ingredient\nfor electroweak baryogenesis.\nSuch a state naturally mixes with the Higgs boson. LEP limits on s-strahlung then\nnaturally constrain its properties. We have found that the constraints are easily satisfied if\nthe state's mass is ms <\n∼ 12 GeV, where its decays into bottom quarks are small. Allowing\nfully general decays of s opens up regions of parameter space below 5 GeV. While such a\nscalar can generate a first-order phase transition, the duration of the transition is sufficiently\nsmall that no appreciable gravitational wave signal arises.\nNew searches [55, 56] for light states will add insight into whether this scenario is realized\nin nature. However, in light of the many motivations for new physics at the ∼ GeV scale, it is\nintriguing that such particles may also open the window for the wide ranging phenomenology\nassociated with a first order phase transition.\n\nAcknowledgements\n\nWe thank Zoltan Ligeti, Gilad Perez, and Mark Wise for discussions. NW and AK\nare supported by NSF CAREER grant PHY-0449818 and DOE OJI grant # DE-FG0206ER41417. Fermilab is operated by Fermi Research Alliance, LLC, under Contract DEAC02-07CH11359 with the United States Department of Energy. The research of SD is\nsupported by the Natural Sciences and Engineering Research Council of Canada. PF and\nNW would like to thank the University of Washington's Workshop on Signatures of LongLived Exotic Particles at the LHC where part of this work was completed; this work was\nsupported in part by the DOE under Task TeV of contract DE-FGO2-96-ER40956.\n\n[1] A. G. Cohen, D. B. Kaplan, and A. E. Nelson, Phys. Lett. B245, 561 (1990).\n\n14\n\n\f[2] A. G. Cohen, D. B. Kaplan, and A. E. Nelson, Ann. Rev. Nucl. Part. Sci. 43, 27 (1993),\nhep-ph/9302210.\n[3] M. S. Carena, M. Quiros, and C. E. M. Wagner, Phys. Lett. B380, 81 (1996), hep-ph/9603420.\n[4] R. Barate et al. (LEP Working Group for Higgs boson searches), Phys. Lett. B565, 61 (2003),\nhep-ex/0306033.\n[5] A. Menon, D. E. Morrissey, and C. E. M. Wagner, Phys. Rev. D70, 035005 (2004), hepph/0404184.\n[6] J. M. Cline, S. Kraml, G. Laporte, and H. Yamashita (2009), 0905.2559.\n[7] C. Grojean, G. Servant, and J. D. Wells, Phys. Rev. D71, 036001 (2005), hep-ph/0407019.\n[8] O. Adriani et al. (2008), 0810.4995.\n[9] O. Adriani et al. (2008), 0810.4994.\n[10] J. Chang et al., Nature 456, 362 (2008).\n[11] K. Yoshida et al., Adv. Space Res. 42, 1670 (2008).\n[12] D. P. Finkbeiner, Astrophys. J. 614, 186 (2004), astro-ph/0311547.\n[13] D. P. Finkbeiner (2004), astro-ph/0409027.\n[14] G. Dobler and D. P. Finkbeiner, Astrophys. J. 680, 1222 (2008), 0712.1038.\n[15] N. Arkani-Hamed, D. P. Finkbeiner, T. Slatyer, and N. Weiner (2008), 0810.0713.\n[16] M. Pospelov and A. Ritz, Phys. Lett. B671, 391 (2009), 0810.1502.\n[17] I. Cholis, L. Goodenough, and N. Weiner (2008), 0802.2922.\n[18] I. Cholis, D. P. Finkbeiner, L. Goodenough, and N. Weiner (2008), 0810.5344.\n[19] D. P. Finkbeiner and N. Weiner, Phys. Rev. D76, 083519 (2007), astro-ph/0702587.\n[20] N. Arkani-Hamed and N. Weiner, JHEP 12, 104 (2008), 0810.0714.\n[21] M. Baumgart, C. Cheung, J. T. Ruderman, L.-T. Wang, and I. Yavin (2009), 0901.0283.\n[22] R. Dermisek and J. F. Gunion, Phys. Rev. Lett. 95, 041801 (2005), hep-ph/0502105.\n[23] R. Dermisek and J. F. Gunion, Phys. Rev. D73, 111701 (2006), hep-ph/0510322.\n[24] S. Chang, P. J. Fox, and N. Weiner, JHEP 08, 068 (2006), hep-ph/0511250.\n[25] P. C. Schuster and N. Toro (2005), hep-ph/0512189.\n[26] P. W. Graham, A. Pierce, and J. G. Wacker (2006), hep-ph/0605162.\n[27] S. Chang, P. J. Fox, and N. Weiner, Phys. Rev. Lett. 98, 111802 (2007), hep-ph/0608310.\n[28] S. Chang, R. Dermisek, J. F. Gunion, and N. Weiner (2008), 0801.4554.\n[29] T. Aaltonen et al. (CDF) (2008), 0810.5357.\n\n15\n\n\f[30] P. Giromini et al. (2008), 0810.5730.\n[31] S. Profumo, M. J. Ramsey-Musolf, and G. Shaughnessy, JHEP 08, 010 (2007), 0705.2425.\n[32] M. Dine and D. MacIntire, Phys. Rev. D46, 2594 (1992), hep-ph/9205227.\n[33] P. J. Fox, A. E. Nelson, and N. Weiner, JHEP 08, 035 (2002), hep-ph/0206096.\n[34] G. W. Anderson and L. J. Hall, Phys. Rev. D45, 2685 (1992).\n[35] M. S. Carena, A. Megevand, M. Quiros, and C. E. M. Wagner, Nucl. Phys. B716, 319 (2005),\nhep-ph/0410352.\n[36] T. Cohen, D. E. Morrissey, and A. Pierce, Phys. Rev. D78, 111701 (2008), 0808.3994.\n[37] S. Weinberg, Phys. Rev. D9, 3357 (1974).\n[38] R. N. Mohapatra and G. Senjanovic, Phys. Rev. D20, 3390 (1979).\n[39] F. R. Klinkhamer and N. S. Manton, Phys. Rev. D30, 2212 (1984).\n[40] G. Abbiendi et al. (OPAL), Eur. Phys. J. C27, 311 (2003), hep-ex/0206022.\n[41] R. S. Willey and H. L. Yu, Phys. Rev. D26, 3086 (1982).\n[42] B. Grinstein, L. J. Hall, and L. Randall, Phys. Lett. B211, 363 (1988).\n[43] R. S. Chivukula and A. V. Manohar, Phys. Lett. B207, 86 (1988).\n[44] D. O'Connell, M. J. Ramsey-Musolf, and M. B. Wise, Phys. Rev. D75, 037701 (2007), hepph/0611014.\n[45] F. Collaboration (2009), 0905.0025.\n[46] Y. Nomura and J. Thaler, Phys. Rev. D79, 075008 (2009), 0810.5397.\n[47] L. M. Carpenter, P. J. Fox, and D. E. Kaplan (2005), hep-ph/0503093.\n[48] http://sci.esa.int.\n[49] http://universe.nasa.gov/program/vision.html.\n[50] M. Kamionkowski, A. Kosowsky, and M. S. Turner, Phys. Rev. D49, 2837 (1994), astroph/9310044.\n[51] R. Apreda, M. Maggiore, A. Nicolis, and A. Riotto, Nucl. Phys. B631, 342 (2002), grqc/0107033.\n[52] C. Grojean and G. Servant, Phys. Rev. D75, 043507 (2007), hep-ph/0607107.\n[53] S. R. Coleman, Phys. Rev. D15, 2929 (1977).\n[54] V. Corbin and N. J. Cornish, Class. Quant. Grav. 23, 2435 (2006), gr-qc/0512039.\n[55] R. Essig, P. Schuster, and N. Toro, Phys. Rev. D80, 015003 (2009), 0903.3941.\n[56] J. D. Bjorken, R. Essig, P. Schuster, and N. Toro (2009), 0906.0580.\n\n16\n\n\f[57] A. D. Sakharov, Pisma Zh. Eksp. Teor. Fiz. 5, 32 (1967).\n[58] J. Hisano, S. Matsumoto, M. M. Nojiri, and O. Saito, Phys. Rev. D71, 063528 (2005), hepph/0412403.\n[59] M. Cirelli, R. Franceschini, and A. Strumia, Nucl. Phys. B800, 204 (2008), 0802.3378.\n[60] J. March-Russell, S. M. West, D. Cumberbatch, and D. Hooper, JHEP 07, 058 (2008),\n0801.3440.\n[61] M. Cirelli, M. Kadastik, M. Raidal, and A. Strumia, Nucl. Phys. B813, 1 (2009), 0809.2409.\n[62] P. J. Fox and E. Poppitz (2008), 0811.0399.\n[63] K. M. Zurek (2008), 0811.4429.\n[64] F. R. Klinkhamer and R. Laterveer, Z. Phys. C53, 247 (1992).\n[65] B. Kleihaus, J. Kunz, and Y. Brihaye, Phys. Lett. B273, 100 (1991).\n[66] In addition, the CP violating phase in the SM, present in the CKM matrix, is too small to\ngenerate sufficient baryon number. In this paper we concentrate only on the order of the phase\ntransition and assume the other conditions [57] necessary for baryogenesis are satisfied.\n[67] The Sommerfeld enhancement was first explored in the context of dark matter in [58], arising\nfrom weak interactions for multi-TeV WIMPs. See also [59, 60].\n[68] Another possibility is that the annihilations occur through a force carrier that couples to\nleptons only [61, 62], or which is leptonic, itself [63], but there must still be a light state in\norder to generate the large cross section.\n[69] Note that the sphaleron solution is found in the limit where there is no mixing with U (1)Y ,\nθw = 0. Corrections to the energy are small as one moves to the physical value [64, 65].\n[70] The Sommerfeld enhancement was first explored in the context of dark matter in [58], arising\nfrom weak interactions for multi-TeV WIMPs.\n\n17\n\n\f"}