{"id": "http://arxiv.org/abs/1006.3789v1", "guidislink": true, "updated": "2010-06-18T19:54:46Z", "updated_parsed": [2010, 6, 18, 19, 54, 46, 4, 169, 0], "published": "2010-06-18T19:54:46Z", "published_parsed": [2010, 6, 18, 19, 54, 46, 4, 169, 0], "title": "Quasar bolometric corrections: theoretical considerations", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1006.5812%2C1006.3245%2C1006.5647%2C1006.0068%2C1006.5360%2C1006.1580%2C1006.4183%2C1006.3705%2C1006.0772%2C1006.1174%2C1006.2001%2C1006.0386%2C1006.5628%2C1006.5927%2C1006.0373%2C1006.3904%2C1006.4018%2C1006.4389%2C1006.5018%2C1006.1307%2C1006.2461%2C1006.4655%2C1006.5248%2C1006.2573%2C1006.3881%2C1006.4978%2C1006.2076%2C1006.4392%2C1006.3789%2C1006.3214%2C1006.4201%2C1006.0594%2C1006.5295%2C1006.3039%2C1006.1179%2C1006.3993%2C1006.4207%2C1006.3212%2C1006.2321%2C1006.5858%2C1006.3307%2C1006.4290%2C1006.1398%2C1006.1954%2C1006.0203%2C1006.2396%2C1006.5835%2C1006.3637%2C1006.5222%2C1006.5744%2C1006.5751%2C1006.1915%2C1006.5292%2C1006.4939%2C1006.2796%2C1006.2725%2C1006.0920%2C1006.3416%2C1006.4984%2C1006.5427%2C1006.1442%2C1006.3012%2C1006.5611%2C1006.0033%2C1006.2346%2C1006.3338%2C1006.2957%2C1006.2918%2C1006.3959%2C1006.5603%2C1006.3557%2C1006.1239%2C1006.4559%2C1006.0140%2C1006.2041%2C1006.1717%2C1006.3215%2C1006.3277%2C1006.1639%2C1006.0548%2C1006.4883%2C1006.1265%2C1006.2167%2C1006.1985%2C1006.2693%2C1006.3764%2C1006.1641%2C1006.1838%2C1006.1358%2C1006.5313%2C1006.1862%2C1006.4011%2C1006.3503%2C1006.4578%2C1006.1653%2C1006.0432%2C1006.4235%2C1006.1208%2C1006.5600%2C1006.2186%2C1006.4538&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Quasar bolometric corrections: theoretical considerations"}, "summary": "Bolometric corrections based on the optical-to-ultraviolet continuum spectrum\nof quasars are widely used to quantify their radiative output, although such\nestimates are affected by a myriad of uncertainties, such as the generally\nunknown line-of-sight angle to the central engine. In order to shed light on\nthese issues, we investigate the state-of-the-art models of Hubeny et al. that\ndescribe the continuum spectrum of thin accretion discs and include\nrelativistic effects. We explore the bolometric corrections as a function of\nmass accretion rates, black hole masses and viewing angles, restricted to the\nparameter space expected for type-1 quasars. We find that a nonlinear\nrelationship log L_bol=A + B log(lambda L_lambda) with B<=0.9 is favoured by\nthe models and becomes tighter as the wavelength decreases. We calculate from\nthe model the bolometric corrections corresponding to the wavelengths lambda =\n1450A, 3000A and 5100A. In particular, for lambda=3000A we find A=9.24 +- 0.77\nand B=0.81 +- 0.02. We demonstrate that the often-made assumption that quasars\nemit isotropically may lead to severe systematic errors in the determination of\nL_bol, when using the method of integrating the \"big blue bump\" spectrum. For a\ntypical viewing angle of ~30 degrees to the quasar central engine, we obtain\nthat the value of L_bol resulting from the isotropy assumption has a systematic\nerror of ~30% high compared to the value of L_bol which incorporates the\nanisotropic emission of the accretion disc. These results are of direct\nrelevance to observational determinations of the bolometric luminosities of\nquasars, and may be used to improve such estimates.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1006.5812%2C1006.3245%2C1006.5647%2C1006.0068%2C1006.5360%2C1006.1580%2C1006.4183%2C1006.3705%2C1006.0772%2C1006.1174%2C1006.2001%2C1006.0386%2C1006.5628%2C1006.5927%2C1006.0373%2C1006.3904%2C1006.4018%2C1006.4389%2C1006.5018%2C1006.1307%2C1006.2461%2C1006.4655%2C1006.5248%2C1006.2573%2C1006.3881%2C1006.4978%2C1006.2076%2C1006.4392%2C1006.3789%2C1006.3214%2C1006.4201%2C1006.0594%2C1006.5295%2C1006.3039%2C1006.1179%2C1006.3993%2C1006.4207%2C1006.3212%2C1006.2321%2C1006.5858%2C1006.3307%2C1006.4290%2C1006.1398%2C1006.1954%2C1006.0203%2C1006.2396%2C1006.5835%2C1006.3637%2C1006.5222%2C1006.5744%2C1006.5751%2C1006.1915%2C1006.5292%2C1006.4939%2C1006.2796%2C1006.2725%2C1006.0920%2C1006.3416%2C1006.4984%2C1006.5427%2C1006.1442%2C1006.3012%2C1006.5611%2C1006.0033%2C1006.2346%2C1006.3338%2C1006.2957%2C1006.2918%2C1006.3959%2C1006.5603%2C1006.3557%2C1006.1239%2C1006.4559%2C1006.0140%2C1006.2041%2C1006.1717%2C1006.3215%2C1006.3277%2C1006.1639%2C1006.0548%2C1006.4883%2C1006.1265%2C1006.2167%2C1006.1985%2C1006.2693%2C1006.3764%2C1006.1641%2C1006.1838%2C1006.1358%2C1006.5313%2C1006.1862%2C1006.4011%2C1006.3503%2C1006.4578%2C1006.1653%2C1006.0432%2C1006.4235%2C1006.1208%2C1006.5600%2C1006.2186%2C1006.4538&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Bolometric corrections based on the optical-to-ultraviolet continuum spectrum\nof quasars are widely used to quantify their radiative output, although such\nestimates are affected by a myriad of uncertainties, such as the generally\nunknown line-of-sight angle to the central engine. In order to shed light on\nthese issues, we investigate the state-of-the-art models of Hubeny et al. that\ndescribe the continuum spectrum of thin accretion discs and include\nrelativistic effects. We explore the bolometric corrections as a function of\nmass accretion rates, black hole masses and viewing angles, restricted to the\nparameter space expected for type-1 quasars. We find that a nonlinear\nrelationship log L_bol=A + B log(lambda L_lambda) with B<=0.9 is favoured by\nthe models and becomes tighter as the wavelength decreases. We calculate from\nthe model the bolometric corrections corresponding to the wavelengths lambda =\n1450A, 3000A and 5100A. In particular, for lambda=3000A we find A=9.24 +- 0.77\nand B=0.81 +- 0.02. We demonstrate that the often-made assumption that quasars\nemit isotropically may lead to severe systematic errors in the determination of\nL_bol, when using the method of integrating the \"big blue bump\" spectrum. For a\ntypical viewing angle of ~30 degrees to the quasar central engine, we obtain\nthat the value of L_bol resulting from the isotropy assumption has a systematic\nerror of ~30% high compared to the value of L_bol which incorporates the\nanisotropic emission of the accretion disc. These results are of direct\nrelevance to observational determinations of the bolometric luminosities of\nquasars, and may be used to improve such estimates."}, "authors": ["Rodrigo S. Nemmen", "Michael S. Brotherton"], "author_detail": {"name": "Michael S. Brotherton"}, "author": "Michael S. Brotherton", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1111/j.1365-2966.2010.17224.x", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1006.3789v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1006.3789v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "9 pages, 11 figures, accepted for publication in MNRAS", "arxiv_primary_category": {"term": "astro-ph.CO", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "astro-ph.CO", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "astro-ph.HE", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1006.3789v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1006.3789v1", "journal_reference": null, "doi": "10.1111/j.1365-2966.2010.17224.x", "fulltext": "Mon. Not. R. Astron. Soc. 000, 1–9 (2010)\n\nPrinted 17 October 2018\n\n(MN LATEX style file v2.2)\n\narXiv:1006.3789v1 [astro-ph.CO] 18 Jun 2010\n\nQuasar bolometric corrections: theoretical considerations\nRodrigo\nS. Nemmen,1⋆ Michael S. Brotherton,2\n1\n\nInstituto de Fı́sica, Universidade Federal do Rio Grande do Sul, Campus do Vale, Porto Alegre, RS, Brazil\nof Physics and Astronomy, University of Wyoming, Laramie, WY 82071\n\n2 Department\n\nAccepted 2010 June 18. Received 2010 June 17; in original form 2010 March 31\n\nABSTRACT\n\nBolometric corrections based on the optical-to-ultraviolet continuum spectrum of\nquasars are widely used to quantify their radiative output, although such estimates are\naffected by a myriad of uncertainties, such as the generally unknown line-of-sight angle\nto the central engine. In order to shed light on these issues, we investigate the state-ofthe-art models of Hubeny et al. (2000) that describe the continuum spectrum of thin\naccretion discs and include relativistic effects. We explore the bolometric corrections as\na function of mass accretion rates, black hole masses and viewing angles, restricted to\nthe parameter space expected for type-1 quasars. We find that a nonlinear relationship\nlog Lbol = A+B log(λLλ ) with B 6 0.9 is favoured by the models and becomes tighter\nas the wavelength decreases. We calculate from the model the bolometric corrections\ncorresponding to the wavelengths λ = 1450 Å, 3000 Å and 5100 Å. In particular, for\nλ = 3000 Å we find A = 9.24 ± 0.77 and B = 0.81 ± 0.02. We demonstrate that the\noften-made assumption that quasars emit isotropically may lead to severe systematic\nerrors in the determination of Lbol , when using the method of integrating the \"big blue\nbump\" spectrum. For a typical viewing angle of ≈ 30◦ to the quasar central engine, we\nobtain that the value of Lbol resulting from the isotropy assumption has a systematic\nerror of ≈ 30% high compared to the value of Lbol which incorporates the anisotropic\nemission of the accretion disc. These results are of direct relevance to observational\ndeterminations of the bolometric luminosities of quasars, and may be used to improve\nsuch estimates.\nKey words: accretion, accretion discs – black hole physics – galaxies: active – quasars:\ngeneral\n\n1\n\nINTRODUCTION\n\nQuasars are important and interesting as the most luminous non-exploding objects in the universe. They seem\nlikely to exert a powerful influence on the evolution of\nthe galaxies that host them, particularly through their extreme luminosities that can ionize and radiatively accelerate\nsurrounding gas (e.g., Crenshaw, Kraemer & George 2003;\nBegelman 2004; Di Matteo, Springel & Hernquist 2005).\nAccretion onto supermassive black holes powers quasars,\nand our ability to estimate the masses of these black holes\nhas significantly advanced our understanding and revealed\nrelationships among quasars and their host galaxies (e.g.,\nFerrarese & Ford 2005; Vestergaard 2009).\nOther fundamental quasar properties include the bolometric luminosity and the accretion rate, often expressed as\nthe Eddington fraction (the ratio of the bolometric luminosity to the Eddington luminosity). The ability to determine\n⋆\n\nE-mail: rodrigo.nemmen@ufrgs.br\n\nthe bolometric luminosity is often taken for granted, since\nthe quasar continuum is observed directly in most cases and\nsimple scaling relationships are assumed (e.g., Vestergaard\n2009). How to make the bolometric corrections is not agreed\nupon, however, and the uncertainties are probably greater\nthan those in determining black hole mass. Understanding\nhow to properly make bolometric corrections and their uncertainties is important to future quasar investigations.\nThe idea behind determining bolometric luminosity is\nsimple: from one or more observations determine the total\nenergy radiated by a quasar per second into its surroundings. For objects like stars this is relatively easy, but that is\nnot the case for quasars. First, quasars emit anisotropically,\nin a complicated manner, and the degree of this anisotropy\ndepends on wavelength and likely varies significantly from\nobject to object. Second, quasars emit at all wavebands,\nfrom radio through X-rays and beyond, many of which are\ndifficult to observe. Third, portions of the spectrum represent reprocessed photons; that is, some fraction of optical or\nUV photons can heat surrounding dust which in turn reradi-\n\n\f2\n\nNemmen & Brotherton\n\nates at infrared wavelengths, so double counting can be an\nissue in theoretical calculations. Fourth, stars and stellarheated dust can, in certain parts of the spectrum (e.g., far\ninfrared, optical) contaminate quasar SEDs and be difficult\nto remove.\nThese complications make it difficult to determine the\nbolometric luminosity of even extremely well-observed individual quasars, let alone that of a random quasar with only\nlimited observations. Still, the bolometric luminosity is an\nimportant quantity and theoretical considerations can help\nus better understand the problem of bolometric corrections\nand may suggest improvements to the methods currently\nemployed.\nOne standard practice to determine bolometric corrections has been to use observations of quasar spectral energy\ndistributions (SEDs) to determine the apparent bolometric\nluminosity, by integrating over all wavelengths, and then\nfitting relationships between optical magnitudes and total\nbolometric luminosity (e.g., Elvis et al. 1994; Richards et al.\n2006). It is generally assumed, using this approach, that the\nquasar is responsible for the light being emitted at all wavelengths and that the emission is isotropic. The bolometric\ncorrections derived generally show about an order of magnitude of dispersion around the average value. This approach\nhas generally only been used to fit simple linear relationships.\nAnother standard practice (e.g., Netzer et al. 2007) has\nbeen to assume that the optical-ultraviolet portion of the\nquasar SED is energetically dominant and powers emission\nat other wavelengths. This approach avoids double counting,\nand is simpler in that only a portion of the SED, the so-called\n\"big blue bump\" thought to be emitted by a geometrically\nthin accretion disc, is important to know. Isotropic emission\nis generally assumed. This technique generates bolometric\ncorrections not too dissimilar from those of the above technique, and apparent uncertainties are also of about an order\nof magnitude.\nWe can look toward accretion disc theory in an attempt\nto improve on these simple approaches. Modern disc models, such as those by Hubeny et al. (2000, 2001), may not\nperfectly explain the shape of quasar big blue bumps (e.g.,\nShang et al. 2005), but can provide insight into a number\nof assumptions that go into making bolometric corrections.\nBelow we examine a number of features of these state-of-theart disc models and what they tell us about this problem.\nThis paper is organized as follows. Section 2 describes\nthe model for the continuum spectrum emitted by thin accretion discs in type-1 quasars that we use; Section 2.2 analyzes the dependence of the disc emission on the viewing angle and Section 2.3 outlines how we calculate the bolometric\nluminosity emitted by the disc and the bolometric corrections. Section 3 contains the theoretical results, with §3.1\ndescribing the dependence of the bolometric correction on\ndifferent wavelengths in the optical-UV band, §3.2 the corresponding dependence on the mass accretion rate and black\nhole mass, and §3.3 giving an account of the systematic error\nobtained in the bolometric correction when quasars are assumed to emit isotropically. Section 4 discusses the broader\nimplications of our work and its possible applications to improve bolometric corrections using quasar observations. Finally, Section 5 summarizes our results.\n\n2\n\nMODERN THIN ACCRETION DISC\nMODELS\n\nWe intend to perform a self-consistent theoretical calculation of the bolometric luminosities of quasars, based on their\nultraviolet-to-optical continuum spectrum (i.e. the big blue\nbump) and correlate it with the emission properties at different wavelengths. In order to do this, we need detailed model\nspectra of accretion discs, appropriate for quasars.\nThe underlying assumption behind the use of the big\nblue bump as a proxy of the bolometric luminosity is that\nthe UV-optical band is where most of the energy in the\nquasars is released, whereas emission in other bands is either\na product of reprocessing of the UV light (e.g. IR) or are\nnot energetically significant on their own (e.g. radio) (e.g.,\nKoratkar & Blaes 1999).\nOver the years, many models for the continuum spectra of thin accretion discs have been formulated with\nvarying degrees of sophistication (e.g., Novikov & Thorne\n1973; Sun & Malkan 1989; Laor & Netzer 1989; Laor 1990;\nSincell & Krolik 1998; Hubeny et al. 2000, 2001). For our\npurposes, we adopted the detailed model of Hubeny et al.\n(2000), which consists of a time-steady, geometrically thin,\noptically thick accretion disc which includes general relativistic and non-LTE effects. Comptonization is neglected\nsince it has little effect for the range of black hole masses\nthat we explored (Hubeny et al. 2001). The Hubeny et al.\nmodel calculates self-consistently the vertical structure of\nthe disc together with the radiation field. It was shown by\nShang et al. (2005) to reproduce some observed properties\nof the UV spectra of quasars and is also supported by nearIR observations (Kishimoto et al. 2008). These models may\nnot be perfect, but they are currently the best theory has\nto offer.\n\n2.1\n\nParameter space explored\n\nHubeny et al. (2000) constructed a grid of models for a wide\nrange of values of black hole mass M and mass accretion\nrate Ṁ , for two values of the viscosity parameter α (0.01\nand 0.1) and for the two extreme values of the black hole\nspin a corresponding to a maximally spinning Kerr black\nhole (a/M = 0.998) and a nonrotating Schwarzschild hole\n(a/M = 0). The black hole masses explored range from\n1.25×108 M⊙ to 3.2×1010 M⊙ ; the accretion rates range from\n2.4 × 10−4 M⊙ yr−1 to 64 M⊙ yr−1 , or expressed in terms of\nthe Eddington accretion rate, between 1.1 × 10−5 ṀEdd and\n0.7ṀEdd where the Eddington accretion rate is defined as\nṀEdd ≡ 22M/(109 M⊙ ) M⊙ yr−1 . The maximal luminosity\nattained by the models correspond to L/LEdd ≈ 0.3. Figure\n1 shows the Ṁ vs. M parameters of the Hubeny et al. grid\nof models for the Kerr case. Hubeny et al. also explored the\neffect of the inclination of the disc with respect to the line of\nsight on the observed spectra, exploring angles ranging from\nnearly face-on (θ ≈ 0◦ ) to nearly edge-on discs (θ ≈ 90◦ ).\nIn our exploration of the parameter space of the accretion disc model, we restrict ourselves to non-LTE models and\nto accretion rates expected to be appropriate for quasars.\nIt is generally accepted that depending on amount of mass\nsupplied to the central black hole, different accretion flow\nstates are possible. For instance, it is thought that in the\nregime of accretion rates appropriate for bright AGNs and\n\n\fQuasar bolometric corrections\n\n3\n\nFigure 1. Ṁ vs. M parameters of the Hubeny et al. grid of\nmodels for the Kerr case. The solid line illustrates the relation\nṁ = 0.01 and the dashed line corresponds to ṁ = 1.\n\nquasars, ṁ & 0.01, the flow is in the thin disc state, while\nfor ṁ . 0.01 – the regime appropriate for low-luminosity\nAGNs such as LINERs – the flow would be in a radiatively inefficient or advection-dominated state (ADAF; e.g.,\nNarayan & McClintock 2008), where we define the dimensionless accretion rate ṁ ≡ Ṁ /ṀEdd . In our analysis we\nconsider only accretion rates with ṁ > 0.01. In Figure 1, we\nillustrate the relation ṁ = 0.01 as the solid line and ṁ = 1\nas the dashed line.\n\n2.2\n\nThe impact of the inclination angle\n\nOptically thick, geometrically thin accretion discs emit light\nanisotropically, so when calculating their total amount of\npower radiated away we must take that aspect into account.\nFor a Newtonian disc, the dependency of the specific flux\non the inclination of the disc with respect to the line of\nsight θ is simply Fν ∝ cos θ (Frank, King & Raine 2002).\nThe disc model of Hubeny et al. (2000) takes into account\ngeneral relativistic effects such as beaming, aberration and\nlight bending as well as limb darkening, which introduce\ncomplicated angle-dependencies in the observed spectrum.\nTo illustrate this point, Figure 2 shows the spectra of\nmodels which differ only with respect to the viewing angle, with all other parameters held fixed. The specific luminosity is calculated as the one an observer along a particular viewing angle would see if the source were isotropic,\ni.e. we use the equation Lν = 4πd2 Fν where d is the distance. Two sets of models are displayed in that figure, with\nparameters appropriate for quasars – M = 109 M⊙ , Ṁ =\n0.25 M⊙ yr−1 – and bright Seyferts – M = 1.25 × 108 M⊙ ,\nṀ = 0.03 M⊙ yr−1 – both sets with α = 0.1 and ṁ ≈ 0.01.\nThe viewing angles in each set of spectra range from the\nedge-on (lowermost spectrum in each case) to the face-on\ncase (uppermost spectrum), with models computed for the\nfollowing values of θ: 89.4◦ , 78.5◦ , 66.4◦ , 60◦ , 53◦ , 36.9◦ and\n8.1◦ . Figure 2 illustrates that the viewing angle has a pronounced impact on the spectra of the thin disc.\nA more insightful way of exhibiting the viewing angle\ndependency of the models can be obtained by plotting the\n\nFigure 2. Theoretical spectra computed with the model of\nHubeny et al. (2000) with parameters typical of quasar accretion\ndiscs (M = 109 M⊙ , Ṁ = 0.25 M⊙ yr−1 ; solid line) and bright\nSeyferts (M = 1.25 × 108 M⊙ , Ṁ = 0.03 M⊙ yr−1 ; dashed line).\nEach set of models differ only with respect to the viewing angle,\nwhere the lowermost spectrum in each case corresponds to the\nnearly edge-on angle and the uppermost spectrum represents the\nnearly face-on orientation (see text for the values of θ).\n\nintegrated luminosity emitted by the disc as a function of\nviewing angle. We compute the integrated luminosity as\nZ ν1\nLi =\nLν dν,\n(1)\nν0\n\nwhere ν0 and ν1 are respectively the lowest and highest frequencies at which the thin disc radiates. Li will obviously\nhave the same θ-dependency as Fν .\nFigure 3 shows how Li depends on θ for the two fiducial sets of model spectra mentioned previously (and plotted in Figure 2), compared to the Newtonian case in which\nFν ∝ cos θ. Clearly, the relativistic model of Hubeny et al.\n(2000) show significant departures from the simple Newtonian accretion model, especially at large inclination angles.\nSuch anisotropic emission must be taken into account when\nestimating the total luminosity of the thin disc and therefore\nthe bolometric luminosity of quasars.\n2.3\n\nTheoretical calculation of the bolometric\ncorrection\n\nThe total luminosity radiated by the disc is independent of\nthe viewing angle and is calculated from Li as\nZ 2π Z π\n1\nL =\nLi (θ) sin θ dθ dφ\n4π 0\n0\nZ π/2\n=\nLi (θ) sin θ dθ,\n(2)\n0\n\nsince the grid of models produced by Hubeny et al. (2000)\nwas calculated ranging up to the angle θ ≈ 90◦ .\nAs mentioned before, a standard practice to estimate\nthe bolometric luminosity from quasar SEDs is to use the\noptical-UV portion of the spectrum on the assumption that\n\n\f4\n\nNemmen & Brotherton\n\nFigure 3. Dependency of the integrated luminosity Li of the thin\naccretion disc on the viewing angle θ. The solid line corresponds to\nthe \"quasar\" fiducial parameters used in Figure 2 and the dashed\nline represents the \"Seyfert\" fiducial parameters. The dotted line\nillustrates the θ-dependency of the simple Newtonian thin disc\nmodel for which Fν ∝ cos θ. Note the log scale.\n\nFigure 4. Fractional error (Li −L)/L incurred when the bolometric luminosity is estimated assuming that the accretion disc is an\nisotropic radiator, as a function of viewing angle, for the quasar\nand the Seyfert fiducial models (parameters listed in §2.2).\n\n3.1\nit is the energetically dominant component of the radiative\noutput and powers the emission at other wavelengths (e.g.,\nNetzer et al. 2007). We follow this principle here to estimate\nLbol and simply assume\nLbol = L,\n\n(3)\n\nwhere L is calculated using Equation 2.\nThis formulation for computing Lbol has the virtue that\nit accounts for the anisotropic nature of the emission of the\nthin accretion disc, including all the relevant effects. When\ncomputing the luminosity of the thin disc, many studies have\nassumed that the disc emits isotropically which introduces\nerrors. Figure 4 shows the fractional error incurred when the\nbolometric luminosity is estimated assuming isotropic emission, which corresponds to using the equation Lbol = Li as\nopposed to equation 3, for both the quasar and the Seyfert\nfiducial models mentioned before. The fractional error plotted corresponds to (Li −L)/L. We can see in this figure that\nerrors in the estimate of Lbol as high as ≈ 90% for the faceon case can occur when the thin disc is wrongly assumed to\nradiate isotropically.\n\n3\n\nRESULTS\n\nIn this section, we explore the different results we are able\nto obtain from the grid of models for quasar spectra described in §2. We are concerned particularly about the resulting bolometric luminosities and their dependence on the\nproperties of the central engine such as black hole mass,\nmass accretion rate and viewing angle. We will also explore\nthe relation of Lbol to the monochromatic luminosity at different wavelengths in the optical-UV band.\n\nDependence of bolometric correction on\nwavelength\n\nOne quantity that is of particular interest is the \"bolometric\ncorrection\" ζλ ≡ Lbol /(λLλ ), which provides a way of estimating the bolometric luminosity knowing the monochromatic luminosity at a certain wavelength λ in the opticalUV band. According to the unification scenario of AGNs,\nthe optical-UV emission would only be directly observable in\ntype-1 objects (e.g., Barthel 1989, Antonucci 1993). Therefore we restrict our study of the QSO synthetic spectra to\nthis class of objects. We do so by restricting the viewing\nangles that we consider to θ 6 60◦ , which we call \"type1\" models. We note that the opening angle may differ from\nthis value, and that it itself may be dependent on luminosity\n(e.g., receding torus models, e.g., Lawrence 1991; Simpson\n2005) or other parameters.\nIt is worthwhile to analyse the distribution of values of\nζλ for different regions of the parameter space, for different\nvalues of λ. We calculate the values of ζλ for three wavelengths: 1450 Å, 3000 Å and 5100 Å. Flux measurements at\nthese wavelengths are often adopted in observational studies to make estimates of bolometric luminosities (Elvis et al.\n1994; Kaspi et al. 2000; Richards et al. 2006). The wavelengths 1450 Å, 3000 Å and 5100 Å correspond to spectral\nregions in the optical for high-redshift, intermediate-redshift\nand low-redshift quasars respectively, and at these wavelengths the emission lines are not present or are relatively\nweak.\nFigure 5 shows the histograms of the distribution of\nvalues of ζλ for non-LTE models corresponding to \"type-1\"\nmodels with ṁ > 0.01, i.e. \"type-1 quasars\". We can see in\nFigure 5 that as the wavelength increases, the distribution\nof values of ζλ broadens. The peak of the distribution moves\ntowards higher values as λ increases, with the medians of the\nbolometric correction for each wavelength being hζ1450 i = 3,\nhζ3000 i = 5.9 and hζ5100 i = 7.6.\nFigure 6 shows the relation between Lbol and λLλ with\n\n\fQuasar bolometric corrections\n\n5\n\nFigure 5. Histograms of the distribution of values of the bolometric correction ζλ for the wavelengths 1450 Å, 3000 Å and 5100 Å, for\nthe \"type-1\" quasar models.\n\nFigure 6. Relation between Lbol and λLλ at λ = 5100 Å, for\nthe \"type-1\" quasar model spectra. The dotted and dashed lines\ncorrespond to models of the form Lbol = ζ5100 λLλ , while the\nsolid line show the best-fitted power-law to the data using the χ2\nmethod.\n\nλ = 5100 Å, for the type-1 quasar models with ṁ > 0.01.\nThe dotted and dashed lines in Figure 6 correspond to\nmodels in which the bolometric luminosity is simply related to the monochromatic luminosity at 5100 Å through\nLbol = ζ5100 λLλ , with the value of ζ5100 being respectively 9\nand 13 for the dotted and dashed lines. These values of ζ5100\nare the ones derived by Kaspi et al. (2000) and Elvis et al.\n(1994) respectively. The mean deviation σ(log Lbol ) of the\ndata about these lines is 0.47 (ζ5100 = 9× model) and 0.49\n(ζ5100 = 13× model).\nWe parametrize a power-law fit in the log-log space portrayed in Figure 6 as log Lbol = A + B log(λLλ ) and fit it\nto the data using the χ2 statistic, obtaining the parameters\nA = 11.7±0.93 and B = 0.76±0.02 (solid line), with a mean\ndeviation about the best-fit model of 0.38. This result suggests that the non-linear model of the form Lbol ∝ (λLλ )0.76\nis favoured to explain the data for the sample of simulated\ntype-1 quasar spectra for λ = 5100 Å.\n\nFigure 7. Same as Figure 6 for λ = 3000 Å.\n\nFigure 7 shows the Lbol vs. λLλ for type-1 quasar models at λ = 3000 Å, following the same notation as Figure\n6. A fit to the 3000 Å data using the χ2 method results in\nA = 9.24 ± 0.77 and B = 0.81 ± 0.02 (dot-dashed line), with\na mean deviation about the best-fit model of 0.31. For comparison, the corresponding mean deviations about the linear\nmodels with ζ3000 = 9 and ζ3000 = 13 are respectively 0.38\nand 0.46.\nFigure 8 shows the Lbol vs. λLλ for type-1 quasar models at λ = 1450 Å, again following the notation of Figure\n6. A fit to the 1450 Å data using the χ2 method results in\nA = 6.7 ± 0.69 and B = 0.87 ± 0.02, with a mean deviation about the best-fit model of 0.26. For comparison, the\nmean deviations about the linear models with ζ1450 = 9 and\nζ1450 = 13 are respectively 0.51 and 0.64.\n\n3.2\n\nDependence of bolometric correction on the\naccretion rate and black hole mass\n\nIn this section we analyze the possible dependence of the\nbolometric correction on the Eddington ratio Lbol /LEdd ,\n\n\f6\n\nNemmen & Brotherton\n\nFigure 8. Same as Figure 6 for λ = 1450 Å.\n\nFigure 10. Same as Figure 9, but here the filled circles correspond to M < 109 M⊙ and the open circles correspond to\nM > 109 M⊙ .\n\nto what was observed in the previous plot. The solid line\nshows the same broken power-law fit shown in Figure 9.\nThere is no strong reason to abandon a simple powerlaw model in favour of more complicated models such\nas a broken power-law, since the latter reproduces only\nmarginally better the results compared to a simple powerlaw.\n\n3.3\n\nFigure 9. Relation between Lbol and λLλ at λ = 5100 Å, for\nthe \"type-1\" quasar model spectra. The filled circles correspond to\nLbol /LEdd < 0.1 and the open circles correspond to Lbol /LEdd >\n0.1. The solid and dot-dashed lines correspond to a broken powerlaw fit and a simple power-law, respectively.\n\nwhich traces the accretion rate, and the black hole mass\nfor the \"type-1\" quasar model spectra.\nFigure 9 shows the relation between Lbol and λLλ\nat λ = 5100 Å, where the filled circles correspond to\nLbol /LEdd < 0.1 and the open circles correspond to\nLbol /LEdd > 0.1. There is a hint in this plot that the slope\nof the dependence of Lbol on λLλ changes slightly as the\nEddington ratio increases, with a break at log(λLλ ) ∼ 45.5\ncorresponding to the chosen \"transition value\" Lbol /LEdd =\n0.1. The solid line in Figure 9 displays the broken powerlaw best-fitted to the data using the Marquardt-Levenberg\nleast-squares method, with the break at x = 45.5. The mean\ndeviation of the data about this best-fit model is 0.35.\nFigure 10 is similar to the previous one, but now the\nfilled circles correspond to models for which M < 109 M⊙\nwhile the open circles represent models with M > 109 M⊙ .\nWe find a slight hint in this figure of a change in the slope of\nthe power-law fit as the black hole mass increases, similarly\n\nBeyond the isotropy assumption when\ncomputing quasar luminosities\n\nWhen converting quasar nuclear line-of-sight fluxes to\nluminosities or when computing bolometric corrections\nand luminosities, the usual assumption is that quasars\nemit isotropically (e.g., Elvis et al. 1994; Shang et al. 2005;\nRichards et al. 2006). We know that this is not the case, as\nwe showed in §2.3 (c.f. Figure 4). Using the spectral models\nfor quasar accretion discs, we can have a theoretical perspective on how good (or bad) is the isotropy assumption\non average.\nIn order to address this issue, we calculated the average\nerror implied by the isotropy assumption when estimating\nthe bolometric luminosities of accretion discs from line-ofsight fluxes measured in the optical-UV continuum spectrum. We did this by averaging all the type-1 quasar models\nat specific viewing angles. Figure 11 shows the corresponding mean fractional error calculated in this way, defined as\n\u001d\n\u001c\nLi − Lbol\n,\n(4)\nMean fractional error =\nLbol\nθ\n(see equations 1 and 3) as a function of the viewing angle θ.\nWe show in this figure the fractional error that result when\ntwo different accretion disc models are used: the general relativistic model (together with the 1σ uncertainty for the\nrelativistic model) of Hubeny et al. (2000) and for comparison a simple Newtonian disc (Frank, King & Raine 2002).\nFor the Newtonian model, the bolometric luminosity is related to the integrated luminosity assuming isotropy Li as\nLbol = 1/(2 cos θ)Li , and the fractional error is given simply\n\n\fQuasar bolometric corrections\n\nFigure 11. Average fractional error incurred when the bolometric luminosity is estimated assuming that the accretion disc is an\nisotropic radiator, as a function of viewing angle.\n\nby 2 cos θ −1. For the general relativistic model, we calculate\nthe mean error numerically.\nFor each accretion disc model there is a specific line-ofsight θi at which Lbol = Li , i.e. at these viewing angles the\nmean error is zero and there is no error incurred in using the\nisotropy assumption. For the Newtonian case, this angle is\nsimply θi = 60◦ . For the relativistic case, Figure 11 tells us\nthat θi ≈ 66◦ , with the uncertainty in the mean error being\nlowest at θ ≈ 55◦ .\n\n7\n\nlog Lbol = A + B log(λLλ ) better reproduces the synthetic\ndata resulting from the accretion disc models, with B 6 0.9\nfor the wavelengths in the optical-UV band that we considered. Our findings are consistent with the observations\nwhich show that the quasar SED shape changes with luminosity (Steffen et al. 2006). On the other hand, we found\nonly weak evidence for evolution of the bolometric correction with the Eddington ratio and the black hole mass.\nWe carried our calculations of the bolometric corrections for three fiducial wavelengths, 1450 Å, 3000 Å and\n5100 Å. We find that as the wavelength decreases, the distribution of values of Lbol /(λLλ ) becomes narrower (c.f.\nFigure 5). Furthermore, the relation between Lbol and\nthe monochromatic luminosities becomes tighter, in the\nsense that both the uncertainties in the parameters of the\npower-law fits and the dispersion around the best-fit model\ndecrease (§3.1). This result simply reflects the fact that\nmonochromatic luminosities measured closer to the peak\nof the energy distribution tend to be better tracers of the\ntotal energy released by the accretion disc. Although it is\npreferable to use luminosities emitted at increasingly smaller\nwavelengths for bolometric corrections, there is one important practical caveat as we advance upwards in energy: the\neffects of dust extinction become progressively more strong,\nwhich obviously must be considered.\nWe can make some recommendations based on the\nmodels for the spectra of accretion discs that we studied, which can be used to estimate bolometric luminosities\nfrom monochromatic luminosities at specific wavelengths.\nFor λ = 1450 Å, the following bolometric correction formula\nis suggested from the models (see §3.1):\nlog Lbol = (6.7 ± 0.69) + (0.87 ± 0.02) log L1450 .\n\n(5)\n\nFor λ = 3000 Å, we derived the correction\n4\n\nDISCUSSION\n\nWe note that the three main underlying assumptions behind our work are (1) that the models for the spectra of\nthin accretion disc correctly explain the observed opticalUV continuum spectra of quasars, (2) the parameter space\nfor the accretion disc models that we explored closely resemble that of real quasars, and (3) the X-ray contribution to\nthe bolometric luminosity is small compared to that of the\nbig blue bump. The resulting scatter of σ(log Lbol ) ≈ 0.9 dex\nin the model data (c.f. Figure 6) arises from the variation\nin the different parameters of the central engine: accretion\nrate, black hole mass and spin, viewing angles and viscosity. The fact that the theoretical scatter is similar to the\nscatter measured in observed quasar data (Elvis et al. 1994;\nShang et al. 2005; Richards et al. 2006) suggests that our assumptions 1 and 2 are reasonable and offers an explanation\nto the observed scatter.\nThere is accumulating evidence that less than ≈ 3%\nof the radiative output of quasars is released in X-rays\n(Elvis et al. 1994; Vasudevan & Fabian 2007; Ho 2008;\nVasudevan & Fabian 2009). This indicates that our third\nassumption is quite plausible.\nPrevious results based on observed quasar SEDs find\nsimple linear bolometric corrections of the form Lbol ∝\nλLλ for different reference wavelengths (Elvis et al. 1994;\nKaspi et al. 2000; Richards et al. 2006). Contrary to that,\nwe find that non-linear bolometric corrections of the form\n\nlog Lbol = (9.24 ± 0.77) + (0.81 ± 0.02) log L3000 .\n\n(6)\n\nFinally, for λ = 5100 Å, the following correction is indicated:\nlog Lbol = (11.7 ± 0.93) + (0.76 ± 0.02) log L5100 .\n\n(7)\n\nSince the bolometric corrections are tighter for λ = 1450 Å,\nit is preferable to use the measurements at this wavelengths.\nWhen using these bolometric corrections, the readers should\nbe aware of the underlying assumptions of our work described previously.\nWe demonstrated that the widespread assumption that\nquasars emit isotropically leads to considerable errors in the\ndetermination of the actual bolometric luminosities, with\naverage fractional errors exceeding 30%. How can these theoretical results be conceivably applied in a real-world case,\nto improve observational estimates of the quasar bolometric luminosity? Let us assume that the bolometric luminosity\nLiso\nbol is available from integrating an observed quasar opticalUV spectrum adopting isotropy, but the line-of-sight to the\nquasar is unknown (as is usually the case). If all lines of\nsight to the central engine are in principle available (i.e. no\ndusty torus), then the average viewing angle for a quasar\nis hθi ≈ 57◦ . Figure 11 tells us that the mean systematic\nfractional error is 0.1 and the actual bolometric luminosity\nwould be systematically smaller than the isotropic estimate\nby a factor of ≈ 0.9.\nOf course, we must consider the presence of a dusty\ntorus blocking our view to a large part of the accretion disc.\n\n\f8\n\nNemmen & Brotherton\n\nIf we consider a dusty structure such that only viewing angles θ . 60◦ are accessible, then hθi ≈ 39◦ . In this case,\nthe systematic average fractional error resulting from the\nisotropic estimate is 0.24, such that Lbol ≈ 0.8Liso\nbol . A somewhat larger dusty torus that restricts the lines of sight to\nθ . 45◦ would correspond to hθi ≈ 30◦ ; the corresponding\naverage fractional error would be 0.28 with Lbol ≈ 0.78Liso\nbol .\nIt is important to keep in mind these systematic errors\nwhen estimating quasar bolometric luminosities assuming\nisotropy.\nIn the case of receding torus models (Lawrence 1991;\nSimpson 2005), which have larger opening angles with increasing quasar luminosity, edge-on discs become more commonly seen in the most luminous systems. In this case, bolometric corrections would be expected to be a function of\nluminosity. Additionally, the isotropy assumption would be\nless in error for a larger fraction of luminous quasars, on\naverage.\nOur results indicate that determining torus opening angles and their distribution as a function of luminosity would\nhelp improve bolometric corrections. Also finding ways of\ndetermining disc inclination angles, perhaps through radio\nproperties (Wills & Brotherton 1995) or other approaches\n(Down et al. 2010) is also indicated as a way of significantly\nimproving bolometric corrections in individual objects.\n\n5\n\nSUMMARY\n\nWe have studied state-of-the-art models for the continuum\nspectrum of thin accretion discs, exploring the theoretical\noptical-to-UV bolometric corrections for a range of mass accretion rates, black hole masses and viewing angles appropriate for the case of type-1 quasars. We find a number of\nresults of direct relevance in observational studies aimed at\nthe determination of quasar bolometric luminosities.\nRegarding the relation between the bolometric and the\nmonochromatic luminosities measured in a given wavelength\nin the optical-to-UV band, we obtain:\n(i) A nonlinear relationship of the form Lbol ∝ (λLλ )const\nis favoured by the models, with the deviation from linearity\nincreasing as the wavelength decreases.\n(ii) The bolometric corrections become tighter with decreasing wavelength, i.e. as we approach the peak of the\nquasar SED (although reddening affects shorter wavelengths\nmore strongly).\n(iii) We list fitting formulas for the bolometric correction\ncorresponding to the wavelengths λ = 1450 Å, 3000 Å, and\n5100 Å, which can be used to improve observational estimates.\nQuasars are not isotropic emitters, and making this assumption may lead to severe systematic errors in the determination of Lbol using the method of integrating the \"big\nblue bump\" spectrum. For a typical line-of-sight of ≈ 30◦ or\nless to the quasar central engine, we estimate that there is\na systematic error of ≈ 30% or higher implied if Lbol is estimated using the isotropy assumption. We find that a more\niso\ncareful calculation should be Lbol ≈ 0.8Liso\nbol , where Lbol is\nthe bolometric luminosity estimated from integrating the\noptical-to-UV spectrum assuming isotropy.\nWith the results of this work, a better assessment of\n\nthe radiative output of quasars based on observations will\nbe made possible.\n\nACKNOWLEDGMENTS\nWe thank Omer Blaes for making the library of thin disk\nspectral models available to the community. RSN is grateful\nto the hospitality of Department of Physics & Astronomy at\nthe University of Wyoming, were part of this work was carried out, and acknowledges the financial support of CNPq.\nMB is grateful to the hospitality of Instituto de Fı́sica, Universidade Federal do Rio Grande do Sul in Porto Alegre,\nBrazil, and acknowledges support from NASA through grant\nNNG05GE84G.\n\nREFERENCES\nAntonucci, R. 1993, ARA&A, 31, 473\nBarthel, P. D., 1989, ApJ, 336, 606\nBegelman, M. C. 2004, in Coevolution of black Holes and\nGalaxies, Carnegie Observatories Astrophysics Series, ed.\nL. C. Ho, p. 374\nCrenshaw, D. M., Kraemer, S. B., George, I. M., 2003,\nARA&A, 41, 117\nDi Matteo, T., Springel, V., & Hernquist, L. 2005, Nature,\n433, 604\nDown, E. J., Rawlings, S., Sivia, D. S., Baker, J. C., 2010,\nMNRAS, 401, 633\nElvis, M., et al. 1994, ApJS, 95, 1\nFerrarese, L., & Ford, H. 2005, Space Sci. Rev., 116, 523\nFrank, J., King, A. R., & Raine, D. J. 2002, in Accretion\nPower in Astrophysics (3d ed.; Cambridge: Cambridge\nUniv. Press)\nHo, L. C. 2008, AAR&A, 46, 475\nHubeny, I., Agol, E., Blaes, O., & Krolik, J. H. 2000, ApJ,\n533, 710\nHubeny, I., Blaes, O., Krolik, J. H., & Agol, E. 2001, ApJ,\n559, 680\nKaspi, S., Smith, P. S., Netzer, H., Maoz, D., Jannuzi, B.\nT., & Giveon, U. 2000, ApJ, 533, 631\nKishimoto, M., Antonucci, R., & Blaes, O. 2005, MNRAS,\n364, 640\nKishimoto, M., et al. 2008, Nature, 454, 492\nKoratkar, A., & Blaes, O. 1999, PASP, 111, 1\nLaor, A., & Netzer, H. 1989, MNRAS, 238, 897\nLaor, A. 1990, MNRAS, 246, 369\nLawrence, A., 1991, MNRAS, 252, 586\nNarayan, R., & McClintock, J. E. 2008, New Astronomy\nReview, 51, 733\nNetzer, H., et al. 2007, ApJ, 666, 806\nNovikov, I. D., & Thorne, K. S. 1973, in Black Holes, ed. C.\nDe Witt & B. S. De Witt (New York: Gordon & Breach),\n344\nRichards, G., T., et al. 2006, ApJ, 166, 470\nShang, Z., et al. 2005, ApJ, 619, 41\nSimpson, C., 2005, MNRAS, 360, 565\nSincell, M. W., & Krolik, J. H. 1998, ApJ, 496, 737\nSteffen, A. T., et al. 2006, AJ, 131, 2826\nSun, W.-H., & Malkan, M. A. 1989, ApJ, 346, 68\n\n\fQuasar bolometric corrections\nVasudevan, R. V., & Fabian, A. C. 2007, MNRAS, 381,\n1235\nVasudevan, R. V., & Fabian, A. C. 2009, MNRAS, 392,\n1124\nVestergaard, M., 2009, Spring Symposium on Black\nHoles. Cambridge Univ. Press, Cambridge, in press\n(arXiv:0904.2615)\nWills, B. J., Brotherton, M. S., 1995, ApJ, 448, L81\nThis paper has been typeset from a TEX/ LATEX file prepared\nby the author.\n\n9\n\n\f"}