{"id": "http://arxiv.org/abs/0908.3325v1", "guidislink": true, "updated": "2009-08-23T18:22:42Z", "updated_parsed": [2009, 8, 23, 18, 22, 42, 6, 235, 0], "published": "2009-08-23T18:22:42Z", "published_parsed": [2009, 8, 23, 18, 22, 42, 6, 235, 0], "title": "The Lusternik-Schnirelmann category of a Lie groupoid", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0908.2781%2C0908.1919%2C0908.3938%2C0908.0097%2C0908.2108%2C0908.3411%2C0908.0088%2C0908.0760%2C0908.1940%2C0908.2644%2C0908.2732%2C0908.3149%2C0908.3893%2C0908.3096%2C0908.0664%2C0908.2195%2C0908.1809%2C0908.3821%2C0908.2082%2C0908.1054%2C0908.4028%2C0908.1379%2C0908.0824%2C0908.0503%2C0908.3884%2C0908.0151%2C0908.0451%2C0908.1890%2C0908.2212%2C0908.2559%2C0908.3451%2C0908.2125%2C0908.4082%2C0908.3091%2C0908.1562%2C0908.1285%2C0908.1751%2C0908.0496%2C0908.2185%2C0908.0955%2C0908.2356%2C0908.2472%2C0908.1499%2C0908.1009%2C0908.2892%2C0908.1776%2C0908.0985%2C0908.2144%2C0908.1002%2C0908.1661%2C0908.0699%2C0908.0529%2C0908.0708%2C0908.4479%2C0908.2279%2C0908.4116%2C0908.0461%2C0908.3790%2C0908.3222%2C0908.1563%2C0908.2578%2C0908.2938%2C0908.3960%2C0908.1925%2C0908.3473%2C0908.3001%2C0908.0086%2C0908.3266%2C0908.3861%2C0908.3374%2C0908.3551%2C0908.1270%2C0908.3845%2C0908.1058%2C0908.3151%2C0908.3318%2C0908.4218%2C0908.1901%2C0908.0787%2C0908.3897%2C0908.0778%2C0908.1215%2C0908.0981%2C0908.1129%2C0908.3325%2C0908.0718%2C0908.2001%2C0908.2353%2C0908.4027%2C0908.3585%2C0908.3869%2C0908.0563%2C0908.2619%2C0908.0033%2C0908.1800%2C0908.2764%2C0908.3883%2C0908.3889%2C0908.2313%2C0908.1100%2C0908.2374&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "The Lusternik-Schnirelmann category of a Lie groupoid"}, "summary": "We propose a new homotopy invariant for Lie groupoids which generalizes the\nclassical Lusternik-Schnirelmann category for topological spaces. We use a\nbicategorical approach to develop a notion of contraction in this context. We\npropose a notion of homotopy between generalized maps given by the 2-arrows in\na certain bicategory of fractions. This notion is invariant under Morita\nequivalence. Thus, when the groupoid defines an orbifold, we have a well\ndefined LS-category for orbifolds. We prove an orbifold version of the\nclassical Lusternik-Schnirelmann theorem for critical points.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0908.2781%2C0908.1919%2C0908.3938%2C0908.0097%2C0908.2108%2C0908.3411%2C0908.0088%2C0908.0760%2C0908.1940%2C0908.2644%2C0908.2732%2C0908.3149%2C0908.3893%2C0908.3096%2C0908.0664%2C0908.2195%2C0908.1809%2C0908.3821%2C0908.2082%2C0908.1054%2C0908.4028%2C0908.1379%2C0908.0824%2C0908.0503%2C0908.3884%2C0908.0151%2C0908.0451%2C0908.1890%2C0908.2212%2C0908.2559%2C0908.3451%2C0908.2125%2C0908.4082%2C0908.3091%2C0908.1562%2C0908.1285%2C0908.1751%2C0908.0496%2C0908.2185%2C0908.0955%2C0908.2356%2C0908.2472%2C0908.1499%2C0908.1009%2C0908.2892%2C0908.1776%2C0908.0985%2C0908.2144%2C0908.1002%2C0908.1661%2C0908.0699%2C0908.0529%2C0908.0708%2C0908.4479%2C0908.2279%2C0908.4116%2C0908.0461%2C0908.3790%2C0908.3222%2C0908.1563%2C0908.2578%2C0908.2938%2C0908.3960%2C0908.1925%2C0908.3473%2C0908.3001%2C0908.0086%2C0908.3266%2C0908.3861%2C0908.3374%2C0908.3551%2C0908.1270%2C0908.3845%2C0908.1058%2C0908.3151%2C0908.3318%2C0908.4218%2C0908.1901%2C0908.0787%2C0908.3897%2C0908.0778%2C0908.1215%2C0908.0981%2C0908.1129%2C0908.3325%2C0908.0718%2C0908.2001%2C0908.2353%2C0908.4027%2C0908.3585%2C0908.3869%2C0908.0563%2C0908.2619%2C0908.0033%2C0908.1800%2C0908.2764%2C0908.3883%2C0908.3889%2C0908.2313%2C0908.1100%2C0908.2374&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We propose a new homotopy invariant for Lie groupoids which generalizes the\nclassical Lusternik-Schnirelmann category for topological spaces. We use a\nbicategorical approach to develop a notion of contraction in this context. We\npropose a notion of homotopy between generalized maps given by the 2-arrows in\na certain bicategory of fractions. This notion is invariant under Morita\nequivalence. Thus, when the groupoid defines an orbifold, we have a well\ndefined LS-category for orbifolds. We prove an orbifold version of the\nclassical Lusternik-Schnirelmann theorem for critical points."}, "authors": ["Hellen Colman"], "author_detail": {"name": "Hellen Colman"}, "author": "Hellen Colman", "links": [{"href": "http://arxiv.org/abs/0908.3325v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0908.3325v1", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "math.AT", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "math.AT", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "math.CT", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "22A22, 55M30, 18D05", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0908.3325v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0908.3325v1", "arxiv_comment": null, "journal_reference": null, "doi": null, "fulltext": "TRANSACTIONS OF THE\nAMERICAN MATHEMATICAL SOCIETY\nVolume 00, Number 0, Pages 000–000\nS 0002-9947(XX)0000-0\n\narXiv:0908.3325v1 [math.AT] 23 Aug 2009\n\nTHE LUSTERNIK-SCHNIRELMANN CATEGORY OF A LIE\nGROUPOID\nHELLEN COLMAN\nAbstract. We propose a new homotopy invariant for Lie groupoids which\ngeneralizes the classical Lusternik-Schnirelmann category for topological spaces.\nWe use a bicategorical approach to develop a notion of contraction in this context. We propose a notion of homotopy between generalized maps given by\nthe 2-arrows in a certain bicategory of fractions. This notion is invariant under\nMorita equivalence. Thus, when the groupoid defines an orbifold, we have a\nwell defined LS-category for orbifolds. We prove an orbifold version of the\nclassical Lusternik-Schnirelmann theorem for critical points.\n\n1. Introduction\nThe LS-category of a topological space is an invariant of the homotopy type of\nthe space introduced in the early 1930's by Lusternik and Schnirelmann [26]. It is a\nnumerical invariant that measures the complexity of the space, in particular if M is\na compact manifold the LS-category of M provides a lower bound for the number\nof critical points of any smooth function on the manifold. The LS-category of a\nspace X is defined as the least number of open subsets, contractible in X, required\nto cover X. For a survey in LS-category see [20, 13].\nThere are many generalizations of the original concept adapted to various contexts such as the fibrewise category, introduced by I.M. James and J.R. Morris\n[21], the equivariant category, by E. Fadell [16] and the transverse and tangential\ncategories for foliated manifolds [12, 11, 8].\nOur aim is to develop a Lusternik-Schnirelmann theory in the context of Lie\ngroupoids. Our main application will be in the setting of orbifolds as groupoids.\nSince an orbifold is defined as a Morita equivalence class of certain type of\ngroupoids [33, 31] our notion of LS-category for Lie groupoids ought to be invariant\nunder Morita equivalence. In this spirit, the right notion of morphism between Lie\ngroupoids is that of a generalized map [33, 31]. We develop a notion of homotopy\nbetween generalized maps. We start with a notion of strong homotopy between\nstrict morphisms which is not Morita invariant, and introduce the notion of essential homotopy equivalence that simultaneously weakens a strict homotopy and\ngeneralizes an essential equivalence. We will say that two Lie groupoids K and G\nhave the same Morita homotopy type if there exists a third groupoid J and essential\nhomotopy equivalences\nη\n\nν\n\nK ← J → G.\n2000 Mathematics Subject Classification. 22A22, 55M30, 18D05.\nc XXXX American Mathematical Society\n\n1\n\n\f2\n\nHELLEN COLMAN\n\nWe prove that the bicategory H of Lie groupoids, strict morphisms and strict homotopies admits a bicalculus of fractions that formally inverts the essential homotopy\nequivalences W . Using the techniques developed in [35] we obtain a new bicategory\nof Lie groupoids H(W −1 ) where the essential homotopy equivalences were formally\ninverted. Morita homotopy equivalences introduced above amount to isomorphisms\nin this bicategory.\nOur notion of Morita homotopy corresponds to the 2-arrows in the bicategory\nH(W −1 ). This deformation within the groupoid is closely related to the notion of\nG-path developed by Haefliger [17, 19]. We propose a modified version of a G-path\n(between two objects) that we call a multiple G-path (between two orbits). A Morita\nhomotopy determines multiple G-paths between the orbits. A multiple G-path is\nǫ\nσ\ndefined as a generalized map I ← I ′ → G where I and I ′ are certain groupoids\nassociated to the interval [0, 1]. Multiple G-paths will play a key role in defining\nthe integral curves of a gradient vector field in a Lie groupoid.\nBased on the Morita homotopy notion, we define a G-categorical subgroupoid in\nthe sense of Lusternik and Schnirelmann. A subgroupoid U is G-categorical if it can\nbe deformed by a Morita homotopy into a transitive groupoid. The groupoid LScategory of G, catG, is the minimal number of G-categorical subgroupoids required\nto cover G. When G is the unit groupoid over a manifold M , this number specializes\nto the classical LS-category of the manifold M .\nWe prove that catG is an invariant of the Morita homotopy type. Therefore,\ncatG is invariant under Morita equivalence and yields a well defined invariant for\norbifolds. Let G be an orbifold groupoid defining the orbifold X . The orbifold\nLS-category of X is defined as the groupoid LS-category of G, catX = catG.\nThe orbifold LS-category is a homotopy invariant that detects part of the complexity of the orbifold. It detects the existence of obstructions given by the twisted\nsectors to contract an open set, but somehow misses the \"weight\" of such obstructions.\nWe introduce a variant of the orbifold LS-category that we call the weighted\norbifold LS-category, wcatX . This numerical invariant also generalizes the classical\nLS-category for manifolds, if the orbifold is a manifold X then wcatX = catX. We\nprove that the weighted orbifold category is an invariant of orbifold homotopy type\nwhich relates to the orbifold category of the inertia orbifold.\nFinally we give a version of the Lusternik-Schnirelmann theorem for Lie groupoids.\nφ\nǫ\nIf G ← G ′ → R is a generalized map satisfying certain deformation conditions (D)\nthen\nX\ncatG ≤\ncatKc\nc∈R\n\nwhere Kc is the full subgroupoid over the critical points at the level c.\nWe show that if G is an orbifold groupoid defining a compact orbifold, then the\ndeformation conditions (D) are satisfied and we have that the LS-theorem holds for\norbifolds: If X is a compact orbifold and f : X → R is an orbifold map, then f has\nat least catX critical points.\nWhen counting a finite number of critical points in an orbifold, we face the\ndilemma of how to count. Let K be the critical groupoid. If K is a finite groupoid,\nwe can chose one isolated critical point xi in each orbit and we have that K is\nequivalent to a groupoid whose set of objects is {x1 , * * * , xn } and the set of arrows\nis the disjoint union of the isotropy groups K1 ⊔ * * * ⊔ Kn where the order of Ki is ki\n\n\fTHE LUSTERNIK-SCHNIRELMANN CATEGORY OF A LIE GROUPOID\n\n3\n\nand the number of conjugacy classes in Ki is ki′ (then ki = ki′ if Ki is abelian). By\nthe one hand we have that the cardinality of a groupoid of Baez and Dolan [4] and\nthe Euler characteristic of a finite category of Leinster [24] both give as a cardinality\n1\n1\n+ *** +\n. On the other hand the string theoretic\nof K the rational number\nk1\nkn\nEuler characteristic [15] gives as a cardinality of K the integer number k1′ + * * * + kn′ .\nOur weighted orbifold category is a lower bound for this latter cardinality.\nThis paper is organized as follows. Section 2 presents the notions of strong and\nMorita equivalence for strict morphisms between Lie groupoids. We describe in this\nsection some examples that will be studied further throughout the paper. Section\n3 is where we develop the notion of strict homotopy associated to a subdivision of\nthe interval I = [0, 1]. We recall the notion of G-path and introduce the multiple\nG-paths. We introduce the notion of essential homotopy equivalence and homotopy\npullback of groupoids. Section 4 is where we show that the bicategory of Lie\ngroupoids, strict morphisms and strict homotopies constructed in section 3 admits\na bicalculus of fractions that inverts the essential homotopy equivalences. We define\nour notion of Morita homotopy as the 2-arrows in this bicategory of fractions. In\nsection 5 we propose a notion of LS-category for Lie groupoids. We say that a\nsubgroupoid is G-categorical, in the sense of Lusternik and Schnirelmann, if there\nis a Morita homotopy between the inclusion and a morphism with image in a single\norbit. We define the LS-category for Lie groupoids and prove that it is invariant\nunder Morita homotopy. In particular, it is invariant under Morita equivalence and\nyields a well defined number for orbifolds. In section 6 we treat in detail this LS\ntheory for orbifolds. We describe the obstructions to deform an open set in terms\nof the orbifold structure of the twisted sectors and give estimates for the orbifold\nLS-category in terms of the categories of the twisted and untwisted sectors. We also\npropose the notion of weighted orbifold LS-category and prove that it is invariant\nunder Morita homotopy equivalence. Section 7 is where we give the preliminaries\nand prove the Lusternik-Schnirelmann theorem for orbifolds. Given a generalized\nφ\nǫ\nmap G ← G ′ → R we introduce a groupoid version of the classical deformation\nconditions. When the groupoid defines an orbifold, we can define the G-flow of\nthe gradient of (ǫ, φ) and its integral curves will be given by multiple G-paths.\nThese integral G-curves provide the tool to prove that the deformation conditions\nare satisfied for smooth maps on orbifold groupoids. We show that both catG and\nwcatG satisfy some monotonicity, additivity, deformation invariance and continuity\nproperties required to prove the theorem.\nAcknowledgements. I am grateful to André Haefliger, for suggesting to me the\nidea of developing a Lusternik-Schnirelmann theory for orbifolds. My thanks also\nto John Oprea and Dorette Pronk for their valuable comments and help.\n2. Recollections on Lie groupoids and equivalences\n2.1. Lie groupoids. Recall that a groupoid G is a small category in which each\narrow is invertible [28] [7]. Our notation for groupoids is that G0 is the space of\nobjects and G1 is the space of objects, with source and target maps s, t : G1 → G0 ,\nmultiplication m : G1 ×G0 G1 → G1 , inversion i : G1 → G1 , and object inclusion\nu : G0 ֒→ G1 .\nA Lie groupoid is a groupoid for which G1 and G0 are manifolds, s and t are\nsurjective submersions, and m, i and u are smooth [27].\n\n\f4\n\nHELLEN COLMAN\n\nThe set of arrows from x to y is denoted G(x, y) = {g ∈ G1 |s(g) = x and t(g) =\ny}. The set of arrows from x to itself, G(x, x), is a group called the isotropy group\nof G at x and denoted by Gx . The orbit of x is the set O(x) = ts−1 (x). The orbit\nspace |G| of G is the quotient of G0 under the equivalence relation: x ∼ y iff x and\ny are in the same orbit.\nWe will describe now various Lie groupoids that will appear throughout the\npaper.\n(1) Unit groupoid. Consider the groupoid G associated to a manifold M with\nG0 = G1 = M . This is a Lie groupoid whose arrows are all units, called\nthe unit groupoid and denoted G = u(M ).\n(2) Pair groupoid. Let G with G0 = M as before and consider G1 = M × M .\nThis is a Lie groupoid with exactly one arrow from any object x to any\nobject y, called the pair groupoid and denoted G = Pair(M ).\n(3) Point groupoid. Let G be a Lie group. Let • be a point. Consider the\ngroupoid G with G0 = • and G1 = G. This is a Lie groupoid with exactly\none object • and G is the manifold of arrows in which the maps s and t\ncoincide. We denote the point groupoid by •G .\n(4) Translation groupoid. Let K be a Lie group acting (on the left) on a\nmanifold M . Consider the groupoid G with G0 = M and G1 = K × M .\nThis is a Lie groupoid with arrows (k, x) from any object x to y = kx,\ncalled the translation or action groupoid and denoted G = K ⋉ M .\n(5) Holonomy groupoid. Let (M, F ) be a foliated manifold. Consider the\ngroupoid G with G0 = M and whose arrows from x to y on the same\nleaf L ∈ F are the holonomy classes of paths in L from x to y. There are\nnot arrows between points in different leaves. This is a Lie groupoid called\nthe holonomy groupoid and denoted G = Hol(M, F ).\nWe will denote 1 the trivial groupoid with one object and one arrow, 1 = u(•) =\nPair(•) = •• .\n2.2. Strong and Morita equivalence. From now on all groupoids will be assumed to be Lie groupoids.\nA morphism φ : K → G of groupoids is a functor given by two smooth maps\nφ : K1 → G1 and φ : K0 → G0 that together commute with all the structure maps\nof the groupoids K and G.\nA natural transformation T between two morphisms φ, ψ : K → G is a smooth\nmap T : K0 → G1 with T (x) : φ(x) → ψ(x) such that for any arrow h : x → y in\nK1 , the identity ψ(h)T (x) = T (y)φ(h) holds. We write φ ∼T ψ.\nA morphism φ : K → G of groupoids is an equivalence of groupoids if there\nexists a morphism ψ : G → K of groupoids and natural transformations T and T ′\nsuch that ψφ ∼T idK and φψ ∼T ′ idG . Sometimes we will refer to this notion of\nequivalence as a strong equivalence.\nA morphism ǫ : K → G of groupoids is an essential equivalence of groupoids if\n(i) ǫ is essentially surjective in the sense that\ntπ1 : G1 ×G0 K0 → G0\nis a surjective submersion where G1 ×G0 K0 is the pullback along the source\ns : G1 → G0 ;\n\n\fTHE LUSTERNIK-SCHNIRELMANN CATEGORY OF A LIE GROUPOID\n\n5\n\n(ii) ǫ is fully faithful in the sense that K1 is given by the following pullback of\nmanifolds:\nǫ\n/ G1\nK1\n(s,t)\n\n(s,t)\n\n\u000f\n\u000f\nǫ×ǫ\n/ G0 × G0\nK0 × K0\nThe first condition implies that for any object y ∈ G0 , there exists an object x ∈ K0\nwhose image ǫ(x) can be connected to y by an arrow g ∈ G1 . The second condition\nimplies that for all x, z ∈ K0 , ǫ induces a diffeomorphism K(x, z) ≈ G(ǫ(x), ǫ(z))\nbetween the submanifolds of arrows.\nFor general categories the notions of equivalence and essential equivalence coincide. This applies to the particular case in which the categories are groupoids.\nBut when some extra structure is involved (continuity or differentiability) these two\nnotions are not the same anymore. An essential equivalence implies the existence\nof the inverse functor using the axiom of choice but not the existence of a smooth\nfunctor.\nProposition 2.1. [32] Every equivalence of Lie groupoids is an essential equivalence.\nRemark 2.2. The converse does not hold for Lie groupoids.\nMorita equivalence is the smallest equivalence relation between Lie groupoids\nsuch that they are equivalent whenever there exists an essential equivalence between\nthem.\nDefinition 2.3. Two Lie groupoids K and G are Morita equivalent if there exists\na Lie groupoid J and essential equivalences\nǫ\n\nσ\n\nK ← J → G.\nThis defines an equivalence relation that we denote K ∼M G. In this case, it is\nalways possible to chose the equivalences ǫ and σ being surjective submersions on\nobjects [32].\nExample 2.4. Consider the Lie groupoid G whose manifold of objects is the disjoint\nunion of two open disks, G0 = D1 ⊔ D2 as shown in figure 1. The disk D1 is acted\non by Z3 = {1, ρ, ρ2 }. The manifold of arrows is the disjoint!union of three copies\n3\nG\nD1i ⊔ A ⊔ A′ ⊔ D2 . The\nof D1 , two annuli A and A′ and a copy of D2 , G1 =\ni=1\n\nsource map s : G1 → G0 is given by the projection D1i → D1 ⊂ G0 , the inclusions\nA → D1 ⊂ G0 and D2 → D2 ⊂ G0 and on the other annulus A′ is given by the\ntriple covering A′ → A2 ⊂ D2 !\n⊂ G0 . Target map t : G1 → G0 coincides with source\n3\nG\nD1i it is given by the action of Z3 , ρi : D1i → D1 ⊂ G0\nmap on D2 whilst in\ni=1\n\nand in the annuli A and A′ is given by the triple covering A → A2 ⊂ D2 ⊂ G0 and\nthe inclusion A → D1 ⊂ G0 respectively.\nNow consider the translation groupoid K = S 1 ⋉ S 3 defined by the action of S 1\non S 3 given by (v, w) 7→ (z 3 v, zw). The manifold of objects is G0 = S 3 and the\nmanifold of arrows is G1 = S 3 × S 1 . If we think of S 3 as the union of two solid tori\nas shown in figure 2, we have that the orbits of this action are circles of length 2π for\n\n\f6\n\nHELLEN COLMAN\n\ns\n\nt\n\ns\n\nt\n\ns\n\nt\n\ns\n\nt\n\nFigure 1.\n\n\u000f\n\nFigure 2.\np\npoints on the two cores of the tori and circles of length 2π 3kvk2 + kwk2 elsewhere.\nThis is a Seifert fibration on S 3 . The inclusion of two transverse disks to this Seifert\nfibration determines a functor ǫ : G → K which is an essential equivalence. Thus\nthe groupoids K and G are Morita equivalent.\n3. Homotopy\nWe will define now two notions of homotopy that will generalize the notions of\nstrong and Morita equivalence respectively.\nGiven a subdivision S = {0 = r0 ≤ r1 ≤ * * * ≤ rn = 1} of the interval I = [0, 1]\nconsider a groupoid IS whose manifold of objects is given by the following disjoint\n\n\fTHE LUSTERNIK-SCHNIRELMANN CATEGORY OF A LIE GROUPOID\n\nunion:\n\nn\nG\n\n7\n\n[ri−1 , ri ]\n\ni=1\n\nAn element in the connected component [ri−1 , ri ] will be denoted by (r, i). Then\nthe manifold of objects is (IS )0 = {(r, i)|r ∈ [ri−1 , ri ], i = 1, . . . , n}. The manifold\nof arrows of IS is given by the disjoint union:\n!\nn\nG\nG\n′\n[ri−1 , ri ]\n{r1 , * * * , rn−1 , r1′ , * * * , rn−1\n}\ni=1\n\nwhere\n\nn\nG\n\n[ri−1 , ri ] is the set of unit arrows and for each point ri in the subdivision\n\ni=1\n\nS two arrows were added: ri and its inverse arrow ri′ such that the source of ri is\n(ri , i) and its target is (ri , i + 1).\n***\n\nri\n>\n\n[\nri−1\n\n]\n\n[\n\nri < ri\nri−1\n\n]\n\n***\n\nri+1\n\nWe call 0 the trivial groupoid over {0} and 1 the trivial groupoid over {1}.\nLet φ, ψ : K → G be morphisms. We will say that φ is homotopic to ψ if there\nexists a subdivision S and a morphism H S : K × IS → G such that H0S = φ and\nH1S = ψ.\nThis defines a relation of equivalence between morphisms that we will call homotopy equivalence and that sometimes we will refer to it as strong or strict homotopy\nequivalence depending what feature we want to emphasize since we will introduce\na weaker version (in the same sense that an essential equivalence weakens a strong\nequivalence) and a generalized version of this notion (in the same sense that a\nMorita equivalence generalizes an essential equivalence).\nExamples 3.1.\n(1) A natural transformation T : φ → ψ determines an homotopy H S : K × IS → G over the subdivision S = {0 = r0 , r1 = 1/2, r2 = 1}.\nThe homotopy is given by\n(\nφ(x) if r ≤ 1/2 and i = 1,\nS\nH (x, (r, i)) =\nψ(x) if r ≥ 1/2 and i = 2.\non objects;\n(\nφ(k)\nH (k, u(r, i)) =\nψ(k)\nS\n\nif r ≤ 1/2 and i = 1,\nif r ≥ 1/2 and i = 2.\n\non units arrows of IS and H S (k, r1 ) = T (y)φ(k) for the arrow r1 : (1/2, 1) →\n(1/2, 2).\nTherefore, there exist a subdivision S and a morphism H S such that\nS\nH (x, 0) = φ(x), H S (x, 1) = ψ(x) and H S (k, 0) = φ(k), H S (k, 1) = ψ(k).\n(2) A morphism H : K × I → G, with I being the unit groupoid over the\ninterval I = [0, 1], such that H0 ∼ φ and H1 ∼ ψ determines a homotopy\nH S : K × IS → G over the subdivision S = {r0 = 0, r1 = 0, r2 = 0, r3 =\n1, r4 = 1, r5 = 1}. The original morphism H : K × I → G does not define\nan equivalence relation, since transitivity fails.\n\n\f8\n\nHELLEN COLMAN\n\n(3) An ordinary homotopy H : K × I → G such that H0 = φ and H1 = ψ\ndetermines an homotopy H S : K × IS → G over the subdivision S = {0 =\nr0 , r1 = 1}. The morphism H : K × I → G defines an equivalence relation\nbut fails to be invariant of Morita equivalence (it is not even invariant of\nstrong equivalence for groupoids).\nProposition 3.2. Let H : U × IS → G be a homotopy of the inclusion, H0 = iU .\nThen, there is an injection j : Gx → Gyr for all yr = H S (x, (r, i)).\nProof. The homotopy H S restricted to the connected component Ux × [0, r1 ] determines an ordinary homotopy, then Gx injects into GH(x,(r,1)) for all r ∈ [0, r1 ].\nThe isotropy groups GH(x,(r1 ,1)) and GH(x,(r1 ,2)) coincide, since there is an arrow\nr1 from (r1 , 1) to (r1 , 2). Then, we have a finite number of injections:\nGx ֌ GH(x,(r,1)) ֌ GH(x,(r1 ,1)) = GH(x,(r1 ,2)) ֌ GH(x,(r,2)) . . . ֌ GH(x,(rn ,n))\nand Gx injects into GH S (x,(r,i)) for all r ∈ [ri−1 , ri ] with i = 1, . . . , n.\n\n\u0003\n\nWe recall now the definition of G-path, due to Haefliger [18, 17, 19, 6]. For\nanother approach see also [25]. A G-path from x to y over the subdivision S = {0 =\nr0 ≤ r1 ≤ * * * ≤ rn = 1} of the interval [0, 1] is a sequence:\n(α1 , g1 , α2 , g2 , . . . , αn )\nwhere\n(1) for all 1 ≤ i ≤ n the map αi : [ri−1 , ri ] → G0 is a path with α1 (0) = x and\nαn (1) = y\n(2) for all 1 ≤ i ≤ n − 1 the arrow gi ∈ G1 satisfies:\ns(gi ) = αi (ri )\nt(gi ) = αi+1 (ri )\nα1\n\nx • /o /o /o o/ /•\n\ng1\n\n/\n\n•\n\n***\n\nαn\n\n• /o /o /o o/ /• y\n\nOur notion of homotopy H S : K × IS → G between H0S = φ and H1S = ψ\ndetermines for each x ∈ K0 a G-path over the subdivision S between the objects\nφ(x) and ψ(x) in G0 . In fact, it determines many more paths in G1 other than\nthe one defined by the unit arrows. If we think of a G-path as a morphism from\nsome version of the interval I to G, we have that the Haefliger G-paths correspond\nto morphisms σ : IS → G, where the groupoid IS is the one constructed above.\nRemark 3.3. A homotopy H S : K × IS → G determines a G-path H1Sx : IS → G\nwhere 1x is the trivial groupoid over x ∈ K0 .\nNote that thinking of a G-path as a morphism σ from IS to G, the image of the\narrows in IS by σ is almost entirely contained in u(G0 ) since most of the arrows\nin IS are units, with the only exception of the arrows {r1 , * * * , rn−1 } and their\ninverses. In other words, we can not fill the space G1 with paths of arrows given by\nthe G-paths. This is going to be a very relevant problem when we try to integrate a\nvector field. Motivated by these considerations, we propose the notion of multiple\nG-path.\nTo define the several branches coming into a multiple G-path we need to introduce\nseveral copies of each subinterval in the subdivision S. We define a groupoid IS′\nassociated to the interval I and the subdivision S in the following way. Given a\n\n\fTHE LUSTERNIK-SCHNIRELMANN CATEGORY OF A LIE GROUPOID\n\n9\n\nsubdivision S = {0 = r0 ≤ r1 ≤ * * * ≤ rn = 1} of the interval I = [0, 1] consider the\nmanifold of objects given by the disjoint union:\nmi\nn G\nG\n\n[ri−1 , ri ]j\n\ni=1 j=1\n\nwhere the extra copies of each interval are indexed by j.\n[\n0\n\n]\n⊔\n\n⊔\n\n***\n\n[\n\n⊔\n\nrn−1\n\nr1\n\n..\n.\n\n]\n⊔\n\n1\n\n..\n.\n\n..\n.\n\n⊔\n\n⊔\n\n[\n\n]\n\n[\n\n]\n\n0\n\nr1\n\nrn−1\n\n1\n\nAn element in the connected component [ri−1 , ri ]j will be denoted by (r, i, j). Then\nthe manifold of objects is\n(IS′ )0 = {(r, i, j)|r ∈ [ri−1 , ri ], j = 1, . . . , mi , i = 1, . . . , n}.\nThe manifold of arrows of IS′ is generated by the disjoint union of:\nG\n(1)\n[ri−1 , ri ]j the set of unit arrows;\n(2)\n\ni,j\nG\n\nri the set of arrows connecting the jumps at the subdivision points ri ,\n\ni\n\ni.e. the source and target of the arrow ri are s(ri ) = (ri , i, 1) and t(ri ) =\n(r\nGi , i + 1, 1) and\n[ri−1 , ri ]j the set of arrows between the different copies [ri−1 , ri ]j of each\n(3)\ni,j\n\nsubinterval, i.e. the source and target of the arrow rij ∈ [ri−1 , ri ]j are\ns(rij ) = (r, i, j) and t(rij ) = (r, i, j + 1).\nri\n>\n\n[\n\n[\n\n]\n\n]\n\n<\nri−1\n\n***\n\nrij\n\n\u000f\u000f\u000f\n\n\u000f\n\n[\n\n]\n\nDefinition 3.4. A multiple G-path over a subdivision S is a morphism σ : IS′ → G.\nNote that a G-path in the sense of Haefliger is a multiple G-path over the same\nsubdivision by taking j = 1 for all subintervals and σ((r, i)) = αi (r) on objects;\nσ(ri ) = gi on arrows ri and σ(u(r, i)) = u(αi (r)) for unit arrows.\nWe can think of a multiple G-path as a G-path between orbits or as a path\nbetween orbit subgroupoids. In this spirit, we will say that the initial subgroupoid\nof the path is σ(0′ ) and the end subgroupoid is σ(1′ ). Where 0′ and 1′ are the\nfull subgroupoids over the orbits of 0 and 1, which in general will not be trivial\ngroupoids.\n\n\f10\n\nHELLEN COLMAN\n\nx\ny\n\nFigure 3.\n\nx\ny\n\n\u001ax\n\u001a2x\n\nFigure 4.\nExample 3.5. Consider the Lie groupoid G given in example 2.4 where G0 =\nD1 ⊔ D2 . We show in figure 3 the image in G0 of a Haefliger G-path between the\npoints x and y given by the map σ : IS → G for the subdivision S = {0, 21 , 1}.\nIn figure 4 we see the image of a multiple G-path between the orbits of x and\ny given by τ : IS′ → G over the same subdivision. The manifold of objects of IS′\nis now a disjoint union of three copies of the interval [0, 21 ] plus one copy of the\ninterval [ 21 , 1].\nRemark 3.6. A homotopy H S : K×IS → G, when restricted to the full subgroupoid\nX over an orbit O(x), defines a multiple G-path between the orbit subgroupoids\nH(X, 0) and H(X, 1). If H S is a homotopy between φ and ψ, then for all x ∈ K0 ,\nthe S-homotopy defines a multiple G-path between the orbits of φ(x) and ψ(x).\nSometimes we will denote a multiple G-path by\nj\n\nn−1\nσ = (αj11 , g1 , αj22 . . . , αn−1\n, gn−1 , αjnn )\n\nwhere (α11 , g1 , α12 . . . , α1n−1 , gn−1 , α1n ) is a G-path and\n1\n1\n(α11 , g1 , α12 , . . . , hij gi−1 , αji , gi h−1\nij , . . . , αn−1 , gn−1 , αn )\n\nis a G-path for each j = 1, . . . , mi and each i = 1, . . . , n.\n3.0.1. Essential homotopy equivalences.\nDefinition 3.7. A morphism η : K → G of groupoids is an essential homotopy\nequivalence of groupoids if there exists an S-homotopy equivalence h : K → L and\nan essential equivalence ǫ : L → G such that η ≃S ǫh.\nK?\n??\n??\nh ??\n\u001f\n\nη\n\nL\n\n/\n?G\n\u007f\n\u007f\u007f\n\u007f\u007fǫ\n\u007f\n\u007f\n\n\fTHE LUSTERNIK-SCHNIRELMANN CATEGORY OF A LIE GROUPOID\n\n11\n\nThis implies that for any object y ∈ G0 , there exists an object x ∈ K0 whose\nimage η(x) can be connected to y by a concatenation of paths and arrows. Also η\ninduces a homotopy equivalence |η| between the orbit spaces.\nRemark 3.8. If η : K → G is an essential homotopy equivalence, then there is an\ninjection between the corresponding isotropy groups Kx and Gη(x) .\nExample 3.9. Consider the inclusion functor η : •Z2 → Hol(M, FS ) where FS\nis the Seifert fibration of the Möbius band M . Let x = η(•) be a fix point in\nthe central fiber in M . Consider the inclusion functors h : •Z2 → Z2 ⋉ I and\nǫ : Z2 ⋉ I → Hol(M, FS ). The functor h is a homotopy equivalence with homotopic\ninverse the constant map and ǫ is an essential equivalence. We have that η = ǫh\nis an essential homotopy equivalence. Note that in this case η is neither a (strong)\nhomotopy equivalence nor an essential equivalence.\nIt is clear that essential equivalences as well as (strong) homotopy equivalences\nare essential homotopy equivalences.\nProposition 3.10.\n(1) An essential equivalence is an essential homotopy equivalence.\n(2) A homotopy equivalence is an essential homotopy equivalence.\nProposition 3.11. If ηφ ≃S ηψ and η is an essential homotopy equivalence, then\nφ ≃S ψ.\nProof. Since η ≃S ǫh, we have that ǫhφ ≃S ǫhψ. Then hφ ≃S hψ because ǫ is an\nessential equivalence. If g is the homotopic inverse of h, we have that ghφ ≃S ghψ.\nThus, φ ≃S ψ.\n\u0003\nLet φ : K → G and ψ : J → G be morphisms of Lie groupoids and S a subdivision\nof the interval I = [0, 1]. Let PS (G) be the space of G-paths over the subdivision S.\nDefinition 3.12. The groupoid homotopy pullback\ngroupoid whose manifold of objects is\n\nPS = K ×hS J is the Lie\n\n(PS )0 = {(x, σ, y)|x ∈ K0 , y ∈ J0 , σ ∈ PS (G) with σ(0) = φ(x) and σ(1) = ψ(y)}\nand whose manifold of arrows is\n(PS )1 = {(k, σ, j)|k ∈ K1 , j ∈ J1 , σ ∈ PS (G) with σ(0) = φ(s(k)) and σ(1) = ψ(t(j))}\nand source and target maps are given by: s(k, σ, j) = (s(k), σ, s(j)) and t(k, σ, j) =\n(t(k), φ(j)σφ(k)−1 , t(j)).\nThe groupoid homotopy pullback is well defined (up to homotopy) whenever one\nof the maps φ or ψ is homotopic to a submersion on objects.\nWe will show the construction of the manifold of objects (PS )0 for a subdivision\nS = {t0 = 0, t1 , t2 , t3 = 1} by a sequence of pullbacks and homotopy pullbacks of\nmanifolds.\nWe recall first the definition of homotopy pullback of manifolds [29]. Given two\nmaps f : X → Z and g : Y → Z, the homotopy pullback is the space\nX ×h Y = {(x, α, y)|x ∈ X, y ∈ Y and α is a path between f (x) and g(y)}.\nThe following diagram commutes up to homotopy and it is universal (up to homotopy) with this property.\n\n\f12\n\nHELLEN COLMAN\n\nX ×h Y\n\np1\n\n/X\n\np2\n\nf\n\n\u000f\nY\n\ng\n\n\u000f\n/Z\n\nRemark 3.13. If f is homotopic to a submersion, then the homotopic pullback\nX ×h Y is a manifold homotopic to the ordinary pullback.\nConsider the following ordinary pullbacks of manifolds:\nK0 ×G0 G1\n\np1\n\n/ K0 and J0 ×G0 G1\n\np2\n\np′2\n\nφ\n\n\u000f\nG1\n\n\u000f\n/ G0\n\ns\n\np′1\n\n/ J0\nψ\n\n\u000f\nG1\n\nt\n\n\u000f\n/ G0\n\nand the following homotopy pullback of manifolds:\n/ K0 ×G0 G1\n\n(PS )0\n\np2\n\n\u000f\nG1\n\np\n\nt\n\n\u000f\n\nJ0 ×G0 G1\n\np′2\n\n/ G1\n\ns\n\n\u000f\n/ G0\n\nWe have that (PS )0 is the manifold\n{(x, g, α, h, y)|α is a path between t(g) and s(h) with φ(x) = s(g) and ψ(y) = t(h)}.\nAnalogously, we can define the manifold of arrows (PS )1 as the homotopy pullback\n(K1 ×G0 G1 ) ×h (J1 ×G0 G1 ) = K1 ×G0 G1 ×h G1 ×G0 J1 .\nIf (k, g, α, h, j) is an arrow from (x, g, α, h, y) to (x′ , gφ(k)−1 , α, ψ(j)h, y ′ ) and\n(k , g ′ , α, h′ , j ′ ) is an arrow from (x′ , g ′ , α, h′ , y ′ ) to (x′′ , g ′ φ(k ′ )−1 , α, ψ(j ′ )h′ , y ′′ ),\nthe composition of arrows is given by\n′\n\n(k ′ , g, α, h, j ′ ) ◦ (k, g ′ , α, h′ , j) = (k ′ k, g, α, h, j ′ j)\ng\n\nα\n\n/o /o /o /o /•/? h/\n•\n\u007f\u000f•\n/?/ ?\n\u007f\n??\n\u007f\u000f\u000f\n\u007f\n/\n// ??\u001f ? \u000f ψ(j)\nφ(k) \u000f\n\u007f\u007f? \u000f\n\u007f\u007f ′ \u000f\u000f\n// ′ ??\n\u007f\n?\n\u007f g \u000fG \u000f\nh/\n\u007f\n• \u000f\u000f\n/\u0017 / •\n//\n\u000f\u000f\n// \u000f ψ(j ′ )\nφ(k′ ) \u000f \u000f\u000f\n//\n′′\n\u000f\u000f\u000f g′′\nh\n•\n•\nWe can generalize the construction to obtain the groupoid homotopy pullback\nPS corresponding to the subdivision S = {0 = r0 ≤ r1 ≤ * * * ≤ rn = 1} by\n•\n\n/\n\n\fTHE LUSTERNIK-SCHNIRELMANN CATEGORY OF A LIE GROUPOID\n\n13\n\niterating n homotopy pullbacks. Consider the homotopy pullback K0 ×h Gn−1 =\nn−1\nz\n}|\n{\nK0 ×h G1 ×h * * * ×h G1 of length n given by the following diagram:\n/ K0 ×h Gn−2\n1\n\nK0 ×h Gn−1\n\n/ ***\n\n/ K0 ×h G1\n\u000f\nG1\n\n/ K0\n\ns\n\n\u000f\n/ G0\n\nt\ns\n\n..\n\u000f\nG1\n\ns\n\n\u000f\n/ G0\n\n.\n\n/\n\nt\n\n\u000f\nG1\n\ns\n\n\u000f\n/ G0\n\nThen, we have that\n(PS )0 = K0 ×hG0 Gn−1 ×hG0 J0\nand\n(PS )1 = K1 ×hG0 Gn−1 ×hG0 J1 .\nWe will show that the following diagram of groupoids commutes up to strong\nhomotopy:\nπ1\n/K\nPS\nπ3\n\n\u000f\nJ\n\nφ\nψ\n\n\u000f\n/G\n\nConsider the homotopy H S : PS × IS → G given by H S ((x, σ, y), (r, i, j)) =\nσ((r, i, j)) on objects and H S ((k, σ, j), ri ) = σ(ri ) on arrows (see remark 3.3). We\nhave that H0S = φπ1 and H1S = ψπ3 .\nThe homotopy pullback of groupoids satisfies the following universal property.\nFor any groupoid A and morphisms δ : A → K and γ : A → J with φδ ≃H S\nψγ there exists a morphism ξ : A → PS such that both triangles commute up to\nhomotopy:\nA\nδ\n\nξ\n\nγ\n\nPS\n\n#\nπ1\n\nπ3\n\n\u001d \u000f\nJ\n\n/K\n\nφ\nψ\n\n\u000f\n/G\n\n\f14\n\nHELLEN COLMAN\n\nWe define ξ : A → PS by ξ(w) = (δ(w), H1Sw , γ(w)) on objects and ξ(a) = (δ(a), H1Sw , γ(a))\non arrows, where 1w is the trivial groupoid over w.\nNote that the groupoid homotopy pullback PS is defined for each subdivision S\nof the interval I = [0, 1].\nRemark 3.14. If S = {0 = r0 ≤ r1 ≤ * * * ≤ rn = 1} is a subdivision of I = [0, 1],\nthen for all subdivision S ′ ⊃ S we have:\n(1) If φ ≃H S ψ, then φ ≃H S′ ψ.\n(2) There exists a morphism ξ : PS → PS′ such that π1′ ξ = π1 and π3′ ξ =\nπ3 . Since φπ1 ≃H S ψπ3 , then φπ1 ≃H S′ ψπ3 and the following diagram\ncommutes up to S ′ -homotopy:\nPS\n\nπ1\nξ\n\n!\nπ3\n\nPS ′\n\nπ3′\n\n\u001d \u000f\nJ\n\nπ1′\n\n#\n/K\n\n⇓S ′\n\nφ\n\n\u000f\n/G\n\nψ\n\nProposition 3.15. If there is a subdivision S such that the following diagram\ncommutes up to S-homotopy:\nη\n/G\nK?\n?? ≃ O\n?? S h\nǫ ??\n\u001f\nL\n\nwhere ǫ is an essential equivalence and h is a homotopy equivalence, then η : K → G\nis an essential homotopy equivalence.\nProof. Let g be the homotopic inverse of h. Then, the following triangle commutes\nup to S-homotopy:\nG>\n>>\n>>id\ng\n≃S >>\n\u000f\n\u001f\nL h /G\nConsider the following fibered product of groupoids:\nG ×L K\ng′\n\n\u000f\nK\n\nǫ′\n∼\nǫ\n\n/G\ng\n\n\u000f\n/L\n\nThe square above commutes up to a natural transformation, then it commutes\nup to S-homotopy and has the universal property. Since η ≃S hǫ, we have that the\nfollowing diagram commutes up to S-homotopy:\n\n\fTHE LUSTERNIK-SCHNIRELMANN CATEGORY OF A LIE GROUPOID\n\nK\n\n15\n\nη\nξ\n\n#\nG ×L K\n\nid\n\nǫ′\n\n/% G\n>>\n> id\ng >>\n>>\n\u001e\n\u000f\n/L\n/G\nh\n\ng′\n\n\u001f \u000f\nK\n′\n\n′\n\nTherefore, ǫ ξ ≃S η and g ξ ≃S\n\nid.\n\nǫ\n\nWe have that:\n\n′\n\nηg ≃S hǫg ′ ≃S hgǫ′ ≃S\n\nidǫ\n\n′\n\n≃ S ǫ′\n\nand also:\nηg ′ ≃S η idK g ′ ≃S ηg ′ ξg ′ ≃S ǫ′ ξg ′ .\nBy proposition 3.11, we have that id ≃S ξg ′ and ξ is the homotopic inverse of\ng ′ . Then η ≃S ǫ′ h′ with ǫ′ and essential equivalence and h′ = ξ a homotopy\nequivalence.\n\u0003\nLemma 3.16. If ǫ is an essential equivalence and g is an S-homotopy equivalence,\nthen the homotopic pullback\nPS\n\nǫ′\n\n/J\n\ng′\n\ng\n\n\u000f\n\u000f\nǫ\n/G\nL\nexists and g ′ is an S-homotopy equivalence as well.\nProof. Since ǫ is an essential equivalence, the pullback PS exists. Let f : G → J be\nthe homotopic inverse of g, then f g ≃S idJ and gf ≃S idG . Consider the following\npullbacks:\nPS′\n\nǫ′′\n\n/G\n\nf′\n\n\u000f\nPS\n\nf\nǫ\n\n\u000f\n/J\n\n′\n\ng′\n\ng\n\n\u000f\n\u000f\nǫ\n/G\nL\nBy the universal property of the large square, there exists ξ : L → PS′ such that the\nfollowing diagram commutes up to S-homotopy:\nL\n\nǫ\nξ\n\nid\n\nPS′\n\nǫ′′\n\n#\n/G\n\ng′ f ′\n\n\u001c \u000f\nL\n\nid\nǫ\n\n\u000f\n/G\n\n\f16\n\nHELLEN COLMAN\n\nThen g ′ f ′ ξ ≃S\nWe have that\n\nid\n\nand ǫ′′ ξ ≃S ǫ. We will see that f ′ ξ is the homotopic inverse of g ′ .\n\nǫ′ f ′ ξg ′ ≃S f ǫ′′ ξg ′ ≃S f ǫg ′ ≃S f gǫ′ ≃S ǫ′ .\nBy proposition 3.11, f ′ ξg ′ ≃S id and g ′ is a homotopy equivalence.\n\n\u0003\n\nProposition 3.17. If η and ν are essential homotopy equivalences, then νη is an\nessential homotopy equivalence as well.\nProof. We have that η ≃S ′ ǫh and ν ≃S ′′ σf with ǫ and σ being essential equivalences and h and f homotopy equivalences. Consider the following homotopic\npullback, where S is a refinement of S and S ′ :\nPS\n\ng′\n\n/A\n\nǫ′\n\nǫ\n\n\u000f\n\u000f\ng\n/G\nB\nwhere g is the homotopic inverse of f . By lemma 3.16, we have that g ′ is a homotopy\nequivalence. Then, the following diagram commutes up to S-homotopy:\nK?\n??\n??\nh ??\n\u001f\n\nη\n\nν\n/L\n/\n? G _??\n\u007f\n\u007f?\n?\n\u007f\n\u007f\n??\n\u007f\n\u007f\n\u007f\u007fǫ\n\u007f\u007fσ\ng ??\n\u007f\u007f\n\u007f\u007f\nB\nA _?\n??\n\u007f?\n??\n\u007f\u007f\n\u007f\n??\n\u007f ′\ng′\n\u007f\u007f ǫ\nPS\n\nLet h′ be the homotopic inverse of g ′ . Then, νη ≃S σǫ′ h′ h where σǫ′ is an essential\nequivalence and hh′ is a homotopy equivalence.\n\u0003\nWe can pull back the decomposition given in proposition 3.15 and we have the\nfollowing\nProposition 3.18. If ν : K → G is an essential homotopy equivalence, then there\nis a subdivision S such that the morphism π3 : PS → J is an essential homotopy\nequivalence as well.\nDefinition 3.19. A Lie groupoid K is Morita homotopy equivalent to G if there\nexists a Lie groupoid L and essential homotopy equivalences\nη\n\nν\n\nK ← L → G.\nNote that it is possible to choose these essential homotopy equivalences being\nhomotopic to surjective submersions on objects.\nBy using two homotopy pullbacks of groupoids and proposition 3.18, it is easy\nto see that Morita homotopy equivalence is a relation of equivalence.\n4. The Morita homotopy bicategory of Lie groupoids\nWe will introduce in this section a bicategory whose objects are Lie groupoids\nand where Morita homotopy equivalence amounts to equivalence of objects. We\nfollow a bicategorical approach as emphasized by Landsman in [22, 23].\n\n\fTHE LUSTERNIK-SCHNIRELMANN CATEGORY OF A LIE GROUPOID\n\n17\n\n4.1. Bicategories of fractions. Recall that a bicategory B consists of a class of\nobjects, morphisms between objects and 2-morphisms between morphisms together\nwith various ways of composing them. A 2-morphism is a 2-equivalence if it is\ninvertible in B whereas a morphism is an equivalence if it is invertible up to a\n∼\n2-equivalence in B. We have that H : φ ⇒ ψ is a 2-equivalence in B if there exists\n∼\nG such that HG = id and GH = id, and φ : K → G is an equivalence in B if there\n∼\n∼\nexists ψ such that φψ ⇒ id and ψφ ⇒ id.\nWe can compose 2-morphisms in two ways called horizontal and vertical composition.Vertical composition is strictly associative whereas horizontal composition is\nonly associative up to 2-equivalence (associator). The unit laws for morphisms hold\nup to 2-equivalences (left and right unit constrains). Associator and unit constrains\nare required to be natural with respect to their arguments and verify certain axioms\n[5].\nGiven a bicategory B and a subset A ⊂ B1 of morphisms satisfying certain\nconditions, there exists a bicategory B(A−1 ) having the same objects as B but\ninverse morphisms of morphisms in A have been added as well as more 2-morphisms.\nThis new bicategory is called a bicategory of fractions of B with respect to A and was\nconstructed by Pronk in [35]. The bicategory of fractions B(A−1 ) is characterized\nby the universal property that any morphism F : B → D sending elements of A\ninto equivalences factors in a unique way as F = F̃ ◦ U\nU\n\n/ B(A−1 )\nw\nww\nF www\n\u000f {www F̃\nD\n\nB\n\nThe following conditions are needed on A to admit a bicalculus of right fractions\n[35]:\nBF1 All equivalences are in A.\nBF2 If φ and ψ are in A, then φψ ∈ A.\nBF3 For all η : J → G and φ : K → G with η ∈ A there exists an object P and\nmorphisms ν : P → K and ψ : P → J with ν ∈ A such that the following\nsquare commutes up to a 2-equivalence:\nP\n\nψ\n\n/J\nη\n\nν\n\n\u000f\nK\n\nφ\n\n\u000f\n/G\n\nBF4 If H : ηφ ⇒ ηφ is a 2-morphism with η ∈ A then there exists a morphism\nν ∈ A and a 2-morphism F : φν ⇒ φν such that H * ν = η * F .\n∼\nBF5 If there is a 2-equivalence η ⇒ ν with ν ∈ A then η ∈ A.\nProposition 4.1. The set of Lie groupoids, morphisms and (homotopy classes of )\nstrong homotopies as 2-morphisms forms a bicategory H.\n′\n\nProof. Strong homotopies H S : K×IS → G and H ′S : K×IS ′ → G can be composed\nr ′ +1\nvertically by taking the subdivision S ′′ = {0 = r0 ≤ r21 ≤ * * * ≤ r2n , 02 , ≤ * * * ≤\n′\nrm\n+1\n2\n\n= 1}. We take homotopy classes of homotopies to assure associativity of the\nvertical composition.\n\u0003\n\n\f18\n\nHELLEN COLMAN\n\nWe will formally invert the set of essential homotopy equivalences W .\nProposition 4.2. The set W of essential homotopy equivalences allows a bicalculus\nof right fractions.\nProof. Condition BF1 follows from proposition 3.10. Condition BF2 follows from\nproposition 3.17. Condition BF3 follows from proposition 3.18. Condition BF4\nfollows from proposition 3.11. Finally, if η ⇒ ν is a strong homotopy equivalence\nand η is an essential homotopy equivalence, then ν ≃S η ≃S hǫ and ν is an essential\nhomotopy equivalence as well.\nTherefore, there exists a bicategory of fractions H(W −1 ) inverting the essential\nhomotopy equivalences.\n\u0003\n4.2. The bicategory H(W −1 ). The objects of H(W −1 ) are Lie groupoids. The\n1-morphisms from K to G are formed by pairs (η, φ)\nη\n\nφ\n\nK←J →G\nsuch that η is an essential homotopy equivalence. The 1-morphisms (η, φ) in this\nbicategory will be called generalized homotopy maps. If ǫ is an essential equivalence,\nthen (ǫ, φ) is called a generalized map.\nA 2-morphism from (η, φ) to (η ′ , φ′ ) is given by the following diagram:\nJO @\n@@ φ\n~~\n@@\n~\nu\n@@\n~~\n~\n@\u001f\n~\n~~\nK `@ \u001e\u001e \u0013 \u001e\u001e F S L H S \u0013 ? G\n@@\n~\n@@\n~~\nv ~~\n@\nη ′ @@ \u000f ~~~ φ′\nJ′\nη\n\nwhere L is a Lie groupoid, u and v are essential homotopy equivalences and F S :\nηu ⇒ η ′ v and H S : φu ⇒ φ′ v are strong homotopy equivalences.\nThe notion of homotopy we propose corresponds to 2-morphisms in this bicategory H(W −1 ).\nDefinition 4.3. Two generalized homotopy maps (η, φ) and (η ′ , φ′ ) are Morita\nhomotopic if there is a 2-morphism between them.\nIn this case, we write (η, φ) ≃ (η ′ , φ′ ) and we say that there is a Morita homotopy\nbetween (η, φ) and (η ′ , φ′ ).\nIn particular, when η and η ′ are essential equivalences, we have a notion of\nhomotopy for generalized maps and when they are identities, we have a notion of\nhomotopy for strict maps.\nTwo objects K and G are equivalent in H(W −1 ) if there are morphisms (η, φ)\nfrom K to G and (θ, ψ) from G to K such that (η, φ) ◦ (θ, ψ) is Morita homotopic\nto the identity (idG , idG ) and (θ, ψ) ◦ (η, φ) ≃ (idK , idK ).\nProposition 4.4. A morphism (η, φ) is an equivalence in H(W −1 ) if and only if\nφ is an essential homotopy equivalence. In this case, the inverse of (η, φ) is the\nmorphism (φ, η).\nIn other words, the definition of Morita homotopy equivalence in subsection 3.19\namounts to equivalence of objects in the bicategory H(W −1 ). So, we write K ≃ G\n\n\fTHE LUSTERNIK-SCHNIRELMANN CATEGORY OF A LIE GROUPOID\n\n19\n\nfor equivalence of objects in H(W −1 ). The Morita homotopy type of G is the class\nof G under the equivalence relation ≃.\nExample 4.5. The holonomy groupoid G = Hol(M, FS ) of the Seifert fibration\non the Möbius band has the same Morita homotopy type than the point groupoid\nK = •Z2 since we have\nη\nν\n•Z2 ← Z2 ⋉ I → Hol(M, FS )\nwhere η and ν are essential homotopy equivalences. The homotopic inverse is the\nη\nν\ngeneralized map Hol(M, FS ) ← Z2 ⋉ I → •Z2 . Note that J = Z2 ⋉ I is Morita\nequivalent to G = Hol(M, FS ) since the inclusion ν = iJ is an essential equivalence,\nbut the groupoids K and G are not Morita equivalent.\nWe show now that the Morita homotopy type is invariant under Morita equivalence.\nProposition 4.6. If K ∼M G, then K ≃ G.\nProof. If K and G are Morita equivalent, then there is Lie groupoid L and essential\nequivalences\nη\nν\nK ← L → G.\nThe morphisms η and ν are also essential homotopy equivalences (see proposition\n3.10). Then the morphisms (η, ν) and (ν, η) are inverse up to equivalence and K is\nequivalent to G in the bicategory H(W −1 ).\n\u0003\nRemark 4.7. A Morita homotopy equivalence K ≃ G induces a Morita equivalence\nbetween the homotopy groupoids K∗ ∼M G ∗ . If (η, ν) is a Morita equivalence, then\n(η, ν) is a 1-homotopy equivalence in the sense of [10].\nWe will give an explicit description of the horizontal and vertical composition\nη\nφ\nin this bicategory. The horizontal composition of 1-morphisms K ← J → G and\nψ\nν\nG ← J ′ → L is given by the diagram\nPS ?\n??\n\u007f\u007f\n??\n\u007f\n\u007f\n??\n\u007f\n\u001f\n\u007f\u007f\u007f\n\u001f\u001f \u001f\u001f S\nJ ?\nJ′?\n\u0013\n?? φ\n?? ψ\n\u007f\nη \u007f\u007f\u007f\n\u007f\nν \u007f\n??\n??\n\u007f\n\u007f\n??\n?? \u007f\u007f\n\u007f\n\u007f\u007f\u007f\n\u001f\n\u001f \u007f\u007f\nG\nK\nL\nand the vertical composition of the 2-arrows\nCO ?\n\u007f\u007f ??? φ\n\u007f\n??\n\u007f\nu\n??\n\u007f\u007f\n\u007f\u007f\n\u007f\n\u001f\n\u001e\n\u001e\nK _? \u001e \u0013 \u001e S L S \u0013 ? G\n??\n\u007f\u007f\n??\n?? v \u007f\u007f\u007f ′\n′\n? \u000f \u007f\u007f φ\nη\nD\nis given by the diagram\nη\n\nDO @\n~~ @@@ φ′\n~\n~\nu′ @@@\n~~\n@\u001f\n~~ ~\nK `@\u001e\u001e \u0013 \u001e\u001e S ′ L′ S ′ \u0013 ? G\n@@\n~\n@@\n~~\n@@ v′ ~~~ ′′\n′′\nη\n@ \u000f ~~ φ\nE\nη′\n\n\f20\n\nHELLEN COLMAN\n\nC\nss O IIII\nss\nII\ns\nu\nII\nss\nII\nss\ns\nIIφ\nη ss\ns\nII\nL\ns\n=\n@@\ns\nII\n{\ns\n{\ns\n@\nII\n{\n@@v\nss\n{\nII\ns\n{\n@\ns\n{\nII\n@\ns\n{\n@\ns\nI$\n{\n\u001f\n\u001f\nyss\n\u001e\u001e\n\u001f\n\u001f\n′′\n′′\n′′ \u001e \u001e\nS\nS\nD\nK eJJ\nS \u001e \u001e PS ′′ C\n\u0013\n?\nv: G\n\u0013\n\u0013\nJJ\nCC\nvv\n~~\nJJ\nv\n~\nC\nv\nCC\n~\nJJ\nvv\nCC\n~~ ′\nJJ\nvv\nJJ\n! ~~ u\nv\nv\nJJ\nvv\nL′\nJJ\nvv φ′′\nη ′′\nJJ\nv\nv\nJJ\n′\nvv\nJJ\nJJ v vvvv\nJ \u000f v\nE\nwhere S ′′ = S ∪ S ′ .\nRemark 4.8. If the morphisms (ǫ, φ) and (δ, ψ) are generalized maps, the composition given by the fibered product groupoid K ← J ′ ×G J → L is Morita homotopic\nto this horizontal composition in the bicategory H(W −1 ). Since φp1 ∼ ψp3 we have\nthat φp1 ≃S ψp3 and by the universal property of the homotopy pullback, there\nexists a map ξ : J ′ ×G J → PS such that the following diagram commutes up to\nhomotopy:\nJ ′ ×G J\np1\nξ\n\n\u001f\np3\n\nPS\n\nπ1\n\nπ3\n\n\u001b \u000f\nJ\n\n#\n\n/ J′\nν\n\nφ\n\n\u000f\n/G\n\ntherefore there is a 2-morphism between the generalized homotopy maps K ←\nJ ′ ×G J → L and K ← PS → L given by the following diagram:\n\nKo\n\nη\n\nJ ′ ×G J\nHH\nv\nHH p1\np3 vv\nHH\nv\nv\nHH\nv\nv\nH$\nv\nv{\n′\nξ\nJ cHH \u0013\n\u0013 u: J\nHH\nu\nHH\nuu\nH\nuuπ1\nπ3 HHH\nu\n\u000f uu\nPS\n\nψ\n\n/L\n\nThen, when the generalized homotopy maps are generalized maps, we can set the\ngroupoid fibered product as our chosen homotopy pullback.\nǫ\n\nσ\n\nRemark 4.9. We can think of a multiple G-path as a generalized map I ← IS′ → G\nsince the map ǫ defined in the obvious way is an essential equivalence. Then, two\n\n\fTHE LUSTERNIK-SCHNIRELMANN CATEGORY OF A LIE GROUPOID\nǫ\n\nǫ′\n\nσ\n\n21\n\nσ′\n\nmultiple G-paths I ← IS′ → G and I ← IS′ ′ → G are homotopic if there is a\ncommutative diagram:\nIS′\n~ O @@@\nǫ ~~\n@@σ\n~\nu\n@@\n~~\n@\u001f\n~\n\u007f~\n′\nI `@ \u001e\u001e \u0013 \u001e\u001e H IS ′′ H ′ \u0013 > G\n@@\n}}\n@@\n}}\nv\n@\n}\n} σ\nǫ′ @@\n\u000f }}\nIS ′\nwhere S ∪ S ′ ⊂ S ′′\n5. Lusternik-Schnirelmann category\n5.1. Categorical sets. A submanifold U ⊂ G0 is invariant if t(s−1 (U )) ⊂ U .\nThe restricted groupoid U to an invariant submanifold U ⊂ G0 is the full groupoid\nover U . In other words, U0 = U and U1 = {g ∈ G1 |s(g), t(g) ∈ U }. We write\nU = G|U ⊂ G.\nA restricted groupoid G|O over an orbit O will be called an orbit groupoid and\ndenoted by OK , where K = Gx is the isotropy group of x for any x ∈ O.\nc\nǫ\n→ G such\nA generalized constant map from K to G is a generalized map K ←\n− K′ −\nthat the image of the functor c is contained in an orbit groupoid. We have that\nc(K′ ) ⊂ OK with K = Gx for some x ∈ G0 .\nǫ\n\nφ\n\nThe restriction (ǫ, φ)|V of a generalized map K ← J → G to the restricted\ngroupoid V ⊂ K is the composition of the generalized map (ǫ, φ) and the inclusion\nid\n\ni\n\nV\nK:\nfunctor V ← V →\n\nJ ×K?V\n?? p1\n\u007f\u007f\n??\n\u007f\u007f\n??\n\u007f\n\u001f\n\u007f\u007f\u007f\nJ\nV?\n\u007f ?? iV\n\u007f ??? φ\n\u007f\nǫ\nid \u007f\u007f\n??\n??\n\u007f\n?? \u007f\u007f\u007f\n??\n\u007f\u007f\n\u001f \u007f\u007f\n\u007f\u007f\u007f\n\u001f\nG\nV\nK\np3\n\nwhere J ×K V is the fibered product groupoid.\nφ\nǫ\nǫ\nThe product (ǫ, φ) × (ǫ′ , φ′ ) of two generalized maps K ← J → G and K′ ←\nφ′\n\nJ ′ → G ′ is given by the generalized map\nǫ×ǫ′\n\nφ×φ′\n\nK × K′ ← J × J ′ → G × G ′ .\nWe will define now a notion of G-contraction within the groupoid G. We keep\nthe classical Lusternik-Schnirelmann terminology of categorical for contractible subspaces in a given space.\nDefinition 5.1. For an invariant open set U ⊂ G0 , we will say that the restricted\ngroupoid U is G-categorical if the inclusion functor iU : U → G is Morita homotopic\n\n\f22\n\nHELLEN COLMAN\n\nto a generalized constant map\nUO @\n~~ @@@ iU\n~\n@@\n~\nu\n@@\n~~\n~~ ~\n\u001f\n′ \u001e\u001e\n\u001e\nH\nH\nU _@ \u0014\nL\n\u0012\u001e ? G\n@@\n~\n@@\n~~\nv ~~\n@\n~ c\nǫ @@\n\u000f ~~\n′\nU\nid\n\nwhere u and v are essential homotopy equivalences.\nExample 5.2. Let G = Hol(K, FS ) be the holonomy groupoid of the Seifert fibration FS on the Klein bottle K. Consider the invariant open set U = M , a\nMöbius band. Then the restricted groupoid over U is U = Hol(M, FS ). Consider\nthe essential homotopy equivalence η : •Z2 → Hol(M, FS ) given by the inclusion as\nin example 3.9. Let Z2 ⋉ I be the action groupoid given by the action of Z2 on\nthe interval I by reflection. The inclusion functor ǫ : Z2 ⋉ I → Hol(M, FS ) is an\nessential equivalence. We have the following diagram\nHol(M, FS )\nO\nOOO\noo\nOOOiU\nη\no\nOOO\no\no\nOO'\no\nwoo\n′ \u001e\u001e\nZ\nH \u001e\u0013 \u001e\nHol(M, FS ) \u0013 H\nHol(K, FS )\n• 2\ngOOO\noo7\nOOO\no\no\nOO\ni\nooo\nǫ OOO\nO \u000f oooo c\nZ2 ⋉ I\nid ooo\n\nhere c : Z2 ⋉ I → Hol(K, FS ) is a constant map on objects c(t) = x where x is any\npoint on a fiber with holonomy Z2 and c is a constant map in each of the connected\ncomponents of the manifold of arrows I ⊔I, c(t, 0) = (x, 0) and c(t, 1) = (x, π). Here\nthe manifold of arrows for the groupoid Hol(K, FS ) is K ×S 1. Then c(Z2 ⋉I) ⊂ •Z2\nand U = M is categorical.\nGiven a categorical subgroupoid U, we have that the inclusion iU composed\nwith an essential homotopy equivalence u factors through an orbit groupoid up to\nhomotopy:\nUO C\nCC\nCCiU\nCC\nu\nCC\n!\n\u001e\n\u001e\n\u001e\u0012 \u001e = G\nL\nO\n{\n{{\n{\nv\n{{ c\n\u000f {{\n/ OK\nU′\nIn other words, if U is G-categorical then there exists a groupoid L and a group K\nsuch that the diagram\n\n\fTHE LUSTERNIK-SCHNIRELMANN CATEGORY OF A LIE GROUPOID\n\nu\n\n23\n\niU\n\n/U\n/G\nLB\n>\nBB\n}\nBB\n}}\n}\nBB\n}\nB }}}\nOK\ncommutes up to homotopy.\nRecall that a Lie groupoid is transitive if the map (s, t) : G1 → G0 × G0 is a\nsurjective submersion.\nProposition 5.3. [32] A Lie groupoid G is Morita equivalent to a point groupoid\nif and only if G is transitive.\nSince an orbit groupoid is transitive, for U to be G-categorical we can substitute\nthe constant generalized map in definition 5.1 by a generalized map with image\ncontained in a point groupoid.\nDefinition 5.4. The LS category, catG, of a Lie groupoid G is the least number of\nG-categorical subgroupoids required to cover G. If G cannot be covered by a finite\nnumber of G-categorical subgroupoids, set catG = ∞.\nThis number is an invariant of Morita equivalence that generalizes the ordinary\nLS category of a manifold. If G = u(M ) is the unit groupoid, then catG = catM ,\nwhere cat in the second term means the ordinary LS category.\nWith these definitions we choose the point groupoids as our contractible groupoids.\nWe make this choice in spite of the fact that the fundamental group of the point\ngroupoid is not necessary trivial since π1 (•K ) = K if K is discrete. Our choice is\ninspired by the A-category of Clapp and Puppe [14] and justified by the equivariant LS theory for group actions. The point groupoid can be seen as the translation\ngroupoid of the (ineffective) action of K on a point •. Since the equivariant LS\ncategory of a K-manifold, catK M , coincides with the ordinary category catM when\nthe action is trivial, we have that the equivariant category catK • = cat• = 1. In our\ntheory, a G-categorical groupoid factors through a point groupoid. For all groups\nK we have:\ncat•K = catK • = cat• = 1\nwhere the first term is the groupoid category of the point groupoid, the second is\nthe equivariant category of the action of K on a point, and the third, the ordinary\ncategory of a point.\nIn section 6.2 we will give a weighted version of the LS groupoid category that\ntakes into account the fact that point groupoids are not contractible in the sense\nmentioned above.\n5.2. Invariance of Morita homotopy type. We will show that the LS category\nof a groupoid is an invariant of Morita homotopy type, and then, invariant under\nMorita equivalence.\nProposition 5.5. If K ≃ G then catK = catG.\nǫ\n\nφ\n\nProof. We will prove that if K dominates G, then catK ≥ catG. Let K ← J → G\nψ\nδ\nand G ← J ′ → K be two generalized maps such that the composition (φ, ǫ) ◦ (ψ, δ)\nis Morita homotopic to the identity in G. We have the following diagram:\n\n\f24\n\nHELLEN COLMAN\n\n(5.1)\n\nGO ?\n\u007f\u007f ???\n\u007f\n\u007f\n??\n\u007f\u007f\n??\n\u007f\nid \u007f\n??id\n\u007f\n??\n\u007f\u007f\n\u007f\n??\n\u007f\n\u007f\n??\n\u007f\n?\u001f\n\u007f\u007f\u007f\n\u001f\u001f \u001f\u001f\n\u001f\u001f \u001f\u001f\nS\nS\nG _?\nG\nE\n\u0013\n\u0013\n??\n\u007f?\nφ \u007f\u007f\n??\n??\n\u007f\u007f\nδ\n\u007f\u007f\nJ ′ _?\n?J\n??\n\u007f\u007f\n??\n\u007f\n\u007f\u007f\np3 ??\n\u000f \u007f\u007f p1\nJ ×K J ′\n\nLet U ⊂ K be a K-categorical subgroupoid, then we have the following diagram:\n\n(5.2)\n\nUO\nooo O OOOOO i\nOOKO\nOO\nooo\no\no\n\u001f\u001f \u001f\u001f ′\n\u001f\u001f \u001f\u001f ′ OOO'\nwoo\nU _?\nL\n\u0013S\n\u0013S\n?K\n??\n\u007f\u007f\n\u007f\n??\n\u007f\u007f\n??\n\u007f\u007f\n??\nK\n?\nz ??\n?•\n\u007f\n??\n\u007f\n??\n\u007f\u007f\n? \u000f \u007f\u007f\u007f\nU′\nidoooo\n\nLet V ⊂ G be the groupoid given by δp′3 (U ×K J ′ ) in the following pullback:\n\nU ×K J ′\n\np′1\n\np′3\n\nGo\n\nδ\n\n\u000f\nJ′\n\n/U\niU\n\nψ\n\n\u000f\n/K\n\nIn diagram (5.1), take the restriction to V, i.e. compose both maps with the\nid\n\ni\n\nV\nG\ninclusion functor V ← V →\n\n\fTHE LUSTERNIK-SCHNIRELMANN CATEGORY OF A LIE GROUPOID\n\n(5.3)\n\n25\n\nV\n\u007f ??? i\n\u007f\n??V\n\u007f\n??\n\u007f\u007f\n\u007f\n\u007f\u007f\n\u001f\nG\nV?\n\u007f O ???\n\u007f ?? i\nV\nid \u007f\u007f\nid \u007f\u007f\n??id\n?\n??\n?\n\u007f\u007f\n\u007f\u007f\n?\n\u007f\n\u007f\n\u007f\u007f\n\u001f \u007f\u007f \u001f\u001f \u001f\u001f\n\u001f\u001f \u001f\u001f ?\u001f\nS E\nG\nV _?\n\u0013 S\u007f? G\n??\n\u007f? _??? \u0013\niV \u007f\u007f\n?\n\u007f\u007f\n??\n??\n\u007f\u007fφp1\n\u007f\u007f\n?\n\u007f\nδp3\nid ??\n\u007f\n\u007f\n\u000f\n\u007f\n′\nJ ×\nV _?\n? KJ\n??\n\u007f\n\u007f\n??\n\u007f\u007f\n??\n\u007f\u007f\nJ ×K J ′ ×G V\nid\n\nδ\n\nψ\n\nNow take the restriction of G ← J ′ → K to V\n(5.4)\n\nJ ′ ×G V\n\u007f ??? p1\n\u007f\u007f\n??\n\u007f\n\u007fp\n?\u001f\n\u007f\u007f\u007f 3\nJ′?\nV\n\u007f ??? i\n?? ψ\n\u007f\n\u007f\n\u007f\nδ \u007f\nid \u007f\n??V\n??\n\u007f\n\u007f\n??\n?? \u007f\u007f\n\u007f\n\u001f\n\u007f\u007f\u007f\n\u001f \u007f\u007f\nG\nV\nK\n\nLemma 5.6. ψp1 (J ′ ×G V) ⊂ U.\nProof. (of the lemma) Use that U is invariant and the essential equivalence δ induces\na diffeomorphism between the isotropy groups.\n\u0003\nSince ψp1 (J ′ ×G V) ⊂ U we obtain the generalized map V ← J ′ ×G V → U from\ndiagram (5.4).\nid\n\nNow we compose this map with the inclusion functor U ← U → K and with the\nφ\nǫ\ngeneralized map K ← J → G, we have:\n(5.5)\n\nJ ×K U ×U J ′ ×G V\nOOO\no\nOOO\nooo\no\no\nOOO\no\nOO'\nwooo\n′\nU ×U J ×G V\nJ\n\u007f ???\n\u007f ???\n\u007f\n\u007f\n?\n??\n??\n\u007f\u007f\n\u007f\u007f\n??\n?\u001f\n\u007f\u007f\n\u007f\u007f\u007f\n??φ\n\u007f\nǫ\n\u007f\n′\n??\n\u007f\nJ ×G V\nU?\n\u007f\n?\n??\n\u007f\n\u007f ??\n??\n\u007f\n\u007f\n\u007f\n\u007f\n??\n\u007f\n?\n\u007f\n?\n\u007f\n\u007f\n?\n\u007f\n?\n\u007f\n?? \u007f\u007f\n??\n?? \u007f\u007f\n\u007f\n\u007f\n\u001f \u007f\u007f\n\u001f \u007f\u007f\n\u007f\u007f\n\u001f\nG\nV\nU\nK\n\nWe will show that the generalized map V ← J ×K J ′ ×G V → G obtained by this\ncomposition is homotopic to the map\nc′\n\nV ← J ×K U ′ ×U J ′ ×G V → G\n\n\f26\n\nHELLEN COLMAN\n\nobtained from the following compositions\n(5.6)\n\nJ ×K U ′ ×U J ′ ×G V\nOOO\noo\nOOπO1\nooo\no\nOOO\no\no\no\nOO'\nwo\nU ′ ×U J ′ ×G V\nJ ?\n??\n??\n??\n\u007f\u007f\n\u007f\u007f\n??\n\u007f\n\u007f\n??\n\u007f\n\u007f\n??\n\u007f\n?\u001f\n\u007f\n\u007f\u007f\u007f\n??φ\nǫ \u007f\u007f\n′\n??\n\u007f\nJ ′ ×G V\nU ?\n\u007f\n?\n??\n\u007f\n?\n\u007f\n??\n\u007f\n\u007f\n?\n\u007f\n\u007f\nz \u007f\n\u007f\n??\n??c\n??\n\u007f\n\u007f\n\u007f\n\u007f\n??\n\u007f\n?? \u007f\n?? \u007f\u007f\n\u007f\n\u001f \u007f\u007f\n\u001f \u007f\u007f\n\u007f\u007f\u007f\n\u001f\nG\nV\nU\nK\n\nLet c′ = φπ1 , we have the following\nLemma 5.7. The image of c′ = φπ1 is contained in an orbit groupoid. Moreover,\n′\nif c(U ′ ) ⊂ OK then c′ (J ×K U ′ ×U J ′ ×G V) ⊂ OK where K ≈ K ′ .\nProof. (of the lemma) Use the fact that ǫ induces a homeomorphism between the\norbit spaces and a diffeomorphism between the isotropy groups.\n\u0003\nc′\n\nThen V ← J ×K U ′ ×U J ′ ×G V → G is a generalized constant map. By using\ndiagram (5.2) we have that\n(5.7)\n\nV ← J ×K J ′ ×G V → G\n\n≃S ′\n\nc′\n\nV ← J ×K U ′ ×U J ′ ×G V → G\n\nThen we have a 2-morphism\n(5.8)\n\nq VO MMMM\nMMM\nqqq\nq\nq\nMMM\nqq\nq\nq\nMMM\nxqqq\n&\nS\nS \u0013\nV fLL\nL\n9G\nr\nr\nLLL \u0013\nr\nr\nr\nLLL\nLLL\nrrr\n\u000f rrr\nJ ×K J ′ ×G V\n\ngiven by diagram (5.3) and another 2-morphism\n(5.9)\n\nJ ×K J ′ ×G V\nO\nOOO\no\nOOO\nooo\no\no\nOOO\noo\no\nOOO\no\no\nO'\no\nwo\n!\n!\n′\n′\nS\nO\n′\nV g OO\nL\n\u0013\no\nS\n\u0014 ooo 7 G\nOOO\nOOO\noo\nOOO\nooo′\no\no\nO\n\u000f\noo c\nJ ×K U ′ ×U J ′ ×G V\n\ngiven by equation (5.7).\nThe vertical composition of these 2-morphisms (5.8) and (5.9) gives a 2-morphism\nbetween the inclusion and a generalized constant map:\n\n\fTHE LUSTERNIK-SCHNIRELMANN CATEGORY OF A LIE GROUPOID\n\n27\n\nu VO OOOOO\nuu\nOOO\nu\nu\nOOO\nuu\nu\nOOO\nu\nOOiOV\nid uuu\nLO PPP\nOOO\nuu\nu\nP\nOOO\nPPP v\nuu\nu\nOOO\nP\nu\nPPP\nu\nOOO\nPPP\nuu\nOO'\nu\nP(\n\u001f\u001f \u001f\u001f ′′\n\u001f\u001f \u001f\u001f ′′\n\u001f\u001f \u001f\u001f ′′\nzu\nPS ′′\nK dII\n\u0013S\n\u0013 S nnn7 D \u0013 S\np7 G\nII\nn\nppp\nn\np\nn\nII\np\nnn\npp\nII\nnnn ′\nII\nppp\np\n\u000f nnnn u\nII\np\npp\nII\nL′\nII\nppp\np\np\nII\npp\nII\nppp\nII\np\np\nI \u000f\npp\nJ ×K U ′ ×U J ′ ×G V\nwhere D = J ×K J ′ ×G V. Therefore, V is categorical for G.\n\n\u0003\n\n5.3. Homotopy restrictions. If U is G-categorical, we have that the following\ndiagram commutes up to homotopy:\nUO B\nBB\n~~\nBBiU\n~\n~\nu\n~\nBB\n~\n~\nB!\n~~\nU _? \u0014 H L H ′ \u001e\u001e \u0012 \u001e\u001e > GO\n|\n??\n||\n??\n|\nv\n|| c\nǫ ???\n\u000f ||\n/ •K\nU′\nid\n\nThen, for all y ∈ L0 the isotropy group Gy injects into Gx for x = u(y) ∈ U and into\nGz for z = v(y) ∈ U ′ by proposition 3.2 and remark 3.8. We have that Gx ֌ K.\nIn particular, if the isotropy groups are finite, we have that |Gx | divides |K| for all\nx ∈ U . For instance, a categorical subgroupoid U cannot factor through a trivial\ngroup K except in case that all the points in U have trivial isotropy.\nExample 5.8. Let G = Hol(K, FS ) be the holonomy groupoid of the Seifert fibration FS on the Klein bottle K. We can cover K by two Möbius bands M as\nbefore. Since the isotropy at the points in the center fiber is Z2 these points cannot be moved by a homotopy to a point in the neighborhood with trivial isotropy.\nTherefore this covering is minimal and the groupoid category is catHol(K, FS ) = 2.\n6. Orbifolds as groupoids\nWe recall now the description of orbifolds as groupoids due to Moerdijk and\nPronk [33, 31]. Orbifolds were first introduced by Satake [36] as a generalization of\na manifold defined in terms of local quotients. The groupoid approach provides a\nglobal language to reformulate the notion of orbifold.\nWe follow the exposition in [31] and [1]. A groupoid G is proper if (s, t) : G1 →\nG0 × G0 is a proper map and it is a foliation groupoid if each isotropy group is\ndiscrete.\nDefinition 6.1. An orbifold groupoid is a proper foliation groupoid.\n\n\f28\n\nHELLEN COLMAN\n\nFor instance the holonomy group of a foliation F is always a foliation groupoid\nbut it is an orbifold groupoid if and only if F is a compact-Hausdorff foliation.\nGiven an orbifold groupoid G, its orbit space |G| is a locally compact Hausdorff\nspace. Given an arbitrary locally compact Hausdorff space X we can equip it with\nan orbifold structure as follows:\nDefinition 6.2. An orbifold structure on a locally compact Hausdorff space X is\ngiven by an orbifold groupoid G and a homeomorphism h : |G| → X.\nIf ǫ : H → G is an essential equivalence and |ǫ| : |H| → |G| is the induced\nhomeomorphism between orbit spaces, we say that the composition h◦|ǫ| : |H| → X\ndefines an equivalent orbifold structure.\nDefinition 6.3. An orbifold X is a space X equipped with an equivalence class\nof orbifold structures. A specific such structure, given by G and h : |G| → X is a\npresentation of the orbifold X .\nIf two groupoids are Morita equivalent, then they define the same orbifold.\nTherefore any structure or invariant for orbifolds, if defined through groupoids,\nshould be invariant under Morita equivalence.\nDefinition 6.4. An orbifold map f : Y → X is given by an equivalence class of\ngeneralized maps (ǫ, φ) from K to G between presentations of the orbifolds such\nthat the diagram commutes:\n|K|\n\n|φ||ǫ|−1\n\n/ |G|\n\n\u000f\n\u000f\n/X\nY\nA specific such generalized map (ǫ, φ) is called a presentation of the orbifold map\nf.\nOur notion of Morita homotopy gives a notion of homotopy for orbifolds:\nDefinition 6.5. An orbifold homotopy between the orbifold maps f, g : Y → X is\ngiven by a Morita homotopy between the presentations (ǫ, φ) of f and (δ, ψ) of g.\nIn other words, an orbifold homotopy is given by the following diagram\n′\n\nKO A\nAA φ\n}}\nAA\n}\n}\nu\nAA\n}\n}\n}\n}~\n\u001f\u001f \u001f\u001f A\nK `A \u0013 H L H ′ \u0013 > G\n}\nAA\nAA\n}}\nv }}\n}\nν AAA\n\u000f }} ψ\nK′′\nη\n\nwhere K to G are presentations of the orbifolds Y and X .\nRemark 6.6. Since the groupoid L has the same Morita homotopy type as K, we can\nalways take a presentation of the orbifold homotopy Y × I → X given by a strict\nhomotopy H S : L × IS → G, where L and K define the same orbifold homotopy\nclass of orbifolds.\n\n\fTHE LUSTERNIK-SCHNIRELMANN CATEGORY OF A LIE GROUPOID\n\n29\n\nExample 6.7. Consider the orbifold X having as a presentation groupoid the\nholonomy groupoid associated to the Seifert fibration on the Möbius band, G =\nHol(M, FS ), its underlying space is X = [0, 1). The orbifold X has the same orbifold\nhomotopy type as the orbifold Y represented by the point groupoid K = •Z2 . The\nMorita homotopy equivalence is given by an orbifold map Y → X with presentation:\nη\n\nν\n\n•Z2 ← Z2 ⋉ I → Hol(M, FS )\nas in example 4.5. The homotopic inverse X → Y is given by the generalized map\nη\nν\nHol(M, FS ) ← Z2 ⋉ I → •Z2 .\n6.1. LS category for orbifolds. If G is a presentation for the orbifold X , we\ndefine the LS category of X as the groupoid category of G, catX = catG.\nBy proposition 5.5 the LS category of a groupoid is invariant under Morita\nequivalence, then this definition is independent of the chosen presentation for X .\nThe LS category of an orbifold X is an invariant of the orbifold homotopy type\nwhich generalizes the classical LS category in case that the orbifold is a manifold.\nIf the orbifold is effective the LS category for orbifolds as groupoids coincide with\nthe LS category for orbifolds as defined by the author in [9] using local charts.\nRemark 6.8. Since a transitive groupoid is Morita equivalent to a point groupoid,\nwe have that catX = 1 if the underlying topological space X = |G| of the orbifold\nX is a point.\nFor instance, we have that in example 6.7 the orbifold category of X is catX = 1\nsince the presentation G = Hol(M, FS ) has the same Morita homotopy type of a\npoint groupoid. In this case, the ordinary category of the underlying topological\nspace X = [0, 1), coincides with the orbifold category of X , though in general, it is\njust a lower bound:\nProposition 6.9. Let X be an orbifold and X its underlying topological space.\nThen catX ≥ catX.\nProof. Let G be a presentation groupoid for the orbifold X , then |G| is homeomorphic to X. We will show that catG ≥ cat|G|. Let U ⊂ G0 be an invariant open set\nsuch that U is G-categorical. Since s and t are open maps, we have that π : G → |G|\nis an open map too. Therefore, π(U ) is an open set in |G|. The S-homotopy between\nthe inclusion and the constant map induces a homotopy H : π(U ) × |IS | → |G| in\nthe orbit spaces. Since IS is Morita equivalent to the interval I regarded as a unit\ngroupoid, we have that |IS | = I. Thus π(U ) is categorical for |G| = X, in the\nordinary sense.\n\u0003\nExample 6.10. The groupoids G and K in example 2.4 define the teardrop orbifold\nX . For the groupoid G, we have a G-categorical covering given by U = D1 and\nV = D2 and for K we can consider the K-categorical covering given by U = S 3 −TN\nand V = S 3 − TS where TS and TN are the cores of the solid tori. We have that\ncatX = 2.\nWe recall now the notion of inertia groupoid [31] and its decomposition in twisted\nand untwisted sectors. We show that the orbifold category of the twisted sectors\nprovides a lower bound for the orbifold category of the orbifold.\nLet G be an orbifold groupoid. The inertia groupoid ∧G is a Lie groupoid whose\nmanifold of objects is given by\n(∧G)0 = SG = {g ∈ G1 |s(g) = t(g)}.\n\n\f30\n\nHELLEN COLMAN\n\nFigure 5.\nWe can think of the elements in SG as loops in G. The manifold of arrows\n(∧G)1 = SG ×sG0 G1\nis given by the following pullback of manifolds:\nSG ×sG0 G1\n\n/ SG\n\n\u000f\nG1\n\n\u000f\n/ G0\n\nβ\ns\n\nwhere β sends a loop g : x → x to its source (or target) β(g) = x. Then an arrow\nbetween the loop g : x → x and g ′ : y → y is given by an arrow h : x → y such\nthat hgh−1 = g ′ . The source and target maps s, t : SG ×G0 G1 → SG are given by\ns(g, h) = g and t(g, h) = hgh−1 .\nIf K ∼M G, then ∧K ∼M ∧ G and there is a well defined notion of inertia for\norbifolds. The orbifold ∧X is determined by the inertia groupoid ∧G corresponding\nto any presentation G of X .\nIf G = G ⋉ M is a translation groupoid, then the inertia groupoid is also a\ntranslation groupoid given by\n(∧G)0 = {(g, x) | x ∈ M, g ∈ G, gx = x}\nand the action of G given by h * (g, x) = (hx, hgh−1 ).\nExample 6.11.\n(1) The inertia orbifold for the teardrop orbifold X in example\n2.4 is given by the disjoint union of itself and 2 copies of the point N . Then\nthe orbifold category of the inertia orbifold is given by cat∧X = catX +2 =\n4.\n(2) Given the action of the dihedral group\nD8 = {1, ρ, ρ2 , ρ3 , σ, σρ, σρ2 , σρ3 }\non the sphere S 2 where σ acts by reflection and ρ by rotation about the\nz-axis, consider the translation groupoid G = D8 ⋉ S 2 defining the orbifold\nX . Both poles N and S in G0 = S 2 are fixed by the action, then they have\nisotropy GN = GS = D8 . There are four great circles whose points have\nisotropy Z2 generated by each of the symmetries σ, σρ, σρ2 and σρ3 . The\nmanifold of objects SG of the inertia groupoid ∧G is given by the disjoint\nunion of S 2 plus 3 copies of each N and S corresponding to the rotations\nρ, ρ2 and ρ3 and the four great circles with non-trivial isotropy as shown in\nfigure 6\nThe orbifold X defined by G is a disk orbifold with silvered boundary\nand two dihedral singular points on the boundary. The inertia orbifold ∧X\n\n\fTHE LUSTERNIK-SCHNIRELMANN CATEGORY OF A LIE GROUPOID\n\n31\n\nFigure 6.\n\nFigure 7.\ngiven by the action of G = D8 on SG is the disjoint union of the orbifolds\nshown in figure 7: Consider the covering {U, V} by subgroupoids of G given\nby U = S 2 − N and V = S 2 − S. This covering is categorical and catX = 2.\nThe category of each of the 1-dimensional orbifolds in the decomposition is\n2. Then the category of the inertia orbifold is cat∧X = catX +4+2+2 = 10.\ni\nLet Gi be a G-saturated connected component\nF ini SG . If G is the full subgroupoid\ni\nover G , we have that the partition of SG = G induces a decomposition of the\ninertia groupoid:\nG\nGi\n∧G =\nF\nas well as a decomposition of the inertia orbifold, ∧X = X i . The components\nGi ⊂ SG besides G0 are called twisted sectors whilst G0 is the untwisted sector. The\ncorresponding G i ⊂ G and X i ⊂ X are also called twisted sectors.\n\nProposition 6.12. If X i is a twisted sector of the orbifold X , then catX ≥ catX i .\nProof. If U is a G-categorical subgroupoid for G, consider the subgroupoid V =\np1 (G i ×G U) in G i given by the following fibered product of groupoids:\nG i ×G U\n\np1\n\n/ Gi\nβi\n\n\u000f\nU\n\niU\n\n\u000f\n/G\n\nwhere βi is the restriction to G i of β : ∧ G → G given by β(g) = s(g) on objects and\nβ(g, h) = h on arrows. The inclusion functor iU : U → G is Morita homotopic to a\nc\nǫ\n→ G. Consider the fibered product V ′ = G i ×G\ngeneralized constant map U ←\n− U′ −\nU ′ . We have that the inclusion iV : V → G i is Morita homotopic to a generalized\nconstant map V ←\n− V′ −\n→ Gi.\n\u0003\n\n\f32\n\nHELLEN COLMAN\n\n6.2. Weighted category. In the classical Lusternik-Schnirelmann theory for topological spaces, we count the amount of categorical sets required to cover the space.\nThere are no distinctions between the categorical sets since all of them factor\nthrough a point. In the groupoid context, we count subgroupoids which factor\nthrough point groupoids. We are going to distinguish our point groupoids by their\nweights and count categorical subgroupoids together with the weights of their associated point groupoids. This idea is inspired by the work of Tom Leinster on\nthe Euler characteristic of a finite category [24] and based on the string-theoretic\norbifold Euler characteristic [15, 3, 2].\nLet G be an orbifold groupoid and U be a G-categorical subgroupoid. Let K be\na group of minimal order such that U factors through •K . We define the weight of\nU as the number k of conjugacy classes in K, w(U) = k. If K is abelian, then the\nweight of U is the order of K, w(U) = |K|.\nA covering {U1 , . . . , Un } of G is minimal if Ui is G-categorical and catG = n.\nGiven a minimal covering {U1 , . . . , Un } and its associated set of weights {w1 , . . . , wn }\nwe propose the following\nDefinition 6.13. The weighted LS category, wcatG, of a Lie groupoid G is the least\nvalue of the sum:\nn\nX\nwi\ni=1\n\nfor all {U1 , . . . , Un } minimal coverings.\n\nExample 6.14.\n(1) Consider the translation groupoid G = S 1 ⋉ S 3 defining\nthe teardrop orbifold X as in example 2.4. For the categorical covering\n{U, V} by subgroupoids of G given by U = S 3 − TN and V = S 3 − TS we\nhave that the associated set of weights is {1, 3}. This covering is minimal\nand gives the least sum, then wcatG = 4.\n(2) For the translation groupoid G = D8 ⋉ S 2 , consider the categorical covering\n{U, V} by subgroupoids of G given by U = S 2 − N and V = S 2 − S as in\nexample 6.11 (2). Both subgroupoids U and V factor through the group D8 .\nThe conjugation classes in D8 are given by {{1}, {ρ, ρ3}, {ρ2 }, {σ, ρ2 σ}, {ρσ, ρ3 σ}},\nthen the class number is 5. Therefore, a the set of weights associated to\nthis covering is {5, 5}. We have that wcatG = 10.\nWe will show that the weighted category of an orbifold groupoid is an invariant\nof Morita homotopy type, then in particular yields a well defined invariant for\norbifolds: wcatX = wcatG for any groupoid presentation G. Moreover, the weighted\ncategory for orbifolds is an invariant of orbifold homotopy type.\nProposition 6.15. If K and G are orbifold groupoids with K ≃ G, then wcatK =\nwcatG.\nProof. Let wcatK = m and let {U1 , . . . , Un } be a minimal K-covering realizing\nthe least sum, then m = w1 + . . . + wn where {w1 , . . . , wn } is the set of weights\nassociated to {U1 , . . . , Un }. We construct a G-minimal covering {V1 , . . . , Vn } as in\nthe proof of Proposition 5.5. By Lemma 5.7 we have that {w1 , . . . , wn } is also a\nset of weights for {V1 , . . . , Vn } and it is minimal with this property. Then wcatG =\nw1 + . . . + wn = m.\n\u0003\nWe conjecture that the weighted category of an orbifold groupoid coincides with\nthe (unweighted) category of its inertia groupoid, wcatG = cat ∧ G.\n\n\fTHE LUSTERNIK-SCHNIRELMANN CATEGORY OF A LIE GROUPOID\n\n33\n\n7. Critical points\nClassically, the LS category of a manifold is a lower bound for the number\nof critical points of a smooth function under certain conditions. We propose a\ngeneralization of the notion of critical point for generalized maps and prove that\nthe LS theorem holds for orbifold groupoids.\nLet φ : L → G be a morphism of Lie groupoids. A point x ∈ L0 is a critical point\nfor φ if x is critical for the object part of the functor, (dφ0 )x = 0.\nProposition 7.1. If x ∈ L0 is a critical point for φ, then:\n(1) for all y ∈ O(x), y is a critical point for φ and\n(2) for all g ∈ L1 with s(g) = x, g is a critical point (arrow) for φ1\nProof. Let g ∈ L1 be an arrow g : x → y. From the following diagram\nφ1\n\nL1\ns\n\ns\n\nt\n\n\u000f \u000f\nL0\n\n/ G1\n\nφ0\n\nt\n\n\u000f \u000f\n/ G0\n\nwe have that d(sφ1 )g = d(φ0 s)g . Then\n(ds)φ1 (g) ◦ (dφ1 )g = (dφ0 )s(g) ◦ (ds)g = 0\nsince x = s(g) is critical for φ0 . Since s is a submersion, we have that (ds)φ1 (g) has\nmaximal rank and then (dφ1 )g = 0. Thus, g is critical for φ1 . Moreover, this implies\nthat (dt)φ1 (g) ◦ (dφ1 )g = 0. Since d(tφ1 )g = d(φ0 t)g , then (dφ0 )t(g) ◦ (dt)g = 0. We\nhave that (dφ0 )t(g) = 0 since t has maximal rank. Then y = t(g) is critical for\nφ0 .\n\u0003\nTherefore, if x is a critical point for φ, we will write (dφ)OK = 0 where O is the\norbit of x and K the isotropy group at x.\nDefinition 7.2. Let φ : L → G be a morphism of Lie groupoids. An orbit groupoid\nOK ⊂ L is a critical subgroupoid if (dφ)OK = 0.\nProposition 7.3. Let φ, ψ : L → G be two equivalent morphisms, φ ∼T ψ. The\norbit groupoid OK is a critical subgroupoid for φ if and only if OK is a critical\nsubgroupoid for ψ.\nProof. If T : L0 → G1 is a natural transformation between φ and ψ, the following\ndiagrams are commutative\nG1\n|>\n|\nT ||\n|| s\n|\n\u000f\n| φ0\n/ G0\nL0\n\nG1\n|>\n|\nT ||\n|| t\n|\n| ψ0\n\u000f\n/ G0\nL0\n\nand we have that d(sT )x = dφx and d(tT )x = dψx . If x is critical for φ, then\ndsT (x) ◦ dTx = 0 and since s has maximal rank, dTx = 0. Then dψx = dtT (x) ◦ dTx =\n0 and x is critical for ψ.\n\u0003\nProposition 7.4. If ǫ : L → K is an essential equivalence, then ǫ has no critical\nsubgroupoids.\n\n\f34\n\nHELLEN COLMAN\n\nProof. An essential equivalence ǫ is equivalent by a natural transformation to ǫ′\nwith ǫ′0 being a submersion.\n\u0003\nDefinition 7.5. An orbit groupoid OK ⊂ J is a critical subgroupoid for the gen′\nφ\nǫ\neralized map J ← L → G if there exists a critical subgroupoid O′K ⊂ L for φ such\n′\nthat ǫ(O′K ) ⊂ OK .\nIn this case, the groups K and K ′ are isomorphic.\nWe will show that the notion of critical subgroupoid is invariant under Morita\nequivalence and yields a notion of critical point for orbifold morphisms.\nProposition 7.6. Let (ǫ, φ) and (ǫ′ , φ′ ) be two equivalent generalized maps. The\norbit subgroupoid OK ⊂ J is critical for (ǫ, φ) if and only if it is critical for (ǫ′ , φ′ ).\nProof. Since the following diagram commutes up to natural transformations\nL\n~ O @@\n~~ α @@@φ\n~\n@@\n~~\n@\u001f\n~~ ~\nJ `@ ∼T ′ A ∼T ? G\n@@\n\u007f\u007f\n@@\n\u007f\u007f\nβ\n\u007f\n@@\n\u007f ′\nǫ′\n\u000f \u007f\u007f φ\n′\nL\nǫ\n\nwe have that (dφα)S = (dφ′ β)S for all orbit subgroupoids S ⊂ A. Since OK ⊂ J\n′\nis critical for (ǫ, φ), we have that there exists a subgroupoid O′K ⊂ L for φ with\n′\nǫ(O′K ) ⊂ OK and dφO′ K ′ = 0.\n′\nConsider the subgroupoid S = p3 (O′K ×L A) given by the following fibered\nproduct of groupoids:\n′\n\nO′K ×L A\n\np1\n\n/ O′K ′\niO′K ′\n\np3\n\n\u000f\nA\n\nα\n\n\u000f\n/L\n\nThen (dφ)α(S) ◦ dαS = (dφ′ )β(S) ◦ dβS = 0 and (dφ′ )β(S) = 0 since β has maximal\n′′\nrank. Taking O′′K = β(S) ⊂ L′ we have that OK is critical for (ǫ′ , φ′ ).\n\u0003\nThen the notion of critical subgroupoid is well defined for the class of equivalence\nof the generalized map defining the orbifold morphism.\n7.1. Relative groupoid LS-category. As in the classical case, we develop a\nrelative version of the Lusternik-Schnirelmann groupoid category.\nDefinition 7.7. Let G be a Lie groupoid and M ⊂ G0 be an invariant open set.\nConsider the full subgroupoid M over M . The groupoid LS-category of M in G,\ncat(M, G), is the least number of G-categorical subgroupoids required to cover M.\nLet M and N be two full subgroupoids of G.\n\n\fTHE LUSTERNIK-SCHNIRELMANN CATEGORY OF A LIE GROUPOID\n\n35\n\nDefinition 7.8. The subgroupoid M is G-deformable into N in G if there are\ngroupoids M′ and L such that the following diagram commutes:\nM\nO CC\nCCiM\n{{\n{\nCC\nu\n{{\n{\nCC\n{} {\n!\nS \u001d\u001d\nS\nM aC \u0013 F\nL H \u001d \u0012 \u001d = GO\n|\nCC\n||\nCC\nv\niN\n||\n|\nη CCC\n\u000f || φ\n/N\nM′\nid\n\nRemark 7.9. A subgroupoid U is G-categorical if U is G-deformable into an orbit\ngroupoid OK in G.\nThe relative groupoid LS-category for orbifold groupoids satisfy the following\nproperties.\nP1\nP2\nP3\nP4\n\nIf M ⊂ N , then cat(M, G) ≤ cat(N , G).\ncat(M ∪ N , G) ≤ cat(M, G) + cat(N , G).\nIf M is G-deformable into N , then cat(M, G) ≤ cat(N , G).\nIf W ⊂ G0 is an invariant closed set, then there exists an invariant open\nset U with W ⊂ U such that cat(U, G) = cat(W, G). We will say that the\nsubgroupoid U is a neighborhood of W.\n\nIn particular, every orbit subgroupoid in an orbifold groupoid has a G-categorical\nneighborhood. Note that this property does not hold for general Lie groupoids.\nRemark 7.10. If G is an orbifold groupoid defining the orbifold X , then for each\nx ∈ G0 there exist arbitrary small neighborhoods U of x for which U is isomorphic\nto the action groupoid Gx ⋉ U [33]. The subgroupoid U determines an open set\n|U| ⊆ |G| = X, for which |U| is the quotient of U by the action of the finite group\nGx .\n7.2. Critical subgroupoid K. Let φ : G → R be a morphism of Lie groupoids,\nwhere R is the unit groupoid over the real numbers. Let K be the critical subgroupoid of φ, i.e. the subgroupoid given by the union of all critical orbit subgroupoids:\nG\nOK\nK=\n(dφ)OK =0\n\nLet φ(K0 ) be the set of critical values and R = R \\ φ(K0 ) the set of regular\nvalues. Consider the full subgroupoids Gc = φ−1 (−∞, c] and Kc = K ∩ φ−1 (c).\nWe will impose the following G-deformation conditions on the groupoid G and the\nmorphism φ:\nD1 For all c in the interior of the set of regular values R there exists an ǫ > 0\nsuch that Gc+ǫ is G-deformable into Gc−ǫ .\nD2 For any isolated critical value c and U neighborhood of Kc , there is an ǫ > 0\nsuch that Gc+ǫ \\ U is G-deformable into Gc−ǫ .\nD3 If c > sup φ(K) then there is an ǫ > 0 such that G is G-deformable into Gc .\nWe develop a version of the Lusternik-Schnirelmann theorem for the groupoid\nLS category following the modern approach to the classical theorem by Clapp and\nPuppe [14].\n\n\f36\n\nHELLEN COLMAN\n\nProposition 7.11 (Lusternik-Schnirelmann theorem). Let G be an orbifold groupoid\nand φ : G → R a morphism satisfying the G-deformation conditions. Consider the\nfunction m : R → N ∪ {∞} given by m(c) = cat(Gc , G). We assert that\n(1) the function m is (weakly) increasing;\n(2) m is locally constant in the interior of the set of regular values R;\n(3) at any isolated critical value c of φ the function m jumps by cat(Kc , G) at\nmost and\n(4) when c > sup φ(K) then m(c) = catG.\nAs in the classical case, the theorem follows from properties P1-P4 and conditions\nD1-D3.\nCorollary 7.12. If G is an orbifold groupoid and φ : G → R a morphism satisfying\nthe G-deformation conditions, then\nX\ncatG ≤\ncat(Kc , G).\nc∈R\n\nThis implies that catG is a lower bound for the number of critical orbits of φ.\nGiven an orbifold X and an orbifold map X → R, we will say that a point x ∈ X\nis critical if there is a presentation groupoid G for X and a presentation generalized\nφ\nǫ\nmap G ← G ′ → R for X → R such that x is the image in the quotient G → |G| = X\nof some critical orbit subgroupoid OK ⊂ G for the generalized morphism (ǫ, φ).\nWe claim the following version of the Lusternik-Schnirelmann theorem for orbifolds.\nTheorem 7.13. Let X be a compact orbifold and X → R be an orbifold map. Then\ncatX is a lower bound for the number of critical points of X → R.\nTo prove that an orbifold groupoid G and a morphism φ satisfy the G-deformation\nconditions we will introduce the notion of integral G-curve for G-vector fields.\nWe define the tangent groupoid T G of the groupoid G as a groupoid whose manifold of objects and arrows are T G0 and T G1 respectively. Source and target are\ngiven by the differentials of s, t : G1 → G0 which are also submersions:\nT G1\nds\n\ndt\n\n\u000f \u000f\nT G0\nDefinition 7.14. A G-vector field is a morphism X : G → T G such that X0 : G0 →\nT G0 and X1 : G1 → T G1 are vector fields.\nWe will use here the idea of multiple G-paths to define G-curves.\nDefinition 7.15. A G-curve is a morphism σ : JS′ → G where JS′ is the groupoid\ngiven by a subdivision S = {r0 ≤ r1 ≤ * * * ≤ rn } of an open interval J as defined\nbefore.\njn−1\nWe write σ = (αj11 , g1 , αj22 . . . , αn−1\n, gn−1 , αjnn ) where αj11 and αjnn are maps\njn−1\n, gn−1 ) is a multiple G-path\nfrom half-closed intervals to G0 and (g1 , αj22 . . . , αn−1\nj1\njn\nbetween the orbits of α1 (r0 ) and αn (rn ).\nThe velocity of σ is a G-curve σ̇ : JS′ → T G given by\nj\n\nn−1\nσ = (α̇j11 , dg1 , α̇j22 . . . , α̇n−1\n, dgn−1 , α̇jnn )\n\n\fTHE LUSTERNIK-SCHNIRELMANN CATEGORY OF A LIE GROUPOID\n\n37\n\nwhere dgi maps the velocity vector α̇i (ri , i, 1) to the velocity vector α̇1i+1 (ri , i+1, 1).\nThe length l of a G-curve σ is the sum of the lengths of the paths α1i . We have\nthat\nn Z ri+1\nX\n|α̇i (r, i, 1)|\nl(σ) =\n1\n\nri\n\nThe sum of the lengths of any other branch of the multiple G-path will give the\nsame length. The distance between two orbits O and O′ is the infimum of the the\nK′\nlengths of G-paths between the orbifold subgroupoids OK and O′ . This distance\ndefines a metric which is complete if the orbifold is compact.\nLet X be a G-vector field on G. We will say that σ is an integral G-curve for X if\nσ̇ = X ◦ σ. If 0 is in J, we call σ(0) the initial subgroupoid of the integral G-curve.\nFor a compact orbifold groupoid, we have that for each orbit subgroupoid OK\nthere is a maximal integral G-curve σOK for X whose domain is given by J =\n(−∞, +∞) and the initial subgroupoid is OK .\nDefinition 7.16. The flow of X is the morphism φ : G × R′S → G given by\nφ(x, (r, i, j)) = σOK ((r, i, j)) with x ∈ O on objects and φ(g, ri ) = σOK (ri ) with\ng ∈ K on arrows.\n\nWe have that φ(x, (r′ + r, i + i′ , j)) = φ(φ(x, (r, i, j)), (r′ , i′ , j))) on objects and\nsimilarly on arrows.\nGiven a morphism φ : G → R where G is an orbifold groupoid defining a compact\norbifold, consider the G-vector field X = ∇φ given by the gradient ∇φ : G → T G.\nThen the flow of the G-vector field X = ∇φ gives the Morita homotopy required\nby the G-deformation conditions. Then an orbifold groupoid G defining a compact\norbifold X is in the hypothesis of corollary 7.12 and the statement of the theorem\nfollows.\nReferences\n[1] A. Adem, J. Leida and Y. Ruan, Y. Orbifolds and Stringy Topology. Cambridge Tracts in\nMathematics, Volume 17, 2007.\n[2] A. Adem and Y. Ruan, Twisted orbifold K-theory. Comm. Math. Phys. 237 (2003), no. 3,\n533–556.\n[3] M. F. Atiyah and G. Segal, On equivariant Euler characteristics. Journal of Geometry and\nPhysics, Vol 6 (1989) , n4, 671–677\n[4] J. Baez and J. Dolan, From finite sets to Feynman diagrams. Mathematics unlimited-2001\nand beyond, 29–50, Springer, Berlin, 2001.\n[5] J. Benabou, Introduction to bicategories. In Midwest Category Seminar, volume 42 of LNM,\npages 1–77. Springer, 1967.\n[6] M. Bridson and A. Haefliger, Metric spaces of non-positive curvature. Grundlehren der Mathematischen Wissenschaften, 319. Springer-Verlag, Berlin, 1999.\n[7] R. Brown, Topology and groupoids, BookSurge LLC, S. Carolina, 2006.\n[8] H. Colman, LS-categories for foliated manifolds. Proceedings of the conference Foliations:\nGeometry and dynamics Warsaw 2000, World Scientific Publishing, 17–28.\n[9] H. Colman,\nLusternik-Schnirelmann\ncategory\nof\nOrbifolds,\nConference on\nPure and Applied Topology Isle of Skye,\nScotland,\n2005. available at\nhttp://www.abdn.ac.uk/∼wpe006/conference/skye/booklet.pdf\n[10] H. Colman, On the 1-homotopy type of Lie groupoids, arXiv:math/0612257\n[11] H. Colman and E. Macias, Tangential Lusternik-Schnirelmann category of foliations, J. London Math. Soc. 67 (2002), 745–756.\n[12] H. Colman and E. Macias, The transverse Lusternik-Schnirelmann category of a foliated\nmanifold, Topology 40 (2) (2000), 419–430.\n\n\f38\n\nHELLEN COLMAN\n\n[13] O. Cornea, G. Lupton, J. Oprea and D. Tanré, Lusternik-Schnirelmann category, Mathematical Surveys and Monographs 103, American Mathematical Society, 2003.\n[14] M. Clapp and D. Puppe, Invariants of the Lusternik–Schnirelmann type and the topology of\ncritical sets, Trans. Amer. Math. Soc. 298 (1986), 603–620.\n[15] L. Dixon, J. Harvey, C. Vafa and E. Witten, Strings on orbifolds, I, Nucl.Phys. B261(1985),\n678.\n[16] E. Fadell The equivariant Ljusternik-Schnirelmann method for invariant functionals and relative cohomological index theories, In Méthodes Topologiques en Analyse Non-Lineaire, ed.\nA. Granas, Montreal, 1985.\n[17] A. Haefliger, Homotopy and integrability, Manifolds (Amsterdam, 1970), Lectures Notes in\nMath. 197, Springer (1971), 133–163.\n[18] A. Haefliger, Groupoı̈des d'holonomie et classifiants, Astérisque 116 (1984), 70–97.\n[19] A. Haefliger, Orbi-espaces, in Sur les Groupes Hyperboliques d'après Mikhael Gromov,\nProgress in Mathematics, Birkhäuser 83 (1990), 203–213.\n[20] I.M. James, Lusternik-Schnirelmann Category. Handbook of Algebraic Topology, Elsevier\nScience, Amsterdam, 1995, 1293-1310.\n[21] I.M. James and J.R. Morris, Fibrewise category. Proceedings of the Royal Society of Edinburgh\n119A (1991), 177–190.\n[22] N. P. Landsman, Bicategories of operator algebras and Poisson manifolds, Fields Institute\nCommunications 30 (2001) 271–286.\n[23] N. P. Landsman, Quantized reduction as a tensor product. Quantization of singular symplectic\nquotients, Progress in Mathematics, Birkhäuser 198 (2001), 137–180.\n[24] T. Leinster, The Euler characteristic of a category, arXiv:math/0610260v1\n[25] E. Lupercio and B. Uribe, Loop groupoids, gerbes, and twisted sectors on orbifolds, in Orbifolds in Mathematics and Physics, 163–184 Contemp. Math. 310, Amer. Math. Soc., Providence, RI, 2002.\n[26] L. Lusternik and L. Schnirelmann, Méthodes topologiques dans les Problèmes Variationnels,\nHermann, Paris, 1934.\n[27] K. Mackenzie, General Theory of Lie Groupoids and Lie Algebroids, Lecture Notes Series\n213, Cambridge University Press, 2005.\n[28] S. MacLane, Categories for the Working Mathematician, Springer-Verlag, 1971.\n[29] M. Mather, Pull-backs in homotopy theory. Canad. J. Math. 28 (1976), no. 2, 225–263.\n[30] I. Moerdijk, The classifying topos of a continuous groupoid, I, Transactions of the American\nMathematical Society 310 (1988), 629–66.\n[31] I. Moerdijk, Orbifolds as groupoids, in Orbifolds in mathematics and physics, 205–222, Contemp. Math. 310, Amer. Math. Soc., Providence, RI, 2002.\n[32] I. Moerdijk and J. Mrčun, Introduction to foliations and Lie groupoids, 91. Cambridge Studies\nin Advanced Mathematics. Cambridge University Press, 2003.\n[33] I. Moerdijk and D. A. Pronk, Orbifolds, Sheaves and Groupoids, K-theory 13 (1997) 3–21.\n[34] J. Mrčun, Stability and Invariants of Hilsum–Skandalis Maps, Ph.D Thesis, Univ. of Utrecht\n(1996).\n[35] D. A. Pronk, Etendues and stacks as bicategories of fractions, Compositio Mathematica 102\nno. 3 (1996), 243–303.\n[36] I. Satake, On a generalization of the notion of manifold, Proc. Nat. Acad. Sc. 42, (1956),\n359–363.\nDepartment of Mathematics, Wilbur Wright College,\n4300 N. Narragansett Avenue, Chicago, IL 60634, USA\nE-mail address: hcolman@ccc.edu\nURL: http://faculty.ccc.edu/hcolman/\n\n\f"}