{"id": "http://arxiv.org/abs/1201.3252v1", "guidislink": true, "updated": "2012-01-16T13:30:27Z", "updated_parsed": [2012, 1, 16, 13, 30, 27, 0, 16, 0], "published": "2012-01-16T13:30:27Z", "published_parsed": [2012, 1, 16, 13, 30, 27, 0, 16, 0], "title": "Global Quantum Correlation in the Ising model", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1201.0827%2C1201.2325%2C1201.6171%2C1201.2150%2C1201.4268%2C1201.3876%2C1201.1569%2C1201.2554%2C1201.2272%2C1201.1602%2C1201.3577%2C1201.0900%2C1201.3050%2C1201.0843%2C1201.0994%2C1201.1411%2C1201.2633%2C1201.6458%2C1201.2302%2C1201.6157%2C1201.0772%2C1201.4662%2C1201.3700%2C1201.5053%2C1201.2426%2C1201.4670%2C1201.3912%2C1201.3908%2C1201.6600%2C1201.4947%2C1201.2834%2C1201.2993%2C1201.1823%2C1201.4535%2C1201.3976%2C1201.1670%2C1201.3712%2C1201.5595%2C1201.3991%2C1201.2625%2C1201.1093%2C1201.3566%2C1201.5449%2C1201.3544%2C1201.6405%2C1201.3613%2C1201.2669%2C1201.6578%2C1201.5369%2C1201.2001%2C1201.6597%2C1201.5279%2C1201.4400%2C1201.5546%2C1201.1037%2C1201.0471%2C1201.4681%2C1201.3960%2C1201.5066%2C1201.5001%2C1201.3022%2C1201.4967%2C1201.6067%2C1201.2997%2C1201.4868%2C1201.1386%2C1201.6301%2C1201.3837%2C1201.2214%2C1201.5689%2C1201.3608%2C1201.2624%2C1201.2188%2C1201.4341%2C1201.1348%2C1201.0880%2C1201.5232%2C1201.0368%2C1201.3854%2C1201.0318%2C1201.3849%2C1201.4049%2C1201.3824%2C1201.3397%2C1201.6460%2C1201.1322%2C1201.0126%2C1201.1227%2C1201.3870%2C1201.0452%2C1201.3265%2C1201.1486%2C1201.6387%2C1201.5127%2C1201.3252%2C1201.6051%2C1201.2879%2C1201.3300%2C1201.5838%2C1201.0164%2C1201.6406&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Global Quantum Correlation in the Ising model"}, "summary": "We study quantum correlations in an isotropic Ising ring under the effects of\na transverse magnetic field. After characterizing the behavior of two-spin\nquantum correlations, we extend our analysis to global properties of the ring,\nusing a figure of merit for quantum correlations that shows enough sensitivity\nto reveal the drastic changes in the properties of the system at criticality.\nThis opens up the possibility to relate statistical properties of quantum\nmany-body systems to suitably tailored measures of quantum correlations that\ncapture features going far beyond standard quantum entanglement.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1201.0827%2C1201.2325%2C1201.6171%2C1201.2150%2C1201.4268%2C1201.3876%2C1201.1569%2C1201.2554%2C1201.2272%2C1201.1602%2C1201.3577%2C1201.0900%2C1201.3050%2C1201.0843%2C1201.0994%2C1201.1411%2C1201.2633%2C1201.6458%2C1201.2302%2C1201.6157%2C1201.0772%2C1201.4662%2C1201.3700%2C1201.5053%2C1201.2426%2C1201.4670%2C1201.3912%2C1201.3908%2C1201.6600%2C1201.4947%2C1201.2834%2C1201.2993%2C1201.1823%2C1201.4535%2C1201.3976%2C1201.1670%2C1201.3712%2C1201.5595%2C1201.3991%2C1201.2625%2C1201.1093%2C1201.3566%2C1201.5449%2C1201.3544%2C1201.6405%2C1201.3613%2C1201.2669%2C1201.6578%2C1201.5369%2C1201.2001%2C1201.6597%2C1201.5279%2C1201.4400%2C1201.5546%2C1201.1037%2C1201.0471%2C1201.4681%2C1201.3960%2C1201.5066%2C1201.5001%2C1201.3022%2C1201.4967%2C1201.6067%2C1201.2997%2C1201.4868%2C1201.1386%2C1201.6301%2C1201.3837%2C1201.2214%2C1201.5689%2C1201.3608%2C1201.2624%2C1201.2188%2C1201.4341%2C1201.1348%2C1201.0880%2C1201.5232%2C1201.0368%2C1201.3854%2C1201.0318%2C1201.3849%2C1201.4049%2C1201.3824%2C1201.3397%2C1201.6460%2C1201.1322%2C1201.0126%2C1201.1227%2C1201.3870%2C1201.0452%2C1201.3265%2C1201.1486%2C1201.6387%2C1201.5127%2C1201.3252%2C1201.6051%2C1201.2879%2C1201.3300%2C1201.5838%2C1201.0164%2C1201.6406&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We study quantum correlations in an isotropic Ising ring under the effects of\na transverse magnetic field. After characterizing the behavior of two-spin\nquantum correlations, we extend our analysis to global properties of the ring,\nusing a figure of merit for quantum correlations that shows enough sensitivity\nto reveal the drastic changes in the properties of the system at criticality.\nThis opens up the possibility to relate statistical properties of quantum\nmany-body systems to suitably tailored measures of quantum correlations that\ncapture features going far beyond standard quantum entanglement."}, "authors": ["Steve Campbell", "Laura Mazzola", "Mauro Paternostro"], "author_detail": {"name": "Mauro Paternostro"}, "author": "Mauro Paternostro", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1142/S0219749911008404", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1201.3252v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1201.3252v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "Published in the International Journal of Quantum Information as part\n  of the special issue devoted to \"Quantum Correlations: entanglement and\n  beyond\"", "arxiv_primary_category": {"term": "quant-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "quant-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1201.3252v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1201.3252v1", "journal_reference": "IJQI Vol. 9, Issues 7&8 (2011) 1685-1699", "doi": "10.1142/S0219749911008404", "fulltext": "September 18, 2018\nlaPaternostroIJQI\n\n16:33\n\nWSPC/INSTRUCTION FILE\n\nCampbellMazzo-\n\narXiv:1201.3252v1 [quant-ph] 16 Jan 2012\n\nInternational Journal of Quantum Information\nc World Scientific Publishing Company\n\nGLOBAL QUANTUM CORRELATIONS IN THE ISING MODEL\n\nSTEVE CAMPBELL\nPhysics Department, University College Cork, Cork, Ireland &\nCentre for Theoretical Atomic, Molecular and Optical Physics, School of Mathematics and\nPhysics, Queen's University, Belfast BT7 1NN, United Kingdom,\nscampbell@phys.ucc.ie\nLAURA MAZZOLA\nTurku Centre for Quantum Physics, Department of Physics and Astronomy, University of\nTurku, FI-20014 Turun yliopisto, Finland &\nCentre for Theoretical Atomic, Molecular and Optical Physics, School of Mathematics and\nPhysics, Queen's University, Belfast BT7 1NN, United Kingdom,\nl.mazzola@qub.ac.uk\nMAURO PATERNOSTRO\nCentre for Theoretical Atomic, Molecular and Optical Physics, School of Mathematics and\nPhysics, Queen's University, Belfast BT7 1NN, United Kingdom\nReceived Day Month Year\nRevised Day Month Year\nWe study quantum correlations in an isotropic Ising ring under the effects of a transverse\nmagnetic field. After characterizing the behavior of two-spin quantum correlations, we\nextend our analysis to global properties of the ring, using a figure of merit for quantum\ncorrelations that shows enough sensitivity to reveal the drastic changes in the properties\nof the system at criticality. This opens up the possibility to relate statistical properties\nof quantum many-body systems to suitably tailored measures of quantum correlations\nthat capture features going far beyond standard quantum entanglement.\nKeywords: Quantum many-body; quantum correlations; quantum phase transitions\n\n1. Introduction\nQuantum many-body systems of interacting spin particles embody a splendid scenario for the study of quantum statistics, the investigation of fundamental questions\nat the genuine multipartite level and the simulation of non-trivial interaction models of generally difficult natural accessibility. Moreover, a very successful decade\nof theoretical efforts has crowned quantum spin systems as promising devices for\nthe realization of computation and short-haul communication protocols in on-chip\nsolid-state quantum devices1,2,3,4 .\nMuch of the handiness and interest in analyzing chains and rings of interacting\nquantum spins comes from an extensive body of work performed in the area of\n1\n\n\fSeptember 18, 2018\nlaPaternostroIJQI\n\n2\n\n16:33\n\nWSPC/INSTRUCTION FILE\n\nCampbellMazzo-\n\nSteve Campbell, Laura Mazzola, and Mauro Paternostro\n\nso-called exactly solvable models, where analytical and numerical techniques for the\ninvestigation of statistical properties of a vast class of many-body systems have been\nformalized and put in place5,6,7,8 . A nice link between such investigations and a genuine information theoretical viewpoint comes from the study of figures of merit such\nas entanglement in relation to critical properties of interacting many-body systems\ndragged across a quantum phase transition (QPT)5,9,10,11,12,13,14,15,16 . The increasing interest in the understanding of general quantum correlations17,18,19,20,21,22 and\ntheir distinctive features that often depart from those characterizing the latter motivate a research aiming at establishing a connection between statistical properties\nof quantum many-body systems and general quantum correlations. Some interesting steps have been performed along these lines23,24,25 , while the topic still deserves\na more systematic development.\nWe thus present a detailed analysis of the quantum correlations in an Ising\nspin ring in transverse magnetic field 26,27,28 and focus our attention on the global\nproperties of the system. In fact, we aim at establishing a formal parallel between\na recent study by some of us on the genuine non-locality content of the ground\nand thermal state of such a system29 and the degree of global quantum correlations set among the spins by the interaction here at hand. We consider different\nquantifiers of general quantum correlations, each capturing the various aspects of\nsuch a multifaceted problem. We go beyond the study of mere two-spin quantum\ncorrelations to consider, on the contrary, their multipartite version. To this task,\nwe employ a generalization of quantum discord based on a natural extension of\nmutual information to the many-spin scenario30 . We demonstrate the behavior of\nsuch correlations as a function of the transverse magnetic field when changing the\nnumber of spins in the ring. Very interestingly, we show that, while tests for multipartite non-locality fail to reveal the modifications occurring within the system\nat criticality29 , global quantum correlations quite efficiently witness the occurrence\nof a QPT. While a detailed study of such a relation is left for further work31 , we\nbelieve that our analysis sets the ground for a fertile investigation.\nThe remainder of the manuscript is organized as follows: in Sec. 2 we briefly\nreview the Ising model of spin one-half particles arranged in a ring configuration and\nunder the effects of a transverse magnetic field and briefly discuss the technique\nwe use for its diagonalization. In Sec. 3 we recall the definition of bipartite and\nmultipartite quantum correlations we are going to use in this paper. Sections 4 and\n5 are devoted to the study of the behavior of two-spins and global correlations,\nrespectively, in the ground state of the quantum spin chain. Finally, in Sec. 6 we\ndraw our conclusions.\n\n\fSeptember 18, 2018\nlaPaternostroIJQI\n\n16:33\n\nWSPC/INSTRUCTION FILE\n\nCampbellMazzo-\n\nGlobal quantum correlations in the Ising spin model\n\n3\n\n2. The Model\nThe model under investigation is an isotropic Ising chain in a transverse magnetic\nfield. For N coupled spins, the nearest-neighbor Hamiltonian model reads\nĤ = −J\n\nN\nX\n\nσ̂nx\n\n⊗\n\nx\nσ̂n+1\n\n+B\n\nn=1\n\nN\nX\n\nσ̂nz\n\n(1)\n\nn=1\n\nwhere J (B) is a dimensionless parameters representing the inter-spin coupling\nstrength (the global magnetic field) and {σ̂nx , σ̂ny , σ̂nz } is the set of Pauli spin\noperators for spin n=1, .., N . We assume cyclic boundary conditions such that\ni\ni\n9,26,32\nσ̂N\nand here we briefly\n+1 = σ̂1 (i=x, y, z). The model is exactly solvable\nrecall the methodology used to tackle it. In order to diagonalize the Hamiltonian\nwe introduce the raising/lowering operator σ̂ ± = (σ̂nx ± iσ̂ny )/2, and then move into\na new fermionic picture defined by the Jordan-Wigner transformation33\nz\n+\nĉ†n = (ĉn )† = ⊗n−1\nj=1 (−σ̂j )σ̂n ,\n\n{ĉn , ĉ†m } = δnm ,\n\n(2)\n\nwhere δnm is the Kronecker delta. These fermionic variables allow the Hamiltonian\nto be written\nN\nN\nX\nX\n1\n(3)\nĤ= − J\n(ĉ†n − ĉn )(ĉ†n+1 + ĉn+1 ) + 2B\n(ĉ†n ĉn − ).\n2\nn=1\nn=1\nA transformation to the momentum representation is then performed using a\nFourier transform while full diagonalization is achieved by final Bogoliubov transformation introducing new fermionic operators {b̂k , b̂†k } (k = −N/2, .., N/2 − 1) and\ngiving a free-fermion Hamiltonian\nX †\nX\nĤff =\n\u000fk b̂k b̂k −\n\u000fk ,\n(4)\nk\n\nk\n\np\n\nwhere \u000fk = J 2 + B 2 − 2JB cos φk and φk = π(2k + 1)/N in the subsector with\nan even number of fermions and a slightly different definition for the odd-number\ncase29 . The ground state of the system is then the state satisfying the eigenvalue\nequation b̂k |GSN i = 0 ∀k, which gives us\n\u0013\nO\u0012\nθk\nθk\n|GSN i =\ncos\n|00ik,−k + i sin\n|11ik,−k\n(5)\n2\n2\nk\n\nwith tan θk = (−B + J cos φk )/(J sin φk ) and |0iφk (|1iφk ) the state with no (one)\nP\nfermion with momentum φk . The energy of the ground state is ΛN = − k \u000fk .\n3. Bipartite and Multipartite Quantum Correlations\nIn this Section we introduce the main tools used in our investigation. We first review\ntwo figures of merit for quantum correlations in bipartite systems: the quantum\ndiscord and the (ameliorated) measurement-induced disturbance. We then move\nto the multipartite scenario and introduce a measure of multipartite non-classical\ncorrelations proposed by Rulli and Sarandy in Ref. 30 .\n\n\fSeptember 18, 2018\nlaPaternostroIJQI\n\n4\n\n16:33\n\nWSPC/INSTRUCTION FILE\n\nCampbellMazzo-\n\nSteve Campbell, Laura Mazzola, and Mauro Paternostro\n\n3.1. Quantum discord, measurement-induced disturbance and its\nimproved version\nQuantum discord is based on the idea of quantifying the discrepancy between\nthe generalization to the quantum domain of two expressions for the mutual\ninformation17 . Imagine to have a bipartite system described by the density operator ρAB with ρA (ρB ) denoting the reduced state of system A (B). The total\ncorrelations between A and B are quantified by the quantum generalization of mutual information\nI(ρAB ) = S(ρA ) − S(ρA |ρB )\n\n(6)\n\nwhere S(ρA ) = −TrρA log2 ρA is the von Neumann entropy and S(ρA |ρB ) =\nS(ρAB ) − S(ρB ) is the conditional entropy. Nevertheless, by using a measurementbased approach, a second definition of conditional entropy is possible. The application of local projective measurements on a part of the system projects the total\nsystem in a different state. In particular if the measurement is described by the\nset of projectors {ΠjB }, the conditional density operator (i.e. the state of the total\nsystem AB conditioned on the measurement outcome labeled by j) is written as\nρAB|j = (1A ⊗ΠjB )ρAB (1A ⊗ΠjB )/pj , where pj = Tr[(1A ⊗ΠjB )ρAB ] is the probability of outcome j and 1̂ is the identity operator. One thus define the measurementP\nbased conditional entropy S(ρAB |ΠjB ) = j pj S(ρA|j ) with ρA|j = Tr[Π̂jB ρAB ]/pj\nand finds the alternative version of the quantum mutual information\nJ(ρAB ) = S(ρA ) − S(ρAB |ΠjB ),\n\n(7)\n\nwhich is often referred to as one-way classical correlation18 . The difference between\nquantum mutual information and classical correlations, minimized over the whole\nset of orthogonal projective measurements on B, defines quantum discord as\nDB→A (ρAB ) = inf\n[I(ρAB ) − J(ρAB )].\nj\n\n(8)\n\n{ΠB }\n\nIt should be noted that the minimization implied in the definition of DB→A (ρAB )\nmakes its analytical evaluation very difficult. To date, quasi-closed analytic expressions are in fact known only for quite a restricted class of two-spin states40 .\nThe intrinsic asymmetry of Eq. (8) can be lifted by considering the symmetrized\nform D = max[DA→B (ρAB ), DB→A (ρAB )], which is null only on so-called classicalP\nclassical states34 , i.e. density matrices that can be written as ij pij |i, jihi, j| with\n{|ii} and {|ji} single-spin orthonormal sets and pij a joint probability distribution\nfor indices (i, j), and is thus a faithful indicator of quantum correlations.\nIn Ref. 21 Luo introduced measurement-induced disturbance (MID) as a different\nquantifier of quantum correlations based on the alterations induced on a quantum\nmechanical state by a measurement process. Under a bilocal complete projective\nB\nmeasurement {ΠA\ni ⊗ Πk }, a classical state remains invariant, i.e. ρAB ≡ Π(ρAB ) =\nP\nA\nB\nA\nB\nik (Πi ⊗ Πk )ρAB (Πi ⊗ Πk ). On the other hand, any complete local projective\nB\nmeasurement and in particular one built on the eigenprojectors {ΠA\nE,i , ΠE,k } of the\n\n\fSeptember 18, 2018\nlaPaternostroIJQI\n\n16:33\n\nWSPC/INSTRUCTION FILE\n\nCampbellMazzo-\n\nGlobal quantum correlations in the Ising spin model\n\n5\n\nreduced states of A and B, fully decoheres a quantum mechanical state, rendering\nit just a classical statistical distribution of probabilities. The idea behind MID\nis thus to quantify non-classicality by evaluating the difference between ρAB and\nP\nB\nA\nB\nΠE (ρAB ) = ik (ΠA\nE,i ⊗ ΠE,k )ρAB (ΠE,i ⊗ ΠE,k ). Quantitatively, MID is defined as\nM(ρAB ) = I(ρAB ) − I(ΠE (ρAB )).\n\n(9)\n\nEvidently, MID is much easier to compute than quantum discord due to the lack of\nany optimization procedure over the set of projective measurements, and represents\nan upper bound to D. However, such a lack of optimization can lead to inconsistencies between the two indicators: MID can be non-null and even maximal on states\nexhibiting zero quantum discord. To remove this inconsistency an improved version\nof MID (AMID) has been proposed35,36 that includes the ab initio optimization\nover any possible set of local projectors on part A and B. Therefore the definition\nof AMID is\nA(ρAB ) = inf [I(ρAB ) − I(Π(ρAB ))]\nΠ\n\n(10)\n\nB\nwith Π = {ΠA\ni ⊗ Πk } as before. The quantitative relation between discord and\nAMID, which is faithful by construction, has been explored and experimentally\ndemonstrated using a linear optics setup generating a hyperentangled state of four\nphotons37 .\n\n3.2. Global quantum discord\nHere we briefly discuss a measure for the global content of non-classical correlations\nin the state of a multipartite system. By noting that the original definition of\ndiscord17 can be rewritten in terms of relative entropy30 , the following symmetric\nextension of discord can be considered\nDB→A (ρAB ) = S(ρAB ||Π(ρAB )) − S(ρA ||ΠA (ρA )) − S(ρB ||ΠB (ρB ))\n\n(11)\n\nwhere S(ρ1 ||ρ2 ) = Tr[ρ1 log2 ρ1 − ρ1 log2 ρ2 ] is the relative entropy between states\nρ1 and ρ2 . The global quantum discord GD(ρA1 ...AN ), which quantifies multipartite\nnon-classical correlations in a system built out of the set of parties {An }, is defined\nas\n\n\nN\nX\nGD(ρA1 ...AN ) = inf S(ρA1 ...AN ||Π̂(ρA1 ...AN )) −\nS(ρAj ||Π̂j (ρAj )) , (12)\n{Π̂j }\n\nwhere Π̂j (ρAj ) =\n\nP\n\nj0\n\nj=1\n0\n\n0\n\nΠ̂jAj ρAj Π̂jAj and Π̂(ρA1 ...AN ) =\n\nP\n\nk\n\nΠ̂k ρA1 ...AN Π̂k with Π̂k =\n\njl\n⊗N\nl=1 Π̂Al and k denoting the index string (j1 ...jN ). Eq. (12), where the infimum\nis taken over all possible multi-local projectors Π̂j , is always non-negative but its\nmaximum value depends on the dimension of the total Hilbert space at hand.\n\n\fSeptember 18, 2018\nlaPaternostroIJQI\n\n6\n\n16:33\n\nWSPC/INSTRUCTION FILE\n\nCampbellMazzo-\n\nSteve Campbell, Laura Mazzola, and Mauro Paternostro\n\n4. Two-spin Quantum Correlations in the Ground State of an\nIsing Ring\nIn this Section we study the behavior of the two-spin quantum correlations. We\nfix the strength coupling parameter J and investigate the quantum correlations\nshared by pairs of spins \"extracted\" from the ring against the magnetic field B.\nWe also study the behavior of quantum correlations when the ring increases in\nsize and pairs made out of non-nearest-neighbor spins are considered. We compare\nthe indications provided by the various figures of merit for two-qubit non-classical\ncorrelations discussed in the previous Section and highlight a series of interesting\nfeatures.\nAs here we are focusing our attention to two-spin quantum correlations, we can\ntake advantage of the fact that the density matrix of any pair of spins (i, j) can be\nexpressed by means of two-point correlation functions as9\nX\na\nb\nρij = (1̂4 +\nχab\n(13)\nij σ̂i ⊗ σ̂j )/4\na,b=0,x,y,z\na\nb\n0\nwith χ the two-point correlation matrix with entries χab\nij = hσ̂i ⊗ σ̂j i and σ̂i ≡1̂.\nIn general, getting the expressions of such correlators is a difficult task due to the\nnon-local form of the ground state in the Jordan-Wigner representation9 . For completeness of presentation, we should however mention that in the thermodynamic\nlimit of N → ∞, two-point correlations can be expressed in terms of determinants\nof Toeplitz matrices. The symmetries enjoyed by Ĥ are such that the only non-zero\nelements of χ are\n\nχxx\nii+s\n\nχzz\nii+s\n\nG−1 G−2 * * * G−s\nG1 G0\nG0 G−1 * * * G−s+1\nG2 G1\n, χyy\n..\n.. . .\n..\n..\nii+s ..\n.\n.\n.\n.\n.\n.\nGs−2 Gs−3 * * * G−1\nGs Gs−1\n\u0012Z π\n\u00132\n1 + λ cos φ\n1\ndφ\n− Gs G−s ,\n= 2\nπ\n\u000f ̃\n0\n\n* * * G−s+2\n* * * G−s+3\n,\n..\n..\n.\n.\n* * * G1\n\n(14)\n\nwhere s is an integer representing the number of sites of the ring separating the\ntwo elements of the pair being considered. By recasting the Hamiltonian model as\nPN\nx\nĤ = n=1 (−λσ̂nx ⊗ σ̂n+1\n+ σ̂nz ), we have39\nZ\nZ\n1 π\n1 + λ cos φ λ π\nsin φ\nGk =\ndφ cos(kφ)\n−\ndφ sin(kφ)\n(15)\nπ 0\n\u000f ̃\nπ 0\n\u000f ̃\np\nwith λ = J/B and \u000f ̃ = 1 + λ2 + 2λ cos φ. As long as two-spin states are taken into\naccount, the analysis of quantum correlations can be done by directly working on\nthe two-spin reduced density matrix ρij and using the equations above, for arbitrary\nsize of the system. In this work, though, we are interested in global properties of the\nsystem's state, which in principle require arbitrary multipoint correlation functions,\nnot achievable through the apparatus described above. while the considerations to\n\n\fSeptember 18, 2018\nlaPaternostroIJQI\n\n16:33\n\nWSPC/INSTRUCTION FILE\n\nCampbellMazzo-\n\nGlobal quantum correlations in the Ising spin model\n\n7\n\nbe brought forward in this Section will be easily generalized to arbitrarily sized\nsystems, we will consider only finite-length systems to illustrate the key points of\nour study and set useful benchmarks for the analysis presented in Sec. 5. We start\nour analysis by comparing the results coming from the use of the three quantifiers\nintroduced above. In particular we consider the quantum correlations contained in\nthe reduced state of two neighboring spins as measured by quantum discord, MID\nand AMID. In what follows, without affecting the generality of the analysis, we set\nJ = 1 in the model in Eq. (1) and leave B as a free coefficient. In fact, the relevant\nparameter in the dynamics under scrutiny is the ratio B/J.\nA remark is due in respect to the computation of some of the figures of merit\naddressed here. It turns out that the reduced density matrix of any pair of spins in\nour problem can be written, regardless of the value of the magnetic field and the\ncoupling strength, in the X-like form\n\n\n?\n?\n ?? \n\nρij = \n(16)\n ?? \n?\n\n?\n\nwith ? indicating the only non-zero elements of the density matrix. In this case,\ndifferently from what occurs for general two-qubit states, a semi-closed analytic\nformula for the evaluation of Dj→i (ρij ) is available40 (notice that Dj←i (ρij ) can\nbe easily calculated with the very same formula by first applying a Swap gate to\nρij ). While we point the reader to Ref.40 for full details on this, here it is enough\nto mention that we have used such formula for the calculations reported in our\nwork, thoroughly checking the corresponding predictions with an exact numerical\napproach. As for MID, the lack of optimization over the local projective bases makes\nits evaluation straightforward and no further comment is needed in this respect.\nFinally, AMID is calculated exploiting once more the X-like form of the reduced\ntwo-spin states and the formula found for this task in Ref.36 (as for discord, we\nhave duly checked the consistency of the analytic predictions with those of a fully\nnumerical study).\nIn Fig. 1 we present the results corresponding to the case of a ring of N = 6\nspins. At B = 0, the reduced state of any two spins α, β (with α, β = 1, 2, .., N ),\n0\nobtained as ρα,β = Tr{N 0 } (|GSN i hGSN |) (with {N\n√ } = {1, 2, .., N }\\{α, β}) is√an\nequally-weighted mixture of |φ+ i = (|00i + |11i)/ 2 and |ψ+ i = (|10i + |01i)/ 2.\nWhile both discord and AMID predict no quantum correlation in such a class of\nstates, M = 1. One can ascribe such a striking inconsistency of results to the fact\nthat, for such a class of states, the reduced single-spin states are proportional to\nthe identity operator 1̂. This implies that the eigenprojections are undetermined,\nexposing the evaluation of MID to a rather rough overestimation. As soon as B>0,\nthe balance between such two state components is lost and a proper basis of reduced\neigenprojectors can indeed be found. Nevertheless, MID quite considerably tops\nboth D and A. This demonstrates that MID fails to capture the genuine content\n\n\fSeptember 18, 2018\nlaPaternostroIJQI\n\n8\n\n16:33\n\nWSPC/INSTRUCTION FILE\n\nCampbellMazzo-\n\nSteve Campbell, Laura Mazzola, and Mauro Paternostro\n\n1.0\n\n0.6\n\n0.2\n2\n\n6\n\n10\n\nFig. 1. Quantum correlations shared by nearest neighbors in a chain of N = 6 spins plotted\nagainst B for J = 1. The plot shows the clear inconsistency between MID and more faithful\nmeasures of non-classical correlations such as D and A and the upper-bound to discord embodied\nby AMID.\n\nof quantum correlations even in such a simple two-qubit state and, as such, does\nnot embody a faithful figure of merit for our investigation. On the other hand, A\nprovides a much more reliable test, being strictly faithful on classical-classical states\nand only slightly overestimating the symmetrized discord (it should be stressed\nthat the differences between such measures rise from the fact that they address two\ndifferent questions, from an operational viewpoint).\nAs it will be clarified later on, the main point of our analysis is the global\ncontent of quantum correlations in the ground state of the Ising ring. Although an\nextension of AMID to the multipartite scenario is certainly possible, and is quite\nnaturally entailed in the structure of such a figure of merit, the availability of a\nglobal quantum discord as a plausible multi-spin indicator and the fact that A only\nconstitutes an upper bound to quantum discord push us to consider the latter as\nour key tool for the remainder of our analysis.\nWe now consider how the quantum correlation content of the reduced state of\ntwo neighbors depends on the number of spins constituting the whole chain. In Fig. 2\nwe show how discord in the state of nearest neighbors changes when the number of\nspins in the ring grows. Evidently, regardless of the number of sites in the spin ring,\nthe region around B ∼ J is special, as the maximum of shared quantum correlations\ncan be found within it. From a statistical mechanics viewpoint, the valence of such a\nconfiguration of parameters is quite understandable as it corresponds to the region\nwhere the correlation length across the ring diverges. Moreover, using an analysis\nbased on the first derivative of concurrence and discord with respect to B 9,10,38 ,\nit has been predicted that criticality emerges at B = J. As we will show in the\nnext Section, the special nature of this region extends to global general quantum\n\n\fSeptember 18, 2018\nlaPaternostroIJQI\n\n16:33\n\nWSPC/INSTRUCTION FILE\n\nCampbellMazzo-\n\nGlobal quantum correlations in the Ising spin model\n\n9\n\n0.20\n0.15\n0.10\n0.10\n\n8\n\n4\n\n12\n\n0.05\n\n2\n\n4\n\n6\n\n8\n\n10\n\nFig. 2. (Color online) Quantum discord shared by nearest neighbors in a chain of N = 3, 4, 5, 6\nand 8 spins (from top to bottom curve) against the magnetic field B. In the inset we show quantum\ndiscord evaluated at J/B = 1 against the number of spins in the chain between (i) nearest\nneighbors (blue line/circled dot); (ii) next-nearest neighbors (purple line/squared dot); (iii) third\nnearest-neighbors (yellow line/rhombus dot); (iiii) fourth nearest-neighbors (green line/triangular\ndot)\n\ncorrelations.\nThe inset of Fig. 2 shows D in increasingly long rings at a set value of the\nmagnetic field (B = J = 1) and for spins separated by a growing number of sites\n(from zero up to three). The larger the separation, the smaller the value of discord,\nalthough the decrease is rather weak, in stark contrast with what happens to twospin entanglement in the very same spin model9 . Moreover, in Fig. 3 we find that\nthe position of the peaks revealed above changes with the site-separation38 .\n\n5. Global Quantum Correlations in the Ground State of an Ising\nRing\nWe now tackle the central part of our study, i.e. the analysis of global quantum\ncorrelations in the spin model at hand. As anticipated, we make use of the global\nquantum discord proposed in Ref.30 . When approaching the evaluation of GD, one\nfaces the problem encompassed by the calculation of the relative entropy between\nthe ground state |GSN i of the ring and its locally-projected version. For large rings,\nthis could be computationally demanding, let alone the necessity of a global optimization over any possible local projective basis. We thus break the calculation in\na few intermediate steps and algebraic rearrangements that help us in streamlining\nthe evaluation of GD.\nFirst, we consider each single-spin projector Π̂jn as resulting from the application of a rotation R̂n (θj , φj ) on the projectors onto the eigenbasis of σ̂nz , i.e.\n{p̂1 = |↑i h↑| , p̂0 = |↓i h↓|}n . This leaves us with the observation that the post-\n\n\fSeptember 18, 2018\nlaPaternostroIJQI\n\n10\n\n16:33\n\nWSPC/INSTRUCTION FILE\n\nCampbellMazzo-\n\nSteve Campbell, Laura Mazzola, and Mauro Paternostro\n\nmeasurement state of the ring can be rewritten as\n\nΠ̂(|GSN i hGSN |)=\n\nN\n2X\n−1\n\n0\n0\nR̂({θ, φ})P̂k |GSN\n({θ, φ})ihGSN\n({θ, φ})| P̂k R̂† ({θ, φ}),\n\nk=1\n\n(17)\n0\n0\nwhere |GSN\n({θ, φ})ihGSN\n({θ, φ})| = R̂({θ, φ}) |GSN ihGSN | R̂† ({θ, φ}) is the rotated ground state of the ring, R̂({θ, φ}) is the tensor product of all the rotation\nmatrices needed to produce the local projectors, P̂k is the tensor product of projectors over the local σ̂ z eigenbasis and we have used the notation {θ, φ} as a short-cut\nto indicate the whole set of angles that enter the rotations. Clearly, the value of\nlabel k determines the combination of σ̂ z eigenprojectors {p̂0 , p̂1 } to use in order\nto build up the N -spin projector P̂k . In any case, it is obvious from Eq. (17) that\nthe application of each P̂k on the rotated ground state picks up a single diagonal\nelement λk of the latter so that\n0\n0\nP̂k |GSN\n({θ, φ})ihGSN\n({θ, φ})| P̂k =λk P̂k = λk |ki hk|\n\n(18)\n\nz\nwith |ki the N -spin eigenstate of ⊗N\nn=1 σ̂n determined by our choice of k.\nThe set of λk 's, which is straightforward to determine even for a large density matrix, embodies the eigenspectrum of Π̂(|GSN i hGSN |). The latter is obviously diagonal in the rotated basis {|k({θ, φ})i = R̂({θ, φ}) |ki}. By arranging such vectors in columns, we form the passage matrix T such that\n\n0.12\n\n0.12\n0.08\n\n0.08\n0.04\n0.5\n\n1.0\n\n1.5\n\n2.0\n\n0.04\n\n0.00\n0\n\n2\n\n4\n\n6\n\n8\n\n10\n\nFig. 3. (Color online) Quantum discord as a function of the magnetic field between nearest\nneighbors (red solid line), next-nearest neighbors (blue dashed line), third nearest-neighbors (green\ndotted line) in a chain of 8 spins with J = 1. Inset: Magnification of the main panel in the region\nof B ∈ [0, 2].\n\n\fSeptember 18, 2018\nlaPaternostroIJQI\n\n16:33\n\nWSPC/INSTRUCTION FILE\n\nCampbellMazzo-\n\nGlobal quantum correlations in the Ising spin model\n\n(a)\n\n(b)\n\n11\n\n(c)\n3.0\n\n1.5\n\n2.0\n2.0\n\n1.0\n1.0\n\n1.0\n\n0.5\n2\n\n4\n\n6\n\n8\n\n10\n\n1\n\n3\n\n5\n\n1\n\n3\n\n5\n\n7\n\nFig. 4. Global quantum discord against the ratio J/B for Ising rings of increasing size. We have\ntaken N = 3 [panel (a)], 4 [panel (b)] and 5 [panel (a)]. The GD curve at assigned N is a\nuniversal function of B/J, peaking in a region around the critical point of the transverse model\nwe are considering.\n\nT Π̂(|GSN i hGSN |)T † =Λ=diag[λ0 , λ1 , .., λ2N −1 ], which allows us to write\nN\n2X\n−1\n\nS(|GSN i hGSN | ||Π̂(|GSN i hGSN |))=\n\n\u0002\n\u0003\nμk log2 μk −Tr (T † |GSN i hGSN | T ) log2 Λ\n\nk=1\n\n(19)\nwith μk the k eigenvalue of |GSN i hGSN |. Despite its innocence, this expression\nsimplifies the evaluation of the global quantum discord. Needless to say, we still\nface the necessity for the optimization implied in the definition of GD. However, the\nevaluation of its expression prior to this step is now reduced to a computationally\nnon-demanding problem, and this opens up the possibility to explore the thermalstate scenario where the Ising ring is not prepared in its ground state but is affected\nby the influences of a non-zero temperature31 .\nIn what follows, we restrict our attention to the ground-state case and investigate the behavior of GD against the magnetic term B. The results of our calculations\nfor N = 3, 4, 5 spins are shown in Fig. 4 where we have studied GD against the\nratio B/J so as to investigate universality features of such figure of merit with\nrespect to this parameter. At small values of B/J, the ground state of the ring\nis locally equivalent to an N -spin GHZ state26 , for which GD=130 . By increasing\nthe ratio B/J, the system undergoes a profound change in the way correlations\n(not just entanglement) are shared, as it goes from such a genuinely multipartite\nentangled state to a fully separable one achieved for B/J → ∞. The global discord spectacularly captures the special changes in the correlations among the spins\noccurring close to J=B and signals it with a singularity. The functional form of\nGD is independent of the size of the ring, although the decay of collective quantum\ncorrelations is faster for rings of smaller size. Due to the handiness of the analytical\nresults described above, we have been able to numerically sample the behavior of\nGD for N up to 8, finding results in qualitative agreement with the analysis above.\nThe sharp peak in the proximity of B/J = 1 suggests the existence of a singularity\nof GD at criticality. In turn, this would imply a discontinuous first derivative, thus\nsuggesting a second order phase transition, in agreement with what is known for\nth\n\n\fSeptember 18, 2018\nlaPaternostroIJQI\n\n12\n\n16:33\n\nWSPC/INSTRUCTION FILE\n\nCampbellMazzo-\n\nSteve Campbell, Laura Mazzola, and Mauro Paternostro\n\n(a)\n\n(b)\n\n4.5\n\n1.0\n\n3.5\n0.6\n\n2.5\n0.2\n\n1.5\n3\n\n5\n\n7\n\n3\n\n4\n\n5\n\n6\n\n7\n\nFig. 5. (Color online) (a) We study the scaling law regulating the maximum value of global\ndiscord max GD versus the increasing dimension of the spin ring. The dots show the numerical\nresults of our calculations, while the line shows the best linear fit compatible with the constraint\nmax GD≡D↔ =1 for N =2. See the body of the paper for details. (b) Value of the magnetic field\n(B/J)∗ at which max GD is achieved, plotted against N .\n\nthe Ising model. The trend followed by global discord contrasts quite evidently with\nwhat has been found in terms of multipartite non-locality29 : the degree of violation\nof multipartite Bell-like inequalities is a monotonically decreasing function of the\nmagnetic field, thus signaling the profound differences between general quantum\ncorrelations and non-local ones.\nWe have further analyzed the features of GD by looking for some qualitative\nindications on the scaling law regulating the growth of the peak of global discord in\nthe region around B/J = 1. By imposing the constraint max GD≡D↔ =1 at N = 2,\nthe numerical results of our calculations appear to be well fitted by the linear\nfunction\nmax GD = m(N − 2) + 1\n\n(20)\n\nwith m the slope of the line. We have thus found the best-fit line for the numerical\ndata associated with N = 2, .., 7 provided in Table 1, which gives m=0.693461 [a\ncomparison between the best-fit function and the numerical data points is given in\nFig. 5 (a)]. On the other hand, the finite-size nature of the examples worked out\nhere induces some deviations of the value (B/J)∗ of the magnetic field at which\nthe singularity of GD occurs from the expected criticality point. Such deviations\nreduce with N growing [cf. Fig. 5 (b)] as a power-law behavior.\nIn order to build a parallel with the analysis and the similarities between twospin entanglement and discord, it is interesting to compare the behavior of such\nTable 1.\n\nDimension N of the spin ring and associated value of max GD\nN\n\n2\n\n3\n\n4\n\n5\n\n6\n\n7\n\nmax GD\n\n1\n\n1.8296\n\n2.4360\n\n3.0879\n\n3.7095\n\n4.501\n\n\fSeptember 18, 2018\nlaPaternostroIJQI\n\n16:33\n\nWSPC/INSTRUCTION FILE\n\nCampbellMazzo-\n\nGlobal quantum correlations in the Ising spin model\n\n13\n\na global measure of quantum correlations with the predictions of a multipartite\nentanglement measure. To do this, we need a quantum statistical indicator that is\nable to capture the occurrence of a quantum phase transition. To this purpose, we\nadopt the measure for pure states introduced in Ref.41 . Given a composite system\nthat we divide in the bipartition (A, B), we define the measure of entanglement\nE = − log2 [Trρ2A ]\n\n(21)\n\nwith ρA = TrB |ΨiAB hΨ| the reduced state of subsystem A (|ΨiAB is a pure state\nof the whole system). As 1/Trρ2A is viewed as the number of terms entering the\nSchmidt decomposition of |ΨiAB , E is operatively interpreted as the number of\nspins effectively entangled (relatively to the considered bipartition)41 . For a completely separable state Trρ2A = 1, regardless of the bipartition, so that E=0. The\ngeneral scenario will see such an indicator depend on the choice of (A, B) and it\nis intuitive to consider the statistical average E of the values achieved by Eq. (21)\nachieved by exploring all the possible bi-splitting of a system as a measure of the\nmultipartite entanglement shared by its elements. Being this measure statistical in\nnature, the predictions arising from it would be strongly dependent also on higher\nstatistical moments. The variance of the distribution of entanglement across any\npossible bi-splitting, in this respect, provides an indication of the sensitivity of the\nentanglement-sharing to the particular bipartition being taken. A large variance\nsignifies a strong dependence of E on the choice of splitting.\nWhen the apparatus described above is applied to the state of the spin-ring sys ̃ = ∆E/(max ∆E) is\ntem, the typical behavior of E and the normalized variance ∆E\ndisplayed in Fig. 6 (a) (the specific case shown in the figure is relative to N = 6). For\nvanishing values of B/J, E=1 with a zero-width distribution of entanglement across\nthe possible bipartitions, a situation that clearly witnesses the GHZ nature of the\nspin-ring state (whose bipartite entanglement is uniformly distributed across the\nvarious bi-splitting and this achieves ∆E=0). Equally expectedly, for large values of\nB/J no entanglement should be found in the system, regardless of the bipartition.\nAgain, this is well signalled by our analysis, which gives a vanishing E with a quickly\ndecaying associated variance, as the system tends to a fully separable state. The\nintermediate region of values of B/J is the most interesting one: while E smoothly\ndecreases without exhibiting any special behavior (except changing from concave\nto convex), its variance peaks in the region where B∼J [cfr. the vertical marker\nlocated at J = B in Fig. 6 (a)]. Physically, this signifies an increased sensitivity\nof the entanglement-sharing structure to the specific bi-splitting we consider, thus\nmarking the quick departure from the regular entanglement distribution typical of\na GHZ state. Going from an ordered phase (the GHZ one) to a differently ordered\none (corresponding to fully separable states) as B increases, the system is forced to\nreadjust its inner correlations, breaking the symmetry of the way quantum correlations are distributed among its parties and thus increasing the associated variance.\nThis analysis reinforces the idea highlighted above in terms of the behavior of global\ndiscord, that such a phase readjustment is a genuinely global phenomenon that is\n\n\fSeptember 18, 2018\nlaPaternostroIJQI\n\n14\n\n16:33\n\nWSPC/INSTRUCTION FILE\n\nCampbellMazzo-\n\nSteve Campbell, Laura Mazzola, and Mauro Paternostro\n\n(a)\n\n(b)\n\n1.0\n\n(c)\n\n0.014\n\n2.0\n\n0.8\n0.6\n\n0.010\n\n1.5\n\n0.4\n\n0.006\n\n1.0\n\n0.2\n\n0.002\n\n0.5\n\n2\n\n4\n\n6\n\n8\n\n10\n\n0.5\n\n1.0\n\n1.5\n\n2.0\n\n0.002\n\n0.004\n\n0.006\n\n ̃ [dashed\nFig. 6. (a) Partition-averaged entanglement E [solid line] and its normalised variance ∆E\none] for a ring of six spins plotted against the ratio B/J. The vertical line marks the point B=J.\n(b) Comparison among the variances ∆E (as functions of B/J) of the entanglement distributions\nfor a ring of size N = 4, 5, 6 (solid, dashed and dotted line, respectively). We mark the position\nof the maximum of each curve with a dashed vertical line. (c) Comparison between GD and ∆E.\nAs B/J increases, we move along the curve as shown by the arrows.\n\nvery well captured by an equally global indicator of quantum correlations.\nWe should notice that the amplitude of the curve describing ∆E is a function of\nthe ring size N , and so is the location of max ∆E, as it is illustrated in Fig. 6 (b)\nfor N = 4, 5, 6. In analogy with the results displayed in Fig. 5 (a), the maxima are\nwell fitted by a linear function of N and the shifts in their position decreases with\nN . Such similarities call loud for a more direct comparison between GD and ∆E,\nwhich is shown in Fig. 6 (c), where the two figures of merit are plotted against each\nother (for B/J ∈ [10−6 , 6], growing as indicated by the sense of the arrows long the\ncurve and, for easiness of calculation, N = 4). The corresponding open hysteresis\npath shows very clearly the sharpness of the peak of GD and a small (finite-size\ninduced) mismatch between the positions of the maxima of global discord and ∆E.\nSuch relative shift decreases as N grows, thus signalling an increasing accuracy in\ndetermining the actual position of the critical point as the size of the ring increases.\nOn one hand, the study above confirms the predictions coming from the use\nof global discord. On the other hand, it is remarkable in showing that differently\nfrom quantum discord, which is very efficient in pin-pointing the structural phase\ntransition of quantum correlations in the system, the actual quantifier of entanglement chosen here is unable to do so (in analogy with what is found running tests\nof genuinely multipartite non-locality29 ). A more refined statistical analysis is necessary for this task, as shown by the success achieved in using the variance of the\nentanglement distribution.\n6. Conclusions and Further Developments\nWe have studied the behavior of general quantum correlations shared by the elements of a spin system governed by a transverse Ising model under the influences of\na collective magnetic field. Our approach was multifaceted: on one hand, we aimed\nat showing that some degree of care is required in the choice of the indicator of nonclassicality in such a model. Naive choices dictated by the easiness of calculation\n\n\fSeptember 18, 2018\nlaPaternostroIJQI\n\n16:33\n\nWSPC/INSTRUCTION FILE\n\nCampbellMazzo-\n\nGlobal quantum correlations in the Ising spin model\n\n15\n\nimplied by basis-dependent figures of merit may well lead to misleading physical\nconclusions. On the other hand, we have embarked in a quantitative investigation\non the content of multipartite quantum correlations across the spins of a given ring\nprepared in its collective ground state, finding that the deep structural changes occurring close to the ring's critical point are well revealed by a multipartite extension\nof quantum discord. Such conclusions have been confirmed by a statistical analysis\nof the way entanglement is distributed across a ring of a set size: the variance of such\ndistribution agrees in an excellent way with the predictions of global discord, while\nthe average degree of entanglement is basically oblivious to criticality, similarly to\nthe behavior of non-locality indicators for the very same system29 . Our analysis\npaves the way to a more extensive study addressing thermally-affected states and\naiming at relating the behavior of global discord to the most intimate statistical\nproperties of the spin system studied here31 .\nAcknowledgments\nThis work was supported by the Department of Employment and Learning, the\nMagnus Ehrnrooth Foundation and the UK EPSRC (EP/G004759/1).\nReferences\n1.\n2.\n3.\n4.\n5.\n6.\n\nS. Bose, Phys. Rev. Lett. 91 (2003) 207901.\nS. Bose, Contemporary Physics 48, (2007) 13.\nC. Di Franco, M. Paternostro, and M. S. Kim, Phys. Rev. Lett. 101, (2008) 230502.\nC. Di Franco, M. Paternostro, and M. S. Kim, Phys. Rev. Lett. 102, (2009) 187203.\nL. Amico, R. Fazio, A. Osterloh, and V. Vedral, Rev. Mod. Phys. 80, (2008) 517.\nS. Sachdev, Quantum Phase Transitions (Cambridge University Press, Cambridge,\n2000).\n7. J. Eisert, M. Cramer, and M. B. Plenio, Rev. Mod. Phys. 82, (2010) 277.\n8. G. De Chiara, M. Rizzi, D. Rossini, S. Montangero, J. Comput. Theor. Nanosci. 5,\n(2008) 1277.\n9. T. J. Osborne and M. A. Nielsen, Phys. Rev. A 66, (2002) 032110.\n10. A. Osterloh, L. Amico, G. Falci, R. Fazio, Nature (London) 416, (2002) 608.\n11. S.-J. Gu, S.-S. Deng, Y.-Q. Li, and H.-Q. Lin, Phys. Rev. Lett. 93, (2004) 086402.\n12. H. T. Quan, Z. Song, X. F. Liu, P. Zanardi, and C. P. Sun, Phys. Rev. Lett. 96, (2006)\n140604.\n13. C. Cormick, and J. P. Paz, Phys. Rev. A 77, (2008) 022317.\n14. T. J. G. Apollaro, A. Cuccoli, C. Di Franco, M. Paternostro, F. Plastina, and P.\nVerrucchi, New J. Phys. 8, (2010) 083046.\n15. D. Rossini, T. Calarco, V. Giovannetti, S. Montangero, and R. Fazio, Phys. Rev. A\n75, (2007) 032333.\n16. D. Rossini, P. Facchi, R. Fazio, G. Florio, D. A. Lidar, S. Pascazio, F. Plastina, and\nP. Zanardi, Phys. Rev. A 77, (2008) 052112.\n17. H. Ollivier and W. H. Zurek, Phys. Rev. Lett. 88, (2001) 017901.\n18. L. Henderson and V. Vedral, J. Phys. A 34, (2001) 6899.\n19. J. Oppenheim, M. Horodecki, P. Horodecki, and R. Horodecki, Phys. Rev. Lett. 89,\n(2002) 180402.\n20. B. Groisman, S. Popescu, and A. Winter, Phys. Rev. A 72, (2005) 032317.\n\n\fSeptember 18, 2018\nlaPaternostroIJQI\n\n16\n\n16:33\n\nWSPC/INSTRUCTION FILE\n\nCampbellMazzo-\n\nSteve Campbell, Laura Mazzola, and Mauro Paternostro\n\n21. S. Luo, Phys. Rev. A 77, (2008) 022301.\n22. K. Modi, T. Paterek, W. Son, V. Vedral, and M. Williamson, Phys. Rev. Lett. 104,\n(2010) 080501.\n23. T. Werlang, C. Trippe, G. A. P. Ribeiro, and G. Rigolin, Phys. Rev. Lett. 105, (2010)\n095702.\n24. J. Maziero, L. C. Céleri, R. M. Serra, M. S. Sarandy, arXiv:1012.5926.\n25. B. Tomasello, D. Rossini, A. Hamma, and L. Amico, arXiv:1012.4270.\n26. P. Štelmachovič and V. Bužek, Phys. Rev. A 70, (2004) 032313.\n27. D. Gunlycke, S. Bose, V. Kendon and V. Vedral, Phys. Rev. A 64, (2001) 042302.\n28. A. Montakhab and A. Asadian, Phys. Rev. A 82, (2010) 062313.\n29. S. Campbell and M. Paternostro, Phys. Rev. A 82, (2010) 042324.\n30. C. C. Rulli, M. S. Sarandy, arXiv:1105.2548.\n31. S. Campbell, L. Mazzola, and M. Paternostro (in preparation).\n32. E. Leib, T. Schultz, and D. Mattis, Ann. Physics 16, (1961) 407.\n33. P. Jordan and E. Wigner, Z. Physik 47, (1928) 631.\n34. M. Piani, P. Horodecki, and R. Horodecki, Phys. Rev. Lett. 100, (2008) 090502.\n35. S. Wu, U. V. Poulsen, and K. Moelmer, Phys. Rev. A 80, (2009) 032319.\n36. D. Girolami, M. Paternostro, and G. Adesso, J. Phys. A 44, (2011) 352002.\n37. A. Chiuri, G. Vallone, M. Paternostro, and P. Mataloni, Phys. Rev. A 84, (2011)\n020304(R).\n38. R. Dillenschneider Phys. Rev. B 78, (2008) 224413.\n39. E. Barouch and B. M. McCoy, Phys. Rev. A 3, (1971) 786.\n40. M. Ali, A. R. P. Rau, and G. Alber, Phys. Rev. A 81, (2010) 042105.\n41. P. Facchi, G. Florio, and S. Pascazio, Phys. Rev. A 74, (2006) 042331.\n\n\f"}