{"id": "http://arxiv.org/abs/0902.0080v1", "guidislink": true, "updated": "2009-02-02T17:05:21Z", "updated_parsed": [2009, 2, 2, 17, 5, 21, 0, 33, 0], "published": "2009-02-02T17:05:21Z", "published_parsed": [2009, 2, 2, 17, 5, 21, 0, 33, 0], "title": "Comprehensive study of sodium, copper, and silver clusters over a wide\n  range of sizes 2=<N=<75", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0902.4628%2C0902.1321%2C0902.2904%2C0902.1543%2C0902.4422%2C0902.2890%2C0902.2412%2C0902.1377%2C0902.1450%2C0902.2351%2C0902.1648%2C0902.0505%2C0902.2066%2C0902.0688%2C0902.1908%2C0902.4096%2C0902.0065%2C0902.0920%2C0902.4606%2C0902.0880%2C0902.0756%2C0902.1196%2C0902.4107%2C0902.2299%2C0902.3085%2C0902.0786%2C0902.1394%2C0902.1784%2C0902.4184%2C0902.4307%2C0902.1454%2C0902.1042%2C0902.2603%2C0902.1101%2C0902.0732%2C0902.3420%2C0902.4303%2C0902.1557%2C0902.2373%2C0902.4436%2C0902.1901%2C0902.4844%2C0902.4752%2C0902.0181%2C0902.2142%2C0902.1812%2C0902.1760%2C0902.4050%2C0902.2905%2C0902.0359%2C0902.1229%2C0902.0154%2C0902.2210%2C0902.3153%2C0902.2786%2C0902.3196%2C0902.0151%2C0902.1207%2C0902.0216%2C0902.3013%2C0902.0010%2C0902.4120%2C0902.3323%2C0902.2961%2C0902.2664%2C0902.2483%2C0902.1164%2C0902.4762%2C0902.4533%2C0902.1304%2C0902.4298%2C0902.2594%2C0902.3031%2C0902.3734%2C0902.4875%2C0902.1398%2C0902.1751%2C0902.2344%2C0902.0500%2C0902.1699%2C0902.3429%2C0902.1553%2C0902.1537%2C0902.1826%2C0902.1741%2C0902.0456%2C0902.3173%2C0902.0811%2C0902.3142%2C0902.3450%2C0902.2590%2C0902.2798%2C0902.3315%2C0902.3101%2C0902.0233%2C0902.0177%2C0902.0080%2C0902.4541%2C0902.0485%2C0902.3970%2C0902.4658&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Comprehensive study of sodium, copper, and silver clusters over a wide\n  range of sizes 2=<N=<75"}, "summary": "The geometric and electronic structures of NaN, CuN, and AgN metal clusters\nare systematically studied based on the density functional theory over a wide\nrange of cluster sizes 2=<N=<75. A remarkable similarity is observed between\nthe optimized geometric structures of alkali and noble metal clusters over all\nof the calculated cluster sizes N. The most stable structures are the same for\nthe three different metal clusters for approximately half the cluster sizes N\nconsidered in this study. Even if the most stable structures are different, the\nsame types of structures are obtained when the meta-stable structures are also\nconsidered. For all of the three different metal clusters, the cluster shapes\nchange in the order of linear, planar, opened, and closed structures with\nincreasing N. This structural type transition leads to a deviation from the\nmonotonic increase in the volume with N. A remarkable similarity is also\nobserved for the N dependence of the cluster energy E(N) for the most stable\ngeometric structures. The amplitude of this energy difference is larger in the\ntwo noble metal clusters than in the alkali metal cluster. This is attributed\nto the contribution of $d$ electrons to the bonds. The magic number is defined\nin the framework of total energy calculations for the first time. In the case\nof NaN, a semi-quantitative comparison between the experimental abundance\nspectra (Knight et al., Phys. Rev. Lett., 52, 2141 (1984)) and the total energy\ncalculations is carried out. The changing aspect of the Kohn-Sham eigenvalues\nfrom N=2 to N=75 is presented for the three different metal clusters. The\nfeature of the bulk density of states already appears at N=75 for all of three\nclusters. With increasing N, the HOMO-LUMO gap clearly exhibits an odd-even\nalternation and converges to 0.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0902.4628%2C0902.1321%2C0902.2904%2C0902.1543%2C0902.4422%2C0902.2890%2C0902.2412%2C0902.1377%2C0902.1450%2C0902.2351%2C0902.1648%2C0902.0505%2C0902.2066%2C0902.0688%2C0902.1908%2C0902.4096%2C0902.0065%2C0902.0920%2C0902.4606%2C0902.0880%2C0902.0756%2C0902.1196%2C0902.4107%2C0902.2299%2C0902.3085%2C0902.0786%2C0902.1394%2C0902.1784%2C0902.4184%2C0902.4307%2C0902.1454%2C0902.1042%2C0902.2603%2C0902.1101%2C0902.0732%2C0902.3420%2C0902.4303%2C0902.1557%2C0902.2373%2C0902.4436%2C0902.1901%2C0902.4844%2C0902.4752%2C0902.0181%2C0902.2142%2C0902.1812%2C0902.1760%2C0902.4050%2C0902.2905%2C0902.0359%2C0902.1229%2C0902.0154%2C0902.2210%2C0902.3153%2C0902.2786%2C0902.3196%2C0902.0151%2C0902.1207%2C0902.0216%2C0902.3013%2C0902.0010%2C0902.4120%2C0902.3323%2C0902.2961%2C0902.2664%2C0902.2483%2C0902.1164%2C0902.4762%2C0902.4533%2C0902.1304%2C0902.4298%2C0902.2594%2C0902.3031%2C0902.3734%2C0902.4875%2C0902.1398%2C0902.1751%2C0902.2344%2C0902.0500%2C0902.1699%2C0902.3429%2C0902.1553%2C0902.1537%2C0902.1826%2C0902.1741%2C0902.0456%2C0902.3173%2C0902.0811%2C0902.3142%2C0902.3450%2C0902.2590%2C0902.2798%2C0902.3315%2C0902.3101%2C0902.0233%2C0902.0177%2C0902.0080%2C0902.4541%2C0902.0485%2C0902.3970%2C0902.4658&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "The geometric and electronic structures of NaN, CuN, and AgN metal clusters\nare systematically studied based on the density functional theory over a wide\nrange of cluster sizes 2=<N=<75. A remarkable similarity is observed between\nthe optimized geometric structures of alkali and noble metal clusters over all\nof the calculated cluster sizes N. The most stable structures are the same for\nthe three different metal clusters for approximately half the cluster sizes N\nconsidered in this study. Even if the most stable structures are different, the\nsame types of structures are obtained when the meta-stable structures are also\nconsidered. For all of the three different metal clusters, the cluster shapes\nchange in the order of linear, planar, opened, and closed structures with\nincreasing N. This structural type transition leads to a deviation from the\nmonotonic increase in the volume with N. A remarkable similarity is also\nobserved for the N dependence of the cluster energy E(N) for the most stable\ngeometric structures. The amplitude of this energy difference is larger in the\ntwo noble metal clusters than in the alkali metal cluster. This is attributed\nto the contribution of $d$ electrons to the bonds. The magic number is defined\nin the framework of total energy calculations for the first time. In the case\nof NaN, a semi-quantitative comparison between the experimental abundance\nspectra (Knight et al., Phys. Rev. Lett., 52, 2141 (1984)) and the total energy\ncalculations is carried out. The changing aspect of the Kohn-Sham eigenvalues\nfrom N=2 to N=75 is presented for the three different metal clusters. The\nfeature of the bulk density of states already appears at N=75 for all of three\nclusters. With increasing N, the HOMO-LUMO gap clearly exhibits an odd-even\nalternation and converges to 0."}, "authors": ["Masahiro Itoh", "Vijay Kumar", "Tadafumi Adschiri", "Yoshiyuki Kawazoe"], "author_detail": {"name": "Yoshiyuki Kawazoe"}, "author": "Yoshiyuki Kawazoe", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1063/1.3187934", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/0902.0080v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0902.0080v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "21 pages, 10 figures", "arxiv_primary_category": {"term": "cond-mat.mtrl-sci", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cond-mat.mtrl-sci", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0902.0080v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0902.0080v1", "journal_reference": null, "doi": "10.1063/1.3187934", "fulltext": "Comprehensive study of sodium, copper, and silver clusters\nover a wide range of sizes 2 ≤ N ≤ 75\nMasahiro Itoh,1, 2, ∗ Vijay Kumar,1, 3 Tadafumi Adschiri,2, 4 and Yoshiyuki Kawazoe1\n\narXiv:0902.0080v1 [cond-mat.mtrl-sci] 2 Feb 2009\n\n1\n\nInstitute for Materials Research, Tohoku University, Aoba-ku, Sendai 980-8577, Japan\n2\nInstitute of Multidisciplinary Research for Advanced Materials,\nTohoku University, Aoba-ku, Sendai 980-8577, Japan\n3\nDr.Vijay Kumar Foundation, 45 Bazaar Street, K. K. Nagar (West), Chennai 600 078, India\n4\nAdvanced Institute for Materials Research, WPI,\nTohoku University, Aoba-ku, Sendai 980-8577, Japan\n(Dated: December 3, 2018)\nThe geometric and electronic structures of NaN , CuN , and AgN metal clusters are systematically\nstudied based on the density functional theory over a wide range of cluster sizes 2 ≤ N ≤ 75. A\nremarkable similarity is observed between the optimized geometric structures of alkali and noble\nmetal clusters over all of the calculated cluster sizes N . The most stable structures are the same for\nthe three different metal clusters for approximately half the cluster sizes N considered in this study.\nEven if the most stable structures are different, the same types of structures are obtained when the\nmeta-stable structures are also considered. For all of the three different metal clusters, the cluster\nshapes change in the order of linear, planar, opened, and closed structures with increasing N . This\nstructural type transition leads to a deviation from the monotonic increase in the volume with N .\nA remarkable similarity is also observed for the N dependence of the cluster energy E(N ) for the\nmost stable geometric structures. The amplitude of this energy difference is larger in the two noble\nmetal clusters than in the alkali metal cluster. This is attributed to the contribution of d electrons\nto the bonds. The magic number is defined in the framework of total energy calculations for the\nfirst time. In the case of NaN , a semi-quantitative comparison between the experimental abundance\nspectra (Knight et al., Phys. Rev. Lett. 52, 2141 (1984)) and the total energy calculations is\ncarried out. The changing aspect of the Kohn-Sham eigenvalues from N = 2 to N = 75 is presented\nfor the three different metal clusters. The feature of the bulk density of states already appears at\nN = 75 for all of three clusters. With increasing N , the HOMO-LUMO gap clearly exhibits an\nodd-even alternation and converges to 0. Although there is a similarity in the N dependence of the\nHOMO-LUMO gap between the three metal clusters, it is much stronger between the two noble\nmetal clusters. The growth aspect of the d band below the Fermi level of the noble metal clusters\nwith increasing N is presented. A good correspondence is observed in the d characteristic of the\nelectronic states between the cluster composed of 75 atoms and the bulk metal. The similarities\nobserved in the N dependence of the geometric structures and E(N )s originate from the similarity\nin that of the electronic structures.\nPACS numbers:\n\nI.\n\nINTRODUCTION\n\nIt is beneficial to study the geometric structures and\nvarious electronic properties of clusters as an intermediate phase of materials between isolated and condensed\nsystems; the combination of quantum chemistry and solid\nstate physics will result in further developments in the\nfield of materials science. In the basis of the density\nfunctional theory (DFT)1,2 , an ab initio many-body theory for systems in the ground state, a detailed comparative study of the most and meta-stable geometric and\nelectronic structures of three different metal clusters NaN , CuN , and AgN - is systematically carried out over\na wide range of 2 ≤ N ≤ 75. The three types of atoms\ncomposing those clusters have a common feature in that\nthe outermost valence electron is one s electron. The\nchanging and converging aspects of the geometric and\nelectronic structures of alkali and noble metal clusters\nfrom a diatomic molecule (dimer) to a condensed system\nhave been presented explicitly and compared for the first\n\ntime. A simple review of previous studies on clusters is\npresented below.\nIn 1984, a study was carried out based on the WoodsSaxon type shell model3 to explain the distinctive peak\nobserved in the abundance spectra of a NaN cluster at\nspecial value of N (N = 8, 20, 40, 58, 92, ...) evaluated in\nan experiment. Using this shell model, the electronic\nstructures of simple metal clusters based on a simple\nspherical effective potential using phenomenological parameters. In this model, the Coulomb interactions between electrons are completely neglected. In a later\nstudy, the anormalous N -dependent stability of a NaN\ncluster was studied based on various types of shell models\nsuch as a harmonic oscillator, with the effect of Coulomb\ninteractions being neglected4 .\nIn addition to simple shell models, various types of jellium models5,6,7 were adopted for NaN clusters. In jellium models for metal clusters, the equilibrium ionic configuration of a cluster is averaged and replaced by a uniform or nearly uniform potential with a surface boundary. In most previous studies, the jellium models were\n\n\f2\nincorporated with the DFT and the total energies were\nevaluated.\nIn model-based studies of NaN , the N -dependent cluster stability was evaluated based on the shell correction\nenergy, curvature of the sum of the electronic eigenvalues,\nand total energy5,6,7,8,9,10,11,12,13,14,15 . For the evaluation of the N -dependent total energy, a semi-quantitative\ncomparison with the peak intensity I(N ) in the experimental abundance spectra16 was also carried out.\nHowever, cluster studies based on these models differ from those based on the first principles calculations,\nwhich directly relate the geometric structures to the electronic structures. Even if the experimental magic number\nfor a particular value of N is obtained accidentally, these\nmodels are not based on a close relationship between the\ngeometric and electronic structurtes of real NaN clusters.\nFurthermore, using these models, it is impossible to study\nthe similarities and differences between the alkali metal\ncluster NaN and the noble metal clusters CuN and AgN\nbecause the s electron in the outermost shell as well as d\nelectrons in the inner shell contribute to bonding in the\nlatter.\nRecenly, the most and meta-stable structures of NaN ,\nCuN , and AgN clusters were determined for N ≤ 22 from\nfirst principles calculations based on DFT17,18,19,20,21 . In\nthis study, an extremely systematic comparative study\nbased on DFT was carried out for the three different\nmetal clusters up to N = 75. Our study successfully\nreproduced the results of stable geometric structures\nobtained in previous studies; furthermore, it successfully discovered the convergence aspects of the electronic\nstructures of clusters with those of bulk metals.\nIn section II, the computational method and the approximation are described. In section III, for the most\nand meta-stable structures are systematically classified\nand the similarities and differences between the three different metal clusters are described. In section IV, the N\ndependence of the ground state energy of the most stable\ncluster structure is analyzed. In section V, all aspects of\nthe electronic structure of the clusters including the oddeven alternation of the HOMO-LUMO gap are described.\nIn section VI, the conclusion of this study is presented.\n\nII.\n\nCOMPUTATIONAL METHODS\n\nAn exact many-body theory for a ground state system\nDFT1,2 - was employed to study the geometric and electronic structures of NaN , CuN , and AgN clusters. In this\ntheory, the many-body Schrödinger equation is transformed into a self-consistent Schrödinger - type equation for a virtual one - electron in the reference system. This equation is called the Kohn-Sham equation\nand it is derived from the Hohenberg-Kohn variational\nprinciples, namely, δE[ρ(r)]\n= 0. In the DFT, various\nδρ(r)\nphysical properties of materials such as the exact ground\nstate total energy can be evaluated if the exact exchangecorrelation energy functional is adopted. In principle, the\n\nexact ionization energy for a system can be evaluated as\nthe highest occupied molecular orbital energy by solving\nthe Kohn-Sham equation. The other orbital energies are\nconsidered to approximately describe the quasiparticle\nenergy.\nIn this study, the generalized gradient approximation\n(GGA) proposed by Perdew and Wang (PW91)22 is employed for the exchange-correlation energy functional.\nThe spin polarization of the system was also considered. In the local density approximation (LDA), which\nwas the first approximation developed for the exchangecorrelation energy functional, the energy functional for\na real inhomogeneous system is locally approximated by\nan energy functional of a homogeneous electron liquid.\nThe main disadvantage of the LDA is the incomplete\ncancellation of the self-interaction fused into the Hartree\npotential by the exchange potential. This leads to an\nincorrect description of the electronic properties when\nelectrons are strongly localized in the system. In fact,\nthe GGA was developed to overcome this disadvantage\nof the LDA. It improves upon the approximation of several physical properties such as interatomic distance and\ncohesive energy in many systems.\nIn order to reduce the number of plane waves used in\nthe calculation of the electronic structure, a pseudopotential method is employed for an approximation of the\nnucleus, inner core electrons, and valence electrons. An\nunempirical pseudopotential called ultrasoft pseudopotential, which is known to have good transferability23 ,\nwas employed. In a manner similar to other methods,\nrelativistic correction terms such as the mass velocity\nand the Darwin terms are included in the pseudopotentials. For Na, Cu, and Ag atoms, 3s1 , 3d10 4s1 , and\n4d10 5s1 electrons were explicitly treated as the valence\nelectrons, respectively.\nA local orbital basis set is commonly adopted within a\nreal space representation for the electrons of isolated systems such as atoms, molecules, and clusters. However, it\nis difficult to converge the total energy effectively because\nsome expertise is required to select the basis function for\neach atom.\nInstead of treating the isolated system as is, the total energy can be effectively converged by using a plane\nwave basis set within a reciprocal space representation,\nwhich is frequently used in periodic systems. Here, isolated systems are approximated by pseudo-crystal systems constructed using arranged isolated systems having\nsufficient space between them.\nIn this method, the total energy can be effectively\nconverged by simply increasing the cut-off energy of a\nplane wave expansion. The total energy of the cluster\nis approximately evaluated from the total energy of the\npseudo-crystal system per unit cell. Another advantage\nof employing this method is that it is possible to evaluate\nthe total energies and electronic structures of the clusters\nand bulk solids using a single method.\nHowever, the latter method has two disadvantages in\nthe study of isolated systems. The first is the incom-\n\n\f3\npleteness of removing the interaction between isolated\nsystems. The second is the inability to separate the total\nenergy into the kinetic energy term of electrons, and potential terms between electron and electron, electron and\nnucleus, and nucleus and nucleus. This is because the\nEwald method24 is adopted for the evaluation of the total energy. In this method, the total energy is effectively\nconverged by separating the Coulomb potential into the\nshort- and long-range parts, and then treating the former\nin the real space and the latter in the reciprocal space.\nThe edge length of each cubic unit cell of the pseudocrystal systems was set to be 20∼30 Å for NaN clusters, and 15∼30 Å for CuN and AgN clusters. It was\nconfirmed that these lengths are sufficiently large to neglect the electronic wave vector dependence in these electronic structures. The cut-off energy for the plane wave\nexpansion was set to be 48.7, 233.7, and 180.7 eV for\nNaN , CuN , and AgN , respectively. Brillouin zone integration was carried out only for the Γ-point in the\npseudo-crystal system. This k -point selection is known\nto be the most effective in the calculation of an isolated\nsystem. The residual minimization scheme, direct inversion in the iterative subspace algorithm was adopted for\nthe effective self-consistent calculation of the electronic\nstructures25,26 . The convergence criterion of the total\nenergy was set to be within 1 × 10−4 eV.\nGeometric structures of the clusters were optimized\nfrom several hypothetical initial structures using an\noptimization algorithm called the conjugate gradient\nmethod27 . As initial structures in the geometry optimization procedure for NaN and CuN , the optimized cluster\nstructures obtained from empirical atomic pair potentials such as Lennard-Jones, Morse, Sutton-Chen, etc.28 ,\nwere employed along with optimized structures based on\nfirst principles calculations that were obtained in previous studies18,19,20 .\nIn addition to these structures, structures expected to exist from the experimental photoelectron\nspectra29,30,31,32,33 and those expected to exist in the\nneighborhood of the local minimum points on the potential energy surface from our experience of the optimization procedures for these systems18 were selected.\nThe optimized structures of NaN and CuN obtained in\nthis study were employed as the initial structures of AgN\nin the geometry optimization procedure, and the interatomic distances satisfying the nearest neighbor atomic\ndistance ratio between the Na, Cu, and Ag bulk crystals\nwere scaled.\nThe electronic density of states of the Na, Cu, and Ag\nbulk crystals were calculated for comparison with those of\nthe clusters. The same cut-off energies and optimization\nmethod used for the cluster systems were also used for the\nbulk calculations. The lattice constants were optimized\nfor the hcp and bcc structures for Na, and the fcc structure for Cu and Ag. Brillouin zone integration was carried out for the k -point meshes generated by MonkhorstPack scheme34 . For the bulk bcc, fcc, and hcp structures,\nthe number of meshes were selected to be 8 × 8 × 8, 8\n\n× 8 × 8, and 8 × 8 × 4, respectively. The convergence\ncriteria of the total energy for the bulk bcc, fcc, and hcp\nstructure were set to be within 1.0 × 10−4 , 1.0 × 10−4 ,\nand 5.0 × 10−3 eV/atom, respectively.\nThe nearest neighbor diatomic distances, binding energies, and bulk moduli for the dimers and bulk crystals\nare presented, in the Appendix.\nThe Vienna Ab-initio Simulation Package (VASP) was\nemployed in this study35 .\n\nIII.\nA.\n\nCLUSTER GEOMETRIES\n\nN dependence of most and meta-stable\nstructures\n\nIn general, unlike the case of molecules, clusters\nhave various energetically nearly degenerated metastable structures. Therefore, the meta-stable as well\nas most stable structures must be considered for understanding cluster-related phenomena.\nFigures 1, 2, and 3 show the most and meta-stable\nstructures of the NaN , CuN , and AgN clusters for 3 ≤\nN ≤ 12, 13 ≤ N ≤ 22, and 34 ≤ N ≤ 75, respectively.\nIn these figures, the meta-stable structures are carefully\nselected to show the structural type transition, as described below. Almost all of the most and meta-stable\nstructures of the NaN , CuN , and AgN clusters are similar. Therefore, to save space, the cluster structures are\nrepresented by the structure of CuN in the figure. The\ntypes of these structures are classified by the notations\nI, II, III, IV, and V. This classification obeys the order\nof stability in the structural type of CuN . The symbols\nL, P, O, and C after I, II, III, IV, and V indicate linear,\nplanar, opened, and closed structures, respectively. For\na detailed analysis of the correlation between the structural type and the energetical stability of the clusters,\nthese structural types should be further classified according to the symbols. Both opened and closed structures\nare three-dimensional. The coordination number (CN) is\na necessary concept for the classification of these threedimensional structures. Although the CN can also be defined for linear and planar structures, it is not required\nfor the classification in this study. An opened structure\nis defined as one without atoms whose CNs are greater\nthan or equal to 11. Other three-dimensional structures\nare defined as closed structures. The three values listed\nafter the symbols L, P, O, and C represent the relative\nenergies of the most stable structures of NaN , CuN , and\nAgN , respectively. A value of 0.000 is assigned to the\nmost stable structure, and the relative energies of the\nmeta-stable structures are expressed in electron volts.\nWe consider the case of N = 6 as an example. As\nshown in FIG.1, the structural type of the most stable\nstructure in Na6 is II, while that in Cu6 and Ag6 is I.\nThe structural types of the 2nd stable structures I in\nNa6 are I and in Cu6 and Ag6 , II. The structural type\nof the 3rd stable structures in Cu6 and Ag6 is III. How-\n\n\f4\never, structure III is not found in Na6 . A symbol N\nindicates a structural type that has not been found. The\ntwo different figures of structure II show the same cluster\nstructure viewed from different angles. Such different figures for the same structure are also shown for the other\nvalues of N . Structural type IV at N = 10 corresponds\nto Plato's polyhedron. The numerous highly symmetric structures including Plato's polyhedron are labeled as\nTETRA, OCTA, ICO, CUBO, and DECA, and they respectively represent a tetrahedron, octahedron, icosahedron, cuboctahedron, and decahedron, respectively. As\nshown in FIGS.2 and 3 the three structures composed of\nblue, red, and silver spheres represent the structures of\nNaN , CuN , and AgN , respectively These structures are\nshown to emphasize the relatively large structural differences from the relation of similarity.\nThe following conclusions are obtained from the most\nand meta-stable structures of the clusters. The optimized\nstructures of the NaN , CuN , and AgN clusters are almost identical if the most and meta-stable structures are\nsimultaneously considered. In particular, the most stable\nstructure of the three clusters for N ≤ 22 can be identified with high probability. For N = 34 and 38, all of the\nmost stable structures of the three clusters are different.\nFor N = 40, the most stable structures of alkali and noble metal clusters clearly differ. For N = 55, all of the\nthree different clusters favor structural type I (icosahedral structure) for their most stable structure. The 2nd\nand 3rd stable structures at N = 55 include an atomic\nvacancy in an icosahedral flame36 . For all of the three\ndifferent metal clusters, these meta-stable structures are\nmore stable than the higher symmetric structures such\nas a decahedron and cuboctahedron. Generally, it is difficult to define an atomic vacancy in a cluster because it\nis a system without periodicity in the structure. However, an icosahedral structure can be considered to be\na structure that is cleaved from a quasicrystal. In fact,\nN = 55 is the minimum number that shows an atomic\nvacancy stability in the cluster structure. For N ≥ 55,\nwith increasing N , structures of the clusters approach the\nperiodic bulk crystal structure. Therefore, it is expected\nthat the probability of vacancy formation will increase in\nfinite cluster systems.\nAn overview of the structural type transition of the\nmost stable structures in NaN , CuN , and AgN clusters\nwith increasing N is described below. The structures of\nNaN , CuN , and AgN clusters are stable in a linear structure at N = 2, planar structure at 3 ≤ N ≤ 5 (Na), 6\n(Cu, and Ag), opened structure at 6 (Na), 7 (Cu and Ag)\n≤ N ≤ 15 (Na and Cu), 16 (Ag), and closed structure at\nN ≥ 16 (Na and Cu), 17 (Ag). Systems comprising for or\nmore atoms can possibly assume three-dimensional structures such as a tetrahedron and trigonal pyramid. However, for all of the three different metal clusters, the most\nstable structures are not three-dimensional at 4 ≤ N ≤ 5\n(Na), 6 (Cu, and Ag). At N = 4, the 3 dimensional structures are not stable for these systems. Instead, a rhombus structure is stable at N = 4. A three-dimensional\n\nstructure such as a tetrahedron is realized in other metal\nclusters such as Mg4 37 .\nThe stable cluster structures obtained in this study can\nbe roughly understood from knowledge of the electronic\nstates using the spherical jellium model. The main difference between the first principles model used in this\nstudy and the spherical jellium model is the manner in\nwhich the atomic configuration in the cluster is treated.\nIn the spherical jellium model, only the outermost valence electrons in the each atom composing the cluster\nare considered as valence electrons. The other electrons\nand nuclei are unified into an uniform positive charge distribution with a spherical surface boundary. Therefore,\nthe valence electrons in the spherical jellium model reside\nin the central force field. As a result, each degenerated\nvalence electronic state is specified with a monoangular\nmomentum: S, P, D, F, ..., in a manner similar to the case\nof electrons in an atom and protons and neutrons in a nucleus. The stable structures of the metal cluster obtained\nin this study can be roughly considered as those satisfying the cluster shapes followed by the valence electronic\ndensity distribution that originates from the occupied orbitals in the spherical jellium model.\n\nB.\n\nN dependence of the averaged nearest neighbor\ndistance and coordination number\n\nFigure 4 (a) shows the averaged nearest neighbor distance (ANND) of the most stable structures of NaN ,\nCuN , and AgN clusters for 2 ≤ N ≤ 75. ANND is defined as the sum of the nearest neighbor atomic distances\ndivided by the number of bonds in a cluster. As shown\nin the figure, the ANND value of the cluster reaches approximately 90% of the bulk value at N = 20 for all of\nthe three different clusters. However, the ANND does\nnot converge to the bulk value at N = 75, and the values\nare approximately 98% of the bulk ones. Over the entire\nrange of N , the ratio of ANND among the three different\nclusters agrees well with that of the bulk crystals.\nFigure 4 (b) shows the averaged coordination number\n(ACN) of the most stable structures of NaN , CuN , and\nAgN clusters over the range of 2 ≤ N ≤ 75. ACN is\ndefined as the sum of the nearest neighbor coordinated\natomic number for all atoms composing the cluster divided by N . The N dependence of ACN for the three\ndifferent clusters is similar; it should be noted that the\nACN values do not reach 9 (75% of the bulk value of 12)\neven at N = 75. This is attributable to the existence of\na surface in the cluster.\n\nC.\n\nDifference between planar structures of sodium,\ncopper, and silver clusters\n\nAs described in section III. A., the most and metastable structures of the three different metal clusters\nare quite similar. Here, the cluster structures hav-\n\n\f5\ning the same structural type are compared quantitatively using structure III at N = 7 as an example.\nFIG. 5 shows the details of the structures, represented\nby the Cu7 structure as an example. The three values represent the angle or interatomic distance of Na7 ,\nCu7 , and Ag7 , respectively. These values are expressed\nin degrees or angstroms, respectively. The blue and\ngreen values in parentheses represent the relative angle ratios: angle (distance)N a7 /angle(distance)Cu7 and\nangle(distance)Ag7 /angle(distance)Cu7 , respectively.\nStructure III in Na7 belongs to the C2h point group,\nwhile in Cu7 and Ag7 , it belongs to the D2h point group;\nall of these structures are 3rd stable structures. These\nstructures have a Jahn-Teller deformation38 in the equilateral hexagon in the D6h point group. As expected, the\nrelative angle ratio of Ag7 is closer to 1 than that of Na7 .\nThis is a typical example that indicates the stronger similarity between the two noble metal clusters. However,\nthere are several exceptions in clusters having a larger\nvalue of N . This may occur due to the increase in the\nnumber of degrees of freedom in the atomic positions.\nTherefore, it is not possible to present an oversimplified\npicture of the degree of similarity in these cluster structures.\nD.\n\nN dependence of the averaged atomic density\n\nThe averaged atomic volume of cluster v(N ) is defined\nas\nv(N ) ≡\n\n4\nπhRi3 /N.\n3\n\n(1)\n\nHere, hRi indicates the an averaged distance between\neach atomic coordination Ri and center of mass RCM\nin a cluster. In other words, hRi is given as\nhRi =\n\nN\n1 X\nRi − RCM .\nN i=1\n\nit should be noted that the values decrease significantly\nwith increasing N between Cu40 (Ag40 ) and Cu55 (Ag55 ),\nunlike the case of Na40 and Na55 . This can be attributed\nto the effect of d electrons in that they may shrink the\ninteratomic distances of the quasi-spherical structure-an\nicosahedron which is the most stable structure at N = 55.\nFigure 6 (c) shows v(N )/v(2) of the most stable structure (icosahedron) of NaN for N = 55, 147, and 309\nobtained in our previous study36 . Here, v(N )/v(2) increases monotonically with N . FIG. 6 (d) shows the\nmelting points Tm of the NaN cluster at N = 55, 147,\nand 309, as observed by Haberland et al.39 , to discuss the\nrelationship with cluster volumes. Tm decreases monotonically with increasing N . This N dependence of Tm is\nin contrast to the trend observed in the case of the cluster\nvolume. Aguado et al. showed that the volume v(N ) and\nTm of the most stable structures of the NaN cluster exhibited an opposite trend for N ≥ 55 from the molecular\ndynamics calculations based on DFT-LDA40 . This conclusion supports the existence of a relationship between\nthe N dependence of v(N )/v(2) as evaluated by us and\nthat of the Tm observed by Habarland et al. Further, the\nmore precise DFT-LDA molecular dynamics calculations\npredict that Tm of Na40 is higher than that of Na55 41 . Tm\nof Na40 has not yet been observed experimentally. Our\ncalculation results of v(N )/v(2) do not contradict with\nthe result of the DFT-LDA molecular dynamics study41\nwith regard to the relationship between Na40 , and Na55 .\nIf the conclusion about the relation between the cluster v(N ) or v(N )/v(2) and Tm in NaN holds for CuN\nand AgN for N ≤ 55, it is expected that Tm of Cu40\nand Ag40 are lower than that of Cu55 and Ag55 , respectively. For N ≤ 22, the volume of the most stable cluster\nchanges significantly with the structural type transitions\n(L→ P→ O→ C) described in section III. A. Therefore,\nfor N ≤ 22, the N dependence of the cluster Tm is expected to reflect this change.\n\n(2)\n\nTo compare the N dependence of v(N ) for the different metal clusters, each v(N ) is normalized to that of a\ndimer. i.e., v(2).\nFigure 6 (a) shows the N dependence of a normalized volume for the most stable structures of NaN , CuN ,\nand AgN for 2 ≤ N ≤ 22. The N dependence of the\nnormalized volume v(N )/v(2) is very similar in the three\nmetal clusters. The trends of the change in the N dependence at transition sizes N between different structural\ntypes are indicated using the symbols L, P, O, and C.\nv(N )/v(2) decreases significantly at N from P to O. Further, significant decreases are observed at N from O to\nC.\nFigure 6 (b) shows the volumes of the most stable\nstructures in the range of 15 ≤ N ≤ 75. Here, the scale\nof v(N )/v(2) is expanded to show the change clearly.\nIn general, for N ≥ 20, v(N )/v(2) increases monotonically with N for all of the three metal clusters. However,\n\nIV. N DEPENDENCE OF THE CALCULATED\nCLUSTER ENERGY FOR 2 ≤ N ≤ 75 AND ∞\nA.\n\nOverall aspects of the cluster binding energy\n\nAs described in section III. A., the most stable structures of the three metal clusters were searched over the\nrange 2 ≤ N ≤ 75 and the ground state cluster energies E(N ) were evaluated. In general, it was observed\nthat E(N )/N of the metal clusters increased with N and\napproached E(∞)/∞, which corresponds to the value of\nthe bulk cohesive energy. Interestingly, E(N ) exhibited\nhigher or lower values at a particular value of N . To\ninvestigate the aspects of E(N ) in datail, the N dependence of the difference between E(N ) and the liquid drop\nmodel (LDM)10 average hE(N )i, defined as\nδE(N ) ≡ hE(N )i − E(N ),\n\n(3)\n\n\f6\nis evaluated. Here, hE(N )i is expressed by a linear combination of three terms as shown below;\n2\n\n1\n\nhE(N )i = av N + as N 3 + ac N 3 .\n\n(4)\n\nThe first, second, and third terms denote the volume,\nsurface, and curvature energy, respectively. The fitting\nparameters av , as , and ac were determined as described\nbelow. Here, the averaged cluster binding energy per\natom hEb (N )i/N , defined as\nhEb (N )i/N ≡ E(1) − hE(N )i/N\n\n(5)\n\nmust be calculated to evaluate δE(N ).\nav was uniquely determined from the cohesive energy\nof the bulk crystal that corresponds to hEb (N )i/N at\nN = ∞. as and ac were determined as coefficients of the\nfitting curve hEb (N )i/N to the cluster binding energy\nEb (N )/N over the range of 2 ≤ N ≤ 75 by applying the\nleast squares method and minimizing those values under the threshold hEb (1)i = 0. FIG. 7 shows the cluster\nbinding energy per atom Eb (N )/N and the LDM average\n1\nhEb (N )i/N as functions of N − 3 . Eb (N )/N and the average hEb (N )i/N of NaN , CuN , and AgN at N = 2 − 75\n1\nand ∞ are presented. N − 3 = 0, 0.237 and 0.794 correspond to N = ∞, 75, and 2, respectively.\nWe now consider the difference between Eb (N )/N and\nthe LDM average hEb (N )i/N . With an increasing in N\nfrom 2 to 75 and then ∞, a significant similarity is observed in the difference among the NaN , CuN , and AgN\nclusters in which each element has one s electron in the\noutermost shell. For the sake of comparison, the experimental bulk cohesive energy and binding energy of a\ndimer42,55,56 are also shown in FIG. 7. The values of\nthe bulk cohesive energy and binding energy obtained\nthrough our calculations and experiments are in good\nagreement. However, in an Ag bulk crystal, the calculated cohesive energy does not agree well with the experimental value. This disagreement may be attributable to\nthe incompleteness of the description of the Ag (Z = 47)\natom. As reported in previous studies43 , the disagreement originates from the treatment method of the relativistic effect through the pseudopotential, the exchangecorrelation energy functional - GGA, and the basis set for\nthe electrons - plane waves. Although an improvement in\nthe description is desired, we expect that the qualitative\nfeature of the growth behavior of an Ag cluster from an\natom to bulk shown in this study will not change.\n\nB.\n\nDetailed analysis of the N dependence of cluster\nbinding energy\n\nIn section IV. A., a strong similarity is pointed out\nfor NaN , CuN , and AgN clusters in the N dependence\nof the difference between the cluster binding energy per\natom-Eb (N )/N - and the LDM average-hEb(N )i/N . In\nthis section, we analyze this similarity in detail. FIG. 7\n\nshows that the difference for each of the three clusters\napproaches 0 with increasing N .\nHowever, it is difficult to compare them for large value\nof N . Therefore, the N dependence of the N multiplied\nvalues δE(N ) ≡ −E(N ) + hE(N )i are noted for the detailed analysis.\nFigure 8 (a) and (b) show the N dependence of δE(N )\nfor the three metal clusters over the ranges 1 ≤ N ≤ 22\nand 15 ≤ N ≤ 75, respectively. In FIG. 8 (a), a strong\nsimilarity is observed in the N dependence of δE(N ) for\n1 ≤ N ≤ 22. These values indicate an odd-even alternation in N . In other words, δE(N ) increases from an\nodd N to the next even N , and then decreases from an\neven N to the next odd N . In many cases, δE(N ) is positive at even N and negative at odd N . In FIG. 8 (b),\na significant similarity is observed in the N dependence\nof δE(N ) for 15 ≤ N ≤ 75. δE(N ) is larger at N = 34\n(Na), 55, and 58 and smaller at N = 40 (Cu and Ag),\n68, 70, 71, and 75 are compared to those at the neighborhood N considered in this study. The amplitudes of\nδE(N ) for CuN and AgN are much larger than that for\nNaN . Further, the values of CuN and AgN are closer.\nThis is attributable to the effect of d electrons in noble\nmetal clusters.\nC.\n\nDefinition of the cluster magic number and\nidentification\n\nIn many previous studies of clusters, an N value that\ngives a special cluster stability has been frequently called\nas the magic number. To understand the N -dependent\nsystem stability, it is necessary to evaluate the magic\nnumber based on first principles calculations, because it\ncan be a standard magic number. However, the magic\nnumber has not yet been defined. Therefore, to understand the N -dependent system stability, we must first\ndefine the magic numbers.\nFirst, the curvature of the cluster energy for N ∆2 E(N ), defined as\n∆2 E(N ) ≡ E(N + 1) + E(N − 1) − 2E(N ),\n\n(6)\n\nis discussed. If ∆2 E(N ) exhibits a positive peak at N , N\nmay be a magic number because E(N ) might be a local\nminimum for N . FIG. 8 (c) shows the N dependence of\n∆2 E(N ) for the three metal clusters. Here, the magic\nnumbers of the three clusters can be identified as N =\n2, 4, 6 (Na, Ag), 8, 10, 12, 14, 18, and 20. For these values\nof N , an odd-even alternation is clearly observed. All\nof these values of N are even numbers and it is natural\nto consider that the odd-even alternation originates from\nthe shell closing of each electronic state in the clusters.\nIn addition, the N dependences of the peak intensities\nare similar in the three clusters, although the absolute\nvalues of the peaks are larger in the noble metal clusters\nthan in the alkali metal cluster for most values of N . As\nin the case of δE(N ) described in IV. B., the values of\n∆2 E(N ) are closer in the noble metal clusters.\n\n\f7\nAlthough it is possible to derive other conclusions from\nthe absolute values of ∆2 E(N ), only ∆2 E(N ) may not\nbe a sufficient criterion for the evaluation of magic numbers. In general, additional information is required for\nthe identification.\nδE(N ) can be a criterion for identifying magic numbers\nbecause of its definition: the energy difference between a\nreal cluster and the continuously averaged energy model,\nLDM. The magic numbers N should satisfy the condition\nδE(N ) ≥ 0. This condition is satisfied for N = 2, 4 (Ag),\n6, 7, 8, 10, 12 (Cu), 14, 17 (Cu), 18, 19, 20, and 21 (Na).\nIf only ∆2 E(N ) and δE(N ) are considered, magic\nnumbers N can be defined as\n∆2 E(N ) ≥ 0, δE(N ) ≥ 0.\n\n(7)\n\nIf this definition is employed for the magic numbers in\nNaN , CuN , and AgN clusters for N ≤ 21, the common\nmagic numbers N = 2, 4 (Ag), 6, 8, 10, 12, 14, 18, and 20\nare identified.\nIn this study, ∆2 E(N ) for N ≥ 34 is not evaluated. For\nN ≥ 34, magic numbers are identified only from δE(N ).\nFor these values of N , we consider those that satisfy\nδE(N ) ≥ 0\n\n(8)\n\nto be magic numbers. Therefore, N = 34 (Na), 38 (Na),\n40 (Na), 55, and 58 are identified as magic numbers. In\nthis definition, the odd number N = 55 is also considered\nto be a magic number.\nIn our first principles calculations, the common feature\nof the magic numbers in NaN , CuN , and AgN can be attributed to the delocalized s valence electrons. The localized d electrons in the noble metal clusters increase the\nstability difference between magic and not-magic clusters.\nD.\n\nN -dependent stability of NaN clusters from the\nexperiment and total energy calculations\n\nThe N dependence of the peak intensity I(N ) in\nthe experimentally observed abundance spectra, and the\ncluster energy E(N ) evaluated from the first principles calculations have not yet been compared quantitatively. This comparison is important for understanding\nthe magic number observed in the experiment. On the\nbasis of several assumptions, semi-quantitative comparison method15,16 has already been developed for an experimental result of NaN 3 and for the theoretical total\nenergy calculations. Although experimental results for\nCuN and AgN 44,45 are available, they cannot be easily compared with our calculation results quantitatively.\nTherefore, in this section, we only focus on the magic\nnumbers of NaN .\nWith regard to experiments with NaN , only the result\nof Knight et al.3 is discussed. As shown in other experiments with NaN such as those by Bjørnholm et al.12 ,\nRabinovitch et al.46 , etc., main peaks were also observed\n\nat N = 8, 20, 40, 58, and 92. Therefore, without significant improvements in the experimental method, these\nabundance spectra and magic numbers appear to remain\nunchanged. Obviously, if the experimental results remain\nunchanged, the theory itself must be reconsidered.\nHere, the curvature of E(N ) evaluated from our calculations and the peak intensity I(N ) in the abundance\nspectra were semi-quantitatively compared based on the\nmethod described below. The abundance spectra of NaN\nclusters reported by Knight et al. are considered to be\nattributed as follows. First, Na atomic vapor is formed\nby heating Na bulk solid in an Ar-gas-filled closed space\nin the experimental apparatus47 . Then, NaN clusters\nare formed by the adiabatic cooling of the mixture after\npassing through the skimmer in the apparatus. Then, N distributed neutral charged NaN clusters were assumed\nto be obtained in a thermal equilibrium condition. If the\nassumption for the NaN distribution is true, the relationship\n\u0012\n\u0013\nE(N )\nρ(N ) = Aexp −\n(9)\nkB T\nmust be satisfied. Here, the ρ(N ), A, kB , and T denote\nthe number density of neutral charged NaN , a constant,\nBoltzmann constant, and the absolute temperature, respectively. These clusters were ionized by light and then\naccelerated by an electric field for mass selection. In these\nsteps, the N -distribution of ρ(N ) is assumed to remain\nunchanged. Finally, these clusters were detected and the\nN -distribution of the neutral charged clusters was observed using the detector. Therefore, finally,\nI(N ) = Bρ(N )\n\n(10)\n\nholds. Here, B is a constant. From equations (6), (9),\nand (10), the following equation is derived.\n∆2 E(N ) = kB T ln\n\nI(N )2\nI(N + 1)I(N − 1)\n\n(11)\n\nNamely, ∆2 E(N ) can be evaluated from I(N ) of the experimental abundance spectra.\nFigures 8 (d) and (e) show the N dependence of\n∆2 E(N ) evaluated experimentally by Knight et al.∆2 EExpt. (N ) and by the first principles calculations in\nthis study-∆2 EF P −DF T (N ) for N ≤ 22 and 15 ≤ N ≤\n75, respectively. For the latter discussion, δE(N ) evaluated from the first principles calculations in this study,\nδEF P −DF T (N ), and from the DFT-based spherical jellium model (SJM) calculations by Genzken et al.13 ,\nδESJM−DF T (N ), are also shown in these figures.\nWe first compare the N dependence of ∆2 EExpt. (N )\nand ∆2 EF P −DF T (N ). Generally, there is a good agreement between them. However, contrasting trends are\nobserved in two rows of N : (1) N = 5, 6 and 7 and (2)\nN = 17 and 18. The peak intensity of ∆2 EExpt. (N ) and\n∆2 EF P −DF T (N ) is relatively strong at N = 8 and 20.\nFor N ≥ 34, ∆2 EF P −DF T (N ) is not evaluated in this\nstudy.\n\n\f8\nAs shown in Figures 8 (d) and (e), there is a similarity in the N dependence between ∆2 EF P −DF T (N ) and\nδEF P −DF T (N ). Considering this similarity, instead of\n∆2 EF P −DF T (N ), δEF P −DF T (N ) can be considered as\na comparative value to ∆2 EExpt. (N ).\nIn a manner similar to ∆2 EF P −DF T (N ),\nδEF P −DF T (N ) exhibits good agreement with\n∆2 EExpt. (N ) with regard to the N dependence. However, in a manner similar to the case of ∆2 EF P −DF T (N ),\nδEF P −DF T (N ) exhibits a different N dependence as\ncompared to ∆2 EExpt. (N ) in two rows of N : (1)\nN = 5 and 6 and (2) N = 17 and 18. Here, it should\nbe noted that the order of peak intensity at N = 8\nand 20 of δEF P −DF T (N ) exhibits better agreement\nwith ∆2 EExpt. (N ) than with ∆2 EF P −DF T (N ). Based\non these results, δEF P −DF T (N ) is compared with\n∆2 EExpt. (N ) for N ≥ 34.\nIn ∆2 EExpt. (N ), distinctive peaks are formed at\nN = 40 and 58. Similar to the case of ∆2 EExpt. (N ),\nδEF P −DF T (N ) is relatively large at N = 58. However,\nδEF P −DF T (N ) at N = 40 is not particularly so distinctive. Although ∆2 EExpt. (N ) is remarkably distinctive\nat N = 40, the value of δEF P −DF T (40) is similar to\nthat of δEF P −DF T (38). Further, for N = 34 and 55,\nδEF P −DF T (N ) exhibits distinctive peaks and these values are larger than δEF P −DF T (40) and δEF P −DF T (58).\nIn addition, for N = 68, 70, 71, and 75, δEF P −DF T (N )\nhas negative values, and these features are not exhibited\nby ∆2 EExpt. (N ).\nAs shown here for NaN , although the N dependence\nof δEF P −DF T (N ) exhibits good agreement with that of\n∆2 EExpt. (N ) in the range of N ≤ 22, the same is not\nnecessarily true in the range of N ≥ 34. This point is\ndiscussed in the next subsection.\n\nE. Improvement of the magic number description\nfor NaN clusters from first principles calculations\n\nWe evaluate the source of this disagreement in the N\ndependence of δE(N )(∆2 E(N )) obtained from theoretical total energy calculations and ∆2 E(N ) obtained from\nthe experiment. In this subsection, we review the N dependent system stability of NaN by the improvement\nof theoretical models.\nAs shown in Figures 8 (d) and (e), δESJM−DF T (N )\nobtained by Genzken et al.13 exhibits an N dependence\nsimilar to that of δEF P −DF T (N ) for 2 ≤ N ≤ 58. However, the N dependence of δEF P −DF T (N ) exhibits a better agreement with that of ∆2 EExpt. (N ) for N = 34, 40,\nand 58 as compared to that of δESJM−DF T (N ). This\nresut suggests that the consideration of the explicit ionic\nconfiguration in the total energy calculation is significant\nto realize a better agreement with the experiment with\nregard to the N -dependent system stability of NaN .\nFigures 8 (f) and (g) show the N dependence of\n∆2 E(N ) for NaN evaluated from various DFT-based\nmodels such as the spherical jellium model (SJM-DFT)\n\nby Chou et al.5 , spheroidal jellium model (S'JM-DFT)\nby Ekardt et al.48 , ultimate jellium model (UJM-DFT)\nby Koskinen et al.7 , and the first principles model (FPDFT) in this study for 1 ≤ N ≤ 22 and 15 ≤ N ≤\n75, respectively. These ∆2 E(N ) values are denoted as\n∆2 ESJM−DF T (N ), ∆2 ES ′ JM−DF T (N ), ∆2 EUJM−DF T ,\nand ∆2 EF P −DF T (N ), respectively. The various jellium models are differ from the first principles calculations in the treatment of the ionic configuration and the\nexchange-correlation energy.\nAs shown in Figures 8 (f) and (g), all of the calculation results exhibit distinctive peaks at N = 8, 18, and\n20. In these figures, remarkable differences are obtained\nin the number of peaks between ∆2 E(N ) of the spherical models, SJM-DFT, and non-spherical models, S'JMDFT, UJM-DFT, and FP-DFT. From these figures, it\nis apparent that the improvement in the N dependence\nin ∆2 E(N ) from the jellium models to the first principles model that explicitly treats the ionic configuration\nis smaller as compared to that from the spherical models\nto the non-spherical models.\nIn a manner similar to the case of δEF P −DF T (N ) and\n∆2 EF P −DF T (N ) for 1 ≤ N ≤ 22, as shown in Figures\n8 (e) and (g), the N dependence of ∆2 ESJM−DF T (N )\nis similar to that of δESJM−DF T (N ) over the range of\n2 ≤ N ≤ 58. Here, it is assumed that there is a similarity\nbetween the N dependence of δEF P −DF T (N ) and that\nof ∆2 EF P −DF T (N ) for 34 ≤ N ≤ 58.\nAs shown in Figure 8 (e), ∆2 ESJM−DF T (40)\n(∆2 ES ′ JM−DF T (40)) is positive.\nHowever, it is\nsmaller than ∆2 ESJM−DF T (20), ∆2 ESJM−DF T (34),\nand\n∆2 ESJM−DF T (58)\n(∆2 ES ′ JM−DF T (20),\n∆2 ES ′ JM−DF T (34), and ∆2 ES ′ JM−DF T (58)).\nOn\nthe other hand, as shown in FIG. 8(g), δESJM−DF T (N )\nfor N = 40 is negative. Therefore, based on the definition of the magic number given in equation (7), N = 40\nis not a magic number in SJM-DFT. However, N = 40\nmay be a magic number in S'JM-DFT and FP-DFT\nalthough δEF P −DF T (40) has a small positive value.\nAlthough the magic feature at N = 40 is expected to\nbe weak in S'JM-DFT and FP-DFT, it is also expected\nthat the consideration of the deviation from central\nforce field in the total energy calculation is significant\nfor obtaining a better agreement in N -dependent system\nstability with the experiment.\nHere, it should be noted that ∆2 ESJM−DF T (68) is\nnearly 0 eV. As shown in FIG. 8 (e), there is a\nlarge difference between ∆2 EExpt. (68) ∼ 0 eV and\nδEF P −DF T (68) ∼ −0.5 eV. From the similarity between the N dependence of δE(N ) and ∆2 E(N ),\n∆2 EF P −DF T (68) is expected to differ significantly from\n∆2 EExpt. (68) as compared to ∆2 ESJM−DF T (68). Therefore, it can be said that the N dependences of\n∆2 EF P −DF T (N ) and δEF P −DF T (N ) are not necessarily more similar to that of ∆2 EExpt. (N ) as compared to\nthose of ∆2 ESJM−DF T (N ) and δESJM−DF T (N ).\nWe now consider the possibilities for reducing the\ndifference between the theoretically and experimentally\n\n\f9\nobtained N -dependent system stability. First, we discuss the possibility of improving has the magic number description based on the evaluation of the ground\nstate energy. In the case of NaN , it has already been\nshown that the N dependence of the experimental abundance peak at N = 5, 6, and 7 cannot be expressed\neven in terms of ∆2 E(N ) of the configuration interaction calculations49,50 . Therefore, it is expected that the\nimprovement of the ground state energy evaluation will\nnever lead to and improvement in the agreement for small\nvalues of N .\nThus for, several researchers have shown stable structures of Na40 41,51,52 . In previous studies, a nearly spherical structure with high symmetry has not yet been obtained as the most stable structure. Instead of such a\nstructure, we have found a structure with low symmetry (III) that is 0.320 eV more stable than structure (II),\nwhich is similar to the most stable structure found thus\nfar41 . Since the energy differences between these structures are small, the most stable structure, III, did not\nexhibit a strong peak for N = 40 in δEF P −DF T (N ).\nTherefore, we expect that δEF P −DF T (40) will not realize a strong magic feature even if a more stable structure\nis found in Na40 .\nWithin SJM, the N dependence of the energy per valence electron for NaN was evaluated from a more precise first principles calculation method called the diffusion Monte Carlo (DMC) calculation53 . A weak magic\nfeature was obtained for N = 40 as a dip in the total\nenergy vs. N curve. From the result a weak magic feature is expected for N = 40 in the N dependences of\n∆2 ESJM−DMC (N ) and δESJM−DMC (N ), in a manner\nsimilar to the cases of SJM-DFT and FP-DFT. However, by considering the explicit geometrical structure in\nDMC, the magic feature for N = 40 will be strengthened\nas compared to that for N = 34 and 58.\nSecond, we discuss the possibility of realizing improvements by a more proper evaluation of the system stability.\nIn the experiments, the temperature in the apparatus is\nexpected to be related to the final results. However, in\nthe cluster study based on the total energy calculations,\nthe temperature of the system is 0 K. If the consideration of the temperature is critical for the N -dependent\nsystem stability, instead of the internal energy E(N ), the\nfree energy F (N ) must be considered. Further, the most\nstable and meta-stable structures of NaN must both be\nconsidered properly for the N -dependent system stability. To consider the contribution of meta-stable structures, information about the potential energy surface or\nfree energy landscape is required.\nFinally, we discuss the possibility of realizing improvements from other viewpoints. In the case of NaN , various\nshell models such as the Woods-Saxon type3,11 and harmonic oscillator type4 that neglect the Coulomb interactions between electrons exhibit a magic feature at N = 40\nin the N dependence of the shell correction energy and\nthe curvature for the sum of the electronic eigenvalues.\nThese N dependences are strongly affected by the N de-\n\npendence of the energy gap between the highest occupied\nmolecular orbital (HOMO) and the lowest unoccupied\nmolecular orbital (LUMO), i.e., the HOMO-LUMO gap.\nAs shown in FIG. 9, within FP-DFT, the HOMO-LUMO\ngap for the most stable structure of Na40 is larger than\nthat of Na34 . The absolute value of the HOMO-LUMO\ngap may be larger if the quasi-particle energy evaluated\nfrom GWA is considered54 . The improvement is significant if I(N ) in the abundance spectra of NaN is a value\nthat is more strongly related to the shell correction energy and the curvature of the sum of electronic eigenvalues as compared to ∆2 E(N ) or δE(N ) evaluated from\nE(N ).\nAs described in this section, by a more proper treatment of the system within the total energy calculations,\ndiscrepancies in the description of the N -dependent system stability with the experimental results in the description of can be reduced. However, this is difficult even in\nthe case of the simplest metal cluster NaN shown here.\nFor discussing the N -dependent cluster stability, various\nproblems must first be solved. However, the magic number for the ground state, which avoids empirical parameter, is significant because it can be a standard to understand the N -dependent system stability. Further, for\npractical reasons, the evaluation method based on first\nprinciples calculations is expected to retain the value in\npredictions of the experimental values of magic numbers.\n\nV.\nA.\n\nELECTRONIC STRUCTURES\n\nEvolution of the electronic structure from atom\nto bulk\n\nAs described before, remarkable similarities are observed in the N dependence of the most and meta-stable\nstructures and in the ground state energies of NaN , CuN ,\nand AgN clusters. These similarities are attributed to\nthe N dependence of the electronic structure. In this\nsection, N -dependent electronic structures for the most\nstable structures of each metal cluster are discussed.\nFigures 9 (a), (b), and (c) show the Kohn-Sham energy spectra for the most stable structures of the three\nmetal clusters over the range of 1 ≤ N ≤ 75 and ∞\n(bulk). The density of states of the bulk crystal obtained\nfrom the band calculation is shown in the right-hand side\nspace of each figure for the sake of comparison. Each\nFermi level of the bulk crystal is set to the next HOMOLUMO gap for the N = 75 cluster. For all of the three\nfigures, the space between HOMO and LUMO is colored\nblue. The red lines represent the occupied and unoccupied electronic energy levels.\nFor most values of N , the HOMO-LUMO gaps are\nsmall at odd values of N and large at even values of N ,\nwhich results in the odd-even alternation of the HOMOLUMO gaps. However, the HOMO-LUMO gap is large\nfor several odd values of N and small for even values\nof N . It should be noted that the odd-even alternation\n\n\f10\nof the HOMO-LUMO gaps in CuN and AgN are significantly larger than that of NaN for the benefit of d\nelectrons. Further, the similarity in the odd-even alternation is more distinctive between the noble metal clusters. Generally, the HOMO-LUMO gap of each metal\ncluster converges to the Fermi level of the bulk crystal\nwith increasing N .\nFor all of the metal clusters, with increasing N , the\nfeature of each bulk energy band gradually appears in the\nelectronic states. The energy width between the bottom\nand top of the occupied energy levels almost converges to\nthat of the bulk crystal at N = 75. In the case of NaN ,\nover a wide energy range, the states are characterized by\ns and p. In CuN and AgN , in addition to the s, and\np characterized states similar to those shown in NaN ,\nenergetically localized d band type states also appeared.\nIt should be noted that the features of localized d band\nin the bulk crystals already appeared at a rather small\nvalue of N in the width of the d states and the energetical\ndistance from the top of the d states to the Fermi level.\nWith increasing N , the strongly d characterized states\ngradually expand and almost converge to the width of\nthe d band in each bulk crystal at N = 75.\nFor the same type of geometrical structures as those\ndescribed in section II. A., distinctive simiralities were\nalso observed in the underwent splitting manner in which\nelectronic states that are strongly characterized by s and\np. As shown in FIG. 9, the energetical distances for\nthe adjacent states strongly characterized by s and p are\nlarger in NaN than those of CuN and AgN . This relationship can be roughly understood from the relationship\nbetween the energetical distance for the adjacent states\nand the width of a well in the quantum well model, as\ndescribed in the previous paper18 . In this case, the s and\np characterized electrons correspond to the quantum in\nthe well. As shown in FIGS. 4 (a), 5, and 6 (a) and (b),\nfor the existence of spatially and enegetically localized\nd electrons, closer interatomic distances are obtained in\nnoble metal clusters as compared to those in alkali metal\nclusters. Namely, the width of the well is narrower in\nthe noble metal clusters. As a result, larger energetical\ndistances are realized in the noble metal clusters.\nThe stability of the spin polarized state of the clusters\nis summarized as given below. For any odd N clusters,\nthe stability of the spin-polarized state is higher than\nthat of the spin-unpolarized state. On the other hand, for\nmost even N clusters, the energy of the spin-unpolarized\nstate is lower than that of the spin-polarized state. However, several structures that have high denegeracy in the\nneighborhood of the HOMO in the electronic state are exceptions. For a geometric structure with high symmetry,\nsuch as an icosahedron at N = 13 and N = 55, cuboctahedron at N = 38, capped icosahedron at N = 71, and\nMarks decahedron at N = 75, the energy levels around\nHOMO are highly degenerated. Therefore, the high-spin\nstates exhibit a higher stability than the low-spin states\nin systems such as an icosahedron for Na55 36 and Cu55 ,\nalthough the case is opposite for Ag55 . However, for all of\n\nthem, the energy differences between the high- and lowspin states are very small-0.033, 0.022, and 0.012 eV,\nrespectively. The system is stabilized by lowering the\nsymmetry from Ih to Ci in the structures based on the\nJahn-Teller theorem38 .\n\nB.\n\nHOMO-LUMO gap, E(N ), and v(N )/v(2) for the\nmost and meta-stable clusters\n\nIn section V. A., only the electronic structure of the\nmost stable cluster structure is discussed. In this section, the electronic structures of the most and metastable cluster structures are compared to understand the\nrelationship between the geometric and electronic structures of the clusters. To save space, only the result of\nNaN is presented. FIG. 10 shows the HOMO-LUMO\ngap ((a) and (b)), ∆2 E(N ) (a'), δE(N ) ((c) and (d)),\nand v(N )/v(2) ((e), and (f)) of the most and metastable structures of NaN clusters for 2 ≤ N ≤ 22 and\n15 ≤ N ≤ 75, respectively. The values of the most stable structures are connected by a line. Several important\nfeatures are observed from the comparison of the most\nand meta-stable structures, as described below.\nA close correlation is observed between the HOMOLUMO gap and ∆2 E(N ) of the most stable structure.\nAs shown in FIGS. 10 (a) and (a'), there is a strong\ncorrelation in the N dependence between them for a\nrange of 2 ≤ N ≤ 21. Although the HOMO-LUMO\ngap considered in this study is the Kohn-Sham HOMOLUMO gap, originally, the HOMO-LUMO gap is a physical value that corresponds to the difference between the\nionization potential and the electron affinity in the system. The ionization potential of a neutral charged cluster composed of N atoms is defined as the energy difference between the total energy of the neutral cluster\nenergy-E(N, n)- and the one electron detached charged\ncluster-E(N, n − 1). The electron affinity of a neutral\ncharged cluster composed of N atoms is defined as the\nenergy difference between the total energy of the neutral\ncluster-E(N, n)- and the one electron attached charged\ncluster-E(N, n + 1). Therefore, the HOMO-LUMO gap\nof a cluster composed of N atoms-HLG(N ) is defined\nas HLG(N ) ≡ E(N, n + 1) + E(N, n − 1) − 2E(N, n).\nOn the other hand, the energy curvature of a cluster\ncomposed of N atoms-∆2 E(N )- is defined as ∆2 E(N ) ≡\nE(N + 1, n) + E(N − 1, n) − 2E(N, n). Although they are\nclearly different physical values, the forms of these two\ntypes of values are very similar. The close correlation\ndescribed above should be studied in detail in the future.\nGenerally, as shown in Figures 10 (a) and (b), the most\nstable structures exhibit a relatively large HOMO-LUMO\ngap. Further, as shown in FIG. 9, a cluster that has a\nlarge HOMO-LUMO gap tends to have a lower HOMO\nand higher LUMO in the electronic structures, as described in section V. A. However, from a comparison with\nthe energy differences between the most and meta-stable\nstructures from δE(N ) shown in FIGS. 10 (c) and (d),\n\n\f11\nit is apparent that a large HOMO-LUMO gap is not a\nnecessary condition for the most stable structure. For\nexample, in Na4 , the meta-stable structure III exhibits a\nlarger HOMO-LUMO gap than that of the most stable\nstructure I. Although it is not shown in this paper, the\nsame type of example can also be shown for CuN and\nAgN .\nFinally, the N dependence of the normalized cluster\nvolume v(N )/v(2) of the most and meta-stable structures, and the relation to the total energy and the\nHOMO-LUMO gap is noted. As shown in FIGS. 10 (e)\nand (f), it is apparent that the cluster volume is directly\ndependent on the structural type, namely, L, P, O, and\nC. From the system stability, as shown in FIGS. 10 (c)\nand (d), it is apparent that the most stable structures\ndo not necessarily have a minimum value of v(N )/v(2).\nFurther, the N dependence of v(N )/v(2) for N ≥ 7 does\nnot change significantly if energetically closed structural\nisomers to the most stable structures are also considered.\nAs shown in the figure, it is apparent that the relationship between the HOMO-LUMO gap and v(N )/v(2) for\nthe most and meta-stable structures cannot be simplified.\nVI.\n\nCONCLUSIONS\n\nThe N -dependent geometric structure, system stability, and electronic structures of NaN , CuN , and AgN\nmetal clusters are studied in detail for a range of 2 ≤ N ≤\n75 based on the density functional theory. Strong similarities are observed between the three different metal\nclusters. These similarities originate from the outermost\nis s electron in the alkali and noble metal atoms composing the each cluster. Much stronger similarities are\nobserved between the two noble metal clusters for the\nbenefit of d electrons. The most stable structures are\nthe same for the three different metal clusters for approximately half the cluster sizes N considered in this\nstudy. Even if the most stable structures are different,\nthe same type of structures are obtained if the metastable structures are also considered. For all of the three\nclusters, the structural type of the most stable structure\nchanges in the order L → P → O → C with increasing N . This structural type transition leads to a deviation from the monotonic increase in volume with N . A\nremarkable similarity is also observed for the N dependence of cluster energy E(N ) for the most stable geometric structures. This similarity is related to the similarity\nin the electronic structures. The amplitude of this energy difference is larger in the two noble metal clusters\nthan in the alkali metal cluster. This is attributed to\n\n∗\n1\n2\n3\n\nElectronic address: itoh.japan@gmail.com\nP. Hohenberg and W. Kohn, Phys. Rev. 136, 864 B (1964).\nW. Kohn and L. J. Sham, Phys. Rev. A. 140, 1133 (1965).\nW. D. Knight, K. Clemenger, W. A. de Heer, W. A. Saun-\n\nthe contribution of the d electrons to the bonds. The\nmagic number is defined in the framework of total energy calclations for the first time. In the case of NaN , a\nsemi-quantitative comparisson between the experimental\nabundance spectra3 and the total energy calculations is\ncarried out. For the improvement of the agreement with\nthe experimental result, several possiblities arise for the\ntotal energy calculations. The changing aspects of the\nKohn-Sham eigenvalues from N = 2 to N = 75 are presented for the three different metal clusters. The features\nof the bulk density of states already appeared at N = 75\nfor all of the three clusters. With increasing values of\nN , the HOMO-LUMO gap clearly exhibits an odd-even\nalternation and converges to 0. This alternation is a specific feature of alkali and noble metal clusters in which\neach element has one s electron in the outermost shell. It\nis also found that in some cases, the HOMO-LUMO gap\nis large at odd value of N and small at even value of N .\nAlthough there is similarity in the N dependence of the\nHOMO-LUMO gap between the three metal clusters, it\nis much stronger between the two noble metal clsuters.\nThe spatially localized d electrons in the noble metals\nare energetically localized. The growth aspect of the d\nband below the Fermi level of the noble metal clusters\nwith increasing N is presented. A good correspondence\nis obtained in the d characteristic of the electronic states\nbetween the cluster composed of 75 atoms and the bulk\nmetal.\n\nAcknowledgements\n\nThe authors gratefully acknowledge the kind hospitality at the Institute for Materials Research and\nthe staff of the Center for Computational Materials\nScience for allowing the use of the Hitachi SR8000/64\nsupercomputing facilities. The authors are grateful to\nProf. Bernd von Issendorff for sharing his results prior\nto publication. M. I. deeply acknowledges valuable\ninformation about group theory from Dr Kenta Hongo\nand molecular dynamics simulation for clusters from\nDr Tamio Ikeshoji. M. I. deeply acknowledges valuable\ndiscussions with Dr Hiroshi Yasuhara. M. I. deeply\nacknowledges Dr Koichi Yoshizaki for allowing us to\nrefer to his thesis prior to publication.\n\nAppendix\n\n4\n5\n\nders, M. Y. Chou and M. L. Cohen, Phys. Rev. Lett. 52,\n2141 (1984).\nK. Clemenger, Phys. Rev. B. 32, 1359 (1985).\nM. Y. Chou, A. Cleland and M. L. Cohen, Solid. State.\n\n\f12\nElement Type of data\nNa\nCu\nAg\n\nd (Å)\nDimer Bulk\nThis study\n3.07\n3.64\nExpt.\n3.07942 3.65955\nThis study\n2.22\n2.57\nExpt.\n2.22042 2.5555\nThis study\n2.58\n2.95\nExpt.\n2.53156 2.8955\n\nEb /N (eV/atom) B0\nDimer\nBulk\n0.38\n1.07\n0.37942 1.11355\n1.14\n3.53\n0.91542 3.4955\n0.89\n2.53\n0.83142 2.9555\n\n(1011 N/m2 )\nBulk\n0.074\n0.06855\n1.396\n1.3755\n0.876\n1.00755\n\nTABLE I: The averaged nearest neighbor diatomic distance d, binding energy per atom Eb /N , and bulk modulus B0 of dimers\nand bulk crystals for Na, Cu, and Ag in the equilibrium position evaluated from the DFT1,2 -GGA(PW9122 ) calculations in\nthis study and other studies based on several experiments are presented.\n\n6\n7\n8\n\n9\n\n10\n11\n\n12\n\n13\n14\n15\n16\n\n17\n\n18\n19\n20\n\n21\n22\n\n23\n24\n25\n26\n27\n28\n\n29\n30\n\nCommun. 52, 694 (1984).\nW. Ekardt, Phys. Rev. B. 29, 1558 (1984).\nM. Koskinen, P. O. Lipas and M. Manninen, Z. Phys. D.\n35, 285 (1995).\nV. Kumar, K. Esfarjani and Y. Kawazoe, in Clusters and\nNanomaterials, edited by Y. Kawazoe, T. Kondow and K.\nOhno, Springer, 9 (2002).\nM. Brack, J. Damgaard, A. S. Jensen, H. C. Pauli, V.\nM. Strutinsky and C. Y. Wong, Rev. Mod. Phys. 44, 320\n(1972).\nC. A. Utreras-Dı́az and H. B. Shore, Phys. Rev. B. 40,\n10345 (1989).\nH. Nishioka, K. Hansen and B. R. Mottelson, Phys. Rev.\nB. 42, 9377 (1990).\nS. Bjørnholm, J. Borggreen, O. Echt, K. Hansen, J. Pedersen and H. D. Rasmussen, Phys. Rev. Lett. 65, 1627\n(1990).\nO. Genzken and M. Brack, Phys. Rev. Lett. 67, 3286\n(1991).\nM. Brack, Rev. Mod. Phys. 65, 677 (1993).\nW. A. de Heer, Rev. Mod. Phys. 65, 611 (1993).\nW. A. de Heer, W. D. Knight, M. Y. Chou and M. L.\nCohen, Solid State Physics, edited by H. Ehrenreich and\nD. Turnbull, 40, 93 (1987).\nL. Kronig, I. Vasiliev, M. Jain and J. R. Chelikowsky, J.\nChem. Phys. 115, 4322 (2001).\nM. Itoh, V. Kumar and Y. Kawazoe, Int. J. Mod. Phys. B.\n19, 2421 (2005).\nReferences in Ref.18 .\nM. Yang, K. A. Jackson, C. Koehler, T. Frauenheim and\nJ. Jellinek, J. Chem. Phys. 124, 024308 (2006).\nM. Yang, K. A. Jackson, and J. Jellinek, J. Chem. Phys.,\n125, 144308 (2006).\nJ. P. Perdew, J. A. Chevary, S. H. Vosko, K. A. Jackson,\nM. R. Pederson, D. J. Singh and C. Fiolhais, Phys. Rev.\nB. 46, 6671 (1992).\nD. Vanderbilt, Phys. Rev. B. 41, 7892 (1990).\nP. Ewald, Ann. Phys. 64, 253 (1921).\nP. Pulay, Chem. Phys. Lett. 73, 393 (1980).\nD. M. Wood and A. Zunger, J. Phys. A. 18, 1343 (1985).\nM. C. Payne, M. P. Teter, D. C. Allan, T. A. Arias, and\nJ. D. Joannopoulos, Rev. Mod. Phys. 64, 1045 (1992).\nCambridge\ncluster\ndata\nbase,\nhttp://www-wales.ch.cam.ac.uk/CCD.html.\nG. Wrigge, M. A. Hoffmann and B. v. Issendorff, Phys.\nRev. A. 65, 063201 (2002).\nO. Kostko, N. Morgner, M. A. Hoffmann and B. v. Issendorff (private communication).\n\n31\n\n32\n33\n34\n\n35\n36\n37\n38\n39\n\n40\n\n41\n42\n\n43\n\n44\n\n45\n\n46\n\n47\n\n48\n49\n\n50\n51\n\nH. Häkkinen, M. Moseler, O. Kostko, N. Morgner, M. A.\nHoffmann and B. v. Issendorff, Phys. Rev. Lett. 93, 093401\n(2004).\nO. Kostko, N. Morgner, M. A. Hoffmann and B. v. Issendorff, Euro. Phys. J. D. 34, 133 (2005).\nO. Kostko, B. Huber, M. Moseler and B. v. Issendorff,\nPhys. Rev. Lett. 98, 043401 (2007).\nH. J. Monkhorst and J. D. Pack, Phys. Rev. B. 13, 5188\n(1976).\nG. Kresse and J. Furthmüller, Phys. Rev. B. 54, 11169\n(1996).\nM. Itoh, V. Kumar and Y. Kawazoe, Phys. Rev. B. 73,\n035425 (2006).\nV. Kumar and R. Car, Z. Phys. D. 19, 177 (1991).\nH. A. Jahn and E. Teller, Proc. Roy. Soc. London. A. 161,\n220 (1937).\nH. Habarland, T. Hippler, J. Donges, O. Kostko, M.\nSchmidt and B. v. Issendorff, Phys. Rev. Lett. 94, 035701\n(2005).\nA. Aguado and J. M. Löpez, Phys. Rev. Lett. 94, 233401\n(2005).\nM-S. Lee, S. Chacko and D. G. Kanhere, J. Chem. Phys.\n123, 164310 (2005).\nHandbook of Chemistry and Physics, 85th edtion, 20042005, edited by D. R. Lide, CRC PRESS (2004).\nN. Takeuchi, C. T. Chan and K. M. Ho, Phys. Rev. B. 40,\n1565 (1989); P. H. T. Philipsen and E. J. Baerends, 61,\n1773 (2000); T. Nautiyal, S. J. Youn and K. S. Kim, Phys.\nRev. B. 68, 033407 (2003); B. Zhou and E. A. Carter, 122,\n184108 (2005).\nI. Katakuse, T. Ichihara, Y. Fujita, T. Matsuo, T. Sakurai\nand H. Matsuda, Int. J. Mass. Spectrom. Ion. Proc. 67,\n229 (1985).\nI. Katakuse, T. Ichihara, Y. Fujita, T. Matsuo, T. Sakurai\nand H. Matsuda, Int. J. Mass. Spectrom. Ion. Proc. 74, 33\n(1986).\nR. Rabinovitch, C. Xia and V. V. Kresin, Phys. Rev. A.\n77, 063202 (2008).\nFrom Figure 2 in reference3 , we confirmed that\n∆2 EExpt.(N ) is not changed significantly by changing the\nAr gas pressure in the first step in the experiment.\nW. Ekardt and Z. Penzar, Phys. Rev. B. 38, 4273 (1988).\nV. Bonačic-Koutecký, P. Fantucci and J. Koutecký, Phys.\nRev. B. 37, 4369 (1988).\nV. Bonačic-Koutecký, I. Boustani, M. Guest and J.\nKoutecký, J. Chem. Phys. 89, 4861 (1988).\nA. Rytkönen, H. Häkkinen and M. Manninen, Phys. Rev.\nLett. 80, 3940 (1998).\n\n\f13\n52\n\n53\n54\n\nS. M. Ghazi, M-S. Lee and D. G. Kanhere, J. Chem. Phys.\n128, 104701 (2008).\nJ. Tao, J. P. Perdew, L. M. Almeida, C. Fiolhais and S.\nKümmel, Phys. Rev. B. 77, 245107 (2008).\nK. Yoshizaki, Master Course Thesis, Tohoku Univ., Japan\n(1996).\nIn this thesis, based on various approximations to the\nexchange-correlation functional within SJM-DFT (LDA\nand GWA (time dependent LDA (TDLDA) and random\nphase approximation (RPA)) are applied for the screened\ninteraction), the HOMO-LUMO gaps of NaN clusters are\n\n55\n56\n\nevaluated in a range of N ≤ 40. For N = 34 and 40,\nthe HOMO-LUMO gaps are evaluated as 0.45 (LDA), 1.45\n(TDLDA), 1.50 (RPA) and 0.20 (LDA), 1.10 (TDLDA),\n1.30 (RPA), respectively. If the ionic configurations are\nconsidered, the values are expected to be changed.\nC. Kittel, Introduction to Solid State Physics, (John Wiley\n& Sons, Inc., New York. 1996).\nB. Simard, P. A. Hackett, A. M. James and P. R. R.\nLangridge-Smith, Chem. Phys. Lett. 186, 415 (1991).\n\n\f14\n\nFIG. 1: The most and meta-stable structures of NaN , CuN , and AgN clusters for 3 ≤ N ≤ 12 are shown. Almost all of the\nmost and meta-stable structures of these clusters are similar. Therefore, the cluster structures are represented by the structures\nof CuN to save space in this figure. The structures are classified according to their types using the notations I, II, III, and IV.\nThis classification obeys the stability order in the structural type of CuN . The symbols L, P, O, and C used after the notations\nindicate linear, planar, opened, and closed structures, respectively. Opened and closed structures are both three-dimensional\nstructures. An opened structure is defined as one without any atoms whose coordination number is greater than or equal to\n11. Other three-dimensional structures are difiend as closed structures. The three values following the symbols L, P, O, and\nC represent the relative total energies of the most stable structures of NaN , CuN , and AgN , respectively. A value of 0.000\nis assigned to the most stable structure and the energy of meta-stable structures is expressed in units of electron volts. The\nsymbol N is used to denote a structure that cannot be identified. The two different figures shown above show views of the same\ncluster from different angles. The numerous highly symmetric structures, including Plato's polyhedron, are labeled as TETRA,\nOCTA, ICO, CUBO, and DECA, and they respectively represents a tetrahedron, octahedron, icosahedron, cuboctahedron, and\ndecahedron.\n\n\f15\n\nFIG. 2: The most and meta-stable structures of NaN , CuN , and AgN clusters for 13 ≤ N ≤ 22 are shown. The notations used\nare the same as those in FIG.1. Some isomers of NaN and AgN are also shown for cases where their structural deviations are\nrelatively large from the relation of similarity. The structures of NaN and AgN are indicated in blue and silver, respectively.\n\n\f16\n\nFIG. 3: The most and meta-stable structures of NaN , CuN , and AgN clusters for 34 ≤ N ≤ 75 are shown. The notations used\nare the same as those in FIGS.1 and 2.\n\n\f17\n\nFIG. 4: (a) shows the N dependence of the averaged nearest neighbor distance (ANND) in units of angstroms, and (b) shows\nthe averaged coordination number (ACN) from atom to bulk for NaN , CuN , and AgN for 1 ≤ N ≤ 75, and ∞ (bulk). The\nACN values of the bulk crystal - 12 (Na: hcp, Cu: fcc, Ag: fcc) and 8 (Na: bcc), are not shown in (b). References a, b, and c,\ncorrespond to ref.42 , ref.55 , and ref.56 , respectively.\n\nFIG. 5: The deviation from the relation of similarity shown in structure III of Na7 , Cu7 , and Ag7 shown in Figure 1.\nThe values of the angles and interatomic distances are shown in the order of Na7 , Cu7 , and Ag7 . Structure III of Cu7\nis shown as an example. The angles and interatomic distances are expressed in units of degrees and angstroms, respectively. The blue and green values in the parentheses represent the relative ratio of angle(distance)Na7 /angle(distance)Cu7 and\nangle(distance)Ag7 /angle(distance)Cu7 , respectively.\n\n\f18\n\nFIG. 6: (a) and (b) show the N dependence of the normalized cluster volume v(N )/v(2) for the most stable structures of NaN ,\nCuN , and AgN for 2 ≤ N ≤ 22 and 15 ≤ N ≤ 75, respectively. Each structure is denoted using the symbols L, P, O, and C.\n(c) shows the N dependence of v(N )/v(2) for NaN (N = 55, 147, and 309), while (d) shows the N dependence of the melting\npoint Tm observed by Haberland et al.39\n\nFIG. 7: The dependence of the binding energy of the ground state structures of NaN , CuN , and AgN (1 ≤ N ≤ 75, ∞ (bulk))\n1\non N − 3 . For each element, the liquid drop model (LDM) average is also shown. References a and b correspond to ref.42 and\n55\nref. , respectively.\n\n\f19\n\nFIG. 8: (a) and (b) show the N dependence of δE(N ) for the most stable structures of NaN , CuN , and AgN clusters at\n1 ≤ N ≤ 22 and 15 ≤ N ≤ 75, respectively. (c) shows ∆2 E(N ) for the most stable structures of NaN , CuN , and AgN at\nI(N)2\n1 ≤ N ≤ 21. (d) and (e) shows the N dependence of ∆2 E(N ) = kB T ln I(N+1)I(N−1)\nof NaN as given by Knight et al. (ref. a3 )\nat 700 kPa Ar in the cluster production step, δE(N ) of the spherical jellium model (ref. b13 ) and first principles model, and\n∆2 E(N ) of the first principles model for NaN clusters at 1 ≤ N ≤ 22 and 15 ≤ N ≤ 75, respectively. For ∆2 E(N ) value given\nby Knight et al., the value of the temperature is set to 800 K as measured mearured in the nozzle channel before the cooling\nstep in the experiment. (f) and (g) show the N dependence of ∆2 E(N ) of NaN clusters evaluated by various jellium models\nand the first principles model for 1 ≤ N ≤ 22 and 15 ≤ N ≤ 75, respectively. References c, d, and e, correspond to ref.5 , ref.48 ,\nand ref.7 , respectively.\n\n\f20\n\nFIG. 9: N dependence of the Kohn-Sham eigenvalues from atom to bulk calculated for the most stable structures of NaN ,\nCuN , and AgN at 1 ≤ N ≤ 75 and ∞ (bulk). The red lines indicate occupied and unoccupied electronic energy levels. For\neach spin-polarized system, the up spin states (left) and down spin states (right) are separated by a thin black line. The space\nbetween HOMO and LUMO is indicated in blue. Each projected value of s, p, and d to the Kohn-Sham state is connected by\nwater, green, and blue lines, respectively. The density of states of each bulk crystal is shown to the right of each figure. Here,\nthe Fermi level is represented by a dashed line. The Fermi level of a bulk crystal is arranged near the HOMO of the clusters\ncomposed of 75 atoms. Each colored line in the bulk crystal is the same as that in the case of clusters.\n\n\f21\n\nFIG. 10: (a) and (b) show the N dependence of the HOMO-LUMO energy gaps of NaN for the most and meta-stable structures\nat 1 ≤ N ≤ 22 and 15 ≤ N ≤ 75, respectively. (a') shows the N dependence of ∆2 E(N ) for the most stable structures of NaN\nat 1 ≤ N ≤ 21. (c) and (d) show the N dependence of δE(N ) for NaN for the most and meta-stable structures at 1 ≤ N ≤ 22\nand 15 ≤ N ≤ 75, respectively. (e) and (f) show the N dependence of v(N )/v(2) for NaN for the most and meta-stable\nstructures at 1 ≤ N ≤ 22 and 15 ≤ N ≤ 75, respectively. Each different type of structure, namely, linear (L), planar (P),\nopened (O), and closed (C), is indicated in purple, black, red, and blue, respectively.\n\n\f"}