{"id": "http://arxiv.org/abs/1205.2338v2", "guidislink": true, "updated": "2013-06-20T21:18:15Z", "updated_parsed": [2013, 6, 20, 21, 18, 15, 3, 171, 0], "published": "2012-05-10T18:41:46Z", "published_parsed": [2012, 5, 10, 18, 41, 46, 3, 131, 0], "title": "Probing the low-redshift star formation rate as a function of\n  metallicity through the local environments of type II supernovae", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1205.0573%2C1205.0923%2C1205.1914%2C1205.2172%2C1205.1371%2C1205.2640%2C1205.4355%2C1205.0810%2C1205.3834%2C1205.3892%2C1205.2253%2C1205.4121%2C1205.3900%2C1205.2083%2C1205.0418%2C1205.1584%2C1205.0623%2C1205.4018%2C1205.1387%2C1205.1422%2C1205.3419%2C1205.2884%2C1205.1894%2C1205.3999%2C1205.3309%2C1205.4074%2C1205.2616%2C1205.2688%2C1205.1395%2C1205.3415%2C1205.0342%2C1205.3590%2C1205.3211%2C1205.2780%2C1205.1801%2C1205.1699%2C1205.1888%2C1205.0708%2C1205.3581%2C1205.2338%2C1205.2323%2C1205.0200%2C1205.2306%2C1205.1813%2C1205.1864%2C1205.1435%2C1205.2357%2C1205.3038%2C1205.0680%2C1205.3502%2C1205.1292%2C1205.4084%2C1205.4303%2C1205.3495%2C1205.3648%2C1205.0181%2C1205.0518%2C1205.1182%2C1205.2254%2C1205.1425%2C1205.1232%2C1205.1230%2C1205.1637%2C1205.2806%2C1205.1517%2C1205.3337%2C1205.2490%2C1205.0629%2C1205.0224%2C1205.1109%2C1205.1218%2C1205.0281%2C1205.1048%2C1205.3232%2C1205.4079%2C1205.1033%2C1205.0180%2C1205.3389%2C1205.2271%2C1205.3816%2C1205.1825%2C1205.1305%2C1205.3174%2C1205.0852%2C1205.2104%2C1205.2144%2C1205.3052%2C1205.1642%2C1205.1036%2C1205.3685%2C1205.0926%2C1205.1497%2C1205.3597%2C1205.1803%2C1205.0138%2C1205.1239%2C1205.1964%2C1205.1235%2C1205.1208%2C1205.0940%2C1205.3621&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Probing the low-redshift star formation rate as a function of\n  metallicity through the local environments of type II supernovae"}, "summary": "Type II SNe can trace star formation to probe its global metallicity\ndistribution at low-redshift. We present oxygen and iron abundance\ndistributions of SN II progenitor regions that avoid many previous sources of\nbias. Because Fe (rather than O) abundance drives the late stage evolution of\nthe massive stars that are the progenitors of CCSNe, and because Fe enrichment\nlags O enrichment, we find a general conversion from O abundance to Fe\nabundance. The distributions we present here are the best yet standard of\ncomparison for evaluating how rare classes of SNe depend on progenitor\nmetallicity. We measure the gas-phase O abundance of a representative subsample\nof the hosts of SNe II from the first-year PTF SN search, using a combination\nof SDSS spectra near the SN location (9) and new long slit spectroscopy (25).\nThe median metallicity of these 34 hosts is 12+log(O/H) = 8.65, with a median\nerror of 0.09. The median host galaxy stellar mass from fits to SDSS photometry\nis 10^9.9 solar masses. They do not show a systematic offset in metallicity or\nmass from a redshift-matched sample of the MPA/JHU value-added catalog. In\ncontrast to previous SN host metallicity studies, this sample is drawn from a\nsingle, areal survey. SNe in the lowest-mass galaxies are not systematically\nexcluded. The metallicity distribution we find is statistically\nindistinguishable from the metallicity distribution of SN II hosts found by\ntargeted surveys and by samples from multiple surveys with different selection\nfunctions. Using the relationship between Fe and O abundances found for Milky\nWay disk, bulge, and halo stars, we translate our O abundance distribution of\nSN II environments into Fe abundance estimates. We find that though this sample\nspans only 0.65 dex in O abundance, the gap between the Fe and O abundance is\n50% wider at the low-metallicity end of our sample than at the high-metallicity\nend. (abridged)", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1205.0573%2C1205.0923%2C1205.1914%2C1205.2172%2C1205.1371%2C1205.2640%2C1205.4355%2C1205.0810%2C1205.3834%2C1205.3892%2C1205.2253%2C1205.4121%2C1205.3900%2C1205.2083%2C1205.0418%2C1205.1584%2C1205.0623%2C1205.4018%2C1205.1387%2C1205.1422%2C1205.3419%2C1205.2884%2C1205.1894%2C1205.3999%2C1205.3309%2C1205.4074%2C1205.2616%2C1205.2688%2C1205.1395%2C1205.3415%2C1205.0342%2C1205.3590%2C1205.3211%2C1205.2780%2C1205.1801%2C1205.1699%2C1205.1888%2C1205.0708%2C1205.3581%2C1205.2338%2C1205.2323%2C1205.0200%2C1205.2306%2C1205.1813%2C1205.1864%2C1205.1435%2C1205.2357%2C1205.3038%2C1205.0680%2C1205.3502%2C1205.1292%2C1205.4084%2C1205.4303%2C1205.3495%2C1205.3648%2C1205.0181%2C1205.0518%2C1205.1182%2C1205.2254%2C1205.1425%2C1205.1232%2C1205.1230%2C1205.1637%2C1205.2806%2C1205.1517%2C1205.3337%2C1205.2490%2C1205.0629%2C1205.0224%2C1205.1109%2C1205.1218%2C1205.0281%2C1205.1048%2C1205.3232%2C1205.4079%2C1205.1033%2C1205.0180%2C1205.3389%2C1205.2271%2C1205.3816%2C1205.1825%2C1205.1305%2C1205.3174%2C1205.0852%2C1205.2104%2C1205.2144%2C1205.3052%2C1205.1642%2C1205.1036%2C1205.3685%2C1205.0926%2C1205.1497%2C1205.3597%2C1205.1803%2C1205.0138%2C1205.1239%2C1205.1964%2C1205.1235%2C1205.1208%2C1205.0940%2C1205.3621&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Type II SNe can trace star formation to probe its global metallicity\ndistribution at low-redshift. We present oxygen and iron abundance\ndistributions of SN II progenitor regions that avoid many previous sources of\nbias. Because Fe (rather than O) abundance drives the late stage evolution of\nthe massive stars that are the progenitors of CCSNe, and because Fe enrichment\nlags O enrichment, we find a general conversion from O abundance to Fe\nabundance. The distributions we present here are the best yet standard of\ncomparison for evaluating how rare classes of SNe depend on progenitor\nmetallicity. We measure the gas-phase O abundance of a representative subsample\nof the hosts of SNe II from the first-year PTF SN search, using a combination\nof SDSS spectra near the SN location (9) and new long slit spectroscopy (25).\nThe median metallicity of these 34 hosts is 12+log(O/H) = 8.65, with a median\nerror of 0.09. The median host galaxy stellar mass from fits to SDSS photometry\nis 10^9.9 solar masses. They do not show a systematic offset in metallicity or\nmass from a redshift-matched sample of the MPA/JHU value-added catalog. In\ncontrast to previous SN host metallicity studies, this sample is drawn from a\nsingle, areal survey. SNe in the lowest-mass galaxies are not systematically\nexcluded. The metallicity distribution we find is statistically\nindistinguishable from the metallicity distribution of SN II hosts found by\ntargeted surveys and by samples from multiple surveys with different selection\nfunctions. Using the relationship between Fe and O abundances found for Milky\nWay disk, bulge, and halo stars, we translate our O abundance distribution of\nSN II environments into Fe abundance estimates. We find that though this sample\nspans only 0.65 dex in O abundance, the gap between the Fe and O abundance is\n50% wider at the low-metallicity end of our sample than at the high-metallicity\nend. (abridged)"}, "authors": ["R. Stoll", "J. L. Prieto", "K. Z. Stanek", "R. W. Pogge"], "author_detail": {"name": "R. W. Pogge"}, "author": "R. W. Pogge", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1088/0004-637X/773/1/12", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1205.2338v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1205.2338v2", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "22 pages, 14 figures, 7 tables, ApJ accepted", "arxiv_primary_category": {"term": "astro-ph.CO", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "astro-ph.CO", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1205.2338v2", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1205.2338v2", "journal_reference": null, "doi": "10.1088/0004-637X/773/1/12", "fulltext": "Draft version November 2, 2018\nPreprint typeset using LATEX style emulateapj v. 04/17/13\n\nPROBING THE LOW-REDSHIFT STAR FORMATION RATE AS A FUNCTION OF METALLICITY\nTHROUGH THE LOCAL ENVIRONMENTS OF TYPE II SUPERNOVAE\nR. Stoll1 , J.L. Prieto2,3 , K.Z. Stanek1,4 , R.W. Pogge1,4\n\narXiv:1205.2338v2 [astro-ph.CO] 20 Jun 2013\n\nDraft version November 2, 2018\n\nABSTRACT\nType II SNe can be used as a star formation tracer to probe the metallicity distribution of global\nlow-redshift star formation. We present oxygen and iron abundance distributions of type II supernova\nprogenitor regions that avoid many previous sources of bias. Because iron abundance, rather than\noxygen abundance, is of key importance for the late stage evolution of the massive stars that are\nthe progenitors of core-collapse supernovae, and because iron enrichment lags oxygen enrichment, we\nfind a general conversion from oxygen abundance to iron abundance. The distributions we present\nhere are the best yet observational standard of comparison for evaluating how different classes of\nsupernovae depend on progenitor metallicity. We spectroscopically measure the gas-phase oxygen\nabundance near a representative subsample of the hosts of type II supernovae from the first-year\nPalomar Transient Factory (PTF) supernova search, using a combination of SDSS spectra near the\nsupernova location (9 hosts) and new longslit spectroscopy (25 hosts). The median metallicity of\nthese 34 hosts at or near the supernova location is 12+log(O/H) = 8.65, with a median error of 0.09.\nThe median host galaxy stellar mass from fits to SDSS photometry is 109.9 M⊙ . They do not show a\nsystematic offset in metallicity or mass from a redshift-matched sample of the MPA/JHU value-added\ncatalog. In contrast to previous supernova host metallicity studies, this sample is drawn from a single\nsurvey. It is also drawn from an areal rather than a targeted survey, so supernovae in the lowest-mass\ngalaxies are not systematically excluded. Indeed, the PTF supernova search has a slight bias towards\nfollowing up transients in low mass galaxies. The progenitor region metallicity distribution we find\nis statistically indistinguishable from the metallicity distribution of type II supernova hosts found by\ntargeted surveys and by samples from multiple surveys with different selection functions. Using the\nrelationship between iron and oxygen abundances found for Milky Way disk, bulge, and halo stars,\nwe translate our distribution of type II SN environments as a function of oxygen abundance into an\nestimate of the iron abundance, since iron varies more steeply than oxygen. We find that though this\nsample spans only 0.65 dex in oxygen abundance, the gap between the iron and oxygen abundance is\n50% wider at the low-metallicity end of our sample than at the high-metallicity end.\nKeywords: (stars:) supernovae: general; galaxies: abundances; galaxies: dwarf\n1. INTRODUCTION\n\nThe question of how certain rare classes of supernovae\n(SNe) depend on progenitor metallicity has been limited\nby the lack of an unbiased standard of comparison. It is\nincorrect use the metallicity distribution of galaxies for\nthis because core-collapse supernovae (CCSNe) trace star\nformation rather than stellar mass. Existing supernova\nhost galaxy metallicity distributions are selected to compare matched samples and use supernova surveys that do\nnot search in the faintest hosts, and are not likely to be\nsuitable as a standard of comparison for rare events that\nappear to be more common in low-mass galaxies. We\naddress this by measuring a metallicity distribution of\ntype II supernova progenitor regions from a single source\nsurvey that is areal rather than targeted.\nThe observational properties of CCSNe span a broad\nrange of spectral types, luminosities, apparent kinetic\nenergies, and other properties. Interpreting this diversity remains a fundamental theoretical and observational\nchallenge, particularly as to how differences in the stel1\n2\n3\n4\n\nDepartment of Astronomy, The Ohio State University\nDepartment of Astrophysical Sciences, Princeton University\nHubble and Carnegie-Princeton Fellow\nCenter for Cosmology and AstroParticle Physics, The Ohio\nState University\n\nlar progenitors of the SNe are related to the explosions. For example, the relative fractions of hydrogenrich type II SNe and hydrogen-poor type Ib/c SNe can\nbe predicted as a function of metallicity based on models\nfor mass-loss from the progenitor stars (Eldridge et al.\n2008; Georgy et al. 2009, 2012). Standard mass loss\nmodels for massive stars are based on line-driven winds\n(e.g. Kudritzki & Puls 2000); the efficiency of these\nwinds depends on metallicity because metals, particularly iron, dominate the line opacities driving the winds\n(Vink & de Koter 2005). Furthermore, the explosion energy of normal type II SNe may depend on the progenitor\nmetallicity (Kasen & Woosley 2009), and certain types of\nSNe may occur only for low-metallicity progenitor stars\n(Ober et al. 1983; Heger & Woosley 2002; Langer et al.\n2007).\nA serendipitous observation of a SN progenitor star\nprior to explosion is one useful way to characterize the\nprogenitor and determine how the SN properties depend progenitor properties. Unfortunately, observing\nor strongly constraining the properties of the progenitor\nstar is only possible for SNe in nearby galaxies, leading\nto very small samples (e.g. Smartt 2009, and references\ntherein). This limits the utility of this technique for constraining the properties of subclasses of events that are\n\n\f2\n\nStoll et al.\n\nrare and therefore observed mostly at large distances,\nsuch as extremely optically luminous CCSNe.\nObservational techniques for addressing this question without pre-explosion data involve estimating the\nprogenitor properties from the environments that remain behind. These techniques range from estimating progenitor age and mass from the degree of correlation with Hα (Anderson & James 2008) and NUV\n(Anderson et al. 2012) emission, to detailed characterization of resolved stellar populations near supernova\nexplosion sites in nearby galaxies (Badenes et al. 2009;\nMurphy et al. 2011) to extrapolation of stellar population properties from galaxy photometry and spectroscopic observations (e.g. Kelly et al. 2008; Arcavi et al.\n2010; Kelly & Kirshner 2012).\nSpectroscopic observations of H II regions near a supernova can be used to estimate the metallicity using\nstrong-line oxygen abundance indicators. There are precision and accuracy limitations to strong-line abundance\nestimates, but more rigorous abundance measurements\nusing faint auroral lines are too costly (or completely unfeasible) for statistical surveys of SN host metallicities.\nThe frequency of several classes of CCSN types\nhas been found to vary with host metallicity.\nPrantzos & Boissier (2003) found that the ratio between type Ib/c and type II SNe increases with increasing host luminosity, and because of the galaxy luminosity/metallicity relationship, they suggested this was\nprobably a metallicity effect. This was confirmed and\nexpanded upon by Prieto et al. (2008) in a subsequent\nstudy, which found that hosts of type Ib/c SNe are higher\nmetallicity than hosts of type II and type Ia SNe based\non spectroscopically measured metallicity. Stanek et al.\n(2006) found that type Ic SNe associated with nearby\nlong gamma-ray bursts (GRBs) were in faint, metalpoor galaxies, proposing a progenitor metallicity cutoff above which GRBs do not occur, and Modjaz et al.\n(2008) found that type Ic SNe that were associated with\nGRBs were in more metal-poor regions than those that\nwere not. Anderson et al. (2010) found at marginal\nsignificance that type Ib and type Ic SNe hosts have\nslightly higher metallicity than hosts of type II and\ntype Ia SNe. The metallicity local to type Ic SNe without broad lines was found by Modjaz et al. (2011) to\nbe on average higher than near type Ib SNe, regardless of which strong-line metallicity diagnostic was used,\nconsistent with the results of Kelly & Kirshner (2012),\nthough Anderson et al. (2010) and Leloudas et al. (2011)\nfound the difference to not be statistically significant.\nKelly & Kirshner (2012) found that although hosts of\ntype Ib and type Ic SNe are higher in metallicity than\nhosts of type II SNe, hosts of broad-lined type Ic (Ic-BL)\nSNe are lower in metallicity.\nCCSNe which are abnormally optically luminous appear to occur more often in low-mass, low-luminosity\ngalaxies (Neill et al. 2011). Spectroscopic abundance\nmeasurements of hosts of five such luminous CCSNe\nindicate this is likely due to metallicity, as shown\nby Stoll et al. (2011) (including data from Young et al.\n2010; Kozlowski et al. 2010). These abnormally luminous CCSNe are predominantly SNe Ic or IIn. Subsequent spectroscopic measurements of the host of the\nluminous SN 2008am (Chatzopoulos et al. 2011) and\nthe luminous SN 2010ay (Prieto & Filippenko 2010;\n\nModjaz et al. 2010; Sanders et al. 2012), and photometric limits on the hosts of the luminous SNe PS1-10awh\nand PS1-10ky (Chomiuk et al. 2011) reinforce this conclusion.\nMany studies (e.g. Neill et al. 2009; Sanders et al.\n2012; Stoll et al. 2011; Campisi et al. 2011; Vergani et al.\n2011) compare host galaxies of SNe or GRBs to the overall galaxy population, which is a good way to put the host\nmetallicity results in context. It is not, however, a secure\nway to evaluate whether metallicity is a key parameter\ngoverning whether a supernova has a given spectral type\nor luminosity. Supernovae trace star formation rather\nthan overall stellar mass, and star formation is not evenly\ndistributed among galaxies of a given mass. Recent\nresults (Lara-López et al. 2010; Mannucci et al. 2010)\nshow that the scatter in the galaxy mass-metallicity relationship may be reduced by considering star formation as\na third parameter, and that star formation rates (SFRs)\nare higher in lower metallicity galaxies at a given mass\n(but see also Yates et al. 2012, which finds that the form\nof any such relation between mass, metallicity, and star\nformation rate depends on the strong-line metallicity diagnostic used).\nLevesque et al. (2010) and Han et al. (2010) suggested\nthat instead of a metallicity cutoff for GRBs there is\na separate luminosity-metallicity relationship for GRB\nhost galaxies offset to lower metallicity than the normal\ngalaxy mass-metallicity relationship of Tremonti et al.\n(2004). (These results are consistent with a simple metallicity cutoff with the exception of a single high-mass GRB\nhost galaxy that appears to be high metallicity.) No\nsuch offset has been observed for type Ia SNe (Neill et al.\n2009). This question of an offset in the mass-metallicity\nrelationship has confused many subsequent discussions\nof a metallicity cutoff.\nMannucci et al. (2011) notes that for galaxies at a\ngiven mass, lower metallicity galaxies have higher average star formation rates (Mannucci et al. 2010) and\nthus core-collapse events, which trace star formation,\nshould have a mass-metallicity distribution shifted to\nslightly lower metallicity at a given mass. This effect is qualitatively similar enough to the offset proposed by Levesque et al. (2010) and Han et al. (2010)\nthat Mannucci et al. (2011) conclude that GRB hosts\ndo not differ substantially from the typical galaxy population and therefore there is no metallicity dependence to GRB hosts. Kocevski & West (2011) quantifies\nthe expected metallicity shift, and finds that the starformation-weighted relationship between galaxy mass\nand metallicity is shifted towards lower metallicity at a\ngiven mass, but that this alone cannot explain the observed GRB host distribution, and a metallicity dependence is still required. Many subsequent studies have\nclaimed to disprove any dependence on metallicity for\nGRBs or luminous SNe by showing that the host galaxy\nmetallicity is consistent with its mass and star formation rate according to the relationship between the three\n(Lara-López et al. 2010; Mannucci et al. 2010). While\nthis is evidence against a distinct mass-metallicity relationship for the hosts of these SNe, it is not evidence\nagainst a metallicity dependence.\nThis shift can also be quantified semi-analytically by\nconvolving the galaxy mass function with the relationship between galaxy mass, metallicity, and star formation\n\n\fType II SNe Environment Metallicities\nrate to find the overall distribution of star formation as a\nfunction of metallicity. Niino (2011) does so by comparing the observed metallicity distribution of GRB hosts\nto the metallicity distribution of star formation, calculated two different ways; first, calculated observationally from the stellar mass function, the galaxy M-SFR\nrelation, and the galaxy mass-metallicity relation, and\nsecond, calculated using the relationship between galaxy\nmass, metallicity, and SFR defined by Mannucci et al.\n(2010), and assigning metallicities based on SFR as well\nas mass. He finds the difference between these two estimates is less than 0.5 dex in oxygen abundance on the\nKK04 scale, Regardless which method is used, he finds\nthat the GRB host metallicity distribution is incompatible with the metallicity distribution of star formation\nunless the GRB fraction depends on metallicity. (This\nis not the primary result of that study, which examines\nthe fact that galaxies do not have one single metallicity,\nbut show an internal spread. Assuming a hypothetical\ntransient phenomenon which has a strict cutoff metallicity above which it cannot occur, Niino (2011) shows\nthat such a spread in internal galaxy metallicities would\nserve to widen the observed host metallicity distribution\nof that transient phenomenon.)\nOnly by comparing the metallicity distribution of a\nSN variety to the overall metallicity distribution of star\nformation can one rigorously test for a metallicity dependence. Our metallicity distribution of type II SN hosts\ncan serve as a standard of comparison for evaluating how\nrare classes of SNe depend on progenitor metallicity.\nEssentially all of these previous studies relating metallicity and SN properties draw on SN samples from multiple surveys. A perfectly homogeneous and unbiased SN\nsample does not currently exist. At present, the Palomar Transient Factory (Rau et al. 2009, PTF) appears\nto supply the closest approximation to this, in the sense\nthat the SN selection does not exclude the smallest, most\nvigorously star-forming galaxies. This would not be true,\nfor example, of the Lick Observatory Supernova Search\n(LOSS) survey (Li et al. 2011), which explicitly targets\nlarger galaxies. In contrast, the PTF biases their followup slightly towards supernovae in low-mass galaxies\n(I. Arcavi, private communication). In this paper we will\nfocus on the 52 type II SNe found in the first year of PTF\noperations. Because some subtypes of CCSNe are known\nto have different distributions in host metallicity, we focus on type II SNe. We have measured metallicities for\nthe environments of a representative subsample of 34 of\nthese type II SNe, and present the resulting metallicity\ndistribution.\nThis distribution probes the low-redshift star formation rate as a function of metallicity in an independent\nway from current methods relying on galaxy population\nstatistics. This is an important distribution to characterize because in order to determine whether a massive\nstar outcome has a metallicity dependence, we need to\nexamine its frequency relative to the metallicity distribution of star formation, not to the metallicity distribution\nof existing stellar mass (the galaxy metallicity distribution). Because the PTF followup is biased slightly towards transients in lower mass host galaxies, we expect\nthe progenitor region metallicity distribution we measure\nmay be slightly more metal-poor than the true overall\nprogenitor distribution of type II SNe. This makes our\n\n3\n\ndistribution a rigorous standard of comparison for a population suspected to be metal-poor; if that population is\nsignificantly more metal-poor than the distribution we\npresent here, it is certainly more metal-poor than the\noverall distribution of type II SNe.\nWe place the metallicity distribution of type II SNe environments in context by comparing it with previous supernova host studies (Prieto et al. 2008; Anderson et al.\n2010; Kelly & Kirshner 2012), with the SDSS DR7\nMPA/JHU value-added catalog (Kauffmann et al.\n2003; Tremonti et al. 2004; Brinchmann et al. 2004;\nSalim et al. 2007), and with estimates from galaxy population statistics (Stanek et al. 2006). Noting that iron\nis more fundamental than oxygen to the evolutionary\noutcomes of massive stars because iron opacity drives\nstellar winds, we then translate our oxygen abundance\ndistribution of type II SNe environments into an iron\nabundance distribution by using the observed relationship between oxygen and iron abundance in Milky Way\nbulge, disk, and halo stellar abundances.\n2. SPECTROSCOPIC OBSERVATIONS AND ANALYSIS\n\nWe drew our targets from the first-year of the Palomar\nTransient Factory (PTF) survey (Arcavi et al. 2010), an\nareal rather than a targeted survey, so supernovae in the\nlowest-mass galaxies are not excluded by selection. The\nsample selection for the survey is not yet published, but\ntransients in dwarf hosts are prioritized for spectroscopic\nfollowup (I. Arcavi, private communication), so a slight\nbias towards metal-poor environments is expected. In\ncontrast, a bias towards metal-rich environments would\nbe expected for galaxy-targeted surveys, which miss lowmass galaxies entirely. There are 52 type II SNe in the\nfull first-year PTF CCSN sample, of which we have measured spectroscopic metallicity determinations for a subsample of 34. This subsample is representative of the\noverall type II sample, as we show in §4.1.\nWe obtained host galaxy spectra of these SNe using the Ohio State Multi-Object Spectrograph (OSMOS,\nMartini et al. 2011; Stoll et al. 2010) on the 2.4-m Hiltner telescope, the Wide Field Reimaging CCD Camera\n(WFCCD) on the 2.5-m du Pont telescope, and the dual\nimaging spectrograph (DIS) on the 3.5-m Astrophysical Research Consortium telescope. We also use twelve\narchival spectra from SDSS DR7 (Abazajian et al. 2009;\nUomoto et al. 1999; York et al. 2000; Gunn et al. 2006).\nThe properties of the spectroscopic observations are summarized in Table 1. We processed the data using standard techniques in IRAF5 , individually extracting each\nspectrum. Relative flux calibration was done with observations of spectrophotometric standard stars taken each\nnight. The PP04N2 metallicity diagnostic is extremely\ninsensitive to reddening because it depends on the flux\nratio of two very close lines, so intrinsic extinction corrections were not applied. Images of nine representative\ntype II hosts spanning the observed range of metallicity\nand galaxy mass are shown in Figure 1. We also measured spectroscopic metallicities for the hosts of three\ntype Ib, two type IIb, three type Ic, and one type Ic-BL\n5 IRAF is distributed by the National Optical Astronomy Observatory, which is operated by the Association of Universities for\nResearch in Astronomy (AURA) under cooperative agreement with\nthe National Science Foundation.\n\n\f4\n\nStoll et al.\n\nFigure 1. Nine type II SN hosts, spanning the metallicity and\nmass range, arranged so mass increases toward the right and oxygen\nabundance increases toward the top. Each panel is scaled to a\nphysical size of 50 kpc (H0 , Ωm , ΩΛ = 70, 0.3, 0.7) and is centered\non the position of the supernova. All images are from SDSS and\nwere taken before the supernovae.\n\nfrom the first-year PTF sample. These numbers are too\nsmall for rigorous statistical comparison, so we exclude\nthese from our analysis of the type II sample, and discuss\nthem further in § 4.5.\nThe new observations were made either at the supernova position or at a similar galactocentric radius to minimize any biases from metallicity gradients in the host\ngalaxies. We include the angular distance from the host\ngalaxy center to the supernova site in Table 2 for easy\ncomparison to the seeing and to the spectroscopic aperture, listed in Table 1. We include the projected physical\ndistance from the galaxy center to facilitate future comparison to studies that use galactocentric spectra. The\nSDSS spectra are the only spectra taken at the galaxy\ncenter rather than at the galactocentric radius of the supernova. Note that for these SDSS spectra, most SN\nlocations are within the fiber diameter, and only one is\nmore than 2 fiber diameters away. We obtained new spectra for any hosts with existing SDSS spectra more distant\nthan this. Any resulting effect from galactic metallicity\ngradients on the metallicity distribution should be minimal. Line fluxes of Hα λ6563 and [N II]λ6584 are given\nin Table 2.\nFor host galaxies with multiple SDSS spectra or with\nspectra from multiple sources, we fit a metallicity gradient where possible and provide the best fit metallicity\nat the galactocentric radius of the supernova progenitor;\nthese are labeled as 'grad'. Line fluxes, observed galactocentric radii, and derived metallicity for these measurements are given in Table 3.\nWe primarily consider host metallicities determined\nwith the N2 diagnostic of Pettini & Pagel (2004), which\nwe directly measure for each of our targets. This diagnostic depends solely on [N II]λ6584/Hαλ6563, and is\nextremely insensitive to reddening, though it has a larger\nintrinsic scatter than other strong-line diagnostics based\n\nFigure 2. Cumulative distribution of local gas-phase oxygen\nabundances for type II SNe. As type II SNe trace young stellar populations, this traces the metallicity distribution of star formation at low redshift. The solid black distribution uses the N2\ndiagnostic of Pettini & Pagel (2004, PP04) we adopt as our standard. Subsequent figures only use these measurements. The other\ndistributions show how the result would change for other strongline metallicity diagnostics, based on the empirical conversions of\nKewley & Ellison (2008). The dotted orange curve uses the PP04\nO3N2 diagnostic, the short-dashed green curve uses Denicoló et al.\n(2002), the long-dashed blue curve uses Tremonti et al. (2004), the\ndot-dashed purple curve uses Zaritsky et al. (1994). We do not\nshow conversions to the scales of Kobulnicky & Kewley (2004),\nMcGaugh (1991), and Kewley & Dopita (2002), which require external branch information.\n\non the physical conditions of the H II regions. There\nare a number of techniques that are used to estimate the\noxygen abundances of H II regions in star-forming galaxies, and a substantial literature discussing their various\nmerits and drawbacks (e.g. Kewley & Ellison 2008, and\nreferences therein). A full recapitulation of this is outside\nthe scope of this paper, but we discuss the consequences\nof these uncertainties for our study in Section 4.6.\nIn Table 2 we list the metallicities of the progenitor\nregions of 34 type II SNe, three type Ib, two type IIb,\nthree type Ic, and one type Ic-BL from the PTF firstyear core-collapse sample. All subsequent analysis is of\nthe type II hosts, for which we have good statistics. We\ndo not include type IIb SNe in the type II sample because\ntheir spectral similarity to type Ib SNe at all but early\ntimes can lead to some typing issues, and because previous studies (e.g. Modjaz et al. 2011; Kelly & Kirshner\n2012) considered them in the stripped-envelope subclass.\nWe show the metallicity distribution of the type II hosts\nfor several different strong-line metallicity diagnostics using the empirical conversions of Kewley & Ellison (2008)\nin Figure 2. In subsequent figures, we choose as our scale\nconvention only the N2 diagnostic of Pettini & Pagel\n(2004).\n3. CHARACTERIZING THE SPECTROSCOPIC\nSUBSAMPLE\n\nTo investigate whether we have acquired spectra of a\nrepresentative subsample of the hosts of first-year PTF\n\n\fType II SNe Environment Metallicities\nCCSNe (Arcavi et al. 2010), we compared the stellar\nmass and star formation rates of the hosts with and without metallicity estimates. We used SED models of the\nSDSS photometry of the hosts within the DR8 footprint\nto estimate the masses, SFR, and characteristic stellar\nages. Of the 52 type II SNe in the full sample, 47 have\nSDSS photometry. We also analyzed the properties of\nthe 19 non-type II PTF CCSN hosts that fell in the DR8\nfootprint, but we will restrict our comparisons with our\nspectroscopic sample of type II SNe to these 47 type II\nSNe to avoid any of the currently known selection effects\nwith metallicity linked with supernova type (see §1).\n3.1. Extracting fluxes from SDSS imaging\nWe began with ugriz images of the 66 first-year PTF\nCCSN fields in the SDSS Data Release 8 (Aihara et al.\n2011). These images are fully calibrated in the SDSS\nnatural system, which is close to the AB system, and\nsky-subtracted. We combined the most sensitive SDSS\nbands (gri) for each supernova field in order to make a\ndeeper stacked image that can be used to find all the\ngalaxies and define their photometric apertures. We\nused these deeper stacked images as the reference image\nfor source detection using SExtractor (Bertin & Arnouts\n1996) and checked by eye the positions around each supernova in order to select the most likely host galaxy.\nWe were able to assign likely host galaxies for 64/66\nSNe. The two events without host galaxy detections,\nPTF09be and PTF09gyp, have sources that are & 13 kpc\n(projected) from the positions of the SNe. We note\nthat the host of PTF09gyp has a reported magnitude of\nr = 21.75 mag in Arcavi et al. (2010) from pre-explosion\nPTF survey co-adds (I. Arcavi, private communication),\nbut we cannot confirm this detection with DR8, although\na galaxy detected approximately 15 arcseconds away has\na similar magnitude. After selecting the host galaxies in\nthe stacked images, we used imedit in IRAF6 to mask\nnearby stars, which could contaminate the flux measurements, filling the masked regions with the local background. Finally, we ran SExtractor on the individual\nugriz images using the apertures defined from the deeper\nstacked images to obtain total (AUTO) galaxy fluxes.\nWe applied the small (. 0.04 mag) corrections derived\nin Kessler et al. (2009) to transform the SDSS fluxes to\nthe AB system. The resulting coordinates and fluxes of\nthe host galaxies are presented in Table 4, and absolute\nmagnitudes k-corrected and corrected for galactic extinction are presented in Table 5. We include 3σ upper limits\nfor the hosts of PTF09be and PTF09gyp, which were calculated assuming a circular aperture of radius r = 5 kpc\nat the distance of the SN.\n3.2. Galaxy properties\n\nWe used the code for Fitting and Assessment of Synthetic Templates (FAST v0.9b, Kriek et al. 2009) to fit\nthese host galaxy spectral energy distributions to estimate the stellar mass, star formation rates (SFRs), and\ncharacteristic ages. We chose the Bruzual & Charlot\n(2003) libraries, a Salpeter IMF, and Solar (Z = 0.02)\n6 IRAF is distributed by the National Optical Astronomy Observatory, which is operated by the Association of Universities for\nResearch in Astronomy (AURA) under cooperative agreement with\nthe National Science Foundation.\n\n5\n\nmetallicity to do the fits. We also assumed an exponentially declining SFR model with τ = 1 Gyr for the star\nforming component of the model. The results are presented in Table 6.\nIn order to check the SFRs calculated with FAST, we\nalso estimated SFR based on the results presented by\nSalim et al. (2007). This method is also based on toy\nmodels for the SFR as a function of time, but combines\nbursts, constant star formation, and exponentially declining star formation, which make it more realistic than\nFAST. We used the results of Salim et al. (2007) for ∼\n50000 SDSS galaxies with GALEX photometry to derive\na relation between the absolute u-band magnitudes, corrected for intrinsic attenuation, and their derived SFRs.\nWe obtain a linear relation fit between Mu and SFR (\nin M⊙ /yr) of the form log(SFR) = −0.36 × Mu − 6.73\n(for a Salpeter IMF), valid for 2 > log(SFR) > −2 and\nlog(SFR/M∗ ) > −10.5, with an rms scatter of 0.23 dex.\nWe applied this relation to obtain SFRs for the supernova host galaxies, using the Low-Resolution Template\ncode of Assef et al. (2008) to derive K-corrected u-band\nabsolute magnitudes corrected for Galactic extinction.\nAfter further correcting these magnitudes by intrinsic attenuation using the values obtained with FAST and the\nCalzetti reddening law, we applied the linear relation derived from the Salim et al. (2007) data to estimate SFRs.\nThese values are presented in Table 6. The agreement\nwith the SFRs derived by FAST is fairly good in general, with a Kolmogorov-Smirnov (K-S) test probability\nof 81% of the results of the two different methods being drawn from the same underlying distribution. The\ntwo SFR estimation methods are directly compared in\nFigure 3. The SFR calculated from the u-band luminosity with aperture corrections is more consistent with\nthe method the MPA/JHU value-added catalog uses to\ndetermine star formation rates than the FAST template\nfitting.\n4. RESULTS AND DISCUSSION\n\nThis is the largest sample yet of supernova host galaxy\nspectra metallicity measurements from a single survey.\nNevertheless, limited observing time made following up\nthe entire PTF type II sample impractical, so we first\nshow in §4.1 that our spectroscopic host sample is representative of the full sample. We then place the SN\nhosts in context in §4.2 by comparing their properties to\nthose of galaxies in the MPA/JHU value-added catalog.\nWe find that while they are well-matched in galaxy mass\nand metallicity, the type II hosts appear to be biased\ntoward higher star formation rates than the galaxies in\nthe catalog. We show in §4.3 that the metallicity distribution of these type II hosts is remarkably similar to\nthat found by previous studies of hosts of type II SNe,\ndespite coming from multiple surveys with different selection functions. Their metallicity distribution is also consistent with a distribution of star formation calculated\nfrom galaxy population statistics (§4.4). We discuss in\n§4.5 how our study avoids some selection effects due to\nsupernova type and host galaxy type that might influence the metallicity distribution. A key future use of the\nmetallicity distribution of type II SNe we find here will\nbe to evaluate possible metallicity dependence of other\nsubclasses of CCSNe. We discuss the advantages and\ndisadvantages of the metallicity diagnostic we choose for\n\n\f6\n\nStoll et al.\n\nFigure 3. The two methods of estimating SFR are consistent.\nSFR estimates based on u-band photometry (Salim et al. 2007) are\nplotted against SFR estimates based on FAST for the full sample\nof PTF type II SN hosts (open red points) and the metallicity\nsubsample (solid black points). The blue dashed line represents a\n1:1 correspondence.\n\nthis study in §4.6. Finally, we fit a relationship between\noxygen and iron abundances in §4.7, and convert our observed oxygen abundance distribution into an assumed\niron abundance distribution, as iron is more important\nto the evolution of massive stars than oxygen.\n4.1. How representative is the metallicity sample?\nTo investigate how representative the subsample for\nwhich we have spectra and metallicities is of the entire\nsample of PTF type II SN hosts we compared the distributions of the two samples in galaxy mass, characteristic\nstellar age, and star formation rate, using the 32 (47)\nhosts with (and without) measured metallicities that also\nlie in the SDSS DR8 imaging footprint. Figures 4 and\n5 show that the two sub-samples have essentially identical distributions in host mass (K-S probability 99.9%),\nage (57.8%), and SFR (64–74%, depending on the SFR\nestimation method).\nWe also investigated the effects of redshift on the completeness of the sample by dividing it into lower and\nhigher redshift subsamples and comparing the properties of the two. In Figure 6 we show the metallicity\ndistribution of these two subsamples. A K-S test indicates that the two have a 19% probability of being drawn\nfrom the same metallicity distribution, consistent at approximately 1σ. The hosts in the two redshift bins have\nessentially identical distributions in host mass (K-S probability 63%), age (91%), and SFR (91–99%, depending\non the estimation method).\n4.2. The type II metallicity sample in context\nWe next place our type II host sample in context by comparing it to galaxy properties in the DR7\nSDSS MPA/JHU value-added catalog (Kauffmann et al.\n2003; Tremonti et al. 2004; Brinchmann et al. 2004;\n\nSalim et al. 2007). We compare to the subset of the\nDR7 objects which have redshifts within the range of\nour sample, successful estimates of the stellar mass and\nstar formation rate, a 12+log(O/H) metallicity estimate,\nand an [N II]λ6584/Hαλ6563 flux ratio within the valid\nrange for the PP04 N2 metallicity diagnostic. This last\nrequirement has almost no effect, reducing the sample\nby only 0.6%. The strictest condition by far is the requirement of a valid Tremonti et al. (2004) metallicity\nestimate, as shown in Table 7. Note that the galaxy\nproperties in the MPA/JHU value-added catalog are a\nfunction of redshift because is not a volume-limited sample. The selection that defines the catalog is reflected in\nthe properties of its constituents.\nAs shown in Figure 7, the SN hosts appear to trace\nthe MPA/JHU sample well. Their mass-metallicity relationships are consistent at approximately one sigma.\nStrong conclusions should not be drawn from this, as\nthe sample selection functions of the PTF type II host\ngalaxies and the SDSS galaxy mass-metallicity sample\nof the MPA/JHU value-added catalog are each complex\nand based in part on parameters unrelated to the galaxies themselves. The fiber allocation in SDSS prioritized\ngalaxies lower than other target classes, including brown\ndwarfs and quasar candidates (e.g. Blanton et al. 2003),\nmeaning that the selection function of galaxies observed\nspectroscopically in a given field is mediated by the density of other targets in that field rather than a simple\nfunction of the properties of the galaxies themselves. To\nzeroth order, SDSS galaxy spectroscopic observations are\na function of stellar mass, while core-collapse supernovae\n(and by extension our host sample) are instead a function\nof star formation rate in the recent past. Inclusion in the\nmass-metallicity sample of the MPA/JHU value-added\ncatalog is not a simple function of the galaxy having\nbeen spectroscopically observed. In order to be included,\nthe galaxy must have a reasonable fit using the group's\nBayesian metallicity determination. The strength of the\nspectroscopic features that enable this determination is\ngreater for galaxies with a higher star formation rate,\nwhich means that the star formation rate is to a certain extent a hidden parameter in this selection function.\nThe PTF followup selection function is unpublished, and\ntherefore impossible to model. Reconciling the selection\nfunctions of these samples sufficiently to draw strong conclusions based on comparing their mass-metallicity slopes\nis not possible, nor is it the aim of this study. Instead,\nwe compare them to place our results in context.\nThe SDSS galaxy spectra are primarily nuclear spectra but not exclusively so. In contrast, 50of locations\nmore than 3 arcsec away from the nucleus, as can be\nseen in Table 2. The SN location was within 3 (4,6)\narcsec of the galaxy center in all but 5 (3,1) of the remaining cases. In one case (PTF09aux), we were unable\nto measure [N II] and Hα with sufficient S/N to measure\nmetallicity. Type II SNe have no known metallicity dependence, so they are not expected to favor the outer,\nmore metal-poor regions of galaxies.\nAlthough quantitative conclusions should not be drawn\nfrom this similarity due to these unavoidable sample selection incongruities, some qualitative conclusions can\nbe drawn. The type II SN hosts do not appear to be\nbiased toward lower metallicities at a given mass (left\npanel) as a simplistic interpretation of the results of\n\n\fType II SNe Environment Metallicities\n\n7\n\nFigure 4. The distributions of the full PTF type II sample (dotted red) and those for which we obtained metallicities (solid black).\nSection 3.2 describes how the host properties were estimated. The subsample for which we have spectroscopic metallicity measurements\nis quite representative of the full sample, with K-S test probabilities of 99.9% (mass) and 57.8% (age) that they are drawn from the same\ndistribution.\n\nFigure 5. The subsample of type II hosts for which we have measured metallicities (solid black) is representative of the full sample of\nPTF type II SN hosts (dotted red) in SFR based on u-band photometry (Salim et al. 2007, left) and FAST (right).\n\nMannucci et al. (2010) might suggest. It has been suggested that core-collapse SNe and GRBs may be less\nfrequently observed in higher metallicity environments\nthan in lower metallicity environments due to higher extinction (e.g. Maiolino et al. 2002; Mannucci et al. 2003;\nCresci et al. 2007; Campisi et al. 2011), but this sample\ndoes not show evidence for such a bias. The SN hosts\ndo, however, appear to be biased toward higher star formation rates7 (right panel) than the MPA/JHU galaxy\nsample, as would be expected if they do indeed trace\n7 Here we use the SFR calculated from the u-band luminosity\nwith aperture corrections.\n\nstar formation. They appear to trace the distribution\nof the MPA/JHU sample well in galaxy mass and star\nformation rate, as shown in Figure 8.\n4.3. Comparing with other SNe host samples\n\nWork on the metallicity distribution of supernova hosts\nby Prieto et al. (2008) and Kelly & Kirshner (2012)\nlooked at overall galaxy metallicity with serendipitous SDSS spectra, without isolating the SN site.\nKelly & Kirshner (2012) subdivide their sample into\nthose discovered by galaxy-impartial searches and by targeted searches. Studies by Anderson et al. (2010) tried\nto measure abundances at the SN site or at a similar\n\n\f8\n\nStoll et al.\n\nFigure 6. The metallicity distribution of the type II hosts separated into two bins in redshift of seventeen hosts each (left). The green\nsolid (red dotted) line is the lower (higher) redshift half of the sample, 0.019 ≤ z ≤ 0.035 (0.037 ≤ z ≤ 0.11). On the right, the distribution\nis expanded and metallicities are plotted against redshift. Here the lower redshift half of the sample is green solid points, and the higher\nredshift is red open points. A K-S test shows the two are consistent with being drawn from the same distribution in metallicity at the 19%\nlevel. There do not appear to be any major selection effects with redshift.\n\nFigure 7. Measured host metallicities (black points) as a function of galaxy mass (left) or SFR (right), overlaid on the distribution in the\nMPA/JHU value-added catalog in the same redshift range (blue contours). Our hosts are slightly offset to higher star formation rates, as\nwe would expect if type II SNe trace star formation.\n\ngalactocentric radius, as we have done in this study.\nThese previous studies had uniform spectroscopy but the\nsource SN samples were heterogeneous, including SNe\ndiscovered in a wide variety of ways with very different\nselection effects. Our source SN sample is from a single survey with uniform selection. The source survey\nis areal rather than galaxy-targeted, which enables the\ndetection of events in the lowest-mass galaxies, removing or at least mitigating a possible bias towards high\nmetallicity environments which we expect exists in prior\nsupernova host samples. We do not attempt to define a\n\nvolume-limited supernova sample here. Rather, we point\nout that this existing sample represents a substantial step\nforward from previous similar samples for the purpose of\nproviding a comparison for a non-matched sample of rare\ncore-collapse events, particularly one thought to depend\non metallicity such as GRBs or abnormally luminous CCSNe.\nKelly & Kirshner (2012) used abundances following Tremonti et al. (2004) and the O3N2 method of\nPettini & Pagel (2004). In this paper we use the N2\nmethod of Pettini & Pagel (2004), so we must convert\n\n\fType II SNe Environment Metallicities\n\nFigure 8. Host mass and SFR for our type II SN hosts with Z\nmeasurements (large black points), all first-year PTF type II SNe\nhosts in the SDSS photometric footprint (small red points), overlaid on the distribution in the MPA/JHU catalog (blue contours).\n\nthese to a common scale. The valid range of the conversion defined by Kewley & Ellison (2008) from the scale\nof the O3N2 method to the scale of the N2 method\ndoes not span the abundances here, so we omit three\nof the 124 hosts in the sample, and convert from O3N2.\nPrieto et al. (2008) uses abundances from the method of\nTremonti et al. (2004), we omit the 14 of 152 hosts that\nhave T04 metallicities above or below the valid conversion range defined by Kewley & Ellison (2008).\nWe compare our type II host metallicity distribution with those found by Prieto et al. (2008),\nKelly & Kirshner (2012) targeted (T) and galaxyimpartial (I), and Anderson et al. (2010) in Figure 9.\nThe K-S test probabilities that our type II sample could\nbe selected from the same underlying distribution as\nthose in the earlier studies are 43%, 68%, 4%, and 21%,\nrespectively. The agreement of our SN metallicity distribution with the results of these prior studies is striking,\ngiven the different sample selection. The most different\nsample (at a K-S probability of only 4%) is the one which\nwould seem to be the most similar; the heterogeneous\ngalaxy-impartial sample from Kelly & Kirshner (2012).\n4.4. Comparing with SFR metallicity distributions from\n\ngalaxy population statistics\nOne semi-observational way of determining the global\ndistribution of star formation as a function of metallicity\nis to combine the observed galaxy mass function, the observed mean star formation rate as a function of galaxy\nmass, and the observed galaxy mass-metallicity relationship. Stanek et al. (2006) combines the 2MASS and\nSDSS galaxy stellar mass function from (Bell et al. 2003)\nwith the Tremonti et al. (2004) mass-metallicity relation\nand the Brinchmann et al. (2004) star formation rate\ndensity. Niino (2011) calculates the metallicity distribution of star formation two different ways; first, observationally from the stellar mass function, the galaxy M-\n\n9\n\nFigure 9. Distribution of local gas-phase oxygen abundance of\nour sample of type II SNe (black solid line) compared with existing\nSN host metallicity samples. The dotted orange curve shows the\nheterogeneous type II subsample of Anderson et al. (2010). The KS probability of this sample being drawn from the same underlying\ndistribution as our PTF type II sample is 11%. Similarly, the green\nlong-dash curve shows the distribution of type II, IIP, and IIn SNe\nfrom Prieto et al. (2008) (K-S probability 87%) and the purple\ndash-dot curve shows the type II sample from Kelly & Kirshner\n(2012) (K-S probability 45%). In the latter two cases we converted\ntheir T04 scale metallicity to the PP04N2 scale using the conversion\ngiven in the Appendix.\n\nSFR relation, and the galaxy mass-metallicity relation,\nnearly identically to Stanek et al. (2006) except using the\nmass-metallicity relation of Savaglio et al. (2005), and\nsecond, calculated using the relationship between galaxy\nmass, metallicity, and SFR defined by Mannucci et al.\n(2010), and assigning metallicities based on SFR as well\nas mass. Each of the three observed relationships that are\ninputs to these alternate methods of finding the metallicity distribution of star formation has its own set of\nselection effects. Potential biases or redshift-dependent\neffects in the samples used to define the relation could\noffset the distribution in metallicity. The width of the\ndistribution may be misrepresented by using a mean relationship to translate from one property into another,\nsuch as the mass-metallicity relationship (Tremonti et al.\n2004) or the three-way relationship between mass, metallicity, and star formation rate (Lara-López et al. 2010;\nMannucci et al. 2010), because the scatter around that\nrelationship may not be carried through to the final distribution.\nIn Figure 10 we plot our distribution against those of\nStanek et al. (2006) and Niino (2011) based on galaxy\npopulation statistics. We convert the metallicities using Kewley & Ellison (2008). The non-monotonicity of\nthe conversions from T04 and KK04 to PP04N2 results\nin non-physical double-values in the cumulative distributions. On the right, metallicity conversions are done\nwith by inverting the reverse conversions, as described in\nAppendix. This maintains the physicality of the distribution function, but may increase inaccuracy at higher\n\n\f10\n\nStoll et al.\n\nmetallicities. Because the forward and reverse conversions do not match, multiple conversions between metallicity scales will compound errors. This is likely the\nreason why the distribution from Stanek et al. (2006)\n(in green) does not match the distribution from Niino\n(2011) which considers the mass-metallicity relation independently of star-formation (in red). Instead of using Tremonti et al. (2004), Niino (2011) uses the massmetallicity relation of Savaglio et al. (2005) on the KK04\nscale, though they are otherwise identical.\nCore-collapse SNe, as the deaths of massive, young\nstars, are a relatively good tracer of SFR. Using the\nmetallicity distribution of a uniform sample of type II SN\nsites to approximate the metallicity distribution of star\nformation, as we have done, should have almost completely independent selection effects (such as extinction\nfrom dust) from methods relying on galaxy population\nstatistics.\n4.5. Selection effects\nOne of the primary potential sources of incompleteness\nin using type II SNe environments to trace the metallicity distribution of global star formation will of course\nbe the selection of the sample of type II SNe. An ideal\nsample for this purpose would be a complete, volumelimited sample, monitoring a fixed region of sky for a\nfixed period of time, and then eliminating events outside\nthe complete sample. Up until very recently, most supernova surveys have monitored large, luminous galaxies\nrather than regions of the sky, a methodology which has\nthe potential to miss any SNe in the very lowest end of\nthe galaxy luminosity function. The Palomar Transient\nFactory survey is areal, which removes the potential bias\nagainst extremely low-mass host galaxies of targeted surveys. Because the survey selection is not yet published,\nhowever, we are unable to correct for any biases in our\nsource sample to get a distribution for a volume-limited\nsample. With the current rapid growth in depth and\nbreadth of supernova surveys, there is great potential for\nthis method of determining the metallicity distribution\nof star formation.\nAnother potential source of bias for this method is any\ndependence of the likelihood of a massive star resulting\nin a type II SN on metallicity. Type II-P SNe make up\naround 70% of all type II SNe in the LOSS survey, which\nfocuses on relatively luminous galaxies (Li et al. 2011).\nThe relative frequency of type II SNe has not yet been\nfound to depend on metallicity, unlike type Ib and Ic SNe.\nWe examine only the distribution of type II hosts, for\nwhich we have good statistics. The type II distribution is\nconsistent with the distribution of the nine type Ib/Ic/IIb\nhosts we have measured with a K-S probability of 23%,\nand the distribution of the hosts of all CCSNe we have\nmeasured (including all the type II hosts) is consistent\nwith the type II distribution with a K-S probability of\n99%, shown in Figure 11 (left). Completeness corrections\nto translate between type II hosts and all CCSN hosts\nmay depend slightly on metallicity.\nSeveral types of CCSNe are known to vary in frequency with metallicity, as discussed in §1. Our very\nsmall sample of spectroscopic metallicity measurements\nof hosts of type IIb/Ib/Ic SNe is statistically consistent with these previous results (Modjaz et al. 2011;\nAnderson et al. 2010; Kelly & Kirshner 2012), but not\n\nat very high significance level. Using the host galaxy\nproperties we fit from SDSS photometry gives us slightly\nbetter statistics, shown in Figure 11 (right). The overrepresentation of types IIb and Ic-BL in low-mass hosts\nis consistent with the results of Arcavi et al. (2010) of\nthis same sample based on host galaxy luminosities, but\nagain, not at very high significance. The relative distributions of type II, IIb, Ib, Ic, and Ic-BL in photometrically calculated host mass are consistent with the recent\nresults of Kelly & Kirshner (2012).\n4.6. Strong-line metallicity diagnostics\nThere is a substantial literature on the merits and disadvantages of each commonly-used method of determining metallicities based on fluxes of strong emission lines\n(e.g. Berg et al. 2011; Kewley & Ellison 2008, and references therein). These methods all rely on simplifying\nassumptions about the H II regions being examined: uniformity of electron density, cooling dominated by oxygen\n(implying that other cooling species have abundances\nthat vary in lockstep with oxygen), and ionizationbounded H II regions (e.g. Pagel et al. 1979). The methods can be classified into rough categories: direct methods, which rely on estimates of the electron temperature\nand require measurements of faint auroral lines such as\n[O III]λ4363Å, empirical (e.g. Pettini & Pagel 2004), theoretical (e.g. Kobulnicky & Kewley 2004), and a combination of empirical and theoretical (e.g. Denicoló et al.\n2002). All these methods are based on high S/N measurements of the line ratios of different combinations of\nemission lines from ions present in the optical region of\nthe spectrum (≃ 3700 − 6800Å: [O II], [O III], [N II],\n[S II], Hα, and Hβ).\nThe slope and intercept of the galaxy massmetallicity relationship is different for each diagnostic\n(Kewley & Ellison 2008), which is a relatively straightforward way to demonstrate that they are not all directly\nmeasuring some platonic ideal of a fundamental oxygen\nabundance measurement. (This problem is independent\nof the separate question of the exact value of the solar oxygen abundance, which also affects how measured\ngas-phase abundances map to stellar abundances.) Instead, each technique measures a different quantity that\ncorrelates well with oxygen abundance, but does not directly map to it. The simplifying assumptions that allow\nus to use each strong-line indicator to estimate oxygen\nabundance are not perfect for all H II regions. Rigorously selecting the best diagnostic for a given situation\nrequires better data than are achievable for distant and\nfaint targets, and doing a case-by-case selection of strongline method on insufficient data would introduce its own\nbiases.\nThe primary advantage of the strong-line techniques is\nthat they are possible with fewer photons, and are therefore feasible to perform on large samples for good population statistics. Given the scale differences between\nmethods, however, it is crucially important to ensure\nthat all metallicities one is comparing are on the same\nscale. Where possible, we do this by natively determining\nthe metallicities in a common scale. Where impossible,\nwe convert a metallicity determined on another scale using the empirical conversions of Kewley & Ellison (2008)\n(but see Appendix A). We emphasize that any meaning-\n\n\fType II SNe Environment Metallicities\n\n11\n\nFigure 10. The distribution of star formation as a function of metallicity from galaxy population statistics from Stanek et al. (2006)\n(green dotted line) and Niino (2011) with (blue long-dashed line) and without (red short-dashed line) incorporating the star-formation-rate\ndependence of the mass-metallicity relationship as Mannucci et al. (2010), compared to our distribution of site metallicities of type II\nCCSNe (black solid line). On the left, the metallicity conversions were made with Kewley & Ellison (2008). The non-monotonicity of the\nconversions from T04 and KK04 to PP04N2 results in the non-physical double-values. On the right, conversions are done with by inverting\nthe reverse conversions, as described in Appendix. This maintains the physicality of the distribution function, but may increase inaccuracy\nat higher metallicities.\n\nFigure 11. The metallicity distribution (left) of type II SN hosts (solid black), all other CCSN hosts (dashed orange) and all CCSN\nhosts in Table 2 (dotted green). With this small sample of other subtypes, the type II distribution is statistically consistent with the other\nCCSNe (K-S probability 23%) and with all CCSNe (K-S probability 99%). Increasing the sample size, the distribution in photometrically\ncalculated host galaxy mass (right) of type II SN hosts (black solid), Ic-BL (pink dotted), IIb (green short-dashed), Ib (blue long-dashed),\nand Ic (red dot-dashed). These distributions are consistent with the overrepresentation of IIb and Ic-BL at low host luminosity found by\nArcavi et al. (2010) and with the distributions in host mass found by Kelly & Kirshner (2012).\n\n\f12\n\nStoll et al.\n\nful conclusion should not be affected by a change in the\nmetallicity calibration.\nThe primary scale we choose for this study is the\nN2 diagnostic of Pettini & Pagel (2004), which depends\nsolely on [N II]λ6584/Hαλ6563. Three disadvantages of\nthe method are that it shows a larger dispersion compared to the direct (Te ) method than most other strong\nline diagnostics, that it has a dependence on the ionization parameter that becomes important at low metallicities (PP04N2 12+log(O/H) < 8.0) (López-Sánchez et al.\n2012), and that it loses sensitivity and saturates at high\nmetallicities (PP04N2 12+log(O/H) > 8.86). There are\na number of key advantages of this diagnostic, however.\nThe ratio is very insensitive to reddening due to the close\nwavelength proximity of the lines. It is monotonic with\noxygen abundance. It depends on lines with relatively\nhigh fluxes in star forming environments, which means\nthat good metallicity estimates can be achieved at relatively low observational expense. Yin et al. (2007) find\nit is more consistent with Te methods than the O3N2\ndiagnostic of Pettini & Pagel (2004), and Bresolin et al.\n(2009) compare a variety of strong-line abundance estimators and find that PP04N2 is the closest match in\nboth slope and normalization to the oxygen abundance\ngradient in NGC 300 measured with the Te method and\nmeasured with stellar metallicity (blue supergiants).\n4.7. Iron abundances\nIron is more important than oxygen for the latestage evolution of massive stars, because iron provides\nmuch of the opacity for radiation-driven stellar winds\n(Pauldrach et al. 1986; Vink & de Koter 2005, e.g.). Unfortunately, gas-phase iron abundances are difficult to\nmeasure, and the fraction of iron depleted onto grains\nis highly variable. Even within our own galaxy, measuring iron abundances is challenging (e.g. Rodrı́guez\n2002; Jensen & Snow 2007; Okada et al. 2008). We measure gas-phase oxygen abundances instead as a proxy for\nmetallicity because it is observationally feasible.\nBecause iron is the dominant opacity source, we would\nlike to estimate the iron abundances implied by the observed oxygen abundances. To do this we make use of\nthree correlations: first, the PP04N2 diagnostic, which\nuses a function of the flux ratio of the Hα λ6563 and\n[N II]λ6584 lines that correlates well with direct method\n(Te ) measures of gas-phase oxygen abundance; second,\nthe tight correlation of direct method measures of gasphase oxygen abundance with stellar oxygen abundance;\nthird, the correlation between stellar oxygen and stellar\niron abundances.\nBresolin et al. (2009) find that PP04N2 is the closest match in both slope and normalization to the oxygen abundance gradient in NGC 300 measured with Te\nmethods, with an average error of approximately 0.1 dex.\nAlthough PP04N2 is a good match to direct-method\ngas-phase oxygen abundance, it is not perfect, and a\nsmall correction to slope and zero point could be made.\nFor the purpose of this paper, however, we assume that\nPP04N2 maps precisely to direct-method oxygen abundances. Bresolin et al. also find that the gas-phase oxygen abundance gradient measured with Te methods correlates very tightly with with the stellar oxygen abundance gradient, with an error of no more than about 0.03\ndex. For the purposes of this paper, we assume that the\n\ncorrespondence between Te gas-phase oxygen abundance\nand stellar oxygen abundance is one-to-one, which is a\nvery good assumption.\nStars that have low oxygen abundances have even\nlower iron abundances. At low metallicity, α-elements\nlike oxygen are enhanced relative to iron compared to\nthe solar mixture. In the galactic disk and halo, at\n[Fe/H] > −1, [O/Fe] is approximately inversely proportional to [Fe/H], as can be seen in the left panel of Figure 12, while below [Fe/H] = −1, [O/Fe] may flatten\nout at a constant (and lower) relative iron abundance\n(e.g Tinsley 1979; McWilliam 1997; Johnson et al. 2007;\nEpstein et al. 2010) (but see e.g. Israelian et al. 1998).\nTo estimate the conversion between stellar oxygen and iron abundance, we compared [O/H] to\n[Fe/H] over a wide range in metallicities using stellar abundance measurements from the Milky Way\nbulge, disk, and halo, from Fulbright et al. (2007);\nRich et al. (2007); Rich & Origlia (2005); Lecureur et al.\n(2007); Reddy et al. (2003, 2006); Bensby et al. (2004);\nChen et al. (2003). We fit the relationship between\n[O/H] and [Fe/H] with an unweighted linear fit, as seen\nin Figure 12, and find\n[Fe/H] = c1 + c2 ([O/H]),\n\n(1)\n\nwhere c1 = −0.34 ± 0.01 and c2 = 1.25 ± 0.05. Although\nthe eye is drawn to a steeper trend at higher metallicity\nthan the formal fit shown, this misleading and based on\nrelatively few points; the fit is driven to be flatter by a\ndense concentration of points with −0.2 < [O/H] < 0.2\nand −0.5 < [Fe/H] < 0. The relationship does not differ substantially between bulge stars (shown in red) and\nhalo and disk stars (shown in blue). If [O/Fe] flattens out\nbelow [Fe/H] = −1, the linear relationship we choose to\nfit may not extend to lower metallicities. We would expect to find a slightly steeper relationship were we to\nexclude points below [Fe/H] = −1, which would mean\nthat type II SN progenitors in low oxygen abundance\nhost regions have even lower iron abundance than we find\nhere. Because there is finite scatter in the measured relationship, however, imposing a strict cut at [Fe/H] = −1\nactually drives the fit to be slightly flatter by biasing\nthe points with lowest [O/H] to higher [Fe/H]. The exact value of the slope is not critically important; the\nmain point is that low oxygen abundances imply even\nlower iron abundances, as can easily be seen in the right\nside of Figure 12. This is equivalent to saying that at\nlow metallicities, alpha elements are enhanced relative\nto iron.\nStellar abundances are measured relative to solar, while gas-phase abundances are (nominally) absolute. Applying the fit to a direct conversion between\n12+log(O/H) and [Fe/H] therefore requires assuming a\nsolar oxygen abundance. There is currently some dispute over the solar abundance because results from atmospheric and interiors methods differ. For a given solar\noxygen abundance O⊙ ,\n[Fe/H] = c1 − c2 O⊙ + c2 (12 + log(O/H)).\n\n(2)\n\nUsing a solar oxygen abundance of O⊙ = 8.86\n(Delahaye & Pinsonneault 2006), the conversion is\n[Fe/H] = −11.4 + 1.25(12 + log(O/H)), while using\nO⊙ = 8.69 (Asplund et al. 2009), the conversion is\n[Fe/H] = −11.2 + 1.25(12 + log(O/H)).\n\n\fType II SNe Environment Metallicities\n\n13\n\nFigure 12. To translate oxygen abundances into iron abundances, we fit a linear relation (black) to the iron and oxygen abundances\nof Milky Way bulge, disk, and halo stars. At low metallicity, α-elements like oxygen are enhanced relative to iron compared to the solar\nmixture. On the left is the well-known relationship between [O/Fe] and [Fe/H]. The red open points are iron and oxygen abundances of\nbulge stars (Fulbright et al. 2007; Lecureur et al. 2007; Rich & Origlia 2005; Rich et al. 2007). The blue solid points are halo and disk\nstars (Bensby et al. 2004; Chen et al. 2003; Reddy et al. 2003, 2006). On the right we express this in terms of [O/H] and [Fe/H] and fit\nthe relation. Although the eye is drawn to a steeper trend at higher metallicity than the formal fit, this is an illusion based on relatively\nfew points; the fit is driven to be flatter by a dense concentration of points with −0.2 < [O/H] < 0.2 and −0.5 < [Fe/H] < 0. The blue\ndashed line has a slope of 1 to guide the eye and intersects with the fit at [O/H] = 0, showing that iron varies more steeply than oxygen. If\nthe slope is steeper than we have fit, this conclusion strengthens. Equation 2 can be used to conservatively convert a measured gas-phase\noxygen abundance to iron abundance for a given solar oxygen abundance (modulo the uncertainties of equating gas-phase strong-line\noxygen abundance indicators to stellar oxygen abundances). This conversion is necessary because at low metallicities, alpha elements such\nas oxygen are enhanced relative to iron, and iron is the main opacity source for line-driven winds and thus may drive mass loss for supernova\nprogenitors.\n\nWe apply this fit to transform our oxygen abundance distribution of type II progenitors into an iron\nabundance distribution, shown in Figure 13. The median value of [Fe/H] is −0.60 using the solar value of\nDelahaye & Pinsonneault (2006). If another solar oxygen abundance O⊙ is assumed, the calculated iron value\nshifts by\nc2 (8.86 − O⊙ ),\n(3)\n\ngreater than [Fe/H] = −1.5, putting them squarely in the\nregime where winds are primarily driven by iron opacity.\nFor the most metal-poor stars (Z/Z⊙ < 10−3 ), non-iron\nelements such as carbon dominate the radiative driving\n(Vink & de Koter 2005), but in the metallicity range of\nthese type II SN progenitors, iron abundance should still\nbe the dominant factor which determines wind strength\nand mass loss.\n\nso using O⊙ = 8.69 (Asplund et al. 2009), for example,\nthe median value of [Fe/H] is −0.39.\nThe most important result here is that the gap between the iron and oxygen abundances is 50% wider at\nthe low-metallicity end of the distribution than at the\nhigh-metallicity end, even though this sample spans less\nthan a dex in abundance. Were we to assume that [O/Fe]\nflattens out below [Fe/H] = −1 instead of remaining linear, the slope we fit would be steeper and the difference\nwould be even greater. A striking outcome of this translation is that all of the type II SN progenitors in this\nsample appear to have sub-solar iron abundances. Although this is notable, it is not entirely surprising; the\nsun is more enhanced in iron than most Milky Way stars\nat its oxygen abundance, and all of the host galaxies in\nthis sample are smaller than the Milky Way. It is, however, not a secure result. Given the scatter in the correlations we use to define this relation, we caution that\nconversions of average values are uncertain at the level\nof at least 0.15 dex, and conversions of individual values\nare uncertain at the level of approximately 0.3 dex.\nThe type II progenitors all have iron abundances\n\n5. CONCLUSIONS\n\nThe primary result of this paper is a new progenitor region metallicity distribution for a uniform (though\nnot completely unbiased) sample of type II SNe. Understanding the underlying distribution is important for\nunderstanding any possible metallicity dependences of\ndifferent types of events associated with massive stars,\nand it can serve as a probe of the metallicity distribution\nof star formation.\nThe host galaxies of our type II sample appear to trace\ngalaxies from the MPA/JHU value-added catalog in mass\nand metallicity, showing a slight bias towards higher star\nformation rates.\nWe find a similarity between the existing host metallicity distributions for heterogeneous type II supernova\nsamples and the metallicity distribution we derive. Because the existing host metallicity distributions are based\non supernova samples that are drawn predominantly\nfrom galaxy-targeted supernova searches, one might\nnaively expect these previous distributions might be biased towards higher mass and therefore higher metallicity\ngalaxies. We do not find such a trend.\n\n\f14\n\nStoll et al.\n\nFigure 13. The estimated [Fe/H] distribution of the type II SN\nsites. The red dashed line is the [O/H] distribution, and the blue\nsolid line is the [Fe/H] distribution assuming the solar oxygen abundance is 8.86 (Delahaye & Pinsonneault 2006). The arrows indicate the shift corresponding to assuming a solar oxygen abundance\nof 8.69 (Asplund et al. 2009). The green dotted line is the oxygen abundance shifted left by 0.35 to line up with the iron at the\nhigh-metallicity end. Notice that the gap between the iron and\nthe oxygen abundance is 50% wider at the low-metallicity end of\nthe distribution as at the high-metallicity end. Iron varies more\nsteeply than oxygen, and a galaxy that has low oxygen abundance\nhas even lower iron abundance.\n\nComparing to the metallicity distribution of star formation rather than to the metallicity distribution of\ngalaxies as a function of mass is the correct way to evaluate a possible metallicity dependence of a transient population associated with young stars. We point out that using CCSNe to trace star formation leads to an almost entirely independent way of probing the metallicity distribution of star formation from methods involving galaxy\npopulation statistics, and we compare the metallicity distribution we derive to one of these.\nFinally, we present our host metallicity distribution in\nterms of iron abundance, by converting our oxygen abundance distribution to an iron abundance distribution using the α/Fe relationship observed in Milky Way bulge,\ndisk, and halo stars, noting that iron is more important\nthan oxygen for the late-stage evolution of massive stars.\nWe show that even though these hosts span less than\n\na dex in oxygen abundance, the gap between their iron\nabundance and oxygen abundance nearly doubles at the\nlow-metallicity end compared to the high-metallicity end.\nWe estimate that −1.2 < [Fe/H] < 0 for these type II SN\nprogenitors. Though all may have sub-solar iron abundance, none are metal-poor enough that elements other\nthan iron will dominate the wind-driving opacity of the\nprogenitor star.\nFuture improvements to this estimate of the metallicity\ndistribution of type II SNe can be made by performing\ncompleteness corrections for any selection or followup biases in the source survey. If the peak luminosity of type II\nSNe is found to depend on host galaxy metallicity, there\nmay also be Malmquist-like biases to correct.\nWe thank B. Andrews, J. Antognini, R. Assef, D.\nAtlee, C. Epstein, J. Johnson, C. Kochanek, P. Martini, and L. Watson for discussion, comments, or assistance. RS is supported by the David G. Price Fellowship\nin Astronomical Instrumentation and the Tuttle Endowment. JLP acknowledges support from NASA through\nHubble Fellowship grant HF-51261.01-A awarded by the\nSTScI, which is operated by AURA, Inc. for NASA,\nunder contract NAS 5-26555. This paper uses data\ntaken with the OSMOS spectrograph, built with funding from NSF grant AST-0705170 and from the Center\nfor Cosmology and AstroParticle Physics at The Ohio\nState University. Funding for SDSS-III has been provided by the Alfred P. Sloan Foundation, the Participating Institutions, the National Science Foundation, and\nthe U.S. Department of Energy. The SDSS-III web site\nis http://www.sdss3.org/. SDSS-III is managed by the\nAstrophysical Research Consortium for the Participating\nInstitutions of the SDSS-III Collaboration including the\nUniversity of Arizona, the Brazilian Participation Group,\nBrookhaven National Laboratory, University of Cambridge, University of Florida, the French Participation\nGroup, the German Participation Group, the Instituto\nde Astrofisica de Canarias, the Michigan State/Notre\nDame/JINA Participation Group, Johns Hopkins University, Lawrence Berkeley National Laboratory, Max\nPlanck Institute for Astrophysics, New Mexico State\nUniversity, New York University, Ohio State University,\nPennsylvania State University, University of Portsmouth,\nPrinceton University, the Spanish Participation Group,\nUniversity of Tokyo, University of Utah, Vanderbilt University, University of Virginia, University of Washington,\nand Yale University.\nFacilities: Hiltner (OSMOS), Sloan, ARC (DIS), Du\nPont (WFCCD).\n\nAPPENDIX\nMETALLICITY CONVERSIONS\n\nIt is well known that the various strong-line oxygen abundance estimators have different scales and zero-points.\n(For excellent pictorial representations of this, see Figure 2 of Kewley & Ellison (2008) or Figure 12 of Bresolin et al.\n(2009).) Because of these differences in scale and zero-point, it is critically necessary to put different estimates on\na common scale before comparing abundances. Kewley & Ellison (2008) determined empirical conversions between\nmany of the commonly used scales by fitting the trend defined by performing a given two diagnostics on a large sample\nof high S/N galaxy spectra from SDSS. While these conversions have been very useful to the community, there can\nbe problems using them at very low metallicity. The forward and reverse conversions between two methods are not\nalways consistent, or even monotonic, as can be seen by comparing the black solid and red dotted lines in Figure 14.\nThe problem appears to be a consequence of the interaction between the vast statistical weight of the abundant highmetallicity galaxies and the third-order polynomials (the inversion of which cannot be precisely expressed as another\n\n\fType II SNe Environment Metallicities\n\n15\n\nFigure 14. Forward and reverse conversion over the entire valid conversion ranges between the metallicity scale of Kobulnicky & Kewley\n(2004) and the N2 scale of Pettini & Pagel (2004) (left) and between Tremonti et al. (2004) and the N2 scale of Pettini & Pagel (2004)\n(right). To KK04 and T04 is the black solid line, while from KK04 and T04 is the red dotted line. The blue dashed line would represent a\nconversion between two exactly equivalent metallicity scales. The scales are the same as those in Figure 3 in Kewley & Ellison (2008). The\ngreen long-dashed lines show our fits to the forward conversions, which we use in Figure 10 to convert from KK04 and T04 to PP04N2 in\norder to ensure monotonic behavior at low metallicities.\n\nthird-order polynomial) in which the conversions are expressed. The high-metallicity end is tightly pinned, allowing\nlow-metallicity end of the third-order polynomial to shift dramatically when the forward and reverse conversions are\nindependently fit to the data.\nPreserving monotonicity in a conversion is important when converting a continuous distribution, as can be dramatically seen in Figure 10. We are also concerned about the compounding errors involved in multiple conversions between\ndifferent scales, which is perhaps the most problematic negative consequence of the difference between the forward and\nreverse conversions, in that even the simplest conversion chain (to another scale and back again) results in a different\nmetallicity distribution. For applications involving more than one conversion, invertability can be more important\nthan the extra precision from fitting the forward and reverse conversions independently to the data.\nFor the purposes of this paper, we need to avoid the double-value of the non-monotonic T04 to PP04N2 conversion\nat low metallicities in order to convert the metallicity distribution of star-formation. We do so by defining ad hoc\nconversions from T04 to PP04N2 and from KK04 to PP04N2, as shown in Figure 14. These conversion are third-order\npolynomial fits to the conversion from PP04N2 to T04 and from PP04N2 to KK04 given in Kewley & Ellison (2008).\nThese fits are described by\ny = a + bx + cx2 + dx3 ,\n(A1)\nwhere y = 12+log(O/H)PP04N2. For T04, x = 12+log(O/H)T04, a = 178.248, b = −59.2077, c = 6.80078, and\nd = −0.257326, and for KK04, x = 12+log(O/H)KK04, a = −1657.85, b = 583.307, c = −68.1052, and d = 2.65189.\nNote that these are fits to fits rather than fits to data, and they are equivalent to mathematically inverting the\nconversion from PP04N2 to T04 or KK04 and approximating it as a third-order polynomial. We define them solely for\nthe purposes of avoiding a double-valued function at low metallicity and matching the inverse conversion from PP04N2\nto T04 and from PP04N2 to KK04.\nREFERENCES\nBerg, D. A., Skillman, E. D., & Marble, A. R. 2011, ApJ, 738, 2\nAbazajian, K. N., et al. 2009, ApJS, 182, 543\nAihara, H., et al. 2011, ApJS, 193, 29\nAnderson, J. P., Covarrubias, R. A., James, P. A., Hamuy, M., &\nHabergham, S. M. 2010, MNRAS, 407, 2660\nAnderson, J. P., Habergham, S. M., James, P. A., & Hamuy, M.\n2012, MNRAS, 424, 1372\nAnderson, J. P., & James, P. A. 2008, MNRAS, 390, 1527\nArcavi, I., et al. 2010, ApJ, 721, 777\nAsplund, M., Grevesse, N., Sauval, A. J., & Scott, P. 2009,\nARA&A, 47, 481\nAssef, R. J., et al. 2008, ApJ, 676, 286\nBadenes, C., Harris, J., Zaritsky, D., & Prieto, J. L. 2009, ApJ,\n700, 727\nBell, E. F., McIntosh, D. H., Katz, N., & Weinberg, M. D. 2003,\nApJS, 149, 289\nBensby, T., Feltzing, S., & Lundström, I. 2004, A&A, 415, 155\n\nBertin, E., & Arnouts, S. 1996, A&AS, 117, 393\nBlanton, M. R., Lin, H., Lupton, R. H., Maley, F. M., Young, N.,\nZehavi, I., & Loveday, J. 2003, AJ, 125, 2276\nBresolin, F., Gieren, W., Kudritzki, R., Pietrzyński, G.,\nUrbaneja, M. A., & Carraro, G. 2009, ApJ, 700, 309\nBrinchmann, J., Charlot, S., White, S. D. M., Tremonti, C.,\nKauffmann, G., Heckman, T., & Brinkmann, J. 2004, MNRAS,\n351, 1151\nBruzual, G., & Charlot, S. 2003, MNRAS, 344, 1000\nCampisi, M. A., Tapparello, C., Salvaterra, R., Mannucci, F., &\nColpi, M. 2011, MNRAS, 417, 1013\nChatzopoulos, E., et al. 2011, ApJ, 729, 143\nChen, Y. Q., Zhao, G., Nissen, P. E., Bai, G. S., & Qiu, H. M.\n2003, ApJ, 591, 925\nChomiuk, L., et al. 2011, ApJ, 743, 114\n\n\f16\n\nStoll et al.\n\nCresci, G., Mannucci, F., Della Valle, M., & Maiolino, R. 2007,\nA&A, 462, 927\nDelahaye, F., & Pinsonneault, M. H. 2006, ApJ, 649, 529\nDenicoló, G., Terlevich, R., & Terlevich, E. 2002, MNRAS, 330,\n69\nEldridge, J. J., Izzard, R. G., & Tout, C. A. 2008, MNRAS, 384,\n1109\nEpstein, C. R., Johnson, J. A., Dong, S., Udalski, A., Gould, A.,\n& Becker, G. 2010, ApJ, 709, 447\nFulbright, J. P., McWilliam, A., & Rich, R. M. 2007, ApJ, 661,\n1152\nGeorgy, C., Ekström, S., Meynet, G., Massey, P., Levesque,\nE. M., Hirschi, R., Eggenberger, P., & Maeder, A. 2012,\narXiv:1203.5243\nGeorgy, C., Meynet, G., Walder, R., Folini, D., & Maeder, A.\n2009, A&A, 502, 611\nGunn, J. E., et al. 2006, AJ, 131, 2332\nHan, X. H., Hammer, F., Liang, Y. C., Flores, H., Rodrigues, M.,\nHou, J. L., & Wei, J. Y. 2010, A&A, 514, A24\nHeger, A., & Woosley, S. E. 2002, ApJ, 567, 532\nIsraelian, G., Garcı́a López, R. J., & Rebolo, R. 1998, ApJ, 507,\n805\nJensen, A. G., & Snow, T. P. 2007, ApJ, 669, 378\nJohnson, J. A., Gal-Yam, A., Leonard, D. C., Simon, J. D.,\nUdalski, A., & Gould, A. 2007, ApJ, 655, L33\nKasen, D., & Woosley, S. E. 2009, ApJ, 703, 2205\nKauffmann, G., et al. 2003, MNRAS, 341, 33\nKelly, P. L., & Kirshner, R. P. 2012, ApJ, 759, 107\nKelly, P. L., Kirshner, R. P., & Pahre, M. 2008, ApJ, 687, 1201\nKessler, R., et al. 2009, ApJS, 185, 32\nKewley, L. J., & Dopita, M. A. 2002, ApJS, 142, 35\nKewley, L. J., & Ellison, S. L. 2008, ApJ, 681, 1183\nKobulnicky, H. A., & Kewley, L. J. 2004, ApJ, 617, 240\nKocevski, D., & West, A. A. 2011, ApJ, 735, L8\nKozlowski, S., et al. 2010, ApJ, 722, 1624\nKriek, M., van Dokkum, P. G., Labbé, I., Franx, M., Illingworth,\nG. D., Marchesini, D., & Quadri, R. F. 2009, ApJ, 700, 221\nKudritzki, R., & Puls, J. 2000, ARA&A, 38, 613\nLanger, N., Norman, C. A., de Koter, A., Vink, J. S., Cantiello,\nM., & Yoon, S. 2007, A&A, 475, L19\nLara-López, M. A., et al. 2010, A&A, 521, L53+\nLecureur, A., Hill, V., Zoccali, M., Barbuy, B., Gómez, A.,\nMinniti, D., Ortolani, S., & Renzini, A. 2007, A&A, 465, 799\nLeloudas, G., et al. 2011, A&A, 530, A95\nLevesque, E. M., Kewley, L. J., Berger, E., & Jabran Zahid, H.\n2010, AJ, 140, 1557\nLi, W., et al. 2011, MNRAS, 412, 1441\nLópez-Sánchez, Á. R., Dopita, M. A., Kewley, L. J., Zahid, H. J.,\nNicholls, D. C., & Scharwächter, J. 2012, MNRAS, 426, 2630\nMaiolino, R., Vanzi, L., Mannucci, F., Cresci, G., Ghinassi, F., &\nDella Valle, M. 2002, A&A, 389, 84\nMannucci, F., Cresci, G., Maiolino, R., Marconi, A., & Gnerucci,\nA. 2010, MNRAS, 408, 2115\nMannucci, F., Salvaterra, R., & Campisi, M. A. 2011, MNRAS,\n414, 1263\nMannucci, F., et al. 2003, A&A, 401, 519\nMartini, P., et al. 2011, PASP, 123, 187\nMcGaugh, S. S. 1991, ApJ, 380, 140\n\nMcWilliam, A. 1997, ARA&A, 35, 503\nModjaz, M., Filippenko, A. V., Silverman, J. M., Kleiser,\nI. K. W., & Morton, A. J. L. 2010, The Astronomer's\nTelegram, 2503, 1\nModjaz, M., Kewley, L., Bloom, J. S., Filippenko, A. V., Perley,\nD., & Silverman, J. M. 2011, ApJ, 731, L4+\nModjaz, M., et al. 2008, AJ, 135, 1136\nMurphy, J. W., Jennings, Z. G., Williams, B., Dalcanton, J. J., &\nDolphin, A. E. 2011, ApJ, 742, L4\nNeill, J. D., et al. 2009, ApJ, 707, 1449\n-. 2011, ApJ, 727, 15\nNiino, Y. 2011, MNRAS, 417, 567\nOber, W. W., El Eid, M. F., & Fricke, K. J. 1983, A&A, 119, 61\nOkada, Y., Onaka, T., Miyata, T., Okamoto, Y. K., Sakon, I.,\nShibai, H., & Takahashi, H. 2008, ApJ, 682, 416\nPagel, B. E. J., Edmunds, M. G., Blackwell, D. E., Chun, M. S.,\n& Smith, G. 1979, MNRAS, 189, 95\nPauldrach, A., Puls, J., & Kudritzki, R. P. 1986, A&A, 164, 86\nPettini, M., & Pagel, B. E. J. 2004, MNRAS, 348, L59\nPrantzos, N., & Boissier, S. 2003, A&A, 406, 259\nPrieto, J., & Filippenko, A. V. 2010, Central Bureau Electronic\nTelegrams, 2224, 3\nPrieto, J. L., Stanek, K. Z., & Beacom, J. F. 2008, ApJ, 673, 999\nRau, A., et al. 2009, PASP, 121, 1334\nReddy, B. E., Lambert, D. L., & Allende Prieto, C. 2006,\nMNRAS, 367, 1329\nReddy, B. E., Tomkin, J., Lambert, D. L., & Allende Prieto, C.\n2003, MNRAS, 340, 304\nRich, R. M., & Origlia, L. 2005, ApJ, 634, 1293\nRich, R. M., Origlia, L., & Valenti, E. 2007, ApJ, 665, L119\nRodrı́guez, M. 2002, A&A, 389, 556\nSalim, S., et al. 2007, ApJS, 173, 267\nSanders, N. E., et al. 2012, ApJ, 756, 184\nSavaglio, S., et al. 2005, ApJ, 635, 260\nSmartt, S. J. 2009, ARA&A, 47, 63\nStanek, K. Z., et al. 2006, Acta Astron., 56, 333\nStoll, R., Prieto, J. L., Stanek, K. Z., Pogge, R. W., Szczygiel,\nD. M., Pojmański, G., Antognini, J., & Yan, H. 2011, ApJ, 730,\n34\nStoll, R., et al. 2010, in Proc. SPIE, Vol. 7735, 154\nTinsley, B. M. 1979, ApJ, 229, 1046\nTremonti, C. A., et al. 2004, ApJ, 613, 898\nUomoto, A., et al. 1999, in Bulletin of the American\nAstronomical Society, Vol. 31, American Astronomical Society\nMeeting Abstracts, 1501\nVergani, S. D., et al. 2011, A&A, 535, A127\nVink, J. S., & de Koter, A. 2005, A&A, 442, 587\nWright, E. L. 2006, PASP, 118, 1711\nYates, R. M., Kauffmann, G., & Guo, Q. 2012, MNRAS, 422, 215\nYin, S. Y., Liang, Y. C., Hammer, F., Brinchmann, J., Zhang, B.,\nDeng, L. C., & Flores, H. 2007, A&A, 462, 535\nYork, D. G., et al. 2000, AJ, 120, 1579\nYoung, D. R., et al. 2010, A&A, 512, A70\nZaritsky, D., Kennicutt, Jr., R. C., & Huchra, J. P. 1994, ApJ,\n420, 87\n\nTable 1\nObservation properties\nTelescope\nAPO\ndu Pont\nHiltner\nSDSS\n\nInstrument\nDIS\nWFCCD\nOSMOS\nfiber spectrograph\n\nslit width\n(arcsec)\n1.5\n1.7\n1.2\n3 (dia)\n\nruling\n(lines/mm)\n\nλ coverage\n(Å)\n\nresolution\n(Å)\n\nB400/R300 (gratings)\n400 (blue grism)\n704 (grism)\nB640/R440 (grisms)\n\n3500–9800\n3700–9200\n3960–6870\n3800–9200\n\n7\n7\n3\n3\n\n\f17\n\nType II SNe Environment Metallicities\nTable 2\nMeasured host metallicities\n\na\nb\n\nSN Name\n\nz\n\ntype\n\nHα λ6563a\n\n[N II]λ6584a\n\n12+log(O/H)\n(PP04N2)\n\n[Fe/H]\n(8.86)\n\nSN radiusb\n(arcsec)\n\nSN radiusc\n(kpc)\n\nPTF09awk\nPTF09bce\nPTF09bcl\nPTF09bgf\nPTF09cjq\nPTF09cu\nPTF09dah\nPTF09dfk\nPTF09dra\nPTF09due\nPTF09dxv\nPTF09ebq\nPTF09ecm\nPTF09fbf\nPTF09fma\nPTF09fmk\nPTF09fqa\nPTF09fsr\nPTF09g\nPTF09gof\nPTF09iex\nPTF09ige\nPTF09igz\nPTF09ism\nPTF09q\nPTF09r\nPTF09sh\nPTF09sk\nPTF09t\nPTF09tm\nPTF09uj\nPTF10bau\nPTF10bgl\nPTF10bhu\nPTF10bip\nPTF10con\nPTF10cqh\nPTF10cwx\nPTF10cxq\nPTF10cxx\nPTF10czn\nPTF10hv\nPTF10s\n\n0.0620\n0.0230\n0.0620\n0.0310\n0.0190\n0.0570\n0.0238\n0.0160\n0.0770\n0.0290\n0.0330\n0.0235\n0.0285\n0.0210\n0.0310\n0.0631\n0.0300\n0.0079\n0.0400\n0.1030\n0.0200\n0.0640\n0.0860\n0.0290\n0.0900\n0.0270\n0.0377\n0.0355\n0.0390\n0.0350\n0.0651\n0.0260\n0.0300\n0.0360\n0.0510\n0.0330\n0.0410\n0.0730\n0.0470\n0.0340\n0.0450\n0.0518\n0.0510\n\nIb\nII\nII\nII\nII\nII\nIIb\nIb\nII\nII\nIIb\nII\nII\nII\nII\nII\nII\nIb\nII\nII\nII\nII\nII\nII\nIc\nII\nII\nIc-BL\nII\nII\nII\nII\nII\nIc\nIc\nII\nII\nII\nII\nII\nII\nII\nII\n\n717± 3\n117± 3\n117± 9\n643±10\n2982±25\n60± 3\n207± 4\n601± 4\n145± 3\n*** e\n277± 4\n3304±14\n149± 3\n571± 3\n183± 5\n451± 7\n43± 1\n296± 4\n187± 3\n62± 3\n278± 7\n322± 2\n72± 3\n100± 2\n201± 4\n63± 3\n362± 9\n717± 3\n775± 9\n232± 4\n85± 2\n*** e\n*** e\n152± 2\n229± 6\n132± 5\n318± 7\n237± 4\n286± 5\n759± 4\n611±13\n139± 2\n271± 2\n\n126± 3\n45± 4\n50± 8\n38±11\n1107±25\n20± 3\n31± 4\n65± 4\n55± 3\n*** e\n88± 4\n1175±13\n55± 4\n85± 3\n57± 6\n166± 8\n7± 1\n93± 4\n62± 3\n17± 3\n18± 8\n97± 2\n18± 3\n33± 2\n92± 4\n22± 3\n90± 9\n73± 2\n114± 9\n109± 4\n26± 2\n*** e\n*** e\n36± 2\n24± 5\n44± 5\n141± 7\n31± 5\n31± 5\n326± 4\n132±13\n35± 2\n90± 2\n\n8.42±0.03\n8.72±0.10\n8.77±0.21\n8.18±0.34\n8.70±0.03\n8.66±0.20\n8.37±0.15\n8.30±0.07\n8.72±0.07\n8.77±0.05\n8.63±0.06\n8.68±0.01\n8.70±0.08\n8.37±0.04\n8.62±0.13\n8.70±0.06\n8.37±0.22\n8.63±0.06\n8.65±0.06\n8.56±0.20\n8.20±0.56\n8.61±0.02\n8.53±0.19\n8.65±0.08\n8.81±0.06\n8.68±0.18\n8.53±0.12\n8.28±0.04\n8.37±0.10\n8.83±0.04\n8.61±0.10\n8.73±0.04\n8.63±0.06\n8.51±0.08\n8.29±0.25\n8.65±0.14\n8.80±0.06\n8.34±0.19\n8.30±0.20\n8.78±0.02\n8.48±0.12\n8.54±0.06\n8.65±0.03\n\n−0.90\n−0.51\n−0.45\n−1.19\n−0.54\n−0.59\n−0.95\n−1.05\n−0.52\n−0.45\n−0.63\n−0.56\n−0.54\n−0.95\n−0.64\n−0.54\n−0.95\n−0.63\n−0.60\n−0.72\n−1.17\n−0.65\n−0.75\n−0.61\n−0.40\n−0.57\n−0.75\n−1.06\n−0.96\n−0.38\n−0.65\n−0.50\n−0.63\n−0.78\n−1.05\n−0.60\n−0.42\n−0.99\n−1.05\n−0.44\n−0.81\n−0.74\n−0.60\n\n*0.10\n5.93\n*** d\n1.17\n14.24\n9.14\n2.32\n1.25\n*3.63\n9.91\n6.26\n0.69\n5.17\n4.55\n*** d\n3.68\n10.76\n64.61\n*3.83\n1.90\n4.43\n*5.10\n1.69\n*7.47\n*2.88\n0.79\n9.73\n*2.77\n5.84\n*3.64\n*2.72\n6.18\n8.19\n*1.62\n1.24\n1.72\n9.17\n2.56\n1.53\n*1.84\n14.98\n*5.59\n*1.05\n\n0.11\n2.76\n*** d\n0.72\n5.49\n10.10\n1.12\n0.41\n5.29\n5.76\n4.12\n0.33\n2.96\n1.93\n*** d\n4.47\n6.46\n10.55\n3.03\n3.59\n1.79\n6.28\n2.72\n4.34\n4.84\n0.43\n7.27\n1.95\n4.51\n2.53\n3.40\n3.23\n4.92\n1.16\n1.23\n1.13\n7.43\n3.55\n1.41\n1.24\n13.25\n5.65\n1.04\n\n10−17 erg cm−2 s−1 Å−1\nSN radius from the center of the galaxy. Note that all targets are\n\nobserved at the SN location or equivalent galactocentric radius except\nthe 12 targets for which we use archival SDSS spectra (*starred). For\nthese 12 targets, the distance in this column is the distance between\nthe SN location and the fiber center, which is half an arcsecond or less\naway from the center of the galaxy in all cases. Note that for these\nSDSS spectra, most SN locations are within the fiber diameter, and\nonly one is more than 2 fiber diameters away.\nc\nProjected physical radius calculated (Wright 2006) assuming H0 =\n70, Ωm = 0.3, and ΩΛ = 0.7.\nd\nPTF09bcl and PTF09fma are outside the SDSS photometry, so we\ndo not determine the coordinates of their host galaxy centers.\ne\nFor PTF09due, PTF10bau, and PTF10bgl, the metallicity at the\nSN location is approximated by fitting a metallicity gradient to points\nat other galactocentric radii (see Table 3 for line fluxes and locations)\nand extrapolating or interpolating the metallicity at the radius of the\nSN.\n\nSource\nSDSS\nOSMOS\nAPO\nduPont\nAPO\nAPO\nduPont\nduPont\nSDSS\nAPOgrad\nduPont\nduPont\nduPont\nduPont\nduPont\nduPont\nduPont\nduPont\nSDSS\nduPont\nduPont\nSDSS\nAPO\nSDSS\nSDSS\nOSMOS\nAPO\nSDSS\nduPont\nSDSS\nSDSS\ngrad\nOSMgrad\nSDSS\nduPont\nduPont\nduPont\nduPont\nduPont\nSDSS\nduPont\nSDSS\nSDSS\n\n\f18\n\nStoll et al.\nTable 3\nMeasured line fluxes and metallicities at non-supernova locations within the\ngalaxy\n\na\nb\n\nSN Name\n\nSource\n\nPTF09due\nPTF09due\nPTF10bau\nPTF10bau\nPTF10bau\nPTF10bau\nPTF10bau\nPTF10bau\nPTF10bau\nPTF10bgl\nPTF10bgl\nPTF10bgl\nPTF10bgl\nPTF10bgl\n\nAPO\nAPO\nSDSS\nOSMOS\nOSMOS\nSDSS\nOSMOS\nOSMOS\nOSMOS\nOSMOS\nOSMOS\nOSMOS\nOSMOS\nOSMOS\n\nGalactocentric radius of the spectrum\n10−17 erg cm−2 s−1 Å−1\n\nRadiusa\n(arcsec)\n\nHα λ6563b\n\n[N II]λ6584b\n\n12+log(O/H)\n(PP04N2)\n\n13.0\n25.0\n0.0\n3.1\n4.8\n10.5\n10.6\n12.9\n19.8\n1.5\n5.9\n9.1\n13.7\n21.9\n\n276.0±1.9\n202.2±1.6\n988.5±6.9\n522.3±1.8\n314.7±2.1\n565.2±1.9\n122.8±1.8\n152.7±1.6\n35.9±1.2\n268.9±4.4\n164.3±3.1\n394.4±2.9\n851.3±3.0\n68.7±2.6\n\n105.2±2.0\n46.6±1.5\n379.5±7.3\n209.8±2.4\n124.8±2.3\n215.7±2.0\n57.1±1.9\n60.9±1.6\n6.6±0.7\n107.7±4.7\n61.8±3.4\n116.3±3.1\n218.5±3.2\n21.8±2.5\n\n8.72±0.02\n8.51±0.04\n8.72±0.02\n8.74±0.01\n8.74±0.02\n8.72±0.01\n8.82±0.04\n8.74±0.03\n8.43±0.14\n8.74±0.06\n8.71±0.07\n8.60±0.03\n8.54±0.02\n8.63±0.14\n\n\f19\n\nType II SNe Environment Metallicities\nTable 4\nHost properties measured from SDSS photometry\nSN\n(PTF)\n\nGal RA\n(J2000.0)\n\nGal Dec\n(J2000.0)\n\nfu a\n(Jy)\n\nfg a\n(Jy)\n\nfr a\n(Jy)\n\nfi a\n(Jy)\n\nfz a\n(Jy)\n\n09aux\n09awk\n09axc\n09axi\n09bce\n09bgf\n09bw\n09cjq\n09ct\n09cu\n09cvi\n09dah\n09dfk\n09djl\n09dra\n09due\n09dxv\n09dzt\n09ebq\n09ecm\n09ejz\n09fae\n09fbf\n09fmk\n09foy\n09fqa\n09fsr\n09g\n09gof\n09gtt\n09hdo\n09hzg\n09iex\n09ige\n09igz\n09ism\n09ps\n09q\n09r\n09sh\n09sk\n09t\n09tm\n09uj\n10bau\n10bfz\n10bgl\n10bhu\n10bip\n10bzf\n10cd\n10con\n10cqh\n10cwx\n10cxq\n10cxx\n10czn\n10dk\n10dvb\n10hv\n10in\n10s\n10ts\n10u\n\n16:09:15.851\n13:37:56.354\n14:53:13.066\n14:12:40.942\n16:35:18.117\n14:41:38.351\n15:05:02.037\n21:16:27.580\n11:42:13.837\n13:15:23.892\n21:47:09.984\n22:45:17.115\n23:09:13.471\n16:33:55.969\n15:48:11.297\n16:26:53.240\n23:08:34.828\n16:03:03.823\n00:14:01.743\n01:06:43.123\n00:55:07.230\n17:26:20.127\n21:20:38.208\n23:57:46.435\n23:17:10.983\n22:25:33.064\n23:04:56.569\n15:16:31.418\n01:22:25.476\n02:20:37.291\n00:15:22.815\n11:50:56.789\n12:02:46.955\n08:55:34.126\n08:53:56.582\n11:44:35.370\n16:14:08.619\n12:24:50.022\n14:18:58.607\n16:13:58.581\n13:30:51.179\n14:15:42.905\n13:46:55.509\n14:20:10.883\n09:16:21.696\n12:54:41.278\n10:19:05.166\n12:55:28.353\n12:34:10.493\n11:44:02.964\n03:00:33.086\n16:11:39.154\n16:10:36.992\n12:33:16.405\n13:48:19.317\n14:47:27.701\n14:51:17.242\n05:08:21.597\n17:16:10.672\n14:03:56.535\n07:50:00.984\n10:37:16.292\n12:33:55.888\n10:09:58.780\n\n+29:17:37.09\n+22:55:04.82\n+22:14:32.22\n+31:04:03.51\n+55:38:03.60\n+19:21:43.21\n+48:40:03.22\n-00:49:35.16\n+10:38:53.86\n+46:25:13.40\n+08:18:35.58\n+21:49:17.34\n+07:48:16.39\n+30:14:16.65\n+41:13:31.76\n+51:33:18.35\n+18:56:19.80\n+21:01:47.28\n+29:25:58.47\n-06:22:46.04\n-06:57:04.82\n+72:56:28.74\n+01:02:49.97\n+11:58:44.53\n+17:15:04.12\n+18:59:44.12\n+12:19:21.47\n+54:27:31.04\n+03:38:08.80\n+02:24:24.30\n+30:43:16.29\n+21:11:50.06\n+02:24:02.61\n+32:40:01.34\n+33:40:10.68\n+10:12:46.55\n+55:41:41.78\n+08:26:01.27\n+35:23:15.26\n+39:31:50.29\n+30:20:02.22\n+16:12:00.93\n+61:33:17.33\n+53:33:42.11\n+17:43:38.08\n+15:24:16.42\n+46:27:16.67\n+53:34:30.63\n+08:21:49.67\n+55:41:22.55\n+36:15:25.02\n+00:52:31.87\n-01:43:01.65\n-00:03:12.34\n+13:28:57.27\n+01:55:05.28\n+15:26:46.79\n+00:12:42.28\n+31:47:32.32\n+54:27:27.21\n+33:06:27.99\n+38:06:23.57\n+13:55:08.31\n+46:00:33.68\n\n1.42E-04±8.5E-06\n8.41E-05±5.4E-06\n2.51E-05±3.0E-06\n3.67E-05±6.1E-06\n1.02E-03±5.2E-05\n5.69E-05±5.3E-06\n1.85E-06±1.8E-06\n2.97E-03±1.5E-04\n1.03E-05±2.5E-06\n3.85E-04±2.0E-05\n-1.11E-06±1.2E-06\n1.80E-04±1.3E-05\n1.28E-04±7.9E-06\n4.05E-06±2.1E-06\n2.40E-04±1.5E-05\n2.35E-03±1.2E-04\n3.99E-04±2.6E-05\n9.55E-05±9.2E-06\n5.79E-04±2.9E-05\n3.60E-04±2.4E-05\n5.63E-05±8.0E-06\n2.23E-05±3.3E-06\n1.59E-03±8.1E-05\n1.65E-04±1.3E-05\n1.99E-04±1.5E-05\n4.48E-04±2.7E-05\n1.61E-02±7.8E-04\n4.12E-04±2.1E-05\n7.57E-05±8.2E-06\n4.74E-05±9.5E-06\n4.55E-04±2.4E-05\n3.64E-04±2.1E-05\n8.43E-05±9.2E-06\n1.39E-04±8.1E-06\n3.04E-05±4.1E-06\n1.98E-04±1.5E-05\n2.18E-05±3.0E-06\n1.49E-04±1.1E-05\n4.01E-05±4.0E-06\n6.53E-04±3.6E-05\n1.15E-04±6.7E-06\n5.39E-04±2.8E-05\n4.21E-04±2.1E-05\n1.14E-04±8.0E-06\n2.47E-03±1.2E-04\n1.80E-06±1.1E-06\n3.40E-03±1.6E-04\n2.17E-04±1.3E-05\n2.75E-05±3.5E-06\n3.89E-05±4.7E-06\n2.11E-05±5.1E-06\n2.36E-04±2.2E-05\n5.53E-04±2.9E-05\n4.72E-05±4.0E-06\n1.03E-04±6.6E-06\n2.79E-04±1.5E-05\n8.36E-04±4.4E-05\n1.11E-06±2.0E-06\n1.81E-03±8.8E-05\n1.51E-04±1.0E-05\n2.64E-06±1.8E-06\n8.95E-05±6.5E-06\n1.70E-04±1.0E-05\n6.48E-07±1.1E-06\n\n5.87E-04±1.2E-05\n1.96E-04±4.2E-06\n9.85E-05±2.2E-06\n1.09E-04±2.9E-06\n4.05E-03±8.3E-05\n1.29E-04±3.1E-06\n1.35E-05±1.1E-06\n1.05E-02±2.1E-04\n2.68E-05±1.2E-06\n1.05E-03±2.2E-05\n4.06E-06±4.3E-07\n3.79E-04±8.2E-06\n3.53E-04±7.5E-06\n1.76E-05±8.0E-07\n5.98E-04±1.3E-05\n6.12E-03±1.3E-04\n1.17E-03±2.4E-05\n2.00E-04±4.9E-06\n1.44E-03±2.9E-05\n1.08E-03±2.3E-05\n1.86E-04±4.4E-06\n3.59E-05±1.3E-06\n4.36E-03±9.0E-05\n4.44E-04±9.6E-06\n5.79E-04±1.2E-05\n1.30E-03±2.7E-05\n6.23E-02±1.3E-03\n9.85E-04±2.0E-05\n1.91E-04±4.5E-06\n1.39E-04±4.0E-06\n1.59E-03±3.3E-05\n1.38E-03±2.9E-05\n1.59E-04±4.6E-06\n3.49E-04±7.4E-06\n7.07E-05±2.0E-06\n4.85E-04±1.1E-05\n4.35E-05±1.2E-06\n4.47E-04±9.6E-06\n1.37E-04±3.1E-06\n1.46E-03±3.0E-05\n2.52E-04±5.6E-06\n1.24E-03±2.5E-05\n1.41E-03±2.9E-05\n2.86E-04±6.3E-06\n6.20E-03±1.3E-04\n4.07E-06±4.7E-07\n8.80E-03±1.8E-04\n5.53E-04±1.2E-05\n9.00E-05±2.2E-06\n5.33E-05±2.1E-06\n5.21E-05±2.1E-06\n6.06E-04±1.4E-05\n1.98E-03±4.1E-05\n9.72E-05±2.6E-06\n2.23E-04±4.9E-06\n9.62E-04±2.0E-05\n2.63E-03±5.4E-05\n5.16E-06±6.5E-07\n4.49E-03±9.2E-05\n4.23E-04±9.2E-06\n7.66E-06±7.3E-07\n2.37E-04±5.1E-06\n4.53E-04±9.9E-06\n1.62E-06±4.8E-07\n\n1.15E-03±2.3E-05\n2.72E-04±5.8E-06\n1.88E-04±4.0E-06\n1.79E-04±4.9E-06\n8.23E-03±1.7E-04\n1.65E-04±4.2E-06\n2.80E-05±1.5E-06\n2.10E-02±4.2E-04\n5.51E-05±2.2E-06\n1.77E-03±3.6E-05\n4.63E-06±6.9E-07\n5.11E-04±1.2E-05\n5.40E-04±1.1E-05\n4.63E-05±1.4E-06\n9.95E-04±2.1E-05\n9.42E-03±1.9E-04\n1.94E-03±4.0E-05\n3.32E-04±8.7E-06\n2.40E-03±4.8E-05\n1.83E-03±3.8E-05\n4.32E-04±9.5E-06\n3.76E-05±1.9E-06\n6.76E-03±1.4E-04\n7.74E-04±1.7E-05\n9.82E-04±2.1E-05\n2.11E-03±4.4E-05\n1.24E-01±2.5E-03\n1.40E-03±2.9E-05\n3.21E-04±7.5E-06\n1.78E-04±5.9E-06\n3.17E-03±6.4E-05\n2.97E-03±6.0E-05\n1.94E-04±6.7E-06\n4.98E-04±1.1E-05\n1.04E-04±3.4E-06\n7.06E-04±1.6E-05\n6.19E-05±1.8E-06\n8.69E-04±1.8E-05\n2.54E-04±5.5E-06\n2.34E-03±4.8E-05\n3.19E-04±6.9E-06\n1.67E-03±3.4E-05\n2.68E-03±5.4E-05\n4.33E-04±9.5E-06\n1.02E-02±2.0E-04\n6.37E-06±7.6E-07\n1.27E-02±2.6E-04\n8.10E-04±1.7E-05\n1.16E-04±3.0E-06\n8.66E-05±3.0E-06\n9.28E-05±3.7E-06\n1.61E-03±3.5E-05\n3.91E-03±7.9E-05\n1.23E-04±3.7E-06\n2.77E-04±6.4E-06\n1.81E-03±3.7E-05\n4.19E-03±8.5E-05\n9.23E-06±1.1E-06\n7.00E-03±1.4E-04\n5.92E-04±1.3E-05\n9.70E-06±1.3E-06\n3.67E-04±7.9E-06\n7.26E-04±1.5E-05\n6.87E-06±7.7E-07\n\n1.57E-03±3.2E-05\n3.58E-04±7.9E-06\n2.40E-04±5.3E-06\n1.90E-04±6.4E-06\n1.20E-02±2.4E-04\n1.89E-04±5.8E-06\n3.52E-05±2.5E-06\n2.96E-02±6.0E-04\n7.46E-05±3.5E-06\n2.38E-03±4.9E-05\n4.97E-06±1.1E-06\n6.63E-04±1.6E-05\n6.87E-04±1.5E-05\n5.80E-05±2.2E-06\n1.34E-03±2.9E-05\n1.17E-02±2.4E-04\n2.77E-03±5.9E-05\n4.26E-04±1.3E-05\n3.15E-03±6.5E-05\n2.26E-03±4.8E-05\n6.28E-04±1.4E-05\n4.74E-05±2.9E-06\n8.65E-03±1.8E-04\n1.21E-03±2.7E-05\n1.34E-03±2.9E-05\n2.71E-03±5.7E-05\n1.73E-01±3.5E-03\n1.66E-03±3.4E-05\n3.74E-04±1.0E-05\n2.73E-04±9.8E-06\n4.60E-03±9.4E-05\n4.45E-03±9.1E-05\n2.28E-04±1.0E-05\n6.26E-04±1.4E-05\n1.29E-04±5.0E-06\n8.73E-04±2.2E-05\n7.92E-05±2.6E-06\n1.24E-03±2.6E-05\n3.32E-04±7.6E-06\n3.04E-03±6.4E-05\n3.87E-04±9.1E-06\n1.99E-03±4.2E-05\n3.76E-03±7.7E-05\n5.28E-04±1.2E-05\n1.28E-02±2.6E-04\n4.20E-06±1.4E-06\n1.57E-02±3.2E-04\n9.83E-04±2.2E-05\n1.46E-04±4.1E-06\n1.09E-04±4.5E-06\n8.22E-05±5.4E-06\n3.58E-03±7.5E-05\n5.67E-03±1.2E-04\n1.60E-04±5.3E-06\n3.22E-04±8.3E-06\n2.48E-03±5.1E-05\n5.38E-03±1.1E-04\n9.73E-06±1.7E-06\n8.64E-03±1.8E-04\n7.55E-04±1.7E-05\n1.63E-05±1.8E-06\n4.55E-04±1.0E-05\n9.44E-04±2.1E-05\n9.58E-06±1.3E-06\n\n1.99E-03±6.3E-05\n3.89E-04±1.6E-05\n2.78E-04±1.4E-05\n1.74E-04±1.9E-05\n1.55E-02±4.7E-04\n2.08E-04±1.6E-05\n3.54E-05±7.6E-06\n3.93E-02±1.2E-03\n9.48E-05±1.1E-05\n2.83E-03±9.3E-05\n9.74E-06±3.9E-06\n7.64E-04±4.0E-05\n8.28E-04±3.2E-05\n8.44E-05±9.8E-06\n1.63E-03±5.9E-05\n1.41E-02±4.3E-04\n3.55E-03±1.3E-04\n5.39E-04±4.2E-05\n4.01E-03±1.3E-04\n2.86E-03±1.0E-04\n8.24E-04±3.4E-05\n8.00E-05±1.1E-05\n1.06E-02±3.3E-04\n1.40E-03±6.1E-05\n1.50E-03±6.9E-05\n3.16E-03±1.1E-04\n2.13E-01±6.5E-03\n1.87E-03±6.7E-05\n4.07E-04±2.8E-05\n2.85E-04±4.0E-05\n6.01E-03±1.9E-04\n6.25E-03±1.9E-04\n3.01E-04±3.9E-05\n6.35E-04±2.7E-05\n1.42E-04±1.6E-05\n9.28E-04±6.2E-05\n6.72E-05±1.1E-05\n1.51E-03±5.2E-05\n3.98E-04±1.9E-05\n2.83E-03±1.2E-04\n4.14E-04±1.9E-05\n2.14E-03±7.8E-05\n4.84E-03±1.5E-04\n5.38E-04±2.8E-05\n1.56E-02±4.8E-04\n1.20E-06±5.1E-06\n1.77E-02±5.4E-04\n1.17E-03±4.5E-05\n1.74E-04±1.2E-05\n1.37E-04±1.6E-05\n1.02E-04±1.9E-05\n2.85E-03±1.1E-04\n7.45E-03±2.3E-04\n1.73E-04±1.7E-05\n3.25E-04±2.1E-05\n3.31E-03±1.1E-04\n6.08E-03±2.0E-04\n9.92E-06±7.6E-06\n1.06E-02±3.2E-04\n8.11E-04±3.7E-05\n1.16E-05±6.3E-06\n5.21E-04±2.1E-05\n1.06E-03±4.8E-05\n1.43E-05±4.4E-06\n\na\n\n3σ upper limits for the fluxes of PTF09be and PTF09gyp are calcu√\nlated as 3σsky πr 2 , where r is set to 5 kpc (projected) at the distance\nof the supernova.\n\n\f20\n\nStoll et al.\nTable 5\nHost properties derived from SDSS photometry\n\na\nb\n\nSN\n(PTF)\n\ntype\n\nSN RA\n(J2000.0)\n\nSN Dec\n(J2000.0)\n\nz\n\nμa\n\nMu b\n\nMg b\n\nMr b\n\nMi b\n\nMz b\n\nMB b\n\n09aux\n09awk\n09axc\n09axi\n09bce\n09bgf\n09bw\n09cjq\n09ct\n09cu\n09cvi\n09dah\n09dfk\n09djl\n09dra\n09due\n09dxv\n09dzt\n09ebq\n09ecm\n09ejz\n09fae\n09fbf\n09fmk\n09foy\n09fqa\n09fsr\n09g\n09gof\n09gtt\n09hdo\n09hzg\n09iex\n09ige\n09igz\n09ism\n09ps\n09q\n09r\n09sh\n09sk\n09t\n09tm\n09uj\n10bau\n10bfz\n10bgl\n10bhu\n10bip\n10bzf\n10cd\n10con\n10cqh\n10cwx\n10cxq\n10cxx\n10czn\n10dk\n10dvb\n10hv\n10in\n10s\n10ts\n10u\n\nIc/Ia\nIb\nII\nII\nII\nII\nII\nII\nII\nII\nII\nIIb\nIb\nII\nII\nII\nIIb\nIc\nII\nII\nIc/Ia\nIIb\nII\nII\nII\nII\nIb\nII\nII\nII\nII\nII\nII\nII\nII\nII\nIc\nIc\nII\nII\nIc-BL\nII\nII\nII\nII\nIc-BL\nII\nIc\nIc\nIc-BL\nII\nII\nII\nII\nII\nII\nII\nII\nII\nII\nIIb\nII\nII\nII\n\n16:09:15.84\n13:37:56.36\n14:53:13.06\n14:12:40.82\n16:35:17.66\n14:41:38.28\n15:05:02.04\n21:16:28.48\n11:42:13.80\n13:15:23.14\n21:47:09.80\n22:45:17.05\n23:09:13.42\n16:33:55.94\n15:48:11.47\n16:26:52.36\n23:08:34.73\n16:03:04.20\n00:14:01.69\n01:06:43.16\n00:55:07.29\n17:26:20.33\n21:20:38.44\n23:57:46.19\n23:17:10.58\n22:25:32.33\n23:04:52.98\n15:16:31.48\n01:22:25.60\n02:20:37.70\n00:15:23.20\n11:50:57.74\n12:02:46.86\n08:55:34.24\n08:53:56.70\n11:44:35.87\n16:14:08.62\n12:24:50.11\n14:18:58.63\n16:13:58.08\n13:30:51.15\n14:15:43.29\n13:46:55.94\n14:20:11.15\n09:16:21.29\n12:54:41.27\n10:19:04.70\n12:55:28.44\n12:34:10.52\n11:44:02.99\n03:00:32.93\n16:11:39.09\n16:10:37.60\n12:33:16.53\n13:48:19.32\n14:47:27.78\n14:51:16.23\n05:08:21.54\n17:16:12.25\n14:03:56.18\n07:50:01.24\n10:37:16.30\n12:33:56.40\n10:09:58.42\n\n+29:17:36.7\n+22:55:04.8\n+22:14:32.2\n+31:04:03.3\n+55:37:59.1\n+19:21:43.8\n+48:40:01.9\n-00:49:39.7\n+10:38:53.9\n+46:25:08.6\n+08:18:35.6\n+21:49:15.2\n+07:48:15.4\n+30:14:16.3\n+41:13:28.2\n+51:33:23.9\n+18:56:13.7\n+21:01:47.2\n+29:25:58.5\n-06:22:40.9\n-06:57:05.4\n+72:56:30.6\n+01:02:52.9\n+11:58:45.3\n+17:15:03.2\n+18:59:41.4\n+12:19:59.0\n+54:27:34.7\n+03:38:08.4\n+02:24:13.2\n+30:43:19.3\n+21:11:49.4\n+02:24:06.8\n+32:39:57.0\n+33:40:11.5\n+10:12:43.7\n+55:41:41.4\n+08:25:58.8\n+35:23:16.0\n+39:31:58.1\n+30:20:04.9\n+16:11:59.1\n+61:33:15.6\n+53:33:41.0\n+17:43:40.2\n+15:24:17.0\n+46:27:23.3\n+53:34:28.7\n+08:21:48.5\n+55:41:27.6\n+36:15:25.4\n+00:52:33.3\n-01:43:00.7\n-00:03:10.6\n+13:28:58.8\n+01:55:03.8\n+15:26:43.6\n+00:12:42.9\n+31:47:36.0\n+54:27:31.1\n+33:06:23.8\n+38:06:23.2\n+13:55:08.3\n+46:00:35.2\n\n0.047\n0.062\n0.115\n0.064\n0.023\n0.031\n0.150\n0.019\n0.150\n0.057\n0.030\n0.024\n0.016\n0.184\n0.077\n0.029\n0.033\n0.087\n0.024\n0.029\n0.110\n0.067\n0.021\n0.063\n0.060\n0.030\n0.008\n0.040\n0.103\n0.041\n0.047\n0.028\n0.020\n0.064\n0.086\n0.029\n0.106\n0.090\n0.027\n0.038\n0.035\n0.039\n0.035\n0.065\n0.026\n0.150\n0.030\n0.036\n0.051\n0.050\n0.045\n0.033\n0.041\n0.073\n0.047\n0.034\n0.045\n0.074\n0.023\n0.052\n0.070\n0.051\n0.046\n0.150\n\n36.60\n37.22\n38.64\n37.29\n35.01\n35.67\n39.27\n34.58\n39.27\n37.03\n35.59\n35.08\n34.21\n39.75\n37.71\n35.52\n35.81\n38.00\n35.05\n35.48\n38.54\n37.40\n34.80\n37.26\n37.15\n35.59\n32.67\n36.23\n38.38\n36.29\n36.60\n35.44\n34.70\n37.29\n37.97\n35.52\n38.46\n38.07\n35.36\n36.10\n35.97\n36.18\n35.94\n37.33\n35.28\n39.27\n35.59\n36.00\n36.78\n36.73\n36.52\n35.81\n36.29\n37.59\n36.60\n35.87\n36.50\n37.62\n35.00\n36.81\n37.50\n36.78\n36.55\n39.27\n\n−18.43\n−18.37\n−18.70\n−17.55\n−18.76\n−16.39\n−16.47\n−19.76\n−18.35\n−19.80\n99.99\n−17.17\n−15.90\n−17.92\n−19.98\n−20.23\n−19.38\n−19.62\n−18.32\n−18.82\n−19.72\n−17.07\n−19.36\n−19.49\n−19.39\n−18.66\n−19.89\n−19.07\n−19.56\n−16.92\n−19.83\n−18.21\n−15.79\n−19.07\n−18.09\n−17.82\n−18.09\n−19.92\n−15.63\n−19.36\n−17.38\n−19.30\n−18.78\n−18.80\n−20.08\n−16.29\n−20.67\n−18.12\n−16.72\n−16.81\n−17.11\n−18.55\n−20.13\n−18.12\n−17.96\n−18.40\n−20.23\n−14.43\n−19.50\n−18.56\n−15.08\n−18.00\n−18.52\n−15.69\n\n−19.85\n−19.18\n−20.07\n−18.60\n−20.22\n−17.15\n−18.58\n−21.03\n−19.38\n−20.82\n−13.51\n−17.85\n−16.89\n−19.52\n−20.93\n−21.18\n−20.24\n−20.30\n−19.23\n−19.74\n−20.92\n−17.52\n−20.30\n−20.40\n−20.41\n−19.69\n−21.19\n−19.90\n−20.43\n−17.92\n−21.06\n−19.62\n−16.40\n−19.91\n−18.89\n−18.62\n−18.79\n−21.07\n−16.90\n−20.18\n−18.13\n−20.08\n−20.05\n−19.68\n−21.00\n−17.09\n−21.62\n−19.03\n−17.87\n−17.21\n−17.71\n−19.41\n−21.25\n−18.79\n−18.67\n−19.65\n−21.33\n−15.89\n−20.40\n−19.56\n−16.08\n−18.94\n−19.47\n−16.48\n\n−20.49\n−19.50\n−20.59\n−19.07\n−20.95\n−17.38\n−19.11\n−21.70\n−19.90\n−21.33\n−13.56\n−18.12\n−17.29\n−20.20\n−21.41\n−21.62\n−20.61\n−20.72\n−19.74\n−20.15\n−21.59\n−17.59\n−20.69\n−20.95\n−20.89\n−20.15\n−21.81\n−20.25\n−20.85\n−18.14\n−21.69\n−20.37\n−16.60\n−20.22\n−19.21\n−18.95\n−19.11\n−21.67\n−17.53\n−20.68\n−18.36\n−20.38\n−20.69\n−20.07\n−21.50\n−17.34\n−22.00\n−19.42\n−18.10\n−17.77\n−18.13\n−20.35\n−21.81\n−19.05\n−18.86\n−20.26\n−21.78\n−16.37\n−20.83\n−19.88\n−16.27\n−19.36\n−19.92\n−17.68\n\n−20.79\n−19.72\n−20.80\n−19.11\n−21.34\n−17.50\n−19.32\n−22.01\n−20.17\n−21.61\n−13.58\n−18.35\n−17.51\n−20.39\n−21.68\n−21.83\n−20.86\n−20.85\n−19.99\n−20.27\n−21.88\n−17.68\n−20.90\n−21.24\n−21.16\n−20.38\n−22.09\n−20.41\n−20.97\n−18.56\n−22.02\n−20.77\n−16.74\n−20.43\n−19.38\n−19.12\n−19.25\n−21.98\n−17.80\n−20.92\n−18.55\n−20.54\n−21.03\n−20.25\n−21.71\n−16.87\n−22.20\n−19.60\n−18.32\n−17.94\n−17.81\n−21.07\n−22.09\n−19.18\n−18.98\n−20.56\n−22.00\n−16.35\n−21.02\n−20.12\n−16.73\n−19.56\n−20.16\n−17.96\n\n−21.03\n−19.84\n−20.94\n−19.02\n−21.62\n−17.59\n−19.32\n−22.29\n−20.42\n−21.81\n−14.27\n−18.48\n−17.68\n−20.79\n−21.91\n−22.03\n−21.04\n−21.09\n−20.23\n−20.45\n−22.13\n−18.29\n−21.08\n−21.41\n−21.28\n−20.52\n−22.25\n−20.54\n−21.06\n−18.59\n−22.29\n−21.12\n−17.03\n−20.44\n−19.49\n−19.15\n−19.14\n−22.21\n−18.00\n−20.86\n−18.62\n−20.63\n−21.30\n−20.28\n−21.92\n−15.52\n−22.33\n−19.79\n−18.51\n−18.22\n−17.94\n−20.77\n−22.31\n−19.32\n−18.99\n−20.86\n−22.13\n−16.34\n−21.22\n−20.21\n−16.36\n−19.71\n−20.28\n−18.38\n\n−19.48\n−18.90\n−19.75\n−18.35\n−19.85\n−16.91\n−18.25\n−20.67\n−19.07\n−20.51\n−13.18\n−17.60\n−16.60\n−19.20\n−20.63\n−20.90\n−19.97\n−20.05\n−18.93\n−19.47\n−20.57\n−17.29\n−20.02\n−20.08\n−20.11\n−19.39\n−20.84\n−19.65\n−20.18\n−17.62\n−20.71\n−19.25\n−16.16\n−19.66\n−18.63\n−18.37\n−18.54\n−20.73\n−16.57\n−19.92\n−17.88\n−19.84\n−19.69\n−19.42\n−20.71\n−16.82\n−21.34\n−18.75\n−17.56\n−16.97\n−17.51\n−19.08\n−20.93\n−18.53\n−18.43\n−19.30\n−21.02\n−15.63\n−20.11\n−19.27\n−15.80\n−18.66\n−19.18\n−16.38\n\nAssuming H0 = 70, Ωm = 0.3, and ΩΛ = 0.7\nMagnitudes are corrected for galactic extinction but not intrinsic\n\nextinction.\n\n\f21\n\nType II SNe Environment Metallicities\nTable 6\nHost galaxy properties fit from SDSS photometry\nSN Name\n\ntype\n\nM\nlog M⊙\n\nSFR (FAST)\nlog M⊙ /yr\n\nSFR (u)\nlog M⊙ /yr\n\nPTF09aux\nPTF09awk\nPTF09axc\nPTF09axi\nPTF09bce\nPTF09bgf\nPTF09bw\nPTF09cjq\nPTF09ct\nPTF09cu\nPTF09cvi\nPTF09dah\nPTF09dfk\nPTF09djl\nPTF09dra\nPTF09due\nPTF09dxv\nPTF09dzt\nPTF09ebq\nPTF09ecm\nPTF09ejz\nPTF09fae\nPTF09fbf\nPTF09fmk\nPTF09foy\nPTF09fqa\nPTF09fsr\nPTF09g\nPTF09gof\nPTF09gtt\nPTF09hdo\nPTF09hzg\nPTF09iex\nPTF09ige\nPTF09igz\nPTF09ism\nPTF09ps\nPTF09q\nPTF09r\nPTF09sh\nPTF09sk\nPTF09t\nPTF09tm\nPTF09uj\nPTF10bau\nPTF10bfz\nPTF10bgl\nPTF10bhu\nPTF10bip\nPTF10bzf\nPTF10cd\nPTF10con\nPTF10cqh\nPTF10cwx\nPTF10cxq\nPTF10cxx\nPTF10czn\n\nIc/Ia\nIb\nII\nII\nII\nII\nII\nII\nII\nII\nII\nIIb\nIb\nII\nII\nII\nIIb\nIc\nII\nII\nIc/Ia\nIIb\nII\nII\nII\nII\nIb\nII\nII\nII\nII\nII\nII\nII\nII\nII\nIc\nIc\nII\nII\nIc-BL\nII\nII\nII\nII\nIc-BL\nII\nIc\nIc\nIc-BL\nII\nII\nII\nII\nII\nII\nII\n\n10.43+0.03\n−0.07\n9.45+0.18\n−0.14\n10.33+0.01\n−0.09\n9.35+0.09\n−0.04\n10.68+0.08\n−0.09\n8.59+0.06\n−0.19\n9.75+0.02\n−0.15\n10.84+0.05\n−0.14\n10.00+0.10\n−0.19\n10.48+0.09\n−0.19\n7.07+0.17\n−0.15\n8.50+0.38\n−0.13\n8.77+0.07\n−0.14\n10.22+0.09\n−0.06\n10.34+0.22\n−0.14\n10.51+0.07\n−0.18\n9.93+0.19\n−0.11\n9.48+0.36\n−0.10\n9.59+0.24\n−0.15\n9.83+0.06\n−0.09\n10.79+0.05\n−0.08\n8.03+0.23\n−0.13\n10.08+0.10\n−0.13\n10.12+0.23\n−0.16\n10.30+0.07\n−0.11\n9.97+0.07\n−0.10\n10.85+0.03\n−0.02\n9.85+0.05\n−0.16\n10.17+0.03\n−0.10\n9.03+0.13\n−0.20\n10.80+0.07\n−0.14\n10.42+0.09\n−0.19\n8.00+0.21\n−0.41\n9.83+0.04\n−0.09\n9.45+0.10\n−0.58\n9.26+0.09\n−0.14\n8.86+0.54\n−0.11\n10.77+0.05\n−0.14\n9.14+0.05\n−0.09\n10.05+0.08\n−0.07\n8.99+0.08\n−0.42\n9.83+0.08\n−0.14\n10.42+0.08\n−0.15\n9.79+0.08\n−0.05\n10.47+0.07\n−0.24\n8.34+0.20\n−0.53\n10.61+0.07\n−0.11\n9.59+0.07\n−0.18\n9.01+0.13\n−0.08\n8.23+0.25\n−0.07\n8.61+0.10\n−0.32\n10.29+0.07\n−0.49\n10.76+0.06\n−0.15\n9.10+0.17\n−0.41\n9.10+0.09\n−0.12\n10.22+0.08\n−0.14\n10.63+0.07\n−0.07\n\n−0.59+0.43\n−0.00\n0.61+0.35\n−0.75\n−0.25+0.33\n−0.00\n−0.33+0.03\n−0.16\n0.11+0.83\n−0.95\n−0.88+0.74\n−0.00\n−0.83+0.34\n−0.00\n0.62+0.98\n−0.37\n−0.22+1.46\n−0.27\n0.81+0.89\n−0.51\n< −2.06+0.38\n−0.42\n1.70+0.02\n−1.72\n−0.91+0.72\n−0.24\n−0.35+0.06\n−0.36\n1.62+0.32\n−1.28\n0.83+0.82\n−0.25\n1.20+0.26\n−1.01\n2.58+0.13\n−1.24\n0.99+0.30\n−1.11\n0.15+0.50\n−0.19\n0.22+0.85\n−0.06\n0.56+0.33\n−0.41\n0.61+0.63\n−0.40\n1.52+0.31\n−1.14\n0.38+0.70\n−0.26\n0.05+0.56\n−0.23\n0.27+0.03\n−0.02\n0.17+0.82\n−0.02\n0.25+0.40\n−0.00\n0.18+0.43\n−0.73\n0.88+0.83\n−0.65\n0.50+1.02\n−0.65\n−0.27+1.67\n−0.53\n0.15+0.50\n−0.01\n−0.23+2.35\n−0.15\n−0.21+0.65\n−0.15\n2.06+0.15\n−2.37\n0.55+1.00\n−0.35\n−1.44+0.82\n−0.03\n0.37+0.35\n−0.18\n−0.30+2.10\n−0.17\n0.36+0.64\n−0.15\n0.50+0.83\n−0.66\n0.12+0.21\n−0.17\n0.79+0.99\n−0.25\n−0.79+3.08\n−0.14\n0.93+0.62\n−0.20\n−0.09+0.82\n−0.21\n−0.12+0.24\n−0.69\n1.14+0.29\n−0.58\n−0.52+2.17\n−0.08\n0.36+1.42\n−0.62\n0.83+0.83\n−0.31\n0.61+1.59\n−0.83\n−0.18+0.56\n−0.11\n0.30+0.82\n−0.66\n0.71+0.40\n−0.24\n\n−0.06\n0.44\n0.04\n−0.31\n0.36\n−0.80\n−0.77\n0.71\n−0.00\n0.77\n−1.63\n0.83\n−0.80\n−0.16\n1.33\n0.79\n0.95\n1.70\n0.74\n0.18\n0.50\n0.06\n0.54\n1.22\n0.44\n0.12\n0.50\n0.19\n0.35\n0.03\n0.87\n0.51\n−0.48\n0.18\n−0.14\n−0.19\n1.16\n0.67\n−1.03\n0.37\n−0.31\n0.33\n0.52\n0.15\n0.75\n−0.82\n0.87\n−0.04\n−0.23\n0.52\n−0.53\n0.51\n0.84\n0.38\n−0.20\n0.34\n0.71\n\nSSFR\nlog yr−1\n\nAge\nlog yr\n\n−11.03+0.45\n−0.00\n−8.85+0.47\n−0.83\n−10.58+0.36\n−0.00\n−9.68+0.00\n−0.24\n−10.58+0.90\n−1.01\n−9.47+0.87\n−0.00\n−10.58+0.36\n−0.00\n−10.22+1.09\n−0.36\n−10.22+1.62\n−0.36\n−9.68+1.08\n−0.54\n−9.13+0.41\n−0.55\n−6.80+0.00\n−2.05\n−9.68+0.83\n−0.24\n−10.58+0.00\n−0.45\n−8.72+0.45\n−1.50\n−9.68+0.96\n−0.24\n−8.72+0.34\n−1.20\n−6.89+0.09\n−1.60\n−8.60+0.43\n−1.32\n−9.68+0.55\n−0.24\n−10.58+0.90\n−0.00\n−7.47+0.38\n−0.59\n−9.47+0.75\n−0.45\n−8.60+0.43\n−1.32\n−9.92+0.79\n−0.30\n−9.92+0.63\n−0.30\n−10.58+0.00\n−0.00\n−9.68+0.96\n−0.00\n−9.92+0.45\n−0.00\n−8.85+0.58\n−0.83\n−9.92+0.94\n−0.66\n−9.92+1.20\n−0.66\n−8.27+1.67\n−0.71\n−9.68+0.55\n−0.00\n−9.68+2.88\n−0.24\n−9.47+0.75\n−0.21\n−6.80+0.10\n−2.88\n−10.22+1.09\n−0.36\n−10.58+0.90\n−0.00\n−9.68+0.39\n−0.24\n−9.29+2.49\n−0.18\n−9.47+0.75\n−0.21\n−9.92+0.94\n−0.66\n−9.68+0.21\n−0.24\n−9.68+1.19\n−0.24\n−9.13+3.03\n−0.34\n−9.68+0.70\n−0.24\n−9.68+0.96\n−0.24\n−9.13+0.28\n−0.79\n−7.09+0.20\n−0.77\n−9.13+2.43\n−0.16\n−9.92+1.86\n−0.66\n−9.92+0.94\n−0.30\n−8.49+1.79\n−0.98\n−9.29+0.69\n−0.18\n−9.92+0.94\n−0.66\n−9.92+0.45\n−0.30\n\n9.70+0.02\n−0.16\n8.80+0.56\n−0.42\n9.60+0.01\n−0.14\n9.30+0.11\n−0.06\n9.60+0.20\n−0.37\n9.20+0.06\n−0.68\n9.60+0.02\n−0.19\n9.50+0.15\n−0.54\n9.50+0.10\n−0.95\n9.30+0.22\n−0.71\n9.00+0.34\n−0.34\n6.80+2.10\n−0.08\n9.30+0.13\n−0.52\n9.60+0.10\n−0.09\n8.70+0.80\n−0.41\n9.30+0.14\n−0.64\n8.70+0.70\n−0.31\n6.90+1.61\n−0.12\n8.60+0.81\n−0.41\n9.30+0.11\n−0.36\n9.60+0.05\n−0.33\n7.50+0.63\n−0.42\n9.20+0.22\n−0.51\n8.60+0.84\n−0.44\n9.40+0.11\n−0.40\n9.40+0.10\n−0.36\n9.60+0.01\n−0.08\n9.30+0.04\n−0.61\n9.40+0.01\n−0.25\n8.80+0.51\n−0.55\n9.40+0.22\n−0.58\n9.40+0.28\n−0.70\n8.30+0.61\n−1.71\n9.30+0.03\n−0.32\n9.30+0.10\n−2.51\n9.20+0.13\n−0.54\n6.80+2.52\n−0.12\n9.50+0.11\n−0.55\n9.60+0.05\n−0.30\n9.30+0.11\n−0.24\n9.10+0.17\n−2.31\n9.20+0.11\n−0.54\n9.40+0.25\n−0.57\n9.30+0.10\n−0.19\n9.30+0.16\n−0.82\n9.00+0.21\n−3.00\n9.30+0.11\n−0.45\n9.30+0.12\n−0.64\n9.00+0.41\n−0.23\n7.10+0.89\n−0.21\n9.00+0.12\n−2.32\n9.40+0.21\n−1.34\n9.40+0.16\n−0.53\n8.50+0.70\n−1.83\n9.10+0.11\n−0.50\n9.40+0.22\n−0.53\n9.40+0.11\n−0.23\n\n\f22\n\nStoll et al.\nTable 6 - Continued\nSN Name\nPTF10dk\nPTF10dvb\nPTF10hv\nPTF10in\nPTF10s\nPTF10ts\nPTF10u\n\ntype\nII\nII\nII\nIIb\nII\nII\nII\n\nM\nlog M⊙\n8.36+0.17\n−0.62\n10.13+0.11\n−0.20\n9.82+0.04\n−0.13\n8.19+0.29\n−0.60\n9.61+0.05\n−0.13\n9.86+0.04\n−0.12\n9.72+0.21\n−0.25\n\nSFR (FAST)\nlog M⊙ /yr\n\nSFR (u)\nlog M⊙ /yr\n\n−1.56+2.50\n−0.15\n0.66+0.80\n−0.39\n−0.11+0.72\n−0.00\n−0.42+1.42\n−1.09\n−0.31+0.83\n−0.02\n−0.06+0.81\n−0.05\n−3.47+2.58\n−0.13\n\n−1.51\n0.59\n−0.01\n−0.59\n−0.18\n0.04\n−0.86\n\nSSFR\nlog yr−1\n\nAge\nlog yr\n\n−9.92+3.12\n−0.30\n−9.47+0.98\n−0.45\n−9.92+0.79\n−0.00\n−8.60+1.80\n−1.32\n−9.92+0.94\n−0.00\n−9.92+0.94\n−0.00\n−13.18+2.60\n−0.00\n\n9.40+0.12\n−2.60\n9.20+0.22\n−0.70\n9.40+0.01\n−0.48\n8.60+0.83\n−1.88\n9.40+0.03\n−0.52\n9.40+0.04\n−0.50\n10.00+0.00\n−0.46\n\nTable 7\nCuts to MPA/JHU comparison sample\nCriterion\n\nDetails\n\nSamplea\n\nWithin redshift range of sample\nSuccessful stellar mass estimate\nSuccessful SFR estimate\n12+log(O/H) metallicity estimate\nN2 flux ratio in valid range\n\n0.0189995 < z < 0.103\nMmed > 2 and not INDEF\nSFRavg != −99 and no SFR flag\nOHmed != −99.9\n-2.5 < N2 < -0.3\n\n382095\n363881\n362395\n131203\n130370\n\na\n\nRemaining sample shown. Cuts are sequential. The sample size of\n\nthe full MPA/JHU value-added catalog is 927552.\n\n\f"}