{"id": "http://arxiv.org/abs/0907.4779v1", "guidislink": true, "updated": "2009-07-27T21:44:34Z", "updated_parsed": [2009, 7, 27, 21, 44, 34, 0, 208, 0], "published": "2009-07-27T21:44:34Z", "published_parsed": [2009, 7, 27, 21, 44, 34, 0, 208, 0], "title": "Matter-wave bistability in coupled atom-molecule quantum gases", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0907.1636%2C0907.2042%2C0907.4032%2C0907.3176%2C0907.1624%2C0907.0703%2C0907.1030%2C0907.0368%2C0907.3092%2C0907.4227%2C0907.0893%2C0907.0284%2C0907.1942%2C0907.3208%2C0907.1639%2C0907.4256%2C0907.5219%2C0907.5056%2C0907.4516%2C0907.5125%2C0907.1038%2C0907.1099%2C0907.5155%2C0907.1436%2C0907.3332%2C0907.4624%2C0907.3645%2C0907.2739%2C0907.2868%2C0907.4165%2C0907.0488%2C0907.5602%2C0907.3355%2C0907.1365%2C0907.1063%2C0907.5037%2C0907.1840%2C0907.0741%2C0907.4995%2C0907.4424%2C0907.4725%2C0907.4332%2C0907.1111%2C0907.3082%2C0907.1743%2C0907.4779%2C0907.4940%2C0907.2606%2C0907.5598%2C0907.5537%2C0907.3648%2C0907.2400%2C0907.4130%2C0907.1680%2C0907.1417%2C0907.0881%2C0907.4435%2C0907.0337%2C0907.0814%2C0907.0999%2C0907.3466%2C0907.5468%2C0907.1675%2C0907.2771%2C0907.3445%2C0907.5108%2C0907.2480%2C0907.5196%2C0907.0385%2C0907.0005%2C0907.2809%2C0907.0924%2C0907.1541%2C0907.2862%2C0907.0500%2C0907.2056%2C0907.1878%2C0907.5093%2C0907.2740%2C0907.4169%2C0907.4363%2C0907.2951%2C0907.2326%2C0907.0886%2C0907.2485%2C0907.4298%2C0907.3683%2C0907.0318%2C0907.5525%2C0907.1990%2C0907.4869%2C0907.3229%2C0907.3128%2C0907.2397%2C0907.4836%2C0907.5420%2C0907.0051%2C0907.3970%2C0907.5022%2C0907.5485%2C0907.1918&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Matter-wave bistability in coupled atom-molecule quantum gases"}, "summary": "We study the matter-wave bistability in coupled atom-molecule quantum gases,\nin which heteronuclear molecules are created via an interspecies Feshbach\nresonance involving either two-species Bose or two-species Fermi atoms at zero\ntemperature. We show that the resonant two-channel Bose model is equivalent to\nthe nondegenerate parametric down-conversion in quantum optics, while the\ncorresponding Fermi model can be mapped to a quantum optics model that\ndescribes a single-mode laser field interacting with an ensemble of\ninhomogeneously broadened two-level atoms. Using these analogy and the fact\nthat both models are subject to the Kerr nonlinearity due to the two-body\ns-wave collisions, we show that under proper conditions, the population in the\nmolecular state in both models can be made to change with the Feshbach detuning\nin a bistable fashion.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0907.1636%2C0907.2042%2C0907.4032%2C0907.3176%2C0907.1624%2C0907.0703%2C0907.1030%2C0907.0368%2C0907.3092%2C0907.4227%2C0907.0893%2C0907.0284%2C0907.1942%2C0907.3208%2C0907.1639%2C0907.4256%2C0907.5219%2C0907.5056%2C0907.4516%2C0907.5125%2C0907.1038%2C0907.1099%2C0907.5155%2C0907.1436%2C0907.3332%2C0907.4624%2C0907.3645%2C0907.2739%2C0907.2868%2C0907.4165%2C0907.0488%2C0907.5602%2C0907.3355%2C0907.1365%2C0907.1063%2C0907.5037%2C0907.1840%2C0907.0741%2C0907.4995%2C0907.4424%2C0907.4725%2C0907.4332%2C0907.1111%2C0907.3082%2C0907.1743%2C0907.4779%2C0907.4940%2C0907.2606%2C0907.5598%2C0907.5537%2C0907.3648%2C0907.2400%2C0907.4130%2C0907.1680%2C0907.1417%2C0907.0881%2C0907.4435%2C0907.0337%2C0907.0814%2C0907.0999%2C0907.3466%2C0907.5468%2C0907.1675%2C0907.2771%2C0907.3445%2C0907.5108%2C0907.2480%2C0907.5196%2C0907.0385%2C0907.0005%2C0907.2809%2C0907.0924%2C0907.1541%2C0907.2862%2C0907.0500%2C0907.2056%2C0907.1878%2C0907.5093%2C0907.2740%2C0907.4169%2C0907.4363%2C0907.2951%2C0907.2326%2C0907.0886%2C0907.2485%2C0907.4298%2C0907.3683%2C0907.0318%2C0907.5525%2C0907.1990%2C0907.4869%2C0907.3229%2C0907.3128%2C0907.2397%2C0907.4836%2C0907.5420%2C0907.0051%2C0907.3970%2C0907.5022%2C0907.5485%2C0907.1918&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We study the matter-wave bistability in coupled atom-molecule quantum gases,\nin which heteronuclear molecules are created via an interspecies Feshbach\nresonance involving either two-species Bose or two-species Fermi atoms at zero\ntemperature. We show that the resonant two-channel Bose model is equivalent to\nthe nondegenerate parametric down-conversion in quantum optics, while the\ncorresponding Fermi model can be mapped to a quantum optics model that\ndescribes a single-mode laser field interacting with an ensemble of\ninhomogeneously broadened two-level atoms. Using these analogy and the fact\nthat both models are subject to the Kerr nonlinearity due to the two-body\ns-wave collisions, we show that under proper conditions, the population in the\nmolecular state in both models can be made to change with the Feshbach detuning\nin a bistable fashion."}, "authors": ["Lei Jiang", "Han Pu", "Andrew Robertson", "Hong Y. Ling"], "author_detail": {"name": "Hong Y. Ling"}, "author": "Hong Y. Ling", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1103/PhysRevA.81.013619", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/0907.4779v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0907.4779v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "6 pages, 5 figures", "arxiv_primary_category": {"term": "cond-mat.quant-gas", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cond-mat.quant-gas", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0907.4779v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0907.4779v1", "journal_reference": null, "doi": "10.1103/PhysRevA.81.013619", "fulltext": "Matter-wave bistability in coupled atom-molecule quantum gases\nLei Jiang1 , Han Pu1 Andrew Robertson2,3 , and Hong Y. Ling2\n\narXiv:0907.4779v1 [cond-mat.quant-gas] 27 Jul 2009\n\n1\n\nDepartment of Physics and Astronomy, and Rice Quantum Institute, Rice University, Houston, TX 77251, USA\n2\nDepartment of Physics and Astronomy, Rowan University, Glassboro, New Jersey, 08028-1700, USA and\n3\nJoint Quantum Institute and Condensed Matter Theory Center,\nDepartment of Physics, University of Maryland, College Park, MD 20742-4111, USA\nWe study the matter-wave bistability in coupled atom-molecule quantum gases, in which heteronuclear molecules are created via an interspecies Feshbach resonance involving either two-species\nBose or two-species Fermi atoms at zero temperature. We show that the resonant two-channel Bose\nmodel is equivalent to the nondegenerate parametric down-conversion in quantum optics, while the\ncorresponding Fermi model can be mapped to a quantum optics model that describes a single-mode\nlaser field interacting with an ensemble of inhomogeneously broadened two-level atoms. Using these\nanalogy and the fact that both models are subject to the Kerr nonlinearity due to the two-body\ns-wave collisions, we show that under proper conditions, the population in the molecular state in\nboth models can be made to change with the Feshbach detuning in a bistable fashion.\nPACS numbers: 03.75.-b, 03.75.Ss, 05.30.Fk, 05.30.Jp\n\nI.\n\nINTRODUCTION\n\nWe study the matter-wave bistability in coupled\natom-molecule quantum gases, in which heteronuclear\nmolecules are created via an interspecies Feshbach resonance involving either two-species Bose or two-species\nFermi atoms at zero temperature. We show that the resonant two-channel Bose model is equivalent to the nondegenerate parametric down-conversion in quantum optics,\nwhile the corresponding Fermi model can be mapped to a\nquantum optics model that describes a single-mode laser\nfield interacting with an ensemble of inhomogeneously\nbroadened two-level atoms. Using these analogies and\nthe fact that both models are subject to the Kerr nonlinearity due to the two-body s-wave collisions, we show that\nunder proper conditions, the population in the molecular state in both models can be made to change with the\nFeshbach detuning in a bistable fashion.\nThe ability to cool and trap neutral atoms down to\nquantum degenerate regime has created a host of new and\nexciting problems that are increasingly interdisciplinary,\nbridging in particular the atomic, molecular, and optical physics and the condensed matter physics. The rich\nknowledge and experience accumulated over the past several decades in these fields have dramatically accelerated\nthe progress of ultracold atomic physics. An example\nthat serves to illustrate how the interdisciplinary fields\nlearn and benefit from each other is the phenomonon of\natomic pairing where a bosoinc molecule is coupled to\ntwo bosonic or fermionic constituent atoms via Feshbach\nresonance or photoassociation. So far this is the only viable approach to create ultracold molecules. It is also\nan ideal test ground for studying coupled atom-molecule\ncondensates and the BCS-BEC crossover [2]. The latter is thought to be underlying the mechanism of high\ntemperature superconductors and extensively studied in\nthe realm of condensed matter physics. In addition, the\ncoupled atom-molecule systems have deep quantum opti-\n\ncal analogies [4, 5]: bosoinc molecules coupled to bosonic\natoms (which we will refer to as the bosonic model in this\npaper) is the matter-wave analog of parametric coupling\nof photons which has important applications in generating nonclassical light fields and, more recently, in quantum information science; while the system of bosonic\nmolecules coupled to fermionic atoms (which we will refer\nto as the fermionic model) can be mapped to the Dicke\nmodel where a light field interacts with an ensemble of\ntwo-level atoms, a model having fundamental importance\nin the field of quantum optics.\nIn this work, we will further explore these quantum\noptical analogies of the atom-molecule system and focus on the important effects of binary collisional interactions between atoms which are largely ignored in previous\nstudies [4, 5]. We show that the atom-atom interaction\nintroduces extra nonlinear terms which, under certain\nconditions, give rise to matter-wave bistability in both\nbosonic and fermionic models. Hence, we may establish\nthe connection between the coupled atom-molecule quantum gases and the nonlinear bistable systems [6] that\nhave been extensively studied in the 80's in the context\nof nonlinear optics, due both to its fundamental interest, and to its many practical applications in fast optical\nswitches, optical memory, laser pulse shaping, etc.\n\nII.\n\nBOSONIC MODEL\n\nIn what we call the bosonic model, a molecule associated with annihilation operator âm is coupled to\ntwo non-identical atoms labeled as | ↑i and | ↓i with\ncorresponding annihilation operators â↑ and â↓ , respectively. Here we consider two types of atoms in order\nto make direct comparisons with the fermionic model\nto be treated in the next section, for which only unlike\nfermionic atoms can pair with each other and form a\nbosonic molecule. Futhermore, in this work we only consider zero-temperature homogeneous case so that all the\n\n\f2\nbosons are condensed into zero center-of-mass momentum states.\nThe second quantized Hamiltonian reads\n\u0001 X\nχij â†i â†j âj âi , (1)\nĤ = δ â†m âm + g â†m â↑ â↓ + h.c. +\ni,j\n\nwhere the detuning δ represents the energy difference\nbetween the molecular and atomic levels which can be\ntuned by external field, g is the atom-molecule coupling\nstrength and χij = χji is the s-wave collisional strength\nbetween modes i and j. This system has been studied in\nRef. [7]. For completeness and better comparison with\nthe fermionic model, we briefly state some of the main\nresults relevant to the focus of this work - matter-wave\nbistability - and direct readers to Ref. [7] for more details.\nFor our purpose, we take the standard mean-field approximation\nand replace operators âj with c-numbers\np\naj = Nj eiφj . The mean-field Hamiltonian takes the\nform:\np\nH = 2Λ(y 2 − y) + 2νy + (1 − 2y) 2y cos φ , (2)\nwhere\n\nB.\n\nBistability\n\nIn the absence of the collisions or Kerr nonlinearity\n(i.e., Λ = 0), the system does not exhibit bistability.\nThis can be seen by studying the properties of the meanfield Hamiltonian H in Eq. (2) which can be simplified\nas (taking φ = π)\np\nH = 2νy − (1 − 2y) 2y ,\n(3)\nThe stationary state correspond to the solution of\np\np\n∂H\n= 2ν + 3 2y − 1/ 2y = 0 .\n∂y\n\n(4)\n\nFor a given detuning ν, the stationary state is unique:\n\u001a\n0.5 ,\nν < −1\n√\ny0 (ν) =\n(5)\n1\n2 + 3)2 , ν ≥ −1\nν\n(−ν\n+\n18\nFor Λ 6= 0, using Eq. (2), the stationary condition is given\nby\np\np\n∂H\n= 2ν ′ + 3 2y − 1/ 2y = 0 ,\n∂y\n\n(6)\n\nwhere we have defined\n\ny = 0.5 [1 − (N↑ + N↓ ) /N ] = Nm /N , φ = φ↑ +φ↓ −φm ,\nare a pair of conjugate variables, representing the molecular population and phase mismatch, respectively. Other\nquantities are defined as\n√\nG = g 2N ,\nΛ = N (χ↑↑ + χ↓↓ + χmm + 2χ↑↓ − 2χm↑ − 2χm↓ ) /G ,\nν = [δ + χ↑↑ + χ↓↓ + (N − 1) χmm − N χm↑ − N χm↓ ] /G ,\nwith N ≡ N↑ +N↓ +2Nm a constant of motion representing the total number of atoms, and we have assumed that\nthe number of atoms in states | ↑i and | ↓i are equal, i.e.,\nN↑ = N↓ . In addition, we will focus on the stationary\nstates with φ = π which has lower energies than the ones\nwith φ = 0.\n\nA.\n\nQuantum Optical Analogy\n\nIt is quite clear from the form of the second-quantized\nHamiltonian in Eq. (1) that without the collisional terms\nour model will reduce to the trilinear Hamiltonian describing the nondegenerate parametric down-conversion\nin quantum optics [8, 9]. In this analogy, the molecular mode plays the role of the pump photon, where the\ntwo atomic modes are the signal and idler photons, respectively. The collisional terms would correspond to the\nKerr-type cubic nonlinearity which will be present in the\noptical system if the light fields propagate in some nonlinear medium [10].\n\nν ′ = ν + Λ(2y − 1) .\n\n(7)\n\nNote that Eqs. (4) and (6) have the same form. In other\nwords,we can express the effect of collisions as a nonlinear\nphase shift for molecules that modifies the detuning ν.\nConsequently, the stationary solution for Λ 6= 0 should\nhave the same form as in Eq. (5) but with ν replaced by\nν ′ , which makes y0 an implicit function of the detuning\nν. To find the explicit dependence of y0 on ν, we can\nuse the graphic method as illustrated in Fig. 1. For the\nexample given, we obtain three stationary states. Further\nanalysis shows that the middle solution is dynamically\nunstable and the other two are stable solutions [7]. Such\na behavior is typical in bistable systems [6].\nThe graphics of Fig. 1 also shows that, in order to have\nmultiple stationary solutions, the slope of the straight\nline (given by 1/2Λ) must be negative and cannot be too\nsteep. More specifically, the slope of the straight line has\nto be larger than the slope of the curve at ν = −1, and\nthis leads to the condition\nΛ < −1 ,\n\n(8)\n\nin order for the system to exhibit bistability.\nIII.\n\nFERMIONIC MODEL\n\nIn the fermionic model, we denote âk,σ as the annihilation operator for an atom with spin σ (=↑ , ↓), momentum ~k, and energy ǫk = ~2 k 2 /(2m), and as before\ndenote âm as the annihilation operator for a molecule in\n\n\f3\n\ny\n\nv ́\nFIG. 1: For given Λ and ν, the thick solid line represents\ny0 (ν ′ ) and the thin dashed straight line represents Eq. (7).\nThe intersects are the stationary solutions. Here we take\n1/2Λ = −0.1 and ν = 0.4Λ.\n\nstate |mi with zero momentum. the second quantized\nHamiltonian reads:\nX\nX † †\nĤ =\nǫk â†kσ âkσ + U\nâk↑ â−k+q↓ â−k′ +q↓ âk′ ↑\nk,k′ ,q\n\nk,σ\n\n\u0001\ng X †\n+ νâ†m âm + √\nâm â−k↓ âk↑ + h.c. ,\nV k\n\n(9)\n\nwhere V is the quantization volume. Hamiltonian (9) has\nthe form of the two-channel model of BCS-BEC crossover\nwhere only the condensed molecule part is considered\n[11]. Following the Hartree-Fock-Bogoliubov mean-field\napproach [15] by dividing the two-body collision into a\npart related to the BCS gap potential ∆ = U p, where\nX\np=\nhâ−k↓ âk↑ i /V ,\nk\n\nand a part related to the Hartree potential\nX †\nVh = U\nhâkσ âkσ i/(2V ) ,\n\n(10)\n\nkσ\n\nwhere we again assume equal population in | ↑i and | ↓i\natomic states, i.e., hâ†k↑ âk↑ i = hâ†k↓ âk↓ i, we may express\nthe Hamiltonian as\nX\nĤ =\n(ǫk + Vh )â†kσ âkσ + νâ†m âm\nk,σ\n\n+\n\nX h\u0010\nk\n\ni\n√ \u0011\nU p + gâm / V â†k↑ â†−k↓ + h.c .\n\n(11)\n\nP\nDefining N̂ = 2â†m âm + k,σ â†kσ âkσ as the number operator which is a constant of motion, we may rewrite the\nterm proportional to Vh in (11) as\nX\nVh â†kσ âkσ = Vh (N̂ − 2b̂† b̂)\nk,σ\n\n\u0011\n\u0010\n= Vh N̂ − U n − 2U hb̂† b̂i/V b̂† b̂ ,\n\n(12)\n\nwhere n = hN̂ i/V is the constant total atom number\ndensity. In our derivation, Vh arises from the two-body\natom-atom collision. In general, additional terms representing atom-molecule and molecule-molecule collisions\nare also present. These additional terms will modify the\ncoefficient U in the definition of Vh [Eq. (10)], which is the\ncounterpart of Λ in the bosonic model, but the general\nform of Eq. (12) will remain valid. In the following, we\nwill refer to this term as the collisional term. Through\nEq. (12), we have expressed the effect of the two-body\ncollisions as a nonlinear energy shift of the molecules\n(along with a constant energy bias Vh N ), in complete\nanalogy with the bosonic model. We remark that in the\nusual one-channel model of the mean-field BCS theory\nvalid when the molecular population is negligible, the\ncollisional term just represents an unimportant constant\nenergy shift.\nAs usual, âkσ (t) and âm (t) obey the Heisenberg equations of motion based on Hamiltonian (11). By replacing\n√\nBose operator âm with the related c-number c = hb̂i/ V\nand Fermi operators âkσ (t) with the familiar uk (t) and\nvk (t) parameters through the Bogoliubov transformation\nâk↑ = u∗k α̂k↑ + vk α̂†−k↓ and â†−k↓ = −vk∗ α̂k↑ + uk α̂†−k↓ ,\nwhere α̂kσ are the Fermi quasiparticle operators, we arrive at the following set of mean-field equations of motion\ni~ċ = νe c + gp ,\ni~u̇k = −ǫk uk + ∆e vk ,\ni~v̇k = ∆e uk + ǫk vk ,\nwhere p =\n\nP\n\nk\n\n(13a)\n(13b)\n(13c)\n\nu∗k vk /V , ∆e = gc + U p , and\n2\n\nνe = ν − U n + 2U |c| ,\n\n(14)\n\nis the effective detuning which contains a Kerr nonlinear\nterm 2U |c|2 whose origin can be traced to the two-body\ncollisional shift. This set of equations describes the dynamics at zero temperature where the state of the system\ncan be described as the quasiparticle vacuum.\nA.\n\nQuantum Optical Analog\n\nIn several previous studies where the collisional term\nis neglected, it has been pointed out that the fermionic\nmodel can be mapped to the Dicke model in quantum\noptics [4, 12] as schematically shown in Fig. 2 (see below\nfor details). In fact, this model was recently shown to\ndisplay collective dynamics similar to photon echo and\nsoliton-like oscillations in transient collective coherent\noptics [13]. Such a connection can be traced to the work\nof Anderson's spin analogy [14] for the BCS problem.\nTo show what is the quantum optical analogy of the\ncollisional term, let us rewrite Eqs. (13) in a form more\nfamiliar in cavity optics. To this end, we first introduce\na set of new variables\n2\n\n2\n\nPk = 2u∗k vk , Dk = |uk | − |vk | , EL = 2i∆e ,\n\n\f4\noptical-Bloch equations in which the Lorentz-Lorenz relation is explicitly incorporated [18], and hence can lead\nto interesting nonlinear phenomena just as they do in\noptical systems.\n\n›\ng\n| ›\n|m\n\nn\n\n›\n\n| ̄\n\nB.\n\n ̄\n\nHaving established this analogy, we now look for the\nsteady state solution from Eqs. (13a) and (15). As is\nwell-known, the operation frequency of a laser field is\nnot known a priori; but is established through the socalled mode pulling - the dynamical competition between atomic and cavity resonances. A similar argument\nholds for the molecular field c. For this reason, we adopt\nthe following steady-state ansatz\n\nc\n\nFIG. 2: (Color online) Mapping of the two-channel resonant\nFermi superfluid model to the Dicke model. The bosonic\nmolecules and the fermionic atoms in the former are mapped\nto the cavity laser field and an ensemble of two-level atoms in\nthe latter, respectively. See text for details.\n\nand recast Eqs. (13b), (13c) into\n~Ṗk = −i2ǫk Pk − EL Dk ,\n\n~Ḋk =\n\n(EL∗ Pk\n\nBistability\n\n+\n\nEL Pk∗ ) /2 .\n\n(15a)\n(15b)\n\nInterpreting Pk and Dk as the microscopic polarization\nand population inversion, respectively, Eqs. (15) then become the optical Bloch equation that describes the interaction between a local electromagnetic field EL and\na fictitious two-level atom, characterized with a transition energy 2ǫk [16]. This analogy is consistent with the\nfact that there exists a one-to-one mapping between pairs\nof fermion operators and Pauli matrices when the BCS\npairing mechanism is taken into account [14].\nIn this optical analogy, the local electric field EL =\nE+Ei contains two contributions because of ∆e = gc+U p.\nThe first of these (E = i2gc) is equivalent to an average macroscopic field, whose dynamics is described\nby Eq. (13a), which can now be interpreted as the\nMaxwell's equation for the cavity field E with cavity\ndetuning P\nνe , driven by a macroscopic polarization density p = k Pk /(2V ) of an inhomogeneously-broadened\nmedium [see Fig. 2]. The second part Ei = i2U p may be\nregarded as the internal field at the atom due to the collective dipole polarization of the nearby two-level atoms\nin the ensemble. As such, EL = E + Ei here bears a\ndirect analogy to the Lorentz-Lorenz relation in optics\n[17]. Note that had the collisional term been neglected\n(i.e., U = 0), there would have been no internal field\ncontribution, nor would there have been the Kerr nonlinearity in the equation for the bosonic mode. For U 6= 0,\nboth of these terms will be present. Under such a circumstance, Eqs. (13a) and (15) represent the generalized\n\nc → c e−2iμt/~ , Pk → Pk e−2iμt/~ , Dk → Dk\nwhere the same symbols are used for both dynamical\nand steady-state variables for notational simplicity. The\nmolecular chemical potential, 2μ, is just the corresponding lasing frequency in the cavity optics model. From the\nsteady state equations obtained by inserting this stationary ansatz into Eqs. (13a) and (15), we can easily find\nthat (a) there always exists a trivial solution or a \"nonlasing\" state with ∆e = 0 or equivalently c = 0, which\ncorresponds to the non-superfluid normal Fermi sea; and\n(b) a non-trivial solution with its μ, ∆e and c determined\nself-consistently from the gap equation\n1\nU−\nwith Ek =\n\ng 2 /(ν\n\ne\n\n− 2μ)\n\n=−\n\n1 X 1\n,\n2V\nEk\n\n(16)\n\nk\n\np\n(ǫk − μ)2 + ∆2e , the number equation\n\u0013\n\u0012\n1 X\nǫk − μ\n= n,\n2|c| +\n1−\nV\nEk\n2\n\n(17)\n\nk\n\nand an auxiliary relation\n|g∆e | = |c(νe − 2μ)[U − g 2 /(νe − 2μ)]| .\n\n(18)\n\nThe integral in the gap equation (16) under the assumption of contact interaction is known to be ultraviolet divergent. To eliminate this problem, we renormalize the\ninteraction strength U and g, as well as the detuning ν\nin (16), while U in the collisional term is replaced by the\nbackground interaction strength U0 [19, 20].\nNote that there exists, in the single-mode inhomogeneously broadened laser theory [21], a similar set of\nsteady-state integral equations, which, due to lasers being open systems, are obtained under different considerations. For example, the requirement that the cavity loss\nbalance the saturated gain leads to the \"gap\" equation,\nwhose primary role is to limit the laser intensity; while\nthe phase matching condition translates into the \"number\" equation, whose main responsibility is to assign the\n\n\f5\n\nx\n\nrelevant equations of motion maintain the same forms if\nwe substitute ν by\n\nx\n+\n\ne\n\nx\n\n(b)\n\n(a)\nc2\n\nν ′ = ν + 2U0 |c|2 .\n\nc2\n\nFIG. 3: (Color online) Free energy density f as a function of\n∆e and |c|2 at ν = 0.02 (a) and ν = 0.2 (b). Extremum points\nare indicated by 'x' (minimum) and '+' (saddle point). f ,\n∆e , and ν are all in units of EF = (3π 2 n)2/3 /(2m), the Fermi\nenergy of the non-interaction system. In all the examples\nshown in this paper, the physical parameters corresponding\n3/2\nto g0 and U0 are 1.2 EF /kF and −60.7 EF /kF3 , respectively.\n\n(a)\n\n(b)\n\nFIG. 4: Molecular population |c|2 as a function of detuning.\nVertical line in (a) indicate the critical point of a first-order\nphase transition. In (a) the collisional term is included while\nit is neglected in (b).\n\namount of mode pulling of the laser field relative to the\ncavity resonance.\nAn alternative way to derive Eqs. (16)-(18) is from\nthe energy density. The zero-temperature energy density\nf (∆e , c, μ) ≡ hĤi/V can be calculated using Hamiltonian (11) and the Bogoliubov transformation as [20]\n(∆e − gc)2\n+ (νe − 2μ)|c|2 + μn .\nV\nU\nk\n(19)\nThe extremum conditions ∂f /∂∆e = ∂f /∂c = 0, lead\nto Eqs. (16) and (18), respectively, while the condition\n∂f /∂μ = 0 results in the number equation (17).\nFigure 3 illustrates the energy density in the |c|2 -∆e\nplane for different detuning ν. For any given pair of (c,\n∆e ), μ is calculated self-consistently using the number\nequation (17). Typically, f has only one extremum which\nis a minimum point as shown in Fig. 3(a). However,\nin the regime ν ∈ (−0.08, 0.13) EF , f possesses three\nextrema: two of them are local minima and the third\na saddle point. An example with ν = 0.02 is shown in\nFig. 3(b).\nTo gain more insights into the bistable behavior, we\nmay carry an analogous analysis as in Sec. II B. In the absence of the collisional term, steady-state molecular population |c|2 is a smooth monotonically decreasing function of ν and the system does not exhibit bistability:\nAs ν increases, molecules decompose into atoms. This is\nshown in Fig. 4(a). When collisional term is included, the\n\nf=\n\nX ǫk − μ − Ek\n\n−\n\n(20)\n\nHence the solution |c|2 as a function of ν ′ is represented\nby the same curve as in Fig. 4(a). To find |c|2 as a function of ν, we need to find the intersects between this curve\nand the straight line representing Eq. (20). In direct analogy to the graphic method in Fig. 1, for U0 sufficiently\nlarge and negative, these two curves have three intersects and the system exhibits bistability. One example is\nshown in Fig. 4(b). The vertical line in Fig. 4(b) indicate\nthe critical point of a first-order phase transition: across\nthis line, the ground state jumps from the upper branch\nto the lower one. For the parameters used, this occurs at\nνc = −0.01 EF .\nTo check the stability of these steady states, we have\nsolved the dynamical equations (13) using the slightly\nperturbed steady state solution as the initial condition.\nFrom the dynamical evolution of the system one can\nsee that, just like in the bosonic model, the states in\nthe upper and lower branches are dynamically stable:\nwhen slightly perturbed, they exhibit damped oscillations around their equilibrium values. These oscillations\ncan be further understood from the excitation spectrum\nof the corresponding steady state. This can be done using a linear stability analysis, which is also the standard\ntool for studying laser instabilities [21, 22]. The spectrum\nis found to contain a discrete part which determines the\noscillation frequencies, and a continuous part which contributes to the damping of these oscillations at a much\nlonger time scale [23]. By contrast, the states in the middle branch are unstable as small perturbations will lead\nto large departures.\n\nC.\n\nDynamics\n\nThe bistability has important ramifications in atommolecule conversion dynamics. When the collisional\nterm is unimportant and negligible, one can easily create\nbosonic molecules from fermionic atoms by adiabatically\nsweeping the Feshbach detuning across the resonance.\nAs long as the sweeping speed is sufficiently slow, the\nmolecular population will follow the steady-state curve as\nshown in Fig. 4(a). By contrast, when bistability induced\nby the collisional term occurs, the adiabaticity condition\nwill necessarily break down. Fig. 5 displays the dynamical evolution of the bosonic population when the detuning is swept starting either from a large positive or a large\nnegative value. We can see that the steady-state curve\ncan be followed up to the point where the stable states of\nthe upper and lower branches and the unstable states of\nthe middle branch join each other (indicated by ν1 and ν2\nin Fig. 5), where the population suddenly jumps between\nthe two stable branches. Note that the critical detuning\nνc for the first-order phase transition as indicated by the\n\n\f6\n\nν2\n|c|2\n\nIV.\n\n(a)\n(b)\n\nν1\nν\nFIG. 5: (Color online) Dynamics of atom-molecule conversion\nas illustrated by the molecular population when the detuning\nν is slowly swept. Curve (a) is obtained by sweeping ν from\npositive to negative values, while curve (b) is obtained by\nsweeping ν in the opposite direction. The dotted line is the\nsteady-state molecular population, the same as in Fig. 4(b).\n\nCONCLUSION\n\nIn conclusion, we have studied the matter-wave bistability in coupled atom-molecule quantum gases in both\nthe bosonic and the fermionic models. These two cases\ncan be mapped to two very different quantum optical\nmodels: parametric downconversion in the former and\ngeneralized Dicke model in the latter. Nevertheless, one\nimportant common feature for both cases is that bistability can be induced by collisional interactions which\ngive rise to Kerr nonlinearity. We hope that our work\nwill motivate experimental efforts in demonstrating the\nmatter-wave bistability we predicted here.\n\nAcknowledgments\n\nvertical line in Fig. 4(b) lies between ν1 and ν2 . The dynamical population curve thus exhibits hysteresis in the\nvicinity of the first-order phase transition. In this way,\nby tuning the detuning in the vicinity of ν1 or ν2 , an\natom-molecule switch can be realized. Similar behavior\nis also found in the bosonic model.\n\n[1] E. Timmermans, K. Furuya, P. W. Milonni, and A. K.\nKerman, Phys. Lett. A 285 228 (2001); M. Holland, S.\nJ. J. M. F. Kokkelmans, M. L. Chiofalo, and R. Walser,\nPhys. Rev. Lett. 87, 120406 (2001).\n[2] Q. Chen, J. Stajic, S. Tan, and K. Levin, Phys. Rep. 412,\n1 (2005).\n[3] R. B. Diener, and T.-L. Ho, cond-mat/0405174 (2004).\n[4] M. W. Jack, and H. Pu, Phys. Rev. A 72, 063625 (2005).\n[5] I. Tikhonenkov, E. Pazy, Y. B. Band, and A. Vardi, Phys.\nRev. A 77, 063624 (2008); M. Ögren, C. M. Savage, and\nK. V. Kheruntsyan, Phys. Rev. A 79 043624 (2009).\n[6] H. M. Gibbs, Controlling Light with Light (Academic,\nOrlando, Fla., 1985).\n[7] L. Zhou, W. Zhang, H. Y. Ling, L. Jiang, and H. Pu,\nPhys. Rev. A 75, 043603 (2007).\n[8] G. Drobný, I. Jex and V. Bužek, Phys. Rev. A 48, 569\n(1993).\n[9] K.-P. Marzlin and J. Audretsch, Phys. Rev. A 57, 1333\n(1998).\n[10] Y. R. Shen, The Principle of Nonlinear Optics (Wiley\nInterscience, New York, 1984).\n[11] M. L. Chiofalo, S. J. J. M. F. Kokkelmans, J. N. Milstein,\nand M. J. Holland, Phys. Rev. Lett. 88, 090402 (2002).\n[12] C. P. Search, W. Zhang, and P. Meystre, Phys. Rev. Lett.\n91, 190401 (2003).\n[13] A. V. Andreev, V. Gurarie, and L. Radzihovsky, Phys.\n\nWe thank Dr. Satyan Bhongale for useful discussions. HP acknowledges support from NSF, the Robert\nA. Welch Foundation (Grant No. C-1669), and the W. M.\nKeck Foundation, and HYL acknowledges support from\nNSF and ARO.\n\n[14]\n[15]\n[16]\n[17]\n[18]\n[19]\n[20]\n\n[21]\n[22]\n[23]\n[24]\n\nRev. Lett. 93, 130402 (2004); R. A. Barankov, and L. S.\nLevitov, Phys. Rev. Lett. 93, 130403 (2004).\nP. W. Anderson, Phys. Rev. 112, 1900 (1958).\nP.-G. de Gennes, Superconductivity of Metals and Alloys\n(Addison-Wesley, New York, 1989).\nL. Allen, and J. H. Eberly, Optical Resonance and TwoLevel Atoms (Wiley, New York, 1975).\nJ. D. Jackson, Classical Electrodynamics, 2nd ed. (Wiley,\nNew York, 1975).\nC. M. Bowden, and J. P. Dowling, Phys. Rev. A 47, 1247\n(1993).\nS.J.J.M.F. Kokkelmans, J. N. Milstein, M. L. Chiofalo,\nR. Walser, and M. J. Holland, Phys. Rev. A 65, 053617\n(2002).\nM. Houbiers, R. Ferwerda, H. T. C. Stoof, W. I.\nMcAlexander, C. A. Sackett, and R. G. Hulet, Phys. Rev.\nA 56, 4864 (1997).\nN. B. Abraham, L. A. Lugiato, P. Mandel, L. M. Narducci, and D. K. Bandy, J. Opt. Soc. Am. B 2, 35 (1985).\nL. M. Narducci and N. B. Abraham, Laser Physics and\nLaser Instabilities (World Scientific, New Jersey, 1988).\nA. Robertson, L. Jiang, H. Pu, W. Zhang, and H. Y. Ling\n, Phys. Rev. Lett. 99, 250404 (2007).\nK. E. Strecker, G. B. Partridge, and R. G. Hulet, Phys.\nRev. Lett. 91, 080406 (2003).\n\n\f"}