{"id": "http://arxiv.org/abs/1203.2342v3", "guidislink": true, "updated": "2012-09-08T13:25:15Z", "updated_parsed": [2012, 9, 8, 13, 25, 15, 5, 252, 0], "published": "2012-03-11T15:06:28Z", "published_parsed": [2012, 3, 11, 15, 6, 28, 6, 71, 0], "title": "Jets Plus Same-Sign Dileptons Signatures from Fermionic Leptoquarks at\n  the LHC", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1203.4534%2C1203.1089%2C1203.0290%2C1203.1288%2C1203.3364%2C1203.6048%2C1203.0684%2C1203.1718%2C1203.5530%2C1203.0810%2C1203.6828%2C1203.3147%2C1203.2248%2C1203.3883%2C1203.2841%2C1203.5994%2C1203.5891%2C1203.5725%2C1203.4458%2C1203.0696%2C1203.3552%2C1203.1809%2C1203.4249%2C1203.1554%2C1203.0723%2C1203.1253%2C1203.4294%2C1203.3800%2C1203.2789%2C1203.3465%2C1203.0697%2C1203.2790%2C1203.2220%2C1203.1927%2C1203.1861%2C1203.1871%2C1203.6307%2C1203.3243%2C1203.5020%2C1203.4562%2C1203.5886%2C1203.2793%2C1203.1256%2C1203.0423%2C1203.4921%2C1203.3038%2C1203.6183%2C1203.0411%2C1203.3303%2C1203.0362%2C1203.0140%2C1203.6098%2C1203.1124%2C1203.2785%2C1203.4167%2C1203.1834%2C1203.3611%2C1203.0842%2C1203.4462%2C1203.5597%2C1203.6769%2C1203.5798%2C1203.6222%2C1203.2342%2C1203.4878%2C1203.2588%2C1203.5748%2C1203.4388%2C1203.1418%2C1203.6721%2C1203.4435%2C1203.2894%2C1203.3161%2C1203.4791%2C1203.0720%2C1203.5334%2C1203.6142%2C1203.4488%2C1203.1664%2C1203.6717%2C1203.3916%2C1203.5108%2C1203.5414%2C1203.6698%2C1203.3382%2C1203.0277%2C1203.3342%2C1203.5335%2C1203.3571%2C1203.3417%2C1203.5521%2C1203.5222%2C1203.0610%2C1203.5172%2C1203.5641%2C1203.2649%2C1203.0449%2C1203.1363%2C1203.0705%2C1203.3280%2C1203.4950&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Jets Plus Same-Sign Dileptons Signatures from Fermionic Leptoquarks at\n  the LHC"}, "summary": "Within the 3-3-1 model framework, we consider the production and decay of\nfermionic leptoquarks into a striking experimental signature at the LHC: a\nnarrow resonance at the $b$ jet plus same-sign dileptons channel. The data\nalready accumulated by the LHC collaborations may hide a large number of events\nassociated to the production and decay of such exotic quarks, allowing one to\ninvestigate large portions of the parameters space of the model. The\nobservation or not of such events would shed light on the construction of\nmodels presenting heavy exotic quarks.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1203.4534%2C1203.1089%2C1203.0290%2C1203.1288%2C1203.3364%2C1203.6048%2C1203.0684%2C1203.1718%2C1203.5530%2C1203.0810%2C1203.6828%2C1203.3147%2C1203.2248%2C1203.3883%2C1203.2841%2C1203.5994%2C1203.5891%2C1203.5725%2C1203.4458%2C1203.0696%2C1203.3552%2C1203.1809%2C1203.4249%2C1203.1554%2C1203.0723%2C1203.1253%2C1203.4294%2C1203.3800%2C1203.2789%2C1203.3465%2C1203.0697%2C1203.2790%2C1203.2220%2C1203.1927%2C1203.1861%2C1203.1871%2C1203.6307%2C1203.3243%2C1203.5020%2C1203.4562%2C1203.5886%2C1203.2793%2C1203.1256%2C1203.0423%2C1203.4921%2C1203.3038%2C1203.6183%2C1203.0411%2C1203.3303%2C1203.0362%2C1203.0140%2C1203.6098%2C1203.1124%2C1203.2785%2C1203.4167%2C1203.1834%2C1203.3611%2C1203.0842%2C1203.4462%2C1203.5597%2C1203.6769%2C1203.5798%2C1203.6222%2C1203.2342%2C1203.4878%2C1203.2588%2C1203.5748%2C1203.4388%2C1203.1418%2C1203.6721%2C1203.4435%2C1203.2894%2C1203.3161%2C1203.4791%2C1203.0720%2C1203.5334%2C1203.6142%2C1203.4488%2C1203.1664%2C1203.6717%2C1203.3916%2C1203.5108%2C1203.5414%2C1203.6698%2C1203.3382%2C1203.0277%2C1203.3342%2C1203.5335%2C1203.3571%2C1203.3417%2C1203.5521%2C1203.5222%2C1203.0610%2C1203.5172%2C1203.5641%2C1203.2649%2C1203.0449%2C1203.1363%2C1203.0705%2C1203.3280%2C1203.4950&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Within the 3-3-1 model framework, we consider the production and decay of\nfermionic leptoquarks into a striking experimental signature at the LHC: a\nnarrow resonance at the $b$ jet plus same-sign dileptons channel. The data\nalready accumulated by the LHC collaborations may hide a large number of events\nassociated to the production and decay of such exotic quarks, allowing one to\ninvestigate large portions of the parameters space of the model. The\nobservation or not of such events would shed light on the construction of\nmodels presenting heavy exotic quarks."}, "authors": ["A. Alves", "E. Ramirez Barreto", "A. G. Dias"], "author_detail": {"name": "A. G. Dias"}, "author": "A. G. Dias", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1103/PhysRevD.86.055025", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1203.2342v3", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1203.2342v3", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "4 pages, 4 figures", "arxiv_primary_category": {"term": "hep-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "hep-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "hep-ex", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1203.2342v3", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1203.2342v3", "journal_reference": null, "doi": "10.1103/PhysRevD.86.055025", "fulltext": "Jets Plus Same-Sign Dileptons Signatures from Fermionic Leptoquarks at the LHC\nAlexandre Alves1 , E. Ramirez Barreto2 , A. G. Dias2\n1\n\narXiv:1203.2342v3 [hep-ph] 8 Sep 2012\n\n2\n\nUniversidade Federal de São Paulo, UNIFESP, Dep. de Ciências Exatas e da Terra, Diadema - SP 09972-270 Brasil,\nUniversidade Federal do ABC, UFABC, Centro de Ciências Naturais e Humanas, Santo André - SP, 09210-170, Brasil.\n(Dated: January 19, 2019)\nWithin the 3-3-1 model framework, we consider the production and decay of fermionic leptoquarks\ninto a striking experimental signature at the LHC: a narrow resonance at the b jet plus same-sign\ndileptons channel. The data already accumulated by the LHC collaborations may hide a large\nnumber of events associated to the production and decay of such exotic quarks, allowing one to\ninvestigate large portions of the parameters space of the model. The observation or not of such\nevents would shed light on the construction of models presenting heavy exotic quarks.\n\nThe hypothesis of the existence of new particles carrying two units of lepton number allows us to consider\nnew physical phenomena which can be quite notable, if\ntheir masses are within the actual testable TeV energy\nscale. The decay of such exotic particles would lead to\nsignatures that can not arise from any novel heavy states\nwhose quantum numbers are the same as the ones in the\nstandard model (SM). As a result, the signals would be\nalmost free from SM backgrounds.\nLet us consider the pair production process of\nfermionic leptoquarks, J, that carry both lepton and\nbaryon number (L, B) = (2, 1/3). If all interactions preserve these quantum numbers, the new quark may decay\ninto a vector (or scalar) (L, B) = (2, 0) bilepton plus a\nfermionic (L, B) = (0, 1/3) particle. For a SM quark in\nthe final state, the vector (or scalar) bilepton is constrained to decay into: (1) a pair of same-sign charged\nleptons, or (2) a charged lepton and a neutrino through\na fermion-flow-violating interaction. General information\non scalar and vector bileptons/leptoquarks can be found\nin Refs. [1], [2].\nUnder the above assumptions, a new colored heavy\nstate could be realized either with a electric charge −4/3\nor 5/3 (in units of the electron charge, e). The corresponding bileptons would have electric charge 1 and 2.\nWe call such bileptons of V and U , respectively. Now, if\nwe discard model-dependent Yukawa interactions and allow just gauge interactions, the bileptons are spin-1 particles.\nThis way, the fermionic leptoquark decays by means of\ncharged currents to a down- or up-type quark plus a U\nor V . Limiting the effects of the new sector to the thirdgeneration SM quarks and leptoquarks J3 , there are four\ndecay possibilities:\nJ3 (+5/3) → U ++ + b(−1/3) → l+ l+ + b\nJ3 (−4/3) → U\n\n−−\n+\n\n− −\n\n+ t(+2/3) → l l + t\n+\n\nJ3 (+5/3) → V + t(+2/3) → l ν l + t\nJ3 (−4/3) → V − + b(−1/3) → l− νl + b\n\n(1)\n(2)\n(3)\n(4)\n\nIn the third and fourth channels, the experimental signatures would be similar to a heavy top or bottom quark\n\npartner decay as proposed in new strong dynamics models or fourth-generation quark models [3], for example.\nHowever, in such models, V is not a bilepton, so the\nsearching for the doubly charged bileptons, from the first\nand second channels, would be a necessary step to decide\nwhich model would be favored by the data.\nA specific theoretical realization of leptoquarks and\nbileptons we deal with in this work arise as a part of\nthe particle spectrum of SM extensions based on the\nSU (3)C ⊗ SU (3)L ⊗ U (1)X gauge group, the 3-3-1 models. Within this class of models, the minimal 3-3-1 model\n[4] is a natural basis for constructions presenting a leptoquark J3 and bileptons U and V . These models are\nalso motivated by offering an explanation for the families\nnumber problem, and for constraining the electroweak\nmixing angle such that sin θW < 0.25. The phenomenology of the 3-3-1 models aiming the colliders has been\ndeveloped through the years [5]. Another interesting feature of the model is an enhanced Higgs boson decay into\nphotons that could explain the recent results of the experiments at the LHC concerning a Higgs boson with\nmass around ∼ 125 GeV, as shown in [6, 7].\nWe show in this letter that within the minimal 3-3-1\nmodel framework, a large number of events associated to\nthe production and decay of fermionic leptoquarks might\nhave been produced at the 7 TeV LHC with an almost\nnegligible level of background noise. We also investigate\nthe potential of the 14 TeV LHC to extend the discovery reach for fermionic leptoquarks of the 3-3-1 model.\nThe current amount of collected data would render the\ndiscovery of fermionic leptoquarks and doubly charged\nbileptons an easy task already, even for masses of order\nof TeV. If no events can be found, a prediction consistent\nwith the SM expectation, large portions of the parameters space of the proposed 3-3-1 model can be ruled out\nat a high confidence level.\nMoreover, ruling out the 3-3-1 model is a necessary\nstep to discriminate between alternative exotic quark\nmodels, for example, new strong dynamics, grand unified, superstring, or fourth-generation models [3]. As a\nfinal remark, we point out that existing bounds on scalar\n\n\f2\nand vector leptoquarks [2] do not apply to a fermionic\nleptoquark.\nIt has to be said that there are few other models containing fermionic leptoquarks [8]. But none of these models the leptoquarks are coupled to doubly charged vector\nbosons. In fact, such coupling is what leads to the distinct process we are proposing here.\nIn what follows, we present briefly the essential aspects\nof the 3-3-1 models. Then, we analyze the pair production and decay signal of leptoquarks, and finish with a\ndiscussion of our results.\n\nBRIEF REVIEW OF THE MODEL\n\nThe matter content of 3-3-1 models is defined in such\na way that gauge anomalies cancellation of the group\nSU (3)C ⊗ SU (2)L ⊗ U (1)Y involves all three fermionic\nfamilies. Different versions of the model can be constructed with this restriction. The matter content of\nthe minimal 3-3-1 model has three lepton triplets, each\none formed by the left-handed field of a neutrino, a\n′\ncharged lepton, and its antiparticle: Ψa ≡ (νa′ la′ lac )L ∼\n(3 − 1/3), where a = 1, 2, 3 is the family index; and the\nnumbers in parentheses refer to the transformation character under SU (3)L and U (1)X , respectively (we will\nomit the color group SU (3)C transformation character\nof the multiplets). The primes means the fields are not\nmass eigenstates. For the quarks, they form two antitriplets Qn ≡ (d′n , −u′n , jn′ )L ∼ (3∗ , − 31 ), and a triplet\nQ3 ≡ (u′3 , d′3 , J3 )L ∼ (3, 23 ) of left-handed fields; here,\nthe indices n = 1, 2 and 3 refer to the usual quark families, with the right-handed quarks fields forming the\nsinglets u′iR ∼ (1, 32 ), d′iR ∼ (1, − 31 ), jn′ R ∼ (1, − 34 ),\nJ3R ∼ (1, 53 ), where i = 1, 2, 3, jn′ R , and J3 are new\nquarks with electric charge −4/3 and 5/3, respectively.\nJ3 is the fermionic leptoquark we focus on this work.\nSpontaneous symmetry breaking and mass generation\ncan be implemented with three scalar triplets plus a sextet [4], or with just two scalar triplets [9]. We refer the\nreaders to those references for further details concerning\nthis point.\nBesides the SM gauge bosons, the model has five additional massive states: a neutral Z ′ , and the electrically\ncharged bileptons, V and U .\nFor our purposes the relevant new charged current interactions for the mass eigenstates are the following: one\nwhich involves the leptoquark J3 , the bottom quark b,\nand the bilepton U ±±\ng\nLbJU = − √ bγ μ (1 − γ 5 )J3 Uμ−− + H.c.,\n2 2\n\n(5)\n\nwhere g is the SU (2)L gauge coupling constant; and another one which involves the same bileptons and charged\nlepton fields in a purely pseudovectorial fermion-flow-vio-\n\nlating interaction\ng\nLllU = − √ lca γ μ γ 5 la Uμ++ + H.c.\n2 2\n\n(6)\n\nEquations (5) and (6) are the interactions leading to the\ngeneral decay in Eq. (1) and shown in Fig. 1.\nAn explanation is due now. The weak eigenstates\nb′ , s′ , d′ are linear combinations of the mass eigenstates\nb, s, d, so the branching ratio of the decay J3 → bU is, in\nfact, proportional to |Vbb′ |2 , the square of an element of\nthe rotation matrix of the down sector including the new\nquark. However, we are not demanding the flavor of jets\nto be identified. Our partonic simulation is not affected\nif we either fix Vbb′ = 1 and set the other elements to zero,\nor assume nonzero values for the other V ′ elements, as\nlong as we do not require any jet tagging.\nIn the leptoquarks production processes, besides the\nQCD, electromagnetic, and the neutral current interaction involving the equivalent of the SM Z boson, there are\nadditional contributions coming from new neutral current\ninteractions due to the Z ′ . In order to simplify our analysis, we assume that the vacuum expectation values of\nthe scalar fields, taken to break the symmetries, obey a\ncertain relation such that all neutral current couplings of\nknown particles are identical to the SM as presented in\nRef. [10]. Thus, the neutral currents involving Z and Z ′\nhave the form\n\u0001 \u0003\n\u0001\n\u0002\ng\nqγ μ gVq + gAq γ5 Zμ + fVq + fAq γ5 Zμ′ q\n2 cos θW\n(7)\nq\nThe respective vector, gVq , fVq , and axial, gA\n, fAq , couplings are shown in Appendix.\nL=\n\nPRODUCTION OF THE J3 LEPTOQUARK AND\nDISCOVERY ANALYSIS\n\nWe now consider the leptoquark pair production, J3 J ̄3 ,\nat the 7 and 14 TeV LHC. The J3 J ̄3 production occurs\nthrough two main processes via gauge interactions: (1)\nthe Drell-Yan process, involving the intermediation of the\nphoton, and the neutral gauge bosons Z, Z ′ , and (2) the\nQCD interactions, as shown in Fig. 1. In Fig. 2 we show\nthe total J3 J ̄3 production cross section, σtotal , as a sum\nof Drell-Yan via Z ′ , σZ ′ , and QCD contributions σQCD ,\nfor a fixed Z ′ mass of 1.1 TeV. Cross sections of order of\npicobarns are typical for J3 masses below ∼ 500 GeV.\nEven for TeV masses, cross sections in the femtobarn\nrange are expected at the 7 and 14 TeV LHC.\nFor a light J3 the major contribution comes from QCD\ninteractions, due the large initial state gluon luminosity.\nHowever, as the J3 mass increases, the σZ ′ contribution\nturns out to be dominant, as the gluon luminosity decreases steeply. This is also the outcome of a very peculiar feature of the model – the J3 coupling to the Z ′ is\n\n\f3\nq\n\nJ3\nγ, Z, Z\n\nJ3\n\nσ[pb]\n\nq\n\ng\n\n′\n\n10 2\n\nLHC @ 7TeV\nMZ' = 1100 GeV\n\nσtotal\n10\n\nq̄\n\nJ ̄3\n\ng\n\nJ3\n\nσZ'\n\nJ ̄3\n\nq̄\ng\n\nJ3\n\n1\n\ng\nJ3\nJ ̄3\n\ng\n\n10\nJ ̄3\n\ng\n\n10\n\n-1\n\nσQCD\n\n-2\n\n(a)\nl+\n\n10\nl\n\nU ++\n\n-3\n\n200\n\n+\n\n300\n\n400\n\n500\n\n600\n\n700\n\n800\n\n900 1000\n\nMJ3 [GeV]\n\nJ3\n\nFigure 2. Total cross section and the partial contributions\nfrom the Z ′ and QCD for the J3 pair production at the 7 TeV\nLHC.\n\nb\n(b)\n\nFigure 1. The Feynman diagrams for (a) the exotic quark pair\nproduction from Drell-Yan processes and QCD interactions,\nand (b) its decays involving the final particles.\n\n√\nlarge due a factor 1/ 1 − 4 sw2 , as shown in the preceding section. Contributions from photons and Z bosons\nare very small compared to the Z ′ contribution.\nBesides the decay involving the double charged bilepton plus bottom quark, J3 has another possible decay\nchannel: the singly charged bilepton V plus a top quark.\nWe show in Fig. 3 the branching ratios of J3 → V t and\nJ3 → U b decays as a function of Z ′ mass, fixing the J3\nmass. The channel J3 → U b dominates from small to\nlarge leptoquark masses. The U b channel leads to a fully\nreconstructable final state presenting sharp resonances in\nthe same-sign dileptons channel, associated to the U decay, and in the same-sign dilepton plus a bottom jet, from\nthe J3 decay. Detecting these events is decisive to discriminate between competing models presenting exotic\nquarks.\nFinally, we call the attention to the fact that the leptoquark J3 can couple also to single and doubly charged\nscalars allowing additional decay channels. However,\nthese new branching ratios are very tiny (around 1%) because the couplings between J3 and the scalars are proportional to the ratio of the quark bottom mass and a\ncombination of the vacuum expectation values of order\n1 TeV. Thus, the new channels involving scalars do not\ncontribute to our analysis for the fermionic leptoquarks.\nThe decay to V t would give rise to at least two hard leptons, jets and missing energy after the top quark decays.\nDespite its very distinctive signature, it is not possible to\nreconstruct the V four momenta due the escaping neutrinos.\nThe leptoquark signature that emerges from the J3\npair production and decay into a U ±± b(b̄) channel is\npp → J3 J ̄3 → bb̄ l+ l+ l′− l′− .\n\n(8)\n\nWe do not demand the tagging of the bottom\nquark jet, so we propose the search for the inclu-\n\nsive l+ l+ l′− l′− (l, l′ = e, μ) plus two hard jets\nevents. We use the CompHep package [11], adopting the CTEQ6L parton distribution functions [12],\nwith renormalization/factorization scales fixed at the\nexotic quark mass, to compute the signal and 3-3-1\nbackgrounds cross sections. The irreducible SM background, l+ l+ l′− l′− jj (l, l′ = e, μ), was computed with\nthe MadGraph/MadEvent package [13] also adopting\nthe CTEQ6L parton distribution functions and fixing\nthe renormalization/factorization\nscale at the partonic\n√\ncenter-of-mass energy, ŝ.\nFor trigger and identification purposes we adopted the\nfollowing cuts on the final state particles\npT (l) ≥ 20 GeV, pT (j) ≥ 30 GeV, |ηl, j | ≤ 2.5 ,\n∆ Rll ≥ 0.2 ,\n∆ Rjj ≥ 0.4 ,\n∆ Rjl ≥ 0.4\n(9)\nThe SM backgrounds are quite small after imposing\nthis set of acceptance cuts at both the 7 and the 14 TeV\nLHC. The main 3-3-1 backgrounds come from the production of a Z ′ decaying to U ++ U −− plus a pair of jets\nfrom QCD radiation or a neutral gauge boson decay. To\nfurther suppress these and the SM backgrounds we impose the following cut on the invariant mass of the hardest jets pair:\nMjj ≥ 120 GeV.\n\n(10)\n\nAfter applying this cut, the SM backgrounds are negligible while the signal to 3-3-1 background ratio is huge.\nWe performed all analysis at the partonic level and do not\ninclude any detector effects. No K factors for QCD corrections were included either. This approach is reliable\nin this case once the signal identification poses no problems, due the almost complete lack of background events.\nNotwithstanding, a complete study including hadronization and detector effects is desirable to evaluate the impact of the extra QCD radiation in the identification of\nthe resonant structure arising from the leptoquark decay.\nIn the Fig. 4 we show the expected number of events\nfor the signal in the mZ ′ versus mJ3 plane for a fixed\n\n\f4\n\n100\n\nMJ3 = 600 GeV\n\n1400\n5\n\n1300\n\n80\n++\n\n60\n\nU\n\nmJ3@GeVD\n\nBranching ratio (%)\n\n1500\n\nb\n\n1200\n\n25\n\n1100\n\n40\n+\n\n50\n\nV t\n1000\n\n20\n1500\n\n2000\n\n2500\n\n3000\n\nMZ' [GeV]\n\n100\n\n900\n1500\n\n2000\n\n2500\n\n3000\n\nmZ'@GeVD\n\n100\n\nMJ3 = 1200 GeV\n2200\n\n80\n\n5\n\n2000\n\n60\n\n++\n\nU\n\nmJ3@GeVD\n\nBranching ratio (%)\n\n1000\n\nb\n\n25\n\n1800\n\n+\n\nV t\n\n40\n\n50\n\n1600\n\n20\n1000\n\n1500\n\n2000\n\n2500\n\n100\n\n3000\n\nMZ' [GeV]\n\nFigure 3. The branching ratios for the exotic quark J3 decay\ninto V t and U b channels as function of the Z ′ mass. In the\nupper(lower) panel we show the branching ratios for a fixed\nMJ 3 of 600(1200) GeV.\n\nL = 5 fb−1 of integrated luminosity at the 7 TeV LHC\n(upper panel) and L = 20 fb−1 of integrated luminosity\nat the 14 TeV LHC (lower panel).\nTo understand the shape of the contour lines for the 7\nTeV LHC, note that an increase in the number of events\noccurs along the direction of the slope mZ ′ = 2mJ3 ,\nwhere the leptoquarks are produced on their mass shell.\nOn the other hand, as the cross section decreases very\nsteeply with the J3 mass for a fixed Z ′ mass, as we\ncan see in Fig. 2, the number of events drops quickly\nas the Z ′ becomes heavier. The left border of the plot\ncan be understood, in its turn, as a consequence of\nthe cut imposed on Mjj , which is bounded by Mjj ≤\np\nm2Z ′ − 2m2U ≈ 0.9mZ ′ . Because a candidate event\nmust have Mjj > 120 GeV, the lighter the new neutral bosons are, the smaller is the phase space left for\nhard jets production, which leads to a suppression in the\nnumber of events in this regime.\nThe lower panel shows the left border for the 14 TeV\nLHC actually. We see that as mZ ′ increases, for a fixed\nJ3 mass, the number of events gets larger and will find a\nmaximum for on shell production of J3 pairs, the same\nbehavior observed in the upper panel.\nMore interestingly, the Fig. 4 shows that TeV masses\n\n1400\n1800\n\n500\n\n2000\n\n2200\n\n2400\n\n2600\n\n2800\n\n3000\n\nmZ'@GeVD\nFigure 4. Upper panel: the contour lines represent the number of events expected for a fixed 5 fb−1 of integrated luminosity at the 7 TeV LHC in the mZ ′ versus mJ3 plane. Lower\npanel: the same, this time for 20 fb−1 and at the 14 TeV LHC.\n\nare easily accessible at the LHC. The discovery of\nfermionic leptoquarks can be achieved up to ∼ 1.2 TeV\nfor a very broad mass range for Z ′ bosons. In the absence\nof events, 1.3–1.4 TeV leptoquarks can be ruled out almost disregarded the Z ′ masses. Note that there would\nnot be any other parameter dependence for the exclusion\nregion. Placing limits in the mZ ′ versus mJ3 plane would\nconstrain the model in a straightforward manner.\nAt the 14 TeV LHC, the discovery region extends considerably, as can be seen at the lower panel of Fig. 4.\nWith only 20 fb−1 , leptoquark masses up to ∼ 2 TeV\ncan be probed even for very heavy Z ′ bosons. Again, if\nno bb̄ l+ l+ l′− l′− events are observed, multi-TeV limits\ncan be imposed on the fermionic leptoquarks considered\nhere.\nIt is shown in Ref. [7] that the 3-3-1 models can naturally explain the observed enhancement to diphoton decays of the recently discovered boson at the 8 TeV LHC.\nIn order to match the observed signal strength of diphoton signals within the 1σ error band, the new charged\ngauge bosons must have masses in the ∼ 200–800 GeV\nrange. In terms of the Z ′ masses, this corresponds to\n\n\f5\n\nCONCLUSIONS\n\nFermionic leptoquarks and doubly charged gauge\nbosons are two types of exotic particles predicted in the\nminimal version of 3-3-1 models. The fermionic leptoquark J3 is, in fact, an incarnation of a new heavy quark\nwith electric charge 5/3 carrying a nonvanishing lepton\nnumber.\nThe high production cross section of J3 J ̄3 pairs, a high\nbranching ratio of the leptoquark into same-sign dileptons plus a jet, and an almost negligible level of back-\n\ndσ/dMll[pb/GeV]\n\n10 4\n\n√s = 7 TeV\nMZ' = 600 GeV\nMZ' = 1100 GeV\n\nMZ' = 1500 GeV\n\n10 3\n\n100\n\ndσ/dMllb[pb/GeV]\n\n∼ 715–2900 GeV from Eq. (14) in Appendix. As at the\n8 TeV LHC we should expect a reach somewhat larger\nthan that depicted in Fig. 4, we conclude that the doubly charged gauge boson, which would be also responsible\nfor the diphoton enhancement, could be easily discovered\nfor leptoquark masses up to ∼ 1.2 TeV at the 8 TeV LHC.\nWe should point out that the Tevatron and LHC limits\non Z ′ → l+ l− [14] do not apply to our case once the assumption of a narrow width does not hold. For example,\nfor a 1100 GeV Z ′ , the total width is ΓZ ′ = 340 GeV.\nIn the Figure 5 we show the invariant mass distributions of a pair of same-sign dileptons, associated to the\nU bilepton decay, and the jet plus same-sign dileptons,\nassociated to the J3 decay chain. The sharp resonant\nstructures in the Mll and Mjll invariant mass distributions can be clearly identified as a signal of the production\nand decay of fermionic leptoquarks. Not only the exotic\nquarks, but also the doubly charged gauge boson shows\nitself in a tall sharp resonance.\nAnother important point to stress is the weaker model\ndependence of the J3 decays compared to the models\npredicting scalar and vector leptoquarks. The fermionic\nleptoquarks from the minimal 3-3-1 model have just two\npossible decay channels as discussed before. One of these\ninvolves the bilepton gauge boson which, in its turn, decays exclusively into same-sign dileptons through gauge\ninteractions. On the other hand, usual scalar and vector\nleptoquarks may decay to a pair of charged leptons and\nneutrinos, jets and charged and neutral leptons, and even\nto jet pairs, if they break baryon number conservation,\nas in the general R-parity-breaking supersymmetry [2].\nMoreover, in the case of scalar leptoquarks, a free\nYukawa parameter is additionally involved in the leptoquark decay [1], while the couplings of general vector\nleptoquarks to quark or lepton pairs may not be fixed by\nthe gauge principle [1].\nIt is beyond the scope of our work to make a detailed\nanalysis comparing the discovery prospects for scalar,\nvector, and fermionic leptoquarks. However, based on\nour results we believe it is much easier to establish the\nexistence or not of fermionic leptoquarks compared to\nthe spin-0 and spin-1 cases in a search for lepton-jet resonances.\n\n150\n\n200\n\n250\n\n300\n\n350\n\n400\n\n450\n\n500\n\nMll[GeV]\n\n√s = 7 TeV\n\n10 3\n\n10 2\n\n200\n\n300\n\n400\n\n500\n\n600\n\n700\n\n800\n\n900 1000\n\nMllb[GeV]\n\nFigure 5. Upper panel: same-sign dilepton pair invariant mass\ndistribution for three representative Z ′ masses at the 7 TeV\nLHC. Lower panel: invariant mass of a jet plus same-sign\ndileptons corresponding to a 300(500)(800) GeV J3 mass.\n\nground events associated to the final state topology, may\nlead to an immediate discovery of these new particles at\nthe 7 TeV LHC even for masses of order of TeV. At the\n14 TeV LHC the picture is even brighter, and a large portion of the parameter space of the model can be probed\neven for very heavy new states.\nBased on our results, we believe it is much easier to\nestablish the existence or not of fermionic leptoquarks as\ncompared to their scalar and vector realizations of same\nmass, recalling that the production and decay of these\nfermionic leptoquarks occur, exclusively, through gauge\ninteractions.\nWe finish by calling attention to the large potential\nthe LHC has to test the channel for leptoquark decay we\npropose here. The experimental search for the signature\nwe study in this work is worthwhile not only for probing\nthe minimal 3-3-1 model, but also for constraining the\nway other gauge extensions of the SM for physics at the\nTeV scale can be constructed including or not a vector\nbilepton and exotic quarks.\nThe authors thank FAPESP and CNPq for supporting\nthis work.\n\n\f6\nAppendix\n\nThe couplings for the ordinary quarks and the Z are\nthe same from the SM. On the other hand, the couplings\nbetween the new quarks and the Z have only vectorial\ncharacter. Thus\n\ngVj1 = gVj2 = 83 sw2 ,\n\n2\ngVJ3 = − 10\n3 sw\n\n(11)\n\nwith sw2 = sin2 θW The vector and the axial couplings\nbetween the u-type quarks and the Z ′ are:\n1 − 6sin2 θW\nfVu = fVc = √\n,\n2 3 − 12 sw2\n1 + 2sin2 θW\nfAu = fAc = √\n2 3 − 12 sw2\n1 + 4 sw2\n1 p\nfVt = − √\n1 − 4sw2 (12)\n, fAt = − √\n2 3\n2 3 − 12 sw2\nand for the d-type quarks\n\n1\n,\nfVd = fVs = √\n2 3 − 12 sw2\n1 p\nfAd = fAs = √\n1 − 4sw2\n2 3\n1 + 2sw2\n1 − 2sw2\n, fAb = − √\nfVb = − √\n2 3 − 12 sw2\n2 3 − 12 sw2\n\n1 − 9 sw2\n1 − sw2\nfVjm = − √\n, fAjm = − √\n3 − 12 sw2\n3 − 12 sw2\n2\n1 − 11 sw\n1 − sw2\nfVJ = √\n, fAJ = √\n(13)\n3 − 12 sw2\n3 − 12 sw2\n\nMasses of the new gauge bosons\n\nFor the new gauge bosons, U ±± , V ± , and Z ′ , the following mass relation is verified [10]:\n√\n3 − 12 sw2\nMV = MU =\nMZ ′\n2 cw\n\n(14)\n\n[1] For a detailed review on bileptons and leptoquarks, see\nFrank Cuypers and Sacha Davidson, Eur.Phys.J. C2 503,\n(1998); Miriam Leurer, Phys.Rev. D49, 333 (1994); D.E.\nAcosta and Susan K. Blessing, Ann.Rev.Nucl.Part.Sci.\n49, 389 (1999).\n[2] K. Nakamura et al. (Particle Data Group), J. Phys. G\n37, 075021 (2010).\n[3] R. Contino, T. Kramer, M. Son, and R. Sundrum, JHEP 0705, 074 (2007) [hep-ph/0612180]; R.\nContino and G. Servant, JHEP 0806, 026 (2008)\n[arXiv:0801.1679]; E. Halyo, Phys. Lett. B 326, 251\n(1994) [hep-ph/9312263]; B. Bajc and G. Senjanovic,\nJHEP 0708, 014 (2007) [hep-ph/0612029]; G. Burdman,\nL. da Rold, O. Éboli, and R. D. Matheus, Phys. Rev. D\n79, 075026 (2009) [arXiv:0812.0368].\n[4] F. Pisano and V. Pleitez, Phys. Rev. D 46, 410 (1992)\n[hep-ph/9206242]; P. H. Frampton, Phys. Rev. Lett. 69,\n2889 (1992).\n[5] B. Dion, T. Grégoire, D. London, L. Marleau,\nand H. Nadeau, Phys. Rev. D 59, 075006 (1999)\n[hep-ph/9810534]; E. M. Gregores, A. Gusso, and\nS. F. Novaes, Phys. Rev. D 64, 015004 (2001)\n[hep-ph/0101048]; P. H. Frampton and A. Rasin, Phys.\nLett. B 482, 129 (2000) [hep-ph/0002135]; E. R. Barreto,\nY. A. Coutinho and J. S. Borges, Phys. Lett. B 632 675\n(2006) [hep-ph/0509355]; ibid. Phys. Rev. D 83, 075001\n(2011) [arXiv:1103.1267]; B. Meirose and A. A. Nepomuceno, Phys. Rev. D84, 055002 (2011) [arXiv:1105.6299].\n[6] A. Alves, E. R. Barreto, A. G. Dias, F. S. Queiroz, C. A.\nPires, P. S. R. da Silva, Phys. Rev. D 84, 115004 (2011)\n[arXiv:1109.0238 [hep-ph]].\n[7] A. Alves, E. R. Barreto, A. G. Dias, F. S. Queiroz, C. A.\nPires, P. S. R. da Silva, arXiv:1207.3966 [hep-ph].\n[8] S. Khalil, Hye-Sung Lee, and E. Ma, Phys. Rev.\nD79, 041701 (2009) [arXiv:0901.0981 [hep-ph]]; P.\nV. Dong, H. N. Long, Phys. Rev. D 77, 057302 (2008)\n[arXiv:0801.4196 [hep-ph]].\n[9] J. G. Ferreira Jr, P. R. D. Pinheiro, C. A. Pires,\nP. S. R. da Silva, Phys. Rev. D 84, 095019 (2011)\n[arXiv:1109.0031 [hep-ph]].\n[10] A. G. Dias, J. C. Montero, V. Pleitez, Phys. Lett. B\n637, 85 (2006) [hep-ph/0511084], ibid. Phys. Rev. D 73,\n113004 (2006) [hep-ph/0605051].\n[11] E. Boos et al., [CompHEP Collaboration], Nucl. Instrum.\nMeth. A 534, 250 (2004).\n[12] J. Pumplin et al., JHEP 0602, 032 (2006)\n[hep-ph/0512167].\n[13] J. Alwall et al., JHEP 0709, 028 (2007) [arXiv:0706.2334\n[hep-ph]].\n[14] D0 Collaboration, Phys. Lett. B 695 [arXiv:1008.2023\n[hep-ex]], 88 (2011); CMS collaboration, Phys. Lett.\nB 704, 123 (2011) [arXiv:1107.4771 [hep-ex]]; ibid.\nJHEP 1105, 093 (2011) [arXiv:1103.0981 [hep-ex]]; ATLAS collaboration, Phys.Rev.Lett. 107, 272002 (2011)\n[arXiv:1108.1582 [hep-ex]].\n\n\f"}