{"id": "http://arxiv.org/abs/0912.3793v1", "guidislink": true, "updated": "2009-12-18T20:59:01Z", "updated_parsed": [2009, 12, 18, 20, 59, 1, 4, 352, 0], "published": "2009-12-18T20:59:01Z", "published_parsed": [2009, 12, 18, 20, 59, 1, 4, 352, 0], "title": "Formation of a mesa shaped phonon pulse in superfluid $^4$He", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0912.1338%2C0912.4307%2C0912.0322%2C0912.1562%2C0912.2428%2C0912.3441%2C0912.0143%2C0912.5449%2C0912.0186%2C0912.4491%2C0912.3958%2C0912.3431%2C0912.5340%2C0912.1023%2C0912.3437%2C0912.1114%2C0912.1164%2C0912.2137%2C0912.3842%2C0912.5196%2C0912.4648%2C0912.2567%2C0912.1813%2C0912.0426%2C0912.5174%2C0912.2562%2C0912.4820%2C0912.2380%2C0912.0683%2C0912.4565%2C0912.3903%2C0912.0095%2C0912.3513%2C0912.1265%2C0912.0380%2C0912.4076%2C0912.3503%2C0912.0784%2C0912.1830%2C0912.4310%2C0912.0029%2C0912.4773%2C0912.1446%2C0912.0003%2C0912.4193%2C0912.3517%2C0912.1773%2C0912.4188%2C0912.3793%2C0912.3428%2C0912.0440%2C0912.4632%2C0912.4944%2C0912.0068%2C0912.1525%2C0912.1055%2C0912.1819%2C0912.2084%2C0912.2331%2C0912.4578%2C0912.3707%2C0912.4671%2C0912.2541%2C0912.0956%2C0912.2221%2C0912.1628%2C0912.2167%2C0912.4587%2C0912.2745%2C0912.3576%2C0912.4665%2C0912.1179%2C0912.4945%2C0912.3952%2C0912.2829%2C0912.0411%2C0912.0766%2C0912.2059%2C0912.3971%2C0912.5474%2C0912.3014%2C0912.2757%2C0912.2708%2C0912.0648%2C0912.3217%2C0912.4792%2C0912.2700%2C0912.0518%2C0912.1665%2C0912.5253%2C0912.1004%2C0912.0783%2C0912.1581%2C0912.4192%2C0912.4543%2C0912.1818%2C0912.0165%2C0912.4979%2C0912.5485%2C0912.5470%2C0912.0729&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Formation of a mesa shaped phonon pulse in superfluid $^4$He"}, "summary": "We present a theory for the formation of a mesa shaped phonon pulse in\nsuperfluid $^4$He. Starting from the hydrodynamic equations of superfluid\nhelium, we obtain the system of equations which describe the evolution of\nstrongly anisotropic phonon systems. Such systems can be created\nexperimentally. The solution of the equations are simple waves, which\ncorrespond to second sound in the moving phonon pulse. Using these exact\nsolutions, we describe the expansion of phonon pulses in superfluid helium at\nzero temperature. This theory gives an explanation for the mesa shape observed\nin the measured phonon angular distributions. Almost all dependencies of the\nmesa shape on the system parameters can be qualitatively understood.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0912.1338%2C0912.4307%2C0912.0322%2C0912.1562%2C0912.2428%2C0912.3441%2C0912.0143%2C0912.5449%2C0912.0186%2C0912.4491%2C0912.3958%2C0912.3431%2C0912.5340%2C0912.1023%2C0912.3437%2C0912.1114%2C0912.1164%2C0912.2137%2C0912.3842%2C0912.5196%2C0912.4648%2C0912.2567%2C0912.1813%2C0912.0426%2C0912.5174%2C0912.2562%2C0912.4820%2C0912.2380%2C0912.0683%2C0912.4565%2C0912.3903%2C0912.0095%2C0912.3513%2C0912.1265%2C0912.0380%2C0912.4076%2C0912.3503%2C0912.0784%2C0912.1830%2C0912.4310%2C0912.0029%2C0912.4773%2C0912.1446%2C0912.0003%2C0912.4193%2C0912.3517%2C0912.1773%2C0912.4188%2C0912.3793%2C0912.3428%2C0912.0440%2C0912.4632%2C0912.4944%2C0912.0068%2C0912.1525%2C0912.1055%2C0912.1819%2C0912.2084%2C0912.2331%2C0912.4578%2C0912.3707%2C0912.4671%2C0912.2541%2C0912.0956%2C0912.2221%2C0912.1628%2C0912.2167%2C0912.4587%2C0912.2745%2C0912.3576%2C0912.4665%2C0912.1179%2C0912.4945%2C0912.3952%2C0912.2829%2C0912.0411%2C0912.0766%2C0912.2059%2C0912.3971%2C0912.5474%2C0912.3014%2C0912.2757%2C0912.2708%2C0912.0648%2C0912.3217%2C0912.4792%2C0912.2700%2C0912.0518%2C0912.1665%2C0912.5253%2C0912.1004%2C0912.0783%2C0912.1581%2C0912.4192%2C0912.4543%2C0912.1818%2C0912.0165%2C0912.4979%2C0912.5485%2C0912.5470%2C0912.0729&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We present a theory for the formation of a mesa shaped phonon pulse in\nsuperfluid $^4$He. Starting from the hydrodynamic equations of superfluid\nhelium, we obtain the system of equations which describe the evolution of\nstrongly anisotropic phonon systems. Such systems can be created\nexperimentally. The solution of the equations are simple waves, which\ncorrespond to second sound in the moving phonon pulse. Using these exact\nsolutions, we describe the expansion of phonon pulses in superfluid helium at\nzero temperature. This theory gives an explanation for the mesa shape observed\nin the measured phonon angular distributions. Almost all dependencies of the\nmesa shape on the system parameters can be qualitatively understood."}, "authors": ["I. N. Adamenko", "K. E. Nemchenko", "V. A. Slipko"], "author_detail": {"name": "V. A. Slipko"}, "author": "V. A. Slipko", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1007/s10909-010-0157-8", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/0912.3793v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0912.3793v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "29 pages, 13 figures", "arxiv_primary_category": {"term": "cond-mat.other", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cond-mat.other", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0912.3793v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0912.3793v1", "journal_reference": "Journal of Low Temperature Physics 159 (2010)", "doi": "10.1007/s10909-010-0157-8", "fulltext": "arXiv:0912.3793v1 [cond-mat.other] 18 Dec 2009\n\nFormation of a mesa shaped phonon pulse in\nsuperfluid 4He\nI.N. Adamenko, K.E. Nemchenko, and V.A. Slipko\nV.N. Karazin Kharkov National University, 61077, Ukraine\nNovember 10, 2018\nE-mail: valery.slipko@gmail.com\nAbstract\nWe present a theory for the formation of a mesa shaped phonon\npulse in superfluid 4 He. Starting from the hydrodynamic equations\nof superfluid helium, we obtain the system of equations which describe the evolution of strongly anisotropic phonon systems. Such\nsystems can be created experimentally. The solution of the equations\nare simple waves, which correspond to second sound in the moving\nphonon pulse. Using these exact solutions, we describe the expansion\nof phonon pulses in superfluid helium at zero temperature. This theory gives an explanation for the mesa shape observed in the measured\nphonon angular distributions. Almost all dependencies of the mesa\nshape on the system parameters can be qualitatively understood.\n\n1\n\nIntroduction\n\nIt is at present, impossible to create in superfluid helium, a constant relative\nvelocity, w, between the normal and superfluid which is close to the Landau\ncritical velocity. However phonon pulses can be created, which are pulses of\nnormal fluid moving through the stationary superfluid with a high relative\nvelocity, without superfluidity breaking down [1, 2, 3, 4, 5]. These pulses are\ntp = 10−5 − 10−7 s, long.\nIn experiments [1]-[5] a heater is immersed in superfluid helium at ∼50\nmK. A current pulse, applied to the heater, creates a moving phonon system in the stationary superfluid. The initial transverse and longitudinal\ndimensions of such a phonon system is determined by the heater size and the\n1\n\n\fduration of the current pulse respectively. Then the phonon system starts\nto expand as it moves in the superfluid helium. There are two very different\nregimes of such evolution. At pressure above 19 bar phonons propagate almost without scattering. So there is ballistic propagation. In this case, the\nphonon energy has an angular distribution with a characteristic cosine dependence. At lower pressures, the phonons strongly interact by three phonon\nprocesses. These are prohibited by the phonon energy-momentum conservation laws at pressure above 19 bar. Therefore at low pressures there can be\na hydrodynamic regime, when phonon system expands in \"phonon vacuum\"\nin a way similar to the ordinary expansion of a gas into a vacuum.\nIn a recent paper [5] detailed measurements of the angular distributions of\nthe energy in the phonon pulse were reported at zero pressure. The measurements were made at different distances from the heater, with various heater\nsizes and heater powers. The results showed a notable feature; the angular\ndependence of the energy flux has a flat top, and concave steep sides. In\n[5] this kind of distribution was called a mesa shape. Such a phonon energy\ndistributions cannot occur in the ballistic regime. In this case we would have\ncosine-like convex angular distribution, as it follows both from experiments\nat high enough pressure and from theoretical considerations (Lambert's law).\nAt zero pressure we have, despite the assumptions made in the theoretical\nmodel in [5], a hydrodynamic regime due to three phonon processes in the\nwings of the angular distribution, where the phonon density is sufficiently\nhigh, as well as in the centre of the pulse. The dependencies of the mesa\nwidth and height on various parameters, obtained in [5], are nontrivial. So\nthe hydrodynamic propagation of phonon systems in superfluid helium is an\nimportant problem.\nTo choose a method of theoretically analysing the phonon pulse expansion\nin superfluid helium, we should take into account that in experiments [2, 3, 4,\n5] the phonon pulse duration is much greater than the time to attain a local\nequilibrium. Therefore there is a dynamic equilibrium which arises mainly\ndue to scattering by three phonon processes, which have a characteristic\ntime t3pp ∼ 10−8s [6]. This applies to the experimental conditions [2, 3,\n4, 5]. Fast relaxation has been observed directly in the experiments with\ncolliding phonon pulses [7]. There is further evidence from the fact that a\nphonon pulse propagates in superfluid helium as a whole, with a velocity\nwhich is experimentally indistinguishable from the Landau critical velocity\nfor phonons. For phonons with a linear energy-momentum relation, ε(p) =\ncp, the Landau critical velocity is equal to c [8].\nThus the strong three-phonon scattering, within a pulse comprised of low\nenergy phonons in liquid helium at 0 bar, leads to a quasi equilibrium. The\nequilibrium state of the phonons can be defined in terms of a temperature\n2\n\n\fand a drift velocity, which means we can use a hydrodynamic approach to\ndescribe the dynamics of the phonon pulse.\nAnother feature of such phonon systems is that the energy density in\nthe phonon pulse is much larger than the ambient phonon energy density in\nsuperfluid helium. Therefore the evolution of a strongly anisotropic phonon\nsystem is essentially nonlinear. Nonlinear waves in superfluid helium, when\nw is small, have been studied for many years, but the analysis of nonlinear\nwaves at arbitrary w has not been done until now. The first such analysis was\nmade in Ref. [9], where the phonon pulse evolution were studied by using the\nBose-cone model for the phonon distribution function. There, the nonlinear\nequations of gas-dynamic type for the parameters of the Bose-cone model\nwere obtained. These equations were solved for one dimensional transverse\nand longitudinal evolution of a phonon pulse. In [10] and [11] the more\nreasonable Bose-Einstein phonon distribution function was used instead of\nthe Bose-cone distribution. But the approximate theories developed in these\npapers only allowed us to study phonon evolution which was near to the\ninitial state (see [11]). The question of the mesa shaped angular distribution\ndid not even occur in [10] and [11], because this phenomenon was only fully\ninvestigated recently [5].\nIn the present paper we rigorously solve the problem of phonon pulse\nexpansion into the \"superfluid vacuum\" of helium. This gives a physical\nexplanation of the mesa shape formation and the nontrivial dependencies of\nthe mesa width and height on various parameters.\nIn Sec. II we obtain the nonlinear equations, which describes the evolution\nof phonon systems created by thermal pulses in superfluid helium. In Sec. III\nwe find explicitly the family of exact solutions of these equations. They are\nthe simple waves, which correspond to the second sound modes in phonon\nsystems. In Sec. IV these exact solutions are used to describe the first\nstage of the expansion of a phonon layer in superfluid helium, when only the\nincident waves exist. Here we find the expansion velocity of a phonon pulse\ninto the \"phonon vacuum\", i.e. into superfluid helium with zero temperature.\nThe second stage of the expansion of the phonon layer, when reflected waves\nare formed, are studied in Sec. V. Here we develop an approximate method\nto describe the reflected wave, which allows us to find the average energy\ndensity and the width of the reflected wave. In Sec. VI by using the theory\npresented in this paper we give qualitative explanations of some experimental\ndata from Ref. ([5]). Conclusions are drawn in Sec. VII.\n\n3\n\n\f2\n\nEquations for the evolution of a phonon\nsystem in the hydrodynamic approximation\n\nTo describe the evolution of a phonon system in superfluid helium, we start\nfrom the well-known two-fluid hydrodynamic equations in the non-dissipative\napproximation [12, 13]:\n∂ρ\n+ div(ρn vn + ρs vs ) = 0;\n∂t\n\n(1)\n\n∂S\n+ div(Svn ) = 0;\n∂t\n\n(2)\n\n∂vs\n+ ∇μ + (vs ∇)vs = 0;\n(3)\n∂t\n∂Ai\n∂T\n∂vnk\n+ (vn ∇)Ai = −\n− Ak\n.\n(4)\n∂t\n∂xi\n∂xi\nHere ρ is the density of helium; ρn and ρs are densities of the normal and\nsuperfluid components respectively; vn and vs are velocities of normal and\nsuperfluid components respectively; S is the entropy of unit of volume; μ is\nthe chemical potential of unit of mass of helium; A = ρn w/S; w = vn − vs is\nthe relative velocity of the normal and superfluid components; T is temperature. Summation over twice repeated indices k is implied in Eq. (4). Eqs.\n(1) and (2) express the conservation of mass and entropy respectively, Eq.\n(3) expresses the acceleration of the superfluid and Eq. (4) is a combination\nof momentum conservation and other conservation laws.\nIn the experiments of Refs. [1]-[5], phonon systems were created by a\nheater immersed in superfluid helium. The temperature of the liquid helium\nwas ∼ 50 mK. At this temperature, the ambient thermal excitations can be\nneglected. The power of the applied heat pulses was such that the normal\ndensity ρn was very small, ρn ≪ ρ. In this case the superfluid velocity and\nvariations of pressure can be neglected when we study phonon propagation\n[14]. Taking into account the approximate relation vn = w + vs ≈ w in Eqs.\n(2) and (4), we obtain the system of equations which describes the evolution\nof a phonon system:\n∂S\n+ div(Sw) = 0;\n(5)\n∂t\n\u0013\u0010\n\u0012\nρn \u0011\nρn\n∂\n+ (w∇)\nw = −∇T −\n∇w 2 .\n(6)\n∂t\nS\n2S\n4\n\n\fRelations (5) and (6) are the system of four equations for four variables,\nfor example, for temperature T and the components of relative velocity w.\nEqs. (5) and (6) must be completed by the equations of state of superfluid\nhelium S = S(T, w 2), ρn = ρn (T, w 2 ), in which we have neglected the pressure\ndependence in accordance with the assumptions made above.\nThe system of Eqs. (5)-(6) are linearized for small deviations of the variables. They define the propagation of second sound waves and the transverse\nwave, at arbitrary values of the equilibrium relative velocity w, when ρn ≪ ρ.\nThe dispersion relation for this case is studied in [14].\nFor a phonon system with a linear energy-momentum relation ε = cp,\nwhere c2 = (∂P )/(∂ρ) and c is the first sound velocity of helium, we have\n[12]:\n4 3\nρn\nT\n2π 2\nkB\nT\n= 2\n,\nS\n=\n.\n(7)\n2\n3\n3\nS\nc −w\n45 ~ c (1 − w 2 /c2 )2\nThe system of equations (5)-(6), together with the relations (7), describe\nthe evolution of phonon systems propagating in superfluid helium.\nThe main feature of phonon systems, created in experiments [1]-[5], is the\nhigh value of the relative velocity w, which has a value close to the first sound\nvelocity c. At the same time the temperature of such phonon systems is very\nsmall, so the normal density satisfies the strong inequality ρn ≪ ρ. As shown\nin [15], using the general conditions of stability for superfluid helium [8], such\nphonon systems are thermodynamically stable, even for values of the relative\nvelocity which approach the first sound velocity c, if the temperature is low\nenough.\nIn a recent paper [5] detailed measurements of angular distributions of energy in phonon systems were reported for different distances from the heater,\nand different heater sizes and powers. Fig.1 illustrates the main idea of the\nexperiments [5]. The phonon system (shaded region) is created by a current\npulse in the heater H, which is immersed in superfluid helium.\nThe created phonon system moves in the direction normal to the heater\n(axis z) with a velocity close to the first sound velocity c. The pulse expands\ntransversely. This expansion along with the initial phonon energy distribution near the heater, determines the angular distribution of energy on the\ndetector. By changing the heater size, one can vary the initial transverse size\nL0 of the phonon system, and by the changing heater pulse duration tp one\ncan vary the characteristic length ctp of the system.\nWe consider the simple case when the dependence on z can be neglected\nin the initial value problem for Eqs. (5), (6). That is valid for sufficiently\nlong phonon pulses. To study the behaviour of the transverse expansion of\nphonon pulses, we consider the 2 dimensional case, where all values depend\n5\n\n\fFigure 1: A phonon system (shaded region) with characteristic temperature\nT0 and the relative velocity w0 in superfluid helium with vs = 0 and temperature T = 0. The heater H has a width 2L0 . The characteristic length ctp\nof the system depends on the the pulse duration tp . The coordinate frame\nis defined with the z-axis parallel to the normal to the heater H. D is the\ndetector.\nonly on one spatial cartesian coordinate, x. The relative velocity w lies in\nthe plane xz, i.e. w = (wx , 0, wz ).\nSubstituting Eqs. (7) into Eqs. (5), (6), and introducing the dimensionless variables\nΘ = ln\n\nT\n, ux = wx /c, u2 = (wx2 + wz2 )/c2 ,\n1 − u2\n\nwe can rewrite the equations in the matrix form\n\n\n\n\nΘ\nΘ\n∂ \n∂\nux  + M(ux , u2 )  ux  = 0,\nc∂t\n∂x\nu2\nu2\n\n(8)\n\n(9)\n\nwhere the matrix M(ux , u2 ) is equal to\n\n\n(5 − 3u2 )ux\n1 − u2\n−ux\n1 \n(1 − u2 )(3 − u2 − 2u2x )\n2ux\n−0.5(3 − u2 − 2u2x )  .\n3 − u2\n2 2\n2\n2\n6(1 − u ) ux\n−2u (1 − u )\n2u2ux\n(10)\nWe have introduced the dimensionless relative velocity u = w/c in Eqs.\n(8)-(10).\n6\n\n\fWe see that Eqs. (9)-(10) is a complicated nonlinear system of first order\nequations in partial derivatives, with coefficients that depend explicitly on\nthe variable u2 and linearly and quadratically on the variable ux . We show\nbelow that Eqs. (9)-(10) can be solved exactly for arbitrary values of the\nrelative velocity w.\n\n3\n\nSecond sound simple waves in phonon systems\n\nIn this section we will obtain the class of exact solutions for the system\nof Eqs. (9)-(10). In Sec. 4 we apply the solutions, along with the initial\nconditions, to the problem of phonon pulse expansion in superfluid helium\nwith zero temperature.\nLet us suppose that all three variables of the system of Eqs. (9)-(10)\ndepend on one unknown function, for example, ν = ν(x, t). In other words\nwe seek solution in the form of Θ = Θ(ν), ux = ux (ν), and u2 = u2 (ν).\nSuch solutions are called simple waves (see, for example, [16]). Substituting\nthese relations into equations (9), and dividing the equations (9) by ∂ν/∂x\nwe obtain the following matrix equation\n\n\n\n\nΘ\nΘ\n∂ν\nd \nd \nux  = − c∂t\nux  .\n(11)\nM\n∂ν\ndν\ndν\n2\n∂x\nu\nu2\n\nWe see from Eq. (11) that the vector with components (dΘ/dν, dux/dν, du2/dν)\nis an eigenvector of the matrix M, which corresponds to the eigenvalue\n∂ν ∂ν\n− c∂t\n/ ∂x . Thus, if we know some eigenvector r = (r1 , r2 , r3 ) of the matrix\nP\nM (10), which corresponds to the eigenvalue Ṽ , i.e. if 3k=1 Mik rk = Ṽ ri\nfor any index i ∈ (1, 2, 3), then from Eq. (11) we obtain the running wave\nequation for the function ν(x, t)\n∂ν(x, t)\n∂ν(x, t)\n+ Ṽ (ν)\n= 0,\nc∂t\n∂x\n\n(12)\n\nwhich has velocity cṼ . The system of ordinary differential equations for this\nsolution is\ndux\ndu2\ndΘ\n= λr1 ,\n= λr2 ,\n= λr3 ,\n(13)\ndν\ndν\ndν\nwhere λ is some multiplier. Below we will show that matrix M (10) has three\npairwise different eigenvalues. Therefore the eigenvectors, which correspond\n7\n\n\fto the same eigenvalue, are collinear, and λ is a coefficient of proportionality between a given eigenvector r = (r1 , r2 , r3 ) and the eigenvector with\ncomponents (dΘ/dν, dux/dν, du2/dν).\nEliminating λ from the system (13), we get the system of ordinary differential equations\ndΘ\ndux\ndu2\n=\n=\n,\n(14)\nr1\nr2\nr3\nwhere r = (r1 , r2 , r3 ) is a eigenvector of matrix (10) of system (9), which\ncorresponds to the eigenvalue Ṽ . The equations (14) determine the functional\ndependence between the variables Θ, ux , and u2 in the corresponding simple\nwave solution of system (9), (10). It follows from Eqs. (12) and (13), that\nany of the variables Θ, ux , and u2 satisfy the same running wave equation\n(12) as the function ν(x, t).\nThe three eigenvalues of matrix (10) are calculated to be\np\n2ux − (1 − u2 )(3 − u2 − 2u2x )\n,\n(15)\nṼ1 =\n3 − u2\np\n2ux + (1 − u2 )(3 − u2 − 2u2x )\nṼ2 =\n,\n(16)\n3 − u2\nṼ3 = ux .\n\n(17)\n\nIt should be noted that the eigenvalues (15)-(17) of matrix (10) of system\nof Eqs. (9) are real, if u < 1, and Ṽ1 < Ṽ3 < Ṽ2 . Thus the system of\nEqs. (9) are hyperbolic. In this connection it is interesting to note, that\nthe condition w < c, which guaranties hyperbolicity of the system of Eqs.\n(9), (10) coincides here with the condition of thermodynamic stability for a\nphonon system [15].\nThe expressions (15)-(17) give the simple wave velocities V1,2,3 = cṼ1,2,3\nin a phonon system. Two of these velocities coincide, as they should, with\nthose of second sound propagation in a phonon system [14] and the third\nwith the velocity of transverse waves [17]. In this case, the values ux and u2\nin Eqs. (15)-(17) are the mean constant equilibrium values, from which there\nare small perturbations of temperature and relative velocity, which propagate\nwith velocities (15)-(17). Velocities (15) and (16) correspond to the second\nsound propagation velocities, which were found in [14] for arbitrary\n√ values of\nrelative velocity w. Particularly, at w = 0, we obtain V1,2 = ∓c/ 3 which is\nthe well-known phonon second sound velocity, when ρn ≪ ρ. Specific features\nof second sound in anisotropic phonon systems with w 6= 0, i.e. when the\nsystem is characterised by a certain direction of the relative velocity w, were\nstudied in [14].\n8\n\n\fThe simple wave velocity (17) corresponds to the one for the so-called\ntransverse wave with the dispersion law ω = kvn ≈ kw = kwx . The properties of the transverse wave and possibility of realising it in phonon pulses,\nwere discussed in [17].\nLet us consider the simple second sound wave with velocity (15). The\ncorresponding eigenvector of matrix (10) is equal to\n  \n\nr1\n2ux − (1 − u2 )R\nr = r2  =  (1 − u2 )(ux + R)R  ,\n(18)\nr3\n2(1 − u2 )(3ux + u2 R)\nwhere we denote\n\nr\n\n3 − u2 − 2u2x\n.\n(19)\n1 − u2\nSubstituting the second and third components of the eigenvector (18) into\nthe system of equations (14), we obtain the equation\nR=\n\ndu2\ndux\n=\n,\nR(ux + R)\n2(3ux + u2 R)\n\n(20)\n\nwhich determines the functional connection between ux and u2 in the simple\nsecond sound wave with the velocity Ṽ1 (15).\nEqs. (20) can be integrated by changing variable u2 to variable R (19).\nAfter this substitution we get the differential equation with separated variables\ndux\n2R2 dR\n=\n,\n(21)\n1 − u2x\n(R2 − 3)(R2 − 1)\nwhich can be immediately integrated. Its solution is\n√ !\nR− 3\n√\nR+ 3\n\nλ−1\nux (R) =\n, λ = C1\nλ+1\n\n√\n\n3\n\n\u0012\n\nR+1\nR−1\n\n\u0013\n\n,\n\n(22)\n\nwhere C1 is an integration constant.\nSolving Eq. (19) with respect to u2 , we find\nu2 (R) = 1 − 2\n\n(1 − u2x )\n.\nR2 − 1\n\n(23)\n\nRelations (22) and (23) give, in parametric form, the functional connection\nbetween the x-component ux , of the dimensionless relative velocity u, and\nits square u2 , which corresponds to velocity Ṽ1 , in the simple second sound\nwave (15).\n9\n\n\fSubstituting the first and second component of the eigenvector (18) into\nthe system of equations (14), we obtain the other equation\ndΘ =\n\n(2ux − (1 − u2 )R)dux\n.\n(1 − u2 )(ux + R)R\n\n(24)\n\nExpressing u2 in terms of R, and ux by using Eq. (23) in the factor\noutside dux in Eq. (24), we get the following equation instead of Eq. (24)\ndΘ −\n\ndux\nux dux\n=−\n.\n2\n1 − ux\nR(1 − u2x )\n\n(25)\n\nNow, using Eq. (21) in the right-hand side of Eq. (25), we again get a\ndifferential equation with separated variables. By integrating this equation,\nand then, taking into account the definition (8) of variable Θ, we obtain an\nexpression for the temperature T in the simple second sound wave\ns\n(1 − u2x )\nT (R) = C2\n,\n(26)\n(R2 − 3)(R2 − 1)\nwhere C2 is an integration constant.\nThus the relations (22), (23), and (26) express in parametric form the relationships between the x-component ux of the dimensionless relative velocity\nu, the square of the dimensionless relative velocity u2 , and temperature T ,\nin the simple second sound wave, which propagates in \"superfluid vacuum\"\nof 4 He with the velocity Ṽ1 (15). The expression for the velocity Ṽ1 (15) can\nbe transformed into a more simple form using (23)\nṼ1 (R) =\n\nRux − 1\n.\nR − ux\n\n(27)\n\nIt follows from Eqs. (21), (23), and (26), that ux and u2 increase monotonically when R increases, and T decreases monotonically when R increases.\nThus starting from any of the variables ux , u2 , or T at the initial moment of\ntime we can determine the corresponding initial function R(x, t = 0). The\ntime evolution of the value of R is determined by the running wave equation:\n∂R(x, t)\n∂R(x, t)\n+ Ṽ1 (R)\n= 0,\nc∂t\n∂x\n\n(28)\n\nwhere Ṽ1 (R) is the velocity (27). The solution of Eq. (28) is well-known\nx − cṼ1 (R)t = f (R),\n10\n\n(29)\n\n\fwhere f (R) is an arbitrary function.\nThe solution (29) shows that every value of R runs with its own velocity\nV1 (R) in the simple second sound wave. The relations (29),(27) along with\nthe expressions (22), (23), and (26), express in parametric form the spatial\ndependence of the x-component wx = cux of the relative velocity w, the\nsquare of the relative velocity w 2 = c2 u2 , and temperature T in the simple\nsecond sound wave at any moment of time.\nIt follows from Eq. (27), that dV1 (R)/dR > 0. So it is clear that a simple\nsecond sound wave can, in general, give rise to a break in the continuous\nsolution . To determine the location and the velocity of the break we should\nreturn to the energy and momentum conservation laws, however we will not\nbe concerned with that problem here.\nThe other simple second sound wave, which has the velocity V2 (see Eq.\n(16)), can be obtained from the solution (22), (23), and (26), which corresponds to the velocity V1 . For this purpose let us note that if T (x, t), wx (x, t)\nand w 2 (x, t) is a solution of the system (8)-(10), then T (−x, t), −wx (−x, t)\nand w 2 (−x, t) is also a solution. This transformation maps one simple second\nsound wave to the other.\n\n4\n\nExpansion of a phonon pulse into the \"phonon\nvacuum\" of superfluid helium\n\nTo study the main features of the transverse expansion of phonon pulses in\nsuperfluid helium we will solve the following problem. Let superfluid helium\nwith vs = 0 fill up all space. Let us consider the initial conditions\n(\nT0 , |x| < L0\nT (x, 0) =\n; wx (x, 0) = 0; w 2 (x, 0) = w02 ,\n(30)\n0, |x| > L0\nfor the system of Eqs. (8), (9) and (10).\nAt the initial time t = 0, in the superfluid helium at T = 0, there is a\nlayer of phonons of width 2L0 , temperature T = T0 , and relative velocity\nw = (0, 0, w0) directed along z-axis (see Fig.2). The phonons in this initial\nlayer is the normal fluid, and as the phonon density is very low the normal\nfluid density is very small so ρn ≪ ρ. Therefore we can neglect the superfluid\nvelocity and pressure changes when we study the development of the phonon\nsystem. Thus the set of Eqs. (9) and (10) apply to this phonon system. We\nare interested in finding the development in time of the temperature T and\nthe relative velocity w of the phonon system.\n\n11\n\n\fFigure 2: A layer of phonons with temperature T0 and the relative velocity\nw0 = w0 ez in superfluid helium with vs = 0 and temperature T = 0. The\nlayer width is 2L0 . The x-axis is directed perpendicularly to the plane of the\nlayer.\nThe problem, formulated above, can be solved partly by using the simple\nsecond sound wave solution found in the previous section. First of all we\nnote that the initial conditions (30) satisfy the symmetry transformations\ndiscussed at the end of section 3. Therefore at any time, the temperature T\nand w 2 are even functions of the x-coordinate, and wx is an odd function.\nBelow we will only discuss the solution for domain x > 0.\nThe strong discontinuity, which exists at x = L0 in the initial conditions,\ndisappears immediately after t = 0, as it is clear from physical considerations.\nThe phonon gas expands into the superfluid helium with zero temperature,\nforming the forward front of the outgoing second sound wave (see Fig.3). At\nthe same time, the initial perturbation, in the form of a weak discontinuity,\nmoves in the region x < L0 forming the rear front of the ingoing second\nsound wave (see Fig.3). The weak discontinuity is at the point where the\ntemperature starts to change from its initial value (30), and it moves towards the coordinate origin x = 0 with the velocity cṼ1 (ux = 0, u20 = w02 /c2 )\ndetermined by Eq. (15). Thus until the time t0 when the intersection point\nreaches x = 0, there is no length scale in the problem, and the solution must\nbe self-similar. The value of t0 is given by\ns\nL0\nL0 3 − w02\nt0 =\n,\n(31)\n=\n|V1 (ux = 0, u20 = w02 /c2 )|\nc\n1 − w02\n12\n\n\fFigure 3: The dependence of the temperature T on the x-coordinate for the\ninitial value w0 = 0.95c at time t = 0 (dashed line), t = t0 /2 (dotted line),\nand t = t0 (solid line). The arrows point to the location of the fronts of the\ningoing and outgoing waves at times t = t0 /2 and t = t0 .\nA self-similar solution is a particular case of a simple wave. Therefore from\nEq. (29), taking into account that at the initial time t = 0 the wavefront is\nat x = L0 , we get f (R) = L0 . Thus the function f (R) is reduced to constant\nfor the self-similar solution and\nx = L0 + V1 (R)t\n\n(32)\n\nwhere V1 (R) = cṼ1 (R) is determined by the relation (27).\nFor any moment of time 0 < t < t0 , the wave occupies the domain x ∈\n(xin (t), xout (t)), where value xin (t) = L0 + V1 (R0 )t determines the position\nof the front of the ingoing wave, and xout (t) = L0 + V1 (Rout )t determines the\nposition of the front of the outgoing wave, which follows from Eq. (32) (see\nFig.3). We denote the yet-unknown limits of the variable R as R0 and Rout ,\ni.e. R ∈ (R0 , Rout ). Below we show that Rout = +∞, and that the value R0\nis determined by Eq. (35) coinciding with the value R(ux = 0, u20 = w02 /c2 )\nfrom Eq. (19).\nTo determine the integration constants, which are contained in Eqs. (22)\nand (26), we should join continuously the simple wave solution (22), (23) and\n(26) with the to the initial values (30) at R = R0 at the front of the ingoing\n13\n\n\fwave. Thus we get the solution\nλ−1\nux (R) =\n, λ=\nλ+1\n\n\u0012\n\nR0 − 1\nR0 + 1\n\nT (R) = T0\n\ns\n\n√ !\nR0 + 3\n√\nR0 − 3\n\n\u0013\n(R02\n(R2\n\nand the value R0\nR0 =\n\n−\n−\n\ns\n\n3)(R02\n3)(R2\n\n√\n\n3\n\n\u0012\n\nR+1\nR−1\n\n\u0013\n\n√ !\nR− 3\n√\nR+ 3\n\n√\n\n3\n\n,\n(33)\n\n− 1)\n(1 − u2x ),\n− 1)\n\n(34)\n\n3 − w02 /c2\n.\n1 − w02 /c2\n\n(35)\n\nOn the front of the outgoing wave, in accordance with the initial conditions (30) the phonon temperature is equal to zero. It follows from Eqs. (34)\nand (33) that this can only be satisfied by Rout = +∞.\nThus for any t ∈ (0, t0 ), Eqs. (33), (34), (23), (32), and (27) determine\nthe desired self-similar solution of the initial value problem (9), (10), and\n(30), and give the values of T , wx = cux , and w 2 = c2 u2 at any point\nx ∈ (xin (t), xout (t)).\nFrom Eq. (33) we find that at the front of the outgoing wave, which\nborders with superfluid helium at zero temperature, the x-component of the\ndimensionless relative velocity ux is equal to\nuxout\n\nλout − 1\n= ux (R = +∞) =\n, λout =\nλout + 1\n\n\u0012\n\nR0 − 1\nR0 + 1\n\n\u0013\n\n√ !\nR0 + 3\n√\nR0 − 3\n\n√\n\n3\n\n. (36)\n\nFrom Eq. (27) it follows that this velocity wxout coincides with the velocity\nof the front of the outgoing wave\nV1 (Rout = +∞) = wxout = cuxout .\n\n(37)\n\nAlso from Eq. (27) in accordance with Eq. (31) for the velocity of the\nfront of the ingoing wave, we get\ns\nc\n1 − w02\nV1 (R0 ) = −\n,\n(38)\n= −c\nR0\n3 − w02\nwhich coincides with the velocity cṼ1 (ux = 0, u20 = w02 /c2 ) determined by Eq.\n(15).\nIt is interesting that the relative velocity at the front of the outgoing wave,\nwhich follows from Eq. (23), is equal to the phonon velocity i.e. w 2(Rout =\n14\n\n\fFigure 4: The dependence of x-component wx of the relative velocity on the\nx-coordinate, for the initial value w0 = 0.95c for times t = t0 /2 (dotted line),\nand t = t0 (solid line).\n+∞) = c2 . Whereas the temperature of such phonons is equal to zero.\nTherefore such phonon system remains thermodynamically stable [15]. The\nphonon energy density at the front of the outgoing wave tends to zero.\nFigs.3, 4, 5 show the spatial dependence of the temperature T (Fig.3 ),\nthe x-component wx (Fig.4) of the relative velocity w, and the square of the\nrelative velocity w 2 (Fig.5) for times t = 0 (dashed lines on Figs.3 and 5), t =\nt0 /2 (dotted lines in Figs.3, 4, and 5), and for t = t0 (solid lines in Figs.3, 4,\nand 5). These graphs are calculated from Eqs. (33), (34), (23), (32), and (27)\ntaking into account (35) for the initial value w0 = 0.95c, which corresponds\nto a strongly anisotropic phonon system. We see that temperature (Fig.3) of\nthe phonon pulse, expanding in \"phonon vacuum\", decreases monotonically,\nbut the x-component wx (Fig.4) of the relative velocity w, and the square of\nthe relative velocity w 2 (Fig.5) increase when x-coordinate increases.\nLet us find all the variables at the point x = L0 . If we substitute x = L0\nin Eq. (32), then we get the equation V1 (R∗ ) = 0, where we denote as R∗\nthe value of R, which corresponds to x = L0 at any time t > 0. Taking into\naccount Eq. (27), we obtain the equivalent equation R∗ ux (R∗ ) = 1. Solving\n\n15\n\n\fFigure 5: The dependence of the absolute value of the relative velocity w\non the x-coordinate for the initial value w0 = 0.95c for times t = 0 (dashed\nline), t = t0 /2 (dotted line), and t = t0 (solid line).\nthis equation taking into account the expression (33), we get\n√ !\u0012\n\u0013 √1\n√\n3\nR\n−\n1\n+\nγ\nR0 + 1 3\n0\n∗\n√\n, γ=\nR = 3\n,\n1−γ\nR0 − 1\nR0 + 3\n\n(39)\n\nwhere R0 is determined by Eq. (35).\nSubstituting the value R∗ , determined by (39), into Eqs. (33), (34),\nand (23), we obtain the temperature T (R∗ ), the x-component wx (R∗ ) of the\nrelative velocity w, and the square of the relative velocity w 2 (R∗ ) at x = L0 ,\ni.e. these are the values at the initial pulse boundary, for any time while the\nsolution is self-similar. In particular we get\nux (R∗ ) =\n\n1\n2\n2\n∗\n,\nu\n(R\n)\n=\n1\n−\n.\nR∗\n(R∗ )2\n\n(40)\n\nIf R > R∗ , then V1 (R) > 0, therefore the wave moves along the positive\ndirection of the x axis, and if R < R∗ then vice versa.\nFig.6 shows the dependence of the expansion velocity wxout , of the phonon\npulse, on the initial relative velocity w0 , calculated from Eqs. (36) and (35).\nWe see that for strongly anisotropic phonon systems, when w0 ∼ c, the\n16\n\n\fFigure 6: The dependence of the expansion velocity wxout of the phonon pulse\non the initial relative velocity w0 .\nexpansion velocity wxout can be very small, compared to the phonon velocity.\nWhen w0 ≪ c, then wxout ∼ c, and phonon system expands nearly with the\nphonon velocity.\nThe self-similar solution Eqs. (33), (34), (23), (32), and (27), together\nwith the unaffected region which remains constant , determine the desired\nsolution of the initial value problem for Eqs. (9), (10), and (30) everywhere\nonly till moment of time t0 . At this moment of time the front of the ingoing\nwave, which propagates in the region x > 0, reaches the coordinate origin\nx = 0, and meets the front of the ingoing wave which propagates in the region\nx < 0 in a symmetric way to the x > 0 wave. At t > t0 these two waves\noverlap at the centre region of the phonon pulse. Thus a reflected wave arises\nin the region 0 < x < xref (t), when t > t0 . In the region xref (t) < x < xout (t)\nthe solution remains self-similar, and is described by the same formulae (33),\n(34), (23), (32), and (27). The point xref (t) is determined from the condition\nof a continuous join between the reflected wave and the self-similar solution.\nBecause we cannot find the analytical solution for the reflected wave, we\nconsider in the next section the approximate method for its description.\n\n17\n\n\f5\n\nApproximate description of the reflected\nwave\n\nAt the time t = t0 , when the front of the ingoing wave reaches the coordinate\norigin x = 0, the x-coordinate derivative of the energy density has a maximum at x = 0, and the initial plateau on the energy density curve has shrunk\nto zero. After the time t = t0 , when the reflected wave appears, it transfers\nthe energy from the coordinate origin, where the energy density is maximal,\nto the periphery, where the energy density tends to zero. As a result, in the\nregion 0 < x < xref (t) the energy density curve has an approximate plateau,\nwhere the x-coordinate derivative of the energy density is small compared\nto the one in the region where the reflected wave has not reached. This dependence of the energy density on the x-coordinate (or on the angle between\nthe normal to the heater and the detector) has been experimentally studied\nrecently in Ref. [5]. At the present time we cannot find the analytical solution for the reflected wave because there are no general methods for solving\nnonlinear equations of the form (9) and (10). However preliminary numerical\ncalculations confirm the picture presented here.\nStarting from the condition that the reflected wave and the incident wave\njoin continuously, and using the energy conservation law, we can find approximately the average energy density and the average width of the reflected\nwave. For this purpose let us formulate the energy conservation law for one\ndimensional phonon propagation in superfluid helium.\nFor a phonon system with a linear energy-momentum relation ε = cp, it\nis easy to obtain the energy density\nE=\n\n4 4\nπ 2 kB\nT (1 + w 2 /(3c2 ))\n.\n30 ~3 c3 (1 − w 2 /c2 )3\n\n(41)\n\nThe energy conservation law can be written as\n∂E ∂QE\n+\n= 0,\n∂t\n∂x\n\n(42)\n\nwhere QE is the phonon energy density flux in the x-direction\nQE =\n\n4 4\n2π 2\nkB\nT wx\n.\n45 ~3 c3 (1 − w 2 /c2 )3\n\n(43)\n\nThe energy conservation law (42) along with the expression for the energy\ndensity flux (43) can be derived directly from the system of equations (9)\nand (10), which describe the propagation of the phonon system in superfluid\nhelium.\n18\n\n\fFigure 7: The solid line ACF presents the spatial dependence of the phonon\nenergy density E at some time 0 < t < t0 .\nWhen the phonon expansion is described by (9) and (10), together with\nthe initial conditions (30), the total energy, which is localized at the halfplane x > 0, does not depend on time due to the energy conservation law\n(42) and the symmetry of the initial conditions (30). This energy is equal to\nE0 L0 , where E0 = E(T0 , w0 ) = E(R0 ) is the initial phonon energy density\n(41).\nOn Fig.7 the solid line represents the spatial dependence of the phonon\nenergy density (41) at some time 0 < t < t0 , while the phonon pulse expansion is described by the self-similar solution (33), (34), (23), (32), and (27)\n(line ACF ). The energy conservation law leads to the equality of areas ABC\nand CDF in Fig.7.\nAt the time t > t0 , in the central region 0 < x < xref (t), there is a\nreflected wave. In the region x > xref (t) the solution is the self-similar wave.\nTo find approximately the average energy density and the average width of\nthe reflected wave we formally continue this self-similar solution into the\nregion x < xref (t) until some point xm (t), which is characterised by the\nenergy density Em (t). We show this in Fig.8, where the self-similar wave is\ndrawn at some time t > t0 . This value Em (t) along with xm (t) is determined\nfrom the condition that the shaded area on Fig.8 is equal to the initial energy\n\n19\n\n\fFigure 8: The solid line presents the spatial dependence of the phonon energy\ndensity E at some time t > t0 . The values xm and Em shows the approximate\nposition and the average energy density in the reflected wave respectively.\nE0 L0 . Thus we can write the equation for Em and xm\nZ +∞\n∂x(R)\nE(R)\nEm xm +\ndR = E0 L0 ,\n∂R\nRm\n\n(44)\n\nwhere xm = x(Rm ) (see Eq. (32)) and Em = E(Rm ).\nSubstituting in Eq. (44) the expression (32) for x-coordinate, we get after\nintegration by parts\n(E(Rm ) − E0 )L0\ntm = R +∞\n.\n∂E(R)\ndR\nV\n(R)\n1\n∂R\nRm\n\n(45)\n\nThe expression (45) determines approximately the time tm , when the reflected wave reaches the value Rm > R0 . Note that the integral in the\ndenominator of Eq. (45) tends to zero at Rm = R0 . This is a mathematical expression of the equality of areas ABC and CDF in Fig.7 at any time\nt < t0 .\nIt should be noted that if the energy density gradient was zero in the\nreflected wave region, then we would have the equality xm (t) = xref (t) and\nFig.8 would show the exact spatial dependence of the energy density, with the\ncharacteristic plateau in the central region. As it is clear from a physical point\n20\n\n\fFigure 9: The dependence of the approximate width xm of the reflected wave\non time t for the initial value of w0 = 0.95c.\nof view and preliminary numerical calculations, in the reflected wave region,\nthe energy density gradient is much smaller than the one in the ingoing wave,\nbut not equal to zero. Therefore xm (t) does not coincide with xref (t). In fact,\nbecause dE/dx < 0, xm (t) < xref (t). But the difference between xm (t) and\nxref (t) is small, if the energy density gradient is small in the reflected wave\nregion compared to the one in the ingoing wave. So the theory, developed\nabove, allows us to find the average energy density and the average width of\nthe reflected wave. This width corresponds to the width of the mesa shape\nin the angular distributions observed in [5].\nFig.9 shows the dependence of the approximate width xm of the reflected\nwave on time t, calculated from Eqs. (45), (32), (41), (33), (34), (23) and\n(27). In Fig.9 we see that this dependence is nearly linear. This corresponds\nto the constant velocity of the front of the outgoing self-similar wave. In the\nexperiments [5] it was found that the mesa width increased with the distance\nfrom the heater which is the same as the dependence of xm on time in Fig.9.\nThe average energy density in the reflected wave Em as a function of\ntime t is presented in Fig.10. It is calculated from Eqs. (45), (41), (33),\n(34), (23), and (27). We see that the approximate average energy density\nin the reflected wave Em decreases monotonically with time because of the\nexpansion of the phonon pulse. The dependence of Em on time (Fig.10) is\n\n21\n\n\fFigure 10: The dependence of the approximate average energy density Em ,\nof the reflected wave, on time t for the initial value of w0 = 0.95c.\nsimilar to that observed in experiments [5] where the mesa height decreased\nwith the distance from the heater.\n\n6\n\nComparison with the experimental data\n\nInitially, the phonon pulse created by the heater (see Fig.1), is comprised\nof low energy phonons (l-phonons), which immediately start to create high\nenergy phonons (h-phonons) [18]. The h-phonon creation results in spatially\nsmoothing the initial hot nonuniform central region of l-phonon pulse, which\nis injected by heater into superfluid helium. However the h-phonon creation\nfor short pulses occurs mainly near the heater within a distance of several\nmillimeters [18]. The h-phonon creation time can be roughly estimated as\n10 μs for the typical experimental heater powers. This time corresponds to\nthe phonon travelling a distance 2.4 mm. The initial conditions (30) for the\nl-phonon system correspond to the end of the h-phonon creation stage of the\nevolution of the phonon system. So the above theory is for the expansion of\na cool l-phonon system.\nAfter the h-phonon creation rate has become negligible, the temperature\nis T0 and the relative velocity is w0 . The values of T0 and w0 depend on the\npower applied to the heater. Their values for l-phonon pulses, with a linear\n22\n\n\fPower\nP , mW\n3.125\n6.25\n12.5\n25\n\nInitial\nT0 , K\n0.033\n0.041\n0.050\n0.065\n\nvalues\nw0 /c\n0.955\n0.947\n0.938\n0.921\n\nTable 1: The values of temperature T0 and the relative velocity w0 (divided\nby first sound velocity c = 238 m/s) for the l-phonon system with different\nvalues of the heater power P.\nmomentum-energy relation, are calculated using the results of [18] for experimentally applied powers. The results of these calculations are presented in\nTable 1 for the heater powers used in the experiments [5]. The second and\nthird columns show the corresponding values of temperature T0 and the relative velocity w0 for these powers. Using the theory presented in this paper,\nwe can find at any time the spatial dependencies of all the parameters of the\nl-phonon system for different powers, which correspond to the values of T0\nand w0 in Table 1.\nWe should note that the phonon pulses created in experiments [5] are not\nlong enough to neglect the z-coordinate dependence in the phonon evolution\nsystem (5), (6). Moreover the experimental conditions are much more close\nto cylindrical symmetry, then to a plane one. Nevertheless we think that\nthe qualitative dependencies, obtained here for a plane phonon layer, can be\ncompared to the real much more complicated experimental conditions.\nThe theory presented here shows that the initial phonon pulse starts to\nexpand into the \"phonon vacuum\". The simple second sound wave appears\nwith the outgoing wave front moving into the \"phonon vacuum\", and the\nfront of the ingoing wave moving to the centre at x = 0 (see Fig.3). During\nthis time, the width of initial plateau decreases with time. So at the time t0\n(see Eq. (31)) there is no mesa. The phonon pulse propagates a distance of\nl0 = ct0 during this time. For the initial pulse width 2L0 = 1 mm and for\npowers 3.125 mW, 6.25 mW, 12.5 mW, and 25 mW from Ref. [5], we obtain\nthe values of l0 of 2.4 mm, 2.3 mm, 2.1 mm, and 1.9 mm respectively. The\ntotal distance between the heater and the phonon pulse lh is lh = l0 +lc , where\nlc = 2.4 mm is the length after which the h-phonon creation has effectively\nstopped. Note that this schema of taking into account of h-phonon creation\nis rather rough one, especially for high powers.\nIn experiments [5] the minimal distance between heater and detector was\n\n23\n\n\fFigure 11: The dependencies of the full mesa width 2xm in degrees, on\nheater power for the distance 12.3 mm from the heater, for the heater widths\n2L0 = 1 mm (line 1) and for 2L0 = 0.5 mm (line 2).\n8.2 mm. Thus the decrease in the width of the initial plateau is not observed\nin [5]. It would need measurements of the phonon energy angular distributions at a distance about 3-4 mm from the heater to compare with this\nprediction of the theory that there is no mesa at ≈ 4 mm.\nAt time t = t0 the reflected wave appears. From a physical point of view\nit is clear that in the reflected wave, which occurs in the central region of\nthe phonon pulse, the energy density gradient is smaller than in the ingoing\nwave. Thus the existence of the reflected wave should lead to a mesa shape\nin the phonon angular distributions at distances larger than ≈ 4 mm.\nIn Ref.[5] the detailed measurements of l-phonon angular distributions\nin superfluid helium showed a distinct mesa shape. The dependence of the\nmesa height and width, on heater dimensions, distance to the detector and\nheater power, were measured [5]. Using the theory presented in this paper\nwe now can give qualitative explanations some of these experimental data.\nIn Fig.11 we show the dependencies of mesa width xm on power for the\ndistance 12.3 mm from the heater for the heater widths 2L0 = 1 mm (line 1)\nand for 2L0 = 0.5 mm (line 2), calculated from the data in Table 1 and Eqs.\n(45), (32), (33), (27), (35) and(23). Here and below we take the distances\nand the heater widths which were used in the experiments [5]. We see the\n\n24\n\n\fFigure 12: The dependencies of the mesa height Em on power for the distance\n12.3 mm from the heater for the heater widths 2L0 = 1 mm (line 1) and for\n2L0 = 0.5 mm (line 2).\nmonotonic growth of the mesa width xm , when power increases as it does in\nthe experimental data from [5], although the measured mesa widths are considerably smaller than those theoretically predicted. The power dependence\ncan be explained in the following way. When power increases, the relative\nvelocities w0 decrease (Table 1). This results in increasing the absolute value\nof velocity V1 . Thus the time t0 (see Eq. (31)) decreases, and the mesa forms\nearlier. It should be noted that in the experiments [5] for some cases the\nmeasured mesa widths start to decrease at high power 25 mW (see Fig. 9\nof [5]). Our theory, which describes the expansion of a cool l-phonon layer,\ncannot explain this effect.\nIn Fig.12 we present the dependencies of the mesa height Em on power\nfor the distance 12.3 mm from the heater for the heater widths 2L0 = 1 mm\n(line 1) and for 2L0 = 0.5 mm (line 2), calculated from the data in Table 1\nand Eqs. (45), (33), (34), (27), (35) and(23). The mesa height Em increases,\nwhen the power increases, as it does in the measured data [5].\nWhile the mesa width xm do not depend on the initial temperature T0 ,\nwhich follows from Eqs. (45) and (32), the mesa height Em depends on T04 .\nIt turns out that the increase of T0 with power prevails over the decrease the\nrelative velocity w0 , and so an increase in power leads to a quicker expansion\n25\n\n\fFigure 13: The angular width of the full mesa 2xm versus the inverse of the\nheater width for the distance 12.3 mm from the heater, for heater powers\n3.125 mW (line 1) and 25 mW (line 2).\nof the phonon pulse and hence to a wider mesa.\nThe increase of xm with time, shown in Fig.9 corresponds to an increase\nof the mesa width with distance. This is observed in experiments [5]. The\ndecrease of Em with time, shown in Fig.10, corresponds to a decrease in the\nmesa height with distance. This too is observed in experiments [5].\nThe theory developed in this paper allows us to qualitatively understand\nwhy the mesa width increases with decreasing the heater width [5]. A smaller\nheater width (2L0 ) results in an earlier formation of the mesa, and this leads\ndirectly to an increase in the mesa width. In Fig.13 we show the dependencies\nof mesa width xm on reciprocal heater width 1/(2L0 ) for the distance 12.3\nmm from the heater for powers 3.125 mW (line 1) and 25 mW (line 2),\ncalculated from the data in Table 1 and Eqs. (45), (32), (33), (27), (35)\nand (23). But we should note that our theory does not reproduce the linear\ndependence of mesa width on reciprocal heater width, which was observed\nin the experiments [5] (see Fig. 10 in [5]).\n\n26\n\n\f7\n\nConclusions\n\nIn this paper, starting from the hydrodynamic equations of superfluid helium,\nwe have obtained the system of equations (5) and (6), which describe the\nevolution of a cool phonon systems, created by thermal pulses in superfluid\nhelium for the case ρn ≪ ρ (see Fig.1). These equations are simplified to\nthe case of one spatial dimension (see Eqs. (8)-(10), and Fig.2). The family\nof exact solutions were found in an explicit analytical form. They are the\nsimple waves of second sound for phonon systems. The relations between\ntemperature T (26), the x-component wx (22) of the relative velocity w, and\nthe square of the relative velocity w 2 (23) are studied for the simple second\nsound waves in phonon systems. These solutions are used to describe the first\nstage of expansion of a phonon layer in superfluid helium, when only simple\nsecond sound waves exist. Figs.3, 4, and 5 show the spatial dependence of\ntemperature T (Fig.3), the x-component wx (Fig.4) of the relative velocity\nw, and the square of the relative velocity w 2 (Fig.5) for time t = 0 (dashed\nlines on Figs.3 and 5), t = t0 /2 (dotted lines in Figs.3, 4, and 5), and for\nt = t0 (solid lines in Figs.3, 4, and 5).\nWe have found the velocity of expansion wxout of a phonon pulse, propagating initially in z-direction, into the \"phonon vacuum\", i.e. into superfluid\nhelium at zero temperature. The dependence of the expansion velocity wxout\nof the phonon pulse, on the initial relative velocity w0 , calculated from Eqs.\n(36) and (35) are presented in Fig.6. We see that for strongly anisotropic\nphonon systems, when w0 ∼ c, the expansion velocity wxout can be small compared to the phonon velocity. When w0 ≪ c, then wxout ∼ c, and phonon\nsystem expands nearly with the phonon velocity.\nIn the second stage, after the incident wave reaches the centre of the\nphonon layer, a reflected wave appears. We found the time t0 Eq. (31), when\nthis starts. The reflected wave transfers energy from the coordinate origin,\nwhere the energy density is maximal, to the periphery, where the energy\ndensity tends to zero. It smooths the dependence of the energy density on the\nx-coordinate, in the reflected wave region. The smallness of the x-coordinate\nderivative of the energy density in the reflected wave region, compared with\nthe one in the ingoing wave, results in a mesa shape form, which was observed\nin [5].\nWe developed an approximate theory for the average energy density and\nthe average width of the reflected wave (see Fig.8). The calculated dependencies of the mesa height and mesa width on time (Figs.9, 10), on the heater\npower (Figs.11, 12), and on the heater width (Fig.13) show partly the same\nqualitative dependencies as the experimental data in [5], although our theory\nfails to explain all effects observed. But we think that the main cause of the\n27\n\n\fmesa shape appearance in the experiments [5] are the same as in our simple\nmodel theory.\n\nAcknowledgements\nWe thank very much A. F.G. Wyatt for drawing our attention to this problem\nand for many useful discussions, and we express our gratitude to EPSRC of\nthe UK (grant EP/F 019157/1) for support of this work.\n\nReferences\n[1] A. F. G. Wyatt, N. A. Lockerbie and R. A. Sherlock, Phys. Rev. Lett.,\n33, 1425 (1974).\n[2] R. Vovk, C.D.H. Williams, and A.F.G. Wyatt, Phys. Rev. Lett., 91,\n235302 (2003).\n[3] D.H.S. Smith, R.V. Vovk, C.D.H. Williams and A.F.G. Wyatt, New\nJournal of Physics 8, 128 (2006).\n[4] D.H.S. Smith and A.F.G. Wyatt, Phys. Rev. B, 76, 224519 (2007).\n[5] D.H.S. Smith and A.F.G. Wyatt, Phys. Rev. B, 79, 144520 (2009).\n[6] I.N. Adamenko, Yu.A. Kitsenko, K.E. Nemchenko, V.A. Slipko and\nA.F.G. Wyatt, Low Temp. Phys., 31, 459 (2005).\n[7] D.H.S. Smith, R.V. Vovk, C.D.H. Williams, and A.F.G. Wyatt, Phys.\nRev. B, 72, 054506, (2005).\n[8] A.F. Andreev and L.A. Melnikovsky, J. of Low. Temp. Phys., 135,\n411(2004).\n[9] I.N. Adamenko, K.E. Nemchenko, V. A. Slipko, and A.F.G. Wyatt,\nPhys. Rev. B, 68, 134507, (2003).\n[10] I.N. Adamenko, K.E. Nemchenko, V.A. Slipko and A.F.G. Wyatt, J.\nLow Temp. Phys., 138, 67 (2005).\n[11] I.N. Adamenko, K.E. Nemchenko, V.A. Slipko and A.F.G. Wyatt, J.\nPhys.: Condens. Matter, 17, 2859 (2005).\n\n28\n\n\f[12] I.M. Khalatnikov, An Introduction to the Theory of Superfluidity, W.A.\nBenjamin, New York - Amsterdam, 1965.\n[13] S.J. Putterman, Superfluid Hydrodynamics, North Holland, Amsterdam,\n1974.\n[14] I.N. Adamenko, K.E. Nemchenko, V.A. Slipko and A.F.G. Wyatt, Phys.\nRev. B, 79, 104508, (2009).\n[15] I.N. Adamenko, K.E. Nemchenko, V.A. Slipko and A.F.G. Wyatt, J.\nPhys.: Condens. Matter. 18, 2805 (2006).\n[16] L.D. Landau, E.M. Lifshitz, Fluid Mechanics, Oxford, Pergamon Press,\n1987.\n[17] I.N. Adamenko, K.E. Nemchenko, V.A. Slipko and A.F.G. Wyatt, Phys.\nRev. B, 77, 144515, (2008).\n[18] I.N. Adamenko, Yu.A. Kitsenko, K.E. Nemchenko, V.A. Slipko and\nA.F.G. Wyatt, Phys. Rev. B, 73, 134505, (2006).\n\n29\n\n\f"}