{"id": "http://arxiv.org/abs/0810.2253v1", "guidislink": true, "updated": "2008-10-13T15:16:17Z", "updated_parsed": [2008, 10, 13, 15, 16, 17, 0, 287, 0], "published": "2008-10-13T15:16:17Z", "published_parsed": [2008, 10, 13, 15, 16, 17, 0, 287, 0], "title": "The Geometry of Filtering", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0810.0624%2C0810.4342%2C0810.5699%2C0810.1083%2C0810.3758%2C0810.4563%2C0810.5240%2C0810.1037%2C0810.2471%2C0810.1778%2C0810.3790%2C0810.2914%2C0810.4429%2C0810.4854%2C0810.5474%2C0810.1135%2C0810.1777%2C0810.4867%2C0810.1036%2C0810.1824%2C0810.0116%2C0810.3556%2C0810.2887%2C0810.3266%2C0810.0123%2C0810.1441%2C0810.4364%2C0810.2054%2C0810.4047%2C0810.0838%2C0810.5294%2C0810.2253%2C0810.0173%2C0810.0434%2C0810.4809%2C0810.1124%2C0810.0053%2C0810.5375%2C0810.1494%2C0810.3785%2C0810.0846%2C0810.0197%2C0810.2508%2C0810.1014%2C0810.0552%2C0810.5035%2C0810.4663%2C0810.2297%2C0810.1947%2C0810.0860%2C0810.3530%2C0810.2413%2C0810.5264%2C0810.4268%2C0810.1154%2C0810.5701%2C0810.2906%2C0810.4787%2C0810.5192%2C0810.2205%2C0810.2363%2C0810.3378%2C0810.0626%2C0810.3409%2C0810.1538%2C0810.5573%2C0810.2246%2C0810.0591%2C0810.0344%2C0810.4467%2C0810.0967%2C0810.0230%2C0810.4153%2C0810.4775%2C0810.1226%2C0810.0167%2C0810.5134%2C0810.1130%2C0810.2380%2C0810.4664%2C0810.1991%2C0810.2774%2C0810.0768%2C0810.0410%2C0810.5460%2C0810.1133%2C0810.2680%2C0810.2463%2C0810.3251%2C0810.0145%2C0810.4328%2C0810.0538%2C0810.1091%2C0810.4560%2C0810.5751%2C0810.5043%2C0810.2835%2C0810.3260%2C0810.0730%2C0810.5667%2C0810.2531&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "The Geometry of Filtering"}, "summary": "Geometry arising from two diffusion operators (smooth semi-elliptic, second\norder differential operators) on different spaces but intertwined by a smooth\nmap is described. Particular cases arise from Riemannian submersions when the\noperators are Laplace-Beltrami operators, from equivariant operators on the\ntotal space of a principal bundle, and for the operators on the diffeomorphism\ngroup arising from stochastic flows. Classical non-linear filtering problems\nalso lead to such conffigurations. A basic tool is the, possibly, non-linear\n\"semi-connection\" induced by this set up, leading to a canonical decomposition\nof the operator on the domain space. Topics discussed include: generalised\nWietzenbock curvatures arising in the equivariant case, skew -product\ndecompositions of diffusion processes, conditioned processes, classical\nfiltering, decomposition of stochastic flows, and connections determined by\nstochastic differential equations.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0810.0624%2C0810.4342%2C0810.5699%2C0810.1083%2C0810.3758%2C0810.4563%2C0810.5240%2C0810.1037%2C0810.2471%2C0810.1778%2C0810.3790%2C0810.2914%2C0810.4429%2C0810.4854%2C0810.5474%2C0810.1135%2C0810.1777%2C0810.4867%2C0810.1036%2C0810.1824%2C0810.0116%2C0810.3556%2C0810.2887%2C0810.3266%2C0810.0123%2C0810.1441%2C0810.4364%2C0810.2054%2C0810.4047%2C0810.0838%2C0810.5294%2C0810.2253%2C0810.0173%2C0810.0434%2C0810.4809%2C0810.1124%2C0810.0053%2C0810.5375%2C0810.1494%2C0810.3785%2C0810.0846%2C0810.0197%2C0810.2508%2C0810.1014%2C0810.0552%2C0810.5035%2C0810.4663%2C0810.2297%2C0810.1947%2C0810.0860%2C0810.3530%2C0810.2413%2C0810.5264%2C0810.4268%2C0810.1154%2C0810.5701%2C0810.2906%2C0810.4787%2C0810.5192%2C0810.2205%2C0810.2363%2C0810.3378%2C0810.0626%2C0810.3409%2C0810.1538%2C0810.5573%2C0810.2246%2C0810.0591%2C0810.0344%2C0810.4467%2C0810.0967%2C0810.0230%2C0810.4153%2C0810.4775%2C0810.1226%2C0810.0167%2C0810.5134%2C0810.1130%2C0810.2380%2C0810.4664%2C0810.1991%2C0810.2774%2C0810.0768%2C0810.0410%2C0810.5460%2C0810.1133%2C0810.2680%2C0810.2463%2C0810.3251%2C0810.0145%2C0810.4328%2C0810.0538%2C0810.1091%2C0810.4560%2C0810.5751%2C0810.5043%2C0810.2835%2C0810.3260%2C0810.0730%2C0810.5667%2C0810.2531&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Geometry arising from two diffusion operators (smooth semi-elliptic, second\norder differential operators) on different spaces but intertwined by a smooth\nmap is described. Particular cases arise from Riemannian submersions when the\noperators are Laplace-Beltrami operators, from equivariant operators on the\ntotal space of a principal bundle, and for the operators on the diffeomorphism\ngroup arising from stochastic flows. Classical non-linear filtering problems\nalso lead to such conffigurations. A basic tool is the, possibly, non-linear\n\"semi-connection\" induced by this set up, leading to a canonical decomposition\nof the operator on the domain space. Topics discussed include: generalised\nWietzenbock curvatures arising in the equivariant case, skew -product\ndecompositions of diffusion processes, conditioned processes, classical\nfiltering, decomposition of stochastic flows, and connections determined by\nstochastic differential equations."}, "authors": ["K. D. Elworthy", "Y. LeJan", "Xue-Mei Li"], "author_detail": {"name": "Xue-Mei Li"}, "author": "Xue-Mei Li", "arxiv_comment": "149 pages; preliminary version of monograph", "links": [{"href": "http://arxiv.org/abs/0810.2253v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0810.2253v1", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "math.DG", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "math.DG", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "math.PR", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "58J65, 53C07, 60H10, 60J60, 93E11", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0810.2253v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0810.2253v1", "journal_reference": "ISBN 978-3-0346-0176-4, Frontiers in Mathematics, Birkhauser, 2010", "doi": null, "fulltext": "arXiv:0810.2253v1 [math.DG] 13 Oct 2008\n\nThe Geometry of Filtering\n(Preliminary Version)\nK. D. Elworthy, Yves Le Jan, and Xue-Mei Li\nMay 28, 2018\n\n\f2\n\n\fIntroduction\nFiltering is the science of finding the law of a process given a partial observation of it. The main objects we study here are diffusion processes. These are naturally associated with second order linear differential operators which are semielliptic and so introduce a possibly degenerate Riemannian structure on the state\nspace. In fact much of what we discuss is simply about two such operators intertwined by a smooth map, the \"projection from the state space to the observations\nspace\", and does not involve any stochastic analysis.\nFrom the point of view of stochastic processes our purpose is to present and\nto study the underlying geometric structure which allows us to perform the filtering in a Markovian framework with the resulting conditional law being that of a\nMarkov process. This geometry is determined by the symbol of the operator on\nthe state space which projects to a symbol on the observation space. The projectible symbol induces a (possibly non-linear and partially defined) connection\nwhich lifts the observation process to the state space and gives a decomposition\nof the operator on the state space and of the noise. As is standard we can recover\nthe classical filtering theory in which the observations are not usually Markovian\nby application of the Girsanov-Maruyama-Cameron -Martin Theorem.\nThis structure we have is examined in relation to a number of geometrical topics. In one direction this leads to a generalisation of Hermann's theorem on the\nfibre bundle structure of certain Riemannian submersions. In another it gives a\nnovel description of generalised Weitzenböck curvature. It also applies to infinite\ndimensional state spaces such as arise naturally for stochastic flows of diffeoK. D. Elworthy, Mathematics Institute, University of Warwick, Coventry CV4 7AL, U.K.\nE-mail: K.D.Elworthy@warwick.ac.uk\nXue-Mei Li, Mathematics Institute, University of Warwick, Coventry CV4 7AL, U.K. E-mail:\nXue-Mei.Hairer@warwick.ac.uk\nY. LeJan, Départment de Mathematques, Université Paris Sud 11, 91405 Orsay, France. Email: Yves.LeJan@math.u-psud.fr\n\n3\n\n\f4\nmorphisms defined by stochastic differential equations, and for certain stochastic\npartial differential equations.\nLet M be a smooth manifold. Consider a smooth second order semi-elliptic\ndifferential operator L such that L1 ≡ 0. In a local chart, such an operator takes\nthe following form\nn\nX ∂\n1 X ij ∂ ∂\nL=\na\n+\nbi i\n2 i,j=1 ∂xi ∂xj\n∂x\n\n(1)\n\nwhere the aij 's and bi 's are smooth functions and the matrix (aij ) is positive semidefinite.\nSuch differential operators are called diffusion operators. An elliptic diffusion\noperator induces a Riemannian metric on M. In the degenerate case we shall have\nto assume that the \"symbol\" of L (essentially the matrix [aij ] in the representation\n(1)) has constant rank and so determines a sub-bundle E of the tangent bundle\nT M together with a Riemannian metric on E. In Elworthy-LeJan-Li [26] and\n[27] it was shown that a diffusion operator in Hörmander form, satisfying this\ncondition, induces a linear connection on E which is adapted to the Riemannian\nmetric induced on E, but not necessarily torsion free. It was also shown that\nall metric connections on E can be constructed by some choice of Hörmander\nform for a given L in this way. The use of such connections has turned out to be\ninstrumental in the decomposition of noise and calculation of covariant derivatives\nof the derivative flows.\nA related construction of connections can extend to principal fibre bundles\nP , indeed to more general situations, such as foliated manifolds and stratified\nmanifolds. An equivariant differential operator on P induces naturally a diffusion operator on the base manifold. Conversely given a connection on P one can\nlift horizontally a diffusion operator on the base manifold of the form of sum of\nsquares of vector fields by simply lifting up the vector fields. It still need to be\nshown that the lift is independent of choices of its Hörmander form. Consider\nnow a diffusion operator not given in Hörmander form. Since it has no zero order\nterm we can associate with it an operator δ which send differential one forms to\nfunctions. In Proposition 1.2.1 a class of such operators are described, each of\nwhich determines a diffusion operator. Horizontal lifts of diffusion operators can\nthen be defined in terms of the δ operator. This construction extends to situations\nwhere there is no equivariance and we have only partially defined and non-linear\nconnections.\n\n\f5\nThe connections discussed here arise in much more general situations, including for foliations though these are not discussed in this volume, We show that\ngiven a smooth p : N → M: a diffusion operator B on N which lies over a\ndiffusion operator A on M satisfying a \"cohesiveness\" property gives rise to a\nsemi-connection, a partially defined, non-linear, connection which can be characterised by the property that, with respect to it, B can be written as the direct sum of\nthe horizontal lift of its induced operator and a vertical diffusion operator. Of particular importance are examples where p : N → M is a principal bundle. In that\ncase the vertical component of B induces differential operators on spaces of sections of associated vector bundles: we observe that these are zero-order operators,\nand can have geometric significance.\nThis geometric significance and the relationship between these partially defined connections and the metric connections determined by the Hörmander form\nas in [26] and [27] is seen when taking B to be the generator of the diffusion\ngiven on the frame bundle GLM of M by the action of the derivative flow of a\nstochastic differential equation on M. The semi- connection determined by B is\nthen equivariant and is the adjoint of the metric connection induced by the SDE in\na sense extending that of Driver [17] and described in [27]. The zero-order operators induced on differential forms as mentioned above turn out to be generalised\nWeitzenböck curvature operators,in the sense of [27], reducing to the classical\nones when M is Riemannian for particular choices of stochastic differential equations for Brownian motion on M. Our filtering then reproduces the conditioning\nresults for derivatives of stochastic flows in [29]and [27].\nOur approach is also applied to the case where M is compact and N is its\ndiffeomorphism group, Diff(M) , with P evaluation at a chosen point of M. The\noperator B is taken to be the generator of the diffusion process on Diff(M) arising\nfrom a stochastic flow. However our constructions can be made in terms of the\nreproducing Hilbert space of vector fields on M defined by the flow. From this we\nsee that stochastic flows are essentially determined by a class of semi-connections\non the bundle p : Diff(M) → M and smooth stochastic flows whose one point\nmotions have a cohesive generator determine semi- connections on all natural\nbundles over M. Apart from these geometrical aspects of stochastic flows we\nalso obtain a skew product decomposition which, for example, can be used to find\nconditional expectations of functionals of such flows given knowledge of the one\npoint motion from our chosen point in M.\nA feature of our approach is that in general we use canonical processes as solutions of martingale problems to describe our processes, rather than stochastic\ndifferential equations and semi-martingale calculus, unless we are explicitly deal-\n\n\f6\ning with the latter. This leads to some some new constructions, for example of\nintegrals along the paths of our diffusions in Section 4.1, which are valid more\ngenerally than in the very regular cases we discuss here.\nIn more detail: In Chapter One we describe various representations of diffusion operators and when they are available. We also define the notion of such\nan operator being along a distribution. In Chapter Two we introduce the notion\nof semi-connection which is fundamental for what follows, show how these are\ninduced by certain intertwined pairs of diffusion operators and how they relate\nto a canonical decomposition of such operators. We also have a first look at the\ntopological consequences on p : N → M of having B on N over some A on M\nwhich posses hypo-ellipticity type properties. This is a minor extension of part of\nHermann's theorem, [37], for Riemannian submersions. In Chapter Three we specialise to the case of principal bundles, introduce the example of derivative flow,\nand show how the generalised Wietzenbock curvatures arise.\nIt is not really until Chapter Four that stochastic analysis plays a major role.\nHere we describe methods of conditioning functionals of the B-process given information about its projection onto M. We also use our decomposition of B and\nresulting decomposition of the B-process to describe the conditional B-process.\nIn the equivariant case of principal bundles the decomposition of the process can\nbe considered as a skew product decomposition. In Chapter 5 we show how our\nconstructions can apply to classical filtering problems, where the projection of the\nB-process is non-Markovian. We can follow the classical approach and obtain, in\nTheorem 5.9, a version of Kushner's formula for non-linear filtering in somewhat\ngreater generality than is standard. This requires some discussion of analogues of\ninnovations processes in our setting.\nWe return to more geometrical analysis in Chapter Six, giving further extensions of Hermann's theorem and analysing the consequences of the horizontal lift\nof A commuting with B, thereby extending the discussion in [7]. In particular we\nsee that such commutativity, plus hypo-ellipticity conditions on A, gives a bundle\nstructure and a diffusion operator on the fibre which is preserved by the trivialisations of the bundle structure. This leads to an extension of the \"skew-product\"\ndecomposition given in [24] for Brownian motions on the total space of Riemannian submersions with totally geodesic fibres. In fact the well known theory for\nRiemann submersions, and the special case arising from Riemannian symmetric\nspaces is presented in Chapter Seven.\nChapter Eight is where we describe the theory for the diffeomorphism bundle\np : Diff(M) → M with a stochastic flow of diffeomorphism on M. Initially this\nis done independently of stochastic analysis and in terms of reproducing kernel\n\n\f7\nHilbert spaces of vector fields on M. The correspondence between such Hilbert\nspaces and stochastic flows is then used to get results for flows and in particular\nskew-product decompositions of them.\nIn the Appendices we present the Girsanov Theorem in a way which does not\nrely on having to use conditions such as Novikov's criteria for it to remain valid.\nThis has been known for a long time, but does not appear to be as well known\nas it deserves. We also look at conditions for degenerate, but smooth, diffusion\noperators to have smooth Hörmander forms, and so to have stochastic differential\nequation representations for their associated processes. Finally we discuss semimartingales and Γ-martingales along a sub-bundle of the tangent bundle with a\nconnection.\nFor Brownian motions on the total spaces of Riemannian submersions much\nof our basic discussion, as in the first two and a half Chapters, of skew-product\ndecompositions is very close to that in [24] which was taken further by Liao in\n[48]. A major difference from Liao's work is that for degenerate diffusions we\nuse the semi-connection determined by our operators rather than an arbitrary one,\nso obtaining canonical decompositions. The same holds for the very recent work\nof Lazaro-Cami & Ortega, [44] where they are motivated by the reduction and\nreconstruction of Hamiltonian systems and consider similar decompositions for\nsemi-martingales. An extension of [24] in a different direction, to shed light on\nthe Fadeev-Popov procedure for gauge theories in theoretical physics was given\nby Arnaudon &Paycha in [1]. Much of the equivariant theory presented here was\nannounced with some sketched proofs in [25].\n\nKey Words\nsemi-elliptic, second order differential operator, Hörmander forms, connection,\nsemi-connection, diffusion processes, Girsanov theorem, intertwined diffusions,\nconditioned laws, filtering, Weitzenböck curvature, skew-product decomposition,\nstochastic flows, manifolds, Riemannian submersions, bundles, principal bundles,\nDiffeomorphism bundles.\n\n\f8\n\n\fContents\n1\n\n.\n.\n.\n.\n\n11\n11\n13\n14\n16\n\n.\n.\n.\n.\n.\n.\n\n19\n19\n23\n24\n28\n31\n32\n\n3\n\nEquivariant Diffusions on Principal Bundles\n3.1 Invariant Semi-connections on Principal Bundles . . . . . . . . .\n3.2 Decompositions of Equivariant Operators . . . . . . . . . . . . .\n3.3 Derivative Flows and Adjoint Connections . . . . . . . . . . . . .\n3.4 Associated Vector Bundles & Generalised Weitzenböck Formulae\n\n35\n35\n38\n41\n46\n\n4\n\nProjectible Diffusion Processes\n4.1 Integration of predictable processes\n4.2 Horizontality and filtrations . . . . .\n4.3 The Filtering Equation . . . . . . .\n4.4 A family of Markovian kernels . . .\n4.5 The filtering equation . . . . . . . .\n4.6 Approximations . . . . . . . . . . .\n4.7 Krylov-Veretennikov Expansion . .\n\n59\n60\n64\n65\n69\n70\n72\n73\n\n2\n\nDiffusion Operators\n1.1 Representations of Diffusion Operators .\n1.2 The Associated First Order Operator . . .\n1.3 Diffusion Operators Along a Distribution\n1.4 Lifts of Diffusion Operators . . . . . . .\n\n.\n.\n.\n.\n\n.\n.\n.\n.\n\n.\n.\n.\n.\n\n.\n.\n.\n.\n\n.\n.\n.\n.\n\n.\n.\n.\n.\n\n.\n.\n.\n.\n\n.\n.\n.\n.\n\n.\n.\n.\n.\n\n.\n.\n.\n.\n\nDecomposition of Diffusion Operators\n2.1 The Horizontal Lift Map . . . . . . . . . . . . . . . . . . .\n2.2 Example: The Horizontal Lift Map of SDEs . . . . . . . . .\n2.3 Lifts of Cohesive Operators & Decomposition Theorem . .\n2.4 Diffusion Operators with Projectible Symbols . . . . . . . .\n2.5 Horizontal lift of paths & completeness of semi-connections\n2.6 Topological Implications . . . . . . . . . . . . . . . . . . .\n\n9\n\n.\n.\n.\n.\n.\n.\n.\n\n.\n.\n.\n.\n.\n.\n.\n\n.\n.\n.\n.\n.\n.\n.\n\n.\n.\n.\n.\n.\n.\n.\n\n.\n.\n.\n.\n.\n.\n.\n\n.\n.\n.\n.\n.\n.\n.\n\n.\n.\n.\n.\n.\n.\n.\n\n.\n.\n.\n.\n.\n.\n.\n\n.\n.\n.\n.\n.\n.\n.\n\n.\n.\n.\n.\n.\n.\n.\n\n.\n.\n.\n.\n.\n.\n.\n\n.\n.\n.\n.\n.\n.\n.\n\n.\n.\n.\n.\n.\n.\n.\n\n.\n.\n.\n.\n\n.\n.\n.\n.\n.\n.\n\n.\n.\n.\n.\n.\n.\n.\n\n.\n.\n.\n.\n\n.\n.\n.\n.\n.\n.\n\n.\n.\n.\n.\n.\n.\n.\n\n.\n.\n.\n.\n.\n.\n.\n\n\fCONTENTS\n\n10\n\n5\n\n4.8 Conditional Laws . . . . . . . . . . . . . . . . . . . . . . . . . .\n4.9 Equivariant case: skew product decomposition . . . . . . . . . . .\n4.10 Induced processes on vector bundles . . . . . . . . . . . . . . . .\n\n74\n78\n80\n\nFiltering with non-Markovian Observations\n5.1 Signals with Projectible Symbol . . . . .\n5.2 Innovations and innovations processes . .\n5.3 Classical Filtering . . . . . . . . . . . . .\n5.4 Examples . . . . . . . . . . . . . . . . .\n\n83\n84\n88\n91\n93\n\n.\n.\n.\n.\n\n.\n.\n.\n.\n\n.\n.\n.\n.\n\n.\n.\n.\n.\n\n.\n.\n.\n.\n\n.\n.\n.\n.\n\n.\n.\n.\n.\n\n.\n.\n.\n.\n\n.\n.\n.\n.\n\n.\n.\n.\n.\n\n.\n.\n.\n.\n\n.\n.\n.\n.\n\n.\n.\n.\n.\n\n6 The Commutation Property\n97\n6.1 Commutativity of Diffusion Semigroups . . . . . . . . . . . . . . 99\n6.2 Consequences for the Horizontal Flow . . . . . . . . . . . . . . . 101\n7 Example: Riemannian Submersions & Symmetric Spaces\n113\n7.1 Riemannian Submersions . . . . . . . . . . . . . . . . . . . . . . 113\n7.2 Riemannian Symmetric Spaces . . . . . . . . . . . . . . . . . . . 115\n8 Example: Stochastic Flows\n119\n8.1 Semi-connections on the Bundle of Diffeomorphisms . . . . . . . 119\n8.2 Semi-connections Induced by Stochastic Flows . . . . . . . . . . 123\n8.3 Semi-connections on Natural Bundles . . . . . . . . . . . . . . . 130\n9 Appendices\n133\n9.1 Girsanov-Maruyama-Cameron-Martin Theorem . . . . . . . . . . 133\n9.2 Stochastic differential equations for degenerate diffusions . . . . . 135\n9.3 Semi-martingales & Γ-martingales along a Sub-bundle . . . . . . 137\n\n\fChapter 1\nDiffusion Operators\nIf L is a second order differential operator on a manifold M, denote by σ L : T ∗ M → T M\nits symbol determined by\n\u0001 1\n1\n1\ndf σ L (dg) = L (f g) − (Lf )g − f (Lg),\n2\n2\n2\n\nfor C 2 functions f, g. We will often write σ L (l1 , l2 ) for l1 σ L (l2 ) and consider σ L\nas a bilinear form on T ∗ M. Note that it is symmetric. The operator is said to be\nsemi-elliptic if σ L (l1 , l2 ) > 0 for all l1 , l2 ∈ Tu M ∗ , all u ∈ M, and elliptic if the\ninequality holds strictly. Ellipticity is equivalent to σ L being onto.\nDefinition 1.0.1 A semi-elliptic smooth second order differential operator L is\nsaid to be a diffusion operator if L1 = 0.\n\n1.1 Representations of Diffusion Operators\nApart from local representations as given by equation 1 there are several global\nways to represent a diffusion operator L. One is to take a connection ∇ on\nT M. Recall that a connection on T M gives, or is given by, a covariant derivative operator ∇ acting on vector fields. For each C r vector field U on M it\ngives a C r−1 section ∇− U of L(T M; T M). In other words for each x ∈ M\nwe have a linear map v 7→ ∇v U of Tx M to itself. This covariant derivative\nof U in the direction v satisfies the usual rules. In particular it is a derivation\nwith respect to multiplication by differentiable functions f : M → R, so that\n∇v f U = df (v)U(x) + f (x)∇v U. Given any smooth vector bundle τ E → M\n11\n\n\fCHAPTER 1. DIFFUSION OPERATORS\n\n12\n\nover M a connection on E gives a similar covariant derivative acting on sections\nU of E. This time v → ∇v U is in L(Tx M; Ex ), where Ex is the fibre over x for\nx ∈ M. Such connections always exist.\nThen we can write\nLf (x) = traceTx M ∇− (σ L (df )) + df (V 0 (x))\n\n(1.1)\n\nfor some smooth vector field V 0 on M. The trace is that of the mapping v 7→\n∇v (σ L (df )) from Tx M to itself. To see this it is only necessary to check that the\nright hand side has the correct symbol since the symbol determines the diffusion\noperator up to a first order term.\nIf a smooth 'square root' to 2σ L can be found we have a Hörmander representation. The 'square root' is a smooth X : M × Rm → T M with each\nX(x) ≡ X(x, −) : Rm → Tx M linear, such that\n2σxL = X(x)X(x)∗ : Tx∗ M → Tx M.\nThus there is a smooth vector field A with\nm\n\n1X\nLX j LX j + LA ,\nL=\n2 j=1\n\n(1.2)\n\nwhere LV denotes Lie differentiation with respect to a vector field V , so LV f (x) =\ndfx (V (x)), and X j (x) = X(x)(ej ) for {ej } an orthonormal basis of Rm . If σ L\nhas constant rank such X may be found. Otherwise it is only known that locally Lipschitz square roots exist (see the discussions in Appendix A). In that\ncase LX j LX j is only defined almost surely everywhere and the vector field A can\nonly be assumed measurable and locally bounded. Nevertheless uniqueness of the\nmartingale problem still holds (see below). Also there is still the hybrid representation, given a connection ∇ on T M:\nm\n\n1X\n∇X j (x) (df )(X j (x)) + df (V 0 (x)).\nLf (x) =\n2 j=1\n\n(1.3)\n\nfor V 0 locally Lipschitz.\nThe choice of a Hörmander representation for a diffusion operator, if it exists,\ndetermines a locally defined stochastic flow of diffeomorphisms {ξt : 0 6 t < ζ}\nwhose one point motion solves the martingale problem for the diffusion operator.\n\n\f1.2. THE ASSOCIATED FIRST ORDER OPERATOR\n\n13\n\nIn particular on bounded measurable compactly supported f : M → R the associated (sub)Markovian semigroup is given by Pt f = E(f ◦ ξt ). See also Appendix\nII.\nDespite the discussion above we can always write L in the following form:\nL=\n\nN\nX\n\naij (*)LX i LX j + LX 0 ,\n\n(1.4)\n\nij=1\n\nwhere N is a finite number, aij and X k are respectively smooth functions and\nsmooth vector fields with aij = aji .\n\n1.2 The Associated First Order Operator\nDenote by C r Λp ≡ C r Λp T ∗ M, r > 0, the space of C r smooth differential pforms on a manifold N. To each diffusion operator L we shall associate an operator δ L , see Elworthy-LeJan-Li [26], [27] c.f. Eberle [19]. The horizontal lift of L\nwill then be defined in terms of a lift of δ L .\nProposition 1.2.1 For each diffusion operator L there is a unique smooth linear\ndifferential operator δ L : C r+1 Λ1 → C r Λ0 such that\n(1) δ L (f φ) = df σ L (φ) + f * δ L (φ)\n(2) δ L (df ) = Lf.\nEquivalently δ L is determined by either one of the following:\nδ L (f dg) = σ L (df, dg) + f Lg\n1\n1\n1\nL(f g) − gLf + f Lg.\nδ L (f dg) =\n2\n2\n2\n\n(1.5)\n(1.6)\n\nProof. Take a connection ∇ on T M then, as in (1.1), L can be written as Lf =\ntrace ∇σ L (df ) + LV 0 f for some smooth vector field V 0 . Set\nδ L φ = trace ∇(σ L φ) + φ(V 0 ).\nThen δ L (df ) = Lf and\nδ L (f φ) = trace ∇(f (σ L φ)) + f φ(V 0 ) = f δ L φ + df (σ L φ).\n\n\fCHAPTER 1. DIFFUSION OPERATORS\n\n14\n\nP\nNote that a general C r 1-form φ can be written as φ = kj=1 fi dgi for some C r\nfunction fi and smooth gi , for example, by taking (g 1 , . . . , g m) : M → Rm to be\nan immersion. This shows that (1) and (2) determine δ L uniquely. Moreover since\nL is a smooth operator so is δ L .\nRemark 1.2.2 If the diffusion operator L has a representation\nL=\n\nm\nX\n\naij LX j LX j + LX 0\n\nj=1\n\nfor some smooth vector fields X i and smooth functions aij , i, j = 0, 1, . . . , m\nthen\nm\nX\nL\naij LX j ιX j + ιX 0 ,\nδ =\nj=1\n\nwhere ιA denotes the interior product of the vector field A with a differential form.\nOne can check directly that δ L (df ) = Lf and that (1) holds. In particular in a local\nchart, for the representation given in equation (1) we see that δ L is given by\nδLφ =\n\nm\nX\nj=1\n\naij\n\nX\n∂\nφj (x) +\nbi φi (x)\n∂xi\n\nwhere φ has the representation\nφx =\n\nX\n\nφj (x) dxi\n\n1.3 Diffusion Operators Along a Distribution\nLet N be a smooth manifold. By a distribution S in N we mean a family {Su :\nu ∈ N} where Su is a linear subspace of Tu N; for example S could be a subbundle of T N. Given such a distribution S let S 0 = ∪u Su0 for Su0 the annihilator\nof Su in Tu∗ N.\nDefinition 1.3.1\nLet S be a distribution in T N. Denote by C r S 0 the set of C r 1-forms which\nvanish on S. A diffusion operator L on N is said to be along S if δ L φ = 0 for\nφ ∈ C 1S 0.\n\n\f1.3. DIFFUSION OPERATORS ALONG A DISTRIBUTION\n\n15\n\nSuppose L is along S and take φ ∈ C r S 0 . By Proposition 1.2.1 and the\nsymmetry of σ L , 0 = (df )(σ L (φ)) = φ(σ L (df ) giving φx ∈ Image[σxL ]0 . This\nproves Remark 1.3.2 (i):\nRemark 1.3.2 (i) if δ L φ = 0 for all φ ∈ C 1 S 0 , then σ L φ = 0 for all such φ\nand Image[σxL ] ⊂ ∩φ∈C 1 S 0 [ker φx ] for all x ∈ N.\n(ii) If S is a sub-bundle of T N and L is along S then without ambiguity we\ncan define δ L φ for φ a C 0 section of S ∗ by δ L φ := δ L φ̃ for any 1-form\nφ̃ extending φ. Recall that S ∗ is canonically isomorphic to the quotient\nT ∗ N/S 0 .\nDefinition 1.3.3 If\nSx = ∩φ∈C 1 S 0 [ker φx ]\n\nfor all x we say S is a regular distribution.\nClearly sub-bundles are regular.\n\nProposition 1.3.4 (1) Let S be a regular distribution of N and L an operator\nwritten in Hörmander form:\nm\n\n1X\nL=\nLY j LY j + LY 0\n2 j=1\n\n(1.7)\n\nwhere the vector fields Y 0 and Y j , j = 1, . . . , m are C 0 and C 1 respectively.\nThen L is along S if and only if Y i are sections of S.\n(2) If B is along a smooth sub-bundle S of T N then for any connection ∇S on\nS we can write B as\n\u0001\nBf = traceSx ∇S− σ B (df ) + LX 0 f.\n\nAlso we can find smooth sections X 0 , . . . , X m of S and smooth functions\naij such that\nX\nB=\naij (*)LX i LX j + LX 0 .\ni,j\n\nProof. For part (1), if Y i are sections of S, take φ ∈ C 1 S 0 then\nm\n\nδLφ =\n\n1X\nLY j φ(Y j ) + φ(Y 0 ) = 0\n2 j=1\n\n\fCHAPTER 1. DIFFUSION OPERATORS\n\n16\n\nand so L is along S.\nConversely\nL is along S. Define a C 1 bundle map Y : Rm → T N by\nPmsuppose\nm\nY (x)(e) = j=1 Y j (x)ej for {ej }m\nj=1 an orthonormal base of R . Then\n2σxL = Y (x)Y (x)∗\n\nand\nby Remark 1.3.2. Now\n\nImage[Y (x)] = Image[σxL ] ⊂ S,\n\n1X\nLY j (φ(Y j )) + φ(Y 0 ) = φ(Y 0 ),\n2\nwhich can only vanish for all φ ∈ C 1 S 0 if Y 0 is a section of S. Thus Y 1 , . . . , Y m ,\nand Y 0 are all sections of S.\nFor part (2), we use (1.1) and take ∇ there to be the direct sum of ∇S with an\narbitrary connection on a complementary bundle, obtaining σ B has image in S by\nRemark 1.3.2(i).\nδLφ =\n\n1.4 Lifts of Diffusion Operators\nLet p : N → M be a smooth map and E a sub-bundle of T M. Let S be a subbundle of T N transversal to the fibre of p, i.e. V Tu N ∩ S = {0} all u ∈ N and\nsuch that Ty p maps Sy isomorphically onto Ep(y) , for each y.\nLemma 1.4.1 Every smooth 1-form on N can be written as a linear combination\nof sections of the form ψ + λp∗ (φ) for λ : N → R smooth, φ a 1-form on M,\nand ψ annihilates S. In particular any 1-form annihilating V T N is of the form\nλp∗ (φ). If E = T M then ψ is uniquely determined.\nProof. Take Riemannian metrics on M and N such that the isomorphism between\nS and p∗ (E) given by T p is isometric. Fix y0 ∈ N. Take a neighbourhood V of\np(y0 ) in M over which E is trivializable. Let v 1 , v 2 , . . . , v p be a trivialising family\nof sections over V . Set U = p−1 (V ). If φj = (v j )∗ , the dual 1-form to v j , j = 1\nto p, over V then {p∗ (φj )# , j = 1 to p} gives a trivialization of S over U. [Indeed\np∗ (φj )y (−) = φjp(y) (Ty p−) = h(Ty p)∗ (v j ), −i.] Since any vector field over V\ncan therefore be written as one orthogonal to S plus a linear combination of the\np∗ (φj )# , by duality the result holds for forms with support in U. The global result\nfollows using a partition of unity.\nFor the uniqueness note that if E = T M then T N = V T N + S.\n\n\f1.4. LIFTS OF DIFFUSION OPERATORS\n\n17\n\nProposition 1.4.2 Let A be a diffusion operator on M along the sub-bundle E\nof T M. There is a unique lift of A to a smooth diffusion generator AS along the\nS\ntransversal bundle S. Write δ̄ = δ A . Then AS is determined by\n(i) δ̄(ψ) = 0 if ψ annihilates S.\n(ii) δ̄ (p∗ φ) = (δ A φ) ◦ p,\n\nfor φ ∈ Ω1 (M).\n\nMoreover (iii) for y ∈ N let hy : Ep(y) → Ty N be the right inverse of Ty p with\nimage Sy . Then\nS\n\n(a) σyA = hy σ A h∗y\n(b) If A is given by\nA=\n\nN\nX\n\naij LX i LX j + LX 0\n\n(1.8)\n\ni,j=1\n\nwhere X 1 , . . . , X N and X 0 are sections of E then\nS\n\nA =\n\nN\nX\n\n(aij ◦ p) LX̄ i LX̄ j + LX̄ 0\n\n(1.9)\n\ni,j=1\n\nfor X̄ j (y) = hy (X j (p(y)).\nProof. Lemma 1.4.1 ensures that (i) and (ii) determine δ̄ uniquely as a smooth\noperator on smooth 1-forms if it exists. On the other hand we can represent A\nS\nas in (1.8) and define AS be (1.9). It is straightforward to check that then δ A\nsatisfies (i) and (ii).\nBy definition and the observation after (1.9) this must be the horizontal lift, if\nit is a diffusion generator. On the other hand if A is given by (1.8) we use it to\nS\nS\ndefine AS by (1.9). It is easy to see that δ A satisfies (i) and (ii) and so δ A = δ̄.\nFrom this Ā = AS and AS is a smooth diffusion generator.\nIn the terminology of section 1.3 Su = ker[Tu p], sometimes written as V Tu N,\nis a distribution.\nDefinition 1.4.3 When an operator B is along the vertical distribution ker[T p] we\nsay B is vertical, and when there is a horizontal distribution such as {Hu : u ∈ N}\nas given by Proposition 2.1.2 below and B is along that horizontal distribution we\nsay B is horizontal .\n\n\fCHAPTER 1. DIFFUSION OPERATORS\n\n18\n\nProposition 1.4.4 Let B be a smooth diffusion operator on N and p : N → M\nany smooth map, then the following conditions are equivalent:\n(1) The operator B is vertical.\n\nP\nij\n(2) The operator B has a expression of the form of m\nj=1 a LY i LY j + LY 0\nwhere aij are smooth functions and Y j are smooth sections of the vertical\ntangent bundle of T N.\n(3) B(f ◦ p) = 0 for all C 2 f : M → R.\nProof. (a). From (1) to (3) is trivial. From (3) to (1) note that every φ which vanishes on vertical vectors is a linear combination of elements of the form f p∗ (dg)\nfor some smooth g : M → R by Lemma 1.4.1. To show that B is vertical we only\nneed to show that δ B (f p∗ (dg)) = 0. But B(g ◦ p) = 0 implies δ B (p∗ (dg)) = 0\nand also p∗ (dg)σ B (p∗ (dg)) = 21 B(g ◦ p)2 − (g ◦ p)B(g ◦ p) = 0. By semiellipticity of B, σ B (p∗ (dg)) = 0. Thus assertion (1) follows since δ B (f p∗ (dg)) =\ndf σ B (p∗ (dg)) + f * δ B (p∗ (dg)) from Proposition 1.2.1(1), and so (1) and (3) are\nequivalent.\nEquivalence of (1) and (2) follows from Proposition 1.3.4.\nRemark 1.4.5 (1) If B is vertical, then by Proposition 1.2.1, for all C 2 functions f1 on N and f2 on M, B (f1 (f2 ◦ p)) = (f2 ◦ p)Bf1 ;\n(2) If B and B′ are both over a diffusion operator A of constant rank nonzero\nrank such that A is along the image of σ A , then B − B′ is not in general\nvertical, although (B − B′ )(f ◦ p) = 0 for all C 2 function f : M → R,\nsince it may not be semi-elliptic. For example take p : R2 → R to be\n∂2\n∂2\n∂2\n′\nthe projection p(x, y) = x with A = ∂x\n=\n2 , B = ∂x2 + ∂y 2 . Let B\n∂2\n∂x2\n\n2\n\n2\n\n2\n\n∂\n∂\n∂\n′\n+ ∂y\n2 + ∂x∂y . Then B is also over A but B − B = − ∂x∂y is not vertical.\n\n\fChapter 2\nDecomposition of Diffusion\nOperators\nConsider a smooth map p : N → M between smooth manifolds M and N. By a\nlift of a diffusion operator A on M over p we mean a diffusion operator B on N\nsuch that\nB(f ◦ p) = (Af ) ◦ p\n(2.1)\n\nfor all C 2 functions f on M. In this situation we adopt the following terminology:\nDefinition 2.0.6 If (2.1) holds we say that B is over A, or that A and B are\nintertwined by p. A diffusion operator B on N is said to be projectible (over p),\nor p-projectible, if it is over some diffusion operator A.\nRecall that the pull back p∗ φ of a 1-form φ is defined by\n\np∗ (φ)u = φp(u) (T p(−)) = (T p)∗ φp(u) .\nFor our map p : N → M, a diffusion operator B is over A if and only if\nδ B (p∗ φ)) = (δ A φ)(p),\n\n(2.2)\n\nfor all φ ∈ C 1 ∧1 T ∗ M.\n\n2.1 The Horizontal Lift Map\nLemma 2.1.1 Suppose that B is over A. Let σ B and σ A be respectively the symbols for B and A. Then\nA\n(Tu p)σuB (Tu p)∗ = σp(u)\n,\n\n19\n\n∀u ∈ N,\n\n(2.3)\n\n\f20\n\nCHAPTER 2. DECOMPOSITION OF DIFFUSION OPERATORS\n\ni.e. the following diagram is commutative :\nTu∗ N\n\nσuB\n\n✲\n\nTu N\n\n✻\n\n(Tu p)∗\n∗\nTp(u)\nM\n\nTu p\nA\nσp(u)\n\n❄\n✲ Tp(u) M.\n\nProof. Let f and g be two smooth functions on M. Then for u ∈ N, x = p(u),\n1\n1\n1\nA(f g)(x) − (f Ag)(x) − (gAf )(x)\n2\n2\n2\n1\n1\n1\nB ((f g) ◦ p) (u) − f ◦ pB(g ◦ p)(u) − g ◦ pB(f ◦ p)(u)\n=\n2\n2\n2\nB\n= d (g ◦ p)u σu (d (f ◦ p)u )\n= (dg ◦ Tu p) σuB (df ◦ Tu p) ,\n\n(dfx ) σxA (dgx ) =\n\nwhich gives the desired equality.\nFor x in M, set Ex := Image[σxA ] ⊂ Tx M. If σ A has constant rank, i.e.\ndim[Ex ] is independent of x, then E := ∪x Ex is a smooth sub-bundle of T M.\nProposition 2.1.2 Assume σ A has constant rank and B is over A. Then there is a\nunique, smooth, horizontal lift map hu : Ep(u) → Tu N, u ∈ N, characterised by\nA\nhu ◦ σp(u)\n= σuB (Tu p)∗ .\n\n(2.4)\n\nhu (v) = σuB ((Tu p)∗ α)\n\n(2.5)\n\nIn particular\n∗\nA\nwhere α ∈ Tp(u)\nM satisfies σp(u)\n(α) = v.\n\nProof. Clearly (2.5) implies (2.4) by Lemma 2.1.1 and so it suffices to prove hu\nis well defined by (2.5). For this we only need to show σ B ((Tu p)∗ (α)) = 0 for\nA\nevery α in ker[σp(u)\n]. Now σ A α = 0 implies that\n(T p)∗ (α)σ B ((T p)∗ α) = 0,\nby Lemma 2.1.1. Considering σ B as a semi-definite bilinear form this implies\nσuB (Tu p)∗ α vanishes as required.\n\n\f2.1. THE HORIZONTAL LIFT MAP\n\n21\n\nNote that the vertical distribution ker[T p] is regular as ker[T p] is annihilated\nby all differential 1-forms of the form θ ◦ T p.\nLet Hu = Image[hu ] and H = ⊔u Hu . Set Fu = (Tu p)−1 [Ep(u) ] so we have a\nsplitting\nFu = Hu + V Tu N\n(2.6)\nwhere V Tu N = ker[Tu P ] the 'vertical' tangent space at u to N. In the elliptic\ncase p is a submersion, the vertical tangent spaces have constant rank, and F :=\n⊔u Fu is a smooth sub-bundle of T N. In this case we have a splitting of T N,\na connection in the terminology of Kolar-Michor-Slovak [42]. In general we\nwill define a semi-connection on E to be a sub-bundle Hu of T N such that Tu p\nmaps each fibre Hu isomorphically to Ep(u) . In the equivariant case considered in\nChapter 3 such objects are called E-connections by Gromov. For the case when\n: N → M is the tangent bundle projection , or the orthonormal frame bundle\nnote that the \"partial connections\" as defined by Ge in [35] are rather different\nfrom the semi-connections we would have: they give parallel translations along\nE-horizontal paths which send vectors in E to vectors in E, and preserve the\nRiemannian metric of E , whereas the parallel transports of our semi-connections\ndo not in general preserve the fibres of E, nor any Riemannian metric, and they\nact on all tangent vectors.\nLemma 2.1.3 Assume σ A has constant rank and B is over A. For all u ∈ N the\nimage of σuB is in Fu .\nProof. Suppose α ∈ Tu∗ N with \u0001σ B (α) 6∈ Fu . Then there exists k in the annihilator\nof Ep(u) such that k Tu p σ B (α) 6= 0. However\n\u0001\n\u0001\nA\nk Tu p σ B (α) = α σ B ((Tu p)∗ (k)) = α hu σp(u)\n(k)\n\nA\n∗\n(k) = 0 because for all β ∈ Tp(u)\nM,\nby Proposition 2.1.2; while σp(u)\nA\nA\nβ σp(u)\n(k) = k σp(u)\n(β) = 0\n\ngiving a contradiction.\nProposition 2.1.4 Let A be a diffusion operator on M with σ A of constant rank.\nFor i ∈ {1, 2}, let pi : N i → M be smooth maps and Bi be diffusion operators\non N i over A. Let F : N 1 → N 2 be a smooth map with p2 ◦ F = p1 . Assume F\n\n\f22\n\nCHAPTER 2. DECOMPOSITION OF DIFFUSION OPERATORS\n\nintertwines B1 and B2 . Let h1 , h2 be the horizontal lift maps determined by A, B1\nand A, B2 . Then\nh2F (u) = Tu F (h1u ),\nu ∈ N 1;\n(2.7)\ni.e. the diagram\nTu F\n\nTu N 1\n\n✲\n\nTF (u) N 2\n\n✒\n\n❅\n■\n❅\nh1u❅\n❅\n❅\n\nh2F (u)\n\nEp1 (u)\ncommutes for all u ∈ N.\nProof. Since F intertwines B1 and B2 , Lemma 2.1.1 gives\n2\n\n1\n\nσFB (u) = Tu F ◦ σuB ◦ (Tu F )∗ .\nNow take α ∈ Tp∗1 (u) M with σpA1 (u) (α) = v, some given v ∈ Ep1 (u) . From (2.5)\n2\n\nh2F (u) (v) = σFB (u) ((T p2 )∗ α)\n1\n\n= Tu F ◦ σuB ◦ (Tu F )∗ (T p2 )∗ α\n1\n\n= Tu F ◦ σuB (Tu p1 )∗ α\n= Tu h1u (v)\n\nas required.\nDefinition 2.1.5 A diffusion operator B on N will be said to have projectible\nsymbol for p : N → M if there exists a map η : T ∗ M → T M such that for all\nu ∈ N the diagram:\nTu∗ N\n\nσuB\n\n✲\n\nTu N\n\n✻\n\n(Tu p)∗\n∗\nTp(u)\nM\n\nTu p\nηp(u)\n\n❄\n✲ Tp(u) M.\n\ncommutes, i.e. if (Tu p)σuB (Tu p)∗ depends only on p(u).\n\n\f2.2. EXAMPLE: THE HORIZONTAL LIFT MAP OF SDES\n\n23\n\nIn this case we also get a uniquely defined horizontal lift map as in Proposition\n2.1.4 defined by equation (2.7) using η instead of the symbol of A. This situation\narises naturally in the standard non-linear filtering literature as described later see\nchapter 5.\n\n2.2 Example: The Horizontal Lift Map of SDEs\nLet us consider the horizontal lift connection in more detail when B and A are\ngiven by stochastic differential equations. For this write A and B in Hörmander\nform corresponding to factorisations σxA = X(x)X(x)∗ and σxB = X̃(x)X̃(x)∗\nfor\nX(x) : Rm → Tx M,\nx∈M\nX̃(u) : Rm̃ → Tu N,\n\nu ∈ N.\n\nThen X(x) maps onto Ex for each x ∈ M. Define Yx : Ex → Rm to be its right\ni−1\nh\ninverse: Y (x) = X(x) ker X(x)⊥\n.\n\nLemma 2.2.1 For each u ∈ N there is a unique linear lu : Rm → Rm̃ such that\nker lu = ker X(x) and the diagram\n\nTu∗ N\n\nX̃(u)∗\n\n✲\n\n✻\n\nX̃(u)\n\n✲Tu N\n\n✻\n\n(Tu p)∗\nTx∗ M\n\nRm̃\nlu\n\n✲\n\nRm\n\nTu p\n❄\n✲Tx M\n\nX(x)\nX(x)∗\nA\nB\ncommutes, for x = p(u), i.e. σx = Tu p ◦ σx (Tu p)∗ and X(x) = Tu p ◦ X̃(u) ◦ lu .\nIn particular the horizontal lift map is given by hu = X̃(u)lu Y (p(u)).\nProof. The larger square commutes by Lemma 2.1.1. For the rest we need to\nconstruct lu . It suffices to define lu on [ker X(x)]⊥ . Note that [ker X(x)]⊥ =\nImage X(x)∗ in Rm . We only have to show that α ∈ ker X(x)∗ implies\nX̃(u)∗ (Tu p)∗ α = 0.\n\n\fCHAPTER 2. DECOMPOSITION OF DIFFUSION OPERATORS\n\n24\n\nIn fact for such α the proof of part (i) of Proposition 2.1.2 is valid and therefore\n(Tu p)∗ α ∈ ker σuB . However since X̃(u) is injective on the image of X̃(u)∗ we\nsee ker σuB = ker X̃(u). . Thus lu is defined with kerlu = ker X(x) and such that\nthe left hand square of the diagram commutes. Since the perimeter commutes it\nis easy to see from the construction of lu that the right hand side also commutes.\nThe uniqueness of lu with kernel equal that of X(x) is clear since on [ker X(x)]⊥\nlu (e) = X̃(u)∗ (Tu p)∗ X(x)(e).\nNote. The horizontal lift of X(x), which can be used to construct a Hörmander\nform representation X V of AH , as in Proposition 2.3.5 and Theorem 3.2.1 below\nis given by:\nX V (u) : Rm → Tu P\nX V (u) = hu X(u) = X̃(u)lu\n\nsince Yx X(x) is the projection onto ker X(x)⊥ . (In the terminology of ElworthyLeJan-Li [27] X V does not involve the 'redundant noise'.) Furthermore consider\nthe special case that m̃ = m and also that X̃ and X are p-related, i.e.\nTu p(X̃(u)e) = X(p(u))e,\n\nu ∈ N, e ∈ Rm .\n\nThen lu is the projection of Rm onto [ker X(p(u))]⊥ :\nlu = Y (p(u))X(p(u))\ngiving\nhu = X̃(u)Y (p(u))\n\n(2.8)\n\nIn this case the 'diffusion coefficients' X V , above, is obtained from X̃ by restriction to the 'relevant noise' for X.\n\n2.3 Lifts of Cohesive Operators & Decomposition\nTheorem\nA diffusion generator L on a manifold is said to be cohesive if\n(i) σxL , x ∈ X, has constant non-zero rank and\n(ii) L is along the image of σ L .\n\n\f2.3. LIFTS OF COHESIVE OPERATORS & DECOMPOSITION THEOREM 25\nRemark 2.3.1 From Theorem 2.1.1 in Elworthy-LeJan-Li [27] we see that if the\nrank of σxL is bigger than 1 for all x then L is cohesive if and only if it has a\nrepresentation\nm\n1X\nL=\nLX j LX j\n2 j=1\nwhere Ex = span{X 1 (x), . . . X m (x)} has constant rank.\n\nProposition 2.3.2 Let B be a smooth diffusion operator on N over A with A\ncohesive. The following are equivalent:\n(i) B = AH\n(ii) B is cohesive and Tu p is injective on the image of σuB for all u ∈ N.\n(iii) B can be written as\nm\n\n1X\nL j L j + LX̃ 0\nB=\n2 j=1 X̃ X̃\nwhere X̃ 0 , . . . , X̃ m are smooth vector fields on N lying over smooth vector\nfields X 0 , . . . , X m on M, i.e. Tu p(X̃ j (u)) = X j (p(u)) for u ∈ N for all j.\nP\nProof. If (i) holds take smooth X 1 , . . . X m with A = 12 m\nj=1 LX j LX j + LX 0 , by\nj\nj\nProposition 1.3.4, and set X̃ (u) = hu X (p(u)) to see (iii) holds. Clearly (iii)\nimplies (ii) and (ii) implies (i), so the three statements are equivalent.\nDefinition 2.3.3 If any of the equivalent conditions of the proposition holds we\nsay that B has no vertical part.\nRecall that is S is a distribution, S 0 denotes the set of annihilators of S.\nLemma 2.3.4 For l ∈ Hu0 and k ∈ (Vu T N)0 , some u ∈ N we have:\nA. lσ B (k) = 0\nH\n\nB. σ B (k) = σ A (k)\nH\n\nC. σ A (l) = 0.\nIn particular Hu is the orthogonal complement of V Tu N∩Image(σuB ) in Image(σuB )\nwith its inner product induced by σuB .\n\n\f26\n\nCHAPTER 2. DECOMPOSITION OF DIFFUSION OPERATORS\n\nProof. Set x = p(u). For part A and part B it suffices to take k = φ ◦ Tu p some\nφ ∈ Tx∗ M. Then by (2.4), σuB (φ ◦ Tu p) = hu ◦ σxA (φ) giving part A, and also part\nB by Proposition 1.4.2 (iii)(a) since φ = h∗u (φ ◦ Tu p), part C comes directly from\nProposition 1.4.2 (iii)(a).\nTheorem 2.3.5 For B over A with A cohesive there is a unique decomposition\nB = B1 + BV\nwhere B1 and BV are smooth diffusion generators with BV vertical and B1 over A\nhaving no vertical part. In this decomposition B1 = AH , the horizontal lift of A\nto H.\nProof. Set BV = B − AH . To see that BV is semi-elliptic take u ∈ N and observe\nthat any element of Tu∗ N can be written as l + k where l ∈ Hu0 and k ∈ (V Tu N)0\nby Lemma 2.3.4 and\n(l + k)σ B (l + k) = lσ B (l) > 0.\nSince BV (f ◦ p) = 0 any f ∈ C 2 (M; R) Proposition 1.4.4 implies BV is vertical.\nUniqueness holds since the semi-connections determined by B and B′ are the\nsame by Remark 1.3.2(i) applied to BV and so by Proposition 2.3.2 we must have\nB 1 = AH .\nFor p a Riemannian submersion and B the Laplacian, Berard-Bergery and Bourguignon [7] define BV directly by BV f (u) = ∆Nx (f |Nx )(u) for x = p(u) and\nNx = p−1 (x) with ∆Nx the Laplace-Beltrami operator of Nx .\nExample 2.3.6\n1. Take N = S 1 × S 1 and M = S 1 with p the projection on\nthe first factor. Let\nB=\n\n1 ∂2\n∂2\n∂2\n+\n)\n+\ntan\nα\n.\n2 ∂x2 ∂y 2\n∂x∂y\n2\n\n∂\nHere 0 < α < π4 so that B is elliptic. Then A = 21 ∂x\n2\n2\n2\n∂\n1 ∂\n∂2\n∂2\nH\nwith\nA\n=\n(\n+(tan\nα)2 ∂y\nand BV = 12 (1−(tan α)2 ) ∂y\n2\n2 )+tan α ∂x∂y .\n2 ∂x2\nThis is easily checked since, with this definition AH has Hörmander form\n\n∂\n1 ∂\n+ tan α )2\nAH = (\n2 ∂x\n∂y\n\n\f2.3. LIFTS OF COHESIVE OPERATORS & DECOMPOSITION THEOREM 27\nand so is a diffusion operator which has no vertical part. Also BV is clearly\nvertical and elliptic. Note that this is an example of a Riemannian submersion: several more of a similar type can be found in [7]. In this case\nthe horizontal distribution is integrable and if α is irrational the foliation it\ndetermines has dense leaves.\n2. Take N = R3 with Heisenberg group structure. This is defined by\n\u0001\n1\n(x, y, z) * (x′ , y ′, z ′ ) = x + x′ , y + y ′, z + z ′ + (xy ′ − yx′ ) .\n2\n\nLet X, Y, Z be the left-invariant vector fields which give the standard basis\nfor R3 at the origin. As operators:\n1 ∂\n∂\n− y ,\n∂x 2 ∂z\n∂\nZ(x, y, z) =\n.\n∂z\n\nX(x, y, z) =\n\nY (x, y, z) =\n\n∂\n1 ∂\n+ x\n∂y 2 ∂z\n\nTake B to be half the sum of the squares of X, Y , and Z. This is half the\nleft invariant Laplacian:\n\u0012\n\u0013\n∂2\n1 2\n∂2\n1\n∂2\n∂2\n1 ∂2\n2\n+\n+ (1 + (x + y )) 2 + (x\n−y\n) .\nB=\n2 ∂x2 ∂y 2\n4\n∂z\n2 ∂y∂z\n∂x∂z\nTake M = R2 and p : R3 → R2 to be the projection on the first 2 coordinates. Then\n1 ∂2\n∂2\n( 2 + 2 ),\n2 ∂x\n∂y\n1 2 1 ∂2\n=\nZ =\n.\n2\n2 ∂z 2\n\nA =\nBV\n\n1\nAH = (X 2 + Y 2 );\n2\n\nNote that the horizontal lift σ̃, of a smooth curve σ : [0, T ] → M with\nσ(0) = 0, is given by\n\u0013\n\u0012\nZ\n\u0001\n1 t 1\n2\n2\n1\n1\n2\nσ (t)dσ (t) − σ (t)dσ (t) .\n(2.9)\nσ̃(t) = σ (t), σ (t),\n2 0\n\nThus the \"vertical\" component of the horizontal lift is the area integral of\nthe curve. Equation (2.9) remains valid for the horizontal lift of Brownian motion on R2 , or more generally for any continuous semi-martingale,\n\n\f28\n\nCHAPTER 2. DECOMPOSITION OF DIFFUSION OPERATORS\nprovided it is interpreted as a Stratonovich equation ( or equivalently an\nIto equation in the Brownian motion case). This example is also that of\na Riemannian submersion. In this case the horizontal distributions are not\nintegrable. Indeed the Lie brackets satisfy [X, Y ] = Z and Hörmander's\ncondition for hypoellipticity: a diffusion operator L satisfies Hörmander's\ncondition if for some (and hence all) Hörmander form representation such\nas in equation (1.7) the vector fields Y 1 , . . . , Y m together with their iterated Lie brackets span the tangent space at each point of the manifold. For\nan enjoyable discussion of the Heisenberg group and the relevance of this\nexample to \"Dido's problem\" see [52]. See also [3],[9], and [36].\n\nRecall that F ≡ ⊔u Fu = ∪u (Tu p)−1 [Ep(u) ], we can now strengthen Lemma\n2.1.3 which states that Image[σuB ] ⊂ Fu .\nCorollary 2.3.7 If B is over A with A cohesive, then B is along F .\nProof. Since Hu ∈ Fu and V Tu N ⊂ Fu both B1 and B V are along F .\n\n2.4 Diffusion Operators with Projectible Symbols\nGiven p : N → M as before, suppose now that we have a diffusion operator B\non M with a projectible symbol, c.f. Definition 2.1.5. This means that σ B lies\nover some positive semi-definite linear map η : T ∗ M → T M. Assume that η has\nconstant rank. We will show that in this case we also have a decomposition of B.\nTo do this first choose some cohesive diffusion operator A on M with σ A = η. In\ngeneral there is no canonical way to do this, though if η were non-degenerate we\ncould choose A to be a multiple of the Laplace-Beltrami operator of the induced\nmetric on M.\nFrom above we also have an induced semi-connection with horizontal subbundle H, say, of T N.\nDefinition 2.4.1 We will say that B descends cohesively (over p) if it has a projectible symbol and there exists a horizontal vector field, bH , such that\nB − LbH\nis projectible over p.\n\n\f2.4. DIFFUSION OPERATORS WITH PROJECTIBLE SYMBOLS\n\n29\n\nThe following is a useful observation. Its proof is immediate from the two lemmas\nand proposition which are given after it:\nProposition 2.4.2 If B descends cohesively then for each choice of A satisfying\nA\nσp(u)\n= Tu pσuB (Tu p)∗ there is a horizontal vector field bH such that B − LbH lies\nover A.\nLemma 2.4.3 Assume that η has constant rank. If f is a function on M let f ̃ =\nf ◦ p. For any choice of A with symbol η the map\n])\nf 7→ B(f ̃) − A(f\nis a derivation from C ∞ M to C ∞ N where any f ∈ C ∞ M acts on C ∞ N by\nmultiplication by f ̃.\nProof. The map is clearly linear and for smooth f, g : M → R we have\n^\nη(df,\ndg) = σ B (df ̃, dg̃)\nso by definition of symbols:\n^\n])g̃ − A(g)\n] f ̃\nB(f ̃g̃) − A(f\ng) = B(f ̃)g̃ + B(g̃)f ̃ − A(f\nas required.\nLet D denote the space of derivations from C ∞ M to C ∞ N using the above action.\nNote that for p∗ T M → N the pull back of T M over p, the space C ∞ Γp∗ T M of\nsmooth sections of p∗ T M can be considered as the space of smooth functions\nV : N → T M with V (u) ∈ Tp(u) M for all u ∈ N. We can then define\nΘ : C ∞ Γp∗ T M → D\nby\nΘ(V )(f )(u) = dfp(u) (V (u)).\nLemma 2.4.4 Assume that η has constant rank The map Θ : C ∞ Γp∗ T M → D is\na linear bijection.\n\n\f30\n\nCHAPTER 2. DECOMPOSITION OF DIFFUSION OPERATORS\n\nProof. Let d ∈ D. Fix u ∈ N. The map from C ∞ M to R given by f 7→ df (u)\nis a derivation at p(u), here the action of any f ∈ C ∞ M on R is multiplication\nby f (p(u)), and so corresponds to a tangent vector, V (u) say, in Tp(u) M. Then\ndf (u) = dfp(u) (V (u)). By assumption df (u) is smooth in u, and so by suitable\nchoices of f we see that V is smooth. Thus Θ(V ) = d and Θ has an inverse.\n\nFrom these lemmas we see there exists b ∈ C ∞ Γp∗ T M with the property that\n\u0010\n\u0011\n\u0001\nf (u) = dfp(u) b(u)\nBf ̃ − Af\n(2.10)\n\nfor all u ∈ N and f ∈ C ∞ M. Assume that b has image in the subbundle E of\nT M determined by η. Using the horizontal lift map h determined by B define a\nvector field bH on N:\n\u0001\nbH (u) = hu b(u) .\n\nProposition 2.4.5 Assume that η has constant rank and that b has image in the\nsubbundle E determined by η. The vector field bH is such that B − bH is over A.\nProof. For f ∈ C ∞ M,\nf + df (b(−)) − df ◦ T p(bH (−)) = Af\nf\n(B − bH )(f ̃) = Af\n\u0001\nusing the fact that T p bH (−) = b(−).\n\nWe can now extend the decomposition theorem:\n\nTheorem 2.4.6 Let B be a diffusion operator on N which descends cohesively\nover p : N → M. Then B has a unique decomposition:\nB = BH + BV\ninto the sum of diffusion operators such that\n(i) BV is vertical\nH\n\n(ii) BH is cohesive and Tu p is injective on the image of σuB for all u ∈ N.\nWith respect to the induced semi-connection BH is horizontal.\n\n\f2.5. HORIZONTAL LIFT OF PATHS & COMPLETENESS OF SEMI-CONNECTIONS 31\nProof. Using the notation of the previous proposition we know that B − bH is\nover a cohesive diffusion operator A. By Theorem 2.3.5 we have a canonical\ndecomposition\nB − bH = B1 + BV ,\nleading to\nB = (bH + B1 ) + BV .\n\nIf we set BH = bH + B1 we have a decomposition as required. On the other hand\nif we have two such decompositions of B we get two decompositions of B − bH .\nBoth components of the latter must agree by the uniqueness in Theorem 2.3.5, and\nso we obtain uniqueness in our situation.\nExtending Definition 2.3.3 we could say that a diffusion operator BH satisfying\ncondition (ii) in the theorem has no vertical part.\nNote that if we drop the hypothesis that bH is horizontal, or equivalently that\nb in Proposition 2.4.5 has image in E, we still get a decomposition by taking an\narbitrary lift of b to be bH but we will no longer have uniqueness.\n\n2.5 Horizontal lift of paths & completeness of semiconnections\nA semi-connection on p : N → M over a sub-bundle E of T M gives a procedure\nfor horizontally lifting paths on M to paths on N as for ordinary connections but\nnow we require the original path to have derivatives in E; such paths may be\ncalled E-horizontal.\nDefinition 2.5.1 A Lipschitz path σ̃ in N is said to be a horizontal lift of a path\nσ in M if\n• p ◦ σ̃ = σ\n• The derivative of σ̃ almost surely takes values in the horizontal subbundle\nH of T N.\nNote that a Lipschitz path σ : [a, b] → M with σ̇(t) ∈ Eσ(t) for almost all\na 6 t 6 b has at most one horizontal lift from any starting point ua in p−1 (σ(a)).\nTo see this first note that any such lift must satisfy\n ̇\nσ̃(t)\n= hσ̃(t) σ̇(t).\n\n(2.11)\n\n\f32\n\nCHAPTER 2. DECOMPOSITION OF DIFFUSION OPERATORS\n\nThis equation can be extended to give an ordinary differential equation on all of\nN. For example take a smooth embedding j : M → Rm into some Euclidean\nspace. Set β(t) = j(σ(t)). Let X(x) : Rm → Ex be the adjoint of the restriction\nof the derivative Tx j of j to Ex , using some Riemannian metric on E. Then σ\nsatisfies the differential equation\nẋ(t) = X(x(t))(β̇(t))\n\n(2.12)\n\nand it is easy to see that the horizontal lifts of σ are precisely the solutions of\nu̇(t) = hu(t) X(p(u(t)))(β̇(t))\nstarting from points above σ(a) and lasting until time b.\nIn the generality in which we are working there may not be any such solutions, for example because of \"holes\" in N. We define the semi-connection to\nbe complete if every Lipschitz path σ with derivatives in E almost surely, has a\nhorizontal lift starting from any point above the starting point of σ.\nNote that completeness is assured if the fibres of N are compact, or if an X,\nwith values in E, and β, can be found so that σ is a solution to equation (2.12) and\nthere is a complete metric on N for which the horizontal lift of X is bounded on\nthe inverse image of σ under p. In particular the latter will hold if p is a principal\nbundle and we have an equivariant semi-connection as in the next chapter. It will\nalso hold if there is a complete metric on N for which the horizontal lift map\nhu ∈ L(Ep(u) ; Tu N) is uniformly bounded for u in the image of σ.\n\n2.6 Topological Implications\nAlthough our set up of intertwining diffusions with a cohesive A seems quite\ngeneral it implies strong topological restrictions if the manifolds are compact and\nmore generally. Here we partially extend the approach Hermann used for Riemannian submersions in [37] with a more detailed discussion in Chapter 6 below.\nFor this let D 0 (x) be the set of points z ∈ M which can be reached by Lipschitz curves σ : [0, t] → M with σ(0) = x0 and σ(t) = z with derivative in E\nalmost surely. Its closure D ′ (x) relates to the propagation set for the maximum\nprinciple for A, and to the support of the A- diffusion as in Stroock-Varadhan\n[66], see Taira[70].\nTheorem 2.6.1 For B and A as before with A cohesive take x0 ∈ M and z ∈\nD 0 (x0 ). Assume the induced semi-connection is complete. Then if p−1 (x0 ) is a\n\n\f2.6. TOPOLOGICAL IMPLICATIONS\n\n33\n\nsubmanifold of N so is p−1 (z) and they are diffeomorphic. Also if z is a regular\nvalue of p so is x.\nProof. Let σ; [0, T ] → M be a Lipschitz E-horizontal path from x to z. There\nis a smooth factorisation σxA = X(x)X(x)∗ for X(x) ∈ L(Rm; Tx M), x ∈ M.\nTake the horizontal lift X̃ : R, → T N of X.\nBy the completeness hypothesis the time dependent ODE on N,\n\u0010\n\u0011−1\ndys\n= X̃(ys )X σ(s)|[ker X(x0 )]⊥\n(σ̇(s))\nds\nwill have solutions from each point above σ(0) defined up to time T and so a\nflow giving the required diffeomorphism of fibres. Moreover, by the usual lower\nsemi-continuity property of the \"explosion time\", this holonomy flow gives a diffeomorphism of a neighbourhood of p−1 (x) in N with a neighbourhood of the\nfibre above z. The diffeomorphism commutes with p. Thus if one of x and z is a\nregular value so is the other.\nCorollary 2.6.2 Assume the conditions of the theorem and that E satisfies the\nstandard Hörmander condition that the Lie algebra of vector fields generated by\nsections of E spans each tangent space Ty M after evaluation at y. Then p is a\nsubmersion all of whose fibres are diffeomorphic.\nProof. The Hörmander condition implies that D 0 (x) = M for all x ∈ M by\nChow's theorem (e.g. see Sussmann [69] or [36]. In [36] Gromov shows that\nunder this condition any two points of M can be joined by a smooth E-horizontal\ncurve.\nCorollary 2.6.3 Assume the conditions of the theorem and that D 0 (x) is dense in\nM for all x ∈ M and p : N → M is proper. Then p is a locally trivial bundle over\nM.\nProof. Take x ∈ M. The set Reg(p) of regular values of p is open by our properness assumption. It is also non-empty, even dense in M, by Sard's theorem, and\nso since D 0 (x) is dense, there exists a regular value z which is in D 0 (x). It follows\nfrom the theorem that x ∈ Reg(p), and so p is a submersion. However it is a well\nknown consequence of the inverse function theorem that a proper submersion is a\nlocally trivial bundle.\nNote that we only need Reg(p) to be open, rather than p proper, to ensure that\np is a submersion. The density of D 0 (x) can hold because of global behaviour,\nfor example if M is a torus and E is tangent to the foliation given by an irrational\nflow.\n\n\f34\n\nCHAPTER 2. DECOMPOSITION OF DIFFUSION OPERATORS\n\n\fChapter 3\nEquivariant Diffusions on Principal\nBundles\nLet M be a smooth finite dimensional manifold and P (M, G) a principal fibre\nbundle over M with structure group G a Lie group. Denote by π : P → M the\nprojection and Ra right translation by a. Consider on P a diffusion generator B,\nwhich is equivariant, i.e. for all f ∈ C 2 (P ; R),\nBf ◦ Ra = B(f ◦ Ra ),\n\na ∈ G.\n\nSet f a (u) = f (ua). Then the above equality can be written as Bf a = (Bf )a . The\noperator B induces an operator A on the base manifold M. Set\nu ∈ π −1 (x), f ∈ C 2 (M),\n\nAf (x) = B (f ◦ π) (u),\n\n(3.1)\n\nwhich is well defined since\nB (f ◦ π) (u * a) = B ((f ◦ π)a ) (u) = B ((f ◦ π)) (u).\n\n3.1 Invariant Semi-connections on Principal Bundles\nDefinition 3.1.1 Let E be a sub-bundle of T M and π : P → M a principal Gbundle. An invariant semi-connection over E, or principal semi-connection\nin the terminology of Michor, on π : P → M is a smooth sub-bundle H E T P of\nT P such that\n35\n\n\f36 CHAPTER 3. EQUIVARIANT DIFFUSIONS ON PRINCIPAL BUNDLES\n(i) Tu π maps the fibres H E Tu P bijectively onto Eπ(u) for all u ∈ P .\n(ii) H E T P is G-invariant.\nNotes.\n1. Such a semi-connection determines and is determined by, a smooth horizontal lift:\nhu : Eπ(u) → Tu P\nsuch that (i). Tu π ◦ hu (v) = v, for all v ∈ Ex ⊂ Tx M;\n(ii). hu*a = Tu Ra ◦ hu .\n2. The action of G on P induces a homomorphism of the Lie algebra g of G\nwith the algebra of left invariant vector fields on P : if A ∈ g,\nA∗ (u) =\n\nd\ndt\n\nu exp(tA),\nt=0\n\nu ∈ P,\n\nand A∗ is called the fundamental vector field corresponding to A.\nUsing the splitting (2.6) of Fu our semi-connection determines, (and is determined by), a 'semi-connection one-form' ̟ ∈ L(H + V T N; g) which\nvanishes on H and has ̟(A∗(u)) = A.\n3. Let F be an associated vector bundle to P with fibre V . An E semiconnection on P gives a covariant derivative ∇w Z ∈ Fx for w ∈ Ex , x ∈ M\nwhere Z is a section of F . This is defined, as usual for connections, by\n\u0001\n∇w Z = u d(Z̃)(hu (w)) ,\nu ∈ π −1 (x). Here Z̃ : P → V is\n\nZ̃(u) = u−1Z (π(u))\nconsidering u as an isomorphism u : V → Fπ(u) . This agrees with the\n'semi-connections on E' defined in Elworthy-LeJan-Li [27] when P is taken\nto be the linear frame bundle of T M and F = T M.\nTheorem 3.1.2 Assume σ A has constant rank. Then σ B gives rise to an invariant\nsemi-connection on the principal bundle P whose horizontal map is given by (2.5).\n\n\f3.1. INVARIANT SEMI-CONNECTIONS ON PRINCIPAL BUNDLES\n\n37\n\nProof. It has been shown that hu is well defined by (2.5). Next we show hu\ndefines a semi-connection. As noted earlier, h defines a semi-connection if (i)\nTu π ◦ hu (v) = v, v ∈ Ex ⊂ Tx M and (ii) hu*a = Tu Ra ◦ hu . The first is immediate\nby Lemma 2.1.1 and for the second observe π ◦ Ra = π. So T π ◦ T Ra = T π and\n(T π)∗ = (T Ra )∗ * (T π)∗ while the following diagram\n\nTu∗ P\n\nσuB\n\n✲ Tu P\n\n✻\n\n(Tu Ra )∗\n∗\nTu*a\nP\n\nTu Ra\n✲\n\n❄\n\nTua P\n\nB\nσu*a\ncommutes by equivariance of B. Therefore\n\nTu Ra ◦ hu = Tu Ra * σuB (Tu π)∗ ◦ σxA\n\n\u0001−1\n\n= Tu Ra * σuB ◦ (Tu Ra )∗ ◦ (Tu*a π)∗ ◦ σxA\n\u0001−1\nB\n= σu*a\n◦ (Tu*a π)∗ ◦ σxA\n= hu*a .\n\n\u0001−1\n\nCurvature forms and holonomy groups etc for semi-connections are defined\nanalogously to those associated two connections, we note the following:\nProposition 3.1.3 In the situation of Proposition 2.1.4 suppose A is elliptic, p1 ,\np2 are principal bundles with groups G1 and G2 respectively, and F is a homomorphism of principal bundles with corresponding homomorphism f : G1 → G2 .\nLet Γ1 and Γ2 be the semi-connections on N 1 , N 2 determined by B1 and B2 . Then\n(i) Γ2 is the unique semi-connection on p2 : N 2 → M such that T F maps the\nhorizontal subspaces of T N 1 into those of T N 2 .\n\n(ii) If ω j , Ωj are the semi-connection and curvature form of Γj , for j = 1, 2,\nthen\nF ∗ (ω 2 ) = f∗ ◦ ω 1\nand\n\nF ∗ (Ω2 ) = f∗ ◦ Ω1\n\n\f38 CHAPTER 3. EQUIVARIANT DIFFUSIONS ON PRINCIPAL BUNDLES\nfor f∗ : g 1 → g 2 the homomorphism of Lie algebras induced by f .\n(iii) Moreover f : G1 → G2 maps the Γ1 holonomy group at u ∈ N 1 onto the\nΓ2 holonomy group at F (u) for each u ∈ N 1 and similarly for the restricted\nholonomy groups.\nProof. Proposition 2.1.4 assures us that T F maps horizontal to horizontal. Uniqueness together with (ii), (iii) come as in Kobayashi-Nomizu [41] (Proposition 6.1\non p79).\n\n3.2 Decompositions of Equivariant Operators\nTake a basis A1 , . . . , An of g with corresponding\nfields {A∗i }.\nP kfundamental vector\nWrite the semi-connection 1-form as ̟ =\n̟ Ak so that ̟ k are real valued,\npartially defined, 1-forms on P .\nIn our equivariant situation we can give a more detailed description of the\ndecomposition in Proposition 2.3.5.\nTheorem 3.2.1 Let B be an equivariant operator on P and A be the induced operator on the base manifold. Assume that A is cohesive and let B = AH +BV be the\ndecomposition\nof Proposition\n2.3.5. Then BV has a unique expression of the form\nX\nX\nαij LA∗i LA∗j +\nβ k LA∗k , where αij and β k are smooth functions on P , given\n\u0001\nby αkl = ̟ k σ B (̟ l ) , and β l = δ B (̟ l ) for ̟ the semi-connection 1-form on\nP . Define α : P → g ⊗ g and β : P → g by\nX\nX\nα(u) =\nαij (u)Ai ⊗ Aj ,\nβ(u) =\nβ k (u)Ak .\n(3.2)\nThese are independent of the choices of basis of g and are equivariant:\nα(ug) = (ad(g) ⊗ ad(g)) α(u)\nand\nβ(ug) = ad(g)β(u).\nProof. Since every vertical vector field is a linear combination of the fundamental\nvertical vector fields, Proposition 1.4.4, shows that\nX\nX\nBV =\nαi,j LA∗i LA∗j +\nβ k LA∗k\n\n\f3.2. DECOMPOSITIONS OF EQUIVARIANT OPERATORS\n\n39\nH\n\nfor certain functions αij , β k . For f, g : P → R setting σ := σ B−A ,\n\n1 X i,j\n1 X i,j\nα LA∗i LA∗j (f g) −\ngα LA∗i LA∗j (f )\n2\n2\n1 X i,j\nf α LA∗i LA∗j (g)\n−\n2\nX\n=\nαi,j LA∗i (f )LA∗j (g)\nX\n=\nαi,j df (Ai ∗ )dg(Aj ∗ ).\n\ndf (σ(dg)) =\n\nSince ̟(A∗k ) = Ak , we see that ̟ k (A∗l ) = δkl and\nX\n̟ k (σ(̟ l )) =\nαi,j δik δjl = αkl .\nH\n\nSince AH is horizontal σ A has image in the horizontal tangent bundle and so is\nannihilated by ̟ k . Thus\n\u0001\nαkl = ̟ k σ B (̟ l ) .\n(3.3)\nNote that by the characterisation, Proposition 1.2.1,\nX\nX\nV\nδB =\nαi,j LAi ∗ ιAj ∗ +\nβ k ιAk ∗ .\nV\n\nH\n\nSince ̟ l (A∗ l ) is identically 1, it follows that δ B (̟) = β l . Again δ A (̟ l ) = 0\nand so\nβ l = δ B (̟ l )\n(3.4)\nas required.\nFor the last part α and β can be considered as obtained from the extension\nof the symbol σ B and δ B to g-valued two and one forms respectively: α =\n̟(−)σ B ̟(−) and β = δ B (̟(−)). To make this precise consider σuB as a bilinear form and so as a linear map\nσuB : Tu∗ P ⊗ Tu∗ P → R.\nThe extension is the trivial one given by\nσuB ⊗ 1 ⊗ 1 : Tu∗ P ⊗ Tu∗ P ⊗ g ⊗ g → R ⊗ g ⊗ g ≃ g ⊗ g\nusing the identification of Tu∗ P ⊗ g with L(Tu P ; g). Similarly the extension of δ B\nis\nδuB ⊗ 1 : Tu∗ P ⊗ g → R ⊗ g ≃ g.\n\n\f40 CHAPTER 3. EQUIVARIANT DIFFUSIONS ON PRINCIPAL BUNDLES\nThus\n\n\u0001\nα(u)(ω ⊗ ω) = σ B ⊗ 1 ⊗ 1 (P23 ω ⊗ ω)\n\nwhere P23 : T ∗ P ⊗g⊗T ∗ P ⊗g → T ∗ P ⊗T ∗ P ⊗g⊗g is the standard permutation\nand βu (ω) = (δuB ⊗ 1)(ω).\nThe equivariance of ̟\n(Rg )∗ ̟ = ad(g −1 )(̟),\n\ng∈G\n\nis equivalent to the invariance of ̟ when considered as a section of T ∗ M ⊗ g\nunder\nT Rg ⊗ ad(g) : T ∗ M ⊗ g → T ∗ M ⊗ g,\ng ∈ G.\nP\nRemark 3.2.2 (a) For any equivariant operator of the form B = i,j αij LA∗i LA∗j +\nP k\nβ LA∗k with (αij (u)) positive semi-definite for each u ∈ P we can define maps α and β by (3.2). Note that α(u) is essentially the symbol of B\nrestricted to the fibre Pπ(u) through u:\nσuB |Pπ(u) : Tu∗ Pπ(u) → Tu Pπ(u)\nwith ̟u identifying Tu Pπ(u) with g. Similarly β determines δ B on a basis\nof sections of (V T P )∗.\n(b) Let {ut : 0 6 t 6 ζ} be\n2αkl (ut ) is the\nD Ra B-diffusionRon P . By (3.3),\nE\n*\n*\nderivative of the bracket\n̟uks ◦ dus , 0 ̟ul s ◦ dus of the integrals of\n0\nω k and ω l along {ut : 0 6 t < ζ}. See chapter 4 below for a detailed\ndiscussion. Thus α(ut) is the derivative of the tensor quadratic variation:\nZ\n\u0011\n1 d t\u0010\nα(ut ) =\n̟ut ◦ dut ⊗ ̟ut ◦ dut .\n2 dt 0\nRt\nMoreover by (3.4) and Lemma 4.1.2 below 0 β(us )ds is the bounded variRt\nation part of 0 ̟us ◦ dus .\n\n(c) If we fix u0 ∈ P and take an inner product on g we can diagonalise α(u0 )\nto write\nX\nα(u0 ) =\nμn An ⊗ An\nn\n\n\f3.3. DERIVATIVE FLOWS AND ADJOINT CONNECTIONS\n\n41\n\nwhere {An : n = 1, . . . dim(g)} is an orthonormal basis. The μn are the\neigenvalues of α(u0)# : g → g obtained using the isomorphism:\ng ⊗ g → L(g; g)\na ⊗ b 7→ (a ⊗ b)# ,\nwhere (a ⊗ b)# (v) = hb, via.\n\nP\nNote that for g ∈ G, α(u0 *g) = n μn ad(g)An ⊗ad(g)An . When the inner\ndim(g)\nproduct is ad(G)-invariant then {ad(g)An }n=1 is still orthonomal and the\n{μn }n are the eigenvalues of α(u0 * g)# . They are therefore independent of\nthe choice of u0 in a given fibre, (but depend on the inner product chosen).\n\n3.3 Derivative Flows and Adjoint Connections\nLet A on M be given in Hörmander form\nm\n\n1X\nLX j LX j + LA\nA=\n2 j=1\n\n(3.5)\n\nfor some smooth vector fields X 1 , . . . X m , A. As before let Ex = span{X 1 (x), . . . , X m (x)}\nand assume dim Ex is constant, denoted by p, giving a sub-bundle E ⊂ T M. The\nvector fields {X 1 (x), . . . , X m (x)} determine a vector bundle map\nX : Rm → T M\nwith σ A = X(x)X(x)∗ .\nWe can, and will, consider X as a map X : Rm → E. Let Yx be the right\ninverse [X(x)|ker X(x)⊥ ]−1 of X(x) and h, ix the inner product, induced on Ex by\n ̆ on E\nYx . Then X projects the flat connection on Rm to a metric connection ∇\ndefined by\n ̆ v U = X(x)d[y 7→ Yy U(y)](v),\n∇\n\nU ∈ C 1 ΓE, v ∈ Ty M,\n\n(3.6)\n\n(In [27] we have studied the properties of this construction together with the SDE\n ̆ is referred as the LW connection for the SDE.) Moreinduced by X, and there ∇\nover any connection ∇ on a subbundle E of T M has an adjoint semi-connection\n∇′ on T M over E defined by\n∇′U V = ∇V U + [U, V ],\n\nU ∈ ΓE, V ∈ ΓT M.\n\n\f42 CHAPTER 3. EQUIVARIANT DIFFUSIONS ON PRINCIPAL BUNDLES\nLet π : GLM → M be the frame bundle of M, so u ∈ π −1 (x) is a linear\nisomorphism u : Rn → Tx M. It is a principal bundle with group GL(n). If\ng ∈ GL(n) and π(u) = x then u * g : Rn → Tx M is just the composition of u\nwith g.\nAny smooth vector field A on M determines smooth vector fields AT M and\nGL\nA on T M and GLM respectively as follows: Let ηt : t ∈ (−ǫ, ǫ) be a (partial)\nflow for A and T ηt its derivative. Then v 7→ T ηt (v) is a partial flow on T M and\nu 7→ T ηt ◦ u one on GLM, Let AT M and AGL be the vector fields generating\nthese flows. In fact AT M is τ ◦ T A : T M → T T M where τ : T T M → T T M is\nthe canonical twisting map:\nτ (x, v, w, v ′) = (x, v, v ′ , w)\nin local coordinates.\nUsing this, the choice of our Hörmander form representation induces a diffusion operator B on GLM by setting\n1X\nL(X j )GL L(X j )GL + LAGL .\nB=\n2\nThen π intertwines B and A. For w ∈ Ex , set\nZ w (y) = X(y)Yx(w).\n\nTheorem 3.3.1 Assume the diffusion operator A given by (3.5) is cohesive and\nlet B be the operator on GLM determined by A. Let E be the image of σ A , a\nvector bundle.\n ̆ given by (3.6).\n(a) The semi-connection ∇ induced by B is the adjoint of ∇\nConsequently ∇w V = LZ w V for any vector field V and w ∈ Ex ,\n(b) For u ∈ GLM, identifying gl(n) with L(Rn ; Rn ),\n\u0011\n\u0011 \u0010\n1 X \u0010 −1\n−1\np\np\n ̆\n ̆\nα(u) =\nu (−)∇u(−) X ⊗ u (−)∇u(−) X ,\n2\n1 X −1  ̆\n1\n ̆ u(−) A.\nβ(u) = −\nu ∇∇ ̆ u(−) X p X p − u−1 Ric# u(−) + u−1 ∇\n2\n2\n ̆ considered as an operator\nHere Ric# : T M → E is the Ricci curvature of ∇\nfrom T M to E, defined by\nm\nX\n\u0001\nRic# (v) =\nR̆ v, X j (x) X j (x)\nj=1\n\n ̆\nfor R̆ the curvature operator of ∇.\n\n\f3.3. DERIVATIVE FLOWS AND ADJOINT CONNECTIONS\n\n43\n\nProof. The first part can be deduced from the stochastic flow results in chapter 8\nbut we give a direct proof here. Let πte be the flow of X(*)(e). It induces a linear\nmap X̃(u) : Rm → Tu GLM on the general linear bundle GLM:\nX̃(*)e = [X(*)(e)]GL\nd\n(T Ste ◦ u)|t=0 ,\nX̃(u)(e) =\ndt\n\nu ∈ GLM.\n\nWe can apply lemma 2.2.1 with R̃m = Rm and so lu = Y (p(u))X(p(u)). If\nx = p(u) and e ⊥ ker[X(x)] then the horizontal lift map hu defined by Theorem\n3.1.2 is\nd\nhu (X(x)(e)) = X̃(u) (lu (e)) =\n(T πte ◦ u) .\n(3.7)\ndt t=0\nNote this will not hold in general if e ∈ ker[X(x)].\nLet σ : [0, T ] → M be a C 1 curve with σ̇(t) ∈ Eσ(t) each t. Then\nZ σ̇(t) (x) := X(x)Yσ(t) σ̇(t).\nσ\nLet Ss,t\nbe the flow, from time s to time t, of the time dependent vector field Z σ̇(t) .\nσ\nNow Ss,t\n(σ(s)) = σ(t) for 0 6 s 6 t 6 T . Also, for any torsion free connection\nand any v ∈ Tσ(s) M\n\nD\ndt\n\nt=s\n\n\u0001\nσ\nσ\nT Ss,t\n(v) = ∇Z σ̇(t) T Ss,t\n(v) |t=s = ∇v Z σ̇(s) .\n\nThus\n\nD\nσ\nσ̇(t)\nσ Z\nT S0,t\n(v) = ∇T S0,t\n.\ndt\nIf ̟ is the connection form of this torsion free connection then\n\u0013\n\u0012\n\u0001−1 D\nD\nσ\nσ\nσ\nT S0,t ◦ u0\n= [e 7→ T S0,t\n◦ u0\nT S0,t\n(u0(e))]\n̟\ndt\ndt\n\u0001−1\nσ\nσ̇(t)\nσ u (e) Z\n= [e 7→ T S0,t\n◦ u0\n∇T S0,t\n]\n0\n\u0010\n\u0011\nσ ◦u (σ̇(t))\n= ̟ hT S0,t\n0\n\nby (3.7), showing that the vertical parts of\nequal.\n\nd\ndt\n\n\u0001\nσ\nσ ◦u (σ̇(t))\nT S0,t\n◦ u0 and hT S0,t\n0\n\n\f44 CHAPTER 3. EQUIVARIANT DIFFUSIONS ON PRINCIPAL BUNDLES\nOn the other\n\u0001 hand, using this auxiliary connection, the horizontal parts of\nσ\nσ ◦u (σ̇(t)) are both equal to the horizontal lift of σ̇(t).\nT S0,t ◦ u0 and hT S0,t\n0\nThus\n\u0001\nd\nσ\nσ ◦u (σ̇(t))\nT S0,t\n◦ u0 = hT S0,t\n0\ndt\nd\ndt\n\nσ\nand so {T S0,t\n◦ u0 : 0 6 t 6 T } is the horizontal lift of {σ(t) : 0 6 t 6 T }\nwith respect to the semi-connection induced by B. However by Lemma 1.3.4 in\nσ\nσ\nElworthy-LeJan-Li [27], T S0,t\n(v) of S0,t\nis the parallel translation of v along σ by\nˆ of the LeJan-Watanabe connection on E associated\nthe adjoint semi-connection ∇\nσ\nto X and {T S0,t ◦ u0 : 0 6 t 6 T } is the horizontal lift of {σ(t) : 0 6 t 6 T }\nˆ This proves the first claim. And ∇w V = LZ w V by Lemma\nwith respect to ∇.\n1.3.4 of Elworthy-LeJan-Li [27].\nFor the last part let ̟ : H ⊕ V T GLM → g = L(Rn ; Rn ) be the semiconnection 1-form. For u0 ∈ GLM, set ut = T ξt ◦ u0 where {ξt } is a local flow\nfor the stochastic differential equation\n\ndxt = X(xt ) ◦ dBt + A(xt )dt\n\n(3.8)\n\non M where {Bt } is a Brownian motion on Rm . (This defines the derivative flow\non GLM.)\nAs for ordinary connections\n̟(◦dut) = u−1\nt\n\nD̂\n(ut −) ∈ L(Rn ; Rn ).\ndt\n\nHere, on the right hand side ut is differentiated as a process of linear maps ut ∈\nL(Rn ; Txt M) over (xt ). [It suffices to check the equality for C 1 curves (ut ) with\nxt = π(ut ) having ẋt ∈ Ext , t > 0. For this we can write ut = x̃t * gt for x̃t a\nD̂\nhorizontal lift of {xt } and gt ∈ G. Then observe that dt\n(ut −) = x̃t dtd (x̃−1\nt ut −).]\nHowever as in [27],\nu−1\nt\n\nD̂\n−1  ̆\n ̆\n(ut −) = u−1\nt ∇ut − X ◦ dBt + ut ∇ut − Adt.\ndt\n\nFrom this the formula for α(u) follows\nR tby Remark 3.2.2(b). For β(u) we need\nto identify the bounded variation part of 0 ̟(◦dut). For this write\n−1\n−1 ˆ\nˆ −1  ̆\n ̆\nu−1\nt ∇ut − X ◦ dBt = u0 Tx0 ξt //t ◦ //t ∇T ξt ◦u0 X ◦ dBt\n\n\f3.3. DERIVATIVE FLOWS AND ADJOINT CONNECTIONS\n\n45\n\nwhere /ˆ/t is the parallel translation along {ξs (x0 ) : 0 6 s 6 t} using our semi ̆ by Theorem 3.3.1. As in [27]\nconnection, which is the adjoint of ∇\n−1\n ̆ T ξt u0 XdBt − 1 /ˆ/t −1 Ric# (T ξt ◦ u0 −)dt\n ̆ T ξt ◦u0 X ◦ dBt = /ˆ/t −1 ∇\n/ˆ/t ∇\n2\n\nwhile\n−1 ˆ\nu−1\n0 T ξt //t\n\n=\n\nu−1\n0\n\n−\n\nZ\n\n0\n\nt\n\n−1  ̆\nu−1\n0 T ξs ∇//ˆs − X\n\n◦ dBs −\n\nZ\n\n0\n\nt\n\n−1  ̆\nu−1\n0 T ξs ∇//ˆ − Ads\ns\n\ngiving the formula claimed for β.\nExample: Gradient Brownian SDE\nAn isometric immersion j : M → Rm of a Riemannian manifold M determines\na stochastic differential equation on M:\ndxt = X(xt ) ◦ dBt\nwhere X(x) : Rm → Tx M is the orthogonal projection and B. is a Brownian\nmotion on Rm . More precisely\nX(x)(e) = ∇[y 7→ hj(y), i](x).\nIt is well known that the solutions of the SDE are Brownian motions on M, see\n[21],[63], [22], and the equation is often called a \"gradient Brownian SDE\" .\nMoreover the LW connection given by equation (3.6) is the Levi-Civita connection\n, (by the classical construction of the latter), see [27]. Since the adjoint of the LevCivita connection is itself, Theorem 3.3.1, shows that our connection induced on\nGLM by the derivative flow of a gradient Brownian system is also the Levi-Civita\nconnection. Almost by definition,\nh∇v X p , wiRm = ha(v, w), ep iRm\n\n(3.9)\n\nwhere a : T M × T M → Rm is the second fundamental form of the immersion\nwith\n∇v X(e) = A(v, nx e)\nv ∈ Tx M, x ∈ M, e ∈ Rm\n(3.10)\nfor nx : Rm → Tx M ⊥ the projection and A : T M ⊕ T M ⊥ → T M the shape\noperator given by\nhA(v, e), wiRm = ha(v, w), ep iRm .\n\n\f46 CHAPTER 3. EQUIVARIANT DIFFUSIONS ON PRINCIPAL BUNDLES\nHere T M ⊥ refers to the normal bundle of M and Tx M ⊥ to the normal space at x\nto M, though we are considering its elements as being in the ambient space Rm .\nThus the vertical operator in the decomposition of the generator of the derivative\nflow on GLM for gradient flows is given by Theorem 3.3.1 with\nm−n\n1 X −1\nu A(u−, lj ) ⊗ u−1 A(u−, lj )\nα(u) =\n2 j=1\nm−n\n1X\n1\nβ(u) = −\nA(A(u−, lj ), lj ) − u−1 Ric# (u−)\n2 j=1\n2\n\nat a frame u over a point x. Here l1 , ..., lm−n denotes an orthonormal base for\nTx M ⊥\nFor the standard embedding of S n in Rn+1 we have\na(u, v) = hu, vix\nfor u, v ∈ Tx S n . Also the Ricci curvature is given by Ric# (v) = (n − 1)v for all\nv ∈ T M. Thus for the standard gradient SDE on S n , at any frame u we have\n1\nId ⊗ Id\n2\n1\nβ(u) = − n Id.\n2\n\nα(u) =\n\n(3.11)\n(3.12)\n\n3.4 Associated Vector Bundles & Generalised Weitzenböck\nFormulae\nAs before let π : P → M be a smooth principal G-bundle and ρ : G → L(V ; V )\na C ∞ representation of G on some separable Banach space V . There is then the\n(possibly weakly) associated vector bundle π ρ : F → M where F = P × V / ∼\nfor the equivalence relation given by (u, e) ∼ (ug, ρ(g −1)e) for u ∈ P , e ∈ V ,\ng ∈ G. If [(u, e)] ∈ F denotes the equivalence class of (u, e) we can identify any\nu ∈ P with a linear isomorphism\nū : V → Fπ(u)\nby\nū(e) = [(u, e)].\n\n(3.13)\n\n\f3.4. ASSOCIATED VECTOR BUNDLES & GENERALISED WEITZENBÖCK FORMULAE 47\nConsider the set of smooth maps from P to V , equivariant by ρ:\nMρ (P ; V ) = {smooth Z : P → V, Z(ug) = ρ(g)−1Z(u), u ∈ P, g ∈ G}.\nThere is the standard bijective correspondence Fρ between Mρ (P, V ) and Γ(F ),\nthe space of smooth sections of F defined by\nFρ (Z)(x) = ū[Z(u)],\n\nu ∈ π −1 (x), Z ∈ Mρ (P ; V ).\n\nVia this map, an equivariant diffusion generator B on P induces a differential\noperator Bρ ≡ Fρ (B) on Γ(F ), of order at most 2, by\nFρ (B)(Fρ (Z)) = Fρ [B(Z)],\n\nZ ∈ Mρ (P ; V ).\n\n(3.14)\n\nHere B has been extended trivially to act on V -valued functions. Note that the\ndefinition makes sense since,\n\u0001\nB(Z)(ug) = B (Z ◦ Rg ) (u) = B ρ(g)−1 Z (u) = ρ(g)−1 B(Z)(u).\nFor such a representation ρ let\n\nρ∗ : g → L(V ; V )\nbe the induced representation of the Lie algebra g (the derivative of ρ at the identity).\nTheorem 3.4.1 When B is a vertical equivariant diffusion generator the induced\noperator on sections of any associated vector bundle is a zero order operator. With\nthe notation of Theorem 3.2.1, the zero order operator in Γ(F ) induced by B is\nrepresented by λρ : P → L(V ; V ) for\nλρ (u) = ρ∗ (β(u)) + Comp ◦(ρ∗ ⊗ ρ∗ )(α(u)),\n\nu∈P\n\n(3.15)\n\nfor Comp : L(V ; V ) ⊗ L(V ; V ) → L(V ; V ) the composition map A ⊗ B 7→ AB.\nProof. The operator Bρ is a zero order operator if F ρ (B)(S)(x0 ) = F ρ (B)(S ′ )\nwhenever two sections S and S ′ of F agree at x0 . This holds if B(f Z) = f B(Z)\nfor any invariant function f : P → R and V -valued function Z on P . But this\nholds by Remark 1.4.5.\nFor the representation (3.15), suppose Z : P → V is equivariant:\nZ(u ◦ g) = ρ(g)−1 Z(u),\n\ng ∈ G.\n\n\f48 CHAPTER 3. EQUIVARIANT DIFFUSIONS ON PRINCIPAL BUNDLES\nThen\nd\nZ(u * eAj t ))|t=0\ndt\nd\nρ(e−Aj t )Z(u)|t=0\n=\ndt\n= −ρ∗ (Aj )Z(u).\n\nLA∗j (Z)(u) =\n\nIterating we have\nB(Z)(u) =\nproving (3.15).\n\nX\n\nαij (u)ρ∗ (Aj )ρ∗ (Ai )Z(u) +\n\nX\n\nβk ρ∗ (Ak )Z(u)\n\nFrom this theorem we easily have the following estimate, which combined\nwith the discussions below, when applied to the associated bundle ∧F to the orthonormal bundle, shows that the Weitzenböck curvature is positive if the curvature is.\nCorollary 3.4.2 If ρ is an orthogonal representation, ı.e. (ρ∗ (α))∗ = −ρ∗ (α) for\nall α ∈ g, then λρ (v, v) 6 0 for all v ∈ V .\nP\nProof. Write α = k μk Ak ⊗ Ak where {Ak } is as in Remark 3.2.2(c). Then for\nv ∈ F,\nX\nhComp ◦(ρ∗ ⊗ ρ∗ )(α(u))(v), vi = h\nμk [ρ∗ Ak ]2 (v), vi\nX\n= −\nμk hρ∗ (Ak )(v), ρ∗ (Ak )(v)i 6 0,\n\nsince μk 6 0. The result follows from (3.15) since ρ∗ (β(u)) is skew symmetric.\n\nThe situation of Corollary 3.4.2 arises when considering the derivative flow\nfor an SDE on a Riemannian manifold whose flow consists of isometries ; for\nexample canonical SDE's on symmetric spaces as in [27].\nQuantitative estimates can be obtained by some representation theory. For\nexample suppose G = O(n) with ρ the standard representation on Rn . Consider\nthe representation ∧k ρ on ∧k Rn .\nWe use the following conventions, as in [27]. Let V be an N dimensional real\ninner product space. For 1 6 i 6 n,\n1 X\na1 ∧ * * * ∧ an =\nsgn (π)aπ(1) ⊗ * * * ⊗ aπ(n) ,\nn! π\n\n\f3.4. ASSOCIATED VECTOR BUNDLES & GENERALISED WEITZENBÖCK FORMULAE 49\nιv (u1 ∧ * * * ∧ uq ) =\n\nq\nX\nj=1\n\n(−1)j+1 hv, uj iu1 ∧ * * * ∧ ubj ∧ * * * ∧ uq\n\n(3.16)\n\nh⊗ai , ⊗bi i = n!Πi hai , bi i, and h∧ai , ∧bi i = det(hai , bj i). Let ∧V stand for the\nexterior algebra of V and a∗j the \"creation operator\"on ∧V given by a∗j v = ej ∧ v\nfor (e1 , . . . , eN ) an orthonormal basis for ∧V . Let aj be its adjoint, the \"annihilation operator\" given by aj = ıej . Note the commutation law:\nai a∗j + a∗j ai = dij\n\n(3.17)\n\nFor linear forms we have the corresponding operators: (aj )∗ φ(v) = φ(aj v)\nand (aj φ)(v) = φ(a∗j v). In particular aj φ(v) = φ(ej ∧ v) and (aj )∗ φ(v) = e∗j ∧ φ.\nIf A : V → V is a linear map on V , there are the operators ∧A and (dΛ)(A)\non ∧V , which restricted to ∧p V are:\n(dΛ)(A) (u1 ∧ * * * ∧ up ) =\n\np\nX\n1\n\nu1 ∧ * * * ∧ uj−1 ∧ Auj ∧ uj+1 ∧ * * * ∧ up ,\n\nand also\n(∧A)(u1 ∧ * * * ∧ up ) = Au1 ∧ * * * ∧ Aup .\n\nNote that since α(u) is symmetric, (ρ∗ ⊗ ρ∗ )α(u) : V ⊗ V → V ⊗ V has\nX\n(ρ∗ ⊗ ρ∗ )α(u)(v 1 ∧ v 2 ) =\nαij (u)ρ∗ (Ai ) ⊗ ρ∗ (Aj )(v 1 ∧ v 2 ) (3.18)\ni,j\n\n=\n\nX\nij\n\nαij (u)Ai v 1 ∧ Aj v 2 .\n\n(3.19)\n\nand so (ρ∗ ⊗ ρ∗ )α(u) restricts to a map of ∧2 V to itself.\nCorollary 3.4.3 Take the Hilbert-Schmidt inner product on so(n) and let 0 6\nμ1 (x) 6 * * * 6 μ(x) 1 n(n−1) be the eigenvalues of α on the fibre p−1 (x), x ∈ M,\n2\nas described in Remark 3.2.2(c). Then for all V ∈ ∧k Rn ,\nD k\nE\n1\n1\n− k(n − k)μ 1 n(n−1) (x) 6 λ∧ (u)V, V 6 − k(n − k)μ1 (x).\n2\n2\n2\n\nProof. Following Humphreys [38], §6.2, consider the bilinear form β on so(n)\ngiven by\n\u0010\n\u0011\n(n − 2)!\nk\nk\ntrace(AB)\nβ(A, B) = trace (d∧ )(A), (d∧ )(B) =\n(k − 1)!(n − k − 1)!\n\n\f50 CHAPTER 3. EQUIVARIANT DIFFUSIONS ON PRINCIPAL BUNDLES\nby a short calculation using elementary matrices. By Remark 3.2.2(c) since our\ninner product on so(n) is ad(O(n))-invariant we can write\n1\nn(n−1)\n2\n\nα(u) =\n\nX\nl=1\n\nμl (x)Al (u) ⊗ Al (u)\n\nwith x = p(u) and {Al (u)}l an orthonormal base for so(n) at each u ∈ P .\nFor each u ∈ P , set\nA′l (u) =\n\n(k − 1)!(n − k − 1)!\nAl (u)\n(n − 2)!\n\nto ensure β(A′l (u), Aj (u)) = δlj for each u.\nThen\nD\nE X\nD\nE\n∧k\n∧k\nk\nk\nComp ◦(ρ∗ ⊗ ρ∗ )(α(u)V, V =\nμl (x) (d∧ )Al (u) ◦ (d∧ )Al (u)V, V\nE\nh (k − 1)!(n − k − 1)! i−1 D\n(d∧k )Al (u) ◦ (d∧k )A′l (u)V, V\n=\n(n − 2)!\n(n − 2)!\nc∧k V, V ,\n≤ −\n(k − 1)!(n − k − 1)!\nwhere\nc∧k = (d∧k )Al (u) ◦ (d∧k )A′l (u),\n\nthe Casimir element of our representation d∧k of so(n). Since the representation\nis irreducible, (for example see [10] Theorem 15.1 page 278),\nthis element is a scalar, and we have, see Humphreys [38]\nc∧k =\n\ndim so(n)\n1\nn(n − 1) . . . (n − k + 1)\n=\nn(n\n−\n1)/\n.\ndim ∧k Rn\n2\nk!\n\nk\n\nThus λ∧ (u) 6 − 21 k(n−k)μ1 . The lower bound follows in the same way.\nWhen B has an equivariant Hörmander form representation the zero order operator F ρ(V ) can be given in a simple way by (3.20) below. This was noted for\nthe classical Weitzenböck curvature terms using derivative flows in Elworthy [23].\nProposition 3.4.4 Suppose\nPB lies over aPcohesive operator A and has a smooth\n1\nHörmander form: B = 2 LY j LY j + βk LY 0 with the vector fields Y j , j =\n\n\f3.4. ASSOCIATED VECTOR BUNDLES & GENERALISED WEITZENBÖCK FORMULAE 51\n1, . . . , m, being G-invariant. Let (ηtj ) be the flow of Y j . For a representation ρ\nof G with associated vector bundle π ρ : F → M the zero order operator F ρ (BV )\ncorresponding to the vertical component of B is given by\nm\n\n1 X D2 j\nη (u0 )\nF (B )(x0 ) =\n2 j=1 dt2 t\nρ\n\nV\n\nt=0\n\n◦ (ū0 )−1 +\n\nD 0\nη (u0 )\ndt t\n\nt=0\n\n◦ (ū0 )−1\n\n(3.20)\n\nfor any u0 ∈ π −1 (x0 ).\nProof. Set ujt = ηtj (u0 ) ∈ P and σ(t) = π(ujt ) so ūjt ∈ L(V ; Fσ(t) ). From Remark\n3.2.2(b)\nm\n1X\n̟(Y j (u0 )) ⊗ ̟(Y j (u0 ))\nα(u0 ) =\n2 j=1\nand so\nm\n\n1X\nD\n(ρ∗ ⊗ ρ∗ )α(u0) =\n(ū0 )−1 ūjt\n2 j=1\ndt\n\nt=0\n\n⊗ (ū0 )−1\n\nD j\nū\ndt t\n\nt=0\n\nas in the proof of Theorem 3.3.1.\nAlso from equation (3.4)\n\u0011\n\u0011\n1\n1X\nj\n0\nLY j ̟(Y (−) (u0 ) + ̟(Y (−) (u0 ).\nβ(u0 ) =\n2 j=1\n2\nm\n\nLet (//t ) denotes parallel translation in F along σ. Then\n\u0011\nρ∗ LY j ̟(Y j (−) (u0 ) =\n\n\u0010\n\u0011\nd\nρ∗ ̟ Y j (ujt )\ndt\nt=0\n\u0010\n\u0011\nd\nD\n=\n(ūjt )−1 ūjt\ndt\ndt\nt=0\nd \u0010 −1 j −1 −1 D j \u0011\nu\n(//t ut ) //t\n=\ndt\ndt t t=0\n2\nD j\n−1 D j\n−1 D\n= −ū−1\nu\nu\nuj\n◦\nū\n+\nū\n0\n0\n0\ndt t t=0\ndt t t=0\ndt2 t\n\nleading to the required result via Theorem 3.4.1.\n\nt=0\n\n\f52 CHAPTER 3. EQUIVARIANT DIFFUSIONS ON PRINCIPAL BUNDLES\nTo examine particular examples we will need to have detailed information\nabout the zero order operators determined by a vertical diffusion generator. For\nthis suppose B is vertical and given by\nB=\n\nX\n1 X ij\nα LA∗i LA∗j +\nβk LA∗k\n2\n\nfor α : P → g ⊗ g and β : P → g as in Theorem 3.2.1 and (3.2).\nMotivated by the Weitzenböck formula for the Hodge-Kodaira Laplacian on\ndifferential forms, see Corollary 3.4.8 below, [64], [15], we shall examine in more\ndetail the case of the exterior power ∧ρ : G → L(∧V ; ∧V ) of a fixed representation ρ showing that λ∧ρ has expressions in terms of annihilation and creation\noperators which are structurally the same as these of the Weitzenböck curvature\n(which are shown to be a special case in Corollary 3.4.8).\nLemma 3.4.5 If B is a vertical operator on P and (ei , i = 1, 2, . . . , N) is an\northonormal basis of V , the zero order operator on the associated bundle ∧F →\nM is represented by λ∧ρ : P → L(∧p V ; ∧p V ) with\nN\n1 X\nh((ρ∗ ⊗ ρ∗ )α(u)) (ej ⊗ el ), ei ⊗ ek i a∗i aj a∗k al\nλ (u) =\n2 i,j,k,l=1\n∧ρ\n\n+\n\nN\nX\n\nh(ρ∗ β(u))ej , ei ia∗i aj ,\n\ni,j=1\n\nu∈P\n\nProof. Recall that if A ∈ L(V ; V ) then\ndΛ(A) =\n\nN\nX\n\nhAej , ei ia∗i aj ,\n\n(3.21)\n\ni,j=1\n\ne.g. see Cycon-Froese-Kirsch-Simon [15]. Consequently\ndΛ(ρ∗ β(u)) =\n\nN\nX\n\nhρ∗ β(u)ej , ei ia∗i aj\n\ni,j=1\n\nOn the other hand by Theorem 3.2.1 and (3.2), we can represent α as:\nX\nα(u) =\nan,m (u)An ⊗ Am\nn,m\n\n(3.22)\n\n\f3.4. ASSOCIATED VECTOR BUNDLES & GENERALISED WEITZENBÖCK FORMULAE 53\nwhere {Ai }N\ni=1 is a basis of g. So\nComp ◦(∧ρ∗ ⊗ ∧ρ∗ )(α(u))\nX\n= Comp ◦\nan,m (u) dΛ(ρ∗Am ) ⊗ dΛ(ρ∗ An )\n=\n\nX\nm,n\n\n=\n\nX\n\nm,n\n\nan,m (u)dΛ(ρ∗Am ) ◦ dΛ(ρ∗ An )\nan,m (u)\n\nm,n\n\n=\n\nN\nX\n\nhρ∗ Am ej , ei ihρ∗ An el , ek ia∗i aj a∗k al\n\ni,j,k,l=1\n\nN\nX\n1X\nh(ρ∗ Am ⊗ ρ∗ An ) (ej ⊗ el ), ei ⊗ ek i a∗i aj a∗k al\nan,m (u)\n2 m,n\ni,j,k,l=1\n\n=\n\nN\nX\n\n1\nh(ρ∗ ⊗ ρ∗ )α(u)(ej ⊗ el ), ei ⊗ ek i a∗i aj a∗k al ,\n2 i,j,k,l=1\n\nsince our convention for the inner product on tensor products gives\nhu1 ⊗ v1 , u2 ⊗ v2 i = 2hu1, u2 ihv1 , v2 i.\nThe desired conclusion follows.\nTheorem 3.4.6 Let R(u) : ∧2 V → ∧2 V be the restriction of (ρ∗ ⊗ ρ∗ )α(u) :\nV ⊗ V → V ⊗ V , then\nX\nhR(u)(ej ∧ el ), ei ∧ ek i a∗i a∗k aj al\nλ∧ρ (u) = −\ni<k,j<l\n\n+\n\nN\nX\n1 X\nhρ∗ β(u)ej , ei i (ai )∗ aj .\nh(ρ∗ ⊗ ρ∗ )α(u)(ej ⊗ el ), ei ⊗ ej i a∗i al +\n2 i,j,l=1\ni,j\n\nThis can be rewritten as:\nX\n1\nλ∧ρ (u) = −\nhR(u)(ej ∧ el ), ei ∧ ek i a∗i a∗k aj al + d∧(Z ρ (u))+d∧(ρ∗ β(u)).\n2\ni<k,j<l\n(3.23)\nwhere Z ρ (u) ∈ L(V ; V ) is defined by\nρ\n\nhZ (v1 ), v2 i =\n\nN\nX\nj=1\n\n(ρ∗ ⊗ ρ∗ )(α(u))(ej ⊗ v1 ), v2 ⊗ ej\n\nV ⊗V\n\n.\n\n\f54 CHAPTER 3. EQUIVARIANT DIFFUSIONS ON PRINCIPAL BUNDLES\nProof. This follows from Lemma 3.4.5 since\nN\n1 X\nh(ρ∗ ⊗ ρ∗ )α(u)(ej ⊗ el ), ei ⊗ ek i a∗i aj a∗k al\n2\ni,j,k,l=1\n\n=\n\nN\n1 X\n−\nh(ρ∗ ⊗ ρ∗ )α(u)(ej ⊗ el ), ei ⊗ ek i a∗i a∗k aj al\n2 i,j,k,l=1\n\n+\n\nN\n1 X\nh(ρ∗ ⊗ ρ∗ )α(u)(ej ⊗ el ), ei ⊗ ej i a∗i al\n2\ni,j,l=1\n\n=\n\n−\n\nN\nX\n\nj<l;i<k\n\nhR(u)(ej ∧ el ), ei ∧ ek i a∗i a∗k aj al\n\nN\n1 X\n+\nh(ρ∗ ⊗ ρ∗ )α(u)(ej ⊗ el ), ei ⊗ ej i a∗i al .\n2\ni,j,l=1\n\nRemark 3.4.7 (a) Note that the second term in (3.23) in general depends on\nthe symmetric part of (ρ∗ ⊗ ρ∗ )(α(u)) as well as on R.\n(b) If we write\nα(u) =\n\nX\n\nμk (u)Ak (u) ⊗ Ak (u)\n\nas in Remark 3.2.2(c), Then Z ρ (u) in (3.23) has\n\u0010\n\u0011\nX\nρ\nZ (u) = 2\nμk (u) ρ∗ (Ak (u))ρ∗ (Ak (u)) .\nk\n\nCorollary 3.4.8 For the derivative process in GLM of a cohesive generator A\ngiven in Hörmander form without a drift, the zero order operator induced by the\nvertical diffusion on the exterior bundles ∧T M is the generalized Weitzenböck\ncurvature given by:\nX\n1\n− d ∧q (Ric# )(V ) −\nRikjl a∗l a∗j ak ai V\n2\n16i6k6n\n\n(3.24)\n\n16j<l6p\n\nfor all V ∈ ∧q T M. Here Rikjl = hR(ei , ek )el , ej i , 1 6 i, k 6 n, 1 6 j, l 6 p for\nR the curvature tensor of the associated connection.\n\n\f3.4. ASSOCIATED VECTOR BUNDLES & GENERALISED WEITZENBÖCK FORMULAE 55\nProof. By Theorem 3.3.1,\n\u0001\n\u0001\n1 X −1\nu ∇u(−) X p ⊗ u−1 ∇u(−) X p ,\nα(u) =\n2\n\nu ∈ GLM.\n\nBy Corollary C.5 in [27] the restriction of α to anti-symmetric tensors is 12 R.\nBy the relation between the curvature tensor and the curvature oeprator:\nhR(u ∧ v), w ∧ zi = hR(u, v)z, wi,\nthe first term in λρ (u) of Lemma 3.4.5 is:\n−2\n\nN\nX\n\ni<k,j<l\n\nhR(u)(ej ∧ el ), ei ∧ ek i a∗i a∗k aj al = −2\n\nN\nX\n\nRjlki a∗i a∗k aj al .\n\ni<k,j<l\n\nBy (ii) of Remark 3.4.7, the second term is\n1 q\nd∧\n2\n\nm\nX\np=1\n\n!\n\nu−1 ∇∇u(−) X p X p .\n\nThe required result follows since\n\u0011 1\n\u0001\n1 X −1 \u0010\n∇∇u(−) X p X p − u−1 Ric# u(−) .\nu\nβ(u) = −\n2 p=1\n2\nm\n\nCorollary 3.4.8 reflects the results in [27], Theorem 2.4.2, concerning Weitzenböck\nformula for Hörmander form operators on differential forms. In particular it gives\n ̆ is the Levi-Civita connection, as holds\nanother approach to the result that when ∇\nfor gradient stochastic differential equations, the generator induced on differential\nforms by the derivative process is the Hodge-Kodaira Laplacian up to a first order\nterm.\nNote that if B is the operator on GLM determined by the Hörmander form\n(3.5) of A then for a representation ρ : GL(M) → L(V ; V ) with associated\nπ ρ : GL(n) → L(V ; V ) the induced\noperator F ρ (B) on sections of π ρ is also\nP\ngiven by the 'Hörmander form' 21 j LX j LX j + LA , where for any C 1 vector\nfield Y on M and any C 1 section U of π ρ the Lie derivative LY U ∈ ΓF is given\nby\n\u0011−1 \u0010\n\u0011\nd\u0010 Y\n(LY U)(x) = ū\nTηt ◦ u\nU ηtY (x)\ndt\nt=0\n\n\f56 CHAPTER 3. EQUIVARIANT DIFFUSIONS ON PRINCIPAL BUNDLES\nfor x ∈ M, u a frame at x, and (ηtY ) the flow of Y , using the notation of (3.13).\nIndeed by (3.13), for Z(u) = ūU(π(u)), so U = F ρ (Z),\nh\u0010 1 X\n\u0011\ni\nF ρ (B)(U) = F ρ\nL(X j )GL L(X j )GL + LAGL (Z)\n2 j\nwhile L(X j )GL (Z)(u) =\n\nj\nd\nZ(T ηtX\ndt\n\n◦ u)\n\nt=0\n\nso that\n\nh\ni\nd\nj\nF ρ L(X j )GL (Z) (x) = ū Z(T ηtX ◦ u)\ndt\n\nt=0\n\n= LX j (U)(x).\n\nThis representation of F ρ (B) was noted in the case of the operator induced on\ndifferential forms by a stochastic flow indexflow!on differential forms in [27], and\nfor the case of the Hodge-Kodaira Laplacian in Elworthy [23].\nExample 3.4.9 Let P be the orthonormal frame bundle for a Riemannian metric\non M. Let C : Rn → Rn be a symmetric map, define\nX\nα=\ntracehC(Ai −), Aj −iAi ⊗ Aj ,\ni,j\n\nwhere {Ai =\n\n√\n\n2ei ∧ ej } is an orthonormal basis of so(n). Then\n1\n1\nComp ◦α = − (trace C)id + (2 − n)C.\n4\n4\n\nLet Ric# : T M → T M be the Ricci curvature (for the Levi-Civita connection,\n−1\nsay). When applied to C(u) = u Ric#\nπ(u) (u −) for u ∈ P with Ric positive, we\nsee it defines a vertical operator on the orthonormal frame bundle with coefficients\nα as given above, β = 0. Its associated zero order term on vertical fields is then\n1\n1\n(2 − n) Ric#\nπ(u) − 4 k, where k is the scalar curvature.\n4\nProof. First observe that\n\u0001 X\n1\nd ⊗2 C\nAi ⊗ Ai\nα=\n2\ni\n\n!\n\n.\n\nThen we use the elementary fact about elementary matrices {Eij }:\nEij CEi′ j ′ = Cji′ Eij ′\n√\nand take the basis of g to be { 2ei ∧ej , i < j}. Recall that ei ∧ej = 1/2(Eij −Eji ).\n\n\f3.4. ASSOCIATED VECTOR BUNDLES & GENERALISED WEITZENBÖCK FORMULAE 57\nRemark 3.4.10 We have seen in Corollary 3.4.8 that there is zero order operator\non the associated bundle ∧F → M represented by the Weitzenböck curvature of\na given connection. On the other hand given a curvature operator R of a metric\nconnection, or more generally an operator which has the same symmetry properties as a curvature tensor, is there a canonical vertical diffusion operator on GLM\nwhich induces zero order operators on differential forms which have the form of\nthe Weitzenböck curvatures of R? A vertical operator with such a zero order term\nalways exist since we can take R in a diagonal form:\nR(u) =\n\nN\nX\nn=1\n\nAn (u) ∧ An (u),\n\n(3.25)\n\nfor some An : GLM → gl(n) which are ad(G)-invariant, e.g. by taking an\nisometric embedding (e.g. see [27]. In this case let (ej ) be a basis of Eπ(u) define\nP\nα(u) = 12 N\nn=1 An (u) ⊗ An (u),P\nP\np\n1\n2\nj j\nβ(u) = − 21 N\nn=1 (An (u)) − 2\nj=1 R(−, e )e ,\n\n(3.26)\n\nsee Remark 3.4.7(b). Then α is positive and we can define an operator with its\ncoefficients α and β given as above.\nFor a discussion of the representation of R in the form of (3.25) see KobayashiNomizu [41] (Notes 17 and 18). In particular there is a discussion there of the\nnumber N required and of a rigidity theorem originating from Chern, See also\nBerger-Bryant-Griffiths [8].\nWhen M is Riemannian with positive semi-definite curvature operator R :\n2\n∧ T M → ∧2 T M there is a canonical construction. For this take the orthonormal\nframe bundle π : OM → M, with G = O(n). We will use the isomorphism\nof ∧2 Rn with so(n) under which ep ∧ eq corresponds to 21 (E[p,q] − E[q,p] ) for\ne1 , . . . , en a fixed basis of Rn and E[p,q] the elementary matrix so E[p,q](v) = vq ep .\nSet A[p,q] = √12 [E[p,q] − E[q,p]] so {A[p,q] : 1 6 p < q 6 n} forms an orthonormal\nbasis for so(n). Define\nα : OM → so(n) × so(n)\nby\nα(u) =\n\nX\n\n16p6q6n,16p′ 6q ′ 6n\n\nD\n\nR(∧2 (u)(ep ∧eq )), ∧2 (u)(ep′ ∧eq′ ))\n\nE\n\nπ(u)\n\nA[p,q]⊗A[p′ ,q′ ] .\n\n\f58 CHAPTER 3. EQUIVARIANT DIFFUSIONS ON PRINCIPAL BUNDLES\nOur representation ρ is just the identity map and, by (3.19) and Bianchi's identity,\nthe restriction of α(u) : Rn ⊗ Rn → Rn ⊗ Rn to ∧2 Rn is just R itself. In the\nnotation of (3.23) we see\nhZ ρ (v 1 ), v 2 i = −4 Ric(v 1 , v 2 ).\nIf we take β = 0, we obtain from (3.23) that\nX\nρ\nRjlik a∗i a∗k aj al − 2 (d∧)Ric# .\nλ∧ (u) = −\ni<k,j<l\n\nTo get the full Weitzenböck term, extend α over GLM by equivariance and define\nβ(u), for u ∈ GLM, by β(u) = 32 u−1 Ric# (u−) as in (3.26).\n\n\fChapter 4\nProjectible Diffusion Processes\nLet M + be the Alexandrov one point compactification of a smooth manifold M.\nConsider the space Cy0 M + of processes (yt ) with life time ζ on N + such that\nt → yt is continuous with yt = ∆ when t > ζ. Let L be a diffusion operator on\nM and let {Py0 , y0 ∈ M + } be the family of L-diffusion measures in the sense\nof [39], i.e. the solution to the martingale problem on C(M + ) so the canonical\nprocess (yt , 0 6 t < ζ) with the system of diffusion measures {PLy0 , y0 ∈ N + }\nis a strong Markov process on M + . Denote by E mathematical expectation with\nrespect to the measure Py0 . We may add to these notations the relevant subscripts\nor superscripts indicating the diffusion operator or the Markov process concerned,\ne.g. {PLy0 }, ζ L, EL,y0 or even Ey0 .\nFor y0 ∈ M and f ∈ Cc∞ M, the space of smooth functions on M with compact\nsupport, let\nMtdf\n\n:=\n\nMtdf,L\n\n:= f (yt∧ζ ) − f (y0 ) −\n\nZ\n\n0\n\nt∧ζ\n\nLf (ys )ds\n\n(4.1)\n\nThen (Mtdf : 0 6 t < ∞) is a martingale on the probability space (C(M), PLy0 )\nwith respect to the {Fty0 }, where Fty0 = σ{ys ; 0 6 s 6 t}. Moreover it has\nbracket\nZ t∧ζ\ndf\nhM it = 2\nσ L ((df )ys , (df )ys )ds.\n0\n\nThis definition extends to the case of C 2 functions f but then Mtdf is only defined\nfor 0 6 t < ζ L and is a local martingale.\n59\n\n\fCHAPTER 4. PROJECTIBLE DIFFUSION PROCESSES\n\n60\n\n4.1 Integration of predictable processes\nProposition 4.1.1 Let τ be a stopping time with τ < ζ and let {αt : 0 6 t < τ }\nbe a F∗y0 predictable process in T ∗ M such that αt ∈ Ty∗t M for each t ∈ [0, τ ), and\nfor each compact subset of M we have\nZ τ\nχK (ys )αs (σ L αs ) ds < ∞\n0\n\nalmost surely.\nThen there is a unique local martingale {Mtα : 0 ≤ t < τ } such that for all\nf ∈ Cc∞ M,\nα\n\nM ,M\n\ndf\nt\n\n=2\n\nZ\n\nt\n\nσ L (αs , (df )ys ) ds,\n\nt < ζ.\n\n(4.2)\n\n0\n\nProof. We can write\nαt =\n\nm\nX\nj=1\n\ngtj * dfj (yt ),\n\n(4.3)\n\nwhere the functions g j are predictable real valued processes, e.g. P\nby taking (f1 , . . . , fm ) :\nj\ni\nm\nj\nM → R to be an embedding and gt = αt ◦ X , for X(x) = m\ni=1 X (x)ei the\nm\nprojection from R to Tx M. Using a partition of unity, at the cost of having an\ninfinite, but locally finite sum, we can assume that the fj in the representation are\nall in Cc∞ M. Define\nXZ t\nα\nMt :=\ngsj dMsdfj .\n(4.4)\nj\n\n0\n\nClearly (4.2) holds. For uniqueness suppose K is a local martingale orthogonal to\nM df for all f ∈ Cc∞ M.\nThen K vanishes since the martingale problem for L is well posed by an argument attributed to Dellachérie (see Rogers-Williams [63], the end of the proof of\ntheorem 2.5.1). In fact it it were not zero we could take a suitable stopping time τ\nto ensure (1 + Kτ0∧t )PLx0 solves the martingale problem up to time t since\nKτ0∧t Msdf\n\n≡\n\nKτ0∧t\n\n\u0012\n\u0013\nZ s\nf (xs ) − f (x0 ) −\nLf (xs )ds ,\n\nis a uniformly integrable martingale.\n\n0\n\n06s6t\n\n\f4.1. INTEGRATION OF PREDICTABLE PROCESSES\nWe will often write\nMtα\n\n=\n\nZ\n\n61\n\nt\n\nαs d{ys }\n\n0\n\n(4.5)\n\nRt\nbringing out the fact it is the martingale part of the Stratonovitch integral 0 αs ◦\ndys of (αt ) along the diffusion process (yt ) when that integral is defined e.g. when\n(αt ) is a continuous semi-martingale. Indeed\nLemma 4.1.2 Let α be a C 2 1-form then\nZ t\nZ t\n\u0001\nα\nMt =\nαys ◦ dys −\nδ L α (ys )ds,\n0\n\n0 6 t < ζ.\n\n(4.6)\n\n0\n\nProof. This is clear for an exact 1-form. Suppose λ : M → R is C 2 and α is\nexact, then for t < ζ,\n\u001cZ *\n\u001d\nZ t\nZ t\n1\nα\nλα\nα\nα\ndλ(ys )dys , M*\nMt\n=\nλ(ys )dMs =\nλ(ys ) ◦ dMs −\n2\n0\n0\n0\nt\nZ t\nZ t\n\u0001\n1\n=\nλ(ys ) αys ◦ dys −\nλ(ys ) δ L α (ys )ds − hM*dλ , M*α it\n2\nZ0 t\nZ0 t\n=\nλ(ys ) αys ◦ dys −\nδ L (λα)(ys)ds\n0\n\n0\n\nsince M dλ is the martingale part of λ(ys ) and\ndλ\n\nα\n\nhM , M it = 2\n\nZ\n\nt\n\nσ L (dλs , αs )ds.\n\n0\n\nThis proves the result for general α by taking a suitable representation.\nLet Sx be the image of σxL in Tx M and let S := ∪x Sx . By a predictable S ∗ valued process (αt ) over (yt : 0 6 t < ζ) we mean a process (αt : 0 6 t) such\nthat\n(i) αt ∈ Sy∗t for all 0 6 t < ζ\n(ii) (αt ◦ σyLt , 0 6 t < ζ) is a predictable process in T M, canonically identified\nwith T ∗∗ M.\nNote that condition (ii) is equivalent to\n\n\fCHAPTER 4. PROJECTIBLE DIFFUSION PROCESSES\n\n62\n\n(ii)' there exists a predictable (ᾱt ) in T ∗ M over (yt ) such that ᾱt |Syt = αt for all\n0 6 t < ζ.\nThat (ii') implies (ii) is immediate. To see (ii) implies (ii') first note that αt ◦ σyLt ∈\nSyt for each t since αt ◦ σyLt = σyLt (α̃t ) for any extension α̃t of αt to Ty∗t M. We\ncan then choose a measurable selection ᾱt in Ty∗t M with σyLt (ᾱt ) = αt ◦ σyLt . This\nprocess ᾱt will satisfy the requirements of (ii') since\nᾱt σyLt = σyLt ᾱt = αt σyLt .\n\n(4.7)\n\nIn fact (4.7) is a reflection of the fact that σyL extends to a linear isomorphism\nσyL : Sy∗ → Sy canonically. In particular σyLt (αt ) is well defined.\nDefinition 4.1.3 If (αt ) satisfies (i) and (ii) we will say it is in L2L if\nZ t\nαs σyLs (αs )ds < ∞\n0\n\nfor all t > 0, and will say it is in L2L,loc if for any compact subset K of M\nZ t∧ζ\nE\nχK (ys )αs (σ L αs ) ds < ∞\n0\n\nfor all t > 0.\nRemark 4.1.4 Suppose the processes associated to diffusion operators L and L +\nLb are both non-explosive, where b is a locally bounded measurable vector field on\nM. Assume that there exists a T ∗ M- valued process b#\n. defined on the canonical\nL\nprobabilty space Cy0 M such that P -almost surely:\n1. 2σ L (b#\ns ) = b(ys )\nRt\nL #\n2. 0 b#\ns σ (bs )ds < ∞\n\nThen, by the GMCM-theorem, as in the Appendix section 9.1, we have on C([0, T ]; M),\nPL+Lb = Zt PL\nRt\n#\nL #\nwhere Zt = exp{Mtb − 0 b#\ns σ (bs )ds}. In an obvious notation, for suitable α,\nas canonical processes we have, almost surely,\nZ t\nZ t\nZ t\nL\nL+Lb\nαs d{ys } =\nαs d{ys}\n−\nα(b(us ))ds.\n0\n\n0\n\n0\n\n\f4.1. INTEGRATION OF PREDICTABLE PROCESSES\n\n63\n\nLemma 4.1.5 Suppose σ L has image in a subset S of T M. Then (Mtα ) depends\nonly on the restriction of αs in L(Tys M; R) to Sys , 0 6 s < ζ. In particular (4.2)\ndefines uniquely a local martingale for each predictable S ∗ -valued process (αt )\nover (yt )for which the right hand side of (4.2) is always finite almost surely.\nProof. For T ∗ M-valued F∗y0 predictable processes (αt1 , 0 6 t < ζ) and (αt2 , 0 6\nt < ζ) over (yt , 0 6 t < ζ) which agree on S we see\nZ t∧ζ\nα1\nα2\ndf\nhM − M , M it = 2\nσ(αs1 − αs2 , (df )ys ) ds = 0\n0\n\nα1\n\n2\n\nfor all f ∈ Cc∞ M. Therefore M = M α . On the other hand this also shows\nthat if αs ∈ Sy∗s for all s, we can use condition (ii)' above to choose a predictable\nprocess {ᾱs : 0 6 s < ζ} with values in T ∗ M over (yt ) and set M*α = M*ᾱ\nwithout ambiguity.\nExample 4.1.6 Canonical Brownian motion associated to a cohesive diffusion.\nFor simplicity assume that our L-diffusion from a given point y0 is non-explosive.\nIf L is cohesive with sub-bundle E of TM, take a metric connection Γ for E, using\nthe metric determined by 2σ L . Let\nαs (σ) := (//σs )−1 : Eσ(s) → Ey0\nbe the inverse of parallel translation, //σs , along σ from Eσ(0) to Eσ(s) , for Py0\nalmost all paths σ in M. Each component of this with respect to an orthonormal\nbasis for Ey0 clearly lies in L2L . With the obvious extension of our notation to the\nvector space valued case define an Ey0 -valued process Bt : t > 0 by\nZ t\nα\nBt = Mt =\n(//)−1 d{ys }.\n0\n\nIt is easy to check from its quadratic variation that it is a Brownian motion on the\ninner product space Ey0 . Moreover (as described in [27]) it has the same filtration\nas the canonical process on Cy0 M up to sets of measure zero. It is the martingale\nRt\npart of the stochastic anti-development 0 (//s )−1 dys of our L-diffusion from y0 .\nThe use of a different metric connection would change it by\b a random rotation, so\nthis process is defined on the canonical probability space Cy0 M, F y0 , Py0 and\nup to such rotations depends only on it. We have, for α as usual:\nZ t\nZ t\nαs d{ys } =\n(αs ◦ //s ) dBs .\n(4.8)\n0\n\n0\n\n\fCHAPTER 4. PROJECTIBLE DIFFUSION PROCESSES\n\n64\n\nUsing the definitions in the Appendix 9.3 we see that if our diffusion process y. is\na Γ-martingale then\nZ t\nZ\n\u0001 t\nαs d{ys } = Γ\nαs dys .\n(4.9)\n0\n\n0\n\nNote that there is always some metric connection Γ on E for which a cohesive\ndiffusion process is a Γ-martingale, by section 2.1 of [27].\n\n4.2 Horizontality and filtrations\nWe can characterise horizontality of a diffusion operator or process in terms of\nfiltrations using the following lemma:\nLemma 4.2.1 Suppose p : N → M is a smooth map, B a smooth diffusion\noperator over a smooth diffusion operator A, and also\n(i) σ A and σ B have constant rank and\n(ii) the filtration generated by u* and p(u* ) agree up to sets of PBu0 -measure zero\nfor some u0 ∈ N.\nA\n, all u ∈ N.\nThen rank σuB = rank σp(u)\n\nProof. Set p = rank σxA and p̃ = rank σuB . By assumption p and p̃ do not depend\non x ∈ M and u ∈ N. Take connections on Image σ B and Image σ A which are\nmetric for the metrics induced by the symbols. Extend these connections to T N\nand T M. The martingale part of the stochastic anti-development of (u* ) will be a\nBrownian motion stopped at ζ B of dimension p̃ and that of (p(u* )) will be one of\ndimension p. By (ii) these have the same filtration up to sets of measure zero. But\nthis implies p = p̃ by the martingale representation theorem, as required.\nProposition 4.2.2 The following are equivalent for B over A when A is cohesive:\n(a) B = AH\n\n(b) B is cohesive and the filtration generated by its associated diffusion (u* )\nagrees with that of p(u* ) up to sets of PBu0 -measure zero for given u0 in N.\nProof. If (b) holds, Lemma 4.2.1 shows that Image[σuB ] = Hu for each u ∈ N,\nsince by (2.4) we always have Hu ⊂ Image[σuB ]. Thus (b) implies criterion (ii) of\nProposition 2.3.2. Also (b) follows from (iii) of Proposition 2.3.2 by considering\nthe stochastic differential equation driven by horizontal lifts X̃ 0 , . . . , X̃ m .\n\n\f4.3. THE FILTERING EQUATION\n\n65\n\n4.3 The Filtering Equation\nLet p : N → M be a smooth surjective map. Suppose that B is over A. However\nwe do not assume σ A of constant rank. Let {PBu0 } and {PA\nx0 } be, respectively, the\nsolutions to the martingale problem for B and A on the canonical spaces C(M + )\nand C(N + ). Denote by (ut ) and (xt ) the corresponding canonical processes with\nlife time ζ N and ζ M respectively. Note that ζ B 6 ζ A ◦ p almost surely with respect\nto PBu0 . We shall assume that the paths of the diffusion on N do not explode before\ntheir projections on M do, more precisely ζ M ◦ p = ζ N almost surely with respect\nto PBu0 for each u0 , equivalently,\n• Assumption S.\n\nCup0 M + := {σ : [0, ∞) → M + : lim p(ut ) = ∆ when ζ B < ∞}\nt→ζ B\n\nhas full PBu0 measure for each u0 ∈ N.\n\nDenote by the following the filtrations induced by the processes indicated:\nFtu0 = σ(us , 0 6 s 6 t),\nFtx0 = σ(xs , 0 6 s 6 t),\n\np(u0 )\n\nFt\n\n= σ(p(us ), 0 6 s 6 t),\n\nF u0 = σ(ys , 0 6 s < ∞)\nF x0 = σ(xs , 0 6 s < ∞)\n\nF x0 = σ(p(us ), 0 6 s < ∞).\n\nB\nProposition 4.3.1 Under Assumption S, p∗ (PBu0 ) = PA\np(u0 ) and Pt (f ◦ p) =\nPtA (f ◦ p) for all f ∈ Cc∞ (M).\n\n∞\nProof. If p(u0 ) = x0 , f ∈ CK\n(M), we only need to show that Mtdf,A is a martingale with respect to p∗ (PBu0 ). Using Assumption S,\nZ t\ndf,A\nMt (p(u)) = f (p(ut)) − f (p(u0 )) −\nAf ◦ p(us ))ds\n0\nZ t\n= f (p(ut)) − f (p(u0 )) −\n(B(f ◦ p)) (us )ds\n0\n\n=\n\nd(f ◦p),B\nMt\n\nis a martingale with respect to (Ftu0 ) and PBu0 . Take s 6 t and let G be a Fsx0 measurable function. Then\nn\no\nn\no\ndf,A\ndf,A\np∗ (PB\nPB\nu0 )\nu0\nMt (p(u* ))G(p(u* ))\nE\nMt G = E\nn\no\nB \b\nB\nd(f ◦p),B\nG ◦ p = EPu0 Msd(f ◦p),B G ◦ p)\n= EPu0 Mt\n\b\nB\n= Ep∗ (Pu0 ) Msdf,A G\n\n\fCHAPTER 4. PROJECTIBLE DIFFUSION PROCESSES\n\n66\n\nand the result follows from the uniqueness of the martingale problem.\nWe will need the following elementary lemma:\nLemma 4.3.2 Let (Ω, F , Ft, P} be a filtered probability space and G∗ a subfiltration of F∗ with the property that for all s > 0,\nE{A|Gs } = E{E{A|Fs}|G},\n\n∀A ∈ F ,\n\n(4.10)\n\nwhere G = ∨s Gs . Then\n(i) (E{Mt |G}, t > 0) is a G∗ -martingale whenever (Mt : t > 0) is an F∗ martingale;\n(ii) For all G-measurable and integrable H\n\b\nE H|Fs } = E{H|Gs };\n\n\b\n\b\n(iii) E E{A|Fs}|G = E E{A|G}|Fs ,\n\n∀A ∈ F .\n\nProof. For (i) set Nt = E{Mt |G}, 0 6 t < ∞. By (4.10), (Nt ) is Gt measurable. For s 6 t suppose that f is Gs -measurable and bounded. Then E(Nt f ) =\nE(Mt f ) = E(Ms f ) = E(Ns f ). For (ii), let H and F be bounded measurable\nfunctions with G-measurable and Fs -measurable representations. Then\n\b\n\b\n\b\n\b\n\b\n\b\n\b\nE H|F = E H|E F |G = E H|E F |Gs = E H|E F |G\n\b\nusing (4.10). Thus\b E H|Fs} = E{H|Gs } as required. Part (iii) follows from (ii)\non taking H = E E{A|G} and using equation (4.3.2).\np(u0 )\n\nPart (ii) of the following proposition says that the filtration F∗\nthe filtration F∗u0 in the terminology of Tsirelson [71].\n\nis immersed in\n\nProposition 4.3.3 (i) For fixed t > 0 let f be a bounded Ftu0 -measurable function. Then\no\nn\n\b\np(u )\nE f |F p(u0) = E f |Ft 0 .\np(u )\n\n(ii) All F∗ 0 martingales are F∗u0 martingales. In fact if f = G ◦ p for G an\nintegrable functional on C(M + ) with respect to PA , we have\np(u0 )\n\nEu0 {f |Ft\n\n} = Eu0 {f |Ftu0 }.\n\n\f4.3. THE FILTERING EQUATION\n\n67\n\nProof. (i) Write f = F (us : 0 6 s 6 t) for F a bounded measurable function\non C(N + ). Let G be bounded measurable functions of {p(us ) : 0 6 s 6 t} and\ng 1 , . . . , g k bounded Borel functions on M, with h1 , . . . , hk positive real numbers.\nBy the Markov property of u* and of p(u* ),\n\u0001\nE F (us : 0 6 s 6 t) G g 1 ◦ p(ut+h1 ) * * * * * g k ◦ p(ut+h1 +***+hk )\n\u0001\n\u0001\n=\nE F (us : 0 6 s 6 t)G PhA1 g 1 PhA2 (g 2 . . . PhAk g k ) (p(ut )) .\nTherefore,\n\no\nn\n\b\np(u)\nE F (us : 0 6 s 6 t)|F p(u) = E F (us : 0 6 s 6 t)|Ft\n\nas required.\nPart (ii) is immediate from (i) by Lemma 4.3.2.\n\nAs in §2.1 set Ex = Image σxA with hu : Ep(u) → Tu N the horizontal lift\ndefined by (2.4), although now we have no constant rank assumption and so no\nsmoothness of h. Also let EuB = Image σuB . For an F∗x0 -predictable E ∗ -valued\nprocess φt := φt (σ* ), 0 6 t < ζ A along (σt : 0 6 t < ζ A ) let (p∗ (φt ) :\n0 6 t < ζ B ) be the pull back restricted to be an (E B )∗ -valued process along\n(ut : 0 6 t < ζ B ) defined by\np∗ (φt )(u* ) = φt (p(u)) ◦ Tut p : E B ut → R.\nSince φt has a predictable extension φ̄t so does p∗ (φt ) and so the latter is predictable. Moreover p∗ (φt )σ B (p∗ φt ) = φt σ A (φt ) by Lemma 2.1.1 showing φ* is in\nL2A if and only if p∗ (φ* ) is in L2B . For such φ we have the following intertwining:\nProposition 4.3.4 Let φ be a predictable L2A -valued process.\n\nB,p∗ (φ)\n\n(1) For PBu0 almost surely all sample paths, MtA,φ ◦ p = Mt\n\nfor t < ζ B .\n\n(2) If α ∈ L2B with αt ◦ ht = 0 almost surely, then hMtα , Mtdf ◦T p i = 0 and\nEB,u0 {Mtα |F p(u0) } = 0 for all C 1 functions f on M .\nProof. For φ = df , (1) follows from p∗ (df )u = d(f ◦ p)u as in the proof of\nProposition\nFor general φ, taking a predictable extension if necessary, write\nP4.3.1.\nm i\nφt (x) = 1 gt (x* )(df j )xt for smooth functions f j : M → R and real valued\npredictable {gtj : 0 6 t < ζ A}. Therefore\nm Z t\nX\nB,p∗ (df j )\nB,p∗ (φ)\nA,φ\nMt ◦ p =\ngsj (p(u* )) dMt\n= Mt\nj=1\n\n0\n\n\f68\n\nCHAPTER 4. PROJECTIBLE DIFFUSION PROCESSES\n\nfor all t < ζ B , giving (1). For (2) let F : N → R be a smooth measurable\nfunction with respect to F p(u0 ) . Then F = f (p(u* )) for some measurable function\nf : M → R.\nZ\n1 B,u0\n1 B,u0 t B\ndf ◦T p\nB,u0\nα\nα\nE\n(Mt f (p(u* ))) =\nσ (αs , df ◦ T p(us ))ds.\nE hMt , Mt\ni= E\n2\n2\n0\nIf αt hut = 0 almost surely for all t, we apply (2.4) to see\n\u0010\n\u0011\nA\ndf = 0\nσ B (αs , df ◦ T p(us )) = αs σuBs T ∗ p(df ) = αs hus σp(u\ns)\nand thus EB,u0 (Mtα f (p(u* ))) = 0 giving (2).\n\nFor α ∈ L2B define βs ≡ EB,u0 {αs ◦ hus |p(u* ) = x* }, 0 6 s < ζ to be the\nunique, up to equivalence, element of L2A such that\n\u0010\n\u0011\n\u0011\n\u0010\n(4.11)\nEB,u0 αa ◦ hus σ A (φs (p(u* ))) = EA,p(u0 ) βs σ A (φs ) .\n\nfor any φ ∈ L2A . To see such an element exists and is unique recall that\nA\n= αs σuBs (tus p)∗\nαs ◦ hus σp(u\ns)\n\nwhich is an F∗u0 -predictable process with values in Ep(us ) ⊂ Tp(us ) M at each time\ns, and by Proposition 4.3.3, (4.11) is equivalent to\no\nn\n∗\np(u0 )\nA\nB,u0\nB\np)\n|F\n(4.12)\n(T\nβs (p(u* ))σp(u\n=\nE\nα\nσ\nu\ns\ns\nus\ns)\n\nin the sense of Elworthy-LeJan-Li [27]. The predictable projection theorem and\nthe results of [27] shows that there is a unique, up to indistinguishability, F p(u* ) predictable T M versiob {γt : 0 6 t < ζ} say, over {p(ut ) : 0 6 t < ζ}, of\nthe right hand side of (4.12). By applying the uniqueness part of this projection\np(u )\ntheorem to {φs (γs ) : 0 6 s < ζ} when φ* is F∗ * -predictable, T ∗ M-valued\nover p(u* ) and φt vanishes on Ep(ut ) for all 0 6 t < ρ with probability 1, we see\nA\nγt ∈ Ep(uu ) for all 0 6 t < ζ almost surely. Now set βs (p(u* )) = [σp(u\n]−1 γs in\ns)\n∗\nEp(us ) .\nProposition 4.3.5 For any α* in L2B we have\nZ T\nB,u0\nα\nE\n{Mt | p(u* ) = x* } =\nEB,u0 {αs ◦ hus | p(u* ) = x* } d{xs }.\n0\n\n\f4.4. A FAMILY OF MARKOVIAN KERNELS\n\n69\n\nProof. Set Nt = E{Mtα | F p(u0) } and write Nt (u) = N̄t (p(u)) for {N̄t } a Ftx0 p(u )\nmeasurable function. By Proposition 4.3.3, (Nt ) is an F∗ * -martingale and we\nsee (N̄t ) is an F∗x martingale. Take g ∈ Cc∞ M then by Proposition 4.3.4,\no\nn\np(u )\nhN̄, M A,dg it ◦ p(u) = EB,u0 hM α , M d(g◦p) it |Ft 0 (u)\no\nn\np(u )\n= EB,u0 σuBt (αt , (Tut p)∗ (dg)) |Ft 0\no\nn\np(u0)\nA\n(dg)|F\n= EB,u0 αt ◦ hut σp(u\nt\nt)\n\nby equation (2.4). By Proposition 4.1.1 and the definition\n\b above of the conditional\nexpectation, N̄t (p(u* )) = M A,β for β ◦ p(u* ) = EB,u0 αt ◦ hut |F p(u0) and so\nZ t\nN̄t (x* ) =\nE {αs ◦ hus |p(u* ) = x* } d{xs }\n0\n\nas required.\n\n4.4 A family of Markovian kernels\nFor a probability measure μ0 on N + let the measures μt on N + be the flow of ut\nunder PBμ0 and set νt = p∗ (μt ) on M + . Let ημ0 be the law of u* 7→ (p(u* ), u0 ) on\nC(M + ) × N + under PBμ0 so\nZ\ny\nA ∈ B(M + ), Γ ∈ B(N + )\nPA\nημ0 (A, Γ) =\ny (A) ρμ0 (Γ) ν(dy),\ny∈M +\n\nwhere ρyμ0 arises from a disintegration of μ0\nZ\nμ0 (Γ) =\nρyμ0 (Γ) ν(dy),\ny∈M +\n\nΓ ∈ B(N + ).\n\nFor a measurable f : N + → R, integrable with respect to μt set\nπtμ0 ,σ f (v) = EBμ0 {f (ut )|p(u0) = σ, u0 = v}.\n\n(4.13)\n\nIt is defined for ημ0 almost all (σ, v) in C(M + ) ×N + . In particular for PA\nν0 -almost\nσ(0)\nall σ it is defined for ρμ0 -almost all v ∈ N + . We could use the convention that\nπtμ0 ,σ f (v) = 0\n\n\fCHAPTER 4. PROJECTIBLE DIFFUSION PROCESSES\n\n70\n\nif p(v) 6= σ(0). With this convention, if we define θt σ(s) = σ(t + s) we see that\nμt ,θt σ\nfor PA\nf (y) is defined for μt -almost all y in N + .\nv0 -almost all σ the map y 7→ πt\nFurther for u0 ∈ N and f : N + → R bounded measurable define\nπt f (u0 ) : Cp(u0 ) M + → R,\nPA\np(u0 ) -almost surely, by\nn\no\nδu ,σ\nπt f (u0 )(σ) = E f (ut )|p(u* ) = σ = πt 0 f (u0 ).\n\n(4.14)\n\nThis can be extended, as in [27], to the case of predictable process in vector bundles over N, and to define\nπt (α ◦ hu* )(u0) : Cp(u0 ) M + → R\nas EB,u0 {αs hus |p(u* ) = x* }, defined above.\n\n4.5 The filtering equation\nTheorem 4.5.1 (1) If f is Cc2 N, or more generally if f is C 2 with Bf and\nσ B (df, df ) ◦ h bounded, then\nπt f (u0 ) = f (u0 ) +\n\nZ\n\nt\n\nπs (Bf )(u0 )ds +\n\n0\n\nZ\n\n0\n\nt\n\nπs (df ◦ hu* )(u0 )d{xs }. (4.15)\np(u0 )\n\nIn particular {πt f (u0 ) : t > 0} is a continuous F∗\n\nsemi-martingale.\n\n+\n(2) For bounded measurable f : M + → R and PA\nv0 almost all σ in C(M ), for\neach s, t > 0\nμ0 ,σ\nSt+s\nf (v) = πtμ0 ,σ πsθt σ, μt f (v)\n(4.16)\nσ(0)\n\nfor ρμ0 almost all v in N + .\n(3) Moreover there exists a family of probability measures Qμν 0 ,σ on C(N + )\ndefine for ηu0 -almost surely all (σ, v) such that if F : C(N + ) → R is of the\nform\nF (u* ) = f1 (ut1 ) . . . fn (utn )\n\n\f4.5. THE FILTERING EQUATION\n\n71\n\nsome 0 6 t1 < t2 < . . . tn and bounded measurable fj : N + → R,\nj = 1, 2, . . . , n then\nZ\n\u0011\n\u0010\n\u0010\nμtn ,θtn−1 σ\nμ 1 ,θt1 σ\nF (u)Qμv 0 ,σ (du) = Stμ10 ,σ f1 St2t−t\nf\nf\n.\n.\n.\nS\nn (v)\n2\ntn −tn−1\n1\nu∈C(N + )\n\n= EBμ0 {F (u* )|p(u* ) = σ0 }\n\nημs -almost surely in (σ, v).\nProof. (1). By definition of M df we have\nZ t\nf (ut ) = f (u0 ) +\nBf (us )ds + Mtdf\n0\n\nso\n\nπt f (u0 ) = f (u0) +\n\nZ\n\n0\n\nt\n\nn\no\ndf,B\nπs Bf (u0 )ds + E Mt | p(u*) = x\n\n(4.17)\n\nand part (1) follows from Proposition 4.3.5.\n(2). We observed above that the right hand side of (4.16) is well defined for\nPA\nμ0 almost all σ. The equation then follows from the Markov property.\n(3). The existence of regular conditional probabilities in our situation implies\nthe existence of the probabilities Qμν 0 ,σ as required, together with a standard use\nof the Markov property.\nRemark 4.5.2 A description of the Qμv 0 ,σ is given in the next section, in the case\nwhere A is cohesive.\nRecall we have the decomposition Fu = Hu + V Tu N for each u ∈ N, and\nF = ⊔Fu . If l ∈ Fu∗ there is a corresponding decomposition\nl = lH + lV ∈ Fu∗ ,\nwhere lH vanishes on V Tu N and lV on Hu . For l ∈ Tu∗ N write lV = (l|Fu )V\nand lH = (l|Fu )H .\nCorollary 4.5.3 Suppose A is cohesive. If f is Cc3 N then there is the Stratonovitch\nequation\nZ t\nZ t\nV\nπt f (u0)(x* ) = f (u0) +\nπs (B f )(u0)ds +\nπs (dfu0 ◦ huo ) ◦ dxs .\n0\n\n0\n\n(4.18)\n\n\fCHAPTER 4. PROJECTIBLE DIFFUSION PROCESSES\n\n72\n\nProof. We use (4.17). By Proposition 4.3.5,\nH\n\nE{Mtdf | p(u* ) = x* } = E{Mtdf | p(u* ) = x* }.\nNote that\nH\nMtdf\n\n=\n\nZ\n\nt\nH\n\n0\n\n(df )us ◦ dus −\n\nby Lemma 4.1.2. Furthermore\nV\n\nH\n\nZ\n\nt\n\nδ B (df H )(us )ds\n\n0\n\nH\n\nH\n\nδ B (df H ) = δ B (df H ) + δ A (df H ) = δ A (df H ) = δ A (df ) = AH (f )\nsince df H vanishes on vertical vectors and df = df H + df V while df V vanishes\nH\non horizontal vectors, so δ A (df V ) = 0. This gives\n\u001b\n\u001aZ t\nZ t\nV\nH\nπt f (u0)(x* ) = f (u0)+ πs (B f )(u0 )(x* )ds+E\n(df )us ◦ dus p(u* ) = x*\n0\n\n0\n\nFinally (4.18) follows since dfuH = p∗ (df ◦hu ) = df ◦hu ◦Tu p and Tu p◦dut = ◦dxt .\n\n4.6 Approximations\nAssume now that the law of ut under PA\nu0 is given by\nZ\nA\nPt (u0 , A) =\nPtA (u0 , v)dv,\nA ∈ B(M)\nA\n\nfor pA\nt (u0 , v) a smooth density with respect to some fixed, smooth, strictly positive\nmeasure on M to which 'dv' refers. This is the case if A is hypoelliptic.\nConsider the conditional probability\nqtu0 ,b (V ) = PBu0 {ut ∈ V |p(ut ) = b},\n\nV ∈ B(N)\n\ndefined for pA\nt (u0 , −) almost sure all b in M. There is the disintegration of\npBt (u0 , −)\nZ\nB\npt (u0 , V ) =\nqtu0 ,b (V )pA\nt (p(u0 ), db)\nb∈M\n\nand the formula\n\nμμt 0 ,b (V\n\n)=\n\n−1\nlim(pA\nt (p(u0 ), b)]\nǫ↓0\n\nZ\n\nV\n\npBt−ǫ (u0 , dv)pA\nǫ (p(v), b).\n\n\f4.7. KRYLOV-VERETENNIKOV EXPANSION\n\n73\n\nTake a nested sequence {Πl }∞\nl=1 of partitions of [0, t]\nΠl = {0 = tl0 < tl1 < * * * < tlkl = t},\nsay, with union dense in [0, t]. For any continuous bounded f : N + → R there is\nthe following approximation scheme to complete πt f (u0):\nProposition 4.6.1\nZ\n\nu ,σ(tl )\n\nv ,σ(tl )\n\nvk\n\n−1 ,σ(t)\n\nqtl0 1 (dv1 )qtl1−tl 2 (dv2 ) . . . qtl l−tl −1 (dvkl )f (vkl )\nk\nk\n1\n2\n1\nl→∞\n\b\n1 6 j 6 kl }.\n= lim EBu0 f (ut) | p(ultj ) = σ(tlj ),\n\nπt f (u0 )(σ) = lim\n\nl→∞\n\nProof. The two versions of the right hand sides are equal before taking limits. For\nl = 1, 2, . . . ,, set\n\b\nS l f (σ) = Eu0 f (ut ) | p(utlj ) = σ(tlj ), 1 6 j 6 kl }.\n\n+\nl\nIt is defined for PA\nx0 -almost all σ in C(M ), where x0 = p(u0 ). Let Q be the\n+\nl\nl\nσ-algebra on C(M ) generated by σ 7→ (σ(t1 ), . . . , σ(tj )). Directly from the\ndefinitions we see\nπtl f = E{πt (f )(u0 ) | Ql },\n\n∗\nA\nand so {S l f }∞\nl=1 is an Q -martingale. it is bounded and so converges Px0 -almost\nsurely. Since ∨l Ql is the Borel σ-algebra the limit is πt f (u0) as required.\n\n4.7 Krylov-Veretennikov Expansion\nP\nj m\nSuppose A = m\nj=1 LX j LX j + LA for smooth vector fields {X }j=1 and A. We\nwill now take {xt : 0 6 t < ζ} to be the solution to the stochastic differential\nequation\ndxt = X(xt ) ◦ dBt + A(xt )dt,\n(4.19)\nwith x0 given, for a Brownian motion B* on Rm , rather than the canonical process.\nHere X(x) : Rm → Tx M is the map given by\nX(x)(a1 , . . . , am ) =\n\nm\nX\nj=1\n\naj X j (x),\n\nx ∈ M.\n\n\fCHAPTER 4. PROJECTIBLE DIFFUSION PROCESSES\n\n74\n\nLet {Pt : t > 0} be the sub-Markovian semi-group generated by B. Let f ∈\nCc∞ N. Assume Pt f ∈ C ∞ N.\nAs in the proof Theorem 4.5.1, from\nZ s\nPt−s f (us ) = Pt f (u0 ) +\nd(Pt−r f )ur d{ur }, 0 6 s 6 t\n0\n\nwe obtain\nπs Pt−s (f )(u0)(x* ) = Pt f (u0) +\n= Pt f (u0) +\n\nZ\n\nZ\n\ns\n0\n\n0\n\nE {d(Pt−r f )ur ◦ hur | p(u* ) = x* } d{xr }\ns\n\nE {d(Pt−r f )ur ◦ hur | p(u* ) = x* } X(xr )dBr\n\nso that πs Pt−s f (u0), 0 6 s 6 t, is a continuous F∗x0 semi-martingale. Therefore\nZ t\nπt f (u0 ) − Pt f (u0 ) =\nds (πs Pt−s f (us ))\n0\nZ t\n=\nE {d(Pt−r f ) ◦ hur | p(u* ) = x* } X(xr )dBr\n0\nZ t\n\u0002\n\u0003\n=\nSr d(Pt−r f ) ◦ h− ◦ X k (p(−)) (u0 )dBrk\n0\n\ngiving a 'Clark-Ocone' formula for πt f (u0 ). Iterating this procedure formally,\nZ t\n\u0002\n\u0003\nπt f (u0) = Pt f (u0 ) +\nSr d(Pt−r f ) ◦ h− ◦ X(p(−)) (u0 )dBr\n0\nZ tZ r h\ni\n\u0002\n\u0003\nk\nj\n+\nπs dPr−s d(Pt−r f ) ◦ h− ◦ X (p(−)) h− ◦ X (p(−) dBsj dBrk\n0\n\n= ...,\n\n0\n\nwe obtain the Wiener chaos expansion of πt f (u0)(x* ).\n\n4.8 Conditional Laws\nIt will be convenient to extend the notation of section 4.3. For 0 6 l < r < ∞\nlet C(l, r; N + ) and C(l, r; M + ) be respectively the space of continuous paths u :\n[l, r] → N + and x : [l, r] → M + which remain at ∆ from the time of explosion; and Cu0 (l, r; N + ) and Cx0 (l, r; M + ) the paths from u0 ∈ N + and x0 ∈ M +\n(l,r),B\n(l,r),A\nrespectively, Let {Pu0 } and {Px0 } be the associated diffusion measures.\n\n\f4.8. CONDITIONAL LAWS\n\n75\n\nThe conditional law of {us : l 6 s 6 r} given {p(us ) : l 6 s 6 r} will\n(l,r);A\nbe given by probability kernels σ 7→ Ql,r\nalmost surely from\nσ,u0 defined P\n+\np\n+\np\nCp(u0 ) (l, r; M ) to Cu0 (l, r; N ) for each u0 ∈ N, where Cu0 (l, r; N + ) is the subspace of Cu0 (l, r; N + ) whose paths satisfy Assumption S. The defining property\nis that for integrable f : Cu0 (l, r; N + ) → R\nZ\nf (y)dQl,r\n(4.20)\nE {f (u* ) | p(us ) = σs , l 6 s 6 r} =\nσ,u0 (y).\ny∈Cu0 (l,r;N + )\n\nTo obtain the conditional law take the decomposition B = AH +BV of Proposition\n2.3.5. Represent the diffusion corresponding to A by a stochastic differential\nequation\ndx′t = X(x′t ) ◦ dBt + X 0 (x′t )dt.\n(4.21)\nTake a connection ∇V on V T N and let\n(∇V )\n\ndzt = V (zt )dWt + V 0 (zt )dt\n\n(4.22)\n\nbe an Itô equation whose solutions are BV -diffusions. Here (Wt ) is the canonical\nBrownian motion on Rm for some m, independent of (B* ), the map V : M ×\nRm → T M takes values in ker[T p], and V and V 0 are locally Lipschitz. For such\na representation of BV diffusions see the Appendix B. Let X̃ : N × Rm → H and\nX̃ 0 : N → H be the horizontal lifts of X and X 0 respectively using Proposition\n2.1.2. The solution to\n(∇V )\n(l,r),B\n\nhas law Pu0\n\ndyt = X̃(yt ) ◦ dBt + X̃ 0 (yt )dt + V (yt )dWt + V 0 (yt )dt,\nyl = u0 ,\nu0 ∈ N, l 6 t 6 r.\n. Noting that X̃(u) = hu X(p(u)) for u ∈ M,\n\n(∇V )\n\ndyt = hyt ◦ dx′t + V (yt )dWt + V 0 (yt )dt,\nyl = u0, l 6 t 6 r,\n\n(4.23)\n\nwhere x′t = p(yt ) so that (x′t ) is a solution to (4.21) starting from p(u0 ) at time\nl. Without changing the law of y* we can replace x′ by the canonical process x* .\nThen\nTheorem 4.8.1 Consider the solution (yt ) as a process defined on the probability\nspace Cp(u0 ) (l, r; M + ) × C0 Rm with product measure,\ny : [l, r] × Cp(u0 ) (l, r; M + ) × C0 Rm → N + ,\n\n\fCHAPTER 4. PROJECTIBLE DIFFUSION PROCESSES\n\n76\n\nm\n+\nand define Ql,r\nσ,u0 to be the law of y(σ, −) : C0 R → Cu0 (l, r; N ). For bounded\nmeasurable f : Cu0 (l, r; N + ),\nZ\nf (y)dQl,r\nE {f (u* ) | p(us ) = σs , l 6 s 6 r} =\nσ,u0 (y).\ny∈Cu0 (l,r;N + )\n\nProof. Take a measurable function α : Cp(u0 ) (l, r; M + ) → R. Then\n!\nZ\nB\n\nEPu0\n\n= E\n\nPA\np(u\n\nα(p(u))\n\n0)\n\nα(x)\n\nZ\n\ny∈Cu0\n\ny∈Cu\n\n(l,r;N + )\n\n(l,r;N + )\n\nf (y) dQl,r\np(u),u0 (y)\n\nf (y) dQl,r\nx,u0 (y)\n\n!\n\n0\n\u0012\n\u0013\nZ\nPA\np(u0 )\nα(x)\nf (y(x, ω)) dP(ω))\n= E\nC0 Rm\nZ\n\u0001\n=\nα(x)f (y(x, ω)) dPA\np(u0) dP(ω))\n\nCp(u0 ) (l,r;M + )×C0 Rm\n\n= Ef (u)α(p(u)),\nas required.\n\nNote that Theorem 4.8.1 is equivalent to the statement that ω 7→ Ql,r\np(ω),u0 ,\n(l,r),B\n\nω ∈ Cu0 (l, r; N + ), is a regular conditional probability of Pu0\n\ngiven p.\n\nRemark 4.8.2 Let (ξtl (*, *), l 6 t < ∞) be a measurable flow for (4.21) and\n(ηtl (σ, *, ), 0 6 t < ∞) one for (4.23) with x′ replaced by σ ∈ Cp(u0 ) (l, r; M + ).\nFor ω ∈ Ω, the underlying probability space for the Brownian motion B, define\n+\nQl,r\nω , from the space of bounded measurable functions on N to itself, by\n\u0001\nl l\nQl,r\nω (f )(u0 ) = Ef ηr (ξr (p(u0 ), ω), u0 ) .\nA direct calculation shows that\n\nr,s\nl,s\nQl,r\nω Qω = Qω\n\nfor 0 6 l 6 r 6 s < ∞. Thus their adjoints on a suitable dual space would form\nan evolution.\nMore generally, letting Borel(X) stand for the Borel σ-algebra of a topological\nspace X:\n\n\f4.8. CONDITIONAL LAWS\n\n77\n\nProposition 4.8.3 Let φ be a measurable map from Cx0 (l, r; M + ) to some measure space, and let\nP(l,r),φ\n: Cx0 (l, r; M + ) × Borel(Cx0 (l, r; M + )) → [0, 1]\nx0\n(l,r)\n\nbe a regular conditional probability for Px0 given φ. For u0 with p(u0 ) = x0 set\nZ\n(l,r),φ\nl,r,φ◦p\nQl,r\n(p(ω), dσ)\nQu0 (ω, A) =\nσ,u0 (A)Px0\nCx0 (l,r;M + )\n\nfor ω ∈ Cu0 (l, r; N + ) and A ∈ Borel (Cu0 (l, r; N + )). Then Ql,r,φ◦p\nis a regular\nu0\n(l,r),B\nconditional probability of Pu0\ngiven φ ◦ p.\nProof. By definition\nn\no\nl,r\n(l,r),A,x0\nQl,r,φ◦p\n(ω,\nA)\n=\nE\nQ\n(A)|φ\np(ω)\nu0\np(−),u0\n\b\n= E(l,r),A,x0 E(l,r),B,u0 {χA |p = −}|φ p(ω)\n= E(l,r),B,u0 {χA |φ ◦ p}(ω).\n\nCorollary 4.8.4 For φ as in Theorem 4.8.3 suppose that the canonical process\n(0,T ),φ\non M + with law Px0\n(σ, −) is a semi-martingale for almost all σ, in its own\n(0,T ),A\nx0\nalmost all σ. Then the solution y(σ, −) to\nfiltration Ft , 0 6 t 6 T , for Px0\nthe equation\n(∇V )\n\ndyt = hyt ◦ dσt + V (yt )dWt + V 0 (yt )dt,\nyl = u0 , 0 6 t 6 T\n(0,T ),φ\n\nwhere σt , 0 6 t 6 T is run with law Px0\nfrom u0 conditioned by φ ◦ p.\n\n(4.24)\n\n(σ, −), is a version of the B-diffusion\n\nProof. That the law of the solution is as required follows from the discussion at\nthe beginning of this section together with Proposition 4.8.3 and Fubini's theorem.\nConditions under which conditioned processes are semi-martingales are discussed by Baudoin [2]. In particular bridge processes derived from elliptic diffusions are, so we obtain the following version of Carverhill's result [12]:\n\n\fCHAPTER 4. PROJECTIBLE DIFFUSION PROCESSES\n\n78\n\nCorollary 4.8.5 Suppose A is elliptic and let bt : 0 6 t 6 T be a version of the\nA-bridge going from x0 to z in time T , some z ∈ M. Then the solutions to\n(∇V )\n\ndyt = hyt ◦ dbt + V (yt )dWt + V 0 (yt )dt,\ny0 = u0 , 0 6 t 6 T\n\n(4.25)\n\ngive a version of the B diffusion from u0 conditioned on p(uT ) = z.\n\n4.9 Equivariant case: skew product decomposition\nIn the equivariant case, when N is the total space P of a principal bundle\nπ : P → M as in §5, a version of Theorem 4.8.1 is given in [25] which reflects\nthe additional structure. In particular the following is proved there:\nProposition 4.9.1 Let B be an equivariant diffusion operator on P which induces\na cohesive diffusion operator A on M. Let {yt : 0 6 t < ζ} be a B-diffusion on\nP ∗ . Then\nyt = x̃t * gtx̃* ,\nwhere\n(i) {x̃t : 0 6 t < ζ} is the horizontal lift of p(y* ), starting at y0 , using the\nsemi-connection induced by B\n(ii) {gtσ : 0 6 t < ζ(σ)} is a diffusion independent of {p(yt ) : 0 6 t < ζ} on\nG starting at the identity with time dependent generator Lσt given by\nX\nX\nLσt f (g) =\nαij (σ(t) * g)LA∗i LA∗j f (g) +\nβ k (σ(t)g)LA∗k f (g),\ni,j\n\nfor any σ ∈ GP + , 0 6 t < ζ(σ), where A∗1 , . . . , A∗k are the left invariant\nvector fields on G corresponding to a basis of g and the αij and β k are the\ncoefficients for BV as in Theorem 3.2.1.\nNote that for each t the operator Lσt is conjugate to the restriction of BV to the\nfibre through σ(t) by the map\ng →\n7\np−1 (p(σ(t)))\ng →\n7\nσ(t)g.\nIt is a right invariant operator.\n\n\f4.9. EQUIVARIANT CASE: SKEW PRODUCT DECOMPOSITION\n\n79\n\nRemark 4.9.2 Note that by the equivariance of Lσ* there will be no explosion\nof the process (gtσ ) before that of σ* . Consequently Assumption S of §4.3 holds\nautomatically.\nBelow we give the equivariant version of Proposition 4.8.1. We shall use the\nnotation of §4.8. However we replace the one point compactification P + of P\nby P̄ = P ∪ ∆ with the smallest topology agreeing with that of P and such that\nπ : P̄ → M + is continuous. Also let G+ be the one point compactification G ∪ ∆\nof G with group multiplication and action of G extended so that\nu * ∆ = ∆, ∆ * g = g * ∆ = ∆,\n\n∀u ∈ P̄ , g ∈ Ḡ.\n\nFor 0 6 l < r < ∞ if y ∈ C(l, r; P̄ ), we write ly = l and ry = r. Let C(∗, ∗; P̄ )\nbe the union of such spaces C(l, r; P̄ ). It has the standard additive structure under\nconcatenation: if y and y ′ are two paths with ry = ly′ and y(ry ) = y ′ (ly′ ) let y + y ′\nbe the corresponding element in C(ly , ry′ ; P̄ ). The basic σ-algebra of C(∗, ∗, P̄ )\nis defined to be the pull back by π of the usual Borel σ-algebra on C(∗, ∗; M + ).\nGiven an equivariant diffusion operator B on P consider the laws {Pa(l,r),B : a ∈ P }\nas a kernel from P to C(l, r; P̄ ). The right action Rg by g in G+ extends to give a\nright action, also written Rg , of G+ on C(∗, ∗, P̄ ). Equivariance of B is equivalent\nto\n(l,r),B\nPag\n= (Rg )∗ Pa(l,r),B\n(l,r),B\n\nfor all 0 6 l 6 r and a ∈ P . Therefore π∗ (Pa\n) depends only on π(a),\nl, r and gives the law of the induced diffusion A on M. We say that such a\ndiffusion B is basic if for all a ∈ P and 0 6 l < r < ∞ the basic σ-algebra on\n(l,r),B\nC(l, r; P̄ ) contains all Borel sets up to Pa\nnegligible sets, i.e. for all a ∈ P\nand Borel subsets B of C(l, r; P̄ ) there exists a Borel subset A of C(l, r, M + ) s.t.\n\u0001\n(l,r),B\nPa\nπ −1 (A)∆B = 0.\nFor paths in G it is more convenient to consider the space C ̃id (l, r; G+ ) of\ncadlag paths σ : [l, r] → G+ with σ(l) = id such that σ is continuous until it\nleaves G and stays at ∆ from then on. It has a multiplication\nC ̃id (s, t; G+ ) × C ̃id (t, u; G+ ) −→ C ̃id (s, u; G+ )\n(g, g ′) 7→ g × g ′\n\nwhere (g × g ′ )(r) = g(r) for r ∈ [s, t] and (g × g ′)(r) = g(t)g ′(r) for r ∈ [t, u].\nGiven probability measures Q, Q′ on C ̃id (s, t; G+ ) and C ̃id (t, u; G+ ) respectively this determines a convolution Q ∗ Q′ of Q with Q′ which is a probability\nmeasure on C ̃id (s, u; G+ ).\n\n\f80\n\nCHAPTER 4. PROJECTIBLE DIFFUSION PROCESSES\n(l,r),B\n\nTheorem 4.9.3 Given the laws {Pa\n: a ∈ P, 0 6 l < r < ∞} of an equivariant diffusion B over a cohesive A there exist probability kernels {PH,l,r\n: a ∈ P}\na\nl,r\nl,r\nfrom P to C(l, r; P̄ ), 0 6 l < r < ∞ and y 7→ Qy , defined P a.s. from\nC(l, r; P̄ ) to C ̃id (l, r; G+ ) such that\n(i) {PH,l,r\n: a ∈ P } is equivariant, basic and determining a cohesive generator.\na\n(ii) y 7→ Ql,r\ny satisfies\n\nly ,r\n\n′\n\nl ′ ,ry ′\n\nQy+yy′ = Qlyy ,ry ∗ Qyy′\n\nfor Ply ,ry ⊗ Ply′ ,ry′ almost all y, y ′ with ry = ly′ .\n(iii) For U a Borel subset of C(l, r; P̄ ),\nZ\nZ\nl,r\nPa (U) =\nC(l,r;P̄ )\n\n+)\n ̃\nC(l,r;G\n\nH,l,r\nχU (y* * g* )Ql,r\n(dy).\ny (dg)Pa\n\nThe kernels PH,l,r\nare uniquely determined as are the {Ql,r\na\ny : y ∈ C(l, r; P̄ )},\nl,r\nPH,l,r\na.s.\nin\ny\nfor\nall\na\nin\nP\n.\nFurthermore\nQ\ndepends\non\ny only through its\na\ny\nprojection π(y) and its initial point yl .\nThe proof of this theorem is as that of Theorem 2.5 in [25] (although there the\nprocesses are assumed to have no explosion).\nStochastic differential equations can be given for (x̃t ) and (gtσ ) as in §4.8,\nfrom which the decomposition can be proved via Itô's formula; see Theorem 8.2.5\nbelow for details of a special case.\nProposition 4.9.1 extends results for Riemannian submersions by ElworthyKendall [24] and related results by Liao[48]. A rich supply of examples of skewproduct decomposition of Brownian motions, with a general discussion, is given\nin Pauwels-Rogers[58].\nFor a special class of derivative flows, considered as GLM-valued process as\nin §3.3 there is a different decomposition by Liao [49], see also Ruffino [65].\n\n4.10 Induced processes on vector bundles\nIn the notation of §3.4 let ρ : G → L(V, V ) be a C ∞ representation with Πρ :\nF → M the associated bundle. A B-diffusion {yt : 0 6 t < ζ} on P determines\n\n\f4.10. INDUCED PROCESSES ON VECTOR BUNDLES\n\n81\n\na family of {ψt : 0 6 t < ζ} of random linear map Wt from Fx0 → Fxt , where\nxt = π(yt ). By definition,\nψt [(y0 , e)] = [(yt , e)].\nAssuming A is cohesive we have the parallel translation //t : Fx0 → Fxt along\n{xt : 0 6 t < ζ} determined by our semi-connection. This is given by\n//t [(y0 , e)] = [(x̃t , e)]\nwhere x̃* is the horizontal lift of x, starting at y0 .\nWhen taken together with Corollary 3.4.8 the following extends results for derivative flows in Elworthy-Yor[29], Li[47], Elworthy-Rosenberg [28], and ElworthyLeJan-Li[27].\nTheorem 4.10.1 Let ρ : G → L(V ; V ) be a representation of G on a Banach\nspace V and Πρ : F → M the associated vector bundle. Let {yt : 0 6 t < ζ}\nbe a B-diffusion for an equivariant diffusion operator B over a cohesive diffusion\noperator A. Set xt = p(yt ) and let Ψt : Fx0 → Fxt , 0 6 t < ζ be the induced\ntransformations on F . Then the local conditional expectation {Ψ̄t : 0 6 t < ζ},\nfor Ψ̄t = E{Ψt |σ{xs : 0 6 s < ζ} exists and is the solution of the covariant\nequation along {xt : 0 6 t < ζ}:\nD\nΨ̄t = Λρ ◦ Ψ̄t\n∂t\nwith Ψ0 the identity map, Λρ : F → F given by λρ in Theorem 3.4.1 and where\nD\nrefers to the semi-connection determined by B.\n∂t\nProof. From above and Proposition 4.9.1 we have\nΨt [(y0 , e)] = [(x̃t ◦ gtx̃ , e)] = [(x̃t , ρ(gtx̃ )−1 e]\nand so //t−1 ψt [(y0 , e)] = [(y0 , ρ(gtx̃ )−1 e)]. Now from the right invariance of Gtσ , for\nfixed path σ and time t, we can apply Baxendale's integrability theorem for the\nright action\nG × L(V ; V ) → L(V ; V )\n(g, T ) 7→ ρ(gtσ )−1 ◦ T\n\n\fCHAPTER 4. PROJECTIBLE DIFFUSION PROCESSES\n\n82\n\nto see E|ρ(gtσ )−1 |L(V ;V ) < ∞ for each σ, t and we have E(σ)t ∈ L(V ; V ) given\nby\nE(σ)t e = Eρ(gtσ )−1 e.\nBy considering (1 + E|ρ(gtσ )−1 //t−1 ψt for σ = x* . We see the local conditional\nexpectation Ψ̄t exists in L(Fx0 ; Fxt ) and\nΨ̄t [(y0 , e)] = [(x̃t , E(x* )t e)].\nThe computation in Theorem 3.4.1 shows that\nd\nd −1\n//t Ψ̄t [(y0 , e)] = [(y0 , E(x* )t e)] = [(y0 , λρ (x̃t )E(x* )t e)]\ndt\ndt\ngiving\nD\nΨ̄t [(y0 , e)] = [(x̃t , λρ (x̃t )E(x* )t e)] = Λρ (x* )Ψ̄t [(y0 , e)]\ndt\nas required.\nRemark 4.10.2 Theorem 4.10.1 could also be used to identify the generator of the\noperator induced on sections of F ∗ , reproving Theorem 3.4.1, since if φ ∈ γF ∗\nthen Eφ ◦ Ψt χt<ζ = Eφ ◦ Ψ̄t χt<ζ if the expectations exist, by Corollary 3.3.5 of\n[27]. The extra information in Theorem 4.10.1 is the existence of the conditional\nexpectation. Baxendales' integrability theorem used for this applies in sufficiently\ngenerality to give corresponding results for infinite dimensional G, for example in\nthe situation arising in chapter 8 below.\n\n\fChapter 5\nFiltering with non-Markovian\nObservations\nSo far we have considered smooth maps p : N → Mwith a diffusion process u.\non N mapping to a diffusion process x. = p(u. ) on M. From the point of view\nof filtering we have considered u. as the signal and x. as the observation process.\nHowever the standard set up for filtering does not assume Markovianity of the\nobservation process. Classically we have a signal z. , a diffusion process on Rd or\na more general space, and an observation process x. on some Rn given by an SDE\nof the form\ndxt = a(t, xt , zt )dt + b(t, xt , zt )dBt\n(5.1)\nwhere B. is a Brownian motion independent of the signal. To fit this into our\ndiscussion we will need to assume that the noise coefficient of the observation\nSDE does not depend on the signal other than through the observations, as well\nas the usual cohesiveness assumptions. We can take N = Rd × Rn and M = Rn\nwith p the projection and ut = (zt , xt ). To reduce to our Markovian case we can\nuse the standard technique of applying the Girsanov-Maruyama theorem. Here\nwe first carry this out in the general context of diffusions with basic symbols, as\ndiscussed in Section 2.4 and then show how it fits in with the classical situation.\nFor simplicity we shall assume that the signal is a time homogeneous diffusion,\nand that the coefficients in the observation SDE are also independent of time. The\nstate spaces are taken to be smooth manifolds and the standard non-degeneracy\nassumptions on the observation process somewhat relaxed.\nFor other discussions about filtering with processes which have values in a\nmanifold see [18], [59], and [32].\n83\n\n\f84 CHAPTER 5. FILTERING WITH NON-MARKOVIAN OBSERVATIONS\n\n5.1 Signals with Projectible Symbol\nUsing the notation and terminology of Section 2.4 suppose that our diffusion operator B on N is conservative and descends cohesively over p : N → M so that\nfor a horizontal vector field bH on N the diffusion operator B̃ := B − bH lies over\nsome cohesive A. Choose such an A so that B̃, and so A, is also conservative:\nwe assume that this is possible. Also choose a locally bounded one-form b# on N\nwith 2σ B (b# ) = bH . This is possible since bH is horizontal, and we can, and will,\nchoose b# to vanish on vertical tangent vectors and satisfy\nH\nB # #\nH\n2\nb#\ny (b (y)) = 2σy (by , by ) = |b (y)|y\n\ny∈N\n\n(5.2)\n\nwhere |bH (y)|y refers to the Riemannian metric on the horizontal tangent space\nH\ninduced by 2σ A . This can be achieved by first choosing some smooth b̃ : N →\nA\nT ∗ M such that, in the notation of equation (2.10), σp(y)\n(b̃(y)) = b(y) for y ∈ N;\n#\nand then taking b to be the pull back of b̃ by p:\nb#\ny (v) = b̃(y)(Ty p(v))\nNow set\nZt = exp{−Mtα −\n\ny∈N\n\n1\nhM α it }\n2\n\nfor αt (u. ) = b#\nut where u ∈ C([0, T ]; N), our canonical probability space furnished with measures P := PB and P̃ := PB̃ and corresponding expectation\noperators E and Ẽ.\nHere and below we are using the notation of proposition 4.1.1 with\nM α etc\nR\nt\nreferring to taking martingale parts with respect to P while M̃ α and 0 αs d{ys }\nare with respect to P̃.\nFrom the Girsanov-Maruyana-Cameron-Martin theorem (see the Appendix, Section 9.1), we know that Z. is a martingale under P and the two measures are\nequivalent with\ndPB̃y0\n= ZT .\ndPBy0\nSuppose f : N → R is bounded and measurable. We wish to find πt (f ) : N →\nR, 0 6 t 6 T where\n\b\nπt (f )(y0) = Ey0 f (ut)|p(us ), 0 6 s 6 t .\n\n\f5.1. SIGNALS WITH PROJECTIBLE SYMBOL\n\n85\n\nFollowing the approach due to Zakai, consider the unnormalised filtering process\nπ̂t (f ) : N → R given by\n\b\nπ̂t (f )(u0 ) = Ẽu0 f (ut )Zt−1 | p(us ), 0 6 s 6 t .\nFor completeness we state and prove the Kallianpur-Striebel formula , a version\nof Bayes' formula:\nLemma 5.1.1\nπt (f )(u0 ) =\n\nπ̂t (f )(u0)\nπ̂t (1)(u0)\n\nPu0 − as.\n\nProof. Set x0 = p(u0 ). Let g : Cu0 ([0, T ]; N) → R be Ftx0 -measurable. Then\n1\nf (ut)g(u. )}\nZt\n1\n= Ẽ{Ẽ{ f (ut )|Ftu0 }g(u.)}\nZt\n1\n= E{Zt Ẽ{ f (ut )|Ftu0 }g(u.)}.\nZt\n\nEu0 {f (ut )g(u.)} = Ẽ{\n\n(5.3)\n\nThus\nπt (f )(u0 ) = E{Zt |Ftu0 }π̂t (f )(u0 ).\n\nTaking f constant shows that E{Zt |Ftuo }π̂t (1)(u0) = 1 and the result follows.\nWe can now go on to obtain the analogue of the Duncan-Mortensen-Zakai (DMZ)\nequation for the unnormalized filtering process, using the results of Section 4.8 on\nconditional laws:\nTheorem 5.1.2 For any C 2 function f : N → R, under P̃,\nRt\n\u0001\nRt\n\u0001\nπ̂t f (u0 ) = f (u0 ) + 0 π̂s Bf (u0 ) ds + 0 π̂s f b# (−)h− (u0)d{xs }\nRt\n\u0001\n+ 0 π̂s df− h− (u0 )d{xs };\n\u0001\nRt\nRt\nπ̂t f (u0 ) = f (u0 ) + 0 π̂s Bf (u0 ) ds + 0 hπ̂s (f b)(u0 ), d{xs }ixs\n\u0001\nRt\n+ 0 π̂s df− h− (u0 )d{xs }.\n\n(5.4)\n\n(5.5)\n\n\f86 CHAPTER 5. FILTERING WITH NON-MARKOVIAN OBSERVATIONS\nwhere xs = p(us ), 0 6 s 6 ∞ is the projection to M of the canonical process\nfrom u0 on N, and h the horizontal lift map for the induced semi-connection.\nUsing an alternative notation:\n\u0001\n\u0001\nZ t\nπ̂. df ◦hu. ,A\nπ f b# ◦hu. ,A\n+\n+ Mt\nπ̂t f = π̂0 f + Mt\nπ̂s (Bf )ds.\n(5.6)\n0\n\n#\n\n# ,B̃\n\nProof. Since we are working with P̃ we will write M b for M b\nsatisfies:\n\n, etc. Also Zt−1\n\n#\n\ndZt−1 = Zt−1 dMtb\nwhile\n\ndf (ut) = dMtdf + B̃(f )(ut)dt\ngiving\n\u0001\nd Zt−1 f (ut ) =\n\nZt−1 dMtdf + Zt−1 B̃(f )(ut )dt\n#\n\n+f (ut )Zt−1 dMtb + Zt−1 + dfut (bH (ut ))dt\n\n\u0001\n#\nsince dMtdf dMtb = σ B̃ dfut , b# = dfu. (bH (ut )). Thus\n\n\u0001\n#\nd Zt−1 f (ut ) = Zt−1 dMtdf + Zt−1 B(f )(ut )dt + f (ut )Zt−1 dMtb + Zt−1 .\n\nWe can now take conditional expectations using proposition 4.3.5 since B − LbH\nis over the cohesive operator A to complete the proof.\nLemma 5.1.3 There are the following formulae for angle brackets:\ndhπ̂(1)it = hπ̂t (b), π̂t (b)iE\nxt dt\n\n(5.7)\n\ndhπ̂(1), π̂(f )it = hπ̂t (f b), π̂t (b)iE\nxt dt + π̂t (df ◦ hu. ) ◦ π̂t (b(u. ))dt\nProof. From the previous theorem\nπ̂(f b# ◦h),A\n\nhπ̂(1), π̂(f )idt = dMt\n\nπ̂ (df ◦hu. ),A \u0001\n\n+ dMt .\n\nπ(b# ◦h),A\n\ndMt\n\n\u0001\n\u0001\n= 2σ A π̂t (f b# ◦ h), π̂t (b# ◦ h) dt + 2σ A π̂t (df ◦ hu. ), π̂t (b# ◦ h) dt\n= hπ̂t (f b), π̂t (b)ixt dt + π̂t (df ◦ hu. ) ◦ π̂t (b(u. ))dt\n\n(5.8)\n\n\f5.1. SIGNALS WITH PROJECTIBLE SYMBOL\n\n87\n\nsince for any one form φ on M we have:\n\u0001\n∗\u0001\nσ A φ, π̂t (b# ◦ h) = π̂t hφ|E , b# ◦ hiE\n.\n\u0001\n1\nπ̂t φ(b)\n=\n2\n1\n=\nφ(π̂t (b)).\n2\nThis gives the second formula, from which comes the first.\nWe can now give a version of Kushner's formula in our context:\nTheorem 5.1.4 In terms of the probability measure P̃\n\nπt f = π0 f +\n\nZ\n\n0\n\nt\n\nZ\n\nt\n\u0001\nπs B(f )ds +\nπs df ◦ hu. [d{xs } − πs (b(u. ))s ds] (5.9)\nZ t 0\n+ hπs (f b) − πs (f )πs (b), d{xs } − πs (b)ixs .\n0\n\nProof. From the definition and then Ito's formula:\n\u0013\nπ̂t (f )\ndπt (f ) = d\nπ̂t (1)\ndπ̂t (f ) π̂t (f )dπ̂t (1) dπ̂t (f )dπ̂t (1)\n=\n−\n−\nπ̂t (1)\n(π̂t (1))2\n(π̂t (1))2\nπ̂t (f )dπ̂t (1)dπ̂t (1)\n.\n+\n(π̂t (1))3\n\u0012\n\nNow substitute in the second formula of Theorem 5.1.2 and use the previous\nlemma.\nNote that π̂t (f ), b, and P̃, depend on the choice of A. We would like to have\na version of formula 5.9 which is independent of such choices. First note that if\nH\nB − bH\n1 is over A1 , and B − b2 is over A2 , then the difference of the two vector\nfields on N descends to a vector field on M: if g : M → R is smooth and\ng̃ = g ◦ p : N → R then\nH\nH  ̃\nH\n(bH\n2 − b1 )g̃ = (B − b1 )f − (B − b1 )g̃ = (A1 − A2 )g.\n\n\f88 CHAPTER 5. FILTERING WITH NON-MARKOVIAN OBSERVATIONS\nH\nTherefore if we set b0 (z) = Ty p(bH\n2 (y) − b1 (y)) for p(y) = z, z ∈ M then\nA1 = A2 + Lb0 , and by Remark 4.1.4\n\nd{xs }A2 = d{xs }A1 + b0 ds\n\n(5.10)\n\nFrom this we see immediately that the symbols d{xs } − πs (b)ds, and πs (f b) −\nπs (f )πs (b) in formula 5.9 are in fact independent of the choice we made of A. To\nrelate to now classical concepts we next discuss the first of these in more detail.\n\n5.2 Innovations and innovations processes\nKeeping the notation above, for α ∈ L2A , so αt ∈ Tx∗t M for 0 6 t < ∞, define a\nreal valued process Itα : 0 6 t < ∞, the α-innovations process by\nZ t\n\u0001\nα\nIt =\nαs d{xs }A − πs b(u. )ds\n(5.11)\n0\n\nA generalisation of a standard result about innovations processes is:\n\nProposition 5.2.1 The process I.α is independent of the choice of A. Under PB,u0\nit is an F∗x0 martingale.\nProof. The observations just made show it is independent of the choice of A. It\nis clearly also adapted to F∗x0 . To prove the martingale property note first that by\nProposition 4.3.4 and formula (5.10)\nZ t\nZ t\nA\nαs d{xs } =\np∗ (αs )d{us}B−LbH\n0\nZ0 t\nZ t\n∗\nB\n=\np (αs )d{us} −\np∗ (αs )bH (us )ds\nZ0 t\nZ0 t\n=\np∗ (αs )d{us}B −\nαs (b(us ))ds.\n0\n\n0\n\nFrom this we see that if 0 < r < t and Z ∈ σ{xs : 0 6 s 6 r} then\n(Z\n)\nt\n\u0001\nEB χZ\nαs d{xs }A − πs b(u. ) ds\nr\n\n= EB χZ\ngiving the required result.\n\n(Z\n\nt\n\nr\n\nαs (b(us ) − πs b(u. )) ds\n\n)\n\n=0\n\n\f5.2. INNOVATIONS AND INNOVATIONS PROCESSES\n\n89\n\nIf we fix a metric connection, Γ, on E, as described in Example 4.1.6 we can take\nthe canonical Brownian motion, B Γ,A say, on Ex0 determined by A and Γ. Then,\n′\nby equation (4.8), we can write d{xs }A − πs (b(u. ))ds = //s dB Γ A − πs (b(u. ))ds.\nIn terms of the the P Brownian motion, B Γ , on Ex0 , which is the martingale part\nunder P of the Γ- stochastic anti-development of x. we can define an Ex0 -valued\nprocess, ztΓ : 0 6 t < ∞, by\nztΓ\n\n=\n\nBtΓ\n\n+\n\nZ\n\nt\n\n(//s )−1 (b(us ) − πs (b(u. ))ds.\n\n0\n\n(5.12)\n\nA candidate for the innovations process of our signal -observation system is\nthe stochastic development , ν.Γ say, of z.Γ . under Γ. This can be defined by using\nthe canonical sde on the orthonormal frame bundle of E, namely\ndν̃t = X(ν̃t )(ν ̃0 )−1 ◦ dzt\nfor a fixed frame ν0 for Ex0 . Here\nX(μ)(e) = hΓμ (μ(e)).\nfor μ : Rp → Em a frame in at some point m ∈ M, and e ∈ Rp , for p the fibre\ndimension of E. The process ν.Γ is then the projection of ν̃. on M. For example\nsee [22]. It will satisfy the Stratonovich equation\ndνtΓ = //t ◦ dzt\n\n(5.13)\n\nwhere the parallel translation is now along the paths of ν.Γ . Let Θ : C0 (M) →\nC0 (M) be the map given by Θ( σ)t = ν Γ (σ)t , treating z.Γ as defined on C0 (M).\nLet D = D Γ : C0 (Tx0 M → Cx0 M be the stochastic development using Γ with\ninverse D −1 . We will continue to assume that there is no explosion so that these\nmaps are well defined. For example,\nz(x. ) = D −1 Θ(x. ).\nWe define a semi-martingale, on M to be a Γ-martingale if it is the stochastic\ndeveloment using Γ of a local martingale, see the Appendix, Section9.3.\nTheorem 5.2.2 For each metric connection Γ on E the innovations process ν Γ is\na Γ-martingale. If Γ is chosen so that the A-diffusion process is a Γ-martingale\n\n\f90 CHAPTER 5. FILTERING WITH NON-MARKOVIAN OBSERVATIONS\nunder PA then for α : [0, τ ) × Cx0 M → T ∗ M which is predictable and lives over\nx. , provided the integrals exist,\nZ\nZ .\n\u0001 .\nα\nΓ\nΓ\n(5.14)\nI ◦ Θ(x. ) = Γ\nα(ν (x. ). )sdν (x. )s −\nα(x. )s b(x. )s ds\n0\n\n0\n\nwhere b(−)s : Cx0 → T M is the conditional expectation,\nbs = E{b(us )|p(u. ) = x. },\nand has b(x. )s ∈ Txs almost surely for all s.\n\nProof. The fact that ν Γ is a Γ-martingale is immediate from the definition and\nProposition 5.2.1. To prove the claimed identity note that our extra assumption on\nΓ implies that //s−1 d{xs }A = d(D −1(x. ))s . Therefore\nZ .\nZ .\nα\n−1\nI (x. ) =\nαs (x. )//s dD (x. )s −\nαs (x. )b̄(x. )s ds\n(5.15)\n0\n\n0\n\nwhile by definition\nZ\nZ .\n\u0001 .\n\u0001\nΓ\nΓ\nΓ\nαs dνs (x. ) =\nαs (νsΓ (x. ))//sν. (x. ) d D −1 (ν Γ (x. )) s\n0\n\n(5.16)\n\n0\n\nwhere the superscript on the parallel translation symbol indicates that it is along\nthe paths ν.Γ (x. ). Our identity follows.\nRemark 5.2.3 (1) For Γ such that the A-process is a Γ martingale we can easily see that Θ has an adapted inverse. Indeed its inverse is defined almost\nsurely by\nA\nΘ−1 = D ◦ MartP ◦ D −1\nA\n\nwhere MartP denotes the operation of taking the martingale part under the\nprobability measure PA .\n\n(2) If we are given a connection Γ on E we could make our choice of A so that\nits diffusion process gives a Γ martingale. This specifies A uniquely and\nmight be more natural sometimes, for example in the classical case with\nM = Rn .\n(3) The results and earlier discussion still hold if Γ is not a metric connection.\nHowever then B.Γ,A cannot be expected to be a Brownian motion. The connection could even be on T M rather than on E in which case B.Γ,A will be a\nlocal martingale in Tx0 M. This will be a natural procedure when N = Rn ,\nusing the standard flat connection.\n\n\f5.3. CLASSICAL FILTERING\n\n91\n\n5.3 Classical Filtering\nFor an example of the situation treated above consider a signal process (zt , 0 6\nt 6 T ) on Rd satisfying an SDE\ndzt = V (zt , xt )dWt + β(zt , xt )dt\n\n(5.17)\n\nwith (xt , 0 6 t 6 T ), the observation process, taking values in Rn and satisfying:\ndxt = X (1) (xt )dBt + X (2) (xt )dWt + b(zt , xt )dt.\n\n(5.18)\n\nHere B. and W. are independent Brownian motions of dimension q and p respectively. We then take N = Rd ×Rn and M = Rn , with p : N → M the projection.\nWe set ut = (zt , xt ) so that\nBf (z, x) =\n\n1 2\nD f (V i (z, x), V i (z, x)) + D1 f (β(z, x))\n2 1,1\n2\n2\n+ 21 D2,2\nf (X (1),i (x), X (1),i (x)) + 21 D2,2\nf (X (2),j (x), X (2),j (x))\n2\ni\n+D2 f (z, x)(b(z, x)) + D1,2 f (z, x)(V (z, x), X (1),i (z, x))\n\n(5.19)\nusing the repeated summation convention where i goes from 1 to p and j from 1\nto q, with the V j referring to the components of V and similarly for X (1),i and\n2\nX (2),j . Also Dl,m\nrefers to the second partial Frechet derivative, mixed if l 6= m,\netc.\nThe filtering problem would be to find E{g(zt) | xs : 0 6 s 6 t} for suitable\ng : Rd → R. This would fit in with the discussion above by defining f : Rd ×\nRn → R by f (z, x) = g(z). Note that we have allowed feedback from the signal\nto the observation; usually only the special case where V and β are independent\nof x is considered. Also we have allowed the noise driving the signal to also affect\nthe observations (\"correlated noise\"). This can give a non-trivial connection, in\nwhich case the terms involving horizontal derivatives of f will not vanish even for\nf independent of x. This vanishing would occur otherwise (i.e. for uncorrelated\nnoise) so that in that case the formula in Theorem 5.1.2 reduces to the usual DMZ\nequation, for example as in [56] or [57].\nOur basic assumptions are smoothness of the coefficients, non-explosion (for\nsimplicity of exposition), and the cohesiveness of our observation process. By the\nlatter we mean that for all x ∈ Rn and z ∈ Rd the image of the map (e1 , e2 ) 7→\nX 1 (x)(e1 ) + X 2 (X)(e2 ) from Rq × Rp to Rn contains b(z, x) and has dimension\nindependent of x. Some bounds are needed on b to ensure the existence of its\nconditional expectations.\n\n\f92 CHAPTER 5. FILTERING WITH NON-MARKOVIAN OBSERVATIONS\nTo carry out the procedure for the signal and observation given above we must\nfirst identify the horizontal lift operator determined by B. For this for each x ∈ M\nlet Yx : Rn → Rp+q be the inverse of the restriction of the map (e1 , e2 ) 7→\nX 1 (x)(e1 )+X 2 (X)(e2 ), from Rq ×Rp to Rn , to the orthogonal complement of its\nkernel. Then from Lemma 2.2.1 we see that the horizontal lift hu : Rn → Rd ×Rn\nis given by\nhu (v) = (V (z, x) ◦ Yx (v), v) u = (z, x) ∈ Rd × Rn .\n\n(5.20)\n\nA natural choice of A is\n\u0001 1 2\n\u0001\n1 2\nA(f )(x) = D2,2\nf X (1),i (x), X (1),i (x) + D2,2\nf X (2),j (x), X (2),j (x) .\n2\n2\nHaving done that the 'b' of our general discussion is just the drift b : Rd × Rn →\nRn of our observation's stochastic differential equation. Moreover for suitable\nT ∗ M-valued processes α. we have the α-innovations process\nItα\n\n=\n\nZ\n\nt\n\nα(xs ) X\n\n(1)\n\n(xs )dBs + X\n\n(2)\n\n\u0001\n\n(xs )dWs +\n\n0\n\nZ\n\n0\n\nt\n\n\u0001\nα(xs ) b(zs , xs ) − b̄(x)s ds,\n\nwhere b̄(σ) = EB {b(zs , xs ) | xr = σr 0 6 r 6 s}.\nFrom Theorem 5.9 , Kushner's formula , given smooth g : Rd → R, one has\nπt g = g(z0 ) +\n\nRt\n0\n\n\u0001\n2\ng(−)(V i (−), V i (−)) + πs D1 g(−)(β(−)) ds\nπs 21 D1,1\n\u0001\nπs dg(−)V (−)◦Y\n ̄ −ḡ b̄ ,−i\nhgb\n+ It s s s x s .\n+It\n\nThis can be compared, for example, with the formula given in the remark on page\n85 of [57], following the proof of Proposition 2.2.5 there. Alternatively see [56].\nUsing the standard flat connection of Rn we get the innovations process given by\nνt = x0 +\n\nZ\n\n0\n\nt\n\nX\n\n(1)\n\n(xs )dBs + X\n\n(2)\n\n\u0001\n\n(xs )dWs +\n\nZ\n\n0\n\nt\n\n\u0001\nb(zs , xs ) − b̄(x)s ds.\n\n\f5.4. EXAMPLES\n\n93\n\n5.4 Examples\nConsider the stochastic partial differential equation on L2 ([0, 1]; Rp):\ndut(x) = ∆ut (x) +\n\nm\nX\n\nΦi (x, ut (x))dBti\n\ni=1\n\nwhere (Bti ) are independent Brownian motions. For p > 1 it can be considered\nas a system of equations. One natural question is to find the law of ut given that\nof us (x0 ), 0 6 s 6 t for some given point x0 , or to find the conditional law of ut\ngiven us (x0 ), 0 6 s 6 t. Here we indicate briefly how the approach we have been\nfollowing may sometimes be applied to this or similar problems. For simplicity\nwe take p = 1, so our \"observations\" process is one dimensional; M = R.\nLet yt = ut (x0 ). It satisfies:\ndyt = (∆ut )(x0 )dt +\n\nm\nX\n\nΦi (x0 , yt )dBti .\n\ni=1\n\nBecause of the drift term we cannot expect this to be Markovian so we will have\nto remove the term (∆ut )(x0 )dt by a Girsanov transformation.\nLet (ei ) be the standard orthonormal base of Rm . Define\nΦ : L2 ([0, 1]; R) × Rm → L2 ([0, 1]; R)\nand\nΦ̃ : R → L(Rm; R)\nby\nΦ(u)(e)(x) =\n\nm\nX\ni=1\n\nand\nΦ̃(z)(e) :=\n\nm\nX\ni=1\n\nΦi (x, u(x))he, ei i\n\nΦi (x0 , z)he, ei i,\n\nrespectively. Consider Tz R, identified with R and furnished with the metric induced by Φ̃(z):\nv1 v2\n.\nhv1 , v2 iz = Pm\n2\n(\nΦ̃\n(z))\ni\ni=1\n\n\f94 CHAPTER 5. FILTERING WITH NON-MARKOVIAN OBSERVATIONS\nTo have cohesivity and to be able to apply the Girsanov-Maruyama-CameronMartin theorem this must be well defined, i.e. the denominator must never vanish,\nand it must determine a non-explosive Brownian motion. If these conditions hold,\nwe still have to be sure that the Girsanov transformed S.P.D.E has solutions existing for all time and that we can apply the martingale method approach used in\nthe proof of 9.1.3. Alternatively we can try to apply one of the standard tests to\nshow that the local martingale which arises is a true martingale. First we apply\nLemma 2.2.1 to obtain the horizontal lift map. For this we need the dual map\nΦ̃∗ (z) : R → Rm is given by:\nm\nX\n1\nΦ (z)(1) = Pm\nΦj (x0 , z)ej .\n2\ni=1 (Φi (x0 , z)) j=1\n∗\n\nThen from equation (2.8) the horizontal lift hu : Tu(x0 ) R → L2 ([0, 1]; R) at a\nfunction u is given by\nhu (1)(x) = Φ(x, u(x)) ◦ Φ̃∗ (u(x0 )).\nIn particular a natural choice of drift bh to remove by the Girsanov-MaruyamaCameron-Martin theorem, namely bh (u) = hu (△u(x0 )), is given by\nPm\nj=1 Φj (x0 , u(x0 ))Φj (x0 , u(x))\nPn\n△u(x0 ).\n(5.21)\nbh (u)(x) =\n2\nk=1 (Φk (x0 , u(x0 )))\n\nMaking the change of probability to P̃ we see that our SPDE becomes\nPm\nm\nX\nj=1 Φj (x0 , ut (x0 ))Φj (x, ut (x))\nPn\ndut (x) = ∆ut (x)−\n△u\n(x\n)+\nΦi (x, ut (x))dB̃ti\nt 0\n2\n(Φ\n(x\n,\nu\n(x\n)))\nk 0\nt 0\nk=1\ni=1\nfor new, independent Brownian motions B̃ 1 , ...B̃ m and has the decomposition\nPm\nj=1 Φj (x0 , ut (x0 ))Φj (x, ut (x))\nPn\nΦi (x0 , ut (x0 ))B̃ti ]\ndut (x) = [\n2\nk=1 (Φk (x0 , ut (x0 )))\n!\nPm\nj=1 Φj (x0 , ut (x0 ))Φj (x, ut (x))\nPn\n△ut(x0 ) dt\n+[ △ut(x) −\n2\nk=1 (Φk (x0 , ut (x0 )))\n!\nPm\nm\nX\nj=1 Φj (x0 , ut (x0 ))Φj (x, ut (x))\nPn\n+\nΦi (x, u(x)t ) −\nΦi (x0 , ut (x0 )) dB̃ti ].\n2\n(Φ\n(x\n,\nu\n(x\n)))\nk\n0\nt\n0\nk=1\ni=1\n\n\f5.4. EXAMPLES\n\n95\n\nIn this decomposition the term in the first square brackets relates to the horizontal\nlift of the A-process , while that in the second is the vertical component. They are\nindependent (under P̃), given u at x0 .\nWe could continue by applying the Kallianpur -Striebel formula, Lemma 5.1.1\nor go directly to our version of Kushner's formula, Theorem 5.9. In that formula\nthe operator B will be the infinite dimensional diffusion operator on L2 ([0, 1]; R)\nwhich is the generator of the solution of our SPDE, so there are extra analytical\nproblems. However there are cases where the situation is fairly straightforward.\nFor example:\n(1) Φi (z, u) = φi (z), where the vector {φ1 (z), . . . , φm (z)} never vanishes for\nany z. In this case yt is basically Gaussian.\n(2) Φ(z, u) = u with one dimensional noise Bt , in which case the solution of\nthe SPDE is ut (x) =\n\n2\n\n2\n\nt\nx\n√ 1 e− 2t eBt − 2\n2πt\n\n.\n\n\f96 CHAPTER 5. FILTERING WITH NON-MARKOVIAN OBSERVATIONS\n\n\fChapter 6\nThe Commutation Property\nIn certain cases the filtering is in a sense trivial: the process decomposes into the\nobservable and an independent process. From the geometric point of view this\nmeans the commutation of the vertical operator B V and the horizontal operator\nAH . See Theorem 6.2.8 below.\nFor p a Riemannian submersion (defined in Chapter 7 below) with totally geodesic\nfibres and B the Laplacian, Berard-Bergery & Bourguignon [7] show that AH and\nBV commute. Their proof is based on the result of R.Hermann [37]\nTheorem 6.0.1 [R.Hermann] A Riemannian submersion p : N → M has totally\ngeodesic fibres iff the Laplace-Beltrami operator of N commutes with all Lie\nderivations by horizontal lifts of vector fields on M.\nFrom this, and the Hörmander form representation of AH , it follows immediately\nthat AH with BV will commute in their situation. In this section we consider some\nextensions of this and their consequences.\nFirst, for p : N → M with a diffusion operator B over a cohesive A, as usual,\nwe will say that a vector field on N is basic if it is the horizontal lift of a section of E. From our Hörmander form representation of AH we get the following\nextension of Berard-Bergery& Bourguignon's result:\nTheorem 6.0.2 For a diffusion operator B over a cohesive diffusion operator A\nthe following are equivalent:\n• [i] BV commutes with all Lie derivations by smooth basic vector fields of\nN;\n• [ii]the operators B, BV , and AH commute (on C 4 functions);\n97\n\n\fCHAPTER 6. THE COMMUTATION PROPERTY\n\n98\n\n• [iii] the operator BV commutes with the horizontal lifts of the vector fields\nwhich appear in one Hörmander form representation of A.\nProof. It is clear that [i] implies [iii], and [iii] implies\nTo show [ii] implies [i]\nPm [ii].\nj\nA\nobserve that every section of P\nE has the form σ ( 1 λ dfj ) since every one form\nj\nj\non M has can be written as m\n1 λ dfj for λ : M → R and fj : M → R and\nsome integer m. By definition\nconnection this shows that every basic vector\nPm jof the\nAH\nfield on N has the form 1 λ ṗσ (p∗ dfj ). It will therefore suffice to show that\nH\nif [ii] holds then BV commutes with Lie differentiation by λṗσ A (p∗ df ) for all\nsmooth λ, f : M → R.\nFor this assume [ii] holds and take a smooth g : N → R. By definition of the\nsymbol and Remark 1.4.5:\n\u0010\n\u0011\n\u0010 H\n\u0011\nV\nAH ∗\nV\nA\n∗\n2B dg λṗσ (p df ) = 2λṗB dg σ (p df )\n\u0001\n= λṗBV AH (f ṗg) − f ṗAH (g) − gAH (f ṗ)\n\u0001\n= λṗ AH (f ṗ)BV g − f ṗAH BV g − (Af )ṗBV g\nH\n\n= 2λṗd(BV g)σ A (p∗ df )\nH\n\n= 2d(BV g)σ A (λṗp∗ df )\nas required.\nFor the special case of an equivariant diffusion on a principal bundle as considered in Chapter 3 we can obtain a working criterion for commutativity: see also\nExample 6.2.12.\nCorollary 6.0.3 In the notation of Theorem 3.2.1 commutativity of BV and AH\nholds if and only if both α and β are constant along all horizontal curves. This\nholds if and only if AH (αi,j ) = 0 and AH (β k ) = 0 for all i, j, k.\nProof. First note that each vector field A∗k commutes with all basic vector fields.\nIndeed if V is basic it is equivariant and so\n(Rexp tAk )⋆ (V ) = V\n\nt > 0.\n\nDifferentiating in t at t = 0 gives the required commutativity. Thus the operators\nLA∗k are invariant under flows of basic vector fields and so for BV to commute with\nbasic vector fields the coefficients α and β must be constant along their flows. By\n\n\f6.1. COMMUTATIVITY OF DIFFUSION SEMIGROUPS\n\n99\n\nthe theorem this gives the first result since any horizontal curve can be considered\nas an integral curve of a (possible time dependent) basic vector field.\nClearly, from the Hörmander form of AH , if this holds both α and β are AH harmonic. The converse holds since from above AH commutes with all of the\nvertical vector fields L∗Ak .\nThe Corollary is applied to derivative flows in Example 6.2.12 of Section 6.2\nbelow.\nHermann proved that a Riemannian submersion with totally geodesic fibres\nhas the natural structure of a fibre bundle with group the isometry group of a\ntypical fibre.\nTheorem 6.0.4 (Hermann) If N is a complete Riemannian manifold and φ :\nN → M is a C ∞ Riemannian submersion then φ is a locally trivial fibre space.\nIf in addition the fibres of φ are totally geodesic submanifolds of N, φ is a fibre\nbundle with structure group the Lie group of isometries of the fibre.\nAn analogous result given the hypothesis of theorem 6.0.2 together with some\ncompleteness and hypoellipticity conditions is proved in Theorem 6.2.8 below.\nBefore that we consider when the associated semi-groups commute.\n\n6.1 Commutativity of Diffusion Semigroups\nIt is well known that in general the commutativity of two diffusion generators (on\nC 4 functions) does not imply that of their associated semi-groups. One reference\nis [61] page 273 where an example they ascribe to Nelson is given. Here is a\nminor modification of that construction:\nCut R2 along the positive x-axis. Take a copy A, say, of (0, ∞) ×(−∞, 0] and\nglue it along the cut to the upper part of the cut plane, identifying (0, ∞) × {0} in\nA with the positive x-axis. Similarly glue a copy ,B, of (0, ∞) × (0, ∞) along the\ncut to the lower part of the cut plane. This gives a version of the plane but with\ntwo copies of the upper and lower quadrants, and with the origin missing. On this\n∂\n∂\nwe have naturally defined vector fields X 1 given by ∂x\nand X 2 given by ∂y\n. These\ncertainly commute. However their associated semi-groups do not, as can be seen\nby starting at the point (−1, −1) moving along the X1 -trajectory for time 2 and\nthen along the X 2 trajectory for the same amount of time. We end up at the point\n(1, 1) of copy B. However if we had changed the order of the vector fields we\nwould be at (1, 1) of copy A. A more geometrically satisfying construction would\n\n\f100\n\nCHAPTER 6. THE COMMUTATION PROPERTY\n\nbe, as Nelson, to use the double covering of the punctured plane as state space\nwith similarly behaved vector fields. Here is an easy positive result:\nProposition 6.1.1 Let A1 and A2 be diffusion operators with associated semigroups {Pt1}t>0 and {Pt2 }t>0 acting as strongly continuous semi-groups on a Banach space E of functions which contains the C 2 functions with compact support.\nLet G1 and G2 be the corresponding generators , (closed extensions of the restrictions of A1 and A2 to the space of C 2 functions with compact support). Assume\nthere is a core C2 for G2 consisting of bounded C ∞ functions such that for f ∈ C2 :\n[i] For all t > 0 the function Pt1 f is C 4 .\n[ii] A2 1t (Pt1 f − f ) is uniformly bounded in t ∈ (0, 1) and in space, and it\nconverges pointwise to A2 A1 Pt1 f as t → 0+.\n[iii] A2 Pt1 f is uniformly bounded in t ∈ (0, 1) and in space.\nThen commutativity of Pt1 with Ps2 , 0 6 s, 0 6 t follows from commutativity of\nA1 with A2 on C 2 functions. Moreover if this holds the semi-group {PtA1+A2 }t>0\nassociated to A1 + A2 satisfies\nPtA1 +A2 = Pt1 Pt2 .\nProof. Let f : M → R be in C2 .\nWe show first that\nA2 Pt1 f = Pt1 A2 f\n\n(6.1)\n\nFor this set Vt = A2 Pt1 f . Then, by hypothesis [ii],\n∂\nVt = A2 A1 Pt1 f\n∂t\n= A1 Vt\n\n(6.2)\n\nby commutativity. By assumption [ii] we know Vs is bounded uniformly in s ∈\n[0, t] for any t > 0. However there is a unique C 2 and uniformly bounded solution,\nP 1 V0 , to any diffusion equations such as (6.2) with given smooth bounded initial\ncondition V0 (as is easily seen by the standard use of Itô's formula applied to Vt−s\nacting on a diffusion process with generator A1 ). This gives\nA2 Pt1 f = Pt1V0 = Pt1 A2 f\n\n\f6.2. CONSEQUENCES FOR THE HORIZONTAL FLOW\n\n101\n\nas required. Now suppose f ∈ Dom(G2 ). By assumption there is a sequence\n{fn }n of functions in C2 converging in G2 -graph norm to f . Then Pt1 A2 fn →\nPt1 G2 f and Pt1 fn → Pt1 f . Equation (6.1) therefore shows that Pt1 f ∈ Dom(G2 )\nand we have\nG2 Pt1 ⊃ Pt1 G2 .\n(6.3)\n\nNext, for f ∈ Dom(G2 ), and our fixed t > 0 set Ws = Pt1 Ps2 f . Since the\n2\nconvergence of 1ǫ {Ps+ǫ\nf − Ps2 f } to G2 Ps2 f is in E we see, using equation (6.3),\n∂\nWs = Pt1 G2 Ps2 f = G2 Pt1 Ps2 f = G2 Ws\n∂s\n\nsince Ps2 f ∈ Dom(G2 ). In particular Ws ∈ Dom(G2 ).\nAlthough now it is not clear that W is C 2 we see from this that\nfor 0 < u < s, giving\n\n∂\nP 2Ws−u\n∂u u\n\n=0\n\nPt1 Ps2f = P02 Ws = Ps2 W0 = Ps2 Pt1 f\nfor 0 6 s 6 t. For s > t it is now only necessary to use the semigroup property\nof P 2 , to commute with Pt1 portion by portion.\nFinally since Pt2 f ∈ Dom(G2 ) the above gives\n∂ 1 2\nP P f = A1 Pt1 Pt2f + Pt1 A2 Pt2 f\n∂t t t\n= (A1 + A2 )Pt1 Pt2 f\nand we can repeat the second arguement showing uniqueness of solutions of the\ndiffusion equation to obtain PtA1 +A2 f = Pt1 Pt2 f .\nRemark 6.1.2 Condition [i] does not always hold. A simple example is when the\n∂2\nstate space is R2 − {(0, 1)} and the operator is ∂x\n2 . The standard positive result\nn\nfor degenerate operators on R is due to Oleǐnik, [54].\n\n6.2 Consequences for the Horizontal Flow\nFor our standard set up of p : N → M with diffusion operator B over a cohesive\nA, let P V and P H denote the semi-groups generated by the vertical and horizontal\ncomponents of B, and let pVt (u, −), t 6 0, u ∈ N, be the transition probabilities of\nP V . If we set Nx = p−1 (x) for x ∈ M then pVt (u, −) will be a probability measure\n\n\fCHAPTER 6. THE COMMUTATION PROPERTY\n\n102\n\n+\n+\non Np(u)\n, the union of Np(u) with ∆. For and For PA\nx0 -almost all σ ∈ Cx0 M for\neach x0 ∈ M there are measurable maps\n\n//σt : Nx+0 → Nσ+t\nsuch that for each u ∈ Nx0 the process (t, σ) 7→ //σt (u) is an AH -diffusion and\nis over σ. These can be obtained, for example, by taking a stochastic differential\nequation, as equation (4.21),\ndxt = X(xt ) ◦ dBt + A(xt )dt\nfor our A-diffusion. Let Yx : Ex → Rm be the adjoint (and right inverse) of X(x),\neach x ∈ M. Then consider the SDE on N\ndyt = X̃(yt )Y (σt ) ◦ dσt\nand let (t, σ) 7→ //σt be the restriction of its flow to Nx0 , augmented by mapping\nthe coffin state, ∆, to itself. This SDE is canonical since it can be rewritten as\ndyt = hyt ◦ dσt\nfor h the horizontal lift map of Proposition 2.1.2.\nWe will often need to assume that the lifetime of this diffusion is the same as\nthat of its projection on M:\nDefinition 6.2.1 The semi-connection induced by B is said to be stochastically\ncomplete if\nCup0 M + := {σ : [0, ∞) → M + : lim p(ut ) = ∆ when ζ(u) < ∞}\nt→ζ\n\nH\n\nhas full PA\nu0 measure for each u0 ∈ N or equivalently if the lifetimes satisfy\nζ(u) = ζ(p(u))\nH\n\nfor PA\nu0 -almost all paths u.\nThe semi-connection is said to be strongly stochastically complete if also we\ncan choose a version of //σt : Nσ(0) → Nσ(t) which is a smooth diffeomorphism\nwhenever σ(0) is a regular value of p and t < ζ(σ).\nNote that strong stochastic completeness of the connection will hold whenever\nthe fibres of p are compact by the basic properties of the domains of local flows of\nSDE, [43], [21]. This also holds if the stochastic horizontal differential equation\nis strongly p-complete in the sense of Li [47] for p = dim(N) − dim(M).\n\n\f6.2. CONSEQUENCES FOR THE HORIZONTAL FLOW\n\n103\n\nProposition 6.2.2 Suppose the semi-groups P V and P H commute and stochastic\ncompleteness of the connection holds. Then the horizontal flow preserves the\nvertical transition probabilities in the sense that for all positive s and 0 < t < ζ(σ),\n(//σt )∗ pVs (u0 , −) = pVs (//σt (u0 , −)\n\n(6.4)\n\nfor all u0 ∈ Nσ for PA -almost all σ. Equivalently for any bounded measurable\nh : N → R we have PA -almost surely;\nPsV (h ◦ //σt ) (u0 ) = PsV h(//σt (u0 ))\n\n(6.5)\n\nProof. It suffices to show that given any finite sequence 0 6 t1 6 t2 6 * * * 6\ntk < t, bounded measurable fj : M → R, j = 1, ..., k and bounded measurable\nh : N → R, if u0 ∈ Nx0 then\nEx0 {f1 (σt1 )...fk (σtk )χt<ζ(σ) PsV (h ◦ //σt )(u0 )}\n= Ex0 {f1 (σt1 )...fk (σtk )χt<ζ(σ) PsV (h)(//σt (u0 ))}.\n\n(6.6)\n\nwhere χZ denotes the indicator function of a set Z. To see this set f ̃j = fj ◦ p :\nN → R. Then the left hand side of (6.6) is\nEx0 {f ̃1 (//σt1 (u0 ))...f ̃k (//tk (u0 ))χt<ζ(σ) PsV (h ◦ φt )(u0)}\n\u0010\n\u0011\n= Ex0 {PsV f ̃1 (//σt1 (u0 ))...f ̃k (//σtk (u0 ))χt<ζ(σ) h(//σt (u0 )) }\n\u0011\n\u0010\nH\nh\n(u0 )\n= PsV PtH1 f ̃1 ...PtHk −tk−1 f ̃k Pt−t\nk\n\u0011\n\u0010\nH\nP V h (u0 )\n= PtH1 f ̃1 ...PtHk −tk−1 f ̃k Pt−t\nk s\n\nwhich reduces to the right hand side of (6.6).\n\nRemark 6.2.3 Assuming strong stochastic completeness of our semi-connection\nlet {zt : 0 6 t < ζ(p(u.)} be a semi-martingale in N with p(zt ) = xt := p(ut ) :\n0 6 t < ζ(p(u.)). If x0 is a regular value of p we have the Stratonovich equation:\nd//t−1 zt = T //t−1 ◦ T //t−1 (hzt ◦ dxt )\n\n(6.7)\n\nwhere //t refers to //tx. . To see this, for example set bt = //t−1 zt and observe that\ndzt = d(//t bt ) = T //t ◦ dbt + h/t bt ◦ dxt .\n\n\fCHAPTER 6. THE COMMUTATION PROPERTY\n\n104\n\nNow assume that our induced semi-connection is strongly stochastically complete. For a regular value x0 of p and u0 ∈ Nx0 define a process αu0 : [0, ∞) ×\nCu0 N + → Nx+0 by\np(u) −1\n\nαtu0 (u) = αt (u) = (//t\n\n) ut\n\n(6.8)\n\nif u ∈ Cuo N with t < ζ(u) and define αtu0 (u) = △ if t > ζ(u). Note that αt may\nnot go out to infinity in Nx0 as t increases to its extinction time.\nAlso define\n//s∗ (BV )(f ) = BV (f ◦ //s ) ◦ //t−1\nto obtain a random time dependent diffusion operator //s∗ (BV ) on each fibre over\na regular value of p.\nLemma 6.2.4 In the notation of equation (4.23) we have the Itô equation for\nαt := αtu0 :\n∇V\n\ndαt = T //t−1 V (//t αt )dWt + T //t−1 V 0 (//t αt )dt.\n\nIn particular for f : N → R in C 2\nMtdf,α\n\n:= f (αt ) −\n\nZ\n\n0\n\n(6.9)\n\nt\n\n//s∗ (BV )(f )(αs )ds\n\n(6.10)\n\nis a local martingale.\nProof. Formula ( 6.9) is immediate from equations (4.23) and (6.7). That M.df,α\nis a local martingale follows immediately using the properties of pull-backs under diffeomorphisms of Lie derivatives when V is C 1 , and by going to local coordinates otherwise.\nLemma 6.2.5 At all points above regular values of p we have:\nd\nE{//s∗ (BV )}|s=0 = [AH , BV ]\nds\nProof. This is an exercise in the use of Ito's formula. For example write A in the\nHörmander form\nm\n1X\nLX j LX j + L0X\nA=\n2 j=1\n\n\f6.2. CONSEQUENCES FOR THE HORIZONTAL FLOW\n\n105\n\nso that //s is the flow of the SDE\ndzs =\n\nm\nX\nj=1\n\nfj (zs )dB j + X\nf0 (zs )\nX\n\nusing the horizontal lifts of the vector fields X j . From the Ito formula in lemma\n9B Chapter VII of [21] we have\nm\n\nd\n1 X d2 j ∗ V\nd 0 ∗ V\nE{//s∗(BV )}|s=0 =\n(/\n/\n)\n(B\n)}|\n+\n(// ) B |s=0\ns=0\ns\nds\n2 j=1 ds2\nds s\nfj . Since\nwhere //i is the flow of the vector field X\n\nd j\n(// ) ∗ (BV ) = [LXfj , (//sj )∗ BV ]\nds s\n\nwe have the result.\nDefinition 6.2.6 For a regular value x0 of p. We say BV is stochastically holonomy invariant at x0 if on Nx0 we have //t∗ (BV ) = BV for all 0 6 t < ζ x. with\nprobability one. If this holds for all all regular values x0 then we say BV is\nstochastically holonomy invariant. Similarly we say B V is holonomy invariant\nat x0 if the corresponding result holds for parallel translation along any piecewise\nC 1 curve starting at x0 in M, and is holonomy invariant if this holds for all regular\nvalues x0 .\nRemark 6.2.7\n1. If the A-diffusion on M is represented by a stochastic differential equation we can lift that equation to N and obtain a local flow\nηtH : 0 6 t < ζ H (−) where ζ H (y) : y ∈ N gives its explosion times;\nso that with probability one η t is defined and smooth on the open set {y ∈\nN : t 6 ζ H (y), see [43] or [21]. We can say that BV is invariant under the\nhorizontal flow if for all C 2 functions f : N → R we have\nBV (f ) ◦ ηt = BV (f ◦ ηt )\n\non {y ∈ N : t 6 ζ H (y), almost surely, for all t > 0. This does not require\nstrong stochastic completeness of the semi-connection, nor do we have to\nrestrict attention to fibres over regular values. On the other hand if it holds,\nand given such strong stochastic completeness, if x0 is a regular value it\nfollows that Nx0 lies in {y ∈ N : t 6 ζ H (y) for all t < ζ M (x0 ) and that we\nhave stochastic holonomy invariance at x0 .\n\n\f106\n\nCHAPTER 6. THE COMMUTATION PROPERTY\n\n2. Assume completeness of the semi-connection. If A satisfies the standard\nHörmander condition, or more generally if the space D 0 (x0 ), as in Section\n2.6 is all of M, then holonomy invariance at x0 implies holonomy invariance. This follows since concatenation of paths gives composition of the\ncorresponding parallel translations and the conditions imply that any two\npoints can be joined by a smooth path with derivatives in E. Moreover\nby Theorem 2.6.1 every point is a regular value and so given also strong\nstochastic completeness of the connection from the theorem below we see\nthat holonomy invariance of B V at one point implies it is invariant under the\nhorizontal flow induced by any SDE on M which gives one point motions\nwith generator A. The same holds for stochastic holonomy invariance: see\nTheorem 6.2.8 below.\nTheorem 6.2.8 Suppose the induced semi-connection is complete and strongly\nstochastically complete, and x0 is a regular value of p. Then the following are\nequivalent:\n[ix0 ] For all u0 ∈ Nx0 and for any F α -stopping time τ with τ (α(u)) < ζ(p(u)),\nthe process {αt : 0 6 t < τ } is independent of F x0 ;\n[iix0 ] BV is stochastically holonomy invariant at x0 ;\n[iiix0 ] BV is holonomy invariant at x0 ;\n[ivx0 ] BV and AH commute at all points of D 0 (x0 );\n[vx0 ] P.V and P.H commute at all points of D 0 (x0 ).\nIf the above hold at some regular value x0 they hold for all elements in D 0 (x0 ).\nMoreover α.u0 is a Markov process on Nx0 with generator BV .\nProof. We will show that [ix0 ] is equivalent to [iix0 ] which implies [ivx0 ]. Then\n[iv] implies [iiiy] for all y ∈ D 0 (x0 ) which implies [v]. Finally we show [v]\nimplies [iiy] for all y ∈ D 0 (x0 ).\nAssume [ix0 ] holds. Let f : Nx0 → R be smooth with compact support.\nThen the local martingale M df,α given by formula (6.10) is a martingale and from\nequation (6.9) we see that\nE{M df,α |F x0 } = f (u0 ).\n\n\f6.2. CONSEQUENCES FOR THE HORIZONTAL FLOW\n\n107\n\nTherefore for Px0 -almost all σ in Cx0 M\nE{f (αt )} = E{f (αt)|p(u. ) = σ} = f (u0 ) +\n\nZ\n\n0\n\nt\n\nE{(//sσ )∗ (BV )(f )(αs )}ds.\n\n(6.11)\nAlso, in the notation of equation (6.9), with the obvious notation for the filtrations\ngenerated by our processes, we have Ftα. ⊂ FtW. ∧ Ftx0 and FtW. ⊂ Ftα. ∧ Ftx0\nso our assumption implies that FtW. = Ftα. , for all positive t, after stopping W.\nat the explosion time of α. . From this, and equation (6.9) we see that if we set\nM̄tdf,α = E{Mtdf,α |F αt } we obtain a martingale with respect to F∗α and\nZ t\ndf,α\nf (αt ) = M̄t +\n//s∗ BV (f )(αs )ds\n(6.12)\n0\n\nwhere //s∗ BV = E{//s∗BV }. Thus by the usual martingale characterisation of\nMarkov processes we see that α. is Markov with (possibly time dependent) generator //s∗ BV at time s. However equation (6.11) then implies, for example by\n[62] Proposition(2.2), Chapter VII, that the generator is given by (//sσ )∗ (BV ) for\narbitrary σ in a set of full measure in Cx0 M. Thus [ix0 ] implies the stochastic\nholonomy invariance [iix0 ].\nConversely if [iix0 ] holds, equation (6.10) gives\nZ t\ndf,α\nf (αt ) = Mt +\nBV (f )(αs )ds.\n0\n\nThen M.df,α is an F∗α. -martingale and again we see that α. is Markov, with generator BV . It is therefore independent of x. giving [ix0 ]. Moreover, in an obvious\nnotation, if 0 6 s 6 t, by the flow property of parallel translations, on Nx0 ,\nBV = //t∗ (BV ) = //s∗ (//ts )∗ (BV ),\nand so, almost surely, at all points of Nxs we have\n(//ts )∗ (BV ) = (//s∗ )−1 BV = BV .\n∗\nSince (//ts )∗ (BV ) has the same law as //t−s\n(BV )and is independent of Fsx0 this\nA\nshows that [iiy] holds for ps (x0 , −)-almost all y ∈ M for all s > 0.\nOn the other hand [iiy] implies that BV and A commute on Ny by Lemma\n6.2.5. Thus by continuity of [BV , AH ], and the support theorem we see that [iix0 ]\nimplies [iv].\n\n\f108\n\nCHAPTER 6. THE COMMUTATION PROPERTY\n\nFurthermore as in Theorem 6.0.2 we see that [iv] implies that BV commutes\nwith basic vector fields at all points over D 0 (x0 ). From this the holonomy invariance [iiiy] holds for all y ∈ D 0 (x0 ).\nNow assume [iiix0 ] and so by Remark 6.2.7(2.) we have [iiiy] for all y ∈\n0\nD (x0 ). Since //tσ (u0 ) stays above D 0 (x0 ) for any suitable piecewise smooth σ\nwe find the solution to the martingale problem of BV for any point u0 of Nx0 is\nholonomy invariant at u0 , i.e. along piecewise smooth curves σ in M starting at\nx0 ,\nPtV (f ◦ //sσ −)(u0 ) = PtV (f )(//sσ u0 ).\nBy Wong-Zakai approximations we see that stochastic holonomy invariance\nV\nof P B holds over x0 and hence on taking expectations we get [vx0 ]. As observed\nwe also get [vy] for all y ∈ D 0 (x0 ) and hence by continuity for all y ∈ D 0 (x0 ).\nThus [iiix0 ] implies [v].\nFinally assuming [v] we can apply Proposition 6.2.2, observing that the proof\nstill holds since it only involves points in D 0 (x0 ). Differentiating equation (6.5)\nin s at s = 0 gives the stochastic holonomy invariance [iiy] for all y ∈ D 0 (x0 )\nRemark 6.2.9 From the proof and Theorem 6.0.2 we see that the stochastic completeness of the connection is not needed to ensure that [ivx0 ] and [iiix0 ] are equivalent.\nWe can now go further than our Theorem 2.6.1 in extending Hermann's result,\nTheorem6.0.1. For this we will need some extra hypoellipticity conditions to deal\nwith the case of non-compact fibres. Take a Hörmander form A corresponding to\na smooth factorisation\nσxA = X(x)X(x)∗\nwith X(x) ∈ L(Rm : Tx M for x ∈ M. Let H denote the usual Cameron -Martin\nm\nspace of finite energy paths H = L2,1\n0 ([0, 1]; R ). For h ∈ H and x ∈ M let\nφht (x), 0 6 t 6 1 be the solution at time t ∈ [0, 1] to the ordinary differential\nequation\nż(t) = X(z(t))(ḣ)\n(6.13)\nwith φh0 (x) = x. In particular we assume such a solution exists up to time t =\n1. For each x ∈ M this gives a smooth mapping φ−\n1 (x) : H → M, namely\nh 7→ φh1 (x). Let C h,x : Ex → Ex be the deterministic Malliavin covariance\noperator, see [9], given by\n−\n∗\nC h,x = Th φ−\n1 (x)(Th φ1 (x)) .\n\n\f6.2. CONSEQUENCES FOR THE HORIZONTAL FLOW\n\n109\n\nh,x\nThen φ−\nis non1 (x) is a submersion in a neighbourhood of h if and only if C\ndegenerate. It is shown in [9] that this condition is independent of the choice of\nHörmander form for A, and follows from the standard Hörmander condition that\nX 1 , . . . , X m and their iterated Lie brackets span Tx M when evaluated at the point\nx. A more intrinsic formulation of it can me made in terms of the manifold of\nE-horizontal paths of finite energy, as described in [52].\n\nTheorem 6.2.10 Consider a smooth map p : N → M with diffusion operator B\non N over a cohesive diffusion operator A. Suppose that the connection induced\nby B is complete. Also assume that D 0 (x) is dense in M for all x ∈ M and that\neither the fibres of p are compact or that the solutions to equation (6.13) exist up\nto time 1 and there exists h0 ∈ H and x0 ∈ M such that C h0 ,x0 is non-degenerate.\nThen p : N → M is a locally trivial bundle.\nIf also B and AH commute we can take Nx0 , the fibre over x0 , to be the model\nfibre and choose the local trivialisations\nτ : U × Nx0 → p−1 (U)\nto satisfy\nτ (x, −)∗ (BV |Nx ) = BV |Nx0 .\nProof. The local triviality given compactness of the fibres is a special case of\nCorollary 2.6.3 so we will only consider the other case.\nFor this set y = φh1 0 (x0 ). Our assumption on the covariance operator together\nwith the smoothness of h 7→ φh1 (x0 ) implies by the inverse function theorem that\nthere is a neighbourhood Uy of y in M and a smooth immersion s : Uy → H with\ns(x)\ns(y) = h0 and φ1 (x0 ) = x for x ∈ Uy .\nWe know from Theorem 2.6.1 that p is a submersion so all its fibres are submanifolds of N. Define τUy : Uy ×Nx0 → p−1 (Uy ) by using the parallel translation\ns(x)\nalong the curves φt : 0 6 t ≤ 1 that is:\nφs(x)\n\nτUy (x, v) = //1 .\n\n(v)\n\n(x, v) ∈ (Uy × Nx0 ).\n\n(6.14)\n\nFor a general point x of M we can find an x′ ∈ Uy ∩ D 0 (x) and argue as in\nthe proof of Theorem 2.6.1 to obtain open neighbourhoods Ux of x in M and Ux′ ′\nof x′ in Ux0 and a fibrewise diffeomorphism of p−1 (Ux′ ′ ) with p−1 (Ux ) obtained\nfrom parallel translations. This can be composed with a restriction of τUx0 to give\na trivialisation near x. This proves local triviality. The rest follows directly from\nRemark 6.2.9 since our trivialisations came from parallel translations.\n\n\fCHAPTER 6. THE COMMUTATION PROPERTY\n\n110\nRemark 6.2.11 Set\n\nG(BxV0 ) = {α ∈ Diff(Nx0 ) : α∗ (BV |Nx0 ) = BV |Nx0 }.\n\n(6.15)\n\nThen assuming the commutativity in the theorem we can consider G(BxV0 ) as a\nstructure group for our bundle though unless the fibres of p are compact it is not\nclear if we have a smooth fibre bundle with this as group in the usual sense, since\nthis requires smoothness into G(BxV0 ) of the transition maps between overlapping\ntrivialisations. See the next section and Michor [51] section 13.\nNote that elements of G(BxV0 ) preserve the symbol of BV and so if that symbol\nV\nhas constant rank preserve the inner product induced on the image of σ B . In\nparticular if BV is elliptic they are isometries of the Riemannian structure induced\non the fibre Nx0 . This is the situation arising from Riemannian submersions as\nin Hermann's Theorem 6.0.4 and described in detail in Chapter 7 below. The\nspace of isometries of a Riemannian manifold with compact- open topology is\nwell known to form a Lie group, for example see [40]. However there appears\nto be no detailed proof that the same holds in degenerate cases even when the\nHörmander condition holds at each point. When Hörmander's condition holds the\nCaratheodory metric on the manifold determines the standard manifold topology,\ne.g. see [52] Theorem 2.3, which is locally compact, and the group of isometries\nof a connected locally compact metric space is locally compact in the compactopen topology, see [40], Chapter 1, Theorem 4.7. Thus in this case G(BxV0 ) will\nbe locally compact.\nIn general preserving the possibly degenerate Riemannian structure determined\nby its symbol will not be enough to characterise G(BxV0 ). Even in the elliptic case\nthere may be a \"drift vector\" which needs to be preserved as well and this may lead\nto G(BxV0 ) being very small. For example if Nx0 is R2 and BV = 21 △ − |x|2 ∂x∂ 1\nthe group is trivial.\nExample 6.2.12\n1. As an example consider the situation described in Section 3.3 of the derivative flow of a stochastic differential equation (3.8) on\nM acting on the frame bundle GLM to produce a diffusion operator B on\nGLM. Assume that M is Riemannian and complete, and that the one point\nmotions are Brownian motions, so that A = 12 △ . Assume also that the\nconnection induced is the Levi-Civita connection. Then if B and AH commute, by Corollary co:equ-comm , we see that the co-efficients α and β of\nBV described in Theorem 3.3.1 must be constant along horizontal curves.\nHowever as pointed out in the proof of Corollary 3.4.8, the restriction of\n\n\f6.2. CONSEQUENCES FOR THE HORIZONTAL FLOW\n\n111\n\nα(u) for u ∈ GLM to anti-symmetric tensors is essentially (one half of)\nthe curvature operator. It follows that the curvature is parallel , ∇R = 0. In\nturn this implies, [40] page 303, that M is a local symmetric space and so\nif simply connected, a symmetric space. In Section 7.2 we show how such\nstochastic differential equations arise on any symmetric space. Also from\nExample 3.3 we see that the standard gradient SDE for Brownian motion\non spheres also give derivative flows with this property.\n2. For the apparently weaker property of commutativity for the derivative flow\nT ξt of our SDE (3.8) acting directly on the tangent bundle T M recall first\nthat if the generator A is cohesive (and even if it just happens that the symbol of A has constant rank, see [27]) then for vt = T ξt (v0 ) some v0 ∈ Tx0 M\nwe have the covariant SDE\n ̆ vt XdBt − 1 Ric\n ̆ # (vt )dt + ∇\n ̆ vt Adt.\nD̂vt = ∇\n2\n\n(6.16)\n\nFrom this we see that if A is cohesive the process α. defined by αt =\n−1\n/ˆ/t T ξt (v0 ) satisfies the SDE\n\u0012\n\u0013\n−1\n1  ̆ # ˆ\nˆ\n ̆\n ̆\ndαt = //t\n∇/ˆt αt XdBt − Ric (//t αt )dt + ∇/ˆt αt Adt .\n2\nSuppose also that A = 0. We see that α. is independent of ξ. (x0 ) if and only\n ̆ − X and Ric\n ̆ # are holonomy invariant. If M is Riemannian and the\nif both ∇\nsolutions of the SDE are Brownian motions and the induced connection is\nthe Levi-Civita connection we can deduce, as above, using Theorem 6.2.8,\nthat commutativity of the the vertical and horizontal diffusions operators on\nT M holds only if M is locally symmetric .\n\n\f112\n\nCHAPTER 6. THE COMMUTATION PROPERTY\n\n\fChapter 7\nExample: Riemannian Submersions\n& Symmetric Spaces\n7.1 Riemannian Submersions\nRecall that when N and M are Riemannian manifolds a smooth surjection p :\nN → M is a Riemannian submersion if for each u in N the map Tu p is an\northogonal projection onto Tp(u) M, i.e. restricted to the orthogonal complement\nof its kernel it is an isometry. Note that if p : N → M is a submersion and\nM is Riemannian we can choose a Riemannian structure for N which makes p\na Riemannian submersion. If a diffusion operator B on N which has projectible\nsymbol for p : N → M is also elliptic its symbol induces Riemannian metrics\non N and M for which p becomes a Riemannian submersion. A well studied\nsituation is when p is a Riemannian submersion and B is the Laplacian, or 12 △N ,\non N. The basic geometry of Riemannian submersions was set out by O'Neill in\n[55]; he ascribes the term 'submersion' to Alfred Gray. In this section we shall\nmainly be relating the work of Bŕard-Bergery & Bourguignon [7], Hermann, [37],\nElworthy& Kendall, [24], and Liao, [48], to the discussion above. The book [33]\nshows the breadth of geometric structures which can be considered in association\nwith Riemannian submersions.\nA simple example of a Riemannian submersion is the map p : Rn − {0} → ∞\ngiven by p(x) = |x|. Then, for n > 1, Brownian motion on Rn −{0} is mapped to\nd2\nn−1 d\nthe Bessel process on (0, ∞) with generator A = 12 dx\n2 + 2x dx . Thus in this case\n1\n1\n△ is projectible but its projection is not 2 △M . The well known criterion for\n2 N\nthe latter to hold is that p has minimal fibres as we show below. See also [21],and\n113\n\n\f114CHAPTER 7. EXAMPLE: RIEMANNIAN SUBMERSIONS & SYMMETRIC SPACES\n[48].\nTo examine this in more detail we follow Liao,[48].Suppose that p is a Riemannian submersion. The horizontal subbundle on N is just the orthogonal complement of the vertical bundle. Working locally take an orthonormal family of\nvector fields X 1 , . . . , X n in a neighbourhood of of a given point x0 of M. Let\nX̃ 1 , . . . , X̃ n be their horizontal lifts to a neighbourhood of some u0 above x0 , and\nlet V 1 , . . . , V p be a locally defined orthonormal family of vertical vector fields\naround u0 . Then near u0 , using the summation convention over j = 1, . . . , n,\nα = 1, . . . , p, we have\n△N = X̃ j X̃ j + V α V α − ∇N\nX̃ j − ∇V α V α\nX̃ j\n\n(7.1)\n\nj\n△ M = X j X j − ∇N\nXj X .\n\n(7.2)\n\nwhile\nHere ∇M , ∇N refer to the Levi-Civita connections on M and N, and we are\nidentifying the vector fields with the Lie differentiation in their directions.\nNow X̃ j X̃ j lies over X j X j while V α V α is vertical. Also the horizontal component of the sum ∇V α V α at a point u ∈ Nis the trace of the second fundamental\nform of the fibre Np(u) of p through u, denoted by TV α V α in O'Neill's notation,\nwhile 12 △N lies over ∇X j X j by Lemma 1 of [55].\nThus we see that 12 △N is projectible if and only if the trace of the second\nfundamental form, trace T , of each fibre p−1 (x) is constant along the fibre in the\nsense of being the horizontal lift of a fixed tangent vector, 2A(x) ∈ Tx M. If so\n1\n△ lies over 21 △M − A. In particular A = 0, or equivalently p maps Brownian\n2 N\nmotion to Brownian motion, if and only if p has minimal fibres.\nIn general to relate to the discussion in Section 2.4 we can set bH (u) =\n− 21 trace T (u), with b(u) = Tu pbH (u) in Tp(U ) M. Let △V be the vertical operator on N which restricts to the Laplacian on each fibre, and let △H be the\nhorizontal lift of 21 △M . Our decomposition in Theorem 2.4.6 becomes\n1\n△N =\n2\n\n\u0012\n\n1 H 1\n△ − trace T\n2\n2\n\n\u0013\n\n1\n+ △V\n2\n\n(7.3)\n\nsince the vertical part of ∇V α V α is just ∇VV α V α where ∇V refers to the connection\non the vertical bundle which restricts to the Levi-Civita of the fibres, and also the\nvertical part of X̃ j X̃ j vanishes because by Lemma 2 of [55] the vertical part of\nX̃ j X̃ k is the vertical part of 12 [X̃ j , X̃ k ].\n\n\f7.2. RIEMANNIAN SYMMETRIC SPACES\n\n115\n\n7.2 Riemannian Symmetric Spaces\nLet K be a Lie group with bi-invariant metric and let M be a Riemannian manifold\nwith a symmetric space structure given by a triple (K, G, σ). This means that there\nis a smooth left action K × M → M, (k, x) 7→ Lk (x) of K on M by isometries\nsuch that if we fix a point x0 of M and define p : K → M by p(k) = Lk (x0 ) then\np is a Riemannian submersion and a principal bundle with group the subgroup\nKx0 of K which fixes x0 . Write G for Kx0 . Thus M is diffeomorphic to K/G.\nMoreover if g denotes the Lie algebra of G, and k that of K, (identified with the\ntangent spaces at the identity to G and K respectively), there is an orthogonal and\nadG - invariant decomposition\nk=g+m\nwhere m is a linear subspace of Tid K. Further σ is an involution on K and g\nand m are, respectively, the +1 and the −1 eigenspaces of the involution on Tid K\ninduced by σ. See Note 7, page 301, of Kobayashi & Nomizu Volume I, [40], for\ndefinitions and basic properties, and Volume II, [41], for a detailed treatment.\nWe shall also let σ denote the involutions induced by σ on k and on M, and by\ndifferentiation on T M and OM. On M it is an isometry, so it does act on OM.\nNote that on Tx0 M it acts as v 7→ −v.\nSince G fixes x0 the derivative of the left action Lk at x0 gives a representation\nof G by isometries of Tx0 M. The linear isotropy representation. We shall assume\nit to be faithful, i.e. injective. As a consequence the action of K on M is effective,\nso that K can be considered as a sub-group of the diffeomorphism group of M,\nand also the action of K on the frame bundle of M is free, i.e the only element of\nK which fixes a frame is the identity element. See page 187 and the remark on\npage 198 of [41] for a discussion of this, and how the condition can be avoided.\nTaking a fixed orthonormal frame u0 : Rn → Tx0 M , say, at x0 , we can consider\nG as acting by isometries on Rn by\ng * e = u−1\n0 T Lg u0 (e).\n\n(7.4)\n\nLet ρ : G → O(n) denote this representation. We then have the well known\nidentification of K as a subbundle of the orthonormal frame bundle of M:\nProposition 7.2.1 Let Φ : K → OM be defined by Φ(k)(e) = T Lk (u0e) for\ne ∈ Rn . Then Φ is an injective homomorphism of principle bundles. Moreover Φ\nis equivariant for the actions of σ on K and OM.\n\n\f116CHAPTER 7. EXAMPLE: RIEMANNIAN SUBMERSIONS & SYMMETRIC SPACES\nProof. To see that Φ is a bundle homomorphism it is only necessary to check that\nΦ commutes with the actions of G. For this take e ∈ Rn and g ∈ G. Then, for\nk ∈ K,\nΦ(k * g)(e) = T Lk T Lg u0 (e)\n= Φ(k)T Lg u0 (e) = Φ(k)u0 (g * e)\nas required. For the equivariance with respect to σ observe that by definition,\nσ(Lk x0 ) = Lσ(k) x0 so that acting on the frame Φ(k) we have\nσ(Φ(k)) = σ(T Lk ◦ u0 )\n= T Lσ(k) u0 = Φ(σ(k)).\n\nIt is easy to see that p : K → M has totally geodesic fibres. We can therefore\ntake B = 21 △K to have B lying over 21 △M . Moreover in the decomposition\nof B the vertical component 12 △V restricts to the one half the Laplacian of G\non the fibre p−1 (x0 ). The induced connection has horizontal subspace m at the\nidentity element of K. It is clearly left K-invariant and so Hk = T Lk [m] for\ngeneral k ∈ K. From the equivariance under the right action of G it is a principle\nconnection: T Rg [Hk ] = Hkg . Since Hkg = T Lk T Lg [m] = T Rk T Lk adg [m] this\nholds because of the adG -invariance of m. This is the canonical connection.\nThe connnection on K extends to one on OM as described in Proposition\n3.1.3.This is known as the canonical linear connection. Since the connection\non K is invariant under σ, by the equivariance of Φ so is the canonical linear\nconnection. As in [41] we have:\nProposition 7.2.2 The canonical linear connection is the Levi-Civita connection.\nProof. It is only necessary to check that its torsion T vanishes. By left invariance\nit is enough to do that at the point x0 . Let u, v ∈ Tx0 M. However by invariance\nunder σ we see\nT (u, v) = σT (σ(u), σ(v)) = −T (−u, −v) = −T (u, v),\nas required.\n\n\f7.2. RIEMANNIAN SYMMETRIC SPACES\n\n117\n\nLet kt , t > 0 be the canonical Brownian motion on K starting at the identity,\nid, and let Bt be the Brownian motion on the Euclidean space k given by the right\nflat anti-development:\nZ t\nBt =\nT Rk−1\nd{ks }.\ns\n0\n\nDefine ξt : M → M by ξt (x) = Lkt x, for t > 0, x ∈ M.\nProposition 7.2.3 The diffeomorphism group valued process ξt , t > 0 is the flow\nof the sde\ndxt = X(xt ) ◦ dBt\nwhere\nX(x)α =\n\nd\nLexp tα x|t=0\ndt\n\nProof. Observe that k. satisfies the right invariant SDE\ndkt = T Rkt ◦ dBt\nwhich is p-related to the given SDE on M.\nRemark 7.2.4 The last two propositions relate to the discussion of connections\ndetermined by stochastic flows in the next section, and to the discussion about\ncanonical SDE on symmetric spaces in [27]. In [27] it was shown that the connection determined by our SDE is the Levi-Civita connection. In Proposition 8.1.3\nbelow, and in Theorem 3.1 of [25], it is shown that the connection determined by\na flow (in this case the canonical linear connection) is the adjoint of that induced\nby its SDE. this is confirmed in our special case since the adjoint of a Levi-Civita\nconnection is itself.\nWe can also apply our analysis of the vertical operators and Weitzenböck formulae to our situation, For this it is simplest to assume the symmetric space is\nirreducible. This means that the restricted linear holonomy group of the canonical\nconnection on p : K → M is irreducible i.e. for every g ∈ G there is a nullhomotopic loop based at x0 whose horizontal lift starting at id ∈ K ends at the\npoint g. The definition in [41] is that [m, m] acts irreducibly on m via the adjoint\naction, and it is shown there, page 252, that this implies that g = [m, m]. As a\nconsequence the linear isotropy representation of G on Tx0 M is irreducible, and\nequivalently so is our representation ρ.\n\n\f118CHAPTER 7. EXAMPLE: RIEMANNIAN SUBMERSIONS & SYMMETRIC SPACES\nThe vertical operators determined by BV on the bundles associated to p via\nour representation ρ and its exterior powers ∧k ρ are given in Theorem 3.4.1 by\nk\nthe function λ∧ ρ : K → L(∧k Rn ; ∧k Rn ). By Corollary 3.4.8 and the discussion\nabove they correspond to the Weitzenböck curvatures of the Levi-Civita connection, and so in particular are symmetric. To calculate them using Theorem\nX 3.4.1\n1\n1\nV\nG\n−1\nfirst use the fact that B restricts to 2 △ on p (x0 ) to represent it as 2\nLA∗j LA∗j\n∗\nfor Aj as in Section 3.2. The computation in the proof of Corollary 3.4.3 shows\nthat\n(n − 2)!\nk\nλ∧ ρ (u) = −\n(7.5)\nc k (u),\n(k − 1)!(n − k − 1)! ∧\nfor\n\nc∧k (u) = (d∧k )Al (u) ◦ (d∧k )A′l (u)\n\nthe Casimir element of our representation ∧k ρ of G.\nIf ∧k ρ is irreducible then c∧k (u) is constant scalar. As remarked in Corollary\n3.4.3 this happens when G = SO(n), given our irreducibility hypothesis√on the\nρ and then it is just 12 n(n − 1)/ n(n−1)...(n−k+1)\n. Thus for the sphere S n ( 2) of\nk!\n√\nradius 2, considered as SO(n + 1)/SO(n) we have\n1\nk\nλ∧ ρ (u) = − k(n − k).\n4\n\n(7.6)\n\n\fChapter 8\nExample: Stochastic Flows\nBefore analysing stochastic flows by the methods of the previous paragraphs we\ndescribe some purely geometric constructions which will enable us to identify the\nsemi-connections which arise in that analysis.\n\n8.1 Semi-connections on the Bundle of Diffeomorphisms\nAssume that M is compact. For r ∈ {1, 2, . . . } and s > r + dim M/2 let D s =\nD s (M) be the space of diffeomorphisms of M of Sobolev class H s . See, for\nexample, Ebin-Marsden [20] and Elworthy [21] for the detailed structure of this\nspace. Elements of D s are then C r diffeomorphisms. The space is a topological\ngroup under composition, and has a natural Hilbert manifold structure for which\nthe tangent space Tθ D s at θ ∈ D s can be identified with the space of H s maps\nv : M → T M with v(x) ∈ Tθ(x) M, all x ∈ M. In particular Tid D s can be\nidentified with the space H s Γ(T M) of H s vector fields on M. For each h ∈ D s\nthe right translation\nRh : D s → D s\nRh (f ) = f ◦ h\nis C ∞ . However the joint map\nD s+r × D s → D s\nis C r rather than C ∞ for each r in {0, 1, 2, . . . }.\n119\n\n(8.1)\n\n\f120\n\nCHAPTER 8. EXAMPLE: STOCHASTIC FLOWS\n\nFor x0 ∈ M fixed, define π : D s → M by\nπ(θ) = θ(x0 ).\n\n(8.2)\n\nThe fibre π −1 (y) at y ∈ M is given by: {θ ∈ D s : θ(x0 ) = y}. Set Dxs 0 :=\nπ −1 (x0 ). Then the elements of Dxs 0 act on the right as C ∞ diffeomorphisms of\nD s . We can consider this as giving a principal bundle structure to π : D s → M\nwith group Dxs 0 , although there is the lack of regularity noted in equation (8.1).\nA smooth semi-connection on π : D s → M over a sub-bundle E of T M consists\nof a family of linear horizontal lift maps hθ : Eπ(θ) → Tθ D s , θ ∈ D s , which is\nsmooth in the sense that it determines a C ∞ section of L(π ∗ E; T D s ) → D s . In\nparticular we have\nhθ (u) : M → T M\nwith\nhθ (u)(y) ∈ Tθ(y) M,\nu ∈ Eθ(x0 ) , θ ∈ D s , y ∈ M.\nWe shall relate semi-connections on D s → M to certain reproducing kernel\nHilbert spaces. For this let E be a smooth sub-bundle of T M and H a Hilbert\nspace which consists of smooth section of E such that the inclusion H → C 0 ΓE\nis continuous (from which comes the continuity into Hs ΓE for all s > 0). Such\na Hilbert space determines and is determined by its reproducing kernel k, a C ∞\nsection of the bundle L(E ∗ ; E) → M × M with fibre L(Ex∗ ; Ey ) at (x, y), see [4].\nBy definition,\nk(x, −) = ρ∗x : Ex∗ → H\nwhere ρx : H → Ex is the evaluation map at x, and so\nk(x, y) = ρy ρ∗x : Ex∗ → Ey .\nAssume H spans E in the sense that for each x in M, ρx : H → Ex is surjective. It then induces an inner product h, iH\nx on Ex for each x via the isomorphism\nρx ρ∗x : Ex∗ → Ex .\nUsing the metric on E the reproducing kernel k induces linear maps\nk # (x, y) : Ex → Ey ,\nwith k # (x, x) = id.\n\nx, y ∈ M,\n\n\f8.1. SEMI-CONNECTIONS ON THE BUNDLE OF DIFFEOMORPHISMS121\nProposition 8.1.1 A Hilbert space H of smooth sections of a sub-bundle E of\nT M which spans E determines a smooth semi-connection hH on π : D s → M\nover E by\n\u0010\n\u0011\n#\nhH\n(u)(y)\n=\nk\nθ(x\n),\nθ(y)\n(u),\nθ ∈ D s , u ∈ Eθ(x0 ) , y ∈ M,\n(8.3)\n0\nθ\n\nfor k # derived from the reproducing kernel of H as above. In particular the horizontal lift α̃ starting from α̃(0) = id, of a curve α : [0, T ] → M, α(0) = x0 with\nα̇(t) ∈ Eα(t) for all t, is the flow of the non-autonomous ODE on M\n\u0010\n\u0011\n#\nżt = k α(t), zt α̇(t).\n(8.4)\n\nThe mapping H 7→ (hH , h, iH) from such Hilbert spaces to semi-connections over\nE and Riemannian metrics on E is injective.\nProof. From the definition of k # we see hH\nθ (u)(y), as given by (8.3), takes values\nin Tθ(y) M, is linear in u ∈ Eθ(x0 ) into Tθ D s , and is Dxs 0 -invariant. Moreover,\nTθ π ◦\n\nhH\nθ (u)\n\n=\n\nhH\nθ (u)(x0 )\n\n=k\n\n#\n\n\u0010\n\n\u0011\n\nθ(x0 ), θ(x0 ) (u) = u\n\nfor u ∈ Eθ(x0 ) and so hH\nθ is a 'lift'.\n∞\nTo see that h is C as a section of L(π ∗ E; T D s) → D s note that for each\nr ∈ {0, 1, 2, . . . } the composition map\nTid D r+s × D s → T D s\n(V, θ) 7→ T Rθ (V )\nis a C r−1 vector bundle map over D s , being a partial derivative of the composition\nD r+s × D s → D s . Therefore it induces a C r−1 vector bundle map Z 7→ T Rθ ◦ Z,\nfor Z : Eθ(x0 ) → H and for H the trivial H-bundle over D s , by composition\n✲\n\nL(π ∗ E; H)\n◗\n\nL(π ∗ E; T D s )\n\n✑\n✑\n◗\n✑\n◗\n◗◗\n✑✑\ns ✰\n\nDs\n\n\fCHAPTER 8. EXAMPLE: STOCHASTIC FLOWS\n\n122\n\nOn the other hand y 7→ k(y, −) can be considered as a C ∞ section of L(E; Hγ ) →\nM and so θ 7→ k(θ(x0 ), −) as a C ∞ section of L(π ∗ E; H γ ). This proves the\nregularity of h.\nThat the horizontal lift α̃ is the flow of (8.4) is immediate. To see that the claimed\n#\ninjectivity holds, given hH\nθ observe that (8.3) determines k : this is because given\n∞\nany x in M there exists a C diffeomorphism θ such that θ(x0 ) = x and for such\nθ\n−1\nk # (x, z)(u) = hH\n(8.5)\nθ (u)(θ z).\nRemark 8.1.2 We cannot expect surjectivity of the map H → hH into the space\nof semi-connections on π : D s → M. Indeed for k # defined by (8.5) to be the\nreproducing kernel for some Hilbert space of sections of E we need\n1) hH\nθ (u)(y) ∈ Eθ(y) for u ∈ Eθ(x0 ) , y ∈ M, and a metric h, i on E with respect\nto which the following holds:\n2) for x, y ∈ M,\n\n#\n\n\u0010\n\n#\n\n\u0011∗\n\nk (x, y) = k (y, x) ,\n\n3) For any finite set S of points of M and {ξa } ∈ Ea , a ∈ S\nE\nXD\nk # (a, b)ξa , ξb > 0.\n\nFor each frame u0 : Rn → Tx0 M there is a homomorphism of principal bundles\nΨu0 : D s → GLM\nθ\n7→ Tx0 θ ◦ u0 .\n\n(8.6)\n\nAs with connections such a homeomorphism maps a semi-connection on D s over\nE to one on GLM. The horizontal lift maps are related by\nTθ Ψu0 ✲\nTΨu0 (θ) GLM\nTθ D s\n◗\n❦\n✸\n✑\n◗\n✑\n◗\n✑\n✑ hΨu0 (θ)\nhθ ◗\n◗\n✑\n◗ ✑\n\nEθ(x0 )\nand if α̃ : [0, T ] → D s is a horizontal lift of α : [0, T ] → M then\nΨu0 (α̃(t)) = Tx0 α̃(t) ◦ u0 ,\n\nis a horizontal lift of α to GLM.\n\n06t6T\n\n\f8.2. SEMI-CONNECTIONS INDUCED BY STOCHASTIC FLOWS\n\n123\n\nTheorem 8.1.3 Let hH be the semi-connection on π : D s → M over E determined by some H as in Proposition 8.1.1. Then the semi-connection induced on\nˆ of the metric\nGLM, and so on T M, by the homeomorphism Ψu0 is the adjoint ∇\nH\nconnection which is projected on (E, h, i ) by the evaluation map (x, e) 7→ ρx (e)\nfrom M × H → E, c.f. (1.1.10) in [27]. In particular every semi-connection on\nT M with metric adjoint connection arises this way from some, even finite dimensional, choice of H.\nProof. Let α : [0, T ] → M be a C 1 curve with α̇(t) ∈ Eα(t) for each t. By\nProposition 8.1.1 its horizontal lift α̃ to D s starting from θ ∈ π −1 (α(0)) is the\nsolution to\n\u0010\n\u0011\ndα̃\n= k # α̃(t)(x0 ), α̃(t) − α̇(t)\n(8.7)\ndt\nα̃(0) = θ.\n(8.8)\nThe horizontal lift to GLM is t 7→ Tx0 α̃(t) ◦ u0 and to T M through v0 ∈ Tθ(x0 ) M,\ni.e. the parallel translation {//t (v0 ) : 0 6 t 6 T } of v0 along α, is given by\n\u0011\n\u0010\n−1\n−1\n(v0 ).\n//t (v0 ) = Tx0 α̃(t) ◦ (Tx0 θ) (v0 ) = Tα(0) α̃(t) ◦ θ\nHowever this is Tα(0) πt (v0 ) for {πt : 0 6 t 6 T } the solution flow of\n\u0010\n\u0011\ndzt\n= k # α(t), z(t) α̇(t)\ndt\n\nwhich by Lemma 1.3.4 of [27] is the parallel translation of the adjoint of the\nassociated connection (in [27] k # is denoted by k).\nThe fact that all such semi-connections on T M arise from some finite dimensional H comes from Narasimhan-Ramanan [53] as described in [27], or more\ndirectly from Quillen [60]\n\n8.2 Semi-connections Induced by Stochastic Flows\nFrom Baxendale [5] we know that a C ∞ stochastic flow {ξt : t > 0} on M, i.e.\na Wiener process on D ∞ := ∩s D s , can be considered as the solution flow of a\nstochastic differential equation on M driven by a possibly infinite dimensional\nnoise. Its one point motions form a diffusion process on M with generator A,\nsay. The noise comes from the Brownian motion {Wt : t > 0} on Hs Γ(T M)\n\n\fCHAPTER 8. EXAMPLE: STOCHASTIC FLOWS\n\n124\n\ndetermined by a Gaussian measure γ on Hs Γ(T M). (In our C ∞ case they lie on\nH∞ (T M) := ∩s Hs Γ(T M).) We will take γ to be mean zero and so we may have\na drift A in H∞ (T M). The stochastic flow {ξt : t > 0} can then be taken to be\nthe solution of the right invariant stochastic differential equation on D s\ndθt = T Rθt ◦ dWt + T Rθt (A)dt\n\n(8.9)\n\nwith ξ0 the identity map id. In particular it determines a right invariant generator\nB on D s .\nFor fixed x0 in M the one point motion xt := ξt (x0 ) solves\ndxt = ◦dWt (xt ) + A(xt )dt.\n\n(8.10)\n\ndxt = ρxt ◦ dWt + A(xt )dt.\n\n(8.11)\n\nWe can write (8.10) as\n\nThus π(ξt ) = ξt (x0 ) = xt . For a map θ in D s , the solution ξt ◦ θ to (8.9)\nstarting at θ has π(ξt ◦ θ) = ξt (π(θ)), the solution to (8.11) starting from π(θ), and\nwe see that the diffusions are π-related (c.f. [21]), and A and B are intertwined\nby π.\nThe measure γ corresponds to a reproducing kernel Hilbert space, Hγ say, or\nequivalently to an abstract Wiener space structure i : Hγ → Hs Γ(T M) with i the\ninclusion (although i may not have dense image). Then\nσθB : (Tθ D s )∗ → Tθ D s\nis right invariant and determined at θ = id by the canonical isomorphism Hγ∗ ≃\nHγ through the usual map j = i∗\nj\n\ni\n\n(Hs Γ(T M))∗ ֒→ Hγ∗ ≃ Hγ ֒→ Hs Γ(T M),\ni.e.\nB\nσid\n= i ◦ j.\nB\nwith induced metric. In this situation our coheThis shows Hγ is the image of σid\nsiveness condition on A becomes the assumption that there is a C ∞ subbundle E\nof T M such that Hγ consists of sections of E and spans E, and A is a section of\nE. Let h, iy be the inner product on Ey induces by Hγ .\n\n\f8.2. SEMI-CONNECTIONS INDUCED BY STOCHASTIC FLOWS\n\n125\n\nThe reproducing kernel k of Hγ is the covariance of γ and :\nZ\nD\nE\n#\nk (x, y)v =\nU(x), v U(y) dγ(U),\nv ∈ Ex ; x, y ∈ M.\nx\n\nU ∈Hs Γ(E)\n\nAnalogously to Lemma 2.2.1 we have the commutative diagram\n(Tθ D s )∗\n\nj ◦ (T Rθ )∗\n\n✲\n\nHγ\n\n✻\n\n✻\n\n(Tθ π)∗\n∗\nTθ(x\nM\ns)\n\n→\n\n∗\nEθ(x\n0)\n\nT Rθ ◦ i\n\n✲Tθ D s\n\nlθ\nk(θ(x0 ), −)\n\n✲\n\nHγ\n\nTθ π = ρx0\n\nρθ(x0 )\n\n✲\n\n❄\n\nEθ(x0 ) ֒→ Tx0 M\n\nwith lθ uniquely determined under the extra condition\nker lθ = kerρθ(x0 ) .\nWriting K : M → L(Hγ ; Hγ ) for the map giving the projection K(x) of Hγ\nonto ker ρx for each x in M and letting K ⊥ (x) be the projection onto [ker ρx ]⊥ we\nhave\n\u0001\nlθ = K ⊥ θ(x0 ) ,\n(agreeing with the note following Lemma 2.2.1), and so\n\u0010\n\u0011\nU ∈ Hγ .\nlθ (U) = k # θ(x0 ), − U(θ(x0 )),\n\nNote that the formula\n\nK ⊥ (y)(U) = k # (y, −)U(y)\n\nfor U in Hγ determines an extension K ⊥ (y) : ΓE → Hγ . We then define\nK(y)U = U − K ⊥ (y)U. Note that ρy (K(y)U) = 0 for all U in ΓE.\nThe horizontal lift map determined by B as in Proposition 2.1.2 is therefore\ngiven by\nhθ : Eθ(x0 ) → T Rθ (Hγ )\n⊂ Tθ D s\nh\ni\n(8.12)\nhθ (u) = T Rθ lθ k # (θ(x0 ), −)u ,\nfor θ ∈ D s . Consequently\n\n\u0010\n\u0011\nhθ (u)(y) = k # θ(x0 ), θ(y) (u).\n\nComparing this with formula (8.3) we have\n\n(8.13)\n\n\f126\n\nCHAPTER 8. EXAMPLE: STOCHASTIC FLOWS\n\nProposition 8.2.1 The semi-connection h determined on π : D s → M by the\nequivariant diffusion operator B is just that given by the reproducing kernel Hilbert\nspace Hγ of the stochastic flow which determines B, i.e.\nh = hHγ .\nThe horizontal lift {x̃t : t > 0} of the one point motion {xt : t > 0} with\nx̃0 = id is the solution to\n\u0010\n\u0011\ndx̃t = k # x̃t (x0 ), x̃t − ◦ dxt ;\n(8.14)\n\nwhich in a more revealing notation is:\n\u0010\n\u0011\n\u0010\n\u0011\n⊥\n⊥\ndx̃t = T Rx̃t K (x̃t (x0 )) ◦ dWt + T Rx̃t K (x̃t (x0 ))A .\n\n(8.15)\n\nEquivalently {x̃t : t > 0} can be considered as the solution flow of the nonautonomous stochastic differential equation on M\n\u0001\ndyt = k # xt , yt ◦ dxt\ni.e.\n\n\u0010\n\u0011\ndyt = K ⊥ (xt ) ◦ dWt (yt ) + K ⊥ (xt )(A)(yt ).\n\n(8.16)\n\nThe standard fact that the solution to such equation as (8.16) starting at x0 is\njust {xt : t > 0}, i.e. that x̃t (x0 ) = xt reflects the fact that x̃* is a lift of x* . The\nlift through φ ∈ Dxs 0 is just {x̃t ◦ φ : t > 0}.\nRemark 8.2.2 If our solution flow is that of an SDE\ndxt = X(xt ) ◦ dBt + A(xt )dt\nfor X(x) : Rm → T M arising, for example, from Hörmander form representation of A as in §4.7 above the relationships with the notation in this section is as\nfollows: Hγ = {X(*)e : e ∈ Rm } with inner product induced by the surjection\nRm → Hγ . If Yx = [X(x)|ker X(x)⊥ ]−1 then k # (y, −) : Ey → Hγ is\nk # (y, −)u = X(−)Yy (u),\n\nu ∈ Ey .\n\nAlso K ⊥ (y) : ΓE → Hγ is K ⊥ (y)U = X(−)Yy (U(y)).\n\n\f8.2. SEMI-CONNECTIONS INDUCED BY STOCHASTIC FLOWS\n\n127\n\nRemark 8.2.3 The reproducing kernel Hilbert space Hγ determines the stochastic flow and so by the injectivity part of Proposition 8.1.1 the semi-connection\ntogether with the generator A of the one-point motion determines the flow, or\nequivalently the operator B. This is because the symbol of A again gives the metric on E which together with the semi-connection determines Hγ by Proposition\n8.1.1. The generator A then determines the drift A. A consequence is that the\nhorizontal lift AH of A to D s determines the flow (and hence B, so BV really is\nredundant).\nTo see this directly note that given any cohesive A on M and Dxs 0 -equivariant\nAH on D s over A, with no vertical part, there is at most one vertical BV such that\nAH + BV is right invariant. This follows from the following lemma\nLemma 8.2.4 Suppose B1 is a diffusion operator on D s which is vertical and right\ninvariant then B1 = 0.\n′\n\nProof. By Remark 1.3.2 (i) the image Eθ , say, of σθB lies in V Tθ D s for θ ∈ D s and\nso if V ∈ Eθ . On the other hand, by right invariance Eθ = T Rθ (Eid). Therefore\nif V ∈ Eid then V (θx0 ) = 0 all θ ∈ D s and so V ≡ 0. Thus Eid = {0} and by\nright invariance, B1 must be given by some vector field Z on D s . But Z must be\nvertical and right invariant, so again we see Z ≡ 0.\nProposition 3.1.3 applies to the homomorphism Ψu0 : D s → GL(M) of (8.6).\nFrom this and Theorem 8.1.3 we see that the semi-connection ∇ on GLM deˆ of the\ntermined by the generator of the derivative flow in §3.3 is the adjoint ∇\n ̆\nconnection ∇, so giving an alternative proof of Theorem 3.3.1 above. Proposition\nˆ\n3.1.3 also gives a relationship between the curvature and holonomy group of ∇\nρx0\nand those of the connection induced by the flow on D s → M.\nWe can summarize our decomposition results as applied to these stochastic\nflows in the following theorem. The skew product decomposition was already\ndescribed in [25] for the case of solution flows of SDE of the form (4.19), and in\nparticular with finite dimensional noise: however the difference is essentially that\nof notation, see Remark 8.2.2 above.\nTheorem 8.2.5 Let {ξt : t > 0} be a C ∞ stochastic flow on a compact manifold\nM. Let A be the generator of the one point motion on M and B the generator\nof the right invariant diffusion on D s determined by {ξt : t > 0}. Assume A\nis strongly cohesive. Then there is a unique decomposition B = AH + BV for\nAH a diffusion operator which has no vertical part in the sense of definition 2.3.3\n\n\fCHAPTER 8. EXAMPLE: STOCHASTIC FLOWS\n\n128\n\nand BV a diffusion operator which is along the fibres of ρx0 , both invariant under\nthe right action of Dxs 0 . The diffusion process {θt : t > 0} and {φt : t > 0}\ncorresponding to AH and BV respectively can be represented as solutions to\n\u0010\n\u0011\n\u0010\n\u0011\n(8.17)\ndθt = T Rθt K ⊥ (θt (x0 )) ◦ dWt + T Rθt K ⊥ (θt (x0 ))A\nand\n\n\u0010\n\u0011\n\u0010\n\u0011\ndφt = T Rφt K(z0 ) ◦ dWt + T Rφt K(z0 )A\n\n(8.18)\n\nfor z0 = φ0 (x0 ) = φt (x0 ). There is the corresponding skew-product decomposition of the given stochastic flow\nξt = x̃t gtx* , 0 6 t < ∞\nwhere {x̃t : t > 0} is the horizontal lift of the one point notion {ξt (x0 ) : t > 0}\nσ\nwith x̃0 = idM and for PA\nx0 -almost all σ : [0, ∞) → M, {gt : t > 0} is a\nDxs 0 -valued process independent of {x̃t : t > 0} and satisfying\ndgtσ\n\n=\n\nT σ̃t−1 ρ(σ̃t gtσ −)\n\nσ̃0 = idM\n\n\u0010\n\n\u0011\n\nK(σt ) ◦ dWt +\n\nT σ̃t−1 ρ(σ̃t gtσ −)\n\n\u0010\n\n\u0011\nK(σt )A\n\nwhere σ̃ is the horizontal lift of σ̃ to D s with σ̃* in the horizontal life of σ̃ to D s\nwith σ̃0 = idM .\nRemark 8.2.6 As in [27] we could rewrite the terms such as K(σt ) ◦ dWt and\nK ⊥ (σt ) ◦ dWt above as Itô differentials which can be written as\nK(σt )dWt = /̃/t (σ* ) dβt\n\nK ⊥ (σt )dWt = /̃/t (σ* ) dB̃t\nwhere / ̃/t (σ* ) : Hγ → Hγ , 0 6 t < ∞, is a family of orthogonal transformations\nmapping ker ρx0 → ker ρσt defined for PA\nx0 -almost all σ : [0, ∞) → M and\n{βt : t > 0}, {B̃t : t > 0} are independent Brownian motions, (βt could be\ncylindrical), on ker ρx0 and [ker ρx0 ]⊥ respectively.\nProof. Our general result give the decomposition B = AH + BV into horizontal\nand vertical parts. We have just proved the representation (8.17) for AH . To show\n\n\f8.2. SEMI-CONNECTIONS INDUCED BY STOCHASTIC FLOWS\n\n129\n\nthat B − AH corresponds to (8.18) take an orthonormal base {X j } for Hγ . Then,\non a suitable domain,\n1X\n(8.19)\nLXj LXj + LA\nB=\n2 j\n\nfor Xj (θ) = T Rθ (X j ) and A = T Rθ (A), while, by (8.17),\nAH =\n\n1X\nLYj LYj + LB\n2 j\n\n(8.20)\n\n\u0001\nfor Yj (θ) = T Rθ K ⊥ (θ(x0 )X j , B = T Rθ (K ⊥ (θ(x0 ))A).\nDefine vector fields Zj , C on D s by\n\u0001\nZj (φ) = T Rφ K(φ(x0 ))X j ,\nand\nC(φ) = T Rφ (K(φ(x0 ))A) ,\nfor φ ∈ D s .\nThen A = B + C and Xj = Yj + Zj each j. Moreover\nX\nX\nLYj LZj +\nLZj LYj = 0\nj\n\nj\n\nby Lemma 8.2.7 which follows below. This shows that\n1X\nBV =\nLZj LZj + LC .\n2 j\n\n(8.21)\n\nThus the diffusion process from φ0 corresponding to BV can be represented by the\nsolution to\ndφt = T Rφt (K(φt (x0 ) ◦ dWt )) + T Rφt (K(φt (x0 )A)) dt.\n\n(8.22)\n\nIf we set zt = ρx0 (φt ) = φt (x0 ). We obtain, via Itô's formula\nzt = ρzt (K(zt ) ◦ dWt ) + ρzt (K(zt )A) ,\ni.e. dzt = 0. Thus φt (x0 ) = z0 and (8.18) holds.\nThe skew product formula is seen to hold by calculating the stochastic differential of x̃t gtx̃ using (8.15) to see it satisfies the SDE (8.9) for {ξt : t > 0}.\nLemma 8.2.7\n\nX\nj\n\nLYj LZj + LZj LYj = 0.\n\n\fCHAPTER 8. EXAMPLE: STOCHASTIC FLOWS\n\n130\n\nProof. Since, for fixed θ, we can choose our basis {X j }, such that either Yj (θ) =\n0 or Xj (θ) = 0, and since for f : D s → R we can write\n\u0011\n\u0010\n\u0011 \u0010\n\u0011\u0010\ndf Zj (θ) = df ◦ T Rθ K(θ(x0 ))X j\nand\n\n\u0011\n\u0010\ndf (Yj (θ)) = (df ◦ T Rθ ) K ⊥ (θ(x0 ))X j ,\n\nθ ∈ Ds ,\n\nit suffices to show that\n\u0010\n\u0011\nXn\n\u0001 o\n(dK ⊥ )θ(x0 ) Zj (θ)(x0 ) X j + (dK)θ(x0 ) Yj (θ)(x0 ) X j = 0,\n\n(8.23)\n\nj\n\nfor all θ ∈ D s .\nNow K ⊥ (y)K(y) = 0 for all y ∈ M. Therefore\n(dK ⊥ )y (v)K(y) + K ⊥ (y)(dK)y (v) = 0,\nWriting\n\n∀v ∈ Tx M, x ∈ M.\n\n\u0001\n\u0001\nX j = K θ(x0 ) X j + K ⊥ θ(x0 ) X j\n\nthis reduces the right hand side of (8.23) to\n\u0011\n\u0010\n\u0011\u0010\nX\n\u0001\ndK ⊥ θ(x0 ) Zj (θ)(x0 ) K ⊥ (θ(x0 ))X j\nj\n\n\u0010\n\nj\n\n+(dK)θ(x0 ) Y (θ)(x0 )\n\n\u0011\u0010\n\nK(θ(x0 ))X\n\nwith our choice of basis this clearly vanishes, as required.\n\nj\n\n\u0011\n\n=0\n\n8.3 Semi-connections on Natural Bundles\nOur bundle π : Diff M → M can be considered as a universal natural bundles\nover M, and a connection on it induces a connection on each natural bundle over\nM. Natural bundles are discussed in Kolar-Michor-Slovak [42]), they include\nbundles such as jet bundles as well as the standard tensor bundles. For example\nlet Grn be the Lie group of r-jets of diffeomorphisms θ : Rn → Rn with θ(0) = 0\nfor positive integer r. An 'r-th order frame' u at a point x of M is the r-jet at 0\nof some ψ : U → M which maps an open set U of Rn diffeomorphically onto an\nopen subset of M with 0 ∈ U and ψ(0) = x. Clearly Grn acts on the right of such\n\n\f8.3. SEMI-CONNECTIONS ON NATURAL BUNDLES\n\n131\n\njets, by composition. From this we can define the rth order frame bundle Grn M of\nM with group Grn .\nIf we fix an rth order frame u0 at x0 we obtain a homomorphism of principal\nbundles\nΨu0 : D s → Grn M\nθ 7→ jxr0 (θ) ◦ u0\nas for GLM (which is the case r = 1) with associated group homomorphism\nr\nDxs 0 → Gn given by θ → u−1\n0 ◦ jx0 (θ) ◦ u0 . As for the case r = 1 there is a\ndiffusion operator induced by the flow on Grn M and we are in the situation of\nProposition 8.1.3. The behaviour of the flow induced on G2n M is essentially that\nof jx20 (ξt ) and so relevant to the effect on the curvature of sub-manifolds of M as\nthey are moved by the flow e.g. see Cranston-LeJan [14], Lemaire [46].\nAlternatively rather having to choose some u0 we see that Grn M is (weakly)\nassociated to π : D s → M by taking the action of Dxs 0 on (Grx M)x0 by\n(θ, α) 7→ jxr0 (θ) ◦ α.\nAs a geometrical conclusion we can observe\nTheorem 8.3.1 Any classifying bundle homomorphism\nΦ\n\nOM → V (n, m − n)\n→\n\nM Φ0 G(n, m − n)\n\nfor the tangent bundle to a compact Riemannian manifold M, (where G(n, m −\nn) is the Grassmannian of n-planes in Rm and V (n, m − n) the corresponding\nStiefel manifold) induces not only a metric connection on T M as the pull back of\nNarasimhan and Ramanan's universal connection ̟U , but also a connection on Π :\nD s → M. The latter induces a connection on each natural bundle over M to form\na consistent family; that induced on the tangent bundle is the adjoint of Φ∗ (̟U ).\nThe above also holds with smooth stochastic flows replacing classifying bundle\nhomomorphisms, and the resulting map from stochastic flows to connections on\nπ : D s → M is injective.\nProof. It is only necessary to observe that Φ determines and is determined by a\nsurjective vector bundle map X : M × Rm → T M (e.g. see [27], Appendix 1).\nThis in turn determines a Hilbert space H of sections of T M as in Remark 8.2.2\nso we can apply Proposition 8.1.1 and 8.1.3.\n\n\f132\n\nCHAPTER 8. EXAMPLE: STOCHASTIC FLOWS\n\nSome of the conclusions of Theorem 8.3.1 are explored further in [30].\nRemark 8.3.2 This injectivity result in Proposition 8.3.1 implies that all properties of the flow can, at least theoretically, be obtainable from the induced connection on D s .\nFlows on Non-compact Manifolds\nIn general if M is not compact we will not be able to use the Hilbert manifolds\nD s , or other Banach manifolds without growth conditions on the coefficients of\nour flow. One possibility could be use the space Diff M of all smooth diffeomorphisms using the Frölicher-Kriegl differential calculus as in Michor [51]. In order\nto do any stochastic calculus we would have to localize and use Hilbert manifolds\n(or possibly rough path theory). The geometric structures would nevertheless be\non Diff M. This was essentially what was happening in the compact case. However it is useful to include partial flows of stochastic differential equations which\nare not strongly complete, see Kunita [43] or Elworthy[21]. For the partial solution flow {ξt : t < τ } of an SDE as in Remark 8.2.2 we obtain the decomposition\nin Theorem 8.2.5 but now only for ξt (x) defined for t < τ (x, −). This can be\nproved from the compact versions by localization as in Carverhill-Elworthy [13]\nor Elworthy [21].\n\n\fChapter 9\nAppendices\n9.1 Girsanov-Maruyama-Cameron-Martin Theorem\nTo apply the Girsanov-Maruyama theorem it is often thought necessary to verify\nsome condition such as Novikov's condition to ensure that the exponential (local)\nmartingale arising as Radon -Nikodym derivative is a true martingale. In fact for\nconservative diffusions this is automatic, and we give a proof of this fact here since\nit is not widely appreciated. The proof is along the lines of that given for elliptic\ndiffusions in [21] but with the uniqueness of the martingale problem replacing the\nuniqueness of minimal semi-groups used in [21]. See also [[45]]. On the way\nwe relate the expectation of the exponential local martingale to the probability\nof explosion of the trajectories of the associated diffusion process: a special case\nof this appeared in [50]. Let B be a conservative diffusion operator on a smooth\nmanifold N. For fixed T > 0 and y0 ∈ N let Py0 . = PBy0 denote the solution to\nthe martingale problem for B on Cy0 ([0, T ]; N + ). Using the notation of chapter\n4, let b be a vector field on N for which there is a T ∗ N-valued process α in L2B,loc\nsuch that\n2σ B (αt ) = b(yt )\n06t6T\nfor Py0 almost all y. ∈ Cy0 ([0, T ]; N + ). Set\n\n1\nhM α it }\n0 6 t 6 T.\n2\nThis exists by the non-explosion of the diffusion process generated by B, and is a\nlocal martingale with EZt 6 1.\nFor bounded measurable f : N → R define Qt f (y0 ) = EBy0 [Zt f (yt )] for\ny0 ∈ N. Since the pair (y. , Z. ) is Markovian this determines a semi-group on the\nZt = exp{Mtα −\n\n133\n\n\fCHAPTER 9. APPENDICES\n\n134\n\nspace of bounded measurable functions with corresponding probability measures\n{Qy0 }y0 ∈N .\nProposition 9.1.1 The family {Qy0 }y0 ∈N is a solution to the martingale problem\nfor the operator B + b.\n\nProof. Let f : N → R be C ∞ with compact support. We must show, for arbitrary\ny0 ∈ N, that\nZ t\nf (yt ) − f (y0) −\n(B + b)f (ys )ds\n0≤t6T\n0\n\nis a local martingale under Qy0 . For this first note that Z. satisfies the usual\nstochastic equation which in our notation becomes:\nZt = 1 + MtZα ,\n\n06t6T\n\nNow use Ito's formula and the definition of M α to see that\nf (yt)Zt = f (y0 ) +\n\nZ(df )y.\nMt\n\n+\n\nMtf Zα\n\nZ\n\n+\n\nt\n\n0\n\nNow\ndf\n\nM ,M\n\nZα\nt\n\nZ\n\nBf (ys )Zs ds + M df , M Zα t . (9.1)\n\nt\n\n\u0001\n= 2\ndf σyBs (Zs αs ) ds\nZ t0\n\u0001\n=\ndf Zs b(ys ) ds.\n\n(9.2)\n(9.3)\n\n0\n\nThus\nf (yt )Zt − f (y0) −\n\nZ\n\n0\n\nt\n\nBf (ys )Zs ds −\n\nZ\n\nt\n0\n\n\u0001\ndf Zs b(ys ) ds,\n\n0 ≤ t 6 T,\n\nis a local martingale under PBy0 and so there is a sequence {τn }n of stopping times,\nincreasing to T , such that if φ : Cy0 ([0, T ]; N + ) → R is Fry0 -measurable and\nbounded then, using the definition of Q and Fubini's theorem, if 0 6 r 6 t 6 T ,\n\u0013 \u0015\n\u0014\u0012\nZ t∧τn\nQ\n(B + b)(f )(ys )ds φ\nf (yt∧τn ) −\nE y0\n0\n\u0013 \u0015\n\u0014\u0012\nZ t∧τn\nB\n(B + b)(f )(ys )Zs ds φ\nf (yt∧τn )Zt∧τn −\n= E y0\n0\n\u0013 \u0015\n\u0014\u0012\nZ r∧τn\nB\n(B + b)(f )(ys )Zs ds φ .\nf (yr∧τn )Zr∧τn −\n= E y0\n0\n\n\f9.2. STOCHASTIC DIFFERENTIAL EQUATIONS FOR DEGENERATE DIFFUSIONS135\ngiving the required martingale property.\nSince Qt (1) = EZt we immediately obtain the following corollary and a theorem:\nCorollary 9.1.2 . Suppose further that uniqueness of the martingale problem\nholds for B + b, e.g suppose b is locally Lipschitz [39]. Then\nEBy0 Zt\nis the probability that the diffusion process from y0 generated by B + b has not\nexploded by time t.\nTheorem 9.1.3 Suppose the diffusion operator B and its perturbation B + b by a\nlocally Lipschitz vector field b on N are both conservative. Assume that B + b is\ncohesive or more generally that there is a locally bounded, measurable one-form\nb# on N such that\n2σyB (b#\ny ∈ N.\ny ) = b(y),\nThen\n\n\u0001\n1\n#\nMb t ,\n06t6T\n2\nis a martingale under PB and for each y0 ∈ N the measures PBy0 and PyB+b\non\n0\nCy0 ([0, T ]; N) are equivalent with\n#\n\nexp Mtb −\n\ndPyB+b\n1\n#\n#\n0\n= exp MTb − M b\nB\ndPy0\n2\n\nT\n\n\u0001\n\n.\n\n9.2 Stochastic differential equations for degenerate\ndiffusions\nLet B be a (smooth) diffusion diffusion operator on N. If its symbol σ B : T ∗ N →\nT N does not have constant rank there may be no smooth, or even C 2 , factorisation\nX∗\n\nX\n\nT ∗ N → Rm → T N\nof σxB into X(x)X ∗ (x) for X : N × Rm → T N, as usual, for any finite dimensional m. []. A factorisation with X : N × H → T N, for H a separable\nHilbert space, can be found following Stroock and Varadhan, Appendix in [68].\n, with the property that X is continuous and each vector field X j is C ∞ , where\n\n\fCHAPTER 9. APPENDICES\n\n136\n\nX j (x) = X(x)(ej ) for an orthonormal basis (ej )∞\nj=1 of H. However it seems\nunclear if such an X can be found with each x 7→ X(x)e, e ∈ H, smooth. The\nfollowing is well known:\nTheorem 9.2.1 Let σ : Rd → L+ (Rm ; Rm√\n) be a C 2 map into the symmetric\npositive semi-definite (m×m)-matrices then σ : Rd → L+ (Rm ; Rm ) is locally\nLipschitz .\nFor a proof see Freidlin [34], page 97 in [67] or Ikeda-Watanabe [39].\nCorollary 9.2.2 For a C 2 diffusion operator B on N there is a locally Lipschitz\nX : Rm → T N with σ B = XX ∗ for some m.\ni\n\nProof. Take a smooth inclusion T N → Rm + as a sub-bundle \u0001(e.g. by embedding\nN in Rm ) and extend σ B trivially to σxB : N → L (Rm )∗ ; Rm by\ni∗\n\nx\nTx∗ N\n(Rm )∗ →\n\nσB\n\nx\n→\nTx N\n\ni\n\nx\n→\nRm\n\nidentifying (Rm )∗ with Rm and take the square root.\nLet ∇ be a connection on a sub-bundle G of T N and let X : Rm → G be a\nlocally Lipschitz bundle map. Let A be a locally Lipschitz vector field on N. As\nin Elworthy [21] (p184) we can form the Itô stochastic differential equation on N\n(∇)\n\ndxt = X(xt )dBt + A(xt )dt\n\nwhere (Bt ) is a Brownian motion on Rm . For given x0 ∈ N there will be a unique\nmaximal solution {xt : 0 6 t < ζ x0 } as usual, where by a solution we mean a\nsample continuous adapted process such that for all C 2 functions f : N → R\nZ t\nZ t\nf (xt ) = f (x0 ) +\n(df )xs X(xs )dBs +\n(df )xs A(xs )ds\n=\n\nZ tX\nm\n0\n\nj=1\n\n0\n\n0\n\n∇X j (xs ) (df |G )X j (xs )ds.\n\nIndeed in a local coordinate (U, φ) system the equation is represented by\n\u0010\n\u0011\u0010\n\u0011\n1X\nΓφ (xφt ) Xφj (xφt ) Xφj (xφt ) dt + Aφ (xφt )dt,\n2 j=1\nm\n\ndxφt = Xφ (xφt )dBt −\n\n\f9.3. SEMI-MARTINGALES & Γ-MARTINGALES ALONG A SUB-BUNDLE 137\nwhere Xφ , Xφi , and Aφ are the local representations of X, X i and A, and Γφ is the\nChristoffel symbol.\nNote that the generator of the solution process has symbol σx = X(x)X(x)∗ ,\nx ∈ N, and so a Lipschitz factorisation of σ B together with a suitable choice of A\nwill give a diffusion process with generator B.\nIf in addition we have another generator G on N given in Hörmander form\nG=\n\np\nX\n\nLY k LY k + LY 0\n\nk=1\n\nfor Y 0 , Y 1 , . . . , Y k vector fields of class C 2 we can consider an SDE of mixed\ntype\n(∇)\n\ndxt =\n\np\nX\nk=1\n\nY k (xt ) ◦ dB̃tk + X(xt )dBt + (Y 0 (xt ) + A(xt ))dt\n\nfor B̃ 1 , . . . , B̃ k independent Brownian motions on R independent of (Bt ). For a\nC 2 map f : N → R, a solution {xt : 0 6 t < ζ x0 } will satisfy\nZ t\nZ tX\nn\nf (xt ) = f (x0 ) +\n(df )xs X(xs )dBs +\n(df )xs (X k (xs ))dB̃sk\n=\n\nZ\n\n0\n\n0 k=1\n\nt\n\n(B + G)f (xs )ds,\n\nt < ζ x0 ,\n\n0\n\ngiving the unique solution to the martingale problem for B + G. These SDE's fit\ninto the general frame work of the 'Itô bundle' approach of Belopolskaya-Dalecky\n[6], see the Appendix of Brzezniak-Elworthy[11]; also see Emery [31](section\n6.33, page 85) for a more semi-martingale oriented approach.\n\n9.3 Semi-martingales & Γ-martingales along a Subbundle\nSeveral of the concepts we have defined for diffusions also have versions for semimartingales, and these are relevant to the discussion of non-Markovian observations in Chapter 5. Only continuous semi-martingales will be considered. Let S\ndenote a sub-bundle of the tangent bundle T M to a smooth manifold M.\n\n\fCHAPTER 9. APPENDICES\n\n138\n\nDefinition 9.3.1 A semi-martingale ys , 0 6 s < τ is said to be along S if whenever φ is a C 2 one-form on M which annihilates S we have vanishing of the\nStratonovich integral of φ along y. :\nZ t\nφys ◦ dys = 0 0 < t < τ.\n0\n\nFor simplicity take y0 to be a point of M.\nProposition 9.3.2 The following are equivalent:\n1. the semi-martingale y. is along S;\n2. if αs : 0 6 s < τ is a semi-martingale with values in the annihilator of S in\nT ∗ M, lying over y. , then\nZ t\nαys ◦ dys = 0 0 < t < τ ;\n0\n\n3. for some, and hence any, connection Γ on S the process y. is the stochastic\ndevelopment of a semi-martingale ysΓ, 0 6 s < τ on the fibre Sy0 of S above\ny0 .\nIf L is a diffusion operator then the associated diffusion processes are all along\nS if and only if L is along S in the sense of Section 1.3.\nProof. Let //. denote the parallel translation along the paths of y. using Γ. If (3)\nholds then\ndy. = //. ◦ dy.Γ\nand it is immediate that (2) is true. Also (2) trivially implies (1).\nNow suppose that (1) holds. Let Γ be a connection on E and Γ0 some extension of it to a connection on T M, so that the corresponding parallel translation\n0\n//0 will preserve S and some complementary sub- bundle of T M. Let y Γ be the\nstochastic anti-development of y. using this connection. To show (3) holds it suf0\nfices to show that y Γ takes values in Sy0 . For this choose a smooth vector bundle\nmap Φ : T M → M × Rm whose kernel is precisely S and let φ : T M → Rm\ndenote its principal part and φj , j = 1, ..., m the components of φ. These are\none-forms which annihilates S. Then, for each j\nZ t\nZ t\n0\n0=\nφs ◦ dys =\nφs //0s ◦ dysΓ 0 < t < τ.\n0\n\n0\n\n\f9.3. SEMI-MARTINGALES & Γ-MARTINGALES ALONG A SUB-BUNDLE 139\n0\n\nBy the lemma below we see that ysΓ ∈ Sy0 for each s, almost surely, and the result\nfollows .\nFinally suppose that y. is a diffusion process with generator L. By lemma\n4.1.2 we have\nZ t\nZ t\n\u0001\nα\nMt =\nαys ◦ dys −\nδ L α (ys )ds,\n0 6 t < ζ.\n(9.4)\n0\n\n0\n\nfor any C 2 one form α. Suppose α annihilates\nS. Then if y. is along S\u0001 both the\nR.\nmartingale and finite variation parts of 0 αys ◦ dys vanish and so δ L α (ys ) = 0\nalmost surely for almost all 0 6 s < τ . If this is true for all starting points we see\nL is along S. On the other hand if L is along S and α annihilates S we see that\nM α vanishes by its characterisation in Proposition 4.1.1, Rsince σ L takes values in\n.\nS. Thus both the martingale and finite variation parts of 0 αys ◦ dys vanish, and\nso the integral itself vanishes and the diffusion processes are along S.\n\nLemma 9.3.3 Suppose z. and Λ. are semi-martingales with values in a finite dimensional vector space V and the space of linear maps L(V ; W ) of V into a finite\ndimensional vector space W , respectively. Let V0 denote the kernel of Λs which\nis assumed non-random and independent of s > 0 . Assume\nZ .\nΛs ◦ dzs = 0.\n0\n\nThen z. lies in V0 almost surely.\nProof. : We can quotient out by V0 to assume that V0 = 0, so we need to show that\nz. vanishes. Giving W an inner product, let Ps : W → Λs [V ] be the orthogonal\nprojection. Compose this with the inverse of Λs considered as taking values in\nΛs [V ], to obtain an L(W ; V )-valued semi-martingale Λ̃. formed by left inverses\nof Λ. . By the composition law for Stratonovich integrals\nZ t\nZ t\nZ t\nZ s\n\u0001\nzt =\ndzs =\nΛ̃s Λs ◦ dzs =\nΛ̃s ◦ d\nΛr ◦ dzr = 0\n(9.5)\n0\n\n0\n\n0\n\n0\n\nas required.\n\nLet Γ be a connection on S. Note that by the previous proposition any semimartingale y. which is along S has a well defined anti-development y Γ , say , which\nis a semi-martingale in Sy0 .\n\n\fCHAPTER 9. APPENDICES\n\n140\n\nDefinition 9.3.4 An M -valued semi-martingale is said to be a Γ-martingale if its\nanti-development using Γ is a local martingale.\nAlso we can make the following definition of an Ito integral of a differential form,\nusing the analogue of a characterisation by Darling, [16], for the case S = T M;\n∗\nDefinition 9.3.5 If α. is a predictable process\u0001 with\nR t values in T M, lying over our\nsemi-martingale y. , define its Ito integral, Γ 0 αs dys along the paths of y. with\nrespect to Γ by\nZ\nZ t\n\u0001 t\nΓ\nαs dys =\nαs //s dy Γ\n(9.6)\n0\n\n0\n\nwhenever the (standard) Ito integral on the right hand side exists.\n\nAs usual this Ito integral is a local martingale for all suitable integrands α. if and\nonly if the process y. is a Γ-martingale.\n\n\fBibliography\n[1] M. Arnaudon and S. Paycha. Factorisation of semi-martingales on principal\nfibre bundles and the Faddeev-Popov procedure in gauge theories. Stochastics Stochastics Rep., 53(1-2):81–107, 1995.\n[2] F. Baudoin. Conditioning and initial enlargement of filtration on a Riemannian manifold. Ann. Probab., 32(3A):2286–2303, 2004.\n[3] Fabrice Baudoin. An introduction to the geometry of stochastic flows. Imperial College Press, London, 2004.\n[4] P. Baxendale. Gaussian measures on function spaces. Amer. J. Math.,\n98(4):891–952, 1976.\n[5] P. Baxendale. Brownian motions in the diffeomorphism groups I. Compositio Math., 53:19–50, 1984.\n[6] Ya. I. Belopolskaya and Yu. L. Dalecky. Stochastic equations and differential\ngeometry, volume 30 of Mathematics and its Applications (Soviet Series).\nKluwer Academic Publishers Group, Dordrecht, 1990. Translated from the\nRussian.\n[7] L. Bérard-Bergery and J.-P. Bourguignon. Laplacians and Riemannian submersions with totally geodesic fibres. Illinois J. Math., 26(2):181–200, 1982.\n[8] E. Berger, R. Bryant, and P. Griffiths. The Gauss equations and rigidity of\nisometric embeddings. Duke Math. J., 50(3):803–892, 1983.\n[9] Jean-Michel Bismut. Large deviations and the Malliavin calculus, volume 45 of Progress in Mathematics. Birkhäuser Boston Inc., Boston, MA,\n1984.\n141\n\n\f142\n\nBIBLIOGRAPHY\n\n[10] Hermann Boerner. Representations of groups. With special consideration for\nthe needs of modern physics. Translated from the German by P. G. Murphy in\ncooperation with J. Mayer-Kalkschmidt and P. Carr. Second English edition.\nNorth-Holland Publishing Co., Amsterdam, 1970.\n[11] Z. Brzeźniak and K. D. Elworthy. Stochastic differential equations on Banach manifolds. Methods Funct. Anal. Topology, 6(1):43–84, 2000.\n[12] A. Carverhill. Conditioning a lifted stochastic system in a product space.\nAnn. Probab., 16(4):1840–1853, 1988.\n[13] A. P. Carverhill and K. D. Elworthy. Flows of stochastic dynamical systems:\nthe functional analytic approach. Z. Wahrsch. Verw. Gebiete, 65(2):245–267,\n1983.\n[14] Michael Cranston and Yves Le Jan. Asymptotic curvature for stochastic\ndynamical systems. In Stochastic dynamics (Bremen, 1997), pages 327–338.\nSpringer, New York, 1999.\n[15] H. L. Cycon, R. G. Froese, W. Kirsch, and B. Simon. Schrödinger operators\nwith application to quantum mechanics and global geometry. Texts and\nMonographs in Physics. Springer-Verlag, Berlin, study edition, 1987.\n[16] R. W. R. Darling. Approximating Ito integrals of differential forms and\ngeodesic deviation. Z. Wahrsch. Verw. Gebiete, 65(4):563–572, 1984.\n[17] B. K. Driver. A Cameron-Martin type quasi-invariance theorem for Brownian motion on a compact Riemannian manifold. J. Functional Analysis,\n100:272–377, 1992.\n[18] T. E. Duncan. Some filtering results in Riemann manifolds. Information and\nControl, 35(3):182–195, 1977.\n[19] A. Eberle. Uniqueness and non-uniqueness of semigroups generated by singular diffusion operators, volume 1718 of Lecture Notes in Mathematics.\nSpringer-Verlag, Berlin, 1999.\n[20] D. G. Ebin and J. Marsden. Groups of diffeomorphisms and the motion of\nan incompressible fluid. Ann. Math., pages 102–163, 1970.\n[21] K. D. Elworthy. Stochastic Differential Equations on Manifolds. LMS Lecture Notes Series 70, Cambridge University Press, 1982.\n\n\fBIBLIOGRAPHY\n\n143\n\n[22] K. D. Elworthy. Geometric aspects of diffusions on manifolds. In P. L. Hennequin, editor, Ecole d'Eté de Probabilités de Saint-Flour XV-XVII, 19851987. Lecture Notes in Mathematics 1362, volume 1362, pages 276–425.\nSpringer-Verlag, 1988.\n[23] K. D. Elworthy. Stochastic flows on Riemannian manifolds. In Diffusion\nprocesses and related problems in analysis, Vol. II (Charlotte, NC, 1990),\nvolume 27 of Progr. Probab., pages 37–72. Birkhäuser Boston, Boston, MA,\n1992.\n[24] K. D. Elworthy and W. S. Kendall. Factorization of harmonic maps and\nBrownian motions. In From local times to global geometry, control and\nphysics (Coventry, 1984/85), Pitman Res. Notes Math. Ser., 150, pages 75–\n83. Longman Sci. Tech., Harlow, 1986.\n[25] K. D. Elworthy, Y. Le Jan, and Xue-Mei Li. Equivariant diffusions on principal bundles. In Stochastic analysis and related topics in Kyoto, volume 41\nof Adv. Stud. Pure Math., pages 31–47. Math. Soc. Japan, Tokyo, 2004.\n[26] K. D. Elworthy, Y. LeJan, and Xue-Mei Li. Concerning the geometry\nof stochastic differential equations and stochastic flows. In 'New Trends\nin stochastic Analysis', Proc. Taniguchi Symposium, Sept. 1994, Charingworth, ed. K. D. Elworthy and S. Kusuoka, I. Shigekawa. World Scientific\nPress, 1996.\n[27] K. D. Elworthy, Y. LeJan, and Xue-Mei Li. On the geometry of diffusion operators and stochastic flows, Lecture Notes in Mathematics 1720. Springer,\n1999.\n[28] K. D. Elworthy and S. Rosenberg. Homotopy and homology vanishing theorems and the stability of stochastic flows. Geom. Funct. Anal., 6(1):51–78,\n1996.\n[29] K. D. Elworthy and M. Yor. Conditional expectations for derivatives of certain stochastic flows. In J. Azéma, P.A. Meyer, and M. Yor, editors, Sem.\nde Prob. XXVII. Lecture Notes in Maths. 1557, pages 159–172. SpringerVerlag, 1993.\n[30] K. David Elworthy. The space of stochastic differential equations. In\nStochastic analysis and applications, volume 2 of Abel Symp., pages 327–\n337. Springer, Berlin, 2007.\n\n\f144\n\nBIBLIOGRAPHY\n\n[31] M. Émery. Stochastic calculus in manifolds. Universitext. Springer-Verlag,\nBerlin, 1989. With an appendix by P.-A. Meyer.\n[32] A. Estrade, M. Pontier, and P. Florchinger. Filtrage avec observation discontinue sur une variété. Existence d'une densité régulière. Stochastics Stochastics Rep., 56(1-2):33–51, 1996.\n[33] Maria Falcitelli, Stere Ianus, and Anna Maria Pastore. Riemannian submersions and related topics. World Scientific Publishing Co. Inc., River Edge,\nNJ, 2004.\n[34] M. Freidlin. Functional integration and partial differential equations, volume 109 of Annals of Mathematics Studies. Princeton University Press,\nPrinceton, NJ, 1985.\n[35] Zhong Ge. Betti numbers, characteristic classes and sub-Riemannian geometry. Illinois J. Math., 36(3):372–403, 1992.\n[36] Mikhael Gromov. Carnot-Carathéodory spaces seen from within. In\nSub-Riemannian geometry, volume 144 of Progr. Math., pages 79–323.\nBirkhäuser, Basel, 1996.\n[37] Robert Hermann. A sufficient condition that a mapping of Riemannian manifolds be a fibre bundle. Proc. Amer. Math. Soc., 11:236–242, 1960.\n[38] J. E. Humphreys. Introduction to Lie algebras and representation theory,\nvolume 9 of Graduate Texts in Mathematics. Springer-Verlag, New York,\n1978. Second printing, revised.\n[39] N. Ikeda and S. Watanabe. Stochastic Differential Equations and Diffusion\nProcesses , second edition. North-Holland, 1989.\n[40] S. Kobayashi and K. Nomizu. Foundations of differential geometry, Vol. I.\nInterscience Publishers, 1969.\n[41] S. Kobayashi and K. Nomizu. Foundations of differential geometry, Vol. II.\nInterscience Publishers, 1969.\n[42] I. Kolář, P. W. Michor, and J. Slovák. Natural operations in differential\ngeometry. Springer-Verlag, Berlin, 1993.\n\n\fBIBLIOGRAPHY\n\n145\n\n[43] Hiroshi Kunita. Stochastic flows and stochastic differential equations, volume 24 of Cambridge Studies in Advanced Mathematics. Cambridge University Press, Cambridge, 1990.\n[44] Joan-Andreu Lazaro-Cami and Juan-Pablo Ortega. Reduction, reconstruction, and skew-product decomposition of symmetric stochastic differential\nequations. arXiv:0705.3156v2 [math.PR].\n[45] Remi Leandre. Applications of the Malliavin calculus of Bismut type without probability. WSEAS Trans. Math., 5(11):1205–1210, 2006.\n[46] S. Lemaire. Invariant jets of a smooth dynamical system. Bull. Soc. Math.\nFrance, 129(3):379–448, 2001.\n[47] Xue-Mei Li. Stochastic differential equations on noncompact manifolds:\nmoment stability and its topological consequences. Probab. Theory Related\nFields, 100(4):417–428, 1994.\n[48] M. Liao. Factorization of diffusions on fibre bundles. Trans. Amer. Math.\nSoc., 311(2):813–827, (1989).\n[49] Ming Liao. Decomposition of stochastic flows and Lyapunov exponents.\nProbab. Theory Related Fields, 117(4):589–607, 2000.\n[50] Henry P. McKean. Stochastic integrals. AMS Chelsea Publishing, Providence, RI, 2005. Reprint of the 1969 edition, with errata.\n[51] P. W. Michor. Gauge theory for fiber bundles, volume 19 of Monographs and\nTextbooks in Physical Science. Lecture Notes. Bibliopolis, Naples, 1991.\n[52] Richard Montgomery. A tour of subriemannian geometries, their geodesics\nand applications, volume 91 of Mathematical Surveys and Monographs.\nAmerican Mathematical Society, Providence, RI, 2002.\n[53] M. S. Narasimhan and S. Ramanan. Existence of universal connections.\nAmerican J. Math., 83, 1961.\n[54] O. A. Oleı̆nik. On linear equations of the second order with a non-negative\ncharacteristic form. Mat. Sb. (N.S.), 69 (111):111–140, 1966.\n[55] Barrett O'Neill. The fundamental equations of a submersion. Michigan\nMath. J., 13:459–469, 1966.\n\n\f146\n\nBIBLIOGRAPHY\n\n[56] E. Pardoux. Nonlinear filtering, prediction and smoothing. In Stochastic systems: the mathematics of filtering and identification and applications (Les\nArcs, 1980), volume 78 of NATO Adv. Study Inst. Ser. C: Math. Phys. Sci.,\npages 529–557. Reidel, Dordrecht, 1981.\n[57] Étienne Pardoux. Filtrage non linéaire et équations aux dérivées partielles\nstochastiques associées. In École d'Été de Probabilités de Saint-Flour XIX-\n1989, volume 1464 of Lecture Notes in Math., pages 67–163. Springer,\nBerlin, 1991.\n[58] E. J. Pauwels and L. C. G. Rogers. Skew-product decompositions of Brownian motions. In Geometry of random motion (Ithaca, N.Y., 1987), volume 73\nof Contemp. Math., pages 237–262. Amer. Math. Soc., 1988.\n[59] Monique Pontier and Jacques Szpirglas. Filtering with observations on a\nRiemannian symmetric space. In Stochastic differential systems (Bad Honnef, 1985), volume 78 of Lecture Notes in Control and Inform. Sci., pages\n316–329. Springer, Berlin, 1986.\n[60] D. Quillen. Superconnection character forms and the Cayley transform.\nTopology, 27(2):211–238, 1988.\n[61] Michael Reed and Barry Simon. Methods of modern mathematical physics.\nI. Academic Press Inc. [Harcourt Brace Jovanovich Publishers], New York,\nsecond edition, 1980. Functional analysis.\n[62] Daniel Revuz and Marc Yor. Continuous martingales and Brownian motion,\nvolume 293 of Grundlehren der Mathematischen Wissenschaften [Fundamental Principles of Mathematical Sciences]. Springer-Verlag, Berlin, third\nedition, 1999.\n[63] L. C. G. Rogers and D. Williams. Diffusions, Markov processes, and martingales. Vol. 2. Cambridge Mathematical Library. Cambridge University\nPress, Cambridge, 2000.\n[64] S. Rosenberg. The Laplacian on a Riemannian manifold, volume 31 of London Mathematical Society Student Texts. Cambridge University Press, Cambridge, 1997. An introduction to analysis on manifolds.\n[65] Paulo R. C. Ruffino. Decomposition of stochastic flows and rotation matrix.\nStoch. Dyn., 2(1):93–107, 2002.\n\n\fBIBLIOGRAPHY\n\n147\n\n[66] D. Stroock and S. R. S. Varadhan. On degenerate elliptic-parabolic operators\nof second order and their associated diffusions. Comm. Pure Appl. Math.,\n25:651–713, 1972.\n[67] D. W. Stroock. Lectures on stochastic analysis: diffusion theory, volume 6\nof London Mathematical Society Student Texts. Cambridge University Press,\nCambridge, 1987.\n[68] D. W. Stroock and S. R. S. Varadhan. Multidimensional diffusion processes,\nvolume 233 of Grundlehren der Mathematischen Wissenschaften [Fundamental Principles of Mathematical Sciences]. Springer-Verlag, Berlin, 1979.\n[69] H. J. Sussmann. Orbits of families of vector fields and integrability of distributions. Trans. Amer. Math. Soc., 180:171–188, 1973.\n[70] Kazuaki Taira. Diffusion processes and partial differential equations. Academic Press Inc., Boston, MA, 1988.\n[71] B Tsirelson. Filtrations of random processes in the light of classification\ntheory. (i). a topological zero-one law. arXiv:math.PR/0107121, 2001.\n\n\fIndex\nGLM, 42\nD ′ (x), 32\nD 0 (x), 32\nΓ-martingale, 89, 140\ncohesive\ndescends, 28\nconnection\nLW, 45\nadjoint\nsemi-connection, 41\nalong S\ndiffusion operator, 14\nsemi-martingale, 138\n\nderivative\nflow, 46\ndevelopment\nstochastic, 138\ndiffusion\nmeasure, 59\noperator, 11\ndistribution, 14\nregular, 15\nDuncan-Mortensen-Zakai equation, 85\nflow\nderivative, 44, 45, 48, 81\ngradient, 46\nholonomy, 33\nof isometries, 48\nof SDE, 44\nstochastic, 119\nframe bundle, 42\n\nconnection\ncomplete, 32\nLevi-Civita, 45\nLW, 41\nsemi-, 21\nGradient Brownian\nstochastically complete, 102\nSDE, 45\nstrongly stochastically complete, 102\nconnections\nHörmander\ndetermined by stochastic flows, 117\ncondition, 106, 109, 110\ncurvature\nform, 4, 23, 24, 26, 41, 50, 55, 97,\nform, 37\n98, 104, 108, 109, 126, 137\nrepresentation, 12\noperator, 42, 57\nHeisenberg group, 27\nparallel, 111\nRicci, 42, 46, 56\nholonomy group, 37\nWeitzenböck, 48, 52, 54, 57\nhorizontal, 17\n148\n\n\fINDEX\ninnovations process, 88\nKallianpur-Striebel formula, 85\nLW connection, 41\noperator\ncurvature, 42\ndiffusion, 11\nsemi-elliptic, 11\nsymbol, 11\nreproducing kernel, 120, 125\nsecond fundamental form, 45\nsemi-elliptic, 11\nshape operator, 45\nstochastic partial differential equation,\n93\nsymbol, 11\nprojectible, 22\nvertical, 17\n\n149\n\n\f"}