{"id": "http://arxiv.org/abs/1006.5245v1", "guidislink": true, "updated": "2010-06-27T22:32:37Z", "updated_parsed": [2010, 6, 27, 22, 32, 37, 6, 178, 0], "published": "2010-06-27T22:32:37Z", "published_parsed": [2010, 6, 27, 22, 32, 37, 6, 178, 0], "title": "The effect of disorder on electronic Raman scattering in the\n  superconducting state of iron pnictides", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1006.0132%2C1006.4289%2C1006.1765%2C1006.4539%2C1006.2605%2C1006.0171%2C1006.4322%2C1006.2623%2C1006.5133%2C1006.1686%2C1006.1811%2C1006.3437%2C1006.3140%2C1006.2363%2C1006.3648%2C1006.2853%2C1006.0148%2C1006.1151%2C1006.4846%2C1006.0263%2C1006.2496%2C1006.4941%2C1006.2098%2C1006.0874%2C1006.4516%2C1006.5245%2C1006.1940%2C1006.2774%2C0901.3401%2C0901.2188%2C0901.1447%2C0901.1490%2C0901.2424%2C0901.0274%2C0901.2412%2C0901.0774%2C0901.4438%2C0901.1936%2C0901.4975%2C0901.2688%2C0901.3931%2C0901.2992%2C0901.0938%2C0901.1684%2C0901.3501%2C0901.0802%2C0901.4948%2C0901.1694%2C0901.4870%2C0901.0588%2C0901.4449%2C0901.2755%2C0901.3919%2C0901.0070%2C0901.0618%2C0901.2337%2C0901.3708%2C0901.1737%2C0901.3548%2C0901.4776%2C0901.1996%2C0901.3476%2C0901.4713%2C0901.0377%2C0901.1952%2C0901.1527%2C0901.3200%2C0901.0906%2C0901.4516%2C0901.0075%2C0901.2768%2C0901.0880%2C0901.3538%2C0901.1739%2C0901.1036%2C0901.1745%2C0901.3526%2C0901.3166%2C0901.1294%2C0901.0153%2C0901.0021%2C0901.3450%2C0901.4431%2C0901.4204%2C0901.2889%2C0901.3614%2C0901.3756%2C0901.2466%2C0901.4004%2C0901.2562%2C0901.4215%2C0901.1262%2C0901.2189%2C0901.4530%2C0901.3475%2C0901.1594%2C0901.2260%2C0901.3255%2C0901.0674%2C0901.4619%2C0901.2391&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "The effect of disorder on electronic Raman scattering in the\n  superconducting state of iron pnictides"}, "summary": "Electronic Raman scattering measures a polarization-dependent scattering\nintensity which can provide information about the location of nodes in the\nenergy gap of an unconventional superconductor as well as its overall symmetry.\nIn this paper, we calculate the Raman intensity in the presence of disorder for\nseveral models of the iron pnictide superconducting state. We include, for\ncompleteness, $d$-wave and isotropic $s_\\pm$ responses in addition to more\nrealistic extended $s_\\pm$ superconducting gaps. The effect of disorder is\nmodeled using a self-consistent $T$-matrix approximation, and is studied in the\nlimits of isotropic and intraband-only scattering. We show how recent\nexperiments on Ba(Fe$_{1-x}$Co$_x$)$_2$As$_2$ may be consistent with \"node\nlifting\" by intraband disorder.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1006.0132%2C1006.4289%2C1006.1765%2C1006.4539%2C1006.2605%2C1006.0171%2C1006.4322%2C1006.2623%2C1006.5133%2C1006.1686%2C1006.1811%2C1006.3437%2C1006.3140%2C1006.2363%2C1006.3648%2C1006.2853%2C1006.0148%2C1006.1151%2C1006.4846%2C1006.0263%2C1006.2496%2C1006.4941%2C1006.2098%2C1006.0874%2C1006.4516%2C1006.5245%2C1006.1940%2C1006.2774%2C0901.3401%2C0901.2188%2C0901.1447%2C0901.1490%2C0901.2424%2C0901.0274%2C0901.2412%2C0901.0774%2C0901.4438%2C0901.1936%2C0901.4975%2C0901.2688%2C0901.3931%2C0901.2992%2C0901.0938%2C0901.1684%2C0901.3501%2C0901.0802%2C0901.4948%2C0901.1694%2C0901.4870%2C0901.0588%2C0901.4449%2C0901.2755%2C0901.3919%2C0901.0070%2C0901.0618%2C0901.2337%2C0901.3708%2C0901.1737%2C0901.3548%2C0901.4776%2C0901.1996%2C0901.3476%2C0901.4713%2C0901.0377%2C0901.1952%2C0901.1527%2C0901.3200%2C0901.0906%2C0901.4516%2C0901.0075%2C0901.2768%2C0901.0880%2C0901.3538%2C0901.1739%2C0901.1036%2C0901.1745%2C0901.3526%2C0901.3166%2C0901.1294%2C0901.0153%2C0901.0021%2C0901.3450%2C0901.4431%2C0901.4204%2C0901.2889%2C0901.3614%2C0901.3756%2C0901.2466%2C0901.4004%2C0901.2562%2C0901.4215%2C0901.1262%2C0901.2189%2C0901.4530%2C0901.3475%2C0901.1594%2C0901.2260%2C0901.3255%2C0901.0674%2C0901.4619%2C0901.2391&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Electronic Raman scattering measures a polarization-dependent scattering\nintensity which can provide information about the location of nodes in the\nenergy gap of an unconventional superconductor as well as its overall symmetry.\nIn this paper, we calculate the Raman intensity in the presence of disorder for\nseveral models of the iron pnictide superconducting state. We include, for\ncompleteness, $d$-wave and isotropic $s_\\pm$ responses in addition to more\nrealistic extended $s_\\pm$ superconducting gaps. The effect of disorder is\nmodeled using a self-consistent $T$-matrix approximation, and is studied in the\nlimits of isotropic and intraband-only scattering. We show how recent\nexperiments on Ba(Fe$_{1-x}$Co$_x$)$_2$As$_2$ may be consistent with \"node\nlifting\" by intraband disorder."}, "authors": ["G. R. Boyd", "P. J. Hirschfeld", "T. P. Devereaux"], "author_detail": {"name": "T. P. Devereaux"}, "author": "T. P. Devereaux", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1103/PhysRevB.82.134506", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1006.5245v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1006.5245v1", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "cond-mat.supr-con", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cond-mat.supr-con", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "cond-mat.str-el", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1006.5245v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1006.5245v1", "arxiv_comment": null, "journal_reference": "Phys. Rev. B 82, 134506 (2010)", "doi": "10.1103/PhysRevB.82.134506", "fulltext": "The effect of disorder on electronic Raman scattering in the superconducting state of\niron pnictides\nG. R. Boyd,1 P. J. Hirschfeld,1 and T.P.Devereaux2\n1\n\narXiv:1006.5245v1 [cond-mat.supr-con] 27 Jun 2010\n\nDepartment of Physics, University of Florida, Gainesville, FL 32611, USA\n2\nStanford Institute for Materials and Energy Science,\nSLAC National Accelerator Laboratory, Menlo Park, CA 94025,\nUSA and Geballe Lab for Advanced Materials, Stanford University, Stanford, CA 94305, USA\nElectronic Raman scattering measures a polarization-dependent scattering intensity which can\nprovide information about the location of nodes in the energy gap of an unconventional superconductor as well as its overall symmetry. In this paper, we calculate the Raman intensity in the\npresence of disorder for several models of the iron pnictide superconducting state. We include, for\ncompleteness, d-wave and isotropic s± responses in addition to more realistic extended s± superconducting gaps. The effect of disorder is modeled using a self-consistent T -matrix approximation, and\nis studied in the limits of isotropic and intraband-only scattering. We show how recent experiments\non Ba(Fe1−x Cox )2 As2 may be consistent with \"node lifting\" by intraband disorder.\nPACS numbers:\n\nI.\n\nINTRODUCTION\n\nElectronic Raman scattering is sensitive to low-lying\nexcitations and can be performed for various polarizations of the incoming and outgoing photons. This\npolarization dependence preferentially samples different\nparts of the Brillouin zone, making Raman scattering\nan important tool with which to clarify the location\nof nodes and the symmetry of the gap in the superconducting state1 . Muschler et al.2 have recently performed Raman scattering measurements on single crystals of Ba(Fe1−x Cox )2 As2 (122) for two different concentrations of Co. The data demonstrate the existence\nof low energy quasiparticle excitations in the superconducting state. These quasiparticles could be a result of\npairbreaking effects or due to the presence of nodes in\nthe superconducting gap. In this paper we study the\npolarization dependent electronic Raman response in the\npresence of disorder in order to distinguish between these\ntwo possibilities.\nThus far, other experimental probes have not presented a convincing determination of a universal gap\nstructure in the Fe-pnictides3,4 . This may be due to\nvariations in sample quality and resolutions issues of different measurement techniques, but there is increasing\nspeculation that these systems may possess a strong sensitivity of both the electronic structure and the pair state\nto small changes which affect electronic structure5 . This\nis because the Fermi surface consists of several nearly\ncompensated electron and hole pockets, and because the\npairing state is probably of an extended-s type which may\npossess \"accidental\" nodes or deep minima, i.e. structures depending on the details of the pairing interaction\nrather than the symmetry class. Nuclear magnetic resonance (NMR) studies6–9 showed a T 3 spin lattice relaxation rate reminiscent of a gap with nodes. ARPES measurements on single crystals of 122-type materials10–15\nmeasured the gap reporting isotropic or nearly isotropic\n\ngaps on all Fermi surface sheets. Penetration depth\nmeasurements16–22 have been fit both to an activated T dependence, indicative of a fully gapped state, and low-T\npower laws, indicative of nodes in the superconducting\ngap. It is possible that these differences reflect genuinely\ndifferent ground states in different materials due to intrinsic differences in the pairing, but it is important to\ndisentangle these effects from those which arise from disorder, and in particular to distinguish between a disordered fully gapped state and a nodal state.\nA popular candidate for the ground state of ferropnictides is the so-called s± state proposed by Mazin et\nal.23 . In this state, found within a simple spin fluctuation\nmodel with strong interband scattering between nearly\nnested electron and hole pockets, the gap is isotropic on\nboth electron and hole pockets but with a sign change\nbetween the two. Further theoretical work5,24–29 considered spin fluctuation pairing using band structures derived from tight binding fits to density functional theory\nresults, and found s± -type states with highly anisotropic\ngaps, particularly on the electron sheets. We refer to\nthis general class of states, which are in the same symmetry class as ordinary s-wave and isotropic s± states,\nas \"extended-s\" states here. These calculations also reported the near degeneracy of d-wave gaps in certain situations. The effect of nonmagnetic disorder on an s± ,\nd-wave, and nodal extended-s is different and thus may\nhelp narrow the field of candidate superconducting gaps.\nIn particular, it has been shown that for the accidental\nnodes of an extended s-wave state, intraband disorder\ncan 'lift' the nodes, resulting in a fully-gapped state30 .\nOn the other hand, if disorder is of the interband type,\nlow-energy impurity midgap states can be created31–35\nsimilar to Yu-Shiba states due to magnetic impurities in\nordinary superconductors.\nOne complication is that changing the doping does not\nhave the simple effect of creating more point-like disorder. To what extent a dopant is charged or magnetic,\nlong or short ranged, and what changes it makes in band\n\n\f2\nstructure upon doping requires careful study36,37 and is\ndifficult to include consistently in a theory capable of\ncalculating observable quantities. In the most naive approach, we will consider doping as loosely related to the\nconcentration of scatterers in the sense that higher doping is a dirtier sample, with the caveat that effects on\nthe electronic structure and pair interaction may also be\npresent. Here we report the results of a calculation of the\nRaman intensity for s± , d-wave, and experimentally inspired extended s-wave superconducting gaps, including\ndisorder using a self-consistent T-matrix approximation\n(SCTMA). We show that for unitary scatterers, intraband scattering will average the gap and 'lift' the nodes\nof an extended s-wave state, leaving a fully developed gap\nfor higher scattering rates due to disorder. When a strong\ninterband scattering component is present, the creation\nof an impurity band competes with the tendency to lift\nthe accidental gap nodes. In contrast to the extended-s\nscenario, in an isotropic s± model, disorder causes the\ncreation of low energy quasiparticles mimicking power\nlaw behavior of nodal states for some probes. One important difference between such a sign-changing isotropic\nstate and a nodal extended-s state, then, is that the addition of disorder fills in the gap as opposed to possibly\ncreating it.\nThe form of the Raman spectrum will be influenced\nadditionally by inelastic scattering processes. We expect\nthese to be largely frozen out in the superconducting\nstate at low energies, but they will be important for a\nproper treatment of the normal state spectrum and for\nenergies near the maximum gap. Effects of this type will\nbe treated elsewhere.38\nOur paper is organized as follows: in the first section\nwe describe the theoretical background necessary to undertake this study. In the next section, we describe simple one and two band results for the d-wave and s± cases\nto help ground our understanding. Finally, we show the\nresults from studying anisotropic s-wave gaps on all four\nFermi sheets which we suggest captures all the essential\nqualitative features of the real Co-doped 122s.\nII.\n\nTHEORY OF ELECTRONIC RAMAN\nSCATTERING WITH DISORDER\n\nRaman scattering is the inelastic scattering of polarized light from a material (for a review see Ref.1). The\ncross section of the scattered light is proportional to39\nωsctr e2\n1\n[1 + nB (ω)] Imχγ,γ\nωinc mc2\nπ\n\nSγ,γ =\nwhere\nχγ,γ (ω) =\n\nHere χγ,γ is the Raman effective density-density correlation function for symmetry channel γ. The vertex, γk ,\naccounts for the interaction of polarized light with charge\ndensity. The expression for the Raman effective density\nP\nis ρ = k γk c†k,σ ck,σ . The full matrix Green's function\nin the presence of scattering in the superconducting state\nis\nG(k, ω) =\n\nω̃τ0 + ǫ ̃k τ3 + ∆ ̃k τ1\n2 ,\nω̃ 2 − ǫ ̃k 2 − ∆ ̃k\n\nwhere ω̃ ≡ ω − Σ0 , ǫ ̃k ≡ ǫk + Σ3 , ∆ ̃k ≡ ∆k + Σ1 , and the\nΣα are the components of the disorder self-energy proportional to the Pauli matrices τα in particle-hole (Nambu)\nspace.\nGenerally, the vertex is determined by both density\nand current matrix elements between the conduction\nband and the excited states. However, in situations\nwhere one is interested in qualitative results like the\npresent one, model Raman vertices classified by symmetry can be employed. For a crystal with D4h tetragonal\nsymmetry, in-plane charge fluctuations transform according to the full symmetry of the lattice (irreducible representation A1g ), and do not change sign upon 90 degree\nrotation, or lower symmetry, as opposed to the B1g and\nB2g symmetry classes which change sign. Raman scattering probes long wavelength charge fluctuations. The\nB1g and B2g charge densities must average to zero within\neach unit cell, and are not coupled via the long-range\nCoulomb interaction. Thus the B1g and B2g Raman responses for a multi-band system consist of the sum of the\ncontributions from each band. However, A1g fluctuations\nneed not vanish over the unit cell, and therefore they can\ncouple to isotropic charge density, giving rise the finite\nbackflow. Therefore vertex corrections of both Coulomb\nand impurity type must be included in the A1g channel,\nwhich therefore becomes extremely difficult to treat consistently with disorder. We do not treat this polarization\nchannel in this work. Finally, we neglect direct interband and resonant contributions to the Raman vertices.\nIn this approximation, the vertex for Raman scattering\nmeasures the effective mass around the FS. We use the\nnotation that ~e is a polarization vector.\nγk = m\n\nX\nab\n\nea\n\n∂ 2ǫ\neb\n∂ka ∂kb\n\nIn a square lattice the B1g and B2g polarizations, the\nvertices can be expanded as:\nB1g : γk = cos(kx ) − cos(ky )\nand\n\nZ\n\nβ\n\ndτ e−iωm τ hTτ ρ̃γ (τ )ρ̃γ (0)i |iωm →w+iδ , (1)\n\n0\n\nand\nχ(q → 0) = T\n\nXX\nn\n\nk\n\nT r(γk2 τ3 G(k, iωn )τ3 G(k, iωn +iΩm ))\n\nB2g : γk = sin(kx ) sin(ky )\nwhich along a circular Fermi surface become cos(2θ) and\nsin(2θ), respectively. It should be noted here that in the\niron-pnictides use of the 1-Fe vs. the 2-Fe Brillouin zone\nwill interchange B1g and B2g symmetries.\n\n\f3\nTo include the effect of disorder we self-consistently\nsolve for the self energies by including all scatterings off\na single impurity and performing a disorder average. This\nis represented diagrammatically in Fig. 1. The T -matrix\ncan be defined as\nG = G0 + G0 T G0 + * * *\n\n(2)\n\nAfter solving for the self-energies, we insert them into\nthe general expression for the Raman response. Beginning with a spectral representation:\n\u0013\n\u0012\nZ\n−1 ImG(k, x)\nG(k, iωn ) = dx\nπ\niωn − x\nwe arrive at a zero-temperature long-wavelength form,\nImχγ,γ (Ω) =\n\nXZ\nk\n\n0\n\n1\ndx γk2 T r[ImG(k, x)τ3 ImG(k, x+Ω)τ3 ].\nπ\n−Ω\n\nIn terms of retarded and advanced Green's functions,\nR\n−GA\nImG = G 2i\n:\nFIG. 1: Diagrams representing the self-consistent T-matrix\napproximation (SCTMA). The dashed lines are scattering off\nan impurity, and the single line is the self-consistent green's\nfunction.\n\nUsing the Nambu notation, the single-particle self energy in a superconductor can be decomposed as:\nX\nΣ̃(k, ω) =\nΣα (k, ω)τ̃α ,\n(3)\nα\n\nwhere τ̃α are the Pauli matrices and τ̃0 is the unit matrix. Note that the band index is implicitly contained in\nthe k index since we restrict pairing to individual Fermi\nsurface sheets. Treating impurity-scattering in T-matrix\napproximation gives rise to the following self-energy\nΣ̃(k, ω) = ni T̃kk (ω),\n\n(4)\n\nwhere ni is the impurity concentration and Tkk (ω) is the\ndiagonal element of the T-matrix\nX\nT̃kk′ (ω) = Vkk′ τ̃3 +\nVkk′′ τ̃3 G̃(k′′ , ω)T̃k′′ k′ (ω) . (5)\nk′′\n\nWe define\nΓ=\n\nni n\nπN0\n\nwhere ni is the density of impurities, n of electrons, and\nN0 the density of states at the fermi level. For a constant\npotential, the case which we will consider in this paper,\nthis expression becomes the series:\nXX\nΣ̃(ω) = ni V0 τ̃3\n(\nG(k′ , ω)V0 τ̃3 )n\nn\n\nk′\n\nLater we will restrict Vkk′′ to be constant for particular sets of momenta, either to allow transitions between\nall the Fermi sheets or to restrict transitions to remain\nwithin Fermi sheets.\nThe self-energy Σ̃(k, ω) has to be solved selfconsistently in combination with the single-particle\nGreen's function\nG̃(k, ω)−1 = G̃0 (k, ω)−1 − Σ̃(ω).\n\n(6)\n\nImχγ,γ (Ω) =\n\n1\nhN (φ)Im\n4π\n\nZ\n\ndξγφ2\n\nZ\n\nΩ\n\ndx\n\n0\n\n[F RR (x − Ω, x) − F RA (x − Ω, x)\n−F AR (x − Ω, x) + F AA (x − Ω, x)]iφ\nwhere\nF a,b = T r[Ga (k, x − Ω)τ3 Gb (k, x)τ3 ] a, b = A, R\nWe have taken N (φ) = N0 in this paper. The angular\nbrackets denote an average over the angle φ around the\nFermi surfaces.\nWe note here that for crossed polarizations selected\nB1g and B2g channels, the Raman response is additive for a many-sheeted Fermi surface. We also note\nthat in the present approach we have neglected T -matrix\nimpurity vertex corrections for the Raman response.\nWhile for general momentum-dependent Tk,k′ , impurity vertex corrections are necessary for all channels,\nfor momentum-independent scattering vertex corrections\ndo not essentially modify the response for B1g and B2g\npolarizations39.\nIII.\n\nRAMAN SCATTERING FOR DIRTY\nd-WAVE AND s± -WAVE CASES\n\nFirst we present results for d-wave and s± -wave superconducting gaps. Early on, the s± was proposed as a\ncandidate for the gap structure in the iron-pnictides23 .\nIndeed, for certain materials parameters, in particular\nthe case where a Fermi surface pocket at (π, π) appears,\nthis state is crudely consistent with multiorbital spinfluctuation calculations5,24–29 . The qualitative features\nof the Raman response for such a state can be understood from a minimal two-Fermi-sheet model.\nNMR and penetration depth measurements in some\nFe-pnictide materials displayed power-law temperature\ndependences suggestive of nodes in a single band\nmodel6–9,16–22 . The phenomenology was similar to what\n\n\f4\ners, a low-energy impurity band is created in the density\nof states, show in Fig. 2. The clean Raman response\nsimply reflects two clean s-wave gaps with a sharp gap\nedge at 2∆0 . Note the line-shape in a fully gapped superconductor. This qualitative feature seems differs from a\nnodal superconductors's line-shape, which still possesses\na peak, only more symmetric about the center energy at\n2∆0 . One can understand the features in the Raman response as crudely similar to a convolution of the density\nof states with itself, so the effect of the impurity band on\nthe Raman response is to create a nonzero threshold at\nω < 2∆0 , as shown in Fig. 3, corresponding to transitions between the impurity band and the gap edge. There\nis, in addition, a very small contribution from scattering\nwithin the impurity band itself at low energies (see insert\nFig. 3).\n\nΓ= 0.001∆0\nΓ= 0.01∆0\nΓ= 0.05∆0\nΓ= 0.1∆0\n\n3.5\n3\n\nN(ω)/N0\n\n2.5\n2\n1.5\n1\n0.5\n0\n0\n\n0.5\n\n1\nω / ∆0\n\n1.5\n\n2\n\nFIG. 2: (Color online) Quasiparticle density of states N (ω)\nfor isotropic s± state, normalized to normal state density of\nstates N0 vs. ω/∆0 , where ±∆0 is the value of the gap on\nhole and electron sheets. N0 is assumed constant on all Fermi\nsheets. Shown are various interband impurity scattering rates\nΓ in units of ∆0 .\n\n4\n\nΓ=0.0∆0\nΓ=.01∆0\nΓ=.05∆0\nΓ=.2∆0\n\n2.5\n2\n1.5\n1\n\nΓ= 0.001∆0\nΓ= 0.01∆0\nΓ= 0.05∆0\nΓ= 0.1∆0\n\n3.5\n3\n\n0.5\n\n2.5\nIm χ\n\n3\n\nN/ ( N0)\n\n4\n\n0\n0\n\n0.05\n0.04\n0.03\n0.02\n0.01\n0\n\n2\n1.5\n1\n0.5\n\n0.3\n\n0.6\n\n0.5\n\n1\n\n1.5\n\n2\n2.5\nω / ∆0\n\n3\n\n3.5\n\n4\n\nFIG. 4: (Color online) Density of states N (ω)/∆0 vs. energy ω/∆0 for a d-wave superconductor for various values of\nscattering rate Γ/∆0 in unitarity limit.\n\n0.9\n\n0\n-0.5\n0\n\n0.5\n\n1\n\n1.5\nω / ∆0\n\n2\n\n2.5\n\n3\n\nFIG. 3: (Color online) Raman response Im χ(ω) vs. ω/∆ for\nboth B1g and B2g polarizations for an s± state as in Fig. 2\nfor various interband impurity scattering rates Γ, in units of\n∆.\n\nwas seen in cuprates, so it is useful to include a study of\nthe d-wave case for comparison, to how the presence of\na node in the superconducting gap manifests itself in the\nRaman response. The d-wave Raman response has been\npreviously studied, for example in Refs. 40 39, and 43.\nWe first consider the s± state on two circular Fermi\nsheets, each with an isotropic constant gap in the superconducting state ∆± = ±∆0 . The gaps differ by a\nminus sign, so inter-band scattering gives rise to pairbreaking and violates Anderson's theorem. As we increase the scattering rate due to strong isotropic scatter-\n\nIn Figs. 4 and 5, we show the corresponding quantities calculated in the simple 1-band d-wave case, ∆(θ) =\n∆0 cos(2θ), as a canonical example of what one expects\nfor a nodal unconventional superconductor. One fundamental difference with the s± case is the presence of low\nenergy quasiparticles in the clean limit. The nodes in\nthe superconducting gap allow for excitations in the lowenergy density of states, shown in Fig. 4. Furthermore,\nthe Raman polarization which weights the nodes (B2g ,\nin the d-wave case) yields differing power laws in ω from\nthe polarization which vanishes along the nodal directions (B1g ), in contrast to the isotropic case where both\nof the Raman responses (B1g and B2g ) are the same. In\nthe d-wave case, this is signaled by the presence (B1g ) or\nabsence (B2g ) of a large peak at 2∆0 . In both cases, increasing the scattering rate due to disorder increases the\nsize of the impurity band, but the qualitative features of\nthe d-wave Raman response, shown in Fig. 5 (a peak at\n2∆0 , excitations down to ω = 0, differing response for\ndiffering polarizations) are unaltered by disorder. Beyond blurring of the sharp features, the effect of disorder\n\n\f5\n1.2\n\nB1g Γ =0.01 ∆0\nB2g Γ =0.01 ∆0\nB1g Γ =0.05 ∆0\nB2g Γ =0.05 ∆0\nB1g Γ =0.2 ∆0\nB2g Γ =0.2 ∆0\n\n1\n\n0.8\n\nπ\n\nβ2\n\nIm χ\n\n0.6\n\n0.4\n\nα2\n\n0.2\n\n0\n\n0\n\nα1\n\nβ1\n\n0\n\nπ\n\n-0.2\n0\n\n0.5\n\n1\n\n1.5\n\n2\n\n2.5\n\n3\n\n3.5\n\n4\n\nω / ∆0\n\nFIG. 5: (Color online) Effect of disorder on T = 0 Raman\nresponse of d wave state vs. energy ω/∆0 . Shown are two\npolarizations, B1g and B2g , for various values of scattering\nrate Γ/∆0 in unitarity limit.\n\nwill change the low frequency behavior between from ω 3\nto ω in the B1g polarization for the d-wave case39 .\n\nIV.\n\nRAMAN RESPONSE IN MODELS OF\nFERROPNICTIDES\n\nThe full band structure of the Fe-pnictide LaOFeAs,\ndetermined by density functional calculations44,45 , can be\naccurately parameterized by a tight binding model with\n5-bands24 . Generally, these materials have four Fermi\nsurface sheets, shown in Fig. 6 in the \"unfolded\" or\n1-Fe zone: two hole pockets around the gamma point\nand two electron pockets. The two Fermi surfaces about\nthe gamma point are referred to as α sheets and the\nother two are β sheets. The exact details of the band\nstructure are sensitive to doping5 , and an additional hole\npocket around the (π, π) point can occur. We do not\ninclude the (π, π)-pocket because its effect is expected\nto stabilize isotropic gaps in the context of multiorbital\nspin-fluctuation calculations5,27,29 , and because it occurs\n(within a rigid band shift implementation of doping) for\nthe hole-doped cases only. We focus here on electron\ndoped materials on which experiments have been performed, which appear to show nodes or deep gap minima.\nTo model the A1g , B1g , and B2g polarizations measured in Muschler et al.2 the same choices were made\nfor the extended s-wave gap on the α sheets (around the\nΓ point) and β sheets (around the M point) as in that\npaper:\n\nFIG. 6: Fermi surface from a five-orbital tight binding model\nwith parameters chosen to match the density functional theory result45 .\n\n1 + r cos(4θ)\nr = .75\n1+r\n1 − r cos(4θ)\n∆α2 (θ) = ∆0\nr = .75\n1+r\n1 − r cos(2θ)\nr=1\n∆β1 (θ) = −∆0\n1+r\n1 + r cos(2θ)\n∆β2 (θ) = −∆0\nr=1\n1+r\n∆α1 (θ) = ∆0\n\n(7)\n(8)\n(9)\n(10)\n\nThe vertices for this state are chosen to be:\nα1\nγ1g = 0.\nα2 γ1g = .25(−2) sin(θ) cos(θ)\nβ1 γ1g = .5(−2) sin(θ) cos(θ)\nβ2 γ1g = .5(−2) sin(θ) cos(θ)\n\nγ2g\nγ2g\nγ2g\nγ2g\n\n= 0.\n(11)\n= .25 cos(2θ)(12)\n= +1.\n(13)\n= −1.\n(14)\n\nNote that the notation is now in the 2-Fe zone, for easy\ncomparison with Ref. 2. The vertices have been chosen\nto model experimental results with several constraints\nin mind. First, we must respect the underlying symmetry of the polarization state. In the B1g polarization,\nthe response weighted is largely away from any Fermi\nsheet, which is reflected by a flat response in the model\nand data. The B2g polarization samples the electron (β)\nsheets2 . In the data and the model, there is a strong\nT -dependence to the data and a peak which appears below Tc , reflecting the corresponding gap function on these\nFermi surfaces. More realistic calculations of the vertex\nfunctions γk will be necessary for quantitative comparison with experiment.\nFigure 7 shows the clean results for this model.\nIn Muschler et al.2 , single crystals of Co doped\nBa(Fe1−x Cox )2 As2 with x = 0.061 and 0.085 were studied. First, at x=0.061, the B2g spectra in the superconducting state are strikingly different from the B1g and\n\n\f6\n\n2.5\n\nsmall minimum gaps on the hole sheets. These features\nare largely suppressed in the clean Raman response, as\nshown in Fig. 7. In the presence of intraband disorder,\nthe nodes on the β sheets are lifted immediately, as seen\nin the density of states, creating a small but complete\nspectral gap ∆min , as discussed in Mishra et al.30 This,\nin turn, is reflected with the creation of a gap in the\nRaman intensity in Fig. 9, where there is a disorder\ninduced gap edge in the response up to ω = 2∆min .\n2.5\n\n2\n\n0.3\n0.1\n\nN(ω)/N0\n\nA1g spectra, which is not possible for an isotropic gap.\nThere is a sharp peak in the B2g polarization whose shape\nis not asymmetric as would be characteristic of a full gap,\nalready suggesting the presence of nodes. The B1g polarization shows almost no change upon entering the superconducting state, which is consistent with vertices which\nprobe the regions of the Brillouin zone without a Fermi\nsurface. For Ba(Fe1−x Cox )2 As2 with x=0.061, there is a\nnonzero Raman intensity down to zero frequency, which\nindicates the presence of low energy quasiparticles. Thus\nfar, this is reminiscent of the one-band d-wave model.\nTo explore this further the low frequency behavior of the\nRaman intensity can be examined. It is straightforward\nto show that the observed ω 1/2 -dependence of the B2g\nis characteristic of a marginal or \"kissing\" node, where\nthe node just touches the Fermi surface. Examination at\nother dopings can now shed light on the nature of the\nstate. A revealing aspect of the data2 is the x=0.085 B2g\nspectra in the superconducting state. For this higher\ndoping a finite gap of 10 cm−1 can be resolved. The\nchanging structure observed at two dopings suggests that\nimpurities can play an important role.\n\n1.5\n0.1\n\n0.3\n\n1\nclean\nΓ=0.01∆0\nΓ=0.05∆0\nΓ=0.2∆0\n\n0.5\n\n0\n\nClean B2g\nClean B1g\n\n0\n\n0.5\n\n1\n\n1.5\n2\nω/∆0\n\n2.5\n\n3\n\n3.5\n\n2\n\nFIG. 8: (Color online) Density of states N (ω)/N0 for the\nextended s-wave state given in Eqs. Eq. 7-10 vs. ω/∆0 for\nunitary intraband scatterering rates Γ/∆0 . Insert shows lowenergy behavior.\n\nIm χ\n\n1.5\n\n1\n\n0.5\n\nB1g Γ=0.01∆0\nB2g Γ=0.01∆0\nB1g Γ=0.05∆0\nB2g Γ=0.05∆0\nB1g Γ=0.2∆0\nB2g Γ=0.2∆0\n0.5\n\n2\n\n0\n0\n\n0.5\n\n1\n\n1.5\n2\nω / ∆0\n\n2.5\n\n3\n\n3.5\n\n1.5\n\n0.4\n\nFIG. 7: (Color online) Clean B1g and B2g spectra for the\nmodel of the superconducting state defined in Eq. 7-102 and\nin Eq. (7(-(10).\n\nIm χ\n\n0.3\n0.2\n0.1\n\n1\n\n0\n0 0.1 0.2 0.3 0.4 0.5\n\n0.5\n\nThe effect of disorder was calculated using the SCTMA\nin two limits: isotropic interband scattering for which\nV (k, k′ ) = V0 , and intraband-only scattering for which\nV (k, k′ ) = 0 if k, k′ are on different Fermi sheets and V0\nif k, k′ are on the same Fermi sheet. It was assumed that\nthe potential V0 is large (unitarity limit), simulating the\nlarge density functional theory effective potential found\nfor Co dopants in Ba-12236. In Fig. 8 we can see the\neffect of increasing the intraband scattering rate on the\ndensity of states. The gap ∆β1 ,2 (θ) has been chosen so\nthat in the clean limit it has a marginal or \"kissing\"\nnodes leading to a characteristic ω 1/2 behavior in the\nRaman response2,41 , and the asymptotic low-ω behavior\nof N (ω) is indeed also ω 1/2 , as seen in Fig. 8; however\nthere are additional features at low energies due to the\n\n0\n0\n\n0.5\n\n1\n\n1.5\nω/∆0\n\n2\n\n2.5\n\n3\n\nFIG. 9: (Color online) Raman intensity for the extended swave state given in Eqs. Eq. 7-10 vs. ω/∆0 for various\nunitary intraband scatterering rates Γ/∆0 and polarization\nstates B1g and B2g in the 2-Fe zone. Insert: low energy region.\n\nThe isotropic scatterers differ from the intra-band scatterers fundamentally in that inter-Fermi-sheet transitions\nallow for significant pair breaking, since the extended swave state changes average sign between electron and\n\n\f7\nhole Fermi surfaces. So in addition to the gap-averaging\nthat occurs as we scatter from k to k′ , there is the additional effect of creating a low energy quasiparticles \"impurity band.\" This effect prevents the lifting of nodes,\nso while the gap becomes more isotropic, the impurity\nband is the most important low energy effect in the density of states. Indeed, as shown in Fig. 10, the DOS\nis reminiscent of the dirty d-wave case. There is also a\nstriking similarity in the Raman intensity shown in Fig.\n11 and the d-wave case. There are low energy quasiparticles all the way down to zero frequency, and we observe\nan enhancement of low frequency spectral weight.\n2.5\n\nclean\nΓ=0.01∆0\nΓ=0.05∆0\nΓ=0.2∆0\n\nN(ω)/N0\n\n2\n\n1.5\n\n1\n\n0.5\n\n0\n0\n\n0.5\n\n1\n\n1.5\n\n2\n\n2.5\n\nω/∆0\n\nFIG. 10: (Color online) The density of states for an extended\ns-wave state given in Eqs. Eq. 7-10 vs. ω/∆0 for unitary\nisotropic scatterering rates Γ/∆0 .\n\nB1g Γ=0.01∆0\nB2g Γ=0.01∆0\nB1g Γ=0.05∆0\nB2g Γ=0.05∆0\nB1g Γ=0.2∆0\nB2g Γ=0.2∆0\n\n2\n\n1.5\n\nIm χ\n\n0\n\n0.1 0.2 0.3\n\n1\n\n0.5\n\n0\n0\n\n0.5\n\n1\n\n1.5\n2\nω/∆0\n\n2.5\n\n3\n\n3.5\n\nFIG. 11: (Color online) Raman intensity for an extended swave state of Fig. 10 for various unitary isotropic scatterering\nrates Γ/∆0 and polarization states B1g and B2g in the 2-Fe\nzone. Insert: low-energy region.\n\nV.\n\nCONCLUSIONS\n\nMeasurement\nof\nthe\nRaman\nspectra\nin\nBa(Fe1−x Cox )2 As2 revealed that at roughly 8% doping\nthere is a gap in the response up to approximately 10\ncm−1 , in contrast to the 6% doped sample where there\nis a nonzero response down to zero frequency. This\nintriguing feature suggests a relation between cobalt\ndoping, disorder, and the structure of the underlying\nsuperconducting gap. We have presented calculations of\nthe Raman response as a function of frequency for varying scattering rates due to disorder in the self-consistent\nT matrix approximation. First, we demonstrated the\ndiffering effects of disorder on s± and d-wave gaps to\nillustrate how a nodal superconductor contrasts with\na sign-changing gapped state. The absence of low\nenergy quasiparticles is an indication of a fully gapped\nstate, but for systems with interband disorder scattering\nan impurity band is created which can mimic nodal\nbehavior. We found, however, that in the presence\nof disorder the form of the main 2∆ peak is largely\nunaffected; thus its observed symmetric form in the\nMuschler et al experiment is suggestive evidence for true\nnodal or near-nodal behavior.\nMore definitive information is provided by the Raman\nresponse at low energies. To study the anisotropic s-wave\nstate in more detail, we have presented a set of model\ngap functions on the 2D Fermi surface sheets which capture the essential features of the experimental Raman\nresponse2 . It is immediately clear that for the dopings\nwhere measurements have been performed a nodal state\nis likely because of two factors: low frequency power law\nbehavior of the Raman intensity down to zero energy,\ntogether with the very different responses for different\npolarizations. We then examined different kinds of disorder on such a state. A remarkable effect is the lifting\nof nodes by intraband scatterers for a highly anisotropic\ns-wave state, in rough agreement with the qualitative\neffect of gapping the Raman spectrum observed as the\ndoping increased from 0.061 to 0.085 in Muschler et al.\nin Ba(Fe1−x Cox )2 As2 . The predicted effects of strong\ninterband scattering at low energies were not observed,\nimplying that the Co in this system acts primarily as an\nintraband scatterer36 . Of course, the present calculations\ninclude only the effect of the impurity on pairbreaking,\nand neglect any direct effect on the pairing interaction,\nso direct conclusions may not be drawn.\nThis feature distinguishes nodal anisotropic s-wave\nstates from isotropic s± states in terms of how the\nresponse, and underlying superconducting gap, evolves\nwith increasing disorder. It also is not possible in nonA1g representations of the gap, like d-wave, because the\nnodes cannot be removed for lower symmetry superconducting gaps. We believe that these distinctions will\nprovide a useful basis for the interpretation of Raman\nscattering experiments as doping or irradiation is tuned\nsystematically in different samples.\n\n\f8\nAcknowledgments\n\nResearch was partially supported by by DOE\nDE-FG02-05ER46236 (PJH) and DE-AC02-76SF00515\n\n1\n2\n\n3\n\n4\n5\n\n6\n\n7\n\n8\n\n9\n10\n11\n\n12\n\n13\n\n14\n\n15\n\n16\n\n17\n\n18\n\n19\n20\n\nT.P. Devereaux, R. Hackl, Rev.Mod.Phys. 79, 175 (2007).\nB. Muschler, W. Prestel, R. Hackl T.P. Devereaux J.G. Analytis, Jiun-Haw Chu, I.R. Fisher, Phys.Rev.B 80, 180510\n(2009).\nDavid C. Johnston arXiv:1005.4392 submited to advances\nin physics\nJohnpierre Paglione, Richard L. Greene arXiv:1006.4618\nA. F. Kemper, T. A. Maier, S. Graser, H. Cheng, P. J.\nHirschfeld, and D. J. Scalapino, to appear in New J. of\nPhys.\nR. Klingeler, N. Leps, I. Hellmann, A. Popa, C. Hess,\nA. Kondrat, J. Hamann-Borrero, G. Behr, V. Kataev, and\nB. Buechner, arXiv:0808.0708.\nH.-J. Grafe, D. Paar, G. Lang, N.J. Curro, G. Behr,\nJ. Werner, J. Hamann-Borrero, C. Hess, N. Leps, R. Klingeler, and B. Buchner, Phys. Rev. Lett. 101, 047003\n(2008).\nK. Ahilan, F.L. Ning, T. Imai, A.S. Sefat, R. Jin,\nM.A. McGuire, B.C. Sales, D. Mandrus, Phys. Rev. B 78,\n100501(R) (2008).\nT.Y. Nakai et al., J. Phys. Soc. Jpn. 77, 073701 (2008).\nL. Zhao et al Chin. Phys. Lett. 25, 4402 (2008).\nH. Ding, P. Richard, K. Nakayama, T. Sugawara,\nT. Arakane, Y. Sekiba, A. Takayama, S. Souma, T. Sato,\nT. Takahashi, Z. Wang, X. Dai, Z. Fang, G.F. Chen,\nJ.L. Luo, N.L. Wang, Europhys. Lett. 83, 47001 (2008).\nT. Kondo, A.F. Santander-Syro, O. Copie, C. Liu,\nM.E. Tillman, E.D. Mun, J. Schmalian, S.L. Bud'ko,\nM.A. Tanatar, P.C. Canfield, A. Kaminski, Phys. Rev.\nLett. 101, 147003 (2008).\nD.V. Evtushinsky, D.S. Inosov, V.B. Zabolotnyy,\nA. Koitzsch, M. Knupfer, B. Buchner, G.L. Sun,\nV. Hinkov, A.V. Boris, C.T. Lin, B. Keimer,\nA. Varykhalov, A.A. Kordyuk, S.V. Borisenko,\narXiv:0809.4455.\nK. Nakayama, T. Sato, P. Richard, Y.-M. Xu, Y. Sekiba,\nS. Souma, G. F. Chen, J. L. Luo, N. L. Wang, H. Ding, T.\nTakahashi, arXiv:0812.0663.\nL. Wray, D. Qian, D. Hsieh, Y. Xia, L. Li, J.G. Checkelsky,\nA. Pasupathy, K.K. Gomes, C.V. Parker, A.V. Fedorov,\nG.F. Chen, J.L. Luo, A. Yazdani, N.P. Ong, N.L. Wang,\nM.Z. Hasan, arXiv: 0812.2061.\nK. Hashimoto, T. Shibauchi, T. Kato, K. Ikada, R.\nOkazaki, H. Shishido, M. Ishikado, H. Kito, A. Iyo, H.\nEisaki, S. Shamoto, and Y. Matsuda arXiv:0806.3149.\nL. Malone, J.D. Fletcher, A. Serafin, A. Carrington, N.D.\nZhigadlo, Z. Bukowski, S. Katrych, and J. Karpinski, arXiv\n0807.0876.\nC. Martin, R. T. Gordon, M. A. Tanatar, M. D. Vannette, M. E. Tillman, E. D. Mun, P. C. Canfield, V. G.\nKogan, G. D. Samolyuk, J. Schmalian, and R. Prozorov,\narXiv:0807.0876\nK. Hashimoto etal. arXiv:0810.3506.\nR. T. Gordon, N. Ni, C. Martin, M. A. Tanatar, M. D.\n\n(TPD). The authors would like to acknowledge productive conversations with Dr.A.F.Kemper, Dr. R.Hackl, B.\nMuschler, and D.J. Scalapino.\n\n21\n\n22\n\n23\n\n24\n\n25\n\n26\n\n27\n\n28\n\n29\n\n30\n\n31\n32\n33\n34\n\n35\n\n36\n\n37\n38\n\n39\n\n40\n\n41\n\n42\n\n43\n44\n\n45\n\nVannette, H. Kim, G. Samolyuk, J. Schmalian, S. Nandi,\nA. Kreyssig, A. I. Goldman, J. Q. Yan, S. L. Bud'ko, P. C.\nCanfield, R. Prozorov, arXiv:0810.2295.\nR. T. Gordon, C. Martin, H. Kim, N. Ni, M. A. Tanatar,\nJ. Schmalian, I. I. Mazin, S. L. Bud'ko, P. C. Canfield, R.\nProzorov, arXiv:0812.3683.\nJ.D. Fletcher, A. Serafin, L. Malone, J. Analytis, J-H Chu,\nA.S. Erickson, I.R. Fisher, A. Carrington, arXiv:0812.3858.\narXiv:0803.2740 Title: Unconventional sign-reversing superconductivity in LaFeAsO1-xFx Authors: I.I. Mazin,\nD.J. Singh, M.D. Johannes, M.H. Du Journal-ref: Phys.\nRev. Lett. 101, 057003 (2008)\nS. Graser, T. A. Maier, P. J. Hirschfeld, and D. J.\nScalapino, New. J. Phys. 11 (2009)\nA. V. Chubukov, D. V. Efremov, and I. Eremin, Phys. Rev.\nB 78, 134512 (2008).\nK. Kuroki, S. Onari, R. Arita, H. Usui, Y. Tanaka, H. Kontani, and H. Aoki, Phys. Rev. Lett. 101, 087004 (2008).\nK. Kuroki, H. Usui, S. Onari, R. Arita, and H. Aoki, Phys.\nRev. B 79, 224511 (2009).\nF. Wang, H. Zhai, Y. Ran, A. Vishwanath, and D. Lee,\nPhysical Review Letters 102, 047005 (2009).\nR. Thomale, C. Platt, J. Hu, C. Honerkamp, and B. A.\nBernevig, Phys. Rev. B 80, 180505 (2009).\nV. Mishra, G.R. Boyd, S. Graser, T. Maier, P.J. Hirschfeld,\nand D.J. Scalapino, Phys. Rev. B 79, 094512 (2009)\nYu, L., 1965, Acta Phys. Sin. 21, 75.\nShiba, H., 1968, Prog. Theor. Phys. 40, 435.\nHussey, N. Adv. Phys 51, 1685 (2002).\nA.A. Golubov and I.I. Mazin, Phys. Rev. B 55, 15146\n(1997).\nY.\nSenga\nand\nH.\nKontani,\narXiv:0809.0374;\narXiv:0812.2100. One of these is J. Phys. Soc. Jpn.\n77, 113710 (2008).\nA. Kemper, C. Cao, P.J. Hirschfeld, and H.-P. Cheng,\nPhys. Rev. B 80, 104511 (2009).\nH. Wadati, I. Elfimov, G. A. Sawatzky, arXiv:1003.2663.\nA.F. Kemper, M. Korshunov, and P.J. Hirschfeld, to be\npublished.\nT.P. Devereaux and A.P. Kampf Int. J. Mod. Phys. B11,\n2093 (1997).\nT.P. Devereaux and D. Einzel, Phys. Rev. B 51,\n1633616357 (1995).\nG.R. Boyd, T.P. Devereaux, P.J. Hirschfeld, V.Mishra, and\nD.J. Scalapino, Phys. Rev. B 79, 174521 (2009).\nT. P. Devereaux, A. Virosztek, A. Zawadowski Phys.Rev.B\n54, 12523 (1996)\nT. P. Devereaux Phys.Rev.Lett. 74, 4313 (1995)\nD.J. Singh and M.-H. Du, Phys. Rev. Lett. 100, 237003\n(2008).\nC. Cao, P.J. Hirschfeld, H.-P. Cheng, Phys. Rev. B 77,\n220506(R) (2008).\n\n\f"}