{"id": "http://arxiv.org/abs/0711.1331v2", "guidislink": true, "updated": "2007-12-18T20:30:05Z", "updated_parsed": [2007, 12, 18, 20, 30, 5, 1, 352, 0], "published": "2007-11-08T17:51:49Z", "published_parsed": [2007, 11, 8, 17, 51, 49, 3, 312, 0], "title": "Ferroelectrically induced weak-ferromagnetism in a single-phase\n  multiferroic by design", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0711.1366%2C0711.3047%2C0711.4461%2C0711.4977%2C0711.2505%2C0711.4726%2C0711.1517%2C0711.3194%2C0711.0090%2C0711.1824%2C0711.3135%2C0711.2725%2C0711.3998%2C0711.0596%2C0711.2980%2C0711.3168%2C0711.0112%2C0711.4017%2C0711.1315%2C0711.4983%2C0711.2218%2C0711.1017%2C0711.1687%2C0711.2240%2C0711.3221%2C0711.4991%2C0711.1590%2C0711.3853%2C0711.1195%2C0711.1203%2C0711.4936%2C0711.0357%2C0711.2490%2C0711.1990%2C0711.1301%2C0711.3621%2C0711.4906%2C0711.1128%2C0711.0556%2C0711.5004%2C0711.3013%2C0711.3009%2C0711.2696%2C0711.0413%2C0711.1795%2C0711.1403%2C0711.2877%2C0711.1925%2C0711.3538%2C0711.4561%2C0711.1804%2C0711.4473%2C0711.2402%2C0711.1331%2C0711.1471%2C0711.2715%2C0711.3254%2C0711.3197%2C0711.2897%2C0711.3293%2C0711.2507%2C0711.2734%2C0711.0972%2C0711.1102%2C0711.0958%2C0711.0506%2C0711.3832%2C0711.3176%2C0711.0670%2C0711.3762%2C0711.2898%2C0711.0328%2C0711.1568%2C0711.0078%2C0711.4538%2C0711.0998%2C0711.4358%2C0711.0351%2C0711.2457%2C0711.1294%2C0711.1806%2C0711.3156%2C0711.1305%2C0711.1778%2C0711.3307%2C0711.3893%2C0711.1783%2C0711.4940%2C0711.1510%2C0711.3019%2C0711.2867%2C0711.1528%2C0711.1117%2C0711.1258%2C0711.3563%2C0711.3344%2C0711.2390%2C0711.4418%2C0711.4813%2C0711.1274%2C0711.1038&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Ferroelectrically induced weak-ferromagnetism in a single-phase\n  multiferroic by design"}, "summary": "We present a strategy to design structures for which a polar lattice\ndistortion induces weak ferromagnetism. We identify a large class of\nmultiferroic oxides as potential realizations and use density-functional theory\nto screen several promising candidates. By elucidating the interplay between\nthe polarization and the Dzyaloshinskii-Moriya vector, we show how the\ndirection of the magnetization can be switched between 180$^{\\circ}$ symmetry\nequivalent states with an applied electric field.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0711.1366%2C0711.3047%2C0711.4461%2C0711.4977%2C0711.2505%2C0711.4726%2C0711.1517%2C0711.3194%2C0711.0090%2C0711.1824%2C0711.3135%2C0711.2725%2C0711.3998%2C0711.0596%2C0711.2980%2C0711.3168%2C0711.0112%2C0711.4017%2C0711.1315%2C0711.4983%2C0711.2218%2C0711.1017%2C0711.1687%2C0711.2240%2C0711.3221%2C0711.4991%2C0711.1590%2C0711.3853%2C0711.1195%2C0711.1203%2C0711.4936%2C0711.0357%2C0711.2490%2C0711.1990%2C0711.1301%2C0711.3621%2C0711.4906%2C0711.1128%2C0711.0556%2C0711.5004%2C0711.3013%2C0711.3009%2C0711.2696%2C0711.0413%2C0711.1795%2C0711.1403%2C0711.2877%2C0711.1925%2C0711.3538%2C0711.4561%2C0711.1804%2C0711.4473%2C0711.2402%2C0711.1331%2C0711.1471%2C0711.2715%2C0711.3254%2C0711.3197%2C0711.2897%2C0711.3293%2C0711.2507%2C0711.2734%2C0711.0972%2C0711.1102%2C0711.0958%2C0711.0506%2C0711.3832%2C0711.3176%2C0711.0670%2C0711.3762%2C0711.2898%2C0711.0328%2C0711.1568%2C0711.0078%2C0711.4538%2C0711.0998%2C0711.4358%2C0711.0351%2C0711.2457%2C0711.1294%2C0711.1806%2C0711.3156%2C0711.1305%2C0711.1778%2C0711.3307%2C0711.3893%2C0711.1783%2C0711.4940%2C0711.1510%2C0711.3019%2C0711.2867%2C0711.1528%2C0711.1117%2C0711.1258%2C0711.3563%2C0711.3344%2C0711.2390%2C0711.4418%2C0711.4813%2C0711.1274%2C0711.1038&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We present a strategy to design structures for which a polar lattice\ndistortion induces weak ferromagnetism. We identify a large class of\nmultiferroic oxides as potential realizations and use density-functional theory\nto screen several promising candidates. By elucidating the interplay between\nthe polarization and the Dzyaloshinskii-Moriya vector, we show how the\ndirection of the magnetization can be switched between 180$^{\\circ}$ symmetry\nequivalent states with an applied electric field."}, "authors": ["Craig J. Fennie"], "author_detail": {"name": "Craig J. Fennie"}, "author": "Craig J. Fennie", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1103/PhysRevLett.100.167203", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/0711.1331v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0711.1331v2", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "Significantly revised for clarity", "arxiv_primary_category": {"term": "cond-mat.mtrl-sci", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cond-mat.mtrl-sci", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0711.1331v2", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0711.1331v2", "journal_reference": null, "doi": "10.1103/PhysRevLett.100.167203", "fulltext": "Ferroelectrically induced weak-ferromagnetism in a single-phase multiferroic by design\nCraig J. Fennie\n\narXiv:0711.1331v2 [cond-mat.mtrl-sci] 18 Dec 2007\n\nCenter for Nanoscale Materials, Argonne National Laboratory, Argonne, IL 60439.\nWe present a strategy to design structures for which a polar lattice distortion induces weak ferromagnetism. We identify a large class of multiferroic oxides as potential realizations and use densityfunctional theory to screen several promising candidates. By elucidating the interplay between the\npolarization and the Dzyaloshinskii-Moriya vector, we show how the direction of the magnetization\ncan be switched between 180◦ symmetry equivalent states with an applied electric field.\nPACS numbers: 75.80.+q,77.80.-e,81.05.Zx\n\nThe rational design of new materials with emergent\nproperties is a riveting challenge today in materials\nphysics. It begins with understanding a mechanism to\ncontrol the interplay between diverse microscopic degrees\nof freedom in order to create targeted macroscopic phenomena and ends with the discovery or design of new material realizations. When combined with first-principles\ndensity-functional theory, this approach provides an efficient strategy to survey the vast space of possible materials to target for synthesis. For example, new multiferroics in which magnetism coexists with ferroelectricity\nhave been discovered where magnetic order itself induces\nferroelectricity. Through this specific spin-lattice interaction, it is readily possible to control the direction of the\nelectrical polarization with a magnetic-field [1, 2]. An\nequally fundamental but technologically more relevant\nproblem that has received far less study is the electricfield control of magnetism [3, 4, 5, 6]. In particular,\nthe electric-field switching of a magnetization between\n180◦ symmetry equivalent states has yet to be demonstrated. The most promising direction to achieve this in\nsingle-phase materials involves a ferroelectric distortion\ninducing weak-ferromagnetism [7, 8, 9, 10]. Discovering\na prototypical structure for which this approach might\nbe realized, however, has remained elusive.\nWeak-ferromagnetism (wFM) is the phenomenon\nwhereby the predominantly collinear spins of an antiferromagnet cant in such a way as to produce a\nresidual magnetization (M). It can arise as a relativistic correction to Anderson's superexchange, i.e.,\nthe Dzyaloshinskii-Moriya (DM) interaction [11, 12],\nEDM =Dij *Si ×Sj where D is the Dzyaloshinskii vector.\nA ferroelectric (FE) distortion can induce wFM when\nthe phenomenological invariant EPLM ∼P*(L×M) is allowed in the energy of the antiferromagnetic-paraelectric\n(AFM-PE) phase, where P and L are the polarization\nand AFM vector respectively. Due to this term a coupling between the sign of P and M, for fixed L, is evident.\nIt is important to realize that a FE can still exhibit wFM\nwithout the FE distortion per se causing the wFM, i.e.,\nwithout EPLM in the corresponding PE phase. For example, although BiFeO3 (the most widely studied multiferroic) can display wFM, such an invariant does not exist\n\nas previously shown from explicit first-principles calculations [13] and as we argue below from symmetry. The\nchallenge then is understanding how to start with the\nmicroscopic properties of EDM and build a material capturing the macroscopic physics of EPLM . In this Letter\nwe present for the first time design criteria that facilitate\nthis process. In general the criteria target a structure\nfor which wFM is symmetry-forbidden in the PE phase\nbut symmetry-allowed in the FE phase [4, 13]. Below we\nuse this to identify a class of multiferroic oxides as potential realizations and use density-functional theory to\nscreen several promising candidates. One complication\narises in magnetic systems with broken spatial inversion\nsuch as a FE: a symmetry allowed interaction [14] may\nin some cases generate a long-wavelength magnetic spiral\ncanceling the net M, e.g., as in (bulk) BiFeO3 . Here we\nconsider the situation where this inhomogeneous state is\nsuppressed, e.g., when single-ion anisotropy is large [15].\nOur strategy is to formulate the problem in terms of\na structural-chemical criterion and a magnetic criterion.\nTo illustrate the idea we consider a two-sublattice antiferromagnet such as BiFeO3 . A synopsis of the structuralchemical criterion is as follows: start with a PE structure,\ndecorate the lattice with spins such that the midpoint between two spins coincides with a site having inversion (I)\nsymmetry (so that D = 0 by symmetry, i.e., Moriya's first\nrule [12]), place a FE-active ion at an I-site. Compounds\nwhich satisfy this criterion are quite intriguing because if\nthere are no other symmetry elements that would forbid\nwFM – the magnetic criterion – all that is required to\ninduce a non-zero D and wFM is to remove the I center\nby controlling the off-centering of the FE-active ion either\nby temperature, pressure, or electric-field. The magnetic\ncriterion is primarily a question of how the spins order\nand of their direction with respect to the crystallographic\naxes. Notice our microscopic based criteria implies that\nL is odd under I, which is precisely what is required considering macroscopic phenomenology, i.e., EPLM . These\ncriteria facilitate evaluating known compounds or when\ncombined with crystal chemistry principles designing new\nprototypes. For example, using PE BiFeO3 as a starting\npoint, we apply them to design a novel structure.\nIn PE BiFeO3 , crystallographic space group R3̄c, the\n\n\f2\nBiFeO3\nAFM, L:\nEven\nPoint group: 2/m or 2'/m'\nWeak FM: YES\n\nFeTiO3\nOdd\n2/m' or 2'/m\nNO\n\nS1\n\n\"A-site\"\n\nSpace inversion\ncenter\n\n! D=0\n\nS1\n\"B-site\"\n\nL = S1 - S2\n\nS2\n\nS2\nBiFeO3\n\nFeTiO3\n\nFIG. 1: Paraelectric ABO3 compounds, space group, R3̄c,\nBiFeO3 and FeTiO3 . A-site: Wyckoff position 2a, site symmetry 32. B-site: Wyckoff position 2b site symmetry, 3̄.\n\nBi-ions occupy the A-site, Wyckoff position 2a, with local site symmetry 32, while the magnetic Fe-ion occupies\na site with inversion symmetry, the B-site, position 2b,\nsite symmetry 3̄. The Fe-spins order ferromagnetically\nwithin antiferromagnetically coupled (111) planes with\nthe magnetic easy axis perpendicular to [111]. Although\nPE BiFeO3 satisfies the magnetic criterion, I transforms\neach Fe sublattice onto itself, IL = I(S1 -S2 ) = L, as can\nbe seen in Fig. 1(a). In this case of B-site magnetism the\nstructural-chemical criterion is not met and the invariant\nEPLM is forbidden by symmetry (the PE point group is\n2'/m' or 2/m for which wFM is allowed). In contrast,\nconsider the case where the magnetic ion is on the A-site\nand similarly ordered so that the magnetic criterion is\nstill satisfied, Fig. 1(b). Now, in this case of A-site magnetism, IL = -L. Placing a FE-active ion such as Ti4+\non the B-site would then satisfy the structural-chemical\ncriterion. The PE magnetic point group is now 2/m'\n(2'/m) in which wFM is forbidden and by design a FE\ndistortion, via EPLM , would lower the symmetry to m'\n(m) thereby inducing wFM. The question remaining is\nwhether compounds in our rationalized structure can be\nsynthesized? As we discuss next, several already exist.\nThe mineral Ilmenite FeTiO3 is one member of a\nfamily of compounds [16] that include the titanantes\nA2+ Ti4+ O3 with A = Mn–Ni. They are all AFM insulators with ordering temperatures TN ∼40K-100K. At\natmospheric pressure they form in the Ilmenite structure,\nspace group R3̄. Ilmenite can be thought of as an ordered\ncorundum structure. At high-pressure both MnTiO3 and\nFeTiO3 have been found to form a quenchable metastable\nLiNbO3 LBO-phase, space group R3c [17, 18]. Note this\nLBO-phase is structurally isomorphic to BiFeO3 except\nthe magnetic and FE atom positions are reversed, for example: MnTiO3 →BiFeO3 implies Mn→Bi and Ti→Fe.\n\nThis is precisely the structural-chemical criterion outlined above. The remaining question is to identify the\nmagnetic ground state in the FE phase to determine if\nthe magnetic criterion is satisfied. In the remainder of\nthis Letter we present a first-principles study of the FE\nand magnetic properties of the LBO-phase of MnTiO3 ,\nFeTiO3 , and NiTiO3 . We demonstrate that these are realizations of the design criteria and provide a novel simple\npicture of how the interplay of D and P leads to electricfield control of wFM.\nMethod.− We performed density-functional calculations using PAW potentials within LSDA+U [19] as implemented in VASP [20, 21]. The wavefunctions were\nexpanded in plane waves up to a cutoff of 500 eV. Integrals over the Brillouin zone were approximated by sums\non a 6 × 6 × 6 Γ-centered k-point mesh. Phonons were\ncalculated using the direct method. Where noted, noncollinear calculations with L-S coupling were performed.\nTo find appropriate values of on-site Coulomb U and exchange JH parameters we performed a series of calculations to estimate the Curie-Weiss temperature ΘCW as a\nfunction of U for MnTiO3 , FeTiO3 , and NiTiO3 in the\nground state Ilmenite structure, space group R3̄ [22]. For\nall compounds a value of U = 4.5 eV and JH =0.9 eV was\nfound to give a reasonable account of the measured values. It should be noted that the presented results do not\nqualitatively change for reasonable variations of U.\nFerroelectricity.− In the soft-mode theory of ferroelectricity, the PE to FE transition is associated with the\nsoftening of a single unstable infrared-active phonon. In\nthe R3̄c→R3c transition, this is a PE phonon polarized along [111] of symmetry type A2u . We calculated\nthe frequencies of these A2u phonons at T=0 and found\none highly unstable mode, e.g., in MnTiO3 , ωsof t ≈i150\ncm−1 . The character of this soft mode consists of A-ion\nand Ti displacements moving against oxygen, similar to\n\nTABLE I: Theoretical (experimental) properties of multiferroic ATiO3 , space group R3c. f.u. ≡ formula unit.\n\nah\nch\nθr\nTF E\nP\nΘCW\nTN\nL\nM\nJ1\nK\nD\n\nMn (Exp. [17])\nFe (Exp. [18])\nNi\n5.127Å (5.205Å)\n5.05Å (5.12Å)\n4.93Å\n13.63Å (13.70Å) 13.52Å (13.76Å)\n13.65Å\n56.4◦ (56.8◦ )\n56.2◦ (56.0◦ )\n54.7◦\n>1000K\n>1000K\n>1000K\n83 μC/cm2\n94 μC/cm2\n110 μC/cm2\n-290 K\n-305 K\n-170 K\n135 K\n260 K\n100 K\n4.5 μB /f.u.\n3.6 μB /f.u.\n1.6 μB /f.u.\n-0.002 μB /f.u.\n-0.03 μB /f.u.\n0.25 μB /f.u.\n-0.5meV\n-1.0meV\n-1.5meV\n-0.02meV/f.u.\n-0.74 meV/f.u. -0.03 meV/f.u.\n-0.0004 meV/f.u. -0.02 meV/f.u. -0.35 meV/f.u.\n\n\f3\nOA\n[111]\n\nP\n\n[111]\n\nM\n\nOA\nS2\n\nL\n\nOB\nS1\n\nOB\n\nL\nS1\n\nOB\n\n[111]\n\nS2\n\nOA\n\nM\n\nP\n\nS2\n\nL\n\nOA\nS1\n\nFIG. 2: Chiral nature of the S1 –O–S2 bonds; (Left) Polarization-up and (Right) Polarization-down. (Middle) Paraelectric state\nshowing two equivalent inter -planar pathways, e.g. S1 –OA –S2 and S1 –OB –S2 . Note: DkP, L ⊥ M ⊥ P.\n\nother R3c FEs such as BiFeO3 and LiNbO3 .\nNext we broke inversion symmetry and performed a\nfull structural optimization within the R3c space group.\nIn Table I the calculated lattice constants at T = 0\nare shown to be in excellent agreement with those observed at room temperature for MnTiO3 and FeTiO3\n(R3c NiTiO3 has not yet been synthesized.) The distortion leading from the PE to the FE structure can\nbe decomposed entirely in terms of the soft-mode. The\natomic displacements are almost equal in magnitude to\nthose in LiNbO3 , meeting Abraham's structural criteria\nfor switchable ferroelectricity [23]. Based on Abraham's\nempirically derived formula relating the magnitude of\nthese distortions to the FE transition temperature [23],\nwe estimate FE TC ∼1500K–2000K. Finally, using the\nmodern theory of polarization [24] we calculated a large\nP ≈ 80–100 μC/cm2 comparable to that of BiFeO3 .\nMagnetic structure.− Weak ferromagnetism arises as a\nsmall perturbation - from the relativistic spin-orbit interaction - to a predominately collinear magnetic state, i.e.,\n|J|>>|D|, where J and D are Heisenberg and DM exchange respectively. This difference in energy scales naturally separates the problem. As such we first identify the\ncollinear state that minimizes the spin-interaction\nenergy\nP\nwithout L-S coupling, i.e., EH = − ij Jij Si * Sj , by extracting the first four nearest neighbor (n.n.) exchange integrals, Jn , from total energy calculations [22]. We found\nthe state that minimizes EH consists of spins aligned\nferromagnetically within antiferromagnetically coupled\n(111) planes, consistent with the magnetic criterion outlined above. This magnetic state arises due to a strong\nAFM J1 coupling between n.n. spins in adjacent (111)\nplanes. The Néel temperature calculated within meanfield theory [25] was found to be TN ∼ 100K for MnTiO3\nand NiTiO3 and TN ∼ 250K for FeTiO3 .\nFor a uniaxial crystal the orientation of the global spin\naxis relative to the crystallographic\naxis is given to lowP\nest order by Eani = i Ki sin2 (θ), where θ is the angle\nbetween [111] and L. Depending on the sign of K, the\nspins lie in a plane perpendicular or parallel to [111],\nin which case wFM is allowed or forbidden, respectively.\nTo calculate the single-ion anisotropy constant K we first\nperformed a self-consistent density-functional calculation\n\nwith collinear spins, without L-S coupling. Then, using\nthe charge density and wavefunctions, we performed a series of non-selfconsistent calculations with spin-orbit interaction included for different orientations of the global\nspin axis. We found that the magnetic easy axis lies in\nthe plane perpendicular to [111] with K ranging from\n-0.03 meV for MnTiO3 and NiTiO3 , to -0.7 meV for\nFeTiO3 (the much large anisotropy for FeTiO3 is associated with the orbital degeneracy). Symmetry then allows an additional contribution to theP\ntotal energy which\ncan cause the spins to cant: EDM = ij D̃ij * (Si × Sj ),\nwhere D̃ij is the Dzyaloshinskii vector. Phenomenologically this can be described by EDLM =D*(L×M) where\nL=S1 -S2 and M=S1 +S2 . Symmetry requires D to point\nalong [111], i.e., parallel/antiparallel to P. Since K<0\nrequires L to be in the plane perpendicular to [111] and\nsubsequently to D, the induced M is perpendicular to\nP. Once the direction of L is fixed, the sign of M that\nminimizes EDLM is determined by the sign of D.\nSymmetry allows the spins to cant in the FE phase,\nbut do they and by how much? To address this question\nwe calculated the self consistent spin-density in the presence of the spin-orbit interaction for the FE structure\nwith for example the polarization pointing down. The\nspins were initialized in a collinear configuration, e.g. L0\n= (2gμB S, 0, 0), M0 = (0,0,0), and then allowed to relax\nwithout any symmetry constraints imposed. For MnTiO3\nthe induced moment was rather weak, M = (0, -0.002,\n0) μB /formula unit (f.u.), although comparable to the\ncanonical weak-ferromagnet Fe2 O3 and still measurable.\nThe smallness of this result is not too surprising considering that the spin-orbit parameter λ vanishes for Mn2+\nin the atomic limit. In contrast, λ is relatively large\nfor Fe2+ and Ni2+ , and correspondingly the induced moments increase dramatically; M = (0, -0.03,0) μB /f.u.\nand M =(0,0.25,0) μB /f.u. for FeTiO3 and NiTiO3 respectively [26]. Finally, we can approximate the strength\nof D̃ from the calculated canting angle and J1 . The results are summarized in Table I.\nNext we proceed to elucidate the interaction between\nM and P. Similar calculations as we just discussed were\nperformed for the PE structure and for the FE structure\nwith P in the opposite (symmetry equivalent) direction,\n\n\f4\nS2\n\nOB\nIn PE phase\nInversion\nCenter\nWyckoff\n6d\n\nD12 = DA+DB\n\n.\n\nDA ~ r1A x r2A\nDB ~ r1B x r2B\n\nS1\nr1A\n\nOA\n\nPE: DA = -DB\n\nFIG. 3: Superexchange pathways, S1 -OA -S2 and S1 -OB S2 , between nearest neighbor spins. The net DzyaloshinskiMoriya vector, D12 , contains two contributions, DA and DB ,\nthat cancel in the paraelectric phase.\n\nagain relaxing the spin-density without symmetry constraints. In the former M vanished confirming that the\nFE distortion is required for the observed wFM while in\nthe latter M switched sign. These results are consistent\nwith our earlier symmetry arguments for a FE inducing\nwFM, i.e., for the invariant EPLM ∼P*(L×M) [27] and\nsuggests that the direction of M can be switched between stable 180◦ directions by an external electric field\nthat would switch P thereby switching M. One way to\nunderstand this result is to argue that the sign of the\nDM vector D depends on the direction of P, i.e., P ∝ D.\nAt first this may seem puzzling considering the fact that\nDij is an axial vector. As Ederer and Spaldin pointed\nout [13], P would have to change the sense of oxygen\nrotation in order for D to change sign. In Fig. 2 we compare the S-O-S bonds in the PE and up/down FE states,\ncentering on spin S2 and its nearest neighbors in adjacent\n(111) planes. A change in chirality of the S-O-S bonds\nis clearly visible due to a change in the direction of P.\nThe physics becomes clear by examining the microscopic\nEDM and\nthat the net Dzyaloshinskii vector\nP realizing\nα\nhas to be summed over all distinct S1 –Oα –\nD̃ij = α Dij\nS2 pathways. In the PE structure two pathways, a left\nand right chiral, contribute to D̃12 as we show in Fig. 3.\nA\nThe orientation of the D12\nvector is given by [28, 29]\nA\nD12 ∼ r1A × r2A where r1A is the unit vector pointing\nalong the S1 - OA direction. There is, however, an additional pathway connecting S1 to S2 through OB . In the\nPE phase DA and DB can be shown to have equal magnitude but opposite sign leading to a vanishing net DM\ninteraction. In the FE phase, P strengthens/weakens one\npathway over the other leading to a finite DM interaction\n(in Fig. 2 we only show the \"strong\" S1 -O-S2 pathway in\nthe FE phase). Therefore the origin of ferroelectricallyinduced wFM in this class of materials is a change in the\nrelative contribution of two DM superexchange pathways\n(with opposite sign) due to a polar lattice distortion.\nToday, the challenge in multiferroics has shifted from\nfinding new magnetic ferroelectrics to identifying materials in which the polarization and the magnetization are\nstrongly coupled. In this work we have presented criteria\nthat have the potential to advance the discovery of such\n\ncomplex materials. These electrically-controlled switchable magnets provide fertile ground for additional studies\nof how spin and lattice degrees of freedom interact and\nalso hold promise for application in magnetic devices.\nUseful discussions with Matthias Bode, Venkat\nGopalan, Darrell Schlom, and S.K. Streiffer are acknowledged. Work at the Center for Nanoscale Materials was\nsupported by US DOE, Office of Science, Basic Energy\nSciences under Contract No. DE-AC02-06CH11357.\n\n[1] S. -W Cheong and M. Mostovoy, Nature Materials 6, 13\n(2007).\n[2] T. Kimura, Annu. Rev. Mater. Res 37, 387 (2007).\n[3] T. Lottermoser et al., Nature 430, 541 (2004).\n[4] C. Ederer and N. A. Spaldin, Phys. Rev. B 74,\n020401(R) (2006).\n[5] T. Zhao et al., Nature Materials 5, 823 (2006).\n[6] Y. Yamasaki et al., Phys. Rev. Lett. 98, 147204 (2007).\n[7] D. L. Fox and J. F. Scott, J. Phys. C: Solid State Phys.\n10, L329 (1977).\n[8] R. Ramesh and N. A. Spaldin, Nature Materials 6, 21\n(2007).\n[9] W. Eerenstein, N. D. Mathur, and J. F. Scott, Nature\n442, 759 (2006).\n[10] J. F. Scott, Science 315, 954 (2007).\n[11] I. Dzyaloshinskii, J. Phys. Chem. Solids 4, 241 (1958).\n[12] T. Moriya, Phys. Rev. 120, 91 (1960).\n[13] C. Ederer and N. A. Spaldin, Phys. Rev. B 71,\n060401(R) (2005).\n[14] I. Dzyaloshinskii, Soviet Physics JETP 19, 960 (1964).\n[15] More generally, a spiral may be \"unwound\" [9] by doping,\nhigh magnetic fields, or strain. See for example: F. Bai\net al., Appl. Phys. Lett. 86, 032511 (2005).\n[16] J. B. Goodenough and J. J. Stickler, Phys. Rev. 164, 768\n(1967).\n[17] J. Ko and C. T. Prewitt, Phys. Chem. Minerals 15, 355\n(1988).\n[18] L. C. Ming et al., American Mineralogist 91, 120 (2006).\n[19] V. I. Anisimov et al., J. Phys.: Condens. Matt. 9, 767\n(1997).\n[20] G. Kresse and J. Hafner, Phys. Rev. B 47, R558 (1993);\nG. Kresse and J. Furthmüller, ibid. 54, 11169 (1996).\n[21] P. E. Blöchl, Phys. Rev. B 50, 17953 (1994); G. Kresse\nand D. Joubert, ibid. 59, 1758 (1999).\n[22] Total energy calculations for 10 linearly independent spin\nconfigurations were performed in an 80-atom supercell.\n[23] S. C. Abrahams et al., Phys. Rev 172, 551 (1968).\n[24] R. D. King-Smith, and D. Vanderbilt, Phys. Rev. B 47,\nR1651 (1993).\n[25] J. Samuel Smart, Effective Field Theories of Magnetism\n(Saunders Company, Philadelphia 1966).\n[26] The trend is also consistent with D ∼ ∆gJ, where ∆g is\nthe change in the g-factor. See Refs. 12, 16.\n[27] We performed further calculations with L and P initialized in several directions, all results are consistent with\nthe symmetry of this interaction, i.e., Pz (Lx My −Ly Mx ).\n[28] F. Keffer, Phys. Rev. 126, 896 (1962).\n[29] A. S. Moskvin, JEPT 104, 913 (2007).\n\n\f"}