{"id": "http://arxiv.org/abs/1003.5841v1", "guidislink": true, "updated": "2010-03-30T15:13:52Z", "updated_parsed": [2010, 3, 30, 15, 13, 52, 1, 89, 0], "published": "2010-03-30T15:13:52Z", "published_parsed": [2010, 3, 30, 15, 13, 52, 1, 89, 0], "title": "Mode-balancing far field control of light localization in nanoantennas", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1003.0494%2C1003.0541%2C1003.1930%2C1003.6042%2C1003.4979%2C1003.4948%2C1003.0407%2C1003.0809%2C1003.5979%2C1003.2173%2C1003.2654%2C1003.5514%2C1003.3817%2C1003.1446%2C1003.1210%2C1003.5402%2C1003.5227%2C1003.1656%2C1003.4379%2C1003.4271%2C1003.2804%2C1003.2443%2C1003.5555%2C1003.2751%2C1003.5040%2C1003.4663%2C1003.5047%2C1003.4042%2C1003.1010%2C1003.0447%2C1003.1441%2C1003.0049%2C1003.1538%2C1003.3780%2C1003.0653%2C1003.1743%2C1003.5199%2C1003.1587%2C1003.5119%2C1003.1648%2C1003.2247%2C1003.3961%2C1003.5734%2C1003.5977%2C1003.5611%2C1003.3335%2C1003.1356%2C1003.5661%2C1003.0916%2C1003.1026%2C1003.2618%2C1003.0449%2C1003.3699%2C1003.5482%2C1003.4930%2C1003.2693%2C1003.0907%2C1003.3539%2C1003.5343%2C1003.3503%2C1003.1399%2C1003.1706%2C1003.3426%2C1003.2267%2C1003.4653%2C1003.0830%2C1003.5132%2C1003.2856%2C1003.5353%2C1003.2269%2C1003.2874%2C1003.2085%2C1003.2057%2C1003.5066%2C1003.2917%2C1003.1009%2C1003.5914%2C1003.2843%2C1003.4439%2C1003.4286%2C1003.4430%2C1003.1864%2C1003.2271%2C1003.3914%2C1003.1692%2C1003.2685%2C1003.1860%2C1003.4370%2C1003.2648%2C1003.5596%2C1003.1256%2C1003.5249%2C1003.5841%2C1003.3161%2C1003.0804%2C1003.5992%2C1003.1833%2C1003.1878%2C1003.4279%2C1003.5428%2C1003.4613&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Mode-balancing far field control of light localization in nanoantennas"}, "summary": "Light localization is controlled at a scale of lambda/10 in the harmonic\nregime from the far field domain in a plasmonic nanoantenna. The nanoantenna\nunder study consists of 3 aligned spheres 50 nm in diameter separated by a\ndistance of 5 nm. By simply tuning the orientation of an incident plane wave,\nsymmetric and antisymmetric mode-balancing induces a strong enhancement of the\nnear field intensity in one cavity while nullifying the light intensity in the\nother cavity. Furthermore, it is demonstrated that the dipolar moment of a\nplasmonic particle can be fully extinguished when strongly coupled with a dimer\nof identical nanoparticles. Consequently, optical transparency can be achieved\nin an ultra-compact symmetric metallic structure.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1003.0494%2C1003.0541%2C1003.1930%2C1003.6042%2C1003.4979%2C1003.4948%2C1003.0407%2C1003.0809%2C1003.5979%2C1003.2173%2C1003.2654%2C1003.5514%2C1003.3817%2C1003.1446%2C1003.1210%2C1003.5402%2C1003.5227%2C1003.1656%2C1003.4379%2C1003.4271%2C1003.2804%2C1003.2443%2C1003.5555%2C1003.2751%2C1003.5040%2C1003.4663%2C1003.5047%2C1003.4042%2C1003.1010%2C1003.0447%2C1003.1441%2C1003.0049%2C1003.1538%2C1003.3780%2C1003.0653%2C1003.1743%2C1003.5199%2C1003.1587%2C1003.5119%2C1003.1648%2C1003.2247%2C1003.3961%2C1003.5734%2C1003.5977%2C1003.5611%2C1003.3335%2C1003.1356%2C1003.5661%2C1003.0916%2C1003.1026%2C1003.2618%2C1003.0449%2C1003.3699%2C1003.5482%2C1003.4930%2C1003.2693%2C1003.0907%2C1003.3539%2C1003.5343%2C1003.3503%2C1003.1399%2C1003.1706%2C1003.3426%2C1003.2267%2C1003.4653%2C1003.0830%2C1003.5132%2C1003.2856%2C1003.5353%2C1003.2269%2C1003.2874%2C1003.2085%2C1003.2057%2C1003.5066%2C1003.2917%2C1003.1009%2C1003.5914%2C1003.2843%2C1003.4439%2C1003.4286%2C1003.4430%2C1003.1864%2C1003.2271%2C1003.3914%2C1003.1692%2C1003.2685%2C1003.1860%2C1003.4370%2C1003.2648%2C1003.5596%2C1003.1256%2C1003.5249%2C1003.5841%2C1003.3161%2C1003.0804%2C1003.5992%2C1003.1833%2C1003.1878%2C1003.4279%2C1003.5428%2C1003.4613&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Light localization is controlled at a scale of lambda/10 in the harmonic\nregime from the far field domain in a plasmonic nanoantenna. The nanoantenna\nunder study consists of 3 aligned spheres 50 nm in diameter separated by a\ndistance of 5 nm. By simply tuning the orientation of an incident plane wave,\nsymmetric and antisymmetric mode-balancing induces a strong enhancement of the\nnear field intensity in one cavity while nullifying the light intensity in the\nother cavity. Furthermore, it is demonstrated that the dipolar moment of a\nplasmonic particle can be fully extinguished when strongly coupled with a dimer\nof identical nanoparticles. Consequently, optical transparency can be achieved\nin an ultra-compact symmetric metallic structure."}, "authors": ["Alexis Devilez", "Brian Stout", "Nicolas Bonod"], "author_detail": {"name": "Nicolas Bonod"}, "author": "Nicolas Bonod", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1103/PhysRevB.81.245128", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1003.5841v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1003.5841v1", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "physics.optics", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "physics.optics", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "cond-mat.mes-hall", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1003.5841v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1003.5841v1", "arxiv_comment": null, "journal_reference": null, "doi": "10.1103/PhysRevB.81.245128", "fulltext": "APS/123-QED\n\nMode-balancing far field control of light localization in\nnanoantennas\nAlexis Devilez, Brian Stout, and Nicolas Bonod∗\nInstitut Fresnel, Aix-Marseille Université,\n\narXiv:1003.5841v1 [physics.optics] 30 Mar 2010\n\nCNRS, Domaine universitaire de Saint-Jérôme,\n13397 Marseille, France\n\n(Dated: October 25, 2018)\n\nAbstract\nLight localization is controlled at a scale of λ/10 in the harmonic regime from the far field domain\nin a plasmonic nanoantenna. The nanoantenna under study consists of 3 aligned spheres 50 nm in\ndiameter separated by a distance of 5 nm. By simply tuning the orientation of an incident plane\nwave, symmetric and antisymmetric mode-balancing induces a strong enhancement of the near\nfield intensity in one cavity while nullifying the light intensity in the other cavity. Furthermore, it\nis demonstrated that the dipolar moment of a plasmonic particle can be fully extinguished when\nstrongly coupled with a dimer of identical nanoparticles. Consequently, optical transparency can\nbe achieved in an ultra-compact symmetric metallic structure.\nPACS numbers: Valid PACS appear here\n\n1\n\n\fMetallic nanostructures offer the opportunity to strongly focus light and to enhance lightmatter interactions at the nanometer scale via the excitation of localized surface plasmon\nresonances. In 2002, Stockman et al. demonstrated the dynamic control of the field enhancement at nanometer scale in arbitrary nanostructures [1] by adjusting the phase and the polarization of an excitation pulse. Active control of field localization has been experimentally\ndemonstrated through the use of an iterative learning algorithm to shape the femtosecond\nexcitation pulse [2]. Deterministic structures such as arrays of spherical nanoparticles have\nbeen investigated by Koenderinck et al. [3] to serve as unique and reproducible lithographic\nmasks for imprinting different near field patterns. They varied the angle of incidence and\npolarization of the continuous excitation beam in order to produce a variety of patterns in\na photosensitive substrate. These studies convincingly demonstrated that incident beam\nshaping can induce different field distributions in a single metallic nanostructure.\nIn 2006, Le Perchec et al. controlled the localization of light in coupled slits milled in a\nmetallic substrate [4]. The slits had a thickness of 200 nm and were separated by a distance\nof 500 nm. When illuminated in oblique incidence in the infrared spectrum, they coupled\nincident propagating light to both symmetric and anti-symmetric modes. By the use of a\nsecond identical frequency propagating wave in opposite incidence, they could switch the\nnear field enhancement from one slit to the other via phase adjustments. This simple system\nprovided a means to conceive subwavelength optical switch components controlled from the\nfar field region. Very recently, Volpe et al. [5] investigated spatial phase modulations of high\norder beams such as Laguerre-Gaussian beams in order to control the near field in plasmonic\nnanostructures. They considered two 50 nm gaps formed by three 500 nm aligned gold bars\nand demonstrated that spatial phase modulation of the incident beam enables switching light\non and off in either of the two sites. The aim of this paper is to theoretically study a linear\ntrimer of identical spherical nanoparticles to tune the localization of light at the nanometer\nscale (∼55 nm). In particular, we investigate the near field enhancement occuring between\ngold nanospheres 50 nm in diameter. The three spherical nanoparticles are arranged to\nform two identical cavities in which the near field can be strongly enhanced. This provides\na simple system with two coupled nanocavities separated by a distance of about a tenth of\nthe incident wavelength. It will be shown that this a priori symmetric system enables the\nconcentration of light in a single cavity while employing a single illumination plane wave.\nWe investigate a system consisting of three identical gold nanospheres placed along the\n2\n\n\fFIG. 1: Layout of the numerical experiment. Three identical gold nanospheres 50 nm in diameter,\nembedded in a dielectric background of refractive index n0 = 1.5, are placed along the z-axis. The\nsystem is illuminated by a plane wave with a TM polarization with an angle of incidence θ between\nthe propagation direction and the z-axis. Calculations are performed using generalized Mie theory\ncombined with an analytic multiple scattering formulation.\n\nx-axis with a diameter of 50 nm and embedded in a polymer substrate with a refractive\nindex of 1.5 (Fig. 1). The choice of the structure is motivated by the study of Bidault et\nal. [6] where well-defined groupings of Au nanoparticles with controlled nanometer spacing\nwere synthesized by hybridizing monoconjugated DNA in a polymeric material of refractive\nindex n0 = 1.5. This bottom-up technology opens up a way to conceive coupled cavities\nmade of nanoparticles separated by a few nanometers, currently unobtainable via classical\nlithography techniques.\nThis model system is illuminated by a plane wave with TM polarization (the magnetic\nfield is perpendicular to the plane presented in Fig. 1) and an angle of incidence, θ, tunable\nbetween 0 (propagation along the z-axis) and 90 degrees. The strong contrasts of near field\nintensities at scales much smaller than the incident wavelength require a full electromagnetic\nstudy based on solving the Maxwell equations. Rigorous Lorentz-Mie theory is employed in\norder to accurately calculate the near field enhancement in the vicinity of a single spherical metallic nanoparticle. With this technique, electromagnetic fields inside the sphere and\nin the surrounding medium are expanded using basis sets of Vector Spherical Harmonics\n(VSHs), which allow an analytic satisfaction of the boundaries conditions. The expansion\nof an arbitrary vector field is given in Eq. (1) in terms of the Vector Spherical Harmonics.\n3\n\n\fThe VSHs provide an angular description of the vectorial field and are defined in terms of\n(X,Y,Z)\n\nthe Scalar Spherical Harmonics Yn,m (θ, φ) in Eq. (2). The En,m\n\nare their respective coef-\n\nficients that describe the radial dependency of the field according to the medium properties.\nInteractions between particles are taken into account by invoking the translation/addition\ntheorem in order to solve the Foldy-Lax multiple scattering equations [7, 8]. The truncation\nof the basis sets, necessary for a numerical solving of this system of equations, is determined from the size parameter of the spheres and the strength of electromagnetic couplings\nbetween the particles, and results in a finite dimensional T-matrix describing the electromagnetic response of the entire system [9]. In this study, high multipolar orders are required\nto accurately reconstruct the field which will be taken into account by imposing nmax = 10\nin Eq. (1). The dispersion of the dielectric constant of gold is interpolated from the Palik\ndatabase [10].\n\n∞ X\nn\nh\ni\nX\n→\n−\n→\n−\n→\n−\n→\n−\n(Y )\n(X)\n(Z)\nE (r) =\nEn,m\n(r) Y n,m (θ, φ) + En,m\n(r) X n,m (θ, φ) + En,m\n(r) Z n,m (θ, φ)\n\n(1)\n\nn=0 m=−n\n\n→\n−\nY n,m (θ, φ) ≡ Yn,m (θ, φ)b\nr\n→\n−\n→\n−\nX n,m (θ, φ) ≡ Z n,m (θ, φ) × b\nr\n→\n−\n→\n−\nr ∇Yn,m (θ, φ)\nZ n,m (θ, φ) ≡ p\nn(n + 1)\n\n(2a)\n(2b)\n(2c)\n\nWe first investigate the far field response of the trimer by rigorously calculating the spectral response of the extinction cross-section for different angles of incidence (Fig. 2a). For an\nincident angle θ = 0◦ (blue line) corresponding to an illumination along the z-axis, only one\nmaximum appears at the wavelength of 560 nm, which is almost the wavelength of resonance\nof the isolated sphere (red line). Assuming an incident electric field along the x-axis, it can\nbe deduced that this resonance is due to in-phase plasmon oscillations occuring transversally to the chain axis resulting in weak couplings between the individual nanoparticles\nresonances. At normal incidence (θ = 90◦ : black line), a stronger resonance occurs at the\nwavelength of 665 nm, corresponding to the well-known red-shifted coupled resonance of inphase longitudinal modes [11]. Fig. 2b illustrates the strong near field enhancement between\nthe spheres when the trimer is illuminated at λ = 665 nm. When the chain is illuminated\n4\n\n\fat normal incidence, only in-phase longitudinal oscillations of the polarization moments are\nexcited. These oscillations induce surface charges of opposite sign in the dielectric interparticle gap responsible for the strong electric field enhancement. Such longitudinal modes\nhave been studied extensively in the context of dimers of metallic spheres and nanoshells\n[11–16]. We remark that for the case of normal incidence, there exists a weak second peak\nat higher frequency which is made possible thanks to quadrupolar response contributions.\nAt intermediate angles of incidence (like the case θ = 45◦ displayed in Fig. 2a), we observe\ntwo peaks at frequencies close to those observed respectively at θ = 0◦ and θ = 90◦ .\n\nFIG. 2: (a) Extinction cross-section of a chain of three gold particles of diameter D = 50 nm (red\nline) separated by w = 5 nm in the full electromagnetic approach. Different angles of incidence\nare displayed: θ = 0◦ (blue line), θ = 45◦ (green line) and θ = 90◦ (black line). The isolated sphere\nextinction cross-section is also displayed (red line). (b) Electric field intensity kEk2 /kEinc k2 map\nin log scale for a trimer illuminated at λ = 665 nm under normal incidence\n\nTable. I illustrates the dipolar eigenmodes that may be excited in a linear trimer. Although the dipolar approximation fails to describe accurately the resonance when the particles are strongly coupled, it enables a clear distinction between modes that are perpendicular\n(transverse) and parallel (longitudinal) to the chain axis [17]. From the extinction crosssection displayed in Fig. 2a, one can observe that only the in-phase modes denoted T1 and\nL1 are clearly visible. This observation may seem surprising since except for illumination\nat θ = 0◦ or θ = 90◦ where the symmetries of the configuration impose in-phase modes,\ncoupling between the incident field and opposite-phase modes may be possible when illuminating the system at oblique incidence. Inspection of the opposite-phase modes in Table. I\nshows however that the total dipolar moment involved in these modes is weaker than that\noccurring for in-phase modes. Consequently, these modes are not easily coupled to the far\nfield and cannot be observed in extinction cross-section plots.\n5\n\n\fTABLE I: Possible dipolar eigen modes for a linear chain of three plasmonic particles\nT1 ↑ ↑ ↑ In-phase mode\nTransverse eigenmodes\n\nT2 ↓ ↑ ↑ Opposite-phase\nT3 ↑ ↓ ↑\n\nmodes\n\nL1 → → → In-phase mode\nLongitudinal eigenmodes L2 ← → → Opposite-phase\nL3 ← → ←\n\nmodes\n\nLet us emphasize that we are interested in the vanishing of the near field enhancements\nin one of the cavities. This purpose requires an excitation via the far field of longitudinal\nopposite-phase modes, modes that are associated with a weak dipolar moment. Fig. 3a\ndisplays the near field intensity enhancement calculated at the center of the cavities as a\nfunction of the incident wavelength, when incident angle θ is equal to 45 degrees. These plots\nshow that the field intensities in the two cavities are quite different, but most interestingly\nthey reveal the counterintiutive occurence that at λ = 595 nm (green line) a rather strong\nfield intensity enhancement in gap 2 is concurrent with a near vanishing of the field in gap\n1 (ratio larger than 500). This phenomenon is even more conspicuous in the near field\nintensity map displayed in Fig. 3b in logarithmic scale that clearly shows that at λ = 595\nnm, the light intensity is confined in only one site. This is the most striking result of this\nstudy: the sub-wavelength cavity 1 is turned-off and the light intensity is almost entirely\nlocalized inside cavity 2 while both cavities are separated by only 55 nm. It appears that\nthis phenomenon cannot be observed from the far field response since the extinction cross\nsection (green line in Fig. 2a) does not exhibit any notable feature. We next move towards\nthe full understanding of the longitudinal eigen modes involved in this phenomenon, which\nwill require the extraction of longitudinal terms in the multipole formalism.\nThe extraction of the longitudinal components of the field requires that we focus attention\non the Scalar Spherical Harmonics that are defined in Eq. (3) in terms of the associated\nLegendre polynomials Pnm (cos θ).\nYnm (θ, φ) ≡ cn,m Pnm (cos θ) exp(imφ)\n\n6\n\n(3)\n\n\fFIG. 3: (a) Intensity enhancement in cavity 1 (red line) and cavity 2 (black line) for θ = 45◦ . The\nvertical line indicates the wavelength of 595 nm where the intensity contrast is maximum. (b)\nElectric field intensity, kEk2 /kEinc k2 , map in log scale at λ = 595 nm and θ = 45◦ .\n\nwhere\n\u0014\n\ncn,m\n\n2n + 1 (n − m)!\n≡\n4π (n + m)!\n\n\u0015 12\n(4)\n\nThe associated Legendre polynomials Pnm (cos θ) have the following property:\n∀m 6= 0\n\nPnm (±1) = 0\n\nPn0 (±1) = (±1)n\n\n(5a)\n(5b)\n\nEq. 5 demonstrates that the field distribution along the z-axis, corresponding to cos θ =\n±1 can be entirely described by taking the scalar spherical harmonics Yn,0 . Fig. 4a shows the\nfield reconstructed by imposing m = 0 in Eq.(1) with the same conditions of illumination\nas in Fig. 2b. Comparison of these two maps illustrates that the longitudinal in-phase\nresonances can be fully described when imposing m = 0 and that this method can be\nconsidered as a relevant way to study the longitudinal modes of the structure. It must\nbe stressed that these longitudinal contributions include the three directions of the field\n→\n−\n→\n−\n→\n−\nX n,0 , Y n,0 and Z n,0 . The contribution of the electric field oriented along the chain axis\n(Y )\n\nis then given by the terms En,0 (r)Yn,0 in Eq.(1). Fig. 4b shows the phase of the field\n(Y )\n\nreconstructed with the terms En,0 (r)Yn,0 . The in-phase oscillations of the longitudinal mode\nin the structure are clearly highlighted. Let us remark that the polarization moment inside\nthe particles shows a clear dipolar-like behaviour.\nWe now apply this formalism to study the phenomenon observed in Fig. 3. Fig. 5a\ndisplays the longitudinal multipole contributions to the field at λ = 595 nm and θ = 45◦\nobtained by reconstructing the field intensity map with (n, m) = (n, 0). It highlights that\n7\n\n\fFIG. 4: (a) Electric field intensity kEk2 /kEinc k2 map in log scale of the longitudinal contributions\nreconstructed imposing (n, m) = (n, 0) in Eq. (1) and (b) phase of the field reconstructed with the\n(Y )\n\nterms En,0 (r)Yn,0 in Eq. (1) at λ = 665 nm and θ = 90◦ .\n\nthe vanishing of the near field in cavity 1 associated with the high intensity enhancement\nin cavity 2, which are the striking features observed in Fig. 5a, are essentially obtained. It\nshows that the intensity contrast observed is due to the excitation of longitudinal modes\nin the structure. More precisely, the phase of the longitudinal electric field displayed in\nFig. 5b, obtained under the same conditions as Fig. 4a, shows that the mode L2 depicted\nin Table. I is predominantly excited. The oblique illumination has enabled the coupling\nof the incident light to an opposite-phase mode that is responsible for a vanishing of the\nfield in cavity 1 while the field in cavity 2 is strongly enhanced. Let us emphasize that the\nelectric field oscillations are principally dipolar in nature and that the longitudinal mode\nobserved in Fig. 3 involves predominantly dipolar contributions. Unlike the case illustrated\nin Fig. 4a, Fig. 5a clearly shows a weak longitudinal induced polarization inside sphere\n1. The asymmetry of the electric field amplitudes inside the spheres in Fig. 5a indicates\nnot only that the L2 mode is excited, but that a combination of the three longitudinal\nmodes (Table. I) is involved. This result shows that it is possible to nearly extinguish\nthe longitudinal moment of a metallic nanoparticle by simply coupling this particle with a\ndimer of identical particles. It means that optical transparency [18] can be achieved with\nparticles which do not support transverse modes, i.e. ellipsoidal or rectangular nanoparticles.\nConsequently, this study demonstrates that the dipolar moment of a plasmonic particle can\nbe fully extinguished in ultra compact symmetric structures.\nThis study demonstrates that antisymmetric modes can be excited in a linear trimer\nof identical particles by simply tuning the angle of incidence. Furthermore, we show that\nin a narrow frequency range, symmetric and antisymmetric mode-balancing extinguishes\n\n8\n\n\fFIG. 5: (a) Electric field intensity kEk2 /kEinc k2 map in log scale of the longitudinal contributions\nreconstructed imposing (n, m) = (n, 0) in Eq. (1) and (b) phase of the field reconstructed with the\n(Y )\n\nterms En,0 (r)Yn,0 in Eq. (1) at λ = 565 nm and θ = 45◦ .\n\nthe dipolar longitudinal moment of a metallic nanosphere coupled to a dimer composed of\nidentical nanospheres. At this frequency, the total longitudinal moment of the trimer is\nweak and this phenomenon is not associated with an enhancement of the scattering crosssection of the trimer. This nearly zero longitudinal moment of sphere 1 leads to a near\nvanishing light intensity in cavity 1, and the high longitudinal moment of sphere 3 leads to\nstrong enhancement of light intensity in cavity 2. Finally, we wish to emphasize that this\nphenomenon occurs in a simple fully sub-wavelength system by employing straighforward farfield control in the harmonic regime. Specifically, it enables the control of light localization\nbetween two identical nanosites separated by a distance of 55 nm, leading to a spatial\nresolution of λ/10.\nThe authors thank S. Bidault and R. C. McPhedran for stimulating discussions.\n\n∗\n\nElectronic address: nicolas.bonod@fresnel.fr\n\n[1] M. I. Stockman, S. V. Faleev, and D. J. Bergman, Phys. Rev. Lett. 88, 067402 (2002).\n[2] M. Aeschlimann, M. Bauer, D. Bayer, T. Brixner, F. J. Garcı́a de Abajo, W. Pfeiffer,\nM. Rohmer, C. Spindler, and F. Steeb, Nature 446, 301 (2007).\n[3] A. F. Koenderink, J. V. Hernandez, F. Rochibeaux, L. D. Noordam, and A. Polman, Nanoletters 7, 745 (2007).\n[4] J. Le Perchec, P. Quémerais, A. Barbara, and T. Lopez-Rios, Phys. Rev. Lett. 97, 036405\n(2006).\n[5] G. Volpe, S. Cherukulappurath, R. J. Parramon, G. Molina-Terriza, and R. Quidant, Nanolet-\n\n9\n\n\fters 9, 3608 (2009).\n[6] S. Bidault, F. J. Garcı́a de Abajo, and A. Polman, J. Am. Chem. Soc 130, 2750 (2008).\n[7] M. Lax, Rev. Mod. Phys. 23, 287 (1951).\n[8] B. Stout, J. C. Auger, and A. Devilez, J. Opt. Soc. Am. A 25, 2549 (2008).\n[9] W. J. Wiscombe, Appl. Opt. 19, 1505 (1980).\n[10] E. D. Palik, Handbook of optical constants of solids (Academic Press, New York, 1985).\n[11] W. Rechberger, A. Hohenau, A. Leitner, J. R. Krenn, B. Lamprecht, and F. R. Aussenegg,\nOpt. Comm. 220, 137 (2003).\n[12] D. J. Bergman and D. Strout, Phys. Rev. B 22, 3527 (1980).\n[13] H. Tamaru, H. Kuwata, H. T. Miyazaki, and K. Miyano, Appl. Phys. Lett. 80, 1826 (2002).\n[14] K. Li, M. I. Stockman, and D. J. Bergman, Phys. Rev. Lett. 91, 227402 (2003).\n[15] J. B. Lassiter, J. Aizpurua, L. I. Hernandez, D. W. Brandl, I. Romero, S. Lal, J. H. Hafner,\nP. Nordlander, and N. J. Halas, Nanoletters 8, 1212 (2008).\n[16] P. Nordlander, C. Ourbe, E. Prodan, K. Li, and M. I. Stockman, Nanoletters 4, 899 (2004).\n[17] M. Quinten and U. Kreibig, Appl. Opt. 32, 6137 (1993).\n[18] S. Zhang, D. A. Genov, Y. Wang, M. Liu, and X. Zhang, Phys. Rev. Lett. 101, 047401 (2008).\n\n10\n\n\f"}