{"id": "http://arxiv.org/abs/1101.4948v2", "guidislink": true, "updated": "2011-10-18T15:49:54Z", "updated_parsed": [2011, 10, 18, 15, 49, 54, 1, 291, 0], "published": "2011-01-25T21:03:33Z", "published_parsed": [2011, 1, 25, 21, 3, 33, 1, 25, 0], "title": "A Minimal Inflation Scenario", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1101.5758%2C1101.0887%2C1101.1891%2C1101.1091%2C1101.3179%2C1101.5400%2C1101.1136%2C1101.5806%2C1101.1500%2C1101.4921%2C1101.5089%2C1101.4809%2C1101.0165%2C1101.0412%2C1101.2260%2C1101.0331%2C1101.3694%2C1101.1744%2C1101.5167%2C1101.1594%2C1101.1082%2C1101.1639%2C1101.5732%2C1101.2277%2C1101.2846%2C1101.0650%2C1101.3135%2C1101.2781%2C1101.2070%2C1101.6047%2C1101.3213%2C1101.5802%2C1101.2624%2C1101.2574%2C1101.0902%2C1101.5835%2C1101.5312%2C1101.1809%2C1101.3919%2C1101.5146%2C1101.4869%2C1101.6028%2C1101.4217%2C1101.5881%2C1101.3013%2C1101.0584%2C1101.4673%2C1101.0597%2C1101.5710%2C1101.0401%2C1101.2097%2C1101.2215%2C1101.0029%2C1101.2022%2C1101.5392%2C1101.0190%2C1101.4948%2C1101.1026%2C1101.5921%2C1101.3884%2C1101.0070%2C1101.0224%2C1101.5901%2C1101.4103%2C1101.3143%2C1101.0931%2C1101.5072%2C1101.3527%2C1101.2716%2C1101.3945%2C1101.2967%2C1101.3070%2C1101.4934%2C1101.1262%2C1101.3241%2C1101.2041%2C1101.5384%2C1101.5107%2C1101.5975%2C1101.0616%2C1101.0148%2C1101.1864%2C1101.2538%2C1101.5164%2C1101.5564%2C1101.3524%2C1101.4151%2C1101.1697%2C1101.0783%2C1101.5413%2C1101.4052%2C1101.2820%2C1101.2782%2C1101.3939%2C1101.2389%2C1101.6046%2C1101.1435%2C1101.1603%2C1101.3075%2C1101.1617%2C1101.2880&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "A Minimal Inflation Scenario"}, "summary": "We elaborate on a minimal inflation scenario based entirely on the general\nproperties of supersymmetry breaking in supergravity models. We identify the\ninflaton as the scalar component of the Goldstino superfield. We write\nplausible candidates for the effective action describing this chiral\nsuperfield. In particular the theory depends (apart from parameters of O(1)) on\na single free parameter: the scale of supersymmetry breaking. This can be fixed\nusing the amplitude of CMB cosmological perturbations and we therefore obtain\nthe scale of supersymmetry breaking to be 10^{12-14} GeV. The model also\nincorporates explicit R-symmetry breaking in order to satisfy the slow roll\nconditions. In our model the eta-problem is solved without extra fine-tuning.\nWe try to obtain as much information as possible in a model independent way\nusing general symmetry properties of the theory's effective action, this leads\nto a new proposal on how to exit the inflationary phase and reheat the\nUniverse.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1101.5758%2C1101.0887%2C1101.1891%2C1101.1091%2C1101.3179%2C1101.5400%2C1101.1136%2C1101.5806%2C1101.1500%2C1101.4921%2C1101.5089%2C1101.4809%2C1101.0165%2C1101.0412%2C1101.2260%2C1101.0331%2C1101.3694%2C1101.1744%2C1101.5167%2C1101.1594%2C1101.1082%2C1101.1639%2C1101.5732%2C1101.2277%2C1101.2846%2C1101.0650%2C1101.3135%2C1101.2781%2C1101.2070%2C1101.6047%2C1101.3213%2C1101.5802%2C1101.2624%2C1101.2574%2C1101.0902%2C1101.5835%2C1101.5312%2C1101.1809%2C1101.3919%2C1101.5146%2C1101.4869%2C1101.6028%2C1101.4217%2C1101.5881%2C1101.3013%2C1101.0584%2C1101.4673%2C1101.0597%2C1101.5710%2C1101.0401%2C1101.2097%2C1101.2215%2C1101.0029%2C1101.2022%2C1101.5392%2C1101.0190%2C1101.4948%2C1101.1026%2C1101.5921%2C1101.3884%2C1101.0070%2C1101.0224%2C1101.5901%2C1101.4103%2C1101.3143%2C1101.0931%2C1101.5072%2C1101.3527%2C1101.2716%2C1101.3945%2C1101.2967%2C1101.3070%2C1101.4934%2C1101.1262%2C1101.3241%2C1101.2041%2C1101.5384%2C1101.5107%2C1101.5975%2C1101.0616%2C1101.0148%2C1101.1864%2C1101.2538%2C1101.5164%2C1101.5564%2C1101.3524%2C1101.4151%2C1101.1697%2C1101.0783%2C1101.5413%2C1101.4052%2C1101.2820%2C1101.2782%2C1101.3939%2C1101.2389%2C1101.6046%2C1101.1435%2C1101.1603%2C1101.3075%2C1101.1617%2C1101.2880&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We elaborate on a minimal inflation scenario based entirely on the general\nproperties of supersymmetry breaking in supergravity models. We identify the\ninflaton as the scalar component of the Goldstino superfield. We write\nplausible candidates for the effective action describing this chiral\nsuperfield. In particular the theory depends (apart from parameters of O(1)) on\na single free parameter: the scale of supersymmetry breaking. This can be fixed\nusing the amplitude of CMB cosmological perturbations and we therefore obtain\nthe scale of supersymmetry breaking to be 10^{12-14} GeV. The model also\nincorporates explicit R-symmetry breaking in order to satisfy the slow roll\nconditions. In our model the eta-problem is solved without extra fine-tuning.\nWe try to obtain as much information as possible in a model independent way\nusing general symmetry properties of the theory's effective action, this leads\nto a new proposal on how to exit the inflationary phase and reheat the\nUniverse."}, "authors": ["Luis Alvarez-Gaume", "Cesar Gomez", "Raul Jimenez"], "author_detail": {"name": "Raul Jimenez"}, "author": "Raul Jimenez", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1088/1475-7516/2011/03/027", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1101.4948v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1101.4948v2", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "matches published version (typo corrected)", "arxiv_primary_category": {"term": "hep-th", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "hep-th", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "astro-ph.CO", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "hep-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1101.4948v2", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1101.4948v2", "journal_reference": "JCAP 1103:027,2011", "doi": "10.1088/1475-7516/2011/03/027", "fulltext": "Preprint typeset in JHEP style - PAPER VERSION\n\nA Minimal Inflation Scenario\n\narXiv:1101.4948v2 [hep-th] 18 Oct 2011\n\nLuis Álvarez-Gaumé1 , César Gómez2 , Raul Jimenez3\n1\n\nTheory Group, Physics Department, CERN, CH-1211, Geneva 23, Switzerland\n\n2\n\nPhysics Department and Instituto de Fisica Teorica UAM/CSIC, 28049 Cantoblanco,\n\nMadrid, Spain\n3\n\nICREA & ICC, University of Barcelona (IEEC-UB), Marti i Franques 1, Barcelona\n\n08028, Spain\n\nAbstract: We elaborate on a minimal inflation scenario based entirely on the general\nproperties of supersymmetry breaking in supergravity models. We identify the inflaton as\nthe scalar component of the Goldstino superfield. We write plausible candidates for the\neffective action describing this chiral superfield. In particular the theory depends (apart\nfrom parameters of O(1)) on a single free parameter: the scale of supersymmetry breaking.\nThis can be fixed using the amplitude of CMB cosmological perturbations and we therefore\nobtain the scale of supersymmetry breaking to be 1012−14 GeV. The model also incorporates\nexplicit R-symmetry breaking in order to satisfy the slow roll conditions. In our model the\nη−problem is solved without extra fine-tuning. We try to obtain as much information as\npossible in a model independent way using general symmetry properties of the theory's\neffective action, this leads to a new proposal on how to exit the inflationary phase and\nreheat the Universe.\n\n\fContents\n1. Introduction and summary of results\n\n1\n\n2. Some motivation and the minimal model\n\n3\n\n3. Phenomenology of the model\n\n5\n\n1. Introduction and summary of results\nThe inflationary paradigm provides a robust framework to explain the size, flatness, homogeneity of the universe and its perturbations [1–9]. It postulates that the universe went\nthrough a quasi de-Sitter phase in the past leading to an exponential expansion of spacetime. If this quasi de-Sitter phase is associated to a scalar field, then it can be shown,\nrather generally, that vacuum fluctuations of the field are stretched by inflation to produce\na nearly scale invariant power spectrum and with sufficient strength to produce the currently observed large scale structure in the universe [2, 9]. In spite of its successes, we still\nface several questions to be answered in inflation, namely: what is the inflaton? how do\nwe bring the universe out of the inflationary phase? how can we stop inflation and transit\nto the decelerating/accelerating universe we live in today? what sets the energy scale of\ninflation? At a more fundamental level we have to deal with the problem of explaining the\nrich dynamics of the inflaton without too many free parameters and fine tuning.\nIn a previous letter [10], guided by the idea that the inflaton should be found naturally\namong the fields of any fundamental physics model, we have exploited some generic features\nof the supersymmetry (supergravity) breaking mechanism to design a model of inflation. In\nthis model we identified the inflaton with the order parameter of supersymmetry breaking\nand associated the supersymmetry breaking scale with that generating cosmological perturbations. Under these conditions, and imposing explicit R-symmetry breaking, we showed\nthat one can obtain enough number of e-foldings (> 70) to explain the observed universe.\n\n–1–\n\n\fSupersymmetry and inflation have a long history [11–16], however in our approach we try\nto avoid making specific and concrete models and try to see to what extent generic features\nof supersymmetry breaking are enough to provide a good inflationary scenario.\nOur main motivation to propose to identify the inflaton field with the order parameter\nof supersymmetry breaking is guided by the fact that, independently of the particular\nmicroscopic mechanism driving supersymmetry breaking (in what follows we will restrict\nourselves to F -breaking ) we can, whenever we have violation of conformal invariance in the\nUV, define a superfield X whose θ component at large distances becomes the \"Goldstino\"\n(see [17, 18]). This superfield is the chiral superfield that appears in the divergence of\nthe superfield of currents, the Ferrara-Zumino (FZ) super-multiplet [19] with universal\nproperties at low energy shared by large classes of models with supersymmetry breaking.\nIn the UV the scalar component x of X is well defined as a fundamental field while in the\nIR, once supersymmetry is spontaneously broken, this scalar field becomes the superpartner\nof the Goldstino i.e a two Goldstino state. The realization of x as GG can be implemented\nby imposing a non linear constraint in the IR for the X field of the type X 2 = 0. In our\nprevious approach to inflation we used one real component of the UV x field as the inflaton.\nWe assumed the existence of a F-breaking effective superpotential for the X-superfield and\nwe induced a potential for x from gravitational corrections to the Kähler potential1 .\nIn this paper we refine our model [10] by exploring a family of Kähler potentials depending on few parameters and which can lead to a reasonable cosmology. In particular we\nconsider a simple class of models that apart from a few parameters of O(1), depend on the\nscale of supersymmetry breaking f . The Kähler potential explicitly breaks the R-symmetry\nas is needed in supergravity in order to have a slow-roll phase where the universe inflates.\nBy fitting these models to cosmological data, we can read a supersymmetry breaking scale\nof O(1012−13 ) leading to a fairly heavy gravitino. Given the scarcity of parameters in the\nmodel presented, it is quite remarkable that many cosmological constraints can be satisfied\nin such an economical manner. The minimal choice we make has to also provide a graceful\nexit from inflation without invoking a \"waterfall\" field that will bring the theory out of\nexponential expansion. In our case, the end of inflation is reached when the X-field begins\nto enter the nonlinear phase (X 2 ∼ 0), the scalar component of the FZ chiral superfield is\n1\n\nLike most inflationary theories containing supersymmetry, we present a simple model of multifield\n\ninflation (sometimes called hybrid) [20]\n\n–2–\n\n\fconverted into a pair of Goldstinos and the state of the universe can in principle be viewed\nas some weakly interacting Fermi liquid. The Fermi nature of the elementary components\nof the liquid creates the necessary pressure to exit the inflationary period. This is admittedly a far-off idea, and we are currently exploring its microscopic properties in detail. We\nexpect to report on our results in a future publication [21]. This detailed physical description is not necessary in order to explore some of the phenomenological properties of our\nmodel. This is what we will do in the rest of the paper.\nLet us insist once more that the key feature of our philosophy is to obtain the basic\nproperties of the inflation scenario (inflation, graceful exit and reheating) out of a single\nsuperfield X and the general properties of supersymmetry breaking.\n\n2. Some motivation and the minimal model\nOur inspiration for the effective model we describe in this paper was motivated by some\nnovel approaches to inflation based on Higgs field and non-minimal supergravity couplings.\nIn reference [22] (see also [23]) an approach to inflation was suggested based on the standard\nmodel Higgs potential with the Higgs field coupled to gravity in a suitable Jordan frame. In\nthis approach the role of the inflaton is played by the Higgs field and the essential features\nof inflation appear as a consequence of the chosen frame. The lagrangian for the Higgs\nfield in the Jordan frame is\nL=\n\n√\n\n−gJ (RΦ(h) − L(h; v))\n\n(2.1)\n\nwith L(h; v) the standard Higgs lagrangian with v the vev and Φ(h) a function of the Higgs\nfield defining the frame. In Einstein frame the potential is given by\nVE (h) =\n\nV (h)\nΦ(h)2\n\n(2.2)\n\nwith V (h) = λ(h2 − v 2 )2 the standard Higgs potential. For Φ(h) ∼ (MP2 + αh2 ) we observe\nthat the net effect of working in Jordan frame is to create an inflationary plateau for values\nof the Higgs field h >\n\n1\nα\n\nin Planck units. In spite of its beauty and simplicity this approach\n\nsuffers from several problems: fine tuning for α, non unitary higher order corrections etc.\nThe study of \"Higgs inflation\" was considered in supergravity with non-minimal couplings\nin [24]. The general approach using the full N = 1 supergravity theory in the Jordan frame\nwas worked out in [25, 26]. See also in this context [27–29].\n\n–3–\n\n\fWe were inspired in the construction of our model by the Jordan frame formulation,\nand by some vague similarities with no-scale supergravity theories [30]. This is what led us\nto consider together with the simplest form of a Kähler potential, a logarithmic correction.\nThis is suggested by the form of the scalar potential in the Jordan frame (see [25] for\ndetails). In the simplest case of N = 1 supergravity coupled to a single chiral superfield\nX, the scalar potential is determined completely by the Kähler potential K(X, X̄) and the\nsuperpotential W (X) [31]\nK\n2\n\nVE = e MP (−\n\n3\nW W̄ + GX,X̄ DX W DX̄ W̄ ),\nMP2\n\n(2.3)\n\nwhere the Kähler metric and the Kähler covariant derivatives are given by:\nGX,X̄ = ∂X ∂ ̄X K(X, X̄)\n\nD W (X) = ∂X W (X) +\n\n1\n∂X K W (X)\nMP2\n\n(2.4)\n\nWe now make an explicit choice for K and W .\nFor us the inflaton superfield is the FZ-chiral superfield X = z +\n\n√\n\n2 θψ + θ2 F , the\n\norder parameter of supersymmetry breaking. We will consider the simplest superpotential\nimplementing F-breaking of supersymmetry. More elaborate superpotentials often reduce\nto this one once heavy fields are integrated out. In the following MP is the Planck mass.\nW = f X + f0 MP\n\n(2.5)\n\nwith f0 some constant to be fixed later by imposing the existence of a global minimum with\nvanishing cosmological constant and with f the supersymmetry breaking scale f = μ2susy .\nAs Kähler potential K we consider\nK = X X̄+\n\na\nb\nc\nX + X̄\n(X 2 X̄+c.c.)−\n)\n(X X̄)2 −\n(X 3 X̄+c.c.)+. . . −2 MP2 log(1+\n2\n2\n2MP\nMP\n6MP\n9MP\n(2.6)\n\nThe coefficient a will be determined by the condition that the minimum of the scalar\npotential is at z = 0. With this choice, we can write explicitly (2.3) as a function of z, z̄ the\nscalar components of X, X̄. After f0 , a are determined, the condition that the potential\nis a minimum at the origin imposes some constraints on the matrix of second derivatives.\nAfter some algebra we obtain the following results:\na=0\n\nf0 = −f MP\n\nb+c−1≥0\n\n–4–\n\nb−c−1≥0\n\n(2.7)\n\n\fUsing the real components of the z-field:\n1\nz = √ (α + i β),\n2\n\n(2.8)\n\nwe can obtain their masses:\nm2α =\n\nf 2 (b + c − 1)\n,\n3M 2\n\nm2β =\n\nf 2 (b − c − 1)\n.\n3M 2\n\n(2.9)\n\nThe potential is plotted in figure I for the limiting values b = 3, c = 1 . It is easy to\nobserve that the effect of the logarithm is to induce a waterfall at the end of inflation\nwhere reheating could take place. Before entering to analyze the region where the slow\nroll conditions are achieved it is interesting to observe the form of the potential near the\nminimum z = 0 in the limiting case when b ∼ 1 and c ∼ 0. In this case both scalar fields\nare nearly massless at the origin, the potential is very flat there, and these fields could be\nused as a way of realising a quintessence scenario.\nLet us now compute the slow roll parameters \u000f and η. What we find, shown in the\nupper panels of figure II, is that slow roll inflation starts in a subplanckian region with\nfields of the order 0.1MP and ends for values of order 0.01MP .\nPushing backwards from the end of inflation 70 e-foldings we can compute the fluctuation spectrum in terms of the supersymmetry breaking scale f . This allows us to fix\nthe value of f in terms of the WMAP experimental data for the spectrum of fluctuations.\nThis WMAP graph is presented in figure III. The value of μsusy we get is O(1013 ) GeV.\nThe dependence of f on b, c is rather mild for b, c values of O(1).\nNote that in the particular limiting case b = 1, c = 0, the Kähler potential is:\nK = z z̄ +\n\n1\nz + z̄\n)\n(z z̄)2 − 2MP2 log(1 +\n2\nMP\nMP\n\n(2.10)\n\nand the R-symmetry breaking is all due to the logarithmic term. This explicit breaking is\nimportant to obtain the desired form of the potential and to satisfy the slow roll conditions.\nIf we ignore the polynomial terms in (2.10) and consider only the logarithmic part, then the\nKähler potential is invariant under imaginary shifts of z, this is analogous to what happens\nin no-scale models and helps in generating the inflationary properties of our potential.\n\n3. Phenomenology of the model\nFor the above model, leaving only as a free parameter the scale of supersymmetry breaking,\nwe are now in a position to study its phenomenology. Recall that current observations of\n\n–5–\n\n\f-0.4\nΒ\n\n-0.2\n\n-0.0010\nΒ -0.0005\n0.0000\n\n0.0\n0.2\n\n0.0005\n\n0.4\n\n0.0010\n\n0\n\n2.  ́ 10-6\n-5\n\n1.  ́ 10-6\n-10\n\n0.4\n\n0\n0.0010\n\n0.2\n\n0.0005\nΑ\n\n0.0000\nΑ\n\n0.0\n\n-0.0005\n-0.0010\n\nFigure I: The inflationary potential. Left panel: the shape of the potential, in logarithmic units of\n4\nMpl\n, for the two real fields α and β and b = 3, c = 1. Inflationary trayectories are obtained for all\n\ninitial conditions of the field as it will always slow roll toward the steep throat located at α = β ∼ 0.\nRight panel: the minimum of the potential. This time the potential is shown in linear scale. Note\nthat the potential is very flat and can therefore provide a natural candidate for quintessence.\n\nthe cosmic microwave background (CMB) provide constraints on the amplitude of the\nfluctuations, the slope of the primordial power spectrum, upper limits to the amplitud of\ngravitational waves and the minimum number of required e-foldings.\nFor simplicity we will focus in this section on particular values of b, c, although any\nother allowed values of b, c are equally easy to analyse and also provide acceptable fits\nto cosmological data. Actually it is easy to check that the value of the supersymmetry\nbreaking scale determined by the experimental data on the spectrum of fluctuations is\nalmost independent of the value of b and c. Around the line b = 1 + c one of the two\nscalar components of z is very light giving rise to some potential form of quintessence.\nGenerically the region of initial conditions leading to inflation reduces when we go deep\ninside the allowed region of values in the b, c plane. We can determine the range of values\nfor f by matching the predicted level of the fluctuation 70 e-foldings before the slow roll\nparameters \u000f, η are ∼ 1. This will provide a value for α, β (recall that z = α + iβ) at\nwhich the level of fluctuations will have to match the ones measured by WMAP7 [32]. As\nwe show below this only happens for a small range of values of f .\nFirst, we look at the overall shape of the inflaton potential. This is shown in Fig. I\nfor the case b = 3, c = 1. The left panel shows the overal shape of the inflaton for ranges\nof the real fields α, β below Mpl . Note the flatness of the potential. The deep throat at\nα = β ∼ 0 is an attractor and for any initial value of the field, it will end up the slow-roll\n\n–6–\n\n\fΗ\n\nΕ\n\n1.0\n\n0.5\n\n1.0\n\n0.0\n\n0.5\n-0.5\n\n-0.5\n\n0.0\n\n0.6\n\n0.6\n0.0\n\n0.4\n\n0.0\n0.4\n\nΒ\n\nΒ\nΑ\n\nΑ\n0.2\n\n0.2\n\n0.5\n\n0.5\n0.0\n\n0.0\n\nΕ\n\nΗ\n100\nb\n50\n\n0\n0.0020\n\n0.0010\n\n0.0015\n100\n\n0.0005\n\n0.0010\n0.0005\n\n0.0000\n100\n\n0.0000\n\n50\nb\n\n100\n\n50\nc\n\n50\nc\n0\n\n0\n\n0\n\nFigure II: In the two upper panels we plot the slow-roll parameters \u000f, η as a function of both fields,\nfor the case b = 1, c = 0, to show that there are large regions where both \u000f and η are smaller than\n1 and inflation can take place. Note also that inflation ends at α, β ∼ 0.01 and that because of η\ninflation is always sub-Planckian. In the two lower panels we plot \u000f and η as functions of the two\nparameters b, c in our potential for some typical values of α, β to show that slow-roll conditions are\nnatural in our model.\n\ntoward the origin. This throat provides the graceful exit from inflation. The right panel,\nshows the minimum of the potential, note that it is definite positive and naturally provides\na very flat direction, which could be a good candidate for quintessence.\nFig. II shows the value of the slow-roll parameters as a function of the fields α, β. Note\nthat inflation ends for α, β = 0.01 and that 70 e-foldings occur for α, β ∼ 0.1. At this point\nthe value of the spectral slope of the primordial spectrum of fluctuations is in the range\nns = 0.95 − 1.0. The predicted value of the scalar-to-tensor ratio is r < 2 × 10−3 , thus it\ncould be measurable by future experiments [33].\n\n–7–\n\n\fCMB D2\n4.  ́ 10-9\n\n3.  ́ 10-9\n\n2.  ́ 10-9\n\nWMAP7\n\n1.  ́ 10-9\nLHC Μ\n4.  ́ 10-6\n\n6.  ́ 10-6\n\n8.  ́ 10-6\n\n0.00001 Mpl\n\nFigure III: Value of the supersymmetry breaking scale μ for which the amplitud of the scalar\nfluctuations, as measured in the CMB, are matched for our minimal model with b = 1, c = 0.\n\nThe constraint on the scale of supersymmetry breaking using the amplitude of fluctuations of the CMB is shown in Fig. III.\nIn our scenario reheating will take place as a consequence of the existence of a waterfall\nthat opens at the end of the inflationary period. The peculiar features of our choice of the\ninflaton field as the bosonic component of the supersymmetry breaking order parameter\ncomes from the natural conversion of this field in the IR into pairs of Goldstinos z ∼\n\nGG\nf\n\n[17, 18]. This transmutation of the inflaton field at low energies into pairs of Goldstinos\nallows us to model the final state of the universe at the end of inflation as some sort of\nFermi liquid with Fermi momentum pF ∼ μsusy in the simplest Fermi gas approximation.\nThis Fermi gas gives us the first approximation to the positive pressure FRW phase after\ninflation. The reheating temperature we get in this \"barebone\" approximation is Trh ∼\n109 − 1011 Gev, and entropy production of the order of one. More details on the graceful\nexit provided by the transmutation of the inflaton field into Goldstino pairs will be given\nin a separate publication [21].\nAnother interesting consequence of the Goldstino transmutation of the inflaton appears\nwhen we consider fluctuations at the end of the slow roll period of inflation. In this regime\nthe spectrum of fluctuations for the composite GG field goes as k 3 that is quite irrelevant in\nthe IR [34]. Therefore, fluctuations produced during this phase, and any isocurvature mode,\nwill be at very small scales and thus swamped by non-linearities caused by gravitational\ncollapse in the decelerating FRW stage.\n\n–8–\n\n\fReferences\n[1] Guth A. H., 1981, PRD, 23, 347\n[2] Mukhanov V. F., Chibisov G. V., 1981, ZhETF Pis ma Redaktsiiu, 33, 549\n[3] Sato K., 1981, MNRAS, 195, 467\n[4] Albrecht A., Steinhardt P. J., 1982, Physical Review Letters, 48, 1220\n[5] Guth A. H., Pi S.-Y., 1982, Physical Review Letters, 49, 1110\n[6] Hawking S. W., 1982, Physics Letters B, 115, 295\n[7] Linde A. D., 1982, Physics Letters B, 108, 389\n[8] Starobinsky A. A., 1982, Physics Letters B, 117, 175\n[9] Bardeen J. M., Steinhardt P. J., Turner M. S., 1983, PRD, 28, 679\n[10] L. Álvarez-Gaumé, C. Gómez, R. Jimenez, Phys. Lett. B690, 68-72 (2010). [arXiv:1001.0010]\n[hep-th]]\n[11] J. R. Ellis, D. V. Nanopoulos, K. A. Olive and K. Tamvakis, Phys. Lett. B 118, 335 (1982).\n[12] B. A. Ovrut and P. J. Steinhardt, Phys. Lett. B 133, 161 (1983), B. A. Ovrut and\nP. J. Steinhardt, Phys. Rev. Lett. 53, 732 (1984), B. A. Ovrut and P. J. Steinhardt, Phys.\nRev. D 30, 2061 (1984), B. A. Ovrut and P. J. Steinhardt, Phys. Lett. B 147, 263 (1984).\nB. A. Ovrut and P. J. Steinhardt, P. R. Lindblom, B. A. Ovrut and P. J. Steinhardt, Phys.\nLett. B 172, 309 (1986).\n[13] G. G. Ross and G. German, arXiv:0902.4676 [hep-ph]. S. Hotchkiss, G. German, G. G. Ross\nand S. Sarkar, JCAP 0810, 015 (2008) [arXiv:0804.2634 [astro-ph]]. Z. Lalak, G. G. Ross and\nS. Sarkar, Nucl. Phys. B 766, 1 (2007) [arXiv:hep-th/0503178]. G. G. Ross, Prepared for 28th\nInternational Conference on High-energy Physics (ICHEP 96), Warsaw, Poland, 25-31 Jul\n1996 G. German, G. G. Ross and S. Sarkar, Nucl. Phys. B 608, 423 (2001)\n[arXiv:hep-ph/0103243]. G. German, G. G. Ross and S. Sarkar, Phys. Lett. B 469, 46 (1999)\n[arXiv:hep-ph/9908380]. G. G. Ross, Given at COSMO 97: 1st International Workshop on\nParticle Physics and the Early Universe, Ambleside, England, 15-19 Sep 1997 J. R. Espinosa,\nA. Riotto and G. G. Ross, Nucl. Phys. B 531, 461 (1998) [arXiv:hep-ph/9804214].\nJ. A. Adams, G. G. Ross and S. Sarkar, Nucl. Phys. B 503, 405 (1997)\n[arXiv:hep-ph/9704286]. J. A. Adams, G. G. Ross and S. Sarkar, Phys. Lett. B 391, 271\n(1997) [arXiv:hep-ph/9608336]. G. G. Ross and S. Sarkar, Nucl. Phys. B 461, 597 (1996)\n[arXiv:hep-ph/9506283]. O. Bertolami and G. G. Ross, Phys. Lett. B 183, 163 (1987).\nG. D. Coughlan and G. G. Ross, Phys. Lett. B 157, 151 (1985).\n\n–9–\n\n\f[14] G. R. Dvali, Q. Shafi and R. K. Schaefer, Phys. Rev. Lett. 73, 1886 (1994)\n[arXiv:hep-ph/9406319], G. R. Dvali, arXiv:hep-ph/9503259, G. R. Dvali, Phys. Lett. B 387,\n471 (1996) [arXiv:hep-ph/9605445], P. Binetruy and G. R. Dvali, Phys. Lett. B 388, 241\n(1996) [arXiv:hep-ph/9606342].\n[15] L. Randall, M. Soljacic and A. H. Guth, Nucl. Phys. B 472, 377 (1996)\n[arXiv:hep-ph/9512439], L. Randall, M. Soljacic and A. H. Guth, arXiv:hep-ph/9601296,\nN. Arkani-Hamed, H. C. Cheng, P. Creminelli and L. Randall, JCAP 0307, 003 (2003)\n[arXiv:hep-th/0302034], M. Dine, L. Randall and S. D. Thomas, Phys. Rev. Lett. 75, 398\n(1995) [arXiv:hep-ph/9503303].\n[16] For details and thorough references on supersymmetry and inflation see for instance:\nD. H. Lyth and A. Riotto, Phys. Rept. 314, 1 (1999) [arXiv:hep-ph/9807278].\n[17] D. V. Volkov and V. P. Akulov, Phys. Lett. B 46, 109 (1973). M. Rocek, Phys. Rev. Lett. 41,\n451-453 (1978). R. Casalbuoni, S. De Curtis, D. Dominici et al., Phys. Lett. B220, 569\n(1989), and references therein.\n[18] Z. Komargodski and N. Seiberg, JHEP 0909, 066 (2009) [arXiv:0907.2441 [hep-th]].\n[19] S. Ferrara and B. Zumino, Nucl. Phys. B 87, 207 (1975).\n[20] A. D. Linde, Phys. Rev. D 49, 748 (1994) [arXiv:astro-ph/9307002].\n[21] L. Álvarez-Gaumé, C. Gómez and Raul Jimenez: to appear.\n[22] F.L. Bezrukov and M. Shaposhnikov, The Standard Model Higgs boson as the inflaton, Phys.\nLett. B659, 703 (2008), arXiv:0710.3755. F. Bezrukov, D. Gorbunov and M. Shaposhnikov,\nJCAP 0906, 029 (2009), [arXiv:0812.3622 [hep-ph]]. J. Garcia-Bellido, D. G. Figueroa\nand J. Rubio, Phys. Rev. D79, 063531 (2009), [arXiv:0812.4624 [hep-ph]]. A. De\nSimone, M. P. Hertzberg and F. Wilczek, Phys. Lett. B678, 1 (2009), [arXiv:0812.4946\n[hep-ph]]. F. Bezrukov and M. Shaposhnikov, JHEP 0907, 089 (2009), [arXiv:0904.1537\n[hep-ph]]. A. O. Barvinsky, A. Y. Kamenshchik, C. Kiefer, A. A. Starobinsky and\nC. Steinwachs, JCAP 0912, 003 (2009), [arXiv:0904.1698 [hep-ph]].\n[23] J. L. F. Barbon and J. R. Espinosa, Phys. Rev. D 79, 081302 (2009) [arXiv:0903.0355\n[hep-ph]].\n[24] M. B. Einhorn and D. R. T. Jones, JHEP 1003, 026 (2010), [arXiv:0912.2718 [hep-ph]].\n[25] S. Ferrara, R. Kallosh, A. Linde et al., Phys. Rev. D82, 045003 (2010). [arXiv:1004.0712\n[hep-th]], and references therein.\n[26] S. Ferrara, R. Kallosh, A. Linde et al., [arXiv:1008.2942 [hep-th]].\n\n– 10 –\n\n\f[27] M. P. Hertzberg, arXiv:1002.2995 [hep-ph].\n[28] H. M. Lee, arXiv:1005.2735 [hep-ph].\n[29] R. Kallosh and A. Linde, arXiv:1008.3375 [hep-th].\n[30] E. Cremmer, S. Ferrara, C. Kounnas, D.V. Nanopoulos, Phys. Lett. B 133, 61 (1983); for a\nreview see A.B. Lahanas and D.V. Nanopoulos, Phys. Rept. 145 1 (1987).\n[31] E. Cremmer, B. Julia, J. Scherk, P. van Nieuwenhuizen, S. Ferrara and L. Girardello, Phys.\nLett. B 79, 231 (1978), E. Cremmer, B. Julia, J. Scherk, S. Ferrara, L. Girardello and P. van\nNieuwenhuizen, Nucl. Phys. B 147, 105 (1979).\n[32] Komatsu E., et al., 2009, ApJS, 180, 330\n[33] Verde L., Peiris H. V., Jimenez R., 2006, JCAP, 1, 19\n[34] Lyth D. H., 2010, arXiv, arXiv:1005.2461\n\n– 11 –\n\n\f"}