{"id": "http://arxiv.org/abs/1202.5631v3", "guidislink": true, "updated": "2012-09-10T07:08:33Z", "updated_parsed": [2012, 9, 10, 7, 8, 33, 0, 254, 0], "published": "2012-02-25T09:02:48Z", "published_parsed": [2012, 2, 25, 9, 2, 48, 5, 56, 0], "title": "Periodic-orbit approach to the nuclear shell structures with power-law\n  potential models: Bridge orbits and prolate-oblate asymmetry", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1202.5437%2C1202.4214%2C1202.1669%2C1202.6059%2C1202.6162%2C1202.3316%2C1202.3887%2C1202.1544%2C1202.6152%2C1202.2683%2C1202.5388%2C1202.2525%2C1202.6538%2C1202.0285%2C1202.4796%2C1202.0055%2C1202.4875%2C1202.0106%2C1202.1737%2C1202.6647%2C1202.3873%2C1202.1860%2C1202.4847%2C1202.1437%2C1202.4401%2C1202.4888%2C1202.4490%2C1202.2375%2C1202.5842%2C1202.1238%2C1202.6240%2C1202.6297%2C1202.6250%2C1202.5510%2C1202.6127%2C1202.4874%2C1202.5800%2C1202.2289%2C1202.3085%2C1202.4627%2C1202.0921%2C1202.3410%2C1202.4618%2C1202.5377%2C1202.4164%2C1202.0137%2C1202.1967%2C1202.5631%2C1202.2059%2C1202.4002%2C1202.0223%2C1202.2442%2C1202.4959%2C1202.4017%2C1202.3733%2C1202.5368%2C1202.2132%2C1202.3515%2C1202.5540%2C1202.4538%2C1202.0892%2C1202.4330%2C1202.2285%2C1202.6431%2C1202.0659%2C1202.4322%2C1202.3323%2C1202.2065%2C1202.1983%2C1202.2207%2C1202.6135%2C1202.3754%2C1202.2926%2C1202.5260%2C1202.1685%2C1202.2358%2C1202.2508%2C1202.1157%2C1202.1500%2C1202.0843%2C1202.2936%2C1202.3412%2C1202.6347%2C1202.0440%2C1202.4862%2C1202.2274%2C1202.6154%2C1202.3525%2C1202.0515%2C1202.5994%2C1202.5638%2C1202.2711%2C1202.0824%2C1202.3237%2C1202.5473%2C1202.6256%2C1202.5755%2C1202.1900%2C1202.4255%2C1202.2566%2C1202.1841&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Periodic-orbit approach to the nuclear shell structures with power-law\n  potential models: Bridge orbits and prolate-oblate asymmetry"}, "summary": "Deformed shell structures in nuclear mean-field potentials are systematically\ninvestigated as functions of deformation and surface diffuseness. As the\nmean-field model to investigate nuclear shell structures in a wide range of\nmass numbers, we propose the radial power-law potential model, V \\propto\nr^\\alpha, which enables a simple semiclassical analysis by the use of its\nscaling property. We find that remarkable shell structures emerge at certain\ncombinations of deformation and diffuseness parameters, and they are closely\nrelated to the periodic-orbit bifurcations. In particular, significant roles of\nthe \"bridge orbit bifurcations\" for normal and superdeformed shell structures\nare pointed out. It is shown that the prolate-oblate asymmetry in deformed\nshell structures is clearly understood from the contribution of the bridge\norbit to the semiclassical level density. The roles of bridge orbit\nbifurcations in the emergence of superdeformed shell structures are also\ndiscussed.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1202.5437%2C1202.4214%2C1202.1669%2C1202.6059%2C1202.6162%2C1202.3316%2C1202.3887%2C1202.1544%2C1202.6152%2C1202.2683%2C1202.5388%2C1202.2525%2C1202.6538%2C1202.0285%2C1202.4796%2C1202.0055%2C1202.4875%2C1202.0106%2C1202.1737%2C1202.6647%2C1202.3873%2C1202.1860%2C1202.4847%2C1202.1437%2C1202.4401%2C1202.4888%2C1202.4490%2C1202.2375%2C1202.5842%2C1202.1238%2C1202.6240%2C1202.6297%2C1202.6250%2C1202.5510%2C1202.6127%2C1202.4874%2C1202.5800%2C1202.2289%2C1202.3085%2C1202.4627%2C1202.0921%2C1202.3410%2C1202.4618%2C1202.5377%2C1202.4164%2C1202.0137%2C1202.1967%2C1202.5631%2C1202.2059%2C1202.4002%2C1202.0223%2C1202.2442%2C1202.4959%2C1202.4017%2C1202.3733%2C1202.5368%2C1202.2132%2C1202.3515%2C1202.5540%2C1202.4538%2C1202.0892%2C1202.4330%2C1202.2285%2C1202.6431%2C1202.0659%2C1202.4322%2C1202.3323%2C1202.2065%2C1202.1983%2C1202.2207%2C1202.6135%2C1202.3754%2C1202.2926%2C1202.5260%2C1202.1685%2C1202.2358%2C1202.2508%2C1202.1157%2C1202.1500%2C1202.0843%2C1202.2936%2C1202.3412%2C1202.6347%2C1202.0440%2C1202.4862%2C1202.2274%2C1202.6154%2C1202.3525%2C1202.0515%2C1202.5994%2C1202.5638%2C1202.2711%2C1202.0824%2C1202.3237%2C1202.5473%2C1202.6256%2C1202.5755%2C1202.1900%2C1202.4255%2C1202.2566%2C1202.1841&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Deformed shell structures in nuclear mean-field potentials are systematically\ninvestigated as functions of deformation and surface diffuseness. As the\nmean-field model to investigate nuclear shell structures in a wide range of\nmass numbers, we propose the radial power-law potential model, V \\propto\nr^\\alpha, which enables a simple semiclassical analysis by the use of its\nscaling property. We find that remarkable shell structures emerge at certain\ncombinations of deformation and diffuseness parameters, and they are closely\nrelated to the periodic-orbit bifurcations. In particular, significant roles of\nthe \"bridge orbit bifurcations\" for normal and superdeformed shell structures\nare pointed out. It is shown that the prolate-oblate asymmetry in deformed\nshell structures is clearly understood from the contribution of the bridge\norbit to the semiclassical level density. The roles of bridge orbit\nbifurcations in the emergence of superdeformed shell structures are also\ndiscussed."}, "authors": ["Ken-ichiro Arita"], "author_detail": {"name": "Ken-ichiro Arita"}, "author": "Ken-ichiro Arita", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1103/PhysRevC.86.034317", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1202.5631v3", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1202.5631v3", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "20 pages, 23 figures, revtex4-1, to appear in Phys. Rev. C", "arxiv_primary_category": {"term": "nucl-th", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "nucl-th", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "nlin.CD", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1202.5631v3", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1202.5631v3", "journal_reference": "Phys. Rev. C 86 (2012) 034317", "doi": "10.1103/PhysRevC.86.034317", "fulltext": "Periodic-orbit approach to the nuclear shell structures with power-law potential models:\nBridge orbits and prolate-oblate asymmetry\nKen-ichiro Arita\n\narXiv:1202.5631v3 [nucl-th] 10 Sep 2012\n\nDepartment of Physics, Nagoya Institute of Technology, Nagoya 466-8555, Japan\n(Dated: 9 October 2012)\nDeformed shell structures in nuclear mean-field potentials are systematically investigated as functions of\ndeformation and surface diffuseness. As the mean-field model to investigate nuclear shell structures in a wide\nrange of mass numbers, we propose the radial power-law potential model, V ∝ rα , which enables us a simple\nsemiclassical analysis by the use of its scaling property. We find that remarkable shell structures emerge at\ncertain combinations of deformation and diffuseness parameters, and they are closely related to the periodicorbit bifurcations. In particular, significant roles of the \"bridge orbit bifurcations\" for normal and superdeformed\nshell structures are pointed out. It is shown that the prolate-oblate asymmetry in deformed shell structures is\nclearly understood from the contribution of the bridge orbit to the semiclassical level density. The roles of bridge\norbit bifurcations in the emergence of superdeformed shell structures are also discussed.\nPACS numbers: 21.10.Gv, 03.65.Sq, 05.45.-a\n\nI.\n\nINTRODUCTION\n\nShell structures in single-particle energy spectra play essential roles in nuclear ground-state deformations and their stabilities. Using the semiclassical trace formula, single-particle\nlevel density is expressed as the sum over contributions of\nclassical periodic orbits in the corresponding classical Hamiltonian system[1, 2]. The quantum fluctuations in many-body\nquantities such as energy and deformations are related to gross\nshell structure in single-particle spectra determined by some\nshort periodic orbits. Therefore, one can describe many-body\nquantum dynamics in terms of the properties of a few important classical periodic orbits. The single-particle shell structures are sensitively affected by varying potential parameters\nsuch as deformations, and we have found that bifurcations of\nshort periodic orbits play significant roles in emergence of remarkable shell effects. It is a quite interesting phenomena that\nthe regularity of quantum spectra is enhanced by the periodicorbit bifurcation, which is regarded as the precursor of chaos\nin classical dynamics. In this paper, we would like to show\nthat the above semiclassical mechanism for the enhancement\nof quantum shell effects would elucidate several problems in\nnuclear structure physics.\nAs phenomenological mean-field potentials, modified oscillator (MO) and Woods-Saxon (WS) models are successfully employed in shell correction approaches. For simpler\nand qualitative descriptions of the properties of shell structures, harmonic oscillator (HO) and infinite-well (cavity) potentials are frequently utilized for light and heavy systems,\nrespectively. Axially symmetric anisotropic HO potential\nmodels successfully explain the magic numbers of light nuclei, emergence of superdeformed shell structures, and so on.\nFor heavier nuclei, the radial profile of the potential around\nthe nuclear surface becomes more sharp and it looks more\nlike a square-well potential. In order to avoid the complexity of treating continuum states, the WS potential is sometimes approximated by an infinite-well potential (cavity). The\ncavity system, as well as the HO system, is integrable under spheroidal deformation due to the existence of a nontrivial dynamical symmetry, and several classical and quantum\n\nmechanical quantities are obtained analytically. It also accepts several useful techniques to calculate quantum eigenvalue spectra, since the Schrödinger equation is equivalent to\nthe Laplace equation with Dirichlet boundary condition.\nThe HO and cavity systems have a significant difference in\ndeformed shell structures. In the axially-deformed HO system, the ways in which the degeneracy of levels is resolved,\ndue to prolate and oblate deformations, are nearly symmetric; namely, the level diagram vs deformation is symmetric\nunder rotation about the degenerate spherical point by angle\nπ . Due to this symmetry, many-body systems between adjacent closed-shell configurations will prefer prolate shapes in\nthe lower half shell and oblate shapes in the higher half shell,\nsince single-particle level density is lower there, and in total,\nprolate and oblate shapes are expected to occur in almost the\nsame ratios. On the other hand, the above kind of symmetry is\napparently broken in the cavity system. Such asymmetry has\nbeen considered as the origin of so called prolate-shape dominance in nuclear ground-state deformations: a well known experimental fact that most of the ground states of medium-mass\nto heavy nuclei have prolate shapes rather than oblate shapes.\nIts origin has been discussed since the discovery of the nuclear ground-state deformation[3–6]. This predominance has\nbeen reproduced theoretically in microscopic calculations. In\nHartree-Fock+BCS calculations with Skyrme interaction[4],\nmost of the deformed ground-state solutions are found to have\nprolate shapes. In order to pin down the essential parameter\nwhich causes prolate-shape dominance, systematic NilssonStrutinsky calculations throughout the nuclear chart have been\nmade[5], and the distribution of ground-state deformations is\nexamined by varying the strengths of l 2 and ls terms in the\nNilsson Hamiltonian. They found that the prolate-shape dominance is realized under strong correlation between l 2 and ls\nterms. The recent analysis by Takahara et al. based on WoodsSaxon-Strutinsky calculations also supports those results[6].\nHamamoto and Mottelson compared the oblate and prolate\ndeformation energy from the summation of single-particle energies with spheroidal HO and cavity models, and have shown\nthat the prolate-shape dominance is only found in the cavity model. They considered the origin of the prolate-shape\n\n\f2\ndominance to be the asymmetric manner of level fannings in\nprolate and oblate sides which is unique to a potential with\na sharp surface, and have shown that the above asymmetry\nis explained from the different roles of interaction between\nsingle-particle levels in prolate and oblate sides[7].\nWe expect that the semiclassical periodic-orbit theory\n(POT) holds the key for deeper understandings of above shell\nstructures responsible for prolate-shape dominance. In POT,\nsemiclassical level density is expressed as the sum of periodic\norbit (PO) contributions,\n\u0013\n\u0012\nSβ (E) π μβ\n.\n(1.1)\ng(E) = ḡ(E) + ∑ Aβ (E) cos\n−\n2\nh̄\nβ\nḡ is the average level density equivalent to that given by the\nThomas-Fermi approximation, and the second term on the\nright-hand side gives the fluctuations around ḡ. The sum is\ntaken over all the classical\nperiodic orbits β which exist for\nH\ngiven energy E. Sβ = β p * dr is the action integral, and μβ is\nthe geometric phase index determined by the number of conjugate points along the orbit. Each orbit β changes its size\nand shape with increasing energy E, and the action integral\nSβ is, in general, a monotonically increasing function of E.\nThus, each cosine term in the PO sum (1.1) is a regularly oscillating function of energy whose period of oscillation δ E is\ngiven through the relation\n\nδ Sβ ∼\n\n∂ Sβ\nδ E ∼ 2π h̄,\n∂E\n\nδE ∼\n\n2π h̄\n,\nTβ\n\n(1.2)\n\nwhere Tβ = ∂ Sβ /∂ E is time period of the orbit β . Therefore,\na gross shell structure (large δ E) is associated with short periodic orbits (small Tβ ).\nThe above fluctuation in the single-particle spectrum brings\nabout a fluctuation in energy of nuclei as functions of constituent nucleon numbers. This fluctuation part, which we call\nshell energy, is calculated by removing the smooth part from\na sum of single-particle energies by means of the Strutinsky\nmethod[8, 9]. In semiclassical theory, shell energy Esh (N) is\ngiven by the sum of periodic orbit contribution as[10]\nEsh (N) = ∑\nβ\n\n\u0012\n\nh̄\nTβ\n\n\u00132\n\nSβ (EF (N)) π μβ\nAβ cos\n−\n2\nh̄\n\u0012\n\n\u0013\n\n, (1.3)\n\nwhere the Fermi energy EF (N) is determined by\nZ EF\n\ng(E)dE = N.\n\n(1.4)\n\n−∞\n\nIn Eq. (1.3), the contributions of long orbits are suppressed\nby the reduction factor Tβ−2 , and the property of shell energy is essentially determined by a few shortest periodic orbits. Therefore, it is sufficient to examine coarse-grained level\ndensity where one can exclude the contribution of long periodic orbits.\nThe relation between coarse-grained quantum level density\noscillations and classical periodic orbits in the spherical cavity model was first discussed by Balian and Bloch[2]. They\n\nshow that the modulations in quantum level density oscillations are clearly understood as the interference effect of periodic orbits with different lengths. This idea has been successfully applied to the problem of supershell structure in metallic clusters[11]. Strutinsky et al.[12] applied periodic orbit\ntheory (POT)[1, 2] to the cavity model with spheroidal deformation and discussed the properties of deformed shell structures in medium-mass to heavy nuclei in terms of classical\nperiodic orbits[12]. Frisk made more extensive POT calculations to reproduce quantum level density by the semiclassical\nformula[13]. He also suggested the relation between classical periodic orbits and prolate-oblate asymmetry in deformed\nshell structures, which might be responsible for the prolateshape dominance discussed above. Those works have proved\nthe virtue of semiclassical POT for clear understanding of the\nproperties of finite quantum systems.\nIt should be emphasized here that unique deformed shell\nstructures are developed when the contributions of certain periodic orbits are considerably enhanced. The magnitude of the\nshell effect is related to the amplitude factor Aβ in Eq. (1.1).\nThis amplitude factor has important dependency on the stability of the orbit, which is generally very sensitive to the potential parameters such as deformations. In particular, stability\nfactors sometimes exhibit significant enhancement at periodic\norbit bifurcations, where new periodic orbits emerge from an\nexisting periodic orbit. Near the bifurcation point, classical\norbits surrounding the stable periodic orbit form a quasiperiodic family, which makes a coherent contribution to the level\ndensity. This is an important mechanism for the growth of\ndeformed shell structures.\nA typical example is the so-called superdeformed shell\nstructure. It is known that single-particle spectra exhibit remarkable shell effects at very large quadrupole-type deformation with an axis ratio around 2:1. In the anisotropic HO\nmodel, this shell structure is related with the periodic orbit\ncondition; all the classical orbits become periodic at ω⊥ = 2ωz\nand they make very large contribution to the level density fluctuation. In the cavity model, one also finds a significant shell\neffect around the 2:1 deformation, and it is related to the bifurcations of equatorial periodic orbits through which threedimensional (3D) periodic orbits emerge[14, 15]. It should be\ninteresting to explore the intermediate situation between the\nabove two limits, which might correspond to the actual nuclear situation.\nOur purpose in this paper is to understand the transition of\ndeformed shell structure from light to heavy nuclei in terms\nof classical periodic orbits. This requires a mean field like\nWS potential model. Semiclassical quantizations in spherical and deformed WS-like potentials have been examined in\nRefs. [16, 17], but the relation between classical periodic orbits and quantum level densities has not been discussed. As\nwe show, the WS potential inside the nuclear radius RA is\nnicely approximated by a power-law potential which has simpler radial dependence V ∝ rα . This approximation simplifies both quantum and classical calculations and one has clear\nquantum-classical correspondence via the Fourier transformation technique[18].\nThus, in the current paper, we focus on the radial dependence of the mean-field potential (effect of surface diffuse-\n\n\f3\n\nII. THE POWER-LAW POTENTIAL MODEL\nA.\n\nDefinition of the model\n\nIt is known that the central part of the nuclear mean-field\npotential is approximately given by the Woods-Saxon (WS)\nmodel,\nVWS (r) = −\n\nW\n.\n1 + exp{(r − RA )/a}\n\n(2.1)\n\nThe depth of the potential is W ≃ 50 MeV, the surface diffuseness is a ≃ 0.7 fm and the nuclear radius is RA ∼ 1.3 A1/3 fm\nfor a nucleus with mass number A [19]. The singularity of the\npotential (2.1) at the origin can be removed by replacing the\nWS potential with the Buck-Pilt (BP) potential[20]\n1 + cosh(RA /a)\nVBP (r) = −W\n.\ncosh(r/a) + cosh(RA /a)\n\n(2.2)\n\nBy using the BP potential whose radial profile is essentially\nequivalent to the WS potential, one can consider semiclassical\nquantization without being concerned about the singularity in\nclassical orbits[16, 17]. For small A, the inner region (r < RA )\nof these potentials can be approximated by a harmonic oscillator (HO). For large A, these potentials are flat (V ≈ −W )\naround r = 0 and sharply approaches zero around the surface,\nlooking more like a square-well potential. In Ref. [12], the\nshell energies of deformed WS potentials are compared with\nthose for HO and infinite square-well (cavity) potentials. Deformed shell structures in the WS model are similar to those of\nthe HO model for light nuclei, while they are more like those\nof the cavity model for medium-mass to heavy nuclei. Our\naim is to understand the above transition of deformed shell\n\nα=7.\n25\n\n20\n\n60\n\n240\n\n2\n\nα=\n\n1 .9\n8\n\n40\n\nα=4\n.3\n\n60\n\nV(r) [MeV]\n\nness, described by the l 2 term in the Nilsson model) and examine the shell structures systematically as functions of deformation and surface diffuseness. As pointed out by Tajima et\nal., spin-orbit coupling plays also an important role in prolateshape dominance. The effect of spin-orbit coupling will be\ndiscussed in a forthcoming paper.\nThis paper is organized as follows. In Sec. II, we discuss\nthe quantum and classical properties of the power-law potential model. The scaling properties of the model are described\nand the Fourier transformation techniques are formulated. In\nSect. III, quantum mechanical densities of states and shell\nstructures in the spherical power-law potential are examined.\nSome analytic expressions for periodic orbit bifurcations and\nsemiclassical formulas are given, and quantum-classical correspondence is discussed. It will be shown that bifurcations\nof circular orbits bring about unique supershell structures at\nseveral values of radial parameter α . In Sec. IV, shell structures are examined against the spheroidal deformation parameter. The semiclassical origin of prolate-oblate asymmetry\nin deformed shell structures and prolate-shape dominance are\ninvestigated. The origins of superdeformed shell structures\nare also examined. Special attention is paid to what we call\n\"bridge orbit bifurcations.\" Section V is devoted to a summary and conclusion.\n\n0\n\nA=4\n\n-20\n-40\n-60\n\nBuck-Pilt\npower-law\n\n-80\n0\n\n2\n\n4\n\n6\n\n8\n\n10\n\nr [fm]\n\nFIG. 1. Profiles of power-law potentials (2.3) fitted to the Buck-Pilt\npotentials (2.2) for mass numbers A = 4, 60 and 240. Values of radial\nparameter α are determined by Eq. (2.5).\n\nstructure from the view point of quantum-classical correspondence. For this purpose, we take the radial dependence of\nthe potential as rα , which smoothly connects HO (α = 2) and\ncavity (α = ∞) potentials by varying the radial parameter α :\n\u0012 \u0013α\nW\nr\n.\n(2.3)\nVBP (r) ≈ Vα (r) = −W +\n2 RA\nThis power-law potential Vα , having a simple radial profile,\nis easy to treat in both quantum and classical mechanics in\ncomparison with the WS/BP model. The inner region (r <\n∼ R)\nof the BP potential is nicely approximated by the power-law\npotential (see Fig. 1).\nIn Fig. 1, the radial parameter α is determined so that the\npower-law potential best fit the inner region (r < RA ) of the\nBP potential. As a simple local matching, one may equate\nthe derivatives of two potentials at the nuclear surface r = RA ,\nwhich gives (for a ≪ RA )\n\nα ∼ RA /2a.\n\n(2.4)\n\nThus, the radial parameter α controls the surface diffuseness.\nFor a global fitting, we take more elaborate approach which\nminimizes the volume integral of the squared potential difference inside the nuclear radius RA ,\nZ RA\nn\no2\nd\ndrr2 Vα (r; A) − VBP (r; A) = 0.\n(2.5)\ndα 0\n\nThe value of α numerically obtained by Eq. (2.5) has an approximately linear dependence on RA /a,\n\nα ∼ −0.62 + 0.68 RA/a,\n\n(2.6)\n\nwhich has qualitatively similar dependence on surface diffuseness a as the result of local fitting (2.4).\nFigure 2 compares single-particle level diagrams for the BP\nand power-law potential models as functions of radial parameter α . We use the relation (2.6) to determine RA for the WS potential as a function of α . Although the difference of the two\n\n\f4\n0\n\nTABLE I. Values of radial parameter α , length unit R, and energy\nunit U of the power-law potential (2.7) for nuclei with mass number\nA. Nuclear radius RA = 1.3A1/3 fm, potential depth W = 50 MeV,\nsurface diffuseness a = 0.7 fm, nucleon mass M = 938 MeV/c2 , and\nthe relation (2.6) are used.\n\nE [MeV]\n\n-10\n\n-20\n\n-30\n\n-40\n\nrα (π=+)\n(−)\nBP (+)\n(−)\n\n-50\n2\n\n3\n\n4\n\n5\n\n6\n\n7\n\n8\n\n9\n\nα\n\nR [fm]\n\nU [MeV]\n\n2.80\n\n2.32\n\n3.32\n\n100\n\n5.23\n\n3.93\n\n1.14\n\n200\n\n6.75\n\n5.06\n\n0.72\n\n10\n\nα\n\nmalized to satisfy the volume conservation condition\n\nFIG. 2. Single-particle spectra for the spherical power-law (rα ) potential and the Buck-Pilt (BP) potential as functions of radial parameter α . Positive and negative parity levels (π = ±) are respectively\nplotted with solid and dashed lines for the power-law potential and\nwith filled and open dots for the BP potential. For the levels of the\nBP model (2.1), nuclear radius RA is determined by Eq. (2.6) as a\nfunction of α .\n\npotentials becomes significant at E >\n∼ −20 MeV, the quantum spectra for these models show fairly nice agreements up\nto the Fermi energy (EF ∼ −8 MeV) in wide range of radial\nparameter α (see Fig. 2). Since most of the classical orbits\nhave nonzero angular momentum and they do not reach the\nouter bound of the potential due to centrifugal potential, the\ndifference of the two potentials at r > RA is hindered in the\nsemiclassical quantization and it might not cause much differences in the quantum spectra up to a rather high energy.\nThus, we can employ this power-law potential model for the\nstudy of realistic shell structures of stable nuclei from light\nto heavy regions. For unstable nuclei, the difference of the\npotentials at r > RA and the effect of coupling to continuum\nstates might become significant.\n\nB. Scaling properties\n\nWe have several great advantages by replacing the WS/BP\npotential with the power-law potential. The power-law potential has useful scaling properties, which highly simplifies\nour semiclassical analysis. In the following, we eliminate the\nconstant term −W in Eq. (2.3) and consider the Hamiltonian\nfor a particle of mass M moving in the deformed power-law\npotential as\n\u0015α\n\u0014\nr\np2\n.\n+U\nH(p, r) =\n2M\nR f (θ , φ )\n\nA\n20\n\n1\n4π\n\nf 3 (θ , φ )d Ω = 1,\n\n(2.8)\n\nwhich guarantees the volume surrounded by equipotential surface to be independent of deformation. Under a suitable scale\ntransformation of coordinates, the energy eigenvalue equation\nis transformed into a dimensionless form,\n\u0014\n\u0013α \u0015\n\u0012\n1 2\nu\n− ∇u +\nψ (u) = eψ (u),\n(2.9)\n2\nf (θ , φ )\nby the choice U = h̄2 /MR2 (note that the value of U can be\ntaken arbitrarily, since the potential can be still adjusted by\nanother parameter R), and dimensionless coordinates u and\nenergy e defined by\nu=\n\nr\n,\nR\n\ne=\n\nE\n.\nU\n\n(2.10)\n\n∇2u represents a Laplacian with respect to the coordinate u.\nSince Eq. (2.9) does not include constants such as M, U, R and\nh̄, one can consider the quantum eigenvalue problem independently on those values. Their absolute values are determined\nby fitting to the BP potential through the relation\n\u0012 \u0013α\nW\nRA\n= .\nU\nR\n2\n\nThe values of α , R and U for several A are listed in Table I.\nThe scaling property of the system is particularly advantageous in the analysis of classical dynamics. Since the potential is a homogeneous function of coordinates, Hamilton's\nequations of motion have invariance under the following scale\ntransformation:\n1\n\n1\n\n1\n\n1\n\n(p, r,t) → (c 2 p, c α r, c α − 2 t) as\n\nE → cE.\n\n(2.11)\n\nTherefore, classical phase-space structure is independent of\nenergy. A phase-space trajectory (r0 (t), p0 (t)) at energy E0 is\ntransformed to a trajectory at different energy E by\n\n(2.7)\n\nHere, R and U are constants having dimension of length and\nenergy, respectively. The dimensionless function f (θ , φ ) determines the shape of the equipotential surface, and it is nor-\n\nZ\n\nr(t) =\n\n\u0012\n\nE\nE0\n\n\u0013 α1\n\nwith\n\n′\n\nr0 (t ),\nt=\n\np(t) =\n\u0012\n\nE\nE0\n\n\u0012\n\nE\nE0\n\n\u0013 α1 − 12\n\n\u0013 12\n\nt ′.\n\np0 (t ′ ),\n(2.12)\n\n\f5\nThus we have the same set of periodic orbits in an arbitrary\nenergy surface related through the above scale transformation.\nIn the following, we set the reference energy at E0 = U. The\naction integral along a certain periodic orbit β is expressed as\n\u0012 \u0013 12 + α1\nI\nE\nSβ (E) =\n≡ h̄τβ E. (2.13)\np * dr = Sβ (U)\nU\nβ (E)\nIn the last equation, we define dimensionless \"scaled energy\"\nE and \"scaled period\" τβ of periodic orbit β by\n\u0012 \u0013 12 + α1\nE\nE=\n,\nU\n\nτβ =\n\nSβ (U)\n.\nh̄\n\nḡETF (E) = c0 (α )E 2 + c1 (α )\n√\n\u0012\n\u0013\n3 3\n2 2\n1\n+\n,\n,\nc0 (α ) =\nB\nπ\nα 2\n\u0012\n\u0013\n1 1\nα +1\nc1 (α ) = − √ B 1 + ,\nα 2\n12 2 π\n\n∂ Sβ (E) dE\nTβ =\n(2.15)\nh̄τ .\n=\n∂E\ndE β\nAs one will see in the following part, it is convenient to express periodic-orbit quantities in terms of E and τ in place of\nE and T . In HO-type potentials (α = 2), E and τ are proportional to ordinary energy E and period T , respectively. In\ncavities (α = ∞), they are proportional to momentum p and\norbit length L, respectively.\n\n1\nN̄(E) = c0 (α )E 3 + c1(α )E\n3\n\ngΓ (E) =\n\nZ\n\nZ 1\n0\n\n(2.16)\n\nxs−1 (1 − x)t −1 dx.\n\nBy transforming energy E to a scaled energy E, one obtains\nthe scaled-energy level density\ndE\n2α E\ng(E) =\ng(E)\ndE\n2+α E\nUsing (2.16), the average part is given by\n√\n\u0012\n\u0013\n3 3\n2 2\n1\n+\nE2\nḡ(E) =\n,\nB\nπ\nα 2\ng(E) =\n\ndE ′ g(E ′ ) √\n\n′ 2\n2\n1\ne−(E−E ) /2Γ\n2πΓ\n\n2\n2\n1\n=∑√\ne−(E−Ei ) /2Γ\n2π Γ\ni\n\n(2.22)\n\nwith smoothing width Γ = 0.3 and the number of levels\n(2.23)\n\ni\n\nwhich is independent of deformation under volume conservation condition (2.8). B(s,t) represents Euler's beta function\ndefined by\nB(s,t) =\n\nZ\n\nN(E) = ∑ θ (E − Ei ),\n\nLet us consider the single-particle level density for the\nHamiltonian (2.7). Average level density ḡ(E) is given by\nThomas-Fermi (TF) approximation\n1\ndp dr δ (E − H(p, r))\n(2π h̄)3\n√\n\u0012\n\u0013\n3 3 E3\n2 2\n,\n,\n=\nB\nπα\nα 2 E\n\n(2.21)\n\nIn Fig. 3, the quantum mechanically calculated coarse-grained\nlevel density\n\nSemiclassical level density\n\ngT F (E) =\n\n(2.20)\n\nand the average number of levels up to scaled energy E is\ngiven by\n\n(2.14)\n\nThe ordinary (non-scaled) period of the orbit β is then given\nby\n\nC.\n\nFor the spherical case, one obtains the expression\n\n(2.17)\n\n(2.18)\n\nCorrection to the TF density is obtained by the extended\nThomas-Fermi (ETF) theory[10, 21],\n\u0012\n\u00131/2\n1\n2M\nḡETF (E) = ḡTF (E) −\n96π 2 h̄2\nZ\n∂\n∇2V\n×\n.\n(2.19)\ndr θ (E − V )\n∂E\n(E − V )1/2\n\nare compared with those in ETF approximation. One sees that\nETF (TF) correctly describes the average properties of quantum results. In these plots, the differences between ETF and\nTF are invisibly small.\nNext we consider the fluctuating part by the use of semiclassical periodic-orbit theory[10]. Let us rewrite the trace\nformula (1.1) using scaled energy and scaled periods. The\nsemiclassical formula for scaled-energy level density is expressed as\n\u0010\n\u0011\n∞\nπ\ng(E) = ḡ(E) + ∑ ∑ Anβ (E) cos nτβ E − νnβ .\n2\nβ n=1\n\n(2.24)\n\nIn the Hamiltonian system with no continuous symmetry, all\nthe periodic orbits are isolated from each other. For a system\nwith continuous symmetry, e.g., a particle moving in an axially symmetric potential, generic periodic orbits form a continuous family with respect to the symmetry transformation,\nand they are called degenerate orbits. For an isolated orbit β\nwith n repetitions, the amplitude factor is given by the standard Gutzwiller formula[1, 10],\nAnβ =\n\nTβ\nτβ\ndE\nq\n= q\n. (2.25)\nπ h̄ | det(I − Mnβ )| dE\nπ | det(I − Mnβ )|\n\nIn the last equation, we used Eq. (2.15). Mβ represents the\nmonodromy matrix[10, 22], which is a linearized Poincaré\nmap defined by\nMβ =\n\n∂ (r⊥ (Tβ ), p⊥ (Tβ ))\n,\n∂ (r⊥ (0), p⊥ (0))\n\n(2.26)\n\n\f6\nThe eigenvalues of M (and therefore Tr M) are independent\nof a choice of Poincaré surface or a choice of canonical variables. These eigenvalues continuously vary as deformation\nchanges, and it happens that they become unity at certain values of deformation, namely, u = 0 in (a) or v = 0 in (b). At\nthose deformations, the Poincaré map acquires a new fixed\npoint in the direction of eigenvector δ Z1 belonging to the unit\neigenvector:\n\n(a) 1600\nα=4.0,Γ=0.3\ng(ε)\n\n1200\n\n800\nQM\nETF\n\n400\n40\n\n45\n\n50\n\n55\n\n60\n\n65\n\n70\n\nε\n(b) 13000\nα=4.0\nN(ε)\n\n12500\n12000\n11500\nQM\nETF\n\n11000\n49\n\n49.5\n\n50\n\n50.5\n\n51\n\nε\nFIG. 3. Comparison of quantum (QM: solid line) and semiclassical\n(ETF: broken line) results for a spherical power-law potential with\nα = 4.0. In panel (a), coarse-grained quantum level density (2.22)\nwith smoothing width Γ = 0.3, and ETF level density (2.20) are displayed. In panel (b), the number of quantum levels below scaled\nenergy E (2.23) and the ETF average number of levels (2.21) are\ndisplayed.\n\nwhere (r⊥ (t), p⊥ (t)) are the local coordinates and momenta\nperpendicular to the periodic orbit β as functions of time t,\nand Tβ is the period of the primitive orbit.\nIn a two-dimensional autonomous Hamiltonian system,\nmonodromy matrix M is a (2 × 2) real and symplectic matrix,\n!\n0 1\nT\nM J M = J, J =\n,\n−1 0\nand its eigenvalues appear in one of the following three\nforms[10, 22]:\n(a) (eu , e−u ): hyperbolic with no reflection, Tr M =\n2 cosh u > 2,\n(b) (eiv , e−iv ): elliptic, Tr M = 2 cos v, | Tr M| ≤ 2,\n(c) (−eu , −e−u ): hyperbolic with reflection, Tr M =\n−2 coshu < −2.\nThe orbit is stable in case (b) and otherwise unstable, and the\nstability of the orbit is determined by the trace of monodromy\nmatrix. The stability factor in Eq. (2.25) is also determined by\nthe trace of the monodromy matrix:\ndet(I − Mβ ) = 2 − TrMβ .\n\n(2.27)\n\nMδ Z1 = δ Z1 .\n\n(2.28)\n\nIn this way, periodic orbit bifurcation occurs at Tr M = 2. The\nnumber of new emerging orbits is dependent on the type of\nthe bifurcation[23]. When a stable (unstable) orbit undergoes\npitchfork bifurcation, it turns unstable (stable) and a new stable (unstable) orbit emerges from it. When a stable orbit undergoes period-doubling bifurcation, a pair of stable and unstable orbits will emerge.\nIn a three-dimensional Hamiltonian system, the size of the\nmonodromy matrix becomes (4 × 4). Under axial symmetry, periodic orbits degenerate with respect to the rotation,\nand the monodromy matrix has unit eigenvalue corresponding to the direction of the rotation. Thus, by removing the\nrotational degrees of freedom, the stability of the orbit is described by a (2 × 2) symmetry-reduced monodromy matrix,\nand it has the same properties as in the two-dimensional case.\nFor such degenerate orbits in the system with continuous symmetry, the trace formula is modified by what is called extended\nGutzwiller theory[10, 24]. The amplitude factor for the degenerate orbit is proportional to the stability factor similar to\nthat in (2.25), but with symmetry-reduced monodromy matrix\nM̃β . For fully degenerate orbits in an integrable system, one\ncan use the Berry-Tabor formula[25].\nIn general, the stability factor | det(I − M̃βn )|−1/2 has strong\ndependence on the deformation parameter, and is responsible for the sensitivity of shell structures to deformations. The\ndivergence of the Gutzwiller amplitude (2.25) based on the\nstandard stationary phase method can be remedied by improved treatment of the trace integral in phase space (e.g.,\nuniform approximations[26–28] and the improved stationaryphase method[15, 29]) and one can obtain finite amplitudes\nthrough the bifurcation processes. Those amplitudes sometimes show strong enhancement around the bifurcation points,\nsince the monodromy matrix has a unit eigenvalue there, and\na local family of quasi-periodic orbits is formed in the direction of the eigenvector δ Z1 belonging to the unit eigenvalue,\nwhich make a coherent contribution to the level density.\nOne should, however, note that the above enhancement is\nnot always found for every bifurcations. The significance of\nbifurcation depends on the normal form parameters which describe nonlinear dynamics around the periodic orbit at the bifurcation points. In Ref. [30], uniform approximation remedies the divergence problems which one encounters at bifurcation points in the standard stationary phase method, but the\nobtained amplitude show no enhancement around there. In\nRef. [31], we found very strong enhancement of amplitude\naround the bifurcation point for one certain orbit, but the same\ntype of bifurcation in another orbit shows no enhancement. In\nour previous studies, we have shown that significant growth\n\n\f7\nof shell effects at a certain deformation is related with bifurcations of simple short periodic orbits[14, 15, 29, 31, 32].\nD. Fourier transformation technique\n\nThe Fourier transformation technique is especially useful\nin studying classical-quantum correspondence in the system\nwith scale invariance. Let us consider the Fourier transform\nof scaled-energy level density\nF(τ ) =\n\nZ\n\ng(E)eiτ E e− 2 (γ E ) dE.\n2\n\n1\n\n(2.29)\n\nIn the integrand, Gaussian damping factor is included in order\nto exclude the level density at high energy γ E ≫ 1 where the\nnumerically obtained single-particle spectra do not have good\nprecision.\nBy inserting the quantum level density g(E) = ∑n δ (E − En )\ninto Eq. (2.29), one obtains\nF\n\nqm\n\n(τ ) =\n\n∑\n\ne\n\niτ En − 21 (γ En )2\n\n,\n\nare available. In the following, we take the units h̄ = M = R =\nU = 1 for simplicity. Taking the orbits in the (x, y) plane and\nsetting the z component of the angular momentum to lz = K,\nthe two-dimensional effective Hamiltonian in polar coordinates is written as\nH=\n\nrc =\n\n2\n\n− z\n1\nδγ (z) = √\ne 2γ 2 ,\n2π γ\n\n(2.32)\n\nwhich coincides with Dirac's delta function in the limit γ → 0.\nThus, F(τ ) should be a function possessing successive peaks\nat the scaled periods of classical periodic orbits τ = nτβ . [In\nEq. (2.31), the argument E of the amplitude A(E) is formally\nreplaced with differential operator −i∂τ . For an isolated orbit, the amplitude is a constant and the corresponding term\nin Eq. (2.31) becomes a simple Gaussian. For a degenerate\nfamily of degeneracy K, the amplitude is proportional to E K/2\nand the peak might not be exactly centered at the scaled action.] Therefore, by calculating the Fourier transform of the\nquantum mechanical level density, one can extract information on the significance of each periodic orbits contributing to\nthe semiclassical level density. The parameter γ implies the\nresolution of the periodic orbit in the Fourier transform. For\na better resolution, a larger number of good quantum energy\nlevels (up to Emax >\n∼ 2/γ ) are required.\nIII. SPHERICAL POWER-LAW POTENTIALS\nA. Classical periodic orbits\n\nIn the spherical power-law potential model, several simple\nanalytic descriptions for the properties of the periodic orbits\n\n(3.1)\n\n\u0012\n\n2E\n2+α\n\n\u00131/α\n\n,\n\n(3.3)\n\nand the angular frequency\nK √\nωc = 2 = α\nrc\n\n\u0012\n\n2E\n2+α\n\n\u0013 21 − α1\n\n.\n\n(3.4)\n\nThus, the scaled period of the orbit C is analytically given by\n√\nτC = 2π α\n\nF cl (τ ) = F̄(τ ) + π ∑ eiπ μnβ /2 Anβ (−i∂τ )δγ (τ − nτβ ). (2.31)\nHere, δγ (z) represents a normalized Gaussian with width γ\n\nK2\n2r2\n\nfrom which one obtains, for energy E,\n\n(2.30)\n\nnβ\n\nVeff (r; K) = rα +\n\nThe circular orbit r(t) = rc (denoted by C) satisfies the condition\n\u0013\n\u0012\n∂ Veff\n= 0,\n(3.2)\n∂ r rc\n\nEn <Emax\n\nwhich can be easily evaluated using quantum mechanically\ncalculated energy eigenvalues {En }. On the other hand, by\ninserting the semiclassical level density (2.24), one formally\nhas the expression\n\n1 2\np + Veff (r; K),\n2 r\n\n\u0012\n\n2\n2+α\n\n\u0013 21 + α1\n\n.\n\n(3.5)\n\nThe circular orbit is stable, and r(t) of the orbits in vicinities\nof the circular orbit oscillate around rc with angular frequency\ns\u0012\n\u0012\n\u0013\n\u0013 12 − α1\np\n2E\n∂ 2Veff\nΩc =\n. (3.6)\n= α (α + 2)\n∂ r 2 rc\n2+α\n\nBifurcations occur when the ratio of those two frequencies ωc\nand Ωc becomes rational, namely,\nn\nΩc √\n= α +2 =\nωc\nm\n\n(3.7)\n\nfor period m-upling bifurcation. Here, a new orbit which oscillates n times in the radial direction when it rotates m times\nalong the orbit C emerges from mth repetition of orbit C. The\nvalues of α at such bifurcations are given by\nn2\n−2\nm2\n\n 2, 7, 14, * * *\n\n\n\u0012 \u0013\n\u0012 \u0013\n\n\n8 17 28 41\n\n\n\n 4 , 4 , 4 , 4 ,***\n\u0012 \u0013\n= \u0012 \u0013\n18 31 46 63 82 103\n\n\n,\n, ,\n,\n,\n,***\n\n\n\n9\n9 9\n9\n9 9\n\n\n\n..\n\n.\n\nα=\n\n(3.8)\n,m = 1\n,m = 2\n,m = 3\n..\n.\n\nThe numbers in parenthesis are those which already appeared\nin smaller m, corresponding to the repetitions of primitive orbits.\n\n\f8\nthat the Fourier peaks associated with the orbits are strongly\nenhanced around those bifurcation points, indicated by open\ncircles in Fig. 5. This clearly illustrates the significance of\nperiodic-orbit bifurcations to the enhancement of shell effect.\nOne will also note that the maxima of the Fourier amplitudes\nare slightly shifted towards post-bifurcation side as a general\ntrend. Such shifts have been explained in the semiclassical\ntheory, which is extended to be able to treat bifurcations, e.g.,\nin the improved stationary-phase method[15, 29] and in the\nuniform approximation[33].\n\nα=3.5\n\nα=5.0\n\nα=8.0\n(7,3)\n\n(5,2)\n\n(3,1)\n\nFIG. 4. Some short periodic orbits (n, m) in spherical power-law potentials. They emerge from the circular orbit (shown with a broken\nline) via period m-upling bifurcations. The outermost circle represents the boundary of classically accessible region.\n\nFigure 4 shows some periodic orbits (n, m) emerging from\nthe circular orbit via period m-upling bifurcations of circular\norbit C. In the following subsections, we will show that the\nabove bifurcations bring about unique shell structures due to\nthe interference of shortest orbit and bifurcated orbits which\nmanifest at certain values of radial parameter α .\nAnother periodic orbit is the diameter orbit denoted by X.\nThe scaled period of the orbit X is also given analytically;\n\u0013\n\u0012\n√\n1 1\n.\n(3.9)\nτX = 2 2 B 1 + ,\nα 2\n\nC. Bifurcation enhancement effect to the shell structures\n\nIn order to see the effect of bifurcations of orbits (7,3),\n(5,2), and (3,1), we examine the shell structures at α = 4.0,\n5.0, and 8.0 where the Fourier amplitudes corresponding to\nthe above orbits are most enhanced. Figure 6 shows the moduli of Fourier amplitudes |F(τ )| for the above values of radial\nparameter α (the cross sectional view in Fig. 5 along the vertical lines at those values of α ). Figure 7 shows the oscillating\npart of the coarse-grained level densities with two choices of\nsmoothing parameter, Γ = 0.24 for extracting only the gross\nshell structures and Γ = 0.12 for additional finer structures.\nIn Fig. 6(a), one sees the largest (except for τ = 0) peak\nat τ ∼ 16.5, which corresponds to the third repetitions of\nthe circular orbit, 3C (3τC = 16.539), as well as orbit (7,3)\n(τ7,3 = 16.410) bifurcated from 3C at α = 31/9 = 3.44. These\n\n20\n\n(9,3)\n(8,3)\n\nIn the limit α → 2, the orbits\n√ X and C make degenerate family\nwith scaled period τ = 2π . The diameter orbits in spherical\npotential cause no bifurcations by varying α .\n\n(7,3)\n\n15\n(6,2)\n\nFourier analysis of quantum level density\n\nAs discussed in Sec. II D, the Fourier transform of scaledenergy level density g(E) will exhibit peaks at the scaled periods nτβ of classical periodic orbits. We calculate the quantum\nspectra by smoothly varying the radial parameter α , and take\nthe Fourier transform of the level density for each α . The\nFourier amplitude as a function of α and scaled period τ is\nshown in Fig. 5. The scaled periods of classical periodic orbits are also drawn as functions of α . One finds an excellent correspondence between Fourier peaks and classical periodic orbits. The peak at τ = 0 corresponds to the average\nlevel density, which in semiclassical theory is derived from\nthe contribution of the zero-length or direct trajectory. Equally\nspaced remarkably large peaks for α = 2 are of a fully degenerate periodic orbit family (and its repetitions) in an isotropic\nharmonic oscillator [limit of SU(3) symmetry]. If the α is\nslightly shifted from this value, the orbit family bifurcates into\ncircular orbit and diametric orbit families. With increasing\nα , the circular orbit and its repetitions encounter successive\nbifurcations at the values given by Eq. (3.8). One will see\n\n(5,2)\n\nτ\n\nB.\n\n10\n\n(3,1)\n\n5\ncircular orbits\ndiameter orbits\nbifurcated orbits\nbifurcation points\n\n0\n1\n\n2\n\n3\n\n4\n\n5\n\n6\n\n7\n\n8\n\nα\n\nFIG. 5. (Color online) Gray-scale plot of the Fourier transform of\nquantum level density (2.30) as a function of radial parameter α and\nscaled period τ . The modulus of the Fourier transform |F(τ )| has a\nlarge value in the dark region. Scaled periods of classical periodic\norbits τβ (α ) are also shown with lines as functions of α . Bifurcation\npoints (n, m) given by Eq. (3.8) are indicated by open circles.\n\n\f9\n20\n\n(7,3)\n3C\n\n(a) α=4.0\n\n1000\n\n(a) α=4.0\n\n10\n\n2C\n\n0\n3(2,1)\n\n0\n\n3(2,1)\n\n(7,3)\n3C\n\n-10\n50\n\n3(2,1)\n\n2(2,1)\n\n(2,1)\n\n10\n\n15\n\n-20\n20\n\nτ\n\n(a) α=4.0\n\n0\n-5\n\n(b) α=5.0\n\n5\n0\n-5\n\n(c) α=8.0\n\n10\n\nδg(ε)/ε\n\n5\n0\n-5\n6\n\n8\n\n10\n\n-30\n4\n\n5\n\n6\n\n7\n\n8\n\n9\n\n10\n\nN1/3\n\nFIG. 6. Moduli of Fourier transforms of quantum level density (2.30)\nplotted as functions of scaled period τ for (a) α = 4.0, (b) 5.0, and\n(c) 8.0. The peaks associated with the periodic orbits are labeled by\ntheir indices (n, m). (2,1) represents a diametric orbit, C represent a\ncircular orbit, and k(n, m) represents the kth repetition of the primitive orbit (n, m). In panel (a), the scaled periods of (7,3) and 3C\norbits are so closed that the Fourier transform is not resolved into\ntheir individual peaks; the same for (5,2) and 2C orbits in panel (b),\nand for (3,1) and C orbits in panel (c).\n5\n\n0\n-10\n\n0\n5\n\n10\nEsh\n\n(8,3)\n3C\n\n20\n\n500\n\n0\n\n(c) α=8.0\n\n40\n30\n\n(7,3)\n\n(c) α=8.0\n\n1000\n\n(b) α=5.0\n\n10\n\n(5,2)\n2C\n\n0\n\n20\n\n(5,2)\n2C\n(2,1)\nC\n\n500\n\n2(2,1)\n\n(b) α=5.0\n\n(3,1)\nC\n\n|F(τ)|\n\n0\n1000\n\n-10\n\n2(2,1)\n\n(2,1)\nC\n\n500\n\n12\n\n14\n\n16\n\nε\n\nFIG. 7. (Color online) Oscillating part of the coarse-grained scaledenergy level density δ g(E ) divided by E in the spherical power-law\npotential model with (a) α = 4.0, (b) 5.0 and (c) 8.0. Solid and\ndashed lines show results with smoothing width Γ = 0.12 and 0.24,\nrespectively. In panel (a), dots are placed with interval δ E = 0.38,\nwhich approximately coincide with the positions of level density\nmaxima. The level density takes relatively larger values at the\nopen dots. The dots in panels (b) and (c) are placed with intervals\nδ E = 0.54 and 0.97, respectively, which also coincide with the positions of level density maxima. (Physically, the level density minima\nhave more significance, but the supershell structures are clearer for\nthe maxima in these plots.)\n\nFIG. 8. Shell energy for (a) α = 4.0, (b) 5.0, and (c) 8.0, as functions of the cubic root of particle number, taking account of the spin\ndegeneracy factor.\n\norbits are expected to make dominant contributions in the periodic orbit sum (2.24), and the pitch of the level density oscillation should be given by δ E = 2π /τβ ≈ 0.38. The oscillating level density shown in Fig. 7(a) has the period of oscillation just as predicted above. One also note that the oscillation\nis regularly modulated and the amplitude becomes relatively\nlarge for every three oscillations. This is a typical supershell\nstructure caused by the interference of period-3 and period-1\norbits.\nIn Fig. 6(b), one sees a prominent peak at τ ≃ 11.6 associated with the second repetitions of the circular orbit, 2C\n(2τC = 11.690), as well as orbit (5,2) (τ5,2 = 11.609) bifurcated from 2C at α = 4. The contribution of these orbit to\nthe level density should be the oscillating function of scaled\nenergy E with the period δ E ≈ 0.54. The oscillating level density shown in Fig. 7(b) has just the same period as predicted\nabove. One also notes that the supershell structure caused by\nthe interference of period-2 and period-1 orbits is manifested.\nIn Fig. 6(c), one sees a large peak at τ ∼ 6.5 associated with\nthe primitive circular orbit C (τC = 6.499) and the orbit (3,1)\n(τ3,1 = 6.479) bifurcated from C at α = 7. The contributions\nof these orbits bring about the oscillation of the level density\nwith period δ E ≈ 0.97. The calculated quantum level density\nin Fig. 7(c) shows the behavior just as expected.\nThe above shell and supershell structures are also reflected\nin the shell energy shown in Fig. 8. In panels (a) and (b),\nthe subshell structures due to period-3 and period-2 orbits, respectively, can be found for large N (N 1/3 >\n∼ 6), although they\nare not so evident in comparison with those found in the level\ndensity due to the reduction factor Tβ−2 in the trace formula\nof shell energy (1.3). In panel (c) of Fig. 8, one sees a remarkable enhancement of major shell effects compared with\nthe other panels. This is regarded as the result of bifurcation\nenhancement effect of the circular orbit. Note that the plots in\n\n\f10\nα=2,η=√3\n\n(a)\n\nα=5,η=√3\n\n(b)\n\n10\n\n1\n\n1\n\npx\n\npx\n\n8\n0\n\n0\n\n-1\n\n6\n\nε\n\n-1\n-1\n\n0\nx\n\nα=20,η=√3\n\n(c)\n\n-1\n\n1\n\n1\n\nα=∞,η=√3\n\n(d)\n\n4\n\n1\n\npx\n\n1\n\npx\n\n0\nx\n\n0\n\n2\n\n0\n\n-0.8\n\n-1\n\n-1\n-1\n\n0\nx\n\n1\n\n-1\n\n0\nx\n\nFigs. 7 and 8 are extended to large E and N (far beyond the region of existing nuclei, but this may be meaningful for metallic clusters), where the above shell and supershell structures\nbecome more evident. Unfortunately, the subshell structures\nfor α = 4.0 and 5.0 in shell energies are not very prominent in\nthe existing nuclear region and they might disappear, e.g., after including the spin-orbit coupling, but the pronounced shell\neffect for α ∼ 8.0 might survive and be responsible for enhancement of shell effects in real nuclei around the mediummass to heavy region.\n\nIV. SPHEROIDAL DEFORMATIONS\nShape parametrization and quantum spectra\n\nAn axially symmetric anisotropic harmonic oscillator potential system is integrable, and it has a spheroidal equipotential surface. It is known that a spheroidal deformed cavity (infinite well potential) system is also integrable. For spheroidal\ndeformation, the shape function is expressed as\n\"\n\ncos2 θ\nsin2 θ\n+\nf (θ ) =\n(R⊥ /R0 )2 (Rz /R0 )2\n\n#−1/2\n\n-0.6\n\n-0.4\n\n-0.2\n\n0\nδ\n\n0.2\n\n0.4\n\n0.6\n\n0.8\n\n1\n\nFIG. 9. Poincaré surface of section {(x, px )|z = 0} for meridian√\nplane orbits in spheroidal-shape potentials with axis ratio η = 3\n(δ ≈ 0.49) and with several values of radial parameter α . The origin (x = px = 0) corresponds to the orbit Z, and the outer boundary\ncorresponds to the orbit X.\n\nA.\n\nα=5.0\n\n(4.1)\n\nwhere Rz and R⊥ represent lengths of semiaxes of the spheroid\nwhich are parallel and perpendicular to the symmetry axis (z\n\nFIG. 10. Single-particle level diagram for Hamiltonian (2.7) with\nspheroidal deformation (4.1). Scaled-energy levels are plotted as\nfunctions of deformation parameter δ defined by Eq. (4.2). Solid\nand broken lines represents levels with even and odd parities, respectively.\n\naxis), respectively, and R0 is their spherical value. Taking account of the volume conservation condition R2⊥ Rz = R30 , we\ndefine the deformation parameter δ as\nR⊥ = R0 e−δ /3 ,\n\nRz = R0 e2δ /3 .\n\n(4.2)\n\nIt is related to the axis ratio η = Rz /R⊥ by η = eδ . The\nspherical shape η = 1 corresponds to δ = 0 and prolate/oblate\nsuperdeformed shapes η = 2±1 correspond to δ = ± ln 2 ≈\n±0.69. The system with spheroidal power-law potential is\nnonintegrable except for two limits, α = 2 (HO) and α = ∞\n(cavity). In Fig. 9, we show the Poincaré\n√ surface of section\nfor α = 2, 5, 20, and ∞, each with η = 3 (δ ≈ 0.49). It is\nfound that some complex structures emerge in the Poincaré\nplots with increasing α > 2, and the surface becomes most\nchaotic around α ∼ 20, then it turns into simpler structure for\nextremely large α .\nFigure 10 shows the single-particle spectra as functions of\nspheroidal deformation parameter δ . The value of radial parameter is put at α = 5.0, corresponding to medium-mass nuclei. The degeneracies of levels at the spherical shape are resolved and shell structure changes with varying deformation.\nThe level diagram is similar to what is obtained for MO or\nWS/BP models without spin-orbit coupling. One of its characteristic features in comparison with the HO model is the\nasymmetry of deformed shell structures in prolate and oblate\nsides. This asymmetry becomes more pronounced for larger\nα , and it might be regarded as the origin of prolate-shape dominance in nuclear ground-state deformations. We shall discuss\nthe semiclassical origin of the above asymmetry in the follow-\n\n\f11\n(a)\n\n(b)\n\nα=5,β2=0.3\n\n1\n\npx\n\n1\n\npx\n\ntion. Although the properties of classical motion are quite different from those in spheroidal potential, the deformed shell\nstructures are very similar to each other. Thus, the above\ndifference of shape parametrization does not cause a serious\ndifference in the gross shell structures at normal deformations. Notable effects of chaoticity in the quadrupole potential can only be seen in the strong level repulsions at large\ndeformations β2 >\n∼ 0.3. Therefore, we shall only consider the\nspheroidal deformation in the following analysis.\n\nα=5,β2=0.4\n\n0\n\n0\n\n-1\n\n-1\n-1\n\n0\n\n-1\n\n1\n\n0\nx\n\nx\n\n1\n\nB. Prolate-oblate asymmetry in deformed shell structures\n\nFIG. 11. Same as Fig. 9 but for quadrupole deformations β2 = 0.3\nand 0.4 with α = 5.0.\n\ning subsections.\nIn order to see the dependence on shape parametrization, we also calculated the deformed quantum spectra for\nquadrupole deformation, which might be more popular in earlier studies:\n1 + β2P2 (cos θ )\nf (θ ) = q\n.\n2 3\n3\n1 + 53 β22 + 35\nβ2\n\n(4.3)\n\nThe factor in the denominator arranges the conservation of\nvolume surrounded by equipotential surface. Figure 11 show\nPoincaré surface of section for quadrupole deformations β2 =\n0.3 and 0.4 with α = 5.0. Comparing with the Fig. 9(b), one\nwill see that the particle motions in the quadrupole potential\nare more chaotic than those in the spheroidal potential.\nFigure 12 shows the level diagram for quadrupole deforma-\n\n10\n\n8\n\nε\n\n6\n\n4\n\n2\n\n-0.6\n\nLet us examine the properties of deformed shell structures\nin the normal deformation region (|δ | <\n∼ 0.3). As shown in\nFigs. 10 and 12, single-particle spectra in a potential with a\nsharp surface show prolate-oblate asymmetry (in the sense\ndiscussed in Sec. I). Hamamoto and Mottelson[7] paid attention to the different ways of level fanning (from the terminology used in Ref. [7]) in oblate and prolate sides; level fanning\nis considerably suppressed in the oblate side as compared to\nthe prolate side. Due to that suppression of level fanning, shell\nstructures in the oblate shapes are similar to those of the spherical shape, and the system has a smaller chance to gain shell\nenergy by means of oblate deformation. This may explain the\nfeature of prolate-shape dominance. They have shown that\nthe above asymmetric way of level fanning can be understood\nfrom the interaction between single-particle levels, which acts\nto suppress the level repulsions in the oblate side for a potential with sharp surface. It clearly explains the fact that the\nasymmetry becomes more pronounced for heavier nuclei, e.g.,\nin the Woods-Saxon model[12]. The same kind of asymmetry\nis also found in the spectrum of the Nilsson model.\nIn the spheroidal power-law potential model, the asymmetry in level fanning becomes more pronounced for larger α as\nexpected. In Fig. 13(b), fannings of some nl levels (n and l\nrepresent principal and azimuthal quantum numbers, respectively) are illustrated for α = 5.0. One sees that the level fannings are considerably suppressed in the oblate side as in the\ncavity potential.\nIt is interesting to note that, if we take the radial parameter α < 2 (although it does not correspond to actual nuclear\nsituations), the way of level fanning becomes just opposite to\nthe case of α > 2. As one sees in Fig. 13(a), level spreading\nis suppressed in the prolate side. We will discuss later if it\ncauses oblate-shape dominance.\nFollowing the analysis in Ref. [7], we calculate the deformation energy\nEdef (A, δ ) = E(A, δ ) − E(A, 0)\n\nα=5.0\n-0.4\n\n-0.2\n\n0\nβ2\n\n0.2\n\n0.4\n\n0.6\n\nFIG. 12. Same as Fig. 10 but as functions of quadrupole deformation\nparameter β2 .\n\n(4.4)\n\nand compare the energies in prolate and oblate sides at each\nlocal minima. Here, we assume the same single-particle spectra for neutrons and protons and only consider N = Z eveneven nuclei for simplicity. The sum of single-particle energies\nfor nucleus of mass number A is given by\nn\n\nEsp (A) = 4 ∑ ei ,\ni=1\n\nA = N + Z = 4n.\n\n(4.5)\n\n\f12\n(a)\n\n14\n\n0\n\nα=1.1\n\n1i\n\nε\n\n13\n\n-5\n\n12\n\n-10\n\n1h\n11\n\n(a) α=1.1\n\n-15\n3\n\n10\n-0.1\n\n(b)\n\n9\n8.5\n\n-0.05\n\n0\nδ\n\nα=5.0\n\n0.05\n\n4\n\n5\n\n6\n\nA1/3\n\n4\n\n5\n\n6\n\nA1/3\n\n4\n\n5\n\n6\n\nA1/3\n\n6\n\nA1/3\n\n0\n\n0.1\n\n-5\n-10\n\n1i\n\n(b) α=2.0\n\n-15\n\n8\n\nε\n\n3\n1h\n\n7.5\n\n0\n\n7\n\n-5\n\n6.5\n-0.1\n\n-0.05\n\n0\nδ\n\n0.05\n\n0.1\n\n-10\n\n(c) α=3.0\n\n-15\n3\n\nUsing the Strutinsky method, the above energy can be decomposed into a smooth part Ẽsp (A) and an oscillating part\nδ E(A). As in usual, we can expect that the above oscillating part represents the correct quantum shell effect of a\nmany-body system. In Strutinsky's shell correction method,\nthe smooth part is replaced with the phenomenological liquid\ndrop model (LDM) energy to get the total many-body energy,\nbut here we try to extract the smooth part also from the singleparticle energies. In mean-field approximation, the single particle Hamiltonian is written as\nĥ = tˆ + û,\n\n(4.6)\n\nwhere tˆ and û represent kinetic energy and mean-field potential, respectively, and û is currently given by the power-law\npotential. In this case, by the use of the Virial theorem, the\naverage of tˆ and û are in the ratio 2htˆi = α hûi, and one obtains\nhtˆi =\n\nα\nhĥi,\nα +2\n\nhûi =\n\n2\nhĥi.\nα +2\n\n(4.7)\n\nTherefore, the smooth (average) part of the A-body energy is\ngiven approximately by\n+\n*\nα +1\n1\nẼsp (A)\n(4.8)\nẼ(A) ≈ ∑ tˆi + ∑ ûi =\n2\nα +2\ni\ni\nThis expression will be valid for many-body systems interacting with two-body interaction. Thus, we evaluate the A-body\nenergy by\nE(A) =\n\nα +1\nẼsp (A) + δ E(A)\nα +2\n\n(4.9)\n\nFigure 14 compares the local minima of deformation energies (4.4) in prolate and oblate sides. At the HO value\n\n0\n\nEdef (δmin)\n\nFIG. 13. Fanning of single-particle levels 1h (dashed lines) and 1i\n(solid lines) for (a) α = 1.1 and (b) 5.0.\n\n-5\n\n(d) α=5.0\n\nprolate\noblate\n\n-10\n3\n\n4\n\n5\n\nFIG. 14. (Color online) Deformation energies (4.4) of prolate and\noblate states at each local minima. Deformation energy EA (δ ) is\ncalculated as a function of deformation δ and its minimum values\nfor prolate and oblate sides are plotted with filled and open circles,\nrespectively.\n\n[α = 2.0, panel (b)], prolate and oblate deformed shell structures are symmetric and the deformation energies are comparable with each other. For α > 2 [panels (c) and (d) of Fig. 14],\nthe deformation energies in the prolate side become considerably lower than in the oblate side as the radial parameter α becomes larger. The power-law potential model thus reproduce\ncorrectly the feature of prolate-shape dominance in nuclear\ndeformation.\nFor α < 2, as shown in Fig. 14(a), we find no indication\nof oblate-shape dominance in spite of the feature of level fanning shown in Fig. 13(a). One finds some lowest energy states\nat oblate shapes δ ∼ −0.3, but the difference in energies between prolate and oblate minima are generally small. Therefore, one cannot fully explain the prolate(oblate)-shape dominance only by the ways of level fanning.\nIn order to analyze shape stability, we define shelldeformation energy using the smooth part of the energy at\nspherical shape as a reference,\n∆E(A, δ ) = E(A, δ ) − Ẽ(A, 0),\n\n(4.10)\n\nwith Eqs. (4.8) and (4.9). [Note that the second term on the\nright-hand side of Eq. (4.10) is not Ẽ(A, δ ), so that ∆E contains the smooth part of the deformation energy.] Figure 15\n\n\f13\nα=1.1\n\n(a)\n\nα=1.1\n\n(a)\n15\n\n7\n\n14\n13\n12\n\n6\n\nε\n\nA1/3\n\n11\n10\n\n5\n\n9\n8\n7\n\n4\n\n6\n\n-0.6\n\n-0.4\n\n-0.2\n\n0\n\n0.2\n\n0.4\n\n-0.8\n\n0.6\n\n-0.6\n\n-0.4\n\n-0.2\n\n0\nδ\n\n0.2\n\n0.4\n\n0.6\n\n0.8\n\n-0.4\n\n-0.2\n\n0\nδ\n\n0.2\n\n0.4\n\n0.6\n\n0.8\n\nδ\n\nα=5.0\n\n(b)\n\nα=5.0\n\n(b)\n14\n\n7\n\n13\n12\n\nε\n\nA1/3\n\n6\n\n5\n\n11\n10\n9\n\n4\n\n8\n-0.6\n\n-0.4\n\n-0.2\n\n0\nδ\n\n0.2\n\n0.4\n\n0.6\n\nFIG. 15. (Color online) Contour plot of the A-body shell-deformation\nenergy (4.10) in the deformation-mass number plane (δ , A1/3 ) for\n(a) α = 1.1 and (b) 5.0. Solid and dashed contour lines represent\nnegative and positive values, respectively. Dots represent values of\nthe deformation parameter at absolute energy minima for each A.\nThick solid curves represent constant-action lines (4.16) for bridge\norbit M(1,1).\n\nshows contour plots of ∆E for α = 1.1 and 5.0 as functions\nof deformation δ and mass number A. They show some deep\nminima along the δ = 0 axis at values of A corresponding\nto spherical magic numbers. The energy valleys run through\nthese minima and the deformation energy minima distribute\nalong them. For α = 5.0, the valley lines in the (δ , τ ) plane\nhave large slopes in the prolate side and deep energy minima\nare formed around δ ∼ 0.2 for mass numbers at the middle\nof adjacent spherical magic numbers, while the valley lines\nare almost flat in the oblate side. This is essentially the same\nbehavior as what Frisk found for the spheroidal cavity[13].\nFor α = 1.1, the valley lines have larger slope in the oblate\n\n-0.8\n\n-0.6\n\nFIG. 16. (Color online) Contour plot of oscillating level density for\nradial parameter (a) α = 1.1 and (b) 5.0 in deformation-energy plane\n(δ , E ). For calculation of coarse-grained level density, smoothing\nwidth ∆E = 3.0 is taken. Solid and dashed contour lines represent\nnegative and positive values, respectively. Thick solid lines represent\nconstant-action lines (4.13) for the bridge orbits M(1,1).\n\nside, but the slope in the prolate side is not as small as in\nthe oblate side for α = 5.0 and the deformation energy minima distribute mainly along the valley lines in the prolate side.\nOne can find rather deep energy minima at δ ∼ −0.3 for particle numbers between the spherical magic numbers, but the\nenergy difference between oblate and prolate local minima are\ngenerally small. Thus, for an understanding of prolate-shape\ndominance, it is critical to explain the asymmetric behavior of\nthe slopes of the energy valleys.\nSince shell energy takes a deep negative value when the\nsingle-particle level density at the Fermi energy is low, let us\ninvestigate the coarse-grained single-particle level density as\nfunctions of energy and deformation. Figure 16 shows the\noscillating part of course-grained single-particle level density\n\n\f14\nfor α = 1.1 and 5.0 plotted as functions of deformation δ and\nscaled energy E. They show regular ridge-valley structures\nsimilar to the shell energy. Therefore, for an understanding\nof prolate-shape dominance, it is essential to investigate the\norigin of the above ridge-valley structures in the deformed\nsingle-particle level density. For the spheroidal cavity potential, Frisk ascribed it to the change of the action integrals along\nthe triangular and rhomboidal orbits in the meridian plane, for\nwhich the volume conservation condition plays an important\nrole[13]. We are going to study the case of the more realistic\npower-law potential.\nIn the following subsections, we will show that the above\nridge-valley structure can be explained in connection with\nclassical periodic orbits using semiclassical periodic-orbit theory. The thick solid curves in Figs. 15 and 16 represent the\nsemiclassical prediction of the valley lines which will be discussed in Sec. IV D.\nC. Periodic orbits in spheroidal potential\n\nIn order to examine the semiclassical origin of the above\nasymmetry in a deformed shell structure using periodic orbit\ntheory, we first consider the properties of classical periodic\norbits in the spheroidal power-law potential and their bifurcations. For the spherical potential, all the periodic orbits are\nplanar and degenerate with respect to rotations. The degree\nof degeneracy for the orbit family is described by degeneracy parameter K which represents the number of independent\ncontinuous parameters required to specify a certain orbit in\nthe family. The maximum value of K is equal to the number of independent symmetric transformations of the system.\nThe isolated orbits have K = 0. In the spherical cavity potential, degeneracy parameter is K = 3 for generic periodic\norbits, and K = 2 for diametric and circular orbits which are\ntransformed onto themselves by one of the rotations. If the\nspheroidal deformation is added to the potential, generic planar orbits bifurcate into two branches: One is the orbit in the\nequatorial plane and the other is the orbit in the meridian plane\n(the plane containing the symmetry axis). All but two exceptional orbits degenerate with respect to the rotation about the\nsymmetry axis, and the degeneracy parameter is K = 1. The\ndiametric orbit bifurcate into degenerate family of equatorial\ndiametric orbits (K = 1) and an isolated diametric orbit along\nthe symmetry axis (K = 0). The circular orbit bifurcates into\nan isolated equatorial circular orbit (K = 0) and an oval-shape\norbit in the meridian plane (K = 1). With increasing deformation towards prolate side (δ > 0), the equatorial orbits undergo successive period m-upling bifurcations and new 3D orbits emerge. In the oblate side, the diametric orbit along the\nsymmetry axis undergoes successive period m-upling bifurcations and generates new meridian-plane orbits. These newborn 3D and meridian-plane orbits have hyperbolic caustics\nand are sometimes called hyperbolic orbits.\nIt is very interesting to note that the above new-born hyperbolic orbits from equatorial orbits are distorted towards\nthe symmetry axis with increasing deformation and finally\nsubmerge into the diametric orbit along the symmetry axis.\n(Some 3D orbits submerge into other hyperbolic orbits before\n\nsubmerging into the symmetry-axis orbit at last.) In this way,\nthe hyperbolic orbits make bridges between the equatorial and\nsymmetry-axis orbits, and we shall call those hyperbolic orbits \"bridge orbits\"[33, 34]. With increasing δ , periods of the\nequatorial orbit decrease while that of the symmetry-axis orbit\nincreases. At each crossing point of the periods (or actions)\nof repeated equatorial and symmetry-axis orbits, bridge orbits\nexist to intervene between them.\nAccordingly, we shall classify periodic orbits in the\nspheroidal power-law potential into the following four groups:\ni) Isolated orbits (K = 0): This group consists of the diametric orbit along the symmetry axis (z-axis), denoted\nZ, and the circular orbit in the equatorial plane, denoted\nEC. Orbit EC is stable both in the prolate and oblate\nsides, whose repeated period m-upling bifurcations generate 3D bridge orbits. Orbit Z is stable in the oblate\nside and undergoes successive period m-upling bifurcations, while its stability alternates in the prolate side\nwith repeated bifurcations which absorb bridge orbits.\nii) Equatorial-plane orbits (K = 1): This corresponds to\nthe equatorial-plane branch of the deformation-induced\nbifurcation. They have the same shapes as those in the\nspherical potential shown in Fig. 4. They are denoted\nE(k, m), where k is the number of vertices (corners) and\nm is the number of rotation. The diametric orbit is specially denoted X (which includes the orbits along the x\naxis).\niii) Meridian-plane orbits (K = 1): This corresponds to the\nmeridian-plane branch of the deformation-induced bifurcation. They survive up to any large deformation,\nkeeping their original geometries.\niv) Bridge orbits (K = 1): These orbits emerge from the\nbifurcations of equatorial orbits. Meridian-plane orbits\nemerge from diametric orbits and submerge into repetitions of orbit Z. Nonplanar 3D orbits emerge from nondiametric equatorial orbits, and they also submerge into\nthe orbit Z. Some of them submerge into other bridge\norbits before submerging into Z. The meridian-plane\nbridge which rests between mX (mth repetition of X)\nand nZ (nth repetition of Z) is denoted M(m, n). Except for the M(1,1) bridge, a pair of stable and unstable bridge orbits emerge, and are denoted M(m, n)s and\nM(m, n)u , respectively. 3D bridge B(m, m, n) emerges\nvia pitchfork bifurcation of equatorial mEC (mth repetitions of EC), and submerges into M(m, n) orbit before finally submerging into nZ. The other 3D bridges\nintervening between equatorial E(k, m) and nZ emerge\nas a stable and unstable pair, and are denoted as\nB(k, m, n)s,u . With increasing deformation, they first\nsubmerge into 3D bridge B(m, m, n), which will submerge into M(m, n) and finally into nZ.\nFigure 17 shows the bifurcation diagram for bridge orbit\nM(1,1) for α = 3.0. The traces of (2 × 2) symmetry-reduced\nmonodromy matrices for relevant periodic orbits are plotted\nas functions of deformation parameter δ . The K = 1 family\n\n\f15\nerate family) β dominates the periodic orbit sum, namely,\n\n4\n\nδ g(E) ≈ Aβ cos(E τβ − π2 νβ ).\n\n3\n2\n\nThen, the valley lines of level density should run along the\ncurves where the above cosine function takes the minimum\nvalue −1, namely,\n\n1\n\n~\nTrM\n\n(4.11)\n\n0\n\nE τβ −\n\n-1\n\nπ\nν = (2n + 1)π ,\n2 β\n\nn = 0, 1, 2, * * * .\n\n(4.12)\n\nIn Fig. 16, we plot these constant-action lines\n\n-2\nX\nZ\nM(1,1)\n\n-3\n-4\n-0.4\n\n-0.2\n\nE=\n0\n\n0.2\n\n(2n + 1 + 21 νβ )π\nτβ (δ )\n\n(4.13)\n\n0.4\n\nδ\n\nFIG. 17. Bifurcation diagram for the M(1,1) bridge orbit between the\nX and Z orbits for α = 3.0. Traces of the symmetry-reduced monodromy matrix M̃ are plotted as functions of deformation parameter δ . Bifurcation points (Tr M̃ = 2) are indicated by open circles.\nShapes of the periodic orbits as well as the equipotential surface are\nalso shown.\n\nof equatorial diameter orbits X undergoes pitchfork bifurcation at δ = −0.34 and a family of oval-shape meridian-plane\norbits M(1,1) emerge. In the limit δ → 0, the shape of the\nM(1,1) orbit approaches a circle, and it associates with equatorial circular orbit EC to form a K = 2 family. At δ > 0 it\nbifurcates into an equatorial EC and a meridian M(1,1) family again. The meridian branch submerges into the orbit Z at\nδ = 0.34 via pitchfork bifurcation. Thus, the orbits M(1,1)\nmake a bridge between two diametric orbits X and Z.\nIn the HO limit, α → 2, the bridge shrinks to a crossing\npoint of X and Z orbits and can exist only at δ = 0 (spherical\nshape), where they altogether form a degenerate K = 2 family.\nWith increasing α , the bridge orbit exists in a wider range\nof deformation over the crossing point. In the cavity limit,\nα → ∞, this orbit approaches the so-called creeping orbit or\nwhispering gallery orbit, which runs along the boundary.\n\nD. Semiclassical origin of prolate-oblate asymmetry\n\nTo see the effect of the above bifurcation on the shell structure, we calculate Fourier transform of level density (2.30)\nwith the obtained quantum spectra. In Fig. 18, modulus of\nFourier transform |F(τ , δ )| is shown in a gray-scale plot as a\nfunction of deformation δ and scaled period τ . Scaled periods\nof classical periodic orbits τβ (δ ) are also drawn by lines. One\nsees a nice correspondence between the quantum Fourier amplitude and classical periodic orbits. Particularly, one can find\nsignificant peaks along the bridge orbit M(1,1), which indicate that the shell structure in the normal deformation region\nis mainly determined by the contribution of this bridge orbit.\nLet us assume that a contribution of single orbit (or degen-\n\nfor bridge orbit M(1,1). We see that the constant-action lines\nof the bridge orbit nicely explain the ridge-valley structure\nin the quantum level density. The slight disagreement of\nconstant-action lines and the bottom of the energy valleys\nmight be due to interference between other PO contributions.\nThe shell energy is also given by the periodic-orbit contribution as\n\nδ E(N) ≈\n\nAβ\ncos[EF (N)τβ − π2 νβ ],\nτβ2\n\n(4.14)\n\nwhere EF represents Fermi level, which is approximately\ngiven by\nEF (N) ≈ [3N/c0 (α )]\n\n1/3\n\n(4.15)\n\nwhich is derived from the leading term of Eq. (2.21). Thus,\nthe shell energy takes large negative values along the constantaction lines for dominant orbit β :\nEF ≈\n\n\u0012\n\n3 A\nc0 (α ) 4\n\n\u00131/3\n\n=\n\n(2n + 1 + 21 νβ )π\n.\nτβ (δ )\n\n(4.16)\n\nIn Fig. 15, we also plot the above constant-action lines for\nbridge orbits M(1,1) with thick solid lines. They satisfactorily explain the valley lines of shell energy. Distribution of\ndeformed shell energy minima in Fig. 15 are thus understood\nas the effect of bridge orbit contribution.\nFor α > 2, bridge orbits appear upward from the crossing\npoint of two diametric orbits X and Z in the (δ , τ ) plane. Note\nthat the scaled action of orbit Z has a larger slope than that of\norbit X in the (δ , τ ) plane. This difference comes from the fact\nthat the lengths of semiaxes Rz and R⊥ in a volume-conserved\nspheroidal body are proportional to the different powers of\ndeformation parameter δ as in Eq. (4.2). The scaled period\nof the diametric orbit along the ith axis is proportional to the\nlength of corresponding semiaxis Ri ,\n\nτi = τ0D\n\nRi\n,\nR0\n\nwhere τ0D is the scaled period of the diametric orbit at spherical shape. Using Eq. (4.2), one has\n\nτX = τ0D e− 3 δ ,\n1\n\nτZ = τ0D e 3 δ .\n2\n\n(4.17)\n\n\f16\n(a)\n\nα=5.0\n\n10\n11\n\n8\n10\n\n6\nτ\n\n9\n\nε\n\n4\n\nX\nM(1,1)\n\nZ\n\n8\n\nEC\n\n2\n\nα=1.1\n0\n-0.8\n\n(b)\n\n-0.6\n\n7\n\n-0.4\n\n-0.2\n\n0\nδ\n\n0.2\n\n0.4\n\n0.6\n\n0.8\n6\n0\n\n15\n\n0.2\n\n0.4\n\n0.6\n\n0.8\n\n1\n\nδ\n\nFIG. 19. (Color online) Contour plot of oscillating level density for\nradial parameter α = 5.0 around a prolate superdeformed region.\nSmoothing width Γ = 0.2 is used. Solid and dashed contour lines\nrepresent negative and positive values, respectively. Thick dotted,\ndashed and solid lines represent constant action lines (4.13) of periodic orbits 2X, M(2,1), and B(2,2,1), respectively.\n\nτ\n\n10\n\nEC\n\nM(1,1)\n\nZ\nX\n\n5\n\nFor α < 2, a bridge orbit appear in the opposite side of the\ncrossing point and its slope becomes larger in the oblate side.\nThis also explains the profile of valley lines in level density\nand shell energy for α = 1.1 as shown in Figs. 16(a) and 15(a).\n\nα=5.0\n0\n-0.8\n\n-0.6\n\n-0.4\n\n-0.2\n\n0\nδ\n\n0.2\n\n0.4\n\n0.6\n\n0.8\n\nE. Superdeformed shell structures\nFIG. 18. (Color online) Modulus of the Fourier transform of the\nlevel density is shown by gray-scale plot as a function of deformation\nparameter δ and scaled period τ . Scaled periods of classical periodic\norbits are also displayed.\n\nTherefore, the bridge between X and Z orbits has a large slope\nin the prolate side while it is almost flat in the oblate side. This\nclearly explains the profile of ridge-valley structures in level\ndensity and shell energy. With increasing α , triangular- and\nsquare-type orbits emerge at α = 7 and 14, respectively, via\nthe isochronous bifurcations of the circular orbit [see Eq. (3.8)\nfor m = 1] for spherical shape. With spheroidal deformation,\nthey bifurcate into equatorial and meridian branches, which\nare both singly degenerated due to the axial symmetry. For\nfinite α , they submerge into oval orbits and finally into diametric orbits at large deformations. In this sense, they are also\nbridge orbits intervening between two diametric orbits. These\nmeridian orbits survive up to larger deformation with increasing α , and in the cavity limit (α → ∞), they survive for any\nlarge deformation. Therefore, the meridian orbits in the cavity\npotential can be regarded as a limit of bridge orbits. Thus we\nsee that Frisk's argument for a spheroidal cavity system[13] is\ncontinuously extended to the case of finite diffuseness.\n\nIn the axially deformed harmonic oscillator (HO) potential\nmodel, one sees simultaneous degeneracy of many energy levels at rational axis ratios. The HO model is often used for the\nnuclear mean-field potential in the limit of light nuclei. In\nthe HO model, superdeformation is explained as the result of\nstrong level bunching at axis ratio 2:1. A search for much\nlarger deformation originated from the strong level bunching at axis ratio 3:1 (sometimes referred to as hyperdeformation) has also been a challenging experimental and theoretical problem. On the other hand, the spheroidal cavity model,\nwhich is used as the limit of potential for heavy nuclei, also\nshows superdeformed shell structures, while the shell effect\nis much weaker than that found in the oscillator model. In\nthe spheroidal cavity model, superdeformed shell structures\nare intimately related with emergence of meridian and 3D orbits which oscillate twice in the short axis direction while they\noscillate once in the long-axis direction, just as the degenerate 3D orbits in the 2:1 axially-deformed HO potential[14].\nOne may expect to have a unified semiclassical understanding\nof the origin of superdeformed shell structures found in the\nabove two limiting cases by connecting them with the powerlaw potential model.\nFigure 19 shows the oscillating part of the coarse-grained\nlevel density for radial parameter α = 5.0 and deformation\n\n\f17\n5\n4\n3\n2\n\n~\nTrM\n\nδ around a superdeformed region. It clearly show that new\nregularities in shell structure are formed at a superdeformed\nregion. The valley lines are up-going till δ ∼ 0.5, and they\nbend down around δ ∼ 0.6. One sees another deep minima at\nδ>\n∼ 0.7. Let us examine their semiclassical origins.\nFor α > 2, one finds bridge orbits M(2,1) which intervenes\nbetween orbits 2X (second repetitions of X) and Z. Figure 20\nis the bifurcation diagram for the orbits relevant to this bifurcation, calculated for α = 3.0. The orbit X undergoes a\nperiod-doubling bifurcation at δ = 0.55 and there emerges a\npair of bridge orbits M(2, 1)s (stable) and M(2, 1)u (unstable).\nThey have shapes of a boomerang and a butterfly as shown in\nFig. 20. With increasing δ , those orbits are distorted toward\nthe z axis and finally submerge into the orbit Z at different\nvalues of δ via pitchfork bifurcations.\nFor larger α , various equatorial orbits appear as shown in\nFig. 4, and they also undergo bifurcations by imposing deformation. Each of those bifurcations will generate a pair of 3D\nbridge orbits, which are also distorted toward the symmetry\naxis by increasing δ and finally submerge into Z. Figure 21\nshows some 3D bridge orbits important for superdeformed\nshell structures for α = 5.0. Equatorial circular orbit EC undergoes a period-doubling bifurcation, which is peculiar to 3D\nsystems, and generates 3D bridge orbit B(2,2,1). Equatorial\norbit E(5,2) undergoes a nongeneric period-doubling bifurcation and a pair of 3D bridge orbits B(5, 2, 1)s,u emerge. All the\nabove 3D orbits finally submerge into the Z orbit by increasing\ndeformation δ . See the Appendix for a detailed description of\nthese 3D bridge orbit bifurcations.\nFigure 22 shows the Fourier transform of scaled-energy\nlevel density for α = 5.0 around a superdeformed region. The\nscaled periods of classical periodic orbits are also drawn with\nlines. The Fourier amplitude shows remarkable enhancement\nalong the bridge orbits M(2,1) and B(5,2,1), indicating their\nsignificant roles in superdeformed shell structures.\nThe constant action lines (4.13) for M(2,1) and B(2,2,1)\nare shown in Fig. 19 with thick solid and broken lines. They\nperfectly explain the ridge-valley structures of quantum level\ndensities. This shows the significant roles of bifurcations\nof M(2,1) and B(n, 2, 1) orbits for enhanced shell effects at\nδ ∼ 0.5 and 0.7, respectively.\nM(2,1) and B(2,2,1) orbits shrink to the crossing point of\n2X (2EC) and Z orbits in the HO limit, α → 2, and turn into a\nK = 4 degenerate family. With increasing α , the deformation\nrange in which a bridge orbit can exist becomes wider. Therefore, the bifurcation deformation of the orbits 2X and 2EC\nbecomes smaller with increasing α , and the effect of these\norbits takes place at smaller deformation. This may explain\nthe experimental fact that deformations of the superdeformed\nstates are smaller for heavier nuclei; e.g., β2 ∼ 0.6 for the Dy\nregion and β2 = 0.4–0.5 for the Hg region[35, 36]. In the cavity limit α → ∞, the two meridian orbits M(2,1) and the two\n3D orbits B(n,2,1) respectively join to form K = 1 families,\nwhich survive for arbitrary large deformations.[14, 37]\nIn conclusion, the highly degenerate family of orbits in the\nrational HO potential (α = 2) are resolved at α > 2 into two\norbits: equatorial and symmetry-axis orbits that have fewer\ndegeneracies, and the bridge orbit which mediates between\nthem within a finite deformation range. The \"length\" of the\n\n1\n0\n-1\n2X\nZ\nM(2,1)s\nM(2,1)u\n\n-2\n-3\n0.5\n\n0.6\n\n0.7\n\n0.8\n\n0.9\n\n1\n\nδ\nFIG. 20. Same as Fig. 17 but for the M(2,1) bridge orbit between\n2X and Z; \"2X\" represents the second repetition of X. The radial\nparameter α = 3.0 is used. A pair of bridge orbits emerge at δ =\n0.55 via period-doubling bifurcation. The unstable branch M(2, 1)u\nand stable branch M(2, 1)s submerge into Z at δ = 0.80 and 0.97,\nrespectively, via pitchfork bifurcations.\n\n(a)\n\nδ=0.69\n\nδ=0.69\n\n(b)\n\nz\n\nz\n\n2\n\n2\n\n1\n\n1\n\n0\n\n0\n\n-1\n-2-2\n\n-1\n2\n1\n\n-1\nx\n\n0\n\n0\n1\n\n-1\n\n-2-2\n\ny\n\n2\n1\n\n-1\nx\n\n0\n\n0\n\n1\n\n2-2\n\nB(5,2,1)s\n\n-1\n\ny\n\n2-2\n\nB(5,2,1)u\n\n(c)\n(c)\n\nδ=0.72\nz\n2\n1\n0\n-1\n-2-2\n\n2\n1\n\n-1\nx\n\n0\n\n0\n1\n\n-1\n\ny\n\n2-2\n\nB(2,2,1)\n\nFIG. 21. 3D orbits responsible for the superdeformed shell structure at δ ∼ 0.7 and α = 5. 3D plots and projections on (x, y),\n(x, z), and (y, z) planes are shown as well as equipotential surfaces.\nB(5, 2, 1)s and B(5, 2, 1)u are a pair of stable and unstable 3D orbits\nthat emerged from equatorial orbit E(5,2). B(2,2,1) emerged from\nthe second repetition of the equatorial circular orbit, 2EC.\n\n\f18\n11\n\n2EC\n\n10\n\nB(5,2,1)\n\nE(5\n\nτ\n\n,2)\n\n9\n\n)\n\nB(2,2,1\nM(2,1)s\n\n2X\n\nM(2,1)u\n\nZ\n\n8\n\nα=5.0\n7\n0.3\n\n0.4\n\n0.5\n\n0.6\n\n0.7\n\n0.8\n\n0.9\n\n1\n\nδ\n\nFIG. 22. (Color online) Gray-scale plot of the Fourier transform of\nthe quantum level density (2.30) for radial parameter α = 5.0 as a\nfunction of deformation δ and scaled period τ . The modulus of the\nFourier transform has a large value in the dark region. The scaled\nperiods of classical periodic orbits τβ are displayed with lines. Their\nbifurcation points are indicated by open circles.\n\nbridge in the (δ , τ ) plane grows with radial parameter α , and\nthe superdeformed shell structures are formed in smaller δ for\nlarge α , corresponding to heavier nuclei, due to the strong\nshell effect brought about by the bridge-orbit bifurcation. In\nthe α → ∞ limit, some of the simplest bridge orbits coincide\nwith meridian and 3D orbits emerging from the bifurcation\nof equatorial orbits at δ = 0.5–0.6 which play a significant\nrole in superdeformed shell structures in the spheroidal cavity\nmodel[14, 15]. Thus, the semiclassical origins of superdeformed and hyperdeformed shell structures in the HO and the\ncavity models are unified as the two limiting cases of the contribution of bridge-orbit bifurcations in power-law potential\nmodel.\n\nV.\n\ncussed by Frisk. Our results elucidate that the essence of the\nsemiclassical origin of prolate-shape dominance in the cavity\nmodel also applies to the more realistic power-law potential\nmodel. The semiclassical origin of superdeformed shell structures which have been discussed separately for oscillator and\ncavity models are continuously connected via bridge orbits in\npower-law potential models.\nIn this paper we have explored the contribution of periodic orbits via Fourier transform of the quantum level density. In order to clarify the role of periodic-orbit bifurcation\nto the level density, it is important to establish a semiclassical\nmethod with which we can evaluate contribution of classical\nperiodic orbits in the bifurcation region. Some preliminary results for the spherical power-law potential using the improved\nstationary phase method have been reported in Ref. [38]. Application of a uniform approximation to this problem is also\nin progress.\nAnother important subject is the inclusion of spin degrees\nof freedom. Since the nuclear mean field has strong spin-orbit\ncoupling, it should be crucial to take account of its effect to\nanalyze realistic nuclear shell structures. It is shown that the\nqualitative characters of deformed shell structures are not very\nsensitive to the spin-orbit coupling[12]; however, it is reported\nthat the prolate-shape dominance in nuclear ground-state deformation is realized after strong correlation with surface diffuseness and spin-orbit coupling. In subsequent work, we will\nexpand the model Hamiltonian to incorporate the spin-orbit\npotential and discuss the nuclear problems which are closely\nrelated to spin degrees of freedom due to the strong spinorbit coupling. Some preliminary results have been reported\nin Ref. [18].\n\nACKNOWLEDGMENTS\n\nThe author thanks K. Matsuyanagi, M. Brack, A.G. Magner, Y.R. Shimizu, and N. Tajima for discussions.\n\nSUMMARY\nAppendix: Bifurcations of 3D bridge orbits\n\nWe have made a semiclassical analysis of deformed shell\nstructures with the radial power-law potential model, which\nwe introduce as a realistic nuclear mean-field model (except\nfor the lack of a spin-orbit term in the current version) for\nstable nuclei in place of WS/BP models. We have shown\nthat bridge orbits mediating equatorial and symmetry-axis\norbits play a significant role in normal and superdeformed\nshell structures. Particularly, prolate-oblate asymmetry of deformed shell structures, which is responsible for the prolate\ndominance in nuclear deformations, is clearly understood as\nthe asymmetric slopes of bridge orbits in the (δ , τ ) plane. This\nasymmetry grows with increasing radial parameter α , and\nthus with increasing mass number A, which explains the fact\nthat the prolate dominance is more remarkable in heavier nuclei. Some of these bridge orbits coincide with triangular and\nrhomboidal orbits in the cavity limit α = ∞, whose significant\ncontribution to the coarse-grained level density in a spheroidal\ncavity and their roles in prolate-shape dominance were dis-\n\nFor a periodic orbit in a 2D autonomous Hamiltonian system, one can examine its bifurcation scenario by evaluating\nthe trace of (2 × 2) monodromy matrix as a function of control parameter such as deformation, strength of external field,\nor energy. 3D orbits in an axially symmetric potential have\na (2 × 2) symmetry-reduced monodromy matrix, but the ignored degree of freedom corresponding to symmetric rotation\nalso plays a role in bifurcation.\nFigure 23 shows a bifurcation diagram of periodic orbits responsible for superdeformed shell structures for α = 5.0. The\norbit X undergoes a period-doubling bifurcation at δ = 0.42\nand generates a pair of bridges M(2, 1)u and M(2, 1)s , which\nsubmerge into the orbit Z at δ = 0.78 and 0.94, respectively.\nEquatorial circular orbit EC undergoes a period-doubling bifurcation at δ = 0.6 and generates 3D bridge B(2,2,1), which\nsubmerges into M(2, 1)s at δ = 0.77 before finally submerging into Z. Since EC is isolated, the monodromy matrix has\n\n\f19\n(a) 10\nM(2,1)u\n\n8\n\n~\nTrM\n\n6\n4\n\nZ\n\nB(2,2,1)\n\nE(5,2)\n\n2\n\n2X\n0\n\nM(2,1)s\n\n2EC(1)\n-2\n-4\n0.3\n\n0.4\n\n0.5\n\n0.6\n\n0.7\n\n0.8\n\nδ\n\n(b) 3\n\n0.9\n\n1\n\n*\n2.1\n\n**\n2.00005\n\n2.0\n\n2.00000\n\n1.9\n\n1.99995\n\nB(5,2,1)u**\n2\n\n~\nTrM\n\nE(5,2)*\nB(5,2,1)s**\n1\n\nsize (4 × 4) and its four eigenvalues consists of two conjugate/reciprocal pairs. One pair are e±ivc , which represent stability against displacement in the equatorial plane, whose values are independent of deformation δ [2EC(1) in Fig. 23].\nThe other pair e±ivz , which represent stability against displacement toward the off-planar direction, change their values as a function of deformation [2EC(2) in Fig. 23(b)]. Bifurcation occurs when the latter eigenvalues become unity\n(vz = 0). The monodromy matrix of bridge B(2,2,1) has eigenvalues (eivc , e−ivc , 1, 1) at its birth, and the first two eigenvalues change with increasing deformation. Therefore, the bifurcation point does not correspond to Tr M̃ = 2 for this bifurcation. The orbit B(2,2,1) submerge into M(2,1) at δ = 0.77.\nThis bifurcation point does not correspond to Tr M̃ = 2, either.\nHere, with decreasing δ , the mother orbit M(2, 1)s pushes out\na new orbit B(2,2,1) in the direction of the eigenvector of M\nbelonging to one of the unit eigenvalues (other than the one\nwhich corresponds to the rotation about the symmetry axis).\nIn general, the real symplectic matrix M can be transformed\ninto a Jordan canonical form by a suitable orthogonal transformation, and its (2 × 2) sub-block associated with the unit\neigenvalue generally has off-diagonal element v:\n\n2EC(2) *\nB(2,2,1)\n1.8\n\n0\n\n2EC(1)\n-1\n0.54\n\n1.7\n0.56\n\n0.58\n\n0.6\n\n0.62\n\n0.64\n\n0.66\n\nδ\n\n\n\n1 v\n\nM∼ 0 1\n\n\nM̃\n\n\n\n\nFIG. 23. Bifurcation diagram for periodic orbits around a superdeformed region for α = 5.0. Values of traces of the symmetry-reduced\nmonodromy matrices are plotted as functions of deformation parameter δ . Panel (b) is the magnified plot of the rectangular region indicated in panel (a). For the orbit 2EC, traces of two (2 × 2) sub-blocks\nin a total (4×4) monodromy matrix, denoted by 2EC(1) and 2EC(2),\nare plotted (see text). In panel (b), Tr M̃ for orbits marked * and **\nare plotted in different scales indicated on the right vertical axis.\n\nFor finite v, there is only one eigenvector belonging to the\nunit eigenvalue, corresponding to the direction of symmetric rotation. This off-diagonal element varies as a function of\ndeformation, and vanishes at the bifurcation point, where M\nacquires a new eigenvector perpendicular to the former one.\nHere, the symmetry-reduced monodromy matrix M̃ generally\ndoes not have unit eigenvalues. This is what occurs in the case\nof a 3D orbit bifurcation in an axially symmetric potential,\nwhich is not detected from the trace of a symmetry-reduced\nmonodromy matrix.\n\n[1] M. C. Gutzwiller, J. Math. Phys. 12, 343 (1971).\n[2] R. Balian and C. Bloch, Ann. Phys. (NY) 69, 76 (1972).\n[3] A. Bohr and B. R. Mottelson, Nuclear Structure (Benjamin,\nReading, MA, 1975), Vol. II.\n[4] N. Tajima, S. Takahara and N. Onishi, Nucl. Phys. A 603, 23\n(1996).\n[5] N. Tajima and N. Suzuki, Phys. Rev. C 64, 037301 (2001);\nN. Tajima, Y. R. Shimizu and N. Suzuki, Prog. Theor. Phys.\nSuppl. 146,628 (2002).\n[6] S. Takahara, N. Onishi, Y. R. Shimizu and N. Tajima, Phys.\nLett. B 702, 429 (2011);\nS. Takahara, N. Tajima, and Y. R. Shimizu, preprint\narXiv:1208.6356 (2012).\n[7] I. Hamamoto and B. R. Mottelson, Phys. Rev. C 79, 034317\n(2009).\n[8] V. M. Strutinsky, Nucl. Phys. A 95, 420 (1967); 122, 1 (1968).\n[9] M. Brack and H. C. Pauli, Nucl. Phys. A 207, 401 (1973).\n\n[10] M. Brack and R. K. Bhaduri, Semiclassical Physics, (Addison\nWesley, New York, 1997).\n[11] H. Nishioka, K. Hansen and B. R. Mottelson, Phys. Rev. B 42,\n9377 (1990).\n[12] V. M. Strutinsky, A. G. Magner, S. R. Ofengenden and\nT. Døssing, Z. Phys. A 283, 269 (1977).\n[13] H. Frisk, Nucl. Phys. A 511, 309 (1990).\n[14] K. Arita, A. Sugita and K. Matsuyanagi, Prog. Theor. Phys. 100,\n1223 (1998).\n[15] A. G. Magner, K. Arita, S. N. Fedotkin and K. Matsuyanagi,\nProg. Theor. Phys. 108, 853 (2002).\n[16] J. Carbonell, F. Brut, R. Arvieu and J. Touchard, J. of Phys. G\n11, 325 (1985).\n[17] R. Arvieu, F. Brut, J. Carbonell and J. Touchard, Phys. Rev. A\n35, 2389 (1987).\n[18] K. Arita, Int. J. Mod. Phys. E 13, 191 (2004) (10th Workshop on\nNuclear Physics \"Marie and Pierre Curie\", Proceedings, 2003,\n\n\f20\nKazimierz Dolny, Poland).\n[19] S. Cwiok, J. Dudek, W. Nazarewicz, J. Skalski and T. Werner,\nComp. Phys. Comm. 46, 379 (1987).\n[20] B. Buck and and A. Pilt, Nucl. Phys. A 280, 133 (1977).\n[21] B. K. Jennings, Ann. Phys. (N.Y.) 84, 1 (1974).\n[22] M. Baranger, K. T. R. Davies and J. H. Mahoney, Ann. Phys.\n(N.Y.) 186, 95 (1988).\n[23] A. M. Ozorio de Almeida and J. H. Hannay, J. Phys. A 20, 5873\n(1987).\n[24] S. C. Creagh and R. G. Littlejohn, Phys. Rev. A 44, 836 (1991).\n[25] M. V. Berry and M. Tabor, Proc. R. Soc. Lond. A 349, 101\n(1976).\n[26] M. Sieber, J. Phys. A 29, 4715 (1996).\n[27] H. Schomerus and M. Sieber, J. Phys. A 30, 4537 (1997).\n[28] M. Sieber and H. Schomerus, J. Phys. A 31, 165 (1998).\n[29] A. G. Magner, S. N. Fedotkin, K. Arita, T. Misu, K. Matsuyanagi, T. Schachner and M. Brack, Prog. Theor. Phys. 102,\n\n551 (1999).\n[30] J. Kaidel and M. Brack, Phys. Rev. E 70, 016206 (2004).\n[31] K. Arita and M. Brack, Phys. Rev. E 77, 056211 (2008).\n[32] A. Sugita, K. Arita, and K. Matsuyanagi, Prog. Theor. Phys.\n100, 597 (1998).\n[33] K. Arita and M. Brack, J. Phys. A 41, 385207 (2008).\n[34] Some bridge orbit bifurcations are exemplified in Ref. [33], and\nother ones are also found in M. Baranger and K. T. R. Davies,\nAnn. Phys. (NY) 177, 330 (1987).\n[35] P. J. Twin, Nucl. Phys. A 520, 17c (1990).\n[36] S. Åberg, Nucl. Phys. A 520, 35c (1990).\n[37] H. Nishioka, M. Ohta and S. Okai, Mem. Konan Univ. Sci. Ser.\n38(2), 1 (1991). (unpublished)\n[38] A. G. Magner, I. S. Yatsyshyn, K. Arita, and M. Brack, Phys.\nAtom. Nucl. 74, 1445 (2011).\n\n\f"}