{"id": "http://arxiv.org/abs/1103.3045v2", "guidislink": true, "updated": "2011-11-30T15:33:42Z", "updated_parsed": [2011, 11, 30, 15, 33, 42, 2, 334, 0], "published": "2011-03-15T21:10:24Z", "published_parsed": [2011, 3, 15, 21, 10, 24, 1, 74, 0], "title": "Critical point of $N_f = 3$ QCD from lattice simulations in the\n  canonical ensemble", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1103.2464%2C1103.1536%2C1103.2027%2C1103.4059%2C1103.2159%2C1103.5415%2C1103.3117%2C1103.1506%2C1103.3891%2C1103.4770%2C1103.0293%2C1103.0179%2C1103.0846%2C1103.1944%2C1103.4473%2C1103.4643%2C1103.2810%2C1103.3603%2C1103.2300%2C1103.5936%2C1103.2045%2C1103.3971%2C1103.5560%2C1103.6204%2C1103.2336%2C1103.6186%2C1103.1826%2C1103.2008%2C1103.2102%2C1103.1304%2C1103.0768%2C1103.4087%2C1103.5997%2C1103.3015%2C1103.4023%2C1103.6090%2C1103.3122%2C1103.2211%2C1103.0412%2C1103.5394%2C1103.1957%2C1103.4484%2C1103.3271%2C1103.1933%2C1103.1656%2C1103.4429%2C1103.1941%2C1103.4920%2C1103.5774%2C1103.3714%2C1103.3176%2C1103.2431%2C1103.3220%2C1103.4297%2C1103.4805%2C1103.2740%2C1103.0370%2C1103.6003%2C1103.6023%2C1103.2101%2C1103.1766%2C1103.1521%2C1103.3393%2C1103.3045%2C1103.5126%2C1103.2545%2C1103.6095%2C1103.5531%2C1103.0832%2C1103.3022%2C1103.3854%2C1103.3359%2C1103.4250%2C1103.1917%2C1103.5464%2C1103.0888%2C1103.2356%2C1103.0053%2C1103.4662%2C1103.4778%2C1103.1612%2C1103.1179%2C1103.1907%2C1103.0692%2C1103.2312%2C1103.3870%2C1103.2850%2C1103.1790%2C1103.6194%2C1103.4318%2C1103.0306%2C1103.0881%2C1103.4976%2C1103.5183%2C1103.2341%2C1103.2316%2C1103.0189%2C1103.4298%2C1103.3309%2C1103.0487%2C1103.2566&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Critical point of $N_f = 3$ QCD from lattice simulations in the\n  canonical ensemble"}, "summary": "A canonical ensemble algorithm is employed to study the phase diagram of $N_f\n= 3$ QCD using lattice simulations. We lock in the desired quark number sector\nusing an exact Fourier transform of the fermion determinant. We scan the phase\nspace below $T_c$ and look for an S-shape structure in the chemical potential,\nwhich signals the coexistence phase of a first order phase transition in finite\nvolume. Applying Maxwell construction, we determine the boundaries of the\ncoexistence phase at three temperatures and extrapolate them to locate the\ncritical point. Using an improved gauge action and improved Wilson fermions on\nlattices with a spatial extent of $1.8 \\fm$ and quark masses close to that of\nthe strange, we find the critical point at $T_E = 0.925(5) T_c$ and baryon\nchemical potential $\\mu_B^E = 2.60(8) T_c$.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1103.2464%2C1103.1536%2C1103.2027%2C1103.4059%2C1103.2159%2C1103.5415%2C1103.3117%2C1103.1506%2C1103.3891%2C1103.4770%2C1103.0293%2C1103.0179%2C1103.0846%2C1103.1944%2C1103.4473%2C1103.4643%2C1103.2810%2C1103.3603%2C1103.2300%2C1103.5936%2C1103.2045%2C1103.3971%2C1103.5560%2C1103.6204%2C1103.2336%2C1103.6186%2C1103.1826%2C1103.2008%2C1103.2102%2C1103.1304%2C1103.0768%2C1103.4087%2C1103.5997%2C1103.3015%2C1103.4023%2C1103.6090%2C1103.3122%2C1103.2211%2C1103.0412%2C1103.5394%2C1103.1957%2C1103.4484%2C1103.3271%2C1103.1933%2C1103.1656%2C1103.4429%2C1103.1941%2C1103.4920%2C1103.5774%2C1103.3714%2C1103.3176%2C1103.2431%2C1103.3220%2C1103.4297%2C1103.4805%2C1103.2740%2C1103.0370%2C1103.6003%2C1103.6023%2C1103.2101%2C1103.1766%2C1103.1521%2C1103.3393%2C1103.3045%2C1103.5126%2C1103.2545%2C1103.6095%2C1103.5531%2C1103.0832%2C1103.3022%2C1103.3854%2C1103.3359%2C1103.4250%2C1103.1917%2C1103.5464%2C1103.0888%2C1103.2356%2C1103.0053%2C1103.4662%2C1103.4778%2C1103.1612%2C1103.1179%2C1103.1907%2C1103.0692%2C1103.2312%2C1103.3870%2C1103.2850%2C1103.1790%2C1103.6194%2C1103.4318%2C1103.0306%2C1103.0881%2C1103.4976%2C1103.5183%2C1103.2341%2C1103.2316%2C1103.0189%2C1103.4298%2C1103.3309%2C1103.0487%2C1103.2566&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "A canonical ensemble algorithm is employed to study the phase diagram of $N_f\n= 3$ QCD using lattice simulations. We lock in the desired quark number sector\nusing an exact Fourier transform of the fermion determinant. We scan the phase\nspace below $T_c$ and look for an S-shape structure in the chemical potential,\nwhich signals the coexistence phase of a first order phase transition in finite\nvolume. Applying Maxwell construction, we determine the boundaries of the\ncoexistence phase at three temperatures and extrapolate them to locate the\ncritical point. Using an improved gauge action and improved Wilson fermions on\nlattices with a spatial extent of $1.8 \\fm$ and quark masses close to that of\nthe strange, we find the critical point at $T_E = 0.925(5) T_c$ and baryon\nchemical potential $\\mu_B^E = 2.60(8) T_c$."}, "authors": ["Anyi Li", "Andrei Alexandru", "Keh-Fei Liu"], "author_detail": {"name": "Keh-Fei Liu"}, "author": "Keh-Fei Liu", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1103/PhysRevD.84.071503", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1103.3045v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1103.3045v2", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "5 pages, 7 figures, references added, published version", "arxiv_primary_category": {"term": "hep-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "hep-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "hep-lat", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "nucl-ex", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "nucl-th", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1103.3045v2", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1103.3045v2", "journal_reference": "Phys.Rev. D84 (2011) 071503", "doi": "10.1103/PhysRevD.84.071503", "fulltext": "UK/11-02\n\nCritical point of Nf = 3 QCD from lattice simulations in the canonical ensemble\nAnyi Li(李安意),1, ∗ Andrei Alexandru,2, † and Keh-Fei Liu(刘克非)3, ‡\n(χQCD Collaboration)\n1\n\nDepartment of Physics, Duke University, Durham, North Carolina 27708, USA\nPhysics Department, The George Washington University, Washington DC 20052, USA\n3\nDepartment of Physics and Astronomy, University of Kentucky, Lexington, Kentucky 40506, USA\nA canonical ensemble algorithm is employed to study the phase diagram of Nf = 3 QCD using\nlattice simulations. We lock in the desired quark number sector using an exact Fourier transform of\nthe fermion determinant. We scan the phase space below Tc and look for an S-shape structure in\nthe chemical potential, which signals the coexistence phase of a first order phase transition in finite\nvolume. Applying Maxwell construction, we determine the boundaries of the coexistence phase at\nthree temperatures and extrapolate them to locate the critical point. Using an improved gauge\naction and improved Wilson fermions on lattices with a spatial extent of 1.8 fm and quark masses\nclose to that of the strange, we find the critical point at TE = 0.925(5) Tc and baryon chemical\npotential μE\nB = 2.60(8) Tc .\nPACS numbers: 11.15.Ha, 11.30.Rd\n\nQCD is expected to have a rich phase diagram at finite\ntemperature and finite density. Current lattice calculations have shown that the transition from the hadronic\nphase to QGP phase is a rapid crossover [1, 2]. For large\nbaryon chemical potential and very low temperature, a\nnumber of models suggest that the transition is a first\norder. If this is the case, when the chemical potential\nis lowered and temperature raised, this first order phase\ntransition is expected to end as a second order phase transition point - the critical point. However, lattice QCD\nsimulations with chemical potential are difficult due to\nthe notorious \"sign problem\". The majority of current\nsimulations are focusing on small chemical potential region μq /T \u001c 1 where the \"sign problem\" appears to be\nunder control. Up to now, all the Nf = 3 or 2+1 simulations are based on the grand canonical ensemble (T ,\nμB as parameters) with staggered fermions. The results\nfrom the multi-parameter reweighting [3], Taylor expansion with small μ [4, 5] and the curvature of the critical\nsurface [6] are not settled and need to be cross-checked.\n\nQGP\ncritical point\n\nT\n\nver\nsso\n\ncro\n\narXiv:1103.3045v2 [hep-ph] 30 Nov 2011\n\n2\n\nfirst order\nhadron gas\n\ncolor\n\nvaccum\n\nsuperconductor\n\nμB\nFIG. 1. Conjectured QCD phase diagram\n\n∗\n†\n‡\n\nanyili@phy.duke.edu\naalexan@gwu.edu\nliu@pa.uky.edu\n\nEven the existence of the critical point is in question [6].\nWe employ an algorithm, which is not restricted to small\nchemical potential because of the mitigation of the sign\nproblem under the current parameter settings, to study\nthis problem.\nIn this letter, we adopt an exact Monte Carlo algorithm [7–9] based on the canonical partition function [10–\n15] which is designed to alleviate the determinant fluctuation problems. As it turns out, the sign fluctuations are\nnot serious on the lattices used in the present study, as we\nshall see later. In the canonical ensemble simulations in\nfinite volume, the coexistence phase of a first order phase\ntransition has a characteristic S-shape as a function of\ndensity due to the surface tension. This finite-volume\nproperty has been exploited successfully to identify the\nphase boundaries via the Maxwell construction in studies\nof phase transition with the staggered fermions [14, 15]\nand clover fermions [16] for the Nf = 4 case which is\nknown to have a first order phase transition at μ = 0. In\nthese benchmark studies the boundaries were identified\nat three temperatures below Tc , and they were extrapolated in density and temperature to show that the intersecting point indeed coincides with the independently\nidentified first order transition point at Tc and μ = 0 [16].\nIn view of the success of the Nf = 4 study, we extend this\nmethod to the more realistic Nf = 3 case [17, 18]. Although the real world contains two light quarks and one\nheavier strange quark, the three degenerate flavor case\nhas a similar phase structure. Our primary goal in this\nstudy is to determine whether a first order phase transition exists for Nf = 3 and where the critical point is\nlocated.\nWith the aid of recently developed matrix reduction\ntechnique [19–21], we scan the chemical potential as a\nfunction of baryon number for four temperatures below\nTc which is determined at zero chemical potential, and we\nobserve clear signals for a first order phase transition for\ntemperatures below 0.93 Tc . The phase boundaries of the\ncoexistence phase are determined and then extrapolated\n\n\f2\n\nk\n\nwhere k is the net number of quarks (number of quarks\nminus the number of anti-quarks) and ZC is the canonical\npartition function. Using the fugacity expansion, it can\nbe shown that the canonical partition function can be\nwritten as a Fourier transform of the grand canonical\npartition function,\nZ 2π\n1\ndφ e−ikφ Z(V, T, μ)|μ=iφT , (2)\nZC (V, T, k) =\n2π 0\nupon introducing an imaginary chemical potential μ =\niφT . After integrating out the fermionic part in Eq. (2),\nwe get an expression\nZ\nZC (V, T, k) = DU e−Sg (U ) detk M Nf (U ),\n(3)\nwhere\ndetk M\n\nNf\n\n1\n(U ) ≡\n2π\n\nZ\n\n2π\n\ndφ e−ikφ det M (m, φ; U )Nf ,\n\n0\n\n(4)\nis the projected determinant for the fixed net quark number k. Nf is the number of flavors. We shall use the recently developed matrix reduction technique to compute\nthe projected determinant exactly [19].\nUsing charge conjugation symmetry, one can show that\ndetk M Nf (U ) is real, but not necessarily positive. Due\nto the sign fluctuation, there can potentially be a sign\nproblem at large quark number and low temperature.\nFor more detailed discussion about the properties of the\ncanonical ensemble, we refer the reader to Ref. [16]. To\nsimulate Eq. (3) dynamically, we rewrite canonical partition function as\nZ\nZC (V, T, k) = DU e−Sg (U ) detM Nf (U )W (U )α(U ),(5)\n\nae\n\n0.8\n\n0.6\n\nae ae\nae\n\n0.6\n\nae\n\nae\n\nT\u0090 Tc =0.93H1L\nae ae\n\nae\n\nae ae\n\n0.4\n\nT\u0090 Tc =0.85H1L\n\nae\n\nae ae ae\n\nae\n\nae\n\n<Α>\n\n<Α>\n\nin temperature and density to locate the critical point\nat TE = 0.927(5) Tc and μE\nB = 2.60(8) Tc . Our results\nare based on simulations on 63 × 4 lattices with clover\nfermion action with quark masses which correspond to\nthe pion mass from 750 MeV for the lowest temperature\nto 775 MeV for the highest temperature.\nThe canonical partition function in lattice QCD can be\nderived from the fugacity expansion of the grand canonical partition function,\nX\nZ(V, T, μ) =\nZC (V, T, k)eμk/T ,\n(1)\n\nae\n\n0.4\n0.2\n\nae ae\n\nae\nae\n\nae\n\n0.2\n0\n\n5\n\n10\n\n15\n\nae\n\nae\n\nae\nae\n\nae\n\nae\n\n0\n0\n\n5\n\nnB\n\n10\nnB\n\nae ae\n\nae\nae\n\nae\n\nae ae\n\n15\n\nFIG. 2. Average sign as a function of nB for highest and\nlowest temperatures (0.93 Tc and 0.85 Tc ) used in this study.\nDashed lines represent the phase boundaries of the coexistence phase.\n\nMonte Carol algorithm and then an accept/reject step is\nused for the correct probability. Note the two-step simulation with HMC and accept/reject based on W (U ) reduces the fluctuation problem [8] and accept/reject step\nbased on the exact projected determinant detk M Nf (U )\nensures that the simulation remains in the specific canonical sector with quark number k 6= 0.\nThe lattice spacing and the pion mass are determined\nby using dynamically generated ensembles on 123 lattices\nfor each β. To locate the pseudo critical temperature Tc ,\nwe varied β to look for the peak of the Polyakov loop\nsusceptibility. We run simulations for five different volumes (63 , 83 , 103 , 123 , 163 × 4) and found that the peak of\nthe susceptibility hardly depends on the volume. This is\nconsistent with the finding on large volumes and physical\nquark masses that the finite temperature transition for\nthe Nf = 3 case is a crossover at zero chemical potential [1, 2].\nTo determine the location of the phase transition at\nnon-zero baryon density, we pick four temperatures below Tc (0.85 Tc , 0.87 Tc , 0.90 Tc , 0.93 Tc ) and vary the\nnet quark number from 3 to 54 in steps of 3 (for fractional baryon number the partition function vanishes).\nThis corresponds to the baryon number nB from 1 to 18\nand a density between that of the nuclear matter and 18\ntimes of that. The chemical potential is calculated and\nplotted as a function of the net baryon number nB . In\nthe canonical ensemble, the baryon chemical potential is\ncalculated by taking the difference of the free energy after\nadding one baryon, i.e.\nhμinB =\n\nhγ(U )io\nF (nB + 1) − F (nB )\n1\n= − ln\n(7)\n(nB + 1) − nB\nβ hα(U )io\n\nwhere\nwhere\nγ(U ) =\n\nNf\n\nW (U ) =\n\n| Re detk M (U )|\n,\ndetM Nf (U )\n\nα(U ) = Sign(Re detk M Nf (U )).\n\n(6)\n\nOur strategy to generate an ensemble is to employ\nMetropolis accept/reject method based on the weight\nW (U ) and fold the phase factor α(U ) into the measurements. In short, during the simulation, the candidate configuration is \"proposed\" by the standard Hybrid\n\nRe det3nB +3 M nf (U )\n.\n|Re det3nB M nf (U )|\n\n(8)\n\nis measured in the ensemble with nB baryon number and\nhio in Eq. (7) stands for the average over the ensemble\ngenerated with the measure |Re det3nB M nf (U )|.\nAs a first check, we examine the magnitude of the sign\nfluctuations. The average sign in Eq. (6) appears in the\ndenominator of Eq. (7) and can lead to a sign problem\nwhen its error bars overlap with zero. This quantity is\n\n\f3\n\nae\n\nae\n\nò\n\nò\n\nae\nae\n\n3.0\n\nae\n\n3.6\n3.4\n\n4.4\nae\n4.2 T\u0090Tc =0.85H1L\nae\n4.0\nae ae\n3.8\nae\nò\nae\naeò\n3.6\nae ae\n3.4 ae\nae\n3.2\nae\n6\n8\n10\n12\n14\nnB\n\nT\u0090Tc =0.87H1L\n\n3.8\n\nae\n\nae\n\nae\n\nò\n\nae\n\nae\n\n3.2\n\nΜB \u0090T\n\nT\u0090Tc =0.90H1L\n\n3.2\n3.1\n\nae\n\n4.0\n\nΜB \u0090T\n\nΜB \u0090T\n\n3.3\n\nò\n\nae\n\nae\n\n6\n\n7\n\n8\n\n9\n\nae\n\n3.0\n\n6\n\n8\n\nnB\n\n10\nnB\n\n12\n\nFIG. 3. Maxwell constructions for T = 0.90 Tc , T = 0.87 Tc and T = 0.85 Tc with the horizontal dashed line indicating the\nconstant μf\nB /T and red triangles indicating the mixed phase boundaries at nB1 and nB2 .\n\nplotted in Fig. 2 for the highest and lowest temperatures.\nWe see that all of them are more than 3σ above zero.\nThis result is better than the previous ones based on the\nwinding number expansion method [16, 18], presumably\ndue to the adoption of the exact projection of the determinant [19]. Thus, we believe that the sign fluctuations\nare not a problem for this study.\nWe would like to point out the difference between the\nphase diagram in the grand canonical ensemble and the\none in the canonical ensemble. We plot the expected\ncanonical ensemble phase diagram in Fig. 4 in contrast\nto that in the grand canonical ensemble in Fig. 1. The\nfirst order phase transition line in the grand canonical\nT − μ diagram becomes a phase coexistence region in the\nT - ρ diagram of the canonical ensemble, which has two\nboundaries that separate it from the pure phases. The\ntwo boundaries will eventually meet at one point. This\npoint is the critical point at nonzero baryon chemical\npotential.\nOnce one enters the coexistence region in a finite volume, the contribution from the surface tension causes the\nappearance of a \"double-well\" in the effective free energy\nwhose derivative with respect to density leads to an Sshaped behavior in the chemical potential versus baryon\nnumber plot [22]. However, in the thermodynamic limit,\nthe surface tension contribution goes away since it is a\nsurface term while the free energy scales with the volume; the chemical potential will then stay constant in\n\nthe coexistence phase region. The behavior of the baryon\nchemical potential in the thermodynamic limit is shown\nas an inset in Fig. 4. ρ1 and ρ2 mark the lower and upper\nboundaries of the coexistence phase at a given temperature below Tc .\nOur results for the baryon chemical potential are presented in Fig. 5 for four different temperatures below\nTc . Statistical errors are estimated from the jackknife\nmethod. It is clear that the chemical potential exhibits\nan \"S-shaped\" wiggle for nB between 6 and 14. To identify the boundaries of the mixed-phase region and the\ncoexistence baryon chemical potential, we rely on the\nMaxwell construction: the coexistence chemical potential μf\nB is the one that produces equal areas between the\ncurve of the chemical potential μB as a function of nB\nand the constant μf\nB line which intersects with μB at nB1\nand nB2 . This procedure was used in studies with staggered fermions [14, 15] and Wilson-clover fermions [16]\nin this context for the Nf = 4 case.\nWe carried out the Maxwell constructions for the three\ntemperatures at 0.85 Tc , 0.87 Tc and 0.90 Tc . We could\nnot do it for the 0.93 Tc case, as the wiggle there, if\npresent, is not statistically significant. The results are\npresented in Fig. 3. Having determined nB1 and nB2 for\nthree temperatures, we plot the boundaries of the coexistence region and perform an extrapolation in nB and T\n5\n\n5\n\ncritical point\n\nae ae\n\n2\nae\n\n1\nρ1\n\nT\n\nρ\n\nae\n\nT\u0090Tc =0.93H1L\n\nae ae\n\n4\n\nae\n\nae\nae ae ae\n\n3\nae\n\n2\n\nae\n\nae\n\n5\n\n10\n\n1\n0\n\n15\n\nρ1\n\nρ2\n\nρ\n\n4\n3\nae\n\n2\n\nae\n\nae ae\n\nae\n\nae ae\nae\n\nae\n\nae\n\nae ae\n\nae\n\nT\u0090Tc =0.87H1L\n\nae\n\nae\n\nae ae\n\nT\u0090Tc =0.90H1L\n\n5\n\n10\nnB\n\n4\n\n10\nnB\n\n15\n\nae\n\n3\nae\n\n2\n5\n\n15\n\n5\n\nae\n\n1\n0\n\nFIG. 4. Schematic plot illustrating the scanning we use to locate the boundaries of the mixed phase for QCD with Nf = 3.\nThe infinite volume expectation for chemical potential as a\nfunction of density is shown in the inset.\n\nae ae\n\nΜ B \u0090T\n\nΜ B \u0090T\n\n5\n\ncoexistence\n\nae\n\nae ae\n\nae\n\nnB\n\nhadron\n\nae\n\nae\nae ae\n\nae\n\nae\n\n0\n\nρ2\n\nae ae\n\nae\n\nae ae ae\n\nΜ B \u0090T\n\nae\nae ae ae\n\n3\n\nμB\n\nΜ B \u0090T\n\n4\n\n0\n\nae\n\nae\n\nae\n\nae\n\nae ae\n\nae ae ae ae\n\nae\n\nae ae\n\nae ae\n\nT\u0090Tc =0.85H1L\n\nae\n\n5\n\n10\nnB\n\n15\n\nFIG. 5. Phase scan for temperatures 0.85 Tc , 0.87 Tc , 0.90 Tc\nand 0.93 Tc .\n\n\f4\n\nT E \u0090Tc =0.927H5L\n\nto locate the intersection of the two boundaries. To determine the crossing point, we perform a simultaneous fit\nof the boundary lines using a even polynomial in baryon\ndensity. We use an even polynomial since ZC is an even\nfunction of k. The phase boundaries and their extrapolations are plotted in Fig. 6. We find the intersection\nE\npoint at TE (nE\nB )/Tc = 0.927(5) and nB = 5.7(3).\nUsing the coexistence chemical potential, one can map\nout the phase diagram in the grand canonical ensemble\nas shown in Fig. 7. Note that, the region of coexistence\nphase becomes a curved transition line separating two the\nphases as we expected. In this way, we locate the critical\npoint in the grand canonical ensemble at critical temperature TE /Tc = 0.927(5) and baryon chemical potential\nμE\nB /Tc = 2.60(8). Using the lattice spacing a ≈ 0.3 fm in\n\nour simulation, we convert its location in physical units\nto be TE ≈ 157 MeV and μE\nB ≈ 441 MeV.\nIn conclusion, we have applied a canonical ensemble algorithm previously tested on the Nf = 4 to the\nmore relevant Nf = 3 case and located the first order\nphase transition as signaled by the S-shape structure\nin the μ − nB plane for several temperatures below Tc .\nThe Maxwell construction was employed to identify the\nboundaries of the coexistence phase and we extrapolated\nthem to locate the critical point at TE = 0.925(5) Tc\nand μE\nB = 2.60(8) Tc . We should point out that the\npresent work is carried out on a relatively small volume\nwith spatial extent of ∼ 1.8 fm and for three degenerate quark flavors with their masses similar to that of the\nstrange quark. Quark mass for this system acts like the\nmagnetic field for spin systems which weakens the phase\ntransition. Since the μ = 0 finite temperature transition\nis first order for massless quarks [23] and the present\ncritical point is at a relatively large μE\nB for quark masses\naround the strange, one expects that the critical point for\nthe more realistic 2 + 1 flavor case with light u/d quarks\nto be somewhere in between. This expectation is based\non the assumption that there is a critical surface which\ngrows continuously from the critical line at μ = 0 into finite μ. The critical line is the one that separates the first\norder phase transition region at some finite temperature\nwith small quark masses and the crossover region with\nintermediate masses (including the physical ones) on the\nμ = 0 plane of the Columbia plot. This assumption is\nchallenged by recent studies of the critical surface near\nthe critical line (See Fig.1 in references [6, 24]) which\nsuggest that the first order region shrinks with increasing chemical potential and, therefore, there might not be\na critical point for physical quark masses. To address\nthis issue, future simulations will study the quark mass\ndependence of the critical point and the existence of the\ncritical point needs to be checked on lattices with higher\ncutoffs and larger volumes.\nThis work is partially supported by DOE grants\nDE-FG05-84ER40154, DE-FG02-05ER41368 and DEFG02-95ER-40907. We wish to thank P. de Forcrand,\nA. Kennedy and S. Chandrasekharan for useful discussions.\n\n[1] Y. Aoki et al., JHEP 06, 088 (2009), arXiv:0903.4155\n[hep-lat].\n[2] F. Karsch (RBC), J. Phys. G35, 104096 (2008),\narXiv:0804.4148 [hep-lat].\n[3] Z. Fodor and S. Katz, JHEP 0404, 050 (2004),\narXiv:hep-lat/0402006 [hep-lat].\n[4] C. Allton et al., Phys.Rev. D71, 054508 (2005),\narXiv:hep-lat/0501030 [hep-lat].\n[5] R. Gavai and S. Gupta, Phys.Rev. D78, 114503 (2008),\narXiv:0806.2233 [hep-lat].\n[6] P. de Forcrand and O. Philipsen, JHEP 11, 012 (2008),\narXiv:0808.1096 [hep-lat].\n\n[7] K.-F. Liu, Edinburgh 2003, QCD and numerical analysis\nIII (Springer-Verlag), 101(2005), arXiv:hep-lat/0312027.\n[8] A. Alexandru, M. Faber, I. Horvath, and K.-F. Liu, Phys.\nRev. D72, 114513 (2005), arXiv:hep-lat/0507020.\n[9] A. Alexandru, A. Li, and K.-F. Liu, PoS LAT2007, 167\n(2007), arXiv:0711.2678 [hep-lat].\n[10] J. Engels et al., Nucl. Phys. B558, 307 (1999), arXiv:heplat/9903030.\n[11] K. F. Liu, Chin. J. Phys. 38, 605 (2000).\n[12] K.-F. Liu, Int. J. Mod. Phys. B16, 2017 (2002),\narXiv:hep-lat/0202026.\n[13] V. Azcoiti et al., JHEP 12, 010 (2004), arXiv:hep-\n\nT\u0090Tc\n\n0.95\n\n÷\n\nae\n\n0.90\n\nae\nae\n\n0.85\n0.80\n\nà\n\n6\n\nà\nà\n8\n\n10 12\nnB\n\n14\n\n16\n\nFIG. 6. Phase boundaries in the canonical ensemble.\n\nT\u0090Tc\n\n0.95\n0.90\n\n÷\n\nT E \u0090Tc =0.927H5L\nae\n\nΜ EB \u0090Tc =2.60H8L\nae\n\n0.85\n0.80\n\nae\n3.0\n\n3.5\nΜB \u0090T\n\n4.0\n\nFIG. 7. Phase transition line in the T , μ plane.\n\n\f5\nlat/0409157.\n[14] P. de Forcrand and S. Kratochvila, Nucl. Phys. Proc.\nSuppl. 153, 62 (2006), arXiv:hep-lat/0602024.\n[15] S. Kratochvila and P. de Forcrand, PoS LAT2005, 167\n(2006), arXiv:hep-lat/0509143.\n[16] A. Li, A. Alexandru, K.-F. Liu, and X. Meng, Phys. Rev.\nD82, 054502 (2010), arXiv:1005.4158 [hep-lat].\n[17] A. Li, A. Alexandru, X. Meng, and K.-F. Liu (chi QCD),\nNucl. Phys. A830, 633c (2009), arXiv:0908.1155 [heplat].\n[18] A. Li, PoS LAT2009, 011 (2009), arXiv:1002.4459 [heplat].\n\n[19] A. Alexandru and U. Wenger, Phys. Rev. D83, 034502\n(2011), arXiv:1009.2197 [hep-lat].\n[20] K. Nagata and A. Nakamura, Phys. Rev. D82, 094027\n(2010), arXiv:1009.2149 [hep-lat].\n[21] C. Gattringer and L. Liptak, Phys. Lett. B697, 85\n(2011), arXiv:0906.1088 [hep-lat].\n[22] S. Ejiri, Phys. Rev. D78, 074507 (2008), arXiv:0804.3227\n[hep-lat].\n[23] R. D. Pisarski and F. Wilczek, Phys. Rev. D29, 338\n(1984).\n[24] P. de Forcrand and O. Philipsen, PoS LATTICE2008,\n208 (2008), arXiv:0811.3858 [hep-lat].\n\n\f"}