{"id": "http://arxiv.org/abs/0709.0872v1", "guidislink": true, "updated": "2007-09-06T14:33:31Z", "updated_parsed": [2007, 9, 6, 14, 33, 31, 3, 249, 0], "published": "2007-09-06T14:33:31Z", "published_parsed": [2007, 9, 6, 14, 33, 31, 3, 249, 0], "title": "Cosmological vector modes and quantum gravity effects", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0709.1846%2C0709.2518%2C0709.4011%2C0709.0008%2C0709.4626%2C0709.1181%2C0709.1530%2C0709.1156%2C0709.1865%2C0709.1590%2C0709.2533%2C0709.2789%2C0709.2806%2C0709.1558%2C0709.1464%2C0709.0830%2C0709.3808%2C0709.4579%2C0709.4372%2C0709.4054%2C0709.4110%2C0709.0153%2C0709.3851%2C0709.2491%2C0709.3781%2C0709.4126%2C0709.4538%2C0709.3323%2C0709.4030%2C0709.2652%2C0709.3396%2C0709.3004%2C0709.2586%2C0709.4191%2C0709.3479%2C0709.1164%2C0709.1528%2C0709.2679%2C0709.3357%2C0709.1000%2C0709.2760%2C0709.3351%2C0709.0916%2C0709.3671%2C0709.2310%2C0709.3244%2C0709.1555%2C0709.4081%2C0709.3929%2C0709.4340%2C0709.0175%2C0709.0095%2C0709.0563%2C0709.3388%2C0709.0882%2C0709.4558%2C0709.3715%2C0709.4468%2C0709.0400%2C0709.1840%2C0709.1284%2C0709.3348%2C0709.3075%2C0709.2994%2C0709.4091%2C0709.4297%2C0709.2867%2C0709.0093%2C0709.1737%2C0709.0350%2C0709.4563%2C0709.4092%2C0709.2263%2C0709.3032%2C0709.3480%2C0709.0822%2C0709.3615%2C0709.0727%2C0709.0932%2C0709.3588%2C0709.1281%2C0709.3170%2C0709.0283%2C0709.3931%2C0709.1609%2C0709.4076%2C0709.2674%2C0709.1960%2C0709.0304%2C0709.1220%2C0709.4534%2C0709.2445%2C0709.2489%2C0709.3262%2C0709.3381%2C0709.0872%2C0709.4002%2C0709.4359%2C0709.3090%2C0709.0986%2C0709.1334&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Cosmological vector modes and quantum gravity effects"}, "summary": "In contrast to scalar and tensor modes, vector modes of linear perturbations\naround an expanding Friedmann--Robertson--Walker universe decay. This makes\nthem largely irrelevant for late time cosmology, assuming that all modes\nstarted out at a similar magnitude at some early stage. By now, however,\nbouncing models are frequently considered which exhibit a collapsing phase.\nBefore this phase reaches a minimum size and re-expands, vector modes grow.\nSuch modes are thus relevant for the bounce and may even signal the breakdown\nof perturbation theory if the growth is too strong. Here, a gauge invariant\nformulation of vector mode perturbations in Hamiltonian cosmology is presented.\nThis lays out a framework for studying possible canonical quantum gravity\neffects, such as those of loop quantum gravity, at an effective level. As an\nexplicit example, typical quantum corrections, namely those coming from inverse\ndensitized triad components and holonomies, are shown to increase the growth\nrate of vector perturbations in the contracting phase, but only slightly.\nEffects at the bounce of the background geometry can, however, be much\nstronger.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0709.1846%2C0709.2518%2C0709.4011%2C0709.0008%2C0709.4626%2C0709.1181%2C0709.1530%2C0709.1156%2C0709.1865%2C0709.1590%2C0709.2533%2C0709.2789%2C0709.2806%2C0709.1558%2C0709.1464%2C0709.0830%2C0709.3808%2C0709.4579%2C0709.4372%2C0709.4054%2C0709.4110%2C0709.0153%2C0709.3851%2C0709.2491%2C0709.3781%2C0709.4126%2C0709.4538%2C0709.3323%2C0709.4030%2C0709.2652%2C0709.3396%2C0709.3004%2C0709.2586%2C0709.4191%2C0709.3479%2C0709.1164%2C0709.1528%2C0709.2679%2C0709.3357%2C0709.1000%2C0709.2760%2C0709.3351%2C0709.0916%2C0709.3671%2C0709.2310%2C0709.3244%2C0709.1555%2C0709.4081%2C0709.3929%2C0709.4340%2C0709.0175%2C0709.0095%2C0709.0563%2C0709.3388%2C0709.0882%2C0709.4558%2C0709.3715%2C0709.4468%2C0709.0400%2C0709.1840%2C0709.1284%2C0709.3348%2C0709.3075%2C0709.2994%2C0709.4091%2C0709.4297%2C0709.2867%2C0709.0093%2C0709.1737%2C0709.0350%2C0709.4563%2C0709.4092%2C0709.2263%2C0709.3032%2C0709.3480%2C0709.0822%2C0709.3615%2C0709.0727%2C0709.0932%2C0709.3588%2C0709.1281%2C0709.3170%2C0709.0283%2C0709.3931%2C0709.1609%2C0709.4076%2C0709.2674%2C0709.1960%2C0709.0304%2C0709.1220%2C0709.4534%2C0709.2445%2C0709.2489%2C0709.3262%2C0709.3381%2C0709.0872%2C0709.4002%2C0709.4359%2C0709.3090%2C0709.0986%2C0709.1334&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "In contrast to scalar and tensor modes, vector modes of linear perturbations\naround an expanding Friedmann--Robertson--Walker universe decay. This makes\nthem largely irrelevant for late time cosmology, assuming that all modes\nstarted out at a similar magnitude at some early stage. By now, however,\nbouncing models are frequently considered which exhibit a collapsing phase.\nBefore this phase reaches a minimum size and re-expands, vector modes grow.\nSuch modes are thus relevant for the bounce and may even signal the breakdown\nof perturbation theory if the growth is too strong. Here, a gauge invariant\nformulation of vector mode perturbations in Hamiltonian cosmology is presented.\nThis lays out a framework for studying possible canonical quantum gravity\neffects, such as those of loop quantum gravity, at an effective level. As an\nexplicit example, typical quantum corrections, namely those coming from inverse\ndensitized triad components and holonomies, are shown to increase the growth\nrate of vector perturbations in the contracting phase, but only slightly.\nEffects at the bounce of the background geometry can, however, be much\nstronger."}, "authors": ["Martin Bojowald", "Golam Mortuza Hossain"], "author_detail": {"name": "Golam Mortuza Hossain"}, "author": "Golam Mortuza Hossain", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1088/0264-9381/24/18/015", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/0709.0872v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0709.0872v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "20 pages", "arxiv_primary_category": {"term": "gr-qc", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "gr-qc", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "hep-th", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0709.0872v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0709.0872v1", "journal_reference": "Class.Quant.Grav.24:4801-4816,2007", "doi": "10.1088/0264-9381/24/18/015", "fulltext": "IGPG–07/6–5\n\nCosmological vector modes and quantum gravity effects\narXiv:0709.0872v1 [gr-qc] 6 Sep 2007\n\nMartin Bojowald∗ and Golam Mortuza Hossain†\nInstitute for Gravitation and the Cosmos,\nThe Pennsylvania State University,\n104 Davey Lab, University Park, PA 16802, USA\n\nAbstract\nIn contrast to scalar and tensor modes, vector modes of linear perturbations\naround an expanding Friedmann–Robertson–Walker universe decay. This makes\nthem largely irrelevant for late time cosmology, assuming that all modes started\nout at a similar magnitude at some early stage. By now, however, bouncing models\nare frequently considered which exhibit a collapsing phase. Before this phase reaches\na minimum size and re-expands, vector modes grow. Such modes are thus relevant\nfor the bounce and may even signal the breakdown of perturbation theory if the\ngrowth is too strong. Here, a gauge invariant formulation of vector mode perturbations in Hamiltonian cosmology is presented. This lays out a framework for studying\npossible canonical quantum gravity effects, such as those of loop quantum gravity,\nat an effective level. As an explicit example, typical quantum corrections, namely\nthose coming from inverse densitized triad components and holonomies, are shown to\nincrease the growth rate of vector perturbations in the contracting phase, but only\nslightly. Effects at the bounce of the background geometry can, however, be much\nstronger.\n\n1\n\nIntroduction\n\nLinear perturbations on isotropic expanding or contracting geometries can be split in different types according to their transformation properties under spatial rotations: scalar,\nvector and tensor modes. In general, this presents a convenient decomposition of general\nperturbations into different classes. But it acquires a more important role for the linearized\nEinstein's equation where the different modes decouple. Moreover, linearized gauge transformations corresponding to changes of space-time coordinates do not mix the modes which\ncan thus be analyzed separately. In this article we focus on the vector mode and possible\nquantum effects in its evolution.\nVector mode perturbations in classical cosmology decay in an expanding universe, and\ndynamically become of less interest as the universe continues its expansion. Accordingly,\n∗\n†\n\ne-mail address: bojowald@gravity.psu.edu\ne-mail address: hossain@gravity.psu.edu\n\n1\n\n\fvector modes are often ignored. This feature holds true for expanding cosmologies which\nstart from a big bang or emerge from a quantum state if one assumes all modes to be of\ncomparable initial magnitude. However, this assumption has to be justified. One possibility\nis to use bouncing models where the pre-history before the big bang is described by a\ncollapsing phase. Then, vector perturbations can lead to significant problems because\ngauge invariant measures of vector perturbations grow. Their current size relative to that\nof scalar and tensor modes then depends on where equal sizes or other initial conditions\nare assumed. Moreover, vector modes are generated by higher order perturbations and\nsubsequently grow in a contracting phase [1]. They can thus not be ignored altogether.\nThere are several models such as string inspired pre-big bang scenarios [2, 3] or cyclic\nand ekpyrotic models [4, 5], or some models of loop quantum cosmology [6, 7] which exhibit\na bounce. Such scenarios for an avoidance of the big bang singularity are developed mainly\nbased on homogeneous models of cosmology. On the other hand, the growth of vector\nperturbations in the contracting phase indicates a possible violation of the homogeneity\nassumption when the bounce is approached as indicated by the breakdown of classical\nperturbation theory. Thus, the growth of vector perturbations not only raises questions\nregarding the validity of an homogeneity assumption but may even question the phenomena\nof the bounce itself. 1\nIn this paper, we derive the vector mode dynamics in the context of cosmological models based on loop quantum gravity [11, 12, 13] and cosmology [14]. Firstly, we present a\nsystematic derivation of classical vector perturbation equations using a canonical formulation in Ashtekar variables [15, 16]. We compute the gauge transformations property for\nthe vector perturbations and then construct the corresponding gauge invariant variable.\nAll this is done in a purely canonical way to outline the general procedure followed also in\nthe presence of quantum corrections.\nIn the following section we study possible effects of quantum corrections expected from\nloop quantum gravity. We compute requirements on quantum correction functions from\nanomaly cancellation in the quantum corrected constraint algebra. These expressions include inhomogeneities in such a way that all symmetries of a Friedmann–Robertson–Walker\nbackground are broken. Thus, we are not dealing with a mini-superspace quantization even\nthough inhomogeneities are restricted to the perturbative vector mode. How individual\nterms of effective constraints are related to operators in the full theory is described in [17].\nWe study the effects of quantum correction arising for inverse densitized triads in detail,\nand perform corresponding calculations for corrections from holonomies in a subsequent\nsection. While current methods are not sufficient to compute full correction functions for\nall gauges, it turns out that the remaining freedom is constrained by requiring the absence\nof anomalies as a consistency condition. This provides evidence, at the effective level employed here, that anomaly cancellation will restrict possible quantization choices of the full\n1\n\nBased on matching conditions, an evolution of vector modes through a bounce has been studied,\ne.g., in [8, 9], assuming certain forms of a non-singular bouncing background geometry. This does not\naddress the validity of a perturbativity assumption. Vector modes have occasionally been considered in\ninflationary scenarios such as in [10]. Since this happens in an expanding phase, vector modes decay and\ndo not challenge the perturbativity assumption either.\n\n2\n\n\ftheory. (See [18, 19] for analogous statements based on different principles.) Moreover, we\ndemonstrate explicitly that anomaly-free set of constraints, and thus a covariant effective\nspace-time picture, is possible even in the presence of non-trivial quantum corrections. As\none application, we show that in perturbative regimes (not close to a bounce) quantum\ncorrections make the growth rate of the vector mode in a contracting universe slightly\nstronger compared to the classical behavior.\n\n2\n\nCanonical formulation\n\nIn this paper, we study the vector mode of linear metric perturbations around spatially flat\nFriedmann-Robertson-Walker (FRW) spacetimes. The procedure we use is analogous to\nthat for scalar modes [20], although specifics certainly change when vector modes are considered. The general form of the perturbed metric around the FRW background containing\nonly the vector mode is given by\ng00 = −a2\n\n,\n\ng0a = a2 Sa\n\ngab = a2 [δab + Fa,b + Fb,a ] .\n\n,\n\n(1)\n\nThe perturbation fields F a and S a satisfy F a ,a = 0 and S a ,a = 0 to separate them from\nscalar gradient terms. In other words these divergence free fields describe the vorticity of\nmetric perturbations. An index 0 refers to conformal time η, while a, b, . . . refer to comoving spatial coordinates. In a canonical formulation, the distance element is expressed\nin terms of the spatial metric qab , the lapse function N and the shift vector N a , related to\nthe spacetime metric through\ng00 = −N 2 + qab N a N b\n\n,\n\ng0a = qab N b\n\n,\n\ngab = qab .\n\n(2)\n\nBy comparing expression (1) for a perturbed spacetime metric to the relation (2), one\ncan see that in canonical formulations the vector perturbation is generated through the\nperturbations of the shift vector N a and off-diagonal components of the spatial metric\nqab . In particular, the lapse function, being scalar, does not contribute to vector mode\ndynamics.\n\n2.1\n\nBackground\n\nIn canonical gravity, the spatial metric qab plays the role of a configuration variable with\nmomenta related to extrinsic curvature\nKab =\n\n\u0001\n1\nq̇ab − 2D(a Nb)\n2N\n\n(3)\n\nin terms of a spatial covariant derivative Da . The lapse function N and shift vector N a\ndo not have momenta and are not dynamical since they do not appear as time derivatives\nin the action. They rather play the role of multipliers to constraints which will be written\nexplicitly below for the vector mode.\n3\n\n\fHowever, in view of including quantum gravity effects we do not use metric variables\nbut connection variables which follow after a canonical transformation and provide the\nbasis for a loop quantization of gravity [21]. In these Ashtekar variables [15, 16] one uses\na densitized triad Eia instead of the spatial metric, defined as\nEia := | det(eia )|eai\n\n(4)\n\nin terms of the co-triad eia and its inverse eai which in turn are defined via the spatial\nmetric as qab =: eia eib . The canonically conjugate variable to the densitized triad is the\nAshtekar connection Aia := Γia + γKai , where Kai is extrinsic curvature and γ > 0 is the socalled Barbero-Immirzi parameter [16, 22]. The spin connection Γia by definition satisfies\nDa eai = 0 which can be solved as\nΓia = −ǫijk ebj (∂[a ekb] + 21 eck ela ∂[c elb] )\n\n(5)\n\nAs mentioned, we perturb basic variables around a spatially-flat FRW background. Further, we denote background variables with a bar as in\n√\nĒia = p̄δia , Γ̄ia = 0 , K̄ai = k̄δai , N̄ = p̄ , N̄ a = 0 ,\n(6)\nwhere p̄ = a2 and the spatial metric is q̄ab = a2 δab . (In general, p̄ as a triad rather than\nmetric component could be negative, which however we can safely ignore here.) The choice\nof N̄ = a leads to conformal time. One may emphasize here that for a spatially flat FRW\nspacetime the background spin connection Γ̄ia vanishes, thus Āia = γ K̄ai = γ k̄δai . Moreover,\nk̄ = da/dη = ȧ/a in conformal time.\n\n2.2\n\nPerturbed canonical variables\n\nThe perturbed densitized triad and Ashtekar connection around a spatially flat FRW background are given by\nEia = p̄δia + δEia\n\n,\n\nAia = Γia + γKai = γ k̄δai + (δΓia + γδKai ) ,\n\n(7)\n\nwhere p̄ and γ k̄ are the background densitized triad and Ashtekar connection. At the linear\nlevel, the general solution for the co-triad corresponding to qab = a2 (δab + Fa ,b +Fb ,a ) as in\nequation (1) is\n\u0002\n\u0003\neia = a δai + (c1 Fa ,i + c2 F i ,a ) ,\n(8)\n\nwhere c1 + c2 = 1. Specific values of c1 and c2 are part of the gauge choice of the triad as a\nset of three vector fields in arbitrary rotation. Using definition (4) for the densitized triad\none can easily compute the expression of the perturbed densitized triad for vector mode\nδEia = −p̄(c1 Fi ,a + c2 F a ,i ) ,\n\n(9)\n\nwhere we have used the divergence free property, i.e. δai δEia = 0, for vector mode perturbations; thus no linear term results from the determinant used in defining the densitized\n4\n\n\ftriad. By comparing the perturbed spacetime metric from expression (1) with the relation\n(2), one can read off the expression for the perturbed lapse function and shift vector\nδN a = S a .\n\nδN = 0 ,\n\n(10)\n\nUsing the spin connection (5) and the general expression of the perturbed densitized triad\nin (7), the linearized spin connection is given by\n1\nδΓia = ǫije δac ∂e δEjc .\np̄\n\n2.3\n\n(11)\n\nCanonical structure of linearized vector modes\n\nIn a canonical formulation, the Einstein-Hilbert action can be written equivalently (up to\nboundary terms) using the Ashtekar connection and densitized triad as\n\u0014\n\u0015\nZ\nZ\n\u0002 i\n\u0003\n1\n3\na\ni\na\nSEH = dt d x\n,\n(12)\nE Lt Aa − Λ Gi + N Ca + NC\n8πGγ i\nΣ\n\nwhere Λi , N a and N are Lagrange multipliers of the Gauss, diffeomorphism and Hamiltonian constraints, explicit expressions of which are written below. Before decomposing the\nsymplectic structure according to (7), we introduce a cell to render the homogeneous mode\nwell-defined. Integrating the first term of (12) only over a finite box of coordinate volume\nV0 with perturbed basic variables of the form (7), we obtain the symplectic structure given\nby the Poisson brackets of the background and perturbed variables as\n{k̄, p̄} =\n\n8πG\n3V0\n\n,\n\n{δKai (x), δEjb (y)} = 8πGδ 3 (x, y)δab δji .\n\n(13)\n\nIn deriving these relation, we have used the properties that for vector perturbations\nδai δEia = δia δKai = 0. This provides separate canonical structures for the background\nand perturbations, but these variables will be coupled dynamically. In particular, the homogeneous background is dynamical and would receive back-reaction effects at higher than\nlinear orders.\n2.3.1\n\nGauss constraint\n\nIn triad variables, a Gauss constraint appears which generates internal gauge rotations of\nphase space functions because triads whose legs are rotated at a fixed point correspond to\nthe same spatial metric. This constraint is given by\nZ\nZ\n\u0001\n1\n3\ni\nG(Λ) :=\nd xΛ Gi =\nd3 xΛi ∂a Eia + ǫij k Aja Eka .\n(14)\n8πGγ Σ\nΣ\n\nUsing the perturbed form of basic variables (7), it can be reduced to\nZ\n\u0001\n1\nd3 xΛi ǫij a p̄δKaj + ǫia k k̄δEka .\nG(Λ) =\n8πG Σ\n5\n\n(15)\n\n\fSince we are working with a background Eia = p̄δia whose gauge freedom is fixed, the\nmultiplier Λi is already of first order. To derive the expression (15), we have used the\ndefinition of the spin connection Γia in terms of the densitized triad Eia , which reduces to\n(11) for the linearized equations. Internal gauge rotations of phase space functions are\nparametrized by the Lagrange multiplier Λi through δΛ f = {f, G[Λ]}. In particular, the\ninternal gauge rotations of perturbed basic variables are\nδΛ (δKai ) := {δKai , G(Λ)} = k̄Λl ǫla i\n\n,\n\nδΛ (δEia ) := {δEia , G(Λ)} = −p̄Λl ǫli a .\n\n(16)\n\nClearly, the perturbed variables themselves are not invariant under internal gauge rotations\nin spite of the fixed background. However, one may notice already that the symmetrized\nperturbed variables are in fact invariant under internal gauge rotations. Thus, the physical\nquantities must depend only on the symmetrized form of the perturbed basic variables.\nThen, the constants c1 and c2 in (9) are irrelevant since\n1\nE(i a) = − p̄(Fi , a + F a ,i ) .\n2\n2.3.2\n\nDiffeomorphism constraint\n\nThe diffeomorphism constraint generates gauge transformations corresponding to spatial\ncoordinate transformations of phase space functions. Its general contribution from gravitational variables is given by\nZ\nZ\n\u0002 i b\n\u0003\n1\na\n3\na\nd3 xN a Fab\nEi − Aia Gi\n(17)\nDG [N ] :=\nd xN Ca =\n8πGγ Σ\nΣ\n(where the subscript \"G\" stands for \"gravity\" to separate the term from the matter contribution. In general, a matter field would also contribute a term Dm to the diffeomorphism\nconstraint, which we leave unspecified here and relate later to the stress-energy tensor.)\nThe second term vanishes by virtue of the Gauss constraint, but is necessary to generate\ndiffeomorphisms in the form of Lie derivatives of phase space functions along the shift\nvector. Using the expression of the perturbed basic variables (7), one can reduce the\ndiffeomorphism constraint to\nZ\n\u0002\n\u0003\n1\na\nDG [N ] =\nd3 xδN c −p̄(∂k δKck ) − k̄δck (∂d δEkd ) .\n(18)\n8πG Σ\n\nHere, we have kept up to quadratic terms in the perturbations, noting N̄ a = 0.\n2.3.3\n\nHamiltonian constraint\n\nIn a canonical formulation, the Hamiltonian constraint generates 'time evolution' of the\nspatial manifold for phase space functions satisfying the equations of motion. Its gravitational contribution in Ashtekar variables is\nZ\n\u0011\nEjc Ekd \u0010 jk i\n1\nj\n2\nk\n3\np\nHG [N] =\nǫ\nF\n−\n2(1\n+\nγ\n)K\nK\n.\n(19)\nd xN\ni\ncd\n[c d]\n16πG Σ\n|det E|\n6\n\n\fi\nUsing the general perturbed forms of basic variables and the expression of curvature Fab\n=\ni\ni\ni\nj k\n∂a Ab − ∂b Aa + ǫ jk Aa Ab , one can simplify (19). Up to quadratic terms it is given by\n\u0014\nZ\n√\nk̄ 2\n1\n3\nd xN̄ −6k̄ 2 p̄ − 3 (δEjc δEkd δck δdj )\nHG [N] =\n16πG Σ\n2p̄ 2\n\u0015\n√\n2k̄\nc\nj\nj\nk c d\n(20)\n+ p̄(δKc δKd δk δj ) − √ (δEj δKc )\np̄\n\nwith δN = 0 for vector modes. We may mention here that γ dependent terms drop out of\nthe Hamiltonian constraint once the spin connection, the generic form (9) of the densitized\ntriad and the extrinsic curvature are used. Again, there is a matter contribution Hm left\nunspecified here.\n\n2.4\n\nGauge transformations and gauge invariant variables\n\nGeneral gauge transformations are determined by a choice of N and N a , which gives rise to\nall space-time coordinate transformations. For the vector mode, only the choice N a = ξ a\nwith ξ a ,a = 0 is relevant since the remaining functions N or Na = ξ,a would affect only the\nscalar mode. Thus, transformations of interest here are generated only by diffeomorphism\nconstraint in a form parametrized by the shift vector as δξ f = {f, DG [N a = ξ a ]}. We\nneed to consider this only to linear order, using the linearized constraints. The resulting\ntransformation for basic variables will then be used to find gauge invariant combinations.\nAlternatively, a canonical formulation allows one to compute gauge invariant observables\nfirst, and then linearize [23, 24].\nUnder such a gauge transformation, the perturbed densitized triad and extrinsic curvature transform as\nδξ (δEia ) = −p̄∂i ξ a , δξ (δKai ) = k̄∂a ξ i .\n(21)\nRelating δEia to δF a and δKai to δS a based on (3) leads to gauge transformations for the\nvector mode functions F a and S a :\nδξ F a = ξ a\n\n,\n\nδξ S a = ξ ̇a\n\n,\n\nδξ σ a = δξ (S a − Ḟ a ) = 0\n\n(22)\n\nintroducing σ a := S a − Ḟ a as a gauge invariant variable for the gravitational vector mode.\n\n2.5\n\nLinearized equations of motion\n\nGeneral equations of motion are written canonically as\nf ̇ = {f, H}\n\n(23)\n\nfor any phase space function f using the total Hamiltonian H. For gravity, H = HG [N] +\nDG [N c ] + Hm [N] + Dm [N c ] with the gravitational contributions HG and DG and matter\ncontributions Hm and Dm to the Hamiltonian and diffeomorphism constraints. Equations\n7\n\n\fof motion refer to coordinate time, with derivatives being indicated by the dot. The form\n√\nof the lapse function N specifies which time coordinate is used; here, N̄ = a = p̄ implies\nconformal time η. The general form (23) also applies to equations of motion for momenta\nof the multipliers, such as ṖN = 0 = {PN , H} = −δH/δN. This must be zero because the\nmomentum PN is zero for an action (12) not depending on the time derivative of N. In\nthis way, equations of motion for the momenta of lapse and shift give rise to constraints.\nHamilton's equation of motion for the perturbed densitized triad\nδ Ėia = {δEia , H}\n\n(24)\n\nleads to the expression (3) of extrinsic curvature, but linearized. We will only need it in\nsymmetrized form which is\ni\n1h\ni\nδK(a i) =\nk̄(Fa ,i + F i ,a ) + (Ḟa , + Ḟ i ,a ) − (Sa ,i + S i ,a ) .\n(25)\n2\nor\n\n1\n1\nδK(a i) = − (σa ,i + σ i ,a ) + k̄(Fa ,i + F i ,a )\n(26)\n2\n2\nusing the gauge-invariant variable σ a . Variation with respect to the shift vector δN a ,\nδ\nH = 0,\nδ(δN a )\nwhen expressed in terms of symmetrized vector perturbations implies\n\u0015\n\u0014\np̄ 2\nδDm\n− ∇ σa = 8πG\n.\n2\nδ(δN a )\n\n(27)\n\n(28)\n\nUsing the relation between the perturbed stress-energy tensor and a variation of the matter\ndiffeomorphism constraint Dm with respect to the shift vector as derived in [20],\n\u0014\n\u0015\nδDm\n1\n0\n−\n= δT (v) a =: −(ρ + P )Va .\n(29)\na\n3/2\nδ(δN )\nN̄ p̄\none can express equation (28) in standard form [25]\n−\n\n1\n∇2 σa = 8πG(ρ + P )Va\n2a2\n\n(30)\n\nfor a vector mode equation. Here ρ and P are energy density and pressure of the background\nmatter field.\nThe second vector mode equation comes from Hamilton's equation of motion for perturbed extrinsic curvature, which using (26) becomes\n−\n\n1 d\n(i\n(σa ,i + σ i ,a ) − k̄(σa ,i + σ i ,a ) = 8πGp̄δT (v) a) .\n2 dη\n8\n\n(31)\n\n\fThe perturbed spatial stress tensor for the vector mode in terms of the matter Hamiltonian\n[20] is\n\"\n!\n#\nc j i)\nδE\nδ\nδ\nc\nδH\n1\n∂H\n1\n(i\nj\n(a\nm\nm\n+\n.\n(32)\nδT (v) a) =\np̄ 3V0 ∂ p̄\np̄\nδ(δE (a i) )\nBy using the expression of the perturbed stress-energy tensor in terms of anisotropic stress\n(i\nπa as δT (v) a) =: P (πa ,i + π i ,a ) we can express equation (31) in standard form [25]\n−\n\n\u0003\n1 d \u0002 2\na (σa ,i + σ i ,a ) = 8πGP (πa ,i + π i ,a )\n4\n2a dη\n\n(33)\n\nfor the second vector mode equation.\nFor vector modes, variation with respect to the lapse function does not give new field\nequations but would rather contribute back-reaction terms to the background evolution.\nThe two equations (28) and (31) thus provide the complete dynamics.\n\n3\n\nQuantum dynamics: Inverse triad corrections\n\nWe have completed the derivation of vector mode equations in Hamiltonian cosmology\nbased on Ashtekar's formulation of general relativity. This naturally agrees with results\nof [25]. As mentioned, we are interested in applying this formulation to study possible\ncanonical quantum gravity effects. As an explicit example, we now consider quantum\ncorrections coming from terms containing inverse densitized triad components. In Sec. 4\nwe provide formulas for a second major quantum correction that one expects from the\nuse of holonomies, rather than direct connection components, as basic operators of the\nquantum theory. This has the effect of adding terms of higher order in extrinsic curvature\ncomponents, and thus higher powers of the first time derivative of the metric, to the\nHamiltonian. In addition to those two corrections, there are higher derivative corrections\nimplied by genuine quantum effects [26, 27]. All this combines to effective constraints or\neffective equations of motion for the system. As for the diffeomorphism constraint, we\nassume that it receives no quantum corrections because it is quantized directly through its\nphase space transformations [28].\n\n3.1\n\nQuantum corrected Hamiltonian constraint\n\nWhile homogeneous quantum cosmology using loop quantum gravity techniques is rather\nwell understood [14], a systematic derivation of quantum corrections to classical dynamics which includes inhomogeneity is not yet available. But typical effects are known and\nprovide valuable indications for implications of quantum effects. In loop quantum gravity,\nE cE d\nthe appearance of inverse powers of the densitized triad as in √ j k initially leads to\n|det E|\n\ndifficulties since flux operators quantizing the densitized triad have discrete spectra containing zero as an eigenvalue [29, 30]. These difficulties can be overcome in a way exploiting\n9\n\n\fbackground independence, and giving rise to well-defined operators [31, 32]. However, for\nsmall values of the densitized triad, where the classical expression would diverge, there are\ndeviations from the classical behavior which imply quantum corrections. For the homogeneous case, explicit calculations show that the classical term is multiplied by a factor\nᾱ [33] making the whole expression finite. For large fluxes, the leading terms in explicit\nexpressions of ᾱ are of the form\n\u0012 2 \u0013n\nl\n,\n(34)\nᾱ(p̄) = 1 + c P\np̄\n\nwhere n and c are positive definite numbers which correspond to a given inverse triad operator. However, they are not completely fixed since triad operators themselves are subject\nto quantization ambiguities [34, 35]. One important motivation to study inhomogeneous\nmodels is that, compared to homogeneous models, their dynamics gives rise to much tighter\nconsistency conditions which could constrain such parameters. This is indeed borne out,\nas we will see later. While general derivations of α for inhomogeneous configurations without assumptions on the metric such as symmetries or specific modes is complicated (see\ne.g. [36]) and does not yet provide many insights, α can be computed in certain perturbative regimes. It has been studied recently for scalar mode perturbations [20], showing a\nsimilar behavior as in the isotropic case. Here we consider such quantum corrections for\nvector mode perturbations, although this is a case where no explicit expression is available\nyet. As we will see, consistency itself restricts the form of α beyond what can currently\nbe computed directly from operators. Thus, our perturbative treatment at the effective\nlevel provides conjectures to probe the overall consistency of the theory by comparing with\nresults for the underlying operators.\nThis procedure leads us to an ansatz for the quantum corrected Hamiltonian constraint\n\u0014\nZ\n√\nk̄ 2\n1\nQ\n3\na\nHG [N] =\nd xN̄ α(p̄, δEi ) −6k̄ 2 p̄ − 3 (δEjc δEkd δck δdj )\n16πG Σ\n2p̄ 2\n\u0015\n√\n2k̄\nc\nj\nj\nk c d\n+ p̄(δKc δKd δk δj ) − √ (δEj δKc ) ,\n(35)\np̄\nwhere α(p̄, δEia ) is the correction function, now also depends on triad perturbations. It\nis important to emphasize here that the correction α coming from the quantized inverse\ndensitized triad in general could be tensorial in nature. However, later we will see that\nthe leading effect on perturbation dynamics comes from the background corrections, i.e.\nfrom ᾱ = α(p̄, 0), as well as derivatives of α evaluated at the background configuration.\n(Note that the only background variable determining the geometry is p̄, in which the\ncorrections are expressed. This is sometimes seen as problematic since the scale factor\n√\na = p̄ can be rescaled arbitrarily in a flat isotropic model. However, the dependence of a\nfunction α in an inhomogeneous Hamiltonian constraint is through elementary fluxes whose\nvalues are determined by an underlying inhomogeneous state. The scale of corrections,\ntoo, is determined by the underlying state, resolving any apparent contradiction between\nthe appearance of such a scale and the rescaling freedom of a flat, precisely isotropic\nbackground.)\n10\n\n\f3.2\n\nConstraint algebra\n\nIn a canonical formulation of general relativity, classical constraints form a first class PoisK\nson algebra, i.e. {CI , CJ } = fIJ\n(A, E)CK , whose coefficients can in general be structure\nfunctions. It ensures that the transformations generated by the constraints are gauge and\npreserve the constraint surface. In other words, the evolution of phase space functions preserves the physical solution surface. To study quantum gravity effects, we have introduced\na quantum correction function α(p̄, δEia ) which depends on phase space variables. Naturally, having a new expression for the Hamiltonian constraint, there could be an anomaly\nterm of quantum origin in the constraint algebra. Here, while {HGQ [N], HGQ [N ′ ]} is trivial\nin the absence of lapse perturbations for the vector mode, a non-trivial anomaly in the algebra could occur in the Poisson bracket between HGQ [N] and DG [N a ]. This bracket turns\nout to be\nZ\n1\nQ\na\n{HG [N], DG [N ]} =\nd3 xp̄(∂j δN c )Ac j ,\n(36)\n8πG Σ\nwhere\n\nj\n\nAc = 3N̄ k̄\n\n2√\n\n\u0015\n\u0001\n1 ∂α\n∂α\nd k j\n.\nδEk δc δd\n+\np̄\n∂(δEjc ) 3p̄ ∂ p̄\n\u0014\n\n(37)\n\nWe see that the anomaly term contains derivative of α with respect to both p̄ and δEia .\nHowever, as mentioned before the functional form of the correction function α(p̄, δEia ) in\nterms of δEia is not known while the p̄-dependence can be taken to be of scalar mode form,\ni.e. (34) with parameters c and n fixed once an inverse triad operator is chosen. To have a\nconsistent set of evolution equations for the vector mode we require the anomaly term to\nvanish i.e. Ac j = 0. This in turn puts restrictions on the linearized functional form of α as\na function of δEia :\n\u0001\n∂α\n1 ∂α\nd k j\nδE\nδ\nδ\n=\n−\nk c d .\n∂(δEjc )\n3p̄ ∂ p̄\nSince α is in principle computable in the full theory, this provides important consistency\nchecks for loop quantum gravity. At present, only the dependence α(p̄) as well as derivatives\nof α along diagonal components of the spatial metric are known [17]. Anomaly cancellation\nwill then lead us to conjecture a form of derivatives δα/δ(δEia ) along off-diagonal components of the metric which one can later compare with direct calculations once they become\navailable.\n\n3.3\n\nEffective gauge invariant perturbation and its linearized equation of motion\n\nExtrinsic curvature is derived using one of Hamilton's equations of motion. Thus, one\nexpects the expression of extrinsic curvature as it follows from an equation of motion to\nchange due to the quantum corrections. This incorporates an effect of quantum geometry\nwhich changes the usual differential geometric relation of extrinsic curvature corresponding\n\n11\n\n\fto changes of the spatial metric between different slices. One can easily compute the\ncorrected expression for the perturbed extrinsic curvature\nδK(a i) = −\n\n1\n1\n(σa ,i + σ i ,a ) + k̄(Fa ,i + F i ,a )\n2α\n2\n\n(38)\n\nwhere α appears only in the first term expressed through the classical gauge invariant\nquantity σ a = S a − Ḟ a .\nThe gauge transformation of the vector perturbation F a remains unchanged because\nthe diffeomorphism constraint retains its classical form. Even though there is a quantum correction to extrinsic curvature one can easily see that σ a = S a − Ḟ a is still the\ngauge invariant variable. Moreover with the diffeomorphism constraint being unaffected,\nEq. (28) remains unchanged for the quantum background dynamics. Now using the second\nHamilton's equation, one obtains an equation of motion for extrinsic curvature as follows\n\u0014\n\u0015\n1\n1 d\n′\n(i\ni\ni\ni\ni\n−\n(σa , + σ ,a ) − k̄(ᾱ − ᾱ p̄)(σa , + σ ,a ) + A(a i) = 8πGp̄δT (v) a) .\n(39)\nᾱ\n2 dη\nTo derive Eq. (39), we have used the corrected expression (38) of extrinsic curvature as well\nas an analogous expression for the background extrinsic curvature, ᾱk̄ = ȧ/a. One may\nnote here that equation (39) explicitly contain the anomaly term. Thus, the requirement of\nan anomaly free constraint algebra leads to the corrected equation (39) explicitly in terms\nof the gauge invariant variable. The presence of an anomaly, on the other hand, would\nmake it impossible to express the equations of motion solely in terms of gauge invariant\nvariables. Since consistency of the constraint algebra requires us to set Aia = 0, closed\nequations for the gauge invariant perturbations follow. Nevertheless, non-trivial quantum\ncorrections remain through ᾱ.\nNote that the only correction function α in the Hamiltonian appears in a form multiplying the lapse function N. The correction could thus be reduced to a simple change of the\nlapse function and thus the time gauge. Still, the corrections are non-trivial as illustrated\nby the equations of motion shown here. The choice and interpretation of time is based\non the line element since this determines the measurement process of co-moving geodesic\nobservers. This behavior is not changed by the appearance of a correction function α in\nthe Hamiltonian constraint even if it always appears in combination with N. Even with a\ncorrected Hamiltonian constraint we are still referring to the same form of conformal time,\nbut fields evolve differently as given by the corrected constraint. Then, also observable\nimplications of the quantum corrections are possible.\n\n4\n\nQuantum dynamics: Holonomy corrections\n\nIn addition to corrections in coefficients of the constraint due to inverse powers of densitized triad components, there are corrections which resemble higher curvature terms in an\neffective action. While these corrections would be dominant in purely isotropic models by\nvirtue of the large matter energy density in a macroscopic universe, they are sub-dominant\n12\n\n\fin inhomogeneous situations [37]. Moreover, as we will see they do not provide much of\na structural change to the equations. The Hamiltonian constraint operator is formulated\nin terms of holonomies rather than connection or extrinsic curvature components. Since\nthese objects are non-linear as well as (spatially) non-local in connection components, they\nprovide higher order and higher spatial derivative terms. Higher time derivatives, as they\nwould also be provided by higher curvature terms, do not arise in this way but rather\nthrough the coupling of fluctuations and higher moments of a quantum state to the expectation values [26, 27]. The full effective constraint including all these terms has not been\nderived yet. In this section we therefore focus on an analysis of higher order terms only.\nFor an isotropic model sourced by a massless, free scalar field such higher order terms\nturn out to be the only corrections, and there are no higher time derivatives [38]. The exact\neffective Hamiltonian can then be obtained by simply replacing the background Ashtekar\nconnection γ k̄ by μ̄−1 sin μ̄γ k̄, as it was also seen in numerical studies [39]. The parameter\nμ̄ depends on the quantization scheme and may be a function of p̄. Just as with the\nparameter c in (34), we will see that the freedom is constrained by anomaly cancellation.\nTo study the effects of the background dynamics on inhomogeneous perturbations, we\nsimilarly substitute the appearance of k̄ in the classical Hamiltonian by a general form\n(mμ̄)−1 sin mμ̄γ k̄ where m is an integer. (This parameter is kept free because different\nfactors of sines and cosines combine from the full constraint to result in this term. It can\nbe constrained by looking at detailed properties of the underlying operator, but also by\nconsistency requirements as we will see shortly.) With this prescription, one can write\ndown expression for the corrected Hamiltonian constraint\n\"\n\u00132\n\u00132\n\u0012\n\u0012\nZ\n√ sin μ̄γ k̄\n1\n1\nsin μ̄γ k̄\nQ\n3\nd xN̄ −6 p̄\nHG [N] =\n− 3\n(δEjc δEkd δck δdj )\n16πG Σ\nμ̄γ\nμ̄γ\n2p̄ 2\n\u0012\n\u0013\n\u0015\n√\n2\nsin 2μ̄γ k̄\nj\nk c d\nc\nj\n+ p̄(δKc δKd δk δj ) − √\n(δEj δKc ) . (40)\np̄\n2μ̄γ\nHere we have required that the effective Hamiltonian (40) has a homogeneous limit in\nagreement with what has been used in isotropic models. This fixes the parameter m to\nequal one in the first two terms. The parameter for the last term as chosen here is the one\nwhich leads to an anomaly-free constraint algebra.\nAlthough we write explicit sines in this expression, and thus arbitrarily high powers\nof curvature components, it is to be understood only as a short form to write the leading\norder corrections. Higher orders are supplemented by further, yet to be computed higher\ncurvature quantum corrections. The expressions are thus reliable only when the argument\nof the sines is small, which excludes the bounce phase itself. (Such sine corrections can\nbe used throughout the bounce phase only for exactly isotropic models sourced by a free,\nmassless scalar [38, 40], but not in the presence of a matter perturbation [41] or anisotropies\nand inhomogeneities.)\n\n13\n\n\f4.1\n\nConstraint algebra\n\nAgain, a non-trivial anomaly in the algebra can occur between the Poisson bracket between\nHGQ [N] and DG [N a ]\n\u0012\n\u0013\nZ\nN̄\n1\nsin 2μ̄γ k̄\nQ\na\na\nDG [N ] +\nd3 xp̄(∂c δN j )Acj ,\n(41)\n{HG [N], DG [N ]} = √ k̄ −\np̄\n2μ̄γ\n8πG Σ\nwhere\n\"\n#\u0012\n\u0012\n\u00132 \u0012\n\u00132\n\u0013\nδEjc\n∂ sin μ̄γ k̄\nsin μ̄γ k̄\nN̄\n2\nc\n.\n(42)\n+\n− k̄\nAj = √ p̄\np̄ ∂ p̄\nμ̄γ\nμ̄γ\np̄\n√\nOne may easily check here that μ̄ ∼ 1/ p̄ leads to an anomaly free algebra up to order k̄ 4 .\nThis is in accordance with the result of arguments put forward recently in purely isotropic\n√\nmodels [42]. From an inhomogeneous perspective, the behavior μ̄ ∼ 1/ p̄ reflects the fact\nthat the fundamental Hamiltonian creates new vertices when acting on a graph state such\nthat the number of vertices increases linearly with volume [37, 43]. This suggests a tight\nrelation between anomaly freedom at the effective level and properties such as the creation\nof new vertices by a fundamental Hamiltonian constraint.\n\n4.2\n\nEffective linearized equation\n\nHamilton's equations governing the background dynamics are given by\n\u0013\n\u0012\nsin 2μ̄γ k̄\np̄ ̇ = 2p̄\n2μ̄γ\nand\n\" \u0012\n\u00132\n\u0012\n\u00132 #\n\u0012\n\u0013\nN̄\n8πG ∂ H̄m\nsin\nμ̄γ\nk̄\nsin\nμ̄γ\nk̄\n∂\n1\n ̇k̄ = − √\n+\n.\n+ p̄\np̄ 2\nμ̄γ\n∂ p̄\nμ̄γ\n3V0\n∂ p̄\n\n(43)\n\n(44)\n\nSince the diffeomorphism constraint is assumed to remain unaffected, the gauge transformation of vector functions F a remains unchanged. However, a correction to the extrinsic\ncurvature expression now leads to a new expression for the gauge invariant variable\n\u0012\n\u0013\nsin 2μ̄γ k̄\na\na\na\nσ = S − Ḟ + k̄ 1 −\nFa .\n(45)\n2μ̄γ k̄\nThe expression of perturbed extrinsic curvature in terms of the gauge invariable variable\nremains unchanged, though,\n1\n1\nδK(a i) = − (σa ,i + σ i ,a ) + k̄(Fa ,i + F i ,a ) .\n(46)\n2\n2\nNow using again Hamilton's equation, one obtains an equation of motion for extrinsic\ncurvature as follows\n\u0012\n\u0013\n1\nsin 2μ̄γ k̄\n1 d\n(i\ni\ni\n(σa , + σ ,a ) − k̄ 1 +\n(σa ,i + σ i ,a ) + A(a i) = 8πGp̄δT (v) a) . (47)\n−\n2 dη\n2\n2μ̄γ k̄\nAs before, an anomaly-free constraint algebra, requiring Aia = 0, leads to a quantum\ncorrected equation entirely in terms of the gauge invariant variable.\n14\n\n\f5\n\nRate of change of vector perturbations\n\nWe now have equations that govern the dynamics of vector mode perturbations including\nquantum corrections. For simplicity, we consider the situation where anisotropic stress is\nabsent, which is the context of [25].\n\n5.1\n\nClassical dynamics\n\nLet us recall the key feature of classical vector mode perturbations. In the absence of\nanisotropic stress, the right hand side of equation (31) vanishes. The classical background\nextrinsic curvature is related to the time derivative of the scale factor a as k̄ = ȧ/a. It\nis also convenient to decompose the amplitude of perturbations in terms of their Fourier\nmodes σki . With these simplifications, equation (31) leads to the rate of change\nd log σki\n= −2\nd log a\n\n(48)\n\nfor Fourier modes. Thus, any vector mode grows as σki ∼ a−2 in a contracting phase, and\ncorrespondingly decays in an expanding phase. This is independent of the background\nmatter content except for the assumed absence of anisotropic stress. Thus, a quantum\ncorrection of the background matter sector alone would not help in taming the growth\nof vector perturbations. Intuitively, one expects that it is required to have a modified\ngravity sector in order to have any modification of the growth rate. In the next sub-section\nwe consider the dynamics in the presence of quantum corrections to the gravitational\nHamiltonian.\n\n5.2\n\nQuantum corrections: Inverse triad\n\nAs in the classical case, we consider the situation where anisotropic stress is absent. Then\nusing the equation of motion ᾱk̄ = ȧ/a for the background, one can write Eq. (39) for\nFourier modes σki of vector perturbations in the form\n\u0012\n′ \u0013\nd log σki\nᾱ − ᾱ p̄\n.\n(49)\n= −2\nd log a\nᾱ\nFor ᾱ = 1 quantum corrections are switched off and we obtain the classical result. Now\nusing the generic form of ᾱ as in (34) with an approach to one from above (i.e. c > 0), it\nis easy to see that\n\u0012\n\u0012 2 \u0013n\n′ \u0013\nᾱ − ᾱ p̄\nl\n= 1 + nc P\n>1.\n(50)\nᾱ\np̄\nThus, the decay rate of vector mode perturbations is slightly higher compared to that of\na classical scenario. In other words, in the contracting phase, the correction coming from\ninverse powers of the densitized triad in background dynamics causes vector perturbations\nto grow even faster, though only slightly, than in the classical situation. The quantum\n15\n\n\fcorrection depends inversely on volume, i.e. it becomes stronger in the smaller volume\nregime. Using non-perturbative corrections in ᾱ for small densitized triads, a decrease of\nthe rate is indicated since ᾱ falls below one in this regime and has ᾱ′ > 0. However, for such\nsmall scales the perturbation theory of inhomogeneities is less reliable and a suppression\nof the decay rate on very small scales can, at present, at best be taken as an indication.\n\n5.3\n\nQuantum corrections: Holonomies\n\nAs before, we consider the situation where anisotropic stress is absent. Now, the corrected\nequation for Fourier modes σki of vector perturbations, after dividing (47) by (43), is\n\u0013\n\u0012\n2μ̄γ k̄\nd log σki\n.\n(51)\n=− 1+\nd log a\nsin 2μ̄γ k̄\nHere, quantum corrections disappear for μ̄ → 0. Again, the right hand side is less than\n−2 and thus vector modes grow more strongly in a contracting phase. If the behavior\nis extrapolated to the bounce phase, the growth rate in a contracting universe becomes\neven larger and would diverge at the bounce where cos(μ̄γ k̄) is zero. This indicates a\nbreakdown of the perturbation scheme and the need to include higher order terms as the\n√\nbounce is approached. It should also be emphasized here that μ̄ ∼ 1/ p̄ leads to anomaly\nfree Poisson algebra only up to order k̄ 4 . So the anomaly term becomes significant near\nbounce phase that makes the analysis less reliable there.\n\n6\n\nDiscussions\n\nIn the absence of anisotropic stress, gauge-invariant vector perturbations classically grow\nas a−2 in the contracting phase. Such a growth of vector perturbations indicates a possible violation of homogeneity assumptions in smaller volume regime, indicated by the\nbreakdown of classical perturbation theory. Thus, the growth of vector perturbations may\npose significant problems in particular for bouncing cosmologies which are invariably associated with a contracting phase but often have been derived only under the assumption\nof homogeneity. In these models, conclusions regarding bounces are drawn based on the\nhomogeneity assumption. Naturally, a growth of vector perturbations can question the\nrobustness of such bounce scenarios by questioning the validity of the homogeneity assumption itself at smaller volume, given that bounces are typically more difficult to realize\nwhen inhomogeneities are taken into account; see [44, 38]. Thus, it is an important issue\nto study the dynamics of vector mode perturbations in the cosmological context.\nIn this paper, we have presented a systematic derivation of gauge-invariant vector perturbation equations to linear order in Hamiltonian cosmology based on Ashtekar variables.\nWe have only considered a spatially flat Friedmann–Robertson–Walker background as this\nis the case of most interest in cosmology. Hamiltonians and equations of motion are technically more complicated in the presence of spatial curvature and are still being worked out.\nQuantum corrections are, however, analogous in spatially curved backgrounds and we do\n16\n\n\fnot expect our results to change significantly in those cases. Specifically, we have studied\nthe effects of two particular types of quantum correction, inverse triad and holonomy corrections, on the dynamics of vector perturbations in large volume regimes. For each type,\nwe have shown that in a contracting phase the growth rate of vector mode perturbations is\nslightly stronger compared to the classical situation due to quantum effects. This quantum\ncorrection is small as one expects. Although there are quantization ambiguities, the sign\nof corrections to the growth rate seems robust. A reduction of the growth rate is indicated\nonly in regimes of non-perturbative corrections of inverse powers. For such a reduction to\nbe realized, even if it remains true under a more careful perturbation analysis, one would\nhave to enter the deep Planck regime. Moreover, if one starts with a large classical universe\nas initial configuration, such non-perturbative quantum effects will become relevant only\nafter long evolution times. In general, due to the growth of the vector mode one will eventually have to use higher than linear orders in perturbative inhomogeneities which we have\nnot included in this paper. This by itself may well change some of the conclusions about\nthe bounce phase independently of quantum effects in the evolution of inhomogeneities.\nAnother important issue touched in this paper is that of potential anomalies in the\nquantum constraint algebra. We started with a general but unspecified form of a quantum\ncorrection function α or higher order terms, including inhomogeneity. The functional\nform of α as a function of the background variable p̄ is known. However, its functional\ndependence on the perturbed densitized triad δEia (which is purely off-diagonal for vector\nmodes) is unknown due to the lack of a systematic derivation of such corrections from the\nfull theory. As we have observed, requiring anomaly cancellation in the modified constraint\nalgebra restricts the functional dependence of quantum correction functions such as α on\noff-diagonal triad components. It would be interesting to see whether such a restriction\nis satisfied by a systematically derived quantum correction function from the full theory.\nAs a key result, we have observed the possibility of non-trivial quantum corrections while\npreserving anomaly freedom. The classical constraint algebra for vector modes is rather\ntrivial, but is much more restrictive for scalar modes for which the calculations here show\nthe guiding principle.\n\nAcknowledgements\nWe would like to thank Mikhail Kagan for discussions. This work was supported in part\nby NSF grants PHY0653127, PHY0554771 and PHY0456913.\n\nReferences\n[1] Mena F C, Mulryne D J, and Tavakol R 2007 Nonlinear vector perturbations in a\ncontracting universe Class. Quantum Grav. 24 2721–2734\n[2] Veneziano G 1991 Scale Factor Duality for Classical and Quantum Strings Phys. Lett.\nB 265 287–294\n17\n\n\f[3] Veneziano G 1999\nhep-th/0002094\n\nString cosmology:\n\nthe pre-big bang scenario\n\nPreprint\n\n[4] Khoury J, Ovrut B A, Steinhardt P J, and Turok N 2001 The Ekpyrotic Universe:\nColliding Branes and the Origin of the Hot Big Bang Phys. Rev. D 64 123522\n[5] Steinhardt P J and Turok N 2002 Cosmic Evolution in a Cyclic Universe Phys. Rev.\nD 65 126003\n[6] Lidsey J E, Mulryne D J, Nunes N J, and Tavakol R 2004 Oscillatory Universes in\nLoop Quantum Cosmology and Initial Conditions for Inflation Phys. Rev. D 70 063521\n[7] Ashtekar A, Pawlowski T, Singh P, and Vandersloot K 2007 Loop quantum cosmology\nof k=1 FRW models Phys. Rev. D 75 024035\n[8] Battefeld T J and Geshnizjani G 2006 Perturbations in a regular bouncing universe\nPhys. Rev. D 73 064013\n[9] Giovannini M 2004 Vector fluctuations from multidimensional curvature bounces Phys.\nRev. D 70 103509\n[10] Hawking S W, Hertog T and Reall H S 2001 Trace anomaly driven inflation Phys.\nRev. D 63 083504\n[11] Rovelli C 2004 Quantum Gravity (Cambridge University Press) Cambridge, UK\n[12] Ashtekar A and Lewandowski J 2004 Background independent quantum gravity: A\nstatus report Class. Quantum Grav. 21 R53–R152\n[13] Thiemann T 2001 Introduction to Modern Canonical Quantum General Relativity\nPreprint gr-qc/0110034\n[14] Bojowald M 2005 Loop Quantum Cosmology Living Rev. Relativity 8 11\nhttp://relativity.livingreviews.org/Articles/lrr-2005-11/\n[15] Ashtekar A 1987 New Hamiltonian Formulation of General Relativity Phys. Rev. D\n36 1587–1602\n[16] Barbero G J F 1995 Real Ashtekar Variables for Lorentzian Signature Space-Times\nPhys. Rev. D 51 5507–5510\n[17] Bojowald M, Hernández H, Kagan M, and Skirzewski A 2007 Effective constraints of\nloop quantum gravity Phys. Rev. D 75 064022\n[18] Perez A 2006 On the regularization ambiguities in loop quantum gravity Phys. Rev.\nD 73 044007\n\n18\n\n\f[19] Vandersloot K 2005 On the Hamiltonian Constraint of Loop Quantum Cosmology\nPhys. Rev. D 71 103506\n[20] Bojowald M, Hernández H, Kagan M, Singh P, and Skirzewski A 2006 Hamiltonian\ncosmological perturbation theory with loop quantum gravity corrections Phys. Rev.\nD 74 123512\n[21] Rovelli C and Smolin L 1990 Loop Space Representation of Quantum General Relativity Nucl. Phys. B 331 80–152\n[22] Immirzi G 1997 Real and Complex Connections for Canonical Gravity Class. Quantum\nGrav. 14 L177–L181\n[23] Dittrich B and Tambornino J 2007 A perturbative approach to Dirac observables and\ntheir space-time algebra Class. Quant. Grav. 24 757–784\n[24] Dittrich B and Tambornino J 2007 Gauge invariant perturbations around symmetry\nreduced sectors of general relativity: applications to cosmology Class. Quant. Grav.\n24 4543–4585\n[25] Battefeld T J and Brandenberger R 2004 Vector perturbations in a contracting Universe Phys. Rev. D 70 121302(R)\n[26] Bojowald M and Skirzewski A 2006 Effective Equations of Motion for Quantum Systems Rev. Math. Phys. 18 713–745\n[27] Bojowald M and Skirzewski A 2007 Quantum Gravity and Higher Curvature Actions\nInt. J. Geom. Methods Mod. Phys. 4 25–52\n[28] Ashtekar A, Lewandowski J, Marolf D, Mourão J, and Thiemann T 1995 Quantization\nof Diffeomorphism Invariant Theories of Connections with Local Degrees of Freedom\nJ. Math. Phys. 36 6456–6493\n[29] Rovelli C and Smolin L 1995 Discreteness of Area and Volume in Quantum Gravity\nNucl. Phys. B 442 593–619 Erratum: Nucl. Phys. B 456 753 (1995)\n[30] Ashtekar A and Lewandowski J 1997 Quantum Theory of Geometry I: Area Operators\nClass. Quantum Grav. 14 A55–A82\n[31] Thiemann T 1998 Quantum Spin Dynamics (QSD) Class. Quantum Grav. 15 839–873\n[32] Thiemann T 1998 QSD V: Quantum Gravity as the Natural Regulator of Matter\nQuantum Field Theories Class. Quantum Grav. 15 1281–1314\n[33] Bojowald M 2001 Inverse Scale Factor in Isotropic Quantum Geometry Phys. Rev. D\n64 084018\n\n19\n\n\f[34] Bojowald M 2002 Quantization ambiguities in isotropic quantum geometry Class.\nQuantum Grav. 19 5113–5130\n[35] Bojowald M 2004 Loop Quantum Cosmology: Recent Progress Pramana 63 765–776\n[36] Brunnemann J and Thiemann T 2006 Unboundedness of Triad-Like Operators in Loop\nQuantum Gravity Class. Quantum Grav. 23 1429–1483\n[37] Bojowald M 2006 Loop quantum cosmology and inhomogeneities Gen. Rel. Grav. 38\n1771–1795\n[38] Bojowald M 2007 Large scale effective theory for cosmological bounces Phys. Rev. D\n75 081301(R)\n[39] Ashtekar A, Pawlowski T, and Singh P 2006 Quantum Nature of the Big Bang: An\nAnalytical and Numerical Investigation Phys. Rev. D 73 124038\n[40] Bojowald M 2007 Dynamical coherent states and physical solutions of quantum cosmological bounces Phys. Rev. D 75 123512\n[41] Bojowald M, Hernández H, and Skirzewski A 2007 Bounce perturbation theory: inclusion of matter interactions Preprint arXiv:0706.1057 (to appear in Phys. Rev. D)\n[42] Ashtekar A, Pawlowski T, and Singh P 2006 Quantum Nature of the Big Bang: Improved dynamics Phys. Rev. D 74 084003\n[43] Bojowald M, Cartin D, and Khanna G 2007 Lattice refining loop quantum cosmology,\nanisotropic models and stability Phys. Rev. D to appear Preprint arXiv:0704.1137\n[44] Hertog T and Horowitz G T 2005 Holographic Description of AdS Cosmologies JHEP\n0504 005\n\n20\n\n\f"}