{"id": "http://arxiv.org/abs/0804.3820v3", "guidislink": true, "updated": "2008-05-11T00:59:13Z", "updated_parsed": [2008, 5, 11, 0, 59, 13, 6, 132, 0], "published": "2008-04-24T00:39:05Z", "published_parsed": [2008, 4, 24, 0, 39, 5, 3, 115, 0], "title": "Confined gravitational waves for chiral matter with heat", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0804.4540%2C0804.0968%2C0804.1653%2C0804.1054%2C0804.0138%2C0804.3580%2C0804.1402%2C0804.0172%2C0804.2158%2C0804.3076%2C0804.2388%2C0804.4539%2C0804.2167%2C0804.4357%2C0804.1920%2C0804.4320%2C0804.2566%2C0804.3362%2C0804.0137%2C0804.1575%2C0804.3510%2C0804.2752%2C0804.2932%2C0804.2715%2C0804.4205%2C0804.1082%2C0804.1013%2C0804.4343%2C0804.4713%2C0804.4082%2C0804.2295%2C0804.3924%2C0804.0521%2C0804.2216%2C0804.4813%2C0804.0242%2C0804.4131%2C0804.4401%2C0804.3939%2C0804.3639%2C0804.3947%2C0804.2586%2C0804.2463%2C0804.1195%2C0804.2926%2C0804.3137%2C0804.3048%2C0804.0415%2C0804.0278%2C0804.2129%2C0804.1868%2C0804.0833%2C0804.0367%2C0804.4238%2C0804.4270%2C0804.0482%2C0804.3007%2C0804.3270%2C0804.1187%2C0804.0956%2C0804.1852%2C0804.1139%2C0804.0616%2C0804.0456%2C0804.2676%2C0804.4671%2C0804.2073%2C0804.2529%2C0804.0757%2C0804.4073%2C0804.1815%2C0804.0785%2C0804.1325%2C0804.3593%2C0804.1544%2C0804.3830%2C0804.0234%2C0804.3139%2C0804.1908%2C0804.2014%2C0804.2032%2C0804.3464%2C0804.2118%2C0804.2717%2C0804.3862%2C0804.1138%2C0804.2634%2C0804.4369%2C0804.1736%2C0804.1792%2C0804.3339%2C0804.1697%2C0804.3820%2C0804.2353%2C0804.0638%2C0804.4734%2C0804.3425%2C0804.0348%2C0804.4708%2C0804.0133%2C0804.3684&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Confined gravitational waves for chiral matter with heat"}, "summary": "The GR wave self-heating of geodesic massive bodies with constant\nthermo-gravimechanical energies increases the brightness-to-charge ratio along\nspiral radial transitions in the energy-to-energy gravitation. Paired confined\ngravitons locally warm accelerated matter that suggests the thermodynamical\norigin of electromagnetic outbursts with oscillating Wien's displacements.\nDamping of orbital periods by chiral GR waves is more efficient for neutron\nstars around giant companions than for binary pulsars.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0804.4540%2C0804.0968%2C0804.1653%2C0804.1054%2C0804.0138%2C0804.3580%2C0804.1402%2C0804.0172%2C0804.2158%2C0804.3076%2C0804.2388%2C0804.4539%2C0804.2167%2C0804.4357%2C0804.1920%2C0804.4320%2C0804.2566%2C0804.3362%2C0804.0137%2C0804.1575%2C0804.3510%2C0804.2752%2C0804.2932%2C0804.2715%2C0804.4205%2C0804.1082%2C0804.1013%2C0804.4343%2C0804.4713%2C0804.4082%2C0804.2295%2C0804.3924%2C0804.0521%2C0804.2216%2C0804.4813%2C0804.0242%2C0804.4131%2C0804.4401%2C0804.3939%2C0804.3639%2C0804.3947%2C0804.2586%2C0804.2463%2C0804.1195%2C0804.2926%2C0804.3137%2C0804.3048%2C0804.0415%2C0804.0278%2C0804.2129%2C0804.1868%2C0804.0833%2C0804.0367%2C0804.4238%2C0804.4270%2C0804.0482%2C0804.3007%2C0804.3270%2C0804.1187%2C0804.0956%2C0804.1852%2C0804.1139%2C0804.0616%2C0804.0456%2C0804.2676%2C0804.4671%2C0804.2073%2C0804.2529%2C0804.0757%2C0804.4073%2C0804.1815%2C0804.0785%2C0804.1325%2C0804.3593%2C0804.1544%2C0804.3830%2C0804.0234%2C0804.3139%2C0804.1908%2C0804.2014%2C0804.2032%2C0804.3464%2C0804.2118%2C0804.2717%2C0804.3862%2C0804.1138%2C0804.2634%2C0804.4369%2C0804.1736%2C0804.1792%2C0804.3339%2C0804.1697%2C0804.3820%2C0804.2353%2C0804.0638%2C0804.4734%2C0804.3425%2C0804.0348%2C0804.4708%2C0804.0133%2C0804.3684&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "The GR wave self-heating of geodesic massive bodies with constant\nthermo-gravimechanical energies increases the brightness-to-charge ratio along\nspiral radial transitions in the energy-to-energy gravitation. Paired confined\ngravitons locally warm accelerated matter that suggests the thermodynamical\norigin of electromagnetic outbursts with oscillating Wien's displacements.\nDamping of orbital periods by chiral GR waves is more efficient for neutron\nstars around giant companions than for binary pulsars."}, "authors": ["I. E. Bulyzhenkov"], "author_detail": {"name": "I. E. Bulyzhenkov"}, "author": "I. E. Bulyzhenkov", "arxiv_comment": "2 pages", "links": [{"href": "http://arxiv.org/abs/0804.3820v3", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0804.3820v3", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "physics.gen-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "physics.gen-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "physics.space-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0804.3820v3", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0804.3820v3", "journal_reference": null, "doi": null, "fulltext": "Confined gravitational waves for chiral matter with heat\nI. Bulyzhenkov-Widicker1, 2\n\narXiv:0804.3820v3 [physics.gen-ph] 11 May 2008\n\n1\n\nthe Institute of Spectroscopy RAS, Troitsk, Moscow reg. 142092, Russia\n2\nDepartment of Physics, University of Ottawa,\n150, Louis-Pasteur, Ottawa, Ontario K1N 6N5, Canada\n\nThe GR wave self-heating of geodesic massive bodies with constant thermo-gravimechanical energies increases the brightness-to-charge ratio along spiral radial transitions in the energy-to-energy\ngravitation. Paired confined gravitons locally warm accelerated matter that suggests the thermodynamical origin of electromagnetic outbursts with oscillating Wien's displacements. Damping of\norbital periods by chiral GR waves is more efficient for neutron stars around giant companions than\nfor binary pulsars.\nPACS numbers: 04.20.Cv\n\nMetric formalism for the geodesic motion, initiated by Einstein and Grossmann1 , is not presently unified with\nirreversible heat generation and black-body gamma radiation. Electromagnetic (EM) wave losses change gravitational\ncharges in Mach-Einstein's energy-to-energy gravitation2. This reading of General Relativity (GR) predicted the one\nmeter per century increase of the Earth-Sun distance. Energy-driven geometry\nalso suggested to count internal\n√\n(thermodynamical, non-metric) energy N next to mechanical, K = mc2 / 1 − v 2 c−2 , and gravitational, Uo , parts\n√\nof the passive GR charge, Po = K goo , in Eötvös-type laboratory tests of non-empty energy space for flatspace\ngravitation in question.\nBy neglecting EM radiation, one may request the strict energy conservation,\n√\n(1)\nE ≡ N + K goo = N + K + Uo = const,\nof probe termodynamical bodies under the free motion in static gravitational fields (∂t goo = 0). Then a possible\nheat production, d < N > /dt ≥ 0, in free bodies with internal frictions or self radiation-absorption processes can\nremove them from GR's rosette cycles for idealized point bodies without internal degrees of freedom. The gravitothermodynamical balance (1) for the passive gravitational charge E and the virial theorem for a finite non-relativistic\nmotion, d < K + Uo > ≈ −d < K >, can relate the orbital heat release to averaged changes of potential and\nkinetic energies, d < N >= − d < K + Uo > ≈ + d < K >. Body's kinetic (translation) and internal energies\nshare the equipartition split of the potential energy gain, d < Uo > /dt < 0 in weak central fields, for example,\nwhere Uo = Ero /r << 1 and ro = GEM /c4 << r. A Keplerian cyclic motion in such fields corresponds to negligible\ngeneration of heat by slowly rotating bodies. However, the nonlinear wave intensity of accelerated gravitational\ncharges is to be proportional to m2 . Therefore, the spiral motion of massive stars can be accompanied by very\nintensive geodesic self-heating (up to nuclear fusion temperatures because surface cooling through electromagnetic\nwaves is not very efficient for massive radial bodies). Without (chiral) transformations of GR gravimechanical energies\ninto heat and further irreversible EM losses, ideal GR charges (without self-heating mechanisms) would stay on initial\ncyclic trajectories without observed evolution options for real thermodynamical matter.\nThe strict constancy of geodesic energy-charges may be required only in an energy-to-energy gravitational theory\nwithout the EM decay/pumping of the probe GR charge. Surface temperature of small astronomical bodies is mainly\nbalanced by inward energy fluxes, reflection, emissivity, and the Stefan-Boltzmann constant for outward gamma\nradiation. The bulk gravitational self-heating of a massive geodesic body can contribute to its surface temperature.\nQuasi-relativistic neutron stars on prolonged elliptic orbits around giant massive centers should exhibit explosive\nsurface temperature jumps and, therefore, periodic EM outbursts. One could relate the known gamma outbursts,\nfor example3 , to peak self-heating powers of massive relativistic bodies at their shortest interaction proximities,\nwhen confined emission-absorption of paired gravitational waves and emission of outward EM waves are maximized.\nThermo-gravimechanical energy conservation of free accelerated bodies (with chiral masses) means that their paired\ngravitons (with chiral symmetry) are converted into heat locally without outward gravitational waves for distant\ninterferometers.\nLocal confinement of paired GR waves can be traced quantitatively for the binary pulsar PSR B1913+16, because\nthis object was well studied for more than 30 years4 . Poynting wave flows from oscillating electric charges q are\nknown from Maxwell's electrodynamics. The chiral amplitude of two unfolded gravitational waves is proportional to\n2E. Therefore, the chiral intensity (of locally confined vector waves with zero-balanced Poynting flows) is proportional\nto 4E 2 . One can replace q 2 in EM radiation flows with G(2E/c2 )2 for exact computation of the radiation self-heating\nby paired vector gravitons. The angular intensity of chiral gravitational waves and the integral heat balance for equal\n\n\f2\nand constant energy-charges E on the opposite circular orbit of radius 'a' can be computed from the readily available\nelectrodynamic solutions5 ,\n\n dIG R /dΩ = G(2E/c2 )2 2a4 ω 6 sin2 θ(1 + cos2 θ)/πc5\n(2)\n\n128GE 2 a4 ω 6 /5c9 = d < N > /dt = −d < K + Uo > /dt.\n\nThe non-relativistic motion of such a symmetrical two-body gyroscope with E ≈ mc2 and ω = (Gm/4a3 )1/2 = 2π/P\ncomplies with the virial theorem, which directly relates the system kinetic energy increase to the internal energy\nincrease, mdv 2 /dt = dN/dt. This energy balance for mechanical and thermodynamical degrees of freedom explains\ndecays of pulsar periods P under the 'dissipation' decrease of the mutual proximity '2a′ of rotating stars. Thermogravitational self-organization of two radial bodies with constant energy-charges, E1 = const and E2 = const, into one\nradial body (with coalesced energies E1 + E2 around one center of radial symmetry when 'a′ → 0) is not accompanied\nby outward gravitational waves, but only by electromagnetic signals due to continuous gamma decay of GR charges\nwith internal energy (and temperature for the black-body radiation).\nSlow velocities v = 2πa/P < c result from (2) in the well known period decay dP/dt = −(48π/5c5 )(4πGm/P )5/3\n= −3.4 × 10−12(m * 1h/MSun P )5/3 for symmetrical pulsars. This 'electrodynamic' result for confined vector gravitons\nmatches the Hulse-Taylor pulsar data, dP/dt = (−2.422±0.006)×10−12, P = 7.75h, after mass asymmetry corrections\nfor m ≈ 1.4MSun . Paired (chiral) gravitons carry a zero Pointing vector and, therefore, the two-body gravitational\ninteraction cannot be intercepted or screened by third bodies. However, such chiral energy-information exchanges\ninstantly increase heat contents of constant interacting charges of the two-body system that can be predicted and\ntested in practice.\nThe strong field energy Uo = −GEEM /c4 r = −Ero /r in (1) for cold neutron stars (without self-heating) next\nto a giant massive companion, E/EM ≡ GE/ro c4 = const << 1 would correspond to the classical atomic orbit\n1/r = A + Bcos(kφ), with A = E 2 ro /c2 k 2 L2 , B = [E 2 c−2 k −4 L−2 − m2 c2 k −2 L−2 ]1/2 , k = (1 − E 2 ro2 c−2 L−2 )1/2 , and\nL2 = (r × P)2 = conts. However, real gravitational orbits are not steady due to the continuous heat accumulation\nIGR = d < N > /dt > 0 from chiral gravitational waves of the accelerated constant charge E,\n√\n8GE 2 < v̇2 >\nd<N >\nd < K + Uo >\nd < mc2 1 − v 2 c−2 >\n≈\n=−\n≈−\n,\n(3)\n3c7\ndt\ndt\ndt\n\neven in the absence of net EM radiation losses. RHere we approximate self-heating of distant neutron stars by the\ndipole radiation, IGR ≈ 8G(p̈)2 /3c3 and p(t′ ) ≡ r′ ρ(r′ , t′ )dV ′ ≈ r′ E/c2 , of paired GR charges through the Larmor\nradiation limit for non-relativistic electric charges. The gravitational wave damping for equal binaries is less efficient\nthan for the circular motion of one partner around a static supermassive center. For example, non-relativistic circular\norbits in (3) yield a quite rapid period decay\n32π 2 Gm\ndP\n=−\n= −4.3 × 10−7 (m * 1h/MSun P ).\ndt\nc3 P\n\n(4)\n\nCircular orbits correspond to a steady heat release and cannot provide periodic gamma outbursts (for distant observations). Neutron stars on prolonged elliptic orbits around suppermassive companions can generate heat pulses with\nX-rays periodically. Such relativistic objects with predictable period decays can test (4) for paired (confined) gravitational waves. Analysis of dynamical Wein's displacements in outburst spectra could also verify their non-stationary\nthermal origin from oscillating accelerations v̇2 in the chiral heat intensity (3). This may shed some light on the\nvanishing Poynting vector for chiral interactions (of inert and live matter) in non-empty energy space.\nThe self-generated heat from local 'absorption' of 'just emitted' anisotropic gravitational waves warms free falling\nmatter and modifies a Keplerian motion of stars toward their spatial coalesce under the strict energy conservation.\nA radial discrepancy between a galaxy luminosity and a gravitational energy-matter density is not a violation of\nthe energy-to-energy gravitational law, but a confirmation of the universal energy balance (1). The gravitational\nself-heating and net gamma outcome/income of thermobalanced energy-charges in the energy-to-energy gravitation\nshould be counted for exact geodesic curves of free astronomical bodies and their satellites.\n\n1\n2\n3\n4\n5\n\nA. Einstein and M. Grossmann. Zs. Math. und Phys. 62, 225 (1913).\nI.E. Bulyzhenkov-Widicker. Int. Jour. of Theor. Phys. 47, 1261 (2008).\nM. Valtonen, M. Kidger, H. Lehto, G. Poyner. Astronomy and Astrophysics, 477 : 2, 407-412 (2008)\nR. A. Hulse and J. H. Taylor, Astrophys. J., 195, L51 (1975).\nV.V. Batygin, I.N. Toptygin, Problems in Electrodynamics. Academic Press, London, 1964, chap.12.\n\n\f"}