{"id": "http://arxiv.org/abs/1112.5443v3", "guidislink": true, "updated": "2014-03-21T00:55:08Z", "updated_parsed": [2014, 3, 21, 0, 55, 8, 4, 80, 0], "published": "2011-12-22T20:31:53Z", "published_parsed": [2011, 12, 22, 20, 31, 53, 3, 356, 0], "title": "Differentiating Between Modified Gravity Theories in the Solar System", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1112.4734%2C1112.2280%2C1112.4908%2C1112.1243%2C1112.3259%2C1112.3200%2C1112.1707%2C1112.2636%2C1112.2277%2C1112.3866%2C1112.4971%2C1112.0856%2C1112.4785%2C1112.4486%2C1112.4219%2C1112.4368%2C1112.2823%2C1112.3380%2C1112.3366%2C1112.3329%2C1112.2758%2C1112.3272%2C1112.4045%2C1112.5249%2C1112.1981%2C1112.5070%2C1112.5185%2C1112.6050%2C1112.5699%2C1112.4474%2C1112.1656%2C1112.4858%2C1112.5946%2C1112.3488%2C1112.5443%2C1112.6429%2C1112.2119%2C1112.6162%2C1112.5504%2C1112.5813%2C1112.5803%2C1112.5647%2C1112.2113%2C1112.5921%2C1112.5691%2C1112.6105%2C1112.2845%2C1112.4071%2C1112.2218%2C1112.1202%2C1112.1001%2C1112.5745%2C1112.6382%2C1112.5642%2C1112.1746%2C1112.3600%2C1112.5026%2C1112.2624%2C1112.0747%2C1112.3857%2C1112.4789%2C1112.1840%2C1112.1780%2C1112.5336%2C1112.2820%2C1112.0386%2C1112.0750%2C1112.6080%2C1112.3245%2C1112.3948%2C1112.4933%2C1112.1325%2C1112.6172%2C1112.6282%2C1112.6327%2C1112.2997%2C1112.5007%2C1112.2896%2C1112.2795%2C1112.2199%2C1112.5537%2C1112.4056%2C1112.3765%2C1112.0470%2C1112.5129%2C1112.3643%2C1112.1086%2C1112.2754%2C1112.5140%2C1112.0412%2C1112.3739%2C1112.0661%2C1112.0626%2C1112.0446%2C1112.2533%2C1112.0835%2C1112.5842%2C1112.0008%2C1112.4518%2C1112.4088%2C1112.4285&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Differentiating Between Modified Gravity Theories in the Solar System"}, "summary": "Building on previous work, we re-examine the possibility of testing MOdified\nNewtonian Dynamics near the saddle points of gravitational potentials in the\nSolar System, through an extension of the forthcoming LISA Pathfinder mission.\nWe extend present analysis to include quasi-linear formulations of these\ntheories, resulting from fully relativistic modified gravity theories. Using\nsimilar quantitative and qualitative tools, we demonstrate that in general,\nboth the instrumental response and typical Signal to Noise Ratios for such a\ntest will be different. Finally we investigate constraints from a negative\nresult and parameterised free functions.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1112.4734%2C1112.2280%2C1112.4908%2C1112.1243%2C1112.3259%2C1112.3200%2C1112.1707%2C1112.2636%2C1112.2277%2C1112.3866%2C1112.4971%2C1112.0856%2C1112.4785%2C1112.4486%2C1112.4219%2C1112.4368%2C1112.2823%2C1112.3380%2C1112.3366%2C1112.3329%2C1112.2758%2C1112.3272%2C1112.4045%2C1112.5249%2C1112.1981%2C1112.5070%2C1112.5185%2C1112.6050%2C1112.5699%2C1112.4474%2C1112.1656%2C1112.4858%2C1112.5946%2C1112.3488%2C1112.5443%2C1112.6429%2C1112.2119%2C1112.6162%2C1112.5504%2C1112.5813%2C1112.5803%2C1112.5647%2C1112.2113%2C1112.5921%2C1112.5691%2C1112.6105%2C1112.2845%2C1112.4071%2C1112.2218%2C1112.1202%2C1112.1001%2C1112.5745%2C1112.6382%2C1112.5642%2C1112.1746%2C1112.3600%2C1112.5026%2C1112.2624%2C1112.0747%2C1112.3857%2C1112.4789%2C1112.1840%2C1112.1780%2C1112.5336%2C1112.2820%2C1112.0386%2C1112.0750%2C1112.6080%2C1112.3245%2C1112.3948%2C1112.4933%2C1112.1325%2C1112.6172%2C1112.6282%2C1112.6327%2C1112.2997%2C1112.5007%2C1112.2896%2C1112.2795%2C1112.2199%2C1112.5537%2C1112.4056%2C1112.3765%2C1112.0470%2C1112.5129%2C1112.3643%2C1112.1086%2C1112.2754%2C1112.5140%2C1112.0412%2C1112.3739%2C1112.0661%2C1112.0626%2C1112.0446%2C1112.2533%2C1112.0835%2C1112.5842%2C1112.0008%2C1112.4518%2C1112.4088%2C1112.4285&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Building on previous work, we re-examine the possibility of testing MOdified\nNewtonian Dynamics near the saddle points of gravitational potentials in the\nSolar System, through an extension of the forthcoming LISA Pathfinder mission.\nWe extend present analysis to include quasi-linear formulations of these\ntheories, resulting from fully relativistic modified gravity theories. Using\nsimilar quantitative and qualitative tools, we demonstrate that in general,\nboth the instrumental response and typical Signal to Noise Ratios for such a\ntest will be different. Finally we investigate constraints from a negative\nresult and parameterised free functions."}, "authors": ["Ali Mozaffari"], "author_detail": {"name": "Ali Mozaffari"}, "author": "Ali Mozaffari", "arxiv_comment": "9 Pages, 5 Figures, Submitted To CQG", "links": [{"href": "http://arxiv.org/abs/1112.5443v3", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1112.5443v3", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "astro-ph.CO", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "astro-ph.CO", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "gr-qc", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1112.5443v3", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1112.5443v3", "journal_reference": null, "doi": null, "fulltext": "Differentiating Between Modified Gravity Theories in the Solar System\nAli Mozaffari1\n\narXiv:1112.5443v3 [astro-ph.CO] 21 Mar 2014\n\n1\n\nTheoretical Physics Group, Imperial College, London, SW7 2BZ∗\n(Dated: June 9, 2018)\n\nBuilding on previous work, we re-examine the possibility of testing MOdified Newtonian Dynamics near the saddle points of gravitational potentials in the Solar System, through an extension of\nthe forthcoming LISA Pathfinder mission. We extend present analysis to include quasi-linear formulations of these theories, resulting from fully relativistic modified gravity theories. Using similar\nquantitative and qualitative tools, we demonstrate that in general, both the instrumental response\nand typical Signal to Noise Ratios for such a test will be different. Finally we investigate constraints\nfrom a negative result and parameterised free functions.\nPACS numbers: 04.50.Kd, 04.80.Cc\n\n1.\n\nIntroduction\n\nThe standard model of cosmology is composed of General Relativity and ΛCDM which has had great success\nin matching large scale observations in astronomy and\ncosmology. However attempts to date to directly detect\ncandidate dark matter particles have been have been at\nbest unclear and at worst fruitless. Over the past few\ndecades, attempts to reconcile anomalous observations\nof galactic dynamics without resorting to dark matter\nhave been the driving forces behind modified gravity theories. These have centred around a prescription for a\nmodified force law [1], which reduce to Newtonian dynamics at \"large\" accelerations and modified dynamics\nat \"small\" accelerations (large and small here are relative\nto the Milgrom characteristic acceleration taken here as\na0 ≈ 10−10 ms−2 ). In doing so, the observed flattening\nof galaxy rotation curves and the empirical Tully-Fisher\nrelation can both be satisfied [2]. Recent work on an\nexperimental observation of theories with a preferred acceleration scale [3, 4, 5] suggest that anomalously large\ntidal stresses should be present around the gravitational\nsaddle points (SP) scattered throughout the Solar System. The proposed LISA Pathfinder (LPF) mission [6]\ncould be capable of serving as an accelerometer of unprecedented accuracy. The instrument, essentially, consists of two test masses, orientated such that they are\nin a free fall, with a laser interferometer between them.\nIn this way, it is possible to measure the differential acceleration between the two bodies and hence infer the\ntidal stresses (by factoring the inter mass spacing). With\nsuch an instrument, we suggest it could be possible to\nobserve the onset of MONDian behaviour (rather than\nat the scales present at galaxies, where MONDian behaviour will dominate the dynamics) in the low acceleration regime around these SP. The purpose of this paper\nis extend previous analyses done for the modified gravity\nsaddle point science case, based upon a scenario where\n\n∗ Electronic\n\naddress: ali.mozaffari05@imperial.ac.uk\n\nan LPF mission extension is granted. This would involve redirecting the spacecraft from its location parked\nat Lagrange point L1 to a saddle of the Sun-Earth-Moon\nsystem [7] once its nominal mission is completed. Previous analysis have considered non-linear theories with\nmodified Poisson equations, which naturally give rise to\nmodified gravity behaviour (as seen most clearly in [8]).\nA review of the different non-relativistic limits of preferred acceleration scale theories [5] categorised these as\ntypes I, II and III (we summarise these briefly in Appendix A). In this work, we examine type II theories,\nwhere the dynamics are governed by a physical potential\nΦ, composed of Φ = ΦN + φ, with the usual\n∇2 ΦN = 4πGρ\n\n(1)\n\nThe field φ is ruled by a driven linear Poisson equation\nk\n∇ * (ν(w)∇ΦN )\n4π\n\n∇2 φ =\n\n(2)\n\nwhere the argument of free function ν is given by\n\u0012\n\n\u00132\nk\n|∇ΦN |\n(3)\n4π\na0\n√\nand we require that ν ∼ 1/ w for w ≪ 1 and that ν →\nconstant when w ≫ 1. Consider now just writing\nw=\n\n∇2 Φ = ∇ * (ν̂(w)∇ΦN )\n\n(4)\n\nκ\nwhere ν̂ = 1 + 4π\nν. We can divide our theories into two\ndistinct subclasses, where crucially\n\nν→0\nν→1\n\nIIA\nIIB\n\n(5)\n(6)\n\nType IIB theories in the large acceleration regime have\nGren = G(1 + κ/4π), due to the scalar field mimicking\nκ\na rescaled Newtonian potential φ → 4π\nΦN . In IIA theories, it can be argued we need only a single physical\npotential Φ and Newtonian field ΦN plays only an auxiliary role (and so κ need not appear at all) - meaning\nthere is no G renormalisation. As pointed out in [5], the\n\n\f2\neffect of which is that the triggering of MONDian effects\nwould happen at atrig = a0 (at a distance of r ∼ 2.2m\nfrom the saddle). With such a tiny bubble, these theories would escape the net of an LPF test, at least for the\nEarth-Sun system. With this in mind, we will stick to\ntype IIB theories here, the case for testing other types of\nMONDian theory have been considered separately [5, 9].\nSimilarly, we stress that it is important that we consider\nformulations wedded to fully relativistic theories (rather\nthan just a scalar Lagrangian theory like AQUAL [10]),\neven though we are not directly testing these full theories\nthemselves. Their cosmologies however, do provide the\nnecessary constraints on the gravitational constant G, the\nbare value of G appears in the Friedman equations and\nso from BBN constraints can be fixed. As we will see,\nthis issue is not a trivial one in modified gravity theories.\nDeriving the full field equations and taking the weak field\nlimit as necessary allows us to find the modified Poisson\nequations for these theories consistently. To this end, we\nwill consider a theory arising from BiMOND [11]. Additionally readers should consider the cosmologies of these\ntheories, as suggested in [12].\nThe structure of this paper is as follows, we firstly consider analytical and numerical solutions from solving this\ntheory around the Earth-Sun SP. Next we move onto consider the integrated signal to noise ratio (SNR) as a measure of how sensitive the LPF instruments will be, the\nmain results of which are contained in Figures 3 and 4.\nA look at converting a null signal into a constraint on the\nparameter space of our theories is the subject of Section 2\n- seeing whether we could differentiate between different\nmodified gravity theories. Finally Section 4 looks at parameterised approaches to these theories and looks to the\nfuture. We leave detailed derivations and computational\nmethods to the appendices.\n\n2.\n\nSolutions, Tidal Stresses and Signal to Noise Ratios\n\nIn this analysis, we will make use of both analytical\nand numerical results. We suggest using a free function\nν of the form\nν=\n\n\u0012\n\n1\n1+ 2\nw\n\n\u00131/4\n\n(7)\n\nWe outline in Appendix B some reasons for this choice\nand with it we solve Equation ?? around the SP (recalling\nwe are free of sources),\n\n∇2 φ =\n\n\n\n\n\nκ \nκ\n\n2\nΦ + ∇ν * ∇ΦN \n∇ * (ν∇ΦN ) =\nν ∇\n| {z N}\n4π\n4π\n=0|SP\n\nWe can approximate the Newtonian near to the SP with\na linear profile, which in spherical coordinates takes the\n\nform,\nFN = −∇ΦN = ArN = Ar(Nr er + Nψ eψ )\n1\nNr = (1 + 3 cos 2ψ)\n4\n3\nNψ = − sin 2ψ\n4\n\n(8)\n\nUsing this form of the Newtonian field as our source,\nwe proceed to solving the resulting system of equations.\nRecall that the we have both a deep MONDian (DM)\nregime, close to the saddle where w ≪ 1 and an quasiNewtonian (QN) regime further out, where w ≫ 1. Separating these will be a boundary which using the linearised\nNewtonian we can find,\n\u0010 κ \u00112 Ar|N|\n= 1\n(9)\nw=\n4π\na0\n\u0012\n\u0013\n\u0012\n\u00132\n1\n16π 2 a0\n2\n2\n2\n2\nr cos ψ + sin ψ = r0 =\n(10)\n4\nκ2 A\nAs such we find an ellipsoidal (or bubble shaped) boundary, with semi-major axis which we denote r0 . Solving\nthe system, for the particular choice of ν(w), we have for\nthe inner bubble,\n\u0012 \u00130.5\n4πa0 r\n(Fr er + Fψ eψ )\n− ∇φ =\nκ\nr0\nFr ≈ 0.0354 + 0.2829 cos 2ψ − 0.0162 cos 4ψ\nFψ ≈ −0.3772 sin 2ψ − 0.0432 sin 4ψ\n(11)\nand similarly for the outer bubble\n\u0014\n\u0015\nr\n4πa0 r0\n(Fr er + Fψ eψ ) + N\n− ∇φ =\nκ\nr\nr0\nFr = 1\nFψ ≈ −0.5752 sin 2ψ + 0.4652 sin 4ψ\n\n(12)\n\n(The full calculational details are left to Appendix B).\nNow we can consider numerical solutions, using a relaxation code to solve (2) on an adaptive lattice. Such a code\nwas first employed to study these theories in [4] and subsequently adapted for more general free functions in [8].\nIn Appendix C, we detail the modifications required for\nthis work. Consider the Earth-Sun saddle, using a 2573\nlattice of physical size 104 km with a typical central resolution of ∼2.6 km. Running the code delivers us predictions for the modified forces close to the saddle, which as\nFigure 1 shows are a good match to analytical solutions\nin their respective domain and provide the appropriate\ninterpolation in the intermediate region. Next consider\nthat LPF is sensitive to differential acceleration, from\nwhich we can infer the tidal stresses of our signal. Note\nalso that the φ field produces both a MONDian effective\nfield and a rescaled Newtonian component. Taking these\ninto account, the observable tidal stress will be of the\nform\nSij = −\n\n∂ 2φ\nk ∂ 2 ΦN\n+\n∂xi ∂xj\n4π ∂xi ∂xj\n\n(13)\n\n\f3\n1\n\nnumerical ψ=0\nnumerical ψ=π\nanalytical (deep−MOND)\nanalytical (quasi−Newtonian)\n\n10\n\nType I\nType IIB\nNewtonian\nNoise\n\n−12\n\n10\n\n0\n\nκ |gr| / a0\n\nASD s−2 / Hz−1/2\n\n10\n\n−1\n\n10\n\n−13\n\n10\n\n−14\n\n10\n−2\n\n10\n\n−2\n\n10\n\n−1\n\n10\n\n0\n\nr / r0\n\n10\n\n1\n\n10\n\nIt is important that we know both field components to the\nsame degree of accuracy or systematic errors can crop up\ndue to the imperfect subtraction of the Newtonian field.\nUsing the techniques of noise matched filtering from gravitational wave searches [13], we can compute the Signal\nto Noise Ratios (SNR) of these anomalous tidal stresses\nwith LPF. The basic idea laid is to correlate a time series x(t) with an optimized template designed to provide maximal SNR, given the signal shape h(t) and the\nnoise properties of the instrument. Whilst the specifics\nof the instrument noise won't be known properly until\nthe satellite is in situ, there exist nominal requirements\nthat it must meet [14], as well as best estimates for the\nnoise signal waveform. In our setup, we align the line\njoining the Sun-Earth as our x axis, such that we have\ntrajectories of the form\n(14)\n\nwhere v is the velocity of the spacecraft, b is the impact\nparameter and t = 0 corresponds to the point of closest\nsaddle approach. In a more general setup, for an approximately constant velocity v, a closest approach vector b,\nand with the masses aligned along unit vector n,\nh(t) = ni nj Sij (b + vt)\n\n−3\n\n−2\n\n10\n\n10\nf / Hz\n\nFIG. 1: A comparison between the numerical and analytical\nresults for a component of g = −∇φ around the Earth-Sun\nsaddle.\n\nh(t) = Syy (vt, b, 0)\n\n−4\n\n10\n\n(15)\n\nThe maximal SNR, realised by correlating the optimal\ntemplate with the noise, is found to be\n\n\n2 1/2\nZ ∞\nh̃(f\n)\n\n\nρopt = 2 \ndf\n(16)\n\nS\n(f\n)\nh\n0\n\nwhere h̃(f ) is the Fourier transformed signal waveform\nand Sh (f ) is the noise waveform in Fourier space. To\n\nFIG. 2: ASD plot of the MONDian and rescaled Newtonian\nsignals, along with the noise profile. Using the parameters\nb = 50km fly-by and v = 1.5 ms−1 , we compare between type\nI and IIB theories, finding in this scenario SNRs of 28 and 35,\nrespectively.\n\nmake this analysis concrete, consider a flyby at b = 50km.\nWe plot the noise and signal, terms of amplitude spectral\ndensity (ASD), which is simply square root of power spectrum, in Figure 2. As we see, there is ample signal compared√to idealised noise (here with baseline 1.5 × 10−13\ns−2 / Hz). This scenario gives an SNR of 35 and for\ncomparison a type I signal is presented giving an SNR\nof 28 - note the differences in the behaviour at low and\nhigh frequencies. The larger SNR here stems from the\nPoisson equation being linear in ∇φ and hence there are\nno associated curl forces (which generally exist in nonlinear theories). These will produce a softening of the\ntidal stress divergence, since this is not present here, we\nfind a larger signal. We produce in Figure 3 contours for\ntypical SNRs produced at various impact parameters and\nbaseline noises, as well as present a comparison of contours from different theories - observing that type IIB\nbeats type I on SNR. As Figure 2 shows, the position of\nthe signal in fourier space is exactly where noise is lowest. This highlights an uncanny coincidence, given that\nthe accelerometer aboard LPF has a non-white noise profile, dipping in the region of the mHz (on the rough time\nscale of minutes). The motivation for such a design lies\nin the gravitational wave signals to be targeted by LISA it just happens that the MONDian bubbles of anomalous\ntidal stresses around the Earth-Sun-Moon saddles are of\nlength scale ∼ 103 km and free-falling bodies around this\nregion have a typical speed of ∼ 1 km s−1 . Put together,\nthis suggests the time scale for crossing a MONDian bubble would be on the order of minutes - right where the\ninstrument performance is optimal.\n\n\f4\n(taking an upper bound from a SNR = 1 result) at some\nacceleration. We can then convert this into a restriction\non the ν parameter space - clearly the SP bubble clearly\nwill have to shrink. We start by fixing the\n√ asymptotica,\nthe astrophysical regime gives us ν ≈ 1/ w for FN ≤ a0 .\nFar from the SP, we will have the ν ≈ 1 regime, but in\nthe intermediate regime between the two (which we will\nbe probing), lets suggest a model such as:\n\n−14\n\nNoise ASD s−2 / Hz−1/2\n\nx 10\n\n10\n\n5\n\n1.5\n\n√\nν ≈ 1/ w\n\n1\n\nν≈\n35\n6055 50 45 40\n\n30\n\n25\n10\n20\n\n0.5\n0\n\n100\n\n200\n\n300\nb / km\n\n400\n\n15\n\n500\n\n600\n\n−14\n\nNoise ASD s−2 / Hz−1/2\n\nx 10\n\n1.5\n\n\u0013n\n\nν≈1\n\n60\n\n20\n\n100\n\n200\n\n300\nb / km\n\n400\n\n500\n\n600\n\nFIG. 3: Top panel, SNR contours for various impact parameters and baseline ASD noise, for v = 1.5 kms−1 . Calamitous\nassumptions would still lead to SNR in excess of 5. More optimistic ones (b around 50km or less, noise half way up the\nscale) would lead to SNRs easily around 55. Bottom panel,\na comparison of SNR contour lines between type I and IIB\ntheories. The solid lines are the typical SNR to be obtained\nin IIB theories and the dashed lines to their immediate left\nthe corresponding type I line - as we see IIB beats I.\n\n3.\n\nDesigner ν functions\n\nIt is very easy to construct free functions which mimic\nparameterised galactic μ̃ functions [15], for instance\nw−1/2\n\n(17)\n1+\n√\ngiving the usual ν → 1/ w in the DM regime but moving\nto a different power law, ν ∼ 1/wn (tunable by the value\nof α) for larger accelerations. We can attempt the exercise of designing a free function, based on a null result\nν=\n\nw<\n\nfor\n\n\u0012\n\nk\n4π\n\n\u0012\n\nk\n4π\n\n\u00132\n\n\u00132\n\n< w < wtrig (19)\n\nw > wtrig\n\nfor\n\n(18)\n\n(20)\n\nwhere the point when non-Newtonian behaviour in φ is\ntriggered can be interchangeably pinpointed by:\n\u0010 κ \u00112− n1\n4π\n\u0010 κ \u00111− n1\n= a0\n4π\n\u0010 κ \u0011− n1\n= a0\n4π\n\nwtrig =\n\n(21)\n\natrig\nφ\n\n(22)\n(23)\n\nWe still have that when aN < a0 , the field φ dominates\nΦN - as per our requirements. However now the intermediate region where φ hasn't yet dominated but is already non-Newtonian is in a narrower band of accelerations a0 < aN < atrig\nN . As a result, the MOND bubble\nshrinks in this model according to\n\n10\n\n0.5\n0\n\nwtrig\nw\n\natrig\nN\n40\n\n1\n\n\u0012\n\nfor\n\n4πα n−1/2\nκ w\n\nr0 ≈ 383\n\n\u0010 κ \u0011 2n−1\nn\nkm\n4π\n\n(24)\n\nThis result shows that for a given null measurement up\nto some acceleration atrig\nN , using this general argument,\nour constraints between type I and IIB theories will be\ndifferent. In this case, the bubble size would be expected\nto shrink more than in the type I case (where the exponent is just n−1\nn [5]), given the sharper divergence in\nthe tidal stress (and so larger signal) and this is exactly\nwhat (24) suggests. Thus our naive expectation that the\nbubble would be smaller, given the stronger signed expected, compared to type I theories turns out to be true.\nOne issue that we come up against here is that because\nof there are many varying transients from ν → 1, making a model dependent statement is beyond our reach quite simply because a null result only lets us probe the\nregime of b ≫ r0 (n). Performing an order of magnitude\nargument however is possible using a designer function,\n\u0012 trig \u0013n\nw\nν(w) = 1 +\n(25)\nw\nAssuming spherical symmetry\nFφ =\n\nk\nν FN\n4π\n\n(26)\n\n\f5\nnotice that in the requisite limits\n\n−14\n\nx 10\n\n0.94\n\nNoise ASD s−2 / Hz−1/2\n\n0.97\n0.91\n\n1.5\n\n1.06\n\n0.88\n0.91\n\n0.91\n1.09\n1.03\n1\n\n0.97\n\n0.94\n\n2\n\n10\n\n10\nb / km\n\nbreaking this up into a background contribution and a\nmodified part\nFφ = 0 Fφ + δFφ\nκ\n4π FN .\n\nδFφ =\n\n(27)\n\nSubstituting in and solving gives\n\nk\n(ν − 1) FN ≃\n4π\n\n\u0012\n\na0\n|FN |\n\n\u0013n\n\nFN\n\n(28)\n\nfrom which the tidal stresses can be inferred. Figure 4\nshows the resulting values of n required for a SNR =\n1 result. As we see, the dynamics here are somewhat\ndifferent which opens up the future possibility of letting\nus differentiate between type I and IIB theories. A result\nin one theory could be considered \"unnatural\" but could\npossibly viable in another.\n\n4.\n\nParameterised Free Functions\n\nOther questions to be asked include what inferences\ncan we make from data if LPF detects anything (after\nruling out systematics and noise). Is it possible to pick\nout particular features of our free functions? Would there\nbe a way to potential discriminate between different types\nof theory? Here we seek to address some of these briefly.\nFirstly, lets develop a parameterised ν(w), which will act\nas a prototype for further discussions,\nν=\n\n\u0012\n\n1 + wb\nwb\n\n\u0013\u0012\n\u0012\n\u0010 r \u0011b \u0013a/b−1\n∂N Nψ\n0\n1+\nNr +\n∂ψ N\nrN\n\n≃ C1 rc−2 Sc (ψ) + . . .\n\n(32)\n\nAn ansatz for the leading order contribution takes the\nform\nφ = C1 rc F (ψ)\n\nFIG. 4: Contours of the power n needed to obtain SNR = 1\nfor different impact parameters and noise levels, upto b = 400\nkm using our designer free function.\n\nwhere 0 Fφ =\n\n4πa0 a r0b−1\n∇ φ =\nκ rb N b\n2\n\n0.94\n\n1\n\n\u0013a/b\n\n(31)\n\n0.88\n\n0.97\n\n1.15\n\n(30)\n\nThis reduces back to MOND for the case of a = 12 and b ≥\n1, but otherwise opens up the parameter space. Equation\ntype II Laplacian has the form\n\n1\n\n1.12\n\nν ≃\n\nw ≫ 1,\n\n0.85\n\n0.94\n\n1.03\n\n1\n\n0.5\n\n1\n+ ...\nwa\na 1\nν ≃ 1+\n+ ...\nb wb\n\nw ≪ 1,\n\n1\n\n(29)\n\n(33)\n\nwith the profile function F (ψ) satisfying the ODE\nc(c + 1)F + F ′ cot ψ + F ′′ = Sc (ψ)\n\n(34)\n\nNote this satisfies the equations b 6= 2 and we will consider the b = 2 case separately later. The constant and\nsource terms are given by\n4πa0 c−3\nr\nκ \u00120\n\u0013\n∂N Nψ\n1\nN\n+\nSc (ψ) =\nr\nN c−2\n∂ψ N\nC1 = a\n\n(35)\n(36)\n\nsuch that in each regime\nc=2−a\nc=2−b\n\nw≪1\nw≫1\n\n(37)\n(38)\n\nWith these in mind, we can solve the inhomogenous\nODE, as before, to find the variation in profile functions\nfor different a, b. To make a connection with other modified force laws [8], consider under spherical symmetry:\n\u0012\n\u0013n\n\u0010 κ \u0011 1−n\nn\n1\nκ Fφ\nκ\n1+n\nFNn+1 a0n+1\nFN ⇒ Fφ =\nFφ =\n4π a0\n4π\n4π\n\u0013−a\n\u0012\u0010 \u0011\n\u0010\nκ\nκ 2 FN\nκ \u00111−2a 1−a a\nFN a0\nFφ =\nFN =\n4π\na0\n4π\n4π\n(39)\nand so let us, without loss of generality, parameterise\na→\n\nn\nn+1\n\n(40)\n\nThis means the choice of √\nn = 1 ⇔ a = 1/2 gives the\nrequired force law Fφ = FN a0 and some n > 1 will\nparameterise deviations from it. We illustrate different\nchoices of b, n in Figure 5. The take home message from\nthis analysis is that in the strongly modified regime of\nthe inner SP bubble, there is little variance between the\n\n\f6\n0.4\n\nF2/3\n0.2\n\n−0.1\n\nwhere C2 = C1 /2. Although slightly complicated, this\nexpression demonstrates that in the regime where the\nlinear Newtonian 8 can be applied, there is a neat separation of variables between radial and azimuthal functions. Notice that in all these models, the stresses will\nbe divergent since c < 2, ∀a, b > 0. For the b = 2 case,\n\u0012\n\u0012 \u0013\n\u0013\n4πa0\nr\nφ =\nr0 ln\n+ H(ψ)\n(42)\nκ\nr0\n\u0001\n4πa0\nSyy = − 2 r0 cos 2ψ − sin 2ψF ′ + cos2 ψF ′′\nκr\n(43)\n\n−0.4\n\nlim Sc = −2c−3\n\n(44)\n\nFor 0 < a < 1, Sc remains relatively unchanged compared to b > 0 where Sc becomes increasingly singular at\nψ = π/2 for increasing b. Observe that Syy ∼ r−# where\nν → w# , w ≪ 1 or ν → 1 − wC# + . . . , w ≫ 1 whereas\nin the type I case [8], Syy was found to scale much more\nconservatively in the DM regime.\n5.\n\nF4/5\n\n0\n\n−0.2\n\nψ→π/2\n\nF3/4\n\n0.1\n\nSyy = C2 rc−2 ((c − 2) cos 2ψ − c) cF\n− 2 cos ψ (2(c − 1) sin ψ F ′ + cos ψ F ′′ )) (41)\n\nwhere H(ψ) is a function solved by the second order\nODE (34) sourced by (36). The main reasoning behind\nthe invariance of profile functions in the low acceleration\nregime and the Smörgåsbord of solutions in the other\nstems from the behaviour of the source term\n\nFNewt\nF1/2\n\n0.3\n\nFn\n\npotentials - the main difference is from the radial exponent. This means one can expect the magnitude of any\nresulting anomalous tidal stresses to be different rather\nthan the shape of the time series. This has an impact on\nthe noise matched filtering techniques of Section 2, as the\nspace of inner bubble templates can effectively be significantly reduced. With this generalised approach, consider\nthe tidal stresses Syy computed by employing a change\nof variables\n\n−0.3\n\n−0.5\n0\n\n0.5\n\n1\n\n1.5\nψ\n\n2\n\n2.5\n\n1.5\n\n3\n\nFNewt\nF1\nF2\n\n1\n\nF3\nF4\n\nFn\n\n0.5\n\n0\n\n−0.5\n\n−1\n\n−1.5\n0\n\n0.5\n\n1\n\n1.5\nψ\n\n2\n\n2.5\n\n3\n\nFIG. 5: The angular profile functions F for the inner (top\npanel) and outer (bottom panel) bubble regions, alongside\nthe linear Newtonian potential profile FNewt . The values of\na, b are used to label each function. The results clearly show\nthe relative invariance of the inner bubble potential profile\nfunctions compared to the significant differences for the outer\nbubble.\n\nConclusions\n\nOur investigations have shown how a LPF saddle flyby\ncould either detect modified gravitational behaviour to a\nhigh SNR or place stringent constraints on it. With an\nappropriate noise model, SNRs ≥ 35 could be expected\nmissing the saddle by 50km or less (a larger figure than\nwould be expected from type I theories). The question\nthen arises as to how generic this conclusion is, or conversely, should a negative result be found what can be\nsaid about these theories. Predictions for what happens\ninside the bubble are found to be model independent,\nthe tidal stress anomalies outside the bubble however do\ndepend on the transient from the modified into the Newtonian regime, with a model dependent fall-off. Thus for\nimpact parameters smaller than r0 the predicted SNRs\n\nare robust and do not change substantially - the currently expected case is b ≤ 10 km (with r0 ∼ 383 km). A\nway therefore for such theories to wriggle out of a negative LPF result would be to change the bubble size.\nThis could be accomplished with a \"designer\" function\n- giving the free function two scales and two power-laws\nbefore reaching the rescaled Newtonian regime. Furthermore the effects inside the bubble are different from type\nI predictions, but generically stronger. This stems from\ntype II theories lack of curl field, a feature which appears\nto soften out the anomalous stresses. This results generically in larger SNRs between type I and IIB theories. As\nwe see applying the same arguments between the two theories results in different constraints and the bubble size\ngenerically being smaller here compared to type I for a\n\n\f7\nnull result. By considering a generalised approach to free\nfunctions, we find inner and outer bubble solutions and\nconsidered the scaling of the tidal stress with parameters\nextracted from the free functions. The main result being that in the DM regime, our angular profile functions\nbecome relatively invariant between models, making the\nprospect of extracting features of ν from potential data\ninteresting - the main contribution being the radial parameter and its associated exponent. The divergence of\nthe tidal stresses scale much quicker for a given ν(a, b)\ncompared to the corresponding μ(a, b) models of type I\ntheories. These models suggest that tying a result to\neither type I or IIB theories is in principle viable - differentiating between the two theories is a realistic prospect,\nour imagination is only limited to the theories we develop.\nAcknowledgments\n\nThe author would like to thank João Magueijo, Tim\nClifton, Johannes Noller and Dan Thomas for useful discussions and suggestions. The author thanks the STFC,\nDepartment of Physics and Centre for Co-Curricular\nStudies, Imperial College for financial support during the\nvarious stages of this work. Numerical work was carried\nout on the COSMOS supercomputer, which is supported\nby STFC, HEFCE and SGI.\n\nThe argument of μ(z) is given by\nz=\n\nor equivalently the form of Newton's constant is\naltered\n\u0010\nκ\u0011\nGren → Ξ +\nGN\n(A5)\n4π\n\nCosmology sets bounds on the variation of G, from\nBBN and effects in the CMB [19, 20].\nAdditionally these two fields mean that the Newtonian behaviour is always present in the nonrelativistic regime and non-linear behaviour in φ\ngets triggered at a certain acceleration\n\nAppendix A: Classifying MONDian theories\n\n• Type I: Here the total potential acting on nonrelativistic particles is given by the sum of the usual\nNewtonian potential ΦN and a fifth force field, φ:\nΦ = ΞΦN + φ\n\n(A1)\n\nwhere Ξ is some constant usually set to unity and\nthe Newtonian potential satisfies the usual Poisson\nequation ∇2 ΦN = 4πGρ, and the field φ is governed\nby:\n∇ * (μ(z)∇φ) = κGρ\n\n(A2)\n\n(A3)\n\nwhere κ is a dimensionless coupling constant. μ is a\nfree function, typically chosen limits of the theory\nare μ → 1 when z ≫ 1 and μ ≃ z for z ≪ 1.\nThe effect of these fields is twofold, in the large z\nκ\nregime, φ → 4π\nΦN mimicking the Newtonian, this\nmakes the physical potential have the form\n\u0010\nκ\u0011\n∇ΦN\n(A4)\n∇Φ → Ξ +\n4π\n\natrig =\n\nOur job is to approach theories where such modified behaviour is present and see if they represent good\nprospects for detection. Their complexity and differences\narise from the requirement that they should explain relativistic phenomena (such as lensing and structure formation) without appealing to dark matter, whilst in the nonrelativistic regime have some Newtonian and other modified limit. The manner in which such effects are manifest\nmay however vary widely and there have been many previous studies as to the phenomenology of these ideas, particularly in this non-relativistic regime [5, 9, 11, 16, 17].\nWe will briefly outline some of these here, with the caveat\nthat this list is neither exhaustive, nor represents the final story on gravity theories at the time of writing and\nfor a more in depth look at gravity theories, we point the\nreader towards [18].\n\nκ |∇φ|\n4π a0\n\n\u0012\n\n4π\nκ\n\n\u00132\n\na0\n\n(A6)\n\nThe field however remains sub-dominant until\naN = a0 and this is when fully modified behaviour\nis seen (in the galactic regime). It is this onset of\nnon-linearity that we hope to probe with LPF.\n• Type II: These are similar in set-up to type I,\nwith Φ = ΦN + φ and φ governed by a driven linear\nPoisson equation:\n∇2 φ =\n\nκ\n∇ * (ν(w)∇ΦN )\n4π\n\n(A7)\n\nThe argument of ν is given by\nw=\n\n\u0010 κ \u00112 |∇Φ |\nN\n4π\na0\n\n(A8)\n\nOnce again ν is a free\n√ function and typically we give\nit the form ν ≃ 1/ w for w ≪ 1 and ν → constant\nfor w ≫ 1.\nWe divide this up in the subtypes of IIA or IIB\nwith qualitatively very different implications, which\ncan we seen more clearly if we return to using the\nphysical potential form\n∇2 Φ = ∇ * (ν̂∇ΦN )\n\u0010κ\u0011\nν̂ = 1 +\nν\n4π\n\nConsider in the large w regime:\n\n(A9)\n(A10)\n\n\f8\n– In type IIA, ν → 0 which implies no G renormalisation occurs and atrig = a0 . The whole\ntheory in fact hinges on Φ, all other fields are\nconsidered auxiliary.\n\nwith the natural comparison between\n\n– In type IIB, ν → 1 means a trigger acceleration similar to type I.\n\nWe will be inspired by the form of the type I free function\nμ considered previously [3, 4, 8], which satisfied\n\nμ(z) ←→\n\n• Type III: Crucially, here non-relativistic particles\nare sensitive to a single field Φ, satisfying a nonlinear Poisson equation:\n∇ * (μ̃(x)∇Φ) = 4πGρ\n\n(A11)\n\nwhere z =\n\nκ |∇φ|\n4π a0 .\n\nx=\n\n|∇Φ|\na0\n\n(A12)\n\nso that μ̃ → 1 when x ≫ 1 and μ̃ ∼ x for x ≪\n1. Again no renormalisation of G and a trigger\nacceleration atrig = a0\nAs the trigger acceleration sets the scale of the SP\nbubble, using the current estimates for our parameters\n(κ = 0.03, a0 = 10−10 ms−1 ) we find these to be\natrig =\n\n\u0012\n\n4π\nκ\n\n\u00132\n\natrig = a0 = 10\n\na0 ≃ 10−5 ms−2 ⇒ r0 ∼ 383 km\n−10\n\nms\n\n−2\n\n⇒ r0 ∼ 2.2 m\n\n(A13)\n\nThese distinctions group together types I and IIB as the\nbest candidates for detection with LPF; types IIA and\nIII would easily escape any negative result.\nAn important distinction here stems from the fact that\nwe have a curl term (often called a magnetic field) in type\nI and III theories. This is easiest seen when one attempts\nto linearize the non-linear Poisson equations present by\nintroducing an auxiliary vector field (e.g. μ∇φ for type\nI theories) - such a field has non-zero curl. The same is\nnot true for type II theories, being already linear in φ\nand driven by a function of the Newtonian field, ν∇ΦN ,\n(a quantity which has a curl). This turns out to have\na significant quantitative effect upon the magnitude of\nthe saddle tidal stresses, as the magnetic field is known\nto soften the anomalous tidal stresses around the saddle\npoints in type I theories.\n\nAppendix B: Analytical Arguments\n\nOur plan will be to consider functions similar to those\ninvestigated for type I theories and so easily compare\nbetween the two. We start with the idea that under the\nassumption of spherical symmetry\nκ\nκ\n∇ * FN ⇒ μFφ =\nFN\n4π\n4π\nκ\nκ\n∇ * (νFN ) ⇒ Fφ =\nνFN\n∇ * Fφ =\n4π\n4π\n\nμ\np\n=z\n1 − μ4\n\n(B2)\n\nIn the z ≫ 1 limit,\nμ≃1−\n\nwhere the argument of μ̃ is\n\n1\nν(w)\n\n1\n+ ...\n4z 2\n\n(B3)\n\nwhich suggests in the analogous w ≫ 1 limit, we need a\nfunction satisfying\nν ≃1+\n\n1\n+ ...\n4w2\n\n(B4)\n\nUsing the definition of z, under spherical symmetry\n\u0010 κ \u00112 |∇Φ |\nκ |∇φ|\nN\n= ν\n= νw\n(B5)\nz=\n4π a0\n4π\na0\nμ\n1/ν\np\n= p\n= νw\n(B6)\n4\n1 + 1/ν 4\n1−μ\n\nwhich we can solve to find\n\u00131/4\n\u0012\n1\nν = 1+ 2\nw\n\n(B7)\n\nand note in the quasi Newtonian regime, this mimics the\nbehaviour of (B4). Whilst we stress this derivation is\nonly strictly valid for spherical symmetry, it remains a\ngood starting point for comparison between these theories. Next we expand the Poisson equation\n\n\n∇2 φ =\n\nκ\nκ \n\n2\nΦ + ∇ν * ∇ΦN \n∇ * (ν∇ΦN ) =\nν ∇\n| {z N}\n4π\n4π\n=0|SP\n\nand then use the linear Newtonian approximation,\n\nFN = −∇ΦN = ArN = Ar(Nr er + Nψ eψ )\n1\nNr = (1 + 3 cos 2ψ)\n4\n3\n(B8)\nNψ = − sin 2ψ\n4\nRemembering that the characteristic MONDian bubble\nsize, denoted r0 , is given by the expression\n\u0012 \u00132\n4π\na0\nr0 =\n(B9)\nκ\nA\nSuch that we can write\n\n∇ * (μ Fφ ) =\n\n(B1)\n\nw=\n\nr\nκ2 |∇ΦN |\n= N\n2\n16π\na0\nr0\n\n(B10)\n\n\f9\ngiving us the form of the source term\nNr\nNψ ∂N\n+ 3/2\n1/2\n∂ψ\nN\nN\n\n\u0013\n\n1\n\n1+\n\n\u0012\n\n\u00132 !−3/4\nrN\n(B11)\nr0\n\nThe problem here is akin to electrostatics, solving the\nequations subject to the boundary conditions that δFψ\nvanishes (and δFr equate) at ψ = 0 and π, such that we\navoid a jump in the field at ψ = π/2.\n\n0.8\n0.6\n0.4\nFn, Nr\n\n4πa0 /κ\n∇2 φ = √\n4rr0\n\n\u0012\n\n0.2\n0\n−0.2\n\na.\n\nDM Regime\n\nFII\n\n−0.4\n\nFI\n\nFor r ≪ r0 , it's clear Equation (B11) reduces to:\n4πa0 /κ\n∇ φ= √\n4rN r0\n2\n\n0\n\n\u0012\n\u0013\u001a\n\u001b\nNψ ∂N\n3 2\nNr +\n1 − w + ...\nN ∂ψ\n4\n(B12)\n\n7 + 9 cos 2ψ\n= g(ψ)\n(2(5 + 3 cos 2ψ))5/4\n\n0.2\n\na\n\nφ = C1 r F (ψ)\n\n1\n\n1.5\nψ\n\n2\n\n2.5\n\n3\n\n0.8\n0.6\n\nThe separable form of the source suggests an ansatz of\n\n0.5\n\n1\n\nwhere the angular functions of the leading order term\nneatly reduce to\n\n0.4\n\nGn, Nψ\n\n(B13)\n\nNr\n\n−0.6\n\n0\n−0.2\n\n(B14)\n\n−0.4\n\nwhere C1 is a constant, the exact form of which is fixed\nfrom the source term. This gives rise to a sourced second\norder ODE:\n\n−0.6\n\nGII\n\n−0.8\n\nGI\n\nra−2 (a(a + 1)F + cot(ψ) F ′ + F ′′ ) = r−1/2 g(ψ) (B15)\nwhere ′ = ∂/∂ψ and\n4πa0\nC1 = √\nκ r0\n\n(B16)\n\nWe find that the solutions of the homogenous equation\nare Legendre Polynomials of order a, with the form of\n(B15) suggesting a = 3/2 and the inhomogeous solution\nis found to be\nF ≈ −0.0236 − 0.1886 cos 2ψ + 0.0108 cos 4ψ (B17)\nWe can then compute the components of the MONDian\nforce\n\u0012 \u00130.5\n4πa0 r\n− ∇φ =\n(Fr er + Fψ eψ )\nκ\nr0\nFr ≈ 0.0354 + 0.2829 cos 2ψ − 0.0162 cos 4ψ\nFψ ≈ −0.3772 sin 2ψ − 0.0432 sin 4ψ\n(B18)\nand we compare angular profile functions for type I and\nIIB solutions in Figure 6. We see from the form of the\nMONDian force,\n\u0012 \u0013p\n4πa0 r\nδF = −∇φ =\nS(ψ) ⇒ Sij ∝ rp−1\nκ\nr0\n\n−1\n0\n\nNψ\n0.5\n\n1\n\n1.5\nψ\n\n2\n\n2.5\n\n3\n\nFIG. 6: The angular profile functions F and G for the inner\nbubble forces in both type I and type IIB theories, alongside\nthe linear Newtonian radial and azimuthal angular profiles.\n\nwhere in type I, p ≃ 0.764 and in type IIB, p = 0.5 clearly the tidal stresses will have a sharper divergence as\nwe approach the SP. This is due to the modified Poisson\nequation being linear in φ and so with no curl forces\npresent, the inner bubble solutions are not softened as\nthey are in a non-linear theory.\nIn addition, at the saddle we have region where |gN | =\n0 and so we need to consider solutions to the Laplace\nequation\n∇2 φL = 0\n\n(B19)\n\nwhich subject to smoothness and continuity conditions\nbeing satisfied and regularity at the origin, can be written\nin general by\nφL =\n\n4πa0 X\nAl rl P2l (cos ψ)\nκ\nl\n\n(B20)\n\n\f10\nwhere P2l (cos ψ) are Legendre polynomials,\nAl =\n\nal\nr0l−1\n\nwhere Hn (ψ) satisfies the sourced ODE\n(B21)\n\nQN Regime\n\nFor r ≫ r0 , we find (B11) reduces to:\n\u0013\u001a\n\u0012\n\u001b\n4πa0 r0\n3 1\n∂N Nψ\n2\n∇ φ=\n1−\nNr +\n+ ...\nκ 2r2 N 2\n∂ψ N\n4 w2\n(B22)\nwhere at leading order, we label the source term\n2(7 + 9 cos 2ψ)\n= h(ψ)\n(5 + 3 cos 2ψ)2\n\n(B23)\n\nIn order to satisfy our boundaries conditions, our ansatz\nfor the leading term needs to be of the form\n\u0012 \u0013\nr\n(B24)\nφ2 = C1 H2 (ψ) + C2 ln\nr0\nComputing the Laplacian gives\n4πa0 r0 h(ψ)\nC2\nC1 1 ∂\n(sin H2′ ) + 2 r0 =\n2\nr sin ψ ∂ψ\nr\nκ\nr2\n(B25)\nallowing us to set\n4πa0 r0\nC1 = C2 r0 =\nκ\n\n(B26)\n\nIntegrating out once then gives\nZ\n∂H2\nsin ψ\n= (h − 1) sin ψ dψ + A\n∂ψ\n\n(B27)\n\n(B28)\n\nH2 ≈ −0.2292 + 0.2876 cos 2ψ − 0.1163 cos 4ψ (B29)\nExpanding to higher terms will result in the series\nφ = φ2 +\n\n4π\na0\nCn\nk\nn=2\n\nr\nr0\n\nHn (ψ) +\n\nκ\nΦN (B30)\n4π\n\n(B32)\n\nκ Ar2 N r\n4πa0 r2\nκ\n(1+3 cos 2ψ) (B33)\nΦN = −\n=−\n4π\n4π\n2\nκ 8r0\nwhich obviously is the dominant contribution in the\nr/r0 ≫ 1 limit.\n\nAppendix C: Adaptations to the Numerical Code\n\nThe main dynamics of the relaxation code used are\noutlined in Appendix A of [4] and here we detail how\nit can be adapted to solve the type II Poisson equation.\nFirst we must frame (2) in the form of\nk\n∇ * (ν gN )\n4π\n∇∧g = 0\n∇*g =\n\n(C1)\n(C2)\n\nnext compute the discrete divergence\nj\nX gxj − gx−j\nj\n\n∆j−\n\n(C3)\n\nwhere we use the compact notation\nj\n∆j− = rxj − rx−j\nj\n∆j+ = rx+j\n− rxj\n\nFinally the source term takes the form\nj\nX νx (gxj )N − νx−j (gx−j\n)N\n\n∆j−\n\nj\n\n(C4)\n\nsuch that at each site we locally solve (C1) whilst ensuring the discrete curl (C2) is satisfied globally. As the field\nchanges g j → g j + δg j , then at each step, these changes\nshould take the form\nδgxj = +\n\nmeaning we solve (B27) to find\n\n\u00132−2n\n\n23n/2−2 (7 + 9 cos 2ψ)\n(5 + 3 cos 2ψ)n/2+1\n\nWe also always have the background rescaled Newtonian\ncontribution\n\nDxN =\n\nand from the boundary conditions, we find\n\u0013\n\u0012\nπ\n3\nA=−\n+ √\n2 3 3\n\n\u0012\n\nhn (ψ) =\n\nDx =\n\n∇2 φ =\n\n∞\nX\n\n(B31)\n\nand hn is given by\n\nand al are dimensionless constants to be found by matching solutions at the intermediate MONDian regime (akin\nto the DM scaling C in type I theories). Our normalisation is picked such that ∇φ has units of acceleration.\nWe only need to expand out a few terms from this contribution, since the region of validity of these solutions is\nsmall.\n\nb.\n\nn(n + 1)Hn + cot(ψ)Hn′ + Hn′′ = hn\n\nj\nδgx−j\n=−\n\nCx\n∆j+\nCx\n∆j−\n\n(C5)\n\nto keep the discrete curl satisfied. The change in the\ndiscrete divergence, δDx , at each step will satisfy,\nDx + δDx = DxN\n\n(C6)\n\n\f11\nsuch at each site, the change in the field is given by\nδgxj = −\n\nDx − DxN Cx\nδDx ∆j+\n\n(C7)\n\nThen as we cycle through the lattice and the g field\nconverges, the additional changes to gxj lessen. We\nachieve faster convergence using a successive over relaxation method (SOR), by scaling the field as\nδgxj → λδgxj\n\nwhere λ is the over-relaxation parameter and is larger\nthan unity. We begin with λ = 1 and increase it once the\nfield is settling down, since high values of λ can initially\nresult in the RMS value of |δDx | increasing, whilst we\nare looking for |δDx | → 0.\n\n(C8)\n\n[1] M. Milgrom, Astrophys. J. 270, 365 (1983).\n[2] B. Famaey and S. S. McGaugh, Living Reviews in Relativity 15, 10 (2012), 1112.3960.\n[3] J. Bekenstein and J. Magueijo, Phys. Rev. D73, 103513\n(2006), astro-ph/0602266.\n[4] N. Bevis, J. Magueijo, C. Trenkel, and S. Kemble, Class.\nQuant. Grav. 27, 215014 (2010), 0912.0710.\n[5] J. Magueijo and A. Mozaffari, Phys. Rev. D 85, 043527\n(2012), 1107.1075.\n[6] P. McNamara, S. Vitale, and K. Danzmann (LISA),\nClass. Quant. Grav. 25, 114034 (2008).\n[7] C. Trenkel, S. Kemble, N. Bevis, and J. Magueijo, submitted (2009).\n[8] A. Mozaffari, Phys. Rev. D\n87, 064034 (2013),\n1212.3905.\n[9] P. Galianni, M. Feix, H. Zhao, and K. Horne, Phys. Rev.\nD 86, 044002 (2012), 1111.6681.\n[10] J. Bekenstein and M. Milgrom, Astrophys. J. 286, 7\n(1984).\n[11] M. Milgrom, Phys. Rev. D80, 123536 (2009), 0912.0790.\n[12] T. Clifton and T. G. Zlosnik, Phys. Rev. D 81, 103525\n\n(2010), 1002.1448.\n[13] B. S. Sathyaprakash and B. F. Schutz, Living Rev. Rel.\n12, 2 (2009), 0903.0338.\n[14] F. Antonucci and M. A. et al, Classical and\nQuantum Gravity 28,\n094001 (2011),\nURL\nhttp://stacks.iop.org/0264-9381/28/i=9/a=094001.\n[15] H.-S. Zhao and B. Famaey, Astrophys. J. 638, L9 (2006),\nastro-ph/0512425.\n[16] T. G. Zlosnik, P. G. Ferreira, and G. D. Starkman,\nPhys. Rev. D 74, 044037 (2006), gr-qc/0606039, URL\nhttp://adsabs.harvard.edu/abs/2006PhRvD..74d4037Z.\n[17] J. D. Bekenstein, Phys. Rev. D70, 083509 (2004);\nErratum-ibid. D71, 069901 (2005), astro-ph/0403694.\n[18] T. Clifton, P. G. Ferreira, A. Padilla, and C. Skordis,\nPhysics Reports 513, 1 (2012).\n[19] S. M. Carroll and E. A. Lim, Phys. Rev. D 70, 123525\n(2004), hep-th/0407149.\n[20] K.-i. Umezu, K. Ichiki, and M. Yahiro, Phys. Rev. D 72,\n044010 (2005), astro-ph/0503578v1.\n\n\f"}