{"id": "http://arxiv.org/abs/1009.5115v1", "guidislink": true, "updated": "2010-09-26T18:24:07Z", "updated_parsed": [2010, 9, 26, 18, 24, 7, 6, 269, 0], "published": "2010-09-26T18:24:07Z", "published_parsed": [2010, 9, 26, 18, 24, 7, 6, 269, 0], "title": "Exotic phases induced by strong spin-orbit coupling in ordered double\n  perovskites", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1009.5963%2C1009.3087%2C1009.5263%2C1009.3025%2C1009.0521%2C1009.6227%2C1009.3525%2C1009.3290%2C1009.4760%2C1009.4832%2C1009.0225%2C1009.1645%2C1009.5639%2C1009.1734%2C1009.1443%2C1009.3348%2C1009.4890%2C1009.5902%2C1009.2434%2C1009.6102%2C1009.1934%2C1009.5174%2C1009.0573%2C1009.0247%2C1009.5960%2C1009.5888%2C1009.0324%2C1009.2297%2C1009.5115%2C1009.0639%2C1009.1199%2C1009.2654%2C1009.1625%2C1009.6037%2C1009.1766%2C1009.0697%2C1009.0777%2C1009.5570%2C1009.1305%2C1009.1550%2C1009.3842%2C1009.3436%2C1009.4360%2C1009.1799%2C1009.0475%2C1009.2507%2C1009.4903%2C1009.1783%2C1009.1235%2C1009.1649%2C1009.4714%2C1009.3018%2C1009.4336%2C1009.1878%2C1009.0918%2C1009.0183%2C1009.3607%2C1009.0934%2C1009.5981%2C1009.3201%2C1009.3965%2C1009.0677%2C1009.0218%2C1009.3755%2C1009.5171%2C1009.0944%2C1009.2541%2C1009.1790%2C1009.1457%2C1009.3181%2C1009.2795%2C1009.2004%2C1009.3394%2C1009.1298%2C1009.0554%2C1009.4871%2C1009.4303%2C1009.2217%2C1009.3941%2C1009.2928%2C1009.3926%2C1009.0331%2C1009.2240%2C1009.2367%2C1009.1442%2C1009.3628%2C1009.3179%2C1009.0391%2C1009.6034%2C1009.4889%2C1009.0023%2C1009.0943%2C1009.4188%2C1009.0390%2C1009.2401%2C1009.5087%2C1009.6143%2C1009.4320%2C1009.0546%2C1009.2206%2C1009.1122&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Exotic phases induced by strong spin-orbit coupling in ordered double\n  perovskites"}, "summary": "We construct and analyze a microscopic model for insulating rock salt ordered\ndouble perovskites, with the chemical formula A$_2$BB'O$_6$, where the B' atom\nhas a 4d$^1$ or 5d$^1$ electronic configuration and forms a face centered cubic\n(fcc) lattice. The combination of the triply-degenerate $t_{2g}$ orbital and\nstrong spin-orbit coupling forms local quadruplets with an effective spin\nmoment $j=3/2$. Moreover, due to strongly orbital-dependent exchange, the\neffective spins have substantial biquadratic and bicubic interactions (fourth\nand sixth order in the spins, respectively). This leads, at the mean field\nlevel, to three main phases: an unusual antiferromagnet with dominant octupolar\norder, a ferromagnetic phase with magnetization along the $[110]$ direction,\nand a non-magnetic but quadrupolar ordered phase, which is stabilized by\nthermal fluctuations and intermediate temperatures. All these phases have a two\nsublattice structure described by the ordering wavevector ${\\boldsymbol Q}\n=2\\pi (001)$. We consider quantum fluctuations and argue that in the regime of\ndominant antiferromagnetic exchange, a non-magnetic valence bond solid or\nquantum spin liquid state may be favored instead. Candidate quantum spin liquid\nstates and their basic properties are described. We also address the effect of\nsingle-site anisotropy driven by lattice distortions. Existing and possible\nfuture experiments are discussed in light of these results.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1009.5963%2C1009.3087%2C1009.5263%2C1009.3025%2C1009.0521%2C1009.6227%2C1009.3525%2C1009.3290%2C1009.4760%2C1009.4832%2C1009.0225%2C1009.1645%2C1009.5639%2C1009.1734%2C1009.1443%2C1009.3348%2C1009.4890%2C1009.5902%2C1009.2434%2C1009.6102%2C1009.1934%2C1009.5174%2C1009.0573%2C1009.0247%2C1009.5960%2C1009.5888%2C1009.0324%2C1009.2297%2C1009.5115%2C1009.0639%2C1009.1199%2C1009.2654%2C1009.1625%2C1009.6037%2C1009.1766%2C1009.0697%2C1009.0777%2C1009.5570%2C1009.1305%2C1009.1550%2C1009.3842%2C1009.3436%2C1009.4360%2C1009.1799%2C1009.0475%2C1009.2507%2C1009.4903%2C1009.1783%2C1009.1235%2C1009.1649%2C1009.4714%2C1009.3018%2C1009.4336%2C1009.1878%2C1009.0918%2C1009.0183%2C1009.3607%2C1009.0934%2C1009.5981%2C1009.3201%2C1009.3965%2C1009.0677%2C1009.0218%2C1009.3755%2C1009.5171%2C1009.0944%2C1009.2541%2C1009.1790%2C1009.1457%2C1009.3181%2C1009.2795%2C1009.2004%2C1009.3394%2C1009.1298%2C1009.0554%2C1009.4871%2C1009.4303%2C1009.2217%2C1009.3941%2C1009.2928%2C1009.3926%2C1009.0331%2C1009.2240%2C1009.2367%2C1009.1442%2C1009.3628%2C1009.3179%2C1009.0391%2C1009.6034%2C1009.4889%2C1009.0023%2C1009.0943%2C1009.4188%2C1009.0390%2C1009.2401%2C1009.5087%2C1009.6143%2C1009.4320%2C1009.0546%2C1009.2206%2C1009.1122&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We construct and analyze a microscopic model for insulating rock salt ordered\ndouble perovskites, with the chemical formula A$_2$BB'O$_6$, where the B' atom\nhas a 4d$^1$ or 5d$^1$ electronic configuration and forms a face centered cubic\n(fcc) lattice. The combination of the triply-degenerate $t_{2g}$ orbital and\nstrong spin-orbit coupling forms local quadruplets with an effective spin\nmoment $j=3/2$. Moreover, due to strongly orbital-dependent exchange, the\neffective spins have substantial biquadratic and bicubic interactions (fourth\nand sixth order in the spins, respectively). This leads, at the mean field\nlevel, to three main phases: an unusual antiferromagnet with dominant octupolar\norder, a ferromagnetic phase with magnetization along the $[110]$ direction,\nand a non-magnetic but quadrupolar ordered phase, which is stabilized by\nthermal fluctuations and intermediate temperatures. All these phases have a two\nsublattice structure described by the ordering wavevector ${\\boldsymbol Q}\n=2\\pi (001)$. We consider quantum fluctuations and argue that in the regime of\ndominant antiferromagnetic exchange, a non-magnetic valence bond solid or\nquantum spin liquid state may be favored instead. Candidate quantum spin liquid\nstates and their basic properties are described. We also address the effect of\nsingle-site anisotropy driven by lattice distortions. Existing and possible\nfuture experiments are discussed in light of these results."}, "authors": ["Gang Chen", "Rodrigo Pereira", "Leon Balents"], "author_detail": {"name": "Leon Balents"}, "author": "Leon Balents", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1103/PhysRevB.82.174440", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1009.5115v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1009.5115v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "25 pages, 21 figures", "arxiv_primary_category": {"term": "cond-mat.str-el", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cond-mat.str-el", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1009.5115v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1009.5115v1", "journal_reference": "Phys Rev B 82 174440 (2010)", "doi": "10.1103/PhysRevB.82.174440", "fulltext": "Exotic phases induced by strong spin-orbit coupling in ordered double perovskites\nGang Chen\nPhysics Department, University of Colorado, Boulder, CO 80309 and\nPhysics Department, University of California, Santa Barbara, CA 93106\n\nRodrigo Pereira\nInstituto de Fı́isica de São Carlos, Universidade de São Paulo, C.P. 369, São Carlos, SP. 13566-970, Brazil and\nKavli Institute for Theoretical Physics, University of California, Santa Barbara, CA 93106\n\narXiv:1009.5115v1 [cond-mat.str-el] 26 Sep 2010\n\nLeon Balents\nKavli Institute for Theoretical Physics, University of California, Santa Barbara, CA 93106\n(Dated: October 22, 2018)\nWe construct and analyze a microscopic model for insulating rock salt ordered double perovskites, with the\nchemical formula A2 BB'O6 , where the B' atom has a 4d1 or 5d1 electronic configuration and forms a face\ncentered cubic (fcc) lattice. The combination of the triply-degenerate t2g orbital and strong spin-orbit coupling\nforms local quadruplets with an effective spin moment j = 3/2. Moreover, due to strongly orbital-dependent\nexchange, the effective spins have substantial biquadratic and bicubic interactions (fourth and sixth order in\nthe spins, respectively). This leads, at the mean field level, to three main phases: an unusual antiferromagnet with dominant octupolar order, a ferromagnetic phase with magnetization along the [110] direction, and a\nnon-magnetic but quadrupolar ordered phase, which is stabilized by thermal fluctuations and intermediate temperatures. All these phases have a two sublattice structure described by the ordering wavevector Q = 2π(001).\nWe consider quantum fluctuations and argue that in the regime of dominant antiferromagnetic exchange, a nonmagnetic valence bond solid or quantum spin liquid state may be favored instead. Candidate quantum spin\nliquid states and their basic properties are described. We also address the effect of single-site anisotropy driven\nby lattice distortions. Existing and possible future experiments are discussed in light of these results.\nPACS numbers: 71.70.Ej,71.70.Gm,75.10.-b\n\nI.\n\nINTRODUCTION\n\nIn magnetic Mott insulators with quenched orbital degrees\nof freedom, weak spin-orbit coupling (SOC) only leads to a\nsmall correction to the usual spin exchange Hamiltonian in\nthe form of single-site anisotropy and Dzyaloshinskii-Moriya\ninteractions.1,2 In the presence of strong SOC, however, a\ncompletely different physical picture emerges, in which spin\nitself is not a good quantum number, and magnetic anisotropy\nis usually large. Generally, strong SOC is common in the Lanthanides, in which the relevant 4f-electrons are very tightly\nbound to the nucleus. The tight binding shields the electrons\nfrom crystal fields, which tend to split the orbital degeneracies\ninvolved in SOC, and moreover reduces exchange, which also\ncompetes with SOC.\nWhile more rare, strong SOC is becoming an increasing\nfocus in d-electron systems, in which electrons are more delocalized than in the Lanthanides, and more diverse phenomena\ncan be expected. For instance, strong SOC can be expected\nin 5d transition metal compounds, which have large intrinsic\natomic SOC due to their high atomic weight. In this category,\nmany Ir-based magnets have been studied recently3,4 . Lighter\ntransition metals may also exhibit strong SOC if competing\neffects such as crystal fields and exchange are suppressed,\ne.g. by choosing crystal structures with high-symmetry and\nwell-separated magnetic ions, respectively. An example of\nthis type is the \"spin-orbital liquid\" state observed in the Febased spinel FeSc2 S4 ,5–7 which is believed to be driven by\nSOC.8–10\n\nIn this paper, we consider the case of insulating magnetic\nordered double perovskites. Structurally, ordered double perovskites (with the chemical formula A2 BB'O6 ) are derived\nfrom the usual perovskites ABO3 by selectively replacing half\nthe B ions with another species, denoted B'. We focus on the\ncase in which the B ions are non-magnetic and the B' ones are\nmagnetic. Because of the difference in the valence charges\nand ionic radius between B and B' ions, the magnetic B' ions\nform an fcc lattice structure with a lattice constant double of\nthe original cubic one. Many ordered double perovskites incorporate strong intrinsic SOC, as B' ions are commonly 4d\nand 5d transition metals. Moreover, the large B'-B' separation\nweakens exchange, similarly to FeSc2 S4 . Here, we construct\nan appropriate microscopic model for the most quantum of\nthese materials (a list may be found in Table II), in which the\nmagnetic ion contains a single unpaired S = 1/2 spin.\nThe physics is strongly influenced by the combination of\nthe orbital degeneracy of the t2g multiplet, which acts as an effective ` = 1 orbital angular moment. Due to strong SOC, this\ncombines with the S = 1/2 spin to induce an effective total\nangular momentum j = 3/2 description of the system. Moreover, due to the orbitally-dependent exchange, the interaction\nof these j = 3/2 contains large biquadratic (fourth order in\nspin operators) and triquadratic (sixth order in spin operators)\ninteractions. These support exotic phases not easily found in\nsystems with dominant bilinear spin exchange.\nAnalysis of the microscopic model shows that the strong\nSOC enhances quantum fluctuations and leads to several interesting phases: (1) an unconventional antiferromagnet (de-\n\n\f2\nnoted AFM) in which the magnetic octupole and quadrupole\nmoments rather than the dipole moment are dominant, (2)\nan unusual non-collinear ferromagnet (denoted FM110) with\na doubled unit cell and magnetization along the [110] axis,\n(3) a (biaxial) \"spin nematic\" phase with quadrupolar order\nbut unbroken time reversal symmetry and, more speculatively,\n(4) a possible quantum spin liquid (QSL) phase. Phases (1),\n(2), and (4) are low temperature phases and persist as ground\nstates, while the spin nematic, phase (3), occurs in a broad\nintermediate temperature range below the paramagnetic state\nbut above any magnetic ordering temperature.\n1.0\n\n0.8\n\nFM110\n\nV\n\n0.6\n\n0.4\n\n0.2\n\nAFM\n0.0\n0.0\n\n0.2\n\n0.4\n\n0.6\n\nJ\n\n0.8\n\n1.0\n\n¢\n\nFIG. 1. (Color online) Mean field T = 0 phase diagram for the\nmodel Hamiltonian in Eq. (27). AFM denotes the \"antiferromagnetic\" ground state given by Eq. (39) and Eq. (40), FM110 denotes the ferromagnetic ground state with an easy axis oriented along\n[110], given by Eq. (51). The FM100 state, which is ferromagnetic\nwith easy axis along [100] appears in the narrow band between the\ntwo phase phase boundaries. In the figure, J = 1.\n\nStates with magnetic multipole order are more often observed in f-electron systems where crystal field effects are less\nimportant than SOC.11 As a consequence, the atomic wavefunctions are total angular momentum eigenstates, in which\nthe spin and orbital degrees of freedom are highly entangled.\nThis leads to highly non-Heisenberg exchange between the local moments, which is described by interaction of higher magnetic multipole operators. Such interactions may drive multipolar order, as suggested for instance in URu2 Si2 .12 Recently\nthis has been suggested to also occur in d electron systems\nwith unquenched orbital degeneracy and sufficient SOC.13 We\nfind a similar mechanism at work in the AFM phase.\nA ferromagnetic state is not in itself unusual, though such\nis relatively uncommon in insulators. However, cubic ferromagnets with an easy axis oriented along the [110] direction\nis quite uncommon. This can be understood from the Landau theory for a ferromagnet: the usual fourth order cubic\nanisotropy term favors either [100] or [111] orientation, depending upon its sign, but never [110]. To obtain a [110] easy\naxis, one requires sixth order or higher terms to be substantial,\nmaking this rare indeed. Remarkably, such [110] anisotropy\nhas been observed in experiments on Ba2 NaOsO6 .14\nBoth the above states, when heated above their magnetic\nordering temperatures, allow on symmetry grounds for an in-\n\ntermediate phase which is time-reversal symmetric but with\nquadrupolar order – the spin nematic. Applying the mean field\ntheory at T > 0, we indeed find such a phase in a broad range\nof parameter space. While spin nematic states have been suggested previously in NiGa2 S4 15–19 , it has not been established\nin that material. The mechanism for quadrupolar order here is\nmuch more transparent and robust than in that case.\nThe above three phases, while somewhat unconventional,\nmay be obtained within a mean-field analysis. A QSL state,\nhowever, cannot be described by any mean field theory, and\nis considerably more exotic. The search for a QSL, which is\na state in which quantum fluctuations prevent spins from ordering even at zero temperature, is a long-standing problem\nin fundamental physics.20 Since the possibility of a QSL was\nsuggested by Anderson in the early 1970s,21 this has been an\nactive area for theory and experiment. Despite the current maturity of the theory for QSL,22 the experimental confirmation\nof the existence of such an exotic phase is still elusive. Very\ncommonly geometrical frustration is thought to be a driving\nmechanism for QSL formation, and consequently most research (both theoretically and experimentally) has been devoted to systems of this type, such as triangular,23 kagome,24\nhyperkagome3,25,26 and pyrochlore lattices.27\nHere we suggest a different route, in which quantum fluctuations are enhanced primarily by strong SOC, rather than geometrical frustration. In fact, the magnetic ions in ordered double perovskites reside on a face centered cubic (fcc) sublattice,\nwhich can be viewed as edge-sharing tetrahedra, and is somewhat geometrically frustrated. Without strong SOC, however,\nthis frustration is weak, and indeed the classical Heisenberg\nantiferromagnet on the fcc lattice is known to magnetically order into a state with the ordering wavevector 2π(001).28 The\ntendency of the simple fcc antiferromagnet to order may be\npartially attributed to its large coordination number (z = 12),\nwhich leads to mean-field like behavior. By contrast, strong\nSOC induces effective exchange interactions very different\nfrom Heisenberg type, with strong directional dependence that\nmay make a QSL more favorable. To make this suggestion\nmore concrete, we propose a natural wavefunction for a QSL\nin our model, and discuss the physical properties of such a\nstate.\nWe now outline the main results of the paper, and how they\nare presented in the following sections. In Sec. II, we show\nthat strong SOC leads to an effective j = 3/2 local moment\non each B' site. We write down a model Hamiltonian which\nincludes three interactions: nearest neighbor (NN) antiferromagnetic (AFM) exchange, J, NN ferromagnetic (FM) exchange, J 0 , and electric quadrupolar interaction, V . These interactions are all projected down to the effective j = 3/2 manifold, which induces many terms beyond the usual quadratic\nexchange. Indeed, because of the four-dimensional basis of\nspin-3/2 states, the resulting Hamiltonian can be thought of as\nan anisotropic Γ matrix model.29 We then discuss the symmetry properties of the projected Hamiltonian. Surprisingly, we\nfind that, in the limit of vanishing FM exchange, the Hamiltonian has a \"hidden\" global SU(2) symmetry despite its complicated appearance.\nIn Sec. III, we consider the mean field ground states of the\n\n\f3\nmodel, characterized by local (single-site) order parameters.\nIn Sec. III A we begin by considering the more accessible limit\nin which strong uniaxial single-site anisotropy (due e.g. to a\ntetragonal distortion of the crystal) lifts the \"orbital\" four-fold\ndegeneracy of j = 3/2 quadruplets down to easy-axis or easyplane Kramer's doublets. In these limits, the effective Hamiltonian in the reduced phase space is mapped onto that of an\nXXZ antiferromagnet which can be understood even without\nmean field theory. Next, in Sec. III B, we carry out T = 0\nmean field theory for the case of cubic symmetry. Here we\nfind the AFM state and two ferromagnetic states (the FM110\nstate and another state with a [100] easy axis). The T = 0\nmean field phase diagram is shown in Fig. 1. Finally, having\ndescribed the situations with strong and vanishing single-site\nanisotropy, we determine in Sec. III C the mean-field phase\ndiagram for intermediate anisotropy.\nIn Sec. IV we identify the multipolar order parameters of\nthe three ordered phases and analyze the T > 0 behavior by\nmean-field theory. Here we find the quadrupolar phase, and\ndiscuss several phase transitions which occur. We also discuss the behavior of the magnetic susceptibility in different\nparameter regimes.\nIn Sec. V, we consider quantum effects beyond the mean\nfield theory. First, we carry out a spin wave calculation, which\ndetermines the collective mode structure, and also shows that\nin the regime where nearest-neighbor antiferromagnetic exchange is dominant (small J 0 and V ) quantum fluctuations are\nlarge and may destabilize the ordered AFM phase. Therefore,\nwe consider possible non-magnetic ground states, both of valence bond solid and quantum spin liquid (QSL) type. We\nformulate a slave-fermion theory with four-component spin\ns = 3/2 fermions, in such a way that at mean field level the\nhidden SU(2) symmetry is preserved and the correct ground\nstate, the analog of a singlet in the usual Heisenberg model, is\nobtained for a single pair of nearest-neighbor sites. The corresponding mean field theory naturally includes the intrinsic\nspatial anisotropy of the strong SOC limit. We analyze two\ndifferent mean field ansätze, with zero and π-flux. In both\ncases the mean field Hamiltonian respects all the symmetries\nof the original spin Hamiltonian. The π-flux state is found to\nhave lower mean field energy. For both states, the spinons are\nat quarter-filling, leading to a spinon Fermi sea. There is no\nFermi surface nesting and we expect that this spinon Fermi\nsurface should be stable against weak perturbations. Predictions based on the picture of spinon Fermi surface are made.\nFinally in Sec. VI, we compare our theoretical prediction\nwith current experimental findings and suggest further directions for theory and experiment.\n\nII.\nA.\n\nMODEL AND SYMMETRY\n\nSpin-orbit interaction and hybridization of atomic orbitals\n\nThe magnetic ions B' (Os7+ , Re6+ , Mo5+ ) found in the\nordered double perovskites in Table II all have one electron\nin the triply degenerate t2g multiplet. The atomic spin-orbit\n\ninteraction projected down to the t2g triplet is written as\nHso = −λ l * S ,\n\n(1)\n\nin which the total angular momentum quantum numbers of\nthese operators are l = 1, S = 1/2. The effective orbital\nangular momentum l comes from the projection of orbital angular momentum L onto the t2g triplets,\nPt2g LPt2g = −l .\n\n(2)\n\nP\n\nHere Pt2g =\na=yz,xz,xy |aiha| is the projection operator\nto the t2g manifold. The eigenstates of lz with eigenvalues\nm = 0, ±1 and S z with eigenvalues σ = ±1/2 ≡↑, ↓, written\nin terms of the usual t2g states are\n|0, σi = |dσxy i;\n\n| ± 1, σi =\n\n∓|dσyz i − i|dσxz i\n√\n.\n2\n\n(3)\n\nThis interaction favors j = 3/2 (j = l + S) quadruplets\nover j = 1/2 doublets by an energy separation 3λ/2. In the\nstrong spin-orbit interaction limit, the local Hilbert space is\nrestricted to four low-lying states\nX\nα\n|dα i =\nCmσ\n|m, σi,\n(4)\nm,σ\n\nwhere α = ±3/2, ±1/2 is the j z eigenvalue and\n\u001c\n\u001d\n1\n3\n1\nα\nCmσ = l = 1, S = ; m, σ l = 1, S = ; j = , α\n2\n2\n2\n(5)\nis a Clebsch-Gordan coefficient. In the materials under consideration, λ is indeed a very large energy scale (fraction of\nan eV), justifying the strong SOC limit.\nEvery operator expressed in terms of spin and orbitals must\ntherefore be projected into this subspace and its projection can\nbe written in terms of j = 3/2 angular momentum operator.\nFor example,\n1\nj,\n3\n2\nP 32 l P 32 = j .\n3\n\nP 32 S P 23 =\n\n(6)\n(7)\n\nHere P 32 is the projection operator into the j = 3/2 quadruplets. Furthermore, for the magnetic moment M for electrons\nin atomic d orbitals, we have\nM ≡ P 23 [2S + (−l)]P 23 = 0 .\n\n(8)\n\nThe vanishing magnetic moment is quite remarkable and partially explains why the compounds have small magnetic moments in comparison with spin- 12 systems without orbital degeneracy.\nIn reality, the measured magnetic moments are nonzero because the atomic 4d or 5d orbitals strongly hybridize with p orbitals at the oxygen sites that form an octahedron surrounding\neach B' site. For instance, for Ba2 NaOsO6 , the hybridization\nenergy is estimated to be of the order of electron volts14,30 and\ncomparable to the energy gap between Os d and O p states.\n\n\f4\nFor this reason, it is more appropriate to think in terms of\nmolecular orbitals with mixed d and p character. For example, molecular xy orbitals are written as\nσ\n|Di,xy\ni=\n\n|dσi,xy i + r|pσi,xy i\n√\n,\n1 + r2\n\n(9)\n\nwhere |dσi,xy i is the state corresponding to one electron in the\nxy orbital and spin σ on site i, and |pσi,xy i is a linear combination (with xy symmetry) of states that have a singlet on the\ndxy orbital and one hole on an oxygen site\n\u0011\n1\u0010 σ\n|pi+êx ,y i + |pσi+êy ,x i + |pσi−êx ,y i + |pσi−êy ,x i ,\n|pσi,xy i =\n2\n(10)\nwhere êx,y are real space vectors from the B' site to neighboring oxygens along x or y directions. The mixing parameter r\nis of order tdp /∆, where tdp is the hopping matrix element between d and p orbitals and ∆ is the gap to oxygen p states. In\nthe limit of strong spin-orbit interaction, we must project into\nfour low-lying molecular orbitals which are a superposition of\nthe four atomic states with j = 3/2 and p states\nX\nα\nσ\n|Di,α i =\nCmσ\nDi,m\n.\n(11)\n\nwhere the sum is over nearest neighbor sites in the XY planes,\nand the corresponding terms for YZ and XZ planes are obtained by the obvious cubic permutation. Here the operators\nSi,xy and ni,xy denote the spin residing on xy orbital and orbital occupation number at site i, respectively. In terms of spin\nand orbital angular momentum operators acting on site i,\nSi,xy = Si [1 − (liz )2 ],\nni,xy = 1 −\n\n(14)\n\n(liz )2 ,\n\n(15)\n\nThroughout this paper, we use the subindices (i, xy) to denote the site and orbitals, superindex (μ = x, y, z) to denote\nthe spin component, and capital letters (XY, XZ, YZ) to denote the planes. With these definitions, we note that the single\noccupancy condition at each site, which defines the Mott insulating state, becomes\nni,xy + ni,xz + ni,yz = 1.\n\n(16)\n\nMoreover, from Eq. (15), orbitally-resolved spins satisfy\nSi,xy + Si,yz + Si,xz = Si .\n\n(17)\n\nm,σ\n\nWhile the atomic magnetic moment in Eq. (8) vanishes, there\nis a nonzero contribution to the molecular M from holes in p\norbitals. After taking the projection into j = 3/2 states, the\ncoupling of the molecular orbital to a magnetic field reads\nHZ = −gμB h * j,\n2\n\n(12)\n\n2\n\npz\nB\n\nO\n\n′\n\npx\n\nB\nO\n\ndxz\nz\n\ny\n\nwhere g = r /[3(1 + r )] is the Landé factor, and μB is the\nBohr magneton.\n\nB\n\n′\n\ny\n\nx\n\ndxy\n\nx\nB.\n\nExchange interactions and electric quadrupolar interaction\n\nIn the last subsection, we discussed the effect of strong\nspin-orbit interaction in determining the local degrees of freedom and pointed out that every operator must be projected\ninto the j = 3/2 quadruplets. In this subsection, we introduce\nthe interactions between the local moments, and discuss the\nmechanics of the projection.\nThe first interaction to consider is nearest-neighbor antiferromagnetic exchange, through the virtual transfer of electrons through intermediate oxygen p orbitals. These processes\nare strongly restricted by symmetry. For example, in XY\nplanes, only electrons residing on dxy orbitals can virtually\nhop to neighboring sites via px and py orbitals of the intermediate oxygen sites. The exchange path and relevant orbitals\nare depicted in Fig. 2. Alternatively, one can interpret this\nprocess as kinetic exchange between molecular Dxy orbitals,\nwhich are mixtures of the transition metal d state and p states\non the neighboring four oxygens (see Eq. (9)). As a consequence, the antiferromagnetic exchange interaction can be\nXY\nYZ\nXZ\nwritten Hex-1 = Hex-1\n+ Hex-1\n+ Hex-1\n, where\n\u0012\n\u0013\nX\n1\nXY\nHex-1\n=J\nSi,xy * Sj,xy − ni,xy nj,xy , (13)\n4\nhiji∈XY\n\nFIG. 2. (Color online) Left graph: The NN AFM exchange path (B0 O-O-B0 ); right graph: The NN FM exchange path with intermediate\northogonal p orbitals at O sites.\n\nThe second interaction is the nearest-neighbor ferromagnetic exchange interaction. This interaction is due to the spin\ntransfer through orthogonal orbitals at the intermediate oxygen sites in the exchange path, as shown in Fig. 2. For two\nsites i, j in the XY plane, this ferromagnetic exchange is written as\nXY\nHex-2,ij\n= −J 0 [Si,xy * (Sj,yz + Sj,xz ) + hi ↔ ji]\n\n−\n\n3J 0\n[ni,xy (nj,xz + nj,yz ) + hi ↔ ji] , (18)\n4\n\nwhere the xy orbital only interacts with yz and xz orbitals at\nneighboring sites. Applying the single-occupancy constraint,\nthe nearest-neighbor ferromagnetic exchange interaction can\nbe simplified, up to a constant, to\nX\nXY\nHex-2\n= −J 0\n[Si,xy * (Sj,yz + Sj,xz ) + hi ↔ ji]\nhiji∈XY\n\n3J 0 X\nni,xy nj,xy .\n+\n2\nhiji\n\n(19)\n\n\f5\nMicroscopically, J 0 /J ∼ O(JH /Up ) where JH and Up are\nthe Hund's coupling and Hubbard Coulomb interaction at the\noxygen site, respectively.\nThe third interaction is the electric quadrupole-quadrupole\ninteraction. The 4d or 5d electron carries an electric\nquadrupole moment, and the interaction between these moments may not be negligible because of the long spatial extent of the molecular orbitals. Calculating the direct electrostatic energy between all possible orbital configurations for\ntwo electrons residing in neighboring sites in an XY plane,\nwe obtain the quadrupole-quadrupole interaction\nXY\nHquad,ij\n= V ni,xy nj,xy\nV\n− [ni,xy (nj,yz + ni,xz ) + (i ↔ j)]\n2\n13V\n−\n(ni,yz nj,yz + ni,xz nj,xz )\n12\n19V\n(ni,yz nj,xz + ni,xz nj,yz ).\n(20)\n+\n12\n\nHere V > 0 is defined as the Coulomb repulsion between two\nnearest-neighbor xy orbitals on XY planes. If Q is the magnitude of the electric quadrupole√and a is the lattice constant of\nthe fcc lattice, we have V = 9 2Q2 /a5 . In general, the main\ncontribution to Q comes from the charge at the oxygen sites,\nhence the larger the hybridization, the larger the value of V .\nUsing the single-occupancy constraint in Eq. (16) and summing over sites, the quadrupole-quadrupole interaction simplifies to\nX \u0014 4V\nXY\n(ni,xz − ni,yz )(nj,xz − nj,yz )\nHquad\n=\n−\n3\nhiji∈XY\n\u0015\n9V\n+\nni,xy nj,xy ,\n(21)\n4\nin which we have ignored an unimportant constant.\nThe minimal Hamiltonian for the cubic system contains all\nthree of these exchange interactions in addition to the on-site\nSOC,\nH = Hex-1 + Hex-2 + Hquad + Hso .\n\n(22)\n\nSince we are interested in the limit of strong spin-orbit interaction, we need to project H onto the j = 3/2 quadruplets\nat every site. As an example, we write down the projection for\nSi,xy and ni,xy ,\n1 x 1 z x z\nj − ji ji ji\n4 i\n3\n1 y 1 z y z\n= ji − ji ji ji\n4\n3\n3 z 1 z z z\n= ji − ji ji ji\n4\n3\n3 1 z 2\n= − (ji ) ,\n4 3\n\nx\nS̃i,xy\n=\n\n(23)\n\ny\nS̃i,xy\n\n(24)\n\nz\nS̃i,xy\n\nñi,xy\n\n(25)\n(26)\n\nin which, Õ ≡ P 32 O P 32 . Spin and occupation number operators for other orbitals can be readily generated by a cubic\n\npermutation. After the projection, the minimal Hamiltonian\nreduces, up to a constant, to\nH̃ = H̃ex-1 + H̃ex-2 + H̃quad .\n\n(27)\n\nAs one may notice, the projected Hamiltonian contains 4spin and 6-spin interactions in addition to the usual quadratic\n2-spin interactions if it is expressed in terms of the effective\nspin moment ji . One can view these multiple spin terms as\nthe interaction between magnetic multipoles (quadrupole and\noctupole) at different sites. Such multipolar Hamiltonians are\nmuch less familiar than the usual quadratic exchange forms,\nand some caution should be used. In particular, experience\nwith similar models shows that such interactions can magnify\nquantum effects, for instance leading to the appearance of a\nquadrupolar phase in the biquadratic case16 . Hence, the naı̈ve\nclassical approximation – replacing j's by classical vectors –\nis inadvisable, and we will proceed differently below.\nC.\n\nSymmetry properties of the Hamiltonian\n\nBefore we move on to discuss the ground state of the\nHamiltonian H̃ in Eq. (27), we need to have some understanding about its symmetry properties. We start from the NN\nAFM exchange interaction H̃ex-1 . The latter has an apparent\ncubic P\nspace group symmetry. The total angular momentum\nJ = i ji is not conserved, [H̃ex-1 , J ] 6= 0. Nevertheless,\nH̃ex-1 surprisingly has a \"hidden\" SU(2) symmetry. The three\ngenerators of this global continuous symmetry are defined as\nfollows,\nX μ X \u00147 μ 2 μ \u0015\nGμ =\nGi =\nji − (ji )3 ,\n(28)\n6\n3\ni\ni\nwith μ = x, y, z. One can readily check that these generators\ncommute with H̃ex-1 ,\n[Gμ , H̃ex-1 ] = 0,\n\n(29)\n\nand satisfy the SU(2) algebra,\n[Gμ , Gν ] = i\u000fμνλ Gλ .\n\n(30)\n\nIn addition, the Casimir operator G2 also commutes with\nH̃ex-1 . The physical meaning of these generators is easy to\nsee if one expresses Gx,y,z in matrix form. For a single site,\n\n\n1\n1\n1  1\nx\nx\nGxi = − \n = (−σ )14 ⊕ (−σ )23 (31)\n1\n2\n2\n1\n\n\n−i\n1\ni\n 1 y\ny\nGyi = \n = (σ )14 ⊕ (−σ )23 (32)\n−i\n2\n2\ni\n\n\n−1\n1\n1\n 1\nGzi = \n= (−σ z )14 ⊕ (σ z )23 , (33)\n−1  2\n2\n1\n\n\f6\nin which the empty matrix entries are zero and we have expressed these generators as the direct sum of two Pauli matrices, one (σ14 ) for the subspace of jiz = ±3/2 states and the\nother (σ23 ) for the subspace of jiz = ±1/2 states. One intuitive way to think about these SU(2) generators is that they\ntransform the spin components in the jiz = ±3/2 subspace together with jiz = ±1/2 subspace. This is a global symmetry\nof H̃ex-1 .\nNow we consider the other two interactions, H̃ex-2 and\nH̃quad . We find that the electric quadrupole-quadrupole interaction H̃quad also commutes with G. On the other hand, the\nferromagnetic exchange interaction H̃ex-2 breaks this SU(2)\nsymmetry; thus\n[H̃, G] ∝ J 0 .\n\n(34)\n\nFor J 0 \u001c J, V , we have an approximate continuous symmetry.\n\n1.\n\nEasy-axis anisotropy\n\nLet us start with easy-axis anisotropy D > 0. Assuming the\nanisotropy is very strong D \u001d J, J 0 , V and D \u001c λ, which favors jiz = ±3/2 states, we can safely project the Hamiltonian\nH̃ into the latter two-dimensional subspace. We then obtain\nthe effective Hamiltonian\n\u0013\n\u0015\nX \u0014\u0012 J\nJ0\n0 z z\nHeff-1 =\n+\nTi * Tj − J Ti Tj\n4\n2\nhiji∈XZ,YZ\n\u0013\n\u0012\n3J 0\n11V\nJ\n+\n,\n(37)\n+N − +\n4\n2\n12\nwhere we have introduced pseudospin-1/2 operators Ti acting\non the basis jiz = ±3/2 with Tiz = ±1/2 corresponding to\njiz = ±3/2, respectively. And N is the total number of sites.\nIn the reduced space, the original spin vector reduces to the\npseudospin in the following way:\n(j x , j y , j z ) ⇒ 3(0, 0, T z ) .\n\nIII.\n\nIn this section, we study the ground state of the model\nHamiltonian H̃ in Eq. (27). We begin in Sec. III A by getting some intuition from considering a perturbed model with\nstrong easy-axis or easy-plane anisotropy. This starting point\nalso has experimental motivation as several ordered double\nperovskites in Tab. II develop such anisotropies that are driven\nby lattice distortions. Armed with the understanding of the\nanisotropic cases, we proceed to analyze the case of cubic\nsymmetry using mean-field theory in Sec. III B. We consider\nbriefly intermediate strength anisotropy in Sec. III C.\nIn general, Curie-Weiss mean-field theory consists of decoupling all inter-site interactions to obtain self-consistent\nsingle-site Hamiltonians. At zero temperature, this is equivalent to assuming a product form for the wavefunction, i.e.\n|Ψi = ⊗i |ψi i,\n\nNotice that after this projection the interaction on the horizontal bonds in XY planes disappear in the effective Hamiltonian\nHeff-1 . This can be understood in terms of the original orbital\npicture as the easy-axis anisotropy lifts the degeneracy of t2g\ntriplets, favoring xz and yz orbitals to be occupied. As a result, the above effective Hamiltonian is operating on a bonddepleted fcc lattice, which is in fact a unfrustrated bipartite\nbcc lattice.\nIn Heff-1 because of the in-plane anisotropy introduced by\nthe FM exchange, the ground state of Heff-1 is \"antiferromagnetically\" ordered in the (T x , T y ) plane with an ordering\nwavevector Q = 2π(001). We denote this as the AFM state.\nThe corresponding mean-field ground state is just the direct\nproduct,\nY\n|Ψ(φ)i =\n|ψi (φ)i,\n(39)\ni\n\n(35)\n\nwhere the product is over sites, and |ψi i is an arbitrary j =\n3/2 ket. One calculates the mean-field ground state energy\nas the expectation value of the Hamiltonian in this state, and\nminimizes it. Thus the mean-field approximation can also be\nconsidered as a simple variational one.\n\nA.\n\n(38)\n\nMEAN-FIELD GROUND STATES\n\nThe case with strong anisotropy\n\nIn this subsection, we add to the Hamiltonian H̃ in Eq. (27)\na strong anisotropic term,\nX\nHani = −D\n(jiz )2 ,\n(36)\n\nwhere\n1\n|ψi (φ)i = √ [|jiz = 32 i + (−)2zi eiφ |jiz = 23 i].\n2\n\n(40)\n\nwith an arbitrary phase φ. The arbitrariness of the phase\ncomes from the U(1) symmetry of the projected effective\nHamiltonian Eq. (37). However, as discussed in the previous section, the continuous symmetry in the original Hamiltonian is broken completely when J 0 6= 0. Therefore, the U(1)\nsymmetry of Hamiltonian in Eq. (37) is a by-product of the\nprojection. Because we are in the subspace of j z = ±3/2, the\norbital occupation is\n(hñi,yz i, hñi,xz i, hñi,xy i) = (1/2, 1/2, 0).\n\n(41)\n\ni\n\nin which, D can be positive or negative, representing easy-axis\nor easy-plane anisotropy, respectively. Although this interaction is anisotropic in spin space, it still respects the \"hidden\"\nglobal SU(2) symmetry.\n\nIt is also important to note that the ground state in Eq. (40)\nis not a conventional Néel state as it has a vanishing static\nmagnetic dipole moment,\nhΨ|ji |Ψi = 0 !\n\n(42)\n\n\f7\nThe φ dependence only shows up in the spin operators of a\nspecific orbital,\n1\nhΨ|S̃i,yz |Ψi = − (−)2zi (cos φ, sin φ, 0),\n4\n1\nhΨ|S̃i,xz |Ψi = (−)2zi (cos φ, sin φ, 0),\n4\nhΨ|S̃i,xy |Ψi = (0, 0, 0).\n2.\n\n(43)\n(44)\n(45)\n\nEasy-plane anisotropy\n\nNow we consider easy-plane anisotropy D < 0. We also\nassume the anisotropy is very strong |D| \u001d J, J 0 , V and\n|D| \u001c λ, which favors jiz = ±1/2 states and obtain the effective Hamiltonian after projection into the jiz = ±1/2 subspace,\nX 4\nX \u0014J\n0 z z\nHeff-2 =\n(JTi * Tj + J Ti Tj ) +\nTi * Tj\n9\n36\nhiji∈XY\nhiji∈XZ\n\u0015\n5\n1\n1\n+ J 0 (− Tix Tjx + Tiy Tjy + Tiz Tjz )\n6\n18\n6\nX \u0014J\n5\n1\n+\nTi * Tj + J 0 ( Tix Tjx − Tiy Tjy\n36\n18\n6\nhiji∈YZ\n\u0015\nJ\n3J 0\n11V\n1\n+\n).\n(46)\n+ Tiz Tjz ) + N (− +\n6\n4\n2\n12\nHere the pseudospin-1/2 operator T is acting on the subspace\nof j z = ±1/2 with T z = ±1/2 representing j z = ±1/2, respectively. In the reduced spin space, the original spin vector\nis reduced to the pseudospin in the following way:\n(j x , j y , j z ) ⇒ (2T x , 2T y , T z ) .\n\n(47)\n\nWe can now find the mean-field ground state of this Hamiltonian. For an effective S = 1/2 model of this type, this\nis equivalent to the classical approximation. Classically, we\ncan find the minimum energy states by the Luttinger-Tisza\nmethod. This amounts to looking for the eigenvalues of the\nspin Hamiltonian regarded as a quadratic form, and seeking a\nclassical spin solution which is built of a superposition only\nof those eigenvectors which have minimum energy eigenvalues. The result in this case is that, for 0 < J 0 < J, there are\ntwo classes of solution, all collinear spin states. These are:\n(i) states with Q = 2π(100) and the pseudo-spin axis in the\nyz plane, and (ii) states with Q = 2π(010) and the pseudospin axis in the xz plane. As for the easy-axis case, there is\nan accidental degeneracy of spin orientations within the plane\nnormal to Q. Note that while the pseudospin orients freely\nalong a circle in this plane, the magnetization orients along\nan ellipse due to the factor of 2 in Eq. (47). One readily expresses the ground state in the unprojected Hilbert space. For\nexample, taking Q = 2π(010) and pseudospin pointing along\nx direction, then\nY\n|Ψi =\n|ψi i\n(48)\ni\n\nwith\n1\n|ψi i = √ [|jiz = 12 i + (−)2yi |jiz = − 12 i] .\n2\n\n(49)\n\nThis is once again an antiferromagnetic state, and to distinguish it from the one which obtains for Ising anisotropy, we\ndenote it AFM'. The defining difference of the AFM' and the\nAFM state discussed previously is that, the former has a nonzero dipole moment, while, at least within mean field theory,\nthe latter does not.\n\nB.\n\nThe cubic case\n\nHaving understood the cases with strong easy-axis and\neasy-plane anisotropies, let us now turn to the Hamiltonian\nH̃ with cubic lattice symmetry in Eq. (27). Both ground\nstates of the Hamiltonian with strong easy-axis or easy-plane\nanisotropy comprise two-sublattice structure with an ordering\nwavevector equivalent to Q = 2π(001). It is therefore natural to guess that the same two sublattice structure is also obtained in the cubic case. While we have not proven this, we\nhave investigated more general mean-field ground states, allowing for much larger unit cells, but found in every case that\nthe minimum energy is found for the two-sublattice configuration. Therefore, in what follows, we assume the two sublattice\nstructure with ordering Q = 2π(001) (which is equivalent to\n2π(100) and 2π(010) in the cubic case). We make no further assumptions, and minimize the energy with respect to an\narbitrary wavefunction on each of the two sublattices. The\nresulting variational phase diagram is depicted in Fig. 1.\n\n1.\n\nAntiferromagnetic (AFM) state\n\nIn Fig. 1, for small J 0 /J and V /J, we find a phase, denoted\nAFM, which is the natural continuation of the AFM phases\nencountered in the anisotropic limits. Here, as in those cases,\nthe states on the two sublattices are simply related by a time\nreversal transformation, and indeed the ground state has the\nsame form as that found in the easy-axis case, Eqs. (39),(40).\nThe appearance of time-reversed pairs of sites is natural, since\nthe largest interaction, H̃ex-1 , is dominated by the spin-spin exchange term. Interestingly, one finds that the ground state has\na continuous degeneracy: the phase φ in Eq. (40) can be arbitrary. Since the Hamiltonian with non-vanishing J 0 has no\ncontinuous symmetry, this degeneracy appears to be accidental. Since it has the same form as we found in Sec. III A 1,\nwe continue to use the label AFM here for this state (and in\nFig. 1).\n\n2.\n\nFerromagnetic 110 (FM110) state\n\nWith large J 0 /J and V /J, the orbital-orbital interaction\nhas more weight in the Hamiltonian H̃, and the nature of the\nground state changes. One should note that even the pure\n\n\f8\norbital-orbital interaction is not trivial and classical, since the\norbital occupation numbers no longer commute after projection down to the j = 3/2 quadruplets. However, in meanfield theory one may still treat the expectation values classically. Note that the largest terms in the orbital-orbital interaction are those which are diagonal in the orbital basis, namely,\nthe second term in Eq. (19) and the second term in Eq. (21).\nTo minimize the diagonal orbital interaction like ñi,xz ñj,xz , a\nschematic recipe is to maximize ñi,xz while minimizing ñj,xz .\nThis is necessary because one cannot minimize both ñi,xz and\nñj,xz simultaneously, since, due to the single-occupancy constraint, the other diagonal terms such as ñi,yz ñj,yz would then\n\n|ψA iFM110\n|ψB iFM110\n\nbe increased. Since the occupation numbers of the same orbital must be taken different on different sites, and these occupation numbers are time-reversal invariant, the states on the\ntwo sublattices cannot be time-reversed counterparts. Consequently, there is a competition between the orbital-orbital\ninteractions (H̃ex-2 and H̃quad ) and the nearest neighbor antiferromagnetic exchange interaction (H̃ex-1 ). In the large J 0 /J\nand V /J region, when the orbital interactions dominate, we\nfind however that time-reversal symmetry is still broken, and\nsince these states are not composed of time-reversed pairs, the\nresult is an uncompensated net ferromagnetic moment.\nIn the majority of phase space, we find the ground state is\ncharacterized by three parameters, r, φ1 and φ2 ,\n\nr\n\n\u0001\n1 − r2 iφ2 z\ne |j = 32 i + |j z = − 23 i\n2\nr\nr\n1 − r2\n= √ (−e−iφ1 |j z = 12 i + iei(φ1 −φ2 ) |j z = − 12 i) +\n(−ie−iφ2 |j z = 32 i + |j z = − 23 i) ,\n2\n2\nr\n= √ (eiφ1 |j z = 21 i + ei(φ2 −φ1 ) |j z = − 12 i) +\n2\n\n(50)\n(51)\n\nin which, \"A\" and \"B\" represent the two sublattices, and r, φ1 and φ2 are determined by minimizing the mean field energy. Note\nthat in Eq. (51) the three parameters r, φ1 and φ2 are uniquely determined by J 0 /J and V /J. So the orbital occupations can be\nreadily generated,\n√\n√\n1 r2\nr 1 − r2\n1 r2\nr 1 − r2\n2r2\n√\n√\n(hñA,yz i, hñA,xz i, hñA,xy i)FM110 = ( −\n−\ncos φ1 , −\n+\ncos φ1 ,\n),\n(52)\n2\n3\n2\n3\n3\n3\n3\n√\n√\n1 r2\n1 r2\n2r2\nr 1 − r2\nr 1 − r2\n√\n√\n(hñB,yz i, hñB,xz i, hñB,xy i)FM110 = ( −\ncos φ1 , −\ncos φ1 ,\n+\n−\n).\n(53)\n2\n3\n2\n3\n3\n3\n3\nIt is interesting to see the spin vectors of two sublattices are symmetric about [11̄0] direction,\n\u0010p\n\u0011\np\nhjA iFM110 = r\n3 − 3r2 cos (φ1 − φ2 ) + r cos (2φ1 − 2φ2 ), 3 − 3r2 sin (φ1 − φ2 ) − r sin (2φ1 − 2φ2 ), 0\n(54)\n\u0011\n\u0010 p\np\nhjB iFM110 = r − 3 − 3r2 sin (φ1 − φ2 ) + r sin (2φ1 − 2φ2 ), − 3 − 3r2 cos (φ1 − φ2 ) − r cos (2φ1 − 2φ2 ), 0 (55)\nso the system has a non-vanishing net spin polarization, that is\ni\nr hp\n1\n3 − 3r2 (cos (φ1 − φ2 ) − sin (φ1 − φ2 )) + r(cos (2φ1 − φ2 ) + sin (2φ1 − φ2 )) (1, −1, 0) . (56)\n2 hjA + jB iFM110 = 2\nThis direction of polarization is equivalent to [110] by a 90 degree rotation, so we denote this a FM110 state. It occupies the\ncorresponding region in Fig. 1.\n3.\n\nFerromagnetic 100 (FM100) state\n\nBetween the AFM and FM110 states, a narrow region of intermediate phase intervenes (see Fig. 1). Numerically we find this\nphase is characterized by two parameters r1 and r2 ,\nr\n\u0001\nr1\n1 − r12\nz\nz\n1\n1\n|ψA iFM100 = √ (|j = 2 i + |j = − 2 i) +\n|j z = 23 i + |j z = − 32 i\n(57)\n2\n2\nr\nr2\n1 − r22\nz\nz\n1\n1\n(58)\n|ψB iFM100 = √ (−|j = 2 i + |j = − 2 i) +\n(−|j z = 23 i + |j z = − 32 i) .\n2\n2\nThe parameters r1 and r2 are determined by J 0 /J and V /J and in this intermediate phase r1 6= r2 . A second ground state is\nobtained then by interchanging r1 and r2 . The orbital occupation numbers and spin vectors are give by\nq\nq\n1 r2\nr1\n1 r2\nr1\n2r2\n(hñA,yz i, hñA,xz i, hñA,xy i)FM100 = ( − 1 − √\n1 − r12 , − 1 + √\n1 − r12 , 1 ),\n(59)\n2\n3\n2\n3\n3\n3\n3\nq\nq\n1 r2\nr2\n1 r2\nr2\n2r2\n(hñB,yz i, hñB,xz i, hñB,xy i)FM100 = ( − 2 + √\n1 − r22 , − 2 − √\n1 − r22 , 2 )\n(60)\n2\n3\n2\n3\n3\n3\n3\n\n\f9\nand\n\u0012\nhjA iFM100 =\n\u0012\nhjB iFM100 =\n\nr12\n\n+ r1\n\nq\n\n\u0013\n\n3−\n\n3r12 , 0, 0\n\n(61)\n\n\u0013\nq\n2\n2\nr2 − r2 3 − 3r2 , 0, 0 .\n\n(62)\n\nWe see that the net spin polarization is along the [100] direction. Due to cubic symmetry, all possible [100] directions are\npossible. By analogy with the previous phase, we denote this phase FM100. It occupies the narrow region shown in Fig. 1.\n\n4.\n\nTransitions\n\nThe intermediate FM100 state in Eq. (58) is smoothly connected to the AFM state, which is obtained by setting r1 =\nr2 = 0. By contrast, it cannot be connected to the FM110\nstate. This indicates that the transition between FM100\nto AFM is continuous while the transition from FM100 to\nFM110 is first-order. Indeed, this can also be clearly seen\nfrom the behavior of the spin and orbital order parameters\nacross these transitions (see Fig. 3). Both the spin and orbital\norder parameters jump when the system goes from FM100\nphase to FM110 phase.\nThe approach to the line J 0 = 0, while not a transition per\nse, does represent a change of behavior. In particular, on this\nline, the hidden SU(2) symmetry is restored, and new ground\nstates may be obtained from the above three phases by SU(2)\nrotations. This allows, for instance, for AFM states to develop\nwith non-vanishing magnetic dipole order in the ground state.\nHowever, for arbitrarily small J 0 the SU(2)-induced degeneracy is broken and the results quoted above hold.\n\nC.\n\nIntermediate anisotropy\n\nõ\nõó\nõó\nõó\nõó\nõó\nõó\nõó\nõõõ ó\nõó\nõó\nõõõ õó\nõõó\nõõõ ó\nõ\nõ\n0.05\nõ\nõõõ\nõõõ\nõõõ\nó\nõõõ\nóóóó\nõõõ\n0.04\nõ\nóóóó\nõ\nóóóó\nõõõ\nóóóó\nõõõ\nó\nó\nõ\nó\nõ\nõ\nóóó\nõõõ\nóóó\n0.03\nóóó\nõõõ\nóóó\nõõõ\nóóó\nõ\nõõõ óóóóóó\nõ\nA,xy\nõ\n0.02\nõõ óóóóóó\nõõ\nõõ óóó\nó\nõõ óóóóóó\nõ\nB,xy\nõõ óó\n0.01\nõõóóóó\nõõóóó\nõõ\nóóó\nõó\nó\nõ\n0.00 ó\nõó\nõó\nõó\nõó\nõó\nõó\nõó\nõó\nõó\nõó\nõó\nõó\nõó\nõó\nõó\nõó\n0.21\n0.22\n0.23\n0.24\n0.25\n0.26\n0.06\n\nn\u008e\nn\u008e\n\nV\nõõõõõõõõõõõõõõõõõ\nõõõõõõõõõõõõõõõ\nõõõõõ\nõõõõõõõõõõõõ\nõõõõõõõõõõõõõõõ\nõõõõõõõõõõ\nõõõõõõõõõõõõ\nõõõõõõ\nõõõõ\nõõõõõõõõõõ\nõõõõ\nõõõ\nõõõõõõõõ\nõ\nõ\nõ\nõ\nõ\nõ\nõ\nõ\nõ\nõõõõõõ\nõõõõ\nõõõõ\nõõõ\n0.55\nó\nA,xz\nõõõ\nõõ\nõõ\nõ\nB,yz\n0.50 õ\nóõ\nóõ\nóõ\nóõ\nóõ\nóõ\nóõ\nóõ\nóõ\nóõ\nóõ\nóõ\nóõ\nóõ\nóõ\nó\nó\nó\nB,xz\nó\nóó\nóó\n0.45\nõ\nóó\nóóó\nóó\nA,yz\nóóó\nóóó\nóóó\nó\nó\nó\nóóó óóóóó\nóóóó óóóóó\n0.40\nóóóó óóóóóóó\nóóóóó\nóóóóóóó\nóóóóó\nóóóóóó óóóóóóóóóóóóóó\nó\nóóóóóó\n0.35\nóóóóóóó óóóóóóóóóóóóóóóó\nóóóóóóóó\nóóóóóóóó óóó\nóóóóó óóóóóóóóó\nó\n0.30\n0.21\n0.22\n0.23\n0.24\n0.25\n0.26\n0.60\n\nn\u008e\u008e\nn\nn\u008e\u008e\nn\n\nV\n0.4\n\n0.3\n\nWe briefly address here the evolution of the ground\nstates with increasing |D| between the cubic and strongly\nanisotropic limits. For easy-axis anisotropy, D > 0, this\nprocess is relatively simple. The AFM phase (with Q =\n2π(001)) is favored by this sign of anisotropy, and therefore,\nwith increasing D, it expands at the expense of the FM110\nand FM100 states. Indeed, for very large D, ferromagnetic\nstates occur only for unphysically large J 0 and V .\nIn the case of easy-plane anisotropy, D < 0, the phase diagram is more subtle. For weak |D|, the main effect is to break\nthe symmetry between the formerly equivalent [100] wavevectors. In this case, states with minimal hjz2 i are favored, which\nprefers Q = 2π(100), 2π(010) rather than Q = 2π(001).\nIf we begin in the AFM state for D = 0, this aligns\nthe pseudospin in the plane normal to this wavevector. The\nphase degeneracy which obtains for the cubic case is broken by the anisotropy, and a definite alignment is obtained.\nMoreover, as states with jz = ±1/2 are increasingly mixed\ninto the ground state, a non-vanishing dipole moment, proportional to the pseudospin, is induced. The magnitude of\nthis staggered magnetization grows continuously with |D|,\neventually as D → −∞, approaching the value obtained in\nSec. III A 2. This local moment is oriented in the plane nor-\n\n0.2\n\n0.1\n\nõ\nõõõõõõ\nõõõõõ\nõõõõõ\nõõõõõ\nõõõõ\nõ\nõ\nõ\nõõ\nõõõõ\nõ\nõó\nõó\nõó\nõó\nõó\nõó\nõõõõ\nõó\nõó\nõó\nõó\nõó\nõó\nó\nõõõ\nõõõ\nõõõ\nõ\nõ\nõ\nõ\nõ\nõõõ\nõõ\nõõ\nõõ\nõõ\nx\nx\nõ\nõ\nõ\nõ\nA\nB\nõ\nõ\ny\ny\nó\nõ\nõ\n\nH j + j L\u00902\nH jA+ jBL\u00902\n\n0.0 ó\nõó\nõó\nõó\nõó\nõó\nõó\nõó\nõó\nõó\nõó\nõó\nõó\nõó\nõó\nõó\nõóóóóóóóóóóóóóóóóóóóóóóóóóóóóóóóóóóóóóóóóóóóóóóóóóóóóóóóóóóóóóóóóóóóóóóó\n0.21\n0.22\n0.23\n0.24\n0.25\n\n0.26\n\nV\nFIG. 3. (Color online) Upper graph: ñxy versus V ; middle graph:\nñxz and ñyz versus V ; lower graph: the net spin polarization per site\nversus V . In all three graphs, J = 1 and J 0 = 0.2, and T = 0.\nThe assignment of A and B sublattices is arbitrary. Here we take the\nchoice given in the text.\n\nmal to Q, and can take values distributed over an ellipse in\nthis plane. In the large |D| limit, this ratio of the major (perpendicular to Q and to z) and minor (z) axes of the ellipse\napproaches 2, corresponding to the accidental degeneracy discussed in Sec. III A 2 . Because the state for non-zero D\nevolves smoothly into this limit, and has a non-zero local moment, we denote it an AFM' state, following the earlier notation.\n\n\f10\nBeginning in the FM110 state at D = 0, one observes two\nsubsequent transitions. First, small |D| orients the magnetization normal to Q. For concreteness consider Q = 2π(100), in\nwhich case one obtains a ferromagnetic magnetization of the\nform m = (0, m1 , m2 ). For D = 0− , m1 = m2 , but subsequently m2 decreases such that m2 < m1 . We denote this\nstate FM110*. An example for the orientation of net polarization in the FM110* by varying V is given in Fig. 4. Eventually once some critical anisotropy is reached, m2 vanishes\ncontinuously. At this point the magnetization is aligned along\nthe (010) axis. For yet larger anisotropy, eventually the ferromagnetic magnetization vanishes entirely, and the ground\nstate switches to the AFM' state. An example of the transitions from FM110* to FM100 then to AFM' by varying the\neasy-plane anisotropy D is given in Fig. 5.\nFinally, starting in the FM100 state, the magnetization immediately switches to the (010) direction. This is the same\nphase as the intermediate phase observed starting from the\nFM110 phase. Thus with further increase in anisotropy, the\nground state switches to the AFM' state.\nOne may also visualize the evolution of the ground states\nwith anisotropy by considering planar phase diagrams at fixed\nD. With increasing positive D (Ising anisotropy), the AFM\nstate is stabilized, and simply expands in the J 0 − V plane,\npushing the FM100 and FM110 states outward. For increasing negative D, apart from the fact that the AFM and FM110\nstates evolve into the AFM' and FM110* states, the behavior is similar: the AFM' state expands at the expense of the\nferromagnetic states.\n\n0.6\n\n0.4\n\n0.2\n\n0.0\n-0.5\n\n-0.2\n\n-0.1\n\n0.0\n\nD\nFIG. 5. (Color online) The net polarization versus the easy plane\nanisotropy, at T = 0. The upper curve (in red) is for the y component\nof the net polarization. And the lower curve (in blue) is for the z\ncomponent of the net polarization. The ordering wavevector is Q =\n2π(100). In the graph, J 0 = V = 0.4 and J = 1. When 0 < |D| .\n0.36, the system is in FM110∗ phase; when 0.36 < |D| < 0.41, the\nsystem is in the FM100 phase; when |D| & 0.41, the system is in\nAFM' phase.\n\nnatural to introduce several types of order parameter. First, on\na single site i, we may measure the dipole moment, which is\nproportional to ji . However, we may also measure the next\ntwo multipoles: the quadrupole moment, proportional to\nμ ν\nQμν\ni = hji ji i −\n\nj(j + 1) μν\nδ ,\n3\n\nOiμνλ = jiμ jiν jiλ .\n\n0.95\n\ncosΘ\n\n-0.3\n\n(63)\n\nand the octupole moment\n\n1.00\n\n(64)\n\n0.90\n0.85\n0.80\n0.75\n\n0.0\n\n0.2\n\n0.4\n\n0.6\n\n0.8\n\nV\nFIG. 4. (Color online) The orientation of the net spin polarization\nfor the FM110∗ phase, at T = 0. θ is angle between the net spin\npolarization and nearest [110] direction.√In the figure, J 0 = 0.2, D =\n−0.05, J = 1. cos θ increases from 1/ 2 for the FM100 phase to 1\nfor the FM110∗ phase as V goes through the phase transition point.\n\nA typical magnetic state has a non-vanishing local dipole moment, which inevitably induces some higher multipole order\nparameters (see below). However, one sometimes encounters\npurely multipole states, in which hjiμ i = 0 but Qμν\nand/or\ni\nOiμνλ are/is non-vanishing.\nThe components of these tensor can be decomposed into\nirreducible representations of the cubic group (characterizing\nthe symmetry of the ideal double perovskite structure). This\ndecomposition is described fully in Table I. Here we note in\nparticular the two-dimensional Γ3 representation\n2\n1\nQ3z\n= √ 3(jiz )2 − j(j + 1) ,\ni\n3\n2\n\nQxi\nIV.\n\n-0.4\n\nMULTIPOLAR ORDERS AND T > 0 BEHAVIOR\nA.\n\nOrder parameters\n\nIn this section, we extend the analysis of the previous section to non-zero temperature. To do so, we employ the usual\nextension of mean field theory to include thermal fluctuations.\nTo characterize the phases encountered in this treatment, it is\n\n−y 2\n\n= (jix )2 − (jiy )2 ,\n\n(65)\n\nwhich are analogous to the eg orbitals in atomic physics. The\ny x\nx y\nremaining three independent components of Qμν\ni (ji ji +ji ji\netc.) form a three-dimensional representation analogous to the\nt2g orbitals, but do not appear in our analysis.\nAnother important way to break up the tensor order parameters is into combinations which appear in the spin Hamiltonian. Specifically, these are the orbital occupation operators,\nñi,yz , ñi,xz , ñi,xy , and the orbitally-resolved spin operators,\nμ\nμ\nμ\nS̃i,yz\n, S̃i,xz\n, S̃i,xy\n. These can be expressed in terms of the\n\n\f11\nMoment\nDipole\n\nSymmetry\nΓ4\n\nQuadrupole\n\nΓ3\nΓ5\n\nΓ2\nΓ4\n\nOctupole\n\nΓ5\n\nOperator\nM x = jx\nM y = jy\nM z = jz\n√\n3z 2\nQ\n= [3(j z )2 − j 2 ]/ 3\n2\n2\nQx −y = (j x )2 − (j y )2\nQxy = j x j y /2\nQyz = j y j z /2\nQxz √\n= j z j x /2\nTxyz = 15/6j x j y j z\nx\nTα = (j x )3 − [j x (j y )2 + (j z )2 j x ]/2\nTαy = (j y )3 − [j y (j z )2 + (j x )2 j y ]/2\nz 3\nTαz = (j√\n) − [j z (j x )2 + (j y )2 j z ]/2\nx\nTβ = √15[j x (j y )2 − (j z )2 j x ]/6\nTβy = 15[j y (j z )2 − (j x )2 j y ]/6\n√\nTβz = 15[j z (j x )2 − (j y )2 j z ]/6\n\nTABLE I. Multipole moments within a cubic Γ8 quartet. Bars over\nsymbols indicate the sum with respect to all the possible permutations of the indices, e.g. j x (j y )2 = j x (j y )2 + j y j x j y + (j y )2 j x .\nAdapted from Ref. 11 and Ref. 31.\n\nmultipoles describe above. For the occupation numbers,\n2\n1\n1\n+ √ Q3z\n−\ni\n3 6 3\n2\n1\n1\n= + √ Q3z\n+\ni\n3 6 3\n2\n1\n1\n= − √ Q3z\n.\n3 3 3 i\n\nñi,yz =\nñi,xz\nñi,xy\n\n1 x2 −y2\nQ\n,\n6 i\n1 x2 −y2\nQ\n,\n6 i\n(66)\n\nto small thermal fluctuations, and hence persist at low temperature. Thus we expect, broadly speaking, an antiferromagnetic (AFM) and ferromagnetic (FM110/FM100) region\nat low temperature. Of course, at temperatures much larger\nthan J, one has a disordered paramagnetic phase. Interestingly, an additional phase appears at intermediate temperature. This is a non-magnetic quadrupolar ordered phase.\nTo see how this arises, we describe the mean-field procedure and its results. Mean field theory is formulated in\nthe usual way. We self-consistently decouple interactions between different sites i and j as follows:\nÔi * Ôj ⇒ Ôi * hÔj i + hÔi i * Ôj\n−hÔi i * hÔj i. ,\nwhere Ôi and Ôj are two operators at site i and j, respectively.\nThese operators are nothing but the orbital occupation numbers and orbitally resolved spins, which are related to the multipolar operators by Eqs. (66)- (67). Decoupling all pairwise\ninteractions between sites in this way, we then obtain a set of\nsingle-site problems for each j = 3/2. Note that these singlesite problems involve not just the usual Weiss exchange field,\nbut also \"multipolar fields\", which act as effective second and\nthird order spin anisotropies. The mean-field equations determine self-consistent values of the orbital occupation numbers\nand orbitally resolved fields. As it is straightforward to formulate the mean-field equations, and solve them numerically,\nwe do not give the details of these calculations here.\nA distinct class of solutions describes each phase. For the\nantiferromagnetic phase, we find the following operators are\nnon-zero:\n\nThe orbitally-resolved spins decompose as\nx\nS̃i,yz\n=\ny\nS̃i,yz\n=\nz\nS̃i,yz\n=\nx\nS̃i,xz\n=\ny\nS̃i,xz\n=\nz\nS̃i,xz\n=\nx\nS̃i,xy\n=\ny\nS̃i,xy\n\n=\n\nz\nS̃i,xy\n=\n\n1 x\n2 α\nji − Ti,x\n15\n15\n2 y\n1 y\n1\ny\nji + Ti,α\n+ √ Ti,β\n,\n15\n15\n3 15\n2 z\n1 z\n1\nz\nj + Ti,α\n− √ Ti,β\n,\n15 i\n15\n3 15\n1 x\n1\n2 x\nx\nji + Ti,α\n− √ Ti,β\n,\n15\n15\n3 15\n2 y\n1 y\nj − Ti,α\n15 i\n15\n2 z\n1 z\n1\nz\nj + Ti,α\n+ √ Ti,β\n,\n15 i\n15\n3 15\n2 x\n1 x\n1\nx\nj + Ti,α\n+ √ Ti,β\n,\n15 i\n15\n3 15\n2 y\n1 y\n1\ny\nji + Ti,α\n− √ Ti,β\n,\n15\n15\n3 15\n1 z\n2 z\nj − Ti,α\n15 i\n15\n\nB.\n\n(68)\n\nhji i = ±n(u1 , u2 , 0),\n2\nhQ3z\ni i\n\n= q,\nhTi,α i = ±tα (u1 , u2 , 0),\nhTi,β i = ±tβ (−u1 , u2 , 0),\n\n(69)\n(70)\n(71)\n(72)\n\nwhere we have taken Q = 2π(0, 0, 1) for concreteness, and\nthe upper and lower signs refer to the A and B sublattices,\nrespectively. The parameters n, q, tα , and tβ are positive at\nall T > 0 in the AFM phase. However, note that n vanishes\nin the limit T → 0, in agreement with the vanishing dipole\nmoment discussed earlier for the AFM ground state.\nIn the FM110 state, the non-zero expectation values are:\nhji i = m(1, 1, 0) ± n(1, −1, 0),\n2\n\nhQ3z\ni i = q,\n2\n2\nhQix −y i\n\n(74)\n0\n\n= ∓q ,\nhTi,α i = tα (1, 1, 0) ± t̃α (1, −1, 0),\nhTi,β i = tβ (1, −1, 0) ± t̃β (1, 1, 0),\n\n(67)\n\nCubic system: phases\n\nWe first discuss the phases occurring in the cubic system\nat T > 0. The ground states discussed earlier are all stable\n\n(73)\n\n(75)\n(76)\n(77)\n\nwhere again we took Q = 2π(0, 0, 1) and the upper/lower\nsigns refer to the A/B sublattices. In this case the parameters m, n, q, q 0 , tα , t̃α , tβ , t̃β are all non-zero at temperatures\nwithin the FM110 phase including T = 0.\nThe third ordered phase dominating the phase diagram is\nthe quadrupolar one (For the purposes of this section, we ignore the FM100 phase, which extends into a narrow region\n\n\f12\nof ferromagnetic state with variable polarization direction at\nT > 0, as it occupies a very small volume of the phase diagram). In the quadrupolar state, there is only a single nonvanishing order parameter:\nhQxi\n\n2\n\n−y 2\n\ni = ∓q 0 .\n\n(78)\n\nLet us discuss the symmetries of these three states. In the\nAFM and FM110 phases, time reversal symmetry is broken.\nHowever, the net magnetization vanishes in the AFM state.\nIn the AFM state, this is guaranteed by invariance under the\ncombined operations of translation (such as by (0, 1/2, 1/2),\nwhich interchanges the A and B sublattices) and time-reversal.\nNo such symmetry can be combined with time-reversal in the\nFM110 case. Various point group symmetries are also present\nin the AFM and FM110 phases, but we do not describe this in\ndetail.\nIn the quadrupolar case, time-reversal symmetry is unbroken, which is sufficient to require the dipolar and octupolar\norder parameters to vanish. Only point group symmetries are\nbroken by the quadrupolar order. Four-fold (C4 ) rotations\nabout the x or y axes, and three-fold (C3 ) rotations about [111]\naxes are broken in this state. While the C4 rotation about the\nz axis is also broken, the combination of this C4 rotation and\na translation exchanging the A and B sublattices remains a\nsymmetry of the quadrupolar state.\nA standard classification scheme for quadrupolar states is\nto examine the examine the eigenvalues of the Qμν\nmai\ntrix. These must sum to zero because the matrix is traceless. States in which there are only two distinct eigenvalues,\ni.e. eigs(Q) = {q, q, −2q} are called nematics, and correspond to the situation in which one principal axis is distinguished from the other two, which remain identical. In the\nmost general case, there are three distinct eigenvalues, i.e.\neigs(Q) = {q1 , q2 , −q1 − q2 }, with q1 6= q2 . This is called a\nbiaxial nematic, and is a state in which all three principal axes\nare distinct. The quadrupolar state obtained here is such a biaxial nematic. Physically, the local susceptibility in this state\nyy\nzz\ntakes distinct values χxx\nlocal , χlocal , χlocal for fields along each\nof the axes. However, note from Eq. (78) that the quadrupolar order parameter changes sign between the two sublattices.\nThus we should properly call this state an antiferro-biaxial nematic. Due to the staggered ordering, the bulk susceptibility\ndoes not distinguish all three axes. Instead, there are only\ntwo distinct components, χxx = χyy 6= χzz . The difference\nbetween the two components of the susceptibility serves as a\nsimple macroscopic means to observe quadrupolar ordering.\n\nC.\n\nthis assumption, we can determine the critical temperatures\nfor these transitions by the usual condition of marginal stability (vanishing of the quadratic term in the Landau theory) of\nthe free energy. We find that the critical temperature for the\nquadrupolar state is\n\nCubic system: phase diagram and transitions\n\nBy solving the mean-field equations numerically, we have\ndetermined the phase diagram for the cubic case. Parts of it\ncan be understood analytically. Suppose that the transitions\nfrom the high temperature normal phase to the quadrupolar\nand AFM phases are second order. This appears to be always\ntrue for the quadrupolar phase, while it true for the AFM for\nmost parameters, but weakly violated in some regions. With\n\nTcquad =\n\n43V + 18J 0 − 3J\n,\n18\n\n(79)\n\nand that for the AFM state is\np\nJ + 10J 0 + 73J 2 + 164JJ 0 + 100(J 0 )2\nAFM\nTc\n=\n. (80)\n36\nWithout the assumption that the transitions are continuous, the\ncritical temperature could be higher. Thus Eqs. (79,80) give\nlower bounds for the transition temperatures, strictly speaking. Extending the two-dimensional T = 0 phase diagram in\nFig. 1 into a third dimension of temperature, the quadrupolar\nphase occurs \"above\" the portion for which Tcquad > TcAFM ,\nwhich implies V > Vc , with\np\n7J − 26J 0 + 73J 2 + 164JJ 0 + 100(J 0 )2\nVc =\n. (81)\n86\nThe curve Vc (J 0 ) defines an almost straight line in the 2d\nphase diagram, as shown in Fig. 6. In fact, Eq. (81) slightly\nunderestimates Vc , as it assumes the normal to AFM transition is continuous, when it is in fact weakly first order in this\nvicinity. However, the true Vc found numerically is only a few\npercent larger. For V < Vc , no quadrupolar phase occurs.\nInstead, the first ordering transition from high temperature is\ninto the AFM state. This is true even when the ground state is\nferromagnetic, so that in this case (when V < Vc ) the system\nfirst orders into the AFM state, and then at lower temperature\nswitches to the FM110 phase.\nWe now discuss the nature of the transitions. The quadrupolar ordering transition is, as already mentioned, continuous\n(see Figs. 8, 9). It is described by a single scalar order parameter, (equal to q 0 in Eq. (78)), for each of the three [100]\nwavevectors, describing the associated staggered quadrupole\nmoment. Formally,\na\n\nφa = (−1)2xi hQix\n\n2\n\n−y 2\n\ni,\n\n(82)\n\nwhere x1i = xi , x2i = yi , x3i = zi . According to symmetry,\nthe Landau free energy for φa has the same form as that for an\nO(3) magnetic transition with cubic anisotropy. Beyond mean\nfield theory, this is believed to support a three dimensional\ntransition in the O(3) universality class.\nThe transition from the normal to the AFM state is continuous in mean field theory for small V (see Fig. 7), becoming\nweakly first order for larger V , close to Vc where the intermediate quadrupolar phase emerges. The normal-AFM transition\nis characterized, for each of the three wavevectors, by a twocomponent primary order parameter, which could be taken to\nbe the two components of TA,α normal to Q. In principle,\nthe degeneracy of the ordering pattern within this \"XY\" plane\nnormal to Q is, as we have remarked, accidental, and should\nbe removed by additional effects. We do not, however, observe this degeneracy lifting within mean field theory for the\n\n\f13\n1.0\n\n2.0\n\n0.8\n\n1.5\n\n0.6\n\nò\nà\nae\nò\n\n<Ψ> 1.0\n\nII\n\nV\n\nà à à à à\nae ae ae ae ae à\nae\n\nò\nò\nò\n\n0.4\n\n0.5\n0.2\n\nI\n0.0\n0.0\n\nIII\n0.2\n\n0.4\n\n0.6\n\nJ\n\n0.8\n\n1.0\n\n¢\n\nFIG. 6. (Color online) Zero temperature two-dimensional phase diagram in the cubic case (same as Fig. 1), overlaid with the regions\nof different T > 0 behavior. Dashed lines are obtained from mean\nfield numerics. The solid line (in orange) is defined by Eq. (81).\nIn region I, there is a single transition to the AFM state. In region\nII, the system supports an intermediate temperature quadrupolar ordered phase. The transition from the normal state to the quadrupolar\nphase is second order. In this region, there is a first order transition\nto the AFM phase on further cooling, for parameters such that the\nlatter is the ground state. Otherwise, the lower temperature transition is to a ferromagnetic (predominantly FM110) state. In region\nIII, the system first turns from normal phase to the AFM state then to\na ferromagnetic (predominantly FM110) state on further cooling.\n\nà à à\nae ae ae à à\nae\n1.5\nae à\n\n0.5\n\nT\u0090J\nFIG. 8. (Color online) Temperature dependence of order parameters\nfor J 0 /J = 0.1, V /J = 0.3. For these parameters, there is a continuous normal to quadrupolar transition, at T /J ≈ 0.65, followed by\na first order transition to the AFM state at T /J ≈ 0.37. The four order parameters plotted are: squares (red online) |hTA,α − TB,α i|/2,\n2\n2\ncircles (blue online) hQ3z\n+ Q3z\nA\nB i/2, diamonds (yellow online)\n2\n2\n2\n2\n|hjA − jB i|/2, and triangles (green online) hQxA −y − QxB −y i/2.\n\n2.0\nò\nòà\nòà\nòà\n1.5à\n\nòòòòò\nà\n\n<Ψ> 1.0ì ì ì\naeaeaeì\naeì\n0.5\nae\n\n2.0\n\n<Ψ> 1.0\n\nò ì ì\nò ì\nò ì\nò ì\nò ì\nò ì\nà ì\nà ì\nà ì\nà ì\nò ì\n0.0 ì\nae\nae\nae\nae\nae\nà\nae\nà\nò ì\nae\nà\nò ì\nae\nà\nò\n0.0\n0.2\n0.4\n0.6\n0.8\n\n0.0\n0.0\n\nae\nà\n\nae\n0.0ì ì ì ì ì ì ì ì\nae\nà ì\nae\nà ì\nae\nà ì\nae\nà ì\nae\nà ì\nae\nà ì\nae\nà ì\nae\nà\n0.0\n0.2\n0.4\n0.6\n0.8\n\nT\u0090J\nFIG. 7. (Color online) Temperature dependence of order parameters for J 0 /J = 0.2, V /J = 0.1. For these parameters, there is\na direct, continuous, normal to AFM transition, at T /J ≈ 0.38.\nThe three curves show: squares (red online) |hTA,α − TB,α i|/2, cir2\n3z 2\ncles (blue online) hQ3z\nA + QB i/2, and diamonds (yellow online)\n|hjA − jB i|/2. Note: in Figs.7-10, the symbols are not the data\npoints (which are much more dense) – they simply label the different\ncurves.\n\npresent model. With the degeneracy, the transition should be\ntherefore described by the free energy for some six component\norder parameter. As we do not understand the degeneracy lifting mechanism at present, we do not attempt here to establish\nthe true critical properties for this transition (when it is continuous) with fluctuations taken into account.\nThe quadrupolar to FM110 transition is continuous in mean\nfield theory (see Fig. 9). This could be anticipated by exam-\n\n0.2\n\nòò\n\nò\nò\nò\n\nà\nì\nò\naeì\nàì\nàì\nàì\nàì\nàì\nàì\nàì\nàì\nòì\nàì\nae\nae\nae\nae\nae\nae\nae\nae\nae\nae\nà\nae\nà\nòì\nae\nà\nò\n\n0.4\n\n0.6\n\n0.8\n\n1.0\n\nT\u0090J\nFIG. 9. (Color online) Temperature dependence of order parameters for J 0 /J = 0.3, V /J = 0.3. For these parameters, there is a\ncontinuous normal to quadrupolar transition, at T /J ≈ 0.85, followed by a continuous quadrupolar to FM110 transition at T /J ≈\n0.33. The four order parameters plotted are: squares (red online)\n2\n2\n+ Q3z\n|hTA,α − TB,α i|/2, circles (blue online) hQ3z\nB i/2, diaA\nmonds (yellow online) |hjA + jB i|/2, and triangles (green online)\n2\n2\n2\n2\nhQxA −y − QxB −y i/2.\n\nining the form of the order parameters in the FM110 phase.\nWe note that the antiferro-biaxial nematic order parameter of\nthe quadrupolar state is already non-vanishing in the FM110\nphase. Hence, we might naturally expect, upon heating,\nthat thermal fluctuations first restore time-reversal symmetry,\nyielding the quadrupolar phase, before fully restoring all symmetry in the normal state. To determine the nature of the order parameter for this transition, note that the wavevector and\nlocal anisotropy axes are already established in the quadrupolar state. Hence the direction of the uniform and staggered\nmagnetizations are already determined, up to a sign and interchange, above the transition. For instance, for the quadrupolar\nstate in Eq. (78), with Q = 2π(001), the uniform magneti-\n\n\f14\n2\n\n1.5 à\nà à\nò à\nò à\nò à\nò\n<Ψ>\n\nò\n\n1.0\n\nQ3z\nfield:\ni\n\nà\n\nae ì\nae ì\nae ae\nà\nì\nì ae\nae\nò\nì\n0.5\nae\nì\nae\nà\nò ì\nì\nò ì\nae\nò ì\n0.0\nae\nà\nò ì\nae\nà\nò ì\nae\nà\nò ì\nae\nà\nò\n\n0.0 0.1 0.2 0.3 0.4 0.5 0.6 0.7\n\nHD = −D\n\n2\n1\nDF\n\n0\n\nÈDÈ -1\n-2\n0.0\n\nzation can lie along ±(110) and the staggered magnetization\nalong ±(110), or vice-versa. Thus the symmetry breaking\nfrom the quadrupolar to the FM110 state is described by two\nIsing order parameters. We therefore expect this transition,\nbeyond mean field theory, to be similar to that of an AshkinTeller or similar models.\nThe quadrupolar to AFM transition appears strongly first\norder (see Fig. 8). This is in agreement with the expectations\nof Landau theory, as the symmetry of the AFM phase is not a\nsubgroup of the symmetry of the quadrupolar one. In terms of\n2\n2\norder parameters, this is evident since hQxi −y i is non-zero\nin the quadrupolar phase but zero in the AFM one, while the\nmagnetic order parameters are zero in the quadrupolar phase\nbut non-zero in the AFM. Fine tuning of the free energy would\nbe required to arrange both these types of order to change at\nthe same temperature in a continuous fashion.\nIn region III one encounters a transition from the AFM to\nFM110 state. This appears to be continuous in mean field theory (see Fig. 10). One can understand this by noting that the\nAFM solution can be regarded as a subset of the FM110 one, if\nthe unit vector (u1 , u2 , 0) is taken to be along (1, −1, 0). Then\nthe transition to the FM110 is described by the emergence of\na non-zero m. Like the normal to AFM transition, because\nwe have not understood the degeneracy-breaking mechanism\nin the AFM state, we do not attempt to analyze this transition\nbeyond MFT.\n\nD.\n\nEffects of anisotropy\n\nWe now consider the effects of anisotropy on the T > 0\nphase diagram, focusing on the case of weak |D| \u001c J, J 0 , V .\nWe have already considered the effects of D on the AFM and\nFM110 states in Sec. III B 4. We saw that easy-axis anisotropy\nfavors states with the wavevector Q parallel to the z (easy)\naxis. This is because the anisotropy couples directly to the\n\n(83)\n\nBoth the AFM and FM110\nstates have a non-zero and constant\n2\nexpectation value of Qi3z , which is maximized in this orientation. Conversely, easy-plane anisotropy favors states with\nthe wavevector Q perpendicular to the z (hard) axis, for the\nsame reason.\n\nT\u0090J\nFIG. 10. (Color online) Temperature dependence of order parameters for J 0 /J = 0.40, V /J = 0.05. For these parameters, there is a\ncontinuous normal to AFM transition, at T /J ≈ 0.49, followed by a\ncontinuous AFM to FM110 transition at T /J ≈ 0.34. The four order parameters plotted are: squares (red online) |hTA,α − TB,α i|/2,\n2\n2\ncircles (blue online) hQ3z\n+ Q3z\nA\nB i/2, diamonds (yellow online)\n2\n2\n2\n2\n|hjA + jB i|/2, and triangles (green online) hQxA −y − QxB −y i/2.\n\nX\nD X 3z2\n(jiz )2 = const. − √\nQi .\n3 i\ni\n\n0.2\n\n0.4\n\n0.6\n\n0.8\n\n1.0\n\n1.2\n\nT\u0090J\nFIG. 11. Temperature dependence of the free energy difference between states with wavevector parallel and perpendicular to the Ising\naxis, in the presence of a weak anisotropy |D| = 0.05. Here\nJ 0 /J = V /J = 0.3. Solid line: ∆F = F (Q k ẑ; D =\n.05) − F (Q ⊥ ẑ; D = .05). Dotted line: ∆F = F (Q k ẑ; D =\n−.05) − F (Q ⊥ ẑ; D = −.05). One sees that in the quadrupolar\nphase, both signs of anisotropy favor the wavevector aligned with the\nz axis. In the FM110 phase, however, this is favored only for D > 0.\nFor D < 0 (easy plane anisotropy), the state with wavevector normal\nto z is preferred. Note also that the energy difference is much larger\nin the FM110, consistent with the expected linear and quadratic dependence on D in FM110 and quadrupolar phases, respectively.\n\nWe now repeat this analysis for the quadrupolar state.\n2\nHere the situation is more subtle because hQi3z i vanishes\nin the quadrupolar state. Moreover, the cubic rotations (e.g.\n2\nhQ3x\ni i), while not vanishing, give zero net contribution due\nto the opposite signs on the A and B sublattices. This means\nthat the splitting of the different wavevector states vanishes\nat linear order in D. There is instead a quadratic contribution, which, numerically, we find favors the states with Q\nparallel to z (see Fig. 11). Being quadratic in D, this same\nconfiguration is favored for both the easy-axis and easy-plane\ncase. Thus we have the interesting situation that for easyplane anisotropy, the wavevector orients parallel to z in the\nquadrupolar phase, but perpendicular to z in the low temperature phase. Note that the quadrupolar phase remains distinct\nfrom the normal phase even with non-zero D, as it continues\nto break symmetries, notably translational invariance.\nE.\n\nMagnetic susceptibility\n\nIn this subsection, we discuss the magnetic response at T >\n0, which is an important indicator, especially of the quadrupo-\n\n\f15\n\ng 2 Μ2B\nΧ\n\n0.8\n\n1.0\n\n0.7\n\n0.8\n\n0.6\n\ng 2 Μ2B\nΧ\n\n0.5\n\n0.6\n0.4\n0.2\n\n0.4\n\n0.3\n0.0\n\n0.2\n\n0.4\n\n0.6\n\n0.0\n0.0\n\n0.8\n\nFIG. 12. (Color online) Inverse susceptibility at the normal to AFM\ntransition for J 0 = V = 0.1J. Blue (upper) curve: 1/χxx , red\n(lower) curve: 1/χzz .\n\nlar ordering transition. At high temperature, of course, one\nobserves Curie-Weiss behavior. For the general Hamiltonian\nwith anisotropy D, there are two different Curie-Weiss temperatures, for fields parallel and perpendicular to z:\nJ\n32J 0\n4D\n+\n+\n,\n5\n45\n5\nJ\n32J 0\n2D\n=− +\n−\n.\n5\n45\n5\n\nΘzz\nCW = −\nΘxx\nCW\n\n0.2\n\n0.4\n\n0.6\n\n0.8\n\n1.0\n\n1.2\n\nT\u0090J\n\nT\u0090J\n\n(84)\n\nThese are obtained from the high temperature expansion of\nthe susceptibility up to O(1/T 2 ). These expressions may be\nuseful in extracting exchange constants from experiment. Interestingly, if one calculates the powder average average susceptibility, the contributions of the anisotropy cancel at this\norder and the Curie-Weiss temperature measured in this way\nis independent of D. It is also interesting to note that, in the\nregion of larger V /J and small J 0 /J, one obtains a ferromagnetic ground state with an antiferromagnetic (negative) CurieWeiss temperature.\nOn lowering temperature, the susceptibility shows distinct\nbehaviors in the different parts of the phase diagram. We focus\nhere for simplicity on the cubic system, starting with region I.\nHere the susceptibility displays the usual cusp associated with\nantiferromagnetic order, at the normal to AFM transition. The\ninverse susceptibility is plotted in Fig. 12 for J 0 = V = 0.1J,\nin the midst of region I. It shows a minimum at the transition,\nand pronounced curvature below the transition temperature,\nsaturating to a large constant value in the T → 0 limit. We\nnote that the large zero temperature susceptibility is not related to gapless excitations, but is a general consequence of\nstrong SOC, and should be expected in all parameter regimes\nof this model.\nNext consider region II. Here, one observes a cusp at the\nnormal to quadrupolar transition. This cusp is, however, rather\ndifferent from the one just mentioned. Specifically, it is not a\nminimum of 1/χ, and instead separates two distinct \"CurieWeiss\" regimes in which 1/χ is linear but with different, positive, slopes (i.e. different effective magnetic moments). The\npresence of a lower temperature Curie-Weiss regime is a signature of quadrupolar order. This is because the quadrupolar mean field splits only the point group degeneracy of the\n\nFIG. 13. (Color online) Inverse susceptibility for for J 0 = 0.2J,\nV = 0.3J. Blue (lower) curve: 1/χxx , red (upper) curve:\n1/χzz , yellow (middle) curve: 1/χpowder . For these parameters the\nquadrupolar transition is at T /J ≈ 0.75, and the ferromagnetic transition is at T /J ≈ 0.23.\n\nspins, but preserves a local Kramer's doublet. This doublet\ngives rise to a Curie law. An example is plotted in Fig. 13.\nAs the quadrupolar order lowers the symmetry of the system\nto tetragonal, we see actually two different effective moments\nin susceptibility parallel to the wavevector Q (χzz ) and perpendicular to it (χxx = χyy ). We observe that the effective\nmagnetic moment seen in χxx is typically enhanced in the\nquadrupolar phase, while it is suppressed in χzz , both relative to the isotropic effective magnetic moment in the normal\nphase.\nAt still lower temperature, one encounters the ferromagnetic phases. Here of course the susceptibility for the easy\ndirections diverges. Focusing on the dominant FM110 phase,\none sees that since the easy direction is in the (001) plane selected by the quadrupolar order, χzz does not diverge, but χxx\nand χyy do.\n\nV.\n\nBEYOND MEAN-FIELD: SPIN WAVES AND\nNON-MAGNETIC GROUND STATES\n\nIn Sec. V A, we obtained the mean field phase diagram.\nHere we consider quantum effects beyond mean field. We\nfirst consider spin wave fluctuations, and obtain the collective mode spectrum in linear spin wave theory. From this,\nwe obtain the quantum correction to the order parameter, and,\nin the ideal case of J 0 = V = 0, we will see that this is\nvery large and invalidates the mean field theory in the vicinity of this parameter regime. This suggests the possibility of\nvery different states dominated by quantum fluctuations. We\nthen explore this possibility, considering some candidate nonmagnetic ground states of our model.\nFirst, we consider the quantum ground states of pairs of\nsites, unveiling a pseudo-singlet structure, analogous to the\nS = 0 singlet ground states for pairs of antiferromagnetically\ninteracting spins with SU(2) symmetry. This leads naturally\nto the possibility of \"valence bond\" states built from these\npseudo-singlets. We consider both a static, Valence Bond\nSolid (VBS) state, and states in which the valence bonds are\n\n\f16\nfluctuating, in which case we obtain a Quantum Spin Liquid\n(QSL) state.\nVery little theoretical work has been done on QSL states in\nsystems with strong spin orbit coupling, i.e. with strongly broken SU(2) symmetry. As such, the structure of possible QSL\nstates in the present model requires particular investigation.\nGuided by the pseudo-singlet structure, and the hidden SU(2)\nsymmetry of the model, we construct candidate QSL states for\nthe full Hamiltonian, H̃ex-1 , by a slave-particle technique.\nA.\n\nSpin waves\n\nwhere the coefficients Cklmn (i, j) (which are straightforward\nto obtain, so we do not give them explicitly) depend linearly\non J, J 0 and V .\nTo introduce the HP transformation on sublattice A (B),\nwe choose |1i as the vacuum which is annihilated by three\n\"magnon\" annihilation operators an (bn ), n = 2, 3, 4. One\ncan think these three bosons as descending from mixed spin\nand orbitals fluctuations of the Hamiltonian before the P 32\nprojection. The HP transformation is defined as33 , for i in\nthe A sublattice,\nX\nS11 (i) = M −\na†n (i)an (i),\n(89)\nn6=1\n\nIn the previous two sections, we have discussed the state\nphase diagram based on mean-field theory. Here, we perform\na linear spin wave analysis, which perturbatively describes the\neffect of quantum fluctuations on the various phases obtained\nso far, and also predicts the structure of collective modes,\nwhich might, e.g., be observed in inelastic neutron scattering.\nFinally, because we have not explored the full space of meanfield states, the calculation also provides an important check\nthat the phases we have found are at least metastable.\nThe conventional Holstein-Primakoff (HP) transformation\nfor spin-S operators cannot be directly applied for the three\nvariational ground states because none of the three states is\na fully polarized state for any projection of the spin angular momentum operator j. This is especially severe for the\nAFM state, for which the spin expectation value simply vanishes. Instead, we formulate an \"SU(4) spin wave theory\", by\nrewriting the Hamiltonian, (27), in a bilinear form in terms\nof the 15 generators of the SU(4) group. To do so, we introduce, for any local basis for the single-site Hilbert space\n{|ni}, n = 1, 2, 3, 4, the complete set of operators32\nn\nSm\n= |mihn|.\n\n(85)\nn\n, Skl ]\n[Sm\n\n=\nThese SU(4) generators obey the algebra\nl\n− δml Skn . We can then use the HP transformation for\nδnk Sm\nthe generators of SU(4). In this transformation, one selects a\nparticular state in the four-dimensional basis to be the vacuum\nand introduces three bosons associated with excitations to the\nthree other states. For the AFM phase, the classical ground\nstate is given by Eq. (40). Hence we take, on the A sublattice\n(zi integer), the basis\n1\n|1iA = √ (|3/2i + eiφ | − 3/2i), |2iA = |1/2i,\n2\n1\n|3iA = | − 1/2i, |4iA = √ (|3/2i − eiφ | − 3/2i),(86)\n2\nwhile for sublattice B (zi half integer),\n1\n|1iB = √ (|3/2i − eiφ | − 3/2i), |2iB = | − 1/2i,\n2\n1\n|3iB = |1/2i, |4iB = √ (|3/2i + eiφ | − 3/2i). (87)\n2\nThe Hamiltonian H̃ in Eq. (27) in this basis has a quadratic\nform,\nX\nn\nH̃ =\nCklmn (i, j) Skl (i) Sm\n(j),\n(88)\nhiji\n\ns\nX †\n1\n†\nal (i)al (i),\nSn (i) = an (i) M −\n\n(n 6= 1) (90)\n\nl6=1\n\nSnl (i) = a†n (i)al (i).\n\n(l, n 6= 1), (91)\n\nwhile for i in the B sublattice, the same formula holds with\nan (i) replaced by bn (i). In the above equations M is defined\nas the number of columns in the Young tableaux for the representation of SU(4). In our case (fundamental representation),\nwe must set M = 1. In the generalization to arbitrary M , the\nclassical limit where the classical ground state becomes exact is M → ∞. However, we apply this HP transformation\ndirectly for M = 1. Inserting this into (88), we expand it to\nobtain a quadratic form in the bosonic operators. The constant\nterm in the expansion gives the classical ground state energy,\n\u0012\n\u0013\nJ\n11V\nEAFM\n= M2 − + J0 +\n,\n(92)\nN\n2\n12\nindependent of the phase φ. The quadratic terms lead to quantum corrections. Defining the Fourier transform of the bosonic\noperators,\nP the spin-wave Hamiltonian can be organized in the\nform k Hk with\n\u0012\n\u0013\u0012\n\u0013\nAk\nFk G†k\nHk = ( A†k A−k )\n(93)\nGk Fk\nA†−k\nwhere Ak = (a2k , a3k , a4k , b2k , b3k , b4k ) is the vector of\nmagnon annihilation operators and Fk and Gk are 6 × 6 matrices. This spin-wave Hamiltonian can be diagonalized by\nstandard methods.34\nFor the AFM ground state, Eq. (40), we obtain a gapless\n\"magnon\" mode, as depicted in Fig. 14. This gapless mode\nis associated with the continuous accidental degeneracy, and\nindeed occurs for arbitrary φ. By contrast, in the FM110 and\nFM100 phases, one observes a gap for all the spin wave modes\n(see Fig. 15 and Fig. 16). The gap in the FM110 phase increases with J 0 , as expected since this corresponds to increasingly violated SU(2) symmetry. In all cases, the modes are\nall well-defined with positive real frequencies, indicating the\nstability of the phases in the classical sense: i.e. that we have\nproperly found local energy minima of the mean field theory.\nFinally, having obtained the spin wave modes, we can evaluate the quantum corrections. It is most interesting to consider\nthe reduction of the order parameter by quantum fluctuations.\nWe can define this by considering the probability to find a\n\n\f17\n2.5\n\n2.0\n\n1.5\n\nΩ\n\ngiven spin in its mean-field ground state. This is nothing but\nthe vacuum state of the HP bosons. Hence this probability is\ngiven, for a site on the A sublattice, by\nX\nPgs (i) = h1 −\na†n (i)an (i)i.\n(94)\n\n1.0\n\nn6=1\n0.5\n\nThis quantity is directly analogous to the staggered magnetization in the usual HP treatment of a quantum antiferromagnet.\nWe therefore denote ∆M = 1 − Pgs (i) =\nP\n†\nha\n(i)a\nn (i)i. This is obtained, at T = 0, by integratn6=1 n\ning the zero point contribution to the boson number from each\nspin wave mode. The quadratic spin-wave Hamiltonian is diagonalized by a Bogoliubov transformation Qk ,\n†\n(Ck , C−k\n)T = Qk (Ak , A†−k )T ,\n\n1\n\n2\n\n3\n\n4\n\n5\n\n6\n\nFIG. 15. Spin wave spectrum for the FM110 phase at J 0 = 0.3 and\nV = 0.2 along [001] momentum direction. The lowest excitation\nmode has an energy gap ∆ = 0.241 at k = 0. In the graph, J = 1.\n2.0\n\nΩ\n\n1.5\n\n1.0\n\n0.5\n\ni∈B\n\n6\n1 1 XX †\n{\n[Q Q]ii − 3}.\n2 N\ni=1\n\n=\n\n0\n\nk\n\n(95)\n\nin which, Ck = (c1k , c2k , c3k , c4k , c5k , c6k ), and Qk is a 12×\n12 matrix. From this we obtain the quantum correction\nX\n1 XX †\n[\nan (i)an (i) +\nb†n (i)bn (i)]\n∆M =\nN\nn6=1 i∈A\n\n0.0\n\n0.0\n\n(96)\n\n0\n\n1\n\n2\n\n4\n\n5\n\n6\n\nk\n\nk\n\nNumerically, we find that this quantum correction is maximal for J 0 = V = 0, and is given by ∆M ≈ 1.7 at this point.\nThis is much larger than 1, implying that the fluctuations at\nthis point are large and that the mean field theory is at least\nquantitatively invalid. For increasing J 0 and V the correction\nbecomes significantly smaller, and mean field theory may be\nreliable. In the vicinity of the J 0 = V = 0, one may expect\na very different ground state, incorporating strong quantum\nfluctuations. We explore some possible non-magnetic ground\nstates in the remainder of this section.\n\n3\n\nFIG. 16. Spin wave spectrum for the FM100 phase at J 0 = 0.1 and\nV = 0.4 along [001] momentum direction. The lowest excitation\nmode has an energy gap ∆ = 0.0224 at k = 0. In the graph, J = 1.\nXY\nH̃ex-1\n(i, j). Remarkably, the ground state has a form identical\nto an SU(2) spin singlet, if written in terms of pseudospin-1/2\nstates j z = ±1/2:\n\n\u0001\n1\n|XYiij = √ | 12 ii | − 12 ij − | − 12 ii | 12 ij .\n2\n\n(97)\n\n1.4\n1.2\n\nΩ\n\n1.0\n0.8\n0.6\n0.4\n0.2\n0.0\n0\n\n1\n\n2\n\n3\n\n4\n\n5\n\n6\n\nk\nFIG. 14. Spin wave spectrum for the AFM phase at J 0 = 0.1 and\nV = 0.2 along [001] momentum direction. And J = 1. There is one\nlow-lying gapless mode. The fcc lattice constant is set to be a = 1.\nAnd the phase φ = 0 for the ground state in Eq. (40).\n\nB.\n\nPseudo-singlets in different planes\n\nOne may understand this result by writing down the projected\nspin and occupation number operators in xy orbitals, in the\nbasis of j z eigenstates (see Eq. 23):\n\n\n0\n1\nS̃xy =  σ  ,\n(98)\n3\n0\n\n\n0\n2\nñxy =  I2  .\n(99)\n3\n0\nHere σ is the vector of Pauli matrices and I2 is the 2 × 2 identity matrix. One may consider S̃xy as an effective spin-1/2\noperator in the subspace of j z = ±1/2 states, which naturally\nexplains the SU(2) singlet in Eq. (97).\nFor the XZ and YZ planes, one simply needs to apply a cubic permutation to the results obtained for XY planes, or more\nformally, apply a unitary transformation that rotates about the\n[111] axis by ±2π/3,\n0\n\nWe start our analysis of non-magnetic states by considering\ntwo sites in the XY plane, which interact with the Hamiltonian\n\nμ\nμ\nS̃xz\n= U † S̃xy\nU,\n00\n\nμ\nμ\nS̃yz\n= U S̃xy\nU† ,\n\n(100)\n(101)\n\n\f18\ncompetitive, and may be considered as a possibility for future\nexploration.\nD.\n\nFIG. 17. (color online) Columnar Valence Bond Solid (VBS) state\nwithin an XY plane. The dashed square indicates the face of a conventional cubic unit cell, while the solid lines connect the FCC nearest neighbors within the plane, which form a 45◦ rotated square lattice.\n\nQSLs and Fermionic mean field theory\n\nThe most general approach that has been applied to describe QSL states is the slave particle method, in which auxiliary fermions are introduced, and the ground state for the\nspin system is described by some projection of a nominally\nsimple fermionic state into the physical spin Hilbert space.\nThis results, in the usual SU(2)-invariant case, in wavefunctions which are composed of superpositions of products of\nSU(2) singlets. Here, the appearance of two-site pseudosinglet ground states points to the possibility of applying a\nsimilar fermionic mean field theory. In this section, we implement this technique for the full antiferromagnetic exchange\ninteraction.\nWe first introduce the auxiliary fermionic creation operators, whose quanta we call \"spinons\"32\n†\n|αii = fiα\n|vacuumi,\n\nwith\n\u0013\n\u0012\n2π j x + j y + j z\n√\n.\nU = exp −i\n3\n3\n\n(102)\n\nThe upper indices μ0 = p(μ) and μ00 = p−1 (μ) in\nEqs. (100) and (101) denote cyclic and anti-cyclic permutations of x, y, z, respectively [i.e. p : (x, y, z) → (y, z, x),\nwith inverse p−1 : (x, y, z) → (z, x, y)]. The two-site ground\nstates in the XZ and YZ planes are the pseudo-singlets in the\nsubspace of j y = ±1/2 states and j x = ±1/2 states, respectively.\nValence bond solid state\n\nIt is natural to consider a product state of such pseudosinglet \"valence bonds\" (also called \"dimers\") as a candidate\n(prototypical variational) non-magnetic ground state. To do\nso, we must divide the spins into two neighboring sublattices, which will be paired. This by necessity breaks lattice\nsymmetries. Such a state is called a Valence Bond Solid, or\nVBS, state. At the level of valence bond product states, many\npossible arrangements of the dimers are degenerate. This degeneracy is artificial and will be broken if the wavefunctions\nare improved. We will not investigate this in any detail, and\njust consider the simplest VBS state in which the dimers form\na \"columnar\" arrangement within a single (001) plane. See\nFig. 17.\nThe variational energy of such a state (actually any state\nwith a planar arrangement of dimers has the same energy) is\nreadily evaluated. We obtain the energy per site EV BS /N =\nhV BS|H̃ex−1 |V BSi/N = −5/12J = −0.42J. This is\nslightly higher than the mean-field ground state energy of the\nMF\nAFM state, EAF\nM /N = −J/2. However, the large quantum\nfluctuations are expected to destabilize the latter state, and perhaps might stabilize the VBS one. So such a VBS state seems\n\n(103)\n\nwhere for convenience we have relabeled the states j z =\n3 1\n1\n3\n2 , 2 , − 2 , − 2 by α = 1, 2, 3, 4, respectively. The physical\nHilbert space is constructed from states with one fermion at\neach site, which imposes the constraint\n4\nX\n\n†\nfiα\nfiα = 1.\n\n(104)\n\nα=1\n\nIn this notation, the spin and number operators become\nS̃i,xy ⇒ Fi† S̃i,xy Fi ,\nñi,xy ⇒\n\nC.\n\nα = 1, ...4,\n\nFi† ñi,xy Fi\n\n(105)\n\n,\n\n(106)\n\nwhere on the right-hand side it is to be understood that the\nmatrices in Eqs. (98) and (99) act on the vector of spinon operators\nFi = (fi1 , fi2 , fi3 , fi4 )T .\n\n(107)\n\nSimilar expressions can readily be written for operators in XZ\nand YZ planes. Thus the Hamiltonian in terms of spinons\nreads\nXY\nH̃ex-1\n(ij) = J[(Fi† S̃i,xy Fi ) * (Fj† S̃j,xy Fj )\n1\n− (Fi† ñi,xy Fi ) * (Fj† ñj,xy Fj )]\n4\n2J X h †\n†\n=\n−fi,α fj,α fj,β\nfi,β\n9\nα,β=2,3\n\n†\n†\n+fi,α\nfj,β fj,β\nfi,α\n\n†\n− fi,α\nfi,β δαβ\n\ni\n\n, (108)\n\nin which, σαβ * σα0 β 0 = 2δαβ 0 δα0 β − δαβ δα0 β 0 has been used.\nSimilar spinon Hamiltonians can also be written down for XZ\nand YZ planes. When we write down the full antiferromagnetic exchange Hamiltonian and sum over XY, YZ and XZ\nplanes, we find that the single-site terms, which are quadratic\n\n\f19\nin spinon operators, sum up to a constant once we impose the\nsingle occupancy constraint. We are then left with the terms\nthat are quartic in spinon operators.\nWe now follow the standard procedure of slave particle\nmean field theory to decouple the quartic terms in the spinon\nHamiltonian and write down a mean field ansatz. We start\nXY\nwith the exchange Hamiltonian in the XY plane, H̃ex-1\n.\nWe require a mean field ansatz for the fermionic bond ex†\nfjβ i. Noting the structure of the two\npectation values, hfiα\nsite pseudo-singlet in this plane, we choose an ansatz which\nreproduces a quantum ground state of this type. Specifically,\n†\nχij;αβ ≡ hfiα\nfjβ i = χij (Ixy )βα ,\n\nhiji ∈ XY\n\n(109)\n\nwith\n\nIxy = \n\n\n\n0\nI2\n\n .\n\nNote that, by construction, this expectation value is invariant\nunder the hidden SU(2) symmetry. The χij on the XZ and YZ\nplanes are determined by symmetry\n\n†\nχij;αβ ≡ hfiα\nfjβ i = χij (Iyz )βα , hiji ∈ YZ ,\n\n(111)\n\nIxz = U Ixy U\n\n(112)\n\n†\n\n(113)\n\nIyz = U Ixy U\n\nwith the unitary transformation introduced in Eq. (102).\nWe then arrive at the mean field Hamiltonian\ni\nX h\nXY\nHMF\n= −J ̃\n(χij Fj† Ixy Fi + h.c.) − 2|χij |2\nhiji∈XY\n\n+\n\nX\n\nΛi (Fi† Fi − 1)\n\nWe find\nHM F =\n\nX X\n\n†\n†\n\u000fλ (k)[f ̃λ+\n(k)f ̃λ+ (k) + f ̃λ−\n(k)f ̃λ− (k)]\n\nλ=1,2 k\n\n ̃ 2,\n+12N Jχ\n\n(117)\n\nwhere λ = 1, 2 label doubly degenerate bands with dispersion\nh\n ̃ \u000f ̃1,2 (k) = −2Jχ\n ̃ Cx Cy + Cy Cz + Cz Cx\n\u000f1,2 (k) ≡ Jχ\nq\ni\n± Cx2 Cy2 + Cy2 Cz2 + Cz2 Cx2 − Cx Cy Cz (Cx +Cy +Cz ) .\n(118)\nHere Cx = cos(kx /2), Cy = cos(ky /2) and Cz =\ncos(kz /2). The double degeneracy of the two bands is due\nto Kramer's degeneracy, since ji is a spin-3/2 operator and\nthe Hamiltonian has time reversal symmetry.\nThe ground state wave function at the mean field level is\ndescribed by a Fermi sea of spinons\nY Y †\n†\n|ΨM F i =\nf ̃λ+ (k)f ̃λ−\n(k)|vacuumi,\n(119)\nλ=1,2 k\n\nand\n†\n\nj\n\n(110)\n\n0\n\n†\nχij;αβ ≡ hfiα\nfjβ i = χij (Ixz )βα , hiji ∈ XZ ,\n\nfor i, j nearest neighbors on the fcc lattice. This naturally respects point group and time reversal symmetries. The Hamiltonian in Eq. (114) is then diagonalized by Fourier transform\nX\nfα (k) =\ne−ik*Rj fjα .\n(116)\n\n(114)\n\nfor all k below the Fermi surface. The mean field ground state\nenergy per site is\nX Z d3 k\nEM F\nθ[μ − \u000f ̃λ (k)] ̃\n\u000fλ (k) + 12χ2 ,\n= 2χ\n(2π)3\nN J ̃\nλ=1,2\n(120)\nwhere the integral is over the first Brillouin zone of the fcc\nlattice and the dimensionless chemical potential μ is fixed by\nthe quarter filling condition\nX Z d3 k\n2\nθ[μ − \u000f ̃λ (k)] = 1.\n(121)\n(2π)3\nλ=1,2\n\ni\n\nwith J ̃ ≡ 2J/9. Here Λi are the Lagrange multipliers related\nXZ\nYZ\nto the single-occupancy constraint in Eq. (104). HMF\nand HMF\ncan be readily written down using Eq. 111 and Eq. (112).\n\n1.\n\nuniform spin liquid\n\nAs discussed in Sec. II, the antiferromagnetic exchange Hamiltonian has a \"hidden\" global SU(2) symmetry,\n[Gμ , H̃ex-1 ] = 0. It is easy to find that the full mean field\nHamiltonian we have here respects this \"hidden\" global SU(2)\nsymmetry. We seek a quantum spin liquid ground state which\ndoes not break any symmetries of the original Hamiltonian.\nTranslational invariance imposes Λi = Λ = const. First we\nconsider the ansatz for a uniform spin liquid\nχij = χji = χ,\n\n(115)\n\nThe wave function in Eq. (119) must be Gutzwiller-projected\ninto the physical Hilbert space with one spinon per site\n|Ψi = Pni =1 |ΨM F i.\n\n(122)\n\nHere we simply evaluate the ground state energy at the\nmean field level. Minimizing Eq. (120) with respect to the\nparameter χ, we find\nZ\n1 X\nd3 k\n∗\nχ =−\nθ[μ − \u000f ̃λ (k)] ̃\n\u000fλ (k),\n(123)\n12\n(2π)3\nλ=1,2\n\nand\nEM F\n8\n= − J(χ∗ )2 .\n(124)\nN\n3\nThe spinon density is at quarter filling for μ ≈ −1.58J. The\nmean field energy for the uniform spin liquid state is then\n(0)\nEM F /N ≈ −0.041J.\n\n\f20\n2. π-flux spin liquid\n\nWe now consider the ansatz for the π flux spin liquid state\nillustrated in Fig. 18. In order to preserve time reversal symmetry, the phase of the χij at each bond can only assume the\nvalues 0 or π. We divide the fcc lattice into four cubic lattices\nrA\nj = (0, 0, 0) + Rj ,\nrB\nj\nrC\nj\nD\nrj\n\nC\n\nD\n\n= (1/2, 1/2, 0) + Rj ,\n= (0, 1/2, 1/2) + Rj ,\n= (1/2, 0, 1/2) + Rj ,\n\nwhere Rj is a unit vector in the cubic lattice with lattice parameter a = 1. We denote by FjA the vector of spinon annihilation operators at site j of sublattice A, and similarly for\nthe other sublattices. We assign χij = +χ to the bonds connecting sites in sublattice A to all its nearest neighbors in sublattices B, C, D, and χij = −χ to the bonds connecting two\nsites that belong to sublattices B, C or D. In other words,\nthis ansatz corresponds to assigning −χ to the three bonds in\nthe BCD base of each tetrahedron in the fcc lattice and +χ\nto the three bonds connecting the BCD base to the A vertex.\nAs a result, there is π flux through every triangle and zero\nflux through every square in the fcc lattice. While this ansatz\nis clearly invariant under point group transformations about\nA sites, it is also invariant under lattice translations, despite\nthe fact that this permutes the 4 sublattices. This is because\nthe corresponding changes in χij can be removed by a gauge\ntransformation. For instance, the gauge transformation\nFjA → −FjA , FjB → −FjB ,\nFjC → FjC , FjD → FjD ,\n\n(125)\n\nexchanges the signs of χij between sublattices A and B. It\nfollows that the π flux ansatz is invariant under point group\nsymmetries about any site of the fcc lattice and therefore respects all symmetries of the original Hamiltonian.\nMinimizing the energy for the mean field Hamiltonian with\nfour sublattices, we find 8 doubly degenerate bands for the π\nflux state. Quarter filling is reached for dimensionless chemical potential μ ≈ −1.68J. The mean field energy is\n8 Z\nX\nd3 k\nEM F\n= 2χ\nθ[μ − \u000f ̃λ (k)] ̃\n\u000fλ (k) + 12χ2 , (126)\n(2π)3\nN J ̃\nλ=1\n\nwhere the integral is over the reduced Brillouin zone of the cu(π)\nbic lattice. We find EM F /N = −0.053J. This is lower than\nthe energy for the uniform state. We may also compare this to\nthe mean field energy of a VBS state (it is not so meaningful\nto compare these slave particle mean field energies directly\nto the variational energies quoted earlier for the Weiss mean\nfield and VBS states). For a mean-field VBS state, we take χij\nnon-zero only on a set of non-overlapping dimers. In this case,\nF\nwe obtain EVMBS\n/N = −1/18J ≈ −0.055J. This is slightly\nlower than the QSL states, but we expect that the energy of the\nspin liquid states will be lowered by the Gutzwiller projection,\nsince the latter is known to enhance spin-spin correlations.35\n\nB\nA\nFIG. 18. (Color online) Conventional unit cell of the fcc lattice divided into four sublattices. The ansatz for the π flux state corresponds to assigning hopping amplitude +χ to the bonds represented\nby solid lines and −χ to the bonds represented by the dashed lines.\n\nWe note that both spin liquid states have Fermi surfaces\nwhich are not nested, and have no obvious instabilities. The\nstates are also stable against bond anisotropy which enhances\nthe hopping in a given plane. Perturbations to NN AFM\nexchange, such as next-nearest-neighbor interactions, will in\ngeneral require more general ansätze for the bond matrix χij .\nNonetheless, as long as the perturbations are in some sense\nsmall, the χij assumed in Eq. (109), in which hopping in a\ngiven plane occurs predominantly for two out of four spinon\nspecies, should be a good starting point for approximations.\n\nVI.\n\nDISCUSSION\n\nIn this paper, we have introduced and analyzed a model\nto describe localized electrons in a 4d1 or 5d1 configuration\non an fcc lattice, in which strong spin-orbit coupling and\nthe t2g orbital degeneracy combine to produce an effective\nj = 3/2 description. The model contains three interactions\n– nearest neighbor antiferromagnetic and ferromagnetic exchange, and electric quadrupolar interactions – and in addition may include the effect of structural anisotropy. We obtain\nthe (Weiss) mean-field phase diagram, which includes 3 main\nphases, which all have a two-sublattice Q = 2π(001) structure. In all the phases, large multipolar order parameters in\naddition to the usual magnetic dipolar order are present. Most\nremarkably, we find a broad regime of time-reversal invariant\nbut quadrupolar ordered phase at intermediate temperatures.\nA spin-wave analysis indicates that quantum fluctuations are\nstrong when nearest-neighbor antiferromagnetic exchange is\ndominant, and in this case, we suggest possible quantum spin\nliquid and valence bond solid phases.\n\n\f21\nA.\n\nExperimental ramifications\n\nThe theory developed here can be applied and tested in a\nmultitude of ways. Here we discuss a few of the main experimental properties which might be measured. First, there is\nthe spatial symmetry breaking of the ordered phases. All the\nordered states, at least in the cubic case, break lattice symmetries, and in particular double the unit cell. This can be tested\nin experiments such as neutron and x-ray scattering.\nWe discuss in some further detail the most intriguing case of\nthe quadrupolar phase, which is non-magnetic. It constitutes a\ntype of real (time-reversal invariant) orbital ordering. It leads\nto a spontaneous splitting of the local quadruplet, breaking it\ndown to an elemental Kramer's doublet. As such, this is not\nentirely distinct from a Jahn-Teller effect, in which ionic motions would lead to such splitting. In particular, even though\nin our model atomic displacements are not involved in an essential way, they would be expected at least to respond to the\norbital order. In principle, this could be measured by scattering (x-rays or neutrons) which accurately measure the crystal\nstructure and symmetry. From the order parameter description\nof the quadrupolar phase, we can obtain the corresponding\nspace group and crystal structure parameters to be sought in\nsuch a measurement. In particular, we find that the quadrupolar ordered phase corresponds to the tetragonal space group\nP42 /mnm (number 136). In this space group, apart from the\ndoubling of the unit cell, one finds that all the A sites, B sites,\nand B' sites remain equivalent. However, the oxygens are no\nlonger equivalent, but split into three classes, occupying the\n4e, 4f, and 4g Wyckoff positions. Each of these positions\nhas one degree of freedom which is not fixed by symmetry.\nPhysically, the oxygens remain constrained to the simple cubic axes of the perovskite reference unit cell, but may move\nby different amounts along each of the three axes. This is two\nmore degrees of freedom than is found in the cubic Fm3m\n(number 225) space group, in which the oxygens maintain an\nideal octahedron equidistant from each B (or B') site. While\nsymmetry requires these structural changes, we do not have at\npresent an estimate for their magnitude, which could be weak\nif coupling to the lattice is not strong.\nAnother quantity we have already discussed in Sec. IV E\nis the magnetic susceptibility, which shows signatures of the\nquadrupolar and ordering transitions. One complication is that\nthe susceptibility is in many cases highly anisotropic, and one\nmay not be sure what component(s) are being measured in\npractice. Specifically, one may expect, if the system is ideal\nand fully in equilibrium, that the broken symmetry order parameters can be reoriented by the magnetic field, in such a\nway that they minimize the free energy. This will typically favor orientations which maximize the magnetic susceptibility.\nFor instance, in the quadrupolar phase for cubic symmetry,\nthis is an orientation with Q perpendicular to the field. However, such reorientation involves motion of domain walls and\nvery large numbers of spins, and can easily be prevented by\npinning or at least be incomplete in practice. Thus some diversity of behavior may be expected in experiment, as well as\npossibly hysteretic behavior even in the non-magnetic state.\nWhen the crystal is non-cubic, one may explore the influ-\n\nence of single-ion anisotropy on the magnetic susceptibility.\nA naı̈ve application of Eq. (84) would immediately imply that\nsingle-ion terms do not contribute to the Curie-Weiss temperature as measured in the powder susceptibility. However,\nwe caution that these equations hold only in the true hightemperature regime, in which T \u001d |D|. If T is smaller than or\ncomparable to |D|, higher order terms in the high temperature\nexpansion are non-trivial, and a non-vanishing fitted CurieWeiss temperature may result from D alone. Let us consider\nthe powder susceptibility χ for independent ions (i.e. neglecting exchange). One has\nχ=\n\nχzz\n2χxx\n3\ntanh D/T\n+\n=\n+\n,\n3\n3\n4T\n2D\n\n(127)\n\nin units of g 2 μ2B . We then suppose a linear fit to 1/χ versus T is made over a narrow region in the neighborhood of\nthe temperature Tfit , and extrapolated to find the Curie-Weiss\ntemperature as the intercept of the horizontal axis. The result\nis\n\u0010\n\u0011\n2Tfit Tfit sinh( T2D\n)\n−\n2D\nfit\n\u0010\n\u0011 .\nΘCW (Tfit ) = −\n(128)\n2D\nD 3 cosh( Tfit ) + 7\nNote that the fitted Curie-Weiss temperature is always negative, and is independent of the sign of D. It reaches a maximum in magnitude (at fixed D) of ΘCW ≈ −0.18|D| when\nTfit ≈ 0.88|D|, and only approaches zero very slowly when\n4D 2\nTfit \u001d |D|: ΘCW ∼ − 15T\n. Conversely, at a fixed fitting\nfit\ntemperature, the maximum achievable Curie-Weiss temperature is ΘCW ≈ −0.26Tfit , when |D| = 1.84Tfit .\n\nB.\n\nMaterials survey\n\nWe now turn to a discussion of specific materials which\nhave been studied experimentally.\n\n1.\n\nBa2 YMoO6\n\nWe begin with the material Ba2 YMoO6 , which has been\nsuggested experimentally to be an exotic \"valence bond glass\"\nor to have a \"collective spin singlet\" ground state. The expected separation between the j = 3/2 and j = 1/2 states\nin this material is over 2000K, so that the effective j = 3/2\ndescription used here should be excellent. Two recent experimental papers36,37 observed an unusual behavior of the magnetic susceptibility, with two Curie regimes, such that 1/χ is\nlinear both above 100K and below 50K. Moreover, the magnetic specific heat shows a peak around 50K, with Ref. 36\nestimating the total magnetic entropy approximately equal to\nRln4, as expected for j = 3/2. Both these results suggest\nthe existence of some single-ion anisotropy, which would explain the existence of two Curie regimes because it splits the\n4-fold degeneracy of the j = 3/2 states but leaves a 2-fold\nKramer's doublet at temperatures below |D|, which still gives\n\n\f22\na Curie signal. However, the cubic symmetry observed experimentally seems to rule out such an explanation. Moreover, the\nform of the powder susceptibility in Refs. 36 and 37 is qualitatively different from that expected for either fixed easy-plane\nor easy-axis anisotropy.\nThese difficulties are resolved if one considers the possibility of spontaneous anisotropy, which indeed is the primary\ncharacteristic of the quadrupolar ordered state. For example, the mean-field susceptibility for the cubic model with\nJ 0 = 0.2J, V = 0.3J is plotted in Fig. 13. At temperatures above the FM110 phase, one indeed observes two Curie\nregimes in the susceptibility, with a larger Curie constant at\n\nCompound\nBa2 YMoO6\nBa2 YMoO6\nBa2 YMoO6\nLa2 LiMoO6\nSr2 MgReO6\nSr2 CaReO6\nBa2 CaReO6\nBa2 LiOsO6\nBa2 NaOsO6\nBa2 NaOsO6\n\nB 0 config.\n\ncrystal structure\n\nMo5+ (4d1 )\ncubic\nMo5+ (4d1 )\ncubic\nMo5+ (4d1 )\ncubic\nMo5+ (4d1 )\nmonoclinic\nRe6+ (5d1 )\ntetragonal\nRe6+ (5d1 )\nmonoclinic\nRe6+ (5d1 ) cubic to tetragonal (at T ∼ 120K)\nOs7+ (5d1 )\ncubic\nOs7+ (5d1 )\ncubic\nOs7+ (5d1 )\ncubic\n\nlow temperature, as seen in the experiments. The kink in χ coincides with the quadrupolar ordering transition, and there is a\npeak in the specific heat at this temperature, also as observed\nin experiment. The theoretical specific heat has a second peak\nat lower temperatures, associated with magnetic ordering and\nexhaustion of the unsplit Kramer's doublet. We suggest that\nthis peak is below the lowest temperatures measured, or perhaps is avoided due to disorder, and the spins falling out of\nequilibrium at low temperature. The fact that the Curie-Weiss\ntemperature extracted below 50K is only -2.3K corroborates\nthe notion that any magnetic ordering may be too low to observe or be obscured by the effects of disorder.\n\nΘCW\n\nμeff (μB )\n\nmagnetic transition\n\n−91K\n−160K\n−219K\n-45K\n−426K\n−443K\n−38.8K\n−40.48K\n−32.45K\n∼ −10K\n\n1.34\n1.40\n1.72\n1.42\n1.72\n1.659\n0.744\n0.733\n0.677\n∼ 0.6\n\nPM down to 2K\nPM down to 2K\nPM down to 2K\nPM to 2K\nspin glass, TG ∼ 50K\nspin glass, TG ∼ 14K\nAFM TN = 15.4K\nAFM TN ∼ 8K\nFM TN ∼ 8K\nFM TN = 6.8K\n\nfrustration parameter f Ref\nf & 45\nf & 80\nf & 100\nf & 20\nf &8\nf & 30\nf ∼2\nf &5\nf &4\nf &4\n\n[38]\n[36]\n[37]\n[37]\n[39]\n[40]\n[41]\n[42]\n[42]\n[14]\n\nTABLE II. A list of ordered double perovskites. Note the discrepancy in Curie-Weiss temperature and μeff may originate from the experimental\nfitting of data at different temperature range.\n\n2.\n\nLa2 LiMoO6\n\nLa2 LiMoO6 is monoclinic, the deviation from cubic symmetry arising primarily from rotations of the octahedra. The\nlocal coordination of the Mo sites is nearly perfectly octahedral with a weak tetragonal compression. The nature of crystal\nfield effects, if significant, is unclear at present. Magnetically,\nthe susceptibility shows, like Ba2 YMoO6 , two apparent Curie\nregimes, separated by a kink at approximately 150K. However, opposite to that material, La2 LiMoO6 shows a smaller\neffective moment at low temperature compared to high temperature. In addition, the high temperature Curie-Weiss temperature is ΘCW ≈ −45K, significantly smaller than the kink\ntemperature. Irreversibility distinguishing the behavior of the\nZFC/FC susceptibility appears below 25K.\nThe appearance of two Curie regimes again suggests either\nfixed or spontaneous magnetic anisotropy setting in around\n150K. However, the reduction of the effective moment below\nthe kink in χ−1 is puzzling. We did not find this behavior in\nthe powder susceptibility within our model, with or without\nanisotropy modeled by D. As remarked above, however, the\nactual nature of the crystal field anisotropy in La2 LiMoO6 is\nunclear. If it is significant and different in form from the D\nterm, this might explain the behavior. Single crystal studies\nwould be helpful in elucidating the situation.\n\n3.\n\nSr2 CaReO6 and Sr2 MgReO6\n\nSr2 CaReO6 and Sr2 MgReO6 have distorted perovskite\nstructures, with monoclinic and tetragonal symmetry,\nrespectively.39,40 Experimentally, the materials are notable\nfor their very high antiferromagnetic Curie-Weiss temperature, −ΘCW & 400K. Susceptibility and specific heat measurements show anomalies suggestive of freezing and/or\nshort-range ordering at 14K and 50K, for Sr2 CaReO6 and\nSr2 MgReO6 , respectively. Two possible interpretations of this\nbehavior are: (1) the Curie-Weiss temperature is dominated by\nstrong exchange, but fluctuations largely suppress ordering, or\n(2) the Curie-Weiss temperature is due largely to single-ion\neffects, and the true exchange scale is comparable to the observed anomalies in χ and cv .\nIn the former scenario, the key question is why these two\nmaterials show so much larger exchange than do the other\ncompounds in this family. From the point of view of this\nwork, attributing the Curie-Weiss temperature to exchange\nalone would imply J is actually comparable to the SOC, so\nthat the projection to j = 3/2 may even be suspect. The\nCurie-Weiss temperatures are sufficiently large that one may\nsuspect that the 5d electrons are not so well localized, and the\nsystem is close to a Mott transition. It would be interesting to\nmeasure their optical properties to address this possibility.\nThe latter explanation seems possible, as both materi-\n\n\f23\nals show significant deviations from the cubic structure:\nSr2 CaReO6 is monoclinic, while Sr2 MgReO6 is tetragonal.\nThe actual distortions of the octahedra are rather small in both\ncases, the Re-O distance varying by only about 0.02Å at room\ntemperature. However, there are significant rotations and tilts\nof the octahedra, and crystal field splittings of the j = 3/2\nquadruplet are certainly allowed. Examination of the Re-O\nbond lengths suggests easy-axis anisotropy. From Eq. (128),\nwe see that in principle a negative Curie-Weiss temperature\ncould be attributed to D. However, from the present model we\ncannot obtain such a large value, which in these two materials\nis comparable or larger than the fitting temperature. Nevertheless, we may imagine that some combination of exchange and\nsingle-ion anisotropy may conspire to produce the observed\nbehavior.\nIf we assume a large easy-axis anisotropy, we would then\nexpect, based on the the analysis in Sec. III A 1, to have an\nAFM ground state. The anomalies might be related to this\nordering. Experimentally, spin freezing and irreversibility is\nobserved, but without clear signs of long-range ordering. The\nexperimentalists caution that, due to the small magnetic moment of the Re6+ ions, a small ordered component could not\nbe ruled out in either material.39,40 Indeed, in the AFM state, a\nvery small moment is expected, due to the primacy of octupolar order.\nWhile this is promising, we note that it is likely that several effects not in our model play a role. First, the structure of the materials is not a simple compression of the cubic structure, and so the crystal fields might have a significantly different form from the simple D term. This is especially true in Sr2 CaReO6 , which has the more distorted monoclinic structure. Second, in Sr2 MgReO6 , the Re-O-Mg bond\nangles are very different in the XY plane (160◦ ) and normal\nto it (180◦ ),39 so substantial spatial anisotropy in the exchange\ncouplings may be present. This is not included in our model.\nAlso in Sr2 MgReO6 , the ZFC and FC susceptibility actually\ndiverge already around 300K, which suggests a high degree\nof disorder in this material, which might be responsible for\nconverting the AFM to a glassy state.\nOne indication supporting an antiferromagnetic ground\nstate is the observation, in Sr2 CaReO6 , of a T 3 magnetic\ncontribution to the specific heat, in contrast to the usual linear one characteristic of a spin glass. The T 3 behavior\nwould naturally be expected from spin waves in the AFM\nstate, which as we have noted displays gapless spin waves, at\nleast in the semi-classical approximation. Such T 3 behavior\nmight even persist if the AFM order had a finite correlation\nlength, due to Halperin-Saslow modes43 , as recently postulated in NiGa2 S4 44 . A T -linear specific heat was observed\nin Sr2 MgReO6 , albeit with a small coefficient.39 As we have\nalready remarked, however, this material is likely to be more\ndisordered, consistent with the more conventional spin glasslike specific heat.\nWhile these considerations seem reasonable, they are\nhardly definitive. Further studies, particularly on single crystals, would be most helpful in clarifying the physics of these\nmaterials.\n\n4.\n\nBa2 CaReO6\n\nIn Ba2 CaReO6 , there is a structural transition from a high\ntemperature cubic phase to a low temperature tetragonal one,\nwith a doubled unit cell, at T = 120K41 . The experimentalists have fitted the low temperature structure to the I4/m\nspace group. From this fit, they found an elongation along\nthe c (or z) axis, but a slight compression of the ReO6 octahedra. One may consider two possibilities. Either this is\nindeed the correct symmetry, in which case it must have structural origin not related to the 5d electrons, or this transition in\nfact coincides with the quadrupolar ordering described here,\nwhich also gives a tetragonal state with the same unit cell.\nThe P42 /mnm space group was not considered in Ref.41.\nA small, negative Curie-Weiss temperature ΘCW = −39K\nwas measured by fitting the susceptibility in the high temperature cubic phase , indicating that J 0 should be not too large. A\npredominantly antiferromagnetic ordering transition was observed at T =15K, which is consistent with our expectations\nin the small J 0 and V regime (recall that an antiferromagnetic\nstate is expected both with and without single ion anisotropy\nin this parameter range). It would be interesting to compare\nthe predicted magnetic structure in the AFM or AFM' phase\nwith experiment, by carrying out neutron scattering and NMR\nmeasurements.\n\n5.\n\nBa2 NaOsO6\n\nBa2 NaOsO6 ,14 is one of only two examples in this class in\nwhich single crystal experiments have been performed, to our\nknowledge. A transition at T =6.8K was found to a ferromagnetic state with easy axis along a [110] direction. Within the\nexperimental resolution, the material was found to remain cubic down to the lowest measured temperature. A fit to CurieWeiss behavior found a negative Curie-Weiss temperature,\n−13K< ΘCW < −10K, depending upon field orientation. We\nnote that this is compatible with Eq. (84), and suggests that the\nmaterial is in the regime of larger V and smaller J 0 . In this\nregion, we expect a high temperature quadrupolar transition,\nwell above the ferromagnetic state. While no such transition\nis observed in the experiment, the magnetic specific heat of\nsuch a transition may be masked by the lattice contribution at\nhigher temperature, and the signature in susceptibility may be\nsubtle.\nSeveral other indications are in favor of this scenario. First,\nthe susceptibility continues to display pronounced anisotropy,\nfavoring the [110] direction, up to at least 200K, well above\nthe ferromagnetic transition. This would indeed be expected\nin the quadrupolar ordered state. Second, the magnetic specific heat divided by temperature, integrated over the peak\nup to about 15K gives a magnetic entropy of approximately\nR ln 2, which is only half the expected entropy for the j = 3/2\nquadruplet. This entropy may be released over a significantly higher temperature range, up to the quadrupolar ordering transition. Third, the observation itself of ferromagnetism with a [110] easy axis is a marked success of our theory. This type of anisotropy is not natural from the standpoint\n\n\f24\nof Landau theory, within which cubic anisotropy manifests itself at leading order as a term in the free energy of the form\nv[(M x )4 +(M y )4 +(M z )4 ] (M is the magnetization), which,\ndepending upon the sign of v, generates a [111] or [100] easy\naxis. A continuous Landau transition to the FM110 state is\ninstead made possible by the fact that the quadrupolar order\nalready breaks the cubic symmetry in the paramagnetic state.\nIt would be interesting to further probe the system to establish in more detail the correspondence (or lack thereof) with\nour theoretical predictions. The predicted tetragonal distortion of the cubic structure would be a natural quantity to seek\nin experiment. This also manifests locally in the magnetism,\nsince although the net magnetization is aligned with the [110]\naxis, the local spin expectation values are not. This might be\nmeasurable for instance by a local probe such as NMR.\n\n6.\n\nBa2 LiOsO6\n\nBa2 LiOsO6 has also been grown in single crystal form.\nThe structure was determined to be cubic by x-ray diffraction at room temperature.42 Aside from this diffraction data,\nonly bulk magnetic susceptibility results are available. One\nobserves a negative Curie-Weiss temperature ΘCW ≈ −40K,\nand an apparent antiferromagnetic transition at TN ≈ 8K.\nThis appears largely consistent with the expected behavior in\nregion I of Fig. 6.\n\n1\n2\n\n3\n4\n\n5\n\n6\n\n7\n\n8\n\n9\n\n10\n\n11\n\n12\n\nT. Moriya, Phys. Rev. 120, 91 (Oct 1960).\nI. Dzyaloshinsky, Journal of Physics and Chemistry of Solids 4,\n241 (1958).\nG. Chen and L. Balents, Phys. Rev. B 78, 094403 (Sep 2008).\nG. Jackeli and G. Khaliullin, Phys. Rev. Lett. 102, 017205 (Jan\n2009).\nN. Büttgen, J. Hemberger, V. Fritsch, A. Krimmel, M. Mücksch,\nH.-A. K. von Nidda, P. Lunkenheimer, R. Fichtl, V. Tsurkan, and\nA. Loidl, New J. of Phys. 6, 191 (2004).\nV. Fritsch, J. Hemberger, N. Büttgen, E.-W. Scheidt, H.-A.\nKrug von Nidda, A. Loidl, and V. Tsurkan, Phys. Rev. Lett. 92,\n116401 (2004).\nA. Krimmel, M. Mücksch, V. Tsurkan, M. M. Koza, H. Mutka,\nand A. Loidl, Phys. Rev. Lett. 94, 237402 (2005).\nG. Chen, L. Balents, and A. P. Schnyder, Phys. Rev. Lett. 102,\n096406 (Mar 2009).\nG. Chen, A. P. Schnyder, and L. Balents, Phys. Rev. B 80, 224409\n(Dec 2009).\nS. Sarkar, T. Maitra, R. Valentı́, and T. Saha-Dasgupta, Phys. Rev.\nB 82, 041105 (Jul 2010).\nP. Santini, S. Carretta, G. Amoretti, R. Caciuffo, N. Magnani, and\nG. H. Lander, Rev. Mod. Phys. 81, 807 (Jun 2009).\nK. Haule and G. Kotliar, Nature Physics 5, 796 (2009).\n\nC.\n\nComparison and future work\n\nWe are aware of only one other theoretical work studying\nthis class of materials. Lee and Pickett30 performed electronic\nstructure calculations for Ba2 NaOsO6 and Ba2 LiOsO6 , emphasizing the role of SOC. We completely agree with the conclusion that SOC plays a crucial role in the magnetism. However, the magnetic structure and phase transitions were not\naddressed.\nOur study is much more comprehensive, and gives a great\ndeal of guidance both for future theory and experiment. Many\nexperimental suggestions have already been made. In particular verification of the quadrupolar ordering transition would\nbe especially exciting. On the theoretical side, the problem of\nthe effects of quantum fluctuations in the small J 0 and V limit\nremains rather open. It would be remarkable if a spin liquid\nor valence bond solid state could be established for this highly\nnon-SU(2) symmetric and nominally \"large\" spin j = 3/2\nmodel. To do so would require some hard theoretical work\napplying more quantitative numerical methods to our model\nHamiltonian. A natural extension of this work would be to\nconsider the \"higher spin\" analogs of these materials, with\n4d2 or 5d2 electronic states. As there is still partial occupation\nof the t2g orbitals in this case, we expect SOC again to play\na dominant role, and interesting multipolar physics is likely\npresent.\nACKNOWLEDGMENTS\n\nWe thank John Greedan, Ian Fisher and Ram Seshadri for\nuseful discussions. This work was supported by the DOE\nthrough Basic Energy Sciences grant DE-FG02-08ER46524.\nLB's research facilities at the KITP were supported by the National Science Foundation grant NSF PHY-0551164.\n\n13\n\n14\n\n15\n\n16\n\n17\n\n18\n\n19\n\n20\n21\n\n22\n23\n24\n\nG. Jackeli and G. Khaliullin, Phys. Rev. Lett. 103, 067205 (Aug\n2009).\nA. S. Erickson, S. Misra, G. J. Miller, R. R. Gupta, Z. Schlesinger,\nW. A. Harrison, . J. M. Kim, and I. R. Fisher, Phys. Rev. Lett. 99,\n016404 (2007).\nE. M. Stoudenmire, S. Trebst, and L. Balents, Phys. Rev. B 79,\n214436 (2009).\nA. Läuchli, F. Mila, and K. Penc, Physical review letters 97, 87205\n(2006).\nH. Tsunetsugu and M. Arikawa, Journal of the Physical Society\nof Japan 75, 083701 (2006).\nS. Bhattacharjee, V. B. Shenoy, and T. Senthil, Phys. Rev. B 74,\n092406 (2006).\nS. Nakatsuji, Y. Nambu, H. Tonomura, O. Sakai, S. Jonas, C. Broholm, H. Tsunetsugu, Y. Qiu, and Y. Maeno, Science 309, 1697\n(2005).\nL. Balents, Nature 464, 199 (2010).\nP. Anderson, Materials Research Bulletin 8, 153 (1973), ISSN\n0025-5408.\nX.-G. Wen, Phys. Rev. B 65, 165113 (Apr 2002).\nO. I. Motrunich, Phys. Rev. B 73, 155115 (Apr 2006).\nS. Ryu, O. I. Motrunich, J. Alicea, and M. P. A. Fisher, Phys. Rev.\nB 75, 184406 (May 2007).\n\n\f25\n25\n\n26\n\n27\n\n28\n29\n\n30\n31\n\n32\n\n33\n\n34\n\n35\n\n36\n\nY. Okamoto, M. Nohara, H. Aruga-Katori, and H. Takagi, Phys.\nRev. Lett. 99, 137207 (Sep 2007).\nM. J. Lawler, A. Paramekanti, Y. B. Kim, and L. Balents, Phys.\nRev. Lett. 101, 197202 (Nov 2008).\nM. Hermele, M. P. A. Fisher, and L. Balents, Phys. Rev. B 69,\n064404 (Feb 2004).\nC. L. Henley, J. Appl. Phys. 61, 3962 (1987).\nS. Murakami, N. Nagosa, and S.-C. Zhang, Phys. Rev. B 69,\n235206 (Jun 2004).\nK.-W. Lee and W. Pickett, Europhys. Lett. 80, 37008 (2007).\nR. Shiina, O. Sakai, H. Shiba, and P. Thalmeier, Journal of the\nPhysical Society of Japan 67, 941 (1998).\nY. Q. Li, M. Ma, D. N. Shi, and F. C. Zhang, Phys. Rev. Lett. 81,\n3527 (Oct 1998).\nA. Joshi, M. Ma, F. Mila, D. N. Shi, and F. C. Zhang, Phys. Rev.\nB 60, 6584 (Sep 1999).\nA. Del Maestro and M. J. P. Gingras, Phys. Rev. B 76, 064418\n(Aug 2007).\nF. C. Zhang, C. Gros, T. M. Rice, and H. Shiba, Superconductor\nScience and Technology 1, 36 (1988).\nM. A. de Vries, A. C. Mclaughlin, and J.-W. G. Bos, Phys. Rev.\nLett. 104, 177202 (Apr 2010).\n\n37\n\n38\n\n39\n\n40\n\n41\n\n42\n\n43\n\n44\n\nT. Aharen, J. E. Greedan, C. A. Bridges, A. A. Aczel, J. Rodriguez, G. MacDougall, G. M. Luke, T. Imai, V. K. Michaelis,\nS. Kroeker, H. Zhou, C. R. Wiebe, and L. M. D. Cranswick, Phys.\nRev. B 81, 224409 (Jun 2010).\nE. J. Cussen, D. R. Lynham, and J. Rogers, Chem. Mater. 18, 2855\n(2006).\nC. R. Wiebe, J. E. Greedan, P. P. Kyriakou, G. M. Luke, J. S. Gardner, A. Fukaya, I. M. Gat-Malureanu, P. L. Russo, A. T. Savici,\nand Y. J. Uemura, Phys. Rev. B 68, 134410 (2003).\nC. Wiebe, J. Greedan, and G. Luke, Phys. Rev. B 65, 144413\n(2002).\nK. Yamamura, M. Wakeshima, and Y. Hinatsu, Journal Solid State\nChemistry 179, 605 (2006).\nK. E. Stitzer, M. D. Smith, and H.-C. zur Loye, Solid State Sciences 4, 2002 (311).\nB. I. Halperin and W. M. Saslow, Phys. Rev. B 16, 2154 (Sep\n1977).\nD. Podolsky and Y. B. Kim, Phys. Rev. B 79, 140402 (2009).\n\n\f"}