{"id": "http://arxiv.org/abs/1102.1343v3", "guidislink": true, "updated": "2011-03-10T17:16:13Z", "updated_parsed": [2011, 3, 10, 17, 16, 13, 3, 69, 0], "published": "2011-02-07T15:57:09Z", "published_parsed": [2011, 2, 7, 15, 57, 9, 0, 38, 0], "title": "Coupled atmosphere-wildland fire modeling with WRF-Fire", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1102.0282%2C1102.3513%2C1102.4311%2C1102.1971%2C1102.3057%2C1102.1873%2C1102.0066%2C1102.2123%2C1102.3025%2C1102.3976%2C1102.4578%2C1102.0428%2C1102.0211%2C1102.0561%2C1102.5472%2C1102.1385%2C1102.4594%2C1102.3518%2C1102.3998%2C1102.0038%2C1102.2248%2C1102.5305%2C1102.1260%2C1102.5181%2C1102.4158%2C1102.5612%2C1102.1346%2C1102.0020%2C1102.5579%2C1102.1593%2C1102.2948%2C1102.0050%2C1102.3381%2C1102.0588%2C1102.5356%2C1102.1684%2C1102.1892%2C1102.0686%2C1102.5320%2C1102.0385%2C1102.0503%2C1102.0349%2C1102.4018%2C1102.3579%2C1102.5087%2C1102.1175%2C1102.3750%2C1102.0301%2C1102.3713%2C1102.5641%2C1102.4141%2C1102.2180%2C1102.3662%2C1102.2843%2C1102.4904%2C1102.2184%2C1102.4388%2C1102.1508%2C1102.0702%2C1102.3266%2C1102.3526%2C1102.4022%2C1102.0424%2C1102.2355%2C1102.4851%2C1102.4214%2C1102.2203%2C1102.4622%2C1102.5624%2C1102.1857%2C1102.1935%2C1102.0499%2C1102.1343%2C1102.2575%2C1102.3479%2C1102.0443%2C1102.0328%2C1102.3087%2C1102.5477%2C1102.0797%2C1102.1425%2C1102.3162%2C1102.1870%2C1102.3602%2C1102.3167%2C1102.1412%2C1102.3731%2C1102.1925%2C1102.4899%2C1102.1287%2C1102.3222%2C1102.0837%2C1102.0786%2C1102.0881%2C1102.2017%2C1102.1992%2C1102.0136%2C1102.1803%2C1102.5306%2C1102.3214%2C1102.4053&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Coupled atmosphere-wildland fire modeling with WRF-Fire"}, "summary": "We describe the physical model, numerical algorithms, and software structure\nof WRF-Fire. WRF-Fire consists of a fire-spread model, implemented by the\nlevel-set method, coupled with the Weather Research and Forecasting model. In\nevery time step, the fire model inputs the surface wind, which drives the fire,\nand outputs the heat flux from the fire into the atmosphere, which in turn\ninfluences the atmosphere. The level-set method allows submesh representation\nof the burning region and flexible implementation of various ignition modes.\nWRF-Fire is distributed as a part of WRF and it uses the WRF parallel\ninfrastructure for parallel computing.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1102.0282%2C1102.3513%2C1102.4311%2C1102.1971%2C1102.3057%2C1102.1873%2C1102.0066%2C1102.2123%2C1102.3025%2C1102.3976%2C1102.4578%2C1102.0428%2C1102.0211%2C1102.0561%2C1102.5472%2C1102.1385%2C1102.4594%2C1102.3518%2C1102.3998%2C1102.0038%2C1102.2248%2C1102.5305%2C1102.1260%2C1102.5181%2C1102.4158%2C1102.5612%2C1102.1346%2C1102.0020%2C1102.5579%2C1102.1593%2C1102.2948%2C1102.0050%2C1102.3381%2C1102.0588%2C1102.5356%2C1102.1684%2C1102.1892%2C1102.0686%2C1102.5320%2C1102.0385%2C1102.0503%2C1102.0349%2C1102.4018%2C1102.3579%2C1102.5087%2C1102.1175%2C1102.3750%2C1102.0301%2C1102.3713%2C1102.5641%2C1102.4141%2C1102.2180%2C1102.3662%2C1102.2843%2C1102.4904%2C1102.2184%2C1102.4388%2C1102.1508%2C1102.0702%2C1102.3266%2C1102.3526%2C1102.4022%2C1102.0424%2C1102.2355%2C1102.4851%2C1102.4214%2C1102.2203%2C1102.4622%2C1102.5624%2C1102.1857%2C1102.1935%2C1102.0499%2C1102.1343%2C1102.2575%2C1102.3479%2C1102.0443%2C1102.0328%2C1102.3087%2C1102.5477%2C1102.0797%2C1102.1425%2C1102.3162%2C1102.1870%2C1102.3602%2C1102.3167%2C1102.1412%2C1102.3731%2C1102.1925%2C1102.4899%2C1102.1287%2C1102.3222%2C1102.0837%2C1102.0786%2C1102.0881%2C1102.2017%2C1102.1992%2C1102.0136%2C1102.1803%2C1102.5306%2C1102.3214%2C1102.4053&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We describe the physical model, numerical algorithms, and software structure\nof WRF-Fire. WRF-Fire consists of a fire-spread model, implemented by the\nlevel-set method, coupled with the Weather Research and Forecasting model. In\nevery time step, the fire model inputs the surface wind, which drives the fire,\nand outputs the heat flux from the fire into the atmosphere, which in turn\ninfluences the atmosphere. The level-set method allows submesh representation\nof the burning region and flexible implementation of various ignition modes.\nWRF-Fire is distributed as a part of WRF and it uses the WRF parallel\ninfrastructure for parallel computing."}, "authors": ["Jan Mandel", "Jonathan D. Beezley", "Adam K. Kochanski"], "author_detail": {"name": "Adam K. Kochanski"}, "author": "Adam K. Kochanski", "links": [{"title": "doi", "href": "http://dx.doi.org/10.5194/gmd-4-591-2011", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1102.1343v3", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1102.1343v3", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "Version 3.3, 41 pages, 2 tables, 12 figures. As published in\n  Discussions, under review for Geoscientific Model Development", "arxiv_primary_category": {"term": "physics.ao-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "physics.ao-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1102.1343v3", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1102.1343v3", "journal_reference": "Geoscientific Model Development 4, 591-610, 2011", "doi": "10.5194/gmd-4-591-2011", "fulltext": "arXiv:1102.1343v3 [physics.ao-ph] 10 Mar 2011\n\nManuscript prepared for Geosci. Model Dev. Discuss.\nwith version 2.2 of the LATEX class copernicus discussions.cls.\nDate: 28 May 2018\n\nCoupled atmosphere-wildland fire modeling\nwith WRF-Fire\nversion 3.3\nJan Mandel1 , Jonathan D. Beezley1 , and Adam K. Kochanski2\n1\n\nDepartment of Mathematical and Statistical Sciences, University of Colorado Denver,\nDenver, CO, USA\n2\nDepartment of Meteorology, University of Utah, Salt Lake City, UT, USA\nCorrespondence to: Jan Mandel\n(jan.mandel@gmail.com)\n\nAbstract\nWe describe the physical model, numerical algorithms, and software structure of WRF-Fire.\nWRF-Fire consists of a fire-spread model, implemented by the level-set method, coupled\nwith the Weather Research and Forecasting model. In every time step, the fire model inputs\nthe surface wind, which drives the fire, and outputs the heat flux from the fire into the atmosphere, which in turn influences the atmosphere. The level-set method allows submesh\nrepresentation of the burning region and flexible implementation of various kinds of ignition. WRF-Fire is distributed as a part of WRF and it uses the WRF parallel infrastructure\nfor parallel computing.\n1\n\n\f1\n\nIntroduction\n\nWildland fires impact the lives of millions of people and cause major damage every year\nworldwide, yet they are a natural part of the cycle of nature. Better tools for modeling wildland fire behavior are important for managing fire suppression, planning controlled burns to\nreduce the fuels, as well as to help assess fire danger. Fire models range from tools based\non Rothermel (1972) fire spread rate formulas, such as BehavePlus (Andrews, 2007) and\nFARSITE (Finney, 1998), suitable for operational forecasting, to sophisticated 3-D computational fluid dynamics and combustion simulations suitable for research and reanalysis,\nsuch as FIRETEC (Linn et al., 2002) and WFDS (Mell et al., 2007). BehavePlus, the PCbased successor of the calculator-based BEHAVE, determines the fire spread rate at a single\npoint from fuel and environmental data; FARSITE uses the fire spread rate to provide a 2-D\nsimulation on a PC; while FIRETEC and WFDS require a parallel supercomputer and run\nmuch slower than real time.\nWildland fire is a complicated multiscale process, from the flame reaction zone on milimeter scale to the synoptic weather scale of hundreds of kilometers. Since direct numerical\nsimulation of wildland fire is computationally intractable and detailed data are not available anyway, compromises in the choice of processes to be modeled, approximations, and\nparametrizations are essential. Fortunately, a practically important range of wildland fire\nbehavior can be captured by the coupling of a mesoscale weather model with a simple 2-D\nfire spread model (Clark et al., 1996a,b). Weather has a major influence on wildfire behavior; in particular, wind plays a dominant role in the fire spread. Conversely, the fire\ninfluences the atmosphere through the heat and vapor fluxes from burning hydrocarbons\nand evaporation of fuel moisture. Fire heat output has a major effect on the atmosphere; the\nbuoyancy created by the heat from the fire can cause tornadic strength winds, and the air\nmotion and moisture from the fire can affect the atmosphere also away from the fire. It is\nwell known that a large fire \"creates its own weather\". The correct wildland fire shape and\nprogress result from the two-way interaction between the fire and the atmosphere (Clark\net al., 1996a,b, 2004; Coen, 2005).\nWRF-Fire (Mandel et al., 2009) combines the Weather Research and Forecasting Model\n(WRF) with the ARW dynamical core (Skamarock et al., 2008) with a semi-empirical fire\nspread model. It is intended to be faster than real time in order to deliver a prediction.\nWRF-Fire has grown out of the NCAR's CAWFE code (Clark et al., 1996a,b, 2004;\nCoen, 2005). CAWFE consists of the Clark-Hall mesoscale atmospheric model, coupled\nwith a tracer-based fire spread model. Although the Clark-Hall model has many good properties, it is a legacy serial code, not supported, and difficult to modify or use with real data,\nwhile WRF is a parallel supported community code routinely used for real runs. See Coen\nand Patton (2010) for a further discussion of their relative merits in the wildland fire appli2\n\n\fcation. WRF-Fire was started by Patton and Coen (2004), who proposed a combination of\nWRF with the tracer-based model from CAWFE, formulated a road map, and made the important observation that the innermost domain of the weather code, which interacts directly\nwith the fire model, needs to run in the Large Eddy Simulation (LES) mode. Patton ported\nthe Fortran 77-based fire module to Fortran 90 and developed the initial serial coupled\ncode. However, instead of using the existing tracer-based CAWFE code, the fire module in\nWRF-Fire was developed based on the level-set method (Osher and Fedkiw, 2003). One\nof the reasons was that the representation of the fire region by the level-set function was\nthought to be more flexible than the representation of the burning region in CAWFE by four\ntracers in each cell of the fire mesh. In particular, the level-set function can be manipulated\nmore easily than tracers for the purpose of data assimilation. Insertion of the heat fluxes,\nwhile fundamentally the same as in CAWFE, had to be redone for WRF variables already\nin Patton's initial code. Thus, only the code for the calculation of the fire spread rate and\nthe heat fluxes remained from CAWFE. While WRF-Fire takes advantage of the experience\naccumulated with CAWFE, WRF is quite different from the Clark-Hall atmospheric model\nand the fireline propagation algorithm is also different. Thus, it needs to be demonstrated\nthat WRF-Fire can deliver similar results as CAWFE, and WRF-Fire needs to be validated\nagainst real fires (Sect. 10).\nThe level-set method was used for a surface fire spread model in Mallet et al. (2009). Filippi et al. (2009) coupled the atmospheric model Meso-nh with fire propagation by tracers.\nTiger (Mazzoleni and Giannino, 2010) uses a 2-D combusion model based on reactionconvection-diffusion equations and a convection model to emulate the effect of the fire on\nthe wind. FIRESTAR (Morvan and Dupuy, 2004) is a physically accurate wildland fire\nmodel in two dimensions, one horizontal and one vertical. UU LES-Fire (Sun et al., 2009)\ncouples the University of Utah's Large Eddy Simulation code with the tracer-based code\nfrom CAWFE. See the survey by Sullivan (2009) for a number of other models.\nWRF-Fire was briefly treated as one of the topics in Mandel et al. (2009). The purpose of this paper is to describe the fire module and the coupling with WRF in the current\nWRF-Fire code in sufficient detail, yet understandable to a reader not familiar with WRF.\nIn addition, the advances since the paper Mandel et al. (2009) was written in 2007 include\nnew, practically important ignition schemes (Sect. 4.4), vertical interpolation of the wind in\nthe boundary layer dependent on land-use (Sect. 6), parallel computing (Sect. 7), input of\nreal data (Sect. 9), and validations in progress on real fires (Sect. 10). This paper also contains reproducible descriptions of the physical model (Sect. 2), the required WRF settings\n(Sect. 5), and the coupling of WRF with the fire module (Sect. 6).\nWRF-Fire is public domain software and it has been distributed as a part of the WRF\nsource code at wrf-model.org since version 3.2, released in April 2010 (Dudhia, 2010). The\n3\n\n\freleased version is updated periodically and supported by NCAR. The current development\nversion of WRF-Fire with the latest features and bug fixes and additional visualization tools,\nguides, and diagnostic utilities, are available directly from the developers at openwfm.org.\nThis article describes WRF-Fire as it is scheduled to be included in WRF 3.3, to be released\nin March or April 2011. WRF-Fire user's guide is available as a part of the WRF user's\nguide (Wang et al., 2010), to be updated with the release.\nNew features since WRF version 3.2 include new ignition models, vertical interpolation\nof the wind from logarithmic profile, fetching high-resolution geogrid data, terrain gradient\ninterpolation, and optional input of fuel map, land use map, and high-resolution topography\nin ideal runs.\n2\n\nPhysical fire model and fuels\n\nThe physical model consists of functions specifying the fire spread rate and the heat fluxes,\nand it is essentially the same as a subset of CAWFE (Clark et al., 2004; Coen, 2005). The\nspread rate calculation is in turn based on BEHAVE (Rothermel, 1972; Andrews, 2007). It\nis described here in more detail for the sake of reproducibility and to point out the (minor)\ndifferences.\n2.1\n\nFuel properties\n\nFuel is characterized by the quantities listed in Table 1, which are given at every point of\nthe fire mesh. To simplify the specification of fuel properties, fuels are given as one of 13\nAnderson (1982) categories, which are preset vectors of values of the fuel properties. These\nvalues are specified in an input text file (namelist.fire), and they can be modified by\nthe user. The user can also specify completely new, custom fuel categories.\n2.2\n\nFire spread rate\n\nThe fire model is posed in the horizontal (x, y) plane the Earth surface is projected on. The\nsemi-empirical approach to fire propagation used here assumes that the fire spread rate is\ngiven by the modified Rothermel (1972) formula\nS = R0 (1 + φW + φS ),\n\n(1)\n\nwhere R0 is the spread rate in the absence of wind, φW is the wind factor, and φS is the\nslope factor. The components of (1) computed from the fuel properties (Table 1), the wind\nspeed U , and the terrain slope tanφ following the equations in Table 2. See Rothermel\n(1972) for further details, derivation, and justifications.\n4\n\n\fChaparral is a special fuel in that the spread rate depends only on wind speed. For\nchaparral, (1) is replaced by (Coen et al., 2001, Eq. 1)\nS = min{6,max{0.03333,1.2974U }}.\n\n(2)\n\nThe only differences from Rothermel (1972) are the subtraction of the moisture from\nthe fuel load in the computation rather than up front, limiting the slope and the windspeed,\nthe special chaparral spread rate from CAWFE (2), and the explicit reduction of wind from\n6.1 m height to midflame height, following Baughman and Albini (1980).\nIn either case, the spread rate can be written as\nn\no\nS = max S0 ,R0 + cmin{e,max{0,U }}b + dmax{0,tanφ}2 ,\n(3)\nwhere S0 , R0 , b, c, d, e are the fuel-dependent coefficients that represent the spread rate\ninternally. These coefficients are stored for every grid point.\nAt a point on the fireline, denote by n the outside normal to the fire region, U the wind\nvector, and z the terrain height. The normal component of the wind vector, U = U * n, and\nthe normal component of the terrain gradient, tanφ = ∇z * n, are used to determine the\nspread rate, which is interpreted as the spread rate in the normal direction n.\n2.3\n\nFuel burned and heat released\n\nEach location starts with fuel fraction F = 1. Once the fuel is ignited at a time ti , the fuel\nfraction decreases exponentially,\n\u0012\n\u0013\n(t − ti )\nF (t) = exp −\n, t > ti ,\n(4)\nTf\nwhere t is the time, ti is the ignition time, F0 is the initial amount of fuel, and Tf is the\nfuel burn time, i.e., the number of seconds for the fuel to burn down to 1/e ≈ 0.3689 of the\noriginal quantity. Since by definition of the fuel weight w (Table 1), the fuel burns down to\n0.6 of the original quantity in 600 s when w = 1000, we have\n\u0012\n\u0013\n(t−ti ) 1000\n(t − ti )\n0.6 600 w = exp −\n,\nTf\nwhich gives\nTf = −\n\n600w\nw\n≈\n.\n1000ln0.6 0.8514\n5\n\n\fThe input coefficient w is used in WRF-Fire rather than Tf for compatibility with existing\nfuel models and literature.\nThe average sensible heat flux density released in time interval (t,t + ∆t) is computed as\n\nφh =\n\nF (t) − F (t + ∆t) 1\nw` h,\n∆t\n1 + Mf\n\nJ m−2 s−1\n\n\u0001\n\n(5)\n\nand the average latent heat (i.e., moisture) flux density is given by\nφq =\n\nF (t) − F (t + ∆t) Mf + 0.56\nLw` ,\n∆t\n1 + Mf\n\nJ m−2 s−1\n\n\u0001\n\n(6)\n\nwhere 0.56 is the estimated mass ratio of the water output from the combustion to the dry\nfuel, and L = 2.5 × 106 J kg−1 is the specific latent heat of condensation of water at 0 ◦ C,\nused for nominal conversion of moisture to heat. This computation is from CAWFE.\n3\n\nDomain, grids, and nodes\n\nThe atmospheric model operates on a logically quadrilateral 3-D grid on the Earth surface,\nand uses a sequence of horizontally nested grids, called domains (Kalnay, 2003). Only the\ninnermost (the finest) atmospheric domain is coupled with the fire model; see also Sect. 8.\nScalar variables in the atmospheric model are located at the centers of the 3D grid cells,\nwhile the wind vector components are at a staggered grid at the midpoints of the cell faces.\nThe fire model operates on a refined fire mesh called the subgrid (Fig. 1), and all of its\nvariables are all represented by their values at the centers of the cells of this fire subgrid.\n4\n\nMathematical core of the fire model\n\nSubsections 4.1 and 4.3 below follow Mandel et al. (2009).\n4.1\n\nFire propagation by the level-set method\n\nThe model maintains a level-set function ψ, the time of ignition ti , and the fuel fraction F .\nDenote a point on the surface by x = (x,y). The burning region at time t is represented by\na level-set function ψ = ψ(x,t) as the set of all points x such that ψ(x,t) ≤ 0. There is no\nfire at x if ψ(x,t) > 0. The fireline is the set of all points x such that ψ(x,t) = 0. Since on\n6\n\n\fthe fireline, the tangential component of the gradient ∇ψ is zero, the outside normal vector\nat the fireline is\nn=\n\n∇ψ\n.\nk∇ψk\n\n(7)\n\nNow consider a point x(t) that moves with the fireline. Then the fire spread rate S at x\nin the direction of the normal n is\nS = n*\n\n∂x\n,\n∂t\n\n(8)\n\nand, from the definition of the fireline, ψ(x(t),t) = 0. By the chain rule and substituting\nfrom (7) and (8), we have\n\u0012\n\u0013\n∂ψ ∂ψ ∂x ∂ψ ∂y ∂ψ\n∂x\n∂ψ\nd\n+\n+\n=\n+ k∇ψk n *\n=\n+ S k∇ψk.\n(9)\n0 = ψ(x,t) =\ndt\n∂t ∂x ∂t ∂y ∂t\n∂t\n∂t\n∂t\nSo, the evolution of the level-set function is governed by the partial differential equation\n∂ψ\n+ S k∇ψk = 0,\n∂t\n\n(10)\n\ncalled the level-set equation (Osher and Fedkiw, 2003). The spread rate S is evaluated from\n(3) for all x, not just on the fireline. Since S ≥ 0, the level-set function does not increase\nwith time, and the fire area cannot decrease, which also helps with numerical stability by\neliminating oscillations of the level-set function ψ in time.\nThe level-set equation is discretized on a rectangular grid with spacing (4x,4y), called\nthe fire grid. The level-set function ψ and the ignition time ti are represented by their values\nat the centers of the fire grid cells. This is consistent with the fuel data given in the center\nof each cell also.\nTo advance the fire region in time, we use Heun's method (Runge-Kutta method of order\n2),\nψ n+1/2 = ψ n + ∆tF (ψ n )\n\u0012\n\u0011\u0013\n1\n1 \u0010\nψ n+1 = ψ n + ∆t\nF (ψ n ) + F ψ n+1/2 ,\n2\n2\n\n(11)\n\nThe right-hand side F is a discretization of the term −S k∇ψk with upwinding and artificial\nviscosity,\ne\nF (ψ) = −S (U * n,∇z * n) ∇ψ + ε4ψ,\n\n(12)\n7\n\n\f\u0002\n\u0003\nwhere n = ∇ψ/k∇ψk is computed by finite central differences and ∇ψ = ∇x ψ,∇y ψ\nis the upwinded finite difference approximation of ∇ψ by Godunov's method (Osher and\nFedkiw, 2003, p. 58),\n +\n−\n+\n\nif ∇x ψ ≤ 0 and ∇x ψ ≤ 0,\n∇x ψ\n\n\n\n\n−\n+\n −\n\n∇x ψ\nif ∇x ψ ≥ 0 and ∇x ψ ≥ 0,\n\n\n\n\n−\n+\nif ∇x ψ ≤ 0 and ∇x ψ ≥ 0,\n∇x ψ = 0\n(13)\n\n\n\n−\n−\n+\n\n\notherwise ∇x ψ if ∇x ψ ≥ ∇x ψ ,\n\n\n\n\n−\n+\n\n ∇+ ψ\nif ∇x ψ ≤ ∇x ψ ,\nx\n−\nwhere ∇+\nx ψ and ∇x ψ are the right and left one-sided finite differences\n\n∇+\nx ψ(x,y) =\n\nψ(x + 4x,y) − ψ(x,y)\n,\n4x\n\n∇−\nx ψ(x,y) =\n\nψ(x,y) − ψ(x − 4x,y)\n,\n4x\n\n−\nand similarly for ∇+\ny ψ and ∇y ψ. Further, in (12), ε is scale-free artificial viscosity (ε = 0.4\nhere), and\n\ne = ∇+ ψ − ∇− ψ + ∇+ ψ − ∇− ψ\n4ψ\nx\nx\ny\ny\n=\n\nψ(x + 4x,y) − 2ψ(x,y) + ψ(x − 4x,y)\n+ similar term for y\n4x\n\nis the five-point Laplacian of ψ scaled so that the artificial viscosity is proportional to the\nmesh step,\n2\n2\ne ≈ 4x ∂ ψ + 4y ∂ ψ .\n4ψ\n∂x2\n∂y 2\n\nA numerically stable scheme with upwinding, such as (13), is required to compute the\nterm k∇ψk in the level set equation (10). However, in our tests, the gradient by standard\ncentral differences,\n\u0015\n\u0014\nψ(x + 4x,y) − ψ(x − 4x,y) ψ(x,y + 4y) − ψ(x,y − 4y)\n∇ψ ≈\n,\n,\n24x\n24y\nworked better in the computation of the normal vector n by (7), which is used to evaluate\nthe normal component of the wind and the slope in (3).\n8\n\n\fBefore computing the finite differences up to the boundary, the level-set function is extrapolated to one layer of nodes beyond the boundary. However, the extrapolation is not\nallowed to decrease the value of the level-set function to less than the value at either of the\npoints it is extrapolated from. For example, when (i,j) is the last node in the domain in the\ndirection x, the extrapolation\nψi+1,j = max{ψij + (ψij − ψi−1,j ),ψij ,ψi−1,j },\nis used, and similarly in the other cases. This is needed to avoid numerical instabilities at\nthe boundary. Otherwise, a decrease in ψ at a boundary node, which may happen with nonhomogeneous fuels in real data, is amplified by the extrapolation, and ψ keeps decreasing\nat that boundary node in every time step until it becomes negative, starting a spurious fire.\nThe model does not support fire crossing the boundary of the domain. When ψ < 0 is\ndetected near the boundary, the simulation terminates. This is not a limitation in practice,\nbecause the fire should be well inside the domain anyway for a proper response of the\natmosphere.\n4.2\n\nComputation of the ignition time\n\nThe ignition time ti in the strip that the fire has moved over in one time step is computed by\nlinear interpolation from the level-set function. Suppose that the point x is not burning at\ntime t but is burning at time t + 4t, that is, ψ(x,t) > 0 and ψ(x,t + 4t) ≤ 0. The ignition\ntime at x satisfies ψ(x,ti (x)) = 0. Approximating ψ by a linear function in time, we have\nψ(x,ti ) − ψ(x,t) ψ(x,t + 4t) − ψ(x,ti )\n≈\n,\nti (x) − t\nt + 4t − ti (x)\nand we take\nti (x) = t +\n4.3\n\nψ(x,t)4t\n.\nψ(x,t) − ψ(x,t + 4t)\n\n(14)\n\nComputation of the fuel fraction\n\nThe fuel fraction is approximated over each fire mesh cell C by integrating (4) over the fire\nregion. Hence, the fuel fraction remaining in cell C at time t is given by\n\u0012\n\u0013\nZZ\n1\nt − ti (x)\nF = 1−\n1 − exp −\ndx.\n(15)\narea(C)\nTf (x)\nx∈C\nψ(x,t)≤0\n\n9\n\n\fOnce the fuel fraction is known, the heat fluxes are computed from (5) and (6). This scheme\nhas the advantage that the total heat released in the atmosphere over time is exact, regardless\nof approximations in the computation of the integral (15). Our objective in the numerical\nevaluation of (15) is a method that is second order accurate when the whole cell is on fire,\nexact when no part of the cell C is on fire (namely, returning the value one), and provides a\nnatural transition between these two cases. Just like standard schemes in numerical analysis\ncan be derived from the requirement that they are exact for all polynomials up to a given\ndegree, the guiding principle here is that the scheme should be exact in as many special\ncases as possible. Then we expect that the scheme should work well overall.\nWhile the fuel burn time Tf can be interpolated as constant over the whole cell, the levelset function ψ and the ignition time ti must be interpolated more accurately to allow a\nsubmesh representation of the burning area and a gradual release of the heat as the fireline\nmoves over the cell. In addition, we need the fuel fraction computed over each mesh cell,\nbecause the heat fluxes in the mesh cells are summed up to give the heat flux in an atmospheric cell. Our solution is to split each cell into 4 subcells Cj , interpolate to the corners\nof the subcells, and add the integrals,\n\u0012\n\u0013\n\u0013\n\u0012\nZZ\n4 ZZ\nX\nt − ti (x)\nt − ti (x)\n1−exp −\ndx =\ndx,\n(16)\n1−exp −\nTf (x)\nTf (x)\nx∈C\nψ(x)≤0\n\nj=1x∈C\n\nj\nψ(x)≤0\n\ncf., Fig. 2. The level-set function ψ is interpolated bilinearly to the vertices of the subcells\nCj , and the burn time Tf is constant on each Cj , given by its value at the fire grid nodes.\nHowever, to interpolate the ignition time ti we first define ti outside of the fire region and\non the fireline by\nti = t if ψ ≥ 0.\n\n(17)\n\nThis allows us to omit the condition ψ ≤ 0 in the definition of the integration domains in\n(16) and integrate on the whole cells, respective subcells, only. Then, we interpolate ti\nbilinearly to the vertices of the subcells Cj and correct the resulting values by applying the\ncompatibility condition (17).\nTo compute the integral over a subcell Cj , we first estimate the fraction of the subcell\nthat is burning, by\n!\nP4\nψ(x\n)\narea{x ∈ Cj : ψ(x) ≤ 0}\n1\nk\n≈β =\n1 − P4k=1\n,\n(18)\narea(Cj )\n2\nk=1 |ψ(xk )|\nwhere xk are the the corners of the subcell Cj . This approximation is exact when no part\nof the subcell Cj , is on fire, that is, all ψ(xk ) ≥ 0 and at least one ψ(xk ) > 0; the whole Cj\n10\n\n\fis on fire, that is, all ψ(xk ) ≤ 0 and at least one ψ(xk ) < 0; or the values ψ(xk ) define a\nlinear function and the fireline crosses the subcell diagonally or it is aligned with one of the\ncoordinate directions.\nNext, replace ti (xk ) by t when ψ(xk ) > 0 (i.e., the node xk is not on fire), and compute\nthe approximate fraction of the fuel burned as\n!!\n\u0013\n\u0012\nZZ\n4\n1\n1 X ti (xk ) − t\nt − ti (x)\n(19)\ndx ≈β 1 − exp −\n1 − exp −\narea(C)\nTf (x)\n4\nTf\nk=1\n\nx∈C\nψ(x,t)≤0\n\nThis calculation is accurate asymptotically when the fuel burns slowly and the approximation β of the burning area is exact.\n4.4\n\nIgnition\n\nTypically, a fire starts from a horizontal extent much smaller than the fire mesh cell size,\nand both point and line ignition need to be supported. The previous ignition mechanism\n(Mandel et al., 2009) ignited everything within a given distance from the ignition line at\nonce. This distance was required to be at least one or two mesh steps, so that the initial fire\nis visible on the fire mesh, and the fire propagation algorithm from Sect. 4.1 can catch on.\nThis caused an unrealistically large initial heat flux and the fire started too fast.\nThe current ignition scheme achieves submesh resolution and zero-size ignition. A small\ninitial fire is superimposed on the regular propagation mechanism, which then takes over.\nDrip-torch ignition is implemented as a collection of short ignition segments that grows at\none end every time step. Multiple ignition segments are also supported.\nThe model is initialized with no fire by choosing the level-set function ψ(x,t0 )=const >\n0. Consider an initial fire that starts at time tg on a segment a,b and propagates in all\ndirections with an initial spread rate Sg until the distance rg is reached. At the beginning of\nevery time step t such that\ntg ≤ t ≤ tg +\n\nrg\n,\nSg\n\nwe construct the level-set function of the initial fire,\n\u0001\nψg (x,t) = dist x,a,b − Sg (t − tg )\n\n(20)\n\nand replace the level-set function of the model by\nψ(x,t) := min{ψ(x,t),ψg (x,t)}.\n\n(21)\n11\n\n\fFor a drip-torch ignition starting from point a at time tg at velocity v until time th , the\nignition line at time t is the segment a,a + v(min{t,th } − tg ), and (20) becomes\n\u0010\n\u0011\nψg (x,t) = dist x,a,a + v(min{t,th } − tg ) − min{rg ,Sg (t − tg )}\nfollowed again by (21), at the beginning of every time step begining at time t such that\ntg ≤ t ≤ th +\n\nrg\n.\nSg\n\nThe ignition time of newly ignited nodes is set to the arrival time of the fire at the spread\nrate Sg from the nearest point on the ignition segment.\n5\n\nAtmospheric model\n\nWe summarize some background information about WRF-ARW from Skamarock et al.\n(2008), to the extent needed to understand the coupling with the fire module.\nThe model is formulated in terms of the hydrostatic pressure vertical coordinate η, scaled\nand shifted so that η = 1 at the Earth surface and η = 0 at the top of the domain. The\ngoverning equations are a system of partial differential equations of the form\ndΦ\n= R(Φ),\ndt\n\n(22)\n\nwhere R contains also the advection terms, and Φ = (U,V,W,φ0 ,Θ,μ0 ,Qm ). The fundamental WRF variables are μ = μ(x,y), the hydrostatic component of the pressure differential\nof dry air between the surface and the top of the domain, written in perturbation form μ =\nμ + μ0 , where μ is a reference value in hydrostatic balance; U = μu, where u = u(x,y,η)\nis the Cartesian component of the wind velocity in the x-direction, and similarly V and\nW ; Θ = μθ, where θ = θ(x,y,η) is the potential temperature; φ = φ(x,y,η) = φ + φ0 is the\ngeopotential; and Qm = μqm is the moisture content of the air. The variables in the state\nΦ evolved by (22) are called prognostic variables. Other variables computed from them,\nsuch as the hydrostatic pressure p, the thermodynamic temperature T , and the height z,\nare called diagnostic variables. The variables that contain μ are called coupled. The value\nof the right-hand side R(Φ) is called tendency. See Skamarock et al. (2008, p. 7–13) for\ndetails and the form of R.\n\n12\n\n\fThe system (22) is discretized in time by the explicit 3rd order Runge-Kutta method\n\u0001\n∆t\nR Φt\n3\n∆t\nt\nR(Φ1 )\nΦ2 = Φ +\n2\nΦt+∆t = Φt + ∆tR(Φ2 )\nΦ1 = Φt +\n\n(23)\n\nwhere the differential operator R is discretized by finite differences and the tendencies\nfrom physics packages, such as the fire module, are updated only the third Runge-Kutta\nstep (Skamarock et al., 2008, p. 16). In order to avoid small time steps, the tendency in the\nthird Runge-Kutta step also includes the effect of substeps to integrate acoustic modes.\n6\n\nCoupling of the fire and the atmospheric models\n\nThe terrain gradient is computed from the terrain height at the best available resolution and\ninterpolated to the fire mesh in preprocessing. Interpolating the height and then computing\nthe gradient would cause jumps in the gradient, which affect fire propagation, unless highorder interpolation is used.\nIn each time step of the atmospheric model, the fire module is called from the third step\nof the Runge-Kutta method. First the wind is interpolated to a given height zf above the\nterrain (currently, 6.1 m following BEHAVE), assuming the logarithmic wind profile\n\u001a\nconst ln zz0 ,\nz ≥ z0 ,\nu(z) ≈\n0\n0 ≤ z ≤ z0 ,\nwhere z is the height above the terrain and z0 is the roughness height. For a fixed horizontal location, denote by z1 , z2 ,... the heights of the centers of the atmospheric mesh cells;\nthese are computed from the geopotential φ, which is a part of the solution. The horizontal wind component u(zf ) under the u-points (Fig. 1) is then found by vertical log-linear\ninterpolation, that is, u(zf ) is found by 1-D piecewise linear interpolation of the values\nu(z0 ) = 0, u(z1 ), u(z2 ),... at lnz0 , lnz1 , lnz2 ,... to lnzf . If zf ≤ z0 , we set u(zf ) = 0.\nThe v component of the wind is interpolated vertically in the same way. Each horizontal\nwind component u, v is then interpolated separately to the cell centers of the fire subgrid\nby bilinear interpolation.\nThe fire model then makes one time step:\n1. If there are any active ignitions, the level-set function is updated and the ignition times\nof any newly ignited nodes are set following Sect. 4.4.\n13\n\n\f2. The numerical scheme (11)–(13) for the level set equation (10) is advanced to the next\ntime step.\n3. The time of ignition set for any any nodes that were ignited during the time step, from\n(14).\n4. The fuel fraction is updated following Sect. 4.3.\n5. The sensible and latent heat flux densities are computed from (5) and (6) in each fire\nmodel cell.\n6. The resulting heat flux densities are averaged over the fire cells that make up one atmosphere model cell, and inserted into the atmospheric model, which then completes\nits own time step.\nThe heat fluxes from the fire are inserted into the atmospheric model as forcing terms\nin the differential equations of the atmospheric model into a layer above the surface, with\nassumed exponential decay with altitude. Such scheme is needed because WRF does not\nsupport flux boundary conditions. This is code originally due to Clark et al. (1996a,b) and\nit was rewritten for WRF variables in Patton and Coen (2004). The sensible heat flux is\ninserted as an additional source term to the equation for the potential temperature θ, equal\nto the vertical divergence of the heat flux,\n\u0012\n\u0013\nd(μθ)\nμ(x,y)φh (x,y) ∂\nz\n(x,y,z) = RΘ (Φ) +\nexp −\n,\ndt\nσ%(x,y,z) ∂z\nzext\nwhere RΘ (Φ) is the component of the tendency in the atmospheric model equations (22),\nσ is the specific heat of the air, %(x,y,z) is the density, and zext is the heat extinction\ndepth, given as parameter fire ext grnd in namelist.input. The latent heat flux\nis inserted similarly into the tendency of the vapor concentration qm by\n\u0012\n\u0013\nμ(x,y)φq (x,y) ∂\nd(μqm )\nz\n(x,y,z) = RQm (Φ) +\nexp −\n,\ndt\nL%(x,y,z) ∂z\nzext\nwhere L is the specific latent heat of the air. Cf. Clark et al. (1996a, Eqs. 10, 12, 13, 18).\n7\n7.1\n\nSoftware structure\nParallel structure\n\nParallel computing imposes a significant constraint on user programming technique. WRF\nparallel infracture (Michalakes, 2000) divides the domain horizontally into patches. Each\n14\n\n\fpatch executes in a separate MPI process and it may be further divided into tiles, which\nexecute in separate OpenMP threads (Fig. 3). Communication between the tiles is accomplished by exiting the OpenMP parallel loop over the tiles. The fire grid tiles are colocated\nwith the atmospheric grid tiles (Fig. 1). The patches are declared in memory with larger\nbounds than the patch size, and communication between the patches is accomplished by\nHALO calls (actually, includes of generated code), which update a layer of array entries\nbeyond the patch boundary from other patches. The fire module computational code itself\nis designed to be tile-callable as required by the WRF coding conventions (WRF Working\nGroup 2, 2007). Tile-callable code updates array values on a single tile, assuming that it\ncan safely read data from a layer of several array entries beyond the tile boundary. The\ncommunication (OpenMP loops or HALO calls) happens outside; this means that every\ntime when communication is needed, tile-callable code must exit, and then the next stage\ncan resume on the next call (Fig. 4). The fire module code executes in 6 stages interleaved\nwith communication, 3 stages for initialization and 3 stages in every time step.\n7.2\n\nSoftware layers\n\nThe fire module software is organized in several isolated layers (Fig. 5). The driver layer\ncontains all exchange of data between the tiles in parallel execution. The rest of the code\nis tile-callable. The driver layer calls the interpolation and other coupling between the fire\nand the atmospheric grids, and the fire code itself. The atmospheric physics layer mediates\nthe insertion of the fire fluxes into the atmosphere, as described in Sect. 2. Only these\ntwo layers depend on WRF; the rest of the fire module can be used as a standalone code,\nindependent on WRF. The utility layer contains interpolation and other service code, such\nas stubs to control access to WRF infrastructure, so that WRF calls can be easily emulated\nin the standalone code. The model layer is the entry point to the fire module. The core\nlayer is the engine of the fire model, described in Sect. 4. The fire physics layer evaluates\nthe fire spread rate and heat fluxes from fuel properties. One of the goals of the design is\nthat the only components that will need to be modified when the fire module is connected\nto another atmospheric model in future are the driver layer, the atmospheric physics layer,\nand the WRF stubs in the utility layer.\n\n15\n\n\f8\n8.1\n\nRecommended WRF settings\nDomains and nesting\n\nWRF-Fire may be run in both \"ideal\" and \"real\" modes, which require slightly different setups. In both cases, the model requires a set of data defining model initialization\n(wrfinput). In the real cases, boundary conditions in a form of wrfbdy files must be\nalso provided, and both types of files are created by real.exe preprocessor from the WRF\nPreprocessing System (WPS). These files contain not only meteorological and topographical data but also fire related information, such as the fuel type map and high-resolution\ntopography on the fire mesh. Since the WRF-Fire initialization for the real cases does not\ndiffer from the one for the regular WRF, all physical and dynamical options available in the\nregular WRF are also available in WRF-Fire. Therefore, the same general rules apply to the\nconfiguration of WRF-Fire as to the configuration of the regular WRF. However, one should\nkeep in mind that resolutions of the finest domains in fire simulations are usually significantly higher than in weather forecasting applications. This has two consequences in terms\nof the proper WRF-Fire setup. First, if the resolution of any of the inner domains is less than\n100 m, this domain should be actually resolved in the large eddy simulation (LES) mode,\nwithout the boundary layer parameterizations. At this resolution, the model should be able\nto resolve the most energetic eddies responsible for mixing within the boundary layer, so\nthe boundary layer parameterization in this case is not needed. Second, since in the nested\nmode, vertical levels are common for all domains, the height of the first model level selected for the most outer (parent) domain, defines also the level of the first model layer\nfor all inner (child) domains, even if their horizontal resolutions are an order of magnitude\nsmaller. The fact that the vertical model resolution is the same for all domains significantly\nlimits the minimum height above the ground of the first model level. This in turn is crucial for the fire model, which uses the wind speed interpolated to 6.1 m above the ground.\nTherefore, in the cases when the first model level must be relatively high above the ground\nit is recommended to perform downscaling using the ndown.exe program, being a part\nof the WRF distribution. In this case the outer domains are run separately without the fire,\nand then based on the output from this simulation, ndown.exe creates a set of new initial\nand boundary condition files (wrfinput and wrfbdy) for the separate simulation from\nthe innermost domain(s). This allows for a new setup of vertical levels for the innermost\ndomains, and selecting proper physical options for them.\n\n16\n\n\f8.2\n\nLarge Eddy Simulation and surface properties\n\nTo enable the high-resolution simulation in Large Eddy Simulation (LES) mode, user should\nfirst disable the boundary layer parameterization (bl pbl physics=0). The LES mode\nrequires the proper surface fluxes in order work properly. We recommend the option\nisfflx=1, which makes WRF use a surface model to compute the surface fluxes. Other\noptions with constant heat fluxes and drag are not well suited for fire simulations. Out of all\nsurface exchange parameterizations only the classic Monin-Obukhov theory (sf sfclay physi\nis recommended for the LES cases. This option assures a proper computation of surface\ntransfer coefficients that are used together with the surface properties (provided by the surface model) for computation of the surface fluxes of the momentum, heat and moisture. The\nsurface model itself computes properties of the surface, but does not compute the surface\nexchange coefficients, which are needed for computation of the surface fluxes. Hence, in\norder to compute them, the surface properties must be provided by a surface model, which\nis enabled by choosing a non-zero sf surface physics. The subgrid scale parameterization used by the WRF in LES mode is defined by the km opt parameter, which should\nbe set to 2 (TKE closure), or 1 (Smagorinsky scheme).\nIn real cases, real.exe automatically provides proper initialization for the selected\nland surface model, and all other components. In idealized cases, users have an option\nof the basic surface initialization, intended to be used without the surface model, or the\nfull surface initialization (sfc full init=1). One should keep in mind that without\nthe full surface initialization, there is no direct way to define surface properties such as\ntemperature or roughness. For idealized cases with the full surface initialization, the surface\nscheme utilizes a table containing records of land-use categories and corresponding surface\nproperties like roughness length, heat capacity, etc. All these properties are defined in a text\nfile LANDUSE.TBL, which may be edited by the user. Therefore, setting up the land-use\ncategory is enough to provide all static surface properties. The basic parameters required by\nthis surface model like land use index, surface air temperature and soil temperature, may be\ndefined directly in namelist.input by the variables sfc lu index, sfc tsk, and\nsfc tmn if they are intended to be the same over the whole domain. If they are not spatially\nuniform, they may be read in from external files if fire read lu, fire read tsk, or\nfire read tmn are set to true. For details about the input data for real cases, see Sect. 9.\n8.3\n\nFire subgrid refinement ratios\n\nThe fire mesh needs to be about 10 times finer than the atmospheric mesh to allow for\ngradual heat release into the atmosphere, even if fuel and topography data may not be\navailable at such fine resolution. The fire mesh refinement in the x and y direction (sr x\n17\n\n\fand sr y) must be defined in the domain section of namelist.input. Since these\nrefinement factors define dimensions of the fire-related variables, they must be selected\nbefore execution of real.exe, which generates the WRF input files. Any change in\natmospheric to fire grid ratios requires re-running real.exe and creating new input files.\nThe atmospheric mesh step should be about 60 m or less for proper feedback of the wind\non the fire line; larger mesh step can result in incorrect fire spread rates and atmospheric\nbehavior (Clark et al., 1996a, p. 887).\n8.4\n\nTime step\n\nIn real WRF-Fire simulations performed in multi-domain configurations the time step requirements for the outer domains (run without fire) do not differ from general meteorological cases. The recommended time step of 6 times the horizontal grid spacing (in km)\nmay be used as a starting point. However, for the finest domains run with fire simulations,\nthe time step in most cases must be significantly smaller. For domains with low vertical\nresolution and simple topography, the horizontal mesh step is crucial for numerical stability, since the horizontal velocity is greater than the vertical one. In fire simulations with\nhigh vertical resolution, the vertical velocity induced by fire may violate the CFL condition. Therefore, it is advisable to use a vertically stretched grid, with finer resolution at\nthe surface (where updraft velocities are not that high) and lower resolution at higher levels\nwhere stronger updrafts are expected. This allows for having the first model level relatively\nclose to the ground, yet with vertical spacing aloft big enough to handle strong convective\nupdrafts without violating the CFL condition.\nIn real cases, the pressure levels may be defined directly in the namelist.input\nfile. In ideal WRF-Fire runs, there is now an option stretch hyp, which turns on hyperbolic grid stretching. The grid refinement may be adjusted using the z grd scale\nnamelist variable. One should keep in mind that running the WRF-Fire simulations with\nhigh-resolution topography in most cases limits the maximum numerically stable time step.\nSteep terrain often induces high vertical velocities that may violate the CFL condition.\nTherefore, these cases usually require significantly smaller time steps than similar simulations run with low-resolution, smooth topography.\n9\n\nData input\n\nA WRF ideal run is used for simulations on artificial data. An additional executable,\nideal.exe, is run first to create the WRF input. A different ideal.exe is built for\neach ideal case, and the user is expected to modify the source of such ideal case to run\ncustom experiments. The ideal run for fire supports optional input of gridded arrays for\n18\n\n\fland properties, such as terrain height, roughness height, and terrain height. This allows\nto run simulations which go beyond what would normally be considered an ideal run and\nsimplifies custom data input; the simulation of the FireFlux experiment (Sect. 10) was done\nin this way.\nA WRF real run is used for prediction and analysis of natural events. For a real run, a\nuser must supply data for the initial and boundary conditions for the WRF simulation. The\nWRF Preprocessing System (WPS) (Wang et al., 2010, Chapter 3) contains a number of\nutilities useful for preparing standard atmospheric and surface datasets for input into WRF.\n1. Geogrid creates the surface mesh from a specified geographic projection and interpolates static surface data onto the mesh. It supports several interpolation methods as\nwell as data smoothing and creation of gradient fields. Geogrid reads data in a tiled\nbinary format described by a text file and writes to a NetCDF file for each nested\nmesh. All data required for atmospheric simulations up to 30 arcseconds resolution\nglobally are provided by NCAR.\n2. Ungrib extracts atmospheric data from standard GRIB files and writes to a simple binary format. Ungrib does not do any interpolation; it only searches through a number\nof files for necessary variables within the time window of the simulation. Data for\nungrib must be obtained by the user. Several free sources of atmospheric GRIB data\nare available online from production weather simulation.\n3. Metgrid reads the output from geogrid and ungrib and produces a series of NetCDF\nfiles read by WRF's real.exe binary. The geogrid output is copied directly into\neach of these files, while the ungrib output is interpolated horizontally on to the computational mesh.\nThe metgrid files produced by WPS are portable and relatively compact so they can\nbe transferred to a computer cluster for the simulation's execution. From this point, the\nreal.exe program in WRF handles the vertical interpolation of atmospheric fields and\nall processing for the creation of WRF's initial (wrfinput) and boundary (wrfbdy) files.\nWPS has been extended with the ability to produce data defined on the refined surface\nmeshes used by WRF-Fire (Sect. 8); however, it is not possible to distribute high resolution, global fields as is done in the standard dataset. Instead, the user must download any\nnecessary high resolution fields and convert them into geogrid's binary format for each simulation. WRF-Fire is distributed with an additional utility, convert geotiff.x, which\ncan perform this conversion from any GeoTIFF file. This utility is written entirely in C and\ndepends only on the GeoTIFF library.\nFor a WRF-Fire simulation, it is only strictly necessary to download one additional\ndataset for input into geogrid. This dataset contains fuel behavior categories and is stored\n19\n\n\fin the variable NFUEL CAT. For simulations within the United States, this data can be obtained in GeoTIFF format from the USGS at http://www.landfire.gov. WRF-Fire uses an\nadditional variable for topography, ZSF, which is allowed to be different from the topography used used by the atmospheric code defined by HGT. This is useful because a high\nresolution WRF simulation generally requires the topography to be highly smoothed in\npreprocessing for numerical stability. The fire code can benefit from a rougher topography\nfor more accurate fire spread computations.\nOnce the static data is converted into the geogrid binary format, the GEOGRID.TBL\nshould be edited to inform geogrid of the location of each supplementary dataset. WRF-Fire\nexpects two variables to be created on the refined subgrid (NFUEL CAT and ZSF), this is\nindicated by the line subgrid=yes; all other variables will be defined on the standard\natmospheric grid.\nFor atmospheric data, it is best to use the highest resolution dataset available to initialize\na WRF-Fire simulation to capture as much of the local conditions near the fire as possible.\nGenerally, publicly available atmospheric data is limited to around 10 km resolution. As a\nconsequence, one should create several nested grids, each with a 3 to 1 refinement ratio,\nand a long spin-up prior to ignition in order to recreate local conditions. Preliminary results indicate that assimilation of data from weather stations or satellite radiances may be\nrequired for an accurate simulation (Beezley et al., 2010).\n10\n\nComputational simulations\n\nKim (2011) has verified that the level-set method in the fire module advects the fire shape\ncorrectly, on some of the same examples that were used to verify the tracer code in CAWFE\n(Clark et al., 2004).\nA number of successful simulations with WRF-Fire now exist.\nJenkins et al. (2010) have demonstrated fireline fingering behavior for a sufficiently long\nfireline (Figs. 8, 9) on an ideal example, with similar results as in Clark et al. (1996a,b).\nKochanski et al. (2010) have demonstrated the validity of WRF-Fire on a simulation of\nthe Clements et al. (2007) FireFlux grass fire experiment and obtained good agreement\nwith data (Figs. 6, 7). Dobrinkova et al. (2010) simulated a fire in Bulgarian mountains\nusing real meteorological and geographical data, and ideal fuel data. Beezley et al. (2010)\nsimulated the 2010 Meadow Creek fire in Colorado mountains using real data from online\nsources. Topography (Fig. 10) at up to 3 m horizontal resolution was obtained from the\nNational Elevation Dataset (NED, http://ned.usgs.gov) and fire fuel datasets from Landfire\n(http://landfire.cr.usgs.gov) at up to 10 m resolution. Six nested domains were required\nto scale the simulation down from the atmospheric initialization (32 km) to the fire grid\n20\n\n\fresolution (10 m). Cloud physics was enabled in domains 1–3. The fire subgrid refinement\nratio was 10 times on the finest domain to capture fire surface variables and for a gradual\nrelease of the heat flux near the fireline. Realistic fire and atmosphere behavior was obtained\n(Figs. 11, 12).\n11\n11.1\n\nDiscussion\nAdditional features\n\nWRF-Fire does not yet support canopy fire, although canopy fire colocated with ground fire\nis contained in CAWFE. The reason was the desire to keep the code as simple as possible\nearly on and add features only as they can be verified and validated. The support for canopy\nfire will be added in future. Adding smoke from the fire to WRF is also under consideration.\nA list of desired features and a record of the progress of the development are maintained at\nhttp://www.openwfm.org/wiki/WRF-Fire development notes.\n11.2\n\nAtmosphere\n\nRothermel's spread model (1) assumes wind as if the fire was not there. In practice, the\nwind was measured away from the fire. In a coupled model, however, the feedback on\nthe fire is from the wind that is influenced by the fire. Clark et al. (2004) noted that the\nhorizontal wind right above the fireline may even be zero, and proposed to take the wind\nfrom a specified distance behind the fireline. Also, the strong heat flux from fire disturbs\nthe logarithmic wind profile, and the rate of spread as a function of wind at a specific\naltitude may not be a good approximation; rather, the fire spread may depend more strongly\non the complete wind profile (Jenkins et al., 2010) and on turbulence (Sun et al., 2009).\nThe assumption of horizontal homogeneity in the Monin-Obukhov similarity theory is not\nsatisfied here; the horizontal dimension of the active part of fire is not orders of magnitude\nlarger than the boundary layer height as required, and it may be in fact smaller. Another\nindication that the Monin-Obukhov theory may not apply for fires is a strong drop in the\nheat transfer in the case of strong temperature gradients, shown in our preliminary tests.\nHorizontal wind could be interpolated vertically to different heights for different fuels\nlike in CAWFE model, which takes the wind from different mesh levels for different fuels.\nHowever, here we follow a classical approach of Rothermel (1972) and Baughman and\nAlbini (1980), where the wind speed is evaluated at the common 6.1m height, and then\nconverted to the mid-flame height using the fuel-specific wind correction factors.\nVery strong vertical components of the wind caused by the fire result in the need for short\ntime steps to avoid violation of the vertical CFL condition (Sect. 8.4). It would be interesting to couple the fire module also with the Non-hydrostatic Mesoscale Model (NMM) core\n21\n\n\fof WRF, which is implicit in the vertical direction (Janjic et al., 2005), and it may perform\nbetter in the presence of strong convection (Litta and Mohanty, 2008). The ARW core is\nsemi-implicit in the vertical direction in the vertical wind component and the geopotential.\n11.3\n\nFire\n\nThe more recent Scott and Burgan (2005) fuel categories are more detailed than Anderson\n(1982) categories, they are supported by BehavePlus, and fuel maps using them are available from Landfire. But instead of describing additional categories in namelist.fire, it\nmay be more useful to support the import of fuel files from BehavePlus, which is also well\nsuited for editing and diagnosing fuel models. More accurate fuel models (Albini et al.,\n1995; Clark et al., 1996a), including those in BehavePlus, consider fuels to be mixtures of\ncomponents with different burn times, which results in a different heat release curve.\nWhile the spread rate of established fire in the simulation of the FireFlux experiment\nwas reasonably close, the simulated fire still arrived at the observation towers too soon\n(Kochanski et al., 2010), because it started too quickly. A better parametrization of the\nignition process seems to be in order. The fire spread in the Meadow Creek fire simulation\nwas also too fast, but for a different reason. It is well known that the actual spread rates\nof wildland fires tend to be lower than the spread rates in simulations, which are derived\nfrom laboratory experiments. This effect might be attributed to irregularities on scales not\ncaptured by the simulation (Finney, 1998, p. 34), including granularity of the fuel supply\nnot reflected in the data. Refining the semi-empirical model from detailed numerical simulations and parametrizing complex fire behavior are suggested important research areas.\nThe computation of the heat fluxes in (5) and (6) does not take into account the evaporation of moisture present in the fuel, only the production of water by burning of hydrocarbons. This error is typically just few %, however, which is small in comparison with\nother uncertainties. The fuel models should be dynamic (with variable fuel moisture) as in\nBehavePlus. Coen (2005) added an explicit diurnal cycle for the moisture into CAWFE.\nHere, moisture content could be coupled with existing WRF land surface models, which\ncould take into account air humidity and precipitation. The radiative and convective parts\nof the sensible heat flux should be treated differently. The release of surface heat and moisture into the atmosphere are already present in WRF soil models. Their scale, however, is\ndifferent from the powerful heat release from a fire.\n11.4\n\nNumerical methods\n\nIn a numerical implementation, the level-set method is global, unlike tracers, which move\nlocally. In spite of the fact that the level-set equation determines the fire spread locally from\n22\n\n\fthe spread rate at the fireline, the behavior of the fireline depends slightly on the wind, the\nfuel, and the level set function in certain other locations from previous time steps, because\nof the discretization errors and the artificial diffusion. This nonlocal behavior has not been\npractically significant, however.\nThe fuel fraction calculation (19) can have significant error in the fire subgrid cells near\nthe fireline, which will to some degree average out over the atmospheric mesh cells. Rigorous error analysis will be done elsewhere. We are currently testing an alternative method\nwhich is always second order in the sense that it is exact when the time from ignition and\nthe level-set function are linear in space. The alternative method is more computationally\nexpensive, but, on the other hand, it might allow to decrease the subgrid refinement ratio;\nwith large meshes, it is possible to run against 32 bit integer limits.\n11.5\n\nData assimilation\n\nData assimilation for wildland fires is an area of great interest. Methodologies for a reactiondiffusion model were proposed based on the ensemble Kalman filter (EnKF) and the particle\nfilter (Mandel et al., 2004). Unfortunately, statistical perturbations can cause spurious fires,\nwhich do not dissipate. Combination of the EnKF with Tikhonov regularization alleviates\nthe problem somewhat (Johns and Mandel, 2008; Mandel et al., 2009), but the resulting\nmethod is still not robust enough. A new method, called morphing EnKF and based on\ncombined amplitude and displacement correction (Beezley and Mandel, 2008), was shown\nto work with WRF-Fire (Mandel et al., 2009), and it is under continued development (Mandel et al., 2010, 2011). We are not aware of any work elsewhere on data assimilation for\na coupled fire-atmosphere model. Particle filters were proposed for discrete cell-based fire\nmodels (Bianchini et al., 2006; Gu et al., 2009), using fitness functions involving the area\nburned rather than intensities of physical variables.\nStarting the model from a known fire perimeter is important for many potential users.\nThis can be understood as a data assimilation problem, but we are considering a simpler\nmethod for this particular case: prescribe the fire history up to the time of the given perimeter to allow the atmospheric conditions to evolve, then allow the coupled model take over.\nTools to produce such artificial fire history are being developed. Possibly the simplest alternative is an interpolation from a given ignition point and time to the given perimeter. A\nmore complex version would run the fire model (without atmosphere) backwards in time\nand attempt to find the ignition point automatically. The latter approach could be also interesting for forensic purposes.\n\n23\n\n\f12\n\nConclusions\n\nWe have described the coupled atmosphere-fire model WRF-Fire. The software is publicly\navailable and it supports both ideal and real runs. Visualization and diagnostic utilities are\navailable. Currently, the model is suitable for research and education purposes. Validation\nis in progress.\nAcknowledgements. The authors would like to thank John Michalakes for developing the support\nfor the refined surface fire grid in WRF and information about WRF algorithms, Ned Patton for\nproviding a copy of his prototype code, and Janice Coen for providing a copy of CAWFE, liason with\nNCAR, and useful suggestions. Other contributions to the model are acknowledged by bibliographic\ncitations in the text. We would like to thank also Mary Ann Jenkins for reading this paper and\nsuggesting improvements. This research was supported by NSF grant AGS-0835579 and NIST Fire\nResearch Grants Program grant 60NANB7D6144.\n\nReferences\nAlbini, F. A., Brown, J. K., Reinhardt, E. D., and Ottmar, R. D.: Calibration of a Large Fuel Burnout\nModel, Int. J. Wildland Fire, 5, 173–192, doi:10.1071/WF9950173, 1995.\nAnderson, H. E.: Aids to determining fuel models for estimating fire behavior, General Technical\nReport INT-122, US Department of Agriculture, Forest Service, Intermountain Forest and Range\nExperiment Station, http://www.fs.fed.us/rm/pubs int/int gtr122.html, 1982.\nAndrews, P. L.: BehavePlus fire modeling system: past, present, and future, Paper J2.1, 7th Symposium on Fire and Forest Meteorology, http://ams.confex.com/ams/pdfpapers/126669.pdf, 2007.\nBaughman, R. G. and Albini, F. A.: Estimating Midflame Windspeeds, in: Proceedings, Sixth Conference on Fire and Forest Meteorology, Seattle, WA April 22-24, 1980, pp. 88–92, Society of\nAmerical Foresters, Washington, DC, 1980.\nBeezley, J. D. and Mandel, J.: Morphing Ensemble Kalman Filters, Tellus, 60A, 131–140, doi:\n10.1111/j.1600-0870.2007.00275.x, 2008.\nBeezley, J. D., Kochanski, A., Kondratenko, V. Y., Mandel, J., and Sousedı́k, B.: Simulation of\nthe Meadow Creek fire using WRF-Fire, Poster at AGU Fall Meeting 2010, available at http:\n//www.openwfm.org/wiki/File:Agu10 jb.pdf, 2010.\nBianchini, G., Cortés, A., Margalef, T., and Luque, E.: Improved Prediction Methods for Wildfires\nUsing High Performance Computing: A Comparison, in: Computational Science, ICCS 2006,\nedited by Alexandrov, V., van Albada, G., Sloot, P., and Dongarra, J., vol. 3991 of Lecture Notes in\nComputer Science, pp. 539–546, Springer Berlin / Heidelberg, doi:10.1007/11758501 73, 2006.\nClark, T. L., Jenkins, M. A., Coen, J., and Packham, D.: A Coupled Atmospheric-Fire Model:\nConvective Feedback on Fire Line Dynamics, J. Appl. Meteor, 35, 875–901, doi:10.1175/\n1520-0450(1996)035h0875:ACAMCFi2.0.CO;2, 1996a.\nClark, T. L., Jenkins, M. A., Coen, J. L., and Packham, D. R.: A coupled atmosphere-fire model:\n\n24\n\n\fRole of the convective Froude number and dynamic fingering at the fireline, International Journal\nof Wildland Fire, 6, 177–190, doi:10.1071/WF9960177, 1996b.\nClark, T. L., Coen, J., and Latham, D.: Description of a Coupled Atmosphere-Fire Model, International Journal of Wildland Fire, 13, 49–64, doi:10.1071/WF03043, 2004.\nClements, C. B., Zhong, S., Goodrick, S., Li, J., Potter, B. E., Bian, X., Heilman, W. E., Charney,\nJ. J., Perna, R., Jang, M., Lee, D., Patel, M., Street, S., and Aumann, G.: Observing the dynamics\nof wildland grass fires – FireFlux – A field validation experiment, Bull. Amer. Meteorol. Soc.,\n88, 1369–1382, doi:10.1175/BAMS-88-9-1369, 2007.\nCoen, J. and Patton, N.: Implementation of Wildland Fire Model Component in the Weather\nResearch and Forecasting (WRF) Model, http://www.mmm.ucar.edu/research/wildfire/wrf/wrf\nsummary.html, visited December 2010, 2010.\nCoen, J. L.: Simulation of the Big Elk Fire using coupled atmosphere-fire modeling, International\nJournal of Wildland Fire, 14, 49–59, doi:10.1071/WF04047, 2005.\nCoen, J. L., Clark, T. L., and Hall, W. D.: Coupled atmosphere-fire model simulations in various\nfuel types in complex terrain, Paper 3.2, 4th Symposium on Fire and Forest Meteorology, Jan.\n11-16, Phoenix, Arizona, http://ams.confex.com/ams/pdfpapers/25506.pdf, 2001.\nDobrinkova, N., Jordanov, G., and Mandel, J.: WRF-Fire Applied in Bulgaria, Proceedings of 7th\nInternational Conference on Numerical Methods and Applications - NM&A'10, August 20 - 24,\n2010, Borovets, Bulgaria, Springer, to appear, preprint available as arXiv:1007.5347, 2010.\nDudhia, J.: The Weather Research and Forecasting Model: 2010 Annual Update, 2010 WRF Users\nWorkshop, http://www.mmm.ucar.edu/wrf/users/workshops/WS2010/abstracts/1-1.pdf, 2010.\nFilippi, J. B., Bosseur, F., Mari, C., Lac, C., Moigne, P. L., Cuenot, B., Veynante, D., Cariolle, D.,\nand Balbi, J.-H.: Coupled atmosphere-wildland fire modelling, J. Adv. Model. Earth Syst., 1, Art.\n11, doi:10.3894/JAMES.2009.1.11, 2009.\nFinney, M. A.: FARSITE: Fire Area Simulator-model development and evaluation, Res. Pap.\nRMRS-RP-4, Ogden, UT: U.S. Department of Agriculture, Forest Service, Rocky Mountain Research Station, http://www.fs.fed.us/rm/pubs/rmrs rp004.html, 1998.\nGu, F., Yan, X., and Hu, X.: State estimation using particle filters in wildfire spread simulation, in:\nSpringSim '09: Proceedings of the 2009 Spring Simulation Multiconference, pp. 1–8, Society for\nComputer Simulation International, San Diego, CA, USA, 2009.\nJanjic, Z., Black, T., Pyle, M., Chuang, H.-y., , Rogers, E., and DiMego, G.: The NCEP WRF\nNMM Core, 5th WRF/14th MM5 Users Workshop, paper 2.9, http://www.mmm.ucar.edu/wrf/\nusers/workshops/WS2005/abstracts/Session2/9-Janjic.pdf, 2005.\nJenkins, M., Kochanski, A., Krueger, S. K., Mell, W., and McDermott, R.: The Fluid Dynamical\nForces Involved in Grass Fire Propagation, Poster at AGU Fall Meeting 2010, available at http:\n//www.openwfm.org/wiki/File:AGU.2010.poster.jenkins.etal.pdf, 2010.\nJohns, C. J. and Mandel, J.: A Two-Stage Ensemble Kalman Filter for Smooth Data Assimilation,\nEnvironmental and Ecological Statistics, 15, 101–110, doi:10.1007/s10651-007-0033-0, 2008.\nKalnay, E.: Atmospheric Modeling, Data Assimilation and Predictability, Cambridge University\nPress, 2003.\nKim, M.: Reaction Diffusion Equations and Numerical Wildland Fire Models, Ph.D. thesis, University of Colorado Denver, 2011.\n\n25\n\n\fKochanski, A., Jenkins, M., Krueger, S. K., Mandel, J., Beezley, J. D., and Clements, C. B.: Evaluation of The Fire Plume Dynamics Simulated by WRF-Fire, Presentation at AGU Fall Meeting\n2010, available at http://www.openwfm.org/wiki/File:AGU.2010.kochanski.key.gz, 2010.\nLinn, R., Reisner, J., Colman, J. J., and Winterkamp, J.: Studying wildfire behavior using FIRETEC,\nInt. J. of Wildland Fire, 11, 233–246, doi:10.1071/WF02007, 2002.\nLitta, A. J. and Mohanty, U. C.: Simulation of a severe thunderstorm event during the field experiment of STORM programme 2006, using WRF-NMM model, Current Science, 95, 204–215,\n2008.\nMallet, V., Keyes, D. E., and Fendell, F. E.: Modeling Wildland Fire Propagation with Level Set\nMethods, Computers & Mathematics with Applications, 57, 1089–1101, doi:10.1016/j.camwa.\n2008.10.089, 2009.\nMandel, J., Chen, M., Franca, L. P., Johns, C., Puhalskii, A., Coen, J. L., Douglas, C. C., Kremens, R., Vodacek, A., and Zhao, W.: A Note on Dynamic Data Driven Wildfire Modeling, in:\nComputational Science - ICCS 2004, edited by Bubak, M., van Albada, G. D., Sloot, P. M. A.,\nand Dongarra, J. J., vol. 3038 of Lecture Notes in Computer Science, pp. 725–731, Springer,\ndoi:10.1007/b97989, 2004.\nMandel, J., Beezley, J. D., Coen, J. L., and Kim, M.: Data Assimilation for Wildland Fires: Ensemble Kalman filters in coupled atmosphere-surface models, IEEE Control Systems Magazine, 29,\n47–65, doi:10.1109/MCS.2009.932224, 2009.\nMandel, J., Beezley, J. D., and Kondratenko, V. Y.: Fast Fourier Transform Ensemble Kalman Filter\nwith Application to a Coupled Atmosphere-Wildland Fire Model, in: Computational Intelligence\nin Business and Economics, Proceedings of MS'10, edited by Gil-Lafuente, A. M. and Merigo,\nJ. M., pp. 777–784, World Scientific, 2010.\nMandel, J., Beezley, J. D., and Cobb, L.: Spectral and morphing ensemble Kalman filters, 91st\nAmerican Meterological Society Annual Meeting, Seattle, WA, January 2011, http://ams.confex.\ncom/ams/91Annual/webprogram/Paper185877.html, 2011.\nMazzoleni, S. and Giannino, F.: Tiger – 2D Fire Propagation Simulator Model, http://fireintuition.\nefi.int/products/tiger---2d-fire-propagation-simulator-model.fire, visited December 2010, 2010.\nMell, W., Jenkins, M. A., Gould, J., and Cheney, P.: A physics-based approach to modelling grassland fires, Intl. J. Wildland Fire, 16, 1–22, doi:10.1071/WF06002, 2007.\nMichalakes, J.: RSL: A parallel runtime system library for regional atmospheric models with nesting, in: Structured Adaptive Mesh Refinement (SAMR) Grid Methods, edited by Baden, S. B.,\nChrisochoides, N. P., Gannon, D. B., and Norman, M. L., pp. 59–74, Springer, 2000.\nMorvan, D. and Dupuy, J. L.: Modeling the propagation of a wildfire through a Mediterranean shrub\nusing a multiphase formulation, Combust. Flame, 138, 199–210, doi:10.1016/j.combustflame.\n2004.05.001, 2004.\nOsher, S. and Fedkiw, R.: Level Set Methods and Dynamic Implicit Surfaces, Springer, New York,\n2003.\nPatton, E. G. and Coen, J. L.: WRF-Fire: A Coupled Atmosphere-Fire Module for WRF, in:\nPreprints of Joint MM5/Weather Research and Forecasting Model Users' Workshop, Boulder, CO, June 22–25, pp. 221–223, NCAR, http://www.mmm.ucar.edu/mm5/workshop/ws04/\nSession9/Patton Edward.pdf, 2004.\n\n26\n\n\fRothermel, R. C.: A Mathematical Model for Predicting Fire Spread in Wildland Fires, USDA\nForest Service Research Paper INT-115, http://www.treesearch.fs.fed.us/pubs/32533, 1972.\nScott, J. H. and Burgan, R. E.: Standard Fire Behavior Fuel Models: A Comprehensive Set For Use\nwith Rothermel's Surface Fire Spread Model, Gen. Tech. Rep. RMRS-GTR-153. Fort Collins,\nCO: U.S. Department of Agriculture, Forest Service, Rocky Mountain Research Station, http:\n//www.fs.fed.us/rm/pubs/rmrs gtr153.html, 2005.\nSkamarock, W. C., Klemp, J. B., Dudhia, J., Gill, D. O., Barker, D. M., Duda, M. G., Huang, X.-Y.,\nWang, W., and Powers, J. G.: A Description of the Advanced Research WRF Version 3, NCAR\nTechnical Note 475, http://www.mmm.ucar.edu/wrf/users/docs/arw v3.pdf, 2008.\nSullivan, A. L.: A review of wildland fire spread modelling, 1990-present, 1: Physical and quasiphysical models, 2: Empirical and quasi-empirical models, 3: Mathematical analogues and simulation models, International Journal of WildLand Fire, 18, 1: 347–368, 2: 369–386, 3: 387–403,\ndoi:10.1071/WF06143,10.1071/WF06142,10.1071/WF06144, 2009.\nSun, R., Krueger, S. K., Jenkins, M. A., Zulauf, M. A., and Charney, J. J.: The importance of fireatmosphere coupling and boundary-layer turbulence to wildfire spread, International Journal of\nWildland Fire, 18, 50–60, doi:10.1071/WF07072, 2009.\nWang, W., Bruyère, C., Duda, M., Dudhia, J., Gill, D., Lin, H.-C., Michalakes, J., Rizvi, S., Zhang,\nX., Beezley, J. D., Coen, J. L., and Mandel, J.: ARW Version 3 Modeling System User's Guide,\nMesoscale & Miscroscale Meteorology Division, National Center for Atmospheric Research,\nhttp://www.mmm.ucar.edu/wrf/users/docs/user guide V3/ARWUsersGuideV3.pdf, 2010.\nWRF Working Group 2: WRF Coding Conventions, http://www.mmm.ucar.edu/wrf/WG2/WRF\nconventions.html, visited April 2007, 2007.\n\n27\n\n\fTable 1. Fuel properties. The notation is from Rothermel (1972) except as indicated. The identifiers\nare as used in WRF-Fire and CAWFE. In the input files, some quantities are given in English units\nper Rothermel (1972); see Wang et al. (2010, p. A-5).\nsymbol\n\ndescription\n\nidentifier\n\na\n\nwind adjustment factor (Baughman and Albini, 1980)\nfrom 6.1 m to midflame length\nfuel weight (i.e., burn time) (s)\n40% decrease of fuel in 10 min for w = 1000\ntotal fuel load (kg m−2 )\nfuel depth (m)\nfuel particle surface-area-to-volume ratio (1/m)\nmoisture content of extinction (1)\novendry fuel particle density (kg m−3 )\nfuel particle total mineral content (1)\nfuel particle effective mineral content (1)\nfuel heat contents of dry fuel (J kg−1 )\nfuel particle moisture content (1)\n\nwindrf\n\nw\nw`\nδm\nσ\nMx\nρP\nST\nSE\nh\nMf\n\n28\n\nweight\nfgi\nfueldepthm\nsavr\nfuelmce\nfueldens\nst\nse\ncmbcnst\nfuelmc g\n\n\fTable 2. Computation of the fire spread rate factors in (1) from the fuel properties (Table 1), the wind speed U at 6.1 m,\nand the terrain slope tanφ. All equations are from Rothermel (1972) unless otherwise indicated. All input quantities are\nfirst converted from metric to English units (BTU-lb-ft-min) to avoid changing the numerous constants in the Rothermel\n(1972) computations. Further, following CAWFE, the wind is limited to between 0 and 30 m s−1 and the slope is limited to\nnonnegative values.\nequation\n\ndescription\n\nsource\n\nRξ\nR0 = ρbIεQ\nig\n\nspread rate without wind\n\nEq. (52)\n\npropagating flux ratio\n\nEq. (42)\n\nIR = Γwn hηM ηs\n\nreaction intensity\n\nEq. (52)\n\nηs = 0.174Se−0.19\n\nmineral damping coefficient\n\nEq. (30)\n\nmoisture damping coefficient\n\nEq. (29)\n\nfuel loading net of minerals\n\nEq. (24)\n\ntotal fuel load net of moisture\n\nfrom CAWFE\n\noptimum reaction velocity\n\nEq. (36)\n\nξ=\n\nexp[(0.792+0.681σ 0.5 )(β+0.1) ]\n192+0.2595σ\n\nM\n\nηM = 1 − 2.59 Mfx + 5.11\n\n\u0010\n\nMf\nMx\n\n\u00112\n\n− 3.52\n\n\u0010\n\nMf\nMx\n\n\u00113\n\nw0\nwn = 1+S\nT\nw`\nw0 = 1+M\nf\n\nΓ = Γmax\nΓmax =\n\n\u0010\n\nβ\nβop\n\n\u0011A\n\nh \u0010\n\u0011i\nexp A 1 − ββop\n\nσ 1.5\n495+0.594σ 1.5\n\nβ = ρρPb\nρb = wδ0\n\nmaximum reaction velocity,\n\nEq. (36)\n\npacking ratio\n\nEq. (31)\n\noven dry bulk density\n\nEq. (40)\n\n1\n\nA = 4.77σ0.1 −7.27\n\u0001\nε = exp − 138\nσ\n\nEq. (39)\n\nQig = 250β + 1116Mf\n\u0010 \u0011E\nφW = C maxUaβ ββop\nC = 7.47exp −0.133σ 0.55\n\neffective heating number\n\nEq. (14)\n\nheat of preignition\n\nEq. (12)\n\nwind factor\n\nEq. (47)\n\n\u0001\n\nEq. (48)\n\nUa = aU\nE = 0.715exp −3.59 × 10−4 σ\n\nadjustment to midflame height\n\u0001\n\nTable 1 here\nEq. (50)\n\nφS = 5.275β −0.3 tan2 φ\n\nslope factor\n\n29\n\nEq. (511q)\n\n\fFig. 1. One 2×2 tile with the lowest layer of the atmospheric grid and the fire subgrid on the surface\nshown. Wind vector components u, v, w are located at the midpoints of the sides of the atmospheric\ngrid cells. Some faces are colored for perspective.\n\n30\n\n\fFig. 2. Division of fire mesh cells into subcells for fuel fraction computation. The level-set function\nψ and the ignition time ti are given at the centers a1 ,...,a4 of the cells of the fire grid. The integral (16) over the cell C with the center a3 is computed as the sum of integrals over the subcells\nC1 ,...,C4 . While the values of ψ and ti are known at a3 = x3 , they need to be interpolated to the\nremaining corners x1 , x2 , x4 of the subcell C1 from their values at the points a1 ,...,a4 .\n\n31\n\n\fFig. 3. Parallel communication in WRF. The computational domain is divided into disjoint rectangular patches. Each patch is updated by a single MPI process (distributed memory parallelism), and\nthe process may read arary data in a strip around the patch, called halo region. The communication\nbetween the patches is by halo calls to the RSL parallel infrastructure (Michalakes, 2000), which\nupdate the halo regions by the values from the neighboring patches. Each patch may be divided into\ntiles, which execute in separate OpenMP threads (shared memory parallelism). Following WRF\ncoding conventions (WRF Working Group 2, 2007), computational kernels execute in a single tile.\nThey may read array values from a strip beyond the tile boundary but no explicit communication is\nallowed. 3-D arrays are divided into patches and tiles in the horizontal plane, cf., Fig. 1.\n\n32\n\n\fFig. 4. Parallel structure of the fire module in the WRF physics layer. The core code itself executes\non a single tile, with all communication done outside. Multiple passes through the fire module are\nneeded in each time step.\n\n33\n\n\fFig. 5. Software layers of WRF-Fire. All physics dependencies are in the dashed box. The utilities\nlayer is called from all the other layers above.\n\n34\n\n\fFig. 6. Simulation of the FireFlux experiment (Clements et al., 2007) by WRF-Fire. Left: map of\nlanduse category for the experimental plot, with the ignition line and the observation towers marked.\nRight: simulated and measured temperature profiles at the location of the observation towers. The\nsimulated fire propagation takes 243 s from tower MT to tower ST, while the measured time is 255 s\n(4.7% difference). From Kochanski et al. (2010).\n\n35\n\n\fFig. 7. Simulation of the FireFlux experiment (Clements et al., 2007) by WRF-Fire. Left: surface\nheat flux and selected flowlines. Visualization in VAPOR by Bedřich Sousedı́k. Surface image from\nGoogle Earth. Right: vertical velocity at 2 m height at tower ST. (See Fig. 6 left for location.) The\nsimulation shows a good agreement with the experiment. From Kochanski et al. (2010).\n\n36\n\n\fFig. 8. X-Y section of wind vector at 18 m and pressure perturbation 240 s after line ignition,\ninitialized with uniform wind profile. The fire develops two fingers due to wind direction inversion\nin the middle. From Jenkins et al. (2010).\n\n37\n\n\fFig. 9. X-Z section of wind vector and pressure perturbation at the centerline for the fire in Fig. 8.\nFrom Jenkins et al. (2010).\n\n38\n\n\fFig. 10. Topography of the finest domain of the Meadow Creek fire simulation. From Beezley et al.\n(2010).\n\n39\n\n\fFig. 11. The finest domain in the Meadow Creek fire simulation 5 h after ignition. Unburned fuel\nis displayed as green, burned fuel as brown. The heat flux from the fire appears near the fire line.\nArrows indicate the surface winds, while streamlines show the atmospheric winds flowing over the\nfire region. Visualization in MayaVi. From Beezley et al. (2010).\n\n40\n\n\fFig. 12. The top level domain in the Meadow Creek fire simulation 5 h after ignition. Streamlines\nshow the winds blowing East, over the Rocky Mountains and South down the coast of California.\nVisualization in MayaVi. From Beezley et al. (2010).\n\n41\n\n\f"}