{"id": "http://arxiv.org/abs/0911.3812v1", "guidislink": true, "updated": "2009-11-19T14:44:01Z", "updated_parsed": [2009, 11, 19, 14, 44, 1, 3, 323, 0], "published": "2009-11-19T14:44:01Z", "published_parsed": [2009, 11, 19, 14, 44, 1, 3, 323, 0], "title": "Reply to \"Comment on 'Piezonuclear decay of thorium' [Phys. Lett. A 373\n  (2009) 1956]\" by L. Kowalski", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0911.2494%2C0911.5086%2C0911.2824%2C0911.3929%2C0911.0167%2C0911.1890%2C0911.0479%2C0911.5420%2C0911.1758%2C0911.2262%2C0911.1525%2C0911.1617%2C0911.3847%2C0911.4729%2C0911.2727%2C0911.0555%2C0911.3790%2C0911.4254%2C0911.4806%2C0911.0976%2C0911.2713%2C0911.0247%2C0911.1091%2C0911.5703%2C0911.5488%2C0911.3582%2C0911.4548%2C0911.3154%2C0911.0561%2C0911.3360%2C0911.4740%2C0911.4637%2C0911.0975%2C0911.1561%2C0911.1785%2C0911.2438%2C0911.1241%2C0911.2728%2C0911.2080%2C0911.3091%2C0911.1164%2C0911.2063%2C0911.4855%2C0911.2498%2C0911.3298%2C0911.3812%2C0911.4046%2C0911.2771%2C0911.4937%2C0911.1026%2C0911.0136%2C0911.5316%2C0911.2474%2C0911.4947%2C0911.3910%2C0911.2099%2C0911.2866%2C0911.5724%2C0911.2095%2C0911.4488%2C0911.2349%2C0911.1727%2C0911.1529%2C0911.3327%2C0911.4706%2C0911.1731%2C0911.2689%2C0911.4979%2C0911.4613%2C0911.4725%2C0911.5029%2C0911.0756%2C0911.1558%2C0911.4136%2C0911.4973%2C0911.4703%2C0911.3963%2C0911.4066%2C0911.0513%2C0911.0729%2C0911.1775%2C0911.0284%2C0911.2231%2C0911.3588%2C0911.0197%2C0911.0744%2C0911.3639%2C0911.2967%2C0911.4106%2C0911.3125%2C0911.5214%2C0911.2706%2C0911.0644%2C0911.3610%2C0911.2442%2C0911.4178%2C0911.2101%2C0911.0941%2C0911.1997%2C0911.0883%2C0911.1234&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Reply to \"Comment on 'Piezonuclear decay of thorium' [Phys. Lett. A 373\n  (2009) 1956]\" by L. Kowalski"}, "summary": "In a paper appearing in this issue of Physics Letters A, Kowalski raises some\ncritical comments on the experiment [F. Cardone, R. Mignani, A. Petrucci, Phys.\nLett. A 373 (2009) 1956] that we carried out by cavitating a solution of\nthorium-228. The experiment highlighted the anomalous decay of thorium, thus\nconfirming the results previously obtained by Urutskoev et al. by explosion of\ntitanium foils in solutions. In this Letter, we reply to these comments. We\nagree with Kowalski that critical comments are one of the key factors of the\nprocess to improve the quality of experiments and the interpretation of\nresults. However we do hope that these comments together with the details\nprovided in the replies will promote further and better experiments which are\ncertainly worth performing in order to shed a brighter light on this issue, as\nKowalski himself suggests in his comment.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0911.2494%2C0911.5086%2C0911.2824%2C0911.3929%2C0911.0167%2C0911.1890%2C0911.0479%2C0911.5420%2C0911.1758%2C0911.2262%2C0911.1525%2C0911.1617%2C0911.3847%2C0911.4729%2C0911.2727%2C0911.0555%2C0911.3790%2C0911.4254%2C0911.4806%2C0911.0976%2C0911.2713%2C0911.0247%2C0911.1091%2C0911.5703%2C0911.5488%2C0911.3582%2C0911.4548%2C0911.3154%2C0911.0561%2C0911.3360%2C0911.4740%2C0911.4637%2C0911.0975%2C0911.1561%2C0911.1785%2C0911.2438%2C0911.1241%2C0911.2728%2C0911.2080%2C0911.3091%2C0911.1164%2C0911.2063%2C0911.4855%2C0911.2498%2C0911.3298%2C0911.3812%2C0911.4046%2C0911.2771%2C0911.4937%2C0911.1026%2C0911.0136%2C0911.5316%2C0911.2474%2C0911.4947%2C0911.3910%2C0911.2099%2C0911.2866%2C0911.5724%2C0911.2095%2C0911.4488%2C0911.2349%2C0911.1727%2C0911.1529%2C0911.3327%2C0911.4706%2C0911.1731%2C0911.2689%2C0911.4979%2C0911.4613%2C0911.4725%2C0911.5029%2C0911.0756%2C0911.1558%2C0911.4136%2C0911.4973%2C0911.4703%2C0911.3963%2C0911.4066%2C0911.0513%2C0911.0729%2C0911.1775%2C0911.0284%2C0911.2231%2C0911.3588%2C0911.0197%2C0911.0744%2C0911.3639%2C0911.2967%2C0911.4106%2C0911.3125%2C0911.5214%2C0911.2706%2C0911.0644%2C0911.3610%2C0911.2442%2C0911.4178%2C0911.2101%2C0911.0941%2C0911.1997%2C0911.0883%2C0911.1234&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "In a paper appearing in this issue of Physics Letters A, Kowalski raises some\ncritical comments on the experiment [F. Cardone, R. Mignani, A. Petrucci, Phys.\nLett. A 373 (2009) 1956] that we carried out by cavitating a solution of\nthorium-228. The experiment highlighted the anomalous decay of thorium, thus\nconfirming the results previously obtained by Urutskoev et al. by explosion of\ntitanium foils in solutions. In this Letter, we reply to these comments. We\nagree with Kowalski that critical comments are one of the key factors of the\nprocess to improve the quality of experiments and the interpretation of\nresults. However we do hope that these comments together with the details\nprovided in the replies will promote further and better experiments which are\ncertainly worth performing in order to shed a brighter light on this issue, as\nKowalski himself suggests in his comment."}, "authors": ["F. Cardone", "R. Mignani", "A. Petrucci"], "author_detail": {"name": "A. Petrucci"}, "author": "A. Petrucci", "arxiv_comment": "Submitted to Physics Letters A", "links": [{"href": "http://arxiv.org/abs/0911.3812v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0911.3812v1", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "physics.gen-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "physics.gen-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0911.3812v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0911.3812v1", "journal_reference": null, "doi": null, "fulltext": "arXiv:0911.3812v1 [physics.gen-ph] 19 Nov 2009\n\nReply to \"Comment on 'Piezonuclear decay of thorium'\n[Phys. Lett. A 373 (2009) 1956]\" by L. Kowalski\nFabio Cardone 1 , Roberto Mignani\n\n2,3,∗\n\n, Andrea Petrucci\n\n1\n\n1\n\nIstituto per lo Studio dei Materiali Nanostrutturati (ISMN CNR)\nVia dei Taurini - 00185 Roma, Italy\n2\nDipartimento di Fisica E.Amaldi, Università degli Studi Roma Tre\nVia della Vasca Navale, 84 - 00146 Roma, Italy\n3\nINFN Sezione di Roma Tre, Italy\n* Corresponding author: mignani@fis.uniroma3.it\nAbstract\nIn a paper appearing in this issue of Physics Letters A, Kowalski raises some critical\ncomments on the experiment [F. Cardone, R. Mignani, A. Petrucci, Phys. Lett. A 373\n(2009) 1956] that we carried out by cavitating a solution of thorium-228. The experiment\nhighlighted the anomalous decay of thorium, thus confirming the results previously obtained by Urutskoev et al. by explosion of titanium foils in solutions. In this Letter, we\nreply to these comments. We agree with Kowalski that critical comments are one of the\nkey factors of the process to improve the quality of experiments and the interpretation\nof results. However we do hope that these comments together with the details provided\nin the replies will promote further and better experiments which are certainly worth performing in order to shed a brighter light on this issue, as Kowalski himself suggests in his\ncomment.\n\n1\n\nReply to comments\n\nIn the article 'Comments on \"Piezonuclear decay of thorium\" appeared on this same issue\nof Physics Letters A [1] Kowalski puts forward some remarks and suggestions about our\nwork on the possible effects of cavitation on Thorium-228 [2]. The author highlights\nwhat he thinks are the possible shortcomings of the paper [2] and gives us the chance\nto provide some more clarifications. We will follow his manuscript and try to give an\n\n1\n\n\fanswer or more details as we encounter his remarks. However, first of all we want to\ncomplain about the fact that, after reading a few times the text of the comment, it looks\nlike that the author completely ignored our reply [3] to the comment by Ericsson et al.\n[4] where he would have found out more information and suggestions that would have\nhelped him in interpreting the results in a more comprehensive way. In the introduction\nthe author mentions the fact that Marie Curie and her contemporaries tried to speed up\nalpha emission by different types of effects without achieving any success. The purpose\nof the experiments that we have conducted so far with ultrasounds, cavitation and shockwaves [5, 6, 7, 8, 9] has never been devoted to speed up alpha emission, although the\nexperiment with Thorium might seem to be aimed at this target. It has turned out that\ncavitation is able to generate locally very peculiar conditions of pressure, temperature\nand energy density that bring about new phenomena like, for instance, sonoluminescence\nand other anomalous effects which seem to involve atomic species at their nuclear level\n[10]. Although some researchers frown at these phenomena due to, they say, the lack of\nconvincing proofs, we think that they are worth of being studied as they are likely to be\nthe tip of the iceberg of a completely new physics. The decision of subjecting to cavitation\na solution of Thorium was based on three experimental evidences: the anomalous transmutations that we detected in solutions subjected to cavitation [7, 8, 9], the emission\nof bursts of neutrons detected from iron solutions treated by cavitation [5, 6] and the\nevidences achieved by Russian teams [11, 12] of the modified secular equilibrium of Thorium in solutions subjected to electric explosions of Titanium thin wires. Our target, in\ncarrying out these experiments with Thorium, was only to check whether cavitation, that\nbrings about anomalous transmutations and emission of neutrons from solution of stable\nelements, might affect Thorium as well and produce effects similar to those induced by\nelectric explosions of the Russian teams. Moreover, we would like to add that according\nto some predictions of our theory [13, 14] all of these anomalous effects (anomalous transmutations, emission of neutrons from Iron, and all of the evidences collected in 20 years\nof low energy nuclear reactions [10]) need very precise local condition to take place, in\nterms of energy density and time of release of this energy, which are not easy at all to be\nsimultaneously achieved. From this perspective, the attempts to speed up alpha emission\ncarried out between the end of the XIX and the beginning of the XX century were very\nunlikely to be systematically successful because of the difficulty to make out these effects\namong other more evident phenomena. The first and main remark of Kowalski is about\nthe reduction of the concentration of Thorium and the chance that this reduction might be\ndue to a redistribution of the atoms of Thorium rather than its transmutation. In particular he suggests that \"Cavitation generates reactive chemical species like ozone or hydrogen\nperoxide. This leads to progressive accumulation of thorium on available surfaces, such\nas inner walls of the glass container, or the cavitator. If this were to happen then the\nsolution removed from the vessel, after the treatment, would indeed be less concentrated\nthan the solution before the treatment\".\nThe hypothesis that the Thorium was deposited on the walls on the vessel is legitimate\n\n2\n\n\fand indeed we thought of it. However, the convective motions of the liquid in the vessel\ninduced by ultrasounds formed a continuous flow all along the walls and the surface\nof the sonotrode that prevented the atomic species from being adsorbed on them1 .This\nconsideration, supported by the evidences of these convective flows, convinced us that the\nhypothesis of adsorption could be put off to future and more accurate investigations. The\nauthor complains about the lack of information on the etching procedure of CR39. They\nwere etched by a solution of NaOH 6.5N at a temperature of 90 degrees centigrade for 4.5\nhours. In replying to this request we refer, as well, to the last statement of the author\nthat complains about the sentence in our manuscript [2] in which we talked about CR39\nand alpha particles and said \"a polycarbonate whose energy calibration is just designed\nto detect those emitted by Radon-222\". This sentence, which is indeed too short, and\nhence generated the remark, has to be interpreted by referring the calibration not to the\nCR39, but to the etching procedure which was suggested by the manufacturer in order\nto obtain tracks comparable to those on the CR39 chips provided as calibration reference\nand irradiated by Radon-222. In a further remark, the author complains about the lack of\ninformation on the measured track densities. We inspected the CR39 chips by an optical\nmicroscope, but concentrated on the \"star-shaped\" tracks only in order to establish that\ntheir shape and features were all compatible on the different chips. The decision to pay\nattention only to the \"star-shaped\" tracks finds its reason in the details provided in order\nto answer another remark of Kowalski. This remark is about these \"star-shaped\" tracks\non the CR39 which are brought about by 5 alpha particles emitted during the decay chain\nof Thorium-228 down to Lead-208.\nKowalski says that in a agitated liquid containing Thorium, unlike in a solid, the\ntracks on the CR39 are not likely to be \"star-shaped\" because, due to the shaking of\nthe solution, a nucleus of Thorium would be separated from its daughter nuclides and\nhence the emitted five alpha particles from Thorium-228 and its daughters down to the\nstable Lead-208 would not hit the CR39 on the same spot. This remark refers to an issue\nwhich was considered at length before defining the most suitable procedure to detect\nunmistakably by CR39 the tracks of Thorium. We knew that on the CR39 surface, after\netching, there would be both tracks due to alpha particles of the natural background\nradioactivity and the tracks due to the alpha particles of Thorium. Although 0.03 ppb of\nThorium in 250 ml of deionised bidistilled water mean an activity of about 10−6 Ci which\nis 3 to 5 orders of magnitude higher than the natural radioactivity of water, one has to\nconsider that the range of alpha particle of 5 MeV in water is about 40 microns. This\ncircumstance radically reduces the volume of the solution that surrounds the upper free\nside of the CR392 and hence reduces the number of Thorium atoms which can produce\ntracks. All considered and estimated, we understood that, had we based our comparisons\n1\n\nIn our previous works [5, 6] we specified that the vessel was suitably chosen to be a true reaction chamber\nthat would contribute to the generate the cavitation in its central part between the sonotrode tip and the\nbottom of the chamber and would contribute to produce convective motions along the lateral walls and the\nbottom. Vessels of different shape and dimension were tested and examined for the purpose.\n2\nWe remind that the CR39 chip was inside the vessel, laid horizontally on its bottom and aligned with the\n\n3\n\n\famong the differently treated CR39 chips on the density of tracks, it might have been\nhard to achieve a sufficiently clear picture.\nThus we decided to base our measurement on the number of the unmistakable starshaped tracks and hence designed a measurement protocol that allowed the formation of\nthese peculiar tracks. We will briefly illustrate this protocol here. Let's focus our attention\non the CR39 chip in the vessel with non cavitated solution and on the CR39 chip in the\nvessel with cavitated solution. The two vessels were prepared at the same time and as\nsoon as they were ready we began the cavitation of one of them. The cavitation lasted 90\nminutes and the two vessels were kept in two separate rooms. In the non cavitated vessel\nthe solution was, of course, still for 90 minutes. At the end these 90 minutes we turned off\nthe ultrasounds and took out the CR39 chip from the non cavitated solution being careful\nto leave a layer of solution on the upper side of it. We let this layer evaporate. As to the\nCR39 chip in the cavitated solution, we did not take it out at the end of the 90 minutes\nbut waited for further 90 minutes since we wanted the solution to cool and be still as it\nhad been still the non cavitated one in order to let the heavy Thorium atoms to deposit\nas it must have happened in the other solution. After these further 90 minutes we took\nout the CR39 chip from the solution as we had done for the non cavitated sample and\nlet the layer evaporate. As the liquid evaporated, some atoms of Thorium deposited on\nthe upper surface of the CR39 and together with its daughter nuclides produced on the\nsame spot the \"star-shaped\" tracks. The last remarks of Kowalski is about the activity\nof the solutions that we used and the lack of information about the special equipment for\nhandling highly radioactive liquid sources. He estimated that the activity of our solutions\nwas 1 Ci per litre. This is a huge activity indeed, but certainly not the activity of our\nsolutions which was between 10−5 and 10−6 Ci for 250 ml (calculated and measured). We\nwould like to point out that this value of activity is compatible with that of the radioactive\nsources which do not require the Nuclear Regulatory Commission (NRC) licence to be\nhandled and can be sold to the general public. We reckon that the author must have\nmisinterpreted the concentration of Thorium which is 0.03 ppb (part per billion) that is\n0.03 micro grams of Thorium in 1 litre of solution. As to the precautions adopted to\nwork with these solutions, we certainly complied with all the security measures, but we\nreckon that this information is of no use in a scientific letter. Nevertheless, we report\nhere that these experiments were conducted in collaboration with the Italian Army at the\nNuclear-Chemical-Bacteriological facilities. We planned and supervised the experiments\nand interpreted its results, but most of the operations were carried out by authorised and\ntrained personnel in a hot cells.\nsonotrode tip.\n\n4\n\n\f2\n\nConclusions\n\nWe certainly agree with the author that critical comments contribute to improve the\nquality of further experiments and their interpretations. However, together with him\nwe reckon that \"they are no substitute for additional experiments\". Even if he were\nconvinced by the arguments that we presented in [2] and by the convergence of our\nresults [2] with those obtained by Russian teams [11, 12], further and better experiments\nmust be performed. We do hope that these comments and replies with additional details\nwill encourage other research teams to experiment and not just comment on this issue in\norder to obtain further indications either in agreement or in disproof.\n\nReferences\n[1] L. Kowalski, Phys. Lett. A (this issue).\n[2] F. Cardone, R. Mignani, A. Petrucci, Phys. Lett. A 373 (2009) 1956-1958.\n[3] F. Cardone, R. Mignani, A. Petrucci, Phys. Lett. A 373 (2009) 3797-3800.\n[4] G. Ericsson, S. Pomp, H. Sjstrand, E. Traneus, Phys. Lett. A 373 (2009) 3795-3796.\n[5] F. Cardone, G. Cherubini, A. Petrucci, Phys. Lett. A 373 (2009) 862\n[6] F. Cardone , G. Cherubini, R. Mignani, W. Perconti, A. Petrucci, F. Rosetto, G.\nSpera, Ann. Fond. L. de Broglie, (in press), arXiv:0710.5115.\n[7] F. Cardone, R. Mignani, Int. J. Mod. Phys. B 17, 307 (2003).\n[8] F. Cardone, R. Mignani, W. Perconti, E. Pessa, G. Spera, Jour. Radioanalytical\nNucl. Chem. 265, 151 (2005).\n[9] F. Cardone, R. Mignani, W. Perconti, E. Pessa, G. Spera, Gravitation and Cosmology\n11, 1-2 (41-42) (2005).\n[10] E. Storms, The Science of Low Energy Nuclear Reaction - A Comprehensive Compilation of Evidence and Explanations about Cold Fusion. World Scientific, Singapore\n(2007).\n[11] L.I. Urutskoev, V.I. Liksonov, V.G. Tsinoev, Ann. Fond. L. de Broglie 27, 701 (2002).\n[12] A.G. Volkovish, A.P. Govorum, A.A. Gulyaev, S.V. Zhukov, V.L. Kuznetsov, A.A.\nRukhadze, A.V. Steblevskii, L.L. Urutskoev, Ann. Fond. L. de Broglie, 30, 1, (2005).\n[13] F. Cardone, R. Mignani, Energy and Geometry, World Scientific, Singapore, (2004).\n[14] F. Cardone, R. Mignani, Deformed Spacetime, Springer, Heidelberg-Dordrecht,\n(2007).\n\n5\n\n\f"}