{"id": "http://arxiv.org/abs/0802.4416v2", "guidislink": true, "updated": "2008-11-06T12:56:09Z", "updated_parsed": [2008, 11, 6, 12, 56, 9, 3, 311, 0], "published": "2008-02-29T15:52:47Z", "published_parsed": [2008, 2, 29, 15, 52, 47, 4, 60, 0], "title": "Unparticles and inflation", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0802.3151%2C0802.1822%2C0802.3665%2C0802.2451%2C0802.2777%2C0802.1020%2C0802.0664%2C0802.3879%2C0802.1624%2C0802.0508%2C0802.2879%2C0802.1944%2C0802.2123%2C0802.1879%2C0802.0745%2C0802.3137%2C0802.1565%2C0802.3239%2C0802.3946%2C0802.4234%2C0802.2564%2C0802.0324%2C0802.1161%2C0802.0997%2C0802.1359%2C0802.1713%2C0802.3405%2C0802.2764%2C0802.2224%2C0802.3744%2C0802.2426%2C0802.3202%2C0802.3163%2C0802.1802%2C0802.2400%2C0802.0243%2C0802.1808%2C0802.1449%2C0802.2516%2C0802.0626%2C0802.3790%2C0802.3074%2C0802.1892%2C0802.3067%2C0802.0542%2C0802.3446%2C0802.1847%2C0802.2072%2C0802.3448%2C0802.1504%2C0802.0822%2C0802.4372%2C0802.4075%2C0802.3357%2C0802.0035%2C0802.1223%2C0802.3502%2C0802.3734%2C0802.3377%2C0802.0221%2C0802.0602%2C0802.3205%2C0802.4287%2C0802.1533%2C0802.3932%2C0802.2626%2C0802.3291%2C0802.3942%2C0802.4166%2C0802.0414%2C0802.1189%2C0802.4036%2C0802.4457%2C0802.4000%2C0802.0283%2C0802.0335%2C0802.0973%2C0802.4087%2C0802.0339%2C0802.0704%2C0802.0362%2C0802.2371%2C0802.3519%2C0802.0360%2C0802.4107%2C0802.2584%2C0802.2547%2C0802.1310%2C0802.3094%2C0802.0015%2C0802.0782%2C0802.1402%2C0802.0923%2C0802.2291%2C0802.2772%2C0802.2193%2C0802.3164%2C0802.0310%2C0802.3410%2C0802.4416%2C0802.4233&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Unparticles and inflation"}, "summary": "We study some of the roles for unparticles in an inflationary universe.\nUnparticles by themselves are not appropriate for generating the primordial\nperturbations since their power spectrum does not match what has been inferred\nfrom observations. In fact, when the scaling dimension for the unparticles\nexceeds three-halves, the unparticle power spectrum diverges. However, when a\nunparticle couples to an ordinary inflaton particle, loop corrections can\nproduce a slight enhancement of the inflaton's power spectrum at longer\nwavelengths. We examine these loop corrections from unparticles in some detail\nto learn how they scale in the wavelength of a perturbation and how they depend\non the scaling dimension of the field.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0802.3151%2C0802.1822%2C0802.3665%2C0802.2451%2C0802.2777%2C0802.1020%2C0802.0664%2C0802.3879%2C0802.1624%2C0802.0508%2C0802.2879%2C0802.1944%2C0802.2123%2C0802.1879%2C0802.0745%2C0802.3137%2C0802.1565%2C0802.3239%2C0802.3946%2C0802.4234%2C0802.2564%2C0802.0324%2C0802.1161%2C0802.0997%2C0802.1359%2C0802.1713%2C0802.3405%2C0802.2764%2C0802.2224%2C0802.3744%2C0802.2426%2C0802.3202%2C0802.3163%2C0802.1802%2C0802.2400%2C0802.0243%2C0802.1808%2C0802.1449%2C0802.2516%2C0802.0626%2C0802.3790%2C0802.3074%2C0802.1892%2C0802.3067%2C0802.0542%2C0802.3446%2C0802.1847%2C0802.2072%2C0802.3448%2C0802.1504%2C0802.0822%2C0802.4372%2C0802.4075%2C0802.3357%2C0802.0035%2C0802.1223%2C0802.3502%2C0802.3734%2C0802.3377%2C0802.0221%2C0802.0602%2C0802.3205%2C0802.4287%2C0802.1533%2C0802.3932%2C0802.2626%2C0802.3291%2C0802.3942%2C0802.4166%2C0802.0414%2C0802.1189%2C0802.4036%2C0802.4457%2C0802.4000%2C0802.0283%2C0802.0335%2C0802.0973%2C0802.4087%2C0802.0339%2C0802.0704%2C0802.0362%2C0802.2371%2C0802.3519%2C0802.0360%2C0802.4107%2C0802.2584%2C0802.2547%2C0802.1310%2C0802.3094%2C0802.0015%2C0802.0782%2C0802.1402%2C0802.0923%2C0802.2291%2C0802.2772%2C0802.2193%2C0802.3164%2C0802.0310%2C0802.3410%2C0802.4416%2C0802.4233&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We study some of the roles for unparticles in an inflationary universe.\nUnparticles by themselves are not appropriate for generating the primordial\nperturbations since their power spectrum does not match what has been inferred\nfrom observations. In fact, when the scaling dimension for the unparticles\nexceeds three-halves, the unparticle power spectrum diverges. However, when a\nunparticle couples to an ordinary inflaton particle, loop corrections can\nproduce a slight enhancement of the inflaton's power spectrum at longer\nwavelengths. We examine these loop corrections from unparticles in some detail\nto learn how they scale in the wavelength of a perturbation and how they depend\non the scaling dimension of the field."}, "authors": ["Hael Collins", "R. Holman"], "author_detail": {"name": "R. Holman"}, "author": "R. Holman", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1103/PhysRevD.78.025023", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/0802.4416v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0802.4416v2", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "10 pages, 3 eps figures, uses ReVTeX; replaced with published version", "arxiv_primary_category": {"term": "hep-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "hep-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0802.4416v2", "affiliation": "Carnegie Mellon University", "arxiv_url": "http://arxiv.org/abs/0802.4416v2", "journal_reference": "Phys.Rev.D78:025023,2008", "doi": "10.1103/PhysRevD.78.025023", "fulltext": "Unparticles and inflation\nHael Collins∗\nThe Niels Bohr International Academy, The Niels Bohr Institute, 2100 Copenhagen Ø, Denmark\n\nR. Holman†\n\narXiv:0802.4416v2 [hep-ph] 6 Nov 2008\n\nDepartment of Physics, Carnegie Mellon University, Pittsburgh, Pennsylvania 15213\n(Dated: November 30, 2018)\nWe study some of the roles for unparticles in an inflationary universe. Unparticles by themselves are not\nappropriate for generating the primordial perturbations since their power spectrum does not match what has\nbeen inferred from observations. In fact, when the scaling dimension for the unparticles exceeds three-halves,\nthe unparticle power spectrum diverges. However, when a unparticle couples to an ordinary inflaton particle,\nloop corrections can produce a slight enhancement of the inflaton's power spectrum at longer wavelengths. We\nexamine these loop corrections from unparticles in some detail to learn how they scale in the wavelength of a\nperturbation and how they depend on the scaling dimension of the field.\nPACS numbers: 14.80.-j, 11.25.Hf, 98.80.Cq\n\nI.\n\nINTRODUCTION\n\nAs our picture for nature reaches to ever smaller scales, it\nbecomes more difficult to see new phenomena directly. In\nthe early days of bubble chamber experiments, a new particle\ncould leave a distinctive track of its existence. In contrast, in\ncurrent experiments the complexity of the products of a particle collision makes it far more challenging to understand what\nwe are seeing without first viewing it through some sort of theoretical lens. There is a danger that we might be blinded by\nour expectations, that it will be hard to see something entirely\nnew unless we have already, to some measure, anticipated it.\nThis worry is illustrated by the example of unparticles [1].\nUnparticles are scale invariant, or-not quite equivalently-\nconformal, fields that have a nonintegral scaling dimension.\nAs their name suggests, these fields lack many of the properties that normally characterize particle theories. If they exist, they would produce rather different signatures in detectors from those of the more familiar particles that are usually\nconsidered. Fortunately the scale invariance of an unparticle\nallows many of its interactions with ordinary particles to be\ntreated simply and analytically.\nUnparticles could have a role in cosmology too, particularly\nin the early universe [2]. This article looks at some of the ways\nthey could affect the inflationary picture. Most ambitiously,\nthe inflaton-the field that drives the inflationary expansion-\ncould itself be an unparticle. We shall show that the conformal properties of unparticles, however, make them very unsuitable for this purpose. Yet, even if they are not themselves\nresponsible for inflation, unparticles can still produce interesting effects. If they interact with an ordinary particle inflaton, the loop corrections from unparticles can enhance the\npower spectrum of the primordial perturbations produced by\ninflation. This enhancement occurs whenever the scaling dimension of the unparticle field is less than three-halves and it\n\n∗ Electronic\n† Electronic\n\naddress: hael@nbi.dk\naddress: rh4a@andrew.cmu.edu\n\nis most pronounced at the large-wavelength end of the power\nspectrum.\nThis article begins in the next section by explaining how\nunparticles are incorporated into an isotropically expanding\nbackground. Section III shows why they are not especially\ngood inflatons while Sec. IV examines in detail how they\ncould influence the standard inflationary picture through radiative corrections. The final section presents our conclusions\nand we leave a few simple loop calculations in flat space to\nan appendix, which also includes a description of how unparticles might be useful in regularizing conformal particle field\ntheories.\n\nII. PRELIMINARIES\nA. Unparticles in a conformally flat universe\n\nAn unparticle is nothing more than a scale-invariant field\nwith a nontrivial scaling dimension, d. The simplest and most\nfamiliar scalar field with these properties is not an unparticle\nat all, but is rather an ordinary massless particle, corresponding to the case d = 1. Once we go beyond integral values for\nd, however, the fields no longer have many of the properties\nthat we associate with particles. There are no isolated poles\nin the propagator and there is no longer a simple dispersion\nrelation between the energy and the momentum carried by an\nunparticle. Because of its scaling or conformal properties, an\nunparticle in a conformally flat space-time is closely related\nto one in flat space, so we shall first examine this relation in a\nlittle detail for the case of a conformal particle.\nIn a curved background, it is not enough to set the mass\nof a particle to zero to insure that the theory remains scaleinvariant, since the background itself introduces another potential source for breaking it. To restore the scale invariance,\nthe field should be coupled conformally to the background.\nThus, for example, the d = 1 prototypical scale-invariant field\nin a curved background is a massless, conformally coupled\n\n\f2\nfield,\n\nB. A short review of unparticles in flat space\n\nS=\n\nZ\n\ni\n√ h\n1\nRφ 2 .\nd 4 x −g 21 gμν ∂μ φ∂ν φ − 12\n\n(2.1)\n\nAs in flat space, a field of dimension d = 1 is an ordinary\nparticle theory, but other possibilities exist, which are genuine\nunparticles when d > 1.1 Using the conformal invariance of\nthe theory provides a powerful constraint on how to extend\nour description of unparticles into an expanding background.\nLet us consider a massless, conformally coupled particle in\nan isotropically expanding background, expressed in conformally flat coordinates,\n\u0002\n\u0003\nds2 = a2 (η ) d η 2 − d~x * d~x ,\n\n(2.2)\n\nin terms of which the scalar curvature becomes\nR=\n\n6 ∂ 2a\n6a′′\n≡\n.\na3\na3 ∂ η 2\n\nZ\n\ni\nd 3~k h\ni~k*~x\n−i~k*~x †\n∗\n(\nφ\nη\n)e\na\n+\nφ\nη\n)e\na\n(\nk\n~\nk\n~k ,\nk\n(2π )3\n\n(2.4)\n\nthen the action implies that the modes obey the equation,\na′′\na′\nφk′′ + 2 φk + φk + k2 φk = 0.\na\na\n\n(2.5)\n\nSince the field is conformally coupled and the background\nhere is itself conformally flat, we can immediately see that\nthe modes are equivalent to the usual flat-space modes, up to\na factor of the scale factor a(η ) raised to the rescaling dimension, which is in this case just d = 1,\n\nχk (η )\n,\na(η )\n\n(2.6)\n\nχk′′ + k2 χk = 0.\n\n(2.7)\n\nφk (η ) =\nso that\n\nEven though we may no longer have an explicit form for\ntheir action, the same principle applies to the unparticles. If\nwe denote an unparticle in flat space by χ (x) and the unparticle in a conformally flat space by σ (x), then we can again\nwrite the latter as a simple rescaling of the former,\n\nσ (η ,~x) =\n\nχ (η ,~x)\n,\nad (η )\n\ndetermined by its rescaling dimension d.\n\n=\n\nZ\n\nd 4 k −ik*(x−y)\ne\n(2π )4\n\n(2.8)\n\nUnitarity [3], in any event, requires d ≥ 1.\n\n0\n\ndM 2\n\niρ (M 2 )\n.\nk2 − |~k|2 − M 2 + iε\n0\n\nFor an ordinary particle theory,\ncontains at least one\npole at the physical mass of the field. The field is then\nalso renormalized so that the residue at this pole is i, which\namounts to a renormalization condition on the theory. In contrast, for an unparticle theory, we do not have any such conditions available to determine ρ (M 2 ). Instead, we appeal directly to the scale invariance of χ and the fact that its rescaling\ndimension is d to fix ρ (M 2 ) completely, up to a constant factor, Ad ,\n\nρ (M 2 ) =\n\nAd 2 d−2\n(M ) .\n2π\n\n(2.10)\n\nUnlike the particle case, we do not have a renormalization\ncondition to set the normalization, Ad , of the unparticle; but\na frequently used convention [1] is to choose it to match with\nthe phase space for d massless particles,\nAd =\n\nd −1\n2π\n16π 5/2 Γ(d + 21 )\n, (2.11)\n=\n(2π )2d Γ(2d)Γ(d − 1) (16π 2 )d−1 (Γ(d))2\n\nexcept that, of course, here d is not an integer.\nThe integral over M 2 in the propagator converges as long\nas 1 < d < 2; performing this integral then yields a simpler\nexpression for the unparticle propagator,\n\u0001\nh0|T σ (x)σ (y) |0i\n(2.12)\n=\n\nZ\n\ni\nd 4 k −ik*(x−y) Ad (−1)d−2\n.\ne\n(2π )4\n2 sin π d (k02 − |~k|2 + iε )2−d\n\nNotice that in the limit d → 1, the d − 1 factor in Ad cancels\nthe zero in sin π d. The propagator becomes that of a free,\nmassless particle, correctly normalized; so in a sense, massless particles are unparticles too. But we shall usually avoid\nthis limit, since the some of the factors become singular while\nothers vanish.\nIn an inflationary setting, where it might not be appropriate\nto treat the theory using an S-matrix formalism, it is usually\nmore convenient to break the propagator into the two components of its time-ordering. In flat space we have\n\u0001\nh0|T χ (t,~x)χ (t ′ ,~y) |0i\nZ\n\u0003\nd 3~k i~k*(~x−~y) \u0002\n′\n′\n<\n′\nΘ(t − t ′ ) Γ̃>\ne\n=\nk (t,t ) + Θ(t − t) Γ̃k (t,t ) .\n3\n(2π )\n(2.13)\nThe functions\n′\nΓ̃>\nk (t,t ) =\n\n1\n\nZ ∞\n\nρ (M 2 )\n\n(2.3)\n\nIf we expand the field in eigenmodes,\n\nφ (η ,~x) =\n\nIn a Lorentz-invariant theory, the propagator of any scalar\nfield can be expressed in a Lehmann-Källen spectral form,\n\u0001\n(2.9)\nh0|T χ (x)χ (y) |0i\n\nZ\n\n~\n\nd 3~x e−ik*(~x−~y) h0|χ (t,~x)χ (t ′ ,~y)|0i\n\n′\n= Γ̃<\nk (t ,t)\n\n(2.14)\n\n\f3\nare the Wightman functions for the unparticle field in flat\nspace, written in their momentum representation. Here we\nhave used k = |~k| to denote the magnitude of the spatial momentum, rather than the full four-momentum.\nUsing the integrated form for the propagator in Eq. (2.12),\nthe unparticle Wightman function is\n′\nΓ̃>\nk (t,t ) =\n\nAd (−1)d−2\n2 sin π d\n\n′\n\nZ ∞\ndk0\n−∞\n\nie−ik0 (t−t )\n; (2.15)\n2\n2π (k0 − k2 + iε )2−d\n\nevaluating this integral [4] we find2\n√\n\u0012\n\u00133\nt − t ′ 2 −d (2)\n−i\nπ 1\n′\n√\nH 3 [k(t − t ′)].\nΓ̃>\n(t,t\n)\n=\nk\nd− 2\n(8π 2 )d−1 2 2 Γ(d)\nk\n(2.16)\n(2)\nHere, Hν (z) is one of the standard Hankel functions. We\nhave assumed that t > t ′ in evaluating the momentum integral,\nwhich is automatically guaranteed by the accompanying Θfunction.\nAlthough we have been reviewing the properties of unparticles in flat space, our results immediately generalize to an\nunparticle σ in a conformally flat background,\n\u0001\n\u0001\nh0|T χ (η ,~x)χ (η ′ ,~y) |0i\n,\nh0|T σ (η ,~x)σ (η ′ ,~y) |0i =\nad (η )ad (η ′ )\n(2.17)\nwhich equally applies to the Wightman functions of the unparticle field too, Γk (η , η ′ ) = a−d (η )a−d (η ′ )Γ̃k (η , η ′ ),\n√\n\u0012\n\u00133\n−i\nπ 1\nη − η ′ 2 −d\n′\n>\n√\nΓk (η , η ) =\n(8π 2 )d−1 2 2 Γ(d)\nk\n1\n(2)\n(2.18)\nH\n[k(η − η ′ )],\nad (η )ad (η ′ ) d− 23\n\nthat occur for an ordinary inflaton. In the usual inflationary\npicture, the effective mass of the inflaton must be quite small\nduring the slowly rolling phase when the primordial perturbations are produced. However, this case corresponds to a\nmassless minimally coupled field, rather than a massless conformally coupled one, which is the natural starting point for\nan unparticle. During inflation, the curvature changes rather\nslowly, so its coupling to the field effectively acts as a large\nmass term for a particle inflaton-the d = 1 case-which produces a highly tilted power spectrum for the primordial perturbations. Generalizing to the unparticle case, d > 1, only\nworsens the shape of the power spectrum, as we shall learn in\nthis section.\nIn inflation, the tiny primordial perturbations begin as the\nfluctuations of a quantum field. The actual field responsible\nfor producing the primordial perturbations is a combination\nof the inflaton and the scalar component of the metric fluctuations, but we shall simplify the picture somewhat by treating\nthis combination as a pure unparticle. The quantum fluctuations continually occur during the slowly rolling phase and\nare stretched to vast scales, whereupon they become essentially frozen into the space-time background. The simplest\nmeasure of this pattern, which provides the initial input used\nto describe a variety of features of our universe, is the twopoint function or equivalently its Fourier transform, the power\nspectrum, Pk (η ). For an unparticle inflaton, these quantities\nare defined by\nh0|σ (η ,~x)σ (η ,~y)|0i =\n\n1\nAd\nad (η )ad (η ′ ) 2π\nZ ∞\n0\n\n2\n\n2 d−2 e\n\ndM (M )\n\n−i(η −η ′ )\n\n√\n\nM2 +k2 −iε\n\n√\n. (2.19)\n2 M 2 + k2 − iε\n\nThis form will be useful in the next section where we derive\nthe power spectrum for an unparticle inflaton.\n\nk3 >\nΓ (η , η )\n2π 2 k\nZ\nk2d Ad ∞\nμ d−2\n= 2d\n,\ndμ √\n3\na (η ) 8π 0\nμ +1\n\nPk (η ) =\n\nUNPARTICLES AS INFLATONS\n\nAt a first glance, unparticles might appear to provide an\ninteresting alternative for the inflaton itself, since the conformality of the field might be used to control some fine-tunings\n\n2\n\nTo keep the expression a little more concise, we have not explicitly\n√ written\nthe iε in this expression; it is readily restored by replacing k → k2 − iε ,\nas needed.\n\n(3.2)\n\nwhere we have rescaled the spectral parameter to produce a\ndimensionless integral, μ ≡ M 2 /k2 . Notice that this integral\ndiverges at the upper end of the integral unless d < 3/2, so\nwe find a narrower range of allowed values for the scaling\ndimension of the unparticle field.3 Otherwise, as long as 1 <\nd < 32 , we find\nPk (η ) =\n\nIII.\n\nd 3~k i~k*(~x−~y) 2π 2\ne\nPk (η ). (3.1)\n(2π )3\nk3\n\nThe power spectrum therefore has a simple relation to the unparticle Wightman function, as in Eq. (2.19),\n\n>\n′\n′\nand Γ<\nk (η , η ) = Γk (η , η ).\nHad we not integrated over the spectral parameter M 2 earlier, the Wightman function would have assumed a form that\nmore explicitly shows its similarity to its flat space form,\n′\nΓ>\nk (η , η ) =\n\nZ\n\n\u0012\n\u00132d\n1\nk\n4 Γ( 23 − d)\n√\n.\n(16π 2)d π Γ(d)\na(η )\n\n(3.3)\n\nFor a de Sitter background, the scale factor is\na(η ) = −\n\n3\n\n1\n,\nHη\n\n(3.4)\n\nHad we used the alternate form for the Wightman function given in\nEq. (2.18), it would have diverged as well as we took the limit, η ′ → η ,\nunless-as before-d < 32 .\n\n\f4\nwhere η runs from −∞ to 0, which gives a power spectrum,\nPk (η ) =\n\n4 Γ( 32 − d)\nH 2d\n√\n(−kη )2d .\n2\nd\n(16π )\nπ Γ(d)\n\n(3.5)\n\nThe scaling in the wavenumber k2d does not at all match what\nhas been observed; the actual primordial power spectrum appears to be nearly flat, which could only happen if d ≈ 0.\nIV.\n\n1 < d < 2 where it is almost marginal. Then, even a small\nvalue of n is usually sufficient to prevent the unparticles from\noverwhelming the usual flat power spectrum produced by the\ninflaton. This section examines the leading indirect role that\nunparticles can have on the production of the primordial perturbations in inflation through their loop corrections.\nThe power spectrum for the inflaton is defined exactly as\nbefore,\nh0(η )|φ (η ,~x)φ (η ,~y)|0(η )i\n\u0015\n\u0014\nZ\nd 3~k i~k*(~x−~y) 2π 2\n=\ne\nPk (η ) ,\n(2π )3\nk3\n\nUNPARTICLES IN RADIATIVE CORRECTIONS\n\nAlthough we mentioned in the beginning that unparticles\nprovide just one example of how nature might surprise us,\nthey are actually not so exotic when compared with other possibilities. Unparticles can even arise from a particle theory\nwith the right properties. As an example, consider a setting\nwhere at very high energies we have three sorts of particles:\nthe inflaton, some proto-unparticles, and a heavy particle of\nmass M that interacts with the other two. At energies below\nM, we can integrate out the heavy particles to generate interactions between the inflaton and the proto-unparticles, suppressed by some power of 1/M. If the proto-unparticles have a\nsuitable infrared fixed point, at still lower energies the protounparticles will be replaced by an effective theory of unparticles with an associated dimensional transmutation scale Λ.\nAssembling all of these ingredients together, the typical effective interaction between the inflaton, φ , and the unparticles, σ ,\nwill have the form,\n\u0012 \u0013n\n4−r−sd Λ\ncΛ\nφ rσ s,\n(4.1)\nM\nwhere c is a dimensionless coupling constant and n, r, and s\nare some integers. In an inflationary setting, the Hubble scale\nH is a low energy scale, at least with respect to the dynamics\nthat produced the unparticles. This observation implies that\nwe have the following hierarchy of scales,\nH < Λ < M.\nA.\n\n(4.2)\n\nLeading particle-unparticle interactions\n\nEven if the inflaton is not itself an unparticle, the presence\nof unparticles during inflation can still influence the pattern\nof primordial perturbations. The leading influence will be\nthrough the most relevant, or lowest dimension, operators. As\nbefore, let us denote the inflaton, now an ordinary particle, by\nφ and assume that its potential remains invariant when we replace φ with −φ . The most important possible operator is the\ncubic interaction\n\u0012 \u0013n\nΛ\ncΛ2−d\nφ 2σ .\n(4.3)\nM\n\nexcept that now that we must go beyond the simplest prediction, the time-evolution of the states becomes important since\nit is affected by the unparticles.4\nIn the interaction picture, the evolution of a state is governed by Dyson's equation,\n|0(η )i = Te−i\n\nRη\n\nη0 d η\n\n′ H (η ′ )\nI\n\n|0i,\n\n(4.5)\n\nwhere |0i denotes the initial state, |0(η0 )i. Similarly, its dual\nevolves as\n\u0013†\n\u0012\nRη\n′\n′\n(4.6)\nh0(η )| = h0| Te−i η0 d η HI (η ) ;\nnotice that the conjugation effectively reverses time-ordering.\nThe interaction Hamiltonian is given by the operator at the\nbeginning of the section,\n\u0012 \u0013n Z\n√\nΛ\nHI (η ) = −cΛ2−d\nd 3~x −g φ 2 σ\nM\n\u0012 \u0013n Z\n2−d\nΛ\nΛ\n= −c 4 4\n(4.7)\nd 3~x φ 2 σ ,\nH η M\nwhich we have evaluated in de Sitter space.\nAs before, we write the inflaton propagator in terms of its\nWightman functions,\n\u0001\nh0|T φ (η ,~x)φ (η ′ ,~y) |0i\nZ\nd 3~k i~k*(~x−~y) \u0002\n′\ne\nΘ(η − η ′ ) G>\n=\nk (η , η )\n(2π )3\n\u0003\n′\n(4.8)\n+ Θ(η ′ − η ) G<\nk (η , η ) ,\n\nwhich is the more convenient form when we would like to\nevaluate the time-evolution of an entire matrix element, rather\nthan just a scattering matrix element. Expanding the field in\nits operator eigenmodes,\n\nφ (t,~x) =\n\n4\n\nHere, c is a dimensionless coupling constant. Although this\noperator is relevant, being 2 + d dimensional, its effects can\nreasonably small, especially at the upper end of the range\n\n(4.4)\n\nZ\n\ni\nd 3~k h\ni~k*~x\n∗\ni~k*~x †\n(t)e\na\n+\nφ\nφ\n(t)e\na\nk\n~\nk\n~k ,\nk\n(2π )3\n\n(4.9)\n\nSince the universe evolves only over a finite time interval, we use\nthe Schwinger-Keldysh-Mahanthappa [5] formalism to solve the timeevolution of matrix elements. A more detailed description of how this\napproach is applied to an inflationary setting is explained in [6].\n\n\f5\nproduces a very simple form for the Wightman functions,\n′\nG>\nk (η , η ) =\n′\nG<\nk (η , η )\n\nφk (η )φk∗ (η ′ ),\n\n(4.10)\n\n...\n..\n\nwhich for a purely de Sitter background implies\n\u0013\n\u0012\nd 2 φk 2 d φk\n1 m2\n2\n−\n+\nk\n+\nφk = 0,\ndη 2 η dη\nη2 H2\n\nη0\n\n~k\n\n(4.12)\n\n(4.14)\n\n5\n\n~k\n\nk3 >\nG (η , η ),\n2π 2 k\nwhich in a de Sitter background becomes\n\n(4.18)\n\n\u0001\nH2\n1 + k2 η 2 .\n(4.19)\n2\n4π\nThe important modes for cosmology are those whose wavelength has been stretched well outside the Hubble horizon before the end of inflation,\nPktree (η ) =\n\nk\n≪ H(η );\n|a(η )|\n\n(4.20)\n\n|kη | ≪ 1,\n\n(4.21)\n\nin a de Sitter background, where a−1 (η ) = −H η , this condition becomes\n\nso the leading behavior of the power spectrum is a perfectly\nflat, scale-independent, spectrum,\nPktree (η ) ≈\n\nH2\n.\n4π 2\n\n(4.22)\n\nB. The loop\n\nsimplify considerably. Note, however, that a strictly massless\nfield is not well behaved at long distances in de Sitter space. It\nwill be important to keep this fact in mind later as we examine\nthe loop correction in detail.\nWith all of these ingredients now assembled, we can evaluate the effect of the unparticles on the power spectrum. We\nshall assume that their influence is relatively small so that we\ncan analyze the power spectrum perturbatively,\nPk (η ) =\n\nη00\n\n~p\n\n(4.15)\n\n\u0001\n′\nH2\n1+ik(η − η ′ )+k2 ηη ′ e−ik(η −η ) , (4.16)\n3\n2k\n\nloop\nPktree (η ) + Pk (η ) + * * * .\n\n~k\n\nPktree (η ) =\n\nand the Wightman functions,\n′\nG>\nk (η , η ) =\n\n.....\n...\n\nFIG. 1: A radiative correction from an unparticle to the two-point\nfunction of the inflaton. In this picture, the inflaton is denoted by the\nsolid line while the unparticle is denoted by the dashed line.\n\nFor simplicity, and since the effective mass ought to be very\nsmall during the inflationary phase, we shall work in the limit\nof a perfectly massless inflaton, m → 0 and ν → 32 , for which\nthe modes,\nH (i − kη )e−ikη\nφk (η ) = √\n,\nk3/2\n2\n\n~p\n\nAs before, the tree-level term has a simple relation to the\nWightman function, this time for a massless particle,\n\nfor the eigenmodes.\nThe normalization of the modes is set by the equal-time\ncommutation relation between φ and its conjugate momentum, but to fix the solution completely requires making some\nassumption about the behavior of the modes. The most typical assumption is to choose the maximally symmetric state\nthat matches with the flat-space vacuum at infinitesimal intervals.5 This condition defines a state known as the BunchDavies vacuum [7], which in de Sitter space is given by\n√\nπ\n(2)\nφk (η ) =\n(4.13)\nH η 3/2 Hν (kη ),\n2\nwhere the index depends on the mass of the field,\nr\n9 m2\nν=\n.\n−\n4 H2\n\n........ .....\n.......\n..\n\n...\n..\n.\n.\n..\n.\n.\n.\n.............................................................................................................................................................................................................................................................................\n\n′\nG>\nk (η , η ).\n\nwith\n=\nThe eigenmodes of a massive,\nminimally coupled scalar field obey the usual Klein-Gordon\nequation,\n\u0003\n\u0002 2\n(4.11)\n∇ + m2 φ (η ,~x) = 0,\n\n...\n....\n\nFor a cubic coupling of the form φ 2 σ , the first influence of\nthe unparticles is through the diagram shown in Fig. 1, where\nwe have chosen our loop momentum ~p so that ~k − ~p runs\nthrough the internal inflaton line and ~p runs through the unparticle line. The contribution from this diagram to the power\nspectrum is\n\u0012 \u0013\n4c2 3 2(2−d) Λ 2n\nloop\n(4.23)\nPk (η ) = − 2 k Λ\nπ\nM\nZ η\n\b\n′\n<\n′\nd η ′ a4 (η ′ ) G>\n×\nk (η , η ) − G (η , η )\nη0\n\n×\n\nZ η′\nη0\n\n\b\n′′ >\n′\n′′\nd η ′′ a4 (η ′′ ) G>\nk (η , η )Lk (η , η )\n\n′′ <\n′\n′′\n− G<\nk (η , η )Lk (η , η ) .\n\n(4.17)\n\nIn flat space, small scales remain small, but that is not so in an expanding\nspace-time, especially an inflating one. So we ought-if we were considering the more general case-to be a little cautious in our assumptions about\nhow nature behaves at extremely small scales [8].\n\nHere the loop integrals are defined by\n′\n′′\nL>\nk (η , η ) =\n\nZ\n\nd 3~p >\n′\n′′\nG\n(η ′ , η ′′ )Γ>\np (η , η )\n(2π )3 |~p−~k|\n\n′\n′′\nL<\nk (η , η )\n\nZ\n\nd 3~p <\n′\n′′\nG\n(η ′ , η ′′ )Γ<\np (η , η ), (4.24)\n(2π )3 |~p−~k|\n\n=\n\n\f6\nand the Wightman functions are given in Eq. (2.18) and\nEq. (4.16).\nThe unparticle loop correction is rather complicated, so we\nfirst reexpress it as a few nested dimensionless integrals so\nthat we can readily see how the correction Pkloop (η ) depends\non the important physical scales. For example, if we assume\nthat k 6= 0, then we can define the conformal time in units of\nthe wavenumber,\nx = −kη ,\n\n(4.25)\n\nand similarly for each of the other internal or initial times that\nappear,\nx0 = −kη0 ,\n\nx′ = −kη ′\n\nand x′′ = −kη ′′ .\n\n(4.26)\n\nWe have included a sign in each of these dimensionless variables so that they are all positive, x, x′ , x′′ , x0 > 0. As we have\nassumed that k does not vanish, which would correspond to\nan unobservable infinite mode, we can also rescale the loop\nmomentum,\nq≡\n\np\n.\nk\n\n(4.27)\n\nIn terms of these dimensionless variables, the loop integral\ndefined in Eq. (4.24) becomes\n′ ′′\nL>\nk (x , x ) = −\n\ni\nd+ 21\n\n(8π 2)\n\n3\n\n(4.28)\n\nwhere\nL̂> (x′ , x′′ ) =\n\nZ ∞\n\n1\n\n(2)\n[q(x′′ − x′ )]\nd− 32\n\u0015\n′′\n′\nix′ x′′\ne−i|q−1|(x −x )\n′′\n′\nx −x\n\ndq qd− 2 H\n\n0\n\n\u001a\u0014\n\n1\n−\n|q − 1|\n\u001b\n\u0015\n\u0014\nix′ x′′\n1\n−i(q+1)(x′′ −x′ )\n, (4.29)\ne\n−\n−\nq + 1 x′′ − x′\nonce we have integrated over all of the angular variables, using the integrals provided in Appendix B.\nAdding the external legs as well, we find the following expression for the unparticle loop correction,\n√ \u0012 \u0013\n\u0012 \u0013\nH 2 c2 2 2π Λ 4−2d Λ 2n\nloop\nPk (η ) = 2\nΠ(x) (4.30)\n4π Γ(d) (8π 2)d H\nM\n\nΠ(0) =\n\nZ ∞\n\nΠ(x)\nZ x0\ndx′ \u0002\n\n\u0003\n(1 + xx′) sin(x′ − x) − (x′ − x) cos(x′ − x)\nx\n\u001a\nZ x0\n\u0003\n′′\nL̂> (x′ , x′′ )\ndx′′ \u0002\n1 + i(x′′ − x) + xx′′ e−i(x −x)\n3\n′′\n4−d\nx′ x\n(x′′ − x′ )d− 2\n\u001b\n\u0003 ′′\n\u0002\nL̂< (x′ , x′′ )\n.\n− 1 − i(x′′ − x) + xx′′ ei(x −x)\n3\n(x′ − x′′ )d− 2\n(4.31)\nBefore looking more closely at Π(x), wherein lies all of the\ndependence on the conformal time and the wave number of\nthe modes, we can already obtain a rough idea of the size of\nthis correction by noting that the numerical factor,\n≡\n\nx′ 4−d\n\n8.0 * 10\n\n−4\n\n√\n2 2π\n<\n< 6.3 * 10−2\nΓ(d)(8π 2 )d\n\nfor d ∈ [1, 2]\n\n(4.32)\nis actually quite small in the allowed range for the scaling dimension of the unparticle field. From our hierarchy of scales,\nH < Λ < M, we should also have\n\u0012\n\nπ 3/2 H 2d+2\nΓ(d) k3\n\nx′ d x′′ d (x′′ − x′ ) 2 −d L̂> (x′ , x′′ )\n\nwhere Π(x) is the following, completely dimensionless, integral,\n\nΛ\nM\n\n\u0013n\n\n<\n\n\u0012\n\nH\nΛ\n\n\u00132−d\n\n(4.33)\n\nwhich, given that 1 < d < 2, requires only a very moderate\nvalue for n, especially when we include the numerical suppression already present in Eq. (4.32). The only remaining\nquestion is how the dimensionless part, Π(x), depends on the\ninitial and final times.\nSo far, aside from neglecting the mass of the inflaton, we\nhave not made any other approximations. However, there are\ntwo other useful limits that we can apply. Earlier, when evaluating the tree-level power spectrum, we noted that the physically important modes for cosmology are those that have been\nstretched well outside the horizon by the end of inflation, η .\nIn a de Sitter background, for these modes −kη is very small\nso we shall temporarily set −kη = x → 0 in Π(x). A second\nlimit, which is less general since we do not know much about\nhow long any presumed inflationary epoch might have lasted\nor what might have preceded it, is to take −kη0 = x0 → ∞.\nIn these limits, the expression for the dimensionless integral\nsimplifies enough that we can write the loop factors explicitly,\n\nZ ∞\n\u0003 Z ∞ dx′′\n1\n3\ndx′ \u0002\n′\n′\n′\ndq qd− 2\nsin(x\n)\n−\nx\ncos(x\n)\n(x′′ − x′ ) 2 −d\n′\n4−d\n′′\n4−d\n′\nx\nx x\n\u0014 0\n\u0015\n\u001a0\n′′\n′\n′′\n1\n(2)\n′′ −i|q−1|(x −x )−ix\n′′\n′\n′′ i|q−1|(x′′ −x′ )+ix′′ (1)\n′′\n′\nH 3 [q(x − x )] + [1 − ix ]e\n[1 + ix ]e\nH 3 [q(x − x )]\nd− 2\nd− 2\n|q − 1|\n\u0014\n\u0015\n1\n′′ −i(q+1)(x′′ −x′ )−ix′′ (2)\n′′\n′\n′′ i(q+1)(x′′ −x′ )+ix′′ (1)\n′′\n′\n[1 + ix ]e\nH 3 [q(x − x )] + [1 − ix ]e\nH 3 [q(x − x )]\n−\nd− 2\nd− 2\nq+1\n\n\f7\n−\n\n\u0014\ni\nh\nix′ x′′\n−i(q+1)(x′′−x′ )\n′′\n′\n−ix′′ −i|q−1|(x′′ −x′ )\n′′ (2)\ne\n−\ne\n[q(x\n−\nx\n)]e\n[1\n+\nix\n]H\nd− 23\nx′′ − x′\ni\u0015\u001b\nh\n′′\n′\n′′\n′\n′′\n(1)\n− [1 − ix′′]H 3 [q(x′′ − x′ )]eix ei|q−1|(x −x ) − ei(q+1)(x −x )\n.\n\n(4.34)\n\nd− 2\n\nWhile this integral might appear still somewhat daunting,\nwhat is important experimentally is not its exact value-since\nwe do not know anyway the strength of the coupling c between the inflaton and the unparticle-but whether and how\nit diverges. Any potential divergences can have one of two\ndistinct origins. First, there may simply be a standard shortdistance divergence which corresponds to a need to renormalize the inflaton in the presence of unparticle interactions. The\nsecond sort of divergence may result from the fact that we\ncannot completely neglect the mass of the inflaton or size of a\nmode at the end of inflation. The possibility of a divergence as\nx → 0 is the most interesting, since it means that the loop correction has a non-negligible dependence on k, which would\nprovide a distinct observable signature.\nThree of the regions within the range of integration in Π(0)\ncan be characterized as short-distance limits: q → ∞, short\nspatial separations, x′′ → x′ , coincident internal times, and x′ ,\nx′′ → ∞, an arbitrarily early initial time. This last case might\nnot appear to be a short-distance limit, but we should remember that as we proceed into the past, physical lengths become\never smaller, and thus they are infinitesimally tiny in the infinite past. Each of these limits is completely safe-that is,\nno divergences occur-as long as d < 2. We can verify this\nbehavior by expanding the integrand in Π(0) explicitly, but it\nis perhaps more instructive and simpler to look at the analogous calculation of the correction in flat space, which is done\nin Appendix A. This appendix shows that the loop correction\nin a Minkowski background is completely finite and does not\nrequire the renormalization of the inflaton that would be required for a particle loop. At short distances, the curvature of\nde Sitter space should become negligible-we earlier chose\nour modes to be precisely those that matched with the flatspace modes in this same limit-so there should not be any\nshort distance divergences in Π(0) either.\nThe second group of divergences are long-distance ones:\nq → 0, q → 1 and x′ , x′′ ∼ x → 0. Because q = p/k and because\nwe have chosen the loop momentum so that ~p runs through the\nunparticle leg and ~k − ~p runs through the inflaton leg, q = 0\nand q = 1 correspond respectively to having a vanishing momentum in the virtual unparticle or the virtual inflaton. As\nlong as d is positive, a soft unparticle does not produce any\ndivergences. However, a soft inflaton does yield a mild logarithmic divergence; near q = 1 we have\nΠ(0) =\n\nZ 1+ε\n\n1−ε\nZ ∞\n\n1\n|q − 1|\n\u0003Z\ndx′ \u0002\nsin(x)\n−\nx\ncos(x)\n′ 4−d\ndq\n\nx\nx\nh0\n′′ −ix′′ (2)\n′′\n′\n[1 + ix ]e\nH 3 [(x − x )]\nd− 2\n\n∞\n\ndx′′\nx′′ 4−d\n\n3\n\n(x′′ − x′ ) 2 −d\n\n′′\n\n(1)\n[(x′′ − x′ )]\nd− 23\n\n+[1 − ix′′]eix H\n+***.\n\ni\n\n(4.35)\n\nWe mentioned earlier that a massless inflaton is not well defined in a de Sitter background, so this divergence should be\ncured by including a small mass m for this field, so that here\nε ∼ m/k or\nΠ(0) ∼ ln\n\nm\n+ ***.\nk\n\n(4.36)\n\nThere remains only the case where x′ and x′′ are small. The\nlower limit-actually the upper limit in the conformal time-\nof the x′ integral is not exactly zero but is rather x = −kη . In\nthis limit the leading behavior of the integrand is\n√\n\u001b\n\u001a\nZ\n4 2\n1\n1\n1\n2d−2\n−\nΠ(x) =\ndq\nq\n3 2d Γ(d − 12 ) 0\n|q − 1| q + 1\nZ\n\nx\n\ndx′ x′ d−1\n\nZ\n\nx′\n\ndx′′ x′′ d−4 + * * *\n\n(4.37)\n\nand we discover that time-integrals scale as\nZ\n\nx\n\ndx′ x′ d−1\n\nZ\n\nx′\n\ndx′′ x′′ d−4 ∝ x2d−3 = (−kη )2d−3 ,\n\n(4.38)\n\nwhich would diverge when d < 23 if we took kη → 0.\nSo by examining the asymptotic behavior of the unparticle loop correction, Π(x), we have discovered that it can have\nsome important scaling when the dimension of the field lies\nwithin the range 1 < d < 32 . If we let Πi denote a dimensionless integral which is completely finite as m → 0 and kη → 0,\nthen we can write Π(x) in a form where all of its leading, observable dependence on the physical parameters of the theory\nis made explicit,\nm\nm\n+ Π2 (−kη )2d−3 + Π3 (−kη )2d−3 ln\nk\nk\n(4.39)\nso that the correction to the power spectrum due to an unparticle becomes,\n√ \u0012 \u0013\n\u0012 \u0013\nH 2 c2 2 2π Λ 4−2d Λ 2n\nloop\nPk (η ) =\n4π 2 Γ(d) (8π 2 )d H\nM\nn\nm\nΠ0 + Π1 ln + Π2 (−kη )2d−3\nk\nmo\n2d−3\n+Π3 (−kη )\nln\n.\n(4.40)\nk\nΠ(x) = Π0 + Π1 ln\n\nV.\n\nCONCLUSION\n\nAn inflaton that is also an unparticle does not appear to produce a realistic power spectrum. The power spectrum for the\n\n\f8\nprimordial perturbations inferred from the precise measurements of the cosmic microwave background radiation [9] is\nnearly flat, with perhaps a little more power at long wavelengths than at smaller ones. Unitarity [3] already requires\nthat d > 1, so that for scaling dimensions where d < 32 , where\nthe power spectrum scales as k2d , unparticles do not produce\na flat spectrum. Beyond d > 32 , the power spectrum becomes\npoorly defined since the Wightman function diverges at coincident times for such scaling dimensions. Because of its\nconformal properties, the flat-space propagator for an unparticle is closely related to that of a conformally flat background;\nso this divergence applies equally well to unparticles in flat\nspace.\nAn unparticle is much more useful as an additional ingredient in the standard inflationary picture. As an example, the\nloop correction produced when an unparticle interacts with a\nscalar inflaton particle tends to add to the long wavelength end\nof the power spectrum. We analyzed the loop correction due\nto a cubic coupling between the inflaton and an unparticle; we\nfound that its leading behavior scales as (kη )2d−3 . For modes\nstretched well outside the horizon during inflation, for which\nkη → 0, this term becomes negligible for d > 23 but below\nthree-halves, it enhances the power in the large-wavelength\nmodes.\nAlthough we have been primarily interested in the properties of unparticles in an inflationary setting, along the way we\nhave learned a few more general things about them that also\napply to flat space. Aside from the divergence in the Wightman function just mentioned, the behavior of unparticles is\nin some ways tamer than that of ordinary particles. Simple\nloop corrections that contain only particles usually diverge.\nThese divergences arise form the large momentum region of\nthe loop integral and they are canceled by renormalizing some\naspect of the theory. Unparticles in loops tend to be free of\nthese short-distance divergences, as is shown for a few examples in the following appendix. This observation suggests that\nunparticles can be useful as a method for regularizing conformal particle theories, particularly for massless fermions-\nprovided their unparticle analogues exist-since such a conformal regularization does not require breaking or extending\nany of the space-time symmetries.\n\nAcknowledgments\n\nThis work was supported in part by DOE grant No. DE-FG0391-ER40682, by the EU FP6 Marie Curie Research and Training Network \"UniverseNet\" (MRTN-CT-2006-035863), and\nby the Niels Bohr International Academy.\n\niA(k )\n2\n\n\u0011\n\n...\n..\n\n..\n.....\n\n......... .....\n...\n.......\n\n.....\n...\n\n...\n..\n..\n..\n.\n...........................................................................................\n.\n....................................................................................................................................................................................\n\nk\n\nk\n\nFIG. 2: A loop correction to the particle φ propagator (solid line)\nfrom an unparticle σ (dashed line) from a φ 2 σ interaction.\n\ndenote the flat-space unparticle field by χ and the ordinary-\nnow massive (m)-particle field by φ .\n1. Two particles and one unparticle\n\nLet us first choose the same coupling that we have been\nconsidering in an inflationary setting,\n\u0012 \u0013n\nΛ\ncΛ2−d\nφ 2χ ,\n(A1)\nM\nand calculate the loop amplitude associated with its correction\nto the φ -field propagator. The diagram for this amplitude is\nshown in Fig. 2 and yields\n\u0012 \u00132n\n1\nΓ(1 − d)\n2\n2 2(2−d) Λ\nA (k ) = c Λ\nM\n(16π 2)d Γ(d)\n\u0015\nZ 1 \u0014 2\nxm − x(1 − x)k2 − iε d−1\ndx\n×\n, (A2)\n1−x\n0\nonce we have integrated over the loop momentum. As a technical point, the calculation proceeds most simply if we begin\nwith the unparticle propagator in the form given in Eq. (2.9),\nintroduce the Feynman parameter integral (dx) before integrating over the spectral parameter M 2 , and lastly integrate\nover the loop momentum. The nonintegral scaling dimension\nof the field naturally avoids poles in the Γ-functions that result\nfrom this last integral. As a consequence, unparticles when\ncoupled as above do not require any renormalization of the\nparticle field. In the particle limit, d → 1, the Γ(1 − d) factor\nproduces the standard divergence.\nNote that the integrand contains a mild singularity at x = 1;\nhowever, in the range 1 < d < 2, this singularity is completely\nintegrable, being of the form\n∼\n\nZ 1\n\ndx\n\n1\n.\n(1 − x)d−1\n\n(A3)\n\nAPPENDIX A: LOOPS IN FLAT SPACE\n\nThus, for example, when the particle is on shell, k2 = m2 ,\n\u0012 \u00132(d−1) \u0012 \u00132n\nc 2 Λ2\nΛ\nm\nA (m2 ) =\n(16π 2 )d Λ\nM\nΓ(1 − d)Γ(2 − d)Γ(2d − 1)\n×\n.\n(A4)\nΓ(d)Γ(d + 1)\n\nThe short-distance behavior of unparticles-at least as virtual particles-is much milder than that of an ordinary scalar\nparticle. To illustrate this observation, we look at two simple,\nsimilar loop amplitudes for unparticles, evaluated in flat space\nand using the standard S-matrix formalism. As before, we\n\nIf we would like this correction to be \"natural,\" in the sense\nthat it is not significantly larger than the mass scale of the particle, A ≤ m2 , then n needs to be sufficiently large to satisfy\n\u0012 \u0013n \u0012 \u00132−d\nΛ\nm\n<\n.\n(A5)\nM\nΛ\n\n\f9\n\niA0(k2 )\n\n\u0011\n\n...\n...\n\n..\n............................................................................................\n..\n...\n\nk\n\n......... .....\n...\n........\n\n...\n.....\n\n....\n...\n\n....\n...\n\n......\n......\n..\n........ ........ ..\n\n...\n..\n..\n............................................................................................\n.\n.\n..\n\n..\n....\n\nWhen the external particle is on-shell, k2 = m2 , \"naturalness\" in this instance, A ′ ≤ m2 , requires\n\nk\n\n\u0012\n\nFIG. 3: A loop correction to the particle φ propagator (solid line)\nfrom an unparticle σ (dashed line) from a φσ 2 interaction.\n\nUnparticles can be of some use even when we are only interested in a particle theory, as long as we have some massless particles around. As we just saw, the nonintegral scaling\ndimension avoids the usual short-distance divergences in the\nloop. We can therefore use an unparticle as a way to regulate a massless particle, while preserving the underlying 3 + 1\ndimensional Lorentz invariance of the theory.6\nFor example, starting with a massless particle χ coupled to\na massive one, φ , by cΛφ 2 χ , evaluating the loop in 4 − 2δ\ndimensions yields\n\u0014\n\u0015\nZ 1\nxm2 − x(1 − x)k2 − iε\nc 2 Λ2 1\n− γ +ln 4π − dx ln\n.\nAdr =\n16π 2 δ\nμ2\n0\n(A6)\nComparing with an unparticle coupling cΛμ 1−d φ 2 χ , the amplitude in the small δ limit-where now d = 1 + δ -is\n\u0014\nc 2 Λ2\n1\nAun =\n− − 2γ − 1 + 2 ln4π\n2\n16π\nδ\n\u0015\nZ 1\nxm2 − x(1 − x)k2 − iε\n; (A7)\ndx ln\n−\nμ2\n0\n\nZ 1\n\nWe conclude with one last example, where this time the\ncubic coupling is\nc′ Λ3−2d\n\nΛ\nM\n\nφσ 2 .\n\n(A8)\n\nThe calculation proceeds as before so we shall be a bit briefer.\nThe amplitude associated with the unparticle loop shown in\nFig. 3 is\n\u00132n′\n\nΓ(2 − 2d)\n(−k2 − iε )2d−2.\nΓ(2d)\n(A9)\nNotice that we still have the divergence at d = 1 as well as a\nnew divergence when d = 32 , where Γ(2 − 2d) → ∞.\nA ′ (k2 ) =\n\nc′ 2 Λ2(3−2d)\n\n(16π 2 )2d−1\n\n\u0012\n\nΛ\nM\n\ne−i|~p−k|(η −η\n|~p −~k|n\n~\n\ndz\n\n−1\n\n′\n\n′′ )\n\n(B1)\n\nwhere z ≡ cos θ is related to the angle between the loop momentum ~p and the external momentum ~k. We have also assumed that η ′ > η ′′ , which is enforced by the time-ordering\nimplicit in the limits of the internal conformal time integrals\nfor the overall expression for the first correction to the twopoint function. The first (n = 1) of these integrals is straightforward enough,\nZ 1\n\ne−i|~p−k|(η −η\n|~p −~k|\n~\n\ndz\n\n−1\n\n′\n\n′′ )\n\n=\n\ne−i|p−k|(η −η )\nipk(η ′ − η ′′ )\n′\n\n−\n\n′′\n\ne−i(p+k)(η −η )\n,\nipk(η ′ − η ′′ )\n′\n\n′′\n\n(B2)\n\nwhile the other two can be thereafter generated from it,\ne−i|~p−k|(η −η\ndz\n−1\n|~p −~k|2\n~\n\nZ 1\n\n′\n\n′′ )\n\n\u0001\nEi 1, i|p − k|(η ′ − η ′′ )\n=\npk\n\u0001\nEi 1, i(p + k)(η ′ − η ′′ )\n−\n(B3)\npk\n\nand\n\nOne particle and two unparticles\n\n\u0013n′\n\n(A10)\n\nAPPENDIX B: ANGULAR INTEGRALS\n\nand we see that the finite, physical parts of the amplitudes are\nexactly the same.\n\n\u0012\n\n\u0012 \u00133−2d\nm\n.\n<\nΛ\n\nIn the loop integral, defined in Eq. (4.24), occur several angular integrals of the general form,\n\n2. Unparticle regularization\n\n3.\n\n\u0013n′\n\nΛ\nM\n\ne−i|~p−k|(η −η\ndz\n−1\n|~p −~k|3\n~\n\nZ 1\n\n=−\n\n+\n\n′\n\n′′ )\n\n\u0001\ni(η ′ − η ′′ ) \u0002\nEi 1, i|p − k|(η ′ − η ′′ )\npk\n\u0001\u0003\n− Ei 1, i(p + k)(η ′ − η ′′ )\ne−i|p−k|(η −η\npk|p − k|\n′\n\n′′ )\n\n−\n\ne−i(p+k)(η −η )\n.\npk(p + k)\n′\n\n′′\n\n(B4)\n\nOur convention here for the definition of the exponential\nintegral is that used by the MAPLE program, which is\nEi(1, x) =\n\nZ ∞\n1\n\ndζ\n\ne−xζ\n.\nζ\n\n(B5)\n\n\f10\n6\n\nThis technique resembles the method of \"Analytic Renormalization\" proposed in [10].\n\n[1] H. Georgi, Phys. Rev. Lett. 98, 221601 (2007)\n[hep-ph/0703260]; H. Georgi, Phys. Lett. B 650, 275\n(2007) [hep-ph/0704.2457].\n[2] H. Davoudiasl, Phys. Rev. Lett. 99, 141301 (2007) [hepph/0705.3636 [hep-ph]]; S. Hannestad, G. Raffelt and\nY. Y. Y. Wong, Phys. Rev. D 76, 121701 (2007) [hepph/0708.1404]; P. K. Das, Phys. Rev. D 76, 123012 (2007)\n[hep-ph/0708.2812]; L. Anchordoqui and H. Goldberg, Phys.\nLett. B 659, 345 (2008) [hep-ph/0709.0678]; J. McDonald, hepph/0709.2350; I. Lewis, hep-ph/0710.4147; G. L. Alberghi,\nA. Y. Kamenshchik, A. Tronconi, G. P. Vacca and G. Venturi,\nhep-th/0710.4275; S. L. Chen, X. G. He, X. P. Hu and Y. Liao,\nhep-ph/0710.5129.\n[3] B. Grinstein, K. Intriligator and I. Z. Rothstein, hepph/0801.1140.\n[4] See, for example, equation 3.384.9 of I. S. Gradshteyn and\nI. M. Ryzhik, Table of Integrals, Series, and Products, Sixth\nEdition (Academic Press, San Diego, CA, 2000).\n[5] J. S. Schwinger, J. Math. Phys. 2, 407 (1961); L. V. Keldysh,\n\n[6]\n\n[7]\n[8]\n\n[9]\n[10]\n\nZh. Eksp. Teor. Fiz. 47, 1515 (1964) [Sov. Phys. JETP 20,\n1018 (1965)]; K. T. Mahanthappa, Phys. Rev. 126, 329 (1962);\nP. M. Bakshi and K. T. Mahanthappa, J. Math. Phys. 4, 12\n(1963).\nH. Collins and R. Holman, Phys. Rev. D 71, 085009 (2005)\n[hep-th/0501158]. H. Collins and R. Holman, hep-th/0507081.\nH. Collins and R. Holman, Phys. Rev. D 74, 045009 (2006)\n[hep-th/0605107]. H. Collins and R. Holman, hep-th/0609002.\nH. Collins and R. Holman, hep-ph/0705.4666.\nT. S. Bunch and P. C. Davies, Proc. Roy. Soc. Lond. A 360, 117\n(1978).\nJ. Martin and R. H. Brandenberger, Phys. Rev. D 63, 123501\n(2001) [hep-th/0005209]; R. H. Brandenberger and J. Martin,\nMod. Phys. Lett. A 16, 999 (2001) [astro-ph/0005432].\nD. N. Spergel et al., astro-ph/0603449; H. V. Peiris et al., Astrophys. J. Suppl. 148, 213 (2003) [astro-ph/0302225].\nE. R. Speer, J. Math. Phys. 9, 1404 (1968).\n\n\f"}