{"id": "http://arxiv.org/abs/1112.5591v1", "guidislink": true, "updated": "2011-12-22T15:07:39Z", "updated_parsed": [2011, 12, 22, 15, 7, 39, 3, 356, 0], "published": "2011-12-22T15:07:39Z", "published_parsed": [2011, 12, 22, 15, 7, 39, 3, 356, 0], "title": "Classical signal model reproducing quantum probabilities for single and\n  coincidence detections", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1112.0603%2C1112.0797%2C1112.1130%2C1112.5609%2C1112.4491%2C1112.3639%2C1112.5776%2C1112.0792%2C1112.0376%2C1112.4262%2C1112.5591%2C1112.6224%2C1112.2752%2C1112.3151%2C1112.4427%2C1112.1719%2C1112.1496%2C1112.6109%2C1112.5904%2C1112.1722%2C1112.3004%2C1112.6006%2C1112.1770%2C1112.2052%2C1112.3326%2C1112.3052%2C1112.6097%2C1112.0932%2C1112.5352%2C1112.0045%2C1112.3844%2C1112.4297%2C1112.2916%2C1112.2821%2C1112.5740%2C1112.0798%2C1112.1571%2C1112.6033%2C1112.2805%2C1112.0987%2C1112.4248%2C1112.5894%2C1112.3408%2C1112.5759%2C1112.5989%2C1112.6211%2C1112.2145%2C1112.5274%2C1112.1118%2C1112.3393%2C1112.2085%2C1112.6243%2C1112.4128%2C1112.4173%2C1112.4831%2C1112.2270%2C1112.5473%2C1112.3988%2C1112.3305%2C1112.2686%2C1112.3609%2C1112.4937%2C1112.1037%2C1112.4446%2C1112.2766%2C1112.1872%2C1112.5371%2C1112.6167%2C1112.2208%2C1112.0838%2C1112.6023%2C1112.5645%2C1112.4688%2C1112.5396%2C1112.1402%2C1112.1875%2C1112.2290%2C1112.6058%2C1112.4796%2C1112.5903%2C1112.5333%2C1112.2327%2C1112.4712%2C1112.5402%2C1112.4589%2C1112.4612%2C1112.6373%2C1112.0914%2C1112.2063%2C1112.5040%2C1112.5104%2C1112.4707%2C1112.1362%2C1112.5204%2C1112.2306%2C1112.5530%2C1112.4204%2C1112.2689%2C1112.5822%2C1112.0596%2C1112.2334&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Classical signal model reproducing quantum probabilities for single and\n  coincidence detections"}, "summary": "We present a simple classical (random) signal model reproducing Born's rule.\nThe crucial point of our approach is that the presence of detector's threshold\nand calibration procedure have to be treated not as simply experimental\ntechnicalities, but as the basic counterparts of the theoretical model. We call\nthis approach threshold signal detection model (TSD). The experiment on\ncoincidence detection which was done by Grangier in 1986 \\cite{Grangier} played\na crucial role in rejection of (semi-)classical field models in favor of\nquantum mechanics (QM): impossibility to resolve the wave-particle duality in\nfavor of a purely wave model. QM predicts that the relative probability of\ncoincidence detection, the coefficient $g^{(2)}(0),$ is zero (for one photon\nstates), but in (semi-)classical models $g^{(2)}(0)\\geq 1.$ In TSD the\ncoefficient $g^{(2)}(0)$ decreases as $1/{\\cal E}_d^2,$ where ${\\cal E}_d>0$ is\nthe detection threshold. Hence, by increasing this threshold an experimenter\ncan make the coefficient $g^{(2)}(0)$ essentially less than 1. The\nTSD-prediction can be tested experimentally in new Grangier type experiments\npresenting a detailed monitoring of dependence of the coefficient $g^{(2)}(0)$\non the detection threshold.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1112.0603%2C1112.0797%2C1112.1130%2C1112.5609%2C1112.4491%2C1112.3639%2C1112.5776%2C1112.0792%2C1112.0376%2C1112.4262%2C1112.5591%2C1112.6224%2C1112.2752%2C1112.3151%2C1112.4427%2C1112.1719%2C1112.1496%2C1112.6109%2C1112.5904%2C1112.1722%2C1112.3004%2C1112.6006%2C1112.1770%2C1112.2052%2C1112.3326%2C1112.3052%2C1112.6097%2C1112.0932%2C1112.5352%2C1112.0045%2C1112.3844%2C1112.4297%2C1112.2916%2C1112.2821%2C1112.5740%2C1112.0798%2C1112.1571%2C1112.6033%2C1112.2805%2C1112.0987%2C1112.4248%2C1112.5894%2C1112.3408%2C1112.5759%2C1112.5989%2C1112.6211%2C1112.2145%2C1112.5274%2C1112.1118%2C1112.3393%2C1112.2085%2C1112.6243%2C1112.4128%2C1112.4173%2C1112.4831%2C1112.2270%2C1112.5473%2C1112.3988%2C1112.3305%2C1112.2686%2C1112.3609%2C1112.4937%2C1112.1037%2C1112.4446%2C1112.2766%2C1112.1872%2C1112.5371%2C1112.6167%2C1112.2208%2C1112.0838%2C1112.6023%2C1112.5645%2C1112.4688%2C1112.5396%2C1112.1402%2C1112.1875%2C1112.2290%2C1112.6058%2C1112.4796%2C1112.5903%2C1112.5333%2C1112.2327%2C1112.4712%2C1112.5402%2C1112.4589%2C1112.4612%2C1112.6373%2C1112.0914%2C1112.2063%2C1112.5040%2C1112.5104%2C1112.4707%2C1112.1362%2C1112.5204%2C1112.2306%2C1112.5530%2C1112.4204%2C1112.2689%2C1112.5822%2C1112.0596%2C1112.2334&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We present a simple classical (random) signal model reproducing Born's rule.\nThe crucial point of our approach is that the presence of detector's threshold\nand calibration procedure have to be treated not as simply experimental\ntechnicalities, but as the basic counterparts of the theoretical model. We call\nthis approach threshold signal detection model (TSD). The experiment on\ncoincidence detection which was done by Grangier in 1986 \\cite{Grangier} played\na crucial role in rejection of (semi-)classical field models in favor of\nquantum mechanics (QM): impossibility to resolve the wave-particle duality in\nfavor of a purely wave model. QM predicts that the relative probability of\ncoincidence detection, the coefficient $g^{(2)}(0),$ is zero (for one photon\nstates), but in (semi-)classical models $g^{(2)}(0)\\geq 1.$ In TSD the\ncoefficient $g^{(2)}(0)$ decreases as $1/{\\cal E}_d^2,$ where ${\\cal E}_d>0$ is\nthe detection threshold. Hence, by increasing this threshold an experimenter\ncan make the coefficient $g^{(2)}(0)$ essentially less than 1. The\nTSD-prediction can be tested experimentally in new Grangier type experiments\npresenting a detailed monitoring of dependence of the coefficient $g^{(2)}(0)$\non the detection threshold."}, "authors": ["Andrei Khrennikov", "Börje Nilsson", "Sven Nordebo"], "author_detail": {"name": "Sven Nordebo"}, "author": "Sven Nordebo", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1088/1742-6596/361/1/012030", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1112.5591v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1112.5591v1", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "quant-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "quant-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "math-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "math.MP", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "physics.class-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "physics.hist-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1112.5591v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1112.5591v1", "arxiv_comment": null, "journal_reference": "Journal of Physics: Conference Series, 361, art N 012030 (2012)", "doi": "10.1088/1742-6596/361/1/012030", "fulltext": "arXiv:1112.5591v1 [quant-ph] 22 Dec 2011\n\nClassical signal model reproducing quantum\nprobabilities for single and coincidence\ndetections\nAndrei Khrennikov, Börje Nilsson, and Sven Nordebo\nInternational Center for Mathematical Modelling\nin Physics and Cognitive Sciences\nLinnaeus University, Växjö, S-35195, Sweden\nOctober 5, 2018\nAbstract\nWe present a simple classical (random) signal model reproducing\nBorn's rule. The crucial point of our approach is that the presence of\ndetector's threshold and calibration procedure have to be treated not\nas simply experimental technicalities, but as the basic counterparts\nof the theoretical model. We call this approach threshold signal detection model (TSD). The experiment on coincidence detection which\nwas done by Grangier in 1986 [20] played a crucial role in rejection\nof (semi-)classical field models in favor of quantum mechanics (QM):\nimpossibility to resolve the wave-particle duality in favor of a purely\nwave model. QM predicts that the relative probability of coincidence\ndetection, the coefficient g(2) (0), is zero (for one photon states), but\nin (semi-)classical models g(2) (0) ≥ 1. In TSD the coefficient g(2) (0)\ndecreases as 1/Ed2 , where Ed > 0 is the detection threshold. Hence,\nby increasing this threshold an experimenter can make the coefficient\ng(2) (0) essentially less than 1. The TSD-prediction can be tested experimentally in new Grangier type experiments presenting a detailed\nmonitoring of dependence of the coefficient g (2) (0) on the detection\nthreshold.\n\n1\n\nIntroduction\n\nWe study the old problem of a possibility to construct a classical field model\nreproducing probabilistic predictions of quantum mechanics. The common\n1\n\n\fopinion, see Bell [1], is that this is impossible to do, but see [2]–[14] for\nnumerous attempts to proceed with classical wave (oscillatory) prequantum\nmodels. The main argument is that for composite quantum systems (e.g., a\npair of entangled photons) the correlation predicted by QM (and confirmed\nby experiment [15]–[17]) cannot be reproduced by models with (local) hidden variables. This is also the common opinion that \"Bell's theorem\" [1] is\nformulated in so general abstract framework that it rejects all (local) models\nwith hidden variables, including variables of classical field (e.g., electromagnetic) type. Although nowadays Bell's inequality and entangled systems are\nthe hot topics [18], [19], the problem of a possibility of the classical field\ndescription of a single quantum system is also of the large importance for\nquantum theory, including quantum information theory. One of the most\nimportant tests of a possibility to represent a photon simply as a pulse of\nclassical electromagnetic field is the experiment on coincidence detection in\ntwo output channels of the polarization beam splitter (PBS) [20], [21]. QM\npredicts that if the source can be considered as one-photon source, then the\nprobability of coincidence detection equals to zero: one photon cannot be\nsplit between two channels, it is either in one or another channel. Any pulse\nof the classical electromagnetic field is split between two output channels of\nPBS. Hence, the probability of coincidence detection is nonzero. Of course,\nthe real experimental situation is more complicated: for any \"one-photon\nsource\" the probability of emission of e.g. two photons is nonzero (although\nit can be made very small), there is also the contribution of noise, including\nso called duck counts (i.e., counts in detectors in the absence of the source).\nTherefore, instead of the absolute probability of coincidence detection P12 ,\nexperimenters use the relative probability [20], [21]:\ng (2) (0) =\n\nP12\n,\nP1 P2\n\n(1)\n\nwhere P12 is the probability of coincidence detection in channels i = 1, 2 and\nPi are probabilities of detection in corresponding channels. Known (semi-)\nclassical models of QM predict that g (2) (0) ≥ 1. If photon is not a classical\npulse, one can expect that g (2) (0) < 1 (even by taking into account noise and\nemission of double photons). The first experiment of this type was performed\nby [20], see also [21] and [22] for review. It was shown that the number of\ndouble clicks is relatively small. This experiment played an important role\nin quantum foundations. As is commonly accepted, this experiment justified\nrejection of (semi-)classical field theories as \"prequantum theories\"; in particular, photons cannot be interpreted as pulses of classical electromagnetic\nfield.\nThe aim of this paper is to show that the main reason of dis-matching of\n2\n\n\fpredictions of (semi-)classical field models with QM and experimental data is\nthat such models do not take into account the impact of detectors to creation\nof the quantum statistics.\nWe present a classical field model which in combination with the procedure of detection of random signals by threshold type detectors (which are\nproperly calibrated) reproduces quantum probabilities and, in particular, the\ncoefficient g (2) (0) << 1 for a sufficiently high detection threshold Ed . Hence,\nthe prediction of our model differs crucially from the prediction of the known\nclassical field models which do not take into account the evident fact that\nmeasurement is not simply detection (of the monitoring-type) of continuous\nclassical signals, but creation of discrete counts with the aid of threshold\ndetectors. Detectors also have to be properly calibrated.\nOur model, threshold signal detection model (TSD), predicts that the\nquantum prediction, g (2) (0) << 1, matches better measurements for high\nvalue of the detection threshold. The basic prediction of TSD is that the\ncoefficient\nK\ng (2) (0) ≤ 2 ,\nEd\nwhere K > 0 is a constant depending on the signal. This K depends on the\nbrightness of the source: higher brightness implies larger K. It also depends\non elements of the density matrix ρ = (ρij ) corresponding to the prequantum\nsignal. (In TSD ρ corresponds to the normalization (by the trace) of the\ncovariance operator B of the prequantum random signal, i.e., ρ = B/TrB.)\nLarger ρ12 implies larger K.\nIt is interesting to compare this prediction with the real experiment. Unfortunately, it seems that Grangier's type experiments with detailed monitoring of dependence of the coincidence probability on the value of the threshold\nhave never been done; more specifically, that is: In Grangier's experiment,\ndid the calibration of detectors play a crucial role to eliminate coincidences?\nThis is clearly a crucial question. It is hard to give a definite answer\nas to how exactly it was influencing the result at a fundamental level because Grangier et al [20], [21] didn't study the influence of threshold on the\ng (2) (0) parameter he was measuring. It is nevertheless clear that with a lower\nthreshold, he would have gotten a less good result. Let me translate the part\nof Grangier's thesis [21] where he explains for the first time the role of the\nthreshold and how its level was chosen:\n\"[...] In this configuration, the threshold has a double role of acquisition\nof timing information and of selection of the pulses (the too weak pulses\nare not taken into account). The problems connected to the choice of the\ndiscriminator threshold and of the high voltage of the photomultipliers are\ndiscussed in detail in reference [15]. We have in the present experiment\n3\n\n\fchosen a rather high threshold, which amount to give the priority of the\nstability of the counting rates and the reproducibility of the results, rather\nthan to the global detection efficiencies.\" (I stressed with bold the important\nfact that Grangier proceeded with rather high threshold.)\nTSD provides a strong motivation to perform Grangier's type experiment\nwith monitoring of dependence of the coincidence probability on the detection\nthreshold and source's brightness.\nTSD can be considered as measurement theory for recently developed\nprequantum classical statistical field theory, PCSFT, [23],[24]. The latter reproduced all quantum averages and correlations including correlations for\nentangled quantum states. In particular, PCSFT correlations violated Bell's\ninequality. The main problem for matching of PCSFT and conventional QM\nwas that PCSFT (nor other classical field models) was not able to describe\nprobabilities of discrete clicks of detectors. In particular, PCSFT is theory\nof correlations of continuous signals. \"Prequantum observables\" are given\nby quadratic forms of signals. These forms are unbounded and this is not\nsurprising that correlations of such observables can violate Bell's type inequalities, see [25] for discussion and an elementary example. The condition\nof coincidence of ranges of values of quantum observables and corresponding\n\"prequantum variables\" plays a crucial role in Bell's argument. TSD solved\nthe measurement problem of PCSFT. In the same way as in Bell's consideration, TSD operates with discrete observables. In particular, in the case\nof photon polarization (its projection to a fixed axis) TSD operates with\ndichotomous variables taking values ±1.\nTSD/PCSFT for composite quantum systems was presented in [26]. However, random signals considered in [26] have a complex structure of temporal\ncorrelations, even in the case of a single system. In the present paper, we use\nsimply a combination of the Wiener process (as the career of temporal correlations) and a Gaussian stationary process valued in the space of internal\ndegrees of freedom of a quantum system (e.g., its polarization). We do not\nconsider spatial degrees of freedom.\nTo escape misunderstanding, we stress that the presented detection model\nis purely classical; in particular, detectors are classical detectors which are\nsensitive to the energy density of a signal in the domain of detection V. Such\na detector clicks at the first instance of time τ = τd when the total energy of\nsignal in V approaches the detection threshold Ed . Since we consider random\nsignals, this instant of detection is a random variable τ = τ (ω). Our main\naim is to find its average τ̄ . The quantity 1/τ̄ determines the probability of\ndetection. At the moment we proceed with such an operational description\nof the classical detectors. We plan to consider a more detailed scheme of the\nclassical threshold detection in another paper in which we shall study classical\n4\n\n\fsignals with spatial degrees of freedom, i.e., signals in physical space-time.\n(In the present paper we restrict the model to \"internal degrees of freedom\"\nsuch as polarization. The model with spatial degrees of freedom is essentially\nmore complicated, since it involves processes with infinite-dimensional state\nspace.)\n\n2\n2.1\n\nThreshold detection\nThe class of random signals\n\nWe consider a special class of classical random signals. The model is phemenological: we cannot present physical motivations for selection of this\nclass of signals, besides the fact that detection of such signals with the aid\nof threshold type detectors reproduces the correct quantum probabilities.\nAnother class of classical random signals serving for the same aim was introduced in [26]. Signals considered in the present paper have essentially\nsimpler temporal structure, simply the Wiener process.\nStructurally our model has some similarity with the prequantum model\nof Grössing et al [13]. Subquantum stochasticity is combined of the two\ncounterparts: a stationary process in the space of internal degrees of freedom\nand the randmom walk type motion describing the temporal dynamics.\nWe start with stationary signals. We proceed in the finite dimensional\nstate space corresponding to internal degrees of freedom such as polarization.\nGeneralization to spatial degrees of freedom is evident, but it has essentially\nmore complicated mathematical structure.\nLet H be the m dimensional complex Hilbert space. Let φ ≡ φ(ω) be\nthe H-valued Gaussian random variable with zero average and the covariance operator B. This operator is Hermitian and positively defined. Take\nin H an orthonormal basis {ej } and consider corresponding signal's components φj (ω) = hφ(ω), ej i. The mathematical\nP expansion of the random vector\nφ(ω) with respect to the basis φ(ω) = j φj (ω)ej physically corresponds to\nsplitting of the signal into disjoint channels. We remark that correlations of\nsignal's components are given by\nEφi φj = hBei , ej i = bij .\nNow we introduce the temporal stochastics by simply using the one dimensional Wiener process w(t) which is independent from the stationary process φ(ω). Consider the random (non-stationary) signal φ(t, ω) = w(t)φ(ω)\nand its components corresponding to internal degrees of freedom: φj (t, ω) =\n\n5\n\n\fw(t)φj (ω). We remark that correlations of signal's components are given by\nEφi (t)φj (s) = min(t, s)bij .\nThe energy of the ith component of the complex signal φ(t) (at the instance\nof time t) is given by the square of its absolute value\nEi (t, ω) = |φi (t, ω)|2.\nThe total energy of the signal is\nX\nEi (t, ω) =\n|φi (t, ω)|2 = kφ(t, ω)k2.\ni\n\n2.2\n\nThe scheme of threshold measurement\n\nWe consider the measurement scheme in which each channel, i = 1, 2, ...m,\ngoes to a threshold type detector. We assume that all detectors have the same\nthreshold Ed > 0. The detection procedure under consideration is reduced to\nthe condition of the energy level approaching the detection threshold. The\ninstant of time τ corresponding to the signal's detection (\"click\") by jth\ndetector is determined by the condition:\nEj (τ, ω) = Ed .\n\n(2)\n\nWe remark that the instant of the signal detection is a random variable:\nτ = τ (ω).\nMathematically our aim is to find average of the instance of detection, τ̄ =\nEτ. The quantity 1/τ̄ will be used to find the probability of detection, \"how\noften the detector produces clicks,\" see section 3.\nWe apply the mathematical expectation (average) operator to both sides\nof the detection condition (2) and we obtain\nEEj (τ (ω), ω) = Ed ,\n\n(3)\n\nEw 2 (τ (ω), ω)E|φj (ω)|2 = Ed .\n\n(4)\n\nor\nTo find the first average, we use the formula of total probability:\nZ ∞\n2\nEw (τ (ω), ω) =\ndτ P (τ (ω) = τ )Ew 2 (τ, ω).\n0\n\n6\n\n\fWe know that, for the fixed τ, Ew 2 (τ, ω) = τ. Hence,\nZ ∞\n2\nEw (τ (ω), ω) =\ndτ P (τ (ω) = τ )τ = Eτ ≡ τ̄ .\n0\n\nThus, the detection condition (4) has the form:\nτ̄ E|φj (ω)|2 = Ed ,\n\n(5)\n\nτ̄ bii = Ed .\n\n(6)\n\nor\nWe remark that τ = τi , i = 1, 2, ..., m. Thus\n1\nbii\n= .\nτ ̄i\nEd\n\n3\n\n(7)\n\nProbabilities of clicks in detection channels\n\nHence, during a long period of time T such a detector clicks Nclick -times,\nwhere\nbii T\nT\n.\n(8)\nNi ≈ =\nτ ̄i\nEd\nTo find the probability of detection and match the real detection scheme\nwhich is used in quantum experiments we have to use a proper normalization\nof Ni , This is an important point of our considerations. (The normalization\nproblem is typically ignored in standard books on quantum foundations,\ncf., however, [25].) In QM-experiments probabilities are obtained through\nnormalization corresponding to the sum of clicks in all detectors involved in\nthe experiment, e.g., spin up and spin down detectors.\nHence, the total number of clicks:\nP\nX\nT i bii\nT TrB\nNi =\nN=\n=\n.\n(9)\nEd\nEd\ni\nWe remark that the total number of clicks does not depend on the split of\nthe signal into disjoint channels, i.e., on the selection of an orthonormal basis\n{ej } in H. In fact,\nEkφ(ω)k2 = TrB.\nThe probability of detection for the jth detector is given by\nPi = Ni /N =\n7\n\nbii\n.\nTrB\n\n(10)\n\n\fIn fact, this is the Born's rule of QM. Consider the operator\nρ = B/TrB.\n\n(11)\n\nThis is the Hermitian positive trace one operator; so it has all properties of\nthe density operator used in QM to describe the state of a quantum system.\nbi = |ei ihei |, the orthogonal projection onto the vector ei . Then the\nSet C\nequality for the probability of detection (10) can be written as\nb i.\nPi = TrρC\n\n(12)\n\nThis is the QM-rule for calculation of probabilities of detection.\n\n4\n\nCoincidence detection\n\nCoincidence of clicks corresponds to matching of two conditions of threshold\napproaching corresponds to two constraints:\nE1 (τ1 (ω), ω) = Ed , E2(τ2 (ω), ω) = Ed = Ed ,\n\n(13)\n\nwhere matching has the form\nτ1 (ω) = τ2 (ω) = τ (ω).\n\n(14)\n\nOur aim is to estimate the probability of coincidence P12 . To shorter notatin,\nwe set Ei (ω) ≡ Ei (τ (ω); ω) or even simply Γi , i = 1, 2.\nWe consider the set of random parameters corresponding to coincidence\ndetection: A12 = {ω : Ei = Ed , i = 1, 2}. (A12 is the event of coincidence\ndetection). We have to estimate its probability, P12 = P (A12 )). We shall get\na rather rough estimate which, nevertheless, will be sufficient for our purpose.\nHowever, we shall see that better estimates of this probability will clarify\nessentially inter-relation between our \"prequantum classical field theory\",\nQM, and experiment. In principle, one may hope to derive an approximative\nexpression for P12 as we did for probabilities Pj , j = 1, 2. However, this is a\ncomplicated probabilistic problem.\nWe remark that A12 is a subset of the set\nA1×2 = {ω : E1 E2 = Ed2 }.\nHence, P (A12 ) ≤ P (A1×2 ). And the set A1×2 is a subset of the set\nA1×2≥Ed2 = {ω : E1 E2 ≥ Ed2 }\n8\n\n\fand hence P (A12 ) ≤ P (A1×2≥Ed2 ). The latter probability we can (roughly)\nestimate by using Chebyshov inequality (which usage is standard for such\nestimates, cf. [27]). In the simplest form, for a random variable u = u(ω)\nand a constant k > 0, this inequality has the form: P (ω : u ≥ k) ≤ E|u(ω)|\n.\nk\nIn our case u = E1 E2 , k = Ed2 . We have\nP (A12 ) ≤\n\nEE1 E2\n.\nEd2\n\n(15)\n\nWe find this average by using the formula of total probability [?], [27]:\nZ ∞\nEE1 (ω)E2(ω) =\nEE1 (τ, ω)E2(τ, ω)P (τ (ω) = τ )dτ.\n(16)\n0\n\nThus our main problem is to find the correlation of two energies for each\ninstant of time τ. We have\nEE1 (τ, ω)E2(τ, ω) = Ew 4(τ )E|φ1 (ω)|2|φ2 (ω)|2.\nThe first factor is known, Ew 4 (τ ) = 3τ 2 .\nTo find the second factor, we shall use general theory of Gaussian integrals\non complex Hilbert space [28], see appendix. Consider in H (m-dimensional\nbk = |ek ihek |, k = 1, ..., m. Set fA (φ) =\ncomplex space) projection operators A\nk\nb\nc\nhAk φ, φi, φ ∈ H, the quadratic form corresponding to the operator Ak . By\n(27), appendix, we obtain\nb1 TrB A\nb2 + TrB A\nb2 B A\nb1 ,\nEfA1 fA2 = TrB A\n\n(17)\n\nbij = ρij TrB,\n\n(18)\n\nwhere B is the covariance operator. We remark that\n\nwhere ρ = (ρij ) is a density operator. So, we consider the prequantum random signal corresponding to the quantum state ρ and we study the problem\nof detection coincidence for such a signal φ(t) ≡ φρ (t, ω). We have\n\nIn the same way\n\nbi = bii , i = 1, 2.\nTrB A\nb2 B A\nb1 = |he1 |B|e2 i|2 = |b12 |2 .\nTrB A\n\nFinally, we obtain (for the fixed instant of time τ )\n\nEE1 (τ, ω)E2(τ, ω) = 3τ 2 (b11 b22 + |b12 |2 ).\n9\n\n\fThe formula of total probability (16) implies\nEE1 (τ (ω); ω)E2(τ (ω); ω) = 3τ 2 (b11 b22 + |b12 |2 ),\nwhere τ 2 = Eτ 2 . By (11) we can rewrite this answer in terms of quantum\nmechanical density matrix\nEE1 (τ (ω); ω)E2(τ (ω); ω) = 3τ 2 TrB(ρii ρjj + |ρij |2 ),\nThus by the Chebyshov inequality\nP (A12 ) ≤\n\n3TrBτ 2\n(ρii ρjj + |ρij |2 ).\nEd2\n\nThe quantity\n∆≡\n\np\n\nτ2\n\n(19)\n\n(20)\n\ncan be interpreted as the time parameter scaling the time intervals between\ncoincidence clicks. Therefore E ∆ = ∆TrB is average of signal's energy distributed between clicks. Supppose that\nǫ=\n\nE∆\n<< 1.\nEd\n\n(21)\n\nIn this case\nP (A12 ) ≤ 3ǫ2 (ρii ρjj + |ρij |2 ).\n\n(22)\n\nAs usual [], set g (2) (0) = PP112\n, where P1 and P2 are probabilities of detection\nP2\nin channels i and j, respectively (it is assumed that the later probabilities are\npositive). We proved, see section 3, that in TSD model, these probabilities\nare equal to quantum probabilities: P1 = ρ11 and P2 = ρ22 . Hence,\n\u0010\n|ρij |2 \u0011\nP12\n2\n.\n≤ 3ǫ 1 +\ng (0) =\nP1 P2\nρii ρjj\n(2)\n\n(23)\n\nSince ǫ ∼ E1d , by increasing the parameter Ed the coefficient g12 (0) can be\ndone less than 1. Hence, our prequantum classical field model can violate\n(under the selection of a proper threshold) the inequality g (2) (0) ≥ 1 which\nis valid for \"standard\" classical signal theory – its standard version which\ndoes not take into account the evident fact that measurement is not simply\ndetection (of the monitoring-type) of continuous classical signals, but creation\nof discrete counts with the aid of threshold detectors. Detectors also have to\nbe properly calibrated.\n10\n\n\f5\n\nAppendix: Gaussian integrals\n\nDetails of theory of integration with respect to Gaussian measures on complex\nHilbert spaces can be found in [28].\nLet W be a real Hilbert space. Consider a σ-additive Gaussian measure\np on the σ-field of Borel subsets of W. This measure is determined by its\ncovariance operator B : W → W and mean value m ∈ W. For example, B\nand m determine the Fourier transform of p :\nZ\n1\np̃(y) =\nei(y,φ) dp(φ) = e 2 (By,y)+i(m,y) , y ∈ W.\nW\n\n(In probability theory it is called the characteristic functional of the probability distribution p.) In what follows we restrict Rour considerations to\nGaussian measures with zero mean value: (m, y) = W (y, ψ)dp(ψ) = 0 for\nany y ∈ W. Sometimes there will be used the symbol pB to denote the\nGaussian measure with the covariance operator B and m = 0. We recall\nthat\nthe covariance operator B is defined by its bilinear form (By1 , y2 ) =\nR\n(y1 , φ)(y2, φ)dp(φ), y1, y2 ∈ W\nLet Q and P be two copies of a real Hilbert space. Let us consider their\nCartesian product\n\u0013 × P, \"phase space,\" endowed with the symplectic\n\u0012 H =Q\n0\n1\n. Consider the class of Gaussian measures (with\noperator J =\n−1 0\nzero mean value) which are invariant with respect to the action of the operator J; denote this class S(H). It is easy to show that p ∈ S(H) if and only\nif its covariance operator commutes with the symplectic operator, [23].\nAs always, we consider complexification of H (which will be denoted by\nthe same symbol), H = Q ⊕ iP. The complex scalar product is denoted by\nthe symbol h*, *i. The space of bounded Hermitian operators acting in H is\ndenoted by the symbol Ls (H).\nWe introduce the complex covariance Roperator of a measure p on the\ncomplex Hilbert space H : hDy1, y2 i = H hy1 , φihφ, y2idp(φ). Let p be a\nmeasure on the Cartesian product H1 × H2 of two complex Hilbert spaces.\nThen its covariance operator has the block structure\n\u0012\n\u0013\nD11 D12\nD=\n,\n(24)\nD21 D22\nwhere Dii : Hi → Hi and Dij : Hj → Hi . The operator is Hermitian. Hence\n∗\nDii∗ = Dii , and D12\n= D21 .\nb ∈ Ls (H). We consider its\nLet H be a complex Hilbert space and let A\nquadratic form (which will play an important role in our further considerab φi. We make a trivial, but ideologically important\ntions) φ → fA (φ) = hAφ,\n11\n\n\fremark: fA : H → R, is a \"usual function\" which is defined point wise. We\nuse the equality, see, e.g., [23]:\nZ\nb\nfA (φ)dpD (φ) = Tr D A\n(25)\nH\n\nLet p be a Gaussian measure of the class S(H1 × H2 ) with the (complex)\nbi belong to the class Ls (Hi ), i =\ncovariance operator D and let operators A\n1, 2. Then\nZ\nb1 TrD22 A\nb2 + TrD12 A\nb2 D21 A\nb1 (26)\nfA1 (φ1 )fA2 (φ2 )dp(φ) = TrD11 A\nH1 ×H2\n\nThis equality is a consequence of the following general result [23]:\nbi ∈\nLet p ∈ S(H) with the (complex) covariance operator D and let A\nLs (H). Then\nZ\nb1 TrD A\nb2 + TrD A\nb2 D A\nb1 .\nfA1 (φ)fA2 (φ)dp(φ), = TrD A\n(27)\nH\n\nSummary on coincidence probability: Prequantum classical field\nmodel with threshold and properly calibrated detectors violates predictions\nof standard classical and semiclassical models, cf. [], and gives the prediction compatible with known experimental data. More detailed experiments of\nGrangier's type with monitoring of the dependence of g (2) (0) on the detection\nthreshold and source's brightness are on demand.\n\nReferences\n[1] Bell J. Speakable and Unspeakable in Quantum Mechanics. Cambridge\nUniv. Press, Cambridge, 1987.\n[2] L. de Broglie, Recherches sur la thorie des quanta (Researches on the\nquantum theory), Thesis, Paris, 1924.\n[3] E. Schrödinger, Naturwissenschaften 23, 807; 823; 844 (1935)\n[4] A. Einstein and L. Infeld, Evolution of Physics: The Growth of Ideas\nfrom Early Concepts to Relativity and Quanta. (Simon and Schuster,\n1961)\n[5] W. E. Lamb, The Interpretation of Quantum Mechanics. (Edited and\nannotated by Mehra, Ja.) (Rinton Press, Inc., Princeton, 2001)\n12\n\n\f[6] A. Lande, New Foundations of Quantum Mechanics. (Cambridge Univ.\nPress, Cambridge, 1965)\n[7] H. H. Louisell, Quantum Statistical Properties of Radiation. (New York,\nJ. Wiley, 1973)\n[8] L. Mandel and E. Wolf, Optical Coherence and Quantum Optics. (Cambridge, Cambridge University Press, 1995)\n[9] L. De la Pena and A. Cetto, The Quantum Dice: An Introduction to\nStochastic Electrodynamics. (Dordrecht, Kluwer, 1996)\n[10] T. Boyer, A brief survey of stochastic electrodynamics. Foundations of\nRadiation Theory and Quantum Electrodynamics ed Barut A (New York:\nPlenum), p. 141 (1980)\n[11] D. C. Cole, A. Rueda, K. Danley, Phys. Rev. A 63 054101 (2001)\n[12] G. Grössing, Physica A: Statistical Mechanics and its Applications, 388,\n811-823 (2009).\n[13] G. Grössing, J. M. Pascasio, H. Schwabl, Found. Phys., 41, 1437-1453\n(2011).\n[14] Th. Nieuwenhuizen, Classical phase space density for relativistic electron\nQuantum Theory: Reconsideration of Foundations-3 (Ser. Conference\nProceedings vol 810) (Melville, NY: American Institute of Physics) p.\n198 (2006)\n[15] A. Aspect, Three experimental tests of Bell inequalities by the measurement of polarization correlations between photons, PhD Thesis 2674(\nOrsay), 1983 (In French).\n[16] Zeilinger A. Dance of the Photons: From Einstein to Quantum Teleportation. Farrar, Straus and Giroux, New-York, 2010.\n[17] G. Weihs, An experiment to test Bells inequality under Einstein locality.\nPhD Thesis, University of Innsbruck, 1999 (In German).\n[18] L. Accardi, G. Adenier, C. A. Fuchs, G. Jaeger, A. Khrennikov, J.-A.\nLarsson, S. Stenholm (eds.), Foundations of Probability and Physics5, American Institute of Physics, Ser. Conference Proceedings 1101,\nMelville, NY (2009)\n\n13\n\n\f[19] G. Adenier, A. Khrennikov, P. Lahti, V. I. Manko, and Th.M. Nieuwenhuizen (eds.), Quantum theory: reconsideration of foundations–4, American Institute of Physics, Ser. Conference Proceedings 962, Melville, NY\n(2008)\n[20] P. Grangier, Etude expérimentale de propriétés non-classiques de la\nlumière: interférence à un seul photon. Université de Paris-Sud, Centre D'Orsay (1986)\n[21] P. Grangier, G. Roger, and A. Aspect, EPL 1, 173 (1986)\n[22] M. Beck, J. Opt. Soc. Am. B 24, 2972-2978.\n[23] A. Khrennikov, J. Phys. A: Math. Gen. 38, 9051 (2005; Found. Phys.\nLetters 18, 637 (2006); Physics Letters A 357, 171 (2006); Found. Phys.\nLett. 19, 299 (2006); Nuovo Cimento B 121, 505 (2006); A. Khrennikov,\nEPL 88, 40005.1 (2009); Europhysics Lett. 90, art-number 40004 (2010);\nJ. of Russian Laser Research, 31 (2), 191(2010)\n[24] A. Khrennikov, M. Ohya, and N. Watanabe, J. Russian Laser Research\n31, 462(2010)\n[25] A. Khrennikov, Contextual approach to quantum formalism, Springer,\nBerlin-Heidelberg-New York, 2009.\n[26] A. Khrennikov, Quantum probabilities and violation of CHSH-inequality\nfrom classical random signals and threshold type properly calibrated\ndetectors, arXiv:1111.1907v2 [quant-ph].\n[27] S. M. Ritov, Introduction to Statistical Radiophysics. (Nauka, Fizmatlit,\nMoscow, 1966).\n[28] A. Khrennikov, To quantum averages through asymptotic expansion of\nclassical averages on infinite-dimensional space. J. Math. Phys., 48 (1),\nArt. No. 013512 (2007).\n\n14\n\n\f"}