{"id": "http://arxiv.org/abs/1110.4579v3", "guidislink": true, "updated": "2011-11-10T10:30:32Z", "updated_parsed": [2011, 11, 10, 10, 30, 32, 3, 314, 0], "published": "2011-10-20T16:59:15Z", "published_parsed": [2011, 10, 20, 16, 59, 15, 3, 293, 0], "title": "Development and validation of a 64 channel front end ASIC for 3D\n  directional detection for MIMAC", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1110.5526%2C1110.0014%2C1110.4579%2C1110.5565%2C1110.5156%2C1110.3429%2C1110.4102%2C1110.1584%2C1110.1532%2C1110.4119%2C1110.6124%2C1110.4865%2C1110.4433%2C1110.5447%2C1110.6430%2C1110.5033%2C1110.4111%2C1110.0492%2C1110.6449%2C1110.3894%2C1110.5082%2C1110.6123%2C1110.5141%2C1110.5174%2C1110.3573%2C1110.1206%2C1110.1924%2C1110.5444%2C1110.6155%2C1110.5274%2C1110.0222%2C1110.5571%2C1110.3119%2C1110.0241%2C1110.4036%2C1110.1548%2C1110.4174%2C1110.1578%2C1110.4296%2C1110.4625%2C1110.1796%2C1110.6066%2C1110.3485%2C1110.1418%2C1110.2790%2C1110.1326%2C1110.5227%2C1110.1508%2C1110.5771%2C1110.2324%2C1110.5090%2C1110.6263%2C1110.5836%2C1110.4320%2C1110.0292%2C1110.2946%2C1110.5718%2C1110.3471%2C1110.4552%2C1110.1281%2C1110.0100%2C1110.0003%2C1110.0068%2C1110.2869%2C1110.3872%2C1110.3793%2C1110.4772%2C1110.2929%2C1110.2186%2C1110.2247%2C1110.0748%2C1110.4144%2C1110.1878%2C1110.4139%2C1110.3299%2C1110.6610%2C1110.6500%2C1110.4015%2C1110.3926%2C1110.3562%2C1110.5050%2C1110.3882%2C1110.0891%2C1110.0574%2C1110.3333%2C1110.3697%2C1110.4392%2C1110.0316%2C1110.4926%2C1110.0369%2C1110.1648%2C1110.3327%2C1110.1200%2C1110.1457%2C1110.0463%2C1110.6755%2C1110.1482%2C1110.5939%2C1110.2696%2C1110.2925%2C1110.4982&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Development and validation of a 64 channel front end ASIC for 3D\n  directional detection for MIMAC"}, "summary": "A front end ASIC has been designed to equip the {\\mu}TPC prototype developed\nfor the MIMAC project, which requires 3D reconstruction of low energy particle\ntracks in order to perform directional detection of galactic Dark Matter. Each\nASIC is able to monitor 64 strips of pixels and provides the \"Time Over\nThreshold\" information for each of those. These 64 digital informations,\nsampled at a rate of 50 MHz, can be transferred at 400MHz by eight LVDS serial\nlinks. Eight ASIC were validated on a 2x256 strips of pixels prototype.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1110.5526%2C1110.0014%2C1110.4579%2C1110.5565%2C1110.5156%2C1110.3429%2C1110.4102%2C1110.1584%2C1110.1532%2C1110.4119%2C1110.6124%2C1110.4865%2C1110.4433%2C1110.5447%2C1110.6430%2C1110.5033%2C1110.4111%2C1110.0492%2C1110.6449%2C1110.3894%2C1110.5082%2C1110.6123%2C1110.5141%2C1110.5174%2C1110.3573%2C1110.1206%2C1110.1924%2C1110.5444%2C1110.6155%2C1110.5274%2C1110.0222%2C1110.5571%2C1110.3119%2C1110.0241%2C1110.4036%2C1110.1548%2C1110.4174%2C1110.1578%2C1110.4296%2C1110.4625%2C1110.1796%2C1110.6066%2C1110.3485%2C1110.1418%2C1110.2790%2C1110.1326%2C1110.5227%2C1110.1508%2C1110.5771%2C1110.2324%2C1110.5090%2C1110.6263%2C1110.5836%2C1110.4320%2C1110.0292%2C1110.2946%2C1110.5718%2C1110.3471%2C1110.4552%2C1110.1281%2C1110.0100%2C1110.0003%2C1110.0068%2C1110.2869%2C1110.3872%2C1110.3793%2C1110.4772%2C1110.2929%2C1110.2186%2C1110.2247%2C1110.0748%2C1110.4144%2C1110.1878%2C1110.4139%2C1110.3299%2C1110.6610%2C1110.6500%2C1110.4015%2C1110.3926%2C1110.3562%2C1110.5050%2C1110.3882%2C1110.0891%2C1110.0574%2C1110.3333%2C1110.3697%2C1110.4392%2C1110.0316%2C1110.4926%2C1110.0369%2C1110.1648%2C1110.3327%2C1110.1200%2C1110.1457%2C1110.0463%2C1110.6755%2C1110.1482%2C1110.5939%2C1110.2696%2C1110.2925%2C1110.4982&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "A front end ASIC has been designed to equip the {\\mu}TPC prototype developed\nfor the MIMAC project, which requires 3D reconstruction of low energy particle\ntracks in order to perform directional detection of galactic Dark Matter. Each\nASIC is able to monitor 64 strips of pixels and provides the \"Time Over\nThreshold\" information for each of those. These 64 digital informations,\nsampled at a rate of 50 MHz, can be transferred at 400MHz by eight LVDS serial\nlinks. Eight ASIC were validated on a 2x256 strips of pixels prototype."}, "authors": ["J. P. Richer", "O. Bourrion", "G. Bosson", "O. Guillaudin", "F. Mayet", "D. Santos"], "author_detail": {"name": "D. Santos"}, "author": "D. Santos", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1088/1748-0221/6/11/C11016", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1110.4579v3", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1110.4579v3", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "proceedings of TWEPP-11, Vienna, Austria, 26-30 September 2011", "arxiv_primary_category": {"term": "astro-ph.IM", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "astro-ph.IM", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1110.4579v3", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1110.4579v3", "journal_reference": "2011 JINST 6 C11016", "doi": "10.1088/1748-0221/6/11/C11016", "fulltext": "Preprint typeset in JINST style - HYPER VERSION\n\narXiv:1110.4579v3 [astro-ph.IM] 10 Nov 2011\n\nDevelopment and validation of a 64 channel front\nend ASIC for 3D directional detection for MIMAC\n\nJ.P. Richera , O. Bourriona∗, G. Bossona , O. Guillaudina , F. Mayeta , D. Santosa .\na Laboratoire\n\nde Physique Subatomique et de Cosmologie,\nUniversité Joseph Fourier Grenoble 1,\nCNRS/IN2P3, Institut Polytechnique de Grenoble,\n53, rue des Martyrs, Grenoble, France\nE-mail: olivier.bourrion@lpsc.in2p3.fr\n\nA BSTRACT: A front end ASIC has been designed to equip the μTPC prototype developed for the\nMIMAC project, which requires 3D reconstruction of low energy particle tracks in order to perform\ndirectional detection of galactic Dark Matter. Each ASIC is able to monitor 64 strips of pixels and\nprovides the \"Time Over Threshold\" information for each of those. These 64 digital informations,\nsampled at a rate of 50 MHz, can be transferred at 400 MHz by eight LVDS serial links. Eight\nASIC were validated on a 2 × 256 strips of pixels prototype.\nK EYWORDS : Electronic detector readout concepts (gas, liquid); Particle tracking detectors\n(Gaseous detectors);Front-end electronics for detector readout.\n\n∗ Corresponding\n\nauthor.\n\n\fContents\n1.\n\nIntroduction\n\n1\n\n2.\n\nMIMAC detector readout principle\n\n1\n\n3.\n\nFront end ASIC\n3.1 Requirements\n3.2 Design overview\n3.3 Input stage\n3.4 Serializer\n\n2\n2\n3\n4\n6\n\n4.\n\nASIC Performances\n\n7\n\n5.\n\nConclusion\n\n8\n\n1. Introduction\nDirectional detection of dark matter is known to be a promising search strategy of galactic Dark\nMatter [1, 2]). Recent studies have shown that, within the framework of dedicated statistical data\nanalysis, a low exposure directional detector could lead either to a high significance discovery of\ngalactic Dark Matter [3, 4] or to a conclusive exclusion [5]. A gaseous micro-TPC matrix, filled\nwith either 3 He, CF4 or C4 H10 has been developed within the MIcro TPC MAtrix of Chambers\n(MIMAC) project [6]. To demonstrate the relevance of the concept, a specific front-end ASIC and\na dedicated acquisition electronic were developed in order to equip a prototype detector featuring\nan anode of 10.85 × 10.85 cm2 where 2 × 256 strips are monitored. The ASIC is designed to allow\nan auto-triggered acquisition electronic which uses embedded processing to reduce data transfer to\nits useful part only, i.e. decoded coordinates of hit tracks and corresponding energy measurements.\n\n2. MIMAC detector readout principle\nAs shown in figure 1, the MIMAC prototype μTPC is composed of a pixelized anode featuring\ntwo orthogonal series of 256 strips of pixels (X and Y) [7] and a micromesh grid defining the\ndelimitation between the amplification (grid to anode) and the drift space (cathode to grid). Each\nstrip of pixels is monitored by a current preamplifier and the fired pixel coordinate is obtained\nby using the coincidence between the X and Y strips (the pixel pitch is 424 μm). A coincidence is\ndefined as having at least one strip of pixels fired in each direction (X, Y) at the same sampling time.\nThe ionization energy of the recoil particle is obtained by instrumenting the micromesh grid with a\nCharge Sensitive Preamplifier (CSP). As illustrated in figure 2, the coordinates in the anode plane\n\n–1–\n\n\fparticle\n\nRecoil ionization\ntrack\ndrift space\n\nE\n\ne-\n\n1 kV/cm\n\n20 cm\n\ncathode\n\nmicromesh grid\nE ~ 80 kV/cm\n\namplification gap\nanode\n\nCurrent\npreamplifier\n\n424 μm\n\nparticle\n\nstrip of pixel readout\n\nFigure 1. Schematic of the MIMAC micro-TPC using a micromegas composed of a pixelized anode featuring two orthogonal series of 256 strips of pixels and a micromesh grid defining the delimitation between the\namplification (grid to anode) and the drift space (cathode to grid).\n\n(X, Y) are reconstructed by collecting primary electrons produced in the drift region. Knowing\nthe electron drift velocity, the third dimension (Z) is obtained by sampling the anode signal every\n20 ns. Note, that due to the multiplexed readout of the anode, each time slice picture is rectangular.\n\nt=60 ns\n\nt=40 ns\n\nt=20 ns\n\nt=0 ns\n\nFigure 2. The coordinates in the anode plane (X, Y) are reconstructed by collecting primary electrons\nproduced in the drift region. Knowing the electron drift velocity, the third dimension (Z) is obtained by\nsampling the anode signal every 20 ns. Due to the multiplexed readout of the anode, each time slice picture\nis rectangular.\n\n3. Front end ASIC\n3.1 Requirements\nIn the early stage of the project it was decided to design an ASIC in order to be able to fulfill\nthe final objective, which is to equip about 2500 chambers of 1024 strips of pixels (512+512).\n\n–2–\n\n\fThis minimizes space requirement and power demand while allowing cost reduction on a large\nscale. After going through a first prototype phase, 16 channels ASICs equipping a 2 × 96 strips of\npixels chamber [8], a 64 channel version was designed. This was determined to be a good balance\nbetween integration scale on one side and complexity, fabrication yield and available packages on\nthe other side. To be able to recover the third coordinate (Z) of the track, a fast switching current\ncomparator having a threshold as low as 200 nA must be designed in order to have a precise time\nover threshold measurement of each current preamplifier output. This requirement is driven by\nthe worst case where the recoil energy is as low as 500 eV in a chamber having its gain limited\nto 3000 and where the diffusion is maximized (i.e interaction at the farthest of the anode) and\nthe recoil track is parallel to the anode (the charge deposit is distributed along different strips).\nAnother strong system requirement is to minimize the board level interconnection to allow an easy\nintegration with a readout system.\n3.2 Design overview\n\n16 channels\nStrip\nof pixels\n\nDAC\n\nX15\n\nLSB\n200 nA\n\ncomp\nAuto zero\namplifier\n\ncurrent\npreamp\n\n5 bit\n\nDAC\n\nLSB\n200 nA\n\n50MHz\n\nSerial interface reference\n\nLVDS outputs\n\ncomp\nAuto zero\namplifier\n\ncurrent\npreamp\n\n8 bit\nserializer\n\nX15\n\n16 bit\n\nStrip\nof pixels\n\n8 bit\nserializer\n\nFigure 3 shows the block diagram of the front-end ASIC; it is composed of four groups of 16 channels. Each channel is composed of a current preamplifier having a gain of 15, a fast comparator\nand a 5 bit DAC for setting the threshold. A trade-off was made between the DAC resolution and\n\nClock 400 MHz\n\nPLL\n\nTo FPGA or microcontroller\n\nFigure 3. Front end ASIC block diagram. The 64 channels are decomposed in four groups of 16 channels.\nEach channel is composed of a current preamplifier having a gain of 15, a fast comparator and a 5 bit DAC\nfor setting the threshold. A serial link is used to configure the DAC. The comparator outputs are transferred\nserially.\n\nthe achievable preamplifier offset. The DAC dynamic range, and thus its design complexity, can\nbe greatly reduced by using an autozero preamplifier. This kind of amplifier measures periodically\n(every second) its offset during a few dozen μs and determines the compensation to apply to reduce the residual output offset. The 5 bit DAC is designed with a 200 nA LSB (input equivalent:\n13.3 nA).\nThe comparator outputs are sampled at a 50 MHz rate and serialized at 400 MHz, thereby reducing the interconnection by a factor of eight and diminishing the power consumption. The serial\noutputs rely on the Low Voltage Differential Signaling (LVDS) standard to lower the electronic\n\n–3–\n\n\fnoise. It should be noted that using the same reference clock allows synchronous sampling between ASICs. A slow serial link is implemented to allow ASIC configuration. With this link, it\nis possible to individually adjust the thresholds (DAC settings) and to enable/disable each channel\n(kill eventual dead channels, ...). Finally, the fixed training pattern is also provided via this link. It\nis used for the synchronization of the digital readout electronics with the high speed serial links.\n3.3 Input stage\nOriginally an energy measurement per group of sixteen channels (summing and shaping) has been\nimplemented in the first ASIC version [8]. Experimental results with the MIMAC detector showed\nthat this strategy is not efficient for low energy tracks, thus an instrumentation of the micro-mesh\ngrid with a Charge Sensitive Preamplifier is used to obtain the total energy signal. Due to this\ninitial choice, the input stage (figure 4) consists of a low noise charge preamplifier based on a\nfolded cascode structure. The integration current, flowing through the capacitor, is copied and\namplified with a gain of 15 to generate the input signal of the current comparator.\n\nFigure 4. Input stage schematic\n\nThis current comparator [9], used here as an amplifier, consists of a CMOS inverter equipped\nwith two cascode transistors used to decrease the influence of the input to output parasitic capacitor.\nAlso, for improving the comparator commutation speed, the CMOS inverter is kept in linear mode\nby the use of the two feedback transistors barely maintained \"OFF\" in the quiescent state (no input\ncurrent, no threshold applied). A common block of voltage dividers per group of 16 channels (figure 4), generates the four biasing voltages \"vnx\" and \"vpx\". In this common block, the transistors\ngeometries ratios were determined by simulation to obtain the optimal biasing values.\n\n–4–\n\n\fWhen a threshold current (provided by the 5 bit DAC) is applied (see node \"I_threshold\" in\nfigure 4), one of the two feedback transistors starts conducting and therefore allows the current flow.\nThen, when an input current higher than the current threshold is applied, the previously conducting\ntransistor is switched \"OFF\", the CMOS inverter toggles and the other feedback transistor starts\nconducting. The comparator therefore delivers a digital signal whose duration is equal to the current\nduration. In order to cope with the short duration signals (<20 ns), the channel output signal is\nthe output of an OR gate which is fed by the comparator output itself and by a programmable\nmonostable triggered by the same comparator output signal (figure 5).\n\nFigure 5. Simulation result showing the fast comparator commutation and the pulse lengthening for input\ncurrent lasting less than 20 ns. First curve shows the preamplifier input current, second curve shows the\npreamplifier output current. The two bottom curves show respectively the current comparator and OR gate\noutputs.\n\nIn order to be able to use this reduced resolution DAC, an auto-zero amplifier has been added\nfor minimizing the DC offset current in the output branch of the preamplifier, see results in figure 6.\nThis offset is essentially due to transistor mismatches. At a slow rate (1 Hz) the current output of\nthe preamplifier is disconnected from the discriminator and connected to one of the differential\namplifier inputs. The offset current charges or discharges a capacitor and the amplifier compares\nthe voltage capacitor to the DC input voltage of the current comparator. The offset correction is\napplied to the output branch via a current mirror and the \"control\" line. During the auto-zero DC\ncorrection, a certain isolation to the input signal has to be implemented in order to provide adequate\noffset cancellation. For this, series resistors and long channel transistors have been added. The gate\nvoltage \"V_ clamp\", which is accessible outside of the ASIC, provides an adjustment of the filtering\ntime constant.\n\n–5–\n\n\f25\n\nh1f\nEntries\n200\nMean\n-1180\nRMS\n4991\n\n20\n\nh1f\nEntries\n200\nMean\n-20.16\nRMS\n29.06\n\nDC offset distribution with autozero correction\nFrequency\n\nFrequency\n\nDC offset distribution without autozero correction\n\n25\n\n20\n15\n15\n10\n\n10\n\n5\n\n0\n\n5\n\n-15000\n\n-10000\n\n-5000\n\n0\n\n5000\n\n0\n\n10000\nCurrent (nA)\n\n-100\n\n-80\n\n-60\n\n-40\n\n-20\n\n0\n\n20\n40\nCurrent (nA)\n\nFigure 6. Offset current distributions without and with auto-zero correction.\n\n3.4 Serializer\nOne major difficulty of this front end ASIC is to get all the comparator outputs out of the chip.\nThis is a concern for several reasons. First, the interconnections have to be kept to a minimum in\norder to equip large detectors and second, the digital noise level induced by these outputs has to\nbe kept low. This last reason leads to the choice of LVDS differential outputs. The problem is that\nthe LVDS signaling requires two wires per connection and a relatively high power. The remedy to\nthis is to implement a serializer that will work eight times faster and thus time multiplex data into a\nsingle differential pair. Instead of providing the eight differential data at a rate of 50 MHz, the data\ncan be transferred on a single pair at a rate of 400 MHz, as shown in figure 7. The 400 MHz clock\nis generated by a Phase Locked Loop (PLL) circuit synchronized with the 50 MHz reference clock.\nUsing the same reference clock allows synchronous sampling between ASICs. This \"classical\"\nPLL structure [10] is composed of four blocks (VCO, charge pump, divider and phase detector).\nThe Voltage Control Oscillator (VCO) consists of a ring oscillator with seven \"starved\" inverters\nwhose delays are controlled by the charge pump delivered voltage. This charge pump is driven by\na phase detector used to compare the phase of the VCO output divided by eight with the reference\nclock. Due to the large capacitors required, the charge pump filter is implemented externally.\nThe LVDS transmitter and receiver are based on structures described in [11]. For testing and\nsynchronization purposes, a multiplexer is implemented just before the serializer. This enables the\nuser to select either the sending of a known fixed pattern or of the comparator outputs.\nRef clock\nComparator\nLSB\n\nD1(n-1)\n\nD0(n-1)\n\nD7(n)\n\nD6(n)\n\nD5(n)\n\nD4(n)\n\nD3(n)\n\nD2(n)\n\nD1(n)\n\nD0(n)\n\nComparator\nMSB\n\nD9(n-1)\n\nD8(n-1)\n\nD15(n)\n\nD14(n)\n\nD13(n)\n\nD12(n)\n\nD11(n)\n\nD10(n)\n\nD9(n)\n\nD8(n)\n\nRef clock cycle n-1\n\nRef clock cycle n\n\nD7(n+1)\n\nD6(n+1)\n\nD15(n+1) D14(n+1)\nRef clock cycle n+1\n\nFigure 7. Content of the two serial frames related to a group of sixteen channels.\n\n–6–\n\n\f4. ASIC Performances\nFigure 8 shows the typical DAC threshold and minimal threshold dispersion over one representative\nASIC, where the latter is determined by recording the current pulse amplitude required to trigger\na channel at a fixed DAC setting. The plot shows that the DAC levels are totally homogeneous but\nthat the effective thresholds have a few spikes remaining. This is explained by the offset correction\nefficiency dispersion between channels, which in turn has an influence on the minimum signal\ndetected at a given threshold. Figure 9 shows the minimal DAC threshold, above noise, in the\nMin signal detected (dac thres=3)\n\nh1f\nEntries\n64\nMean\n39.62\nRMS\n1.857\n\nFrequency\n\nFrequency\n\nDAC threshold dispersion (dac thres=3)\n\n18\n16\n\n18\n16\n\n14\n\n14\n\n12\n\n12\n\n10\n\n10\n\n8\n\n8\n\n6\n\n6\n\n4\n\n4\n\n2\n0\n30\n\nh1f\nEntries\n64\nMean\n126.2\nRMS\n78.89\n\n2\n32\n\n34\n\n36\n\n38\n\n40\n\n0\n0\n\n42\n44\n46\n48\n50\nThreshold current readout (nA)\n\n100\n\n200\n\n300\n\n400\n\n500\n600\nCurrent pulse (nA)\n\nFigure 8. Typical DAC threshold and minimal threshold dispersion over one representative ASIC.\n\nFrequency\n\ndetector. With the exception of a few spikes (∼10), the threshold values are fairly homogeneous and\nallow proper operation. All the values are below maximum threshold of 413 nA (31 × 200/15 nA).\n\nh1f\nEntries\n512\nMean\n6.109\nRMS\n2.047\n\n160\n140\n120\n100\n80\n60\n40\n20\n0\n2\n\n4\n\n6\n\n8\n\n10\n\n12\n\n14\n\n16\n\n18\n\n20\n22\nDAC value\n\nFigure 9. Minimum DAC threshold dispersion above noise, in the detector.\n\nThe ASIC was fabricated in austriamicrosystems BiCMOS-SiGe 350 nm process. It uses an\neffective area of 3.9 mm × 5.8 mm = 22 mm2 and requires a total power of 445 mW (110 mA at\n3.3 V, 55m A at 1.5 V). 110 ASICs have been packaged in TQFP144 and tested, the production\nyield was about 80%.\n\n–7–\n\n\f5. Conclusion\nEight ASICs (previous version 2) have been mounted on a specific board connected to a prototype\nμTPC composed of 2 × 256 strips of pixels [12]. Figure 10 shows two examples of detected recoil\ntracks. Position information is provided in a list of X/Y coordinates fired per time slice by the\nASIC readout electronics (X-Y projection shown on the left). Offline software is used to construct\nthe 3D display of the recoil track (3D track on the right).\n70 % CF3 + 30% CHF3\n55 mbar,\n170 V/cm\nFluorine candidate (50 keV)\n\n3D reconstruction\n\nHe + 5% iC4H10\n350 mbar,\n150 V/cm\nAlpha 5,5 MeV\n\nFigure 10. Sample of detected recoil tracks.\n\nReferences\n[1] D.N. Spergel, Phys. Rev. D37 (1988) 1353\n[2] S. Ahlen et al., Int. J. Mod. Phys. A25 (2010) 1\n[3] J. Billard et al., Phys. Lett. B691 (2010) 156-162\n[4] J. Billard, F. Mayet and D. Santos, Phys. Rev. D83 (2011) 075002\n[5] J. Billard, F. Mayet and D. Santos, Phys. Rev. D82 (2010) 055011\n[6] D. Santos et al., J. Phys. Conf. Ser. 65 (2007) 012012\n[7] F. J. Iguaz et al., 2011 JINST 6 P07002\n[8] J.P. Richer et al., Nucl. Instr. Meth. A620 (2010) 470-476\n[9] G. Linan-Cembrano, R. Del Rio-Fernandez, R. Dominguez-Castro, A. Rodriguez-Vasquez,\nElectronics Letter volume 33, issue 25 (1997) p2082-p2084\n[10] D. Dzahini, J. Pouxe, O. Rossetto, IEEE TNS 47 (2000) 3 839-843\n\n–8–\n\n\f[11] A. Boni, A. Pierazzi, D. Vecchi, IEEE J. of Solid State Circuits. 36 (2001) 4 706-711\n[12] O. Bourrion et al., proceedings of TWEPP-11, Vienna, Austria, 26-30 September 2011,\narXiv:1110.4348\n\n–9–\n\n\f"}