{"id": "http://arxiv.org/abs/0903.3454v1", "guidislink": true, "updated": "2009-03-20T06:13:30Z", "updated_parsed": [2009, 3, 20, 6, 13, 30, 4, 79, 0], "published": "2009-03-20T06:13:30Z", "published_parsed": [2009, 3, 20, 6, 13, 30, 4, 79, 0], "title": "Crossover from the vortex state to the Fulde-Ferrell-Larkin-Ovchinnikov\n  state in quasi-two-dimensional superconductors", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0903.0909%2C0903.1242%2C0903.0216%2C0903.0989%2C0903.4847%2C0903.0955%2C0903.3454%2C0903.0417%2C0903.3370%2C0903.1817%2C0903.0814%2C0903.3544%2C0903.3595%2C0903.0527%2C0903.0597%2C0903.5373%2C0903.2837%2C0903.2553%2C0903.5161%2C0903.2364%2C0903.1638%2C0903.0774%2C0903.2566%2C0903.4165%2C0903.3077%2C0903.3502%2C0903.3818%2C0903.4794%2C0903.2163%2C0903.4757%2C0903.1861%2C0903.0109%2C0903.0803%2C0903.1094%2C0903.0927%2C0903.5522%2C0903.1523%2C0903.4726%2C0903.3938%2C0903.3527%2C0903.0167%2C0903.3800%2C0903.2766%2C0903.0018%2C0903.1039%2C0903.2118%2C0903.4413%2C0903.1042%2C0903.5418%2C0903.2100%2C0903.4251%2C0903.4478%2C0903.3186%2C0903.3961%2C0903.2496%2C0903.1105%2C0903.3480%2C0903.2714%2C0903.3445%2C0903.4677%2C0903.0481%2C0903.2835%2C0903.5370%2C0903.0875%2C0903.1536%2C0903.3662%2C0903.0910%2C0903.0173%2C0903.0753%2C0903.1159%2C0903.3409%2C0903.4896%2C0903.5399%2C0903.3132%2C0903.2941%2C0903.3307%2C0903.5170%2C0903.4532%2C0903.3941%2C0903.3466%2C0903.4178%2C0903.4524%2C0903.4594%2C0903.1431%2C0903.0536%2C0903.0313%2C0903.0468%2C0903.1982%2C0903.2741%2C0903.3305%2C0903.0969%2C0903.2645%2C0903.4177%2C0903.4029%2C0903.0883%2C0903.0445%2C0903.3679%2C0903.2296%2C0903.3665%2C0903.2721%2C0903.2552&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Crossover from the vortex state to the Fulde-Ferrell-Larkin-Ovchinnikov\n  state in quasi-two-dimensional superconductors"}, "summary": "We examine the coexistence of the vortex state and the\nFulde-Ferrell-Larkin-Ovchinnikov (FFLO) state in quasi-two-dimensional type-II\nsuperconductors and the crossover from the coexistence state to the pure FFLO\nstate when the Maki parameter \\alpha increases. The pure FFLO state,\ncharacterized by finite center-of-mass momenta q \\ne 0 of Cooper pairs occurs\nin the two-dimensional limit, when the magnetic field is parallel to the\nconductive plane. The vectors q are determined from the Fermi-surface structure\nand pairing anisotropy, and become finite below a temperature T^*. In\nquasi-two-dimensions, because of the orbital pair-breaking effect, the\ncoexistence state characterized by (n,q//) occurs, where n and q// denote the\nLandau level index of the vortex state and the wave number of the additional\nFFLO modulation along the magnetic field. We obtain the \\alpha dependence of\nthe upper critical field by numerical calculations. The upper critical field\nexhibits a cascade curve in the H-T phase diagram. It is analytically shown\nthat n diverges in the two-dimensional limit \\alpha \\to \\infty below T^*. In\nthis limit, the upper critical field equation of the coexistence state is\nreduced to that of the FFLO state. A relation between n of the coexistence\nstate and q_{\\perp} of the pure FFLO state is obtained, where q_{\\perp} denotes\nthe component of q perpendicular to the magnetic field. It is found that the\npure FFLO state is nothing but the vortex state with infinitely large n as is\nknown in two-dimensional superconductors in a tilted magnetic field. The vortex\nstate with large n can be regarded as the FFLO state with non-zero q_{\\perp} in\nthree dimensions.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0903.0909%2C0903.1242%2C0903.0216%2C0903.0989%2C0903.4847%2C0903.0955%2C0903.3454%2C0903.0417%2C0903.3370%2C0903.1817%2C0903.0814%2C0903.3544%2C0903.3595%2C0903.0527%2C0903.0597%2C0903.5373%2C0903.2837%2C0903.2553%2C0903.5161%2C0903.2364%2C0903.1638%2C0903.0774%2C0903.2566%2C0903.4165%2C0903.3077%2C0903.3502%2C0903.3818%2C0903.4794%2C0903.2163%2C0903.4757%2C0903.1861%2C0903.0109%2C0903.0803%2C0903.1094%2C0903.0927%2C0903.5522%2C0903.1523%2C0903.4726%2C0903.3938%2C0903.3527%2C0903.0167%2C0903.3800%2C0903.2766%2C0903.0018%2C0903.1039%2C0903.2118%2C0903.4413%2C0903.1042%2C0903.5418%2C0903.2100%2C0903.4251%2C0903.4478%2C0903.3186%2C0903.3961%2C0903.2496%2C0903.1105%2C0903.3480%2C0903.2714%2C0903.3445%2C0903.4677%2C0903.0481%2C0903.2835%2C0903.5370%2C0903.0875%2C0903.1536%2C0903.3662%2C0903.0910%2C0903.0173%2C0903.0753%2C0903.1159%2C0903.3409%2C0903.4896%2C0903.5399%2C0903.3132%2C0903.2941%2C0903.3307%2C0903.5170%2C0903.4532%2C0903.3941%2C0903.3466%2C0903.4178%2C0903.4524%2C0903.4594%2C0903.1431%2C0903.0536%2C0903.0313%2C0903.0468%2C0903.1982%2C0903.2741%2C0903.3305%2C0903.0969%2C0903.2645%2C0903.4177%2C0903.4029%2C0903.0883%2C0903.0445%2C0903.3679%2C0903.2296%2C0903.3665%2C0903.2721%2C0903.2552&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We examine the coexistence of the vortex state and the\nFulde-Ferrell-Larkin-Ovchinnikov (FFLO) state in quasi-two-dimensional type-II\nsuperconductors and the crossover from the coexistence state to the pure FFLO\nstate when the Maki parameter \\alpha increases. The pure FFLO state,\ncharacterized by finite center-of-mass momenta q \\ne 0 of Cooper pairs occurs\nin the two-dimensional limit, when the magnetic field is parallel to the\nconductive plane. The vectors q are determined from the Fermi-surface structure\nand pairing anisotropy, and become finite below a temperature T^*. In\nquasi-two-dimensions, because of the orbital pair-breaking effect, the\ncoexistence state characterized by (n,q//) occurs, where n and q// denote the\nLandau level index of the vortex state and the wave number of the additional\nFFLO modulation along the magnetic field. We obtain the \\alpha dependence of\nthe upper critical field by numerical calculations. The upper critical field\nexhibits a cascade curve in the H-T phase diagram. It is analytically shown\nthat n diverges in the two-dimensional limit \\alpha \\to \\infty below T^*. In\nthis limit, the upper critical field equation of the coexistence state is\nreduced to that of the FFLO state. A relation between n of the coexistence\nstate and q_{\\perp} of the pure FFLO state is obtained, where q_{\\perp} denotes\nthe component of q perpendicular to the magnetic field. It is found that the\npure FFLO state is nothing but the vortex state with infinitely large n as is\nknown in two-dimensional superconductors in a tilted magnetic field. The vortex\nstate with large n can be regarded as the FFLO state with non-zero q_{\\perp} in\nthree dimensions."}, "authors": ["Hiroshi Shimahara"], "author_detail": {"name": "Hiroshi Shimahara"}, "author": "Hiroshi Shimahara", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1103/PhysRevB.80.214512", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/0903.3454v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0903.3454v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "8 pages, 4 figures", "arxiv_primary_category": {"term": "cond-mat.supr-con", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cond-mat.supr-con", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0903.3454v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0903.3454v1", "journal_reference": null, "doi": "10.1103/PhysRevB.80.214512", "fulltext": "APS/123-QED\n\nCrossover from the vortex state to the Fulde–Ferrell–Larkin–Ovchinnikov state in\nquasi-two-dimensional superconductors\nHiroshi Shimahara\n\narXiv:0903.3454v1 [cond-mat.supr-con] 20 Mar 2009\n\nDepartment of Quantum Matter Science, ADSM,\nHiroshima University, Higashi-Hiroshima 739-8530, Japan\n(Dated: June 7, 2018)\nWe examine the coexistence of the vortex state and the Fulde–Ferrell–Larkin–Ovchinnikov\n(FFLO) state in quasi-two-dimensional type-II superconductors and the crossover from the coexistence state to the pure FFLO state when the Maki parameter α increases. The pure FFLO state,\ncharacterized by finite center-of-mass momenta q 6= 0 of Cooper pairs occurs in the two-dimensional\nlimit, when the magnetic field is parallel to the conductive plane. The vectors q are determined from\nthe Fermi-surface structure and pairing anisotropy, and become finite below a temperature T ∗ . In\nquasi-two-dimensions, because of the orbital pair-breaking effect, the coexistence state characterized\nby (n, qk ) occurs, where n and qk denote the Landau level index of the vortex state and the wave\nnumber of the additional FFLO modulation along the magnetic field. We obtain the α dependence\nof the upper critical field by numerical calculations. The upper critical field exhibits a cascade curve\nin the H–T phase diagram. It is analytically shown that n diverges in the two-dimensional limit\nα → ∞ below T ∗ . In this limit, the upper critical field equation of the coexistence state is reduced\nto that of the FFLO state. A relation between n of the coexistence state and q⊥ of the pure FFLO\nstate is obtained, where q⊥ denotes the component of q perpendicular to the magnetic field. It is\nfound that the pure FFLO state is nothing but the vortex state with infinitely large n as is known\nin two-dimensional superconductors in a tilted magnetic field. The vortex state with large n can be\nregarded as the FFLO state with non-zero q⊥ in three dimensions.\nPACS numbers: 74.81.-g 74.25.-q, 74.25.Op,\n\nI.\n\nINTRODUCTION\n\nIn type-II superconductors, an applied magnetic field\ndestroys the superconductivity by two kinds of pairbreaking effects: the orbital magnetic and Pauli paramagnetic pair-breaking effects [1]. We can define the pure\norbital limit Hc20 and the Pauli paramagnetic limit HP ,\nwhich are theoretically obtained by taking into account\nonly the orbital effect and paramagnetic\neffect, respec√\ntively. The Maki parameter α ≡ 2Hc20 /HP expresses\nthe strength ratio of the two pair-breaking effects.\nIn conventional metal superconductors, the orbital\npair-breaking effect dominates the system (Hc20 ≪ HP )\nbecause of the large Fermi velocity. Partial destruction\nof the superconductivity due to the orbital effect creates\nvortexes, which form a lattice below the upper critical\nfield, and causes the order parameter to become nonuniform.\nIn contrast, in purely Pauli limited superconductors,\nanother type of nonuniform superconductivity has been\nproposed by Fulde and Ferrell [2] and Larkin and Ovchinnikov [3]. In magnetic fields, the Fermi surfaces of the\nup- and down-spin electrons are displaced due to the Zeeman energy. If the up- and down-spin electrons on the\ndisplaced Fermi surfaces form Cooper pairs, they should\nhave a finite center-of-mass momentum. The superconducting state of such Cooper pairs is called the Fulde–\nFerrell–Larkin–Ovchinnikov (FFLO) state. It is easily\nverified that the finite center-of-mass momentum results\nin spatial modulations and nodes of the order parameter in real space. As a result, spin polarization energy\n\nis gained by the depaired electrons near the nodes, while\nthe condensation energy is lost.\nTherefore, a necessary condition for the occurrence of\nthe FFLO state is that the superconductivity survives in\nhigh fields such that μe H ∼ ∆0 , for which the loss of\ncondensation energy due to modulation of the order parameter is compensated by a gain in polarization energy.\nHere, μe and ∆0 denote the electron magnetic moment\nand the zero field energy gap of the superconductivity.\nThis condition can be expressed as Hc2 ∼ HP , where\nHc2 denotes the upper critical field, because HP ∼ ∆0 .\nTherefore, the orbital pair-breaking effect needs to be\nvery weak for the FFLO state to occur.\nThis is one of the reasons why the FFLO state has not\nbeen observed in conventional metal superconductors.\nGruenberg and Gunther found that the FFLO state occurs only when the Maki parameter α is large (α >\n∼ 1.8) in\nisotopic superconductors [4]. Such a large Maki parameter is usually difficult to realize in alloy type II superconductors, though it is achievable in some exotic superconductors, such as organic superconductors [5], heavy\nfermion superconductors [6], and oxide superconductors,\nbecause of their narrow electron bands, large effective\nmasses, and quasi-two-dimensionality.\nBecause of the orbital pair-breaking effect, and the formation of the vortex lattice state, the dependence of the\norder parameter on the spatial coordinates perpendicular to the magnetic field is described by the superposition of the Abrikosov functions. Therefore, there may\nbe additional modulations due to the FFLO state only\nin the direction parallel to the magnetic field, as Gruenberg and Gunther have proposed [4]. We examined the\n\n\f2\ncoexistence of the vortex states with higher Landau level\nindexes n and the FFLO state in d-wave superconductors in our previous paper [7], and obtained phase diagrams for some cases. Recently, in a model of the quasitwo-dimensional heavy fermion superconductor CeCoIn5 ,\nAdachi and Ikeda have shown that the first-order phasetransition to a coexistence state occurs taking into account the higher Landau level indexes [8].\nBulaevskii examined film superconductors at T = 0\nin tilted magnetic fields, and obtained cascade transitions between the states with different n's when the direction of the magnetic field changes. It was shown\nthat the upper critical field tends to approach that of\nthe FFLO state when the magnetic field approaches the\nparallel direction. Buzdin and Brison also obtained cascade transitions at finite temperatures in two- and threedimensional isotropic superconductors [9]. We extended\nBulaevskii's theory to finite temperatures in s- and dwave superconductors [10]. We also reproduced the cascade transitions solving the gap equation, and clarified\nthe behavior in the limit of a parallel field. We analytically demonstrated that the Landau level index n of the\nvortex state diverges in the temperatures region where\nthe FFLO state occurs in the limit. As a result, the\nenvelope of the cascade transition lines approaches the\nFFLO critical field when the field orientation approaches\nthe parallel direction. The coexistence state is continuously reduced to the pure FFLO state. We obtained a\nrelation between n and the FFLO vector q, which connects the vortex states and the FFLO state in the limit.\nThe present study extends our previous theory to the\ncoexistence state in three dimensions.\nNear critical fields, the order parameter of the pure\nFFLO state can be expressed by a linear combination\nof exponential functions exp[iqm * r], where qm are the\ndegenerate FFLO wave vectors with optimum values determined from the structures of the Fermi surfaces and\nthe pairing interactions, and the temperature. The free\nenergies of such states were compared in a three dimensional isotropic system by Larkin and Ovchinnikov [3],\nMatsuo et al. [11], Bowers and Rajagopal [12], and Mora\nand Combescot [13], and in two-dimensional systems by\nthe author [14] and Mora and Combescot [15]. Larkin\nand Ovchinnikov [3] showed that the state expressed\nby ∆(r) ∼ cos(q * r) has a lower free energy than the\nstate ∆(r) ∼ exp[iq * r] proposed by Fulde and Ferrell.\nThe author has shown that the square, triangular, and\nhexagonal states have lower free energies than the state\n∆(r) ∼ cos(q * r) at low temperatures in two dimensions [14]. Mora and Combescot have shown that the\nstates described many cosine functions have lower free\nenergies than the state ∆(r) ∼ cos(q * r) in three dimensions when the first-order phase transition is taken into\naccount [13]. The possibility of the first-order transition\nwas addressed also by Larkin and Ovchinnikov [3].\nWhen the magnetic field is not oriented in the optimum\ndirection of q of the pure FFLO state, or when more\nthan two qm 's contribute to the linear combination for\n\nthe pure FFLO state, it may appear that the coexistence\nstate is not reduced to the pure FFLO state in the limit\nα → ∞, because in the coexistence state q can have a\nnonzero component only in the direction of the magnetic\nfield. In actuality, however, the Landau level index n\nof the coexistence state diverges and the components of\nq perpendicular to the magnetic field are realized [16].\nThis behavior is analogous to that in two-dimensional\nsystems in a tilted magnetic field. In the present paper,\nwe demonstrate this behavior in quasi-two-dimensional\nsystems by an analytical proof and concrete numerical\ncalculations.\nFor simplicity, we adopt an effective mass model\nassuming that the first-order transition is suppressed,\nto demonstrate the continuity between the coexistence\nstates and the pure FFLO state. In actuality, in the effective mass model with very large α, the first-order transition would occur at a slightly higher field than that of\nthe second-order transition [13]. In this case, the secondorder transition curve below the first-order transition\ncurve is regarded as that of the metastable transition,\nwhich can be realized when the system is supercooled.\nRecently, we have obtained a result which also suggests that the Landau level index n increases with α in\nan anisotropic Ginzburg–Landau model near the tricritical point [17]. Comparing the phase diagrams with and\nwithout the orbital effect, we have found that the areas\nof the coexistence states with n > 0 in the former phase\ndiagrams correspond to the areas of the pure FFLO state\nwith q⊥ 6= 0 in the latter phase diagrams.\nIn section 2, we present our formulation. In sections\n3 and 4, we examine the pure FFLO state and the coexistence state, respectively. In section 4, we show the\ncrossover from the pure FFLO state to the coexistence\nstate and the limit α → ∞. In section 5, we show the\nnumerical result for finite temperatures. In section 6, we\nsummarize and discuss the results.\n\nII.\n\nFORMULATION\n\nWe examine a model described by the Hamiltonian\nH = H 0 + Hm + H ′ ,\n\n(1)\n\nwith\nH0 =\n\nXZ\n\nd3 r ψσ† (r)\n\nμσ\n\nHm =\n\ne \u00012\n∂\n1\n− Aμ ψσ (r), (2)\n−i~\n2mμ\n∂xμ c\n\nXZ\n\nd3 r σh ψσ† (r)ψσ (r),\n\n(3)\n\nσ\n\n′\n\nH =\n\nZ\n\n3\n\nd r\n\nZ\n\nd3 r ′ ψ↑† (r)ψ↑ (r)V (r − r ′ )ψ↓† (r ′ )ψ↓ (r ′ ).\n(4)\n\n\f3\nHere, we have defined the effective masses m1 = mx ,\nm2 = my , m3 = mz , Zeeman field h = μe |H|, and vector potential A, where μe and H denote the magnitude\nof the electron magnetic moment and the magnetic field\nH = rotA. We consider pairing interactions of the form\nV (p, p′ ) = gα γα (p̂)γα (p̂′ ),\n\n(5)\n\nwhere the suffix α expresses a symmetry.\nIn the effective mass model of Eq. (2), it is convenient\nto define r̃ = (x̃1 , x̃2 , x̃3 ) by a scale transformation\n√\n√\nmμ xμ ≡ m̃ x̃μ\n(6)\nwith m̃ = (mx my mz )1/3 . Then, Eq. (2) is written as\nXZ\n1\n∂\ne \u00012\nH0 =\nd3 r ψσ† (r)\n−i~\n− Ãμ ψσ (r), (7)\n2m̃\n∂ x̃μ\nc\nμσ\nwhere we have defined\nÃμ ≡\n\ns\n\nm̃\nAμ .\nmμ\n\n(8)\n\nWe also define p̃ = (p̃1 , p̃2 , p̃3 ) with p̃μ = (m̃/mμ )1/2 pμ ,\nso that r * p = r̃ * p̃. Then, the Fermi surface in p̃\nspace becomes spherically symmetric, and we can define a constant Fermi momentum p̃F and Fermi velocity\nṽF = ṽF p̃/|p̃| with a constant magnitude ṽF = p̃F /m̃,\nfor the scaled momentum p̃.\nNow, we derive the gap equation. The calculation is a\nstraightforward extension of the previous studies [7, 10,\n18, 19]. Near the second-order phase transition, the gap\nfunction has a form\n∆(r, p) = ∆α (r)γα (p),\n\n(9)\n\nand the gap equation is linearized as\nT \u0001\n− log (0) ∆α (r)\nTc\nZ ∞\nZ\n\u00032\n1\ndΩp̃′ \u0002\n= πT\ndt\nγα (p̂′ )\nsinh(πT t)\n4π\n0\nh\n\u0003i\n\u0002\b\n1\n× 1 − cos t h − ṽF′ * Π̃ ∆α (r),\n2\n∂\n2e\n− Ãμ .\n∂ x̃μ\nc\n\nIII.\n\nTHE PURE FFLO STATE\n\nIn this section, we briefly review the case in which the\norbital pair-breaking effect is negligible. In this case, we\ncan set A = 0 in Eqs. (2) and (11). Equation (10) has a\nsolution of the form\n∆(r) ∝ exp[iq̃ * r̃/~],\n\n(12)\n\nand is reduced to\nT \u0001\n\n∞\n\n1\nsinh(πT\nt)\n0\nZ\nh\n\u0002\n\b\n\u0002\n\u0003\n\u0003i\ndΩp̃′\n1\n2\n×\n.\nγα (p̂′ ) 1 − cos t h − ṽF′ * q̃\n4π\n2\n(13)\nFor example, for s-wave pairing, γs (p) = 1, there is\ninfinite degeneracy with respect to the direction of q̃, although the magnitude |q̃| is uniquely determined so that\nthe critical field is maximized. For non-s-wave pairing,\nboth the direction and the magnitude of q̃ are optimized.\nDepending on the symmetries of γα (p) and the Fermi\nsurface, and the temperature, there may be 2, 4, 8, 16 * * * fold degeneracies with respect to the direction of q̃. We\nwrite the optimum q̃'s as q̃m with m = 1, 2, * * * , M . Below and near the upper critical field, the order parameter\nis expressed by a linear combination:\n− log\n\n(0)\nTc\n\n= πT\n\nZ\n\n∆(r) =\n\ndt\n\nX\n\n∆m eiq̃m *r̃ .\n\n(14)\n\nm\n\n(10)\n\nwhere vF′ = ṽF p̃′ /|p̃′ | and Π̃ = (Π̃1 , Π̃2 , Π̃3 ) with\nΠ̃μ = −i~\n\nnot affect the upper critical field equation except that the\nˆ′\nvector potential is scaled as described in Eq. (8), since p̃\nis only an integral variable. In contrast, for anisotropic\nsuperconductors, the mass anisotropy affects the upper\ncritical field equation through the deformation of γα (p̂′ )\nwhen it is expressed in p̃ space [19].\n\n(11)\n\nThe upper critical field Hc2 is the highest |H| among\nthose which give a nontrivial solution of ∆(r). We note\nthat Eq. (10) is the same as that of a system with a spherically symmetric Fermi surface except that the argument\np̂′ = p′ /|p′ | of γα (p̂′ ) is different from the integral variˆ ′ = p̃′ /|p̃′ | = p̃′ /p̃F . Therefore, when γα (p̂′ ) is conable p̃\nstant, it is easily verified that the mass anisotropy does\n\nAmong the states of this form, the physical state is that\nwith the lowest free energy. Every degenerate q̃m does\nnot necessarily appear in the linear combination of the\nphysical state. The most well-known form is that expressed by the linear combination of eiq̃*r̃ and e−iq̃*r̃ ,\ni.e., ∆(r) ∝ cos(q̃ * r̃). For the second-order transition\nand s-wave pairing, this state is the physical state in the\neffective mass model.\nHere, we note that q̃m are not necessarily parallel\nto the magnetic field, when the orbital effect is negligible. The number and directions of the optimum q̃m\nwhich contribute to the physical state also depend on\nthe structures of the Fermi surface and the pairing interactions [20, 21], and the temperature [10, 22–24]. In\nthe present effective mass model, since the electron dispersion becomes isotropic in p̃ space as seen in Eq. (13),\nthe Fermi-surface anisotropy does not remove the infinite\ndegeneracy of the optimum q̃m for s-wave pairing.\n\n\f4\nIV.\n\nCOEXISTENCE STATE\n\nIn this section, we take into account both the orbital\nand paramagnetic pair-breaking effects. After deriving\nthe upper critical field equation, we take the limit of a\nweak orbital effect.\nFor a magnetic field H = (0, 0, H), we define A =\n(−Hy, 0, 0) with an appropriate gauge. The scale transformation described above gives Ãx = −H̃ ỹ with H̃ =\n√\n(m̃/ mx my )H. We define boson operators by\nξ̃H\nη̃ = √ (Π̃x − iΠ̃y )\n2\nξ̃\nH\nη̃ † = √ (Π̃x + iΠ̃y )\n2\n\n(15)\n\nwith\nh m m i 121\nc\nx y\nξH ,\n(16)\n=\n2\nm\n2|e|H̃\nz\np\np\nwhere ξH =\nc/2|e|H =\nΦ0 /2πH, which is of the\norder of the BCS coherence length ξ0 when H ∼ Hc2 .\nThe operator ṽF′ * Π̃, which appears in Eq. (10), can be\nrewritten as\n′\n′\n1\nṽF sin θ̃′ (eiφ̃ η̃ + e−iφ̃ η̃ † )\nṽF′ * Π̃ = √\n2ξ̃H\n(17)\n∂\n−i~ṽF cos θ̃′ ,\n∂ z̃\nξ̃H =\n\nr\n\nwhere θ̃′ and φ̃′ denote the polar coordinates when z̃-axis\nis the polar axis.\nBecause Eq. (10) can be regarded as an eigen equa(0) \u0001\ntion with the eigenvalue − log T /Tc\nand eigenfunction\n∆α (r), our problem is reduced to finding the eigenfunctions with the highest eigenvalue. The solutions can be\nwritten in the form\n ̄\n∆(r) = ∆(x̃,\nỹ) exp[iq̃z z̃/~],\n\n(18)\n\nwith ∂/∂ z̃ in Eq. (17) replaced by iq̃z /~. The gap equation (10) can be rewritten as\nT \u0001\nφ(x̃, ỹ)\n(0)\nTc\nZ ∞\nZ\n\u00032\n1\ndΩp̃′ \u0002\n(19)\n= πT\ndt\nγα (p̂′ )\nsinh(πT t)\n4π\n0\nh\n\u0001\u0003i\n\u0002\n1\n× 1 − cos t h − ṽF q̃z cos θ̃′ − ζ̂ φ(x̃, ỹ),\n2\nwhere we have defined\n− log\n\nζ̂ =\n\n′\nṽF sin θ̃′ iφ̃′\n√\n(e η̃ + e−iφ̃ η̃ † ).\n2 2ξ̃H\n\n(20)\n\nIt is convenient to expand the function φ(x̃, ỹ) by the\n(k)\nAbrikosov functions φn (x̃, ỹ) defined by\nφ(k)\nn (x̃, ỹ)\n\n1\n(k)\n= √ (η̃ † )n φ0 (x̃, ỹ),\nn!\n\n(21)\n\nwhere n = 0, 1, 2, 3, * * * , called the Landau level indexes,\n(k)\nk is an arbitrary wave number, and φ0 is the solution\nof\n(k)\n\nη̃ φ0 (x̃, ỹ) = 0,\n\n(22)\n\nwhich is expressed as\nh (ỹ − ỹ )2 i\nk\n(k)\n,\nφ0 (x̃, ỹ) = Ceikx̃ exp −\n2ξ ̃2\n\n(23)\n\nH\n\n2\nwith ỹk ≡ k ξ̃H\nand a normalization constant C. The\n(k)\nfunction φn (x̃, ỹ) is expressed as\nh√ ỹ − ỹ i\nk\n(k)\nφn (x̃, ỹ) = (−1)n Ceikx̃ Hn 2\n ̃\nξH\n(24)\nh (ỹ − ỹ )2 i\nk\n× exp −\n.\n2ξ ̃2\nH\n\nin terms of the Hermite polynomial. The operators η̃ and\n(k)\nη̃ † and the Abrikosov functions φn satisfy the relations\n√\n(k)\n(k)\nη̃ † φn (x̃, ỹ) = n + 1 φn+1 (x̃, ỹ)\n(25)\n√\n(k)\n(k)\nη̃ φn (x̃, ỹ) = n φn−1 (x̃, ỹ).\nIf we expand the eigenfunctions as\n∆(r) =\n\n∞\nX\n\n∆n φ(k)\nn (x̃, ỹ) exp[iq̃z z̃/~],\n\n(26)\n\nn=0\n\nthe gap equation (10) can be written as a matrix\nequation for the eigenvector with the vector elements\n∆0 , ∆1 , ∆2 , * * * , as\n− log\n\nX\nT \u0001\n∆n =\nDnn′ ∆n′\n(0)\nTc\nn′\n\n(27)\n\nwith\n∞\n\n1\nsinh(πT\nt)\n0\nZ\nZ\n\u00032\ndΩp̃′ \u0002\n(28)\n×\nγα (p̂′ )\ndx̃ dỹ φn(k) (x̃, ỹ)\n4π\nh\n\u0001\u0003i (k)\n\u0002\n1\n× 1 − cos t h − ṽF q̃z cos θ̃′ − ζ̂ φn′ (x̃, ỹ).\n2\n\nDnn′ = πT\n\nZ\n\ndt\n\nWhen h = 0, for s-wave pairing, the solution with n =\n0 and qz = 0 gives the highest upper critical field. In\ngeneral, Abrikosov functions with different n's can be\nmixed.\nThe magnetic field |H| appears both in the Hamiltonians H0 and Hm . The field |H| which originates from\nA in H0 is responsible for the orbital effect, and appears\nin the gap equation as a dimensionless parameter am |H|\nwith the coefficient am defined by\nm̃\n2|e| \u0010 vF \u00112\nam ≡ √\n.\nmx my c 2πTc(0)\n\n(29)\n\n\f5\nIn contrast, the field |H| included in the Zeeman field\nh in Hm is responsible for the Pauli paramagnetic pairbreaking effect. For this field, it is convenient to define\n(0)\nthe dimensionless parameter μe |H|/(2πTc ). The relative strength of the Pauli paramagnetic pair-breaking\neffect to that of the orbital effect is expressed by the ratio of their dimensionless parameters\n(0)\n\nzm =\n\nμe |H|/(2πTc )\nμe\n=\n.\n(0)\nam |H|\n2πTc am\n\n(30)\n\nThe parameter zm is proportional to the Maki parameter\nα. For example, for s-wave pairing, numerical calculations give am Hc20 ≈ 1.0372 and μe HP /∆0 ≈ 0.707107,\nand hence α ≈ 7.39 × zm .\nIf we define ām and z̄m for the isotropic system by\n(0)\n\nām ≡ (2|e|/c)(vF /2πTc )2\n(0)\nz̄m = μe /(2πTc ām ),\n\n(31)\n\nthe free energy is minimized by the state expressed by\nthe linear combination of more than two eiq̃m *r̃/~ at low\ntemperatures [12–14].\nThis contradiction is due to the assumption that infinitely large n's are negligible in the two-dimensional\nlimit. In the limit mx ≫ my , mz , we need to consider\nAbrikosov functions with infinitely large Landau level\nindex n. For large n's, the states with n ± 1 can be\napproximated by the state with n, which means that\nφn±1 ≈ e±iφ0 φn in Eq. (25), where e±iφ0 are arbitrary\nphase factors. Therefore, we may write\n√\n√\nη̃ = ne−iφ0 ,\nη̃ † = neiφ0\n(34)\nin the gap equation. This procedure is analogous to\nthose in the theory of Bose condensation, and in twodimensional type-II superconductors in a tilted magnetic\nfield [10]. Using Eq. (34) we obtain\n√\nnṽF sin θ̃′\n√\nζ̂ =\ncos(φ̃′ − φ0 ).\n2ξ̃H\n\nwe obtain\nzm\n\n\u0010 m m \u00111/6\nx y\nz̄m ,\n=\nm2z\n\n\u0010 m m \u00111/6\nx y\nα=\nᾱ,\nm2z\n\n(32)\n\nwith the Maki parameter of the isotropic system ᾱ ≡\n√\n2H̃c20 /HP . For the magnetic field parallel to z-axis,\nwhen mx ≫ mz we obtain zm ≫ z̄m , i.e., α ≫ ᾱ, which\nmeans that the system is strongly Pauli paramagnetic\nlimited.\n\nThus, the gap equation Eq. (19) can be rewritten for\nmx ≫ my , mz as\nT \u0001\nφ(x̃, ỹ)\n(0)\nTc\nZ\nZ ∞\n\u00032\ndΩp̃′ \u0002\n1\nγα (p̂′ )\n= πT\ndt\nsinh(πT t)\n4π\n0\nh\n\u0002\n\u0001\u0003i\n1 ′\n× 1 − cos t h − ṽF * q̃ φ(x̃, ỹ),\n2\n\n− log\n\nV.\nCROSSOVER FROM THE PURE FFLO\nSTATE TO THE COEXISTENCE STATE\n\nwhere\nNow, we consider a quasi-two-dimensional system such\nthat mx ≫ my , mz . In this case, because we have\nξ ̃H ≫ ξH ∼ ξ0 from Eq. (16), we may omit ζ̂ ∼\n′\n′\n(eiφ̃ η̃+e−iφ̃ η̃ † )/ξ ̃H in Eq. (28) for finite n and n′ . Therefore, if we can truncate the summation over n in Eq. (26),\nthe upper critical field equation is reduced to\nZ ∞\nT \u0001\n1\n− log (0) = πT\ndt\nsinh(πT\nt)\n0\nT\nZ c\nh\n\u0002\n\u00032\n\u0001\u0003i\ndΩp̃′ \u0002\n1\n×\nγα (p̂′ ) 1 − cos t h − ṽF q̃z cos θ̃′ ,\n4π\n2\n(33)\nin the limit ξ ̃H → ∞, which coincides with the upper critical field equation for the pure FFLO state expressed by Eq. (12) with q̃ ≡ (0, 0, q̃z ). The magnitude\n|q̃| = |q̃z | should be optimized so that the upper critical field is maximized. We write the optimum value\nas q0 . For example, for s-wave pairing, it is known\nthat q0 ≈ 1.2 × 2h/ṽF at T = 0. Thus, we only have\ntwo states with the highest upper critical field, which\nhave the FFLO vectors q̃ = (0, 0, ±q0 ). This contradicts the fact that there are more than two eiq̃m *r̃/~ in\nmost exactly two-dimensional systems as mentioned below Eq. (12). Furthermore, below the upper critical field,\n\n(35)\n\n(36)\n\nq̃ = (q̃x , q̃y , q̃z ) = (q̃⊥ cos φ0 , q̃⊥ sin φ0 , q̃z )\n\n(37)\n\nr\n√\nq\n2n\n2nᾱ 1\n2\n2\nq̃⊥ = q̃x + q̃y =\n=\n.\nα ξH\nξ̃H\n\n(38)\n\nwith\n\nIf we write the optimum n for each fixed α as n(α), we\nobtain\ns\n2n(α)ᾱ\n,\n(39)\nq̃⊥ = lim\n2\nα→∞\nαξH\nIf q̃⊥ 6= 0 in the limit α → ∞, n(α) must diverge like α,\ni.e., n(α) ∼ α. Equation (36) coincides with the upper\ncritical field equation of the pure FFLO state with q̃.\nEquation (39) is an essential equation which connects\nthe pure FFLO state with the optimum q in the twodimensional limit and the coexistence state with the optimum n and q̃z in quasi-two-dimensions. From Eqs. (38)\nand (39), we can see that if there are more than two optimum q̃'s in the two-dimensional limit, there must be\ncoexistence states with different n's with close upper critical fields in quasi-two-dimensions where mx ≫ my , mz .\n\n\f6\nFor example, a d-wave superconductor with\n−\n\np̂2z\n\n(40)\n\nat low temperatures exhibits a degeneracy in the solutions of Eq. (36) with q̃ = (0, ±q0 , 0), (0, 0, ±q0 ) in\nthe limit mx → ∞. From Eqs. (37) and (39), we\nfind that when mx ≫ my , mz , the coexistence states\n(k)\n2\n/2, 0)\n∆(r) ≈ ∆n φn (x̃, ỹ)eiq̃*r̃/~ with (n, q̃z ) ≈ (q02 ξ ̃H\nand those with (n, q̃z ) = (0, ±q0 ) have upper critical fields\nclose to each other.\nVI.\n\ns-WAVE PAIRING\n\nIn this section, we consider an s-wave superconductor\nas an example. Since γs (p) = 1, the gap equation (10)\nis exactly the same as that of the isotropic model except\nthat the vector potential A is scaled as Eq. (7) and the\neigenfunctions are distorted. Because the Zeeman field\nh is not scaled, in contrast to the vector potential A,\nthe Maki parameter α changes from ᾱ as expressed in\nEq. (32).\nWe expand the gap equation (19) with respect to the\noperators η̃, and obtain the eigenfunctions\n∆(r) = ∆n φ(k)\nn (x̃, ỹ) exp[iq̃z z̃/~],\n\nfor a given n. If we consider that n is always finite for the\nlimit α → ∞, Eq. (43) is reduced to q̃z = ±q0 , and the\nHc2 equation (42) is reduced to that of n = 0. Therefore,\nwhen mx is very large, states with any finite n have upper\ncritical fields very close to that of the state with n = 0\nand q̃z = ±q0 . However, because the index n needs to\nbe optimized for each situation, it can be infinitely large.\nFor the state with infinitely large n, such that n ∝ α ∝\n2\n, Eq. (43) results in |q̃z | < q0 and q̃⊥ 6= 0.\nξ̃H\nThis can be verified also by numerical calculations.\nFigure 1 shows the temperature dependences of the critical fields of states of various n. At each temperature, the\nstate with the highest critical field is physical. It is found\nthat vortex states with n = 0, 1, 2 occur depending on the\ntemperature, and that the envelope is very close to the\ncurve of the two-dimensional limit. It is also found that\n(0)\nthe wave vector q becomes nonzero below T ≈ 0.51×Tc .\nFigure 2 shows the behavior of the critical field for each\nn at low temperatures. We obtain qz 6= 0 below the temperature where the solid and dotted curves branch off.\n(0)\nInterestingly, below T ≈ 0.18 × Tc , the upper critical\nfield of the coexistence state with n = 2 and q̃z 6= 0 exceeds that in the limit zm → ∞. We will discuss this\nlater.\n\n(41)\n\nwhich are indexed by n and q̃z . The upper critical field\nequation is decoupled into those for each eigenfunction\nas\nZ ∞\nZ π/2\nT \u0001\n1\n− log (0) = πT\ndt\nsin θdθ\nsinh(πT t) 0\n0\nTc\nh\n\u0003\n\u00021\n\u0003\n\u0002 ṽ 2\n× 1 − cos(ht) cos q̃z ṽF t cos θ exp − F2 t2 sin2 θ\n ̃\n2\n16ξH\nn\ni\nX\n\u0002\n\u0003\n1\nn!\nm\n2 2\n2\n×\n(−1)m\nṽ\nt\ncos\nθ\n.\n2 F\n(m!)2 (n − m)!\n8ξ ̃H\nm=0\n(42)\nThe physical upper critical field Hc2 (T ) is the highest\nsolution of H among the solutions of Eq. (42) at each\nfixed T . In other words, the parameters n and q̃z are\noptimized so that Hc2 is maximized.\nIn systems with A = 0, the pure FFLO state occurs as described in section III at low temperatures.\nWhen the system is isotropic, there is infinite degeneracy with respect to the direction of q. We express\nthe q's that give the maximum FFLO critical field as\nq = (q0 sin θ cos φ, q0 sin θ sin φ, q0 cos θ) with an optimum value of q0 and arbitrary θ and φ.\nIn an anisotropic system with mx ≫ my , mz , the effective Maki parameter becomes large so that α ≫ ᾱ from\nEq. (32), and ξ ̃H ≫ ξH from Eq. (16). When mx is very\nlarge, we can make approximate |q| ≈ q0 . Therefore,\nfrom Eqs. (37) and (38), we obtain the optimum value of\nq̃z , as\ns\ns\n2n\n2nᾱ\nq̃z = ± q02 − 2 = ± q02 − 2\n(43)\n ̃\nαξ\nξH\nH\n\n1\nn=2\n\nμeHc2 / ∆0\n\nγdy2 −z2 (p̂) ∝\n\np̂2y\n\n0.5\n\nzm = 3\n\nn=1\n\nn=0\nn=5\nn=4\n\nn=3\nn=2\nn=1\n\n0\n0\n\n0.5\nT/\n\n1\n\n(0)\nTc\n\nFIG. 1: Temperature dependences of the upper critical fields\nfor zm = 3. The solid curves show the upper critical fields for\nn = 0, 1, 2, 3, 4, 5. At each temperature, the highest field is\nthe physical result of the critical field. The broken and dotted\ncurves show the upper critical fields in the two-dimensional\nlimit and that with the assumption of q = 0.\n\nFigure 3 shows the zm (∝ α) dependences of the upper\ncritical fields Hc2 for n = 0, 1, * * * 8. It is found that\nthe upper critical fields of all the coexistence states with\nn 6= 0 tend to approach that of the coexistence state\nwith n = 0, and slightly exceed it, where zm is large.\nAt each zm , the highest upper critical field among those\nwith n = 0, 1, 2, * * * is the physical upper critical field.\nIt is found that n of the physical state increases as zm\nincreases, and the physical critical field is larger than the\ncritical field of the n = 0 state for zm >\n∼ 1.3.\nFigure 4 shows the behavior of Hc2 for large zm . After reaching maxima, all the critial fields for n 6= 0 de-\n\n\f7\n\n0.8\n0.75\n\nn=5\n\nzm = 3\n\nn=2\n\nn=8\n\nn=4\nn=3\nn=2\n\nHP (q = 0)\n\nμeHc2 / ∆0\n\nμeHc2 / ∆0\n\nn=0\n\nn=1\n\n0.7\n\nHFFLO (q =/0)\nn = 1, q = 0\n\nn=0\n\n0.65\n\nn=3\n\nn=1\n\nn=0\n\nn=2\n\nn=8\n\nn=2\nq=0\n\nn = 0, q = 0\nn=1\n\n0.6\n0\n\n0.25\nT / Tc\n\nn=4\n\n0.5\n\n0.7\n0\n\n(0)\n\ncrease, and converge with the curve for n = 0 in the\nlimit zm → ∞. Within the present theory, the physical upper critical field, i.e., the highest field at each zm ,\ndecreases as zm increases for very large zm >\n∼ 7.7, i.e.,\n1/zm <\n0.13.\nThis\nresult\nseems\ninconsistent\nwith the\n∼\nnaive expectation that a reduction of the orbital effect,\nfor example, by increasing vF should cause a weaker pairbreaking effect. Presumably, for such a large zm , a firstorder phase-transition to a coexistence state must occur\nat a higher critical field than that obtained here, and the\nresultant critical field must monotonically increase with\nzm .\n\nn=1\n\nμeHc2 / ∆0\n\nn=0\nn = 0, q = 0\nn=3\n\n0.4\n\nn=1\n\nn=2\n\nn=4\n\n0\n0\n\n1\n\nn=1\nq=0\n\n0.4\n\nFIG. 4: zm dependences of the upper critical fields for n =\n0, 1, 2, * * * 8 at T /Tc = 0.01 in the large zm region. The dotted\ncurves show those when q = 0 is assumed. The thick and\nthin curves show the results for n = 0, 1, 2, 3, 4 and those for\nn = 5, 6, 7, 8, respectively. α ≈ 7.39 × zm .\n\nVII.\n\nn=2\n\n0.2\n\nn=2\nn=3\n\n1/zm\n\nFIG. 2: Temperature dependences of the upper critical fields\nfor zm = 3 at low temperature. The solid curves show the\nupper critical fields for n = 0, 1, 2, 3. At each temperature,\nthe highest field is the physical result of the critical field. The\ndotted curves show the critical field when q = 0 is assumed.\nThe thin broken and dotted curves show the upper critical\nfield in the two-dimensional limit and that with the assumption of q = 0.\n\n0.8\n\nn=1\n\n0.75\n\n2\n\n1/zm\n\nFIG. 3: zm dependences of the upper critical fields for n =\n0, 1, 2, * * * 8 at T /Tc = 0.01. The dotted curves show those\nwhen q = 0 is assumed. α ≈ 7.39 × zm .\n\nSUMMARY AND DISCUSSION\n\nWe have examined quasi-two-dimensional type-II superconductors and the two-dimensional limit. When\nH k [0, 0, 1], the effective Maki parameter α is proportional to (mx my /m2z )1/6 . Therefore, when mx ≫ mz ,\nthe orbital pair-breaking effect becomes weak, and the\nsuperconductivity survives up to a higher field, where\nthe FFLO state is favored.\nIn the coexistence state, the FFLO modulation occurs\nin the direction of the magnetic field, and is smoothly\nreduced to that of the pure FFLO state in the twodimensional limit (mx /mz → 0), when the directions of\nthe magnetic field and q of the pure FFLO state coincide. In contrast, when their directions differ, it may\nappear that the coexistence state is not reduced to the\npure FFLO state continuously. However, in actuality,\nmodulation perpendicular to the magnetic field is realized in large n vortex states. The physical origin of\nthe order parameter modulation in vortex states with\nhigher Landau levels is the spin polarization energy as in\nthe pure FFLO state. The coexistence states with optimum n have upper critical fields close to that of the pure\nFFLO state. Hence, a cascade transition occurs when\nα is large, analogously to the exactly two-dimensional\nsystem in a tilted magnetic field [9, 10, 25–29]. In the\ntwo-dimensional limit mx → ∞, the Landau level index\n1/6\nn increases as n ∝ α ∝ mx . As a result, the coexistence\nstate indexed by (n, qk ) (or the pure vortex state indexed\nby n when qk = 0) is continuously reduced to the pure\nFFLO state with q = (qk , q⊥ ).\nThe relations (37) and (39) connect the coexistence\nstates of Eq. (41) and the pure FFLO state in the twodimensional limit. The pure FFLO state with q⊥ 6= 0\ncorresponds to the coexistence state with n ∝ α → ∞,\nand the upper critical fields of the coexistence states converges to that of the pure FFLO state. This behavior has\n\n\f8\nbeen confirmed also by numerical calculations.\nFrom these results, we can conclude that the FFLO\nstate obtained in a theoretical model without orbital effects may emerge as the vortex states with higher Landau\n\nlevel indexes in real materials where orbital effects are inevitable. In particular, the order parameter modulation\ndue to the higher Landau level index is a mark of the\nFFLO modulation perpendicular to the magnetic field.\n\n[1] B.S. Chandrasekhar, Apply. Phys. Lett. 1, 7 (1962);\nA.M. Clogston, Phys. Rev. Lett. 9, 266 (1962).\n[2] P. Fulde and R. A. Ferrell, Phys. Rev. 135, A550 (1964).\n[3] A. I. Larkin and Yu. N. Ovchinnikov, Zh. Eksp. Teor.\nFiz. 47, 1136 (1964) [translation, Sov. Phys. JETP 20,\n762 (1965)].\n[4] L. W. Gruenberg and L. Gunther, Phys. Rev. Lett. 16\n996 (1966).\n[5] For a review, see Ref. [16].\n[6] For a review, see Y. Matsuda and H. Shimahara, J. Phys.\nSoc. Jpn. 76, 051005 (2007).\n[7] H. Shimahara, S. Matsuo and K. Nagai, Phys. Rev. B\n53, 12284 (1996).\n[8] H. Adachi and R. Ikeda, Phys. Rev. B 68, 184510 (2003).\n[9] A. I. Buzdin and J. P. Brison, Europhys. Lett. 35, 707\n(1996); Phys. Lett. A 218, 359 (1996).\n[10] H. Shimahara and D. Rainer, J. Phys. Soc. Jpn. 66, 3591\n(1997).\n[11] S. Matsuo, S. Higashitani, Y. Nagato, and K. Nagai, J.\nPhys. Soc. Jpn. 67, 280 (1998).\n[12] J. A. Bowers and K. Rajagopal, Phys. Rev. D 66, 065002\n(2002).\n[13] C. Mora and R. Combescot, Phys. Rev. B 71, 214504\n(2005).\n[14] H. Shimahara, J. Phys. Soc. Jpn. 67, 736 (1998).\n[15] C. Mora and R. Combescot, Europhys. Lett. 66, 833\n(2004).\n\n[16] H. Shimahara, pp. 687-704, in The Physics of Organic\nSuperconductors and Conductors, edited by A.G. Lebed\n(Springer, 2008).\n[17] D. Denisov, A. Buzdin, and H. Shimahara, Phys. Rev. B\n79, 064506 (2009).\n[18] I.A. Luk'yanchuk and V.P. Mineev, Sov. Phys. JETP 66,\n1168 (1987).\n[19] Y. Suginishi and H. Shimahara, Phys. Rev. B 74 024518\n(2006); erratum 75 099902(E) (2007).\n[20] H. Shimahara, Phys. Rev. B 50, 12760 (1994).\n[21] H. Shimahara, J. Phys. Soc. Jpn. 66, 541 (1997); J. Phys.\nSoc. Jpn. 68, 3069 (1999).\n[22] K. Maki and H. Won, Czech. J. Phys. 46, 1035 (1996).\n[23] K. Yang and S. L. Sondhi, Phys. Rev. B 57, 8566 (1998).\n[24] H. Shimahara and K. Moriwake, J. Phys. Soc. Jpn. 71,\n1234 (2002).\n[25] L. N. Bulaevskii, Zh. Eksp. Teor. Fiz. 65, 1278 (1973);\n[translation, Sov. Phys. JETP 38, 634 (1974)].\n[26] U. Klein, D. Rainer, and H. Shimahara, J. Low Temp.\nPhys. 118, 91 (2000).\n[27] M. Houzet and A. Buzdin, Europhys. Lett. 50, 375\n(2000).\n[28] M. Houzet, A. Buzdin, L. Bulaevskii, and M. Maley,\nPhys. Rev. Lett. 88, 227001 (2002).\n[29] U. Klein, Phys. Rev. B 69, 134518 (2004).\n\n\f"}