{"id": "http://arxiv.org/abs/0806.0659v1", "guidislink": true, "updated": "2008-06-04T00:31:04Z", "updated_parsed": [2008, 6, 4, 0, 31, 4, 2, 156, 0], "published": "2008-06-04T00:31:04Z", "published_parsed": [2008, 6, 4, 0, 31, 4, 2, 156, 0], "title": "Amplification and squeezing of quantum noise with a tunable Josephson\n  metamaterial", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0806.3785%2C0806.4920%2C0806.0599%2C0806.4002%2C0806.2982%2C0806.3369%2C0806.3883%2C0806.4289%2C0806.2271%2C0806.4353%2C0806.4481%2C0806.2245%2C0806.4203%2C0806.3981%2C0806.1852%2C0806.4084%2C0806.0754%2C0806.2156%2C0806.3506%2C0806.1402%2C0806.2335%2C0806.3021%2C0806.4607%2C0806.4852%2C0806.4399%2C0806.4164%2C0806.2922%2C0806.1201%2C0806.3509%2C0806.1258%2C0806.2132%2C0806.1407%2C0806.1781%2C0806.1564%2C0806.4280%2C0806.1203%2C0806.1958%2C0806.1216%2C0806.1336%2C0806.2684%2C0806.2197%2C0806.1163%2C0806.3156%2C0806.4135%2C0806.4253%2C0806.0284%2C0806.2115%2C0806.1760%2C0806.2942%2C0806.1589%2C0806.4214%2C0806.2294%2C0806.0630%2C0806.0659%2C0806.3594%2C0806.4004%2C0806.2149%2C0806.3560%2C0806.3784%2C0806.2045%2C0806.0609%2C0806.3045%2C0806.0148%2C0806.4649%2C0806.2856%2C0806.2665%2C0806.3435%2C0806.0050%2C0806.0927%2C0806.1252%2C0806.3131%2C0806.1369%2C0806.1838%2C0806.4161%2C0806.3953%2C0806.3214%2C0806.1636%2C0806.1184%2C0806.3046%2C0806.2894%2C0806.3168%2C0806.1735%2C0806.0746%2C0806.1266%2C0806.3022%2C0806.1940%2C0806.3657%2C0806.3438%2C0806.1738%2C0806.2860%2C0806.4136%2C0806.4917%2C0806.0003%2C0806.1424%2C0806.2774%2C0806.1728%2C0806.3618%2C0806.3410%2C0806.0924%2C0806.2044%2C0806.3533&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Amplification and squeezing of quantum noise with a tunable Josephson\n  metamaterial"}, "summary": "It has recently become possible to encode the quantum state of\nsuperconducting qubits and the position of nanomechanical oscillators into the\nstates of microwave fields. However, to make an ideal measurement of the state\nof a qubit, or to detect the position of a mechanical oscillator with\nquantum-limited sensitivity requires an amplifier that adds no noise. If an\namplifier adds less than half a quantum of noise, it can also squeeze the\nquantum noise of the electromagnetic vacuum. Highly squeezed states of the\nvacuum serve as an important quantum information resource. They can be used to\ngenerate entanglement or to realize back-action-evading measurements of\nposition. Here we introduce a general purpose parametric device, which operates\nin a frequency band between 4 and 8 GHz. It is a subquantum-limited microwave\namplifier, it amplifies quantum noise above the added noise of commercial\namplifiers, and it squeezes quantum fluctuations by 10 dB.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0806.3785%2C0806.4920%2C0806.0599%2C0806.4002%2C0806.2982%2C0806.3369%2C0806.3883%2C0806.4289%2C0806.2271%2C0806.4353%2C0806.4481%2C0806.2245%2C0806.4203%2C0806.3981%2C0806.1852%2C0806.4084%2C0806.0754%2C0806.2156%2C0806.3506%2C0806.1402%2C0806.2335%2C0806.3021%2C0806.4607%2C0806.4852%2C0806.4399%2C0806.4164%2C0806.2922%2C0806.1201%2C0806.3509%2C0806.1258%2C0806.2132%2C0806.1407%2C0806.1781%2C0806.1564%2C0806.4280%2C0806.1203%2C0806.1958%2C0806.1216%2C0806.1336%2C0806.2684%2C0806.2197%2C0806.1163%2C0806.3156%2C0806.4135%2C0806.4253%2C0806.0284%2C0806.2115%2C0806.1760%2C0806.2942%2C0806.1589%2C0806.4214%2C0806.2294%2C0806.0630%2C0806.0659%2C0806.3594%2C0806.4004%2C0806.2149%2C0806.3560%2C0806.3784%2C0806.2045%2C0806.0609%2C0806.3045%2C0806.0148%2C0806.4649%2C0806.2856%2C0806.2665%2C0806.3435%2C0806.0050%2C0806.0927%2C0806.1252%2C0806.3131%2C0806.1369%2C0806.1838%2C0806.4161%2C0806.3953%2C0806.3214%2C0806.1636%2C0806.1184%2C0806.3046%2C0806.2894%2C0806.3168%2C0806.1735%2C0806.0746%2C0806.1266%2C0806.3022%2C0806.1940%2C0806.3657%2C0806.3438%2C0806.1738%2C0806.2860%2C0806.4136%2C0806.4917%2C0806.0003%2C0806.1424%2C0806.2774%2C0806.1728%2C0806.3618%2C0806.3410%2C0806.0924%2C0806.2044%2C0806.3533&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "It has recently become possible to encode the quantum state of\nsuperconducting qubits and the position of nanomechanical oscillators into the\nstates of microwave fields. However, to make an ideal measurement of the state\nof a qubit, or to detect the position of a mechanical oscillator with\nquantum-limited sensitivity requires an amplifier that adds no noise. If an\namplifier adds less than half a quantum of noise, it can also squeeze the\nquantum noise of the electromagnetic vacuum. Highly squeezed states of the\nvacuum serve as an important quantum information resource. They can be used to\ngenerate entanglement or to realize back-action-evading measurements of\nposition. Here we introduce a general purpose parametric device, which operates\nin a frequency band between 4 and 8 GHz. It is a subquantum-limited microwave\namplifier, it amplifies quantum noise above the added noise of commercial\namplifiers, and it squeezes quantum fluctuations by 10 dB."}, "authors": ["M. A. Castellanos-Beltran", "K. D. Irwin", "G. C. Hilton", "L. R. Vale", "K. W. Lehnert"], "author_detail": {"name": "K. W. Lehnert"}, "author": "K. W. Lehnert", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1038/nphys1090", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/0806.0659v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0806.0659v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "13 pages, 4 figures", "arxiv_primary_category": {"term": "cond-mat.mes-hall", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cond-mat.mes-hall", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "cond-mat.supr-con", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0806.0659v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0806.0659v1", "journal_reference": "Amplification and squeezing of quantum noise with a tunable\n  Josephson metamaterial, (letter) M. A. Castellanos-Beltran, K. D. Irwin, G.\n  C. Hilton, L. R. Vale and K. W. Lehnert, Nature Physics, 4, 929 (2008).", "doi": "10.1038/nphys1090", "fulltext": "Amplification and squeezing of quantum noise with a tunable\nJosephson metamaterial\n\narXiv:0806.0659v1 [cond-mat.mes-hall] 4 Jun 2008\n\nM. A. Castellanos-Beltran,1, ∗ K. D. Irwin,2 G. C. Hilton,2 L. R. Vale,2 and K. W. Lehnert1\n1\n\nJILA, National Institute of Standards and Technology and the University of Colorado,\nand Department of Physics, University of Colorado, Boulder, Colorado 80309\n2\n\nNational Institute of Standards and Technology, Boulder, Colorado 80305\n(Dated: October 22, 2018)\n\n1\n\n\fIt has recently become possible to encode the quantum state of superconducting qubits and the position of nanomechanical oscillators into the states of\nmicrowave fields1,2 . However, to make an ideal measurement of the state of a\nqubit, or to detect the position of a mechanical oscillator with quantum-limited\nsensitivity requires an amplifier that adds no noise. If an amplifier adds less than\nhalf a quantum of noise, it can also squeeze the quantum noise of the electromagnetic vacuum. Highly squeezed states of the vacuum serve as an important\nquantum information resource. They can be used to generate entanglement or\nto realize back-action-evading measurements of position3,4 . Here we introduce\na general purpose parametric device, which operates in a frequency band between 4 and 8 GHz. It is a subquantum-limited microwave amplifier, it amplifies\nquantum noise above the added noise of commercial amplifiers, and it squeezes\nquantum fluctuations by 10 dB.\nWith the emergence of quantum information processing with electrical circuits, there is\na renewed interest in Josephson parametric devices5,6,7,8,9 . Previous work with Josephson\nparametric amplifiers demonstrated that they can operate with subquantum-limited added\nnoise and modestly squeeze vacuum noise10,11,12,13,14 . Earlier realizations of Josephson parametric amplifiers (JPAs) were only capable of amplifying signals in a narrow frequency range,\nwere not operated with large enough gain to make the noise of the following, conventional\namplifier negligible or were too lossy to be subquantum limited5 . For related reasons, the\ndegree of squeezing of the vacuum noise was never larger than 3 dB. We create a new type\nof parametric amplifier in which we embed a tunable, low-loss, and nonlinear metamaterial\nin a microwave cavity. The tunability of the metamaterial allows us to adjust the amplified\nband between 4 and 8 GHz, and the cavity isolates the gain medium from low-frequency\nnoise, providing the stability required to achieve high gains and large squeezing.\nA single mode of a microwave field with angular frequency ω can be decomposed in two\northogonal components, referred to as quadratures\nV̂ (t) ∝ X̂1 cos ωt + X̂2 sin ωt\nwhere X̂1 and X̂2 are conjugate quantum variables obeying the commutation relation\n[X̂1 , X̂2 ] = i/2. The proportionality constant depends on the details of the mode15,16,17 .\nAs a consequence of the commutation relation, the uncertainties in X̂1 and X̂2 are subject\n2\n\n\fto the Heisenberg constraint ∆X1 ∆X2 ≥ 1/4, where ∆Xj2 is the variance of the quadrature\namplitude X̂j . A mode is \"squeezed\" if for one of the quadratures ∆Xj < 1/2 (ref. 17).\n√\nAn amplifier that transforms both input quadratures by multiplying them by a gain G\nmust add at least half a quantum of noise for the output signal to obey the commutation\nrelation18 ; if it adds exactly half a quantum of noise, it is quantum limited. On the other\nhand, an amplifier which transforms the input signal by multiplying one quadrature by\n√\n√\nG and multiplying the other quadrature by 1/ G would have an output that satisfies\nthe commutation relation automatically. It need not add any noise to the amplified output\nmode and, in that sense, can be subquantum limited18,19 . A degenerate parametric amplifier\ntransforms the input signal in this way, amplifying one quadrature while deamplifying the\nother19 .\nOur realization of the parametric amplifier consists of a metamaterial embedded in a\nhalf-wavelength microwave cavity. The metamaterial is a superconducting niobium coplanar\nwaveguide in which the center conductor is a series array of 480 Josephson junctions. Each\njunction has been split into two junctions in parallel, forming a SQUID and making the phase\nvelocity of the metamaterial tunable with magnetic flux enclosed by the SQUID loop20 (Fig.\n1a). In addition to being flux-tunable, the phase velocity depends on the intensity of the\nfields propagating in this nonlinear metamaterial14 . (The tunability and nonlinearity of this\nmetamaterial were studied in a preliminary device, fabricated from aluminum, which was\ntoo lossy to be subquantum limited or to create highly squeezed states5 .) We define the\ncavity by interrupting the center conductor with two capacitors. One capacitor is larger\nthan the other, creating a strongly coupled port and a weakly coupled port.\nWe operate the parametric amplifier by injecting an intense pump tone into the weakly\ncoupled port at a frequency close to the cavity's half-wave resonance. Through the intensitydependant phase velocity, the pump causes the cavity's resonance frequency to vary at twice\nthe pump's frequency providing parametric gain. A signal incident on the strongly coupled\nport is reflected and will be amplified if it is in phase with the pump but deamplified if it\nis 90 degrees out of phase with the pump. Signals exiting port 2 are further amplified by a\nchain of commercial amplifiers. We resolve the components of the amplified signal that are\nin phase I and 90 degrees out of phase Q by mixing the signal with a phase reference called\nthe local oscillator (LO). Because the LO is derived from the same generator that produces\nthe pump, I and Q are simply related to the quadrature components X̂1 and X̂2 of the\n3\n\n\fmicrowave field exiting port 2. They are related by I = A(X̂1 cos θ − X̂2 sin θ + ξI (t)) and\nQ = A(X̂1 sin θ + X̂2 cos θ +ξQ (t)), where A is the total gain of the commercial amplifiers and\nmixer, θ is the phase between the pump and the LO, and ξI and ξQ are random variables.\nBoth random variables have a power spectral density NA , where NA is the noise number18\nof the commercial amplifier chain expressed as noise added at the input of the HEMT (see\nMethods).\nBefore operating the device as a parametric amplifier, we first characterize its linear\nbehaviour. In Fig. 2a, we measure the cavity's response both by measuring the reflectance\nof a signal on port 2 and the transmittance from port 1 to port 2 as functions of frequency.\nThe powers used are low enough so that the cavity's response is still linear. From this\nmeasurement we can extract the cavity's resonance frequency fres , the rates γc1 and γc2 at\nwhich the cavity loses power through both ports as well as through internal loss processes γi\n(Fig. 2a). When operating as a parametric amplifier, the center of the amplified band will\nbe close to fres , and the unity gain signal bandwidth will be approximately γc1 + γc2 + γi 5,6 .\nBy applying magnetic flux we can move the center of the amplified band over a large range\nof frequencies (Fig. 2b).\nAfter characterizing the linear response of the device, we operated it as an amplifier. In\nprevious work, we studied the dependence of the parametric gain on the pump power and\npump frequency in our first realization of this metamaterial5 , finding good agreement with\nthe theory in ref. 6. Here we study the JPA's added noise as a function of the cavity's\nresonance frequency and the total noise of the amplifier chain as a function of the JPA\ngain. By switching between two calibrated noise sources (Fig. 1a), we can change the\nincident noise on the JPA. The change in noise power at the output of the mixer allows\n√\nus to measure the noise NJPA added by the JPA, the JPA gain G, the total added noise\nof both the JPA and the commercial amplifier chain Ntot (i.e., the total noise referred to\n√\nthe input of the JPA), and the total gain GA. The calibrated noise sources are derived\nfrom two resistors held at different temperatures. The resistances are matched to the wave\nimpedance of the cables that carry signals to the JPA input. The noise emitted by both\nresistors is attenuated by a 10 dB attenuator held at a temperature TA = 15 mK and then\npassed to the JPA through a microwave circulator which separates the incident and reflected\nsignals from the JPA. The power spectral density in units of noise quanta incident on the\n\n4\n\n\fJPA through the circulator is\nN(TR ) =\n\n1\n1\n1\n9\n1\n+\n+\n,\nh̄ω\nh̄ω\n2\n10 e kB TA − 1\n10 e kB TR − 1\n\u0012\n\n\u0013\n\n\u0012\n\n\u0013\n\n(1)\n\nwhere TR = Tc = 15 mK or TR = Th = 4.1 K depending on the position of the switch\nshown in Fig. 1a. The first term in equation (1) is the quantum noise while the second and\nthird terms are the thermal noise which is small compared to the quantum noise at TR = Tc .\nMost of the noise incident on the JPA is N(TR ), but a small amount comes from the coupled\nport of the directional coupler (see Methods). By selecting θ = 0, the amplified quadrature\nappears at the I port of the mixer (Fig. 3a). We measure the ratio Y of the noise power\nat the output I with the hot load incident on the JPA divided by the noise power with\nthe cold load incident on the JPA. This measurement, known as a Y -factor measurement,\n√\nallows us to extract Ntot = (N(Th ) − Y N(Tc ))/(Y − 1) and the total gain A G. We then\nadjust the cavity's resonance frequency about 10 linewidths away from the LO frequency\nand turn off the pump. Because the JPA now acts as a passive mirror, we can perform a\nY -factor measurement on our commercial amplifier chain, finding NA and A. From both\n√\nmeasurements, we extract the JPA gain G and NJPA (Fig. 3). As observed in Fig. 3b, our\nJPA adds less than 1/2 a quantum of noise over the 4 − 8 GHz band where it operates. In\naddition, it can be operated at large enough gain to amplify the quantum noise above the\ncommercial amplifier's noise (Fig. 3c)!\nIn order to show that the JPA can squeeze quantum noise, we examine the squeezed\nquadrature X2 when the incident noise is mostly quantum noise (TR = Tc ). When θ = 0,\nX2 appears at the Q port. The noise at the Q port referred to the input of the HEMT\nis composed of the added noise of the commercial amplifiers (NA ≈ 26) and noise coming\n\nfrom port 2, 2∆XQ2 , where ∆XQ2 = ∆X12 sin2 θ + ∆X22 cos2 θ. When θ = 0, we observe a\nreduction in ∆XQ when the pump is turned on, demonstrating that the JPA has squeezed\nquantum noise (Fig. 4a). As we increase the JPA gain, we observe an increase in the noise\nsqueezing up to G = 16 dB (Fig. 4b). For G < 16 dB the squeezing we observe is consistent\nwith the expected behaviour from a model of parametric amplification that includes loss in\nthe JPA but no other imperfections6 . However, for G > 16 dB we observe less than the\npredicted squeezing probably due to the instability in the phase acquired by the pump as it\npasses through the cryostat in the several minutes required to complete one measurement.\nFinally, to illustrate the JPA's unequal effect on the noise of the two quadratures, we define\n5\n\n\fa quantity η(θ) = (∆XQ2 )pump\n\n2\non /(∆XQ )pump off .\n\nIn Fig. 4c, we plot η(θ) demonstrating that\n\nthe fluctuations at the output of the JPA are indeed squeezed along the axis defined by the\npump (Fig. 3a).\nThe measurement of the squeezed state would have proceeded much more rapidly if\nwe had used a subquantum limited amplifier, such as a second JPA, instead of a HEMT\namplifier. For most measurements, the low added noise of the JPA is helpful, but for\nsome measurements it is crucial. For example, to fully characterize the quantum state\nof non-Gaussian states, such as the Fock states generated by superconducting qubits2 , a\nsubquantum limited amplifier is a necessity21 . In addition to characterizing non-Gaussian\nstates of microwave fields, the JPA is also well suited to amplifying the signal generated\nby a nanomechanical beam moving in a microwave cavity1 , enabling a quantum-limited\nmeasurement of position. The tunability of the amplifier demonstrated here also makes it\nwell suited to use with the increasingly popular frequency-division-multiplexed microwave\ncircuits1,22,23 when simultaneous measurement of all frequency channels is not required.\n\nMethods\n\nDevices are fabricated at NIST Boulder using a standard Nb/AlOx/Nb trilayer process24 ,\nmodified by eliminating the shunt resistor layer and minimizing deposited oxides23 . The\ndevice studied here was coprocessed with 10 other devices used for dc characterization.\nThese dc-measurements indicate an average critical current Ic per SQUID in the JPA of\n31 μA, which was close to the designed value of 30 μA. The transmission lines from which\nthe half-wavelength cavities were built were designed to have a capacitance per unit length\nof Cl = 0.15 nF/m and a geometrical inductance per unit length of Ll = 0.49 μH/m. For\nIc = 31 μA, the Josephson inductance per SQUID is LJ = 10.6 pH. These values predicts\na half-wave resonance frequency of 8.23 GHz, when no flux is applied, which is within 3%\nof the observed value. Measurements were performed in a magnetically shielded dilution\nrefrigerator. To avoid unknown loss and noise in the cables carrying the calibrate noise\nsignals, superconducting Niobium coaxial cables were used to carry these signals between the\n15 mK region of the refrigerator and 4 K region. A calibrated ruthenium oxide thermometer\nmeasured the refrigerators base temperature and the temperature of the helium bath, to\nwhich the 4 K resistor and microwave switch were thermally anchored. A calibration tone,\n6\n\n\f(Fig. 1a) is used: to verify the gain inferred from the Y -factor measurements, to ensure\nthat the noise reduction arises from genuine squeezing and not saturation of the amplifiers,\nand to measure S22 in the network analysis. The complete expression for the noise incident\non the JPA includes contributions from the thermal noise introduced with the calibration\ntone and the insertion loss of the directional coupler and the switch. The unknown insertion\nloss at cryogenic temperatures of the directional coupler and of the microwave switch are\nthe dominant uncertainties in the added noise and squeezing measurements. The extreme\nvalues represented by the error bars are derived by assuming: first, that there in no insertion\nloss, and then, that the insertion loss has not changed between room temperature and the\noperating temperature. Noise at the I or the Q ports is expressed as the double-side-band\npower-spectral-density referred to the input of the relevant amplifier. Dividing the spectral\ndensity by hfLO , yields the noise in dimensionless units of noise quanta, where LO is the\nlocal oscillator frequency; e.g. the thermal noise of a resistor at temperature T >> hfLO /kB\nmeasured at the I-port would have a noise NT = kB T /hfLO .\n\nAcknowledgements\n\nThe authors acknowledge funding from the National Institute of Standards and Technology (NIST), from the National Science Foundation, and from a NIST-University of Colorado\nseed grant. We thank S. M. Girvin, J. D. Teufel, C. A. Regal, N. E. Flowers-Jacobs, J. K.\nThompson and M. Holland for valuable conversations and technical assistance. K. W. Lehnert is a member of NIST's Quantum Physics Division.\n\nCompeting financial interests\n\nThe authors declare that they have no competing financial interests.\n\n∗\n\nElectronic mail: castellm@colorado.edu\n\n1\n\nRegal, C. A., Teufel, J. D. & Lehnert, K. W. Measuring nanomechanical motion with a microwave cavity interferometer (2008). ArXiv:0801.1827v2 [quant-ph].\n\n7\n\n\f2\n\nHouck, A. A. et al. Generating single microwave photons in a circuit. Nature(London) 449,\n328–331 (2007).\n\n3\n\nBraunstein, S. L. & van Loock, P. Quantum information with continuous variables. Rev. Mod.\nPhys. 77, 513–577 (2005).\n\n4\n\nCaves, C. M., Thorne, K. S., Drever, R. W. P., Sandberg, V. D. & Zimmermann, M. On the\nmeasurement of a weak classical force coupled to a quantum-mechanical oscillator. I. Issues of\nprinciple. Rev. Mod. Phys. 52, 341–392 (1980).\n\n5\n\nCastellanos-Beltran, M. A. & Lehnert, K. W. Widely tunable parametric amplifier based on\na superconducting quantum interference device array resonator. Appl. Phys. Lett. 91, 083509\n(2007).\n\n6\n\nYurke, B. & Buks, E. Performance of cavity-parametric amplifiers, employing kerr nonlinearites,\nin the presence of two-photon loss. J. Lightw. Technol. 24, 5054–5066 (2006).\n\n7\n\nTholén, E. A. et al. Nonlinearities and parametric amplification in superconducting coplanar\nwaveguide resonators. Appl. Phys. Lett. 90, 253509 (2007).\n\n8\n\nSiddiqi, I. et al. Rf-driven Josephson bifurcation amplifier for quantum measurement. Phys.\nRev. Lett. 93, 207002 (2004).\n\n9\n\nZagoskin, A., Il'ichev, E., McCutcheon, M. W., Young, J. & Nori, F. Generation of squeezed\nstates of microwave radiation in a superconducting resonant circuit (2008). ArXiv:0804.4186v1\n[cond-mat.supr-con].\n\n10\n\nYurke, B. Squeezed-state generation using a Josephson parametric amplifier. J. Opt. Soc. Am.\nB 4, 1551–1557 (1987).\n\n11\n\nYurke, B. et al. Observation of 4.2-k equilibrium-noise squeezing via a Josephson-parametric\namplifier. Phys. Rev. Lett. 60, 764–767 (1988).\n\n12\n\nYurke, B. et al. Observation of parametric amplification and deamplification in a Josephson\nparametric amplifier. Phys. Rev. A 39, 2519–2533 (1989).\n\n13\n\nMovshovich, R. et al. Observation of zero-point noise squeezing via a Josephson-parametric\namplifier. Phys. Rev. Lett. 65, 1419–1422 (1990).\n\n14\n\nYurke, B., Roukes, M. L., Movshovich, R. & Pargellis, A. N. A low-noise series-array Josephson\njunction parametric amplifier. Appl. Phys. Lett. 69, 3078–3080 (1996).\n\n15\n\nYurke, B. & Denker, J. S. Quantum network theory. Phys. Rev. A 29, 1419–1437 (1984).\n\n16\n\nLouisell, W. H. Radiation and Noise in Quantum Electronics, chap. 4, 137–174 (McGraw-Hill\n\n8\n\n\fBook Company, New York, 1964).\n17\n\nGerry, C. C. & Knight, P. L. Introductory Quantum Optics (Cambridge University Press,\nCambridge, UK, 2006).\n\n18\n\nCaves, C. M. Quantum limits on noise in linear amplifiers. Phys. Rev. D 26, 1817–1839 (1982).\n\n19\n\nTakahasi, H. Advances in Communication Systems, edited by Balakrishnan, A. V., chap. 6,\n227–310 (Academic Press, New York, 1965).\n\n20\n\nHaviland, D. B. & Delsing, P. Cooper-pair charge solitons: The electrodynamics of localized\ncharge in a superconductor. Phys. Rev. B 54, R6857–R6860 (1996).\n\n21\n\nYurke, B. & Stoler, D. Generating quantum mechanical superpositions of macroscopically\ndistinguishable states via amplitude dispersion. Phys. Rev. Lett. 57, 13–16 (1986).\n\n22\n\nDay, P. K., LeDuc, H. G., Mazin, B. A., Vayonakis, A. & Zmuidzinas, J. A broadband superconducting detector suitable for use in large arrays. Nature (London) 425, 817–821 (2003).\n\n23\n\nMates, J. A. B., Hilton, G. C., Irwin, K. D., Vale, L. R. & Lehnert, K. W. Demonstration of a\nmultiplexer of dissipationless superconducting quantum interference devices. Appl. Phys. Lett.\n92, 023514 (2008).\n\n24\n\nSauvageau, J. et al. Superconducting integrated circuit fabrication with low temperature ECRbased PECVD SiO2 dielectric films. IEEE Trans. Appl. Supercond. 5, 2303 – 2309 (1995).\n\n9\n\n\fI\n\n(a)\n\nLO\n\npump\n\nθ\n\nQ\nrf\n\n295 K\n\n20 dB\n\n20 dB HEMT\n\n4.1 K\n\nsw\n\n15 mK\n10 dB\ncirculator\n20 dB\n\n20 dB\ncalibration\nΦ\n\nJPA\n\nin\n\ndirectional\ncoupler\nout\nport 2\n\nport 1\n5 mm\n(b)\n\n15 μm\n\nFIG. 1: Measurement schematic and device images. a, The JPA is measured in a cryostat\nheld at 15 mK. Two microwave generators are used to study the JPA. One generator creates the\npump and LO tones, while the second creates a calibration tone. The pump tone is injected through\nport 1 of the JPA, while the calibration tone is incident on port 2 of the JPA through a 20 dB\ndirection coupler. Signals emerging from port 2 pass through a circulator and are then amplified by\na cryogenic high-electron-mobility transistor amplifier (HEMT) and a room temperature amplifier\nbefore entering the radio-frequency (rf) port of a mixer. The noise incident on port 2 of the JPA\nwhich comes primarily from the isolated port of the circulator can be switched (sw) to come from\ntwo different resistors held at different temperatures. b, The images are a picture of the full device\n(upper) and a magnified image of the weakly coupled port and a few SQUIDS (lower).\n\n10\n\n\f(b)\nf res (GHz)\n\nS parameters\n\n(a)\n1\n\n0.5\n\n8\n6\n4\n\n0\n\n6.95\n7\n7.05\nfrequency (GHz)\n\n1\n\n0\n1\nflux (Φ/Φ0 )\n\nFIG. 2: Linear response of the JPA. a, We plot the fraction of microwave amplitude transmitted\nfrom port 1 to port 2 |S21 | (blue) and the fraction reflected from port 2 |S22 | (black) as functions\nof frequency at a particular value of applied magnetic flux. By fitting this data to a model of a two\nport cavity (red lines), we extract fres = 7.0038 GHz, γc1 = 2π × 437 kHz, γc2 = 2π × 10.55 MHz,\nand γi = 2π × 341 kHz. b, We plot the measured value of fres as a function of applied magnetic\nflux Φ in units of the magnetic flux quantum Φ0 . We use the obvious periodicity in this data to\ninfer the magnetic flux enclosed by the SQUIDs.\n\n11\n\n\f(b)\n\n(a)\nQ\n\n0.5\n1\n\nin\n\nG out\n\nX1\n\nNJPA\n\nX2\n\n0.25\n\nG\n\nθ\n\n0\n\nI\n\n4\n\n6\nf res(GHz)\n\n8\n\n(c)\n\nNtot\n\n10\n\n1\n\n0.1\n\n10\n\n100\n\n1000\n\nG\n\nFIG. 3:\n\nAdded noise of the JPA and of the full measurement chain. a, This diagram\n\nrepresents the operation of an ideal degenerate parametric amplifier which transforms an input\n√\nstate (red circle) into an output state (green ellipse) by amplifying the X1 component by G and\n√\nsqueezing the X2 component by 1/ G. The mixer projects the output state into axes rotated by\nθ. b, We measure NJPA at nine different values of fres between 4 and 8 GHz and observe that the\nadded noise is less than half a quantum (red line). The error bar applies to all points; it represents\nthe systematic uncertainty introduced primarily by the unknown loss of the directional coupler and\nswitch when operated cryogenically. c, We plot Ntot when fres = 7.00 GHz versus G (points). At\nthis frequency NA = 26 and is dominated by the HEMT. With increasing G, this noise becomes\nnegligible compared to NJPA = 0.23, where we expect Ntot = NJPA + NA /G (blue line). At the\nlargest gains Ntot < 0.5 (green line) and NA /G = 0.04.\n\n12\n\n\f(a)\n\n(b)\n\n1\n\nη (0)\n\nN A +2 ∆X Q2\n\n30\n\n25\n\n20\n\n0.5\n0.75\nfrequency (MHz)\n\n1\n\n0.5\n\n0\n\n0\n\n10\nG (dB)\n\n20\n\n(c)\n\nη(θ)\n\n10\n\n1\n\n0.1\n0\n\n90\nθ (degrees)\n\n180\n\nFIG. 4: Demonstration of squeezing. a, Power spectral density versus frequency at the Q\noutput of the mixer referred to the input of the commercial amplifier chain in units of quanta,\nmeasured with the pump on (red) and the pump off (blue) for θ = 0, fres = 7 GHz and G = 15.3 dB.\nb, The squeezing η(0) as a function of G (points) and the predicted squeezing from reference 6\n(line). The error bars represent the same systematic error as in Fig. 3b. This uncertainty varies\nsmoothly between the error bars shown in selected data points. c, η(θ) as a function of θ for three\ndifferent gains (points) for G = 34 (black), G = 4 (green), G = 1.4 (cyan) and the expected θ\ndependance (lines)6,12 .\n\n13\n\n\f"}