{"id": "http://arxiv.org/abs/0711.4234v1", "guidislink": true, "updated": "2007-11-27T12:05:30Z", "updated_parsed": [2007, 11, 27, 12, 5, 30, 1, 331, 0], "published": "2007-11-27T12:05:30Z", "published_parsed": [2007, 11, 27, 12, 5, 30, 1, 331, 0], "title": "Magnetotransport of electrons in quantum Hall systems", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0711.2191%2C0711.2030%2C0711.1723%2C0711.4234%2C0711.0766%2C0711.4580%2C0711.2996%2C0711.4519%2C0711.4361%2C0711.1879%2C0711.0431%2C0711.2690%2C0711.4965%2C0711.0252%2C0711.3028%2C0711.1398%2C0711.4317%2C0711.4486%2C0711.1665%2C0711.3612%2C0711.1713%2C0711.2467%2C0711.4916%2C0711.2606%2C0711.3811%2C0711.3704%2C0711.1022%2C0711.4573%2C0711.3819%2C0711.1684%2C0711.2972%2C0711.4212%2C0711.0448%2C0711.0970%2C0711.4249%2C0711.0811%2C0711.1796%2C0711.4658%2C0711.2899%2C0711.4678%2C0711.0630%2C0711.0014%2C0711.0827%2C0711.0889%2C0711.0103%2C0711.0547%2C0711.0688%2C0711.3345%2C0711.4397%2C0711.0214%2C0711.0605%2C0711.0137%2C0711.1945%2C0711.4441%2C0711.3876%2C0711.2199%2C0711.3744%2C0711.3053%2C0711.1543%2C0711.0086%2C0711.1227%2C0711.3048%2C0711.4298%2C0711.1909%2C0711.4329%2C0711.1809%2C0711.1680%2C0711.2735%2C0711.4835%2C0711.2363%2C0711.4348%2C0711.0968%2C0711.1555%2C0711.3875%2C0711.1124%2C0711.2186%2C0711.3622%2C0711.2648%2C0711.1066%2C0711.3466%2C0711.0695%2C0711.4499%2C0711.4240%2C0711.4393%2C0711.0094%2C0711.4644%2C0711.1623%2C0711.0988%2C0711.2281%2C0711.0830%2C0711.1369%2C0711.4772%2C0711.4325%2C0711.3492%2C0711.0072%2C0711.4437%2C0711.2410%2C0711.2907%2C0711.0679%2C0711.3103%2C0711.3971&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Magnetotransport of electrons in quantum Hall systems"}, "summary": "Recent theoretical results on magnetotransport of electrons in a 2D system in\nthe range of moderately strong transverse magnetic fields are reviewed. The\nphenomena discussed include: quasiclassical memory effects in systems with\nvarious types of disorder, transport in lateral superlattices,\ninteraction-induced quantum magnetoresistance, quantum magnetooscillations in\ndc and ac transport, and oscillatory microwave photoconductivity.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0711.2191%2C0711.2030%2C0711.1723%2C0711.4234%2C0711.0766%2C0711.4580%2C0711.2996%2C0711.4519%2C0711.4361%2C0711.1879%2C0711.0431%2C0711.2690%2C0711.4965%2C0711.0252%2C0711.3028%2C0711.1398%2C0711.4317%2C0711.4486%2C0711.1665%2C0711.3612%2C0711.1713%2C0711.2467%2C0711.4916%2C0711.2606%2C0711.3811%2C0711.3704%2C0711.1022%2C0711.4573%2C0711.3819%2C0711.1684%2C0711.2972%2C0711.4212%2C0711.0448%2C0711.0970%2C0711.4249%2C0711.0811%2C0711.1796%2C0711.4658%2C0711.2899%2C0711.4678%2C0711.0630%2C0711.0014%2C0711.0827%2C0711.0889%2C0711.0103%2C0711.0547%2C0711.0688%2C0711.3345%2C0711.4397%2C0711.0214%2C0711.0605%2C0711.0137%2C0711.1945%2C0711.4441%2C0711.3876%2C0711.2199%2C0711.3744%2C0711.3053%2C0711.1543%2C0711.0086%2C0711.1227%2C0711.3048%2C0711.4298%2C0711.1909%2C0711.4329%2C0711.1809%2C0711.1680%2C0711.2735%2C0711.4835%2C0711.2363%2C0711.4348%2C0711.0968%2C0711.1555%2C0711.3875%2C0711.1124%2C0711.2186%2C0711.3622%2C0711.2648%2C0711.1066%2C0711.3466%2C0711.0695%2C0711.4499%2C0711.4240%2C0711.4393%2C0711.0094%2C0711.4644%2C0711.1623%2C0711.0988%2C0711.2281%2C0711.0830%2C0711.1369%2C0711.4772%2C0711.4325%2C0711.3492%2C0711.0072%2C0711.4437%2C0711.2410%2C0711.2907%2C0711.0679%2C0711.3103%2C0711.3971&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Recent theoretical results on magnetotransport of electrons in a 2D system in\nthe range of moderately strong transverse magnetic fields are reviewed. The\nphenomena discussed include: quasiclassical memory effects in systems with\nvarious types of disorder, transport in lateral superlattices,\ninteraction-induced quantum magnetoresistance, quantum magnetooscillations in\ndc and ac transport, and oscillatory microwave photoconductivity."}, "authors": ["I. A. Dmitriev", "F. Evers", "I. V. Gornyi", "A. D. Mirlin", "D. G. Polyakov", "P. Wölfle"], "author_detail": {"name": "P. Wölfle"}, "author": "P. Wölfle", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1002/pssb.200743278", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/0711.4234v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0711.4234v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "Mini-review for Proceedings of the DFG Priority Progamme \"Quantum\n  Hall Systems\"; to be published in a special issue of Physica Status Solidi\n  (b); 27 pages, 22 figures", "arxiv_primary_category": {"term": "cond-mat.dis-nn", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cond-mat.dis-nn", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "cond-mat.mes-hall", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0711.4234v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0711.4234v1", "journal_reference": "physica status solidi (b), 245, 239 (2008)", "doi": "10.1002/pssb.200743278", "fulltext": "pss header will be provided by the publisher\n\narXiv:0711.4234v1 [cond-mat.dis-nn] 27 Nov 2007\n\nMagnetotransport of electrons in quantum Hall systems\nI.A. Dmitriev1,∗ , F. Evers1 , I.V. Gornyi1,∗ , A.D. Mirlin1,2,† , D.G. Polyakov1, and P. Wölfle2,1\n1\n2\n\nInstitut für Nanotechnologie, Forschungszentrum Karlsruhe, 76021 Karlsruhe, Germany\nInstitut für Theorie der Kondensierten Materie, Universität Karlsruhe, 76128 Karlsruhe, Germany\n\nKey words Quantum Hall systems, magnetotransport, Landau quantization, magneto-oscillations, disorder,\nmagnetoresistance, memory effects, electron-electron interaction, Coulomb drag, photoconductivity\nPACS 73.21.-b, 73.43.-f, 73.43.Qt, 73.50.Jt, 73.63.-b, 73.50.Pz\nRecent theoretical results on magnetotransport of electrons in a 2D system in the range of moderately strong\ntransverse magnetic fields are reviewed. The phenomena discussed include: quasiclassical memory effects\nin systems with various types of disorder, transport in lateral superlattices, interaction-induced quantum\nmagnetoresistance, quantum magnetooscillations in dc and ac transport, and oscillatory microwave photoconductivity.\nCopyright line will be provided by the publisher\n\n1 Introduction\nElectronic transport in semiconductor nanostructures is one of the central issues of research in modern\ncondensed matter physics, see, e.g., [1, 2] for reviews. In this article, we review recent results on transport\nof two-dimensional electron gases (2DEG) in moderately strong transverse magnetic fields B. Specifically,\nwe concentrate on a range of B which are classically strong (i.e., ωc τtr ≫ 1, where ωc is the cyclotron\nfrequency and τtr the transport relaxation time), but where quantum localization effects (and, correspondingly, quantum Hall physics) are not developed yet. There exists a broad class of phenomena that lead to\nstrong magnetoresistivity ρxx (B) in this range of fields, in view of the developed cyclotron motion. These\nphenomena are discussed in the present review.\n\n2 Quasiclassical memory effects in magnetoresistance\nThe recent interest in quasiclassical transport properties of a 2DEG has been largely motivated by the\nexperimental and practical importance of high-mobility heterostructures, in which charged impurities are\nseparated from the 2DEG by a wide spacer. The correlation radius of disorder produced by the impurities is\nusually much larger than the Fermi wave length of electrons and transport in the 2DEG retains signatures\nof the underlying quasiclassical dynamics of the particles. On the theoretical side, much of the interest\nhas been inspired by a variety of anomalous transport phenomena which, while being essentially classical,\ncannot be described by Boltzmann-Drude kinetic theory. The quasiclassical \"non-Boltzmann\" phenomena\nin disordered electron systems are due to correlations of scattering acts at the points where quasiclassical\npaths self-intersect, which gives rise to memory effects, neglected in the conventional Boltzmann equation.\nIn particular, the non-Markovian kinetics yields a strong magnetoresistance (MR) and anomalies in the ac\nresponse. The strength of the quasiclassical anomalies depends on the ratio d/l, where d is the correlation\nradius of disorder, l the mean free path, and grows with increasing d as a power of this parameter. Since\nquantum corrections (weak localization, Altshuler-Aronov corrections, etc.) are governed by a different\nsmall parameter 1/kF l ≪ 1, where kF is the Fermi wave vector, it is the long-range correlations of disorder\n∗\n†\n\nAlso at A.F. Ioffe Physico-Technical Institute, 194021 St. Petersburg, Russia\nAlso at St.Petersburg Nuclear Physics Institute, 188300 St.Petersburg, Russia.\npss data will be provided by the publisher\n\n\f2\n\nI.A. Dmitriev et al.: Magnetotransport in quantum-Hall systems\n\nwith kF d ≫ 1 that reveal the quasiclassical anomalies. In this section, we focus on the quasiclassical\nmemory effects in magnetotransport.\n2.1 Magnetoresistance of a 2DEG subject to smooth disorder\nWe begin by considering the MR of a 2DEG in the presence of Gaussian disorder which is smooth on the\nscale of kF−1 . First of all, we recall that there exists a finite MR [3, 4] even within the collision-integral\napproximation, the source of which is the bending of quasiclassical trajectories by magnetic field B on the\nscale of the correlation radius d. This leads to a small negative MR, ∆ρxx /ρ0 ∼ −(d/Rc )2 , where ρ0 is\nthe Drude resistivity and Rc is the cyclotron radius. Remarkably, the non-Markovian kinetics gives rise to\na much stronger positive MR [5], which may even be much larger than unity.\nTo systematically treat the quasiclassical memory effects, the starting point is the disorder-averaged\nexpression for the conductivity tensor σ in terms of the exact Liouville operator L:\n*\u0012\n\u0012\n\u0013T +\n\u0013\nZ\ndφ\ncos φ\ncos φ\n−1\n2\n2\n.\n(1)\nL\nσ = e νvF\nsin φ\nsin φ\n2π\nHere ν is the density of states, vF the Fermi velocity, φ the velocity angle on the Fermi surface. The\noperator L = L0 + δL is given by the sum of the free part L0 = −iω + vF n∇ + ωc ∂φ , where ωc is the\ncyclotron frequency, n = (cos φ, sin φ), and the part induced by a random scalar potential V (r),\nδL = δv(r)n∇ + [∇δv(r)](ẑ × n)∂φ ,\n\n(2)\n\nwhere δv(r) = v(r)−vF denotes a fluctuation of the local Fermi velocity v(r) = [vF2 −2V (r)/m)]1/2 and\nẑ is a unit vector in z direction. Expanding Eq. (1) in δL, averaging over the disorder and resumming the\nseries, the diagonal resistivity ρxx = 2(−iω +Mxx)/e2 νvF2 is represented in terms of the disorder-induced\nself-energy (\"memory function\") Mxx .\n(0)\nThe Drude result Mxx = τtr−1 , where τtr is the momentum relaxation time, follows as the first term in a\n(0)\nperturbative expansion of the self-energy in the strength of disorder, Mxx = −hδL L0−1 δLi. Substituting\n−1\n−1\nthe propagator LD renormalized by impurity scattering for L0 in the latter expression yields the main\ncontribution to the MR associated with the quasiclassical memory effects. When calculating L−1\nD in the\ncase of long-range disorder, the stochastic motion of particles can be approximated by a Fokker-Planck\nequation corresponding to the diffusion in momentum space, so that LD is written as\nLD = −iω + vF n∇ + ωc ∂φ − τtr−1 ∂φ2 .\n\n(3)\n\nThe leading correction to Mxx due to the self-intersection of quasiclassical paths then reads:\nR\n∆Mxx = (4π 3 m2 vF2 )−1 d2 q dφ sin φ sin(φ − φq )q 2 W (q) gD (ω, q, φ) ,\n\n(4)\n\nwhere gD (ω, q, φ) is the Fourier-transformed real-space solution of the equation LD gD = sin φ sin(φ −\nφq )δ(r), φq is the angle of q, and W (q) is the Fourier transform of the correlator hV (0)V (r)i. For the\ncase of impurities separated from the 2DEG by a spacer of width d, Eq. (4) gives [5]\n(0)\n∆ρxx /ρ0 = ∆Mxx /Mxx\n= 2π −1 ζ(3/2) (d/l)3 (ωc τtr )9/2 .\n\n(5)\n\nOne sees that the MR due to the memory effects is much larger than that related to the effect of magnetic\nfield on the collision integral for ωc τtr ≫ (l/d)2/5 . The MR (5) becomes of order unity when the meansquare shift of the guiding center of a cyclotron orbit after one revolution,\nδ = 2π 1/2 vF τtr /(ωc τtr )3/2 ,\n\n(6)\nc 2003 WILEY-VCH Verlag GmbH & Co. KGaA, Weinheim\n\n\fpss header will be provided by the publisher\n\n3\n\nbecomes of order d, which happens at ωc τtr ∼ (l/d)2/3 . At higher fields, the strong positive MR is followed\nby a sharp (exponential) falloff of ρxx with growing B [6]:\nln(ρxx /ρ0 ) ∼ −(d/δ)2/3 ,\n\n(7)\n\nwhich is due to the increasing adiabaticity of the electron dynamics and the related quasiclassical localization. The self-intersection induced MR, given by Eq. (5), may be considered as a precursor of the adiabatic\nlocalization.\nIn the limit of weak inhomogeneities, the return-induced MR depends in an essential way on the behavior of the disorder under time reversal [5]; in particular, it is strongly enhanced in a random magnetic field\n(RMF). The case of a smoothly varying RMF is of particular interest in view of the composite-fermion\ndescription of the transport properties of a half-filled Landau level [7]. Also, a long-range RMF has been\nrealized in semiconductor heterostructures by attaching superconducting or ferromagnetic overlayers or by\n\"prepatterning\" the sample (randomly curving the 2DEG layer). Following the same route as for the case\nof a random scalar potential, the MR due to the quasiclassical memory effects is obtained as [5]\nρxx /ρ0 = 1/2 + [1/4 + (B/B0 )2 ]1/2 ,\n\n(8)\n\nwhere B0 is the characteristic amplitude of fluctuations of the RMF. For the composite-fermion model at\nhalf-filling, (B/B0 )2 is represented as 2(d/l)(ωc τtr )2 . The adiabatic localization in the RMF begins at\nB ∼ B0 (l/d)1/6 [8], so that there is a wide range of B in which the positive MR (8) is strong.\n3\n\nα2−1/3\n\n5\n\nα1−1/3\n\nρxx(B)/ρ0\n\nρxx(B)/ρ0\n\n4\n\n2\n\n3\n\nα1=0.0138\nα2=0.083\nα3=0.2\n\n2\n\n1\n\nl/d=290\n\n0\n\n0\n\n100\n\nωcτ\n\n1\n\n200\n\n0\n\n0\n\n2\n\n6\n\n4\n\n8\n\n10\n\nB/B0\n\nFig. 1 Magnetoresistivity in a random potential from nu- Fig. 2 Magnetoresistivity in a random magnetic field\nmerical simulations in comparison with Eq. (5) for l/d = from numerical simulations for three different strengths\n290.\nof the disorder α = (eB0 /mc)(d/vF ); the full line corresponds to Eq. (8).\n\nThe numerically calculated MR [5] for both types of disorder shown in Figs. 1 and 2 confirm the\ntheoretically predicted positive MR. Note that the MR in the RMF at moderately small d/l still exists, but\nbecomes weak; this is the region of d/l relevant to the composite-fermion model. The numerical data for\nd/l ∼ 0.1 − 0.2 agree well [8] with the experimental results [9] for the MR around half-filling. Recent\n9/2\nunpublished numerical simulations [10] also confirm the ωc positive MR in a smooth potential; however,\nthe numerical coefficient is found [10] to be smaller by a factor ∼ 2 as compared to Eq. (5).\n2.2 Magnetoresistance of a 2DEG subject to two-component disorder\nWe now turn to a 2DEG moving in a non-Gaussian random potential represented by rare strong shortrange scatterers and subject additionally to a smooth random potential discussed in Sec. 2.1. One of the\nmost relevant experimental realizations of the model of \"two-component disorder\" is random antidot (AD)\nc 2003 WILEY-VCH Verlag GmbH & Co. KGaA, Weinheim\n\n\f4\n\nI.A. Dmitriev et al.: Magnetotransport in quantum-Hall systems\n\narrays, where the potential barriers around the ADs can be modeled as hard disks reflecting electrons\nspecularly (for experimental work on the dc MR in random AD arrays see, e.g., Refs. [11, 12, 13, 14, 15,\n16]). The model is also applicable to the description of the MR in an unstructured ultra-high mobility 2DEG\nwith a wide spacer, where large-angle scattering on residual interface impurities and interface roughness\nbecomes important [17, 18, 19], limiting the mobility with further increasing width of the spacer. From the\ntheoretical point of view, the interplay of the two types of inhomogeneities is quite remarkable in that it\nyields nontrivial physics which is absent in the limiting cases, when only one type is present. In particular,\nalthough in the extreme of strong B → ∞ the resistivity ρxx tends to zero in either of the limiting cases,\nit diverges in the presence of both types of disorder [20]. Also, in the experimentally relevant situation\nwhen the mean free path at zero B is determined by scattering on ADs, the presence of weak long-range\ndisorder will nonetheless become of crucial importance with increasing B [21, 20]. The magnetotransport\nin the Lorentz-gas model describing an AD array without smooth disorder has been studied, in particular,\nin Refs. [22, 23, 24, 25, 26]. A strong negative MR followed by a metal-insulator phase transition in a\nstrong magnetic field was found in [22, 23, 25]; the low-field anomalous MR due to the \"corridor effect\"\nwas investigated in [26]. Smooth disorder, however, changes the MR qualitatively, as discussed below.\nGeneralizing the formalism described in Sec. 2.1 to the case of two-scale disorder, we represent the\nLiouville operator as L = LD + δL, where LD is given by Eq. (3) and includesP\ninteraction with the smooth\ndisorder (τsm is the corresponding transport scattering time), whereas δL = − i IRi describes collisions\nwith ADs whose random positions are Ri . The Fourier transform I ̃q of the collision operator IRi yields the\ntransport time τS for the scattering by the AD array of density nS through I ̃0 n = −n/nS τS . We assume\n−1\nthat ωc−1 ≪ τS ≪ τsm , so that the total transport rate is determined by ADs, τtr−1 = τS−1 + τsm\n≃ τS−1 .\nThe leading contribution to ∆Mxx reads\nR\n(9)\n∆Mxx = −nS (dφ/π) cos φ IR DIR cos φ ,\n\nwhere the propagator D includes the first-order self-energy: D = (LD − nS I ̃0 )−1 . As compared to the\nLorentz model [27] in which only hard-disk scatterers are present, new physics emerges in the limit δ ≫ a,\nwhere a is the radius of the ADs and δ is the shift of the cyclotron orbit after one revolution due to scattering\non smooth disorder (cf. Sec. 2.1). In particular, Eq. (9) yields [21]\n∆ρxx /ρ0 = −(ωc /ω0 )2 ,\n\nω0 = (2πnS )1/2 vF (3τS /2τsm )1/4 ,\n\n(10)\n\nfor ωc ≪ ω0 . The mechanism of the negative MR (10) can be understood as follows. If one associates with\na particle trajectory a strip of width 2a, the ratio (ωc /ω0 )2 gives the fraction of the area \"explored\" twice,\nwhich implies an effective reduction of the exploration rate and thus a longer time between collisions with\ndifferent ADs. The negative MR (10) should be contrasted with the positive MR (5) for one-scale smooth\ndisorder, where the passages through the same area lead to an enhanced scattering rate.\nFor ωc ≫ ω0 , the renormalized scattering time τS′ ≫ τS should be found self-consistently from the\ncondition nS ξRc ∼ 1, where ξ ∼ δ(vF τS′ /Rc )1/2 is a characteristic end-to-end size of the diffusive\nguiding-center trajectory in time τS′ , which gives the B −4 falloff [21] with increasing B:\nρxx /ρ0 ∼ τS /τS′ ∼ (τS /τsm )(nS Rc2 )2 .\n\n(11)\n\nEquation (11) is valid as long as τS′ ≪ τsm , which is rewritten as nS Rc2 ≫ 1. In the opposite limit (but still\nfor δ ≪ d), the scattering on ADs stops playing any role and ρxx has a plateau with\nρxx /ρ0 = τS /τsm .\n\n(12)\n\nLet us now briefly outline what happens at larger B, namely for δ/d ≪ 1 [20]. In dilute AD arrays\nfor intermediate B, the exponential slowdown of the electron dynamics induced by adiabatic localization\ntransforms into ρxx /ρ0 ∼ nS Rc d ln(1/nS Rc d) ∝ B −1 ln B due to rare collisions with ADs which mix\nc 2003 WILEY-VCH Verlag GmbH & Co. KGaA, Weinheim\n\n\fpss header will be provided by the publisher\n\n5\n\notherwise closed drift trajectories in phase space. Most interesting, however, is the behavior of ρxx in\nthe limit of large B, where ρxx starts to grow as a power law with increasing B. This behavior can be\nmost clearly seen in a \"hydrodynamic model\" of the chaotic AD array (nS → ∞, τS = const), where\nthe problem can be mapped onto that of advection-diffusion transport [28]. In the limit B → ∞ the\nhydrodynamic model predicts ρxx /ρ0 ∼ (τS2 vF d/τsm Rc2 )5/13 ∝ B 10/13 . The physics of the positive MR\nis a percolation of drifting cyclotron orbits limited by scattering on ADs. The growth is checked on the side\nof large B by quantum effects (Shubnikov-de Haas oscillations). The different types of the MR in the twocomponent model [20] are illustrated in Fig. 3 for various concentrations of short-range scatterers (ADs):\n(i) the MR is positive owing to the \"diffusion-controlled percolation\"; (ii) due to the adiabatic localization,\nthe concentration of conducting electrons decreases as B −1 ln B before the percolation becomes effective,\nwhich yields a negative MR ρxx (B) ∝ B −1 ln B for intermediate B; (iii) an exponentially sharp falloff of\nρxx (B) at B ∼ Bad (shown as a vertical jump) separates the diffusive and drift regimes; (iv) because of\nthe memory effects, the collision time for scattering by ADs is increased as compared to the Drude value\nalready in the diffusive regime (B ≪ Bad ), which leads to the negative MR ρxx (B) ∝ B −4 for small B;\n(v) for intermediate B, the scattering on ADs stops playing any role and ρxx (B) is saturated at a value\ndetermined by the long-range disorder only, whereas at larger fields the diffusion-controlled percolation\ngives rise to a positive MR.\n\n(i)\n(ii)\n(iii)\n\n6\n5\n\n1.0\n=0\n\n4\n\n(v)\n\nB\n\nFig. 3 Schematic behavior of the magnetoresistivity\nρxx (B) on a log-log scale in the two-component disorder\nmodel for different values of the concentration of antidots n: n(i) > n(ii) > . . . > n(v) , keeping all other parameters (τS , τsm , d) fixed. Only one characteristic field\nBad is shown, at which the crossover between diffusive\ndynamics and adiabatic drift in the long-range potential\ntakes place.\n\ntS/tsm\n0.01\n\n0.06\n\n0.5\n\n0.0\n0\n\nBad\n\n3\n\nsm\n\nrxx/r0, 1/t\n\n(iv)\n\nw0/wt\n\nρxx (B)\nρxx (0)\n\n2\n\n4\n\n6\n\n8\n\nwc/wt\n\nFig. 4 Magnetoresistivity in a two-component-disorder\nmodel at fixed τS and different τsm from numerical simulations; τsm /τS = ∞ (Lorentz gas, △), 111 ( ), 70 (\u0003),\n37 (♦). Inset: ω0 determined from the fit to the quadratic\nbehavior given by Eq. (10); the full line corresponds to\nthe analytical result for ω0 from Eq. (10).\n\nThe MR obtained numerically [21] for the model of two-scale disorder in the regime of Eqs. (10)(12), Fig. 4, shows good agreement with the above analytical results. As far as the experimental data are\nconcerned, for typical parameters [13] of AD arrays, nS = (0.6 μm)−2 , vF τS = 1.3 μm, vF τsm = 16 μm,\nand the electron density 5 × 1011 cm−2 , the field B0 corresponding to the frequency ω0 given by Eq. (10)\nis ≃ 0.3 T , in agreement with the experimental findings [13]. A similar negative MR was reported in\nRefs. [11, 12, 14]. For ultra-high mobility samples [electron density 2 × 1011 cm−2 , vF τS ≃ 80 μm,\nτsm /τS ∼ 10, a ∼ 10 nm, nS ∼ (2 μm)−2 [18]], one gets B0 ∼ 60 mT. A strong negative MR has indeed\nbeen observed [19, 29] in the very-high-mobility heterostructures, in qualitative agreement with the above\ntheory.\nc 2003 WILEY-VCH Verlag GmbH & Co. KGaA, Weinheim\n\n\f6\n\nI.A. Dmitriev et al.: Magnetotransport in quantum-Hall systems\n\n2.3 Quasiclassical memory effects in ac magnetotransport\nIn addition to the strong MR, the non-Markovian quasiclassical kinetics in the presence of long-range\ndisorder gives rise to an anomalous ac response. In particular, the return-induced correction to the ac\nconductivity Re σ(ω) exhibits a kink [30] ∝ |ω| at ω → 0. The quasiclassical zero-frequency anomaly is\nnot sensitive to inelastic scattering (in contrast to the weak-localization quantum correction) but manifests\nitself only [31] in the presence of an external metallic gate that screens the long-range Coulomb interaction.\nAs outlined below, in a strong B, the diagonal ac conductivity Re σxx (ω) shows pronounced resonant\nfeatures [32, 33] on top of the cyclotron resonance (CR), which are induced by the memory effects.\nIn the Lorentz model (hard disks with no smooth disorder), which is intended to mimic a random\nAD array in heterostructures in the limit of a large spacer, the shape of the CR is very different from\nthe Lorentzian and not characterized by the Drude scattering rate [24, 32]. Altogether, the behavior of\nRe σxx (ω) associated with quasiclassical cyclotron orbits skipping around the ADs turns out to be remarkably rich [32]. The skipping-orbit contribution is broadened on a scale of ωc and vanishes at ωc in a\nnonanalytical way as |ω − ωc |. Apart from these two features, Re σxx (ω) for moderately strong B with\nRc ≫ a oscillates with a period ωc up to ω = ωc Rc /a and shows a series of square-root spikes for larger\nω. The modulation yields exact zeros of the ac response at the harmonics of the CR.\nAdding a smooth random potential, present in typical heterostructures, changes the above picture in an\nessential way. Following the formalism of Sec. 2.2, the classical return-induced contribution to the real\n(c)\npart of the oscillatory ac conductivity σω is represented for τS ≪ τsm and δ ≫ d as [33]\nσω(c) /σωD = −Re Pω /nS τS ,\n\nPω =\n\nP∞ R\nn=1\n\ndt e−iωt−t/τS pn [ 0, vF (t − 2πn/ωc ) ] ,\n\n(13)\n\nwhere σωD is the real part\ni conductivity, Eq. (30). In Eq. (13), the function pn (x⊥ , xk ) =\nh of the dynamic Drude\n\n(31/2 πn2 δ 2 )−1 exp −(3x2⊥ + x2k )/3nδ 2 describes the electron distribution in time t = 2πn/ωc after n\n\ncyclotron revolutions along (xk ) and across (x⊥ ) the cyclotron orbit. In the case of a weak damping of\n(c)\nthe quasiclassical magnetooscillations, σω is represented as a series of sharp dips at ω = N ωc , whose\nD\n−1\namplitude and width are of order σ (a/N δ)(ωc τ )1/2 and τS−1 + N 2 τsm\n, respectively. In the regime of\n(c)\nharmonic oscillations (exponential damping), σω is written as [33]\n\u0002\n\u0003\nσω(c) /σωD = 1 − (a/π 1/2 δ) cos(2πω/ωc ) exp −(ω/ωc )2 (3π/ωc τsm ) .\n\n(14)\n\nIt is worth stressing that these oscillations are of essentially classical origin and have nothing to do with\n(c)\nthe Landau quantization. The behavior of σω is illustrated in Fig. 5, where also the quantum oscillations\n∝ exp(−2π/ωc τq ), with τq being the single-particle (quantum) relaxation time, are shown. One sees that\nthe classical oscillations may be stronger than the quantum ones since in high-mobility structures τq ≪ τsm\nand the quantum oscillations are damped much more strongly.\n\n(c)\n\n(q)\n\nFig. 5 Quasiclassical [σω , Eq. (14)] and quantum [σω ] oscillatory ac conductivity (normalized to the Drude conductivity σωD )\nvs ωc /ω for ω/2π = 100 GHz, τsm = 0.6 ns, τsm /τq = 50,\nτS /τsm = 0.1, a/δ = 0.25 at ωc /ω = 1/2.\n\nc 2003 WILEY-VCH Verlag GmbH & Co. KGaA, Weinheim\n\n\fpss header will be provided by the publisher\n\n7\n\n3 Magnetotransport in modulated systems (lateral superlattices)\n3.1 Weiss oscillations in one-dimensional superlattices\nTransport properties of a two-dimensional electron gas (2DEG) subject to a periodic potential (lateral superlattice) with a period much shorter than the electron transport mean free path (but much larger than the\nFermi wave length) have been intensively studied during the last decade. In a pioneering experiment [34]\nWeiss et al. discovered that a weak one-dimensional (1D) modulation with wave vector q k ex induces\nstrong commensurability oscillations of the magnetoresistivity ρxx (B) (while showing almost no effect on\nρyy (B) and ρxy (B)), with the minima satisfying the condition 2Rc /a = n − 1/4, n = 1, 2, . . ., where\nRc is the cyclotron radius and a = 2π/q the modulation wave length. The quasiclassical nature of these\ncommensurability oscillations was demonstrated by Beenakker [35], who showed that the interplay of the\ncyclotron motion and the superlattice potential induces a drift of the guiding center along y axis, with\nan amplitude squared oscillating as cos2 (qRc − π/4) (this is also reproduced by a quantum-mechanical\ncalculation, see [36]). While describing nicely the period and the phase of the experimentally observed\noscillations, the result of [35], however, failed to explain the observed rapid decay of the oscillation amplitude with decreasing magnetic field. The cause for this discrepancy was in the treatment of disorder: while\nRef. [35] assumed isotropic impurity scattering, in experimentally relevant high-mobility semiconductor\nheterostructures the random potential is very smooth and induces predominantly small-angle scattering,\n−1\nwith the total relaxation rate τq−1 much exceeding the momentum relaxation rate τtr\n. The theory of\ncommensurability oscillations in one-dimensional modulation, V (x) = ηEF cos qx with η ≪ 1, in the\nsituation of smooth disorder was worked out in [37].\nThe starting point is the Boltzmann equation for the distribution function F (x, n) of electrons,\nLF (x, n) = −ev(x)En ;\n\nL = v(x)n∂r + ωc ∂φ − sin φv ′ (x)∂φ − C ,\n\n(15)\n\nwhere n = (cos φ, sin φ) is the direction and v(x) = [2m(EF + eU (x))]1/2 the magnitude of the Fermi\nvelocity, and C is the collision integral. The resulting modulation-induced contribution to resistivity reads\n[37]\n\"\n\u0013−1/2 #\n\u0012\nτq 2\nη 2 ql\nπ\nQ\n∆ρxx\n, (16)\n1− 1+\n=\nQ\nQ\nJiμ (Q)J−iμ (Q) ;\nμ=\nρ0\n4\nsinh πμ\nqvF τq\nτtr\nwhere we introduced the dimensionless parameter Q = qRc convenient to characterize the strength of the\nmagnetic field. At low magnetic fields, Q ≫ Qdis , with Qdis = (2ql/π)1/3 , the oscillations are exponentially damped by disorder, and the magnetoresistivity saturates at the value ∆ρxx /ρ0 = η 2 ql/4. (At still\nlower magnetic fields, Q > Qch , with Qch = 2/η, and for a sufficiently strong modulation, η 3/2 ql ≫ 1,\nan additional strong magnetoresistivity occurs, dominated by the channeled orbits, see Sec. 3.3.) In strong\nfields, Q ≪ Qdis , the amplitude of oscillations increases as B 3 ,\n∆ρxx /ρ0 = [(ηql)2 /πQ3 ] cos2 (Q − π/4) .\n\n(17)\n\nIn Fig. 6 the theoretical results are compared with experimental data of Weiss et al [34]. The sample\nparameters are [34] q = 2π/382nm, ne = 3.16 × 1011 cm−2 , τtr = 52ps, the total relaxation rate is\ntaken to be τq−1 = (3ps)−1 . As is seen from the figure, with the modulation strength η = 0.065 a\nvery good description of the experimentally observed magnetoresistivity is obtained. (At lowest B, the\nexperimental data show positive magnetoresistance discussed in Sec. 3.3.) The difference between the\nlong-range potential scattering and the isotropic scattering is illustrated in the right panel, where the results\nfor the modulation-induced ∆ρxx are plotted for both models of disorder at the same value of τtr . As was\nshown in [38], modulation-induced commensurability oscillations can be also observed in attenuation and\nvelocity change of a surface acoustic wave propagating near a 2DEG.\nc 2003 WILEY-VCH Verlag GmbH & Co. KGaA, Weinheim\n\n\f8\n\nI.A. Dmitriev et al.: Magnetotransport in quantum-Hall systems\n\n36.0\n\n8000.0\n\n32.0\n6000.0\n\n(4/η ) δρxx/ρ0\n\n24.0\n\n4000.0\n\n2\n\nρxx(Ω)\n\n28.0\n\n20.0\n\n2000.0\n\n16.0\n12.0\n0.0\n\n0.1\n\n0.2\n\n0.3\n\n0.4\n\n0.5\n\n0.0\n0.0\n\nB (Tesla)\n\n0.2\n\n0.4\n\n0.6\n\n0.8\n\n1.0\n\nB (Tesla)\n\nFig. 6 Weiss oscillations in a 1D superlattice. Left panel: Experimental data of Ref.[34] (dash-dotted line) compared\nwith the theoretical results for the long-range potential scattering (full line). Parameters are: q = 2π/382nm, ne =\n3.16 × 1011 cm−2 , τ = 52ps, τs = 3ps, η = 0.065. Right panel: Grating-induced correction to the 2DEG reistivity,\n∆ρxx /ρ0 , in units of η 2 /4 for the isotropic potential scattering (τtr = 52ps, full line) and the long-range random\npotential scattering (τtr = 52ps, τq = 3ps, dash-dotted line). The sample parameters (q = 2π/382nm, ne =\n3.16 × 1011 cm−2 ) are the same as in Ref.[34].\n\nIn [39] Weiss oscillations were studied for the vicintiy of the ν = 1/2 filling of the lowest Landau level;\nsee also related works [40, 41]. Within the composite fermion theory, the problem is described in terms\nof fermions subject to a spatially modulated magnetic field and scattered by a random magnetic field. The\nmagnetic character of modulation shifts the phase of Weiss oscillations, while the random magnetic fields\nconsiderably enhances their damping. The obtained results are in agreement with experimental studies\n[42, 43], which confirms the validity of the composite-fermion description of the ν = 1/2 state.\n3.2 Two-dimensional superlattices\nMagnetotransport in 2D superlattices with small-angle impurity scattering was studied in [44]. It was\nshown that the shape of the magnetoresistivity depends crucially on the parameter γ = η 2 ql/4.\nFor small γ (corresponding typically to a modulation strength not exceeding a few percent) the magnetoresistivity is given by the perturbative formulas (16) – (17) (the same as in 1D superlattices) up to the\npoint Q ∼ QP ≡ [0.13(ηql)2 ]1/3 , where the correction ∆ρxx becomes of the order of the Drude resistivity\nρ0 . For higher magnetic fields the Péclet number P ∼ ηql/(qRc )3/2 characterizing the advection-diffusion\nproblem becomes large and the transport is determined by a narrow boundary layer around a square network of separatrices. As a result, the B 3 -dependence of the oscillation amplitude characteristic for the\nperturbative (Q > QP ) regime crosses over to a much slower B 3/4 -increase at Q < QP ,\n∆ρxx /ρ0 = (8π)1/4 C(ηql)1/2 Q−3/4 | cos(Q − π/4)|1/2 .\n\n(18)\n\nFor γ ≫ 1 (which is typically valid for the modulation strength η larger than 10 ÷ 15%) the oscillations\nare damped at low magnetic fields not by disorder (as in the perturbative regime) but by the modulationinduced chaotic diffusion. The oscillations become observable at Q ∼ Qad ≡ (4π/η 2 )1/3 where the\nmotion of electrons in the superlattice potential acquires the form of adiabatic drift. Since the violation of\nadiabaticity is exponentially small, the magnetoresistivity drops exponentially in a logarithmically narrow\ninterval of magnetic fields, Q′ad ≡ Qad (ln γ)−2/3 < Q < Qad ,\n√\n∆ρxx /ρ0 ∝ exp[−(π/2 2| cos(Q − π/4)|)(Qad /Q)3/2 ] .\n\n(19)\n\nc 2003 WILEY-VCH Verlag GmbH & Co. KGaA, Weinheim\n\n\fpss header will be provided by the publisher\n\n9\n\nAt higher magnetic fields the impurity scattering starts to dominate over the non-adiabatic processes and\nthus to determine the diffusion constant of the advection-diffusion problem, so that the commensurability\noscillations take the same form (18) as in the large-P limit of the γ ≪ 1 regime.\n3/4\n\nB\n\nγ\n3/4\n\n∆ρxx/ρ0\n\n∆ρxx/ρ0\n\nB\n3\n\nB\n\n1\n\nγ\n\n1/2\n\n1\n\nγ\nBdis\n\nBP\n\nB\n\nBad B′ad\n\nB\n\nFig. 7 Left panel: Schematic representation of the magnetoresistivity ∆ρxx (B) induced by a 2D modulation in the\ncase γ ≪ 1. Characteristic points Bdis and BP on the magnetic field axis (corresponding to Q = Qdis and Q = QP ,\nsee the text) are shown. Below Bdis the oscillations are exponentially damped and the magnetoresistivity saturates\nat ∆ρxx = γ, while at B = BP the B 3 -behavior of ∆ρxx changes to a much slower, B 3/4 -increase. Right panel:\nSchematic representation of ∆ρxx (B) in the case γ ≫ 1. The magnetoresistivity starts to drop exponentially and the\ncommensurability oscillation appear at the value Bad of the magnetic field where the motion in the periodic potential\n′\ntakes the form of an adiabatic drift. At B ∼ Bad\nthe disorder starts to dominate over the non-adiabatic effects, leading\n3/4\nto a B -increase of the oscillation amplitude.\n\n3.3 Low-field magnetoresistance\nA distinct low-field magnetoresistivity was observed, along with the commensurability oscillations, in the\noriginal experiment [34], as well as in numerous later experiments on the transport in a lateral superlattice.\nSpecifically, in low magnetic fields B a positive magnetoresistivity was found, followed by a maximum\nin ρxx (B). For not too strong modulation, the relevant magnetic fields are much weaker than those where\nthe Weiss oscillations are observed, so that the two effects can be easily separated. Soon after the first\nexperimental observation it was understood [47] (see also [46]) that the low-field magnetoresistivity is\nrelated to the existence of open (channeled) orbits in the magnetic fields B < Bc = (ηc/2e)qmvF . It is\nworth mentioning that this effect, which is not found within the η-expansion used in Refs. [35, 37], has its\ncounterpart in the context of the sound absorption in metals in the presence of a magnetic field. There, the\ntrapping of electrons in channeled orbits by a sound wave leads to non-linearity of the acoustic response of\nan electron gas, as was observed experimentally [48] and analyzed theoretically [49].\nA quantitative analytical description of the problem in the presence of disorder was worked out in [45].\nIt was found that for a suffuciently strong modulation, η 3/2 ql ≫ 1, the contribution of channeled orbits to\nresistivity has the form\n√\n2 7/2\n(ql)2 Fch (β) ,\n(20)\n∆ρch\nxx /ρ0 = ( 2/π )η\nwhere β = B/Bc and Fch (β) is a parameterless function shown in the left panel of Fig. 8. This induces a\nlow-field magnetoresistance that scales as η 7/2 with the modulation strength. It was further shown in [45]\nthat the contribution of non-channeled orbits is also modified at B . Bc ,\n2\n2\n2\n∆ρnc\nxx /ρ0 = 2πωc τ hvd i/vF = (η /2π)qlFnc (B/Bc ) ,\n\n(21)\n\nwhere the dimensionless function Fnc (β) is shown in the middle panel of Fig. 8. In the right panel of Fig. 8\nthe theoretical results are compared with experimental data of Ref. [50].\nc 2003 WILEY-VCH Verlag GmbH & Co. KGaA, Weinheim\n\n\f10\n\nI.A. Dmitriev et al.: Magnetotransport in quantum-Hall systems\n3\n\n15\n\n0.04\n\n(b)\n\nexp.\n2\n\n10\n\n0.02\n\n∆ρxx/ρ0\n\nFnc(β)\n\nFch(β)\n\n0.03\n\n1\n\nFch\n5\n\nFnc\n\n0.01\n\n0\n\n0\n0\n\n0.2\n\n0.4\n\n0.6\n\nβ\n\n0.8\n\n1\n\n0\n\n1\n\n2\n\n0\n\n3\n\nβ\n\n0\n\n0.1\n\n0.2\n\n0.3\n\n0.4\n\n0.5\n\nB (T)\n\nFig. 8 Left panel: Function Fch (β) describing magnetic field dependence of the contribution of channeled orbits\nto the resistivity. Middle panel: Function Fnc (β) characterizing the magnetic field dependence of the contribution of\nnon-channeled orbits to resistivity. The dashed line indicates the asymptotic value Fnc (β ≫ 1) = π/2. Right panel:\nExperimental data for the low-field magnetoresistivity from Ref. [50] (dashed curve) compared to the theoretical results\nfor the contributions of channeled [Eq.(21)] and non-channeled [Eq.(20)] orbits. The characteristic field Bc and the\nmodulation amplitude found from the fit are Bc ≃ 0.37 T and η ≃ 0.16.\n\n4 Interaction-induced magnetoresistance in non-quantizing fields\nAs discussed in Sec. 2, the longitudinal resistivity of an isotropic degenerate system is B–independent\nwithin the Drude-Boltzmann theory, ρxx (B) = ρ0 = (e2 νvF2 τtr )−1 , where ν0 is the density of states per\nspin. There are several distinct sources of a non-trivial MR, which reflect the rich physics of 2D systems.\nFirst, quasiclassical memory effects may lead to a MR(see Sec.2), which shows no T -dependence at low\ntemperatures. Second, weak localization [51] induces a negative quantum MR restricted to the range of\nweak magnetic fields. Another quantum-mechanical source of the MR is electron–electron interaction.\nThis type of the MR is the subject of the present Section.\nIt was discovered by Altshuler and Aronov [51] that the Coulomb interaction enhanced by the diffusive\nmotion of electrons gives rise to a quantum correction to conductivity, which has in 2D the form δσxx ≃\n(e2 /2π 2 ) ln T τtr (it is assumed here for simplicity that κ ≪ kF , where κ = 4πe2 ν0 is the inverse screening\nlength; we also set kB = ~ = 1). The condition T τtr ≪ 1 under which this result is derived [51] implies\nthat electrons move diffusively on the time scale 1/T and is termed the \"diffusive regime\". Subsequent\nwork [52] showed that in a strong magnetic field this correction (in combination with δσxy = 0) gives rise\nto a parabolic interaction–induced quantum MR,\nδρxx (B)/ρ0 ≃ [(ωc τtr )2 − 1](πkF l)−1 ln T τtr ,\n\nT τtr ≪ 1,\n\n(22)\n\nwhere ωc = eB/mc is the cyclotron frequency and l = vF τtr the transport mean free path.\nThe effect of interaction on the conductivity in the \"ballistic regime\" T > 1/τtr has attracted a great deal\nof interest in a context of 2D systems showing a seemingly metallic behavior, dρ/dT > 0 [53, 54]. Zala,\nNarozhny, and Aleiner [55] developed a systematic theory of the interaction corrections valid for arbitrary\nT τtr . In the ballistic range of temperatures, this theory predicts a linear-in-T correction to conductivity σxx\nand a 1/T correction to the Hall coefficient ρxy /B at B → 0, and describes the MR in a parallel field.\nThe consideration of [55] is restricted, however, to classically weak transverse fields, ωc τtr ≪ 1, and to the\nwhite-noise disorder.\nIn this Section, we present a general theory of the interaction–induced corrections to the conductivity\ntensor of 2D electrons valid for arbitrary T , B and type of disorder [56]. A general expression for δσαβ\nis derived in terms of the ballistic propagator D(ω, q; n, n′ ) describing the quasiclassical propagation of\nan electron in the phase space (n is the unit vector characterizing the direction of velocity on the Fermi\nsurface). The result for the exchange contribution reads\nZ\nZ ∞\nω o\nd2 q\ndω ∂ n\nω coth\nIm [ U (ω, q) Bαβ (ω, q) ] ,\n(23)\nδσαβ = −2e2 vF2 ν0\n2T\n(2π)2\n−∞ 2π ∂ω\nc 2003 WILEY-VCH Verlag GmbH & Co. KGaA, Weinheim\n\n\fpss header will be provided by the publisher\n\n11\n\nwhere U (ω, q) is the interaction potential equal to a constant U0 for point-like interaction and to U (ω, q) =\n2πe2 {q + κ[1 + iωhD(ω, q)i]}−1 for screened Coulomb interaction. The angular brackets h. . . i denote\naveraging over velocity directions n, n′ . The tensor Bαβ (ω, q) is given by\nBαβ (ω, q) =\n−\n\nTαγ πν0 [hDSγδ Di − 2hDnγ W nδ Di]Tδβ + Tαγ (δγδ hDi/2 − hnγ Dnδ i) Tδβ\n2Tαγ hnγ Dnβ Di − hDnα Dnβ Di,\n(24)\n\nwhere Tαβ = 2 hnα Dnβ i|q=0,ω→0 = σαβ /e2 vF2 ν0 , Sxx = Syy = W (n, n′ ), Sxy = −Syx =\nωc /2πν0 , and W (n, n′ ) is the impurity scattering cross-section. At B → 0 one recovers the results\nfor δσxx and ρxy obtained in a different way in [55] for a white-noise disorder. Needless to say, in the\ndiffusive limit, Eqs. (23), (24) reproduce (for arbitrary B and disorder range) the logarithmic correction\n(22).\nThe structure of Eqs. (23), (24) implies that the interaction correction is governed by returns of a particle\nto the original point in a time t < T −1 ≪ τtr . In a smooth random potential with a correlation length d ≫\nkF−1 the return probability is exponentially suppressed for t ≪ τtr . Therefore, the interaction correction in\nthe ballistic regime is exponentially small at B = 0 for the case of smooth disorder. Moreover, the same\nargument applies to the case of a non-zero B, as long as ωc ≪ T .\nThe situation changes qualitatively in a strong B, ωc ≫ T, τtr−1 : the particle experiences within the time\nt ∼ T −1 multiple cyclotron returns to the region close to the starting point. The MR is then determined by\nthe correction to σxx . For the Coulomb interaction, the exchange contribution to the MR is given by\nδρxx /ρ0 = −(ωc τtr )2 GF (T τtr )/πkF l.\n\n(25)\n\nFor the point-like interaction a similar result is obtained, with the replacement GF (T τtr ) → ν0 U0 G0 (T τtr ).\nThe functions G0 (T τtr ) and GF (T τtr ), governing the T -dependence of the MR, are shown in Fig. 9. In the\ndiffusive (T τtr ≪ 1) and ballistic (T τtr ≫ 1) limits they have the following asymptotics\nG0 (x) ≃\n\n\u001a\n\n− ln x + const,\nc0 x−1/2 ,\n\nx ≪ 1,\nx ≫ 1,\n\nGF (x) ≃\n\n\u001a\n\n− ln x + const,\nc0 x−1/2 /2,\n\nx ≪ 1,\nx ≫ 1,\n\n(26)\n\n√\nwhere c0 = 3ζ(3/2)/16 π ≃ 0.276\n3\n\n10\n\n3\n\n6\n\nG0(x)\n\nGF(x)\n\n−1.7−ln x\n\n−1.6−ln x\n2\n\n−1/2\n\n−1/2\n\nGF\n\nG0\n\nb\n\n5\n4\n\n6\n\n0.138 x\n\nG0\n\n0.276 x\n\nGF\n\n2\n\na\n\n8\n\n3\n\n4\n1\n\n1\n\na\n0\n0.01\n\n2\n\n2\n\nb\n0.1\n\n1\n\nTτ\n\n10\n\n0\n0.01\n\n0.1\n\n1\n\nTτ\n\n10\n\n0\n0.01\n\n1\n\n0.1\n\n1\n\nTτ\n\n10\n\n0\n0.01\n\n0.1\n\n1\n\n10\n\nTτ\n\nmix\nFig. 9 Functions G0 (T τtr ) (a) and GF (T τtr ) (b) deter- Fig. 10 Functions Gmix\n0 (T τtr ) (a) and GF (T τtr ) (b) demining the T -dependence of the exchange term for point- scribing the T dependence of the MR for point-like and\nlike and Coulomb interaction, respectively, Eq. (26).\nCoulomb interaction, respectively, in the mixed-disorder\nmodel for different values of parameter γ ≡ τsm /τtr =\n20, 10, 5 (from top to bottom). Dashed curves represent\nthese functions for purely smooth disorder (γ = 1).\n\nWe turn now to the Hartree term, assuming κ ≪ kF . The expression for its triplet part is analogous to\n(23) with the replacement of U (ω, q) by − 23 U (0, 2kF sin[(φ − φ′ )/2]), where φ and φ′ are the angles of\nthe electron velocity. As to the singlet part, it is renormalized by mixing with the exchange term. The total\nc 2003 WILEY-VCH Verlag GmbH & Co. KGaA, Weinheim\n\n\f12\n\nI.A. Dmitriev et al.: Magnetotransport in quantum-Hall systems\n\nHartree contribution (see Fig. 2) reads\nδρH\nxx (B)\nρ0\n\n\u00023\n\u0003\n\n y ln y 4 ln(T τtr ) + ln y ,\n= f rac(ωc τtr )2 π 2 kF l\ny ln2 [y(T τtr )1/2 ],\n\nπc0 (T τtr )−1/2 ,\n\nT τtr ≪ 1,\n1 ≪ T τtr ≪ (kF /κ)2 ,\nT τtr ≫ (kF /κ)2 .\n\n(27)\n\nIf κ/kF is not small, the exchange contribution remains unchanged, while the Hartree term is subject to\nσ,ρ\nstrong Fermi-liquid renormalization [51, 55] and is determined by angular harmonics Fm\nof the Fermiσ,ρ\n−1/2\nliquid interaction F (θ). The theoretically predicted T\ndependence of the interaction-induced MR\nhas been observed in a high-mobility n-GaAs heterostructure with the smooth disorder [57].\nCalculation of the correction δρxy to the Hall resistivity requires evaluation of both δσxx and δσxy . The\ntemperature dependence of δρxy in a strong B is governed by δσxx in the diffusive limit and by δσxy in\nthe ballistic limit. For the point-like interaction, we find\nρ\n\nδρxy /ρxy = ν0 U0 G0xy (T τtr )/πkF l,\n\nρ\n\nG0xy (x) =\n\n\u001a\n\n−2 ln x + const,\n−11c1 x1/2 ,\n\nx ≪ 1,\nx ≫ 1,\n\n(28)\n\n√\nwith c1 = − πζ(1/2)/4 ≃ 0.647. An analogous consideration for the Coulomb interaction yields a\nsimilar result for the exchange correction (Fig. 11)\nδρF\nxy /ρxy\n\n=\n\nρ\nGFxy (T τtr )/πkF l,\n\nρ\nGFxy (x)\n\n=\n\n\u001a\n\n−2 ln x + const,\n−(11/2)c1 x1/2 ,\n\nx ≪ 1,\nx ≫ 1.\n\n(29)\n\n5\n\nG\n\nρxy\n\n0\n−5\n−10\n−15\n\n−2 ln x −3.2\n1/2\n−3.56 x −0.9\n1/2\n−7.12 x −1.8\n\n−20\n0.01\n\n0.1\n\n1\n\nTτ\n\nρ\n\nρ\n\n10\n\nFig. 11 Functions G0xy (T τtr ) (lower curve)and GFxy (T τtr ) (upper curve) describing the temperature dependence of the Hall resistivity for point-like and\nCoulomb interaction, respectively. Diffusive (x ≪ 1) and ballistic (x ≫ 1)\nasymptotics are also shown.\n\nAbove the interaction correction for a system with a small-angle scattering induced by smooth disorder\nwith correlation length d ≫ kF−1 has been studied. This is a typical situation for high-mobility GaAs\nstructures with sufficiently large spacer d. It is known, however, that with further increasing width of\nthe spacer the large-angle scattering on residual impurities and interface roughness becomes important\nand limits the mobility (see Sec. 2.2). Furthermore, in Si-based structures the transport relaxation rate is\nusually governed by scattering on short-range impurities. This suggests considering the two-component\nmodel of disorder: white-noise random potential with a mean free time τwn and a smooth random potential\n−1\n+\nwith a transport relaxation time τsm . It is assumed that while the transport relaxation rate τtr−1 = τwn\n−1\nτsm\nis governed by short-range disorder, τwn ≪ τsm , the damping of SdHO is dominated by smooth\nrandom potential. This allows one to consider the range of classically strong magnetic fields, ωc τwn ≫ 1,\nneglecting at the same time Landau quantization.\nThe presence of short-range scatterers enhances the MR as compared to the case of smooth disorder.\nFor the point-like interaction the MR reads\n\u0013\n\u0012\n(ωc τtr )2 ν0 U0 mix\nτsm\nδρxx (B)\n,\n=−\nG0\nT τtr ,\nρ0\nπkF l\nτtr\n\nGmix\n0 (x, γ)\n\n=\n\n\u001a\n\n− ln x + (2γ)1/2 ,\n4c0 γ 1/2 x−1/2 ,\n\nx ≪ 1,\nx ≫ 1.\n\nc 2003 WILEY-VCH Verlag GmbH & Co. KGaA, Weinheim\n\n\fpss header will be provided by the publisher\n\n13\n\nIn the case of Coulomb interaction, the exchange contribution is given by\n(\n\u0013\n\u0012\n− ln x + (γ/2)1/2 ,\nδρF,mix\n(B)\n(ωc τtr )2 mix\nτsm\nxx\nmix\n, GF (x, γ) =\n=−\nGF\nT τtr ,\nρ0\nπkF l\nτtr\n2c0 γ 1/2 x−1/2 ,\n\nx ≪ 1,\nx ≫ 1.\n\nThese results (illustrated in Fig. 10) are in a good agreement with experimental data of Ref. [58] for mixed\ndisorder in a Si/SiGe heterostructure. Finally, the ballistic contribution to ρxy is also enhanced by a factor\n∼ (τsm /τtr )1/2 in the mixed disorder model.\nThe formalism can be further applied to anisotropic systems. The interaction-induced correction mixes\nthe components ρxx and ρyy of the resistivity tensor. This result is of special interest in the case of systems subject to a one-dimensional periodic modulation (lateral superlattice, Sec. 3; wave vector k k ex ).\nSpecifically, it has been shown that the interaction induces novel oscillations in ρyy , which are in phase\nwith quasiclassical commensurability (Weiss) oscillations in ρxx .\n\n5 Influence of Landau quantization on magnetotransport\nIn this section, we address magnetooscillations in the dissipative dc and ac conductivity of a 2DEG governed by the Landau quantization. Despite these effects, to the first place, Shubnikov-de Haas oscillations\n(SdHO), are well established experimentally, the theoretical description until recently was only available\n[59] for fully separated Landau levels (LLs) with point-like scatterers [60]. A systematic approach to the\nproblem was developed in Ref. [61]. The results of this work, valid also for overlapping LLs, and for\nexperimentally relevant case of smooth disorder, with the correlation length d ≫ kF−1 , are reviewed below.\nWithin the quasiclassical Boltzmann theory, the dissipative ac conductivity σω = σ+ (ω) + σ− (ω) of a\nnon-interacting 2DEG is given by the Drude formula (we neglect spin for simplicity),\nD\n2\nσ±\n(ω) = (1/4)e2 ν0 vF2 τtr /[1 + (ωc ± ω)2 τtr\n],\n\n(30)\n\nwhere ν0 = m/2π and τtr are the density of states (DOS) and the transport relaxation time at B = 0,\nωc = eB/mc the cyclotron frequency, and m is the electron effective mass. We consider a 2DEG subjected to quantizing magnetic field B and a random potential U (r) characterized by a correlation function\nhU (r)U (r′ )i = W (|r − r′ |). The total and the transport relaxation rates at B = 0 are\n\u001a\n\u001b\nZ\nφ\ndφ\nτq−1\n1\nW̃\n(2k\nsin\n)\n×\n,\n=\n2πν\nF\n0\n−1\n(1 − cos φ)\nτtr\n2π\n2\nwhere W̃ (q) is the Fourier transform of W (r). While we are mainly interested in the experimentally\nrelevant case of smooth disorder, d ≫ kF−1 , with τtr /τq ∼ (kF d)2 ≫ 1, our results are valid for arbitrary\nd (i.e., including short-range disorder with τtr /τq ∼ 1). The conductivity is given by the Kubo formula\nR\nR\nA\nR\nσω = − (e2 /4πV ω) dε (fε − fε+ω )Tr v̂x (GA\nε+ω − Gε+ω )v̂x (Gε − Gε ) ,\n\n(31)\n\nwhere fε is the Fermi distribution, GR,A are the retarded and advanced Green functions, the bar denotes\nimpurity averaging, and V is the system area. At high LLs, εF ≫ ω, ωc , disorder can be treated within the\nself-consistent Born approximation (SCBA) [59] provided the disorder correlation length satisfies d ≪ lB\nand d ≪ vF τq , where lB = (c/eB)1/2 is the magnetic length [62]. The SCBA equations for the Green\nA ∗\nfunction in the LL representation, GR\nn = (Gn ) , read [59, 62],\nX\n−1\nGR\n,\nΣε = (ωc /2πτq,0 )\nGR\n(32)\nn (ε) = (ε − εn − Σε )\nn (ε) ,\nn\n\n1\n2 )ωc\n\nwhere εn = (n +\nis the n-th LL energy (Fig. 12a). The conductivity (31) is given by an electronic\nbubble with a vertex correction, i.e., by a sum of ladder diagrams, Fig. 12b,c. In the case of white-noise\nc 2003 WILEY-VCH Verlag GmbH & Co. KGaA, Weinheim\n\n\f14\n\nI.A. Dmitriev et al.: Magnetotransport in quantum-Hall systems\n\ndisorder, τq = τtr , the vertex correction is zero, and it suffices to evaluate the bare bubble\nb\nσ±\n(ω) =\n\nZ\ne2 vF2 ν0 dε\nRR\n(fε −fε+ω ) Re(ΠRA\n± −Π± ),\n4\nω\n\nRR(RA)\n\nΠ±\n\n=\n\nωc X R\nG\n(ε+ω)GR(A)\n(ε).\nn\n2π n n±1\n\nFor the case of smooth disorder we have to take into account the vertex correction (Fig. 1c) while averaging\nin Eq. (31). This is a non-trivial task since the disorder mixes strongly the LLs, thus seriously complicating\na direct calculation in the LL representation. The result, however, acquires a remarkably simple and physically transparent form: provided the above SCBA conditions are fullfilled, the inclusion of the vertex cor\u0015−1\n\u0014\u0010\n\u0011−1\nRR(RA)\nRR(RA)\nRR(RA)\n−1\n− (τq−1 − τtr\n)\n.\nrection results in a replacement of Π±\nabove by Π±,tr\n≡ Π±\nP\nIt follows that σω has a Drude-type structure with the DOS, ν(ε) = −π −1 ν0 ωc Im n GR\nn (ε), and the\ntransport time renormalized due to Landau quantization:\ne2 vF2\nσ± (ω) =\n4ω\n\n−1\ndε (fε − fε+ω ) ν(ε) τtr,B\n(ε + ω)\n\nZ\n\n−2\n[τtr,B\n(ε)\n\n+\n\n−2\nτtr,B\n(ε\n\n+ ω)]/2 + (ω ± ωc\n\n,\n\n)2\n\nτtr,B (ε) ≡ τtr\n\nν0\n.\nν(ε)\n\n(33)\n\nFormula (33) is the main result of this section. Let us emphasizethat the single-particle time τq enters\nEq. (33) only through the DOS; everywhere else it has been replaced by the transport time τtr due to the\nvertex correction. In the following, we analyze Eq. (33) in several important limiting cases.\nσxx(ωc) / σxx(ωc=0)\n\n3\n\n10\n\n(a)\n\n=\n\nσxx(ω) / σxx(0)\n\n2\n\n+\n\nε+ω\nvx\n\nvx\nε\n\n(b)\n\nvx\n\n=\n\nvx\n\n+\n\n10\n\n2\n\n10\n1\n\n10\n\n1\n\n10\n\n0\n\n10\n\n0\n\n10\n\n0\n\n... 1/3 1/2\n\nωc / ω\n\n1\n\n−1\n\n10\n\nvx\n\n0\n\n1\n\n2\n\n(c)\n\nFig. 12 (a) SCBA equation for the Green function; (b)\ndynamical conductivity with vertex correction (c).\n\n3\n\nω / ωc\n\n4\n\n5\n\nFig. 13 Magnetooscillations of the dynamical\nconductivity for τtr /τq = 10. Solid line: separated LLs, ωc τq /π = 3.25; dashed line: overlapping LLs, ωc τq /π = 1. Inset: σxx for fixed\nωτq /2π = 1 as a function of ωc .\n\nIn the regime of strongly overlapping LLs,\nP 1,R the solution to SCBA equations (32) is most\nP ωc τq ≪\neasily obtained using the Poisson formula, n Fn = k dxF (x) exp(2πikx). The k = 0 term yields\nthe B = 0 result, while the k = ±1 contributions provide the leading oscillatory correction to the DOS,\nν(ε) = ν0 [1 − 2δ cos(2πε/ωc ) + O(δ 2 )] ,\n\nδ = exp(−π/ωc τq ) ≪ 1 .\n\n(34)\n\nTo first order in δ, Eq. (33) produces the following result:\n(1)\n\nσ± (ω)\n= 1−2δ F\nD (ω)\nσ±\n\n\u0012\n\n2π 2 T\nωc\n\n\u0013\n\n2πεF\ncos\nωc\n\n\u0014\n\n2α2± sin(2πω/ωc ) 3α2± + 1 sin2 (πω/ωc )\n+ 2\nα2± + 1 2πω/ωc\nα± + 1 α± πω/ωc\n\n\u0015\n\n, (35)\n\nwhere α± ≡ τtr (ω ± ωc ), and the Dingle factor F (X) = X/ sinh X describes the T –damping of the\nSdHO. In the dc limit ω → 0, this result confirms the form of SdHO in smooth disorder conjectured in\n[63]. If T is higher than the Dingle temperature TD ≡ 1/2πτq , the temperature smearing becomes the\ndominant damping factor. In high-mobility 2DEG the Dingle temperature is as low as TD ∼ 100 mK, so\nc 2003 WILEY-VCH Verlag GmbH & Co. KGaA, Weinheim\n\n\fpss header will be provided by the publisher\n\n15\n\nthat for characteristic measurement temperatures T ∼ 1K the first-order correction (35) will be completely\nsuppressed. However, there exists a correction of order δ 2 , oscillatory in ω/ωc, which is not affected by the\ntemperature. To obtain it, there is no need to calculate ν(ε) to second order, since the corresponding terms\noscillate with ε, and doesn't survive the high–T limit. The leading quantum correction at T ≫ TD results\nfrom the averaging Eq. (33) over fast energy oscillations of the first-order ν(ε), Eq. (34), which gives\n(2)\nσ± (ω)\n\n=\n\nD\nσ±\n(ω)\n\n\u0015\u001b\n\u0014 2 2\n\u001a\n2πω α± (3α2± − 1)\n2πω\n2 α± (α± − 3)\n.\ncos\n+\nsin\n1 + 2δ\n(α2± + 1)2\nωc\n(α2± + 1)2\nωc\n\n(36)\n\nThe regime which is most interesting theoretically and relevant experimentally is that of long-range\n−1\ndisorder, τtr /τq ≫ 1, and a classically strong magnetic field, ωc , ω ≫ τtr\n. In this situation Eq. (33) reads\nσω = σωD\n\nZ\n\ndε\n\nfε − fε+ω\nν(ε) ν(ε + ω) ,\nω ν02\n\nσωD =\n\nX\n±\n\ne2 ν0 vF2\n,\n4τtr (ω ± ωc )2\n\n(37)\n\nor, in dc limit,\nσdc =\n\nD\n−σdc\n\nZ\n\ndε[ν 2 (ε)/ν02 ]∂ε f (ε) ,\n\nD\nσdc\n= e2 ν0 vF2 /2τtr ωc2 ,\n\n(38)\n\nIn the limit of separated LLs, ωc τq ≫ 1, the DOS is a sequence of semicircles of width 2Γ ≪ ωc ,\nν(ε) = ν0 τq\n\nX\n\nn\n\nRe\n\np\nΓ2 − (ε − εn )2 ,\n\nΓ=\n\nq\n2ωc /πτq .\n\n(39)\n\nIn this case, σω is non-zero only for ω in intervals [M ωc − 2Γ, M ωc + 2Γ] with an integer M .\nOscillations in σω with ω/ωc for 2DEG with smooth disorder at ωc τtr ≫ 1 and T ≫ TD are illustrated\nin Fig. 13. For overlapping LLs, oscillations away from the cyclotron peak are described by simple formula\nσω /σωD = 1 + 2δ 2 cos(2πω/ωc ). For separated LLs, at the center of the M = 1 interval we find a CR\npeak of height σxx (ω = ωc ) = (e2 ν0 vF2 /πΓ)τtr,0 /τq and width ∼ Γτq /τtr,0 . All other peaks (M 6= 1) are\nsmaller by a factor ∼ τtr /τq ∼ (kF d)2 ≫ 1,\nσxx (ω = M ωc ) = (4e2 ν0 vF2 Γ/3πωc2 )(τq /τtr )[(M 2 + 1)/(M 2 − 1)2 ] .\n\n(40)\n\n6 Interaction effects in quantizing magnetic fields\n6.1 Interaction effects on oscillations\nIn this Section we discuss the interaction effects on magnetooscillations (de Haas-van Alphen and Shubnikov – de Haas oscillations), closely following Ref. [64]. In addition to experimental motivation related to\nthe apparent metal-insulator transition in two-dimensional systems, the corresponding theory complements\nthe recently developed theory of interaction effects in transport of 2D electrons in zero and non-quantizing\nmagnetic fields [55, 56].\nThe starting point is the expression for the thermodynamic potential derived in the paper by Luttinger\nand Ward [65]\nΩ = −T Tr ln(−G−1 ) − T Tr(GΣ) + Ω′ ,\n\n(41)\n\nwhere the trace implies summation over Landau levels N and over fermionic Matsubara frequencies ǫn =\n(2n + 1)iπT , G(iǫn , N ωc ) = [iǫn + μ − (N + 1/2)ωc − Σ(iǫn , N ωc )]−1 is the dressed Matsubara\nGreen's function, and Σ(iǫn , N ωc ) is a self-energy part of Green's function which includes all the disorder\nand interaction effects. The terms −T Tr(GΣ) and Ω′ in (41) are introduced to avoid double-counting of\nc 2003 WILEY-VCH Verlag GmbH & Co. KGaA, Weinheim\n\n\f16\n\nI.A. Dmitriev et al.: Magnetotransport in quantum-Hall systems\n\n(a)\n\nΣ 00\n\nΣ 01\n\nΣ11\n\nΣ 00\n\nΣ 01\n\nΣ 11\n\na\n\na\n\na\n\n(b)\nb\n\nb\n\nb\n\nFig. 14 Self energy diagrams in the first order in the effective interaction\n(wavy line). Black triangles denote impurity ladders Γ dressing interaction vertices, dashed line is a single-impurity line. Diagrams (b) represent the \"Hikami-box\" contribution to the self-energy which restores the\ngauge-invariance of the damping.\n\ndiagrams [65, 66]. The term Ω′ denotes the sum of all so-called skeleton diagrams with all bare Green's\nfunctions replaced by dressed Green's functions.\nAs shown in Ref. [67], the exponential decay of magnetooscillations is described by the Tr ln-term.\nThe oscillatory parts of the additional terms, which are introduced to correct for overcounting, cancel each\nother. In order to obtain the correction to the thermodynamic potential one needs to calculate the selfenergy part of the Green's function. It is worth noting that the inelastic contribution to the self-energy ∝\n[(πT )2 − ǫ2n ]signǫn vanishes for ǫn = πT, and thus does not affect the damping of the magnetooscillations\nB(T ) for T ≫ ωc , in agreement with Refs. [68, 69].\nFor overlapping Landau levels [Eq. (34)], the magnetooscillations are damped by disorder even at zero\ntemperature via the standard Dingle factor δ = exp(−π/ωc τq ). Therefore we will consider only the\nfirst harmonics of the oscillations, A1 , neglecting all higher harmonics whose damping is much stronger.\nIn what follows we concentrate on the case T ≫ ωc . Under this condition, the first harmonics of the\noscillatory part of the thermodynamic potential\n2\n\nΩosc ≃ 2ν0 (ωc /2π) A1 cos(2π 2 ne /eB),\n\n(42)\n\nis given by\n\u0003\n\u0002\nA1 = (4π 2 T /ωc ) exp −2π 2 T /ωc∗ − π/ωc∗ τq∗ exp[B(T )],\n\n(43)\n\nB(T ) = −2πi Z δΣ(iπT, ξ0 )/ωc∗ .\n\n(44)\n\nwhich is a standard FL Lifshitz-Kosevich expression multiplied by the additional factor with\n\nHere ωc∗ = eB/m∗ is the Fermi-liquid (FL) renormalized effective cyclotron frequency in a pure system\nat zero T , which is related to the FL-renormalized effective mass m∗ , Z is the FL Z-factor (given by\nthe residue of the Green's function), τq∗ is the FL-renormalized scattering time, and δΣ(iǫn , ξ0 ) is the\nself-energy part (taken at the pole ξ0 of the Green's function in the presence of disorder) describing the\ninterplay of disorder and interaction.\nHereafter white-noise disorder with τtr = τq ≡ τ is considered. Evaluating the sum of six digrams\n(Fig. 14) for δΣ, one gets the following expression for the damping exponent in the case of short-range\ninteraction U0 :\nB(T ) = −const ν0 U0 (π/ωc τq ) + (πT /ωc ) (ν0 U0 /εF τ ) ln(εF /T ).\n\n(45)\n\nThe first term in Eq. (45) describes the T -independent FL-renormalization of τq due to vertex corrections\nand should be included in the effective relaxation time τq∗ . The second term represents the T -dependent\ncontribution to the damping factor that we are interested in and is analyzed below.\nThe above result (45) can be interpreted in terms of corrections to the effective mass (or ωc ) and the\nquantum elastic scattering rate τq entering the standard Lifshitz-Kosevich formula. These corrections come\nfrom the interplay of disorder and interaction, leading to\nB(T ) = −(2π 2 T /ωc )(δm/m) − (π/ωc τq ) [δm/m − δτq /τq ] .\n\n(46)\n\nIt is worth noting that the FL-renormalization does not affect the product ωc m = eB.\nc 2003 WILEY-VCH Verlag GmbH & Co. KGaA, Weinheim\n\n\fpss header will be provided by the publisher\n\n17\n\nComparing (45) and (46), one can see that the T ln T dependence of the damping factor could in principle originate either from the ln T correction to the effective mass, or from the T ln T -type correction to\nτq . This led the authors of Ref. [68] to the conclusion that the nonlinear T −dependence of the damping\nfactor may be equivalently interpreted either as a T −dependent renormalization of the effective mass or\nas a T −dependent Dingle temperature. It is clear, however, that these two possibilities correspond to different physical processes. To identify the physical origin of the leading contribution to the damping it is\ninstructive to obtain B(T ) using the expression for the self-energy analytically continued to real values of\nenergies ǫn → −iε .\nHaving calculated ReΣ and ImΣ for real energies ε, one can determine δm and δτq . Indeed, the magnitude of the first harmonics of the magnetooscillations of the thermodynamic density of states is expressed\nthrough the real-ε self-energy δΣ(ε) as follows:\nZ\nA1 (T ) = − dεA1 (ε, T )∂ε fT (ε),\n(47)\n\u001b\n\u001a\n\u001b\n\u001a\nπ\n2π\n2πi\n[ε − ReδΣ(ε, ξ0 )] exp −\n+\nImδΣ(ε, ξ0 )\n(48)\nA1 (ε, T ) = exp\nωc\nωc τq\nωc\n\u0015\u001b\n\u001a\n\u0014\n\u0014\n\u0015\u001b\n\u001a\nπ\nδm(ε, T )\nδm(ε, T ) δτq (ε, T )\n2πiε\nexp −\n1+\n1+\n.\n(49)\n= exp\n−\nωc\nm\nωc τq\nm\nτq\nwhere fT (ε) = [1 + exp(ε/T )]−1 is the Fermi distribution function. This allows one to express δτq (ε, T )\nand δm(ε, T ) through ReΣ(ε) and ImΣ(ε) as follows:\nδm(ε, T )/m = −ε−1 ReδΣ(ε, T ) = −(ν0 U0 /2πεF τ ) ln{εF /max[|ε|, T ]},\nδτq (ε, T )/τq = 2τq ImδΣ(ε, T ) + δm(ε, T )/m\nh\n\u0010 ε \u0011i\nν0 U 0\nT\nεF\n−\n= ν0 U 0\nln 2 cosh\nln\n.\nεF\n2T\n2πεF τ\nmax[|ε|, T ]\n\n(50)\n\n(51)\n\nIt is clear from these results that the leading term in B(T ) [proportional to T ln(εF /T ), Eq. (45)] originates from the real part of the self-energy, i.e. from renormalization of the effective mass, which affects\nincommensurability of the oscillations at different values of energy ε. The contribution of the imaginary\npart of the self-energy, which is governed in the ballistic regime by the renormalization of the scattering\ntime, is smaller by a factor ln(εF τ ). The obtained result for the interaction-induced correction to the quantum scattering time τq , Eq. (51), agrees, up to a factor 12 , with the correction to the transport time following\nfrom the calculation of conductivity correction in the ballistic regime in Ref. [55].\nIn the case of Coulomb interaction, one should take into account the dynamical screening of the interaction within the random phase approximation (RPA). This leads to different asymptotics of the self-energy\nin the diffusive and ballistic regimes, in contrast to the case of weak short-range interaction. The T dependence of the leading correction to the magnetooscillations damping factor due to the interaction in\nthe singlet channel has the form (Fig. 15)\n\n4πT τ ≪ 1,\n (3/2) ln(εF /T ) − (1/2) ln(4πεF τ ),\nπ\nT\nB ρ (T ) =\n(52)\n×\n\nωc τq εF\nln(εF /T ),\n4πT τ ≫ 1.\nCalculation of the corresponding triplet contribution leads to qualitatively similar asymptotics. The leading\nterm in the total correction to the damping factor in the ballistic regime, realized in experiments on lowdisorder samples at realistic temperatures, takes the simple form\nB(T ) = B ρ (T ) + B σ (T ) ≃ [1 + 3F0σ (1 + F0σ )−1 ] (πT /ωc τq εF ) ln(εF /T ).\n\n(53)\n\nAs discussed above, this result arises due to the correction to the effective mass.\nc 2003 WILEY-VCH Verlag GmbH & Co. KGaA, Weinheim\n\n\f18\n\nI.A. Dmitriev et al.: Magnetotransport in quantum-Hall systems\n3\n\n0.5\n\nB (T)ωcEFτ /π\n2\n\n2\n\nB (T)ωcEFτ /π\n\n2\n\n0\n\nρ\n\nρ\n\n1\n\n0\n\na\n−1\n\n0\n\n1\n\nb\n2\n\nTτ\n\n−0.5\n\n0\n\n0.1\n\nTτ\n\nFig. 15 Temperature dependence of the singlet channel correction to the damping factor B ρ (T ) for 4πεF τ = 100\n(solid line) with the low-T (dot-dashed) and high-T (dashed) asymptotics. (a) Wide temperature range: on this scale\nB ρ (T ) is essentially indistinguishable from its high-T asymptotics; (b) low-T part: the crossover between the two\nasymptotics occurs at T τ ∼ 0.05.\n\n6.2 Coulomb drag in high Landau levels\nCoulomb drag between parallel two-dimensional electron systems [70, 71] has developed into a powerful\nprobe of quantum-Hall systems [72, 73, 74, 75, 76, 77, 78, 79], providing information which is complementary to conventional transport measurements. The drag signal is the voltage V developing in the\nopen-circuit passive layer when a current I is applied in the active layer. The drag resistance (also known\nas transresistance) is then defined by RD = V /I. As a function of interlayer spacing a, the interlayer\ncoupling changes from weak at large spacings where it can be treated in perturbation theory, to strong at\nsmall spacings where it can result in states with strong interlayer correlations [76, 77].\nIn a simple picture of Coulomb drag, the carriers of the active layer transfer momentum to the carriers\nof the passive layer by interlayer electron-electron scattering. The phase space for interlayer scattering is\nproportional to the temperature T in either layer predicting a monotonous temperature dependence RD ∝\nT 2 of the drag resistance. Moreover, the signs of the voltages in active and passive layer are expected to\nbe opposite (the same) for carriers of equal (opposite) charge in the two layers [80].\nRemarkably, experiments show that Coulomb drag behaves very differently from these simple expectations when a perpendicular magnetic field B is applied such that the Fermi energy εF is in a high Landau\nlevel, εF /~ωc ≫ 1. (ωc is the cyclotron frequency.) Several experiments [74, 78] in the regime of weak\ninterlayer coupling observed negative drag when the filling factors in the two layers are different. A more\nrecent experiment [79] also reveals a non-monotonic dependence on temperature. While the drag resistivity shows a quadratic temperature dependence at sufficiently high temperatures, where drag is always\npositive, an additional peak develops at low temperatures which can have both a positive or a negative sign\ndepending on the filling-factor difference between the two layers.\nIn this Section, we present the theory of Coulomb drag in the limit of high Landau levels [82]. In\na strong magnetic field, ωc τtr ≫ 1, the intralayer Hall resistivity ρxy dominates over the longitudinal\nresistivity ρxx . Therefore, the drag resistivity is given by\n(1) D (2)\nρD\nxx ≃ ρxy σyy ρyx\n\n(54)\n\nThe Coulomb drag in strong magnetic fields is an interplay of two contributions, as illustrated in Fig. 16.\nAt high temperatures, the leading contribution is due to breaking of particle-hole symmetry by the curvature\nof the zero-B electron spectrum. This \"normal\" contribution to the drag is always positive and increases\nin a broad temperature range as T 2 . At low temperatures, another, \"anomalous\", contribution dominates,\nwhich arises from the breaking of particle-hole symmetry by the energy dependence of the density of\nstates related to Landau quantization. This contribution is sharply peaked at a temperatute T ∼ ∆ (where\nc 2003 WILEY-VCH Verlag GmbH & Co. KGaA, Weinheim\n\n\fpss header will be provided by the publisher\np−h symmetry\n\n19\np−h symmetry\n\np−h asymmetry\ncurvature\n\nLL − quantization\n\nΕ\n\nΕ\ne\n\ne\n\nv\nν\n\n00000000000000000000000000000000000000000\n11111111111111111111111111111111111111111\n00000000000000000000000000000000000000000000000000000000000000000\n11111111111111111111111111111111111111111111111111111111111111111\n11111111111111111111111111111111111111111\n00000000000000000000000000000000000000000000000000000000000000000\n11111111111111111111111111111111111111111111111111111111111111111\n00000000000000000000000000000000000000000\n00000000000000000000000000000000000000000000000000000000000000000\n11111111111111111111111111111111111111111111111111111111111111111\n00000000000000000000000000000000000000000\n11111111111111111111111111111111111111111\n00000000000000000000000000000000000000000000000000000000000000000\n11111111111111111111111111111111111111111111111111111111111111111\n00000000000000000000000000000000000000000\n11111111111111111111111111111111111111111\n00000000000000000000000000000000000000000000000000000000000000000\n11111111111111111111111111111111111111111111111111111111111111111\n00000000000000000000000000000000000000000\n11111111111111111111111111111111111111111\n00000000000000000000000000000000000000000\n11111111111111111111111111111111111111111\n00000000000000000000000000000000000000000000000000000000000000000\n11111111111111111111111111111111111111111111111111111111111111111\n00000000000000000000000000000000000000000\n11111111111111111111111111111111111111111\n00000000000000000000000000000000000000000000000000000000000000000\n11111111111111111111111111111111111111111111111111111111111111111\n00000000000000000000000000000000000000000000000000000000000000000\n11111111111111111111111111111111111111111111111111111111111111111\n00000000000000000000000000000000000000000\n11111111111111111111111111111111111111111\n00000000000000000000000000000000000000000000000000000000000000000\n11111111111111111111111111111111111111111111111111111111111111111\n00000000000000000000000000000000000000000\n11111111111111111111111111111111111111111\n00000000000000000000000000000000000000000000000000000000000000000\n11111111111111111111111111111111111111111111111111111111111111111\n00000000000000000000000000000000000000000\n11111111111111111111111111111111111111111\n00000000000000000000000000000000000000000000000000000000000000000\n11111111111111111111111111111111111111111111111111111111111111111\n00000000000000000000000000000000000000000\n11111111111111111111111111111111111111111\n00000000000000000000000000000000000000000\n11111111111111111111111111111111111111111\n00000000000000000000000000000000000000000000000000000000000000000\n11111111111111111111111111111111111111111111111111111111111111111\n00000000000000000000000000000000000000000000000000000000000000000\n11111111111111111111111111111111111111111111111111111111111111111\n00000000000000000000000000000000000000000\n11111111111111111111111111111111111111111\n00000000000000000000000000000000000000000000000000000000000000000\n11111111111111111111111111111111111111111111111111111111111111111\n00000000000000000000000000000000000000000\n11111111111111111111111111111111111111111\n00000000000000000000000000000000000000000000000000000000000000000\n11111111111111111111111111111111111111111111111111111111111111111\n00000000000000000000000000000000000000000\n11111111111111111111111111111111111111111\n00000000000000000000000000000000000000000000000000000000000000000\n11111111111111111111111111111111111111111111111111111111111111111\n00000000000000000000000000000000000000000\n11111111111111111111111111111111111111111\n00000000000000000000000000000000000000000\n11111111111111111111111111111111111111111\n00000000000000000000000000000000000000000000000000000000000000000\n11111111111111111111111111111111111111111111111111111111111111111\n00000000000000000000000000000000000000000000000000000000000000000\n11111111111111111111111111111111111111111111111111111111111111111\n00000000000000000000000000000000000000000\n11111111111111111111111111111111111111111\n00000000000000000000000000000000000000000000000000000000000000000\n11111111111111111111111111111111111111111111111111111111111111111\n00000000000000000000000000000000000000000\n11111111111111111111111111111111111111111\n00000000000000000000000000000000000000000000000000000000000000000\n11111111111111111111111111111111111111111111111111111111111111111\n00000000000000000000000000000000000000000\n11111111111111111111111111111111111111111\n00000000000000000000000000000000000000000000000000000000000000000\n11111111111111111111111111111111111111111111111111111111111111111\n00000000000000000000000000000000000000000\n11111111111111111111111111111111111111111\n00000000000000000000000000000000000000000\n11111111111111111111111111111111111111111\n00000000000000000000000000000000000000000000000000000000000000000\n11111111111111111111111111111111111111111111111111111111111111111\n00000000000000000000000000000000000000000000000000000000000000000\n11111111111111111111111111111111111111111111111111111111111111111\n00000000000000000000000000000000000000000\n11111111111111111111111111111111111111111\n00000000000000000000000000000000000000000000000000000000000000000\n11111111111111111111111111111111111111111111111111111111111111111\n00000000000000000000000000000000000000000\n11111111111111111111111111111111111111111\n00000000000000000000000000000000000000000\n11111111111111111111111111111111111111111\n\nh\n\nh\n\nDoS\n\nv\n\nν(Ε)\n\nv\n\ne\n\ne\nk\n\nT\n\np−h asymmetry\ncurvature\n\nμ\nh\n\nh\n\nj e = −jh\n\nj e = −jh\n\nv = dE/dk\n\nFig. 16 Schematic illustration of different sources of particle-hole asymmetry: curvature of zero-B spectrum E(k)\nvs LL-quantization of the density of states (DoS) ν(E). In the particle-hole (p-h) symmetric case, the electronic and\nhole contributions to the current induced in the passive layer (je and jh , respectively) compensate each other. When\nthe p-h asymmetry is generated by a finite curvature, the velocities of electrons and holes (shown by arrows in the right\npanel) are different, which destroys the compensation. This is the \"conventional\" mechanism of the drag. When the\nDoS depends on energy (in the present case because of the LL-quantization), an \"anomalous\" drag arises due to the\ndifference in numbers of occupied electronic and hole states.\n\n2\n\nT\n\nT lnT\n\n2\n\nT\n\n1\n\nT\n\nρxxD (T)\n\nT\n\n∆\n−\n\n2\n\n−T lnT\n\n1/2\n\nT\n\nT**\n−T\n\na\n\n−T\n\n2\n\nT\n\n1\n\nT\n\n3\n\nT\n\n∆\n\n1\n\n1\n\n2\n\n1/2\n\n∆\n\n−1\nT\n\nb\n\n−T\n\n2\n\nT*\n−\n\n−\n\n1\n\n1\n\nT\n\nT\n\n1\n\nT\n\n1\n\nT3\n\n2\n\n∆\nmatched\nmismatched\n\nc\n\nd\n\nFig. 17 Schematic temperature dependence of low-temperature drag in different regimes: a) diffusive, Rc /a ≪ 1; b)\nweakly ballistic, 1 ≪ Rc /a ≪ ωc /∆; c) ballistic, ωc /∆ ≪ Rc /a ≪ N ∆/ωc ; d) ultra-ballistic, N ∆/ωc ≪ Rc /a.\n\n∆ = 2Γ is the Landau level width) and has an oscillatory sign depending on the density mismatch between\nthe two layers.\nSince the momenta transferred from one layer to the other are effectively restricted by the inverse interlayer distance, a−1 , the behavior of the transresistivity will be essentially dependent on the relation\nbetween Rc and a. Specifically, with increasing Rc /a the following four regimes are identified i) diffusive,\nRc /a ≪ 1, ii) weakly ballistic, 1 ≪ Rc /a ≪ ωc /∆, iii) ballistic, ωc /∆ ≪ Rc /a ≪ N ∆/ωc , and iv)\nultra-ballistic, N ∆/ωc ≪ Rc /a. In all regimes, the temperature-dependence of the drag resistivity is nonmonotonous: the absolute value of ρD\nxx (T ) shows a peak around T ∼ ∆ and increases again at T ≫ ωc .\nHowever, the T − and B− dependences of ρD\nxx , as well as the sign of the low-temperature peak (the hightemperature drag is always positive), are specific for each particular regime, as illustrated in Fig. 17 and\nsummarized below.\nDiffusive regime, Rc /a ≪ 1. In the diffusive regime, the drag at not too high temperatures, T ≪\nωc , is governed by the diffusive rectification[81] which can be calculated quasiclassically using the local\napproximation for the density dependence of the conductivity. As a result, the sign of the drag at T ∼ ∆\noscillates but is opposite to what we found above for the ballistic regime: the drag is negative for equal\nc 2003 WILEY-VCH Verlag GmbH & Co. KGaA, Weinheim\n\n\f20\n\nI.A. Dmitriev et al.: Magnetotransport in quantum-Hall systems\n\ndensities.[81] At the \"slopes\" of the peak, ρD\nxx scales with T and B in the following way\nρD\nxx\n\n∝\n\n(\n\n− T 2 ln(T B 3/2 ),\n\n− T −1 B 3/2 ln B,\n\nT ≪ ∆,\n\n(55)\n\nT ≫ ∆,\n\nwhere the sign corresponds to the case of matching densities.\nWeakly ballistic regime, 1 ≪ Rc /a ≪ ωc /∆. This regime is qualitatively similar to the diffusive regime\nwith\n\n− T 2 B −5/4 ,\nT ≪ ∆,\n\n\n\nρD\n(56)\n− T 1/2 B −1/2 ,\n∆ ≪ T ≪ T∗∗ ≡ ωc (a/Rc )\nxx ∝\n\n\n\n− T −1 B 5/2 ,\nT ≫ ωc (a/Rc ),\n\nThe sign of the peak oscillates just like in the diffusive regime.\nBallistic regime, ωc /∆ ≪ Rc /a ≪ N ∆/ωc . The ballistic regime is most relevant experimentally.\nIn this regime, the drag is governed by the particle-hole asymmetric effect of Landau quantization of the\ndensity of states and the sign of the drag oscillates,\n\nρD\nxx\n\n 2\nT B ln(B∗ /B),\n\n\n\n∝\nT −3 B 7/2 ln(B∗ /B),\n\n\n\n− T −1 B 5/2 ,\n\nT ≪ ∆,\n\n∆ ≪ T ≪ T∗ ≡ ∆ ln1/2 (Rc ∆/aωc ),\n\n(57)\n\nT ≫ T∗ ,\n\nwhere B∗ ∼ (mc/e)(vF2 /a2 τ0 )1/3 (experimentally, the logarithmic factor in T∗ is typically of the order\nof unity, so that the intermediate regime may not be fully developed). We emphasize that the drag at low\ntemperatures is positive for matched and negative for mismatched densities.\nUltra-ballistic regime, N ∆/ωc ≪ Rc /a. The drag for all temperatures is determined by the conventional contribution related to the curvature of the electron dispersion and is always positive,\nρD\nxx\n\n∝\n\n(\n\nT 2 B2,\nT −1 B 7/2 ,\n\nT ≪ ∆,\nT ≫ ∆,\n\n(58)\n\nAt high temperature, T ≫ ωc , the drag is governed by the conventional contribution (and is therefore\n−1/2\npositive) in all the regimes. It is linear in T in the diffusive regime (ρD\n). In all the ballistic\nxx ∝ T B\nD\n2 1/2\n1/2\nfor\nfor ωc ≪ T ≪ vF /a and ρD\nregimes the drag resistivity scales as ρxx ∝ T B\nxx ∝ T B\nT ≫ vF /a.\nA comparison of Fig. 18 with Fig. 3 of Ref. [79] reveals a remarkable agreement between the experimental findings and the theoretical results. In both the theory and the experiment, (i) ρD\nxx (T ) shows a\nsharp peak at low temperatures; (ii) the sign of the drag in this temperature range oscillates as a function\nof the filling factor of one layer (at fixed filling factor of the other layer); (iii) the low-T drag is positive for\nequal filling factors and negative when the Fermi energy in one layer is in the upper half and in the other\nlayer in the lower half of the Landau band; (iv) the high-T drag is always positive, independently of the\ndifference in filling factors of two layers and increases monotonically with increasing T . Furthermore, it\nwas observed by Muraki et al that in the low-temperature regime of initial increase of ρD\nxx , as well as in the\nhigh-temperature regime of \"normal\" drag, the drag resistivity can be described by an empirical scaling\n−2.7\nlaw, ρD\nf (T /B). Theoretical results for both the low- and high-temperature regimes are in\nxx ∝ (n/B)\na nice correspondence with this prediction, with f (x) ∼ x2 .\nc 2003 WILEY-VCH Verlag GmbH & Co. KGaA, Weinheim\n\n\fpss header will be provided by the publisher\n\nT\n\n1\n\n2\n\n21\n\nmatched\ndensities\n\nT3\n\nT2\n\n1\n\nρxxD\n\nT\n\n∆\n−T 2\n\nI\n\nT*\n−\n\n1\n\nT3\n\nII\n\n−\n\n1\n\nωc\n\nT\n\nmismatched\ndensities\n\nIII\n\nIV\n\nT\n\nFig. 18 Schematic temperature dependence of drag in the ballistic regime\nfor matched and mismatched densities. In the latter case the mismatch is\nchosen such that the drag is negative at low T (see text). Scaling of ρD\nxx\nwith temperature in different regions is indicated: T ≪ ∆ (I); ∆ ≪ T ≪\nT∗ (II); T∗ ≪ T ≪ ωc (III), and T ≫ ωc (IV).\n\n7 Photoconductivity\n7.1 Microwave-induced magnetoresistance oscillations and zero-resistance states\nRecently, a number of new remarkable effects, important for both basic and applied physics, have been\ndiscovered in two-dimensional electron systems driven out of equilibrium by strong AC and DC fields.\nIt was observed [83] that dc resistivity ρxx of a high-mobility 2DEG subjected to microwave radiation\nof frequency ω exhibits magnetooscillations with a period in ω set by the resonances with multiples of\nthe cyclotron frequency ωc . Subsequent work on samples with an exceptionally high mobility has shown\n[84, 85] that for a sufficiently high radiation power the minima of these microwave-induced resistance oscillations (MIRO) evolve into \"zero resistance states\"(ZRS), in which the dissipative resistance of a sample\nbecomes vanishingly small. Unlike oscillatory ρxx , the Hall resistivity ρxy remained practically linear in\nωc . A hallmark of these experimental findings is that the prominent oscillations of the photoconductivity\nσph ≃ ρxx /ρ2xy are observed at magnetic fields as low as 10 mT, and at relatively high temperatures up to\n∼ 1 K, at which the Shubnikov-de Haas oscillations are completely suppressed.\nPresenting a novel class of magnetooscillations which lead, with increasing ωc , to apparently dissipationless transport, the experimental results [83, 84, 85] have attracted much theoretical interest. In particular, an explanation of the MIRO has been proposed [86] in terms of a combined effect of radiation and\nLandau quantization on elementary scattering acts for electrons colliding with impurities (in fact, a closely\nrelated theory was put forward long ago [87]). A systematic theoretical study of this mechanism of the\nMIRO (referred to as a \"displacement\" mechanism in what follows) was carried out in [88].\nOn the other hand, it was emphasized [89] that whenever the linear dc response theory predicts a negative resistivity, this signifies an instability leading to the formation of domains of counter-flowing currents.\nThe break-up of an ac-driven sample in current domains provides an explanation to the experimentally\nobserved ZRS.\nA different mechanism of the MIRO, called here the \"inelastic\" mechanism, was proposed in [61] and\nstudied in more detail in [90, 91] (similar ideas were also discussed in [92]). The inelastic mechanism\nis associated with a radiation-induced non-equilibrium part of the distribution function of electrons f (ε)\nwhich oscillates with varying ε ± ~ω due to the Landau quantization. This mechanism yields the amplitude of oscillations of the linear (with respect to the dc field) photoconductivity which is proportional\nto inelastic scattering time τin . The inelastic contribution dominates over the displacement one for τin\nlarger than single-particle relaxation time τq , the condition which is fulfilled in the experiments. Apart\nfrom the magnitude of the effect, the two contributions are qualitatively different in their dependence on\nT and polarization of the radiation. In accord with the experiments, the inelastic contribution decreases as\nτin ∝ T −2 with increasing T and does not depend on the direction of linear polarization of the microwave\nfield. By contrast, the displacement mechanism [86, 87, 88] yields a T independent contribution which\nc 2003 WILEY-VCH Verlag GmbH & Co. KGaA, Weinheim\n\n\f22\n\nI.A. Dmitriev et al.: Magnetotransport in quantum-Hall systems\n\ndepends essentially on the relative orientation of the microwave and dc fields, which clearly contradicts the\nexperimental findings.\n7.2 Inelastic mechanism of MIRO\nWe consider a high-mobility 2DEG, with τq ≪ τtr , subjected to a classically strong transverse magnetic\nfield, ωc τtr ≫ 1 (we use notations of Sec. 5, in particular, τq and τtr are specified in Eq. (31). The\nphotoconductivity σph determines the longitudinal current flowing in response to a dc electric field Edc ,\n~j * E~dc = σph E 2 , in the presence of a microwave electric field Eω cos ωt. The more frequently measured\ndc\n[83, 84, 85, 92] longitudinal resistivity, ρph , is given by ρph ≃ ρ2xy σph , where ρxy ≃ eB/ne c is the Hall\nresistivity, affected only weakly by the radiation.\nHere we study the leading inelastic mechanism of MIRO thus taking into account only effects that are\ndue to a non-trivial energy dependence of the non-equlibirum distribution function f (ε). Photoconductivity\nσph is given by the dc responce in the state with non-equlibirum f (ε). According to Eq. (38),\nR\nD\nσph = −σdc\ndε ν̃ 2 (ε) ∂ε f (ε),\n(59)\nwhere ν̃(ε) = ν(ε)/ν0 . The non-equlibirum distribution function f (ε) is found as a solution of the stationary kinetic equation\n\u0014\n\u0015\nD\n∂\n∂\nσdc\nf (ε) − fT (ε)\nσωD X\n2\n2\nν̃\n(ε)\nν̃(ε±ω)\n[\nf\n(ε±ω)−f\n(ε)\n]+\nE\n. (60)\nf\n(ε)\n=\nEω2\ndc\n2ω 2 ν0 ±\nν0 ν̃(ε) ∂ε\n∂ε\nτin\n\nOn the right-hand side of Eq. (60), inelastic processes are included in the relaxation time approximation\n(which is proven [91] to be sufficient under experimental conditions), and fT (ε) is the Fermi distribution.\nThe left-hand side is due to the electron collisions with impurities in the presence of the external electric\nfields. The first term describes the absorption and emission of microwave quanta; the rate of these transi−1\ntions is proportional [61] to τtr,B\n(ε±ω) ∝ ν(ε±ω), see Eqs. (33) and (37). This term can be also extracted\nfrom the kinetic equation of Ref. [88]. The second term describes the effect of the dc field and can be obtained from the first one by taking the limit ω → 0. Equation (60) suggests convenient dimensionless units\nfor the strength of the ac and dc fields:\n\u00132\n\u0012\n\u0012\n\u00132 \u0012 \u00132\nτin eEω vF\nωc2 + ω 2\n2 τin eEdc vF\nπ\nPω =\n,\nQdc =\n.\n(61)\nτtr\nω\n(ω 2 − ωc2 )2\nτtr\nωc\nωc\nNote that Pω and Qdc are proportional to τin and are infinite in the absence of inelastic relaxation processes.\nTo first order in\nPPω and Qdc → 0, Eq. (60) produces a non-equilibrium correction to fT (ε), f (ε) −\nfT (ε) = 0.25Pω ± ν̃(ε ± ω) [ fT (ε ± ω) − fT (ε) ], which oscillates both with ε/ωc and ω/ωc due to\nε/ωc –oscillations in the DOS. In turn, the oscillatory f (ε) leads to ω/ωc -oscillations of σph , Eq. (59),\nD\nσph /σdc\n= h ν̃ 2 (ε) iε + (ωPω /4) h ν̃ 2 (ε) ∂ε [ ν̃(ε + ω) − ν̃(ε − ω) ] iε\n\n(62)\n\nHere we took into account that the SdHO in the experiments are suppressed by temperature, T ≫ TD , so\nthat, analogous to Eq. (36), the energy integration results in averaging over ε within the period ωc , denoted\nby the angular brackets. For separated LLs, ωc τq ≫ 1, with the semielliptical DOS (39), Eq. (62) gives\n\b\nP\nD\nσph /σdc\n= (16ωc/3π 2 Γ) 1 − Pω (ωωc /Γ2 ) [ n Φ (ω/Γ − nωc /Γ) + O (ωc Pω /Γ) ] , (63)\np\n4π Φ(x) = x Re[ 3 arccos(|x| − 1) − (1 + |x|) |x|(2 − |x|) ].\n\nIn the limit of overlapping LLs, the DOS is given by ν̃ = 1 − 2δ cos 2πε\nωc with δ = exp(−π/ωc τq ) ≪ 1.\nThe existence of a small parameter δ allows one to calculate σph to all orders in Pω and Qdc ,\n\"\n#\n2πω\nPω 2πω\nσph\nωc sin ωc + 4Qdc\n2\n= 1 + 2δ 1 −\n.\n(64)\nD\nσdc\n1 + Pω sin2 πω\nωc + Qdc\nc 2003 WILEY-VCH Verlag GmbH & Co. KGaA, Weinheim\n\n\fpss header will be provided by the publisher\n\n23\n(0)\n\nResults (64) and (63) are shown in Figs. 19 and 20 for several values of Pω ≡ Pω |ωc =0 .\n10\n\nρph /ρ(D)\ndc\n\n1\n\n~\njx\n\n5\n\n0\n\n-1\n-2\n0\n\n-3\n1/4\n\nFig. 19 Photoresistivity (normalized to the Drude value) for overlapping LLs vs ωc /ω at fixed ωτq =\n(0)\n=\n2π, and for different Pω\n{0.24, 0.8, 2.4}. I − V characteristics at the marked minima are shown\nin Fig. 21.\n\n1/3\n\n1/2\n\nωc / ω\n\nFig. 20 Photoresistivity (normalized to the Drude value) for separated Landau levels vs ωc /ω at fixed\nωτq = 16π. The curves correspond\nto different levels of microwave\n(0)\npower Pω = {0.01, 0.03, 0.05}.\n\n0\n\n2\n\n4\n\ne~dc\n\nFig. 21 Current–voltage characteristics [ dimensionless current\nD\nj̃x = (σph /σdc\n)Ẽdc vs dimen1/2\nsionless field Ẽdc = Qdc ] at\nthe points of minima marked by\nthe circles in Fig. 19. The arrows\n∗\nshow the dc field Ẽdc\nin spontaneously formed domains.\n\n7.3 Zero-resistance states, strong-field domains, oscillatory compressibility\nAt Pω exceeding certain threshold value Pω⋆ , σph around minima becomes negative (see Figs. 19 and\n20). According to Ref. [89], this signifies an instability leading to the formation of domains with strong\n⋆\n⋆\nHall field Edc = ±Edc\nand counter-flowing currents. The value Edc\nis determined by the equation\n⋆\nσph (Pω , Edc ) = 0, which in the case of overlapping LLs, Eq. (64), has the solution (marked by arrows\nin Fig. 21)\n1 ωc2\n∗\n= √\nEdc\n2 π evF\n\n\u0012\n\nτtr\nτin\n\n\u00131/2 \u0014\n\nPω\n−1\nPω∗\n\n\u00151/2\n\n,\n\nPω∗ =\n\n\u0013−1\n\u0012\n2πω\nπω\nπω\nsin\n− sin2\n. (65)\n4δ 2\nωc\nωc\nωc\n\nEquation (65) relates the electric field formed in the domains (measurable by local voltage probe [93]) with\nthe excess power of microwave radiation.\nIn the case of separated LLs, it suffices to keep the linear-in-Pω term only even for the microwave\npower Pω > Pω∗ ∼ Γ2 /ωωc at which the linear-response resistance becomes negative: The second order\ncorrection at Pω ∼ Pω∗ is still small, ωc Pω∗ /Γ ∼ Γ/ω ≪ 1. The strength of the field in domains\nis\np\n∗\ndetermined by the scale at which inter-LL elastic scattering becomes efficient, Edc\n∼ (ωc2 /evF ) τtr /τq .\n3\n\ndc/n0\n\n-0.4\n2\n\ndc\nn0\n\n1\n\n-1.6\n0\n\nZRS\n*\nEdc /Edc\n\n1\n\n0\n\n-1\n-2\n\n0\n\n0.1\n\n0.2\n\nwc /w\n\n0.3\n\n0.4\n\n0.5\n\nFig. 22 The microwave-induced correction to the compressibility\n(solid line) of a 2DEG as a function of ωc /ω at fixed ωτq = 2π and\nmicrowave power P|ωc =0 = 1. In the zero resistance state (ZRS),\n∗\nthe electric field inside domains Edc\nfixes the compressibility at the\nlevel shown by a dashed line. Inside the domain wall, the electric\n∗\nfield Edc is smaller than Edc\nand the compressibility depends on the\nlocal field as shown in the inset (for ωc /ω = 0.45, this ratio is\nindicated by the arrow.\nc 2003 WILEY-VCH Verlag GmbH & Co. KGaA, Weinheim\n\n\f24\n\nI.A. Dmitriev et al.: Magnetotransport in quantum-Hall systems\n\nIn Ref. [94] it was shown that the local compressibility of an irradiated 2DEG, χ = ν0 + δχ, exhibits\noscillations similar to the MIRO (see Fig. 22). Calculation using Eqs. (60) and (34) yields\nδχ/ν0 =\n\nZ\n\ndε ν̃(ε)∂ε [fT (ε) − f (ε)] = −δ 2\n\n2πω\nPω 2πω\nωc sin ωc + 4Qdc\n\n1 + Pω sin2\n\nπω\nωc\n\n+ Qdc\n\n.\n\n(66)\n\nThe key features of the effect are: (i) the period and the phase of the ω/ωc -oscillations in χ are the same\nas in σph , Eq. (64); (ii) the amplitude of the oscillations in χ and σph have the same dependence on the\nelectron temperature and microwave power; (iii) the ZRS corresponds to a plateau in the compressibility:\ninside the domains χ = ν0 (1−2δ 2 )/2. Local measurements of the compressibility may provide a real space\nsnapshot of the domain structure in the ZRS. Experimental work in this direction is currently underway.\n7.4 High-power effects, subleading mechanisms, fractional MIRO\nIn addition to the peak-valley structure near integer ω/ωc (integer MIRO), several experiments [83, 85,\n92, 95, 96, 97, 98] reported similar features near certain fractional values, ω/ωc = 1/2, 3/2, 5/2, 2/3..\n(\"fractional MIRO\", or FMIRO), which at elevated microwave power also evolved into ZRS (\"fractional\nZRS\") [97]. Initially, FMIRO were ascribed to multiphoton processes [95, 99]. This expanation, however,\nfailed to reproduce the observations [98], where the FMIRO only occured at ω below a certain threshold\nvalue. It was shown that the threshold can be explained in the framework of the single-photon inelastic\nmechanism [98, 100]. Here, the FMIRO near combined resonances nω = mωc occured due to a resonant\nseries of n single-photon transitions with real absorption (emission) of the microwave quanta [100], in\ndistinction to the virtual multiphoton processes. A systematic theory of the FMIRO [101] has shown\nthat the existing theories [99, 100] miss several important contributions. In particular, in the limit of\nwell separated LLs the FMIRO are dominated by multiphoton inelastic mechanism. Provided τin /τq ≫\n1, the multiphoton displacement mechanism [99] yields a parametrically smaller contribution and can\nbe neglected. At weaker magnetic field the effects related to microwave-induced sidebands in the DOS\nbecome important. Close to the magnetic field at which the LLs start to overlap, the FMIRO are dominated\nby the single-photon inelastic mechanism [100]. Finally, in the regime of strongly overlapping LLs the\nFMIRO get exponentially suppressed.\nA unified picture of the photoresponce in the limit of overlapping LLs was recently developed in [102].\nOn top of nonlinear interplay between the inelastic and displacement mechanisms at elevated microwave\npower, two novel mechanisms leading to the MIRO, \"quadrupole\" and \"photovoltaic\", were identified. In\nthe quadrupole mechanism, the microwave radiation leads to excitation of the second angular harmonic\nof the distribution function. The dc response in the resulting nonequilibrium state yields an oscillatory\ncontribution to the Hall part of the photoconductivity tensor which violates Onsager symmetry. In the\nphotovoltaic mechanism, a combined action of the microwave and dc fields produces non-zero temporal\nharmonics of the stationary distribution function. The ac response in this state contributes to both the\nlongitudinal and Hall MIRO. Provided τin /τq ≫ 1, the inelastic mechanism still gives the dominant contribution to the diagonal part of the photoconductivity tensor. However, the quadrupole and photovoltaic\nmechanisms are the only ones yielding oscillatory corrections to the Hall part. Further, it was shown that\na competition between various nonlinear effects (the feedback effects, the excitation of high angular and\ntemporal harmonics of the distribution function, and the multiphoton effects) drives the system through\nfour different nonlinear regimes with increasing microwave power. Most dramatic changes in the photoresponse are due to the feedback effects. At Pω ≫ 1, the feedback from the microwave–induced oscillations\nof the isotropic part of the distribution f (ε) leads to the saturation of the inelastic contribution, and to the\nstrong interplay of the inelastic effect and all other contributions to the MIRO. In particular, the strong oscillations of f (ε) change sign of the most relevant parts of the displacement and photovoltaic contributions.\nAt higher power, Pω ≫ ωc τin , the feedback suppresses the effects on higher temporal and angular harmonics of the distribution function. At still higher power, Pω ≫ τin /τq , the multiphoton excitation becomes\nc 2003 WILEY-VCH Verlag GmbH & Co. KGaA, Weinheim\n\n\fpss header will be provided by the publisher\n\n25\n\npronounced and starts to compete with the feedback effects. Finally, at Pω ≫ τin /ωc2 τq3 , the feedback and\nmultiphoton effects destroy all quantum contributions, restoring the classical Drude conductivity.\n7.5 New developments and open questions\nIn spite of the essential advances in the understanding of nonequilibrium magnetotransport phenomena in\na 2DEG, a number of questions remain open. A puzzling insensitivity of the MIRO to the direction of\ncircular polarization of the microwave field was reported in [103]. The strong interplay [104] between\nthe dc– [105, 106] and microwave–induced oscillations deserves theoretical study. A further challenging\ndirection of future experimental and theoretical research is the transition to the ZRS, the domain structure,\nelectron transport and noise in the ZRS; first steps in this direction have been made in [107, 108]. In\nparticular, the theory has not explained the seemingly activated temperature dependence of the residual\nresistance in the ZRS. Recently discovered B-periodic magnetooscillations [109] which were ascribed to\nthe microwave excitation of 2D edge magnetoplasmons warrant further investigation; in particular, their\nmicroscopic mechanism is still unclear.\nAcknowledgements Most of the work reported in this review has been done in the framework of the Schwerpunktprogramm \"Quanten-Hall-Systeme\" of the Deutsche Forschungsgemeinschaft. We acknowledge collaboration with\nY. Adamov, I.L. Aleiner, S.I. Dorozhkin, O. Entin-Wohlman, Y. Levinson, I.V. Pechenezhskii, E. Tsitsishvili, M.G.\nVavilov, F. von Oppen, and J. Wilke on topics reviewed in this article. We are grateful to P.T. Coleridge, W. Dietsche,\nS.I. Dorozhkin, R.R. Du, A.V. Germanenko, M.E. Gershenson, R. Haug, I.V. Kukushkin, Z.D. Kvon, J.G.S. Lok, R.G.\nMani, G.M. Minkov, C. Mitzkus, E.B. Olshanetsky, V.M. Pudalov, V. Renard, A.K. Savchenko, J.H. Smet, K. von\nKlitzing, D. Weiss, and M.A. Zudov for informing us on the experimental results and for stimulating discussions. We\nalso acknowledge support by the DFG Center for Functional Nanostructures, by EUROHORCS/ESF (I.V.G.), as well\nas by the INTAS Project 05-1000008-8044.\n\nReferences\n[1]\n[2]\n[3]\n[4]\n[5]\n[6]\n[7]\n[8]\n[9]\n[10]\n[11]\n[12]\n[13]\n[14]\n[15]\n[16]\n[17]\n[18]\n[19]\n[20]\n[21]\n[22]\n\nC.W.J. Beenakker and H. van Houten, Solid State Phys. 44, 1 (1991).\nD.K. Ferry and S.M. Goodnick, Transport in Nanostructures (Cambridge University Press, 1997).\nD.V. Khveshchenko, Phys. Rev. Lett. 77, 1817 (1996).\nA.D. Mirlin, D.G. Polyakov, and P. Wölfle, Phys. Rev. Lett. 80, 2429 (1998).\nA.D. Mirlin, J. Wilke, F. Evers, D.G. Polyakov, and P. Wölfle, Phys. Rev. Lett. 83, 2801 (1999).\nM.M. Fogler, A.Yu. Dobin, V.I. Perel, and B.I. Shklovskii, Phys. Rev. B 56, 6823 (1997).\nB.I. Halperin, P.A. Lee, and N. Read, Phys. Rev. B 47, 7312 (1993).\nF. Evers, A.D. Mirlin, D.G. Polyakov, and P. Wölfle, Phys. Rev. B 60, 8951 (1999).\nSee, e.g., J.H. Smet, in Composite Fermions, edited by O. Heinonen (Singapore, World Scientific, 1998).\nM. Dyakonov and R. Jullien, private communication.\nG.M. Gusev, P. Basmaji, Z.D. Kvon, L.V. Litvin, Yu.V. Nastaushev, and A.I. Toropov, J. Phys.: Condens. Matter\n6, 73 (1994).\nK. Tsukagoshi, S. Wakayama, K. Oto, S. Takaoka, K. Murase, and K. Gamo, Phys. Rev. B 52, 8344 (1995).\nG. Lütjering, Ph.D. Thesis (Stuttgart University, 1996).\nG. Nachtwei, Z.H. Liu, G. Lütjering, R.R. Gerhardts, D. Weiss, K. von Klitzing, and K. Eberl, Phys. Rev. B 57,\n9937 (1998).\nS. Cinà, D.D. Arnone, H.P. Hughes, C.L. Foden, D.M. Whittaker, M. Pepper, and D.A. Ritchie, Phys. Rev. B 60,\n7780 (1999).\nO. Yevtushenko, G. Lütjering, D. Weiss, and K. Richter, Phys. Rev. Lett. 84, 542 (2000).\nP.T. Coleridge, Phys. Rev. B 44, 3793 (1991).\nT. Saku, Y. Horikoshi, and Y. Tokura, Jpn. J. Appl. Phys. 35, 34 (1996).\nV. Umansky, R. de Picciotto, and M. Heiblum, Appl. Phys. Lett. 71, 683 (1997).\nD.G. Polyakov, F. Evers, A.D. Mirlin, and P. Wölfle, Phys. Rev. B 64, 205306 (2001).\nA.D. Mirlin, D.G. Polyakov, F. Evers, and P. Wölfle, Phys. Rev. Lett. 87, 126805 (2001).\nE.M. Baskin, L.N. Magarill, and M.V. Entin, Sov. Phys. JETP 48, 365 (1978); E.M. Baskin and M.V. Entin,\nPhysica B 249, 805 (1998).\nc 2003 WILEY-VCH Verlag GmbH & Co. KGaA, Weinheim\n\n\f26\n\nI.A. Dmitriev et al.: Magnetotransport in quantum-Hall systems\n\n[23] A.V. Bobylev, F.A. Maaø, A. Hansen, and E. H. Hauge, Phys. Rev. Lett. 75, 197 (1995); A.V. Bobylev, F.A.\nMaaø, A. Hansen, and E. H. Hauge, J. Stat. Phys. 87, 1205 (1997).\n[24] A. Kuzmany and H. Spohn, Phys. Rev. E 57, 5544 (1998).\n[25] A. Dmitriev, M. Dyakonov, and R. Jullien, Phys. Rev. B 64, 233321 (2001).\n[26] A. Dmitriev, M. Dyakonov, and R. Jullien, Phys. Rev. Lett. 89, 266804 (2002); V.V. Cheianov, A.P. Dmitriev,\nV.Yu. Kachorovskii, Phys. Rev. B 68, 2013 04 (2003); ibid 70 245307 (2004).\n[27] M.H. Ernst and A. Weyland, Phys. Lett. A 34, 39 (1971).\n[28] M.B. Isichenko, Rev. Mod. Phys. 64, 961 (1992).\n[29] J. Smet, private communication; M. Heiblum and V. Umansky, private communication.\n[30] J. Wilke, A.D. Mirlin, D.G. Polyakov, F. Evers, and P. Wölfle, Phys. Rev. B 61, 13774 (2000).\n[31] F. Evers, A.D. Mirlin, D.G. Polyakov, and P. Wölfle, Sov. Phys. Uspekhi (Suppl.) 171, 27 (2001).\n[32] D.G. Polyakov, F. Evers, and I.V. Gornyi, Phys. Rev. B 65, 125326 (2002).\n[33] I.A. Dmitriev, A.D. Mirlin, and D.G. Polyakov, Phys. Rev. B 70, 165305 (2004).\n[34] D. Weiss, K. v. Klitzing, K. Ploog, and G. Weimann, Europhys. Lett. 8, 179 (1989).\n[35] C. W. J. Beenakker, Phys. Rev. Lett. 62, 2020 (1989).\n[36] R.R. Gerhardts, D. Weiss, and K. von Klitzing, Phys. Rev. Lett. 62, 1173 (1989); R. W. Winkler, J. P. Kotthaus,\nand K. Ploog, ibid. 62, 1177 (1989); P. Vasilopoulos and F.M. Peeters, ibid. 63, 2120 (1989).\n[37] A.D. Mirlin and P. Wölfle, Phys. Rev. B 58, 12986 (1998).\n[38] Y. Levinson, O. Entin-Wohlman, A. D. Mirlin, and P. Wölfle, Phys. Rev. B 58, 7113 (1998).\n[39] A. D. Mirlin, P. Wölfle, Y. Levinson, and O. Entin-Wohlman, Phys. Rev. Lett. 81, 1070 (1998).\n[40] F. von Oppen, A. Stern, and B. I. Halperin, Phys. Rev. Lett. 80, 4494 (1998).\n[41] S. D. M. Zwerschke and R. R. Gerhardts, Phys. Rev. Lett. 83, 2616 (1999).\n[42] J. H. Smet, K. von Klitzing, D. Weiss, W. Wegscheider, Phys. Rev. Lett. 80, 4538 (1998).\n[43] J. H. Smet, S. Jobst, K. von Klitzing, D. Weiss, W. Wegscheider, and V. Umansky, Phys. Rev. Lett. 83, 2620\n(1999).\n[44] A.D. Mirlin, E. Tsitsishvili, and P. Wölfle, Phys. Rev. B 63, 245310 (2001).\n[45] A.D. Mirlin, E. Tsitsishvili, and P. Wölfle, Phys. Rev. B 64, 125319 (2001).\n[46] R. Menne and R. R. Gerhardts, Phys. Rev. B 57, 1707 (1998).\n[47] P. H. Beton, E. S. Alves, P. C. Main, L. Eaves, M. W. Dellow, M. Henini, O. H. Hughes, S. P. Beaumont, and\nC. D. W. Wilkinson, Phys. Rev. B 42, 9229 (1990).\n[48] V.D. Fil', V.I. Denisenko, and P.A. Bezuglyi, Fiz. Nizk. Temp. 1, 1217 (1975) [Sov. J. Low Temp. Phys. 1, 584\n(1975)].\n[49] Yu.M. Galperin, V.L. Gurevich, and V.I. Kozub, Usp. Fiz. Nauk 128, 107 (1979) [Sov. Phys. Usp. 22, 352 (1979)]\nand references therein.\n[50] C. Albrecht, J.H. Smet, D. Weiss, K. von Klitzing, R. Hennig, M. Langenbuch, M. Suhrke, U. Rössler, V. Umansky, and H. Schweizer, Phys. Rev. Lett. 83, 2234 (1999).\n[51] B.L. Altshuler and A.G. Aronov, Electron-electron interactions in disordered conductors, edited by A.L. Efros\nand M. Pollak (Elsevier, 1985)\n[52] A. Houghton, J.R. Senna, and S.C. Ying, Phys. Rev. B 25, 2196 (1982).\n[53] E. Abrahams, S.V. Kravchenko, and M.P. Sarachik, Rev. Mod. Phys. 73, 251 (2001).\n[54] B.L. Altshuler, D.L. Maslov, and V.M. Pudalov, Physica E 9 (2), 209 (2001).\n[55] G.Zala, B.N.Narozhny, and I.L.Aleiner, Phys. Rev. B 64, 214204 (2001); ibid, 65, 201201 (2001); ibid, 65,\n020201 (2002).\n[56] I.V. Gornyi and A.D. Mirlin, Phys. Rev. Lett. 90, 076801 (2003); Phys. Rev. B 69, 045313 (2004).\n[57] L. Li, Y.Y. Proskuryakov, A.K. Savchenko, E.H. Linfield, and D.A. Ritchie, Phys. Rev. Lett. 90, 076802 (2003).\n[58] E.B. Olshanetsky, V. Renard, Z.D. Kvon, J.C. Portal, N.J. Woods, J. Zhang, and J.J Harris, Phys. Rev. B 68,\n085304 (2003).\n[59] T. Ando, J. Phys. Soc. Japan 38, 989 (1975); T. Ando, A.B. Fowler, and F. Stern, Rev. Mod. Phys. 54, 437 (1982).\n[60] The consideration of ultra-long-range disorder with d ≫ lB in [59] is not justified since this condition violates\nthe applicability of SCBA.\n[61] I.A. Dmitriev, A.D. Mirlin, and D.G. Polyakov, Phys. Rev. Lett. 91, 226802 (2003).\n[62] M.E. Raikh and T.V. Shahbazyan, Phys. Rev. B 47, 1522 (1993); B. Laikhtman and E.L. Altshuler, Ann. Phys.\n232, 332 (1994).\n[63] P.T. Coleridge, R. Stoner, and R. Fletcher, Phys. Rev. B 39, 1120 (1989).\n[64] Y. Adamov, I.V. Gornyi, and A.D. Mirlin, Phys. Rev. B 73, 045426 (2006).\n[65] J. M. Luttinger and J. C. Ward, Phys. Rev. 118, 1417 (1960).\nc 2003 WILEY-VCH Verlag GmbH & Co. KGaA, Weinheim\n\n\fpss header will be provided by the publisher\n\n27\n\n[66] A.A. Abrikosov, L.P. Gorkov, and I.E. Dzyaloshinski, Methods of quantum field theory in statistical physics,\n(Dover Publications, New York,1963).\n[67] J.M. Luttinger, Phys. Rev. 121, 1251 (1961).\n[68] G.M. Martin, D.L. Maslov, and M.Yu. Reizer, Phys. Rev. B 68, 241309(R) (2003).\n[69] M. Fowler and R. E. Prange, Physics 1, 315 (1965); S. Engelsberg and G. Simpson, Phys. Rev. B 2, 1657 (1970).\n[70] T.J. Gramila, J.P. Eisenstein, A.H. MacDonald, L.N. Pfeiffer, and K.W. West, Phys. Rev. Lett. 66, 1216 (1991);\nPhys. Rev. B 47, 12957 (1993).\n[71] U. Sivan, P.M. Solomon, and H. Shtrikman, Phys. Rev. Lett. 68, 1196 (1992).\n[72] N.P.R. Hill, J.T. Nicholls, E.H. Linfield, M. Pepper, D.A. Ritchie, A.R. Hamilton, and G.A.C. Jones, J. Phys.:\nCondens. Matter 8, L557 (1996).\n[73] H. Rubel, A. Fisher, W. Dietsche, K. von Klitzing, and K. Eberl, Phys. Rev. Lett. 78, 1763 (1997).\n[74] X.G. Feng, S. Zelakiewicz, H. Noh, T.J. Ragucci, and T.J. Gramila, Phys. Rev. Lett. 81, 3219 (1998).\n[75] M.P. Lilly, J.P. Eisenstein, L.N. Pfeiffer, and K.W. West, Phys. Rev. Lett. 80, 1714 (1998).\n[76] M. Kellogg, I.B. Spielman, J.P. Eisenstein, L.N. Pfeiffer, and K.W. West, Phys. Rev. Lett. 88, 126804 (2002).\n[77] M. Kellogg, J.P. Eisenstein, L.N. Pfeiffer, and K.W. West, Phys. Rev. Lett. 90, 246801 (2003).\n[78] J.G.S. Lok, S. Kraus, M. Pohlt, W. Dietsche, K. von Klitzing, W. Wegscheider, and M. Bichler, Phys. Rev. B 63,\n041305 (2001).\n[79] K. Muraki, J.G.S. Lok, S. Kraus, W. Dietsche, K. von Klitzing, D. Schuh, M. Bichler, and W. Wegscheider, Phys.\nRev. Lett. 92, 246801 (2004).\n[80] L.Zheng, and A.H. MacDonald, Phys. Rev. B 48, 8203 (1993).\n[81] F. von Oppen, S.H. Simon, and A. Stern, Phys. Rev. Lett. 87, 106803 (2001).\n[82] I.V. Gornyi, A.D. Mirlin, and F. von Oppen, Phys. Rev. B 70, 245302 (2004).\n[83] M.A. Zudov, R.R. Du, J.A. Simmons, and J.R. Reno, Phys. Rev. B 64, 201311(R) (2001).\n[84] R.G. Mani, J.H. Smet, K. von Klitzing, V. Narayanamurti, W.B. Johnson, and V. Umansky, Nature 420, 646\n(2002).\n[85] M.A. Zudov, R.R. Du, L.N. Pfeiffer, and K.W. West, Phys. Rev. Lett. 90, 046807 (2003).\n[86] A.C. Durst, S. Sachdev, N. Read, and S.M. Girvin, Phys. Rev. Lett. 91, 086803 (2003).\n[87] V.I. Ryzhii, Sov. Phys. Solid State 11, 2078 (1970); V.I. Ryzhii, R.A. Suris, and B.S. Shchamkhalova, Sov. Phys.\nSemicond. 20, 1299 (1986).\n[88] M.G. Vavilov and I.L. Aleiner, Phys. Rev. B 69, 035303 (2004).\n[89] A.V. Andreev, I.L. Aleiner, and A.J. Millis, Phys. Rev. Lett. 91, 056803 (2003).\n[90] I.A. Dmitriev, M.G. Vavilov, I.L. Aleiner, A.D. Mirlin, and D.G. Polyakov, Physica E 25, 205 (2004).\n[91] I.A. Dmitriev, M.G. Vavilov, I.L. Aleiner, A.D. Mirlin, and D.G. Polyakov, Phys. Rev. B 71, 115316 (2005).\n[92] S.I. Dorozhkin, JETP Lett. 77, 577 (2003).\n[93] R.L. Willett, L.N. Pfeiffer, and K.W. West, Phys. Rev. Lett. 93, 026804 (2004).\n[94] M.G. Vavilov, I.A. Dmitriev, I.L. Aleiner, A.D. Mirlin, and D.G. Polyakov, Phys. Rev. B 70, 161306(R) (2004).\n[95] M.A. Zudov, Phys. Rev. B 69, 041304(R) (2004).\n[96] S.I. Dorozhkin, J.H. Smet, V. Umansky, and K. von Klitzing, Phys. Rev. B 71, 201306(R) (2005).\n[97] M.A. Zudov, R.R. Du, L.N. Pfeiffer, and K.W. West, Phys. Rev. B 73, 041303(R) (2006).\n[98] S.I. Dorozhkin, J.H. Smet, K. von Klitzing, L.N. Pfeiffer, and K.W. West, cond-mat/0608633.\n[99] X.L. Lei and S.Y. Liu, Appl. Phys. Lett. 88, 212109 (2006).\n[100] I.V. Pechenezhskii, S.I. Dorozhkin, and I.A. Dmitriev, JETP Lett. 85, 86 (2007).\n[101] I.A. Dmitriev, A.D. Mirlin, and D.G. Polyakov, Phys. Rev. Lett. 99, 206805 (2007).\n[102] I.A. Dmitriev, A.D. Mirlin, and D.G. Polyakov, Phys. Rev. B. 75, 245320 (2007).\n[103] J.H. Smet, B. Gorshunov, C. Jiang, L. Pfeiffer, K. West, V. Umansky, M. Dressel, R. Meisels, F. Kuchar, and\nK. von Klitzing, Phys. Rev. Lett. 95, 116804 (2005).\n[104] W. Zhang, M.A. Zudov, L.N. Pfeiffer, and K.W. West, Phys. Rev. Lett. 98, 106804 (2007).\n[105] C.L. Yang, J. Zhang, R.R. Du, J.A. Simmons, and J.L. Reno, Phys. Rev. Lett. 89, 076801 (2002).\n[106] M.G. Vavilov, I.L. Aleiner, and L.I. Glazman, Phys. Rev. B 76, 115331 (2007).\n[107] A. Auerbach, I. Finkler, B.I. Halperin, and A. Yacoby, Phys. Rev. Lett. 94, 196801 (2005).\n[108] J. Alicea, L. Balents, M.P.A. Fisher, A. Paramekanti, and L. Radzihovsky, Phys. Rev. B 71, 235322 (2005).\n[109] I.V. Kukushkin, M.Yu. Akimov, J.H. Smet, S.A. Mikhailov, K. von Klitzing, I.L. Aleiner, V.I. Falko, Phys. Rev.\nLett. 92, 236803 (2004).\n\nc 2003 WILEY-VCH Verlag GmbH & Co. KGaA, Weinheim\n\n\f"}