{"id": "http://arxiv.org/abs/0805.0976v1", "guidislink": true, "updated": "2008-05-07T12:59:25Z", "updated_parsed": [2008, 5, 7, 12, 59, 25, 2, 128, 0], "published": "2008-05-07T12:59:25Z", "published_parsed": [2008, 5, 7, 12, 59, 25, 2, 128, 0], "title": "GHASP : An Halpha kinematic survey of spiral and irregular galaxies -\n  VI. New Halpha data cubes for 108 galaxies", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0805.0931%2C0805.2670%2C0805.4375%2C0805.3913%2C0805.2156%2C0805.4087%2C0805.0901%2C0805.1369%2C0805.1712%2C0805.2404%2C0805.1802%2C0805.4693%2C0805.2755%2C0805.3541%2C0805.3028%2C0805.1886%2C0805.2898%2C0805.2013%2C0805.2982%2C0805.4437%2C0805.1920%2C0805.3657%2C0805.2452%2C0805.3571%2C0805.2557%2C0805.0079%2C0805.4039%2C0805.1527%2C0805.2344%2C0805.4545%2C0805.3578%2C0805.3389%2C0805.1478%2C0805.1079%2C0805.1688%2C0805.0414%2C0805.0880%2C0805.0909%2C0805.2049%2C0805.1976%2C0805.3308%2C0805.4208%2C0805.0244%2C0805.1356%2C0805.1829%2C0805.1034%2C0805.0224%2C0805.3824%2C0805.4118%2C0805.0603%2C0805.0554%2C0805.2581%2C0805.4476%2C0805.0146%2C0805.0976%2C0805.1498%2C0805.2922%2C0805.4316%2C0805.3372%2C0805.4798%2C0805.2275%2C0805.2999%2C0805.3603%2C0805.0301%2C0805.3813%2C0805.3796%2C0805.1946%2C0805.3589%2C0805.3148%2C0805.1352%2C0805.2769%2C0805.2742%2C0805.4528%2C0805.0104%2C0805.3612%2C0805.0453%2C0805.0954%2C0805.4187%2C0805.0138%2C0805.0086%2C0805.3660%2C0805.0411%2C0805.3194%2C0805.4836%2C0805.3709%2C0805.4418%2C0805.1800%2C0805.4540%2C0805.1303%2C0805.2936%2C0805.0223%2C0805.1929%2C0805.3878%2C0805.4394%2C0805.0111%2C0805.4407%2C0805.0308%2C0805.2262%2C0805.1012%2C0805.2283%2C0805.2716&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "GHASP : An Halpha kinematic survey of spiral and irregular galaxies -\n  VI. New Halpha data cubes for 108 galaxies"}, "summary": "We present the Fabry-Perot observations obtained for a new set of 108\ngalaxies that completes the GHASP survey (Gassendi HAlpha survey of SPirals).\nThe GHASP survey consists of 3D Ha data cubes for 203 spiral and irregular\ngalaxies, covering a large range in morphological types and absolute\nmagnitudes, for kinematics analysis. The GHASP sample is by now the largest\nsample of Fabry-Perot data ever published. We have derived Ha data cubes from\nwhich are computed Ha maps, radial velocity fields as well as residual velocity\nfields, position-velocity diagrams, rotation curves and the kinematical\nparameters for almost all galaxies. Original improvements in the determination\nof the kinematical parameters, rotation curves and their uncertainties have\nbeen implemented in the reduction procedure. This new method is based on the\nwhole 2D velocity field and on the power spectrum of the residual velocity\nfieldrather than the classical method using successive crowns in the velocity\nfield. Among the results, we point out that morphological position angles have\nsystematically higher uncertainties than kinematical ones, especially for\ngalaxies with low inclination. Morphological inclination of galaxies having no\nrobust determination of their morphological position angle cannot be\nconstrained correctly. Galaxies with high inclination show a better agreement\nbetween their kinematical inclination and their morphological inclination\ncomputed assuming a thin disk. The consistency of the velocity amplitude of our\nrotation curves have been checked using the Tully-Fisher relationship. Our data\nare in good agreement with previous determinations found in the literature.\nNevertheless, galaxies with low inclination have statistically higher\nvelocities than expected and fast rotators are less luminous than expected.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0805.0931%2C0805.2670%2C0805.4375%2C0805.3913%2C0805.2156%2C0805.4087%2C0805.0901%2C0805.1369%2C0805.1712%2C0805.2404%2C0805.1802%2C0805.4693%2C0805.2755%2C0805.3541%2C0805.3028%2C0805.1886%2C0805.2898%2C0805.2013%2C0805.2982%2C0805.4437%2C0805.1920%2C0805.3657%2C0805.2452%2C0805.3571%2C0805.2557%2C0805.0079%2C0805.4039%2C0805.1527%2C0805.2344%2C0805.4545%2C0805.3578%2C0805.3389%2C0805.1478%2C0805.1079%2C0805.1688%2C0805.0414%2C0805.0880%2C0805.0909%2C0805.2049%2C0805.1976%2C0805.3308%2C0805.4208%2C0805.0244%2C0805.1356%2C0805.1829%2C0805.1034%2C0805.0224%2C0805.3824%2C0805.4118%2C0805.0603%2C0805.0554%2C0805.2581%2C0805.4476%2C0805.0146%2C0805.0976%2C0805.1498%2C0805.2922%2C0805.4316%2C0805.3372%2C0805.4798%2C0805.2275%2C0805.2999%2C0805.3603%2C0805.0301%2C0805.3813%2C0805.3796%2C0805.1946%2C0805.3589%2C0805.3148%2C0805.1352%2C0805.2769%2C0805.2742%2C0805.4528%2C0805.0104%2C0805.3612%2C0805.0453%2C0805.0954%2C0805.4187%2C0805.0138%2C0805.0086%2C0805.3660%2C0805.0411%2C0805.3194%2C0805.4836%2C0805.3709%2C0805.4418%2C0805.1800%2C0805.4540%2C0805.1303%2C0805.2936%2C0805.0223%2C0805.1929%2C0805.3878%2C0805.4394%2C0805.0111%2C0805.4407%2C0805.0308%2C0805.2262%2C0805.1012%2C0805.2283%2C0805.2716&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We present the Fabry-Perot observations obtained for a new set of 108\ngalaxies that completes the GHASP survey (Gassendi HAlpha survey of SPirals).\nThe GHASP survey consists of 3D Ha data cubes for 203 spiral and irregular\ngalaxies, covering a large range in morphological types and absolute\nmagnitudes, for kinematics analysis. The GHASP sample is by now the largest\nsample of Fabry-Perot data ever published. We have derived Ha data cubes from\nwhich are computed Ha maps, radial velocity fields as well as residual velocity\nfields, position-velocity diagrams, rotation curves and the kinematical\nparameters for almost all galaxies. Original improvements in the determination\nof the kinematical parameters, rotation curves and their uncertainties have\nbeen implemented in the reduction procedure. This new method is based on the\nwhole 2D velocity field and on the power spectrum of the residual velocity\nfieldrather than the classical method using successive crowns in the velocity\nfield. Among the results, we point out that morphological position angles have\nsystematically higher uncertainties than kinematical ones, especially for\ngalaxies with low inclination. Morphological inclination of galaxies having no\nrobust determination of their morphological position angle cannot be\nconstrained correctly. Galaxies with high inclination show a better agreement\nbetween their kinematical inclination and their morphological inclination\ncomputed assuming a thin disk. The consistency of the velocity amplitude of our\nrotation curves have been checked using the Tully-Fisher relationship. Our data\nare in good agreement with previous determinations found in the literature.\nNevertheless, galaxies with low inclination have statistically higher\nvelocities than expected and fast rotators are less luminous than expected."}, "authors": ["B. Epinat", "P. Amram", "M. Marcelin", "C. Balkowski", "O. Daigle", "O. Hernandez", "L. Chemin", "C. Carignan", "J. -L. Gach", "P. Balard"], "author_detail": {"name": "P. Balard"}, "author": "P. Balard", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1111/j.1365-2966.2008.13422.x", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/0805.0976v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0805.0976v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "accepted in MNRAS for publication, 60 pages, 25 figures, usues\n  biblio.bib for bibliography (.bbl included in the archive), natbib.sty,\n  epsfig.sty", "arxiv_primary_category": {"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0805.0976v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0805.0976v1", "journal_reference": null, "doi": "10.1111/j.1365-2966.2008.13422.x", "fulltext": "Mon. Not. R. Astron. Soc. 000, 000–000 (2008)\n\nPrinted 24 October 2018\n\n(MN LATEX style file v2.2)\n\narXiv:0805.0976v1 [astro-ph] 7 May 2008\n\nGHASP : An Hα kinematic survey of spiral and irregular\ngalaxies - VI. New Hα data cubes for 108 galaxies.\nEpinat, B.1, Amram, P.1, Marcelin M.1, Balkowski C.2, Daigle, O.1,3,\nHernandez,\nO.3,1, Chemin, L.2, Carignan, C.3, Gach, J.-L.1, Balard, P.1\n1\n\nLaboratoire d'Astrophysique de Marseille, OAMP, Université de Provence & CNRS, 2 Place Le Verrier, 13248 Marseille Cedex 04 France\nObservatoire de Paris-Meudon, Université Paris VII, 5 Place Jules Janssen, 92195 Meudon, France.\n3 LAE et Observatoire du mont Mégantic, Université de Montréal, C. P. 6128 succ. centre ville, Montréal, Québec, Canada H3C 3J7\n2 GEPI,\n\nAccepted. Received; in original form\n\nABSTRACT\n\nWe present the Fabry-Perot observations obtained for a new set of 108 galaxies in\nthe frame of the GHASP survey (Gassendi HAlpha survey of SPirals). The GHASP\nsurvey consists of 3D Hα data cubes for 203 spiral and irregular galaxies, covering\na large range in morphological types and absolute magnitudes, for kinematics analysis. The new set of data presented here completes the survey. The GHASP sample\nis by now the largest sample of Fabry-Perot data ever published. The analysis of\nthe whole GHASP sample will be done in forthcoming papers. Using adaptive binning techniques based on Voronoı̈ tessellations, we have derived Hα data cubes from\nwhich are computed Hα maps, radial velocity fields as well as residual velocity fields,\nposition-velocity diagrams, rotation curves and the kinematical parameters for almost\nall galaxies. Original improvements in the determination of the kinematical parameters, rotation curves and their uncertainties have been implemented in the reduction\nprocedure. This new method is based on the whole 2D velocity field and on the power\nspectrum of the residual velocity field rather than the classical method using successive crowns in the velocity field. Among the results, we point out that morphological\nposition angles have systematically higher uncertainties than kinematical ones, especially for galaxies with low inclination. Morphological inclination of galaxies having\nno robust determination of their morphological position angle cannot be constrained\ncorrectly. Galaxies with high inclination show a better agreement between their kinematical inclination and their morphological inclination computed assuming a thin disk.\nThe consistency of the velocity amplitude of our rotation curves have been checked\nusing the Tully-Fisher relationship. Our data are in good agreement with previous determinations found in the literature. Nevertheless, galaxies with low inclination have\nstatistically higher velocities than expected and fast rotators are less luminous than\nexpected.\nKey words: Galaxies: spiral; irregular; dwarf; Galaxies: kinematics and dynamics;\n\n1\n\nINTRODUCTION\n\nAs it is nowadays largely admitted, 2D velocity fields allow the computation of 1D rotation curves in a more robust\nway than long slit spectrography. Indeed, first of all, the\nspatial coverage is larger and moreover, the kinematical parameters are determined a posteriori instead of a priori in\nlong slit spectrography. In that context, we have undertaken\nthe kinematical 3D GHASP survey (acronym for Gassendi\nHα survey of SPirals). The GHASP survey consists of a sample of 203 spiral and irregular galaxies, mostly located in\nnearby low density environments, observed with a scanning\n\nFabry-Perot for studying their kinematical and dynamical\nproperties through the ionized hydrogen component.\nStudying the links between parameters reflecting the\ndynamical state of a galaxy will help us to have a better\nunderstanding of the evolution of galaxies. This sample has\nbeen constituted in order:\n(i) to compute the local Tully-Fisher relation;\n(ii) to compare the kinematics of galaxies in different environments (field, pairs, compact groups, galaxies in cluster)\nfor discriminating secular evolution from an external origin\n(e.g. Garrido et al. 2005);\n\n\f2\n\nB. Epinat et al.\n\n(iii) to study the distribution of luminous and dark halo\ncomponents along the Hubble sequence for high and low\nsurface brightness galaxies, for a wide range of luminosities in combining the optical data with the radio ones (e.g.\nSpano et al. 2007; Barnes et al. 2004);\n(iv) to model the effect of non axisymmetric structures\nlike bars, spiral arms, oval distortions, lopsidedness in\nthe mass distribution using both N-body + hydrodynamic\nnumerical simulations (e.g. Hernandez et al. in preparation), kinemetric analysis (e.g. Krajnović et al. 2006) and\nTremaine-Weinberg method to measure the bar, spiral and\ninner structure pattern speeds (Hernandez et al. 2005a);\n(v) to analyze the gaseous velocity dispersion and to link\nit with the stellar one;\n(vi) to create templates rotation curves (e.g.\nCatinella et al. 2006; Persic & Salucci 1991; Persic et al.\n1996) and templates velocity fields;\n(vii) to map the 2D mass distribution using 2D velocity field, broad band imagery and spectrophotometric evolutionary models;\n(viii) to search for links between the kinematics (shape of\nrotation curves, angular momentum, ...) and the other physical properties of galaxies like star formation rate (e.g. comparison with star forming galaxies like blue compact galaxies, ...);\n(ix) to produce a reference sample of nearby galaxies\nto compare to the kinematics of high redshift galaxies\n(Puech et al. 2006; Epinat et al. 2007). Indeed, it is necessary to disentangle the effects of galaxy evolution from\nspatial (beam smearing) and spectral resolution effects.\nThis paper is the sixth of a series called hereafter Paper\nI to V (Garrido et al. 2002, 2003, 2004, 2005; Spano et al.\n2007) presenting the data obtained in the frame of the\nGHASP survey. The data gathered with the seven first observing runs have been published from Paper I to IV. Dark\nmatter distribution in a sub-sample of 36 spiral galaxies have\nbeen presented in Paper V. This paper presents the last unpublished 101 Hα data cubes of the GHASP survey. It includes 108 galaxies (seven data cubes contain two galaxies),\nproviding 106 velocity fields and 93 rotation curves resulting\nfrom observational runs eight to fourteen. This represents\nthe largest set of galaxies observed with Fabry-Perot techniques ever published in the same paper (Schommer et al.\n1993 sample consists of 75 cluster galaxies in the southern\nhemisphere observed with Fabry-Perot techniques and was\nthe largest sample published to date). Including the previous\npapers (Paper I to IV), the GHASP survey totalizes FabryPerot data for 203 galaxies observed from 1998 to 2004. The\nGHASP sample is by now the largest sample of Fabry-Perot\ndata ever published.\nIn section 2, the selection criteria of the GHASP sample, the instrumental set-up of the instrument and the data\nreduction procedure are described. In section 3, different momenta of the data cubes are presented as well as the new\nmethod to build the rotation curves and to determine the\nuncertainties. An analysis of the residual velocity fields and\nof the kinematical parameters is thus given. In section 4, the\nTully-Fisher relation is plotted for the GHASP galaxies presented in this paper. In section 5, we give the summary and\nconclusions. In Appendix A, we present some details on the\nmethod used to compute the rotation curves. In Appendix\n\nB, the comments for each individual galaxy are given. In Appendix C, the different tables are given while in Appendix\nD the individual maps and position-velocity diagrams are\nshown. The rotation curves are finally displayed in Appendix\nE while the numerical tables corresponding to the rotation\ncurves are given in Appendix F.\nWhen the distances of the galaxies are not known, a\nHubble constant H0 =75 km s−1 Mpc−1 is used throughout\nthis paper.\n\n2\n2.1\n\nOBSERVATIONS AND DATA REDUCTION\nThe GHASP sample\n\nThe GHASP survey was originally selected to be a subsample complementing the radio survey WHISP (Westerbork survey of HI in SPirals galaxies) providing HI\ndistribution and velocity maps for about 400 galaxies (http://www.astro.rug.nl/~ whisp). The first set of\nGHASP galaxies was selected from the first WHISP website\nlist but some of them have never been observed by WHISP.\nThus only 130 galaxies have finally been observed in both\nsurveys. The comparison between the kinematics of neutral\nand ionized gas coming from the GHASP and the WHISP\ndatasets is possible for a sub-sample of 31 dwarf galaxies\nstudied by Swaters et al. (2002) and for another sub-sample\nof 19 early-type galaxies analyzed by Noordermeer et al.\n(2005), the remaining part of the WHISP sample being yet\nunpublished but most of the HI maps are nevertheless available on the WHISP website.\nMost of the GHASP targets were chosen in nearby lowdensity environments. Nevertheless, some galaxies in pairs or\nin low density groups have been observed mainly when they\nwere selected by WHISP (see individual comments in Appendix B). Seven galaxies of the GHASP sample are located\nin nearby clusters (UGC 1437 in the cluster Abell 262, UGC\n4422 and 4456 in the Cancer cluster, UGC 6702 in the cluster\nAbell 1367, UGC 7021, 7901 and 7985 in the Virgo cluster).\nMore Virgo cluster galaxies observed with the same instrument have been published elsewhere (Chemin et al. 2006).\nFigure 1 displays the distribution of the whole GHASP\nsurvey in the magnitude-morphological type plane. We have\nfound in the literature measurements for both MB and Hubble type for 198 galaxies (over the 203 galaxies). Among the\nsample of 203 galaxies, 83 are strongly barred galaxies (SB\nor IB) and 53 are moderately barred galaxies (SAB or IAB).\nThe GHASP sample provides a wide coverage in galaxy luminosities (-16≤Mb ≤-22), thus in galaxy masses (109 M⊙ – 5\n1011 M⊙) and in morphological types (from Sa to Irregular).\nThe well-known relation for spiral and irregular galaxies between the morphological type and the absolute magnitude\nis observed through the GHASP sample. Within the dispersion of this relation, the 203 GHASP galaxies are reasonably\ndistributed through the plane down to low magnitudes (≥16) and to early-types spiral (≤0, Sa). The whole GHASP\ndataset of galaxies is reasonably representative of the LEDA\nsample (see Paper IV).\nThe journal of the observations for the 107 new galaxies\nis given in Table C1. The 108th galaxy, UGC 11300 has been\nobserved for the third time in order to check the consistency\nof the new data reduction method (the second observation\n\n\fGHASP : An Hα kinematic survey of spiral and irregular galaxies - VI.\n\n3\n\npublished in Paper IV was already done in order to compare\nthe new GaAs camera with the \"S20\" photocathode), leading to 107 new galaxies. Note that the right ascension and\nthe declination given in table C1 are the coordinates of the\nkinematical center (and not the morphological ones given in\nHyperLeda or in LEDA, except if stated otherwise).\n\n2.2\n\nThe instrumental setup\n\nIn order to map the flux distribution and the velocity\nfields of the sample of galaxies, high spectral resolution 3D\ndata cubes in the Hα line have been obtained. This has\nbeen achieved using a focal reducer containing the scanning\nFabry-Perot interferometer attached at the Cassegrain focus of the 1.93 m OHP telescope (Observatoire de Haute\nProvence). The instrument principles and characteristics are\nthe same as for papers I, II, III, IV and V. The detector, a\nnew generation image photon counting system (IPCS) is the\nsame as the one used for Paper IV (with a GaAs photocathode). The pixel size is 0.68′′ (however the angular resolution\nof our data is limited by the seeing, about ∼3′′ , e.g. Table\nC1), the field of view is 5.8 square arcmin and the velocity\nsampling is ∼5 km s−1 (for a resolution of ∼10 km s−1 ).\n\n2.3\n\nFigure 1. Top: distribution of morphological type for almost\nall of the GHASP sample (201/203 galaxies). Middle: distribution of the absolute B-band magnitude for almost all of the\nGHASP sample (198/203 galaxies). For both top and middle, the\nblue hash, red hash and residual white represent respectively the\nstrongly barred, the moderately barred and the non-barred galaxies. Bottom: distribution for almost all of the GHASP sample\n(198/203 galaxies) in the \"magnitude-morphological type\" plane\ndistinguishing strongly barred (blue squares), moderately barred\n(red triangles) and unbarred galaxies (black circles).\n\nThe data reduction\n\nThe Fabry-Perot technique provides an Hα profile inside\neach pixel, so that a typical velocity field of a GHASP galaxy\ncontains thousands of velocity points. For most of the galaxies observed with GHASP, the velocity field is not limited\nto the HII regions but covers most of the diffuse emission of\nthe disk, as can be seen on the figures. The detection limit\nof our device is about 10−18 erg cm−2 s−1 arcsec−2 , with a\nS/N ratio between 1 and 2 for a typical 2 hours exposure\ntime according to figure 2 of Gach et al. (2002). This insures\na good detection of the Hα diffuse emission of the disk for\nmost of the galaxies since most of the Hα emission found\nbelow 1.6 10−16 erg cm−2 s−1 arcsec−2 may be considered\nas filamentary and/or diffuse according to Ferguson et al.\n(1996). The way to derive the different moment maps of the\n3D data cube (Hα line maps and Hα velocity fields) are explained in D2006. The Hα image is a pure monochromatic\nimage of the galaxy (continuum and [NII] free).\nIn a few cases, when the velocity amplitude is comparable to or higher than the width of the interference filter,\nits transmission is not necessarily centered on the systemic\nvelocity and one side of the galaxy may be better transmitted than the other side, leading to an artificial asymmetry\nin the intensity of the Hα emission (see Paper IV for additional explanations as well as in individual comments on\neach galaxy in Appendix B).\nThe data processing and the measurements of the kinematical parameters are different from those used in Paper I\nto V. The data processing used in this paper is basically the\nsame as the one described by Daigle et al. (2006b) (hereafter\nD2006). One of the main improvements implemented in this\ndata processing is the use of adaptive spatial binning, based\non the 2D-Voronoı̈ tessellations method applied to the 3D\ndata cubes, allowing to optimize the spatial resolution to the\nsignal-to-noise ratio. Let us also mention that when enough\nstars or bright HII regions were available in the field of view,\n\n\f4\n\nB. Epinat et al.\n\nwe corrected the observation from telescope drift (or instrumental flexures) when necessary. Hereafter, we just point\nout the main difference between the method described in\nD2006 and the method used in this paper.\nThe main difference is the criterion used to fix the size\nof the bins. Indeed, with the spatial adaptive binning technique, a bin is accreting new pixels until it has reached a\ngiven criterion given a priori. In D2006, the criterion is the\nsignal-to-noise ratio of the emission line within the bin. For\neach bin, the noise is determined from the r.m.s of the continuum (the line free region of the whole spectrum). The\nsignal-to-noise ratio is thus the ratio between the flux in the\nline and the r.m.s. in the continuum. While for the data described in D2006, the number of channels scanned is large\nenough (36 channels) to determine properly the noise in the\ncontinuum, this is not anymore the case here where the number of channels scanned is smaller (24 channels). For the\nsame given spectral resolution (fixed by the interference order and the Finesse of the Fabry-Perot interferometer used),\nthe ratio between the number of channels containing the\ncontinuum and the number of channels containing the line\nis thus larger (by a factor 3/2) in D2006 than here. Furthermore, the criterion in D2006 is not relevant anymore for the\nGHASP data. Instead of the signal-to-noise ratio, the criterion used here is simply the square root of the flux in the\nline, that is an estimate of the Poisson noise in the line flux.\nA second major improvement is the suppression of the\nghosts due to reflection at the interfaces air/glass of the interferometer (Georgelin 1970). The reduction routine takes\ninto account the front reflection (between the interference\nfilter and the interferometer) and the back reflection (between the interferometer and the camera detector window).\nThe ghosts are calibrated and then subtracted thanks to\nbright stars.\nAnother major improvement is an automatic cleaning\nof the velocity fields. The outskirts of a galaxy, where there\nis no more diffuse Hα emission, has to be delimited. Due\nto residual night sky lines and background emissions (after subtraction), adaptive binning produces large sky bins\nwith a given signal-to-noise ratio or given flux. These bins\ncontaining only sky emission are separated from the bins\nof the galaxy thanks to a velocity continuity process. The\nvelocity field is divided in several regions where the velocity difference between contiguous bins is lower than a given\ncutoff value. The regions with too low monochromatic flux\nand too large bins are erased. The given cutoff fixed a priori is about one tenth of the total amplitude of the velocity\nfield (let's say 30 km s−1 for a velocity field with an overall\namplitude of ∼300 km s−1 ).\nKarma (Gooch 1996) and its routine Koords have\nbeen used to compute the astrometry. XDSS Blue band images or XDSS Red band images when blue image was not\navailable are displayed (see individual captions in Figures D1\nto D106). Systematic comparison between these broad-band\nimages and the field stars in high resolution continuum images (with no adaptive binning) were made in order to find\nthe correct World Coordinate System for each image.\n\n3\n3.1\n\nDATA ANALYSIS\nDifferent maps from the 3D data cube\n\nFor each galaxy, in Appendix D, from Figure D1 to D106,\nwe present up to five frames per figure: the XDSS blue\n(or red) image (top/left), the Hα velocity field (top/right),\nthe Hα monochromatic image (middle/left, eventually the\nHα residual velocity field (middle/right) and finally the\nposition-velocity diagram along the major axis (bottom)\nwhen it can be computed. The white and black cross indicates the center used for the kinematic analysis (given\nin Table C1, e.g. Appendix A for determination) while the\nblack line traces the kinematical major axis deduced from\nthe velocity field analysis (e.g. section 3.2) or the morphological one (taken from HyperLeda) when no position angle of the kinematical major axis could be derived using\nthe kinematic (e.g. Table C2). This line ends at the radius\nD25 /2 corresponding to the isophotal level 25 mag arcsec−2\nin the B-band (given in Table C3) in order to compare the\nvelocity field extent with the optical disk of the galaxies.\nPosition-velocity diagrams are computed along the axis defined by this black line, using a virtual slit width of seven\npixels, and the red line on the position-velocity diagram is\nthe rotation curve deduced from the model velocity field (see\nnext section) along this virtual slit. When no fit is satisfying\n(generally because of poor signal-to-noise ratio), we used the\nreal velocity field instead of the model (see individual captions in Figures D1 to D106). The rotation curves are found\nin Appendix E (figures) and F (tables). Colour version of\nthe rotation curves in Appendix E are only available online.\nRotation curves are computed and displayed following the\nmethod described in section 3.2. These figures are also available on the Web site of GHASP:\nhttp://FabryPerot.oamp.fr.\nIn order to illustrate the printed version of the paper we have\nchosen to display the diversity through four galaxies having different morphological types, see Appendix D19 (UGC\n3740, SAB(r)c pec), D31 (UGC 4820, S(r)ab), D45 (UGC\n5786, SAB(r)b), D56 (UGC 7154, SBcd). The Appendix D\nmaps of the other galaxies are only available on line.\nOnly the first page of Appendix F that contains the\ntables corresponding to the rotation curves of the two first\ngalaxies is displayed on the printed version of the paper, the\nremaining part of Appendix F being available on line.\n\n3.2\n\nConstruction of the Rotation Curves and\nDetermination of the Uncertainties\n\nA new automatic fitting method has been developed to\nderive automatically a rotation curve from the 2D velocity field. This method makes the synthesis between (i) the\nmethod used in Paper I to IV, (ii) the method based on\ntilted-ring models found for instance in the ROTCUR routine of Gipsy (Begeman 1987) and (iii) the method used by\nBarnes & Sellwood (2003).\nWarps are mainly seen in galactic disks at radii R >\nRopt . Tilted-ring models have been developed to model the\ndistribution of neutral hydrogen for which warps of the HI\ndisk may be more or less severe. In case of a warp, a monotonic change of the major axis position angle (P A) and of\nthe inclination (i) is observed.\n\n\fGHASP : An Hα kinematic survey of spiral and irregular galaxies - VI.\nOn the other hand, within the optical disk, the kinematic parameters P A and i do not vary significantly and\nchange monotonically with the radius (Paper I to IV and\nHernandez et al. 2005b). The variation of P A and i with the\nradius is more likely due to non circular motions in the plane\nof the disk (e.g. bars) than to motions out of the plane (like\nwarps) and looks like oscillations around a median value.\nThus, we do not allow P A nor i to vary with the radius.\nUsing tilted-ring models, the errors on the parameters\nare the dispersion of the kinematical parameters over the\nrings. The method developed here uses the whole residual velocity field to estimate the dispersion induced by non circular motions and not only the segmented information within\neach ring as it is the case in tilted-ring models.\nOur fitting method is similar to Barnes & Sellwood\n(2003) method. Two differences may nevertheless be pointed\nout. A minor difference is that they use a non parametric\nprofile while we fit an analytic function (more details on\nthe building of the rotation curve are given in Appendix A).\nThe major improvement is the computation of the kinematic\nuncertainties. Indeed, the statistical uncertainty on the fit\nis unrealistically small (Barnes & Sellwood 2003), because\nthe noise on the data is considered as a blank random noise.\nThat is not the case because the noise in the residual velocity\nfield is mainly due to non circular motions (bar, oval distortions, spiral arms, local inflows and outflows, ...) and to the\nintrinsic turbulence of the gas that have characteristic correlation lengths. In order to take it into account, we compute\nthe errors with the power spectrum of the residual velocity\nfield, applying a Monte-Carlo method (see Appendix A).\nRotation curves for the barred galaxies of our sample\nhave been plotted without correction for non-circular motions along the bar.\nThe rotation curves are sampled with rings. Within the\ntransition radius (defined in Appendix A), the width of the\nrings is set to match half the seeing. Beyond that radius,\neach ring contains from 16 to 25 velocity bins.\nThe curves are plotted with both sides superimposed in\nthe same quadrant, using different symbols for the receding\n(crosses) and approaching (dots) side (with respect to the\ncenter). The black vertical arrow on the x-axis represents\nthe radius D25 /2 while the smaller grey arrow on the x-axis\nrepresents the transition radius, always smaller than D25 /2\nby definition.\nFor galaxies seen almost edge-on (inclination higher\nthan 75◦ ) our model does not describe accurately the rotation of a galaxy since the thickness and the opacity of\nthe disk cannot be neglected anymore. Indeed, on the one\nhand it is well known that, due to inner galactic absorption, edge-on galaxies tend to display smoother inner velocity field and rotation curve gradients than galaxies with\nlow or intermediate inclinations and, on the other hand, due\nto the actual thickness of the disk, using a simple rotation\nmodel in the plane of the galaxy disk, motion out of the disk\nare wrongly interpreted as circular motions in the disk. As\na consequence, for most of highly inclined galaxies, the fit\nconverges towards unrealistic low inclination values, leading\nto modelled velocity fields and rotation curves having too\nhigh velocity amplitudes. Thus, for NGC 542, UGC 5279,\nUGC 5351, UGC 7699, UGC 9219, UGC 10713 and UGC\n11332, no rotation curve has been plotted. For them, the\nposition-velocity diagram gives a more suitable information\n\n5\n\nthan the rotation curve and allows to follow the peak-topeak or peak-to-valley velocity distribution along the major\naxis.\n3.3\n\nResidual velocity fields\n\nAs detailed in the previous paragraph and in Appendix\nA, the main assumption necessary to derive a rotation\ncurve from the observed velocity field is that rotation is\ndominant and that all non circular motions are not part of\na large-scale pattern. The five kinematical parameters computed from the velocity field to draw the rotation curve are\ndetermined from different symmetry properties of the radial\nvelocity field. The influence of small errors in these parameters is to produce patterns with characteristic symmetries\nin the residual velocity field. This was first illustrated by\nWarner et al. (1973) and by van der Kruit & Allen (1978).\nIn their schematic representation of the residual motions in\ndisk galaxies (the modelled velocity field computed from the\nrotation curve has been subtracted to the observed velocity\nfield), a bad determination of one or several kinematical parameters leads to typical signatures in the residual velocity\nfield (e.g. velocity asymmetry around the major axis in case\nof a bad position angle determination, ...). The residual velocity fields plotted for each galaxy in Appendix D clearly\nshow that these typical signatures are not seen, this means\nthat the best determination of the kinematical parameters\nhas been achieved.\nThe deviation from purely circular velocity can be large.\nIn a forthcoming paper these residual velocity fields will be\nanalyzed in terms of bars and oval distortions, warps, spiral arms (streaming motions), outflows and inflows, ... (e.g.\nFathi et al. 2007).\nThe mean velocity dispersion on each residual velocity\nfield has been computed for each galaxy and tabulated in Table C2, they range from 4 to 54 km s−1 with a mean value\naround 13 km s−1 . Figure 2 shows that the residual velocity\ndispersion is correlated with the maximum amplitude of the\nvelocity field (shown by the dashed linear regression), this\ntrend remains if we display the residual velocity dispersion\nversus the maximum circular velocity (not plotted). Surprisingly, barred galaxies do not have, in average, a higher mean\nresidual velocity dispersion than unbarred galaxies (not plotted). This may be explained by the fact that the number of\nbins contaminated by the bar is usually rather low with respect to the total bins of the disk. Indeed, this is not the\ncase for disks dominated by a bar. Compared to the general\ntrend, we observe a set of about a dozen of galaxies with\na high residual velocity dispersion (points above the dotted\nline in Figure 2). These points correspond to galaxies having\nstrong bar or spiral structure and to data of lower quality:\n(i) galaxies dominated by strong bars (UGC 89 and UGC\n11407), or strong spiral structures (UGC 5786 and UGC\n3334) are not correctly described by our model which does\nnot take into account non axisymmetric motions; (ii) the\nvelocity field of the lower quality data (UGC 1655, UGC\n3528, IC 476, UGC 4256 , UGC 4456, IC 2542, UGC 6277,\nUGC 9406 and UGC 11269) present a mean size of the bins\ngreater than 25 pixels and an integrated total Hα flux lower\nthan 4.5 W m−2 (a rough calibration of the total Hα flux of\nGHASP galaxies using the 26 galaxies we have in common\nwith James et al. 2004 has been made, assuming a spectral\n\n\f6\n\nB. Epinat et al.\ndue to the difference in wavelength between the calibration\nand the redshifted Hα lines, the coating of the Fabry-Perot\ninterferometer induces a small systematic bias (phase shift\neffect) to the absolute systemic velocities. We tabulate the\nsystemic velocities without correcting them from this phase\nshift because the dispersion by the phase effect is typically\nof the same order of magnitude than the dispersion of the\nsystemic velocities found in HyperLeda (Paper IV) and also\nbecause the forthcoming analysis and in particular the rotation curves do not depend on this effect.\n\nFigure 2. Dispersion in residual velocity field versus maximum velocity, sorted by Hubble morphological type: black circles\n0≤t<2, red triangles 2≤t<4, blue squares 4≤t<6, green rhombuses 6≤t<8 and pink stars 8≤t<10. The dashed line represents\nthe linear regression on the data. The points above the dotted\nline are discussed in section 3.3. UGC 3334 labelled with an arrow has actually a residual velocity dispersion of 54 km s−1 (see\nTable C2).\n\nratio Hα over [NII] of 3:1). Figure 2 also shows that, for a\ngiven velocity amplitude, this correlation does not clearly\ndepend on the morphological type. We note the well known\nfact that late-type galaxies have in average a lower velocity\namplitude than early-type ones.\nFor most of the galaxies seen almost edge-on (i higher\nthan 75◦ ), due to the thickness of the disk, no model has\nbeen fitted (see previous subsection) thus no residual velocity fields can be plotted.\n3.4\n\nKinematical parameters\n\nTable C2 gives the input (morphological) parameters of the\nfits and the results of the fits (output parameters, χ2 , and\nparameters of the residual maps). Table C3 gives some fundamental parameters of the galaxies compiled in the literature (morphological and Hubble type, distance, MB , D25 /2,\naxis ratio, HI maps available in literature), together with\nmaximum velocity parameters computed from the rotation\ncurves (Vmax , quality flag on Vmax ). The four galaxies larger\nthan our field of view are flagged in the Table C3. For some\ngalaxies for which the signal-to-noise ratio or the spatial\ncoverage is too low, the fit could not converge correctly and\none or two parameters (i and P A) were usually fixed to\nthe morphological values to achieve the fit. These galaxies\nare flagged with an asterisk (∗ ) in the Table C2. When it\nis not the case, parameter determinations are discussed in\nAppendix B. For some extreme cases, even when i and P A\nwere fixed, the fit does not converge. In particular for galaxies having high inclinations, then no model was computed\n(see section 3.2).\nAs underlined in Paper I, Garrido (2003) and Paper IV,\n\nIn Figure 3, the kinematical position angles obtained\nby GHASP are compared with the photometric position angles (found in HyperLeda). The error bar on the morphological position angle, which is generally not homogenously\ngiven in the literature (or not given at all), has been estimated using the axis ratio and optical radius uncertainties.\nThe galaxy disk in the sky plane is modelled by an ellipse of\naxis ratio b/a where a is equal to D25 . Given the uncertainty\non D25 , ∆D25 , a circle of diameter D25 -∆D25 /2 having the\nsame center than the ellipse is considered. A line passing\nthrough the intersection between the ellipse and the circle\nand their common center is thus defined. The angle formed\nbetween the major axis of the ellipse and the previously\ndefined line represents the 1-σ uncertainty on the position\nangle.\nFor all galaxies, HyperLeda references a list of position\nangles from which they often computed one position angle value. HyperLeda does not compute a value when the\ndispersion or the uncertainty is too large. Indeed, the position angle may be quite different from a study to another,\ndepending on (i) the method, (ii) the size of the disk and\n(iii) the broad band colors considered by the different authors (non homogeneity in radius and colors measurements).\nWhen no value is computed in HyperLeda, we put the whole\nlist in Table C2. Moreover, to make it readable and to minimize the dispersion on Figure 3, we only plot the morphological value found closest from the kinematical position angle. In Figure 3, we have distinguished the bulk of galaxies\n(black circles) for which the agreement is rather good (lower\nthan 20◦ see 3, bottom) from (i) the galaxies for which no\naccurate morphological position angle has been computed\n(red open circles) and (ii) the galaxies having an inclination\nlower than 25◦ (blue squares). Indeed, some galaxies present\na disagreement between kinematical and photometric position angle larger than 20◦ . Most of these galaxies have (i)\na bad morphological determination of the position angle or\n(ii) have kinematical inclinations lower than 25◦ or (iii) are\nspecific cases (namely UGC 3740, IC 476, UGC 4256, UGC\n4422) and are discussed in Appendix B. On the other hand,\nFigure 3 shows that morphological position angles have systematically higher uncertainties than kinematical ones, this\nis specially true for galaxies with low inclination. Quantitatively, for kinematical inclinations greater than 25◦ , the\nmean error on morphological position angles is ∼13◦ while\nthe mean error on kinematical position angles is ∼2◦ . For\ninclinations lower than 25◦ the difference in the methods is\neven larger: the mean error on morphological position angles is ∼27◦ while the mean error on kinematical position\nangles is ∼3◦ . For comparison, Barnes & Sellwood (2003),\nusing the difference between morphological and kinematical\nparameters, estimated that nonaxisymmetric features intro-\n\n\fGHASP : An Hα kinematic survey of spiral and irregular galaxies - VI.\n\n7\n\nduce inclination and position angle uncertainties of 5◦ on\naverage.\nThe histogram of the variation between kinematical and\nmorphological position angles given in Figure 3 (bottom)\nindicates that (i) for more than 60% of these galaxies, the\nagreement is better than 10◦ ; (ii) for more than 83%, the\nagreement is better than 20◦ ; (iii) the disagreement is larger\nthan 30◦ for 15% of these galaxies.\nIn other words, the position of the slit in long slit spectroscopy (which is usually based on the major axis determined from broad-band imagery) with respect to the actual position angle may be not negligible, highlighting the\nstrength of the integral field spectroscopy methods to determine the position angles (see also illustrations in Paper IV,\nChemin et al. 2006 and Daigle et al. 2006a).\nIn Figure 4, the inclinations obtained by GHASP are\ncompared with the photometric inclinations. On the top\npanel the photometric inclination is the one computed using a correction factor depending on the morphological type\n(Hubble 1926):\nsin2 i =\n\n1 − 10−2 log r25\n1 − 10−2 log r0\n\nwhere r25 is the apparent flattening, and log r0 = 0.43 +\n0.053 t for the de Vaucouleurs type t ranging from -5 to 7,\nand log r0 = 0.38 for t higher than 7 (Paturel et al. 1997).\nOn the middle panel the photometric inclination i is\nderived from the axis ratio b/a without any correction\n(cos i = b/a). As for the position angles, red open circles\nare the galaxies for which the morphological position angle could not be determined accurately. Blue squares are\nthe galaxies for which the difference between morphological\nand kinematical position angle exceeds 20◦ .\nThe dispersion around the y = x line (equality between\nthe morphological and kinematical inclinations) decreases\nwith the inclination. The main discrepancy is found for\nlow inclinations. The corresponding galaxies are discussed\nin Appendix B (notes on individual galaxies). On the one\nhand, the morphological inclination of the galaxies having\nno robust determination of their morphological position angle cannot be constrained correctly. On the other hand,\ngalaxies for which the position angle disagreement is relatively high have a high dispersion and their morphological\ninclination is statistically overestimated.\nExcluding these galaxies which have a bad position\nangle estimation, for low inclination systems, kinematical\nmethods may underestimate the inclination or alternatively,\nmorphological estimations may be overestimated. In average, the errors on morphological inclinations (∼6◦ ) and on\nkinematical inclinations (∼8◦ ) are comparable. Whatever\nthe method used, the determination of the inclination of\ngalaxies having a low inclination remains less accurate than\nfor more inclined galaxies.\nThe comparison of the two plots in Figure 4 (top and\nmiddle) shows that galaxies with high inclination have a\nbetter agreement between their kinematical inclination and\ntheir morphological inclination computed considering a thin\ndisk. The actual thickness of the disk may not be reproduced by our simple thin disk velocity field modelling. If\nit is the case, the kinematical inclination may be systematically underestimated. Alternatively, the good agreement\nbetween thin disk morphological inclination and kinemati-\n\nFigure 3. Top: kinematical versus morphological (HyperLeda)\nposition angles of the major axis. Galaxies for which no accurate\nmorphological position angle has been computed are shown by red\nopen circles; galaxies having an inclination lower than 25◦ are displayed by blue squares; the other galaxies are represented by black\ncircles. Bottom: histogram of the variation between kinematical\nand morphological position angles. The red hash, blue hash and\nresidual white represent respectively the galaxies for which no accurate position angle has been measured, for which inclination is\nlower than 25◦ and the other galaxies of the sample.\n\ncal inclination may mean that the morphological thickness\ncorrections are overestimated.\nThe histogram of the difference between morphological\nand kinematical inclinations (Figure 4, bottom) shows that\na difference of inclination larger than 10◦ is found for 40%\nof the sample.\n\n4\n\nTHE TULLY-FISHER RELATION\n\nAmong the present sample of 108 galaxies, we have plotted the Tully-Fisher relation (Tully & Fisher 1977, MB as\na function of log 2Vmax ) for a sub-sample of 94 galaxies in\nFigure 5. The 14 other galaxies are not considered in the\npresent discussion because (i) for five galaxies the rotation\ncurve does not reach the maximum rotation velocity (UGC\n1655, UGC 4393, UGC 6523, UGC 8898 and UGC 9406);\n(ii) no B magnitude is available for one galaxy (UGC 3685)\n\n\f8\n\nB. Epinat et al.\nand (iii) no velocity measurement neither on the rotation\ncurve nor on the position-velocity diagram is possible for\neight other galaxies (see Table C3).\nThe maximum velocity Vmax has been obtained from\nthe fit to the velocity field. The error on Vmax is the\nquadratic combination of the error due to the uncertainty on\nthe inclination (the product Vmax ×sin i is constant) and the\nmedian dispersion in the rings of the rotation curve beyond\nD25 /10. In the cases where the rotation curve has no point\nbeyond that radius, we replace this term by the intrinsic\nuncertainty on the velocity determination due to the spectral resolution (8 km s−1 ). For the highly inclined galaxies\nfor which no correct fit was possible with our method (because it does not take into account the thickness of the disk,\nsee section 3.2), we computed Vmax from the Hα positionvelocity diagram corrected from the photometric inclination.\nFor them, the error on Vmax is simply the intrinsic uncertainty on the velocity determination. For the particular case\nof UGC 5786, the fit is not good enough to use it to compute\nVmax because of the long blue northern tail and because of\nthe strong bar. We estimated Vmax to 80 km s−1 by eye\ninspection of the rotation curve. These galaxies are flagged\nin Table C3.\nThe solid line in Figure 5 is the relation found by\nTully & Pierce (2000):\nMB = −7.3[log 2Vmax − 2.5] − 20.1\n\nFigure 4. Top: kinematical versus thick disk morphological inclinations. Middle: kinematical versus thin disk morphological\ninclinations. Top and Middle: Galaxies for which no accurate\nmorphological position angle has been computed are shown by red\nopen circles; galaxies with a difference between the kinematical\nand morphological position angles larger than 20◦ are displayed\nwith blue squares; the other galaxies are represented by black\ncircles. Bottom: histogram of the variation between kinematical and morphological inclinations. The red hash, blue hash and\nresidual white represent respectively the galaxies for which no\naccurate position angle has been measured, for which the differ-\n\nIn Figure 5 (Top), the error bars on the velocity are\ndisplayed and galaxies with inclination lower than 25◦ are\ndistinguished (blue open squares). We clearly notice that\nthese galaxies have statistically higher velocities than expected from the Tully & Pierce (2000) relation. This effect is\ndue to the link between inclination and velocity determination. Indeed, on the velocity fields, we observe the projected\nvelocity on the line of sight: Vrot × sin i. A given underestimate of the inclination thus leads to a higher overestimate\non maximum velocity for low inclination galaxies than for\nhigh inclination galaxies. This also explains the strong trend\nfor low inclination galaxies to exhibit large error bars. Considering this effect, we choose to exclude the 15 galaxies with\ninclinations lower than 25◦ from the Tully-Fisher analysis.\nAmong the 79 remaining galaxies, the maximum velocity Vmax is reached for 48 of them (black dots, large\nsize), probably reached for 17 of them (blue squares, medium\nsize) and probably not reached for 14 of them (red triangles,\nsmall size). They are distinguished in Figure 5 (Middle) and\nflagged in Table C3. The quality flag on the maximum velocity is deduced from (i) the inspection of the shape of\nthe Hα rotation curves and position-velocity diagrams; (ii)\nfrom the comparison with HI velocity fields and rotation\ncurves when available (see Table C3); (iii) from the comparison of the Hα velocity fields amplitudes with HI line widths\n(see individual comments in Appendix B). It appears from\nthis last point that the HI line width at 20% has most often the best agreement with the Hα velocity field amplitude\n(better than the line width at 50%). Figure 5 (Middle) confirms the two classifications \"Vmax probably reached\" and\n\"Vmax probably not reached\" since for the majority of each\nclass the points are respectively in agreement and above the\nTully & Pierce (2000) relation. From the two classes \"Vmax\nreached\" and \"Vmax probably reached\", we find the following relation:\n\n\fGHASP : An Hα kinematic survey of spiral and irregular galaxies - VI.\nMB = (−6.9 ± 1.6)[log 2Vmax − 2.5] − (19.8 ± 0.1)\n\n(1)\n\nThis relation is displayed as a dotted line in Figure 5, in\nwhich morphological types are distinguished for the two best\nclasses (black circles from 0 to 2, red triangles from 2 to\n4, blue squares from 4 to 6, green rhombuses from 6 to 8\nand pink stars from 8 to 10). Coefficients have been computed using the mean of the coefficients obtained (i) using\na fit on the absolute magnitudes (as dependant variables)\nand (ii) using a fit on the velocities (as dependant variables). The difference in the slope determination by these\ntwo methods is quite large due to a strong scatter in our data\n(the error on the parameter in equation 1 is half that difference). Indeed, usually one uses local calibrators for which\ndistance measurements are accurate (based on Cepheids, red\ngiants branch, members of a same cluster, ...) leading to a\nsmall scatter in the data. From our data, the main difficulty is that the distance determination is mostly based on\nthe systemic velocity corrected from Virgo infall (see Table C3), and that no error bar on the magnitude can be\neasily estimated. Thus we have no reason to be more confident on the velocity measurements (mainly affected by inclination determination) than on absolute magnitude measurements. However, despite the dispersion in our data, the\nresulting parameters using the mean of the two fits are\nin good agreement with Tully & Pierce (2000), even if our\nslope is a bit lower. A lower slope had already been observed in HI (Yasuda et al. 1997; Federspiel et al. 1998) and\nmore systematically in optical studies (e.g. Courteau 1997;\nRubin et al. 1999; Márquez et al. 2002; papers III and IV).\nFor the Tully-Fisher relation we derived, on the one\nhand we observe that fast rotators (Vmax > 300 km s−1 :\nUGC 89, UGC 4422, UGC 4820, UGC 5532, UGC 8900,\nUGC 8937 and UGC 11470) are less luminous than expected, except maybe for UGC 3334 which is one of the\nfastest disk rotators (Rubin et al. 1979) (see discussion in\nAppendix B). This trend can also be observed in several optical studies (Márquez et al. 2002; Papers III and IV). Interestingly, these fast rotators are not observed in HI samples\n(Tully & Pierce 2000; Federspiel et al. 1998). This may be\nexplained by the shape of the rotation curves of fast rotators: except for UGC 8900, the rotation curve always reaches\nthe maximum velocity within the first five arcseconds, (i.e.\nwithin our seeing). This inner maximum may be missed in\nHI because of beam smearing, averaging the maximum velocity reached in the center. Note that the rotation curve of\nUGC 5532 is clearly decreasing while the other ones are flat.\nOn the other hand slow rotators have a small velocity gradient and within the optical regions the maximum could not\nbe reached whereas HI observations would be able to measure it without any doubt. These two effects could explain\nthe trend observed in optical Tully-Fisher relations.\nThe result obtained for the Tully-Fisher relation is in\nagreement with the one obtained with the previous samples (Papers III and IV). The analysis of the whole GHASP\nsample will be done in a forthcoming paper (Epinat et al.\nin preparation).\n\n5\n\n9\n\nSUMMARY AND PERSPECTIVES\n\nThe knowledge of the links between the kinematical and\ndynamical state of galaxies will help us to have a better\n\nFigure 5. TF relation for our sample of galaxies. The solid line\nrepresents the B magnitude Tully-Fisher relation determined by\nTully & Pierce (2000) from nearby galaxies in clusters (Ursa Major, Pisces filament, Coma). Top: sorted by inclination - low inclination galaxies (i <25◦ ): blue squares; other galaxies (i≥25◦ ):\nblack circles. Middle: sorted by Vmax flags - Vmax reached:\nblack dots, large size; Vmax probably reached: blue squares,\nmedium size; Vmax probably not reached: red triangles, small\nsize. Bottom: sorted by morphological type - black circles from\n0 to 2; red triangles from 2 to 4; blue squares from 4 to 6; green\nrhombuses from 6 to 8; pink stars from 8 to 10; the dotted line\nrepresents the best linear fit on the data.\n\nunderstanding of the physics and evolution of galaxies. The\nGHASP sample, which consists of 203 spiral and irregular\ngalaxies covering in a wide range of morphological types\nand absolute magnitudes, has been constituted in order to\nprovide a kinematical reference sample of nearby galaxies.\nThe GHASP galaxies have been observed in the Hα line with\na scanning Fabry-Perot, providing data cubes.\nWe present in this paper the last set of 108 galaxies leading to 106 velocity fields and 93 rotation curves. By now, this\n\n\f10\n\nB. Epinat et al.\n\nwork consists of the largest sample of galaxies observed with\nFabry-Perot techniques ever presented in the same publication. Added to the four previous sets already obtained in\nthe frame of this survey (Paper I to IV), GHASP represents\nthe largest sample of 2D velocity fields of galaxies observed\nat Hα wavelength. For each galaxy, we have presented the\nHα velocity field, the Hα monochromatic image and eventually the Hα residual velocity field, the position-velocity\ndiagram along the major axis and the rotation curve when\navailable.\nMajor improvements in the reduction and in the analysis have been developed and implemented:\n• in order to optimize the spatial resolution for a given\nsignal-to-noise ratio, adaptative binning method, based on\nthe 2D-Voronoı̈ tessellations, was used to derive the 3D\nHα data cubes and to extract from it the line maps and\nthe radial velocity fields;\n• the ghosts due to reflections at the interfaces air/glass\nof the interferometer, have been removed in the data cubes;\n• the analysis of the faint outskirts or diffuse regions is\nautomatic;\n• the kinematical parameters and their error bars are directly derived from the velocity field;\n• the uncertainties are estimated from the analysis of the\nresidual velocity field power spectrum;\n• the whole 2D velocity field has been used rather than\nsuccessive crowns in tilted-ring models to compute the rotation curve and the error bars.\nThe main results of this paper are summarized by the\nfollowing items.\n• The absence of typical and well known bias in the residual velocity fields means that the best determination of the\nkinematical parameters has been achieved.\n• The mean velocity dispersion on each residual velocity field ranges from 6 to 23 km s−1 with a mean value\naround 13 km s−1 and is strongly correlated with the maximum amplitude of the velocity field. For a given velocity\namplitude, this correlation does not clearly depend on the\nmorphological type. Only strongly barred galaxies have a\nhigher residual velocity dispersion than mild-barred or non\nbarred galaxies. Peculiar galaxies also show a high residual\nvelocity dispersion.\n• The kinematical position angles obtained by GHASP\nare compared with the photometric position angles. Morphological position angles have systematically higher uncertainties than kinematical ones, this is specially true for galaxies\nwith low inclination. When using long slit spectroscopy, the\nposition angle should be known a priori. This is usually done\nusing morphological determinations based on broad band\nimagery. We have shown that in some cases the difference\nbetween the position angle determined using 2D kinematics\nand morphologies may be as large as 90◦ and that in any\ncase the position angles are better determined by 2D kinematics. Thus, large differences between morphological and\nkinematical position angles may lead to incorrect rotation\ncurve and maximum velocity determination when using long\nslit spectroscopy. This may strongly bias mass distribution\nmodels and Tully-Fisher studies, highlighting the strength\nof integral field spectroscopy with a Fabry-Perot.\n• The morphological inclination of the galaxies having\n\nno robust determination of their morphological position angle cannot be constrained correctly. Galaxies for which the\nposition angle disagreement is relatively high have a high\ndispersion and their morphological inclination is statistically\noverestimated. Galaxies with high inclination have a better\nagreement between their kinematical inclination and their\nmorphological inclination computed assuming a thin disk.\nFor galaxies with intermediate disk inclinations (higher than\n25◦ and lower than 75◦ ), to reduce the degrees of freedom\nin kinematical models, the inclination could be fixed to the\nmorphological value. This is specially true when only low\nquality kinematical data are available as it is the case for\nhigh redshift galaxies.\n• The Tully-Fisher relation found with this new set of\ndata is in good agreement with Tully & Pierce (2000), even\nif our slope is a bit lower. This trend for a lower slope has\nalready been observed in HI by Yasuda et al. (1997) and\nFederspiel et al. (1998). Galaxies with inclination lower than\n25◦ , have statistically higher velocities than expected from\nthe TF relation derived by Tully & Pierce (2000). Fast rotators (Vmax >300 km s−1 ) are less luminous than expected.\nThis may be explained by the shape of the rotation curves of\nfast rotators.\n\nACKNOWLEDGEMENTS\nThe authors warmly thank Dr O. Garrido for leading or participating to most of the observations. They also thank the\nProgramme National Galaxies for supporting the GHASP\nproject in allocating continuously observing time during several years, the Observatoire de Haute-Provence team for\nits technical assistance during the observations, O. Boissin\nfor his technical help during the observing runs, and J.\nBoulesteix for permanent support. They thank I. Jégouzo\nand C. Surace for building the Fabry-Perot Database. This\nresearch has made use of the GOLD Mine Database and\nof the NASA/IPAC Extragalactic Database (NED) which\nis operated by the Jet Propulsion Laboratory, California\nInstitute of Technology, under contract with the National\nAeronautics and Space Administration. The authors have\nalso made an extensive use of the HyperLeda Database\n(http://leda.univ-lyon1.fr). The Digitized Sky Surveys\nwere produced at the Space Telescope Science Institute under U.S. Government grant NAG W-2166. The images of\nthese surveys are based on photographic data obtained using the Oschin Schmidt Telescope on Palomar Mountain and\nthe UK Schmidt Telescope. The plates were processed into\nthe present compressed digital form with the permission of\nthese institutions.\n\nREFERENCES\nAmram P., Le Coarer E., Marcelin M., Balkowski C., Sullivan III W. T., Cayatte V., 1992, AAPS, 94, 175\nAmram P., Marcelin M., Balkowski C., Cayatte V., Sullivan\nIII W. T., Le Coarer E., 1994, AAPS, 103, 5\nArp H., 1966, Atlas of peculiar galaxies. Pasadena: California Inst. Technology, 1966\nBalick B., Heckman T., 1981, AAP, 96, 271\nBarnes E. I., Sellwood J. A., 2003, AJ, 125, 1164\n\n\fGHASP : An Hα kinematic survey of spiral and irregular galaxies - VI.\nBarnes E. I., Sellwood J. A., Kosowsky A., 2004, AJ, 128,\n2724\nBattaglia G., Fraternali F., Oosterloo T., Sancisi R., 2006,\nAAP, 447, 49\nBegeman K. G., 1987, PhD thesis, , Kapteyn Institute,\n(1987)\nBottema R., 1989, AAP, 221, 236\nBottinelli L., Gouguenheim L., Fouque P., Paturel G., 1990,\nAAPS, 82, 391\nBraine J., Combes F., Casoli F., Dupraz C., Gerin M.,\nKlein U., Wielebinski R., Brouillet N., 1993, AAPS, 97,\n887\nBraun R., Thilker D., Walterbos R. A. M., 2003, AAP, 406,\n829\nBravo-Alfaro H., Szomoru A., Cayatte V., Balkowski C.,\nSancisi R., 1997, AAPS, 126, 537\nBroeils A. H., van Woerden H., 1994, AAPS, 107, 129\nCarollo C. M., Stiavelli M., Mack J., 1998, AJ, 116, 68\nCarozzi N., 1976, AAP, 49, 431\nCatinella B., Giovanelli R., Haynes M. P., 2006, APJ, 640,\n751\nCatinella B., Haynes M. P., Giovanelli R., 2005, AJ, 130,\n1037\nChemin L., Balkowski C., Cayatte V., Carignan C., Amram\nP., Garrido O., Hernandez O., Marcelin M., Adami C.,\nBoselli A., Boulesteix J., 2006, MNRAS, 366, 812\nCote S., Carignan C., Sancisi R., 1991, AJ, 102, 904\nCourteau S., 1997, AJ, 114, 2402\nDaigle O., Carignan C., Amram P., Hernandez O., Chemin\nL., Balkowski C., Kennicutt R., 2006a, MNRAS, 367, 469\nDaigle O., Carignan C., Hernandez O., Chemin L., Amram\nP., 2006b, MNRAS, 368, 1016\nde Vaucouleurs G., 1979, APJ, 227, 380\nde Vaucouleurs G., Caulet A., 1982, APJS, 49, 515\nDoyle et al. M. T., 2005, MNRAS, 361, 34\nElfhag T., Booth R. S., Hoeglund B., Johansson L. E. B.,\nSandqvist A., 1996, AAPS, 115, 439\nEpinat B., Amram P., Balkowski C., 2007, in Combes F.,\nPalous J., eds, IAU Symposium Vol. 235 of IAU Symposium, What Can We Learn From Dynamics Of Nearby\nGalaxies To Study Distant Galaxies?. pp 401–401\nEskridge P. B., Frogel J. A., Pogge R. W., Quillen A. C.,\nBerlind A. A., Davies R. L., DePoy D. L., Gilbert K. M.,\nHoudashelt M. L., Kuchinski L. E., Ramı́rez S. V., Sellgren K., Stutz A., Terndrup D. M., Tiede G. P., 2002,\nAPJS, 143, 73\nFathi K., Beckman J. E., Lundgren A. A., Carignan C.,\nHernandez O., Amram P., Balard P., Boulesteix J., Gach\nJ.-L., Knapen J. H., Relaño M., 2007, ArXiv e-prints, 712\nFederspiel M., Tammann G. A., Sandage A., 1998, APJ,\n495, 115\nFerguson A. M. N., Wyse R. F. G., Gallagher III J. S.,\nHunter D. A., 1996, AJ, 111, 2265\nFridman A. M., Afanasiev V. L., Dodonov S. N., Khoruzhii\nO. V., Moiseev A. V., Sil'chenko O. K., Zasov A. V., 2005,\nAAP, 430, 67\nGach J.-L., Hernandez O., Boulesteix J., Amram P.,\nBoissin O., Carignan C., Garrido O., Marcelin M., Östlin\nG., Plana H., Rampazzo R., 2002, PASP, 114, 1043\nGarcı́a-Barreto J. A., Franco J., Carrillo R., Venegas S.,\nEscalante-Ramı́rez B., 1996, Revista Mexicana de Astronomia y Astrofisica, 32, 89\n\n11\n\nGarrido O., 2003, PhD thesis, Université de Provence\n(France)\nGarrido O., Marcelin M., Amram P., 2004, MNRAS, 349,\n225\nGarrido O., Marcelin M., Amram P., Balkowski C., Gach\nJ. L., Boulesteix J., 2005, MNRAS, 362, 127\nGarrido O., Marcelin M., Amram P., Boissin O., 2003,\nAAP, 399, 51\nGarrido O., Marcelin M., Amram P., Boulesteix J., 2002,\nAAP, 387, 821\nGavazzi G., Boselli A., Donati A., Franzetti P., Scodeggio\nM., 2003, ArXiv Astrophysics e-prints\nGavazzi G., Catinella B., Carrasco L., Boselli A., Contursi\nA., 1998, AJ, 115, 1745\nGeorgelin Y. P., 1970, AAP, 9, 441\nGiovanardi C., Salpeter E. E., 1985, APJS, 58, 623\nGiovanelli R., Haynes M. P., 1993, AJ, 105, 1271\nGooch R., 1996, in Jacoby G. H., Barnes J., eds, Astronomical Data Analysis Software and Systems V Vol. 101\nof Astronomical Society of the Pacific Conference Series,\nKarma: a Visualization Test-Bed. pp 80–+\nHameed S., Devereux N., 2005, AJ, 129, 2597\nHattori T., Yoshida M., Ohtani H., Sugai H., Ishigaki T.,\nSasaki M., Hayashi T., Ozaki S., Ishii M., Kawai A., 2004,\nAJ, 127, 736\nHaynes M. P., Giovanelli R., Salzer J. J., Wegner G.,\nFreudling W., da Costa L. N., Herter T., Vogt N. P., 1999,\nAJ, 117, 1668\nHaynes M. P., van Zee L., Hogg D. E., Roberts M. S.,\nMaddalena R. J., 1998, AJ, 115, 62\nHéraudeau P., Simien F., Maubon G., Prugniel P., 1999,\nAAPS, 136, 509\nHernandez O., Carignan C., Amram P., Chemin L., Daigle\nO., 2005b, MNRAS, 360, 1201\nHernandez O., Wozniak H., Carignan C., Amram P.,\nChemin L., Daigle O., 2005a, APJ, 632, 253\nHickson P., Kindl E., Auman J. R., 1989, APJS, 70, 687\nHoffman G. L., Salpeter E. E., Farhat B., Roos T., Williams\nH., Helou G., 1996, APJS, 105, 269\nHubble E. P., 1926, APJ, 64, 321\nHuchtmeier W. K., Witzel A., 1979, AAP, 74, 138\nHunter D. A., Elmegreen B. G., 2004, AJ, 128, 2170\nIrwin J. A., 1994, APJ, 429, 618\nJames P. A., Shane N. S., Beckman J. E., Cardwell A.,\nCollins C. A., Etherton J., de Jong R. S., Fathi K.,\nKnapen J. H., Peletier R. F., Percival S. M., Pollacco\nD. L., Seigar M. S., Stedman S., Steele I. A., 2004, AAP,\n414, 23\nJiménez-Vicente J., Battaner E., 2000, AAP, 358, 812\nKamphuis J. J., Sijbring D., van Albada T. S., 1996, AAPS,\n116, 15\nKarachentsev I., Petit M., 1990, AAPS, 86, 1\nKarachentsev I. D., 1972, Astrofizicheskie Issledovaniia\nIzvestiya Spetsial'noj Astrofizicheskoj Observatorii, 7, 3\nKarachentsev I. D., Karachentseva V. E., Huchtmeier\nW. K., Makarov D. I., 2004, AJ, 127, 2031\nKarachentsev I. D., Mineva V. A., 1984, Soviet Astronomy\nLetters, 10, 105\nKarachentsev I. D., Myneva V. A., 1984, Soviet Astronomy\nLetters, 10, 235\nKaufman M., Brinks E., Elmegreen B. G., Elmegreen\nD. M., Klarić M., Struck C., Thomasson M., Vogel S.,\n\n\f12\n\nB. Epinat et al.\n\n1999, AJ, 118, 1577\nKaufman M., Sheth K., Struck C., Elmegreen B. G.,\nThomasson M., Elmegreen D. M., Brinks E., 2002, AJ,\n123, 702\nKnapen J. H., Stedman S., Bramich D. M., Folkes S. L.,\nBradley T. R., 2004, AAP, 426, 1135\nKoopmann R. A., Haynes M. P., Catinella B., 2006, AJ,\n131, 716\nKoopmann R. A., Kenney J. D. P., Young J., 2001, APJS,\n135, 125\nKornreich D. A., Haynes M. P., Lovelace R. V. E., van Zee\nL., 2000, AJ, 120, 139\nKrajnović D., Cappellari M., de Zeeuw P. T., Copin Y.,\n2006, MNRAS, 366, 787\nKregel M., van der Kruit P. C., Freeman K. C., 2005, MNRAS, 358, 503\nKrumm N., Salpeter E. E., 1979, AJ, 84, 1138\nLang R. H., Boyce P. J., Kilborn V. A., Minchin R. F.,\nDisney M. J., Jordan C. A., Grossi M., Garcia D. A.,\nFreeman K. C., Phillipps S., Wright A. E., 2003, MNRAS,\n342, 738\nLewis R. S., Ming T., Wacker J. F., Steel E., 1987, in Lunar and Planetary Institute Conference Abstracts Vol. 18\nof Lunar and Planetary Institute Conference Abstracts,\nInterstellar Diamonds in Meteorites. pp 550–+\nMárquez I., Masegosa J., Moles M., Varela J., Bettoni D.,\nGalletta G., 2002, AAP, 393, 389\nMarquez I., Moles M., 1996, AAPS, 120, 1\nMartin C. L., 1998, APJ, 506, 222\nMeyssonnier N., 1984, AAPS, 58, 351\nMoustakas J., Kennicutt Jr. R. C., 2006, APJS, 164, 81\nNilson P., 1973, Nova Acta Regiae Soc. Sci. Upsaliensis\nSer. V, pp 0–+\nNoordermeer E., van der Hulst J. M., Sancisi R., Swaters\nR. A., van Albada T. S., 2005, AAP, 442, 137\nO'Connell R. W., Gallagher III J. S., Hunter D. A., 1994,\nAPJ, 433, 65\nPaturel G., Andernach H., Bottinelli L., di Nella H.,\nDurand N., Garnier R., Gouguenheim L., Lanoix P.,\nMarthinet M. C., Petit C., Rousseau J., Theureau G.,\nVauglin I., 1997, AAPS, 124, 109\nPaturel G., Fang Y., Petit C., Garnier R., Rousseau J.,\n2000, AAPS, 146, 19\nPaturel G., Garcia A. M., Fouque P., Buta R., 1991, AAP,\n243, 319\nPersic M., Salucci P., 1991, APJ, 368, 60\nPersic M., Salucci P., Stel F., 1996, MNRAS, 281, 27\nPignatelli E., Corsini E. M., Vega Beltrán J. C., Scarlata\nC., Pizzella A., Funes J. G., Zeilinger W. W., Beckman\nJ. E., Bertola F., 2001, MNRAS, 323, 188\nPisano D. J., Wilcots E. M., Liu C. T., 2002, APJS, 142,\n161\nPuech M., Hammer F., Flores H., Östlin G., Marquart T.,\n2006, AAP, 455, 119\nRampazzo R., Reduzzi L., Sulentic J. W., Madejsky R.,\n1995, AAPS, 110, 131\nRasmussen J., Ponman T. J., Mulchaey J. S., 2006, MNRAS, 370, 453\nRhee M.-H., van Albada T. S., 1996, AAPS, 115, 407\nRichter O.-G., Huchtmeier W. K., 1991, AAPS, 87, 425\nRossa J., Dettmar R.-J., 2003, AAP, 406, 505\nRownd B. K., Dickey J. M., Helou G., 1994, AJ, 108, 1638\n\nRubin V. C., Roberts M. S., Ford Jr. W. K., 1979, APJ,\n230, 35\nRubin V. C., Thonnard N., Ford Jr. W. K., 1980, APJ,\n238, 471\nRubin V. C., Thonnard N. T., Ford Jr. W. K., 1982, AJ,\n87, 477\nRubin V. C., Waterman A. H., Kenney J. D. P., 1999, AJ,\n118, 236\nSandage A., Bedke J., 1994, The Carnegie atlas of galaxies. Washington, DC: Carnegie Institution of Washington\nwith The Flintridge Foundation, -c1994\nSauty S., Casoli F., Boselli A., Gerin M., Lequeux J.,\nBraine J., Gavazzi G., Dickey J., Kazès I., Fouqué P.,\n2003, AAP, 411, 381\nSchneider S. E., Thuan T. X., Magri C., Wadiak J. E.,\n1990, APJS, 72, 245\nSchommer R. A., Bothun G. D., Williams T. B., Mould\nJ. R., 1993, AJ, 105, 97\nSchulman E., Bregman J. N., Brinks E., Roberts M. S.,\n1996, AJ, 112, 960\nSchwartz C. M., Martin C. L., Chandar R., Leitherer C.,\nHeckman T. M., Oey M. S., 2006, APJ, 646, 858\nSengupta C., Balasubramanyam R., 2006, MNRAS, 369,\n360\nShapley A., Fabbiano G., Eskridge P. B., 2001, APJS, 137,\n139\nShostak G. S., van der Kruit P. C., Hummel E., Shaver\nP. A., van der Hulst J. M., 1982, AAP, 115, 293\nSofue Y., Tomita A., Tutui Y., Honma M., Takeda Y., 1998,\nPASJ, 50, 427\nSpano M., Marcelin M., Amram P., Carignan C., Epinat\nB., Hernandez O., 2007, MNRAS, pp 1084–+\nSpringob C. M., Haynes M. P., Giovanelli R., Kent B. R.,\n2005, APJS, 160, 149\nStil J. M., Israel F. P., 2002, AAP, 392, 473\nStrickland D. K., Heckman T. M., Colbert E. J. M., Hoopes\nC. G., Weaver K. A., 2004, APJS, 151, 193\nSwaters R. A., van Albada T. S., van der Hulst J. M.,\nSancisi R., 2002, AAP, 390, 829\nTakase B., Miyauchi-Isobe N., 1991, Publications of the\nNational Astronomical Observatory of Japan, 2, 7\nTheureau G., Bottinelli L., Coudreau-Durand N.,\nGouguenheim L., Hallet N., Loulergue M., Paturel G.,\nTeerikorpi P., 1998, AAPS, 130, 333\nTift W. G., Cocke W. J., 1988, APJS, 67, 1\nTomita A., Ohta K., Saito M., 1994, PASJ, 46, 335\nTully R. B., Fisher J. R., 1977, AAP, 54, 661\nTully R. B., Pierce M. J., 2000, APJ, 533, 744\nUsui T., Saitō M., Tomita A., 2001, AJ, 121, 2483\nvan der Hulst J. M., Huchtmeier W. K., 1979, AAP, 78, 82\nvan der Kruit P. C., Allen R. J., 1978, ARAA, 16, 103\nvan Driel W., Marcum P., Gallagher III J. S., Wilcots E.,\nGuidoux C., Monnier Ragaigne D., 2001, AAP, 378, 370\nvan Moorsel G. A., 1983, AAPS, 54, 19\nvan Zee L., 2000, AJ, 119, 2757\nVauglin I., Paturel G., Borsenberger J., Fouqué P.,\nEpchtein N., Kimeswenger S., Tiphène D., Lanoix P.,\nCourtois H., 1999, AAPS, 135, 133\nVetterling W. T., Flannery B. P., Press W. H., Teukolski\nS. A., 1989, Numerical Recipes in FORTRAN - The Art of\nScientific Computing - Second Edition. University Press,\nCambridge\n\n\fGHASP : An Hα kinematic survey of spiral and irregular galaxies - VI.\nVogt N. P., Haynes M. P., Herter T., Giovanelli R., 2004,\nAJ, 127, 3273\nVorontsov-Velyaminov B. A., Krasnogorskaya A. A., 1994,\nVizieR Online Data Catalog, 7062, 0\nWalter F., Weiss A., Martin C., Scoville N., 2002, AJ, 123,\n225\nWang Z., Scoville N. Z., Sanders D. B., 1991, APJ, 368,\n112\nWarmels R. H., 1988, AAPS, 73, 453\nWarner P. J., Wright M. C. H., Baldwin J. E., 1973, MNRAS, 163, 163\nWehner E. H., Gallagher III J. S., 2005, APJL, 618, L21\nWilcots E. M., Prescott M. K. M., 2004, AJ, 127, 1900\nWilcots E. M., Turnbull M. C., Brinks E., 2001, APJ, 560,\n110\nYasuda N., Fukugita M., Okamura S., 1997, APJS, 108,\n417\n\n13\n\n\f14\n\nB. Epinat et al.\n\nAPPENDIX A: BUILDING A ROTATION\nCURVE\nA1\n\nThe Model.\n\nFor each of the N independent bins covering the field of view\nof the galaxy, the vector velocity in the frame of the galactic\nplane is described by two components lying in the plane of\nthe galaxy:\n(i) Vrot (R): the rotation velocity;\n(ii) Vexp (R): the expansion velocity;\nplus one component perpendicular to this plane:\n(iii) Vz (R): the vertical motions velocity.\nThe observed radial velocities Vobs (R) is linked to\nVrot (R), Vexp (R) and Vz (R) through 5 additional parameters:\n(iv) P A: the position angle of the major axis of the galaxy\n(measured counterclockwise from the North to the direction\nof receding side of the galaxy);\n(v) i: the inclination of the galactic disk with respect to\nthe sky plane;\n(vi) Vsys : the systemic velocity of the galaxy\n(vii) α: the right ascension of the rotation center;\n(viii) δ: the declination of the rotation center;\nthrough the following equation:\nVobs\n\n=\n\nVsys + Vrot (R) cos θ sin i\n+Vexp (R) sin θ sin i\n\n(A1)\n\n+Vz (R) cos i\nR and θ being the polar coordinates in the plane of the\ngalaxy. The angle in the plane of the galaxy, θ, is linked to\nthe position angle P A, the inclination i, the position x, y\nand center xc , yc in the sky by the set of equations A2 to\nA7:\ncos θ = R cos ψ\nsin ψ\nsin θ = R\ncos i\n(y − yc ) cos P A − (x − xc ) sin P A\ncos ψ =\nr\n(x − xc ) cos P A + (y − yc ) sin P A\nsin ψ = −\nr\nr=\n\np\n\n(x − xc )2 + (y − yc )2\n\nR=r\n\nr\n\ncos2 ψ +\n\nsin2 ψ\ncos2 i\n\n(A2)\n(A3)\n(A4)\n(A5)\n(A6)\n(A7)\n\nψ being the counterclockwise angle in the plane of the sky\nfrom the North.\nFormally, one has to solve a system of N equations (as\nmany equations as the number N of pixels taken into account) with 8N unknowns.\nIf one makes the assumption that, at the first order,\nfor spiral galaxies, the expansion and vertical motions are\nnegligible with respect to the rotation velocity, the equation\nA1 becomes:\nVobs (R) = Vsys (R) + Vrot (R) cos θ sin i\nThis leads to solve a system of N equations with 6N\nunknowns.\n\nA usual solution to solve this degenerate system is to fix\nVsys to a unique value for a given galaxy, and to consider that\ni, P A, xc and yc only depend on the galactic radius (to take\nwarps into account), as it is the case for Vrot (R). The field is\ndecomposed in a certain number of elliptical rings (at given\nradii, with a given width) for which a set of parameters is\ncomputed for the corresponding radii (Begeman, 1987). The\nnumber of rings being at least one order of magnitude less\nthan N , the system of equation is no more degenerate. The\nphysical width of the rings is typically ranging from 3 to 6\npixels (∼ 2′′ to 4′′ ).\nWe decided to use a new method. To solve this degenerate system of equations, the number of unknowns is reduced\nby introducing physical constraints: Vsys , i, P A, xc and yc\nare fixed to a unique value for a given galaxy as warps are\nhardly observed within optical radius.\nMoreover, the rotation velocity is approximated by a\nfunction with only four parameters:\nVrot (R) = Vt\n\nA2\n\n(R/rt )g\n1 + (R/rt )a\n\n(A8)\n\nMethod.\n\nThe method implemented is a χ2 minimization method on\nthe velocity field, using the IDL routine lmfit. This routine,\nbased on the Levenberg-Marquardt method (as described\nin section 15.5 of Vetterling et al. 1989) quickly converges\ntowards the best model.\nThe starting set of parameters is chosen as follows: the\nrotation center (xc , yc ) is supposed to be the nucleus identified on our continuum image (when no nucleus can be seen,\nneither on our images nor in other bands, it is chosen as the\ncenter of symmetry of our velocity field), i is derived from\nthe axis ratio found in the literature, the position angle is\ncomputed from the photometry (or eye-defined by the outer\nparts of our velocity field when not available), the systemic\nvelocity is taken from the literature.\nIn order to have a pretty good estimate of the analytical\nfunction parameters (A8), we fit them on this preliminary\nrotation curve.\nWe then let free all the parameters. We compute an\niterative 3.5-sigma clipping on the velocity field to reject\npoints that have not been cleaned.\nFor well behaved galaxies, the iterative process was\nquite easy and rapidly converged. However, for some irregular galaxies with asymmetric rotation curves it was hard to\nconverge and we had a strong uncertainty on the kinematical parameters, more especially the inclination which is the\nless constrained. In some specific case, marked in table C2\nwith an asterisk (∗ ), we then fixed i and/or PA during the\nfit process.\nThe rotation curves are computed from the velocity\nfields, using the previously found projection parameters\ni, P A, xc and yc . A sector of 22.5◦ in the plane of the\ngalaxy around the minor axis is excluded, and the points\nare weighted according to their corresponding | cos θ|. The\nrotation curves are sampled with rings.\nIn the inner parts, the width of the rings is set to match\nhalf the seeing, in order to respect Shannon sampling criteria. The transition radius rt is defined by the first ring that\ncontains more than 25 uncorrelated bins. If rt is not reached\n\n\fGHASP : An Hα kinematic survey of spiral and irregular galaxies - VI.\nbefore D25 /10, rt is set to D25 /10. In the outer parts, the\nrotation curve is computed in successive rings containing\nthe same number of uncorrelated bins, except eventually for\nthe last ring of each side. The number of bins in the rings\nof the outer parts is set to the number between 16 and 25\nthat maximises the number of uncorrelated bins of the last\nrings of each side. This range (16 to 25) is found to be the\nbest compromise between the signal-to-noise ratio and the\nspatial coverage in each ring. Thus the width in each ring is\nvariable. The velocity computed for each ring is then always\nthe average of the same number of velocity points.\nOn the plots of rotation curve, for each individual ring,\nthe vertical error bars are given by the dispersion of the\nrotation velocities inside the ring, normalized to the number\nof uncorrelated points inside the ring; the horizontal error\nbars represent the ±1σ radius dispersion weighted by cos(θ).\nA3\n\nError estimation of the parameters.\n\nThis method provides a determination of parameters errors,\nby associating a random noise to the data for which the\namplitude can be fixed. However, this error seems unrealistically small. Indeed, the residual velocity field (difference\nbetween model and real velocity field) does not appear to\nbe uniformly randomized. It contains the effects of non axisymmetric motions such as expansion, spiral arms, bars or\ngas bubble expansion (local expansions),..., that is to say\nreal physical effects that cannot be described by our simple\nmodel. To be more realistic in parameters errors determination, we simulate residual velocity fields from the real residual velocity field. We compute its power spectrum and put\na random phase. As a result, the new residual field contains\nthe same kind of structure, but placed differently. Then we\nuse a Monte Carlo method to estimate the errors: we compute the standard deviation in the parameters found over\n250 simulated velocity fields. The advantage of this method\nis that it is completely automatic, and that it enables to use\nthe whole information to compute global parameters and\ntheir errors. We also add 0.5 degrees to the position angle\nuncertainty because of the uncertainty on the astrometry.\nThe typical accuracy we reach is about 1 arcsec for the\nposition of the rotation center, 2 to 3 km s−1 for the systemic\nvelocity, 2 degrees for the position angle of the major axis,\nbut only 5 to 10 degrees for the inclination.\n\n15\n\n\f16\n\nB. Epinat et al.\n\nAPPENDIX B: NOTES ON INDIVIDUAL\nGALAXIES\nUGC 12893. The Hα emission is very weak, as confirmed by James et al. (2004) who find a total surface\nbrightness of 0.4 10−16 W.m−2 . The quality of our rotation curve is thus rather poor, anyway a maximum\nrotation velocity (∼72 km s−1 ) seems to be reached\nwithin the optical limit, adopting the inclination of\n19◦ deduced from our velocity field (HyperLeda gives\n30◦ from the photometry). The width of the HI profile\nat 20% (75 km s−1 from Giovanelli & Haynes 1993 and\n∼90 km s−1 from Schneider et al. 1990) is in agreement\nwith the amplitude of our Hα velocity field and suggests\nthat we actually reach the maximum rotation velocity with\nour Hα rotation curve.\nUGC 89 (NGC 23). Because of the presence of a strong\nbar in this galaxy, the kinematics method used to determine the inclination is biased. Nevertheless our kinematical inclination (33±13◦ ) is compatible with the photometric inclination (40±4◦ ) and with the value of 45◦ from\nFridman et al. (2005) (Hα Fabry Perot observations) as well\nas with the value of 50◦ from Noordermeer et al. (2005)\n(HI data from WHISP). Our Hα rotation curve reaches a\nplateau at ∼350 km s−1 , compatible with its morphological type (SBa) and with the position-velocity diagram from\nNoordermeer et al. (2005). The steep rise of the Hα rotation curve is also in agreement with the HI observation of\nNoordermeer et al. (2005) and in very good agreement with\nthe Hα velocity field of Fridman et al. (2005). Our Hα velocity field does not show any obvious evidence for interaction\nwith its companion, UGC 94.\nUGC 94 (NGC 26). The steep rise of the Hα rotation curve is in agreement with the HI observation\n(Noordermeer et al. 2005). The Hα rotation curve reaches\na plateau at ∼210 km s−1 , compatible with its morphological type (Sab). No Hα emission can be seen as a counter part\nof the HI extension to the South-East (Noordermeer et al.\n2005). There is no obvious evidence for interaction with its\ncompanion, UGC 89, on our Hα velocity field.\nUGC 1013 (NGC 536) & NGC 542. An optical rotation curve has been obtained by Vogt et al. (2004) for UGC\n1013. Because of bad weather, we could not get a sufficient\nSNR when observing that galaxy with GHASP. On the other\nhand, we have detected, in the same field of view, Hα emission from its companion NGC 542 (systemic velocity around\n4660 km s−1 from HyperLeda) with enough signal to get a\nreliable velocity field.\nUGC 1317 (NGC 697). It is the brightest galaxy of\nthe group NGC 677-697. HI data have been obtained\nby Giovanardi & Salpeter (1985), by Rhee & van Albada\n(1996) and by WHISP (website). A good agreement with\nHI observations within the first 2′ is observed. Outside 2′ ,\nthe HI rotation velocities of the receding side increase but\nwe have no Hα emission there to check that. There is no\nobvious evidence for interaction with its companion, NGC\n677, on our Hα velocity field.\nUGC 1437 (NGC 753). Relatively close to the center of the A262 cluster, it is not HI deficient however. It\nhas been already observed in the optical by Rubin et al.\n(1980), Amram et al. (1994) (Fabry-Perot data), Courteau\n(1997) and by Vogt et al. (2004) who found roughly the\n\nsame kinematical parameters and rotation curves. From\ntheir HI rotation curve, Bravo-Alfaro et al. (1997) confirm\nthe flatness of the Hα rotation curve even beyond the optical radius (D25 /2). Although less extended, our Hα velocity field is in good agreement with the HI observations by\nBroeils & van Woerden (1994) and by WHISP (website).\nUGC 1655 (NGC 828). Hα emission is detected only in\nits very center, so that only the rising part of the Hα rotation curve can be plotted. The Hα image by Hattori et al.\n(2004) shows two bright patches on each side of the nucleus. Because of the limited extension of the rotation curve,\nwe could not determine the inclination from the kinematics and adopted the value found in HyperLeda. Anyway,\na plateau seems to be reached at ∼20′′ from the center\nwith a velocity ∼205 km s−1 . The rotation curve derived\nby Márquez et al. (2002) is in agreement with ours and extends a bit further but with a strong dispersion beyond 20\".\nWang et al. (1991) provide a CO rotation curve limited to\na 10\" radius, also in agreement with our Hα rotation curve.\nNo HI map is available in the literature but the width of the\nHI profile at 20% (427 km s−1 from Bottinelli et al. 1990;\n556 km s−1 from Springob et al. 2005) is about twice our\nHα velocity field amplitude, showing that our Hα rotation\ncurve is far from reaching the maximum of the rotation velocity.\nUGC 1810 & UGC 1813. Faint Hα detection in UGC\n1810 despite two hours of integration in good conditions\nwhile a strong Hα emitting blob is found in the central region of UGC 1813. Interestingly, two compact Hα emitters\nare detected away from the two galaxies on the eastern and\nwestern edges of our field of view (02h21m38s, 39◦ 21′ 35′′ and\n02h21m20s, 39◦ 21′ 35′′ respectively). These two objects are\nrelated with the two galaxies for which we estimate a systemic velocity around 7550±100 km s−1 , in agreement with\nWHISP (website) whereas HyperLeda gives a systemic velocity of 7356 km s−1 ± 57. They may be intergalactic HII\nregions. A faint velocity gradient (∼30 km s−1 ) is observed\nin the velocity field of the western object, suggesting that\nit may by a tidal dwarf galaxy candidate with a systemic\nvelocity around 7680 km s−1 (modulo 378 km s−1 which is\nthe free spectral range). At the opposite, no velocity gradient is seen in the eastern object having a systemic velocity\nof 7400 km s−1 (modulo 378 km s−1 ).\nUGC 3056 (NGC 1569, Arp 210). Magellanic irregular starburst galaxy (Seyfert I type). We detect a strong\nHα emission in the center, causing ghosts in the southern\noutskirts of the galaxy on our data. This prevented us from\ncomputing an accurate velocity field in that region, even\nthough there is some real emission there, as confirmed by\nHunter & Elmegreen (2004) line map. Also, we miss some\nextended filaments, being too faint or out of our field of\nview. Our Hα velocity field is almost uniform and does\nnot show any evidence for rotation. Thus we could not fit\nany rotation model to this velocity field and do not show\nany rotation curve here. However, the velocity field and the\nposition-velocity diagram shows markedly higher velocities\nin the center and lower velocities on the northwestern side,\na feature not clearly seen in previous studies of the ionized\ngas with long slit spectroscopy (Tomita et al. 1994, Martin\n1998) mostly focused on the filamentary structures. Our\nposition-velocity diagram is compatible with the HI rota-\n\n\fGHASP : An Hα kinematic survey of spiral and irregular galaxies - VI.\ntion curve of Stil & Israel (2002) that does not show any\nclearly rising part until 50′′ radius.\nUGC 3334 (NGC 1961, Arp 184). NGC 1961 is a very\nbright and massive distorted LINER 2 SAB(rs)b galaxy\nshowing highly irregular outer spiral arms and a pathological disk (Arp 1966). It does not show any nearby companion\nand no clear double nucleus indicates a merger in progress.\nNevertheless, NGC 1961 is the central member of the small\ngroup of nine galaxies located in the same velocity interval\nwith a projected separation of 1 Mpc. Two long straight\narms tangent to north-following side of galaxy point toward\nan extended HI counterpart (Shostak et al. 1982). The\namplitude of the WHISP velocity field (website) as well as\nthe width of the HI profile at 20% (∼700 km s−1 from the\nWHISP website and 690 km s−1 from Bottinelli et al. 1990)\nare fully compatible with the Hα velocity field amplitude.\nThe overall resemblance between Hα velocity field and\nHI velocity field is pretty good within the optical disk\ntaking into account the low spatial resolution in the HI\ndata. However, Hα kinematics present perturbations all\nover the disk leading to an asymmetric and wavy rotation\ncurve. The southern spiral arm and the knotty regions in\nthe northern arm present unexpected velocities leading\nto a model of rotation curve with strong residuals for\nwhich it was necessary to constrain the inclination. Our\nrotation curve is in reasonable agreement with the rotation\ncurve along the major axis from Rubin et al. (1979) but our\nrotation curve is almost twice extended on the receding side.\nRubin et al. (1979) claimed that NGC 1961, with its total\nmass greater than 1012 M⊙ , was the most massive spiral\nknown. Due to the uncertainties on the inclination and to\nwaves in the rotation curve, the maximum rotation velocity\n(377±85 km s−1 ) could even be higher. From their optically\nderived spectra, they concluded to unexplained motions\nwithin the system. The Hα lines continuously display a\ndouble profile (not resolved by Rubin et al. 1979) from the\ncentre to the outermost points of the approaching side (as it\ncan be seen on the Hα position-velocity diagram, the most\nexternal velocities reach respectively ∼3500 km s−1 and\n3720 km s−1 ). The maximum velocity has been chosen as\nthe mean external velocity. These double profiles in the\ndisk are an additional evidence for the complex history\nof this galaxy (merging, interaction, stripping) which still\nneeds to be modeled taking into account its disturbed and\nasymmetric HI distribution and X-ray emission.\nUGC 3382. This early type SBa galaxy presents a lack of\nHα emission in the center, we thus miss the inner part of the\nvelocity field within the first 3 kpc. Due to faint Hα SNR\nin the rest of the disk, our rotation curve is based on a\nlimited number of velocity bins. Despite of this, both sides\nof the rotation curve agree fairly well. We excluded from\nthe analysis the outermost part of the approaching side\nbecause it has no counterpart on the receding side. An inner\nvelocity gradient is well seen in the HI position-velocity\ndiagram (Noordermeer et al. 2005), not in the Hαone.\nTheir diagram shows that the rotation curve rises steeply\nin the center and suggests that the maximum velocity is\nrapidly reached, at about 1'. The amplitude of the HI\nvelocities is in good agreement with that of our Hα velocity\nfield, suggesting that we actually reach the maximum\nrotation velocity within the optical radius, at the end of our\nHα rotation curve. The morphological and Hα kinematical\n\n17\n\ninclinations are the same (21◦ ) while 16◦ is found from HI\ndata.\nUGC 3463 (KIG 168). Our Hα map is in agreement\nwith James et al. (2004) but suffers from bad seeing\nconditions leading to the confusion of several HII regions.\nOur rotation curve shows a bump at ∼10′′ likely due to a\nbar. No HI rotation curve is available. The width of the\nHI profile at 20% (341 km s−1 from Springob et al. 2005\nand 334 km s−1 from Bottinelli et al. 1990) is in agreement\nwith the amplitude of our Hα velocity field, confirming that\nthe maximum velocity is reached before the optical radius\nD25 /2.\nUGC 3521. The Hα rotation curve is poorly defined\nin the center because of the faint Hα emission. It rises\nslowly up to ∼165 km s−1 and extends up to about two\nthird of the optical radius (D25 /2) without being certain\nto reach the maximum rotation velocity. No HI rotation\ncurve is available but the width of the HI profile at\n20% (381 km s−1 from Springob et al. 2005) is higher (by\n∼50 km s−1 ) than that of our Hα velocity field, suggesting\nthat the plateau is almost reached but not yet.\nUGC 3528. The Hα emission is faint. It is sufficient\nhowever to derive a rotation curve apparently reaching a\nmaximum although it barely reaches half the optical radius.\nThe width of the HI profile at 20% (344 km s−1 from\nSpringob et al. 2005) is in good agreement with the amplitude of our Hα velocity field, confirming that we do reach\nthe maximum rotation velocity (D25 /2).\nUGC 3618 (NGC2308). No Hα emission is detected thus\nno image is displayed.\nUGC 3685. Flocculent SBb galaxy whose bar terminates\nat a well-defined circular ring. The bar is aligned with the\nkinematic major axis and there is no clear signature of\nit on the Hα velocity field although a bump can be seen\non the Hα rotation curve at about 1 kpc. Hα emission is\nmainly seen in a wide ring and in short spiral arms. No\nHα emission can be seen in the center except along the bar,\nin agreement with James et al. (2004) Hα image, but we\nmiss some faint emitting region to the southeast. As seen\nin the position-velocity diagram, a large velocity dispersion\nis observed in the nucleus of the galaxy. The photometric\ninclination is 55◦ from HyperLeda, 32◦ from NED and\n33◦ from James et al. (2004). We agree with James et al.\n(2004) measurement, but we may estimate the uncertainty\nat ∼10◦ . Furthermore, if we take into account the very\nfaint outer arms, the disk is rounder. On the other hand,\nthe HI disk, which is about five times more extended than\nthe optical one, is rather circular. It is possible that the\ninclination should vary with the radius, this should be\ndone on the HI data (not yet published). Moreover, the\nHα ring is also almost circular. This probably means that\nthe inclination of the galaxy may still be lower. We fit a\nkinematical inclination of 12±16◦ . Within the error bars,\nthe kinematical inclination is compatible with the morphological one (∼33±10◦ ). The rotation curve rises rapidly\nwithin the first 2 kpc as expected for early type galaxies\ndespite the fact that the bar, aligned with the kinematical\nmajor axis should lower the inner gradient (Hernandez et\nal., in preparation). If we exclude this inner structure, the\nrotation curve seems to grow with a solid body behaviour.\nThe outermost Hα regions disconnected from the main\nbody of the disk extend beyond the optical radius D25 /2.\n\n\f18\n\nB. Epinat et al.\n\nThe amplitude of the WHISP velocity field (website) as well\nas the width of the HI profile at 20% (∼100 km s−1 from\nthe WHISP website, 118 km s−1 from Springob et al. 2005\nand 103 km s−1 from Bottinelli et al. 1990) are almost twice\nthe Hα velocity field amplitude. Moreover, regarding the HI\nvelocity gradient, slowly growing up to the HI outskirts, our\nHα rotation curve probably does not reach the maximum\nvelocity.\nUGC 3708 (NGC 2341). It forms a pair with UGC\n3709. Its Hα distribution is asymmetric, brighter on the\neastern side. Our Hα velocity field suggests an inclination\nof 44◦ ± 16◦ , higher than the photometric inclination\n(16◦ ± 24◦ ) but compatible with the error bars. No HI\nvelocity field is available. The width of the HI profile at\n20% (324 km s−1 , Bottinelli et al. 1990) is in agreement\nwith our Hα velocity field amplitude, confirming that we\nreach the maximum rotation velocity.\nUGC 3709 (NGC 2342). It forms a pair with UGC\n3708. The Hα rotation curve reaches a plateau with a\nlower maximum rotation velocity than the one given by\nKarachentsev & Myneva (1984), around 250 km s−1 instead\nof 292 km s−1 . No HI velocity field is available. The width\nof the HI profile at 20% (396 km s−1 , Bottinelli et al.\n1990) is in agreement with our Hα velocity field amplitude,\nconfirming that the maximum velocity is reached.\nUGC 3826 (KIG 188). It has a faint Hα emission, in\nagreement with the map presented by James et al. (2004).\nThe rising part of the Hα rotation curve is ill defined, but\na plateau seems to be reached within the optical radius.\nThe HI velocity field (WHISP, website) shows a velocity\namplitude in agreement with our Hα velocity field and gives\nthe same overall orientation for the major axis position\nangle. However, the pattern of the HI isovelocity lines in the\ncentral part points at a quite different orientation compared\nwith that suggested by our Hα velocity field. The width\nof the HI profile at 20% given by Springob et al. (2005)\n(101 km s−1 ) is significantly larger than the amplitude of\nour velocity field (almost double) and seems abnormally\nlarge when compared with the HI profile obtained by\nWHISP (website).\nUGC 3740 (NGC 2276, Arp 25). Its spiral pattern\nis unusual, perhaps because of a tidal encounter with\nthe probable companion NGC 2300 (Karachentsev 1972)\nor more likely, due to tidal stripping. Indeed, it is a\nmember of a group where stripping has been evidenced\n(Rasmussen et al. 2006). The western side of our Hα image\nand the velocity field show compression due to stripping\nby the intragroup medium. Our Hα data also reveal low\nsurface brightness filaments extending towards the east,\nin agreement with James et al. (2004). Our Hα rotation\ncurve is very peculiar and asymmetric. A steep velocity rise\nis observed in the galaxy core. The width of the HI profile\nat 20% (167 km s−1 from Springob et al. 2005) is slightly\nlarger than our Hα velocity field amplitude. Nevertheless,\nthe shape of our Hα rotation curve suggests that the maximum is reached just after the optical radius (D25 /2). The\nCO emission (Elfhag et al. 1996) is distributed in a lopsided\nfashion, with more emission towards the northwestern\nregion.\nUGC 3876 (KIG 193). Diffuse Hα emission can be\nseen all over the disc, in agreement with James et al.\n(2004). The Hα rotation curve rises slowly beyond the\n\noptical radius (D25 /2) so that we are not sure to reach the\nmaximum rotation velocity. No HI velocity field is available.\nHowever, the width of the HI profile at 20% (208 km s−1 ,\nBottinelli et al. 1990) is in good agreement with our\nHα velocity field amplitude, suggesting that the maximum\nrotation velocity is effectively reached with our Hα rotation\ncurve.\nUGC 3915. Strong Hα emission can be seen all over the\ndisc. Our Hα rotation curve rises steeply and reaches a\nplateau around 200 km s−1 at about 0.5 D25 /2. No strong\nsignature of the bar (aligned with the major axis) can\nbe seen on our velocity field. A small bump, seen on our\nrotation curve in the 5 inner arcsec could be due to the bar.\nNo HI velocity field is available in the literature. The width\nof the HI profile at 20% (323 km s−1 , Bottinelli et al. 1990)\nis in agreement with our Hα velocity field amplitude.\nIC 476. We detected some Hα emission in IC 476, the\nsmall companion of UGC 402 (both observed in the same\nfield-of-view). We derive its rotation curve up to about 0.5\nD25 /2, thus it is not sure that the maximum rotation velocity is reached. No HI data are available in the literature.\nUGC 4026 (NGC 2449). We detected faint Hα emission\nin the low surface brightness galaxy UGC 4026. However,\nits Hα emission is sufficient to derive with confidence a\nrotation curve up to about 0.5 D25 /2. As it seems that we\nobserve the plateau of the rotation curve, the maximum\nvelocity may be reached. A kinematical inclination of\n56±4◦ has been computed, lower than the morphological\none of 73±4◦ . The kinematical inclination is very uncertain\ndue to the very low SNR of our Hα data. No HI data are\navailable in the literature.\nUGC 4165 (NGC 2500, KIG 224). This galaxy belongs\nto a quartet of galaxies (Sandage & Bedke 1994). Diffuse\nHα emission is observed in our Hα map, in agreement\nwith James et al. (2004). Its short bar is almost aligned\nwith its minor kinematical axis. Within the error bar,\na good agreement is observed between the kinematical\nand morphological inclination. Our Hα velocity field is\nin very good agreement with the WHISP data (website).\nThe width of the HI profile at 20% (101 km s−1 from\nSpringob et al. 2005, 114 km s−1 from Bottinelli et al. 1990\nand 100.9 km s−1 from Haynes et al. 1998) is in agreement\nwith our Hα velocity field amplitude.\nUGC 4256 (NGC 2532, KIG 232). It presents patchy\nHα emission along its spiral arms. The general pattern of\nthe Hα velocity field is in good agreement with the HI\nvelocity field (WHISP, website). The position angle of the\nkinematical major axis of the Hα velocity field (116◦ ) is in\nagreement with the HI one, but is very different from the\nvalue given in HyperLeda (26◦ ) and in the RC3 (10◦ ) as\nalready noticed by Marquez & Moles (1996). Indeed it is\nclear that the outermost contours of the galaxy measured\nfrom broadband imaging are elongated along the minor\nkinematical axis. Furthermore, morphological and kinematical inclinations are determined using position angles\nseparated by 90◦ . Nevertheless the HI disk is elongated\nalong its kinematical major axis, leading to an inclination\n∼30◦ . Our Hα rotation curve rapidly reaches a plateau\nclimbing up to a maximum velocity ∼100 km s−1 around the\noptical radius (D25 /2) in agreement with Marquez & Moles\n(1996) from Hα slit spectroscopy.\nUGC 4393 (KIG 250). A strong Hα emission can be\n\n\fGHASP : An Hα kinematic survey of spiral and irregular galaxies - VI.\nseen along the bar (aligned with the kinematical major\naxis) and in the southwestern spiral arm, in agreement\nwith James et al. (2004) Hα map. Due to the bar, the\nHα velocity field is strongly perturbed in the center. As a\nconsequence, the Hα rotation curve is strongly perturbed,\nwith counter-rotation motions in the center. No HI velocity field is available in the literature. The HI width\nat 20% (160 km s−1 from Springob et al. 2005) is more\nthan twice our Hα velocity field amplitude (70 km s−1 ).\nThis means that the maximum velocity is not reached\nin Hα. Moreover, due to the presence of the strong bar,\nthe inclination is probably overestimated. Indeed, the\nexternal axis ratio of the outermost isophotes leads to an\ninclination around 35◦ . However, even with this lower value\nof inclination, the HI maximum rotation velocity remains\nslightly lower than expected for such a galaxy, according to\nthe Tully Fisher relationship.\nUGC 4422 (NGC 2595). Located in the Cancer cluster,\nthis barred spiral exhibits a prominent nucleus and distorted\nouter regions extending up to 70′′ (∼18 kpc). Hα emission\nis observed in the center, in the ring and in the beginning\nof the bar, in agreement with Gavazzi et al. (1998). Our\nrotation curve rapidly rises and reaches a plateau at almost\n350 km s−1 in the innermost 5′′ . The shape of the rotation\ncurve is consistent with the Fabry-Perot observations from\nAmram et al. (1992) and we derive the same set of parameters within the uncertainties. There is a strong discrepancy\nbetween the photometric (49±4◦ ) and kinematic inclination\n(25±8◦ ). No HI velocity map is available. The corrected HI\nprofile width of 321 km s−1 from Springob et al. (2005) is\nin agreement with our Hα velocity field amplitude.\nUGC 4456 (KIG 260). A difference of 82◦ is observed\nbetween the kinematical and morphological major axis\nposition angle. This difference is due to its low inclination\nleading to an uncertain morphological determination.\nWithin the error bar, a good agreement is observed\nbetween the kinematical and morphological inclination.\nNo HI velocity map is available. The width of the HI\nprofile at 20% (110 km s−1 from Bottinelli et al. 1990\nand 105 km s−1 from Lewis et al. 1987) is larger than\nour Hα velocity field amplitude although our Hα rotation\ncurve rapidly reaches a plateau extending well beyond the\noptical limit.\nUGC 4555 (NGC 2649, KIG 281). No HI velocity map is available. The width of the HI profile\nat 20% (251 km s−1 from Bottinelli et al. 1990 and\n256 km s−1 from Lewis et al. 1987) is in agreement with\nour Hα velocity field amplitude.\nUGC 4770 (NGC 2746). In agreement with its morphological type (SBa), it shows a weak and asymmetric\nHα emission. In particular, no Hα is detected within\nthe bar. The Hα position-velocity diagram and rotation\ncurve are badly defined due to faint SNR in the data,\nspecially on the receding side. The maximum velocity\nVCO =207 km s−1 deduced from the molecular component\n(Sauty et al. 2003) is in agreement with our Hα velocity\nfield amplitude. No HI velocity map is available. The width\nof the HI profile at 20% (264 km s−1 from Bottinelli et al.\n1990 and 270 km s−1 from Lewis et al. 1987) suggests that\nHα and the CO rotation curves do not reach the maximum\nvelocity.\nUGC 4820 (NGC 2775, KIG 309). Hα imaging from\n\n19\n\nHameed & Devereux (2005) is comparable with our data,\nshowing a flocculent ring of Hα emission. Stellar dynamics\nfrom Kregel et al. (2005) suggest a maximum velocity of\n283 km s−1 lower than that suggested by the Hα kinematics.\nNo HI velocity map is available in the literature. The width\nof the HI profile at 20% (435 km s−1 from Bottinelli et al.\n1990) is in agreement with our Hα velocity field amplitude.\nUGC 5045. It is a triple-arm barred galaxy that suffers\nfrom global distortion and shows UV excess (KISO survey,\nTakase & Miyauchi-Isobe 1991). Its arms are knotty with\nmany HII regions distributed asymmetrically in the disk\nand no Hα emission is detected in the very center. The\nrising part of our Hα rotation curve is thus missing and\nthe curve looks like a plateau around 400 km s−1 , which\nseems quite high for such an Sc type galaxy. Indeed, our\nHα velocity field suggests a faint inclination (17◦ only, with\nan uncertainty of 10◦ ) whereas the photometry suggests\n41±4◦ (HyperLeda). Adopting this last value would lower\nthe plateau of our rotation curve around a more normal\nvalue of 200 km s−1 , thus casting a doubt on the inclination\ndeduced from our kinematics. No HI velocity map is available but the width of the HI profile at 20% (200 km s−1 ,\nSpringob et al. 2005) is in agreement with our Hα velocity\nfield amplitude. Taking into account the methodology used,\nand the fact that the velocity field which presents a good\nSNR is not strongly disturbed (no bar, symmetric rotation\ncurve), we adopt the kinematic inclination.\nUGC 5175 (NGC 2977, KIG 363). This galaxy shows\na strong Hα emission. Our Hα rotation curve is flat, with\na plateau at ∼190 km s−1 , suggesting a maximum velocity\nrotation lower than that found by Karachentsev & Mineva\n(1984) in the optical. It has been Observed in CO by\nSauty et al. (2003) who find a line width at 50% of\n312 km s−1 . No HI velocity map is available but the line\nwidth at 20% of 356 km s−1 (Theureau et al. 1998) is\ncomparable with our Hα velocity field amplitude.\nUGC 5228. The Hα rotation curve of this strong Hα emitter, rises up to a plateau at ∼125 km s−1 . The HI line\nwidth of ∼270 km s−1 measured by Doyle et al. (2005) is\nin good agreement with our Hα velocity field amplitude.\nUGC 5251 (NGC 3003). As already noted by\nRossa & Dettmar (2003), except in the nucleus and in\nseveral bright HII regions, the Hα emission is rather faint\nand its distribution asymmetric, like the spiral arms of the\ngalaxy. Such an asymmetry suggests that this galaxy may\nbe disturbed by a dwarf companion. The velocity field is\nalso rather asymmetric. No HI velocity field is available.\nThe width of the HI profile at 20% (305 km s−1 from\nSpringob et al. 2005 and 289 km s−1 from Bottinelli et al.\n1990) is slightly higher (by ∼30 km s−1 ) than the velocity\namplitude of our Hα velocity field. Thus, the maximum\nrotation velocity is probably not reached with our Hα rotation curve.\nUGC 5279 (NGC 3026, KIG 377). No HI velocity field is available. The width of the HI profile at\n20% (∼220 km s−1 , Bottinelli et al. 1990) is lower than our\nHα velocity field amplitude, suggesting that the maximum\nvelocity is reached on our Hα position-velocity diagram.\nUGC 5319 (NGC 3061, KIG 382). Its bar, almost\naligned with the major axis, shows no significant signature\nin our Hα velocity field. Our Hα rotation curve shows an\ninclined plateau, continuously rising within the optical lim-\n\n\f20\n\nB. Epinat et al.\n\nits. The steep rising in the first kpc of the rotation curve for\nthis relatively low mass galaxy may be the signature of a\nbar. No HI velocity field is available but the width of the\nHI profile at 20% (233 km s−1 from Springob et al. 2005\nand 272 km s−1 from Lang et al. 2003, HIJASS survey) is\nsignificantly higher than the amplitude of our Hα velocity\nfield (∼180 km s−1 ). However the corrected velocity\nfrom Springob et al. (2005) is about 198 km s−1 and the\nwidth of the HI profile at 50% from Lang et al. (2003) is\n189 km s−1 which is in better agreement. This disagreement\nbetween HI and Hα data could indicate that the galaxy is\nembedded in an HI complex extending much further out\nthan the optical limit.\nUGC 5351 (NGC 3067). This galaxy has been studied\nin the optical by Rubin et al. (1982), the position angle of\nthe major axis and the outer velocity gradients agree with\nboth sets of data. Taking into account the difference in\ndistance adopted for that galaxy (28.3 vs 19.3 Mpc), the extensions of the rotation curves agree. The rotation curve in\nthe inner parts from stellar kinematics (Héraudeau et al.\n1999) is in very good agreement with the inner part of\nthe Hα position-velocity diagram. The full resolution HI\nvelocity field (WHISP, Noordermeer et al. 2005) is still too\nlow and does not allow a straightforward comparison with\nthe Hα. In particular the bar is not seen in HI while the\nsignature of the bar is clearly seen in the inner region of\nthe Hα velocity field. The HI and Hα velocity amplitude\nand gas extension are similar but their behaviour along\nthe major axis seems different. The Hα position-velocity\ndiagram suggests that a constant velocity is reached after\nradius ∼5′′ whereas the HI position-velocity diagram does\nnot show such a plateau. The outermost isophotes of the\nHST image (Carollo et al. 1998) suggest an almost edge-on\ngalaxy. Due to its high inclination, to avoid contamination\ndue to the thickness of the disk (outer regions along the\nminor axis), we have fixed the inclination to 82◦ from\nthe morphology. The maximum rotation velocity has been\ncomputed taking into account this inclination and no\nrotation curve has been plotted.\nUGC 5373 (Sextans B, KIG 388). This dwarf galaxy is\npart of the local group. Our Hα map is in good agreement\nwith the Hα maps from Hunter & Elmegreen (2004) and\nJames et al. (2004). The Hα velocity field presents a low\namplitude velocity gradient (∼30 km s−1 ) barely visible on\nthe position-velocity diagram. Both major axis orientation\nand inclination are difficult to determine, nevertheless the\nkinematical major axis seems to be quite different (∼30◦ )\nfrom the photometric major axis probably due to non\ncircular motions. The Hα rotation curve is ill defined in\nthe central part, with a possible counter rotation within\n15′′ from the center, but rises rapidly beyond 30 arcsec and\nseems to reach a plateau at about 50 arcsec, in agreement\nwith the HI data from Hoffman et al. (1996) who miss the\nrising part because of their poor resolution (and possibly\nlack of HI in the center). We also agree that this galaxy\nis almost face on (from the kinematics we find 10◦ , with\nan uncertainty of 18◦ and (Hoffman et al. 1996) find\n18◦ ) whereas the photometry suggests 60◦ (HyperLeda).\nHowever, our very low inclination value may lead to\noverestimate the rotation velocities.\nUGC 5398 (NGC 3077). As a member of the M81 group\nof galaxies it is strongly disrupted by the interaction with\n\nM81 and M82. As shown by Walter et al. (2002), its optical\nimage is offset with respect to a prominent HI tidal arm\nlying at about 4′ East from the galaxy. Our Hα map is in\ngood agreement with the one from James et al. (2004). The\nHα velocity field shows no evidence for rotation, although\nsome velocity gradient can be seen on the edges of the\ndisk, with the lowest velocities observed on the western side\n(in agreement with Walter et al. 2002 observations, in HI,\nHα and CO). No Hα rotation curve could be derived from\nour data as one can see it on the velocity field and on the\nposition-velocity diagram.\nIC 2542 (KIG 399). Kinematic and photometric data\nlead to a major axis position angle in good agreement but a\ndifference of 20◦ is observed on the inclination, nevertheless\nthe difference on the inclination is compatible with the\nerror bars. Our Hα rotation curve seems to reach a plateau\nat almost 300 km s−1 within the optical radius (D25 /2). No\nHI data are available in the literature.\nUGC 5510 (NGC 3162, NGC 3575) . Our Hα rotation\ncurve seems to reach a plateau just before the optical radius\n(D25 /2) although the velocities for the receding side are\nstill increasing beyond. No HI velocity field is available.\nThe width of the HI profile at 20% (204 km s−1 from\nvan Driel et al. 2001 and 187 km s−1 from Bottinelli et al.\n1990) is in agreement with our Hα velocity field.\nUGC 5532 (NGC 3147). The Hα emission is very\nweak in the nuclear region and does not allow us to plot\nthe rising part of the Hα rotation curve which rapidly\nreaches (within 1 kpc) a slightly decreasing plateau starting\nat almost 400 km s−1 . No HI velocity map is available.\nThe width of the HI profile at 20% (455 km s−1 from\nRichter & Huchtmeier 1991, and 403 km s−1 from\nLang et al. 2003) is in agreement with our Hα velocity field.\nUGC 5556 (NGC 3187, Arp 316, HCG 44D).\nIt is a member of the famous compact group HCG 44\n(Hickson et al. 1989) strongly interacting with NGC 3190\n(Sandage & Bedke 1994). Hα emission is only observed\nalong the lenticular central region (the bar) and in the\ninner arms. The arms are obviously driven by streaming\nmotions due to the interaction with its companion. The\nposition angle of the kinematical major axis of the galaxy\nis almost perpendicular to the bar . Thus, the velocity\nfield traces the kinematics of the bar and of the streaming\nmotions in the arms but not the kinematics of the disk.\nFurthermore we cannot compute a rotation curve. The\nvelocity amplitude perpendicular to the bar accross the\nvelocity field is ∼150 km s−1 , lower than the width of the\nHI profile at 20% (296 km s−1 from van Driel et al. 2001\nand 257 km s−1 from Bottinelli et al. 1990).\nUGC 5786 (NGC 3310, Arp 217). The unusual\nsmooth outer plume on the western side of the galaxy is\nprobably the result of a recent merger (Balick & Heckman\n1981). The plume has a smaller radial velocity than the\ngalaxy.Wehner & Gallagher (2005) evidenced a closed loop\nin the V and R-band that may be tidal debris. Diffuse\nHα emission, not visible by James et al. (2004), is detected\non our Hα image all around the galaxy. A large portion of\nthe star formation is located in a central ring surrounding\nan off-centered nucleus. The central region of the Hα velocity field displays a S-shape pattern encircling two velocity\npeaks leading to two severe bumps in the rotation curve.\n\n\fGHASP : An Hα kinematic survey of spiral and irregular galaxies - VI.\nThe bright nucleus exhibits a steep velocity rise. Outside\nthe nuclear region, the velocity decrases and then remains\nflat along the galaxy major axis. Despite the evidence for\nperturbations, the rotation curve is fairly symmetric although showing some oscillations. Outflows are observed in\nthe central region of the galaxy (∼1 kpc) by Schwartz et al.\n(2006) where we measure large Hα linewidths. The width\nof the HI profile at 20% (330 km s−1 from Springob et al.\n2005) is significantly larger than the amplitude of our\nHα velocity field, suggesting that we cannot reach the\nmaximum rotation velocity with our Hα data. Indeed, our\nHα rotation curve clearly reaches a maximum at about\n120 km s−1 with its central bump at 0.5 kpc but the\nbehavior of the curve in the outer parts is too chaotic\n(with a total divergence between receding and approaching\nside beyond the optical limit) for concluding anything\nabout the true maximum. The kinematical inclination has\nbeen determined in excluding the central spiral structure\nwithin the first kpc, leading to a rather high inclination of\n53±11◦ . This is significantly higher than the morphological\ninclination of 16±25◦ (HyperLeda) but the difference\nremains compatible with the error bars. We finally choose\nthe kinematical inclination.\nUGC 5840 (NGC 3344, KIG 435). The Hα map\nis in agreement with Knapen et al. (2004), however, we\nmiss the outermost parts of the galaxy because of our\nfield-of-view (limited to a 4′ diameter in that case because\nof the use of a 2 inches circular filter). Also, the warp\nobserved in HI (WHISP, website) cannot be seen within our\nfield-of-view. Despite the fact that this ringed spiral galaxy\nis fairly regular, the velocity field is not at all symmetric\nwith respect to the minor axis. The nuclear region shows\na large velocity dispersion, as seen in the position-velocity\ndiagram diagram. The Hα rotation curve exhibits a valley\nwhere the main spiral structure vanishes in the optical.\nThe width of the HI profile at 20% (166 km s−1 from\nBottinelli et al. 1990) is in agreement with the amplitude\nof our Hα velocity field. The maximum velocity found on\nour Hα rotation curve is rather high for such a small galaxy\n(D25 /2 ∼ 6 kpc) of Sbc type.\nUGC 5842 (NGC 3346, KIG 436. The Hα emission\nseems relatively poor on the receding side because the\ninterference filter we have used was not perfectly centered\non the galaxy. Nevertheless we were able to derive a quite\nacceptable rotation curve. The high dispersion of our\nrotation velocities in the center is probably due to the bar,\nthen (from 1 to 6 kpc) our rotation curve is slowly rising\nlike a solid body. No HI velocity field is available. The width\nof the HI profile at 20% (166 km s−1 from Bottinelli et al.\n1990 and ∼180 km s−1 from Tift & Cocke 1988) is in\nagreement with our Hα velocity field suggesting that the\nmaximum rotation velocity is reached. We conclude that a\nplateau (if any) must begin just beyond the optical radius\n(D25 /2) where our Hα rotation curve ends after an almost\ncontinuously rising tendency.\nUGC 6118 (NGC 3504). This early type galaxy presents\nan almost circular outer ring, and a thin bar (more visible\nin J-H-K band from NED) embedded in a rather oval\nstructure (axis ratio ∼0.5). A bulge is visible on the near\ninfrared images. The agreement between our Hα map and\nthe one from Hameed & Devereux (2005) is very good.\nThe main bar has a size ∼1.2 arcmin. A secondary bar\n\n21\n\nmay be suspected in the first ∼20′′ around the very bright\nHα nuclei. An Hα spiral structure is observed within the\noval structure starting at the end of the inner bar. We\nfind the major kinematical axis to be almost parallel to\nthe bar and the oval structure. Our Hα velocity field is\nalmost limited to the central oval structure and the bar,\nwith only a few points in the outer ring. A steep inner rise\nof the velocities is observed in the galaxy core, otherwise\nthe Hα velocities remain roughly constant before 45′′ ,\nradius beyond which they begin to increase slightly. This\nis not observed in the HI position-velocity diagram from\nWHISP (Noordermeer et al. 2005), and the HI rotation\ncurve slightly increases all along the first arcminute. Their\nHI velocity field perfectly covers the outer ring and leads\nto an inclination of 39◦ . The morphological inclination\ndeduced from the outer ring is ∼27◦ , while the inclination\nof the oval structure is ∼45◦ . The kinematical inclination of\n52◦ deduced from our Hα velocity field is consistent with the\ninclination of the oval distortion. Nevertheless we computed\nthe rotation curve using the HI inclination because our\nkinematical inclination mainly relies on velocities measured\nwithin the central oval structure. The central region of the\nvelocity field within the bar displays an S-shape pattern\nencircling two symmetric velocity peaks leading to two\nstrong bumps on the rotation curve (at ∼0.5-1 kpc). Our\nHα rotation curve is in good agreement with the long-slit\nobservations of Usui et al. (2001).\nUGC 6277 (NGC 3596, KG 472). Except for the first\ncentral 15′′ , it is a low surface brightness galaxy displaying\neverywhere weak Hα emission. As a result, our Hα rotation\ncurve seems to be limited to its rising part. Nevertheless,\nthe velocity amplitude is in agreement with the HI profile\nof Kornreich et al. (2000), suggesting that our Hα rotation\ncurve probably reaches the maximal rotation velocity\ndespite its limited extent (about half the optical radius).\nUGC 6419 (NGC 3664, Arp 05). It is one of the\nprototypical strongly barred magellanic spirals and has\na nearby companion, UGC 6418, at 6.2′ . HI VLA observations (Wilcots & Prescott 2004) show that the current\ninteractions affect the morphology and the kinematics of\nthe main galaxy. The HI velocity field of both galaxies are\nconnected, with a large extension (∼10′ ) compared with\nthe optical one (∼1′ ). The position angle of the major axis\nof our Hα velocity field is almost perpendicular to the\nHI one. Indeed, the gradient of our Hα velocity field is\nalmost aligned along the bar, which cannot be seen in the\nHI data due to the low spatial resolution. It is therefore\npossible that our Hα rotation curve does not reflect the\nrotation of the galaxy but more probably the kinematics\nof the bar, likely to be affected by non circular motions.\nAnyway, the shape of our rotation curve (solid body type)\nis not surprising for a galaxy of this type, but we find a\nrather low rotation velocity considering the luminosity of\nthat galaxy. This suggests that the kinematical inclination\n(66◦ ) as well as the inclination determined from the disk\nshape when excluding the tidal tail (57◦ ) are too high.\nIndeed, the axial ratio of the disk including the tidal tail\nis close to one, suggesting that the galaxy is seen almost\nface on. We conclude that the velocities of our Hα rotation\ncurve are probably underestimated. Furthermore, the HI\nvelocity field amplitude observed by Wilcots & Prescott\n(2004) (∼150 km s−1 ) is about twice ours (∼70 km s−1 ),\n\n\f22\n\nB. Epinat et al.\n\nsuggesting that we do not reach the maximum of the\nrotation velocity.\nUGC 6521 (NGC 3719). No evidence for interaction with its companion, UGC 6523, can be seen in our\nHα velocity field which is fairly symmetric. The resulting\nrotation curve is slightly decreasing beyond 6 kpc. No HI\nvelocity field is available. The width of the HI profile at\n20% (397 km s−1 , Theureau et al. 1998) is somewhat higher\nthan the amplitude of our Hα velocity field but the shape\nof our rotation curve leaves no doubt that the maximum is\neffectively reached within the optical limits.\nUGC 6523 (NGC 3720). Nearby companion of UGC\n6521. The Hα emission is limited to the central regions\n(about one third the optical radius), thus our Hα rotation curve only shows the central rising part of the\ncurve and no clear sign of interaction can be seen. No\nHI velocity field is available. The width of the HI profile\nat 20% (393 km s−1 from Bottinelli et al. 1990) is much\nlarger (more than three times) than our Hα velocity\nfield amplitude, indicating that we are far from reaching\nthe maximum of the rotation velocity.\nUGC 6787 (NGC 3898). Because of the interference\nfilter used for this observation, which was not perfectly\ncentered on the systemic velocity of the galaxy, the\nHα emission of the eastern side was not transmitted\nthrough the filter (a good Hα image could be found in\nPignatelli et al. 2001). As a consequence, our Hα rotation\ncurve is only traced with the approaching side but seems\nacceptable anyway. It reaches a plateau within the optical\nradius (D25 /2) and seems to decrease beyond, in agreement\nwith the HI data from WHISP (Noordermeer et al. 2005).\nHowever, the HI data suggest that the rotation curve climbs\nagain beyond 2 arcmin to recover the same velocity level.\nAlso, the steep inner rise of the velocities seen in the HI\nposition-velocity diagram from WHISP is not detected in\nour Hα position-velocity diagram, which is probably due to\na too low signal-to-noise ratio of the optical observations.\nThe Hα velocities remain constant in the approaching half\nof the diagram whereas the HI velocities increase in the\nsame region.\nUGC 7021 (NGC 4045, NGC 4046). The Hα emission\nof this barely barred galaxy is found along the inner ring\nand in the center. No diffuse Hα is detected in otherwise\nin the disk, which is not surprising for an SAB(r)a galaxy.\nOur Hα map is very similar to the one found in GOLD\nMine (Gavazzi et al. 2003). Because Hα emission is only\ndetected in the very central area of the optical disk, we\nuse the photometric inclination (56◦ ) rather than the\nkinematical one (34◦ ). Indeed the kinematical inclination\nis based only on the inner ring which is supposed to\nbe circular, thus biasing the inclination determination.\nOur Hα rotation curve shows a slowly decreasing plateau\nstarting at ∼220 km s−1 and ∼2 kpc, corresponding to the\ntip of the bar. The core of the galaxy exhibits two different\nvelocity components, one at ∼1920 km s−1 and another one\nat ∼2000 km s−1 . No HI velocity field is available. The\nwidth of the HI profile at 20% (337 km s−1 , Springob et al.\n2005) is in agreement with our Hα velocity field amplitude,\nconfirming that we actually reach the maximum of the\nvelocity rotation although our Hα rotation curve is far from\nreaching the optical radius (D25 /2).\nUGC 7045 (NGC 4062). This galaxy is a strong\n\nHα emitter, as already reported by James et al. (2004). A\nperfect agreement between photometric and kinematical\nparameters is observed. Slit spectroscopy observations using\nHα and [NII] (Sofue et al. 1998) are compatible with ours,\nshowing an Hα rotation curve that reaches a slowly rising\nplateau after about 20′′ . The position-velocity diagram derived in HI by Broeils & van Woerden (1994) is affected by\nbeam smearing effects, since the inner part shows a solid\nbody rotation up to almost 1.5′ . At larger radii however\nthe optical and radio data are compatible. The velocity\ndispersion in the central region of our Hα rotation curve is\nrather high, probably due to the bar. The linewidth of the\nHI profile at 20% (309 km s−1 , Springob et al. 2005) is in\ngood agreement with our Hα velocity field amplitude.\nUGC 7154 (NGC 4145). This galaxy, having a bar\nembedded in a large elliptical bulge, is one of the principal\ngalaxies in the Ursa Major Cluster paired with A1208+40\n(Holm 342b) located at 13′ . The Hα rotation curve beyond\nthe optical radius (D25 /2) is mainly traced from emission\nregions of the spiral arms, leading to large wiggles in the\nrotation curve. The grand design of the WHISP HI velocity\nfield (website) is compatible with the Hα one. The HI\nmaximum rotation velocity of 171 km s−1 (Warmels 1988),\nassuming a 42◦ inclination, is compatible with our Hα value\n(about 150 km s−1 assuming a 65◦ inclination). Due to\nbeam smearing effects, the inner velocity gradient in the\nHI is nevertheless much lower than in the Hα and the HI\nposition-velocity diagram suggests a solid body rotation\ncurve up to 2 arcmin from the center.\nUGC 7429 (NGC 4319). A very faint Hα emission has been detected in two spots for this spiral\ngalaxy, companion of NGC 4291. This detection needs\nto be confirmed. No HI emission has been detected by\nSengupta & Balasubramanyam (2006).\nUGC 7699. No HI velocity field is available in the literature. The linewidth of the HI profile at 20% (205 km s−1 ,\nBroeils & van Woerden 1994) is in agreement with our\nHα velocity field amplitude, their position-velocity diagram shows a solid body rotation having the same velocity\namplitude as ours but the higher spatial resolution of the\nHα velocity field enables us to observe deviations from a\npure solid body rotation.\nUGC 7766 (NGC 4559). The bar of this galaxy is almost\naligned with the major axis, its signature can be seen on the\nvelocity field as well as on the rotation curve within the first\n30′′ . Meyssonnier (1984) obtained a rotation curve from slit\nspectroscopy which is in agreement, although it has a much\nhigher dispersion than our Hα rotation curve. Our rotation\ncurve is more extended since our velocity field reaches\nmore outer regions although our field-of-view is limited\nby the size of the interference filter.Krumm & Salpeter\n(1979) found a flat HI rotation curve from 2′ to 7′ . It has\nbeen observed more recently by WHISP (website), their\nposition-velocity diagram confirms the flat behavior of\nthe rotation curve up to 9′ together with the amplitude\ndetermined by the previous authors. The width of the HI\nprofile at 20% (254 km s−1 , Springob et al. 2005) is in\nagreement with our Hα velocity field amplitude.\nUGC 7831 (NGC 4605). Diffuse Hα emission is observed\nin the outer disk of this galaxy. Our Hα velocity field and\nrotation curve exhibit a strong asymmetry likely to be\nexplained by the bar. Such an asymmetry is confirmed\n\n\fGHASP : An Hα kinematic survey of spiral and irregular galaxies - VI.\nby the Hα +[NII] rotation curve from Rubin et al. (1980)\nand by Sofue et al. (1998). I-band image (XDSS) clearly\nprovides the morphological center of the galaxy and\nleads to the rotation curve presented here. On the other\nhand, the kinematical center for this galaxy appears to\nbe shifted by about 10′′ eastward from the morphological\none but none of them leads to a symmetric inner rotation\ncurve. The receding side of the rotation curve displays\na plateau after 40 arcsec, following a solid body shape\nin the center, while the approaching side is continuously\nclimbing (note also that the receding side is less luminous\nthan the approaching one). The method described in the\npaper leads to the rotation curve presented here because\nit minimizes the dispersion. Nevertheless this solution is\nunphysical since it leads to negative rotation velocities\nfor the receding side in the innermost region. To avoid\nthis, the systemic velocity should be somewhat lowered by\n∼ 20 km s−1 , leading to a worst disagreement between\nboth sides of the rotation curve, another solution would\nbe to consider another rotation center but it does not\nsolve the asymmetry problem as explained above. This\ngalaxy has been observed in HI by WHISP (website), their\nposition-velocity diagram is asymmetric, in agreement with\nour Hα position-velocity diagram and rotation curve, and\nthe HI velocity field suggests a warp in the outer parts of\nthe disk.\nUGC 7853 (NGC 4618, Arp 23). It forms a physical\npair with UGC 7861 (NGC 4625). Assuming a distance for\nboth galaxies of 8.9 Mpc (Moustakas & Kennicutt 2006),\ntheir physical separation is only ∼22 kpc (8.5′ ). Indeed,\nthese galaxies show obvious signs of interaction (e.g. strong\ntidal unique tail for both galaxies). Its bar is not centered\non the nucleus (Eskridge et al. 2002). Due to the strong\nsouthern arm, the morphological center is offset from the\nkinematical one. The Hα rotation curve displays a solid\nbody shape up to its end (∼150′′ ) suggesting that the\nmaximum rotation velocity is probably not reached. The HI\nrotation curve (van Moorsel 1983) decreases beyond 3′ from\nthe center (note however that their beam is larger than\n1′ ). HI has been also observed by WHISP (website), their\nposition-velocity diagram displays a solid body rotation\ncurve up to ∼1.5′ for the approaching side and a plateau\nbeyond 1′ for the receding side. Their low resolution velocity\nfield shows a severely warped disk (the position angle of the\nmajor axis rotates by 90◦ between the inner regions and\nthe outermost parts of the HI disk). Taking into account\nthe beam smearing effect, the agreement between the HI\nand our Hα position-velocity diagram and rotation curve is\nquite acceptable.\nUGC 7861 (NGC 4625). This galaxy is the companion\nof UGC 7853 (see notes above). Here again the center of the\ngalaxy is offset from the center of the velocity field due to\nthe strong southern tidal arm. Our Hα rotation curve shows\na strong dispersion in the central part (up to 10′′ from\nthe center) then rises slowly as a solid body up to the\noptical limit (about 40′′ ) suggesting that the maximum\nrotation velocity is probably not reached. Fabry-Perot\nobservations of this galaxy, with the 3.6m CFHT, have been\npublished by Daigle et al. (2006a), their velocity field and\nrotation curve are in good agreement with ours. HI has\nbeen observed by WHISP (website), their position-velocity\ndiagram suggests a rotation curve with a plateau extending\n\n23\n\nbeyond the optical limit, from 1′ up to 4′ .\nUGC 7876 (NGC 4635). This isolated galaxy is a\nmember of the Coma1 Cloud (according to GOLD Mine,\nGavazzi et al. 2003). The Hα rotation curve is asymmetric\nand the fitting method probably led to an underestimation\nof the systemic velocity ∼10 km s−1 . This may be caused\nby the bar. Its CO emission is very faint (Sauty et al. 2003)\nand no HI velocity field is available but the linewidth of\nthe HI profile at 20% (173 km s−1 Springob:2005) is in\nagreement with our Hα velocity field amplitude.\nUGC 7901 (NGC 4651, Arp 189). Member of the\nVirgo cluster, it is a strong Hα emitter, particularly in\nan inner ring from where start the arms. A very good\nagreement is observed between our Hα map and the ones\nof James et al. (2004), Koopmann et al. (2001), and GOLD\nMine (Gavazzi et al. 2003). A faint signature of a bar can\nbe seen in the inner regions of our Hα velocity field. Our\nHα rotation curve is in good agreement with that observed\nby Rubin et al. (1999) from long slit spectroscopy except\nthat we do not observe the rising trend they observe for the\noutermost part of the receding side. Such a behavior seems\nsuspect, all the more since our Hα rotation curve is perfectly\nsymmetric and extends further out, owing to velocities\ncollected far from the major axis. No HI velocity map is\navailable. The width of the HI profile at 20% (395 km s−1 ,\nSpringob et al. 2005) is in agreement with our Hα velocity\nfield amplitude.\nUGC 7985 (NGC 4713). Member of the Virgo cluster\nshowing a strong Hα emission as shown by the same authors\nas for UGC 7901. The signature of a bar is seen in the inner\npart of our Hα velocity field within a radius of ∼30′′ . Our\nHα rotation curve extends further out than the rotation\ncurve observed by Rubin et al. (1999), beyond the optical\nradius (D25 /2). Our rotation curve is fairly symmetric and\ndoes not show the strong decrease observed by Rubin et al.\n(1999) for the receding part around 40′′ . No HI velocity\nmap is available but the HI linewidth at 20% (217 km s−1 ,\nSpringob et al. 2005) is in agreement with our Hα velocity\nfield amplitude.\nUGC 8334 (NGC 5055, M 63). M 63 is a very well\nstudied flocculent spiral galaxy. Our observations are fully\ncompatible with the Hα Fabry-Perot data observed with the\n1.6m Mont Megantic Telescope (Daigle et al. 2006a). Their\nrotation curve is more extended, due to a larger of view,\nbut does not reach the optical radius (∼6′ ). It possesses\na huge HI disk (∼36′ diameter) strongly warped beyond\nthe optical disk (Battaglia et al. 2006). The agreement\nbetween our Hα rotation curve and their HI rotation\ncurve is very good but we find a better symmetry for\nreceding and approaching sides from 2 to 10 kpc radius.\nThe position-velocity diagram shows that the velocities\nsteeply rise in the inner 10′′ .\nUGC 8403 (NGC 5112). Paired with NGC 5107 at\n13.5′ , its Hα map shows a very good agreement with that\nof James et al. (2004). The signature of a weak bar is\nvisible in the inner region of our Hα velocity field but it\nis difficult to see the signature of an interaction with its\ncompanion in its velocity field. An attempt of CO detection\nproofed dubious (Braine et al. 1993). It has been observed\nin HI by Springob et al. (2005), and by WHISP (website).\nThere is a good agreement between the WHISP velocity\nfield and ours and our Hα emission is almost as extended\n\n\f24\n\nB. Epinat et al.\n\nas the HI disk. The shape of the HI position-velocity\ndiagram found by WHISP is in very good agreement with\nour Hα position-velocity diagram and rotation curve. Also,\nthe HI linewidth at 20% (226 km s−1 , Springob et al. 2005)\nis in good agreement with our Hα velocity field amplitude.\nNGC 5296. This galaxy has no UGC number. It is the\nsmall companion of UGC 8709 (discussed hereafter). Our\nHα map is deeper than the one by Rossa & Dettmar (2003)\nbut nevertheless does not show any Hα emission in the tidal\narms seen on their unsharped-mask R-band image, the emission being restricted to the central regions (∼1/3 D25 /2).\nAs a consequence, our Hα rotation curve only shows the\ninner rising part. It is difficult to make a direct comparison\nwith the rotation curve obtained by Rampazzo et al. (1995)\nbecause they choose to align their slit in the direction of\nUGC 8709, which is about 30◦ different from the true major\naxis. However, simulating a slit with their orientation along\nour Hα velocity field shows that our results are consistent.\nOn the WHISP HI velocity field (website) one can hardly\ndistinguish NGC 5296 close to UGC 8709, although it seems\nto appear as a point source on the average resolution map.\nUGC 8709 (NGC 5297). It is the large companion of\nNGC 5296. Hα emission is detected in the northern arm but\nonly in the beginning of the southern tidal arm, in agreement with Rossa & Dettmar (2003). The clear signature\nof a bar can be seen in the center of the Hα velocity field.\nFrom the kinematics, we find an inclination (76±1◦ ) slightly\nsmaller than the photometric one (82±3◦ ). It seems that the\nphotometric inclination has been computed from the axis\nratio of the disk including the tidal arms. The width of the\nHI profile at 20% (418 km s−1 from van Driel et al. 2001,\n413 km s−1 from Bottinelli et al. 1990) is in agreement with\nour Hα velocity field amplitude. The HI velocity field has\nbeen observed by WHISP (website) and is consistent with\nours. The HI position-velocity diagram shows a slightly\ndecreasing plateau beyond 1', in agreement with our\nHα rotation curve. The long slit rotation curve observed\nby Rampazzo et al. (1995) also shows a decreasing trend in\nthe outer parts. No CO has been detected in this galaxy\n(Elfhag et al. 1996).\nUGC 8852 (NGC 5376). This galaxy is included in a\ngroup together with UGC 8860 (NGC 5379) and UGC 8866\n(NGC 5389). Strong Hα emission is seen, in particular in\na ring located 15′′ from the center. No HI velocity field is\navailable. The width of the HI profile at 20% (402 km s−1 ,\nTheureau et al. 1998) is significantly higher than our\nHα velocity field amplitude (∼320 km s−1 ). Since our\nHα rotation curve is still rising in the outer parts, before we\nreach the optical radius, this suggests that the maximum\nvelocity is not reached.\nUGC 8863 (NGC 5377). The detection of Hα emission\nin this early type SBa galaxy is limited to two faint lobes\nat about 1′ on each side of the disk. As a consequence\nour Hα rotation curve is reduced to two points (which\nnevertheless represent 34 independent bins, i.e. about a\nthousand of pixels), one for the receding side and one\nfor the approaching side and we only get a lower limit\nfor the Hα maximum rotation velocity of ∼190 km s−1 .\nMoreover, even if the signal-to-noise ratio does not allow to\ncompute another velocity bin in the center of the galaxy,\nthe position-velocity diagram suggests a faint Hα emission\n(yellow spots) allowing us to measure a central gradient of\n\n∼40 km s−1 /arcsec (i.e. ∼350 km s−1 kpc−1 ). Due to beam\nsmearing limitation, this strong gradient cannot be seen on\nthe WHISP position-velocity diagram (Noordermeer et al.\n2005). Indeed, the maximum velocity is reached at about\n1′ from the center in HI data leading to a lower velocity\ngradient of ∼3 km s−1 /arcsec (i.e. ∼25 km s−1 kpc−1 ).\nOur maximum velocity is probably close to the actual\nmaximum velocity rotation since the width of the HI profile\nat 20% (391 km s−1 ) found by Noordermeer et al. (2005) is\nclose to our Hα velocity field amplitude.\nUGC 8898 & UGC 8900 (NGC 5394 & NGC 5395,\nArp 84). The nuclei of this interacting pair of galaxies\nare separated by only 1.9 ′ (∼27 kpc). No Hα emission is\ndetected in the tidal arms of UGC 8898 while Hα emission is more extended in UGC 8900, in agreement with\nKaufman et al. (1999) from Fabry-Perot imaging. The photometric inclination for UGC 8898 is 70◦ ±3◦ , quite different\nfrom our kinematical inclination (27◦ ±20◦ ) which is in fact\nbased on the very central part only (about 15′′ diameter).\nDespite its limited extent, our Hα velocity field of UGC\n8898 clearly suggests a position angle of the major axis of\n31◦ , different by 66◦ from the one used by Márquez et al.\n(2002) for long slit spectroscopy, which they confess is not\nadequate to elaborate the rotation curve. Indeed they did\nnot observe any clear rotation within the first 10′′ . Our\nHα rotation curve extends only up to ∼10′′ and we do not\nreach neither a plateau nor, probably, the maximum rotation velocity. Because our observations of UGC 8898 have\nbeen done through the edge of the transmission function of\nthe interference filter, the spatial coverage of our data is\nsmaller than that of Kaufman et al. (1999). They have also\nobserved UGC 8898 in the CO line (Kaufman et al. 2002)\nand find a very good agreement between Hα and CO data.\nIn agreement with the Fabry-Perot Hα velocity field of\nKaufman et al. (1999), our Hα velocity field of UGC 8900\nis not well enough defined to show straightforward evidence\nfor interaction, except that the velocity field is uncompleted\nand the kinematical major axis is shifted by 11◦ from the\nmorphological one, which is a significant difference considering the high inclination of this galaxy.Márquez et al. (2002)\nhave aligned the slit of their spectrograph almost along the\nmorphological major axis, explaining part of the differences\nbetween our rotation curves. Their rotation curve is slightly\nmore extended but much more chaotic and asymmetric,\nwith a markedly smaller velocity amplitude than ours.\nBoth sides of our Hα rotation curve are fairly symmetric\nand show a slowly rising trend (almost solid body like\nbetween 20′′ and 60′′ ) without ever reaching a plateau.\nSuch a behavior is unexpected for an Sa type galaxy and\ncould be due to the interaction with its companion. The\nkinematical and morphological inclinations of UGC 8900\nare compatible within the error bars (they differ by only\n9◦ ). HI single dish observations cannot disentangle UGC\n8898 from its companion UGC 8900 (van Driel et al. 2001;\nTheureau et al. 1998). The pair has also been observed\nin the HI by WHISP (website) and by Kaufman et al.\n(1999). Taking into account the lower HI spatial resolution,\nthe HI and Hα kinematics are compatible, and the HI\nposition-velocity diagram suggests that we actually reach\nthe maximum of the rotation curve at the end of our\nHα rotation curve.\nUGC 8937 (NGC 5430). Our Hα map shows low emission\n\n\fGHASP : An Hα kinematic survey of spiral and irregular galaxies - VI.\nHα regions that were not detected by Garcı́a-Barreto et al.\n(1996). The signature of the strong central bar can be seen\non our Hα velocity field (S shape signature). Our rotation\ncurve reaches a plateau within a few arcsec. A strong velocity gradient of ∼300 km s−1 is observed between -5′′ and\n5′′ , as can be seen in the position-velocity diagram. The HI\nline width at 20% (371 km s−1 from Springob et al. 2005,\n344 km s−1 from Theureau et al. 1998) is slightly smaller\nthan the amplitude of our Hα velocity field (∼400 km s−1 ).\nUGC 9013 (NGC 5474). This late-type peculiar dwarf\ngalaxy is the nearest companion of M101 (44′ ) and is\ntidally deformed into a very asymmetric and disturbed\nobject. Our Hα velocity field cannot help us finding the\nrotation center as it shows a solid body shape.Knapen et al.\n(2004) show an Hα map in good agreement with ours.\nThe Hα rotation curve derived from long slit spectroscopy\ndata by Catinella et al. (2005) cannot be compared\ndirectly with ours, because their center has been chosen to be the \"pseudonucleus\". Several HI studies are\navailable in the literature (van der Hulst & Huchtmeier\n1979; Huchtmeier & Witzel 1979; Rownd et al. 1994;\nKornreich et al.\n2000).Kornreich et al.\n(2000)\nand\nRownd et al. (1994) used the same dataset from the\nVLA array (35′′ beam). The optical part of the galaxy is\nnot affected by the severe warp seen in HI and the solid\nbody rotation seen in Hα is compatible with HI data. These\nauthors place the kinematical center as the symmetry center\nof the warp. It is closer to the center of the outermost\noptical isophotes than the \"pseudonucleus\".Rownd et al.\n(1994) assumed an inclination of 21◦ from a tilted ring\nmodel. Their position angle of the major axis in the\ncenter (∼158◦ ) is in agreement with our but almost\nperpendicular to the photometric position angle. Due to\nthe presence of the strong tidal arm and the relative low\nspatial Hα coverage, the inclination and center are in fact\ndifficult to recover. That is why we preferred using the HI\nkinematical center and inclination (21◦ ) consistent with\nthe external axis ratio of the outermost isophotes from\nthe XDSS image. The strange behavior of the resulting\nHα rotation curve in the first 40′′ could be the signature of\nstrong non circular motions. We find a maximum velocity\nrotation ∼120 km s−1 at about 70′′ , significantly higher\nthan the velocities found by Kornreich et al. (2000) even\nwhen assuming a very low inclination for the HI disk. Also\nthe amplitude of our Hα velocity field is higher than the HI\nvelocity field amplitude.\nUGC 9179 (NGC 5585). It is a satellite of M101\n(Sandage & Bedke 1994). A good agreement is observed\nbetween our Hα map and that of James et al. (2004),\nhowever we miss an Hα region in the North East because\nof our smaller field-of-view. The Hα rotation curve is\nperturbed, due to the presence of the bar and an inner\narm like structure. This galaxy has been observed in HI by\nCote et al. (1991) who obtained a velocity field and a rotation curve in agreement with ours although their HI extent\nis larger and our Hα resolution higher. Our Hα rotation\nvelocities are higher because we assume an inclination of\n36◦ (derived from our Hα velocity field) whereas the HI\ndata led to a higher inclination of 51.5◦ . Both values are\nnevertheless compatible within the Hα error bars. Although\nthe shape of our Hα rotation curve suggests that we reach\nthe maximum rotation velocity at the optical limit, the HI\n\n25\n\nrotation curve from Cote et al. (1991) shows that the true\nmaximum is reached a bit further.\nUGC 9219 (NGC 5608). It has been observed in Hα by\nvan Zee (2000) and James et al. (2004), their maps are in\nagreement with ours. Our Hα velocity field amplitude is\nnevertheless compatible with the HI line width at 20% of\n130 km s−1 from Bottinelli et al. (1990). No HI velocity\nmap is available in the literature for this galaxy.\nUGC 9248 (NGC 5622). The Hα emission is asymmetric\nand much brighter on the western side. Nevertheless the\nresulting rotation curve is fairly symmetric and reaches\na plateau within the optical limit. No HI velocity map is\navailable in the literature but HI line width measurements\nat 20% have been done and are compatible with our\nHα velocity field amplitude although somewhat larger\n(357 km s−1 by Theureau et al. 1998, 349 km s−1 by\nSpringob et al. 2005).\nUGC 9358 (NGC5678).Márquez et al. (2002) derived\na rotation curve from long slit spectroscopy which is in\ngood agreement with our Hα rotation curve, for both sides.\nHowever, since we adopted a slightly lower inclination,\nour velocities are slightly higher. Their rotation curve is\nmore extended, but the dispersion of their points in the\nouter parts is quite high, specially on the receding side.\nOur Hα velocity field is perturbed and clearly shows the\nsignature of a bar in the center (S shape of the isovelocity\nlines). No HI velocity map is available in the literature\nbut the width of the HI profile at 20% (424 km s−1 ,\nSpringob et al. 2005) is in good agreement with our Hα velocity field amplitude.\nUGC 9363 (NGC 5668). Our observations are in\nagreement with previous Hα Fabry-Perot observations\nby Jiménez-Vicente & Battaner (2000). They adopted an\ninclination of 18◦ derived by Schulman et al. (1996) from a\ntilted ring model applied to VLA HI data. This inclination\nis lower than expected from morphology (33◦ ). Our data\nconfirm this tendency, explaining why morphological and\nkinematical major axis are found to be quite different\n(40◦ ). Our kinematical estimate of the inclination is close\nto 0◦ and leads to unrealistically high rotational velocities.\nThus, as Jiménez-Vicente & Battaner (2000), we fixed the\ninclination to the HI value of 18◦ . Schulman et al. (1996) HI\ndata show a warp starting at 120′′ , which is the outermost\nlimit of our Hα rotation curve. Indeed, it is possible that\nthe outermost points of our Hα rotation curve are affected\nby this warp, since it shows a clear trend to increase from\n80′′ to 120′′ whereas the HI observations by Schulman et al.\n(1996) suggest that the plateau of the curve is already\nreached at 100′′ when correcting for the warp. The width of\nthe HI profile at 20% (122 km s−1 , Springob et al. 2005) is\nin agreement with our Hα velocity field amplitude.\nUGC 9406 (NGC 5693). A short bright bar and an\nasymmetric disk (with one knotty arm) are observed.\nThis galaxy is paired with UGC 9399 (NGC 5689) at\n11.8′ , which may explain the presence of a single arm.\nPoor Hα emission is detected and our Hα velocity\nfield shows a strong dispersion, so that it is difficult to\ndraw any reliable rotation curve from our data. The\nphotometric inclination found in the literature varies from\n33◦ (Vorontsov-Velyaminov & Krasnogorskaya 1994) to\n51◦ (HyperLeda). Even when adopting the lowest value\nof inclination, we find a maximum rotation velocity which\n\n\f26\n\nB. Epinat et al.\n\nremains abnormally low considering the absolute magnitude\nof this galaxy, suggesting that our Hα velocity field is far\nfrom reaching the maximum velocity amplitude. Indeed the\nwidth of the HI profile at 20% is 74 km s−1 (Bottinelli et al.\n1990) whereas our Hα velocity field amplitude is smaller\nthan 50 km s−1 . No HI velocity map is available for this\ngalaxy in the literature.\nUGC 9465 (NGC 5727). A good agreement is observed\nbetween our Hα map and that of James et al. (2004). No\nsignature of the central bar can be seen on our Hα velocity\nfield. It has been observed in HI by Pisano et al. (2002)\nand their velocity field is in good agreement with ours.\nThese authors adopted an inclination of 61◦ (close to the\ninclination of 65◦ we deduced from our Hα velocity field)\nand found a maximum rotation velocity of 93 km s−1 in\ngood agreement with our Hα value (98 km s−1 ). The\ninclination of 90◦ given in HyperLeda is certainly wrong\nbecause this galaxy seems far from being seen edge-on.\nThe inclination deduced from our Hα velocity field exactly\nmatches the value suggested by the axis ratio given in NED.\nUGC 9576 (NGC 5774). This galaxy is the companion\nof NGC 5775. There is a good agreement between our\nHα map and that of James et al. (2004).Márquez et al.\n(2002) derived a rotation curve from long slit spectroscopy.\nHowever their slit was 20◦ away from the true kinematical\nmajor axis, maybe explaining why their rotation curve is\nmore chaotic than ours. Our Hα rotation curve is much\nmore symmetric and extends further out. The width of\nthe HI profile at 20% (280 km s−1 ) from Springob et al.\n(2005) is almost twice our Hα velocity field amplitude,\nwhich is quite surprising since the shape of our Hα rotation\ncurve suggests that we reach the maximum rotation velocity.\nThe value given by Springob et al. (2005) seems nevertheless suspicious as Bottinelli et al. (1990) and Irwin (1994)\nrespectively found 152 km s−1 and 179 km s−1 (uncorrected\nfor galaxy inclination) for the width of the HI profile\nat 20%, which is quite compatible with our Hα velocity\nfield amplitude. The detailed HI velocity field of the pair\nNGC 5774-5775 has been observed at the VLA by Irwin\n(1994). Her velocity field and rotation curve for NGC 5774\nare in good agreement with our Hα data and have about\nthe same spatial extension. She used the same method as\nus to determine the kinematical parameters and they are in\nvery good agreement with ours.\nUGC 9736 (NGC 5874). We detect poor and asymmetric Hα emission in that galaxy. Our Hα rotation\ncurve is nevertheless fairly symmetric and almost reaches\nthe optical limit, with a trend to flatten in its outermost\nparts. The width of the HI profile at 20% (324 km s−1 from\nSpringob et al. 2005, 315 km s−1 from Bottinelli et al.\n1990) is in agreement with our Hα velocity field amplitude\nand suggests that we actually reach the maximum of the\nrotation curve. No HI velocity map is available in the\nliterature.\nUGC 9866 (NGC 5949). Comparing our Hα map with\nthat of James et al. (2004) shows that our data suffer from\nbad seeing conditions leading to non resolved HII regions.\nHowever the Hα emission is strong enough so that we have\na complete velocity field all over the disk. The Hα emission\nis asymmetric, stronger on the receding side (northwest).\nOur rotation curve is in very good agreement with the\nradial velocities measured by Karachentsev & Petit (1990)\n\nfrom slit spectroscopy when correcting from the inclination. Courteau (1997), also from slit spectroscopy, finds a\nslightly smaller extension for the rotation curve but the\nvelocity width he measures from the flux-weighted rotation\nprofile (213 km s−1 ) is in agreement with our maximum\nvelocity field amplitude. No HI velocity map is available\nbut the width of the HI profile at 20% (216 km s−1 from\nSpringob et al. 2005, 197 km s−1 from Bottinelli et al.\n1990) is also in good agreement with our Hα velocity\nfield amplitude.\nUGC 9943 (NGC 5970). It forms a pair with IC 1131\nat 8′ . Hα emission is strong in particular in an inner\nring. Our Hα rotation curve is in good agreement with\nthe slit spectroscopy one of Márquez et al. (2002). A\nplateau is clearly reached around 3 kpc. No HI velocity\nmap is available in the literature but the width of the\nHI profile at 20% (338 km s−1 from Springob et al. 2005,\n326 km s−1 from Bottinelli et al. 1990) is in good agreement\nwith our Hα velocity field amplitude.\nUGC 10075 (NGC 6015). There is a good agreement\nbetween our Hα map and that of James et al. (2004). We\ndetect however some faint emission in an outer spiral arm\nto the southeast that they do not detect. Our Hα rotation\ncurve is in good agreement with the slit spectroscopy\nobservations of Carozzi (1976) when correcting from the\ndifferent inclination adopted. However, her detection was\nnot as good, and our rotation curve is almost twice more\nextended, clearly showing a slowly rising plateau beyond 50\n′′\nradius. No HI velocity map is available in the literature\nbut the width of the HI profile at 20% (315 km s−1 from\nSpringob et al. 2005, 310 km s−1 from Bottinelli et al. 1990)\nis in good agreement with our Hα velocity field amplitude.\nIt has been observed in CO by Braine et al. (1993) who\nfind a strong CO emission at 40′′ (2.7 kpc) from the center.\nUGC 10521 (NGC 6207). There is a good agreement\nbetween our Hα map and that of James et al. (2004).\nOur Hα rotation curve is in good agreement with the slit\nspectroscopy observations by Carozzi (1976) (P A=15◦ )\nand Márquez et al. (2002) (with P A=22◦ ) when correcting\nfrom the different inclinations adopted. No HI velocity\nmap available in the literature but the width of the HI\nprofile at 20% (255 km s−1 from Springob et al. 2005,\n240 km s−1 from Bottinelli et al. 1990) is in good agreement with our Hα velocity field amplitude.\nUGC 10652 (NGC 6283). This galaxy is asymmetric,\nwith some bright Hα spots and diffuse Hα emission all over\nthe disk. An inner Hα ring, some 7′′ radius, can be seen\nin the center. The morphological inclination of 30±7◦ is\ncompatible, within the error bars, with the kinematical\ninclination (16±12◦ ) deduced from our Hα velocity field.\nThe position of the kinematical major axis differs from the\nphotometric one by 12◦ . Our Hα rotation curve seems to\nreach a plateau at about 2 kpc (23′′ ) within the optical\nlimit. No useful HI data are available in the literature for\nthat galaxy.\nUGC 10713. We adopted an inclination of 90◦ for that\ngalaxy, otherwise our method led to a clearly wrong value\nbelow 70◦ , probably because of the odd pattern of our\nHα velocity field in the center. It has been observed in\nHI by WHISP (website) and their velocity field is in\nagreement with ours, but much more extended. Their\nHI position-velocity diagram suggests that the rotation\n\n\fGHASP : An Hα kinematic survey of spiral and irregular galaxies - VI.\ncurve reaches a plateau at about 1′ radius, just beyond the\nlimits of our Hα rotation curve which is limited to the solid\nbody rising part. The HI line width at 20% (268 km s−1 by\nTheureau et al. 1998 and 260 km s−1 by Springob et al.\n2005) is in agreement with our Hα velocity field amplitude.\nUGC 10757. This galaxy has a velocity of 1168 km s−1 ,\nit is located in a triple subgroup with UGC 10762 (NGC\n6340) an S0/a galaxy with a peculiar morphology with a\nseries of tightly wound, almost circular, multiple-fragment,\nrelatively thin outer arms surrounding a bulge and a lens\nat 6.4′ and UGC 10769 which has an Sb pec morphological\ntype located at 6.1′ with a velocity of 1283 km/s. This\nsystem is clearly in interaction as shown by the HI cloud in\nwhich the 3 galaxies are embedded (e.g. WHISP website).\nThis galaxy is asymmetric, with a brighter Hα emission\non the beginning of the northern spiral arm, also seen\non the optical (XDSS) and UV (GALEX) images. The\nWHISP HI velocity field corresponding to the optical extent\nof the galaxy (also coinciding with the brightest part of\nthe HI complex) is in agreement with our Hα velocity\nfield. However, the pattern of the whole extent of the HI\nvelocity field is quite odd, apparently because of several\ngalaxies interacting there. As a result, the width of the\nHI profile at 20% found in the literature for that galaxy\n(283 km s−1 from Springob et al. 2005, 276 km s−1 from\nLang et al. 2003, 222 km s−1 from Theureau et al. 1998) is\nlarger than the amplitude of the Hα velocity field because\na more extended region is embedded in the HI. The shape\nof the Hα rotation curve suggests that we are not far from\nreaching the maximum rotation velocity within the optical\nlimit.\nUGC 10769. This galaxy has a diffuse disk and no spiral\npattern visible. It has a higher velocity than the two\nother galaxies in the triple system (see UGC 10757 for a\ndetailed discussion). We detect Hα emission only in the\nnorth-eastern edge of the disk so that no rotation curve\ncan be derived. The secondary peak in the HI distribution\ncorresponds to the same region where the Hα is detected.\nUGC 10791. This Low Surface Brightness galaxy has two\ncompanions according to the WHISP website. We observe\na faint diffuse Hα emission throughout the disk insufficient\nto determine unambiguously its inclination. This galaxy is\nclassified face-on in HyperLeda, nevertheless it does not\nlook face-on on the XDSS image (see Figure D93), in addition the velocity field displays a clear rotation compatible\nwith the HI velocity field (e.g. same position angle and\nvelocity amplitude in the central region). Thus we fixed the\ninclination to the WHISP value of 34◦ . The Hα distribution\nextends only until half of the optical radius and thus does\nnot reach the maximum rotation velocity observable in\nthe HI (FWHM: 199 km s−1 from Springob et al. 2005,\n156 km s−1 from Theureau et al. 1998; amplitude of the\nWHISP velocity field of ∼150 km s−1 ).\nUGC 11012 (NGC 6503). This galaxy has a strong\nHα emission all over its disk, with a faint extended feature\non the western edge (∼2′ from the center). This faint extension cannot be seen on the Hα map from Strickland et al.\n(2004). Our rotation curve clearly reaches a plateau around\n80′′ , well before the optical limit. Several optical rotation curvesare found in the literature but none of them\ntakes this extension into account and their extension is\nlimited to ∼80′′ whereas ours extends up to 150′′ (for\n\n27\n\nthe receding side, owing to the mentioned Hα extension).\nNevertheless these rotation curves(Karachentsev & Petit\n1990; de Vaucouleurs & Caulet 1982) are in very good\nagreement with our Hα rotation curve. Hβ observations\nmade by Bottema (1989) also show a rotation curve in good\nagreement with ours. The HI map obtained by Begeman\n(1987) is more extended than our Hα map otherwise both\nvelocity fields are in good agreement, as well as the derived\nrotation curves. The parameters computed in HI with a\ntilted ring model ( P A=-59.4◦ , i=73.8◦ ) are in very good\nagreement with our own parameters.\nUGC 11269 (NGC 6667). Despite a short exposure\ntime (∼1 hour), our Hα observations perfectly match\nJames et al. (2004) Hα data who find faint patchy emission.\nIt has been observed in HI by WHISP (Noordermeer et al.\n2005) and their velocity field and rotation curve extend\nmore than four times the optical radius. Our Hα positionvelocity diagram does not show the steep velocity gradient\nobserved on their HI position-velocity diagram in the\ninnermost 40′′ due to a very noisy and patchy distribution\nof the ionized gas. The maximum rotation velocity is\nreached in Hα, as confirmed by the width of the HI profile\nat 20% found by different authors (415 km s−1 from\nNoordermeer et al. 2005, 394 km s−1 from Springob et al.\n2005, 406 km s−1 from Bottinelli et al. 1990). Our Hα data\nsuggest that the maximum rotation velocity is reached\nwithin the first kpc instead of the first ∼6 kpc as suggested\nby the HI data (Noordermeer et al. 2005).\nUGC 11300 (NGC 6689, NGC 6690). This galaxy has\nbeen published in paper IV. See specific comment at the\nend of this section.\nUGC 11332 (NGC 6654A). There is a good agreement\nbetween our Hα map and that of James et al. (2004).\nHowever, our image is affected by very bad seeing conditions (see Table C2) resulting in a diffuse emission\naround the galaxy that is most probably an artifact. No HI\nvelocity map is available in the literature. The width of the\nHI profile at 20% (331 km s−1 from Springob et al. 2005,\n315 km s−1 from Bottinelli et al. 1990) is significantly larger\nthan our Hα velocity field amplitude (about 200 km s−1 ),\nsuggesting that our Hα velocity field does not reach the\nmaximum rotation velocity although it extends up to the\noptical radius.\nUGC 11407 (NGC 6764). The Hα emission is conspicuous along the bar and in the arms (particularly the\nnorthern arm). Our Hα rotation curve has been drawn\nusing the photometric position angle of the major axis\nand the photometric inclination. It is much chaotic in the\ncenter, up to 20′′ (probably because of the strong bar),\nthen looks in average like that of a solid body rotating\ndisk, although it is markedly asymmetric. The central\nbar is almost aligned along the photometric major axis\nand the HI velocity field derived from VLA observations\n(Wilcots et al. 2001) leads to the same position angle.\nIn the central parts, the isovelocity lines pattern show\nthe signature of the strong central bar on both Hα and\nHI velocity fields. The position-velocity diagram shows a\nsteep velocity rise in the galaxy core. The width of the\nHI profile at 20 % (291 km s−1 from Springob et al. 2005,\n293 km s−1 from Bottinelli et al. 1990, ∼300 km s−1 from\nWilcots et al. 2001) is in agreement with our Hα velocity\nfield amplitude.\n\n\f28\n\nB. Epinat et al.\n\nUGC 11466. We detect a strong Hα emission along a\nbar like feature. This galaxy has been observed in HI\nby WHISP (website) and their high resolution velocity\nfield is in agreement with our Hα velocity field. Their\nlower resolution maps show a much larger HI disk but no\ngreater velocity amplitude, suggesting that our ha rotation\ncurve reaches the maximum velocity in the outer parts\nof the optical disk (also, the WHISP position-velocity\ndiagram is in agreement with our Hα position-velocity diagram and rotation curve). This is confirmed by the width\nof the HI profile at 20% measured by different authors\n(247 km s−1 from Springob et al. 2005, 239 km s−1 from\nTheureau et al. 1998, 251 km s−1 from Kamphuis et al.\n1996) which is in perfect agreement with our Hα velocity\nfield amplitude.\nUGC 11470 (NGC 6824). The Hα emission is rather\nfaint, and hardly detected on the eastern side of the galaxy\nbecause of the interference filter transmission mismatching\nthe systemic velocity. As a result, the rotation curve could\nbe drawn almost only from the approaching side. No HI\nvelocity map is available in the literature. The width of the\nHI profile at 20% (574 km s−1 from Springob et al. 2005) is\nin agreement with the Hα velocity amplitude showing that\nthe maximum velocity is reached at a small radius (∼3 kpc)\ncompared to the optical radius (∼18 kpc), in agreement\nwith what is expected for such a bright early type galaxy\n(Mb =-21.3; Sab). There has been no detection of CO in\nthat galaxy by Elfhag et al. (1996).\nUGC 11496. The Hα emission is very faint in that galaxy,\nsufficient however for drawing a velocity field and deriving\nan acceptable rotation curve. The HI velocity field (WHISP,\nwebsite) is in agreement with our Hα velocity field but\nmuch more extended. The width of the HI profile at\n20% (121 km s−1 from Bottinelli et al. 1990) is in agreement with our Hα velocity field amplitude and confirms\nthat we reach the maximum rotation velocity as already\nsuggested by the shape of our Hα rotation curve, showing\na trend to reach a plateau in the outer parts.\nUGC 11498. The Hα emission is faint and asymmetric\nin this early type galaxy (SBb). However, although there\nis only a few Hα emission on the receding side, the shape\nof our rotation curve suggests that a plateau is reached on\nboth sides. No HI velocity map is available in the literature.\nThe width of the HI profile at 20% (509 km s−1 from\nSpringob et al. 2005, 500 km s−1 from Bottinelli et al.\n1990) perfectly matches our Hα velocity field amplitude.\nWe find a maximum rotation velocity of 274 km s−1 which\nseems a bit high when taking into account its luminosity.\nUGC 11597 (NGC 6946). NGC 6946 is a very well\nstudied nearby spiral galaxy. Our Hα Fabry-Perot observations are in perfect agreement with the Hα Fabry-Perot\ndata recently published by Daigle et al. (2006a) who had a\nlarger field of view (we miss the outer parts of the optical\ndisk). We find a kinematical inclination of 40±10◦ close to\ntheir value (8.4±3◦ ) and compatible with the photometric\nvalue (17±19◦ ) within the error bars.\nUGC 11670 (NGC 7013). The Hα emission is mainly\nconcentrated in the central part of the disk (with two bright\nblobs, on each side of the central bulge, along the major\naxis) and some emission can be seen on the northwestern\nedge of the optical disk. Our Hα rotation curve rapidly\nreaches a maximum, at about 20′′ from the center (∼1 kpc),\n\nfollowed by a slight decrease and a plateau. The velocity\ngradient observed in the inner 20′′ of our position-velocity\ndiagram is consistent with that observed in the HI positionvelocity diagram from WHISP (Noordermeer et al. 2005)\nand their velocity field is in agreement with our Hα velocity field but much more extended. The width of the HI\nprofile at 20% (342 km s−1 from Noordermeer et al. 2005,\n363 km s−1 from Springob et al. 2005, 355 km s−1 from\nBottinelli et al. 1990) is in good agreement with our\nHα velocity field amplitude. The morphological inclination\nof 90◦ found in HyperLeda assumes a thick disk. However,\nassuming a thin disk, the inclination is found to be 68◦ with\na tilted ring fit to the HI velocity field (Noordermeer et al.\n2005) in agreement with the value deduced from our\nHα velocity field (65± 2◦ ) as well as with the inclination\ndeduced from the axis ratio (69◦ ) or other morphological\ndeterminations (Vorontsov-Velyaminov & Krasnogorskaya\n1994).\nUGC 11872 (NGC 7177). Our Hα map has a mottled\nappearance, in agreement with that of James et al. (2004),\nhowever our observations suffer from bad seeing conditions.\nOur Hα rotation curve rapidly reaches a well defined and\nsymmetric plateau, extending up to the optical radius. The\nrotation curve obtained by Márquez et al. (2002) reaches\nthe plateau more rapidly (10′′ instead of 20′′ ) but they\nfind it at a lower value since they assume a surprisingly\nhigh inclination (79◦ while we find 47◦ from our Hα velocity field, which is closer to the morphological value of\n54◦ ). Furthermore, slit spectroscopy of the inner part of\nthe galaxy by Héraudeau et al. (1999) confirms that the\nmaximum velocity is not reached before 20′′ . No HI velocity\nmap is available in the literature, however HI line widths\nhave been measured (314 km s−1 from Springob et al. 2005,\n317 km s−1 from Bottinelli et al. 1990) and are in agreement\nwith our Hα velocity field amplitude. Moreover, a radio\nsynthesis observation has been done (Rhee & van Albada\n1996) to derive a position-velocity diagram. It shows a solid\nbody rotation as far out as 1′ which is likely to be explained\nby beam smearing effects.\nUGC 12082. The Hα emission in this low luminosity\nnearby galaxy is rather patchy. Our Hα map is in agreement with that of James et al. (2004). The HI velocity\nfield (WHISP, website) confirms our position angle determination for the major axis in the central part. It is\nhowever much more extended than the Hα one and shows\na strong warp of the HI disk. The WHISP position-velocity\ndiagram suggests that we do not reach the maximum\nvelocity within the optical radius although the shape of our\nHα rotation curve shows a trend to reach a plateau in the\nouter parts. The HI line width at 20% confirms that point,\nsince all the values found in the literature (95 km s−1 from\nBraun et al. 2003, 103 km s−1 from Springob et al. 2005,\n79 km s−1 from Bottinelli et al. 1990) are markedly larger\nthan the amplitude of our Hα velocity field.\nNB.The following targets, already published in the previous GHASP papers, have been observed again in different\nconditions (filters, seeing, transparency, exposure time, ...)\nin order to check if the quality of the data may be improved:\nUGC 2023, UGC 2034, UGC 3734, UGC 11300 and UGC\n12060. The results are fully consistent with the previous set\nof observation without any significant improvement so that\n\n\fGHASP : An Hα kinematic survey of spiral and irregular galaxies - VI.\nwe do not present the new data in this paper, except for\nUGC 11300.\nWe present the new observation for UGC 11300 mainly\nto compare the new method of reduction presented in this\npaper with the previous GHASP papers. We observe a general good agreement in velocities as well as in radial extension. The adaptive spatial binning enables us now: 1) to\nplot velocity measurement in the outskirts of the approaching side; 2) to increase the spatial resolution within the inner\n30′′ (∼1 kpc) 3) to underline that the error bars are correlated with the spatial resolution and the quality of the data\n(the error bars are generally smaller and a wide range of\namplitude is observed).\n\n29\n\n\f30\n\nB. Epinat et al.\n\nAPPENDIX C: TABLES\n\n\fGHASP : An Hα kinematic survey of spiral and irregular galaxies - VI.\nTable C1. Log of the observations.\nN◦\nUGC\n(1)\n\nN◦\nNGC\n(2)\n\nα\n(2000)\n(3)\n\nδ\n(2000)\n(4)\n\nλc\nÅ\n(5)\n\nFWHM\nÅ\n(6)\n\ndate\n\n00h 00m 28.0s\n\n17◦ 13'09\"\n\n6582.8\n6660.3\n6660.3\n6660.2\n6660.3\n6675.0\n6675.2\n6675.0\n6675.2\n6628.4\n6660.2\n6693.1\n6735.0\n6560.3\n6654.9\n6658.0\n6658.0\n6627.6\n6659.3\n6659.3\n6689.5\n6603.2\n6674.2\n6674.2\n6601.6\n6613.7\n6581.7\n6581.7\n6659.2\n6659.2\n6659.2\n6573.7\n6573.6\n6674.3\n6611.1\n6658.4\n6688.7\n6658.7\n6718.7\n6593.0\n6734.3\n6628.5\n6602.9\n6593.9\n6594.2\n6613.9\n\n10.6\n20.0\n20.0\n20.0\n20.0\n20.0\n20.0\n20.0\n20.0\n20.0\n20.0\n22.6\n20.0\n12.0\n20.6\n20.0\n20.0\n20.0\n20.0\n20.0\n20.0\n12.0\n20.0\n20.0\n12.0\n11.1\n10.6\n10.6\n20.0\n20.0\n20.0\n11.4\n11.4\n20.0\n11.1\n20.0\n20.0\n20.0\n20.0\n10.1\n20.0\n20.0\n12.0\n10.1\n10.1\n11.1\n\n12893\n89\n\n23\n\n00h 09m 53.4s\n\n25◦ 55'24\"\n\n94\n1013\n\n26\n536\n\n00h 10m 25.9s\n01h 26m 21.8s\n\n25◦ 49'54\"\n34◦ 42'11\"\n\nNGC 542\n\n542\n\n01h 26m 21.8s\n\n34◦ 42'11\"\n\n1317\n1437\n1655\n1810\n3056\n3334\n3382\n\n697\n753\n828\n\n01h 51m 17.6s\n01h 57m 42.2s\n02h 10m 09.7s\n02h 21m 28.7s\n04h 30m 49.2s\n05h 42m 04.6s\n05h 59m 47.7s\n\n22◦ 21'28\"\n35◦ 54'58\"\n39◦ 11'25\"\n39◦ 22'32\"\n64◦ 50'53\"\n69◦ 22'43\"\n62◦ 09'28\"\n\n06h 26m 55.8s\n06h 55m 00.1s\n06h 56m 10.6s\n06h 58m 37.6s\n07h 09m 05.9s\n07h 09m 12.0s\n07h 09m 18.1s\n07h 24m 28.0s\n07h 27m 13.1s\n07h 29m 17.5s\n\n59◦ 04'47\"\n84◦ 02'30\"\n84◦ 04'44\"\n45◦ 12'38\"\n61◦ 35'44\"\n20◦ 36'11\"\n20◦ 38'10\"\n61◦ 41'38\"\n85◦ 45'16\"\n27◦ 54'00\"\n\n07h 34m 55.8s\n07h 47m 16.5s\n07h 47m 20.4s\n08h 01m 53.2s\n\n31◦ 16'34\"\n26◦ 57'03\"\n26◦ 55'48\"\n50◦ 44'15\"\n\n08h 10m 15.2s\n08h 26m 04.4s\n08h 27m 42.0s\n08h 32m 03.5s\n08h 44m 08.4s\n09h 05m 59.4s\n09h 10m 20.1s\n09h 28m 10.2s\n09h 43m 46.8s\n09h 46m 03.8s\n09h 48m 36.4s\n09h 50m 55.1s\n09h 56m 12.0s\n\n33◦ 57'24\"\n45◦ 58'02\"\n21◦ 28'45\"\n24◦ 00'39\"\n34◦ 43'02\"\n35◦ 22'38\"\n07◦ 02'17\"\n44◦ 39'52\"\n74◦ 51'35\"\n01◦ 40'06\"\n33◦ 25'17\"\n28◦ 33'05\"\n75◦ 51'59\"\n\n3463\n3521\n3528\n3618\n3685\n3708\n3709\n3826\n3740\n3876\n3915\nIC 476\n4026\n4165\n4256\n4393\n4422\n4456\n4555\n4770\n4820\n5045\n5175\n5228\n5251\n5279\n5319\n\n1569\n1961\n\n2308\n2341\n2342\n2276\n\n2449\n2500\n2532\n2595\n2649\n2746\n2775\n2977\n3003\n3026\n3061\n\n(7)\n\nexposure time\ns\n(8)\n\nseeing\n\"\n(9)\n\nOct, 25 2003\nSep, 05 2002\nSep, 06 2002\nSep, 07 2002\nSep, 03 2002\nSep, 10 2002\nSep, 08 2002\nSep, 10 2002\nSep, 08 2002\nSep, 10 2002\nSep, 03 2002\nOct, 24 2000\nSep, 07 2002\nNov, 21 2001\nNov, 20 2001\nOct, 25 2003\nOct, 30 2003\nMar, 06 2003\nMar, 08 2003\nMar, 08 2003\nMar, 04 2003\nMar, 17 2002\nMar, 02 2003\nMar, 02 2003\nMar, 20 2002\nMar, 15 2002\nMar, 18 2004\nMar, 19 2004\nMar, 03 2003\nMar, 07 2003\nMar, 07 2003\nMar, 16 2002\nMar, 17 2002\nMar, 17 2004\nMar, 20 2004\nMar, 09 2003\nMar, 22 2004\nMar, 23 2004\nMar, 24 2004\nMar, 06 2003\nMar, 09 2003\nMar, 23 2004\nMar, 04 2003\nMar, 15 2002\nMar, 16 2004\nMar, 17 2004\n\n8640\n720\n1920\n6000\n6240\n1920\n1920\n1920\n1920\n4800\n6720\n12720\n7200\n6000\n5040\n4080\n7920\n6960\n8400\n8400\n6000\n5520\n6480\n6480\n4560\n4800\n6000\n9600\n6000\n6240\n6240\n4800\n4800\n6960\n6960\n7200\n6720\n6960\n7920\n8400\n6960\n5520\n9120\n1680\n6000\n7200\n\n2.6\n2.6\n4.3\n2.6\n2.9\n4.8\n2.4\n4.8\n2.4\n3.4\n3.8\n3.9\n3.6\n2.7\n3.1\n3.6\n4.6\n7.2\n3.4\n3.4\n2.4\n3.0\n3.3\n3.3\n3.2\n3.4\n3.4\n3.4\n3.4\n3.0\n3.0\n3.0\n2.5\n2.4\n3.5\n2.7\n4.8\n5.9\n4.3\n6.3\n2.5\n6.9\n2.8\n3.1\n2.7\n2.4\n\n31\n\n\f32\n\nB. Epinat et al.\n\nTable C1 – continued\nN◦\nUGC\n(1)\n\nN◦\nNGC\n(2)\n\nα\n(2000)\n(3)\n\nδ\n(2000)\n(4)\n\nλc\nÅ\n(5)\n\nFWHM\nÅ\n(6)\n\ndate\n\n5351\n5373\n5398\nIC 2542\n5510\n5532\n\n3067\n\n3162\n3147\n\n09h 58m 21.3s\n10h 00m 00.5s\n10h 03m 20.0s\n10h 07m 50.5s\n10h 13m 31.7s\n10h 16m 53.5s\n\n32◦ 22'12\"\n05◦ 19'58\"\n68◦ 44'01\"\n34◦ 18'55\"\n22◦ 44'14\"\n73◦ 24'03\"\n\n5556\n5786\n5840\n5842\n6118\n6277\n6419\n6521\n6523\n6787\n\n3187\n3310\n3344\n3346\n3504\n3596\n3664\n3719\n3720\n3898\n\n10h 17m 47.9s\n10h 38m 45.9s\n10h 43m 31.1s\n10h 43m 39.0s\n11h 03m 11.3s\n11h 15m 06.2s\n11h 24m 24.6s\n11h 32m 13.4s\n11h 32m 21.6s\n11h 49m 15.6s\n\n21◦ 52'24\"\n53◦ 30'12\"\n24◦ 55'21\"\n14◦ 52'18\"\n27◦ 58'20\"\n14◦ 47'12\"\n03◦ 19'36\"\n00◦ 49'09\"\n00◦ 48'14\"\n56◦ 05'04\"\n\n7021\n7045\n7154\n7429\n7699\n7766\n7831\n7853\n7861\n7876\n7901\n7985\n8334\n8403\nNGC 5296\n8709\n8852\n\n4045\n4062\n4145\n4319\n4559\n4605\n4618\n4625\n4635\n4651\n4713\n5055\n5112\n5296\n5297\n5376\n\n12h 02m 42.3s\n12h 04m 03.8s\n12h 10m 01.4s\n12h 21m 43.1s\n12h 32m 48.0s\n12h 35m 57.3s\n12h 39m 59.7s\n12h 41m 33.1s\n12h 41m 52.9s\n12h 42m 39.3s\n12h 43m 42.7s\n12h 49m 57.9s\n13h 15m 49.4s\n13h 21m 56.6s\n13h 46m 18.7s\n13h 46m 23.7s\n13h 55m 16.1s\n\n01◦ 58'36\"\n31◦ 53'42\"\n39◦ 53'02\"\n75◦ 19'22\"\n37◦ 37'18\"\n27◦ 57'38\"\n61◦ 36'29\"\n41◦ 09'05\"\n41◦ 16'25\"\n19◦ 56'44\"\n16◦ 23'35\"\n05◦ 18'42\"\n42◦ 01'46\"\n38◦ 44'05\"\n43◦ 51'04\"\n43◦ 52'20\"\n59◦ 30'25\"\n\n8863\n8898\n8900\n8937\n9013\n9179\n9219\n9248\n9358\n9363\n9406\n9465\n9576\n9736\n\n5377\n5394\n5395\n5430\n5474\n5585\n5608\n5622\n5678\n5668\n5693\n5727\n5774\n5874\n\n13h 56m 16.7s\n13h 58m 33.7s\n13h 58m 38.0s\n14h 00m 45.8s\n14h 05m 02.0s\n14h 19m 48.1s\n14h 23m 17.5s\n14h 26m 12.2s\n14h 32m 05.6s\n14h 33m 24.4s\n14h 36m 11.1s\n14h 40m 26.1s\n14h 53m 42.5s\n15h 07m 51.9s\n\n47◦ 14'08\"\n37◦ 27'12\"\n37◦ 25'28\"\n59◦ 19'43\"\n53◦ 39'08\"\n56◦ 43'45\"\n41◦ 46'34\"\n48◦ 33'51\"\n57◦ 55'16\"\n04◦ 27'02\"\n48◦ 35'06\"\n33◦ 59'23\"\n03◦ 34'57\"\n54◦ 45'08\"\n\n6593.7\n6571.0\n6563.7\n6689.7\n6592.3\n6630.3\n6623.1\n6593.9\n6584.2\n6573.7\n6584.2\n6593.9\n6580.8\n6593.9\n6689.2\n6689.2\n6584.3\n6584.2\n6602.6\n6581.1\n6584.2\n6592.1\n6573.9\n6583.3\n6565.7\n6573.6\n6575.7\n6584.3\n6581.7\n6574.1\n6572.9\n6584.2\n6615.4\n6615.4\n6610.2\n6609.9\n6601.1\n6651.1\n6651.1\n6628.2\n6565.2\n6570.7\n6573.7\n6655.2\n6603.0\n6594.1\n6612.6\n6594.1\n6594.2\n6629.1\n\n10.1\n11.4\n12.0\n20.0\n10.1\n9.6\n8.6\n10.1\n10.6\n11.4\n10.6\n10.1\n10.6\n10.1\n20.0\n20.0\n10.6\n10.6\n12.0\n10.6\n10.6\n10.1\n14.0\n10.6\n12.0\n11.4\n11.4\n10.6\n10.6\n11.4\n13.7\n10.6\n11.1\n11.1\n11.1\n11.1\n12.0\n20.6\n20.6\n20.0\n12.0\n11.4\n11.4\n20.6\n12.0\n10.1\n11.1\n10.1\n10.1\n20.0\n\n3077\n\n(7)\n\nexposure time\ns\n(8)\n\nseeing\n\"\n(9)\n\nMar, 07 2003\nMar, 22 2004\nMar, 08 2003\nMar, 21 2004\nMar, 02 2003\nMar, 19 2002\nMar, 20 2002\nMar, 17 2002\nMar, 20 2002\nMar, 20 2002\nMar, 20 2004\nMar, 18 2002\nMar, 19 2004\nApr, 27 2003\nMar, 05 2003\nMar, 05 2003\nMar, 19 2002\nMar, 20 2002\nMar, 04 2003\nMar, 18 2004\nMar, 21 2002\nMar, 03 2003\nMar, 22 2004\nJun, 17 2002\nJun, 15 2002\nMar, 18 2002\nJun, 16 2002\nMar, 17 2004\nMar, 19 2004\nApr, 26 2003\nJun, 14 2002\nMar, 21 2002\nJun, 13 2002\nJun, 13 2002\nMar, 05 2003\nMar, 07 2003\nMar, 26 2004\nMar, 18 2002\nMar, 18 2002\nMar, 03 2003\nJun, 14 2002\nMar, 20 2004\nMar, 22 2004\nMar, 21 2004\nMar, 19 2004\nApr, 26 2003\nApr, 28 2003\nMar, 17 2004\nApr, 27 2003\nMar, 02 2003\n\n7200\n7680\n7920\n7440\n6240\n4560\n1920\n5760\n4080\n5760\n6000\n5760\n10320\n6960\n6960\n6960\n3600\n5760\n7200\n6000\n5520\n6960\n6720\n2400\n3840\n5040\n3840\n6720\n8160\n6240\n4320\n4080\n6000\n6000\n2880\n4800\n5040\n4320\n4320\n8880\n5040\n8160\n6480\n10800\n7680\n8160\n6000\n6480\n6840\n3840\n\n4.1\n4.6\n3.2\n4.1\n3.5\n3.3\n3.3\n3.1\n4.1\n3.3\n3.5\n2.4\n2.9\n3.5\n3.7\n3.7\n2.9\n3.3\n4.3\n2.1\n4.2\n4.3\n4.6\n1.9\n2.2\n2.6\n3.3\n3.0\n3.8\n5.4\n2.3\n4.4\n3.2\n3.2\n2.8\n3.7\n3.3\n2.7\n2.7\n4.4\n2.3\n3.1\n4.7\n4.8\n4.3\n2.8\n3.3\n3.4\n4.1\n4.8\n\n\fGHASP : An Hα kinematic survey of spiral and irregular galaxies - VI.\n\n33\n\nTable C1 – continued\nN◦\nUGC\n(1)\n\nN◦\nNGC\n(2)\n\nα\n(2000)\n(3)\n\nδ\n(2000)\n(4)\n\nλc\nÅ\n(5)\n\nFWHM\nÅ\n(6)\n\ndate\n\n9866\n9943\n10075\n10521\n\n5949\n5970\n6015\n6207\n\n15h 28m 00.6s\n15h 38m 30.0s\n15h 51m 25.3s\n16h 43m 03.7s\n\n64◦ 45'46\"\n12◦ 11'11\"\n62◦ 18'36\"\n36◦ 49'55\"\n\n10652\n\n6283\n\n16h 59m 26.5s\n\n49◦ 55'20\"\n\n17h 04m 33.7s\n17h 10m 13.4s\n17h 11m 33.5s\n17h 14m 38.5s\n17h 49m 26.3s\n18h 30m 39.7s\n18h 34m 49.9s\n18h 39m 25.2s\n19h 08m 16.4s\n19h 42m 59.1s\n19h 43m 40.8s\n19h 53m 01.8s\n19h 57m 15.1s\n20h 34m 52.5s\n21h 03m 33.7s\n22h 00m 41.2s\n22h 34m 11.3s\n\n72◦ 26'45\"\n72◦ 24'38\"\n72◦ 24'07\"\n72◦ 23'56\"\n70◦ 08'40\"\n67◦ 59'14\"\n70◦ 31'28\"\n73◦ 34'48\"\n50◦ 55'59\"\n45◦ 17'58\"\n56◦ 06'34\"\n67◦ 39'54\"\n05◦ 53'24\"\n60◦ 09'12\"\n29◦ 53'50\"\n17◦ 44'18\"\n32◦ 51'42\"\n\n6572.2\n6602.5\n6580.9\n6582.1\n6582.1\n6584.2\n6584.2\n6585.5\n6586.0\n6592.9\n6593.1\n6562.2\n6615.5\n6584.4\n6594.7\n6615.0\n6583.0\n6628.6\n6611.3\n6628.0\n6562.3\n6581.9\n6584.8\n6582.1\n\n11.4\n12.0\n10.6\n10.6\n10.6\n10.6\n10.6\n10.6\n10.6\n10.1\n10.1\n8.8\n11.1\n10.6\n10.1\n11.1\n10.6\n20.0\n11.1\n20.0\n8.8\n10.6\n10.6\n10.6\n\n10713\n10757\n10769\n10791\n11012\n11269\n11300\n11332\n11407\n11466\n11470\n11496\n11498\n11597\n11670\n11872\n12082\n\n6503\n6667\n6689\n6654A\n6764\n6824\n\n6946\n7013\n7177\n\n(7)\n\nexposure time\ns\n(8)\n\nseeing\n\"\n(9)\n\nMar, 24 2004\nMar, 04 2003\nMar, 18 2004\nApr, 28 2003\nApr, 29 2003\nApr, 26 2003\nApr, 27 2003\nSep, 04 2002\nJun, 17 2002\nJun, 17 2002\nJun, 15 2002\nSep, 06 2002\nJun, 17 2002\nSep, 05 2002\nSep, 10 2002\nSep, 11 2002\nJun, 16 2002\nSep, 06 2002\nJun, 18 2002\nOct, 25 2003\nJun, 14 2002\nSep, 11 2002\nSep, 10 2002\nSep, 02 2002\n\n5280\n8400\n5760\n2400\n5280\n2880\n3120\n5040\n5280\n5280\n6000\n5040\n3840\n5040\n7200\n6480\n5040\n3600\n5520\n8400\n5280\n7440\n7200\n7440\n\n6.9\n4.3\n3.2\n3.0\n3.9\n3.2\n4.1\n2.4\n2.4\n2.1\n2.6\n2.6\n2.3\n3.7\n5.5\n2.6\n2.3\n2.2\n1.9\n4.3\n2.4\n2.7\n4.7\n2.8\n\n(1) Name of the galaxy in the UGC catalog except for NGC 542, IC 476, IC 2542 and NGC 5296 that do not have UGC name. (2)\nName in the NGC catalog when available. (3&4) Coordinates (in 2000) of the center of the galaxy used for the kinematic study except\nthose in italic (taken from HyperLeda). (5) Central wavelength of the interference filter used. (6) FWHM of the interference filter. (7)\nDate of the observations. (8) Total exposure time in second. (9) Seeing in arcsec.\n\n\f34\n\nB. Epinat et al.\n\nTable C2. Model parameters.\nN◦\nUGC\n(1)\n12893\n89\n94\n1013\nNGC 542\n1317\n1437\n1655\n1810\n3056\n3334\n3382\n3463\n3521\n3528\n3618\n3685\n3708\n3709\n3826\n3740\n3876\n3915\nIC 476\n4026\n4165\n4256\n4393\n4422\n4456\n4555\n4770\n4820\n5045\n5175\n5228\n5251\n5279\n5319\n5351\n5373\n5398\nIC 2542\n5510\n5532\n5556\n5786\n5840\n5842\n6118\n6277\n6419\n6521\n6523\n6787\n7021\n7045\n7154\n7429\n\nVsys Leda\nkm s−1\n(2)\n1102±7\n4564±3\n4592±4\n5190±4\n4660±8\n3111±5\n4893±4\n5340±16\n7556±21\n-100±7\n3934±4\n4497±6\n2692±4\n4426±7\n4421±18\n5851±6\n1796±4\n5201±26\n5223±50\n1733±3\n2417±6\n860±7\n4679±7\n4734±32\n4782±11\n515±4\n5252±5\n2126±5\n4333±4\n5497±23\n4235±6\n7063±9\n1355±4\n7716±23\n3052±11\n1873±7\n1481±3\n1488±4\n2448±9\n1473±4\n302±3\n14±5\n6113±20\n1301±3\n2812±8\n1581±3\n990±3\n582±4\n1261±10\n1539±5\n1192±3\n1365±24\n5879±5\n5913±13\n1173±3\n1979±8\n770±6\n1011±28\n1476±24\n\nVsys F P\nkm s−1\n(3)\n1097±2\n4510±5\n4548±2\n\n3090±2\n4858±2\n5427±7\n\n3952±13\n4489±2\n2679±3\n4415±2\n4340±5\n1795±1\n5161±4\n5292±4\n1724±2\n2416±2\n854±2\n4659±3\n4767±3\n4892±3\n504±1\n5252±3\n2119±4\n4321±2\n5470±1\n4235±2\n7026±3\n1350±2\n7667±2\n3049±2\n1869±2\n1465±3\n2439±1\n291±2\n6111±2\n1298±2\n2802±1\n992±4\n580±1\n1245±1\n1525±2\n1191±3\n1381±2\n5842±2\n5947±2\n1157±3\n1976±3\n758±1\n1009±1\n\nRes\n10−3 km s−1\n(8)\n\nσres\nkm s−1\n(9)\n\nχ2red\n\n177±4\n94±2\n\n-28.1\n42.5\n-3.9\n\n8\n23\n13\n\n1.2\n8.6\n2.7\n\n106±1\n127# ±2\n138# ±6\n\n-1.3\n-0.8\n-2744.9\n\n15\n18\n30\n\n3.3\n5.2\n15.4\n\n97# ±6\n6# ±2\n110±2\n78# ±3\n43# ±4\n\n9.9\n-11.5\n-0.1\n3.2\n-17.8\n\n54\n16\n15\n16\n32\n\n46.0\n4.1\n3.6\n4.1\n17.6\n\n118# ±4\n50# ±4\n52# ±2\n74# ±5\n67# ±4\n178# ±3\n30±2\n68±6\n139±2\n85# ±2\n111# ±6\n70# ±7\n36±2\n124±3\n90±2\n98# ±3\n157±2\n148±2\n143±2\n120±2\n80# ±3\n\n-1.3\n-11.6\n-4.7\n135.4\n<0.1\n-0.2\n6.8\n-5.9\n4.0\n-0.4\n15.9\n0.6\n-18.3\n7.3\n0.5\n-36.8\n<0.1\n-2.8\n-2.3\n-0.7\n<0.1\n\n9\n18\n18\n9\n11\n10\n13\n18\n19\n10\n26\n11\n20\n14\n15\n14\n13\n13\n13\n9\n15\n\n1.4\n5.4\n5.3\n1.2\n1.7\n1.6\n2.7\n5.5\n5.7\n1.6\n11.1\n1.7\n6.2\n3.1\n3.5\n3.0\n2.7\n2.7\n2.9\n1.3\n3.5\n\n165# ±2\n\n-21.0\n\n9\n\n1.3\n\n51±8\n\n-0.5\n\n8\n\n0.9\n\n174±3\n20# ±3\n147±1\n\n-0.9\n-0.3\n<0.1\n\n20\n10\n14\n\n6.3\n1.4\n2.9\n\n153±5\n153# ±3\n112# ±2\n163# ±3\n76±3\n34±7\n20±2\n173# ±3\n112±2\n86# ±2\n99±2\n95# ±2\n\n-574.4\n<0.1\n-1.5\n16.3\n-5.1\n-1.8\n-0.9\n-6.4\n-0.7\n-0.6\n0.2\n<0.1\n\n18\n12\n10\n11\n19\n8\n17\n13\n17\n14\n10\n12\n\n4.9\n2.1\n1.7\n1.9\n5.7\n0.9\n4.5\n2.8\n4.4\n3.1\n1.5\n2.3\n\niM orph\n\niKin\n\nP.A.M orph\n\nP.A.Kin\n\n◦\n\n◦\n\n◦\n\n◦\n\n(4)\n\n(5)\n\n(6)\n\n(7)\n\n95±51\n174±24\n102±15\n68±5\n143±6\n105±5\n134±17\n\n77# ±5\n\n30±8\n40±4\n50±4\n80±3\n90\n75±4\n52±3\n45±9\n75±3\n65±7\n47±7\n21±10\n63±3\n61±3\n59±5\n49±5\n55±4\n16±24\n46±4\n30±9\n40±6\n61±3\n59±5\n40±5\n73±4\n21±9\n36±4\n50±5\n49±4\n28±6\n21±12\n36±9\n41±4\n41±4\n65±4\n82±2\n88±9\n90\n40±5\n82±6\n60±6\n40±10\n43±4\n38±5\n33±9\n75±2\n16±25\n18±14\n34±6\n27±7\n17±16\n57±5\n50±3\n24±7\n57±3\n56±4\n70±2\n64±3\n73±3\n\n19±19\n33±13\n42±5\n\n73±1\n47±4\n45±18∗\n\n47±14∗\n21±14\n63±3\n58±5\n42±12\n12±17\n44±16\n55±4\n20±19\n48±14\n59±5\n47±4\n55±24\n56±4\n41±10\n38±21\n50±9∗\n25±8\n9±14\n38±7\n20±13\n38±3\n16±9\n56±3\n72±2\n73±6\n30±9\n10±18\n20±15\n31±10\n32±3\n53±11\n18±11\n47±9\n39±8∗\n17±17∗\n66±19\n46±4\n24±14∗\n70±2\n56±7∗\n68±2\n65±3\n\n42±6\n120±12\n85±15\n302M /168P a ±61\n117±8\n76±12\n38±16\n171±16\n133±12\n136Ni ±90\n66±18\n1602M /85Ni ±34\n19±20\n178±9\n25±17\n102±30\n136±8\n74P a ±43\n26±23\n50±22\n12±17\n42±41\n1402M /78SDSS ±72\n54±30\n160±16\n136±21\n145±9\n122±4\n78±3\n83±4\n1252M /7P a ±19\n105±4\n110±12\n45±23\n173±21\n26±24\n150±27\n105±5\n18SDSS ±90\n104±24\n1502M /57P a ±32\n02M ±86\n27±15\n21±13\n36V a /12P a /51P a ±52\n108±10\n89±11\n101±5\n100±8\n162±7\n\n(10)\n\n\fGHASP : An Hα kinematic survey of spiral and irregular galaxies - VI.\n\n35\n\nTable C2 – continued\nN◦\nUGC\n(1)\n\nVsys Leda\nkm s−1\n(2)\n\n7699\n7766\n7831\n7853\n7861\n7876\n7901\n7985\n8334\n8403\nNGC 5296\n8709\n8852\n8863\n8898\n8900\n8937\n9013\n9179\n9219\n9248\n9358\n9363\n9406\n9465\n9576\n9736\n9866\n9943\n10075\n10521\n10652\n10713\n10757\n10769\n10791\n11012\n11269\n11300\n11332\n11407\n11466\n11470\n11496\n11498\n11597\n11670\n11872\n12082\n\n496±1\n814±3\n147±4\n537±4\n611±4\n955±8\n799±2\n653±3\n508±3\n969±4\n2243±3\n2407±13\n2023±17\n1796±7\n3464±10\n3466±11\n2968±9\n255±23\n302±2\n666±11\n3867±6\n1907±4\n1584±3\n2279±2\n1495±3\n1565±5\n3128±4\n427±4\n1958±4\n831±3\n852±2\n1092±26\n1073±4\n1168±8\n1230±13\n1328±6\n36±12\n2590±6\n488±3\n1569±25\n2412±4\n820±9\n3530±40\n2105±6\n3266±8\n46±3\n778±3\n1147±5\n803±2\n\nVsys F P\nkm s−1\n(3)\n807±1\n136±3\n530±2\n598±1\n944±1\n788±2\n642±2\n484±1\n975±2\n2254±2\n2405±3\n2075±1\n1789±4\n3448±2\n3511±3\n2961±5\n262±1\n293±2\n3865±2\n1912±3\n1577±1\n2281±2\n1485±2\n1555±2\n3135±2\n430±1\n1946±1\n827±1\n832±2\n1089±1\n1210±2\n1318±3\n25±1\n2563±6\n480±2\n2402±8\n826±3\n3546±5\n2115±2\n3284±4\n40±2\n776±3\n1140±1\n792±2\n\nσres\nkm s−1\n(9)\n\nχ2red\n\n(7)\n\nRes\n10−3 km s−1\n(8)\n\n143# ±2\n110# ±5\n37# ±4\n117# ±4\n164# ±3\n74# ±2\n96# ±3\n100±1\n121±2\n2±3\n150# ±2\n63±2\n38# ±7∗\n31±6\n161±2\n5# ±3\n164±4\n49±4\n\n<0.1\n<0.1\n12.8\n<0.1\n0.3\n<0.1\n-0.1\n-0.1\n-0.1\n-6.2\n0.1\n0.9\n-41.4\n41.5\n5.8\n2361.4\n1.8\n<0.1\n\n12\n9\n8\n11\n8\n12\n8\n11\n9\n4\n15\n10\n14\n7\n20\n19\n7\n9\n\n2.4\n1.2\n1.1\n1.9\n1.1\n2.2\n1.0\n1.7\n1.3\n0.3\n3.3\n1.5\n3.3\n0.7\n6.6\n5.7\n0.8\n1.4\n\n81# ±2\n2# ±2\n147±3\n132±12\n127±3\n122±3\n39# ±2\n148±2\n86# ±2\n30# ±1\n20±2\n45# ±3\n\n3.5\n2.3\n3.2\n78.0\n0.3\n-0.4\n2.9\n-5.1\n-0.1\n<0.1\n0.7\n0.6\n\n15\n15\n8\n11\n8\n10\n14\n7\n9\n9\n9\n8\n\n3.6\n3.5\n1.1\n2.0\n1.1\n1.6\n3.2\n0.8\n1.4\n1.4\n1.2\n1.0\n\n56±6\n\n0.7\n\n11\n\n1.8\n\n92±4\n119# ±2\n92# ±3\n167±3\n\n726.5\n0.4\n3.8\n<0.1\n\n10\n8\n30\n10\n\n1.7\n1.0\n14.4\n1.6\n\n65±10∗\n46# ±3\n47±3\n167±4\n71# ±2\n61# ±3\n153# ±2\n86±2\n143±5\n\n1.0\n-0.3\n258.0\n135.8\n-23.4\n0.4\n0.8\n-0.1\n0.6\n\n20\n13\n25\n9\n22\n13\n16\n13\n8\n\n6.6\n2.6\n10.7\n1.2\n7.9\n2.5\n3.9\n2.7\n1.1\n\niM orph\n\niKin\n\nP.A.M orph\n\nP.A.Kin\n\n◦\n\n◦\n\n◦\n\n◦\n\n(4)\n\n(5)\n\n(6)\n\n78±2\n65±4\n70±3\n58±5\n47±6\n44±5\n50±3\n24±12\n55±5\n54±3\n65±6\n82±3\n55±7\n77±4\n71±3\n66±5\n50±5\n50±4\n53±3\n81±6\n58±3\n62±3\n33±6\n51±7\n90\n52±4\n51±3\n69±3\n48±5\n66±3\n71±3\n30±7\n90\n59±3\n57±4\n0\n74±2\n60±3\n77±2\n82±2\n64±3\n55±3\n47±6\n0\n79±4\n17±19\n90\n54±6\n29±11\n\n69±3\n56±12\n58±28∗\n47±24∗\n53±9\n53±2\n49±6\n66±1\n57±4\n65±4\n76±1\n52±3\n77±13∗\n27±20\n57±10\n32±12\n21±16∗\n36±14\n58±4\n54±4\n18±14∗\n59±25\n65±4\n41±11\n51±5\n56±6\n54±2\n62±2\n59±3\n21±13\n44±22\n34±20∗\n72±2\n69±4\n76±4\n64±22∗\n66±5\n47±7\n44±16\n71±2\n40±10\n65±2\n47±3\n14±19\n\n32±4\n150±7\n125±5\n40±12\n116P a /30SDSS ±20\n3±22\n77±11\n1102M /87Ha /153P a /100Ni /88SDSS ±48\n102±11\n129±12\n12±15\n147±4\n65±16\n38±5\n302M /140P a /117SDSS ±7\n172±10\n177±16\n85±14\n33±11\n99±9\n86±12\n2±9\n107±27\n602M /150SDSS ±22\n143±9\n125±14\n57±13\n150±7\n87±14\n28±7\n17±7\n56±33\n8±4\n66±12\n41±16\n123±5\n97±12\n171±4\n65±3\n65±9\n35±13\n50±22\n75±7\n159±5\n88±13\n\n(1) Name in the UGC catalog (see table C1). (2) Systemic velocity found in HyperLeda data base. (3) Systemic velocity deduced from\nour velocity field analysis. (4) Morphological inclination from HyperLeda (Paturel et al. 1997). (5) Inclination deduced from the\nanalysis of our velocity field; those marked with an asterisk (∗ ) have been fixed equal to morphological value, except UGC 6118, UGC\n9013, UGC 9363 and UGC 10791 for which we used inclinations determined from HI data (see table C3). (6) Morphological position\nangle from HyperLeda, except for those marked (Ha: Haynes et al. 1999; N i: Nilson 1973; P a: Paturel et al. 2000; SDSS: 2006 Sloan\nDigital Sky Survey, DR5; 2M : Two Micron All Sky Survey team 2003, 2MASS extended objects; V a: Vauglin et al. 1999). (7) Position\nangle deduced from our velocity field; those marked with an asterisk (∗ ) have been fixed equal to morphological value. The symbol #\nindicates that the position angle refers to the approaching side. (8) Mean residual velocity on the whole velocity field. (9) Residual\nvelocity dispersion on the whole velocity field. (10) Reduced χ2 of the model.\n\n(10)\n\n\f36\n\nB. Epinat et al.\n\nTable C3. Galaxy parameters.\nN◦\nUGC\n(1)\n12893\n89\n94\n1013\nNGC 542\n1317\n1437\n1655\n1810\n3056\n3334\n3382\n3463\n3521\n3528\n3618\n3685\n3708\n3709\n3826\n3740\n3876\n3915\nIC 476\n4026\n4165\n4256\n4393\n4422\n4456\n4555\n4770\n4820\n5045\n5175\n5228\n5251\n5279\n5319\n5351\n5373\n5398\nIC 2542\n5510\n5532\n5556\n5786\n5840\n5842\n6118\n6277\n6419\n6521\n6523\n6787\n7021\n7045\n7154\n7429\n\nt\n(2)\n8.4±0.8\n1.2±0.6\n2.4±0.6\n3.1±0.2\n2.8±3.9\n4.9±0.7\n4.9±1.0\n1.0±0.5\n3.1±0.6\n9.6±1.2\n4.2±1.0\n1.0±0.4\n4.7±0.9\n4.8±1.8\n2.0±0.3\n2.0±0.3\n3.0±0.4\n4.5±1.7\n5.7±1.6\n6.5±0.8\n5.4±0.6\n6.5±0.8\n4.6±1.6\n4.2±2.6\n2.0±0.4\n6.9±0.4\n5.2±0.6\n4.6±1.3\n4.9±0.6\n5.2±0.6\n4.0±0.6\n1.1±0.6\n1.7±0.8\n5.0±0.5\n3.2±0.7\n4.9±0.5\n4.3±0.8\n9.7±1.1\n5.3±0.6\n2.1±0.6\n9.9±0.3\n7.9±3.8\n4.6±1.3\n4.6±1.0\n3.9±0.6\n5.0±0.8\n4.0±0.1\n4.0±0.3\n6.0±0.4\n2.1±0.6\n5.1±0.5\n8.9±0.9\n3.7±0.9\n1.4±1.1\n1.7±0.8\n1.3±0.8\n5.3±0.6\n6.9±0.4\n2.4±0.7\n\nType\n(3)\nSd\nSBa\nS(r)ab\nSB(r)b pec\nSb pec\nSAB(r)c\nSABc\nSa\nSb pec\nIB\nSABb\nSB(r)a\nSABc\nSc\nSBab\nSab\nSB(r)b\nSbc pec\nSc\nSABc\nSAB(r)c pec\nScd\nSBc\nSABb\nSab\nSBcd\nSABc\nSBc\nSAB(r)c\nS(r)c\nSABb\nSBa\nS(r)ab\nSAB(r)c\nSb\nSBc\nSBbc pec\nIB\nSB(r)c\nSABa\nIB\nSd\nSBc\nSAB(r)c\nSbc\nSBc pec\nSAB(r)b\nSB(r)bc\nSBc\nSB(r)ab\nSABc\nSBm\nS(r)bc\nSa\nSab\nSAB(r)a\nSABc\nSBcd\nSB(r)ab\n\nD\nMpc\n(4)\n\nMb\nmag\n(5)\n\nb/a\n(6)\n\n12.5J a\n\n-15.5\n-21.5\n-20.4\n-22.0\n-19.5\n-21.5\n-21.8\n-21.6\n-22.2\n-18.7\n-22.8\n-20.4\n-20.7\n-19.8\n-20.1\n-20.9\n-19.7\n-20.7\n-21.5\n-17.9\n-19.8\n-17.4\n-21.4\n-19.0\n-20.8\n-18.2\n-21.6\n-19.3\n-21.1\n-20.8\n-20.9\n-21.3\n-20.3\n-21.2\n-20.6\n-19.9\n-20.5\n-19.0\n-19.7\n-19.4\n-14.3\n-17.8\n-20.5\n-19.3\n-22.1\n-18.9\n-19.6\n-18.9\n-18.8\n-20.0\n-19.5\n-18.6\n-21.2\n-21.0\n-20.5\n-19.7\n-19.2\n-20.0\n-19.8\n\n0.89±0.06\n0.79±0.04\n0.68±0.04\n0.31±0.03\n0.22±0.03\n0.33±0.04\n0.63±0.03\n0.75±0.09\n0.36±0.02\n0.57±0.06\n0.70±0.07\n0.94±0.05\n0.49±0.03\n0.52±0.03\n0.58±0.06\n0.70±0.05\n0.61±0.04\n0.96±0.11\n0.71±0.05\n0.87±0.07\n0.78±0.06\n0.50±0.03\n0.55±0.06\n0.78±0.05\n0.41±0.03\n0.94±0.05\n0.82±0.04\n0.66±0.05\n0.68±0.04\n0.89±0.04\n0.94±0.07\n0.83±0.07\n0.79±0.04\n0.76±0.04\n0.48±0.05\n0.25±0.02\n0.22±0.01\n0.27±0.02\n0.77±0.05\n0.32±0.04\n0.62±0.05\n0.81±0.08\n0.75±0.04\n0.80±0.05\n0.85±0.08\n0.32±0.02\n0.96±0.11\n0.95±0.07\n0.83±0.05\n0.90±0.05\n0.96±0.07\n0.65±0.04\n0.67±0.03\n0.92±0.04\n0.60±0.03\n0.62±0.04\n0.39±0.03\n0.46±0.03\n0.40±0.03\n\n64.2M o\n64.2M o\n70.8\n63.7\n42.2\n66.8\n73.0\n102.4\n2.5Oc\n55.6\n62.8\n38.6\n62.6\n61.8\n80.0\n26.3J a\n70.0\n70.7\n25.7J a\n17.1Sh\n14.5J a\n63.6\n63.9\n64.7\n11.0M o\n71.7\n31.5J a\n58.1\n74.0\n58.0\n95.9\n17.1Sh\n105.1\n44.1\n24.7\n21.5\n21.3\n35.8\n19.3Sh\n1.4Ka\n3.8Ka\n83.4\n18.6\n41.1\n22.2\n14.2Sh\n6.9Ka\n15.2Sh\n19.8Sh\n16.9\n18.8\n78.6\n80.0\n18.9\n26.8\n11.4M o\n16.2\n23.7\n\nib/a\n(7)\n\nD25 /2\n\"/kpc\n(8)\n\nVmax\nkm s−1\n(9)\n\nVmax\nflag\n(10)\n\n27±7\n38±3\n47±3\n72±2\n77±2\n71±2\n51±2\n42±8\n69±1\n55±4\n45±6\n20±9\n61±2\n59±2\n55±4\n46±4\n52±3\n15±23\n45±4\n29±8\n39±5\n60±2\n57±4\n39±5\n66±2\n20±8\n35±4\n49±4\n47±3\n27±5\n20±11\n34±8\n38±4\n40±4\n61±3\n76±1\n77±1\n74±1\n39±4\n71±2\n52±4\n36±8\n42±4\n37±5\n32±8\n71±1\n15±23\n17±13\n34±5\n26±7\n17±15\n50±3\n48±2\n23±7\n53±2\n52±3\n67±2\n63±2\n67±2\n\n34±5/2.1±0.3\n46±4/14.5±1.4\n34±3/10.5±0.8\n88±6/30.1±2.0\n34±6/10.4±1.7\n114±7/23.4±1.5\n43±5/13.8±1.7\n86±10/30.3±3.5\n52±4/26.0±2.0\n119±9/1.4±0.1\n132±8/35.7±2.2\n38±4/11.5±1.1\n66±4/12.4±0.8\n35±4/10.7±1.1\n41±5/12.2±1.6\n44±4/16.9±1.4\n57±4/7.3±0.5\n25±6/8.3±2.0\n35±3/12.1±1.1\n98±9/12.2±1.2\n67±5/5.5±0.4\n57±4/4.0±0.3\n34±6/10.3±1.7\n18±3/5.7±0.8\n43±4/13.5±1.2\n74±5/3.9±0.2\n50±4/17.3±1.3\n44±7/6.7±1.1\n51±5/14.4±1.4\n31±3/11.0±1.1\n45±5/12.7±1.4\n48±5/22.3±2.3\n127±6/10.6±0.5\n35±3/18.0±1.5\n62±5/13.2±1.1\n68±5/8.2±0.6\n142±7/14.8±0.7\n67±5/6.9±0.5\n47±3/8.2±0.6\n62±3/5.8±0.3\n148±10/1.0±0.1\n162±13/3.0±0.2\n31±3/12.4±1.2\n64±6/5.8±0.5\n122±10/24.2±1.9\n67±4/7.2±0.4\n54±6/3.7±0.4\n200±10/6.7±0.3∗\n79±5/5.8±0.4\n74±5/7.1±0.4\n106±9/8.7±0.7\n44±4/4.0±0.4\n50±3/19.1±1.2\n32±3/12.5±1.3\n104±6/9.5±0.5\n77±5/10.0±0.6\n124±6/6.9±0.3\n139±9/10.9±0.7\n73±5/8.4±0.6\n\n72±67\n343±117\n209±21\n\n2\n1\n1\n\n125±8P V\n205±9\n218±15\n205±64\n\n2\n1\n1\n4\n\n◦\n\nHI data\n(11)\nWN05\nWN05\nWW eb\nWW eb\nWW eb\nWW eb\n\n377±85\n322±207\n168±9\n167±12\n276±66\n\n1\n2\n1\n3\n2\n\nWW eb\nWN05\n\n133±177\n235±69\n241±14\n74±66\n87±20\n112±10\n205±16\n71±22\n285±14\n80±18\n123±59\n47±10\n354±95\n212±321\n185±30\n330±195\n337±20\n429±228\n188±10\n125±9\n125±9\n110±8P V\n180±47\n135±8P V\n90±162\n\n3\n1\n1\n1\n2\n2\n1\n3\n2\n1\n1\n4\n1\n1\n1\n3\n1\n1\n1\n1\n3\n1\n2\n1\n2\n\nWW eb\n\n290±192\n167±44\n398±24\n\n2\n1\n1\n\n80±15\n251±138\n115±18\n137±24\n268±257\n53±11\n249±18\n118±63\n232±11\n223±18\n160±9\n145±9\n\n3\n1\n2\n1\n2\n3\n1\n4\n2\n1\n1\n1\n\nWW eb\nWW eb\n\nWW eb\nWW eb\n\nWW eb\n\nWN05\n\nWW eb\nWW eb\nWW eb\nWW eb\nWN05\nVK00\nVW 04\n\nWN05\n\nWW eb\n\n\fGHASP : An Hα kinematic survey of spiral and irregular galaxies - VI.\n\n37\n\nTable C3 – continued\nN◦\nUGC\n(1)\n\n(2)\n\n7699\n7766\n7831\n7853\n7861\n7876\n7901\n7985\n8334\n8403\nNGC 5296\n8709\n8852\n8863\n8898\n8900\n8937\n9013\n9179\n9219\n9248\n9358\n9363\n9406\n9465\n9576\n9736\n9866\n9943\n10075\n10521\n10652\n10713\n10757\n10769\n10791\n11012\n11269\n11300\n11332\n11407\n11466\n11470\n11496\n11498\n11597\n11670\n11872\n12082\n\n6.0±0.6\n6.0±0.4\n4.9±0.4\n8.6±1.1\n8.8±0.7\n6.5±0.9\n5.2±0.6\n6.9±0.5\n4.0±0.2\n5.8±0.6\n-1.1±0.8\n4.9±0.8\n2.3±0.6\n1.1±0.4\n3.1±0.6\n3.2±0.6\n3.1±0.4\n6.0±0.3\n6.9±0.4\n9.7±1.4\n3.1±0.5\n3.3±0.8\n6.9±0.4\n6.9±0.4\n7.9±0.9\n6.9±0.4\n5.0±0.7\n4.0±0.3\n5.0±0.6\n6.0±0.4\n4.9±0.7\n3.8±2.6\n3.0±0.4\n6.0±0.4\n3.0±0.5\n8.8±0.5\n5.9±0.7\n2.0±0.5\n6.4±0.9\n7.0±0.5\n3.6±0.6\n4.8±1.9\n2.2±0.6\n8.8±0.5\n3.1±0.7\n5.9±0.3\n0.5±1.0\n2.5±0.5\n8.7±0.8\n\nt\n\nType\n\nMb\nmag\n(5)\n\nb/a\n\n(3)\n\nD\nMpc\n(4)\n\n(6)\n\nSBc\nSBc\nSBc\nSBm\nSAB(r)m pec\nSABc\nSc pec\nSBcd\nSbc\nSBc\nS0-a\nSABc pec\nSAB(r)a\nSBa\nSBb pec\nSb pec\nSBb\nSc pec\nSABc\nIB\nSb\nSABb\nS(r)cd\nSB(r)cd\nSABd\nSABc pec\nSABc\nS(r)bc\nSB(r)c\nSc\nSc\nS(r)bc\nSb\nSc\nSABb\nSABm\nSc\nSABa\nSABc\nSBcd\nSBbc\nSc\nSab\nSm\nSBb\nSABc\nS(r)a\nSAB(r)b\nSABm\n\n9.3\n13.0\n5.2Ka\n8.9M o\n10.2M o\n14.5\n20.7Sh\n13.7M o\n9.8\n19.1J a\n32.8\n35.0\n30.6\n25.5Ko\n49.0\n49.2\n49.0M o\n7.2Ka\n5.7Ka\n10.2J a\n54.9\n29.1\n22.3\n33.8\n26.4J a\n27.4J a\n45.4\n7.4J a\n28.0\n14.7J a\n18.0M o\n18.2\n18.3\n19.5\n20.0\n21.7\n5.3Ka\n35.0J a\n8.4J a\n23.0J a\n35.8\n14.2\n50.8\n31.9\n44.9\n5.9Ka\n12.8\n18.1Ko\n10.1J a\n\n-17.6\n-21.0\n-18.5\n-18.9\n-17.3\n-17.9\n-20.6\n-18.7\n-21.1\n-19.2\n-18.2\n-21.4\n-20.0\n-20.3\n-20.5\n-21.7\n-21.1\n-18.2\n-17.8\n-16.6\n-20.2\n-20.8\n-19.8\n-19.0\n-18.0\n-19.6\n-20.6\n-17.2\n-20.7\n-19.9\n-20.2\n-17.7\n-19.0\n-17.7\n-17.0\n-16.7\n-18.7\n-19.9\n-17.8\n-19.5\n-20.8\n-18.5\n-21.3\n\n0.28±0.01\n0.46±0.05\n0.39±0.03\n0.64±0.05\n0.75±0.05\n0.72±0.05\n0.66±0.03\n0.92±0.08\n0.61±0.06\n0.61±0.04\n0.58±0.04\n0.24±0.02\n0.62±0.08\n0.39±0.03\n0.41±0.03\n0.47±0.06\n0.67±0.06\n0.66±0.04\n0.61±0.03\n0.44±0.03\n0.57±0.03\n0.52±0.03\n0.84±0.05\n0.64±0.08\n0.40±0.03\n0.63±0.05\n0.65±0.03\n0.41±0.03\n0.69±0.05\n0.44±0.04\n0.38±0.03\n0.87±0.05\n0.19±0.02\n0.53±0.04\n0.59±0.04\n1.00±0.13\n0.33±0.03\n0.56±0.04\n0.28±0.01\n0.21±0.01\n0.49±0.03\n0.59±0.03\n0.71±0.07\n1.00±0.13\n0.32±0.04\n0.96±0.09\n0.33±0.03\n0.63±0.07\n0.90±0.07\n\n-20.5\n-20.6\n-19.4\n-20.0\n-16.4\n\nib/a\n(7)\n\nD25 /2\n\"/kpc\n(8)\n\nVmax\nkm s−1\n(9)\n\nVmax\nflag\n(10)\n\n74±1\n63±3\n67±2\n50±3\n41±4\n44±4\n49±3\n23±11\n53±4\n52±3\n54±3\n76±1\n52±6\n67±2\n66±2\n62±4\n48±4\n49±3\n52±2\n64±2\n55±2\n59±2\n33±6\n50±6\n67±2\n51±4\n49±2\n65±2\n46±4\n64±3\n68±2\n29±6\n79±1\n58±2\n54±3\n0±0\n71±2\n56±3\n74±1\n78±1\n61±2\n54±2\n45±5\n0±0\n71±2\n16±18\n71±2\n51±5\n26±10\n\n108±6/4.9±0.3\n317±15/20.0±1.0∗\n177±8/4.5±0.2\n106±6/4.6±0.3\n41±4/2.0±0.2\n58±7/4.1±0.5\n115±6/11.6±0.6\n51±5/3.4±0.3\n356±20/16.9±1.0\n90±6/8.3±0.6\n28±3/4.5±0.5\n112±7/19.0±1.1\n77±9/11.4±1.3\n108±5/13.4±0.6\n79±6/18.7±1.3\n75±8/17.8±1.8\n69±6/16.4±1.4\n72±5/2.5±0.2\n128±8/3.5±0.2\n49±4/2.4±0.2\n40±4/10.6±1.0\n94±6/13.3±0.9\n57±5/6.2±0.5\n44±8/7.3±1.3\n23±3/3.0±0.4\n51±4/6.8±0.6\n71±4/15.7±1.0\n55±4/2.0±0.1\n82±5/11.1±0.7\n174±9/12.4±0.7\n106±9/9.3±0.7\n33±3/2.9±0.3\n54±7/4.8±0.7\n36±4/3.4±0.4\n28±3/2.7±0.3\n56±9/5.9±0.9\n185±11/4.7±0.3\n56±5/9.5±0.8\n99±5/4.0±0.2\n63±5/7.1±0.5\n75±6/13.0±1.0\n45±4/3.1±0.3\n72±9/17.8±2.2\n57±9/8.9±1.3\n84±9/18.2±1.9\n342±14/9.8±0.4∗\n125±7/7.7±0.4\n85±6/7.4±0.5\n81±9/3.9±0.4\n\n92±8P V\n120±9\n92±15\n110±35\n50±21\n98±14\n215±10\n112±13\n214±9\n128±10\n80±9\n207±9\n187±10\n193±13\n65±45\n346±37\n320±105\n62±45\n111±36\n45±8P V\n166±11\n221±14\n143±105\n19±10\n97±9\n104±25\n193±16\n116±11\n185±10\n168±9\n124±9\n141±82\n105±8P V\n81±33\n\n1\n1\n2\n3\n3\n2\n1\n1\n1\n1\n3\n1\n3\n2\n4\n2\n1\n2\n3\n2\n1\n1\n1\n4\n1\n1\n1\n2\n1\n1\n1\n2\n2\n3\n\n96±49\n117±9\n202±13\n114±9\n91±8P V\n159±31\n133±10\n380±40\n96±29\n273±9\n154±32\n190±9\n183±12\n105±137\n\n3\n1\n1\n2\n3\n1\n1\n2\n2\n1\n3\n1\n1\n3\n\n◦\n\nHI data\n(11)\nWW eb\nWW eb\nWW eb\nWW eb\n\nWW eb\nWW eb\nWW eb\nWN05\nWW eb\nWW eb\nVR94\n\nVS96\n\nVI94\n\nWW eb\nWW eb\nWW eb\nWW eb\nWN05\nWW eb\nVW 01\nWW eb\nWW eb\n\nWN05\nWW eb\n\n(1) Name of the galaxy in the UGC catalog (see table C1). (2) Morphological type from the de Vaucouleurs classification\n(de Vaucouleurs 1979) in HyperLeda data base. (3) Morphological type from HyperLeda data base. (4) Distance D, deduced from the\nsystemic velocity taken in NED corrected from Virgo infall, assuming Ho = 75 km s−1 Mpc−1 , except for those marked (Ja:\nJames et al. 2004; Ka: Karachentsev et al. 2004; Ko: Koopmann et al. 2006; M o: Moustakas & Kennicutt 2006; Oc: O'Connell et al.\n1994; Sh: Shapley et al. 2001). (5) Absolute B magnitude from D and apparent corrected B magnitude (HyperLeda). (6) Axis ratio\nfrom HyperLeda. (7) Inclination derived from the axis ratio (arccos b/a). (8) Isophotal radius at the limiting surface brightness of 25 B\nmag/sq arcsec, from HyperLeda (Paturel et al. 1991) in arcsecond and kpc adopting the distance given in column 4; an asterisk (∗ )\nindicates that the galaxy is larger than GHASP field of view. (9) Maximum velocity, Vmax , derived from the fit of the velocity field\ndiscussed in section 3.2, or from the position-velocity diagram (marked with P V ). (10) Quality flag on Vmax (1: reached; 2: probably\nreached; 3 probably not reached; 4: not reached). (11) Aperture synthesis HI data references: W for WHISP data (S02: Swaters et al.\n2002; N 05: Noordermeer et al. 2005; web: http://www.astro.rug.nl/~ whisp); V for VLA data (I94: Irwin 1994; R94: Rownd et al.\n1994; S96: Schulman et al. 1996; K00: Kornreich et al. 2000; W 01: Wilcots et al. 2001; W 04: Wilcots & Prescott 2004).\n\n\f38\n\nB. Epinat et al.\n\nAPPENDIX D: INDIVIDUAL MAPS AND\nPOSITION-VELOCITY DIAGRAMS\n\n\fGHASP : An Hα kinematic survey of spiral and irregular galaxies - VI.\n\n39\n\nFigure D19. UGC 3740. Top left: XDSS Blue Band image. Top right: Hα velocity field. Middle left: Hα monochromatic image.\nMiddle right: Hα residual velocity field. The white & black cross is the kinematical center. The black line is the major axis, its length\nrepresents the D25 . Bottom: Position-velocity diagram along the major axis (full width of 7 pixels), arbitrary flux units. The red line plots\nthe rotation curve computed from the model velocity field along the major axis (full width of 7 pixels).\n\n\f40\n\nB. Epinat et al.\n\nFigure D31. UGC 4820. Top left: XDSS Blue Band image. Top right: Hα velocity field. Middle left: Hα monochromatic image.\nMiddle right: Hα residual velocity field. The white & black cross is the kinematical center. The black line is the major axis, its length\nrepresents the D25 . Bottom: Position-velocity diagram along the major axis (full width of 7 pixels), arbitrary flux units. The red line plots\nthe rotation curve computed from the model velocity field along the major axis (full width of 7 pixels).\n\n\fGHASP : An Hα kinematic survey of spiral and irregular galaxies - VI.\n\n41\n\nFigure D45. UGC 5786. Top left: XDSS Blue Band image. Top right: Hα velocity field. Middle left: Hα monochromatic image.\nMiddle right: Hα residual velocity field. The white & black cross is the kinematical center. The black line is the major axis, its length\nrepresents the D25 . Bottom: Position-velocity diagram along the major axis (full width of 7 pixels), arbitrary flux units. The red line plots\nthe rotation curve computed from the model velocity field along the major axis (full width of 7 pixels).\n\n\f42\n\nB. Epinat et al.\n\nFigure D56. UGC 7154. Top left: XDSS Blue Band image. Top right: Hα velocity field. Middle left: Hα monochromatic image.\nMiddle right: Hα residual velocity field. The white & black cross is the kinematical center. The black line is the major axis, its length\nrepresents the D25 . Bottom: Position-velocity diagram along the major axis (full width of 7 pixels), arbitrary flux units. The red line plots\nthe rotation curve computed from the model velocity field along the major axis (full width of 7 pixels).\n\n\fGHASP : An Hα kinematic survey of spiral and irregular galaxies - VI.\nAPPENDIX E: ROTATION CURVES\n\n43\n\n\f44\n\nB. Epinat et al.\n\nFigure E1. From top left to bottom right: Hα rotation curve of UGC 12893, UGC 89, UGC 94, UGC 1317, UGC 1437, and UGC 1655.\n\n\fGHASP : An Hα kinematic survey of spiral and irregular galaxies - VI.\n\n45\n\nFigure E2. From top left to bottom right: Hα rotation curve of UGC 3334, UGC 3382, UGC 3463, UGC 3521, UGC 3528, and UGC 3685.\n\n\f46\n\nB. Epinat et al.\n\nFigure E3. From top left to bottom right: Hα rotation curve of UGC 3708, UGC 3709, UGC 3826, UGC 3740, UGC 3876, and UGC 3915.\n\n\fGHASP : An Hα kinematic survey of spiral and irregular galaxies - VI.\n\n47\n\nFigure E4. From top left to bottom right: Hα rotation curve of IC 476, UGC 4026, UGC 4165, UGC 4256, UGC 4393, and UGC 4422.\n\n\f48\n\nB. Epinat et al.\n\nFigure E5. From top left to bottom right: Hα rotation curve of UGC 4456, UGC 4555, UGC 4770, UGC 4820, UGC 5045, and UGC 5175.\n\n\fGHASP : An Hα kinematic survey of spiral and irregular galaxies - VI.\n\n49\n\nFigure E6. From top left to bottom right: Hα rotation curve of UGC 5228, UGC 5251, UGC 5319, UGC 5373, IC 2542, and UGC 5510.\n\n\f50\n\nB. Epinat et al.\n\nFigure E7. From top left to bottom right: Hα rotation curve of UGC 5532, UGC 5786, UGC 5840, UGC 5842, UGC 6118, and UGC 6277.\n\n\fGHASP : An Hα kinematic survey of spiral and irregular galaxies - VI.\n\n51\n\nFigure E8. From top left to bottom right: Hα rotation curve of UGC 6419, UGC 6521, UGC 6523, UGC 6787, UGC 7021, and UGC 7045.\n\n\f52\n\nB. Epinat et al.\n\nFigure E9. From top left to bottom right: Hα rotation curve of UGC 7154, UGC 7766, UGC 7831, UGC 7853, UGC 7861, and UGC 7876.\n\n\fGHASP : An Hα kinematic survey of spiral and irregular galaxies - VI.\n\n53\n\nFigure E10. From top left to bottom right: Hα rotation curve of UGC 7901, UGC 7985, UGC 8334, UGC 8403, NGC 5296, and UGC\n8709.\n\n\f54\n\nB. Epinat et al.\n\nFigure E11. From top left to bottom right: Hα rotation curve of UGC 8852, UGC 8863, UGC 8898, UGC 8900, UGC 8937, and UGC\n9013.\n\n\fGHASP : An Hα kinematic survey of spiral and irregular galaxies - VI.\n\n55\n\nFigure E12. From top left to bottom right: Hα rotation curve of UGC 9179, UGC 9248, UGC 9358, UGC 9363, UGC 9406, and UGC\n9465.\n\n\f56\n\nB. Epinat et al.\n\nFigure E13. From top left to bottom right: Hα rotation curve of UGC 9576, UGC 9736, UGC 9866, UGC 9943, UGC 10075, and UGC\n10521.\n\n\fGHASP : An Hα kinematic survey of spiral and irregular galaxies - VI.\n\n57\n\nFigure E14. From top left to bottom right: Hα rotation curve of UGC 10652, UGC 10757, UGC 10791, UGC 11012, UGC 11269, and\nUGC 11300.\n\n\f58\n\nB. Epinat et al.\n\nFigure E15. From top left to bottom right: Hα rotation curve of UGC 11407, UGC 11466, UGC 11470, UGC 11496, UGC 11498, and\nUGC 11597.\n\n\fGHASP : An Hα kinematic survey of spiral and irregular galaxies - VI.\n\nFigure E16. From top left to bottom right: Hα rotation curve of UGC 11670, UGC 11872, UGC 12082.\n\n59\n\n\f60\n\nB. Epinat et al.\n\nAPPENDIX F: ROTATION CURVES TABLES\n\n\fGHASP : An Hα kinematic survey of spiral and irregular galaxies - VI.\n\n61\n\nTable F1. UGC 12893 rotation curve\nr (kpc)\n(1)\n\nσr (kpc)\n(2)\n\nr (\")\n(3)\n\nσr (\")\n(4)\n\nv ( km s−1 )\n(5)\n\nσv ( km s−1 )\n(6)\n\nN bins\n(7)\n\nside\n(8)\n\n0.28\n0.36\n0.43\n1.33\n1.37\n2.22\n\n0.00\n0.00\n0.00\n0.64\n0.41\n0.12\n\n4.6\n5.9\n7.1\n21.9\n22.6\n36.6\n\n0.0\n0.0\n0.0\n10.6\n6.8\n2.0\n\n35\n13\n66\n64\n67\n84\n\n7\n7\n7\n7\n6\n5\n\n1\n1\n1\n22\n22\n9\n\nr\na\na\nr\na\na\n\n(1), (3) Galactic radius. (2), (4) Dispersion around the galactic radius. (5) Rotation velocity. (6) Dispersion on the rotation velocity. (7)\nNumber of velocity bins. (8) Receding – r – or approaching – a – side.\nTable F2. UGC 89 rotation curve\nr (kpc)\n(1)\n\nσr (kpc)\n(2)\n\nr (\")\n(3)\n\nσr (\")\n(4)\n\nv ( km s−1 )\n(5)\n\nσv ( km s−1 )\n(6)\n\nN bins\n(7)\n\nside\n(8)\n\n0.29\n0.32\n0.63\n0.67\n1.04\n1.04\n1.38\n1.44\n1.80\n1.82\n2.20\n2.22\n2.60\n2.70\n3.09\n3.11\n3.32\n3.80\n3.90\n4.37\n4.76\n5.02\n5.22\n5.71\n5.84\n6.27\n6.67\n7.03\n7.60\n8.73\n9.26\n\n0.10\n0.03\n0.11\n0.09\n0.13\n0.11\n0.09\n0.11\n0.12\n0.11\n0.11\n0.11\n0.13\n0.09\n0.11\n0.08\n0.20\n0.49\n0.15\n0.13\n0.11\n0.26\n0.14\n0.11\n0.22\n0.19\n0.32\n0.32\n0.22\n0.79\n1.05\n\n0.9\n1.0\n2.0\n2.2\n3.3\n3.3\n4.4\n4.6\n5.8\n5.8\n7.1\n7.1\n8.4\n8.7\n9.9\n10.0\n10.7\n12.2\n12.5\n14.0\n15.3\n16.1\n16.8\n18.3\n18.8\n20.1\n21.4\n22.6\n24.4\n28.0\n29.8\n\n0.3\n0.1\n0.4\n0.3\n0.4\n0.4\n0.3\n0.4\n0.4\n0.4\n0.4\n0.4\n0.4\n0.3\n0.4\n0.3\n0.6\n1.6\n0.5\n0.4\n0.4\n0.8\n0.4\n0.4\n0.7\n0.6\n1.0\n1.0\n0.7\n2.5\n3.4\n\n137\n192\n304\n198\n305\n340\n370\n338\n317\n368\n342\n281\n317\n277\n298\n331\n315\n324\n318\n318\n309\n318\n324\n297\n328\n310\n356\n337\n392\n353\n383\n\n16\n17\n14\n12\n25\n11\n16\n5\n24\n10\n12\n12\n11\n7\n12\n18\n7\n10\n8\n5\n4\n9\n5\n9\n7\n9\n7\n5\n6\n11\n6\n\n4\n2\n11\n5\n11\n14\n7\n13\n8\n8\n7\n9\n3\n11\n10\n5\n23\n23\n23\n23\n23\n23\n23\n23\n23\n23\n23\n23\n23\n20\n23\n\na\nr\nr\na\na\nr\na\nr\na\nr\nr\na\nr\na\na\nr\na\nr\na\na\na\nr\na\nr\na\nr\na\nr\na\nr\na\n\n(1), (3) Galactic radius. (2), (4) Dispersion around the galactic radius. (5) Rotation velocity. (6) Dispersion on the rotation velocity. (7)\nNumber of velocity bins. (8) Receding – r – or approaching – a – side.\n\n\f"}