{"id": "http://arxiv.org/abs/1109.1985v1", "guidislink": true, "updated": "2011-09-09T12:51:28Z", "updated_parsed": [2011, 9, 9, 12, 51, 28, 4, 252, 0], "published": "2011-09-09T12:51:28Z", "published_parsed": [2011, 9, 9, 12, 51, 28, 4, 252, 0], "title": "Isolated Millimeter Flares of Cyg X-3", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1109.2383%2C1109.4809%2C1109.6717%2C1109.2249%2C1109.0245%2C1109.0300%2C1109.2930%2C1109.0889%2C1109.2589%2C1109.6188%2C1109.0983%2C1109.6168%2C1109.0090%2C1109.0198%2C1109.1481%2C1109.3402%2C1109.5548%2C1109.1985%2C1109.5904%2C1109.6330%2C1109.5147%2C1109.3187%2C1109.2410%2C1109.4370%2C1109.2903%2C1109.0574%2C1109.2232%2C1109.4098%2C1109.1986%2C1109.5057%2C1109.3616%2C1109.5971%2C1109.0837%2C1109.6514%2C1109.6215%2C1109.6656%2C1109.0934%2C1109.2019%2C1109.2885%2C1109.1939%2C1109.0577%2C1109.0124%2C1109.4468%2C1109.6806%2C1109.6586%2C1109.1273%2C1109.6170%2C1109.3870%2C1109.3449%2C1109.0402%2C1109.3792%2C1109.0569%2C1109.5921%2C1109.4111%2C1109.6095%2C1109.4501%2C1109.1229%2C1109.1526%2C1109.4696%2C1109.2218%2C1109.0151%2C1109.6674%2C1109.0887%2C1109.5302%2C1109.0664%2C1109.4916%2C1109.5677%2C1109.2802%2C1109.4877%2C1109.1943%2C1109.1648%2C1109.4301%2C1109.3547%2C1109.0332%2C1109.0507%2C1109.2584%2C1109.4571%2C1109.5290%2C1109.1853%2C1109.3523%2C1109.1752%2C1109.1496%2C1109.0907%2C1109.3453%2C1109.4050%2C1109.0440%2C1109.2800%2C1109.2941%2C1109.6229%2C1109.6352%2C1109.4924%2C1109.3491%2C1109.0960%2C1109.4214%2C1109.4865%2C1109.6437%2C1109.2615%2C1109.1528%2C1109.6861%2C1109.6332%2C1109.5259&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Isolated Millimeter Flares of Cyg X-3"}, "summary": "Cygnus X-3 (Cyg X-3) is a well-known microquasar with relativistic jets. Cyg\nX-3 is especially famous for its giant radio outbursts, which have been\nobserved once every few years since their first discovery. Each giant outburst\npresumably consists of a series of short-duration flares. The physical\nparameters of the flares in the giant outbursts are difficult to derive because\nthe successive flares overlap. Here, we report isolated flares in the quiescent\nphase of Cyg X-3, as observed at 23, 43, and 86 GHz with the 45-m radio\ntelescope at Nobeyama Radio Observatory. The observed flares have small\namplitude (0.5--2 Jy) and short duration (1--2 h). The millimeter fluxes\nrapidly increase and then exponentially decay. The lifetime of the decay is\nshorter at higher frequency. The radio spectrum of Cyg X-3 during the flares is\nflat or inverted around the peak flux density. After that, the spectrum\ngradually becomes steeper. The observed characteristics are consistent with\nthose of adiabatic expanding plasma. The brightness temperature of the plasma\nat the peak is estimated to be $T_B\\gtrsim 1 \\times 10^{11}$ K. The magnetic\nfield in the plasma is calculated to be $0.2 \\lesssim H \\lesssim 30$ G.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1109.2383%2C1109.4809%2C1109.6717%2C1109.2249%2C1109.0245%2C1109.0300%2C1109.2930%2C1109.0889%2C1109.2589%2C1109.6188%2C1109.0983%2C1109.6168%2C1109.0090%2C1109.0198%2C1109.1481%2C1109.3402%2C1109.5548%2C1109.1985%2C1109.5904%2C1109.6330%2C1109.5147%2C1109.3187%2C1109.2410%2C1109.4370%2C1109.2903%2C1109.0574%2C1109.2232%2C1109.4098%2C1109.1986%2C1109.5057%2C1109.3616%2C1109.5971%2C1109.0837%2C1109.6514%2C1109.6215%2C1109.6656%2C1109.0934%2C1109.2019%2C1109.2885%2C1109.1939%2C1109.0577%2C1109.0124%2C1109.4468%2C1109.6806%2C1109.6586%2C1109.1273%2C1109.6170%2C1109.3870%2C1109.3449%2C1109.0402%2C1109.3792%2C1109.0569%2C1109.5921%2C1109.4111%2C1109.6095%2C1109.4501%2C1109.1229%2C1109.1526%2C1109.4696%2C1109.2218%2C1109.0151%2C1109.6674%2C1109.0887%2C1109.5302%2C1109.0664%2C1109.4916%2C1109.5677%2C1109.2802%2C1109.4877%2C1109.1943%2C1109.1648%2C1109.4301%2C1109.3547%2C1109.0332%2C1109.0507%2C1109.2584%2C1109.4571%2C1109.5290%2C1109.1853%2C1109.3523%2C1109.1752%2C1109.1496%2C1109.0907%2C1109.3453%2C1109.4050%2C1109.0440%2C1109.2800%2C1109.2941%2C1109.6229%2C1109.6352%2C1109.4924%2C1109.3491%2C1109.0960%2C1109.4214%2C1109.4865%2C1109.6437%2C1109.2615%2C1109.1528%2C1109.6861%2C1109.6332%2C1109.5259&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Cygnus X-3 (Cyg X-3) is a well-known microquasar with relativistic jets. Cyg\nX-3 is especially famous for its giant radio outbursts, which have been\nobserved once every few years since their first discovery. Each giant outburst\npresumably consists of a series of short-duration flares. The physical\nparameters of the flares in the giant outbursts are difficult to derive because\nthe successive flares overlap. Here, we report isolated flares in the quiescent\nphase of Cyg X-3, as observed at 23, 43, and 86 GHz with the 45-m radio\ntelescope at Nobeyama Radio Observatory. The observed flares have small\namplitude (0.5--2 Jy) and short duration (1--2 h). The millimeter fluxes\nrapidly increase and then exponentially decay. The lifetime of the decay is\nshorter at higher frequency. The radio spectrum of Cyg X-3 during the flares is\nflat or inverted around the peak flux density. After that, the spectrum\ngradually becomes steeper. The observed characteristics are consistent with\nthose of adiabatic expanding plasma. The brightness temperature of the plasma\nat the peak is estimated to be $T_B\\gtrsim 1 \\times 10^{11}$ K. The magnetic\nfield in the plasma is calculated to be $0.2 \\lesssim H \\lesssim 30$ G."}, "authors": ["Masato Tsuboi", "Kazuhisa Kamegai", "Atsushi Miyazaki", "Kouichiro Nakanishi", "Taro Kotani"], "author_detail": {"name": "Taro Kotani"}, "author": "Taro Kotani", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1093/pasj/64.1.10", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1109.1985v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1109.1985v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "2012, PASJ 64, in press. 7 pages, 2 figures", "arxiv_primary_category": {"term": "astro-ph.HE", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "astro-ph.HE", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1109.1985v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1109.1985v1", "journal_reference": null, "doi": "10.1093/pasj/64.1.10", "fulltext": "PASJ: Publ. Astron. Soc. Japan , 1–??,\nc 2018. Astronomical Society of Japan.\n\nIsolated Millimeter Flares of Cyg X-3\nMasato Tsuboi and Kazuhisa Kamegai\nInstitute of Space and Astronautical Science, Sagamihara, Kanagawa 252-5210\n\nAtsushi Miyazaki\n\narXiv:1109.1985v1 [astro-ph.HE] 9 Sep 2011\n\nMizusawa VLBI Observatory, National Astronomical Observatory, Mizusawa, Oshu, Iwate 023-0861\nKorean VLBI Network, Korea Astronomy and Space Science Institute,\nSeongsan-ro 262, Seodaemun-gu, Seoul 120-749, KOREA\n\nKouichiro Nakanishi\nNational Astronomical Observatory, Osawa, Mitaka, Tokyo 181-8588\n\nand\nTaro Kotani\nWaseda University, 17 Kikuicho, Shinjuku, Tokyo 162-0044\n(Received ; accepted )\n\nAbstract\nCygnus X-3 (Cyg X-3) is a well-known microquasar with relativistic jets. Cyg X-3 is especially famous\nfor its giant radio outbursts, which have been observed once every few years since their first discovery. Each\ngiant outburst presumably consists of a series of short-duration flares. The physical parameters of the flares\nin the giant outbursts are difficult to derive because the successive flares overlap. Here, we report isolated\nflares in the quiescent phase of Cyg X-3, as observed at 23, 43, and 86 GHz with the 45-m radio telescope\nat Nobeyama Radio Observatory. The observed flares have small amplitude (0.5–2 Jy) and short duration\n(1–2 h). The millimeter fluxes rapidly increase and then exponentially decay. The lifetime of the decay\nis shorter at higher frequency. The radio spectrum of Cyg X-3 during the flares is flat or inverted around\nthe peak flux density. After that, the spectrum gradually becomes steeper. The observed characteristics\nare consistent with those of adiabatic expanding plasma. The brightness temperature of the plasma at the\n11\n< <\npeak is estimated to be TB >\n∼ 1 × 10 K. The magnetic field in the plasma is calculated to be 0.2 ∼ H ∼ 30\nG.\nKey words: black hole physics –radio continuum: stars–stars: variables: other\n\n1.\n\nIntroduction\n\nCygnus X-3 (Cyg X-3) is a well-known microquasar that\ncontains a Wolf–Rayet star and a compact object, the nature and mass of which are still not known (Lommen et al.\n2005,Shrader et al 2010). Giant radio outbursts from Cyg\nX-3 have been observed once every few years since their\nfirst discovery. Very long baseline interferometry observations of these outbursts revealed that Cyg X-3 sometimes\nhas a bipolar relativistic jet (Martı́ et al. 2001, MillerJones et al. 2004, Tudose et al. 2007) and sometimes\nhas a one-sided jet (Mioduszewski et al. 2001). These\nrelativistic jets are presumably the remnants of ejection\nfrom the flares. In addition, Cyg X-3 was first detected\nin the GeV γ-ray regime in 2009 by the Fermi (Abdo\net al. 2009) and AGILE (Tavani et al. 2009) satellites.\nWilliams et al. reported that a radio flare was followed by\na γ-ray flare(Williams et al. 2011). The close relationship between radio and γ-ray flares is also supported by\nnew observations (Kotani et al. 2011, Bulgarelli et al.\n2011). The centimeter wave emission from Cyg X-3 has\nbeen monitored by several groups, even during the quiescent phase (e.g. Trushkin, Nizhelskij, & Bursov 2008).\nThe Green Bank interferometer at 5 GHz and the Ryle\ntelescope at 15 GHz have revealed the detailed behavior\n\nof radio emission from Cyg X-3 with a high time resolution (e.g. Ogley et al. 2001). The centimeter radio\nemission changes gradually over a time scale of 1 h or\nless. In contrast, the time scale of the change during outbursts is shorter at higher frequency. In particular, the\ntime scale for millimeter waves is much shorter than that\nfor centimeter waves (e.g. Tsuboi et al. 2008).\nThe giant outbursts of Cyg X-3 are presumed to consist\nof a series of short-duration flares. In previous research, a\nmillimeter wave monitor with sufficient time coverage and\nhigh time resolution found a new transient phenomenon of\nCyg X-3: a flux density change with an e-folding rise time\nof 3.6 min or less in the millimeter light curve (Tsuboi\net al. 2010). However, such flares in the giant outburst\nare too crowded together to discriminate the physical parameters of a single flare, even in the millimeter wave region. Ascertaining these parameters is vital for exploring\nthe mechanism of the flares.\nAccordingly, to obtain light curves that do not suffer from the interference of successive flares, observations were performed in the millimeter wave region at a\nhigh time resolution during quiescent phase of Cyg X-3\nby using the 45-m radio telescope at Nobeyama Radio\n\n\f2\n\nTsuboi et al.\n\nObservatory1 (NRO45). This telescope has wide frequency coverage from 20 to 100 GHz. Studying the behavior of flares at different frequencies also provided important information for exploring the mechanism of the\nflares.\n2.\n\nObservations\n\nWe monitored the flux density of Cyg X-3 in the quiescent phase at a high time resolution (4–10 min) by using\nNRO45 at 23, 43, and 86 GHz for 20 days during the\nperiod from 2006 to 2010.\nTo conduct the observations, a cooled high electron mobility transistor receiver with a dual circular polarization\nfeed was used at 23.0 GHz. However, observations at\n23 GHz were performed only in 2006 because changing\nthe frequency between 23 GHz and 43 and 86 GHz required a dead time of 5 min, which we judged to be a\nlong time when compared with the time scale of Cyg X3 phenomena. Superconductor-insulator-superconductor\nreceivers with orthogonal linear polarization feeds were\nused to make observations at 43.0 and 86.0 GHz. The\nfrequency bandwidth of these receivers is 500 MHz. The\nsystem noise temperatures during the observations, including atmospheric effects and antenna ohmic loss, were\n80–120 K at 23 GHz, 120–200 K at 43 GHz, and 250–350\nK at 86 GHz. The full width at half-maximum values of\nthe telescope beams were 77\" at 23 GHz, 39\" at 43 GHz,\nand 19\" at 86 GHz. To remove any atmospheric effects,\nthe telescope beam was alternated at 15 Hz between the\nposition of the source and a region of blank sky 6' from\nthe source in the azimuth direction by a beam switch. The\ntelescope was position-switched between an on-source position at ∆Az/ cos El = 0′ and a region of blank sky at\n∆Az/cosEl = 3′ , where the duration at each position was\n8 s/cycle. The antenna temperatures were calibrated by\na chopper wheel method. The primary flux calibrator for\nthe conversion from antenna temperature to flux density\nwas a proto-planetary nebula, NGC 7027, whose flux density values are given as 5.5 Jy at 22 GHz, 5.0 Jy at 43\nGHz, and 4.6 Jy at 86 GHz (Ott et al. 1994). Telescope\npointing was checked and corrected in every observation\nprocedure by viewing NGC 7027 in cross-scan mode. The\npointing accuracy was better than 3\" root mean square\nduring the observations.\nThe uncertainty in the flux density of Cyg X-3 depends\non the weather conditions. However, the sensitivity of\nthe telescopes is not a principal factor in the uncertainty.\nBecause the primary flux-scale calibrator, NGC 7027, is\nclose to Cyg X-3 in the celestial sphere and the difference in atmospheric attenuation between these sources\nis calibrated by the chopper wheel method, there is no\nsignificant effect on the flux density data. The typical\nsystematic uncertainty for NRO45 is 10%; however, the\nrelative uncertainties in the flux density on any particular\nday should be much less than this value because the ob1\n\nNobeyama Radio Observatory is a branch of the National\nAstronomical Observatory, National Institutes of Natural\nSciences, Japan\n\n[Vol. ,\n\nservations were performed under fine weather conditions.\n3.\n\nResults\n\nFrom the 20 days of monitoring during the quiescent\nphase of Cyg X-3, we found two isolated flares, at MJD\n= 53809 (15 March 2006 UT) and at MJD = 54972 (May\n20 2009 UT). We observed the whole episode of these flares\nwithout contamination from successive flares. There was\nno isolated flare with statistical significance on other days.\nThe complete monitoring data will be published in a future paper.\n3.1.\n\nFlare at MJD = 53809\n\nFigure 1a shows the light curves of the flare at\nMJD53809 at 23, 43, and 86 GHz. The MJD = 53809 flare\nwas found in the post-bursting phase of the giant outburst\nin spring 2006. The flux densities rapidly increased to a\npeak around MJD = 53809.78. Unfortunately, because\ncalibration was performed near the peak, there is a break\nin the data. The maximum flux densities were at least\nSν = 1.17 ± 0.01 Jy at 43 GHz and Sν = 1.71 ± 0.05 Jy\nat 86 GHz, where the error includes only statistical error.\nThe time scales of the e-folding rise, te , were below te <\n∼7\nmin at 43 GHz and te <\n6\nmin\nat\n86\nGHz.\nIn\nan\nearlier\n∼\npaper (Tsuboi et al. 2010), we reported an abrupt largeamplitude change in flux density with an e-folding rise\ntime of 4 min or less in light curves at 100 GHz (Tsuboi\net al. 2010). The time scales shown in Figure 1a are similar to the previous value. In contrast, the flux density appears to change more gradually at 23 GHz than at 43 GHz\nand 86 GHz, suggesting that the time scale becomes longer\nat lower frequency. However, the time lag between 43 and\n86 GHz is not clear. The absence of time lag is similar to\nthat seen for light curves at 100 GHz (Tsuboi et al. 2010).\nAfter the intensity peak, the flux densities then exponentially decayed. The lifetimes (Sν ∝ exp (−(t − t0 )/τ )) of\nthe fluxes were τ = 0.167+0.027\n−0.021 days at 23 GHz (dotted\nline in Figure 1a), τ = 0.098+0.021\n−0.015 days at 43 GHz (broken line in Figure 1a), and τ = 0.033+0.007\n−0.005 days at 86 GHz\n(solid line in Figure 1a). Here, the initial time of the flare,\nt0 , is assumed to be the same as the time at the peak flux\ndensity, t0 = 53809.78 in MJD. The lifetime of the flux\nwas much shorter at higher frequency. In addition, there\nmight be a plateau around MJD = 53809.83–53809.86 in\nthe flux density at 86 GHz. A plateau was not clearly seen\nin the flux densities at 23 and 43 GHz.\nFigure 2a shows the radio spectral index of Cyg X-3 at\nMJD = 53809. The values are derived from the inclination\nbetween the flux densities at 43 and 86 GHz. The radio\nspectrum of Cyg X-3 is inverted, α ∼ −0.5(Sν ∝ ν −α ),\naround the peak flux density. After the peak flux density,\nthe spectral index rapidly becomes steeper; however, during the exponential decay of the flux density, the spectral\nindex is around α ∼ 0.5.\n\n\fNo. ]\n3.2.\n\nCyg X-3\nFlare at MJD = 54972\n\nFigure 1b shows the light curves of the flare at MJD\n= 54972 at 43 and 86 GHz. MJD = 54972 corresponded\nto the quiescent phase of Cyg X-3 in spring 2009. This\nflare has been briefly reported (Tsuboi et al. 2009). The\nflux densities rapidly increased to a peak around MJD =\n54972.88. The maximum flux densities are Sν = 0.43±0.02\nJy at 43 GHz and Sν = 0.39 ± 0.02 Jy at 86 GHz. The\ntime scales of the e-folding rise are te <\n∼ 11 min at 43 GHz\n7\nmin\nat\n86\nGHz,\nslightly\nlonger\nthan those in\nand te <\n∼\nFigure 1a. The flux densities exponentially decayed after\nthe intensity peaked. The lifetimes of the fluxes, assuming\nt0 = 54972.88, are τ = 0.077+0.004\n−0.003 days at 43 GHz (broken\nline in Figure 1b), and τ = 0.033+0.012\n−0.007 days at 86 GHz\n(solid line in Figure 1b). These lifetimes are consistent\nwith those in Figure 1a. There might also be a plateau\nin the flux density at 86 GHz around MJD = 54972.91–\n54972.95. In contrast to the first flare, a similar feature is\nalso observed at 43 GHz.\nFigure 2b shows the radio spectral index of Cyg X-3\nat MJD = 54972. The radio spectrum of Cyg X-3 is flat\naround the peak flux density, but rapidly become steeper\nto α ∼ 0.5 during the exponential decay of the flux density.\nThis is consistent with the spectral index in Figure 2a.\n\n3\n\n\f4\n\nTsuboi et al.\na Cyg X-3 at MJD=53809\n\nt=0.167 day\n\nt=0.098 day\n\nt=0.033 day\n\nFlux density (Jy)\n\n86 GHz Flux density\n43 GHz Flux density\n23 GHz Flux density\n\nb Cyg X-3 at MJD=54792\n\nt=0.077 day\n\nt=0.033 day\n\n86 GHz Flux density\n43 GHz Flux density\n\nFig. 1. a Light curves of Cyg X-3 at MJD = 53809 observed with the NRO45 telescope. The frequency bands are\n23 (cross), 43 (open circle), and 86 (filled circle) GHz. The\nmaximum flux densities occur around MJD = 53809.78. They\nare Sν = 1.17 ± 0.01 Jy at 43 GHz and Sν = 1.71 ± 0.05 Jy\nat 86 GHz. After the intensity peak, the flux densities exponentially decayed. The lifetimes (Sν ∝ exp (−(t − t0 )/τ )) are\n+0.021\nτ = 0.167+0.027\n−0.021 days at 23 GHz (dotted line), τ = 0.098−0.015\n\ndays at 43 GHz (broken line), and τ = 0.033+0.007\n−0.005 days at\n86 GHz (solid line). Here, the initial time of the flare, t0 ,\nis assumed to be the time at the peak, t0 = 53809.78. b\nLight curves of Cyg X-3 at MJD = 54972 observed with the\nNRO45 telescope. The frequency bands are 43 (open circle)\nand 86 (filled circle) GHz. The maximum flux densities occur\naround MJD = 54972.88. They are Sν = 0.43 ± 0.02 Jy at\n43 GHz and Sν = 0.39 ± 0.02 Jy at 86 GHz. The lifetimes,\nassuming t0 = 54972.88, are τ = 0.077+0.004\n−0.003 days at 43 GHz\n(broken line), and τ = 0.033+0.012\n−0.007 days at 86 GHz (solid line).\n\n[Vol. ,\n\n\fNo. ]\n\nCyg X-3\n\n5\n\n1.5\n\n2.5\n\na Spectral index change of Cyg X-3 at MJD=53809\n\n1\n\n2\n\nFlux density at 86 GHz (Jy)\n\nSpectral index\n\n0.5\n\n1.5\n\n1\n\n-0.5\n\n0.5\n\nbetween 43 and 86 GHz\n86GHzFlux density\n\n-1\n53809.75\n\n53809.80\n\n53809.85\n\n53809.90\n\n53809.95\n\n0\n53810.00\n\n1.5\n1.2\n\nb Spectral index change of Cyg X-3 at MJD=54972\n\n1\n\n1\n\n0.8\n0.5\nSpectral index\n\n0.6\n0\n0.4\n-0.5\n86 GHz Flux density\n\n0\n\n-1\n54972.80\n\n0.2\n\n54972.85\n\n54972.90\n\n54972.95\n\nMJD\nFig. 2. a Spectral index between 43 and 86 GHz (filled circle) of Cyg X-3 at MJD = 53809 observed with the NRO45\ntelescope. The flux density at 86 GHz (open circle) is also\nshown for comparison. The radio spectrum of Cyg X-3 is\ninverted, α ∼ −0.5(Sν ∝ ν −α ), around the peak flux density. The spectral index was around α ∼ 0.5 during the exponential decay of the flux density. b Spectral index between 43 and 86 GHz (filled circle) of Cyg X-3 at MJD\n= 54972 observed with the NRO45 telescope. The flux density at 86 GHz (open circle) is also shown for comparison. The radio spectrum of Cyg X-3 has a flat spectrum\naround the peak flux density. The spectral index was at\naround α ∼ 0.5 during the exponential decay of the flux.\n\n54973.00\n\n54973.05\n\nFlux density at 86 GHz (Jy)\n\nSpectral index between 43 and 86 GHz\n\n0\n\n\f6\n4.\n\nTsuboi et al.\nDiscussion\n\nThe time lag between 43 and 86 GHz was not observed\nin the rising phase of the flares; the two flares had flat\nor inverted spectra around the maximum intensity. The\nflux densities of both flares exponentially decayed over\na similar lifetime and with a similar spectral index after\nthe peak. These observed characteristics are consistent\nwith those of adiabatic expanding plasma; that is, an optically thick plasma blob is ejected. This blob rapidly\nexpands and its flux density increases rapidly, independent of frequency. The optical thickness decreases with\nthe expansion and the plasma blob becomes optically thin\nat a higher frequency. The magnetic field producing the\nsynchrotron emission decays. The emission at higher frequency decays more quickly.\nThe radius of the emitting region at the maximum intensity, r, can be estimated from r < cte /2, and the upper\nlimit of the source size is r < 0.4 AU. The observation frequency is ν = 86 GHz and the flux density is Sν = 1.7 Jy\nfor the flare at MJD = 53809. The brightness temperature\nof the emitting region, TB , is given by\n\u0010 d \u00112\nc2\nTB =\n,\n(1)\nSν\n2\n2kB ν\nr\nwhere d is the distance of Cyg X-3 and kB is Boltzmann\nconatatnt (Ogley et al. 2001). This brightness temperature is larger than TB > 1.5 × 1011 K, assuming that Cyg\nX-3 is located at a distance of d = 9 kpc.\nThe observed spectrum of the flares around the peak is\nflat or inverted between ν = 43 and 86 GHz. If the emission\nis completely optically thick in the frequency range, the\nspectral index should be α ∼ −2.5 for relativistic electrons\nwith a power energy spectrum, N (E) ∝ E −γ . The observed spectral indexes indicate that emission in this frequency range is close to the turnover frequency, at which\nthe optical thickness becomes τ ∼ 1 and is given by\nγ−1\n\nγ+4\n2\n\nνs\n\n1\nSν ν 2\n∼ c14 (γ) 2 2 H⊥2 ,\nπr /d\n\n(2)\n\n(see Eq. 6.38 in Pacholczyk 1970).\nWe assume that the electron energy index is γ = 2, which\nis derived from the spectral index of α ∼ 0.5 during the exponential decay. Hence, with γ = 2 the turnover frequency\nbecomes\n1\n\nνs [GHz] ∼ 42 × H⊥[G] 5 .\n\n(3)\n\nHere, we use the coefficient c14 (2) ∼ 3.42 × 1030 . On the\nother hand, the turnover frequency in the flares is estimated to be νs ∼ 80 GHz, owing to the observed flares\nshowing a flat or inverted spectrum between ν = 43 and\n86 GHz. The magnetic field strength at the peak is calculated to be H ∼ 30 G and the cooling time of the electrons,\ntc , is estimated to be\n1\n3\ntc [s] ∼ c12 × H⊥ [G]− 2 ,\n(4)\n2\nwhere c12 = 1.6 × 107 (see Eq. 7.7 in Pacholczyk 1970).\nIf the magnetic field is H⊥ <\n∼ 30 G, the cooling time is\n\n[Vol. ,\n\ntc >\n∼ 14 h, which is consistent with no change occurring in\nthe spectral index during the observed exponential decay.\nThe exponential decay is assumed to be caused by the\ndecrease in the strength of the magnetic field.\nAssuming equipartition between the magnetic field and\nthe electrons, the minimum energy of the source to account for the observed synchrotron emission is approximated by\n\u0012\n\u00134/7 \u0012\n\u00138/7\n\u0012\n\u00134/7 \u0012 \u00139/7 \u0010\nǫp\nd\nν \u00112/7 Sν\nte\n33\n1+\nEmin ∼ 3 × 10\nǫe\ns\nGHz\nmJy\nkpc\n= 2.1 × 1040 erg,\nwhere ǫp /ǫe is the ratio between the energy in protons\nand that in electrons; this ratio is assumed to be zero\nhereafter (Fender 2003). The minimum power given to\nthe electrons is found by dividing the minimum energy by\nthe time scale of the e-folding rise te :\nPmin ∼\n\nEmin\n= 5.1 × 1037 erg s−1 .\nte\n\n(7)\n\nThe power is comparable with those estimated from flux\ndensities at low frequencies, whose rise time scales are\nlonger.\nFrom the assumption of equipartition, the magnetic\nfield strength, Heq , is\n\u00132/7 \u0012\n\u00134/7 \u0012 \u0013−6/7 \u0010\n\u0012\nν \u00111/7\nd\nte\nSν\nHeq ∼ 30×\nG = 10 G.(8)\nmJy\nkpc\ns\nGHz\nNote that the equipartition magnetic field strength, Heq ∼\n10 G, is of the same order as the strength of H ∼ 30 G,\nobtained from the turnover frequency.\n\u0010 \u0011 loss,\n\u0011 ratio of the inverse-Compton scattering\n\u0010 The\ndE\ndE\n,\nand\nthe\nsynchrotron\nradiation\nloss,\n, for\ndt\ndt\nC\nS\nthe relativistic electrons is given by\n\u0010 \u0011\n\u0010 \u00112\ndE\nνSν d\ndt C\nc\nr\nurad\nR= \u0010 \u0011 =\n,\n(9)\n=\n2\nH\ndE\numag\n8π\ndt\n\nS\n\nwhere urad and umag are the radiation energy density and\nthe magnetic energy density, respectively (see Eq. 5.60 in\nPacholczyk 1970, Tsuboi et al. 2010). If the inverseCompton scattering loss dominates the synchrotron radiation loss, the lifetime of the relativistic electron would be\nso short that the emission would be invisible. Therefore,\nwe set the ratio R ≤ 1 by assuming that the spectral index is flat until ν ∼ 100 GHz. In this case, the magnetic\nfield is greater than H ≥ 0.2 G and thus, the magnetic\nfield strength of Cyg X-3 is estimated to be in the range\n<\n0.2 <\n∼ H ∼ 30 G.\n5.\n\nConclusions\n\nWe performed millimeter wave monitor observations of\nCyg X-3 in quiescent phases between giant outbursts at\n23, 43, and 86 GHz by using the NRO45 radio telescope.\nWe found two isolated flares with amplitude 0.5–2 Jy, for\nwhich the light curves did not suffer from successive flares.\n\n\fNo. ]\n\nCyg X-3\n\nThe e-folding rise times were as short as 6–7 min at 86\nGHz. The spectra were flat or slightly inverted around\nthe maximum intensity. The flux densities of both flares\nexponentially decayed over a similar lifetime, τ = 0.03 days\nat 86 GHz, and with a similar spectral index, α ∼ 0.5. The\nobserved characteristics are consistent with those of adiabatic expanding plasma. The observed e-folding rise times\nshowed that the upper limit radius of the ejecting plasma\nwas smaller than r < 0.4 AU. The brightness temperature\n11\nof the ejecting plasma was estimated to be TB >\n∼ 1 × 10\nK. The magnetic field in the plasma was derived to be\n<\n0.2 <\n∼ H ∼ 30 G.\nThe authors thank the members of the 45-m radio telescope group at Nobeyama Radio Observatory for support in the observations. This research was supported by\nKAKENHI 19047002 (TK) and by KAKENHI 23340075\n(TK).\nReferences\nAbdo, A. A. et al. 2009, Science, 326, 840\nBulgarelli, A. et al. 2011, ATel, 3141\nFender, R. P. 2003, in Compact Stellar X-Ray Sources, eds.\nW. H. G. Lewin & M. van der Klis, Cambridge University\nPress, p.1\nLommen, D., Yungelson, L., van den Heuvel, E., Nelemans,\nG., & Portegies Zwart, S. 2005, A&A, 443, 231\nKotani, T. et al. 2011, ATel, 3130\nMartı́, J., Paredes, J. M., Peracaula, M. 2001, A&A, 375, 476\nMiller-Jones, J. C. A., Blundell, K. M., Rupen, M. P.,\nMioduszewski, A. J., Duffy, P., & Beasley, A. J. 2004,\nApJ, 600, 368\nMioduszewski, A. J., Rupen, M. P., Hjellming, R. M., Pooley,\nG. G., & Waltman, E. B. 2001, ApJ, 553, 766\nOgley, R. N., Bell Burnell, S. J., Spencer, R. E., Newell, S. J.,\nStirling, A. M., & Fender, R. P. 2001, MNRAS, 326, 349\nOtt, M., Witzel, A., Quirrenbach, A., Krichbaum, T. P.,\nStandke, K. J., Schalinski, C. J., & Hummel, C. A. 1994,\nA&A, 284, 331\nPacholczyk, A. G. 1970, Radio Astrophysics (San Francisco:\nW. H. Freeman and company)\nShrader, C. R., Titarchuk, L., & Shaposhnikov, N. 2010, ApJ,\n718, 488\nTavani, M. et al. 2009, Nature, 462, 620\nTrushkin, S. A., Nizhelskij, N. A., & Bursov, N. N.\n2008, Proceedings of the VII Microquasar Workshop:\nMicroquasars and Beyond. 32\nTsuboi, M. et al. 2008, PASJ, 60, 465\nTsuboi, M. Miyazaki, A., Nakanishi, K., Kamegai, K., &\nKotani, T. 2009, ATel, 2053\nTsuboi, M. Miyazaki, A., Nakanishi, K., & Kotani, T. 2010,\nPASJ, 62, 1391\nTudose, V., Fender, R. P., Garrett, M. A., Miller-Jones, J. C.\nA., Paragi, Z., Spencer, R. E., Pooley, G. G., van der Klis,\nM., & Szomoru, A. 2007, MNRAS, 375, L11\nWilliams, P. K. G. et al. 2011, ApJL, 733, 20\n\n7\n\n\f"}