{"id": "http://arxiv.org/abs/1111.6306v2", "guidislink": true, "updated": "2012-01-04T17:11:59Z", "updated_parsed": [2012, 1, 4, 17, 11, 59, 2, 4, 0], "published": "2011-11-27T22:18:06Z", "published_parsed": [2011, 11, 27, 22, 18, 6, 6, 331, 0], "title": "Control and Synchronization of Neuron Ensembles", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1111.5476%2C1111.3547%2C1111.6344%2C1111.4162%2C1111.7001%2C1111.7197%2C1111.1188%2C1111.4641%2C1111.6294%2C1111.2324%2C1111.5296%2C1111.1224%2C1111.3050%2C1111.7011%2C1111.1396%2C1111.1401%2C1111.0124%2C1111.0513%2C1111.0152%2C1111.4676%2C1111.1809%2C1111.1716%2C1111.6395%2C1111.2499%2C1111.6960%2C1111.5223%2C1111.5259%2C1111.1755%2C1111.1885%2C1111.4945%2C1111.0828%2C1111.4728%2C1111.3485%2C1111.2673%2C1111.7040%2C1111.6001%2C1111.3029%2C1111.2612%2C1111.1817%2C1111.3553%2C1111.0912%2C1111.3950%2C1111.6306%2C1111.4331%2C1111.1523%2C1111.1830%2C1111.5570%2C1111.4477%2C1111.3651%2C1111.1819%2C1111.7106%2C1111.7087%2C1111.4862%2C1111.4946%2C1111.5649%2C1111.6589%2C1111.0933%2C1111.4328%2C1111.0681%2C1111.6366%2C1111.2449%2C1111.2379%2C1111.7274%2C1111.2435%2C1111.4861%2C1111.5776%2C1111.0759%2C1111.4800%2C1111.7307%2C1111.6766%2C1111.1940%2C1111.6496%2C1111.0937%2C1111.6511%2C1111.3404%2C1111.0088%2C1111.7168%2C1111.4338%2C1111.3254%2C1111.7206%2C1111.2865%2C1111.6969%2C1111.6356%2C1111.2377%2C1111.6170%2C1111.3815%2C1111.0536%2C1111.2693%2C1111.6393%2C1111.3432%2C1111.3737%2C1111.2954%2C1111.2013%2C1111.4849%2C1111.3503%2C1111.6022%2C1111.5867%2C1111.2602%2C1111.5543%2C1111.3325%2C1111.0426&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Control and Synchronization of Neuron Ensembles"}, "summary": "Synchronization of oscillations is a phenomenon prevalent in natural, social,\nand engineering systems. Controlling synchronization of oscillating systems is\nmotivated by a wide range of applications from neurological treatment of\nParkinson's disease to the design of neurocomputers. In this article, we study\nthe control of an ensemble of uncoupled neuron oscillators described by phase\nmodels. We examine controllability of such a neuron ensemble for various phase\nmodels and, furthermore, study the related optimal control problems. In\nparticular, by employing Pontryagin's maximum principle, we analytically derive\noptimal controls for spiking single- and two-neuron systems, and analyze the\napplicability of the latter to an ensemble system. Finally, we present a robust\ncomputational method for optimal control of spiking neurons based on\npseudospectral approximations. The methodology developed here is universal to\nthe control of general nonlinear phase oscillators.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1111.5476%2C1111.3547%2C1111.6344%2C1111.4162%2C1111.7001%2C1111.7197%2C1111.1188%2C1111.4641%2C1111.6294%2C1111.2324%2C1111.5296%2C1111.1224%2C1111.3050%2C1111.7011%2C1111.1396%2C1111.1401%2C1111.0124%2C1111.0513%2C1111.0152%2C1111.4676%2C1111.1809%2C1111.1716%2C1111.6395%2C1111.2499%2C1111.6960%2C1111.5223%2C1111.5259%2C1111.1755%2C1111.1885%2C1111.4945%2C1111.0828%2C1111.4728%2C1111.3485%2C1111.2673%2C1111.7040%2C1111.6001%2C1111.3029%2C1111.2612%2C1111.1817%2C1111.3553%2C1111.0912%2C1111.3950%2C1111.6306%2C1111.4331%2C1111.1523%2C1111.1830%2C1111.5570%2C1111.4477%2C1111.3651%2C1111.1819%2C1111.7106%2C1111.7087%2C1111.4862%2C1111.4946%2C1111.5649%2C1111.6589%2C1111.0933%2C1111.4328%2C1111.0681%2C1111.6366%2C1111.2449%2C1111.2379%2C1111.7274%2C1111.2435%2C1111.4861%2C1111.5776%2C1111.0759%2C1111.4800%2C1111.7307%2C1111.6766%2C1111.1940%2C1111.6496%2C1111.0937%2C1111.6511%2C1111.3404%2C1111.0088%2C1111.7168%2C1111.4338%2C1111.3254%2C1111.7206%2C1111.2865%2C1111.6969%2C1111.6356%2C1111.2377%2C1111.6170%2C1111.3815%2C1111.0536%2C1111.2693%2C1111.6393%2C1111.3432%2C1111.3737%2C1111.2954%2C1111.2013%2C1111.4849%2C1111.3503%2C1111.6022%2C1111.5867%2C1111.2602%2C1111.5543%2C1111.3325%2C1111.0426&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Synchronization of oscillations is a phenomenon prevalent in natural, social,\nand engineering systems. Controlling synchronization of oscillating systems is\nmotivated by a wide range of applications from neurological treatment of\nParkinson's disease to the design of neurocomputers. In this article, we study\nthe control of an ensemble of uncoupled neuron oscillators described by phase\nmodels. We examine controllability of such a neuron ensemble for various phase\nmodels and, furthermore, study the related optimal control problems. In\nparticular, by employing Pontryagin's maximum principle, we analytically derive\noptimal controls for spiking single- and two-neuron systems, and analyze the\napplicability of the latter to an ensemble system. Finally, we present a robust\ncomputational method for optimal control of spiking neurons based on\npseudospectral approximations. The methodology developed here is universal to\nthe control of general nonlinear phase oscillators."}, "authors": ["Jr-Shin Li", "Isuru Dasanayake", "Justin Ruths"], "author_detail": {"name": "Justin Ruths"}, "author": "Justin Ruths", "arxiv_comment": "29 pages, 6 figures", "links": [{"href": "http://arxiv.org/abs/1111.6306v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1111.6306v2", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "math.OC", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "math.OC", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "math.DS", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "nlin.AO", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1111.6306v2", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1111.6306v2", "journal_reference": null, "doi": null, "fulltext": "1\n\nControl and Synchronization of Neuron\nEnsembles\narXiv:1111.6306v2 [math.OC] 4 Jan 2012\n\nJr-Shin Li, Isuru Dasanayake, and Justin Ruths\n\nAbstract\nSynchronization of oscillations is a phenomenon prevalent in natural, social, and engineering\nsystems. Controlling synchronization of oscillating systems is motivated by a wide range of applications\nfrom neurological treatment of Parkinson's disease to the design of neurocomputers. In this article, we\nstudy the control of an ensemble of uncoupled neuron oscillators described by phase models. We examine\ncontrollability of such a neuron ensemble for various phase models and, furthermore, study the related\noptimal control problems. In particular, by employing Pontryagin's maximum principle, we analytically\nderive optimal controls for spiking single- and two-neuron systems, and analyze the applicability of the\nlatter to an ensemble system. Finally, we present a robust computational method for optimal control of\nspiking neurons based on pseudospectral approximations. The methodology developed here is universal\nto the control of general nonlinear phase oscillators.\nIndex Terms\nSpiking neurons; Controllability; Optimal control; Lie algebra; Pseudospectral methods.\n\nI. I NTRODUCTION\nNatural and engineered systems that consist of ensembles of isolated or interacting nonlinear\ndynamical components have reached levels of complexity that are beyond human comprehension. These complex systems often require an optimal hierarchical organization and dynamical\nJ.-S. Li is with the Department of Electrical and Systems Engineering, Washington University, St. Louis, MO 63130 USA\n(e-mail: jsli@seas.wustl.edu).\nI. Dasanayake is with the Department of Electrical and Systems Engineering, Washington University, St. Louis, MO 63130\nUSA (e-mail: dasanayakei@seas.wustl.edu).\nJ. Ruths is with the Engineering Systems & Design Pillar, Singapore University of Technology & Design, Singapore (e-mail:\njustinruths@sutd.edu.sg).\nJanuary 5, 2012\n\nDRAFT\n\n\f2\n\nstructure, such as synchrony, for normal operation. The synchronization of oscillating systems\nis an important and extensively studied phenomenon in science and engineering [1]. Examples\ninclude neural circuitry in the brain [2], sleep cycles and metabolic chemical reaction systems in\nbiology [3], [4], [5], [6], semiconductor lasers in physics [7], and vibrating systems in mechanical\nengineering [8]. Such systems, moreover, are often tremendously large in scale, which poses\nserious theoretical and computational challenges to model, guide, control, or optimize them.\nDeveloping optimal external waveforms or forcing signals that steer complex systems to desired\ndynamical conditions is of fundamental and practical importance [9], [10]. For example, in neuroscience devising minimum-power external stimuli that synchronize or desynchronize a network\nof coupled or uncoupled neurons is imperative for wide-ranging applications from neurological\ntreatment of Parkinson's disease and epilepsy [11], [12], [13] to design of neurocomputers [14],\n[15]; in biology and chemistry application of optimal waveforms for the entrainment of weakly\nforced oscillators that maximize the locking range or alternatively minimize power for a given\nfrequency entrainment range [9], [16] is paramount to the time-scale adjustment of the circadian\nsystem to light [17] and of the cardiac system to a pacemaker [18].\nMathematical tools are required for describing the complex dynamics of oscillating systems\nin a manner that is both tractable and flexible in design. A promising approach to constructing\nsimplified yet accurate models that capture essential overall system properties is through the\nuse of phase model reduction, in which an oscillating system with a stable periodic orbit\nis modeled by an equation in a single variable that represents the phase of oscillation [17],\n[19]. Phase models have been very effectively used in theoretical, numerical, and more recently\nexperimental studies to analyze the collective behavior of networks of oscillators [20], [21],\n[22], [23]. Various phase model-based control theoretic techniques have been proposed to design\nexternal inputs that drive oscillators to behave in a desired way or to form certain synchronization\npatterns. These include multi-linear feedback control methods for controlling individual phase\nrelations between coupled oscillators [24] and phase model-based feedback approaches for\nefficient control of synchronization patterns in oscillator assemblies [10], [25], [26]. These\nsynchronization engineering methods, though effective, do not explicitly address optimality in\nthe control design process. More recently, minimum-power periodic controls that entrain an\noscillator with an arbitrary phase response curve (PRC) to a desired forcing frequency have\nbeen derived using techniques from calculus of variations [16]. In this work, furthermore, an\nJanuary 5, 2012\n\nDRAFT\n\n\f3\n\nefficient computational procedure was developed for optimal control synthesis employing Fourier\nseries and Chebyshev polynomials. Minimum-power stimuli with limited amplitude that elicit\nspikes of a single neuron oscillator at specified times have also been analytically calculated\nusing Pontryagin's maximum principle, where possible neuron spiking range with respect to the\nbound of the control amplitude has been completely characterized [27], [28]. In addition, chargebalanced minimum-power controls for spiking a single neuron has been thoroughly studied [29],\n[30].\nIn this paper, we generalize our previous work on optimal control of a single neuron [27], [28],\n[29] to consider the control and synchronization of a collection of neuron oscillators. In particular,\nwe investigate the fundamental properties and develop optimal controls for the synchronization\nof such type of large-scale neuron systems. In Section II, we briefly introduce the phase model\nfor oscillating systems and investigate controllability of an ensemble of uncoupled neurons for\nvarious phase models characterized by different baseline dynamics and phase response functions.\nThen, in Section III, we formulate optimal control of spiking neurons as steering problems and in\nparticular derive minimum-power and time-optimal controls for single- and two-neuron systems.\nFurthermore, we implement a multidimensional pseudospectral method to find optimal controls\nfor spiking an ensemble of neurons which reinforce and augment our analytic results.\nII. C ONTROL\n\nOF\n\nN EURON O SCILLATORS\n\nA. Phase Models\nThe dynamics of an oscillator are often described by a set of ordinary differential equations\nthat has a stable periodic orbit. Consider a time-invariant system\nẋ = F (x, u),\n\nx(0) = x0 ,\n\n(1)\n\nwhere x(t) ∈ Rn is the state and u(t) ∈ R is the control, which has an unforced stable attractive\nperiodic orbit γ(t) = γ(t + T ) homeomorphic to a circle, satisfying γ̇ = F (γ, 0), on the periodic\norbit Γ = {y ∈ Rn | y = γ(t), for 0 ≤ t < T } ⊂ Rn . This system of equations can be reduced\nto a single first order differential equation, which remains valid while the state of the full system\nstays in a neighborhood of its unforced periodic orbit [31]. This reduction allows us to represent\nthe dynamics of a weakly forced oscillator by a single phase variable that defines the evolution\n\nJanuary 5, 2012\n\nDRAFT\n\n\f4\n\nof the oscillation,\ndθ\n= f (θ) + Z(θ)u(t),\ndt\n\n(2)\n\nwhere θ is the phase variable, f and Z are real-valued functions, and u ∈ U ⊂ R is the external\nstimulus (control) [31], [32]. The function f represents the system's baseline dynamics and Z\nis known as the phase response curve (PRC), which describes the infinitesimal sensitivity of\nthe phase to an external control input. One complete oscillation of the system corresponds to\nθ ∈ [0, 2π). In the case of neural oscillators, u represents an external current stimulus and f is\nreferred to as the instantaneous oscillation frequency in the absence of any external input, i.e.,\nu = 0. As a convention, a neuron is said to spike or fire at time T following a spike at time 0 if\nθ(t) evolves from θ(0) = 0 to θ(T ) = 2π, i.e., spikes occur at θ = 2nπ, where n = 0, 1, 2, . . ..\nIn the absence of any input u(t) the neuron spikes periodically at its natural frequency, while by\nan appropriate choice of u(t) the spiking time can be advanced or delayed in a desired manner.\nIn this article, we study various phase models characterized by different f and Z functions. In\nparticular, we investigate the neural inputs that elicit desired spikes for an ensemble of isolated\nneurons with different natural dynamics, e.g., different oscillation frequencies. Fundamental\nquestions on the controllability of these neuron systems and the design of optimal inputs that\nspike them arise naturally and will be discussed.\nB. Controllability of Neuron Ensembles\nIn this section, we analyze controllability properties of finite collections of neuron oscillators.\nWe first consider the Theta neuron model (Type I neurons) which describes both superthreshold\nand subthreshold dynamics near a SNIPER (saddle-node bifurcation of a fixed point on a periodic\norbit) bifurcation [33], [34].\n1) Theta Neuron Model: The Theta neuron model is characterized by the neuron baseline\ndynamics, f (θ) = (1 + I) + (1 − I) cos θ, and the PRC, Z(θ) = 1 − cos θ, namely,\n\u0003\ndθ \u0002\n= (1 + I) + (1 − I) cos θ + (1 − cos θ)u(t),\ndt\n\n(3)\n\nwhere I is the neuron baseline current. If I > 0, then f (θ) > 0 for all t ≥ 0. Therefore, in the\nabsence of the input the neuron fires periodically since the free evolution of this neuron system,\n\nJanuary 5, 2012\n\nDRAFT\n\n\f5\n\n2π\n\nθ\n\n3π/2\n\nπ\n\nπ/2\n\n0\n\nFig. 1.\n\n0\n\n0.05\n\n0.1\n\n0.15\nt\n\n0.2\n\n0.25\n\n0.3142\n\nThe Free Evolution of a Theta Neuron. The baseline current I = 100, and hence it spikes periodically with angular\n\nfrequency ω = 20 and period T0 = π/10.\n\ni.e., θ̇ = f (θ), has a periodic orbit\nθ(t) = 2 tan−1\n\n!\n√\ntan[ I(t + c)]\n√\n,\nI\n\nfor I > 0,\n\n(4)\n\n√\n√\nwith the period T0 = π/ I and hence the frequency ω = 2 I, where c is a constant depending\non the initial condition. For example, if θ(0) = 0, then c = 0. Fig. 1 shows the free evolution\nof a Theta neuron with I = 100. This neuron spikes periodically at T0 = π/10 with angular\nfrequency ω = 2π/T = 20. When I < 0, then the model is excitable, namely, spikes can occur\nwith an appropriate input u(t). However, no spikes occur without any input u(t) as\n√\n\u0012\n\u0013\n−I(t + c)]\ntanh[\n−1\n√\nθ(t) = 2 tan\n, for I < 0,\n−I\nand there are two fixed points (one of which is stable) for u(t) ≡ 0.\n\nNow we consider spiking a finite collection of neurons with distinct natural oscillation frequencies and with positive baseline currents. This gives rise to a steering problem of the finitedimensional single-input nonlinear control system, Θ̇ = f (Θ) + Z(Θ)u(t), where Θ ∈ Ω ⊂ Rn ,\nf, Z : Ω → Rn , and u ∈ U ⊂ R. In the vector form, this system appears as\n\n \n \n\nθ̇1\nα1 + β1 cos θ1\n1 − cos θ1\n\n \n \n\n θ̇   α + β cos θ   1 − cos θ \n2\n2 \n2 \n 2   2\n\n . =\n+\n u(t),\n..\n..\n ..  \n \n\n.\n.\n\n \n \n\nθ̇n\nαn + βn cos θn\n1 − cos θn\nJanuary 5, 2012\n\n(5)\n\nDRAFT\n\n\f6\n\nin which αi = 1+Ii = 1+ωi2 /4, βi = 1−Ii = 1−ωi2 /4, and Ii > 0 for all i ∈ N = {1, 2, . . . , n}.\nNote that αi + βi = 2 for all i ∈ N . The ultimate proof of our understanding of neural systems\nis reflected in our ability to control them, hence a complete investigation of the controllability\nof oscillator populations is of fundamental importance. We now analyze controllability for the\nsystem as in (5), which determines whether spiking or synchronization of an oscillator ensemble\nby the use of an external stimulus is possible.\nBecause the free evolution of each neuron system θi , i ∈ N , in (5) is periodic as shown in (4),\nthe drift term f causes no difficulty in analyzing controllability. The following theorem provides\nessential machinery for controllability analysis.\nTheorem 1: Consider the nonlinear control system\nẋ(t) = f (x(t)) + u(t) g(x(t)),\n\nx(0) = x0 .\n\n(6)\n\nSuppose that f and g are vector fields on a manifold M. Suppose that {f, g} meet either of the\nconditions of Chow's theorem, and suppose that for each initial condition x0 the solution of\nẋ(t) = f (x(t))\nis periodic with a least period T (x0 ) < P ∈ R+ . Then the reachable set from x0 for (6) is\n{exp{f, g}LA }G x0 , where {f, g}LA denotes the Lie algebra generated by the vector fields f and\ng, and {exp{f, g}LA }G is the smallest subgroup of the diffeomorphism group, diff(M), which\ncontains exp tη for all η ∈ {f, g}LA [35].\n\u0003\n\nProof. See Appendix A.\n\nThe underlying idea of this theorem for dealing with the drift is the utilization of periodic\nmotions along the drift vector field, f (x), to produce negative drift by forward evolutions for\nlong enough time. More details about Theorem 1 can be found in Appendix A. Having this\nresult, we are now able to investigate controllability of a neuron oscillator assembly.\nTheorem 2: Consider the finite-dimensional single-input nonlinear control system\nΘ̇ = f (Θ) + Z(Θ)u(t),\n\nJanuary 5, 2012\n\n(7)\n\nDRAFT\n\n\f7\n\nwhere Θ = (θ1 , θ2 , . . . , θn )′ ∈ Ω ⊂ Rn and the vector fields f, Z : Ω → Rn are defined by\n\n\n\n\nα1 + β1 cos θ1\n1 − cos θ1\n\n\n\n\n α + β cos θ \n 1 − cos θ \n2\n2 \n2 \n 2\n\nf (Θ) = \n , Z(Θ) = \n,\n..\n..\n\n\n\n\n.\n.\n\n\n\n\nαn + βn cos θn\n1 − cos θn\n\nin which αi = 1 + Ii , βi = 1 − Ii , and Ii > 0 for all i ∈ N = {1, 2, . . . , n}. The system as in\n(7) is controllable.\nProof. It is sufficient to consider the case where Ii 6= Ij for i 6= j and i, j ∈ N , since otherwise\nthey present the same neuron system. Because Ii > 0 for all i ∈ N , the free evolution, i.e.,\nu(t) = 0, of each θi is periodic for every initial condition θi (0) ∈ R, as shown in (4), with the\n√\n√\nangular frequency ωi = 2 Ii and the period Ti = π/ Ii . Therefore, the free evolution of Θ is\n\nperiodic with a least period or is recurrent (see Remark 1). We may then apply Theorem 1 in\ncomputing the reachable set of this system. Let\nadg h(Θ) = [g, h](Θ)\ndenote the Lie bracket of the vector fields g and h, both defined on an open subset Ω of Rn .\nThen, the recursive operation is denoted as\nadkg h(Θ) = [g, adgk−1h](Θ)\nfor any k ≥ 1, setting ad0g h(Θ) = h(Θ). The Lie brackets of f and Z include\n\n\n(−1)k−1 2k (α1 − β1 )k−1 sin θ1\n\n\n (−1)k−1 2k (α − β )k−1 sin θ \n2\n2\n2\n\n\nadf2k−1 Z = \n,\n.\n\n\n..\n\n\nk−1 k\nk−1\n(−1) 2 (αn − βn )\nsin θn\n\n\n(−1)k−1 2k (α1 − β1 )k−1 (α1 cos θ1 + β1 )\n\n\n (−1)k−1 2k (α − β )k−1 (α cos θ + β ) \n2\n2\n2\n2\n2\n\n\nad2k\n,\nf Z = \n.\n\n..\n\n\n\nk−1 k\nk−1\n(−1) 2 (αn − βn ) (αn cos θn + βn )\n\n+\nn\nfor k ∈ Z+ , positive integers. Thus, {f, adm\nf Z}, m ∈ Z , spans R at all Θ ∈ Ω since αi − βi =\n\nωi2 /2 and ωi are distinct for i ∈ N . That is, every point in Rn can be reached from any initial\nJanuary 5, 2012\n\nDRAFT\n\n\f8\n+\ncondition Θ(0) ∈ Ω, hence the system (7) is controllable. Note that if Θ = 0, {ad2k\nf Z}, k ∈ Z ,\n\nspans Rn .\n\n\u0003\n\nRemark 1: If there exist integers mi and nj such that the periods of neuron oscillators are\nrelated by mi Ti = nj Tj for all (i, j) pairs, i, j ∈ N , then the free evolution of Θ is periodic\nwith a least period. If, however, such a rational number relation does not hold between any two\n√\nperiods, e.g., T1 = 1 and T2 = 2, it is easy to see that the free evolution of Θ is almostperiodic [36] because the free evolution of each θi , i ∈ N , is periodic. Hence, the recurrence\nof f in (7) together with the Lie algebra rank condition (LARC) described above guarantee the\ncontrollability.\nControllability properties for other commonly-used phase models used to describe the dynamics of neuron or other, e.g., chemical, oscillators can be shown in the same fashion.\n2) SNIPER PRC: The SNIPER phase model is characterized by f = ω, the neuron's natural\noscillation frequency, and the SNIPER PRC, Z = z(1 − cos θ), where z is a model-dependent\nconstant [33]. In the absence of any external input, the neuron spikes periodically with the period\nT = 2π/ω. The SNIPER PRC is derived for neuron models near a SNIPER bifurcation which is\nfound for Type I neurons [34] like the Hindmarsh-Rose model [37]. Note that the SNIPER PRC\ncan be viewed as a special case of the Theta neuron PRC for the baseline current I > 0. This can\n√\nbe seen through a bijective coordinate transformation θ(φ) = 2 tan−1 [ Ib tan(φ/2 − π/2)] + π,\nφ ∈ [0, 2π), applied to (3), which yields\n\ndφ\ndt\n\n= ω + ω2 (1 − cos φ)u(t), i.e., the SNIPER PRC with\n\nz = 2/ω. The spiking property, namely, θ(φ = 0) = 0 and θ(φ = 2π) = 2π is preserved under\nthe transformation and so is the controllability as analyzed in Section II-B1.\nMore specifically, consider a finite collection of SNIPER neurons with f (Θ) = (ω1 , ω2 , . . . , ωn )′\nand Z(Θ) = (z1 (1 − cos θ1 ), z2 (1 − cos θ2 ), . . . , zn (1 − cos θn ))′ , where conventionally, zi = 2/ωi\nfor i ∈ N . Similar Lie bracket computations as in the proof of Theorem 2 result in, for\nk = 1, . . . , n,\n\u0001′\nadf2k−1 Z = (−1)k−1 z1 ω12k−1 sin θ1 , . . . , (−1)k−1 zn ωn2k−1 sin θn ,\n\u0001′\nk−1\nad2k\nz1 ω12k cos θ1 , . . . , (−1)k−1 zn ωn2k cos θn ,\nf Z = (−1)\n\nand thus span{f, Z}LA = Rn , since ωi 6= ωj for i 6= j. Therefore, the system of a network of\nSNIPER neurons is controllable.\n\nJanuary 5, 2012\n\nDRAFT\n\n\f9\n\n3) Sinusoidal PRC: In this case, we consider f (Θ) = (ω1 , ω2 , . . . , ωn )′ and Z(Θ) = (z1 sin θ1 ,\nz2 sin θ2 , . . . , zn sin θn )′ , where ωi > 0 and zi = 2/ωi for i = 1, . . . , n. This type of PRC's with\nboth positive and negative regions can be obtained by periodic orbits near the super critical\nHopf bifurcation[31]. This type of bifurcation occurs for Type II neuron models like FitzhughNagumo model [38]. Controllability of a network of Sinusoidal neurons can be shown by the\nsame construction, from which\n\u0001′\nadf2k−1 Z = (−1)k−1 z1 ω12k−1 cos θ1 , . . . , (−1)k−1 zn ωn2k−1 cos θn ,\n\u0001′\nk\n2k\nk\n2k\nad2k\nf Z = (−1) z1 ω1 sin θ1 , . . . , (−1) zn ωn sin θn ,\n\nand then span{f, Z}LA = Rn for ωi 6= ωj , i 6= j. Therefore the system is controllable.\nIII. O PTIMAL C ONTROL\n\nOF\n\nS PIKING N EURONS\n\nThe controllability addressed above guarantees the existence of an input that drives an ensemble of oscillators between any desired phase configurations. Practical applications demand\nminimum-power or time-optimal controls that form certain synchronization patterns for a population of oscillators, which gives rise to an optimal steering problem,\n\nmin\ns.t.\n\nJ = φ(T, Θ(T )) +\n\nZ\n\nT\n0\n\nL(Θ(t), u(t))dt\n\nΘ̇(t) = f (Θ) + Z(Θ)u(t)\n\n(8)\n\nΘ(0) = Θ0 , Θ(T ) = Θd\n|u(t)| ≤ M,\n\n∀ t ∈ [0, T ],\n\nwhere Θ ∈ Rn , u ∈ R; φ : R × Rn → R, denoting the terminal cost, L : Rn × R → R, denoting\n\nthe running cost, and f, Z : Rn → Rn are Lipschitz continuous (over the respective domains)\nwith respect to their arguments. For spiking a neuronal population, for example, the goal is to\ndrive the system from the initial state, Θ0 = 0, to a final state Θd = (2m1 π, 2m2 π, . . . , 2mn π)′ ,\nwhere mi ∈ Z+ , i = 1, . . . , n. Steering problems of this kind have been well studied, for example,\nin the context of nonholonomic motion planning and sub-Riemannian geodesic problems [39],\n[40]. This class of optimal control problems in principle can be approached by the maximum\nprinciple, however, in most cases they are analytically intractable especially when the system is\nJanuary 5, 2012\n\nDRAFT\n\n\f10\n\nof high dimension, e.g., greater than three, and when the control is bounded, i.e., M < ∞. In\nthe following, we present analytical optimal controls for single- and two-neuron systems and,\nfurthermore, develop a robust computational method for solving challenging optimal control\nproblems of steering a neuron ensemble. Our numerical method is based on pseudospectral\napproximations which can be easily extended to consider any topologies of neural networks, e.g.,\narbitrary frequency distributions and coupling strengths between neurons, with various types of\ncost functional.\nA. Minimum-Power Control of a Single Neuron Oscillator\nDesigning minimum-power stimuli to elicit spikes of neuron oscillators is of clinical importance, such as deep brain stimulation, used for a variety of neurological disorders including\nParkinson's disease, essential tremor, and Dystonia, and neurological implants of cardiac pacemakers, where mild stimulations and low energy consumption are required [12], [41]. Optimal\ncontrols for spiking a single neuron oscillator can be derived using the maximum principle. In\norder to illustrate the idea, we consider spiking a Theta neuron, described in (3), with minimum\nRT\npower. In this case, the cost functional is J = 0 u2 (t)dt, and the initial and target states are 0\nand 2π, respectively. We first examine the case when the control is unbounded.\n\nThe control Hamiltonian of this optimal control problem is defined by H = u2 +λ(α+β cos θ+\nu − u cos θ), where λ is the Lagrange multiplier. The necessary conditions for optimality yield\n\n= λ(β − u) sin θ, and u = − 21 λ(1 − cos θ) by\nλ̇ = − ∂H\n∂θ\n\n∂H\n∂u\n\n= 0. With these conditions, the\n\noptimal control problem is then transformed to a boundary value problem, which characterizes\nthe optimal trajectories of θ(t) and λ(t). We then can derive the optimal feedback law for spiking\na Theta neuron at the specified time T by solving the resulting boundary value problem,\np\n−(α + β cos θ) + (α + β cos θ)2 − 2λ0 (1 − cos θ)2\n∗\n,\nu (θ) =\n1 − cos θ\nwhere λ0 = λ(0), which can be obtained according to\nZ 2π\n1\np\nT =\ndθ.\n(α + β cos θ)2 − 2λ0 (1 − cos θ)\n0\n\n(9)\n\n(10)\n\nMore details about the derivations can be found in Appendix B-1.\n\nNow consider the case when the control amplitude is limited, namely, |u(t)| ≤ M, ∀ t ∈ [0, T ].\n\nIf the unbounded minimum-power control as in (9) satisfies |u∗ (θ)| ≤ M for all t ∈ [0, T ], then\nJanuary 5, 2012\n\nDRAFT\n\n\f11\n1.2\n\n2π\n\n1\n\nΤ=4\n\n0.8\n\n3π/2\n\nΤ=8\n\n0.6\n\nPhase (θ)\n\nControl (u(t))\n\nΤ=3\n\nΤ=3\n\n0.4\n\nΤ=4\nΤ=8\n\nπ\n\n0.2\nπ/2\n\n0\n−0.2\n−0.4\n0\n\n0.1\n\n0.2\n\n0.3\n\n0.4\n\n0.5\n0.6\nTime (t/T)\n\n0.7\n\n0.8\n\n0.9\n\n1\n\n0\n0\n\n0.1\n\n0.2\n\n0.3\n\n(a)\nFig. 2.\n\n0.4\n\n0.5\n0.6\nTime (t/T)\n\n0.7\n\n0.8\n\n0.9\n\n1\n\n(b)\n\n(a) Minimum-power controls, u∗M (t), for spiking a Theta neuron with ω = 1 at various spiking times that are smaller\n\n(T = 3, 4) and greater (T = 8) than the natural spiking time T0 = 2π subject to M = 1. (b) The resulting optimal phase\ntrajectories following u∗M (t).\n\nthe amplitude constraint is inactive and obviously the optimal control is given by (9) and (10).\nHowever, if |u∗ (θ)| > M for some θ ∈ [0, 2π], then the optimal control u∗M is characterized by\n\nswitching between u∗ (θ) and the bound M (see Appendix B-2),\n\n\n∗\n\n\n −M, u (θ) < −M\nu∗M (θ) =\nu∗ (θ), −M ≤ u∗ (θ) ≤ M\n\n\n\n M,\nu(θ)∗ > M,\n\n(11)\n\nwhere the parameter λ0 for u∗ (θ) in (9) is calculated according to the desired spiking time T by\nZ 2π\n1\ndθ.\n(12)\nT =\nα + β cos θ + (1 − cos θ)u∗M\n0\n\nThe detailed derivation of the control u∗M is given in Appendix B-2. Fig. 2 illustrates the\n\noptimal controls and the corresponding trajectories for spiking a Theta neuron with natural\noscillation frequency ω = 1, i.e., I = 0.25, α = 1.25, and β = 0.75, at various spiking times\nthat are smaller (T = 3, 4) and greater (T = 8) than the natural spiking time T0 = 2π with the\ncontrol amplitude bound M = 1. Because the unconstrained minimum-power controls for the\ncases T = 4 < T0 and T = 8 > T0 , calculated according to (9), satisfy |u∗(θ)| < M, there are\nno switchings in these two cases.\n\nJanuary 5, 2012\n\nDRAFT\n\n\f12\n\nB. Time-Optimal Control of Two Neuron Oscillators\nSpiking a neuron in minimum time, subject to a given control amplitude, can be solved in a\nstraightforward manner. Consider the phase model of a single neuron as in (2), it is easy to see\nthat for a given control bound M > 0, the minimum spiking time is achieved by the bang-bang\ncontrol\n\n\n M,\nZ(θ) ≥ 0\n∗\nut =\n −M, Z(θ) < 0,\n\n(13)\n\nwhich keeps the phase velocity, θ̇, at its maximum. The minimum spiking time with respect to\nM\nthe control bound M, denoted by Tmin\n, is then given by\nZ\nZ\n1\n1\nM\ndθ +\ndθ,\nTmin =\nf (θ) + Z(θ)M\nf (θ) − Z(θ)M\n\n(14)\n\nθ∈B\n\nθ∈A\n\nwhere the sets A and B are defined as\nA = {θ| Z(θ) ≥ 0, 0 ≤ θ ≤ 2π} ,\nB = {θ| Z(θ) < 0, 0 ≤ θ ≤ 2π} .\nTime-optimal control of spiking two neurons is more involved, which can be formulated as in\nRT\n(8) with the cost functional J = 0 1dt and with\nΘ̇(t) = f (Θ) + Z(Θ)u(t),\n\n(15)\n\nwhere\n\n\nf =\n\nf1\nf2\n\n\n\n\n\n=\n\nα1 + β1 cos θ1\nα2 + β2 cos θ2\n\n\n\n,\n\n\n\nZ=\n\nZ1\nZ2\n\n\n\n\n\n=\n\n1 − cos θ1\n1 − cos θ2\n\n\n\n.\n\n(16)\n\nOur objective is to drive the two-neuron system from the initial state Θ0 = (0, 0)′ to the desired\nfinal state Θd = (2m1 π, 2m2 π)′ with minimum time, where m1 , m2 ∈ Z+ . The Hamiltonian for\nthis optimal control problem is given by\nH = λ0 + hλ, f + Zui,\n\n(17)\n\nwhere λ0 ∈ R and λ ∈ R2 are the multipliers that correspond to the Lagrangian and the system\n\ndynamics, respectively, and h , i denotes a scalar product in the Euclidean space E2 .\n\nProposition 1: The minimum-time control that spikes two Theta neurons simultaneously is\nbang-bang.\nJanuary 5, 2012\n\nDRAFT\n\n\f13\n\nProof. The Hamiltonian in (17) is minimized by the control,\n\n M\nfor φ(t) < 0,\nu(t) =\n −M for φ(t) > 0,\n\n(18)\n\nwhere φ is the switching function defined by φ = hλ, Zi. If there exists no non-zero time interval\nover which φ ≡ 0, then the optimal control is given by the bang-bang form as in (18), where\nthe control switchings are defined at φ = 0. We show by contradiction that maintaining φ = 0\nis not possible for any non-zero time interval. Suppose that φ(t) = 0 for some non-zero time\ninterval, t ∈ [τ1 , τ2 ], then we have\nφ =hλ, Zi = 0,\n\n(19)\n\nφ̇ =hλ, [f, Z] i = 0,\n\n(20)\n\nwhere [f, Z] denotes the Lie bracket of the vector fields f and Z. According to (19) and (20),\nλ is perpendicular to both vectors Z and [f, Z], where\n\n\n2 sin θ1\n∂f\n∂Z\n.\nf−\nZ=\n[f, Z] =\n∂θ\n∂θ\n2 sin θ2\n\nSince λ 6= 0 by the non-triviality condition of the maximum principle, Z and [f, Z] are linearly\ndependent on t ∈ [τ1 , τ2 ]. One can easily show that these two vectors are linearly dependent\neither when θ1 = 2nπ and θ2 ∈ R, θ1 ∈ R and θ2 = 2nπ, or θ1 = θ2 + 2nπ and θ2 ∈ R, where\nn ∈ Z. These three families of lines represent the possible paths in the state-space where φ can\nbe vanished for some non-trivial time-interval. Now we show that these are not feasible phase\ntrajectories that can be generated by a control. Suppose that (θ1 (τ ), θ2 (τ )) = (2nπ, α) for some\nτ > 0 and for some n ∈ Z, where α ∈ R. We then have θ ̇1 (τ ) = 2 6= 0, irrespective of any\ncontrol input. Hence, the system is immediately deviated from the line θ1 = 2nπ. The same\nreasoning can be used for showing the case of θ2 = 2nπ.\nSimilarly, if (θ1 (τ ), θ2 (τ )) = (α + 2nπ, α) for some τ > 0 and for some n ∈ Z, in order for\nthe system to remain on the line (θ1 (t), θ2 (t)) = (θ2 + 2nπ, θ2 ), it requires that θ ̇1 (t) = θ ̇2 (t) for\nt > τ . However, this occurs only when θ1 = 2mπ and θ2 = 2(n + m)π, where m ∈ Z, since\nθ ̇1 − θ ̇2 = (I1 −I2 )(1−cos θ1 ). Furthermore, staying on these points is impossible with any control\n\ninputs since for θ1 (τ ) = 2mπ and θ2 (τ ) = 2(n+m)π, the phase velocities are θ ̇1 (τ ) = θ ̇2 (τ ) = 2,\nwhich immediately forces the system to be away from these points. Therefore, the system cannot\nJanuary 5, 2012\n\nDRAFT\n\n\f14\n\nbe driven along the path (θ2 + 2nπ, θ2 ). This analysis concludes that φ = 0 and φ̇ = 0 do not\nhold simultaneously over a non-trivial time interval.\n\n\u0003\n\nNow, we construct the bang-bang structure for time-optimal control of this two-neuron system\nand, without loss of generality, let λ0 = 1.\nDefinition 1: We denote the vector fields corresponding to the constant bang controls u(t) ≡\n−M and u(t) ≡ M by X = f − MZ and Y = f + MZ, respectively, and call the respective\ntrajectories corresponding to them as X- and Y - trajectories. A concatenation of an X-trajectory\nfollowed by a Y -trajectory is denoted by XY , while the concatenation in the reverse order is\ndenoted by Y X.\nDue to the bang-bang nature of the time-optimal control for this system, it is sufficient for\nus to calculate the time between consecutive switches, and then the first switching time can be\ndetermined by the end point constraint. The inter-switching time can be calculated following the\nprocedure described in [42], [43], [44].\nLet p and q be consecutive switching points, and let pq be a Y -trajectory. Without loss of\ngenerality, we assume that this trajectory passes through p at time 0 and is at q at time τ . Since p\nand q are switching points, the corresponding multipliers vanish against the control vector field\nZ at those points, i.e.,\nhλ(0), Z(p)i = hλ(τ ), Z(q)i = 0.\n\n(21)\n\nAssuming that the coordinate of p = (θ1 , θ2 )′ , our goal is to calculate the switching time, τ , in\nterms of θ1 and θ2 . In order to achieve this, we need to compute what the relation hλ(τ ), Z(q)i =\n0 implies at time 0. This can be obtained by moving the vector Z(q) along the Y -trajectory\nbackward from q to p through the pushforward of the solution ω(t) of the variational equation\nalong the Y -trajectory with the terminal condition ω(τ ) = Z(q) at time τ . We denote by etY (p)\nthe value of the Y -trajectory at time t that starts at the point p at time 0 and by (e−tY )∗ the\nbackward evolution under the variational equation. Then we have\nω(0) = (e−τ Y )∗ ω(τ ) = (e−τ Y )∗ Z(q) = (e−τ Y )∗ Z(eτ Y (p)) = (e−τ Y )∗ Z eτ Y (p).\nSince the \"adjoint equation\" of the maximum principle is precisely the adjoint equation to\nthe variational equation, it follows that the function t 7→ hλ(t), ω(t)i is constant along the Y trajectory. Therefore, hλ(τ ), Z(q)i = 0 also implies that\nhλ(0), ω(0)i = hλ(0), (e−τ Y )∗ Z eτ Y (p)i = 0.\nJanuary 5, 2012\n\n(22)\nDRAFT\n\n\f15\n\nSince λ(0) 6= 0, we know from (21) and (22) that the two vectors Z(p) and (e−τ Y )∗ Z eτ Y (p)\nare linearly dependent. It follows that\nγZ(p) = (e−τ Y )∗ Z eτ Y (p),\n\n(23)\n\nwhere γ is a constant. We make use of a well-known Campbell-Baker-Hausdorff formula [45]\nto expand (e−τ Y )∗ Z eτ Y (p), that is,\n(e−τ Y )∗ Z eτ Y (p) = eτ adY (Z) =\nA straightforward computation of Lie brackets gives\n\n∞\nX\nτn\nn=0\n\nn!\n\nadnY Z.\n\n\n\nsin θ1\n\nadY Z = [Y, Z] = [f + MZ, Z] = [f, Z] = 2 \n\nsin θ2\n\nad2Y Z = [Y, [Y, Z]] = 2(f − AZ),\n\n\n\n,\n\nwhere A = diag {2(α1 − 2 + M), 2(α2 − 2 + M)}, and furthermore\nadY2n+1 Z = (−1)n 2n (A + MI)n [f, Z],\nadY2n+2 Z = (−1)n 2n+1 (A + MI)n (f − AZ).\nConsequently, we have\neτ adY Z =Z+\n\nP∞ τ 2n+2\nτ 2n+1\nn n\nn\nn n+1 (A+M I)n (f −AZ),\nn=0 (2n+1)! (−1) 2 (A+M I) [f,Z]+ n=0 (2n+2)! (−1) 2\n\nP∞\n\nwhich is further simplified to\n\n\n\n\neτ adY Z =\n\n\nα1 +M −(M −β1 ) cos θ1\nM −β1 −(α1 +M ) cos θ1\n+\n2(α1 −1+M )\n2(α1 −1+M )\n\ncos(2τ\n\n√\n\nM −β2 −(α2 +M ) cos θ2\nα2 +M −(M −β2 ) cos θ2\n+\n2(α2 −1+M )\n2(α2 −1+M )\n\ncos(2τ\n\n√\n\nsin θ1\nα1 −1+M\n\nα1 −1+M )+ √\n\nsin θ2\nα2 −1+M\n\nα2 −1+M )+ √\n\n√\n\n\n\nα1 −1+M ) \n\n.\n\n√\nsin(2τ α2 −1+M )\nsin(2τ\n\nThis together with (23) yields\n\u0014\n√\nM −β1 −(α1 +M ) cos θ1\nα +M −(M −β1 ) cos θ1\n+\ncos(2τ α1 −1+M )+ √\n(1−cos θ2 ) 1 2(α −1+M\n)\n2(α −1+M )\n1\n\n1\n\nsin θ1\nα1 −1+M\n\n\u0014\n√\nα +M −(M −β2 ) cos θ2\nM −β2 −(α2 +M ) cos θ2\n=(1−cos θ1 ) 2 2(α −1+M\n+\ncos(2τ α2 −1+M )+ √\n)\n2(α −1+M )\n2\n\n2\n\nsin(2τ\n\nsin θ2\nα2 −1+M\n\n√\n\nsin(2τ\n\n\u0015\nα1 −1+M )\n\n√\n\n\u0015\nα2 −1+M ) .\n\n(24)\n\nThis equation characterizes the inter-switching along the Y -trajectory, that is, the next switching\ntime τ can be calculated given the system starting with (θ1 , θ2 ) evolving along the Y -trajectory.\nSimilarly, the inter-switching along the X-trajectory can be calculated by substituting M with\n−M in (24).\nJanuary 5, 2012\n\nDRAFT\n\n\f16\n\nNote that the solution to (24) is not unique, and some of the solutions may not be optimal,\nwhich can be discarded in a systematic way. The idea is to identify those possible switching\npoints calculated from (24) with φ = 0 that also having the appropriate sign for φ̇. We focus\non the case where f and Z are linearly independent, since the case for those being linearly\ndependent restricts the state space to be the curve\n(α1 + β1 cos θ1 )(1 − cos θ2 ) = (α2 + β2 cos θ2 )(1 − cos θ1 ).\nIf f and Z are linearly independent, then [f, Z] can be written as [f, Z] = k1 f + k2 Z, where\n2 sin θ1 (1 − cos θ2 ) − 2 sin θ2 (1 − cos θ1 )\n,\n(α1 + β1 cos θ1 )(1 − cos θ2 ) − (α2 + β2 cos θ2 )(1 − cos θ1 )\n2 sin θ1 (α1 + β1 cos θ1 ) − 2 sin θ2 (α2 + β2 cos θ2 )\n.\nk2 =\n(α1 + β1 cos θ1 )(1 − cos θ2 ) − (α2 + β2 cos θ2 )(1 − cos θ1 )\nk1 =\n\nAs a result, we can write φ̇ = hλ, [f, Z]i = k1 hλ, f i + k2hλ, Zi. Since we know that at switching\npoints φ = hλ, Zi = 0, the Hamiltonian, as in (17), H = 0 and the choice of λ0 = 1 makes\nhλ, f i = −1. Therefore, at these points, we have φ̇ = −k1 , and the type of switching can be\ndetermined according to the sign of the function k1 . If k1 > 0, then it is an X to Y switch since\nφ̇ < 0 and hence φ changes its sign from positive to negative passing through the switching\npoint, which corresponds to switch the control from −M to M as in (18). Similarly, if k1 < 0,\nthen it is a Y to X switch. Therefore the next switching time will be the minimum non-zero\nsolution to the equation (24) that satisfy the above given rule. For example, suppose that the\nsystem is following a Y -trajectory starting with a switching point pi = (θ1i , θ2i )′ . The possible\ninter-switching times {τi,j }, j = 1, . . . , n, with τi,1 < τi,2 < . . . < τi,n can then be calculated\n\naccording to (24) based on pi . Thus, the next switching point is pr = (θ1r , θ2r )′ = eτi,r Y (pi ),\nτi,r = min{τi,1 , . . . , τi,n }, such that k1 (θ1r , θ2r ) < 0, which corresponds to an Y to X switch.\nNow in order to synthesize a time-optimal control, it remains to compute the first switching\n\ntime and switching point, since the consequent switching sequence can be constructed thereafter\nbased on the procedure described above. Given an initial state Θ0 = (0, 0)′, the first switching\ntime and point p1 will be determined according to the target state, e.g., Θd = (2m1 π, 2m2 π)′ ,\nwhere m1 , m2 ∈ Z+ , in such a way that the optimal trajectory follows a bang-bang control\nderived based on p1 will reach Θd . Under this construction, we may end up with a finite number\nof feasible trajectories starting with either X- or Y -trajectory, which reach the desired terminal\nstate. The minimum time trajectory is then selected among them.\nJanuary 5, 2012\n\nDRAFT\n\n\f17\n\n4π\n\nk <0\n1\n\n0.5\n\nk1>0\nY\nθ (I =0.9)\n\nt\n\nControl (u )\n\n0.25\nX\n\n2π\n\n2\n\n2\n\n0\n\n−0.25\n\nY\n\n−0.5\n0\n\n1.0\n\n1.87\n\n3.0\nTime (t)\n\n3.56 4.0\n\n5.0\n\n5.61\n\n(a)\nFig. 3.\n\n0\n\nπ\nθ ( I =0.3)\n1\n\n2π\n\n1\n\n(b)\n\n(a) Time optimal control for two Theta neuron system with I1 = 0.3 (α1 = 1.3, β1 = 0.7) and I2 = 0.9 (α2 =\n\n1.9, β2 = 0.1) to reach (2π, 4π) with the control bounded by M = 0.5 and (b) corresponding trajectories. The gray and white\nregions represent where k1 is negative and positive, respectively.\n\nFig. 3 illustrates an example of driving two Theta neurons time-optimally from (0, 0)′ to\n(2π, 4π)′ with the control bound M = 0.5, where the natural frequencies of the oscillators are\nω1 = 1.1 (I1 = 0.3) and ω2 = 1.9 (I2 = 0.9) corresponding to α1 = 1.3, β1 = 0.7 and α2 = 1.9,\nβ2 = 0.1. In this example, the time-optimal control has two switches at t = 1.87 and t = 3.56\nand the minimum time is 5.61.\nC. Simultaneous Control of Neuron Ensembles\nThe complexity of deriving optimal controls for higher dimensional systems, i.e., more than\ntwo neurons, grows rapidly, and it makes sense to find out how the control of two neurons\nrelates to the control of many. One may wonder whether it is possible to use a (optimal) control\nthat spikes two neurons to manipulate an ensemble of neurons whose natural frequencies lie\nbetween those of the two nominal systems. Of course, if trajectories of the neurons with different\nfrequencies have no crossings following a common control input, then the control designed for\nany two neurons guarantees to bound trajectories of all the neurons with their frequencies within\nthe range of these two nominal neurons, whose trajectories can then be thought of as the envelope\nof these other neuron trajectories. We now show that this is indeed the case.\nLemma 1: The trajectories of any two Theta neurons with positive baseline currents following\na common control input have no crossing points.\n\nJanuary 5, 2012\n\nDRAFT\n\n\f18\n\nProof. Consider two Theta neurons modeled by\nθ ̇1 = (1 + I1 ) + (1 − I1 ) cos θ1 + (1 − cos θ1 )u,\n\nθ1 (0) = 0,\n\n(25)\n\nθ ̇2 = (1 + I2 ) + (1 − I2 ) cos θ2 + (1 − cos θ2 )u,\n\nθ2 (0) = 0,\n\n(26)\n\nwith positive baseline currents, I1 , I2 > 0, and assume that ω1 < ω2 , which implies I1 < I2\nsince Ii =\n\nωi2\n,\n4\n\ni = 1, 2. In the absence of any control input, namely, u = 0, it is obvious\n\nthat θ1 (t) < θ2 (t) for all t > 0 since I1 < I2 . Suppose that θ1 (t) < θ2 (t) for t ∈ (0, τ ) and\nthese two phase trajectories meet at time τ , i.e., θ1 (τ ) = θ2 (τ ). Then, we have θ ̇1 (τ ) − θ ̇2 (τ ) =\n(I1 − I2 )(1 − cos(θ1 (τ ))) ≤ 0 and the equality holds only when the neurons spike at time τ ,\n\ni.e., θ1 (τ ) = θ2 (τ ) = 2nπ, n ∈ Z+ . As a result, θ1 (τ + ) < θ2 (τ + ), because θ1 (τ ) = θ2 (τ ) and\nθ ̇1 (τ ) < θ ̇2 (τ ), and hence there exist no crossings between the two trajectories θ1 (t) and θ2 (t).\n\u0003\nNote that the same result as Lemma 1 holds and can be shown in the same fashion for both\nSinusoidal and SNIPER phase models, as described in Section II-B2 and II-B3, when the modeldependent constant z1 > z2 if ω1 < ω2 , which is in general the case. For example, in the SNIPER\nphase model, z conventionally takes the form z = 2/ω as presented in Section II-B2.\nThis critical observation extremely simplifies the design of external stimuli for spiking a\nneuron ensemble with different oscillation frequencies based on the design for two neurons with\nthe extremal frequencies over this ensemble. We illustrate this important result by designing\noptimal controls for two Theta and two Sinusoidal neurons employing the Legendre pseudospectral method, which will be presented in Section IV. Fig. 4 shows the optimized controls and\ncorresponding trajectories for Theta and Sinusoidal neurons with their frequencies ω belonging\nto [0.9, 1.1] and [1.0, 1.1], respectively. The optimal controls are designed based only on the\nextremal frequencies of these two ranges, i.e., 0.9 and 1.1 for the Theta neuron model and 1.0\nand 1.1 for the Sinusoidal model.\nThis design principle greatly reduces the complexity of finding controls to spike a large\nnumber of neurons. Although the optimal control for two neurons is in general not optimal for\nthe others, this method produces a good approximate optimal control. In the next section, we will\nintroduce a multivariate pseudospectral computational method for constructing optimal spiking\nor synchronization controls.\n\nJanuary 5, 2012\n\nDRAFT\n\n\f19\n\nIV. C OMPUTATIONAL O PTIMAL C ONTROL\n\nOF\n\nS PIKING N EURON N ETWORKS\n\nAs we move to consider the synthesis of controls for neuron ensembles, the analytic methods\nused in the one and two neuron case become impractical to use. As a result, developing\ncomputational methods to derive inputs for ensembles of neurons is of particular practical interest.\nWe solve the optimal control problem in (8) using a modified pseudospectral method. Global\npolynomials provide accurate approximations in such a method which has shown to be effective\nin the optimal ensemble control of quantum mechanical systems [46], [47], [48], [49]. Below\nwe outline the main concepts of the pseudospectral method for optimal control problems and\nthen show how it can be extended to consider the ensemble case.\nSpectral methods involve the expansion of functions in terms of orthogonal polynomial basis\nfunctions on the domain [−1, 1] (similar to Fourier series expansion), facilitating high accuracy\nwith relatively few terms [50]. The pseudospectral method is a spectral collocation method\nin which the differential equation describing the state dynamics is enforced at specific nodes.\nDeveloped to solve partial differential equations, these methods have been recently adopted to\nsolve optimal control problems [51], [52], [53]. We focus on Legendre pseudospectral methods\nand consider the transformed optimal control problem on the time domain [−1, 1].\nThe fundamental idea of the Legendre pseudospectral method is to approximate the continuous\nstate and control functions, Θ(t) and u(t), by N th order Lagrange interpolating polynomials,\nIN Θ(t) and IN u(t), based on the Legendre-Gauss-Lobatto (LGL) quadrature nodes, which are\ndefined by the union of the endpoints, {−1, 1}, and the roots of the derivative of the N th order\nLegendre polynomial. Note that the non-uniformity in the distribution of the LGL nodes and the\nhigh density of nodes near the end points are a key characteristic of pseudospectral discretizations\nby which the Runge phenomenon is effectively suppressed [54]. The interpolating approximations\nof the state and control functions, Θ(t) and u(t) can be expressed as functions of the Lagrange\npolynomials, lk (t), [55]\nΘ(t) ≈ IN Θ(t) =\nu(t) ≈ IN u(t) =\n\nJanuary 5, 2012\n\nN\nX\n\nΘ̄k lk (t),\n\n(27)\n\nk=0\n\nN\nX\n\nūk lk (t).\n\nk=0\n\nDRAFT\n\n\f20\n\nThe derivative of IN Θ(t) at the LGL node tj , j = 0, 1, . . . , N, is given by\nN\n\nN\n\nX\nX\nd\nΘ̄k l̇k (tj ) =\nDjk Θ̄k ,\nIN Θ(tj ) =\ndt\nk=0\nk=0\n\nwhere Djk are elements of the constant (N + 1) × (N + 1) differentiation matrix [50]. Finally,\nthe integral cost functional in the optimal control problem (8) can be approximated by the\nGauss-Lobatto integration rule, and we ultimately convert the optimal control problem into the\nfollowing finite-dimensional constrained minimization problem\nN\nT X 2\nmin\nū wj\n2 j=0 j\n\ns.t.\n\nN\nX\n\nDjk Θ̄k =\n\nk=0\n\ni\nTh\nf (Θ̄j ) + ūj Z(Θ̄j ) ,\n2\n\n(28)\n\nΘ̄(−1) = 0,\nΘ̄(1) = Θd ,\n\n∀ j ∈ {0, 1, . . . , N},\n\nwhere Θd = (2m1 π, 2m2 π, . . . , 2mn π)′ , mi ∈ Z+ , i = 1, . . . , n, is the target state and wj are\nthe LGL weights given by\nwj =\n\n1\n2\n,\nN(N + 1) (LN (tj ))2\n\nin which LN is the N th order Legendre polynomial. Solvers for this type of constrained nonlinear\nprograms are readily available and straightforward to implement.\nRemark 2 (Extension to an infinite ensemble of neuron systems): The pseudospectral computational method can be readily extended to consider an infinite population of neurons, for instance,\nwith the frequency distribution over a closed interval, ω ∈ [ωa , ωb ] ⊂ R+ . In such a case, the\nparameterized state function can be approximated by a two-dimensional interpolating polynomial,\nnamely, Θ(t, ω) ≈ IN ×Nω Θ(t, ω), based on the LGL nodes in the time t and the frequency ω\ndomain. Similarly, the dynamics of the state can be expressed as an algebraic constraint and a\ncorresponding minimization problem can be formed [47].\nA. Optimized Ensemble Controls\nWe can now apply the above methodology to synthesize optimal controls for neuron ensembles.\nSince neurons modeled by the SNIPER PRC are special cases of the Theta neuron, here we\nJanuary 5, 2012\n\nDRAFT\n\n\f21\n\nπ\n\nπ\n\nπ\n\nπ\n\nπ\n\nπ\n\nπ\n\nπ\n\nFig. 4. The controls (top) and state trajectories (bottom) of Theta (left) and Sinusoidal (right) PRC neuron models (for α = 1,\nβ = 0.1, T = 2π in (29)). The Theta model is optimized for ω ∈ [0.9, 1.1]. The Sinusoidal model is optimized for ω ∈ [1.0, 1.1].\nThe gray states correspond to uncontrolled state trajectories, and provide a comparison for the synchrony improvement provided\nby the compensating optimized ensemble control.\n\nconsider Theta and Sinusoidal neuron models. The computational method outlined above permits\na flexible framework to optimize based on a very general cost functional subject to general\nconstraints. We illustrate this by selecting an objective of the type,\nZ T\n2\nJ = αkΘd − Θ(T )k + β\nu2 (t)dt,\n\n(29)\n\n0\n\nwhich minimizes the terminal error and input energy with a relative scaling given by the constants\nα and β. In highly complex problems, such as those given by ensemble systems as described\nin Remark 2, this scaling provides a tunable parameter that determines the trade-off between\nperformance and input energy.\nFig. 4 shows the optimized controls and corresponding trajectories for Theta and Sinusoidal\nneuron models for α = 1, β = 0.1, T = 2π, and ω belongs to [0.9, 1.1] and [1.0, 1.1] respectively.\nIn this optimization, the controls are optimized over the two neuron systems with extremal\nfrequencies, whose trajectories form an envelope, bounding the trajectories of other frequencies\nin between, as described in Section III-C. We are able to design compensating controls for the\nJanuary 5, 2012\n\nDRAFT\n\n\f22\n\nπ\nπ\n\nω=\n\nπ\n\nω=\n\nπ\n\nω=\nω=\n\nπ\nω=\nπ\n\nπ\n\nπ\n\nπ\n\nFig. 5. The controls and amplitude constrained controls, A ≤ 2.5, upper left and right respectively, of a Sinusoidal PRC neuron\nmodel driving five frequencies, (ω1 , ω2 , ω3 , ω4 , ω5 ) = (1, 2, 3, 4, 5), to the desired targets Θ(T ) = (2π, 4π, 6π, 8π, 10π) when\nT = 2π − 0.5. These controls yield highly similar state trajectories (left, shown for unconstrained control) and spiking sequences\n(right, shown for constrained control), which corresponds to when the state trajectories cross multiples of 2π. Black coloring\nindicates a controlled state trajectory or spike sequence, whereas gray coloring indicates a trajectory or spike sequence without\ncontrol.\n\nentire frequency band solely by considering these upper and lower bounding frequencies. The\ncontrolled (black) and uncontrolled (gray) state trajectories clearly show the improvement in\nsimultaneous spiking of the ensemble of neurons. While a bound is necessary to provide in\npractice, the inclusion of the minimum energy term in the cost function serves to regularize the\ncontrol against high amplitude values.\nIn Fig. 5, we demonstrate the flexibility of the method to drive multiple Sinusoidal neurons\nto desired targets. In particular we seek to simultaneously spike five frequencies with widely\ndispersed frequency values at a time T different from their natural period. In this figure we\nconsider the frequencies (ω1 , ω2 , ω3, ω4 , ω5 ) = (1, 2, 3, 4, 5) and design controls to drive these\nsystems to (2π, 4π, 6π, 8π, 10π), respectively, at a time T = 2π − 0.5. Controls for minimum\nenergy (α = 0, β = 1) transfer can be designed for both the unconstrained and amplitude\nconstrained cases (shown for A ≤ 2.5). In both cases, the state trajectories and spike sequence\n(shown in the lower half of the figure) follow the same general pattern. The spike train shows\nthat the controls are able to advance the firing of each neuron so that all five spike simultaneously\n\nJanuary 5, 2012\n\nDRAFT\n\n\f23\n\nπ\nπ\n\nω=\n\nπ\n\nω=\nω=\n\nπ\n\nω=\nπ\nω=\nπ\n\nFig. 6.\n\nπ\n\nπ\n\nπ\n\nThe controls and amplitude constrained controls, A ≤ 2, upper left and right respectively, of a Theta PRC neuron\n\nmodel driving five frequencies, ω = (ω1 , ω2 , ω3 , ω4 , ω5 ) = (1, 2, 3, 4, 5), to the desired targets Θ(T ) = (2π, 4π, 6π, 8π, 10π)\nwhen T = 2π − 0.5. These controls yield highly similar state trajectories (left, shown for unconstrained control) and spiking\nsequences (right, shown for constrained control), which corresponds to when the state trajectories cross multiples of 2π. Black\ncoloring indicates a controlled state trajectory or spike sequence, whereas gray coloring indicates a trajectory or spike sequence\nwithout control.\n\nat the desired terminal time. Again the gray coloring indicates uncontrolled trajectories or spike\ntrains and offers a comparison of improvement in synchrony.\nSimilarly, Fig. 6 provides the same presentation as above for the minimum energy transfer for\nTheta neurons of the same frequencies to the same desired targets. In this case the constrained\ncontrol is limited to A ≤ 2.\nV. C ONCLUSION\nIn this paper, we considered the control and synchronization of a neuron ensemble described\nby phase models. We showed that this ensemble system is controllable for various commonlyused phase models. We also derived minimum-power and time-optimal controls for single and\ntwo neuron systems. The development of such optimal controls is of practical importance, for\nexample, in therapeutic procedures such as deep brain stimulation for Parkinson's disease and\ncardiac pacemakers for heart disease. In addition, we adopted a computational pseudospectral\nmethod for constructing optimal controls that spike neuron ensembles, which demonstrated the\nunderlying controllability properties of such neuron systems. The methodology resulting from this\nJanuary 5, 2012\n\nDRAFT\n\n\f24\n\nwork can be applied not only to neuron oscillators but also to any oscillating systems that can be\nrepresented using similar model reduction techniques such as biological, chemical, electrical, and\nmechanical oscillators. A compelling extension of this work is to consider networks of coupled\noscillators, whose interactions are characterized by a coupling function, H, acting between each\npair of oscillators. For example, in the well-known Kuramoto's model, the coupling between the\n(i, j)-pair is characterized by the sinusoidal function of the form H(θi , θj ) = sin(θi − θj ) [19].\nThe procedure presented in Theorem 2 can be immediately applied to examine controllability\nof interacting oscillators by investigating the recurrence properties of the vector field f + H,\nand the Lie algebra {f + H, Z}LA . Similarly, the pseudospectral method presented in Section\nIV and its extension addressed in Remark 2 can be employed to calculate optimal controls for\nspiking or synchronizing networks of coupled neurons with their natural frequencies varying on\na continuum.\nA PPENDIX A\nC HOW ' S T HEOREM\nTheorem 3: (Versions of Chow's Theorem) Let {f1 (x), f2 (x), . . . , fm (x)} be a collection of\nvector fields such that the collection {f1 (x), f2 (x), . . . , fm (x)}LA is\na) analytic on an analytic manifold M. Then given any point x0 ∈ M, there exists a maximal\nsubmanifold N ⊂ M containing x0 such that {exp{xi }}G x0 = {exp{xi }LA }G x0 = N.\n\nb) C ∞ on a C ∞ manifold M with dim (span{fi (x)}LA ) constant on M. Then given any\npoint x0 ∈ M, there exists a maximal submanifold N ⊂ M containing x0 such that\n{exp{xi }}G x0 = {exp{xi }LA }G x0 = N.\nFor more details, please see [35].\nA PPENDIX B\nO PTIMAL C ONTROL\n\nJanuary 5, 2012\n\nOF A\n\nS INGLE T HETA N EURON\n\nDRAFT\n\n\f25\n\n1) Unbounded Minimum-Power Control of a Theta Neuron: The minimum-power control of\na single Theta neuron is formulated as\nZ T\nmin\nu2 (t)dt,\n0\n\ns.t.\n\nθ̇ = α + β cos θ + (1 − cos θ)u(t),\nθ(0) = 0,\n\nθ(T ) = 2π.\n\nWe then can form the control Hamiltonian,\nH = u2 + λ(α + β cos θ + u − u cos θ),\n\n(30)\n\nwhere λ is the Lagrange multiplier. The necessary conditions for optimality from the maximum\nprinciple yield\nλ̇ = −\n\n∂H\n= λ(β − u) sin θ,\n∂θ\n\n(31)\n\n∂H\n= 2u + λ(1 − cos θ) = 0.\n∂u\nThus, the optimal control u satisfies\n1\nu = − λ(1 − cos θ).\n2\n\n(32)\n\nWith (32) and (31), this optimal control problem is transformed to a boundary value problem,\nwhose solution characterizes the optimal trajectories,\nλ\nθ̇ = α + β cos θ − (1 − cos θ)2 ,\n2\n2\nλ\nλ̇ = λβ + (1 − cos θ) sin θ,\n2\n\n(33)\n(34)\n\nwith boundary conditions θ(0) = 0 and θ(T ) = 2π, while λ0 = λ(0) and λ(T ) are unspecified.\nAdditionally, since the Hamiltonian is not explicitly dependent on time, the optimal triple\n(λ, θ, u) satisfies H(λ, θ, u) = c, ∀ 0 ≤ t ≤ T , where c is a constant. Together with (32) and\n(30), this yields\nλ(α + β cos θ) −\n\nλ2\n(1 − cos θ)2 = c.\n4\n\n(35)\n\nSince θ(0) = 0, c = 2λ0 , where λ0 is undetermined. The optimal multiplier can be found by\nsolving the above quadratic equation (35), which gives\np\n2(α + β cos θ) ± 2 (α + β cos θ)2 − 2λ0 (1 − cos θ)\nλ=\n,\n(1 − cos θ)2\nJanuary 5, 2012\n\n(36)\nDRAFT\n\n\f26\n\nand then, from (33), the optimal phase trajectory follows\np\nθ̇ = ∓ (α + β cos θ)2 − 2λ0 (1 − cos θ).\n\nIntegrating (37), we find the spiking time T in terms of the initial condition λ0 ,\nZ 2π\n1\np\ndθ.\nT =\n2\n(α + β cos θ) − 2λ0 (1 − cos θ)\n0\n\n(37)\n\n(38)\n\nNote that we choose the positive sign in (37), which corresponds to forward phase evolution.\nTherefore, given a desired spiking time T of the neuron, the initial value λ0 can be found via\nthe one-to-one relation in (38). Consequently, the optimal trajectories of θ and λ can be easily\ncomputed by evolving (33) and (34) forward in time. Plugging (36) into (32), we obtain the\noptimal feedback law for spiking a Theta neuron at time T ,\np\n−(α + β cos θ) + (α + β cos θ)2 − 2λ0 (1 − cos θ)2\n∗\nu(t) =\n.\n1 − cos θ\n\n(39)\n\n2) Bounded Minimum-Power Control of a Theta Neuron: Given the bound M on the control\namplitude, if |u∗ (t)| ≤ M for all t ∈ [0, T ], then the amplitude constraint is inactive and obviously\n\nthe bounded minimum-power control is given by (39) and (38). If, however, |u∗ (t)| > M for\nsome time interval, e.g., t ∈ [t1 , t2 ] ⊂ [0, T ], which alternatively corresponds to |u∗ (θ)| > M\n\nfor θ(t1 ) = θ1 , θ(t2 ) = θ2 , and θ ∈ [θ1 , θ2 ] ⊂ [0, 2π], the amplitude constraint is active and the\noptimal control will depend on M. We first consider u∗ (θ) > M for θ ∈ [θ1 , θ2 ] and observe in\n\nthis case that u(θ) = M is the minimizer of the Hamiltonian H as in (30), since H is convex in\nu. The Hamiltonian for this interval is then given by H = M 2 + λ(α + β cos θ + M − M cos θ).\nBecause, by the maximum principle, H is a constant along the optimal trajectory, the Lagrange\nmultiplier λ is given by,\nλ=\n\nc − M2\n,\nα + β cos θ + M − M cos θ\n\n(40)\n\nwhich satisfies the adjoint equation (31). Therefore, u(θ) = M is optimal for θ ∈ [θ1 , θ2 ]. The\nvalue of the constant c = 2λ0 can be determined by applying the initial conditions, θ(0) = 0\nand λ(0) = λ0 to (30). Similarly, we can show that u(t) = −M is optimal when u∗ (θ) < −M\nfor some θ ∈ [θ3 , θ4 ] ⊂ [0, 2π]. Consequently, the constrained optimal control can be synthesized\naccording to (11) and (12).\nNote that the number of time intervals that |u∗ (θ)| > M defines the number of switches in the\n\noptimal control law. Specifically, if |u∗ (θ)| > M for n time intervals, then the optimal control\nJanuary 5, 2012\n\nDRAFT\n\n\f27\n\nwill have 2n switches. Here we consider the simplest case, where the optimal control has only\ntwo switches, which is actually the only case for the Theta neuron model. As a result, suppose\nthat u∗ (θ) > M for only one time interval, and then there are two switching angles θ1 and θ2 at\nwhich u∗ (θ1 ) = u∗ (θ2 ) = M. These two conditions, together with (12), determine the unknown\nparameters θ1 , θ2 , and λ0 that characterize the bounded optimal control, u∗M , as given in (11)\nfor the specified spiking time T . Note that the range of feasible spiking times is determined by\nthe bound of the control amplitude M. A complete characterization of possible spiking range\ncan be found in [27].\nR EFERENCES\n[1] S. Strogatz, Nonlinear Dynamics And Chaos: With Applications To Physics, Biology, Chemistry, And Engineering, 1st ed.,\nser. Studies in nonlinearity.\n\nWestview Press, 2001.\n\n[2] P. Uhlhaas and W. Singer, \"Neural synchrony in brain disorders: Relevance for cognitive dysfunctions and pathophysiology,\"\nNeuron, vol. 52, no. 1, pp. 155–168, 2006.\n[3] F. Hanson, \"Comparative studies of firefly pacemakers,\" Federation proceedings, vol. 38, no. 8, pp. 2158–2164, 1978.\n[4] R. Mirollo and S. Strogatz, \"Synchronization of pulse-coupled biological oscillators,\" SIAM Journal on Applied Mathematics, vol. 50, no. 6, pp. 1645–1662, 1990.\n[5] G. Ermentrout and J. Rinzel, \"Beyond a pacemaker's entrainment limit: phase walk-through,\" American Journal of\nPhysiology - Regulatory, Integrative and Comparative Physiology, vol. 246, no. 1, 1984.\n[6] T. Nishikawa, N. Gulbahce, and A. E. Motter, \"Spontaneous reaction silencing in metabolic optimization,\" PLoS\nComputational Biology, vol. 4, no. 12, p. e1000236, 2008.\n[7] I. Fischer, Y. Liu, and P. Davis, \"Synchronization of chaotic semiconductor laser dynamics on subnanosecond time scales\nand its potential for chaos communication,\" Physical Review A, vol. 62, 2000.\n[8] I. Blekhman, Synchronization in science and technology.\n\nNew York: ASME Press translations, 1988.\n\n[9] T. Harada, H. Tanaka, M. Hankins, and I. Kiss, \"Optimal waveform for the entrainment of a weakly forced oscillator,\"\nPhysical Review Letters, vol. 105, no. 8, 2010.\n[10] I. Z. Kiss, C. G. Rusin, H. Kori, and J. L. Hudson, \"Engineering complex dynamical structures: Sequential patterns and\ndesynchronization,\" Science, vol. 316, no. 5833, pp. 1886–1889, 2007.\n[11] P. Ashwin and J. Swift, \"The dynamics of n weakly coupled identical oscillators,\" Journal of Nonlinear Science, vol. 2,\nno. 6, pp. 69–108, 1992.\n[12] A. L. Benabid and P. Pollak, \"Long-term suppression of tremor by chronic stimulation of the ventral intermediate thalamic\nnucleus,\" Lnacent, vol. 337, pp. 403–406, 1991.\n[13] S. Schiff, \"Controlling chaos in the brain,\" Nature, vol. 370, pp. 615–620, 1994.\n[14] F. C. Hoppensteadt and E. M. Izhikevich, \"Synchronization of mems resonators and mechanical neurocomputing,\" IEEE\nTransactions On Circuits And Systems I-Fundamental Theory And Applications, vol. 48, no. 2, pp. 133–138, 2001.\n[15] --, \"Synchronization of laser oscillators, associative memory, and optical neurocomputing,\" Physical Review E, vol. 62,\nno. 3, pp. 4010–4013, 2000.\n\nJanuary 5, 2012\n\nDRAFT\n\n\f28\n\n[16] A. Zlotnik and J.-S. Li, \"Optimal asymptotic entrainment of phase-reduced oscillators,\" in ASME Dynamic Systems and\nControl Conference, Arlington, VA, October 2011.\n[17] A. T. Winfree, The Geometry of Biological Time. Springer-Verlag, New York, 1980.\n[18] L. Glass, \"Cardiac arrhythmias and circle maps-a classical problem,\" Chaos, vol. 1, no. 1, pp. 13–19, 1991.\n[19] Y. Kuramoto, Chemical Oscillations, Waves, and Turbulence.\n\nNew York: Springer, 1984.\n\n[20] J. A. Acebron, L. L. Bonilla, C. J. P. Vicente, F. Ritort, and R. Spigler, \"The kuramoto model: A simple paradigm for\nsynchronization phenomena,\" Reviews Of Modern Physics, vol. 77, no. 1, pp. 137–185, 2005.\n[21] I. Z. Kiss, Y. M. Zhai, and J. L. Hudson, \"Predicting mutual entrainment of oscillators with experiment-based phase\nmodels,\" Physical Review Letters, vol. 94, no. 24, p. 248301, 2005.\n[22] A. J. Preyer and R. J. Butera, \"Neuronal oscillators in aplysia californica that demonstrate weak coupling in vitro,\" Physical\nReview Letters, vol. 95, no. 13, p. 4, 2005.\n[23] J. C. B. T. I. Netoff, C. D. Acker and J. A. White, \"Beyond two-cell networks: experimental measurement of neuronal\nresponses to multiple synaptic inputs,\" Journal Of Computational Neuroscience, vol. 18, no. 3, pp. 287–295, 2005.\n[24] T. Kano and S. Kinoshita, \"Control of individual phase relationship between coupled oscillators using multilinear feedback,\"\nPhysical Review E, vol. 81, p. 026206, 2010.\n[25] C. G. Rusin, H. Kori, I. Z. Kiss, and J. L. Hudson, \"Synchronization engineering: tuning the phase relationship between\ndissimilar oscillators using nonlinear feedback.\" Philosophical Transactions of the Royal Society A-Mathematical Physical\nAnd Engineering Sciences, vol. 368, no. 1918, pp. 2189–2204, 2010.\n[26] Y. Zhai, I. Z. Kiss, and J. L. Hudson, \"Control of complex dynamics with time-delayed feedback in populations of chemical\noscillators: Desynchronization and clustering,\" Ind. & Eng. Chem. Res., vol. 47, no. 10, pp. 3502–3514, 2008.\n[27] I. Dasanayake and J.-S. Li, \"Optimal design of minimum-power stimuli for phase models of neuron oscillators,\" Physical\nReview E, vol. 83, p. 061916, 2011.\n[28] --, \"Constrained minimum-power control of spiking neuron oscillators,\" in 50th IEEE Conference on Decision and\nControl, Orlando, FL, December 2011.\n[29] --, \"Charge-balanced minimum-power controls for spiking neuron oscillators,\" IEEE Transactions on Automatic Control\n(under review).\n[30] A. Nabi and J. Moehlis, \"Charge-balanced optimal input for phase models of spiking neurons,\" in Proc. ASME Dynamic\nSystem and Control Conference, 2009, pp. 278–292.\n[31] E. Brown, J. Moehlis, and P. Holmes, \"On the phase reduction and response dynamics of neural oscillator populations,\"\nNeural Computation, vol. 16, no. 4, pp. 673–715, 2004.\n[32] E. Izhikevich, Dynamical Systems in Neuroscience, ser. Neuroscience.\n\nMIT Press, 2007.\n\n[33] J. Moehlis, E. Brown, and H. Rabitz, \"Optimal inputs for phase models of spiking neurons,\" Journal of Computational\nand Nonlinear Dynamics, vol. 1, pp. 358–367, 2006.\n[34] B. Ermentrout, \"Type I membranes, phase resetting curves, and synchrony,\" Neural Computation, vol. 8, no. 5, pp. 979–\n1001, 1996.\n[35] R. Brockett, \"Nonlinear systems and differential geometry,\" Proceedings of the IEEE, vol. 64, no. 1, pp. 61–72, 1976.\n[36] B. M. Levitan and V. V. Zhikov, Almost periodic functions and differential equations. Cambridge: Cambridge University\nPress, 1982.\n[37] R. Rose and J. Haindmarsh, \"The assembly of ionic currents in a thalamic neuron i. the three-dimensional model,\" Proc.\nR. Soc. Lond. B, vol. 237, pp. 267–28, 1989.\n\nJanuary 5, 2012\n\nDRAFT\n\n\f29\n\n[38] J. Keener and J. Sneyd, Mathematical Physiology.\n\nNew York: Springer-Verlag, 1998.\n\n[39] S. Sastry and R. Montgomery, \"The structure of optimal controls for a steering problem,\" in Proc. IFAC Symposium on\nNonlinear Control Systems, 1992.\n[40] R. Montgomery, \"Optimal control of deformable bodies, isoholonomic problems and sub-riemannian geometry,\" in\nTechnical Report 05324-89, Mathematical Sciences Research Institute, 1989.\n[41] W. Marks, \"Deep brain stimulation for dystonia,\" Curr. Treat. Options Neurol., pp. 237–243, 2005.\n[42] H. J. Sussmann, Time-Optimal Control in the Plane, in Feedback Control of Linear and Non-linear Systems, Lecture Notes\nin Control and Information Sciences.\n\nBerlin: Springer-Verlag, 1982.\n\n[43] --, \"The structure of time-optimal trajectories for single-input systems in the plane: The c∞ nonsingular case,\" SIAM\nJ. Control Optim., vol. 25, pp. 433–465, 2004.\n[44] D. Stefanatos, H. Schaettler, and J.-S. Li, \"Minimum-time frictionless atom cooling in harmonic traps,\" SIAM Journal on\nControl and Optimization, vol. 49, no. 6, pp. 2440–2462, 2011.\n[45] A. Isidodri, Nonlinear Control Systems.\n\nLondon: Springer, 1995.\n\n[46] J.-S. Li, J. Ruths, T.-Y. Yu, H. Arthanari, and G. Wagner, \"Optimal pulse design in quantum control: A unified computational\nmethod,\" Proceedings of the National Academy of Sciences, vol. 108, no. 5, pp. 1879–1884, 2011.\n[47] J. Ruths and J.-S. Li, \"A multidimensional pseudospectral method for optimal control of quantum ensembles,\" Journal of\nChemical Physics, vol. 134, p. 044128, 2011.\n[48] --, \"Optimal control of inhomogeneous ensembles,\" IEEE Transactions on Automatic Control: Special Issue on Control\nof Quantum Mechanical Systems (in press).\n[49] J. Ruths, A. Zlotnik, and J.-S. Li, \"Convergence of a pseudospectral method for optimal control of complex dynamical\nsystems,\" in 50th IEEE Conference on Decision and Control, Orlando, FL, December 2011.\n[50] C. Canuto, M. Y. Hussaini, A. Quarteroni, and T. A. Zang, Spectral Methods.\n\nBerlin: Springer, 2006.\n\n[51] G. Elnagar, M. A. Kazemi, and M. Razzaghi, \"The pseudospectral legendre method for discretizing optimal control\nproblems,\" IEEE Transactions on Automatic Control, vol. 40, no. 10, pp. 1793–1796, 1995.\n[52] M. Ross and F. Fahroo, \"Legendre pseudospectral approximations of optimal control problems,\" in New Trends in Nonlinear\nDynamics and Control, W. Kang, M. Xiao, and C. R. Borges, Eds. Berlin: Springer, 2003, pp. 327–342.\n[53] F. Fahroo and I. Ross, \"Costate estimation by a legendre pseudospectral method,\" Journal of Guidance, Control, and\nDynamics, vol. 24, no. 2, pp. 270–277, 2001.\n[54] B. Fornberg, A Practical Guide to Pseudospectral Methods.\n[55] G. Szego, Orthogonal Polynomials.\n\nJanuary 5, 2012\n\nCambridge University Press, 1998.\n\nNew York: American Mathematical Society, 1959.\n\nDRAFT\n\n\f"}