{"id": "http://arxiv.org/abs/0903.1704v1", "guidislink": true, "updated": "2009-03-10T07:54:36Z", "updated_parsed": [2009, 3, 10, 7, 54, 36, 1, 69, 0], "published": "2009-03-10T07:54:36Z", "published_parsed": [2009, 3, 10, 7, 54, 36, 1, 69, 0], "title": "Spectrum of a fluid-loaded vibrating plate: the multiple resonance\n  phenomenon", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0903.5476%2C0903.0847%2C0903.2735%2C0903.3139%2C0903.4301%2C0903.1500%2C0903.3534%2C0903.0975%2C0903.3381%2C0903.4824%2C0903.4337%2C0903.0494%2C0903.1991%2C0903.1592%2C0903.5321%2C0903.5079%2C0903.4159%2C0903.1229%2C0903.3024%2C0903.0970%2C0903.1086%2C0903.4447%2C0903.1628%2C0903.3917%2C0903.0315%2C0903.2475%2C0903.4632%2C0903.2820%2C0903.5201%2C0903.2713%2C0903.2500%2C0903.3339%2C0903.1476%2C0903.2804%2C0903.5190%2C0903.0868%2C0903.1493%2C0903.2021%2C0903.5388%2C0903.1432%2C0903.4511%2C0903.4410%2C0903.4207%2C0903.0354%2C0903.1274%2C0903.5329%2C0903.1468%2C0903.4582%2C0903.2756%2C0903.2018%2C0903.2463%2C0903.5351%2C0903.5300%2C0903.3083%2C0903.1252%2C0903.4888%2C0903.1704%2C0903.4909%2C0903.2748%2C0903.3965%2C0903.5472%2C0903.1463%2C0903.0260%2C0903.3550%2C0903.3905%2C0903.0808%2C0903.3563%2C0903.4015%2C0903.3756%2C0903.5122%2C0903.2156%2C0903.1983%2C0903.4018%2C0903.2967%2C0903.2229%2C0903.1393%2C0903.2012%2C0903.4523%2C0903.2042%2C0903.0916%2C0903.2897%2C0903.5113%2C0903.1492%2C0903.2193%2C0903.4126%2C0903.2212%2C0903.0340%2C0903.3898%2C0903.4700%2C0903.1862%2C0903.1310%2C0903.3883%2C0903.3031%2C0903.5490%2C0903.4418%2C0903.2720%2C0903.4593%2C0903.0433%2C0903.2355%2C0903.4308%2C0903.2124&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Spectrum of a fluid-loaded vibrating plate: the multiple resonance\n  phenomenon"}, "summary": "It was recently observed in a numerical study on a high order perturbation\nmethod under heavy fluid loading that a loaded vibrating plate results, not\nonly in the classical frequency shift of the in vacuo single resonance (in both\nthe real part because of the fluid added mass and the imaginary part because of\nenergy lost by radiation), but also in an increase in the number of the\nresonance. As a result of the loading, a single in vacuo resonance of the\nstructure is transformed into a multiple resonance. Here we show that this\nphenomenon is a refinement of the Sanchez's classical result where it was\nestablished, using asymptotic analysis, that in the case of a light loading\nconditions \" the scattering frequencies of a fluid loaded elastic structure (ie\nthe resonance frequencies) are nearly the real eigenfrequencies of the elastic\nbody alone and the complex scattering frequencies of the fluid with a rigid\nsolid \". A theoretical explanation of the multiple resonances is given using\nclassical results on theory of entire functions. It is established that every\nsingle in vacuo resonance of a simply supported rectangular plate is\ntransformed into an infinite number of resonances under fluid-loading\ncondition.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0903.5476%2C0903.0847%2C0903.2735%2C0903.3139%2C0903.4301%2C0903.1500%2C0903.3534%2C0903.0975%2C0903.3381%2C0903.4824%2C0903.4337%2C0903.0494%2C0903.1991%2C0903.1592%2C0903.5321%2C0903.5079%2C0903.4159%2C0903.1229%2C0903.3024%2C0903.0970%2C0903.1086%2C0903.4447%2C0903.1628%2C0903.3917%2C0903.0315%2C0903.2475%2C0903.4632%2C0903.2820%2C0903.5201%2C0903.2713%2C0903.2500%2C0903.3339%2C0903.1476%2C0903.2804%2C0903.5190%2C0903.0868%2C0903.1493%2C0903.2021%2C0903.5388%2C0903.1432%2C0903.4511%2C0903.4410%2C0903.4207%2C0903.0354%2C0903.1274%2C0903.5329%2C0903.1468%2C0903.4582%2C0903.2756%2C0903.2018%2C0903.2463%2C0903.5351%2C0903.5300%2C0903.3083%2C0903.1252%2C0903.4888%2C0903.1704%2C0903.4909%2C0903.2748%2C0903.3965%2C0903.5472%2C0903.1463%2C0903.0260%2C0903.3550%2C0903.3905%2C0903.0808%2C0903.3563%2C0903.4015%2C0903.3756%2C0903.5122%2C0903.2156%2C0903.1983%2C0903.4018%2C0903.2967%2C0903.2229%2C0903.1393%2C0903.2012%2C0903.4523%2C0903.2042%2C0903.0916%2C0903.2897%2C0903.5113%2C0903.1492%2C0903.2193%2C0903.4126%2C0903.2212%2C0903.0340%2C0903.3898%2C0903.4700%2C0903.1862%2C0903.1310%2C0903.3883%2C0903.3031%2C0903.5490%2C0903.4418%2C0903.2720%2C0903.4593%2C0903.0433%2C0903.2355%2C0903.4308%2C0903.2124&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "It was recently observed in a numerical study on a high order perturbation\nmethod under heavy fluid loading that a loaded vibrating plate results, not\nonly in the classical frequency shift of the in vacuo single resonance (in both\nthe real part because of the fluid added mass and the imaginary part because of\nenergy lost by radiation), but also in an increase in the number of the\nresonance. As a result of the loading, a single in vacuo resonance of the\nstructure is transformed into a multiple resonance. Here we show that this\nphenomenon is a refinement of the Sanchez's classical result where it was\nestablished, using asymptotic analysis, that in the case of a light loading\nconditions \" the scattering frequencies of a fluid loaded elastic structure (ie\nthe resonance frequencies) are nearly the real eigenfrequencies of the elastic\nbody alone and the complex scattering frequencies of the fluid with a rigid\nsolid \". A theoretical explanation of the multiple resonances is given using\nclassical results on theory of entire functions. It is established that every\nsingle in vacuo resonance of a simply supported rectangular plate is\ntransformed into an infinite number of resonances under fluid-loading\ncondition."}, "authors": ["Pierre-Olivier Mattei"], "author_detail": {"name": "Pierre-Olivier Mattei"}, "author": "Pierre-Olivier Mattei", "arxiv_comment": "Proceedings of Noise and Vibration: Emerging Methods - NOVEM 2009", "links": [{"href": "http://arxiv.org/abs/0903.1704v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0903.1704v1", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "physics.class-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "physics.class-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0903.1704v1", "affiliation": "LMA", "arxiv_url": "http://arxiv.org/abs/0903.1704v1", "journal_reference": "Noise and Vibration : Emerging Methods, Oxford : Royaume-Uni\n  (2009)", "doi": null, "fulltext": "SPECTRUM OF A FLUID-LOADED VIBRATING PLATE:\nTHE MULTIPLE RESONANCE PHENOMENON\n\narXiv:0903.1704v1 [physics.class-ph] 10 Mar 2009\n\nP.-O. Mattei1\nLaboratoire de Mécanique et d'Acoustique\n31 chemin Joseph Aiguier, 13402 Marseille Cedex 20, France\nABSTRACT\nIt was recently observed in a numerical study on a high order perturbation method\nunder heavy fluid loading that a loaded vibrating plate results, not only in the\nclassical frequency shift of the in vacuo single resonance (in both the real part\nbecause of the fluid added mass and the imaginary part because of energy lost by\nradiation), but also in an increase in the number of the resonance. As a result\nof the loading, a single in vacuo resonance of the structure is transformed into a\nmultiple resonance. Here we show that this phenomenon is a refinement of the\nSanchez's classical result where it was established, using asymptotic analysis, that\nin the case of a light loading conditions the scattering frequencies of a fluid loaded\nelastic structure (ie the resonance frequencies) are nearly the real eigenfrequencies\nof the elastic body alone and the complex scattering frequencies of the fluid with\na rigid solid. A theoretical explanation of the multiple resonances is given using\nclassical results on theory of entire functions. It is established that every single\nin vacuo resonance of a simply supported rectangular plate is transformed into an\ninfinite number of resonances under fluid-loading condition.\n\n1\n\nIntroduction\n\nAccurately describe fluid structure interactions increases the computational cost of the\nvarious numerical methods used. Most numerical methods are leading to the resolution\nof linear systems of simultaneous equations. When the loading conditions are taken\ninto account, the size of the matrices involved increases considerably, and they become\nfull and frequency dependent. Any method of reducing these drawbacks is therefore\nmost welcome; and one of the best methods available is that based on the perturbation\napproach. Asymptotic analysis can be conduced when the loading is light, as in the case\nof a metal structure surrounded by air. This approach consists in introducing a small\nparameter ǫ, which is the ratio between surface mass density and fluid volume density.\nUsing perturbation expansions, one can then construct an approximate solution, based\non the in vacuo eigenmodes, which is not only easier to calculate than the exact solution\nbut also leads to a better understanding of the phenomena involved [3].\nThe light fluid loading perturbation method (involving high density structures in contact with a small density fluid) was recently extended [9] to cases where the perturbation\nparameter becomes large (which corresponds to a light and/or thin structure in contact\nwith a high density fluid). During this study multiple resonance processes were observed\nwhere a single resonance mode can have several resonance frequencies. The spectrum of\nthe operator can no longer be described in terms of the discrete spectrum based on a\ncountable series of resonance mode/resonance frequency pairs. This typically nonlinear\n1\n\nEmail address: mattei@lma.cnrs-mrs.fr\n\n063 - 1\n\n\fphenomenon is closely linked to the concept of non-linear frequency modes ([2]), where\nthe non linearity depends on the time parameters (such as those involved in porous materials) rather than on the more usual geometrical parameters. This frequency non-linearity\nis related to problems which are written in the form O(ω)U = S, where u is the unknown\nfactor and S is the source term. O(ω) is an operator which depends non linearly on\nthe angular frequency ω, as in the case of vibroacoustics, where the coupling depends\nnon-linearly on the frequency via the Helmholtz equation Green's kernel.\nOne shows that this behavior is a general property of at least fluid-loaded simply\nsupported rectangular plates. The main results obtained in our previous study [9] are\nrecalled in paragraph 2. A theoretical description of multiple resonance in the case of a\nsimply supported plate loaded with a non vanishing density fluid is given in paragraph 3.\nIt is then established, using classical results on the connection between the order of\nan entire function and the distribution of its zeros, that any resonance mode in this\nstructure will have an infinite number of resonance frequencies. Numerical examples of\na steel plate in contact with air or water are given paragraph 4. The conclusions and\npossible extensions of this work are presented in paragraph 5.\n\n2\n\nStatement of the problem\n\nConsider a finite elastic structure occupying a domain Σ, the behavior of which is\ndescribed by a differential operator A (in the case treated in this communication it is\na simple bi-Laplacian operator). This structure is loaded with a perfect fluid at rest\nextending to infinity. The equation of the fluid-loaded structure is given by the classical\nintegrodifferential equation\n\u0013\n\u0012\nZ\n′\n′\n′\n2\n(1)\nAU(M, ω) − ρs hω U(M, ω) − ǫ U(M , ω)G(M; M , ω)dM = F (M)\nΣ\n\nwhere ǫ = ρf /ρs h is a small parameter in the case of a metal structure (volume mass density ρs and thickness h) in contact with air (volume mass density ρf ). G(M; M ′ , ω) is the\nGreen's function of the Neumann problem in the Helmholtz equation outside the surface\nΣ. F (M) is the source. To facilitate reading, the weak formulation\nof the problem is introR R\nduced. One defines the radiation impedance β(U, V, ω) = Σ Σ U(M ′ )G(M; M ′ , ω)V ∗ (M)dMdM ′ ,\nwhere U(M) and V (M) are functions defined on the surface Σ, a(U, V ∗ ) stands for the potential elastic energy of the structure, hU, V ∗ i is the usual inner product and ρs hω 2 hU, V ∗ i\nis the kinetic energy. Then the weak formulation reads: find U(M) such that for every\nV (M) one has\na(U, V ∗ ) − Λ̃m (ω) (hU, V ∗ i − ǫβ(U, V ∗ , ω)) = hF, V ∗ i.\n\n2.1\n\n(2)\n\nResonance modes and eigenmodes for a fluid-loaded structure\n\nThe eigenmodes Ũm (M, ω) and eigenvalues Λ̃m (ω) (or equivalently the eigenpulsations\n2\nω̃m (ω) given by Λ̃m (ω) = ρs hω̃m\n(ω)) are the non zero solutions of the homogeneous weak\nformulation (2), that is find Ũm (M, ω) and ω̃m (ω) such that for every V (M)\n\u0010\n\u0011\n2\na(Ũm , V ∗ ) − ρs hω̃m\n(ω) hŨm , V ∗ i − ǫβ(Ũm , V ∗ , ω) = 0,\n(3)\n063 - 2\n\n\fβ(U, V, ω), that characterizes the energy loss by radiation, depends on the frequency.\nThen the eigenmodes, well suited to deal with harmonic regime, are complex and depend\non the frequency.\nOne introduces the resonance modes, that allow to compute the transient regime in\na natural way; they are complex and do not depend on the frequency [3]. The resonance\n2\nmodes Ûm (M) and resonances pulsations ω̂m , given by Λ̂m = ρs hω̂m\n, are the non zero\nsolutions of the following problem: find Ûm (M) and ω̂m such that for every V (M)\n\u0010\n\u0011\n∗\n2\n∗\n∗\na(Ûm , V ) − ρs hω̂m hÛm , V i − ǫβ(Ûm , V , ω̂m ) = 0.\n(4)\nThese two kind of modes, that are identical when the loading is not took into account,\nhave a strong link as each resonance pulsation is the solution of the resonance equation\n2\n2\nω̃m\n(ω̂m ) = ω̂m\n,\n\n(5)\n\nand each resonance mode is an eigenmode calculated at the corresponding resonance\npulsation.\nÛm (M) = Ũm (M, ω̂m ).\n(6)\nIt is worth noting that in the eigenmodes are easier to compute than the resonance modes.\n\n2.2\n\nHigh order perturbation method\n\nWhen the loading parameter ǫ is small, the eigenmodes and eigenvalues can be calculated using a perturbation method. The following perturbation expansion is introduced\ninto the weak formulation (3)\n(0)\n(1)\n(s)\nŨm (M) = Ũm\n(M) + ǫŨm\n(M) + * * * + ǫs Ũm\n(M) + * * *\n(0)\n(1)\ns (s)\nΛ̃m = Λ̃m + ǫΛ̃m + * * * + ǫ Λ̃m + * * *\n(0)\n\n(0)\n\nwhere Ũm (M) and Λ̃m are the eigenmodes and eigenvalues\nof the elastic\nstructure in\n\u0010\n\u0011\n(0)\n(0)∗\nvacuo. To facilitate the reading, one poses: β mn (ω) = β Ũm , Ũn , ω . It can then be\neasily established that one has\n(0) mm\nto the order 1 in ǫ:Λ̃(1)\n(ω),\nm (ω) = Λ̃m β\n(0)\n\n(0)\nto the order 2 in ǫ:Λ̃(2)\nm (ω) = Λ̃m\n\n(β mm (ω))2 +\n\nX\n\nΛ̃m\n\n(0)\np6=m Λ̃m\n\n−\n\n(0)\nΛ̃p\n\n!\n\nβ mp (ω) ,\n\nand so on to the higher orders. Next, as previously shown [9], by grouping the terms and\nby a re-summation technique, one shows that the high order perturbation expansion is\ngiven by\n(0)\nΛ̃m\n,\n(7)\nΛ̃m (ω) ≈\n1 − ǫβ mm (ω)\nwhich remains valid even for higher values of ǫ. It is worth noting that, compared to the\n(0)\nclassical perturbation expansion of the eigenvalues given by Λ̃m (ω) ≈ Λ̃m (1 + ǫβ mm (ω)),\nthe high-order approximation (7) is particularly interesting as it gives very precise results\nfor the same numerical cost.\n063 - 3\n\n\fThe calculation of the eigenmodes and eigenvalues does not requires any particular\neffort and, for a given ω, each eigenpulsation is the solution of the following eigenpulsation\nequation\n(0)2\nω̃m\n2\n.\n(8)\nω̃m (ω) ≈\n(1 − ǫβ mm (ω))\nEquation (8) shows that the calculation of the various eigenpulsations do not requires\nany computational cost but the evaluation of multiple integrals β mm (ω).\n\n2.3\n\nThe resonance equation\n\nBy introducing in equation (5) the high order expansion of the eigenpulsation given\nby equation (8), the resonance equation (5) is approximated as\n2\n(0)2\nω̂m\n(1 − ǫβ mm (ω̂m )) ≈ ω̃m\n.\n\n(9)\n\nThis shows that the calculation of the resonance pulsations is completely different\nthan that of the eigenpulsations since β mm (ω) has a rather complicated dependence on\nthe frequency and solving equation (9) requires the search for the zeros of non-convex\ncomplex function which is a challenging task. A numerical example given in the paper [9]\nhas shown a curious phenomenon of multiple resonance. That particular example has\nshowed that the resonance frequency of a particluar mode is not unique at least two\nresonance frequencies could exist simultaneously for a given geometrical configuration.\nTo have a better understanding of this non-usual phenomenon the roots of the resonance\nequation (9) are now studied in a more general manner using classical results in the\nframework of the distribution of zero of entire functions [5, 6]. In the following the\nresonance equation (9) is written as f mm (z):\n2\n,\nf mm (z) = z 2 (1 − ǫβ mm (z)) − z0m\n\n(10)\n\n(0)\n\nwhere z = ω̂m and z0m = ω̃m . The zeros of f mm (z) are the resonance pulsations.\n\n3\n3.1\n\nMultiple resonances\nMethodology\n\nNow all the problem focuses on the existence and the counting of the roots of f mm (z).\nMore or less, the theory of the zeros of entire functions (analytic functions in the whole\ncomplex plane) is based on the Great Picard's Theorem [11] which states that if f (z)\nhas an essential singularity at a point zw then on any open set containing zw , f (z) takes\non all possible values, with at most one exception, infinitely often. The exception is\nneeded as showed by the function exp(1/z) that has an essential singularity at z = 0\nbut never attains 0 as a value. The second point is that every entire function is either\na polynomial or has an essential singularity at infinity. Now if one can prove that the\nresonance function f mm (z) is an entire function, that is not a polynomial and that the\nvalue 0 is not the exception needed by the Picard's theorem, then the resonance function\nf mm (z) has an infinite number of zeros. Then for every mode, an infinite number of\nresonance exists.\n063 - 4\n\n\fNow to characterize complex function f (z) as an entire function,\nsimplest way\nPthe\nn=∞\nn\nis to study its development as a power series of the form f (z) =\nn=0 cn z . When\n√\nlimn→∞ n cn = 0, f (z) is an entire function. To show that it is not a polynomial,\none can study its order. Let us recall that if f (z) is an entire function, the function\nM(r) = max|z|=r |f (z)| will increase indefinitely together with r. The rate of growth\nof M(r) can be characterized by comparing it with function exp(r). By definition, the\norder (of growth) ρ is the smallest number such that M(r) ≤ exp r ρ+η for every η > 0\nand for r > r0 (η). From this, it can be easily seen that the order is given by the\nformula ρ = lim supr→∞ ln ln M(r)/ ln r ; as examples, a polynomial in z is of order 0,\nand the exponential function is of order 1. The order ρ of an entire function depends\non the asymptotic behavior of the coefficients of its series expansion. One has 1/ρ =\nlimn→∞ inf(ln(1/|cn |)/(n ln n)) ([11]); or in other words, if cn ∝ 1/(n!)α then ρ = 1/α.\nOne can simplify again the problem under consideration. The resonance function can\n2\n2\nbe written as f mm (z) = z 2 − z0m\n− ǫz 2 β mm (z), as a sum of a polynomial (z 2 − z0m\n) of\norder 0 and a function which is the product of a polynomial (ǫz 2 ) also of order 0 and\nthe radiation impedance β mm (z) which order is to be determined. The distribution of\nzeros of f mm (z) can be deduced from that of β mm (z) as long as ǫ has a non zero value. If\nβ mm (z) is a polynomial, the resonance function is also a polynomial with a finite number\nof roots. If β mm (z) is an entire function (in the case considered below it is of order 1)\nwith essential singularity at infinity, then f mm (z) is also an entire function with essential\nsingularity at infinity and by the Picard's theorem f mm (z) can takes on all possible values\nat infinity, with at most one exception, infinitely often.\nThe main results of this paper is, as shown below on the particular example of a\nsimply supported plate, that the radiation impedance and the resonance function are\nentire functions of exponential type (that is of order one and normal type [5]) that both\nhave an infinite number of roots.\n\n3.2\n\nThe resonance function of a simply supported baffled plate\nas an entire function of the frequency\n\nNow let us consider a thin simply supported rectangular plate (dimensions a × b\nwith thickness h) made of isotropic material with Young's modulus E, Poisson's co(0)\nefficient\nν and density ρs . In a vacuum, the eigenmodes are\ngiven by Ũmn (x, y) =\n√\np\n(0)\n2/ ab sin mπx/a sin nπy/b and the eigenpulsations by ωmn = π 2 D/(ρs h) [(m/a)2 + (n/b)2 ]\n(0)\n(0)∗\nwith D = Eh3 /12(1−ν 2 ). When the plate is baffled, the radiation impedance β(Ũmn , Ũmn , ω)\nis given as\nZ Z Z Z\nı ωc d\nab 1 1 1 1\n′\n′e\n(0)\n(0)∗\ndxdydx′ dy ′,\nsin mπx sin nπy sin mπx sin nπy\nβ(Ũmn , Ũmn , ω) = −\nπ 0 0 0 0\nd\n(11)\np\n2\n′\n2\n2\n′\n2\nwhere d = a (x − x ) + b (y − y ) and c is the speed of waves in the fluid. In the\nfollowing, the pulsation dependence in ω is changed into the equivalent wavenumber\ndependence in k = ω/c. Since the in vacuo modes involve a double index, the notation\n(0)\n(0)∗\nfor the radiation impedance is simplified as β(Ũmn , Ũmn , ω) = β mn (k). The resonance\n(0)\n2\nfunction is denoted by f mn (k) = k 2 (1 − ǫβ mn (k)) − k0mn\n, with k0mn = ωmn /c.\n063 - 5\n\n\fIt is worth noting that β mn (k) and f mn (k) decrease in the upper complex plane (with\nI(k) > 0, the term exp(ıkd) has an exponential decrease when |k| → ∞) and conversely\ngrow in the lower complex plane, then all the roots of these two functions are located in\nthe lower complex half plane. As the time dependency had been chosen as exp(−ıωt),\nthis ensures that the movement of the plate remains finite over time [3].\nBy making a change of variable [7], it can be easily shown that β mn (k) is given by\nZ Z\neıkD\n4ab 1 1\nmn\nGm (X)Gn (Y )\ndXdY,\n(12)\nβ (k) = −\nπ 0 0\nD\n√\nwhere D = a2 X 2 + b2 Y 2 . The functions Gm (x) and Gn (y) are given by single analytic\nR1\nintegrals Gm (x) = 0 sin mπ(x+x′ ) sin mπx′ dx′ with Gm (x) = (sin mπx + mπ(1 − x) cos mπx) /(2mπ).\nBy making a change of variables from rectangular to polar [4], with 0 < θα = arctan(b/a) <\nπ/2, the radiation impedance (12) is written as\nZ\nZ\n4 π/2\n4 θα\nmn\nJ1mn (k, θ)dθ −\nJ2mn (k, θ)dθ,\n(13)\nβ (k) = −\nπ 0\nπ θα\n\u0001\n\u0001\nθ\nR sin θ\nwhere J1mn (k, θ) and J2mn (k, θ) are defined, with Hmn (R, θ) = Gm R cos\nG\n, as\nn\na\nb\nZ a\nZ b\ncos θ\nsin θ\nıkR\nJ1mn (k, θ) =\nHmn (R, θ)e dR, J2mn (k, θ) =\nHmn (R, θ)eıkR dR.\n(14)\n0\n\n0\n\nBy expanding the exponential as a power series, the two integrals (14) are given as\nl=∞\nl=∞\nX (ık)l Z cosa θ\nX (ık)l Z sinb θ\nl\nJ1mn (k, θ) =\nHmn (R, θ)R dR, J2mn (k, θ) =\nHmn (R, θ)Rl dR.\nl!\nl!\n0\n0\nl=0\nl=0\n\nAs Hmn (R, θ)Rl is a continuous integrable function of R in ]0, a/ cos θ[ or in ]0, b/ sin θ[\nand of θ in ]0, π/2[, the mean value theorem ensures that there exist R1 ∈]0, a/ cos θ[,\nR2 ∈]0, b/ sin θ[, θ1 ∈]0, θα [ and θ2 ∈]θα , π/2[ such that\nZ θα\nZ π/2\nl=∞\nl=∞\nX (ık)l\nX (ık)l\nl\nJ1mn (k, θ)dθ =\nJ2mn (k, θ)dθ =\nHmn (R1 , θ1 )R1 ,\nHmn (R2 , θ2 )R2l .\nl!\nl!\n0\nθα\nl=0\nl=0\nOne then obtains β mn (k) as an entire function of the variable k:\n4\nβ mn (k) = −\nπ\n3.2.1\n\nHmn (R1 , θ1 )\n\nl=∞\nX\nl=0\n\nl=∞\n\nX (ıkR2 )l\n(ıkR1 )l\n+ Hmn (R2 , θ2 )\nl!\nl!\nl=0\n\n!\n\n.\n\n(15)\n\nOrder of the radiation impedance\n\nTo calculate the order of the impedance radiation, one studies the comportment of\nthe function Mβ mn (r) = max|k|=r |β mn (k)| for r → ∞. Let us begins with successive\nintegrations by parts of the integrals given by equations (14). Introducing the results\ngiven in the appendix leads to\nZ a 4\na\nıkR\ncos θ ∂ H\n−1 h2mn (θ) h13mn (θ)eık cos θ − h03mn (θ)\nmn (R, θ) e\n−\n+\ndR,\n(16)\nJ1mn (k, θ) =\n+\n4ık\n∂R4\n(ık)3\n(ık)4\n(ık)5\n0\nZ b 4\na\nıkR\nsin θ ∂ H\n−1 h2mn (θ) h23mn (θ)eık cos θ − h03mn (θ)\nmn (R, θ) e\nJ2mn (k, θ) =\n−\n+\ndR,\n(17)\n+\n4ık\n∂R4\n(ık)3\n(ık)4\n(ık)5\n0\n063 - 6\n\n\fAs one studies the comportment of max|k|→∞ |β mn (k)|, in the equations (16) and (17),\nthe first two power terms in k are negligible compared to the exponential ones when\n|k| → ∞; similarly, only the first exponential term has a contribution when |k| → ∞.\nThen\nZ θα\nZ π\n2\na\nb\n1\n1\nık cos\nθ\nh3mn (θ)e\n(18)\ndθ +\nMβ mn (r) = max 4\nh23mn (θ)eık sin θ dθ .\n|k|=r |k|\n0\nθα\nNow by expanding the exponentials in equation (18) as power series, one obtains\n\u0012\n\u0013l !\nZ θα\nZ π\nl=∞\n\u0010 a \u0011l\n2\n1 X (ık)l\nb\nMβ mn (r) = max 4\nh23mn (θ)\nh13mn (θ)\ndθ +\ndθ .\n|k|=r |k|\nl!\ncos\nθ\nsin θ\nθα\n0\nl=0\n(19)\n1\n2\nAs h3mn (θ) and a/ cos θ are continuous integrable functions for θ ∈ [0, θα ] and h3mn (θ)\nand b/ sin θ are continuous integrable functions for θ ∈ [θα , π/2]. One applies the mean\nvalue theorem for the two integrals that appear in equation (19): there exist two values\nθ1 and θ2 such that\n\u0013l\n\u0012\nZ θα\n\u0010 a \u0011l\na\n1\n1\nh3mn (θ)\ndθ = h3mn (θ1 )\n, 0 < θ1 < θα ,\n(20)\ncos θ\ncos θ1\n0\n\u0013l\n\u0013l\n\u0012\n\u0012\nZ π\n2\nb\nb\n2\n2\ndθ = h3mn (θ2 )\n, θα < θ2 < π/2.\n(21)\nh3mn (θ)\nsin θ\nsin θ2\nθα\n√\nLet us denote\nc1 = a/ cos θ1 and c2 = b/ sin θ2 . It is easy to see a ≤ c1 ≤ a2 + b2 and\n√\nb ≤ c2 ≤ a2 + b2 . Mβ mn (r) is then written as\nl=∞\n\nM\n\nβ mn\n\nl=∞\n\nX (ıkc1 )l\nX (ıkc2 )l\n1\n1\n2\n+ h3mn (θ2 )\n(r) = max 4 h3mn (θ1 )\n|k|=r |k|\nl!\nl!\nl=0\nl=0\n= max\n|k|=r\n\n1\nh1 (θ1 )eıkc1 + h23mn (θ2 )eıkc2 .\n|k|4 3mn\n\n(22)\n\nThe previous result shows that the function Mβ mn (r), characterizing the growth of\nthe radiation impedance, is the sum of two exponential functions divided by a polynomial\nof the fourth degree. Its order is easy to obtain from classical results on the sum and\nproduct of entire functions (see for example [11], chapter VII paragraph 6). There is\ntwo possibilities for characterizing the growth of Mβ mn (r) for r sufficiently large: the\nfirst is that if σ denotes a finite positive number and C a positive constant one has\nMβ mn (r) ≈ C exp(σr) which implies that the radiation impedance is of order 1, the\nsecond is that Mβ mn (r) = 0 which implies that the radiation impedance is of order 0.\nFrom the expressions of the functions h13mn (θ) and h23mn (θ) given in the appendix, it is\nobvious that for a 6= b and for m 6= n one cannot have h13mn (θ1 )eıkc1 = −h23mn (θ2 )eıkc2 . If,\nfor example c1 > c2 , then\nMβ mn (r) = max\n|k|=r\n\n1\nh13mn (θ1 )eıkc1 .\n4\n|k|\n\n(23)\n\nIf a = b and m = n care must be taken; in this case θα = π/4 and a little algebra shows\nthat\nZ π\nZ π\n\u0010 a \u0011l\n\u0010 a \u0011l\n4\n2\n1\n2\ndθ =\ndθ.\n(24)\nh3mm (θ)\nh3mm (θ)\nπ\ncos θ\nsin θ\n0\n4\n063 - 7\n\n\fThen the maximum of β mm (k) is\nMβ mm (r) = max\n|k|=r\n\n2\nh1 (θ1 )eıkc1 .\n|k|4 3mm\n\n(25)\n\nThen β mn (k) is an entire function of order 1 and the resonance function f mn (k) =\n2\nk 2 (1 − ǫβ mn (k)) − k0mn\nis an also an entire function of order 1 for all ǫ 6= 0.\n3.2.2\n\nDistribution of zeros of the radiation impedance and of the resonance\nfunction\n\nIn addition to the order, the relations (22), (23) and (25) give a more refined information on the distribution of zeros of the radiation impedance. An entire function that\ngrows as exp(σr), with 0 < σ < ∞, is an entire function of order one and normal type\nσ. Such functions are known as entire function of exponential type (EFET) [6]. The\nresonance function and the radiation impedance are EFET. They both possess an additional property on the distribution of their zeros. They are functions that belong to the\nCartwright class C [6]. A EFET f (z) belongs to the class C if\nZ +∞\nlog+ |f (t)|\ndt < ∞,\n(26)\n1 + t2\n−∞\nwhere the function log+ |w| is defined as log+ |w| = max(0, log |w|) or equivalently as\nR 2π\nlog+ |w| = 1/(2π) 0 log |w − exp(ıθ)|dθ. A function f (t) bounded on the real axis\nsatisfies log+ |f (t)| ≤ |f (t)|. To prove that f (z) belongs to the class C it is sufficient\nto prove that |f (t)| is bounded for every t ∈ IR and belongs to class C. The radiation\nimpedance given by equation (13) can be majored, for k ∈ IR, by:\n!\n!\nZ π/2 Z b\nZ θα Z a\ncos θ\nsin θ\n4\nHmn (r, θ)eıkr dr dθ +\nHmn (r, θ)eıkr dr dθ\n|β mn (k)| =\nπ 0\n0\n0\nθα\n!\n! !\nZ π/2 Z b\nZ θα Z a\ncos θ\nsin θ\n4\n≤\n|Hmn (r, θ)| dr dθ +\n|Hmn (r, θ)| dr dθ (27)\n.\nπ\n0\n0\nθα\n0\nAs Hmn (r, θ) is continuous integrable function of r and θ the two integrals that appear\nin the right member of equation (27) are finite. β mn (k) is bounded for every k real and\nbelongs to class C.\n2\nShowing that the resonance function f mn (k) = k 2 (1 − ǫβ mn (k)) + k0mn\nbelongs to\n2\nclass C requires a more refined estimation as, because of the k term, it is unbounded at\ninfinity. Nevertheless, as β mn (k) is bounded for every k, the resonance function is also\nbounded for every finite real value k, then for every finite value A,\nZ +A\nlog+ |f mn (t)|\ndt < ∞.\n(28)\n1 + t2\n−A\nR ±∞ + |f mn (t)|\ndt. As seen in the previous paragraph, the radiation\nIt remains to estimate ±A log 1+t\n2\nimpedance for real values of k → ∞ has the following asymptotic approximation\n!\nZ θα\nZ π\n2\na\nb\n1\nh13mn (θ)eık cos θ dθ +\nβ mn (k) ≈\n(29)\nh23mn (θ)eık sin θ dθ .\n4\n(ık)\n0\nθα\n063 - 8\n\n\fRπ\nRθ\na\nb\nThe two integrals I1 (k) = 0 α h13mn (θ)eık cos θ dθ and I2 (k) = θ2α h23mn (θ)eık sin θ dθ that\nappear in this equation can both be approximated for k → ±∞ by the stationary phase\nmethod [1]:\nr\nr\nm2 π 2\nπ ıka+ı π\nπ ıka+ı π\n1\nm\n4 = (−1)\n4,\nI1 (k) ≈k→±∞ h3mn (0)\ne\ne\n3\n2ka\n2a\n2ka\nr\n\u0010π \u0011 r π\n2 2\nπ ıkb+ı π\nıkb+ı π4\n2\nnn π\n4.\ne\ne\nI2 (k) ≈k→±∞ h3mn\n= (−1)\n3\n2\n2kb\n2b\n2kb\nNow the radiation impedance equation has the following approximation for k → ±∞\nr\nr\n\u0012\n\u0013\n2 2\nπ ıka+ı π\nπ ıkb+ı π\n1\nn2 π 2\nmm π\nmn\nn\n4 + (−1)\n4\n(−1)\ne\ne\n,\n(30)\nβ (k) ≈\n(ık)4\n2a3\n2ka\n2b3\n2kb\n\nwhen k → ±∞, β mn (k) tends to zero and the resonance function can be approximated\nby f mn (k) ≈ k 2 . For k → ±∞ one has log+ |f mn (k)| = log |k 2 |. Then for every value of\nA\nZ +∞\nZ −∞\nZ +∞ + mn\n1 + log A\nlog t\nlog |t|\nlog |f (t)|\ndt ≈ 2\ndt = 2\ndt = 2\n+ O(A−2 ) < ∞.\n2\n2\n2\n1\n+\nt\n1\n+\nt\n1\n+\nt\nA\nA\n−A\nA\n(31)\nR +∞ log+ |f mn (t)|\nCombining results of equations (28) and (31) shows that −∞\ndt < ∞.\n1+t2\nThen both impedance radiation and resonance relation belong to the Cartwright class C.\nFor 0 < α < π let us denote by n+ (r, α) the number of zeros of the function f mn (z) in\nthe sector {z : |z| ≤ r, | arg(z)| ≤ α} and n− (r, α) the number of zeros in {z : |z| ≤ r, |π −\narg(z)| ≤ α}. By the theorem of Cartwright and Levinson (theorem 1, page 127 of [6])\nthe density of the set of zeros n± (r, α)/r has the limit limr→∞ n± (r, α)/r = σ/π. This\nresult is a very strong one, since not only it ensures that the resonance function possesses\nan infinite number of zeros but also that \"almost all\" zeros lie in the neighborhood of the\nreal axis.\nIt is worth noting that the zeros are counted with their multiplicity order. Then the\nzeros of the resonance function appears as conjugate pairs and then must be counted\n2\ntwice. Actually, the resonance function f mn (k) = k 2 (1 − ǫβ mn (k)) + k0mn\ncan be apmn\n2\n1\n4 ıkc1\n2\nproached for |k| → ∞ by f (k) = k (1 − ǫ2h3mm (θ1 )/k e\n+ k0mn , then if k̂ is a\nsolution of f mn (k̂) = 0, it is easy to see that −k̂ ⋆ , the opposite of its conjugate satisfies\nf mn (−k̂ ⋆ ) = 0.\n\n4\n\nNumerical examples\n\nIn this section, some numerical examples of the multiple resonance phenomenon are\npresented. As it is impossible to obtain a closed formula for J1mn (k, θ) and J2mn (k, θ)\ngiven by equations (14), a numerically efficient approximation of these functions has been\nconstructed. As shown below, this approximation preserves the order properties of the\ninvolved functions. Since one always has 0 < θα < π/2, the functions to be integrated\nare expanded with respect to the angular variable θ to the order 1. This gives\nıa3 k 3 + 2m2 π 2 − ıakm2 π 2 − (−1)m 2eıak m2 π 2\n,\n4(ak − mπ)2 (ak + mπ)2\nıb3 k 3 + 2n2 π 2 − ıbkn2 π 2 − (−1)n 2eıbk n2 π 2\nJ2mn (k, θ) ≈ j2n (k) = b\n.\n4(bk − nπ)2 (nk + nπ)2\n\nJ1mn (k, θ) ≈ j1m (k) = a\n\n063 - 9\n\n(32)\n(33)\n\n\fAfter reporting the two expansions (32) and (32) in the radiation impedance given in\nequation (13), the following approximation of β mn (k), denoted by β̌ mn (k), is obtained\n4\nβ̌ mn (k) = − (j1m (k)θα + j2n (k)(π/2 − θα )).\nπ\n\n(34)\n\nIt is worth noting that the accuracy of the approximation of β mn (k) decreases as the\nmode order increases. However, at low orders (say m ≤ 3, n ≤ 3) it remains sufficient.\nIt is easy to obtain\n±3ı + mπ\n1 − (−1)m\n, and j1m (k = 0) = a\n,\n16mπ\n2m2 π 2\n1 − (−1)n\n±3ı + nπ\n, and j2n (k = 0) = b\n.\nj2n (k = ±nπ/b) = b\n16nπ\n2n2 π 2\n\nj1m (k = ±mπ/a) = a\n\n(35)\n(36)\n\nThen as j1m (k) and j2n (k) are entire functions of k, β̌ mn (k) is also an entire function of\nk. It still remains to estimate the order of β̌ mn (k). For given m and n and for |k| → ∞,\none has\nlim j1m (k) =\n\n|k|→∞\n\n−(−1)m m2 π 2 eıak\n−(−1)n n2 π 2 eıbk\nand\nlim\nj\n(k)\n=\n,\n2n\n|k|→∞\n2a3 k 4\n2b3 k 4\n\nthen\nlim β̌\n\n|k|→∞\n\nmn\n\n(k) = 2π\n\n\u0012\n\nm2\n(−1)m 3 θα eıak\na\n\n+\n\nn2\n(−1)n 3\nb\n\n\u0010π\n2\n\n\u0011\n\nıbk\n\n− θα e\n\n\u0013\n\n1\n.\nk4\n\n(37)\n\nIt is worth noting that the approximation of the radiation impedance given in equation\n(34) or in equation (37) presents a similar comportment than the exact one: a sum\nof exponential functions divided by a polynomial of the fourth degree; also the lower\nthe mode order, the better the approximation β̌ mn (k) becomes. To confirm that the\napproximation keeps the order of β̌ mn (k) to one, classical results on the sum and product\nof entire functions are used again. First it is worth noting that the entire function\n(−1)m m2 /a3 θα eıak + (−1)n n2 /b3 (π/2 − θα ) eıbk cannot be identically zero for any value\nof a, b, m or n when |k| → ∞. To see this more clearly, one can deal separately with the\ncases a = b and a6= b.\n2\n\nπ\nm 2\nn 2\nıak 1\nThe case a = b. One has θα = π/4 and β̌ mn (k) ≈ 2a\n3 ((−1) m + (−1) n ) e\nk4\nbecomes the product of the exponential function eıak of order 1 and the inverse of a\ndegree 4 polynomial in k, which is of order 0. β̌ mn (k) is therefore an entire function of\norder 1 and of type a.\n\nThe case a 6= b. Let us take for example a > b. Then with |k| → ∞ one has\nmax eıak ≫ max eıbk ; it is worth noting that this is true in the half plane I(k) < 0,\nwhereas in the half plane I(k) > 0, β̌ mn (k) tend rapidly\n\u0001 to zero. In the half plane\nm 2\nıak 1\nwhich is also the product\n(−1)\nm\nθ\ne\nI(k) < 0, one therefore has β̌ mn (k) ≈ 2π\nα\na3\nk4\nıak\nof the exponential function e of order 1 and the inverse of a degree 4 polynomial in\nk, which is of order 0. β̌ mn (k) is therefore an entire function of order 1 and of type\na. It is worth noting that if b > a its type is b. In other words, one can assume that\nσ = max(a, b).\n063 - 10\n\n\f2\nFigure 1: Contour plots of |k 2 (1 − ǫβ̌ mn (k)) − k0mn\n| in the mode m = 2, n = 3. Steel\nplate in contact with air ǫ ≈ 0.002 (left) and water ǫ ≈ 1.5 (right).\n\nBoth radiation impedance β̌ mn (k) and resonance relation fˇmn (k) belong to the Cartwright\nclass C and then all, but a finite number of, their zeros must lie in the neighborhood of\nthe real axis.\nAs shown above the type σ of β̌ mn (k) is given by σ = max(a, b). Then the type\n2\nof fˇmn (k) is given the type of k 2 (1 − ǫβ mn (k)) + k0mn\n; and for ǫ 6= 0 it is given by\nσ = max(a, b). By the Cartwright and Levinson theorem, the density of resonances\nlimr→∞ (n+ (r, α)/r + n− (r, α)/r) is then given by 2 max(a, b)/π. To verify this, the simplest way is to count the zeros of f mn (z) using the argument theorem on the disk C\nwith radius K centered on the origin. It is clear from equations (35) and (36) that\nβ̌ mn (k) and fˇmn (k) have no pole inside C. The number of its zeros inside this disk,\nin the case of the mode (m − n), is denoted by nfˇmn (K). It is given by the integral\nH\nnfˇmn (K) = 1/(2ıπ) C fˇ′mn (k)/fˇmn (k)dk with k = Keıθ . This integral is computed\nnumerically without difficulty. As shown before, the zeros occur in combined pairs of\nnegative imaginary part, then each zero must be counted twice; then the density of\nthe zeros given by (n(K, α)/K = n+ (K, α)/K + n− (K, α)/K has the asymptotic value\nlimK→∞ n(K, α)/K = 2nfˇmn (K)/K.\nFor example, let us take a steel (E = 200 Gpa, ν = 0.3 and ρs = 7800 Kg/m3 ) simply\nsupported rectangular plate in contact with air (with density ρf = 1.2 Kg/m3 and sound\nwave celerity c = 340 m/s) and let the plate dimensions be a = 1 m, b = 0.7 m and\nh = 8.2 cm. It can easily be established that in the mode m = 1, n = 1, one has\nnfˇ11 (12) = 2, nfˇ11 (18) = 4 and nfˇ11 (30) = 8. In the mode m = 2, n = 3, one has\nnfˇ23 (19) = 1, nfˇ23 (20) = 3, nfˇ23 (30) = 7. As the radius K of the disk C becomes large\none obtains for the density nfˇmn (K)/K, with e.g. K = 5000\nnfˇ11 (K)\nnfˇ12 (K)\nnfˇ23 (K)\nnfˇ22 (K)\n1\n1\n1\n1\n=\n,\n=\n,\n=\n,\n=\nK\n3.1407\nK\n3.1407\nK\n3.14268\nK\n3.14268\nThis confirms that limK→∞ n(K, α)/K = 2nfˇmn (K)/K = 2 max(a, b)/π. Similar results\nare obtained if for the fluid water is chosen instead of air or for various plate dimensions.\n063 - 11\n\n\f2\nFigure 2: Contour plots of |k 2 (1−ǫβ̌ mn (k))−k0mn\n| in the mode m = 2, n = 3. Aluminium\nplate in contact with air ǫ ≈ 0.005 (left) and water ǫ ≈ 4.5 (right).\n\nAll these numeric values are a validation of the theoretical results obtained in the paragraph 3. The resonance relation of the fluid loaded plate has an infinite number of zeros.\nTherefore, while in a vacuum, each mode of a simply supported plate will have only one\nresonance frequency (and its opposite), under loading condition each mode will have an\ninfinite number of resonance frequencies. This result is confirmed in figures 1 and 2. In\nthese various contour plots, the dark spots that appear correspond to the resonances of\nthe simply supported plate, that is the roots of fˇmn (k) = 0. In figures 1, the material of\nthe plate is steel with E = 200 Gpa, ν = 0.3 and ρs = 7800 Kg/m3 . In figure 2 the plate\nis made of aluminium E = 70 Gpa, ν = 0.3 and ρs = 2700 Kg/m3 . The dimensions of\nthe two plates under consideration are the same and are given by 1 m × 0.7 m × 8.2 cm.\nWhile the spectra of both plates are similar in air (excepted in a higher imaginary part\nof all resonances of the aluminium plate) since they both have more or less same ratio\nE/ρs and more or less the same spectrum in vacuo, when loaded by water the difference\nbetween the two spectra is obvious. It is worth noting that the multiple resonance phenomenon makes classical modal analysis rather difficult. This could be seen in figure 2\nwhere it is easy to se that there is two resonances very close together (around R(k) ≈ 18\nand I(k) ≈ −3). While in air (or in water for the steel plate) choosing the resonance close\nto the real axis and neglect the resonances with high imaginary part (corresponding to\nrapidly vanishing waves) is natural, in water there is, in the present case, two resonances\n(and then two resonance modes) that have equal importance.\nNow let us return to the initial question of the existence or non-existence of multiple\nresonances in fluid-loaded plates. In every boundary condition, one has to look for the\n(0)2\n2\n(ω)) − ω̃mn = 0. Although it has\nresonance pulsations ω̂mn such that ω̂mn\n(1 − ǫβω̂mn\nmn\nnot been proved that such a comportment is true under various boundary conditions, it\nseems reasonable to assume that under boundary conditions of all kinds every resonance\nmode in a plate has an infinite number of resonance frequencies as ǫ 6= 0 (the radiation\nimpedance given by relation (12) seems to be an EFET for a large variety of functions\nGm and Gn ).\n063 - 12\n\n\f5\n\nCONCLUSIONS\n\nThe loading of a rectangular plate with a high density fluid transforms each resonance\ninto an infinite number of resonances. These results open up new prospects. In particular, it would be interesting to obtain similar estimates on the vibratory modes occurring\nin clamped plates or mechanical structures of other kinds, although these may not be\neasy to obtain. Another question which arises is how to determine under what conditions moderately coupled systems (such as a steel plate in contact with water) will have\nthese properties. Another important aspect worth investigating is the validity of modal\nexpansions in the case of resonance modes having two or more resonances frequencies. It\nwould also be interesting to develop experimental device which would make it possible\nto test the occurrence of the behavior described here.\nAcknowledgments: this work was partially supported by the Agence Nationale de la\nRecherche (ANR) thru grant ANR-06-BLAN-0081-01.\n\nReferences\n[1] C.M. Bender and S. Orszag. Advanced Mathematical Methods for Scientists and Engineers I (Springer-Verklag, New-York, Berlin, Heildelberg, 1991).\n[2] O. Dazel, C.-H. Lamarque and F. Sgard. \"Frequency non-linear modes,\" Proceedings\nof the Euromech Colloquium 457 (2004), edited by S. Bellizzi, B. Cochelin and C.-H.\nLamarques, Press of the ENTPE, ISBN: 2-86 834-119-5, Lyon, pp. 65-68.\n[3] P. J. T. Filippi, D. Habault, P.-O. Mattei and C. Maury. \"The rôle of the resonance\nmodes in the response of a fluid-loaded structure,\" Journal of Sound and Vibration,\n239, 369-663 (2001).\n[4] D. Habault and P.J.T. Filippi. \" A numerical method for the computation of the\nresonance frequencies and modes of a fluid-loaded plate: application to the transient\nresponse of the system.\" Journal of Sound and Vibration, 239(1-2), 207-231, 2004.\n[5] B. Ya. Levin. Distribution of Zeros of Entire Functions (Revised Edition) (American\nMathematical Society, Providence, Rhode Island, 1980).\n[6] B. Ya. Levin. Lectures on Entire Functions(American Mathematical Society, Providence, Rhode Island, 1996).\n[7] R. A. Mangiarotty. \"Acoustic Radiation Damping of Vibrating Structure\", Journal\nof the Acoustical Society of America, 35, 369-377 (1963).\n[8] P.-O. Mattei. \"A two-dimensional Tchebycheff collocation method for the study of the\nvibration of a baffled fluid-loaded rectangular plate\", Journal of Sound and Vibration.\n196(4), 407-427 (1996).\n[9] P.-O. Mattei. \"High-Order Perturbation Expansion for the Spectral Analysis of FluidLoaded Vibrating Structure\", Acta Acustica United with Acustica. 93, 305-313 (2007).\n[10] A. H. Nayfeh. Introduction to Perturbation Techniques (John Wiley & Sons, NewYork, 1993).\n063 - 13\n\n\f[11] S. Saks and A. Zygmund. Analytic Functions (Paristwowe Wydawnictwo Nankowe,\nWarszava, 1965).\n[12] J. Sanchez-Hubert and E. Sanchez-Palencia (Vibration and Coupling of Continuous\nSystems. Asymptotic Methods. Springer-Verlag, Berlin, 1989).\n[13] S. Wolfram. Mathematica\nhttp://www.wolfram.com (2008)\n\nA\n\n6.\n\nA\n\nTechnical\n\nComputing\n\nEnvironment.\n\nAppendix\nThe function Hmn (r, θ) is given by\n1\nHmn (r, θ) =\n4mnπ 2\n\n\u0013\n\u0012\n\u0013\n\u0012\n\u0013\u0015\n\u0014\n\u0012\nmπr cos θ\nmπr cos θ\nr cos θ\ncos\n+ sin\nmπ 1 −\na\na\na\n\u0013\n\u0012\n\u0013\n\u0012\n\u0013\u0015\n\u0014 \u0012\nnπr sin θ\nnπr sin theta\nr sin θ\ncos\n+ sin\n.\nnπ 1 −\nb\nb\nb\n\nOnly a few derivatives with respect to r of Hmn (r, θ) up to order 3 taken at the points\nr = 0, r = a/ cos θ and r = b/ sin θ are not zero. They are given by :\n\u0012\n\u0015\n\u0013\n\u0014 2\nπ 2 m2 cos2 θ n2 sin2 θ\n∂ Hmn (r, θ)\n=−\n+\n= h2mn (θ)\n∂r 2\n4\na2\nb2\nr=0\n\u0014 3\n\u0012\n\u0015\n\u0013\n∂ Hmn (r, θ)\nπ 2 m2 cos3 θ n2 sin3 θ\n=\n+\n= h03mn (θ)\n3\n3\n∂r 3\n2\na\nb\n\u0014\n\u0012\n\u0012\n\u0013\n\u0012\n\u0013\u0013\n\u0015r=0\n\u0014 3\nanπ tan θ\nanπ tan θ\n(−1)m m2 π cos2 θ\n∂ Hmn (r, θ)\nb cos θ nπ cos\n+ sin\n=\n∂r 3\n2a3 bn\nb\nb\na\nr= cos\nθ\n\u0012\n\u0013\n\u0015\nanπ tan θ\n−anπ cos\nsin θ = h13mn (θ)\nb\n\u0014\n\u0012\n\u0012\n\u0013\n\u0012\n\u0013\u0013\n\u0015\n\u0014 3\nbmπ cot θ\nbmπ cot θ\n∂ Hmn (r, θ)\n(−1)n n2 πsin2 θ\na sin θ mπ cos\n+ sin\n=\n∂r 3\n2ab3 m\na\na\nr= sinb θ\n\u0013\u0015\n\u0012\nbmπ cot θ\n= h23mn (θ)\n−bmπ cos θ cos\na\n\n063 - 14\n\n\f"}