{"id": "http://arxiv.org/abs/1107.2063v2", "guidislink": true, "updated": "2011-09-08T12:42:51Z", "updated_parsed": [2011, 9, 8, 12, 42, 51, 3, 251, 0], "published": "2011-07-11T15:47:50Z", "published_parsed": [2011, 7, 11, 15, 47, 50, 0, 192, 0], "title": "One loop partition function for Topologically Massive Higher Spin\n  Gravity", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1107.1525%2C1107.2895%2C1107.2927%2C1107.3052%2C1107.3791%2C1107.4852%2C1107.1880%2C1107.1851%2C1107.2501%2C1107.5753%2C1107.0620%2C1107.1753%2C1107.0261%2C1107.2389%2C1107.3561%2C1107.3896%2C1107.5536%2C1107.2451%2C1107.2121%2C1107.5364%2C1107.4634%2C1107.2546%2C1107.1618%2C1107.1315%2C1107.0708%2C1107.1495%2C1107.2202%2C1107.0457%2C1107.1285%2C1107.3705%2C1107.4679%2C1107.2112%2C1107.2127%2C1107.5425%2C1107.3855%2C1107.2355%2C1107.6044%2C1107.2063%2C1107.0318%2C1107.5421%2C1107.3240%2C1107.1769%2C1107.3151%2C1107.5688%2C1107.0800%2C1107.0271%2C1107.3815%2C1107.5594%2C1107.1511%2C1107.2843%2C1107.2586%2C1107.3642%2C1107.5501%2C1107.4980%2C1107.5772%2C1107.6038%2C1107.1111%2C1107.0338%2C1107.2483%2C1107.0059%2C1107.4639%2C1107.4201%2C1107.1352%2C1107.1637%2C1107.3733%2C1107.1582%2C1107.0772%2C1107.1301%2C1107.3951%2C1107.5338%2C1107.5899%2C1107.0707%2C1107.1215%2C1107.0280%2C1107.2547%2C1107.1634%2C1107.3777%2C1107.4088%2C1107.5327%2C1107.3231%2C1107.5076%2C1107.3928%2C1107.4431%2C1107.1484%2C1107.5760%2C1107.5730%2C1107.3401%2C1107.1420%2C1107.2148%2C1107.3608%2C1107.1109%2C1107.2518%2C1107.2371%2C1107.2303%2C1107.4708%2C1107.3950%2C1107.3530%2C1107.0438%2C1107.2940%2C1107.1845%2C1107.3017&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "One loop partition function for Topologically Massive Higher Spin\n  Gravity"}, "summary": "We calculate the one loop partition function for topologically massive higher\nspin gravity (TMHSG) for arbitrary spin by taking the spin-3 TMHSG action\nconstructed in arXiv:1107.0915 and subsequently generalising it for an\narbitrary spin. We find that the final result can be put into a product form\nwhich cannot be holomorphically factorized giving strong evidence that the\ntopologically massive higher spin gravity is dual to a high spin extension of\nlogarithmic CFT rather than a chiral one.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1107.1525%2C1107.2895%2C1107.2927%2C1107.3052%2C1107.3791%2C1107.4852%2C1107.1880%2C1107.1851%2C1107.2501%2C1107.5753%2C1107.0620%2C1107.1753%2C1107.0261%2C1107.2389%2C1107.3561%2C1107.3896%2C1107.5536%2C1107.2451%2C1107.2121%2C1107.5364%2C1107.4634%2C1107.2546%2C1107.1618%2C1107.1315%2C1107.0708%2C1107.1495%2C1107.2202%2C1107.0457%2C1107.1285%2C1107.3705%2C1107.4679%2C1107.2112%2C1107.2127%2C1107.5425%2C1107.3855%2C1107.2355%2C1107.6044%2C1107.2063%2C1107.0318%2C1107.5421%2C1107.3240%2C1107.1769%2C1107.3151%2C1107.5688%2C1107.0800%2C1107.0271%2C1107.3815%2C1107.5594%2C1107.1511%2C1107.2843%2C1107.2586%2C1107.3642%2C1107.5501%2C1107.4980%2C1107.5772%2C1107.6038%2C1107.1111%2C1107.0338%2C1107.2483%2C1107.0059%2C1107.4639%2C1107.4201%2C1107.1352%2C1107.1637%2C1107.3733%2C1107.1582%2C1107.0772%2C1107.1301%2C1107.3951%2C1107.5338%2C1107.5899%2C1107.0707%2C1107.1215%2C1107.0280%2C1107.2547%2C1107.1634%2C1107.3777%2C1107.4088%2C1107.5327%2C1107.3231%2C1107.5076%2C1107.3928%2C1107.4431%2C1107.1484%2C1107.5760%2C1107.5730%2C1107.3401%2C1107.1420%2C1107.2148%2C1107.3608%2C1107.1109%2C1107.2518%2C1107.2371%2C1107.2303%2C1107.4708%2C1107.3950%2C1107.3530%2C1107.0438%2C1107.2940%2C1107.1845%2C1107.3017&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We calculate the one loop partition function for topologically massive higher\nspin gravity (TMHSG) for arbitrary spin by taking the spin-3 TMHSG action\nconstructed in arXiv:1107.0915 and subsequently generalising it for an\narbitrary spin. We find that the final result can be put into a product form\nwhich cannot be holomorphically factorized giving strong evidence that the\ntopologically massive higher spin gravity is dual to a high spin extension of\nlogarithmic CFT rather than a chiral one."}, "authors": ["Arjun Bagchi", "Shailesh Lal", "Arunabha Saha", "Bindusar Sahoo"], "author_detail": {"name": "Bindusar Sahoo"}, "author": "Bindusar Sahoo", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1007/JHEP12(2011)068", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1107.2063v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1107.2063v2", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "16 pages, latex, minor modifications, calculation for generic spins\n  corrected. results qualitatively unchanged", "arxiv_primary_category": {"term": "hep-th", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "hep-th", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "gr-qc", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1107.2063v2", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1107.2063v2", "journal_reference": "JHEP12(2011)068", "doi": "10.1007/JHEP12(2011)068", "fulltext": "arXiv:1107.2063v2 [hep-th] 8 Sep 2011\n\nPreprint typeset in JHEP style - HYPER VERSION\n\nEMPG-11-21\nHRI/ST/1110\n\nOne loop partition function for\nTopologically Massive Higher Spin Gravity\n\nArjun Bagchi1∗, Shailesh Lal2†, Arunabha Saha2‡, Bindusar Sahoo3§\n1\n\nSchool of Mathematics,\nUniversity of Edinburgh\nEdinburgh EH9 3JZ, UK.\n2 Harish-Chandra\n\nResearch Institute,\nChhatnag Road, Jhusi,\nAllahabad 211019, India.\n\n3 ICTP,\n\nHigh Energy, Cosmology and Astroparticle Physics,\nStrada Costiera 11, 34151, Trieste, Italy.\n\nAbstract: We calculate the one loop partition function for topologically massive\nhigher spin gravity (TMHSG) for arbitrary spin by taking the spin-3 TMHSG action constructed in arXiv:1107.0915 and subsequently generalising it for an arbitrary\nspin. We find that the final result can be put into a product form which cannot\nbe holomorphically factorized giving strong evidence that the topologically massive\nhigher spin gravity is dual to a high spin extension of logarithmic CFT rather than\na chiral one.\n\n∗\n\narjun DOT bagchi AT ed DOT ac DOT uk\nshailesh AT hri DOT res DOT in\n‡\narunabha AT hri DOT res DOT in\n§\nbsahoo AT ictp DOT it\n†\n\n\fContents\n1. Introduction\n\n1\n\n2. The basic set up for s = 3\n\n4\n\n3. One-loop determinants for spin-3\n\n7\n\n4. Generalisation to arbitrary spin\n\n8\n\n5. Conclusions\n\n12\n\nA. Classical analysis for generic spins\n\n14\n\n1. Introduction\nPossibly the most viable testing ground for theories of quantum gravity has been\nthree dimensional gravity in Anti de-Sitter space. Pure Anti de-Sitter gravity in\nthree dimensions, as is well known, has no local propagating degrees of freedom. This\nfeature can be remedied by adding a topological, gravitational Chern-Simons term\nto the action and then one can show that the linearised equations of motion become\nthat of a massive scalar field. The theory goes under the name of Topologically\nMassive Gravity (TMG) [1, 2].\nThrough the celebrated AdS/CFT conjecture, there have been attempts to find\nthe dual of the 3d AdS theory in terms of a conformal field theory. The field theory\ndual to the bulk Einstein theory in AdS3 was initially conjectured to be an extremal\nCFT [3]. But a partition function computation by taking into account contributions\nfrom classical geometries and also including quantum corrections [4] showed that the\nexpected holomorphic factorisation does not hold and there were other studies [5]\nwhich indicated that this conjecture was incorrect.\nMotivated by [3], the authors of [6] looked at Einstein gravity in AdS, now\nmodified by a gravitational Chern-Simons term, with a hope to obtain holomorphic\nfactorization of the partition function. A study of asymptotic symmetries of pure\nAdS in [7] had lead to the construction of two copies of the Virasoro algebra with\n\n–1–\n\n\fcentral charges c± = 3l/2G (where l is the AdS radius and G the Newton's constant\nin three dimensions). With the addition of the Chern-Simons term, the two copies of\nthe Virasoro algebra still emerge as the asymptotic symmetry, but now with modified\ncentral charges c± =\n\n3l\n(1\n2G\n\n∓\n\n1\n),\nμl\n\nwhere 1/μ is the coefficient of the gravitational\n\nChern-Simons term in the action as shown in [8, 9]. At the 'chiral' point μl = 1, one\nof the central charges vanishes and this led to the Chiral Gravity conjecture in [6].\nThe authors claimed that at this value of the coupling, the boundary theory dual to\nTMG in AdS3 was a right-moving chiral CFT with a holomorphically factorizable\npartition function.\nThis conjecture was soon hotly debated (see, for example, the works [10]), and\nin [11, 12] it was shown that TMG at the chiral point was more generally dual to a\nLogarithmic Conformal Field Theory (LCFT) and that there were solutions which\ncarried negative energy at the chiral point, thus invalidating the earlier conjecture. A\nmore complete analysis in terms of holographic renormalisation techniques [13] was\ncarried out and the results supported the latter claim of the duality to LCFT. One\nof the more robust checks of this conjecture was the recent computation of the oneloop partition function [14]. It was conclusively shown that there is no holomorphic\nfactorisation of the one-loop partition function at the chiral point. The structure\nof the gravity calculation also matched with expectations from LCFT. The authors\n[14] found an exact matching with a part of the answer, viz. the single-particle\nexcitations and offered substantial numerical evidence of the matching of the full\npartition functions.\nRecently, there has been a renewed interest in theories of massless fields with spin\ngreater than two in AdS spacetimes. It is known that these interacting higher spin\ntheories are not sensible in flat spacetimes. Even in AdS, such theories generically\nrequire an infinite tower of fields with all possible spins to be consistent. Remarkably,\nin three dimensions, there can be a truncation to fields with spin less than and equal\nto N for any N. It has been argued in [15, 17] on the basis of a Brown-Henneaux\nanalysis that classically, these theories have an extended classical WN asymptotic\n\nsymmetry algebra (see also the recent work [16]). A one-loop computation in [18],\nusing the techniques developed in [19], showed that this symmetry is indeed perturbatively realised at the quantum level as well. This was an important ingredient in\nformulating the duality [20] between higher-spin theories and WN minimal models\n\nin the large-N limit. There was also a subsequent work [21], in which the authors\nprovided a bound on the amount of higher spin gauge symmetry present. This was\nregarded as a gravitational exclusion principle, where quantum gravitational effects\n\n–2–\n\n\fplace an upper bound on the number of light states in the theory. Different tests of\nthis duality have been performed successfully subsequent to its proposal, see [22].\nThe higher spin theories described above, like Einstein AdS gravity in three dimensions, do not have any propagating degrees of freedom. It is natural thus to ask\nif one can generalise Topologically Massive Gravity to theories of higher spin. We,\nin [23], initiated a construction of this theory, which we call Topologically Massive\nHigher Spin Gravity (TMHSG) (see also the overlapping work [24]). As a first step\nto this end, we studied the quadratic action for a spin-3 field in the linearised approximation about AdS and obtained hints that the spin-3 theory at the so-called\nchiral point is dual to a logarithmic CFT. Specifically, we found that the space of\nsolutions developed an extra logarithmic branch at the chiral point. In this paper,\nwe shall perform a quantum test of this conjecture. In particular, we shall compute\nthe one-loop partition function of the spin-3 theory on a thermal quotient of AdS3\nand show that it does not factorize holomorphically at the chiral point. Our analysis\nis along the lines of [14], and our results may be viewed as a higher-spin generalisation of theirs. We shall also compute the one-loop partition function for a spin-N\ngeneralisation of the action proposed in [23] and show that this property continues\nto hold. We interpret these results as an indication that the dual CFT at the chiral\npoint is not chiral, and that the results are consistent with the expectation of a high\nspin extension of a dual logarithmic CFT.\nA brief overview of this paper is as follows. In section 2 we shall review the\nbasic setup for the spin-3 calculation. We find that the one-loop partition function\nreceives contributions from transverse traceless spin-3, spin-2 (coming from the ghost\ndeterminant) and transverse spin-1 modes (which is the trace of the spin- 3 field).1\nWe compute the relevant one-loop determinants in section 3. We find that the spin3 and spin-1 contributions referred to above contain terms (apart from the usual\nholomorphic ones inherited from the undeformed theory) which are non-holomorphic\nin q ≡ eiτ , where τ is the modular parameter on the boundary torus of thermal AdS3 .\n\nIn particular, we find the contribution to the one loop partition function at the chiral\npoint, from the spin-3 fields to be\n(3)\nZT M HSG\n\n1\n\n∞ Y\n∞\n∞ Y\n∞\nY\nY\n1\n1\n1\n\u0001.\n=\n2\nm\nm̄\nk q̄ k̄\nn|\n(1\n−\nq\nq̄\n)\n1\n−\nq\n|1\n−\nq\nm=3 m̄=0\nn=3\nk=4 k̄=3\n∞\nY\n\n(1.1)\n\nWe remind the reader that in [23] we had obtained non-gauge spin-1 excitations in the spectrum\nof the theory, which were not present in the undeformed theory. It is perhaps not surprising that\nwe find an extra spin-1 contribution to the one-loop partition function of the theory as compared\nto that for the \"massless\" theory calculated in [18].\n\n–3–\n\n\fThe first term is the holomorphic contribution determined from a study of the massless theory in [18], the other terms are non-holomorphic, and new. The middle term\nis the contribution from the transverse traceless spin-3 determinant, while the last\nterm is the transverse spin-1 contribution coming from the trace of the spin-3 field.\nAs we can see from the spin-3 result that the one loop partition function is\nequivalent to the spectrum of the linearised equations of motion obtained by us in\n[23]. The contribution from the traceless spin-3 part to the partition function is from\n(m, m̄) = (3, 0) onwards which corresponds to the weights of the traceless primaries\nand its descendants as found in [23] and the contribution from the spin-1 trace is from\n(k, k̄) = (4, 3) onwards which corresponds to the weights of the trace primaries and\nits descendants as we found in [23]. Since the one loop calculation can be viewed as\n ̄\n\nthe partition function T r(q L0 q̄ L0 ), in general, we must expect all physical modes that\nwe saw in our classical analysis in [23] to show up in the one loop calculation with\nexactly the same weights. And this is what we get and hence our classical calculation\nin [23] and one loop calculations in the present paper are mutually consistent.\n\n2\n\nIn the later part of the paper we discuss the case of general spins in section 4,\nwhere we find analogous results. The relevant excitations are transverse traceless\nspin-s, spin-s − 1 (coming from the ghost determinant), transverse traceless spin-\n\ns − 2 ones (which is the trace of the spin-s field), transverse traceless spin-s − 3\n\n(coming from the longitudinal component of trace), transverse traceless spin-s − 4\n\n(coming from the longitudinal component of the longitudinal component of the trace)\nand so on upto transverse traceless spin-1, of which the spin-s, s − 2, s − 3, * * * , 1\n\ncontribute non-holomorphically to the one-loop partition function. There are no\nother relevant excitations coming from the spin-s analysis because of the doubletracelessness condition reviewed, for example, in [15]. In section 5, we conclude with\na brief interpretation of our results. We will also do a classical analysis for arbitrary\nspins in appendix A and show that the contributions to the partition function also\nappear in the classical spectrum.\n\n2. The basic set up for s = 3\nIn this section we will compute the one loop partition function for spin 3 TMHSG,\nand in the process build up a mechanism to generalise our calculations to arbitrary\nspin in the subsequent section. Following the method adopted in [18], we shall\ncompute the one-loop partition function in the Euclideanised version of theory via\n2\n\nWe thank Rajesh Gopakumar for mentioning this point to us.\n\n–4–\n\n\fthe path integral\nZ\n\n(s)\n\n1\n=\nVol(gauge group)\n\nZ\n\n\u0002\n\u0003\nDφ(s) e−S [φ(s) ] .\n\n(2.1)\n\n\u0002 \u0003\nIn the one-loop approximation, only the quadratic part of the action S φ(s) is\n\nrelevant. This has been worked out for TMHSG, for the case of s = 3, in [23]. In\nthe Euclidean signature it takes the form\n\u0014\n\u0015\nZ\n1\n1\n3 √\nMNP\nF̂M N P − F̂(M gN P ) ,\nS=\nd x gφ\n2\n2\nwhere\nF̂M N P = D (M ) FM N P ≡ FM N P +\n\ni\nεQR(M ∇Q F RN P ) ,\n6μ\n\n(2.2)\n\n(2.3)\n\nand\n2\n1\nFM N P = ∆φM N P − ∇(M | ∇Q φ|N P )Q + ∇(M ∇N φP ) − 2 g(M N φP ) .\n2\nl\n\n(2.4)\n\nAs always, the brackets \"( )\" denote the sum of the minimum number of terms\nnecessary to achieve complete symmetrisation in the enclosed indices without any\nnormalisation factor. Let us also define the operation of D (M ) on the trace of the\n\nspin-3 field by taking the trace of the expression in (2.3)\nD (M ) φM = φM +\n\ni\nεQRM ∇Q φR\n6μ\n\n(2.5)\n\nWe now decompose the fluctuations φM N P into transverse traceless φ(T T ) , trace φ̃M\nand longitudinal parts ∇(M ξN P ) as3\n(T T )\n\nφM N P = φM N P + φ̃(M gN P ) + ∇(M ξN P ) .\n\n(2.6)\n\nFollowing [18], we use gauge invariance, and orthogonality of the first two terms in\n(2.6) to decompose the action (2.2) as\n(T T )\n\nS[φM N P ] = S[φM N P ] + S[φ̃M ],\nwhere\n(T T )\nS[φM N P ]\n\nand\n9\nS[φ̃M ] =\n4\n\nZ\n\n3\n\ndx\n\n√\n\n1\n=−\n2\n\nZ\n\n\u0002\n\u0003 (T T )\n√\nd3 x gφ(T T )M N P −D (M ) ∆ φM N P ,\n\n\u0013\n\u0015\n\u0012\n\u0014\n7\nM (M )\nQ\nM (M )\n−∆ + 2 φM − φ D ∇M ∇ φQ .\ng 8φ D\nl\n\n3\n\n(2.7)\n\n(2.8)\n\n(2.9)\n\nNote that this decomposition is not orthogonal, in the sense that the trace part contains longitudinal terms, and the longitudinal part is not traceless. See [18].\n\n–5–\n\n\fNow one can further decompose φ̃M into its transverse and longitudinal parts as\n(T )\n\nφ̃M = φ̃M + ∇M χ.\n\n(2.10)\n\nThe action for φM then becomes\n\u0013\n\u0013\n\u0015\n\u0012\n\u0012\n\u0014\nZ\n8\n7\n9\n(T )\n3 √\n(T )M (M )\nd x g 8φ̃\n−∆ + 2 φ̃M + 9χ −∆ + 2 (−∆)χ .\nD\nS[φ̃M ] =\n4\nl\nl\n(2.11)\nWe see that the χ part of the action is same as that obtained for the massless theory\nin [18] and will subsequently cancel with the relevant term coming from the ghost\ndeterminant, which arises from making the change of variables (2.6) in the path\nintegral (2.1). The ghost determinant– being independent of the structure of the\naction– is essentially be the same as that obtained [18], see their expression (2.14).\nThis turns out to imply that although that the trace contribution does not cancel\nwith the ghost determinant, the contribution coming from its longitudinal part does.\nThis is in accordance with the observation in [23] that the trace in TMHSG is not\npure gauge unlike the massless theory. It is however still true even in the topologically\nmassive theory that ∇M φM is pure gauge and hence the longitudinal contribution\n\nfrom the trace φM does cancel with the ghost determinant.\n\nThe spin-3 contribution to the one loop partition function for TMHSG is given\nby\n(3)\n\n1\n\n(3)\n\nZT M GHS = Zgh × (det[(−D(M ) ∆)]T(3)T )− 2 × (det[D(M ) (−∆ +\n× (det[−∆(−∆ +\n\n1\n8\n)](0) )− 2 ,\n2\nl\n\n7 T −1\n)] ) 2\nl2 (1)\n(2.12)\n\n(3)\n\nwhere Zgh is the ghost determinant arising as a Jacobian factor corresponding to\nthe change of variables (2.6). The ghost determinant has been obtained in [18], see\ntheir expression (3.9), and is given by\n(3)\n\nZgh = [det(−∆ +\n\n1\n6 TT\n7 T\n8\n2.\n)\n×\ndet(−∆\n+\n)\n×\ndet(−∆\n+\n)\n]\n(0)\n(2)\n(1)\nl2\nl2\nl2\n\n(2.13)\n\nTherefore, the spin-3 contribution to the one loop partition function is given by\n1\n\n1\n\n(3)\n\nZT M GHS = [det[−D(M ) ∆]T(3)T ]− 2 [det[D(M ) ]T(1) ]− 2 [det[−∆ +\n(3)\n\n(3)\n\n≡ Zmassless ZM ,\n\n6 TT 1\n)] ] 2\nl2 (2)\n(2.14)\n\n(3)\n\nwhere Zmassless is the massless spin-3 partition function obtained in [18], which is\n(3)\nZmassless\n\n=\n\n∞\nY\n\n1\n.\n|1 − q n |2\ns=3\n\n–6–\n\n(2.15)\n\n\f(3)\n\nIt remains to determine ZM . In order to do so, we shall follow the method of [14],\n(3)\n\nand first calculate the absolute value |ZM |. Following [14], we define\n\u0003− 1\n\u0002\n\u0003− 1 \u0002\n(3)\n|ZM | = det(D(M ) D̄(M ) )T(3)T 4 × det(D(M ) D̄(M ) )T(1) 4 .\n\n(2.16)\n\nThe subscript (3) and (1) signifies that the operators are acting on transverse traceless\nspin-3 and transverse spin-1 respectively. Using (2.3) and (2.5), we can show that\n4\n1\n(∆ + 2 − 4μ2 )φTMTN P\n2\n4μ\nl\n1\n2\nD(M ) D̄(M ) φTP = −\n[−∆ + (36μ2 − 2 )]φTP .\n2\n36μ\nl\n\nD(M ) D̄(M ) φTMTN P = −\n\n(2.17)\n\nTherefore,\n\"\n\n\u0012\n\n1\n(3)\n|ZM | = det −∆ + 4(μ2 − 2 )\nl\n\n\u0013 #− 14\n(3)\n\n\"\n\n\u0012\n\n2\n× det −∆ + (36μ2 − 2 )\nl\n\n\u0013 #− 41\n\n. (2.18)\n\n(1)\n\n3. One-loop determinants for spin-3\nWe shall evaluate the one-loop determinants utilising the machinery developed in\n[19], according to which the relevant determinant takes the following form\nZ ∞\n2\nm2s T T\ndt (s)\n− log det(−∆ + 2 )(s) =\nK (τ, τ̄ ; t)e−m(s) t ,\nl\nt\n0\n\n(3.1)\n\nwhere K (s) is the spin-s heat kernel given by\n(s)\n\nK (τ, τ̄ ; t) =\n\n∞\nX\n\nm=1\n\n√\n\nm2 τ 2\nτ2\n− 4t 2 −(s+1)t\ncos(smτ\n)e\ne\n.\n1\n4πt|sin mτ\n|2\n2\n\nWe therefore obtain\n\u0013T T X\n\u0012\n∞\n1 cos(3mτ1 ) −2μlmτ2\n4(μ2l2 − 1)\n=\n− log det −∆ +\nmτ 2 e\nl2\nm\n|sin\n|\n(3)\n2\nm=1\n\n∞\nX\n2\nq 3m + q̄ 3m\n=\n(q q̄)m(μl−1) ,\nm )(1 − q̄ m )\nm\n(1\n−\nq\nm=1\n\n(3.2)\n\n(3.3)\n\nand similarly,\n36μ2l2 − 2\n− log det −∆ +\nl2\n\u0014\n\n\u0015T\n\n(1)\n\n∞\nX\nq m + q̄ m\n2\n=\n(q q̄)3μlm .\nm )(1 − q̄ m )\nm\n(1\n−\nq\nm=1\n\n(3.4)\n\nWe have used the notations and conventions of [19] throughout. We remind the\nreader that q ≡ eiτ , where τ = τ1 + iτ2 is the complex structure modulus on the\n\n–7–\n\n\fboundary torus of thermal AdS3 . We can now put together all the contributions into\nthe expression for the one-loop partition function\n(3)\nlog |ZM |\n\n\u0013T T\n\u0015T\n\u0012\n\u0014\n1\n4(μ2 l2 − 1)\n36μ2l2 − 2\n1\n− log det −∆ +\n= − log det −∆ +\n4\nl2\n4\nl2\n(3)\n(1)\n∞\n∞\n3m\n3m\nm\nm\nX\nX\n1\nq + q̄\nq + q̄\n1\n=\n(q q̄)m(μl−1) +\n(q q̄)3μlm .\nm\nm\nm )(1 − q̄ m )\n2m\n(1\n−\nq\n)(1\n−\nq̄\n)\n2m\n(1\n−\nq\nm=1\nm=1\n\n(3.5)\n\nFollowing [14], we infer from this that at the chiral point we have (after rewriting\n(3)\n\nlog |ZM | =\n\n1\n2\n\n(3)\n\n(3)\n\nlog ZM + 21 log Z̄M )\n(3)\nlog ZM\n\n\u0001\n∞\n3m\nX\n1 q 3m + (q q̄) q m\n.\n=\nm (1 − q m ) (1 − q̄ m )\nm=1\n\n(3.6)\n\nLet us now note that\n∞\n∞ X\n∞\nX\nX\n1\nq 3n\n=−\nlog (1 − q m q̄ m̄ )\nn ) (1 − q̄ n )\nn\n(1\n−\nq\nn=1\nm=3 m̄=0\n\n∞ X\n∞\n∞\nX\nX\n(q q̄)3n q n\n1\n=−\nlog (1 − q m q̄ m̄ ) ,\nn\nn\nn (1 − q ) (1 − q̄ )\nm=4 m̄=3\nn=1\n\n(3.7)\n\nand hence the spin-3 contribution to the full partition function at the ciral point,\nfactorizes as (after including the massless contribution from [18])\n(3)\nZT M HSG\n\n∞ Y\n∞\n∞ Y\n∞\nY\nY\n1\n1\n1\n\u0001.\n=\n2\nm\nm̄\nk q̄ k̄\nn|\n(1\n−\nq\nq̄\n)\n1\n−\nq\n|1\n−\nq\nm=3 m̄=0\nn=3\nk=4 k̄=3\n∞\nY\n\n(3.8)\n\nThis is the expression (1.1) that we had mentioned in the introduction. As noted\nthere, the partition function does not factorize holomorphically. A chiral CFT would\nnot give rise to such a partition function. We therefore take this as a one-loop clue\nthat the dual CFT to TMHSG is indeed not chiral, but logarithmic. We remind the\nreader that an analogous result was found in [14] for the case of topologically massive\ngravity, from which the authors were able to conclude that the dual CFT was indeed\nlogarithmic.\n\n4. Generalisation to arbitrary spin\nIn this section, we will consider a natural generalisation of our spin-3 action (2.2) to\nan arbitrary spin-s field. We will perform the analysis of Sections 2 and 3 and show\n\n–8–\n\n\fthat holomorphic factorisation does not occur. We take the action4\n\u0015\n\u0014\nZ\n1\n1 P\n3 √\nM1 M2 ***Ms\nd x gφ\nS=\nF̂M1 M2 ***Ms − F̂ P (M1 ***Ms−2 gMs−1 Ms ) ,\n2\n2\n\n(4.1)\n\nwhere\nF̂M1 ***Ms = D (M ) FM1 M2 ***Ms ≡ FM1 ***Ms +\n\ni\nεQR(M1 ∇Q F RM2 ***Ms ) ,\ns(s − 1)μ\n\n(4.2)\n\nand\n1\nFM1 M2 M3 .....Ms ≡ ∆φM1 M2 .....Ms − ∇(M1 | ∇Q φ|M2.....Ms)Q + ∇(M1 ∇M2 φM3 M4 ....Ms)PP\n2\n\u0003\n1 \b\u0002 2\n− 2 s − 3s φM1 M2 ....Ms + 2g(M1 M2 φM3 M4 ...Ms)PP .\nl\n(4.3)\nThe normalisation\n\n1\ns(s−1)\n\nin equation (4.2) is fixed by demanding that even in the\n\nspin-N case, the chiral point remains μl = 1. One can check that the spin-s\ngeneralised action (4.1) is invariant under the gauge transformation φM1 ***Ms →\n\nφM1 ***Ms + ∇(M1 ξM2 ***Ms ) where ξM2 ***Ms is a symmetric-traceless gauge parameter.\n\nNow we would like to consider the possibility that the higher-spin theory with\n\nspins upto N is also dual to a high spin extension of LCFT. One would then expect\nthat along the lines of what we have seen for spin-3, the one-loop partition function\nagain would not factorize holomorphically. We will now do a one-loop analysis using\nthe action (4.1) with this goal in mind. An essential ingredient for this analysis – as\nin the case of spin 3 – is the action of D (M ) on symmetric transverse traceless (STT)\n\ntensors of rank s and below. Using the definition of D (M ) in (4.2), one can show that\nD̄\n\n(M )\n\n(T T )\nD (M ) φM1 ***Ms\n(s−2,T T )\n\nD̄ (M ) D (M ) φM3 ***Ms\n(s−m,T T )\n\nD̄ (M ) D (M ) χMs−m+1 ***Ms\n\n\u0014\n\u0015\n1\nm2s (T T ),\n=\n−∆ + 2 φM1 ***Ms\nl\n(s − 1)2 μ2\n\u0015\n\u0014\nm2s−2 (s−2,T T )\n(s − 2)2\n−∆ + 2 φM1 ***Ms ,\n=\nl\n(s − 1)2 s2 μ2\n\u0015\n\u0014\nm2s−m (s−m,T T )\n(s − m)2\n=\nχMs−m+1 ***Ms ,\n−∆ +\nl2\n(s − 1)2 s2 μ2\n\n4\n\n(4.4)\n\nIn principle, as mentioned in [23], we can obtain the quadratic action for topologically massive\nspin-N fields from the Chern-Simons formulation of the theory with unequal levels. However, this\naction is a natural extension of the spin-2 and the spin-3 actions, and since the structure is fixed by\ngauge invariance, the action that follows from the Chern-Simons formulation with unequal levels\nshould give rise to the same action. The Chern-Simons formulation should also fix the normalisation\nof parity violating C-S term in (4.2) which was fixed by demanding uniqueness of the chiral point.\n\n–9–\n\n\fwhere\nm2s = μ2 l2 (s − 1)2 − (s + 1)\nm2s−m = μ2 l2\n\ns2 (s − 1)2\n− (s − m + 1),\n(s − m)2\n\ns > m ≥ 2.\n\n(4.5)\n\nHere φ(s−2) and χ(s−n) are STT tensors of rank s − 2 and s − n respectively, where\n\nn ≥ 3.\n\nFollowing the same steps as for spin-3 in the previous section, the one loop\n\npartition function can be factorized as\n(s)\n\n(s)\n\n(s)\n\nZT M HSG = Z(massless) ZM ,\n\n(4.6)\n\n(s)\n\nThe contributions to ZM come from the determinants of D (M ) acting on φ(T T ) ,\nφ(s−2,T T ) and χ(s−m,T T ) (for s > m ≥ 3). This is apparent from (4.4), which suggests\n\nthat D (M ) acts non trivially on the STT modes of spin-1 and higher. The action of\nD (M ) stops at χ(1) as it acts trivially on scalars, being just the identity map. After\n\na careful analysis, one sees that\n(s)\nlog |ZM |\n\n\u0012\n\u0012\n\u0013(T T )\n\u0013(T T )\ns−1\nm2s−m\nm2s\n1X\n1\n. (4.7)\nlog det −∆ +\n−\n= − log det −∆ + 2\n4\nl (s)\n4 m=2\nl2\n(s−m)\n\nWe find, using the spin-s heat kernel (3.2) and the expression (3.1) for the determinant,\n\u0013(T T )\n∞\nms\nX\n(s−1)\n+ q̄ ms\nm2s\n2\nm 2 (μl−1)] q\n[\n− log det −∆ + 2\n=\n(q q̄)\n,\nl (s)\nm\n|1 − q m |2\nm=1\n\u0013(T T )\n\u0012\n∞\nn(s−m)\nX\nm2s−m\n2\n+ q̄ n(s−m)\n[k(s,m,μl)n] q\n=\n(q\nq̄)\n− log det −∆ +\n, (4.8)\nn |2\nl2\nn\n|1\n−\nq\n(s−m)\nn=1\n\u0012\n\nWhere,\nk(s, m, μl) =\n\ns(s − 1)μl − (s − m)(s − m − 1)\n.\n2(s − m)\n\n(4.9)\n\nAt the chiral point μl = 1, it becomes\nk(s, m, 1) ≡ k(s, m) =\n\nm(2s − m − 1)\ns(s − 1) − (s − m)(s − m − 1)\n=\n,\n2(s − m)\n2(s − m)\n\n(4.10)\n\n(s)\n\nand hence at the chiral point the partition function ZM becomes\n\u0011\n\u0010\nPs−1\nk(s,m)n (s−m)n\nsn\n∞\nq\nX 1 q + m=2 (q q̄)\n(s)\n.\nlog ZM =\nn\n(1 − q n ) (1 − q̄ n )\nn=1\n\n– 10 –\n\n(4.11)\n\n\fAfter using the identities\n∞ X\n∞\n∞\nX\nX\nq sn\n1\n=−\nlog (1 − q m q̄ m̄ ) ,\nn ) (1 − q̄ n )\nn\n(1\n−\nq\nm=s m̄=0\nn=1\n\n∞\n∞\nX\nX\n1 (q q̄)k(s,m)n q (s−m)n\n=−\nn (1 − q n ) (1 − q̄ n )\nn=1\n\n∞\nX\n\np=r(s,m) p̄=k(s,m)\n\nlog (1 − q p q̄ p̄ )\n\n(4.12)\n\nwhere,\nr(s, m) = k(s, m) + s − m =\n\ns(s − 1) + (s − m)(s − m + 1)\n,\n2(s − m)\n\n(4.13)\n\nthe contribution to the full partition function from spin-s field at the chiral point,\nbecomes\n(s)\n\nZT M HSG =\n\ns−1 Y\n∞\n∞\n∞ Y\n∞\nY\nY\nY\n1\n1\n1\n.\n2\nm q̄ m̄ )\np q̄ p̄ )\nn|\n(1\n−\nq\n(1\n−\nq\n|1\n−\nq\nt=2 p=r(s,t) p̄=k(s,t)\nm=s m̄=0\nn=s\n∞\nY\n\n(4.14)\n\nHence, the full partition function at the chiral point, in a theory with fields of spin\ns = 3, * * * N in addition to the spin 2 graviton, becomes\n#  N s−1 ∞\n\"∞\nN\n∞ Y\n∞\nYY Y\nY\nY\nY\n1\n1\n\n×\nZT M HSG =\n2\n|1 − q n | m=s m̄=0 (1 − q m q̄ m̄ )\ns=3 t=2\ns=2 n=s\n\n∞\nY\n\np=r(s,t) p̄=k(s,t)\n\nWhere\n\nk(s, m) =\n\ns(s − 1) − (s − m + 1)(s − m − 1)\n,\n2(s − m)\n\n\n1\n,\n(1 − q p q̄ p̄ )\n\nr(s, m) = k(s, m) + s − m\n\n(4.15)\n\nWe will see in appendix A that r(s, m) and k(s, m) appear respectively as left and\nright weights of classical left moving primary solution (or massive primary at the\nchiral point). In particular, we will also see that, r(s, m, μl) ≡ k(s, m, μl) + s − m,\nand k(s, m, μl) will be the weights of massive primary at a generic point. Thus we\n\nalso see that for generic spins, our one loop computations and classical computations\nare also mutually consistent.\nNote that the first square bracket contribution starts from s = 2 whereas the\nsecond square bracket contribution starts from s = 3. This is a novel feature of\ntopologically massive higher spin theory and technically this comes from the fact\nthe trace is not a pure gauge. As the spin increases, the factors contributing to\nthe partition function also increases. This, as discussed before, comes from the fact\nthat longitudinal component of trace, longitudinal components of the longitudinal\ncomponents of the trace and so on are not pure gauge and starts contributing till\none hits a scalar, which is a pure gauge and the contribution terminates.\n\n– 11 –\n\n\fOne might be worried about the fact that k(s, m) and r(s, m) in (4.15) are not\nintegers for generic spin, and this might not be consistent with the periodicity in τ .\nHowever one might note that r(s, m) − k(s, m) = s − m, which is an integer and\n\nhence the periodicity in τ is not affected because of the following identity\nq r(s,m) q̄ k(s,m) = (q q̄)k(s,m) q s−m .\n\n(4.16)\n\n5. Conclusions\nIn this paper, motivated by the results of [23], we computed the one loop partition\nfunction for topologically massive higher spin gravity (TMHSG) for spin-3 and later\ngeneralised it to arbitrary spin. We find that the one loop partition function does not\nfactorize holomorphically giving strong evidence that the dual theory is a high spin\nextension of LCFT. This was also anticipated in the classical calculation for spin-3\nTMHSG in [23] as extra logarithmic modes emerged at the chiral point. Although\nthis result might be tantalising, a CFT interpretation of the result would make the\nproposal of a high spin extension of dual LCFT more concrete.\nWe had speculated on the possible realisation of the symmetry algebra in [23].\nOne of our speculations was that since the classical W3 algebra at the chiral point\nseems to become singular due to the presence of the inverse of the central charge\n\nin the coefficient of the non-linear term in the [W, W ] commutator, we should look\nat a contraction of this algebra which would effectively reduce this to a Virasoro\nalgebra. While this was a perfectly correct limit, we also suggested that this could\nbe a rather restrictive realisation. Our analysis in this paper shows that in addition\nto the non-holomorphic factorisation and a contribution from the trace modes, what\nwe obtain in the 1-loop partition function at the chiral point is the vacuum character\nof the W3 , for the spin-3 case and a similar WN vacuum character for the spin-N\n\ngeneralisation. This indicates conclusively that the W-algebra exists in the chiral\n\nlimit and does not simply reduce to the Virasoro algebra. This also adds strength\nto another of our speculations in [23], viz. at the chiral point one needs to consider\nthe quantum version of the W3 , where the problematic coefficient of the non-linear\n\nterm gets a shift and hence is not singular at the chiral point.\n\nThis also gives rise to the expectation that we would see novel logarithmic behaviour in the W-algebra and not the Virasoro alone. Another piece of evidence of\nthe emergent logarithmic nature of the W-algebra at the chiral point comes from\n\nlooking at the OPE of the W-algebra. Let us concentrate of the W3 for the moment.\n\nThe quantum W3 introduced by Zamolodchikov in [25] contains two generators, the\n\n– 12 –\n\n\fenergy-momentum tensor T (z) and W (z), where W (z) is a primary of spin 3 with\nrespect to T (z). The OPE of W (z) with itself is given by\nW (z)W (w) ∼\n\nwhere Λ(w) = T T (w) −\n\n2T (w)\n∂T (w)\nc/3\n+\n+\n(z − w)6 (z − w)4 (z − w)3\n3 2\n1 3\n2βΛ(w) + 10\n∂ T (w) β∂Λ(w) + 15\n∂ T (w)\n+\n+\n2\n(z − w)\n(z − w)\n\n3 2\n∂ T (w)\n10\n\nand β =\n\n16\n.\n5c+22\n\n(5.1)\n\nFrom here we can read off the\n\ntwo-point function\n\nc/3\n(5.2)\n(z − w)6\nThe left-moving central charge of the W3 at the chiral point vanishes and this also\nhW (z)W (w)i =\n\nmeans that the two-point function of W (z) vanishes here. This is a clear indication\nof a logarithmic CFT and we expect the following structure:\nhW (z)W (0)i = 0,\n\nhW (z)w(0, 0)i =\n\nbw\n6\nz\u0013\n\n\u0012\n1\nhw(z, z̄)w(0, 0)i = 6 Bw − bw log m2 |z|2\nz\n\n(5.3)\n(5.4)\n\nwhere w(z, z̄) is the logarithmic partner of W (z). bw is a characterising feature of\nthe LCFT, whereas Bw can be got rid of by a field redefinition. It would be very\ninteresting to see if this expected structure actually emerges from a more thorough\nanalysis in the gravitational set-up generalising the relevant computation done for\nspin-2 in [13, 12]. It is plausible that given the complicated structure of the 1-loop\npartition function that we have obtained here with the additional pieces from the\nnovel trace terms, we would get a richer structure in the logarithmic CFT duals to\nthe TMHSG. We leave addressing this issue for future work.\nBefore we conclude, we would like to remind the reader of a few important\nobservations that follow from the results in the present paper. The fact that the 1loop partition function does not holomorphically factorize gives support to the claim\nthat the the dual to TMHSG is a high spin extension of a logarithmic CFT, and not\na chiral one. Additionally there is the presence of a non trivial spin one contribution\n(in case of spin 3 TMHSG) in the one loop partition function. This points to the fact\nthat the trace modes cannot be gauged away, both of which results are in accordance\nwith our analysis of classical solutions in [23].\nAcknowledegments\nWe would like to thank Rajesh Gopakumar and Daniel Grumiller for helpful discussions and for their valuable comments on the manuscript. SL and AS would like to\n\n– 13 –\n\n\fthank CHEP, IISc Bangalore and ICTS Bangalore for hospitality during the course\nof this work.\n\nA. Classical analysis for generic spins\nIn this appendix, we will study the classical analysis for generic spins and show that\nk(s, m, μl) (4.9) and r(s, m, μl) ≡ k(s, m, μl) + s − m will appear as weights (right\n\nand left respectively) of massive primaries in the linearised spectrum of generic spins.\nThe classical equation of motion for a generic spin is\nF̂M1 ***Ms ≡ D (M ) FM1 M2 ***Ms ≡ FM1 ***Ms +\n\n1\nεQR(M1 ∇Q F RM2 ***Ms ) = 0, (A.1)\ns(s − 1)μ\n\nwhere\n1\nFM1 M2 M3 .....Ms ≡ ∆φM1 M2 .....Ms − ∇(M1 | ∇Q φ|M2.....Ms)Q + ∇(M1 ∇M2 φM3 M4 ....Ms)PP\n2\n\u0003\n1 \b\u0002 2\n− 2 s − 3s φM1 M2 ....Ms + 2g(M1 M2 φM3 M4 ...Ms)PP .\nl\n(A.2)\nUsing the field redefinition and the gauge condition defined below,\nφM1 ***Ms = φ̃M1 ***Ms −\n∇M φ̃M M2 ***Ms =\n\n1\n(s−2)\ng(M1 M2 φ̃M3 ***Ms ) ,\n2\ns\n\n1\n(s−2)\n∇(M2 φ̃M3 ***Ms ) ,\n2\n\n(A.3)\n\nwe can write\nFM1 M2 M3 .....Ms = D (L) D (R) φ̃M1 ***Ms ,\n\n(A.4)\n\nwhere\nl\nεQR(M1 ∇Q φ̃RM2 ***Ms ) ,\ns(s − 1)\nl\nεQR(M1 ∇Q φ̃RM2 ***Ms ) .\n−\ns(s − 1)\n\nD (L) φ̃M1 ***Ms ≡ φ̃M1 ***Ms +\nD (R) φ̃M1 ***Ms ≡ φ̃M1 ***Ms\n\n(A.5)\n\nOne can now check that the equations of motion implies that\ng M1 M2 ∇M3 * * * ∇Ms F̂M1 ***Ms = 0\n\n=⇒ g M1 M2 ∇M3 * * * ∇Ms FM1 ***Ms = 0\n(s−2)\n\n=⇒ ∇M3 * * * ∇Ms φ̃M3 ***Ms = 0.\n\n(A.6)\n\nNow let us write down the massive branch equation D (M ) φ̃ = 0, by operating on it\nfrom the left by D̄ (M ) which is the same as D (M ) with μ replaced by −μ. By replacing\n\n– 14 –\n\n\fμl = ±1 on the solutions obtained here, we can recover the left and right branch\n\nsolutions. The equations are\n\nm2s\n(2s − 3)\n1\n(s−2)\n(s−2)\n=\nφ̃\n∇\n∇\nφ̃\n(s2 − s + 2)g(M1 M2 φ̃M3 ***Ms )\n+\nM\n***M\nM\n(M\ns\n1\n2\n1\nM\n***M\n)\ns\n3\nl2\n2s2\nl 2 s2\n1\n1\n(s−2)\n(s−3)\n+ 2 g(M1 M2 ∆φ̃M3 ***Ms ) − 2 g(M1 M2 ∇M3 χM4 ***Ms ) ,\ns\ns\nm2\n(2s − 5)\n2\n(s−2)\n(s−2)\n(s−3)\n(s−4)\n∆φ̃M3 ***Ms − s−2\nφ̃M3 ***Ms =\ns>2\n2 ∇(M3 χM4 ***Ms ) −\n2 g(M3 M4 χM5 ***Ms ) ,\n2\nl\n(s − 2)\n(s − 2)\nm2s−3 (s−3)\n2\n(2s − 7)\n(s−4)\n(s−5)\n(s−3)\ns>3\n∆χM4 ***Ms − 2 χM4 ***Ms =\n2 ∇(M4 χM5 ***Ms ) −\n2 g(M4 M5 χM6 ***Ms ) ,\nl\n(s − 3)\n(s − 3)\n..\n.\n2\nm (2)\n3\n(2)\n(1)\n∆χM N − 22 χM N = ∇(M χN ) ,\nl\n4\n2\nm\n(1)\n(1)\n(A.7)\n∆χM − 21 χM = 0,\nl\n∆φ̃M1 ***Ms −\n\nwhere\n(s−2)\n\nχ(s−m) = ∇M3 * * * ∇Mm φ̃M3 ***Ms ,\n\n(A.8)\n\nand ms and ms−m are given in (4.5). The procedure to solve the above equations is\nsame as the spin-3 analysis done in [23]. We need to start with the last equation of\n(A.7), the solution of which would be given by h − h̄ = ±1, where h and h̄ are the\nleft and right weights. We will put the solution of χ(1) into the equation of χ(2) and\n\ndecompose χ(2) into two parts, one carrying the weights of χ(1) and the other would\nbe transverse, the solution of which would be given by h − h̄ = ±2. Following the\n\nsteps similarly we will decompose χ(3) into three parts, one carrying the weight of\nχ(1) , another carrying the weights of transverse χ(2) and a part which is transverse\non its own carrying weight h − h̄ = ±3. In this way we will finally obtain the full\n\nsolution. We are not interested in obtaining the explicit form of the final solution\n(although there is no technical obstacle in doing so). We will, however, be interested\nin obtaining the weights of the different modes present in the final solution. For that\nit is sufficient (as per the argument above) to analyse the transverse traceless parts\nof the equations (A.7). For that let us write the Laplacian acting on traceless rank-s\ntensor as\n∆φM1 ***Ms\n\n\u0015\n\u0014\n\u0001 s(s + 1)\n2\n2\n2\nφM1 ***Ms\n= − 2 L + L̄ −\nl\nl2\n\n(A.9)\n\nWhere, L2 and L̄2 are the left and right SL(2, R) casimirs of the isometry group of\nAdS3 (see eq 4.11 and 4.12 of [23]). The eigenvalues of L2 and L̄2 are given by h(1−h)\nand h̄(1 − h̄), where h and h̄ are the left and right weights of the solution. We will\n\n– 15 –\n\n\falso use the fact that for a rank-s, transverse traceless primary, h− h̄ = ±s. Thus the\n\ndifferent modes of equation (A.7), will carry weights h − h̄ = ±s, h − h̄ = ±(s − 2),\nh − h̄ = ±(s − 3), * * * , h − h̄ = ±1. By using (A.7) and (A.9), we obtain the weights\nof the different modes as\nh − h̄ = +s :\nh − h̄ = −s :\nh − h̄ = +(s − m) :\n\nh − h̄ = −(s − m) :\n\ns2 (μl + 1) − s (μl − 1)\ns(s − 1)(μl − 1)\n, h̄ =\n,\n2s\n2s\ns2 (μl + 1) − s (μl − 1)\ns(s − 1)(μl − 1)\n, h̄ =\n,\nh=\n2s\n2s\n(s − m + 1)(s − m) + s(s − 1)μl\nh=\n= r(s, m, μl),\n2(s − m)\ns(s − 1)μl − (s − m − 1)(s − m)\n= k(s, m, μl), (s − 1) ≥ m ≥ 2,\nh̄ =\n2(s − m)\nh = k(s, m, μl), h̄ = r(s, m, μl), (s − 1) ≥ m ≥ 2\n(A.10)\nh=\n\nThe modes with negative h − h̄ will not belong to the massive branch (they appear\n\nbecause we had the operation of D̄ (M ) on the original equation of motion). But these\n\nmodes will become the right branch solution by taking μl = 1. The modes with\npositive h − h̄ will belong to the massive branch solution. For μl = 1, they will\n\nbecome the left branch solutions. These are the weights that also appear in the one\nloop partition function at the chiral point (4.15).\n\nReferences\n[1] S. Deser, R. Jackiw and S. Templeton, \"Topologically Massive Gauge Theories,\"\nAnnals Phys. 140, 372 (1982) [Erratum-ibid. 185, 406 (1988)] [Annals Phys. 185,\n406 (1988)] [Annals Phys. 281, 409 (2000)].\n[2] S. Deser, R. Jackiw and S. Templeton, \"Three-Dimensional Massive Gauge\nTheories,\" Phys. Rev. Lett. 48, 975 (1982).\n[3] E. Witten, \"Three-Dimensional Gravity Revisited,\" arXiv:0706.3359 [hep-th].\n[4] A. Maloney and E. Witten, \"Quantum Gravity Partition Functions in Three\nDimensions,\" JHEP 1002, 029 (2010) [arXiv:0712.0155 [hep-th]].\n[5] M. R. Gaberdiel, \"Constraints on extremal self-dual CFTs,\" JHEP 0711, 087\n(2007) [arXiv:0707.4073 [hep-th]].\nM. R. Gaberdiel and C. A. Keller, \"Modular differential equations and null\nvectors,\" JHEP 0809, 079 (2008) [arXiv:0804.0489 [hep-th]].\n[6] W. Li, W. Song and A. Strominger, \"Chiral Gravity in Three Dimensions,\" JHEP\n0804, 082 (2008) [arXiv:0801.4566 [hep-th]].\n\n– 16 –\n\n\f[7] J. D. Brown, M. Henneaux, \"Central Charges in the Canonical Realization of\nAsymptotic Symmetries: An Example from Three-Dimensional Gravity,\" Commun.\nMath. Phys. 104, 207-226 (1986).\n[8] S. N. Solodukhin, \"Holography with gravitational Chern-Simons,\" Phys. Rev. D 74,\n024015 (2006) [arXiv:hep-th/0509148].\n[9] P. Kraus and F. Larsen, \"Holographic gravitational anomalies,\" JHEP 0601, 022\n(2006) [arXiv:hep-th/0508218].\n[10] S. Carlip, S. Deser, A. Waldron, D. K. Wise, \"Cosmological Topologically Massive\nGravitons and Photons,\" Class. Quant. Grav. 26, 075008 (2009). [arXiv:0803.3998\n[hep-th]];\nW. Li, W. Song, A. Strominger, \"Comment on 'Cosmological Topological Massive\nGravitons and Photons',\" [arXiv:0805.3101 [hep-th]].\nD. Grumiller, R. Jackiw, N. Johansson, \"Canonical analysis of cosmological\ntopologically massive gravity at the chiral point,\" [arXiv:0806.4185 [hep-th]].\nS. Carlip, S. Deser, A. Waldron, D. K. Wise, \"Topologically Massive AdS Gravity,\"\nPhys. Lett. B666, 272-276 (2008). [arXiv:0807.0486 [hep-th]].\nG. Giribet, M. Kleban, M. Porrati, \"Topologically Massive Gravity at the Chiral\nPoint is Not Chiral,\" JHEP 0810, 045 (2008). [arXiv:0807.4703 [hep-th]].\nA. Strominger, \"A Simple Proof of the Chiral Gravity Conjecture,\"\n[arXiv:0808.0506 [hep-th]].\n[11] D. Grumiller, N. Johansson, \"Instability in cosmological topologically massive\ngravity at the chiral point,\" JHEP 0807, 134 (2008). [arXiv:0805.2610 [hep-th]].\nD. Grumiller and N. Johansson, \"Consistent boundary conditions for cosmological\ntopologically massive gravity at the chiral point,\" Int. J. Mod. Phys. D 17, 2367\n(2009) [arXiv:0808.2575 [hep-th]].\n[12] D. Grumiller and I. Sachs, \"AdS (3) / LCFT (2) -¿ Correlators in Cosmological\nTopologically Massive Gravity,\" JHEP 1003, 012 (2010) [arXiv:0910.5241 [hep-th]].\n[13] K. Skenderis, M. Taylor, B. C. van Rees, \"Topologically Massive Gravity and the\nAdS/CFT Correspondence,\" JHEP 0909, 045 (2009). [arXiv:0906.4926 [hep-th]].\nK. Skenderis, M. Taylor, B. C. van Rees, \"AdS boundary conditions and the\nTopologically Massive Gravity/CFT correspondence,\" [arXiv:0909.5617 [hep-th]].\n[14] M. R. Gaberdiel, D. Grumiller and D. Vassilevich, \"Graviton 1-loop partition\nfunction for 3-dimensional massive gravity,\" JHEP 1011, 094 (2010)\n[arXiv:1007.5189 [hep-th]].\n[15] A. Campoleoni, S. Fredenhagen, S. Pfenninger, S. Theisen, \"Asymptotic\nsymmetries of three-dimensional gravity coupled to higher-spin fields,\" JHEP 1011,\n007 (2010). [arXiv:1008.4744 [hep-th]].\n\n– 17 –\n\n\f[16] A. Campoleoni, S. Fredenhagen and S. Pfenninger, \"Asymptotic W-symmetries in\nthree-dimensional higher-spin gauge theories,\" arXiv:1107.0290 [hep-th].\n[17] M. Henneaux, S. -J. Rey, \"Nonlinear Winf inity as Asymptotic Symmetry of\nThree-Dimensional Higher Spin Anti-de Sitter Gravity,\" JHEP 1012, 007 (2010).\n[arXiv:1008.4579 [hep-th]].\n[18] M. R. Gaberdiel, R. Gopakumar and A. Saha, \"Quantum W -symmetry in AdS3 ,\"\nJHEP 1102, 004 (2011) [arXiv:1009.6087 [hep-th]].\n[19] J. R. David, M. R. Gaberdiel and R. Gopakumar, \"The Heat Kernel on AdS(3) and\nits Applications,\" JHEP 1004, 125 (2010) [arXiv:0911.5085 [hep-th]].\n[20] M. R. Gaberdiel, R. Gopakumar, \"An AdS3 Dual for Minimal Model CFTs,\" Phys.\nRev. D83, 066007 (2011). [arXiv:1011.2986 [hep-th]].\n[21] A. Castro, A. Lepage-Jutier and A. Maloney, \"Higher Spin Theories in AdS(3) and\na Gravitational Exclusion Principle,\" JHEP 1101, 142 (2011) [arXiv:1012.0598\n[hep-th]].\n[22] M. R. Gaberdiel, T. Hartman, \"Symmetries of Holographic Minimal Models,\"\nJHEP 1105, 031 (2011). [arXiv:1101.2910 [hep-th]].\nC. Ahn, \"The Large N 't Hooft Limit of Coset Minimal Models,\" [arXiv:1106.0351\n[hep-th]].\nM. R. Gaberdiel, R. Gopakumar, T. Hartman, S. Raju, \"Partition Functions of\nHolographic Minimal Models,\" [arXiv:1106.1897 [hep-th]].\nM. R. Gaberdiel and C. Vollenweider, \"Minimal Model Holography for SO(2N),\"\narXiv:1106.2634 [hep-th].\nC. M. Chang and X. Yin, \"Higher Spin Gravity with Matter in AdS3 and Its CFT\nDual,\" arXiv:1106.2580 [hep-th].\n[23] A. Bagchi, S. Lal, A. Saha and B. Sahoo, \"Topologically Massive Higher Spin\nGravity,\" arXiv:1107.0915 [hep-th].\n[24] B. Chen, J. Long and J. b. Wu, \"Spin-3 Topological Massive Gravity,\"\narXiv:1106.5141 [hep-th].\n[25] A. B. Zamolodchikov, \"Infinite Additional Symmetries in Two-Dimensional\nConformal Quantum Field Theory,\" Theor. Math. Phys. 65, 1205-1213 (1985).\n\n– 18 –\n\n\f"}