{"id": "http://arxiv.org/abs/0712.4232v1", "guidislink": true, "updated": "2007-12-27T12:58:27Z", "updated_parsed": [2007, 12, 27, 12, 58, 27, 3, 361, 0], "published": "2007-12-27T12:58:27Z", "published_parsed": [2007, 12, 27, 12, 58, 27, 3, 361, 0], "title": "Dark matter from Modified Friedmann Dynamics", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0712.2196%2C0712.2066%2C0712.1441%2C0712.1838%2C0712.2923%2C0712.1904%2C0712.1815%2C0712.4228%2C0712.4316%2C0712.0029%2C0712.2165%2C0712.1173%2C0712.3348%2C0712.1662%2C0712.2359%2C0712.0951%2C0712.3397%2C0712.1970%2C0712.0248%2C0712.2657%2C0712.2116%2C0712.1851%2C0712.3273%2C0712.0795%2C0712.2658%2C0712.0417%2C0712.0677%2C0712.2146%2C0712.2671%2C0712.3424%2C0712.2303%2C0712.1571%2C0712.4278%2C0712.3035%2C0712.3828%2C0712.0970%2C0712.3131%2C0712.1505%2C0712.1669%2C0712.3289%2C0712.1462%2C0712.3857%2C0712.1738%2C0712.2250%2C0712.3844%2C0712.0191%2C0712.2203%2C0712.1083%2C0712.3199%2C0712.2067%2C0712.2386%2C0712.3228%2C0712.0597%2C0712.1840%2C0712.4113%2C0712.4140%2C0712.4357%2C0712.3001%2C0712.2618%2C0712.2314%2C0712.4204%2C0712.1276%2C0712.1337%2C0712.3893%2C0712.0295%2C0712.3060%2C0712.0628%2C0712.1357%2C0712.1622%2C0712.4094%2C0712.1708%2C0712.1998%2C0712.0221%2C0712.0978%2C0712.4090%2C0712.2709%2C0712.3597%2C0712.0975%2C0712.1330%2C0712.1354%2C0712.0033%2C0712.2544%2C0712.3238%2C0712.3492%2C0712.2297%2C0712.3329%2C0712.3304%2C0712.1027%2C0712.3489%2C0712.4232%2C0712.4227%2C0712.0659%2C0712.4039%2C0712.2322%2C0712.3978%2C0712.0311%2C0712.4111%2C0712.1859%2C0712.0691%2C0712.4193%2C0712.3790&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Dark matter from Modified Friedmann Dynamics"}, "summary": "The contemporary cosmic expansion is considered in the context of Modified\nFriedmann Dynamics (MOFD). We discuss some relativistic model exploring analogy\nto MOND modification of Newtonian dynamics. We argue that MOFD cosmologies can\nexplain fraction of dark matter in the accelerating Universe. We discuss some\nobservational constraints on possible evolutional MOFD scenarios of\ncosmological models coming from SN Ia distant supernovae. We show that Modified\nNewtonian Dynamics can be obtained as a Newtonian limit of more general\nrelativistic models with polytropic component of Equation of State. They\nconstitute a special subclass of generalized Cardassian models basing on\ngeneralization of the Raychaudhuri equation rather than on generalization of\nthe Friedmann first integral. We demonstrate that MOND cosmologies are\ncompatible with observed accelerated phase of expansion of current universe\nonly for high value of cosmological constant. The Bayesian framework of model\nselection favored this model over $\\Lambda$CDM model if $\\Omega_{m,o}$ is fixed\nbut this evidence is not significant. Moreover obtained from statistical\nanalysis value of the MOND characteristic $\\beta$ parameter is far from value\nrequired for explanation of the flat rotation curves of spiral galaxies.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0712.2196%2C0712.2066%2C0712.1441%2C0712.1838%2C0712.2923%2C0712.1904%2C0712.1815%2C0712.4228%2C0712.4316%2C0712.0029%2C0712.2165%2C0712.1173%2C0712.3348%2C0712.1662%2C0712.2359%2C0712.0951%2C0712.3397%2C0712.1970%2C0712.0248%2C0712.2657%2C0712.2116%2C0712.1851%2C0712.3273%2C0712.0795%2C0712.2658%2C0712.0417%2C0712.0677%2C0712.2146%2C0712.2671%2C0712.3424%2C0712.2303%2C0712.1571%2C0712.4278%2C0712.3035%2C0712.3828%2C0712.0970%2C0712.3131%2C0712.1505%2C0712.1669%2C0712.3289%2C0712.1462%2C0712.3857%2C0712.1738%2C0712.2250%2C0712.3844%2C0712.0191%2C0712.2203%2C0712.1083%2C0712.3199%2C0712.2067%2C0712.2386%2C0712.3228%2C0712.0597%2C0712.1840%2C0712.4113%2C0712.4140%2C0712.4357%2C0712.3001%2C0712.2618%2C0712.2314%2C0712.4204%2C0712.1276%2C0712.1337%2C0712.3893%2C0712.0295%2C0712.3060%2C0712.0628%2C0712.1357%2C0712.1622%2C0712.4094%2C0712.1708%2C0712.1998%2C0712.0221%2C0712.0978%2C0712.4090%2C0712.2709%2C0712.3597%2C0712.0975%2C0712.1330%2C0712.1354%2C0712.0033%2C0712.2544%2C0712.3238%2C0712.3492%2C0712.2297%2C0712.3329%2C0712.3304%2C0712.1027%2C0712.3489%2C0712.4232%2C0712.4227%2C0712.0659%2C0712.4039%2C0712.2322%2C0712.3978%2C0712.0311%2C0712.4111%2C0712.1859%2C0712.0691%2C0712.4193%2C0712.3790&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "The contemporary cosmic expansion is considered in the context of Modified\nFriedmann Dynamics (MOFD). We discuss some relativistic model exploring analogy\nto MOND modification of Newtonian dynamics. We argue that MOFD cosmologies can\nexplain fraction of dark matter in the accelerating Universe. We discuss some\nobservational constraints on possible evolutional MOFD scenarios of\ncosmological models coming from SN Ia distant supernovae. We show that Modified\nNewtonian Dynamics can be obtained as a Newtonian limit of more general\nrelativistic models with polytropic component of Equation of State. They\nconstitute a special subclass of generalized Cardassian models basing on\ngeneralization of the Raychaudhuri equation rather than on generalization of\nthe Friedmann first integral. We demonstrate that MOND cosmologies are\ncompatible with observed accelerated phase of expansion of current universe\nonly for high value of cosmological constant. The Bayesian framework of model\nselection favored this model over $\\Lambda$CDM model if $\\Omega_{m,o}$ is fixed\nbut this evidence is not significant. Moreover obtained from statistical\nanalysis value of the MOND characteristic $\\beta$ parameter is far from value\nrequired for explanation of the flat rotation curves of spiral galaxies."}, "authors": ["M. Szydlowski", "W. Godlowski", "J. Golbiak"], "author_detail": {"name": "J. Golbiak"}, "author": "J. Golbiak", "arxiv_comment": "submitt in proceedings \"Matter and Energy in the Universe: From\n  Nucleosynthesis to Cosmology\" 20-26 May 2007 XIX Rencontres de Blois", "links": [{"href": "http://arxiv.org/abs/0712.4232v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0712.4232v1", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0712.4232v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0712.4232v1", "journal_reference": null, "doi": null, "fulltext": "Dark matter from Modified Friedmann Dynamics\nMarek Szydlowski∗\nAstronomical Observatory, Jagiellonian University,\nOrla 171, 30-244 Kraków, Poland and\n\narXiv:0712.4232v1 [astro-ph] 27 Dec 2007\n\nComplex Systems Research Centre, Jagiellonian University\nReymonta 4, 31-059 Kraków, Poland\nWlodzimierz Godlowski†\nAstronomical Observatory, Jagiellonian University, Orla 171, 30-244 Kraków, Poland\nJacek Golbiak‡\nDepartment of Theoretical Physics, Catholic University of Lublin,\nAl. Raclawickie 14, 20-950 Lublin, Poland\n(Dated: November 25, 2018)\n\n1\n\n\fAbstract\nThe contemporary cosmic expansion is considered in the context of Modified Friedmann Dynamics (MOFD). We discuss some relativistic model exploring analogy to MOND modification\nof Newtonian dynamics. We argue that MOFD cosmologies can explain fraction of dark matter\nin the accelerating Universe. We discuss some observational constraints on possible evolutional\nMOFD scenarios of cosmological models coming from SN Ia distant supernovae. We show that\nModified Newtonian Dynamics can be obtained as a Newtonian limit of more general relativistic\nmodels. with polytropic component of Equation of State. They constitute a special subclass of\ngeneralized Cardassian models basing on generalization of the Raychaudhuri equation rather than\non generalization of the Friedmann first integral. We demonstrate that MOND cosmologies are\ncompatible with observed accelerated phase of expansion of current universe only for high value of\ncosmological constant. The Bayesian framework of model selection favored this model over ΛCDM\nmodel if Ωm,o is fixed but this evidence is not significant. Moreover obtained from statistical analysis value of the MOND characteristic β parameter is far from value required for explanation of\nthe flat rotation curves of spiral galaxies.\nPACS numbers: 98.80.Bp, 98.80.Cq, 11.25.-w\n\n∗\n†\n‡\n\nElectronic address: uoszydlo@cyf-kr.edu.pl\nElectronic address: godlow@oa.uj.edu.pl\nElectronic address: jgolbiak@kul.lublin.pl\n\n2\n\n\fI.\n\nINTRODUCTION\n\nThe idea that dark matter manifestation in flat rotation curves of spiral galaxies [3] is\na consequence of Modified Newtonian Dynamics (MOND) seems to be both intriguing and\ncontroversial how claims Lue and Starkman [1, 2]. In principle there is a simple way to\ntest this theory [3] by consideration observational consequences coming from cosmological\nmodels basing on these modifications of gravitational interactions at the late time. Of course\nthe MOND theory is Newtonian but it should be obtained as a limit of more general and\nfundamental theory (Modified General Relativity – MOGR). If we consider homogeneous\nand isotropic cosmology in this theory then the modified Friedmann equations will describe\nthe evolution of the Universe.\nRecently, different modifications of Friedmann equation were proposed [4]. Motivation\nof this model is to explain the current acceleration of the Universe [5, 6] without references\nto the unknown form of dark energy. In this scenario (called the Cardassian or polytropic\nexpansion) there is no dark energy component but the universe is matter dominated. It is\naccelerating due to the adding a certain additional term to Friedmann first integral of Einstein equations (with the Robertson-Walker symmetry). An important question is whether\nthere is any connections between the MOND driven cosmology and the Cardassian one.\nIn the paper by Lue and Starkman [1] it is presented interesting idea of derivation modified theory of gravity from constraint coming from the fundamental Birkhoff law. In this\napproach authors explain how the cosmic acceleration is generated through these modifications.\nIn this paper we incorporate MOND for the late time cosmological scenario, while early\nstages of evolution are dominated by usual matter described in a standard way by general\nrelativity. For simplicity (without losing the generality) we assume that our universe is flat.\nIn derivations of basic dynamical equations both for Newtonian and relativistic model we\nuse particle-like description [7]. In this approach the evolution of the universe is represented\nby a motion of a unit mass particle under the action of a one-dimensional potential V (a)\nwhich can be simply obtained from the MOND gravitational acceleration postulate. The\nposition variable a is a scale factor of the universe and all dynamics is determined by the\npotential function through the analog of Newtonian equations.\nThe Cardassian models base on the generalization of the Friedmann first integral by\n3\n\n\fadding in r.h.s. a term which is called the Cardassian term, i.e.,\nH2 =\n\nρ\nk\n+ Bρn − 2 ,\n3\na\n\n(1)\n\nwhere ρ is the energy density. If the source of gravity is a perfect fluid with pressure p = γρ\n(γ = const) then ρ = ρ0 (a/a0 )−3(1+γ) , a0 is a present value of the scale factor, k = 0, ±1 is\nthe curvature constant, H = (ln a) ̇ is the Hubble function. Note that equation (1) is the\nfirst integral of the generalized Einstein equation for the Robertson-Walker symmetry. The\nbasic equations constitute the system\nBρn\nρ\n,\nḢ = −H − (1 + 3γ) +\n6\n2\n2\n\n(2a)\n\nρ̇ = −3Hρ(1 + γ)\n\n(2b)\n\nwith the first integral in the form\n\u0012\n\nH\nH0\n\n\u00132\n\n= Ωγ,0\n\n\u0012\n\na\na0\n\n\u0013−3(1+γ)\n\n+ ΩCard,0\n\n\u0012\n\na\na0\n\n\u0013−3n(1+γ)\n\n+ Ωk,0\n\n\u0012\n\na\na0\n\n\u0013−2\n\n.\n\n(3)\n\nEquation (2a) is called the Raychaudhuri equation, while equation (2b) is the conservation\nequation. It seems to be more natural to generalize the Raychaudhuri equation instead\nof its first integral. In the last case we obtain a more general theory containing MOND\ncosmologies as a special case. If we consider the standard Cardassian models, then in the\nright-hand side of equation 3) only power low terms can of type aβ can appears while in the\nMOND cosmologies some part of potential is logarithmic type.\nOur basic idea is to explain the fraction of dark matter in the Universe in analogy to the\nMilgrom [3] explanation of flat rotation curves of spiral galaxies, i.e. in terms of the MOND\nconception rather than mysterious dark energy.\nThe organization of our paper is as follows. In section 2 we provide a brief summary of the\nfeatures of the Cardassian models and generalized Cardassian models that are relevant for\nour further discussion. The particle-like description of MOFD cosmologies and constraining\nmodel parameters in the light of SNIa data (based on the Riess sample) are presented in\nsection 3. Finally in section 4 some concluding remarks and perspectives for analysis of\ncosmology in the new MOFD (or MOGR) paradigm are formulated.\n\n4\n\n\fII.\n\nGENERALIZED CARDASSIAN MODELS AS A NATURAL GENERALIZA-\n\nTION OF FRW MODELS.\n\nBy the generalized FRW Cardassian models we understand models which dynamics is\ngoverned by the generalized Raychaudhuri equation and conservation condition\n\u0012\n\u0013\nä\nρ(a) 1\nf (ρ(a))\n=−\n+ γ(a) −\n,\na\n2\n3\n6\n\u0012 \u0013\nȧ\nρ̇ = −3\n(1 + γ(a))ρ(a),\na\n\n(4a)\n(4b)\n\nwhere a dot denotes differentiation with respect to the cosmological time t, f (ρ(a)) defines\nthe type of modification of the standard Raychaudhuri equation for FRW cosmology which\nholds for f = 0.\nSystem (4) has a first integral in the form\nρeff − 3\n\nȧ2\nk\n= 3 2,\n2\na\na\n\n(5)\n\nwhere ρeff (a) plays the role of effective energy density (see Appendix). Equation (5) is\nindependent (directly) on the special form of matter the Universe is filled with. In the\ngeneric case if we put into (4a) f (ρ) ∝ ρn and γ(a) like for a mixture of noninteracting\nmatter and radiation then the usual class of the Cardassian models is recovered. However\nlet us note that (5) with ρeff (a) = ρ(a) + 3Bρn does not play the role of the first integral\nin the special case when f (ρ)a ∝ a−1 . It is just the case of the MOND cosmologies. To\nillustrate this let us consider the simplest case of single fluid with energy density ρ and\nγ = const. Then from equation (4b) we obtain\n\u0012 \u0013−3(1+γ)\na\nρ = ρ0\na0\nor in term of density parameter Ωi,0 ≡ ρi,0 /3H02\n\u0012 \u0013−3(1+γ)\na\nΩi = Ωi,0\na0\nLet us substitute f (ρ) = 3Bρn . Hence (4a) assumes the form\n\u0012\n\u0012 \u0013−3n(1+γ)\n\u0013 \u0012 \u0013−3(1+γ)\nρ0 1\na\nρn0 B a\nä\n=−\n+γ\n−\na\n2 3\na0\n2\na0\nIt would be useful to consider in (8) two cases\nn 6=\n\n2\n3(1 + γ)\n\nor n =\n5\n\n2\n.\n3(1 + γ)\n\n(6)\n\n(7)\n\n(8)\n\n\fIn the first case we obtain a class of cosmologies called the Cardassian models. They can\nbe treated as standard cosmological models where the universe is filled with a mixture\nof non-interacting perfect fluids with the equation of state p = γρ for the first and p =\n[n(1 + γ) − 1]ρ = wρ for the second one. Therefore the Cardassian models with a single fluid\nhave dynamics in the form of a two-dimensional dynamical system\nẋ = y\nẏ = −\n\n(9)\n1\b\nΩγ,0 x−2−3γ (1 + 3γ) + ΩCard,0 x−2−3w (1 + 3w) ≡ −∂V /∂x,\n2\n\n(10)\n\nwhere Ωγ,0 = ργ,0 /3H02, ΩCard,0 = Bρnγ,0 /H02(1+3w), are density parameters of matter and the\nfictitious Cardassian fluid respectively, x = a/a0 is a dimensionless scale factor in the units\nof its present value a0 . A dot here denotes differentiation with respect to re-parameterized\ntime variable τ defined as t → τ : dt |H0 | = dτ . Of course Ωγ,0 +ΩCard,0 +Ωk,0 = 1 is satisfied.\nNote also that the potential function V is determined modulo to any additive constant.\nBecause n 6=\n\n2\n3(1+γ)\n\nsystem (10) possesses the first integral in the form\ny2\n+ V (x) ≡ 0,\n2\n\n(11)\n\nwhere V (x) = − 21 {Ωγ,0 x−1−3γ + ΩCard,0 x−1−3w + Ωk,0 } and the constant in V should be\nP\nP\nchosen such that i Ωi,0 = 1. The constraint condition i Ωi,0 = 1 in the general relativity\nreveals the fact that both matter and geometrical term are related. The fact that ΩCard,0\n\ndoes not contribute in this relation is a reflection of the fact that we are beyond the standard\ncosmology. Note that it can be estimated only from the observations.\nLet us comment now the second case of n = 2/3(1 + γ). Then the potential function\nassumes very special form with logarithmic component:\nV (x) = −\n\n1\b\nΩγ,0 x−1−3γ + ΩC,0 ln x + Ωk,0 + (1 − Ωγ,0 ) ,\n2\n\n(12)\n\nwhere Ωeff\nk,0 = Ωk,0 + (1 − Ωγ,0 ). Then if we substitute this form into the(11) we can obtain\nthe form of the first integral for this case (see Appendix). Note that both last two terms in\n(12) of the same type can be defined in one term which we called effective curvature density\nparameter. Usually the form of first integral (11) is treated as a starting point to further\nanalysis of the generalized Friedmann equation. In our opinion the generalization of FRW\nequations on the level of the Raychaudhuri equation seems to be methodologically more\n6\n\n\fcorrect procedure than generalization of its first integral. Moreover is more general because\none additional case is included.\nFinally the generalized Cardassian models in our terminology constitute larger class of\nmodels and both cases for which both n 6=\n\n2\n3(1+γ)\n\n2\n3(1+γ)\n\nand n =\n\nbelongs to this class. There\n\nare two parameters characterizing models of this class (n, Ωγ,0 ) if Ωk,0 = 0.\n\nIII.\n\nPARTICLE-LIKE DESCRIPTION OF MOND AND MOFD COSMOLOGIES.\n\nIn MOND the gravitational acceleration g exerted by a body of mass M at the radial\ndistance a obeys the relationship\ng∝\n\n\n −a−2\n\n −a−1\n\nfor\n\n|g| > g0\n\nfor\n\n|g| < g0\n\n(13)\n\nwhere g0 is a critical value of acceleration. Hence the potential of the gravitational field can\nbe simply calculated from the formula\nV (a) = −\n\n1\nM\n\nZ\n\na\n\ng(a)da ∝\n\n0\n\n\n −a−1\n ln a\n\nfor\n\n|g| > g0\n\nfor\n\n|g| < g0\n\n(14)\n\nAt first we can build the Newtonian (13) cosmological models basing on the particle-like\ndescription of quintessential cosmology developed by us earlier [7]. Following this approach\nthe dynamics of Newtonian cosmological models can be represented by a motion of the\nparticle-universe under the action of a one-dimensional potential V = V (a), a is a scale\nfactor of the universe plays the role of positional variable.\nThe heuristic method of obtaining Newtonian modified potential is basing on consideration Schwarzchild solution of relativistic model. We start from Newtonian model potential\nand then derive relativistic model. In the FRW cosmology the evolution of the universe can\nbe derived from the Hamiltonian which in terms of dimensionless variable takes the form\n1\nH = y 2 + V (x) ≡ 0,\n2\n\n(15)\n\nwhere x = a/a0 , y = ẋ and V (x) is in the form\nV (x) = −\n\n1\b\nΩγ,0 x−1−3γ + ΩMOND,0 ln x + (1 − Ωγ,0 ) .\n2\n7\n\n(16)\n\n\fThe last term (1−Ωγ,0 ) in (16) plays only the role of negative curvature term Ωeff\nk,0 = 1−Ωγ,0 .\nThe Hamiltonian is defined on zero energy level H = E = 0. The motion in the configuration\nspace is defined in the domain admissible for motion:\nD0 = {x : V (x) ≤ 0}\n\n(17)\n\nFrom (15) and (16) we obtain the counterpart of the Friedmann equation in our theory. Of\nP\ncourse if we substitute H = H0 and x = 1 then we recover i Ωi,0 = 1 as a constraint on\ndensity parameters from relation\n\n\b\n−2\nH 2 (x) = H02 Ωγ,0 x−3(1+γ) + ΩMOND,0 x−2 ln x + Ωeff\nk,0 x\n\n(18)\n\nor in the terms of redshift\n\b\n2\nH 2 (z) = H02 Ωγ,0 (1 + z)3(1+γ) − ΩMOND,0 (1 + z)2 ln (1 + z) + Ωeff\n.\nk,0 (1 + z)\n\n(19)\n\nBy comparing (18) with (12) we find strictly correspondence between a special second class\nof the Cardassian models with n =\n\n2\n3(1+γ)\n\nand MOND cosmologies.\n\nFrom the Newtonian analogue of the equation of motion ẍ = −∂V /∂x we find that\nẍ =\n\n1\b\nΩγ,0 (−1 − 3γ)x−2−3γ + ΩMOND,0 x−1\n2\n\n(20)\n\nThe universe is accelerating at the present epoch (x=1) if only\nΩMOND,0 > (1 + 3γ)Ωγ,0\n\n(21)\n\nTherefore for γ = 0 (dust) ΩMOND,0 > Ωm,0 is required if Ωeff\nk,0 = 0.\nThe values of model parameter (Ωm,0 , ΩMOND,0 ) can be obtained from the fitting procedure\nto SNIa data. The luminosity distance as a function of redshift is given in the form\nZ\ndz ′\n1+z z\np\ndL (z) =\n.\nH0 0\nΩm,0 (1 + z ′ )3 − ΩMOND,0 (1 + z ′ )2 ln (1 + z ′ ) + (1 − Ωm,0 )(1 + z ′ )2\n(22)\nIn the mentioned before paper by Lue and Starkman [1, 2] we find very interesting idea\nof the MOND law of gravitational interacting derived from the general relativity. The\nauthors assuming the validity of the Birkhoff theorem and derive the basic cosmological\nmodel equation in the form\n\n\u0013\n\u0012\n Ω + C Ω2/3\n2\nfor the Einstein regime Ωm > Ωc\nẋ\nρ\nH2\nm\n1 m\n=\n≡\n=\ng\n2/3\n βΩ2/3\nH02\nx2\nρcrit\nfor the MOND regime Ωm < Ωc\nm ln Ωm + C2 Ωm\n8\n\n(23)\n\n\fIn the Lue and Starkman [1, 2] model the evolution of the universe consists of two phases,\nthe first one dominated by gravity following the general relativity and the second one by\nits modification (MOGR). Our idea is little different because we assume that both effects\nare acting as different regimal effects but general relativity dominates at early stages of\nevolution while MOGR describes the late time evolution. The dependence of the Hubble\nfunction describes following formula\n\b\n−2\nH 2 (x) = H02 Ωm,0 x−3 + ΩMOND,0 x−2 ln x + Ωeff\n,\nk,0 x\n\n(24)\n\nwhere Ωeff\nk,0 is the effective curvature such that\n2/3\n\nΩeff\nk,0 = βΩm,0 ln Ωm,0 + Ωk,0 ,\n\n(25)\n\nΩeff\nk,0 = 1 − Ωm,0 ,\n\n(26)\n2/3\n\nΩMOND,0 = −3βΩm,0 .\n\n(27)\n\nFinally we obtain the same governing equation as (16) from the general relativistic considerations.\nThe dynamics of this model can be represented in the form of the autonomous dynamical\nsystem\n\n\n ẋ = y\n\n(28)\n\n ẏ = −∂V /∂x\n\nwhere\nV (x) = −\n\n1\b\nΩm,0 x−1 + ΩMOND,0 ln x + Ωeff\nk,0 .\n2\n\n(29)\n\nThe system (28) has the first integral in the form\n\nH = 21 y 2 + V (x) = 0\nFrom the first integral we obtain dL (z) relation\nZ\n1+z z\ndz ′\nq\n.\ndL (z) =\nH0 0\n′ )2\n(1\n+\nz\nΩm,0 (1 + z ′ )3 − ΩMOND,0 (1 + z ′ )2 ln (1 + z ′ ) + Ωeff\nk,0\n\n(30)\n\nThe parameter β can be expressed as a function of Ωm,0 . For example for dust matter γ = 0\nwe obtain constraint on β parameter\nβ=−\n\n1 − Ωm,0\n2/3\n\n3Ωm,0 ln Ωm,0\n9\n\n.\n\n(31)\n\n\fTABLE I: Results of the statistical analysis of the MOND model obtained from the best fit with\nminimum χ2 . F denotes fixed value of parameter.\nsample\nGold\n\nΩeff\nk,0 Ωm,0 ΩMOND,0 ΩΛ,0\n\nM\n\nχ2\n\nβ\n\n-0.88\n\n0.00\n\n-2.00 1.88 15.935 173.1\n\n∞\n\n--\n\n0.00\n\n-0.81 1.00 15.955 175.2\n\n∞\n\n-0.90 0.01F\n\n-2.00 1.89 15.935 173.1 14.36\n\n-- 0.01F\n\n-0.78 0.99 15.955 175.2 5.60\n\n-0.94 0.05F\n\n-1.95 1.89 15.935 173.1 4.78\n\n-- 0.05F\n\n-0.68 0.95 15.955 175.3 1.67\n\n-0.83 0.30F\n\n-1.19 1.53 15.955 173.8 0.88\n\n-- 0.30F\n\n-0.02 0.70 15.955 175.8 0.01\n\n0.00\n\n1.00\n\n1.80 -- 15.965 177.6 -0.60\n\n--\n\n1.00\n\n1.80 -- 15.965 177.6 -0.60\n\nIf we define zeq as a moment in the evolution of the universe at which both material and\nMOND terms are equal we obtain\nΩMOND,0 /Ωm,0 =\n\n1 + zeq\n,\nln (1 + zeq )\n\n(32)\n\n−1/3\n\nwhere ΩMOND,0 /Ωm,0 = −3βΩm,0 .\nThe results of our analysis are based on the Gold Riess Riess et al. [8]) supernovae Ia\nsample and there are presented in the table I. On can see that considered models well fited\nSNIa data. However MOND model required value of β ≃ 15 for possibility of explanation\nof flat rotation curve. We obtained such value of β only for the model with low Ωm,0 = 0.01\nand Ωeff\nk,0 = −0.9 (i.e Ωk,0 = −3.97. This value of Ωm,0 and Ωk,0 are in disagreement with\nboth results of CMBR and primordial nucleosynthesis.\n\nIV.\n\nMOFD MODEL VERSUS ΛCDM MODEL IN THE LIGHT OF BAYESIAN\n\nINFORMATION CRITERION.\n\nIn this section we extended previous model by adding dark energy in the form cosmological\nconstant or phantoms We show that the MOFD cosmologies can be obtained as a Newtonian\n10\n\n\flimit of class of Phantom models which base on a simple modification of the FRW equation.\nThe physical status of both MOFD and Phantom models is similar because they offer the\npossibility of alternative explanation of dark matter and dark energy, respectively. We\ninvestigate some observational constraints on the FRW cosmological models with baryonic\nmatter and MOFD phase squeezed in the evolutional scenario between the epoch of matter\ndomination and the dark energy epoch. We compare such a model with the concordance\nΛCDM model and argue that while both models are indistinguishable (close value of χ2 ) the\nAkaike and Bayesian informative criterions favors MOFD model with baryonic dark matter.\nWe consider two possible model with the exit on Λ epoch or on the phantom (Cardassian)\nepoch. For both cases the relations H(z) are (respectively):\nq\nH = H0 Ωm,0 (1 + z)3 + Ωkeff,0 (1 + z)2 − ΩMOND,0 (1 + z)2 ln(1 + z) + ΩΛ\n\n(33)\n\nand\nH = H0\n\nq\n\nΩm,0 (1 + z)3 + Ωkeff,0 (1 + z)2 − ΩMOND,0 (1 + z)2 ln(1 + z) + ΩP h,0 (1 + z)3n (34)\n\nwhere p = wρ, w < −1 for phantoms, n = 1 + w for Cardassian.\nTo compare considered models,how they fitted the data the informative criteria can be\nuseful [9]. The problem of classification of the cosmological models on the light of information\ncriteria on the base of the astronomical data was discussed in our previous papers [10, 11,\n12, 13].\nThe Akaike information criterion (AIC) is defined in the following way\nAIC = −2 ln L + 2d\n\n(35)\n\nwhere L is the maximum likelihood and d is the number of the model parameters. The best\nmodel with a parameter set providing the preferred fit to the data is that minimizes the\nAIC.\nThe Bayesian information criterion (BIC) introduced by Schwarz is defined as\nBIC = −2 ln L + d ln N\n\n(36)\n\nwhere N is the number of data points used in the fit.\nThis criterion gives a simple objective criterion for the inclusion of new parameters into\nthe standard ΛCDM model. From the results presented in the Tables II,IV we can draw the\nfollowing conclusion. The ΩM ON D is needed as a parameter and hence it is more likely that\nobservations were generated in MOFD.\n11\n\n\fcase name of model\n\n12\n\nH(z)\np\n0 Einstein-de Sitter\nH = H0 Ωm,0 (1 + z)3 + Ωk,0 (1 + z)2\np\n1 ΛCDM\nH = H0 Ωm,0 (1 + z)3 + Ωk,0 (1 + z)2 + ΩΛ\np\n2a MOND, Ωm,0 - fitted H = H0 Ωm,0 (1 + z)3 + Ωkeff,0 (1 + z)2 − ΩMOND,0 (1 + z)2 ln(1 + z) + ΩΛ\n\n2b MOND, Ωm,0 = 0.05\n\nTABLE II: The Hubble function versus redshift for analyzed scenarios.\n\nfree parameters\n\nd\n\nH0 , Ωm,0\n\n2\n\nH0 , Ωm,0 , ΩΛ\n\n3\n\nH0 , Ωm,0 , ΩMOND,0 , ΩΛ 4\nH0 , ΩMOND,0 , ΩΛ\n\n3\n\n\fcase AIC (1-Ωm,0 − ΩΛ,0 = 0) AIC (1-Ωm,0 − ΩΛ,0 6= 0) BIC (1-Ωm,0 − ΩΛ,0 = 0) BIC (1-Ωm,0 − ΩΛ,0 6= 0)\n\n13\n\n0\n\n325.5\n\n194.4\n\n328.6\n\n200.5\n\n1\n\n179.9\n\n179.9\n\n186.0\n\n189.0\n\n2a\n\n181.2\n\n181.1\n\n190.3\n\n193.4\n\n2b\n\n179.3\n\n179.1\n\n185.4\n\n188.3\n\nTABLE III: The values of AIC and BIC for distinguished models (Table II).\n\n\fV.\n\nCONCLUSIONS\n\nOur general conclusion is that MOND cosmology should be treated as a potential alternative to the ΛCDM model in the context of explanation of dark matter. To clarify the\nstatus of these model let us consider two sets of best-fitted (gold sample of SNIa, Riess et\nal. [8]) model parameters (see table I).\nOur point of view is following - because the ΛCDM model fits SNIa data as well as\nthe MOND alternative and additionally the second model explain dark matter content in\nterm of ΩMOND,0 the model under consideration should be treated as a possible candidate to\nexplain dark matter in the Universe. However in particular case for the flat universe with\nΩm,0 = 0.3, ΩΛ,0 = 0.7 we obtain ΩMOND,0 = −0.02, i.e. β = 0.01 while for the flat universe\nwith Ωm,0 = 0.05, ΩΛ,0 = 0.95 we obtain ΩMOND,0 = −0.68 i.e. β = 1.67. The first case\nis corresponding to the ΛCDM model while the second should be treated as an alternative\ndescription of acceleration driven by cosmological constant and dumping by baryonic matter\n(Ωm,0 = 0.05). Both models are indistinguishable-close values of χ2 (see table I) and as\nresult overlapping Hubble diagrams.\nOn can see that however considered models well fited SNIa data MOND model required\nvalue of β ≃ 15 for possibility of explanation of flat rotation curve. We obtained such value\nof β only for the model with Ωm,0 = 0.01 and Ωeff\nk,0 = −0.9 (i.e Ωk,0 = −3.97). This value\nof Ωm,0 and Ωk,0 are in disagreement both with result of CMBR and early nucleosynthesis.\nFinally we conclude that, the MOND conception explain only separately flat rotation curves\nof spiral galaxies or the fraction of dark matter in the Universe but it is not able to explain\nthese both facts together.\nIn this paper we also demonstrate that classical MOND conception can be derived from\nmore fundamental relativistic theory, namely from the generalized Cardassian model.\nThe main aim of the paper was to show that the existence of the MOND phase during\nthe evolution of the Universe, before the epoch of domination of dark energy can explain\nthe presence of dark matter in the Universe. In other words there are two indistinguishable\nscenario from the point of view of explanation of the SNIa data. On the other hand if\nwe á priori assume that Ωm,0 = 0.3 the observations exclude the cosmological model with\nthe squeezing MOND phase in the cosmological scenario (ΩMOND,0 ≃ 0). If we assume flat\nuniverse with the value of Ωm,0 ≃ 0.3 as it is suggested by extragalactic observations than we\n14\n\n\fobtain that ΩMOND,0 should be small, but not necessary equal to zero. In our approach we\ncheck whether the MOND phase frozen in the cosmological scenario according to Starkman's\nidea can give us understanding of the fraction of nonbarionic matter in Ωm,0 . We find that\nsuch a model well fit supernovae data but value of β is far from Lue and Starkman [2] value\nβ = 15\nThe second topic of this paper is the construction of the new class of cosmological models\nwith frozen the MOND phase into evolutional scenario with exit to the Cardassian models.\nAs it is well known the Cardassian models are an alternative to the cosmological models\nwith dark energy in the explanation of present acceleration of the current Universe. In these\nmodels instead of dark energy violating the strong energy condition is postulated a simple\nmodification of the Friedmann first integral. In this paper the model is fitted to observations\nof distant SNIa using the Riess sample. We obtain analogous results as in the case with\nthe exit to the dark energy epoch. The advantage of the model with frozen MOND phase\nand exit to the Cardassian models is twofold. First, it can explain the acceleration of the\nUniverse. Second, it can explain the fraction of the dark matter.\nThe other results can be summarized as follows. We propose the theoretical description of\ncosmology MOFD based on the modified gravity. We find the connection of such models with\nrecently discussed Cardassian models [20]. The parameter β characterizing the MOND phase\nis estimated. We also estimated this parameter for the model with exit to the Cardassian\nmodel. In this case we obtain the value of characteristic parameter β which is far to the\nvalue assumed by Starkman (β = 15). The value of Cardassian exponent in the term ρn\nin the modified Friedmann equation is close to zero. This situation is very close the model\nwith the cosmological constant but nevertheless n is negative and nonzero.\nIn this paper we pay attention to the flat cosmological models. It would useful to make\nsome remarks on the non-flat cosmological models. In the models with exit to Λ epoch we\n2\nestimate the curvature type term Ωeff\nk,0 . From the χ analysis we obtain that non-flat case is\n\nmore preferable than its flat counterpart. The similar dependence of dL (z) on the Hubble\ndiagram is obtained for fitting the model with the exit to the Cardassian domination epoch\nwith the SNIa data (without any prior on n)\nHowever MOFD cosmologies are compatible with observed late-time accelerated expansion of contemporary universe. The popular method of apriorical generalization of Friedmann equation is adding polytropic component of r.h.s. of H 2 relation i.e. generalization\n15\n\n\fFriedmann first equation. Our proposal is generalization Raychaudhuri equation rather\nthen Friedmann. Then we obtain previous generalization plus one exceptional case which is\nstrictly related with main subject of the paper.\nhowever we still share the opinion expressed by Sahni that there is the fundamental difficulty of MOND gravity because this theory is not embedded within a more comprehensive\nand fundamental theory of gravitation. We also do not know the Lagrangian for the Cardassian modification of gravity but these models can be treated as a simple modification of\nthe cosmological models with FRW symmetry.\n\nVI.\n\nACKNOWLEDGMENTS\n\nThe work of M.S. was supported by project \"COCOS\" No. MTKD-CT-2004-517186.\n\nVII.\n\nAPPENDIX\n\nIn this section we demonstrate how the presence of additional term in the Raychaudhuri\nequation can be modeled by some noninteracting fictitious fluid X with energy density ρX (a)\nand pressure pX (a). We start from the basic equations\nä\n1\nB\n= − (ρ + 3p) + am ,\na\n6\n6\n\n(37a)\n\nρ̇ = −3H(ρ + p).\n\n(37b)\n\nIf we postulate that\nB\n1\n− (ρX + 3pX ) = am\n6\n6\nthen (37) can be rewritten to the form\nä\n1X\n(ρk + 3pk ),\n=−\na\n6 i,X\n\n(38)\n\n(39)\n\nwhere the summation should be performed over all components of fluid. For any i fluid\nconservation equation is satisfied\nρ̇i = −3H(ρi + pi ).\n\n(40)\n\nOf course analogical condition should be satisfied by the fluid X, i.e\n3\ndρX\n= − (ρX + pX ).\nda\na\n16\n\n(41)\n\n\fFrom (38) we calculate pX and then we substitute this expression into (41). Hence we obtain\n1\nB\npX = − ρX − am\n3\n3\n\n(42)\n\ndρX (a)\n2\nB\n= − ρX (a) + am .\nda\na\na\n\n(43)\n\nand\n\nAs a solution of (43) we obtain\nρX (a) =\n\n\n\n\n\npX (a) =\n\n\n−\n\nC\na2\n\n+\n\nB\nam\nm+2\n\nC\na2\n\n+\n\nB\na2\n\nC\n3a2\n\n−\n\nB m+3 m\na\n3 m+2\n\n − C+B\n−\n3a2\n\nfor m 6= −2\n\nln a for m = −2\n\nB\n3a2\n\nfor m 6= −2\n\nln a for m = −2\n\n(44)\n\n(45)\n\nOf course system (37) has the first integral in the form\nρeff − 3\n\nX\nȧ2\nȧ2\nk\n=\n3\n=\n(ρ\n+\nρ\n)\n−\n3\n,\ni\nX\na2\na2\na2\ni\n\n(46)\n\nwhere\nρ̇i = −3H(ρi + pi )\nfor any i-fluid,\n\nP\n\ni\n\n(47)\n\nρi = ρ and also ρeff = −3H(ρeff + peff ). The first integral (46) has different\n\nform for both distinguished cases\nB\nk\nȧ2\nC\nm\n+\na\n−\n3\n=\n3\n,\na2 m + 2\na2\na2\nC\nB\nȧ\nk\nρ + 2 + 2 ln a − 3 2 = 3 2 ,\na\na\na\na\n\nρ+\n\nfor m 6= −2\n\n(48a)\n\nfor m = −2\n\n(48b)\n\nWe require the correspondence with standard FRW model for the case B = 0. Hence we\nobtain C = 0. Finally the potential functions for both cases takes the following form\n\n − 1 (ρ + B am )a2 for m 6= −2\n6\nm+2\nV (a) =\n(49)\n1\n − (ρ + B2 ln a)a2 for m = −2\n6\n\na\n\nOf course the Hamiltonian system is still determined on the energy level E = −k/2 (H =\nȧ2 /2 + V (a) ≡ E).\n\n[1] A. Lue, R. Scoccimarro, and G. Starkman, Phys. Rev. D69, 044005 (2004), astro-ph/0307034.\n\n17\n\n\f[2] A. Lue and G. D. Starkman, Phys. Rev. Lett. 92, 131102 (2004), astro-ph/0310005.\n[3] M. Milgrom, Astrophys. J. 270, 365 (1983).\n[4] K. Freese and M. Lewis, Phys. Lett. B540, 1 (2002), astro-ph/0201229.\n[5] S. Perlmutter et al. (Supernova Cosmology Project), Astrophys. J. 517, 565 (1999), astroph/9812133.\n[6] A. G. Riess et al. (Supernova Search Team), Astron. J. 116, 1009 (1998), astro-ph/9805201.\n[7] M. Szydlowski and W. Czaja, Phys. Rev. D69, 083518 (2004), gr-qc/0305033.\n[8] A. G. Riess et al. (Supernova Search Team), Astrophys. J. 607, 665 (2004), astro-ph/0402512.\n[9] A. R. Liddle, Mon. Not. Roy. Astron. Soc. 351 (2004) L49.\n[10] W. Godlowski, M. Szydlowski, Phys. Lett. B 623 (2005) 10.\n[11] M. Szydlowski, W. Godlowski, Phys. Lett. B 633 (2006) 427.\n[12] M. Szydlowski, W. Godlowski, Phys. Lett. B 639 (2006) 5.\n[13] M. Szydlowski, A. Kurek, A. Krawiec, Phys.Lett. B 642 (2006) 171.\n[14] H. Akaike, IEEE Trans. Auto. Control 19 (1974) 716.\n[15] G. Schwarz, Annals of Statistics 5 (1978) 461.\n[16] C. L. Bennett, et al., Astrophys. J. Suppl. 148 (2003) 1.\n[17] H. Jeffreys, Theory of Probability, 3rd Edition, Oxford University Press, Oxford, 1961.\n[18] S. Mukherjee, E. D. Feigelson, G. J. Babu, F. Murtagh, C. Fraley, A. Raftery, Astrophys. J.\n508 (1998) 314.\n[19] P. J. E. Peebles, B. Ratra, Rev. Mod. Phys. 75 (2003) 559.\n[20] W. Godlowski, M. Szydowski, A. Krawiec, APJ 605 (2004) 599.\n\n18\n\n\f"}