{"id": "http://arxiv.org/abs/0910.3878v1", "guidislink": true, "updated": "2009-10-20T15:33:42Z", "updated_parsed": [2009, 10, 20, 15, 33, 42, 1, 293, 0], "published": "2009-10-20T15:33:42Z", "published_parsed": [2009, 10, 20, 15, 33, 42, 1, 293, 0], "title": "Multi-grid HMC for Ginsparg-Wilson fermions", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0910.5952%2C0910.2043%2C0910.2036%2C0910.3616%2C0910.1316%2C0910.1169%2C0910.3082%2C0910.2711%2C0910.4236%2C0910.3434%2C0910.1699%2C0910.1351%2C0910.3298%2C0910.3450%2C0910.5463%2C0910.5504%2C0910.3891%2C0910.5744%2C0910.5392%2C0910.1998%2C0910.0847%2C0910.3895%2C0910.2527%2C0910.1176%2C0910.5675%2C0910.5281%2C0910.5230%2C0910.3496%2C0910.4617%2C0910.4805%2C0910.5391%2C0910.3661%2C0910.4304%2C0910.5559%2C0910.5572%2C0910.1206%2C0910.2618%2C0910.1377%2C0910.1857%2C0910.0476%2C0910.3751%2C0910.2290%2C0910.4968%2C0910.1128%2C0910.3878%2C0910.5736%2C0910.1486%2C0910.4205%2C0910.3095%2C0910.5446%2C0910.2287%2C0910.3981%2C0910.3538%2C0910.1766%2C0910.4575%2C0910.1425%2C0910.3425%2C0910.4307%2C0910.3220%2C0910.3422%2C0910.0750%2C0910.1834%2C0910.5279%2C0910.1680%2C0910.5157%2C0910.2215%2C0910.4240%2C0910.0792%2C0910.0295%2C0910.1674%2C0910.3883%2C0910.5730%2C0910.5861%2C0910.1689%2C0910.5856%2C0910.4159%2C0910.2580%2C0910.5382%2C0910.2122%2C0910.5598%2C0910.0660%2C0910.5771%2C0910.1400%2C0910.0743%2C0910.1222%2C0910.2617%2C0910.3183%2C0910.4117%2C0910.4279%2C0910.4148%2C0910.5180%2C0910.3915%2C0910.3233%2C0910.3146%2C0910.5786%2C0910.0914%2C0910.5758%2C0910.2120%2C0910.1356%2C0910.3984%2C0910.0693&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Multi-grid HMC for Ginsparg-Wilson fermions"}, "summary": "I describe a method that places the fermion fields and the gauge fields on\ndifferent lattice spacings during the Hybrid Monte Carlo generation of\nGinsparg-Wilson dynamical ensembles. The idea is motivated by Wilson's\nformulation of the renormalisation group. After outlining the underlying\ntheory, I describe a method to perform most of the work of the HMC on a coarse\nlattice, only requiring to convert to and from the fine lattice once for each\nindependent configuration. Because the bulk of the work takes place on the\ncoarse lattice, including the calculation of most observables, this method\nsaves over an order of magnitude in computer time over previous methods.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0910.5952%2C0910.2043%2C0910.2036%2C0910.3616%2C0910.1316%2C0910.1169%2C0910.3082%2C0910.2711%2C0910.4236%2C0910.3434%2C0910.1699%2C0910.1351%2C0910.3298%2C0910.3450%2C0910.5463%2C0910.5504%2C0910.3891%2C0910.5744%2C0910.5392%2C0910.1998%2C0910.0847%2C0910.3895%2C0910.2527%2C0910.1176%2C0910.5675%2C0910.5281%2C0910.5230%2C0910.3496%2C0910.4617%2C0910.4805%2C0910.5391%2C0910.3661%2C0910.4304%2C0910.5559%2C0910.5572%2C0910.1206%2C0910.2618%2C0910.1377%2C0910.1857%2C0910.0476%2C0910.3751%2C0910.2290%2C0910.4968%2C0910.1128%2C0910.3878%2C0910.5736%2C0910.1486%2C0910.4205%2C0910.3095%2C0910.5446%2C0910.2287%2C0910.3981%2C0910.3538%2C0910.1766%2C0910.4575%2C0910.1425%2C0910.3425%2C0910.4307%2C0910.3220%2C0910.3422%2C0910.0750%2C0910.1834%2C0910.5279%2C0910.1680%2C0910.5157%2C0910.2215%2C0910.4240%2C0910.0792%2C0910.0295%2C0910.1674%2C0910.3883%2C0910.5730%2C0910.5861%2C0910.1689%2C0910.5856%2C0910.4159%2C0910.2580%2C0910.5382%2C0910.2122%2C0910.5598%2C0910.0660%2C0910.5771%2C0910.1400%2C0910.0743%2C0910.1222%2C0910.2617%2C0910.3183%2C0910.4117%2C0910.4279%2C0910.4148%2C0910.5180%2C0910.3915%2C0910.3233%2C0910.3146%2C0910.5786%2C0910.0914%2C0910.5758%2C0910.2120%2C0910.1356%2C0910.3984%2C0910.0693&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "I describe a method that places the fermion fields and the gauge fields on\ndifferent lattice spacings during the Hybrid Monte Carlo generation of\nGinsparg-Wilson dynamical ensembles. The idea is motivated by Wilson's\nformulation of the renormalisation group. After outlining the underlying\ntheory, I describe a method to perform most of the work of the HMC on a coarse\nlattice, only requiring to convert to and from the fine lattice once for each\nindependent configuration. Because the bulk of the work takes place on the\ncoarse lattice, including the calculation of most observables, this method\nsaves over an order of magnitude in computer time over previous methods."}, "authors": ["Nigel Cundy"], "author_detail": {"name": "Nigel Cundy"}, "author": "Nigel Cundy", "arxiv_comment": "7 pages, LAT2009(Algorithms)", "links": [{"href": "http://arxiv.org/abs/0910.3878v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0910.3878v1", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "hep-lat", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "hep-lat", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0910.3878v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0910.3878v1", "journal_reference": "PoS LAT2009:030,2009", "doi": null, "fulltext": "arXiv:0910.3878v1 [hep-lat] 20 Oct 2009\n\nMulti-grid HMC for Ginsparg-Wilson fermions\n\nNigel Cundy∗\nUniversität Regensburg, Universität Strasse 31, 93040 Regensburg, Germany\nE-mail: nigel.cundy@physik.uni-regensburg.de\n\nI describe a method that places the fermion fields and the gauge fields on different lattice spacings\nduring the Hybrid Monte Carlo generation of Ginsparg-Wilson dynamical ensembles. The idea is\nmotivated by Wilson's formulation of the renormalisation group. After outlining the underlying\ntheory, I describe a method to perform most of the work of the HMC on a coarse lattice, only\nrequiring to convert to and from the fine lattice once for each independent configuration. Because\nthe bulk of the work takes place on the coarse lattice, including the calculation of most observables, this method saves over an order of magnitude in computer time over previous methods.\n\nThe XXVII International Symposium on Lattice Field Theory\nJuly 26-31, 2009\nPeking University, Beijing, China\n∗ Speaker.\n\nc Copyright owned by the author(s) under the terms of the Creative Commons Attribution-NonCommercial-ShareAlike Licence.\n\nhttp://pos.sissa.it/\n\n\fMilti-grid HMC\n\nNigel Cundy\n\n1. Introduction\nOverlap fermions [1] are unquestionably the theoretically cleanest formulation of lattice QCD,\nbecause they alone exactly fulfil the Ginsparg-Wilson relation [2] and satisfy an exact chiral symmetry on the lattice [3]. However, they are also unquestionably the most expensive formulation.\nIn [4], I explored the possibility that the lattice overlap Dirac operator is connected to the\ncontinuum by a block renormalisation group transformation; this was motivated by consideration\nof their obedience to the renormalisation group derived Ginsparg-Wilson relation. The construction contained within that paper was incomplete, because it did not address how to construct the\nYang-Mills action in a similar way. I will finish this work in a future paper by using a coordinate\ntransformation of the gauge fields, and I briefly outline the method in section 2.3 of this work. Once\nthe suitable transformation is constructed, and the correct form of the Yang-Mills action found, then\nit will be possible to transfer from one lattice spacing to another, including the continuum, through\nthe renormalisation group.\nThis opens up the possibility of running lattice simulations at two length scales: a fine lattice\nfor the gauge fields, and a coarse lattice for the fermions. The connection between the coarse lattice\nand an equivalent action on the fine lattice will be provided by renormalisation. The advantages of\nthis approach are obvious: if we use a scale factor of s between the fine and coarse lattices, then we\nsave at least a factor of s4 in computer time for the expensive parts of the calculation. However, the\nphysics would be identical on the coarse lattice and the fine lattice, which itself can be extracted\nif necessary at an additional cost, but will only be required for certain observables which require\na finer resolution (for example in studies using heavy quarks). The challenge is linking the coarse\naction with a fine action. One possibility is re-weighting, but the re-weighting coefficients will be\n6\nof order eα6 a V +... (the leading order a4V term can be absorbed into the Yang-Mills action), which\nare likely to be unstable at larger volumes without fine tuning of α6 and the terms hidden by the\nellipsis. A better approach is to find some method of interpolating between the coarse action and\nthe fine action; and here I will present one possible way of doing this.\nThese proceedings are intended only as a very preliminary description of the proposed method.\nA full proof of the method's validity, numerical results, and a discussion of whether this is indeed\nbeneficial will follow in a subsequent paper. In section 2, I outline the underlying renormalisation\ngroup theory. In section 3, I outline the proposed Monte-Carlo routine; In section 4, I describe the\nnumerical implementation which I will use in my tests, and, in section 5, I conclude.\n\n2. Renormalisation group and overlap fermions\n2.1 Gauge Action\nThe multi-grid HMC algorithm presented in section 3 requires that the action is written entirely\nin terms of the Dirac operator (I shall justify this statement in the follow-up paper). This includes\nthe Yang-Mills term. I note that in the continuum, if D = γμ (∂μ − Aμ ), then\n1\n−iσμν Fμν = (γ5 D)2 − TrS (γ5 D)2 ,\n4\n2\n\n(2.1)\n\n\fMilti-grid HMC\n\nNigel Cundy\n\nwhere the trace is only over the spinor indices. Therefore, the Yang-Mills action can be written as\nSg =\n\nβ\nβ\n1\n2\nTrFμν\n= Tr[(γ5 D)4 ] − Tr[(γ5 D)2 TrS [(γ5 D)2 ]].\n4\n4\n4\n\n(2.2)\n\nThis can obviously and easily be extended to any lattice formulation of the Dirac operator, although\nfor any Dirac operator which is not ultra local, including the overlap, the numerical implementation\nrequires a stochastic estimate, either following the method proposed in [5], or by using a Gaussian\nheat-bath and a rational approximation of the exponential. The idea of using the trace of a function\nof the Dirac operator to simulate the gauge action was first proposed in [6].\n2.2 Renormalisation of fermion fields\nA block renormalisation group transformation of the fermion fields can be defined in terms of\n−1\nblocking matrices B−1 and B (which must be functions of the gauge fields) and α (which must\nbe independent of the gauge fields)\nZ0 =\n\nN f −1 Z\n\n∏\n\nZ\n\ndU\n\nj=0\n\nZ\n\nZ1 =\n\n( j)\n\nN f −1 Z\n\n∏\n\n( j)\n\nZ\n\ndU\n\nj=0\n\n( j)\n\nN f −1\n\nd ψ1 d ψ 1 e− ∑i=0\n( j)\n\nN f −1\n\nd ψ0 d ψ 0 e−Sg [U]−∑i=0\n(i)\n\n(i)\n\n(i)\n\n(i)\n\n(i)\n\n×\n\n(i)\n\n(i)\n\n(ψ 1 −ψ 0 (B )−1 )α (ψ1 −(B(i) )−1 ψ0 )\nN f −1\n\nd ψ1 d ψ 1 e−Sg [U]−∑i=0\n( j)\n\n(i)\n\nψ 0 D0 ψ 0\n\n( j)\n\n′\n\n(i)\n\n(i)\n\n∝\n\n(i)\n\nψ 1 D1 ψ1 +J\n\n(2.3)\n\nFor simplicity, I will subsequently suppress the flavour indices i and j. For α = ∞, we may write\nBD0 B =D1\n\nψ 1 =ψ 0 B\n\nJ =Tr[log D1 − log D0 ]\n−1\n\nψ1 =B−1 ψ0 .\n\n(2.4)\n\nA possible choice of blocking is\nB\n\n−1\n\n−1/2\n\n=(D1 )1/2 D0\n\n−1/2\n\nB−1 =D0\n\n;\n\n(D1 )1/2 ,\n\n(2.5)\n\nwhich leads, if D1 is the lattice overlap operator and D0 the continuum Dirac operator, to the\nGinsparg-Wilson relations,\n\nγL D1 + D1 γR = 0,\n\n(2.6)\n\nwith\n\nγL,R = γ5\n\nD† D1\n1− 1\n4\n\n!1/2\n\n± γ5 (D1 − D†1 )\n\nD† D1\n1− 1\n4\n\n!−1/2\n\n,\n\n(2.7)\n\nand an associated C P-symmetric lattice chiral symmetry.\nIn [4], I introduced a parameter ζ to control the 'latticeness' of the fermion fields. The Dirac\noperator D1 was re-written in terms of the exponentials, ζ 4 e−ζ ∑μ |xμ −nμ | , where n is a lattice site and\nx a position in the continuum, so that as ζ → ∞ these exponentials become Dirac δ -functions and\n3\n\n\fMilti-grid HMC\n\nNigel Cundy\n\na lattice theory is reproduced. While it is difficult to visualise the theory at the target of ζ = ∞, at\nfinite ζ everything remains well-defined. I showed that, for overlap fermions, the blocking remains\nvalid as the limit ζ → ∞ is taken. A full discussion and proof can be found in [4].\nIn this work, I consider a similar blocking from a fine lattice overlap operator, D0 , to a coarse\nlattice overlap operator, D1 , each with an underlying fine gauge field U0 and U1 respectively. I write\nthe blocking, the Dirac operator, gauge fields and fermion fields in terms of a parameter ξ , which I\nshall use to interpolate from the coarse lattice to the fine lattice. We may write\nDξ = B† [Uξ , ξ ]D0 [Uξ ]B[Uξ , ξ ]\n\n(2.8)\n\nAt ξ = 0, B = 1 and D remains the original fine Dirac operator; at ξ = 1 Dξ is equivalent to a\ncoarse Dirac operator. The fermion field transformation may be written as\n1\n\nψξ =e 2\n\nRξ d\n′\n0 d ξ ′ log[Dξ ′ ]d ξ\n\n− 12\n\nψ0 ;\n\nψ ξ =ψ 0 e\n\nR0 d\n′\nξ d ξ ′ log[Dξ ′ ]d ξ\n\n;\n\n(2.9)\n\nand an infinitesimal blocking is\nd\n1\nψξ +δ ξ = ψξ + δ ξ\nlog[Dξ [Uξ , ξ ]]ψξ .\n2 dξ\n\n(2.10)\n\nThus the Jacobian for this infinitesimal change in the fermion fields together with the change in the\ngauge action is\n\u0003\nd \u0002\n(2.11)\nSξ [D] ,\nlog det J − δ [Sg ] = Trδ ξ\ndξ\n\nwhere Sξ [D] = log[Dξ ] − Sg [Dξ ]\n2.3 Gauge field flows\n\nWe may define a differential with respect to the gauge fields as\n(\na\nd\neitT Ux,μ x = y, μ = ν\na\n∂x,μ f (U ) = lim a f (Ut;x,μ ;y,ν );\nUt;x,μ ;y,ν =\nt→0 dt\nUx,μ\notherwise\n\n(2.12)\n\nFor a gauge field transformation given by,\nd\nU\n= iΠξ ,x,μ [Uξ , ξ ]Uξ ,x,μ ,\nd ξ ξ ,x,μ\n\n(2.13)\n\nthe Jacobian, JU , of the infinitesimal transformation satisfies [7]\nTr log JU = iδ ξ ∂x,a μ (Πξ ,x,μ [Uξ , ξ ]).\n\n(2.14)\n\nThus, the solution to the equation\nTr[i∂x,a μ (Πax,μ ) + i∂x,a μ (S)Πax,μ + ∂ξ S] = Cξ ,\n\n(2.15)\n\nwhere ∂ξ excludes the dependence on ξ within the gauge fields, and Cξ is independent of the gauge\nfields, completes the renormalisation group link between D0 and D1 (and equally the renormalisation group construction of the overlap action). It can be shown that a solution for Zξ exists for\nall ξ as long as S and ∂ξ S are analytic, and integrating over this solution will give the required\ntransformation of the gauge fields. Finding this solution is rather more problematic. However, it\nis possible to map from the coarse gauge field to the fine gauge field stochastically, and for an\nimportance sampling method, that is good enough.\n4\n\n\fMilti-grid HMC\n\nNigel Cundy\n\n3. Multi-grid HMC\nThe detailed balance equation reads,\nP[U00 ← U01 ]WC [0,U01 ] = P[U01 ← U00 ]WC [0,U00 ] = P[U01 ← U11 ]P[U11 ← U10 ]P[U10 ← U00 ]WC [0,U01 ],\n(3.1)\nwhere, in Uξτ , the subscript refers to ξ and the superscript to Monte-Carlo time and\nNf\n\nWC [ξ ,Uξ ] = ∏ det[Di [ξ ]]e−Sg [ξ ] .\n\n(3.2)\n\ni=1\n\nIf each of the three steps satisfies detailed balance, then it is clear that the complete update of the\ngauge field satisfies detailed balance. For the transfer from the fine to the coarse lattice, I introduce\n2\nthe momentum field Π according to the Gaussian distribution e−(Π+Aξ ) , where\nAξ = (∂x,a μ (S))−1 (∂ξ S)x,μ .\n\n(3.3)\n\nThis requires that (∂x,a μ (S)) is invertible (I shall leave the proof until the later work), and that the\nDirac operator is constructed so that Aξ is independent of the gauge and pseudo-fermion fields at\nξ = 0 and ξ = 1. We then proceed by integrating along the equations of motion using a reversible,\narea conserving procedure, such as the Omelyn integrator, along a trajectory T ,\nd\nd\nΠ =∂x,a μ S[Dξ ] −\nA ,\ndξ\ndξ ξ\n\nd\nU =i(Π + Aξ )U ;\ndξ\n\n(3.4)\n\nwhich conserves E = (Πξ + Aξ )2 + TrS[Dξ ]. Π now is a conjugate field and does not depend on the\ngauge field. The Jacobian from the gauge field update cancels the Jacobian from the momentum\nupdate. Reversibility can be maintained using an iterative procedure. I estimate the trace using\npseudo-fermions generated according to a heatbath and a rational approximation R[Dξ ] ∼ eS[Dξ ]\nR\n†\nobtained using the Remez algorithm, so that d φ d φ † e−φ Rφ = det R−1 = e−TrS[D] . The detailed\nbalance equation for the transformation from [U1 ] to [U0 ] reads (if the integration is exact)\nP[U0 ← U1 ]WC [U1 ] =\n=\n\nZ\n\nZ\n\ndΠ1 dU1\n\nZ\n\nd φ d φ † e− 2 (Π1 +A1 ) e−φ\n1\n\n2\n\ndΠ0 dU0 d φ d φ † e− 2 (Π0 +A0 ) e−φ\n1\n\n2\n\n=P[U1 ← U0 ]WC [U0 ].\n\n† R[D\n\n† R[D\n\nξ ]φ\n\nξ ]φ\n\nδ ([U0 , Π0 ] − T [U1 , Π1 ])\n\nδ ([U1 , Π1 ] − T −1 [U0 , Π0 ])\n(3.5)\n\nWe can correct for the error from the numerical integration either by re-weighting or an extrapolation in the integration step-size. Similarly, the integration from U0 to U1 can be shown to satisfy\ndetailed balance, although for practical purposes this step will not be required, because each coarse\nconfiguration can be generated from the same thermalised fine configuration.\nWe run enough coarse trajectories to gain an independent configuration, and, if required, generate a fine configuration using the procedure above. For many quantities, the gauge field associated with the fine Dirac operator will not be needed: calculations can proceed with the coarse\nDirac operator and non-perturbative renormalisation will take care of the rest. Only if the finer\nlattice resolution is needed for a particular observable will it be necessary to perform the costly\nconversion to the fine lattice and the equally costly calculation of the observable.\n5\n\n\fMilti-grid HMC\n\nNigel Cundy\n\n4. Numerical implementation\nThe initial kernel operator, K0 , is defined as a Wilson operator on the fine gauge field:\n!\n\u0003\n\u0002\n1\n†\n(K0 )x,x′ = γ5\n−\n(1 − γμ )δx+μ̂ ,x′ Uμ (x) + (1 + γμ )δx−μ̂ ,x′ Uμ (x − μ̂ ) .\nκ ∑\nμ\n\n(4.1)\n\nUsing a scale factor of three, I define a blocking operator, BiK for the kernel in terms of the parameter\nξ and additional parameters CLi (which can be tuned to minimize the force and ensure stability when\nconstructing the fine gauge),\n(BiK )y,y′ [ξ ] = ∑ ∑ ULyy′ [(1 − ξ 2 )2 δyy′ +(1 − (1 − ξ 2 )2 )δyn ]CLi yy′\nn Lyy′\n\n∏θ\nβ\n\n\u0012\n\n\u0013 \u0012\n\u0013\n3\n3\n′\n− |yβ − nβ | θ\n− |yβ − nβ | ,\n2\n2\n\n(4.2)\n\nwhere nμ ∈ 1, 4, 7, . . ., Lxn a path of links between x and n (constrained within the hypercube), and\nUL the corresponding path ordered product of links. For a coarse kernel operator K1 = (B0K )† K0 B0K\nthe Fourier transform (in the free theory) takes the form iγμ sin(pμ + (1− cos(pμ ))+ ι iγμ sin(3pμ +\n(1 − cos(3pμ )) + m for some ι . For ι ≥ 1 this introduces fermion doublers. I have chosen to avoid\nthese doublers by including a second term with different coefficients, so that\nKξ = (B0K )† K0 B0K − α (B1K )† K0 B1K + β (B0K )† B0K − β ′ (B1K )† B1K − γ (1 − (1 − ξ 2)2 )(1 − δx,n δn,x′ ),\n(4.3)\nwhere the parameters α , β , β ′ and γ need to be tuned to avoid doublers. A badly tuned set of\nparameters is usually obvious from the eigenvalue spectrum of the kernel and overlap operators.\nBK is constructed so that ∂ξ BK = 0 at ξ = 0 and ξ = 1, as required by the algorithm described in\nthe previous section. The overlap operator at mass μ is D[ξ ] = (1 + μ ) + (1 − μ )γ5 sign(Kξ ).\nConstruction of the HMC algorithm for the coarse Dirac operator is trivial. I am currently\ntesting it on a small PC-Cluster, using a 43 8 coarse lattice to generate 123 24 gauge field ensembles,\nand comparing it against a 122 4 trajectory generated using normal methods; timing the coarse\nmulti-grid HMC over trajectories of length 1 and the non-multi-grid comparison over trajectories of\nlength 0.02 and extrapolating to a length 1 trajectory. The multi-grid code gave, on average, a factor\nof 107 gain over the original routine. There was, however, an overhead of a factor of three from a\nnormal 43 8 run, which was mostly caused because both the overlap and Kernel operators were very\npoorly conditioned compared to the small lattice counterpart, and partly from the additional work\nneeded to differentiate the gauge fields. Obviously, the cost of constructing the fine lattice has yet\nto be included in this estimate. It is to be hoped that with proper tuning of the kernel operator Kξ\nthat this cost will be no more than that of a single length 1 trajectory on the larger lattice, meaning\nthat overall the gain will be roughly proportional to the autocorrelation length.\n\n5. Discussion\nI have discussed whether it is possible, using overlap fermions, to generate fine gauge fields\nensembles using a coarse Ginsparg-Wilson Dirac operator. The method will not be valid for other\n6\n\n\fMilti-grid HMC\n\nNigel Cundy\n\nlattice Dirac operators because the underlying renormalisation group theory breaks down. Small\nscale tests show that this method gives a two orders of magnitude gain over my previous HMC\nalgorithm, although with additional factors not yet included in that cost; the most important of\nwhich is the cost of extracting physics from the gauge field ensembles. It may reasonably be asked\nwhat use is there in generating the ensembles quickly using this method if one then has to apply an\noverlap operator on an exceptionally large lattice to extract physics. For most quantities it will also\nbe possible to do the physics on the coarse lattice: the coarse and fine lattice observables will be\nlinked to each other by renormalisation, and the renormalisation constants can be calculated nonperturbatively as usual. The number of observables which require the fine lattice will, hopefully, be\nquite small. It should also be possible to adapt this method to allow an anisotropic formulation on\nthe fine lattice. Why then use this method at all, since it gives a considerable overhead compared\nto the usual approach of a coarse Dirac operator on coarse gauge field? Because the locality of the\noverlap operator is improved (which I have confirmed numerically), it will (if correctly constructed)\nhave smaller lattice artefacts, and it will have a greater sensitivity to the topology of the fine gauge\nfield, and, of course, the fine gauge field and larger lattice is available for those observables which\nrequire it.\nHowever, the question of how much of a gain, if any, is achievable by this approach is not really\nanswerable until it has been fully tested. I hope to present numerical results in the subsequent paper.\n\nAcknowlegments\nI am grateful to the support of the Deutsche Forschungsgemeinschaft grant DFG FOR-465,\nand for many useful discussions with Andreas Schäfer. I am also grateful to the hospitality of the\nKivali Institute of Theoretical Physics in Beijing during the workshop \"Lattice Quantum Chromodynamics\" in July 2009. Numerical calculations were performed on the PC Cluster Juli at the\nJülich Supercomputer Center in Germany.\n\nReferences\n[1] R. Narayanan, H. Neuberger, Chiral fermions on the lattice, Phys. Rev. Lett. 71 (1993) 3251–3254.\narXiv:hep-lat/9308011; R. Narayanan, H. Neuberger, Chiral determinant as an overlap of two vacua,\nNucl. Phys. B412 (1994) 574–606. arXiv:hep-lat/9307006; H. Neuberger, A practical implementation\nof the overlap-Dirac operator, Phys. Rev. Lett. 81 (1998) 4060–4062. arXiv:hep-lat/9806025;\n[2] P. H. Ginsparg, K. G. Wilson, A remnant of chiral symetry on the lattice, Phys. Rev. D25 (1982) 2649;\n[3] M. Lüscher, Exact chiral symmetry on the lattice and the Ginsparg-Wilson relation, Phys. Lett. B428\n(1998) 342–345. arXiv:hep-lat/9802011;\n[4] N. Cundy, A renormalisation group derivation of the overlap formulation, Nuclear Physics B824\n(2010) 42. arXiv:0903.5521;\n[5] B. Joo, I. Horvath, K. F. Liu, The Kentucky Noisy Monte Carlo algorithm for Wilson dynamical\nfermions, Phys. Rev. D67 (2003) 074505. arXiv:hep-lat/0112033;\n[6] I. Horvath, A framework for systematic study of QCD vacuum structure. II: Coherent lattice QCD\narXiv:hep-lat/0607031;\n[7] M. Luscher, Trivializing maps, the Wilson flow and the HMC algorithm arXiv:0907.5491;\n\n7\n\n\f"}