{"id": "http://arxiv.org/abs/1105.4400v1", "guidislink": true, "updated": "2011-05-23T03:54:33Z", "updated_parsed": [2011, 5, 23, 3, 54, 33, 0, 143, 0], "published": "2011-05-23T03:54:33Z", "published_parsed": [2011, 5, 23, 3, 54, 33, 0, 143, 0], "title": "Frequency doubling and stabilization of a Tm,Ho:YLF laser at 2051 nm to\n  a high finesse optical cavity", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1105.4273%2C1105.2056%2C1105.0282%2C1105.1786%2C1105.3350%2C1105.4597%2C1105.0586%2C1105.6100%2C1105.3950%2C1105.1760%2C1105.1103%2C1105.3027%2C1105.2322%2C1105.5147%2C1105.3985%2C1105.5285%2C1105.4357%2C1105.1255%2C1105.2859%2C1105.4305%2C1105.1880%2C1105.5197%2C1105.5263%2C1105.5782%2C1105.1347%2C1105.1314%2C1105.4299%2C1105.3812%2C1105.2716%2C1105.1141%2C1105.5938%2C1105.3692%2C1105.1331%2C1105.3316%2C1105.0946%2C1105.2759%2C1105.1282%2C1105.1060%2C1105.3458%2C1105.3081%2C1105.3430%2C1105.3060%2C1105.0497%2C1105.2659%2C1105.0438%2C1105.0486%2C1105.0334%2C1105.1382%2C1105.4925%2C1105.2769%2C1105.0863%2C1105.6296%2C1105.0800%2C1105.3138%2C1105.4816%2C1105.3311%2C1105.0613%2C1105.4746%2C1105.0105%2C1105.2923%2C1105.1264%2C1105.2289%2C1105.4400%2C1105.0147%2C1105.2784%2C1105.0788%2C1105.1291%2C1105.0984%2C1105.2517%2C1105.5350%2C1105.4687%2C1105.0980%2C1105.2148%2C1105.5901%2C1105.3577%2C1105.2861%2C1105.1673%2C1105.5775%2C1105.3697%2C1105.3850%2C1105.3386%2C1105.1844%2C1105.0987%2C1105.1151%2C1105.4200%2C1105.1971%2C1105.5581%2C1105.5936%2C1105.3243%2C1105.0635%2C1105.2712%2C1105.6105%2C1105.4589%2C1105.1481%2C1105.1296%2C1105.4917%2C1105.1230%2C1105.4319%2C1105.3743%2C1105.4455%2C1105.5215&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Frequency doubling and stabilization of a Tm,Ho:YLF laser at 2051 nm to\n  a high finesse optical cavity"}, "summary": "Light from a Tm,Ho:YLF laser operating at 2051 nm is frequency doubled then\ncoupled into a high Fabry-Perot cavity with manufacturer quoted finesse in\nexcess of 300,000. The frequency of the laser is stabilized using the\nPound-Drever-Hall (PDH) method. A two channel feedback circuit allows for laser\nfrequency stabilization with a bandwidth of 2 MHz. This laser system has been\nused to drive the 6S1/2 to 5D3/2 transition in 138Ba+, where a 2 ms laser-ion\ncoherence times has been observed, demonstrating a linewidth of less than 500\nHz. The intensity noise of this system is analyzed and found to be acceptable\nfor several proposed experiments on a single trapped barium ion.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1105.4273%2C1105.2056%2C1105.0282%2C1105.1786%2C1105.3350%2C1105.4597%2C1105.0586%2C1105.6100%2C1105.3950%2C1105.1760%2C1105.1103%2C1105.3027%2C1105.2322%2C1105.5147%2C1105.3985%2C1105.5285%2C1105.4357%2C1105.1255%2C1105.2859%2C1105.4305%2C1105.1880%2C1105.5197%2C1105.5263%2C1105.5782%2C1105.1347%2C1105.1314%2C1105.4299%2C1105.3812%2C1105.2716%2C1105.1141%2C1105.5938%2C1105.3692%2C1105.1331%2C1105.3316%2C1105.0946%2C1105.2759%2C1105.1282%2C1105.1060%2C1105.3458%2C1105.3081%2C1105.3430%2C1105.3060%2C1105.0497%2C1105.2659%2C1105.0438%2C1105.0486%2C1105.0334%2C1105.1382%2C1105.4925%2C1105.2769%2C1105.0863%2C1105.6296%2C1105.0800%2C1105.3138%2C1105.4816%2C1105.3311%2C1105.0613%2C1105.4746%2C1105.0105%2C1105.2923%2C1105.1264%2C1105.2289%2C1105.4400%2C1105.0147%2C1105.2784%2C1105.0788%2C1105.1291%2C1105.0984%2C1105.2517%2C1105.5350%2C1105.4687%2C1105.0980%2C1105.2148%2C1105.5901%2C1105.3577%2C1105.2861%2C1105.1673%2C1105.5775%2C1105.3697%2C1105.3850%2C1105.3386%2C1105.1844%2C1105.0987%2C1105.1151%2C1105.4200%2C1105.1971%2C1105.5581%2C1105.5936%2C1105.3243%2C1105.0635%2C1105.2712%2C1105.6105%2C1105.4589%2C1105.1481%2C1105.1296%2C1105.4917%2C1105.1230%2C1105.4319%2C1105.3743%2C1105.4455%2C1105.5215&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Light from a Tm,Ho:YLF laser operating at 2051 nm is frequency doubled then\ncoupled into a high Fabry-Perot cavity with manufacturer quoted finesse in\nexcess of 300,000. The frequency of the laser is stabilized using the\nPound-Drever-Hall (PDH) method. A two channel feedback circuit allows for laser\nfrequency stabilization with a bandwidth of 2 MHz. This laser system has been\nused to drive the 6S1/2 to 5D3/2 transition in 138Ba+, where a 2 ms laser-ion\ncoherence times has been observed, demonstrating a linewidth of less than 500\nHz. The intensity noise of this system is analyzed and found to be acceptable\nfor several proposed experiments on a single trapped barium ion."}, "authors": ["Adam Kleczewski", "Matthew Hoffman", "Eric Magnuson", "Boris Blinov", "Norval Fortson"], "author_detail": {"name": "Norval Fortson"}, "author": "Norval Fortson", "links": [{"href": "http://arxiv.org/abs/1105.4400v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1105.4400v1", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "physics.ins-det", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "physics.ins-det", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "physics.atom-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1105.4400v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1105.4400v1", "arxiv_comment": null, "journal_reference": null, "doi": null, "fulltext": "Frequency doubling and stabilization of a Tm,Ho:YLF laser at 2051 nm to a high\nfinesse optical cavity\nAdam Kleczewski,1 , a) Matthew Hoffman,1 Eric Magnuson,1 Boris Blinov,1 and Norval\nFortson1\n\narXiv:1105.4400v1 [physics.ins-det] 23 May 2011\n\nUniversity of Washington, Department of Physics, 3910 15th Avenue NE Seattle,\nWA 98195, USA\nLight from a Tm,Ho:YLF laser operating at 2051 nm is frequency doubled then\ncoupled into a high Fabry-Perot cavity with manufacturer quoted finesse (F ) in\nexcess of 300,000. The frequency of the laser is stabilized using the Pound-Drever-Hall\n(PDH) method. A two channel feedback circuit allows for laser frequency stabilization\nwith a bandwidth of 2 MHz. This laser system has been used to drive the 6S1/2 to\n5D3/2 transition in 138 Ba+ , where a 2 ms laser-ion coherence times has been observed,\ndemonstrating a linewidth of less than 500 Hz. The intensity noise of this system\nis analyzed and found to be acceptable for several proposed experiments on a single\ntrapped barium ion.\n\na)\n\nElectronic mail: adamklec@u.washington.edu\n\n1\n\n\fI.\n\nINTRODUCTION\nDiode pumped solid state lasers with 'eye safe' wavelengths near 2000 nm have received\n\nconsiderable attention for their potential to be used in LIDAR applications. A number of\ngroups have reported frequency stabilizing similar lasers by locking the laser frequency to\nspectral features in a molecular vapor cell1,2 as well as to a low-finesse (F ∼ 5) Fabry-Perot\netalon3 . The long-term drifts in laser frequency observed in these systems were between\ntens of kilohertz and tens of megahertz. While stabilizing the frequency of a ∼2000 nm laser\nto a broad molecular resonance may be sufficient for LIDAR applications, driving electric\ndipole-forbidden transitions requires a more robust stabilization scheme. Here we report on\nthe frequency stabilization of a diode pumped Tm,Ho:YLF laser to a high-finesse FabryPerot etalon. The stabilized laser will be used to coherently drive the 6S1/2 to 5D3/2 electric\nquadrupole transition in Ba+ as part of several proposed atomic physics experiments.\nFirst, this laser will be used to selectively populate states in the metastable 5D3/2 level\nof\n\n137\n\nBa+ . Precision RF spectroscopy will be performed to measure the hyperfine splittings\n\nand fit for the magnetic octupole hyperfine coupling constant. Because a barium ion has\nthe electronic structure of an alkali atom, electronic wavefunctions for this system can be\ncalculated with enough precision to extract a value for the nuclear magnetic octupole moment\nof\n\n137\n\nBa4 . A similar measurement performed on the 6P3/2 level of\n\n133\n\nCs implied a nuclear\n\nmagnetic octupole moment 40 times larger than the predictions of the nuclear shell model5 .\nSecond, the long lifetime of the 5D3/2 level (τ ∼ 80s6 )and the fact that F=0 hyperfine sublevel does not couple to electric field gradients make this transition a possible candidate\nfor use as an optical frequency standard7 . Finally, it is possible to drive the 6S1/2 to 5D3/2\ntransition in Ba+ as a parity non-conserving electric dipole transition. Fortson8 has proposed\nan experiment to observe this effect in the light shift of the ground state energy levels of a\nsingle trapped barium ion caused by an off resonant 2051 nm laser.\n\nII.\n\nFREQUENCY STABILIZATION\nRobust frequency stabilization of a 2051 nm laser is a crucial component of all of the bar-\n\nium ion experiments described above. The 2051 nm laser used for this work is a Tm,Ho:YLF\ndiode pumped solid state laser manufactured by CLR Photonics (now a part of Lockheed\n2\n\n\fMartin). Its maximum output power was measured to be approximately 40 mW. Changing\nthe temperature of the laser resonator coarsely tunes the center wavelength of the laser.\nFine tuning of the laser frequency is achieved with a voltage sent to a piezo-electric actuator mounted on the output coupling mirror of the laser cavity. The tuning piezo has a\nsmall-signal bandwidth of approximately 10 kHz.\nWhile reference cavities designed for use at visible and near-infrared wavelengths routinely have finesses greater than 105 , state-of-the-art high reflective coating technology for\nwavelengths near 2000 nm would limit the finesse of a 2051 nm cavity to approximately\n20,000. Additionally, commercial options for electro-optic modulators (EOMs), necessary\nfor a PDH lock, and broadband acousto-optic modulators (AOMs), necessary for a wide\ntuning range, are not readily available. For these reasons we opted to frequency double our\n2051 nm laser and reference the laser to a cavity designed for 1025 nm.\n\nA.\n\nSecond Harmonic Generation of 2051 nm Light\nImplementing a PDH lock to a 1025 nm reference cavity requires that we generate at\n\nleast 100 μW of 1025 nm light so that we can comfortably accommodate power losses from\na double passed frequency shifting AOM. Second harmonic generation (SHG) of light at\na similar wavelength using a bulk periodically poled lithium niobate (PPLN) crystal in\nsingle pass configuration has been previously demonstrated with an efficiency of 10% W−19 .\nThe PPLN crystal used in this setup is 4 cm long and has nine parallel tracks with different\npoling periods. We used a track with a poling period of 30.25 μm and maintained the crystal\ntemperature at 108 ◦ C for optimum phase matching. However, in single pass configuration\nwe were only able to reach a maximum conversion efficiency of 1.25% W−1 . The reason for\nthis lower efficiency is not clear.\n1025 nm SHG efficiency is increased substantially by placing the temperature controlled\nPPLN crystal inside a \"bow-tie\" enhancement cavity (Fig. 1). The enhancement cavity\nconsists of two flat mirrors and two curved mirrors each with a radius of curvature of 250\nmm arranged in a bow-tie configuration. The curved mirrors are separated by 325 mm and\nthe PPLN crystal is placed at the midpoint where the beam comes to a 150 μm waist. These\nrelatively long mirror separations were necessary to ensure that the beam was not clipped\nby the 0.5 mm square PPLN channels. This crystal is AR coated for 2051 nm, as well as\n3\n\n\f1025 nm, and has been polished to a 1 degree wedge to prevent the crystal from acting as an\nintra-cavity etalon. The length of the enhancement cavity is locked to the wavelength of the\n2051 nm laser by sending an error signal derived using the Hansch-Couillaud method10 to\na piezo-electric actuator mounted on one of the flat cavity mirrors. Our coupling efficiency\ninto the enhancement cavity is approximately 75%. We estimate the cavity build up of 2051\nnm light to be approximately 20. Sending the full 40 mW output of the Tm,Ho:YLF laser\nto the enhancement cavity we were able to generate 2.5 mW of 1025 nm light. When the\n55 MHz AOM is included in the 2051 nm beam path, approximately 20 mW is sent to the\nenhancement cavity and we are able to generate approximately 500 μW of 1025 nm light.\n\nB.\n\nPDH Stabilization with Two-Channel Feedback\nAfter the enhancement cavity, the 1025 nm beam makes a double pass through a frequency\n\nshifting AOM with a center frequency of 200 MHz. This AOM allows for a continuous tuning\nrange of approximately 80 MHz at the 2051 nm wavelength. The beam then passes through\na resonant EOM to generate PDH sidebands at 20 MHz11 and then through a series of mode\nmatching lenses before coupling into the reference cavity.\nOur reference cavity consists of two mirrors held 77.5 mm apart by a spacer made from\nultra-low expansion (ULE) glass of a design developed at JILA12 . The mirrors are coated\nfor high reflectivity at the 1025 nm wavelength. The input mirror is flat and the output\nmirror has a radius of curvature of 500 mm. The cavity is mounted vertically inside a vacuum\nchamber and maintained at a pressure of 10−8 Torr with an ion pump. The vacuum chamber\nis enclosed inside a temperature stabilized box to further reduce cavity length variations.\nCavity ring down measurements indicate the cavity finesse to be greater than 300,000.\nLight rejected from the cavity is separated from the incident beam using a quarter waveplate and a polarizing beam splitter. The intensity of the rejected beam is detected with\na high-bandwidth amplified photodetector (PD). A PDH error signal is derived from the\nphotodetector output using a double balanced mixer.\nFrequency stabilization of the Tm,Ho:YLF laser frequency is achieved by splitting the\nPDH error signal into a high bandwidth and a low bandwidth channel. The low bandwidth\nchannel consists of an analog integrator circuit (I in Fig. 1) followed by a high-voltage\namplification stage. The amplified signal is sent to the tuning piezo inside the laser head.\n4\n\n\fTo Ion\nλ/4\n\nTm, Ho:\nYLF\n\nPD\n\n200 MHz\nAOM\n\n55 MHz\nAOM\n\nULE\nEOM\nPBS\n\nPPLN\n\nP\n\n20 MHz ~\n\nPBS\nλ/4\nPD\n\nI\nLP Filter\n\nFIG. 1. Light from a 2051 nm Tm,Ho:YLF laser passes through an AOM and is frequency doubled\nwith a PPLN crystal in a bow-tie cavity. The 1025 nm light is then frequency shifted by a doublepassed AOM, and stabilized to a high finesse reference cavity using the PDH method11 . An EOM\ndriven by a 20 MHz source is used to excited the sidebands necessary for the PDH lock. After\npassing through a low-pass (LP) filter, high bandwidth proportional feedback (P) is sent to the\nfirst AOM, while low bandwidth integral feedback (I) is amplified and sent to the tuning piezo\ninside the laser head.\n\nThe bandwidth of this channel is approximately 10 kHz. Higher bandwidth feedback is\nnecessary to maintain a robust lock to the ∼7 kHz wide TEM00 mode of the ULE cavity.\nTo achieve this, the PDH error signal in the high bandwidth channel is sent through an\nanalog amplification stage that provides variable proportional gain then to the control input\nof the voltage controlled oscillator (VCO) used to drive the 55 MHz AOM at the output\nof the laser. Both the VCO and the AOM have 2 MHz modulation bandwidths. With the\ngains of both feedback channels set correctly are we able to maintain a robust lock to the\nULE cavity. With the 2051 nm laser locked to the ULE cavity we were recently able to\nobserve 2 ms laser-ion coherence times on the 6S1/2 to 5D3/2 transition in 138 Ba13 , indicating\na laser linewidth of less than 500 Hz.\n\nIII.\n\nINTENSITY NOISE\n\nOne side effect of the frequency stabilization scheme presented here is that frequency noise\ncanceled in the high bandwidth channel is converted into a small amount of intensity noise\nafter the 55 MHz AOM. The output amplitude of the VCO used to drive the AOM varies\n5\n\n\f-120\nLocked\nUnlocked\nNoise Floor\n\n-130\n\nRIN HdB\u0090HzL\n\n-140\n-150\n-160\n-170\n-180\n-190\n5000 1  ́ 104\n\n5  ́ 104 1  ́ 105\n\n5  ́ 105\n\nFrequency HHzL\n\nFIG. 2. Relative intensity noise (RIN) spectrum on the Tm,Ho:YLF laser while free running and\nwhile locked to the ULE reference cavity.\n\nslightly with frequency, as does the efficiency of the AOM itself. When the fast feedback\ncircuit corrects for a fluctuation in laser frequency by changing the frequency of the VCO,\nthe optical power after the AOM changes. We measured the intensity noise on the 2051 nm\nbeam that was sent to the barium ion using a high bandwidth photodetector, then displayed\nthe frequency spectrum using a spectrum analyzer. Relative intensity noise measurements\nof the free running laser and stabilized laser are shown in Figure 2. The peak at 400 kHz\ncorresponds to the oscillation relaxation frequency of Tm,Ho:YLF, which is discussed in1 .\nThe peak in the locked signal is at ∼ 35 kHz is introduced by the frequency lock. The\ntotal relative intensity noise in the 1 to 600 kHz frequency band increases from -104.7 to\n-100.2 dB when we lock the laser to the ULE cavity. This excess intensity noise as well as\nthe intensity noise at the relaxation frequency could be canceled using the intensity noise\ncancellation1 , however we do not expect intensity noise to pose a serious problem for the\nplanned experiments.\n\nIV.\n\nCONCLUSIONS\n\nEfficient SHG of 1025 nm light was demonstrated using a PPLN crystal inside a \"bowtie\" enhancement cavity. Using two channel feedback circuit, the frequency of a 2051 nm\nTm,Ho:YLF laser was locked to a high finesse reference cavity using the Pound-Drever-Hall\ntechnique, resulting in a sub-kilohertz laser linewidth.\n6\n\n\fACKNOWLEDGMENTS\nThe authors wish to thank Jeff Sherman and Yonatan Cohen for early work on this\nproject. This research was supported by National Science Foundation grant PHY-09-06494.\n\nREFERENCES\n1\n\nP. Laporta, M. Marano, L. Pallaro, and S. Taccheo, Optics and Lasers in Engineering 37,\n447 (2002).\n\n2\n\nG. J. Koch, A. N. Dharamsi, C. M. Fitzgerald, and J. C. McCarthy, Appl. Opt. 39, 3664\n(2000).\n\n3\n\nB. T. McGuckin, R. T. Menzies, and C. Esproles, Appl. Opt. 32, 2082 (1993).\n\n4\n\nK. Beloy, A. Derevianko, V. A. Dzuba, G. T. Howell, B. B. Blinov, and E. N. Fortson,\nPhys. Rev. A 77, 052503 (2008).\n\n5\n\nV. Gerginov, A. Derevianko, and C. E. Tanner, Phys. Rev. Lett. 91, 072501 (2003).\n\n6\n\nN. Yu, W. Nagourney, and H. Dehmelt, Phys. Rev. Lett. 78, 4898 (1997).\n\n7\n\nJ. A. Sherman, W. Trimble, S. Metz, W. Nagourney, and N. Fortson, Digest of the LEOS\nSummer Topical Meetings, 2005 , 99 (2005).\n\n8\n\nN. Fortson, Phys. Rev. Lett. 70, 2383 (1993).\n\n9\n\nG. Galzerano, M. Marano, S. Longhi, E. Sani, A. Toncelli, M. Tonelli, and P. Laporta,\nOpt. Lett. 28, 2085 (2003).\n\n10\n\nT. Hansch and B. Couillaud, Optics Communications 35, 441 (1980).\n\n11\n\nR. W. P. Drever, J. L. Hall, F. V. Kowalski, J. Hough, G. M. Ford, A. J. Munley, and\nH. Ward, Applied Physics B: Lasers and Optics 31, 97 (1983).\n\n12\n\nM. Notcutt, L.-S. Ma, J. Ye, and J. L. Hall, Opt. Lett. 30, 1815 (2005).\n\n13\n\nA. Kleczewski, M. Hoffman, E. Magnuson, B. Blinov, and N. Fortson, Manuscript in preparation, Tentatively titled: Direct observation of the 6S1/2 to 5D3/2 Electric Quadrupole\nTransition in\n\n138\n\nBa+ (2011).\n\n7\n\n\f"}