{"id": "http://arxiv.org/abs/1010.0005v2", "guidislink": true, "updated": "2011-01-31T00:31:39Z", "updated_parsed": [2011, 1, 31, 0, 31, 39, 0, 31, 0], "published": "2010-09-30T20:00:18Z", "published_parsed": [2010, 9, 30, 20, 0, 18, 3, 273, 0], "title": "Resistivity-driven State Changes in Vertically Stratified Accretion\n  Disks", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1010.3794%2C1010.4552%2C1010.5476%2C1010.3013%2C1010.1955%2C1010.0962%2C1010.0149%2C1010.5623%2C1010.2716%2C1010.4264%2C1010.3625%2C1010.3742%2C1010.2458%2C1010.4806%2C1010.3641%2C1010.6260%2C1010.4146%2C1010.4221%2C1010.0109%2C1010.5885%2C1010.1763%2C1010.1410%2C1010.5428%2C1010.2984%2C1010.4726%2C1010.2747%2C1010.4269%2C1010.2257%2C1010.1217%2C1010.2431%2C1010.2632%2C1010.4534%2C1010.1352%2C1010.0120%2C1010.2511%2C1010.4238%2C1010.0285%2C1010.0005%2C1010.5099%2C1010.5013%2C1010.4526%2C1010.3736%2C1010.3812%2C1010.5951%2C1010.0060%2C1010.6240%2C1010.2093%2C1010.2362%2C1010.4826%2C1010.5140%2C1010.4666%2C1010.2118%2C1010.4404%2C1010.4350%2C1010.0580%2C1010.0153%2C1010.1548%2C1010.0535%2C1010.2109%2C1010.5690%2C1010.1333%2C1010.1440%2C1010.6302%2C1010.5749%2C1010.4851%2C1010.3512%2C1010.1720%2C1010.2906%2C1010.2926%2C1010.4913%2C1010.1178%2C1010.0838%2C1010.2948%2C1010.3405%2C1010.6155%2C1010.4790%2C1010.1783%2C1010.4320%2C1010.4689%2C1010.1183%2C1010.1385%2C1010.0695%2C1010.2986%2C1010.2749%2C1010.2229%2C1010.4558%2C1010.5953%2C1010.2239%2C1010.3623%2C1010.6245%2C1010.1725%2C1010.1502%2C1010.4294%2C1010.3984%2C1010.0961%2C1010.2887%2C1010.4080%2C1010.0983%2C1010.6162%2C1010.2782%2C1010.4170&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Resistivity-driven State Changes in Vertically Stratified Accretion\n  Disks"}, "summary": "We investigate the effect of shear viscosity and Ohmic resistivity on the\nmagnetorotational instability (MRI) in vertically stratified accretion disks\nthrough a series of local simulations with the Athena code. First, we use a\nseries of unstratified simulations to calibrate physical dissipation as a\nfunction of resolution and background field strength; the effect of the\nmagnetic Prandtl number, Pm = viscosity/resistivity, on the turbulence is\ncaptured by ~32 grid zones per disk scale height, H. In agreement with previous\nresults, our stratified disk calculations are characterized by a subthermal,\npredominately toroidal magnetic field that produces MRI-driven turbulence for\n|z| < 2 H. Above |z| = 2 H, magnetic pressure dominates and the field is\nbuoyantly unstable. Large scale radial and toroidal fields are also generated\nnear the mid-plane and subsequently rise through the disk. The polarity of this\nmean field switches on a roughly 10 orbit period in a process that is\nwell-modeled by an alpha-omega dynamo. Turbulent stress increases with Pm but\nwith a shallower dependence compared to unstratified simulations. For\nsufficiently large resistivity, on the order of cs H/1000, where cs is the\nsound speed, MRI turbulence within 2 H of the mid-plane undergoes periods of\nresistive decay followed by regrowth. This regrowth is caused by amplification\nof toroidal field via the dynamo. This process results in large amplitude\nvariability in the stress on 10 to 100 orbital timescales, which may have\nrelevance for partially ionized disks that are observed to have high and low\naccretion states.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1010.3794%2C1010.4552%2C1010.5476%2C1010.3013%2C1010.1955%2C1010.0962%2C1010.0149%2C1010.5623%2C1010.2716%2C1010.4264%2C1010.3625%2C1010.3742%2C1010.2458%2C1010.4806%2C1010.3641%2C1010.6260%2C1010.4146%2C1010.4221%2C1010.0109%2C1010.5885%2C1010.1763%2C1010.1410%2C1010.5428%2C1010.2984%2C1010.4726%2C1010.2747%2C1010.4269%2C1010.2257%2C1010.1217%2C1010.2431%2C1010.2632%2C1010.4534%2C1010.1352%2C1010.0120%2C1010.2511%2C1010.4238%2C1010.0285%2C1010.0005%2C1010.5099%2C1010.5013%2C1010.4526%2C1010.3736%2C1010.3812%2C1010.5951%2C1010.0060%2C1010.6240%2C1010.2093%2C1010.2362%2C1010.4826%2C1010.5140%2C1010.4666%2C1010.2118%2C1010.4404%2C1010.4350%2C1010.0580%2C1010.0153%2C1010.1548%2C1010.0535%2C1010.2109%2C1010.5690%2C1010.1333%2C1010.1440%2C1010.6302%2C1010.5749%2C1010.4851%2C1010.3512%2C1010.1720%2C1010.2906%2C1010.2926%2C1010.4913%2C1010.1178%2C1010.0838%2C1010.2948%2C1010.3405%2C1010.6155%2C1010.4790%2C1010.1783%2C1010.4320%2C1010.4689%2C1010.1183%2C1010.1385%2C1010.0695%2C1010.2986%2C1010.2749%2C1010.2229%2C1010.4558%2C1010.5953%2C1010.2239%2C1010.3623%2C1010.6245%2C1010.1725%2C1010.1502%2C1010.4294%2C1010.3984%2C1010.0961%2C1010.2887%2C1010.4080%2C1010.0983%2C1010.6162%2C1010.2782%2C1010.4170&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We investigate the effect of shear viscosity and Ohmic resistivity on the\nmagnetorotational instability (MRI) in vertically stratified accretion disks\nthrough a series of local simulations with the Athena code. First, we use a\nseries of unstratified simulations to calibrate physical dissipation as a\nfunction of resolution and background field strength; the effect of the\nmagnetic Prandtl number, Pm = viscosity/resistivity, on the turbulence is\ncaptured by ~32 grid zones per disk scale height, H. In agreement with previous\nresults, our stratified disk calculations are characterized by a subthermal,\npredominately toroidal magnetic field that produces MRI-driven turbulence for\n|z| < 2 H. Above |z| = 2 H, magnetic pressure dominates and the field is\nbuoyantly unstable. Large scale radial and toroidal fields are also generated\nnear the mid-plane and subsequently rise through the disk. The polarity of this\nmean field switches on a roughly 10 orbit period in a process that is\nwell-modeled by an alpha-omega dynamo. Turbulent stress increases with Pm but\nwith a shallower dependence compared to unstratified simulations. For\nsufficiently large resistivity, on the order of cs H/1000, where cs is the\nsound speed, MRI turbulence within 2 H of the mid-plane undergoes periods of\nresistive decay followed by regrowth. This regrowth is caused by amplification\nof toroidal field via the dynamo. This process results in large amplitude\nvariability in the stress on 10 to 100 orbital timescales, which may have\nrelevance for partially ionized disks that are observed to have high and low\naccretion states."}, "authors": ["Jacob B. Simon", "John F. Hawley", "Kris Beckwith"], "author_detail": {"name": "Kris Beckwith"}, "author": "Kris Beckwith", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1088/0004-637X/730/2/94", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1010.0005v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1010.0005v2", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "very minor changes, accepted to ApJ", "arxiv_primary_category": {"term": "astro-ph.HE", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "astro-ph.HE", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1010.0005v2", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1010.0005v2", "journal_reference": null, "doi": "10.1088/0004-637X/730/2/94", "fulltext": "Resistivity-driven State Changes in Vertically Stratified Accretion\nDisks\nJacob B. Simon1 , John F. Hawley2 , Kris Beckwith3\n\narXiv:1010.0005v2 [astro-ph.HE] 31 Jan 2011\n\nABSTRACT\nWe investigate the effect of shear viscosity, ν, and Ohmic resistivity, η on\nthe magnetorotational instability (MRI) in vertically stratified accretion disks\nthrough a series of local simulations with the Athena code. First, we use a series of unstratified simulations to calibrate physical dissipation as a function of\nresolution and background field strength; the effect of the magnetic Prandtl number, Pm = ν/η, on the turbulence is captured by ∼ 32 grid zones per disk scale\nheight, H. In agreement with previous results, our stratified disk calculations are\ncharacterized by a subthermal, predominately toroidal magnetic field that produces MRI-driven turbulence for |z| . 2H. Above |z| ∼ 2H, magnetic pressure\ndominates and the field is buoyantly unstable. Large scale radial and toroidal\nfields are also generated near the mid-plane and subsequently rise through the\ndisk. The polarity of this mean field switches on a roughly 10 orbit period in a\nprocess that is well-modeled by an α–Ω dynamo. Turbulent stress increases with\nPm but with a shallower dependence compared to unstratified simulations. For\nsufficiently large resistivity, η ∼ cs H/1000 where cs is the sound speed, MRI turbulence within 2H of the mid-plane undergoes periods of resistive decay followed\nby regrowth. This regrowth is caused by amplification of toroidal field via the\ndynamo. This process results in large amplitude variability in the stress on 10 to\n100 orbital timescales, which may have relevance for partially ionized disks that\nare observed to have high and low accretion states.\nSubject headings: accretion, accretion disks - (magnetohydrodynamics:) MHD\n1\n\njbsimon@jila.colorado.edu, JILA, University of Colorado, 440 UCB, Boulder, CO 80309-0440\n\nDepartment of Astronomy, University of Virginia, P.O. Box 400325, Charlottesville, VA 22904-4325\n2\n\njh8h@virginia.edu, Department of Astronomy, University of Virginia, P.O. Box 400325\n\nCharlottesville, VA 22904-4325\n3\n\nkris.beckwith@jila.colorado.edu, JILA, University of Colorado, 440 UCB, Boulder, CO 80309-0440\n\n\f–2–\n1.\n\nIntroduction\n\nDisk accretion is a fundamental astrophysical process, responsible for such diverse phenomena as the immensely luminous, distant quasars and the formation and evolution of\nprotostellar systems. This process requires removing angular momentum from the orbiting\ngas, and from the beginnings of disk theory it has been clear that microphysical viscosity is\norders of magnitude too small to account for observed accretion rates. It is now understood\nthat accretion is driven by magnetohydrodynamic (MHD) turbulent stresses arising from a\nrobust and powerful instability known as the magnetorotational instability (MRI) (Balbus\n& Hawley 1991, 1998).\nAnalytic investigations of the MRI have proven to be very insightful (e.g., Balbus &\nHawley 1991; Goodman & Xu 1994), but they can offer only limited guidance to the behavior\nof the MRI in the fully turbulent saturated state. Numerical simulations have become the\nessential tool for investigating how the MRI operates in accretion disks, and in particular,\nlocal shearing box simulations (see Hawley et al. 1995) have proven to be especially useful in\nsuch studies. The shearing box system solves the equations of MHD in a local, co-rotating\npatch of an accretion disk. The size of this patch is assumed to be small compared to its\nradial distance from the central star, allowing one to use Cartesian geometry while retaining\nthe essential dynamics of differential rotation. Shearing box simulations have led to an\nimproved understanding of MRI turbulence while addressing some basic questions about\naccretion disks.\nOne such question is, what sets the saturation level of MRI-driven turbulence and the\nangular momentum transport rate? This is usually phrased as \"What is α?\" following\nShakura & Syunyaev (1973) who made the ansatz that the rφ component of the turbulent\nstress, τrφ , is proportional to the pressure, τrφ = αP . Previous shearing box simulations have\nfound substantial evidence that MRI-driven stress does not behave in a manner consistent\nwith how α is often applied in disk theory. The early studies of Hawley et al. (1995) showed\nthat the stress is proportional to the magnetic pressure, but the magnetic pressure is not itself\ndirectly determined by the gas pressure, a result that holds over a wide range of shearing\nbox simulations (Blackman et al. 2008). Sano et al. (2004) performed an extensive survey\nand observed, at best, only a very weak gas pressure dependence for turbulent stress. More\nrecently, vertically stratified local simulations of radiation-dominated disks (Hirose et al.\n2009) have shown that while there is a correlation between the MRI stress and total (gas\nplus radiation) pressure, it has the opposite causal relationship from that normally assumed\nin the α model: the stress determines the pressure, not the other way around. Increased\nstress can lead to increased pressure through turbulent heating, but an increase in pressure\ndoes not feed back into the stress.\n\n\f–3–\nWhat then does determine the saturation level of the MRI? We know that viscosity and\nresistivity can significantly affect the properties of the linear MRI by reducing growth rates\nand altering the stability limits. Recently, the influence of the viscous and Ohmic dissipation\non MRI-induced turbulence has become a focus of shearing box simulations. Previous investigations into the effect of Ohmic resistivity on the saturated state (Hawley et al. 1996; Sano\net al. 1998; Fleming et al. 2000; Sano & Inutsuka 2001; Ziegler & Rüdiger 2001; Sano & Stone\n2002b) found that angular momentum transport decreases as the resistivity is increased, but\nit was not until the very recent work of Fromang & Papaloizou (2007), Pessah et al. (2007),\nand Fromang et al. (2007) that the influence of physical dissipation in numerical simulations\nwas fully appreciated. Fromang & Papaloizou (2007) and Pessah et al. (2007) found that\nfor shearing box simulations without a net magnetic flux and without explicit dissipation\nterms, the turbulent saturation level decreases with increasing numerical resolution without\nany sign of convergence. This surprising result was subsequently confirmed with different\nnumerical codes (e.g., Simon et al. 2009; Guan et al. 2009). In a second paper, Fromang\net al. (2007) demonstrated that the saturation level of the MRI in shearing boxes depends\nstrongly on the magnetic Prandtl number, i.e., the ratio of viscosity to resistivity (Pm = ν/η).\nSpecifically, for local simulations without a net magnetic flux, the turbulent stresses increase\nnearly linearly with Pm and for Pm . 1, the turbulence decays. Fromang (2010) subsequently\nshowed that at a fixed Pm , the presence of even a small viscosity and resistivity is sufficient to\nprovide convergence in the zero-net field case. The increase in stress with Pm is also present\nfor net vertical fields (Lesur & Longaretti 2007) and net toroidal fields (Simon & Hawley\n2009); for these field geometries, the Pm dependence is weaker and turbulence is maintained\neven for Pm < 1. For the net toroidal field model, only a sufficiently high resistivity could\nactually kill the turbulence completely (Simon & Hawley 2009).\nMost of these viscosity and resistivity studies used the unstratified shearing box model\nwhere vertical gravity is ignored and periodic boundary conditions are assumed for the\nvertical direction. Shearing box models that include vertical stratification are more realistic\nhowever, and interesting new effects arise when vertical gravity is included. For example, in\nmost such simulations, net toroidal field is generated near the mid-plane via MRI turbulence,\nbuoyantly rises upwards, and is replaced with a field of the opposite sign in the mid-plane\nregion. This behavior happens on a timescale of ∼ 10 orbits and appears to be indicative\nof an MHD dynamo operating within the disk (e.g., Brandenburg et al. 1995; Stone et al.\n1996; Hirose et al. 2006; Guan & Gammie 2010; Shi et al. 2010; Gressel 2010; Davis et al.\n2010). Furthermore, the vertical structure of the disk consists of MRI-turbulent gas that is\nmarginally stable to buoyancy within |z| ∼ 2H, whereas outside of this region, the gas is\nmagnetically dominated, significantly less turbulent, and buoyantly unstable (e.g., Guan &\nGammie 2010; Shi et al. 2010).\n\n\f–4–\nThe effects of resistivity on the MRI in vertically stratified shearing boxes has been\nstudied (e.g., Miller & Stone 2000), but many of these calculations are designed with protostellar systems in mind and employ a very large resistivity to completely quench the MRI\nand create a \"dead zone\" near the midplane (e.g., Gammie 1996; Fleming & Stone 2003;\nFromang & Papaloizou 2006; Oishi et al. 2007; Turner & Sano 2008; Ilgner & Nelson 2008;\nOishi & Low 2009; Turner et al. 2010). The effects of smaller resistivities and of ν and Pm\non vertically stratified turbulence has barely been examined. Recently, however, Davis et al.\n(2010) investigated how the results of Fromang & Papaloizou (2007) and Fromang et al.\n(2007) might change in the presence of vertical stratification. Davis et al. (2010) considered the zero-net magnetic flux case and employed vertically periodic boundary conditions\nto ensure that zero net flux was maintained throughout the simulation. They found that\nwithout physical dissipation, the volume-averaged stress level reaches a constant value as\nnumerical resolution is increased, in contrast to unstratified simulations where the stress\ndeclines. They further examined three ν and η values that lead to a decay of turbulence\nin unstratified boxes. With vertical gravity, however, these ν and η values lead to large,\nlong timescale fluctuations in the volume averaged stress level; the turbulence saturates at a\nrelatively high level for ∼ 100 orbits, then decreases to a lower saturation level for another\n∼ 100 orbits, and then increases again.\nThe primary goal of this work is to extend these first results and investigate in more\ndetail how ν and η affect MRI turbulence in vertically stratified shearing boxes. In particular, we consider the origin of the long-term fluctuations seen in Davis et al. (2010), and\nwhether that effect might be relevant to real accretion disks. Since stratification can alter the saturation levels of MRI-induced turbulence, we also investigate whether increasing\nPm still leads to increased stress levels and how Pm affects the dynamo process previously\nobserved in stratified simulations. Finally, these simulations will also serve as an essential\nstarting point for future studies that include more realistic physics, such as temperatureand density-dependent ν and η.\nThe structure of this paper is as follows. In § 2, we describe our evolution equations,\nparameters, and initial conditions. In § 3, we present a series of unstratified shearing box\nsimulations to calibrate the effects of physical dissipation and serve as controls for the vertically stratified shearing boxes with constant ν and η. We discuss our vertically stratified\nsimulations in § 4, which are the primary focus of this paper. The first set of these simulations contain no physical dissipation, and we carry out several analyses to improve our\nunderstanding of vertically stratified MRI turbulence. The second set of simulations then\nincludes physical dissipation to study the Pm effect. We wrap up with a discussion and our\ngeneral conclusions in § 5. We also present a detailed description of our numerical algorithm\nin an Appendix.\n\n\f–5–\n2.\n\nMethod\n\nIn this study, we use Athena, a second-order accurate Godunov flux-conservative code\nfor solving the equations of MHD. Athena uses the dimensionally unsplit corner transport\nupwind (CTU) method of Colella (1990) coupled with the third-order in space piecewise\nparabolic method (PPM) of Colella & Woodward (1984) and a constrained transport (CT;\nEvans & Hawley 1988) algorithm for preserving the ∇ * B = 0 constraint. We use the HLLD\nRiemann solver to calculate the numerical fluxes (Miyoshi & Kusano 2005; Mignone 2007).\nA detailed description of the Athena algorithm and the results of various test problems are\ngiven in Gardiner & Stone (2005), Gardiner & Stone (2008), and Stone et al. (2008).\nOur simulations utilize the shearing box approximation, a model for a local co-rotating\ndisk patch whose size is small compared to the radial distance from the central object, Ro .\nWe construct a local Cartesian frame, x = (R − Ro ), y = Ro φ, and z, co-rotating with an\nangular velocity Ω corresponding to the orbital frequency at Ro , the center of the box. In\nthis frame, the equations of motion become (Hawley et al. 1995):\n∂ρ\n+ ∇ * (ρv) = 0,\n∂t\n\u0012\n\u0013\n∂ρv\n1 2\n+ ∇ * (ρvv − BB) + ∇ P + B = 2qρΩ2 x − ρΩ2 z − 2Ω × ρv + ∇ * T ,\n∂t\n2\n∂B\n− ∇ × (v × B) = −∇ × (η∇ × B) .\n∂t\n\n(1)\n(2)\n(3)\n\nwhere ρ is the mass density, ρv is the momentum density, B is the magnetic field, P is the\ngas pressure, and q is the shear parameter, defined as q = −dlnΩ/dlnR. We use q = 3/2,\nappropriate for a Keplerian disk. We assume an isothermal equation of state P = ρc2s ,\nwhere cs is the isothermal sound speed. From left to right, the source terms in equation (2)\ncorrespond to radial tidal forces (gravity and centrifugal), vertical gravity, the Coriolis force,\nand the divergence of the viscous stress tensor, T , defined as\n\u0012\nTij = ρν\n\n\u0013\n∂vi\n∂vj\n2\n+\n− δij ∇ * v ,\n∂xj ∂xi 3\n\n(4)\n\nwhere the indices refer to the spatial components (Landau & Lifshitz 1959), and ν is the\nshear viscosity. We neglect bulk viscosity. The source term in equation (3) is the effect of\nOhmic resistivity, η, on the magnetic field evolution. Note that our system of units has the\nmagnetic permeability μ = 1. Details about the numerical integration of these equations are\npresented in the Appendix.\n\n\f–6–\nFor unstratified shearing box simulations, the boundary conditions are periodic for y and\nz, and shearing-periodic for x. In stratified simulations, the periodic z boundary conditions\nare replaced with outflow boundary conditions. The specifics are described in the Appendix.\n\n2.1.\n\nDissipation Parameters\n\nIn all of our simulations, ν and η are parameterized in terms of Reynolds numbers.\nAt a scale height, H, away from the radial center of the shearing box, the fluid velocity is\n|vy | ∼ qHΩ ∼ cs . Thus, the sound speed is a representative velocity for the fluid, and we\ndefine the Reynolds numbers as\ncs H\n.\nν\n\nRe ≡\n\n(5)\n\nSimilarly we define the magnetic Reynolds number,\ncs H\n,\nη\n\n(6)\n\nν\nRm\n=\n.\nη\nRe\n\n(7)\n\nRm ≡\nand their ratio, the magnetic Prandtl number,\nPm ≡\n\nBecause resistivity affects the MRI directly, another useful dimensionless quantity is the\nElsasser number\n\nΛ≡\n\nvA2\n.\nηΩ\n\n(8)\n\nΛ can be computed on a zone-by-zone basis, but it is also helpful to calculate an average Λ\nfor a simulation. Thus, we can write the characteristic Alfvén speed in direction i via the\naveraged magnetic field in that direction,\ns\nvAi =\n\nhBi2 i\n,\nhρi\n\n(9)\n\nwhere the angled brackets denote a volume average, and the subscript i = (x, y, z) depending\non the direction of interest. In the above definition of Λ, all three components are used in\n\n\f–7–\ncalculating the Alfvén speed. As the Elsasser number approaches unity, resistivity becomes\nmore dominant, stabilizing the MRI. Simon & Hawley (2009) found that turbulence decayed\nin net toroidal field, unstratified shearing boxes when the Elsasser number was . 100.\nAlthough we focus on physical dissipation, there is numerical dissipation as well. One\nway to characterize the effects of finite resolution is to compare the characteristic MRI\nwavelength, λMRI = 2πvA /Ω to the grid zone size. Noble et al. (2010) defined this \"quality\nfactor\" Q as\nQi ≡\n\nλMRI,i\n2πvAi\n=\n∆xi\nΩ∆xi\n\n(10)\n\nAgain, vAi is defined via equation (9). For Qi . 6, the growth of the MRI can be reduced\n(Sano et al. 2004) and the MRI is under-resolved, although this number has some uncertainty\nand should be taken only as an estimate.\nOne can also calculate a volume-averaged Alfvén speed rather than an Alfvén speed\ndetermined by the averaged field, i.e.,\n\u001c\n\u001d\n|Bi |\nvAi = √\n.\n(11)\nρ\nFor convenience, most of our analysis uses equation (9), as the volume-averaged history data\nand the one-dimensional, horizontally averaged quantities are routinely computed at high\ntime resolution for use in creating, e.g., space-time plots. As a check, we have calculated the\nvolume-averaged Alfvén speed via equation (11) for several hundreds of orbits in a few of our\nvertically stratified simulations (the volume average is done within 2H of the mid-plane). We\nfound that vA from equation (11) is roughly 1-1.5 times larger than that from equation (9).\n\n2.2.\n\nParameters and Initial Conditions\n\nWe have run shearing box simulations with different field geometries, dissipation values\nand resolutions, both with and without vertical gravity. Here, we describe the parameters\nand initial conditions used in these two types of simulations. The results from the unstratified\nsimulations are presented in § 3 and the results from the stratified simulations are in § 4.\n\n\f–8–\n2.2.1.\n\nSine Z Unstratified Simulations\n\nThe first set of simulations are unstratified, zero net magnetic flux shearing boxes. This\nis the same type of problem as investigated in Fromang et al. (2007) and Simon & Hawley\n(2009). The initial magnetic field is\np\nB = 2Po /β sin(2πx/Lx ) ẑ\n(12)\nwith β = 400. The isothermal sound speed is cs = 0.001, corresponding to an initial gas\npressure Po = 10−6 with initial density ρo = 1. The orbital velocity of the local domain is\nΩ = 0.001. For these simulations, we define the scale height to be\nH≡\n\ncs\n= 1,\nΩ\n\n(13)\n\n√\nwhich is a slightly different definition than that in the stratified box (by a factor of 2).\nThe size of the box is Lx = 1H, Ly = 4H, and Lz = 1H. We run several resolutions in order\nto study convergence, and at each resolution, we study four different cases of Rm and Pm\nvalues. See Table 1 for the parameters of these runs. The labeling scheme of the runs refers\nto resolution, field geometry, and dissipation values; e.g.,16SZRm12800Pm16 corresponds to\n16 zones per H, \"SZ\" for the \"Sine Z\" geometry, and Rm = 12800, Pm = 16. Since, as we\nwill see, Rm is the critical parameter in many of our simulations, we choose to include it\nas part of the run label, differing from the convention of related works (e.g., Fromang et al.\n2007; Simon & Hawley 2009).\nThe MRI is seeded with random perturbations to the density and the velocity components introduced at the grid scale. The amplitude of the density perturbations is δρ = 0.01\nand the amplitude of the velocity perturbations is (1/5)δρcs for each component (a different perturbation is applied for each component). We do not employ orbital advection in\nthese simulations (see Appendix). All simulations are run to 400 orbits, except for the runs\nin which the turbulence decays and also 32SZRm12800Pm16 and 32SZRe12500Pm4, which\nwere run to 289 orbits and 246 orbits, respectively. We also include the results from previous,\nhigher resolution simulations (Simon & Hawley 2009) in our analysis.\n\n2.2.2.\n\nFlux Tube Unstratified Simulations\n\nThe second set of unstratified simulations contain a net toroidal field and are initialized\nwith the twisted azimuthal flux tube of Hirose et al. (2006), with minor modifications to\nthe dimensions and β values. The initial conditions are designed to match those used in the\n\n\f–9–\nvertically stratified simulations of § 2.2.3, so we define H to be that of a stratified, isothermal\ndisk,\n√\n2cs\nH=\n.\nΩ\n\n(14)\n\nThe isothermal sound speed, cs = 7.07 × 10−4 , corresponding to an initial value for the gas\npressure of Po = 5 × 10−7 . With Ω = 0.001, the value for the scale height is H = 1. As in the\nSZ simulations, random perturbations are added to the density and velocity components.\nThe initial toroidal field, By , is given by\n( q\n2Po\n− (Bx2 + Bz2 )\nβy\nBy =\n0\n\nif Bx2 + Bz2 6= 0\nif Bx2 + Bz2 = 0\n\n(15)\n\nand we have run simulations with a toroidal field β of βy = 100, 1000, and 10000. The\npoloidal field components, Bx and Bz , are calculated from the y component of the vector\npotential,\n(\nAy =\nwhere r =\n\n√\n\n−\n0\n\nq\n\n2Po H\nβp 2π\n\n\u0002\n1 + cos\n\n2πr\nH\n\n\u0001\u0003\n\nif r <\nif r ≥\n\nH\n2\nH\n2\n\n(16)\n\nx2 + z 2 and βp = 1600 is the poloidal field β value.\n\nThe labeling convention is the same as in § 2.2.1, but with \"FT\" for \"Flux Tube\" (see\nTable 1). We run simulations both with and without physical dissipation. Those simulations\nwith no physical dissipation are labeled with \"Num\" for \"Numerical dissipation\", and for\nthe βy = 1000 (10000) cases, we append β1000 (β10000) on the end of the run label. The\ndomain size is Lx = 2H, Ly = 4H, and Lz = 1H, and the resolution is 32 zones per H.\nOrbital advection is employed in these calculations (see Appendix). 32FTNum was run to\n150 orbits, and both 32FTNumβ1000 and 32FTNumβ10000 were run to 110 orbits.\nThe runs with physical dissipation are initiated from the turbulent state (at t = 100\norbits) of the corresponding βy value run with only numerical dissipation. These simulations\nwere all run out to 220 orbits.\n\n2.2.3.\n\nVertically Stratified Simulations\n\nIn vertically stratified shearing boxes, the initial density corresponds to an isothermal\nhydrostatic equilibrium\n\n\f– 10 –\n\nTable 1. Unstratified Simulations\nLabel\n\nRe\n\nRm\n\nPm\n\nResolution\n(zones per H)\n\nα\n\nDescription\n\n16SZRm12800Pm16\n32SZRm12800Pm16\n64SZRm12800Pm16\n128SZRm12800Pm16a\n16SZRm12500Pm4\n32SZRm12500Pm4\n64SZRm12500Pm4\n128SZRm12500Pm4a\n16SZRm6250Pm1\n32SZRm6250Pm1\n64SZRm6250Pm1\n16SZRm25600Pm2\n32SZRm25600Pm2\n64SZRm25600Pm2\n32FTNum\n32FTNumβ1000\n32FTNumβ10000\n32FTRm800Pm0.5\n32FTRm3200Pm0.5\n32FTRm3200Pm2\n32FTRm3200Pm4\n32FTRm6400Pm4\n32FTRm6400Pm8\n32FTRm1600Pm1β1000\n32FTRm3200Pm2β1000\n32FTRm3200Pm2β10000\n\n800\n800\n800\n800\n3125\n3125\n3125\n3125\n6250\n6250\n6250\n12800\n12800\n12800\n–\n–\n–\n1600\n6400\n1600\n800\n1600\n800\n1600\n1600\n1600\n\n12800\n12800\n12800\n12800\n12500\n12500\n12500\n12500\n6250\n6250\n6250\n25600\n25600\n25600\n–\n–\n–\n800\n3200\n3200\n3200\n6400\n6400\n1600\n3200\n3200\n\n16\n16\n16\n16\n4\n4\n4\n4\n1\n1\n1\n2\n2\n2\n–\n–\n–\n0.5\n0.5\n2\n4\n4\n8\n1\n2\n2\n\n16\n32\n64\n128\n16\n32\n64\n128\n16\n32\n64\n16\n32\n64\n32\n32\n32\n32\n32\n32\n32\n32\n32\n32\n32\n32\n\n0.011\n0.033\n0.042\n0.046\n0.0043\n0.013\n0.015\n0.013\ndecay\ndecay\ndecay\n0.0077\n0.010\n0.0078\n0.021b\n0.020c\n0.018c\ndecay\n0.0094\n0.018\n0.028\n0.029\n0.041\ndecay\n0.015d\ndecay\n\nzero net flux\nzero net flux\nzero net flux\nzero net flux\nzero net flux\nzero net flux\nzero net flux\nzero net flux\nzero net flux\nzero net flux\nzero net flux\nzero net flux\nzero net flux\nzero net flux\nflux tube, num. dissipation, β = 100\nflux tube, num. dissipation, β = 1000\nflux tube, num. dissipation, β = 10000\nrestarted from 32FTNum\nrestarted from 32FTNum\nrestarted from 32FTNum\nrestarted from 32FTNum\nrestarted from 32FTNum\nrestarted from 32FTNum\nrestarted from 32FTNumβ1000\nrestarted from 32FTNumβ1000\nrestarted from 32FTNumβ10000\n\na These\n\nruns were taken from Simon & Hawley (2009)\n\nb Time\n\naveraged from orbit 20 to 150\n\nc Time\n\naveraged from orbit 20 to 110\n\nd Time\n\naveraged from orbit 120 to 400\n\n\f– 11 –\n\n\u0012\n\u0013\nz2\nρ(x, y, z) = ρo exp − 2 ,\nH\n\n(17)\n\nwhere ρo = 1 is the mid-plane density, and H is the scale height in the disk, as defined in\n§ 2.2.2. A density floor of 10−4 is applied to the physical domain as too small a density leads\nto a large Alfvén speed and a very small timestep. Furthermore, numerical errors in energy\nmake it difficult to evolve regions of very small plasma β. All other parameters and initial\nconditions are identical to the corresponding FT runs of § 2.2.2. All the stratified runs use\nβy = 100 for the initial toroidal field strength.\nThe domain size for all vertically stratified simulations is Lx = 2H, Ly = 4H, and\nLz = 8H, and we have run most simulations at 32 grid zones per H, with a few at 64 zones\nper H. Orbital advection is employed in all of these runs (see Appendix). The runs are listed\nin Table 2. The labeling scheme is the same as for the unstratified simulations, but we omit\nthe \"FT\" label as all the stratified runs use the flux tube initial conditions. We study the\neffect of physical dissipation by restarting the equivalent resolution, numerical-dissipationonly run at t = 100 orbits.\n\n3.\n\nCalibration of Physical Dissipation in Unstratified Disks\n\nWhile our focus is on the effects of physical dissipation on MRI-driven turbulence in\nstratified disks, we have carried out a series of unstratified shearing box simulations to\naddress several points. First, what resolution is needed to capture the influence of physical\ndissipation, and how does a given resolution influence the effects due to dissipation terms?\nSecond, what is the effect of physical dissipation on different initial background toroidal field\nstrengths? As we will see, this last question has direct relevance to our stratified simulations,\nin which the net toroidal field within a given region changes in time via shear and buoyancy.\nTable 1 is a list of the unstratified shearing box simulations. The column labeled \"Resolution\" lists Nx , the number of zones in one H. The column labeled α gives the averaged\nstress normalized by the averaged gas pressure,\nα≡\n\nhhρvx δvy − Bx By ii\n,\nhhP ii\n\n(18)\n\nwhere the double brackets denote a time and volume average, the volume average is calculated\nover the entire simulation domain, and the time average is calculated from orbit 20 to the\nend of the run. Since the gas is isothermal, hP i = hρic2s .\n\n\f– 12 –\n3.1.\n\nResolving Physical Dissipation\n\nWe begin with a resolution study of unstratified simulations with physical dissipation.\nFigure 1 shows α as a function of resolution for three different Pm values in the SZ simulations.\nThe Nx = 128 data listed in the table and plotted in the figure were taken from Simon &\nHawley (2009). Note that those runs were similar to, but not the same as those done for\nthis paper. Here, the grid zone size is equal in all directions, ∆x = ∆y = ∆z, whereas the\nSimon & Hawley (2009) runs had ∆x = ∆z = 0.4∆y. Furthermore, the calculations done\nin Simon & Hawley (2009) were performed with the Roe method for the Riemann solver, in\ncontrast to the HLLD solver used here.\nFor the SZ simulations that have sustained turbulence, α appears to be converging with\nresolution. More specifically, by 32 grid zones per H, α is within a factor of ∼ 1.4 of the\ncorresponding value at 128 zones per H. In contrast, α in the Pm = 16 and Pm = 4 runs\nincreases by about a factor of 3 going from 16 to 32 zones per H. The Pm = 2 case shows\na much smaller change and the turbulence dies out for all resolutions with Re = 6250 and\nPm = 1 in agreement with the higher resolution simulations of Fromang et al. (2007).\nNext, we explore the influence of physical dissipation terms on the FT initial field\nconfiguration, using 32 zones per H. The time history of the volume-averaged stress for\nthese runs is displayed in Fig. 2. There is a clear dependence on the dissipation parameters\nand on Pm in particular. For large enough resistivity (i.e., low Rm), the turbulence decays;\nthe critical Rm value is ∼ 1000, in agreement with the higher resolution simulations of Simon\n& Hawley (2009). In Fig. 3, we plot the time-averaged α values, averaged from orbit 120 to\nthe end of the simulation, versus Pm for these runs (asterisks). Note that 32FTRm3200Pm4\nand 32FTRm6400Pm4 have different Rm values, but the same Pm and nearly the same\nsaturation level. We also plot α from the higher resolution simulations of Simon & Hawley\n(2009) (see their Table 3). The dashed lines are linear fits to the data in log-log space.\nAssuming δ in α ∝ Pmδ we find δ = 0.54 for 32 grid zones per H, and δ = 0.33 for 128\ngrid zones per H; the Pm dependence is steeper at the lower resolution. Furthermore, all of\nthe α values for the higher resolution simulations are larger than the corresponding lower\nresolution simulations.\nBoth the zero net flux and net toroidal flux results suggest that moderate resolutions,\ni.e., 32 grid zones per H, may be sufficient to capture the general effects of changing ν and\nη, at least for the range of Re, Rm, and Pm values considered here. This is not to say that\neverything is converged at this resolution. Indeed, Fig. 3 shows a noticeable resolution effect.\nFull convergence likely requires a sufficiently high resolution to ensure that the effective\nnumerical dissipation scale is below the viscous and resistive dissipation scales (see e.g.,\nFromang et al. 2007; Simon et al. 2009; Simon & Hawley 2009), but the general dependence of\n\n\f– 13 –\nα on dissipation parameters appears to be captured even at 32 zones per H. This conclusion\nis also supported by the recent results of Flaig et al. (2010), which show that ∼ 30 zones per\nH in the vertical direction may be sufficient to characterize the turbulence in their stratified\nshearing box simulations. This is an important point, as available computational resources\nlimit us to this resolution in carrying out the comprehensive study of physical dissipation\neffects presented in this work.\n\n3.2.\n\nDissipation and Initial Field Strength\n\nBecause the fastest growing MRI wavelength is proportional to vA , the background field\nstrength can play a significant role in the outcome of a shearing box simulation. For example,\nLongaretti & Lesur (2010) found that the dependence of angular momentum transport on\nRm and Pm becomes steeper for weaker background (vertical) fields in unstratified shearing\nboxes.\nHere we consider the effects of different toroidal field strengths on the FT initial condition in the unstratified shearing box. We consider βy = 1000 and βy = 10000 runs both\nwith and without physical dissipation (see Table 1 and § 2). The time history of the volumeaveraged stresses for these simulations is shown in Fig. 4. For βy = 1000, the turbulence\nsurvives at Rm = 3200 but dies at Rm = 1600, whereas for βy = 10000, the turbulence dies\nat Rm = 3200. It would seem that for each increase in βy by a factor of 10, the critical Rm\nvalue increases by roughly a factor of 2; it becomes easier to kill off the MRI with a lower\nresistivity as the background toroidal field is weakened.\nThe time- and volume-averaged Elsasser numbers, calculated via equation (8), are 2.3\nand 137 for the β = 1000, Rm = 1600 and 3200 models respectively. The time average is\nfrom orbit 140 to the end of the calculation, and since the turbulence decays, the average Λ\nfor Rm = 1600 agrees with that given by the initial toroidal field value. For the β = 10000,\nRm = 3200 model, the Elsasser number is 0.45, again, calculated from either the initial\ntoroidal field strength or from equation (8) after the turbulence has completely decayed. In\nboth cases the initial poloidal field has βp = 1600, corresponding to an initial poloidal Λ on\norder unity for these Rm values. These results are consistent with the Λ values calculated\nin Simon & Hawley (2009); Λ . 100 leads to decay.\nThe time- and volume-averaged Qy values are Qy = 34 and Qy = 33 for 32FTNumβ1000\nand 32FTNumβ10000, respectively. The time average is done from orbit 20 to 110. The\ntoroidal field MRI appears to be quite well-resolved in both simulations. Averaging over\nthe same time interval, we find that Qz = 7.3 for 32FTNumβ1000 and Qz = 6.9 for\n\n\f– 14 –\n32FTNumβ10000; the vertical field MRI is marginally resolved. Note that these Q values are\ncalculated via the saturated state of these runs. Indeed, the initial Q values are substantially\nlower and either marginally or under-resolved. It is not clear which Q values are a better\nrepresentation of how well-resolved the MRI actually is; the initial values correspond to the\nbackground field which ultimately drives the MRI, but other modes may become important\nin driving the MRI in the fully nonlinear state. In any case, despite the low initial Q values,\nsustained turbulence develops when explicit dissipation terms are not included, suggesting\nthat at least some MRI modes are resolved. It is only when resistivity is turned on that\ndecaying turbulence is observed. The initial low Q values may introduce uncertainty for the\nspecific values of the critical resistivity, but the relationship between critical resistivity and\ninitial field strength is likely to hold nevertheless.\n\n4.\n\nVertically Stratified Simulations\n4.1.\n\nBaseline Simulations\n\nWe now turn to a series of simulations that investigate the effects of physical dissipation\nin vertically stratified, isothermal disks. The various combinations of runs are summarized in\nTable 2. Some time- and volume-averaged values of various quantities are given in Table 3.\nThe baseline calculations without physical dissipation are done at two resolutions: 32Num\nwhich uses 32 grid zones per H, and 64Num which uses 64. 32Num is run to a total\nintegration time of 1058 orbits. It has sustained turbulence at a level of α = 0.028, calculated\nvia equation (18), time-averaging from orbit 20 until the end of the calculation, and volumeaveraging over all x and y and for |z| ≤ 2H. In Model 64Num, α = 0.022, where the time\naverage is from orbit 20 until the end of the simulation at 159 orbits.\nOne particularly useful diagnostic is the space-time diagram of horizontally averaged\nquantities. Figure 5 shows space-time plots of horizontally averaged By and pressurenormalized total stress for a 100 orbit period in the 64Num simulation. From this, we\nsee that By changes sign periodically and rises above the equatorial plane. The behavior of\nBy is roughly mirror symmetric around the equator and has a period of ∼ 10 orbits at both\nresolutions. This has been seen in previous vertically stratified shearing boxes (e.g., Brandenburg et al. 1995; Stone et al. 1996; Hirose et al. 2006; Guan & Gammie 2010; Shi et al.\n2010; Gressel 2010; Davis et al. 2010), with a variety of initial fields, numerical resolutions\nand codes, and it has even been observed in global simulations (e.g., Fromang & Nelson\n2006; Dzyurkevich et al. 2010; O'Neill et al. 2010). It is apparently a generic property of\nMRI-driven turbulence in the presence of vertical gravity.\n\n\f– 15 –\nThe white contours in the top panel of Fig. 5 indicate where the gas β value switches\nfrom greater than to less than unity. For |z| & 2 − 2.5H, β < 1, except for some regions\nvery near the vertical boundaries where β > 1 as a result of the absence of magnetic field.\nThe region around |z| = 2H is also where the fluid becomes completely buoyantly unstable.\nUsing the criterion of Newcomb (1961) as outlined in Guan & Gammie (2010), the gas is\nbuoyantly stable if\ndρ\nρ2 g\n>\ndz\nγP\n\n(19)\n\nwhere γ = 1 because the gas is isothermal. According to this criterion applied to the\nsimulation data, the fluid is buoyantly unstable for |z| & 2H. Consistent with this, the\nspace-time plot shows that the field rises faster for |z| & 2H. For |z| . 2H, there are\nregions of instability as well as stability, and it is within this region that the MRI is active as\nindicated by the presence of significant stress. Indeed, the total stress drops off rapidly near\n|z| ∼ 2H. It appears that the marginal buoyancy stability coupled with the MRI-induced\nturbulence leads to a slower rise of magnetic field until |z| ∼ 1.5–2H, where the gas then\nbecomes completely buoyantly unstable. These results are consistent with the recent ZEUS\ncalculations of Guan & Gammie (2010) with large radial extent as well as with Shi et al.\n(2010) using a version of ZEUS that includes radiation physics and total energy conservation.\nCompare, e.g., the top panel of Fig. 5 to Fig. 6 in Shi et al. (2010).\nFigure 6 shows the volume-averaged toroidal field within |z| ≤ 0.5H as a function of\ntime. The RMS field fluctuations averaged within this region are roughly a factor of ∼ 4\ntimes larger; the turbulent fluctuations dominate over the mean, but not significantly so.\nThe temporal oscillations in the mean field are apparent. The right figure shows the temporal power spectrum, revealing the dominant ∼ 10 orbit period. The oscillation amplitude\nappears to be modulated on longer timescales, ranging from tens to hundreds of orbits.\nFurthermore, the averaged radial field appears to exhibit the same 10 orbit cyclic behavior\nas the toroidal field, but with a slight temporal lag, as shown in Fig. 7. The behavior of\nthe mean radial and toroidal fields resembles the α–Ω dynamo model derived in Guan &\nGammie (2010). Specifically, they write simplified evolution equations for volume-averaged\nfield components,\ndhBy i\n|vA |\nα1\n= −qΩhBx i −\nhBy i +\nhBx i,\ndt\n2H\n2H\n\n(20)\n\ndhBx i\n|vA |\nα2\n=−\nhBx i −\nhBy i.\ndt\n2H\n2H\n\n(21)\n\n\f– 16 –\nThe first term on the right hand side of equation (20) is the background shear acting on the\nradial field. The second term is the loss of toroidal field due to buoyant rise, estimated to\nhave a characteristic buoyant velocity equal to the toroidal field Alfvén speed. The third term\nis the α-dynamo term coupling Bx to the evolution of By . Equation (21) is similar except\nthere is no shear term and the toroidal and radial field components have been flipped with\nrespect to equation (20). Also, in general, α1 6= α2 . Note that while we follow the notation\nand general approach of Guan & Gammie (2010) here, Gressel (2010) has also constructed\nan α–Ω model, which incorporates a helicity-based dynamo mechanism and reproduces the\nobserved behavior of the horizontally averaged field components.\nGuan & Gammie (2010) numerically integrated this set of equations and found a solution\nthat looks strikingly similar to the red and black curves in Fig. 7. The value of α1,2 sets\nthe oscillation frequency in the mean field; α1 = α2 = −0.01ΩH reproduces the 10 orbit\nvariability observed in stratified shearing boxes. Here we numerically integrate equation (20)\nusing the simulation data for hBx i (the red curve) and the initial condition for hBy i taken\nfrom hBy i at t = 0. We have set α1 = 0 so that the hBy i evolution is controlled entirely by\nshear and buoyancy. The result is the blue curve in the figure. The agreement between the\nactual evolution of hBy i and the α–Ω dynamo model suggests that the evolution of the mean\ntoroidal field within the mid-plane region is almost completely controlled by the shearing of\nradial field and the buoyant removal of the generated toroidal field.\nThe remaining question then is, what creates the mean radial field? In the dynamo\nmodel, the α2 term is essential, but what mechanism is responsible for α2 6= 0? The\nmost likely candidate is MRI turbulence; turbulent fluctuations create EMFs that generate poloidal field (e.g., Brandenburg et al. 1995; Davis et al. 2010; Gressel 2010), but the\ndetails of this are still not well understood.\nIn Fig. 8, we plot the time- and horizontally-averaged vertical distributions for various\nquantities in 32Num. The time average runs from orbit 100 to the end of the calculation.\nThe figure shows that the stress drops off rapidly near |z| ∼ 1.5H. The shape of the distribution is generally the same for both Maxwell and Reynolds stresses, with the Maxwell stress\nalways greater than the Reynolds stress by a factor that varies from 2.3 to 5.6 depending\non z; this factor is ∼ 4 when averaged over all z, in agreement with unstratified simulations\n(e.g., Hawley et al. 1995). The gas pressure maintains an approximately Gaussian distribution consistent with hydrostatic equilibrium, while the magnetic pressure is subthermal\nand relatively flat for all |z| . 2H. The magnetic field becomes superthermal for |z| > 2H,\nalthough its magnitude continues to decrease with height. These results are consistent with\nprevious studies of isothermal disks (e.g., Stone et al. 1996; Miller & Stone 2000; Guan &\nGammie 2010). Interestingly, the vertical structure of the turbulence is also consistent with\n\n\f– 17 –\nlocal simulations containing radiation physics (Hirose et al. 2006; Krolik et al. 2007; Hirose\net al. 2009; Flaig et al. 2010) and global simulations (Hawley et al. 2001; Fromang & Nelson 2006), though we do not observe the double peak profile in the stress as seen in the\nsimulations of Hirose et al. (2009) and Flaig et al. (2010).\nFigure 9 examines the three-dimensional structure of the magnetic field in the fully\nturbulent gas using streamline integration for 32Num at t = 100 orbits. The field strength\nis denoted by color rather than field line density. Within |z| . 2H, the field is primarily\ntoroidal but has a smaller scale, tangled structure in the x and z directions. Very near\nthe vertical boundaries, however, the field appears to develop larger poloidal components.\nUtilizing snapshots taken throughout the evolution of 32Num, we find that this is typical of\nthe saturated state, except for at t = 550 orbits, in which the field near the boundaries is\nprimarily vertical. Figure 16 of Hirose et al. (2006) shows the field in a shearing box with a\nvertical domain twice as large as 32Num. In their simulation, the field at |z| = 4H is mainly\ntoroidal while the field structure at |z| = 4H in 32Num resembles the field structure near\n|z| = 8H in their simulation. This suggests that the vertical outflow boundary conditions are\ninfluencing the field structure very near the boundaries. Away from the vertical boundaries,\nhowever, the magnetic field in 32Num appears to have a very similar structure to that in\nHirose et al. (2006).\n\n4.2.\n\nHigh and Low Turbulence States\n\nHaving established the baseline simulations without physical dissipation, we now turn\nto the main focus of our present work: the effect of ν and η on vertically stratified MRI\nturbulence.\nThe Maxwell and Reynolds stress time evolution for the simulations performed with 64\nzones per H is shown in the left panel of Fig. 10. Runs 64Rm3200Pm0.5, 64Rm800Pm0.5,\nand 64Rm3200Pm4 have decreasing turbulence levels, while turbulence is sustained at a\nstatistically constant value in the remaining simulations. Furthermore, 64Rm800Pm0.5 undergoes alternating periods of low and high stress, though the overall trend is downward\nwith time.\nThe right panel of Fig. 10 is the stress evolution for the equivalent simulations with 32\nzones per H, shown for a much longer time period than the 64 zone runs. There is considerable variability on long timescales. 32Rm3200Pm0.5 in particular exhibits alternating\nperiods of low and high stress levels, occurring on ∼ 100 − 200 orbit timescales. The more\nviscous and resistive run, 32Rm800Pm0.5, shows similar variability but on a much shorter\n\n\f– 18 –\ntimescale of & 10 orbits. Turbulence in 32Rm3200Pm2 appears to have leveled off at a\nsmaller value without any indication of regrowth to the higher state. Both 32Rm6400Pm4\nand 32Rm3200Pm4 remain at relatively high stress levels, which are very similar between\nthe two runs, likely a result of having the same Pm .\nTurning to the high and low states in 32Rm3200Pm0.5, the left panel of Fig. 11 shows\nthe vertical profile for the horizontally averaged total stress during a high turbulence state\n(solid line, time averaged from 500 to 570 orbits) and a low turbulence state (dashed line,\ntime averaged from 700 to 770 orbits). The high state has considerable stress within the\nmid-plane region (|z| . 2H), whereas in the low state, the stress is peaked near |z| ∼ 2H.\nNote that there is still a nonzero stress in the mid-plane region even during the low state.\nThe Reynolds stress is nonzero and relatively flat throughout the mid-plane, whereas the\nMaxwell stress drops off dramatically at the mid-plane. What Maxwell stress is present in\nthe low states seems to derive from the presence of residual radial and toroidal field. (This\neffect was also noted by Turner et al. (2007) in the dead zone regions of their shearing box\ncalculations). One characteristic of MRI turbulence is the ratio of the Maxwell stress to the\nmagnetic pressure, which is typically on order 0.4 (Hawley et al. 1995; Blackman et al. 2008,\nand Table 3). The vertical profile of this ratio is shown in the right panel of Fig. 11. This\nratio is between 0.3 and 0.4 for |z| . 1.5H in the high state and near |z| ∼ 2H in the low\nstate; in the mid-plane region during the low state, the ratio is much smaller and approaches\nzero.\nThese differences between the high and low states are seen in the other simulations that\nexhibit this variability (except for 32Rm800Pm0.5, in which the variability occurs on such\na short timescale that temporal averaging becomes difficult). In summary, during the high\nstate, the MRI is fully active, producing turbulent stresses for |z| . 2H. In the low state,\nthe turbulence in the mid-plane region has died down, leaving weaker Reynolds stresses.\nMRI-driven turbulence is present, however, in narrow regions near |z| ∼ 2H. This is similar\nto the behavior seen in Fleming & Stone (2003) where active layers above and below the\nmid-plane drive Reynolds stresses in the equatorial dead zone.\nIs the variability between high and low turbulence an artifact of using a relatively low\nresolution in these calculations? Several pieces of evidence suggest this is not the case. First\nof all, both resolutions for Re = 1600, Pm = 0.5 show the same variable stress behavior on\n& 10 orbit timescales. Secondly, even at 32 zones per H, dissipation coefficients play a significant role in determining the stress level, as shown above. The fact that the low resolution,\nunstratified simulations show constant saturation levels for sufficiently small η whereas vertically stratified simulations exhibit this variability for the same parameters suggests that the\nvariability is a direct result of adding in vertical gravity. Thirdly, this variability was seen in\n\n\f– 19 –\nthe simulations of Davis et al. (2010), which were run at a higher resolution of 64 zones per\nH. We note, however, that while Davis et al. (2010) used the same numerical algorithm as\nin this work, they used a different initial magnetic field configuration and vertical boundary\nconditions.\nFinally, we examine the Q values (10) using an Alfvén speed defined by (9) and a volume\naverage for all x and y and for |z| ≤ 0.5H. Figure 12 shows Qy and Qz as a function of time\nfor 32Rm6400Pm4 and 64Rm6400pm4. The results suggest that the toroidal field MRI is\nquite well-resolved, but that the vertical field MRI may be only marginally resolved for the\nlower resolution simulation. The higher resolution Q values are roughly a factor of 2 larger\nthan the lower resolution Q values, which is simply a result of the change in the grid zone\nsize; the turbulent saturation level is roughly the same between the two resolutions. This\nresult, coupled with the somewhat low Qz value, suggests that the vertical field MRI may not\nbe playing a particularly significant role in setting the saturation level in these simulations.\nIf this high-low variability is indeed a physical effect, what is its origin? First, consider\nthe space-time diagram of the horizontally averaged Bx and By for several simulations.\nFigure 13 shows the first 200 orbits of 32Rm800Pm0.5. The turbulence level decreases\ndramatically from the beginning (see also Fig. 10). This is not too surprising considering\nthat the same Rm, Pm values cause rapid decay of the turbulence in the unstratified case; the\nresistivity is large enough to damp the MRI. The space-time plots show that after this decay,\nthere is a residual magnetic field left within the mid-plane region of the disk. In particular,\nwithin |z| . 0.5H, there is a net horizontally averaged Bx < 0 and By < 0 around t = 110\norbits. The average Bx within this region remains constant for awhile, and By increases due\nto the shear of Bx , eventually flipping to By > 0. By t ∼ 130 orbits, the turbulence has\nre-emerged, and the average By rises to larger |z|. The resistivity then kills off the MRI\nagain, leading to another period of Bx shearing into By before the next period of increased\nturbulence.\nModel 32Rm3200Pm0.5 also experiences alternating high and low turbulence states,\nbut it is not immediately clear why the turbulence within the mid-plane region should\ndecay since the unstratified run with the same dissipation terms has sustained turbulence.\nAs noted earlier and in Simon & Hawley (2009), the critical Rm value below which the\nturbulence decays in unstratified shearing boxes is ∼ 1000, but here Rm = 3200. The major\ndifference between the stratified and unstratified simulations is that with vertical gravity,\nthe net magnetic field within a localized region of the domain can change due to buoyancy,\nwhereas with unstratified boxes the net toroidal field remains constant. Loss of flux can\nraise the critical Rm value (numerical resolution is also likely to have an effect); indeed, the\nunstratified simulations initialized with β = 1000 and β = 10000 fields have demonstrated\n\n\f– 20 –\nthat the critical Rm depends upon the background field strength. The loss of net flux in a\nstratified box could similarly change the critical Rm value.\nIn this simulation, the average toroidal field within the mid-plane region, hBy i, oscillates\naround zero with a period of 10 orbits. Thus, every 10 orbits or so, hBy i is conceivably weak\nenough for resistivity to kill the turbulence. However, the turbulence remains for many of\nthese 10 orbit periods. Furthermore, averaging By within some vertical distance from the\nmid-plane erases information about the field structure there; e.g., hBy i might be small but\nthere could still be strong toroidal fields of opposite polarity close to z = 0. The point is,\none cannot necessarily expect the turbulence to decay away strictly whenever hBy i drops\nbelow a certain (small) value.\nThe hBy i oscillation amplitude appears to be modulated by a longer timescale, more\non the order of ∼ 100 orbits (see, e.g., Fig. 6). This behavior is present in all simulations\nwith and without physical dissipation. This is also roughly the same timescale over which\nthe system switches between low and high states in the Rm = 3200 simulations. Comparing\nthe time evolution of hBy i for |z| ≤ 0.5H with the evolution of the total stress shows that\nthe minima in the oscillation amplitude are generally correlated with the decay of mid-plane\nturbulence. One exception is near 200 orbits in 32Rm3200Pm0.5 in which hBy i becomes\nrather small, but the turbulence remains active, though relatively weak compared to the\nfully active state. This correlation implies that if the mean toroidal field near the mid-plane\nremains sufficiently small for some time, resistivity can overwhelm the MRI and cause decay.\nEvidently, there exists a critical Rm below which the turbulence experiences longtimescale variability; this critical value is Rm < 6000. We carry out two more stratified\nsimulations with Rm ∼ 6000 but different Pm values in order to further test this hypothesis.\nThe first simulation is 32Rm6400Pm8; thus, Rm = 6400, and Pm is relatively large. The\nmid-plane turbulence is sustained over a long time, nearly 330 orbits, without any sign of\ndecay. The dissipation coefficients of the second simulation, 32Rm6250Pm1, are chosen to\nmatch the relatively high Rm, low Pm simulation that decays in the zero net flux shearing\nbox (see Fromang et al. 2007; Simon & Hawley 2009). This simulation also remains in the\nhigh state for nearly 330 orbits.\nIf the dissipation is large enough to cause MRI-driven turbulence to decay, what leads\nto its reactivation after & 100 orbits of time? Figure 14 shows the space-time plot of Bx and\nBy for a 300 orbit period in 32Rm3200Pm0.5 during which the mid-plane turbulence dies\nout and eventually returns. For clarity, we also plot the volume-averaged horizontal field,\nhBx i and hBy i, where the average is done for all x and y and for |z| ≤ 0.5H. During the low\nstate, there is a small net radial field that remains in the mid-plane region and generates By\nthrough shear. The sign of the net hBx i reverses and with it the sign of ∂hBy i/∂t. The last\n\n\f– 21 –\nsuch switch in the low state occurs around 750 orbits after which hBy i continues to grow up\nuntil 790 orbits. At this point, the 10 orbit period oscillations resume.\nFigures 13 and 14 suggest that it is the growth of By due to shear that periodically\nreactivates the MRI in the mid-plane. Indeed, during the low states, the poloidal fields are\nsufficiently weak that the most unstable wavelengths of the radial and vertical field MRI are\nvery under-resolved; Qx . 1 and Qz . 1 for both 32Rm800Pm0.5 and 32Rm3200Pm0.5. (Q\nwas calculated as a function of time using equations (9) and (10).) Considering the toroidal\nfield, however, we find that Qy is well above the marginal resolution limit when the mid-plane\nturbulence starts to decay. In the low states of 32Rm800Pm0.5, Qy ∼ 10 − 20 occasionally\ndropping to Qy = 6. The typical Qy values for the low states of 32Rm3200Pm0.5 are similar\nbut somewhat smaller. Of course when studying the behavior of the MRI in a situation where\nthe Q values are small, one is in a regime where numerical resolution is likely to matter.\nThe specific behavior of the disk in the low state might be different at higher resolution, but\nshearing of radial into toroidal field is itself not so dependent on resolution. Thus, Q may\nwell play a role in determining when the MRI is reactivated, but not how it is reactivated.\nAs a further test, we carry out two additional experiments. First, we take the state\nof the gas in 32Rm3200Pm2 at t = 150 orbits when the stress levels are decreasing and\nthe average of By within |z| ≤ 0.5H, hBy i = 5.9 × 10−6 , is relatively small compared to\nthe oscillation amplitude of hBy i in the high state, which is ∼ 5 × 10−5 . We restart this\nsimulation and add a net By = 8.9 × 10−5 into the region |z| ≤ 0.5H, which corresponds to\na toroidal β ≈ 126 (using β defined with the initial mid-plane gas pressure Po ). This run is\n32Rm3200Pm2 By+ (see Table 2). Figure 15 shows the subsequent evolution of the stress\nalong with the stress evolution of 32Rm3200Pm2. Not only does the mid-plane turbulence\nreturn, but the system undergoes episodic transitions between low and high states on ∼ 100\norbit time scales, as in 32Rm3200Pm0.5.\nIn a second experiment, we initialize a stratified shearing box with all the same parameters as in 32Num but\np with an initially very 6 weak radial magnetic field. Specifically, for\n|z| ≤ 0.5H, Bx = − 2Po /βx where βx = 10 . This field strength is very under-resolved;\nthe Qx value is 0.2, and the radial field MRI will not be significant. Figure 16 shows the\nspace-time diagrams of horizontally averaged Bx and By . The weak radial field is sheared\ninto toroidal field that grows linearly in time until it reaches a sufficient strength to activate\nthe MRI. The onset of MRI turbulence is rapid, and once the MRI sets in, the subsequent\nbehavior is very similar to the other vertically stratified MRI simulations; there are rising\nmagnetic field structures, dominated by the toroidal component, and the period of oscillations in the mean field is ∼ 10 orbits. Note that this experiment is not an exact imitation of\nthe low state in our simulations; there is no MRI activity near |z| ∼ 2H initially. However,\n\n\f– 22 –\nthis calculation demonstrates that shear amplification of a weak radial field can eventually\nlead to turbulence and move the system to the high state.\nAll of the simulations in which turbulence in the mid-plane sets in after a period of\nquiescence show the presence of a net radial field in the mid-plane during the low state.\n32Rm3200Pm2, however, is the only simulation that does not show the re-emergence of the\nmid-plane MRI, despite over 1000 orbits of integration. An examination of the mid-plane\nregion (up to |z| . H) in the low state of this run shows that the residual radial field is\nweaker than in the low states of the other simulations. If this radial field would remain\nconstant in time, the toroidal field would continually strengthen to the point of reactivating\nthe MRI. However, hBx i continues to change sign even in the absence of turbulence, though\nwith a period of many hundreds of orbits. That is, hBx i oscillates about zero but with a\nvery small amplitude. hBy i similarly oscillates around zero and never reaches a sufficient\namplitude to reactivate the MRI, and the simulation remains in the low state.\nIn fact, hBx i oscillates about zero in all of our simulations, even in the low states (see\ne.g., Fig. 14). The various space-time diagrams suggest horizontal field migrates toward the\nmid-plane region from near |z| ∼ 2H where MRI activity is on-going. The oscillations in\nthe mid-plane field components are a direct result of the oscillations previously observed\nin vertically stratified MRI turbulence. It is not entirely clear, however, what causes the\nfield to migrate to the mid-plane. Does it diffuse there or is it carried downward by some\nsort of large scale flow? The shearing box calculations of Turner et al. (2007) and Turner &\nSano (2008), which include Ohmic resistivity via a treatment of ionization chemistry, suggest\nthat turbulent diffusion from the active layers is responsible for the field migration. While\nour simulations include a simpler prescription for resistivity, it is conceivable that a similar\nprocess is at work here. These issues will be addressed in future work.\nTo summarize the results for transitions between high and low states, we find that for\nsufficiently small Rm, MRI turbulence within the mid-plane region can decay away, in part\nbecause of loss of net flux due to buoyancy. Residual net radial field remains and subsequently creates toroidal field from shear. Once this toroidal field reaches a sufficiently large\namplitude, the MRI is reactivated, and the turbulence is sustained for some duration until\nit decays again, repeating the pattern. In other words, the α–Ω dynamo, seen in stratified simulations without resistivity, continues to operate in resistive simulations where the\nmid-plane MRI is suppressed. The dynamo is key to reactivation of MRI-driven turbulence.\nThis behavior appears to be independent of the Pm values we have used, except for near\nRm = 3200; 32Rm3200Pm4 remains in the high state, whereas 32Rm3200Pm2, 32Rm3200Pm2 By+,\nand 32Rm3200Pm0.5 do not. However, in the higher resolution runs, 64Rm3200Pm4 and\n64Rm3200Pm0.5 show decay but 64Rm3200Pm2 appears to be sustained (though again,\n\n\f– 23 –\nthese simulations were not integrated very far). While Pm may play a role here, the line\nbetween sustained and highly variable stress levels is unlikely to be hard and fast, and many\nfactors probably contribute to the nature of the turbulence near this Rm value.\nComparing our results with those of Davis et al. (2010), we note that the largest Rm\nused in their simulations was Rm = 3200, consistent with the largest critical Rm observed\nin our simulations. Secondly, an examination of the space-time data from their simulation\nwith Rm = 1600, Pm = 2 (kindly provided by the authors) shows the same behavior as\nwe have observed here; a net radial field remains within the mid-plane region after decay,\nshearing into toroidal field, from which the MRI is reactivated within this region.\nInterestingly, Turner et al. (2007) briefly notes that the toroidal field in the dead zone of\nsome of their highly resistive simulations can occasionally become strong enough to reactivate\nturbulence there, after which the MRI is rapidly switched off again due to Ohmic dissipation.\nThese simulations are consistent with our highest resistivity (Rm = 800) simulations, in\nwhich turbulence occurs in short outbursts rather than through a transition to a long-lived\nhigh state, as is the case at lower resistivities.\nLastly, we examine the topology of the magnetic field in the shearing box during\nthe low state. Figure 17 shows the equivalent information as Fig. 9, but for orbit 550 of\n32Rm3200Pm2 By+. For |z| & 2H, the field remains mainly toroidal but with noticeable\nexcursions from being purely toroidal, resembling the field structure in this region during the\nhigh state. Within 2H, the field is almost completely toroidal, and any small poloidal field\npresent within this region is not visible in this image. We also examined the azimuthally\naveraged poloidal field structure in several snapshots of this run. We found that the structure of the field was different, depending on which snapshot we examined. At some times,\nthe poloidal field within 2H is almost completely radial, with very little vertical field. At\nother times, the vertical and radial fields are comparable in size such that the field takes on\na more loop-like structure.\n\n4.3.\n\nThe Prandtl Number Effect on Sustained Turbulence\n\nIn this section, we investigate how Pm affects angular momentum transport in simulations that do not exhibit the high-low variability. Figure 18 shows the volume-averaged\nstress levels for these simulations normalized by the gas pressure. The volume average is\ndone for all x and y and for |z| ≤ 2H. The figure shows a general increase in the turbulence\nlevels with Pm , but there is also significant time variability in the stress. As a result, the\ncurves overlap at certain times, much more so than for unstratified turbulence (see Fig. 2).\n\n\f– 24 –\nFigure 19 displays the time-averaged α values as a function of Pm for the unstratified\n(left panel) and stratified simulations (right panel). The time average for the unstratified\nsimulations is the same as in Fig. 3, from orbit 120 to the end of the calculation, and for the\nstratified simulations, this average is done from orbit 150 until the end of the simulation.\nThe error bars denote one standard deviation about the temporal average of the numerator\nin α.1 While there is a clear dependence of α on Pm in the stratified simulations, it is not\nas steep as in the unstratified simulations. Taking a linear fit in log-log space, and assuming\nα ∝ Pmδ , δ = 0.54 for the unstratified runs (from § 3), and δ = 0.25 for the stratified\ncalculations. In addition, the time variability is significantly larger in the stratified runs\nthan in the unstratified case.\nFigure 20 is the vertical profile of the time- and horizontally-averaged total stress for\nthe sustained turbulence runs. The time average was done from orbit 150 to the end of\neach simulation. Increasing Pm increases the stress at nearly all z, and in all cases the stress\ndrops off dramatically above |z| ∼ 1.5H, consistent with the baseline simulations. Run\n32Rm6400Pm8 appears to have a sharper peak in the stress profile near z = 0, compared\nto a flatter stress profile for |z| . 1.5H in the other simulations. Using different temporal\naveraging windows for the averaged stress profiles produces the same general result; the\nstress increases with Pm and 32Rm6400Pm8 has a sharper peak near the mid-plane. In some\ncases, however, the stress does not necessarily increase monotonically with Pm at |z| & 1.5H.\nFinally, we examined the vertical profile of the same quantities as in Fig. 8. We found that\nthese profiles in the sustained turbulence simulations are all very similar to each other and\nto 32Num; the general vertical structure of the disk does not appear to be sensitive to Pm .\nIn summary, where the MRI is operating within a stratified disk, increasing Pm leads to\nan increase in stress, consistent with the behavior seen in unstratified simulations.\n\n5.\n\nSummary and Discussion\n\nWe have carried out a series of shearing box simulations with the Athena code to study\nMRI-driven turbulence with both vertical gravity and physical dissipation. Until the recent\nwork of Davis et al. (2010), the role of physical dissipation in setting the level of angular\nmomentum transport had been mainly studied in the context of unstratified simulations.\nAs Davis et al. (2010) has shown, however, stratified simulations reveal new behaviors.\nTurbulence that decays in unstratified simulations is sustained in the presence of vertical\n1\n\nThe fluctuations in the volume-averaged pressure are very small and do not contribute significantly to\nthe variability.\n\n\f– 25 –\ngravity and with large amplitude, ∼ 100 orbit fluctuations in the stress in some cases.\nOur primary goal in this study has been a deeper investigation into the roles of viscosity\nand resistivity in MRI-driven turbulence using simulations that more accurately resemble astrophysical disk systems. To this end, we have implemented more realistic, outflow boundary\nconditions in the vertical direction (Davis et al. (2010) use vertically periodic boundaries),\nand we have run the simulations for significantly longer integration times than is usual for\nshearing box calculations, in order to study long timescale effects. From these simulations\nwe observe the following: 1) MRI turbulence is largely confined within 2 H of the equator.\nAbove that height, the magnetic field becomes completely buoyantly unstable. 2) The mean\nfield within the MRI-active portion of the disk evolves in a manner consistent with an α–Ω\ndynamo. 3) Stratified disks show an increase in stress with increasing Pm as previously seen\nin unstratified shearing boxes. 4) For Rm below some critical value, MRI turbulence in the\nmid-plane can be quenched putting the disk into a \"low\" state. 5) While in the low state, the\ncontinued action of the dynamo can raise the toroidal field to a level at which the mid-plane\nMRI is reactivated, switching the disk back to a \"high\" state.\nThe first two of these results are consistent with previous stratified shearing box simulations and do not appear to be altered by the inclusion of physical dissipation. For |z| . 2H\nin sustained turbulence simulations, the time- and horizontally-averaged turbulent energies\nand stresses are roughly constant with height, the magnetic field is only marginally stable to\nbuoyancy, and β > 1. The predominantly toroidal field rises slowly away from the midplane.\nAbove this height, the turbulence is significantly weaker, β < 1, and the field is completely\nbuoyantly unstable, rising at a faster rate than for |z| . 2H. These results, which are consistent with the ZEUS-based results of Guan & Gammie (2010) and Shi et al. (2010), suggest\nthat there are two separate vertical regions in these disks.\nAs a practical matter, this result suggests that to capture the behavior of the vertically\nstratified MRI, one need not go much beyond ±2H from the mid-plane. This is confirmed\nby a few additional simulations in which we extended the outer boundary to 6H from the\nmid-plane instead of 4H. We found no difference in the vertical structure of the disk, the\nvolume averaged stress levels, or the temporal variability of the system.\nConsistent with previous stratified shearing box simulations (e.g., Stone et al. 1996;\nHirose et al. 2006; Guan & Gammie 2010; Shi et al. 2010; Gressel 2010; Davis et al. 2010)\nand global simulations (Fromang & Nelson 2006; Dzyurkevich et al. 2010; O'Neill et al. 2010),\nwe found a strong 10 orbital period variability in the mean magnetic field within the midplane region. This variability is characterized by the buoyant rise of predominantly toroidal\nfield from the mid-plane region, after which a field of opposite sign takes its place at the\nmid-plane. The evolution of this toroidal field can be well-modeled by a simple α–Ω mean\n\n\f– 26 –\nfield dynamo where the shear of radial field into toroidal field and the subsequent buoyant\nremoval of toroidal field from the mid-plane dominate the evolution.\nIn addition to the dynamo period of roughly 10 orbits, we also observe a longer ∼ 100\norbit timescale variability. This behavior has not previously been reported, and while we do\nnot know its origin, there is evidence that it plays a role in another novel effect resulting from\nvertical gravity: high and low states. For disks that are sufficiently resistive, i.e., have low\nenough Rm, MRI turbulence decays near the mid-plane leading to a quiescent period that\nis eventually followed by regrowth of the MRI in this region. The period of this variability\nis on a similar timescale to the long-period variability seen in all the stratified simulations.\nThe transition to a low state occurs when the mean toroidal field in the mid-plane region\nis reduced below some critical value, presumably by buoyancy. Resistivity dominates over\nthe MRI and the turbulence decays. An extremely weak mean radial field remains however.\nAlthough this mean radial field itself can vary during the low state, it creates toroidal field\nthrough shear. Shear amplification is largely unaffected by resistivity. Once the toroidal\nfield reaches a particular strength, the mid-plane MRI is re-energized, and the disk becomes\nfully turbulent again, returning to the high state.\nThis behavior is not particularly sensitive to Pm and appears to be the same as that\nreported by Davis et al. (2010). Thus, it is not likely to be related to the dynamo issue\nof Pm ∼ 1 in zero net magnetic flux shearing boxes, which Davis et al. (2010) specifically\ninvestigated. Instead, it appears to be a robust behavior that emerges whenever the disk is\nsufficiently resistive. The critical Rm below which the high-low variability exists is 3200 .\nRmc . 6000. If Rm > Rmc , the turbulence remains sustained for the dissipation parameters\nexplored here, and averaged stress increases with Pm for all z, though with a less steep\ndependence of α on Pm compared to unstratified simulations.\nBecause we are dealing with the decay of turbulence and the behaviors of weak magnetic\nfields, the values of properties such as Rmc may well be resolution dependent. However,\ngiven the long evolution times probed here, it was necessary to limit the resolution to 32\ngrid zones per H. Before running the vertically stratified simulations, we executed a series of\nunstratified calculations at this resolution to test whether or not the MRI and the effects of\nphysical dissipation would likely be resolved. We found that the effect of physical dissipation\non MRI saturation is reasonably well converged at 32 zones per H: α increases with Pm at\nthis resolution, although with a steeper dependence than at higher resolution, and α is\nroughly constant with resolution above 32 zones per H for a given set of Re, Rm, and Pm\nvalues. This in itself is an interesting result since it shows that the higher resolutions used in\nFromang et al. (2007), Lesur & Longaretti (2007), and Simon & Hawley (2009) may not be\nnecessary to capture the general effects of physical dissipation. It is also in agreement with\n\n\f– 27 –\nthe recent vertically stratified shearing boxes of Flaig et al. (2010) that included radiation\nphysics; they found that only ∼ 30 zones per H in the vertical dimension are required to\ngain a reasonable representation of the turbulent saturation level. Thus, while the exact\nvalue of Rmc may change at higher resolution, the general effects of physical dissipation on\nthe vertically stratified MRI are likely captured at the resolutions we used.\nWhat do these results imply for the MRI and its application to astrophysical disks?\nFirst, it had been previously appreciated that sufficient resistivity could cause a transition\nfrom a turbulent (\"high\") state to a non-turbulent (\"low\") state. Here we have found that\na process resembling an α–Ω dynamo can accomplish the reverse and re-establish the high\nstate. The transition occurs on longer timescales than the ∼ 10 orbit associated with the\ndynamo. This temporal variability could have potential applications for several types of\naccretion disks. Protoplanetary disks have large regions of low ionization gas, including a\ndead zone layer (Gammie 1996) where resistivity is too high to sustain the MRI. Dwarf\nnova disks also contain regions of partial ionization, and it is intriguing that the Rm values\nin these systems are on the same order as the critical Rm ∼ 103 for the decay/regrowth\nbehavior (Gammie & Menou 1998). Even some regions of AGN disks may have moderately\nhigh resistivity, though typical Rm values are probably larger than those in dwarf nova\nsystems because of the larger disk scale height (Menou & Quataert 2001).\nIt is tempting to associate the peaks and dips of turbulent activity in our simulations\nwith the outbursts and variability observed in these systems. Of course, there remains much\nwork before such a connection can be substantiated. In particular, more realistic simulations\nwill have η (and ν) that depend on temperature and density, rather than being constant\nthroughout the disk. Furthermore, the influence of other non-ideal MHD effects on the MRI\nneeds more work. The Hall effect is often times just as important as Ohmic resistivity in\nastrophysical environments (Wardle 1999; Balbus & Terquem 2001; Balbus 2003), and while\nsimulations including both Hall and Ohmic terms have been carried out by Sano & Stone\n(2002a) and Sano & Stone (2002b), there remains more parameter space to explore and\nphysics to include. Lastly, we note that if η is so large that no MRI modes are present, there\nwould be no temporal variability and the turbulence would be completely quenched.\nIn disks that have Rm above the critical value, the MRI-driven turbulence operates\ncontinuously. Nevertheless, as previously seen in unstratified simulations, dissipation terms\ncan have an impact: the stress level increases with increasing Pm . This may be relevant to\nhot, fully ionized disk gas such as in X-ray binaries and some regions of AGN disks where Pm\nhas a strong temperature dependence (Balbus & Henri 2008). While our simulations show\nthat angular momentum transport increases with Pm , the Re and Rm values of such disks\nare significantly larger than the values probed here. Whether or not the Pm effect continues\n\n\f– 28 –\ninto the large Re/Rm regime remains very much an open area of research.\nFinally, one particular field geometry that has not been explored here or in most vertically stratified local simulations is that of a net vertical field. These simulations are quite\nchallenging; the channel mode dominates the solution (Miller & Stone 2000; Latter et al.\n2010), leading to very strongly magnetized regions of the disk that can often times cause the\nnumerical integration techniques to fail (but see Suzuki & Inutsuka (2009), in which a stable\nevolution was produced).\nIn summary, we have explored the spatial and temporal behavior of the MRI in the\npresence of both vertical gravity and physical dissipation. We find that for moderately\nresistive simulations, the disk cycles between states of low and high turbulent stresses, and\nthat orbital shear of radial field into toroidal field is essential to both this behavior as well as\nthe temporal variability of sustained turbulence. When sustained, the stress increases with\nPm , in agreement with unstratified simulations. Our calculations are an important stepping\nstone towards more realistic simulations that include temperature-dependent ν and η.\nWe thank Xiaoyue Guan, Juilan Krolik, Mitch Begelman, Phil Armitage, and Rosalba\nPerna for useful discussions and suggestions regarding this work, and we are very grateful to\nShane Davis, Jim Stone and Martin Pessah for providing us with some of the data from their\npaper. This material was supported by NASA Headquarters under the NASA Earth and\nSpace Science Fellowship Program - Grant NNX08AX06H; NASA grants NNX09AG02G,\nNNX09AB90G, and NNX09AD14G; by the NSF under grants AST-0807471 and AST–\n0908869; and by a Virginia Space Grant Consortium (VSGC) fellowship. The simulations\nwere run on the TACC Sun Constellation Linux Cluster, Ranger, supported by the National\nScience Foundation.\n\nA.\n\nNumerical Methodology\nA.1.\n\nIntegration\n\nThe algorithms for solving the shearing box equations (1)–(3) and the specific implementation of those algorithms within the Athena code are described in Stone & Gardiner\n(2010); here we provide a brief summary of the numerical methods detailed in that paper.\nThe left hand sides of the equations are solved via the standard Athena CTU fluxconservative algorithm (Stone et al. 2008). The gravitational and Coriolis source terms in\nthe momentum equation are evolved via a combination of an unsplit method consistent\n\n\f– 29 –\nwith CTU and Crank-Nicholson differencing constructed to conserve energy exactly within\nepicyclic motion (Gardiner & Stone 2005; Stone & Gardiner 2010).\nFor our simulations in which the radial size of the shearing box is a scale height, H, the\nvelocity is initialized with a background shear flow given by\nvy = −qΩx.\n\n(A1)\n\nFor sufficiently large x domains, this velocity can become supersonic (orbital velocities are,\nin general, supersonic in accretion disks). For large x domains, the Courant limit on the\ntimestep can become significant. Furthermore, the background shear flow can lead to a\nsystematic change in truncation error with radial position in the box, which in turn introduces\npurely numerical features in the radial density and stress profiles (Johnson et al. 2008).\nHence, for large radial domain simulations we utilize an orbital advection scheme, which\nsubtracts off this background shear flow and evolves it separately from the fluctuations in\nthe fluid quantities (Masset 2000; Johnson et al. 2008; Stone & Gardiner 2010).\n\nA.2.\n\nBoundary Conditions\n\nIn the shearing box, the y boundary condition is periodic. The x boundary condition is\nshearing-periodic (Hawley et al. 1995; Stone & Gardiner 2010): quantities are reconstructed\nin the ghost zones from appropriate zones in the physical domain that have been shifted along\ny to account for the relative shear from one side of the box to the other. In Athena, this\nreconstruction step is performed on the fluid fluxes, and then the ghost zone fluid variables are\nupdated via these reconstructed fluxes. The order of this reconstruction matches the spatial\nreconstruction in the physical grid, e.g., 3rd order reconstruction of the ghost zone fluxes is\ndone when the PPM spatial reconstruction is employed. Furthermore, the y momentum is\nadjusted to account for the shear across the x boundaries as fluid moves out one boundary\nand enters at the other. The y component of the electromotive force (EMF) is reconstructed\nat the radial boundaries to ensure precise conservation of net vertical magnetic flux (Stone\n& Gardiner 2010).\nIn unstratified shearing box simulations the z boundary is periodic. This same boundary\ncondition has been employed in stratified boxes as well (e.g. Davis et al. 2010). For our\nsimulations, we use an outflow boundary condition instead. The density ρ is extrapolated into\nthe ghost zones based upon an isothermal, hydrostatic equilibrium, using the last physical\nzone as a reference. Therefore, for the upper vertical boundary, the ρ value in grid cell k is\n\n\f– 30 –\n\n\u0012\n\u0013\nz(k)2 − z(ke)2\nρ(k) = ρ(ke)exp −\n,\nH2\n\n(A2)\n\nwhere ke refers to the last physical zone at the upper boundary. An equivalent expression holds for the lower vertical boundary. This extrapolation provides hydrostatic support\nagainst the opposing vertical gravitational forces, which are also applied in the ghost zones.\nAll velocity components, Bx , and By are copied into the ghost zones from the last physical\nzone assuming a zero slope extrapolation. If the sign of vz in the last physical zone is such\nthat an inward flow into the grid is present, vz is set to zero in the ghost zones. Finally, the\nghost zone values of Bz are calculated from Bx and By to ensure that ∇ * B = 0 within the\nghost zones.\n\nA.3.\n\nPhysical Dissipation\n\nViscosity and resistivity are added via operator splitting; the fluid variables updated\nfrom the main integration (§ A.1) are used to calculate the viscous and resistive terms. The\nviscosity term is calculated via the divergence of the viscous stress tensor, equation (4), and\nthe resistive term is included as an additional EMF within the induction equation (3). This\nformulation allows us to discretize the viscous and resistive terms in a flux-conservative and\nconstrained-transport manner, consistent with the Athena algorithm. Note that the resistive\ncontribution to the y EMF must also be reconstructed at the shearing-periodic boundaries\nin order to preserve Bz precisely.\nThe addition of viscosity and resistivity places an additional constraint on the timestep,\n\u0012\n\u0013\n∆2\n∆2\n∆t = MIN ∆tCTU , Co , Co\n,\n4ν\n4η\n\n(A3)\n\nwhere ∆tCTU is the timestep limit from the main integration algorithm (see Stone et al. 2008),\nCo = 0.4 is the CFL number, and ∆ is the minimum grid spacing, ∆ = MIN(∆x, ∆y, ∆z).\nNote that in most of our simulations ν and η are sufficiently small that they do not limit\nthe timestep.\n\nREFERENCES\nBalbus, S. A. 2003, ARA&A, 41, 555\n\n\f– 31 –\nBalbus, S. A., & Hawley, J. F. 1991, ApJ, 376, 214\n-. 1998, Reviews of Modern Physics, 70, 1\nBalbus, S. A., & Henri, P. 2008, ApJ, 674, 408\nBalbus, S. A., & Terquem, C. 2001, ApJ, 552, 235\nBlackman, E. G., Penna, R. F., & Varnière, P. 2008, New Astronomy, 13, 244\nBrandenburg, A., Nordlund, A., Stein, R. F., & Torkelsson, U. 1995, ApJ, 446, 741\nColella, P. 1990, JCP, 87, 171\nColella, P., & Woodward, P. R. 1984, JCP, 54, 174\nDavis, S. W., Stone, J. M., & Pessah, M. E. 2010, ApJ, 713, 52\nDzyurkevich, N., Flock, M., Turner, N. J., Klahr, H., & Henning, T. 2010, A&A, 515, A70\nEvans, C. R., & Hawley, J. F. 1988, ApJ, 332, 659\nFlaig, M., Kley, W., & Kissmann, R. 2010, MNRAS, 409, 1297\nFleming, T., & Stone, J. M. 2003, ApJ, 585, 908\nFleming, T. P., Stone, J. M., & Hawley, J. F. 2000, ApJ, 530, 464\nFromang, S. 2010, A&A, 514, L5\nFromang, S., & Nelson, R. P. 2006, A&A, 457, 343\nFromang, S., & Papaloizou, J. 2006, A&A, 452, 751\n-. 2007, A&A, 476, 1113\nFromang, S., Papaloizou, J., Lesur, G., & Heinemann, T. 2007, A&A, 476, 1123\nGammie, C. F. 1996, ApJ, 457, 355\nGammie, C. F., & Menou, K. 1998, ApJ, 492, L75\nGardiner, T. A., & Stone, J. M. 2005, JCP, 205, 509\n-. 2008, JCP, 227, 4123\nGoodman, J., & Xu, G. 1994, ApJ, 432, 213\n\n\f– 32 –\nGressel, O. 2010, MNRAS, 404\nGuan, X., Gammie, C. F., Simon, J. B., & Johnson, B. M. 2009, ApJ, 694, 1010\nGuan, X., & Gammie, C. F. 2010, arXiv:1012.3789\nHawley, J. F., Balbus, S. A., & Stone, J. M. 2001, ApJ, 554, L49\nHawley, J. F., Gammie, C. F., & Balbus, S. A. 1995, ApJ, 440, 742\n-. 1996, ApJ, 464, 690\nHirose, S., Krolik, J. H., & Blaes, O. 2009, ApJ, 691, 16\nHirose, S., Krolik, J. H., & Stone, J. M. 2006, ApJ, 640, 901\nIlgner, M., & Nelson, R. P. 2008, A&A, 483, 815\nJohnson, B. M., Guan, X., & Gammie, C. F. 2008, ApJS, 179, 553\nKrolik, J. H., Hirose, S., & Blaes, O. 2007, ApJ, 664, 1045\nLandau, L. D., & Lifshitz, E. M. 1959, Course of theoretical physics\nLatter, H. N., Fromang, S., & Gressel, O. 2010, MNRAS, 758\nLesur, G., & Longaretti, P.-Y. 2007, MNRAS, 378, 1471\nLongaretti, P.-Y., & Lesur, G. 2010, A&A, 516, 51\nMasset, F. 2000, A&AS, 141, 165\nMenou, K., & Quataert, E. 2001, ApJ, 552, 204\nMignone, A. 2007, JCP, 225, 1427\nMiller, K. A., & Stone, J. M. 2000, ApJ, 534, 398\nMiyoshi, T., & Kusano, K. 2005, JCP, 208, 315\nNewcomb, W. A. 1961, PhFl, 4, 391\nNoble, S. C., Krolik, J. H., & Hawley, J. F. 2010, ApJ, 711, 959\nOishi, J. S., & Low, M.-M. M. 2009, ApJ, 704, 1239\nOishi, J. S., Low, M.-M. M., & Menou, K. 2007, ApJ, 670, 805\n\n\f– 33 –\nO'Neill, S. M., Reynolds, C. S., Miller, M. C., & Sorathia, K. A. 2010, arXiv, astro-ph.GA\nPessah, M. E., kwan Chan, C., & Psaltis, D. 2007, ApJ, 668, L51\nSano, T., & Inutsuka, S.-I. 2001, ApJ, 561, L179\nSano, T., Inutsuka, S.-I., & Miyama, S. M. 1998, ApJ, 506, L57\nSano, T., Inutsuka, S.-I., Turner, N. J., & Stone, J. M. 2004, ApJ, 605, 321\nSano, T., & Stone, J. M. 2002a, ApJ, 570, 314\n-. 2002b, ApJ, 577, 534\nShakura, N. I., & Syunyaev, R. A. 1973, A&A, 24, 337\nShi, J., Krolik, J. H., & Hirose, S. 2010, ApJ, 708, 1716\nSimon, J. B., & Hawley, J. F. 2009, ApJ, 707, 833\nSimon, J. B., Hawley, J. F., & Beckwith, K. 2009, ApJ, 690, 974\nStone, J. M., & Gardiner, T. A. 2010, ApJS, 189, 142\nStone, J. M., Gardiner, T. A., Teuben, P., Hawley, J. F., & Simon, J. B. 2008, ApJS, 178,\n137\nStone, J. M., Hawley, J. F., Gammie, C. F., & Balbus, S. A. 1996, ApJ, 463, 656\nSuzuki, T. K., & Inutsuka, S.-I. 2009, ApJ, 691, L49\nTurner, N. J., Carballido, A., & Sano, T. 2010, ApJ, 708, 188\nTurner, N. J., Sano, T., & Dziourkevitch, N. 2007, ApJ, 659, 729\nTurner, N. J., & Sano, T. 2008, ApJ, 679, L131\nWardle, M. 1999, MNRAS, 307, 849\nZiegler, U., & Rüdiger, G. 2001, A&A, 378, 668\n\nThis preprint was prepared with the AAS LATEX macros v5.2.\n\n\f– 34 –\n\nTable 2. Vertically Stratified Simulations\nLabel\n\nRe\n\nRm\n\nPm\n\nResolution\n(zones per H)\n\nIntegration time\ntstop − tstart (orbits)\n\nDescription\n\n32Num\n32Rm800Pm0.5\n32Rm3200Pm0.5\n32Rm3200Pm2\n32Rm3200Pm4\n32Rm6250Pm1\n32Rm6400Pm8\n32Rm6400Pm4\n32Rm3200Pm2 By+\n32ShearBx\n64Num\n64Rm800Pm0.5\n64Rm3200Pm0.5\n64Rm3200Pm2\n64Rm3200Pm4\n64Rm6400Pm4\n\n–\n1600\n6400\n1600\n800\n6250\n800\n1600\n1600\n–\n–\n1600\n6400\n1600\n800\n1600\n\n–\n800\n3200\n3200\n3200\n6250\n6400\n6400\n3200\n–\n–\n800\n3200\n3200\n3200\n6400\n\n–\n0.5\n0.5\n2\n4\n1\n8\n4\n2\n–\n–\n0.5\n0.5\n2\n4\n4\n\n32\n32\n32\n32\n32\n32\n32\n32\n32\n32\n64\n64\n64\n64\n64\n64\n\n1058\n263\n863\n1082\n487\n337\n325\n488\n584\n45\n159\n108\n83\n80\n84\n80\n\nnum. dissipation\n–\n–\n–\n–\n–\n–\n–\nBy added at 150 orbits\nnet Bx within midplane\nnum. dissipation\n–\n–\n–\n–\n–\n\n\f0.025\n0.0061\n0.069\n0.0069\n0.058\n0.0032\n0.024\n0.010\n0.0078\n0.0061\n4.18\n0.37\n\n0.033\n0.0071\n0.089\n0.0084\n0.077\n0.0039\n0.027\n0.011\n0.0089\n0.0068\n4.58\n0.37\n\n32Rm6400Pm8a\n\naveraged for |z| ≤ 2H and time averaged from orbit 50 to the end of the simulation.\n\n0.018\n0.0046\n0.050\n0.0051\n0.043\n0.0024\n0.020\n0.0085\n0.0062\n0.0052\n3.87\n0.36\n\n32Rm6400Pm4a\n\naveraged for |z| ≤ 2H and time averaged from orbit 150 to the end of the simulation.\n\n0.023\n0.0051\n0.069\n0.0059\n0.060\n0.0028\n0.021\n0.0088\n0.0066\n0.0057\n4.55\n0.34\n\n32Rm6250Pm1a\n\nb Volume\n\n0.022\n0.0058\n0.059\n0.0066\n0.049\n0.0031\n0.024\n0.010\n0.0079\n0.0059\n3.77\n0.37\n\nhh−Bx By ii/hhP ii\nhhρvx δvy ii/hhP ii\nhhB 2 /2ii/hhP ii\nhhBx2 /2ii/hhP ii\nhhBy2 /2ii/hhP ii\nhhBz2 /2ii/hhP ii\nhhρδv 2 /2ii/hhP ii\nhhρvx2 /2ii/hhP ii\nhhρδvy2 /2ii/hhP ii\nhhρvz2 /2ii/hhP ii\nhh−Bx By ii/hhρvx δvy ii\nhh−Bx By ii/hhB 2 /2ii\n\n32Rm3200Pm4a\n\na Volume\n\n32Numa\n\nQuantity\n0.018\n0.0044\n0.045\n0.0061\n0.036\n0.0030\n0.020\n0.0079\n0.0070\n0.0047\n4.03\n0.40\n\n0.027\n0.0060\n0.074\n0.0079\n0.062\n0.0040\n0.025\n0.010\n0.0084\n0.0065\n4.47\n0.36\n\n64Numb 64Rm3200Pm2a\n\nTable 3. Saturation Characteristics for Sustained Turbulence Runs\n\n0.025\n0.0055\n0.063\n0.0072\n0.052\n0.0035\n0.022\n0.0094\n0.0075\n0.0055\n4.60\n0.40\n\n64Rm6400Pm4a\n\n– 35 –\n\n\f– 36 –\n\nFig. 1.- Time- and volume-averaged stress parameter α as a function of grid zones per H in\nthe unstratified SZ simulations; α ≡ hhρvx δvy −Bx By ii/hhP ii, where the average is calculated\nover the entire simulation domain and from 20 orbits to the end of the simulation. Only\nsimulations with sustained turbulence are plotted. The squares are runs with Rm = 12800,\nPm = 16; asterisks are Rm = 12500, Pm = 4; and triangles are Rm = 25600, Pm = 2. By 32\nzones per H, the α values appear to be relatively close to the higher resolution values.\n\n\f– 37 –\n\nFig. 2.- Volume-averaged total stress normalized by the the volume-averaged gas pressure\nas a function of time in orbits in the unstratified, toroidal field FT simulations. The black\nline corresponds to Rm = 3200 and Pm = 4, magenta is Rm = 6400 and Pm = 8, green is\nRm = 800 and Pm = 0.5, light blue is Rm = 3200 and Pm = 2, dark blue is Rm = 6400\nand Pm = 4, and red is Rm = 3200 and Pm = 0.5. There is a clear increase in stress with\nincreasing Pm . For sufficiently low Rm, the turbulence decays.\n\n\f– 38 –\n\nFig. 3.- Time- and volume-averaged stress parameter α as a function of Pm in the unstratified FT simulations (asterisks) and the higher resolution, net toroidal field simulations of\nSimon & Hawley (2009) (diamonds). In the FT simulations, α ≡ hhρvx δvy − Bx By ii/hhP ii,\nwhereas in the higher resolution simulations, α ≡ hhρvx δvy −Bx By ii/Po ; see Simon & Hawley\n(2009). These definitions are roughly equivalent since hP i ≈ Po . For the FT simulations,\nthe average is calculated over the entire simulation domain and from 120 orbits to the end\nof the simulation. Only simulations with sustained turbulence are plotted. The dashed lines\nare linear fits to the data in log-log space. Both resolutions show a clear Pm dependence,\nbut this dependence is steeper at the lower resolution.\n\n\f– 39 –\n\nFig. 4.- Volume-averaged total stress normalized by the volume-averaged gas pressure\nas a function of time in orbits for a series of unstratified shearing box simulations. The\nvolume-average is done over the entire simulation domain. In each plot, the black line is\nfrom a simulation with only numerical dissipation. The colored lines are simulations with\nphysical dissipation, initiated from the numerical dissipation run at orbit 100. The red lines\ncorrespond to Rm = 3200, Pm = 2 and the blue line is Rm = 1600, Pm = 1. The top panel\nis initiated with a background toroidal field characterized by β = 1000, and the bottom\npanel has β = 10000. The weaker toroidal field appears to be killed off at a lower resistivity\ncompared to the stronger background field.\n\n\f– 40 –\n\nFig. 5.- Space-time diagram of the horizontally averaged By (top panel) and total stress\nnormalized by the volume-averaged gas pressure (bottom panel). The volume-average is\ndone for all x and y and for |z| ≤ 2H. The white contours on the top panel denote where β\ngoes from greater to less than unity. The horizontally averaged By appears to rise vertically\ninto the upper z layers, being replaced in the mid-plane region by By of the opposite sign.\nThe rise speed of the field increases after |z| ∼ 2H is reached. The sign flipping in By has a\nperiod of ∼ 10 orbits.\n\n\f– 41 –\n\nFig. 6.- Left: Time evolution of volume-averaged By in 32Num. The volume average is\ndone for all x and y and for |z| ≤ 0.5H. The dashed line corresponds to hBx,y i = 0. Right:\nTemporal power spectrum of hBy i from the left plot, calculated from orbit 50 to 1050. The 10\norbit period oscillations in hBy i are immediately apparent in both plots, particularly as the\npeak in the power spectrum. The 10 orbit oscillations are modulated on longer timescales,\nranging from tens to hundreds of orbits.\n\n\f– 42 –\n\nFig. 7.- Time evolution of volume-averaged field components for part of 32Num. Red is\nhBx i, black is hBy i, and blue is hBy i as calculated from hBx i using a simple α–Ω dynamo\nmodel discussed in the text. The volume average is done for all x and y and for |z| ≤ 0.5H.\nThe dashed line corresponds to hBx,y i = 0. hBx i has been multiplied by a factor of 5 relative\nto hBy i to make a more direct comparison possible. The variations in hBx i are accompanied\nby variations in hBy i, which are offset in time, and the dynamo model shows that the\nevolution of hBy i is controlled by shear of radial field and buoyant removal of toroidal field.\n\n\f– 43 –\n\nFig. 8.- Time- and horizontally-averaged vertical distributions for various quantities\nin 32Num. Upper left: gas density; upper right: Maxwell (solid) and Reynolds (dashed)\nstresses; lower left: gas pressure (solid), magnetic energy (dashed), and kinetic energy (dotted); lower right: gas β defined as the time- and horizontally-averaged gas pressure divided\nby the time- and horizontally-averaged magnetic energy density. The time average is done\nfrom orbit 100 to the end of the simulation. The stress and magnetic energy are relatively\nflat for |z| . 1.5H but drop off substantially for larger |z|. Outside of |z| ∼ 2H, the magnetic\nenergy dominates over gas pressure.\n\n\f– 44 –\n\nFig. 9.- Magnetic field structure at t = 100 orbits in 32Num, produced via a stream line\nintegration. The field strength (in code units) is displayed via color and not the density\nof the field lines. The magnetic field has a primarily toroidal structure but has a smaller,\ntangled structure in the x and z directions.\n\n\f– 45 –\n\nFig. 10.- Volume-averaged total stress normalized by the volume-averaged gas pressure as\na function of time in orbits in the vertically stratified simulations at 64 (left) and 32 (right)\ngrid zones per H. The volume-average is done for all x and y and for |z| ≤ 2H. The black\nline corresponds to Rm = 3200 and Pm = 4, green is Rm = 800 and Pm = 0.5, light blue\nis Rm = 3200 and Pm = 2, dark blue is Rm = 6400 and Pm = 4, and red is Rm = 3200\nand Pm = 0.5. Some of the simulations appear to undergo periods of low stress followed by\nhigher stress, occurring on very long timescales of ∼ 100 orbits in some cases.\n\n\f– 46 –\n\nFig. 11.- Left: Time- and horizontally-averaged total stress as a function of z for\n32Rm3200Pm0.5. The stress is normalized by the time- and volume-averaged gas pressure, where the volume average is done for all x and y and for |z| ≤ 2H. Right: Ratio of\ntime- and horizontally-averaged Maxwell stress to time- and horizontally-averaged magnetic\nenergy in 32Rm3200Pm0.5. In both plots, the solid line corresponds to a time average from\n500 to 570 orbits, which is a state of high turbulence, and the dashed line is a time average\nfrom 700 to 770 orbits, a low turbulence state. During the high state, the stress is relatively\nflat for |z| ≤ 2H. In the low state, the stress is smaller within the mid-plane region and\npeaks near |z| ∼ 2H.\n\n\f– 47 –\n\nFig. 12.- Quantitative measurement of how well resolved the MRI is in the toroidal (Qy ; left\nplot) and vertical (Qz ; right plot) directions as a function of time. The solid line corresponds\nto run 32Rm6400Pm4 and the dashed line is 64Rm6400pm4. The dotted horizontal line\ncorresponds to Q = 6, below which the MRI is considered to be under-resolved (Sano et al.\n2004). Qi is calculated using the volume average of the magnetic energy and gas density\nfor all x and y and for |z| ≤ 0.5H (see text). The toroidal field MRI at both resolutions as\nwell as the vertical field MRI at the higher resolution appear to be reasonably well-resolved.\nHowever, at the lower resolution, the vertical field MRI is only marginally resolved.\n\n\f– 48 –\n\nFig. 13.- Space-time diagram of the horizontally averaged Bx (top panel) and By (bottom\npanel) for the first 200 orbits of 32Rm800Pm0.5. The turbulence initially decays, leaving\na net Bx within the mid-plane region, which shears into toroidal field. This appears to\neventually reenergize the MRI, but the large resistivity quickly quenches the turbulence\nagain.\n\n\f– 49 –\n\nFig. 14.- Space-time diagram of the horizontally averaged Bx (top left) and By (bottom\nleft) for a 300 orbit period in 32Rm3200Pm0.5, and the average of Bx (top right) and By\n(bottom right) over all x and y and for |z| ≤ 0.5H as a function of time in orbits for the same\n300 orbit period. During the period of no MRI turbulence, a net radial field still exists within\nthe mid-plane region. This field appears to flip signs occasionally, leading to corresponding\nflips in By due to shear.\n\n\f– 50 –\n\nFig. 15.- Volume-averaged total stress normalized by the volume-averaged gas pressure as\na function of time in orbits in 32Rm3200Pm2 (solid line) and 32Rm3200Pm2 By+ (dashed\nline). The volume average is done over all x and y and for |z| ≤ 2H. The run in which a net\nBy is added into the mid-plane region (dashed line) remains in the high state at first and\nthen exhibits variability between low and high states.\n\n\f– 51 –\n\nFig. 16.- Space-time diagram of the horizontally averaged Bx (top panel) and By (bottom\npanel) for 32ShearBx. The uniform radial field that is present initially shears into toroidal\nfield, which eventually becomes strong enough to launch the MRI.\n\n\f– 52 –\n\nFig. 17.- Magnetic field structure at t = 550 orbits in 32Rm3200Pm2 By+, produced via\na stream line integration. The field strength (in code units) is displayed via color and not\nthe density of the field lines. The color scale is the same as that in Fig. 9 for comparison.\nThis snapshot corresponds to the low state. The magnetic field is almost completely toroidal\nnear the mid-plane but has a tangled structure in the upper |z| regions, more reminiscent of\nthe active state.\n\n\f– 53 –\n\nFig. 18.- Volume-averaged total stress normalized by the volume-averaged gas pressure\nas a function of time in orbits in the lower resolution, vertically stratified simulations where\nturbulence remains sustained. The volume-average is done for all x and y and for |z| ≤ 2H.\nThe left plot is the first 120 orbits of the evolution, whereas the right plot is 350 orbits of the\nevolution. The black line corresponds to Rm = 3200 and Pm = 4, dark blue is Rm = 6400\nand Pm = 4, magenta is Rm = 6400 and Pm = 8, and brown is Rm = 6250 and Pm = 1.\nThe vertical axis has been chosen to match that of Fig. 2 for comparison. While the stress\nlevels generally increase with Pm , there is significant overlap between the different curves at\ndifferent times.\n\n\f– 54 –\n\nFig. 19.- Time- and volume-averaged stress parameter α as a function of Pm in\nthe unstratified FT simulations (left plot) and the stratified simulations (right plot);\nα ≡ hhρvx δvy − Bx By ii/hhP ii. The average is calculated over the entire domain (all x\nand y and for |z| ≤ 2H) and from 120 (150) orbits to the end of the simulation for the unstratified (stratified) runs. The dashed lines are linear fits to the data in log-log space, and\nthe error bars denote one standard deviation about the temporal average of the numerator in\nα. Both cases show a clear Pm dependence. However, in the stratified runs, this dependence\nis less steep, and there is considerable temporal variability.\n\n\f– 55 –\n\nFig. 20.- Time- and horizontally-averaged total stress as a function of z on a linear\n(left) and logarithmic (right) vertical scale. The stress is normalized by the time- and\nvolume-averaged gas pressure, where the volume average is done for all x and y and for\n|z| ≤ 2H. The time average is done from orbit 150 until the end of each simulation. The\nsolid line corresponds to 32Rm6400Pm8, the dashed line is 32Rm3200Pm4, the dotted line\nis 32Rm6400Pm4, and the dot-dashed line is 32Rm6250Pm1. The stress appears to increase\nwith Pm for nearly all z, and for all Pm , there is a sharp decrease in the stress for |z| & 1.5H.\n\n\f"}