{"id": "http://arxiv.org/abs/1104.0819v4", "guidislink": true, "updated": "2012-03-29T17:07:42Z", "updated_parsed": [2012, 3, 29, 17, 7, 42, 3, 89, 0], "published": "2011-04-05T12:13:15Z", "published_parsed": [2011, 4, 5, 12, 13, 15, 1, 95, 0], "title": "Linearized f(R) Gravity: Gravitational Radiation & Solar System Tests", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1104.3578%2C1104.2368%2C1104.4544%2C1104.1661%2C1104.5143%2C1104.2248%2C1104.5493%2C1104.0819%2C1104.2597%2C1104.2983%2C1104.3581%2C1104.1753%2C1104.4127%2C1104.3936%2C1104.1710%2C1104.1404%2C1104.4936%2C1104.5384%2C1104.5320%2C1104.5028%2C1104.1281%2C1104.0941%2C1104.0699%2C1104.3973%2C1104.2067%2C1104.0643%2C1104.3825%2C1104.0165%2C1104.0966%2C1104.2866%2C1104.0863%2C1104.0281%2C1104.3934%2C1104.0847%2C1104.0294%2C1104.4420%2C1104.4267%2C1104.5529%2C1104.2896%2C1104.5144%2C1104.0037%2C1104.0803%2C1104.4114%2C1104.2817%2C1104.4093%2C1104.4258%2C1104.4483%2C1104.0691%2C1104.4717%2C1104.2472%2C1104.4294%2C1104.0936%2C1104.1014%2C1104.2250%2C1104.1689%2C1104.4871%2C1104.1223%2C1104.2097%2C1104.3169%2C1104.4733%2C1104.5504%2C1104.5545%2C1104.4757%2C1104.3726%2C1104.2079%2C1104.5417%2C1104.1959%2C1104.4915%2C1104.4360%2C1104.3367%2C1104.1013%2C1104.5218%2C1104.5487%2C1104.2583%2C1104.1379%2C1104.4650%2C1104.3935%2C1104.4996%2C1104.0179%2C1104.2330%2C1104.4019%2C1104.0811%2C1104.2557%2C1104.0440%2C1104.1321%2C1104.4319%2C1104.1406%2C1104.1782%2C1104.1647%2C1104.3160%2C1104.1925%2C1104.0739%2C1104.5651%2C1104.5006%2C1104.0615%2C1104.3317%2C1104.1806%2C1104.2272%2C1104.0947%2C1104.1879%2C1104.4166&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Linearized f(R) Gravity: Gravitational Radiation & Solar System Tests"}, "summary": "We investigate the linearized form of metric f(R)-gravity, assuming that f(R)\nis analytic about R = 0 so it may be expanded as f(R) = R + a_2 R^2/2 + ... .\nGravitational radiation is modified, admitting an extra mode of oscillation,\nthat of the Ricci scalar. We derive an effective energy-momentum tensor for the\nradiation. We also present weak-field metrics for simple sources. These are\ndistinct from the equivalent Kerr (or Schwarzschild) forms. We apply the\nmetrics to tests that could constrain f(R). We show that light deflection\nexperiments cannot distinguish f(R)-gravity from general relativity as both\nhave an effective post-Newtonian parameter \\gamma = 1. We find that planetary\nprecession rates are enhanced relative to general relativity; from the orbit of\nMercury we derive the bound |a_2| < 1.2 \\times 10^18 m^2. Gravitational wave\nastronomy may be more useful: considering the phase of a gravitational waveform\nwe estimate deviations from general relativity could be measurable for an\nextreme-mass-ratio inspiral about a 10^6 M_sol black hole if |a_2| > 10^17 m^2,\nassuming that the weak-field metric of the black hole coincides with that of a\npoint mass. However Eot-Wash experiments provide the strictest bound |a_2| < 2\n\\times 10^-9 m^2. Although the astronomical bounds are weaker, they are still\nof interest in the case that the effective form of f(R) is modified in\ndifferent regions, perhaps through the chameleon mechanism. Assuming the\nlaboratory bound is universal, we conclude that the propagating Ricci scalar\nmode cannot be excited by astrophysical sources.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1104.3578%2C1104.2368%2C1104.4544%2C1104.1661%2C1104.5143%2C1104.2248%2C1104.5493%2C1104.0819%2C1104.2597%2C1104.2983%2C1104.3581%2C1104.1753%2C1104.4127%2C1104.3936%2C1104.1710%2C1104.1404%2C1104.4936%2C1104.5384%2C1104.5320%2C1104.5028%2C1104.1281%2C1104.0941%2C1104.0699%2C1104.3973%2C1104.2067%2C1104.0643%2C1104.3825%2C1104.0165%2C1104.0966%2C1104.2866%2C1104.0863%2C1104.0281%2C1104.3934%2C1104.0847%2C1104.0294%2C1104.4420%2C1104.4267%2C1104.5529%2C1104.2896%2C1104.5144%2C1104.0037%2C1104.0803%2C1104.4114%2C1104.2817%2C1104.4093%2C1104.4258%2C1104.4483%2C1104.0691%2C1104.4717%2C1104.2472%2C1104.4294%2C1104.0936%2C1104.1014%2C1104.2250%2C1104.1689%2C1104.4871%2C1104.1223%2C1104.2097%2C1104.3169%2C1104.4733%2C1104.5504%2C1104.5545%2C1104.4757%2C1104.3726%2C1104.2079%2C1104.5417%2C1104.1959%2C1104.4915%2C1104.4360%2C1104.3367%2C1104.1013%2C1104.5218%2C1104.5487%2C1104.2583%2C1104.1379%2C1104.4650%2C1104.3935%2C1104.4996%2C1104.0179%2C1104.2330%2C1104.4019%2C1104.0811%2C1104.2557%2C1104.0440%2C1104.1321%2C1104.4319%2C1104.1406%2C1104.1782%2C1104.1647%2C1104.3160%2C1104.1925%2C1104.0739%2C1104.5651%2C1104.5006%2C1104.0615%2C1104.3317%2C1104.1806%2C1104.2272%2C1104.0947%2C1104.1879%2C1104.4166&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We investigate the linearized form of metric f(R)-gravity, assuming that f(R)\nis analytic about R = 0 so it may be expanded as f(R) = R + a_2 R^2/2 + ... .\nGravitational radiation is modified, admitting an extra mode of oscillation,\nthat of the Ricci scalar. We derive an effective energy-momentum tensor for the\nradiation. We also present weak-field metrics for simple sources. These are\ndistinct from the equivalent Kerr (or Schwarzschild) forms. We apply the\nmetrics to tests that could constrain f(R). We show that light deflection\nexperiments cannot distinguish f(R)-gravity from general relativity as both\nhave an effective post-Newtonian parameter \\gamma = 1. We find that planetary\nprecession rates are enhanced relative to general relativity; from the orbit of\nMercury we derive the bound |a_2| < 1.2 \\times 10^18 m^2. Gravitational wave\nastronomy may be more useful: considering the phase of a gravitational waveform\nwe estimate deviations from general relativity could be measurable for an\nextreme-mass-ratio inspiral about a 10^6 M_sol black hole if |a_2| > 10^17 m^2,\nassuming that the weak-field metric of the black hole coincides with that of a\npoint mass. However Eot-Wash experiments provide the strictest bound |a_2| < 2\n\\times 10^-9 m^2. Although the astronomical bounds are weaker, they are still\nof interest in the case that the effective form of f(R) is modified in\ndifferent regions, perhaps through the chameleon mechanism. Assuming the\nlaboratory bound is universal, we conclude that the propagating Ricci scalar\nmode cannot be excited by astrophysical sources."}, "authors": ["Christopher P. L. Berry", "Jonathan R. Gair"], "author_detail": {"name": "Jonathan R. Gair"}, "author": "Jonathan R. Gair", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1103/PhysRevD.83.104022", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1104.0819v4", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1104.0819v4", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "19 pages, 1 figure; typos in Sec. VIII. A. corrected", "arxiv_primary_category": {"term": "gr-qc", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "gr-qc", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "astro-ph.CO", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "astro-ph.HE", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1104.0819v4", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1104.0819v4", "journal_reference": "Phys.Rev.D83:104022,2011", "doi": "10.1103/PhysRevD.83.104022", "fulltext": "Linearized f (R) gravity: Gravitational radiation and Solar System tests\nChristopher P.L. Berry∗ and Jonathan R. Gair†\n\narXiv:1104.0819v4 [gr-qc] 29 Mar 2012\n\nInstitute of Astronomy, Madingley Road, Cambridge, CB3 0HA, United Kingdom\n(Dated: May 29, 2018)\nWe investigate the linearized form of metric f (R)-gravity, assuming that f (R) is analytic about\nR = 0 so it may be expanded as f (R) = R + a2 R2 /2 + . . . . Gravitational radiation is modified,\nadmitting an extra mode of oscillation, that of the Ricci scalar. We derive an effective energymomentum tensor for the radiation. We also present weak-field metrics for simple sources. These\nare distinct from the equivalent Kerr (or Schwarzschild) forms. We apply the metrics to tests that\ncould constrain f (R). We show that light deflection experiments cannot distinguish f (R)-gravity\nfrom general relativity as both have an effective post-Newtonian parameter γ = 1. We find that\nplanetary precession rates are enhanced relative to general relativity; from the orbit of Mercury\nwe derive the bound |a2 | . 1.2 × 1018 m2 . Gravitational-wave astronomy may be more useful:\nconsidering the phase of a gravitational waveform we estimate deviations from general relativity\ncould be measurable for an extreme-mass-ratio inspiral about a 106 M⊙ black hole if |a2 | & 1017 m2 ,\nassuming that the weak-field metric of the black hole coincides with that of a point mass. However\nEöt-Wash experiments provide the strictest bound |a2 | . 2 × 10−9 m2 . Although the astronomical\nbounds are weaker, they are still of interest in the case that the effective form of f (R) is modified\nin different regions, perhaps through the chameleon mechanism. Assuming the laboratory bound is\nuniversal, we conclude that the propagating Ricci scalar mode cannot be excited by astrophysical\nsources.\nPACS numbers: 04.50.Kd, 04.25.Nx, 04.30.–w, 04.70.–s\n\nI.\n\nINTRODUCTION\n\nGeneral relativity (GR) is a well tested theory of gravity [1]; so far no evidence has been found that suggests\nit is not the correct classical theory of gravitation. However, there are many unanswered questions that remain\nregarding gravity which motivate the exploration of alternate theories: What are the true natures of dark matter\nand dark energy? How should we formulate a quantizable theory of gravity? What drove inflation in the early\nUniverse? Is GR the only theory that is consistent with\ncurrent observations? Moreover, the majority of the tests\nthat have been carried out to date have been in the weakfield, low-energy regime [1, 2]: in the laboratory [3, 4],\nwithin the Solar System [5, 6] or using binary pulsars [7].\nIt is not unreasonable to suppose that GR would begin\nto break down at higher energies.\nOver the coming decade, a new avenue for testing relativity will be opened up, through the detection of gravitational waves (GWs) using the existing ground-based GW\ndetectors, the Laser Interferometer Gravitational-Wave\nObservatory (LIGO) [8, 9], Virgo [10] and GEO [11, 12],\nand the proposed space-based GW detector, the Laser\nInterferometer Space Antenna (LISA) [13, 14]. These\ndetectors will observe GWs generated during the inspiral and merger of binary systems comprising one or more\nblack holes (BHs). The GWs are generated in the strongfield regime, while the components are highly relativistic and the spacetime is evolving dynamically: GW astronomy will open a new window into the strong-field\n\n∗\n†\n\ncplb2@ast.cam.ac.uk\njgair@ast.cam.ac.uk\n\nregime of gravity, complementing traditional electromagnetic observations [15]. A comparison of the GWs observed from such systems with the predictions of GR will\nprovide powerful tests of the theory in a region yet to be\nexplored.\nThe radiation generated during the final merger and\nringdown of two BHs will offer tests of GR in the highest energy and most dynamical sector, but it is thought\nthat the most sensitive tests will come from LISA observations of extreme-mass-ratio inspirals (EMRIs) [16].\nAn EMRI involves the inspiral of a stellar-mass compact\nobject, a white dwarf, neutron star or BH, into a massive\nBH in the centre of a galaxy. The mass of the compact\nobject is typically 1–10M⊙, while the mass of the massive BH (for sources in the LISA band) will be ∼ 105 –\n107 M⊙ , so the mass-ratio is of the order of ∼ 10−7 –10−4 .\nThis extreme mass-ratio means that the inspiral proceeds\nslowly, and on short timescales the compact object acts\nlike a test particle moving in the background spacetime\nof the central BH. LISA will detect ∼ 105 cycles of gravitational radiation generated while the compact object is\nin the strong field of the spacetime, and this encodes a\ndetailed map of the spacetime structure outside the central BH. This idea was first elucidated by Ryan [17, 18],\nwho showed that, for an arbitrary stationary and axisymmetric spacetime in GR, the multipole moments of the\nspacetime enter at different orders in an expansion of the\nfrequency of small vertical or radial oscillations of circular, equatorial orbits. As these frequencies are in principle observable in the GWs generated during an inspiral,\nit should be possible to measure the multipole moments\nfrom an EMRI observation and hence test whether the\ncentral object is a Kerr BH: according to the no-hair\ntheorem, a Kerr BH is described completely by its mass\n\n\f2\nM and spin angular momentum J [19–23], and its mass\nmultipole Ml (M0 ≡ M ) and mass-current multipole moments Sl (S1 ≡ J) are determined from these according\nto [24]\n\u0012\n\u0013l\nJ\nMl + iSl = M i\n.\n(1)\nM\nThe multipole expansion is not a convenient way to characterize arbitrary spacetimes, since the Kerr metric itself\nrequires an infinite number of multipoles to fully characterize. Subsequent authors have instead adopted the\napproach of considering bumpy BH spacetimes [25–28],\nwhich deviate from the Kerr metric by a small amount\nand depend on some parameter, ǫ, such that ǫ = 0 is precisely the Kerr solution. Relatively small perturbations\nto the Kerr solution can be detected in EMRI observations due to small differences in the precession frequencies that accumulate over the 100 000 waveform cycles\nthat will be detected. There are also certain qualitative features that could be smoking-guns for a departure\nfrom the Kerr metric, such as ergodicity in the orbits [28],\npersistent resonances [29] or a shift in the frequency of\nplunge [28, 30].\nThe majority of the work to date has focused on spacetimes that are solutions in GR, but which deviate from\nthe Kerr solution. However, if GR was not the correct\ntheory of gravity, this could also lead to detectable signatures in the observed gravitational waves. Certain alternative theories of gravity, including f (R), do admit the\nKerr metric as a solution, since it has vanishing Ricci tensor, Rμν = 0 [31, 32]. However, the Kerr metric need not\nbe the expected end state of gravitational collapse [33]. If\na Kerr BH existed in an alternative theory, the geodesics\nwould be the same, but the energy flux carried by the\nGWs could still be different, and so differences would\nshow up in the rate of inspiral; although in many cases\nthese differences do not appear at leading order. In most\ncases, however, either the Kerr metric is not admitted\nas a solution, or it is not the correct metric to describe\ncollapsed objects [32]. Waveform differences then show\nup as a result of the differences in the instantaneouslygeodesic orbits of the compact object involved in the\nEMRI. Since the leading-order energy-momentum tensor\nof the GWs often takes the same form as in GR [34], this\nis the primary effect and means the problem of testing\nalternative theories through EMRI observations is equivalent to the spacetime mapping programme within GR\ndescribed previously.\nAs a consequence of the difficulties of solving for GW\nemission in alternative theories, work on testing alternative theories of gravity using LISA EMRIs has so far\nbeen restricted to a few cases. In Brans-Dicke gravity, in\nwhich the gravitational field is coupled to a scalar field,\ndifferences show up due to a modification to the inspiral rate that arises from dipole radiation of the scalar\nfield [35]. Neutron star EMRIs are required since the\ndipole radiation depends on a sensitivity difference between the two objects, and the sensitivity is the same for\n\nall BHs. Lower mass central BHs provide the most powerful constraints, but a LISA observation of a neutron\nstar EMRI into a 104 M⊙ BH could place constraints on\nthe Brans-Dicke coupling parameter that are competitive with Solar System constraints [35]. In dynamical\nChern-Simons modified gravity, the action is modified\nby a parity-violating correction, inspired by string theory [36, 37]. In this case, the BH solution differs from\nthe Kerr solution at the fourth multipole, l = 4, but\nthe energy-momentum tensor of gravitational radiation\ntakes the same form as in GR [38]. LISA observations\nof EMRIs should place constraints on the Chern-Simons\ncoupling parameter that are an order of magnitude better than will be possible from binary pulsar observations,\nalthough a full analysis accounting for parameter degeneracies has not yet been carried out [38].\nIn this work, we focus our attention on metric f (R)gravity, in which the Einstein-Hilbert action is modified\nby replacing the Ricci scalar R with an arbitrary function f (R). This is one of the simplest extensions to standard GR [39, 40]. It has attracted significant interest\nbecause the flexibility in defining the function f (R) allows a wide range of cosmological phenomena to be described [41, 42]. For example, Starobinsky [43] suggested\nthat a quadratic addition to the field equations could\ndrive exponential expansion of the early Universe [44]:\ninflation in modern terminology. In this model f (R) =\nR − R2 /(6Υ2 ); the size of the quadratic correction can be\ntightly constrained by considering the spectrum of curvature perturbations generated during inflation [45, 46].\nUsing the results of the Wilkinson Microwave Anisotropy\nProbe [47, 48], the inverse length-scale can be constrained\n−1\nto Υ ≃ 3 × 10−6 (50/N )lP\n[40, 49], where N is the number of e-folds during inflation and lP is the Planck length.\nWe consider simple f (R) corrections within the framework of linearized gravity, and explore what constraints\nLISA might be able to place on the form of f (R) (we will\nnot consider cosmological implications where terms beyond linear order could play a significant role). We will\nsee that, although the field equations for f (R)-gravity do\nadmit the Kerr metric as a solution [31, 33], this is not\nnecessarily the metric that describes the exterior of collapsed objects. We consider the modifications to geodesic\norbits in the weak-field of the f (R) spacetime exterior\nto massive objects and, assuming this also describes the\nweak-field external to a BH, we estimate how observable\nthe differences in the precession frequencies will be by\nLISA. We will also describe Solar System and laboratory\nconstraints that can be placed on the same model. The\noverall conclusion is that LISA could place constraints\non f (R)-gravity, which may be more powerful than those\nin the Solar System, but not as powerful as constraints\nfrom laboratory experiments. However, the LISA observations will probe a different energy scale, so these\nconstraints will still be important, particularly if we regard f (R) as an effective theory that could be different\nin different regimes.\nThis paper is organised as follows. We begin with a\n\n\f3\nreview of the f (R) field equations. In Sec. III we derive\nthe linearized equations and in Sec. IV we apply these to\nfind wave solutions. These results can be used to study\nhow gravitational radiation is modified for f (R)-gravity.\nThey are largely known in the literature, but are worked\nout here ab initio; they are included as a compendium\nof useful results within a consistent system of notation.\nTo be able to accurately model gravitational waveforms\none needs to know how an object will inspiral. Accordingly, we derive an effective energy-momentum tensor\nfor gravitational radiation in Sec. V, following the shortwavelength approximation of Isaacson [50, 51]. In Sec. VI\nwe look at the effects of introducing a source term and derive the weak-field metrics for a point source, a slowly rotating point source, and a uniform density sphere, recovering some results known for quadratic theories of gravity.\nThese are used in Sec. VII to compute the frequencies of\nradial and vertical epicyclic oscillations about circularequatorial orbits in the weak-field, slow-rotation metric,\nand hence to construct an estimate of the detectability\nof the f (R) deviations in LISA EMRI observations. For\ncomparison, in Sec. VIII, we describe the constraints on\nf (R)-gravity that can be obtained from Solar System and\nlaboratory tests. We conclude in Sec. IX with a summary\nof our findings.\nThroughout this work we will use the timelike sign\nconvention of Landau and Lifshitz [52]:\n1. The metric has signature (+, −, −, −).\nμ\n\n2. The Riemann tensor is defined as R νσρ\n∂σ Γμ νρ − ∂ρ Γμ νσ + Γμ λσ Γλ ρν − Γμ λρ Γλ σν .\n\n=\n\n3. The Ricci tensor is defined as the contraction\nRμν = Rλ μλν .\nGreek indices are used to represent spacetime indices μ =\n{0, 1, 2, 3} (or μ = {t, re, θ, φ}) and lowercase Latin indices\nare used for spatial indices i = {1, 2, 3}. Natural units\nwith c = 1 will be used throughout, but factors of G will\nbe retained.\n\nII.\n\nDESCRIPTION OF f (R)-GRAVITY\nA.\n\nThe action and field equations\n\nGeneral relativity may be derived from the EinsteinHilbert action [52, 53]\nZ\n√\n1\nSEH [g] =\n(2)\nR −g d4 x.\n16πG\nIn f (R) theory we make a simple modification of the\naction to include an arbitrary function of the Ricci scalar\nR such that [54]\nZ\n√\n1\nS[g] =\n(3)\nf (R) −g d4 x.\n16πG\n\nIncluding the function f (R) gives extra freedom in defining the behaviour of gravity. While this action may\nnot encode the true theory of gravity it could contain\nsufficient information to act as an effective field theory,\ncorrectly describing phenomenological behaviour [55]; it\nmay be that as an effective field theory, a particular\nf (R) will have a limited region of applicability and will\nnot be universal. We will assume that f (R) is analytic\nabout R = 0 so that it can be expressed as a power series [31, 54, 56–58]\nf (R) = a0 + a1 R +\n\na2 2 a3 3\nR + R + ...\n2!\n3!\n\n(4)\n\nSince the dimensions of f (R) must be the same as of R,\n[an ] = [R](1−n) . To link to GR we will set a1 = 1; any\nrescaling can be absorbed into the definition of G.\nVarious models of cosmological interest may be expressed in such a form, for example, the model of\nStarobinsky [49]\n\"\u0012\n#\n\u0013−n\nR2\n1+ 2\nf (R) = R + λR0\n−1 ,\n(5)\nR0\ncan be expanded as\nf (R) = R −\n\nλn 2 λn(n + 1) 4\nR +\nR + ...\nR0\n2R03\n\n(6)\n\nConsequently such a series expansion can constrain\nmodel parameters, although we cannot specify the full\nfunctional form from only a few terms.\nThe field equations are obtained by a variational principle; there are several ways of achieving this. To derive\nthe Einstein field equations from the Einstein-Hilbert action one may use the standard metric variation or the\nPalatini variation [53]. Both approaches can be used for\nf (R), however they yield different results [39, 40]. Following the metric formalism, one varies the action with\nrespect to the metric g μν . Following the Palatini formalism one varies the action with respect to both the metric\ng μν and the connection Γρ μν , which are treated as independent quantities: the connection is not the Levi-Civita\nmetric connection.1\nFinally, there is a third version of f (R)-gravity: metricaffine f (R)-gravity [63, 64]. This goes beyond the Palatini formalism by supposing that the matter action is dependent on the variational independent connection. Parallel transport and the covariant derivative are divorced\nfrom the metric. This theory has its attractions: it allows\n\n1\n\nImposing the condition that that the metric and Palatini formalisms produce the same field equations, assuming an action\nthat only depends on the metric and Riemann tensor, results in\nLovelock gravity [59]. Lovelock gravities require the field equations to be divergence free and no more than second order; in\nfour dimensions the only possible Lovelock gravity is GR with a\npotentially nonzero cosmological constant [60–62].\n\n\f4\nfor a natural introduction of torsion. However, it is not\na metric theory of gravity and so cannot satisfy all the\npostulates of the Einstein equivalence principle [1]: a free\nparticle does not necessarily follow a geodesic and so the\neffects of gravity might not be locally removed [59]. The\nimplications of this have not been fully explored, but for\nthis reason we will not consider the theory further.\nWe will restrict our attention to metric f (R)-gravity.\nThis is preferred as the Palatini formalism has undesirable properties: static spherically symmetric objects described by a polytropic equation of state are subject to\na curvature singularity [40, 65, 66]. Varying the action\nwith respect to the metric g μν produces\nZ \u001a\n√\n1\nδS =\nf ′ (R) −g [Rμν − ∇μ ∇ν + gμν \u0003]\n16πG\n\u001b\n1√\n− f (R)\n(7)\n−ggμν δg μν d4 x,\n2\n\nwhere \u0003 = g μν ∇μ ∇ν is the d'Alembertian and a prime\ndenotes differentiation with respect to R. Proceeding\nfrom here requires certain assumptions regarding surface terms. In the case of the Einstein-Hilbert action\nthese gather into a total derivative. It is possible to subtract this from the action to obtain a well-defined variational quantity [67, 68]. This is not the case for general\nf (R) [69]. However, since the action includes higherorder derivatives of the metric we are at liberty to fix\nmore degrees of freedom at the boundary, in so doing\neliminating the importance of the surface terms [39, 70].\nSetting the variation δR = 0 on the boundary allows us\nto subtract a term similar to in GR [71]. Thus we have\na well-defined variational quantity, from which we can\nobtain the field equations.\nThe vacuum field equations are\nf\nf Rμν − ∇μ ∇ν f + gμν \u0003f − gμν = 0.\n2\nTaking the trace of our field equations gives\n′\n\n′\n\n′\n\nf ′ R + 3\u0003f ′ − 2f = 0.\n\n(8)\n\nActing upon this with the covariant derivative\n8πG∇μ Tμν = ∇μ Gμν\n\n\u0012\n\u0013\n1\n= Rμν ∇ f + f ∇ Rμν − Rgμν\n2\n− (\u0003∇ν − ∇ν \u0003) f ′ .\n(14)\nμ ′\n\na0 = 0.\n\n(10)\n\n(\u0003∇ν − ∇ν \u0003) f ′ = Rμν ∇μ f ′ ,\n\nf\ngμν ,\n2\n\n8πG∇μ Tμν = 0.\n\nIII.\n\nB.\n\ngμν = ημν + hμν ;\n\ng μν = η μν − hμν ,\n\n(13)\n\n(19)\n\nSimilarly, the trace h is given by\n(20)\n\nAll quantities denoted by \"h\" are strictly O(ε).\nThe linearized connection is\nΓ(1)\n\nIf we introduce matter with a stress-energy tensor Tμν ,\nthe field equations become\n\n(18)\n\nwhere we have used the Minkowski metric to raise the\nindices on the right, defining\n\nh = η μν hμν .\n(12)\n\n(17)\n\nwhere, more formally, we mean that hμν = εHμν for a\nsmall parameter ε.2 We will consider terms only to O(ε).\nThus, the inverse metric is\n\nConservation of energy-momentum\n\nGμν = 8πGTμν .\n\nLINEARIZED THEORY\n\nWe start our investigation of f (R) by looking at linearized theory. This is a weak-field approximation that\nassumes only small deviations from a flat background,\ngreatly simplifying the field equations. Just as in GR,\nthe linearized framework provides a natural way to study\nGWs. We will see that the linearized field equations will\nreduce down to flat-space wave equations: GWs are as\nmuch a part of f (R)-gravity as of GR.\nConsider a perturbation of the metric from flat\nMinkowski space such that\n\nso that in a vacuum\nGμν = 0.\n\n(16)\n\nConsequently energy-momentum is a conserved quantity\nin the same way as in GR, as is expected from the symmetries of the action.\n\nhμν = η μσ η νρ hσρ .\n(11)\n\n(15)\n\nwhich is a useful geometric identity [72]. Using this\n\nIn analogy to the Einstein tensor, we define\nGμν = f ′ Rμν − ∇μ ∇ν f ′ + gμν \u0003f ′ −\n\nμ\n\nThe second term contains the covariant derivative of the\nEinstein tensor and so is zero. The final term can be\nshown to be\n\n(9)\n\nIf we consider a uniform flat spacetime R = 0, this equation gives [56]\n\n′\n\n2\n\nρ\nμν\n\n=\n\n1 ρλ\nη (∂μ hλν + ∂ν hλμ − ∂λ hμν ).\n2\n\n(21)\n\nIt is because we wish to perturb about flat spacetime that we\nhave required f (R) to be analytic about R = 0.\n\n\f5\nTo O(ε) the covariant derivative of any perturbed quantity will be the same as the partial derivative. The Riemann tensor is\n1\n(∂μ ∂ν hλρ + ∂ λ ∂ρ hμν − ∂μ ∂ρ hλν − ∂ λ ∂ν hμρ ),\n2\n(22)\nwhere we have raised the index on the differential operator with the background Minkowski metric. Contracting\ngives the Ricci tensor\nR(1)\n\nλ\n\nμνρ\n\nIn GR we use the trace-reversed form where Aμν =\n−(h/2)ημν . This will not suffice here, but let us look\nfor a similar solution\nhμν = hμν −\n\n=\n\nR(1) μν =\n\n1\n(∂μ ∂ρ hρν + ∂ν ∂ρ hρμ − ∂μ ∂ν h − \u0003hμν ), (23)\n2\n\nwhere the d'Alembertian operator is \u0003 = η μν ∂μ ∂ν . Contracting this with η μν gives the first-order Ricci scalar\nR(1) = ∂μ ∂ρ hρμ − \u0003h.\n\n′\n\nf (R) = 1 + a2 R\n\n(1)\n\n.\n\n(33)\n\nThe only rank-two tensors in our theory are: hμν , ημν ,\nR(1) μν , and ∂μ ∂ν ; hμν has been used already, and we wish\nto eliminate R(1) μν , so we will try the simpler option\nbased around ημν . We want Bμν to be O(ε); since we\nhave already used h, we will try the other scalar quantity\nR(1) . Therefore, we construct an ansatz\n\u0012\n\u0013\nh\nhμν = hμν + ba2 R(1) −\nημν ,\n(34)\n2\n\n(24)\n\nwhere a2 has been included to ensure dimensional consistency and b is a dimensionless number. Contracting\nwith the background metric yields\n\n(25)\n\nh = 4ba2 R(1) − h,\n\nTo O(ε) we can write f (R) as a Maclaurin series\nf (R) = a0 + R(1) ;\n\nh\nημν + Bμν .\n2\n\n(26)\n\nAs we are perturbing from a Minkowski background\nwhere the Ricci scalar vanishes, we use (10) to set a0 = 0.\nInserting these into (11) and retaining terms to O(ε)\nyields\n\n(35)\n\nso we can eliminate h in our definition of hμν to give\n\u0012\n\u0013\nh\n(1)\nhμν = hμν + ba2 R −\nημν .\n(36)\n2\n\nR\nημν .\n2\n(27)\nNow consider the linearized trace equation, from (9)\n\nJust as in GR, we have the freedom to perform a gauge\ntransformation [53, 77]: the field equations are gaugeinvariant since we started with a function of the gaugeinvariant Ricci scalar. We will assume a Lorenz, or de\nDonder, gauge choice\n\nG (1) = R(1) + 3\u0003(a2 R(1) ) − 2R(1)\n\n∇μ hμν = 0;\n\n(37)\n\n∂ μ hμν = 0.\n\n(38)\n\nG (1) μν = R(1) μν −∂μ ∂ν (a2 R(1) )+ημν \u0003(a2 R(1) )−\n\nG (1) = 3\u0003(a2 R(1) ) − R(1) ,\n\n(1)\n\n(28)\n\nwhere G (1) = η μν G (1) μν . This is the massive inhomogeneous Klein-Gordon equation. Setting G = 0, as for a\nvacuum, we obtain the standard Klein-Gordon equation\n\u0003R(1) + Υ2 R(1) = 0,\n\n(29)\n\ndefining the reciprocal length (squared)\nΥ2 = −\n\n1\n.\n3a2\n\n(30)\n\nFor a physically meaningful solution Υ2 > 0: we constrain f (R) such that a2 < 0 [73–76]. From Υ we define\na reduced Compton wavelength\nλR =\n\n1\nΥ\n\n(31)\n\nassociated with this scalar mode.\nThe next step is to substitute in hμν to try to find\nwave solutions. We want a quantity hμν that will satisfy\na wave equation, related to hμν by\nhμν = hμν + Aμν .\n\n(32)\n\nor for a flat spacetime\n\nSubject to this, from (23), the Ricci tensor is\n\u0014\n\u0012\n\u0013\nh\n1\n(1)\n(1)\nR μν = − 2b∂μ ∂ν (a2 R ) + \u0003 hμν − ημν\n2\n2\n\u0015\nb (1)\n(39)\n+ (R + G (1) )ημν .\n3\nUsing this with (28) in (27) gives\nG\n\n(1)\n\nμν\n\n\u0013\n\u0012\n2 − b (1)\n1\nh\n=\nG ημν − \u0003 hμν − ημν\n6\n2\n2\n\u0014\n\u0015\n1\n(1)\n(1)\n−(b + 1) ∂μ ∂ν (a2 R ) + R ημν . (40)\n6\n\nPicking b = −1 the final term vanishes, thus we set [76,\n78]\n\u0013\n\u0012\nh\nημν\n(41a)\nhμν = hμν − a2 R(1) +\n2\n\u0012\n\u0013\nh\n(1)\nhμν = hμν − a2 R +\nημν .\n(41b)\n2\n\n\f6\nFrom (24) the Ricci scalar is\n\u0013\n\u0012\nh\n(1)\n(1)\n− \u0003(−4a2 R(1) − h)\nR = \u0003 a2 R −\n2\n1\n(42)\n= 3\u0003(a2 R(1) ) + \u0003h.\n2\nFor consistency with (28), we require\n1\n− \u0003h = G (1) .\n2\n\nb\nh0ν + b\nh3ν = 0.\n\n(44)\n\nwe have our wave equation.\nShould a2 be sufficiently small that it can be regarded\nan O(ε) quantity, we recover the usual GR formulae to\nleading order within our analysis.\n\n4\n\u0003h = − R(1) .\n3\n\nGRAVITATIONAL RADIATION\n\nHaving established two wave equations, (28) and (44),\nwe now investigate their solutions. Consider waves in a\nvacuum, such that Gμν = 0. Using a standard Fourier\ndecomposition\nhμν = b\nhμν (kρ ) exp (ikρ xρ ) ,\nb ρ ) exp (iqρ xρ ) ,\nR(1) = R(q\n\n(45)\n(46)\n\nwhere kμ and qμ are four-wavevectors. From (44) we\nknow that kμ is a null vector, so for a wave travelling\nalong the z-axis\nk μ = ω(1, 0, 0, 1),\n\n(47)\n\nwhere ω is the angular frequency. Similarly, from (28)\n\u0011\n\u0010\np\n(48)\nq μ = Ω, 0, 0, Ω2 − Υ2 ,\n\nfor frequency Ω. These waves do not travel at c, but have\na group velocity\n√\nΩ2 − Υ 2\nv(Ω) =\n,\n(49)\nΩ\nprovided that Υ2 > 0, v < 1 = c. For Ω < Υ, we find an\nevanescently decaying wave. The travelling wave is dispersive. For waves made up of a range of frequency components there will be a time delay between the arrival of\nthe high-frequency and low-frequency constituents. This\nmay make it difficult to reconstruct a waveform, should\nthe scalar mode be observed with a GW detector [79].\nFrom the gauge condition (38) we find that k μ is orthogonal to b\nhμν ,\nhμν = 0,\nkμb\n\n(50)\n\n(52)\n\nFor nonzero R(1) (as required for the Ricci mode) there\nis no way to make a gauge choice such that the trace\nh will vanish [76, 78]. This is distinct from in GR. It\nis possible, however, to make a gauge choice such that\nthe trace h will vanish. Consider a gauge transformation\ngenerated by ξμ which satisfies \u0003ξμ = 0, and so has a\nFourier decomposition\nξμ = ξbμ exp (ikρ xρ ) .\n\n(53)\n\nhμν → hμν + ∂μ ξν + ∂ν ξμ − ημν ∂ ρ ξρ ,\n\n(54)\n\nA transformation\nIV.\n\n(51)\n\nLet us consider the implications of (43) using equations\n(28) and (35),\n\u0010\n\u0011\n\u0003 4a2 R(1) + h = 0\n\n(43)\n\nInserting this into (40), with b = −1, we see\n1\n− \u0003hμν = G (1) μν ;\n2\n\nin this case\n\nwould ensure both conditions (38) and (44) are satisfied [53]. Under such a transformation\n\u0010\n\u0011\nb\nhμν → b\nhμν + i kμ ξbν + kν ξbμ − ημν k ρ ξbρ .\n(55)\nWe may therefore impose four further constraints (one\nfor each ξbμ ) upon b\nhμν . We take these to be\nb\nh0ν = 0,\n\nb\nh = 0.\n\n(56)\n\nh = − 4a2 R(1) .\n\n(57)\n\nThis might appear to be five constraints, however we have\nalready imposed (51), and so setting b\nh00 = 0 automatically implies b\nh03 = 0. In this gauge we have\nhμν = hμν − a2 R(1) ημν ,\n\nThus hμν behaves just as\ndefine\n\n0\ni\nh\n0\n\nb\nhμν = \n0\n\nits GR counterpart; we can\n\n0\n0\nh+ h×\nh× −h+\n0 0\n0\n\n\n0\n0\n,\n0\n0\n\n(58)\n\nwhere h+ and h× are constants representing the amplitudes of the two transverse polarizations of gravitational\nradiation.\nIt is important that our solutions reduce to those of GR\nin the event that f (R) = R. In our linearized approach\nthis corresponds to a2 → 0, Υ2 → ∞. We see from (48)\nthat in this limit it would take an infinite frequency to\nexcite a propagating Ricci mode, and evanescent waves\nwould decay away infinitely quickly. Therefore there\nwould be no detectable Ricci modes and we would only\nobserve the two polarizations found in GR. Additionally,\nhμν would simplify to its usual trace-reversed form.\n\n\f7\nV.\n\nENERGY-MOMENTUM TENSOR\n\nWe expect gravitational radiation to carry energymomentum. Unfortunately, it is difficult to define a\nproper energy-momentum tensor for a gravitational field:\nas a consequence of the equivalence principle it is possible to transform to a freely falling frame, eliminating the\ngravitational field and any associated energy density at\na given point, although we can still define curvature in\nthe neighbourhood of this point [53, 77]. We will do\nnothing revolutionary here, but will follow the approach\nof Isaacson [50, 51]. The full field equations (8) have\nno energy-momentum tensor for the gravitational field\non the right-hand side. However, by expanding beyond\nthe linear terms we can find a suitable effective energymomentum tensor for GWs. Expanding Gμν in orders of\nhμν\nGμν = G (B) μν + G (1) μν + G (2) μν + . . .\n\n(59)\n\nWe use (B) for the background term instead of (0) to\navoid potential confusion regarding its order in ε. So far\nwe have assumed that our background is flat; however,\nwe can imagine that should the gravitational radiation\ncarry energy-momentum then this would act as a source\nof curvature for the background [80]. This is a secondorder effect that may be encoded, to accuracy of O(ε2 ),\nas\nG (B) μν = −G (2) μν .\n\nwhere γμν is the background metric. This changes our\ndefinition for hμν : instead of being the total perturbation from flat Minkowski, it is the dynamical part of the\nmetric with which we associate radiative effects. Since\nwe know that G (B) μν is O(ε2 ), we decompose our background metric as\nγμν = ημν + jμν ,\nλ\n\nwhere jμν is O(ε2 ) to ensure that R(B) μνρ is also O(ε2 ).\nTherefore its introduction will make no difference to the\nlinearized theory.\nWe will consider terms only to O(ε2 ). We identify\n(1) ρ\nΓ\nμν from (21). There is one small subtlety: whether\nwe use the background metric γ μν or η μν to raise indices\nof ∂μ and hμν . Fortunately, to the accuracy considered\nhere, it does not make a difference; however, we will consider the indices to be changed with γ μν . We will not\ndistinguish between ∂μ and ∇(B) μ , the covariant derivative for the background metric: to the order of accuracy\nrequired covariant derivatives would commute and ∇(B) μ\nbehaves just like ∂μ . Thus\n\u0011\nh \u0010\nρ\n1\nΓ(1) μν = γ ρλ ∂μ hλν − a2 R(1) γλν\n2\n\u0010\n\u0011\n+ ∂ν hλμ − a2 R(1) γλμ\n\u0010\n\u0011i\n− ∂λ hμν − a2 R(1) γμν ,\n(65)\n\n(60)\n\nand\n\nBy shifting G (2) μν to the right-hand side we create an\neffective energy-momentum tensor. As in GR we will average over several wavelengths, assuming that the background curvature is on a larger scale [34, 53],\nD\nE\nG (B) μν = − G (2) μν .\n(61)\n\nΓ(2)\n\nBy averaging we probe the curvature in a macroscopic region about a given point in spacetime, yielding a gaugeinvariant measure of the gravitational field strength. The\naveraging can be thought of as smoothing out the rapidly\nvarying ripples of the radiation, leaving only the coarsegrained component that acts as a source for the background curvature.3 The effective energy-momentum tensor for the radiation is\n1 D (2) E\ntμν = −\n(62)\nG μν .\n8πG\nHaving made this provisional identification, we must\nset about carefully evaluating the various terms in (59).\nWe begin as in Sec. III by defining a total metric\ngμν = γμν + hμν ,\n\n3\n\n(63)\n\nBy averaging we do not try to localise the energy of a wave to\nwithin a wavelength; for the massive Ricci scalar mode we always\nconsider scales greater than λR .\n\n(64)\n\nρ\nμν\n\n1\n= − hρλ (∂μ hλν + ∂ν hλμ − ∂λ hμν )\n2\n\u0011\n\u0011h \u0010\n1 \u0010 ρλ\n= − h − a2 R(1) γ ρλ ∂μ hλν − a2 R(1) γλν\n2 \u0010\n\u0011\n+ ∂ν hλμ − a2 R(1) γλμ\n\u0011i\n\u0010\n(66)\n− ∂λ hμν − a2 R(1) γμν .\n\nFor the Ricci tensor we can use our linearized expression, (39), for the first-order term,\n1\nR(1) μν = a2 ∂μ ∂ν R(1) + R(1) γμν .\n6\n\n(67)\n\nThe next term is\n(2) ρ\nμν − ∂ν Γ\nμρ\n(1) ρ\n(1) σ\nΓ\nμσ Γ\nρν\n\nR(2) μν = ∂ρ Γ(2)\n\nρ\n\n+ Γ(1)\n\nρ\n\nμν Γ\n\n(1) σ\n\nρσ\n\n−\n\u001a\nh\n1 1\nσρ\nσρ\n=\n∂μ ∂ν hσρ\n∂μ hσρ ∂ν h + h\n2 2\n\u0010\n\u0010\n\u0011\n+ ∂σ ∂ρ hμν − a2 R(1) γμν − ∂ν ∂ρ hσμ\n\u0011i\n\u0010\n\u0011\n− a2 R(1) γσμ − ∂μ ∂ρ hσν − a2 R(1) γσν\n\u0001\nσ\n+ ∂ ρ hν ∂ρ hσμ − ∂σ hρμ − a2 ∂ σ R(1) ∂σ hμν\n\u0010\n+ a22 2R(1) ∂μ ∂ν R(1) + 3∂μ R(1) ∂ν R(1)\n\u0011o\n.\n(68)\n+ R(1) \u0003(B) R(1) γμν\n\n\f8\nThe d'Alembertian is \u0003(B) = γ μν ∂μ ∂ν .\nTo find the Ricci scalar we contract the Ricci tensor\nwith the full metric. To O(ε2 ),\nR(B) = γ μν R(B) μν\nR\n\n(1)\n\nR\n\n(2)\n\n=γ\n\nμν\n\nR\n\nμν\n\n(1)\n\nand\n\n(69)\nf ′(B) = a2 R(B)\n\n(70)\n\nμν\n\n(2)\n\nμν\n\n(1)\n\n= γ R μν − h R μν\n1\n3\nσρ\nσμ\nμν\n= ∂μ hσρ ∂ μ h − ∂ ρ h ∂σ hρμ − 2a2 h ∂μ ∂ν R(1)\n4\n2\n3a22\n(1) 2\n∂μ R(1) ∂ μ R(1) .\n(71)\n+\n+ 2a2 R\n2\n\nf\n\n′(0)\n\nf\n\n′(1)\n\nf\n\n′(2)\n\n(75)\n\n=1\n\n(76)\n\n= a2 R\n\n(1)\n\n= a2 R\n\n(2)\n\n(77)\n2\na3\n+ R(1) .\n2\n\n(78)\n\nUsing these\nf (B) = R(B)\nf\n\n(1)\n\n=R\n\n(72)\n\n(1)\n\nf (2) = R(2) +\n\n(73)\na2 (1) 2\n,\nR\n2\n\n(74)\n\nG (2) μν = R(2) μν + f ′(1) R(1) μν − ∂μ ∂ν f ′(2) + Γ(1)\n\nρ\n\nWe list a zeroth-order term for clarity. R(B) is O(ε2 ).\nCombining all of these\n\nλ\n\n+ γμν γ ρσ ∂ρ ∂σ f ′(2) − γμν γ ρσ Γ(1) σρ ∂λ f ′(1)\n1\n1\n− γμν hρσ ∂ρ ∂σ f ′(1) + hμν γ ρσ ∂ρ ∂σ f ′(1) − f (2) γμν − f (1) hμν\n2\n2\n\u0011\n\u0011\n\u0010\n2\n1\n1 (2)\na3 \u0010\n(2)\n(B)\n(2)\nγμν \u0003(B) − ∂μ ∂ν R(1) − hμν R(1)\n= R μν + a2 γμν \u0003 − ∂μ ∂ν R − R γμν +\n2\n2\n6\n\u0012\n\u0013\n\u0001\n1\na\nσρ\n2\n(1) (1)\n(1)\nρ (1)\n(1) 2\n− a2 γμν h ∂σ ∂ρ R + ∂ R\n∂μ hρν + ∂ν hρμ − ∂ρ hμν + a2 R R μν + R\nγμν\n2\n4\n\u0013\n\u0012\n1\n− a22 ∂μ R(1) ∂ν R(1) + γμν ∂ ρ R(1) ∂ρ R(1) .\n2\n\nIt is simplest to split this up for the purposes of averaging. Since we average over all directions at each point,\ngradients average to zero [34, 77]\nh∂μ V i = 0.\n\n(80)\n\nAs a corollary of this we have\nhU ∂μ V i = − hV ∂μ U i .\n\n(81)\n\nRepeated application of this, together with our gauge\ncondition, (38), and wave equations, (28) and (44), allows\nus to eliminate many terms. Those that do not average\nto zero are the last three terms in (79), plus\n\u001c\n1\na2\nρσ\nR μν = − ∂μ hσρ ∂ν h + 2 ∂μ R(1) ∂ν R(1)\n4\n2\nE\na2\n(1) 2\n+ γμν R\n;\n(82)\n6\n\u001d\n\u001c\nE\nD\n3a2 (1) 2\n;\n(83)\nR\nR(2) =\n2\n\u001c\n\u001d\nE\nD\n2\n1\nR(1) R(1) μν = a2 R(1) ∂μ ∂ν R(1) + γμν R(1) . (84)\n6\nD\n\n(2)\n\nE\n\nνμ ∂ρ f\n\n′(1)\n\n(79)\n\nCombining terms gives\n\u001d\nE \u001c 1\nD\n3a2\nρσ\nG (2) μν = − ∂μ hσρ ∂ν h − 2 ∂μ R(1) ∂ν R(1) .\n4\n2\n(85)\nThus we obtain the result\nE\n1 D\nρσ\ntμν =\n∂μ hσρ ∂ν h + 6a22 ∂μ R(1) ∂ν R(1) . (86)\n32πG\n\nIn the limit of a2 → 0 we obtain the familiar GR result as\nrequired. The GR result is also recovered if R(1) = 0, as\nwould be the case if the Ricci mode was not excited; for\nexample, if the frequency was below the cutoff frequency\nΥ. Rewriting the effective energy-momentum tensor in\nterms of metric perturbation hμν , using (57),\n\u001c\n\u001d\n1\n1\n∂μ hσρ ∂ν hρσ + ∂μ h∂ν h .\ntμν =\n(87)\n32πG\n8\nThese results do not depend upon a3 or higher-order coefficients [34].\nThe effective energy-momentum tensor could be used\nto constrain the parameter a2 through observations of\nthe energy and momentum carried away by GWs. Of\nparticular interest would be a system with a frequency\n\n\f9\nthat evolved from ω < Υ to ω > Υ, as then we would\nwitness the switching on of the propagating Ricci mode.\nIf we could accurately identify the cutoff frequency we\ncould accurately measure a2 . However, see Sec. VIII C\nfor further discussion of why this is unlikely to happen.\n\nwhere \u0003 acts on x. The Green's function is familiar as\nthe Klein-Gordon propagator (up to a factor of −i) [81]\n\nf (R) WITH A SOURCE\n\nVI.\n\nHaving considered radiation in a vacuum, we now add\na source term. We want a first-order perturbation, so the\nlinearized field equations are\nG (1) μν = 8πGTμν .\n\nWe will again assume a Minkowski background, considering terms to O(ε) only. To solve the wave equations (28)\nand (44) with this source term we use a Green's function\n\u0001\n\u0003 + Υ2 GΥ (x, x′ ) = δ(x − x′ ),\n(89)\n\n(88)\n\nGΥ (x, x′ ) =\n\nZ\n\nd4 p exp [−ip * (x − x′ )]\n.\n(2π)4\nΥ 2 − p2\n\nThis can be evaluated by a suitable contour integral to\ngive\n\nZ\nh\n\u00011/2 i\ndω\n1\n\n\nr\nexp [−iω(t − t′ )]\nexp i ω 2 − Υ2\n\n2π\n4πr\nGΥ (x, x′ ) = Z dω\nh\n\u00011/2 i\n1\n\n\nr\nexp [−iω(t − t′ )]\nexp − Υ2 − ω 2\n\n2π\n4πr\nwhere we have introduced t = x0 , t′ = x′0 and r =\n|x − x′ |. For Υ = 0\nG0 (x, x′ ) =\n\nδ(t − t′ − r)\n,\n4πr\n\nThis is exactly as in GR, so we can use standard results.\nSolving for the scalar mode\nZ\n(1)\n2\nR (x) = −8πGΥ\nd4 x′ GΥ (x, x′ )T (x′ ).\n(94)\n\nTo proceed further we must know the form of the trace\nT (x′ ). In general the form of R(1) (x) will be complicated.\nA.\n\nThe Newtonian limit\n\nLet us consider the limiting case of a Newtonian source,\nsuch that\nT00 = ρ;\n\n|T00 | ≫ |T0i |;\n\n|T00 | ≫ |Tij |,\n\n(95)\n\nwith a mass distribution of a stationary point source\nρ = M δ(x′ ).\n\n(96)\n\nThis source does not produce any radiation. As in GR\nh00 = −\n\n4GM\n;\nr\n\nh0i = hij = 0.\n\n(97)\n\nω 2 > Υ2\nω 2 < Υ2\n\n,\n\n(91)\n\nSolving for the Ricci scalar\nR(1) = −2GΥ2 M\n\n(92)\n\nthe familiar retarded-time Green's function. We can use\nthis to solve (44)\nZ\nhμν (x) = −16πG d4 x′ G0 (x, x′ )Tμν (x′ )\nZ\nTμν (t − r, x′ )\n.\n(93)\n= −4G d3 x′\nr\n\n(90)\n\nexp(−Υr)\n.\nr\n\n(98)\n\nCombining these in (41b) yields a metric perturbation\nwith nonzero elements\n\u0014\n\u0015\nexp(−Υr)\n2GM\n1+\n;\nh00 = −\nr\n3\n\u0014\n\u0015\n(99)\n2GM\nexp(−Υr)\nhij = −\n1−\nδij .\nr\n3\nThus, to first order, the metric for a point mass in f (R)gravity is [56, 82, 83]\nds2 =\n\n\u0014\n\u0015\u001b\n\u001a\nexp(−Υr)\n2GM\n1+\ndt2\n1−\nr\n3\n\u001a\n\u0014\n\u0015\u001b\n2GM\nexp(−Υr)\n− 1+\n1−\ndΣ2 , (100)\nr\n3\n\nusing dΣ2 = dx2 + dy 2 + dz 2 . This is not the linearized\nlimit of the Schwarzschild metric (although it is recovered\nas a2 → 0, Υ → ∞) [84]. This metric has already been\nderived for the case of quadratic gravity, which includes\nterms like R2 and Rμν Rμν in the Lagrangian [73, 74, 85,\n86]. In linearized theory our f (R) reduces to quadratic\ntheory, as to first order f (R) = R + a2 R2 /2.\nExtending this result to a slowly rotating source with\nangular momentum J, we then have the additional\nterm [77]\nh\n\n0i\n\n=−\n\n2G ijk\nǫ Jj xk ,\nc2 r 3\n\n(101)\n\n\f10\nwhere ǫijk is the Levi-Civita alternating tensor. The metric is\n\u0014\n\u0015\u001b\n\u001a\nexp(−Υr)\n2GM\n1+\ndt2\nds2 = 1 −\nr\n3\n4GJ\n+ 3 (xdy − ydx) dt\n\u001ar\n\u0014\n\u0015\u001b\n2GM\nexp(−Υr)\n− 1+\n1−\ndΣ2 , (102)\nr\n3\nwhere z is the rotation axis. This is not the first-order\nlimit of the Kerr metric (aside from as a2 → 0, Υ → ∞).\nIn f (R)-gravity Birkhoff's theorem no longer applies [85–89]: the metric about a spherically symmetric mass does not correspond to the equivalent of the\nSchwarzschild solution. The distribution of matter influences how the Ricci scalar decays, and consequently\nGauss' theorem is not applicable. Repeating our analysis for a (nonrotating) sphere of uniform density and\nradius L\nh00 = −\n\n4GM\n;\nr\n\nh0i = hij = 0,\n\n(103)\n\nas in GR, and for the point mass, but\n\u0014\n\u0015\nexp(−Υr) ΥL cosh(ΥL) − sinh(ΥL)\n(1)\nR = −6GM\nr\nΥL3\nexp(−Υr) 2\n= −6GM\nΥ Ξ(ΥL),\n(104)\nr\ndefining Ξ(ΥL) in the last line.4 The metric perturbation\nthus has nonzero first-order elements [86, 88, 89]\nh00 = − 2GM [1 + exp(−Υr)Ξ(ΥL)] ;\nhij = − 2GM [1 − exp(−Υr)Ξ(ΥL)] δij .\n\n(105)\n\nwhere we have assumed that r > L at all stages.5\nSolving the full field equations to find the exact metric\nin f (R) is difficult because of the higher-order derivatives\nthat enter the equations. However, we expect a solution\nto have the appropriate limiting form as given above.\nIt has been suggested that since R = 0 is a valid solution to the vacuum equations, the BH solutions of GR\nshould also be the BH solutions in f (R) [31, 33]. However, while the Kerr solutions are solutions of the vacuum field equations, the presence of a source complicates\nthe issue; it may be that the end point of gravitational\ncollapse is not the Kerr solution, and so astrophysical\nBHs in f (R)-gravity may not be the same as their GR\nequivalents. We have seen that having a nonzero stressenergy tensor at the origin, because of (28), forces R to\nbe nonzero in the surrounding vacuum, although it will\ndecay to zero at infinity [90]. While one cannot generalise straightforwardly from our simple δ-function sources\n\nto complete BH solutions, because of the horizon in the\nBH spacetime, these solutions suggest that astrophysical\nBHs could be different from the Kerr solution.6 If astrophysical BHs are not described by the Kerr metric, these\nweak-field metrics provide a reasonable candidate for the\nalternative form.\nIf the astrophysical BHs in f (R)-gravity have a different structure from their GR counterparts it should be\npossible to distinguish between theories by observing the\nBHs that form. It is this possibility that we focus on in\nthe next section. Even in the event that the BH spacetimes do coincide, we could still detect differences in the\nproperties of extended sources.\nB.\n\nIt is useful to transform the weak-field metric, (102),\nto the more familiar form\n4GJ\nsin2 θdφdt − B(e\nr )de\nr 2 − re 2 dΩ2 .\nre\n(106)\nThe coordinate re is a circumferential measure, as in the\nSchwarzschild metric, as opposed to r, used in preceding\nsections, which is a radial distance (an isotropic coordinate) [53, 90]. To simplify the algebra we introduce the\nSchwarzschild radius\nds2 = A(e\nr )dt2 +\n\nrS = 2GM.\n\n5\n\nΞ(0) = 1/3 is the minimum of Ξ(ΥL).\nInside the source R(1) = −(6GM/L3 )[1 − (ΥL + 1) exp(−ΥL) ×\nsinh(Υr)/Υr].\n\n(107)\n\nIn the linearized regime, we require that the new radial\ncoordinate satisfies\n\u001a\n\u0014\n\u0015\u001b\nrS\nexp(−Υr)\n2\nre = 1 +\n1−\nr2\n(108)\nr\n3\n\u0014\n\u0015\nexp(−Υr)\nrS\n1−\n.\n(109)\nre = r +\n2\n3\n\nThis can be used as an implicit definition of r in terms\nof re. To first order in rS /r [90]\n\u0014\n\u0015\nexp(−Υr)\nrS\n1+\n.\n(110)\nA(e\nr) = 1 −\nre\n3\n\nWe see that the functional form of g00 is almost unchanged upon substituting re for r; however r is still in\nthe exponential.\nTo find B(e\nr ) we consider, using (109),\n\u001b\n\u001a\nde\nr\ndr\n1 + ΥrS r exp(−Υr)/6e\nr\n= d ln re =\n.\nre\n1 + (rS /2e\nr) [1 − exp(−Υr)/3] r\n(111)\n6\n\n4\n\nThe weak-field metric\n\nThere is currently no proof of the uniqueness of the Kerr solutions\nas the end state of gravitational collapse in f (R), although there\ndoes exist a similar result for the closely related Brans-Dicke\ntheory [91–94].\n\n\f11\nThus\n\nform\n\nre 2\nde\nr = 2\nr\n2\n\n\u001a\n\n1 + ΥrS r exp(−Υr)/6e\nr\n1 + (rS /2e\nr) [1 − exp(−Υr)/3]\n−1\n\nThe term in braces is [B(e\nr )]\nweak-field\nε∼\n\n\u001b2\n\ndr . (112)\n\n. We assume that in the\n\nrS\nr\n\n(113)\n\nis small. Then the metric perturbations from Minkowski\nare small. Expanding to first order [90]\nB(e\nr) = 1 +\n\nduμ\n1\n= (∂μ gρσ ) uρ uσ ,\ndτ\n2\n\n2\n\n\u0014\n\u0015\nrS\nexp(−Υr)\nΥrS exp(−Υr)\n1−\n−\n. (114)\nre\n3\n3\n\nIn the limit Υ → ∞, where we recover GR, A(e\nr ) and\nB(e\nr ) tend to their Kerr (Schwarzschild) forms.\nIn the following sections we will use these weak-field\nmetrics (in both coordinates) with astrophysical and laboratory tests of gravity to place constraints on f (R).\n\n(117)\n\nwhere uμ is the 4-velocity. For a circular equatorial orbit,\nsetting μ = re gives the frequency of the orbit ω0 = dφ/dt\nas\ns\n\u00132\n\u0012\nGJ\n1 2A′\n2GJ\nω0 = − 3 ±\n,\n(118)\n+\nre\n2\nre\nre 3\nin which a dash denotes d/de\nr and the +/− sign denotes\nprograde/retrograde orbits. The definition of proper\ntime gives\nṫ =\n\n\u0013−1/2\n\u0012\n4GJω0\n− re 2 ω02\n.\nA+\nre\n\n(119)\n\nWe now have both ṫ and φ̇ = ω0 ṫ as functions of re; substitution into (115) and (116) allows us to find the energy\nand angular momentum in terms of re.\nFrom the Hamiltonian H = gμν uμ uν we can obtain the\ngeneral equation of motion for massive particles, using\nthe substitutions\nE\n2GJ\nLz ,\n−\nA\nAe\nr3\nLz\n2GJE\n+ 2 2 ,\nφ̇ =\nAe\nr3\nre sin θ\nṫ =\n\nVII.\n\nEPICYCLIC FREQUENCIES\n\nOne means of probing the nature of a spacetime is\nthrough observations of orbital motions [28]. We will\nconsider the epicyclic motion produced by perturbing a\ncircular orbit. There are two epicyclic frequencies associated with any circular-equatorial orbit, characterizing\nperturbations in the radial and vertical directions respectively [95]. We will start by deriving a general result for\nany metric of the form of (106), and then specialise to our\nf (R) solution. We will work in the slow-rotation limit,\nkeeping only linear terms in J.\nAn orbit in a spacetime described by (106) has as constants of motion: the orbiting particle's rest mass, the energy (per unit mass) of the orbit E and the z-component\nof the angular momentum (per unit mass) Lz . Using\nan over-dot to denote differentiation with respect to an\naffine parameter, which we identify as proper time τ ,\n2GJ\nsin2 θφ̇;\nre\n2GJ\nsin2 θṫ.\nLz = re 2 sin2 θ φ̇ −\nre\nE = Aṫ +\n\n(115)\n(116)\n\nWe will consider perturbations of circular-equatorial orbits; orbits such that rė = rë = θ̇ = 0 and θ = π/2. The\ntimelike geodesic equation can be written in the covariant\n7\n\nIt is not possible for the orbit to be perturbed without changing\n\n(120)\n(121)\n\nwhere we have linearized in J, as appropriate for the\nslow-rotation limit. With these replacements, the general\ntimelike geodesic equation takes the form\n\u0012\n\u0013\n2\nL2z\nre 2 2\nE2\n1\n4GJELz\n1+ 2 2\nrė +\nθ̇ =\n−\n−\nB\nAB\nABe\nr3\nB\nre sin θ\n= V (e\nr , θ, E, Lz ).\n(122)\nTo compute the epicyclic frequency we imagine the orbit\nis perturbed by a small amount, while E and Lz are unchanged.7 For radial perturbations re = r(1 + δ), where r\nis the radius of the unperturbed orbit, the orbit undergoes small oscillations with frequency\nṫ2 Ω2rad = −\n\n1 ∂2V\n2 ∂e\nr2\n\n.\n\n(123)\n\nr, θ = π/2\n\nSmall vertical perturbations θ = π/2 + δ oscillate with\nfrequency\nṫ2 Ω2vert = −\n\n1 B(r) ∂ 2 V\n2 r 2 ∂θ2\n\n.\n\n(124)\n\nr, θ = π/2\n′\n\nWe will denote A(r) ≡ A, B(r) ≡ B, A′ (r) ≡ A , etc.;\ndifferentiating the potential from (122) we find\n\n\f12\n!\n3\n= −E\n−\n−\n+ 2 2+\n− 3 − 2 −\n3\n2\n3 −\n2\n2 +\n3 −\n2\nBr 4\nA B\n2A B\nA B\nAB\n2A B\n2B\nB\n2B r 2\nB r2\nB r3\n#\n\" ′2\n!\n′′\n′ ′\n′2\n′′\n′\n′\nA\nAB\nB\nB\nA\nB\n6\n4GJELz A\n3\n(125)\n+\n+\n+\n−\n+\n−\n+\n+\n3\n2\n2 2\n3\n2\n2\n2\n2\nr\nr3\nA\nBr\nA B\n2A B\nA B\nAB\n2A B\nA B\nAB\n!\n!\n′′\n′\n′′\nL2z\n6GJELz A\nA\n3\n2A\n4\n= 3\n+\n;\n(126)\n+\n−\n′ +\nr\nr\nr B A′\nA\nA Br 4\nA\n′2\n\nṫ\n\n2\n\nΩ2rad\n\n2\n\nṫΩvert =\n\nA\n\nA\n\n′′\n\n′\n\nAB\n\n′\n\nB\n\n′2\n\nB\n\n′′\n\nLz\n.\nr2\n\nGravitational-wave constraints\n\nWe are interested in whether or not the deviation arising from the f (R) correction would be observable. In\nprinciple, the deviations will be observable if the orbit\nlooks sufficiently different from orbits in the Kerr metric.8\nTo quantify the amount of difference, we need to identify orbits between the two spacetimes, and for circularequatorial orbits there is a natural way to do this: by\nidentifying orbits with the same frequency ω0 , since this\nis a gauge-invariant observable quantity [96]. The quantity\n∆(ω0 , Υ) = Ω(ω0 , Υ) − Ω(ω0 , Υ → ∞)\n\n(128)\n\ncharacterizes the rate of increase in the phase difference\nbetween the f (R) trajectory and the Kerr trajectory with\nthe same frequency and spin parameter.9 A physical\neffect is in principle observable if it leads to a significant phase shift in a gravitational waveform over the\nlength of an observation. Thus, a simple criterion for\nthe f (R) theory to be distinguishable from GR would\nbe that Tobs ∆ > 2π, for observation period Tobs . This\nis a significant oversimplification, since we have assumed\nthat only the orbital frequency has been matched to a\n\n8\n\n9\n\nB\n\n′′\n\nB\n\n′2\n\nL2z\n\nB\n\n′′\n\nB\n\n′2\n\n2B\n\n′\n\n(127)\n\nTo simplify (125) we have used conditions imposed by\nsetting V and ∂V /∂e\nr equal to zero for circular, equatorial\norbits. These results hold for any metric of the general\nform (106), subject to the slow-rotation condition, which\nwe have used to linearize in J at various stages.\nA.\n\n!\n\nthe energy or angular momentum. However, these corrections\nare quadratic in the amplitude of the perturbation, and so we\ncan ignore them at linear order.\nHere we assume that the end point of gravitational collapse is\nnot the Kerr solution, and that the weak-field f (R) metric is a\nreasonable approximation to the true astrophysical BH solution.\nIf it were Kerr, the epicyclic frequencies would not differ between\nf (R) and GR.\nBy comparing the trajectory to the Υ → ∞ limit of the trajectory\nrather than the exact Kerr result ensures that we are taking the\nsame slow rotation limit in both cases, and will not be dominated\nby O(J 2 ) corrections.\n\nKerr value, while small changes in the other parameters\nsuch as the BH mass and spin, the orbital eccentricity\nand inclination, and so on, could mimic the effects of an\nf (R) deviation. On the other hand, we are also keeping\nthe orbital frequency fixed whereas we will observe inspirals, and this tends to break the parameter degeneracies.\nSince we are interested in extreme-mass-ratio systems,\nfor which the inspiral proceeds slowly, it is likely that\nwe are being over-optimistic, so these results can be considered upper bounds on what could be measurable. A\nfuller analysis accounting for parameter correlations and\ninspiral is beyond the scope of this paper.\nThe timescale of the systems we are considering is set\nby the BH mass, and the quantities M ω0 and M ∆ are\nmass-independent. A duration of a typical EMRI observation with LISA will be of the order of a year, and so\nthe criterion for detectability becomes\n\u0012\n\u0013\u0012\n\u0013\nM\nyr\nGM ∆ = 9.8 × 10−7\n.\n(129)\n106 M⊙\nTobs\nIn Fig. 1 we show the region of Υ-ω0 parameter space\nin which f (R) gravity could be distinguished from GR,\nas defined by this criterion. Each curve represents a\nparticular choice for GM ∆, and the region below the\ncurve is detectable in an observation characterized by\nthat choice for M ∆. Equation (129) indicates that the\ncurve GM ∆ = 10−6 is what would be achieved in a\none-year observation for a 106 M⊙ mass BH. The curves\nGM ∆ = 10−5 /10−7 are the corresponding results for a\n107 /105 M⊙ mass BH, while the curve GM ∆ = 3 × 10−7\nrepresents what would be achieved in a three-year observation and so on. We show results for two different\nchoices of spin, a = J/(GM 2 ) = 0 and a = 0.5, and\nit is clear that there is not too much difference between\nthe two; although the vertical epicyclic frequency is only\nmeasurable for a 6= 0 since it coincides with the orbital\nfrequency for a = 0 because of the spherical symmetry\nof the potential. The results for the radial epicyclic frequency do not differ hugely between a = 0 and a = 0.5\nin this weak-field metric approximation. We note also\nthat we show results only for prograde orbits. For a 6= 0,\nwe can also compute results for retrograde orbits, and\nthese differ from the prograde results but only by a small\namount which is almost indistinguishable on the scale of\nthese plots.\n\n\f13\n1\n\n1\n\n10\n\n10\n−8\n\n−8\n\nGM∆ = 3×10\n−7\nGM∆ = 1×10−7\nGM∆ = 3×10\n−6\nGM∆ = 1×10\n−6\nGM∆ = 3×10\n−5\nGM∆ = 1×10\n\n0\n\n0\n\nGMΥ\n\n10\n\nGMΥ\n\n10\n\nGM∆ = 3×10\n−7\nGM∆ = 1×10−7\nGM∆ = 3×10\n−6\nGM∆ = 1×10\n−6\nGM∆ = 3×10\n−5\nGM∆ = 1×10\n\n−1\n\n−1\n\n10\n\n10\n\n−2\n\n−2\n\n10\n\n10\n−4\n\n−3\n\n10\n\n−2\n\n10\n\n10\n\n−1\n\n−4\n\n10\n\n−3\n\n10\n\n−2\n\n10\n\nGMω0\n\n10\n\n−1\n\n10\n\nGMω0\n\nFIG. 1. Region of parameter space in which f (R) theories can be distinguished from GR when the central BH has spin a = 0\n(left panel) or a = 0.5 (right panel). Each curve corresponds to a particular specification of the detectability criterion given in\n(129) in the text, as identified in the key. Dashed lines correspond to measurements of the vertical epicyclic frequency, while\nsolid lines represent measurements of the radial epicyclic frequency. The region below the curve could be distinguishable in a\nLISA observation with that detectability value.\n\nOur conclusion from Fig. 1 is that, broadly speaking,\nwe would be able to distinguish spacetimes with GM Υ .\n1, for a 106 M⊙ BH this corresponds to Υ . 10−9 m−1 .\nSomewhat larger values are accessible at higher frequencies, but this conclusion must be treated somewhat cautiously, as the inspiral would pass through that region\nfairly quickly, and those orbits correspond to relatively\nsmall values of the orbital radius at which the approximations that we made deriving the weak-field metric begin\nto break down. For this criterion, the radial epicyclic frequency is always a more powerful probe than the vertical\nepicyclic frequency. This is to be expected, since the latter is generally smaller in magnitude and so fewer cycles\naccumulate over a typical observation.\nVIII.\n\nSOLAR SYSTEM AND LABORATORY\nTESTS\nA.\n\nPost-Newtonian parameter γ\n\nThe parametrized post-Newtonian (PPN) formalism\nwas created to quantify deviations from GR [1, 2]. It\nis ideal for Solar System tests. The only parameter we\nneed to consider here is γ, which measures the spacecurvature produced by unit rest mass. The PPN metric\nhas components\ng00 = 1 − 2U ;\n\ngij = −(1 + 2γU )δij ,\n\ndirect correspondence because of the exponential.10 It\nhas been suggested that this may be incorporated by\nchanging the definition of the potential U [40, 57, 90, 99],\nthen\nγ=\n\nGM\n.\nr\n\nTo post-Newtonian order, this has nonzero connection\ncoefficients\n\nP ′ xi\nP ′ xi\n;\nΓi 00 =\n;\n2r\n2r\n(134)\n′\nk\nj\nQ (δij x + δik x − δjk xi )\ni\nΓ jk =\n.\n2r\nThe photon trajectory is described by the geodesic equation\nΓ0 0i =\n\ndxν dxρ\nd2 xμ\n+ Γμ νρ\n= 0,\n(135)\n2\ndσ\ndσ dσ\nfor affine parameter σ. The time coordinate obeys\ndxν dxρ\nd2 t\n0\n+\nΓ\n= 0,\nνρ\ndσ 2\ndσ dσ\n\n(130)\n\n(131)\n\nThe metric must be in isotropic coordinates [2, 53]. The\nf (R) metric (100) is of a similar form, but there is not a\n\n(132)\n\nAs Υ → ∞, the GR value of γ = 1 is recovered. However, the experimental bounds for γ are derived assuming\nthat it is a constant [2]. Since this is not the case, we\nwill rederive the post-Newtonian, or O(ε), corrections to\nphoton trajectories for a more general metric. We define\n\u0001\n(133)\nds2 = P (r)dt2 − Q(r) dx2 + dy 2 + dz 2 .\n\nwhere for a point mass\nU (r) =\n\n3 − exp(−Υr)\n.\n3 + exp(−Υr)\n\n10\n\n(136)\n\nOur f (R) theory is equivalent to a Brans-Dicke theory with a\npotential and parameter ωBD = 0 [97, 98]. We cannot use the\nfamiliar result γ = (1 + ωBD )/(2 + ωBD ) [1] as this was derived\nfor Brans-Dicke theory without a potential [2].\n\n\f14\nso we can rewrite the spatial components of (135) using\nt as an affine parameter [2]\n\u0013\n\u0012\ndxi dxν dxρ\nd2 xi\ni\n0\n+ Γ νρ − Γ νρ\n= 0.\n(137)\ndt2\ndt\ndt dt\n\nSince the geodesic is null we also have\n\ndxμ dxν\n= 0.\ndt dt\nTo post-Newtonian accuracy these become\n!\n2\nd2 xi\nQ′ dx\nP′\nxi\n=−\n−\ndt2\n2r\n2r dt\ngμν\n\n(138)\n\ndx dxi\nP ′ − Q′\nx*\n,\n(139)\nr\ndt dt\n2\ndx\n0=P −Q\n.\n(140)\ndt\nThe Newtonian, or zeroth-order, solution of these is propagation in a straight line at constant speed [2]\n+\n\nxiN = ni t;\n\n|n| = 1.\n\n(141)\n\nThe post-Newtonian trajectory can be written as\nxi = ni t + xipN\n\n(142)\n\nwhere xipN is the deviation from the straight line. Substituting this into (139) and (140) gives\n1\nd2 xpN\n= − ∇(P − Q) + n * ∇(P − Q)n, (143)\ndt2\n2\nP −Q\ndxpN\n=\n.\n(144)\nn*\ndt\n2\nThe post-Newtonian deviation only depends upon the\ndifference P − Q. From (100)\n4GM\nP (r) − Q(r) = −\nr\n= −4U (r).\n(145)\nThis is identical to in GR. The result holds not just for\na point mass, we see, using (41b),\nP (r) − Q(r) = h00 + hii\n= h00 + hii ,\n\n(no summation)\n(146)\n\nand since hμν obeys (44) exactly as in GR, there is no\ndifference. We conclude that an appropriate definition\nfor the post-Newtonian parameter is\ng00 + gii\n−1\n(no summation).\n(147)\nγ=−\n2U\nUsing this, our f (R) solutions have γ = 1. This agrees\nwith the result found by Clifton [58].11 Consequently,\nf (R)-gravity is indistinguishable from GR in this respect\nand is entirely consistent with the current observational\nvalue of γ = 1 + (2.1 ± 2.3) × 10−5 [1, 5]. We must use\nother experiments to put constraints upon f (R).\n\nB.\n\nWe can also use the epicyclic frequencies derived in\nSec. VII for the classic test of planetary precession in the\nSolar System. Radial motion perturbs the orbit into an\nellipse. The amplitude of our perturbation δ gives the\neccentricity e of the ellipse [100]. Unless ω0 = Ωrad the\nepicyclic motion will be asynchronous with the orbital\nmotion: there will be precession of the periapsis. In one\nrevolution the ellipse will precess about the focus by\n\u0012\n\u0013\nω0\n̟ = 2π\n−1\n(148)\nΩrad\nwhere ω0 is the frequency of the circular orbit, given in\n(118). The precession is cumulative, so a small deviation may be measurable over sufficient time. Taking the\nnonrotating limit, the epicyclic frequency is\n\u0015\n\u0014\n3rS\n2\n2\n(149)\nΩrad = ω0 1 −\n− ζ(Υ, rS , r) ,\nr\ndefining the function\n\u0012\n\u0013\n1\nΥ2 r2 exp(−Υr)\nexp(−Υr)\nζ = rS\n+Υ\n+\nr\n3\n3 + (1 + Υr) exp(−Υr)\n\u0014\n\u0012\n\u0015\n\u0013\nrS\n1\nexp(−Υr)\n× 1−\n.\n(150)\n+ rS\n+Υ\nr\nr\n3\nThis characterizes the deviation from the Schwarzschild\ncase: the change in the precession per orbit relative to\nSchwarzschild is\n∆̟ = ̟ − ̟S\n= πζ,\n\nClifton [58] also gives PPN parameters β = 1, ζ1 = 0, ζ3 = 0\nand ζ4 = 0, all identical to in GR.\n\n(151)\n(152)\n\nusing the subscript S to denote the Schwarzschild value.\nTo obtain the last line we have expanded to lowest order,\nassuming that ζ is small.12 Since ζ ≥ 0, the precession\nrate is enhanced relative to GR.\nTable I shows the orbital properties of the planets. We\nwill use the deviation in perihelion precession rate from\nthe GR prediction to constrain the value of ζ, and hence\nΥ and a2 . All the precession rates are consistent with\nGR predictions (∆̟ = 0) to within their uncertainties.\nAssuming that these uncertainties constrain the possible deviation from GR we can use them as bounds for\nthe f (R) corrections. Table II shows the constraints for\nΥ and a2 obtained by equating the uncertainty in the\nprecession rate σ∆̟ with the f (R) correction, and similarly using twice the uncertainty 2σ∆̟ . The tightest\nconstraint is obtained from the orbit of Mercury. Adopting a value of Υ ≥ 5.3 × 10−10 m−1 , the cutoff frequency\nfor the Ricci mode is ≥ 0.16 s−1 . Therefore it could lie in\n\n12\n11\n\nPlanetary precession\n\nThere is one term in ζ that is not explicitly O(ε). Numerical\nevaluation shows that this is < 0.6 for the applicable range of\nparameters.\n\n\f15\nTABLE I. Orbital properties of the eight major planets and Pluto. We take the semimajor orbital axis to be the flat-space\ndistance r, not the coordinate re. The eccentricity is not used in calculations, but is given to assess the accuracy of neglecting\nterms O(e2 ).\nPlanet\nMercury\nVenus\nEarth\nMars\nJupiter\nSaturn\nUranus\nNeptune\nPluto\n\nSemimajor axis [101]\nr/1011 m\n0.57909175\n1.0820893\n1.4959789\n2.2793664\n7.7841202\n14.267254\n28.709722\n44.982529\n59.063762\n\nOrbital period [101]\n(2π/ω0 )/yr\n0.24084445\n0.61518257\n0.99997862\n1.88071105\n11.85652502\n29.42351935\n83.74740682\n163.7232045\n248.0208\n\nPrecession rate [102]\n∆̟ ± σ∆̟ /mas yr−1\n−0.040 ± 0.050\n0.24 ± 0.33\n0.06 ± 0.07\n−0.07 ± 0.07\n0.67 ± 0.93\n−0.10 ± 0.15\n−38.9 ± 39.0\n−44.4 ± 54.0\n28.4 ± 45.1\n\nEccentricity [101]\ne\n0.20563069\n0.00677323\n0.01671022\n0.09341233\n0.04839266\n0.05415060\n0.04716771\n0.00858587\n0.24880766\n\nTABLE II. Bounds calculated using uncertainties in planetary perihelion precession rates. Υ must be greater than or equal to\nthe tabulated value, |a2 | must be less than or equal to the tabulated value.\nUsing σ∆̟\nΥ/10−11 m−1\n52.6\n25.3\n19.1\n12.2\n2.96\n1.69\n0.58\n0.35\n0.26\n\nPlanet\nMercury\nVenus\nEarth\nMars\nJupiter\nSaturn\nUranus\nNeptune\nPluto\n\nUsing 2σ∆̟\n|a2 |/1018 m2\n1.2\n5.2\n9.1\n22\n380\n1200\n9800\n28000\n49000\n\nthe upper range of the LISA frequency band [13, 14] or in\nthe LIGO/Virgo frequency range [8–10]. The constraints\nare not as tight as those which could be placed using\ngravitational-wave observations. However, as we will see\nin Sec. VIII C, it is possible to place stronger constraints\non Υ using laboratory experiments.\nC.\n\nFifth-force tests\n\nFrom the metric (100) we see that a point mass has a\nYukawa gravitational potential [82, 83, 86]\n\u0014\n\u0015\nexp(−Υr)\nGM\n1+\n.\n(153)\nV (r) =\nr\n3\nPotentials of this form are well studied in fifth-force\ntests [1, 3, 4] which consider a potential defined by a\ncoupling constant α and a length-scale λ such that\n\u0010 r \u0011i\nGM h\n1 + α exp −\n.\n(154)\nV (r) =\nr\nλ\nWe are able to put strict constraints upon our lengthscale λR , and hence a2 , since our coupling constant αR =\n1/3 is relatively large. This can be larger for extended\nsources: comparison with (105) shows that for a uniform\nsphere αR = Ξ(ΥL) ≥ 1/3.\n\nΥ/10−11 m−1\n51.3\n24.6\n18.6\n11.9\n2.87\n1.63\n0.56\n0.33\n0.25\n\n|a2 |/1018 m2\n1.3\n5.5\n9.6\n24\n410\n1200\n11000\n31000\n55000\n\nThe best constraints at short distances come from the\nEöt-Wash experiments, which use torsion balances [103,\n104]. These constrain λR . 8 × 10−5 m. Hence we determine |a2 | . 2 × 10−9 m2 . A similar result was obtained\nby Näf and Jetzer [83]. This would mean that the cutoff frequency for a propagating scalar mode would be\n& 4 × 1012 s−1 . This is much higher than expected for\nastrophysical objects.\nFifth-force tests also permit λR to be large. This degeneracy can be broken using other tests; from Sec. VII\nwe know that the large range for λR is excluded by planetary precession rates. This is supported by a result of\nNäf and Jetzer [83] obtained using the results of Gravity\nProbe B [6].\nWhile the laboratory bound on λR may be strict\ncompared to astronomical length-scales, it is still much\ngreater than the expected characteristic gravitational\nscale, the Planck length lP . We might expect for a nat2\n2\n); however lP\n=\nural quantum theory that a2 ∼ O(lP\n−70\n2\n2.612 × 10\nm , thus the bound is still about 60 orders of magnitude greater than the natural value. The\nonly other length-scale that we could introduce would be\ndefined by the cosmological constant Λ. Using the concordance values [47] Λ = 1.26 × 10−52 m−2 ; we see that\nΛ−1 ≫ |a2 |. It is intriguing that if we combine these two\nlength-scales we find lP /Λ1/2 = 1.44 × 10−9 m2 , which\nis of the order of the current bound. This is likely to be\n\n\f16\na coincidence, since there is nothing fundamental about\nthe current level of precision. It would be interesting to\nsee if the measurements could be improved to rule out a\nYukawa interaction around this length-scale.\n\nIX.\n\nSUMMARY AND CONCLUSIONS\n\nWe have examined the possibility of testing f (R) type\nmodifications to gravity using future gravitational-wave\nobservations and other measurements. We have seen that\ngravitational radiation is modified in f (R)-gravity as the\nRicci scalar is no longer constrained to be zero and, in\nlinearized theory, there is an additional mode of oscillation, that of the Ricci scalar. This is only excited above a\ncutoff frequency, but once a propagated mode is excited,\nit will carry additional energy-momentum away from the\nsource. The two transverse GW modes are modified from\ntheir GR counterparts to include a contribution from the\nRicci scalar, see (41a), which will allow us to probe the\ncurvature of the strong-field regions from which GWs\noriginate. However, further study is needed in order to\nunderstand how the GWs behave in a region with background curvature, in particular, when R is nonzero.\nFrom linearized theory we have deduced the weakfield metrics for some simple mass distributions and\nfound they are not the BH solutions of GR. Additionally,\nBirkhoff's theorem no longer applies in f (R)-gravity. If\nthe end point of gravitational collapse is not the Kerr solution, LISA observations of extreme-mass-ratio inspirals\nwill be sensitive to small differences in the precession frequencies of orbits, as small differences lead to secular dephasings that accumulate over the 100 000 waveform cycles LISA will observe. By computing epicyclic frequencies for the weak-field, slow-rotation metric we were able\nto estimate the constraints that might come from such\nobservations. These indicated that deviations would only\nbe detectable when |a2 | & 1017 m2 , assuming an extrememass-ratio binary with a massive BH of mass ∼ 106 M⊙ .\nWe also discussed constraints that could be placed from\nSolar System observations of planetary precessions and\nfrom laboratory experiments. While the LISA constraints would beat those from Solar System observations\n(which presently give |a2 | . 1.2 × 1018 m2 ), considerably\nstronger constraints have already been placed from fifthforce tests.13 Using existing results from the Eöt-Wash\nexperiment, we can constrain |a2 | . 2 × 10−9 m2 . For\nthis range of a2 , we would not expect the propagating\nRicci mode to be excited by astrophysical systems as the\ncutoff frequency is too high. But, even in the absence of\nexcitation of the Ricci mode, gravitational radiation in\n\nf (R)-gravity is still modified through the dependence of\nthe transverse polarizations on the Ricci scalar.\nAlthough the constraints from astrophysical observations will be much weaker than this laboratory bound,\nthey are still of interest since they probe gravity at a\ndifferent scale and in a different environment. It is possible that f (R)-gravity is not universal, that it is different\nin different regions of space or at different energy scales.\nWe could regard the f (R) model as an approximate effective theory, and argue that the range of validity of a\nparticular parameterization is limited to a specific scale.\nFor example, we could imagine that the effective theory\nin the vicinity of a massive BH, where the curvature is\nlarge, is different from the appropriate effective theory in\nthe Solar System, where curvature is small; or f (R) could\nevolve with cosmological epoch so that it varies with redshift. The limit on a2 from gravitational-wave observations will depend upon the BH mass, orbital radius and\nobservation time, but it is clear that if the laboratory\nbound is indeed universal there should be no detectable\ndeviation: observation of a deviation would thus prove\nnot only that GR failed, but that the effective a2 varied\nwith environment.\nOne method of obtaining a variation is via the\nchameleon mechanism, where f (R)-gravity is modified in\nthe presence of matter [105–107]. In metric f (R)-gravity\nthis is a nonlinear effect arising from a large departure\nof the Ricci scalar from its background value [40]. The\nmass of the effective scalar degree of freedom then depends upon the density of its environment [57, 108]. In\na region of high matter density, such as the Earth, the\ndeviations from standard gravity would be exponentially\nsuppressed due to a large effective Υ; while on cosmological scales, where the density is low, the scalar would\nhave a small Υ, perhaps of the order H0 /c [105, 106]. The\nchameleon mechanism allows f (R)-gravity to pass laboratory, or Solar System, tests while remaining of interest\nfor cosmology. In the context of gravitational radiation,\nthis would mean that the Ricci scalar mode could freely\npropagate on cosmological scales [109]. Unfortunately,\nsince the chameleon mechanism suppresses the effects of\nf (R) in the presence of matter, this mode would have to\nbe excited by something other than the acceleration of\nmatter. Additionally since electromagnetic radiation has\na traceless energy-momentum tensor it cannot excite the\nRicci mode.14 To be able to detect the Ricci mode we\nmust observe it well away from any matter, which would\ncause it to become evanescent: a space-borne detector\nsuch as LISA could be our only hope.\n\n14\n\n13\n\nThe LISA constraint relies upon the assumption that the weakfield metric does describe the exterior of a BH; there is no such\ncaveat on the Solar System constraint since the weak-field metric\nis undoubtedly applicable for the spacetime exterior to the Sun.\n\nThe standard transverse polarizations of gravitational radiation\nhave an energy-momentum tensor that averages to be traceless,\nalthough this may not be the case locally [110]; the contribution to the gravitational averaged energy-momentum tensor from\na propagating Ricci mode does have a nonzero trace, see (86).\nIn any case it is doubtful that gravitational energy-momentum\ncould act as a source for detectable radiation.\n\n\f17\nAs the chameleon mechanism is inherently nonlinear, it\nis difficult to discuss in terms of our linearized framework.\nTreating f (R) as an effective theory, we could incorporate\nthe effects of matter by taking the coefficients {an } to be\nfunctions of the matter stress-energy tensor (or its trace).\nIn this case, the results presented here would hold in\nthe event that the coefficient a2 is slowly varying, such\nthat it may be treated as approximately constant in the\nregion of interest. The linearized wave equations, (28)\nand (44), retain the same form in the case of a variable\na2 , the only alteration would be that a2 R(1) replaces R(1)\nas subject of the Klein-Gordon equation. In particular,\nthe conclusion that γ = 1 is unaffected by the possibility\nof a variable a2 .\nAn interesting extension to the work presented here\nwould be to consider the case when the constant term\n\nin the function f (R), a0 , is nonzero. We would then be\nable to study perturbations with respect to (anti-)de Sitter space. This is relevant because the current ΛCDM\nparadigm indicates that we live in a universe with a positive cosmological constant [47, 111]. Such a study would\nnaturally complement an investigation into the effects of\nbackground curvature on propagation.\n\n[1] C. M. Will, Living Reviews in Relativity, 9 (2006).\n[2] C. M. Will, Theory and experiment in gravitational\nphysics, revised ed. (Cambridge University Press, Cambridge, 1993).\n[3] E. Adelberger, J. Gundlach, B. Heckel, S. Hoedl, and\nS. Schlamminger, Prog. Part. Nucl. Phys., 62, 102\n(2009).\n[4] E. Adelberger, B. Heckel, and A. Nelson, Annu. Rev.\nNucl. Part. Sci., 53, 77 (2003).\n[5] B. Bertotti, L. Iess, and P. Tortora, Nature, 425, 374\n(2003).\n[6] C. W. F. Everitt, M. Adams, W. Bencze, S. Buchman, B. Clarke, J. W. Conklin, D. B. DeBra, M. Dolphin, M. Heifetz, D. Hipkins, T. Holmes, G. M. Keiser,\nJ. Kolodziejczak, J. Li, J. Lipa, J. M. Lockhart, J. C.\nMester, B. Muhlfelder, Y. Ohshima, B. W. Parkinson,\nM. Salomon, A. Silbergleit, V. Solomonik, K. Stahl,\nM. Taber, J. P. Turneaure, S. Wang, and P. W. Worden, Space Sci. Rev., 148, 53 (2009).\n[7] I. H. Stairs, Living Reviews in Relativity, 6 (2003).\n[8] A. Abramovici, W. E. Althouse, R. W. P. Drever,\nY. Gürsel, S. Kawamura, F. J. Raab, D. Shoemaker,\nL. Sievers, R. E. Spero, K. S. Thorne, R. E. Vogt,\nR. Weiss, S. E. Whitcomb, and M. E. Zucker, Science,\n256, 325 (1992).\n[9] B. P. Abbott et al. (The LIGO Scientific Collaboration),\nRep. Prog. Phys., 72, 076901 (2009).\n[10] T. Accadia et al., J. Phys.: Conf. Ser., 203, 012074\n(2010).\n[11] B. Willke, P. Aufmuth, C. Aulbert, S. Babak, R. Balasubramanian, B. W. Barr, S. Berukoff, S. Bose,\nG. Cagnoli, M. M. Casey, D. Churches, D. Clubley,\nC. N. Colacino, D. R. M. Crooks, C. Cutler, K. Danzmann, R. Davies, R. Dupuis, E. Elliffe, C. Fallnich,\nA. Freise, S. Gossler, A. Grant, H. Grote, G. Heinzel,\nA. Heptonstall, M. Heurs, M. Hewitson, J. Hough,\nO. Jennrich, K. Kawabe, K. Kötter, V. Leonhardt,\nH. Lück, M. Malec, P. W. McNamara, S. A. McIntosh,\nK. Mossavi, S. Mohanty, S. Mukherjee, S. Nagano, G. P.\nNewton, B. J. Owen, D. Palmer, M. A. Papa, M. V.\nPlissi, V. Quetschke, D. I. Robertson, N. A. Robertson,\nS. Rowan, A. Rüdiger, B. S. Sathyaprakash, R. Schilling,\n\nB. F. Schutz, R. Senior, A. M. Sintes, K. D. Skeldon,\nP. Sneddon, F. Stief, K. A. Strain, I. Taylor, C. I.\nTorrie, A. Vecchio, H. Ward, U. Weiland, H. Welling,\nP. Williams, W. Winkler, G. Woan, and I. Zawischa,\nClassical Quantum Gravity, 19, 1377 (2002).\nJ. Abadie et al. (The LIGO Scientific Collaboration and\nThe Virgo Collaboration), Phys. Rev. D, 81, 102001\n(2010).\nP. Bender, A. Brillet, I. Ciufolini, A. M. Cruise,\nC. Cutler, K. Danzmann, F. Fidecaro, W. M. Folkner,\nJ. Hough, P. McNamara, M. Peterseim, D. Robertson,\nM. Rodrigues, A. Rüdiger, M. Sandford, G. Schäfer,\nR. Schilling, B. Schutz, C. Speake, R. T. Stebbins,\nT. Sumner, P. Touboul, J. Vinet, S. Vitale, H. Ward,\nand W. Winkler, LISA Pre-Phase A Report, Tech.\nRep. (Max-Planck-Institut für Quantenoptik, Garching,\n1998).\nK. Danzmann and A. Rüdiger, Classical Quantum\nGravity, 20, S1 (2003).\nD. Psaltis, Living Reviews in Relativity, 11 (2008).\nP. Amaro-Seoane, J. R. Gair, M. Freitag, M. C. Miller,\nI. Mandel, C. J. Cutler, and S. Babak, Classical Quantum Gravity, 24, R113 (2007).\nF. D. Ryan, Phys. Rev. D, 52, 5707 (1995).\nF. D. Ryan, Phys. Rev. D, 56, 1845 (1997).\nW. Israel, Phys. Rev., 164, 1776 (1967).\nW. Israel, Comm. Math. Phys., 8, 245 (1968).\nB. Carter, Phys. Rev. Lett., 26, 331 (1971).\nS. W. Hawking, Comm. Math. Phys., 25, 152 (1972).\nD. C. Robinson, Phys. Rev. Lett., 34, 905 (1975).\nR. O. Hansen, J. Math. Phys., 15, 46 (1974).\nN. A. Collins and S. A. Hughes, Phys. Rev. D, 69,\n124022(16) (2004).\nK. Glampedakis and S. Babak, Classical Quantum\nGravity, 23, 4167 (2006).\nL. Barack and C. Cutler, Phys. Rev. D, 75, 042003\n(2007).\nJ. R. Gair, C. Li, and I. Mandel, Phys. Rev. D, 77,\n024035 (2008).\nG. Lukes-Gerakopoulos, T. A. Apostolatos,\nand\nG. Contopoulos, Phys. Rev. D, 81, 124005 (2010).\nM. Kesden, J. Gair, and M. Kamionkowski, Phys. Rev.\n\nACKNOWLEDGMENTS\n\nThe authors thank Thomas Sotiriou and Leo Stein for\nuseful comments. CPLB is supported by STFC. JRG is\nsupported by the Royal Society.\n\n[12]\n[13]\n\n[14]\n[15]\n[16]\n\n[17]\n[18]\n[19]\n[20]\n[21]\n[22]\n[23]\n[24]\n[25]\n[26]\n[27]\n[28]\n[29]\n[30]\n\n\f18\n012022 (2007).\nD, 71, 044015 (2005).\n[65] E. Barausse, T. P. Sotiriou, and J. C. Miller, Classical\n[31] D. Psaltis, D. Perrodin, K. R. Dienes, and I. Mocioiu,\nQuantum Gravity, 25, 062001 (2008).\nPhys. Rev. Lett., 100, 091101 (2008).\n[66] E. Barausse, T. P. Sotiriou, and J. C. Miller, Classical\n[32] N. Yunes and L. C. Stein, Phys. Rev. D, 83, 104002\nQuantum Gravity, 25, 105008 (2008).\n(2011).\n[67] J. W. York, Jr., Phys. Rev. Lett., 28, 1082 (1972).\n[33] E. Barausse and T. P. Sotiriou, Phys. Rev. Lett., 101,\n[68] G. W. Gibbons and S. W. Hawking, Phys. Rev. D, 15,\n099001 (2008).\n2752 (1977).\n[34] L. C. Stein and N. Yunes, Phy. Rev. D, 83, 064038\n[69] M. S. Madsen and J. D. Barrow, Nucl. Phys. B, 323,\n(2011).\n242 (1989).\n[35] E. Berti, A. Buonanno, and C. M. Will, Phys. Rev. D,\n[70] E. Dyer and K. Hinterbichler, Phys. Rev. D, 79, 024028\n71, 84025 (2005).\n(2009).\n[36] S. Alexander, L. S. Finn, and N. Yunes, Phys. Rev. D,\n[71] A. Guarnizo, L. Castañeda, and J. M. Tejeiro, Gen.\n78, 066005 (2008).\nRelativity Gravitation, 42, 2713 (2010).\n[37] S. Alexander and N. Yunes, Phys. Rep., 480, 1 (2009).\n[72] T. Koivisto, Classical Quantum Gravity, 23, 4289\n[38] C. F. Sopuerta and N. Yunes, Phys. Rev. D, 80, 064006\n(2006).\n(2009).\n[73] H.-J. Schmidt, Astron. Nachr., 307, 339 (1986).\n[39] T. P. Sotiriou and V. Faraoni, Rev. Mod. Phys., 82, 451\n[74] P. Teyssandier, Astron. Nachr., 311, 209 (1990).\n(2010).\n[75] G. J. Olmo, Phys. Rev. Lett., 95, 261102 (2005).\n[40] A.\nDe\nFelice\nand\nS.\nTsujikawa,\n[76] C. Corda, Internat. J. Modern Phys. A, 23, 1521 (2008).\nLiving Reviews in Relativity, 13 (2010).\n[77] M. P. Hobson, G. Efstathiou, and A. Lasenby, General\n[41] S. Nojiri and S. D. Odintsov, Int. J. Geom. Methods\nRelativity: An Introduction for Physicists (Cambridge\nMod. Phys., 4, 115 (2007).\nUniversity Press, Cambridge, 2006).\n[42] S. Capozziello and M. Francaviglia, Gen. Relativity\n[78] S. Capozziello, C. Corda, and M. F. De Laurentis, Phys.\nGravitation, 40, 357 (2007).\nLett. B, 669, 255 (2008).\n[43] A. Starobinsky, Phys. Lett. B, 91, 99 (1980).\n[79] C. Corda, Internat. J. Modern Phys. D, 18, 2275 (2009).\n[44] A. Vilenkin, Phys. Rev. D, 32, 2511 (1985).\n[80] R. M. Wald, General Relativity (University Of Chicago\n[45] A. A. Starobinskii, Sov. Astron. Lett., 9, 302 (1983).\nPress, Chicago, 1984).\n[46] A. A. Starobinskii, Sov. Astron. Lett., 11, 133 (1985).\n[81] M. E. Peskin and D. V. Schroeder, An Introduction to\n[47] N. Jarosik, C. L. Bennett, J. Dunkley, B. Gold, M. R.\nQuantum Field Theory (Westview Press, Boulder, ColGreason, M. Halpern, R. S. Hill, G. Hinshaw, A. Kogut,\norado, 1995).\nE. Komatsu, D. Larson, M. Limon, S. S. Meyer, M. R.\n[82] S. Capozziello, A. Stabile, and A. Troisi, Mod. Phys.\nNolta, N. Odegard, L. Page, K. M. Smith, D. N. Spergel,\nLett. A, 24, 659 (2009).\nG. S. Tucker, J. L. Weiland, E. Wollack, and E. L.\n[83] J. Näf and P. Jetzer, Phys. Rev. D, 81, 104003 (2010).\nWright, Astrophys. J. Suppl. Ser., 192, 14 (2011).\n[84] T. Chiba, T. L. Smith, and A. L. Erickcek, Phys. Rev.\n[48] D. Larson, J. Dunkley, G. Hinshaw, E. Komatsu, M. R.\nD, 75, 124014 (2007).\nNolta, C. L. Bennett, B. Gold, M. Halpern, R. S. Hill,\n[85] E. Pechlaner and R. Sexl, Comm. Math. Phys., 2, 165\nN. Jarosik, A. Kogut, M. Limon, S. S. Meyer, N. Ode(1966).\ngard, L. Page, K. M. Smith, D. N. Spergel, G. S. Tucker,\n[86] K. S. Stelle, Gen. Relativity Gravitation, 9, 353 (1978).\nJ. L. Weiland, E. Wollack, and E. L. Wright, Astrophys.\n[87] T. Clifton, Classical Quantum Gravity, 23, 7445 (2006).\nJ. Suppl. Ser., 192, 16 (2011).\n[88] S. Capozziello and A. Stabile, Classical Quantum Grav[49] A. A. Starobinsky, JETP Lett., 86, 157 (2007).\nity, 26, 085019 (2009).\n[50] R. Isaacson, Phys. Rev., 166, 1263 (1968).\n[89] A. Stabile, Phys. Rev. D, 82, 064021 (2010).\n[51] R. Isaacson, Phys. Rev., 166, 1272 (1968).\n[90] G. J. Olmo, Phys. Rev. D, 75, 023511 (2007).\n[52] L. D. Landau and E. M. Lifshitz, The Classical The[91] S. W. Hawking, Comm. Math. Phys., 25, 167 (1972).\nory of Fields, 4th ed., Course of Theoretical Physics\n[92] J. D. Bekenstein and A. Meisels, Phys. Rev. D, 18, 4378\n(Butterworth-Heinemann, Oxford, 1975).\n(1978).\n[53] C. W. Misner, K. S. Thorne, and J. A. Wheeler, Grav[93] K. S. Thorne and J. J. Dykla, Astrophys. J., 166, L35\nitation (W. H. Freeman, New York, 1973).\n(1971).\n[54] H. A. Buchdahl, Mon. Not. R. Astron. Soc., 150, 1 (1970).\n[94] M. A. Scheel, S. L. Shapiro, and S. A. Teukolsky, Phys.\n[55] M. Park, K. M. Zurek, and S. Watson, Phys. Rev. D,\nRev. D, 51, 4236 (1995).\n81, 124008 (2010).\n[95] J. Binney and S. Tremaine, Galactic Dynamics, 1st ed.\n[56] S. Capozziello, A. Stabile, and A. Troisi, Phys. Rev. D,\n(Princeton University Press, Princeton, 1987).\n76, 104019 (2007).\n[96] S. Detweiler, Phys. Rev. D, 77, 124026 (2008).\n[57] T. Faulkner, M. Tegmark, E. F. Bunn, and Y. Mao,\n[97] P. Teyssandier and Ph. Tourrenc, J. Math. Phys., 24,\nPhys. Rev. D, 76, 063505 (2007).\n2793 (1983).\n[58] T. Clifton, Phys. Rev. D, 77, 024041 (2008).\n[98] D. Wands, Classical Quantum Gravity, 11, 269 (1994).\n[59] Q. Exirifard and M. Sheik-Jabbari, Phys. Lett. B, 661,\n[99] Y. Bisabr, Gravit. Cosmol., 16, 239 (2010).\n158 (2008).\n[100] R. Kerner, J. W. van Holten, and R. Colistete, Jr.,\n[60] D. Lovelock, Aequationes Math., 4, 127 (1970).\nClassical Quantum Gravity, 18, 4725 (2001).\n[61] D. Lovelock, J. Math. Phys., 12, 498 (1971).\n[101] A. N. Cox, Allen's Astrophysical Quantities, 4th ed.\n[62] D. Lovelock, J. Math. Phys., 13, 874 (1972).\n(Springer-Verlag, New York, 2000).\n[63] T. Sotiriou and S. Liberati, Ann. Physics, 322, 935\n[102] E. V. Pitjeva, in Proceedings of the International Astro(2007).\nnomical Union, Vol. 5, edited by S. A. Klioner, P. K.\n[64] T. P. Sotiriou and S. Liberati, J. Phys.: Conf. Ser., 68,\n\n\f19\n\n[103]\n\n[104]\n[105]\n[106]\n\nSeidelmann, and M. H. Soffel (Cambridge University\nPress, Cambridge, 2009) pp. 170–178.\nD. J. Kapner, T. S. Cook, E. G. Adelberger, J. H. Gundlach, B. R. Heckel, C. D. Hoyle, and H. E. Swanson,\nPhys. Rev. Lett., 98, 021101 (2007).\nC. D. Hoyle, D. J. Kapner, B. R. Heckel, E. G. Adelberger, J. H. Gundlach, U. Schmidt, and H. E. Swanson, Phys. Rev. D, 70, 042004 (2004).\nJ. Khoury and A. Weltman, Phys. Rev. Lett., 93,\n171104 (2004).\nJ. Khoury and A. Weltman, Phys. Rev. D, 69, 044026\n(2004).\n\n[107] P. Brax, C. van de Bruck, A.-C. Davis, J. Khoury, and\nA. Weltman, Phys. Rev. D, 70, 123518 (2004).\n[108] B. Li and J. D. Barrow, Phys. Rev. D, 75, 084010\n(2007).\n[109] C. Corda, Eur. Phys. J. C, 65, 257 (2009).\n[110] L. M. Butcher, M. Hobson, and A. Lasenby, Phys. Rev.\nD, 82, 104040 (2010).\n[111] E. Komatsu, K. M. Smith, J. Dunkley, C. L. Bennett,\nB. Gold, G. Hinshaw, N. Jarosik, D. Larson, M. R.\nNolta, L. Page, D. N. Spergel, M. Halpern, R. S. Hill,\nA. Kogut, M. Limon, S. S. Meyer, N. Odegard, G. S.\nTucker, J. L. Weiland, E. Wollack, and E. L. Wright,\nAstrophys. J. Suppl. Ser., 192, 18 (2011).\n\n\f"}