{"id": "http://arxiv.org/abs/1205.2825v2", "guidislink": true, "updated": "2012-07-26T22:56:23Z", "updated_parsed": [2012, 7, 26, 22, 56, 23, 3, 208, 0], "published": "2012-05-13T03:36:50Z", "published_parsed": [2012, 5, 13, 3, 36, 50, 6, 134, 0], "title": "Ingroup favoritism and intergroup cooperation under indirect reciprocity\n  based on group reputation", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1205.2080%2C1205.1545%2C1205.1216%2C1205.3846%2C1205.1529%2C1205.2546%2C1205.0659%2C1205.1023%2C1205.3784%2C1205.2603%2C1205.1677%2C1205.3336%2C1205.2381%2C1205.2243%2C1205.2358%2C1205.3327%2C1205.4304%2C1205.3569%2C1205.1865%2C1205.1563%2C1205.0627%2C1205.3079%2C1205.1046%2C1205.3295%2C1205.2105%2C1205.1418%2C1205.2005%2C1205.2822%2C1205.2110%2C1205.4211%2C1205.0507%2C1205.0772%2C1205.3898%2C1205.0867%2C1205.3706%2C1205.1868%2C1205.3292%2C1205.3928%2C1205.1547%2C1205.2218%2C1205.3734%2C1205.3315%2C1205.3651%2C1205.2146%2C1205.2579%2C1205.2074%2C1205.3666%2C1205.1475%2C1205.3618%2C1205.1291%2C1205.1337%2C1205.1659%2C1205.0676%2C1205.1446%2C1205.2810%2C1205.1719%2C1205.4151%2C1205.1844%2C1205.1643%2C1205.3821%2C1205.1293%2C1205.0425%2C1205.1224%2C1205.3289%2C1205.1383%2C1205.0671%2C1205.1368%2C1205.1005%2C1205.4401%2C1205.3713%2C1205.1709%2C1205.3826%2C1205.2748%2C1205.2425%2C1205.1407%2C1205.3457%2C1205.4347%2C1205.3869%2C1205.4264%2C1205.0816%2C1205.2508%2C1205.2790%2C1205.1384%2C1205.2965%2C1205.2159%2C1205.3093%2C1205.1891%2C1205.2825%2C1205.1897%2C1205.3246%2C1205.3825%2C1205.3687%2C1205.0050%2C1205.4393%2C1205.2171%2C1205.2125%2C1205.1838%2C1205.1778%2C1205.4311%2C1205.3600%2C1205.0363&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Ingroup favoritism and intergroup cooperation under indirect reciprocity\n  based on group reputation"}, "summary": "Indirect reciprocity in which players cooperate with unacquainted other\nplayers having good reputations is a mechanism for cooperation in relatively\nlarge populations subjected to social dilemma situations. When the population\nhas group structure, as is often found in social networks, players in\nexperiments are considered to show behavior that deviates from existing\ntheoretical models of indirect reciprocity. First, players often show ingroup\nfavoritism (i.e., cooperation only within the group) rather than full\ncooperation (i.e., cooperation within and across groups), even though the\nlatter is Pareto efficient. Second, in general, humans approximate outgroup\nmembers' personal characteristics, presumably including the reputation used for\nindirect reciprocity, by a single value attached to the group. Humans use such\na stereotypic approximation, a phenomenon known as outgroup homogeneity in\nsocial psychology. I propose a model of indirect reciprocity in populations\nwith group structure to examine the possibility of ingroup favoritism and full\ncooperation. In accordance with outgroup homogeneity, I assume that players\napproximate outgroup members' personal reputations by a single reputation value\nattached to the group. I show that ingroup favoritism and full cooperation are\nstable under different social norms (i.e., rules for assigning reputations)\nsuch that they do not coexist in a single model. If players are forced to\nconsistently use the same social norm for assessing different types of\ninteractions (i.e., ingroup versus outgroup interactions), only full\ncooperation survives. The discovered mechanism is distinct from any form of\ngroup selection. The results also suggest potential methods for reducing\ningroup bias to shift the equilibrium from ingroup favoritism to full\ncooperation.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1205.2080%2C1205.1545%2C1205.1216%2C1205.3846%2C1205.1529%2C1205.2546%2C1205.0659%2C1205.1023%2C1205.3784%2C1205.2603%2C1205.1677%2C1205.3336%2C1205.2381%2C1205.2243%2C1205.2358%2C1205.3327%2C1205.4304%2C1205.3569%2C1205.1865%2C1205.1563%2C1205.0627%2C1205.3079%2C1205.1046%2C1205.3295%2C1205.2105%2C1205.1418%2C1205.2005%2C1205.2822%2C1205.2110%2C1205.4211%2C1205.0507%2C1205.0772%2C1205.3898%2C1205.0867%2C1205.3706%2C1205.1868%2C1205.3292%2C1205.3928%2C1205.1547%2C1205.2218%2C1205.3734%2C1205.3315%2C1205.3651%2C1205.2146%2C1205.2579%2C1205.2074%2C1205.3666%2C1205.1475%2C1205.3618%2C1205.1291%2C1205.1337%2C1205.1659%2C1205.0676%2C1205.1446%2C1205.2810%2C1205.1719%2C1205.4151%2C1205.1844%2C1205.1643%2C1205.3821%2C1205.1293%2C1205.0425%2C1205.1224%2C1205.3289%2C1205.1383%2C1205.0671%2C1205.1368%2C1205.1005%2C1205.4401%2C1205.3713%2C1205.1709%2C1205.3826%2C1205.2748%2C1205.2425%2C1205.1407%2C1205.3457%2C1205.4347%2C1205.3869%2C1205.4264%2C1205.0816%2C1205.2508%2C1205.2790%2C1205.1384%2C1205.2965%2C1205.2159%2C1205.3093%2C1205.1891%2C1205.2825%2C1205.1897%2C1205.3246%2C1205.3825%2C1205.3687%2C1205.0050%2C1205.4393%2C1205.2171%2C1205.2125%2C1205.1838%2C1205.1778%2C1205.4311%2C1205.3600%2C1205.0363&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Indirect reciprocity in which players cooperate with unacquainted other\nplayers having good reputations is a mechanism for cooperation in relatively\nlarge populations subjected to social dilemma situations. When the population\nhas group structure, as is often found in social networks, players in\nexperiments are considered to show behavior that deviates from existing\ntheoretical models of indirect reciprocity. First, players often show ingroup\nfavoritism (i.e., cooperation only within the group) rather than full\ncooperation (i.e., cooperation within and across groups), even though the\nlatter is Pareto efficient. Second, in general, humans approximate outgroup\nmembers' personal characteristics, presumably including the reputation used for\nindirect reciprocity, by a single value attached to the group. Humans use such\na stereotypic approximation, a phenomenon known as outgroup homogeneity in\nsocial psychology. I propose a model of indirect reciprocity in populations\nwith group structure to examine the possibility of ingroup favoritism and full\ncooperation. In accordance with outgroup homogeneity, I assume that players\napproximate outgroup members' personal reputations by a single reputation value\nattached to the group. I show that ingroup favoritism and full cooperation are\nstable under different social norms (i.e., rules for assigning reputations)\nsuch that they do not coexist in a single model. If players are forced to\nconsistently use the same social norm for assessing different types of\ninteractions (i.e., ingroup versus outgroup interactions), only full\ncooperation survives. The discovered mechanism is distinct from any form of\ngroup selection. The results also suggest potential methods for reducing\ningroup bias to shift the equilibrium from ingroup favoritism to full\ncooperation."}, "authors": ["Naoki Masuda"], "author_detail": {"name": "Naoki Masuda"}, "author": "Naoki Masuda", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1016/j.jtbi.2012.07.002", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1205.2825v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1205.2825v2", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "3 figures, 4 tables", "arxiv_primary_category": {"term": "physics.soc-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "physics.soc-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "cs.SI", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "q-bio.PE", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1205.2825v2", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1205.2825v2", "journal_reference": "Journal of Theoretical Biology, 311, 8-18 (2012)", "doi": "10.1016/j.jtbi.2012.07.002", "fulltext": "arXiv:1205.2825v2 [physics.soc-ph] 26 Jul 2012\n\nIngroup favoritism and intergroup cooperation under\nindirect reciprocity based on group reputation\nNaoki Masudaa,b,∗\na\n\nDepartment of Mathematical Informatics, The University of Tokyo, 7-3-1 Hongo,\nBunkyo, Tokyo 113-8656, Japan\nb\nPRESTO, Japan Science and Technology Agency, 4-1-8 Honcho, Kawaguchi, Saitama\n332-0012, Japan\n\n∗\n\nmasuda@mist.i.u-tokyo.ac.jp\n\nPreprint submitted to Elsevier\n\nMay 21, 2018\n\n\fAbstract\nIndirect reciprocity in which players cooperate with unacquainted other\nplayers having good reputations is a mechanism for cooperation in relatively\nlarge populations subjected to social dilemma situations. When the population has group structure, as is often found in social networks, players\nin experiments are considered to show behavior that deviates from existing\ntheoretical models of indirect reciprocity. First, players often show ingroup\nfavoritism (i.e., cooperation only within the group) rather than full cooperation (i.e., cooperation within and across groups), even though the latter is\nPareto efficient. Second, in general, humans approximate outgroup members'\npersonal characteristics, presumably including the reputation used for indirect reciprocity, by a single value attached to the group. Humans use such a\nstereotypic approximation, a phenomenon known as outgroup homogeneity\nin social psychology. I propose a model of indirect reciprocity in populations\nwith group structure to examine the possibility of ingroup favoritism and\nfull cooperation. In accordance with outgroup homogeneity, I assume that\nplayers approximate outgroup members' personal reputations by a single reputation value attached to the group. I show that ingroup favoritism and full\ncooperation are stable under different social norms (i.e., rules for assigning\nreputations) such that they do not coexist in a single model. If players are\nforced to consistently use the same social norm for assessing different types\nof interactions (i.e., ingroup versus outgroup interactions), only full cooperation survives. The discovered mechanism is distinct from any form of group\nselection. The results also suggest potential methods for reducing ingroup\nbias to shift the equilibrium from ingroup favoritism to full cooperation.\n\n2\n\n\f1. Introduction\nHumans and other animals often show cooperation in social dilemma situations, in which defection apparently seems more lucrative than cooperation.\nA main mechanism governing cooperation in such situations is direct reciprocity, in which the same pairs of players repeatedly interact to realize mutual cooperation (Trivers, 1971; Axelrod, 1984; Nowak, 2006a). In fact, individuals who do not repeatedly interact also cooperate with others. In this situation, reputation-based indirect reciprocity, also known as downstream reciprocity, is a viable mechanism for cooperation (Nowak and Sigmund, 1998a;\nLeimar and Hammerstein, 2001; Ohtsuki and Iwasa, 2004, 2007; Nowak and Sigmund,\n2005; Brandt and Sigmund, 2005, 2006). In this mechanism, which I refer to\nas indirect reciprocity for simplicity, individuals carry their own reputation\nscores, which represent an evaluation of their past actions toward others. Individuals are motivated to cooperate to gain good reputations so that they\nare helped by others in the future or to reward (punish) good (bad) others.\nIndirect reciprocity facilitates cooperation in a larger population than in the\ncase of direct reciprocity because unacquainted players can cooperate with\neach other. Although evidence of indirect reciprocity is relatively scarce for\nnonhumans (but see Bshary and Grutter (2006)), it is widely accepted as\nexplanation for cooperation in humans (Nowak and Sigmund, 2005).\nHumans, in particular, belong to groups identified by traits, such as age,\nethnicity, and culture. Individuals presumably interact more frequently with\ningroup than outgroup members. Group structure has been a main topic of\nresearch in social psychology and sociology for many decades (Brown, 2000;\nDovidio et al., 2005) and in network science (Fortunato, 2010). Experimental\nevidence suggests that, when the population of players has group structure,\ntwo phenomena that are not captured by existing models of indirect reciprocity take place.\nFirst, in group-structured populations, humans (Sedikides et al., 1998;\nBrewer, 1999; Hewstone et al., 2002; Dovidio et al., 2005; Efferson et al., 2008)\nand even insect larvae (Lize et al., 2006) show various forms of ingroup favoritism. In social dilemma games, individuals behave more cooperatively toward ingroup than outgroup members (e.g., De Cremer and van Vugt (1999);\nGoette et al. (2006); Fowler and Kam (2007); Rand et al. (2009); Yamagishi et al.\n(1998, 1999); Yamagishi and Mifune (2008)). Ingroup favoritism in social\ndilemma situations may occur as a result of indirect reciprocity confined in\nthe group (Yamagishi et al., 1998, 1999; Yamagishi and Mifune, 2008). In\n3\n\n\fcontrast, ingroup favoritism in social dilemma games is not Pareto efficient\nbecause individuals would receive larger payoffs if they also cooperated across\ngroups. Under what conditions are ingroup favoritism and intergroup cooperation sustained by indirect reciprocity? Can they bistable?\nIngroup favoritism, which has also been analyzed in the context of tagbased cooperation, the green beard effect, and the armpit effect, has been\nconsidered to be a theoretical challenge (e.g., Antal et al. (2009)). Nevertheless, recent research has revealed their mechanisms, including the loose\ncoupling of altruistic trait and tag in inheritance (Jansen and van Baalen,\n2006), a relatively fast mutation that simultaneously changes strategy and\ntag (Traulsen and Nowak, 2007; Traulsen, 2008), a tag's relatively fast mutation as compared to the strategy's mutation (Antal et al., 2009), conflicts\nbetween groups (Choi and Bowles, 2007; Garcı́a and van den Bergh, 2011),\npartial knowledge of others' strategies (Masuda and Ohtsuki, 2007), and\ngene-culture coevolution (Ihara, 2011). However, indirect reciprocity accounts for ingroup favoritism, as is relevant to previous experiments (Yamagishi et al.,\n1998, 1999; Yamagishi and Mifune, 2008) is lacking.\nSecond, in a population with group structure, individuals tend to approximate outgroup individuals' characteristics by a single value attached to the\ngroup. This type of stereotype is known as outgroup homogeneity in social\npsychology (Jones et al., 1981; Ostrom and Sedikides, 1992; Sedikides et al.,\n1998; Brown, 2000), and it posits that outgroup members tend to be regarded\nto resemble each other more than they actually do. It is also reasonable from\nthe viewpoint of cognitive burden of remembering each individual's properties that humans generally resort to outgroup homogeneity. Therefore, in\nindirect reciprocity games in group structured populations, it seems to be\nnatural to assume outgroup homogeneity. In other words, individuals may\nnot care about or have access to personal reputations of those in different\ngroups and approximate an outgroup individual's reputation by a group reputation.\nSome previous models analyzed the situations in which players do not\nhave access to individuals' reputations. This is simply because it may be\ndifficult for an individual in a large population to separately keep track of\nother people's reputations even if gossiping helps dissemination of information. This case of incomplete information has been theoretically modeled\nby introducing the probability that an individual sees others' reputations in\neach interaction (Nowak and Sigmund, 1998b,a; Brandt and Sigmund, 2005,\n2006; Suzuki and Toquenaga, 2005; Nakamura and Masuda, 2011). However,\n4\n\n\fthese studies do not have to do with the approximation of individuals' personal reputations by group reputations.\nBy analyzing a model of an indirect reciprocity game based on group\nreputation, I provide an indirect reciprocity account for ingroup favoritism\nfor the first time. In addition, through an exhaustive search, I identify all the\ndifferent types of stable homogeneous populations that yield full cooperation\n(intragroup and intergroup cooperation) or ingroup favoritism.\n2. Methods\n2.1. Model\n2.1.1. Population structure and the donation game\nI assume that the population is composed of infinitely many groups each\nof which is of infinite size. Each player belongs to one group.\nPlayers are involved in a series of the donation game, which is essentially\na type of prisoner's dilemma game. In each round, a donor and recipient are\nselected from the population in a completely random manner. Each player\nis equally likely to be selected as donor or recipient. The donor may refer to\nthe recipient's reputation and select one of the two actions, cooperation (C)\nor defection (D). If the donor cooperates, the donor pays cost c > 0, and the\nrecipient receives benefit b(> c). If the donor defects, the payoffs to the donor\nand recipient are equal to 0. Because the roles are asymmetric in a single\ngame, the present game differs from the one-shot or standard iterated versions\nof the prisoner's dilemma game. This game is widely used for studying mechanisms for cooperation including indirect reciprocity (Nowak and Sigmund,\n2005; Nowak, 2006a,b).\nRounds are repeated a sufficient number of times with different pairs of\ndonors and recipients. Because the population is infinite, no pair of players\nmeets more than once, thereby avoiding the possibility of direct reciprocity\n(e.g., Nowak and Sigmund (1998a); Ohtsuki and Iwasa (2004)). The payoff\nto each player is defined as the average payoff per round.\nThe groups to which the donor and recipient belong are denoted by gd\nand gr , respectively. The simultaneously selected donor and recipient belong\nto the same group with probability r in (i.e., gd = gr ; Fig. 1A) and different\ngroups with probability r out ≡ 1 − r in (i.e., gd 6= gr ; Fig. 1B).\n\n5\n\n\f2.1.2. Social norms\nAt the end of each round, observers assign binary reputations, good (G)\nor bad (B), to the donor and donor's group (gd ) according to a given social\nnorm. I consider up to so-called second-order social norms with which the\nobservers assign G or B as a function of the donor's action and the reputation\n(i.e., G or B) of the recipient or recipient's group (gr ). Representative secondorder social norms are shown in Fig. 2. Under image scoring (\"scoring\" in\nFig. 2), an observer regards a donor's action C or D to be G or B, respectively, regardless of the recipient's reputation. In the absence of a groupstructured population, scoring does not realize cooperation based on indirect\nreciprocity unless certain specific conditions are met (Nowak and Sigmund,\n1998a; Brandt and Sigmund, 2005, 2006; Leimar and Hammerstein, 2001;\nOhtsuki and Iwasa, 2004). Simple standing (\"standing\" in Fig. 2), and stern\njudging (\"judging\" in Fig. 2; also known as Kandori) enable full cooperation (Leimar and Hammerstein, 2001; Ohtsuki and Iwasa, 2004). Shunning\nalso enables full cooperation if the players' reputations are initially C and\nthe number of rounds is finite (Ohtsuki and Iwasa, 2007) or if the players'\nreputations are partially invisible (Nakamura and Masuda, 2011).\nIn the presence of group structure, four possible locations of the observer\nare schematically shown in Fig. 1. I call the observer belonging to gd an\n\"ingroup\" observer. Otherwise, the observer is called an \"outgroup\" observer.\nThe observers can adopt different social norms for the four cases, as summarized in Fig. 1. When the donor and recipient belong to the same group\n(Fig. 1A), the ingroup observer uses the norm denoted by sii to update the\ndonor's personal reputation. In this situation, the outgroup observer does\nnot update the donor's or gd 's reputation (but see Appendix A). When the\ndonor and recipient belong to different groups (Fig. 1B), the ingroup observer\nuses the norm denoted by sio to update the donor's personal reputation. In\nthis situation, the outgroup observer uses the norm denoted by soo to update\ngd 's reputation. These four cases are explained in more detail in Sec. 2.1.4.\nThe distinction between sii and sio allows the ingroup observer to use a\ndouble standard for assessing donors. For example, a donor defecting against\nan ingroup G recipient may be regarded to be B, whereas a defection against\nan outgroup G recipient may be regarded as G. Such different assessments\nwould not be allowed if sii and sio are not distinguished.\nI call sii , sio , and soo subnorms. All the players are assumed to share the\nsubnorms. The typical norms shown in Fig. 2 can be used as subnorms. A\n\n6\n\n\fsubnorm is specified by assigning G or B to each combination of the donor's\naction (i.e., C or D) and recipient's reputation (i.e., G or B). Therefore, there\nare 24 = 16 subnorms. An entire social norm of a population consists of a\ncombination of the three subnorms, and there are 163 = 4096 social norms.\n2.1.3. Action rule\nThe action rule refers to the mapping from the recipient's reputation (i.e.,\nG or B) to the donor's action (i.e., C or D). The AllC and AllD donors cooperate and defect, respectively, regardless of the recipient's reputation. A discriminator (Disc) donor cooperates or defects when the recipient's reputation\nis G or B, respectively. An anti-discriminator (AntiDisc) donor cooperates\nor defects when the recipient's reputation is B or G, respectively.\nThe donor is allowed to use different action rules toward ingroup and\noutgroup recipients. For example, a donor who adopts AllC and AllD toward ingroup and outgroup recipients, respectively, implements reputationindependent ingroup favoritism. There are 4 × 4 = 16 action rules. A donor\nrefers to the recipient's personal reputation when gd = gr (Fig. 1A) and to\ngr 's group reputation when gd 6= gr (Fig. 1B).\n2.1.4. Reputation updates\nIn each round, the ingroup and outgroup observers update the donor's\nand gd 's reputations, respectively.\nIf gd = gr , the donor is assumed to recognize the recipient's personal reputation (Fig. 1A). An ingroup observer in this situation updates the donor's\npersonal reputation on the basis of the donor's action, the recipient's personal reputation, and subnorm sii . An outgroup observer in this situation\nis assumed not to update gd 's reputation because such an observer does not\nknow the recipient's personal reputation, although the donor does. Then, the\noutgroup observer may want to refrain from evaluating the donor because the\ndonor and the observer use different information about the recipient. I also\nanalyzed a variant of the model in which the outgroup observer updates\ngd 's reputation in this situation. The results are roughly the same as those\nobtained for the original model (Appendix A).\nIf gd 6= gr , the donor is assumed to recognize gr 's reputation, but not\nthe recipient's personal reputation (Fig. 1B). An ingroup observer in this\nsituation updates the donor's personal reputation on the basis of the donor's\naction, gr 's reputation, and subnorm sio . Both the donor and observer refer\nto gr 's reputation and not to the recipient's personal reputation. An outgroup\n7\n\n\fobserver in this situation updates gd 's reputation based on the donor's action,\ngr 's reputation, and subnorm soo .\nAn outgroup observer knows the recipient's personal reputation if the observer and recipient are in the same group. However, the observer is assumed\nto ignore this information for two reasons. First, it is evident for the observer\nthat the donor does not have access to the recipient's personal reputation. To\nexplain the second reason, let us consider an outgroup observer who belongs\nto gr in a certain round. Assume that this observer assigns a new reputation to gd according to a subnorm different from one used when the observer\ndoes not belong to gr . The same observer does not belong to gr when the\nobserver updates the gd 's group reputation next time. This is because the\nprobability that the observer belongs to gr is infinitesimally small because\nof the assumption of infinite groups. Therefore, the subnorm used when the\nobserver belongs to gr is rarely used and immaterial in the present model.\nFinally, observers commit reputation assessment error. With probability\nǫ, ingroup and outgroup observers independently assign the reputation opposite to the intended one to the donor and gd , respectively. I introduce this\nerror because G and B players must coexist in the population to distinguish\nthe payoff values for different pairs of action rule and social norm (action–\nnorm pair); such a distinction is necessary for the stability analysis in the\nfollowing discussion. For simplicity, I neglect other types of error.\n2.1.5. Mutant types\nTo examine the stability of an action rule under a given social norm, I\nconsider two types of mutants.\nThe first is a single mutant that invades a group. There are 16 − 1 = 15\ntypes of single mutants. A single mutant does not affect the action rule,\nnorm, or reputation of the group that the mutant belongs to because of the\nassumption of infinite group size.\nThe second type is a group mutant. A homogeneous group composed of\nmutants may make the mutant type stronger than the resident type. For\nexample, a group composed of players who cooperate with ingroup recipients\nand defect against outgroup recipients may invade a fully cooperative population if any intergroup interaction (i.e., C or D) is regarded to be G under\nsoo . By definition, a group mutant is a homogeneous group of mutants that\nis different from the resident players in either the action rule or social norm.\nI consider two varieties of group mutants, as described in Sec. 3.\n\n8\n\n\f2.2. Analysis methods\n2.2.1. Reputation scores in the equilibrium\nConsider a homogeneous resident population in which all players share\nan action–norm pair. I will examine the stability of this population against\ninvasion by single and group mutants. For this purpose, I calculate the\nfraction of players with a G reputation, probability of cooperation, and payoff\nafter infinitely many rounds.\nDenote by p∗ and p∗g the equilibrium probabilities that the player's and\ngroup's reputations are G, respectively. The self-consistent equation for p∗\nis given by\n\u0002\n\u0003 out \u0002 ∗ in out\n\u0003\nin\n∗\nin\nin\nout\np∗ = r in p∗ Φin\npg ΦG (σ ) + (1 − p∗g )Φin\n) ,\nG (σ ) + (1 − p )ΦB (σ ) +r\nB (σ\n(1)\nwhere σ in and σ out are the action rules (i.e., AllC, Disc, AntiDisc, or AllD)\nthat the donor adopts toward ingroup and outgroup recipients, respectively.\nin\nin\nin\nΦin\nG (σ ) and ΦB (σ ) are the probabilities that the ingroup observer, based\non sii , assigns reputation G to a donor who has played with a G or B inout\ngroup recipient (i.e., gd = gr ), respectively (Fig. 1A). Similarly Φin\n) and\nG (σ\nin\nout\nΦB (σ ) apply when the recipient is in a different group (i.e., gd 6= gr ) and\nout\nin\nin\n),\nthe observer uses sio (Fig. 1B). It should be noted that Φin\nG (σ ) and ΦG (σ\nin\nout\nfor example, may differ from each other even if σ = σ . Owing to the repin\nin\nin\nin\nout\nout\nutation assignment error, Φin\n), Φin\n) ∈ {ǫ, 1 − ǫ}\nG (σ ), ΦB (σ ), ΦG (σ\nB (σ\nholds true. For example, if the donor is Disc toward ingroup recipients and\nin\nin\nin\nsubnorm sii is scoring, Φin\nG (σ ) = 1 − ǫ and ΦB (σ ) = ǫ.\nThe self-consistent equation for p∗g is given by\n\u0002\n\u0003\nout\n∗\nout\nout\np∗g = r in p∗g + r out p∗g Φout\n(σ\n)\n+\n(1\n−\np\n)Φ\n(σ\n)\n,\nG\ng\nB\n\n(2)\n\nout\nout\nwhere Φout\n) ∈ {ǫ, 1 − ǫ} and Φout\n) ∈ {ǫ, 1 − ǫ} are the probabilities\nG (σ\nB (σ\nthat the outgroup observer, based on soo , assigns reputation G to the donor's\ngroup when the donor has played with a G or B outgroup recipient (i.e.,\ngd 6= gr ), respectively (Fig. 1B). The first term on the right-hand side of\nEq. (2) corresponds to the fact that gd 's reputation is not updated in the\nsituation illustrated in Fig. 1A.\nEquations (1) and (2) lead to\n\u0002 ∗ in out\n\u0003\nin in\nin\nout\n∗\nin\nout\nr\nΦ\n(σ\n)\n+\nr\np\nΦ\n(σ\n)\n+\n(1\n−\np\n)Φ\n(σ\n)\ng\ng\nB\nG\nB\np∗ =\n(3)\nin\nin in\nin\n1 − r inΦin\nG (σ ) + r ΦB (σ )\n\n9\n\n\fand\np∗g\n\nout\nr out Φout\n)\nB (σ\n=\n.\nout ) + r out Φout (σ out )\n1 − r in − r out Φout\nG (σ\nB\n\n(4)\n\n2.2.2. Stability against invasion by single mutants\nTo examine the stability of the action rule (σ in , σ out ) against invasion by\nsingle mutants under a given social norm, I consider a single mutant with\naction rule (σ in′ , σ out′ ). Because the group is assumed to be infinitely large,\na single mutant does not change the reputation of the invaded group. The\nequilibrium probability p′∗ that a mutant receives personal reputation G is\ngiven by\n\u0002\n\u0003 out \u0002 ∗ in out′\n\u0003\nin′\n∗\nin\nin′\nout′\np′∗ = r in p∗ Φin\npg ΦG (σ ) + (1 − p∗g )Φin\n) .\nG (σ ) + (1 − p )ΦB (σ ) +r\nB (σ\n(5)\nWhen the probability that the donor and gd have a G reputation is equal\nto p and pg , respectively, the resident donor cooperates with probability\nr inΨ(σ in , p) + r out Ψ(σ out , pg ),\n\n(6)\n\nΨ(σ̃, p̃) = p̃ζG (σ̃) + (1 − p̃)ζB (σ̃) (p̃ = p, pg )\n\n(7)\n\nwhere\nis the probability that a donor with action rule σ̃ ∈ {AllC, Disc, AntiDisc, AllD}\ncooperates when the recipient's personal or group reputation is G with probability p̃. ζG (σ̃) and ζB (σ̃) (σ̃ = σ in or σ out ) are the probabilities that a\nσ̃ donor cooperates with a G and B recipient, respectively. AllC, Disc, AntiDisc, and AllD correspond to (ζG (σ̃), ζB (σ̃)) = (1, 1), (1, 0), (0, 1), and (0, 0),\nrespectively.\nThe payoff to a resident (σ in , σ out )–player is given by\n\u0002\n\u0003\n\u0002\n\u0003\nπ = −c r in Ψ(σ in, p∗ ) + r out Ψ(σ out , p∗g ) + b r inΨ(σ in , p∗ ) + r out Ψ(σ out , p∗g ) .\n(8)\nin′\nout′\nThe payoff to a (σ , σ )–mutant invading the homogeneous population of\nthe resident action–norm pair is given by\n\u0002\n\u0003 \u0002\n\u0003\nπ ′ = −c r inΨ(σ in′ , p∗ ) + r out Ψ(σ out′ , p∗g ) +b r in Ψ(σ in, p′∗ ) + r out Ψ(σ out , p∗g ) .\n(9)\n′\nin\nout\nIf π > π for any mutant, the pair of the action rule (σ , σ ) and social\nnorm (sii , sio , soo ) is stable against invasion by single mutants.\n10\n\n\f2.2.3. Stability against invasion by group mutants\nFor a mutant group composed of players sharing an action–norm pair,\nlet p′∗\ng denote the equilibrium probability that the mutant group has group\nreputation G. I obtain\n\u0003\n\u0002\nin′\n′∗\nin′\nin′\np′∗ =r in p′∗ Φin′\nG (σ ) + (1 − p )ΦB (σ )\n\u0002\n\u0003\nout′\nout′\n+ r out p∗g Φin′\n) + (1 − p∗g )Φin′\n)\n(10)\nG (σ\nB (σ\nand\n\u0002 ∗ out out′\n\u0003\nin ′∗\nout\nout′\np′∗\npg ΦG (σ ) + (1 − p∗g )Φout\n) ,\ng = r pg + r\nB (σ\n\n(11)\n\n∗ out\nout′\nout′\np′∗\n) + (1 − p∗g )Φout\n),\ng = pg ΦG (σ\nB (σ\n\n(13)\n\nin′\nin′\nin′\nwhere Φin′\nG (σ ) or ΦB (σ ) is the probability that an ingroup observer assigns reputation G to a mutant donor who has played with a G or B ingroup\nin′\nrecipient, respectively. Even if σ in′ and σ in are the same, Φin′\nG (σ ) will be\nin\ngenerally different from Φin\nG (σ ) because the ingroup observer in the mutant\ngroup may use a subnorm sii that is different from one used in the resident\nout′\nout′\npopulation. Parallel definitions apply to Φin′\n) and Φin′\n). EquaG (σ\nB (σ\ntions (10) and (11) yield\n\u0002 ∗ in′ out′\n\u0003\nin′\nout\nout′\nr in Φin′\npg ΦG (σ ) + (1 − p∗g )Φin′\n)\nB (σ ) + r\nB (σ\n′∗\np =\n(12)\nin′\nin in′\nin′\n1 − r in Φin′\nG (σ ) + r ΦB (σ )\n\nand\nrespectively.\nThe payoff to a mutant player in the mutant group is given by\n\u0002\n\u0003 \u0002\n\u0003\nπg′ = −c r in Ψ(σ in′ , p′∗ ) + r out Ψ(σ out′ , p∗g ) +b r in Ψ(σ in′ , p′∗ ) + r out Ψ(σ out , p′∗\ng) .\n(14)\nIf π > πg′ holds true for any group mutant player, the resident population is\nstable against invasion by group mutants.\n3. Results\n3.1. Action–norm pairs stable against invasion by single mutants\nThere are 16 action rules and 163 = 4096 social norms, which leads to\n16 × 4096 = 65536 action–norm pairs. Because of the symmetry with respect to the swapping of G and B, I neglect action–norm pairs in which the\naction rule (i.e., AllC, Disc, AntiDisc, or AllD) toward ingroup recipients\n11\n\n\fis σ in = AntiDisc without loss of generality. Such an action–norm pair can\nbe converted to σ in = Disc by swapping G and B in the action rule and\nsocial norm. The model is also invariant if G and B group reputations are\ncompletely swapped in the action rule toward outgroup recipients σ out and\nsubnorms sio and soo . Therefore, I can also neglect the action–norm pairs\nwith σ out = AntiDisc without loss of generality. This symmetry consideration\nleaves 65536/4 = 16384 action–norm pairs (Fig. 3).\nI exhaustively examined the stability of all 16×4096 = 65536 action–norm\npairs. A similar exhaustive search was first conducted in (Ohtsuki and Iwasa,\n2004) for an indirect reciprocity game without group structure in the population. In the following, π (Eq. (8)) mentions the player's payoff in the resident\npopulation in the limit of no reputation assignment error, i.e., ǫ → 0.\nI first describe action rules that are stable against invasion by single\nmutants under a given social norm. I identified them using Eqs. (1)–(9).\nUnder any given social norm, action rule (σ in , σ out ) = (AllD, AllD) is stable\nand yields π = 0. Other action–norm pairs also yield π = 0, but there are\n588 stable action–norm pairs with π > 0 (Fig. 3). For a given social norm,\nat most one action rule that yields a positive payoff is stable. For all 588\nsolutions, the condition for stability against invasion by single mutants (i.e.,\nπ > π ′ , where π and π ′ are given by Eqs. (8) and (9), respectively) is given\nby\nbr in > c.\n(15)\nEquation (15) implies that cooperation is likely when the benefit-to-cost ratio\nis large, which is a standard result for different mechanisms of cooperation\nin social dilemma games (Nowak, 2006b). Cooperation is also likely when\nintragroup interaction is relatively more frequent than intergroup interaction\n(i.e., large r in ).\n3.2. Stability against invasion by group mutants\nThe stability of these 588 action–norm pairs against invasion by group\nmutants was also examined based on Eqs. (10)–(14). Properly setting the variety of group mutants is not a trivial issue. At most, 65536−1 = 65535 types\nof group mutants that differ from the resident population in either action rule\nor social norm are possible. However, an arbitrarily selected homogeneous\nmutant group may be fragile to invasion by different single mutants into the\nmutant group. Although I do not model evolutionary dynamics, evolution\nwould not allow the emergence and maintenance of such weak mutant groups.\nWith this in mind, I consider two group mutation scenarios.\n12\n\n\f3.2.1. Scenario 1\nSingle mutants may invade the resident population when Eq. (15) is violated. In this scenario 1, the mutants are assumed to differ from the resident\npopulation in the action rule, but not the social norm, for simplicity. There\nare 16 − 1 = 15 such mutants, and some of them, including (σ in , σ out ) =\n(AllD, AllD), can invade the resident population when 1 < b/c < 1/r in .\nSuch mutant action rules may spread to occupy a single group when Eq. (15)\nis violated. I consider the stability of the resident population against the homogeneous groups of mutants that invade the resident population as single\nmutants when 1 < b/c < 1/r in.\nAmong the 588 action–norm pairs that yield π > 0, 440 pairs are stable\nagainst group mutation. Among these 440 pairs, I focus on those yielding perfect intragroup cooperation, i.e., those yielding limǫ→0 Ψ(σ in, p∗ ) = 1, where\nΨ and p∗ are given in Sec. 2.2. For the other stable pairs, see Appendix B.\nThis criterion is satisfied by 270 pairs (Fig. 3). For all 270 pairs, every player\nobtains personal reputation G (i.e., limǫ→0 p∗ = 1), and the donor cooperates\nwith ingroup recipients because the recipients have reputation G (i.e., σ in =\nDisc).\nIn all 270 pairs, sii is either standing (GBGG in shorthand notation),\njudging (GBBG), or shunning (GBBB) (refer to Fig. 2 for definitions of\nthese norms). In the shorthand notation, the first, second, third, and fourth\nletters (either G or B) indicate the donor's or gd 's new reputation when the\ndonor cooperates with a G recipient, the donor defects against a G recipient,\nthe donor cooperates with a B recipient, and the donor defects against a B\nrecipient, respectively. Standing, judging, and shunning in sii are exchangeable for any fixed combination of σ in = Disc, σ out , sio , and soo . Therefore,\nthere are 270/3 = 90 combinations of σ out , sio , and soo , which are summarized in Table 1. An asterisk indicates an entry that can be either G or B.\nFor example, GB∗G indicates standing (GBGG) or judging (GBBG). The\nprobability of cooperation toward outgroup recipients, payoff (π; Eq. (8)),\nand the probability that a group has a G reputation (p∗g ; Eq. (2)) are also\nshown in Table 1. The stable action–norm pairs can be classified into three\ncategories.\n• Full cooperation: Donors behave as Disc toward outgroup recipients,\ni.e., σ out = Disc and cooperate with both ingroup and outgroup recipients with probability 1. Accordingly, π = b − c and p∗g = 1.\n\nIn this case, indirect reciprocity among different groups as well as that\n13\n\n\fwithin single groups is realized. Action rule σ in = σ out = Disc is stable if\nsio is either standing (GBGG), judging (GBBG), or shunning (GBBB)\nand soo is either standing or judging. The condition for stability against\ngroup mutation is the mildest one (i.e., b > c) for each action–norm\npair.\nUnder full cooperation, sio and sio must be one that stabilizes cooperation in the standard indirect reciprocity game without a groupstructured population (Ohtsuki and Iwasa, 2004; Nowak and Sigmund,\n2005; Ohtsuki and Iwasa, 2007). The ingroup observer monitors donors'\nactions toward outgroup recipients through the use of sio = standing, judging, or shunning, even though ingroup players are not directly\nharmed if donors defect against outgroup recipients. The ingroup observer does so because donors' defection against outgroup recipients\nwould negatively affect the group's reputation.\n• Partial ingroup favoritism: Donors adopt σ out = Disc and cooperate\nwith ingroup recipients with probability 1 and outgroup recipients with\nprobability 1/2. Accordingly, π = (b − c)(1 + r in )/2 and p∗g = 1/2.\nIn this case, action rule σ in = σ out = Disc is stable if sio is either standing (GBGG) or judging (GBBG), and soo is either scoring (GBGB) or\nshunning (GBBB). The condition for stability against group mutation\nis shown in Table 2.\n\n• Perfect ingroup favoritism: Donors adopt σ out = AllD and always cooperate with ingroup recipients and never with outgroup recipients regardless of the recipient's group reputation. Accordingly, π = (b−c)r in .\nTable 1 suggests that action rule (σ in , σ out ) = (Disc, AllD) can be\nstable for any subnorm soo . This is true because the group reputation,\nwhose update rule is given by soo , is irrelevant in the current situation;\nthe donor anyways defects against outgroup recipients. Nevertheless,\nsoo determines sio that is consistent with ingroup cooperation through\nthe probability of a G group reputation p∗g .\nWhen soo = ∗G∗G, the outgroup observer evaluates defection against\noutgroup recipients to be G (Fig. 1B). Therefore, p∗g = 1. In this case,\nsio = ∗GBB, ∗GBG, and ∗GGG stabilize perfect ingroup favoritism.\nUnder any of these sio , the ingroup observer assigns G to a donor that\ndefects against a recipient in a G outgroup because the second entry\n14\n\n\fof sio is equal to G in each case. Therefore, p∗ = 1, and full ingroup\ncooperation is stable.\nWhen soo = ∗G∗B or ∗B∗G, the outgroup observer evaluates defection\nagainst outgroup recipients to be G with probability 1/2. Therefore,\np∗g = 1/2. In this case, sio = ∗G∗G stabilizes perfect ingroup favoritism.\nUnder such an sio , the ingroup observer assigns G to a donor that\ndefects against a recipient in a G outgroup because the second and\nfourth entries of sio are equal to G.\nWhen soo = ∗B∗B, the outgroup observer evaluates defection against\noutgroup recipients to be B. Therefore, p∗g = 0. In this case, sio =\nBB∗G, BG∗G, and GG∗G stabilize perfect ingroup favoritism. Under\nsuch an sio , the ingroup observer assigns G to a donor that defects\nagainst a recipient in a G outgroup because the fourth entry of sio is\nequal to G.\nIn all the cases, the stability against invasion by group mutants requires\nb > c.\n3.2.2. Scenario 2\nIn scenario 2 of group mutation, it is hypothesized that a group of mutants immigrates from a different population that is stable against invasion\nby single mutants. Such a group mutant may appear owing to the encounter\nof different stable cultures (i.e., action–norm pairs). The pairs that are stable\nagainst invasion by single mutants and yield zero payoff, such as the population of AllD players, must be also included in the group mutant list. It\nshould be noted that a mutant group may have a different social norm from\nthat for the resident population.\nAmong the 588 action–norm pairs that are stable against single mutation,\nno pair is stable against group mutation. However, 140 pairs are stable\nagainst group mutation for any b > c in a relaxed sense that the resident\nplayer's payoff is not smaller than the group mutant's payoff, i.e., π ≥ πg′\n(Fig. 3). The homogeneous population of each pair is neutrally invaded by\nsome group mutants, i.e., π = πg′ . Therefore, I examine the evolutionary\nstability (e.g., Nowak (2006a)) against group mutation. In other words, for\nthe group mutants yielding π = πg′ , I require π > πg′ when the resident players\nare replaced by group mutants.\nAll 140 action–norm pairs are evolutionarily stable except that each pair\nis still neutrally invaded by their cousins. For example, four action–norm\n15\n\n\fpairs specified by σ in = σ out = Disc, sii = GB∗G, sio = GB∗G, soo = GBGG\nneutrally invade each other. These pairs yield the same payoff π = b − c\nand are evolutionarily stable against invasion by the other group mutants.\nTherefore, I conclude that the four pairs collectively form a set of stable\nsolutions. Other sets of stable solutions consist of four or eight neutrally\ninvadable action–norm pairs that yield the same payoff and differ only in sii\nand sio .\nAll 140 pairs realize perfect intragroup cooperation such that the players\nhave G personal reputations and σ in = Disc (Fig. 3). Subnorm sii = GBGG\n(i.e., standing) or GBBG (i.e., judging) is exchangeable for any fixed combination of σ in = Disc, σ out , sio , and soo . Therefore, there are 140/2 = 70\npossible combinations of σ out , sio , and soo , which are listed in Table 3. The\n140 pairs are a subset of the 270 pairs stable under scenario 1. The stable sets of action–norm pairs can be classified into three categories. (1)\nFull cooperation occurs if all the subnorms are standing or judging. As already mentioned as an example, under soo = GBGG, the four action–norm\npairs (σ in , σ out , sii , sio ) = (Disc, Disc, GBGG, GBGG), (Disc, Disc, GBGG,\nGBBG), (Disc, Disc, GBBG, GBGG), and (Disc, Disc, GBBG, GBBG) can\nneutrally invade each other. Similarly, if soo = GBBG, the same four action–\nnorm pairs constitute a set realizing stable full cooperation. These two sets\nof four pairs are evolutionarily stable against invasion by each other. In total, there are eight pairs that realize full cooperation. (2) Partial ingroup\nfavoritism occurs for a set of four action–norm pairs. (3) Perfect ingroup\nfavoritism occurs under the same subnorms soo as those for scenario 1. For a\nfixed soo , the same eight action–norm pairs (σ in , σ out , sii , sio) = (Disc, AllD,\nGB∗G, ∗G∗G) yield the same payoff π = (b − c)r in , can neutrally invade each\nother, and are evolutionarily stable against the other group mutants.\n3.3. When observers use simpler social norms\nIn fact, players may not differentiate between the three subnorms. Players\nmay use a common norm for assessing ingroup donors irrespective of the\nlocation of recipients. Table 1 indicates that, if sii = sio is imposed for\nthe resident population, but not for mutants, perfect ingroup favoritism is\nexcluded. Under scenario 1, full cooperation is stable when sii = sio =\nstanding, judging, or shunning and soo = standing or judging. Partial ingroup\nfavoritism is stable when sii = sio = standing or judging and soo = scoring\nor shunning. Under scenario 2, full cooperation is stable when sii = sio =\n\n16\n\n\fstanding or judging and soo = standing or judging. Partial ingroup favoritism\nis stable when sii = sio = standing or judging and soo = shunning.\nAlternatively, players may use a common norm for assessing donors playing with outgroup recipients irrespective of the location of donors. If sii 6= sio\nis allowed and sio = soo is imposed, partial ingroup favoritism is excluded.\nUnder scenario 1, full cooperation is stable when sii = standing, judging, or\nshunning and sio = soo = standing or judging. Perfect ingroup favoritism is\nstable when sii = standing, judging, or shunning and sio = soo = ∗G∗G. The\nresults under scenario 2 differ from those under scenario 1 only in that sii =\nshunning is disallowed.\nFinally, if all the three subnorms are forced to be equal, only full cooperation is stable, and the norm is standing or judging. This holds true for\nboth scenarios 1 and 2.\n4. Discussion\n4.1. Summary of the results\nI identified the pairs of action rule and social norm that are stable against\ninvasion by single and group mutants in the game of group-structured indirect\nreciprocity. Full cooperation (i.e., cooperation within and across groups)\nbased on personal and group reputations, partial ingroup favoritism, and\nperfect ingroup favoritism are stable under different social norms. Perfect\ningroup favoritism is attained only when the donor defects against outgroup\nrecipients regardless of their reputation (i.e., σ out = AllD). Perfect ingroup\nfavoritism does not occur with the combination of a donor that is ready\nto cooperate with G outgroup recipients (i.e., σ out = Disc) and a B group\nreputation. The mechanism for ingroup favoritism revealed in this study is\ndistinct from those proposed previously (see Sec. 1).\nThe major condition for either full cooperation, partial ingroup favoritism,\nand perfect ingroup favoritism, depending on the assumed social norm, is\ngiven by br in > c. In only 3 out of 270 social norms in scenario 1, an additional\ncondition for r in is imposed (Sec. 3.2.1). In general, different mechanisms of\ncooperation can be understood in an unified manner such that cooperation\noccurs if and only if b/c is larger than a threshold value (Nowak, 2006b). For\nexample, b/c must be larger than the inverse of the relatedness parameter r\nand the inverse of the discount factor in kin selection and direct reciprocity,\nrespectively. The present result also fits this view; r in corresponds to r in\nthe case of kin selection.\n17\n\n\fI assumed that players approximate personal reputations of individuals in\nother groups by group reputations (i.e., outgroup homogeneity). Adoption of\noutgroup homogeneity may be evolutionarily beneficial for players owing to\nthe reduction in the cognitive burden of recognizing others' personal reputations. Instead, the players pay potential costs of not being able to know the\npersonal reputations of individuals in other groups. To explore evolutionary\norigins of group reputation, one has to examine competition between players\nusing the group reputation and players not using it. It would also be necessary to introduce a parameter representing the cost of obtaining personal\nreputations of outgroup individuals. Such an analysis is warranted for future\nwork.\nAll the players are assumed to use the same social norm. This assumption\nmay be justified for well-mixed populations but less so for populations with\ngroup structure because group structure implies relatively little intergroup\ncommunication. It seems to be more natural to assume that subnorms sii and\nsio , which are used to evaluate actions of ingroup donors, depend on groups.\nUnder scenario 2 (Sec. 3.2.2), any stable action–norm pair is neutrally invaded by its cousins who are different in sii and sio . This result implies that\ndifferent groups can use different norms. For example, for all the solutions\nshown in Table 3, some groups can use sii = GBGG (i.e., standing), while\nother groups in the same population can use sio = GBBG (i.e., judging). To\nbetter understand the possibility of heterogeneous social norms, analyzing\na population composed of a small number of groups, probably by different\nmethods, would be helpful.\n4.2. Cooperation based on group reputation is distinct from group selection\nIndirect reciprocity based on group reputation is distinct from any type of\ngroup selection. This is true for both full cooperation and ingroup favoritism.\nThere are two dominant variants of group selection that serve as mechanisms\nfor cooperation in social dilemma games (West et al., 2007, 2008).\nThe first type is group competition, in which selection pressure acts on\ngroups such that a group with a large mean payoff would replace one with a\nsmall mean payoff. Models with group competition induce ingroup favoritism\n(Choi and Bowles, 2007; Garcı́a and van den Bergh, 2011), altruistic punishment (Boyd et al., 2003), and evolution of the judging social norm in the\nstandard game of indirect reciprocity whereby players interact within each\ngroup (Pacheco et al., 2006; Chalub et al., 2006). In contrast, the present\n\n18\n\n\fstudy is not concerned with evolutionary dynamics including group competition. The group mutant is assumed to statically compare the payoff to the\nresident group with that to the mutant group.\nThe second type of group selection requires assortative reproduction in\nthe sense that the offspring have a higher probability of belonging to specific\ngroups than to other groups depending on the offspring's genotype. It is\nmathematically identical with kin selection (West et al., 2007, 2008). This\nvariant of group selection is also irrelevant to the present model, which is not\nconcerned with the reproduction process.\nThe analysis in this study is purely static. I avoided examining evolutionary dynamics for two reasons. First, the discovered mechanism for cooperation may be confused with group selection in the presence of evolutionary\ndynamics. Second, the model becomes needlessly complicated. Introducing evolutionary dynamics implies that one specifies a rule for reproduction.\nOffspring may be assumed to belong to the parent's group or to migrate to\nanother group. It may then be necessary to consider the treatment of, for\nexample, the heterogeneous group size. Because evolutionary dynamics are\nneglected, the present model explains neither emergence of full cooperation\nand ingroup favoritism nor the likelihood of different solutions, which is a\nmain limitation of the present study.\nI stress that the concept of group mutants is introduced to sift the set of\nstable action–norm pairs. Unless group competition is assumed, the concept\nof group mutants does not particularly promote cooperation in evolutionary\ndynamics.\n4.3. Group competition can enable full cooperation and ingroup favoritism\neven if br in > c is violated\nUnder a proper social norm, full cooperation or ingroup favoritism is\nstable if br in > c (i.e., Eq. (15) is satisfied) in most cases. With probability r in , the donor, recipient, and observer are engaged in the standard\n(i.e., no group structure) indirect reciprocity game limited to a single group\n(Fig. 1A). In the standard indirect reciprocity game under incomplete information, bq > c is quite often the condition for cooperation, where q is the\nprobability that the recipient's reputation is observed. This holds true when\nq indicates the observation probability for the donor (Nowak and Sigmund,\n1998b,a; Brandt and Sigmund, 2005, 2006; Suzuki and Toquenaga, 2005) or\nthat for both the donor and observer (Nakamura and Masuda, 2011). Because r in is also equal to the probability that the donor sees the recipient's\n19\n\n\fpersonal reputation, r in resembles q. In fact, replacing r in by q in Eq. (15)\nyields bq > c.\nIf a player is capable of recognizing the personal reputation of a fixed number of others, the maximum population size for which indirect reciprocity is\npossible in the standard indirect reciprocity game scales as 1/q. The consistency between Eq. (15) and bq > c implies that the concept of group\nreputation does not increase the maximum population size for which indirect\nreciprocity occurs. However, under group competition (Sec. 4.2), full cooperation and ingroup favoritism can be stable even if the restriction imposed\nby Eq. (15) is removed.\nTo explain this point, assume that the population is subjected to evolutionary dynamics such that players with relatively large payoffs would bear\nmore offspring in the same group and group competition occurs. The rate of\ngroup competition is denoted by 1/tgc , where tgc is the mean time interval\nbetween successive group competition events. Emergence of a single mutant\noccurs with rate 1/tm . Selection and reproduction of single players occur\nwith rate 1/ts .\nIf Eq. (15) is violated, single mutants emerge in time ∝ tm . Then, some\ntypes of mutants, including the AllD mutant, spread in the invaded group in\ntime ∝ ts under scenario 1 of group mutation. The invaded group presumably\npossesses a smaller group-averaged payoff than other resident groups because\nthe resident population is stable against invasion by group mutants as long\nas b > c, in all but three of 270 action–norm pairs (Table 2). If 1/tgc ≫ 1/tm ,\nsuch an invaded group is likely to be eradicated by group competition because\ngroup competition occurs much faster than the emergence of single mutants.\nIn this case, full cooperation or ingroup favoritism, depending on the given\nsocial norm, can be maintained in the absence of Eq. (15). This discussion\ndoes not involve timescale ts .\nGroup competition is needed to remove Eq. (15). If Eq. (15) is imposed,\ncooperation occurs without group competition.\n4.4. Relationship to previous behavioral experiments\nIn this section, I discuss possible linkages between the present model\nand the previous experiments examining indirect reciprocity and third-party\npunishments.\nYamagishi and colleagues conducted a series of laboratory experiments to\nshow that ingroup favoritism is induced by a group heuristic (Yamagishi et al.,\n\n20\n\n\f1998, 1999; Yamagishi and Mifune, 2008). With a group heuristic, donors cooperate with ingroup recipients because the donors expect repayment from\nother ingroup players. Donors do not use the information about others' reputations in these experiments. In contrast, players use personal reputations\nof ingroup members in the present model. Nevertheless, the previous experiments and the current model do not contradict each other.\nIn another laboratory experiment, Mifune et al. showed that presentation\nof eye-like painting promotes donor's cooperation toward ingroup recipients\nin the dictator game (Mifune et al., 2010). For expository purposes, I define\nserious subnorm to be either standing, judging, or shunning. If the eyelike painting approximates an ingroup observer obeying a serious subnorm,\nthis experimental result is consistent with the present theory because ingroup\ncooperation is theoretically stable when the ingroup observer adopts a serious\nsubnorm. Because the painting does not increase the cooperation toward\noutgroup recipients (Mifune et al., 2010), it may not turn sio to a serious\nsubnorm for some psychological reason. Humans may use double standards,\ni.e., sii 6= sio , which favor ingroup favoritism in my model.\nOther behavioral experiments have addressed the relationship between\nthird-party altruistic punishments and ingroup favoritism (Bernhard et al.,\n2006; Shinada et al., 2004). In precise terms, third-party punishments and\nreputation-based indirect reciprocity are distinct mechanisms for cooperation\n(Sigmund et al., 2001; Ohtsuki et al., 2009). Nevertheless, below I discuss\npossible linkages between these experiments and my model.\nIn indigenous communities in Papua New Guinea (Bernhard et al., 2006),\nthe amount of punishment is larger if the punisher belongs to the donor's\ngroup than to a different group (compare ABC and AB cases in their Fig.\n1). Their results suggest that the ingroup observer may use a serious subnorm\nand the outgroup observer may not. Furthermore, given that the punisher\nis in the donor's group, the amount of punishment is larger if the donor and\nrecipient belong to the same group (Fig. 1A, if the punisher is identified\nwith the ingroup observer) than if they belong to different groups (Fig. 1B;\ncompare the ABC and AC cases in Fig. 1 of Bernhard et al. (2006)). In\nthis situation, the ingroup observer may use a serious subnorm sii when the\ndonor plays with ingroup recipients (Fig. 1A) and use a nonserious subnorm\nsio when the donor plays with outgroup recipients (Fig. 1B). My model reproduces ingroup favoritism under these conditions.\nHowever, my model and others are not concerned with a main finding in\n(Bernhard et al., 2006) that the amount of punishment is larger when the\n21\n\n\fpunisher and recipient belong to the same group. For the reasons stated in\nSec. 2.1.4, I did not assume that observers make their judgments differently\nwhen they belong to the recipient's group gr and to a different group. To\ntheoretically explain the main finding in Bernhard et al. (2006), one should\nexplicitly analyze the case of a finite number of groups.\nIn different laboratory experiments, the amount of punishment is larger\nfor an ingroup donor's defection than an outgroup donor's defection (Shinada et al.,\n2004). My results are consistent with their results in that, for ingroup favoritism, the donor's action must be seriously evaluated by the ingroup observer using sii and not seriously by the outgroup observer using soo .\n4.5. Reduction of ingroup favoritism\nAlthough ingroup favoritism seems to be a canonical behavior of humans, reduction of ingroup bias would induce intergroup cooperation and\nis socially preferable (Yamagishi et al., 1998). Full cooperation is Pareto\nefficient, whereas ingroup favoritism is not. Various psychological and sociological mechanisms for reducing the ingroup bias, such as guilt, \"automotive\" control, retraining, empathy, and decategorization have been proposed (Hewstone et al., 2002; Dovidio et al., 2005; Sedikides et al., 1998).\nMy results provide theory-based possibilities of reducing ingroup bias.\nFirst, if the social norm is fixed, conversion from ingroup favoritism to full\ncooperation is theoretically impossible because full cooperation and ingroup\nfavoritism do not coexist under a given social norm. Therefore, advising\nplayers to change their behavior toward outgroup recipients from AllD to Disc\nis not recommended unless the social norm is also altered. Conversion from\ningroup favoritism to full cooperation requires a change in the social norm\nsuch that players as observers seriously assess ingroup donors' actions toward\noutgroup recipients (with sio ) and outgroup–outgroup interaction (with soo ).\nIn particular, if sio is a serious subnorm, perfect ingroup favoritism with no\nintergroup cooperation disappears (Sec. 3.3).\nSecond, if the three subnorms are the same, the perfect and partial ingroup favoritism is eradicated. The coincidence of only two subnorms is insufficient to induce full cooperation (Sec. 3.3). The subnorms sii = sio = soo\nthat exclude the ingroup bias and realize full cooperation are standing or\njudging. Therefore, without speaking of serious subnorms, forcing players to\nuse the same subnorms consistently in assessing donors in different situations\nmay be also effective in inducing full cooperation.\n\n22\n\n\fIngroup favoritism has been mostly an experimental question except for\nsome recent theoretical studies. This study is a first step toward understanding and even manipulating the dichotomy between full cooperation and\ningroup favoritism in the context of indirect reciprocity.\n\n23\n\n\fAppendix A: A variant of the model with different reputation dynamics\nIn this section, I analyze a variant of the model in which outgroup observers update the group reputation of donors involved in ingroup interaction\n(i.e., gd = gr ).\nReputation dynamics\nI assume that the outgroup observer uses the donor's action, the recipient's personal reputation, and soo , to update gd 's (not the donor's personal)\nreputation.\nThe equivalent of Eq. (2) under this reputation update rule is given by\n\u0002\n\u0003 out \u0002 ∗ out out\n\u0003\nin\n∗\nout\nin\nout\np∗g = r in p∗ Φout\npg ΦG (σ ) + (1 − p∗g )Φout\n) .\nG (σ ) + (1 − p )ΦB (σ ) +r\nB (σ\n(16)\n∗\n∗\nI obtain p and pg by solving the set of linear equations (1) and (16). Equations (5)–(10), and (12) are unchanged. As compared to the case of the\noriginal reputation update rule (original case for short), Eq. (11) is replaced\nby\n\u0002 ′∗ out in′\n\u0003\nin\nin′\np′∗\np ΦG (σ ) + (1 − p′∗ )Φout\ng =r\nB (σ )\n\u0002\n\u0003\nout′\nout′\n+ r out p∗g Φout\n) + (1 − p∗g )Φout\n) .\n(17)\nG (σ\nB (σ\nThe equivalent of Eq. (13) is obtained by substituting Eq. (12) in Eq. (17).\nBecause of the symmetry with respect to G and B, I exclude action rules\nhaving σ in = AntiDisc from the exhaustive search, as I did in the original\ncase (Sec. 3.1). It should be noted that one cannot eliminate action–norm\npairs with σ out = AntiDisc on the basis of symmetry consideration, which is\ndifferent from the original case. This is because a player's personal and group\nreputations are interrelated through the behavior of the outgroup observer\nwhen gd = gr .\nResults\nUnder the modified reputation update rule, there are 725 action–norm\npairs that are stable against invasion by single mutants and yield π > 0.\nUnder scenario 1, 507 out of the 725 pairs are stable against group mutation, and 324 out of the 507 pairs yield perfect ingroup cooperation. The\n324 action–norm pairs are classified as follows. First, 68 pairs yield full cooperation with either (σ in , σ out ) = (Disc, Disc) or (Disc, AntiDisc). Second,\n24\n\n\f14 pairs yield partial ingroup favoritism with (σ in , σ out ) = (Disc, AntiDisc).\nThird, 236 pairs yield perfect ingroup favoritism with (σ in , σ out ) = (Disc,\nAllD). Fourth, 6 pairs yield perfect ingroup favoritism with (σ in , σ out ) =\n(Disc, AntiDisc).\nAs in the original case, σ in = Disc, and sii is either standing, judging,\nor shunning for these pairs. In contrast to the original case, (σ in , σ out ) =\n(Disc, AntiDisc) can be stable, yield perfect ingroup cooperation, and even\nyield outgroup cooperation, under some social norms. In such a situation,\nthe values of the personal and group reputations (i.e., G and B) have opposite meanings. In other words, a G but not B personal reputation elicits\nintragroup cooperation, while a B but not G group reputation elicits intergroup cooperation. Therefore, action rule (σ in , σ out ) = (Disc, AntiDisc) in\nthis situation can be regarded as a relative of (σ in , σ out ) = (Disc, Disc) in the\nsituation in which the values of the personal and group reputations have the\nsame meaning. On this basis, I consider that the present results are similar\nto those obtained for the original case (Table 1). In particular, only full cooperation is stable under standing or judging if sii , sio , and soo are assumed\nto be the same.\nUnder scenario 2, 144 out of 725 pairs are stable against group mutation,\nand all of them yield perfect ingroup cooperation. The 140 pairs that survive\nin the original case (Sec. 3.2.2) also survive under the modified reputation\nupdate rule. The action rule in the additional four (= 144 − 140) pairs is\n(σ in , σ out ) = (Disc, AntiDisc). Another difference from the original case is\nthat the action–norm pairs that yield partial ingroup favoritism in Table 3\nrealize full cooperation in the present case. Otherwise, the results are the\nsame as those in the original case. In summary, 16 pairs realize full cooperation, and 128 pairs realize perfect ingroup favoritism. As is the case for\nscenario 1, only full cooperation is stable with standing or judging if the three\nsubnorms are assumed to be the same.\nAppendix B: The rest of the stable action–norm pairs under scenario 1\nUnder sceinario 1 in the original case, 270 out of 440 stable action–norm\npairs with a positive payoff realize perfect intragroup cooperation (Sec. 3.2.1).\nThe other 170 stable action–norm pairs yielding π > 0 are summarized in\nTable 4. For all the stable action–norm pairs shown, σ in = Disc. Table 4\nindicates that outgroup favoritism does not occur.\n25\n\n\fThere are 18 rows in Table 4. For the two action–norm pairs shown in\nthe first row, the stability condition is given by br in > c and r in < 1/2. For\nthe two action–norm pairs shown\nin the sixth row, the stability condition is\n√\nin\nin\ngiven by br > c and r > 2 − 1. For the four action–norm pairs shown in\nthe sixteenth row, the stability condition is given by b/c > (1 + r in )/r in. For\nall the other action–norm pairs, the stability condition is given by br in > c.\nAcknowledgements\nI thank Mitsuhiro Nakamura and Hisashi Ohtsuki for valuable discussions\nand acknowledge the support provided through Grants-in-Aid for Scientific\nResearch (Nos. 20760258 and 23681033, and Innovative Areas \"Systems\nMolecular Ethology\"(No. 20115009)) from MEXT, Japan.\nReferences\nAntal, T., Ohtsuki, H., Wakeley, J., Taylor, P. D., Nowak, M. A., 2009.\nEvolution of cooperation by phenotypic similarity. Proc. Natl. Acad. Sci.\nUSA 106, 8597–8600.\nAxelrod, R., 1984. Evolution of Cooperation. Basic Books, NY.\nBernhard, H., Fischbacher, U., Fehr, E., 2006. Parochial altruism in humans.\nNature 442, 912–915.\nBoyd, R., Gintis, H., Bowles, S., Richerson, P. J., 2003. The evolution of\naltruistic punishment. Proc. Natl. Acad. Sci. USA 100, 3531–3535.\nBrandt, H., Sigmund, K., 2005. Indirect reciprocity, image scoring, and moral\nhazard. Proc. Natl. Acad. Sci. USA 102, 2666–2670.\nBrandt, H., Sigmund, K., 2006. The good, the bad and the discriminator -\nerrors in direct and indirect reciprocity. J. Theor. Biol. 239 (2), 183–194.\nBrewer, M. B., 1999. The psychology of prejudice: Ingroup love and outgroup\nhate? J. Soc. Issues 55, 429–444.\nBrown, R., 2000. Group Processes, second edition. Blackwell Publishing,\nMalden, MA.\n\n26\n\n\fBshary, R., Grutter, A. S., 2006. Image scoring and cooperation in a cleaner\nfish mutualism. Nature 441 (7096), 975–978.\nChalub, F. A. C. C., Santos, F. C., Pacheco, J. M., 2006. The evolution of\nnorms. J. Theor. Biol. 241, 233–240.\nChoi, J. K., Bowles, S., 2007. The coevolution of parochial altruism and war.\nScience 318, 636–640.\nDe Cremer, D., van Vugt, M., 1999. Social identification effects in social\ndilemmas: a transformation of motives. Eur. J. Soc. Psychol. 29, 871–893.\nDovidio, J. F., Glick, P., Rudman, L. A. (Eds.), 2005. On the nature of\nprejudice. Blackwell Publishing, Malden, MA.\nEfferson, C., Lalive, R., Fehr, E., 2008. The coevolution of cultural groups\nand ingroup favoritism. Science 321, 1844–1849.\nFortunato, S., 2010. Community detection in graphs. Phys. Rep. 486, 75–174.\nFowler, J. H., Kam, C. D., 2007. Beyond the self: social identity, altruism,\nand political participation. J. Politics 69, 813–827.\nGarcı́a, J., van den Bergh, J. C. J. M., 2011. Evolution of parochial altruism\nby multilevel selection. Evol. Human Behav. 32, 277–287.\nGoette, L., Huffman, D., Meier, S., 2006. The impact of group membership\non cooperation and norm enforcement: Evidence using random assignment\nto real social groups. Amer. Econ. Rev. 96, 212–216.\nHewstone, M., Rubin, M., Willis, H., 2002. Intergroup bias. Annu. Rev.\nPsychol. 53, 575–604.\nIhara, Y., 2011. Evolution of culture-dependent discriminate sociality: a\ngene-culture coevolutionary model. Phil. Trans. R. Soc. Lond. B 366, 889–\n900.\nJansen, V. A. A., van Baalen, M., 2006. Altruism through beard chromodynamics. Nature 440, 663–666.\nJones, E. E., Wood, G. C., Quattrone, G. A., 1981. Perceived variability of\npersonal characteristics in in-groups and out-groups: the role of knowledge\nand evaluation. Person. Soc. Psychol. Bull. 7, 523–528.\n27\n\n\fLeimar, O., Hammerstein, P., 2001. Evolution of cooperation through indirect reciprocity. Proc. R. Soc. B 268, 745–753.\nLize, A., Carval, D., Cortesero, A. M., Fournet, S., Poinsot, D., 2006. Kin\ndiscrimination and altruism in the larvae of a solitary insect. Proc. R. Soc.\nB 273, 2381–2386.\nMasuda, N., Ohtsuki, H., 2007. Tag-based indirect reciprocity by incomplete\nsocial information. Proc. R. Soc. B 274, 689–695.\nMifune, N., Hashimoto, H., Yamagishi, T., 2010. Altruism toward in-group\nmembers as a reputation mechanism. Evol. Human Behav. 31, 109–117.\nNakamura, M., Masuda, N., 2011. Indirect reciprocity under incomplete observation. PLoS Comput. Biol. 7, e1002113.\nNowak, M. A., 2006a. Evolutionary Dynamics. The Belknap Press of Harvard\nUniversity Press, MA.\nNowak, M. A., 2006b. Five rules for the evolution of cooperation. Science\n314, 1560–1563.\nNowak, M. A., Sigmund, K., 1998a. The dynamics of indirect reciprocity. J.\nTheor. Biol. 194, 561–574.\nNowak, M. A., Sigmund, K., 1998b. Evolution of indirect reciprocity by image\nscoring. Nature 393, 573–577.\nNowak, M. A., Sigmund, K., 2005. Evolution of indirect reciprocity. Nature\n437, 1291–1298.\nOhtsuki, H., Iwasa, Y., 2004. How should we define goodness?–reputation\ndynamics in indirect reciprocity. J. Theor. Biol. 231, 107–120.\nOhtsuki, H., Iwasa, Y., 2007. Global analyses of evolutionary dynamics and\nexhaustive search for social norms that maintain cooperation by reputation. J. Theor. Biol. 244, 518–531.\nOhtsuki, H., Iwasa, Y., Nowak, M. A., 2009. Indirect reciprocity provides\nonly a narrow margin of efficiency for costly punishment. Nature 457, 79–\n82.\n28\n\n\fOstrom, T. M., Sedikides, C., 1992. Out-group homogeneity effects in natural\nand minimal groups. Psychol. Bull. 112, 536–552.\nPacheco, J. M., Santos, F. C., Chalub, F. A. C. C., 2006. Stern-judging: A\nsimple, successful norm which promotes cooperation under indirect reciprocity. PLoS Comput. Biol. 2, 1634–1638.\nRand, D. G., Pfeiffer, T., Dreber, A., Sheketoff, R. W., Wernerfelt, N. C.,\nBenkler, Y., 2009. Dynamic remodeling of in-group bias during the 2008\npresidential election. Proc. Natl. Acad. Sci. USA 106, 6187–6191.\nSedikides, G., Schopler, J., Insko, C. A. (Eds.), 1998. Intergroup Cognition\nand Intergroup Behavior. Psychology Press, New York.\nShinada, M., Yamagishi, T., Ohmura, Y., 2004. False friends are worse than\nbitter enemies: \"Altruistic\" punishment of in-group members. Evol. Human Behav. 25, 379–393.\nSigmund, K., Hauert, C., Nowak, M. A., 2001. Reward and punishment.\nProc. Natl. Acad. Sci. USA 98, 10757–10762.\nSuzuki, Y., Toquenaga, Y., 2005. Effects of information and group structure\non evolution of altruism: analysis of two-score model by covariance and\ncontextual analyses. J. Theor. Biol. 232, 191–201.\nTraulsen, A., 2008. Mechanisms for similarity based cooperation. Eur. Phys.\nJ. B 63, 363–371.\nTraulsen, A., Nowak, M. A., 2007. Chromodynamics of cooperation in finite\npopulations. PLoS ONE 2, e270.\nTrivers, R. L., 1971. The evolution of reciprocal altruism. Q. Rev. Biol. 46,\n35–57.\nWest, S. A., Griffin, A. S., Gardner, A., 2007. Social semantics: altruism,\ncooperation, mutualism, strong reciprocity and group selection. J. Evol.\nBiol. 20, 415–432.\nWest, S. A., Griffin, A. S., Gardner, A., 2008. Social semantics: how useful\nhas group selection been? J. Evol. Biol. 21, 374–385.\n\n29\n\n\fYamagishi, T., Jin, N., Kiyonari, T., 1999. Bounded generalized reciprocity\n- ingroup boasting and ingroup favoritism. In: Advances in group processes 16, 161–197.\nYamagishi, T., Jin, N., Miller, A. S., 1998. In-group bias and culture of\ncollectivism. Asian J. Soc. Psychol. 1, 315–328.\nYamagishi, T., Mifune, N., 2008. Does shared group membership promote\naltruism? Rationality and Society 20, 5–30.\n\n30\n\n\f$\nd\n\n%&'\n\ni\n\nr\n\no\n\ni\n\no\n\nd\n\n())*+,)\"-&.\"/0\"\"\"\"\"\"1)*,+\"#**\n!02)\",0/3*,+\n\n!!\"=\"!#\n.\ni\n\nd\ni\n\n%&'\nr\no\n\no\n\n!!\n≠\n!#\n\nd\nr\n\nd\n\n())*+,)\"-&.\"/0\"\"\"\"\"\"1)*,+\"#*0\"\n())*+,)\"-&.\"/0\"!!\"1)*,+\"#00\n\n4\"!0,0#\n4\"#28*5*2,/\n\ni\no\n\n4\"*,+#015\"06)2#72#\n4\"01/+#015\"06)2#72#\n\n())*+,\"-&.\"/0\"!\"1)*,+\"#**\nFigure 1: Schematic representation of ingroup and outgroup observers. In A, the donor's\ngroup gd and the recipient's group gr are identical. This event occurs with probability rin .\nIn B, gd 6= gr . This event occurs with probability rout = 1 − rin .\n\n31\n\n\fFigure 2: Typical second-order social norms. The rows outside the boxes represent the\ndonor's actions (C or D), and the columns represent the recipient's reputations (G or B).\nThe entries inside the boxes represent the reputations that the observer assigns to the\ndonor in each case.\n\n32\n\n\f!\"\"#!$%&'()*)(+,$-%.+/$.)$0(0%1\n/3,,40+3$&()/.54+%'()\n\n6!#27$-%.+/\n/0%814$%9%.)/0$/.)914$,:0%)0/$\n%)5$-(/.';4$-%3(<\n\n/&4)%+.($6\n\n/&4)%+.($=\n\n\"22$-%.+/\n\n/0%814$%9%.)/0$\n9+(:-$,:0%)0/\n\n/0%814$%9%.)/0$9+(:-$,:0%)0/$\n>.)$%$+41%?45$/4)/4@\n\n77B$-%.+/\n\n67B$-%.+/\n\n-4+A4&0$.)9+(:-$&((-4+%'()\n\n67B$-%.+/\n\n=CB$-%.+/\n\nFigure 3: Procedure for obtaining the stable action–norm pairs with perfect ingroup cooperation shown in Tables 1 and 3.\n\n33\n\n\fTable 1: Stable action–norm pairs with perfect ingroup cooperation under scenario 1.\nThe probability of cooperation with outgroup recipients, π, and p∗g are the values in the\nlimit ǫ → 0. sii = GBGG (standing), GBBG (judging), or GBBB (shunning). Action–\nnorm pairs only different in sii were distinguished when counting the number of stable\naction–norm pairs. An asterisk indicates that both G and B apply.\n\nState\n\nProb. C to\noutgroup\n\nπ\n\nσ out\n\np∗g\n\nFull cooperation\n\n1\n\nb−c\n\nDisc\n\n1\n\nPartial ingroup\nfavoritism\n\n1\n2\n\n(b−c)(1+r in )\n2\n\nDisc\n\n1\n2\n\n1\nPerfect ingroup\nfavoritism\n\n0\n\n(b − c)r in\n\nAllD\n\n1\n2\n\n0\n\nSocial norm\nNo.\n(sio –soo )\npairs\nGB∗G–GB∗G\n18\nGBBB–GB∗G\nGB∗G-GB∗B\n∗GBB–∗G∗G\n∗GBG–∗G∗G\n∗GGG–∗G∗G\n∗G∗G–∗G∗B\n∗G∗G–∗B∗G\nBB∗G–∗B∗B\nBG∗G–∗B∗B\nGG∗G–∗B∗B\n\n12\n72\n96\n72\n\n\fTable 2: Conditions for stability of partial ingroup favoritism against group mutation\nunder scenario 1. The condition on rin is required for the three out of 12 social norms to\nprevent the invasion by group mutants that defect against ingroup recipients and cooperate\nwith outgroup recipients.\n\nSocial norm\nNo.\n(sio –soo )\npairs\nGBBG–GBBB\nb>c\nGBGG, GBBG, or GBBB GBGG–GBBB\n9\nGBBG–GBGB\n√\nb > c and r in > 2 − 1\nGBGG\nGBGG–GBGB\n1\nin\nb > c and r > 1/2\nGBBG or GBBB\nGBGG–GBGB\n2\nConditions\n\nSocial norm\n(sii )\n\n\fTable 3: Stable action–norm pairs with perfect ingroup cooperation under scenario 2. sii =\nGBGG (standing) or GBBG (judging). Different action–norm pairs in the same row are\nneutrally invadable to each other. An asterisk indicates either G or B.\n\nState\n\nProb. C to\noutgroup\n\nπ\n\nσ out\n\np∗g\n\nFull cooperation\n\n1\n\nb−c\n\nDisc\n\n1\n\nPartial ingroup\nfavoritism\n\n1\n2\n\n(b−c)(1+r in )\n2\n\nDisc\n\n1\n2\n\n1\n\nPerfect ingroup\nfavoritism\n\n0\n\n(b − c)r in\n\nAllD\n\n1\n2\n\n0\n\nSocial norm\nNo.\n(sio –soo )\npairs\nGB∗G–GBGG\n8\nGB∗G–GBBG\nGB∗G–GBBB\n∗G∗G–BGBG\n∗G∗G–GGBG\n∗G∗G–BGGG\n∗G∗G–GGGG\n∗G∗G–BGBB\n∗G∗G–GGBB\n∗G∗G–BGGB\n∗G∗G–GGGB\n∗G∗G–BBBG\n∗G∗G–GBBG\n∗G∗G–BBGG\n∗G∗G–GBGG\n∗G∗G–BBBB\n∗G∗G–GBBB\n∗G∗G–BBGB\n∗G∗G–GBGB\n\n4\n\n32\n\n64\n\n32\n\n\fTable 4: Stable action–norm pairs with a positive probability of cooperation that are not\nincluded in Table 1. sii = GBGG (standing), GBBG (judging), or GBBB (shunning). An\nasterisk indicates either G or B. The sixth and seventh rows in the table are not aggregated\nbecause the stability condition is different between these cases (Appendix B).\n\nProb. C to\ningroup\n\nProb. C to\noutgroup\n\nπ\n\nσ out\n\np∗\n\np∗g\n\n1\n2\n\n1\n2\n\nb−c\n2\n\nDisc\n\n1\n2\n\n1\n2\n\n1\n2\n\n0\n\n(b−c)r in\n2\n\nAllD\n\n1\n2\n\n1\n2\n\n1+r in\n2\n\n1\n2\n\n(b−c)(1+(r in )2 )\n2\n\nDisc\n\n1+r in\n2\n\n1\n2\n\n1+r in\n2\n\n0\n\n(b−c)r in (1+r in )\n2\n\nAllD\n\n1+r in\n2\n\n1\n2\n\n1\nAllD\nr in\n\n0\n\n(b − c)(r in)2\n\nr in\n\n1\n2\n\nDisc\nAllD\n\n0\n\nSocial norm\nNo.\n(sii –sio –soo )\npairs\nGBBB-GBBB–GB∗B\n2\nGBBB–∗GBB-∗G∗B\nGBBB–BB∗G-∗G∗B\n32\nGBBB–∗GBB-∗B∗G\nGBBB–BB∗G-∗B∗G\nGB∗G–GBBB-GBGB\n4\nGB∗G–GBBB-GBBB\nGB∗G–∗GBB–∗G∗B\nGB∗G–BB∗G–∗G∗B\n64\nGB∗G–∗GBB–∗B∗G\nGB∗G–BB∗G–∗B∗G\nGB∗G–BBBB-∗G∗G\nGB∗G–BB∗G–∗G∗G\nGB∗G–BBBB–∗G∗B\nGB∗G–BBBB–∗B∗G\n68\nGB∗G–GBBB–BB∗B\nGB∗G–BBBB–∗B∗B\nGB∗G–∗GBB–∗B∗B\n\n\f"}