{"id": "http://arxiv.org/abs/0807.3011v2", "guidislink": true, "updated": "2008-12-05T16:40:30Z", "updated_parsed": [2008, 12, 5, 16, 40, 30, 4, 340, 0], "published": "2008-07-18T16:57:28Z", "published_parsed": [2008, 7, 18, 16, 57, 28, 4, 200, 0], "title": "Driving-induced crossover: from classical criticality to self-organized\n  criticality", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0807.0060%2C0807.4789%2C0807.1621%2C0807.2283%2C0807.3906%2C0807.4644%2C0807.3759%2C0807.2658%2C0807.2186%2C0807.1476%2C0807.2704%2C0807.2248%2C0807.2518%2C0807.0012%2C0807.2474%2C0807.2079%2C0807.2576%2C0807.4327%2C0807.2143%2C0807.3007%2C0807.1255%2C0807.4912%2C0807.2996%2C0807.2018%2C0807.2825%2C0807.2146%2C0807.2970%2C0807.2476%2C0807.3306%2C0807.0832%2C0807.1164%2C0807.4794%2C0807.2545%2C0807.0059%2C0807.1656%2C0807.1420%2C0807.2488%2C0807.0490%2C0807.0147%2C0807.4044%2C0807.1314%2C0807.2542%2C0807.1704%2C0807.3277%2C0807.0835%2C0807.2346%2C0807.1450%2C0807.2877%2C0807.0455%2C0807.1229%2C0807.2094%2C0807.1018%2C0807.4855%2C0807.4877%2C0807.1971%2C0807.4174%2C0807.1667%2C0807.4895%2C0807.0362%2C0807.0653%2C0807.0569%2C0807.4751%2C0807.4296%2C0807.5017%2C0807.1584%2C0807.4998%2C0807.5103%2C0807.4600%2C0807.3804%2C0807.3842%2C0807.5089%2C0807.1565%2C0807.4180%2C0807.1728%2C0807.2148%2C0807.0616%2C0807.3924%2C0807.4838%2C0807.2968%2C0807.0895%2C0807.2188%2C0807.0800%2C0807.4093%2C0807.3310%2C0807.0991%2C0807.5003%2C0807.1394%2C0807.0095%2C0807.0613%2C0807.0046%2C0807.0789%2C0807.4015%2C0807.2288%2C0807.3138%2C0807.3011%2C0807.4745%2C0807.2681%2C0807.2762%2C0807.2199%2C0807.4928%2C0807.3327&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Driving-induced crossover: from classical criticality to self-organized\n  criticality"}, "summary": "We propose a spin model with quenched disorder which exhibits in slow driving\ntwo drastically different types of critical nonequilibrium steady states. One\nof them corresponds to classical criticality requiring fine-tuning of the\ndisorder. The other is a self-organized criticality which is insensitive to\ndisorder. The crossover between the two types of criticality is determined by\nthe mode of driving. As one moves from \"soft\" to \"hard\" driving the\nuniversality class of the critical point changes from a classical\norder-disorder to a quenched Edwards-Wilkinson universality class. The model is\nviewed as prototypical for a broad class of physical phenomena ranging from\nmagnetism to earthquakes.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0807.0060%2C0807.4789%2C0807.1621%2C0807.2283%2C0807.3906%2C0807.4644%2C0807.3759%2C0807.2658%2C0807.2186%2C0807.1476%2C0807.2704%2C0807.2248%2C0807.2518%2C0807.0012%2C0807.2474%2C0807.2079%2C0807.2576%2C0807.4327%2C0807.2143%2C0807.3007%2C0807.1255%2C0807.4912%2C0807.2996%2C0807.2018%2C0807.2825%2C0807.2146%2C0807.2970%2C0807.2476%2C0807.3306%2C0807.0832%2C0807.1164%2C0807.4794%2C0807.2545%2C0807.0059%2C0807.1656%2C0807.1420%2C0807.2488%2C0807.0490%2C0807.0147%2C0807.4044%2C0807.1314%2C0807.2542%2C0807.1704%2C0807.3277%2C0807.0835%2C0807.2346%2C0807.1450%2C0807.2877%2C0807.0455%2C0807.1229%2C0807.2094%2C0807.1018%2C0807.4855%2C0807.4877%2C0807.1971%2C0807.4174%2C0807.1667%2C0807.4895%2C0807.0362%2C0807.0653%2C0807.0569%2C0807.4751%2C0807.4296%2C0807.5017%2C0807.1584%2C0807.4998%2C0807.5103%2C0807.4600%2C0807.3804%2C0807.3842%2C0807.5089%2C0807.1565%2C0807.4180%2C0807.1728%2C0807.2148%2C0807.0616%2C0807.3924%2C0807.4838%2C0807.2968%2C0807.0895%2C0807.2188%2C0807.0800%2C0807.4093%2C0807.3310%2C0807.0991%2C0807.5003%2C0807.1394%2C0807.0095%2C0807.0613%2C0807.0046%2C0807.0789%2C0807.4015%2C0807.2288%2C0807.3138%2C0807.3011%2C0807.4745%2C0807.2681%2C0807.2762%2C0807.2199%2C0807.4928%2C0807.3327&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We propose a spin model with quenched disorder which exhibits in slow driving\ntwo drastically different types of critical nonequilibrium steady states. One\nof them corresponds to classical criticality requiring fine-tuning of the\ndisorder. The other is a self-organized criticality which is insensitive to\ndisorder. The crossover between the two types of criticality is determined by\nthe mode of driving. As one moves from \"soft\" to \"hard\" driving the\nuniversality class of the critical point changes from a classical\norder-disorder to a quenched Edwards-Wilkinson universality class. The model is\nviewed as prototypical for a broad class of physical phenomena ranging from\nmagnetism to earthquakes."}, "authors": ["Francisco-Jose Perez-Reche", "Lev Truskinovsky", "Giovanni Zanzotto"], "author_detail": {"name": "Giovanni Zanzotto"}, "author": "Giovanni Zanzotto", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1103/PhysRevLett.101.230601", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/0807.3011v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0807.3011v2", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "4 pages, 4 figures", "arxiv_primary_category": {"term": "cond-mat.dis-nn", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cond-mat.dis-nn", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0807.3011v2", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0807.3011v2", "journal_reference": "Phys. Rev. Lett. 101, 230601 (2008)", "doi": "10.1103/PhysRevLett.101.230601", "fulltext": "Driving-induced crossover: from classical criticality to self-organized criticality\nFrancisco-José Pérez-Reche,1, 2 Lev Truskinovsky,2 and Giovanni Zanzotto3\n\narXiv:0807.3011v2 [cond-mat.dis-nn] 5 Dec 2008\n\n1\n\nDepartment of Chemistry, University of Cambridge, Cambridge, CB2 1EW, UK∗\n2\nLaboratoire de Mécanique des Solides, CNRS UMR-7649,\nEcole Polytechnique, Route de Saclay, 91128 Palaiseau, France\n3\nDipartimento di Metodi e Modelli Matematici per le Scienze Applicate,\nUniversità di Padova, Via Trieste 63, 35121 Padova, Italy\n\nWe propose a spin model with quenched disorder which exhibits in slow driving two drastically\ndifferent types of critical nonequilibrium steady states. One of them corresponds to classical criticality requiring fine-tuning of the disorder. The other is a self-organized criticality which is insensitive\nto disorder. The crossover between the two types of criticality is determined by the mode of driving.\nAs one moves from \"soft\" to \"hard\" driving the universality class of the critical point changes from\na classical order-disorder to a quenched Edwards-Wilkinson universality class. The model is viewed\nas prototypical for a broad class of physical phenomena ranging from magnetism to earthquakes.\nPACS numbers: 05.70.Jk,64.60.My,64.70.K,64.60.av\n\nThe study of criticality in externally driven inhomogeneous systems has attracted much attention in the last\ntwo decades [1]. Such systems exhibit rate independent\ndissipation and are widely used to model hysteretic phenomena and intermittency associated with magnetism,\nsuperconductivity, porous flow, fracture, friction, plasticity and martensitic phase transitions [2]. It has been\nrealized that in most cases scaling emerges as an interplay between quenched disorder, extremal dynamics, and\nquasi-static driving [24]. Within this general framework\nthe theoretical work has been mostly focussed on two\ntypes of models. In models of the Random Field Ising\n(RFIM) type, the critical behavior requires fine tuning\nof the amount of disorder r and the intermittent events\n(avalanches) are scale-free only at a certain r = ro [1].\nAn alternative approach links criticality to a pinningdepinning (PD) transition where the disorder r is an irrelevant parameter [3]. It has been established that criticality in the first class of models is classical, as in second\norder phase transitions [1], while in the second class it is\nself tuning in the sense that infinitely slow driving brings\nthe system automatically on a critical manifold [4, 5, 6].\nThe two approaches are fundamentally different. The\nfirst model describes regimes with dominating nucleation,\nwhile the second one deals exclusively with propagation.\nIt is then not surprising that the resulting criticality is\ndifferent. In the RFIM the emerging scaling has been\nexplained by the existence of a classical critical point\nof the order-disorder (OD) type. On the contrary, in\nPD theory one encounters a range of universality classes\nnone of which can be formally reduced to OD. A relation between the two types of critical phenomena has\nbeen, however, anticipated. Previous work has shown\nthat the presence of a nonlocal demagnetizing field of\nantiferromagnetic nature (as in soft magnets) can self\ntune the RFIM to display front-propagation critical exponents [7, 8]. In the PD framework similar 'self-tuning',\noften interpreted as self organized criticality (SOC), is\n\nobtained if the system is driven through a 'weak spring'\nwhich provides an explicit feedback mechanism [9]. In\nthis letter we use these insights to develop the first unifying model which displays a crossover between the OD\nand quenched Edwards-Wilkinson (QEW) universality\nclasses. We show that such crossover can be achieved\nexperimentally by modifying the properties of the external driving. Since the QEW model is equivalent to the\nOslo rice pile model [12] and is therefore paradigmatic for\nSOC, we are essentially dealing here with a fundamental\nrelation between OD and SOC.\nWe base our model on the observation that solids can\nbe deformed either by applying a force (soft device), or by\ncontrolling surface displacements (hard device) [13, 14].\nBoth driving mechanisms, soft and hard, can be handled\nsimultaneously if the system has a finite 'elasticity'. To\nintroduce this effect in a spin setting, consider a prototypical model which we call RSSM (Random Soft-Spin\n[15] or Snap-Spring [16, 17] Model). The main difference between the RSSM and its predecessor RFIM is\nthe finite curvature of the energy wells and the presence of elastic barriers. While the role of the softness\nof the spins is known to be secondary in equilibrium and\nin the case of soft driving, where it can be accounted\nfor through an appropriate 'dressing' of the underlying\nhard-spin model [15], the curvature of the wells becomes\ncrucial in the case with hard driving where it plays the\nrole of a regularization of the otherwise degenerate problem [14]. Consider a set of N bi-stable units located on\nthe nodes i = 1, 2, . . . N of a cubic lattice with linear size\nL = N 1/3 . The state of each snap-spring is characterized\nby a continuous scalar order parameter ei measuring the\nlocal 'strain'. The energy of the system is\nφ=\n\nN\nN\n1 X\n1 X\nfi (ei ) +\nKij ei ej ,\nN i=1\n2N i,j=1\n\n(1)\n\nwhere fi (ei ) is a double-well potential and K = {Kij }\nis the interaction kernel with sufficient rate of decay to\n\n\f2\n0.5\n\nr = 1.5\nk = 0 (soft)\n\nσn\n\n0.4\nk = 0.5\n\nσ\n\nσp\nk = k∞ (hard)\n\n0.3\n\n0.2\n\n0\n\n-5\n\n10\n\n5\n\ne\nFIG. 1: Stress-strain curves for k = 0 (dotted line), k =\n0.5 (dashed line), and k = k∞ (continuous line) for r = 1.5\nin a system with L = 64; σp and σn are propagation and\nnucleation thresholds, respectively.\n\n1\n\n<σn>, Soft device\n<σp>, Hard device\n<σpd>, Interface [100]\n\n0.8\n\nStress\n\nensure convergence in the thermodynamic limit. In each\nwell (one defined for ei < 0 and the other for ei > 0) we\nuse the approximation fi (ei ) = 21 (ei − si )2 − h′i ei , where\nsi = ±1 is a spin variable and {h′i } are random numbers\nrepresenting quenched disorder. The system is loaded\nthrough an 'elastic'Pdevice with the energy φd = 2c (e−ē)2 ,\nwhere ē = (1/N ) i ei is the average strain of the system of snap-springs, c is the stiffness of the loading\ndevice and e is the control parameter (global 'strain').\nOne obtains a hard device in the limit c → ∞, and a\nsoft device in the limit c → 0, e → ∞ with the stress\nσ = ce fixed; the system will be driven quasi-statically\nby changing the control parameter e, if c is finite, and\nσ, if c = 0. We neglect thermal fluctuations (T = 0)\nand assume that the harmonic variables ei relax 'instantaneously' and can be adiabatically eliminated. By minimizing the\nenergy φ+φd with respect to ei we obtain\nPtotal\nN\nei = ẽ + j=1 (Jij − k/N ) sj + hi where J = (1 + K)−1\nis the effective interaction between the spin variables si .\nWe impose\nP periodic boundary conditions, meaning that\nk∞ = j Jij does not depend on i, and use the notations\n−1\n−1\nẽ = e[ck\nP ∞ (ck′∞ + 1) ], k = k∞ [ck∞ (1 + ck∞ ) ], and\nhi = j Jij hj .\nBecause of the absence of thermal fluctuations and to\nthe separation of time scales between overdamped relaxation and driving, the system remains on a metastable\nbranch {ei ({sk }; e)} corresponding to a particular local\nminimum of the total energy until the latter ceases to\nbe stable [17]. When the instability condition si ei < 0\nis reached for some i the system jumps (through an\navalanche) to another locally stable branch characterized by a different spin configuration {s′i }. We increase\ne by driving the system from an initial stable configuration with {si = −1} and assume that avalanches propagate (at constant e) with synchronous dynamics. For\nsimplicity, we consider only nearest-neighbor interactions\nwith Jii = J0 , Jij = J1 , and we set J0 = J1 = 1 so\nthat k∞ = 7. The renormalized disorder variables {hi }\nare drawn from a Gaussian distribution with zero mean\nand standard deviation r. Under these assumptions, the\nRSSM becomes formally equivalent to a nonlocal augmentation of the classical RFIM with demagnetizing factor k [1, 6, 7, 8, 18].\nAt k = 0 we expectedly observe an OD transition\nat ro ≃ 2.2 which separates a 'popping' (POP) regime\n(r > ro ) where all the avalanches are small from a 'snapping' (SNAP) regime (r < ro ) where an infinite avalanche\nsweeps most of the system\nP [1, 19]. The stress-strain curve\n−1\nσ(e) = k∞\n(ẽ − kN −1 i si ) is continuous in the POP\nregime and displays a macroscopic discontinuity of the\nstrain in the SNAP regime [see Fig. 1]. The strain discontinuity associated with the nucleation of the infinite\navalanche occurs at a 'nucleation' stress σn which decreases with r as indicated in Fig. 2.\nFor non-zero k, the POP regime remains essentially\nunaltered. In contrast, stiffness has a non-trivial effect\n\n0.6\n\n(ro,σo)\n\n0.4\n0.2\n0\n0\n\n0.5\n\n1\n\n1.5\n\nr\n\n2\n\n2.5\n\nFIG. 2: Dependence on disorder of the averaged nucleation\nand propagation thresholds: hσn i (squares), hσp i at k = k∞\n(circles), and hσpd i for an interface [100] (triangles). Insets:\ncross sections of the 3D system showing typical transformation domains for k = k∞ . Darker and lighter colors indicate transformed regions (s = +1) and untransformed regions\n(s = −1).\n\nover the SNAP regime observed at low disorders. In\nthis case, a compact domain reminiscent of the infinite\navalanche (as in the k = 0 case) nucleates at the stress\nσn . The stress relaxes during the avalanche growth to\nsatisfy the global driving constraint. When k is below\na certain threshold kp (r), the SNAP behavior remains\nqualitatively as in the k = 0 case because the nonlocal\nconstraint is still soft. In contrast, when k > kp (r), the\nfirst stress drop prevents the spanning avalanche from\ngrowing [Fig. 1]. The transformation induced by the subsequent increase of e proceeds through the intermittent\ngrowth of the previously nucleated domain with untransformed system acting as a disordered background. The\npropagation is accompanied by stress oscillations around\nthe propagation threshold σp which remains stable during the whole yielding process. The average of σp over\ndisorder coincides with the depinning stress σpd for a\nflat [100] interface artificially introduced and driven as\nin Refs. [20, 21]. This is a clear evidence that systems\nwith k > kp (r) reach a front-propagation regime which\nself-tunes exactly around the PD point. The surface mor-\n\n\f3\nr = 1.5\n\n4\n\n0.6\n1.5\n\nL\n\n0.5\n0\n\n100\n\n150\n\nρq\n\nk\n\n0.4\n\n100\n\n0\n\n-2\n\n10\n-4\n10\n\nD(S,k,r,L)\n\n10\n10\n10\n\ndoτ\n\n10\n\n2\n\nL\n\nD(S,k,r,L)\ndqτq\n\nL\n\nwL = 66\n10\n\n200\n\n10\n10\n\n10\n\n-3\n\n-2\n\n10\n\n10\n\n-dq\n\nSL\n\n300\n\nρo\n\n0\n\nρq\n\n(d)\nρq\n\n-1\n\n10\n\n0\n\nkL = 400\n\n8\n\n6\n\n4\n\n2\n\n1\n\nSNAP\n0\n\nkL\n\n(c)\n\n4′\n\n0.2\n\nwL\n4\n\nb\n\nPOP\n\n1\n\n0\n\n50\n\nQEW\n\nSNAPr\n\n2\n\n2\n0\n\n(b)\n\n0.8\n\n2.5\n\n−θo\n\n6\n\nNs(k,r,L)\n\nL = 24\nL = 32\nL = 48\nL = 64\nL = 100\n\nL\n\n−θq\n\n(a)\n\n8\n\n10\n\n(a)\n\nW\nQE\n\nNs(k,r,L)\n\n10\n\nr = ro\n3 (b)\n\nτ = τo\n\nτ = τq\n\n2\n0\n\n10\n\n-5\n\n10\n\n-4\n\n10\n\n-3\n\n-do\n\n10\n\n-2\n\n10\n\n-1\n\nSL\n\nFIG. 3: Scaling collapse of Ns (k, r, L) (a,b) and D(S; k, r, L)\n(c,d) according to the hypotheses in Table I. Different symbols correspond to different system sizes as indicated in the\nlegend. Data in plots to the left (right) correspond to r = 1.5\n(r = ro ). Data in (c) correspond to wLρs = 66 ; in (d) to\nkLρo = 400. The lower scaling collapse in (d) is obtained with\nexponent τq while the upper one corresponds to τo ; dashed\nlines indicate the power-laws expected in the thermodynamic\nlimit.\n\nphology of the growing domain is faceted at low disorders\n(r . 0.8 for systems with L = 100) and is self-affine\nat intermediate disorders. According to previous studies\n[21, 22], the faceted morphology is unstable giving rise\nto self-affine morphology in the thermodynamic limit for\nany finite r. Given the self-affine character of the boundary of the nucleated domain in the case of intermediate\ndisorders and the short-range character of the involved\ninteractions, one expects to observe critical scaling of the\nQEW (quenched Edwards-Wilkinson) universality class\n[3].\nWe check the validity of this assumption by analyzing the scaling properties of the number of spanning\navalanches Ns (k, r, L) and the distribution D(S; k, r, L)\nof avalanche sizes S. Following the arguments given in\nRefs. [19], we consider contributions to Ns of avalanches\nspanning along 1 or 2 dimensions only. Table I summarizes the action of the Renormalization Group (RG)\ntransformation on the parameters of the system and the\nresulting scaling hypotheses. The scaling variables measuring the distance to the OD critical point are u = r−ro\nand k. The distance to the QEW critical manifold is\nw = k − kp (r).\nScaling collapse for Ns (k, r, L) close to the line kp (r),\nshown in Fig. 3(a), confirms the validity of our scaling\nhypothesis. We have checked that QEW scaling persists\nover a finite interval of disorders r < ro . QEW scal-\n\n0.5\n\n1\n\n1.5\n\nr\n\nOD\n2 r 2.5\n\no\n\nb\n\nOD\n\n4\n\n3\nr\n\nPOP\n\nFIG. 4: (a) Schematic phase diagram for the RSSM (thermodynamic limit). Criticality of the OD type is associated with\nthe point r = ro , k = 0. Criticality of the QEW type is expected on the line kp (r) separating SNAP and POP regimes;\nsymbols display estimations of kp (r) from scaling collapses.\n(b) Schematic RG flow for the RSSM model. Separatrix 1\ngoing from the neighborhood of the OD fixed point towards\nthe QEW fixed point indicates the QEW critical manifold.\nThe RG-flow towards SNAP and POP regimes is indicated\nby arrows 2 and 3, respectively. Lines 4 and 4′ correspond to\nsystems which display SOC as an intermediate asymptotics\n(QEW exponents with supercritical or subcritical cutoffs for\nk < kp (r) and k > kp (r), respectively).\n\ning fails for disorders close to ro (above r ∼ 2 for our\nsystem sizes) due to crossover to the OD critical regime.\nFig. 3(b) displays the scaling collapse at u = 0 which generates the exponents ρo and θo given in Table I. The value\nof θo which, in contrast to θq is positive, agrees with previous estimates for the RFIM [19]. Fig. 3(c) presents the\nscaling collapse of D(S; k, r, L) for r = 1.5 corresponding\nto a particular section of the function D̃(SL−dq , wLρq )\nat constant wLρq . The resulting exponents dq and τq\nlisted in Table I do not depend on the selected section\nand are in agreement with previous estimates from frontpropagation models [4, 7, 21]. This confirms once again\nthat the propagation regime is of the QEW class; the\nanalysis of statistics of durations, omitted here, also supports this interpretation. The value of dq , giving the dimension of the avalanches in the propagation regime, is\nconsistent with d − 1, which confirms the self-affine morphology of the propagating domain boundary [21]. The\ndistribution D(S; k, r, L) at r = r0 scales with exponents\npreviously reported for the OD universality class when k\nis very small. The exponent τo displays a considerable\ncrossover to QEW when the stiffness becomes relatively\nlarge. For instance, Fig. 3(d) shows that the scaling of\nD(S; k, r, L) at kLρo = 400 is better with exponent τq\nthan with τo .\nIn Fig. 4(a) we present the phase diagram in the (r, k)\nplane showing stable SNAP and POP regimes separated\nby the QEW line w = 0. This line describes QEW behavior and it ends in a point corresponding to the OD\nregime. The variety of observed non-equilibrium steady\nstates can be explained if one assumes the existence of\nfour fixed points for the RG flow, schematically depicted\n\n\f4\nTABLE I: Scaling of the relevant quantities under a RG transformation with blocking parameter b and values of the associated\ncritical exponents (close to OD (subindex 'o') and to QEW (subindex 'q')).\nOD\nRG\nexponents\nSystem size, L L(b) = b−1 L\nStiffness, k\nk(b) = bρo k\nρo = 1.3 ± 0.3\nDisorder, r\nu(b) = b1/νo u\nνo = 1.2 ± 0.1 ([19])\nSize, S\nS(b) = b−do S\ndo = 2.78 ± 0.05 ([19])\nNs (k, r, L)\nNs (b) = b−θo Ns\nθo = 0.10 ± 0.02 ([19])\nD(S; k, r, L)\nD(b) = bτo do D\nτo = 1.6 ± 0.06 ([1])\nNs (k, r, L)\nLθo N̂s (kLρo , ku−ρo νo )\nD(S; k, r, L)\nL−do τo D̂(SL−do , kLρo , ku−ρo νo )\n\nin Fig. 4(b). The OD regime is associated with a fully repulsive critical point which can be reached only by tuning\nall four parameters: σ = σc , r = ro , k = 0, and L−1 = 0.\nIn contrast, QEW is a saddle point with a stable manifold which governs the large scale behavior of the systems\nwith r < ro , σ = σpd (r), k = kp (r), and L−1 = 0. As we\nhave seen the condition σ = σpd (r) is reached automatically during the self-organized propagation regime with\nk ≥ kp (r); the corresponding systems lay on the critical manifold connecting OD and QEW points. The large\nscale behavior for systems located away from the critical manifold is governed either by SNAP (arrow 2) or by\nPOP (arrow 3) fixed points which are trivial attractors\nin the RG sense. While the self-organized propagation\nregime is strictly critical only for k = kp (r), our numerical simulations show that the system exhibits truncated\npower law scaling with QEW exponents in a broad range\nof parameters around the line kp (r) (arrows 4 and 4′ in\nFig. 4(b)). This observation suggests that SOC can be\nviewed as an intermediate asymptotics. In general, since\nin real systems stiffness is finite and disorder is generic,\nwe anticipate the power law structure of critical fluctuations to be in most cases of the PD rather than of the\nOD type.\nWe acknowledge helpful discussions with M.L. Rosinberg, S. Roux, and G. Tarjus and partial funding from\nEU contract MRTN-CT-2004-505226.\n\n∗\n\n[1]\n\n[2]\n\n[3]\n\n[4]\n\nElectronic address: fjp23@cam.ac.uk\nJ. P. Sethna, K. A. Dahmen, and C. R. Myers, Nature\n(London) 410, 242 (2001); J. P. Sethna, K. A. Dahmen,\nand O. Perković, in The science of hysteresis II, edited\nby G. Bertotti and I. D. Mayergoyz (Academic Press,\nAmsterdam, 2006).\nM. Kardar, Phys. Rep. 301, 85 (1998); D. S. Fisher,\nPhys. Rep. 301, 113 (1998); M. Zaiser, Adv. Phys. 55,\n185 (2006); M. J. Alava, P. Nukala, and S. Zapperi, Adv.\nPhys. 55, 349 (2006).\nO. Narayan and D. S. Fisher, Phys. Rev. B 48, 7030\n(1993); P. Chauve, P. Le Doussal, and K. J. Wiesse, Phys.\nRev. Lett. 86, 1785 (2001).\nG. Durin and S. Zapperi, in The science of hysteresis,\n\n[5]\n[6]\n[7]\n[8]\n[9]\n[10]\n[11]\n[12]\n[13]\n\n[14]\n\n[15]\n[16]\n\n[17]\n[18]\n[19]\n[20]\n[21]\n[22]\n\n[23]\n\n[24]\n\nQEW\nRG\nexponents\nL(b) = b−1 L\nw(b) = bρq w\nρq = 0.8 ± 0.2\nIrrelevant\nS(b) = b−dq S\ndq = 2.0 ± 0.1\nNs (b) = b−θq Ns\nθq = −0.2 ± 0.06\nD(b) = bτq dq D\nτq = 1.3 ± 0.06\nLθq Ñs (wLρq )\nL−dq τq D̃(SL−dq , wLρq )\n\nII, edited by G. Bertotti and I. D. Mayergoyz (Academic\nPress, Amsterdam, 2006).\nK. A. Dahmen and Y. Ben-Zion, in Encyclopedia of Complexity and Systems Science (Springer, 2008).\nJ. S. Urbach, R. C. Madison, and J. T. Market, Phys.\nRev. Lett. 75, 276 (1995).\nM. C. Kuntz and J. P. Sethna, Phys. Rev. B 62, 11699\n(2000).\nJ. H. Carpenter et al., Phys. Rev. B 72, 052410 (2005).\nB. Alessandro et al., J. Appl. Phys. 68, 2901 (1990).\nP. Cizeau et al., Phys. Rev. Lett. 79, 4669 (1997).\nR. Dickman et al., Braz. J. Phys. 30, 27 (2000).\nM. Paczuski and S. Boettcher, Phys. Rev. Lett. 77, 111\n(1996); G. Pruessner, Phys. Rev. E 67, 030301R (2003).\nG. Puglisi and L. Truskinovsky, J. Mech. Phys. Solids\n48, 1 (2000); E. Bonnot et al., Phys. Rev. B 76, 064105\n(2007).\nG. Bertotti, Hysteresis in magnetism (Academic Press,\nSan Diego, 1998); X. Illa, M.L. Rosinberg, and E. Vives,\nPhys. Rev. B 74, 224403 (2006); X. Illa et al., Phys. Rev.\nB 74, 224404 (2006).\nD. J. Bergman and B. I. Halperin, Phys. Rev. B 13, 2145\n(1976); K. A. Dahmen and J. P. Sethna, Phys. Rev. B\n53, 14872 (1996).\nI. Müller and P. Villaggio, Arch. Rat. Mech. Anal. 65, 25\n(1977); B. Fedelich and G. Zanzotto, J. Nonlinear Sci. 2,\n319 (1992).\nL. Truskinovsky and A. Vainchtein, J. Mech. Phys. Solids\n52, 1421 (2004); G. Puglisi and L. Truskinovsky, J. Mech.\nPhys. Solids 53, 655 (2005).\nS. Queiroz, Phys. Rev. E 77, 021131 (2008).\nF. J. Pérez-Reche and E. Vives, Phys. Rev. B 67, 134421\n(2003), ibid. 70, 214422 (2004).\nL. Roters et al., Phys. Rev. E 60, 5202 (1999).\nH. Ji and M. O. Robbins, Phys. Rev. B 46, 14519 (1992);\nB. Koiller and M. O. Robbins, Phys. Rev. B 62, 5771\n(2000).\nJ. Bouchaud and A. Georges, Phys. Rev. Lett. 68, 3908\n(1992); T. Emig and T. Nattermann, Eur. Phys. J. B 8,\n525 (1999).\nP. Bak, C. Tang, and K. Wiesenfeld, Phys. Rev. Lett. 59,\n381 (1987); K. Chen, P. Bak, and S. Obukhov, Phys.\nRev. A 43, 625 (1991); F. J. Pérez-Reche, L. Truskinovsky, and G. Zanzotto, Phys. Rev. Lett. 99, 075501\n(2007).\nWe exclude here similar critical phenomena which do not\nrequire quenched disorder, e.g. [23].\n\n\f"}