{"id": "http://arxiv.org/abs/0710.1211v1", "guidislink": true, "updated": "2007-10-05T16:09:25Z", "updated_parsed": [2007, 10, 5, 16, 9, 25, 4, 278, 0], "published": "2007-10-05T16:09:25Z", "published_parsed": [2007, 10, 5, 16, 9, 25, 4, 278, 0], "title": "D0-D0 Mixing at BaBar", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0710.1109%2C0710.3466%2C0710.4029%2C0710.4653%2C0710.3931%2C0710.2249%2C0710.1137%2C0710.0228%2C0710.5411%2C0710.2867%2C0710.3117%2C0710.5688%2C0710.2539%2C0710.3730%2C0710.3526%2C0710.5848%2C0710.3125%2C0710.1810%2C0710.1725%2C0710.3026%2C0710.2216%2C0710.5471%2C0710.5370%2C0710.0231%2C0710.1593%2C0710.4080%2C0710.3620%2C0710.1228%2C0710.0317%2C0710.5192%2C0710.2673%2C0710.5530%2C0710.4161%2C0710.4304%2C0710.0457%2C0710.1044%2C0710.4743%2C0710.3420%2C0710.2095%2C0710.3234%2C0710.3919%2C0710.3632%2C0710.5587%2C0710.5517%2C0710.1211%2C0710.1029%2C0710.1177%2C0710.2122%2C0710.3590%2C0710.2788%2C0710.4092%2C0710.0759%2C0710.3715%2C0710.2048%2C0710.5597%2C0710.1165%2C0710.0430%2C0710.3081%2C0710.1871%2C0710.2208%2C0710.5409%2C0710.1953%2C0710.2029%2C0710.5713%2C0710.4232%2C0710.5910%2C0710.0152%2C0710.5229%2C0710.2114%2C0710.2628%2C0710.5681%2C0710.3714%2C0710.1360%2C0710.5164%2C0710.2371%2C0710.0439%2C0710.1988%2C0710.5210%2C0710.5442%2C0710.3028%2C0710.5781%2C0710.5044%2C0710.1916%2C0710.4704%2C0710.5811%2C0710.4169%2C0710.0762%2C0710.4463%2C0710.2442%2C0710.2374%2C0710.5320%2C0710.0446%2C0710.5939%2C0710.2380%2C0710.4228%2C0710.2974%2C0710.0367%2C0710.4236%2C0710.1528%2C0710.0686%2C0710.2800&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "D0-D0 Mixing at BaBar"}, "summary": "The BaBar and Belle collaborations have recently found evidence for mixing\nwithin the D meson system. We present some of the mixing search techniques used\nby BaBar and their status as of the beginning of the summer 2007. These have\nculminated in a measurement in the K decay final state of the D that is\ninconsistent with the no-mixing hypothesis with a significance of 3.9 standard\ndeviations.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0710.1109%2C0710.3466%2C0710.4029%2C0710.4653%2C0710.3931%2C0710.2249%2C0710.1137%2C0710.0228%2C0710.5411%2C0710.2867%2C0710.3117%2C0710.5688%2C0710.2539%2C0710.3730%2C0710.3526%2C0710.5848%2C0710.3125%2C0710.1810%2C0710.1725%2C0710.3026%2C0710.2216%2C0710.5471%2C0710.5370%2C0710.0231%2C0710.1593%2C0710.4080%2C0710.3620%2C0710.1228%2C0710.0317%2C0710.5192%2C0710.2673%2C0710.5530%2C0710.4161%2C0710.4304%2C0710.0457%2C0710.1044%2C0710.4743%2C0710.3420%2C0710.2095%2C0710.3234%2C0710.3919%2C0710.3632%2C0710.5587%2C0710.5517%2C0710.1211%2C0710.1029%2C0710.1177%2C0710.2122%2C0710.3590%2C0710.2788%2C0710.4092%2C0710.0759%2C0710.3715%2C0710.2048%2C0710.5597%2C0710.1165%2C0710.0430%2C0710.3081%2C0710.1871%2C0710.2208%2C0710.5409%2C0710.1953%2C0710.2029%2C0710.5713%2C0710.4232%2C0710.5910%2C0710.0152%2C0710.5229%2C0710.2114%2C0710.2628%2C0710.5681%2C0710.3714%2C0710.1360%2C0710.5164%2C0710.2371%2C0710.0439%2C0710.1988%2C0710.5210%2C0710.5442%2C0710.3028%2C0710.5781%2C0710.5044%2C0710.1916%2C0710.4704%2C0710.5811%2C0710.4169%2C0710.0762%2C0710.4463%2C0710.2442%2C0710.2374%2C0710.5320%2C0710.0446%2C0710.5939%2C0710.2380%2C0710.4228%2C0710.2974%2C0710.0367%2C0710.4236%2C0710.1528%2C0710.0686%2C0710.2800&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "The BaBar and Belle collaborations have recently found evidence for mixing\nwithin the D meson system. We present some of the mixing search techniques used\nby BaBar and their status as of the beginning of the summer 2007. These have\nculminated in a measurement in the K decay final state of the D that is\ninconsistent with the no-mixing hypothesis with a significance of 3.9 standard\ndeviations."}, "authors": ["A. Seiden"], "author_detail": {"name": "A. Seiden"}, "author": "A. Seiden", "arxiv_comment": "To be published in the proceedings of CHARM07, Ithaca, NY, August\n  2007, eConf C070805", "links": [{"href": "http://arxiv.org/abs/0710.1211v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0710.1211v1", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "hep-ex", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "hep-ex", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0710.1211v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0710.1211v1", "journal_reference": "ECONF C070805:06,2007", "doi": null, "fulltext": "1\n\nProceedings of the CHARM 2007 Workshop, Ithaca, NY, August 5-8, 2007\n\nD 0 –D 0 Mixing at BABAR\nA. Seiden\nSanta Cruz Institute for Particle Physics, University of California, Santa Cruz, CA, USA\nRepresenting the BABAR Collaboration\n\narXiv:0710.1211v1 [hep-ex] 5 Oct 2007\n\nThe BABAR and Belle collaborations have recently found evidence for mixing within the D meson system. We\npresent some of the mixing search techniques used by BABAR and their status as of the beginning of the summer\n2007. These have culminated in a measurement in the Kπ decay final state of the D that is inconsistent with\nthe no-mixing hypothesis with a significance of 3.9 standard deviations.\n\n1. Introduction\nMixing among the lightest neutral mesons of each\nflavor has traditionally provided important information on the electroweak interactions, the CKM matrix,\nand the possible virtual constituents that can lead to\nmixing. Among the long-lived mesons, the D meson\nsystem exhibits the smallest mixing phenomena. The\nB-factories have now accumulated sufficient luminosity to observe mixing in the D system and we can\nexpect to see more detailed results as more luminosity is accumulated and additional channels sensitive to\nmixing are analyzed. The B-factories produce about\n1.3 million Charm events per fb−1 of integrated luminosity accumulated. The BABAR integrated luminosity of about 384 fb−1 used for the evidence for mixing\nresult we will present corresponds to about 500 million charm events produced. The present BABAR integrated luminosity is approximately 500 fb−1 . BABAR\nis a high acceptance general-purpose detector providing excellent tracking, vertexing, particle ID, and neutrals detection. All of these capabilities are crucial for\nmaking the difficult mixing measurement.\n\n2. Mixing Measureables for the D\nSystem\nThe propagation eigenstates, including the electroweak interactions for the D mesons are given by:\n|D1,2 i = p D0 ± q D 0 ,\n\n|p|2 + |q|2 = 1.\n\n(1)\n\nPropagation parameters that determine the timeevolution for the two states are given by:\nΓ = 21 (Γ1 +Γ2 ),\n\n∆M = M1 −M2 ,\n\n∆Γ = (Γ1 −Γ2 );\n(2)\nwith the observable oscillations determined by the\nscaled parameters\nx=\n\n∆M\n,\nΓ\n\ny=\n\n∆Γ\n.\n2Γ\n\n(3)\n\nIn the case of CP conservation the two D eigenstates are the CP even and odd combinations. We\n\nwill choose D1 to be the CP even state. The sign\nchoice for the mass and width difference varies among\npapers, we use the choice above.\nAssuming CP conservation, small mixing parameters, and an initial state tagged as a D0 , we can write\nthe time dependence to first order in x and y:\n\u0012\n\u0013\nΓ\n0\n0\nD(t) = D + D (−y − ix) t e−(Γ/2+im)t . (4)\n2\nProjecting this onto a final state f gives to first order\nthe amplitude for finding f :\n\u0012\n\u0013\nΓ\nAf + Āf (−y − ix) t e−(Γ/2+im)t .\n(5)\n2\nThis leads to a number of ways to measure the effect\nof mixing, for example:\n(1) Wrong sign semileptonic decays. Here Af is zero\nand we measure directly the quantity, after integrating\nover decay times:\nRM = (x2 + y 2 )/2.\n\n(6)\n\nLimits using this measurement, however, are not\nyet sensitive enough to get down to the 10−4 level for\nRM . Using 334 fb−1 of data, electron decays only,\nand a double tag technique, BABAR measures RM =\n0.4×10−4, with a 68% confidence interval (−5.6, 7.4)×\n10−4 [1].\n(2) Cabibbo favored, right sign (RS) hadronic decays (for example K − π + ). These are used to measure\nthe average lifetime, with the correction from the term\ninvolving x and y usually ignored (provides a correction of O(10−3 )).\n(3) Singly suppressed decays (for example K + K −\nor π + π − ). In this case tagging the initial state isn't\nnecessary. For CP even final states: Af = Āf . This\nprovides the most direct way to measure y. With tagging we can also check for CP violation, by looking at\nthe value of y for each tag type. BABAR will be updating this measurement with the full statistics later this\nyear. The initial BABAR measurement was based on\n91 fb−1 and gave the result y = 0.8%, with statistical\nand systematic errors each about 0.4% [2], measurement [3].\n\n\f2\n\nProceedings of the CHARM 2007 Workshop, Ithaca, NY, August 5-8, 2007\n4) Doubly suppressed and mixed, wrong sign (WS)\ndecays (for example K + π − . Mixing leads to an exponential term multiplied by both a linear and a\nquadratic term in t. The quadratic term has a universal form depending on RM . For any point in the\ndecay phase space the decay rate is given by\n\u0013\n\u0012\n(Γt)2\n2\n′\n2\ne−Γt .\n|Af | + |Af | |Āf | y Γt + |Āf | RM\n2\n(7)\nHere y ′ = y cos δ − x sin δ, where δ is a strong phase\ndifference between the Cabibbo favored and doubly\nsuppressed amplitudes. For the K + π − decay there is\njust the one phase and the ratio of |Af |2 to |Āf |2 is\ndefined to be RD . For multibody decays the strong\nphase varies over the phase space and the term proportional to t will involve a sum with different phases\nif we add all events in a given channel.\nBABAR has analyzed the decay channel K + π − π 0 ,\nwith a mass cut that selects mostly K + ρ− decays,\nthe largest channel for the Cabibbo allowed amplitude arising from mixing. Based on 230 fb−1 , BABAR\nmeasures [4]\nαy ′ = (−1.2+0.6\n−0.8 ± 0.2)%\nRM = (0.023+0.18\n−0.13 ± 0.004)%.\n\n(8)\n\nThe parameter α allows for the phase variation over\nthe region summed over. A fit to the full Dalitz plot\nwould allow more events to be used in the mixing\nstudy. This, however, requires a model for all the\nresonant and smooth components that contribute to\nthe given channel, which may introduce uncertainties.\nBABAR is working on such a fit, which will be based\non approximately 1500 signal events.\nAnother important 3-body channel is the Ks π + π −\ndecay channel. Analysis of this channel was pioneered\nby CLEO [5]. It contains: CP-even, CP-odd, and\nmixed-CP resonances. Now one must correctly model\nthe relative amounts of CP-odd and CP-even contributions (including smooth components) to get the correct lifetime difference. This channel also provides the\npossibility to directly measure x. BABAR is working on\nthis channel; Belle has published their results [6].\nIn the Standard Model y and x are mainly due\nto long-distance effects. They may be comparable in\nvalue but this depends on physics that is difficult to\nmodel. Long-distance effects control how complete the\nSU(3) cancellation is, which would make both parameters vanish in the symmetry limit. The exact values\ntherefore depends on SU(3) violations in matrix elements and phase space. Also, the sign of x/y provides\nan important measurement. One might expect the x\nand y parameters to be in the range O(10−3 to 10−2 ).\nThus the present data are consistent with the Standard Model. Searches for CP violation are important\ngoals of the B-factories, since observation at a nonnegligible level would signify new physics.\n\nWe will turn now to the strongest evidence for Dmixing from BABAR, using the Kπ final state. This\nresult has recently been published [7].\n\n3. Analysis of the Kπ channel\nWe study the right-sign (RS), Cabibbo-favored\n(CF) decay D0 → K − π + [8] and the wrong-sign\n(WS) decay D0 → K + π − . The latter can be produced via the doubly Cabibbo-suppressed (DCS) decay D0 → K + π − or via mixing followed by a CF decay\nD0 → D0 → K + π − . The DCS decay has a small rate\nRD of order tan4 θC ≈ 0.3% relative to the CF decay\nwith θC the Cabibbo angle. We tag the D0 at production using the decay D∗+ → πs+ D0 where the πs+\nis referred to as the \"slow pion\". In RS decays the πs+\nand kaon have opposite charges, while in WS decays\nthe charges are the same. The time dependence of the\nWS decay rate is used to separate the contributions\nof DCS decays from D0 -D 0 mixing.\nWe study both CP -conserving and CP -violating\ncases. For the CP -conserving case, we fit for the pa2\nrameters RD , x′ , and y ′ . To search for CP violation,\nwe apply Eq. (7) to the D0 and D0 samples separately,\n±\nfitting for the parameters {RD\n, x′ 2± , y ′± } for D0 (+)\ndecays and D0 (−) decays.\nWe select D0 candidates by pairing oppositelycharged tracks with a K ∓ π ± invariant mass mKπ between 1.81 and 1.92 GeV/c2 . We require the πs+ to\nhave a momentum in the laboratory frame greater\nthan 0.1 GeV/c and in the e+ e− center-of-mass (CM)\nframe below 0.45 GeV/c.\nTo obtain the proper decay time t and its error σt\nfor each D0 candidate, we refit the K ∓ and π ± tracks,\nconstraining them to originate from a common vertex.\nWe also require the D0 and πs+ to originate from a\ncommon vertex, constrained by the position and size\nof the e+ e− interaction region. The vertical RMS\nsize of each beam is typically 6 μm. We require the\nχ2 probability of the vertex-constrained combined fit\nP (χ2 ) to be at least 0.1%, and the mKππs −mKπ mass\ndifference ∆m to satisfy 0.14 < ∆m < 0.16 GeV/c2 .\nTo remove D0 candidates from B-meson decays and\nto reduce combinatorial backgrounds, we require each\nD0 to have a momentum in the CM frame greater\nthan 2.5 GeV/c. We require −2 < t < 4 ps and\nσt < 0.5 ps (the most probable value of σt for signal\nevents is 0.16 ps). For D∗+ candidates sharing one or\nmore tracks with other D∗+ candidates, we retain only\nthe candidate with the highest P (χ2 ). After applying\nall criteria, we keep approximately 1,229,000 RS and\n64,000 WS D0 and D0 candidates.\nThe mixing parameters are determined in an unbinned, extended maximum-likelihood fit to the RS\nand WS data samples over the four observables mKπ ,\n∆m, t, and σt . The fit is performed in several stages.\n\n\fProceedings of the CHARM 2007 Workshop, Ithaca, NY, August 5-8, 2007\n\n800 a)\n600\n400\n200\n0\n1.81\n\n1500 b)\n\nData\nWS Signal\n\n1000\n\nMisrecon. D0\n\nEvents/0.2 MeV/c2\n\nEvents/2 MeV/c2\n\nFirst, RS and WS signal and background shape parameters are determined from a fit to mKπ and ∆m,\nand are not varied in subsequent fits. Next, the D0\nproper-time resolution function and lifetime are determined in a fit to the RS data using mKπ and ∆m to\nseparate the signal and background components. We\nfit to the WS data sample using three different models. The first model assumes both CP conservation\nand the absence of mixing. The second model allows\nfor mixing, but assumes no CP violation. The third\nmodel allows for both mixing and CP violation.\nThe RS and WS {mKπ , ∆m} distributions are described by four components: signal, random πs+ , misreconstructed D0 and combinatorial background. The\nsignal component has a characteristic peak in both\nmKπ and ∆m. The random πs+ component models reconstructed D0 decays combined with a random slow\npion and has the same shape in mKπ as signal events,\nbut does not peak in ∆m. Misreconstructed D0 events\nhave one or more of the D0 decay products either not\nreconstructed or reconstructed with the wrong particle hypothesis. They peak in ∆m, but not in mKπ .\nFor RS events, most of these are semileptonic D0 decays. For WS events, the main contribution is RS\nD0 → K − π + decays where the K − and the π + are\nmisidentified as π − and K + , respectively. Combinatorial background events are those not described by the\nabove components; they do not exhibit any peaking\nstructure in mKπ or ∆m.\nThe functional forms of the probability density\nfunctions (PDFs) for the signal and background components are chosen based on studies of Monte Carlo\n(MC) samples. However, all parameters are determined from two-dimensional likelihood fits to data\nover the full mKπ and ∆m region.\nWe fit the RS and WS data samples simultaneously with shape parameters describing the signal and\nrandom πs+ components shared between the two data\nsamples. We find 1, 141, 500 ± 1, 200 RS signal events\nand 4, 030 ± 90 WS signal events. The dominant\nbackground component is the random πs+ background.\nProjections of the WS data and fit are shown in Fig. 1.\n\n1.865\n1.92\nmKπ (GeV/c2)\n\nRandom πs\nCombinatorial\n\n500\n0\n0.14\n\n0.15\n∆m (GeV/c2)\n\n0.16\n\nFigure 1: a) mKπ for wrong-sign (WS) candidates with\n0.1445 < ∆m < 0.1465 GeV/c2 , and b) ∆m for WS candidates with 1.843 < mKπ < 1.883 GeV/c2 . The fitted PDFs\nare overlaid.\n\nThe measured proper-time distribution for the RS\nsignal is described by an exponential function convolved with a resolution function whose parameters\nare determined by the fit to the data. The resolution\nfunction is the sum of three Gaussians with widths\nproportional to the estimated event-by-event propertime uncertainty σt . The random πs+ background is\ndescribed by the same proper-time distribution as signal events, since the slow pion has little weight in the\nvertex fit. The proper-time distribution of the combinatorial background is described by a sum of two\nGaussians, one of which has a power-law tail to account for a small long-lived component. The combinatorial background and real D0 decays have different σt distributions, as determined from data using a\nbackground-subtraction technique based on the fit to\nmKπ and ∆m.\nThe fit to the RS proper-time distribution is performed over all events in the full mKπ and ∆m region. The PDFs for signal and background in mKπ\nand ∆m are used in the proper-time fit with all parameters fixed to their previously determined values.\nThe fitted D0 lifetime is found to be consistent with\nthe world-average lifetime [9].\nThe measured proper-time distribution for the WS\nsignal is modeled by Eq. (7) convolved with the resolution function determined in the RS proper-time\nfit. The random πs+ and misreconstructed D0 backgrounds are described by the RS signal proper-time\ndistribution since they are real D0 decays. The\nproper-time distribution for WS data is shown in\nFig. 2. The fit results with and without mixing are\nshown as the overlaid curves.\nThe fit with mixing provides a substantially better description of the data than the fit with no mixing. The significance of the mixing signal is evaluated\nbased on the change in negative log likelihood with\nrespect to the minimum. Figure 3 shows confidencelevel (CL) contours calculated from the change in log\nlikelihood (−2∆ ln L) in two dimensions (x′ 2 and y ′ )\nwith systematic uncertainties included. The likeli2\nhood maximum is at the unphysical value of x′ =\n−4\n′\n−3\n−2.2 × 10\nand y = 9.7 × 10 . The value of\n−2∆ ln L at the most likely point in the physically allowed region (x′ 2 = 0 and y ′ = 6.4×10−3) is 0.7 units.\nThe value of −2∆ ln L for no-mixing is 23.9 units. Including the systematic uncertainties, this corresponds\nto a significance equivalent to 3.9 standard deviations\n(1 − CL = 1 × 10−4) and thus constitutes evidence for\nmixing. The fitted values of the mixing parameters\nand RD are listed in Table I. The correlation coeffi2\ncient between the x′ and y ′ parameters is −0.94.\nAllowing for the possibility q\nof CP violation, we\ncalculate the values of RD =\n\n+ −\nRD\nRD and AD =\n\n+\n−\n+\n−\n(RD\n− RD\n)/(RD\n+ RD\n) listed in Table I, from the fit2±\n±\nted RD values. The best fit points (x′ , y ′± ) shown in\nTable I are more than three standard deviations away\n\n3\n\n\f4\n\nProceedings of the CHARM 2007 Workshop, Ithaca, NY, August 5-8, 2007\n\nData\n\n1600\n\na)\n\nTable I Results from the different fits. The first uncertainty listed is statistical and the second systematic.\nFit type\nParameter Fit Results (/10−3 )\nNo CP viol. or mixing\nRD\n3.53 ±0.08 ± 0.04\nRD\n3.03 ±0.16 ± 0.10\nNo CP\n2\nx′\n−0.22 ±0.30 ± 0.21\nviolation\ny′\n9.7 ± 4.4 ± 3.1\nRD\n3.03 ±0.16 ± 0.10\nAD\n−21 ± 52 ± 15\nCP\n2+\nviolation\nx′\n−0.24 ±0.43 ± 0.30\nallowed\ny ′+\n9.8 ± 6.4 ± 4.5\n2−\nx′\n−0.20 ±0.41 ± 0.29\ny ′−\n9.6 ± 6.1 ± 4.3\n\nMixing fit\nRandom πs\n\n1200\n\n0\n\nMisrecon. D\nCombinatorial\n\n1000\n\nNo mixing fit\n\n800\n600\n400\n200\n\nb)\n\nResiduals\n\n50\n0\n-50\n\n-2\n\n-1\n\n0\n\n1\nt (ps)\n\n2\n\n3\n\n4\n\nFigure 2: a) Projections of the proper-time distribution of\ncombined D0 and D0 WS candidates and fit result integrated over the signal region 1.843 < mKπ < 1.883 GeV/c2\nand 0.1445 < ∆m < 0.1465 GeV/c2 . The result of the fit\nallowing (not allowing) mixing but not CP violation is\noverlaid as a solid (dashed) curve. b) The points represent the difference between the data and the no-mixing\nfit. The solid curve shows the difference between fits with\nand without mixing.\n30\n\nproximately equal numbers of RS candidates. The\nfitted WS branching fractions are shown in Fig. 4 and\nare seen to increase with time. The slope is consistent\nwith the measured mixing parameters and inconsistent with the no-mixing hypothesis.\n0.45\n\n0.4\nRWS (%)\n\nEvents/0.2 ps\n\n1400\n\n0.35\n\ny′ / 10-3\n\n20\n0.3\n-2\n\n10\n\n-1\n\n0\nt (ps)\n\n1\n\n2\n\n0\n\n-10\n-20\n\n-1.0\n\n-0.5\n\n0.0\nx′2 / 10-3\n\n0.5\n\n1.0\n\nFigure 3: The central value (point) and confidence-level\n(CL) contours for 1 − CL = 0.317 (1σ), 4.55 × 10−2 (2σ),\n2.70 × 10−3 (3σ), 6.33 × 10−5 (4σ) and 5.73 × 10−7 (5σ),\ncalculated from the change in the value of −2 ln L compared with its value at the minimum. Systematic uncertainties are included. The no-mixing point is shown as a\nplus sign (+).\n\nfrom the no-mixing hypothesis. The shapes of the\n2±\n(x′ , y ′± ) CL contours are similar to those shown in\nFig. 3. All cross checks indicate that the close agreement between the separate D0 and D0 fit results is\ncoincidental.\nAs a cross-check of the mixing signal, we perform\nindependent {mKπ , ∆m} fits with no shared parameters for intervals in proper time selected to have ap-\n\nFigure 4: The WS branching fractions from independent {mKπ , ∆m} fits to slices in measured proper time\n(points). The dashed line shows the expected wrong-sign\nrate as determined from the mixing fit shown in Fig. 2.\nThe χ2 with respect to expectation from the mixing fit is\n1.5; for the no-mixing hypothesis (a constant WS rate),\nthe χ2 is 24.0.\n\nWe validated the fitting procedure on simulated\ndata samples using both MC samples with the full\ndetector simulation and large parametrized MC samples. In all cases we found the fit to be unbiased. As\na further cross-check, we performed a fit to the RS\ndata proper-time distribution allowing for mixing in\nthe signal component; the fitted values of the mixing\nparameters are consistent with no mixing.\nIn evaluating systematic uncertainties in RD and\nthe mixing parameters we considered variations in the\nfit model and in the selection criteria. We also considered alternative forms of the mKπ , ∆m, proper time,\nand σt PDFs. We varied the t and σt requirements. In\naddition, we considered variations that keep or reject\nall D∗+ candidates sharing tracks with other candidates.\n\n\fProceedings of the CHARM 2007 Workshop, Ithaca, NY, August 5-8, 2007\nFor each source of\u0002systematic error, we compute\n\u0003 the\n2\n2\nsignificance s2i = 2t ln L(x′ , y ′ ) − ln L(x′ i , yi′ ) /2.3,\nwhere (x′ 2 , y ′ ) are the parameters obtained from the\n2\nstandard fit, (x′ i , yi′ ) the parameters from the fit inth\ncluding the i systematic variation, and L the likelihood of the standard fit. The factor 2.3 is the 68%\nconfidence level for 2 degrees of freedom. To estimate\n2\nthe significance of our results in (x′ , y ′ ), we reduce\n−2∆ ln L by a factor of 1 + Σs2i = 1.3 to account for\nsystematic errors. The largest contribution to this factor, 0.06, is due to uncertainty in modeling the long\ndecay time component from other D decays in the signal region. The second largest component, 0.05, is due\nto the presence of a non-zero mean in the proper time\nsignal resolution PDF. The mean value is determined\nin the RS proper time fit to be 3.6 fs and is due to small\nmisalignments in the detector. The error of 15 × 10−3\non AD is primarily due to uncertainties in modeling\nthe differences between K + and K − absorption in the\ndetector.\nIn conclusion we summarize the BABAR evidence\nfor D0 -D 0 mixing. Our result is inconsistent with\nthe no-mixing hypothesis at a significance of 3.9 standard deviations. We measure y ′ = [9.7 ± 4.4 (stat.) ±\n2\n3.1 (syst.)] × 10−3 , while x′ is consistent with zero.\n\nWe find no evidence for CP violation and measure RD\nto be [0.303 ± 0.016 (stat.) ± 0.010 (syst.)]%. The result is consistent with Standard Model estimates for\nmixing.\n\nReferences\n[1] B. Aubert et al. (BABAR Collaboration), SLACPUB-12494.\n[2] B. Aubert et al. (BABAR Collaboration), Phys.\nRev. Lett. 91, 121806 (2003).\n[3] M. Staric, et al., Phys. Rev. Lett. 98, 211803\n(2007).\n[4] B. Aubert et al. (BABAR Collaboration), Phys.\nRev. Lett. 97, 221803 (2006).\n[5] D.M. Asner et al. Phys. Rev. D72, 012001 (2005).\n[6] L.M. Zhang, arXiv 0704, 1000v2 [hep-ex], submitted to Phys. Rev. Lett.\n[7] B. Aubert et al. (BABAR Collaboration), Phys.\nRev. Lett. 98, 211802 (2007).\n[8] The use of charge-conjugate modes is implied unless otherwise noted.\n[9] W.-M. Yao et al. (Particle Data Group), J. Phys.\nG33 1 (2006).\n\n5\n\n\f"}