{"id": "http://arxiv.org/abs/1101.4485v1", "guidislink": true, "updated": "2011-01-24T10:22:27Z", "updated_parsed": [2011, 1, 24, 10, 22, 27, 0, 24, 0], "published": "2011-01-24T10:22:27Z", "published_parsed": [2011, 1, 24, 10, 22, 27, 0, 24, 0], "title": "Non-proportional response between 0.1-100keV energy by means of highly\n  monochromatic synchrotron X-rays", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1101.5086%2C1101.5681%2C1101.3720%2C1101.0926%2C1101.3718%2C1101.1789%2C1101.5411%2C1101.3145%2C1101.1712%2C1101.4120%2C1101.1405%2C1101.4159%2C1101.5444%2C1101.4759%2C1101.2557%2C1101.1259%2C1101.0919%2C1101.5474%2C1101.4755%2C1101.3886%2C1101.1192%2C1101.3256%2C1101.3092%2C1101.2335%2C1101.2568%2C1101.4577%2C1101.5510%2C1101.0479%2C1101.5965%2C1101.1183%2C1101.0198%2C1101.0364%2C1101.2771%2C1101.0216%2C1101.5076%2C1101.0876%2C1101.4077%2C1101.0417%2C1101.5687%2C1101.1844%2C1101.1671%2C1101.3122%2C1101.4375%2C1101.1918%2C1101.2883%2C1101.4462%2C1101.3677%2C1101.4694%2C1101.5434%2C1101.0222%2C1101.3917%2C1101.3551%2C1101.3127%2C1101.4455%2C1101.5897%2C1101.4690%2C1101.1338%2C1101.0752%2C1101.2580%2C1101.0226%2C1101.2935%2C1101.3440%2C1101.5069%2C1101.4074%2C1101.4493%2C1101.2375%2C1101.1214%2C1101.4520%2C1101.2307%2C1101.3069%2C1101.2713%2C1101.2795%2C1101.0837%2C1101.5311%2C1101.5108%2C1101.4874%2C1101.0539%2C1101.1330%2C1101.1983%2C1101.1978%2C1101.1263%2C1101.1526%2C1101.4735%2C1101.4156%2C1101.3549%2C1101.1417%2C1101.5864%2C1101.2165%2C1101.5168%2C1101.1818%2C1101.4485%2C1101.4241%2C1101.5776%2C1101.5330%2C1101.4689%2C1101.5017%2C1101.3938%2C1101.2330%2C1101.5702%2C1101.0033%2C1101.3607&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Non-proportional response between 0.1-100keV energy by means of highly\n  monochromatic synchrotron X-rays"}, "summary": "Using highly monochromatic X-ray synchrotron irradiation ranging from 9 keV\nto 100 keV, accurate Lu2SiO5:Ce3+,Ca (LSO), Lu3Al5O12:Pr3+ (LuAG),\nLu2Si2O7:Ce3+ (LPS) and Gd2SiO5:Ce3+ (GSO) non-proportional response curves\nwere determined. By utilizing information from escape peaks in pulse height\nspectra the response curve can be extended down to several keV. A detailed\nstudy of the non-proportionality just above the K-edge is presented and from\nthat a method, which we named K-dip spectroscopy, is obtained to reconstruct\nthe electron response curve down to energies as low as 100 eV.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1101.5086%2C1101.5681%2C1101.3720%2C1101.0926%2C1101.3718%2C1101.1789%2C1101.5411%2C1101.3145%2C1101.1712%2C1101.4120%2C1101.1405%2C1101.4159%2C1101.5444%2C1101.4759%2C1101.2557%2C1101.1259%2C1101.0919%2C1101.5474%2C1101.4755%2C1101.3886%2C1101.1192%2C1101.3256%2C1101.3092%2C1101.2335%2C1101.2568%2C1101.4577%2C1101.5510%2C1101.0479%2C1101.5965%2C1101.1183%2C1101.0198%2C1101.0364%2C1101.2771%2C1101.0216%2C1101.5076%2C1101.0876%2C1101.4077%2C1101.0417%2C1101.5687%2C1101.1844%2C1101.1671%2C1101.3122%2C1101.4375%2C1101.1918%2C1101.2883%2C1101.4462%2C1101.3677%2C1101.4694%2C1101.5434%2C1101.0222%2C1101.3917%2C1101.3551%2C1101.3127%2C1101.4455%2C1101.5897%2C1101.4690%2C1101.1338%2C1101.0752%2C1101.2580%2C1101.0226%2C1101.2935%2C1101.3440%2C1101.5069%2C1101.4074%2C1101.4493%2C1101.2375%2C1101.1214%2C1101.4520%2C1101.2307%2C1101.3069%2C1101.2713%2C1101.2795%2C1101.0837%2C1101.5311%2C1101.5108%2C1101.4874%2C1101.0539%2C1101.1330%2C1101.1983%2C1101.1978%2C1101.1263%2C1101.1526%2C1101.4735%2C1101.4156%2C1101.3549%2C1101.1417%2C1101.5864%2C1101.2165%2C1101.5168%2C1101.1818%2C1101.4485%2C1101.4241%2C1101.5776%2C1101.5330%2C1101.4689%2C1101.5017%2C1101.3938%2C1101.2330%2C1101.5702%2C1101.0033%2C1101.3607&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Using highly monochromatic X-ray synchrotron irradiation ranging from 9 keV\nto 100 keV, accurate Lu2SiO5:Ce3+,Ca (LSO), Lu3Al5O12:Pr3+ (LuAG),\nLu2Si2O7:Ce3+ (LPS) and Gd2SiO5:Ce3+ (GSO) non-proportional response curves\nwere determined. By utilizing information from escape peaks in pulse height\nspectra the response curve can be extended down to several keV. A detailed\nstudy of the non-proportionality just above the K-edge is presented and from\nthat a method, which we named K-dip spectroscopy, is obtained to reconstruct\nthe electron response curve down to energies as low as 100 eV."}, "authors": ["Ivan V. Khodyuk", "Johan T. M. de Haas", "Pieter Dorenbos"], "author_detail": {"name": "Pieter Dorenbos"}, "author": "Pieter Dorenbos", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1109/TNS.2010.2045511", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1101.4485v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1101.4485v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "7 pages, 9 figures", "arxiv_primary_category": {"term": "cond-mat.mtrl-sci", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cond-mat.mtrl-sci", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "nucl-ex", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "physics.ins-det", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1101.4485v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1101.4485v1", "journal_reference": "IEEE Trans.Nucl.Sci.57:1175,2010", "doi": "10.1109/TNS.2010.2045511", "fulltext": "1\n\nNon-proportional response between 0.1-100keV\nenergy by means of highly monochromatic\nsynchrotron X-rays\nIvan V. Khodyuk, Johan T. M. de Haas, and Pieter Dorenbos, Member, IEEE\n\nAbstract- Using highly monochromatic X-ray synchrotron\nirradiation ranging from 9 keV to 100 keV, accurate\nLu2SiO5:Ce3+,Ca (LSO), Lu3Al5O12:Pr3+ (LuAG), Lu2Si2O7:Ce3+\n(LPS) and Gd2SiO5:Ce3+ (GSO) non-proportional response\ncurves were determined. By utilizing information from escape\npeaks in pulse height spectra the response curve can be extended\ndown to several keV. A detailed study of the non-proportionality\njust above the K-edge is presented and from that a method,\nwhich we named K-dip spectroscopy, is obtained to reconstruct\nthe electron response curve down to energies as low as 100 eV.\nIndex Terms- Electron response, K-dip spectroscopy, nonproportionality, scintillator, X-ray response\n\nI\n\nI. INTRODUCTION\n\nT was found 50 years ago [1] that the amount of light\nemitted in the scintillation spark caused by absorption of an\nX-ray or a γ-quantum in a crystal is not precisely proportional\nto its energy. This finding appears important because it causes\nthe energy resolution achievable with scintillation material to\ndeteriorate [2]. Although the phenomenon of non-proportional\nresponse and its relation with energy resolution has been\nstudied quite intensively [3] - [9] there are still many major\ngaps in our understanding of the underlying physics. New\ntheoretical models and accurate data by dedicated\nexperimental techniques are needed to reveal the true origin of\nenergy relaxation and dissipation inside the solid state. Better\nknowledge of the fundamental mechanisms of energy loss is\nnecessary in the search for new highly effective and low\nenergy resolution scintillators.\nNon-proportional response as function of gamma energy is\na direct consequence of the more fundamental nonproportional response to electrons. A powerful method to\nstudy the electron response of a scintillator is the Compton\nCoincidence Technique (CCT) introduced by Valentine and\nRooney [10] and further developed by Choong et al. [11]. The\nmain advantages of this method are the wide energy range\ncovered, and the results are not affected by surface effects.\n\nThe authors are with Faculty of Applied Sciences, Delft University of\nTechnology, Radiation Detection and Medical Imaging Group, Mekelweg 15,\n2629 JB Delft, The Netherlands (e-mail: i.v.khodyuk@tudelft.nl;\nj.t.m.dehaas@tudelft.nl; p.dorenbos@tudelft.nl).\n\nNevertheless, using CCT, it is not possible to obtain accurate\ndata on the electron response at energies below 3 keV. We\nwill demonstrate in this work that measuring the photon\nresponse using highly monochromatic synchrotron X-rays, it\nis possible to get information of electron response starting\nfrom energy as low as 100 eV avoiding influence of surface\neffects. We are not aware of any other experimental method\nthat provides information on electron response down to that\nlow energy. Accurate experimental data is especially\nimportant in this low energy range because there the most\ndramatic drop in scintillator efficiency is expected.\nIn this work we will start from the non-proportionality\nresponse curves determined using direct observation of photo\npeaks from total absorption of highly monochromatic X-ray\nsynchrotron irradiation; 9 – 100 keV X-rays were used.\nTypically 5 keV step size was used, much finer step size of 25\neV was used around the K absorption edge of the high Z atom\nin the scintillators. For each X-ray energy, energy resolution is\ndetermined as well. Next, a method to obtain the photon\nresponse curve in the low energy range down to 5 keV using\nKα and Kβ escape peaks is presented. The non-proportionality\ncurves as function of deposited energy are obtained for\nLu2SiO5:Ce3+,Ca\n(LSO),\nLu3Al5O12:Pr3+\n(LuAG),\n3+\n3+\nLu2Si2O7:Ce (LPS) and Gd2SiO5:Ce (GSO). Analysis of\ndetailed data of the non-proportionality just above the K-edge,\na method that we call K-dip spectroscopy, makes it possible to\nreconstruct the electron response curve that starts already at\nenergies as low as 100 eV. Finally, a comparison of all three\nmethods is presented for LSO and LuAG. The limitations of\nthe methods and differences are discussed.\nWe would like to state that this work presents a first attempt\nto use the K-dip spectroscopy and escape analysis, in order to\nunderstand causes of non-proportional response in inorganic\nscintillators. The aim of this work is to provide new data and\nmethods to obtain those. It is not our aim to provide a\ncomplete explanation of the observed non-proportional\nresponse curves.\nII. MATERIALS AND EXPERIMENT\nA. Scintillating materials\nTable I compiles the studied samples. We decided to use\nthese scintillators because LSO and GSO have similar\n\n\f2\nTABLE I\nTHE CRYSTALS USED IN THE EXPERIMENT\n\nCrystal\n\nSize, mm3\n\nResolution at 662 keV, %\n\nPhoton yield, photons/MeV\n\nReference\n\nLuAG:Pr\nGSO:Ce\nLSO:Ce,Ca\nLPS:Ce\n\n6×6×1\n14 × 10 × 1.5\n10 × 10 × 2\n6×7×2\n\n4.6\n8.1\n7.7\n10\n\n19000\n10500\n38800\n26000\n\n[13]\n[11]\n[10]\n[12]\n\nchemical composition and crystal structure, and differ mainly\nby the atomic number of the lanthanide. LSO:Ce codoped\nwith Ca is a scintillator with high density 7.4 g/cm3 and light\nyield of 38800 photons per MeV of absorbed gamma ray\nenergy (ph/MeV) [12]. In spite of high photon yield, the\nenergy resolution at 662 keV of the best LSO sample is not\nbetter than 7%. This is attributed to a high degree of intrinsic\nnon-proportionality of the material. GSO with four times\nlower photon yield of 10500 ph/MeV [13] has a comparable\nenergy resolution of 8%. LPS was chosen because it like LSO\ncontains Lu and has relatively high photon yield of 26000\nph/MeV, and at the same time poor energy resolution of 10%\n[14]. LuAG has been chosen because it is also a Lu-based\ncompound and it is a promising new scintillator material with\ngood proportionality and low energy resolution of 4.6% at 662\nkeV [15]. Relatively thin samples 1 – 2 mm thick were used,\nto increase the probability of Kα and Kβ X-ray escape events,\nwhich we are interested in.\n\nFig. 1. Pulse height spectrum of LSO recorded using 70 keV monochromatic\nX-rays. The solid red line is the result of a fit of the escape peaks with five\nGaussian peaks.\n\nB. Radioactive sources\nGamma ray pulse height spectra from radioactive sources\nwere measured with standard spectroscopic techniques. The\nnumber of photoelectrons per MeV of absorbed gamma ray\nenergy produced by the tested sample in a Hamamatsu R1791\nphotomultiplier tube was determined by comparing the peak\nposition of the 137Cs 662 keV and 241Am 59.5 keV photopeaks\nin the pulse height spectra with the mean value of the single\n\nphotoelectron peak position. The procedure has been\ndescribed in detail by de Haas et al. [16]. For the optimization\nof the observed yield and energy resolution, the shaping time\nwas set to 1μs.\nC. X-ray monochromator\nTo obtain more detailed non-proportionality curves,\nexperiments at the X-1 beamline at the Hamburger\nSynhrotronstrahlungslabor (HASY – LAB) synchrotron\nradiation facility in Hamburg, Germany were carried out. A\nhighly monochromatic pencil beam in the energy range 9 –\n100 keV was used as excitation source. A tunable double\nBragg reflection monochromator using a Si[511] and Si[311]\nset of silicon crystals providing an X-ray resolution of 1 eV at\n9 keV rising to 20 eV at 100 keV was used to select the X-ray\nenergies. The beam spot size was set by a pair of precision\nstepper-driven slits, positioned immediately in front of the\nsample coupled to the photomultiplier tube (PMT). For all\nmeasurements, a slit size of 50 × 50 μm2 was used. The PMT\nwas mounted on an X-Y table capable of positioning with a\nprecision of <1 μm in each direction. Prior to each\nmeasurement session, the position of the PMT was adjusted to\nachieve as high count rate as possible. The intensity of the\nsynchrotron beam was reduced in order to avoid pulse pileup.\nA lead shielding was used to protect the sample from\nbackground irradiation.\nFigure 1 shows 70 keV synchrotron X-ray pulse height\nspectrum of LSO recorded with a Hamamatsu R1791 PMT\nconnected to a homemade preamplifier, an Ortec 672\nspectroscopic amplifier and an Amptek 8000A multichannel\nanalyzer (MCA). Sample was optically coupled to the window\nof the PMT with Viscasil 600 000 cSt from General Electric.\nTo improve the collection of scintillation light, the crystal was\ncovered with several layers of ultraviolet reflecting Teflon\ntape (PFTE tape) forming an \"umbrella\" configuration [17].\nAll measurements were carried out at room temperature.\nCorrections were made for channel offsets in the pulse\nheight measurement. The offset was measured by the use of an\nOrtec 419 precision pulse generator with variable pulse height\nattenuation settings.\nIII. RESULTS AND DISCUSSION\nA. Non-proportionality\nThe photon response of the scintillators was determined\nusing monoenergetic X-rays with energies between 9 and 100\nkeV with a 5 keV step size. In the low energy range 9 to 15\n\n\f3\nTABLE II\nELECTRON BINDING ENERGIES\n\nElectron binding energies, keV\n\nElement\nLutetium\nGadolinium\n\nFig. 2. Scintillation photon yield at RT as a function of X-ray energy for\nLuAG, GSO, LSO and LPS, relative to the photon yield at 662 keV\nexcitation. The inset shows a 25 eV step size energy scan between 63 and 65\nkeV for LSO. Error bars are not shown, because the size of the error bar is\ncomparable with the symbol size\n\nkeV, a 1 keV step size was used. A much finer step size of 25\neV was used near the K-shell electron binding energy of\n63.314 keV for Lu or 50.239 keV for Gd-based compounds.\nFigure 2 shows the relative scintillation photon yield as a\nfunction of X-ray energy for LuAG, GSO, LSO and LPS. The\nnonproportional response is defined as the photoelectron\nyield/MeV at energy E divided by the photoelectron\nyield/MeV at 662 keV and presented in percents. Error bars\nare not shown in Fig. 2, because the size of the error bars is\ncomparable with the symbols size. Precision of the\nexperimental data can be seen in the inset of Fig. 2 and in case\nof LSO δ is less then 0.05% in the entire energy range.\n\nK, 1s\n63.314\n50.238\n\nLI, 2s\n10.870\n8.376\n\nLII, 2p1/2\n10.349\n7.930\n\nLIII, 2p3/2\n9.244\n7.243\n\nAll four materials reveal similar features. When moving\nfrom high energy towards low energy, we observe a relatively\nslow decrease of proportionality down to the K-edge energy.\nTable II compiles the K - and L -shell electron binding\nenergies for Lu and Gd. Figure 2 shows that at the Lu or Gd\nK-edge energy the non-proportionality curve increases with a\nclear discontinuity at the edge. For LuAG the response at the\nedge increases by about 2.1%, while for GSO it is 3.6%. LSO\nhas a change in response of 5.9% and this increases to 6.8%\nfor LPS. Moving further towards lower energy we observe a\ndrop of proportionality below the K-edge. At 9 keV the\nefficiency has decreased by 15%, 31%, 45%, and 60% for\nLuAG, GSO, LSO, and LPS, respectively. For the Lu-based\ncompounds there are also discontinuities in the nonproportionality curve at the Lu L-shell energy.\nWe observe a proportional dependence between the\nmagnitude of the drop KLdrop of scintillator efficiency from\nbelow the K-shell to above the L-shell energy with the\nmagnitude K dip of the drop at the K-edge. Empirically we can\nwrite\n\nKLdrop = ξ × K dip ,\n\nwhere for the Lu-based compounds\n\n(1)\n\nξ = 6.01±0.04 .\n\nB. Energy resolution\nThe energy resolution, defined as Full Width at Half\nMaximum intensity (FWHM) over the peak position,\ndetermined from photopeaks like in Fig. 1, are plotted in Fig.\n3 versus the X-ray energy and in Fig. 4 versus the number of\nphotoelectrons. The solid curve in Fig. 4 represents the\ntheoretical limiting resolution due to Poisson statistics in the\nnumber of detected photons [18]:\n\nRstat = 2.355\n\n1+ v (M )\nN phe\n\n,\n\n(2)\n\nwhere ν ( M ) = 0.15 is the variance in the PMT gain.\n\nFig. 3. Energy resolution versus X-ray energy. Error bars are not shown,\nbecause the size of the error bar is comparable with the symbol size.\n\nFig. 4 shows that the energy resolution for GSO and LuAG\nare quite close to the theoretical limit. For GSO the most\nimportant factor limiting energy resolution is the relatively\nlow photon yield of 10500 photons/MeV. For LuAG the\ncontribution from non-proportional response is very small. For\nLSO and LPS the values of their energy resolution are much\nfurther from the theoretical limit which is attributed to a large\ncontribution from the non-proportional response.\nAn S type structure can be observed in the data at the Lu or\nGd K-edges, see inset Fig. 4. For the LSO sample light yield\n\n\f4\nC. Information derived from escape peaks\nX-ray photons of energy between 9 keV and 100 keV\ninteract with a sample almost exclusively by means of the\nphotoelectric effect with a K-shell or L-shell electron. The\nelectron is ejected from its shell, leaving a hole. As the atom\nreturns to its stable lowest energy state, electrons from the\nouter shells relax to the inner shells, and in the process giving\noff a characteristic X-ray or Auger electrons. In the case that a\ncharacteristic X-ray photon escapes the bulk of the crystal we\nobserve a so-called escape peak, shown in Fig. 1. The energy\nEdeposited deposited in the bulk of the material is then:\n\nEdeposited = E X − Eescape ,\nwhere\nFig. 4. Energy resolution versus number of photo electrons. The inset shows\nthe S type structure around the Lu K-shell in the case of LSO.\n\nstarts to decrease approximately 300 eV below the Lu K-edge.\nWith further increase of the X-ray excitation energy, the\nnumber of photoelectrons falls rapidly from 662 at 63.0 keV\nto 631 at 63.5 keV. A discontinuous increase of the energy\nresolution appeared in the same energy range 63.0 – 63.5 keV.\nAnalogous features were observed for the other samples.\nLuAG shows the smallest resolution jump of only 0.9% at the\nK shell binding energy. For GSO the resolution jump is 1.4%,\nfor LSO 3.2%, and for LPS 5.6%. There is not a linear\nrelation between the magnitude of the resolution jump at the\nK-edge and K dip , but a correlation clearly exists; the larger\nthe resolution jump the larger the value for K dip .\n\nFig. 5. Scintillation photon yield relative to the photon yield at 662 keV.\nreconstructed using escape peaks as a function of deposited energy for\nLuAG, GSO, LSO and LPS.\n\n(3)\n\nE X is the energy of the incident X-ray photon and\n\nEescape - the energy of the fluorescent X-ray that escaped\nfrom the bulk of the material [19]. The ranges of Auger\nelectrons are too short to escape the bulk of the material and\nwe do not consider Auger electron escape here.\nUsing (3), we reconstructed the response curves for LuAG,\nGSO, LSO and LPS scintillators as shown in Fig. 5. Procedure\ndescribed by us in detail in [20]. The parts of the curves at\nenergies above the L-edge are obtained by analyzing Kα1 and\nKα2 – escape peaks. Kα X-ray fluorescence is caused by a\ntransition of an electron from one of the subshells of the Lshell to the hole in the K-shell. In the case of transition from\nthe M or N-shell to the hole in the K-shell, a Kβ1, Kβ2 or Kβ3\nX-ray can be emitted and by utilizing the Kβ escape peaks the\nphoton response below the L-edge can be reconstructed for\nLuAG and LSO. The probabilities of other transitions leading\nto X-ray escape are very small and not considered here. It was\nnot possible to resolve Kα and Kβ escape peaks for GSO and\nLPS, and hence no data below the L-edges could be retrieved.\nIn the case of LPS the absence of the Kβ escape peak is due to\na very poor energy resolution, and for GSO because of the\nlower energy of the Gd L-edge compared to that of Lu. The\nstatistical contribution to the energy resolution becomes large\nin the low X-ray energy range and a high photon yield of the\nmaterial is then important to be able to resolve the Kα and Kβ\nescape peaks.\nReconstructed data match data obtained from photopeak\nanalysis well like in [21]. Rapid changes of the scintillator\nefficiency are observed near energies of Lu and Gd L-shell. A\nsharp discontinuity like in the case of the K-edge is not seen\nbecause there are three different L-subshell electron binding\nenergies instead of only one for the K-shell.\nD. K-dip spectroscopy\nAnalysis of data on the non-proportionality response just\nabove the K-edge Fig. 6, makes it possible to reconstruct the\nelectron response curve that starts already at energies as low\nas 100 eV. We call this method K-dip spectroscopy. Briefly,\nthe method can be described as follows. The response of a\n\n\f5\n\nFig. 6. Position of the Gaussian fitted photopeak for LSO as a function of Xray energy. Solid red line represents polynomial fit of the data above the Lu\nK electron binding energy.\n\nscintillator to an X-ray that has interacted with a K-shell\nelectron is equivalent to the response of a scintillator to a sum\nof two main interaction products: 1) a K-shell photo electron\nresponse plus 2) the sequence of processes following\nrelaxation of the hole in the K-shell, the so-called K-cascade\nresponse. Our strategy is to employ X-ray energies just above\nthe K-edge. The scintillator response due to the K-cascade is\nassumed independent from the original X-ray energy. This\nresponse is found by tuning the X-ray energy very close above\nthe K-shell binding energy. By subtracting the K-cascade\nresponse from the total X-ray response we are left with the\nresponse in photoelectrons/MeV from the K-shell photoelectron alone with energy E X − EK\n. To estimate the\nbinding\n\nscintillator response due to the K-cascade, we fitted\nexperimental data just above the K electron binding energy\nwith polynomial fit Fig. 6. The mean value of the fit function\nat 63.314 keV was taken as light yield produced by Kcascade. The non-proportionality curve is then obtained by\ndividing with the photoelectron yield/MeV at energy of 662\nkeV. This procedure is analogous to the one developed by\nCollinson and Hill [22].\nFigure 7 shows the results obtained from this K-dip\nspectroscopy method. Our method is good enough to show\nshape and principal behavior of the electron response curve.\nThe error bars, shown in Fig. 7 for LSO are substantial\nbecause of subtracting of two close quantities. We are not\npresenting error bars for the other samples in order to keep\ndata readability.\nA drop of 70% to 90% in the scintillator efficiency can be\nseen for the samples. Like in Fig. 2 we have the same ordering\nof the curves in Fig. 7; the most proportional one is for LuAG,\nthen for GSO, LSO, and finally for LPS. Fig. 7 reveals a new\nfinding. For all Lu based samples the slope of the electron\nnon-proportional response curve tends to become less steep\nbelow 1 keV.\n\nFig. 7. Relative photon yield as a function of photo electron energy inferred\nusing K-dip spectroscopy.\n\nAccording to theory [23, 24] on electron inelastic mean free\npaths and stopping powers, the deposited energy density\n\ndE\n\ndx\n\nalong the track as a function of electron energy\n\nincreases rapidly with decrease of electron energy. In the low\nenergy range peaking of the deposited energy density is\nobserved in condensed matter. Position of the density\nmaximum is material dependent, but is in order of few\nhundreds of electron volts. Since a high deposited energy\ndensity\n\ndE\n\ndx\n\nis thought to be the main reason for\n\nscintillator efficiency losses [2], [3], we expect a relationship\nbetween the non-proportionality curve and the deposited\nenergy density curve.\nE. Comparison of the three methods\nFig. 8 and Fig. 9 compare the three sets of response curve\ndata of LSO and LuAG, obtained from X-ray photopeak\nposition analysis, escape peak analysis, and K-dip\nspectroscopy. As shown in the insets, the shapes of the curves\nobtained from the photopeak and escape peaks agree well but\ndo have small differences. Those differences we attribute to\nthe fact that the atomic state after photoelectric interaction\nwith the L-shell is different from the atomic state after X-ray\nfluorescence. In the former situation a hole is created with\nequal probability in the LI, LII, and LIII subshells. In the latter\nsituation the hole is preferably created in the LIII and LII\nsubshells [19]. The cascade products and the resulting photon\nyields are then not necessarily equal for both situation leading\nto the small differences in the data from both methods in Fig.\n6 and 7. In the entire energy range, the K-shell photo-electron\nresponse curves are located above the X-ray photon response\ncurves. It means that a single electron produces higher number\nof scintillating photons then an X-ray or gamma photon of the\nsame energy. It can be understood by comparing the\nsecondary reaction products from single electron and photon\n\n\f6\n\nFig. 8. Comparison of direct photon response, response reconstructed using\nescape peaks and electron response inferred using K-dip spectroscopy for\nLuAG. The inset shows zoomed in part of the curves near L binding\nenergies.\n\nFig. 9. Comparison of direct photon response, response reconstructed using\nescape peaks and electron response inferred using K-dip spectroscopy for\nLSO. The inset shows zoomed in part of the curves near L binding energies.\n\ninteraction in the sample. An X-ray photon, depending on its\nenergy, can be photoelectrically absorbed by one of the atom's\nshells, creating a relatively energetic photoelectron and a set\nof electrons of low energies as a result of the cascade process\nfollowing hole relaxation. Because of a high nonproportionality of the scintillator in the low energy region, the\nnumber of photons created by the set of low energy electrons\nwill always be smaller then the yield from the single electron\nof the same total energy.\n\nthese tracks do not interfere with the track created by the Kshell photoelectron. In that case the K-dip spectroscopy\nmethod provides us like the CCT method the genuine electron\nresponse. However, when tracks do influence each other, i.e.\nwhen the number of photons produced by the photoelectron is\naffected by the tracks from the cascade products, an error is\nintroduced In this regard CCT may have an intrinsic\nadvantage over the K-dip spectroscopy, by exciting the crystal\nwith essentially just one electron at a time.\n\nIV. CONCLUSION\n\nACKNOWLEDGMENT\n\nWe have measured the scintillation response of LuAG,\nGSO, LSO, and LPS to X-rays in the energy range 9 – 100\nkeV, with special emphasis near the K-edge of the high Z\natoms in the scintillator. From this data, we have inferred the\nelectron response curves of the materials in the energy range\n0.1 – 30 keV by a new method that we named K-dip\nspectroscopy. From 30 keV to 1 keV, scintillation yield for all\nsamples appears to drop by 50 to 75%. Below 500 eV the\nresponse becomes proportional again. A means to construct\nthe low energy photon response using analysis of escape\npeaks has been presented.\nOur methods utilizing escape peaks and K-dip spectroscopy\nhave the advantage that the non-proportionality curve can be\nextended to lower energies than possible with other methods.\nCCT becomes too inaccurate below 3 keV. With K-dip\nspectroscopy the curves are extended down to 100 eV.\nDetailed study of the non-proportionality in the photon\nresponse just above the K-edge using energy step as small as\n25 eV makes this possible.\nThe CCT method has an advantage over K-dip\nspectroscopy. In K-dip spectroscopy we suppose that in the Kcascade a set of low energy electrons are emitted from the\natom and each produces an ionization track. We assumed that\n\nAuthors would like to thank Alan Owens and Francesco\nQuarati for providing beamtime and assisting with experiment\nat\nthe\nX-1\nbeamline\nat\nthe\nHamburger\nSynhrotronstrahlungslabor (HASY – LAB) synchrotron\nradiation facility. These investigations have been supported by\nThe Netherlands Technology Foundation (STW)\nREFERENCES\n[1]\n[2]\n[3]\n[4]\n[5]\n\n[6]\n[7]\n\nD. Engelkemeir, \"Nonlinear Response of NaI(Tl) to Photons\", Rev. Sci.\nInstrum., vol. 27, no. 8, pp. 589-591 (1956).\nC. D. Zebry, A. Meyer, R.B. Murray, \"Intrinsic Line Broadening in\nNaI(Tl) Gamma-ray Spectrometers\", Nucl. Instr. Meth., vol. 12, pp. 115123 (1961).\nR. B. Murray, A. Meyer, \"Scintillation Response of Activated Inorganic\nCrystals to Various Charged Particles\", Phys. Rev., vol. 122, pp. 815826 (1961).\nP. A. Rodnyi, P. Dorenbos, C. W. E. van Eijk, \"Energy Loss in\nInorganic Scintillators\", Phys. Stat. Sol. (b) vol. 187, pp. 15-29 (1995).\nP. Dorenbos, J. T. M. De Haas, and C. W. E. Van Eijk,\n\"Nonproportionality in the scintillation response and the energy\nresolution obtainable with scintillation crystals,\" IEEE Trans. Nucl. Sci.,\nvol. 42, no. 6, pp. 2190-2202 (1995).\nJ. D. Valentine, B. D. Rooney, J. Li, \"The Light Yield\nNonproportionality Component of Scintillator Energy Resolution\", IEEE\nTrans. Nucl. Sci., vol. 45, no. 3, pp. 512-517 (1998).\nM. Moszynski, A. Nassalski, A. Syntfeld-Kazuch, L. Swiderski, T.\nSzczesniak, \"Energy resolution of scintillation detectors-new\n\n\f7\n\n[8]\n[9]\n[10]\n\n[11]\n\n[12]\n[13]\n\n[14]\n\n[15]\n\n[16]\n[17]\n[18]\n[19]\n[20]\n[21]\n[22]\n[23]\n[24]\n\nobservations\", IEEE Trans. Nucl. Sci., vol. 55, no. 3, pp. 1062-1068\n(2008).\nG. Bizarri, W. W. Moses, J. Singh, A. N. Vasil'ev, R. T. Williams, \"An\nAnalytical Model of Non-proportional Scintillator Light Yield in Terms\nof Recombination Rates\", J. Appl. Phys., vol. 105, 044507 (2009).\nP.A. Rodnyi, Physical Processes in Inorganic Scintillators, CRC Press,\n1997.\nB. D. Rooney, J. D. Valentine, \"Benchmarking the Compton\nCoincidence Technique for Measuring Electron Response NonProportionality in Inorganic Scintillators\", IEEE Trans. Nucl. Sci., vol.\n43, no. 3, pp. 1271-1276 (1996).\nW.-S. Choong, K. M. Vetter, W. W. Moses, G. Hull, S. A. Payne, N. J.\nCherepy, J. D. Valentine, \"Design of a Facility for Measuring\nScintillator Non-Proportionality\", IEEE Trans. Nucl. Sci., vol. 55, no. 3,\npp. 1753-1758 (2008).\nM.A. Spurrier, P. Szupryczynski, K. Yang, A.A. Carey, C.L. Melcher,\n\"Effects of Ca2+ Co-Doping on the Scintillation Properties of LSO:Ce\",\nIEEE Trans. Nucl. Sc., vol. 55, no. 3, 1178-1182 (2008).\nV. D. Ryzhikov, B. V. Grinev, E. N. Pirogov, G. M. Onyshchenko, A. I.\nIvanov, V. G. Bondar, K. A. Katrunov, \"Use of Gadolinium\nOxyorthosilicate Scintillators in X-ray Radiometers\", Opt. Eng., vol. 44,\n016403 (2005).\nL. Pidol, B. Viana, A. Kahn-Harari, B. Ferrand, P. Dorenbos, C. W. E.\nvan Eijk, \"Scintillation and Thermoluninescence Properties of\nLu2Si2O7:Ce3+ Crystals\", Nucl. Instr. Meth. Phys. Res. A, vol. 537, pp.\n256-260 (2005).\nW. Drozdowski, P. Dorenbos, J.T.M. de Haas, R. Drozdowska, A.\nOwens, K. Kamada, K. Tsutsumi, Y. Usuki, T. Yanagida, A. Yoshikawa,\n\"Scintillation properties of praseodymium activated Lu3Al5O12 single\ncrystals\", IEEE Trans. Nucl. Sc., vol. 55, no. 4, pp.2420-2424 (2008).\nJ. T. M. de Haas, P. Dorenbos, \"Advances in yield calibration of\nscintillators\", IEEE Trans. Nucl. Sci., vol. 55, no. 3, pp. 1086-1092\n(2008).\nJ. T. M. de Haas, P. Dorenbos, C. W. E. van Eijk, \"Measuring the\nabsolute light yield of scintillators\", Nucl. Instr. Meth. Phys. Res. A, vol.\n537, pp. 97-100 (2005).\nP. Dorenbos, \"Fundamental limitations in the performance of Ce3+,\nPr3+, and Eu2+ activated scintillators to be published in this volume\nIEEE Trans. Nucl. Sci.\nA.C. Thompson, D. Vaughan, X-ray Data Booklet, Lawrence Berkeley\nNat. Lab., Sec. ed., 2001.\nI.V. Khodyuk, P.A. Rodnyi, P. Dorenbos, \"Non-proportional\nscintillation response of NaI:Tl to low energy X-ray photons and\nelectrons\", submitted to J. Appl. Phys.\nM. Moszynski, M. Balcerzyk, W. Czarnacki, M. Kapusta, W. Klamra, A.\nSyntfeld, M. Szawlowski \"Intrinsic Energy Resolution and Light yield\nNonproportionality of BGO\", IEEE TNS, vol. 51, pp. 1074, 2004.\nA. J. L. Collinson, R. Hill, \"The Fluorescent Response of NaI(Tl) and\nCsI(Tl) to X Rays and γ Rays\", Proc. Phys. Soc., vol. 81, pp. 883-892\n(1963).\nA. P. Sorini, J. J. Kas, J. J. Rehr, M. P. Prange, Z. H. Levine, \"Ab initio\ncalculations of electron inelastic mean free paths and stopping powers\",\nPhys. Rev. B, vol. 74, 165111 (2006).\nJ.C. Ashley, \"Interaction of low-energy electrons with condensed matter:\nstopping powers and inelastic mean free paths from optical data\", J.\nElec. Spectr. Rel. Phenom., 46 (1988) 199-214.\n\n\f"}