{"id": "http://arxiv.org/abs/1005.1898v1", "guidislink": true, "updated": "2010-05-11T18:03:58Z", "updated_parsed": [2010, 5, 11, 18, 3, 58, 1, 131, 0], "published": "2010-05-11T18:03:58Z", "published_parsed": [2010, 5, 11, 18, 3, 58, 1, 131, 0], "title": "Ionospheric Power-Spectrum Tomography in Radio Interferometry", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1005.2395%2C1005.5304%2C1005.0560%2C1005.3655%2C1005.3159%2C1005.3940%2C1005.1875%2C1005.5302%2C1005.3892%2C1005.0475%2C1005.2800%2C1005.0444%2C1005.3933%2C1005.0556%2C1005.3943%2C1005.1109%2C1005.2312%2C1005.4937%2C1005.2677%2C1005.0375%2C1005.5251%2C1005.2504%2C1005.0790%2C1005.0105%2C1005.0240%2C1005.4943%2C1005.0925%2C1005.3644%2C1005.5149%2C1005.4598%2C1005.0184%2C1005.2175%2C1005.4707%2C1005.5586%2C1005.2581%2C1005.3817%2C1005.5157%2C1005.1698%2C1005.4387%2C1005.2449%2C1005.2043%2C1005.1330%2C1005.2034%2C1005.2790%2C1005.1721%2C1005.0802%2C1005.5488%2C1005.0131%2C1005.0651%2C1005.4495%2C1005.0221%2C1005.2945%2C1005.4921%2C1005.4295%2C1005.0402%2C1005.2321%2C1005.2927%2C1005.2970%2C1005.3512%2C1005.2374%2C1005.5020%2C1005.3360%2C1005.1344%2C1005.0267%2C1005.0293%2C1005.3007%2C1005.3168%2C1005.4540%2C1005.0093%2C1005.1205%2C1005.4802%2C1005.2432%2C1005.3008%2C1005.4775%2C1005.5685%2C1005.2506%2C1005.1898%2C1005.2383%2C1005.0187%2C1005.4833%2C1005.3338%2C1005.5661%2C1005.1132%2C1005.5263%2C1005.3879%2C1005.4109%2C1005.2560%2C1005.5711%2C1005.3795%2C1005.5206%2C1005.2318%2C1005.5210%2C1005.2336%2C1005.4468%2C1005.3035%2C1005.0856%2C1005.1802%2C1005.2148%2C1005.4398%2C1005.4446%2C1005.5298&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Ionospheric Power-Spectrum Tomography in Radio Interferometry"}, "summary": "A tomographic method is described to quantify the three-dimensional\npower-spectrum of the ionospheric electron-density fluctuations based on\nradio-interferometric observations by a two-dimensional planar array. The\nmethod is valid to first-order Born approximation and might be applicable to\ncorrect observed visibilities for phase variations due to the imprint of the\nfull three-dimensional ionosphere. It is shown that not the ionospheric\nelectron density distribution is the primary structure to model in\ninterferometry, but its autocorrelation function or equivalent its\npower-spectrum. An exact mathematical expression is derived that provides the\nthree dimensional power-spectrum of the ionospheric electron-density\nfluctuations directly from a rescaled scattered intensity field and an incident\nintensity field convolved with a complex unit phasor that depends on the w-term\nand is defined on the full sky pupil plane. In the limit of a small field of\nview, the method reduces to the single phase screen approximation. Tomographic\nself-calibration can become important in high-dynamic range observations at low\nradio frequencies with wide-field antenna interferometers, because a\nthree-dimensional ionosphere causes a spatially varying convolution of the sky,\nwhereas a single phase screen results in a spatially invariant convolution. A\nthick ionosphere can therefore not be approximated by a single phase screen\nwithout introducing errors in the calibration process. By applying a Radon\nprojection and the Fourier projection-slice theorem, it is shown that the\nphase-screen approach in three dimensions is identical to the tomographic\nmethod. Finally we suggest that residual speckle can cause a diffuse intensity\nhalo around sources, due to uncorrectable ionospheric phase fluctuations in the\nshort integrations, which could pose a fundamental limit on the dynamic range\nin long-integration images.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1005.2395%2C1005.5304%2C1005.0560%2C1005.3655%2C1005.3159%2C1005.3940%2C1005.1875%2C1005.5302%2C1005.3892%2C1005.0475%2C1005.2800%2C1005.0444%2C1005.3933%2C1005.0556%2C1005.3943%2C1005.1109%2C1005.2312%2C1005.4937%2C1005.2677%2C1005.0375%2C1005.5251%2C1005.2504%2C1005.0790%2C1005.0105%2C1005.0240%2C1005.4943%2C1005.0925%2C1005.3644%2C1005.5149%2C1005.4598%2C1005.0184%2C1005.2175%2C1005.4707%2C1005.5586%2C1005.2581%2C1005.3817%2C1005.5157%2C1005.1698%2C1005.4387%2C1005.2449%2C1005.2043%2C1005.1330%2C1005.2034%2C1005.2790%2C1005.1721%2C1005.0802%2C1005.5488%2C1005.0131%2C1005.0651%2C1005.4495%2C1005.0221%2C1005.2945%2C1005.4921%2C1005.4295%2C1005.0402%2C1005.2321%2C1005.2927%2C1005.2970%2C1005.3512%2C1005.2374%2C1005.5020%2C1005.3360%2C1005.1344%2C1005.0267%2C1005.0293%2C1005.3007%2C1005.3168%2C1005.4540%2C1005.0093%2C1005.1205%2C1005.4802%2C1005.2432%2C1005.3008%2C1005.4775%2C1005.5685%2C1005.2506%2C1005.1898%2C1005.2383%2C1005.0187%2C1005.4833%2C1005.3338%2C1005.5661%2C1005.1132%2C1005.5263%2C1005.3879%2C1005.4109%2C1005.2560%2C1005.5711%2C1005.3795%2C1005.5206%2C1005.2318%2C1005.5210%2C1005.2336%2C1005.4468%2C1005.3035%2C1005.0856%2C1005.1802%2C1005.2148%2C1005.4398%2C1005.4446%2C1005.5298&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "A tomographic method is described to quantify the three-dimensional\npower-spectrum of the ionospheric electron-density fluctuations based on\nradio-interferometric observations by a two-dimensional planar array. The\nmethod is valid to first-order Born approximation and might be applicable to\ncorrect observed visibilities for phase variations due to the imprint of the\nfull three-dimensional ionosphere. It is shown that not the ionospheric\nelectron density distribution is the primary structure to model in\ninterferometry, but its autocorrelation function or equivalent its\npower-spectrum. An exact mathematical expression is derived that provides the\nthree dimensional power-spectrum of the ionospheric electron-density\nfluctuations directly from a rescaled scattered intensity field and an incident\nintensity field convolved with a complex unit phasor that depends on the w-term\nand is defined on the full sky pupil plane. In the limit of a small field of\nview, the method reduces to the single phase screen approximation. Tomographic\nself-calibration can become important in high-dynamic range observations at low\nradio frequencies with wide-field antenna interferometers, because a\nthree-dimensional ionosphere causes a spatially varying convolution of the sky,\nwhereas a single phase screen results in a spatially invariant convolution. A\nthick ionosphere can therefore not be approximated by a single phase screen\nwithout introducing errors in the calibration process. By applying a Radon\nprojection and the Fourier projection-slice theorem, it is shown that the\nphase-screen approach in three dimensions is identical to the tomographic\nmethod. Finally we suggest that residual speckle can cause a diffuse intensity\nhalo around sources, due to uncorrectable ionospheric phase fluctuations in the\nshort integrations, which could pose a fundamental limit on the dynamic range\nin long-integration images."}, "authors": ["L. V. E. Koopmans"], "author_detail": {"name": "L. V. E. Koopmans"}, "author": "L. V. E. Koopmans", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1088/0004-637X/718/2/963", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1005.1898v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1005.1898v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "8 pages; Accepted for publication in ApJ", "arxiv_primary_category": {"term": "astro-ph.IM", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "astro-ph.IM", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "astro-ph.CO", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "astro-ph.EP", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "astro-ph.GA", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "astro-ph.SR", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1005.1898v1", "affiliation": "Kapteyn Astronomical Institute", "arxiv_url": "http://arxiv.org/abs/1005.1898v1", "journal_reference": null, "doi": "10.1088/0004-637X/718/2/963", "fulltext": "Preprint typeset using LATEX style emulateapj v. 11/10/09\n\nIONOSPHERIC POWER-SPECTRUM TOMOGRAPHY IN RADIO INTERFEROMETRY\nL.V.E. Koopmans\nKapteyn Astronomical Institute, University of Groningen, P.O.Box 800, 9700 AV Groningen, The Netherlands (koopmans@astro.rug.nl)\n\narXiv:1005.1898v1 [astro-ph.IM] 11 May 2010\n\n(Accepted May 11, 2010)\n\nABSTRACT\nA tomographic method is described to quantify the three-dimensional power-spectrum of the ionospheric\nelectron-density fluctuations based on radio-interferometric observations by a two-dimensional planar array.\nThe method is valid to first-order Born approximation and might be applicable to correct observed visibilities\nfor phase variations due to the imprint of the full three-dimensional ionosphere. It is shown that not the ionospheric electron density distribution is the primary structure to model in interferometry, but its autocorrelation\nfunction or equivalent its power-spectrum. An exact mathematical expression is derived that provides the three\ndimensional power-spectrum of the ionospheric electron-density fluctuations directly from a rescaled scattered\nintensity field and an incident intensity field convolved with a complex unit phasor that depends on the w-term\nand is defined on the full sky pupil plane. In the limit of a small field of view, the method reduces to the single\nphase screen approximation. Tomographic self-calibration can become important in high-dynamic range observations at low radio frequencies with wide-field antenna interferometers, because a three-dimensional ionosphere causes a spatially varying convolution of the sky, whereas a single phase screen results in a spatially\ninvariant convolution. A thick ionosphere can therefore not be approximated by a single phase screen without\nintroducing errors in the calibration process. By applying a Radon projection and the Fourier projection-slice\ntheorem, it is shown that the phase-screen approach in three dimensions is identical to the tomographic method.\nFinally we suggest that residual speckle can cause a diffuse intensity halo around sources, due to uncorrectable\nionospheric phase fluctuations in the short integrations, which could pose a fundamental limit on the dynamic\nrange in long-integration images.\nSubject headings: instrumentation: interferometers - techniques: interferometric - methods: analytical\n1. INTRODUCTION\n\nOver the last years, considerable effort has gone into the\nconstruction of large wide-field low-frequency radio interferometers. One of many challenges that these new instruments\nmust overcome is that of phase and amplitude fluctuations\ndue to the ionosphere (Hewish 1951, 1952). This is particularly important at meter-wavelegths where these instruments\noperate (see e.g. Cohen & Röttgering 2009) and the refractive\nindex of the ionized medium can be particularly large1. Moreover, low-frequency radio telescopes often have wide fields of\nview (i.e. up to tens of degrees), making them not only susceptible to the combined electric field from large parts of the\nsky, but also to its modifications by the full three-dimensional\nelectron-density structure of the ionosphere.\nFor high-frequency interferometers – having dish-antennae\nthat probe a small area of the sky (a few degrees or less) –\nthe three-dimensional ionosphere can be collapsed along the\nline-of-sight and be well approximated by a two-dimensional\nthin phase-screen, without loosing substantial information\n(Salpeter 1967). This approximation, however, does not hold\nif the field of view becomes large and widely separated antennae observe different sources, under large angles, through\nsimilar parts of the ionosphere (e.g. Lonsdale 2005). In\nthe case of wide-field low-frequency interferometers, a full\nthree dimensional model of the ionosphere is required for\nself-consistent ionospheric calibration. Whereas considerable\nwork has recently gone in to developing (multi-layer) twodimensional wide-field ionospheric models (e.g. Intema et al.\n2009; Matejek & Morales 2009), no physically intuitive and\nself-consistent description seems readily available for full1\nThe ratio of the plasma over the observing frequency at 150 MHz is\n∼0.03; hence intensity scattering is at the level of ∼0.001 and scales with λ2 .\n\nscale three-dimensional wide-field modelling of the ionosphere.\nIn this paper a step towards such a complete physical\ndescription is presented based on the tomographic theory\nof electric field scattering by weakly inhomogeneous media\n(Wolf 1969), as applied to the ionosphere. The main result\nis that the ionosphere, over a wide field of view, acts as a\nscatterer with a spatially varying point spread function. The\ninstantaneous two-dimensional point spread function at a position s (a directional unit vector) around a point source at\ns0 is identical to the instantaneous three-dimensional powerspectrum2 of the ionospheric electron-density sampled from\npoints (s − s0 ) on the surface of an \"Ewald sphere of reflection\" (Ewald 1969), i.e. a spherical surface with unit radius centered on the direction of the source. Having many\npoint or very compact sources over a larger field of view allows one to sample the three-dimensional Fourier structure\nof the ionosphere at many distinct points. These points can\nbe used to constrain a three dimensional model of the powerspectrum of the ionosphere. This model can subsequently be\nused to \"deconvolve\" the image, also at points where there\nare no strong sources, and remove the dominant phase errors\ndue the three dimensional ionosphere. We term this \"tomographic self-calibration\", because it involves a three dimensional ionosphere and not a single phase screen. This calibration can not be done in the classical way through selfcalibration (see e.g. Pearson & Readhead 1984) because the\n2 Throughout the paper, if not mentioned otherwise, the power-spectrum is\nassumed to be the exact squared amplitude of the ionospheric electron density\nwaves as function of their three dimensional wave vectors at a given moment\nin time, and not the expectation value of this squared amplitude over an ensemble average (Bourgois 1981). In general the former is a Gaussian random\nrealization of the latter.\n\n\f2\n\nKoopmans\n\nscattering point spread function is not spatially invariant as\nis implicit in that method. It either requires the solution of\na matrix (measurement) equation (e.g. Hamaker et al. 1996;\nMatejek & Morales 2009; Liu et al. 2010), which is computationally more demanding than traditional self-calibration or,\nas we will show, it can be written as a specific three dimensional Fourier transform.\nThe main goal of this paper, however, is not to introduce a\nspecific solution scheme or algorithm to these equations, but\nto provide more useful guidance to future methods of selfconsistent physics-motivated three dimensional modeling of\nthe ionosphere and its use in calibration. The second goal is\nto describe several effects of a three dimensional ionosphere\non interferometric measurements at low frequencies that go\nbeyond thin phase-screen models, which have thus far been\nvery successful, but are demonstratively incorrect for an extended three dimensional ionosphere.\nThe outline of the paper is as follows: In Section 2, the theory of scattering of a plane-wave electric field is restated in\nterms more familiar to radio interferometry and extended to\nthe case of multiple point sources. In Section 3, the crosscorrelation of the scattered electric field is determined (i.e.\nthe visibility function) and several effects of the ionosphere\non imaging are described (e.g. speckle). In Section 4, the first\norder effect of the thickness of the ionosphere is analyzed. In\nSection 5, the description is extended from multiple points\nsources to a continuous intensity field and a mathematical expression is derived that allows one to build a three dimensional model of the power spectrum of the ionosphere from\ninformation obtained only in the interferometer plane (i.e. a\nholographic principle). In Section 6, it is shown how the\ntomographic method, connects to an extension of the phasescreen approach to three dimensions using a Radon transformation and applying the Fourier projection-slice theorem. In\nSection 7, we summarize our results and give conclusions.\n2. WEAK SCATTERING BY THE IONOSPHERE\n\nIn this section, the basic theory of electric-field tomography of a weakly scattering media is restated as first introduced by (Wolf 1969). The notation is adapted to that typically used in radio astronomy and radio interferometry (see\ne.g. Thompson et al. 2001). Under the assumption that the refractive index of the ionosphere varies slowly over a single\nphoton wavelength, and the ionosphere is \"frozen\" over the\ntime scale the radiation passes through it, one can write the\nelectric field equation in a dielectric medium as\n∇2 Eν (r) + [k2 n2ν (r)] Eν (r) = 0,\n\n(1)\n\nwhere nν (r) is the refractive index of the medium at a position r and at frequency ν, and k = 2π/λ is the usual wave\nnumber for a wavelength λ = c/ν (Born & Wolf 1999). In\na plasma with electron density ne (r) the refractive index is\ngiven by n2 = 1 − [ne e2 /(ν2 me ǫ0 )] ≡ 1 − (νp /ν)2 , where νp is\nthe plasma frequency, being typically ∼5 MHz for the ionosphere. We drop the explicit frequency dependence of the\nelectric field, but it should implicitly be assumed.\nBecause the three components of the electric field are independent, each component satisfies the same solution and we\ncan simply use the scalar E to describe the electric field. If\nthe refractive index of the ionosphere is near unity, which is\noften the case in radio astronomy (i.e. ν ≫ νp ), the equation\nfor the electric field can be conveniently rewritten as\n(∇2 + k2 ) E(r) = −4π Φ(r) E(r),\n\n(2)\n\nwhere Φ(r) ≡ k2 [n2 − 1]/4π is called the scattering potential.\nIn case of n ≈ 1, the scattering potential strength is close to\nzero and scattering is weak3 . When Φ(r) = 0 everywhere, the\nequation reduces to the Helmholtz equation for a plane wave.\nThe solution of this equation can be obtained (Born & Wolf\n1999) through Green's functions and leads to an implicit integral equation\nZ\nik|r−r′ |\n′\n′ e\n(i)\nΦ(r )E(r )\nE(r) = E (r) +\nd 3 r′ ,\n(3)\n|r − r′ |\nV\n\nwhere E(r) = E (i) (r) + E (s) (r). The first term is the incident\n(plane) wave and the second term the scattered wave. The latter is equal to the integral term above and carried out over the\nentire volume V in which n , 1. The last factor in the integrand indicates that E (s) (r) is a spherically outgoing wave, assuming the extent of the scattering potential is small compared\nto the distance between observer and scattering medium.\n2.1. Weak Scattering of Multiple Point Sources\n\nWe now extend the single plane-wave description of Wolf\n(1969) to an incident electric field that results from the sum\nof N point sources that satisfy the solution of the Helmholtz\nequation in free space. Later in the paper we further extend\nthis to a continuous intensity field. We also express all physical distances in units of λ, i.e. u ≡ r/λ = (u, v, w) in the remainder of the paper. Its Fourier equivalent is s = (su , sv , sw ).\nThe incident electric field in this case becomes\nXp\nS n e2πis0,n *u ,\n(4)\nE (i) (u) =\nn\n\nwhere S n is the flux-density of point source n = 1 . . . N and\ns0,n are unit vectors that point in the directions of the point\nsources. These point sources are (for now) assumed to dominate the electric field and can be compared to the phase calibrators in radio interferometry. In the weak scattering approximation, the scattered wave has a relatively low amplitude\ncompared to the incident wave. We can then replace E(u) with\nE (i) (u) to first-order (Born) approximation, finding\n2πi|u−u′ |\nXp Z\n′ e\nd3 u′ , (5)\nΦ(u′ )e2πis0,n *u\nSn\nE1(s) (u) =\n′|\n|u\n−\nu\nV\nn\nwhere the subscript indicates that the scattered field is that\nto first order Born approximation and Φ(u) ≡ [n2 − 1]. We\nnote here that the second order can be obtained by substituting\nE (i) (u) + E1(s) (u) in to the original integral equation to obtain\na solution to second order, etc. This iterative scheme only\nworks for weak scattering, where the values of Φ(u) do not\nexceed unity.\nIf we use the fact that the spherical outgoing wave can be\nwritten as (Weyl 1919)\nZ ∞Z ∞\n′\ne2πi|u−u |\n1 2πi(su (u−u′ )+sv (v−v′ )+sw (w−w′ )\ne\ndsu dsv ,\n=\ni\n|u − u′ |\n−∞ −∞ sw\n(6)\n3 We note here that even though scattering can be \"weak\" in terms of a\nsmall deviation of the refractive index from unity everywhere, the integral\nover the line of sight can still lead to substantial phase changes in the electric\nfield, leading to both diffractive and refractive effects and strong scintillation\n(e.g. Narayan 1992). In the current discussion \"weak scattering\" means both\na refractive index very close to unity and phase fluctuations much less than\nunity. The latter is the nominal mode of the ionosphere and data obtained\nwith interferometers during strong scintillation (e.g. during solar bursts or\nsun rise/set) occur only rarely and are often discarded in analyzes.\n\n\fIonospheric Power-Spectrum Tomography in Radio Interferometry\nwith s2w = 1 − s2u + s2v for s2u + s2v ≤ 1 or s2w = −(s2u + s2v − 1)\notherwise. Complex values of sw lead to exponentially decaying (evanescent) electric fields that are typically not measurable far from the scatterer. The other (homogeneous)\nwaves are those measured by a distant observer. If one further uses\n#the Fourier transform of the scattering potential,\nΦ̃(s) =\nΦ(u)e−2πis*u d3 u, one can write the scattered electric field as\nXp \" 1\n(s)\nE1 (u) = i\nΦ̃(s − s0,n ) e2πis*u dsu dsv , (7)\nSn\nsw\nn\nwhere we assume a geometry where w = 0 is the groundplane below the ionosphere where n = 1, and that w > 0 is in\nthe direction of the zenith or the phase reference center (see\nbelow). The interferometer is placed in a plane defined at a\nconstant want = zant /λ. Typically one can assume want = 0.\nThence, one finds a relation between the Fourier transform\nof the observed electric field in the plane of the interferometer\nat want and the Fourier transform of the scattering potential\nXp\ni\nS n Φ̃(s − s0,i ),\n(8)\nẼ (s) (su , sv ) = e+2πisw want\nsw\nn\n! (s)\nwith Ẽ (s) (su , sv ) =\nE1 (u, v, want)e+2πi(su u+sv v) dudv. This\ncan be regarded as the Fourier transform of a two-dimensional\nslice through a three-dimensional scattered electric field. In\nthis paper we do not treat the case of an interferometer with\nvarying want . A planar array is an reasonable assumption for\nrelatively compact (i.e. km-scale) interferometers, but breaks\ndown on large scales where the curvature of the Earth can not\nbe neglected (see e.g. Carozzi & Woan 2009). For a planar\narray, however, the w-term due to the array can be neglected\nfor small integration times (i.e. instantaneous sampling of the\nelectric field in a plane), in contrast to visibilities from very\ndifferent time frames where the array has rotated over a substantial angle compared to the phase center (only a linear eastwest array does not suffer from the w-term).\nThe physical interpretation of Eqn.(8) is the following: Every point of the two-dimensional Fourier transform of the\nscattered electric field in the plane of an interferometer probes\na single three-dimensional mode of the scattering potential\n(i.e. the scattering medium) for a single point source. In the\npresence of N point sources, all in different directions, every\npoint of the two-diminsional Fourier transform of the scattered electric field in the plane of an interferometer probes the\nsum of N independent three-dimensional modes of the scattering potential. In Section 5 we show how to unravel this\ninformation.\n3. THE EFFECTS OF WEAK IONOSPHERIC SCATTERING ON\nINTERFEROMETRIC IMAGES\n\nIn radio interferometry one does not analyze the electric\nfield itself. In that case, Eqn.(8) would directly yield the threedimensional structure of the ionosphere (per integration time)\nbecause the phase information of the Fourier transform of the\nelectron density of the ionosphere is fully retained in the phase\ninformation of the scattered electric field. In reality, only the\ncross-correlations of the electric field, measured at different\nantennae pairs, are stored (i.e. the complex visibilities) and\nthe phase information of the ionospheric density fluctuations\nis lost. In the following, we assume that the total electric field\nfrom the entire sky (i.e. the antenna sensitivity is directionally independent) is measured over the infinite interferometer\nplane with w = want .\n\n3\n\nVisibilities are sampled from the cross-correlation of the\nelectric field E(u) = E (i) (u) + E (s) (u) with its complex conjugate, i.e. V(b) ≡ hE(u)E ∗ (u + b)it with b being the baseline\nbetween two points (antennae) in plane of the interferometer. The averaging is assumed to be over time. The Fourier\ntransform of the visibilities forms the incident intensity from\nthe sky, as follows from the van Cittert-Zernike theorem (e.g.\nCarozzi & Woan 2009). The same intensity is also the product\nof the Fourier transform of the electric field with its complex\nconjugate. A bit of algebra shows that the cross-correlation\nbetween the incident and scattered fields depends on the imaginary part of the zero-mode, Φ̃(0), of the ionosphere, and consequently is equal to zero. The multiplication of the Fourier\ntransform of the scattered electric field with its complex conjugate therefore provides the complete scattered intensity\nδI (s) (su , sv ) = hẼ (s)∗ (su , sv )Ẽ (s) (su , sv )it ,\n\n(9)\n\nwhere the dependence on want disappears. Using Eqn.(8), we\nfind the following result\n1 XX p\n(s)\nS n S m Φ̃∗ (s−s0,n )Φ̃(s−s0,m ). (10)\nδIcoh\n(su , sv ) = 2\nsw n m\nThis equation is exact for phase-coherent point sources to first\norder Born approximation. However, the sky is an incoherent\nemitter (see Mandel & Wolf 1965, for an exposure on the coherence properties of electric fields). Hence, the cross-terms\nwith n , m depend on the electric field coming from incoherent point sources and vanish, such that we are left with\n1 X\nδI (s) (su , sv ) = 2\nS n |Φ̃(s − s0,n )|2 ,\n(11)\nsw n\nwhere we dropped the subscript. This equation forms the basis for further discussions in the paper. The above equation is\nonly correct for an interferometer and an electric field measured in a plane. In three dimensions, one would no longer be\nable to use simple Fourier transforms (see below), because sw\ndepends explicitly on su and sv .\nTo understand the physical interpretation of the above equation, one might suppose a point source in the zenith (or equivalently in the phase center) emitting a plane wave in the absence of the ionosphere. Because the phase of the electric\nfield is the same at each antenna (by construction), its Fourier\ntransform yields a complex delta function in the zenith with\na time-varying phase. Multiplied with its complex conjugate,\nthis recovers the point source intensity. If a two-dimensional\nthin phase-screen is placed in between the source and the array, exhibiting a single wave-mode in electron density perpendicular to the zenith or phase reference center direction, then\npart of the electric field amplitude will be modulated such that\nits phases show to first order the imprint of this ionospheric\nwave-mode (see Ratcliffe 1956, for a wonderful description).\nThe modulated phase (i.e. a single wave over the array) can\nbe interpreted as being identical in the weak scattering limit\nto the modulated phase of a point source offset from the zenith\nin the direction of the ionospheric wave-vector by a distance\nset by the phase-frequency over the array.\nHence, a single ionospheric wave-mode scatters a fraction\nof a point source intensity into an additional point source (a\nspeckle), offset by the projected phase frequency onto the array and with an intensity proportional to the amplitude of the\nwave-mode squared. The sum of all speckles create a halo\n\n\f4\n\nKoopmans\n\nof scattered emission around the point source, when not corrected for through phase calibration.\n3.1. Speckle and Speckle Noise\n\nBecause the phase fluctuations of the electric field are measured in the plane of the array and are typically drawn from\na Gaussian random field realization from some (ensemble average) power spectrum, taking the Fourier tranform of this\nfield and multiplying it with its complex conjugate yields that\neach point source exhibits a diffuse \"halo\" of scattered intensity (e.g. Salpeter 1967; Cronyn 1972). Its Fourier transform\nis related to the usual phase structure function (Dφ ; see below). This pattern is referred to as \"speckle\" in optical (laser)\ninterferometry. We define the instantaneous ionospheric scattering PSF (ISP hereafter) as the sum of a delta function plus\nits scattered speckle pattern, re-normalized to a flux-density\nof unity such that flux is conserved in a convolution process.\nThe ISP is related to the Fourier transform of optical transfer\nfunction (Goodman 1985), determined by phase fluctuations\ninduced by the ionosphere. Eqn.(11) shows that the pointsource intensity is convolved with an ISP that reflects a curved\nsurface in the Fourier transform of the instantaneous ionospheric electron-density fluctuations. Disregarding a geometrically determined distortion that depends only on the angle of\nthe observed point on the sky away from the zenith, a threedimensional ionosphere causes a spatially varying convolution. In contrast, a thin two-dimensional ionospheric screen\ncauses a spatially invariant convolution. This sets our analysis\napart from most studies up to the present that have focussed on\nscattering by ionized media (see e.g. Narayan 1992, for an excellent review) where wide-field effects and extended (thick)\nscreens can be neglected in nearly all circumstances.\nFor ionospheric electron-density fluctuations set by Kolmogorov turbulence, one expects that |Φ̃(∆s)|2 ∝ |∆s|−β with\nβ = 11/3 over a scale of meters to tens of kilometers (e.g.\nThompson et al. 2001). This implies that in the weak scattering regime, point sources on average exhibit a speckle pattern\nwhich rapidly decreases in intensity with distance from the\nsource (Goodman 1985). The speckle pattern, at a given moment in time, is a Gaussian random realization from a powerspectrum with expectation value |Φ̃(∆s)|2 . Scattered flux is\nspread over scales from arcseconds to degrees, corresponding to tens of km to tens of meter-scale ionospheric electron\ndensity fluctuations, respectively. It is interesting to note that\nionospheric modes of a gives physical scale give rise to image\ndistortions that are visible only on baselines equal or larger to\nthat same physical scale. The properties of large isoplanatic\npatches over a given scales are therefore easier to determine\nif one can observe the sky with an array that exceeds that\nscale (see also e.g. Jacobson & Erickson 1992). Long baselines thus significantly help in calibrating shorter baselines,\neven if the science of interest is obtained on the short baselines4 .\nThe presence of a speckle pattern can have consequences.\nOnce the ISP reaches an intensity level comparable to the\naverage intensity of the surrounding sources, the confusion\nnoise, or the noise itself, one can no longer distinguish it from\nthese contaminants and calibration is typically limited to a\nmaximum k-mode. This could place a limit on the calibratibility of the instrument, especially at very low frequencies\n4 To correct for all modes in the field of view (θ\nFOV ), the longest baseline\nshould be b & 25 km × [Hion /(300 km)] * [θFOV /(5 deg)], where Hion is the\ntypical height of the ionoshere.\n\nnear the ionospheric cutoff, because the signal to noise ratio\nof an image snapshot, taken over the maximum time-scale of\nsubstantial ionospheric changes, might not be large enough to\ncorrect for low signal to noise speckles further away from the\nsources. This leaves residual speckles which are a function of\nwavelength (scaling with λ2 in strength and with λ in scale).\nA detailed calculation of the residual speckle intensity and\nits associated noise goes goes beyond the scope of the current paper. We note that these speckles do not average away\nover time but ultimately form a halo (i.e. \"seeing\") around\neach source. Whereas a bright source might be very useful\nin determining the ionospheric scattering, it might also leave\na residual speckle pattern in the image due to uncalibrated\nphase fluctuations from ionospheric scale below the smallest\nbaseline. It could therefore be advantageous to place bright\nsources near the half-power of the field of view such that they\nstill probe the same ionosphere to first order, but that their\nresidual speckle patterns do not contaminate the field of interest.\nSpeckle noise (i.e. the expected standard deviation from the\nexpectation value of the speckle intensity at a given point),\nhowever, does average away. To see this, we note that a convolution of the intensity implies a multiplication of the visibilities with the Fourier transform of the ISP. In the case of weak\nscattering and assuming a thin phase screen and small field\nof view, this multiplication function to first order is 1 − Dφ (θ)\nwhere the latter term is the phase structure function. Cronyn\n(1972) showed that the variance in the scattered part of the\nintensity is set by the amplitude of Dφ (θ) is to first order equal\nto the its expectation value. Hence speckle noise around point\nsources average away as one over the square root of the number of independent realizations of the ionosphere. Obviously\ncalibration can remove much of the speckle pattern, but not\nthat caused by the structure below the smallest and above the\nlongest baselines or below the noise level, respectively. This\nleftover halo of speckle can be compared to that in optical (after AO correction) in the search of faint companions around\nnearby stars (e.g. Racine et al. 1999). Speckle and speckle\nnoise ultimately set the detection threshold and a similar effect can play a role in very high dynamic range imaging at\nlow radio frequencies. We finally note that a convolution implies a suppression of visibilities on long baselines. In particular, if no calibration is applied for ionospheric effects, phases\non long baselines becomes less correlated and average out\nstronger (Bramley 1954) and a \"seeing\" halo develops around\npoint sources.\n4. VARIATION IN THE IONOSPHERIC SCATTERING PSF OVER THE\nFIELD OF VIEW\n\nIn the case of a single source in the phase-center and narrow\nfield of view over which sz changes little from zero, the ISP\naround a point source (assuming a perfectly sampled uv-plane\nor electric field) represents the instantaneous power-spectrum\nof the electron density fluctuations on a two-dimensional surface in three-dimensional Fourier space. In the case of a narrow FOV and a compact speckle pattern with sw → 0, this\npattern is nearly equal to the instantaneous two-dimensional\npower spectrum of the medium integrated along the line-ofsight, which has thus far motivated the use of a phase-screen\nor thin ionospheric model (e.g. Intema et al. 2009).\nTo assess how the ISP is modified when displaced from the\nphase reference center (see Thompson et al. 2001, usually the\ncenter of the antenna beam), we assume that the phase reference center is in the zenith, such that the w–axis points exactly\n\n\fIonospheric Power-Spectrum Tomography in Radio Interferometry\nupward and the uv–plane is perpendicular to it. The planar array lies at constant w as assumed thus far. It can be shown,\nhowever, that for any planar array, the coordinate system can\nbe rotated to any phase reference center. By correcting the\nphases of each of the antennas such that the fringe-rate is zero\nfor a chosen phase reference center, one effectively re-orients\nthe planar array such that it acts as being perpendicular to\nthe line connecting the array and the phase-reference center.\nHence, the analysis performed in the coordinate system with\nthe phase reference center in the zenith is in fact valid for any\nchosen phase-reference center for planar arrays by defining\nthe w-axis in that direction.\nWe now assume two point sources, one in the phase reference center at szenith = (0, 0, 1) and one slightly offset from the\nzenith at a unit vector ssrc , such that |ssrc − szenith | ≪ 1. One\ncan then Taylor expand the ISP to first order. To do this properly, however, one needs to compare two points that are offset\nfrom the two sources (on in the zenith and one offset from it)\nby an identical two-dimensional vector δs2D = (δsu , δsv ). In\nthat case, one compares the ratio of their aligned speckle patterns in the (su , sv ) plane. Furthermore, because the first two\n2 1/2\ncoordinates of s − ssrc = (δs2D , δsw − δssrc\n−\nz = (1 − |δs2D | )\nsrc 2 1/2\n(1 − |δs2D | ) ) are the same by construction for both sources,\nany difference occurs because of the dependence of the ISP on\nδssrc\nw and hence one only needs to Taylor expand Eqn.(11) for\na single point source with respect to changes in δssrc\n2D , which is\nthe offset of the source from the phase-center.\nAfter a bit of algebra one finds that the fractional intensity\ndifference between the offset ISP divided by the one in the\nphase center is\n\n\np\n\n2 δssrc\n1 − |δs2D |2 ∂|Φ̃(t)|2 \n(s)\n2D * δs2D \n\nfI (δs2D ) ≈\n1 −\n (12)\n∂tz \n1 − |δs2D |2 \n2|Φ̃(t)|2\nwith the derivative of\np the power-spectrum being evaluated at\nthe point t = (δs2D , 1 − |δs2D |2 − 1). The length of δs2D does\nnot necessarily have to be much smaller than unity because so\nfar we only expanded in δssrc\n2D . If we further assume that also\n|δs2D | ≪ 1 then the equation further simplifies to\n\"\n#\n∂ln |Φ̃(t)|2\n1\n−\n*\nδs\nfI(s) (δs2D ) ≈ 2 δssrc\n.\n(13)\n2D\n2D\n2 ∂tz\n\nThe ISP is therefore no longer spatially invariant but starts\nto depend on the power-spectrum of the ionosphere in the wdirection and on the offset of the source from the phase reference center. Whereas to first order the ISP remains identical to\nthat of a thin phase-screen, the large-scale structure (i.e. with\ntw ≈ 0) of the ionosphere in the w-direction becomes important because ∂|Φ̃(t)|2 /∂tz , constant for a thick ionosphere.\nBecause this additional term depends strongest on the large\nscale w-modes, we expect this term to be rather insensitive\nto relative small changes in ssrc\n2D and show slower diurnal and\nseasonal variations.\nIf, instead of working with the image δI (s) (su , sv ), we work\nwith δJ (s) (su , sv ) = s2w δI (s) (su , sv ) (see also Section 5.2), the\nfractional difference is\n\np\n 1 − |δs2D |2 ∂|Φ̃(t)|2 \n(s)\nsrc\nf J (δs2D ) ≈ −(δs2D * δs2D ) \n\n∂tz \n|Φ̃(t)|2\n#\n\"\n∂ln |Φ̃(t)|2\nsrc\n(14)\n≈ −(δs2D * δs2D )\n∂tz\nA physical interpretation of this is the following: when ob-\n\n5\n\nserving away from the phase center, one becomes sensitive to\nlarge scale modes in the w-direction. This causes a gradient in\nthe electron density over a scale that corresponds to depth of\nthe ionosphere along the line of sight to the source projected\nonto the array. For small angles away from the phase center\nthis projected baseline is small and interference between the\nopposite parts of the ionosphere is not symmetric. This results\nin large scale interference patterns on the plane of the array.\nThese patterns correlated strongest on long baselines and thus\nshow up as small scale structure in the ISP, i.e. near the point\nsources. We note that in the case of a thin ionosphere, which\nhas ∂ ln |Φ̃(t)|2/∂tw ≡ 0, the ISP is spatially invariant to all\norders.\nThe interpretation of Eqn.(14) is that offsets, s2D , perpendicular to ssrc\n2D lead to a zero fractional difference, whereas\nparallel offsets lead to maximal differences (either positive of\nnegative). This implies that to lowest order the ISP is invariant in the tangential direction when moved from the phase\ncenter on radial spokes and is stretched or squeezed in the\nradial direction further away from the phase-center, depending on the gradient of the ionospheric power-spectrum in the\nw-direction. Eqn.(14) can thus be used to determine the ISP\nover a wider field of view, taking the first-order effect of the\nthickness of the ionosphere into account. By having several\ncalibrators spread over the field of view, one can determine\nthe nearly constant value of ∂ ln |Φ̃(t)|2 /∂tw . Once known, the\nISP can be determined to lowest order for the rest of the field\nof view by simple rescaling.\nTo estimate the effect of the thickness of the ionosphere let\nus assume it has a thickness dλ in units of wavelength and\na uniform electron density in the w-direction. The normalized power-spectrum in sw direction has the functional form\n|Φ̃(tw )|2 = (dλ /π) × sinc2 (dλ tw ). Inserting this in Eqn.(14) and\nTaylor expanding to lowest order yields, along radial spokes,\nf J(s) ≈ (π/3) dλ |δs2D |3 |δssrc\n2D |. We note that even though the\nfractional changes in the ISP are smaller near the sources5 ,\nthe absolute changes are larger because of the steep increase\nof the power spectrum, i.e. |Φ̃(δs2D )|2 × f J(s) ∝ |δs2D |−3/2 |δssrc\n2D |\nfor β = 11/3 i.e. a Kolmogorov spectrum. Note that this equation breaks down near the outer scale (i.e. whose effect shows\nup closest to the images) of the ionosphere otherwise it would\nnot be bounded.\n5. THREE DIMENSIONAL IONOSPHERIC POWER-SPECTRUM\nTOMOGRAPHY\n\nAfter having derived an equation in the previous section\nthat describes the scattering of point sources due to the threedimensional ionosphere, here we introduce the equivalent expression for a continuous intensity field and then discuss the\nconsequences of these results for ionospheric calibration.\n5.1. Scattering of a Continuous Intensity Field\nOne can simply extend the point-source equation for scattering (Eqn.(11)) to a convolution-type operation on a continuous intensity field by relating flux-density with intensity\n5 Numerically we find f (s) ∼ 10−2 (d /105 ) |δs /10′ |3 |δssrc /10◦ |. As\nλ\n2D\nJ\n2D\nexample, for an ionosphere with 200 km thickness and observed at 2 meter\nwavelength, the ISP about 10′ away from sources near the edge of a 10 degree\nfield of view changes by ∼1% of the ISP maximum. This might seem small,\nbut could still be considerably larger than the noise or confusion level for\nbright sources in the field. Hence, in high dynamic range and wide field of\nview imaging experiments the third dimension of the ionosphere becomes\nvery important.\n\n\f6\n\nKoopmans\n\ntimes area. In that case one readily sees that\n\"\n1\nδI (s) (su , sv ) = 2\nI (i) (s0,u , s0,v ) |Φ̃(s − s0 )|2 ds0,u ds0,v .\nsw\n(15)\nWe note that this is a two-dimensional convolution with a\nthree dimensional kernel. This makes it more difficult to deconvolve using simple two-dimensional Fourier techniques.\nFor a small field of view, one can simply set sw − s0,w = 0 and\nperform a two dimensional convolution through fast Fourier\ntransform methods. For wider fields of view this can not be\ndone. However, one can rewrite the equation as a three dimensional convolution as follows\n$\n1\n(i)\n(s0 ) δk (δsw )|Φ̃(s − s0 )|2 ds0 ,(16)\nI3D\nδI (s) (s x , sy ) = 2\nsw\nwhere δsw = s0,w − (1 − s20,u − s20,v )1/2 and δk is a Kronecker\ndelta function. Note that in this equation s0 should no longer\nbe treated as a unit vector but still that (1 − s20,u − s20,v ) ≥ 0.\n(i)\nThe intensity I3D\n(s0 ) is a cylinder of radius unity that has the\nsame value as I (i) (s0,u , s0,v ) for each value of sw . Writing the\nequation like this, makes it a three dimensional convolution\nwhich can be performed using Fourier transform techniques,\nbut at the cost of more memory and computational effort.\n5.2. Determination of the Three-Dimensional Ionospheric\n\nPower Spectrum\nHere we derive an expression for the full ionospheric power\nspectrum in terms of the scattered intensity field and the incident field. To do this, first we define the rescaled version of\nthe scattered intensity as\n(17)\nδJ (s) (su , sv ) ≡ s2w * δI (s) (su , sv ),\n!\n(s)\n(s)\n+2πi(s\nu+s\nv)\nu\nv\nand δ J ̃ (u, v) =\nδJ (su , sv )e\ndsu dsv as its\nFourier transform. We note that the scattered intensity is zero\nif s2u + s2v > 1. If we now define (see e.g. Sramek & Schwab\n1989; Cornwell & Perley 1992, for a similar approach for\nnon-coplanar arrays6 )\nq\n(i)\n(i)\n(s0 ) * δ(s0,w − 1 − s20,u − s0,v ),\n(s0 ) ≡ I3D\nJ3D\n(18)\nwe obtain\nδJ (s) (su , sv ) =\n\n$\n\n(i)\nJ3D\n(s0 ) |Φ̃(s − s0 )|2 ds0 .\n\n(19)\n\nWe note that this equation can be integrated over infinity, as\nlong as the intensities are zero (as they are) when |s0 | > 1. Using the relation between convolution and Fourier transforms,\nwe can now write this as\n(i)\nδ J ̃(s) (u, v) = J ̃3D\n(u) * F (|Φ̃(s)|2 )(u)\n(20)\n#\n(i)\n(i)\nwith J ̃3D\n(u) =\nJ3D\n(s0 )e−2πis0 *u ds0 and F (|Φ̃(s)|2 ) being the\nautocorrelation function of the ionospheric scattering function. This remarkable equation shows that the two dimensional field δ J ̃(s) (u, v) contains information about the full three\ndimensional structure of the ionosphere if a reference field\n6 Only after having introduced this transformation, the author became\naware of a similar transformation in these publications. Whereas the later\nassume a three-dimensional (i.e. non-planar) array, the focus in the current\npaper is deriving the structure of the three-dimensional (non-planar) ionosphere with a planar array. Combining both is left for a future publication.\n\n(i)\n(u) is available; this is closely related to the technique of\nJ ̃3D\n\"holography\". We can now go one step further and show after\na little algebra that\n(i)\n(u) = I ̃(i) (u, v) ⊗ H(u, v; w).\nJ ̃3D\n\n(21)\n\nbeing a two-dimensional convolution, with w as control parameter. The function\nZ 1\n√\n2\ne−2πiw 1−s J0 (s * u2D ) s ds,\nH(u, v; w) = 2π\n(22)\n0\n\n√ 2 2\n√\nwith u2D = u2 + v2 is a Hankel transform of e−2πiw 1−su −sv .\nPutting this all together, we find the final result\n\"\n#\nδ J ̃(s) (u, v)\n2\n−1\n|Φ̃(s)| = F\n.\n(23)\nI ̃(i) (u, v) ⊗ H(u, v; w)\nHence, the three dimensional power spectrum of the ionosphere or its autocorrelation function can be reconstructed\nfrom the ratio between the Fourier transform of the rescaled\nscattered intensity field and the Fourier transform of the incident radiation field convolved with a Hankel function.\nSo what does Eqn.(23) mean? Looking carefully at the\nequation, we see that H(u, v; w) is the Fourier transform of\na unit phasor with a phase that is determined by the distance (in wavelength) from a half-sphere of radius w to the uv\nplane along a line perpendicular to the latter. In other words,\nH(u, v; w) act as the Fourier transform of a complex optical\ntransfer function in the pupil plane (see e.g. Goodman 1985),\nwhich in this case is the full sky and not (as usual) the interferometer plane itself. Equivalently, H(u, v; w) acts as a complex\npoint spread function in uv space (i.e. convolving I ̃(i) (u, v)).\nTurning this around, a convolution in uv space is a multiplication of the sky intensity with the reciprocal of the convolution\nkernel. Hence, H(u, v; w) causes a complex beam of unit amplitude on the sky equal to the phasor in Eqn(22). This exactly\nextracts the information from δ J ̃(s) (u, v) on a particular w-slice\ncut through the three dimensional autocorrelation function of\nthe ionosphere. Hence by simply multiplying the sky model\nI (i) (su , sv ) with the complex phasor in Eqn.(22) one obtains a\ncomplex sky-intensity cube. Fourier transforming this back\nslice by slice provides the denominator in Eqn.(23).\nTo illustrate this further, imagine that the sky contains only\none point source of unit flux-density at (s0,u , s0,v ). In that case,\n\n\n\n\nδ J ̃(s) (u, v)\n2\n(24)\nF (|Φ̃(s)| ) = \n√ 2 2  .\ne−2πi(s0,u u+s0,v v+w 1−su,0 +sv,0 )\nSubstituting Eqn.(16) back into this equation shows that the\nleft and right-hand sight of the equation are identical as required. By bringing the denominator to the left side of the\nequation, we find for a point source\nh\ni\n2\n(25)\nΦ̃(s − s0 ) = F −1 δ J ̃(s) (u, v) ,\nThis is the inversion of Eqn.(11) for a single point source.\nHence every point source in the sky probes the ionospheric\npower spectrum on an Ewald sphere of reflection. The full\nsky probes the power spectrum of the ionosphere, as encoded\nin Eqn.(23), on the surface of many offset Ewald spheres of\nreflection, each of unit radius. The function H endows each\npoint in the sky with a complex phase. In correspondence with\nthe Fourier shift theorem (i.e. a phase shift corresponds to a\nspatial shift) this point is then moved in to the third dimension\n\n\fIonospheric Power-Spectrum Tomography in Radio Interferometry\nof power-spectrum which corresponds to the w-direction of\nthe ionosphere7.\n5.3. The effects of the beam, uv sampling\nRealistic interferometers neither observe the full sky, nor\nsample the electric field in the full plane of the array. If we\ndefine the complex electric field beam pattern as B(su , sv ) and\nthe sampling function of the electric field on the plane of the\ninterferometer (i.e. usually delta functions at the positions of\nthe antennae) as P(u, v) and its Fourier transform as P̃(su , sv ),\nthen Eqn.(23) for incoherent emitters can be rewritten as:\n!\nh\ni\n|B|2\n(s)\n2\n2\n(i)\n ̃\n ̃\n, (26)\nδ J = F (|Φ̃| ) × F (|P̃| ) × (I ⊗ H) ⊗ F\ns2w\n\nwhere we suppressed the explicitly dependence of the functions on the (su , sv , sw ) or (u, v, w). The equation holds for\neach given w. The usual two dimensional array point spread\nfunction (i.e. dirty beam) is denoted by |P̃|2 and its Fourier\ntransform is the visibility sampling function in the uv plane.\nSimilarly, |B|2 is the usual two dimensional antenna beam pattern. This equation shows clearly that the visibilities of the\nincident intensity field are both multiplied with the Fourier\ntransforms of power-spectrum of the ionosphere and that of\nthe uv sampling function, respectively. The resulting field\nis then convolved with the Fourier transform of the rescaled\nbeam pattern, which to first order (if the beam is much smaller\nthan the full sky) is the aperture gain pattern of the antennae.\nTo derive |Φ̃|2 ) from this equation thus requires deconvolution of the observed visibilities of the scattered intensity field.\nThis could be difficult in principle were it not for the fact that\nthe beam size in general is much larger than the extent of the\nISP and the dirty beam. In that case the scale over which\nF (|Φ̃|2 ) × F (|P̃|2 ) varies is very large compared to the convolution kernel and the latter can be neglected for modes much\nsmaller than the field of view. Hence in practice it is expected\nthat the deconvolution is not really required to obtain an accurate evaluation of the power-spectrum (i.e. |Φ̃|2 ).\n6. CONNECTION TO THE PHASE SCREEN\n\nWhereas in this paper we started our discussion from the\nBorn approximation and derived the scattered field, this is\nonly a valid approach in the weak scattering scattering or\nweak scintillating regime. Despite this approximation, it is\nremarkably accurate up to intensity fluctuations very close to\nunity. However, there are other ways to solve for the scattered\nelectric field (e.g. Kravtsov 1992, for a detailed review) in the\nweak scattering regime that are closely connected to the formalism as introduced above and to the phase-screen approach.\nInstead of looking at every point of the medium as a source\nof a single scattering (as is done in the Born approximation),\none can also assume that the medium does not modify the amplitude of the incident wave to first order and that light rays\n7 The phase in the phasor changes by 2π when wsδs ≈ 1. If the maximum\nof s is set by the field of view and δs ∼ λ/umax by the resolution of the array,\nthe heigh w to which the ionosphere can be probed is wmax ≈ 1/(sδs) above\nwhich phases wrap around multiple times inside a resolution element in the\nimage (i.e. information is being lost). Taking a typical field of view of ∼5\ndegrees and resolution of 3 arcmin (for an array of 2-3 km diameter) leads to\na maximum high of wmax λ ≈ 25, 000 m for λ = 2 m. Structure at ten times\nthat height, where the ionosphere typically is densest, is encoded in the image\non scales ten times below the resolution limit. Hence, baselines well beyond\n20-30 km are required to fully extract the three dimensional structure of the\nionosphere and its effect on the scattering in the image. One also finds that\nthe scale over which the ISP will change is s ∼ umax /wmax . This is typically\ntens of degrees for the ionosphere and arc-minutes in the optical.\n\n7\n\ntravel on a straight line through the medium. In that case,\nsince the medium does not absorb or amplify the wave, only\na phase shift occurs between different points in the medium\nwhen a plane wave enters the ionosphere.\nWe can again describe this in terms of the refractive\nR index or\nelectron density as follows. A phase shift of δψ ≈ k δn(r) ds\nis introduced between a wave traveling in a medium with refractive index 1 + δn(r) and unity, respectively, where the integral is carried out along a straight line through the medium\n(see e.g. Lutomirski & Yura 1971). A plane wave of a source\nwith unit amplitude entering medium exits as a wave with a\n\"wrinkled\" phase-front due to varying refractive indices along\ndifferent paths (Cronyn 1972). The auto-correlation of this\n\"phase-screen\" is the function with which the visibilities of\nthat source are multiplied in the uv-plane and its Fourier transform is the ISP as we discussed it before. This allows us to\ndirectly connect the previous analysis with that of the phasescreen through the so-called Radon transform, which is related to the Fourier projection-slice theorem.\nThe Fourier projection-slice theorem (Bracewell 1986), in\nour context, states that the two-dimensional Fourier transform\nof the Radon projection (Deans 1983), along straight lines, of\na three-dimensional medium equals a two-dimensional slice\n(perpendicular to the projection direction) through the threedimensional Fourier transform of the object. We now note that\nthe phase-screen, up to a constant, is in fact a two-dimensional\nprojection of the refractive index δn(r) in three dimensions.\nHence the Fourier transform of the phase-screen is simply a\ntwo-dimensional slice through the three-dimensional Fourier\ntransform of the refractive index δn(r) of the medium. The autocorrelation of the phase-screen as measured in the uv-plane\nis then a slice through the three dimensional power spectrum\nof the refractive index, hence that of the electron density distribution. We immediately see the connection to the discussion in Section 5 and how this connects to Eqn.(11). Since\npoint-sources in different directions project the three dimensional power-spectrum differently on the uv-plane, they probe\ndifferent slices through the power-spectrum. Disregarding the\ngeometric curvature terms, this slice is the tangent plane to the\nEwald sphere of influence at the point s − s0 which for small\nvectorial differences are all slices through s − s0 = (0, 0, 0),\nwhich is exactly the Fourier projection-slice theorem.\nObserving over a wide field of view allows one to\nbuild of a three-dimensional electron density power-spectrum\nfrom these different slices. Obviously the measured autocorrelation of the phases are the result of many point sources\nand need to be disentangled. This was discussed in Section 5\nin detail and is identical in the current situation. Thence, the\nphase-screen approach extended to three dimensions is completely identical to the approach taken in this paper.\n7. RESULTS AND CONCLUSIONS\n\nA tomographic method has been introduced that allows\nto quantify the three-dimensional power-spectrum of the\nionospheric electron-density fluctuations based on radiointerferometric observations by a two-dimensional planar array. The goal has been to provide a more complete and physically intuitive description of the effects of the full three dimensional ionosphere over a wide field of view on radiointerferometric images, without any approximations about either a small field of view and/or a thin ionospheric slab (i.e.\nphase screens). Neither is expected to be sufficiently accurate in upcoming high dynamic range observations with low\nfrequency arrays. The description is valid to first-order Born\n\n\f8\n\nKoopmans\n\napproximation, which holds well for frequencies well above\nthe plasma frequency of the ionosphere. Second order corrections are typically several orders of magnitude below first\norder corrections at frequencies & 100 MHz. However, we\nstress that the method is only valid for weak scattering and\nthat higher order corrections are needed if the refractive index\napproaches unity. The main results and conclusions are:\n1. When modeling the ionosphere, it should not be the\nionospheric electron density distribution that is is primary structure to model, but its autocorrelation function or equivalent its power-spectrum. Any information about the phase structure of the ionospheric electron density distribution is lost in the cross-correlation\nof the electric field when obtaining the visibilities.\n2. A three-dimensional ionosphere causes a spatially varying convolution of the sky (at second order level),\nwhereas a two-dimensional phase-screen or a thin ionosphere results in a spatially invariant convolution. Ionospheric structure in the w-direction causes, to lowest order, radial stretching or squeezing of the ionospheric\nscattering point spread function but leaves its tangential structure invariant. Correcting for the thickness of\nthe ionosphere can thus be reduced (to lowest order) to\ndetermining a single number, i.e. the level of stretching\nor squeezing.\n\nWhereas in this paper no direct implementation of an algorithm is given on how to calibrate the ionosphere, a more\nphysically intuitive picture was presented that goes beyond\nthe single (or multiple) phase screen models of the ionosphere\nand is valid in the presence of a full three dimensional ionosphere and full-sky field of view. A mathematical expression was presented that shows that the ionosphere causes a\nspatially varying point spread function (at the second order\nlevel) over the field of view, determined by the instantaneous\nthree-dimensional power spectrum of the ionospheric electron density fluctuations. Subsequently this expression was\ninverted, showing that through a \"holographic\" principle one\ncan extract information about the three-dimensional structure\nof the ionosphere from only electric field measurements on\na two dimensional plane. In forthcoming work it remains\nto be investigated whether these results can be implemented\nin a practical algorithm in the context of the measurement\nequation (see e.g. Matejek & Morales 2009) in order to calibrate visibilities without assumptions about thin ionospheric\nphase screens, and by using instead the full three dimensional power-spectrum of the ionosphere (i.e. \"tomographic\nself-calibration\").\nL.K. is supported through an NWO-VIDI program subsidy.\nThe author also acknowledges Saleem Zaroubi, Rajat Thomas\nand Ger de Bruyn for very useful and clarifying discussions.\nREFERENCES\n\n3. Residual speckle, which can not be corrected in short\ntime integrations, causes a diffuse intensity halo around\nbright sources beyond a certain distance from the\nsource. Whereas longer integrations probe more of the\ntotal scattered flux of the ISP, because of its very steep\nintensity decline away from the source, these longer\nintegrations also cause smearing of the instantaneous\nspeckle pattern due to variations of the ionosphere. This\nhalo (\"seeing\") and related speckle noise might therefore pose a fundamental limitation on the ability to\nreach the thermal noise level in interferometers at very\nlow frequencies after long total integrations.\n4. Long baselines substantially help in correcting for the\neffects of the largest wave modes of the ionosphere, as\nseen inside the field of view of typical interferometers,\nas well as for its three dimensional structure in the wdirection. The reason is that these large scale modes\ncause a small-scale diffraction pattern and thus show\nup in the image on small angular scales that can only\nbe resolved on long baselines (i.e. of a size equal or\nlarger than the projected scale of the wave mode).\n5. An exact mathematical expression is derived that provides the power-spectrum of the ionospheric electrondensity fluctuations from a rescaled scattered intensity\nfield and an incident intensity field convolved with a\ncomplex unit phasor defined on the full sky pupil plane.\nThis is related to a holographic principle. In the limit\nof a small field of view, the method reduces to the usual\nthin-phase screen approximation. It is also shown,\nthrough the application of a Radon projection and the\nFourier projection-slice theorem that the extension of\nthe phase-screen approach to three dimensions is identical to the introduced tomographic method.\n\nBorn, M., & Wolf, E. 1999, Principles of Optics, ed. Born, M. & Wolf, E.\nBourgois, G. 1981, A&A, 102, 212\nBracewell, R. N. 1986, The Fourier Transform and its applications, ed.\nBracewell, R. N.\nBramley, E. N. 1954, Royal Society of London Proceedings Series A, 225,\n515\nCarozzi, T. D., & Woan, G. 2009, MNRAS, 395, 1558\nCohen, A. S., & Röttgering, H. J. A. 2009, AJ, 138, 439\nCornwell, T. J., & Perley, R. A. 1992, A&A, 261, 353\nCronyn, W. M. 1972, ApJ, 174, 181\nDeans, S. R. 1983, New York: John Wiley & Sons\nEwald, P. P. 1969, Acta Crystallographica Section A, 25, 103\nGoodman, J. W. 1985, Statistical Optics, ed. Goodman, J. W.\nHamaker, J. P., Bregman, J. D., & Sault, R. J. 1996, A&AS, 117, 137\nHewish, A. 1951, Royal Society of London Proceedings Series A, 209, 81\n-. 1952, Royal Society of London Proceedings Series A, 214, 494\nIntema, H. T., van der Tol, S., Cotton, W. D., Cohen, A. S., van Bemmel,\nI. M., & Röttgering, H. J. A. 2009, A&A, 501, 1185\nJacobson, A. R., & Erickson, W. C. 1992, A&A, 257, 401\nKravtsov, Y. A. 1992, Reports on Progress in Physics, 55, 39\nLiu, A., Tegmark, M., Morrison, S., Lutomirski, A., & Zaldarriaga, M. 2010,\nArXiv e-prints\nLonsdale, C. J. 2005, in Astronomical Society of the Pacific Conference\nSeries, Vol. 345, Astronomical Society of the Pacific Conference Series,\ned. N. Kassim, M. Perez, W. Junor, & P. Henning, 399–+\nLutomirski, R. F., & Yura, H. T. 1971, Appl. Opt., 10, 1652\nMandel, L., & Wolf, E. 1965, Reviews of Modern Physics, 37, 231\nMatejek, M. S., & Morales, M. F. 2009, ArXiv e-prints\nNarayan, R. 1992, Royal Society of London Philosophical Transactions\nSeries A, 341, 151\nPearson, T. J., & Readhead, A. C. S. 1984, ARA&A, 22, 97\nRacine, R., Walker, G. A. H., Nadeau, D., Doyon, R., & Marois, C. 1999,\nPASP, 111, 587\nRatcliffe, J. A. 1956, Reports on Progress in Physics, 19, 188\nSalpeter, E. E. 1967, ApJ, 147, 433\nSramek, R. A., & Schwab, F. R. 1989, in Astronomical Society of the Pacific\nConference Series, Vol. 6, Synthesis Imaging in Radio Astronomy, ed.\nR. A. Perley, F. R. Schwab, & A. H. Bridle, 117–+\nThompson, A. R., Moran, J. M., & Swenson, Jr., G. W. 2001, Interferometry\nand Synthesis in Radio Astronomy, 2nd Edition, ed. Thompson, A. R.,\nMoran, J. M., & Swenson, G. W., Jr.\nWeyl, H. 1919, Annalen der Physik, 365, 481\nWolf, E. 1969, Optics Communications, 1, 153\n\n\f"}