{"id": "http://arxiv.org/abs/0902.4745v1", "guidislink": true, "updated": "2009-02-27T02:30:21Z", "updated_parsed": [2009, 2, 27, 2, 30, 21, 4, 58, 0], "published": "2009-02-27T02:30:21Z", "published_parsed": [2009, 2, 27, 2, 30, 21, 4, 58, 0], "title": "Probing the pairing symmetry of the iron pnictides with electronic Raman\n  scattering", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0902.4745%2C0902.0148%2C0902.0560%2C0902.2549%2C0902.1978%2C0902.4824%2C0902.2421%2C0902.0931%2C0902.3816%2C0902.1705%2C0902.4713%2C0902.4301%2C0902.4822%2C0902.1348%2C0902.4362%2C0902.4311%2C0902.4610%2C0902.3366%2C0902.1747%2C0902.4084%2C0902.2037%2C0902.0650%2C0902.1666%2C0902.2055%2C0902.0188%2C0902.4559%2C0902.0478%2C0902.4009%2C0902.3382%2C0902.3554%2C0902.4274%2C0902.2489%2C0902.4801%2C0902.3965%2C0902.4305%2C0902.2517%2C0902.4749%2C0902.2312%2C0902.2974%2C0902.1137%2C0902.3875%2C0902.1788%2C0902.4731%2C0902.3128%2C0902.4900%2C0902.1147%2C0902.1124%2C0902.1805%2C0902.3733%2C0902.0677%2C0902.1886%2C0902.3491%2C0902.2314%2C0902.4125%2C0902.3009%2C0902.0658%2C0902.1265%2C0902.4338%2C0902.3801%2C0902.3038%2C0902.2171%2C0902.3188%2C0902.1830%2C0902.0879%2C0902.2244%2C0902.0639%2C0902.0489%2C0902.0088%2C0902.0399%2C0902.0966%2C0902.2326%2C0902.0266%2C0902.1387%2C0902.3994%2C0902.2056%2C0902.3917%2C0902.4778%2C0902.3952%2C0902.0826%2C0902.3537%2C0902.4493%2C0902.3872%2C0902.2320%2C0902.0800%2C0902.3738%2C0902.1163%2C0902.0398%2C0902.0642%2C0902.3881%2C0902.3727%2C0902.3518%2C0902.2194%2C0902.3624%2C0902.1535%2C0902.4690%2C0902.0709%2C0902.3136%2C0902.2875%2C0902.2715%2C0902.3490%2C0902.2470&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Probing the pairing symmetry of the iron pnictides with electronic Raman\n  scattering"}, "summary": "An important issue in the study of the iron-arsenic based superconductors is\nthe symmetry of the superconducting gap, a problem complicated by multiple gaps\non different Fermi surface sheets. Electronic Raman scattering is a flexible\nbulk probe which allows one in principle to determine gap magnitudes and test\nfor gap nodes in different regions of the Brillouin zone by employing different\nphoton polarization states. Here we calculate the clean Raman intensity for\n$A_{1g}$, $B_{1g}$ and $B_{2g}$ polarizations, and discuss the peak structures\nand low-energy power laws which might be expected for several popular models of\nthe superconducting gap in these systems.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0902.4745%2C0902.0148%2C0902.0560%2C0902.2549%2C0902.1978%2C0902.4824%2C0902.2421%2C0902.0931%2C0902.3816%2C0902.1705%2C0902.4713%2C0902.4301%2C0902.4822%2C0902.1348%2C0902.4362%2C0902.4311%2C0902.4610%2C0902.3366%2C0902.1747%2C0902.4084%2C0902.2037%2C0902.0650%2C0902.1666%2C0902.2055%2C0902.0188%2C0902.4559%2C0902.0478%2C0902.4009%2C0902.3382%2C0902.3554%2C0902.4274%2C0902.2489%2C0902.4801%2C0902.3965%2C0902.4305%2C0902.2517%2C0902.4749%2C0902.2312%2C0902.2974%2C0902.1137%2C0902.3875%2C0902.1788%2C0902.4731%2C0902.3128%2C0902.4900%2C0902.1147%2C0902.1124%2C0902.1805%2C0902.3733%2C0902.0677%2C0902.1886%2C0902.3491%2C0902.2314%2C0902.4125%2C0902.3009%2C0902.0658%2C0902.1265%2C0902.4338%2C0902.3801%2C0902.3038%2C0902.2171%2C0902.3188%2C0902.1830%2C0902.0879%2C0902.2244%2C0902.0639%2C0902.0489%2C0902.0088%2C0902.0399%2C0902.0966%2C0902.2326%2C0902.0266%2C0902.1387%2C0902.3994%2C0902.2056%2C0902.3917%2C0902.4778%2C0902.3952%2C0902.0826%2C0902.3537%2C0902.4493%2C0902.3872%2C0902.2320%2C0902.0800%2C0902.3738%2C0902.1163%2C0902.0398%2C0902.0642%2C0902.3881%2C0902.3727%2C0902.3518%2C0902.2194%2C0902.3624%2C0902.1535%2C0902.4690%2C0902.0709%2C0902.3136%2C0902.2875%2C0902.2715%2C0902.3490%2C0902.2470&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "An important issue in the study of the iron-arsenic based superconductors is\nthe symmetry of the superconducting gap, a problem complicated by multiple gaps\non different Fermi surface sheets. Electronic Raman scattering is a flexible\nbulk probe which allows one in principle to determine gap magnitudes and test\nfor gap nodes in different regions of the Brillouin zone by employing different\nphoton polarization states. Here we calculate the clean Raman intensity for\n$A_{1g}$, $B_{1g}$ and $B_{2g}$ polarizations, and discuss the peak structures\nand low-energy power laws which might be expected for several popular models of\nthe superconducting gap in these systems."}, "authors": ["G. R. Boyd", "T. P. Devereaux", "P. J. Hirschfeld", "V. Mishra", "D. J. Scalapino"], "author_detail": {"name": "D. J. Scalapino"}, "author": "D. J. Scalapino", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1103/PhysRevB.79.174521", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/0902.4745v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0902.4745v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "9 pages, 9 figures", "arxiv_primary_category": {"term": "cond-mat.supr-con", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cond-mat.supr-con", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "cond-mat.mtrl-sci", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0902.4745v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0902.4745v1", "journal_reference": "Phys. Rev. B 79, 174521 (2009)", "doi": "10.1103/PhysRevB.79.174521", "fulltext": "Probing the pairing symmetry of the iron pnictides with electronic Raman scattering\nG. R. Boyd,1 T. P. Devereaux,2, 3 P. J. Hirschfeld,1 V. Mishra,1 and D. J. Scalapino4\n1\n\narXiv:0902.4745v1 [cond-mat.supr-con] 27 Feb 2009\n\n3\n\nDepartment of Physics, University of Florida, Gainesville, FL 32611, USA\n2\nStanford Institute for Materials and Energy Sciences,\nSLAC National Accelerator Laboratory, 2575 Sand Hill Road, Menlo Park, CA 94025\nGeballe Laboratory for Advanced Materials, Departments of Physics and Applied Physics, Stanford University, CA 94305.\n4\nDepartment of Physics, University of California, Santa Barbara, CA 93106-9530 USA\nAn important issue in the study of the iron-arsenic based superconductors is the symmetry of\nthe superconducting gap, a problem complicated by multiple gaps on different Fermi surface sheets.\nElectronic Raman scattering is a flexible bulk probe which allows one in principle to determine gap\nmagnitudes and test for gap nodes in different regions of the Brillouin zone by employing different\nphoton polarization states. Here we calculate the clean Raman intensity for A1g , B1g and B2g\npolarizations, and discuss the peak structures and low-energy power laws which might be expected\nfor several popular models of the superconducting gap in these systems.\nPACS numbers:\n\nI.\n\nINTRODUCTION\n\nSince their discovery1, there has been a considerable\neffort to understand the origin and nature of superconductivity in iron-pnictide materials (for early reviews see\nRefs. 2–4). Initial information on the structure of the\ngap is often provided by power laws in the temperature\ndependence of thermodynamic and transport properties,\nwhich are related to the topology of the superconducting gap in its nodal regions. Nuclear magnetic resonance\n(NMR) studies5–8 showed a low temperature T 3 spin lattice relaxation rate typical of a gap with nodes. However,\npenetration depth measurements9–15 have been fit both\nto exponential activated T -dependence, indicative of a\nfully gapped state, and low-T power laws. ARPES measurements on single crystals of 122-type materials16–21\nmeasured the spectral gap reporting isotropic or nearly\nisotropic gaps on all Fermi surface sheets. It is possible\nthat these differences reflect genuinely different ground\nstates in different materials. However, the complex interplay of multiband effects, unconventional pairing, and\ndisorder leaves open the possibility that a single ground\nstate symmetry exists in all the Fe-pnictides, and that\ndifferences in measured properties can be understood\nby accounting for electronic structure differences and\ndisorder22,23 . It is likely that a consensus will be reached\nonly after careful measurements using various probes on\nthe same material, and systematic disorder studies.\nWe argue here that measurement of the electronic Raman scattering in the superconducting state can provide\nimportant information on the structure of the bulk superconducting order parameter through its sensitivity to\nboth symmetry and gap scales. Here we discuss the Raman scattering for some simple models of the Fe-pnictide\nsuperconductors. In general the energy of the peaks in\nthe Raman intensity are directly related to the magnitude of the gaps on the various Fermi sheets. However,\nwhether a given Raman polarization weights a given gap\nstrongly or weakly depends on the polarization state of\nthe measurement via the Raman vertex γk . This is par-\n\nticularly important for superconductors where the gap is\nstrongly momentum dependent, and was exploited successfully in cuprate materials to help determine the dwave symmetry in those systems24–27 . In addition, the\npresence of nodes and the dimensionality of the nodal\nmanifold may be determined by comparison with low energy power laws in the Raman intensity in different polarization states.\nIn the Fe-pnictide materials, density functional theory\ncalculations28,29 for the paramagnetic state have generally found a multisheeted Fermi surface consisting of concentric, nearly circular hole pockets around the Γ point\n(here referred to as \"α sheets\") and nearly circular electron pockets around the M points, or X̃ point in the\nunfolded, 1-Fe zone (referred to as \"β sheets\"). These\nsheets are plotted in Fig. 1. Spin fluctuation models of pairing30–33 have usually found that the leading\npairing instability had s-wave symmetry, and noted that\nthe next leading channel had dx2 −y2 symmetry. Wang\net al.34 , who studied the pairing problem using a functional renormalization group approach within a 5-orbital\nframework, also found that the leading pairing instability\noccured in the s-wave channel, and that the next leading\nchannel had dx2 −y2 symmetry. These calculations differ\naccording to whether or not actual nodes are found in the\nleading pairing states, but they all find large anisotropies\nover the Fermi surface sheets, not anticipated in the original predictions of extended-s-type states with isotropic\ngaps which changed sign between the α and β sheets35,36 .\nWhile ARPES experiments16–21 have reported weakly\nanisotropic gaps, this may be due to momentum resolution issues and the difficulty of preparing good surfaces in these systems at present. In particular, the samples used in these experiments may be sufficiently dirty\nat the surface that considerable momentum averaging,\nwith concomitant gap averaging, could be taking place23 .\nAngle-dependent specific heat measurements in a magnetic field37 , which probe the bulk, may be feasible in\nthe future but are difficult at present due to the requirement of large clean crystals. Raman scattering with use\n\n\f2\n\nπ\n\nβ2 θ\n\na\nB 2g\n\nthat due to the form for the Raman vertices, which are\nallowed when there are multiple Fermi surfaces, there can\nalso be backflow effects on symmetry channels other than\nA1g in the Fe-pnictides.\nWe begin in Section II by considering model one-band\nclean systems with gaps inspired by proposals for the\nFe-pnictides to illustrate what intuition we can gain regarding the Raman response for various polarizations.\nIn Section III, we consider gaps on all four fermi surfaces\npredicted by density functional theory. We present our\nconclusions in Section IV.\n\nb\nB1g\n\nα2\n0\n\nα 1θ\n\nβ1\n\n0\n\nπ\n\nθ\n\nFIG. 1: Fermi surface of model Fe-pnictide represented in unfolded (1-Fe) Brillouin zone. The crystalline a, b axes are indicated in blue, and the polarization geometries for incoming\nand scattering photon polarizations are denoted for B1g and\nB2g geometries. Note that our symmetry notation is rotated\nby 45 degrees with respect to the lattice symmetries.\n\nII.\n\nELECTRONIC RAMAN SCATTERING IN\nCLEAN SYSTEM\nA.\n\nRaman scattering is the inelastic scattering of polarized light from a material. For a review see Ref. 24.\nThe cross section of the scattered light is proportional\nto the imaginary part of the channel-dependent Raman\nsusceptibility\nχγ,γ (ω) =\n\nof different polarizations may therefore be the best current method of acquiring momentum-dependent information on the structure of the bulk superconducting order\nparameter. We discuss several cases below which should\nallow extraction of the crude momentum dependence and\npossible nodal structure of the order parameter over the\nFermi surface. Some of these cases have been considered\nin an earlier paper by Chubukov et al.38 , who however\nfocussed solely on the A1g polarization, and examined\nvertex corrections due to short-range interactions. However, they neglected \"charge backflow\" effect of the longrange part of the Coulomb interaction which is required\nto ensure charge conservation. Here we show that for the\nA1g case, significant changes are to be expected due to\nthe coupling of the A1g Raman charge fluctuations due\nto the backflow effects.\nWhile the expressions for the B1g and B2g channels\nare generally well-characterized by the bare bubble calculation for the cuprates, it is well-known that the A1g\ncontribution is significantly more complicated due to the\nissue of charge backflow as noted above, and to the number of different excitons which may be pulled down from a\ngap edge condensate. In systems with several condensate\npairing instabilities lying in close proximity in parameter space, strong excitonic peaks may occur. While the\npossibility of such excitonic modes is of interest for the\npnictides, in this paper we focus on the generic quasiparticle features for Raman scattering, and will consider\nexcitonic peaks in a future publication. Charge backflow and Coulomb screening is explicitly included in all\nA1g calculations, but pair interaction corrections will be\nneglected. We will however also consider the possibility\n\nGeneral Theory\n\nZ\n\n0\n\nβ\n\ndτ e−iωm τ hTτ ρ̃γ (τ )ρ̃γ (0)i |iωm →w+iδ . (1)\n\nHere we will take a simple frequency independent form\nfor the Raman vertices (non-resonant scattering) and\nwrite the effective Raman charge fluctuations in the γchannel as\nXX\nρ̃γ =\nγn,m (k)c†n,σ (k)cm,σ (k),\n(2)\nk,σ n,m\n\nwhere n, m denote band indices. γn,m (k) defines the\nmomentum- and polarization-dependent Raman vertices,\nwhich may include intra- and interband transitions. Generally, the vertex is determined by both density and current matrix elements between the conduction band and\nthe excited states, and has not been calculated for even\nsimple metals like Al. However, the polarization geometries of the incoming and outgoing photons impose an\noverall symmetry due to the way in which excitations\nare created in directions determined by the electric field\noscillations, and classifications of the anisotropy of the\nRaman vertices can be employed.\nIn this paper, in order to focus on general features for\nRaman scattering in the pnictides, we will neglect band\nstructure features and treat all Fermi surface sheets as\ncircles. This allows for a simple symmetry classifications\nfor the Raman vertices as has been done in the cuprates.\nExpanding the polarization-dependent vertices in Fermi\nsurface harmonics for cylindrical Fermi surfaces,\nγn (θ)A1g = an + bn cos(4θ)\nγn (θ)B1g = cn cos(2θ)\nγn (θ)B2g = dn sin(2θ),\n\n(3)\n\n\f3\nwith angle-independent band prefactors an , bn , cn , dn setting the overall strength of the Raman amplitudes for\nband n. Since an isotropic density fluctuation vanishes\nfor q → 0, it can be shown via Eq. 4 that the A1g contribution an to the Raman vertex is cancelled by charge\nbackflow and does not contribute to the scattering crosssection. This leaves the cos(4θ) as the first non-vanishing\ncontribution in the expansion.\nAs shown in Fig. 1, we note that our choice of coordinates rests on the 1 Fe unit cell, which is rotated by 45\ndegrees with respect to the 2 Fe unit cell. Thus our symmetry notation is electronic and not associated with the\nlattice principal directions, and therefore our classifications are 45 degrees rotated with respect to conventional\nlattice classifications. Using lattice coordinates, what we\ncall B1g would be B2g , and vice-versa. While this might\ncreate some confusion, it is convenient to understand the\ninterplay of the angular dependence of the vertices and\nthe energy gaps in the rotated 1 Fe unit cell frame, as\nshown in Fig. 1. This should be kept in mind however\nwhen one discusses, e.g., electronic excitations together\nwith lattice excitations. Then our symmetry labels B1g\nand B2g would have to be interchanged.\nOther forms for the Raman vertices are allowable,\nwith the only requirement being that they must obey\nthe transformation rules according to the relevant point\ngroup symmetries of the crystal. We note that for multisheeted Fermi surfaces shown in Fig. 1, there are different\npossible forms for the vertices other than Eq. 9. While\nthe Raman vertices of the α sheets must transform according to Eq. 9, for the β sheets other forms for the\nvertices could be admissable. This includes, for the B1g\nvertex for example, a vertex which is momentum independent on each β sheet but of opposite sign. For the\nB2g vertex, a Raman vertex which is p-wave like on each\nβ sheet (with a change of sign) would also be admissable.\nWe will explore these possibilities in Sec. III.\nFor n bands crossing the Fermi level, the intraband\nRaman response in the absence of Coulomb screening\nand charge backflow is given by\nχρ̃,ρ̃ (ω) =\n\n1 XX\nγn (k)2 λn (k, ω),\nN\nn\n\n(4)\n\nk\n\nwhere\nλn (k, ω) = tanh\n\n\u0012\n\nEn (k)\n2kB T\n\n\u0013\n\n4 | ∆n (k) |2 /En (k)\n4En2 (k) − (h̄ω + iδ)2\n\n(5)\n\nis the Tsuneto function for the nth band, having band\ndispersion ǫn (k), energy gap ∆n (k), and quasiparticle\nenergy En2 (k) = ǫ2n (k) + ∆2n (k). Taking the imaginary\npart of Eq. (5) we then obtain for the Raman response\nat T = 0\nX\nImχρ̃,ρ̃ (ω) =\nImχnρ̃,ρ̃ (ω) =\nn\n\nX πNF,n\nn\n\nω\n\nRe\n\nZ\n\n| ∆n (θ) |2\n. (6)\ndθγn2 (θ) p\nω 2 − 4 | ∆n (θ) |2\n\nSince Raman scattering probes charge fluctuations in\nthe long-wavelength limit, the role of the long-range\nCoulomb interaction is important. Isotropic charge fluctuations are coupled across all unit cells, and Raman\nscattering at low energies must vanish due to particle\nnumber conservation, leaving only an inelastic light scattering peak at the plasmon energy. Screening by the longrange Coulomb interaction can be taken into account by\nincluding couplings of the Raman charge density ρ̃ to the\nisotropic density ρ fluctuations and is given by\nχρ̃,ρ χρ,ρ̃\n,\nχρ,ρ\n\n(7)\n\n1 XX\nγn (k)λn (k),\nN n\n\n(8)\n\nχscr\nρ̃,ρ̃ = χρ̃,ρ̃ −\nwith\nχρ̃,ρ = χρ,ρ̃ =\n\nk\n\nand\nχρ,ρ =\n\n1 XX\nλn (k).\nN n\n\n(9)\n\nk\n\nEqs. (4-9) constitute closed form expressions for the\nintraband, non-resonant contribution to the Raman response.\nIt is clear that the Raman response is in general not\nsimply additive with respect to the response calculated\nfrom each band separately. Incident photons can create\nanisotropic charge fluctuations according to the direction\nof the polarization light vector, and those charge fluctuations relax by emitting a scattered photon and redistributing charge density via intrinsic electron scattering\nmechanisms such as electron-impurity, electron-phonon,\nelectron-electron interactions, or via breaking of Cooper\npairs. The anisotropy of the charge fluctuations created\nwith light can be controlled by aligning incident and scattered photon polarization vectors, transforming according to the elements of the irreducible point group of the\ncrystal. For a material with D4h tetragonal symmetry,\nand a single Fermi sheet, the B1g and B2g Raman responses are not coupled to the long-range Coulomb interaction. As a consequence, the Raman charge densities for\nthese channels do not couple to the pure charge density\nchannel, and the terms given in Eq. (8) vanish. However,\nA1g fluctuations need not vanish over the unit cell, and\ntherefore they can couple to isotropic charge density, giving the finite backflow represented by the second term in\nEq. (7). We will see that this can also occur for the B1g\ncase for Raman vertices which are allowed when one has\nmultiple Fermi surfaces as formed in the Fe-pnictides.\nFrom the expression for the Raman response we see\nthat in the case of an isotropic gap, ∆k = ∆, there\nshould always be a peak at 2∆. In an unconventional\nsuperconductor, depending on the polarization, this absorption peak is replaced by a peak or other structure\nat 2∆0 , twice the maximum of the gap over the Fermi\nsurface. The peak will be rounded by scattering, but\nstill provides a measure of the magnitude of the gaps in\n\n\f4\n1\n\nα1\n\n0.8\n\nα2\n\n0.6\n\n∆(θ)/∆ 0\n\n0.4\n0.2\n0\n\n-0.2\n-0.4\n-0.6\n-0.8\n\nβ1\n\nβ2\n\n-1\n0 π/2 π 3π/2 0 π/2 π 3π/2 0 π/2 π 3π/2 0 π/2 π 3π/2 2π\n\nθ\n\nFIG. 2: The anisotropic energy gaps around the 4 Fermi surface sheets as a function of angle θ shown in Fig. 1. For the\nβ sheets, the solid line is for rβ = 1.4 and the dotted line\nrβ = 0.6 (see Eq. 14).\n\nthe system and may be compared to those determined\nfrom other experiments, e.g. ARPES and tunnelling.\nThe B1g and B2g vertices in Eq. (3) have zeros in kspace and therefore weight the part of the Brillouin zone\naway from these zeros. This is observed, e.g. in the dwave cuprates, where the sharp 2∆ peak occurs in the\nB1g channel only, while a less pronounced feature corresponding to a change in slope occurs at the same energy\nin the B2g channel which weights the nodal regions most\nstrongly. Furthermore, the existence of nodes in a gap\ncreates low energy quasiparticles that cause a nonzero\nresponse for all frequencies. This is in sharp contrast\nto fully gapped superconductors whose response show a\nsharp gap edge with no low energy quasiparticles.\nIn what follows we consider separate cases of increasing\ncomplexity in order to display what features for Raman\nscattering in a multi-band system with different gap symmetries might be expected generically.\n\nB.\n\nResults for some special cases\n1.\n\nSingle Fermi sheet\n\nIn order to understand the type of behavior found for\nthe multiband models of the Fe-pnictides, it is useful to\nbegin with some special cases. Early on, motivated by the\nproximity of the Fe-pnictides to a (π, 0) spin density wave\nphase and the multiple Fermi surface structure found in\nLDA (local density approximation) calculations, a sign\nreversed s-wave gap was proposed.35 It was suggested\nthat spin-fluctuation scattering of electron pairs between\nthe α and β fermi sheets could lead to pairing with an\nisotropic s-wave gap ∆0 that changed sign between the α\nand β Fermi surfaces. In this case, the Raman response\nwould consist of a peak onsetting at 2∆0 or several peaks\n\nRaman response [arb. units]\n\n0.3\n\n0.2\n\n0.1\n\n0\n0\n\n1\n\n2\nω/∆ 0\n\n3\n\n4\n\nFIG. 3: The Raman response of the state with energy gap\nEq. 10 for r = 1.4. Black/red lines denote B1g /B2g , and\ngreen/blue is the unscreened/screened A1g , respectively. Note\nthat our symmetry classifications are according to the geometry shown in Fig. 1. For lattice classifications, B1g and B2g\nshould be interchanged.\n\nif there were gaps of different magnitudes on the various\nFermi surfaces. In the absence of impurity scattering and\ninelastic lifetime effects, this peak would vary as (ω −\n2∆0 )−1/2 as ω approaches 2∆o from above.\nAlternatively, RPA spin-fluctuation calculations and\nfunctional renormalization group studies find anisotropic\ns-wave gaps which can even have nodes on the β Fermi\nsurfaces as well as nearby d-wave gaps with nodes on the\nα Fermi surfaces. Here, in order to examine the Raman\nsignatures of such states, we consider the simple parameterization\n∆(θ) =\n\n∆0\n(1 − rcos(2θ)).\n1+r\n\n(10)\n\nThis gap is plotted as a function of angle around a circular Fermi surface. Note, however, that for a single Fermi\nsurface centered at Γ, this state would not have four-fold\nsymmetry. Instead, the Fermi surface parameterized by\nθ is intended to represent a model for the β1 sheet of\nthe pnictides, and the Fermi surface angle θ is measured\naround (π, 0) rather than Γ. When combined with the\nβ2 sheet at (0, π), the full s-wave symmetry of the state\nis restored. The gap in Eq. 10 is normalized such that\n∆0 is the maximum over the Fermi surface, and plotted\nfor the values of r = rβ shown in Fig. 2. For r > 1\nthe state has nodes on the Fermi surface, and for small\nvalues of r − 1 these nodes move towards 0 and π. For\nr < 1, there are no nodes but for any nonzero r one has\nan anisotropic gap.\nIn Figs. 3 and 4 we exhibit the B1g , B2g , unscreened\nA1g , and screened A1g Raman responses for the gaps\ngiven by Eq. (10), which are shown in the leftmost\npanel in Fig 2. In Fig. 3, where r = 1.4, there are\ngap nodes on the β sheets and one finds the expected\n\n\f5\n0.3\n\nRaman response [arb. units]\n\nRaman response [arb. units]\n\n0.4\n\n0.3\n\n0.2\n\n0.1\n\n0\n0\n\n1\n\n2\nω/∆ 0\n\n3\n\n0.1\n\nlow frequency power law behavior in which both response\nfunctions vary as ω, following the low energy behavior of\nthe density of states, since the nodes of the energy gap\ndo not align with the nodes of the Raman vertices. For\nthe gap edge ω = 2∆max = 2∆0 , the B1g and unscreened\nA1g spectra have a log | ω − 2∆0 | singularity. For the\nB2g response, there is a change of slope at 2∆0 since the\nnodes of the vertex align with the gap maxima. A secondary log singularity appears at ω = 2∆min , probed\nby the B1g and A1g vertices, but not B2g . Screening, as\npointed out before, removes all log singularities from the\nunscreened A1g response, leaving only a cusp-like behavior at ω = 2∆min , 2∆max .\nFor a nodeless anisotropic gap (r = 0.6) shown as the\ndashed line in the β1 panel of Fig. 2, the Raman spectra\nare shown in Fig. 4. In this case, there is a gap in the low\nfrequency spectra. Here, for r < 1, ∆min occurs where\nthe magnitude of the gap has a local minimum rather\nthan a local maximum as it does for r > 1. This leads\nto a step discontinuity at ω/∆0 = 0.5 for the B1g and\nA1g spectra rather than the log singularity seen in Fig. 3\nfor r = 1.6. The nodes of the Raman vertex for the B2g\nresponse are aligned with ∆min , leading to a linear onset\nat ω = 2∆min rather than a step onset.\n\nTwo Fermi surface sheets\n\nAs indicated by Eq. 4, the A1g Raman response for\nthe case of a multi-sheet Fermi surface is not in general\nadditive due to the Coulomb interactions and associated\ncharge backflow. While no such backflow appears in the\nB1g or B2g channels for the present case, we will see in\nSec. III that for Raman vertices which are allowed for the\nFe-pnictides, there can be Coulomb backflow contributions to the B1g channel. To illustrate this we calculate\nthe A1g Raman response for two Fermi surface sheets,\n\n0\n0\n\n4\n\nFIG. 4: The Raman response of the state with energy gap Eq.\n10 for r = 0.6. Black/red lines denote B1g /B2g , respectively,\ngreen/blue is unscreened/screened A1g .\n\n2.\n\n0.2\n\n1\n\n2\n\nω/∆0\n\n3\n\n4\n\nFIG. 5: The screened A1g Raman response for 2 bands with\n∆1,2 (θ) proportional to (1 + r cos(4θ))/(1 + r) with r = 0.2,\nand the maximum gap on Fermi surface 1 equal to ∆0 and\non Fermi surface 2 equal to ∆0 /2. ( black = screened A1g for\nband 1, red = screened A1g for band 2, green = mixing term,\nblue = total response.)\n\nwhere the energy gaps ∆1,2 (Θ) are both proportional to\n(1 + r cos(4θ))/(1 + r), with r = 0.2. For simplicity, we\ntake the gap maximum on one Fermi surface to be ∆0 and\non the other ∆0 /2. We also take equal Raman vertices\nand density of states for each band.\nExpanding Eqs. (4-9) for the case of 2 bands, the overall Raman response can be written as\nImχsc (ω) = Imχ1 (ω) + Imχ2 (ω) + Im∆χ(ω),\n\n(11)\n\nwhere\n1 X 2\nγ1,2 (k)λ1,2 (k, ω)\nN\nk\nP\n2\n( k γ1,2 (k)λ1,2 (k, ω))\nP\n,\n−\nN k λ1,2 (k, ω)\n\nχ1,2 (ω) =\n\nand\n\n(12)\n\nP\nP\nλ1 (k, ω) k λ2 (k, ω)\nk\n∆χ(ω) = P\nN k (λ1 (k, ω) + λ2 (k, ω))\nP\n\u00152\n\u0014P\nγ2 (k)λ2 (k, ω)\nγ1 (k)λ1 (k, ω)\nk\nk\nP\nP\n−\n.(13)\n×\nk λ1 (k, ω)\nk λ2 (k, ω)\n\nThus for A1g , the screened Raman response can be considered as a sum of the screened response for each band,\nplus a mixing term ∆χ. Here one can see that if the energy gaps and Raman vertices are the same for each band\nthe mixing term vanishes, while for all other cases it is\nfinite, reflecting the contribution from charge backflow.\nIn this case, the light scattering induces interband charge\ntransfer in order to recover particle number conservation\nwhen the charge fluctuations differ on the two bands.\nAs illustrated in Fig. 5, the screened A1g Raman spectrum consists of contributions from each Fermi surface\n\n\f6\n\nB 1g\n\n0.4\n\nRaman response [arb. units]\n\nRaman response [arb. units]\n\n0.8\n0.6\n0.2\n0\n0.5\n0.4\n0.3\n0.2\n0.1\n0\n0.4\n0.3\n0.2\n0.1\n0\n0\n\nB 2g\n\nA 1g\n1\n\n2\n\nω/∆ 0\n\n3\n\n4\n\nFIG. 6: The B1g , B2g and screened A1g Raman spectra for\na four-sheeted Fermi surface, with rβ = 1.4. The black line\ncorresponds to each contribution from the β1,2 bands, the\nred line to the α1 band, the green line α2 , and the blue line\nis the total response. Note that for the A1g case (bottom\npanel) there is an interference term in addition to the sum of\nthe contributions from each band. The energy gaps used are\ndefined in the text.\n\nwith a gap scale differing by a factor of 2 and an interference contribution coming from the charge backflow. All\nsingularities associated with the values of the gaps at the\nstationary points that would appear in the unscreened\nA1g channel are removed and replaced by cusp-like behavior as in the single band case. However the structure\nof χ′′sc (ω) is changed by the interference.\nInterference terms also occur if the gaps are identical\non each sheet but the Raman vertices differ. A more\ndetailed examination of the role of charge backflow is\npresented in Ref. 27.\nIII.\n\nTHE FOUR FERMI SURFACE RAMAN\nSPECTRA\n\nWe would now like to extend this discussion of the\nfeatures in the Raman intensity to the 4-Fermi surface\nmodel of the Fe-pnictides. Here we first consider the two\nsets of ∆ν (θ) gap variations for the four Fermi surface\nsheets ν = α1 , α2 , β1 and β2 shown in Fig. 4. Specifically,\nthe energy gaps are taken to be (Fig. 2)\n1 ∓ rβ cos(2θ)\n,\n1 + rβ\n1 + cos(4θ)\n,\n= −0.8∆0\n2\n1 − cos(4θ)\n,\n= −0.4∆0\n2\n\n∆β1 ,β2 = ∆0\n∆α1\n∆α2\n\n(14)\n\nAs previously discussed, these gap choices are motivated\nby the anisotropic gaps found in RPA spin fluctuation\nand functional renormalization group calculations. The\n\n0.8\n0.6\n0.4\n0.2\n0\n0.5\n0.4\n0.3\n0.2\n0.1\n0\n0.5\n0.4\n0.3\n0.2\n0.1\n0\n0\n\nB 1g\n\nB 2g\n\nA 1g\n1\n\n2\n\nω/∆ 0\n\n3\n\n4\n\nFIG. 7: Same as Fig. 6 but for rβ = 0.6.\n\namplitudes of the α1 and α2 gaps have been chosen to\navoid an accidental overlap of singularities between the α\nand β gap extrema. The first of these, shown by the solid\ncurves in Fig. 2, corresponds to an A1g gap with nodes\non the β-Fermi surfaces (rβ = 1.4), and the second one is\nnodeless corresponding to the dashed curves (rβ = 0.6).\nThe B1g , B2g and A1g spectra for these two cases are\nshown in Figs. 6 and 7, respectively. The contribution\nfrom the individual Fermi surfaces are also indicated.\nFor the B1g and B2g spectra the structure seen in the\ntotal response are just the sum of the spectra from the individual Fermi surface sheets with the appropriate gaps\nshown in Fig. 2. For example, in Fig. 6, the B1g response for the gap with nodes consists of a sum over\ndifferent contributions coming from the two hole Fermi\nsurfaces α1 and α2 and the sum of the spectra from the\nβ1 and β2 electron Fermi surface sheets which are identical since Raman only probes | ∆ | and is not sensitive\nto the phase in the absence of impurities. Just as the for\nthe previous discussion of the single Fermi surface case,\none can easily identify the characteristic features coming from each Fermi surface shown in Fig. 6. The B1g\nRaman response for a gap with nodes on the β sheets\n(red curve) exhibits log singularities at ω/∆0 equal to\n2∆β,max /∆0 ≃ 1.5 and 2 | ∆β |min /∆0 ≃ 0.25. The α1\nsheet (green) contributes an additional log singularity at\n2 | ∆α1 |max /∆0 ≃ 1.6. Since the B1g vertex has a node\nat the minimum value of the gap on the α1 sheet the\ndiscontinuity at ω/∆0 = 0.8 is eliminated leaving only\na linear onset. The contribution of the α2 -sheet has a\nsimilar linear onset at ω = 0 and a change in the slope\nat 2 | ∆α2 |max /∆0 ≃ 0.8 due to the fact that the B1g\nRaman vertex has a node at the minimum and maximum\nvalues of the gap on the α2 Fermi surface.\nA similar discussion can be given for the B2g case\nshown in the center panel of Fig. 6, where the total response is the sum of the contribution from the individual\nFermi surface sheets with the B2g Raman vertex. As discussed in the previous section, the screened A1g response\n\n\f7\n0.8\n\nB 1g\n\n0.4\n\nRaman response [arb. units]\n\nRaman response [arb. units]\n\n0.6\n0.2\n0\n0.4\n0.3\n0.2\n0.1\n0\n0.6\n\nB 2g\n\nA1g\n\n0.4\n0.2\n0\n\n5\n4\n3\n2\n1\n0\n2\n1.5\n1\n0.5\n0\n\nB 1g\n\nB 2g\n\nA1g\n\n1.5\n1\n0.5\n\n0\n\n1\n\n2\n\nω/∆ 0\n\n3\n\n4\n\nFIG. 8: Same as Fig. 6 but for different Raman vertices, given\nby Eq. (15).\n\nshown in the lower panel of Fig. 6 contains the screened\ncontributions from each band, plus an interference term\nwith interference contributions coming from each pair of\nbands. All singularities are removed by the backflow,\nleaving the cusp-like behavior which can be tied to each\nof the gap extrema, as done for the other channels.\nAs mentioned in Sec. II A, different forms for the Raman vertices are in principle allowable other than the\nones given in Eq. (3), giving the Raman spectra shown\nin Figs. 6 and 7. Here we consider how different forms\nfor the Raman vertices affect the general structure of the\nchannel dependent Raman spectra. As an example, we\nconsider the following form for the Raman vertices:\nγα1 ,α2 (θ)A1g = 1\nγβ1 ,β2 (θ)A1g = −1,\n\nγα1 ,α2 (θ)B1g = cos(2θ)\nγβ1 ,β2 (θ)B1g = ±1,\n\nγα1 ,α2 (θ)B2g = sin(2θ)\nγβ1 ,β2 (θ)B2g = sin(θ).\n\n(15)\n\nThese vertices are all allowed by symmetry and have\nless anisotropy than the ones considered in Eq. 3 and\nthus highlight different gap structures. Moreover, due to\nthe angle-independent form for the B1g vertices on the β\nsheets, screening must be included and the mixing terms\nare non-zero to give finite contributions to the spectra.\nThe resulting channel-dependent spectra are shown in\nFig. 8 for the Fermi sheet gaps given in Eq. 14 with\nrβ = 1.4. For the B1g case, Raman scattering from the\nindividual β sheets now is canceled by backflow due to\nthe angular independent Raman vertices on those sheets,\nand two identical contributions arise from the α sheets,\nas in Fig. 6. However, an additional mixing term arising from scattering interferences involving each separate\nβ sheet, gives a large contribution to the spectra, with\npeaks occuring at the energy scales given by the energy\n\n0\n\n0\n\n1\n\n2\n\nω/∆ 0\n\n3\n\n4\n\nFIG. 9: Polarization dependence Raman response for the s±\nstate, having energy gaps given by Eq. (16) and Raman vertices given by Eq. (15). Color scales, denoting contributions\nfrom each band and the total response, are the same as in\nFigs. 6-8.\n\ngap extrema on each sheet. For the B2g spectra, the sinusoidal variation sin(θ) of the vertices on the β sheets\nnow allow for the highlighting of the gap maximum, giving a peak frequency at twice the gap maximum for the\nβ sheets, in contrast to the spectra shown in Fig. 6. A\ndramatic change of the spectra is observed for the A1g\nchannel. Due to backflow, the Raman response from each\nseparate band vanishes identically for the constant vertices in Eq. (15), but due to the change in sign, the entire\nRaman spectra arises solely from the mixing terms. The\npositions of the cusp-like feature at ω = 2∆0 are the same\nas that shown in Fig. 6 for a different form for the Raman\nvertices, however the overall spectra lineshape is qualitatively different. The overall structure of the lineshapes\nthus indicate that a proper account of the anisotropy of\nthe Raman vertices may be needed in order to obtain a\nqualitative comparison with the experimental observed\nRaman spectra. This is a topic for further study.\nFinally we consider a simple sign-changing s± state on\nthe four sheets:\n√\n∆β1 ,β2 = −∆0 / 2,\n(16)\n∆α2 = ∆0 /4.\n∆α1 = ∆0 ,\nUsing the vertices defined by Eq. 15, the resulting Raman spectra is shown in Fig. 9. Here, the square root divergence at twice the gap value is ubiquitous, displaying\nboth in B1g and in B2g The only polarization difference is\nthat the contributions from the β bands for the B1g channel are screened, in contrast to the B1g channel. Apart\nfrom this difference, the spectra are qualitatively similar,\ndue to the mixing terms in B1g which restore the singularity at ω = 1.5∆0 . For the A1g channel, the divergences\nare screened and the response maintains thresholds and\npeaks at twice the gap energy for each band.\n\n\f8\nIV.\n\nCONCLUSIONS\n\nHere we have studied the Raman scattering response\nfor some simple models of the Fe-pnictide superconductors. Specifically, we considered two different anisotropic\nA1g gaps, one with nodes and one without nodes, on\nfour circular Fermi surfaces. Besides the well-known low\nfrequency differences in the spectra for nodal and nonnodal gaps, we found a rich set of high frequency structures arising from stationary points of ∆ν (θ) on the various Fermi surfaces. Measurements of different polarizations may allow one to associate particular gap structures\nwith individual Fermi surface sheets. If the gap has a\nlarge anisotropy as suggested by some calculations, there\nwill be a rich Raman spectrum for different symmetry\nchannels. However, if one has a relatively isotropic gap,\nsuch as the proposed sign-switched s−wave, the spectrum\nshould be simpler and sharper since for an isotropic gap\nthe response has a square root singularity at 2∆0 rather\nthan the weaker log singularity found for an anisotropic\ngap.\n\n1\n\n2\n\n3\n\n4\n5\n\n6\n\n7\n\n8\n9\n\n10\n\n11\n\n12\n13\n\n14\n\nY. Kamihara, T. Watanabe, M. Hirano, and H. Hosono, J.\nAm. Chem. Soc. 130, 3296 (2008).\nM.V. Sadovskii, review talk on 90th anniversary of Physics\nUspekhi arXiv.org:0812.0302 .\nH. Aoki, Proc. Int. Conf. on Muon Spin Rotation, Relaxation and Resonance, Tsukuba, Japan arXiv:0811.1656 .\nI. Mazin, J. Schmalian, arXiv:0901.4790.\nR. Klingeler, N. Leps, I. Hellmann, A. Popa, C. Hess,\nA. Kondrat, J. Hamann-Borrero, G. Behr, V. Kataev, and\nB. Buechner, arXiv:0808.0708.\nH.-J. Grafe, D. Paar, G. Lang, N.J. Curro, G. Behr,\nJ. Werner, J. Hamann-Borrero, C. Hess, N. Leps, R. Klingeler, and B. Buchner, Phys. Rev. Lett. 101, 047003\n(2008).\nK. Ahilan, F.L. Ning, T. Imai, A.S. Sefat, R. Jin,\nM.A. McGuire, B.C. Sales, D. Mandrus, Phys. Rev. B 78,\n100501(R) (2008).\nT.Y. Nakai et al., J. Phys. Soc. Jpn. 77, 073701 (2008).\nK. Hashimoto, T. Shibauchi, T. Kato, K. Ikada, R.\nOkazaki, H. Shishido, M. Ishikado, H. Kito, A. Iyo, H.\nEisaki, S. Shamoto, and Y. Matsuda arXiv:0806.3149.\nL. Malone, J.D. Fletcher, A. Serafin, A. Carrington, N.D.\nZhigadlo, Z. Bukowski, S. Katrych, and J. Karpinski, arXiv\n0807.0876.\nC. Martin, R. T. Gordon, M. A. Tanatar, M. D. Vannette, M. E. Tillman, E. D. Mun, P. C. Canfield, V. G.\nKogan, G. D. Samolyuk, J. Schmalian, and R. Prozorov,\nArXiv:0807.0876\nK. Hashimoto etal. arXiv:0810.3506.\nR. T. Gordon, N. Ni, C. Martin, M. A. Tanatar, M. D.\nVannette, H. Kim, G. Samolyuk, J. Schmalian, S. Nandi,\nA. Kreyssig, A. I. Goldman, J. Q. Yan, S. L. Bud'ko, P. C.\nCanfield, R. Prozorov, arXiv:0810.2295.\nR. T. Gordon, C. Martin, H. Kim, N. Ni, M. A. Tanatar,\nJ. Schmalian, I. I. Mazin, S. L. Bud'ko, P. C. Canfield, R.\nProzorov, arXiv:0812.3683.\n\nWe have also discussed some of the unusual aspects of\nthe Raman spectra to be anticipated in the Fe-pnictides\ndue to their multisheeted Fermi surface electronic structure. In particular, Coulomb backflow mixing may affect\nthe B1g spectrum as well as A1g . There are other unusual aspects, such as excitonic modes associated with\nshort range interactions38 or competing order parameter channels, which we have not explored here, but may\nmake the spectra in these materials even richer. Work\nalong these lines is in progress.\n\nAcknowledgments\n\nWe thank L.Kemper, T.Maier, S.Graser for useful discussions. Research was partially supported by DOE DEFG02-05ER46236 (PJH) and DOE DE-AC02-76SF00515\n(TPD). DJS thanks the Stanford Institute of Theoretical Physics and the Stanford Institute for Materials and\nEnergy Sciences for their hospitality.\n\n15\n\n16\n17\n\n18\n\n19\n\n20\n\n21\n\n22\n\n23\n\n24\n25\n\n26\n27\n\n28\n\n29\n\nJ.D. Fletcher, A. Serafin, L. Malone, J. Analytis, J-H Chu,\nA.S. Erickson, I.R. Fisher, A. Carrington, arXiv:0812.3858.\nL. Zhao et al Chin. Phys. Lett. 25, 4402 (2008).\nH. Ding, P. Richard, K. Nakayama, T. Sugawara,\nT. Arakane, Y. Sekiba, A. Takayama, S. Souma, T. Sato,\nT. Takahashi, Z. Wang, X. Dai, Z. Fang, G.F. Chen,\nJ.L. Luo, N.L. Wang, Europhys. Lett. 83, 47001 (2008).\nT. Kondo, A.F. Santander-Syro, O. Copie, C. Liu,\nM.E. Tillman, E.D. Mun, J. Schmalian, S.L. Bud'ko,\nM.A. Tanatar, P.C. Canfield, A. Kaminski, Phys. Rev.\nLett. 101, 147003 (2008).\nD.V. Evtushinsky, D.S. Inosov, V.B. Zabolotnyy,\nA. Koitzsch, M. Knupfer, B. Buchner, G.L. Sun,\nV. Hinkov, A.V. Boris, C.T. Lin, B. Keimer,\nA. Varykhalov, A.A. Kordyuk, S.V. Borisenko,\narXiv:0809.4455.\nK. Nakayama, T. Sato, P. Richard, Y.-M. Xu, Y. Sekiba,\nS. Souma, G. F. Chen, J. L. Luo, N. L. Wang, H. Ding, T.\nTakahashi, arXiv:0812.0663.\nL. Wray, D. Qian, D. Hsieh, Y. Xia, L. Li, J.G. Checkelsky,\nA. Pasupathy, K.K. Gomes, C.V. Parker, A.V. Fedorov,\nG.F. Chen, J.L. Luo, A. Yazdani, N.P. Ong, N.L. Wang,\nM.Z. Hasan, arXiv: 0812.2061.\nA.B. Vorontsov, M.G. Vavilov, and A.V. Chubukov, arXiv\n0901.0719.\nV. Mishra, G. Boyd, S. Graser, T. Maier, P.J. Hirschfeld,\nD.J. Scalapino, submitted to PRB, arXiv:0901.2653\nT.P. Devereaux, R. Hackl, Rev.Mod.Phys. 79, 175 (2007).\nT.P. Devereaux, A. Kampf, Int. Journ. Mod.Phys. B 11,\n2093 (1995).\nT.P. Devereaux, D. Einzel, Phys. Rev. B 51, 16336 (1995)\nT.P. Devereaux, A. Virosztek, and A. Zawadowski, Phys.\nRev. B 54, 12523 (1996).\nD.J. Singh and M.-H. Du, Phys. Rev. Lett. 100, 237003\n(2008).\nC. Cao, P.J. Hirschfeld, H.-P. Cheng, Phys. Rev. B 77,\n\n\f9\n\n30\n\n31\n32\n\n33\n\n34\n\n220506(R) (2008).\nK. Kuroki, S. Onari, R. Arita, H. Usui, Y. Tanaka, H. Kontani and H. Aoki, Phys. Rev. Lett. 101, 087004 (2008).\nH. Ikeda, arXiv:0810.1828\nY. Yanagi, Y. Yamakawa and Y. Ono, arXiv:0808.1192,\n0809.3189\nS. Graser, T.A. Maier, P.J. Hirschfeld and D.J. Scalapino,\narXiv:0812.0343.\nF. Wang, H. Zhai, Y. Ran, A. Vishwanath and D.-H. Lee,\narXiv:0807.\n\n35\n\n36\n\n37\n\n38\n\nI. I. Mazin, D. J. Singh, M. D. Johannes, and M. H. Du,\nPhys. Rev. Lett. 101, 057003 (2008).\nA.V. Chubukov, D. Efremov, and I. Eremin, Phys. Rev. B\n78, 134512 (2008).\nS. Graser, G.R. Boyd, C. Cao, H.-P. Cheng, P. J.\nHirschfeld, and D. J. Scalapino, Phys. Rev. B77, 180514\n(2008).\nA. V. Chubukov, I. Eremin, M. M. Korshunov,\narXiv:0901.2102.\n\n\f"}