{"id": "http://arxiv.org/abs/1205.0999v1", "guidislink": true, "updated": "2012-05-04T16:16:03Z", "updated_parsed": [2012, 5, 4, 16, 16, 3, 4, 125, 0], "published": "2012-05-04T16:16:03Z", "published_parsed": [2012, 5, 4, 16, 16, 3, 4, 125, 0], "title": "Fluid depletion in shear bands", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1205.4447%2C1205.1427%2C1205.1417%2C1205.1093%2C1205.0759%2C1205.2772%2C1205.1942%2C1205.1794%2C1205.2534%2C1205.4126%2C1205.2313%2C1205.0614%2C1205.2068%2C1205.3572%2C1205.2155%2C1205.0033%2C1205.0931%2C1205.0047%2C1205.0387%2C1205.2974%2C1205.1510%2C1205.2092%2C1205.3159%2C1205.0427%2C1205.3088%2C1205.1840%2C1205.2452%2C1205.0404%2C1205.4253%2C1205.1599%2C1205.1042%2C1205.1331%2C1205.0995%2C1205.3501%2C1205.0694%2C1205.2262%2C1205.3274%2C1205.0656%2C1205.4433%2C1205.3057%2C1205.3410%2C1205.0999%2C1205.2612%2C1205.2417%2C1205.2161%2C1205.0937%2C1205.0229%2C1205.2919%2C1205.1850%2C1205.4089%2C1205.0744%2C1205.1400%2C1205.2557%2C1205.2419%2C1205.3401%2C1205.3060%2C1205.2517%2C1205.4192%2C1205.1741%2C1205.3252%2C1205.1406%2C1205.0548%2C1205.4360%2C1205.0836%2C1205.4156%2C1205.1027%2C1205.0978%2C1205.2522%2C1205.1766%2C1205.2978%2C1205.2951%2C1205.2489%2C1205.2406%2C1205.2196%2C1205.4353%2C1205.1765%2C1205.0837%2C1205.2388%2C1205.2714%2C1205.1332%2C1205.3866%2C1205.1728%2C1205.3941%2C1205.4173%2C1205.4177%2C1205.2937%2C1205.4202%2C1205.3867%2C1205.3904%2C1205.0791%2C1205.0770%2C1205.3690%2C1205.3342%2C1205.0603%2C1205.2256%2C1205.0278%2C1205.1516%2C1205.1798%2C1205.3503%2C1205.1351%2C1205.0315&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Fluid depletion in shear bands"}, "summary": "How does pore liquid reconfigure within shear bands in wet granular media?\nConventional wisdom predicts that liquid is drawn into dilating granular media.\nWe, however, find a depletion of liquid in shear bands despite increased\nporosity due to dilatancy. This apparent paradox is resolved by a microscale\nmodel for liquid transport at low liquid contents induced by rupture and\nreconfiguration of individual liquid bridges. Measured liquid content profiles\nshow macroscopic depletion bands similar to results of numerical simulations.\nWe derive a modified diffusion description for rupture-induced liquid\nmigration.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1205.4447%2C1205.1427%2C1205.1417%2C1205.1093%2C1205.0759%2C1205.2772%2C1205.1942%2C1205.1794%2C1205.2534%2C1205.4126%2C1205.2313%2C1205.0614%2C1205.2068%2C1205.3572%2C1205.2155%2C1205.0033%2C1205.0931%2C1205.0047%2C1205.0387%2C1205.2974%2C1205.1510%2C1205.2092%2C1205.3159%2C1205.0427%2C1205.3088%2C1205.1840%2C1205.2452%2C1205.0404%2C1205.4253%2C1205.1599%2C1205.1042%2C1205.1331%2C1205.0995%2C1205.3501%2C1205.0694%2C1205.2262%2C1205.3274%2C1205.0656%2C1205.4433%2C1205.3057%2C1205.3410%2C1205.0999%2C1205.2612%2C1205.2417%2C1205.2161%2C1205.0937%2C1205.0229%2C1205.2919%2C1205.1850%2C1205.4089%2C1205.0744%2C1205.1400%2C1205.2557%2C1205.2419%2C1205.3401%2C1205.3060%2C1205.2517%2C1205.4192%2C1205.1741%2C1205.3252%2C1205.1406%2C1205.0548%2C1205.4360%2C1205.0836%2C1205.4156%2C1205.1027%2C1205.0978%2C1205.2522%2C1205.1766%2C1205.2978%2C1205.2951%2C1205.2489%2C1205.2406%2C1205.2196%2C1205.4353%2C1205.1765%2C1205.0837%2C1205.2388%2C1205.2714%2C1205.1332%2C1205.3866%2C1205.1728%2C1205.3941%2C1205.4173%2C1205.4177%2C1205.2937%2C1205.4202%2C1205.3867%2C1205.3904%2C1205.0791%2C1205.0770%2C1205.3690%2C1205.3342%2C1205.0603%2C1205.2256%2C1205.0278%2C1205.1516%2C1205.1798%2C1205.3503%2C1205.1351%2C1205.0315&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "How does pore liquid reconfigure within shear bands in wet granular media?\nConventional wisdom predicts that liquid is drawn into dilating granular media.\nWe, however, find a depletion of liquid in shear bands despite increased\nporosity due to dilatancy. This apparent paradox is resolved by a microscale\nmodel for liquid transport at low liquid contents induced by rupture and\nreconfiguration of individual liquid bridges. Measured liquid content profiles\nshow macroscopic depletion bands similar to results of numerical simulations.\nWe derive a modified diffusion description for rupture-induced liquid\nmigration."}, "authors": ["Roman Mani", "Dirk Kadau", "Dani Or", "Hans J. Herrmann"], "author_detail": {"name": "Hans J. Herrmann"}, "author": "Hans J. Herrmann", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1103/PhysRevLett.109.248001", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1205.0999v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1205.0999v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "5 pages, 4 figures", "arxiv_primary_category": {"term": "cond-mat.soft", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cond-mat.soft", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "cond-mat.mtrl-sci", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "physics.comp-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1205.0999v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1205.0999v1", "journal_reference": null, "doi": "10.1103/PhysRevLett.109.248001", "fulltext": "Fluid depletion in shear bands\nRoman Mani,1, ∗ Dirk Kadau,1 Dani Or,2 and Hans J. Herrmann1\n1\n\nComputational Physics, IfB, ETH-Hönggerberg, Wolfgang-Pauli-Strasse 27, 8093 Zürich, Switzerland\nInst. f. Terrestrische Oekosysteme, ETH-Zentrum, Universitätsstrasse 16, 8092 Zürich, Switzerland\n(Dated: October 8, 2018)\n\n2\n\nHow does pore liquid reconfigure within shear bands in wet granular media? Conventional wisdom\npredicts that liquid is drawn into dilating granular media. We, however, find a depletion of liquid\nin shear bands despite increased porosity due to dilatancy. This apparent paradox is resolved by a\nmicroscale model for liquid transport at low liquid contents induced by rupture and reconfiguration\nof individual liquid bridges. Measured liquid content profiles show macroscopic depletion bands\nsimilar to results of numerical simulations. We derive a modified diffusion description for ruptureinduced liquid migration.\n\narXiv:1205.0999v1 [cond-mat.soft] 4 May 2012\n\nPACS numbers: 45.70.-n, 47.55.nk, 83.50.Xa\n\nIs interstitial pore liquid driven away or drawn into\nshear bands during deformation of granular matter? In\nfully saturated granular materials it is known that liquid\nis sucked into dilating shear bands with increase in porosity [1–4] since air is precluded from entering the dilated\nshear band pore volume. In unsaturated granular media,\nhowever, at low liquid contents with continuous air phase\nit is unclear if the liquid content increases or decreases.\nIn this work we show that in the pendular regime where\nonly capillary bridges are present, an opposite liquid migration pattern than observed for saturated media develops. Despite increase in porosity in the shear band, liquid\ncontent consistently decreases. This effect is also measured experimentally in a split bottom shear cell where\nthe shear band position is fixed and long shear paths are\npossible [5]. Liquid migration is of tremendous importance to the stability properties of soil structures [6, 7].\nPartially saturated soils may be considered as brittle due\nto the collapse of menisci in the failure plane [8]. Furthermore, granular materials generally lose strength with decreasing liquid content [9]. On the other hand, liquid accumulation in soil pores may cause a dramatic decrease in\nstrength leading e.g. to landslides or soil collapses [6, 10].\nIt was reported that in partially saturated soils, liquid\nmigrates away from the shear plane due to the formation\nof microcracks and increasing connectivity near the failure plane [11]. The degree of saturation ranged from 45%\nto 80% and the liquid content variations were measured\non a macroscopic level by cutting out slices parallel to\nthe shear band. On the grain level however, first experimental investigations on partially saturated soils using\nnon destructive techniques have been performed only recently [12] and the authors did not measure the liquid\ncontent. Moreover, liquid migration is of great interest\nalso in a variety of other situations in powder technology\nor pharmaceutical applications where grains are mixed\nwith liquid, e.g. in spray coating of tablets [13].\nIn this Letter, we experimentally measured the liquid\ncontent in a shear band and propose a model with capillary bridges capable of reproducing the experimental re-\n\nFIG. 1. The circular split bottom shear cell consists of a\nrotating inner part (shaded in gray) as well as a fixed outer\npart (white) separated by a thin slit. The gray cylinder and\nring rotate at the same angular velocity.\n\nsults. To investigate liquid transport in regions of strain\nlocalization it is desirable to realize a stable shear band\nat a fixed position. The circular split bottom cell [5]\nused in our experiments, satisfies this requirement. Our\nsplit bottom cell, a sketch is shown in fig. 1, consists of\ntwo circular L shapes where the inner is made of a rotating cylinder at constant velocity (radius 10 cm) and\nthe outer is fixed. The distance from the symmetry axis\nof the cell to the outer wall is 18 cm and 15 cm to the\nslit where the L shapes join. We chose a filling height\nof 1.5 cm and used glass beads (from Sigmund Lindner,\nSiLi beads type S) with R = 0.85 mm ± 0.0075 mm. We\ndefine a coordinate z along the axis of the inner cylinder. In order to measure the liquid distribution in the\nbulk of the sample, we used a UV glue (from Norland\nproducts, NOA 61) that hardens after irradiation with\nultraviolet light. In the liquid state it has a surface tension of 50mN/m which is close to water and a viscosity of\n300 mPas. After shearing, the glue is immediately hardened, such that subsequent measurements of the liquid\ncontent are possible with virtually no time delay. For visualization we mixed the UV glue with a fluorescent dye\nand in order to cut the sample into slices after hardening, we filled all remaining pore space with a clear and\ncolorless epoxy resin and checked that the liquid bridges\nremain in their original state. The rotation speed was\nfixed to ω = 2π/600s−1 , the overall shear displacement\nwas 8 turns and the liquid content was 1 % which is\n\n\f2\n\nthe liquid volume divided by the volume of the sample.\nFig. 2 (a) shows a slice along a plane perpendicular to\nthe shear band. Indeed, liquid is driven out of the shear\nband and is accumulated along the edges. Moreover, the\nliquid distribution widens with increasing z. The thin\nblue curve in fig. 3 shows the liquid content obtained experimentally as a function of the distance from the outer\nfixed wall averaged over bridges having a height larger\nthan z = 3.4 mm. For this particular filling height, the\ndepletion is about 50%. To determine the liquid content\nwe counted the amount of pixels belonging to a liquid\nbridge in the images taken by an optical microscope and\naveraged over 8 slices.\nIn order to understand the redistribution of liquid in\nsheared granular flows we develop a model with capillary bridges taking into account the redistribution of\nliquid after bridge rupture. Using this model we show\nthat liquid is indeed driven out of shear bands. We use\nContact Dynamics[14, 15] to model rigid spherical particles with radii uniformly distributed between 0.775 mm\nand 0.925 mm. The contact forces are calculated based\non perfect volume exclusion, Coulomb friction and cohesive forces due to capillary bridges. Simple models for\ncohesive forces are well established in Contact Dynamics [16–18]. We use empirical formulas for the capillary\nforce which have been suggested by Willet et al.[19]. The\ngrains are characterized by a certain roughness in which\nliquid may accumulate and form a wetting layer. As soon\nas liquid layers coating the particles are brought into con-\n\nwater content [a.u.]\n\nFIG. 2. (Color online) (a) A slice perpendicular to the shear\nband after a shear displacement of 8 turns. Liquid (artificially highlighted in green) has migrated away from the shear\nband and is accumulated along the edges of the shear zone.\nThe beads were artificially marked purple. (b) A slice perpendicular to the shear band as obtained in simulations. We\nonly show the capillary bridges represented by lines of width\nand brightness proportional to their volume. The liquid distribution widens with increasing height z. The width of both\nimages is 60 mm.\n\ntact, large negative pressure draws liquid to the contact\nforming a capillary bridge at very short time scales of\nthe order of a millisecond for grains of one millimeter\ndiameter [20, 21]. The attractive force exerted by the\ncapillary bridge acts on the two grains until their separation s is larger than a critical rupture distance sc ≈ V 1/3\n[19]. Usually, slow deformations e.g. in geotechnics are\nstudied by means of suction controlled models requiring\na constant Laplace pressure in the bridges throughout\nthe sample [22]. Similarly, we implement a suction controlled model by solving the Young-Laplace equation at\neach contact and require that the total liquid volume is\nconserved. Using this model we found the liquid content, shown in fig. 3 (curve Simulation M1) to be proportional to the number of contacts only, which is slightly\ndecreased in the shear band. The depletion observed in\nexperiments (thin blue curve) is however signigicantly\nstronger! Where does this discrepancy come from?\n\n0.02\n\nExperiment\nSimulation M1\nSimulation M2\n\n0.015\n0.01\n0.005\n10\n\n20\n30\n40\ndistance [mm]\n\n50\n\nFIG. 3. (Color online) The water content from simulation\n(Simulation M2) and experiment agree very well. A depletion\nin humidity is found inside the shear band after 8 turns. Curve\nSimulation M1 shows the liquid distribution obtained by the\nsuction controlled model.\n\nA first hint for implementing a more realistic model is\nfound in studies concerning fluid dynamics in wet granular matter [9, 23]. It was observed that Laplace pressures\nare equalized in a finite time of the order of one to five\nminutes [9] for glass beads of half a millimeter diameter.\nThe equalization takes place due to liquid flow driven\nby Laplace pressure differences either through the vapor\nphase, which is presently not the case, or through the\nwetting layers on the beads [9]. Primarly by small liquid bridges growing in favor of larger ones. Since the\npressure in the bridges is negative, liquid flux between\ncapillary bridges can only occur if liquid pressure in the\nfilm is negative, as well. This may happen for thin films\ndue to roughness or due to surface forces. We call this\nthin film the minimal wetting layer. Furthermore, it was\n\n\f3\nshown experimentally, that the associated flow resistance\nfor thin films is essentially independent on the film thickness [24]. In that sense, the dynamics can be modeled by\ntaking the flux between two bridges as proportional to the\npressure difference where the proportionality constant is\nthe inverse resistance. Secondly, there is a dynamic flow\nprocess whenever liquid bridges rupture. In that case,\nthe liquid is sucked back onto the grains very fast [20]\nand the film swells considerably. This causes a massive\ndecrease of flow resistance in the film and since the pressure is positive for thick films on bead surfaces, flow takes\nplace on a shorter time scale from the film to the bridges\nuntil the film has shrunk back to the minimal wetting\nlayer.\nBased on these considerations we propose the following\nimproved model: Since the volume of the minimal wetting layers on the beads is small compared to the volume\nin the bridges we do not consider the volume of the minimal films explicitly. Instead, whenever two beads come\ninto contact, we initialize the liquid bridge with a small\nvolume which is sucked out of the neighboring bridges.\nOnce a liquid bridge has formed, it becomes part of the\ncontact network in which the\nPvolumes are constantly updated according to V̇i = μ j (Pi − Pj ) where Pi is the\npressure in a contact i and the sum runs over all neighbors j of contact i and μ is the inverse flow resistance\nof the film which is a model parameter. Whenever a\nbridge ruptures, the liquid is equally split among the two\nparticles. Since the film swells (the volume of the film\nbecomes Vf ) and the flow resistance drops, we assume\nthat the liquid is instantaneously sucked into all neighboring bridges. Each bridge receives an amount of liquid\n∆Vi = A(Pf − Pi )/Li where Pf = Γ/R is the pressure in\nthe film with surface tension Γ, Li is the distance from\nthe rupture pointP\nto the bridge i and A is a normalization\nfactor such that i ∆Vi = Vf . Here, the total amount\nof liquid is conserved as opposed to suction controlled\nmodels, e.g. [22]. Note that the cylinder walls as well\nas the two bottom rings are considered to be completely\nhydrophobic.\nUsing this model we simulate shear flow in the circular split bottom shear cell with the same dimensions\nas in the experiment. However, since the system is rotationally invariant with respect to the z-axis we only\nconsider a sector of the cell with arc length θ = 0.0873.\nWe use periodic boundary conditions in the φ-direction,\nwhere in cylindrical coordinates, φ is the angular coordinate. Initially, all bridges have the same amount of liquid\nand we record the evolution of the liquid in the sample\nduring shear. Fig. 2 (b) shows a snapshot of the capillary bridge network after the same shear displacement\nas in experiments. The liquid distribution widens along\nz as in the experimental result. Curve Simulation M2 in\nFig. 3 shows the liquid distribution obtained using this\nmodel with μ = 0 averaged over 5 independent runs in\ngood agreement with the experimental data. Why could\n\nthe flow resistance μ−1 be set so small in the simulation? As previously mentioned, equilibration of liquid\nbridges for water takes about 5 min. However, the viscosity of the UV glue is 300 times larger and the surface\ntension is 1.5 times smaller than that of water such that\nthe expected equilibration time is about 7 hours which is\nvery large compared to the shearing velocity. This means\nthat the liquid structures do not have enough time to\nequilibrate, the flow takes place mainly via bridge rupture events leading to smaller bridge volumes inside the\nshear band. Decreasing the shearing velocity results in a\nsmaller depletion and in the limit ω → 0 we eventually\nrecover curve Simulation M1 in fig 3.\nWe now explain this behavior in terms of a theoretical\nmodel. For simplicity we first consider a one dimensional\nshear rate profile which e.g. occurs in plane shear flows\nbetween two parallel walls separated by some distance\nalong the z-direction. Here, the local shear rate depends\nonly on the z-coordinate. We divide the plane shear geometry into slices of thickness h along the z-axis. Since μ\nis small in our experimental system the main transport\nhappens via rupture of individual capillary bridges. If\npressure differences are not too large, there is on average\nan isotropic transport of liquid away from the rupture\npoint which is proportional to the volume of the ruptured bridge. Thus, the amount of liquid leaving a slice\nof our model plane shear geometry during a time interval\n∆t is proportional to the bridge rupture rate and to the\naverage bridge volume in the slice. The same holds for\nthe neighboring slices i − 1 and i + 1 such that the total\nchange of liquid in slice i can be written as\nχ∆t i−1 i−1\ni i\n(B Qb +B i+1 Qi+1\nb −2B Qb )\n2\n(1)\nwhere Qi is the total amount of liquid, Bi the bridge\nrupture rate, Qib the average bridge volume in slice i and\nχ is a geometrical proportionality factor which measures\nthe average amount of liquid leaving a slice after each\nrupture event. On length scales larger than h and ∆t → 0\nwe arrive to the following continuum equation\nQi (t+∆t)−Qi (t) =\n\nQ̇b = C\n\n∂2\n(γ̇Qb )\n∂z 2\n\n(2)\n\nwhere C is a constant and Qb is the average bridge volume. Since the bridge rupture rate is proportional to\nthe shear rate γ̇ and to the number of contacts, we replaced B by γ̇ and assumed that the number of contacts\nvaries much less with z than the shear rate. The particles themselves behave diffusively in plane shear flow\n[25]. Therefore, the liquid bridges also diffuse in space\nwhich gives rise to an additional diffusive contribution\nQ̇b ∼ (γ̇Qb )00 to eq. (2) which could be lumped into the\nconstant C.\nA nice feature of eq. 2 is that for constant γ̇, the liquid\nspreads diffusively as observed in a variety of industrial\n\n\f4\nprocesses, e.g. in tablet spray coating [13]. However, eq.\n(2) is not an ordinary diffusion equation as γ̇ is not a\nglobal constant. Indeed, the equation predicts that even\nhomogeneous liquid distributions will change if the second derivative of the shear rate profile γ̇ 00 with respect\nto z is large. We now address the liquid depletion pattern observed (see fig. 2): The shear rate profile in split\nbottom shear cell geometries is Gaussian [5, 26] and its\nwidth W (z) increases as a function of z. Therefore, at\nfixed z, γ̇ 00 is smallest and negative in the center of the\nshear band which causes a liquid content drop due to\nlarge fluxes away from the center induced by rupture of\nindividual bridges. However it is largest and positive at\nthe edges which explains the accumulation of liquid along\nthe edges of the shear band.\n\nQb [mm3 ]\n\n0.015\n\n0.01\n\n0.005\n0\n\nz = 18.12 mm\nz = 11.87 mm\nz = 5.62 mm\n\n10\n\n20\n\n30\n\nx [mm]\n\n40\n\n50\n\nFIG. 4. (Color online) The average bridge volume Qb in the\nlinear split bottom shear cell is plotted for different z as a\nfunction of x after a shear displacement of 8 m. The data\nfrom simulations (symbols) agrees well with the numerical\nsolution (lines) of eq. (2).\n\nIn order to validate the proposed model we simulate\nthe simpler linear split bottom shear cell which consists\nof two straight L-shapes sliding past each other and we\ncompare to the numerical solution of eq. 2. We now use\ncartesian coordinates where the x-direction is perpendicular and the y-direction is parallel to the slit and the\nz-direction is perpendicular to the bottom plates. To\nensure a homogenous sample, we add a frictionless top\nplate on which a force is exerted to confine the grains in\nthe container and we switch off gravity as well as cohesion. The dimensions of the system are now Lx = 50 mm,\nLy = 18 mm and Lz ∼ 19 mm and bead radii uniformly\ndistributed between 0.735 mm and 0.925 mm.\nOur system is effectively two dimensional, since it depends on both, x and z. Thus, we generalize Eq. (2)\nto Q̇ = C4(|γ̇|Q) where |γ̇| is the second invariant of\nthe shear rate tensor [27]. This equation is solved over\nthe domain z > 0.625 mm by using Neumann boundary\nconditions, the same initial condition and shear rate as\nin the simulation and C = 0.0675 mm2 . Fig. 4 shows\nthe simulation results for Qb as a function of x and different z (symbols) which are in good agreement with the\n\nnumerical solution of the previous equation (lines). Only\nfor small z, the results agree less well. We attribute this\nto the fact that the shear rate near the bottom rings\nvaries on small length scales which is not resolved in the\naverages of the simulations. Note that although the system is in mechanical steady state, the liquid distribution\nstill changes on longer time scales until |γ̇|Q is spatially\nconstant. According to eq. 2 the driving of liquid at\nthe beginning of shearing is inversely proportional to the\nwidth squared of the shear rate profile! We noticed that\nfor our system, rather large shear displacements lead to\nconsiderable liquid migration. However, shear bands occurring in nature, e.g. in soils can be very narrow such\nthat the strains needed to dry the shear band will be\nmuch smaller than presented in this work.\nIn conclusion, we found that liquid amount decreases\nwithin unsaturated shear bands at low liquid contents.\nA simple model for liquid redistribution explains this\ndiscovery. The driving mechanism is relative motion of\ngrains leading to bridge rupture and associated liquid\ntransport. We derived a modified diffusion equation describing liquid migration within the system and that was\nverified experimentally. Our work shows that knowing\nhow liquid is redistributed due to shear is crucial for prolonged simulations and experiments in the field of wet\ngranular matter e.g. in rheological measurements where\nlong lived shear banding is omnipresent. Especially at\nhigh shear rates, where liquid depletion and loss of capillary bridges may induce noticeable shear softening and\nthixotropic effects.\nWe would like to thank Martin Brinkmann for helpful\ndiscussions. We greatly acknowledge the provision of a\nlookup table allowing the determination of the Laplace\npressure by Ciro Semprebon as well as technical support\nby Daniel Breitenstein and Gabriele Peschke. We thank\nthe Deutsche Forschungsgemeinschaft (DFG) for financial support through grant No. HE 2732/11-1.\n\n∗\n\nElectronic address: manir@student.ethz.ch\n[1] P. Y. Hicher, H. Wahyudi, and D. Tessier, Computers\nand Geotechnics, 16, 205 (1994).\n[2] D. Henkel, Proc. ICE, Part II, 320 (1956).\n[3] S. Marello, N. Lenoir, G. Viggiani, P. Bésuelle,\nJ. Desrues, and M. Di Michiel, in Proc. of the International Workshop on X-ray CT for Geomaterials (2004)\npp. 139–146.\n[4] H. J. Tillemans and H. J. Herrmann, Physica A, 217,\n261 (1995).\n[5] J. A. Dijksman and M. van Hecke, Soft Matter, 6, 2901\n(2010).\n[6] D. G. Fredlund and H. Rahardjo, Soil mechanics for unsaturated soils (Wiley-IEEE, 1993).\n[7] J. K. Mitchell and K. Soga, Fundamentals of Soil Behavior (John Wiley & Sons, 2005).\n[8] M. R. Cunningham, A. Ridley, K. Dineen, and J. Bur-\n\n\f5\nland, Géotechnique, 53, 183 (2003).\n[9] M. Scheel, R. Seemann, M. Brinkmann, M. Di Michiel,\nA. Sheppard, B. Breidenbach, and S. Herminghaus, Nature Materials, 7, 189 (2008).\n[10] T. Van Asch, J. Buma, and L. Van Beek, Geomorphology, 30, 25 (1999).\n[11] H. Cetin, Tr. J. of Engineering and Environmental Science, 23, 465 (1999).\n[12] Y. Higo, F. Oka, S. Kimoto, T. Sanagawa, and Y. Matsushima, in Advances in Bifurcation and Degradation in\nGeomaterials (2011).\n[13] R. Turton, Powder Technol., 181, 186 (2008).\n[14] M. Jean, Comput. Methods Appl. Mech. Engrg., 177,\n235 (1999).\n[15] L. Brendel, T. Unger, and D. E. Wolf, \"The physics\nof granular media,\" (Wiley-VCH, Weinheim, 2004) pp.\n325–343.\n[16] D. Kadau, G. Bartels, L. Brendel, and D. E. Wolf, Phase\nTransit., 76, 315 (2003).\n[17] D. Kadau, H. Herrmann, and J. Andrade Jr., Eur. Phys.\nJ. E, 30, 275 (2009).\n\n[18] A. Taboada, N. Estrada, and F. Radjaı̈, Phys. Rev. Lett.,\n97, 098302 (2006).\n[19] C. D. Willet, M. J. Adams, S. A. Johnson, and J. P. K.\nSeville, Langmuir, 16, 9396 (2000).\n[20] S. Herminghaus, Advances in Physics, 54, 221 (2005).\n[21] S. Ulrich, T. Aspelmeier, A. Zippelius, K. Roeller, A. Fingerle, and S. Herminghaus, Phys. Rev. E, 80, 031306\n(2009).\n[22] L. Scholtès, P.-Y. Hicher, F. Nicot, B. Chareyre, and\nF. Darve, Int. J. for Numerical and Analytical Methods\nin Geomechanics, 33, 1289 (2009).\n[23] M. Kohonen, D. Geromichalos, M. Scheel, C. Schier, and\nS. Herminghaus, Physica A, 339, 7 (2004).\n[24] R. Seemann, W. Mönch, and S. Herminghaus, Europhysics Letters, 55, 698 (2001).\n[25] C. S. Campbell, J. Fluid Mech., 348, 85 (1997).\n[26] A. Ries, D. E. Wolf, and T. Unger, Phys. Rev. E, 76,\n051301 (2007).\n[27] P. Jop, Y. Forterre, and O. Pouliquen, Nature, 441, 727\n(2006).\n\n\f"}