{"id": "http://arxiv.org/abs/1205.2232v1", "guidislink": true, "updated": "2012-05-10T11:18:31Z", "updated_parsed": [2012, 5, 10, 11, 18, 31, 3, 131, 0], "published": "2012-05-10T11:18:31Z", "published_parsed": [2012, 5, 10, 11, 18, 31, 3, 131, 0], "title": "Electron backscattered diffraction method in the analysis of deformed\n  steel structures", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1205.3831%2C1205.3113%2C1205.0008%2C1205.3974%2C1205.1562%2C1205.0421%2C1205.0739%2C1205.2277%2C1205.0664%2C1205.3132%2C1205.3153%2C1205.0775%2C1205.4058%2C1205.0768%2C1205.0153%2C1205.3639%2C1205.3606%2C1205.1472%2C1205.4217%2C1205.3392%2C1205.0910%2C1205.0286%2C1205.4413%2C1205.0397%2C1205.2485%2C1205.0099%2C1205.2709%2C1205.4241%2C1205.3061%2C1205.0115%2C1205.3010%2C1205.1327%2C1205.3352%2C1205.0799%2C1205.1117%2C1205.0869%2C1205.0570%2C1205.2300%2C1205.2389%2C1205.2813%2C1205.3763%2C1205.3354%2C1205.4135%2C1205.2382%2C1205.3467%2C1205.3810%2C1205.0253%2C1205.1217%2C1205.2078%2C1205.0302%2C1205.3275%2C1205.2755%2C1205.4184%2C1205.2317%2C1205.1352%2C1205.2001%2C1205.3400%2C1205.0964%2C1205.3889%2C1205.2677%2C1205.4225%2C1205.4169%2C1205.0149%2C1205.2232%2C1205.2158%2C1205.4212%2C1205.3196%2C1205.1712%2C1205.0590%2C1205.2857%2C1205.0152%2C1205.2776%2C1205.3979%2C1205.1328%2C1205.2421%2C1205.0807%2C1205.4107%2C1205.2290%2C1205.0777%2C1205.2716%2C1205.2708%2C1205.0922%2C1205.2124%2C1205.1641%2C1205.0184%2C1205.2601%2C1205.4088%2C1205.1249%2C1205.0445%2C1205.1802%2C1205.0920%2C1205.0014%2C1205.0454%2C1205.4153%2C1205.1783%2C1205.1617%2C1205.3147%2C1205.3809%2C1205.2276%2C1205.0901%2C1205.3862&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Electron backscattered diffraction method in the analysis of deformed\n  steel structures"}, "summary": "The structure of low-carbon steel after twist extrusion is tested with using\nelectron backscattered diffraction. It has been shown that warm twist extrusion\nresults in grain refinement with conservation of a substantial part of\nhigh-angle boundaries, smearing of the texture, more homogeneous distribution\nof grains and development of the dynamic recrystallization processes.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1205.3831%2C1205.3113%2C1205.0008%2C1205.3974%2C1205.1562%2C1205.0421%2C1205.0739%2C1205.2277%2C1205.0664%2C1205.3132%2C1205.3153%2C1205.0775%2C1205.4058%2C1205.0768%2C1205.0153%2C1205.3639%2C1205.3606%2C1205.1472%2C1205.4217%2C1205.3392%2C1205.0910%2C1205.0286%2C1205.4413%2C1205.0397%2C1205.2485%2C1205.0099%2C1205.2709%2C1205.4241%2C1205.3061%2C1205.0115%2C1205.3010%2C1205.1327%2C1205.3352%2C1205.0799%2C1205.1117%2C1205.0869%2C1205.0570%2C1205.2300%2C1205.2389%2C1205.2813%2C1205.3763%2C1205.3354%2C1205.4135%2C1205.2382%2C1205.3467%2C1205.3810%2C1205.0253%2C1205.1217%2C1205.2078%2C1205.0302%2C1205.3275%2C1205.2755%2C1205.4184%2C1205.2317%2C1205.1352%2C1205.2001%2C1205.3400%2C1205.0964%2C1205.3889%2C1205.2677%2C1205.4225%2C1205.4169%2C1205.0149%2C1205.2232%2C1205.2158%2C1205.4212%2C1205.3196%2C1205.1712%2C1205.0590%2C1205.2857%2C1205.0152%2C1205.2776%2C1205.3979%2C1205.1328%2C1205.2421%2C1205.0807%2C1205.4107%2C1205.2290%2C1205.0777%2C1205.2716%2C1205.2708%2C1205.0922%2C1205.2124%2C1205.1641%2C1205.0184%2C1205.2601%2C1205.4088%2C1205.1249%2C1205.0445%2C1205.1802%2C1205.0920%2C1205.0014%2C1205.0454%2C1205.4153%2C1205.1783%2C1205.1617%2C1205.3147%2C1205.3809%2C1205.2276%2C1205.0901%2C1205.3862&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "The structure of low-carbon steel after twist extrusion is tested with using\nelectron backscattered diffraction. It has been shown that warm twist extrusion\nresults in grain refinement with conservation of a substantial part of\nhigh-angle boundaries, smearing of the texture, more homogeneous distribution\nof grains and development of the dynamic recrystallization processes."}, "authors": ["Elena Pashinska", "Victor Varyukhin", "Anatoliy Zavdoveev", "Valeriy Burkhovetskii", "Valentina Glazunova"], "author_detail": {"name": "Valentina Glazunova"}, "author": "Valentina Glazunova", "arxiv_comment": "6 pages, 6 figures", "links": [{"href": "http://arxiv.org/abs/1205.2232v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1205.2232v1", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "cond-mat.mtrl-sci", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cond-mat.mtrl-sci", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1205.2232v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1205.2232v1", "journal_reference": "Deformation and fracture of materials, N.6, 2012, p.35-41", "doi": null, "fulltext": "APS/123-QED\n\nElectron backscattered diffraction method in the analysis of deformed steel structures\nElena Pashinska, Victor Varyukhin, Anatoliy Zavdoveev, Valeriy Burkhovetskii, ValentinaGlazunova∗\n\narXiv:1205.2232v1 [cond-mat.mtrl-sci] 10 May 2012\n\nDonetsk Institute of Physics and Engineering, Ukrainian Academy of Sciences,\n83114, R.Luxemburg str. 72, Donetsk, Ukraine\n(Dated: September 21, 2018)\nThe structure of low-carbon steel after twist extrusion is tested with using electron backscattered\ndiffraction. It has been shown that warm twist extrusion results in grain refinement with conservation of a substantial part of high-angle boundaries, smearing of the texture, more homogeneous\ndistribution of grains and development of the dynamic recrystallization processes.\nPACS numbers: 61.05.-a, 61.05.J-\n\nI.\n\nINTRODUCTION\n\nIt is well known that severe plastic deformation allows\nobtaining of materials combining high strength with plasticity. One of such methods is twist extrusion (TE) that\nis extruding of a prismatic billet though the die with twist\nchannel. Channel geometry enables the deformed billet\nto preserve the size and the form identical to the initial\nstate. The maximum accumulated deformation per one\npass is e = tgβ (β is the descent angle of the twist line)\n[1, 2]. Earlier, we analyzed the effect of TE on the redistribution of alloying elements in low-carbon construction\nsteel and formulated general conceptions of morphological structure changes [3]. To obtain more detailed description of structure changes in low-carbon steels under\nTE, the method of automatic analysis of images of electron backscattering diffraction (EBSD) was used here [4].\nII.\n\nMATERIAL AND METHOD OF\nEXPERIMENT\n\nAs investigated material was low-carbon steel\n20G2C of the following composition, mass in percent:\n0, 24C; 1, 66M n; 1, 2Si; 0, 14Cr; 0, 24N i; 0, 01Al; 0, 04S.\nThe samples were obtained by warm forging (400°C)\nand succeeding milling down to cross-section of\n2439mm. Then the samples were annealed at 920°C for\n1 hour and cooled in air. The extrusion was carried\nout with hydraulic press performing three passes at\nPmax ≈ 200M P a and backpressure of 100P a. Before the\nfirst pass, the sample was heated up to 850 °C; before\nthe second and the third pass, the heating was done up\nto 400 °C; the temperature of the equipment was 320 °C\nin all the cases. The total accumulated deformation was\ne = 6.\nElectron scanning microscope JSM-6490LV (JEOL,\nJapan) with special holder for bulk samples of 10×10×15\nmm in size was used for EBSD analysis of structure\nchanges. The principle of the analysis is well known; electron beam scans the selected surface of the sample and\n\n∗\n\nzavdoveev@fti.dn.ua\n\nKikuchi images consisting of Kikuchi bands are plotted\nfor every point. Every band is associated with a definite\ngroup of crystal planes. Using software of HKLChanel5,\nwe established the position of each Kikuchi band, compared it with the theoretical data and calculated threedimensional crystallographic orientation of the lattice.\nThe obtained three-dimensional information was used for\nreconstruction of the microstructure.\nTo accumulate a representative sample, we had to\nanalyze at least 1500 grains on the specimen. Thus,\nthe following procedure was applied: magnification of\n×(600700) was used, scanning area was 150×100μ, scanning step was 500nm (at least 10 measuring points per\na grain). The degree of indicating was at least 80 percent , the required result was not achieved at a lower\nvalue. The method allowed both qualitative analysis by\nmapping and qualitative analysis using statistical data.\nBesides, texture analysis was done. For more detailed\nstructure reconstruction, the threshold of noise misorientation was established at 5°. At lower threshold, subgrain boundaries would be taken into account and the\nanalysis of EBSD-maps would be complicated. Nevertheless, when analyzing distributions of grains and subgrains and drawing pole figures, the whole data set was\naccounted including misorientations below the threshold\nof 5°.\nIII.\nA.\n\nRESULTS AND DISCUSSION\n\nMicrostructure reconstruction, qualitative\nanalysis\n\nFor the visualization of grain morphology, contrast\nmaps were created where grains were depicted in gray\ntones and grain boundaries were represented by black\nlines (Fig. 1, a, b). Contrast maps are similar to the\nstructure images obtained with the optical microscope.\nThe maps of small-angle and high-angle boundaries were\ndrawn for detailed analysis of the grain boundaries (Fig.\n1, c, d). Boundaries with the misorientation angle less\nthan 15° are colored in green and those above the given\nthreshold are colored in black.\nWe have obtained also the maps characterizing the\npart of strained (deformed) and unstrained (recrystal-\n\n\f2\n\nFIG. 1. Reconstruction of the microstructure of low-carbon steel in the initial state (a, c, e, g) and after torsional extrusion (b,\nd, f, h) by EBSD maps: a,b are contrast maps; c,d are maps of grain boundary misorientation; e,f are maps of re-crystallization;\nj,h are maps of Schmids factor\n\n\f3\nlized) grains (Fig. 1, e, f) in steel after TE: unstrained\nrecrystalized grains are marked by blue color, polygonized grains are marked by yellow color and deformed\ngrains are red (These maps have been built only for bcciron. Beside bcc-iron, steel contains some fcc-iron and\ncementite. According to EBSD data, the initial composition was as follows: 78, 5 percent of bcc iron, 1, 5 percent of fcc iron and 20 percent of F e3 C;the composition\nin the deformed state was: 92 percent of bcc iron, 2 percent of fcc iron and 6 percent of F e3 C.). The basic idea\nof these maps is that if there are no misorientations in\nthe neighbor pairs of the analyzed points within a grain,\nthe grain is identified as an unstrained recrystallized one.\nIn the case when misorientations between two neighbor\nsubgrains exceed 2°, the grain is polygnized and if they\nare above this value, the grain is a deformed one.\n\nFIG. 2. Frequency distribution of grains by size\n\nHomogeneity of deformation was analyzed with the use\nof Schmids maps. The slip system < 111 > (110) was\nselected as the most informative one in bcc iron. Schmids\nfactor is evaluated as [4]: m = cosλ* cosχ, where λ is the\nangle between the slip direction and the deformation axis,\nχ is the angle between the normal to the slip plane and\nthe deformation axis. The maximum value of Schmids\nfactor is achieved at χ = λ = 45°. A macroscopic shift\noccurs when the shear strain in the given slip system\nreaches the maximum value τ0 , that is called the critical\nshear strain. Shear strain τ is related to Schmids factor\nas τ = τ0 * m. Thus, Schmids maps shows, what grain will\nbe deformed earlier under uniaxial loading (these grains\nare colored in light, Fig. 1, j, h).\nCorrelation of ESBD-maps of different types is explicitly seen. All of them demonstrate grain refinement from\n15μ to 5μ after TE and substantial part of high-angle\nboundaries. This fact is confirmed by data of optical and\nelectron scanning microscopy.\nAfter warm deformation by TE, recrystallized ferrite\ngrains are detected in the material (Fig. 1 e, f). They\nare located mostly near high-angle boundaries but never\nwithin large grains. Similar location of recrystallized volume near grain boundaries was observed in the deformed\nnickel alloy [5]; a suggestion was made that recrystallization nuclei are formed in the most distorted areas of the\nlattice, i.e. at high-angle grain boundaries.\nNevertheless, small recrystallized grains were found\nwithin a large polygonized grain. In this case, we suppose\nthat they were formed from a few adjoining subgrains by\ndefect flow toward the polygonized grain boundary inside the grain. The result was the reduction of defect\ndensity in the subgrain and increased misorientation of\nthe boundary up to the high-angle one (Fig.1 f). This\nfact means that two processes (dynamical polygonization and dynamical recrystallization) progress simultaneously. These processes can occur jointly or by turns.\nThus, the analysis of EBSD maps gives evidences that\nthe structure of the tested steel consists of fragmented,\npolygonized and recrystallized grains.\n\nFIG. 3. Frequency distribution of misorientation angles of\ngrain boundaries\n\nB.\n\nQuantitative analysis\n\nOn the basis of statistical analysis of the data of EBSD\nmaps, graphs of the frequency distribution of the grain\nsize and misorientation angles were constructed. It follows from Fig.2 that the metal structure in the initial\nstate was characterized by bimodal grain distribution\nwith the maximums at 13 and 5μ, i.e. by explicit difference in the grain size. After TE, the distribution became\nmore homogeneous with the maximum at 5μ confirmed\nby EBSD-maps (see. Fig. 1, a, b).\nAccording to the distribution of grain boundary misorientation angles (Fig. 3), the specific part of high-angle\nboundaries in the initial material was about 91 percent\n. This parameter was retained at high level (84 percent)\nin the deformed material, too. The formation of smallangle boundaries could be explained by specific features\nof the material. For instance, in copper under TE, formation of small-angle boundaries prevails at the initial\ndeformation stages, but their amount is reduced at developed deformation [6]. We can suggest that high-angle\ngrain boundaries will dominate in steel at accumulation\n\n\f4\n\nFIG. 4. Component distribution of steel microstructure: 1\nrecrystallized grains, 2 polygonized grains; 3 deformed grains\n\nof higher deformation degree.\nFig. 4 illustrates parts of different grains depending\non the state of the material. The data were obtained by\nnumerical processing of EBSD maps (Fig.1 e,f). So, we\ncan make a conclusion that the content of recrystallized\ngrains in the initial state of the sample was 33, 4 percent, and this amount was reduced to 4, 7 percent after\nthe deformation. As the deformation of the sample in\nthe course of processing is substantial, all grains are deformed with succeeding passing the stages of defect density accumulation, fragmentation, dynamical polygonization and dynamical re-crystallization. Thus, occurrence\nof 4, 7 percent of recrystallized areas can be explained by\nactive relaxation processes. The effect of dynamical recrystallization of steel at severe plastic deformation was\nobserved in a number of experiments: for example, at\nECAP [7], HPT[8].\n\nC.\n\nTexture analysis\n\nAs distinct from traditional X-ray methods used for\nthe tests of large areas of a specimen, EBSD method allows detailed analysis of texture evolution in the selected\nzones. Figs. 5 and 6 demonstrate pole figures registered\nin the areas of about 15000μ2 in size. The analysis of\ninverse pole figures gives information not only about the\npresence of the texture in the sample but also about the\nmechanisms involved in the course of the processing. In\n\n[1] Ya. Beygelzimer V. Varyukhin D. Orlovand S. Sinkov,\nTwist extrusion process of deformation accumulation\n(TEAN, Donetsk, 2003).\n[2] Y. Beygelzimer, V. Varyukhin, S. Synkov, D. Orlov, Mat.\nSci. Eng. A503, 14, (2009).\n\nthe case of one of another prevailing pole density, we\ncan make conclusions about the dominating relaxation\nmechanism (intragrain or intergrain sliding), and texture\nevolution can be related to the change of deformation\nmechanisms or development of dynamical recrystallization [9]. If the maximum pole density is located near\n< 111 >and < 110 > orientation, the mechanisms of\ntwinning progressed actively within the sample [10]. If\nthe intensity of the outlet of normal lines is reduced, (the\ntexture is smearing) and the distribution becomes more\nhomogeneous as in the case considered above (Fig. 5),\nwe can say about activated non-crystallographic mechanisms of plastic deformation.\nTexture analysis cannot be accomplished without the\nanalysis of direct pole figures characterizing the density\nof the outlet of normal lines of definite crystallographic\nplanes (here these are < 111 >, < 110 >, < 100 >\nplanes). The direct pole figures confirm the fact that\naxial features of the texture are reduced in the tested\nsteel after TE, being weakly expressed in general. Two\nfactors can be associated with this phenomenon, these\nare peculiarities of the deformation scheme (transversal\nflow of metal) and relaxation processes. Accidentally arranged sharp texture maximums present in pole figures\ncan indicate to the appearance of recrystallized grains\n[9]. Because of possible ambiguity, this effect requires\nadditional investigations.\nIV.\n\nSHORT CONCLUSION\n\nThe use of EBSD method has revealed effect of twist\nextrusion of the structure of low-carbon construction\nsteel. Besides grain refinement and texture smearing,\nsuch treatment results in more homogeneous structure\nwith a substantial part of high-angle boundaries. This\nfact is explained by peculiarities of the deformation\nscheme at twist extrusion and evolution of relaxation processes.\nACKNOWLEDGMENTS\n\nThe authors are very grateful to Prof. S.V. Dobatkin\nfor the material granted for the experiments, to Dr. B.M.\nEfros for productive discussion and to providing engineer\nB.. Stebletsov for the aid in construction of the sample\nholder.\n\n[3] E. Pashinska S. Dobatkin V. Varyukhin Ya. Beygelzimerand A. Zavdoveev, Warm severe plastic deformation of building steel: structure and properties (12 European Congress on Advanced Materials and Processes\nEuromat, 12-15 September 2011, Montpellier, France,\nref2707 2011).\n\n\f5\n\nFIG. 5. Inverse pole figures of steel: initial state () deformed state (b)\n\nFIG. 6. Pole figures of steel: initial state () deformed state (b)\n\n[4] R. Larsen, Using EBSD to evaluate the anisotropic behavior and martensite formation in austenitic stainless\nsteel (Proc. EBSD Users Meeting. 2006, Hindsgavi Castle, Denmark, ref2707 2006).\n[5] S. Mitsche C. Sommitsch P. Polt, EBSD Analysis of\nthe recrystallization of the Nickel based alloy 80A during hot forming (Praktischen Metallographie. 2006., Son-\n\nderbnde, 43 2006).\n[6] V. Varyukhin E. Pashinska V. Tkachenko M. Mishlyaev,\nEvolution of structure and properties of FRTP Cu at\ntwist extrusion and further thermo deformation treatment (HP 2010, Sudak, Krimea, Ukraine, 143 2010).\n[7] S. Dobatkin P. Odessky and S. Shagalina, Mat. Sci. Forum. 584-586, 623 (2008).\n\n\f6\n[8] A Glezer, and L Metlov, Solid State Physics 52, 1090\n(2010).\n[9] M. Mishlyaev, S. Mironov, Yu. Perlovich,and\nM. Isaenkova, Report of Academy of Science 430,\n\n5, 618 (2010).\n[10] S. Dancette, L. Delannay, K. Renard, M. Melchior, and\nP. Jacques, Acta Materialia 60, 5, 2135 (2012).\n\n\f"}