{"id": "http://arxiv.org/abs/1111.3202v2", "guidislink": true, "updated": "2011-11-17T14:46:33Z", "updated_parsed": [2011, 11, 17, 14, 46, 33, 3, 321, 0], "published": "2011-11-14T13:15:05Z", "published_parsed": [2011, 11, 14, 13, 15, 5, 0, 318, 0], "title": "Averaging the AGN X-ray spectra from deep Chandra fields", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1111.6053%2C1111.6107%2C1111.0032%2C1111.2344%2C1111.4690%2C1111.3906%2C1111.1568%2C1111.1203%2C1111.6403%2C1111.3202%2C1111.1118%2C1111.3123%2C1111.3730%2C1111.5133%2C1111.1924%2C1111.4900%2C1111.6676%2C1111.2017%2C1111.2283%2C1111.5533%2C1111.0010%2C1111.1687%2C1111.2394%2C1111.5984%2C1111.3741%2C1111.0268%2C1111.4368%2C1111.4750%2C1111.1576%2C1111.6812%2C1111.0308%2C1111.4701%2C1111.5999%2C1111.5023%2C1111.2679%2C1111.3096%2C1111.5326%2C1111.2876%2C1111.3162%2C1111.0282%2C1111.2814%2C1111.0552%2C1111.4997%2C1111.2168%2C1111.2791%2C1111.1757%2C1111.1966%2C1111.2314%2C1111.7062%2C1111.5457%2C1111.3889%2C1111.1560%2C1111.5480%2C1111.5389%2C1111.0718%2C1111.4961%2C1111.1078%2C1111.6325%2C1111.4958%2C1111.0449%2C1111.1155%2C1111.0026%2C1111.4220%2C1111.0102%2C1111.1030%2C1111.6970%2C1111.5233%2C1111.1285%2C1111.2535%2C1111.1963%2C1111.1708%2C1111.7147%2C1111.6995%2C1111.0602%2C1111.3082%2C1111.3169%2C1111.3894%2C1111.2248%2C1111.2883%2C1111.1209%2C1111.1295%2C1111.0694%2C1111.6819%2C1111.4755%2C1111.5497%2C1111.6582%2C1111.1588%2C1111.0366%2C1111.1045%2C1111.4560%2C1111.2565%2C1111.6074%2C1111.2035%2C1111.0880%2C1111.6801%2C1111.3353%2C1111.1593%2C1111.5454%2C1111.6889%2C1111.2691%2C1111.7068&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Averaging the AGN X-ray spectra from deep Chandra fields"}, "summary": "The X-ray spectra of Active Galactic Nuclei (AGN) carry the signatures of the\nemission from the central region, close to the Super Massive Black Hole (SMBH).\nFor this reason, the study of deep X-ray spectra is a powerful instrument to\ninvestigate the origin of their emission.\n  The emission line most often observed in the X-ray spectra of AGN is Fe K. It\nis known that it can be broadened and deformed by relativistic effects if\nemitted close enough to the central SMBH. In recent statistical studies of the\nX-ray spectra of AGN samples, it is found that a narrow Fe line is ubiquitous,\nwhile whether the broad features are as common is still uncertain. We present\nhere the results of an investigation on the characteristics of the Fe line in\nthe average X-ray spectra of AGN in deep Chandra fields.\n  The average spectrum of the AGN is computed using Chandra spectra with more\nthan 200 net counts from the AEGIS, Chandra Deep Field North and Chandra Deep\nField South surveys. The sample spans a broader range of X-ray luminosities\nthan other samples studied with stacking methods up to z=3.5. We analyze the\naverage spectra of this sample using our own averaging method, checking the\nresults against extensive simulations. Subsamples defined in terms of column\ndensity of the local absorber, luminosity and z are also investigated.\n  We found a very significant Fe line with a narrow profile in all our samples\nand in almost all the subsamples that we constructed. The equivalent width (EW)\nof the narrow line estimated in the average spectrum of the full sample is 74\neV. The broad line component is significantly detected in the subsample of AGN\nwith L<1.43 1E44 cgs and z<0.76, with EW=108 eV.\n  We concluded that the narrow Fe line is an ubiquitous feature of the X-ray\nspectra of the AGN up to z=3.5.The broad line component is significant in the\nX-ray spectra of the AGN with low luminosity and low z.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1111.6053%2C1111.6107%2C1111.0032%2C1111.2344%2C1111.4690%2C1111.3906%2C1111.1568%2C1111.1203%2C1111.6403%2C1111.3202%2C1111.1118%2C1111.3123%2C1111.3730%2C1111.5133%2C1111.1924%2C1111.4900%2C1111.6676%2C1111.2017%2C1111.2283%2C1111.5533%2C1111.0010%2C1111.1687%2C1111.2394%2C1111.5984%2C1111.3741%2C1111.0268%2C1111.4368%2C1111.4750%2C1111.1576%2C1111.6812%2C1111.0308%2C1111.4701%2C1111.5999%2C1111.5023%2C1111.2679%2C1111.3096%2C1111.5326%2C1111.2876%2C1111.3162%2C1111.0282%2C1111.2814%2C1111.0552%2C1111.4997%2C1111.2168%2C1111.2791%2C1111.1757%2C1111.1966%2C1111.2314%2C1111.7062%2C1111.5457%2C1111.3889%2C1111.1560%2C1111.5480%2C1111.5389%2C1111.0718%2C1111.4961%2C1111.1078%2C1111.6325%2C1111.4958%2C1111.0449%2C1111.1155%2C1111.0026%2C1111.4220%2C1111.0102%2C1111.1030%2C1111.6970%2C1111.5233%2C1111.1285%2C1111.2535%2C1111.1963%2C1111.1708%2C1111.7147%2C1111.6995%2C1111.0602%2C1111.3082%2C1111.3169%2C1111.3894%2C1111.2248%2C1111.2883%2C1111.1209%2C1111.1295%2C1111.0694%2C1111.6819%2C1111.4755%2C1111.5497%2C1111.6582%2C1111.1588%2C1111.0366%2C1111.1045%2C1111.4560%2C1111.2565%2C1111.6074%2C1111.2035%2C1111.0880%2C1111.6801%2C1111.3353%2C1111.1593%2C1111.5454%2C1111.6889%2C1111.2691%2C1111.7068&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "The X-ray spectra of Active Galactic Nuclei (AGN) carry the signatures of the\nemission from the central region, close to the Super Massive Black Hole (SMBH).\nFor this reason, the study of deep X-ray spectra is a powerful instrument to\ninvestigate the origin of their emission.\n  The emission line most often observed in the X-ray spectra of AGN is Fe K. It\nis known that it can be broadened and deformed by relativistic effects if\nemitted close enough to the central SMBH. In recent statistical studies of the\nX-ray spectra of AGN samples, it is found that a narrow Fe line is ubiquitous,\nwhile whether the broad features are as common is still uncertain. We present\nhere the results of an investigation on the characteristics of the Fe line in\nthe average X-ray spectra of AGN in deep Chandra fields.\n  The average spectrum of the AGN is computed using Chandra spectra with more\nthan 200 net counts from the AEGIS, Chandra Deep Field North and Chandra Deep\nField South surveys. The sample spans a broader range of X-ray luminosities\nthan other samples studied with stacking methods up to z=3.5. We analyze the\naverage spectra of this sample using our own averaging method, checking the\nresults against extensive simulations. Subsamples defined in terms of column\ndensity of the local absorber, luminosity and z are also investigated.\n  We found a very significant Fe line with a narrow profile in all our samples\nand in almost all the subsamples that we constructed. The equivalent width (EW)\nof the narrow line estimated in the average spectrum of the full sample is 74\neV. The broad line component is significantly detected in the subsample of AGN\nwith L<1.43 1E44 cgs and z<0.76, with EW=108 eV.\n  We concluded that the narrow Fe line is an ubiquitous feature of the X-ray\nspectra of the AGN up to z=3.5.The broad line component is significant in the\nX-ray spectra of the AGN with low luminosity and low z."}, "authors": ["S. Falocco", "F. J. Carrera", "A. Corral", "E. Laird", "K. Nandra", "X. Barcons", "M. J. Page", "J. Digby-North"], "author_detail": {"name": "J. Digby-North"}, "author": "J. Digby-North", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1051/0004-6361/201117965", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1111.3202v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1111.3202v2", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "17 pages, 23 figures, accepted for publication in Astronomy &\n  Astrophysics. Replacements in the bibliography: Iwasawa K., Mainieri V.,\n  Brusa M., et al., 2011, arXiv:1111.2447v1 (previously: Iwasawa et al 2011, in\n  preparation); Mateos S., Carrera F.J., Page M.J., et al., 2010, \\aap, 510,\n  A35 (previously: Mateos S., Warwick R.S., Carrera F.J., et al., 2008, \\aap,\n  492, 51)", "arxiv_primary_category": {"term": "astro-ph.CO", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "astro-ph.CO", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1111.3202v2", "affiliation": "Astropysics Group Imperial College London UK", "arxiv_url": "http://arxiv.org/abs/1111.3202v2", "journal_reference": "A&A 538, A83 (2012)", "doi": "10.1051/0004-6361/201117965", "fulltext": "c ESO 2018\n\nAstronomy & Astrophysics manuscript no. paper\nOctober 8, 2018\n\nAveraging the AGN X-ray spectra from deep Chandra fields\nS. Falocco1 , F. J. Carrera1 , A. Corral5 , E. Laird2 , K. Nandra3,2 , X. Barcons1 , M. J.Page4 , and J. Digby-North2\n1\n2\n3\n4\n\narXiv:1111.3202v2 [astro-ph.CO] 17 Nov 2011\n\n5\n\nInstituto de Fı́sica de Cantabria (CSIC-UC) 39005 Santander, Spain\ne-mail: faloccco@ifca.unican.es\nAstropysics Group, Imperial College London, Blackett Laboratory, Prince Consort Road, London, SW7 2AZ, UK\nMax Planck Institute für Extraterrestriche Physik. 85748 Garching, Germany\nMullard Space Science Laboratory, University College London, Holmbury St. Mary, Dorking , Surrey RH5 6NT, UK\nOsservatorio Astronomico di Brera INAF, Via Brera 28, CAP 20121, Milano, Italy\n\nAccepted on 10 November 2011\nABSTRACT\n\nContext. The X-ray spectra of Active Galactic Nuclei (AGN) carry the signatures of the emission from the central region, close to the\nSuper Massive Black Hole (SMBH). For this reason, the study of deep X-ray spectra is a powerful instrument to investigate the origin\nof their emission.\nAims. The emission line most often observed in the X-ray spectra of AGN is Fe Kα . It is known that it can be broadened and deformed\nby relativistic effects if emitted close enough to the central SMBH. In recent statistical studies of the X -ray spectra of AGN samples,\nit is found that a narrow Fe line is ubiquitous, while whether the broad features are as common is still uncertain. We present here the\nresults of an investigation on the characteristics of the Fe line in the average X-ray spectra of AGN in deep Chandra fields.\nMethods. The average spectrum of the AGN is computed using Chandra spectra with more than 200 net counts from the AEGIS,\nChandra Deep Field North (CDF-N) and Chandra Deep Field South (CDF-S) surveys. The sample spans a broader range of X-ray\nluminosities than other samples studied with stacking methods up to z ∼ 3.5. We analyze the average spectra of this sample using\nour own averaging method, checking the results against extensive simulations. Subsamples defined in terms of column density of the\nlocal absorber, redshift and luminosity are also investigated.\nResults. We found a very significant Fe line with a narrow profile in all our samples and in almost all the subsamples that we\nconstructed. The equivalent width of the narrow line estimated in the average spectrum of the full sample is 74 eV. The broad\ncomponent of the Fe line is significantly detected in the subsample of AGN with L < 1.43 × 1044 erg s−1 and z < 0.76, with an\nequivalent width 108 eV.\nConclusions. We concluded that the narrow Fe line is an ubiquitous feature of the X-ray spectra of AGN up to hzi ∼ 3.5. The broad\ncomponent of the Fe line is significantly detected in the X-ray spectra of the AGN with low luminosity and low reshift.\nKey words. Galaxies: Active –X-rays: galaxies\n\n1. Introduction\nThe X-ray spectra of AGN are emitted from the innermost\nregions of the central engine, close to the central SMBH.\nAccordingly to the currently accepted model described in detail\nby Shakura et al. (1974), AGN are powered by accretion to the\nSMBH, with large amounts of potential energy released in the\naccretion disc. Assuming an optically thick, geometrically thin\naccretion disc, the optical-UV primary emission of the AGN is\nexplained as the result of the thermal emission from the accretion disc.\nIt is well known that the emission in hard X-rays is dominated by a powerlaw with Γ ∼ 2, and the most widely accepted\ninterpretation for it invokes a hot plasma surrounding the accretion disc that makes inverse Compton scattering of the thermal\noptical-UV photons from the accretion disc (Haardt et al. 1991).\nPart of the primary emission is reflected by the accretion\ndisc producing Compton reflection (especially significant above\n10 keV) and several fluorescence lines, the most important one\nbeing the Fe Kα line at 6.4 keV for neutral Fe (and 6.7-6.9\nkeV for Fe in the most highly ionized states), as described in\nMatt et al. (1991) and George & Fabian (1991). Reflection can\nalso occur at larger scales, in the torus. The line profile gives\n\nvaluable information about the emitting processes and the regions where they occur.\nThe study of the trend of the narrow Fe line equivalent width\n(EW) with continuum luminosity plays a fundamental role in\nthe investigation of the link between the continuum emitting\nregion and the reflecting region. A decrease of Fe line intensity with increasing continuum luminosity was found in Ginga\nobservations of AGN ( Iwasawa et al. 1993). The trend (the so\ncalled \"Iwasawa Taniguchi effect\", hereafter \"IT effect\") was\nwidely confirmed for both broad and narrow Fe lines by observations of ASCA, by Nandra et al. (1997), and more recently\nfor the narrow Fe lines, for example in Bianchi et al. (2007) and\nPage et al. (2004), using XMM-Newton data. Although the IT effect is widely proved, the reason for the anti-correlation between\nthe line and the continuum intensity is still under investigation:\nNandra et al. (1997) attributed the IT effect to the ionization that\ncan be important in high luminosity.\nAs the torus and the disc can both contribute in different measure to the observed Fe line, the resulting profile will be complex, and in particular it will depend on the inclination angle of\nthe disc with respect to the line of sight. The estimated intrinsic\ncolumn density in X-rays (NH ) is, in this sense, connected to the\nline properties: a increase of the Fe line intensity with increasing NH was found in a sample of AGN observed by Ginga and\n1\n\n\fS. Falocco et al.: Averaging the AGN X-ray spectra from deep Chandra fields\n\nAsca (Gilli et al. 1999). In that work, the Fe line in the spectra of\nthe absorbed AGN (type 2 AGN) was more intense than the line\nfound in the unabsorbed ones (type 1 AGN). This was predicted\nby Ghisellini et al. (1994), who performed a theoretical analysis\nof the Fe line in a configuration with torus and accretion disc\non the same plane. In this picture, the line intensity produced by\nreflection and transmission in the torus increases with the NH ,\nwhile the continuum emission is depleted, leading to an increase\nof the line equivalent width for the highest NH .\nIt should be noted that the lines produced by reflection in the\ntorus should have a narrow and approximately Gaussian profile,\nwhile the lines produced in the accretion disc should be broadened and deformed by the effect of the newtonian movement\nof the gas in the accretion disc around the SMBH. It is also\npossible to detect in the lines the relativistic features, such as\na red wing due to gravitational redshift, among other features,\nexplained in detail in Fabian et al. (2000). These features come\nfrom the innermost regions of the accretion disc, as the relativistic effects are due to the strong gravitational field close to the\ncentral SMBH. From the study of these features it is possible to\nobtain the inner radius of the accretion disc, which is expected\nto be 6 gravitational radii (Rg ) for a non-rotating BH, called a\nSchwarzschild BH, down to 1.23 Rg for a maximally rotating\nBH, called a Kerr BH (Bardeen at al. 1972).\nEarly results from ASCA showed broad and deformed lines:\nNandra et al. (1997) performed a spectral analysis of a sample of\nlocal Seyferts, finding broad components in about 65% of their\nsample. Unambiguous broad lines were found also in more recent well exposed XMM-Newton observations of AGN (e.g. in\nNandra et al. 2006, Braito et al. 2007 and Fabian et al. 2002).\nIt has been proved by Guainazzi et al. (2006) that X-ray\nspectra with good statistical quality are necessary to detect any\nbroad Fe line component, which would otherwise be hidden under the noise. In this context statistical methods, like summing\n(stacking) or averaging the spectra, have been recently introduced in X-ray astronomy to allow the study of large AGN samples including the low quality spectra that otherwise could not\nbe well analyzed individually.\nThe first of such works is that of Streblyanska et al. (2005),\nwho performed a stacking analysis on the XMM-Newton observation of the Lockmann Hole, finding a large line EW and broad\nline profile.\nBrusa et al. (2005) stacked the spectra of CDF-N (2 Ms exposure time) and CDF-S (1 Ms exposure time) surveys by the\nChandra satellite. They computed the stacked spectra in bins\nof redshift aiming at characterizing the Fe line emission of the\nsources in the X-ray background up to z ∼ 4. They found an intense and apparently broad 6.4 keV Fe line with an EW consistent with the results of Streblyanska et al. (2005). To explain the\nred component, they argued that it can strongly depend on the\nmodeling of the underlying continuum and that a spurious red\nwing might be produced by the contribution of absorbed spectra\nat different redshifts.\nIn recent studies of X-ray spectra using this approach, finding broad lines with relativistic profiles has been proved to be not\nvery common, for example in Guainazzi et al. (2006) in the analysis of AGN spectra observed with XMM-Newton. They found\nthat 25% of their sample had relativistic lines; this percentage is\n50% for higher signal-to-noise ratio, selecting only spectra with\nlarge numbers of counts. Moreover, they found the strongest relativistic profiles in low luminosity objects.\nCorral et al. (2008) averaged the XMM-Newton spectra of\ntype 1 AGN, using the AXIS (Mateos et al. 2005) and XWAS\n(Mateos et al. 2010) samples, up to redshift ∼ 3.5. They found\n2\n\na narrow Fe line, while no clear evidence of a broad line was\nfound. The reason for the discrepancies between this work and\nthat of Streblyanska et al. (2005) can be explained considering the differences of the samples, as the Corral et al. (2008)\nsample has higher luminosities (and therefore lower predicted\nEWs, following the IT effect) and less spectral counts, including more noisy sources. Another reason for the discrepancy can be found in the method, since Corral et al. (2008)\nestimate the continuum shape using simulations, while in\nStreblyanska et al. (2005) it was not constructed and subtracted\nin the same way and this could introduce some uncertainties.\nMoreover, Streblyanska et al. (2005) binned the spectra before\nstacking them, and Yaqoob (2006) showed that this procedure\ncan introduce features like a broad red tail in an emission line.\nA stacking analysis of a deep and complete sample of 507\nAGN with z < 4.5 defined from the 2XMM catalogue was performed by Chaudhary et al. (2010). They were able to characterize the properties of the stacked spectrum of the AGN, such as\nthe Fe line shape and the dependence of its intensity with X-ray\ncontinuum luminosity and the redshift. They found a clear evidence of a narrow neutral Fe line, and they confirmed the IT\neffect in AGN over a broad range of redshift.\nRecently, a stacking analysis on XMM-Newton Xray spectra of the COSMOS sample was performed\n(Iwasawa et al. 2011): they found an excess on the highenergy side of the Fe line, interpreted as the convolution of\nnarrow lines from ionized Fe.\nIn summary, according to recent results, while the narrow Fe lines are commonly detected in the spectra, clear evidence for relativistic lines is rare. The paucity of relativistic lines is a problem, as they are expected in the accretion disc scenario. There are a number of possible solutions\nfor this problem. The first one invokes the presence of ionized discs (Iwasawa et al. 2011, Matt et al. 1996); the second\nsolution explains it with the presence of fastly spinning BH\n(Iwasawa et al. 1996 and Fabian et al. 2002): in this case the\nlines would be very broad and sometimes difficult to separate\nfrom the continuum. The last explanation for the lack of broad\nlines postulates truncated discs, as found by Matt et al. (2005).\nWe present in this paper a stacking analysis of a comprehensive sample of absorbed and unabsorbed AGN in the\ndeepest Chandra surveys: AEGIS and Chandra Deep Fields.\nWe followed the method presented by Corral et al. (2008), and\nwe accurately tested and adapted it for Chandra spectra, in\norder to carefully check our results. The Chandra sample in\nthis work allows us to explore the properties of AGN with\nthe best statistics ever reached at high redshift, as it is deeper\nthan the XMM-Newton samples that have previously been analyzed with stacking techniques, such as Corral et al. (2008)\nand Chaudhary et al. (2010) (see Sect. 2.2). In comparison with\nthe previous stacking analysis of the Chandra samples in\nBrusa et al. (2005), we include the sources from the AEGIS-X\nsurvey, improving the statistics of high luminosity AGN, and we\nuse the more recent (2 Ms) observation of the CDFS (Sect. 2.1).\nThe paper is organized as follows: the properties of the sample are described in Sect. 2; the method in Sect. 3; discussion of\nthe results is in Sect. 4; we summarize the conclusions in Sect.\n5.\nAcross this paper, we adopt the cosmological parameters:\nH 0 =70 km s−1 Mpc−1 ; Ωλ =0.7 (Komatsu et al. 2011).\nIn this paper, all the counts refer to the net number of counts\nbetween 2 and 12 keV rest-frame; all the luminosities are calculated between 2 and 10 keV rest-frame and are corrected\nfor Galactic and intrinsic absorption using the fits to the in-\n\n\fS. Falocco et al.: Averaging the AGN X-ray spectra from deep Chandra fields\n\ndividual spectra (see below). We have used XSPEC v. 12.5\n(Arnaud, 1996) for spectral analysis.\n\n2. X-ray samples\nThe X-ray results presented in this paper are obtained from the\nChandra observations of the AEGIS, CDF-N and CDF-S surveys.\n2.1. Parent Chandra surveys\n\nThe AEGIS-X survey is a Chandra survey of the Extended\nGroth Strip (EGS) region, designed primarily for studying the\nco-evolution of black holes and their host galaxies. The data\nwe used are the result of 8 contiguous Advanced CCD Imaging\nSpectrometer (ACIS-I) pointings, each with exposure 200 ks, totalling 1.6 Ms. The survey covers a total area of approximately\n2302 arcmin2 a in a strip of length 2 degrees. The total number of\nidentified sources with spectroscopic redshifts is 409. The data\nreduction and point source detection algorithms used to analyze\nthese data are described in Laird et al. (2009).\nThe Chandra Deep Field-North (CDF-N) survey is one of\nthe deepest (2Ms with ACIS-I) 0.5-8.0 keV surveys ever made:\nnearly 600 X-ray sources are detected over 448 arcmin2 . The\ntotal number of sources identified with spectroscopic redshifts is\n307. Details of data reduction and the point source catalog are\ndescribed in the paper by Alexander et al. (2003).\nThe Chandra Deep Field South (CDF-S) is the deepest and\nmost sensitive observation obtained with Chandra. We used\nthe 2 Ms survey, covering an area of 436 arcmin2 . Several\nhundred X-ray point sources were detected. The number of\nsources identified with spectroscopic redshifts is 152. A detailed description of the survey can be found in the paper\nLuo et al. (2008). It has been recently extended to 4 Ms, as described in Alexander et al. (2011), and Xue et al. (2011).\n2.2. Sample definition and properties\n\nOur main purpose is to study the average spectrum of AGN in the\n2-12 keV energy band (rest-frame), and to determine the shape\nof the Fe line at ∼6.4 keV. The X-ray spectra of our sample have\nfew counts and do not allow a detailed analysis of the individual spectra, except for a handful of sources. For the detection\nof any relativistically broadened component, as underlined by\nGuainazzi et al. (2006), it is necessary to have good quality spectra, hence we need to improve the signal-to-noise ratio.\nTo increase the probability of detecting any broad component that otherwise would be hidden by the noise, we included\nin our analysis only those sources with more than 200 counts.\nWe discuss in Appendix A the results corresponding to lower\nthresholds (50 and 100 counts). We further selected only sources\nwith spectroscopic redshifts. Finally, we excluded from our analysis also two sources with more than 10000 counts individually: CDFS− 056 (RA: 53.112, DEC: -27.685), CDFN− 141 (RA:\n189.1, DEC: 62.383). These sources have such a strong signal\nin their spectra that they would largely dominate the average\nstracked spectrum.\nOur full sample contains 123 sources with spectroscopic redshifts and more than 200 counts each (but less than 10000 cts),\nwith 70667 counts in total (see Table 1). The distribution of the\nnet counts per source for this full sample is shown in Fig.1. The\nredshift distribution of the sources is shown in Fig. 2, where we\n\nFig. 1. Distribution of the net counts between 2 and 12 keV\nrest-frame. Filled histogram: CDF-S; histogram with horizontal\nstripes: AEGIS, histogram with vertical stripes: CDF-N.\n\nFig. 2. Redshift distribution. Filled histogram: CDF-S; histogram with horizontal stripes: AEGIS, histogram with vertical\nstripes: CDF-N.\ncan see that our sample spans a broad range of redshifts from\nz = 0 up to z = 3.5.\nSource and background spectra, and their ancillary\nand response matrices were extracted for each source\n(Digby-North, 2011), using the tool ACIS-EXTRACT, version\n2008-03-04, Broos et al. (2010). Before spectral fitting, all the\nspectra were grouped with a minimum of 5 counts per bin,\nand we applied the modified Cash statistics discussed in the\nXSPEC pages 1 . This grouping was adopted because we used the\nsame method for all the sources with more than 50 counts (see\nAppendix A), for which the more common χ2 statistics would\nnot be adequate.\nIt should be noted that in this step we did not aim at making\na detailed analysis of the individual spectra but rather only at obtaining a set of parameters that we use to unfold the spectra for\nall the instrumental effects (see Sect. 3). The model is a single\npower law modified by Galactic absorption (with fixed values at\n1.4 ×1020 cm−2 for AEGIS, 0.772 ×1020 cm−2 for CDF-S, 0.993\n×1020 cm−2 for CDF-N) plus intrinsic absorption at the redshift\nof each source. We left the slope of the power law, its normalization and the intrinsic column density as free parameters. The\nfit was performed in the rest-frame energy range between 1 and\n12 keV, minimizing the contribution from any putative soft excess present in the sources. The resulting distribution of intrinsic\n1\n\nhttp://heasarc.gsfc.nasa.gov/docs/xanadu/xspec/wstat.ps\n3\n\n\f44\n43\n42\n41\n\nlog ( Luminosity 2−10 keV [erg/s] )\n\n45\n\nS. Falocco et al.: Averaging the AGN X-ray spectra from deep Chandra fields\n\n0\n\nFig. 4. Distribution of rest-frame 2-10 keV luminosities in units\nof erg s−1 . Filled histogram: CDF-S; histogram with horizontal\nstripes: AEGIS, histogram with vertical stripes: CDF-N.\n\ncolumn densities is shown in Fig.3. Most of the highly absorbed\nsources belong to CDF-S, as indicated by the higher average column density for that sample in Table 1.\n2.3. Subsample definition\n\nWe show in Fig. 4 the distribution of the X-ray luminosities of\nthe sources corrected for Galactic and intrinsic absorption, calculated from the fit to the indvidual spectra. The average luminosity of the AEGIS sources is one order of magnitude higher\nthan the average luminosity of CDF-N and CDF-S sources\n(Table 1).\nWe compared the distribution of our ful sample in the\nluminosity-redshift plane with that of Streblyanska et al. (2005)\nin the Lockmann Hole (Fig. 5): we sample better that plane at\nz < 3 for all luminosities. Compared to the Corral et al. (2008)\nsample (XMS-XWAS) (Fig. 6) we cover about one order of magnitude lower luminosities for 0.5 < z < 3. Finally, with respect\nto Brusa et al. (2005), the addition of the AEGIS sample and the\nrestriction to sources with high numbers of counts, allows us to\nspan a broader range of luminosities at similar z. In summary,\nour sample combines a unique combination of deep coverage\n4\n\n1\n\n2\nredshift\n\n3\n\n4\n\n42\n\n44\n\nFig. 5. Comparison of our full sample (black stars) with the deep\nXMM-Newton sample of Streblyanska et al. (2005) (LH, red triangles), in the luminosity-redshift plane.\n\nlog ( Luminosity 2−10 keV [erg/s] )\n\nFig. 3. Distribution of intrinsic column density in units of 1022\ncm−2 . Filled histogram: CDF-S; histogram with horizontal\nstripes: AEGIS, histogram with vertical stripes: CDF-N. We\ngrouped the spectra with log(NH) < 1020 with the spectra having\nlog(NH ) = 1020 .\n\n0\n\n1\n\n2\nredshift\n\n3\n\n4\n\nFig. 6. Comparison of our full sample (black stars) with\nthe medium XMM-Newton sample of Corral et al. (2008)\n(XMS+XWAS, red triangles), in the luminosity-redfhit\nplane. For clarity, we omitted one XMS+XWAS source of\nXMS+XWAS at z = 2.34, L = 1.28 × 1047 erg s−1 .\nwith high z sources, a broad span of luminosities and good statistics.\nOne of the main aims of our work is to understand the dependence of the spectral properties of the AGN on luminosity,\nredshift, and intrinsic absorption. For this reason, we performed\nthe analysis of the stacked spectra not only for the full sample,\nbut also for subsamples defined in terms of column density, luminosity, and redshift. Except for NH (see below) the bins have\nbeen designed to have a similar numbers of total counts each.\nThe characteristics of each subsample can be seen in Table 1.\n– Intrinsic NH : The threshold column density was set at\nlog(NH /cm−2 ) = 21.5 as the absorption features of the X-ray\nspectra are detected in the AGN with log(NH /cm−2 ) > 21.5.\nLocal absorbers with log(NH /cm−2 ) = 21.5 are opaque for\nE < 1 keV and transparent for E > 1 keV. The transition\nenergy between the transparent and opaque regime linearly\ngrows with NH , until NH ∼ 1024 cm−2 , where the Compton\nThick regime dominates. We show in Fig. 7 the distribution\n\n\fS. Falocco et al.: Averaging the AGN X-ray spectra from deep Chandra fields\n0.1\n0.05\n\nnormalized counts s−1 keV−1\n\n2\nredshift\n\n3\n\nFig. 7. Distribution of the unabsorbed (red triangles) and absorbed (black diamonds) subsamples (see Sect. 2.3) in the\nluminosity-redshift plane.\n\n0.01\n\n1\n\n2\n\n5\nEnergy (keV)\n\n10\n\nFig. 9. Average observed spectrum of the full sample fitted with\na powerlaw between 2 and 5 keV.\n\n45\n\nresults are very similar and we have used the latter definition\nof distinct areas as our default.\n\n44\n\n3. Analysis method\n\n43\n\n3.1. Averaging method\n\n42\n\nlog ( Luminosity 2−10 keV [erg/s] )\n\n0.02\n\n44\n43\n42\n\nlog ( Luminosity 2−10 keV [erg/s] )\n\n45\n\nTotal sample\n\n1\n\n2\nredshift\n\n3\n\nFig. 8. Distribution of the L − z subsamples (see text) in the\nluminosity-redshift plane. The dividing point is z = 0.76, L =\n1.435 × 1044 erg s−1 (marked by the horizontal and vertical solid\nlines). The three blue stars mark the sources that allow defining\ndistinct L − z subsamples (see text).\n\nof the absorbed and unabsorbed subsamples just defined: the\ntwo subsamples have a similar distribution in the luminosityredshift plane, so they are fair representations of the AGN\nwith and without absorption, with no other parameters playing an important role (see also Table 1).\n– Luminosity: We separated high and low luminosity sources\nusing a threshold L = 8 × 1043 erg s−1\n– z: We built a low-z and a high-z subsample with a threshold\nz = 1.005\n– L−z: Initially we divided the full sample in three subsamples:\n(i) z < 0.76 (hereafter low z-low L) (ii) z > 0.76 and L <\n14.35 × 1043 erg/s (hereafter high z-low L) (iii) z > 0.76 and\nL > 14.35 ×1043 erg/s (hereafter high z-high L). In the low zlow L subsample there are only 3 sources above L < 14.35 ×\n1043 erg/s (with ∼4000 total counts), so we have also used a\nsecond version of this subsample using only sources with z <\n0.76, L < 14.35 × 1043 erg/s so that this subsample and the\ntwo high z subsamples cover distinct z and L intervals. All\n\nOur averaging method was presented for the first time in\nCorral et al. (2008) for the XMM-Newton spectra of XMSXWAS surveys; it was then also used for the study of the XBS\nsample by Corral et al. (2011). We adapted and tested it for the\nChandra spectra.\nAfter fitting the spectra as described in Sect.2.2, we read into\nXSPEC again each un-binned, background-subtracted spectrum,\nwe applied the corresponding best fit model and we extracted\nthe unfolded spectra taking into account the detector response\n(eufspec command in XSPEC). In this step it is possible that\nsome distortions to narrow spectral features were introduced,\nsuch as to the Fe emission line. In order to quantify this effect,\nwe performed extensive simulations of the continuum and of the\nFe Line as described in Sect.3.2 and 3.3. Once we obtained all\nthe unfolded spectra, the following step was to apply the corrections described in Corral et al. (2008) that we can summarize as\nfollows:\n1. Correction for Galactic absorption\n2. Shift the spectra to a common redshift frame\n3. Re-normalize the spectra with respect to the integrated flux\nbetween 2 and 5 keV restframe\nOnce we obtained the de-absorbed and re-normalized spectra at rest-frame, we re-binned each spectrum. For simplicity, we\nused the same binning for all the average spectra, applying the\nbin definitions of the absorbed sample: this binning was constructed in order to have at least 1000 net counts in each bin of\nthe co-added spectrum. In order to maximize our ability to detect a narrow Fe line, we always centered one bin at 6.4 keV.\nWe finally averaged the spectra using the unweighted arithmetic\naverage.\nWe show in Fig. 9 the average spectrum of the total sample.\nIf we fit the 2-5 keV range with a powerlaw and extrapolate it\nto the full range, an excess can be clearly seen around the expected position of the Fe emission line. However, any features\n5\n\n\fS. Falocco et al.: Averaging the AGN X-ray spectra from deep Chandra fields\n\n0.2\n0.1\n\nNormalized FE\n\n0.5\n\nTotal sample\n\n2\n\n5\nEnergy (keV)\n\n10\n\nFig. 10. Average observed spectrum of the full sample (data\npoints) with the average simulated continuum (continuous line)\nand the one sigma confidence limits (dashed lines).\nfound in the average spectra must be carefully evaluated, as the\naveraging procedure itself may introduce some distortions. For\nthis reason, we computed the continuum using simulations, as\ndescribed below.\n\nwith Γ fixed at 1.9, with unit normalization, and a zero sigma\nGaussian. The input EW was 200 eV and energy fixed at 6.4 keV,\nat the z of each source. We made the correction for the response\n(using a power law with Gamma fixed at 1.9) and we finally\ncomputed the average spectrum with the same treatment applied\nto the real spectra.\nWe show in columns Γsimline , σsimline and EW of Table 1 the\nresults of fitting a powerlaw plus a Gaussian to these simulations\nfor some of the samples. The EW and powerlaw slope are recovered very well. The width of the line has become σ ∼ 120 eV.\nTherefore, our resulting \"instrumental resolution\" is around 120\neV, i.e., any real detected feature around rest-frame 6.4 keV\nshould be wider than this value and its actual width will be the\nconvolution of its intrinsic width with this value, roughly added\nin quadrature (see Eq. 1 below).\nWe show in the bottom-left corner of Fig. 14 the expected\nprofile of an unresolved 6.4 keV line added to the simulated\ncontinuum for the corresponding subsample. In general, the features we observe around that energy appear to be compatible\nwith such an unresolved line, except perhaps for the low z-low\nL, high z-high L and high L subsamples. We will quantify these\nqualitative impressions in Section 4.2.\n\n4. Results\n3.2. Simulations of the continuum\n\nPrevious works, as for example Yaqoob (2007) and\nCorral et al. (2008), have shown that the unfolding and the\naveraging process can distort the shape of the spectrum.\nTherefore, it is important to take this into account before\nderiving conclusions from the spectral analysis of the average\nspectrum.\nIn order to characterize the underlying continuum of our\nsample, we made 100 simulations of each source using the best\nfit parameters of the continuum model (see Sect. 2.2). To each\nof these 100 simulated samples we applied the same method as\nthe one used for the observed sample (spectral fitting, correcting\nfor response, correcting for Galactic absorption and z, rescaling\nand averaging). After this, we represented our continuum with\nthe median of the 100 averaged simulated continua. We decided\nto use the median and not the arithmetic average as it is a more\nrobust estimate of a central value and in particular it is less sensitive to extreme values. Hereafter we will call this the simulated\ncontinuum.\nWe represent in Figs. 10, 11, 12, 13, and 14 the average observed spectra (dots with error bars), along with the simulated\ncontinua (solid lines), and the 1 sigma confidence limits (dashed\nlines). The latter correspond to the 16th and 84th element of\nthe sorted fluxes of the simulated spectra at each bin. Features\naround the expected location of the Fe K line are conspicuous in\nall the subsamples.\nBefore attempting to draw any conclusions from those features, we have characterized the effect of our averaging method\non narrow lines using simulations, as described in the next section.\n3.3. Simulations of the Fe Line\n\nWe performed simulations of unresolved Fe lines in order to\nstudy how the spectral resolution of ACIS-I and the averaging\nprocess widen the narrow spectral features in X-ray spectra.\nWe simulated high signal to noise spectra (one simulation\nfor each spectrum, without Poissonian noise) using a powerlaw\n6\n\nIn this section we study the statistical significance of the Fe line\nand its properties in several steps. We first developed a modelindependent way to calculate the significance of the line detection (Sect. 4.1), then we studied again its significance and characteristics fitting the average spectra using a single Gaussian to\nfit the Fe line (Sect. 4.2). In Sect. 4.3 we study the dependence\nof the line on z and X-ray luminosity. Finally, in Sect. 4.4 we try\ncomplex line models with those subsamples that show significant broad line profiles.\n4.1. Significance from the simulations\n\nIn order to estimate the significance of the excess observed in the\nFe K line region, we calculated the percentage of average simulated spectra (from the simulations of the continuum described\nin Sect. 3.2) having a flux in the Fe K region which is lower\nthan the flux of the observed spectrum. We should note that this\nmethod does not depend on a modeling of the continuum (as in\nthe calculation of the equivalent width, in the next Section). The\nFe line flux was calculated in three regions centered at 6.4 keV,\nwith half-widths of 0.1 keV, 0.2 keV, and 0.4 keV respectively.\nThe significances of the Fe line estimated in this way for the full\nsample and all subsamples are in Table 2.\nThe narrowest interval was chosen at the limit of the instrumental broadening, a significant excess found just in this range\nand not in the other two would in principle correspond to a detection of a narrow line. On the other hand, increasing the width includes more flux from a putative broad line, but it also increases\nthe noise, hence a broad component would be more difficult to\ndetect. We use the ±0.2 keV wide option (column S 2 in Table\n2) as our fiducial value, since it maximizes the signal-to-noise\nratio for unresolved and moderately broad lines. We can see that\nthe line is strongly significant (> 98 %) in the full sample and in\nalmost all the subsamples, with the exception of the high z-high\nL one. In general, the significance is higher for low z and low L.\nIn all cases, the significance stays about the same or decreases when ∆E increases. This is either an effect of the expected lower signal-to-noise ratio for wider intervals, or might\n\n\fS. Falocco et al.: Averaging the AGN X-ray spectra from deep Chandra fields\n\n0.2\n\nNormalized FE\n\n0.1\n\n0.2\n0.1\n\nNormalized FE\n\n0.5\n\nlog (NH cm−2 ) < 21.5\n\n0.5\n\nlog (NH cm−2 ) > 21.5\n\n2\n\n5\nEnergy (keV)\n\n10\n\n2\n\n5\nEnergy (keV)\n\n10\n\nFig. 11. Average observed spectra (data points) of the absorbed (left) and unabsorbed (right) subsample with their average simulated\ncontinua (continuous line) and the one sigma confidence limits (dashed lines).\nz < 1.005\n\n0.2\n\nNormalized FE\n\n0.1\n\n0.2\n0.1\n\nNormalized FE\n\n0.5\n\n0.5\n\nz > 1.005\n\n2\n\n5\nEnergy (keV)\n\n10\n\n2\n\n5\nEnergy (keV)\n\n10\n\nFig. 12. Average observed spectra (data points) of the high-z (left) and low-z (right) subsamples with their average simulated continua\n(continuous line) and the one sigma confidence limits (dashed lines).\nerg/s\n\nL > 8 10\n\nerg/s\n\n0.2\n\nNormalized FE\n\n0.1\n\n0.2\n0.1\n\nNormalized FE\n\n43\n\n0.5\n\n43\n\n0.5\n\nL < 8 10\n\n2\n\n5\nEnergy (keV)\n\n10\n\n2\n\n5\nEnergy (keV)\n\n10\n\nFig. 13. Average observed spectra (data points) of the high-L (right) and low-L (left) subsamples with their average simulated\ncontinua (continuous line) and the one sigma confidence limits (dashed lines).\nindicate the presence of a wider profile in the cases where the\nsignificance does not decrease noticeably.\n4.2. Spectral fits on the full sample and subsamples\n\nAfter having made the above mentioned calculation of the significance of the Fe line, we performed the spectral analysis. To\ndo this, we represented the continuum using the simulated con-\n\ntinuum as a table model in XSPEC. During the fits described\nbelow, we have aways left its normalization free to vary, and its\nvalue returned in XSPEC is always around one. We added to the\ntable model the required components when we found residuals.\nWe used the goodness of fit criterion and the confidence interval for a given parameter corresponding to a ∆χ2 = 2.71 (90 %\nprobability). The fit results are shown in Table 5.\n\n7\n\n\fS. Falocco et al.: Averaging the AGN X-ray spectra from deep Chandra fields\nz < 0.76\n0.5\n\nerg/s, z > 0.76\n\n0.1\n2\n\n5\nEnergy (keV)\n44\n\n10\n\n2\n\nerg/s, z < 0.76\n\nL < 1.43 10\n\n44\n\n5\nEnergy (keV)\n\n10\n\n5\nEnergy (keV)\n\n10\n\nerg/s, z > 0.76\n\n0.2\n0.1\n\n0.1\n\n0.2\n\nNormalized FE\n\nE\n\n0.5\n\n0.5\n\nL < 1.43 10\n\nNormalized F\n\n44\n\n0.2\n\nNormalized FE\n\n0.2\n0.1\n\nNormalized FE\n\n0.5\n\nL > 1.43 10\n\n2\n\n5\nEnergy (keV)\n\n10\n\n2\n\nFig. 14. Average observed spectra (data points) of the L − z subsamples with their average simulated continua (continuous line) and\nthe one sigma confidence limits (dashed lines). For comparison, in the bottom-left panel we represent with a dotted line the result\nof adding to the simulated continuum a Gaussian centered at 6.4 keV, with σ=120 eV, as obtained from the simulations of the Fe\nline (Sect. 3.3).\nTable 2. Significance of the Fe line estimated from the simulations for the full sample and the subsamples.\nSample\nTotal\nlog(NH ) > 21.5\nlog(NH ) < 21.5\nL43 < 8\nL43 > 8\nz < 1.005\nz > 1.005\nL43 < 14.3, z < 0.76\nz < 0.76\nL43 < 14.3, z > 0.76\nL43 > 14.3, z > 0.76\n\nS1\n(1)\n100\n99\n100\n100\n97\n100\n98\n100\n100\n99\n88\n\nS2\n(2)\n100\n99\n100\n100\n98\n100\n98\n100\n100\n98\n88\n\nS3\n(3)\n99\n98\n100\n100\n96\n100\n98\n100\n100\n91\n86\n\nNotes. L43 : luminosity in units of 1043 erg s−1 . S 1 , S 2 , S 3 : percentage\nof average simulated spectra (from the simulations of the continuum,\nsee Sect. 3.2) with the line flux lower than the observed spectrum in the\nintervals: 6.3-6.5 keV (1); 6.2-6.6 keV (2); 6.0-6.8 keV (3).\n\nsolved Fe K line (120 eV, see Sect. 3.3.). During the fits, we\nforced the width of the Gaussian line to satisfy the condition:\nσobs ≥ σ sim (where we used the average value of σ sim reported\nin Table 1, that is approximately 120 eV).\nWe made the fits in several steps:\n– Fixed σ=0 and fixed centroid energy at 6.4 keV: this allows\nus to estimate the significance of the narrow component of a\nneutral Fe K line (first line for each sample in Table 3)\n– Fixed centroid energy at 6.4 keV and free σ: studies the significance of a possible broad component and constrains its\nwidth (second line for each sample)\n– Free centroid energy and fixed σ=0: considers the presence\nof an ionized narrow Fe component and estimates its centroid\nenergy (third line for each sample)\n– Free centroid energy and free σ: leaves all options open\n(fourth line for each sample)\n\n(1)\n\nWe calculated the significance of the Gaussian with the ∆χ2\ncorresponding to the fits with and without the line component,\nand we checked the corresponding probability using the incomplete β function (according to Press et al. 2007). The result is in\nCol. 4 in Table 3. In the same way, we estimated the significance\nof allowing the width and/or the centroid energy to vary with\nrespect to the baseline narrow and neutral line.\nWe summarize here the results for our (sub)samples (see\nTable 5 and Figs. 15, 16, 17, 18, and 19) :\n\nwhere σobs is the total width returned by XSPEC and σ sim is the\ninstrumental width obtained from the simulations of an unre-\n\n– Full sample:\nThe spectrum of the full sample fitted with the table model\n\nThe σ we mention in the remainder of this work (including\nTable 5), refers to the intrinsic width of the line, taking into account the broadening introduced by our method\nσ2 = σ2obs − σ2sim\n\n8\n\n\fS. Falocco et al.: Averaging the AGN X-ray spectra from deep Chandra fields\n\n–\n\n–\n\n–\n\nAt high energies (∼ 10 keV), we observed in some spectra an\nexcess that can be interpreted as part of the Compton reflection.\nThe paucity of counts at these energies does not allow us to make\na more accurate assessment of this continuum component. An\nabsorption feature was also detected, to some extent, in some\nof our average spectra around 7-8 keV: this can be explained\nas the Fe edge commonly found along the Compton reflection\ncomponent.\n4.3. Dependence on redshift and luminosity\n\nAs our results seem to suggest a dependence of the Fe line EW\non redshift and on luminosity, for low z and low luminosity\nAGN, we checked this result in more detail to understand it better. The distribution of the line EW with the average z and the average luminosity of the subsamples are shown in Fig. 20. In those\nfigures, the same symbols refer to statistically independent subsamples. On the contrary, subsamples with different symbols are\nnot statistically independent and there will be significant over-\n\nTotal sample\n\nnormalized counts s−1 keV−1\n\n0.1\n\n0.05\n\n0.02\n\n0.01\n1.1\n1.05\nratio\n\n–\n\nand the Gaussian with free energy and free σ are shown in\nFig.15. We can see that the model fits the spectrum well in\nthe Fe line region. The detected line is narrow. We do not\nobserve any ionized Fe line component.\nAbsorbed and unabsorbed subsamples:\nThe spectra and fitted models are shown in Fig.16. The continuum of the unabsorbed sample shows Γ ∼ 1.8, a common\nvalue for the AGN (see Table 1), and is flatter in the absorbed\nsample, as expected. The line is characterized by having a\nnarrow profile for both subsamples. Only in the unabsorbed\nsample the centroid energy of the line might suggest a contribution from mildly ionized Fe. However, the centroid energy\nis consistent with 6.4 keV within the 90 % confidence level,\nand the significance of σ >0 from the ∆χ2 is < 90 %.\nHigh and low luminosity subsamples:\nThe spectra and fitted models are shown in Fig. 17. The results of the fits suggest a more intense Fe line in the low-L\nsubsample. We discuss the dependence of the EW on redshift and luminosity more in detail in the next Section. The\ndetected line is narrow, and there is no significant ionized Fe\ncontribution.\nHigh and low redshift subsamples:\nThe spectra and fitted models are shown in Fig. 18. The Fe\nline is more significant at low redshift than at high redshift\nand this can reflect the same trend just found with the luminosity, since sources with higher L are preferentially found\nat higher z. The line profile is narrow in both cases. The fits\nwith the centroid energy free shows the presence of a mildly\nionized Fe contribution in the low redshift sample, but 6.4\nkeV is within the 90 % confidence interval.\nL-z subsamples:\nThe strongest line significance is found at low z and low L,\nthen decreasing with both redshift and luminosity. The line\nprofile is broad only in one case, in the low redshift- low\nluminosity sample (>95.4 % probability). The line profile\nlooks symmetric (see Figs. 14 and 19, two left panels). This\nsuggests reflection from regions in newtonian movement in\nthe accretion disc, although we can not exclude the relativistic profile. Moreover, in the top-left panel there seems to be\nan excess in the narrow bin around 6.4 keV, which might\ncome from an additional narrow component. We discuss in\nmore detail the shape of this feature in Section 4.4. In the\nother two subsamples, the detected profile of the Fe line is\nnarrow. We did not find any ionized Fe component.\n\n1\n0.95\n0.9\n\n5\nEnergy (keV)\n\n10\n\nFig. 15. Fit of the average spectrum of the full sample using the\nsimulated continuum model + Gaussian (with free σ and free\ncentroid energy)\n\nlapping among the sources included in each subsample. We have\nused the fits corresponding to an unresolved line fixed at 6.4 keV\n(first line for each subsample in Table 3).\nAt first view the EW seems to decrease both with increasing\nz and X-ray luminosity. However, looking for example at the\nblue squares (corresponding to independent L − z subsamples),\nit is clear that a constant EW is consistent with the data points\nthe upper limits and, hence, the trend, albeit suggestive, is not\nstatistically significant.\n4.4. Analysis of broad lines\n\nWe detected with strong significance narrow Fe K lines in all\nsamples. Additionally, in the low L-low z subsample, the Fe line\nappears significanlty broadened with a significance above two\nsigma). We investigate here whether relativistic profiles are better fits than a simplistic broad Gaussian.\nWe added to the simulated continuum the diskline model\nin XSPEC which describes a relativistically broadened emission\nline for an accretion disc around a Shwartzschild Black Hole. We\nfixed Rout , the external radius of the accretion disc, to 1000 Rg.\nWe left Rin , the inner radius, free to vary, obtaining an upper\nlimit for it: < 142 Rg. As mentioned in Sect. 1, the inner radius of the accretion disc is expected to be lower (6 Rg for a\nnon-rotating black hole and 1.23 Rg for a maximally-rotating\none). The EW is consistent with the one obtained in the fit with\nthe Gaussian (see Table 3): EW=152+70\n−70 eV. The significance of\nadding an Fe line with diskline to the continuum is > 99.99%,\nagain consistent with the case of the Gaussian (Table 3). The fit\ngives χ2 /dof=20.53/29, to be compared with χ2 /dof=19.07/25\nfor the Gaussian: the fit is not better with more free parameters. Summarizing, the diskline fits the Fe K line as well as the\nGaussian: we do not significantly detect a definite relativistic\nprofile in the line, although it cannot be excluded.\nAlternatively, the profile of the line could be characterized as\nthe sum of both a broad and a narrow components since, in principle, we would expect a contribution from both a torus (narrow\ncomponent) and disk (broad component) reflections.\nWe have assessed the significance of this possibility by making a final test in the low L- low z sample: we added a broad\nGaussian to the narrow Gaussian (i.e. combining models in the\nfirst and second line of Table 3). We fixed the centroid energies\nof the two Gaussians at 6.4 keV and we fixed the σ to zero in the\n9\n\n\fS. Falocco et al.: Averaging the AGN X-ray spectra from deep Chandra fields\nlog (NH cm−2 ) > 21.5\n\nlog (NH cm−2 ) < 21.5\n\nnormalized counts s−1 keV−1\n\n0.05\n\n0.02\n\n0.1\n0.05\n\n0.02\n0.01\n\n0.01\n1.2\n\n1.2\n\n1.1\n\n1.1\nratio\n\nratio\n\nnormalized counts s−1 keV−1\n\n0.1\n\n1\n\n0.8\n\n1\n0.9\n\n0.9\n5\nEnergy (keV)\n\n0.8\n\n10\n\n5\nEnergy (keV)\n\n10\n\nFig. 16. Fit of the average spectrum of the absorbed (left) and unabsorbed (right) subsamples using the simulated continuum model\n+ Gaussian (with free σ and free centroid energy)\nL < 8 10\n\n43\n\nerg/s\n\nL > 8 10\n\nnormalized counts s−1 keV−1\n\n0.05\n\n0.02\n\n0.01\n\n0.05\n\n0.02\n\n0.01\n\n1.2\n\n1.2\n\n1.1\n\n1.1\nratio\n\nnormalized counts s−1 keV−1\nratio\n\nerg/s\n\n0.1\n\n0.1\n\n1\n0.9\n0.8\n\n43\n\n1\n0.9\n\n5\nEnergy (keV)\n\n0.8\n\n10\n\n5\nEnergy (keV)\n\n10\n\nFig. 17. Fit of the average spectrum of the low luminosity (left) and high luminosity (right) subsamples using the simulated continuum model + Gaussian (with free σ and free centroid energy)\nz < 1.005\n\nz > 1.005\n0.1\nnormalized counts s−1 keV−1\n\n0.05\n\n0.02\n\n0.01\n\n0.05\n\n0.02\n\n0.01\n\n1.2\n\n1.2\n\n1.1\n\n1.1\nratio\n\nratio\n\nnormalized counts s−1 keV−1\n\n0.1\n\n1\n0.9\n0.8\n\n1\n0.9\n\n5\nEnergy (keV)\n\n10\n\n0.8\n\n5\nEnergy (keV)\n\n10\n\nFig. 18. Fit of the average spectrum of the low redshift (left) and high redshift (right) subsamples using the simulated continuum\nmodel + Gaussian (with free σ and free centroid energy)\nnarrow Gaussian and to 240 eV (the value in the second line in\nTable 3) in the second broad Gaussian.\nWe calculated the EW of the narrow and broad components,\nobtaining < 84 eV and 158+78\n−78 eV, respectively. This fit gives\nχ2 /dof=19.15/26, to be compared with χ2 /dof=23.70/27 of the\nfit with only narrow Gaussian (in Table 3). Hence, the significance of adding the broad component (∆χ2 =4.55 and ∆ν=1) is\n> 95.4% but < 99%, calculated as mentioned in Sect. 4.2. We\n10\n\nconclude that a double Gaussian is a better fit, but only at the 2σ\nlevel.\n\n5. Conclusions\nWe have studied the average spectrum of a sample of 123\nAGN with more than 200 net counts selected from the Chandra\nAEGIS, CDF-N and CDF-S surveys, covering 0 < z < 3.5 and\ntotalling >70000 cts. Compared to similar XMM-Newton and\n\n\fS. Falocco et al.: Averaging the AGN X-ray spectra from deep Chandra fields\nz < 0.76\n\nL > 1.43 10\n\n0.05\n\n0.02\n\n0.05\n\n0.02\n\n0.01\n\n1.2\n\n1.2\n\n1.1\n\n1.1\nratio\n\nratio\n\n0.01\n\n1\n\n1\n\n0.9\n\n0.9\n\n0.8\n\n5\nEnergy (keV)\nL < 1.43 10\n\n44\n\n0.8\n\n10\n\nL < 1.43 10\n\n44\n\n10\n\nerg/s, z > 0.76\n\n0.1\nnormalized counts s−1 keV−1\n\nnormalized counts s−1 keV−1\n\n5\nEnergy (keV)\n\nerg/s, z < 0.76\n\n0.1\n\n0.05\n\n0.02\n\n0.01\n\n0.05\n\n0.02\n\n0.01\n\n1.2\n\n1.2\n\n1.1\n\n1.1\nratio\n\nratio\n\nerg/s, z > 0.76\n\n0.1\nnormalized counts s−1 keV−1\n\nnormalized counts s−1 keV−1\n\n0.1\n\n44\n\n1\n\n1\n\n0.9\n\n0.9\n\n0.8\n\n5\nEnergy (keV)\n\n0.8\n\n10\n\n5\nEnergy (keV)\n\n10\n\nFig. 19. Fit of the average spectrum of the L − z subsamples (low L-low z subsamples in the left panels, low L- high z subsamples in\nthe right bottom panel, high L-high z subsample in the right top panel) using the simulated continuum model + Gaussian (with free\nσ and free centroid energy)\nEW (L)\n\n100\n50\n\nEW (eV)\n\n100\n0\n\n0\n\n50\n\nEW (eV)\n\n150\n\n150\n\nEW (z)\n\n2\n\n5\nL (10\n\n43\n\n10\nerg/s)\n\n20\n\n0.6\n\n0.8\n\n1\n\n1.2\nredshift\n\n1.4\n\n1.6\n\n1.8\n\nFig. 20. Dependence of unresolved 6.4 keV Fe line equivalent width with the average luminosity (left) and the average redshift (right)\nof the subsamples (first row of Table 3). Squares: L − z subsamples; circles: redshift subsamples; triangles: luminosity subsamples.\nWe represent upper limits with a down-pointing arrow. Each set of points with the same symbol are statistically independent, but\nnot so across symbols.\nChandra studies of deep fields, we sample better the luminosityredshift plane at z ≤ 3 (including higher luminosities) and use\ndeeper CDF-S data. With respect to shallower wider surveys using XMM-Newton, we reach about an order of magnitude lower\nluminosities over the same redshift range.\nTo improve the signal-to-noise ratio and to study the average properties of the sample, we computed its average spectrum,\nadapting the method developed by Corral et al. (2008). We constructed the continuum model with simulations, in order to accurately analyze our resulting spectra. We also assessed the effect\n\nof our averaging method on unresolved features around 6.4 keV,\nto obtain the intrinsic widths of any putative lines.\nWe repeated the averaging procedure for the subsamples defined in two intervals of column density, 2-10 keV X-ray luminosity, redshift, and in three 2D intervals in the luminosityredshift (L − z) plane (see Table 1).\nWe have estimated the significance of the presence of narrow and broad features around 6.4 keV in a model-independent\nway (Table 2), finding that narrow features are significant at\n≥98%, except for the high-L, high-z subsamples, where it is\n11\n\n\fS. Falocco et al.: Averaging the AGN X-ray spectra from deep Chandra fields\n\nlower. Broad features would be harder to detect and are most\nsignificant at low L and low z.\nAnalyzing the spectra with XSPEC using the simulated continuum and modelling the Fe line as a Gaussian, we have found\nstrong evidence of a narrow Fe line at high significance in our\nfull sample and in most of our subsamples, in particular (Table\n5):\n– We detected a strong (at > 99.73 %) narrow Fe line with\nEW= 85 ± 35 eV and 73 ± 32 eV in the absorbed and unabsorbed subsamples, respectively (defined as having intrinsic\ncolumn density above and below 1021.5 cm−2 , respectively),\nwith a hint of higher central energy ∼6.5 keV in the unabsorbed case, but still compatible with 6.4 keV at 90%.\n– Segregating the sources purely on luminosity, we found that\nthe average spectrum in the low-L (L < 8 × 1043 erg s−1 )\nsubsample shows a significant and strong narrow Fe line\n(EW= 89±32 eV at >99.99%). The significance and strength\nof the high-L are clearly smaller: EW= 59 ± 38 eV at 95.4%.\n– Separating instead at z = 1.005, the narrow Fe line is\nagain stronger in the low-z subsample (EW= 80 ± 32 eV\nat >99.99%) than in the high-z subsample (EW= 71 ± 37 eV\nat >99.73%) but the difference is not significant\n– Defining distinct areas in the L − z plane (the division point\nwas L = 14.3 × 1043 erg s−1 ,z = 0.76), the most significant\nline is found in the low L-low z subsample (EW= 108±42 eV\nat > 99.99%), with a hint of a broad component (σ = 240 ±\n90 eV at > 2σ significance). The low L-high z subsample\nalso shows a somewhat weaker narrow line (EW= 75±40 eV\nat ∼ 99.7%). The Fe line detection is at < 90% significance\nin the high L-high z subsample (EW< 90 eV)\nWe studied the trend of the EW for the narrow Fe line with\nredshift and luminosity of our subsamples. We did not find a significant dependence: in Fig. 20 that trend is not statistically more\nsignificant than a constant. In order to disentangle the effects of\nthe two parameters on the line detection, surveys of AGN covering a wider area in the L − z plane are needed. Since the Fe line\nis detected more significantly at low-L and low-z, samples of the\nlocal Universe are particularly suited to this end.\nWe have also investigated whether more sophisticated models for the line profile would provide a better fit, concentrating\non the low L-low z subsample, since it is the only one where\na broad line may have been detected. A diskline relativistic\nprofile provides a worse fit than a broad Gaussian, with more\nparameters. Additionally, the inner radius of the disk would be\ntoo large to produce significant relativistic effects. Therefore, we\ndo not find evidence for a relativistic profile in any of our average\nspectra.\nHowever, as has been pointed out in Guainazzi et al. (2006),\nin the average spectra the broad component of the observed line\ncomes from a maximum ∼ 50% of the sample: the line in an\naverage spectrum cannot have a relativistic profile as definite\nas the one that can be in principle observed in a single, good\nquality spectrum. In particular, there can be a contribution from\npartially ionized Fe that produces narrow lines at energies > 6.4\nkeV, up to ∼7 keV if the Fe is completely ionized. Our observed\n∼symmetric Gaussian profile may hence be a combination of\nmany mildly ionized Fe lines with a red wing, perhaps from relativistic effects. As mentioned in Sect. 1, a similar result has\nbeen recently found in the stacking of the X-ray spectra of the\nCOSMOS sample (Iwasawa et al. 2011).\nAllowing for both a narrow (from neutral material far away\nfrom the central source, e.g. the putative torus) and a broad\n12\n\nGaussian (as just discussed) components provides a better fit\nthan a single narrow or broad Gaussian, but with a modest significance < 99%.\nFurther spectral averaging studies with higher statistics covering a wider range of source properties would allow a more\ndetailed characterization of the Fe feature in the X-ray spectra of AGN, and whether it depends on cosmic time, intrinsic\nbrightness, amount of surrounding material, black hole mass,\naccretion rate, and other physical parameters, helping to constrain the physical properties of AGN throughout the history of\nthe Universe.\n\n\fS. Falocco et al.: Averaging the AGN X-ray spectra from deep Chandra fields\nAcknowledgements. Financial support for this work was provided by the\nSpanish Ministry of Science and Innovation through the grants AYA2009-08059\nand AYA2010-21490-C02-01.\nThe authors acknowledge the computer resources, technical expertise and assistance provided by the Spanish Supercomputing Network (RES) node (Altamira)\nat Universidad de Cantabria in Santander; we thank especially Luis Cabellos for\nthe technical user support.\nWe thank prof. Andrea Comastri and prof. Giorgio Matt, for useful comments.\nThis research has made use of data obtained from the Chandra Data Archive\nand the Chandra Source Catalog, and software provided by the Chandra X-ray\nCenter (CXC) in the application of the package CIAO.\nThis study makes use of data from AEGIS, a multiwavelength sky survey\nconducted with the Chandra, GALEX, Hubble, Keck, CFHT, MMT, Subaru,\nPalomar, Spitzer, VLA, and other telescopes and supported in part by the NSF,\nNASA, and the STFC.\nThis research has made use of NASA's Astrophysics Data System.\n\nReferences\nAlexander D. M., Bauer F. E., Brandt W. N. et al., 2003, AJ, 126, 539(A03)\nAlexander D.M., Bauer F.E., Brandt W.N. et al., 2011, arXiv:1106.1443v1/\nArnaud K.A., 1996, Astronomical Data Analysis Software and System V, eds.\nJacoby G. and Barnes J., p17, ASP Conf. Series volume 101\nArnaud K.A., http://heasarc.gsfc.nasa.gov/docs/xanadu/xspec/wstat.ps\nBardeen J. M.; Press, W. H.; Teukolsky, S. A., 1972, ApJ, 178, 347-370\nBianchi S., Guainazzi M., Matt G. & Fonseca Bonilla N. , 2007, A&A, 467, L19\nBraito V., Reeves J. N., Dewangan G. C. et al., 2008, ApJ, 670, 978\nBroos P. S., Townsley L. K., Feigelson E. D. et al. , 2010, ApJ, 714, 1582\nBrusa M., Gilli R. & Comastri A., 2005, ApJ, 621, L5\nBrusa M., Civano F., Comastri A. & Gilli R., 2007, ASP Conference Series, 380,\n167\nChaudhary P., Brusa M., Hasinger G., Merloni A. & Comastri A., 2010, A&A,\n518, A58\nCorral A., Page M. J., Carrera F. J. et al., 2008, A&A, 492, 71\nCorral A., Della Ceca R., Caccianiga A., et al. 2011,A&A, 530, A42\nDigby-North J., 2011, Investigating the Relationship between Environment and\nActive Galactic Nuclei Activity at High Redshift, Thesis (PhD), Imperial\nCollege London\nFabian A. C., Iwasawa K., Reynolds C.S., Young A.J., 2000, PASP, Volume 112,\nIssue 775, pp. 1145-1161\nFabian A.C., Vaughan S., Nandra K. et al., 2002, PASP, 335, L1\nGeorge I.M., Fabian A. C., 1991, MNRAS, 249, March 15, 1991, 352\nGhisellini G., Haardt F. & Matt G. , 1994, MNRAS, 267, NO. 3/APR1, 743\nGilli R., Comastri A., Brunetti G. & Setti G. , 1999, astro-ph/9902256v1\nGuainazzi M., Bianchi S. & M. Dovciak M., 2006, Astron. Nachr., 327, 1032\nHaardt F. & Maraschi L., 1991, ApJ, 380, L51-L54\nHamann F., Warner C., Dietrich M. & Ferland G., 2007, Astronomical Society\nof the Pacific Conference Series, Vol 373, The Central Engine of the Active\nGalactic Nuclei, ed. L.C. Ho & J.-W. Wang, 653\nIwasawa K. & Taniguchi Y., 1993, ApJ, 413, L15\nIwasawa, K., Fabian, A. C., Reynolds, et al., 1996, MNRAS, 282, Issue 3, 1038\nIwasawa K., Mainieri V., Brusa M., et al., 2011, arXiv:1111.2447v1\nKomatsu E., Smith, K. M., Dunkley, J. et al., 2011, ApJS, 192, Issue 2, article\nid. 18\nLaird E. S., Nandra K., Georgakakis A. et al., 2009, ApJS, 180, 102\nLuo B., Bauer F.E., Brandt W. N., et al., 2008, ApJS, Vol. 179, p. 19\nMateos S., Barcons X., Carrera F.J. , et al., 2005, A&A, 433, 855\nMateos S., Carrera F.J., Page M.J., et al., 2010, A&A, 510, A35\nMatt G., Perola G. C., Piro L., 1991, Proceedings of a Workshop Held in\nVarenna, Como, Italy, 9-12 October 1990, edited by Aldo Treves, Giulio\nC. Perola, and Luigi Stella. Springer-Verlag Berlin Heidelberg New York,\n385, 201\nMatt G., Fabian A.C., Ross R.R., 1996, MNRAS, 278, Issue 4, 1111\nMatt G., Porquet D., Bianchi S., et al., 2005, A&A, 435, Issue 3, 857\nNandra K., O'Neill P. M., George I. M., Reeves J. N., & Turner T. J., 2006,\nAstron. Nachr., 327, 1039\nNandra K., George I. M., Mushotzky R. F., Turner T.J. & Yaqoob T., 1997, ApJ,\n488, L91\nPage K.L., O'Brien P.T., Reeves J.N. & Turner M.J.L., 2004, MNRAS, 347, 316\nPounds K.A. & Reeves J.N., 2001, arXiv:astro-ph/0201436\nPress W.H. ,Teukolsky S. A. , Vetterling V. T. & Flannery B.P., 2007, Numerical\nRecipes, Cambridge University Press\nShakura N. I. & Sunyaev R. A. , 1974, A&A, 24, 337\nStreblyanska A., Hasinger G., Barcons X., Mateos S. & Fabian A. C.,\n2005,A&A, 432, 395\nXue Y. Q., Luo B., Brandt W.N., et al., 2011, arXiv:1105.5643v1\nYaqoob T., 2006, IAUS, 230, 461\n\nYaqoob T., 2007, ASP Conference Series, Vol. 373, proceedings of the conference held 16-21 October, 2006 at Xi'an Jioatong University, Xi'an, China.\nEdited by Luis C. Ho and Jian-Min Wang, 109\n\nAppendix A: Results with different definitions of\nthe sample\nWe assessed the robustness of our results by changing the signalto-noise ratio that characterizes our sample. To do that, we repeated the analysis for all the sources with more than 50 and\n100 counts in 2 - 12 keV. We excluded from these samples the\nspectra with the lowest continuum flux between 2 - 5 keV (a bias\nduring the normalization process can be introduced, see Sect.3.1\nfor the details for method): CDFS− 227 (CDF-S source with RA:\n53.082, DEC: -27.690), CDFN− 405 (CDF-N source with RA:\n189.431, DEC: 62.177), EGS1− 003 (AEGIS source with RA:\n215.76, DEC: 53.45). After having defined the samples, we redefined the subsamples of intrinsic column density, luminosity\nand redshift, as described in Sect. 2.3. The results are in Table\nA.1 and A.2. We can see from the last column in the tables that\nthe Fe line significance grows with the signal-to-noise ratio of\nthe sample. After having applied the same analysis method used\nfor the default > 200 cts sample, we repeated the analysis in\nXSPEC for the > 50 cts and > 100 cts sample, finding consistent\nresults.\nWe have made the simulations of an unresolved 6.4 keV line\nfor the > 50 cts sample, obtaining results compatible with that\nof the default > 200 cts sample.\n\nAppendix B: Tests of the method: approximation\nmade in the correction of the spectra for\ndetector response\nWe checked whether the correction for the response matrices depends strongly on the model used to do it. To make this check,\nwe ran XSPEC simulations.\nWe start with an \"average\" but high signal-to-noise ratio\nsource modelled with an intrinsically absorbed powerlaw and\nan unresolved Gaussian line at 6.4 keV, with the average values of the full sample (see Table 1): z = 1.15, Γ = 1.24,\nNH = 1.75 × 1022 cm−2 , EW=100 eV. We compared the input\nmodel with the response-matrix-corrected spectra (\"unfolded\"\nspectra in XSPEC) assuming three different models:\n1. the input model without the Gaussian\n2. a powerlaw with Γ = 0\n3. a powerlaw with Γ = 2.\nWe can see the results in Figs. B.1 in the observed frame. The\nbest approximation is obtained using the input parameters, as expected. However, in a wide range around the line, the result does\nnot depend noticeably on the model used for the response matrix correction, even for models clearly different from the input\none. The significant discrepancies start only below about 2 keV\nrest-frame.\nWe ran another simulation for an absorbed source, using the\ncontinuum parameters of one source in the absorbed subsample,\n(z = 1.15, Γ = 1.64; NH = 43.22 × 1022 cm−2 , ) and a Gaussian\nat 6.4 keV with σ = 0, EW = 100 eV, again with high signalto-noise ratio. We show in Fig. B.2 the input model and the \"unfolded\" spectra using the three models above. In this case we\nalso see that there is no important difference in the continuum\nclose to the Fe line between the various models. The differences\n13\n\n\fFlux (keV cm−2 s−1 keV −1)\n\n0.2\n\n0.2\n\n0.1\n0.05\n\nFlux (keV cm−2 s−1 keV −1)\n\n0.5\n\n0.5\n\nS. Falocco et al.: Averaging the AGN X-ray spectra from deep Chandra fields\n\n0.5\n\n1\n\n2\nEnergy (keV)\n\n5\n\n0.1\n0.5\n\n1\n\n2\nEnergy (keV)\n\n5\n\nFig. B.2. Comparison, for a simulated absorbed source, between:\nunfolded spectrum with best fit (green circles), with gamma =2\n(red plus), with gamma =0 (continuous black line), with model\n(dashed blue line). The unfolded spectrum obtained with the best\nfit is along the model, with the exception of the Fe line region,\nwhere it deviates.\n\nbelow ∼3 keV rest-frame are much stronger in this case compared to the \"average\" source, but again the result of the input\nmodel follows very closely the input spectrum.\nTherefore, we chose to correct the spectra for the response\nmatrices using their own best-fit continuum models and we did\nnot simply divide the spectra for the effective area of the detector.\nThis simple method, actually assumes a flat continuum and does\nnot account for the limited spectral resolution of X-ray detectors.\nIt is important to notice that in any case there is an energy\nblending that widens the Fe line. We have quantified this effect\nusing simulations, as explained in Sect. 3.3.\nIn order to check the effect of the correction for detector response on the average spectrum, we corrected the spectra for\nthe detector responses using a powerlaw with Γ = 2. We then\nmade the average of the observed and simulated spectra, using\nthe same procedure explained in the Sect. 3. We can see in Fig.\nB.3 the results: the differences are again small and, in any case,\nwithin the mutual error bars. If anything, using the best-fit model\n14\n\n5\nEnergy (keV)\n\n10\n\nFig. B.3. Comparison between the average spectra after having\ncorrected for the detector response using: the best fit (average\nobserved spectrum represented by full circles, simulated spectrum by a dashed line) and with the powerlaw with Γ = 2 (average observed spectrum represented by stars, simulated spectrum\nby a contiuous line). Sample with the sources with more than\n200 net counts.\nfor the \"unfolding\" appears to produce a more conservative estimate of the Fe line flux.\n\n0.01\n10−3\n\nFlux (keV cm−2 s−1 keV −1)\n\nFig. B.1. Comparison, for a simulated \"average\" source, between unfolded spectrum with best fit (green circles), with\ngamma =2 (red plus), with gamma =0 (continuous black line),\nwith model (dashed blue line).\n\n2\n\n\fS. Falocco et al.: Averaging the AGN X-ray spectra from deep Chandra fields\n\nTable 1. Properties of the full sample and the subsamples (see text).\nSample\n\nN\n\nN2−12\n\nN5−8\n\nhzi\n\nhL43 i\n10 erg s−1\n(6)\n5.20\n8.00\n20.31\n13.82\n14.11\n13.55\n2.89\n30.20\n5.43\n22.50\n3.23\n2.00\n5.58\n37.05\n43\n\n(1)\nCDF-S\nCDF-N\nAEGIS\nTotal\nlog(NH ) > 21.5\nlog(NH ) < 21.5\nL43 < 8\nL43 > 8\nz < 1.005\nz > 1.005\nz < 0.76\nL43 < 14.3, z < 0.76\nL43 < 14.3, z > 0.76\nL43 > 14.3, z > 0.76\n\n(2)\n33\n25\n65\n123\n54\n69\n74\n49\n63\n60\n39\n36\n49\n35\n\n(3)\n21561\n16134\n32971\n70667\n27888\n42778\n34620\n36047\n34843\n35824\n23713\n19007\n24286\n22669\n\n(4)\n5223\n3429\n6873\n15526\n7304\n8222\n7630\n7896\n7507\n8019\n5285\n4446\n4902\n5339\n\n(5)\n1.26\n1.11\n1.11\n1.15\n1.15\n1.14\n0.85\n1.60\n0.70\n1.62\n0.57\n0.57\n1.14\n1.80\n\nhNh,22 i\n10 cm−2\n(7)\n3.80\n0.88\n1.04\n1.75\n3.93\n0.05\n1.64\n1.91\n1.28\n2.24\n1.17\n1.25\n1.90\n2.19\n\nΓ\n\nχ2 /dof\n\nΓ sim\n\n(8)\n1.24 ± 0.05\n0.48 ± 0.07\n1.78 ± 0.06\n1.21 ± 0.06\n1.31 ± 0.07\n1.23 ± 0.06\n1.24 ± 0.07\n1.31 ± 0.07\n1.29 ± 0.08\n1.11 ± 0.08\n1.34 ± 0.09\n\n(9)\n9.77/13\n8.94/13\n14.96/13\n10.42/13\n14.70/13\n10.57/13\n5.66/13\n11.68/13\n10.99/13\n7.27/13\n11.76/13\n\n(10)\n1.897 ± 0.001\n1.898 ± 0.001\n1.896 ± 0.001\n1.893 ± 0.001\n1.878 ± 0.001\n1.896 ± 0.001\n1.886 ± 0.001\n-\n\n22\n\nσ sim\neV\n(11)\n117 ± 1\n129 ± 1\n116 ± 1\n111 ± 1\n128 ± 1\n105 ± 1\n138 ± 1\n-\n\nEW sim\neV\n(12)\n182\n190\n181\n183\n174\n186\n180\n-\n\nNotes. Columns: (1): (Sub)Sample; (2): Number of sources; (3): number of net counts in 2-12 keV rest-frame; (4): number of net counts in 5-8\nkeV rest frame; (5): average redshift; (6): average rest-frame 2-10 keV luminosity in units of 1043 erg s−1 , corrected for Galactic and intrinsic\nabsorption∗ ; (7): average intrinsic column density in 1022 cm−2 ∗ ; (8): gamma from the fit of the average observed spectrum with a powerlaw\nbetween 2 and 5 keV (rest-frame); (9): χ2 /dof of the fit of the average observed spectrum with a powerlaw between 2 and 5 keV (rest-frame); (10):\nslope of the powerlaw ∗∗ of the average spectrum obtained with the simulations of the Fe line (see text); (11): width obtained in those simulations;\n(12): EW of the line obtained from those simulations. ∗ Obtained averaging the values obtained from the fit to the individual spectra (see text); ∗∗\nobtained fitting it with a powerlaw plus a Gaussian Fe line\n\n15\n\n\fS. Falocco et al.: Averaging the AGN X-ray spectra from deep Chandra fields\n\nTable 3. Results of fits of the average spectrum of the full sample and its subsamples.\nSample\n\nχ2 /dof(s)\n\nχ2 /dof(g)\n\n(1)\nTotal\n\n(2)\n47.50/28\n\n(3)\n23.74/27\n21.98/26\n23.74/26\n21.98/25\n21.66/27\n21.15/26\n21.42/26\n21.22/25\n39.38/27\n38.18/26\n37.41/26\n37.15/25\n23.96/27\n23.70/26\n23.96/26\n23.56/25\n36.42/27\n36.41/26\n36.42/26\n34.86/25\n35.26/27\n34.21/26\n33.69/26\n33.28/25\n19.77/27\n19.45/26\n19.77/26\n18.66/25\n23.70/27\n19.23/26\n23.70/26\n19.07/25\n23.04/27\n19.04/26\n23.04/26\n18.72/25\n16.99/27\n16.99/26\n16.99/26\n16.83/25\n29.56/27\n29.56/26\n29.09/26\n26.72/25\n\nlog(NH ) > 21.5\n\nlog(NH ) < 21.5\n\nL43 < 8\n\nL43 > 8\n\nz < 1.005\n\nz > 1.005\n\nL43 < 14.3, z < 0.76\n\nz < 0.76\n\nL43 < 14.3, z > 0.76\n\nL43 > 14.3, z > 0.76\n\n35.61/28\n\n53.03/28\n\n44.26/28\n\n42.59/28\n\n52.34/28\n\n29.56/28\n\n42.01/28\n\n43.28/28\n\n25.97/28\n\n31.85/28\n\nP1\n%\n(4)\n> 99.99\n> 99.99\n> 99.99\n> 99.99\n> 99.73\n> 99.73\n> 99.73\n> 99.73\n> 99.73\n> 99.73\n> 99.73\n> 99.73\n> 99.99\n> 99.99\n> 99.99\n> 99.73\n> 95.4\n∼ 95.4\n> 90.0\n> 90.0\n> 99.99\n> 99.73\n> 99.99\n> 99.73\n> 99.73\n> 99.73\n> 99.73\n> 99.73\n> 99.99\n> 99.99\n> 99.73\n> 99.99\n> 99.99\n> 99.99\n> 99.99\n> 99.99\n∼ 99.7\n> 95.4\n> 95.4\n> 95.4\n< 90.0\n< 90.0\n< 90.0\n< 90.0\n\nP2\n%\n(5)\n< 90\n< 90\n< 90\n< 90\n< 90\n< 90\n< 90\n< 90\n< 90\n< 90\n< 90\n< 90\n< 90\n< 90\n< 90\n< 90\n< 90\n< 90\n< 90\n< 90\n< 90\n> 95.4\n< 90\n> 90\n∼ 95.4\n< 90\n< 90\n< 90\n< 90\n< 90\n< 90\n< 90\n< 90\n\nE\nkeV\n(6)\n6.4\n6.4\n6.40 ± 0.10\n6.40 ± 0.10\n6.4\n6.4\n6.28 ± 0.02\n6.40 ± 0.30\n6.4\n6.4\n6.50 ± 0.10\n6.50 ± 0.10\n6.4\n6.4\n6.4 ± 0.1\n6.4 ± 0.9\n6.4\n6.4\n6.4 ± 0.2\n6.30 ± 0.20\n6.4\n6.4\n6.50 ± 0.10\n6.45 ± 0.10\n6.4\n6.4\n6.40 ± 0.15\n6.30 ± 0.10\n6.4\n6.4\n6.40 ± 0.15\n6.42 ± 0.12\n6.4\n6.4\n6.40 ± 0.15\n6.43 ± 0.11\n6.4\n6.4\n6.40 ± 0.10\n6.43 ± 0.10\n6.4\n6.4\n+0.60\n6.05−0.05\n6.22 ± 0.15\n\nσ\neV\n(7)\n0\n< 138\n0\n< 123\n0\n< 123\n0\n< 151\n0\n< 189\n0\n< 59.6\n0\n< 72\n0\n< 68\n0\n<7\n0\n<7\n0\n< 100\n0\n< 101\n0\n< 120\n0\n< 76\n0\n240 ± 90\n0\n216 ± 50\n0\n157 ± 30\n0\n215 ± 50\n0\n<4\n0\n<5\n0\n<5\n0\n<5\n\nEW\neV\n(8)\n74 ± 24\n94 ± 30\n73 ± 25\n92 ± 28\n85 ± 35\n100 ± 45\n92 ± 41\n91 ± 39\n73 ± 32\n100 ± 43\n85 ± 36\n87 ± 36\n89 ± 32\n97 ± 35\n89 ± 32\n97 ± 34\n59 ± 38\n58 ± 39\n58 ± 39\n75 ± 45\n80 ± 32\n94 ± 37\n92 ± 35\n99 ± 37\n71 ± 37\n86 ± 44\n71 ± 37\n85 ± 43\n108 ± 42\n178 ± 63\n108 ± 42\n172 ± 60\n108 ± 40\n154 ± 50\n109 ± 39\n170 ± 56\n75 ± 40\n75 ± 40\n75 ± 40\n76 ± 42\n< 90\n< 91\n50 ± 47\n73 ± 53\n\n(9)\n1.15\n\nhL43 i\n1043 erg s−1\n(10)\n13.80\n\nNh,22\n1022 cm−2\n(11)\n1.75\n\n1.15\n\n14.11\n\n3.93\n\n1.14\n\n13.55\n\n0.045\n\n0.85\n\n2.89\n\n1.64\n\n1.597\n\n30.20\n\n1.91\n\n0.704\n\n5.43\n\n1.28\n\n1.617\n\n22.5\n\n2.24\n\n0.566\n\n2.\n\n1.254\n\n0.573\n\n3.23\n\n1.173\n\n1.141\n\n5.58\n\n1.900\n\n1.803\n\n37.05\n\n2.187\n\nhzi\n\nNotes. L43 : luminosity in units of 1043 erg s−1 . Columns: (1): sample; (2): χ2 /dof of the fit with simulated continuum model; (3): χ2 /dof of the\nfit with the same continuum and the Gaussian; (4): probability P(∆χ2 , ∆ν)s, g (of adding the Gaussian to the model, see text); (5): probability\nP(∆χ2 , ∆ν)g, g0 (of leaving the parameter of the Gaussian free, see text); (6): central energy of the Gaussian; (7): σ after subtracting the intrinsic\nsigma obtained in the simulations of the Fe line; (8): EW of the Gaussian; (9): average redshift of the sample; (10): average luminosity of the\nsample in (1043 ) erg s−1 ; (11): average column density of the sample in 1022 cm−2 .\n\n16\n\n\fS. Falocco et al.: Averaging the AGN X-ray spectra from deep Chandra fields\n\nTable A.1. Properties of the sample composed by all the sources with more than 50 counts.\nSample\n(1)\nFull\nlog(NH ) > 21.5\nlog(NH ) < 21.5\nL43 < 6\nL43 > 6\nz<1\nz>1\nz < 0.76\nL43 < 8.4, z < 0.76\nL43 < 8.4, z > 0.76\nL43 > 8.4, z > 0.76\n\nN\n\nN2−12\n\nN5−8\n\nhzi\n\n(2)\n347\n177\n170\n234\n113\n184\n163\n120\n116\n157\n70\n\n(3)\n93385\n40174\n53211\n46546\n46840\n46672\n46713\n31537\n26743\n31862\n29985\n\n(4)\n21730\n10944\n10786\n11021\n10709\n10530\n11199\n7511\n6614\n6866\n7353\n\n(5)\n1.20\n1.14\n1.28\n0.90\n1.80\n0.65\n1.83\n0.53\n0.52\n1.34\n2.08\n\nhL43 i\n1043 erg s−1\n(6)\n8.60\n8.00\n9.50\n1.60\n23.40\n2.60\n15.60\n1.80\n1.20\n1.70\n32.10\n\nhNh,22 i\n1022 × cm−2\n(7)\n3.08\n6.04\n0.04\n3.09\n3.07\n3.08\n3.08\n3.75\n3.35\n2.47\n3.32\n\nSignificance\n(8)\n85\n85\n72\n89\n74\n83\n85\n81\n82\n94\n77\n\nNotes. L43 : luminosity in units of 1043 erg s−1 . Columns: (1): (Sub)Sample; (2): Number of sources; (3): Number of counts in 2 -12 keV; (4):\nNumber of counts in 5-8 keV; (5): average redshift; (6): average luminosity in 1043 erg s−1 ; (7): average column density of the local absorber in\n1022 * cm−2 ; (8): significance of the Fe line calculated as the number of average simulated spectra with a lower flux than the flux of the average\nobserved spectrum (calculation made between between 6.2 and 6.6 keV).\n\nTable A.2. Properties of the sample composed by all the sources with more than 100 counts.\nSample\n(1)\nFull\nlog(NH ) > 21.5\nlog(NH ) < 21.5\nL43 < 6.65\nL43 > 6.65\nz < 1.01\nz > 1.01\nL43 < 21.0, z < 0.78\nL43 < 21.0, z > 0.78\nL43 > 21.0, z > 0.78\n\nN\n\nN2−12\n\nN5−8\n\nhzi\n\n(2)\n219\n104\n115\n134\n85\n109\n110\n71\n93\n55\n\n(3)\n84275\n34893\n49382\n42061\n42214\n41477\n42798\n28349\n29478\n26448\n\n(4)\n19312\n9422\n9890\n9718\n9594\n9216\n10096\n6587\n6273\n6452\n\n(5)\n1.24\n1.15\n1.32\n0.91\n1.76\n0.68\n1.80\n0.55\n1.30\n2.02\n\nhL43 i\n1043 erg s−1\n(6)\n11.83\n10.80\n12.69\n2.25\n26.82\n3.80\n19.71\n2.40\n4.80\n35.80\n\nhNh,22 i\n1022 cm−2\n(7)\n2.63\n5.50\n0.04\n3.03\n1.99\n2.74\n2.52\n3.58\n2.16\n2.20\n\nSignificance\n(8)\n92\n91\n100\n91\n94\n90\n99\n90\n100\n90\n\nNotes. L43 : luminosity in units of 1043 erg s−1 . Columns: (1): (Sub)Sample; (2): Number of sources; (3): Number of counts in 2 -12 keV; (4):\nNumber of counts in 5-8 keV; (5): average redshift; (6): average luminosity in 1043 erg s−1 ; (7): average column density of the local absorber in\n1022 * cm−2 ; (8): significance of the Fe line calculated as the number of average simulated spectra with a lower flux than the flux of the average\nobserved spectrum (calculation made between between 6.2 and 6.6 keV).\n\n17\n\n\f"}