{"id": "http://arxiv.org/abs/0904.2003v1", "guidislink": true, "updated": "2009-04-13T18:59:07Z", "updated_parsed": [2009, 4, 13, 18, 59, 7, 0, 103, 0], "published": "2009-04-13T18:59:07Z", "published_parsed": [2009, 4, 13, 18, 59, 7, 0, 103, 0], "title": "From Protostars to Planetary Systems : FUV Spectroscopy of YSOs,\n  Protoplanetary Disks, and Extrasolar Giant Planets", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0904.1078%2C0904.0005%2C0904.2642%2C0904.4227%2C0904.4537%2C0904.1307%2C0904.4177%2C0904.3543%2C0904.3076%2C0904.3542%2C0904.2670%2C0904.2588%2C0904.2958%2C0904.4918%2C0904.2966%2C0904.1468%2C0904.3963%2C0904.2260%2C0904.1715%2C0904.1945%2C0904.2777%2C0904.4282%2C0904.1651%2C0904.1869%2C0904.4128%2C0904.2246%2C0904.2880%2C0904.3940%2C0904.4898%2C0904.1967%2C0904.2875%2C0904.1310%2C0904.0937%2C0904.4925%2C0904.4008%2C0904.3205%2C0904.4829%2C0904.3999%2C0904.4376%2C0904.4726%2C0904.1275%2C0904.2879%2C0904.2180%2C0904.1364%2C0904.4590%2C0904.1146%2C0904.1940%2C0904.3532%2C0904.1280%2C0904.1284%2C0904.0396%2C0904.3106%2C0904.3525%2C0904.1100%2C0904.0183%2C0904.2824%2C0904.3679%2C0904.1820%2C0904.0809%2C0904.3884%2C0904.1862%2C0904.0914%2C0904.4097%2C0904.3142%2C0904.1313%2C0904.3728%2C0904.2003%2C0904.4146%2C0904.0794%2C0904.1000%2C0904.1720%2C0904.3686%2C0904.4452%2C0904.4099%2C0904.1209%2C0904.2328%2C0904.4451%2C0904.2521%2C0904.4644%2C0904.2200%2C0904.0797%2C0904.3235%2C0904.0521%2C0904.0212%2C0904.3628%2C0904.0412%2C0904.3445%2C0904.1943%2C0904.4762%2C0904.3931%2C0904.0928%2C0904.3367%2C0904.0298%2C0904.0920%2C0904.1860%2C0904.0216%2C0904.2947%2C0904.2917%2C0904.4632%2C0904.3510%2C0904.0277&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "From Protostars to Planetary Systems : FUV Spectroscopy of YSOs,\n  Protoplanetary Disks, and Extrasolar Giant Planets"}, "summary": "The last two decades have seen remarkable progress in our long-standing goal\nof determining the abundance and diversity of worlds in the Galaxy.\nUnderstanding of this subject involves tracing the path of interstellar\nmaterial from dense cloud cores, to young stellar objects, protoplanetary\ndisks, and finally extrasolar planets. Here we discuss the critical information\nprovided on these objects by point-source far-ultraviolet spectroscopy with a\nlarge aperture, high resolution spectrograph of a large sample of unique\nprotostellar and protoplanetary objects that will leverage our existing\nknowledge to lay out a path to new and powerful insight into the formation\nprocess. We lay out a systematic case of coordinated observations that will\nyield new knowledge about the process of assembly for both protostellar and\nprotoplanetary systems - that addresses specific uncertainties in our current\nknowledge and takes advantage of potential new technologies to acquire the data\nneeded.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0904.1078%2C0904.0005%2C0904.2642%2C0904.4227%2C0904.4537%2C0904.1307%2C0904.4177%2C0904.3543%2C0904.3076%2C0904.3542%2C0904.2670%2C0904.2588%2C0904.2958%2C0904.4918%2C0904.2966%2C0904.1468%2C0904.3963%2C0904.2260%2C0904.1715%2C0904.1945%2C0904.2777%2C0904.4282%2C0904.1651%2C0904.1869%2C0904.4128%2C0904.2246%2C0904.2880%2C0904.3940%2C0904.4898%2C0904.1967%2C0904.2875%2C0904.1310%2C0904.0937%2C0904.4925%2C0904.4008%2C0904.3205%2C0904.4829%2C0904.3999%2C0904.4376%2C0904.4726%2C0904.1275%2C0904.2879%2C0904.2180%2C0904.1364%2C0904.4590%2C0904.1146%2C0904.1940%2C0904.3532%2C0904.1280%2C0904.1284%2C0904.0396%2C0904.3106%2C0904.3525%2C0904.1100%2C0904.0183%2C0904.2824%2C0904.3679%2C0904.1820%2C0904.0809%2C0904.3884%2C0904.1862%2C0904.0914%2C0904.4097%2C0904.3142%2C0904.1313%2C0904.3728%2C0904.2003%2C0904.4146%2C0904.0794%2C0904.1000%2C0904.1720%2C0904.3686%2C0904.4452%2C0904.4099%2C0904.1209%2C0904.2328%2C0904.4451%2C0904.2521%2C0904.4644%2C0904.2200%2C0904.0797%2C0904.3235%2C0904.0521%2C0904.0212%2C0904.3628%2C0904.0412%2C0904.3445%2C0904.1943%2C0904.4762%2C0904.3931%2C0904.0928%2C0904.3367%2C0904.0298%2C0904.0920%2C0904.1860%2C0904.0216%2C0904.2947%2C0904.2917%2C0904.4632%2C0904.3510%2C0904.0277&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "The last two decades have seen remarkable progress in our long-standing goal\nof determining the abundance and diversity of worlds in the Galaxy.\nUnderstanding of this subject involves tracing the path of interstellar\nmaterial from dense cloud cores, to young stellar objects, protoplanetary\ndisks, and finally extrasolar planets. Here we discuss the critical information\nprovided on these objects by point-source far-ultraviolet spectroscopy with a\nlarge aperture, high resolution spectrograph of a large sample of unique\nprotostellar and protoplanetary objects that will leverage our existing\nknowledge to lay out a path to new and powerful insight into the formation\nprocess. We lay out a systematic case of coordinated observations that will\nyield new knowledge about the process of assembly for both protostellar and\nprotoplanetary systems - that addresses specific uncertainties in our current\nknowledge and takes advantage of potential new technologies to acquire the data\nneeded."}, "authors": ["Paul A. Scowen", "Rolf Jansen", "Matthew Beasley", "Steve Desch", "Alex Fullerton", "Mark McCaughrean", "Sally Oey", "Debbie Padgett", "Aki Roberge", "Nathan Smith"], "author_detail": {"name": "Nathan Smith"}, "author": "Nathan Smith", "arxiv_comment": "8 pages - Science White Paper for the Astro2010 Decadal Survey\n  Panel(s): Planetary Systems and Star Formation", "links": [{"href": "http://arxiv.org/abs/0904.2003v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0904.2003v1", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "astro-ph.GA", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "astro-ph.GA", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0904.2003v1", "affiliation": "University of California - Berkeley", "arxiv_url": "http://arxiv.org/abs/0904.2003v1", "journal_reference": null, "doi": null, "fulltext": "Protostars to Planets\n\nFrom Protostars to Planetary Systems :\nFUV Spectroscopy of YSOs, Protoplanetary Disks,\nand Extrasolar Giant Planets\nPaul Scowen\nSchool of Earth & Space Exploration\nArizona State University\nPO Box 871404, Tempe, AZ 85287-1404\n(480) 965-0938\npaul.scowen@asu.edu\n\nRolf Jansen (Arizona State University)\nMatthew Beasley (University of Colorado – Boulder)\nSteve Desch (Arizona State University)\nAlex Fullerton (STScI)\nMark McCaughrean (University of Exeter)\nSally Oey (University of Michigan)\nDebbie Padgett (IPAC / Caltech)\nAki Roberge (NASA – GSFC)\nNathan Smith (University of California – Berkeley)\n\nScience White Paper for the Astro2010 Decadal Survey\nPanel(s): Planetary Systems and Star Formation\n\nScowen et al.\n\n0\n\n\fProtostars to Planets\nAbstract\nThe last two decades have seen remarkable progress in our long-standing goal of\ndetermining the abundance and diversity of worlds in the Galaxy. Understanding of this\nsubject involves tracing the path of interstellar material from dense cloud cores, to young\nstellar objects, protoplanetary disks, and finally extrasolar planets. Here we discuss the\ncritical information provided on these objects by point-source far-ultraviolet spectroscopy\nwith a large aperture, high resolution spectrograph of a large sample of unique\nprotostellar and protoplanetary objects that will leverage our existing knowledge to lay\nout a path to new and powerful insight into the formation process. We lay out a\nsystematic case of coordinated observations that will yield new knowledge about the\nprocess of assembly for both protostellar and protoplanetary systems – that addresses\nspecific uncertainties in our current knowledge and takes advantage of potential new\ntechnologies to acquire the data needed.\nIntroduction & Scientific Context\nThe collapse of an interstellar (IS) molecular cloud core naturally leads to the formation\nof a disk of gas and dust around the growing protostar. Further growth of the protostar\noccurs by accretion of material through the disk. Planets eventually form in this disk,\nalthough it was generally thought that this did not occur until accretion onto the star had\nlargely ceased and the disk was \"passive\". However, it is becoming clear that the late\nstages of star formation and the early stages of planet formation can occur\nsimultaneously, and we need to know more details about the former process to\nunderstand how it may affect the latter. The addition of NUV and FUV spectroscopic\ndata to this problem allows the use of line flux measurements to study material accreting\nonto young stars from their accretion disks, as it shocks and is heated to about 106 K\nbefore being radiatively cooled. Such infall is not sufficient to produce X-rays, but the\nfirst observable emission from such shocks is from gas at nearly 105 K using lines such as\nC IV, Si IV, etc. This emission represents the least processed radiation produced by\naccretion processes and provides direct access to accurate estimates of accretion rates,\nfilling factors, etc. In addition to hot emission lines, the FUV can be used to probe\nmolecular hydrogen in disks and the near circumstellar environment around T-Tauri stars\n(TTS). Current estimates of the assembly time for Jupiter mass planets does not match\nthe measured lifetimes of accretion disks from thermal dust emission, so it is expected\nthat gas survival rates are longer. H2 is widely expected to be the primary gas constituent\nof circumstellar disks, so direct measurements of molecular hydrogen will solve the\ndisagreement. Re-analysis of the low resolution IUE final archive spectra has revealed\nFUV fluorescent H2 emission from a dozen classical TTS. In similar fashion, a large\naperture telescope combined with a next generation high throughput, high resolution\nFUV spectrograph would be uniquely suited to this task, while affording a considerable\nincrease in collecting area, throughput and DQE.\nCompelling Science Themes Based on Recent Advances\nFUV Emission Lines as Probes of Mass Accretion in Young Stars\nA variety of observations of young stars, including emission line profiles, spectral energy\ndistributions, and variability, indicate that stellar magnetic fields channel material from\nScowen et al.\n\n1\n\n\fProtostars to Planets\ncircumstellar (CS) accretion disks onto their stars. The CS disk is truncated close to the\nstar by the stellar magnetic field, and disk material captured by this field produces a\nstrong shock as it slides down the gravitational potential of the star and strikes the\nphotosphere. The accretion process also creates highly supersonic bipolar outflows that\nlie perpendicular to the disk planes, and shock waves in these flows generate chains of\nemission line knots known as Herbig-Haro objects.\nThe far-ultraviolet (FUV) region of the spectrum is particularly important for testing\nmodels of accretion in young stars because it allows observation of the 105 – 106 K gas\nproduced immediately behind the accretion shocks. As the shocked gas cools, it emits\nstrongly in FUV lines, which are optically thin. Young low mass stars are also\nmagnetically active, so there is typically a contribution to the FUV lines from the\ntransition regions and chromospheres. Indeed, for X-ray emission, magnetic coronal\nemission in these stars dominates over the emission produced in the accretion shocks.\nHowever, in classical (i.e. accreting) T-Tauri stars (CTTS), the accretion shock produces\nthe bulk of the FUV line emission, since it is enhanced by at least an order of magnitude\nover the level expected from magnetic activity and the FUV line luminosity correlates\nstrongly with the mass accretion rate. The observed FUV line luminosities are also\nconsistent with the predictions of shock models with accretion rates typical of CTTS.\nBecause the FUV lines of CTTS form primarily in the accretion shocks, they open up\nnew ways to study the physics of magnetospheric accretion. Understanding this process\nis essential if we are to develop an accurate picture of how planetary systems form.\nAccretion and outflow are the means by which young stars and their disks redistribute\nmass and angular momentum, and these processes also control heating in the disk. The\nnext two sections outline several ways in which the unique new FUV spectroscopic\ncapability we have described will address fundamental unsolved questions concerning\nmagnetospheric accretion onto young stars.\nAccretion Rates in Herbig Ae/Be Stars\nWhile the existence of magnetospheric accretion in CTTS has much observational\nsupport, the situation for the Herbig Ae/Be stars, which are higher mass analogs of TTauri stars, is much less clear. Our understanding of the close CS environment in these\nhigher mass stars is very incomplete, and the role that accretion plays in the observed\nphenomena is largely unknown. CS disks have been imaged around a few Herbig Ae/Be\nstars; however, their frequency has not been determined.\nAccretion onto low mass young stellar objects (YSOs) produces hot photospheric\nmaterial as a result of reprocessing the radiation from the accretion shock. The heated\nphotosphere gives rise to both optical and UV excess continuum emission which appears\nto fill in or \"veil\" the stellar photospheric absorption lines. This is relatively easy to see\nin CTTS spectra, since the material producing the veiling is much hotter than the stellar\nphotosphere. However, for Herbig Ae/Be stars, it is difficult to distinguish the excess\ncontinuum emission from the photospheric continuum, since the temperatures of the hot\nspots and the stellar photospheres are comparable (T ~ 104 K). In addition, Herbig Ae/Be\nstars usually display evidence for strong winds in high resolution optical line profiles and\nin the profiles of near-UV Mg II lines. As a result, it is extremely difficult to use optical\nor near-UV lines as accurate tracers of disk accretion for these objects.\nScowen et al.\n\n2\n\n\fProtostars to Planets\nFortunately, the hotter FUV emission lines formed in the accretion shock provide\nexcellent probes of mass accretion in Herbig Ae/Be stars, and in fact will be the only way\nto accurately measure accretion rates in many cases. An atlas of Herbig Ae/Be stars\nobserved with IUE shows that many of them do show FUV emission lines such as C IV\nat 1550Å. It has been shown that for a sample of stars with masses intermediate between\ntypical CTTS and Herbig Ae/Be stars, the FUV line strengths correlate well with the\nmass accretion rates, lending further support to their use as rate tracers in Herbig Ae/Be\nstars.\nOur survey will be ideally suited to study accretion tracer lines such as O VI and C III in\na large sample of Herbig Ae/Be stars, and will allow us to explore how much accretion\naffects these higher mass pre-main sequence stars. Our study will address several key\nquestions: Are the accretion rates for Herbig Ae/Be stars larger on average than for\nCTTS? Current studies of intermediate mass YSOs find a correlation between stellar\nmass and accretion rate, so we might expect the Herbig Ae/Be stars to show large mass\naccretion rates as a whole. But only a large sample of such objects observed at various\nages can establish how these systems form. Is the accretion on Herbig Ae/Be stars\ncontrolled by stellar magnetic fields? Conventional wisdom assumes the picture we have\nfor CTTS applies to the higher mass stars as well, but the origin of magnetic fields in\nthese fully radiative stars is not understood. If stellar magnetic fields do play a role, we\nexpect rotational modulation the FUV line profiles, as described in the next subsection.\nIs the typical disk accretion timescale in Herbig Ae/Be stars equal to or shorter than that\nof CTTS? If they really do have large accretion rates as a whole, the disk lifetimes may\nbe shorter in these stars, which would have broad implications for planet formation in\ngeneral around higher mass stars, and gas giant formation in particular.\nMapping the Shock Waves and Accretion Columns in CTTS\nThe FUV emission lines accessible in our survey provide a unique means to study both\nthe physics of the accretion shock and the basic geometry of magnetospheric accretion in\nyoung stars. Current models assume the magnetic field serves only to direct the accretion\nflow, but that the shock itself is not influenced by the field. However, it is well known\nthat transverse magnetic fields can soften shocks in the ISM. Observations of infall\nsignatures in optical spectral lines in CTTS constrain the pre-shock velocity, while the\nFUV line ratios strongly constrain the velocity (through the peak temperature reached in\nthe shock) and the density of the shocked material. Hence, the only way to explore the\ndegree to which magnetic fields influence accretion shocks on the surface of CTTS is\nwith a multiwavelength approach that involves both FUV and optical line diagnostics.\nA way in which our survey can make a huge impact on the field of star formation is by\nmapping the actual geometry of magnetospheric accretion. Our program will be the first\nto connect accretion shocks on the stellar photosphere (traced by FUV lines), with\naccretion columns in the extended magnetosphere and with outflows generated from the\ninner disk surface, both of which emit optical line emission. The first magnetospheric\naccretion theories assumed that the dipole axis of the magnetic field is aligned with the\nstellar rotation axis, so that the accretion occurs in an axisymmetric ring near the rotation\npoles. However, observations of rotational modulation of accretion signatures show that\nthe geometry is more complex, and a tilted dipole geometry is popular now, with the\nScowen et al.\n\n3\n\n\fProtostars to Planets\naccretion still occurring near the rotation poles. Observational support for this picture is\nfound in time series analysis of Balmer line profile variations in the CTTS SU Aur accretion and wind signatures in the Hα and Hβ line profiles are rotationally modulated\nand vary exactly 180o out of phase with one another, a natural prediction of a tilted dipole\ngeometry.\nHowever, while similar optical line profile variability has been observed in one other\nCTTS, systematic variability is not generally seen. Part of the difficulty certainly lies in\nthe fact that variations in the accretion rate also affect the Balmer line profiles. In\naddition, the Balmer lines form over an extended zone including the magnetosphere and\nthe wind/jet launching region in these stars. Hence, it is difficult to disentangle where\nvarious features in the profiles form and reconstruct the geometry of the line formation\nregion. In addition, spectropolarimetric observations of CTTS show that the magnetic\nfields are not simply dipolar. As a result, the magnetic field geometry controlling\naccretion in CTTS as a whole is not well understood. This lack of knowledge obviously\nimpacts accretion studies of these stars, but may also affect our understanding of the\norigin of winds and jets observed from YSOs. For example, one of the two leading\ntheories for the origin of the winds and jets in these stars relies on the interaction of the\nmagnetic field with the inner disk (e.g. the \"X-wind\" theory) and is critically dependent\non the geometry of this interaction.\nThe Evolution of Gas in Protoplanetary Disks\nIdeally, a CS disk evolves from a massive gas-rich remnant of star formation (a\nprimordial disk) to a relatively low mass, gas-free planetary system. An intermediate\nstage is the debris phase, during which the disk is composed of material produced by the\ndestruction of planetesimals. Debris disks are basically young, dense versions of our\nasteroid and Kuiper belts. However, the details of disk evolution are not known,\nincluding the times and conditions required for formation of various planetary bodies. In\nthe traditional picture, giant planets form by accretion of gas onto a massive solid core,\nwhich must form before the primordial molecular gas in the disk dissipates. Observations\nsuggest that the typical gas dissipation timescale is shorter than about 10 Myr, possibly as\nshort as 1 Myr in regions of high-mass star formation. Massive core formation takes at\nleast a few Myr for solar-type stars, and much longer for low-mass stars. This has led\nsome workers to suggest alternative theories for giant planet formation, i.e. that they form\nvery rapidly by direct collapse in gravitationally unstable disks. However, it is not yet\nabsolutely clear that core-accretion models must be rejected, due to the uncertain\ntimescale for primordial gas dissipation around different types of stars.\nThe goal of this research is to characterize the gas in protoplanetary disks, as it evolves\nfrom primordial molecular gas to secondary gas produced by evaporation of\nplanetesimals. This will provide critical constraints on\n1) the process by which giant planets form,\n2) the dynamics of planetary bodies and dust in young CS disks, and\n3) the nature and history of volatile materials in terrestrial planets.\nPrimordial Gas and Giant Planet Formation\nThe decisive test of core-accretion theory may come from studies of young low-mass\nScowen et al.\n\n4\n\n\fProtostars to Planets\nstars. Giant planets are found around M-stars, but are extremely hard to form by coreaccretion unless the primordial gas lifetime is longer than around solar-type stars.\nTherefore, comparison between the frequency of planets around low-mass stars and the\ntypical H2 lifetime in their disks will be a powerful constraint on giant planet formation\ntheory.\nDifficulties in measuring disk gas masses are responsible for the current uncertainty\nabout the primordial gas lifetime. The most commonly used molecular gas tracer, carbon\nmonoxide, can freeze out onto dust grains in the cold outer regions and midplanes of\ndisks, and is not a reliable proxy for total gas mass. Direct observations of the most\nabundant molecular gas, H2, are necessary to determine total disk gas masses. The FUV\nelectronic transitions of H2 are very strong and provide access to gas with a wide range of\ntemperatures, from a few Kelvins to thousands of Kelvins. This can be through\nobservation of line of sight H2 absorption or observation of fluorescent H2 emission\nproduced by UV pumping. Such studies have shown a surprising diversity of H2 gas\ncharacteristics in systems with ages in the critical range from ~ 1 – 10 Myr.\nWhile the existing FUV spectra of protoplanetary disks are intriguing, only a few systems\nhave been studied, and it is not known if they are typical. The most critical shortcoming\nof the sample is that it is heavily weighted toward the FUV-bright A-stars and currently\ncontains only one M-star (the relatively old system AU Mic). FUSE was not sensitive\nenough to observe more than 3 or 4 of the nearest young M-stars. Study of the typical\nprimordial gas lifetime in the disks of low-mass stars will require the greater sensitivity\nof our survey.\nSecondary Gas in Debris Disks\nAfter primordial gas has dissipated, secondary CS gas is produced by the destruction of\nplanetesimals. For example, CO observed in the β Pic debris disk is definitely secondary\ngas, likely produced by evaporation of icy comet-like material. Secondary gas is of\ninterest for two primary reasons. First, it is believed that most of the volatile content of\nterrestrial planets is delivered during the debris phase by the impact of water-rich\nplanetesimals. The composition of planetesimals in debris disks provides insights on\nterrestrial planet atmospheres, including Earth as well as those to be studied by\nTerrestrial Planet Finder. Extrasolar planetesimals are far too small and faint to perform\nspectroscopy on individual objects, but the secondary gas in debris disks should reflect\ntheir bulk composition.\nSecond, dust structures seen in coronagraphic images of debris disks, like clumps and\nrings, have been attributed to the gravitational effect of unseen giant planets. As such,\nthey may provide indirect evidence of young planets that cannot be detected with\nstandard radial velocity techniques because of the intrinsic variability of young stars.\nUnfortunately, dynamical models of these structures do not take into account secondary\ngas, and rarely include gas drag at all, due to the lack of useful observational constraints.\nHowever, even very low gas abundances will have a dramatic effect on small grains,\nwhich are the ones most easily seen in disk images. Interpretation of dust structures will\nnever be secure until secondary gas abundances in debris disks are measured so that gas\ndrag may be accurately included in dynamical models.\nScowen et al.\n\n5\n\n\fProtostars to Planets\nTo date, only two observational techniques have been able to firmly detect gas in debris\ndisks: 1) UV/optical absorption spectroscopy of edge-on disks and 2) spatially-resolved\noptical spectroscopy of resonantly scattered emission from gaseous species. FUV\nspectroscopy is particularly important, since the transitions out of the ground states of the\nmost abundant atomic species lie in the FUV (H I, C I, C II, N I, O I, etc.). Transitions of\npotentially abundant gaseous molecular species such as CO, OH, and H2O also lie in the\nFUV. Further progress on characterization of gas in debris disks will require highresolution FUV absorption spectroscopy.\nThe Composition and Structure of Extrasolar Giant Planets\nThe discovery of giant planets orbiting very close to their parent stars (within 1 AU) was\none of the biggest surprises of the last 10 years. It is extremely unlikely that these socalled \"hot Jupiters\" formed where they are currently seen. Rather, it is believed that\nthey formed at Jupiter-like distances from their parent stars and then moved into tight\norbits through the newly suggested and poorly understood process of planetary migration.\nIf the inclination of a planet's orbit with respect to plane of the sky is high, then it may\npass in front of its parent star, i.e. transit the star. Their proximity to their parent stars\nmakes it more likely that hot Jupiters will transit. Currently, there are 5 known transiting\nhot Jupiters, the best-studied of which is HD 209458. Broad-band photometric light\ncurves of HD 209458 taken during transit gave the size of the planet, allowing calculation\nof its mean density and giving the first real confirmation that it was indeed a gas giant.\nDuring a transit, light from the star passes through the planet's atmosphere. This raises\nthe exciting possibility of probing the structure and composition of extrasolar giant\nplanets using transit spectroscopy. The first detection of an extrasolar planet atmosphere\nwas with space-based optical absorption spectroscopy of Na I in HD 209458. The\nplanet's atmosphere has also been detected with transit spectroscopy at Lyman-α. This\nobservation showed that the planet is surrounded by an extended H I atmosphere that\noverflows its Roche lobe: the planet is being evaporated by its central star.\nThese observations represent the beginning of general characterization of extrasolar giant\nplanets. Transit spectroscopy, particularly in the FUV where the transitions of the most\nabundant atomic species lie, will allow us to answer many questions. What are the\ncompositions of the atmospheres of hot Jupiters? Are they actually similar to gas giants\nin the Solar System (Jupiter, Saturn)? What is the structure of their outer atmospheres?\nHow fast do they evaporate and what do they look like after significant evaporation?\nThere are many ground-based surveys in progress searching for transiting giant planets,\nwhich seem to be beginning to bear fruit. In addition, the Discovery-class Kepler space\nmission is scheduled to be launched in 2009. The goal of this mission is the indirect\ndetection of terrestrial planets through high-precision photometric monitoring of 100,000\nstars for transits. Many transiting giant planets will be detected as well, providing an\nexcellent set of targets for transit spectroscopy with our survey.\nKey Advances in Observation Needed\nTo achieve the science goals of this program a variety of capabilities need to be\nimplemented. The majority of the objects being targeted require the aperture of a\nmedium to large (2-4m) UV/optical space telescope combined with a high throughput,\nScowen et al.\n\n6\n\n\fProtostars to Planets\nhigh resolution FUV spectrograph that is sensitive down to 100nm to provide access to\nkey diagnostic lines. Over the next decade the specific technological capabilities that\nneed to be developed include the design of next generation FUV reflective coatings and\nnext generation FUV detectors that can yield remarkable advances in detection efficiency\nfor a minimal investment.\nFour Central Questions to be Addressed\n1. What are the preferred modes of accretion onto young low-mass stars? What do\nthese modes tell us about the earliest of stages of formation of planetary systems\naround this size of star?\n2. Similarly, what are the preferred modes of accretion onto higher mass stars such\nas Herbig Ae/Be stars, and what do differences in these modes tell us about the\nprocess of planet building? In particular what does this tell us about the\nmechanism that forms giant planets?\n3. What are the gas dissipation timescales in early protoplanetary disks and what\nrestrictions does this place on the formation of giant planets versus terrestrial\nplanets in terms of cutting off the supply of accreting material?\n4. What is the mechanism by which volatiles are delivered to terrestrial planets and\nthereby create the atmospheres and produce water-rich cnvironments on what\ncould become physical analogs to our own Earth?\nArea of Unusual Discovery Potential for the Next Decade\nWhile the science program in this paper have defined a loose set of specifications (see\nTable 1), it should be recognized that the opportunity for truly unique discovery is made\npossible by the combination of two new technological developments over the next\ndecade: new low-maintenance, low-risk, high reflectivity FUV optical coatings, and next\ngeneration multi-channel plate detectors that yield high DQEs in large enough formats to\nallow simple construction of focal plane arrays with a small enough resolution element\npitch to support high resolution spectroscopy.\nParameter\nAperture\n\nSpecification\n2-4m\n\nStability\n\nA small percentage of\na pixel\nCombination of gain,\nA/D conversion and\nQE need to be stable\nto better than 10-5\nDevelopment of\nstable, highreflectivity FUV\nmirror coatings\nDevelopment of next\ngeneration MCP\ntechnology\nR > 30,000\n\nPhotometric\nStability\n\nCoatings\n\nFUV Detectors\n\nFUV\nSpectroscopic\nResolution\n\nJustification\nThis is driven by the limiting magnitudes needed traded\nagainst the necessary exposure times to achieve them – the\nlarger the better\nTo allow the stable photometry and astrometric\nmeasurements necessary to achieve the science goals\nAgain to provide the photometric stability to achieve the\nscience goals of the project\n\nTo provide high throughput access to the FUV (below\n115nm) while minimizing risk to the optical reflectivity of an\noptical system\nTo provide a low-cost, high QE, robust solution to allow\nefficient observations of FUV emission, below 115nm to as\nlow as 100nm\nTo enable sufficient resolution to see structure and dynamics\nof emission from science targets\n\nTable 1: Science Driven General Specifications\n\nScowen et al.\n\n7\n\n\f"}