{"id": "http://arxiv.org/abs/1112.3251v2", "guidislink": true, "updated": "2012-03-14T15:17:50Z", "updated_parsed": [2012, 3, 14, 15, 17, 50, 2, 74, 0], "published": "2011-12-14T15:36:06Z", "published_parsed": [2011, 12, 14, 15, 36, 6, 2, 348, 0], "title": "Rheology of Lamellar Liquid Crystals in Two and Three Dimensions: A\n  Simulation Study", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1109.0671%2C1109.6470%2C1109.0643%2C1109.0784%2C1109.6667%2C1109.5653%2C1109.2950%2C1109.3552%2C1109.1440%2C1109.0545%2C1109.1889%2C1109.0855%2C1109.3956%2C1109.3975%2C1109.2353%2C1109.3913%2C1109.1194%2C1109.3797%2C1109.2770%2C1109.5228%2C1109.6603%2C1109.3490%2C1109.6854%2C1109.2940%2C1109.5577%2C1109.3709%2C1109.1452%2C1109.3759%2C1112.4286%2C1112.0874%2C1112.5753%2C1112.5245%2C1112.1922%2C1112.1295%2C1112.3080%2C1112.3590%2C1112.6019%2C1112.0628%2C1112.0427%2C1112.2407%2C1112.1293%2C1112.2662%2C1112.2443%2C1112.0382%2C1112.2857%2C1112.6229%2C1112.5516%2C1112.6099%2C1112.4029%2C1112.0248%2C1112.3902%2C1112.0053%2C1112.3251%2C1112.5189%2C1112.1900%2C1112.0640%2C1112.2638%2C1112.3584%2C1112.0335%2C1112.3031%2C1112.0336%2C1112.5657%2C1112.1646%2C1112.2634%2C1112.6406%2C1112.1431%2C1112.4564%2C1112.3018%2C1112.2580%2C1112.1284%2C1112.1689%2C1112.2017%2C1112.3969%2C1112.5916%2C1112.0492%2C1112.1337%2C1112.1182%2C1112.4456%2C1112.1129%2C1112.3453%2C1112.3131%2C1112.3230%2C1112.3588%2C1112.1898%2C1112.3482%2C1112.4579%2C1112.4900%2C1112.5291%2C1112.3045%2C1112.5414%2C1112.1999%2C1112.3754%2C1112.4061%2C1112.2785%2C1112.2273%2C1112.2707%2C1112.1845%2C1112.0249%2C1112.4142%2C1112.5388%2C1112.0281&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Rheology of Lamellar Liquid Crystals in Two and Three Dimensions: A\n  Simulation Study"}, "summary": "We present large scale computer simulations of the nonlinear bulk rheology of\nlamellar phases (smectic liquid crystals) at moderate to large values of the\nshear rate (Peclet numbers 10-100), in both two and three dimensions. In two\ndimensions we find that modest shear rates align the system and stabilise an\nalmost regular lamellar phase, but high shear rates induce the nucleation and\nproliferation of defects, which in steady state is balanced by the annihilation\nof defects of opposite sign. The critical shear rate at onset of this second\nregime is controlled by thermodynamic and kinetic parameters; we offer a\nscaling analysis that relates the critical shear rate to a critical \"capillary\nnumber\" involving those variables. Within the defect proliferation regime, the\ndefects may be partially annealed by slowly decreasing the applied shear rate;\nthis causes marked memory effects, and history-dependent rheology. Simulations\nin three dimensions show instead shear-induced ordering even at the highest\nshear rates studied here. This suggests that the critical shear rate shifts\nmarkedly upward on increasing dimensionality. This may in part reflect the\nreduced constraints on defect motion, allowing them to find and annihilate each\nother more easily. Residual edge defects in the 3D aligned state mostly point\nalong the flow velocity, an orientation impossible in two dimensions.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1109.0671%2C1109.6470%2C1109.0643%2C1109.0784%2C1109.6667%2C1109.5653%2C1109.2950%2C1109.3552%2C1109.1440%2C1109.0545%2C1109.1889%2C1109.0855%2C1109.3956%2C1109.3975%2C1109.2353%2C1109.3913%2C1109.1194%2C1109.3797%2C1109.2770%2C1109.5228%2C1109.6603%2C1109.3490%2C1109.6854%2C1109.2940%2C1109.5577%2C1109.3709%2C1109.1452%2C1109.3759%2C1112.4286%2C1112.0874%2C1112.5753%2C1112.5245%2C1112.1922%2C1112.1295%2C1112.3080%2C1112.3590%2C1112.6019%2C1112.0628%2C1112.0427%2C1112.2407%2C1112.1293%2C1112.2662%2C1112.2443%2C1112.0382%2C1112.2857%2C1112.6229%2C1112.5516%2C1112.6099%2C1112.4029%2C1112.0248%2C1112.3902%2C1112.0053%2C1112.3251%2C1112.5189%2C1112.1900%2C1112.0640%2C1112.2638%2C1112.3584%2C1112.0335%2C1112.3031%2C1112.0336%2C1112.5657%2C1112.1646%2C1112.2634%2C1112.6406%2C1112.1431%2C1112.4564%2C1112.3018%2C1112.2580%2C1112.1284%2C1112.1689%2C1112.2017%2C1112.3969%2C1112.5916%2C1112.0492%2C1112.1337%2C1112.1182%2C1112.4456%2C1112.1129%2C1112.3453%2C1112.3131%2C1112.3230%2C1112.3588%2C1112.1898%2C1112.3482%2C1112.4579%2C1112.4900%2C1112.5291%2C1112.3045%2C1112.5414%2C1112.1999%2C1112.3754%2C1112.4061%2C1112.2785%2C1112.2273%2C1112.2707%2C1112.1845%2C1112.0249%2C1112.4142%2C1112.5388%2C1112.0281&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We present large scale computer simulations of the nonlinear bulk rheology of\nlamellar phases (smectic liquid crystals) at moderate to large values of the\nshear rate (Peclet numbers 10-100), in both two and three dimensions. In two\ndimensions we find that modest shear rates align the system and stabilise an\nalmost regular lamellar phase, but high shear rates induce the nucleation and\nproliferation of defects, which in steady state is balanced by the annihilation\nof defects of opposite sign. The critical shear rate at onset of this second\nregime is controlled by thermodynamic and kinetic parameters; we offer a\nscaling analysis that relates the critical shear rate to a critical \"capillary\nnumber\" involving those variables. Within the defect proliferation regime, the\ndefects may be partially annealed by slowly decreasing the applied shear rate;\nthis causes marked memory effects, and history-dependent rheology. Simulations\nin three dimensions show instead shear-induced ordering even at the highest\nshear rates studied here. This suggests that the critical shear rate shifts\nmarkedly upward on increasing dimensionality. This may in part reflect the\nreduced constraints on defect motion, allowing them to find and annihilate each\nother more easily. Residual edge defects in the 3D aligned state mostly point\nalong the flow velocity, an orientation impossible in two dimensions."}, "authors": ["O. Henrich", "K. Stratford", "D. Marenduzzo", "P. V. Coveney", "M. E. Cates"], "author_detail": {"name": "M. E. Cates"}, "author": "M. E. Cates", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1039/C2SM07374A", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1112.3251v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1112.3251v2", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "18 pages, 12 figures", "arxiv_primary_category": {"term": "cond-mat.soft", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cond-mat.soft", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "cond-mat.mes-hall", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "cond-mat.mtrl-sci", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "nlin.CG", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "physics.comp-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1112.3251v2", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1112.3251v2", "journal_reference": "Soft Matter 8 (14), 3817-3831 (2012)", "doi": "10.1039/C2SM07374A", "fulltext": "Rheology of Lamellar Liquid Crystals in Two and Three Dimensions:\nA Simulation Study\n\narXiv:1112.3251v2 [cond-mat.soft] 14 Mar 2012\n\nO. Henricha,c , K. Stratfordb , D. Marenduzzoc , P. V. Coveneya and M. E. Cates c\n\nWe present large scale computer simulations of the nonlinear bulk rheology of lamellar phases (smectic liquid crystals) at moderate to large values of the shear rate (Peclet numbers 10 − 100), in both two and three dimensions. In two dimensions we find that\nmodest shear rates align the system and stabilise an almost regular lamellar phase, but high shear rates induce the nucleation and\nproliferation of defects, which in steady state is balanced by the annihilation of defects of opposite sign. The shear rate γ̇c at onset\nof this second regime is controlled by thermodynamic and kinetic parameters; we offer a scaling analysis that relates γ̇c to a critical \"capillary number\" involving those variables. Within the defect proliferation regime, the defects may be partially annealed\nby slowly decreasing the applied shear rate; this causes marked memory effects, and history-dependent rheology. Simulations in\nthree dimensions show instead shear-induced ordering even at the highest shear rates studied here. This suggests that γ̇c shifts\nmarkedly upward on increasing dimensionality. This may in part reflect the reduced constraints on defect motion, allowing them\nto find and annihilate each other more easily. Residual edge defects in the 3D aligned state mostly point along the flow velocity,\nan orientation impossible in two dimensions.\n\n1\n\nIntroduction\n\nInstances of soft complex fluids abound in our everyday lives:\nexamples include paint (a colloidal suspension), mayonnaise\n(an emulsion), and engine oil (a polymer solution). Many soft\nmaterials, including the amphiphiles used in skin creams, fabric softeners, and some pharmaceutical products, form lamellar mesophases (also known as smectic liquid crystals) whose\nperfectly ordered state consists of a regular stack of flat layers. As well as these lyotropic liquid crystals arising in amphiphilic solutions, thermotropic smectics commonly arise in\nsystems of rodlike, mesogenic molecules even without solvent 1 . Such phases are of wide technological importance in\ndevices such as electronic displays and sensors.\nThe flow behaviour (rheology) of smectic liquid crystals\naffects many industrial and manufacturing processes; conversely, rheological measurements provide important probes\nof their macroscopic material properties. For a simple fluid\nthe response to steady applied stress is quantified in the linear\n(Newtonian) regime by a single viscosity. Lamellar phases\nare anisotropic, and thus in principle have several viscosities\nas well as an elastic modulus related to layer compression.\nHowever, these linear response parameters become somewhat\nirrelevant when defects are present: unless their density is very\nlow, the defects soon dominate the stress. Moreover, since the\na\n\nCentre for Computational Science, University College London, 20 Gordon\nStreet, London WC1H 0AJ, UK\nb Edinburgh Parallel Computing Centre, School of Physics and Astronomy,\nUniversity of Edinburgh, JCMB Kings Buildings, Mayfield Road, Edinburgh\nEH9 3JZ, UK\nc SUPA, School of Physics and Astronomy, University of Edinburgh, JCMB\nKings Buildings, Mayfield Road, Edinburgh EH9 3JZ, UK\n\ndefect pattern is strongly dependent on flow rate, the rheology\nis generically nonlinear. On shearing, the effective viscosity\n(ratio of shear stress σxy to strain rate γ̇) may either increase\nor decrease, corresponding to shear thickening or shear thinning behaviour 2 . In addition, if a defect texture is present in\nthe system at rest, this may show a viscosity divergence at\nsmall γ̇ - i.e., a yield stress. Finally, in common with other\ncomplex fluids, lamellar phases can undergo transitions into\nheterogeneous states, for instance to form shear bands (layers\nof unequal σxy or γ̇) 3 .\nLamellar liquid crystals provide an important paradigm for\nnon-Newtonian fluids in which the microstructure of the material is strongly coupled to the flow. Crucially, the defect\ntexture may depend on past history – for instance, the strain\nrate in any prior flow that was suddenly switched off. This\nrheological hysteresis means that the precise flow protocol,\nincluding any pre-shearing applied prior to starting the experiment, needs to be specified. Such hysteresis can arise in\npolydomain liquid crystals of various types (not just smectics) such as nematics in which the existence and evolution\nof regions with misaligned directors creates rheological nonlinearity. A closely related example is the so-called 'region I\nflow' in polymeric nematic liquid crystals, where it is thought\nthat a defect network arises, with enhanced viscosity, but with\nmarked shear thinning as this structure is sheared out at high\nflow rates 2 .\nAn intriguing complication in addressing the dynamics of\nlayered systems is permeation, where individual molecules\nin the fluid translate while keeping the layerwise order intact. In steady state, permeation leads to increased dissipation and hence to a large viscosity in any geometry where\n1–18 | 1\n\n\fflow necessitates such motion 1 . (A well-known example of\npermeation flow is found in cholesterics which are sheared or\npushed along the direction of the cholesteric helix.) Permeation is often involved in defect motion such as the growth\nor shrinkage of incomplete layers at the sites of edge dislocations, and may also be implicated in other forms of topological reconstruction. Such reconstruction arises under shear,\nsometimes to an extreme degree, for instance in the shearinduced transition from an ordered lamellar stack to an onion\nphase in lyotropic smectics 4–7 . (The onion phase comprises a\nspace-filling packing of multilayer vesicles; under some conditions similar defect textures can arise without shear 8–11 .)\nThe mechanism underlying such global reconstructions under\nshear of the layer organization remains unclear. Most theoretical predictions have focussed on buckling and other instabilities of perfectly ordered smectics as the initial trigger\nfor onion formation 12–16 but the pathway may also strongly\ninvolve the physics of defect motion 17,18 . Although we do\nnot see onions in the simulations reported here, in two dimensions we do see a transition from a well ordered phase to a\ndefect-rich phase, whose possible link to onion formation deserves to be explored in future work. Another interesting avenue connects with the observation, in block copolymers and\nsome lyotropic surfactant systems, of a shear-induced phase\ntransitions from a homogeneous state into ordered phases like\nthe lamellar one 19–21 . However, theory suggests that thermal\nnoise (causing local fluctuations about the mean state of order)\nplays a central role in this transition 19 . In the present work we\nfocus on the simplest case in which such thermal fluctuations\nare ignored, and the time evolution of the microstructure is deterministic (though certainly chaotic and unpredictable once\ndefects are present).\nDespite a wealth of experimental results, and the importance of flow behaviour to many commercial applications,\nmechanistic understanding of the rheology of lamellar phases\nremains limited. This is largely because of the nonlinear nature of the equations of motion, and the coupling of the flow to\ndifferent microstructures. These complications either require\ndrastic approximations or, as pursued here, use of computer\nsimulation. However, once defects are present, such simulations are computationally expensive. While sheared smectics have been studied extensively via simulations in the literature 22–28 , computational constraints have meant almost all\nthese results are limited to two dimensions. Even in 2D, the\nnumber of layers simulated has often not been large enough to\nmeaningfully explore the dynamics of defect textures which\ncan have a controlling influence on rheology. Moreover, for\ntechnical reasons a number of these studies have used boundary conditions (BCs) that are not optimal if one wants to predict the behaviour of bulk samples, for example using solid\nmoving walls to drive the fluid flow rather than periodic BCs.\nThis choice does not minimize finite size effects and, when\n2|\n\n1–18\n\ncombined with lattice Boltzmann algorithms, severely limits\nthe shear rates attainable in large systems. Moreover, solid\nwalls for the fluid velocity have sometimes been used in conjunction with periodic BCs for the order parameter 28 – a\nsomewhat inconsistent combination that makes it difficult to\ndisentangle bulk and boundary effects.\nIn this work, we try to overcome these technical obstacles,\npresenting systematic results for large two dimensional simulations with fully periodic boundary conditions. Guided by\nthose results, we additionally report some very large three\ndimensional simulations at selected points in the parameter\nspace. These 3D simulations are, we believe, of unprecedented scale for lamellar phases, although even larger ones\nhave recently been used to address the rheology of cubic liquid crystals 29,30 .\nBelow, we describe smectics via a widely-used free energy\nfunctional 23,28,31,32 . This provides a robust generic framework\nfor addressing lamellar ordering without being tied to any specific class of materials (although we do become more specific\nwhen estimating suitable parameters for the simulations). The\nfree energy is formulated in terms of a scalar order parameter\nφ(r). This can be viewed as describing a composition variable\nin a binary fluid system stabilized by added amphiphiles; one\ncan then speak of alternating layers of fluid, with interfaces\nbetween these layers. A similar interpretation applies to block\ncopolymers where the composition variable describes the relative local density of the two blocks. However, the same order\nparameter could equally describe the local number density of\nthe midpoints of a rodlike mesogenic molecule (measured relative to the mean) which can develop a periodic density wave\nthat represents a thermotropic smectic state.\nThe governing equations in our model are a convectiondiffusion equation for the scalar order parameter, and the\nNavier-Stokes equation describing the hydrodynamics of fluid\nflow. The stress tensor for the fluid contains not only a Newtonian viscous term but extra contributions arising from local\ndeviations of the order parameter from its state of least free energy. Diffusive relaxation of the order parameter then causes\nadditional dissipation, resulting in an effective viscosity that\ncan be much higher than the intrinsic Newtonian contribution. Our dynamical equations are solved using a combination of a finite difference scheme for the convection-diffusion\nequation, and the lattice Boltzmann method (LBM) 33 for\nthe Navier-Stokes equation 23,34–37 . We use sliding periodic\n(Lees-Edwards) boundary conditions for both the convectiondiffusion and the Navier-Stokes equations. Note that while\nthese boundary conditions impose a fixed integrated strain rate\nacross the whole system they do not impose a uniform strain\nrate locally; shear bands can therefore arise if the system so\nchooses. (As it happens, we do not observe shear bands in the\nrange of shear rates we address here.)\nOur main finding is that, in two dimensions at least, sheared\n\n\fsmectics can show two completely different types of rheological response. At modest rates of shear, where thermodynamic\nforces are relatively strong compared with flow effects, shear\nquickly aligns the system into the perfect lamellar phase preferred by thermodynamics, with only a few defects. The rheology in this regime is quasi-Newtonian, with shear stress linear in the applied shear rate. (There is however a large first\nnormal stress difference.) At higher shear rates, larger thermodynamic forces are generated as layers fail to keep up with\nthe imposed flow. This leads to the nucleation of many new\ndefects, balanced in steady state by annihilation when defects\nof opposite sign encounter each other.\nThe defects do not appear as a direct result of spontaneous\nthermal fluctuations. Instead they are a result of an undulation\ninstability in our (deterministic) nonlinear dynamics. This occurs when viscous forces begin to dominate interfacial forces\ncausing layers to pinch off and break, creating new defects\nin the process. The onset of a nontrivial topological pattern\nunder deterministic evolution equations in a complex fluid is\nsimilar to the case of sheared binary fluids undergoing phase\nseparation 38 .\nThe strain rate γ̇c needed to enter this nonlinear flow regime\ndepends on thermodynamic and kinetic parameters. A comprehensive exploration of parameter space is not possible, but\nwe give a scaling argument which relates γ̇c to those parameters through an effective capillary number, formed as the ratio\nof viscous to thermodynamic stress. Within the defect proliferation regime, the macroscopic rheology is generically nonlinear, and shows shear thinning. The shear stress appears to\nvary as a sublinear power law, σxy ∝ γ̇m , with m ' 0.87 for\ntypical parameter values, although the dependence of m on\nthe parameters precludes interpretation of this as a universal\nscaling law. Such a behaviour is qualitatively reminiscent of\nthe one found experimentally in 39 , where the numerical value\nof m was however different. In this strongly non-Newtonian\nregime we also find that the rheology is history dependent.\nFinally, and intriguingly, we find that dimensionality appears to play a key role. Within our 3D simulations, even\nwhen performed with parameter values identical to those used\nin 2D, we have so far not been able to enter the nonlinear\nflow regime associated with defect proliferation. Instead, we\nalways observe shear-induced ordering into a lamellar phase\nwith quasi-Newtonian rheology. Further research, requiring\ncareful and systematic parameter steering, will be needed to\nmap out quantitatively the onset of the defect proliferation\nregime, if one exists, in three dimensions.\nThis paper is organized as follows. In Section 2 we introduce the model, including its equilibrium properties, the full\nstress tensor and the dynamical equations. We briefly sketch\nhow we derive structural information from the order parameter and describe a method for quantitative analysis of the defect density. Section 3 describes the mapping between our\n\nsimulation parameters and those for physical systems of interest. We present results for the two-dimensional case in Section\n4.1, discussing the morphology as a function of flow rate. We\nalso consider average and local shear stress densities and first\nnormal stress differences, and explore their relation to the defect structure. In addition we report Fourier-space information\n(structure factors) under flow. In Section 4.2 we present and\ncompare our results for 3D simulations which, by computational necessity, are less comprehensive than in 2D. A summary with conclusions closes the paper in Section 5.\n\n2\n\nModel and Definitions\n\nThe equilibrium phase in a system of volume V is found for\nan order parameter field φ(rr ) ≡ φ that minimises the LandauBrazovskii free energy functional 31,40 .\nZ\n\nd d x f (φ, ∇φ, ∇2 φ) = V f ̄\n(1)\n\u001b\n\u001a\nZ\nc\na 2 b 4 κ\nφ + φ + (∇φ)2 + (∇2 φ)2 .\n=\ndd x\n2\n4\n2\n2\n\nF [φ] =\n\nIn minimizing this free energy at equilibrium, we ignore thermal fluctuations (treated in 19,40 ), thereby adopting a meanfield approximation as in previous literature 23–28,41 . This\nshould be a good approximation far from the ordering transition at which φ first becomes nonuniform. The uniform state\nhas φ = 0 and hence F = 0.\nThe parameter range relevant to lamellar phases has κ < 0\nand c > 0. Then, if we suppress the quartic term, the free energy density of a sinusoidal lamellar state φ(r) = φk cos(k.r)\nobeys f ̄ = (ap+ κk2 + ck4 )φ2k /4. This is minimized by choosing k = q ≡ |κ|/2c; the free energy density is then f ̄ = (a −\nκ2 /4c)φ2q /4 so that ordering will occur for a < ac = κ2 /4c.\nThe amplitude φq is then unbounded without the (positive)\nquartic term, since f ̄ can in that manner become infinitely\nnegative.pRestoring the quartic term now causes saturation\nat φq ∼ 4(ac − a)/3b, creating also nonlinear harmonics\nin the density profile. The final free energy density obeys\nf ̄ ' (ac − a)2 /b. By similar arguments, the characteristic elastic modulus associated with microstructural deformations is\nḡ ∼\n\n(ac − a)ac\n4b\n\n(2)\n\nwhich is the energy density of the gradient terms only. The\nterms involving φ2 and φ4 in Eq. 1 are unaltered by affine deformations which conserve density locally; hence those terms\ndo not contribute to ḡ.\nThe dynamics of the order parameter is governed by an\nadvection-diffusion equation with a diffusive current of φ dependent on the chemical potential μ, the functional derivative\n1–18 | 3\n\n\fof F with respect to φ, as follows:\n∂t φ + ∇(uuφ) = M∇2\n\nδF\n= M∇2 μ.\nδφ\n\n(3)\n\nHere M is a mobility coefficient. A wavevector-dependent\nlinearized collective diffusivity Dk can then be defined via\nφ̇k = −k2 Dk φk , whose value at the ordering wavevector obeys\nDq = M(a − ac )/2 (this is negative, signifying the instability). In contrast, an estimate of the molecular diffusivity can\nbe made by considering zero wavevector, setting b = −a (see\nbelow) and examining the relaxation equation for small deviations around the uniformly ordered state at φ = ±1. This\ngives φ̇ = 2bM∇2 φ so that the molecular diffusivity is of order\nD̃ = 2Mb.\nTreating the fluid as incompressible, the evolution of the\nvelocity u obeys the Navier-Stokes equation\nρ(∂t uα + (uβ ∇β )uα ) = ∂β σαβ ,\n\n(4)\n\nwhere ρ is the mass density. The stress tensor in this equation\nreads\nσαβ = η(∂α uβ + ∂β uα ) − pδαβ − Pαβ .\n(5)\nThis consists of a Newtonian hydrodynamic part, which is proportional to the background viscosity η and the symmetrized\nvelocity gradient, a hydrostatic pressure term, which includes\nan isotropic stress contribution from the order parameter\n\u0012\n\u0013\n1\na 2 3b 4\nφ + φ − κ φ(∇2 φ) + (∇φ)2\npφ =\n2\n4\n2\n\u0013\n\u0012\n1\n+c φ(∇2 )2 φ + (∇2 φ)2 + ∂γ φ∂γ (∇2 φ) (6)\n2\nand finally another term consisting of the order-parameter contribution to the deviatoric pressure 22,42,43\n\u0001\nPαβ = κ∂α φ∂β φ − c ∂α φ∂β (∇2 φ) + ∂β φ∂α (∇2 φ) . (7)\nIn our hybrid LB scheme, the Navier-Stokes equation (4) is\nsolved at every timestep by means of a multi-relaxation time\nlattice-Boltzmann solver 44,45 using the D3Q19 model. The\nvelocity field is then used in the advection-diffusion equation\nEq.3, which is solved by a finite-difference method at the same\ntimestep. We assume periodic boundary conditions along the\nflow and vorticity directions and Lees-Edwards sliding periodic boundary conditions 46,47 along the direction of the velocity gradient. Following 47 , we introduce additional internal\nLees-Edwards planes to overcome an upper limit on shear rate\nthat would otherwise be inversely proportional to the system\nsize in the gradient direction. (This restriction arises because\nfluid velocities must be small compared to the sound speed in\nthe frame of the lattice; the additional planes create a stack\nof lattice slabs whose velocity is nearly matched to the local\n4|\n\n1–18\n\nfluid velocity.) The total number of Lees-Edwards planes was\nvaried according to the size of the simulation so that the separation of two planes was always 16 lattice sites. We relegate\nfurther comments on the implementation of the Lees-Edwards\nboundary conditions to an Appendix.\nStructural information in Fourier space was obtained from\nthe static structure factor C(k), defined as\nC(k) = φ(k)φ(−k),\n\n(8)\n\nwith φ(k) the normalized Fourier transform of the order parameter. The transform itself was calculated using the FFTWlibrary 48 . In principle an ensemble-average or time-average\nshould appear in Eq. 8 so that C becomes a smooth function of\nwavevector; in practice an instantaneous measurement, plotted\nas a colour intensity map, was found sufficient.\nFor the analysis of the relation between rheological quantities and the morphology of the system we need to quantify the\nnumber of defects. For this purpose we defined an alignment\nfunction X(r), which measures the average orientation of the\norder parameter gradients, as follows\n1\nX(r) = 0\nV (r)\n\nZ\nV 0 (r)\n\ndr\n\n0\n\n\u0012\n\n∇φ(r) * ∇φ(r0 )\n|∇φ(r)||∇φ(r0 )|\n\n\u00132\n.\n\n(9)\n\nHere V 0 is a small volume that contains r; in practice V 0 can\nbe chosen to contain r and its nearest neighbours only.\nFor ordered regions with small curvature of the lamellar interfaces, X is very close to unity. Wherever lamellae terminate at edge dislocations, and in regions where their orientation changes abruptly, X departs from unity, taking smaller\npositive values. By setting a threshold X = ξ it is possible\nto detect regions where the order parameter structure deviates\nsignificantly from what one would recognize visually as an\naligned lamellar configuration. We found a threshold value of\nξ = 0.8 to be well suited to our requirements. This protocol\ndoes not directly count the number of defects, since at each\ndefect more than one site has an alignment function below the\nthreshold. However, as the number of sub-threshold sites per\ndefect is reasonably constant, the degree of order under flow\ncan usefully be quantified by defining a \"defect density\" as the\nsystem-wide fraction of sub-threshold sites:\nρD (r) =\n\n1\nV\n\nZ\n\ndr0 θ(ξ − X(r0 )).\n\n(10)\n\nHere θ is the Heaviside function. The conversion factor between ρD and the defect number density (in 2D) or line density (in 3D) depends on the lamellar wavenumber q and the\nchoice of threshold parameter ξ; we do not make such conversions here and consider ρD itself as an appropriate measure of\ndisorder.\n\n\f3\n\nParameter Mapping to Physical Units\n\nThe Landau-Brazovskii model belongs to the class of phenomenological models of liquid-crystalline materials. This\nmeans it features an isotropic-to-lamellar phase transition\nwithout explaining the underlying microscopic mechanism.\nHence there is a many-to-one mapping between physical parameters and those of the phenomenological model. However,\nin the context of any particular system, it is possible to indicate physical parameters for which the chosen model is a good\nrepresentation, and we do this below.\nThe parameter space of the model is quite large. Although\nin exploratory work we performed studies across a wider range\nof parameter values, for simplicity in the results presented here\nwe restrict attention to fixed values of κ = −6 × 10−4 LBU and\nc = 7.6 × 10−4 LBU (here LBU denotes LB units as defined\nbelow). These are chosen\np to give a lamellar wavelength of\nL = 10 LBU (that is, q = |κ|/2c = 2π/10LBU) which offers\nsuitable spatial resolution. Moreover the microphase separation point, set by ac = κ2 /4c = 1.2 × 10−4 LBU, is then a fixed\nconstant.\nAs usual we set the lattice spacing l, time step ∆t and mass\ndensity of the fluid ρ all to unity to define LB units (LBU). We\nneed to calibrate these units (or equivalently, length, energy\ndensity and time) against real physical units. We do this first\nfor thermotropic smectics, then consider the lyotropic case.\nTo calibrate the LB length unit, we equate L the lamellar\nwavelength, with that of a typical thermotropic smectic: 10\nLBU = L = 4nm. Hence the LB length unit is about 0.4nm;\nand 1m= 2.5 × 109 LBU. Free energy density parameters such\nas ac ' 10−4 LBU should then be of order α2 kB T /L3 where\nα = 10 is a molecular aspect ratio. Thus the LB unit of energy\ndensity is about 6 × 1010 Pa, i.e. 1 Pa= 1.6 × 10−11 LBU.\nTurning now to the fluid viscosity η, after pilot runs spanning a range of several decades, we selected 8.33 × 10−2 LBU\nfor the production runs reported here. This represents the\nbaseline viscosity of the isotropic phase close to the transition (not the higher, effective viscosity of the smectic once\nformed). Requiring this to be about ten times the viscosity of\nwater (which is ηw = 8.9 × 10−4 Pa s) we find that the LBU\nunit of viscosity is about 0.1Pa s. Given the previous result for\nthe energy density, we infer that 1s= 6 × 1011 LBU. The LBU\ntimestep is thus around 1.6 × 10−12 s.\nAs detailed previously, an estimate of the molecular diffusivity is D̃ = 2Mb; we set M = 0.25LBU throughout this study,\nso that D̃ lies in the range 2.5 × 10−5 − 2.5 × 10−4 LBU. Taking a mid-range value of D̃ = 10−4 LBU and using the above\nconversion factors (1 m= 2.5 × 109 LBU, 1s = 6 × 1011 LBU)\ngives D ' 10−11 m2 s−1 which is a reasonable mesogenic value.\nRecall that the mass density of our fluid is unity in LBU.\nHowever, combining the above conversion factors for length,\nenergy density, and time shows the physical and simulation\n\nunits of mass density to be related via 1 kg m−3 ≡ 1 Pa s2\nm−2 ' 10−8 LBU. Thus our simulations address a fluid of\nmass density 106 kg m−3 which is 103 times larger than the\ntrue value for a typical material. The reason for this is that\nthe LB algorithm uses fluid inertia to update the dynamics\nand the discretization should therefore involve replacing the\nreal fluid with the densest one possible, while ensuring that\nthe Reynolds number Re ∼ ργ̇L2 /η (which for real smectics\nis exceedingly small) remains small enough for the simulation to faithfully describe the low Re limit. As discussed elsewhere 49,50 Re values up to about 0.1 are then admissable; our\nsimulations comply with this requirement.\nFinally, our shear rates lie in the range 10−5 − 10−4 LBU, so\nthat the (dimensionless) Peclet number, Pe = γ̇L2 /D̃, which\nexpresses the relative importance of advective to diffusive\ntransport, lies in the range 5 − 800. These are moderate to\nhigh values where significant structural rearrangement can be\nexpected. However, for thermotropic smectics, given our time\nunit of 1LBU= 1.6 × 10−12 s, they correspond to strain rates\nof order 106 s−1 . This lies well above the range typically\naddressable with rheological experiments, but below that recently given in a theoretical study 16 .\nThe shear rates needed to achieve this range of Pe fall dramatically when lyotropic smectics are considered. For lyotropics one has L ∼ 40nm; the LB length unit is thus about\n4nm. The factor α in the free energy density is now of order\nunity (since the main contributions are entropic and for flexible membranes there is about one relevant degree of freedom\nper cube of side L) 51 . The LB unit of energy density is then\nabout 6 × 105 Pa, i.e. 1 Pa= 1.6 × 10−6 LBU. Both the viscosity η and the molecular diffusivity D̃ remain comparable\n(within one order of magnitude) to the thermotropic values;\nfrom the viscosity we then determine that 1s= 6 × 106 LBU or\n1LB timestep = 1.6 × 10−7 s. Accordingly the strain rates relevant to the Pe range addressed here are of order 102 s−1 and\nwell within experimental reach, but below that addressed in\nmolecular dynamics simulations 14,15 . Note that for lyotropics\nwe are effectively simulating a fluid of even higher mass density than for thermotropics; but since the simulated Reynolds\nnumbers are unaffected by the change in parameter mapping,\nthey are still sufficiently small 49 .\nTo further simplify our parameter exploration, throughout\nwhat follows we restrict attention to states with b = −a. This\nconvention has been widely used to study bulk spinodal decomposition in binary fluids where it can be absorbed in a\nrescaling of the order parameter 41 : put differently, b = −a\nensures that coexisting bulk ordered phases have φ = ±φ0\nwith φ0 = 1. In lamellar states of b = −a the amplitude\nof theplamellar ordering need not be unity but varies like\nφq ∼ 1 + ac /b as stated previously. Thus the chosen value\nof b can be thought of as controlling whether the peak order\nparameter variation is close to that arising for bulk coexistence\n1–18 | 5\n\n\f(when b \u001d ac ), or whether the amplitude φq is instead much\nlarger (b \u001c ac ) and determined by a competition between the\ngradient terms and a relatively weak quartic nonlinearity. In\nthis study we choose three values, b = 5 × 10−4 , 1 × 10−4 and\n5 × 10−5 LBU so that the dimensionless quantity β ≡ b/ac is\nrespectively 4.2, 0.83, 0.42, lying near the crossover between\nthese regimes. The observed φq range is about 1.2 − 1.5,\nsomewhat\np narrower than the range 1.1 − 1.8 predicted from\nφq ∼ 1 + ac /b. However the latter estimate, which does not\ntreat the nonlinear term exactly, is only a guideline.\nAlongside the Reynolds number (which we deem irrelevant), β, and the Peclet number, we can identify two further\ndimensionless numbers of interest. One is the Schmidt number Sc = η/ρD̃, which is large when momentum can diffuse\nmuch more rapidly than molecules - as applies in almost all\ndense fluids. In our simulations Sc is of order 100 − 1000\nwhich is safely large. (The work of Kumaran 52 instead addresses Schmidt numbers in the range 0.2 − 5 where different physics may apply.) The second parameter controls the\nstrength of feedback between distortions of the φ field and the\nfluid motion. This can be expressed in terms of a characteristic value of the Peclet number, Pe∗ , at which the free energy\ndensity in the order parameter field that couples to deformation (Eq.2), ḡ = (ac + b)ac /4b, is comparable to the viscous\nstress σv = ηγ̇ = (ηD̃/L2 )Pe. Equating these gives\nPe∗ =\n\n(ac + b)ac L2\n.\n8b2\nηM\n\n(11)\n\nWith our chosen parameters (in LBU, ac = 1.2 × 10−4 , L =\n10, η = 8.3 × 10−2 , M = 0.25) we find Pe∗ ∼ 180 at β = 4.2\nand Pe∗ ∼ 5000 at β = 0.42. The maximum values of Pe/Pe∗\nthat we address below are of order 0.2 and 0.08 respectively\nin the two cases.\nFor later convenience we may define a new dimensionless\nnumber, which we can call a capillary number. (The capillary number is conventionally defined as the ratio of viscous\nto interfacial forces in binary fluid flow.) We define this as:\nCa =\n\nPe\n4ηγ̇b\n=\n∗\nPe\n(ac + b)ac\n\n(12)\n\nWe will argue below that this could be a more relevant choice\nthan Pe for understanding the dependence of morphology on\nflow rate in smectic systems, at least when Pe∗ \u001d 1.\n\n6|\n\n1–18\n\n4\n\nResults and Discussion\n\nWe first present detailed results for two parameter sets (β =\n4.2, 0.42) in two dimensions which we call systems A-2D and\nB-2D. System lattice sizes and shear rates are reported in Table\n1; all remaining parameters are the same in both systems as\ndetailed above. A third parameter set (β = 0.83, system C2D) gave results broadly similar to B-2D. We will later report\nsimulations in three dimensions for systems A-3D and C-3D\nwhich share parameters with A-2D and C-2D (see Table 1).\nNote that our simulations in two dimensions are equivalent\nto assuming, in three dimensions, that the system maintains\ntranslational invariance in the vorticity direction. We find this\nis an increasingly good approximation at very low shear rates.\n4.1\n\nTwo Dimensions\n\nBefore presenting specific results for the parameter sets detailed above, we briefly describe the effect of wider parameter variations. Within the Landau-Brazovskii free energy\nfunctional (Eq. 1) a range of parameter variations can produce stable lamellar phases, as explored in previous studies 25,28,41,52,53 . The nonequilibrium morphology of the lamellar structure, and the phase ordering kinetics (starting from\na slightly noisy, uniform initial state) do however depend on\nthe choice made for these parameters, and also for the viscosity. Formation and ripening of the lamellar structure is slower\nwhen β is small, consistent with the reduced initial driving\nforce for ordering in this case. Higher viscosities lead to more\nlocally disordered structures in which there is a shorter separation between kinks or edge defects as one moves along the\nlamellae; conversely lower viscosities typically yield \"longer\"\nlamellae. This effect has been reported before 23 ; we found it\nto be more pronounced for softer (lower β) systems. At fixed γ̇,\nhigher values of η were found to cause greater inhomogeneity of lamellar shape and thickness, consistent with the fact\nthat Ca ∝ η (the larger the shear stress, the larger the lamellar\ndeformation).\nWe turn now to system A-2D (β = 4.2). The top panel\nin Fig. 1 shows the order parameter pattern φ at the end of\nthe equilibration phase prior to shearing. Although the true\nequilibrium structure would show homogeneous alignment,\nthis cannot be reached in a reasonable time scale unless shear\nis applied. The resulting metastable structure is amorphous\nand isotropic, but locally exhibits the same lamellar spacing\nL = 10 LBU as the fully ordered equilibrium state. If shear\nflow is imposed, the lamellae start to align in the flow direction, which induces a morphological changes to the structure.\nA typical snapshot in the resulting steady state at Pe = 40\n(Ca = 0.22) is shown in the middle panel of Fig. 1. In this and\nall subsequent images, the applied flow velocity is horizontal\nand the velocity gradient vertical, with the flow directed to the\n\n\frun #\nA\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n11\n12\n13\n14\nB\n15\n16\n17\n18\n19\n20\n21\n22\n23\nC\n24\n25\n26\n27\n28\n29\n\nright in the upper half and to the left in the lower half of the\npicture. After a short transient during which the order parameter pattern remains relatively homogenous (not shown) there\nemerge extended regions in which the smectic layers are either\nexpanded or compressed, so that L locally deviates from the\nequilibrium value. These mesoscopic inhomogeneities are inclined at an angle to the flow and remain continuously present\n105 γ̇ in the steady state, but are not stationary: their local features\nare advected by the flow and evolve continuously by deforma0\ntion.\n\nNx × Ny × Nz\n\ntime /105\n\n105 b\n\nCa\n\nPe\n\n1024 × 512 × 1\n1024 × 512 × 1\n1024 × 512 × 1\n512 × 256 × 1\n512 × 256 × 1\n512 × 256 × 1\n512 × 256 × 1\n512 × 256 × 1\n512 × 256 × 1\n256 × 128 × 1\n256 × 128 × 128\n256 × 128 × 128\n256 × 128 × 128\n256 × 128 × 128\n\n0-3.2\n3.2-6.4\n6.4-9.6\n0-3.2\n3.2-6.4\n3.2-25.6\n12.8-38.4\n51.2-76.8\n51.2-102.4\n3.2-16.0\n0-6.4\n3.2-6.4\n3.2-9.6\n6.4-12.8\n\n50\n50\n50\n50\n50\n50\n50\n50\n50\n50\n50\n50\n50\n50\n\n0\n0.224\n0\n0\n0.448\n0.224\n0.112\n0.056\n0.028\n0.22\n0\n0.448\n0.224\n0.112\n\n0\n40\n0\n0\n80\n40\n20\n10\n5\n40\n0\n80\n40\n20\n\n1024 × 512 × 1\n1024 × 512 × 1\n1024 × 512 × 1\n512 × 256 × 1\n512 × 256 × 1\n512 × 256 × 1\n512 × 256 × 1\n512 × 256 × 1\n512 × 256 × 1\n\n0-3.2\n3.2-9.6\n9.6-12.8\n0-3.2\n3.2-9.6\n3.2-25.6\n12.8-38.4\n25.6-64.0\n51.2-76.8\n\n5\n5\n5\n5\n5\n5\n5\n5\n5\n\n0\n0.082\n0\n0.164\n0.082\n0.041\n0.020\n0.010\n\n0\n400\n0\n0\n800\n400\n200\n100\n50\n\n0\n10\n0\n0\n20\n10\n5\n2.5\n1.25\n\n256 × 128 × 1\n256 × 128 × 1\n256 × 128 × 1\n256 × 128 × 128\n256 × 128 × 128\n256 × 128 × 128\n\n0-3.2\n3.2-9.6\n3.2-12.8\n0-3.2\n3.2-9.6\n3.2-12.8\n\n10\n10\n10\n10\n10\n10\n\n0\n0.252\n0.126\n0\n0.252\n0.126\n\n0\n400\n200\n0\n400\n200\n\n0\n20\n10\n0\n20\n10\n\nTable 1 Simulation parameters: After initialization from a noisy\nuniform state, the systems were first equilibrated at zero shear rate,\nfollowed by a sequence of various shear rates, ranging from\nγ̇ = 1.25 × 10−5 to 2 × 10−4 LBU. In some cases we performed a\nfinal switch off run at zero shear rate. The other model parameters\nκ = −6 × 10−4 , c = 7.6 × 10−4 , M = 0.25 and η = 8.33 × 10−2\nwere the same throughout all simulations.\n\n10\n0\n0\n20\n10\n5\n2.5\n1.25\n10\n0\n20\n10\n5\n\nFig. 1 Order parameter pattern φ(r) of system A-2D (thresholded to\nenhance visibility): after equilibration (timestep t = 3.2 × 105 , top),\nin steady shear at γ̇ = 1 × 10−4 (t = 5 × 105 , centre) and after\nswitch-off (t = 1.28 × 106 , bottom). Gray scaling from black to\nwhite corresponds to values of −1 ≤ φ ≤ 1.\n\nWe found that after the shear flow was switched off the\nlamellar spacing returned to its equilibrium value everywhere,\n1–18 | 7\n\n\fwith expanded regions contracting and vice versa. The final\nstate, after all relaxation has (virtually) come to a standstill,\nis shown in the bottom panel of Fig. 1. Most of the lamellae remain oriented along the flow direction, but depending\non the local expansion and compression undergone during the\nprevious flow, some regions retain strong misalignment which\ndoes not anneal away. The separation between defects as one\nmoves along the lamellae varies considerably in space; both\nshort and long separations can be seen. This applies both to\nthe aligned layers and to layers that are misaligned with the\nflow.\n\nFig. 2 Order parameter φ(r) of system B-2D: after equilibration\n(timestep t = 3.2 × 105 , top), in steady shear at γ̇ = 1 × 10−4\n(t = 8 × 105 , centre) and after switch-off (t = 1.28 × 106 , bottom).\n\nFig. 2 shows equivalent states for system B-2D (β = 0.42).\nThe Peclet number during the shearing phase is now Pe = 400\n(Ca = 0.082). All the generic results of Fig. 1 are the same,\n8|\n\n1–18\n\nbut the defect density, both during flow and after switchoff, is\nsignificantly reduced. (However the bands of misalignment in\nthe flowing state are, if anything, even more apparent.) Consequently, the lamellar alignment along the flow direction after\nswitch off is also more complete.\nIt is notable that at the shear rate shown in these figures, the\nmore ordered system is B-2D which has higher Pe than A-2D\nbut smaller Ca. Varying γ̇ within system A-2D or B-2D establishes unambiguously that the steady state order decreases\nwith shear rate at fixed thermodynamic parameters (Fig.6 below). This points strongly to Ca as the more relevant measure\nof flow rate when discussing onset of the disordered phase.\nIn principle the dependence of the state of order on flow\nrate could be smooth, or could entail a nonequilibrium phase\ntransition – for instance if the perfectly ordered state ceased\nto be stable above a certain shear rate 12,24,53,54 . In practice,\nhowever, starting as we do from an initially amorphous lamellar texture, a perfectly ordered state is generally not reached\nfor large systems even if it might be stable once formed. In\nany case it seems likely that at high Pe, any defects introduced\ninto the smectic state by deformation of an initially imperfect\nstructure (whose layers are then dilated and compressed by\nthe flow) cannot anneal away or annihilate each other rapidly.\nSuch irregularities then build up until the steady state defect\ndensity is determined by a balance between their rate of introduction and rate of annealing.\nRecently Kumaran and Raman studied a single shear rate\nand varied the Schmidt number Sc and system size, reporting\nenhanced alignment on decreasing Sc and in small systems 52 .\nOur comparative studies on systems A and C have confirmed\nboth trends (although, as mentioned previously, our Sc values\nare much higher). The same authors also discuss a distinct\nmechanism of defect creation caused by layer compression\nand splitting. Although we have not checked this in detail,\nthis may be consistent with our observation of a strongly compressed and heterogeneous morphology, with bands oriented\nnormal to the compression axis, as shown in Figs. 1 and 2.\nA somewhat different morphology in sheared lamellar systems was reported by Xu et al. 28 . This morphology exhibits\nmacroscopic inhomogeneity between the centre of the simulated domain and the regions near the walls, accompanied by\nvariations in the local shear rate. This contrasts with our own\nwork which shows translationally invariant statistics in all directions. These differences may be a result of Xu et al. 28 using\nmixed boundary conditions, as discussed already in the introduction, in which hard walls for the fluid flow are combined\nwith periodic BCs on the order parameter field.\nTo quantify our observed morphology more closely, we use\nthe alignment function X introduced in Eq. 9. Fig. 3 shows\nsnapshots of the time evolution of system A-2D at modest\nshear rate. All lattice sites with X(r) ≤ 0.8 are marked in red\nand they obviously coincide with lamellar endpoints (edge dis-\n\n\fFig. 3 Defect structure of system A-2D: at timestep t = 5.12 × 106\n(top) and 1.024 × 107 (bottom) with an imposed shear rate\nγ̇ = 1.25 × 10−5 . The system has been pre-sheared at stepwise\ndecreasing rates (see Table 1). Sites where the alignment function X\nis smaller than 0.8 are highlighted red. The system size was\nNx × Ny × Nz = 512 × 256 × 1.\n\nlocations) or other local defects. The upper panel gives the situation at the lowest applied shear rate γ̇ = 1.25 × 10−5 , immediately following a pre-shearing protocol in which the strain\nrate was ramped down stepwise from higher values (see Table\n1). While large aligned regions are present there are other regions of high defect density. The lower panel of Fig. 3 shows\na later state with a total strain incremented by a further 6400%\nlattice units (i.e. by a displacement 64 times the system size).\nObviously many defects have annealed away and the smectic\nlayers are now rather well aligned with the flow direction.\nDefect annihilation to this large extent is only found at\nlow enough shear rates. A prerequisite seems to be that\nthe defects can smoothly approach each other and then annihilate. This is prevented by the buckling of layers above\na certain shear rate; the undulations so formed ultimately\npinch off and break, resulting in the creation of new defects.\nThe onset of defect proliferation arises at characteristic flow\nrates γ̇c = 1.25 − 2.5 × 10−5 LBU in system A-2D and around\nγ̇c = 1 − 2 × 10−4 LBU in B-2D. (Here the subscript c could\nstand for \"critical\" or for \"crossover\" depending on whether\nthere is a singular transition or not; see above.) These values\nare for systems of size 512 × 256 × 1; we found evidence of\nan increasing trend with system size, but the extremely long\nrun-times involved (∼ 107 LB timesteps) precluded quantitative exploration. These results correspond respectively to values of the Peclet number, Pec , obeying 5 < Pec < 10 (system\nA) and 400 < Pec < 800 (system B). However, in terms of\nCa = Pe/Pe∗ one has 0.056 < Cac < 0.112 (system A) and\n0.082 < Cac < 0.164 (system B). Given the 80-fold difference\nin Pec , the similarity of Cac in the two different systems is\nremarkable.\nBoldly extrapolating across parameter regimes that we have\nnot explored in any detail, our results motivate the hypothesis\nthat the onset of defect proliferation occurs generically in 2D\nat Cac ' 0.08. Note that Ca, which comprises the ratio of a\nviscous stress to an elastic modulus, can also be viewed as a\nstrain. In that context one can imagine that defects proliferate when the steady-state elastic deformation of the smectic\nexceeds a yield strain value (for which a threshold of a few\npercent is reasonable). This makes sense if, at Ca ' Cac , the\nstress contributed from the order parameter is (a) comparable\nto the viscous stress from the background fluid – essentially\nthe force balance argument made above – and (b) primarily\nelastic in character. The latter in turn requires that Pec is large\nand hence that Pe∗ is larger still. A different mechanism might\napply at small Pe∗ , since in that case layers relax rapidly by\ndiffusion on the time scale set by Cac .\nIn Fig. 4 we explore the correlation between the inhomogeneous morphology in the flowing state and locally defined\nrheological quantities. The pictures show the order parameter φ(rr ), shear stress density σxy (rr ) and first normal stress\ndifference density N1 (rr ) = σxx (rr ) − σyy (rr ) of system A-2D\n1–18 | 9\n\n\fFig. 4 Order parameter φ(r) (top), shear stress σxy (r) (centre) and\nfirst normal stress differences N1 (r) (bottom) of system A-2D at\nt = 4 × 105 (see Table 1).\n\n10 |\n\n1–18\n\nin steady shear flow at shear rate γ̇ = 1 × 10−4 (Pe = 40,\nCa = 0.22). Here and below we adopt a coordinate system\nwhere x is along the flow direction and y the velocity gradient.\nIn regions where the lamellar width is larger than in the equilibrium state, shear stresses and first normal stress differences\nshow low positive or negative values. Large positive values of\nboth quantities coincide with regions where the lamellae are\nunder compression. Peak values (in LBU) are in the region of\n−2 × 10−4 and 3 × 10−4 for shear stress and −3.5 × 10−4 and\n7 × 10−4 for the normal stress differences. Despite having locally negative regions, spatial and ensemble averages of these\nquantities are always positive. Very similar results, but with\nsmaller peak magnitudes, are obtained for system B-2D at the\nsame shear rate.\nFig. 5 shows structure factors C(kk ) for the same states as\nFig. 1. C(kk ) is initially isotropic after layer formation and\nequilibration in the system at rest with, as expected, a distinct\npeak at |kk | ' ±2π/10 LBU (recall L = 10 LBU). In steady\nshear flow the structure factor develops two distinct but rather\nbroad peaks at kx ' ∓0.012π, ky ' ±0.22π. Thus the inhomogenous morphology of the lamellar structure is clearly encoded in the structure factor. The wavevector at the peak has\na small component in the x-direction, indicating the average\ntilt of the lamellae away from the flow direction towards the\nelongational axis of the flow (which in shear is at π/4 to the\nflow direction).\nWhen the shear flow is switched off, the system relaxes\nagain to its equilibrium layer spacing and the small tilt of the\nC(kk ) signal decreases to an undetectable level: this is consistent with the fact that, in Figs. 1 and 2 (bottom panels) it is\neasy to see when the system has been sheared horizontally,\nbut not in which sense. The intensity of the peak is slightly\nenhanced in the final state due to the improved orientation of\nthe layers along the flow direction.\nFig. 6 shows the time evolution of the defects density ρD\nof system A-2D in the sequence of stepwise decreasing shear\nrates alluded to previously (starting at γ̇ = 2 × 10−4 and ranging down to γ̇ = 2.5 × 10−5 , Table 1). The runs with the\ntwo highest shear rates were started from the amorphous,\npost-equilibration configuration, whereas all others were presheared using the final configuration of the preceding run as\nthe initial state. The total strain between the beginning and\nend of every individual run was at least 3 × 103 %. Interestingly, following each step down in shear rate, both systems\nA-2D and B-2D continuously anneal to lower defect densities on a timescale ' 106 LBU. If the shear rate is turned up\nagain (not shown), the lamellae buckle and new defects recur on a timescale corresponding to a stain of about 100%.\nThis finding offers further support for a dynamical equilibrium between defect creation and annihilation above a critical\n(or crossover) shear rate, below which defects progressively\nannihiliate and near-perfect alignment eventually results. To\n\n\ftest this assumption we performed simulations starting from a\nvery well aligned state and increased the shear rate. The defect\ndensity indeed goes up (not shown) and reaches similar values\nto before. Note however that the defect annealing time (of order 106 LBU) is quite long compared to any inherent relaxation\ntime; also, the final state after switchoff strongly depends on\nthe previous flow. Thus the rheology and microstructure of\nthese materials is inherently history dependent.\n\n-1\n\nρD\n\n10\n\n10-2\n10-1\n\nγ* = 2*10-4\nγ** = 1*10-4\nγ = 5*10-5\n*\n-5\nγ = 2.5*10\n\n10-2\n\n10-3\n\n10-3\n\n0*100\n\n5.0*105\n\n2*106\n\n1.0*106\n\n1.5*106\n\n4*106\n\n6*106\n\n8*106\n\n1*107\n\nTime\nFig. 6 Defect density ρD vs time: The main picture shows data for\nsystem A-2D in a sequence of simulations with consecutively\nlowered shear rate γ̇ = 2 × 10−4 (red solid), 1 × 10−4 (green\nlong-dashed), 5 × 10−5 (blue short-dashed), 2.5 × 10−5 (magenta\ndotted) and 1.25 × 10−5 (cyan dashed-dotted). Horizontal lines\nindicate time averages after entering the apparent steady state\n(where present). The inset gives data for the system A-3D and shear\nrates γ̇ = 2 × 10−4 , 1 × 10−4 and 5 × 10−5 (left to right).\n\nFig. 5 Structure factor C(kk ) of system A-2D: Shown are states after\nequilibration at t = 3.2 × 105 (top); in steady shear at γ̇ = 1 × 10−4\nand t = 5 × 105 (centre) and after switch-off at t = 1.28 × 106\n(bottom). The sections shown correspond to wave vectors on the\ninterval kx , ky ∈ [−π/2, π/2] LBU with kx and ky along the\nhorizontal and vertical coordinate direction, respectively.\n\nThe top picture in Fig. 7 shows the spatially averaged total\nshear stress hσxy (r)i ≡ σxy . At low shear rates, stress fluctuations have longer temporal correlations but smaller amplitudes. (The latter dependence is obscured by the logarithmic\nvertical scale in this plot.) The root-mean-square temporal\nfluctuations can be reduced by increasing system size (by a\nfactor 3 or so for the runs shown in Fig. 1 and Fig. 2). In\ncontrast, the averaged shear stress is almost independent of\nthe system size, which makes it possible to simulate longer\ntimes using smaller system sizes while still giving accurate\npredictions for the bulk rheological behaviour. We pursue this\nstrategy here.\nSystem A-2D shows clear shear thinning behaviour; values of its apparent viscosity at various shear rates are given\nin the caption of Fig. 7. The corresponding range of Ca is\n0.028-0.448. Using Eq.5, we can identify the stress contribution arising from the deviatoric part of the order parameter\npressure tensor h−Pxy (r)i ≡ −Pxy ; this is shown in the centre\ngraph in Fig. 7. The temporal fluctuations are in phase with\n1–18 | 11\n\n\f10-4\n\nσxy\n\nγ** = 2*10-4\nγ* = 1*10-4\nγ = 5*10-5\n*\nγ\n=\n2.5*10-5\nγ* = 1.25*10-5\n\n10\n\n-5\n\n10\n\n-6\n\n0*100\n\n2*106\n\n4*106\n\n6*106\n\n8*106\n\n1*107\n\nTime\n\n-5\n\n-Pxy\n\n10\n\nthose of the total stress and decrease with decreasing shear\nrate. The bottom image in Fig. 7 plots −Pxy against the defect density ρD ; this shows a linear relation across almost the\nwhole range of shear rates.\nIn contrast, system B-2D does not exhibit clear\nshear thinning; the apparent viscosities obey ηapp /η =\n1.57, 1.62, 1.55, 1.42, 1.87 for the same set of shear rates as\nused in Fig. 7. To within the measured accuracy, system B-2D\nis thus rheologically quasi-Newtonian. However, the range of\nCa in this case is lower, 0.01-0.164, and the order parameter\nstress creates only a relatively modest uplift to the baseline\nviscosity. More significantly, Ca ≤ Cac for all but the highest\napplied shear rate so that the steady states found in system\nB-2D are far more ordered than in A-2D. This results from a\ndefect annihilation process, occurring in the early stages of\nramp-down, which we found to be accompanied by a sharp\ndrop in Pxy (not shown).\n\n1*10-4\n\n10-6\n10\n\n-5\n\n10-6\n\n-7\n\n10-7\n10\n\n-8\n\n10-9\n\n10\n\n-8\n\n0*10\n\n0\n\n5.0*105\n\n1.0*106\n\n6\n\n2*10\n\n1.5*106\n\n6\n\nγ* = 2*10-4\nγ* = 1*10-4\nγ* = 5*10-5\nγ* = 2.5*10-5\n*\nγ = 1.25*10-5\n\n6*106\n\n4*10\n\n8*106\n\nN1\n\n10\n\n1*107\n\n1*10-5\n\n-Pxy\n\n10-5\n\nγ** = 2*10-4\nγ* = 1*10-4\n-5\nγ = 5*10\nγ* = 2.5*10-5\nγ* = 1.25*10-5\n\nTime\n\n0\n\n0*10\n\n10-6\n\n2*10\n\n6\n\n5.0*105\n\n6\n\n1.0*106\n\n6\n\n4*10\n\n6*10\n\n1.5*106\n\n8*10\n\n6\n\n1*107\n\nTime\n\n10-5\n\n-Pxy -a=b=5*10\n-7\n\nFig. 8 Spatially averaged first normal stress differences\nN1 = σxx − σyy vs time for system A-2D. The inset shows data for\nsystem A-3D and shear rates γ̇ = 2 × 10−4 , 1 × 10−4 and 5 × 10−5\n(left to right). Horizontal solid lines are time averages.\n\n-4\n\n-5\n\n8.4*10 + 9.5*10 x\n\n100\n\n0.02\n\n0.04\n\n0.06\n\n0.08\n\n0.1\n\n0.12\n\nρD\nFig. 7 Top: average total shear stress σxy versus time for system\nA-2D: The horizontal lines are steady state time averages. For shear\nrate γ̇ = 1.25 × 10−5 , 2.5 × 10−5 , 5 × 10−5 , 1 × 10−4 , 2 × 10−4 , we\nfind ηapp /η ≡ σxy /ηγ̇ = 2.49, 2.25, 2.18, 1.93, 1.74; centre: average\norder parameter contribution to the stress tensor −Pxy vs time for\nsystem A-2D. The inset shows data for system A-3D and shear rates\nγ̇ = 2 × 10−4 , 1 × 10−4 and 5 × 10−5 (left to right); bottom: average\nchemical contribution to the pressure tensor −Pxy vs. defect density\nfor system A-2D.\n\n12 |\n\n1–18\n\nFig. 8 shows averaged first normal stress differences\nhN1 (r)i ≡ N1 versus time for system A-2D, where we report\nthe same stepwise decreasing flow protocol as before. For the\nfirst several steps N1 decreases monotonously with decreasing\nshear rate. However, at the lowest shear rates the behaviour is\nnot monotic: N1 eventually rises again. (The resulting time averages, shown as horizontal lines, do not therefore reflect true\nsteady states.) This somewhat surprising feature has a simple\nexplanation. The time sequence of the defect density in Fig. 6\nreveals that the rise in N1 is correlated with a drop in ρD , and\nlinked to the onset of defect annihilation (which happens only\nat low shear rates). When two defects meet and cancel, the\nlocal lamellar width alters by a certain amount. This causes\nfrustration as the system is unable to snap back locally towards\n\n\fits equilibrium layer spacing. Hence the normal stress difference N1 = σxx − σyy fails to decay to zero, and remains positive at large times, as appropriate for a system of metastable\nand (on average) compressed smectic layers. The time dependence of the normal stress difference is also anomalously slow,\nwhereas the shear stress reaches their steady state values more\nquickly. The relatively large steady state value of N1 and this\nslow dynamics may partly be a finite size effect caused by the\nrelatively modest number of smectic layers within the simulated volume. The normal stress in system B-2D (not shown)\nbehaves differently: in this case N1 falls monotonically during\nthe defect annihilation phase. It is not clear whether this difference should be attributed to the change in β,Ca or Pe between\nthe two systems, or indeed a combination of those changes.\n\nσxy; N1\n\n10-4\n\n10-5\n\n∝ γ* 0.87\n\n10-6 -5\n10\n\nσxy; -a=b=5*10-4\nσxy; -a=b=5*10-5\nN1; -a=b=5*10-4\nN1; -a=b=5*10-5\n\n∝ γ*\n\n*\n\nγ\n\n10-4\n\nFig. 9 Flow curves: Time-averaged shear stress hσxy i and first\nnormal stress differences hN1 i vs shear rate γ̇ for system A-2D and\nB-2D. The dash-dotted lines are power-law fits to the data.\n\nFig. 9 shows 'flow curves' representing the shear rate dependence of time averaged stresses σxy and N1 . This is calculated from the stepwise ramp data as detailed previously,\nso the N1 results at low shear rates should not be taken as\ndefinitive. System A-2D shows shear thinning as already discussed, apparently following a power law σxy = γ̇m with exponent m ' 0.87. A recent experimental and theoretical work\nstudies the nonlinear relation between shear stress and shear\nrate in lyotropic lamellar phases 39 ; interestingly the authors\nidentify the motion of screw defects as being responsible for\nthe layer tilting, folding and formation of defects. They report an experimental value of m ' 1/1.44 ' 0.694, which is in\ngood agreement with their theoretical prediction of m = 2/3.\nOur value of m = 0.87 for the disordered flow regime is larger.\nOne possible explanation for this discrepancy is that screw defects, which do not exist in our 2D simulations, play a key role\nfor this theory. On the other hand our fitted power law must\nbe treated with great caution since the fit includes data from\n\nγ̇ both above and below γ̇c . It is somewhat surprising that the\nmorphological changes around 1.25 × 10−5 < γ̇c < 2.5 × 10−5\nin system A give no visible anomaly or feature in the flow\ncurves. For system B-2D the data is consistent with an exponent m = 1, indicating more or less constant viscosity and\nno pronounced shear thinning (as previously described). This\nappears to be due to the decreasing number of defects at shear\nrates below γ̇ ≤ 2 × 10−4 ; the order parameter stress Pxy is then\ndominated by the background viscosity term ηγ̇.\nIn neither system does σxy (γ̇) offer any clear signature of a\nyield stress. There may be two ways to understand this. Either, as detailed previously, this is because at the lowest shear\nrates studied here the selected state is a fully aligned one with\nthe layering wavevector perpendicular to the flow: such a state\nshould have a purely viscous response. However, a defect texture may also lead to a viscous response in the linear regime\nif flow occurs via permeation 1 (i.e. by fluid flow not altering\nappreciably the order parameter pattern).\nTo further characterise the small shear rate regimes in our\nsimulations, we have performed additional simulations on\nfully aligned states, with different layer spacings. While the\nshear stress contribution in this case is negligible as γ̇ → 0,\nN1 does not vanish for vanishing shear rate, but depends sensitively on the nonequilibrium layer spacing in the range of\nshear rates addressed here. This can be described as a \"quasiNewtonian\" behaviour. As expected, N1 is positive for overcompressed layers, and negative for overdilated layers. The\nvalues of N1 obtained in system B-2D (see Fig. 9) are comparable to those observed in a quiescent lamellar smectic system\nprepared by compressing the layers by about 5-10%.\n4.2\n\nThree Dimensions\n\nThe computational cost of repeating all the above studies in\nthree dimensional systems of equivalent size remains prohibitive, particularly when addressing steady state properties\nwhich emerge only after a million or more LB timesteps. We\ntherefore focus in 3D on smaller systems (Table 1), but still\nlarge enough in principle to show qualitatively similar structure under flow. Our studies use two sets of parameters. System A-3D is identical to A-2D except for the introduction of\nthe third dimension. System C-3D has parameters intermediate between A-2D and B-2D (Table 1) and was chosen in\npreference to the latter because B-2D ordered completely if\nthe system size was matched to a slice of B-3D. (We see below however that in fact this is a rather general outcome in\n3D.)\nFig. 10 shows the post-equilibration amorphous structure\nand the steady-state structure under flow in system C-3D (A3D is similar) at system size Nx × Ny × Nz = 256 × 128 × 128.\nThe latter is compared with C-2D and A-2D in a system of\nthe same x and y dimensions (256 × 128 × 1). The quiescent\n1–18 | 13\n\n\fFig. 10 Order parameter φ(r) in two and three dimensions: Top pictures show system C-3D after equilibration (left) and in shear flow (right,\nγ̇ = 2 × 10−4 ) at t = 6.4 × 105 LBU. The opacity of one phase has been reduced to enable a better view into the lamellar structure. The bottom\nleft picture shows system C-2D at the same time step and shear rate. The bottom right picture is system A-2D at γ̇ = 1 × 10−4 and time step\nt = 9.6 × 105 LBU. Results for A-3D are morphologically indistinguishable from those for C-3D. In all these images the flow direction is\nhorizontal, to the right in the upper half of the sample and to the left in the lower half.\n\n14 |\n\n1–18\n\n\fFig. 11 Structure factor C(k) of quiescent system A-3D, showing a\ncut along kx = 0 after equilibration at t = 3.2 × 105 . Shown are\nwave vectors on the interval ky , kz ∈ [−π/2, π/2] with ky and kz\nbeing the horizontal and vertical direction, respectively. Data for\nC-3D (not shown) is virtually the same.\n\nmetastable state of system C-3D after equilibration is more or\nless the same as it would be in two dimensions. Indeed, a slice\nthrough the structure factor along kx = 0 (cuts along ky , kz = 0\nlook identical) is shown in Fig. 11 and resembles that in Fig. 5.\nHowever, under shear at γ̇ = 2 × 10−4 (Pe = 400, Ca = 0.252)\nthis structure anneals readily into a regular lamellar structure\nafter a transient period of about 6 × 105 LB timesteps. This\noccurs for even the highest shear rates applied, indicating that\nthere is a very strong tendency in three dimensions to form\nordered lamellar arrays. The same behaviour was seen in system A-3D for which the highest flow rate used corresponds\nto Pe = 80 and Ca = 0.448. (In contrast, the 2D results at the\nsame flow rates and system sizes feature the typical fluctuating\npattern of breaking and merging lamellae that was described\npreviously and is visible in the lower panels of Fig. 10.) The\nstructure factor seen in 3D (see Fig. 12) is accordingly close\nto that of a perfectly ordered lamellar state, in contrast to the\ncorresponding results in 2D (Fig. 5). These findings suggest\nthat any characteristic strain rate γ̇c at which defects proliferate must be markedly higher in 3D than in 2D. Specifically,\nif Ca is the relevant control parameter, our results for A-3D\nimply that Cac > 0.448 in three dimensions.\nNote however that the order we observe is not completely\nperfect as a mismatch of the layers occurs leading to branching\npoints and edges (e.g. at the centre of the ordered 3D-system\nin Fig. 10). The Burgers vector is oriented along the gradient direction with edges along the flow direction. This forms\na structure that is translationally invariant along the flow di-\n\nFig. 12 Structure factor C(k) of system A-3D in shear flow\n(γ̇ = 1 × 10−4 ) at t=960k. Results are shown in the planes at kx = 0\n(top panel), kz = 0 (middle panel), and ky = 3π/16 (middle panel).\nThe horizontal and vertical directions are respectively along kz and\nky (top panel), kx and ky (middle panel), kx and kz (bottom panel).\nThe wave-vectors in the horizontal and vertical directions are in\n[−π/2, π/2] for all panels. The structure factor is akin to that\nexpected of a regular lamellar phase.\n1–18 | 15\n\n\frection and in the final steady state the location of the edge\ndefects does not change. Notably, the corresponding orientation of edge dislocations does not exist in two dimensions.\nA closer look at the kinetic evolution of the order parameter reveals that the additional dimension appears to play a key\nrole in promoting the formation of the homogeneously layered\nstructure. The ordering process takes place in two consecutive\nsteps. Firstly, the equilibrated state undergoes a transition to a\nsemi-ordered state, which consists of small patches of layered\nregions, with the layer normals along gradient direction. The\nlength of the lamellae is initially quite short, but gets longer\nalong the flow direction as the simulation proceeds and the\nstructure is advected. It remains, however, relatively short\nalong the vorticity direction, with the individual layers being\ndisconnected. In a second step the layers merge by linking up\nalong the vorticity direction. This is possible as the layers can\nbe locally translated along the flow gradient direction, so that\nthe average order parameter within a plane can change and is\nnot conserved as in the two-dimensional case.\nWe next quantify the time system A-3D takes to anneal into\nits final ordered structure starting from an isotropic initial configuration. (These and subsequent measurements are reported\nfor A-3D only; C-3D is qualitatively similar.) The inset of\nFig. 6 gives the defect density as defined by Eq. 10 versus\ntime for shear rates γ̇ = 5 × 10−5 − 2 × 10−4 . Within a few\nhundred thousand LB timesteps the defect density decreases\nby two orders of magnitude, resembling the behaviour seen\nin system A-2D at shear rates one decade smaller. The total\nstrain where the curves level off, and ordering is achieved is\nabout γ = 160 (at γ̇ = 2 × 10−4 ), γ = 120 (at γ̇ = 1 × 10−4 ) and\nγ = 65 (at γ̇ = 5 × 10−5 ).\nThe reduced number of defects is reflected in the magnitude of the order parameter stress contribution Pxy ; the 3D behaviour is shown in the inset of Fig. 8. The final contribution\nto the total stress is created by a small number of remaining\ndefects (hence the inconsistent trend of the tiny plateau value\nwith strain rate, which is not a concern here) and is quite negligible compared to the background viscosity contribution ηγ̇.\nThe drop in Pxy by three orders of magnitude during the defect\nannihilation process can formally be viewed as shear thinning\nof a quite extreme degree – albeit one masked, in any macroscopic measurement of σxy , by the Newtonian background.\nFirst normal stress differences N1 = hσxx − σyy i for system\nA-3D are shown in the inset of Fig. 8. For all shear rates addressed here system A-3D attains similar values of the normal stress; these are approached monotonically and about one\ndecade smaller than those seen in system A-2D. The mechanism reported previously for the buildup of normal stress on\napproaching the ordered state in 2D systems seemingly does\nnot apply in 3D, perhaps because of the much more efficient\npathways to relaxation and mutual annihilation of defects.\n16 |\n\n1–18\n\n5\n\nConclusions\n\nMany earlier studies have proposed a picture in which a\nlayer undulation instability in three-dimensional smectic liquid crystals emerges above a critical shear rate 12,13,24,53,54 .\nMolecular dynamics simulations on lyotropic smectics place\nthis in a regime of flow rates well above those we have applied in the present study 14,15 . The critical shear rate for\nthermotropic smectics that has been given in a theoretical approach 16 is slightly above ours. The status of this instability\nand its effects on rheology in experiments remains somewhat\nunclear. Also unclear is its status in two dimensions.\nIn the present work we have studied the nonlinear rheology\nof lamellar systems in two and three dimensions by means\nof large-scale simulations of a well-established model. After quenching from a homogeneous phase a metastable amorphous lamellar structure appears, similar to previous simulations in two dimensions using comparable models and parameters 23–28 . Also in accord with some previous studies, under\nflow in two dimensions we found the morphology of the order\nparameter to show two distinct regimes: one with very few defects which arises at low shear rates, and a defect rich phase\nat higher ones. We found that the critical (or crossover) strain\nrate γ̇c separating these phases depends somewhat on system\nsize, but much more strongly on thermodynamic and kinetic\nparameters. We have argued that this dependence might be\nsummarized in terms of a capillary number Ca (Eq. 12) that\nis the ratio of viscous stress to the gradient free energy density of the lamellar phase. This controls a steady-state elastic\nstrain in the smectic which, when it exceeds some characteristic value Cac , might cause yielding of layers and defect proliferation; our estimate is 0.056 < Cac < 0.112 (system A) and\n0.082 < Cac < 0.164 (system B). However we emphasize that\nthe evidence for Ca as a control parameter is currently very\nlimited and it would take a painstaking exploration of parameter space to confirm this picture.\nA notable feature of the disordered flow phase is our observation of striated heterogeneity in the state of smectic order,\nwith strongly dilated and compressed regions oriented along\nthe extensional axis of the flow. These are present in steady\nstate but are nonstationary. The extended regions with lamellar spacing larger than at equilibrium exhibit either negative\nor small positive shear stress and first normal stress difference, whereas positive peak values were found in the compressed domains. (A similar dependence of the layer alignment in flow direction depending on the system size has been\nrecently reported in 52 .) Smaller systems with 16 layers across\nthe gradient direction, which is comparable with our systems\nconsisting of Nx × Ny × Nz = 256 × 128 × 1 sites, showed a\nlarger tendency to align in flow direction. For larger systems\nthere was a clear trend to align at an angle with the flow direction. These distortions of the order parameter contribute a\n\n\fterm in Pxy to the shear stress whose magnitude could be directly related to the density of defects. In one system we found\nshear thinning described by a power law dependence of stress\non strain rate, σxy = γm with m = 0.87; however the simplicity\nof this result may be fortuitous since the range of strain rates\nstudied spans γ̇c . In another system, at strain rates primarily\nbelow γ̇c , the shear rheology was quasi-Newtonian (m = 1) although a significant first normal stress difference N1 was also\npresent.\nWe then simulated the flow behaviour of directly comparable systems in three dimensions, and found striking differences between the two- and three-dimensional response under\nconditions of matched γ̇. The 3D-system showed none of the\ndistictive dilation/compression bands seen in 2D; moreover\nthe microstructure, initially amorphous after quenching from\nthe homogeneous phase, rapidly ordered under shear into a\nlamellar array with a low density of edge defects, all of which\nwere oriented along the flow directions. This contrasts with\nthe 2D case where numerous edge dislocations are present in\nthe disordered phase (γ̇ > γ̇c ) but, by virtue of the 2D geometry, all are oriented along the vorticity direction. (In saying\nthis, we imagine a 3D continuation of the 2D structure which\nis translationally invariant along that direction.) Our 3D results do not rule out a transition or crossover from ordered to\ndisordered structures, but this is not seen within the range of\nflow rates addressed here. This means that, if such a transition is controlled by capillary number, its value at onset in 3D\nobeys Cac > 0.448, a value notably higher than that observed\nin 2D. Since identical parameter sets were chosen, the same\napplies to any other dimensionless number that might control\nthe onset of the defect-rich phase. Finally, we note that one\nrecent theory of smectic rheology 39 suggests this is controlled\nby screw dislocations which have no 2D analogue. Moreover,\nthe residual dislocations seen in the 3D ordered phase have an\norientation that also does not exist in 2D. It should be remembered that, in 3D, edge dislocations and screw dislocations are\ninterconvertible: they have the same topological status and the\nnomenclature merely describes whether the defect line is oriented normal or parallel to the smectic layers 55 . The ability\nof 3D defect lines to reorient as well as translate underscores\ntheir greater dynamical freedom compared to similar defects\nin a 2D geometry. It is thus tempting to attribute the marked\ndifference in dynamics between 2D and 3D systems to the reduced constraints on defect motion that arise in 3D, allowing\nthem to find and annihilate each other more easily.\n\n6\n\nAcknowledgements\n\nWe acknowledge support by EPSRC Grants No. EP/E045316\nand No. EP/E030173, the MAPPER EU-FP7 project (grant\nno. RI-261507) and computing time at the Argonne Leadership Computing Facility, Argonne, U.S.A. as well as on\n\nHECToR, U.K. We thank A. Morozov for useful discussions.\nM.E.C. holds a Royal Society Research Professorship.\n\n7\n\nAppendix: Sliding Periodic Boundary Conditions\n\nThe simulations of shear flow are undertaken using a mixed finite difference / lattice Boltzmann approach, where the former\nis used to advance the order parameter in time via the CahnHilliard equation, and the latter is used to solve the NavierStokes equations. Coupling between the two is via the velocity field, which advects the order parameter, and the thermodynamic pressure tensor (6), the divergence of which contributes\na body force on the fluid. The sliding periodic boundary conditions of Lees and Edwards 46 may be applied to the lattice\nBoltzmann part of the calculation 45,47 to generate shear in the\nsystem. We describe here how the sliding periodic boundaries\nare extended to include the finite difference part of the calculation.\nWe consider a finite difference mesh where the order parameter values are co-located with the density and velocity\nfields provided by lattice Boltzmann. Away from the sliding\nperiodic boundaries, the finite difference discretisation is as\none would expect. In order to ensure conservation of order\nparameter, as expressed by\n∂t φ + ∂α (uα φ − M∂α μ) = 0,\n\n(13)\n\nwe consider each lattice point to be surrounded by a cubic\ncontrol volume or cell of dimensions ∆x = 1 in two or three\ndimensions. We compute convective and diffusive fluxes at\nthe cell boundaries using linear interpolation of the normal\nvelocity component to the cell face. For the advective fluxes,\nthe interfacial values of the order parameter are computed via\ncubic interpolation weighted in the upwind direction. This is\ncombined with an Euler forward step for the time integration:\na small Courant number (u∆t/∆x), and hence numerically stability, is guaranteed by the small Mach number constraint standard in lattice Boltzmann. The gradient of the chemical potential is computed at each cell face using values of μ computed\nat the lattice point either side.\nA body force on the fluid in the Navier-Stokes equations\nmay be included in the lattice Boltzmann approach. Again, to\nensure conservation of momentum, the divergence of the thermodynamic pressure tensor is computed based on cell-face\nvalues. In practice, this requires a finite difference stencil that\nentends at least ±3 lattice points in each coordinate direction\n(the thermodynamic pressure involves a fourth derivative of\nthe order parameter).\nThe sliding periodic boundaries lie (conceptually) along\nplane co-incident with the cell faces. Where the finite difference stencil overlaps a such a plane, the relative movement\n1–18 | 17\n\n\fbetween the two sides of the plane must be accounted for when\ncomputing derivatives of the order parameter, and hence fluxes\nof order parameter and momentum, near the planes. This\nmeans interpolating values of the order parameter on each side\nof the plane to positions corresponding to the lattice locations\non the other side so that the finite difference stencil can be\nused normally. For this study, where there are high derivatives of the order parameter in the free energy, it is important\nthat this interpolation is at least cubic. Linear interpolation of\nthe order parameter leads to unphysical oscillations of physical quantities such as the shear stress related to the magnitude\nof the velocity jump across the sliding boundary. With cubic\ninterpolation, such artefacts are absent. The non-linear nature\nof this interpolation means that fluxes of both order parameter\nand momentum computed at the plane do not exactly match\non each side. However, this may be corrected at each sliding\nboundary at each time step, restoring global order parameter\nand momentum conservation.\n\nReferences\n1 P. G. de Gennes and J. Prost, The Physics of Liquid Crystals (2nd Edition),\nClarendon Press, Oxford, 1993.\n2 R. G. Larson, The Structure and Rheology of Complex Fluids, OUP, Oxford, 1999.\n3 P. D. Olmsted, Rheol. Acta, 2008, 47, 283–300.\n4 O. Diat and D. Roux, J. Phys. II (France), 1993, 3, 9.\n5 P. Panizza, D. Roux, V. Vuillaume, C. Y. D. Lu and M. E. Cates, Langmuir, 1996, 12, 248–252.\n6 Y. Iwashita and H. Tanaka, Phys. Rev. Lett., 2007, 98, 145703.\n7 M. Gradzielski, J. Phys. Condens. Matter, 2003, 15, R655–R697.\n8 R. Gomati, J. Appell, P. Bassereau, J. Marignan and G. Porte, J. Phys.\nChem., 1987, 91, 6203.\n9 P. Boltenhagen, O. D. Lavrentovich and M. Kleman, Phys. Rev. A, 1992,\n46, R1743.\n10 J. B. Fournier and G. Durand, J. Phys. II (France), 1994, 4, 975.\n11 L. Ramos, D. Roux, P. D. Olmsted and M. E. Cates, Europhys. Lett., 2004,\n66, 888.\n12 A. Zilman and R. Granek, Eur. Phys. J. B, 1999, 11, 593–608.\n13 L. Courbin, J. P. Delville, J. Rouch and P. Panizza, Phys. Rev. Lett., 2002,\n89, 148305.\n14 H. Guo, K. Kremer and T. Soddemann, Phys. Rev. E, 2002, 66, 061503.\n15 T. Soddemann, G. K. Auernhammer, H. Guo, B. Dünweg and K. Kremer,\nEur. Phys. J. E, 2004, 12, 141–151.\n16 I. W. Stewart and F. Stewart, J. Phys. Condens. Mat., 2009, 21, 465101.\n17 J. Zipfel, J. Berghause, P. Lindner and W. Richtering, J. Phys. Chem. B,\n1999, 103, 2841–2849.\n18 A. Leon, D. Bonn, J. Meunier, A. Al-Kahlwaji, O. Greffer and H. Kellay,\nPhys. Rev. Lett., 2000, 84, 1355–1338.\n19 M. E. Cates and S. T. Milner, Phys. Rev. Lett., 1989, 62, 1856–1859.\n20 F. S. B. K. A. Koppi, M. Tirrell, Phys. Rev. Lett., 1993, 70, 1449–1452.\n21 G. H. Fredrickson, J. Rheol., 1994, 38, 1045.\n22 M. R. Swift, E. Orlandini, W. R. Osborn and J. M. Yeomans, Phys. Rev.\nE, 1996, 54, 5041–5052.\n23 G. Gonnella, E. Orlandini and J. M. Yeomans, Phys. Rev. Lett., 1997, 78,\n1695–1698.\n24 G. Gonnella, E. Orlandini and J. M. Yeomans, Phys. Rev. E, 1998, 58,\n480–485.\n\n18 |\n\n1–18\n\n25 A. Xu, G. Gonnella and A. Lamura, Phys. Rev. E, 2003, 67, 056105.\n26 A. Xu, G. Gonnella, A. Lamura, G. Amati and F. Massaioli, Europhys.\nLett., 2005, 71, 651–657.\n27 A. Xu, G. Gonnella and A. Lamura, Physica A, 2006, 362, 42–47.\n28 A. Xu and G. Gonnella, Phys. Rev. E, 2006, 74, 011505.\n29 R. S. Saksena and P. V. Coveney, Soft Matter, 2009, 5, 4446–4463.\n30 R. S. Saksena and P. V. Coveney, Proc. R. Soc. London, Ser. A, 2009, 465,\n1977–2002.\n31 G. Gompper and M. Schick, Phase Transitions and Critical Phenomena, C. Domb and J.L. Lebowitz Eds., Academic Press, New York, 1994,\nvol. 16.\n32 M. Cencini, D. Diacono and G. Gonnella, Europhys. Lett., 2007, 79,\n26004.\n33 S. Succi, The Lattice Boltzman Equation, Oxford University Press, Oxford, 2001.\n34 D. Marenduzzo, E. Orlandini, M. E. Cates and J. M. Yeomans, Phys. Rev.\nE, 2007, 76, 031921.\n35 O. Henrich, D. Marenduzzo, K. Stratford and M. E. Cates, Phys. Rev. E,\n2010, 81, 031706.\n36 O. Henrich, K. Stratford, D. Marenduzzo and M. E. Cates, Proc. Natl.\nAcad. Sci. USA, 2010, 107, 13212–13215.\n37 O. Henrich, K. Stratford, D. Marenduzzo and M. E. Cates, Phys. Rev.\nLett., 2011, 106, 107801.\n38 K. Stratford, J. C. Desplat, P. Stansell and M. E. Cates, Phys. Rev. E, 2007,\n76, 030501.\n39 C.-Y.-D. Lu, P. Chen, Y. Ishii, S. Komura and T. Kato, Eur. Phys. J. E,\n2008, 25, 91–101.\n40 S. A. Brazovskii, Sov. Phys. JETP, 1975, 68, 175–185.\n41 V. M. Kendon, M. E. Cates, I. Pagonabarraga, J. C. Desplat and P. Bladon,\nJ. Fluid Mech., 2001, 440, 147–203.\n42 A. Yang, P. Fleming and J. Gibbs, J. Chem. Phys., 1976, 64, 3732.\n43 R. Evans, Adv. Phys., 1979, 28, 143–200.\n44 D. d'Humieres, I. Ginzburg, M. Krafczyk, P. Lallemand and L. Luo, Philos. T. Roy. Soc. A, 2002, 360, 1792.\n45 R. Adhikari, K. Stratford, M. E. Cates and A. J. Wagner, Europhys. Lett.,\n2005, 71, 473–479.\n46 A. W. Lees and S. F. Edwards, J. Phys. C: Solid State Phys., 1972, 5,\n1921–1929.\n47 A. J. Wagner and I. Pagonabarraga, J. Stat. Phys., 2002, 107, 521–537.\n48 Fastest Fourier Transform in the West, http://www.fftw.org/.\n49 M. E. Cates, K. Stratford, R. Adhikari, P. Stansell, J. C. Desplat, I. Pagonabarraga and A. J. Wagner, J. Phys. Condens. Matter, 2004, 16, S3903.\n50 M. E. Cates, O. Henrich, D. Marenduzzo and K. Stratford, Soft Matter,\n2009, 5, 3791–3800.\n51 S. A. Safran, Statistical Thermodynamics Of Surfaces, Interfaces, And\nMembranes, Addison-Wesley, Reading, 1994.\n52 V. Kumaran and D. S. S. Raman, Phys. Rev. E, 2011, 83, 031501.\n53 V. Kumaran, S. K. Jariwala and S. Hussain, Chem. Eng. Sci., 2001, 56,\n5663–5673.\n54 S. Ramaswamy, Phys. Rev. Lett., 1992, 69, 112–115.\n55 P. M. Chaikin and T. C. Lubensky, Principles of condensed matter\nphysics, Cambridge University Press, Cambridge, 1995.\n\n\f"}