{"id": "http://arxiv.org/abs/0805.4245v1", "guidislink": true, "updated": "2008-05-28T01:42:19Z", "updated_parsed": [2008, 5, 28, 1, 42, 19, 2, 149, 0], "published": "2008-05-28T01:42:19Z", "published_parsed": [2008, 5, 28, 1, 42, 19, 2, 149, 0], "title": "Isocurvature fluctuations in Affleck-Dine mechanism and constraints on\n  inflation models", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0805.0058%2C0805.3749%2C0805.2300%2C0805.0896%2C0805.2696%2C0805.1703%2C0805.2278%2C0805.2080%2C0805.1888%2C0805.3726%2C0805.4190%2C0805.4290%2C0805.3061%2C0805.1040%2C0805.4301%2C0805.4245%2C0805.2117%2C0805.3321%2C0805.4054%2C0805.0504%2C0805.4197%2C0805.4816%2C0805.1335%2C0805.3637%2C0805.4570%2C0805.4404%2C0805.1013%2C0805.1979%2C0805.4255%2C0805.1223%2C0805.4656%2C0805.1933%2C0805.0894%2C0805.2469%2C0805.0455%2C0805.1243%2C0805.1531%2C0805.0235%2C0805.1924%2C0805.3835%2C0805.1387%2C0805.0983%2C0805.2385%2C0805.2328%2C0805.3248%2C0805.2746%2C0805.3641%2C0805.2578%2C0805.2266%2C0805.2552%2C0805.0186%2C0805.2987%2C0805.0434%2C0805.2098%2C0805.0249%2C0805.4727%2C0805.0821%2C0805.0042%2C0805.4765%2C0805.4689%2C0805.3143%2C0805.3914%2C0805.2715%2C0805.2622%2C0805.3408%2C0805.2194%2C0805.3893%2C0805.3966%2C0805.0647%2C0805.1112%2C0805.2611%2C0805.2161%2C0805.2496%2C0805.2433%2C0805.2043%2C0805.3804%2C0805.4616%2C0805.3485%2C0805.1896%2C0805.0686%2C0805.3368%2C0805.0984%2C0805.1782%2C0805.1984%2C0805.2921%2C0805.4617%2C0805.1935%2C0805.3304%2C0805.0911%2C0805.3517%2C0805.1384%2C0805.1238%2C0805.0107%2C0805.4771%2C0805.2873%2C0805.3602%2C0805.2513%2C0805.2843%2C0805.2271%2C0805.0399%2C0805.3516&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Isocurvature fluctuations in Affleck-Dine mechanism and constraints on\n  inflation models"}, "summary": "We reconsider the Affleck-Dine mechanism for baryogenesis and show that the\nbaryonic isocurvature fluctuations are generated in many inflation models in\nsupergravity. The inflationary scale and the reheating temperature must satisfy\ncertain constraints to avoid too large baryonic isocurvature fluctuations.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0805.0058%2C0805.3749%2C0805.2300%2C0805.0896%2C0805.2696%2C0805.1703%2C0805.2278%2C0805.2080%2C0805.1888%2C0805.3726%2C0805.4190%2C0805.4290%2C0805.3061%2C0805.1040%2C0805.4301%2C0805.4245%2C0805.2117%2C0805.3321%2C0805.4054%2C0805.0504%2C0805.4197%2C0805.4816%2C0805.1335%2C0805.3637%2C0805.4570%2C0805.4404%2C0805.1013%2C0805.1979%2C0805.4255%2C0805.1223%2C0805.4656%2C0805.1933%2C0805.0894%2C0805.2469%2C0805.0455%2C0805.1243%2C0805.1531%2C0805.0235%2C0805.1924%2C0805.3835%2C0805.1387%2C0805.0983%2C0805.2385%2C0805.2328%2C0805.3248%2C0805.2746%2C0805.3641%2C0805.2578%2C0805.2266%2C0805.2552%2C0805.0186%2C0805.2987%2C0805.0434%2C0805.2098%2C0805.0249%2C0805.4727%2C0805.0821%2C0805.0042%2C0805.4765%2C0805.4689%2C0805.3143%2C0805.3914%2C0805.2715%2C0805.2622%2C0805.3408%2C0805.2194%2C0805.3893%2C0805.3966%2C0805.0647%2C0805.1112%2C0805.2611%2C0805.2161%2C0805.2496%2C0805.2433%2C0805.2043%2C0805.3804%2C0805.4616%2C0805.3485%2C0805.1896%2C0805.0686%2C0805.3368%2C0805.0984%2C0805.1782%2C0805.1984%2C0805.2921%2C0805.4617%2C0805.1935%2C0805.3304%2C0805.0911%2C0805.3517%2C0805.1384%2C0805.1238%2C0805.0107%2C0805.4771%2C0805.2873%2C0805.3602%2C0805.2513%2C0805.2843%2C0805.2271%2C0805.0399%2C0805.3516&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We reconsider the Affleck-Dine mechanism for baryogenesis and show that the\nbaryonic isocurvature fluctuations are generated in many inflation models in\nsupergravity. The inflationary scale and the reheating temperature must satisfy\ncertain constraints to avoid too large baryonic isocurvature fluctuations."}, "authors": ["Shinta Kasuya", "Masahiro Kawasaki", "Fuminobu Takahashi"], "author_detail": {"name": "Fuminobu Takahashi"}, "author": "Fuminobu Takahashi", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1088/1475-7516/2008/10/017", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/0805.4245v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0805.4245v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "18 pages, 1 figure", "arxiv_primary_category": {"term": "hep-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "hep-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0805.4245v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0805.4245v1", "journal_reference": "JCAP 0810:017,2008", "doi": "10.1088/1475-7516/2008/10/017", "fulltext": "IPMU 08-0032\n\nIsocurvature fluctuations in Affleck-Dine mechanism and\nconstraints on inflation models\nShinta Kasuya a , Masahiro Kawasaki\n\narXiv:0805.4245v1 [hep-ph] 28 May 2008\n\na\n\nb,c\n\n, and Fuminobu Takahashi\n\nc\n\nDepartment of Information Science,\n\nKanagawa University, Kanagawa 259-1293, Japan\nb\n\nInstitute for Cosmic Ray Research,\n\nUniversity of Tokyo, Chiba 277-8582, Japan\nc\n\nInstitute for the Physics and Mathematics of the Universe,\nUniversity of Tokyo, Chiba 277-8582, Japan\n(Dated: May, 2008)\n\nAbstract\nWe reconsider the Affleck-Dine mechanism for baryogenesis and show that the baryonic isocurvature fluctuations are generated in many inflation models in supergravity. The inflationary scale and\nthe reheating temperature must satisfy certain constraints to avoid too large baryonic isocurvature\nfluctuations.\n\n1\n\n\fI.\n\nINTRODUCTION\n\nThe origin of the baryon asymmetry in our universe remains a big mystery in modern\ncosmology. The Affleck-Dine (AD) mechanism provides one of the promising baryogenesis scenarios [1]. It utilizes a flat direction of the supersymmetric standard model, which\npossesses a non-zero baryon (or lepton) number. A flat direction responsible for the AD\nmechanism is referred to as the AD field. The AD field is assumed to develop a large expectation value during inflation, and it starts to oscillate after inflation when the cosmic\nexpansion rate becomes comparable to its mass. The baryon number is effectively created\nat the onset of the oscillations. Finally, the AD field decays into the ordinary quarks, leaving\nthe universe with a right amount of the baryon asymmetry.\nThe scalar potential along the flat direction is crucial for the AD mechanism sketched\nabove to work. The flat direction has a vanishing potential at the level of the renormalizable\noperators in the limit of supersymmetry (SUSY). In other words, the flat directions can be\nlifted by the non-renormalizable operators and the SUSY breaking effects. During inflation,\nSUSY is largely broken by the inflaton potential [2]. In particular, the radial component\nof the AD field generically acquires a mass of the order of the Hubble parameter, referred\nto as the Hubble-induced mass, due to supergravity effects in the F -term inflation models.\nThe sign of the Hubble-induced mass is assumed to be negative for the AD field to develop\na large field value during inflation.\nThe flat directions can be lifted also by non-renormalizable operators in a superpotential.\nIn fact, the non-renormalizable operator not only lifts the potential at large scales, but\nalso provides a baryon-number violation needed to generate the baryon asymmetry. Our\nconcern here is the strength of the baryon-number violation during and after inflation. It\nis often claimed that, during inflation, there appears a baryon-number violating A-term\nwith a coefficient comparable to the Hubble parameter. Such a large A-term is referred\nto as the Hubble-induced A-term. If there were indeed the Hubble-induced A-term during\ninflation, the phase component of the AD field would acquire a mass of the order of the\nHubble parameter, and hence would quickly settle down in one of the minima given by the\nHubble-induced A-term. Thus, as long as the Hubble-induced A-term is not suppressed, the\nphase component of the AD field does not have any sizable fluctuations beyond the horizon\nscale during inflation.\n2\n\n\fIn this paper we reconsider the AD mechanism and show that the Hubble-induced A-term\nis suppressed in the most F -term inflation models. As a result, the phase direction of the AD\nfield is rather flat and therefore quantum fluctuations along that direction develop during\ninflation. Those fluctuations turn into the baryonic isocurvature fluctuations, which are\nnow tightly constrained by the observations of the cosmic microwave background (CMB).\nAssuming that the AD mechanism is responsible for generating the baryon asymmetry of\nthe universe, we will show that both the inflation scale and the reheating temperature must\nsatisfy a certain constraint.\nLastly, let us comment on the differences of the present paper from the works in the past.\nThe baryonic isocurvature perturbations in the AD mechanism were discussed† for instance\nin Refs. [4, 5], both of which focused on the D-term inflation model [6]. This is partly\nbecause the absence of the Hubble-induced A-term as well as the Hubble-induced mass term\nis obvious in the D-term inflation. It was also pointed out in Ref. [4] that the Hubble-induced\nA-term can be suppressed in a certain class of the F -term inflation models. However, they did\nnot examine realistic inflation models such as the hybrid inflation model [7], and how generic\nthe Hubble-induced A-term is suppressed was not clear. Indeed, it was often claimed that the\npresence of the Hubble-induced A-term was unavoidable consequence of the F -term inflation\nin supergravity. The purpose of this paper is to examine representative inflation models and\nexplicitly show that the Hubble-induced A-term is suppressed, in addition to investigate\nits condition in general. Furthermore, by using the recent observational constraints on the\nisocurvature fluctuations, we put tight bounds on the inflationary scale and the reheating\ntemperature for the first time.\n\nII.\n\nAFFLECK-DINE MECHANISM\n\nLet us here briefly review the AD mechanism. In particular we explain how the resultant baryon asymmetry is related to the baryon-number violating operators, which will be\nimportant later on to estimate the baryonic isocurvature fluctuations.\nFlat directions are parameterized by composite gauge-invariant monomial operators such\nas udd or LHu , and the dynamics of a flat direction can be expressed in terms of a com†\n\nIt was first pointed out in Ref. [3] that their amplitude could be observably large without discussion of\nHubble-induced mass and A terms.\n\n3\n\n\fplex scalar field φ. The flat directions of the minimal supersymmetric standard model are\nclassified in Ref. [8]. We assume that φ has a nonzero baryon number in the following.\nFirst let us consider the scalar potential of φ in a flat space time. We assume that the\nAD field φ has a non-renormalizable operator in the superpotential:\nW (φ) =\n\nλ n\nφ ,\nn\n\n(1)\n\nwhere λ is a numerical coefficient, and n is an integer, n = 4, 5, 6, 7 and 9, which depends\non flat directions. We set λ to be real without loss of generality. We adopt the Planck unit,\nMP = 1 (MP = 2.4 × 1018 GeV) here and in what follows unless it is written explicitly.\nThe above operator (1) lifts the flat direction at large scales. In addition to the nonrenormalizable operator, the AD field has a soft SUSY breaking mass, mφ . Thus the relevant\npotential for the AD field is expressed as\n\n‡\n\nV0 (φ) = m2φ |φ|2 + λ2 |φ|2n−2 + VA (φ)\n\n(2)\n\nVA (φ) = aλ m3/2 φn + h.c.\n\n(3)\n\nwith\n\nHere we add the A-term, VA , where a is a numerical coefficient of order unity, and m3/2\ndenotes the gravitino mass. The presence of VA is generic, and one of the contributions comes\nfrom the cross-term between (1) and the constant term in the superpotential W0 ≃ m3/2 .\nThe A-term explicitly violates the baryon symmetry, which will play an important role in\nthe AD mechanism as described below.\nLet us make a comment that the A-term is proportional to the R symmetry breaking,\nsince one can assign the R charge 2 on the operator (1), i.e., R[φ] = 2/n. Note that the\nR symmetry is necessarily violated by the constant term in the superpotential to make the\ncosmological constant (almost) vanish. Therefore the A-term VA naturally arises in a flat\nspacetime, picking up the R symmetry breaking, W0 § . As we will discuss in the next section,\nhowever, it depends on the inflation models whether there are larger R breakings during and\nafter inflation.\n‡\n\n§\n\nIn the gauge-mediated SUSY breaking models [9], the potential coming from the SUSY breaking effects\ntakes a different form and there might be another contribution to the A-term. However, it does not change\nthe following arguments qualitatively.\nThis is actually the anomaly-mediated SUSY breaking effect [10], since the operator (1) explicitly breaks\nthe scale invariance.\n\n4\n\n\fWhen the inflaton dominates the energy density of the universe, SUSY is largely broken\nby the potential energy of the inflaton, and the potential of φ receives corrections. We focus\non the F -term inflation models. The scalar potential in supergravity is given by\n\u0010\n\n\u0011\n\nV = eK Di W g ij (Dj W )∗ − 3|W |2 ,\n∗\n\n(4)\n\nwhere we adopt the usual convention that a subscript i denotes a derivative with respect to\na scalar field φi . The sum over the indices i, j, . . . is understood unless otherwise stated. K\nis the Kähler potential, W is the superpotential, and g ij is the inverse of the Kähler metric\n∗\n\ngij ∗ . During inflation, the inflaton potential is related to the Hubble expansion rate:\nV (I) ≃ 3H 2.\n\n(5)\n\nIf there is a quartic coupling between the AD field and the inflaton in the Kähler potential,\nK = c |φ|2|I|2 with c > 1, the AD field has a negative Hubble-induced mass term. The\nscalar potential of φ can be written as\nV (φ) ≃ −cH H 2 |φ|2 + V0 (φ),\n\n(6)\n\nwhere cH ≡ 3(c − 1) is a numerical coefficient of order unity. For simplicity we set cH = 1\nin the following. The expression (6) is actually valid as long as the inflaton dominates\nthe energy density of the universe, and we can use (6) after inflation until the reheating is\ncompleted.\nThere might be a further correction called the Hubble-induced A-term, given by\nVAH (φ) = b λHφn + h.c.,\n\n(7)\n\nwhich is similar to the A-term, VA (see (3)). Here b is a numerical coefficient, and its size\nis important for the baryonic isocurvature fluctuations. In this section we drop the Hubbleinduced A-term, and the condition for its appearance will be discussed in detail in the next\nsection.\nLet us now describe the dynamics of the AD field. To this end we decompose φ into the\nradial and phase components:\nφ\nφ = √ eiθ .\n2\nWhen H ≫ mφ , the potential minimum of φ is located at\nφmin ≃ αn\n5\n\n\u0012\n\nH\nλ\n\n1\n\u0013 n−2\n\n(8)\n\n(9)\n\n\fwith αn ≡ (2n−2/(n − 1))1/2(n−2) . During inflation, the φ stays at the minimum, φ =\nφmin . After inflation, the Hubble parameter decreases with time, and so does the minimum.\nThe radial component φ continues to track φmin until H ∼ mφ , since its effective mass is\n(eff)\n\ncomparable to the velocity of the instantaneous minimum, i.e., mφ\n\n= H ∼ φ̇min/φmin . On\n\nthe other hand, the phase component θ has a rather flat potential coming only from VA , and\nit is written as\nVA = √\n\n|a|\nm3/2 Hφ2 cos (nθ + arg[a]) ,\nn−1\n\n(10)\n\nq\n\nwhere we have used φ = φmin. The mass of θ is of O( m3/2 H), which is much smaller than\nH before φ starts to oscillate ¶ . Thus θ is in general deviated from the minima of VA .\nWhen the Hubble parameter becomes comparable to mφ , the AD field starts to oscillate\nabout the origin. The baryon asymmetry is effectively generated at that moment, and the\nfield is kicked in the phase direction by the baryon-number-violating potential, VA . The\nbaryon number density nB is defined by\n\u0010\n\n\u0011\n\nnB ≡ i φφ̇∗ − φ∗ φ ,\n\n(11)\n\nwhere we assume that φ has an unit baryon number. The evolution of the baryon number\ndensity is given by\nṅB + 3HnB = −iφ\n\n∂VA\n+ h.c.,\n∂φ\n\n(12)\n\nwhere the dot denotes a derivative with respect to the time. The baryon number density at\nthe onset of the oscillations is estimated as\nnB ∼\n\nn\n|a|λm3/2 φnosc sin (nθ + arg[a]) ,\nmφ\n\n(13)\n\nwhere φosc represents φ evaluated at H = mφ by using (9). The baryon-to-entropy ratio is\nthen given by\nm3/2 2\nnB\nφ TRH sin (nθ + arg[a]) ,\n∼\ns\nm2φ osc\n\n(14)\n\nwhere TRH is the reheating temperature, and we assume that the reheating is not completed\nwhen the AD field starts the oscillations, since otherwise too many gravitinos would be\nproduced by thermal scatterings.\n¶\n\nPrecisely speaking, it is φθ that has mass dimension one, rather than θ. Note also that the mass of φ,\nmφ , is generically larger than or comparable to m3/2 .\n\n6\n\n\fFrom the arguments above, it is clear that the resultant baryon asymmetry is directly related to the baryon-number violating operator, VA . Our estimate on the baryon asymmetry\nactually remains unchanged even if there is an unsuppressed Hubble-induced A-term. However, whether the isocurvature fluctuations in the baryon asymmetry is generated crucially\ndepends on the presence of the Hubble-induced A-term. If it is unsuppressed, θ does not\nhave any sizable fluctuations beyond the Hubble horizon scale during inflation. On the other\nhand, if the Hubble-induced A-term is suppressed, θ acquires quantum fluctuations of O(H)\nduring inflation, which will turn into the baryonic isocurvature fluctuations. Therefore, the\nstrength of the baryon-number violation is a crucial issue, and we will discuss possible origins\nof the Hubble-induced A-term in the next section.\n\nIII.\n\nHUBBLE-INDUCED A-TERMS\n\nIn this section we discuss the conditions for the Hubble-induced A-terms to arise and\nwill see that, in general, they are suppressed in the F -term inflation models. The Hubbleinduced A-term is given by (7). The size of the numerical coefficient b is important to\nestimate the baryonic isocurvature fluctuations. Assuming that the radial component φ\ntracks the instantaneous minimum (9), one can express VAH in terms of φ and θ:\nVAH = √\n\n|b|\nH 2 φ2 cos (nθ + arg[b]) .\nn−1\n\n(15)\n\nTherefore, if b is of O(1), the phase component θ has a mass comparable to the Hubble\nparameter. If this is the case, θ cannot have sizable fluctuations beyond the Hubble horizon\nscale, and the baryonic isocurvature fluctuations are absent.\nWhat kind of conditions are necessary for the Hubble-induced A-term to arise? The R\nsymmetry must be largely broken during inflation in order to have sizable Huble-induced\nA-terms, since they violate the R symmetry by ∆R = 2, as we will see. If there were not\nfor any R-breaking terms other than the constant term W0 ∼ m3/2 in the superpotential,\nthe Hubble-induced A-term could not arise; we would only have the ordinary A-term (10).\nIf the supergravity effects are negligible, the superpotential during inflation can be approximated by\nW ≃ v 2 I,\n\n(16)\n\n√\nwhere I is the inflaton, and the Hubble parameter during inflation is H ≃ |FI |/ 3 ∼ v 2 ,\n7\n\n\fwhere FI ≃ −(WI )∗ = −v 2 is the F -term of the inflaton. In the inflation models with\nmultiple scalar fields, the superfield I in (16) may not be the inflaton which slow-rolls\ngenerating the adiabatic density perturbations. For definiteness we call such a field I that\nhas a large F -term during inflation as the inflaton. Most inflation models such as new,\nhybrid, and their variants fall in this category. We can then naturally assign the R-charge\nof the inflaton as, R[I] = +2. In order to have the Hubble-induced A-term, the following\noperators should be unsuppressed: [2, 11]\nO1 =\nO2 =\n\nZ\n\nZ\n\n∗∗\n\n\u0010\n\n\u0011\n\nd4 θ I * |φ|2 + h.c. ,\n\n(17)\n\nd2 θ I *\n\n(18)\n\nλ n\nφ + h.c.,\nn\n\nwhere both O1 and O2 violate the R symmetry by ∆R = 2\n ̄\n\n††\n\n. The operator O1 induces a\n ̄\n\nkinetic mixing, gI φ̄ = −g φI = φ, and the Hubble-induced A-term arises from Wφ g φI (WI )∗\n\n(see Eq. (4)). In the meantime, one can see that O2 generates the Hubble-induced A-term\nby noting |FI | ∼ H.\nIf the operators O1 and O2 are not suppressed, the inflaton I is effectively singlet; there\nis a priori no reason to expect that the inflaton does not have any other operators violating\nthe R-symmetry. This can cause two cosmological problems. One is that, since I can be\ntreated as a singlet, it is hard to have a flat potential for successful inflation without severe\nfine-tunings, because all terms like I, I 2 , I 3 , I 4 , . . ., which otherwise could be forbidden by\nsymmetry, will appear in the inflaton potential. Thus, a severe fine-tuning will be necessary\nin general. The other is that the inflaton generically couples to the SUSY breaking sector,\nso decays into the gravitinos with an intolerably large rate [12, 13, 14, 15, 16]. It is nothing\nbut a cosmological disaster unless the gravitino mass is extremely heavy or light. Therefore,\nin order to evade these problems, it is usually necessary to impose that the R-symmetry is a\n(relatively) good symmetry during inflation, which leads to suppression of both O1 and O2 .\nSo far we have neglected the supergravity effects. In particular, the field value of the\ninflaton I is assumed to be smaller than the Planck scale: |I| ≪ 1. This is the case for most\n∗∗\n\n††\n\nR\nAnother operator, O1′ = d4 θ I † φφ + h.c., can also generate the Hubble-induced A-term. Such operator\nis only allowed for Hu Hd and LHu directions. However, Hu Hd direction cannot create any baryon\nasymmetry of the universe, and the inflaton I must violate the lepton number for LHu direction.\nOne can obtain the operator O2 from O1 , by rescaling φ as (1 + I)φ → φ in the presence of the nonrenormalizable operator (1).\n\n8\n\n\finflation models except for the so-called large scale inflation models. When the supergravity\neffects are important, the Hubble-induced A-term is generically generated if one of the\nfollowing conditions is met\n> 1,\n|I| ∼\n|W (I)| ∼ H.\n\n(19)\n(20)\n\nIf we substitute (19) into (16), we obtain (20). Of course, this naive argument may not\nbe applicable when the full supergravity effects are taken into account: in principle, there\n> 1, one can obtain the\ncan be cancellation between several contributions to W . If |I| ∼\n> 1, from the quartic coupling K = c |φ|2 |I|2 needed for\noperator O1 with a coefficient hIi ∼\nthe negative Hubble-induced mass term, after expanding the inflaton about its field value.\nOn the other hand, if |W (I)| ∼ H, it gives rise to the Hubble-induced A-term as in the\nordinary A-term, since |W (I)| measures the breaking of the R-symmetry.\nOur concern here is whether the conditions (19) and (20) are satisfied in the realistic\nlarge-scale inflation models such as the chaotic inflation model. Although it is hard to\nconstruct a successful chaotic inflation model in supergravity, one was proposed in Ref. [17].\nActually, however, neither condition is met in this model. The superpotential is W = mXY ,\nwhere m ≃ 2 × 1013 GeV is the inflaton mass. Y is charged under a shift symmetry and\n> 1. On the other hand, it is X that\nhas a large expectation value during inflation, Im[Y ] ∼\nhas a large F -term, so we must regard I = X in Eqs.(19) and (20). During inflation, the X\nstays at the origin, X = 0\n\n‡‡\n\n. Therefore neither (19) nor (20) is satisfied. Let us comment\n\non other large-scale inflation models. The no-scale type chaotic inflation was constructed in\nRef. [18]. Besides the problem as to the moduli stabilization and too large gravitino mass in\nthis model, the no-scale nature leads to the vanishing Hubble-induced mass and A-terms. On\nthe other hand, a natural inflation model was constructed in Ref.[19] with the use of a shift\nsymmetry. In this model, Hubble-induced A-terms can be obtained, but the gravitino mass\nis comparable to the Hubble parameter during inflation. Therefore the Hubble-induced Aterm is more or less comparable to the ordinary A-term. We do not consider such cases, and\nfocus on those inflation models that have much larger Hubble parameter than the gravitino\nmass.\n‡‡\n\nIn this respect, this chaotic inflation model can be classified into the category considered below Eq.(16).\nIn fact, R[X] = +2 and v 2 = mhIi.\n\n9\n\n\fFor completeness we consider whether the Hubble-induced A-term appears after inflation,\nbecause its appearance after inflation will diminish the amplitude of the fluctuations in the\nθ-direction produced during inflation. The energy density of the universe after inflation\nis dominated by the inflaton oscillating about its potential minimum until it decays into\nradiation. Expanding the inflaton about its potential minimum, one can express the Kähler\npotential and the superpotential respectively as\n∗ ˆ\nˆ2 + ***,\nK = |I|2 + * * * = Imin\nI + Imin Iˆ† + |I|\n1\n1\nW = M(I − Imin )2 + * * * = M Iˆ2 + * * * ,\n2\n2\n\n(21)\n(22)\n\nwhere Imin denotes the minimum of the potential, and Iˆ ≡ I − Imin is the excitation of the\ninflaton about Imin . The Hubble parameter is related to the amplitude of the inflaton as\nH 2 ∼ |FI |2 ∼ M 2 Iˆ2 ,\nD\n\nE\n\n(23)\n\nwhere FI = −M Iˆ∗ denotes the F -term of the inflaton. Since the inflaton oscillates around\nits potential minimum, the averaged values of FI vanishes. Therefore the Hubble-induced\nA-term is suppressed after inflation [20].\nWe therefore conclude that it is hard to generate the Hubble-induced A-terms in most,\nif not all, of the supergravity F -term inflation without having severe fine-tunings or cosmological difficulties. As we will see in the next section, the absence of the unsuppressed\nHubble-induced A-term leads to the baryonic isocurvature fluctuations.\n\nIV.\n\nBARYONIC ISOCURVATURE FLUCTUATIONS\n\nIf there is no sizable Hubble-induced A-term, the phase of the AD field is effectively\nmassless during inflation. Then it acquires quantum fluctuations,\nδθ =\n\nHinf\n,\n2πφinf\n\n(24)\n\nwhere φinf denotes the field value of the φ during inflation, obtained by substituting H = Hinf\ninto (9). We neglect the tilt of the fluctuations and assume that the radial component does\nnot have fluctuations beyond the horizon scale. Let us define the baryonic isocurvature\nfluctuation Sbγ as\nSbγ ≡\n\nδρB 3 δργ\nnB\n,\n−\n= δ log\nρB\n4 ργ\ns\n\u0012\n\n10\n\n\u0013\n\n(25)\n\n\fwhere ρB and ργ denote the energy densities of the baryons and photons, respectively, and\nwe use ρB ∝ nB and ρ3/4\n∝ s in the second equality. Inserting Eq. (14) into Eq. (25), we\nγ\nobtain\nSbγ = n cot (nθinf + arg[a]) δθ.\n\n(26)\n\nThe observations of CMB have shown that the density perturbations are predominantly\nadiabatic, and therefore the isocurvature perturbations are tightly constrained [21, 22, 23,\n24]. The latest WMAP 5yr data puts an upper bound at 95% C.L. [25],\nΩb\n<\nSbγ ∼\nΩc\n\n\u0012\n\n0.067\n* 2.4 × 10−9\n1 − 0.067\n\n\u00131\n2\n\n≃ 1.3 × 10−5 ,\n\n(27)\n\nwhere the isocurvature fluctuation is taken to be uncorrelated with the adiabatic one, and Ωb\nand Ωc denote the density parameters of the baryon and the cold dark matter, respectively.\nWith Ωb ≃ 0.046 and Ωc ≃ 0.23 [25], we arrive at\n< 6.6 × 10−5.\n|Sbγ | ∼\n\n(28)\n\nUsing (14), (24), (26) and (28), we can rewrite the constraint as\nTRH\n\n<\n∼ 1.7 × 10\n\n−7\n\n1 MP2\nn2 m3/2\n\nmφ\nHinf\n\n! 2n−6 \u0012\nn−2\n\nnB\ns\n\n\u0013\n\nΘ,\n\n(29)\n\nwith\nΘ≡\n\nsin (nθinf + arg[a])\n,\ncos2 (nθinf + arg[a])\n\n(30)\n\nwhere we eliminate φinf by using φinf ≃ (Hinf /mφ )1/(n−2) φosc . This is the main result of this\npaper.\nThe constraint (29) reads\n< 6 × 106 GeV\nTRH ∼\n\n\u0012\n\nm3/2\n1TeV\n\n\u0013−1 \u0012\n\nmφ\n1TeV\n\n\u0013\u0012\n\nHinf\n1012 GeV\n\n\u0013−1\n\nΘ,\n\n(31)\n\nfor n = 4, and\n< 80 GeV\nTRH ∼\n\n\u0012\n\nm3/2\n1TeV\n\n\u0013−1 \u0012\n\nmφ\n1TeV\n\n\u00133 \u0012\n2\n\nHinf\n1012 GeV\n\n\u0013− 23\n\nΘ,\n\n(32)\n\nfor n = 6, where we use nB /s = 8.8 × 10−11 . We show the constraints (31) and (32) as red\n(solid) and greed (dashed) lines,respectively, in Fig. 1. One can see that the upper bound\non the reheating temperature becomes severer for larger Hinf and n.\n11\n\n\fFIG. 1: Upper bounds on inflation models from AD isocurvature fluctuations for n = 4 (red, solid\nlines) and 6 (green, dashed lines). We set Θ = 1 and m3/2 = 1 TeV. Also shown are the bounds of\nthe reheating temperature. Blue (dotted) line is the model-independent global upper limit, while\nlower limits are shown for the chaotic, new, and hybrid inflations by pink square, light blue triangle,\nand gray dot-dashed line, respectively.\n\nA comment on Q-ball formation follows. It is known that non-topological solitons called\nQ balls may be produced associated with AD mechanism [26, 27]. As long as those Q balls\ndecay eventually into the ordinary quarks, the estimates of baryon number and isocurvature\nfluctuations remain intact. This is the case of the gravity- or anomaly-mediation. In the\ngauge-mediation, the amplitude of A-terms and the dynamics of the field is more modeldependent. Also the Q balls can be stable, and only a small fraction of the baryon number\nmay be released from them [28]. Then the constraint on the reheating temperature will\nbe relaxed by a factor ∆−(n−2)/(2n−6) , where ∆ denotes the fraction of the baryon number\nemitted from the Q ball. Note however that the lightest supersymmetric particle produced\nby the decay of the Q balls, or the Q balls themselves if stable, may contribute to the dark\n12\n\n\fmatter abundance. In this case, the constraint (29) may become severer, since the constraint\non the dark matter isocurvature perturbations are severer than that on the baryonic one.\n\nV.\n\nCONSTRAINTS ON INFLATION MODELS\n\nThere is an absolute upper bound on the reheating temperature obtained by ρrad (TRH ) ≤\n\n2\n3Hinf\nMP2 ,\n\nTRH ≤\n\n90\nπ 2 g∗\n\n!1\n\n4\n\nq\n\nHinf MP\n\ng∗\n∼ 7.2 × 10 GeV\n200\n\u0012\n\n14\n\n\u0013− 1 \u0012\n4\n\nHinf\n1012 GeV\n\n\u0013 12\n\n,\n\n(33)\n\nOn the other hand, the inflaton inevitably decays into the standard-model sector through the\ntop Yukawa coupling, if it has non-vanishing expectation value at the potential minimum,\ni.e., if Imin 6= 0 [15]. The lower bound reads\nTRH\n\n3\n>\n∼ 1.9 × 10 GeV |Yt |\n\n\u0012\n\ng∗\n200\n\n\u0013− 1 \u0012\n4\n\nImin\n15\n10 GeV\n\n\u0013\u0012\n\nmI\n12\n10 GeV\n\n\u00133\n2\n\n,\n\n(34)\n\nwhere Yt is the top Yukawa coupling. The reason why such a decay proceeds is as follows.\nWhen Imin 6= 0, the inflaton has a linear term in the Kähler potential as in Eq. (21). Then\nthe inflaton Iˆ couples to any particles that appear in the superpotential. This is because\nit is a combination given by eK/2 W that is more important in supergravity at tree level,\ninstead of K and W . In other words, using the Kähler transformation, one can remove\nthe linear term of the inflaton from the Kähler potential, and obtain a new interaction,\n∗\nW = (Imin\n)Iˆ * Yt T QHu , in the superpotential.\n\nThe reheating temperature is not known, due to our ignorance on the inflation and the\nreheating processes; it can a priori take any values between (34) and (33). The upper bound\non TRH , (29), therefore excludes large parameter space of the reheating temperature, which\nare otherwise allowed §§ . Since the bounds (34) and (33) depend on the inflaton parameters\nsuch as the inflation scale, the mass and the field value at the potential minimum, let us\nconsider the bounds for representative inflation models such as chaotic [17], new [29], and\nhybrid [30] inflation models, separately. The details of each model are given in Appendix.\n§§\n\nThere are other constraints on the reheating temperature, coming from, e.g., the thermal production of\nthe gravitinos. Our constraint (29) is independent of those constraints. In fact, (29) gives a very stringent\nupper bound as (32), which cannot be obtained otherwise.\n\n13\n\n\fFor the chaotic inflation model without a Z2 symmetry, we expect Imin ∼ 1. The inflaton\n> 2.4 × 108 GeV from\nmass is determined to be mI ≃ 2 × 1013 GeV, leading to TRH ∼\n(34). As can be seen in Fig. 1, the chaotic inflation is inconsistent with the constraint from\nthe baryonic isocurvature fluctuations, unless we impose a Z2 symmetry on the inflaton\nto suppress its expectation value as |Imin | ≪ 1 [12]. Note that the constraint is actually\nseverer in the chaotic inflation, since the tensor modes will leave less room for the baryonic\nisocurvature fluctuations.\nFor the new inflation model, the inflaton parameters are mI ≃ 4 × 109 GeV and Imin ≃\n> 1.4\n3 × 1015 GeV for m3/2 = 1 TeV. The lower bound on the reheating temperature is TRH ∼\nGeV, which can satisfy the bound (29). The inflation scale is relatively low, given by\nHinf ≃ O(105 ) GeV.\n\nFor the hybrid inflation model, for κ ∼ 10−1 − 10−5 , we have mI ∼ 1015 − 1010 GeV and\n\nImin ≃ 1015 GeV for Hinf ∼ 1011 − 106 GeV. The lower bounds on the reheating temperature\n> 6.0 × 107 − 1.9 GeV. Therefore, large values of κ are excluded by the bounds\nread TRH ∼\n\nfor isocurvature fluctuations.\n\nVI.\n\nCONCLUSION\n\nWe have reconsidered the Affleck-Dine mechanism and discussed the condition for the\nHubble-induced A-term to arise. It has turned out that the R-symmetry needs to be largely\nbroken during inflation. If this is the case, however, theoretical and cosmological difficulties arise; one needs fine-tunings to make the inflaton potential flat enough, and moreover,\nthe inflaton decay produces too many gravitinos. Therefore, R-symmetry, under which the\ninflaton is charged, should be a good symmetry to some extent, which results in the suppression of the Hubble-induced A-term. Then the phase direction of the AD field is effectively\nmassless during inflation, and its fluctuations contribute to sizable baryonic isocurvature\nperturbations, while the fluctuation in the radial direction is absent due to the Hubbleinduced mass term in the F -term inflation models. Note that the Hubble-induced A-term is\ngenerally suppressed after inflation. Using the latest WMAP-5yr data, we have derived tight\nconstraints on the inflation models in terms of the Hubble parameter during inflation and\nthe reheating temperature, based on the assumption that the AD mechanism is responsible\nfor the baryon asymmetry of the universe. The constraint on the reheating temperature is\n14\n\n\fvery tight especially for the high-scale inflation models and higher values of n. We conclude\nthat large-scale inflation models with high reheating temperatures are not preferred in the\ncontext of the AD mechanism.\n\nAcknowledgments\n\nThe work is supported by Grant-in-Aid for Scientific Research from the Ministry of Education, Science, Sports, and Culture (MEXT), Japan, No. 17740156 (S.K.) and No. 14102004\n(M.K.). This work was supported by World Premier International Research Center InitiativeiWPI Initiative), MEXT, Japan. This work was also supported in part by JSPS-AF\nJapan-Finland Bilateral Core Program (S.K. and M.K.).\n\nAPPENDIX A: INFLATION MODELS\n\nIn the appendix, we give brief explanations on the inflation models we have considered\nin the text.\n\n1.\n\nChaotic inflation\n\nThe Kähler potential is expressed as [17]\n1\nK(I, I † ) = (I + I † )2 ,\n2\n\n(A1)\n\nwhich is invariant under the shift, I → I + iA, where A is a dimensionless real parameter.\n√\nThe inflaton field is identified as the imaginary part of I, i.e., 2 ImI. The superpotential\nis written as\nW (I, X) = mXI,\n\n(A2)\n\nwhich breaks the shift symmetry a bit with a small mass scale m ≃ 2 × 1013 GeV (≪ 1).\nHere another chiral multiplet X is introduced, whose F -term is responsible for the potential\nenergy during and after inflation: V ≃ |FX |2 .\n\n15\n\n\f2.\n\nNew inflation\n\nThe Kähler potential and superpotential of the inflaton sector are written as [29]\nk\nK(I, I † ) = |I|2 + |I|4 ,\n4\ng s+1\n2\nW (I) = v I −\nI ,\ns+1\n\n(A3)\n(A4)\n\nwhere k and g are constants, s is an integer, and v is the inflation energy scale. In order to\n< 0.03 for\nexplain the observed density fluctuations, we need v = 4 × 10−7 (g/0.1)−1/2 and k ∼\ns = 4. After inflation, the vev of the inflaton becomes Imin ≃ (v 2 /g)1/s , and its mass is given\n\nby mI ≃ sv 2 /Imin. The gravitino mass in this model is related to v as m3/2 ≃ sv 2 Imin /(s+1),\nbecause the inflaton induces a spotaneous R-symmetry breaking.\n\n3.\n\nHybrid inflation\n\nThe superpotential of the inflaton sector is written as [30]\nW (I, ψ, ψ̄) = I(v 2 − κψ ψ̄),\n\n(A5)\n\nwhere the two superfields ψ(+1) and ψ̄(−1) are the waterfall fields, which are charged under\na U(1) gauge symmetry. κ is a coupling constant and v is the inflation energy scale. To\naccount for the WMAP normalization on the density fluctuations, v and κ are related as\n> 10−3 , while v ≃ 2 × 10−2 κ5/6 for κ < 10−3.\nv ≃ 2 × 10−3 κ1/2 for κ ∼\n∼\n\n[1] I. Affleck and M. Dine, Nucl. Phys. B 249, 361 (1985).\n[2] M. Dine, L. Randall and S. Thomas, Nucl. Phys. B 458, 291 (1996).\n[3] J. Yokoyama, Astropart. Phys. 2, 291 (1994).\n[4] K. Enqvist and J. McDonald, Phys. Rev. Lett. 83, 2510 (1999); Phys. Rev. D 62, 043502\n(2000).\n[5] M. Kawasaki and F. Takahashi, Phys. Lett. B 516, 388 (2001).\n[6] E. Halyo, Phys. Lett. B 387, 43 (1996); P. Binetruy and G. R. Dvali, Phys. Lett. B 388, 241\n(1996).\n\n16\n\n\f[7] E. J. Copeland, A. R. Liddle, D. H. Lyth, E. D. Stewart and D. Wands, Phys. Rev. D 49,\n6410 (1994); G. R. Dvali, Q. Shafi and R. K. Schaefer, Phys. Rev. Lett. 73, 1886 (1994);\nA. D. Linde and A. Riotto, Phys. Rev. D 56, 1841 (1997).\n[8] T. Gherghetta, C. F. Kolda and S. P. Martin, Nucl. Phys. B 468, 37 (1996).\n[9] M. Dine, A. E. Nelson and Y. Shirman, Phys. Rev. D 51, 1362 (1995); M. Dine, A. E. Nelson, Y. Nir and Y. Shirman, Phys. Rev. D 53, 2658 (1996); For a review, see, for example,\nG. F. Giudice and R. Rattazzi, Phys. Rep. 322, 419 (1999), and references therein.\n[10] L. Randall and R. Sundrum, Nucl. Phys. B 557, 79 (1999); G. F. Giudice, M. A. Luty, H. Murayama and R. Rattazzi, JHEP 9812, 027 (1998); J. A. Bagger, T. Moroi and E. Poppitz,\nJHEP 0004, 009 (2000).\n[11] S. Kasuya and M. Kawasaki, Phys. Rev. D 74, 063507 (2006); S. Kasuya, J. Phys. A 40, 6999\n(2007) [arXiv:hep-ph/0610428].\n[12] M. Kawasaki, F. Takahashi and T. T. Yanagida, Phys. Lett. B 638, 8 (2006); Phys. Rev. D\n74, 043519 (2006).\n[13] T. Asaka, S. Nakamura and M. Yamaguchi, Phys. Rev. D 74, 023520 (2006).\n[14] M. Endo, K. Hamaguchi and F. Takahashi, Phys. Rev. D 74, 023531 (2006).\n[15] M. Endo, M. Kawasaki, F. Takahashi and T. T. Yanagida, Phys. Lett. B 642, 518 (2006).\n[16] M. Endo, F. Takahashi and T. T. Yanagida, Phys. Lett. B 658, 236 (2008); Phys. Rev. D 76,\n083509 (2007).\n[17] M. Kawasaki, M. Yamaguchi and T. Yanagida, Phys. Rev. Lett. 85, 3572 (2000); Phys. Rev.\nD 63, 103514 (2001).\n[18] H. Murayama, H. Suzuki, T. Yanagida and J. Yokoyama, Phys. Rev. D 50, 2356 (1994).\n[19] R. Kallosh, Lect. Notes Phys. 738, 119 (2008) [arXiv:hep-th/0702059].\n[20] K. Kamada and J. Yokoyama, arXiv:0803.3146 [hep-ph].\n[21] R. Bean, J. Dunkley and E. Pierpaoli, Phys. Rev. D 74, 063503 (2006).\n[22] R. Trotta, Mon. Not. Roy. Astron. Soc. Lett. 375, L26 (2007).\n[23] R. Keskitalo, H. Kurki-Suonio, V. Muhonen and J. Valiviita, JCAP 0709, 008 (2007).\n[24] M. Kawasaki and T. Sekiguchi, arXiv:0705.2853 [astro-ph].\n[25] E. Komatsu et al. [WMAP Collaboration], arXiv:0803.0547 [astro-ph].\n[26] S. R. Coleman, Nucl. Phys. B 262, 263 (1985) [Erratum-ibid. B 269, 744 (1986)].\n[27] A. Kusenko and M. E. Shaposhnikov, Phys. Lett. B 418, 46 (1998); K. Enqvist and J. Mc-\n\n17\n\n\fDonald, Phys. Lett. B 425, 309 (1998); Nucl. Phys. B 538, 321 (1999); S. Kasuya and\nM. Kawasaki, Phys. Rev. D 61, 041301(R) (2000).\n[28] M. Laine and M. E. Shaposhnikov, Nucl. Phys. B 532, 376 (1998); R. Banerjee and\nK. Jedamzik, Phys. Lett. B 484, 278 (2000); S. Kasuya and M. Kawasaki, Phys. Rev. D\n64, 123515 (2001).\n[29] K. I. Izawa and T. Yanagida, Phys. Lett. B 393, 331 (1997).\n[30] E. J. Copeland, A. R. Liddle, D. H. Lyth, E. D. Stewart and D. Wands, Phys. Rev. D 49,\n6410 (1994); G. R. Dvali, Q. Shafi and R. K. Schaefer, Phys. Rev. Lett. 73, 1886 (1994);\nA. D. Linde and A. Riotto, Phys. Rev. D 56, 1841 (1997).\n\n18\n\n\f"}