{"id": "http://arxiv.org/abs/1005.3328v2", "guidislink": true, "updated": "2010-08-31T16:23:33Z", "updated_parsed": [2010, 8, 31, 16, 23, 33, 1, 243, 0], "published": "2010-05-18T20:54:28Z", "published_parsed": [2010, 5, 18, 20, 54, 28, 1, 138, 0], "title": "Complex Scalar Dark Matter vis-à-vis CoGeNT, DAMA/LIBRA and XENON100", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1005.0592%2C1005.2151%2C1005.0199%2C1005.4680%2C1005.3771%2C1005.5218%2C1005.3747%2C1005.0989%2C1005.3994%2C1005.2910%2C1005.4888%2C1005.0724%2C1005.3111%2C1005.3439%2C1005.4052%2C1005.4170%2C1005.3061%2C1005.4471%2C1005.0526%2C1005.1955%2C1005.2308%2C1005.5703%2C1005.3908%2C1005.0527%2C1005.0165%2C1005.0816%2C1005.3240%2C1005.2436%2C1005.3014%2C1005.4204%2C1005.0863%2C1005.0390%2C1005.3834%2C1005.5588%2C1005.5468%2C1005.3716%2C1005.3187%2C1005.1871%2C1005.3328%2C1005.1507%2C1005.5410%2C1005.0050%2C1005.0426%2C1005.4873%2C1005.1436%2C1005.5330%2C1005.0299%2C1005.1568%2C1005.0636%2C1005.5456%2C1005.1731%2C1005.0806%2C1005.5495%2C1005.1258%2C1005.3588%2C1005.2684%2C1005.3074%2C1005.3633%2C1005.3525%2C1005.3822%2C1005.5616%2C1005.0213%2C1005.0583%2C1005.2166%2C1005.0384%2C1005.0682%2C1005.1925%2C1005.2647%2C1005.1933%2C1005.2900%2C1005.3204%2C1005.0853%2C1005.1753%2C1005.4591%2C1005.3737%2C1005.4245%2C1005.1089%2C1005.4105%2C1005.5568%2C1005.3569%2C1005.5528%2C1005.0718%2C1005.2167%2C1005.1392%2C1005.2300%2C1005.4359%2C1005.5627%2C1005.4687%2C1005.4478%2C1005.3122%2C1005.2608%2C1005.2396%2C1005.0857%2C1005.3911%2C1005.5324%2C1005.2729%2C1005.0715%2C1005.0681%2C1005.3144%2C1005.4880%2C1005.5195&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Complex Scalar Dark Matter vis-à-vis CoGeNT, DAMA/LIBRA and XENON100"}, "summary": "The CoGeNT and DAMA/LIBRA experiments have found evidence for the\nspin-independent scattering from nuclei of a light dark matter (DM) particle,\n7-12 GeV, which is not excluded by the XENON DM experiments. We show that this\nputative DM signal can be explained by a complex scalar singlet extension of\nthe standard model (CSM), with a thermal cosmological DM density, and a Higgs\nsector that is consistent with LEP constraints. We make predictions for the\nmasses, production, and decays of the two Higgs mass eigenstates and describe\nhow the Higgs and DM particles can be discovered at the LHC.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1005.0592%2C1005.2151%2C1005.0199%2C1005.4680%2C1005.3771%2C1005.5218%2C1005.3747%2C1005.0989%2C1005.3994%2C1005.2910%2C1005.4888%2C1005.0724%2C1005.3111%2C1005.3439%2C1005.4052%2C1005.4170%2C1005.3061%2C1005.4471%2C1005.0526%2C1005.1955%2C1005.2308%2C1005.5703%2C1005.3908%2C1005.0527%2C1005.0165%2C1005.0816%2C1005.3240%2C1005.2436%2C1005.3014%2C1005.4204%2C1005.0863%2C1005.0390%2C1005.3834%2C1005.5588%2C1005.5468%2C1005.3716%2C1005.3187%2C1005.1871%2C1005.3328%2C1005.1507%2C1005.5410%2C1005.0050%2C1005.0426%2C1005.4873%2C1005.1436%2C1005.5330%2C1005.0299%2C1005.1568%2C1005.0636%2C1005.5456%2C1005.1731%2C1005.0806%2C1005.5495%2C1005.1258%2C1005.3588%2C1005.2684%2C1005.3074%2C1005.3633%2C1005.3525%2C1005.3822%2C1005.5616%2C1005.0213%2C1005.0583%2C1005.2166%2C1005.0384%2C1005.0682%2C1005.1925%2C1005.2647%2C1005.1933%2C1005.2900%2C1005.3204%2C1005.0853%2C1005.1753%2C1005.4591%2C1005.3737%2C1005.4245%2C1005.1089%2C1005.4105%2C1005.5568%2C1005.3569%2C1005.5528%2C1005.0718%2C1005.2167%2C1005.1392%2C1005.2300%2C1005.4359%2C1005.5627%2C1005.4687%2C1005.4478%2C1005.3122%2C1005.2608%2C1005.2396%2C1005.0857%2C1005.3911%2C1005.5324%2C1005.2729%2C1005.0715%2C1005.0681%2C1005.3144%2C1005.4880%2C1005.5195&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "The CoGeNT and DAMA/LIBRA experiments have found evidence for the\nspin-independent scattering from nuclei of a light dark matter (DM) particle,\n7-12 GeV, which is not excluded by the XENON DM experiments. We show that this\nputative DM signal can be explained by a complex scalar singlet extension of\nthe standard model (CSM), with a thermal cosmological DM density, and a Higgs\nsector that is consistent with LEP constraints. We make predictions for the\nmasses, production, and decays of the two Higgs mass eigenstates and describe\nhow the Higgs and DM particles can be discovered at the LHC."}, "authors": ["Vernon Barger", "Mathew McCaskey", "Gabe Shaughnessy"], "author_detail": {"name": "Gabe Shaughnessy"}, "author": "Gabe Shaughnessy", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1103/PhysRevD.82.035019", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1005.3328v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1005.3328v2", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "27 pages, 14 figures, PRD version", "arxiv_primary_category": {"term": "hep-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "hep-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "hep-ex", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1005.3328v2", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1005.3328v2", "journal_reference": "Phys.Rev.D82:035019,2010", "doi": "10.1103/PhysRevD.82.035019", "fulltext": "MAD-PH-10-1558\nNUHEP-TH/10-04\nANL-HEP-PR-10-12\nMay 2010\n\nComplex Scalar Dark Matter vis-à-vis CoGeNT, DAMA/LIBRA\n\narXiv:1005.3328v2 [hep-ph] 31 Aug 2010\n\nand XENON100\nVernon Barger,1 Mathew McCaskey,1 and Gabe Shaughnessy2, 3\n1\n2\n\nDepartment of Physics, University of Wisconsin, Madison, WI 53706\n\nNorthwestern University, Department of Physics and Astronomy, Evanston, IL 60208 USA\n3\n\nHEP Division, Argonne National Lab, Argonne IL 60439 USA\n(Dated: October 23, 2018)\n\nAbstract\nThe CoGeNT and DAMA/LIBRA experiments have found evidence for the spin-independent\nscattering from nuclei of a light dark matter (DM) particle, 7-12 GeV, which is not excluded by\nthe XENON DM experiments. We show that this putative DM signal can be explained by a\ncomplex scalar singlet extension of the standard model (CSM), with a thermal cosmological DM\ndensity, and a Higgs sector that is consistent with LEP constraints. We make predictions for the\nmasses, production, and decays of the two Higgs mass eigenstates and describe how the Higgs and\nDM particles can be discovered at the LHC.\n\n1\n\n\fI.\n\nINTRODUCTION\n\nThere has been a flurry of recent activity concerning possible experimental signals of\nparticle dark matter (DM) and numerous theoretical models have been put forward to explain them. The standard model (SM) has a cold dark matter (CDM) particle, the axion,\nbut experiments designed specifically to detect it via photons have found null results so far.\nExtensions of the SM, proposed to stabilize the radiative corrections to the Higgs boson\nmass, commonly have a particle of weak scale mass that is stable because of a discrete\nsymmetry. Such a weakly interacting massive particle (WIMP), with thermal production\nin the early universe followed by freeze-out, provides a natural rationale for CDM, with a\npredicted relic density that is in general accord with its determination from the cosmic microwave background measurements of the Wilkinson Microwave Anisotropy Probe (WMAP)\nexperiment [1].\nThere are several means by which DM can be discovered: WIMP pair annihilation in\nour galactic halo can give positrons, antiprotons, antideuterons, and gamma rays that can\nbe detected in satellite experiments [2–5]. Neutrinos from WIMP pair annihilations in the\nSun could be observed in large neutrino detectors as events pointing back to the Sun [6–\n10]. Direct elastic or inelastic scattering of WIMPs can be identified in deep underground\ndetectors via nuclear recoils. DM may be found at colliders via events with large missing\nenergy carried off by the DM particle. A concordance of indirect, direct, and collider signals\nof DM could definitively establish that DM has a particle origin.\nA number of direct DM detection experiments are underway and improvements in the\nupper bounds on the DM scattering cross sections have reached the level sensitivity of\ninterest for DM model tests. Depending on the choice of the nuclear target, elastic recoils\ncan probe the spin-independent (SI) or spin-dependent (SD) interactions between incoming\nDM and nucleons.\nThe Cryogenic Dark Matter Search experiment (CDMS-II) direct detection experiment [11] completed its five tower run with 612 kg-days of raw exposure and found two events\nwithin the signal region which is consistent with a DM interpretation to 77% C.L. [11–15].\nWhile this observation is not statistically significant, it may be suggestive of a light DM\ncandidate that scatters with low recoil energy.\nThe DAMA/LIBRA experiment, based on the annual modulation of a DM signal, has\n2\n\n\ffound 8.2 sigma evidence for a low mass DM particle [16–18]. The boundary of the favored signal region is dependent on channeling [19–21], but it has recently been argued\nthat channeling effects are unimportant [22]. In our study we consider the DAMA/LIBRA\nboundaries without channeling from Ref. [12]. We also comment on the DAMA/LIBRA\nchanneled region in the context of the XENON100 exclusion.\nThe CoGeNT direct DM detection experiment, constructed from p-type point contact\ngermanium detectors, benefits from very low electronic noise and high sensitivity to low\nenergy events [23]. After rejection of background surface events, an excess of about 100 low\nenergy, 1.9 keV < Erecoil . 11 keV, bulk events was found. This has been interpreted as\nthe possible signal of a light DM particle with a mass of 7 GeV < MDM < 12 GeV and\nspin-independent cross section of ∼ 0.7 × 10−40 cm2 . Most of the CoGeNT region is allowed\nby the CDMS limit.\nThere have been several model interpretations of the CoGeNT data in terms of a light DM\nparticle [24–28]. Asymmetric DM [29–35] connects the DM relic density to the density of\nbaryons, yielding similar DM and baryon masses. Neutralino DM in the Minimal Supersymmetric Standard Model (MSSM) has tension with Bs → μ+ μ− , B ± → τ ν constraints and\nsparticle and Higgs boson mass limits [36–39]. However, the Next-to-Minimal Supersymmetric Standard Model (NMSSM), a singlet extended MSSM, may provide a viable alternative\nto vanilla supersymmetry [29]. The NMSSM model, or any of its supersymmetric cousins,\ncan have Higgs sector phenomenology [40–45] that is somewhat similar to those of the CSM.\nRecently the XENON100 collaboration published preliminary DM direct detection exclusion limits [46–48]. The XENON100 limits with a requirement of 3 or 4 photoelectrons\n(PE) partially overlap with the CoGeNT allowed region. In our study of the XENON100\nconstraints we utilize their 4 PE data. This exclusion bound may be relaxed somewhat by a\ndifferent extrapolation of the detection efficiency below 10 keV nuclear recoil energy [48–50],\nin which case the XENON100 limits could even be consistent with the full CoGeNT allowed\nregion.\nIn this paper, we consider an explanation of either the CoGeNT DM signal, the DM signal\nfrom the DAMA/NaI and DAMA/LIBRA data, or the XENON100 DM allowed region, in\nthe context of the complex scalar singlet extended standard model (CSM) [51]. The complex\nsinglet provides two additional degrees of freedom, one which acts as a scalar singlet that\nmixes with the SM-Higgs boson and the other a DM candidate whose stability is ensured by\n3\n\n\fCP conservation of the scalar potential. The real scalar singlet model [52–59] can provide\na dark matter candidate but then has only a SM-Higgs boson.\nIn Section II, we present an overview of the complex singlet extended SM and its features.\nThe experimental constraints on the parameters of the model are described in Section III.\nSections IV and V give results where we show the correlated signatures in the Higgs sector\nthat are a consequence of the light DM particle with a spin-independent scattering cross\nsection consistent with CoGeNT, DAMA/LIBRA and/or XENON100. In Section VI, we\nprovide conclusions and an outlook.\n\nII.\n\nTHE CSM MODEL\n\nIn the CSM model, the singlet fields talk to the SM only via the Higgs boson. Thus, the\nDM sector of the model is a concrete realization of the Higgs portal concept [58, 60]. The\nscalar potential of the CSM, including only renormalizable terms is\nm2 †\nλ\nδ2\nb2\nd2\nH H + (H † H)2 + H † H|S|2 + |S|2 + |S|4\n4\n2\n2\n4\n\u0013\n\u00122\n|b1 | iφb 2\ne 1 S + |a1 | eiφa1 S + c.c. ,\n(1)\n+\n4\n√\nwhere H is the SM-Higgs and S = (S + iA)/ 2 is the complex singlet. Starting with a\nVCSM =\n\nglobal U(1) symmetric potential we include a U(1) breaking term b1 [51]. In the case that\nthe real component of the singlet obtains a vacuum expectation value (vev), a nonzero a1\nis needed to avoid domain walls from the accidental S → −S symmetry. In fact, we find\nthat nonzero a1 is essential to describe the experimental observations, discussed in the next\nsection. The phases φb1 and φa1 need to be either 0 or π in order to avoid mixing between\nthe real and complex components of S and thus provide a stable DM candidate, A, as we\ndesire. Defining a1 and b1 to be positive definite, we find that the phases must be φb1 = π\nand φa1 = 0 for viable phenomenology [51].\nIf the real component of the complex singlet obtains a vev, vS , the δ2 term in the potential\ninitiates mixing between H and S resulting in two Higgs particles with masses\n\n\nv\n!2\nu\n√\n√\n2 2a1 u\n1\n2 2a1\n\nMH2 1,2 = λv 2 + d2 vS2 −\n∓ t λv 2 − d2 vS2 +\n+ 4δ22 v 2 vS2  .\n4\nvS\nvS\n4\n\n(2)\n\n\fThe resulting coupling strengths of these Higgs eigenstates to the SM fermions and weak\nbosons are multiplied by the factors\ng Hi\nwhere the mixing angle is given by\n\n\n cos φ for H\n1\n=\n,\n − sin φ for H2\n\ntan 2φ =\n\n2δ2 vvS\nλv 2 − d2 vS2 +\n\n√\n2 2a1\nvS\n\n(3)\n\n.\n\n(4)\n\nThe remaining complex term in V leads to a scalar field A that is stable and is thus the DM\ncandidate. The mass of the DM particle is determined by the parameters b1 and a1\n√\n2a1\n2\nMA = b1 −\n.\nvS\nIII.\n\n(5)\n\nCONSTRAINTS\n\nThe CSM potential [Eq. 1] has six free parameters: the SM-Higgs quartic coupling λ,\nthe complex singlet quartic coupling d2 , the quartic interaction between the SM-Higgs and\ncomplex singlet δ2 , the vev of the real component of the complex singlet vS , and the DM\nmass parameters b1 and a1 . The m2 parameter in Eq. 1 is determined in terms of the other\nparameters by the minimization conditions of the potential.\nWe take the quartic couplings to be O(1) for perturbativity and we allow the singlet vev\nto be as large as 1 TeV. We scan uniformly over the following ranges:\n7 GeV < MA < 1000 GeV,\n√\nMA < b1 < 10MA ,\n0 <\n\nλ\n\n√\n\n(7)\n\n< 2,\n\n(8)\n\n−2 < δ2 < 2,\n\n(9)\n\n0 < d2 < 4,\n\n(10)\n\n10 GeV < vS < 1000 GeV,\nNote that the range of\n\n(6)\n\n(11)\n\n2a1 /vS is determined by the ranges of MA and b1 . Additionally,\n\neach parameter set is required to have\nMH2 i > 0,\n5\n\n(12)\n\n\fas having a stable global vacuum demands [51].\nRelic Density – We require the DM candidate to fully saturate the relic abundance of\nthermal DM within a 2σ range of the value measured by the WMAP experiment [1]:\n0.098 < ΩA h2 < 0.122\n\n(13)\n\nThis is a very restrictive condition but we find that it can be satisfied in conjunction with\n\n\u0001\u0001 \u0001 \u0001 \u0001\n\nthe DM experimental constraints. There are also multiple solutions with an under saturated\nDM density, which could be relevant if there is another DM contributor (such as the axion),\nor over saturated, which is possible in nonstandard cosmologies, such as a very low reheating\ntemperature or extra entropy injection caused by late decays [61–65].\nf\n\nA\n\nA\n\nH1 2\n\nH1 2\n\n;\n\n;\n\nf\n\nA\n\nH1 2\n\nA\n\nH1 2\n\n;\n\nA\n\nH1 2\n\nA\n\n;\n\n;\n\nH1 2\n;\n\nA\n\nA\n\nH1 2\n;\n\nA\n\nH1 2\n;\n\nA\n\nV\n\nH1 2\n;\n\nA\n\nV\n\nFIG. 1: Feynman diagrams that contribute to the annihilation cross setion of A. All processes are\nmediated via the two Higgs eigenstates H1,2 .\n\nThe Feynman diagrams associated with DM annihilation are given in Fig. 1. As noted\npreviously, the only communication between the DM and SM is through the Higgs mass\neigenstates. In the putative DM mass region inferred by CoGeNT, is AA → bb̄, since the\nb-quark is the heaviest kinematically accessible fermion to which the virtual Higgs couples.\nFor a DM mass that is below the threshold of the bb̄ channel, the DM annihilates to cc̄\nand τ + τ − final states. Occasionally, H1 is light enough that the AA → H1 H1 channel may\ncontribute to the relic abundance. To calculate the relic density, we utilize the micrOMEGAs\nsoftware package [66, 67].\nLEP data – The OPAL collaboration [68] has placed constraints on the production of scalar\nparticles in the Z-Higgs-strahlung process, independent of their decay modes, expressed in\nterms of bounds on a quantity ki defined as\nki =\n\nσ(e+ e− → ZHi )\n.\nσ(e+ e− → ZhSM )\n6\n\n(14)\n\n\fIt is possible to have Higgs eigenstates that are lighter than the LEP limit of 114 GeV on\nthe SM-Higgs mass, since the mixing between the SM-Higgs and scalar singlet field reduces\nthe couplings. We impose the LEP bounds, that exclude a SM-Higgs boson of mass 12 − 114\nGeV [69], to both ZZHi couplings. In addition, the combined LEP data place upper bounds\non the quantities ξi2 defined as\nξi2 = ki × BF(Hi → SM).\n\n(15)\n\nBecause of the mixing of the SM-Higgs with the real component of the complex singlet and\npossible new Higgs decay modes to DM particles, the Higgs masses can be lower than the\nLEP bound on the SM-Higgs mass, depending on the mixing: For an illustration of this, see\nFig. 6c. In addition to the limit on the standard search modes, we apply the DELPHI [70]\nand combined LEP [71] limit on the invisible decay of a Higgs state, where a SM-Higgs\nboson must have mass mH > 114 GeV for ξi2 = 1.\nHiggs Cascade Decays – With the two Higgs mass eigenstates in the CSM, there is the\npossibility of cascade decays, i.e. H2 → H1 H1 → f f ̄f ′ f ̄′ . Such decay chains have been\n\nconsidered in the context of bb̄ + bb̄ and bb̄ + τ + τ − [40, 43, 72–75]. These decay channels\n\nare also constrained by the decay-independent bounds obtained by OPAL from Z-boson\nrecoils [68].\nThe Higgs cascade decay cross sections, relative to the total SM Z-Higgs-strahlung cross\nsection, are given by\nCbb̄+bb̄ = ki × BF(H2 → H1 H1 ) × BF(H1 → bb̄)2\nCτ + τ − +τ + τ − = ki × BF(H2 → H1 H1 ) × BF(H1 → τ + τ − )2\nCbb̄+τ + τ − = 2ki × BF(H2 → H1 H1 ) × BF(H1 → τ + τ − ) × BF(H1 → bb̄).\n\n(16)\n(17)\n(18)\n\nThe LEP collaboration has placed upper limits on these quantities. The bb̄ + bb̄ channel\nis limited to Cbb̄+bb̄ < 0.2 for masses MH2 . 85 GeV, while for MH2 ≈ 105 GeV, the limit\n\nrelaxes to Cbb̄+bb̄ < 0.4 1 . The bb̄ + τ + τ − modes are limited to be Cbb̄+τ + τ − < 0.4 for\nmasses MH2 . 85 GeV while Cbb̄+τ + τ − can be as large as unity for masses MH2 & 105\nGeV. In addition, we include the limits on the τ + τ − + τ + τ − decays from the ALEPH\ncollaboration: Cτ + τ − +τ + τ − > 1 for values of MH2 > 107 GeV and 4 GeV < MH1 < 10 GeV\n1\n\nIn our scans, we typically find MH2 & 110 GeV after all other constraints are applied.\n\n7\n\n\fat the 95% C.L. [76]. In our scans, we rarely find values exceeding Cbb̄+τ + τ − = 0.12 and\nCτ + τ − +τ + τ − = 0.1. Therefore, the bb̄ + τ + τ − and τ + τ − + τ + τ − constraints are not very\neffective in excluding parameter regions.\nElectroweak Precision Observables (EWPO) – The constraints from EWPO require\nthat the mass of a SM-like Higgs must be bounded by Mh . 180 GeV. In the CSM this\napplies to the mass of the heavier Higgs eigenstate [77].\nσSI Measurements – The Feynman diagrams associated with the spin-independent scattering cross section are shown in Fig. 2. For the CSM, the spin-independent scattering cross\nsection of DM on a proton target is\n\u0012\n\u00132 \u0012\n\u00132\nm4p\n2\ngAAH1 gH1 gAAH2 gH2\nσSI =\n+\nfpu + fpd + fps + (3fG ) ,\n2πv 2 (mp + MA )2\nMH2 1\nMH2 2\n27\n\n\u0001\u0001\n\n(19)\n\nwhere mp is the proton mass and v = 246 GeV is the SM-Higgs vev. The couplings between\nA\n\nA\n\nA\n\nA\n\nH1,2\n\nH1,2\n\nq\n\nq\n\nq\n\ng\n\ng\n\nFIG. 2: Feynman diagrams associated with the spin-independent direct detection of A. As in\nannihilations, the Higgs bosons are the mediating fields between the DM and the nuclear target.\n\nthe DM particles and the Higgs eigenstates can be written as\ngAAH1 = (δ2 v cos φ + d2 vS sin φ) /2,\n\n(20)\n\ngAAH2 = (d2 vS cos φ − δ2 v sin φ) /2.\n\n(21)\n\nThe strengths of the hadronic matrix elements, f , have the central values [78]\nfpu = 0.02,\n\nfpd = 0.026,\n\nfps = 0.118,\n\nfG = 0.836.\n\n(22)\n\nThe cross sections calculated using Eq. 19 agree with those calculated by micrOMEGAs [66,\n67]. We do not consider uncertainties on the hadronic matrix elements in our analyses,\nas is the standard practice. In general, the variation of these values can shift the overall\nscattering rate by roughly ±30% [79].\n8\n\n\fThe expression for the SI cross section can be simplified to\nσSI\n\nm4p\n=\n2π(mp + MA )2\n\n\u0012\n\nδ2 (b1 − MA2 )\n2MH2 1 MH2 2\n\n\u00132 \u0012\n\u00132\n2\nfpu + fpd + fps + (3fG ) .\n27\n\n(23)\n\nWe note that σSI vanishes in the limits δ2 → 0 or b1 → MA2 . In terms of representative\nmasses and parameters, the cross section is\n−5\n\nσSI ≈ 1.5 × 10 pb\n\n\u0012\n\n100 GeV\nMH1\n\n\u00134 \u0012\n\n100 GeV\nMH2\n\n\u00134 \u0012\n\nδ2 (b1 − MA2 )\n103 GeV2\n\n\u00132\n\n.\n\n(24)\n\nIn our subsequent CSM study, we separately consider the CoGeNT signal region , the\nDAMA/LIBRA signal region, and the XENON100 exclusion region.\n\nIV.\n\nCONSISTENCY WITH σSI MEASUREMENTS\n\nWe can correlate the σSI signal with the scalar mass patterns in the CSM. Mass ranges\nthat give rise to characteristic phenomenological features are\n(i) MH1 < MA .–the annihilation AA → H1 H1 is efficient enough to saturate the relic\ndensity. These points are denoted by black crosses in the figures.\n(ii) MA < MH1 < 2MA .–here 2MA is just above the H1 resonance and below the H1 H1\nthreshold, for nonrelativistic A (closed red circles). With additional thermal energy\nof the A in the early universe, the AA → H1 H1 mode may be open for MA . MH1 .\n(iii) MH1 > 2MA .–the A mass is just below the H1 resonance, hereafter denoted by open\nblue boxes.\nIn Fig. 3, we present the ranges of MA and σSI after all other constraints are applied.\nThe CoGeNT signal region at 90% C.L. is denoted by the solid (black) bounding curve.\nThe DAMA/LIBRA signal region with channeling effects is within the bold dash-dotted\n(black) boundary while the signal region without channeling effects is enclosed within the\ndotted (green) boundary. The 90% exclusion region from XENON100 (4 PE) is denoted\nby the dashed (black) curve. The CSM points correspond to MH1 < MA : crosses (black),\nMA < MH1 < 2MA filled circles (red), and MH1 > 2MA MH1 > 2MA .\nWe see that the CSM points populate the low MA part of the CoGeNT region.\n\n9\n\n\fOnly a few points are consistent with the DAMA/LIBRA region without channeling.\nOne group of points lies along the lower DAMA/LIBRA boundary at MA ∼ 30 GeV, which\nis consistent with XENON100. The other lies at MA ∼ 7 GeV, for which the phenomenology will be similar to that of the CoGeNT region; therefore, we do not explicitly list these\npoints but note the conclusions are similar to those obtained from analysis of the CoGeNT\nregion, except that the SI cross section is slightly higher. More model points in these two\nDAMA/LIBRA consistent regions could be realized if the uncertainties discussed earlier in\nthe calculated cross sections were taken into consideration. The XENON100 limit convincingly excludes the DAMA/LIBRA consistent unchanneled region at MA ∼ 30 GeV, but it\nallows a wide mass range from 10 GeV to the TeV scale. In our more detailed considerations\nbelow we focus our discussion on the CoGeNT region at MA ∼ 10 GeV and the region that\nis not excluded by XENON100. A portion of the channeled DAMA/LIBRA allowed region\nis consistent with the XENON100 exclusion. We note that the channeling calculations are\n10\n10\n\n-39\n\n-40\n\n2\n\nσSI (cm )\n\n10\n10\n\n-41\n\n-42\n\n10\n10\n\nCoGeNT\nXENON100\nDAMA\nDAMA (w/ channeling)\n\n-43\n\n-44\n\n10\n10\n\n-45\n\n-46\n\n10\n\n100\n\nMA (GeV)\n\nFIG. 3: Range of MA and σSI values. The 90% C.L. boundary of the CoGeNT signal region\nis denoted by the solid (black) contour. The signal region of the DAMA/LIBRA data, with no\nchanneling effects, is enclosed by a dotted (green) contour. The XENON100 exclusion limit is\ngiven by the short-dashed (black) boundary. The DAMA/LIBRA region with channeling is shown\nby the bold dash-dotted (black) contour. All contours are shown at the 90% C.L. The measured\nrelic density can be saturated below the H1 resonance (open blue boxes), above the H1 resonance\n(filled red circles), with the AA → H1 H1 channel open during freeze-out (black crosses).\n\n10\n\n\fbased on complex modeling, so it is possible that the real situation could lie between the\nunchanneled and channeled regions shown in Fig. 3. Therefore, small channeling effects\nwould improve the agreement of the DAMA/LIBRA data with the model.\n\n100\n\n100\n\n10\n\n10\n\nΩA h\n\nΩA h\n\n2\n\n1000\n\n2\n\n1000\n\n1\n\n1\n\n0.1\n\n0.1\n\n0.01\n\n0.01\n\n0.001\n\n0\n\n20\n\n40\n\n60\nMH (GeV)\n\n80\n\n100\n\n0.001\n\n0\n\n20\n\n1\n\n40\n\n60\nMH (GeV)\n\n80\n\n100\n\n120\n\n1\n\n(a)\n\n(b)\n\nFIG. 4: Relic abundance of A versus the H1 mass with MH2 = 120 GeV and a H1 SM-Higgs content\nof 10−4 in (a) the CoGeNT region with MA = 10 GeV and (b) XENON100 exclusion region with\nMA = 50 GeV. The measured relic density can be saturated below the H1 resonance (blue open\nboxes), above the H1 resonance (red filled circles), with the AA → H1 H1 channel open during\nfreeze-out (black crosses). This color notation is respected in subsequent figures unless otherwise\nnoted.\n\nIn Fig. 4, for a DM mass of MA = 10 GeV, representative of CoGeNT and DAMA/LIBRA,\nand a H1 SM-Higgs content of 10−4 we identify the light Higgs masses for which DM annihilation reproduces the observed DM relic density. There are a variety of ways in which\nthe relic density may be satisfied and fall into the three categories outlined above. When\nMA < MH1 < 2MA , there are two possible ways to saturate the relic density: above the\nAA → H1 resonance, shown as the right branch of case (ii), or above the AA → H1 H1\nthreshold. When DM annihilates above the H1 pair threshold, the thermal energy in the\nearly universe is large enough to open that channel which would otherwise be closed in the\nvann → 0 limit. In Fig. 4b, we show the results for MA = 50 GeV, the DM mass for which\nXENON100 is most sensitive. Generally, these regions may be shifted down in cross section\nas the values of the SM-Higgs content of the H1 state increases.\n\n11\n\n\f160\n\n160\n\nMH (GeV)\n\n180\n\n140\n\n140\n\n2\n\n2\n\nMH (GeV)\n\n180\n\n120\n\n100\n\n120\n\n0\n\n10\n\n20\n\n30\n40\nMH (GeV)\n\n50\n\n60\n\n70\n\n1\n\n100\n\n0\n\n25\n\n50\n\n100\n75\nMH (GeV)\n\n125\n\n150\n\n175\n\n1\n\n(a)\n\n(b)\n\nFIG. 5: Mass of the heavy Higgs versus that of the light Higgs for (a) CoGeNT 90% C.L. signal\nregion and (b) XENON100 allowed region. The AA annihilation takes place above (below) the H1\nresonance for the blue boxes (red circles).\n\nWith all of the aforementioned constraints applied to our parameter scan, we find that\nin the CoGeNT case there are no points with MH1 < MA that survive all of the constraints.\nThe mass ranges of the light Higgs are 9 − 15 GeV and 30 − 65 GeV, depending on which\nside of the H1 resonance the A state lies. The mass of the heavy Higgs is 110 − 180 GeV:\nsee Fig. 5. The upper bound on the light Higgs mass corresponds to the upper bound on\nthe relic density. If MH is significantly greater than twice the DM mass, the AA → f f ̄\n1\n\nannihilation cross section is suppressed by m2f /MH4 1 , producing an over abundance of relic\nDM.\nBecause of the mixing of the SM-Higgs field and the singlet field, the H2 mass may be\nbelow the SM-Higgs limit given by LEP. Therefore, any Higgs states with masses much\nbelow the 114 GeV LEP limit are dominantly singlet. This can be easily seen in Fig. 6. The\nCoGeNT consistent cases (top panels) give a light singlet due to the relic density constraint,\n\nforcing the heavier state to be SM-like. In the XENON100 cases (bottom panels), there is\nno such restriction, allowing both mass states to have a relatively free SM-Higgs component.\nThe abrupt shifts in the limit of the SM-Higgs content are caused by the endpoint of the\nconstraining data as indicated.\nFinally, using Eq. 19, we obtain the results in Fig. 7 after all the constraints are imposed.\nWe find that points with MH1 > 2MA prefer smaller MA in order to satisfy the CoGeNT\n12\n\n\f0\n\n10\n\n20\n\n30\n\n40\n\nSM Higgs content\n\n0.2\n\n0\n\n1\n\nDELPHI H1-> inv. Limit\n\nLEP ZZh Limit\n\nSM Higgs content\n\n0.4\n\n50\n\n60\n\n0.8\n\n0.6\n100\n\n70\n\n120\n\nMH (GeV)\n\n180\n\n0.8\n\n1\n\n0.4\n\n0.2\n\n0\n\n160\n\n(b)\n\nSM Higgs content\n\n0.6\n\n180\n\n1\n\nMH = 114 GeV\n\nDELPHI H1-> inv. Limit\n\nLEP ZZh Limit\n\nSM Higgs content\n\n0.8\n\n160\n\n2\n\n(a)\n1\n\n140\n\nMH (GeV)\n\n1\n\n0.6\n\n0.4\n\n0.2\n\n0\n\n25\n\n50\n\n100\n\n75\n\n125\n\n150\n\n175\n\n0\n100\n\n120\n\nMH (GeV)\n\n140\n\nMH (GeV)\n\n1\n\n2\n\n(c)\n\n(d)\n\nFIG. 6: The SM-Higgs probability content of the Higgs eigenstates consistent with the CoGeNT\ndata (a-b) and XENON100 data (c-d). Lighter Higgs bosons are dominantly singlet, largely due\nto the LEP ZZHi mixing constraints. For larger H1 masses the AA decay is kinematically allowed\nand this diminishes the branching fraction of H1 to SM channels\n\nbounds and the observed WMAP relic density while the points where MA < MH1 < 2MA\npopulate a larger area of the CoGeNT boundary. Generally, with the light Higgs mass\nrelatively small (9 − 15 GeV), there is more freedom in the range of the spin-independent\nscattering cross section: see Eq. 24 and Fig. 5. The XENON100 90% C.L. consistent regions\npossess a continuum of H1 pole solutions from the lower limit to ∼ 90 − 110 GeV due to\nthe maximum value of the Higgs boson masses by EWPO constraints. Above this H1 pole\nwall, the AA → H1 H1 channels are open, generally providing a scattering cross section that\nis well below the XENON100 exclusion limit.\n\n13\n\n\f10\n\n10\n\n-39\n\nXENON100\n\nCoGeNT\nXENON100\n\n10\n\n-40\n\n-40\n\n2\n\n2\n\nσSI (cm )\n\nσSI (cm )\n\n10\n10\n\n-42\n\n10\n10\n\n-41\n\n6\n\n8\n\n10\n\n12\n\n-43\n\n-44\n\n10\n10\n\n-41\n\n10\n\n-45\n\n-46\n\n10\n\n100\n\nMA (GeV)\n\nMA (GeV)\n\n(a)\n\n(b)\n\nFIG. 7: SI cross section versus the DM mass in the CSM model within (a) the 90% C.L. boundary\nof the CoGeNT region with the XENON100 90% C.L. exclusion overlain and (b) the XENON100\nallowed region, see the text for details. All model points satisfy the measured WMAP relic abundance.\n\nFor comparison, we superimpose the 90% C.L. XENON100 exclusion limit with 4 PE on\ntop of the 90% C.L. CoGeNT region. The lower left region is in best agreement with the\nXENON100 limit. It is also in this region that we find the best agreement with the CSM.\n\nV.\n\nHIGGS SIGNATURES\n\nThe imposition of the DM relic density constraint and the CoGeNT constraint on the\nDM scattering cross section allow firm predictions to be made about the Higgs sector of this\nmodel. The mass configurations of the three scalar states largely determine the dominant\ndecay modes of the SM-like H2 state.\nIn Fig. 8, we show the A mass versus the H1 mass after all constraints are applied. Three\nregions which control the dominant annihilation process for AA → SM + SM that sets the\nrelic density become apparent. Below (boxes) the AA → H1 → SM + SM resonance, the\nrelic density constraint can be satisfied. Additionally, the AA → H1 H1 mode is open when\nMA > MH1 (crosses). Below the solid line, the H1 → AA mode is open and can be a source\nof 6 ET at hadron colliders. For all of the CoGeNT and many of the XENON100 cases,\nH2 → H1 H1 decays are kinematically accessible, possibly yielding a dominant decay mode\n14\n\n\f-> A\nA\nH\n\n1\n\n500\n\n400\n\nMA (GeV)\n\nMA (GeV)\n\nM =M\nA\n\nH1\n\n15\n\n10\n\n300\n\n200\n\n100\n\n5\n0\n\n10\n\n20\n\n30\n40\nMH (GeV)\n\n50\n\n60\n\n70\n\n0\n\n0\n\n1\n\n50\n\n100\nMH (GeV)\n\n150\n\n200\n\n1\n\n(a)\n\n(b)\n\nFIG. 8: DM mass versus the light Higgs mass for (a) the 90% C.L. boundary of the CoGeNT\nallowed region and (b) the XENON100 90% C.L. consistent region. The H1 → AA decay mode is\nopen and dominant for MA < 21 MH1 (blue open boxes).\n\nof the H2 Higgs boson.\nOverall, there are three main decay processes connected with the Higgs mass spectra as\nfollows 2 :\n(i) Large decay rates of H2 → SM-modes. Predominantly, these modes are W + W − and\n2\nZZ due to the rapid growth of these partial widths with the Higgs mass, Γ ∼ MH3 2 /MW\n.\n\nWhen the W + W − mode is fully open, MH2 > 2MW , the SM width increases rapidly\n\nwith MH2 and it is comparable to or dominates over the nonstandard decays. The\neffective production rates of the typical SM modes through the SM-like Higgs boson,\nH2 , are shown in Fig. 9 for the CoGeNT DM region and Fig. 10 for the XENON100\nexclusion region. For both regions, we see a reduction from the SM branching fraction.\nFor the CoGeNT region, this is primarily due to the other decay modes listed below\nthat compete with the SM decay modes, while for the XENON100 region, the significant singlet content of the H2 state can provide an additional level of suppression.\nIn addition, the XENON100 region may have a SM-like Higgs that cannot decay to\na singlet state that can have a larger mass than in the CoGeNT case, allowing the\n2\n\nIn some cases a H2 → 3H1 decay is kinematically allowed. Because of the small coupling and phase space\nsuppression this mode will not be a dominant decay mode\n\n15\n\n\fbranching fraction to be closer to the SM expectation.\n0.01\n\nhSM->bb\n\nσ(H2)/σ(hSM) x BF(H2->γγ)\n\nσ(H2)/σ(hSM) x BF(H2->bb)\n\n1\n\n0.1\n\n0.01\n100\n\n120\n\n140\n\n160\n\nhSM->γγ\n\n0.001\n\n0.0001\n\n1e-05\n\n180\n\n100\n\n120\n\n140\n\nMH (GeV)\n\n(b)\n\n1\n\n1\n\nhSM->WW\n\nσ(H2)/σ(hSM) x BF(H2->ZZ)\n\nσ(H2)/σ(hSM) x BF(H2->WW)\n\n180\n\n2\n\n(a)\n\n0.1\n\n0.01\n100\n\n160\n\nMH (GeV)\n\n2\n\n120\n\n140\n\n160\n\n180\n\nMH (GeV)\n\nhSM->ZZ\n\n0.1\n\n0.01\n100\n\n120\n\n140\n\n160\n\n180\n\nMH (GeV)\n\n2\n\n2\n\n(c)\n\n(d)\n\nFIG. 9: Effective production rates of a (a) bb̄, (b) γγ, (c) W + W − , and (d) ZZ through the heavy\nHiggs boson versus its mass for the 90% C.L. CoGeNT allowed region. Suppression with respect\nto the SM expectation can largely be obtained via competing decay modes H2 → H1 H1 and\nH2 → AA. Recent Tevatron exclusion limits on H → W + W − are beginning to impact a large\nW W branching fraction in the Higgs mass range 160 − 200 GeV [80].\n\n(ii) Large decay rates of H2 → AA, with A undetected, will give a large missing energy in\ncollider events. Higgs production via vector-boson fusion (VBF) followed by a Higgs\ndecay to AA may be cleanly extracted from the background of QCD and electroweak\nW ± , Z + jj production [81]. In addition, it may be possible to observe an invisible\n√\nHiggs via the Z-Higgs-strahlung channel [82]. With 30 fb−1 and s = 14 TeV, ATLAS\nis expected to probe, at the 5σ level, the invisible branching fraction of a Higgs boson\n16\n\n\f0.01\n\nhSM->bb\n\nσ(H2)/σ(hSM) x BF(H2->γγ)\n\nσ(H2)/σ(hSM) x BF(H2->bb)\n\n1\n\n0.1\n\n0.01\n100\n\n120\n\n140\n\n160\n\nhSM->γγ\n\n0.001\n\n0.0001\n\n1e-05\n\n100\n\n180\n\n150\n\nMH (GeV)\n\nMH (GeV)\n\n2\n\n2\n\n(a)\n\n(b)\n1\n\nhSM->WW\n\nσ(H2)/σ(hSM) x BF(H2->ZZ)\n\nσ(H2)/σ(hSM) x BF(H2->WW)\n\n1\n\n0.1\n\n0.01\n100\n\n120\n\n140\n\n160\n\n180\n\nMH (GeV)\n\nhSM->ZZ\n\n0.1\n\n0.01\n100\n\n120\n\n140\n\n160\n\n180\n\nMH (GeV)\n\n2\n\n2\n\n(c)\n\n(d)\n\nFIG. 10: Effective production rates of a (a) bb̄, (b) γγ, (c) W + W − , and (d) ZZ through the heavy\nHiggs boson versus its mass for the XENON100 90% C.L. consistent region. Suppression with\nrespect to the SM expectations are caused by the singlet scalar-Higgs mixing and the competing\ndecay modes H2 → H1 H1 and H2 → AA.\n\nwith SM-strength couplings down to 25% − 30% for the relevant H2 mass range [83].\nThe invisible branching fraction of H2 decay in the CSM can be nearly 100%, as shown\nin Fig. 11a. Often, this branching is near 50%, comparable to the cascade decay\ndiscussed below, allowing ATLAS to probe most of the region allowed by CoGeNT.\nFor XENON100, the invisible branching ratio of H2 can have more of a range, but is\nalso expected to be well covered by the ATLAS analysis, see Fig. 12a.\n(iii) Large decay rates of H2 → H1 H1 : This generic class of decays has been studied\nin the context of the NMSSM [40, 43, 72, 75] and Little Higgs models [74, 84]. In\n17\n\n\f1\n\nσ(H2)/σ(hSM) x BF(H2 -> 4b)\n\nσ(H2)/σ(hSM) x BF(H2 -> inv)\n\n1\n\n0.1\n\n-1\n\nATLAS inv. BF reach (10 fb )\n-1\n\nATLAS inv. BF reach (30 fb )\n\n0.01\n100\n\n120\n\n140\n\n160\n\n0.1\n\n0.01\n100\n\n180\n\n120\n\nMH (GeV)\n2\n\n180\n\n160\n\n180\n\n(b)\n1\n\nσ(H2)/σ(hSM) x BF(H2 -> 4τ)\n\n1\n\nσ(H2)/σ(hSM) x BF(H2 -> bbττ)\n\n160\n\n2\n\n(a)\n\n0.1\n\n0.01\n100\n\n140\n\nMH (GeV)\n\n120\n\n140\n\n160\n\n180\n\nMH (GeV)\n\n0.1\n\n0.01\n100\n\n120\n\n140\n\nMH (GeV)\n\n2\n\n2\n\n(c)\n\n(d)\n\nFIG. 11: Effective production rates of (a) 6 ET , (b) bb̄bb̄, (c) bb̄τ + τ − , and (d) τ + τ − τ + τ − through\nthe H2 state for the 90% C.L. boundary of the CoGeNT allowed region.\n\naddition, model independent analyses of this mode have illustrated the sensitivity of\nthe Tevatron and the LHC experiments to these exotic decay modes [73, 74]. The\neffective production rates,\n\nσ(H2 )\nσ(hSM )\n\n× BF(H2 → 2H1 → 2X + 2Y ), are shown in Figs. 11\n\nand 12. Once produced, the H1 pair will subsequently decay into:\n• bb̄+bb̄ : This channel may be probed at hadron colliders [73]. At the Tevatron, the\n\nproduction signal is W ± , Z-Higgs-strahlung, which may yield a few events that\nare almost background free. Therefore, detection of this mode is statistics limited.\nThe LHC also has sensitivity to this channel even though the QCD backgrounds\nare much larger there. For the CoGeNT [Fig. 11b] and XENON100 [Fig. 12b],\nthese branching fractions can be as large as 40%. This value is just slightly below\n\n18\n\n\f1\n\nσ(H2)/σ(hSM) x BF(H2 -> 4b)\n\nσ(H2)/σ(hSM) x BF(H2 -> inv)\n\n1\n\n0.1\n\n-1\n\nATLAS inv. BF reach (10 fb )\n-1\n\nATLAS inv. BF reach (30 fb )\n\n0.01\n\n100\n\n120\n\n140\n\n160\n\n0.1\n\n0.01\n100\n\n180\n\n120\n\nMH (GeV)\n2\n\n180\n\n160\n\n180\n\n(b)\n\n1\n\n1\n\nσ(H2)/σ(hSM) x BF(H2 -> 4τ)\n\nσ(H2)/σ(hSM) x BF(H2 -> bbττ)\n\n160\n\n2\n\n(a)\n\n0.1\n\n0.01\n100\n\n140\n\nMH (GeV)\n\n120\n\n140\n\n160\n\n180\n\n0.1\n\n0.01\n\n0.001\n\n100\n\nMH (GeV)\n\n120\n\n140\n\nMH (GeV)\n\n2\n\n2\n\n(c)\n\n(d)\n\nFIG. 12: Effective production rates of (a) 6 ET , (b) bb̄bb̄, (c) bb̄τ + τ − , and (d) τ + τ − τ + τ − through\nthe H2 state for the XENON100 90% C.L. consistent region.\n\nthe benchmark case analyzed in [73], where k2 × BF(H2 → H1 H1 ) × BF(H1 →\n\nbb̄)2 = 0.5, assuming a SM-like H2 . In that benchmark scenario, with MH2 = 120\n\nGeV and MH1 = 30 GeV, 5σ discovery could be achieved at the LHC at 14 TeV\nwith less than 30 fb−1 of integrated luminosity. The tagging of soft b-quarks is\ncrucial.\n• bb̄ + τ + τ − : This mode may also be probed at the Tevatron. For the CoGeNT\n[Fig. 11c] and XENON100 [Fig. 12c] regions, the branching fractions can be\nup to 10% which is slightly above the benchmark case analyzed in [73], where\n2 × k2 × BF(H2 → H1 H1 ) × BF(H1 → bb̄) × BF(H1 → τ + τ − ) = 0.088, resulting\nin a rate of about 0.3 fb. Therefore, this channel is severely statistics limited.\nAt the LHC, the reducible background is problematic and excellent jet rejection\n19\n\n\fwould be needed [73].\n• τ + τ − + τ + τ − : This mode can be large when the H1 → bb̄ mode is kinematically\nsuppressed. The CSM branching fractions of this mode for the CoGeNT [Fig. 11d]\nand XENON100 [Fig. 12d] regions can be up to about 5%. Searches through the\nVBF production of H2 with semileptonic and hadronic decays of the τ final states\nto μ± and jets can be probed at the LHC [85, 86], while the Tevatron may also\nsee an excess in multilepton events with a light H2 [87].\n• bb̄+ 6 ET : The branching fraction of this mode is smaller than 1% for both\nCoGeNT and XENON100. In addition, the soft b-quarks may make it difficult to\nextract the signal from QCD backgrounds. Because of the 6 ET , full reconstruction\nof the H2 mass is lost using traditional methods. Therefore, this decay mode does\nnot look promising at hadron colliders.\n• τ + τ − + 6 ET : The branching fraction of this mode is smaller than 0.1% for both\nCoGeNT and XENON100. This channel yelds soft τ -leptons. The decays of the\nτ -leptons yield one additional 6 ET component that will be back to back to the\n6 ET from the H1 → AA decay. Since the 6 ET should be softer than in the bb̄+ 6 ET\nmode, this decay mode is not promising at hadron colliders.\n• 6 ET : This mode is equivalent to the above H2 → AA invisible decay mode, but\neach H1 state decays to AA and shown as the red circles in Fig. 11a for CoGeNT\nand Fig. 12a for XENON100 . Therefore, the VBF channel for detecting H to\n6 ET is applicable.\nThere is strong competition between the purely invisible H2 → AA and the cascade\ndecay H2 → H1 H1 , presented as the partial widths of these two decay modes in Fig. 13.\nOften, the couplings gH2 AA and gH2 H1 H1 are nearly equivalent when there is a large singlet\ncontent of the H1 , providing roughly the same partial widths. Because of these effects, both\nlarge missing energy signatures and Higgs cascade decays can be realized in the same model\nparameter space when these modes are kinematically accessible.\n\n20\n\n\f2\n\n1.5\n\nΓ(H2 -> AA) (GeV)\n\nΓ(H2 -> AA) (GeV)\n\n2\n\n1\n\n1\n\n0.5\n\n0\n\n0\n\n1\nΓ(H2 -> H1H1) (GeV)\n\n2\n\n0\n\n0\n\n0.5\n\n(a)\n\n1\nΓ(H2 -> H1H1) (GeV)\n\n2\n\n1.5\n\n(b)\n\nFIG. 13: The H2 → AA partial width versus the H2 → H1 H1 partial width for (a) the 90% C.L.\nboundary of the CoGeNT allowed region and (b) the XENON100 90% C.L. consistent region. Both\ncan simultaneously be large, providing a dual signature of invisible and cascade Higgs decays.\n\nA.\n\nElectroweak Phase Transition\n\nThe CSM can also provide a strong first order electroweak phase transition (EWPT) in\nthe early universe that is required for electroweak baryogenesis [51, 88]. In order to prevent\nthe washout of the baryon asymmetry produced during the phase transition, the inequality\nv(TC )\n& 1.\nTC\n\n(25)\n\nmust be satisfied. Here TC is the phase transtion critical temperature and v(T ) is the SU(2)L\nvev at temperature T . It has been shown that to satisfy this inequality, one requires a value\nof δ2 that is negative and with a singlet vev vS . 100 GeV [51].\nIn Fig. 14, we show the correlation between δ2 and vS after all constraints are applied.\nThe model can naturally provide an EWPT regardless of whether we restrict ourselves to\nthe CoGeNT or XENON100 regions. Because of the CoGeNT preference for low DM mass,\nthe singlet vev is required to be relatively small, yielding EWPT more easily. We focus\non the region satisfying the EWPT requirements, which is within the black box. We find\nthat the sign of δ2 has little effect on many observables such as relic density and Higgs\nproduction. The effect of flipping this sign may be noticeable in the interference terms of\nAA → Hi Hj [51]. Establishing EWPT in this model requires measurement of the couplings\n21\n\n\f1\n\n1\n0.5\n\nδ2\n\n0.5\n\nδ2\n\n0\n\n0\n\n-0.5\n-0.5\n\n-1\n0\n\n50\n\n100\n\n150\n\n200\n250\nvS (GeV)\n\n300\n\n350\n\n400\n\n-1\n0\n\n200\n\n400\n\n600\n\n800\n\n1000\n\nvS (GeV)\n\n(a)\n\n(b)\n\nFIG. 14: Values of δ2 versus vS for (a) the 90% C.L. boundary of the CoGeNT allowed region and\n(b) the XENON100 90% C.L. consistent region. The region within the black box can be consistent\nwith an EWPT required for electroweak baryogenesis.\n\nin the scalar potential in Eq. 1 that give rise to the first order phase transition.\n\nVI.\n\nCONCLUSIONS\n\nWe have explored the viability of the complex scalar singlet model (CSM) as an explanation of the CoGeNT and DAMA/LIBRA DM signals without channeling effects and the\nnonexcluded XENON100 region. The model has a DM particle that has Higgs-only interactions with the SM fields. There is also an additional real scalar field that mixes with the\nSM-Higgs field. The light Higgs boson must be dominantly singlet to reproduce the WMAP\nrelic density measurement with thermal DM production in the early Universe. The DM particle can have a scattering cross section that is within the CoGeNT and XENON100 regions\nand satisfies the relic abundance observed by WMAP, the LEP limits on the ZZHi mixing,\nand on the cascade decays of the H2 to H1 pairs to bb̄ + bb̄, bb̄ + τ + τ − , and τ + τ − + τ + τ − ,\nthe OPAL limit on generic Higgs production, and EWPO constraints.\nFor the CoGeNT, DAMA/LIBRA, and XENON100 allowed regions, we find\n• The complex singlet extended standard model has the attractive feature that the DM\nmass can range from a few GeV to a few TeV with a thermal relic density as observed\nby WMAP. It can also be consistent with experimental constraints on a low mass\n22\n\n\fHiggs boson.\n• Given a mass of A of about 10 GeV from the putative CoGeNT DM signal, the H1\nmass is predicted to lie in the ranges 9 to 15 GeV or 30 to 70 GeV, depending on\nwhich side of the H1 annihilation resonance the A state lies. We also find the H2 has a\nmass between 110 to 180 GeV with the lower and upper bound arising from the LEP\nZZH2 and EWPO constraints, respectively. To also be consistent with the CoGeNT\nand DAMA/LIBRA DM signal, the DM mass is restricted to the ∼ 7 GeV region, for\nwhich the SI cross section is ∼ 10−40 cm2 [89]. In our scans, we find only a few points\nthat fall within the DAMA/LIBRA allowed region.\n• Since A is stable, the decays of H2 to AA result in large missing energy. This invisible\ndecay mode can be probed at the LHC via weak boson fusion and provide a robust\ntest of the model. Alternatively, the H2 can decay to W W and ZZ with sufficiently\nlarge branching fractions as to allow their detection at the LHC.\n• The decays of H2 to H1 H1 , followed by the decays of H1 to SM particles, can be\nprobed at the LHC through the 4b, 4τ , and 2b + 2τ channels. Alternatively, when the\nH1 decays to AA, it contributes to the missing energy. See Figs. 8, 9, 10, 11 and 12.\n• The lightest Higgs state may be lighter than the DM state, resulting in the annihilation\nmode AA → H1 H1 . Because of the low mass of H1 , the decay to bb̄ may be kinemati-\n\ncally suppressed, resulting in an enhanced branching to τ + τ − . This prediction can be\ntested by comparing the H2 → 2b + 2τ and H2 → 4τ branching fractions.\n\n• The SM-like H2 state can often decay to AA and to H1 H1 , with comparable partial\nwidths of the two modes, providing a dual missing energy and cascade decay signature\nat the LHC. See Fig. 13.\nIn summary, the complex scalar singlet model is an attractive explanation of the CoGeNT\ncandidate DM signal in that the model naturally accommodates light DM, the CoGeNT DM\nscattering cross section, and the WMAP DM relic density. A spin-independent cross section\nof 10−40 cm2 is consistent with both CoGeNT and DAMA/LIBRA data for a DM mass of\n∼ 7 GeV. Moreover, the model is testable at the LHC, especially via the qq ′ → qq ′ H2 →\nqq ′ 6 ET channel or via the cascade decay of the H2 to multiple b-jets or τ -leptons in the\n23\n\n\fq q̄ → W/Z + H2 channel. Such decay modes can dominate the standard hSM → W W/ZZ\nchannels. Even if the CoGeNT and DAMA/LIBRA signals should not be confirmed and\nthe XENON100 exclusion holds, the model remains viable, but its predictions for Higgs\nphenomenology become less specific.\n\nVII.\n\nACKNOWLEDGMENTS\n\nWe thank Juan Collar, Patrick Draper, Wai-Yee Keung, Jason Kumar, D. Hooper, Ian\nLow, Danny Marfatia, Uwe Oberlack, and Kathryn Zurek for helpful interactions and we\nthank Paul Langacker and Michael Ramsey-Musolf for earlier collaboration on the CSM.\nThis work was supported in part by the U.S. Department of Energy Division of High Energy\nPhysics under Grants No. DE-FG02-95ER40896, No. DE-FG02-05ER41361, No. DE-FG0208ER41531, No. DE-FG02-91ER40684 and Contract No. DE-AC02-06CH11357, by the\nWisconsin Alumni Research Foundation, and by the National Science Foundation Grant\nNo. PHY-0503584.\n\n[1] D. Larson et al., (2010), arXiv:1001.4635.\n[2] O. Adriani et al. (PAMELA Collaboration), Nature 458, 607 (2009).\n[3] A. A. Abdo et al. (The Fermi LAT Collaboration), Phys. Rev. Lett. 102, 181101 (2009).\n[4] F. Aharonian (H.E.S.S. Collaboration), Astron. Astrophys. 508, 561 (2009), arXiv:0905.0105.\n[5] A. A. Abdo et al., Phys. Rev. Lett. 104, 091302 (2010), arXiv:1001.4836.\n[6] V. D. Barger, F. Halzen, D. Hooper, and C. Kao, Phys. Rev. D65, 075022 (2002), arXiv:hepph/0105182.\n[7] M. Cirelli et al., Nucl. Phys. B727, 99 (2005), arXiv:hep-ph/0506298.\n[8] M. C. Gonzalez-Garcia, F. Halzen, and M. Maltoni,\n\nPhys. Rev. D71, 093010 (2005),\n\narXiv:hep-ph/0502223.\n[9] V. Barger, W.-Y. Keung, G. Shaughnessy, and A. Tregre, Phys. Rev. D76, 095008 (2007),\narXiv:0708.1325.\n[10] V. Barger, W.-Y. Keung, and G. Shaughnessy, Phys. Lett. B664, 190 (2008), arXiv:0709.3301.\n[11] Z. Ahmed et al. (The CDMS-II Collaboration), (2009), arXiv:0912.3592.\n\n24\n\n\f[12] A. Bottino, F. Donato, N. Fornengo, and S. Scopel, Phys. Rev. D81, 107302 (2010).\n[13] K. Cheung and T.-C. Yuan, Phys. Lett. B685, 182 (2010).\n[14] X.-G. He, T. Li, X.-Q. Li, J. Tandean, and H.-C. Tsai, Phys. Lett. B688, 332 (2010).\n[15] X.-G. He, S.-Y. Ho, J. Tandean, and H.-C. Tsai, (2010), arXiv:1004.3464.\n[16] R. Bernabei et al. (DAMA Collaboration), Eur. Phys. J. C56, 333 (2008).\n[17] A. Bottino, F. Donato, N. Fornengo, and S. Scopel, Phys. Rev. D78, 083520 (2008).\n[18] R. Bernabei et al., (2010), arXiv:1002.1028.\n[19] F. Petriello and K. M. Zurek, JHEP 09, 047 (2008).\n[20] C. Savage, G. Gelmini, P. Gondolo, and K. Freese, JCAP 0904, 010 (2009).\n[21] B. Feldstein, A. L. Fitzpatrick, E. Katz, and B. Tweedie, JCAP 1003, 029 (2010).\n[22] N. Bozorgnia, G. B. Gelmini, and P. Gondolo, (2010), arXiv:1006.3110.\n[23] C. E. Aalseth et al. (CoGeNT Collaboration), (2010), arXiv:1002.4703.\n[24] R. Essig, J. Kaplan, P. Schuster, and N. Toro, (2010), arXiv:1004.0691.\n[25] P. W. Graham, R. Harnik, S. Rajendran, and P. Saraswat, (2010), arXiv:1004.0937.\n[26] S. Andreas, T. Hambye, and M. H. G. Tytgat, JCAP 0810, 034 (2008).\n[27] S. Chang, J. Liu, A. Pierce, N. Weiner, and I. Yavin, (2010), arXiv:1004.0697.\n[28] S. Andreas, C. Arina, T. Hambye, F.-S. Ling, and M. H. G. Tytgat, (2010), arXiv:1003.2595.\n[29] A. L. Fitzpatrick, D. Hooper, and K. M. Zurek, (2010), arXiv:1003.0014.\n[30] D. B. Kaplan, Phys. Rev. Lett. 68, 741 (1992).\n[31] D. Hooper, J. March-Russell, and S. M. West, Phys. Lett. B605, 228 (2005).\n[32] G. R. Farrar and G. Zaharijas, Phys. Rev. Lett. 96, 041302 (2006).\n[33] R. Kitano, H. Murayama, and M. Ratz, Phys. Lett. B669, 145 (2008).\n[34] D. E. Kaplan, M. A. Luty, and K. M. Zurek, Phys. Rev. D79, 115016 (2009).\n[35] T. Cohen, D. J. Phalen, A. Pierce, and K. M. Zurek, (2010), arXiv:1005.1655.\n[36] A. Bottino, F. Donato, N. Fornengo, and S. Scopel, Phys. Rev. D69, 037302 (2004).\n[37] A. Bottino, F. Donato, N. Fornengo, and S. Scopel, Phys. Rev. D68, 043506 (2003).\n[38] D. Feldman, Z. Liu, and P. Nath, (2010), arXiv:1003.0437.\n[39] E. Kuflik, A. Pierce, and K. M. Zurek, (2010), arXiv:1003.0682.\n[40] R. Dermisek and J. F. Gunion, Phys. Rev. D73, 111701 (2006).\n[41] U. Ellwanger, J. F. Gunion, C. Hugonie, and S. Moretti, (2004), arXiv:hep-ph/0401228.\n[42] E. Accomando et al., (2006), arXiv:hep-ph/0608079.\n\n25\n\n\f[43] V. Barger, P. Langacker, and G. Shaughnessy, Phys. Rev. D75, 055013 (2007).\n[44] D. G. Cerdeno, C. Munoz, and O. Seto, Phys. Rev. D79, 023510 (2009).\n[45] D. G. Cerdeno and O. Seto, JCAP 0908, 032 (2009).\n[46] E. Aprile et al. (XENON100 Collaboration), (2010), arXiv:1005.0380.\n[47] E. Aprile et al. (XENON100 Collaboration), (2010), arXiv:1005.2615.\n[48] P. Sorensen, (2010), arXiv:1007.3549.\n[49] J. I. Collar and D. N. McKinsey, (2010), arXiv:1005.0838.\n[50] J. I. Collar and D. N. McKinsey, (2010), arXiv:1005.3723.\n[51] V. Barger, P. Langacker, M. McCaskey, M. Ramsey-Musolf, and G. Shaughnessy, Phys. Rev.\nD79, 015018 (2009).\n[52] J. McDonald, Phys. Rev. D50, 3637 (1994).\n[53] C. P. Burgess, M. Pospelov, and T. ter Veldhuis, Nucl. Phys. B619, 709 (2001).\n[54] O. Bahat-Treidel, Y. Grossman, and Y. Rozen, JHEP 05, 022 (2007).\n[55] D. O'Connell, M. J. Ramsey-Musolf, and M. B. Wise, Phys. Rev. D75, 037701 (2007).\n[56] V. Barger, P. Langacker, M. McCaskey, M. J. Ramsey-Musolf, and G. Shaughnessy, Phys.\nRev. D77, 035005 (2008).\n[57] M. Asano and R. Kitano, Phys. Rev. D81, 054506 (2010).\n[58] C. Arina, F.-X. Josse-Michaux, and N. Sahu, (2010), arXiv:1004.3953.\n[59] A. Bandyopadhyay, S. Chakraborty, A. Ghosal, and D. Majumdar, (2010), arXiv:1003.0809.\n[60] B. Patt and F. Wilczek, (2006), arXiv:hep-ph/0605188.\n[61] G. B. Gelmini and P. Gondolo, Phys. Rev. D74, 023510 (2006).\n[62] P. Salati, Phys. Lett. B571, 121 (2003).\n[63] S. Profumo and P. Ullio, JCAP 0311, 006 (2003).\n[64] F. Rosati, Phys. Lett. B570, 5 (2003).\n[65] D. J. H. Chung, L. L. Everett, and K. T. Matchev, Phys. Rev. D76, 103530 (2007).\n[66] G. Belanger, F. Boudjema, A. Pukhov, and A. Semenov, Comput. Phys. Commun. 180, 747\n(2009).\n[67] G. Belanger et al., (2010), arXiv:1004.1092.\n[68] G. Abbiendi et al. (OPAL Collaboration), Eur. Phys. J. C27, 311 (2003).\n[69] A. Sopczak, (2005), arXiv:hep-ph/0502002.\n[70] J. Abdallah et al. (DELPHI Collaboration), Eur. Phys. J. C32, 475 (2004).\n\n26\n\n\f[71] LEP Higgs Working Group, (2001), arXiv:hep-ex/0107032.\n[72] R. Dermisek and J. F. Gunion, Phys. Rev. D75, 075019 (2007).\n[73] M. Carena, T. Han, G.-Y. Huang, and C. E. M. Wagner, JHEP 04, 092 (2008).\n[74] K. Cheung, J. Song, and Q.-S. Yan, Phys. Rev. Lett. 99, 031801 (2007).\n[75] S. Chang, R. Dermisek, J. F. Gunion, and N. Weiner, Ann. Rev. Nucl. Part. Sci. 58, 75\n(2008).\n[76] S. Schael et al. (ALEPH Collaboration), (2010), arXiv:1003.0705.\n[77] C. Amsler et al., Physics Letters B 667, 1 (2008), Review of Particle Physics.\n[78] J. R. Ellis, A. Ferstl, and K. A. Olive, Phys. Lett. B481, 304 (2000).\n[79] V. Barger, W.-Y. Keung, and G. Shaughnessy, Phys. Rev. D78, 056007 (2008).\n[80] CDF, T. Aaltonen et al., (2010), arXiv:1005.3216.\n[81] O. J. P. Eboli and D. Zeppenfeld, Phys. Lett. B495, 147 (2000).\n[82] H. Davoudiasl, T. Han, and H. E. Logan, Phys. Rev. D71, 115007 (2005).\n[83] M. Schram, PROQUEST-1563019011.\n[84] K. Cheung, J. Song, P. Tseng, and Q.-S. Yan, Phys. Rev. D78, 055015 (2008).\n[85] N. E. Adam et al., (2008), arXiv:0803.1154.\n[86] J. R. Forshaw, J. F. Gunion, L. Hodgkinson, A. Papaefstathiou, and A. D. Pilkington, JHEP\n04, 090 (2008).\n[87] P. W. Graham, A. Pierce, and J. G. Wacker, (2006), arXiv:hep-ph/0605162.\n[88] S. Profumo, M. J. Ramsey-Musolf, and G. Shaughnessy, JHEP 08, 010 (2007).\n[89] D. Hooper, J. I. Collar, J. Hall, and D. McKinsey, (2010), arXiv:1007.1005.\n\n27\n\n\f"}