{"id": "http://arxiv.org/abs/0812.2595v2", "guidislink": true, "updated": "2009-05-06T02:23:19Z", "updated_parsed": [2009, 5, 6, 2, 23, 19, 2, 126, 0], "published": "2008-12-14T00:38:04Z", "published_parsed": [2008, 12, 14, 0, 38, 4, 6, 349, 0], "title": "Impurity Potential Renormalization by Strong Electron Correlation", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0812.0588%2C0812.0669%2C0812.3442%2C0812.2904%2C0812.0609%2C0812.1598%2C0812.3256%2C0812.4337%2C0812.0680%2C0812.3921%2C0812.4586%2C0812.1529%2C0812.2798%2C0812.1696%2C0812.0365%2C0812.4932%2C0812.0371%2C0812.0252%2C0812.4471%2C0812.2176%2C0812.2152%2C0812.2151%2C0812.1526%2C0812.3947%2C0812.0359%2C0812.0578%2C0812.3456%2C0812.2574%2C0812.0587%2C0812.3340%2C0812.3796%2C0812.0221%2C0812.1905%2C0812.4442%2C0812.3434%2C0812.2989%2C0812.1781%2C0812.3239%2C0812.0662%2C0812.3601%2C0812.2796%2C0812.4921%2C0812.1959%2C0812.0745%2C0812.1297%2C0812.2487%2C0812.1414%2C0812.4700%2C0812.4068%2C0812.2492%2C0812.2722%2C0812.3385%2C0812.1624%2C0812.4447%2C0812.0103%2C0812.4346%2C0812.0743%2C0812.1661%2C0812.4656%2C0812.4162%2C0812.2129%2C0812.0541%2C0812.2536%2C0812.1244%2C0812.2269%2C0812.1930%2C0812.1475%2C0812.3848%2C0812.2009%2C0812.4304%2C0812.0802%2C0812.3275%2C0812.0844%2C0812.4896%2C0812.0668%2C0812.0987%2C0812.1535%2C0812.1785%2C0812.3320%2C0812.1271%2C0812.3567%2C0812.4092%2C0812.2769%2C0812.0509%2C0812.2465%2C0812.0717%2C0812.2771%2C0812.2148%2C0812.2719%2C0812.4421%2C0812.3443%2C0812.3121%2C0812.2595%2C0812.2668%2C0812.4570%2C0812.5000%2C0812.2110%2C0812.3187%2C0812.0075%2C0812.0957%2C0812.0390&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Impurity Potential Renormalization by Strong Electron Correlation"}, "summary": "Renormalization of non-magnetic impurity potential by strong electron\ncorrelation is investigated in detail. We adopt the t-t'-t\"-J model and\nconsider mainly a delta-function impurity potential. The variational Monte\nCarlo method shows that impurity potential scattering matrix elements between\nGutzwiller-projected quasi-particle excited states are as strongly renormalized\nas the hopping terms. Such renormalization is also seen by the Bogoliubov-de\nGennes equation with an impurity, where the strong correlation is treated by a\nGutzwiller mean-field theory with local Gutzwiller factors and local chemical\npotentials. Namely, the delta-function potential is effectively weakened and\nbroadened. We emphasize the importance of including the local chemical\npotential, which is paid little attention to in the literature, by physical\nconsideration of the doping dependence of a local hole density. We also\ninvestigate effect of smooth impurity potential variation; the strong\ncorrelation yields anticorrelation between the gap energy and the coherence\npeak height simultaneously with large gap distribution, which is consistent\nwith the experiments.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0812.0588%2C0812.0669%2C0812.3442%2C0812.2904%2C0812.0609%2C0812.1598%2C0812.3256%2C0812.4337%2C0812.0680%2C0812.3921%2C0812.4586%2C0812.1529%2C0812.2798%2C0812.1696%2C0812.0365%2C0812.4932%2C0812.0371%2C0812.0252%2C0812.4471%2C0812.2176%2C0812.2152%2C0812.2151%2C0812.1526%2C0812.3947%2C0812.0359%2C0812.0578%2C0812.3456%2C0812.2574%2C0812.0587%2C0812.3340%2C0812.3796%2C0812.0221%2C0812.1905%2C0812.4442%2C0812.3434%2C0812.2989%2C0812.1781%2C0812.3239%2C0812.0662%2C0812.3601%2C0812.2796%2C0812.4921%2C0812.1959%2C0812.0745%2C0812.1297%2C0812.2487%2C0812.1414%2C0812.4700%2C0812.4068%2C0812.2492%2C0812.2722%2C0812.3385%2C0812.1624%2C0812.4447%2C0812.0103%2C0812.4346%2C0812.0743%2C0812.1661%2C0812.4656%2C0812.4162%2C0812.2129%2C0812.0541%2C0812.2536%2C0812.1244%2C0812.2269%2C0812.1930%2C0812.1475%2C0812.3848%2C0812.2009%2C0812.4304%2C0812.0802%2C0812.3275%2C0812.0844%2C0812.4896%2C0812.0668%2C0812.0987%2C0812.1535%2C0812.1785%2C0812.3320%2C0812.1271%2C0812.3567%2C0812.4092%2C0812.2769%2C0812.0509%2C0812.2465%2C0812.0717%2C0812.2771%2C0812.2148%2C0812.2719%2C0812.4421%2C0812.3443%2C0812.3121%2C0812.2595%2C0812.2668%2C0812.4570%2C0812.5000%2C0812.2110%2C0812.3187%2C0812.0075%2C0812.0957%2C0812.0390&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Renormalization of non-magnetic impurity potential by strong electron\ncorrelation is investigated in detail. We adopt the t-t'-t\"-J model and\nconsider mainly a delta-function impurity potential. The variational Monte\nCarlo method shows that impurity potential scattering matrix elements between\nGutzwiller-projected quasi-particle excited states are as strongly renormalized\nas the hopping terms. Such renormalization is also seen by the Bogoliubov-de\nGennes equation with an impurity, where the strong correlation is treated by a\nGutzwiller mean-field theory with local Gutzwiller factors and local chemical\npotentials. Namely, the delta-function potential is effectively weakened and\nbroadened. We emphasize the importance of including the local chemical\npotential, which is paid little attention to in the literature, by physical\nconsideration of the doping dependence of a local hole density. We also\ninvestigate effect of smooth impurity potential variation; the strong\ncorrelation yields anticorrelation between the gap energy and the coherence\npeak height simultaneously with large gap distribution, which is consistent\nwith the experiments."}, "authors": ["Noboru Fukushima", "Chung-Pin Chou", "Ting Kuo Lee"], "author_detail": {"name": "Ting Kuo Lee"}, "author": "Ting Kuo Lee", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1103/PhysRevB.79.184510", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/0812.2595v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0812.2595v2", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "9 pages, 9 figures, introduction expanded, references changed,\n  Secs.IV slightly modified, typos corrected", "arxiv_primary_category": {"term": "cond-mat.str-el", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cond-mat.str-el", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "cond-mat.supr-con", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0812.2595v2", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0812.2595v2", "journal_reference": "Phys. Rev. B 79, 184510 (2009)", "doi": "10.1103/PhysRevB.79.184510", "fulltext": "Impurity Potential Renormalization by Strong Electron Correlation\nNoboru Fukushima, Chung-Pin Chou, and Ting Kuo Lee\n\narXiv:0812.2595v2 [cond-mat.str-el] 6 May 2009\n\nInstitute of Physics, Academia Sinica, NanKang, Taipei 11529, Taiwan\nRenormalization of non-magnetic impurity potential by strong electron correlation is investigated\nin detail. We adopt the t-t′ -t′′ -J model and consider mainly a δ-function impurity potential. The\nvariational Monte Carlo method shows that impurity potential scattering matrix elements between\nGutzwiller-projected quasi-particle excited states are as strongly renormalized as the hopping terms.\nSuch renormalization is also seen by the Bogoliubov-de Gennes equation with an impurity, where\nthe strong correlation is treated by a Gutzwiller mean-field theory with local renormalization factors\nand local chemical potentials. Namely, the δ-function potential is effectively weakened and broadened. We emphasize the importance of including the local chemical potential, which is paid little\nattention to in the literature, by physical consideration of the doping dependence of a local hole\ndensity. We also investigate effect of smooth impurity potential variation; the strong correlation\nyields anticorrelation between the gap energy and the coherence peak height simultaneously with\nlarge gap distribution, which is consistent with the experiments.\n\nI.\n\nINTRODUCTION\n\nAnderson's theorem tells us that the s-wave superconductivity is insensitive to small potential scattering1 . On\nthe other hand, the d-wave superconductivity has zero superconducting gap in the nodal direction, and thus may\nbe sensitive to disorder. However, experimental observation of the high-temperature superconductivity, which\nmany people are nowadays convinced has d-wave symmetry, seems robust against disorder2,3,4,5 . For example, the\nhigh-temperature superconductors seem to exhibit more\nconventional behavior at higher hole doping rates where\nthe systems are supposed to be more disordered. Furthermore, the local density of states measured by the STM6,7\nshow clear V-shape at low energy that indicates the dwave nodes are not much influenced by disorder. Theoretically, it is proposed that this protection of V-shape is\ndue to strong Coulomb repulsion between electrons8,9,10 .\nHence, detailed studies of effects of strong correlation for\nimpurity scattering are necessary.\nIn correlated systems, the model parameters are effectively renormalized. For example, a hopping term is\nrenormalized by a factor smaller than unity because hopping is more difficult in the presence of the double occupancy prohibition. On the other hand, an exchange\nterm is renormalized by a factor larger than unity because each site is more often singly occupied. Then, the\nquestion is: how are impurity terms renormalized? In our\nprevious paper10 , we have presented preliminary results\nof the impurity renormalization. That is, local modulations of the hopping and the exchange term tend to be\nenhanced by the local renormalization factors, and impurity potential tends to be screened by the effective local\nchemical potentials originated from minimization of the\ntotal energy. In this paper, we investigate in more detail\nhow impurity potential is renormalized, using the variational Monte Carlo (VMC) method and the Gutzwillerprojected Bogoliubov-de Gennes (BdG) equation11,12,13 ,\nthen discuss agreement and disagreement with the experiments.\n\nAn extensive amount of literature has been devoted\nfor the impact of impurities on the normal and superconducting state of the cuprates. A detailed review dedicated to this subject was recently given by Alloul et al.14\nWe do not repeat the whole review here, but the theoretical side may be summarized as follows: Suppose electrons\nin host metal interact with each other by the onsite repulsive Hubbard U terms, and let us put a non-magnetic\nimpurity in it. Then, very strong impurity potential (unitary scatterer), such as a cavity in otherwise uniform systems, tends to induce local magnetic moments near the\nimpurity if U is large enough, whereas weak potential\n(Born scatterer) does not.\nHowever, the local moment formation in the superconducting state seems relatively controversial. The moments appear according to the theory based on the meanfield decoupling of the U term, e.g., by Chen and Ting15 ,\nand Harter et al.16 . Although it can be a good approximation for small U , yet antiferromagnetic correlation is\nprobably underestimated especially at large U because\nthe superexchange process is not taken into account explicitly. Considering that the local moments typically\nappear at sufficiently large U , it is critical to know in\nwhat range of U the theory is valid. An interesting contrast is in the theory by Tsuchiura et al.17 based on the\none-site removed t-t′ -J model, i.e., an effective U → ∞\nmodel. They adopted two different Gutzwiller approximations that lead to two different BdG equations. One\nof them takes away the double occupancy prohibition in\nreturn for the uniform renormalization of model parameters. This calculation results in the local moment formation. It also indicates that J may cause the appearance\nof the local moment even if U = 0 because this effective model is a \"U = 0 but finite J\" system. In the\nother BdG equation of them, each local model parameter is dressed with an extended Gutzwiller renormalization factor that depends on the position. This calculation in contrast results in the absence of the local moments because electrons tend to avoid the impurity and\nthe antiferromagnetism locally collapses. However, these\nlocal renormalization factors are, without local deriva-\n\n\f2\ntion, speculated from the previously derived formula for\nthe uniform system18 , and may need to be verified in\nthe future studies. Tsuchiura's work was criticized by\nWang and Lee19 , who applied an inhomogeneous slaveboson mean-field theory to essentially the same model.\nThe result shows the local magnetic moments in the underdoped region. In the slave-boson mean-field theory,\nthe double occupancy prohibition is relaxed by the saddle point approximation and only its average is satisfied,\nwhich probably reduces the influence of the spin-spin interaction effectively. To compensate it, Wang and Lee\nadded a phenomenological residual spin-spin interaction\nterm, and the result depends on its magnitude. In addition, Gabay et al.20 recently obtained similar results.\nLiang and Lee21 applied the VMC and also concluded\nthat local moments appear in the underdoped regime.\n\nThe strong scatterers introduced above are modeled on\nin-plane impurities which substitute for Cu in the CuO2\nplanes. Besides such unitary scatterers, all cuprate materials are doped by out-of-plane ions that mostly occupy\nrandom positions in the crystal lattice or interstitial positions. Such intrinsic impurities may be weak, but can\nbe poorly screened by electrons around them because the\ncuprates are quasi–two-dimensional metal. In addition,\nthese weak potentials are not expected to induce local\nmagnetism. Influence of these \"Born scattering potentials\" on the local density of states was studied by, e.g.,\nWang and Lee,22 , and Nunner et al.23 In fact, however,\nthe effect of electron correlation on them seems hardly\ndiscussed in the literature, with the exception of Garg et\nal.9 , Fukushima et al.10 , and Andersen and Hirschfeld24 .\nThat is a subject we would like to address in this paper.\n\nAfter we define our model in Sec. II, the renormalization of impurity-potential matrix elements is shown by\nthe VMC calculation in Sec. III. Then, the BdG equation\nbased on the Gutzwiller approximation with local renormalization factors11,12,13 are solved in Sec. IV, where\nwe emphasize the importance of including local chemical\npotentials through the comparison with the method by\nGarg et al.9 Note that these local chemical potentials are\nintroduced for minimizing the total energy and are different from those used for the inhomogeneous slave-boson\nmean-field theory19,20,25 that are the Lagrange multipliers to enforce the average no-double-occupancy condition. Renormalization of smoothly varying impurity potential is also presented to show anticorrelation between\nthe gap energy and the coherence peak height compatible\nwith large gap distribution, which is consistent with the\nexperiments6,26 .\n\nII.\n\nMODEL\n\nWe use the t-t′ -t′′ -J model with an impurity term,\nnamely,\nH ≡ Htt′ t′′ + HJ + Himp ,\n\n\nX\ntij c†iσ cjσ  P\nHtt′ t′′ ≡ P −\n\n(1)\n(2)\n\ni,j,σ\n\nHJ ≡ J\n\n\u0013\nX\u0012\n1\nSi * Sj − n̂i n̂j ,\n4\n\n(3)\n\nhi,ji\n\nwhere c†iσ (ciσ ) is the creation (annihilation) operator of\nP\nsite i and spin σ, and n̂i ≡ σ c†iσ ciσ . As the hopping,\nwe take tij = t, t′ , t′′ , for the nearest, second, and third\nneighbors, respectively, and otherwise zero. The summation in the J term is taken over every nearest-neighbor\npair. The Gutzwiller projection operator P prohibits\nelectron double occupancy at every site.\nIn this paper, we focus on the renormalization of a single non-magnetic δ-function impurity potential located\nat i = 0,\nHimp = V0\n\nX\n\nc†0σ c0σ =\n\nσ\n\nV0 X †\nc ck ′ σ ,\nNL ′ kσ\n\n(4)\n\nk,k σ\n\nexcept for Sec. IV D, where we briefly discuss the effect\nof smoothly varying impurity potential. Here, NL is the\nnumber of sites.\n\nIII. VARIATIONAL MONTE CARLO\nCALCULATION FOR MATRIX ELEMENT\nRENORMALIZATION\n\nHere we calculate matrix elements of the impurity potential with respect to the uniform Gutzwiller-projected\nquasi-particle states of d-wave superconductors using the\nVMC method.\nLet us start from a uniform system without impurities.\nWe assume that the ground state is well approximated\nby a Gutzwiller-projected d-wave superconducting state,\n\"\n\nX vp † †\nc c\n|GSi ∝ P\nup p↑ −p↓\np\n\n# N2e\n\n|0i,\n\nwhere\ns \u0012\ns \u0012\n\u0013\n\u0013\nξk\nξk\n∆k\n1\n1\n1+\n1−\n, vk ≡\n,\nuk ≡\n2\nEk\n|∆k | 2\nEk\nq\nEk ≡ ξk2 + ∆2k , ∆k ≡ ∆v (cos kx − cos ky ),\nξk ≡ −2tv (cos kx + cos ky ) − 4t′v cos kx cos ky\n−2t′′v (cos 2kx + cos 2ky ) − μv .\n\n(5)\n\n\f3\nNe is the total number of electrons. The variational\nparameters ∆v , t′v , t′′v , μv are optimized so as to minimize the total energy. We also assume that the excited\nstates are well represented by the projected quasi-hole\nwave function27 ,\n\n0.5\n\nBCS\nEmpty Vk,k'/Vk,k'\n\nZk/ZkBCS\n\nSolid\n\n0.4\n\ngt\n\n0.3\n(p,p)\n\n\"\n#\nX vp † †\n†\n|kσi ∝ P ckσ\nc c\nup p↑ −p↓\np\n\nNe\n2\n\n−1\n\n|0i.\n\n(6)\n\n0.1\n\nThen, we are able to calculate the matrix elements and\nspectral weights using the excited quasi-hole wave function with the ground state parameters.\nBy switching on the impurity potential, these excited\nstates should be mixed by the matrix elements,\nVk,k′ ≡ hk ↑ |c†k↑ ck′ ↑ |k ′ ↑i + h−k ′ ↑ |c†k↓ ck′ ↓ | − k ↑i. (7)\nWe carry out VMC calculation for Vk,k′ , and show that\nits renormalization by the strong correlation is similar to\nthat of the total spectral weight,\nZk ≡ hkσ|c†kσ |GSi\n\n2\n\n2\n\n+ hkσ|c−k−σ |GSi ,\n\n2x\n,\n1+x\n\n0.0\n0.00\n\n(0,0)\n\n0.05\n\n0.10\n\n0.15\n\n0.20\n\n0.25\n\n0.30\n\nx\nBCS\nand\nFIG. 1: (Color online) Comparison of Vk,k′ /Vk,k\n′\nBCS\nZk /Zk\nas functions of the hole concentration x in the case\nof (t′ , t′′ , J)/t = (−0.3, 0.2, 0.3) optimized at each x. Each\nsymbol represents transfer between the k-points of the same\nsymbols in the inset.\n\n(8)\n\nwhich is known to be strongly renormalized28. It is worthy to be noted that the BCS theory has predicted the\nmatrix elements of the impurity potential and the total\nBCS\nspectral weights are Vk,k\n= uk uk′ − vk vk′ , and ZkBCS =\n′\n1, respectively. On the other hand, the Gutzwiller approximation (GA) yields renormalization,\nZkGA = gt ≡\n\n0.2\n\n0.5 (t',t'')/t = (-0.3,0.2)\n(-0.1,0.05)\n0.4\n\ngt\n\n0.3\n(p,p)\n\n(9)\n\n0.2\n\nwhere gt is the Gutzwiller renormalization factor for the\nhopping term. However, according to the conventional\nGA, Vk,k′ is not renormalized because it originally comes\nfrom a particle number operator; on the contrary, a GA\ngeneralized for inhomogeneous systems yields renormalization as will be discussed in the next section.\nBCS\nBCS\nWe plot Vk,k′ /Vk,k\nin Fig. 1 as functions\n′ and Zk /Zk\nof the hole concentration. Suppose the impurity potential\nis not too large. Then, the matrix elements Vk,k′ perturb\nthe system only if the excitation energies of |kσi and\n|k ′ σi are close. Therefore, here we plot Vk,k′ connecting\ntwo symmetric reciprocal lattice points indicated in the\ninset of Fig. 1; each pair of symbols in the inset refers to\nk and k ′ , which corresponds to the same symbols of Vk,k′\nand Zk = Zk′ in the plot. The variational parameters are\noptimized for each hole concentration. Note that Vk,k′ is\nrenormalized as strongly as Zk , and its renormalization\nfactor is quite close to gt . Furthermore, Fig. 2 compares\nVk,k′ of different bare parameters in the Hamiltonian. It\nsuggests that the renormalization is insensitive to parameters.\nThese results may be understood as follows. Let us\nlook at the Fourier transform of the δ-function impurity potential [Eq. (7)]. The sum of its diagonal terms\n(k = k ′ ) just slightly shifts the chemical potential. What\n\n0.1\n0.0\n0.00\n\n(0,0)\n\n0.05\n\n0.10\n\n0.15\n\n0.20\n\n0.25\n\n0.30\n\nx\nBCS\nFIG. 2: (Color online) Comparison of Vk,k′ /Vk,k\n′ of different\nbare parameters. Each symbol represents transfer between\nthe k-points of the same symbols in the inset.\n\nabout the off-diagonal terms (k 6= k ′ )? If k were a site\nindex, they would be renormalized as gt = 2x/(1 + x) according to the Gutzwiller approximation, which is smaller\nthan unity and is going to zero as x → 0 because it is\nmore difficult to hop in the presence of the double occupancy prohibition. Even in k space, if electrons are\ndensely packed in the lattice, it must be similarly difficult to hop from k to a different k ′ . Thus, the impurity\npotential should be renormalized by a factor similar to\ngt as we expected.\n\n\f4\nP\n\nIV. GUTZWILLER-PROJECTED\nBOGOLIUBOV-DE GENNES EQUATION\nA.\n\ni\n\nRenormalization by effective local chemical\npotentials\n\nWe solve a BdG equation derived using the Gutzwiller\napproximation with local renormalization factors11,12,13\nfor non-magnetic systems. By requiring minimization of\nthe total energy, the BdG Hamiltonian naturally contains effective local chemical potentials originating from\nthe derivative of the local renormalization factors with respect to local particle densities. In the following, we show\nthat the impurity potential is renormalized by those local\nchemical potentials.\nLet us assume that a good variational ground state\ncan be represented in the form of P ′ |ψi, where |ψi represents a wave function obtained later by solving a BdG\nequation. The operator P ′ contains a fugacity operator to control the particle number as well as the original\nGutzwiller projection P . In the following, we use notation,\nhÔi0 ≡\n\nhψ|Ô|ψi\n,\nhψ|ψi\n\nhÔi ≡\n\nhψ|P ′ ÔP ′ |ψi\n,\nhψ|P ′ P ′ |ψi\n\n(10)\n\nfor an arbitrary operator Ô. The built-in fugacities allow\nus to require conservation of the local electron densities,\nnamely,\nhn̂i i = hn̂i i0 ≡ ni .\n\n(11)\n\nThen, the Gutzwiller approximation yields\ns\n2xj\n2xi\nt\nt\n*\n, (12)\nhc†iσ cjσ i ≃ gij\nhc†iσ cjσ i0 , gij\n≡\n1 + xi 1 + xj\ns\nhSi * Sj i ≃ gij\nhSi * Sj i0 ,\n\n2\n2\n*\n, (13)\n1 + xi 1 + xj\n\ns\ngij\n≡\n\nwhere xi ≡ 1 − ni .\nWe consider non-magnetic systems where χij ≡\n†\nhci↑ cj↑ i0 = hc†i↓ cj↓ i0 and ∆ij ≡ hcj↓ ci↑ i0 are real\nnumbers,\nP and ∆ij = ∆ji . Then, the total energy\nhH − μ i n̂i i can be calculated by the GA as\nX J\u0002\ns\n2(3gij\n− 1)χ2ij\n4\nhi,ji\n(i,j)\nX\n\u0003\ns\nni + V0 n0 ,\n(14)\n+2(3gij\n+ 1)∆2ij + ni nj − μ\nEGA = −4\n\nX\n\nt\ngij\ntij χij −\n\ni\n\nwhere the summation of the kinetic-energy term is\nP\ntaken over every (i, j) pair. Using χ̂ij ≡ σ (c†iσ cjσ +\nˆ ij ≡ (c† c† + c† c† + cj↓ ci↑ + ci↓ cj↑ )/4,\nc†jσ ciσ )/4 and ∆\ni↑ j↓\nj↑ i↓\nthe extremum condition of EGA leads to a BdG\nequation11,13\nmean-field Hamiltonian\nP represented by the P\nˆ\nHBdG =\nhiji ∆ij dEGA /d∆ij +\n(ij) χ̂ij dEGA /dχij +\n\nn̂i dEGA /dni , namely,\nHBdG = −\n\nX\n\nt\ngij\ntij c†iσ cjσ −\n\nijσ\n\n−\n\nX\n\nX\n\ns\nJ(3gij\n− 1)χij χ̂ij\n\nhiji\n\ns\nˆ ij −\nJ(3gij\n+ 1)∆ij ∆\n\nX\n\n(μ + μi )n̂i + V0 n̂0 . (15)\n\ni\n\nhiji\n\nNote that, in contrast to the conventional BdG equation,\nit contains the effective local chemical potential\nμi ≡\n\nt\nX dgij\ndEGA\n4\n−μ=−\ntij χij\ndxi\ndxi\nj\n\u0015\ns\nX \u0014 3 dgij\nJ\nJ(χ2ij + ∆2ij ) − nj , (16)\n−\n2 dxi\n4\nj(n.n.)\n\nwhere the summation of the J term is taken over the\nnearest neighbors of site i. By diagonalizing the BdG\nPNL\n†\nHamiltonian, we obtain HBdG =\nn=1 En (γ1n γ1n +\n†\nγ2n γ2n ) + const., with En ≥ 0 and\n\u0012\n\nγ1n\n†\nγ2n\n\n\u0013\n\nX \u0012 un v n \u0013 \u0012 ci↑ \u0013\ni\ni\n.\n=\n−vin uni\nc†i↓\n\n(17)\n\ni\n\nP\nQ\nγ2n |0i, ni = 2 n (vin )2 , χij =\nThen,\n=\nn γ1n\nP\nP n |ψi\nn n\nn\nn −ui vj .\nn vi vj , and ∆ij =\nThe inclusion of the local chemical potential μi makes\nit harder to optimize the local mean-fields, and simple iteration does not converge very well. Strategies to look for\nthe minimum of the total energy E seem to work slightly\nbetter. We have solved the self-consistent equation for\nthe systems of 24×24 sites with the periodic boundary\ncondition. We set t′ = −0.3t and t′′ = 0.2t. Then, J\nand μ are determined using the uniform system without\nthe impurity so that x is the desired hole concentration\ns\nas well as J(3gij\n+ 1)∆ij = 0.3t. These values are fixed\nin solving the equation for the impurity systems, i.e., we\nneglect O(1/NL ) shift of μ caused by the inclusion of the\nimpurity.\nAccording to Eq. (11), the expectation value of n̂i is\nby definition not renormalized by any \"g\" factor as the\nhopping and the exchange term. However, as one can\nsee in the BdG Hamiltonian in Eq. (15), the impurity\npotential can be compensated by μi . Therefore, we define\na renormalized impurity potential by including difference\nof μi , namely,\nṼi = V0 δi0 − (μi − μ∞ ) .\n\n(18)\n\nHere, μ∞ is μi→∞ and approximately equal to μi of the\nsystem without the impurity, which is nonzero29 . In the\nuniform system, however, one usually redefines μ+μ∞ as\nthe chemical potential, and μ∞ does not explicitly appear\nin the calculation29 . Figures 3 and 4 show the calculated\nrenormalized impurity potential at the impurity site for\nvarious values of the bare potential V0 and the hole concentration x ≥ 0.05. We have also tried the systems with\n\n\f5\nprefers to move around to gain the kinetic energy. Therefore, to minimize the total energy, the δ-function impurity potential is broadened by μi . More explicitly, the\ncontribution to μi from the kinetic energy contains a factor\ns\ns\nt\ndgij\n1\n2xj\n=\n,\n(19)\n3\ndxi\n2xi (1 + xi )\n1 + xj\n\n0.5\nx=0.2\n\n\u008e\nV0 \u0090 t\n\n0.4\n\nx=0.125\n\n0.3\n0.2\n0.1\n\nx=0.05\n\n0\n0\n\n0.2\n\n0.4\n\n0.6\n\n0.8\n\n1.\n\n1.2\n\n1.4\n\nV0 \u0090 t\nFIG. 3: (Color online) The dots represent the renormalized\nimpurity potential at the impurity site as a function of the\nbare impurity potential with the hole concentrations x = 0.05\n(blue), 0.125 (green), and 0.2 (red). The broken lines are gt V0 .\n\n0.5\n\nV0 =1.5 t\nV0 =1 t\n\n0.3\n\n0.3\n\nx=0.2\n\n0.2\n\n0.125\n\n0.2\nV0 =0.25 t\n\n0.1\n\n\u008e\nVi \u0090 t\n\n\u008e\nV0 \u0090 t\n\n0.4\n\np\nwhich behaves as xj /xi near the half filling. Suppose\nthe local hole densities behave as xi ∼ xδi , xj ∼ xδj with\nt\nsome exponents δi , δj . Then, dgij\n/dxi ∼ x(δj −δi )/2 as\nx → 0. If δi 6= δj , then μi or μj diverges and the selfconsistent condition is not satisfied. Therefore, δi = δj ,\nwhich tends to make the hole distribution more uniform.\nSuch extension of the impurity potential is also reported in the context of the unitary impurity potential\nby Poilblanc et al.30 and in the weak-coupling context\nby Ziegler et al.31 In addition, Bulut32 and Ohashi33 reported that the agreement between experimental data\nand the random-phase approximation is improved by\nadding phenomenological extended range potential.\n\n0\n0\n\n0.05\n\n0.1\n\n0.15\n\n0.2\n\nx\nFIG. 4: (Color online) The dots represent the renormalized\nimpurity potential at the impurity site as a function of the\nhole concentration with the bare impurity potentials V0 =\n0.25t (red), 1t (green), and 1.5t (blue). The broken lines are\ng t V0 .\n\nx = 0.025, but were unable to reach the energy minimum\npossibly because there are a couple of meta-stable states.\nNote that Ṽ0 is strongly suppressed and is quite close\nto gt V0 , where gt is the Gutzwiller renormalization factor of the uniform system. These results agree with our\nVMC results in the previous section. Here, Ṽ0 deviates\nupward from gt V0 when V0 is large near the half filling.\nThis is possibly related to the position dependence of\nṼi . Originally, the impurity potential is nonzero only\nat the impurity site. However, after solving the BdG\nequation, the renormalized impurity potential distributes\nmore broadly as shown in Fig. 5. Namely, as V0 becomes\nlarger and x becomes smaller, the renormalization effect\nreduces at the impurity site whereas it broadens toward\nthe neighboring sites.\nThis broadening can be understood as follows: Basically, energy loss by the impurity potential reduces electron occupation at the impurity site. However, the hole\n\n0.05\n0.1\n\n0\n\nH0,0L\n\nH1,0L\n\nH2,0L\n\nH3,0L\n\nH4,0L\n\nH5,0L\n\ni\nFIG. 5: (Color online) The position dependence of the renormalized impurity potential for V0 = 1t.\n\nAt half filling, the non-magnetic impurity potential\nshould not affect the ground state because each site has\nto be occupied by one electron in any case. However,\nthey do affect the ground-state energy. In the words of\nthe BdG equation, the impurity potential is renormalized\nby μi in HBdG , and not in EGA . This is different from\nthe well-known renormalization of the hopping and the\nt\ns\nexchange term described by gij\nand gij\n; these renormalization factors influence both the ground state and the\nground-state energy.\n\nB.\n\nLocal density of states\n\n†\nThe projected quasi-particle states P ′ γσn\n|ψi are ap13\nproximately orthogonal to each other . We regard them\nas excited states and calculate the density of states\n\n\f6\n(DOS). Then, the local DOS (LDOS) is represented by\nX\u0002\n\u0003\nt\nN (r, ω) = grr\n|unr |2 δ(ω − En ) + |vrn |2 δ(ω + En ) .\n\nthe one with the correlation.\n\n1.\n\nLDOS\n\n(20)\n\nTo obtain dense spectra, we use a supercell composed\nof 24×24 sites whose origin has the impurity, and this\nsupercell is repeated so as to construct a superlattice of\n10×10 supercells with the periodic boundary condition34 .\nThen, the Hamiltonian can be block-diagonalized by the\nFourier transform with respect to the supercell indices,\nand the calculation of expectation values is reduced to an\naverage over many quasi-twisted boundary conditions of\nthe 24×24 site system. This supercell method is useful\nto obtain dense energy levels although it seems to overestimate correlation functions between very distant sites\nif the supercell size is too small and the number of supercells is too large. Except for this supercell boundary\ncondition, the other conditions of the calculation are the\nsame as those in Sec. IV A. Since spectra in finite systems\nare discrete, we replace each δ-function by the Gaussian\ndistribution with the standard deviation δE = 0.02t to\nobtain continuous DOS.\nFigure 6(a) shows the calculated LDOS at the impurity\nsite as well as its nearest, second, and third neighbors.\nThe DOS of the uniform system (V0 = 0) is also plotted\nby dotted lines as a reference. Here, we have chosen V0 =\n1t as the impurity potential, which is of the same order\nas the renormalized band width (8gt t). Nevertheless, it\nis well screened by μi and the LDOS is not very sitedependent in agreement with results in Sec. IV A. At\nthe impurity site, the hole density is larger, and thus\nt\nis large. As a result the LDOS is also larger than\ngrr\nthose of the other sites. The peak at E ∼ −0.37t is the\nvan Hove peak; the band renormalization by gt makes it\ncloser to the Fermi surface. In fact, another van Hove\npeak appears in the positive bias at E ∼ 0.37t. It is\nmuch weaker than the negative-bias van Hove peak, and\nonly appears as a small shoulder of the the coherence\npeak in the resolution of Fig. 6(a). Some small portion\nof the original electron band around the van Hove peak\nis unoccupied in the mean-field superconducting ground\nstate due to the electron-hole mixture. Even though that\nportion is small, the singular DOS enhances it to yield\nthe positive-bias van Hove peak.\nFor comparison, we also show in Fig. 6(b) the results\nof the system without the strong correlation, i.e, let us\nt\ns\nset gij\n= gij\n= 1 and μi = 0 in Eq. (15) and solve the\nBdG equation. J and μ are determined in the same way\nas in the strongly correlated case, i.e., 4J∆ij = 0.3t for\nthe uniform system. Here, we use supercells of 36 × 36\nsites to obtain dense spectra; if the same system size is\nused, energy level spacings are larger than those in the\ncorrelated systems due to the wider band width. The\nimpurity potential is also V0 = 1t. Note that it is this\ntime much smaller than the band width 8t. Nevertheless,\ncomparing Figs. 6(a) and 6(b), it is clear that the system\nwithout strong correlation is much more disordered than\n\nHaL 1.2\n\n1.2\n\nn\n\n0.8\n\nH2,0L\n\nH1,1L\n\n0.6\n\n1.\n0.8\n\nH2,0L\n\n1.\n0.8\n\nH1,1L\n\n0.6\nH1,0L\n\n0.4\n0.2\n\nHbL 1.2\n\n0\n-0.4 -0.2 0\n\nE\u0090t\n\n0.2\n\nH2,0L\n\nH1,1L\n\n0.6\nH1,0L\n\nH1,0L\n\n0.4\nH0,0L\n\nHcL\n\n0.4\nH0,0L\n\n0\n0.2 0.4 -0.4 -0.2 0\n\nE\u0090t\n\n0.2\n\nH0,0L\n\n0\n0.2 0.4 -0.4 -0.2 0\n\n0.2 0.4\n\nE\u0090t\n\nFIG. 6: (Color online) The LDOS for one impurity system\nwith V = 1t and x = 1/8, at the impurity site and its nearest,\nsecond, and third neighbor, calculated by three different BdG\nt\ns\nt\nequations: (a) with gij\n, gij\n, μi , (b) without correlation (gij\n=\ns\ngij = 1, μi = 0), (c) without the local chemical potential9\nt\ns\n(with gij\n, gij\n, but μi = 0). The dotted lines are the DOS in\nthe uniform system (V0 = 0) as a reference.\n\nFrom Fig. 6(b), it is clear that the δ-function potential\nmakes the LDOS asymmetric.22,23 That is, some weight\nof the LDOS tends to move to the right at the impurity\nsite, and to the left at the nearest neighbor site. The\nshift is large at high energy, and small at low energy.\nThis asymmetry appears because the δ-function potential\nlifts the degeneracy of two quasi-particles: (i) a linear\ncombination between an electron state at site 1 and a\nhole state at site 2, or (ii) a linear combination between\nan electron state at 2 and a hole state at 1. We discuss\nit more in detail using a two-site system in Appendix\nA. With the strong correlation in Fig. 6(a), however, the\nasymmetry is less pronounced and the LDOS seems more\nsymmetric. Most likely, the broadening of the impurity\npotential by μi results in weakening of the asymmetry.\nC.\n\n1.\n\nComparison with other strongly-correlated BdG\nequations\nImportance of including the local chemical potential μi\n\nGarg et al. used a similar BdG equation9 . Although\nthe definition of the local renormalization factors is the\nsame, they do not take into account the effective local\nchemical potential μi that minimize the total energy.\nThey have reported that the spatially averaged LDOS\nshows protected V-shapes at low energy, and stated that\nthe correlated systems are less disordered. For the testing purpose, we have also solved their BdG equation and\nshow the resultant LDOS in Fig. 6(c). The parameters\nare the same as Fig. 6(a), and the uniform limits of these\ntwo BdG equations are identical. We have found that\nthe LDOS before the spatial average is actually quite disordered, especially at the impurity site, and that the V-\n\n\f7\nshaped LDOS appears only after the average. Therefore,\nit seems difficult to conclude that the LDOS in Fig. 6(c)\nis less disordered than the LDOS in Fig. 6 (b), in our\nopinion.\nA more serious problem of their method appears in\nthe local hole density as a function of the bulk hole density shown in Fig. 7. As already mentioned above, the\nnon-magnetic impurity potential at half filling should not\naffect the ground state because each site has to be occupied by one electron in any case. Hence one can naturally\nimagine that the local hole density x0 at the impurity\nsite approaches the bulk hole density x as x → 0. However, if μi is not taken into account, x0 − x increases as\nx decreases. Therefore, it is questionable if the method\nby Garg et al. correctly captured the properties of the\nstrongly correlated systems.\n\nx0 - x\n\n0.15\n\nD.\n\nSmoothly varying impurity potential\n\nAs has been shown above, short-range impurity potential is screened by μi . Accordingly, what remains must be\nthe smooth variation in the potential. Here, we demonstrate the influence of the strong electron correlation on\nit using the Coulomb potential.\nInstead of Himp , we consider the Coulomb potential\nfrom randomly located off-plane impurities, namely,\nX\nHsmooth ≡\nVr c†rσ crσ ,\n(21)\nrσ\n\nNimp\n\nwithout Μi\n\nVr ≡\n\n0.1\n\nX\nl=1\n\n0.05\n\nwith Μi\n\n0\n0\n\n0.05\n\n0.1\n\n0.15\n\n0.2\n\nx\nFIG. 7: The relative hole density x0 − x at the impurity site\nas a function of the bulk hole density x solved for V0 = 0.25t\nby the two different BdG equations; without μi 9 and with μi .\n\nCapello et al.35 solved the BdG equation with extended\nGutzwiller renormalization factors, but without the local chemical potential. Although we have not duplicated\ntheir results, we speculate that they have similar problems as Garg et al. because of the lack of the local chemical potential to minimize the total energy.\n\n2.\n\ndepends on how one chooses U . A problem is that the\nmean-field decoupling of the U term may underestimate\nthe exchange energy and overestimate the kinetic energy\nespecially near the half filling; the ground state would be\nstrongly influenced by them.\n\nLarge U instead of the Gutzwiller projection\n\nAndersen and Hirschfeld24 and some references therein\nused the BdG equation without the Gutzwiller renormalization factors (gt = gs = 1). They took into account\nthe electron correlation by the Hubbard U term of the\nmean-field level. In that case, the screening effect similar\nto the one described in this paper can be obtained because −U niσ̄ plays a role of our local chemical potential\nμi . Since the impurity potential reduces electron occupation, the Coulomb energy loss is smaller there. Namely,\nsumming up the potential and Coulomb energy loss, the\ntotal loss at the impurity site become less prominent by\nU . Note that, however, the strength of the screening\n\nVC\np\n,\n(r − rl )2 + d2\n\n(22)\n\nwhere Nimp is the number of impurities, rl is the position of l-th impurity projected on the xy plane, and d is\nthe off-plane distance. Here, we take VC = 1t and d = 1\nand adjust μ to satisfy x = 1/8 simultaneously with the\nself-consistency condition. In addition, one supercell has\n20×20 sites with Nimp = 12 impurities, and the same\nimpurity configuration is repeated so as to construct a\nsuperlattice of 10×10 supercells. For simplicity, in determining the Coulomb potential in Eq. (22), we use only\none of the cells, i.e., the system of 20×20 sites with the\nperiodic boundary condition.\nFigure 8 shows the LDOS at 4 sites A, B, C, and D,\neach of which has a different hole concentration. The\nLDOS in hole-rich regions (e.g., A) has high coherence\npeaks with low gap energy. In contrast, hole-poor regions (e.g., D) has low coherence peaks with high gap\nenergy. Figure 9 compares the spatial\nP dependence of the\nbare impurity potential Vr − NL−1 r Vr and the renorP\nmalized impurity potential Ṽr − NL−1 r Ṽr . Here, we\nhave subtracted the spatial average of the potential. It is\nclear that the renormalized impurity potential has much\nsmaller and smoother variation.\nNunner et al.23 pointed out for the conventional BdG\nequation with smoothly varying potential that the LDOS\nat site r is similar to the DOS in the uniform system\nwith shifted chemical potential μ̃ = μ − Vr . This argument can be also applied to our system. However, the\nGutzwiller renormalization factors make a difference in\nthe relation among the hole density xr , the gap energy,\nand the height of the coherence peaks. In the systems\nwithout the Gutzwiller projection, ∆ij is determined by\nthe DOS near the Fermi level. Namely, ∆ij takes maximum when the chemical potential is at the van Hove\nsingularity. Accordingly, when ∆ij is large, the gap energy and the peak height are also large. In contrast,\n\n\f8\n0.5\n\nA\nB\n\nLDOS\n\n0.4\n0.3\n\nV.\n\nHole Density\nC\n\nD\n\nC\nB\n\n0.2 D\n\nA\n\n0.1\n0\n-0.4 -0.2\n\n0\n\n0.2\n\n0.4\n\n0\n\n0.1\n\n0.2\n\n0.3\n\nE\u0090t\nFIG. 8: (Color online) (Left) The LDOS at 4 sites A, B,\nC and D indicated in the right figure, for the system with\nsmoothly varying potential with x = 1/8, VC = 1t, d = 1,\nNimp = 12, and supercell size 20×20 sites, solved by the\nGutzwiller-projected BdG equation. (Right) The hole density distribution in a supercell. The white dots are positions\nof the impurities.\n\n0.8\n0.6\n\nV\u0090t\n\n0.4\n\nVi -Vav\n\u008e \u008e\nVi -Vav\n\n0.2\n0\n-0.2\n-0.4\nH0,0L\n\nH10,10L\n\nH19,19L\n\ni\nFIG. 9: (Color online) Spatial\ndependence of the bare impuP\nrity potential Vi − NL−1 i Vi and the renormalized impurity\nP\npotential Ṽi − NL−1 i Ṽi along a diagonal line (from the left\nbottom to the right top in the hole density plot of Fig. 8).\n\nwith the Gutzwiller renormalization factors, as x → 0,\nt\n(i) the band shrinks by gij\nand thus the DOS near the\nFermi level increases, and (ii) the pairing interaction is\ns\nenhanced by gij\n. Because of (i) and (ii), ∆ij and the gap\nenergy monotonically increases as x → 0. Furthermore,\nt\nthe LDOS contains an extra factor gii\n, and thus the peak\nheight decreases as x decreases.\nNote that this anticorrelation between the gap energy\nand the peak height as well as the large gap distribution is\nconsistent with the experiments6,26 . However, according\nto our calculation, the large spatial variation in the LDOS\naccompanies large variation in the hole density, which has\nyet to be verified by the experiments.\n\nSUMMARY AND DISCUSSION\n\nIn this paper, we have investigated the renormalization of the impurity potential by the strong correlation.\nThe VMC calculation has shown that impurity potential\nscattering matrix elements between Gutzwiller-projected\nquasi-particle excited states are as strongly renormalized\nas the hopping terms. It may be understood by the\nFourier transform of the δ-function impurity potential\nhaving a form of the hopping term in k space. The (realspace) hopping term is known to be renormalized by a\nfactor less than unity because it is more difficult to hop in\nthe presence of the double occupancy prohibition. Even\nin k space, if electrons are densely packed in the lattice,\nit must be similarly difficult to hop from k to k ′ 6= k, then\nthe impurity potential and the hopping term should be\nrenormalized similarly.\nSuch reduction in the impurity potential is also seen by\nthe BdG equation with local Gutzwiller renormalization\nfactors. Near the half filling of the strongly correlated\nsystems, the influence of the non-magnetic impurity potential on the ground state is small because each site has\nto be occupied by almost one electron in any case. However, the impurity potential does affect the ground-state\nenergy. Such properties appear by taking into account\neffective local chemical potential, which is paid little attention to in the literature. In addition, the local chemical potential effectively broadens the impurity potential\nbecause holes prefer to move around to gain the kinetic\nenergy. Effect of smoothly varying impurity potential\nhas been briefly discussed. It shows large gap distribution. If the Gutzwiller renormalization factors are taken\ninto account, the gap energy and the peak height are\nanticorrelated. These properties are consistent with the\nexperiments6,26 .\nIn fair comparison, there are also some disagreements\nwith the experiments. According to our results, shortrange non-magnetic potential variations are reduced,\nthus the system is more uniform, and accordingly the dwave superconductivity can be robust. However, in the\nexperiments, the system seems quite disordered but still\nthe d-wave is robust. Such short-range disorder may be\nintroduced by spatial modulation of tij or J, which can\nbe enhanced by the strong correlation10, or by magnetic\nimpurities, or by the electron-lattice interaction36 .\nIn addition, although the smooth impurity potential\nvariation yields anticorrelation between the gap energy\nand the peak height, it does not show the almost spatially independent V-shaped LDOS at low energy seen\noften in the experiments, which can be explained instead\nin the case of the rapid potential variation37 . In our\nprevious paper37 , we have discussed the LDOS of stripe\nstates, where ∆ij contains two components; one is spatially uniform and the other is oscillating, typically with\nwave number q = π/4 or π/2. Then, the V-shaped gap is\ndetermined by the uniform component, and the oscillating component influences it little. As a result, the linear\nslope of V-shape is robust (it does not have much spa-\n\n\f9\ntial dependence). This is rather counterintuitive because\none may think that the local gap could be determined\nby ∆ij . However, the superconducting gap is not determined by such local properties, but by \"coherence\",\ni.e., spatial dependence of ∆ij . Let us recall that, in\nthe case of the zero-momentum pairing as the conventional BCS theory, the spin-up electron band couples\nwith the spin-down hole band (upside-down spin-down\nelectron band); these bands intersect at the Fermi level,\nand a gap opens by a nonzero superconducting order parameter. On the other hand, the oscillating components\ncontain only pairing with nonzero center-of-mass momentum. Then, the spin-up electron band couples with the\nq-shifted (or multiples-of-q shifted) spin-down hole band.\nThe point is, these bands typically intersect not at the\nFermi level except for limited points. In such cases, the\nV-shape of the LDOS is not affected a lot.\nSimilarly, oscillations of the variational parameters\nother than ∆ij with wave number q mix \"the bare band\"\nand \"the bands shifted by multiples of q\". Such terms\nchange the band structure especially near band intersections. However, this change in the band structure is not\nrelated to the superconductivity, at least in the meanfield approximation. The superconducting DOS depends\non where one puts the chemical potential, but general\nproperties near the V-shaped LDOS is determined by\n∆ij .\nThe smooth impurity potential variation considered in\nSec. IV D is similar to the stripe states with q ≃ 0. Since\nq is small, the oscillating components of ∆ij has effect\nsimilar to the uniform component q = 0. Namely, it\naffects every state at the Fermi level. However, the gap\nhas now spatial dependence because q is not completely\nzero. In this case, the local gap is determined by ∆ij ;\nthe LDOS at sites i is similar to the DOS in the uniform\n ̃ x = −∆\n ̃ y = ∆i,i+x̂ , χ̃ = χij , and μ̃ =\nsystem with ∆\nμ − Vi . Therefore, there is nothing like the \"uniform\ncomponent\" in the argument of the stripe state, and thus\nthe linear slope of V-shape in the LDOS is not robust\nanymore. This issue will be addressed in the future.\n\nAcknowledgments\n\nThe authors thank C.-M. Ho for stimulating discussions. This work was supported by the National Science Council in Taiwan with Grant no.95-2112-M-001061-MY3. Part of the numerical calculation was performed in the IBM Cluster 1350, the Formosa II Cluster\nand the Triton Cluster in the National Center for Highperformance Computing in Taiwan, and the PC Farm II\nof Academia Sinica Computing Center in Taiwan.\n\nAPPENDIX A: LDOS ASYMMETRY CAUSED\nBY δ-FUNCTION POTENTIAL\n\nAs shown in Fig. 6, the δ-function potential causes\nasymmetry in the LDOS near the impurity site. Such\nasymmetry may be important because some STM experiments analyze data by taking the ratio between intensities of positive and negative bias7 : the symmetric part of\nthe LDOS is canceled and its asymmetric part remains.\nTo explain the origin of the asymmetry, let us diagonalize\nthe BdG Hamiltonian of a simple two-site problem analytically in the following. We know that it is not realistic\nto apply the mean-field approximation to two-site problems. However, it provides us some insight into numerical\nsolutions in the bulk systems.\nSuppose the potentials at sites 1 and 2 are V (> 0)\nand −V , respectively. By putting the states in the order\nof electrons 1 ↑, 2 ↑, and holes 1 ↓, 2 ↓, the BdG Hamiltonian matrix is written as\n\n\nV −t 0 ∆\n−t −V ∆ 0 \n.\n(A1)\nH2site = \n0 ∆ −V t \n∆ 0\nt V\n\nLet us start from a simple case of t = 0 and assume\nV < ∆. Then, ∆ mixes 1 ↑ electron and 2 ↓ hole with\nthe equal weights. We call the linear combination of\nthem with positive and negative energy the quasi-particle\nA+ and A− , respectively. Similarly, B± denotes the linear combination of 2 ↑ electron and 1 ↓ hole with positive/negative energy.\nIf V = 0, A and B are degenerate. Finite but small\nV causes energy difference between A and B, namely,\nEA± = ±∆ + V , EB± = ±∆ − V . In the ground state,\nA− and B− are occupied, but A+ and B+ are unoccupied. First we focus on 1↑. Then, the electron addition\nspectrum is at E = EA+ , the removal is at E = EA− .\nNamely, the finite V just shifts the whole spectra by V ,\nand the local spectra are not symmetric around E = 0.\nOn the other hand, the spectra of site 2 shift by −V . As\na result, the spectra summed over sites 1 and 2 are still\nsymmetric. As for 1↓, the addition is at −EB− = EA+ ,\nand the removal is at −EB+ = EA− (these negative signs\noriginate from the treatment of 1↓ as a hole), which are\nidentical to the spectra of 1↑ as expected.\nNext, let us consider t 6= 0. Then, t mixes A+\nand B− , and the eigenstates are linear combinations\nof them whose eigenenergies are ±[t2 + (∆ + V )2 ]1/2 .\nThe eigenenergies of superposition of A− and B+ are\n2\n±[t2 + (∆ − V ) ]1/2 . As t increases, the LDOS asymmetry becomes weaker, but it never disappears.\nBack to the bulk systems, maybe we can physically\nexplain the asymmetry as follows. Since J term causes\npairing, a Cooper pair is formed more or less between\nnearest neighbors (site 1,2) when a snapshot is taken.\nThis Cooper pair is a resonance of \"states where sites 1\nand 2 are occupied by electrons\" and \"states where both\nare occupied by holes\". Destruction of the pair leaves\n\n\f10\na quasi-particle. There are two possibilities for it; (i)\nan \"electron at site 1 and hole at site 2\", and (ii) an\n\"electron at 2 and hole at 1\". The δ-function potential\nlifts the degeneracy of these quasi-particles. That results in the asymmetry in the local spectra although the\nbulk spectra are symmetric as in the two-site problem\nabove. In the bulk system, the spectra are continuous,\n\n1\n2\n3\n4\n5\n6\n\n7\n8\n9\n\n10\n\n11\n\n12\n\n13\n14\n\n15\n\n16\n\n17\n\n18\n\n19\n20\n\nP. W. Anderson, J. Phys. Chem. Solids 11 26 (1959).\nA. N. Pasupathy, et al., Science 320, 196 (2008).\nK. McElroy, et al., Phys. Rev. Lett. 94, 197005 (2005).\nX. J. Zhou, et al., Phys. Rev. Lett. 92, 187001 (2004).\nK. M. Shen, et al., Science 307, 901 (2005).\nA. C. Fang, L. Capriotti, D. J. Scalapino, S. A. Kivelson, N. Kaneko, M. Greven, and A. Kapitulnik, Phys. Rev.\nLett. 96 017007 (2006).\nY. Kohsaka et al., Science 315 1380 (2007).\nP. W. Anderson, Science 288 480 (2000).\nA. Garg, M. Randeria, N. Trivedi, Nature Phys. 4, 762\n(2008).\nN. Fukushima, C.-P. Chou, T. K. Lee, J. Phys. Chem.\nSolids 69, 3046 (2008).\nQ.-H. Wang, Z.D. Wang, Y. Chen and F.C. Zhang, Phys.\nRev. B 73, 092507 (2006).\nC. Li, S. Zhou, and Z. Wang, Phys. Rev. B 73 060501(R)\n(2006).\nN. Fukushima, Phys. Rev. B 78, 115105 (2008).\nH. Alloul, J. Bobroff, M. Gabay, P. J. Hirschfeld, Rev.\nMod. Phys. 81, 45 (2009).\nY. Chen and C. S. Ting, Phys. Rev. Lett. 92, 077203\n(2004).\nJ. W. Harter, B. M. Andersen, J. Bobroff, M. Gabay, and\nP. J. Hirschfeld, Phys. Rev. B 75, 054520 (2007).\nH. Tsuchiura, Y. Tanaka, M. Ogata, and S. Kashiwaya,\nPhys. Rev. B 64, 140501(R) (2001).\nM. Ogata and A. Himeda, J. Phys. Soc. Jpn. 72, 374\n(2003).\nZ. Wang and P. A. Lee, Phys. Rev. Lett. 89, 217002 (2002).\nM. Gabay, E. Semel, P. J. Hirschfeld, and W. Chen, Phys.\n\nand the spectral shift by the impurity potential is larger\nat high energy than at low energy because (i) the nearnodal quasi-particles at low energy are less influenced by\nthe impurity potential because there are not many states\nto mix with, and (ii) the shift is caused by ∆ and it is\nsmaller at lower energy.\n\n21\n22\n\n23\n\n24\n\n25\n\n26\n27\n\n28\n\n29\n\n30\n\n31\n\n32\n33\n34\n\n35\n\n36\n37\n\nRev. B 77, 165110 (2008).\nS.-D. Liang and T. K. Lee, Phys. Rev. B 65, 214529 (2002).\nQ.-H. Wang and D.-H. Lee, Phys. Rev. B 67, 020511(R)\n(2003).\nT.S. Nunner, B.M. Andersen, A. Melikyan, and P.J.\nHirschfeld, Phys. Rev. Lett. 95, 177003 (2005).\nB. M. Andersen and P. J. Hirschfeld, Phys. Rev. Lett. 100,\n257003 (2008).\nW. Ziegler, H. Endres, and W. Hanke, Phys. Rev. B 58,\n4362 (1998).\nK. McElroy et al., Science 309, 1048 (2005).\nC.-P. Chou, T. K. Lee, and C.-M. Ho, J. Magn. Magn.\nMater. 310, 474 (2007).\nC.-P. Chou, T. K. Lee, C.-M. Ho, Phys. Rev. B 74, 092503\n(2006).\nF. C. Zhang, C. Gros, T. M. Rice, H. Shiba, Supercond.\nSci. Technol. 1, 36 (1988).\nD. Poilblanc, D. J. Scalapino, and W. Hanke, Phys. Rev.\nB 50, 13020 (1994).\nW. Ziegler, D. Poilblanc, R. Preuss, W. Hanke, D. J.\nScalapino, Phys. Rev. B 53, 8704 (1996).\nN. Bulut, Phys. Rev. B 61, 9051 (2000).\nY. Ohashi, J. Phys. Soc. Jpn. 70, 2054 (2001).\nH. Tsuchiura, Y. Tanaka, M. Ogata, and S. Kashiwaya,\nPhys. Rev. Lett. 84, 3165 (2000).\nM. Capello, M. Raczkowski, and D. Poilblanc, Phys. Rev.\nB 77, 224502 (2008).\nC.-P. Chou and T. K. Lee, in preparation.\nC.-P. Chou, N. Fukushima, and T. K. Lee, Phys. Rev. B\n78, 134530 (2008).\n\n\f"}