{"id": "http://arxiv.org/abs/1009.3283v1", "guidislink": true, "updated": "2010-09-16T20:40:25Z", "updated_parsed": [2010, 9, 16, 20, 40, 25, 3, 259, 0], "published": "2010-09-16T20:40:25Z", "published_parsed": [2010, 9, 16, 20, 40, 25, 3, 259, 0], "title": "Concerning the existence of Einstein and Ricci soliton metrics on\n  solvable Lie groups", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1009.2667%2C1009.3495%2C1009.1439%2C1009.3864%2C1009.3344%2C1009.3147%2C1009.6201%2C1009.1111%2C1009.1648%2C1009.0923%2C1009.5309%2C1009.5568%2C1009.3813%2C1009.1498%2C1009.2888%2C1009.4122%2C1009.1581%2C1009.0267%2C1009.1944%2C1009.4557%2C1009.4272%2C1009.2482%2C1009.5352%2C1009.0381%2C1009.1010%2C1009.2235%2C1009.4318%2C1009.1892%2C1009.3800%2C1009.1301%2C1009.0743%2C1009.5116%2C1009.3441%2C1009.1719%2C1009.1912%2C1009.3577%2C1009.3516%2C1009.6035%2C1009.0778%2C1009.3401%2C1009.6013%2C1009.4150%2C1009.3614%2C1009.0866%2C1009.4099%2C1009.1126%2C1009.5159%2C1009.5601%2C1009.5884%2C1009.0631%2C1009.3773%2C1009.6212%2C1009.6001%2C1009.5056%2C1009.5773%2C1009.2743%2C1009.2328%2C1009.3286%2C1009.5749%2C1009.3346%2C1009.3278%2C1009.1157%2C1009.1185%2C1009.5620%2C1009.3776%2C1009.1497%2C1009.4692%2C1009.4507%2C1009.1570%2C1009.1054%2C1009.4187%2C1009.2747%2C1009.0656%2C1009.1361%2C1009.3221%2C1009.2637%2C1009.4327%2C1009.0125%2C1009.5086%2C1009.2080%2C1009.4652%2C1009.5187%2C1009.3192%2C1009.5424%2C1009.2298%2C1009.5465%2C1009.3283%2C1009.0709%2C1009.4337%2C1009.1174%2C1009.6033%2C1009.3402%2C1009.2652%2C1009.5417%2C1009.0590%2C1009.0873%2C1009.4845%2C1009.4982%2C1009.4804%2C1009.1534%2C1009.0679&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Concerning the existence of Einstein and Ricci soliton metrics on\n  solvable Lie groups"}, "summary": "In this work we investigate solvable and nilpotent Lie groups with special\nmetrics. The metrics of interest are left-invariant Einstein and algebraic\nRicci soliton metrics. Our main result shows that the existence of a such a\nmetric is intrinsic to the underlying Lie algebra. More precisely, we show how\none may determine the existence of such a metric by analyzing algebraic\nproperties of the Lie algebra in question and infinitesimal deformations of any\ninitial metric.\n  Our second main result concerns the isometry groups of such distinguished\nmetrics. Among the completely solvable unimodular Lie groups (this includes\nnilpotent groups), if the Lie group admits such a metric, we show that the\nisometry group of this special metric is maximal among all isometry groups of\nleft-invariant metrics. We finish with a similar result for locally\nleft-invariant metrics on compact nilmanifolds.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1009.2667%2C1009.3495%2C1009.1439%2C1009.3864%2C1009.3344%2C1009.3147%2C1009.6201%2C1009.1111%2C1009.1648%2C1009.0923%2C1009.5309%2C1009.5568%2C1009.3813%2C1009.1498%2C1009.2888%2C1009.4122%2C1009.1581%2C1009.0267%2C1009.1944%2C1009.4557%2C1009.4272%2C1009.2482%2C1009.5352%2C1009.0381%2C1009.1010%2C1009.2235%2C1009.4318%2C1009.1892%2C1009.3800%2C1009.1301%2C1009.0743%2C1009.5116%2C1009.3441%2C1009.1719%2C1009.1912%2C1009.3577%2C1009.3516%2C1009.6035%2C1009.0778%2C1009.3401%2C1009.6013%2C1009.4150%2C1009.3614%2C1009.0866%2C1009.4099%2C1009.1126%2C1009.5159%2C1009.5601%2C1009.5884%2C1009.0631%2C1009.3773%2C1009.6212%2C1009.6001%2C1009.5056%2C1009.5773%2C1009.2743%2C1009.2328%2C1009.3286%2C1009.5749%2C1009.3346%2C1009.3278%2C1009.1157%2C1009.1185%2C1009.5620%2C1009.3776%2C1009.1497%2C1009.4692%2C1009.4507%2C1009.1570%2C1009.1054%2C1009.4187%2C1009.2747%2C1009.0656%2C1009.1361%2C1009.3221%2C1009.2637%2C1009.4327%2C1009.0125%2C1009.5086%2C1009.2080%2C1009.4652%2C1009.5187%2C1009.3192%2C1009.5424%2C1009.2298%2C1009.5465%2C1009.3283%2C1009.0709%2C1009.4337%2C1009.1174%2C1009.6033%2C1009.3402%2C1009.2652%2C1009.5417%2C1009.0590%2C1009.0873%2C1009.4845%2C1009.4982%2C1009.4804%2C1009.1534%2C1009.0679&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "In this work we investigate solvable and nilpotent Lie groups with special\nmetrics. The metrics of interest are left-invariant Einstein and algebraic\nRicci soliton metrics. Our main result shows that the existence of a such a\nmetric is intrinsic to the underlying Lie algebra. More precisely, we show how\none may determine the existence of such a metric by analyzing algebraic\nproperties of the Lie algebra in question and infinitesimal deformations of any\ninitial metric.\n  Our second main result concerns the isometry groups of such distinguished\nmetrics. Among the completely solvable unimodular Lie groups (this includes\nnilpotent groups), if the Lie group admits such a metric, we show that the\nisometry group of this special metric is maximal among all isometry groups of\nleft-invariant metrics. We finish with a similar result for locally\nleft-invariant metrics on compact nilmanifolds."}, "authors": ["Michael Jablonski"], "author_detail": {"name": "Michael Jablonski"}, "author": "Michael Jablonski", "links": [{"title": "doi", "href": "http://dx.doi.org/10.2140/gt.2011.15.735", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1009.3283v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1009.3283v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "28 pages", "arxiv_primary_category": {"term": "math.DG", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "math.DG", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1009.3283v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1009.3283v1", "journal_reference": "Geom. Topol. 15 (2011) 735-764", "doi": "10.2140/gt.2011.15.735", "fulltext": "Concerning the existence of Einstein and Ricci soliton metrics on\nsolvable Lie groups\n\narXiv:1009.3283v1 [math.DG] 16 Sep 2010\n\nM.Jablonski\nAbstract\nIn this work we investigate solvable and nilpotent Lie groups with special metrics. The metrics of\ninterest are left-invariant Einstein and algebraic Ricci soliton metrics. Our main result shows that the\nexistence of a such a metric is intrinsic to the underlying Lie algebra. More precisely, we show how one\nmay determine the existence of such a metric by analyzing algebraic properties of the Lie algebra in\nquestion and infinitesimal deformations of any initial metric.\nOur second main result concerns the isometry groups of such distinguished metrics. Among the\ncompletely solvable unimodular Lie groups (this includes nilpotent groups), if the Lie group admits such\na metric, we show that the isometry group of this special metric is maximal among all isometry groups\nof left-invariant metrics. We finish with a similar result for locally left-invariant metrics on compact\nnilmanifolds.\n\n1\n\nIntroduction\n\nOur primary interest in this work is (left-invariant) Einstein metrics on non-compact Lie groups. All known\nexamples of such metrics occur on solvable Lie groups. In fact, all known examples of non-compact homogeneous Einstein metrics are isometric to solvable Lie groups with left-invariant metrics; this is the content\nof the well-known Alekseevskii conjecture which has been verified in dimensions 4 and 5 [Jen69, Nik05]. We\nrestrict ourselves to this class of Lie groups and ask when such a group admits an Einstein metric.\nThe answer in the compact setting is well-known. If a compact group G admits an Einstein metric, then\neither\n(i) G is a torus (zero scalar curvature) or\n(ii) G is a compact semi-simple Lie group (positive scalar curvature).\nThe first case of Ricci flat follows from a general result of Alekseevskii-Kimelfeld where it is shown that any\nhomogeneous Ricci flat space is actually flat [AK75]. For the positive scalar curvature case, such metrics\nare characterized as critical points of the total scalar curvature functional [Jen71]. On compact semi-simple\ngroups, Einstein metrics are not unique and most groups admit at least 2 such metrics (this is in sharp\ncontrast to the solvable setting, where Einstein metrics are unique up to isometry and scaling).\nWe observe that the existence of an Einstein metric on a compact Lie group is completely determined\nby the underlying Lie algebra. The flat case corresponds to abelian Lie algebras. The positive case is\ncharacterized as follows. Let g denote the Lie algebra of G, then G is compact semi-simple if and only if the\nKilling form B(X, Y ) = tr(ad X ◦ ad Y ), with X, Y ∈ g, is negative definite.\nOur work is motivated by, and seeks to answer, the following questions.\nQuestion 1.1. Given a solvable Lie group, how can one determine if it admits an Einstein or solsoliton\nmetric?\nQuestion 1.2. If a solvable Lie group is known to admit an Einstein or solsoliton metric, how does one\nfind it?\n\n1\n\n\fAs the curvature tensors of left-invariant metrics are left-invariant, the above questions reduce to studying\ninner products on a given Lie algebra. More precisely, consider a solvable Lie algebra g with corresponding\nLie group G. Let h*, *i be an inner product on g with corresponding left-invariant metric on G. The Ricci\ncurvature of (G, h*, *i) is completely determined by its values on g (by left-invariance) and is given by the\nformula\n1X\n1X\n1X\nric(X, X) = −\n|[X, Xi ]|2 −\nh[X, [X, Xi ]], Xi i +\nh[Xi , Xj ], Xi2 − h[Z, X], Xi\n2 i\n2 i\n4 i,j\nwhere {Xi } is an orthonormal basis of g and Z ∈ g is the unique vector satisfying hZ, Xi = tr(ad X). Observe\nthat the Ricci curvature is completely determined by the Lie bracket and inner product on g. Denoting the\n(1, 1)-Ricci tensor by Ric, Question 1.1 may be rephrased as follows.\nQuestion. When does there exist an inner product h*, *i on g, such that\nRic = cId + D\n\n(1.1)\n\nfor some c ∈ R and some D ∈ Der(g)?\nHere Der(g) denotes the algebra of derivations of g. Terminology: when D = 0, the metric is called an\nEinstein metric; when D 6= 0, the metric is called a solsoliton. Solsolitons are algebraic examples of Ricci\nsolitons, see Section 2.\nOur main result shows that a definite answer to Question 1.1 can be obtained by analyzing only local\ndata: algebraic information about the underlying Lie algebra and infinitesimal deformations of any metric;\nsee Section 10 for complete details and the procedure referenced by the following theorem.\nTheorem 10.1. Let G be a solvable Lie group with Lie algebra g. The existence of a left-invariant Einstein\nmetric on G can be determined by analyzing the following: 1) adjoint action of g on itself, 2) the commutator\nsubalgebra n = [g, g], and 3) infinitesimal deformations of any initial metric on n.\nRemark. The existence of an Einstein metric on a solvable Lie group is now a local question. Similarly,\none can formulate the question of existence of a solsoliton in terms of local data.\nIn general, the existence of an Einstein or Ricci soliton metric is not a local question. It might appear\nat first glance that the existence of left-invariant Einstein metrics on Lie groups is a local question since the\nverification of Equation 1.1 uses only the inner product and Lie bracket on g. However, asking if a Lie group\n2\nadmits such a metric amounts to asking if there exists a zero of the function ||Ricg − sc(g)\nn Id|| on the open\nset of inner products. It is not clear if this is a local question for non-solvable Lie groups; e.g., there does\nnot exist a solution when the Lie algebra is sl2 R.\nIn the setting of compact homogeneous spaces G/H, the Einstein question has received a great deal of\nattention and there are some partial results on the existence of such metrics. For example, if G is a compact\nsemi-simple group and H is a maximal connected subgroup of G, then G/H admits a G-invariant Einstein\nmetric [WZ86]. However, there exist many examples of homogeneous spaces G/H which don't admit Ginvariant Einstein metrics. Presently, there are not any general, local conditions that guarantee/exclude the\nexistence of such metrics on compact homogeneous spaces; see [BWZ04] for the current state of research.\nOur work builds on the strong structural results of Heber [Heb98] and Lauret [Lau07]. These works take\nthe first step in reducing the problem on the solvable group to a smaller solvable group, a one dimensional\nextension of a nilpotent group. This smaller solvable Lie group admits an Einstein metric if and only if\nits nilradical admits a so-called nilsoliton metric and the underlying Lie algebra is the extension of the\nnilradical by a so-called pre-Einstein derivation. Reducing the problem to analyzing the nilradical is an\nalgebra problem.\nTo study the nilradical we build on the work of Nikolayevsky [Nik08a]. Using a combination of measuring\nalgebraic information and infinitesimal deformations of metrics on the nilradical, we translate the Einstein\n2\n\n\fproblem into a local problem. (While we could skip this analysis on the nilradical and couple our techniques\ndirectly with the work of Heber [Heb98, Section 6], we present our results in the given framework as these\nmethods extend directly to solsoliton and nilsoliton metrics. See Section 9 for more details.)\nOur second main result is an algebraic decomposition theorem for solvable groups admitting Einstein\nmetrics. If one were to classify the solvable groups admitting Einstein or solsoliton metrics, one would want\nto construct such groups from basic building blocks. The question of existence of an Einstein or solsoliton\nmetric can be reduced to the case that the underlying Lie algebra is indecomposable.\nTheorem 4.8 Let G be a solvable Lie group whose Lie algebra g = g1 + g2 is a direct sum of ideals. Then G\nadmits a non-flat solsoliton, resp. flat, metric if and only if both G1 and G2 admit non-flat solsoliton, resp.\nflat, metrics.\nCorollary 4.9 Let G be a solvable Lie group whose Lie algebra g = g1 + g2 is a direct sum of ideals. Then\nG admits an Einstein metric if and only if both G1 and G2 admit Einstein metrics of the same sign.\nRemark. A similar decomposition result has appeared for nilsolitons and nilpotent Lie groups, see [Nik08a]\nand [Jab08a]. To our knowledge, the above algebraic decomposition theorem is the first of its kind for\nhomogeneous Einstein spaces. It would be interesting to know if there is a similar theorem in the compact\nsetting; there are some partial results of Böhm in this direction [Böh04, Theorem B].\nIn addition to providing a local formulation of the existence of such a metric on a solvable Lie group, we\ndemonstrate how to recover such metrics by following two natural curves of metrics (see Proposition 5.4).\nUsing these curves, we demonstrate that solsolitons (when they exist) are the most symmetric metric on\ncompletely solvable unimodular Lie groups (this class includes nilpotent Lie groups).\nTheorem 5.8 Let S be a completely solvable unimodular Lie group that admits a solsoliton metric. Let\ng be any left-invariant metric. Then there exists a left-invariant soliton metric g ′ such that Isom(S, g) ⊂\nIsom(S, g ′ ), as groups.\nThis result is extended to compact nilmanifolds with local nilsoliton metrics in Theorem 6.3.\nTable of Contents. Section 2 reviews information on Lie groups with left-invariant metrics. Section 3\ndiscusses the space of Lie brackets, moment maps, and distinguished orbits. Section 4 compares the existence\nof solsoliton metrics and distinguished orbits. Section 5 studies the bracket flow with applications to finding\nsolsoliton metrics and comparisons of isometry groups. Section 6 states results on compact nilmanifolds.\nSection 7 discusses the stratification of the space of Lie brackets. Section 8 covers pre-Einstein derivations\nand the previous work of Nikolayevsky. Sections 9 and 10 show the existence of nilsoliton and Einstein\nmetrics are intrinsic to the underlying Lie algebra, respectively.\n\n2\n\nRiemannian Lie groups\n\nA Lie group G is called a Riemannian Lie group if it is endowed with a left-invariant metric. The following\nquestion motivates much of our work.\nQuestion 2.1. Among left-invariant metrics on a given Lie group, is there a canonical or preferred choice\nof metric?\nSpecial metrics are often characterized as those having good curvature properties or as solutions to\nsome extremal problem. For example, we are interested in metrics satisfying one or several of the following\nconditions\n\n3\n\n\f1.\n2.\n3.\n4.\n\nNice curvature properties or curvature tensor\nCritical points of a Riemannian functional on the set of metrics\nMore generally, fixed points of a dynamical system\nLarge group of isometries\n\nClassically, spaces with constant sectional and Ricci curvature have been investigated as preferred metrics\non a manifold; the later are known as Einstein metrics. We are interested in left-invariant Einstein metrics\nwhen they exist; however, many of our Lie groups are not able to admit left-invariant Einstein metrics. For\nexample, any non-abelian nilpotent Lie group cannot admit an Einstein metric [Jen69, Mil76] and many\nsolvable Lie groups do not admit Einstein metrics (cf. Theorem 5.11).\nGiven that many of our Lie groups will not be able to admit an Einstein metric, we explore alternate\nmetrics in search of one which is 'distinguished' or preferred in some way. One natural generalization of the\nEinstein metric is the so-called Ricci soliton metric. A metric g is called a Ricci soliton if there exists a\ncomplete vector field X ∈ X(G) and constant c ∈ R such that\nricg = cg + LX g\nwhere LX is the Lie derivative generated by X. These metrics arise as special solutions to the Ricci flow\nwhich are of the form g(t) = c(t)φ∗ (t)g where c(t) is a real-valued function and φ(t) is the 1-parameter group\nof diffeomorphisms that generates X ∈ X(G). Hence, Ricci solitons can be viewed as generalized fixed points\nof the Ricci flow on the space of metrics modulo diffeomorphisms; see [CK04] for an introduction to Ricci\nflow and Ricci solitons.\nOn a Riemannian Lie group G there is a very natural kind of Ricci soliton, which we call an algebraic\nRicci soliton, or algebraic soliton for short. A left-invariant metric g is called an algebraic soliton if the Ricci\ntensor (evaluated at the identity e ∈ G) is of the form\nRic = cId + D\nfor some D ∈ Der(g). In the above equation, we have written the Ricci (1, 1)-tensor Ric instead of the (2, 0)tensor ric as in the definition of Ricci soliton above; this is done for ease of presentation. The derivation\nD generates the 1-parameter family of automorphisms φ(t) = exp(tD) which is the corresponding family of\ndiffeomorphisms from the definition of Ricci soliton.\nRemark. 1) By left-invariance of the metric on G, it suffices to only prescribed the value of Ric at e ∈ G.\n2) Presently, the only known examples of Ricci solitons on Riemannian Lie groups are algebraic solitons and\nthese are only known to exist on solvable Lie groups.\nWhen G is a nilpotent group, such a metric is often called a nilsoliton in the literature and if G is solvable,\nsuch a metric has been called a solsoliton.\n\nNilpotent Lie groups\nAs nilpotent Lie groups cannot admit Einstein metrics, we will search for left-invariant Ricci soliton metrics\non such spaces. These metrics satisfy several of the criteria listed above for being a preferred metric. Before\nstating the next theorem, we need some notation. Given a nilpotent Lie group G, denote by MG the set of\nleft G-invariant metrics on G (i.e. inner products on g). Recall that Rich is left G-invariant for h ∈ MG .\nTheorem 2.2. [Lau01a, Jab10]\ni. (Algebro-analytic characterization)\nEvery left-invariant Ricci soliton on a nilpotent Lie group G is an algebraic soliton, that is,\nRic = cId + D\nfor some D ∈ Der(g).\n4\n\n\fii. (Variational characterization)\nA metric g ∈ MG is a nilsoliton if and only if g is a critical point of the functional\nF (h) =\n\ntr Ric2h\nsc(h)2\n\non MG , where sc(h) denotes the (constant) scalar curvature of (G, h). (This functional makes sense\nas a real-valued function by left-invariance of Ric.)\niii. (Uniqueness)\nIf a nilsoliton exists on G, then it is unique (up to isometry) after prescribing the scalar curvature.\nRemark 2.3. The above results are primarily due to Lauret [Lau01a]. Part ii. was originally proven where\nthe functional considered was on the space of Lie brackets, this result has been extended to the setting of\nleft-invariant Riemannian metrics in [Jab10] where new convergence results are also obtained.\nThere is a small gap in the original proof of Part i. above. In that work, it is shown that if the metric is\na soliton, then there exists a derivation D ∈ Der(g) such that Ric = cId + 12 (D + Dt ). The gap is fixable\nby showing that there exists such D satisfying Dt ∈ Der(g); this will appear in a future work of that author\n[Lau].\nObserve that g ∈ MG is a nilsoliton if and only if g is a critical point of the functional\nF (h) = tr Ric2h\nalong the set {h ∈ MG | sc(h) = sc(g)}. A similar functional can be studied on compact nilmanifolds, see\nSection 6.\nIn the sequel, we will see that nilsolitons have maximal isometry groups among all left-invariant metrics.\nMore precisely we have the following result, see Corollary 5.9.\nCorollary Let G be a nilpotent Lie group which admits a nilsoliton metric. Let g ∈ MG be any left-invariant\nmetric on G. Then there exists a nilsoliton g ′ ∈ MG on G such that Isom(g) ⊂ Isom(g ′ ).\nRemark 2.4. In this way, we see that nilsolitons are the most symmetric left-invariant metric on a nilpotent\nLie group. However, there are other non-soliton metrics which can have the same isometry group. It\nwould be interesting to know which other geometric properties these highly symmetric nilmanifolds share with\nnilsolitons.\nThe property of being an Einstein nilradical is intrinsic to the underlying Lie algebra. Moreover, one can\nverify this via an algorithm, see Theorem 9.1 and Section 9.\nTheorem Let N be a nilpotent Lie group with Lie algebra n. The existence of a nilsoliton metric on\na nilpotent Lie group N can be determined by analyzing the derivation algebra Der(n) and infinitesimal\ndeformations of any initial metric on n.\n\nSolvable Lie groups\nThe analysis of Riemannian solvable Lie groups splits into two distinct sets: unimodular and non-unimodular\ngroups. A Lie group G is called unimodular if |det(Ad(g))| = 1 for all g ∈ G. Notice, in particular, that\ntr ad(X) = 0 for X ∈ g when G is unimodular. If G is not unimodular it is called non-unimodular.\nWithin both these classes of solvable Lie groups, we are interested in those which are completely solvable.\nA solvable group G is called completely solvable if ad(X) : g → g has only real eigenvalues, for all X ∈ g.\nObserve that nilpotent Lie groups are unimodular completely solvable, with eigenvalues all zero.\nAs (non-abelian) solvable Lie groups are non-compact, any left-invariant Einstein metric on such a group\nmust have scalar curvature less than or equal to zero by Bonnet-Myers theorem. We recall the following\nresult (cf. [DM82, AK75]).\n5\n\n\fTheorem 2.5 (Alekseevskii-Kimel'fel'd, Dotti). Let G be a solvable Lie group with left-invariant Einstein\nmetric.\n1. The scalar curvature is negative if and only if G is non-unimodular, and\n2. The scalar curvature is zero if and only if G is unimodular.\nIn the case of Ricci flat, the metric is actually flat (i.e., constant zero sectional curvature).\nIn [AK75] it is actually shown that any homogeneous Ricci flat space must be flat. Lie groups with flat\nleft-invariant metrics are necessarily unimodular solvable and have been classified [Mil76].\nTheorem 2.6 (Milnor). A Riemannian Lie group G is flat if and only if its Lie algebra g (with inner\nproduct) splits as an orthogonal direct sum g = a ⊕ n where n is an abelian ideal (the nilradical) and a is an\nabelian Lie algebra such that ad X is skew-symmetric for X ∈ a. Such G is necessarily solvable.\nGiven the simple algebraic structure of these solvable Lie groups, one may classify the solvable Lie groups\nadmitting flat metrics. These are the groups whose Lie algebras are constructed as follows (cf. Theorem\n5.11 where the negative Einstein case is considered).\nProposition 2.7. Let n be an abelian Lie algebra and a ⊂ Der(n) an abelian, reductive subalgebra of\nderivations, all of whose elements have purely imaginary eigenvalues. If G is a (solvable) Lie group whose\nLie algebra is the semi-direct product a ⊕ n, then G admits a flat metric. Conversely, every such solvable\ngroup arises this way.\nProof. Picking a basis of n, we may identify it with Rn . Via this identification, the abelian, reductive algebra\na ⊂ gl(n, R).\nIt is well-known that there exists an inner product on Rn such that a is stable under the transpose\noperation, see [Mos55]. As the eigenvalues of every element in a are purely imaginary, we see that a consists\nof skew-symmetric derivations. Now Milnor's theorem above applies.\nAs the unimodular solvable Lie groups admitting Einstein metrics are understood, our attention is dedicated to analyzing the non-unimodular solvable groups admitting Einstein metrics and both kinds of solvable\ngroups which admit solsoliton metrics. As in the case of nilpotent Lie groups, solsolitons (including Einstein\nmetrics) have several rigid properties. The following results may be found in [Lau10].\nTheorem 2.8 (Lauret). Let (G, g) be a solvable Riemannian Lie group with metric Lie algebra (g, g). Let\nn be the nilradical of g (with induced metric) and a = n⊥ , so that g = a ⊕ n.\ni. (Structural results and the standard property)\nThe Riemannian Lie group G is a solsoliton (i.e. Ric = cId + D) if and only if\na) (n, g) (with the induced metric) is a nilsoliton\nb) a = n⊥ is abelian\nc) (ad A)t ∈ Der(g) (or equivalently, [ad A, (ad A)t ] = 0) for all A ∈ a.\n1\n2\nt\nd) g(A, A) = −1\nc tr S(ad A) for all A ∈ a, where S(ad A) = 2 (ad A + (ad A) )\nii. (Solsolitons are not shrinkers)\nThe constant c satisfying Ric = cId + D satisfies c ≤ 0. Moreover, if c = 0 then D = 0 and the metric\nis flat (cf. Theorem 2.6). This says solsolitons are either so-called steady or expanding Ricci solitons\n(as opposed to shrinking solitons).\niii. (Uniqueness)\nIf a solvable Lie group admits a solsoliton, then it is unique (up to isometry) after prescribing the scalar\ncurvature.\nObserve that Part i.d) implies that the eigenvalues of ad A are not all purely imaginary, for any A ∈ a.\n\n6\n\n\fRemark 2.9. 1) There does exist a variational characterization for Einstein solvmanifolds with codimension 1 nilradical which realizes these spaces as critical points of a 'modified scalar curvature function' (see\n[Lau01b]). 2) As in the case of flat Einstein metrics, we have a characterization of solvable Lie groups which\nadmit Einstein and solsoliton metrics, see Theorem 5.11 and Corollary 5.12.\nLet G be a solvable unimodular Lie group. If G admits a non-trivial solsoliton, it cannot admit a (flat)\nEinstein metric, and conversely, if G admits a (flat) Einstein metric, it cannot admit a non-trivial solsoliton.\nIn this way, solsolitons are a preferred metric on unimodular solvable groups that cannot admit (flat) Einstein\nmetrics. This preference is defended by the following, see Theorem 5.8.\nTheorem. Let G be unimodular completely solvable Lie group which admits a solsoliton metric. Given any\nleft-invariant metric g, there exists a solsoliton metric g ′ such that Isom(g) ⊂ Isom(g ′ ).\nRemark 2.10. Presently, we do not have such a theorem when the group is not completely solvable or for\nnonunimodular solvable Lie groups. Our techniques do allow one to embed a large portion of the isometry\ngroup of any metric into the Einstein or solsoliton metric, however they do not allow one to embed the entire\nisometry group. This question will be addressed in future work.\n\nIsometry groups\nThe group of isometries of a Riemannian solvable Lie group is particularly simple when the group in question\nis a completely solvable unimodular group. The following is Theorem 4.3 of [GW88].\nTheorem 2.11 (Gordon-Wilson). Let G be a completely solvable unimodular Lie group with left-invariant\nmetric g. The full isometry group is a semi-direct product\nIsom(G, g) = K ⋉ G\nwhere K ⊂ Aut(G) is the isotropy subgroup of Isom(G, g) preserving the identity e ∈ G. Under the natural\nidentification Aut(G) ≃ Aut(g) we have K ≃ Aut(g) ∩ O(g), where O(g) is the orthogonal group of the inner\nproduct g on g.\nObserve that this theorem covers the case of any Riemannian nilpotent Lie group.\nDefinition 2.12. Let (G, g) be a Riemannian Lie group. The group G ⋊ (Isom(g) ∩ Aut(G)) is a subgroup\nof isometries which we call the algebraic isometry group.\nThe above theorem says that the algebraic isometry group of a completely unimodular solvable group is\nthe whole isometry group. For non-unimodular solvable groups, it is well-known that the full isometry group\nis significantly larger than its algebraic isometry group [GW88].\n\n3\n\nThe Variety of Lie Brackets\n\nA Lie group G with a left-invariant metric h , i gives rise to a metric Lie algebra {g, h , i}, where g is the Lie\nalgebra of G and the inner product on g is the restriction of the left-invariant metric to Te G ≃ g. Conversely,\na metric Lie algebra gives a left-invariant metric on any Lie group with said Lie algebra. We are primarily\ninterested in simply-connected Lie groups.\nWe say that two metric Lie algebras {g1 , h , i1 } and {g2 , h , i2 } are isomorphic if there exists a Lie\nalgebra isomorphism φ : g1 → g2 such that h , i1 = φ∗ h , i2 . Such an isomorphism lifts to give an isometry\nbetween the simply-connected Riemannian Lie groups {G1 , h , i} → {G2 , h , i}. In general, most isometries\ndo not arise this way, however, for nilpotent and some solvable groups, this is how all isometries arise (see\nTheorem 2.11).\nTo obtain good information on Riemannian Lie groups, we study metric Lie algebras by considering a\nmetric Lie algebra as a collection of three objects: a vector space Rn , a Lie bracket [*, *] and an inner product\n7\n\n\fh*, *i. We use what is becoming a standard technique and convert our questions into a frame work that can\nexploit deep theorems from Geometric Invariant Theory: Instead of fixing a Lie algebra and varying an inner\nproduct on it, we choose to fix an inner product and vary the underlying Lie algebra structure (within the\nsame isomorphism class).\nFor g ∈ GL(n, R), we may consider a different (and isomorphic) Lie bracket g ∗ [*, *] = g[g −1 *, g −1 *] and\nthe inner product g ∗ h*, *i = hg −1 *, g −1 *i. The following are isomorphic metric Lie algebras\n{Rn , g ∗ [*, *], h*, *i} ≃ {Rn , [*, *], (g −1 )∗ h*, *i}\nvia the isomorphism g −1 : Rn → Rn .\nWe now fix an inner product (the usual one) on Rn and study the collection g ∗ [*, *], g ∈ GL(n, R). It is\nhelpful to study not just this collection of isomorphic Lie algebras on Rn , but instead to study all Lie algebra\nstructures on Rn . Consider the vector space V = ∧2 (Rn )∗ ⊗ Rn , the space of anti-symmetric, bilinear maps\nfrom Rn × Rn → Rn . This vector space is endowed with a natural GL(n, R) action:\n(g ∗ [*, *])(v, w) = g[g −1 v, g −1 w]\nfor g ∈ GL(n, R), v, w ∈ Rn . Via differentiation, we also have an action of gl(n, R) on V . Given X ∈ gl(n, R)\nand v, w ∈ Rn , we have (X * [*, *])(v, w) = X[v, w] − [Xv, w] − [v, Xw].\nThe points of V can be thought of as anti-symmetric algebra structures on Rn , and two algebra structures\nare isomorphic if and only if they lie in the same GL(n, R)-orbit. Any Lie bracket [*, *] on Rn can be realized\nas a point in V and the subset\nV = {μ ∈ V | μ satisfies the Jacobi identity }\nis a variety in V whose points are the Lie brackets on Rn . Additionally, we will restrict our attention to\nsome interesting subsets of V: let N denote the Lie brackets which are nilpotent, S denote the Lie brackets\nwhich are solvable, and CS denote the Lie brackets which are completely solvable (cf. Section 2). We have\nthe following containments\nN ⊂ CS ⊂ S\nThese subsets are all closed in V . We will often abuse language and refer to μ ∈ V as a Lie algebra, when\nwe really mean the pair {Rn , μ}.\nGiven a Lie bracket μ ∈ V, we will denote by sμ the metric Lie algebra {Rn , [*, *], h*, *i}; the corresponding\nsimply connected Lie group with left-invariant metric will be denoted by Sμ .\nRemark 3.1. For k ∈ O(n, R), the groups Sμ and Sk*μ are isometric. However, in general, one often has\nSμ and Sλ which are isometric but λ 6∈ O(n, R) * μ.\nAs it will be of interest later, we point out that the stabilizers of the actions of GLn R and gln R have\nrelevant meaning: (GLn R)μ = Aut(μ) and (gln R)μ = Der(μ).\n\nThe moment map and geometry of orbits\nThe geometry of GL(n, R)-orbits in V is intimately connected to algebraic properties of the Lie group Sμ\nassociated to μ and geometric structures that the group can admit. For example, consider the induced action\nof SL(n, R) on V . For μ ∈ V, SL(n, R) * μ is closed in V if and only if μ is a semi-simple Lie algebra, see\n[Lau03].\nWhen μ is nilpotent, it is known that so-called distinguished orbits (which are generalizations of closed\norbits, see Definition 3.2) correspond precisely to nilpotent Lie groups which admit left-invariant Ricci soliton\nmetrics, see Theorem 3.3. In the sequel, we show that distinguished orbits also play an role in the study of\nsolvable Lie groups and solsolitons.\n\n8\n\n\fBefore defining distinguished orbits, we must define the moment map of a representation of a reductive\ngroup. The moment map defined here works for non-compact groups and is a natural extension of the usual\none defined for compact groups, cf. [EJ09].\nThe group GL(n, R) is endowed with the Cartan involution θ(g) = (g t )−1 , where ∗t denotes the transpose\noperation. By differentiating, we have an involution on gl(n, R) as well, which we denote by the same symbol:\nθ(X) = −X t .\nThese involutions gives rise to so-called Cartan decompositions\ngl(n, R) = k ⊕ p\n\nGL(n, R) = KP\n\nwhere K = O(n) = {g ∈ GL(n, R) | θ(g) = g}, P = {g ∈ GL(n, R) | θ(g) = g −1 }, k = LieK = so(n) =\n{X ∈ gl(n, R) | θ(X) = X}, and p = symm(n) = {X ∈ gl(n, R) | θ(X) = −X}. Here symm(n) denotes the\nsymmetric n × n matrices. Additionally, P = exp(p), where exp is the Lie group exponential.\nLet G be a real algebraic reductive subgroup of GL(n, R) which is θ-stable. For such groups, we obtain\na Cartan decomposition G = KG PG where KG = K ∩ G = Gθ = {g ∈ G | θ(g) = g} is a maximal compact\nsubgroup of G and PG = P ∩ G = {g ∈ G | θ(g) = g −1 }. Similarly, the Lie algebra g = Lie G has a Cartan\ndecomposition g = kG ⊕ pG . Often we will drop the subscript G when the group is understood.\nThe (usual) inner product on Rn extends of an O(n)-invariant inner product h , i on the vector space\nV = ∧2 (Rn )∗ ⊗ Rn as follows\nX\nX\nhλ(ei , ej ), ek ihμ(ei , ej ), ek i\nhλ(ei , ej ), μ(ei , ej )i =\nhλ, μi =\ni<j\n\ni<j\n\nwhere {ei } denotes the standard orthonormal basis of Rn . If we denote by π the representations of GL(n, R)\nand gl(n, R) on V , then it is immediate to see that π(g t ) = π(g)t and π(X t ) = π(X)t , for g ∈ GL(n, R) and\nX ∈ gl(n, R), where the right-hand side represents the metric adjoint with respect to the inner product h , i\non V .\nOn gln R, we consider the standard inner product\nX\nhα, βi = tr αβ t =\nhαei , βei i\n\nwhere t denotes transpose, tr is the trace, and {ei } is the standard orthonormal basis of Rn . This inner\nproduct is Ad(K)-invariant and ad(αt ) = (ad(α))t for α ∈ gln R. Observe that this inner product restricts\nto any θ-stable subalgebra g.\nGiven the above choices of a Cartan involution on g, and inner products on g and V , we may define the\nmoment map mG : V \\{0} → p for the action of G on V . This function is defined implicitly by\nhmG (v), αi =\n\n1\nhπ(α)v, vi,\n||v||2\n\n∀ α ∈ p, v ∈ V\n\nObserve that mG is fixed under rescaling in V and is K-equivariant; that is, for c ∈ R, m(cv) = m(v) and\nfor k ∈ KG , mG (k * v) = Ad(k)mG (v). When the group G is understood, we will simply write m = mG .\nUsing the inner product on g, we consider the norm squared of the moment map\nF (v) = ||m||2 : V \\{0} → R\nNotice that this function is invariant under rescaling in V and so it may be viewed as a function on spheres in\nV or on projective space PV . The critical points of this function have been extensively studied so as to develop\na good understanding of the so-called 'nullcone' of complex representations, see [Kir84, NM84, Mar01].\nMoment maps have also been used to study general representations of non-compact real reductive groups to\nstudy the geometry of orbits, see e.g. [RS90, EJ09, Jab08b].\nDefinition 3.2. An orbit G * v ⊂ V is called distinguished if it contains a critical point of the function\nF = ||m||2 .\n9\n\n\fObserve that v ∈ V is a critical point of F if and only if π(m(v))(v) = rv for some r ∈ R. It is a fact\nthat any closed orbit is distinguished with critical value 0 and so these orbits are a natural generalization of\nclosed orbits, see [Jab08b]. The following theorem motivates a deeper study of ||m||2 on N ⊂ V .\nTheorem 3.3 (Lauret). Let Nμ denote the simply connected nilpotent Lie group with left-invariant metric\nwhose Lie algebra nμ (with inner product) corresponds to the point μ ∈ N . Then Nμ is a nilsoliton if and\nonly if μ is a critical point of F (v) = ||m||2 (v). Equivalently, Nμ is an Einstein nilradical if and only if the\norbit GLn R * μ is distinguished.\nIn this way, we convert our questions of left-invariant metrics on Lie groups into questions about the\ngeometry of orbits in the space V . By analyzing the geometry of orbits, we obtain our algorithm that\ndetermines when a given nilpotent Lie group is an Einstein nilradical, see Section 9.\nThe above theorem can be found in [Lau08]. The last equivalence is not stated using the label of\ndistinguished orbit but is stated using the idea. In Section 10 of [Lau08] there are several open questions of\ninterest which are presented. We state Question # 5 from this list.\nQuestion 3.4. Consider the function F : V → R defined by F (v) = ||m(v)||2 where m is the moment map,\nas above. Define μt to be the integral curve of −grad F starting at μ0 on the sphere of radius 2. Is μ∞ (the\nlimit point along the integral curve) contained in the orbit GLn R * μ0 if Nμ0 is an Einstein nilradical?\nIn Theorem 4.2 we obtain an affirmative answer to this question. This result first appeared more generally in [Jab08b], where this was shown to be true for distinguished orbits in any real reductive algebraic\nrepresentation.\nRemark 3.5. Geometrically, the moment map can be understood as follows. When μ is a nilpotent Lie\nalgebra, m(μ) = 4Ric(Nμ ). Moregenerally, if μ is any Lie algebra with corresponding Lie group Sμ , then\nm(μ) = 4R where R is the tensor appearing in the formula\n1\nRic = R − B − S(ad H)\n2\nhere Ric is the Ricci tensor of Sμ , B is the Killing form of the Lie algebra μ and S(ad H) = 12 (ad H +ad H t ),\nwhere ad H is a mean curvature vector. See [Bes08, Corollary 7.38] and [Lau10, Section 4] for more details.\n\n4\n\nSoliton metrics and distinguished orbits\n\nSoliton metrics on nilpotent Lie groups\nIn the above section, we stated the relationship between nilsoliton metrics and critical points of the function\nF = ||m||2 : they are precisely the same thing, see Theorem 3.3. As such, we are motivated to study the\nnegative gradient flow of F .\nDefinition 4.1 (The bracket flow). Let μt ⊂ V denote the negative gradient flow of F starting at μ0 ∈ V .\nIn Proposition 5.2, it will be seen that the limit of this flow is unique. We denote this limit point by μ∞ .\nTheorem 4.2. Let Nμ0 be an Einstein nilradical. Let μ∞ denote the limit point of the negative gradient\nflow of the function F starting at μ0 . Then μ∞ is contained in the orbit GLn R * μ0 ; i.e. Nμ0 and Nμ∞ are\nisomorphic Lie groups.\nA more general result of this type is true for distinguished orbits and is useful for studying the geometry\nof solvable Lie groups, see Section 5. In the setting of nilpotent Lie algebras, the proof can be shortened\ndramatically by employing the stratification results of Lauret (see Theorem 7.1). In addition, we obtain\nsome new and interesting geometric results on isometry and automorphism groups of nilpotent Lie groups\nusing the techniques from this proof, see Corollary 5.9 and Proposition 7.6.\n10\n\n\fThe above relationship between Einstein nilradicals and distinguished orbits has been studied extensively\nin the literature, see e.g. [Lau01a, Wil03, Pay10, LW07, Ebe08, Jab08b, Nik08a, Nik08b, Nik08c, Nik08d,\nWil10, Jab09]. Motivated by this, we explore the relationship between distinguished orbits and soliton\nmetrics on solvable groups.\nDefinition 4.3. A Riemannian Lie group Sμ is said to have a distinguished metric if μ is a critical point\nof F = ||m||2 for the action of GL(n, R) on V (defined above).\nFor a geometric interpretation of the moment map, see Remark 3.5.\n\nEinstein and soliton metrics on solvable Lie groups\nProposition 4.4. If Sμ is a solvable group admitting an Einstein or solsoliton metric, then GL(n, R) * μ is\na distinguished orbit.\nProof. To prove this, one consults the work [Lau03] where complex Lie algebras are studied. All the results of\nthat paper remain true for real Lie algebras with the Hermitian transpose replaced with the usual transpose.\nFor a detailed proof of this fact, see [Jab08b]. We warn the reader that the moment map defined there is a\nmultiple of the moment map defined here. If n denotes the moment map from [Lau03] and m denotes the\nmoment map used in this work, then n = 2m. Our choice of moment map m is consistent with [Lau08, Lau10]\nCase 1: Sμ admits a flat metric. If μ corresponds to the flat metric, then μ is also a critical point of\nF = ||m||2 , see [Lau03, Theorem 4.7].\nCase 2: Sμ admits a non-flat solsoliton. We only prove this in the case that the nilradical of sμ is\nnon-abelian. The abelian case is similar and we leave it to the diligent reader.\nThe proof of this case is just a careful comparison of [Lau10, Theorem 4.8] with [Lau03, Theorem 4.7].\nThe soliton metric and the distinguished metric differ only in their values on a × a, where a = n⊥ . If the\nnilradical (which is a nilsoliton in either case) satisfies Ricn = cId + D, for some D ∈ Der(n), and has\nsc = −1/4, then the solsoliton metric on a is\nhA, Ai =\n\n−1\ntr S(ad A)2\nc\n\nwhere S(ad A) is the symmetric part of ad A, while the distinguished metric on a is\nhhA, Aii =\n\n1 −1\n*\ntr( ad A (ad A)t )\n2 c\n\nIn [Lau03], a is viewed as a subset of Der(n) with A ≃ ad A.\nRemark 4.5. Observe that when Sμ is completely solvable, a stronger statement is true. In this case,\nhh , ii =\n\n1\nh, i\n2\n\non a × a\n\nand the algebraic isometry groups (cf. Definition 2.12) are equal: Aut(μ) ∩ O(hh , ii) = Aut(μ) ∩ O(h , i).\nTheorem 4.6. Let Sμ be a completely solvable group. Then Sμ admits a solsoliton if and only if GL(n, R)*μ\nis a distinguished orbit. Moreover, there is a curve of metrics between the distinguished metric and the\nsolsoliton metric which preserves their algebraic isometry groups.\nIn particular, when Sμ is unimodular, we see that these two Riemannian Lie groups have the same\nisometry groups.\nThe claims in the first paragraph follow from the above observations. The last claim will be proved in\nTheorem 5.8.\n11\n\n\fRemark 4.7. There are solvable groups which admit a distinguished metric, but cannot admit a solsoliton.\nFor example, if n is a non-abelian Einstein nilradical and a ⊂ Der(n) is an abelian subalgebra of skewsymmetric endomorphisms, then Sμ with sμ = a ⋉ n cannot admit a solsoliton but does admit a distinguished\nmetric. See Theorem 5.11 and [Lau03, Theorem 4.7].\nThe following has been shown for nilpotent groups in [Nik08a] and [Jab08a], but has not appeared in the\nliterature for solvable groups in general. The corollary which follows is of particular interest and it would be\ninteresting to know if there is an analogous statement for compact homogeneous spaces admitting Einstein\nmetrics.\nTheorem 4.8. Let Sμ be a solvable Lie group whose Lie algebra sμ = sμ1 + sμ2 is a direct sum of ideals.\nThen Sμ admits a non-flat solsoliton, resp. flat, metric if and only if both Sμ1 and Sμ2 admit non-flat\nsolsoliton, resp. flat, metrics.\nCorollary 4.9. Let Sμ be a solvable Lie group whose Lie algebra sμ = sμ1 + sμ2 is a direct sum of ideals.\nThen Sμ admits an Einstein metric if and only if both Sμ1 and Sμ2 admit Einstein metrics of the same sign.\nProof of theorem. We prove the case that the solsoliton is not flat. The flat case is similar and we leave it\nto the reader.\nOne direction is trivial. Recall, a non-flat solsoliton with Ric = cId + D satisfies c < 0 by Theorem 2.8. If\nSμi admit solsolitons satisfying Ricμi = ci Id + Di , then one just needs to rescale so that c1 = c2 . Endow sμ\nwith the product metric, i.e. the sμi are orthogonal and the restriction to sμi is the aforementioned metric.\nThen sμ , with μ = μ1 + μ2 , is a solsoliton satisfying Ricμ = Ricμ1 ⊕ Ricμ2 = c1 Id + (D1 ⊕ D2 ).\nWe now show the converse. Recall that Sμ admitting a solsoliton implies the orbit GLn R*μ is distinguished\nby Proposition 4.4. However, this implies the orbits GLni R * μi ⊂ ∧2 (Rni ) ⊗ Rni are distinguished, where\nni = dim sμi . (This has been proven in [Jab08a, Theorem 4.5] for nilpotent groups. However, the proof\nthere only uses the fact that the orbits are distinguished and works in this setting with no modifications.)\nAssume now that μi are the distinguished points and write sμi = ai ⊕ ni where ni is the nilradical and\nai is a reductive subalgebra (cf. [Lau03, Theorem 4.7]). As sμi are distinguished, the nilradicals ni admit\nnilsolitons by [Lau03, Theorem 4.7].\nWrite sμ = sμ1 + sμ2 = (a1 + a2 ) + (n1 + n2 ). As sμ is solvable, we see that the reductive subalgebra\na = a1 + a2 is abelian and hence each ai is abelian. Furthermore, for any A ∈ a, we see that ad A : n → n\nhas no purely imaginary eigenvalues by the observations in the proof of Proposition 4.4. Thus, the solvable\ngroups Sμi admit solsoliton metrics by either the observations in the proof of Proposition 4.4 or Theorem\n5.11.\nRemark. We point out for the concerned reader that the proof of Theorem 5.11 does not depend on the\nprevious theorem.\nProof of corollary. The proof of the corollary follows immediately from the proof of the theorem and the\nfact that isomorphic distinguished points must be isometric. More precisely, isomorphic distinguished points\nlie in the same O(n)-orbit, see Theorem 5.3.\n\n5\n\nThe bracket flow\n\nIn this section we analyze the negative gradient flow of F = ||m||2 as the critical points of this function have\ngeometric significance, see Theorems 3.3 and 4.6.\nLet G be an θ-stable subgroup of GL(n, R), i.e. G is stable under the transpose operation. Let KG\ndenote the set of fixed points of θ(g) = (g t )−1 (cf. Section 3). Denote the moment map of this group action\nby mG and consider the function F = ||mG ||2 with critical set CG . Denote the negative gradient flow of F\nby φt ; in the notation of Definition 4.1 φt (μ0 ) = μt . In the following way we consider limits of this flow.\n\n12\n\n\fDefinition 5.1. The ω-limit set of φt (p) ⊆ V is the set {q ∈ V | φtn (p) → q for some sequence tn →\n∞ in R}. We denote this set by ω(p).\nProposition 5.2. [Sja98] The omega limit set ω(p) is a single point.\nThe uniqueness of limits is a strong result and is due to the fact that F = ||m||2 is real analytic, Kinvariant, and that CG ∩ {sphere of radius ||p||} ∩ G * p ⊂ K * p (see theorem below). As the limit is\nwell-defined, we will denote it by ω(p) = φ∞ (p). We point out that many of the following results can be\nproven without knowing that there is a unique point in the limit set.\nTheorem 5.3. [Jab08a] Consider p ∈ CG . Then\ni. F (p) is a minimum of F restricted to G * p,\nii. CG ∩ {sphere of radius ||p||} ∩ G * p ⊂ K * p, and\niii. ω(G * p) ⊂ KG * p, i.e. φ∞ (gp) ∈ KG * p for all g ∈ G.\nThe first two statements originally appeared in [KN78] for complex representations and in [Mar01] for\nreal representations. In this way, we see that orbits containing critical points of F = ||mG ||2 are stable in\nthe sense that the critical set is a global attractor of the negative gradient flow along the entire orbit.\nIn the setting of GLn R acting on V = ∧2 (Rn )∗ ⊗ Rn , if μ ∈ V is the Lie bracket of a solvable Lie group\nadmitting a solsoliton, then the orbit GLn R * μ contains a critical point of the function F = ||m||2 (see\nProposition 4.4). We use this below to recover Einstein and solsoliton metrics.\n\nFinding Einstein Metrics\nUsing the above observations, we now have a procedure for recovering an Einstein, or solsoliton, metric on\na solvable Lie group when it exists.\nProposition 5.4. Let G be a solvable Lie group which admits a non-flat Einstein or solsoliton metric. The\nsolsoliton metric may be obtained by following two consecutive curves of metrics.\nLet h*, *i0 be any initial metric. The first curve h*, *it , t ∈ [0, 1], goes from the initial metric to a so-called\n'distinguished metric' via a negative gradient flow. The second curve h*, *it , t ∈ [1, 2], joins the distinguished\nmetric to the solsoliton metric by simply modifying the metric on the orthogonal complement a of the nilradical\nn.\nRemark. A similar result holds for solvable Lie groups admitting flat metrics. Here one just uses the first\ncurve described above, cf. Proposition 4.4.\nProof. We realize this theorem by evolving the bracket instead of the metric. Identify the metric Lie algebra\n{g, h * i} with sμ for some μ ∈ V . The first curve comes from flowing μ along the negative gradient flow\nof F = ||m||2 . This converges within the isomorphism class GLn R * μ as the orbit is distinguished (see\nProposition 4.4). This limit is a distinguished point.\nThe second curve is realized by changing the metric on a × a as in the proof of Proposition 4.4:\n\u0012\n\u0013\u0014\n\u0015\n−1\n2−t\nt\n2\ntr ad A ◦ ad A + (t − 1) tr S(ad A)\nc\n2\nfor t ∈ [1, 2].\nRemark 5.5. In the event that the solsoliton is a flat Einstein metric, the second curve simply rescales the\ninitial metric, however, when the solsoliton is not a flat Einstein metric, then the second curve consists of\ngenuinely distinct metrics (i.e., non-homothetic metrics).\n\n13\n\n\fSolitons and isometry groups\nThe following is an immediate consequence of Theorem 5.3.\nCorollary 5.6. Consider G a real algebraic reductive θ-stable subgroup of GL(n, R) acting on V . Let G * p\nbe a distinguished orbit and φ∞ (p) as above. Then Kp ⊂ Kφ∞ (p) , where K = Gθ and Kq is the stabilizer\nsubgroup at q.\nProof. This follows from the K-equivariance of mG and the uniqueness of integral curves of the negative\ngradient flow of ||mG ||2 . In fact, one has Kp ⊂ Kφt (p) and the result follows by taking the limit.\nTheorem 5.7. [Jab09] Consider a θ-stable subgroup G of GL(n, R) acting on V (as in Section 3). Suppose\nH is a θ-stable group of automorphisms of μ ∈ V . Consider the centralizer of H in G\nZG (H) = {g ∈ G | gh = hg\n\nfor all h ∈ H, g ∈ G}\n\nThen ZG (H) is reductive, θ-stable and G * μ is a distinguished orbit if and only if ZG (H) * μ is a distinguished\norbit. Moreover, along the orbit ZG (H) * μ, mG = mZG (H) .\nRemark. In the above, there is no ambiguity as to the meaning of distinguished since mG = mZG (H) along\nthe subset ZG (H) * μ.\nThe group H being a group of automorphisms means precisely that H is a subgroup of the stabilizer of\nGL(n, R) at μ, and H being θ-stable automatically makes H reductive.\nThis theorem has been used to construct continuous families of Einstein nilradicals and non-Einstein\nnilradicals (cf. [Jab09]). We use this theorem to narrow our search for soliton metrics and to help prove the\nfollowing.\nTheorem 5.8. Let S be a completely solvable unimodular group admitting a solsoliton metric. Let g be any\nleft-invariant metric. Then there exists a left-invariant soliton metric g ′ such that Isom(S, g) ⊂ Isom(S, g ′ ),\nas groups.\nCorollary 5.9. Let N be an Einstein nilradical. Let g be any left-invariant metric. Then there exists a\nleft-invariant soliton metric g ′ such that Isom(N, g) ⊂ Isom(N, g ′ ), as groups.\nRemark 5.10. In this way, we see that these soliton metrics are the most symmetric (left-invariant) metric\nthat such nilpotent and solvable groups can admit.\nProof. Recall that a completely solvable unimodular Lie group Sμ admits a solsoliton metric if and only\nif GL(n, R) * μ is a distinguished orbit (Theorem 4.6). To show that such metrics have maximal isometry\ngroups, we use an intermediate metric, a distinguished metric (i.e. critical point of F = ||m||2 ), in which the\nisometry group embeds and then show that this metric has the same isometry group as a particular choice\nof soliton metric (cf. Section 4).\nRecall that the isometry group of a completely solvable unimodular group is its algebraic isometry group,\ni.e. Isom(Sμ ) = Sμ ⋊ (Aut(μ) ∩ O(h , i). Given g ∈ GL(n, R), Aut(g ∗ μ) = gAut(μ)g −1 and the orthogonal\ngroup O( (g −1 )∗ h , i) = g −1 O(h , i)g, as (g −1 )∗ h*, *i = hg*, g*i.\nThe following metric Lie algebras are isometric\n{Rn , g ∗ μ, h*, *i} ≃ {Rn , μ, (g −1 )∗ h*, *i}\nsee Section 2, and the corresponding Riemmanian solvable Lie groups are isometric\n{Sg∗ μ , h*, *i} ≃ {Sμ , (g −1 )∗ h*, *i}\nAt e ∈ Sμ , the isometry group of {Sμ , (g −1 )∗ h*, *i} has isotropy subgroup\nAut(μ) ∩ O( (g −1 )∗ h , i) = g −1 (Aut(g ∗ μ) ∩ O(h , i) ) g\n14\n\n\fStep 1. Let Sμ be a Riemannian solvable group which admits a solsoliton metric. Let H = Aut(μ) ∩\nO(h , i); this subgroup is θ-stable. By Theorem 4.6 the orbit GL(n, R) * μ is distinguished and by Theorem\n5.7 the orbit ZG (H) * μ actually contains the limit μ∞ of the negative gradient flow of F = ||m||2 . Let\ng ∈ Zg (H) be such that g * μ = μ∞ .\nBy Corollary 5.6, we see that\nAut(μ) ∩ O(h , i) = Kμ ⊂ Kg*μ = Aut(g ∗ μ) ∩ O(h , i)\nwhere K = O(n, R). Using the fact that g ∈ ZG (H), we obtain\nAut(μ) ∩ O(h , i) = g −1 ( Aut(μ) ∩ O(h , i) ) g ⊂ g −1 (Aut(g ∗ μ) ∩ O(h , i) ) g = Aut(μ) ∩ O( (g −1 )∗ h , i)\nAs the underlying Lie group structure of {Sμ , h , i} and {Sμ , (g −1 )∗ h , i} is the same, have have\nIsom(Sμ , h , i) ⊂ Isom(Sμ , (g −1 )∗ h , i)\nas Lie groups.\nStep 2. So far we have imbedded the isometry group of Sμ into the isometry group of a distinguished\nmetric Sμ′ (these are isomorphic as Lie groups). Write sμ′ = a ⋉ n. We have already observed that the\nmetric on sμ′ can be transformed into a solsoliton metric by simply rescaling the metric on a and this does\nnot change the isometry groups, see Remark 4.5. This completes the proof.\n\nCharacterization of solvable algebras admitting Einstein and solsoliton metrics\nTheorem 5.11. Let n be an Einstein nilradical and denote the algebra of derivations by Der(n). Let\na ⊂ Der(n) be an abelian reductive subgroup. If no element of a has only purely imaginary eigenvalues, then\ns = a ⋉ n admits a solsoliton metric. Moreover, every solvable algebra admitting a non-flat solsoliton metric\narises this way.\nCorollary 5.12. If in addition to the above hypotheses, a contains some pre-Einstein derivation D, then\ns = a ⋉ n admits a negative Einstein metric. Moreover, every solvable algebra admitting a negative Einstein\nmetric arises this way.\nThe above characterization of solvable Lie groups admitting negative Einstein metrics is essentially a\ncombination of the above characterization of solsolitons together with Lauret's structural results, cf. Theorem\n2.8. As such, we leave the proof of the corollary to the reader. The definition of pre-Einstein derivation may\nbe found in Definition 8.1.\nBelow we will prove that the algebras described above admit solsoliton metrics. The fact that all solsolitons have such a rigid algebraic structure is the work of Lauret, see Theorem 2.8.\nProof of Theorem 5.11. Take a as above and consider it as a subalgebra of gl(nμ ). Let A be the connected\nsubgroup of GL(nμ ) with Lie algebra a. Denote by A the Zariski closure of A in GL(nμ ) (i.e., the smallest\nalgebraic group containing A) and its Lie algebra by a. As Aut(nμ ) is an algebraic group, A ⊂ Aut(nμ ).\nMoreover, A is abelian and reductive. The fact that A is abelian follows immediately from being the closure\nof an abelian group. To see that this group is reductive, one can 'diagonalize' a to see that A is a subgroup\nof a torus (abelian, reductive) of GL(nμ ) and hence has no non-trivial nilpotent elements.\nIt is a classical fact that there exists g ∈ GL(n, R) such that gag −1 is θ-stable since A is both algebraic\nand reductive, see [Mos55]. Now a0 = gag −1 is a reductive, abelian subalgebra of Der(g ∗ μ) and\na ⋉ nμ ≃ a 0 ⋉ ng ∗ μ\nvia the isomorphism which is the identity on a and g on nμ . The nilpotent Lie group Ng∗ μ is an Einstein\nnilradical if and only if Nμ is so, as they are isomorphic.\n15\n\n\fWe will apply Theorem 5.7 to the subgroup A0 = gAg −1 ⊂ GL(n, R) with Lie algebra a0 = gag −1 . This\ngroup is θ-stable as its Lie algebra is so. Let μ0 = g ∗ μ and consider the limit μ∞ of the flow μt . The\nRiemannian nilpotent Lie group Nμ∞ is a nilsoliton and μ∞ = g ′∗ μ0 for some g ′ ∈ ZGL(n,R) (A0 ). As g ′\ncommutes with a0 we see that the following solvable algebras are isomorphic\na ⋉ Nμ ≃ a0 ⋉ Nμ0 ≃ g ′ a0 g ′−1 ⋉ Ng′∗ μ0 = a0 ⋉ Ng′∗ μ0 = a0 ⋉ Nμ∞\nbut the last metric algebra satisfies all the criteria of Theorem 2.8 to be a solsoliton metric Lie algebra.\n\nConstruction of the finer subgroup IG (H) ⊂ ZG (H) ⊂ G\nIn the above proofs, one can use a smaller subgroup of ZG (H) whose orbit will contain critical points of\nF = ||mG ||2 . This group will be used in Section 9 to construct the algorithm that determines when a\nnilpotent Lie group is an Einstein nilradical.\nProposition 5.13. Let H be a θ-stable subgroup of Aut(μ), as in Theorem 5.7. Assume G ∩ Aut(μ) = H,\ni.e. the stabilizer at μ of the group G acting on V = ∧2 (Rn )∗ ⊗ Rn is H.\nThere exists a real algebraic reductive subgroup IG (H) of G such that ZG (H) = IG (H)(ZG (H)∩H) where\nZG (H) ∩ H is the stabilizer subgroup of ZG (H) at μ and the Lie algebra of IG (H) satisfies\niG (H) = {X ∈ zG (H) | tr(XY ) = 0 for all Y ∈ zG (H) ∩ h}\nMoreover, the orbits coincide, i.e. IG (H) * μ = ZG (H) * μ.\nHere the Lie algebra zG (H) = zg (h) of ZG (H) is the commutator of h in g. One can see by direct\ncalculation that iG (H) is a Lie subalgebra. We show that its corresponding Lie subgroup of GL(n, R) is an\nalgebraic group so that we can exploit the methods of Section 3.\nDefinition 5.14. An element X ∈ gl(n, R) will be called algebraic if it is tangent to a real algebraic 1parameter subgroup of GL(n, R). More generally, a Lie subalgebra will be called algebraic if it is tangent to\nan algebraic subgroup of GL(n, R).\nAn element X ∈ g is called reductive if it is semisimple (over C). We observe that if G ⊂ GL(n, R) is any\nreal reductive algebraic subgroup, the set of reductive algebraic elements of g is dense. As we are considering\nG which are θ-stable, the following bilinear form is an inner product on g\nhX, Y i = tr(XY t )\nGiven a θ-stable element α ∈ g (i.e. α is symmetric or skew-symmetric), we define the subalgebra\ngα ⊖ α = {X ∈ gα | tr(Xαt ) = 0}\nwhere gα = {X ∈ g | [X, α] = 0}. Since αt = ±α, it follows that gα ⊖ α is θ-stable and an ideal of gα .\nLemma 5.15. The subalgebra gα ⊖ α is an algebraic Lie subalgebra.\nFrom this lemma, the proposition above quickly follows. To see this, observe that zg (h) ∩ h is θ-stable\nand decompose zg (h) ∩ h = (z ∩ h)k ⊕ (z ∩ h)p into its Cartan decomposition. All the elements contained in\n(z ∩ h)k and (z ∩ h)p are algebraic reductive elements. Now apply the above lemma to all these algebraic\nreductive elements and use the fact that the intersection of algebraic groups is algebraic.\nProof of lemma. The cases of α symmetric and skew-symmetric must be handled separately.\nCase: α symmetric. Every such α is conjugate via O(n, R) to a diagonal matrix. As the above inner\nproduct is Ad O(n, R) invariant and the conjugate of an algebraic group is algebraic, we may reduce to the\n\n16\n\n\fcase that α is diagonal. Also, we may reduce to the case G = GL(n, R) as the intersection of algebraic\ngroups is algebraic.\nFurther more, we may assume (via conjugation by O(n, R)) that the eigenvalues are weakly increasing:\nα = diag{a1 , . . . , a1 , . . . , ak , . . . , ak }. The eigenvalues ai are rational as α is algebraic. Now the subalgebra\ngα consists of block diagonal matrices gl(n1 , R) × * * * × gl(nk , R). This is clearly an algebraic Lie algebra\nwhose Lie group Gα consists of the block matrices which are invertible.\nThe condition X ∈ gα is now Σai Xi = 0 where X = blockdiag{X1, . . . , Xk }. Write g ∈ Gα as a block\ndiagonal matrix g = blockdiag{g1, . . . , gk }. Then the algebraic group with Lie algebra gα ⊖ α is\n{g ∈ Gα | Π det(gi )qai = 1}\nwhere q is the common integer such that qai ∈ Z for all i = 1, . . . , k.\nCase: α skew-symmetric. To prove the result in this case, we reduce to the above case and use complex\nalgebraic groups. We will construct a complex algebraic group whose intersection with GL(n, R) is the\ndesired Lie group. This Lie group will be algebraic as it is the intersection of algebraic groups. We refer the\nreader to [Whi57] for an introduction to the relationship between real and complex varieties.\nObserve that the above work for α symmetric could have been carried out over C. Consider gC\nα = {X ∈\ngl(n, C) | [X, α] = 0}. Observe that iα has real eigenvalues (which may be assumed to be rational as above)\nC\nC\nC\nand that gC\nα = giα and gα ⊖ α = giα ⊖ iα. By conjugating with U (n) ⊂ GL(n, C), we may assume iα is\ndiagonal. Following the above work, but with complex groups instead of real, we have a complex algebraic\nC\ngroup over gC\nα ⊖ α = giα ⊖ iα. Moreover, this group intersected with GL(n, R) is a real Lie group with the\ndesired Lie algebra. Counting dimensions, we see that the real points of this complex algebraic group are\nZariksi dense and hence this Lie group is real algebraic.\n\n6\n\nCompact nilmanifolds\n\nIn this section we apply the above results to compact quotients of nilpotent Lie groups that admit soliton\nmetrics.\nDefinition 6.1. Let (M, g) = (Γ\\N, g) be a compact nilmanifold where Γ ⊂ N ⊂ Isom(N, g), g is a leftinvariant metric, and the metric on M is the induced metric coming from N . The metric g on Γ\\N is called\na local nilsoliton if (N, g) is a nilsoliton.\nAs in the case of Ricci solitons on nilpotent Lie groups, local nilsolitons may be characterized as critical\npoints of a functional restricted\nto the set of locally N -invariant metrics. In fact, these metrics are minima\nR\ntr Ric2 dV olg\n\nof the function F (g) = RM sc2 (g)g dV olg , restricted to the set of locally N -invariant metrics, see [Jab10] for\nM\nthis point and more analysis on this functional.\nRemark 6.2. While nilsolitons are unique on a simply connected nilpotent Lie group (up to rescaling and\nisometry), this does not remain true for local nilsolitons on compact quotients.\n\nOn compact nilmanifolds, local nilsoliton metrics are the most symmetric among all locally-left-invariant\nmetrics (cf. Corollary 5.9).\nTheorem 6.3. Consider M = Γ\\N endowed with a locally left-invariant metric g where N admits a nilsoliton. Then there exists a local soliton g ′ on M such that Isom(M, g) ⊂ Isom(M, g ′ ).\nProof. The proof reduces to the corresponding statement on simply-connected covers: Corollary 5.9.\nLet φ ∈ Isom(M, g) and consider the Riemannian quotient π : N → Γ\\N . The map φ lifts to a\ndiffeomorphism φ : N → N such that π ◦ φ = φ ◦ π. As (Γ\\N, g) and (N, g) are locally isometric via π and\nφ is an isometry, we have φ ∈ Isom(N, g). Conversely, every isometry of M arises from φ ∈ Isom(N, g)\nsatisfying the condition\nφ(Γn) = Γφ(n) for all n ∈ N\n(6.1)\n17\n\n\fObserve that this condition is independent of any metric data.\nBy Corollary 5.9, there exists a nilsoliton g ′ on N such that φ is an isometry of (N, g ′ ) and this choice\nof g ′ holds for all φ. As the above relation (6.1) still holds, the diffeomorphism φ : M → M is an isometry\nrelative to g ′ .\nTheorem 6.4. The existence of a local soliton depends only on the fundamental group.\nProof. This is a consequence of the classical fact that the fundamental group Γ completely determines the\nnilpotent group N . More precisely, let Γ1 , Γ2 be the fundamental groups of compact nilmanifolds Γ1 \\N1 and\nΓ2 \\N2 . If φ : Γ1 → Γ2 is an isomorphism of abstract groups, there exists an isomorphism Φ : N1 → N2 of\nLie groups such that φ = Φ|Γ1 , see [Rag72, Theorem 2.11 and Corollary 2].\nThe claim now follows from the algorithm of Section 9 which shows that the existence of nilsolitons on\nNi is a property of the underlying Lie algebra.\nRemark. The above theorems on compact nilmanifolds hold for infranilmanifolds as every infranilmanifold\nis finitely covered by a compact nilmanifold.\n\n7\n\nStratifying the space V\n\nTo refine our analysis of the Riemannian Lie groups Sμ , and the function F = ||m||2 , we stratify the space\nV . Using this stratification, we obtain a decomposition of the automorphism group Aut(μ) which aids in\nthe construction of algorithms to determine the existence of soliton metrics, see Lemma 7.7.\nDenote the critical set of F = ||m||2 by C.\nTheorem 7.1 ([Lau07, LW07]). There exists a finite subset B ⊂ g, and for each β ∈ B a GLn R-invariant\nsmooth submanifold Sβ ⊂ V (a stratum), such that\nG\nV \\{0} =\nSβ\nβ∈B\n\nF\n\nThis stratification satisfies S β − Sβ = ||β ′ ||>||β|| Sβ ′ . Additionally, C =\ncritical points with critical value Mβ = ||β||2 .\nFor μ ∈ Sβ , following conditions are satisfied:\n\nF\n\nβ∈B\n\nCβ where Cβ ⊂ Sβ are the\n\ni. h[β, D], Di ≥ 0 for all D ∈ Der(μ) with equality if and only if [β, D] = 0.\nii. β + ||β||2 I is positive definite for all β ∈ B such that Sβ ∩ N =\n6 ∅.\niii. ||β||2 ≤ ||m(μ)||2 with equality if and only if m(μ) is conjugate to β under O(n).\niv. tr βD = 0 for all D ∈ Der(μ).\nv. hπ(β + ||β||2 I)μ, μi ≥ 0 with equality if and only if β + ||β||2 I ∈ Der(μ).\nRemark. The finite subset B ⊂ g consists of diagonal elements, with positive entries on the diagonal which\nare (weakly) increasing.\nWe will not reconstruct this stratification and direct the interested reader to those works above. Instead,\nwe describe the necessary properties below that suit our needs. This stratification is the real analog of\nwell-known stratifications in Geometric Invariant Theory over algebraically closed fields. For representations\nof complex reductive groups, such stratifications coincide with a Morse theoretic stratification coming from\nF = ||m||2 . This result remains true in the setting of real representations and is an immediately consequence\nof Theorem 7.4.\n\n18\n\n\fGiven α ∈ diag ⊂ gl(n, R), the diagonal matrices, we define the following groups\nGα\nUα\n\n= {g ∈ GL(n, R) | gαg −1 = α}\n= {g ∈ GL(n, R) | exp(tα) g exp(−tα) → e as t → −∞}\n\nPα\n\n= Gα Uα\n\nPα is the parabolic associated to α with unipotent radical Uα and reductive complement Gα . As αt = α, Gα\nis θ-stable and has a Cartan decomposition Gα = Kα exp(pα ) (cf. definition of Cartan involution in Section\n3). When α ∈ B, the eigenvales of α are weakly increasing and the group Gα consists of block diagonal\nmatrices (which commute with α) while Uα is the group of lower triangular elements beneath the blocks of\nGα .\nDefine the subgroup Hα as the group with Lie algebra hα = {X ∈ gα | tr(Xα) = 0}; this is actually an\nalgebraic group. In the following proposition, we maintain the notation from [Lau07].\nDefinition 7.2. A point v ∈ V is called Hα -stable if 0 6∈ Hα * v.\nProposition 7.3 (Lauret). Given β ∈ B, there exist subsets Zβ and Yβ with the following properties:\ni. Yβ is Pβ -invariant, Yβss = Yβ ∩ Sβ consists of Hβ -semi-stable points and Sβ = O(n)Yβss\nii. For y ∈ Yβ , {g ∈ GL(n, R) | g * y ∈ Yβ } = Pβ\niii. Zβ = {v ∈ Yβ | π(β)v = ||β||2 v}, Zβ is Gβ -invariant, Sβ ∩ Zβ = Zβss (the Hβ -semi-stable points of\nZβ ) and Sβ = GL(n, R)Zβss = O(n)Pβ Zβss\niv. The Hβ orbits intersecting Zβ ∩ Cβ are all closed.\nRemark. Part ii above does not appear in [Lau07]. However, one can show this immediately just as in the\ncomplex case (cf. Lemma 13.4 of [Kir84]).\nThe following theorem and its proof have appeared in a more general form in [HSS08]. In our setting, a\nshort proof is readily obtained, and so we include one for completeness.\nTheorem 7.4 (Heinzner-Schwarz-Stötzel). Consider μ ∈ Sβ . There exists a unique GL(n, R)-orbit in\nGL(n, R) * μ ∩ Sβ intersecting Cβ . The closed orbits in Sβ are precisely those intersecting Cβ .\nProof. Take μ ∈ Sβ . As Sβ = O(n)Yβss , we may assume μ ∈ Yβ and thus GL(n, R) * μ = O(n)Pβ μ. Since\nO(n) is compact, we see that GL(n, R) * μ = O(n)Pβ * μ.\nConsider any point y ∈ Yβ and the curve exp(tβ) * y with limit y−∞ as t → −∞ (this limit exists by the\ndefinition of Yβ ). Observe that exp(tβ)(Pβ * y) → Gβ * y−∞ as t → −∞. To see this, write g ∈ Pβ as g = g1 g2\nwith g1 ∈ Gβ and g2 ∈ Uβ , then exp(tβ) * gy = g1 exp(tβ)g2 exp(−tβ) exp(tβ) * y → g1 e y−∞ .\nNow take y ∈ GL(n, R) * μ ∩ Cβ . By the above theorem, there exists k ∈ O(n) such that k * y ∈ Zβ . So\nwe may assume k = e and y ∈ GL(n, R) * μ ∩ Cβ ∩ Zβ . This point is fixed by exp(tβ) and we see that\nGβ * y ⊂ Gβ * μ−∞\nby applying exp(tβ) and letting t → −∞.\nAs y and μ−∞ are both eigenvectors for β, we see that under the map V → PV , v 7→ [v], Hβ * [y] ⊂\nHβ [μ−∞ ]. Now, as Hβ * y is closed, the uniqueness result follows from [RS90].\nThe above theorem answers Question 3.4.\nCorollary 7.5. Let Nμ0 be an Einstein nilradical. Let μ∞ denote the limit point of the negative gradient\nflow of the function F = ||m||2 starting at μ0 . Then μ∞ is contained in the orbit GLn R * μ0 ; that is, Nμ0\nand Nμ∞ are isomorphic Lie groups.\nProof. This follows immediately from the fact that the limit μ∞ ∈ Sβ ∩GL(n, R) * μ0 and the orbit GL(n, R)*\nμ0 is closed in Sβ .\n19\n\n\fAutomorphisms of Einstein Nilradicals\nGiven that nilsolitons are precisely the critical points of F = ||m||2 (Theorem 3.3) we have the following\ndecomposition of Aut(μ). The following decomposition holds more generally with μ being the critical point\nof ||m||2 and Aut(μ) being replaced by the stabilizer subgroup of an action. In particular, there is a similar\ndecomposition of the automorphism group of a solvable Lie group admitting a solsoliton.\nProposition 7.6. Let μ ∈ N be a soliton in the stratum Sβ . Let Gβ be the centralizer of β in GLn R and\nUβ = {g ∈ GLn R | exp(tβ)gexp(−tβ) → e as t → −∞}. Then the automorphism group of Nμ decomposes\nas\nAut(μ) = Gβ U β = K β exp(pβ )U β\nwhere Gβ = Gβ ∩ Aut, K β = O(n) ∩ Gβ ∩ Aut, exp(pβ ) = exp(symm(n)) ∩ Gβ ∩ Aut, U β = Uβ ∩ Aut.\nProof. This result follows quickly from Proposition 7.3. Let μ ∈ Sβ be the nilsoliton of interest, where Sβ is\nthe stratum defined above. By considering O(n) translates of μ, we may assume that μ ∈ Zβ .\nLet g ∈ Aut(μ). Since g * μ = μ ∈ Zβ ⊂ Yβ , g ∈ Pβ by Part ii. of Proposition 7.3, and we may write\ng = g1 g2 where g1 ∈ Gβ and g2 ∈ Uβ . Observe that exp(tβ) g exp(−tβ) also stabilizes μ and letting t → −∞\nwe see that g2 ∈ Aut(μ) and hence g1 ∈ Aut(μ). This shows Aut(μ) = Gβ U β .\nGiven g ∈ Gβ , write g = k exp(X) where k ∈ Kβ and X ∈ pβ ; this is possible as Gβ is stable under\nthe transpose. Observe, ||m(μ)|| = ||m(g * μ)|| = ||m(exp(X) * μ)|| and by [NM84, Lemma 7.2] we see that\nexp(X) * μ = μ. Thus exp(X), k ∈ Aut(μ) and the theorem is proved.\nThere is an analogous decomposition of Der(μ) as above. The following is presented for later use.\nLemma 7.7. Take a nilsoliton Nμ with Einstein derivation β and derivation algebra Der(μ) = kβ ⊕ pβ ⊕ uβ .\nEvery element of the form\nβ + X,\nwith X ∈ uβ\nis semi-simple (i.e. diagonalizable).\nSketch of proof. The proof of this fact is analogous to showing that any upper triangular matrix with nonzero distinct entries on the diagonal can be diagonalized. One carries out similar computations in this case\n(as the entries of β are all positive and uβ has an appropriate block structure) to show that β + X can be\nconjugated to β via Uβ .\n\n8\n\nPre-Einstein derivations\n\nLet nμ be an Einstein nilradical with Ricci tensor Ricμ = cId + D, for some c ∈ R and D ∈ Der(μ). This\nderivation is semisimple with real, positive eigenvalues and satisfies the condition\ntr(Dψ) = −c tr ψ\nfor any ψ ∈ Der(μ). The derivation D satisfying Ric = cId + D is called an Einstein derivation as its\nexistence is necessary for solvable extensions of nμ to admit an Einstein metric. As such, we make the\nfollowing definition.\nDefinition 8.1. A derivation φ of a Lie algebra sμ is called pre-Einstein, if it is semisimple, with all\neigenvalues real, and\ntr(φψ) = tr ψ , for any ψ ∈ Der(μ)\n(8.1)\nD\nThe so-called Einstein derivation D gives the pre-Einstein derivation φ = −c\n, and viceversa. Remarkably,\ndetermining the pre-Einstein derivation almost completely determines when a nilpotent Lie algebra admits\na nilsoliton metric. This derivation first appeared in [Nik08a].\n\nTheorem 8.2. [Nik08a]\n20\n\n\fi. (a) Any Lie algebra sμ admits a pre-Einstein derivation φμ .\n(b) The derivation φμ is determined uniquely up to automorphism of sμ .\n(c) All the eigenvalues of φμ are rational numbers.\nii. Let nμ be a nilpotent Lie algebra, with φ a pre-Einstein derivation. If nμ is an Einstein nilradical, then\nits Einstein derivation is positively proportional to φ.\nRemark. Part ii. above is particularly useful as it can be difficult to determine, a priori, which stratum\nμ belongs to (cf. Section 7). Moreover, we will see that determining the pre-Einstein derivation reduces to\nsolving a system of linear equations (the condition of semi-simplicity can be discarded, cf. Proposition 8.4).\nLet nμ be a nilpotent Lie algebra with a choice of pre-Einstein derivation φμ . Associated to φμ we have\nthe following subalgebra\ngμ = z(φμ ) ∩ ker(T ) ⊂ sl(n, R)\nwhere z(φμ ) is the centralizer of φμ and T (A) = tr(Aφμ ). Let Gφμ ⊂ SL(n, R) be the Lie group with algebra\ngφμ , this is an algebraic group.\nTheorem 8.3. [Nik08a] For a nilpotent Lie algebra nμ with a pre-Einstein derivation φ, the following\nconditions are equivalent:\ni. nμ is an Einstein nilradical\nii. the orbit Gφ * μ ⊂ V is closed\nIn this way, we see that the property of a nilpotent Lie group being an Einstein nilradical is intrinsic to\nits Lie algebra. We will build on this result to obtain an algorithm which determines the condition of being\nan Einstein nilradical using only local data, see Section 9. To simplify our work, we present the following\nreduction.\nProposition 8.4. If nμ is an Einstein nilradical, then any solution to Equation (8.1) will automatically be\na pre-Einstein derivation, i.e. it is automatically semi-simple with real, positive eigenvalues.\nRemark 8.5. In this way, we see that if a solution to Equation (8.1) is not semi-simple, then the nilpotent\ngroup in question is not an Einstein nilradical.\nProof. The proof amounts to analyzing Nikolayevki's proofs and combining those details with Lemma 7.7.\nFor the sake of completeness, we present Nikolayevski's proof of existence and uniqueness (up to conjugation\nin Aut) of the pre-Einstein derivation.\nFirst we find one pre-Einstein derivation. Let sμ be a Lie algebra and denote by Der(μ) its algebra of\nderivations; this is an algebraic Lie algebra (meaning it is the Lie algebra of an algebraic group). Consider\na Levi decomposition Der(μ) = s ⊕ t ⊕ n where t ⊕ n is the radical of Der(μ), s is semisimple, and n is the\nset of nilpotent elements (the nilradical) of t ⊕ n, t is a torus (abelian subalgebra with semisimple elements),\nand [t, s] = 0.\nRecall, for ψ ∈ gl(n, R) a semisimple endomorphism, there exist semisimple endomorphisms ψ R and ψ iR\n(the real and imaginary parts) which have real, resp. purely imaginary, eigenvalues such that ψ = ψ R + ψ iR\nand all three endomorphisms commute. Moreover, the subspaces tc = {ψ iR | ψ ∈ t} and ts = {ψ R | φ ∈ t}\nare the compact and the fully R-reducible tori (the elements of ts are simultaneously diagonalizable) with\nts ⊕ tc = t.\nWe will find a pre-Einstein derivation contained in ts . Consider the quadratic form b on Der(μ) defined\nby b(ψ1 , ψ2 ) = tr(ψ1 ψ2 ). It is a general fact that n is in the kernel of this quadratic form, hence\nb(t, ψ) = 0 = tr(ψ)\nfor any ψ ∈ n. Using the ad-invariance of b (that is, b(ψ1 , [ψ2 , ψ3 ]) = b([ψ3 , ψ1 ], ψ2 )) and that s = [s, s] is\nsemisimple, we see that\nb(t, ψ) = 0 = tr(ψ)\n21\n\n\ffor any ψ ∈ s. Thus it suffices to solve Equation (8.1) with φ, ψ ∈ t. Additionally, observe that\nb(ts , ψ) = 0 = tr(ψ)\nfor any ψ ∈ tc . Lastly, as the quadratic form b restricted to ts is positive definite, the existence (and\nuniqueness in t) follows.\nTo obtain the uniqueness of the pre-Einstein derivation up to conjugation in Aut, Nikolayevski exploits\na theorem of Mostow [Mos56, Theorem 4.1] which says that all fully reducible subalgebras of Der(μ) are\nconjugate via an inner automorphism of Der(μ). Lastly, as the center of a reducible algebra is uniquely\ndefined, we have the desired result.\nNow we analyze this proof to study all solutions to Equation (8.1). Let A ∈ s ⊕ t be a solution to\ntr(Aψ) = 0 for all ψ ∈ Der(μ). We will show that A = 0. To see this, first assume that our Lie algebra\nnμ is endowed with an inner product so that s ⊕ t is stable under the transpose operation. This is always\npossible; when nμ is an Einstein nilradical such a metric is explicitly given in Proposition 7.6. Using this\ninner product, ψ = At ∈ Der(μ) and 0 = tr(Aψ) = tr(AAt ) implies A = 0.\nLet φ ∈ t be a pre-Einstein derivation of nμ , the above work shows that any solution to Equation (8.1)\nis of the form φ + X where X ∈ n (the nilpotent part of the radical of Der(μ)). And applying Lemma 7.7\nwe are finished.\n\n9\n\nAlgorithm to determine Einstein nilradical\n\nIn this section, we demonstrate how the existence of a nilsoliton on a nilpotent Lie group can be read off\nfrom local data. More precisely, let N be a nilpotent Lie group of interest with Lie algebra n. To determine\nif N admits a nilsoliton, one only needs to analyze Der(n) and certain infinitesimal deformations of any\ninitial left-invariant metric on N .\nTheorem 9.1. The existence of a nilsoliton metric on a nilpotent Lie group N is intrinsic to the underlying\nLie algebra n. More precisely, one can determine the existence of such a metric by analyzing the derivation\nalgebra Der(n) and infinitesimal deformations of any initial metric on n.\nRemark 9.2. The existence of a nilsoliton being intrinsic to the Lie algebra was first shown by Nikolayevsky\n[Nik08a]. Here it was shown that the existence of such a metric is equivalent to an orbit of a particular\nreductive group being closed in the space of Lie brackets (see Theorem 8.3). However, it was not shown that\nthis could be determined by measuring local data.\nBefore Nikolayevsky's result, it was shown by Lauret [Lau01a] that the existence of such a metric is\nequivalent to the full GLn R-orbit in the space of Lie brackets being so-called distinguished . However, it was\nnot known before the present work that this condition may be determined locally.\n\nAlgorithm to determine if N is an Einstein nilradical\nStep 1: Find a solution φ to\ntr(φψ) = tr(ψ)\n\nfor all ψ ∈ Der(n)\n\nIf the solution is φ is not semisimple (i.e. diagonalizable) with (positive) real eigenvalues then stop, n is\nnot an Einstein nilradical.\nIf φ is semisimple with (positive) real eigenvalues, then continue; this is a pre-Einstein derivation of n (cf.\nDefinition 8.1 and Proposition 8.4). (Remark: positivity of the eigenvalues will be automatic if the following\nsteps are valid.)\nStep 2: Consider the subalgebra hμ := gφ ∩ Der(n). These are the derivations which are traceless and\ncommute with φ, see paragraph following Theorem 8.2.\nIf hμ is not reductive, then stop, n is not an Einstein nilradical.\n22\n\n\fIf hμ is reductive then continue.\nTo determine if this algebra is reductive: 1) compute its radical, then 2) compute the set of nilpotent\nelements of this radical. The algebra is reductive if and only if the set of such nilpotent elements (in the\nradical) is trivial.\nStep 3: Consider the subalgebra igφ (hμ ) = {X ∈ zgφ (hμ ) | tr(XY ) = 0 for all Y ∈ zgφ (hμ ) ∩ hμ } (cf.\nProposition 5.13), where za (b) denotes\n[ the centralizer of b in a. Let D denote the matrices of gln R which are\ndiagonalizable over R; i.e., D =\ngtg −1 , where t = diagonal matrices of gln R.\ng∈GLn R\n\n2\nn ∗\nn\nLet n =\nPnμ corresponding to some point μ ∈ V = ∧ (R ) ⊗PR (see Section 3). For X ∈ ig (hμ ) ∩ D,\nwrite μ =\nai μi , where μi is an eigen basis for X, i.e., X * μ = λi ai μi .\nIf there is some X ∈ igφ (hμ ) ∩ D such that λi ≥ 0 whenever ai 6= 0, then n is not an Einstein nilradical.\nIf for every X above there exists i with λi < 0 and ai 6= 0, then n is an Einstein nilradical.\n\nRemark 9.3. In Step 3,\n1) The identification of n with μ ∈ V is made by picking a basis of the vector space. This is tantamount\nto prescribing n with an orthonormal basis, and hence, endowing N with a choice of left-invariant metric.\n2) The X * μ, with X ∈ gln R, precisely represent infinitesimal deformations of the above choice of leftinvariant metric.\n3) The algebra hμ is reductive (once getting to Step 3). If the inner product from nμ makes hμ stable\nunder the metric adjoint (and there will always be such a μ with this property), then Step 3 may be replaced\nby the following.\nStep 3': Assuming hμ is stable under the adjoint relative to the inner product on nμ , we may reduce the\ncollection of X considered in Step 3 to those X ∈ igφ (hμ ) ∩ p, where p = {Y ∈ hμ |Y t = Y }.\nRemark 9.4. The verification of Steps 1 and 2 above can done by a computer. It is not immediately clear\nto the author if Step 3 can be adapted to be implemented by a computer.\n\nProof of the algorithm above\nStep 1: This is the content of Proposition 8.4.\nStep 2: To prove this portion of the algorithm, we will go ahead and identify n with nμ , for some μ ∈ V .\nThe algebra h = gφ ∩ Der(n) is precisely the stabilizer subalgebra of gφ at μ. As we have fixed a basis of\nour Lie algebra, we may view h ⊂ gl(n, R).\nIn Theorem 8.3, it was shown that nμ is an Einstein nilradical if and only if Gφ * μ is closed, where Gφ\nis the (alegbraic) Lie group with Lie algebra gφ . It is well-known that an orbit being closed implies the\nstabilizer subgroup is reductive, see [RS90]. Lastly, the stabilizer subgroup is reductive if and only if its Lie\nalgebra h is reductive.\nStep 3: As h and φ are reductive, there exists g ∈ GL(n, R) such that ghg −1 and gφg −1 are simultaneously\nθ-stable, i.e. closed under the transpose operation, see [Mos55]. Observe that\ngDer(μ)g −1 = Der(g * μ),\ngφg −1 is a pre-Einstein derivation of g * μ,\nggφg−1 = ggφ g −1 ,\nhg*μ = ghμ g −1 ,\nzggφg−1 (hg*μ ) = gzgφ (hμ )g −1 , and\niggφg−1 (hg*μ ) = gigφ (hμ )g −1\n\n23\n\n\fMoreover, Ggφg−1 * (g * μ) = gGφ g −1 gμ = g(Gφ * μ) is closed if and only if Gφ * μ is closed. As such, we may\nreduce to the case that hμ and φ are θ-stable.\nSince φ is θ-stable, we immediately have that gφ is θ-stable. Similarly, zgφ (hμ ) is θ-stable. Now igφ (hμ )\nis precisely the Lie algebra of the algebraic reductive group IGφ (Hμ ) from Proposition 5.13, where Hμ is the\nLie group with Lie algebra hμ .\nBy Theorem 5.7, Gφ * μ is closed if and only if ZGφ (Hμ ) is closed. And since IGφ (Hμ ) * μ = ZGφ (Hμ ) * μ,\nwe see that nμ is an Einstein nilradical if and only if IGφ (Hμ ) * μ is closed, see Proposition 5.13 and Theorem\n8.3.\nObserve that the stabilizer subalgebra of igφ (hμ ) at μ is trivial since it is contained in the stabilizer of gφ\nat μ (which equals hμ ) and igφ (hμ ) is orthogonal to hμ under the inner product hA, Bi = tr(AB t ). Hence,\nthe stabilizer of IGφ (Hμ ) is finite (as it is discrete and algebraic).\nAs the stabilizer of IGφ (Hμ ) at μ is finite, we may apply the 'Hilbert-Mumford criterion' to determine\nwhen IGφ (Hμ ) * μ is closed. This criterion was adapted to the real setting in [Bir71] which states (in our\nsetting)\n[\nIGφ (Hμ ) * μ is closed if and only if\nexp(tX) * μ is closed for all X ∈ D ∩ igφ (hμ )\nt∈R\n\nRoughly speaking, this criterion says that closedness of an orbit is equivalent to closedness of the orbits of\nall algebraic reductive 1-parameter subgroups. P\nP tλi\nTo finish, we write exp(tX) * μ = expt(tX) ai μi =\ne ai μi where μi is the eigenvector of X above.\nThis set is not closed if and only if for all i such that ai 6= 0, either all λi ≥ 0 or λi ≤ 0. Observe that\nreplacing X with −X changes the sign of the eigenvalues above and this step is proven.\nStep 3': Reducing the Hilber-Mumford criterion to this smaller set of symmetric elements of hμ is the\ncontent of [RS90].\n\n10\n\nAlgorithm to determine if a solvable Lie group admits a leftinvariant Einstein metric\n\nIn this section, we show that the existence of an Einstein metric on a solvable Lie group can be determined\nby purely local data, as in the case of nilsolitons and nilpotent Lie groups. A similar algorithm can be\nwritten to test for the existence of solsoliton metrics.\nTheorem 10.1. Let S be a solvable Lie group with Lie algebra s. The existence of a left-invariant Einstein\nmetric on S can be determined by analyzing the following: 1) adjoint action of s on itself, 2) the commutator\nsubalgebra n = [s, s], and 3) infinitesimal deformations of any initial metric on n.\n\nFlat Einstein metrics\nHere we prove Theorem 10.1 in the case that scalar curvature is zero (such a Lie algebra is necessarily unimodular). This amounts to showing that the solvable Lie algebra in question has the rigid algebraic structure\ndescribed by Milnor, see Proposition 2.7. Note, this case does not require any infinitesimal deformations of\nmetrics on n.\nConsider the adjoint action ad s ⊂ Der(s) on s. Compute the nilradical n of s, i.e., the set of nilpotent\nelements. Compute a Levi decomposition ad s = T+N, and let t ⊂ s be such that ad t = T and dim t = dim T.\nLemma 10.2. If s admits a flat metric, then t is an abelian subalgebra, ad T has only purely imaginary\neigenvalues for T ∈ t, and dim t + dim n = dim s.\nProving this lemma proves the theorem as verifying the conditions on t in the lemma amount to simply\nanalyzing the adjoint representation of s, and any algebra of this type admits a flat metric by Proposition\n2.7.\n24\n\n\fProof of lemma. Assume s admits a flat Einstein metric. Decompose s = a + n where n is the nilradical and\na is an abelian subalgebra such that ad A has only purely imaginary eigenvalues for A ∈ a, cf. Proposition\n2.7.\nObserve that ad s = ad a + ad n is a Levi-decomposition of ad s. Thus ad a and T = ad t are equal\nup to conjugation by Aut(s) as they are both maximal reductive subalgebras of ad s (conjugacy of such\nsubalgebras is the main result of [Mos56]). As the relevant properties of a do not change after applying an\nautomorphism, we may assume ad a = ad t. Now, the elements of t differ from the elements of a by only\nelements of the center. Hence t has precisely the same properties of a and the lemma is proven.\n\nNegative Einstein metrics\nHere we prove Theorem 10.1 in the case that scalar curvature is negative (such a Lie algebra is necessarily\nnon-unimodular). Let S be the solvable group in question with Lie algebra s. Denote by n the commutator\nsubalgebra [s, s] of s. (Note: when s admits an Einstein metric, this will be the full nilradical.)\nStep 1:\nIf n is not an Einstein nilradical, then stop, S cannot admit a negative Einstein metric.\nIf n is an Einstein nilradical, then continue.\nThis step can be determined using the algorithm of Section 9.\nStep 2: Find a solution φ to\ntr(φψ) = tr(ψ)\nwithin the set ad s = {ad X | X ∈ s} ⊂ Der(n).\n\nfor all ψ ∈ Der(n)\n\nIf there is no non-trivial solution in this subset, or the solution is not semisimple with (positive)\nreal eigenvalues, then stop; S cannot admit a negative Einstein metric.\nIf there is a non-trivial solution φ = ad Xφ , and this solution is semisimple with (positive) real\neigenvalues, then continue. Fix this choice of Xφ .\nThis step can be verified using a computer for a given solvable Lie algebra of interest. As before, positivity\nof the eigenvalues will follow if the remaining steps are valid.\nStep 3: Compute zs (Xφ ) = {Y ∈ s | [Y, Xφ ] = 0}\nIf zs (Xφ ) is not abelian or dim zs (Xφ ) + dim n < dim s, then stop, S does not admit a negative\nEinstein metric.\nIf zs (Xφ ) is abelian, and dim zs (Xφ ) + dim n = dim s, then continue.\nRecall, zs (Xφ ) is automatically reductive as Xφ is reductive, and zs (Xφ ) being reductive abelian implies that\nno element is nilpotent. This step may be verified using a computer.\nStep 4:\nIf some element of zs (Xφ ) has only purely imaginary eigenvalues, then stop; S does not admit a\nnegative Einstein metric.\nIf no element of zs (Xφ ) has only purely imaginary eigenvalues, then S admits a negative Einstein\nmetric.\n\nProof of the algorithm above.\nStep 1: This fact is well-known, see [Lau07].\nStep 2: This is the content of a theorem of Nikolayevsky, see Theorem 8.2, and [Lau10, Proposition 4.3].\nStep 3: This follows immediately from [Lau10, Theorem 4.8].\nStep 4: This is the content of Theorem 5.11.\n25\n\n\fA\n\nAppendix: Closed orbits for general representations.\n\nThe above work concerning the geometry of orbits holds in the more general framework of representations\nof reductive groups. We state this result and provide only a sketch of the proof, as the proof is similar to\nthe above case. We do not know of this statement appearing in the literature before.\n\nClosed Orbits\nTheorem A.1. Let G be a real reductive algebraic group acting linearly and rationally on a vector space\nV . Determining whether an orbit G * v is closed in V can be determined using only data from the induced\nrepresentation of the Lie algebra g at the point v ∈ V .\nIn the following, we will only consider G which is semi-simple and use the Killing form B which is Ad(G)invariant and symmetric. More generally, for a reductive group, one could use any bilinear form B : g×g → g\nwhich is Ad(G)-invariant, symmetric, and has the property that {X ∈ g | [X, α] = 0 and B(X, α) = 0}\nis the Lie algebra of an algebraic group for any α ∈ g which is tangent to a reductive, algebraic 1-parameter\nsubgroup. The Killing form satisfies this condition.\nSketch of proof. We follow the same argument as in Section 9.\nThe first requirement is that h = gv be reductive. Let zg (h) = {X ∈ g | [X, h] = 0} denote the centralizer\nof h in g. As before, consider\nig (h) = {X ∈ zg (h) | B(X, Y ) = 0 for all Y ∈ zg (h) ∩ h}\nThese subalgebras are the Lie algebras of algebraic groups ZG (H) and IG (H), respectively, where H = Gv .\nThe orbit G * v is closed if and only if ZG (H) * v = IG (H) * v is closed. As IG (H) has finite stabilizer and we\nmay apply the Hilbert-Mumford criterion.\n[\nLet D denote the matrices of gln R which are diagonalizable over R; i.e., D =\ngtg −1 , where t =\n\ng∈GLn R\nP\ndiagonal matrices of gln R. Given X ∈ ig (h) ∩ D, write v =\nai vi where {vi } is an eigenvector basis of V\nwith X * vi = λi vi . The Hilbert-Mumford criterion states: IG (H) * v is not closed if and only if there exists\nX ∈ ig (h) satisfying λi ≥ 0 for all i such that ai 6= 0.\nIn this way, we see that determining the closedness of G * v reduces to analyzing the stabilizer subalgebra\ngv and the representation of g at v.\n\nReferences\n[AK75]\n\nD. V. Alekseevskiı̆ and B. N. Kimel'fel'd, Structure of homogeneous Riemannian spaces with zero Ricci\ncurvature, Functional Anal. Appl. 9 (1975), no. 2, 97–102. MR MR0402650 (53 #6466)\n\n[Bes08]\n\nArthur L. Besse, Einstein manifolds, Classics in Mathematics, Springer-Verlag, Berlin, 2008, Reprint of the\n1987 edition. MR MR2371700 (2008k:53084)\n\n[Bir71]\n\nDavid Birkes, Orbits of linear algebraic groups, Ann. of Math. (2) 93 (1971), 459–475. MR MR0296077 (45\n#5138)\n\n[Böh04]\n\nChristoph Böhm, Homogeneous Einstein metrics and simplicial complexes, J. Differential Geom. 67 (2004),\nno. 1, 79–165. MR 2153482 (2006m:53065)\n\n[BWZ04] C. Böhm, M. Wang, and W. Ziller, A variational approach for compact homogeneous Einstein manifolds,\nGeom. Funct. Anal. 14 (2004), no. 4, 681–733.\n[CK04]\n\nBennett Chow and Dan Knopf, The Ricci flow: an introduction, Mathematical Surveys and Monographs,\nvol. 110, American Mathematical Society, Providence, RI, 2004. MR MR2061425 (2005e:53101)\n\n[DM82]\n\nIsabel Dotti Miatello, Ricci curvature of left invariant metrics on solvable unimodular Lie groups, Math.\nZ. 180 (1982), no. 2, 257–263. MR MR661702 (84a:53044)\n\n26\n\n\f[Ebe08]\n\nPatrick Eberlein, Riemannian 2-step nilmanifolds with prescribed Ricci tensor, Geometric and probabilistic\nstructures in dynamics, Contemp. Math., vol. 469, Amer. Math. Soc., Providence, RI, 2008, pp. 167–195.\n\n[EJ09]\n\nPatrick Eberlein and Michael Jablonski, Closed orbits of semisimple group actions and the real HilbertMumford function, New developments in Lie theory and geometry, Contemp. Math., vol. 491, Amer. Math.\nSoc., Providence, RI, 2009, pp. 283–321. MR MR2537062\n\n[GW88]\n\nCarolyn S. Gordon and Edward N. Wilson, Isometry groups of Riemannian solvmanifolds, Trans. Amer.\nMath. Soc. 307 (1988), no. 1, 245–269. MR MR936815 (89g:53073)\n\n[Heb98]\n\nJens Heber, Noncompact homogeneous Einstein spaces, Invent. Math. 133 (1998), no. 2, 279–352. MR\nMR1632782 (99d:53046)\n\n[HSS08]\n\nPeter Heinzner, Gerald W. Schwarz, and Henrik Stötzel, Stratifications with respect to actions of real\nreductive groups, Compos. Math. 144 (2008), no. 1, 163–185. MR MR2388560 (2009a:32030)\n\n[Jab08a] Michael Jablonski, Detecting orbits along subvarieties via the moment map, arXiv:0810.5697 [math.DG] –\nto appear in Münster Journal of Math (2008).\n[Jab08b]\n\n, Distinguished orbits of reductive groups, arXiv:0806.3721v1 [math.DG] (2008).\n\n[Jab09]\n\n, Moduli of Einstein and non-Einstein nilradicals, arXiv:0902.1698 [math.DG] (2009).\n\n[Jab10]\n\n, A natural Riemannian function on nilpotent lie groups, in progress (2010).\n\n[Jen69]\n\nGary R. Jensen, Homogeneous Einstein spaces of dimension four, J. Differential Geometry 3 (1969), 309–\n349. MR MR0261487 (41 #6100)\n\n[Jen71]\n\nGary Jensen, The scalar curvature of left-invariant riemannian metrics, Indiana Univ. Math. J. 20 (1971),\n1125–1144.\n\n[Kir84]\n\nFrances Clare Kirwan, Cohomology of quotients in symplectic and algebraic geometry, Mathematical Notes\n31, Princeton University Press, Princeton, New Jersey, 1984.\n\n[KN78]\n\nG. Kempf and L. Ness, The length of vectors in representation spaces, Springer Lecture Notes 732 (Copenhagen), Algebraic Geometry, Proceedings, 1978, pp. 233–244.\n\n[Lau]\n\nJorge Lauret, Personal communication.\n\n[Lau01a]\n\n, Ricci soliton homogeneous nilmanifolds, Math. Ann. 319 (2001), no. 4, 715–733. MR MR1825405\n(2002k:53083)\n\n[Lau01b]\n\n, Standard Einstein solvmanifolds as critical points, Q. J. Math. 52 (2001), no. 4, 463–470. MR\nMR1874492 (2002j:53048)\n\n[Lau03]\n\n, On the moment map for the variety of Lie algebras, J. Funct. Anal. 202 (2003), no. 2, 392–423.\n\n[Lau07]\n\n, Einstein solvmanifolds are standard, arXiv:math.DG/0703472 – to appear in Ann. of Math. (2007).\n\n[Lau08]\n\n, Einstein solvmanifolds and nilsolitons, arxiv:math.DG/0806.0035 (2008).\n\n[Lau10]\n\n, Ricci soliton solvmanifolds, arXiv:math.DG/1002.0384 – to appear in Crelle's Journal (2010).\n\n[LW07]\n\nJorge Lauret and Cynthia Will, Einstein solvmanifolds:\narXiv:math/0602502v3 [math.DG] (2007).\n\n[Mar01]\n\nAlina Marian, On the real moment map, Math. Res. Lett. 8 (2001), no. 5-6, 779–788. MR MR1879820\n(2003a:53123)\n\n[Mil76]\n\nJohn Milnor, Curvatures of left invariant metrics on Lie groups, Advances in Math. 21 (1976), no. 3,\n293–329. MR MR0425012 (54 #12970)\n\n[Mos55]\n\nG. D. Mostow, Self-adjoint groups, Ann. of Math. (2) 62 (1955), 44–55. MR MR0069830 (16,1088a)\n\n[Mos56]\n\n, Fully reducible subgroups of algebraic groups, Amer. J. Math. 78 (1956), 200–221. MR MR0092928\n(19,1181f)\n\n[Nik05]\n\nYu. G. Nikonorov, Noncompact homogeneous Einstein 5-manifolds, Geom. Dedicata 113 (2005), 107–143.\nMR MR2171301 (2006h:53037)\n\nExistence and non-existence questions,\n\n[Nik08a] Y. Nikolayevsky, Einstein solvmanifolds and the pre-Einstein derivation, (arXiv:0802.2137) to appear in\nTrans. Amer. Math. Soc. (2008).\n[Nik08b]\n\n, Einstein solvmanifolds attached to two-step nilradicals, arXiv:0805.0646v1 [math.DG] (2008).\n\n27\n\n\f[Nik08c] Yuri Nikolayevsky, Einstein solvmanifolds with a simple Einstein derivation, Geom. Dedicata 135 (2008),\n87–102. MR MR2413331 (2009f:53064)\n[Nik08d]\n\n, Einstein solvmanifolds with free nilradical, Ann. Global Anal. Geom. 33 (2008), no. 1, 71–87. MR\nMR2369187 (2008m:53120)\n\n[NM84]\n\nLinda Ness and David Mumford, A stratification of the null cone via the moment map, American Journal\nof Mathematics 106 (1984), no. 6, 1281–1329.\n\n[Pay10]\n\nTracy L. Payne, The existence of soliton metrics for nilpotent Lie groups, Geom. Dedicata 145 (2010),\n71–88. MR MR2600946\n\n[Rag72]\n\nM. S. Raghunathan, Discrete subgroups of Lie groups, Springer-Verlag, New York, 1972, Ergebnisse der\nMathematik und ihrer Grenzgebiete, Band 68. MR MR0507234 (58 #22394a)\n\n[RS90]\n\nR.W. Richardson and P.J. Slodowy, Minimum vectors for real reductive algebraic groups, J. London Math.\nSoc. 42 (1990), 409–429.\n\n[Sja98]\n\nReyer Sjamaar, Convexity properties of the moment mapping re-examined, Adv. Math. 138 (1998), no. 1,\n46–91. MR MR1645052 (2000a:53148)\n\n[Whi57]\n\nHassler Whitney, Elementary structure of real algebraic varieties, The Annals of Mathematics 66 (1957),\nno. 3, 545–556, 2nd Ser.\n\n[Wil03]\n\nC.E. Will, Rank-one einstein solvmanifolds of dimension 7, Diff. Geom. Appl. 19 (2003), 307–318.\n\n[Wil10]\n\nCynthia Will, A curve of nilpotent Lie algebras which are not Einstein nilradicals, Monatsh. Math. 159\n(2010), no. 4, 425–437. MR MR2600907\n\n[WZ86]\n\nMcKenzie Y. Wang and Wolfgang Ziller, Existence and nonexistence of homogeneous Einstein metrics,\nInvent. Math. 84 (1986), no. 1, 177–194. MR 830044 (87e:53081)\n\n28\n\n\f"}