{"id": "http://arxiv.org/abs/0706.3712v4", "guidislink": true, "updated": "2010-09-07T16:20:12Z", "updated_parsed": [2010, 9, 7, 16, 20, 12, 1, 250, 0], "published": "2007-06-26T13:29:16Z", "published_parsed": [2007, 6, 26, 13, 29, 16, 1, 177, 0], "title": "Resonant and Near-Resonant Internal Wave Interactions", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0706.3062%2C0706.0874%2C0706.3857%2C0706.4307%2C0706.2260%2C0706.2385%2C0706.3935%2C0706.2443%2C0706.2018%2C0706.0918%2C0706.0029%2C0706.3230%2C0706.3980%2C0706.3253%2C0706.3873%2C0706.2177%2C0706.3214%2C0706.2029%2C0706.3674%2C0706.0808%2C0706.0230%2C0706.0446%2C0706.0439%2C0706.4075%2C0706.3869%2C0706.0896%2C0706.2122%2C0706.2609%2C0706.3019%2C0706.2750%2C0706.3289%2C0706.3050%2C0706.1231%2C0706.2485%2C0706.1842%2C0706.2682%2C0706.1869%2C0706.1786%2C0706.4184%2C0706.0494%2C0706.3512%2C0706.0823%2C0706.0493%2C0706.1120%2C0706.3931%2C0706.1303%2C0706.3896%2C0706.2572%2C0706.0878%2C0706.0967%2C0706.0793%2C0706.3874%2C0706.1795%2C0706.4056%2C0706.0647%2C0706.2782%2C0706.1789%2C0706.2810%2C0706.3031%2C0706.3336%2C0706.1010%2C0706.0582%2C0706.2073%2C0706.1296%2C0706.0280%2C0706.4133%2C0706.3712%2C0706.2332%2C0706.2867%2C0706.0638%2C0706.3843%2C0706.3762%2C0706.2780%2C0706.1290%2C0706.0988%2C0706.1408%2C0706.2263%2C0706.2578%2C0706.3847%2C0706.3262%2C0706.3275%2C0706.3742%2C0706.0330%2C0706.1360%2C0706.2367%2C0706.3471%2C0706.2637%2C0706.1377%2C0706.2374%2C0706.0907%2C0706.2760%2C0706.0514%2C0706.2291%2C0706.3692%2C0706.2662%2C0706.1685%2C0706.3792%2C0706.3045%2C0706.3997%2C0706.1699%2C0706.1199&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Resonant and Near-Resonant Internal Wave Interactions"}, "summary": "We report evaluations of a resonant kinetic equation that suggest the slow\ntime evolution of the Garrett and Munk spectrum is {\\em not}, in fact, slow.\nInstead nonlinear transfers lead to evolution time scales that are smaller than\none wave period at high vertical wavenumber. Such values of the transfer rates\nare inconsistent with conventional wisdom that regards the Garrett and Munk\nspectrum as an approximate stationary state and puts the self-consistency of a\nresonant kinetic equation at a serious risk. We explore possible reasons for\nand resolutions of this paradox. Inclusion of near-resonant interactions\ndecreases the rate at which the spectrum evolves. This leads to improved\nself-consistency of the kinetic equation.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0706.3062%2C0706.0874%2C0706.3857%2C0706.4307%2C0706.2260%2C0706.2385%2C0706.3935%2C0706.2443%2C0706.2018%2C0706.0918%2C0706.0029%2C0706.3230%2C0706.3980%2C0706.3253%2C0706.3873%2C0706.2177%2C0706.3214%2C0706.2029%2C0706.3674%2C0706.0808%2C0706.0230%2C0706.0446%2C0706.0439%2C0706.4075%2C0706.3869%2C0706.0896%2C0706.2122%2C0706.2609%2C0706.3019%2C0706.2750%2C0706.3289%2C0706.3050%2C0706.1231%2C0706.2485%2C0706.1842%2C0706.2682%2C0706.1869%2C0706.1786%2C0706.4184%2C0706.0494%2C0706.3512%2C0706.0823%2C0706.0493%2C0706.1120%2C0706.3931%2C0706.1303%2C0706.3896%2C0706.2572%2C0706.0878%2C0706.0967%2C0706.0793%2C0706.3874%2C0706.1795%2C0706.4056%2C0706.0647%2C0706.2782%2C0706.1789%2C0706.2810%2C0706.3031%2C0706.3336%2C0706.1010%2C0706.0582%2C0706.2073%2C0706.1296%2C0706.0280%2C0706.4133%2C0706.3712%2C0706.2332%2C0706.2867%2C0706.0638%2C0706.3843%2C0706.3762%2C0706.2780%2C0706.1290%2C0706.0988%2C0706.1408%2C0706.2263%2C0706.2578%2C0706.3847%2C0706.3262%2C0706.3275%2C0706.3742%2C0706.0330%2C0706.1360%2C0706.2367%2C0706.3471%2C0706.2637%2C0706.1377%2C0706.2374%2C0706.0907%2C0706.2760%2C0706.0514%2C0706.2291%2C0706.3692%2C0706.2662%2C0706.1685%2C0706.3792%2C0706.3045%2C0706.3997%2C0706.1699%2C0706.1199&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We report evaluations of a resonant kinetic equation that suggest the slow\ntime evolution of the Garrett and Munk spectrum is {\\em not}, in fact, slow.\nInstead nonlinear transfers lead to evolution time scales that are smaller than\none wave period at high vertical wavenumber. Such values of the transfer rates\nare inconsistent with conventional wisdom that regards the Garrett and Munk\nspectrum as an approximate stationary state and puts the self-consistency of a\nresonant kinetic equation at a serious risk. We explore possible reasons for\nand resolutions of this paradox. Inclusion of near-resonant interactions\ndecreases the rate at which the spectrum evolves. This leads to improved\nself-consistency of the kinetic equation."}, "authors": ["Yuri V. Lvov", "Kurt L. Polzin", "Naoto Yokoyama"], "author_detail": {"name": "Naoto Yokoyama"}, "author": "Naoto Yokoyama", "links": [{"href": "http://arxiv.org/abs/0706.3712v4", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0706.3712v4", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "physics.flu-dyn", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "physics.flu-dyn", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "physics.ao-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0706.3712v4", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0706.3712v4", "arxiv_comment": null, "journal_reference": "Journal of Physical Oceanography, 669-691, 42, (2012)", "doi": null, "fulltext": "arXiv:0706.3712v4 [physics.flu-dyn] 7 Sep 2010\n\nResonant and Near-Resonant Internal Wave\nInteractions\nYuri V. Lvov1, Kurt L. Polzin2 and Naoto Yokoyama3\n1\n\nDepartment of Mathematical Sciences, Rensselaer Polytechnic Institute, Troy NY 12180\n2\n\n3\n\nWoods Hole Oceanographic Institution, MS#21, Woods Hole, MA 02543\n\nDepartment of Aeronautics and Astronautics, Kyoto University, Kyoto, Kyoto 606-8501 JAPAN\n\n\fAbstract\nWe report evaluations of a resonant kinetic equation that suggest the slow time\nevolution of the Garrett and Munk spectrum is not, in fact, slow. Instead nonlinear transfers lead to evolution time scales that are smaller than one wave period at\nhigh vertical wavenumber. Such values of the transfer rates are inconsistent with\nconventional wisdom that regards the Garrett and Munk spectrum as an approximate stationary state and puts the self-consistency of a resonant kinetic equation at\na serious risk. We explore possible reasons for and resolutions of this paradox.\nInclusion of near-resonant interactions decreases the rate at which the spectrum\nevolves. This leads to improved self-consistency of the kinetic equation.\n\n1\n\n\f1. Introduction\nWave-wave interactions in stratified oceanic flows have been a subject of intensive research\nin the last four decades. Of particular importance is the existence of a \"universal\" internalwave spectrum, the Garrett and Munk spectrum. It is generally perceived that the existence\nof a universal spectrum is, at least in part and perhaps even primarily, the result of nonlinear\ninteractions of waves with different wavenumbers. Due to the quadratic nonlinearity of the\nunderlying primitive equations and the fact that the linear internal-wave dispersion relation can\nsatisfy a three-wave resonance condition, waves interact in triads. Therefore the question arises:\nhow strongly do waves within a given triad interact? What are the oceanographic consequences\nof this interaction?\nWave-wave interactions can be rigorously characterized by deriving a closed equation representing the slow time evolution of the wavefield's wave action spectrum. Such an equation is\ncalled a kinetic equation (Zakharov et al. 1992) and significant efforts in this regard are listed\nin Table 8.\nA kinetic equation describes, under the assumption of weak nonlinearity, the resonant spectral energy transfer on the resonant manifold. The resonant manifold is a set of wavevectors p,\np1 and p2 that satisfy\np = p1 + p2 , ωp = ωp1 + ωp2 ,\n\n(1)\n\nwhere the frequency ω is given by a linear dispersion relation relating wave frequency ω with\nwavenumber p.\nThe reduction of all possible interactions between three wavevectors to a resonant manifold\nis a significant simplification. Even further simplification can be achieved by taking into account\n\n2\n\n\fthat, of all interactions on the resonant manifold, the most important are those which involve\nextreme scale separations McComas and Bretherton (1977) between interaction wavevectors. It\nis shown in McComas (1977) that Garrett and Munk spectrum of internal waves is stationary\nwith respect to one class of such interactions, called Induced Diffusion. Furthermore, a comprehensive inertial-range theory with constant downscale transfer of energy was obtained by\npatching these mechanisms together in a solution that closely mimics the empirical universal\nspectrum (GM)(McComas and Müller 1981a). It was therefore concluded that that Garrett and\nMunk spectrum constitutes an approximate stationary state of the kinetic equation.\nIn this paper we revisit the question of relation between Garrett and Munk spectrum and the\nresonant kinetic equation. At the heart of this paper (Section a) are numerical evaluations of the\nLvov and Tabak (2004) internal wave kinetic equation demonstrating changes in spectral amplitude at a rate less than an inverse wave period at high vertical wavenumber for the Garrett and\nMunk spectrum. This rapid temporal evolution implies that the GM spectrum is not a stationary\nstate and is contrary to the characterization of the GM spectrum as an inertial subrange. This\nresult gave us cause to review published work concerning wave-wave interactions and compare\nresults. The product of this work is presented in Sections 3&4. In particular, we concentrate on\nfour different versions of the internal wave kinetic equation:\n• a noncanonical description using Lagrangian coordinates (Olbers 1974, 1976; Müller and Olbers\n1975),\n• a canonical Hamiltonian description in Eulerian coordinates (Voronovich 1979),\n• a dynamical derivation of a kinetic equation without use of Hamiltonian formalisms in\nEulerian coordinates (Caillol and Zeitlin 2000),\n• a canonical Hamiltonian description in isopycnal coordinates (Lvov and Tabak 2001, 2004).\n3\n\n\fWe show in Section 3 that, without background rotation, all the listed approaches are equivalent\non the resonant manifold. In Section 4 we demonstrate that the two versions of the kinetic\nequation that consider non-zero rotation rates are again equivalent on the resonant manifold.\nThis presents us with our first paradox: if all these kinetic equations are the same on the resonant\nmanifold and exhibit a rapid temporal evolution, then why is GM considered to be a stationary\nstate? The resolution of this paradox, presented in Section 7, is that: (i) numerical evaluations\nof the McComas (1977) kinetic equation demonstrating the induced diffusion stationary states\nrequire damping in order to balance the fast temporal evolution at high vertical wavenumber,\nand (ii) the high wavenumber temporal evolution of the Lvov and Tabak (2004) kinetic equation\nis tentatively identified as being associated with the elastic scattering mechanism rather than\ninduced diffusion.\nHaving clarified this, we proceed to the following observation: Not only do our numerical evaluations imply that the GM spectrum is not a stationary state, the rapid evolution rates\ncorrespond to a strongly nonlinear system. Consequently the self-consistency of the kinetic\nequation, which is built on an assumption of weak nonlinearity, is at risk. Moreover, reduction of all resonant wave-wave interactions exclusively to extreme scale separations is also not\nself-consistent.\nYet, we are not willing to give up on the kinetic equation. Our second paradox is that, in\na companion paper (Lvov et al. tted) we show how a comprehensive theory built on a scale invariant resonant kinetic equation helps to interpret the observed variability of the background\noceanic internal wavefield. The observed variability, in turn, is largely consistent with the induced diffusion mechanism being a stationary state!\nThus the resonant kinetic equation demonstrates promising predictive ability and it is there-\n\n4\n\n\ffore tempting to move towards a self-consistent internal wave turbulence theory. One possible\nroute towards such theory is to include to the kinetic equation near-resonant interactions, defined as\n\np = p1 + p2 , | ωp − ωp1 − ωp2 |< Γ,\nwhere Γ is the resonance width. We show in Section b that such resonant broadening leads\nto slower evolution rates, potentially leading to a more self consistent description of internal\nwaves.\nWe conclude and list open questions in Section 8. Our numerical scheme for evaluating nearresonant interactions is discussed in Section 5. An appendix contains the interaction matrices\nused in this study.\n\n2. Background\nA kinetic equation is a closed equation for the time evolution of the wave action spectrum in\na system of weakly interacting waves. It is usually derived as a central result of wave turbulence\ntheory. The concepts of wave turbulence theory provide a fairly general framework for studying\nthe statistical steady states in a large class of weakly interacting and weakly nonlinear manybody or many-wave systems. In its essence, classical wave turbulence theory (Zakharov et al.\n1992) is a perturbation expansion in the amplitude of the nonlinearity, yielding, at the leading\norder, linear waves, with amplitudes slowly modulated at higher orders by resonant nonlinear\ninteractions. This modulation leads to a redistribution of the spectral energy density among\nspace- and time-scales.\n\n5\n\n\fWhile the route to deriving the spectral evolution equation from wave amplitude is fairly\nstandardized (Section b), there are substantive differences in obtaining expressions for the evolution equations of wave amplitude a. Section a describes various attempts to do so.\n\na. Hamiltonian Structures and Field Variables\n\n1) A\n\nCANONICAL\n\nH AMILTONIAN\n\nFORMULATION IN ISOPYCNAL COORDINATES\n\nLvov and Tabak (2001, 2004) start from the primitive equations of motion written in isopycnal coordinates:\n\n\u0013\n∂z\nu\n= 0,\n∂ρ\n∇M\n∂u\n+ f u⊥ + u * ∇u +\n= 0,\n∂t\nρ0\n∂M\n− gz = 0.\n∂ρ\n∂ ∂z\n+∇*\n∂t ∂ρ\n\n\u0012\n\n(2)\n\nrepresenting mass conservation, horizontal momentum conservation under the Bousinesq approximation and hydrostatic balance. The velocity u is then represented as:\n\nu = ∇φ + ∇⊥ ψ,\n\nwith ∇⊥ = (−∂/∂y, ∂/∂x) and a normalized differential layer thickness is introduced:\n\nΠ = ρ/g∂ 2 M/∂ρ2 = ρ∂z/∂ρ\n\n(3)\n\nSince both potential vorticity and density are conserved along particle trajectories, an initial\n\n6\n\n\fprofile of the potential vorticity that is a function of the density will be preserved by the flow.\nHence it is self-consistent to assume that the potential vorticity q is function of ρ only, independent of x and y:\nq(ρ) = q0 (ρ) =\n\nf\n,\nΠ0 (ρ)\n\n(4)\n\nwhere Π0 (ρ) = −g/N(ρ)2 is a reference stratification profile with background buoyancy frequency, N = (−g/(ρ∂z/∂ρ|bg ))1/2 , independent of x and y. The variable ψ can then be eliminated by assuming that potential vorticity is constant on an isopycnal so that f + ∆ψ = q0 Π\nand one obtains two equations in Π and φ:\n\nΠt + ∇ * (Π(∇φ + ∇⊥ ∆−1 (q0 Π − 1))) = 0\nφt +\n\n1\n| ∇φ + ∇⊥ ∆−1 (q0 Π − 1) |2 +∆−1 ∇ * [q0 Π(∇⊥ φ − ∇∆−1 (q0 Π − 1))]+\n2\nZ Z ′\n1 ρ ρ Π − Π0\ndρ1 dρ′\nρ\nρ1\n\n=\n\n0(5)\n\nHere ∆−1 is the inverse Laplacian and ρ′ represents a variable of integration rather than perturbation. Serendipitously, the variable Π is the canonical conjugate of φ:\n\n∂Π\nδH\n=\n,\n∂t\nδφ\n\n∂φ\nδH\n=−\n,\n∂t\nδΠ\n\n(6)\n\nunder a Hamiltonian H:\nZ\nZ\n2\ng\nf ⊥ −1\n1\n∇ ∆ Π(x, ρ) +\nH = dxdρ − (Π0 + Π(x, ρ)) ∇φ(x, ρ) +\n2\nΠ0\n2\n\nρ\n\nΠ(x, ρ′ )\ndρ′\nρ′\n\n2\n\n!\n\n.\n(7)\n\nthat is the sum of kinetic and potential energies.\n7\n\n\fSwitching to Fourier space, and introducing a complex field variable ap through the transformation\n\nφp\nΠp\n\n√\n\u0001\niN ωp\n= √\nap − a∗−p ,\n2g|k|\n\u0001\nN Π0 |k|\n= Π0 − p\nap + a∗−p ,\n2 gωp\n\n(8)\n\nwhere the frequency ω satisfies the linear dispersion relation\n\nωp =\n\ns\n\nf2 +\n\ng 2 |k|2\n,\nρ20 N 2 m2\n\n(9)\n\nthe equations of motion (2) adopt the canonical form\n\ni\n\nδH\n∂\nap = ∗ ,\n∂t\nδap\n\n(10)\n\nwith the Hamiltonian\n\nH=\n+\n\nZ\n\nZ\n\ndp ωp |ap |2\n\u0001\ndp012 δp+p1 +p2 (Up,p1 ,p2 a∗p a∗p1 a∗p2 + c.c.) + δ−p+p1 +p2 (Vpp1 ,p2 a∗p ap1 ap2 + c.c.) .\n\n(11)\n\nEq. (10) is Hamilton's equation and (11) is the standard form of the Hamiltonian of a\nsystem dominated by three-wave interactions (Zakharov et al. 1992). Calculations of interaction\ncoefficients U and V are tedious but straightforward task, completed in Lvov and Tabak (2001,\n2004).\nWe emphasize that (10) is, with simply a Fourier decomposition and assumption of uniform\n8\n\n\fpotential vorticity on an isopycnal, precisely equivalent to the fully nonlinear equations of motion in isopycnal coordinates (2). All other formulations of an internal wave kinetic equation\ndepend upon a linearization prior to the derivation of the kinetic equation via an assumption of\nweak nonlinearity.\nThe difficulty is that, in order to utilize Hamilton's Equation (10), the Hamiltonian (7) must\nfirst be constructed as a function of the generalized coordinates and momenta (Π and φ here). It\nis not always possible to do so directly, in which case one must set up the associated Lagrangian\n(L below) and then calculate the generalized coordinates and momenta.\n\n2) H AMILTONIAN\n\nFORMALISM IN\n\nC LEBSCH\n\nVARIABLES IN\n\n(VORONOVICH 1979)\n\nVoronovich starts from the non-rotating equations in Eulerian coordinates:\n\n∂u\n−1\n+ u * ∇u =\n∇p − gẑ\n∂t\nρ\n∇*u=0\n∂ρ\n+ u * ∇ρ = 0 .\n∂t\n\n(12)\n\nThe Hamiltonian of the system is\n\n\u0013\nZ \u0012\nv2\nH=\n(ρ0 + ρ) + Π(ρo + ρ) − Π(ρo ) + ρgz dr,\n2\n\n(13)\n\nwhere ρ0 (z) is the equilibrium density profile, ρ is the wave perturbation and Π is a potential\n\n9\n\n\fenergy density function:\n\nΠ(ρo + ρ) − Π(ρo ) + ρgz = g\n\nZ\n\nη(ρo )\n\nη(ρo +ρ)\n\n[ρ0 + ρ − ρ0 (ξ)]dξ\n\n(14)\n\nwith η(ξ) being the inverse of ρo (z). The intent is to use ρ and Lagrange multiplier λ as the\ncanonically conjugated Hamiltonian pair:\n\n∂H\n= −(v∇)λ + g(z − η(ρo + ρ))\n∂ρ\n∂H\nρ̇ = −\n= −(v∇)(ρo + ρ)\n∂λ\nλ̇ =\n\n(15)\n\n(16)\n\nwith z − η(ρo + ρ) being the vertical displacement of a fluid parcel and the second equation\nrepresenting continuity. The issue is to express the velocity v as a function of λ and ρ, and to\nthis end one introduces yet another function Φ with the harmonious feature\n\nδH\n=0\nδΦ\n\n(17)\n\nand a constraint. That constraint is provided by:\n\n∇*v =−\n\nδH\n=0\nδΦ\n\n(18)\n\nVoronovich (1979) then identifies the functional relationship:\n\nv=\n\n1\n1\n(∇Φ + λ∇(ρ0 + ρ)) ∼\n= (∇Φ + λ∇(ρ0 + ρ)) ,\nρ0 + ρ\nρ\n\n10\n\n(19)\n\n\fwith the right-hand-side representing the Boussinesq approximation. The only thing stopping\nprogress at this point is the explicit appearance of ξ in (14), and to eliminate this explicit dependence a Taylor series in density perturbation ρ relative to ρ0 is used to express the potential\nenergy in terms of ρ and λ. The resulting Hamiltonian H is\n\nH=\n\nZ\n\nv2\n1\n[ +Π(ρo +ρ)−Π(ρo )+ρgz]dr ∼\n=\n2\n2\n\nZ\n\n[λ∇(ρo +ρ)(∇Φ+λ∇(ρo +ρ))−\n\ng 2 gρ′′o ρ3\nρ + ′3 ]dr\nρ′o\nρo 3\n(20)\n\nwith primes indicating ∂/∂z.\nThe only approximations that have been made to obtain (20) are the Bousinesq approximation in the nonrotating limit, the specification that the velocity be represented as (19) and a\nTaylor series expansion. The Taylor series expansion is used to express the Hamiltonian in terms\nof canonically conjugated variables ρ and λ. Truncation of this Taylor series is the essence of\nthe slowly varying (WKB) approximation that the vertical scale of the internal wave is smaller\nthan the vertical scale of the background stratification, which requires, for consistency sake, the\nhydrostatic approximation.\nThe procedure of introducing additional functionals (Φ) and constraints (18) originates in\nClebsch (1959). See Seliger and Witham (9968) for an discussion of Clebsch variables and\nalso Section 7.1 of the textbook Miropolsky (1981). Finally, the evolution equation for wave\namplitude ak is produced by expressing the cubic terms in the Hamiltonian with solutions to the\nlinear problem represented by the quadratic components of the Hamiltonian. This is an explicit\nlinearization of the problem prior to the formulation of the kinetic equation.\n\n11\n\n\f3) O LBERS , M C C OMAS\n\nAND\n\nM EISS\n\nDerivations presented in Olbers (1974), McComas (1975), and Meiss et al. (1979) are based\nupon the Lagrangian equations of motion:\n\n−1\npx\nρ\n−1\nÿ + f ẋ =\npy\nρ\n−1\nz̈ + g =\npz\nρ\n\nẍ − f ẏ =\n\n∂(x1 , x2 , x3 )/∂(r1 , r2 , r3 ) = 1\n\n(21)\n\nexpressing momentum conservation and incompressibility. Here r is the initial position of a\nfluid parcel at x: these are Lagrangian coordinates. In the context of Hamiltonian mechanics,\nthe associated Lagrangian density is:\n\n1\nL = ρ (ẋi ẋj + ǫjkl fi ẋk xl ) − ρgδj3xj + P(J − 1)\n2\n\nwhere xj = xj (r, t) is the instantaneous position of the parcel of fluid which was initially at\nr, P(x) is a Lagrange multiplier corresponding to pressure, and J = ∂x/∂r is the Jacobian,\nwhich ensures the fluid is incompressible.\nIn terms of variables representing a departure from hydrostatic equilibrium:\n\nξj (r, t) = xj (r, t) − rj , π(r, t) = P (x, t) − Pk (r).\n\n12\n\n\fthe Boussinesq Lagrangian density L for slow variations in background density ρ is:\n1\n∂ξi\nL = [ξi2 + ǫjkl fi ξ ̇k ξl − N 2 ξ32 + π(\n+ ∆ii + ∆)]\n2\n∂xi\n\nwith\n\n∂ξi\n∂xi\n\n(22)\n\n+ ∆ii + ∆ representing the continuity equation where ∆ = det(∂ξi /∂xj ).\n\nThis Lagrangian is then projected onto a single wave amplitude variable a using the linear\ninternal wave constancy relations1 based upon plane wave solutions [e.g. Mul̈ler (1976), (2.26)]\nand a perturbation expansion in wave amplitude is proposed. This process has two consequences: The use of internal wave consistency relations places a condition of zero perturbation\npotential vorticity upon the result, and the expansion places a small amplitude approximation\nupon the result with ill defined domain of validity relative to the (later) assertion of weak interactions.\nThe evolution equation for wave amplitude is Lagrange's equation:\n\n∂L\nd ∂L\n−\n=0\ndt ∂ ȧ0 ∂a0\n\n(23)\n\nin which a0 is the zeroth order wave amplitude. After a series of approximations, this equation\nis cast into a field variable equation similar to (10). We emphasize that to get there small\ndisplacement of parcel of fluid was used, together with the built in assumption of resonant\ninteractions between internal wave modes. The (Lvov and Tabak 2001, 2004) approach is free\nfrom such limitations.\n1\n\nWave amplitude a is defined so that a∗ a is proportional to wave energy.\n\n13\n\n\f4) C AILLOL\n\nAND\n\nZ EITLIN\n\nA non-Hamiltonian kinetic equation for internal waves was derived in Caillol and Zeitlin\n(2000), their (61) directly from the dynamical equations of motion, without the use of the\nHamiltonian structure. Caillol and Zeitlin (2000) invoke the Craya-Herring decomposition for\nnon-rotating flows which enforces a condition of zero perturbation vorticity on the result.\n\n5) K ENYON\n\nAND\n\nH ASSELMANN\n\nThe first kinetic equations for wave-wave interactions in a continuously stratified ocean appear in Kenyon (1966), Hasselmann (1966) and Kenyon (1968). Kenyon (1968) states (without\ndetail) that Kenyon (1966) and Hasselmann (1966) give numerically similar results. We have\nfound that Kenyon (1966) differs from the four approaches examined below on one of the resonant manifolds, but have not pursued the question further. It is possible this difference results\nfrom a typographical error in Kenyon (1966). We have not rederived this non-Hamiltonian\nrepresentation and thus exclude it from this study.\n\n6) P ELINOVSKY\n\nAND\n\nR AEVSKY\n\nAn important paper on internal waves is Pelinovsky and Raevsky (1977). Clebsch variables\nare used to obtain the interaction matrix elements for both constant stratification rates, N =\nconst., and arbitrary buoyancy profiles, N = N(z), in a Lagrangian coordinate representation.\nNot much details are given, but there are some similarities in appearance with the Eulerian coordinate representation of Voronovich (1979). The most significant result is the identification of\na scale invariant (non-rotating, hydrostatic) stationary state which we refer to as the Pelinovsky-\n\n14\n\n\fRaevsky in the companion paper (Lvov et al. tted). It is stated in Pelinovsky and Raevsky\n(1977) that their matrix elements are equivalent to those derived in their citation [11], which\nis Brehovski (1975). Because Brehovski (1975) and Pelinovsky and Raevsky (1977) are in\nRussian and not generally available, we refrain from including them in this comparison.\n\n7) M ILDER\n\nAn alternative Hamiltonian description was developed in Milder (1982), in isopycnal coordinates without assuming a hydrostatic balance. The resulting Hamiltonian is an iterative\nexpansion in powers of a small parameter, similar to the case of surface gravity waves. In principle, that approach may also be used to calculate wave-wave interaction amplitudes. Since\nthose calculations were not done in Milder (1982), we do not pursue the comparison further.\n\nb. Weak Turbulence\n\nHere we derive the kinetic equation following Zakharov et al. (1992). We introduce wave\naction as\nnp = ha∗p ap i,\n\n(24)\n\nwhere h. . . i means the averaging over statistical ensemble of many realizations of the internal waves. To derive the time evolution of np we multiply the amplitude equation (10) with\nHamiltonian (11) by a∗p , multiply the amplitude evolution equation of a∗p by a, subtract the two\n\n15\n\n\fequations and average h. . . i the result. We get\n∂np\n= I\n∂t\n\nZ\n\nVpp1 p2 Jpp1 p2 δ(p − p1 − p2 )\n\n\u0001\np2 p2\n−Vpp\nJ\nδ(p\n−\np\n−\np\n)\ndp1 dp2\n2\n1\n1 pp1\n\n\u0001\np1 p1\n−Vpp\nJ\nδ(p\n−\np\n−\np)\ndp1 dp2 ,\n1\n2\n2 pp2\n\n(25)\n\nwhere we introduced a triple correlation function\n\nJpp1 p2 δ(p1 − p − p2 ) ≡ ha∗p ap1 ap2 i.\n\n(26)\n\nIf we were to have non-interacting fields, i.e. fields with Vpp1 p2 being zero, this triple correlation\nfunction would be zero. We then use perturbation expansion in smallness of interactions to\ncalculate the triple correlation at first order. The first order expression for ∂np /∂t therefore\nrequires computing ∂Jpp1 p2 /∂t to first order. To do so we take definition (26) and use (10) with\nHamiltonian (11) and apply h. . . i averaging. We get\n\u0012\n\u0013\n∂\ni + (ωp1 − ωp2 − ωp3 ) Jpp21p3\n∂t\n\nZ \u0014\n1\n=\n− (Vpp41p5 )∗ Jpp24pp35 δ(p1 − p4 − p5 )\n2\n+(Vpp24p5 )∗ Jpp31pp45 δ(p4 − p2 − p5 )\n\u0003\n+Vpp34p5 Jpp21pp45 δ(p4 − p3 − p5 ) dp4 dp5 . (27)\n\nHere we introduced the quadruple correlation function\n\nJpp31pp42 δ(p1 + p2 − p3 − p4 ) ≡ ha∗p1 a∗p2 ap3 ap4 i.\n16\n\n(28)\n\n\fThe next step is to assume Gaussian statistics, and to express Jpp31pp42 as a product of two twopoint correlators as\n\nh\ni\nJpp31pp42 = np1 np2 δ(p1 − p3 )δ(p2 − p4 ) + δ(p1 − p4 )δ(p2 − p3 ) .\nThen\n\n\u0014\n\u0015\n∂\ni + (ωp1 − ωp2 − ωp3 ) Jpp21p3 = (Vpp21p3 )∗ (n1 n3 + n1 n2 − n2 n3 ) .\n∂t\n\n(29)\n\nTime integration of the equation for Jpp21p3 will contain fast oscillations due to initial value of\nJpp21p3 and slow evolution due to the nonlinear wave interactions. Contribution from first term\nwill rapidly decrease with time, so neglecting these terms we get\n\nJpp21p3 =\n\n(Vpp21p3 )∗ (n1 n3 + n1 n2 − n2 n3 )\n.\nωp1 − ωp2 − ωp3 + iΓp1 p2 p3\n\n(30)\n\nHere we introduced the nonlinear damping of the waves Γp1 p2 p3 . We will elaborate on Γp1 p2 p3\nin Section (a). We now substitute (30) into (25), assume for now that the damping of the wave\nis small, and use\n\u0014\n\n\u0015\n1\nlim I\n= −πδ(∆).\n∆→0\n∆ + iΓ\n\n17\n\n(31)\n\n\fWe then obtain the three-wave kinetic equation (Zakharov et al. 1992; Lvov and Nazarenko\n2004; Lvov et al. 1997):\n\ndnp\n= 4π\ndt\n\nZ\n\n|Vpp1 ,p2 |2 fp12 δp−p1 −p2 δ(ωp − ωp1 − ωp2 )dp12\n\nZ\n\n−4π\n|Vpp21,p |2 f12p δp1 −p2 −p δ(ωp1 − ωp2 − ωp ) dp12\nZ\np2 2\n−4π\n|Vp,p\n| f2p1 δp2 −p−p1 δ(ωp2 − ωp − ωp1 ) dp12 ,\n1\nwith fp12 = np1 np2 − np (np1 + np2 ) .\n\n(32)\n\nHere np = n(p) is a three-dimensional wave action spectrum (spectral energy density divided by frequency) and the interacting wavevectors p, p1 and p2 are given by\n\np = (k, m),\n\ni.e. k is the horizontal part of p and m is its vertical component. We assume the wavevectors\nare signed variables and wave frequencies ωp are restricted to be positive. The magnitude of\np2\nwave-wave interactions Vp,p\nis a matrix representation of the coupling between triad members.\n1\n\nIt serves as a multiplier in the nonlinear convolution term in what is now commonly called the\nZakharov equation – equation in the Fourier space for the waves field variable. This is also an\nexpression that multiplies the cubic convolution term in the three-wave Hamiltonian.\nWe re-iterate that typical assumptions needed for the derivation of kinetic equations are:\n• Weak nonlinearity,\n• Gaussian statistics of the interacting wave field in wavenumber space and\n• Resonant wave-wave interactions\n18\n\n\fWe note that the derivation given here is schematic. A more systematic derivation can be obtained using only an assumption of weak nonlinearity.\n\nc. The Boltzmann Rate\n\nThe kinetic equation allows us to numerically estimate the life time of any given spectrum.\nIn particular, we can define a wavenumber dependent nonlinear time scale proportional to the\ninverse Boltzmann rate:\nτpNL =\n\nnp\n.\nṅp\n\n(33)\n\nThis time scale characterizes the net rate at which the spectrum changes and can be directly\ncalculated from the kinetic equation.\nOne can also define the characteristic linear time scale, equal to a wave period\n\nτpL = 2π/ωp .\n\nThe non-dimensional ratio of these time scales can characterize the level of nonlinearity in the\nnonlinear system:\nǫp =\n\nτpL\n2π ṅp\n=\nτpNL\nnp ωp\n\n(34)\n\nWe refer to (34) as a normalized Boltzmann rate.\nThe normalized Boltzmann rate serves as a low order consistency check for the various\nkinetic equation derivations. An O(1) value of ǫp implies that the derivation of the kinetic\nequation is internally inconsistent. The Boltzmann rate represents the net rate of transfer for\nwavenumber p. The individual rates of transfer into and out of p (called Langevin rates) are\n\n19\n\n\ftypically greater than the Boltzmann rate, (Müller et al. 1986; Pomphrey et al. 1980). This is\nparticularly true in the Induced Diffusion regime (defined below in Section 3) in which the rates\nof transfer into and out of p are one to three orders of magnitude larger than their residual and\nthe Boltzmann rates we calculate are not appropriate for either spectral spike or potentially for\nsmooth, homogeneous but anisotropic spectra (Müller et al. 1986). Estimates of the individual\nrates of transfer into and out of p can be addressed through Langevin methods (Pomphrey et al.\n1980). We focus here simply on the Boltzmann rate to demonstrate inconsistencies with the\nassumption of a slow time evolution. Estimates of the Boltzmann rate and ǫp require integration\nof (32). In this manuscript such integration is performed numerically.\n\n3. Resonant wave-wave interactions - nonrotational limit\nHow one can compare the function of two vectors p1 and p2 , and their sum or difference?\nFirst one realizes that out of 6 components of p1 and p2 , only relative angles between wavevectors enter into the equation for matrix elements. That is because the matrix elements depend on\nthe inner and outer products of wavevectors. The overall horizontal orientation of the wavevectors does not matter: relative angles can be determined from a triangle inequality and the magnitudes of the horizontal wavevectors k, k1 and k2 . Thus the only needed components are |k|,\n|k1 |, |k2 |, m and m1 (m2 is computed from m and m1 ). Further note that in the f = 0 and\nhydrostatic limit, all matrix elements become scale invariant functions. It is therefore sufficient\nto choose an arbitrary scalar value for |k|, and m, since only |k1 |/|k|, |k2 |/|k| and m1 /m enter\nthe expressions for matrix elements. We make the particular (arbitrary) choice that |k| = m = 1\nfor the purpose of numerical evaluation, and thus the only independent variables to consider are\n\n20\n\n\f|k1 |, |k2 | and m1 . Finally, m1 is determined from the resonance conditions, as explained in the\nnext subsection below. As a result, we are left with a matrix element as a function of only two\nparameters, k1 and k2 . This allows us to easily compare the values of matrix elements on the\nresonant manifold by plotting the values as a function of the two parameters.\n\na. Reduction to the Resonant Manifold\n\nWhen confined to the traditional form of the kinetic equation, wave-wave interactions are\nconstrained to the resonant manifolds defined by\n\na)\n\n\n\n\n\np = p1 + p2\n\n\n\n\n ω = ω1 + ω2\n\nb)\n\n\n\n\n\np1 = p2 + p\n\n\n\nω1 = ω2 + ω\n\nc)\n\n\n\n\n\np2 = p + p1\n\n.\n\n(35)\n\n\n\n\n ω2 = ω + ω1\n\nTo compare matrix elements on the resonant manifold we are going to use the above resonant\nconditions and the internal-wave dispersion relation (51). To determine vertical components\nm1 and m2 of the interacting wavevectors, one has to solve the resulting quadratic equations.\nWithout restricting generality we choose m > 0. There are two solutions for m1 and m2 given\nbelow for each of the three resonance types described above.\nResonances of type (35a) give\n\n\n\n\nm1 =\n\nm\n2|k|\n\n\u0010\n\n|k| + |k1 | + |k2 | +\n\n\u0011\np\n(|k| + |k1 | + |k2 |)2 − 4|k||k1|\n\n\n\n\nm2 = m − m1 .\n\n\u0010\n\u0011\n\np\n\nm\n\n2\nm1 = 2|k| |k| − |k1 | − |k2 | − (|k| − |k1 | − |k2 |) + 4|k||k1 |\n\n\n\nm2 = m − m1 .\n\n21\n\n,\n\n(36a)\n\n,\n\n(36b)\n\n\fNote that because of the symmetry, (36a) translates to (36b) if wavenumbers 1 and 2 are exchanged.\nResonances of type (35b) give\n\n\u0010\n\u0011\n\np\n\nm\n\nm2 = − 2|k|\n|k| − |k1 | − |k2 | + (|k| − |k1 | − |k2 |)2 + 4|k||k2 |\n\n\n\nm1 = m + m2 .\n\n\u0010\n\u0011\n\np\n\nm\n\nm2 = − 2|k|\n|k| + |k1 | − |k2 | + (|k| + |k1 | − |k2 |)2 + 4|k||k2|\n\n,\n\n(37a)\n\n,\n\n(37b)\n\n,\n\n(38a)\n\n.\n\n(38b)\n\n\n\n\nm1 = m + m2 .\n\nResonances of type (35c) give\n\n\u0011\n\u0010\n\np\n\nm\n\n2\nm1 = − 2|k| |k| − |k1 | − |k2 | + (|k| − |k1 | − |k2 |) + 4|k||k1 |\n\n\n\nm2 = m + m1 .\n\n\u0010\n\u0011\n\np\n\nm\n\nm1 = − 2|k|\n|k| − |k1 | + |k2 | + (|k| − |k1 | + |k2 |)2 + 4|k||k1|\n\n\n\nm2 = m + m1 .\n\nBecause of the symmetries of the problem, (37a) is equivalent to (38a), and (37b) is equivalent\nto (38b) if wavenumbers 1 and 2 are exchanged.\n\nb. Comparison of matrix elements\n\nAs explained above, we assume f = 0 and hydrostatic balance. Such a choice makes\nthe matrix elements to be scale-invariant functions that depend only upon |k1 | and |k2 |. As\na consequence of the triangle inequality we need to consider matrix elements only within a\n\n22\n\n\f\"kinematic box\" defined by\n\n||k1 | − |k2 || < |k| < |k1 | + |k2 |.\n\nThe matrix elements will have different values depending on the dimensions so that isopycnal\nand Eulerian approaches will give different values (49)-(50). To address this issue in the simplest possible way, we multiply each matrix element by a dimensional number chosen so that\nall matrix elements are equivalent for some specific wavevector. In particular, we choose the\nscaling constant so that |V (|k1 | = 1, |k2| = 1)|2 = 1. This allows a transparent comparison\nwithout worrying about dimensional differences between various formulations.\n\n1) R ESONANCES\n\nOF THE \" SUM \" TYPE\n\n(35 A )\n\nFigure 1 presents the values of the matrix element |Vpp1 ,p2 (36b) |2 on the resonant submanifold given explicitly by (36b). All approaches give equivalent results. This is confirmed\nby plotting the relative ratio between these approaches, and it is given by numerical noise (not\nshown). The solution (36a) gives the same matrix elements but with |k1 | and |k2 | exchanged\nowing to their symmetries.\n\n2) R ESONANCES\n\nOF THE \" DIFFERENCE \" TYPE\n\n(35 B )\n\nAND\n\n(35 C )\n\nWe then turn our attention to resonances of \"difference\" type (35b) for which (35c) could be\nobtained by symmetrical exchange of the indices. All the matrix elements |Vpp21,p (37a) |2 on the\nresonant sub-manifold (37a), are shown in Fig. 2. All the matrix elements are equivalent. The\nrelative differences between different approaches are given by numerical noise (not shown).\n23\n\n\fFinally, |Vpp21,p (37b) |2 on the resonant sub-manifold (37b) are shown in Fig. 3. Again, all the\nmatrix elements are equivalent.\nThe solutions (38a) and (38b) give the same matrix elements but with |k1 | and |k2 | exchanged as the solutions (37a) and (37b) owing to their symmetries.\n\n3) S PECIAL\n\nTRIADS\n\nThree simple interaction mechanisms are identified by McComas and Bretherton (1977) in\nthe limit of an extreme scale separation. In this subsection we look in closer detail at these\nspecial limiting triads to confirm that all matrix elements are indeed asymptotically consistent.\nThe limiting cases are:\n\n• the vertical backscattering of a high-frequency wave by a low frequency wave of twice\nthe vertical wavenumber into a second high-frequency wave of oppositely signed vertical\nwavenumber and nearly the same wavenumber magnitude. This type of scattering is\ncalled elastic scattering (ES). The solution (36a) in the limit |k1 | → 0 corresponds to this\ntype of special triad.\n• The scattering of a high-frequency wave by a low-frequency, small-wavenumber wave\ninto a second, nearly identical, high-frequency large-wavenumber wave. This type of\nscattering is called induced diffusion (ID). The solution (36b) in the limit that |k1 | → 0\ncorresponds to this type of special triad.\n• The decay of a low wavenumber wave into two high vertical wavenumber waves of approximately one-half the frequency. This is called parametric subharmonic instability\n(PSI). The solution (37a) in the limit that |k1 | → 0 corresponds to this type of triad.\n24\n\n\fTo study the detailed behavior of the matrix elements in the special triad cases, we choose\nto present the matrix elements along a straight line defined by\n\n(|k1 |, |k2 |) = (ǫ, ǫ/3 + 1)|k|.\n\nThis line is defined in such a way so that it originates from the corner of the kinematic box in\nFigs. 1–3 at (|k1 |, |k2 |) = (0, |k|) and has a slope of 1/3. The slope of this line is arbitrary. We\ncould have taken ǫ/4 or ǫ/2. The matrix elements here are shown as functions of ǫ in Fig. 4.\nWe see that all four approaches are again equivalent on the resonant manifold for the case of\nspecial triads.\nIn this section we demonstrated that all four approaches we considered produce equivalent results on the resonant manifold in the absence of background rotation. This statement is\nnot trivial, given the different assumptions and coordinate systems that have been used for the\nvarious kinetic equation derivations.\n\n4. Resonant wave-wave interactions - in the presence of Background Rotations\nIn the presence of background rotation, the matrix elements loose their scale invariance due\nto the introduction of an additional time scale (1/f ) in the system. Consequently the comparison\nof matrix elements is performed as a function of four independent parameters.\nWe perform this comparison in the frequency-vertical wavenumber domain. In particular,\nfor arbitrary ω, ω1 , m and m1 , ω2 and m2 can be calculated by requiring that they satisfy\n\n25\n\n\fthe resonant conditions ω = ω1 + ω2 and m = m1 + m2 . We then can check whether the\ncorresponding horizontal wavenumber magnitudes k, given by\n\nki\nki\n\nq\nmi Nρo\n=\nωi2 − f 2 (isopycnal coordinates) and\ng\np\nωi2 − f 2\n= mi\n(Lagrangian coordinates)\nN\n\n(39)\n\nsatisfy the triangle inequality. The matrix elements of the isopycnal and Lagrangian coordinate\nrepresentations are then calculated. We are performed this comparison for 1012 points on the\nresonant manifold. After being multiplied by an appropriate dimensional number to convert\nbetween Eulerian and isopycnal coordinate systems, the two matrix elements coincide up to\nmachine precision.\nOne might, with sufficient experience, regard this as an intuitive statement. It is, however, far from trivial given the different assumptions and coordinate representations. In particular, we note that derivations of the wave amplitude evolution equation in Lagrangian coordinates (Olbers 1976; McComas 1975; Meiss et al. 1979) do not explicitly contain a potential\nvorticity conservation statement corresponding to assumption (4) in the isopycnal coordinate\n(Lvov and Tabak 2004) derivation. We have inferred that the Lagrangian coordinate derivation\nconserves potential vorticity as that system is projected upon the linear modes of the system\nhaving zero perturbation potential vorticity.\n\n26\n\n\f5. Resonance Broadening and Numerical Methods\na. Nonlinear frequency renormalization as a result of nonlinear wave-wave interactions\n\nThe resonant interaction approximation is a self-consistent mathematical simplification which\nreduces the complexity of the problem for weakly nonlinear systems. As nonlinearity increases, near-resonant interactions become more and more pronounced and need to be addressed. Moreover, near-resonant interactions play a major role in numerical simulations on\na discrete grids (Lvov et al. 2006), for time evolution of discrete systems (Gershgorin et al.\n2007), in acoustic turbulence (Lvov et al. 1997), surface gravity waves (Janssen 2003; Yuen and Lake\n1982), and internal waves (Voronovich et al. 2006; Annenkov and Shrira 2006).\nTo take into account the effects of near-resonant interactions self-consistently, we revisit\nSection b. Now we do not take the limit Γpp1 p2 → 0. Then, instead of the kinetic equation\nwith the frequency conserving delta-function, we obtain the generalized kinetic equation\n\ndnp\n=4\ndt\n\nZ\n\n|Vpp1 ,p2 |2 fp12 δp−p1 −p2 L(ωp − ωp1 − ωp2 )dp12\n\nZ\n\n−4\n|Vpp21,p |2 f12p δp1 −p2 −p L(ωp1 − ωp2 − ωp ) dp12\nZ\np2 2\n−4\n|Vp,p\n| f2p1 δp2 −p−p1 L(ωp2 − ωp − ωp1 ) dp12 ,\n1\nwith fp12 = np1 np2 − np (np1 + np2 ) ,\n(40)\n\nwith L is defined as\nL(∆ω) =\n\nΓk12\n.\n(∆ω)2 + Γ2k12\n\n(41)\n\nHere, as in section (b) Γk12 is the total broadening of each particular resonance, and is given\n27\n\n\fbelow.\nThe difference between kinetic equation (32) and the generalized kinetic equation (40) is\nthat the energy conserving delta-functions in Eq. (32), δ(ωp − ωp1 − ωp2 ), was \"broadened\".\nThe physical motivation for this broadening is the following: when the resonant kinetic equation is derived, it is assumed that the amplitude of each plane wave is constant in time, or, in\nother words, that the lifetime of single plane wave is infinite. The resulting kinetic equation,\nnevertheless, predicts that wave amplitude changes. Consequently the wave lifetime is finite.\nFor small level of nonlinearity this distinction is not significant, and resonant kinetic equation\nconstitutes a self-consistent description. For larger values of nonliterary this is no longer the\ncase, and the wave lifetime is finite and amplitude changes need to be taken into account. Consequently interactions may not be strictly resonant. This statement also follows from the Fourier\nuncertainty principle. Waves with varying amplitude can not be represented by a single Fourier\ncomponent. This effect is larger for larger normalized Boltzmann rates.\nIf the nonlinear frequency renormalization tends to zero, i.e. Γk12 → 0, L reduces to the\ndelta function (compare to (31):\n\nlim L(∆ω) = πδ(∆ω).\n\nΓk12 →0\n\nConsequently, in the limit resonant interactions (i.e. no broadening) (40) reduces to (32) .\nIf, on the other hand, one does not take the Γpp1 p2 → 0 limit, then one has to calculate\nΓpp1 p2 self-consistently. To achieve this we realize that by deriving the generalized kinetic\nequation (40) we allow changes in wave amplitude. The rate of change can be identified from\nequation (40) in the following way. Let us go through (40) term by term, and identify all\nterm that multiply the np on the right-hand-side. Those terms can be loosely interpreted as a\n28\n\n\fnonlinear wave damping acting on the given wavenumber:\n\nγp = 4\n\nZ\n\n|Vpp1 ,p2 |2 (np1 + np2 ) δp−p1 −p2 L(ωp − ωp1 − ωp2 )dp12\n\nZ\n\n−4 |Vpp21,p |2 (np2 − np1 ) δp1 −p2 −p L(ωp1 − ωp2 − ωp ) dp12\nZ\np2 2\n−4 |Vp,p\n| (np1 − np2 ) δp2 −p−p1 L(ωp2 − ωp − ωp1 ) dp12 .\n1\n(42)\n\nThe interpretation of this formula is the following: nonlinear wave-wave interactions lead to the\nchange of wave amplitude, which in turn makes the lifetime of the waves to be finite. This, in\nturn, makes the interactions to be near-resonant.\nThe next question is how to relate the individual wave damping γp with the overall broadening of the resonances of three interacting waves. As we have rigorously shown in (Lvov et al.\n(1997)) the errors add up, so that\n\nΓk12 = γp + γp1 + γp2 .\n\n(43)\n\nIt means that the total resonance broadening is the sum of individual frequency broadening, and\ncan be thus seen as the \"triad interaction\" frequency.\nA rigorous derivation of the kinetic equation with a broadened delta function is given in\ndetails for a general three-wave Hamiltonian system in (Lvov et al. 1997). The derivation is\nbased upon the Wyld diagrammatic technique for non-equilibrium wave systems and utilizes\nthe Dyson-Wyld line resummation. This resummation permits an analytical resummation of the\ninfinite series of reducible diagrams for Greens functions and double correlators. Consequently,\nthe resulting kinetic equation is not limited to the Direct Interaction Approximation (DIA), but\n29\n\n\falso includes higher order effects coming from infinite diagrammatic series. We emphasize,\nhowever, that the approach is perturbative in nature and there are neglected parts of the infinite\ndiagrammatic series. The reader is referred to Lvov et al. (1997) for details of that derivation.\nThe resulting formulas are given by (40)-(43).\nA self-consistent estimate of γp requires an iterative solution of (40) and (42) over the entire\nfield: the width of the resonance (42) depends on the lifetime of an individual wave [from (40)],\nwhich in turn depends on the width of the resonance (43). This numerically intensive computation is beyond the scope of this manuscript. Instead, we make the uncontrolled approximation\nthat:\nγp = δωp .\n\n(44)\n\nWe note that this choice is made for illustration purposes only, we certainly do not claim\nthat it represents a self consistent choice. Below, we will take δ to be 10−3 and 10−2 and 10−1 .\nThese values are rather small, therefore we remain in the closest proximity to the resonant\ninteractions. To show the effect of strong resonant manifold smearing we also investigate the\ncase with δ = 0.5.\nWe note in passing that the near-resonant interactions of the waves were also considered\nin the (Janssen 2003). There, instead of our L(x) function, given by (41), the corresponding\nfunction was given by sin(πx)/x. We have shown in Kramer et al. (2003) that the resulting\nkinetic equation does not retain positive definite values of wave action. To get around that\ndifficulty, self-consistent formula for broadening or rigorous diagrammatic resummation should\nbe used.\n\n30\n\n\fb. Numerical Methods\n\nEstimates of near-resonant transfers are obtained by assuming horizontal isotropy and integrating (40) over horizontal azimuth:\n\nk1 k2 p 2\n|V\n| fp12 δp−p1 −p2 L(ωp − ωp1 − ωp2 )dk12 dm1\nSp12 p1 ,p2\nZ\nk1 k2 p1 2\n−4π\n|V | f12p δp1 −p2 −p L(ωp1 − ωp2 − ωp ) dk12 dm1\nS12p p2 ,p\nZ\nk1 k2 p2 2\n−4π\n|V | f2p1 δp2 −p−p1 L(ωp2 − ωp − ωp1 ) dk12 dm1 ,\nS2p1 p,p1\n\n∂np\n= 4π\n∂t\n\nZ\n\n(45)\n\nwhere Sp12 is the area of the triangle k = k1 + k2 . We numerically integrated (45) for p's which\nhave frequencies from f to N and vertical wavenumbers from 2π/(2b) to 260π/(2b). The limits\nof integration are restricted by horizontal wavenumbers from 2π/105 to 2π/5 meters−1 , vertical\nwavenumbers from 2π/(2b) to 2π/5 meters−1 , and frequencies from f to N. The integrals over\nk1 and k2 are obtained in the kinematic box in k1 − k2 space. The grids in the k1 − k2 domain\nhave 217 points that are distributed heavily around the corner of the kinematic box. The integral\nover m1 is obtained with 213 grid points, which are also distributed heavily for the small vertical\nwavenumbers whose absolute values are less than 5m, where m is the vertical wavenumber.\nTo estimate the normalized Boltzmann rate we need to choose a form of spectral energy\ndensity of internal waves. We utilize the Garrett and Munk spectrum as an agreed-upon representation of the internal waves:\n\nE(ω, m) =\n\n4f\n1\n1\np\nE\n.\n0\nm\nπ 2 m∗ 1 + ( m∗ )2 ω ω 2 − f 2\n\n31\n\n(46)\n\n\fHere the reference wavenumber is given by\n\nm∗ = πj∗ /b,\n\n(47)\n\nin which the variable j represents the vertical mode number of an ocean with an exponential\nbuoyancy frequency profile having a scale height of b.\nWe choose the following set of parameters:\n• b = 1300 m in the GM model\n• The total energy is set as:\nE0 = 30 × 10−4 m2 s−2 .\n• Inertial frequency is given by f = 10−4 rad/s, and buoyancy frequency is given by N0 =\n5 × 10−3 rad/s.\n• The reference density is taken to be ρ0 = 103 kg/m3.\n• A roll-off corresponding to j∗ = 3.\nWe then calculate the normalized Boltzmann rate (34) using four values of δ in (44): δ =\n10−3 , δ = 10−2 , δ = 10−1 and δ = 0.5.\n\n6. Time Scales\na. Resonant Interactions\n\nHere we present evaluations of the Lvov and Tabak (2004) kinetic equation. These estimates\ndiffer from evaluations presented in Olbers (1976); McComas (1977); McComas and Müller\n32\n\n\f(1981a); Pomphrey et al. (1980) in that the numerical algorithm includes a finite breadth to the\nresonance surface whereas previous evaluations have been exactly resonant. Results discussed\nin this section are as close to resonant as we can make (δ = 1 × 10−3 ).\nWe see that for small vertical wavenumbers the normalized Boltzmann rate is of the order of\ntenth of the wave period. This can be argued to be relatively within the domain of weak nonlinearity. However for increased wavenumbers the level of nonlinearity increases and reaches the\nlevel of wave-period (red, or dark blue). There is also a white region indicating values smaller\nthan minus one.\nWe also define a \"zero curve\" - It is the locus of wavenumber-frequency where the normalized Boltzmann rate and time-derivative of waveaction is exactly zero. The zero curve clearly\ndelineates a pattern of energy gain for frequencies f < ω < 2f , energy loss for frequencies\n2f < ω < 5f and energy gain for frequencies 5f < ω < N. We interpret the relatively sharp\nboundary between energy gain and energy loss across ω = 2f as being related to the Parameteric Subharmonic Instability and the transition from energy loss to energy gain at ω = 5f as\na transition from energy loss associated with the Parametric Subharmonic Instability to energy\ngain associated with the Elastic Scattering mechanism. See Section 7 for further details about\nthis high frequency interpretation.\nThe O(1) normalized Boltzmann rates at high vertical wavenumber are surprising given the\nsubstantial literature that regards the GM spectrum as a stationary state. We do not believe this\nto be an artifact of the numerical scheme for the following reasons. First, numerical evaluations of the integrand conserve energy to within numerical precision as the resonance surface is\napproached, consistent with energy conservation property associated with the frequency delta\nfunction. Second, the time scales converge as the resonant width is reduced, as demonstrated\n\n33\n\n\fby the minimal difference in time scales using δ = 1 × 10−3 and 1 × 10−2 . Third, our results\nare consistent with approximate analytic expressions (e.g. McComas and Müller (1981b)) for\nthe Boltzmann rate. Finally, in view of the differences in the representation of the wavefield,\nnumerical codes and display of results, we interpret our resonant (δ = 0.001) results as being consistent with numerical evaluations of the resonant kinetic equations presented in Olbers\n(1976); McComas (1977); McComas and Müller (1981a); Pomphrey et al. (1980).\nAs a quantitative example, consider estimates of the time rate of change of low-mode energy\nappearing in Table 1 of Pomphrey et al. (1980), repeated as row 3 of our Table 8 2 . We find\nagreement to better than a factor of two. In order to explain the remaining differences, you\nhave to examine the details: Pomphrey et al. (1980) use a Coriolis frequency corresponding to\n30◦ latitude, neglect internal waves having horizontal wavelengths greater than 100 km (same\nas here) and exclude frequencies ω > No /3, with No = 3 cph. We include frequencies f <\nω < No with Coriolis frequency corresponding to 45◦ latitude. Of possible significance is that\nPomphrey et al. (1980) use a vertical mode decomposition with exponential stratification with\nscale height b = 1200 m (we use b = 1300 m). Table 8 presents estimates of the energy transfer\nrate by taking the depth integrated transfer rates of Pomphrey et al. (1980), assuming Ė ∝ N 2\nand normalizing to N = 3 cph. While this accounts for the nominal buoyancy scaling of the\nenergy transport rate, it does not account for variations in the distribution of Ė(m) associated\nwith variations in N via m∗ =\n\nN\nj /b\nNo ∗\n\nin their model. Finally, their estimates of Ė(m) are\n\narrived at by integrating only over regions of the spectral domain for which Ė(m, ω) is negative.\n2\n\nA potential interpretation is that this net energy flow out of the non-equilibrium part of the spectrum represents\nthe energy requirements to maintain the spectrum.\n\n34\n\n\fb. Near-Resonant Interactions\n\nSubstantial motivation for this work is the question of whether the GM76 spectrum represents a stationary state. We have seen that numerical evaluations of a resonant kinetic equation\nreturn O(1) normalized Boltzmann rates and hence we are lead to conclude that GM76 is not a\nstationary state with respect to resonant interactions. But the inclusion of near-resonant interactions could alter this judgement.\nOur investigation of this question is currently limited by the absence of an iterative solution to (40) and (42) and consequent choice to parameterize the resonance broadening in terms\nof (44). However, as we go from nearly resonant evaluations (10−3 and 10−2) to incorporating significant broadening (10−1 and 0.5), we find a significant decreases in the normalized\nBoltzmann rate. The largest decreases are associated with an expanded region of energy loss\nassociated the Parametric Subharmonic Instability, in which minimum normalized Boltzmann\nrates change from -3.38 to -0.45 at (ω, mb/2π) = (2.5f, 150). Large decreases here are not surprising given the sharp boundary between regions of loss and gain in the resonant calculations.\nSmaller changes are noted within the Induced Diffusion regime. Maximum normalized Boltzmann rates change from 2.6 to 1.5 at (ω, mb/2π) = (8f, 260). Broadening of the resonances to\nexceed the boundaries of the spectral domain could be making a contribution to such changes.\nWe regard our calculations here as a preliminary step to answering the question of whether\nthe GM76 spectrum represents a stationary state with respect to nonlinear interactions. Complementary studies could include comparison with analyses of numerical solutions of the equations\nof motion.\n\n35\n\n\f7. Discussion\na. Resonant Interactions\n\nSeveral loose ends need to be tied up regarding the assertion that the GM76 spectrum does\nnot constitute a stationary state with respect to resonant interactions. The first is the interpretation of McComas and Müller (1981a)'s inertial-range theory with constant downscale transfer of energy. This constant downscale transfer of energy was obtained by patching together\nthe induced diffusion and parametric subharmonic instability mechanisms and is attended by\nthe following caveats: First, the inertial subrange solution is found only after integrating over\nthe frequency domain and numerical evaluations of the kinetic equation demonstrate that the\n\"inertial subrange\" solution also requires dissipation to balance energy gain at high vertical\nwavenumber. It takes a good deal of patience to wade through their figures to understand how\nfigures in McComas and Müller (1981a) plots relate to the initial tendency estimates in Figure\n5. Second, Pomphrey et al. (1980) argue that GM76 is an near-equilibrium state because of a 13 order of magnitude cancellation between the Langevin rates in the induced diffusion regime.\nBut this is just the ω 2 /f 2 difference between the fast and slow induced diffusion time scales.\nIt does NOT imply small values of the slow induced diffusion time scale, which are equivalent\nto the normalized Boltzmann rates. Third, the large normalized Boltzmann rates determined\nby our numerical procedure are associated with the elastic scattering mechanism rather than\ninduced diffusion. Normalized Boltzmann rates for the induced diffusion and elastic scattering\n\n36\n\n\fmechanisms are:\n\nǫid\n\n=\n\nπ2 m\nm2\n20 mc m2 +m2 ω 2\n∗ 2\nf\n\nǫes =\n\nm2\nπ2 m\n20 mc m2 +0.25m2∗\n\nin which m∗ represents the low wavenumber roll-off of the vertical wavenumber spectrum (vertical mode-3 equivalent here), mc is the high wavenumber cutoff, nominally at 10 m wavelengths and the GM76 spectrum has been assumed. The normalized Boltzmann rates for ES and\nID are virtually identical at high wavenumber. They differ only in how their respective triads\nconnect to the ω = f boundary. Induced diffusion connects along a curve whose resonance condition is approximately that the high frequency group velocity match the near-inertial vertical\nphase speed, ω/m = f /mni . Elastic scattering connects along a simpler m = 2mni . Evaluations of the kinetic equation reveal nearly vertical contours throughout the vertical wavenumber\ndomain, consistent with ES, rather than sloped along contours of ω ∝ m emanating from\nm = m∗ as expected with the ID mechanism.\nThe identification of the ES mechanism as being responsible for the large normalized Boltzmann rates at high vertical wavenumber requires further explanation. The role assigned to the\nES mechanism by McComas and Bretherton (1977) is the equilibration of a vertically anisotropic\nfield. This can be seen by taking the near-inertial component of a triad to represent p1 , assuming that the action density of the near-inertial field is much larger than the high frequency fields,\nand taking the limit (k, l, m) = (k2 , l2 , −m2 ) ≡ p− . Thus:\nfp12 = np1 np2 − np (np1 + np2 ) ∼\n= np1 [np− − np ]\n\n37\n\n\fand transfers proceed until the field is isotropic: np− = np . But this is not the complete\nstory. A more precise characterization of the resonance surface takes into account the frequency\nresonance requiring ω − ω2 = ω1 ∼\n= f requires O(ω/f ) differences in m and −m2 if k = k2\nand O(ω/f ) differences in k and k2 if m = −m2 . For an isotropic field:\nfp12 = np1 np2 − np (np1 + np2 ) ∼\n= np1 [np+δp − np ] ∼\n= np1 [δp * ∇np ]\n\nand due care needs to be taken that p1 is on the resonance surface in the vicinity of the inertial\ncusp.\n\nb. Near-Resonant Interactions\n\nThe idea of trying to self consistently find the smearing of the delta-functions is not new.\nFor internal waves it appears in DeWitt and Wright (1982); Carnevale and Frederiksen (1983);\nDeWitt and Wright (1984).\nDeWitt and Wright (1982) set up a general framework for a self consistent calculation similar in spirit to Lvov et al. (1997), using a path-integral formulation of the diagrammatic technique. The paper makes an uncontrolled approximation that their nonlinear frequency renormalization Σ(p, ω) is independent of ω, and shows that this assumption is not self-consistent.\nLvov et al. (1997) present a more sophisticated approach to a self-consistent approximation to\nthe operator Σ(p, ω). In particular, DeWitt and Wright (1982) suggests\n\nΣ(p, ω) = Σ(p, ωp ),\n\n38\n\n\fwhile Lvov et al. (1997) propose a more self-consistent\n\nΣ(p, ω) = Σ[p, ωp + iIΣ(p, Ωp )].\n\nDeWitt and Wright (1984) evaluate the self-consistency of the resonant interaction approximation and find that for high-frequency-high-wavenumbers, the resonant interaction representation is not self-consistent. A possible critique of these papers is that they use resonant matrix\nelements given by Müller and Olbers (1975) with out appreciating that those elements can only\nbe used strictly on the resonant manifold.\nCarnevale and Frederiksen (1983) present similar expressions for two-dimensional stratified\ninternal waves. There the kinetic equation is (7.4) with the triple correlation time given by Θ\n(our L) of their (8.7). The key step is to find the level of smearing of the delta-function, denoted\nas μk in their (8.7) (our γ). This can be achieved by their (8.6), which is similar to our (42). The\nonly difference is that (8.6) hFas slightly different positions of the poles i(γp1 + γp2 ), instead\nof ours i(γp1 + γp2 + γp ). Carnavale points out that the Direct Interaction Approximation\nleads to his expression, not the sum of all three γ's. We respectfully disagree. However, this\nis irrelevant for the purpose of this paper, since we do not solve it self consistently anyway,\nbut propose an uncontrolled approximation (44). The main advantage of our approach over\nCarnevale and Frederiksen (1983) is that we use systematic Hamiltonian structures which are\nequivalent to the primitive equations of motion, rather than a simplified two-dimensional model.\n\n39\n\n\f8. Conclusion\nOur fundamental result is that the GM spectrum is not stationary with respect to the resonant\ninteraction approximation. This result is contrary to much of the perceived wisdom and gave\nus cause to review published results concerning resonant internal wave interactions. We then\nincluded near-resonant interactions and found significant reductions in the temporal evolution\nof the GM spectrum.\nWe compared the interaction matrices for three different Hamiltonian formulations and one\nnon-Hamiltonian formulation in the resonant limit. Two of the Hamiltonian formulations are\ncanonical and one (Lvov and Tabak 2004) avoids a linearization of the Hamiltonian prior to\nassuming an expansion in terms of weak nonlinearity. Formulations in Eulerian, isopycnal and\nLagrangian coordinate systems were considered. All four representations lead to equivalent\nresults on the resonant manifold in the absence of background rotation. The two representations\nthat include background rotation, a canonical Hamiltonian formulation in isopycnal coordinates\nand a non-canonical Hamiltonian formulation in Lagrangian coordinates, also lead to equivalent\nresults on the resonant manifold. This statement is not trivial given the different assumptions\nand coordinate systems that have been used for the derivation of the various kinetic equations.\nIt points to an internal consistency on the resonant manifold that we still do not completely\nunderstand and appreciate.\nWe rationalize the consistent results as being associated with potential vorticity conservation. In the isopycnal coordinate canonical Hamilton formulation potential vorticity conservation is explicit. In the Lagrangian coordinate non-canonical Hamiltonian, potential vorticity\nconservation results from a projection onto the linear modes of the system. The two non-rotating\nformulations prohibit relative vorticity variations by casting the velocity as a the gradient of a\n40\n\n\fscalar streamfunction.\nWe infer that the non-stationary results for the GM spectrum are related to a higher order\napproximation of the elastic scattering mechanism than considered in McComas and Bretherton\n(1977) and McComas and Müller (1981b).\nOur numerical results indicate evolution rates of a wave period at high vertical wavenumber,\nsignifying a system which is not weakly nonlinear. To understand whether such non-weak\nconditions could give rise to competing effects that render the system stationary, we considered\nresonance broadening. We used a kinetic equation with broadened frequency delta function\nderived for a generalized three-wave Hamiltonian system in (Lvov et al. 1997). The derivation\nis based upon the Wyld diagrammatic technique for non-equilibrium wave systems and utilizes\nthe Dyson-Wyld line resummation. This broadened kinetic equation is perceived to be more\nsophisticated than the two-dimensional direct interaction approximation representation pursued\nin Carnevale and Frederiksen (1983) and the self-consistent calculations of DeWitt and Wright\n(1984) which utilized the resonant interaction matrix of Olbers (1976). We find a tendency of\nresonance broadening to lead to more stationary conditions. However, our results are limited by\nan uncontrolled approximation concerning the width of the resonance surface.\nReductions in the temporal evolution of the internal wave spectrum at high vertical wavenumber were greatest for those frequencies associated with the PSI mechanism, i.e. f < ω < 5f .\nSmaller reductions were noted at high frequencies.\nA common theme in the development of a kinetic equation is a perturbation expansion\npermitting the wave interactions and evolution of the spectrum on a slow time scale, e.g. Section\nb. An assumption of Gaussian statistics at zeroth order permits a solution of the first order triple\ncorrelations in terms of the zeroth order quadruple correlations. Assessing the adequacy of this\n\n41\n\n\fassumption for the zeroth order high frequency wavefield is a challenge for future efforts. Such\ndepartures from Guassianity could have implications for the stationarity at high frequencies.\nNontrivial aspects of our work are that we utilize the canonical Hamiltonian representation\nof Lvov and Tabak (2004) which results in a kinetic equation without first linearizing to obtain\ninteraction coefficients defined only on the resonance surface and that the broadened closure\nscheme of Lvov et al. (1997) is more sophisticated than the Direct Interaction Approximation.\nInclusion of interactions between internal waves and modes of motion associated with zero\neigen frequency, i.e. the vortical motion field, is a challenge for future efforts.\nWe found no coordinate dependent (i.e. Eulerian, isopycnal or Lagrangian) differences\nbetween interaction matrices on the resonant surface. We regard it as intuitive that there will be\ncoordinate dependent differences off the resonant surface. It is a robust observational fact that\nEulerian frequency spectra at high vertical wavenumber are contaminated by vertical Doppler\nshifting: near-inertial frequency energy is Doppler shifted to higher frequency at approximately\nthe same vertical wavelength. Use of an isopycnal coordinate system considerably reduces this\nartifact (Sherman and Pinkel 1991). Further differences are anticipated in a fully Lagrangian\ncoordinate system (Pinkel 2008). Thus differences in the approaches may represent physical\neffects and what is a stationary state in one coordinate system may not be a stationary state in\nanother. Obtaining canonical coordinates in an Eulerian coordinate system with rotation and in\nthe Lagrangian coordinate system are challenges for future efforts.\n\n42\n\n\f1) *\n\nAcknowledgments.\nWe thank V. E. Zakharov for presenting us with a book (Miropolsky 1981) and for encouragement. We also thank E. N. Pelinovsky for providing us with Pelinovsky and Raevsky (1977).\nWe greatfully acknowledge funding provided by a Collaborations in Mathematical Geosciences\n(CMG) grant from the National Science Foundation. YL is also supported by NSF DMS grant\n0807871 and ONR Award N00014-09-1-0515. We are grateful to YITP in Kyoto University for\npermitting use of their facility.\n\n43\n\n\fMatrix Elements\nOur attention is restricted to the hydrostatic balance case, for which\n\n| k |≪| m | .\n\n(48)\n\nA minor detail is that the linear frequency has different algebraic representations in isopycnal\nand Cartesian coordinates. The Cartesian vertical wavenumber, kz , and the density wavenumber, m, are related as m = −g/(ρ0 N 2 )kz where g is gravity, ρ is density with reference value\nρ0 , N is the buoyancy (Brunt–Väisälä) frequency and f is the Coriolis frequency. In isopycnal\ncoordinates the dispersion relation is given by,\n\nω(p) =\n\ns\n\nf2 +\n\ng 2 | k |2\n.\nρ20 N 2 m2\n\n(49)\n\nIn Cartesian coordinates,\n\nω(p) =\n\ns\n\nf2 + N2\n\n| k |2\n.\nkz2\n\n(50)\n\nIn the limit of f = 0 these dispersion relations assume the form\n\nωp ∝\n\n|k|\n|k|\n∝\n|m|\n| kz |\n\n44\n\n(51)\n\n\fMüller and Olbers\nMatrix elements derived in Olbers (1974) are given by | Vpp1 ,p2 MO |2 = T + /(4π) and |\nVpp21,p MO |2 = T − /(4π). We extracted T ± from the Appendix of Müller and Olbers (1975). In\nour notation, in the hydrostatic balance approximation, their matrix elements are given by\n\n(N02 − f 2 )2\n|k||k1 ||k2 |\nωω1 ω2\n32ρ0\nωω1ω2 |p||p1 ||p2 |\n\u0011\u0010\n\u0011\n \u0010\n⊥\nk1 *k2 −if k2 *k1 /ω1\nk1 *k2 −if k1 *k⊥\n2 /ω2\n−m1\n+ m2 −m2\n+ m1\nk12\nk22\n−\nm\n\u0011\n\u0010\n\u0011\u0010\nk2 *k−if k*k⊥\nk2 *k+if k2 *k⊥ /ω2\n2 /ω\n+ m2\n−m2\n+ m −m\nk2\nk22\n−\nm1\n\u0011\u0010\n\u0011 2\n\u0010\n⊥\n⊥\nk*k −if k*k /ω\n−m 1 k2 1 + m1 −m1 k*k1 +ifkk21 *k /ω1 + m\n1\n .\n−\nm2\n|Vpp1 ,p2 MO |2 =\n\n(52)\n\nTaking a f = 0 limit reduces the problem to scale invariant problem. We get the following\nsimplified expression:\n\n\u0012\n\u0013\u0012\n\u0013\n1\nm2 k1 * k2\nm1 k2 * k1\n−\n−\n+ m1\n−\n+ m2\nm\n|k2 |2\n|k1 |2\n\u0012\n\u0012\n\u0013\u0012\n\u0013\n\u0013\u0012\n\u0013\u00132\n1 m2 k * k2\nmk1 * k\nmk2 * k\n1\nm1 k * k1\n+\n−\n−m\n−\n+ m2 +\n+ m1\n−m\n(53)\nm1\n|k2 |2\n|k|2\nm2\n|k|2\n|k1 |2\n|Vpp1 ,p2 MO |2\n\n|k||k1 ||k2 |\n∝\n|mm1 m2 |\n\n\u0012\n\nThis simplified expression is going to be used for comparison of approaches in section (3).\n\n45\n\n\fVoronovich\n\nWe formulate the matrix elements for Voronovich's Hamiltonian using his formula (A.1).\nThis formula is derived for general boundary conditions. To compare with other matrix elements of this paper, we assume a constant stratification profile and Fourier basis as the vertical\nstructure function φ(z). That allows us to solve for the matrix elements defined via Eq. (11)\nand above it in his paper. Then the convolutions of the basis functions give delta-functions in\nvertical wavenumbers. Vornovich's equation (A.1) transforms into:\n\n|Vpp1 ,p2 V |2\n\n\u0012\n\u0012\n\u0012\n\u0013\n\u0013\n|k||k1 ||k2 |\n1\nk * k1 |m1 | k * k2 |m2 |\nω1 + ω2 − ω\n∝\n−m\n+\n+\n|mm1 m2 |\n|k||m|\n|k1 |\n|k2 |\nω\n\u0012\n\u0013\n\u0013\n\u0012\nω1 + ω2 − ω\nk * k1 |m| k1 * k2 |m2 |\n1\n−\n+m1\n+\n|k1 ||m1 |\n|k|\n|k2 |\nω1\n\u0012\n\u0013\n\u0013\u00132\n\u0012\nω1 + ω2 − ω\nk * k2 |m| k2 * k1 |m1 |\n1\n−\n+\n.\n+m2\n|k2 ||m2 |\n|k|\n|k1 |\nω2\n(54)\n\nNote that Eq. (54) shares structural similarities with the interaction matrix elements in isopycnal coordinates, Eq. (57) below.\n\nCaillol and Zeitlin\n\nA non-Hamiltonian kinetic equation for internal waves was derived in Caillol and Zeitlin\n(2000), Eq. (61) directly from the dynamical equations of motion, without the use of the Hamiltonian structure.\nTo make it appear equivalent to more traditional form of kinetic equation, as in Zakharov et al.\n(1992), we make a change of variables l → −l in the second line, and k → −k in the third\n\n46\n\n\fline of (61) of Caillol and Zeitlin (2000). If we further assume that all spectra are symmetric, n(−p) = n(p), then the kinetic equation assumes traditional form, as in Eq. (32), see\nMüller and Olbers (1975); Zakharov et al. (1992); Lvov and Tabak (2001, 2004).\n±\nThe matrix elements according to Caillol and Zeitlin (2000) are shown as Xk,l,p and Yk,l,p\nin\n\nEqs. (62) and (63), where |Vpp1 ,p2 CZ |2 = Xp1 ,p2 ,p and |Vpp21,p CZ |2 = Yp+1 ,−p2 ,p . In our notation it\nreads\n\n(m2 − m1 m2 )2\n|Vpp1 ,p2 CZ |2 ∝ (|k|sgn(m) + |k1 |sgn(m1 ) + |k2 |sgn(m2 ))2\n|m||m1 ||m2 ||k||k1||k2 |\n\u00132\n\u0012 2\n|k1 |2 |k2 |2\n|k| − |k1 |sgn(m1 )|k2 |sgn(m2 )\nm−\n−\n×\nm2 − m1 m2\nm1\nm2\n.\n\n(55)\n\nThis expression is going to be used for comparison of approaches in section (3).\n\nIsopycnal Hamiltonian\n\nFinally, in Lvov and Tabak (2004) the following wave-wave interaction matrix element was\nderived based on a canonical Hamiltonian formulation in isopycnal coordinates:\n\nN2\n=\n32g\n\n\u0012\u0012\n\nkk1 * k2\nk1 k2\n\nr\n\nω1 ω2 k1 k2 * k\n+\nω\nk2 k\n\nr\n\nω2 ω k2 k * k1\n+\nω1\nkk1\n\nr\n\nωω1\nω2\n\u00132\n2\n2\n2\n2\nf\nk1 k2 * k − k2 k * k1 − k k1 * k2\n+√\nωω1 ω2\nkk1 k2\n\u0012r\n\u0013\u00132 !\n\u0012\nr\nr\nω\nω\nω\nk1 * k⊥\n1\n2\n2\n(k 2 − k22 ) −\n(k 2 − k 2 ) −\n(k 2 − k12 )\n.\n+ f\nkk1 k2\nω1 ω2 1\nω2 ω 2\nωω1\n0 H 2\n|V1,2\n|\n\n(56)\n\n47\n\n\fLvov and Tabak (2001) is a rotationless limit of Lvov and Tabak (2004). Taking the f → 0\nlimit, the Lvov and Tabak (2004) reduces to Lvov and Tabak (2001), and (56) reduces to\n\n1\n|Vpp1 ,p2 H |2 ∝\n|k||k1 ||k2 |\n\n|k|k1 * k2\n\ns\n\ns\ns\n!2\nm\nm1\nm2\n.\n+ |k1 |k2 * k\n+ |k2 |k * k1\nm1 m2\nm2 m\nmm1\n(57)\n\nObserve that in this form, these equations share structural similarities with Eq. (54).\n\n48\n\n\fReferences\nAnnenkov, S. and V. I. Shrira, 2006: Role of non-resonant interactions in the evolution of\nnonlinear random water wave fields. J. Fluid Mech., 561, 181–207.\nBrehovski, 1975: On interactions of internal and surface waves in the ocean. Oceanology, 15.\nCaillol, P. and V. Zeitlin, 2000: Kinetic equations and stationary energy spectra of weakly\nnonlinear internal gravity waves. Dynamics of Atmospheres and Oceans, 32, 81–112.\nCarnevale, G. F. and J. S. Frederiksen, 1983: A statistical dynamical theory of strongly nonlinear internal gravity waves. Geophys Astrophys Fluid Dyn., 23, 175–207.\nClebsch, A., 1959: Unk. J. Reine Angew. Math., 56, 1.\nDeWitt, R. J. and J. Wright, 1982: Self-consistent effective medium theory of random internal\nwaves. J. Fluid Mech., 115, 283–.\n---, 1984: Self-consistent effective medium parameters for oceanic internal waves. J. Fluid\nMech., 146, 252–.\nGershgorin, B., Y. V. Lvov, and D. Cai, 2007: Interactions of renormalized waves in thermalized\nfermi-pasta-ulam chains. Phys. Rev. E, 75, 046 603.\nHasselmann, K., 1966: Feynman diagrams and interaction rules of wave-wave scattering processes. Rev. Geophys., 4, 1–32.\nJanssen, P. A. E. M., 2003: Nonlinear four-wave interactions and freak waves. J. Phys.\nOceanogr., 33, 863–884.\n49\n\n\fKenyon, K. E., 1966: Wave-wave scattering for gravity waves and rossby waves. Ph.D. thesis,\nUCSD.\n---, 1968: Wave-wave interactions of surface and internal waves. J. Mar. Res., 26, 208–231.\nKramer, P. R., J. A. Biello, and Y. V. Lvov, 2003: Application of weak turbulence theory to fpu\nmodel. Discrete and Continuous Dynamical Systems. Expanded Volume for the Proceedings\nof the Fourth International Conference on Dynamical Systems and Differential Equations,\n482.\nLvov, V. S., Y. V. Lvov, A. C. Newell, and V. E. Zakharov, 1997: Statistical description of\nacoustic turbulence. Phys. Rev. E, 56, 390–405.\nLvov, Y. V. and S. Nazarenko, 2004: Noisy spectra, long correlations, and intermittency in wave\nturbulence. Physical Review E, 69, 066 608.\nLvov, Y. V., S. Nazarenko, and B. Pokorni, 2006: Discreteness and its effect on the water-wave\nturbulence. Physica D, 218, 24–35.\nLvov, Y. V., K. L. Polzin, E. G. Tabak, and N. Yokoyama, submitted: Oceanic internal wavefield:\nTheory of scale-invariant spectra. J. Phys. Oceanogr.\nLvov, Y. V. and E. G. Tabak, 2001: Hamiltonian formalism and the garrett and munk spectrum\nof internal waves in the ocean. Phys. Rev. Lett., 87, 169 501.\n---, 2004: A hamiltonian formulation for long internal waves. Physica D, 195, 106–122.\nMcComas, C. H., 1975: Nonlinear interactions of internal gravity waves. Ph.D. thesis, The\nJohns Hopkins University.\n\n50\n\n\f---, 1977: Equilibrium mechanisms within the oceanic internal wavefield. J. Phys.\nOceanogr., 7, 836–845.\nMcComas, C. H. and F. P. Bretherton, 1977: Resonant interaction of oceanic internal waves. J.\nGeophys. Res., 82, 1397–1412.\nMcComas, C. H. and P. Müller, 1981a: The dynamic balance of internal waves. J. Phys.\nOceanogr., 11, 970–986.\n---, 1981b: Time scales of resonant interactions among oceanic internal waves. J. Phys.\nOceanogr., 11, 139–147.\nMeiss, J. D., N. Pomphrey, and K. M. Watson, 1979: Numerical analysis of weakly nonlinear\nwave turbulence. Proc. Nat. Acad. Sci. U.S., 76, 2109–2113.\nMilder, M., 1982: Hamiltonian description of internal waves. J. Fluid Mech., 119, 269–282.\nMiropolsky, Y. Z., 1981: Dinamika vnutrennih gravitacionnih voln v okeane. Gidrometeroizdat.\nMul̈ler, P., 1976: On the diffusion of momentum and mass by internal gravity waves. J. Fluid\nMech., 77, 789–823.\nMüller, P., G. Holloway, F. Henyey, and N. Pomphrey, 1986: Nonlinear interactions among\ninternal gravity waves. Rev. Geophys., 24, 493–536.\nMüller, P. and D. J. Olbers, 1975: On the dynamics of internal waves in the deep ocean. J.\nGeophys. Res., 80, 3848–3860.\nOlbers, D. J., 1974: On the energy balance of small scale internal waves in the deep sea. Hamburg, Geophys. Einzelschriftern, 27.\n\n51\n\n\f---, 1976: Nonlinear energy transfer and the energy balance of the internal wave field in\nthe deep ocean. J. Fluid Mech., 74, 375–399.\nPelinovsky, E. N. and M. A. Raevsky, 1977: Weak turbulence of the internal waves of the ocean.\nAtm. Ocean Phys.-Izvestija, 13, 187–193.\nPinkel, R., 2008: Advection, phase distortion, and the frequency spectrum of finescale fields in\nthe sea. J. Phys. Oceanogr., 38, 291–313.\nPomphrey, N., J. D. Meiss, and K. D. Watson, 1980: Description of nonlinear internal wave\ninteractions using langevin methods. J. Geophys. Res., 85, 1085–1094.\nSeliger, R. L. and G. B. Witham, 19968: Variational principles in continuum mechanics. Proc.\nRoyal Soc., Ser. A, 305, 1–25.\nSherman, J. T. and R. Pinkel, 1991: Estimates of the vertical wavenumber-frequency spectra of\nvertical shear and strain. J. Phys. Ocean., 21, 292–303.\nVoronovich, A. G., 1979: Hamiltonian formalism for internal waves in the ocean. Izvestiya,\nAtmospheric and Oceanic Physics, 16, 52–57.\nVoronovich, V. V., I. A. Sazonov, and V. I. Shrira, 2006: On radiating solitons in a model of the\ninternal wave shear flow resonance. J. Fluid Mech., 568, 273–301.\nYuen, H. C. and B. M. Lake, 1982: Nonlinear dynamics of deep-water gravity waves. Adv. Appl.\nMech., 22, 67–229.\nZakharov, V. E., V. S. Lvov, and G. Falkovich, 1992: Kolmogorov Spectra of Turbulence.\nSpringer-Verlag.\n\n52\n\n\fList of Figures\n1\n\nMatrix elements | Vpp1 ,p2 (36b) |2 given by the solution (36b). upper left: |\nVpp1 ,p2 MO\n|2 according to Müller and Olbers (1975), upper right: | Vpp1 ,p2 V\n|2\n(36b)\n(36b)\naccording to Voronovich (1979), bottom left: | Vpp1 ,p2 CZ\n|2 according to\n(36b)\nCaillol and Zeitlin (2000), bottom right: | Vpp1 ,p2 H\n|2 according to Lvov and Tabak\n(36b)\n(2001).\n\n2\n\n. . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .\n\n55\n\nMatrix elements | Vpp21,p (37a) |2 given by the solution (37a). upper left: |\nVpp21,p MO\n|2 according to Müller and Olbers (1975), upper right: | Vpp21,p V\n|2\n(37a)\n(37a)\naccording to Voronovich (1979), bottom left: | Vpp21,p CZ\n|2 according to Caillol and Zeitlin\n(37a)\n(2000), bottom right: | Vpp21,p H\n|2 according to Lvov and Tabak (2001). . . .\n(37a)\n\n3\n\n56\n\n|2\nMatrix elements | Vpp21,p (37b) |2 given by the solution (37b). upper left: | Vpp21,p MO\n(37b)\n|2 according to\naccording to Müller and Olbers (1975), upper right: | Vpp21,p V\n(37b)\nVoronovich (1979), bottom left: | Vpp21,p CZ\n|2 according to Caillol and Zeitlin\n(37b)\n(2000), bottom right: | Vpp21,p H\n|2 according to Lvov and Tabak (2001). . . .\n(37b)\n\n4\n\n57\n\nupper: Matrix elements | Vpp1 ,p2 ES |2 given by the solution (36a). middle: Matrix elements | Vpp1 ,p2 ID |2 given by the solution (36b). bottom: Matrix elements | Vpp21,p PSI |2 given by the solution (37a), which gives PSI as | k1 |→ 0\n(ǫ → 0). The matrix elements here are shown as functions of ǫ such that\n(|k1 |, |k2|) = (ǫ, ǫ/3 + 1)|k|. All four versions of the Matrix elements are\nplotted here: the appearance of a single line in each figure panel testifies to the\nsimilarity of the elements on the resonant manifold.\n\n53\n\n. . . . . . . . . . . . . .\n\n58\n\n\f5\n\nNormalized Boltzmann rates (34) for the Garrett and Munk spectrum (46) calculated via (40). Figures represent normalized Boltzmann rate calculated using\nLvov and Tabak (2004), equation (56) with δ = 10−3 , (upper-left), δ = 10−2 ,\n(upper-right), δ = 10−1 , (lower-left), δ = 0.5, (lower-right). On these figures\nwhite region on the figure corresponds to extremely fast time scales, faster then\na linear time scale. . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .\n\n54\n\n59\n\n\f3\n\n2.5\n\n3\n10\n\n1\n\n1\n\n-1\n\n-1\n\n2.5\n\n10-2\n10\n\n-3\n\n10-2\n10-3\n\n2\n\n|k2 |/|k|\n\n2\n\n|k2 |/|k|\n\n10\n\n1.5\n\n1.5\n\n1\n\n1\n\n0.5\n\n0.5\n\ng replacements\n\nPSfrag replacements\n0\n\n0\n0\n\n0.5\n\n1\n\n1.5\n\n2\n\n2.5\n\n3\n\n0\n\n0.5\n\n1\n\n|k1 |/|k|\n3\n\n2.5\n\n2\n\n2.5\n\n3\n\n2\n\n2.5\n\n3\n\n3\n1\n\n1\n\n10-1\n\n10-1\n\n2.5\n\n10-2\n10-3\n\n10-2\n10-3\n\n2\n\n|k2 |/|k|\n\n2\n\n|k2 |/|k|\n\n1.5\n\n|k1 |/|k|\n\n1.5\n\n1.5\n\n1\n\n1\n\n0.5\n\n0.5\n\ng replacements\n\nPSfrag replacements\n0\n\n0\n0\n\n0.5\n\n1\n\n1.5\n\n2\n\n2.5\n\n3\n\n|k1 |/|k|\n\n0\n\n0.5\n\n1\n\n1.5\n\n|k1 |/|k|\n\nF IG . 1. Matrix elements | Vpp1 ,p2 (36b) |2 given by the solution (36b). upper left: | Vpp1 ,p2 MO\n|2\n(36b)\n\naccording to Müller and Olbers (1975), upper right: | Vpp1 ,p2 V\n|2 according to Voronovich\n(36b)\n\n(1979), bottom left: | Vpp1 ,p2 CZ\n|2 according to Caillol and Zeitlin (2000), bottom right: |\n(36b)\nVpp1 ,p2 H\n|2 according to Lvov and Tabak (2001).\n(36b)\n\n55\n\n\f3\n\n2.5\n\n3\n10\n\n1\n\n1\n\n-1\n\n-1\n\n2.5\n\n10-2\n10\n\n-3\n\n10-2\n10-3\n\n2\n\n|k2 |/|k|\n\n2\n\n|k2 |/|k|\n\n10\n\n1.5\n\n1.5\n\n1\n\n1\n\n0.5\n\n0.5\n\ng replacements\n\nPSfrag replacements\n0\n\n0\n0\n\n0.5\n\n1\n\n1.5\n\n2\n\n2.5\n\n3\n\n0\n\n0.5\n\n1\n\n|k1 |/|k|\n3\n\n2.5\n\n2\n\n2.5\n\n3\n\n2\n\n2.5\n\n3\n\n3\n1\n\n1\n\n10-1\n\n10-1\n\n2.5\n\n10-2\n10-3\n\n10-2\n10-3\n\n2\n\n|k2 |/|k|\n\n2\n\n|k2 |/|k|\n\n1.5\n\n|k1 |/|k|\n\n1.5\n\n1.5\n\n1\n\n1\n\n0.5\n\n0.5\n\ng replacements\n\nPSfrag replacements\n0\n\n0\n0\n\n0.5\n\n1\n\n1.5\n\n2\n\n2.5\n\n3\n\n|k1 |/|k|\n\n0\n\n0.5\n\n1\n\n1.5\n\n|k1 |/|k|\n\nF IG . 2. Matrix elements | Vpp21,p (37a) |2 given by the solution (37a). upper left: | Vpp21,p MO\n|2\n(37a)\n\naccording to Müller and Olbers (1975), upper right: | Vpp21,p V\n|2 according to Voronovich\n(37a)\n\n(1979), bottom left: | Vpp21,p CZ\n|2 according to Caillol and Zeitlin (2000), bottom right: |\n(37a)\nVpp21,p H\n|2 according to Lvov and Tabak (2001).\n(37a)\n\n56\n\n\f3\n\n2.5\n\n3\n10\n\n1\n\n1\n\n-1\n\n-1\n\n2.5\n\n10-2\n10\n\n-3\n\n10-2\n10-3\n\n2\n\n|k2 |/|k|\n\n2\n\n|k2 |/|k|\n\n10\n\n1.5\n\n1.5\n\n1\n\n1\n\n0.5\n\n0.5\n\ng replacements\n\nPSfrag replacements\n0\n\n0\n0\n\n0.5\n\n1\n\n1.5\n\n2\n\n2.5\n\n3\n\n0\n\n0.5\n\n1\n\n|k1 |/|k|\n3\n\n2.5\n\n2\n\n2.5\n\n3\n\n2\n\n2.5\n\n3\n\n3\n1\n\n1\n\n10-1\n\n10-1\n\n2.5\n\n10-2\n10-3\n\n10-2\n10-3\n\n2\n\n|k2 |/|k|\n\n2\n\n|k2 |/|k|\n\n1.5\n\n|k1 |/|k|\n\n1.5\n\n1.5\n\n1\n\n1\n\n0.5\n\n0.5\n\ng replacements\n\nPSfrag replacements\n0\n\n0\n0\n\n0.5\n\n1\n\n1.5\n\n2\n\n2.5\n\n3\n\n|k1 |/|k|\n\n0\n\n0.5\n\n1\n\n1.5\n\n|k1 |/|k|\n\nF IG . 3. Matrix elements | Vpp21,p (37b) |2 given by the solution (37b). upper left: | Vpp21,p MO\n|2\n(37b)\n\naccording to Müller and Olbers (1975), upper right: | Vpp21,p V\n|2 according to Voronovich\n(37b)\n\n(1979), bottom left: | Vpp21,p CZ\n|2 according to Caillol and Zeitlin (2000), bottom right: |\n(37b)\nVpp21,p H\n|2 according to Lvov and Tabak (2001).\n(37b)\n\n57\n\n\f10\n\nǫ1/2\nǫ2\n0 H 2\n|V1,2\n|\nES\n\n|Vpp1 ,p2 ES |2\n\nPSfrag replacements\n\nV\n\n0\n|V1,2\n|2\nES\n\n10\n\n-1\n\n10\n\n-2\n\n10\n\n-3\n\n10\n\n-4\n\n10\n\n-5\n\n10\n\n-6\n\nMO\n\n0\n|V1,2\n|2\nES\n\n0\n\nǫ\n\nCZ\n\n0\n|V1,2\n|2\nES\n|Vpp1 ,p2 ES |2\n\n10\n\n-6\n\n10\n\n-5\n\n10\n\n-4\n\n10\n\n-3\n\n10\n\n-2\n\n10\n\n-1\n\n10\n\n0\n\n-3\n\n10\n\n-2\n\n10\n\n-1\n\n10\n\n0\n\n-2\n\n10\n\n-1\n\n10\n\n0\n\nǫ\n10\n\nǫ2\n0 H 2\n|V1,2\n|\nID\n0 V 2\n|V1,2\n|\nID\n0 MO 2\n|V1,2\n|\nID\n0 CZ 2\n|V1,2\n|\nID\n|Vpp1 ,p2 ID |2\n\n|Vpp1 ,p2 ID |2\n\nPSfrag replacements\n\n0\n\n10\n\n-1\n\n10\n\n-2\n\n10\n\n-3\n\n10\n\n-4\n\n10\n\n-5\n\n10\n\n-6\n\nǫ1/2\n\n10\n\n-6\n\n10\n\n-5\n\n10\n\n-4\n\n10\n\nǫ\n0\n\nPSfrag replacements\n\n10\n\nǫ1/2\n\n10\n\n-2\n\n0\n|V1,2\n|2\nPSI1\n\n10\n\n-4\n\n10\n\n-6\n\n10\n\n-8\n\n0 MO 2\n|V1,2\n|\nPSI1\n0 CZ 2\n|V1,2 PSI1 |\n0 H\n|V1,2\n|2\nPSI1\n0 V\n|V1,2 PSI1 |2\n0 MO 2\n|V1,2\n|\nPSI1\n0 CZ 2\n|V1,2 PSI1 |\n|Vpp21,p |2\n\n|Vpp21,p PSI |2\n\nH\n\n10\n\n-10\n\n10\n\n-12\n\n10\n\nǫ2\n\n-6\n\n10\n\n-5\n\n10\n\n-4\n\n10\n\n-3\n\n10\n\nǫ\n\nF IG . 4. upper: Matrix elements | Vpp1 ,p2 ES |2 given by the solution (36a). middle: Matrix\nelements | Vpp1 ,p2 ID |2 given by the solution (36b). bottom: Matrix elements | Vpp21,p PSI |2 given\nby the solution (37a), which gives PSI as | k1 |→ 0 (ǫ → 0). The matrix elements here are\nshown as functions of ǫ such that (|k1 |, |k2|) = (ǫ, ǫ/3 + 1)|k|. All four versions of the Matrix\nelements are plotted here: the appearance of a single line in each figure panel testifies to the\nsimilarity of the elements on the resonant manifold.\n\n58\n\n\fTime Scale in Wave Periods: n(p) ∝ α−4.0β0.00, δ=1.e−3\n\nTime Scale in Wave Periods: n(p) ∝ α−4.0β0.00, δ=1.e−2\n1\n\n1\n\n1.6\n\n1.6\n0\n\n0.8\n\n0.8\n1.4\n\n0.6\n\n1.2\n\n0.2\n0\n\n0.8\n5f\n\n0\n0\n\n−0.2\n\n0\n\n−0.4\n0.4\n\n0\n\n2f\n\n0\n0\n\n5f\n\n0\n\n0\n\n−0.2\n\n0.6\n\n−0.4\n0.4\n\n−0.6\n\n−0.6\n\n2f\n\n0\n0\n\n0.2\n\n−0.8\n\nj=3\n30\n150\n0.5\n1\n1.5\n2\nlog10(vertical wavenumber) (mode−equivalent)\n\n0.2\n\n0.8\n\n0\n\n0.2\n0\n\n0.4\n10f\n\n1\n\n0\n\n0.6\n\n0.6\n\n1.2\n\n0\n\nlog10(frequency) (/f)\n\n0.4\n10f\n\n1\n0\n\nlog10(frequency) (/f)\n\n1.4\n\n−0.8\n\n0\n\n−1\n\nj=3\n30\n150\n0.5\n1\n1.5\n2\nlog10(vertical wavenumber) (mode−equivalent)\n\n0\n\nTime Scale in Wave Periods: n(p) ∝ α−4.0β0.00, δ=1.e−1\n\nTime Scale in Wave Periods: n(p) ∝ α−4.0β0.00, δ=5.e−1\n1\n\n1\n\n1.6\n\n1.6\n0.8\n\n0.8\n1.4\n\n0.6\n\n1.2\n\n0.2\n\n10f\n\n1\n\n0\n\n0\n\n0\n\n0.8\n0\n\n5f\n\n−0.2\n\n0.6\n0.4\n\n−0.4\n\n0\n\n0.2\n0\n\n0\n\n0.8\n5f\n0.6\n\n−0.2\n\n0\n\n0\n\n−1\n\n0\n\n−0.4\n−0.6\n\n0.2\n\n−0.8\n\n0\n\nj=3\n30\n150\n0.5\n1\n1.5\n2\nlog10(vertical wavenumber) (mode−equivalent)\n\n10f\n\n1\n\n2f\n\n0\n\n0\n\n0.4\n\n0.4\n\n−0.6\n\n2f\n0.2\n\n0.6\n\n1.2\n\n0\n\nlog10(frequency) (/f)\n\n0.4\n\n0\n\nlog10(frequency) (/f)\n\n1.4\n\n0\n\n−1\n\n0\nj=3\n30\n150\n0.5\n1\n1.5\n2\nlog10(vertical wavenumber) (mode−equivalent)\n\n−0.8\n−1\n\nF IG . 5. Normalized Boltzmann rates (34) for the Garrett and Munk spectrum (46) calculated\nvia (40). Figures represent normalized Boltzmann rate calculated using Lvov and Tabak (2004),\nequation (56) with δ = 10−3 , (upper-left), δ = 10−2 , (upper-right), δ = 10−1 , (lower-left),\nδ = 0.5, (lower-right). On these figures white region on the figure corresponds to extremely\nfast time scales, faster then a linear time scale.\n\n59\n\n\fList of Tables\n1\n\nA list of various kinetic equations. Results from Olbers (1976), McComas and Bretherton\n(1977) and Pomphrey et al. (1980) are reviewed in Müller et al. (1986), who\nstate that Olbers (1976), McComas and Bretherton (1977) and an unspecified\nEulerian representation are consistent on the resonant manifold. Pomphrey et al.\n(1980) utilizes Langevin techniques to assess nonlinear transports. Müller et al.\n(1986) characterizes those Langevin results as being mutually consistent with\nthe direct evaluations of kinetic equations presented in Olbers (1976) andMcComas and Bretherton\n(1977). Kenyon (1968) states (without detail) that Kenyon (1966) and Hasselmann\n(1966) give numerically similar results. A formulation in terms of discrete\nmodes will typically permit an arbitrary buoyancy profile, but obtaining results\nrequires specification of the profile. Of the discrete formulations, Pomphrey et al.\n(1980) use an exponential profile and the others assume a constant stratification\nrate. The kinetic equations marked by\n\n†\n\nare investigated in Section 3, while\n\nkinetic equations marked by ‡ are investigated further in Section a. . . . . . . .\n2\n\nNumerical evaluations of\n\nRN\nf\n\n61\n\nE(m, ω)dω for vertical mode numbers 1-8. The\n\nsum is given in the right-most column.\n\n60\n\n. . . . . . . . . . . . . . . . . . . . .\n\n62\n\n\fTABLE 1.\nA list of various kinetic equations.\nResults from Olbers (1976),\nMcComas and Bretherton (1977) and Pomphrey et al. (1980) are reviewed in Müller et al.\n(1986), who state that Olbers (1976), McComas and Bretherton (1977) and an unspecified Eulerian representation are consistent on the resonant manifold. Pomphrey et al. (1980) utilizes\nLangevin techniques to assess nonlinear transports. Müller et al. (1986) characterizes those\nLangevin results as being mutually consistent with the direct evaluations of kinetic equations\npresented in Olbers (1976) andMcComas and Bretherton (1977). Kenyon (1968) states (without\ndetail) that Kenyon (1966) and Hasselmann (1966) give numerically similar results. A formulation in terms of discrete modes will typically permit an arbitrary buoyancy profile, but obtaining results requires specification of the profile. Of the discrete formulations, Pomphrey et al.\n(1980) use an exponential profile and the others assume a constant stratification rate. The kinetic equations marked by † are investigated in Section 3, while kinetic equations marked by ‡\nare investigated further in Section a.\nsource\nHasselmann (1966)\nKenyon (1966, 1968)\nMüller and Olbers (1975)†‡\nMcComas (1975, 1977)\nPelinovsky and Raevsky (1977)\nVoronovich (1979)†\nPomphrey et al. (1980)\nMilder (1982)\nCaillol and Zeitlin (2000)†\nLvov and Tabak (2001)†\nLvov and Tabak (2004)‡\n\ncoordinate vertical rotation hydrospecial\nsystem\nstructure\nstatic\nLagrangian discrete\nno\nno\nEulerian\ndiscrete\nno\nno\nnon-Hamiltonian\nLagrangian\ncont.\nyes\nno\nLagrangian\ncont.\nyes\nyes\nLagrangian\ncont.\nno\nno\nClebsch\nEulerian\ncont.\nno\nyes\nClebsch\nLagrangian discrete\nyes\nno\nLangevin\nIsopycnal\nn/a\nno\nno\nEulerian\ncont.\nno\nno\nnon-Hamiltonian\nIsopycnal\ncont.\nno\nyes\ncanonical\nIsopycnal\ncont.\nyes\nyes\ncanonical\n\n61\n\n\fTABLE 2. Numerical evaluations of\nis given in the right-most column.\n\nĖ × 10−10 W/kg\n\nRN\nf\n\nE(m, ω)dω for vertical mode numbers 1-8. The sum\n\nmode-1\n\n2\n\n3\n\n4\n\n5\n\n6\n\n7\n\n8\n\nΣ\n\nLvov and Tabak (2004) GM76\n\n-1.46\n\n-1.72 -1.76 -1.69\n\n-1.57 -1.40 -1.08 -0.81 -11.5\n\nPomphrey et al. (1980)\n\n-1.83\n\n-2.17 -2.17 -1.83\n\n-1.67 -1.00\n\nGM76\n\n62\n\n-10.7\n\n\f"}