{"id": "http://arxiv.org/abs/0807.2885v1", "guidislink": true, "updated": "2008-07-17T22:31:50Z", "updated_parsed": [2008, 7, 17, 22, 31, 50, 3, 199, 0], "published": "2008-07-17T22:31:50Z", "published_parsed": [2008, 7, 17, 22, 31, 50, 3, 199, 0], "title": "Quasi-reversible Magnetoresistance in Exchange Spring Tunnel Junctions", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0807.5096%2C0807.2495%2C0807.0877%2C0807.3797%2C0807.3066%2C0807.2675%2C0807.3631%2C0807.4367%2C0807.2371%2C0807.2700%2C0807.1686%2C0807.0958%2C0807.4030%2C0807.1180%2C0807.4404%2C0807.1757%2C0807.0944%2C0807.5059%2C0807.3015%2C0807.2229%2C0807.3160%2C0807.2951%2C0807.4194%2C0807.1147%2C0807.1591%2C0807.4663%2C0807.0392%2C0807.3475%2C0807.2243%2C0807.0828%2C0807.4325%2C0807.3477%2C0807.2056%2C0807.2237%2C0807.1488%2C0807.3417%2C0807.0815%2C0807.5118%2C0807.3813%2C0807.2809%2C0807.4766%2C0807.0918%2C0807.4100%2C0807.1463%2C0807.1201%2C0807.2683%2C0807.2110%2C0807.1661%2C0807.4555%2C0807.1320%2C0807.3644%2C0807.2885%2C0807.4596%2C0807.4631%2C0807.0539%2C0807.0143%2C0807.5113%2C0807.3955%2C0807.4257%2C0807.0549%2C0807.1080%2C0807.4739%2C0807.0561%2C0807.4023%2C0807.2731%2C0807.3695%2C0807.1756%2C0807.1391%2C0807.3380%2C0807.3616%2C0807.2962%2C0807.4547%2C0807.3065%2C0807.1856%2C0807.1379%2C0807.0632%2C0807.4167%2C0807.1039%2C0807.4992%2C0807.1566%2C0807.3625%2C0807.2455%2C0807.1442%2C0807.1390%2C0807.3549%2C0807.4201%2C0807.2784%2C0807.1345%2C0807.1155%2C0807.2562%2C0807.0097%2C0807.3778%2C0807.2557%2C0807.3098%2C0807.3193%2C0807.2687%2C0807.4922%2C0807.3683%2C0807.3426%2C0807.2764%2C0807.0437&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Quasi-reversible Magnetoresistance in Exchange Spring Tunnel Junctions"}, "summary": "We report a large, quasi-reversible tunnel magnetoresistance in\nexchange-biased ferromagnetic semiconductor tunnel junctions wherein a soft\nferromagnetic semiconductor (\\gma) is exchange coupled to a hard ferromagnetic\nmetal (MnAs). Our observations are consistent with the formation of a region of\ninhomogeneous magnetization (an \"exchange spring\") within the biased \\gma\nlayer. The distinctive tunneling anisotropic magnetoresistance of \\gma produces\na pronounced sensitivity of the magnetoresistance to the state of the exchange\nspring.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0807.5096%2C0807.2495%2C0807.0877%2C0807.3797%2C0807.3066%2C0807.2675%2C0807.3631%2C0807.4367%2C0807.2371%2C0807.2700%2C0807.1686%2C0807.0958%2C0807.4030%2C0807.1180%2C0807.4404%2C0807.1757%2C0807.0944%2C0807.5059%2C0807.3015%2C0807.2229%2C0807.3160%2C0807.2951%2C0807.4194%2C0807.1147%2C0807.1591%2C0807.4663%2C0807.0392%2C0807.3475%2C0807.2243%2C0807.0828%2C0807.4325%2C0807.3477%2C0807.2056%2C0807.2237%2C0807.1488%2C0807.3417%2C0807.0815%2C0807.5118%2C0807.3813%2C0807.2809%2C0807.4766%2C0807.0918%2C0807.4100%2C0807.1463%2C0807.1201%2C0807.2683%2C0807.2110%2C0807.1661%2C0807.4555%2C0807.1320%2C0807.3644%2C0807.2885%2C0807.4596%2C0807.4631%2C0807.0539%2C0807.0143%2C0807.5113%2C0807.3955%2C0807.4257%2C0807.0549%2C0807.1080%2C0807.4739%2C0807.0561%2C0807.4023%2C0807.2731%2C0807.3695%2C0807.1756%2C0807.1391%2C0807.3380%2C0807.3616%2C0807.2962%2C0807.4547%2C0807.3065%2C0807.1856%2C0807.1379%2C0807.0632%2C0807.4167%2C0807.1039%2C0807.4992%2C0807.1566%2C0807.3625%2C0807.2455%2C0807.1442%2C0807.1390%2C0807.3549%2C0807.4201%2C0807.2784%2C0807.1345%2C0807.1155%2C0807.2562%2C0807.0097%2C0807.3778%2C0807.2557%2C0807.3098%2C0807.3193%2C0807.2687%2C0807.4922%2C0807.3683%2C0807.3426%2C0807.2764%2C0807.0437&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We report a large, quasi-reversible tunnel magnetoresistance in\nexchange-biased ferromagnetic semiconductor tunnel junctions wherein a soft\nferromagnetic semiconductor (\\gma) is exchange coupled to a hard ferromagnetic\nmetal (MnAs). Our observations are consistent with the formation of a region of\ninhomogeneous magnetization (an \"exchange spring\") within the biased \\gma\nlayer. The distinctive tunneling anisotropic magnetoresistance of \\gma produces\na pronounced sensitivity of the magnetoresistance to the state of the exchange\nspring."}, "authors": ["M. Zhu", "M. J. Wilson", "P. Mitra", "P. Schiffer", "N. Samarth"], "author_detail": {"name": "N. Samarth"}, "author": "N. Samarth", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1103/PhysRevB.78.195307", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/0807.2885v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0807.2885v1", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "cond-mat.mtrl-sci", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cond-mat.mtrl-sci", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0807.2885v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0807.2885v1", "arxiv_comment": null, "journal_reference": "Phys. Rev. B 78, 195307 (2008)", "doi": "10.1103/PhysRevB.78.195307", "fulltext": "Quasi-reversible Magnetoresistance in Exchange Spring Tunnel Junctions\nM. Zhu, M. J. Wilson, P. Mitra, P. Schiffer, and N. Samarth∗\nDept. of Physics and Materials Research Institute,\nThe Pennsylvania State University, University Park PA 16802\n\narXiv:0807.2885v1 [cond-mat.mtrl-sci] 17 Jul 2008\n\nWe report a large, quasi-reversible tunnel magnetoresistance in exchange-biased ferromagnetic\nsemiconductor tunnel junctions wherein a soft ferromagnetic semiconductor (Ga1−x Mnx As) is exchange coupled to a hard ferromagnetic metal (MnAs). Our observations are consistent with the\nformation of a region of inhomogeneous magnetization (an \"exchange spring\") within the biased\nGa1−x Mnx As layer. The distinctive tunneling anisotropic magnetoresistance of Ga1−x Mnx As produces a pronounced sensitivity of the magnetoresistance to the state of the exchange spring.\nPACS numbers: 75.47.-m, PACS2: 75.50.Pp, PACS3: 85.75.-d\n\nThe interplay between spin-polarized currents and ferromagnetic order is a fundamental problem that continues to attract much attention in contemporary condensed\nmatter physics, with specific applications in spintronics.\nIn this context, there is a particular need to identify\nmodel systems that could permit systematic experimental studies of spin-dependent transport through regions of\nnon-uniform magnetization [1, 2]. Here, we we describe\nspin-dependent tunneling studies of novel semiconductorbased magnetic tunnel junctions (MTJs) that contain an\n\"exchange spring\" produced by exchange coupling one of\nthe ferromagnetic semiconductor layers with a magnetically harder (metallic) ferromagnet. In such exchange\nsprings, the non-uniform magnetization of the softer ferromagnetic layer is twisted about an axis normal to the\nlayer plane, akin to a partial domain wall [3]. We show\nthat spin-dependent tunneling – and thus the tunneling\nmagnetoresistance (TMR) – in these MTJ devices is very\nsensitive to the detailed magnetic configuration of the exchange spring because of the tunneling anisotropic magnetoresistance (TAMR) effect [4]. Although exchange\nspring configurations have been studied in metallic ferromagnetic heterostructures using techniques such as neutron scattering [5], we are unaware of any measurements\nof spin-dependent tunneling in such systems. In addition to providing a new model system for studies of spindependent transport, the devices described here are a\nproof-of-concept demonstration of exchange-biased ferromagnetic semiconductor MTJs of relevance to semiconductor spintronics [6].\nThe MTJ devices studied here are fabricated from heterostructure samples that are grown by low temperature molecular beam epitaxy on p-type (001) GaAs substrates. We first deposit a 150 nm thick Be-doped pGaAs buffer layer (with p∼1×1019 cm−3 ). This is followed by a heterostructure comprised of two nominally\nidentical Ga1−x Mnx As layers (with 30 nm thickness and\nx ∼ 6%) separated by a tunnel barrier. In sample A,\nthe tunnel barrier consists of 1 nm GaAs/ 4nm AlAs /\n1nm GaAs spacer; the GaAs spacers prevent diffusion\nof Mn into the AlAs barrier. In samples B and C, the\ntunnel barriers consist of 4nm GaAs and 8 nm GaAs, re-\n\nspectively. The top Ga1−x Mnx As layer has an epitaxial\noverlayer of type-A MnAs (with thickness 10±2nm). The\nlatter is a semimetallic ferromagnet that provides an exchange bias for the top Ga1−x Mnx As layer [8], making it\nharder to switch, while the bottom Ga1−x Mnx As layer\nis free to rotate in a small magnetic field. The function of\nthe ferromagnetic MnAs layer is analogous to that of the\nantiferromagnetic layer commonly used in metallic MTJ\ndevices as a pinning layer [7]. Although it is possible to\nexchange bias Ga1−x Mnx As using an antiferromagnet,\nthis has only been achieved using an insulator (MnO) [9],\nthus precluding easy fabrication of perpendicular transport devices.\nWe use photolithography, followed by a chlorine-based\nreactive ion etch, to fabricate cylindrical mesa MTJ devices, about 600 nm high and ranging in diameter from\n10μm to 100μm. The TMR in these devices is measured\nusing a pseudo-four-probe scheme, with separate voltage\nand current leads connected to top Ti/Au contacts and\nIn contacts on the back of the substrate. The TMR is\nmeasured by applying a bias voltage and measuring the\ntunneling current using a Keithley 2410 source meter.\nThe magnetic properties of the samples are measured\nusing a Quantum Design superconducting quantum interference device (SQUID) magnetometer. In the magnetization and magnetoresistance measurements, the external magnetic field is applied in plane along [112̄0], the\neasy axis of the type-A MnAs layer; this corresponds to\nthe [110] direction of the GaAs substrate.\nFigure 1(a) shows the temperature-dependent remanent magnetization M (T ) for sample C. The other\ntwo samples show similar behavior. Although the two\nGa1−x Mnx As layers have nominally identical compositions, they show different values of the Curie temperature (TC ). The ∼ 20 K difference in TC is readily seen in M (T ) when the top MnAs layer is chemically removed (Fig.1(d)). This enhancement in TC for\nthe upper Ga1−x Mnx As layer is attributed to the outdiffusion of hole-compensating Mn interstitial defects\nduring the growth of MnAs. Figure 1(b) shows the\nmajor magnetization curve M (H) in sample C, revealing different switching behaviors for the top and bot-\n\n\f2\n\nbottom\ntop\n\n0\n\n100\n\n200\nT (K)\n\ntop\n\n0\n\nbottom\n\n-5\n\n-10\n300\n\n-4000 -2000\n\n400\n\n0\n2000 4000\nH (Oe)\n\n10K\n10%\n4.2K\n\n2\n\n-6\n\n-6\n\n-7.5\n-8.0\n\nbottom\n\n(c)\n-400\n\n0\n\n400\nH (Oe )\n\n800\n\n1.0\n0.8\n\n-6\n\n2\n\n2\n\n-7.0\n\n-8.5\n\nM (10 emu/mm )\n\n1.2\n\ntop\n\n10K\n\n50%\n\n4.2K\n\n1\n0\n\nMnAs switches\n\n-1\n\n0.6\n\n20K\n\n20K\nTMR Ratio (%)\n\nMnAs\n\n-6.5\nM (10 e mu/mm )\n\n2\n\n4\n\n0\n\n5\n\n-6\n\nGaMnAs\n\n2\n\n(b) Sample C\n\n(a) Sample A\n\n(b)\n\nTMR Ratio (%)\n\n6\n\n10\n\n(a)\n\nM (10 e mu/mm )\n\n8\n\nM (10 e mu/mm )\n\n-6\n\n2\n\nM (10 emu/mm )\n\n10\n\nbottom\n\n-100\n\n0.4\n\n0\n100\nH (Oe)\n\n-2000-1000 0\n\n1000 2000\n\nH (Oe)\n\nMnAs switches\n\n-2000-1000 0\n\n1000 2000\n\nH (Oe)\n\n0.2\n\ntop\n\n(d)\n\n0.0\n0\n\n40\n\n80\n\n120\n\nT (K)\n\nFIG. 1: (Color online) (a) Temperature-dependent magnetization M (T ) for sample C. (b) Major magnetization loop\nM (H) for sample C, showing distinct switching fields for the\nbottom Ga1−x Mnx As layer, the top Ga1−x Mnx As layer and\nthe MnAs layer (∼ 1.8 kOe). (c) Minor magnetization loops\nfor the same sample, measured after saturating the MnAs\nlayer in a field of −20 kOe. Solid triangles show the minor loop\nwhen only the bottom Ga1−x Mnx As layer is switched. Hollow\ncircles show the minor loop when both Ga1−x Mnx As layers\nswitch. (d) M (T ) and M (H)(inset) of the same sample after\nchemical removal of the MnAs layer. All the hysteresis loops\nare measured at 4.2K.\n\ntom Ga1−x Mnx As layers: the bottom layer experiences\na sharp transition while the magnetization of the top one\ngradually changes in external field due to the exchange\ncoupling with the MnAs overlayer.\nMeasurements of the minor M (H) loops are shown in\nFig.1(c). We obtain these minor loops after first saturating the magnetization of MnAs layer in a -20 kOe field.\nThen, we sweep the magnetic field in a small field range to\nswitch either the bottom Ga1−x Mnx As layer (−300Oe ≤\nH ≤ 300Oe) or both layers (−1kOe ≤ H ≤ 1kOe). The\nbottom Ga1−x Mnx As layer shows a small coercivity with\na square hysteresis loop that is symmetric around zero\nfield. In contrast, the top Ga1−x Mnx As layer exhibits\na large displacement (∼ 600 Oe) of the hysteresis loop\ndue to the ferromagnetic exchange coupling to the MnAs\nlayer [8]. As a control experiment, we chemically etched\naway the MnAs layer on the same sample and measured\nM (T ) and M (H); the inset to Fig. 1(d) shows that the\ncoercivity of the top Ga1−x Mnx As layer is drastically\nreduced to ∼ 50 Oe with a much sharper transition.\nMesa devices fabricated from the three MTJ samples\nshow distinct I-V characteristics (data not shown) due\nto different barrier heights and widths. Devices derived\n\nFIG. 2: (Color online) Major loop TMR at different temperatures in (a) a 100μm diameter mesa device patterned from\nsample A and (b) a 50μm device patterned from sample C.\n\nfrom sample A have the largest differential resistance\n(several kΩ for 100μm diameter mesas) and a strong nonlinearity, as anticipated for an AlAs barrier with a height\nof ∼550 meV in the valence band [10]. In contrast, since\nthe height of the GaAs barrier is small (∼ 100meV [11]),\ndevices made from sample B (4 nm wide barrier) display\nalmost linear I-V characteristics, while those from sample C (8 nm wide spacer) show non-linear I-V behavior\ncharacteristic of a good tunnel barrier. In the rest of the\npaper, we focus on the TMR in two devices fabricated\nfrom sample A (100μm diameter) and sample C (50μum)\nwhere we have taken an extensive set of data. Measurements on other devices (of varying diameter) fabricated\nfrom these samples show qualitatively similar results.\nFigures 2(a) and (b) show the major loop TMR in\nsamples A and C as a function of in-plane magnetic field\nover the temperatures range 4.2 K - 20 K. The magnetic\nfield is applied along [110], parallel to the easy axis of\nthe MnAs layer. The data shown in Fig. 2 are all taken\nat a constant 4 mV dc bias; we find that the TMR ratio shows a monotonic decay with increasing bias (data\nnot shown) and is symmetric in bias voltage polarity.\nThe data show three distinct jumps in resistance, each\ncorresponding to the independent switching of the three\nferromagnetic layers. The sharp increase in resistance\nat low field corresponds to the switching of the lower\nGa1−x Mnx As layer which creates an angle with respect\nto the upper Ga1−x Mnx As layer. The second jump in\nresistance occurs when the magnetization of the upper\nGa1−x Mnx As layer switches direction and aligns with\nthat of the lower Ga1−x Mnx As layer, creating a low resistance state. As we will discuss in more detail later, this\nprocess is more complex, resulting in a gradual decrease\nin TMR as the two layers come into alignment. For sample A, we find a peak TMR ratio as high as ∼ 12% at 4.2\n\n\f3\n\n(a)\n5\n\n10\n8\n6\n400\n800\n1200\n1600\nMinor loop starting field (Oe)\n\nMnAs\nswitches\n\n-5\n\nSample A, T = 4.2K\n\n-1000\n\n100\n80\nTMR Ratio (% )\n\n12\n\n0\n\n60\n\n-500\n\n0\n\n500\n1000\nH (Oe)\nMinor loop TMR (%)\n\nTMR Ratio (%)\n\n10\n\n4.2K\n10K\n\n14\n\n(b)\nSample C\nT = 4.2K\n\n40\n\n100\n80\n\n1500\n\n2500\n\n4.2K\n10K\n15K\n20K\n\n60\n40\n20\n0\n\n400 800 1200 1600\nMinor loop starting field (Oe)\n\n20\n\nMnAs\nswitches\n\n0\n-20\n-1000\n\n2000\n\n-500\n\n0\n\n500\n1000\nH (Oe)\n\n1500\n\n2000\n\n2500\n\nFIG. 3: (Color online) Major loop TMR (circles for sweep up\nand triangles for sweep down) and minor loop TMR (lines) at\n4.2 K for devices fabricated from (a) sample A and (b) sample\nC. The arrows indicate the direction of minor loops starting\nfrom different fields. The insets show the minor loop TMR\nratio as a function of starting field at different temperatures\nfor the two samples.\n\nK, comparable to earlier reports in Ga1−x Mnx As -based\nMTJs with thinner AlAs barriers [10]. Sample C shows a\nmuch larger peak TMR (∼ 40%) at 4.2 K, consistent with\nmore coherent tunneling through the GaAs barrier [11].\nWe note that sample B (4 nm GaAs barrier) shows very\nweak TMR (∼ 0.6% peak value, data not shown); we attribute this to the small tunneling barrier suggested by\nthe linear I-V characteristics. In all three samples, the\npeak TMR decreases as expected with increasing temperature, due to the decreasing spin polarization of the\nGa1−x Mnx As layers.\nThe third jump in resistance (indicated by arrows in\nFig.2) occurs when the MnAs layer finally switches (at\n∼ 1800 Oe), aligning its magnetization with that of the\nGa1−x Mnx As layers. This additional lowering of the\noverall device resistance is accompanied by the closing of\nthe major hysteresis loop. We observe this small decrease\nin resistance in devices derived from all three samples\nand attribute it to a spin valve effect due to spin dependent scattering at the MnAs/Ga1−x Mnx As interface [8].\nWe note that once all the three ferromagnetic layers are\naligned, the low resistance state is stable, and the TMR\nfollows an irreversible path as the magnetic field is swept\ndown.\nWe now address the minor loop TMR shown as solid\nlines in Fig. 3. These sweeps are obtained by the fol-\n\nlowing consistent protocol: we first saturate the magnetization of all three magnetic layers in a field of −3\nkOe; we then sweep to a starting field +H0 and then\nsweep the field down in magnitude. The minor loop\nTMR has a complex behavior whose exact form is sensitive to the value of H0 . When the minor loop is initiated at values of H0 just above the coercive field of\nthe lower Ga1−x Mnx As layer, the TMR shows a standard irreversible minor hysteresis loop, with the high\nresistance state remaining stable as the field is swept\ndown. However, if H0 is in a range within which the top\nGa1−x Mnx As layer has begun to switch direction (indicated within the dashed ellipses in Fig.3), the minor loop\nTMR is \"quasi-reversible.\" In sample A, the TMR retraces a path whose shape resembles that observed while\nthe field is swept up, but with a field-offset whose value\ndepends on H0 . In sample C, both the shape of the TMR\nand its amplitude are sensitive to H0 ; most surprisingly,\nthe peak value of the TMR increases dramatically during\nthe down sweep, almost doubling in value compared with\nthe peak TMR obtained during the sweep up. The behavior in both samples suggests that the magnetization\nof the upper Ga1−x Mnx As layer does not remain in a\nstable state while the magnetic field is swept down. We\nnote that in the control sample where the MnAs layer\nis etched away, this quasi-reversible behavior disappears,\nshowing a minor TMR similar to that reported by in earlier studies of Ga1−x Mnx As MTJs [12]. We now develop\na qualitative argument that links the minor loop TMR\nin these devices to the unwinding of an exchange spring\nin the upper Ga1−x Mnx As layer.\nWe begin with a picture of the magnetization in the\n\n[100]\n\n(a)\n\n(b)\n\nMnAs\n\nMnAs\n~225o\n\nH ~[110]\nd1\n~0o\n\nd1\ntop\nGaMnAs\n\n~45o\n\n~135o\n\n[010]\n\n~135o\n\nd2\n\nd2\n\n100\n\n(c)\n\nMnAs\n\n~180\n\no\n\nd1\nd2\n\nTMR Ratio (%)\n\nMinor loop TMR (%)\n\n15\n\n(d)\n\n80\n60\n\nb\n\n40\n\na\n\n20\n\nc\n\n0\n-20\n-1000\n\n0\n\n1000\nH (Oe)\n\n2000\n\nFIG. 4: (Color online) (a)(b)(c) Illustrations of the switching of magnetization in three different field ranges. The red\n(green) arrows represent the top (bottom) Ga1−x Mnx As layer\nrespectively. The twisted spins in the top Ga1−x Mnx As layer\nare depicted in the right part of the figures, forming a springlike configuration with variable depths. (d) Major loop (circles) and minor loops (lines) of sample C starting from different representing field regions (a,b,c)\n\n\f4\nupper Ga1−x Mnx As layer. When the magnetic field\nis swept above a characteristic coercive field, we speculate that the exchange coupling of this layer with\nthe MnAs layer results in an unusual exchange spring\nconfiguration that consists of a partial domain wall of\nwidth d1 (H) in the vertical direction and a complete\ndomain of width d2 (H) produced by the anisotropy of\nthe Ga1−x Mnx As layer (Fig. 4). It is reasonable to\nassume that both these domain widths (d1 and d2 ) are\nfield-dependent. The width of the complete domain d2\nincreases with magnetic field while the width of the partial domain wall d1 diminishes. However, unlike complete exchange springs that exhibit fully reversible behavior with a disappearance of hysteresis [3], the system\nstudied here can follow a more complex quasi-reversible\nreturn path: when the magnetic field is swept down, the\ncomplete domain state may maintain a fixed width d2\nand rotate as a single domain, while the exchange spring\nunwinds. When combined with the inherent cubic and\nuniaxial magnetic anisotropy of Ga1−x Mnx As , as well\nthe the TAMR effect [4], this results in minor loop TMR\nthat can differ greatly in magnitude and shape from the\nmajor loop TMR.\nThis is best illustrated by the dramatic dependence\nof the minor loop peak TMR ratio on H0 in sample C\nat the lowest temperatures. In Figs.4 (a)-(c), we illustrate the switching of magnetization for three different\nvalues of H0 ; the respective TMR for these three minor\nloops is shown in Fig.4(d). The external field is applied\nalong [110] with a small misalignment angle. Since the\ndirection of the MnAs magnetization is fixed after saturating at −3 kOe, the angles of the magnetization of\nGa1−x Mnx As layers are described with respect to the\nMnAs magnetization. When the field is swept up after\nreversal, the first abrupt jump in TMR corresponds to\nthe nucleation and propagation of a ∼ 90◦ domain wall\nwithin the bottom Ga1−x Mnx As layer. This leads to\nan abrupt switching of its magnetization from ∼ 45◦ to\n∼ 135◦ , as indicated by the green arrows in Fig.4(a).\nThe magnetization of the top layer also rotates inhomogeneously through a small angle, forming a relatively\nwide partial domain wall. When a minor loop starts from\nthis configuration (sweeping down), the M of the bottom\nlayer simply switches back to ∼ 45◦ , giving a square hysteresis loop (green curve in Fig.4(d)). In this regime, the\nTMR magnitude does not vary much with the reversible\nunwinding of the slightly twisted exchange spring in the\nupper layer.\nFor larger values of H0 that lie in the major loop\nTMR plateau (200 Oe . H0 . 700 Oe), the magnetization of the bottom layer gradually rotates to the\nsecond energy minimum, aligning itself at an angle of\n∼ 225◦ (Fig.4(b)). The presence of a uniaxial anisotropy\nin Ga1−x Mnx As (in addition to the cubic anisotropy)\ncauses this second 90◦ switching through coherent rotation, rather than domain wall nucleation. This is accom-\n\npanied by an additional twisting of the exchange spring in\nthe upper layer. We speculate that the complex plateau\nin the major loop over that field range is a result of the\ninterplay of both top and bottom Ga1−x Mnx As layers\nrotating in the same direction. When the minor loop is\ninitiated with H0 in this regime, the magnetization of the\nlower layer is pinned in its energy minimum at ∼ 225◦\nuntil the field reverses. In the upper layer, however, the\ncomplete domain rotates coherently to an energy minimum at ∼ 45◦ . Because of the TAMR effect and the\nlarger angle between the two magnetizations, it yields\na larger peak TMR (yellow and blue curves in Fig.4(d))\nthan that seen during the major loop. Further, the width\nd2 (H) of the complete domain – and correspondingly the\nmagnetization along [1̄00] – increases with H0 . Using the\nheuristic Julliere model [13], this increase in magnetization (and the accompanying increase in spin polarization)\nexplains the increase in the TMR peak value with increasing H0 (inset in Fig.3(b)). The increase in peak TMR\nwith H0 is however not monotonic and reaches a maximum value for H0 ∼ 700 Oe, beyond which we observe a\nslight decrease in the peak TMR (inset in Fig.3(b)). We\nmay reasonably assume that even though the width d2 of\nthe complete domain increases with H0 , only a portion\nof this complete domain can rotate coherently, limited to\na critical thickness dc . Consequently, the peak TMR is\nmaximum when d2 = dc . We do not have a detailed explanation for the slight decrease in peak TMR at higher\nvalues of H0 , but it is consistent with the existence of\npinning sites for small domains.\nOur qualitative model also explains the observed temperature dependence of the minor loop TMR (see inset to\nFig.3(b)). With increasing temperature, the peak value\nof the minor loop TMR of sample C becomes less dependent on the starting field, similar to the behavior observed at all temperatures in sample A (inset to Fig.3(a)).\nWe note that – at these higher temperatures – the overall character of the minor loop TMR in sample C still\nremains quasi-reversible (data not shown) and resembles\nthat obtained for sample A at all temperatures. We attribute these observations to a rapid decrease in the cubic anisotropy with increasing temperature relative to\nthe change in the uniaxial anisotropy [14]: this reduces\nTAMR contributions by removing the lack of symmetry\nbetween the two easy axes. A puzzling aspect of our\ndata is the contrast in minor loop TMR between samples\nA and C at the lowest temperature, particularly given\nthat the only structural difference between the two samples is the tunnel barrier. We do not currently have a\nconvincing explanation for this difference, but note that\nthe magnetic anisotropy of Ga1−x Mnx As is a sensitive\nfunction of hole density. Studies of epitaxially grown\nheterostructures containing Ga1−x Mnx As have shown\na large variability in hole-compensating Mn interstitial\nconcentrations that depends on the details of the heterostructure. It is thus possible that the lack of TAMR\n\n\f5\nin sample A may arise from a lack of cubic anisotropy\nin the lower Ga1−x Mnx As layer, resulting in Fermi-level\ndriven differences in Mn interstitial diffusion during the\novergrowth of AlAs. It is also possible that contributions\nof TAMR are sensitive to the nature of the tunnel barrier,\nalthough calculations of TAMR for GaAs and AlAs tunnel barriers do not suggest an obvious explanation[15].\nThis research has been supported by the ONR MURI\nprogram N0014-06-1-0428 through subcontract KK6135\nwith the University of California, Santa Barbara. This\nwork was performed in part at the Penn State Nanofabrication Facility, a member of the NSF National Nanofabrication Infrastructure Network.\n\n∗\nElectronic address: nsamarth@psu.edu\n[1] J. Foros, A. Brataas, Y. Tserkovnyak, and G. E. W.\nBauer, arxiv:0803.2175.\n[2] P. M. Levy and S. F. Zhang, Phys. Rev. Lett. 79, 5110\n(1997).\n[3] E. E. Fullerton, J. S. Jiang, M. Grimsditch, C. H. Sowers,\nand S. D. Bader, Phys. Rev. B 58, 12193 (1998).\n[4] C. Rüster, C. Gould, T. Jungwirth, J. Sinova, G. M.\nSchott, R. Giraud, K. Brunner, G. Schmidt, and L. W.\n\nMolenkamp, Phys. Rev. Lett. 94, 027203 (2005).\n[5] K. V. O'Donovan, J. A. Borchers, C. F. Majkrzak,\nO. Hellwig, and E. E. Fullerton, Phys. Rev. Lett. 88,\n067201 (2002).\n[6] D. D. Awschalom and M. E. Flatte, Nature Physics 3,\n153 (2007).\n[7] E. Y. Tsymbal, O. N. Mryasov, and P. R. LeClair, J.\nPhys: Condens. Matter 15, R109 (2003).\n[8] M. Zhu, M. J. Wilson, B. L. Sheu, P. Mitra, P. Schiffer,\nand N. Samarth, Appl. Phys. Lett. 91, 192503 (2007).\n[9] K. F. Eid, M. B. Stone, K. C. Ku, O. Maksimov, P. Schiffer, N. Samarth, T. C. Shih, and C. J. Palmstrom, Appl.\nPhys. Lett. 85, 1556 (2004).\n[10] M. Tanaka and Y. Higo, Phys. Rev. Lett. 87, 026602\n(2001).\n[11] D. Chiba, F. Matsukura, and H. Ohno, Physica E (Amsterdam) 21, 966 (2004).\n[12] Y. Higo, H. Shimizu, and M. Tanaka, J. Appl. Phys. 89,\n6745 (2001).\n[13] M. Julliëre, Phys. Lett. 54A, 225 (1975).\n[14] M. Sawicki, K.-Y. Wang, K. W. Edmonds, R. P. Campion, C. R. Staddon, N. R. S. Farley, C. T. Foxon, E. Papis, E. Kamińska, A. Piotrowska, et al., Phys. Rev. B 71,\n121302 (2005).\n[15] P. Sankowski, P. Kacman, J. A. Majewski, and T. Dietl,\nPhys. Rev. B 75, 045306 (2007).\n\n\f"}