{"id": "http://arxiv.org/abs/1104.4998v1", "guidislink": true, "updated": "2011-04-26T19:24:49Z", "updated_parsed": [2011, 4, 26, 19, 24, 49, 1, 116, 0], "published": "2011-04-26T19:24:49Z", "published_parsed": [2011, 4, 26, 19, 24, 49, 1, 116, 0], "title": "Inverse problem in cylindrical electrical networks", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1104.4704%2C1104.4602%2C1104.1258%2C1104.1210%2C1104.1434%2C1104.2107%2C1104.3106%2C1104.1672%2C1104.4982%2C1104.0701%2C1104.3067%2C1104.0265%2C1104.0671%2C1104.0751%2C1104.2673%2C1104.4380%2C1104.2127%2C1104.1297%2C1104.0360%2C1104.1477%2C1104.0655%2C1104.1354%2C1104.5640%2C1104.1475%2C1104.2636%2C1104.3756%2C1104.1194%2C1104.0364%2C1104.5338%2C1104.1005%2C1104.4948%2C1104.0002%2C1104.3592%2C1104.3225%2C1104.1848%2C1104.0923%2C1104.0940%2C1104.2661%2C1104.3697%2C1104.0239%2C1104.2293%2C1104.0285%2C1104.0764%2C1104.1936%2C1104.4376%2C1104.0384%2C1104.4848%2C1104.4621%2C1104.2420%2C1104.5643%2C1104.3538%2C1104.4128%2C1104.4813%2C1104.1633%2C1104.1346%2C1104.0492%2C1104.2070%2C1104.3650%2C1104.3884%2C1104.3316%2C1104.1104%2C1104.3253%2C1104.2274%2C1104.1021%2C1104.3368%2C1104.4459%2C1104.5443%2C1104.1833%2C1104.5410%2C1104.4998%2C1104.4130%2C1104.2708%2C1104.2671%2C1104.2237%2C1104.1767%2C1104.4203%2C1104.1030%2C1104.1011%2C1104.3735%2C1104.3103%2C1104.4176%2C1104.1948%2C1104.3662%2C1104.2128%2C1104.2427%2C1104.1584%2C1104.0324%2C1104.0856%2C1104.3736%2C1104.5142%2C1104.3957%2C1104.5287%2C1104.3324%2C1104.0505%2C1104.1785%2C1104.3492%2C1104.3263%2C1104.5047%2C1104.1909%2C1104.0519%2C1104.3888&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Inverse problem in cylindrical electrical networks"}, "summary": "In this paper we study the inverse Dirichlet-to-Neumann problem for certain\ncylindrical electrical networks. We define and study a birational\ntransformation acting on cylindrical electrical networks called the electrical\n$R$-matrix. We use this transformation to formulate a general conjectural\nsolution to this inverse problem on the cylinder. This conjecture extends work\nof Curtis, Ingerman, and Morrow, and of de Verdi\\`ere, Gitler, and Vertigan for\ncircular planar electrical networks. We show that our conjectural solution\nholds for certain \"purely cylindrical\" networks. Here we apply the grove\ncombinatorics introduced by Kenyon and Wilson.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1104.4704%2C1104.4602%2C1104.1258%2C1104.1210%2C1104.1434%2C1104.2107%2C1104.3106%2C1104.1672%2C1104.4982%2C1104.0701%2C1104.3067%2C1104.0265%2C1104.0671%2C1104.0751%2C1104.2673%2C1104.4380%2C1104.2127%2C1104.1297%2C1104.0360%2C1104.1477%2C1104.0655%2C1104.1354%2C1104.5640%2C1104.1475%2C1104.2636%2C1104.3756%2C1104.1194%2C1104.0364%2C1104.5338%2C1104.1005%2C1104.4948%2C1104.0002%2C1104.3592%2C1104.3225%2C1104.1848%2C1104.0923%2C1104.0940%2C1104.2661%2C1104.3697%2C1104.0239%2C1104.2293%2C1104.0285%2C1104.0764%2C1104.1936%2C1104.4376%2C1104.0384%2C1104.4848%2C1104.4621%2C1104.2420%2C1104.5643%2C1104.3538%2C1104.4128%2C1104.4813%2C1104.1633%2C1104.1346%2C1104.0492%2C1104.2070%2C1104.3650%2C1104.3884%2C1104.3316%2C1104.1104%2C1104.3253%2C1104.2274%2C1104.1021%2C1104.3368%2C1104.4459%2C1104.5443%2C1104.1833%2C1104.5410%2C1104.4998%2C1104.4130%2C1104.2708%2C1104.2671%2C1104.2237%2C1104.1767%2C1104.4203%2C1104.1030%2C1104.1011%2C1104.3735%2C1104.3103%2C1104.4176%2C1104.1948%2C1104.3662%2C1104.2128%2C1104.2427%2C1104.1584%2C1104.0324%2C1104.0856%2C1104.3736%2C1104.5142%2C1104.3957%2C1104.5287%2C1104.3324%2C1104.0505%2C1104.1785%2C1104.3492%2C1104.3263%2C1104.5047%2C1104.1909%2C1104.0519%2C1104.3888&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "In this paper we study the inverse Dirichlet-to-Neumann problem for certain\ncylindrical electrical networks. We define and study a birational\ntransformation acting on cylindrical electrical networks called the electrical\n$R$-matrix. We use this transformation to formulate a general conjectural\nsolution to this inverse problem on the cylinder. This conjecture extends work\nof Curtis, Ingerman, and Morrow, and of de Verdi\\`ere, Gitler, and Vertigan for\ncircular planar electrical networks. We show that our conjectural solution\nholds for certain \"purely cylindrical\" networks. Here we apply the grove\ncombinatorics introduced by Kenyon and Wilson."}, "authors": ["Thomas Lam", "Pavlo Pylyavskyy"], "author_detail": {"name": "Pavlo Pylyavskyy"}, "author": "Pavlo Pylyavskyy", "arxiv_comment": "22 pages, 15 figures", "links": [{"href": "http://arxiv.org/abs/1104.4998v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1104.4998v1", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "math.CO", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "math.CO", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1104.4998v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1104.4998v1", "journal_reference": null, "doi": null, "fulltext": "INVERSE PROBLEM IN CYLINDRICAL ELECTRICAL NETWORKS\n\narXiv:1104.4998v1 [math.CO] 26 Apr 2011\n\nTHOMAS LAM AND PAVLO PYLYAVSKYY\nAbstract. In this paper we study the inverse Dirichlet-to-Neumann problem for certain\ncylindrical electrical networks. We define and study a birational transformation acting on\ncylindrical electrical networks called the electrical R-matrix. We use this transformation\nto formulate a general conjectural solution to this inverse problem on the cylinder. This\nconjecture extends work of Curtis, Ingerman, and Morrow [CIM], and of de Verdière,\nGitler, and Vertigan [dVGV] for circular planar electrical networks. We show that our\nconjectural solution holds for certain \"purely cylindrical\" networks. Here we apply the\ngrove combinatorics introduced by Kenyon and Wilson [KW].\n\n1. Introduction\nIn this paper we consider the simplest of electrical networks, namely those that consist\nof only resistors. The electrical properties of such a network N are completely described\nby the response matrix L(N), which computes the current that flows through the network\nwhen certain voltages are fixed at the boundary vertices of N.\nDe Verdière-Gitler-Vertigan [dVGV] and Curtis-Ingerman-Morrow [CIM] studied the\ninverse (Dirichlet-to-Neumann) problem for circular planar electrical networks. Specifically, they considered networks embedded in a disk without crossings, with boundary\nvertices located on the boundary of the disk. The following theorem summarizes their\nresults.\nTheorem.\n(1) Any circular planar electrical network is electrically equivalent to some critical\nnetwork, which is characterized by its medial graph being lenseless (see [dVGV,\nThéorème 2]).\n(2) Any two circular planar electrical networks having the same response matrix can be\nconnected by simple local transformations: series-parallel, loop removal, pendant\nremoval, and star-triangle transformations discussed in Section 2.2. Furthermore,\nif both networks are critical, then only star-triangle transformations are required\n(see [dVGV, Théorème 4] or [CIM, Theorem 1]).\n(3) The edge conductances of a critical circular planar electrical network can be recovered uniquely from the response matrix (see [CIM, Theorem 2] or [dVGV,\nThéorème 3]).\n(4) The response matrices realizable by circular planar networks are the ones having\nall circular minors nonnegative (see [CIM, Theorem 3]).\n(5) The space Y of response matrices of circular planar networks has a stratification by\ni\ncells Y = ⊔Ci where each Ci ≃ Rd>0\ncan be obtained as the set of response matrices\nT.L. was partially supported by NSF grant DMS-0901111, and by a Sloan Fellowship.\nP.P. was partially supported by NSF grant DMS-0757165.\n1\n\n\f2\n\nTHOMAS LAM AND PAVLO PYLYAVSKYY\n\nfor a fixed critical network with varying edge weights (see [dVGV, Théorème 3 and\n5] or [CIM, Theorem 4]).\nIt is an open problem to extend these results to electrical networks embedded in surfaces\nwith more complicated topology. In this paper we make progress towards understanding\nthe inverse problem for networks embedded in a cylinder. Our first main result is to\nconstruct a birational transformation we call the electrical R-matrix. This transformation\nacts on the edge weights of a local portion of an electrical network embedded into the\ncylinder, preserving all the electrical properties of the network (Corollary 5.4). Furthermore, this electrical R-matrix satisfies the Yang-Baxter relation (Theorem 4.5), and is a\nclose analogue of the \"geometric R-matrices\" of affine crystals, to be explained below.\nUsing the electrical R-matrix, we formulate the following general conjecture. A more\nprecise version is given as Conjecture 6.3.\nConjecture.\n(1') Any cylindrical electrical network is electrically equivalent to a critical cylindrical\nelectrical network.\n(2') Any two cylindrical electrical networks G and G′ with the same universal response\nmatrices are connected by local electrical equivalences. Furthermore, if G and G′\nare both critical, then only star-triangle transformations, and electrical R-matrix\ntransformations are needed.\n(3') If a cylindrical electrical network is critical, then the edge conductances can be\nrecovered up to the electrical R-matrix action.\n(5') The space X of universal response matrices of cylindrical electrical networks has\ni\ni\nan infinite stratification by X = ⊔Ci where each Ci ≃ Rd>0\n× Re≥0\nis a semi-closed\ncell that can be obtained as the set of universal response matrices for a fixed critical\nnetwork with varying edge weights.\nThe naive analogue of (4) does not hold – see Section 5.2. The universal response matrix\nin the Conjecture is the response matrix of the universal cover of the cylindrical network\nG. Roughly speaking, it allows us to not only measure the current flowing through the\nboundary vertices, but also how many times the current has winded around the cylinder.\nIt may be possible to formulate this in a more electrically natural way by measuring\nmagnetic fields.\nThus the key difference between the planar and the cylindrical cases is that even for\na critical network on a cylinder the edge conductances may not be uniquely determined\nfrom the response matrix. This non-uniqueness comes from the existence of the electrical\nR-matrix, the action of which preserves both the underlying graph of the network and\nthe response matrix, while changing the edge conductances. The action of the electrical\nR-matrix can on the one hand be thought of as a Galois group, and on the other hand as\na monodromy group.\nOur second main result is to establish the above Conjecture for a certain class of\ncylindrical networks we denote N(m). These critical networks can be thought of as the\n\"purely cylindrical\" networks. There is no local configuration for which the star-triangle\ntransformation can be applied in N(m), but the electrical R-matrix generates an action\nof the symmetric group Sm . We show in Theorem 6.2 that for the networks N(m) the\nedge conductances are recovered uniquely from the universal response matrix modulo\nthis Sm action, and in particular the inverse problem has generically m! solutions. One\n\n\fINVERSE PROBLEM IN CYLINDRICAL ELECTRICAL NETWORKS\n\n3\n\nway to formulate our main conjecture is that the networks N(m) exactly encapsulate the\ndifference between the planar and cylindrical cases.\nThe proof of Theorem 6.2 occupies the technical heart of the paper: we express the\nedge conductances as limits of certain rational functions of the universal response matrix\n(Theorem 5.11). Here we use crucially the work of Kenyon and Wilson [KW, KW2].\nKenyon and Wilson study groves in circular planar electrical networks. These are forests\nwhose connected components contain specified boundary vertices. Kenyon and Wilson\nconnect ratios of grove generating functions with the response matrix of the corresponding\nnetwork. By a careful choice of grove generating functions, we can recover the desired\nedge conductances.\nRecall that a matrix is totally nonnegative if every minor of it is nonnegative. There is a\nmysterious similarity between electrical networks and a different kind of networks arising\nin the theory of totally nonnegative matrices. In [LP11a+], we presented an approach to\nunderstanding this similarity via Lie theory. Whereas the theory of total nonnegative is\nintimately related to the class of semisimple Lie groups ([Lus]), we suggested in [LP11a+]\nthat a different class of \"electrical Lie groups\" is related to electrical networks. These\nelectrical Lie groups are certain deformed versions of the maximal unipotent subgroup of\na semisimple Lie group.\nThe main ideas of the present work are also motivated by this analogy, though our\nphilosophy here is more combinatorial in nature. The construction of the electrical Rmatrix follows the techniques developed in [LP10+]. There we constructed, using purely\nnetwork-theoretic methods, the geometric (or birational) R-matrix of a tensor product of\naffine geometric crystals for the symmetric power representations of Uq′ (slˆn ). In this paper,\nwe use electrical networks instead of the \"totally nonnegative\" networks of [LP10+], but\nnevertheless the underlying combinatorics is developed in parallel. We plan to expand on\nthis analogy in [LP11b+].\nOur formulation of Conjecture 6.3 is also motivated by the analogy with total nonnegativity. Indeed, analogues of (1')-(5') (and even the missing (4')!) for the totally\nnonnegative part of the rational loop group are established in [LP08+, LP10+]. In particular, in [LP08+] we studied in detail from the totally nonnegative perspective, the\nnetworks N(m), or more precisely, their medial graphs. Our solution here to the inverse\nproblem for the networks N(m) follows the strategy in [LP08+], where edge weights are\nrecovered by taking limits of ratios of matrix entries; this approach was originally applied by Aissen-Schoenberg-Whitney [ASW] to classify totally positive functions. The\nsituation we consider here is technically much more demanding, involving rather intricate\nKenyon-Wilson grove combinatorics.\nAcknowledgements.\nWe cordially thank Michael Shapiro for stimulating our interest in the problem.\n2. Electrical networks\nFor more background on electrical networks, we refer the reader to [CIM, dVGV, KW].\n2.1. Response matrix. For our purposes, an electrical network is a finite weighted undirected graph N, where the vertex set is divided into the boundary vertices and the interior\nvertices. The weight w(e) of an edge is to be thought of as the conductance of the corresponding resistor, and is generally taken to be a positive real number. A 0-weighted edge\n\n\f4\n\nTHOMAS LAM AND PAVLO PYLYAVSKYY\n\nwould be the same as having no edge, and an edge with infinite weight would be the same\nas identifying the endpoint vertices.\nWe define the Kirchhoff matrix K(N) to be the square matrix with rows and columns\nlabeled by the vertices of N as follows:\n(P\nfor i 6= j\ne joins i and j w(e)\nP\nKij =\n− e incident to i w(e) for i = j.\n\nLet M be a square n × n matrix, and I ⊂ {1, 2, . . . , n}. Recall that the Schur comple−1\nment M/MI,I is the square n − |I| matrix defined to be M[n]−I,[n]−I − M[n]−I,I MI,I\nMI,[n]−I ,\nwhere MJ,K denotes the submatrix of M consisting of the rows labeled by J and the\ncolumns labeled by K. We define the response matrix L(N) to be the square matrix with\nrows and columns labeled by the boundary vertices of N, given by the Schur complement\nL(N) = K/KI\nwhere KI denotes the submatrix of K indexed by the interior vertices. The response\nmatrix encodes all the electrical properties of N that can be measured from the boundary vertices. Note that our Kirchhoff and response matrices are the negative of those\ncommonly used in the literature.\n2.2. Local electrical equivalences of networks. We now discuss the local transformations of electrical networks which leave the response matrix invariant. The following\nproposition is well-known and can be found for example in [dVGV].\na\n\na+b\n\na\n\nb\n\nab/(a + b)\n\nb\n\nFigure 1. Series-parallel transformations, loop and pendant removal.\nProposition 2.1. Series-parallel transformations, removing loops, and removing interior\ndegree 1 vertices, do not change the response matrix of a network. See Figure 1.\nC\na\n\nb\nB\n\nA\n\nc\n\nFigure 2. The Y − ∆, or star-triangle, transformation.\nThe most interesting local transformation is attributed to Kennelly [Ken].\n\n\fINVERSE PROBLEM IN CYLINDRICAL ELECTRICAL NETWORKS\n\n5\n\nProposition 2.2 (Y − ∆ transformation). Assume parameters a,b,c,A,B and C are related by\nbc\nac\nab\nA=\n, B=\n, C=\n,\na+b+c\na+b+c\na+b+c\nor equivalently by\nAB + AC + BC\nAB + AC + BC\nAB + AC + BC\n, b=\n, c=\n.\na=\nA\nB\nC\nThen switching a local part of an electrical network between the two options shown in\nFigure 2 does not affect the response of the whole network.\n2.3. Tetrahedron relation for electrical networks.\nProposition 2.3 (Tetrahedron relation). The sequence of Y − ∆ transformations shown\nin Figure 3 returns the conductances of edges to their original values.\n\nFigure 3.\nProof. Direct computation.\n\n\u0003\n\nRemark 2.1. In the terminology of Kashaev, Korepanov, and Sergeev [KKS], the proposition states that the Y − ∆ transformation is a solution of type (ǫ) to the functional\ntetrahedron equation.\n3. Kenyon-Wilson L-polynomials\n3.1. Groves. A planar partition of [n] = {1, 2, . . . , n} is a partition τ = {τ1 , τ2 , . . . , τk }\nsuch that there do not exist i < j < k < l such that i, k belong to the same part of τ ,\nand k, l belong to the same part.\nA circular planar electrical network N is an electrical network embedded into a disk, so\nthat the intersection of N with the boundary of the disk is exactly the boundary vertices\nof N. We suppose that the boundary vertices of N are exactly [n], and that these vertices\nare arranged in order around the boundary of the disk.\n\n\f6\n\nTHOMAS LAM AND PAVLO PYLYAVSKYY\n\nA grove in N is a spanning forest where each connected component intersects the\nboundary. A grove Γ has boundary planar partition τ = {τ1 , τ2 , . . . , τk } if the connected\ncomponents Γ = ⊔Γi of Γ are such that Γi contains the boundary vertices labeled by τi .\nThe weight of the grove is the product of the weights of its edges. Kenyon and Wilson\n[KW] study the probability Pr(τ ) that a random grove of N is of type τ , where the\nprobability of a grove is proportional to its weight.\nLet \"uncrossing\" denote the partition of [n] into singletons.\nTheorem 3.1. [KW, Theorem 1.1, Lemma 4.1] Let G be a finite circular planar electrical\nnetwork.\n....\n(1) The ratio Pr(τ ) := Pr(τ )/Pr(uncrossing) is an integer-coefficient polynomial in\nthe Lij (G), homogeneous of degree n − #parts of τ .\n(2) Suppose τ be a planar partition with parts of size at most two. Then the polynomial\nof (1) depends only on Lij (G), for i, j's which are not isolated parts of τ .\n3.2. A bound on certain Kenyon-Wilson polynomials. Recall from [KW] that for\na partition τ , we define\nX Y\n(1)\nLτ =\nLi,j\nF\n\n{i,j}∈F\n\nwhere the sum is over spanning forests F of the complete graph, for which the trees of F\nspan the parts of τ , and the product is over the edges of F .\nLet's recall Rule 1 from [KW, p.5]. If a partition τ is non-planar then one can pick\na < b < c < d so that a, c belong to one part of τ , and b, d belong to another part of τ .\nArbitrarily subdivide the part containing a and c into two sets A and C so that a ∈ A\nand c ∈ C, and similarly obtain B and D. Denote the remaining parts of the partition τ\nby \"rest\". Then the rule is\nAC|BD|rest → A|BCD|rest + B|ACD|rest + C|ABD|rest + D|ABC|rest\n−AB|CD|rest − AD|BC|rest.\nIterating this rule transforms each non-planar partition τ into a linear combination of\nplanar ones, and Kenyon and Wilson show that the coefficients do not depend on how\nRule 1 is applied. Denote by Pσ,τ the coefficient of a planar partition σ in the application\nof Rule 1 to τ .\n....\nP\nTheorem 3.2 ([KW, Theorem 1.2]). We have Pr(σ) = τ Pσ,τ Lτ .\n\nLemma 3.3. Let S be a cyclic interval. Suppose that a planar partition σ is such that\nno part p of σ contains two elements of S. Let τ be a possibly nonplanar partition such\nthat σ occurs in the expansion of τ under repeated application of Rule 1 (until no more\napplications are possible). Then τ does not contain any part p such that |p ∩ S| ≥ 2.\nProof. By [KW, Theorem 1.2], the result of repeatedly applying Rule 1 does not depend\non the choices made when applying Rule 1. Let us suppose that τ contains a part p such\nthat |p ∩ S| ≥ 2. In applying Rule 1, if we ever encounter that a, c ∈ p, we will first\ntry to choose A and C so that |A ∩ S| ≥ 2 or |C ∩ S| ≥ 2. This would guarantee that\nall the partitions occurring in Rule 1 contain some part p′ such that |p′ ∩ S| ≥ 2. This\nchoice is impossible only if a, c ∈ S, which would in turn imply that b or d lies in S. But\nin this case again all the partitions occurring in Rule 1 contain some part p′ such that\n|p′ ∩ S| ≥ 2. Thus σ cannot occur in the expansion of τ .\n\u0003\n\n\fINVERSE PROBLEM IN CYLINDRICAL ELECTRICAL NETWORKS\n\n7\n\nLemma 3.4. Suppose σ is a partition such that the non-singleton\n....parts of σ contain at\nmost K elements. Then there is a constant cK such that when Pr(σ) is expanded as a\npolynomial in the Lij 's the coefficient of any monomial in the Lij 's is less than or equal\nto cK .\nProof. Denote the set of boundary vertices by S, and by T ⊂ S the elements in the nonsingleton parts of σ. Applying Lemma 3.3, we see that every τ , such that σ occurs in\nthe Rule 1 expansion of τ , have parts that contain at most one element from each cyclic\ncomponent of S −T . Since the number of cyclic components is bounded by K, we see that\nthere is a bound, depending only on K, on the number of combinatorial types of possible\nτ 's. Here combinatorial type means the partition one obtains when singletons in S − T\nare removed, and only the relative orders of the remaining elements are remembered. It\nfollows that one can find a constant cK so that the coefficient of σ in the Rule 1 expansion\nof τ is bounded by cK , for any τ .\nNext we note that for the sum of (1), the edges of F determine F , which in turn\ndetermines τ . So each monomial in the Lij 's occurs in at most one Lτ . Thus the coefficient\nof any monomial in the Lij 's is bounded by cK .\n\u0003\n4. Electrical R-matrix\nThe ideas of this section follow closely the calculation of the \"whurl transformation\"\nin [LP10+]. In a special case the whurl transformation reduces to the birational, or\ngeometric R-matrix of certain affine geometric crystals. This motivates the terminology\nof an electrical R-matrix.\n4.1. The R-transformation. Fix n ≥ 1 and m ≥ 1. We define an electrical network\ndenoted N(m) which is embedded in a cylinder. It has 2n boundary vertices all lying\non the boundary of the cylinder, with 1, 2, . . . , n on the left boundary component and\n1′ , 2′ , . . . , n′ on the right boundary component. There are (m − 1)n internal vertices,\n(j)\ndenoted Mi where 1 ≤ j ≤ m − 1 and 1 ≤ i ≤ n. For convenience, the boundary\n(0)\nvertices 1, 2, . . . , n are denoted Mi and the boundary vertices 1′ , 2′ , . . . , n′ are denoted\n(m)\n(j)\n(j+1)\nMi . For each i = 1, 2, . . . , n and j = 0, 1, . . . , m−1, we have edges from Mi to Mi\n,\n(j)\n(j+1)\nand from Mi to Mi−1 . Here all lower indices are taken modulo n.\n(1)\n\n(m−1)\n\nMn\nn\n\n(2)\nMn\n(1)\nM1\n\n1\n\nn′\n\n(m−1)\nM1\n\n(2)\n\n1′\n\nM1\n\n2\n(1)\n\nM2\n4\n\nMn\n\n3\n(1)\n\nM3\n\n(2)\nM2\n\n(m−1)\n\nM2\n\n2′\n\n(m−1)\n\nM3\n\nFigure 4. The cylindrical network N(m).\nNow we focus on the network N(2). We label the edge weights of N(2) as follows. For\n(1)\neach i = 1, 2, . . . , n, we have edges with weights ai from i to Mi−1 , weights bi from i to\n(1)\n(1)\n(1)\nMi , weights ci+1 from Mi to i′ , and weights di from Mi to (i − 1)′ . Here all indices\nare taken modulo n.\n\n\f8\n\nTHOMAS LAM AND PAVLO PYLYAVSKYY\n\nNow define polynomials κi (a, b, c, d) and τi (a, b, c, d) as follows:\nτi =\n\nn−1\nX\n\ni+j−1\n\n(ai+j + ci+j )\n\nj=0\n\nand\n\nY\n\n(ak ck )\n\nk=i\n\ni+n−1\nY\n\n(bk dk ) + (bi+j\n\nk=i\n\nk=i+j\n\nκi = (ai + ci )\n\ni+n−1\nY\n\n(ak ck ) + (bi + di )\n\n+\n\ni+j−1\n\n(ai+j + ci+j )\n\nj=1\n\nY\n\n(ak ck )\n\nk=i+1\n\nAlso define\n\ni+n−1\nY\n\ni+n−1\nY\n\n(bk dk ) + (bi+j + di+j )\n\ni+j\nY\n\n(ak ck )\n\nk=i+1\n\nY\n\nai ci +\n\ni\n\nExample 4.1. Suppose n = 2. Then\n\n(bk dk )\n\nk=i+j+1\n\n!\n\n(bk dk )\n\nk=i+j\n\nQ=−\n\ni+n−1\nY\n\nk=i+1\n\nk=i+1\n\nn−1\nX\n\ni+j\nY\n+ di+j ) (ak ck )\n\nY\n\ni+n−1\nY\n\n(bk dk )\n\nk=i+j+1\n\n!\n\nbi di .\n\ni\n\nτ1 = (a1 + c1 )b1 d1 b2 d2 + (b1 + d1 )a1 c1 b2 d2 + (a2 + c2 )a1 c1 b2 d2 + (b2 + d2 )a1 c1 a2 c2 ,\nκ1 = (a1 + c1 )a2 c2 + (b1 + d1 )b2 d2 + (a2 + c2 )b2 d2 + (b2 + d2 )a2 c2 .\nNow introduce additional parallel wires with parameters p and −p from 1 to n′ . This is\na special case of the local electrical equivalence for parallel resistors. (Here the parameters\np and −p should be considered formally, instead of as nonnegative real numbers.) We\nmay perform Y − ∆ operations to move the parameter p through the resistor network, as\nshown in Figure 5.\nan\n\ncn\n\nan\n\ncn\n\nan\n\ncn\n\nan\n\nbn\n\ndn\n\nbn\n\ndn\n\nbn\n\ndn\n\nd′n\n\na′1\n\nc′1\n\nd1\n\nb1\n\na1\n\nc1\n\na1 p c 1\n\nq0\nc′1\n−p\n\nb1\n\nd1\n\nb1 −p d1\n\nb1\n\na2\n\nc2\n\na2\n\nc2\n\na2\n\nc2\n\nb2\n\nd2\n\nb2\n\nd2\n\nb2\n\nd2\n\np1\n\ncn\n\nc′n\n\na′n\n\nc′n\n\na′n\n\nc′n\n\na′n\n\nb′n\n\nd′n\n\nb′n\n\nd′n\n\nb′n\n\nd′n\n\nb′n\n\na′1\n\nc′1\n\na′1\n\nc′1\n\na′1\n\nc′1\n\na′1\n\nd′1 p b′1\n\nd′1\n\nb′1\n\nc′2\n\na′2\n\nc′2\n\na′2\n\nd′2\n\nb′2\n\nd′2\n\nb′2\n\n−p\n−p\n\nd1\n\nb1\n\na2\n\nc2\n\nc′2\n\nd1\nqn−1\na′2\n\nb2\n\nd2\n\nd′2\n\nb′2\n\n−p\n\nFigure 5. Calculating the electrical R-matrix via certain \"virtual\" electrical networks.\nLemma 4.2. There is a unique non-zero parameter p, which is unchanged after moving\nthrough one revolution.\nProof. Let us denote by pi the value of the \"extra edge\" after 2i star-triangle transformations. (The fourth network in Figure 5 shows the location of p1 .) We claim that the\nparameter pi is a ratio of two linear functions in the original p = p0 . This is easily verified\nby induction using the star-triangle transformation. Thus after 2n star-triangle transformations the equation p = pn we obtain is either a linear or a quadratic equation, and zero\nis clearly one of the roots. Therefore there is at most one non-zero solution, and as we\nshall see soon in the proof of Theorem 4.3, a solution indeed exists.\n\u0003\n\n\fINVERSE PROBLEM IN CYLINDRICAL ELECTRICAL NETWORKS\n\n9\n\nSuppose we perform the sequence of Y − ∆ operations of Figure 5, using the parameter\np of Lemma 4.2 (which we still have to prove exists). Then as illustrated in the final\ndiagram of Figure 5, the \"extra edges\" with parameters p and −p can be removed via\nthe local electrical equivalence for parallel resistors. We define the electrical R-matrix to\nbe the transformation R(ai , bi , ci , di ) = (a′i , b′i , c′i , d′i ) induced on the edge weights by this\ntransformation.\nTheorem 4.3. The electrical R-matrix is given by\nτi\nτi\nτi+1\na′i =\nc′i =\nb′i =\nai κi\nci κi\nbi κi\n\nd′i =\n\nτi+1\n.\ndi κi\n\nProof. We claim that the parameter p = p0 = Q/κ1 is the parameter of Lemma 4.2.\nDefine pi to be the parameter after i pairs of ∆ − Y and Y − ∆ operations, and qi to be\nthe parameter obtained from pi by one ∆ − Y operation. Then\nqi = τ1−i /Q\n\npi = Q/κ1−i .\n\nIndeed, calculating by induction\nqi =\n\n(a1−i + c1−i )pi + (a1−i c1−i )\n(a1−i + c1−i )Q + (a1−i c1−i )κ1−i\nτ1−i\n=\n=\npi\nQ\nQ\n\nand similarly for pi = b1−i d1−i /(qi−1 + b1−i + d1−i ). We may then calculate that the\ntransformation is given by\na′1−i =\n\n(a1−i + c1−i )Q + a1−i c1−i κ1−i\nτ1−i\na1−i pi + c1−i pi + a1−i ci\n=\n=\na1−i\na1−i κ1−i\na1−i κ1−i\n\nand similarly c′1−i =\nb′1−i =\nand similarly d′1−i =\n\nτ1−i\n.\nc1−i κ1−i\n\nWe also have\n\nqi−1 d1−i\nτ2−i d1−i\nτ2−i\n=\n=\nqi−1 + d1−i + b1−i\nτ2−i + (d1−i + b1−i )Q\nb1−i κ1−i\nτ2−i b1−i\n.\nκ1−i\n\n\u0003\n\nProposition 4.4. The electrical R-matrix does not depend on where you attach the extra\npair of edges, and is an involution.\nProof. If one applies the Y − ∆ transformations to successively push through two edges,\nwith weights q and −q negative of each other, then there is no net effect on the weights\nof the other edges involved. Also, the weights on the two edges pushed through remain\nnegatives of each other. Thus if one pushes through p to perform the electrical R-matrix,\nand then a −p, the latter will perform a transformation that will undo the first one.\nFurthermore, a working choice of parameter p at one location this way yields a working\nchoice of the parameter at any other location. The uniqueness in Lemma 4.2 implies that\nall resulting electrical R-matrices are the same.\n\u0003\n4.2. Electrical R-matrix satisfies Yang-Baxter. Let us now consider the network\nN(3). The procedure of Section 4.1 gives two different electrical R-matrices acting on\n(0)\n(1)\n(2)\nN(3): by acting on the part of the network involving vertices Mi , Mi , Mi , or by\n(1)\n(2)\n(3)\nacting on the part of the network involving the vertices Mi , Mi , Mi . We denote\nthese R-matrices by R12 ⊗ 1 and 1 ⊗ R23 respectively.\n\n\f10\n\nTHOMAS LAM AND PAVLO PYLYAVSKYY\n\nTheorem 4.5. The electrical R-matrix satisfies the Yang-Baxter equation\n(R12 ⊗ 1) ◦ (1 ⊗ R23 ) ◦ (R12 ⊗ 1) = (1 ⊗ R23 ) ◦ (R12 ⊗ 1) ◦ (1 ⊗ R23 ).\nProof. First we note that to perform the electrical R-matrix, we can either add extra\nhorizontal edges with conductances p and −p between 1 and n′ , or we could split the\n(1)\nvertex M1 into three vertices and add vertical edges with conductances p and −p between\nthem (see Figure 6).\n\np\n\np\n\n−p\n\n−p\n\nFigure 6.\nTo perform the sequence of R-matrices (R12 ⊗ 1) ◦ (1 ⊗ R23 ) ◦ (R12 ⊗ 1), we will add\nhorizontal edges for the first and third factor, but add vertical edges for the second\nfactor. Let the corresponding weights be p, q, r as shown in Figure 7. According to\n\np\n\nr q\n−r −q\n−p\n\nq′\n−q ′\n\np′\nr′\n−r ′\n−p′\n\nFigure 7.\nLemma 4.2 and Theorem 4.3 and Proposition 4.4, these weights exist and are unique.\nNow, apply the ∆ − Y transformation as shown in Figure 7 to obtain weights p′ , q ′\nand r ′ , and their negatives on the other side. We claim that if these new weights are\npushed around the cylinder, they come out the same at the other end. This follows from\nProposition 2.3. Now if we push the weights p, q and r through and apply the ∆ − Y\ntransformations, we obviously get again the weights p′ , q ′ and r ′ . Thus by Lemma 4.2\nand Theorem 4.3 and Proposition 4.4, while pushing p′ , q ′ and r ′ through we are applying\n(1 ⊗ R23 ) ◦ (R12 ⊗ 1) ◦ (1 ⊗ R23 ). Since, by the electrical tetrahedron relation (Proposition\n2.3 ) the two results are the same, the claim of the theorem follows.\n\u0003\n\n\fINVERSE PROBLEM IN CYLINDRICAL ELECTRICAL NETWORKS\n\n11\n\nCorollary 4.6. The electrical R-matrix gives an action of the symmetric group Sm on\nN(m).\nProof. Follows from Theorem 4.5 and Proposition 4.4.\n\n\u0003\n\n5. Electrical ASW factorization\n5.1. Universal response matrix. Let G be a cylindrical electrical network. Thus G\nis an electrical network embedded into a cylinder so that the intersection of G with the\nboundary of the cylinder is exactly the boundary vertices of G. Let G(∞) denote the\nuniversal cover of G. It is an infinite periodic network embedded into an infinite strip.\nGiven finite sets V1 ⊂ V2 ⊂ . . . of vertices of G(∞) which eventually cover all vertices\nof G(∞), we obtain a sequence of truncations G(1), G(2), . . . of G(∞) as follows. We\nlet G(N) be the subgraph of G(∞) consisting of all edges incident to a vertex in VN .\nFurthermore, we declare a vertex of G(N) internal if it lies in VN and is internal in G(∞).\nEach G(N) is a finite planar electrical network.\nWe suppose that the boundary vertices of G(∞) are numbered Z = {. . . , −2, −1, 0, 1, 2, . . .}\non one side of the boundary, and by Z′ = {. . . , −2′ , −1′ , 0′, 1′ , 2′ , . . .} on the other side\nof the boundary. (We will always picture the infinite strip as vertical, with vertex labels\nincreasing as we go downwards.) We define the universal response matrix of G to be given\nby Lij where\nLij = lim Lij (G(N))\nN →∞\n\nwhere i, j denote vertices of G(∞). For sufficiently large N, any two fixed vertices of\nG(∞) will lie in G(N). These limits exist and are finite, due to following lemma.\nIf H is an electrical network, and V a subset of its vertices, the response matrix of H/V\nis the response matrix obtained by declaring all the vertices in V to be interior.\nLemma 5.1. Assume V ⊂ V ′ are two subsets of vertices of an electrical network H, and\nassume i and j are two vertices not contained in V ′ . Then L′ij in the response matrix of\nH/V ′ is at least as large as Lij in the response matrix of H/V .\nProof. The Schur complement with respect to some set V can be taken as a sequence of\nSchur complements with respect to single vertices in V in some order (see for example\n[CM, (3.7)]). Thus, it would suffice to prove the statement for V ′ − V consisting of a\nsingle vertex. In this case the claim is obvious however, since off-diagonal entries of a\nresponse matrix are nonnegative, and diagonal entries are non-positive.\n\u0003\nTheorem 5.2. The matrix Lij is a well-defined infinite periodic matrix, which does not\ndepend on which truncations G(N) are taken.\nProof. There are several parts to this statement.\nThe limits Lij exist. Note that for sufficiently large N, Lij (G(N)) can be calculated by\ntaking Lij of the network G(∞)N , which is obtained from G(∞) by declaring that only\nthe internal vertices of G(N) are internal in G(∞)N . The network G(∞)N is obtained\nfrom G(N) by adding extra boundary vertices attached only to boundary vertices of G(N)\n(and by assuming N is large enough, we may assume that these extra vertices are not\nincident to i or j). But Lij (G(N)) is by definition calculated by measuring the current\nflowing through j when vertex i is set to one volt and all other boundary vertices are\nset to zero volts. Since current does not flow between zero volt vertices it follows that\nLij (G(N)) = Lij (G(∞))N . By Lemma 5.1 the sequence Lij (G(N))N is non-decreasing as\n\n\f12\n\nTHOMAS LAM AND PAVLO PYLYAVSKYY\n\nN → ∞, since each network is obtained from the previous one by declaring some extra\nvertices internal and taking the corresponding Schur complement.\nThe limits Lij do not depend on the sequence of truncations. Assume we have two\ndifferent sequences V1 ⊂ V2 ⊂ . . . and V1′ ⊂ V2′ ⊂ . . .. Since we know that each eventually\ncovers all vertices, we know that for each i there is a j such that Vi ⊂ Vj′ and Vi′ ⊂ Vj .\nThen applying Lemma 5.1 we conclude that the two limits bound each other from above,\nand thus are equal.\nThe limits Lij are periodic: Lij = L(i+n)(j+n) . Indeed, take two sequences V1 ⊂ V2 ⊂ . . .\nand V1′ ⊂ V2′ ⊂ . . ., one obtained from the other by a shift on the universal cover by the\nperiod n. We know that they give the same value of Lij by the previous part. On the\nother hand, it is clear that the value one of them gives for Lij is the value the other gives\nfor L(i+n)(j+n) .\nThe limits Lij are finite. Any truncation of G(∞) can also be viewed as a truncation\nof a finite cover G[m] (obtained by lifting G to a m-fold cover of the cylinder) for a\nlarge enough m. By Lemma 5.1 the conductance Lij (G(N)) is bounded from above\nby the same conductance in G[m], which in turn is bounded from above by the same\nconductance in the original\nP network G. Indeed, if j1 , . . . , jm are vertices in G[m] that\nThis can be seen as follows. Using the linearity\ncover j, then Lij (G) = m\nk=1 Lijk (G[m]). P\nof the response and periodicity, the sum m\nk=1 Lijk (G[m]) measures the current through\njl (for any l) when all vertices ik that cover i have potential 1, and all other vertices have\npotential 0. But projecting onto G by identifying all covers of a vertex we see that this\ncurrent flow is exactly Lij (G). In particular, Lij (G(N)) ≤ Lijk (G[m]) ≤ Lij (G) for any\nk. This shows that Lij is bounded from above by Lij (G), and thus if the latter is finite,\nso is the former.\n\u0003\nThus for fixed i, j, we can approximate Lij arbitrarily well by calculating Lij (G(N))\nfor some large N.\nProposition 5.3. The universal response matrix Lij is invariant under the local electrical\nequivalences of N.\nProof. For any local electrical transformation in G one can choose a sequence of truncations of G(∞) containing completely several occurrences of this transformation. Since the\nconductances in these truncations do not change, the limit is also invariant.\n\u0003\nCorollary 5.4. The electrical R-matrix preserves the universal response matrix.\nProof. The only comment one needs to make is that the entries of the universal response\nmatrix are limits of rational functions in the edge weights, and that these rational functions\nmake sense formally even when negative conductances are used (as in the derivation of\nthe electrical R-matrix).\n\u0003\n5.2. Circular and cylindrical total nonnegativity. Let I = {i1 < i2 < . . . < ik }, J =\n{j1 < j2 < . . . < jk } ⊂ [n] be subsets of the same cardinality. Then (I, J) is a circular\npair if a cyclic permutation of i1 , i2 , . . . , ik , jk , . . . , j1 is in order. A n × n matrix M is\ncircular totally-nonnegative if the minor det(MI,J ) is nonnegative for every circular pair\n(I, J). Curtis, Ingerman, and Morrow [CIM] show that the response matrices of circular\nplanar electrical networks are exactly the set of circular totally-nonnegative symmetric\nmatrices for which every row sums to 0. (Note that the response matrices in [CIM] are\nthe negative of ours.)\n\n\fINVERSE PROBLEM IN CYLINDRICAL ELECTRICAL NETWORKS\n\n13\n\nLet us extend this to cylindrical electrical networks. Put the total order * * * − 1 <\n0 < 1 < 2 < * * * < 2′ < 1′ < 0′ < −1′ < * * * on Z ∪ Z′ . Let I, J ⊂ Z ∪ Z′ be\ntwo ordered subsets of the same finite cardinality. Then (I, J) is a cylindrical pair if\na cyclic permutation of i1 , i2 , . . . , ik , jk , . . . , j1 is in order. A matrix M with rows and\ncolumns labeled (and ordered) with Z ∪ Z′ is cylindrically totally-nonnegative if the minor\ndet(MI,J ) is nonnegative for every cylindrical pair (I, J).\nProposition 5.5. Suppose L = (Lij ) is the universal response matrix of a finite cylindrical electrical network. Then L is cylindrically totally-nonnegative.\nProof. For each fixed cylindrical pair (I, J), and sufficiently large N, the truncation G(N)\nis a finite circular electrical network including all the boundary vertices in I and J.\nBut then det(LI,J ) = limN →∞ det(LI,J (G(N))) ≥ 0, using Curtis-Ingerman-Morrow's\nresult.\n\u0003\nRemark 5.1. The converse to Proposition 5.5, namely, which cylindrically totally nonnegative matrices are realizable as universal response matrices, is more subtle. Let\n. . . , j−1 , j0 , j1 , j2 , . . . be the lifts to the universal cover of a particular vertex in a finite cylindrical electrical network G. Then for a fixed i, the (doubly-infinite) sequence ak = Li,jk\nmust satisfy certain recursions or convergence properties. In the different but closely related setting of total nonnegative points of loop groups, the correct property is to ask for\nthe generating function of ak to be a rational function (see [LP10+, Theorem 8.10]).\n5.3. ASW factorization for networks N(m). We now assume we are given a network\n(k)\nG = N(m). The vertices have been labeled so that if we take the \"low\" edge (from Mi\n(k+1)\nto Mi\n) at every step starting from i we will end up at i′ . Note that a shortest path\nfrom one side of the cylinder to the other consists of exactly m edges.\nFrom now on we consider groves in the universal cover G(∞) of G (or in the truncations\nG(N)). The boundary partition of such a grove would be a planar partition of Z ∪ Z′\narranged on the two edges of an infinite strip (or in the truncations of this).\nLemma 5.6. Suppose i and j ′ are can be connected by a path with m edges. There exists\nan integer M such that there are no groves Γ with the properties\n(1) there is a grove component Γ{i,j ′} with boundary vertices {i, j ′ } and which uses an\nedge below (resp. above) any of the shortest paths from i to j ′ .\n(2) there are grove components with boundary vertices {i + 1, (j + 1)′}, . . . , {i + M, (j +\nM)′ } (resp. {i − 1, (j − 1)′ }, . . . , {i − M, (j − M)′ }).\nProof. For a grove component Γ{i,j ′ } let us call bad the edges it contains that are below\nthe lowest path from i to j ′ . Assume the grove component Γ{i,j ′} has bad edges, and\nfurthermore without loss of generality assume that it has a bad high edge. The case of a\nbad low edge is similar with the left and right sides of the network swapped. Assume k\n(k)\nis the first index such that bad high edge has one of the Mi as its right endpoint. We\nclaim that the Γ{i+1,(j+1)′ } component has a bad high edge with right end having index\nk − 2 or smaller. Indeed, consider the unique path from i + 1 to (j + 1)′ inside Γ{i+1,(j+1)′ } .\nIn order to avoid touching the bad edge of Γ{i,j ′ } it has to turn, diverting from the lowest\nshortest path from i + 1 to (j + 1)′ . The first time it thus diverts gives a desired high\nedge.\n\n\f14\n\nTHOMAS LAM AND PAVLO PYLYAVSKYY\n\nFigure 8. A bad high edge in the blue grove component forces an earlier\nbad high edge in the red grove component.\nNow, the index of the first bad high edge cannot decrease indefinitely, and in fact one\nsees that the statement of the lemma holds for M > m/2. The case of edges above the\nhighest shortest path is similar.\n\u0003\nDefine the radii Rk for k = 1, 2, . . . , m by\nQ\n(k)\ni wMi(k−1) Mi−1\nRk = Q\ni wM (k−1) M (k)\ni\n\ni\n\nwhere we have denoted the conductance of the edge joining two vertices v, v ′ by wvv′ .\nLemma 5.7. Let (P1 , P2 , . . . , Pn ) be an n-tuple of consecutive shortest paths, where Pi\nconnects i + k to (i + k − 1)′ for each i, and some fixed k. Suppose that\n(1) all the Pi have the same shape; thus they high or low edges respectively at the same\npoints along the path.\n(2) R1 ≥ R2 ≥ * * * ≥ Rm .\nThen the total weight wt(P1 ∪ P2 ∪ * * * ∪ Pn ) is maximized exactly when the highest path\nis taken.\nThe weight of a subgraph is simply the product of its edge weights.\nProof. All the shortest paths are connected by switching from one side of a rhombus to\nthe other, see Figure 9. If this parallelogram involves vertices with upper index k − 1, k\nand k + 1, then the higher path has greater weight exactly when Rk > Rk+1 .\n\u0003\nLet τK be the partition of Z ∪ Z′ with parts of size two {k, (k − 1)′ } for all k ∈\n{2, 3, . . . , K}, parts of size two {k, k ′ } for k ∈ {−K, −K + 1, . . . , 0}, and all other parts\nare singletons. Thus in particular, 1 is a singleton. We shall denote by σK the partition\nof Z ∪ Z′ obtained from τK by placing 1 in the same part as {0, 0′} to get a single part\n{1, 0, 0′} of size three.\nWe shall suppose that the truncation G(N) includes the boundary vertices −N, −N +\n1, . . . , 1, 2, . . . , N and also the boundary vertices −N ′ , (−N + 1)′ , . . . , 1, 2, . . . , N ′ . For\nN ≫ K the partitions τK and σK naturally gives rise to partitions of the boundary\nvertices of G(N), where boundary vertices of G(N) which are not boundary vertices of\nG(∞) are all considered singletons. We will still denote these partitions of boundary\nvertices of G(N) by τK and σK .\n\n\fINVERSE PROBLEM IN CYLINDRICAL ELECTRICAL NETWORKS\n\na\n\ne\n\na\n\ne\n\nb\n\nf\n\nb\n\nf\n\nc\n\ng\n\nc\n\ng\n\nd\n\nh\n\nd\n\ng\n\na\n\ne\n\na\n\ne\n\nb\n\nf\n\nb\n\nf\n\nc\n\ng\n\nc\n\ng\n\n15\n\nFigure 9. Here n = 2; which of the two groves has larger weight depends\non which of the two radii ac/bd and f h/eg is bigger.\nTheorem 5.8. Suppose that R1 ≥ R2 ≥ * * * ≥ Rm . Then\n....\nPr(σK )G(N )\nlim lim ....\n=a\nK→∞ N →∞ Pr(τK )G(N )\nwhere a is the weight of the high edge connected to the vertex 1 of G.\nProof. Let v denote the vertex connected to both 0 and 1. Let e be the edge joining 1 to\nv, so that e has weight a. Let e′ denote the other edge incident to 1.\nTo approximate the LHS, we shall assume we have chosen N ≫ K ≫ M. Let Γ be\na grove with boundary partition either σK or τK . By Lemma 5.6, the grove component\nΓK−M,(K−M −1)′ cannot extend either above or below the set of edges contained in shortest\npaths from K − M to (K − M − 1)′ . In particular, there is a bound on the number of\nchoices of ΓK−M,(K−M −1)′ , not depending on K or N. In the following, we shall assume\nthat we have fixed such a choice for ΓK−M,(K−M −1)′ .\nLet Γ be a grove with boundary partition τK . By Lemma 5.6, the grove component Γ0,0′\ncannot extend above the (unique) shortest path from 0 to 0′ . In particular, the vertex v\nmust lie in Γ0,0′ . Thus the edge e is never used in Γ, and Γ ∪ {e} is a grove with boundary\npartition σK . Also by Lemma 5.6, the grove component Γ−M,(−M )′ cannot extend either\nabove or below the (unique) shortest path from −M to (−M)′ , and therefore must be\nexactly this shortest path. Similar observations hold for a grove with boundary partition\nσK . In particular, the part of the grove above Γ−M,(−M )′ and the part below are essentially\nindependent.\nLet us denote by Aτ (resp. Aσ ) the set of groves with boundary partition τK (resp. σK )\nand by wt(Aτ ) (resp. wt(Aσ )) the total weight of that set of groves.\nLet Γ be a grove with boundary partition σK . First we observe that all but a constant\nnumber of grove components Γi,(i−1)′ are shortest paths. Furthermore, as i goes from 2 to\nK, the shapes of the shortest paths are locally constant, and can only change when we\nencounter a grove component which is not a shortest path. Furthermore, as we go down,\nthe shape of the shortest path can only become lower. We shall call this part of Γ the\nlower half of the grove. Note that there are m different shapes S1 , S2 , . . . , Sm of shortest\npaths, listed from highest to lowest, see Figure 10. Let A′σ ⊂ Aσ denote the subset of\ngroves where Γ1,0,0′ uses the edge e, and let A′′σ denote the subset of groves where Γ1,0,0′\ndoes not use the edge e′ . Given ǫ > 0, we shall now show that for sufficiently large K,\none has wt(A′′σ )/wt(A′σ ) < ǫ.\n\n\f16\n\nTHOMAS LAM AND PAVLO PYLYAVSKYY\n\nS1\n\nS2\n\nSm\n\nFigure 10. The shapes of shortest paths connecting i + 1 to i′ .\nLet Γ ∈ A′′σ . Then the shortest paths which occur in the lower half of Γ can only use the\nshapes S2 , S3 , . . . , Sm . Pick K sufficiently large that we are guaranteed to have Cnm2 /ǫ\ngrove components in the lower half which are shortest paths, where C is a constant (not\ndepending on K or N) we shall describe below. Then there is some Si (say pick the\nleast such i) which occurs at least Cnm/ǫ times. Define a set of new groves {Γ′j | j =\n1, 2, . . . , m/ǫ} by:\n(1) removing jn of the Si shaped paths, and shifting the lower half of Γ downwards\nto fill in the removed area;\n(2) replacing the grove components Γ−M,(−M )′ , Γ−M +1,(−M +1)′ , . . . , Γ−1,(−1)′ with shortest paths;\n(3) replacing Γ0,0′ ,1 with the shortest path from 0 to 0′ union the edge e;\n(4) adding jn − 1 new shortest paths Γ′2,1′ , . . . , Γ′jn,(jn−1)′ which are S1 -shaped;\n(5) adding one extra \"transition\" grove component Γ′jn+1,(jn)′ which is S1 -shaped\nabove, but which correctly fits with Γ2,1′ below.\nFigure 11 illustrates the procedure. In this case m = 9, n = 2, j = 1, i = 7. The Γ1,0,0′\ncomponent of the groves is shown in red, the part shifted down is shown in green. The\ntwo removed groves of shape Si and the two new groves of shape S1 that replaced them\nare shown in brown.\nNote that Γ′j belongs to A′σ . Since apart from the shortest paths the rest of the grove\nhas only been modified at a bounded number of edges, by Lemma 5.7 there is a constant\nC1 not depending on K, N, or ǫ such that wt(Γ′j ) ≥ C1 wt(Γ). Furthermore, each grove\nin A′σ can occur in this way in at most C2 m different ways. The C2 counts the possible\ngrove components Γ−M,(−M )′ , Γ−M +1,(−M +1)′ , . . . , Γ−1,(−1)′ and Γ0,0′ ,1′ of which there is a\nuniversal bound for. The m ways count the possible i such that the shortest paths Si are\nbeing replaced by S1 . Setting C = C1 C2 , we conclude that wt(A′′σ ) ≤ ǫwt(A′σ ). For every\nΘ ∈ Aτ , the grove Θ ∪ {e} lies in Aσ , and this map is an injection from Aτ to Aσ which\nchanges the weight of each grove by exactly a. On the other hand every Γ ∈ A′σ is in the\nimage of this map. It follows that a ≤ wt(Aσ )/wt(Aτ ) ≤ a(1 + ǫ). Letting K, N → ∞,\nwe obtain the statement of the theorem.\n\u0003\nThe partition τK is a planar partition of Z ∪ Z′ of the type\n.... described in Theorem 3.1(2),\nwhere all but finitely many vertices are isolated. Define Pr(τ ) by taking the polynomial\n\n\fINVERSE PROBLEM IN CYLINDRICAL ELECTRICAL NETWORKS\n\n−1\n\n−1\n\n0\n\n0\n\n1\n\n1\n\n2\n\n2\n\n17\n\n−1′\n\n−1′\n\n0′\n\n0′\n\n1′\n\n1′\n\nFigure 11. Creation of a new grove Γ′j from Γ.\nof Theorem 3.1(2) and replacing Lij (G) by Lij . Then we have\n....\n....\nPr(τ ) = lim Pr(τ )G(N )\nN →∞\n....\nand in particular, Pr(τ ) can be approximated arbitrarily well on some G(N) for very\nlarge N.\nUnfortunately, this is not the case for the partition σK , which contains a part of size\nthree, for which Theorem 3.1(2) cannot be applied. Instead one has\n....\nPr(σK )G(N ) = pN (Lij (G(N)))\nfor the sequence of polynomials pN of Theorem 3.1(1). These polynomials depend on σK ,\nwhich is suppressed from the notation.\nProposition 5.9. Suppose N > N ′ . Then pN − pN ′ is a polynomial in the Lij 's such that\nevery monomial involves some Lij where N ≥ |i| > N ′ and j ∈ [−K, K]. Furthermore,\nthere is some constant cK such that the coefficient of each monomial in pN is less than\ncK .\nProof. The first statement follows from Lemma 3.3 and our choice of σK . The second\nstatement is Lemma 3.4.\n\u0003\nThe assymmetry of the roles of i and j in Proposition 5.9 is accounted for by the fact\nthat Lij is symmetric. ....\nThat is, we treat Lij = Lji as the same variable. Note that we\nalready know....\nlimN →∞ Pr(τK )G(N ) approaches a limit, and it follows from Theorem 5.8\nthat limN →∞ Pr(σK )G(N ) approaches a limit as well.\nLemma 5.10. For each K and ǫ > 0, one can find some A such that\n....\n| lim Pr(σK )G(N ) − pA (Lij )| < ǫ.\nN →∞\n\n\f18\n\nTHOMAS LAM AND PAVLO PYLYAVSKYY\n\nProof. Fix K. We first show that there is A such that for all N > A we have\n|pN (Lij (G(N))) − pA (Lij (G(N)))| < ǫ/3.\nIt is known that the polynomials pN have degree 2K + 1, see Section 3. By Proposition\n5.9, every monomial in pN − pA has a factor Lij where |i| > A and |j| ≤ K, and has\ncoefficient ≤ cK . Thus\n\n\nX\n|pN (Lij (G(N))) − pA (Lij (G(N)))| ≤ \nLij  (max(Lab ))2K cK .\n|i|>A, |j|≤K\n\na,b\n\nP\nBy the proof of Theorem 5.2, we know that for each i we have j Lij < ∞. Thus it is\npossible to find A large enough that\n\n\nX\nǫ\n\nLij  <\n,\n3(maxa,b (Lab ))2K cK\n|i|>A, |j|≤K\n\ngiving us\n(2)\n\n|pN (Lij (G(N))) − pA (Lij (G(N)))| < ǫ/3.\n\nSince only finitely many Lij 's appear in pA , for sufficiently large N we have\n(3)\n\npA (Lij ) − pA (Lij (G(N))) < ǫ/3.\n\nFurthermore, for sufficiently large N we have\n....\n....\n(4)\n|Pr(σK )G(N ) − lim\nPr(σK )G(N ′ ) | < ǫ/3.\nN ′ →∞\n....\nFinally, we combine the three estimates (2),(3), (4) and use Pr(σK )G(N ) = pN (Lij (G(N))).\n\u0003\nTheorem 5.11. Fix G, satisfying R1 ≥ R2 ≥ * * * ≥ Rm and fix one of the edges connected\nto one of the vertices . . . , −2, −1, 0, 1, 2, . . .. There is a sequence of polynomials (depending\non the universal response matrix of G), pA1 , pA2 , . . ., and q1 , q2 , . . . such that\npAK (Lij )\n=a\nK→∞ qK (Lij )\nlim\n\nwhere a is the weight of the chosen edge.\nProof. By symmetry, it is enough to establish the formula for the high edge connected to\n1. The polynomial qK is the one associated to τK from Theorem\n.... 3.1(2). The polynomial\npAK is chosen via Lemma 5.10 so that |pAK (Lij ) − limN →∞ Pr(σK )G(N ) | < ǫK , where ǫK\nK\n→ 0 as K → ∞. Finally, we apply Theorem 5.8.\n\u0003\nis chosen so that qKǫ(L\nij )\n6. The Inverse Dirichlet-to-Neumann problem on a cylinder\n6.1. Solution to inverse problem for the networks N(m).\nLemma 6.1. Assume a cylindrical network Y = N(m) is obtained by concatenating two\nnetworks X = N(1) and X ′ = N(m − 1). Then knowing X and the universal response\nmatrix of Y , one can recover the universal response matrix of X ′ .\n\n\fINVERSE PROBLEM IN CYLINDRICAL ELECTRICAL NETWORKS\n\n19\n\nProof. Assume the conductances in X are ai for the high edges and bi for the low edges.\nConcatenate Y with a network Z = N(1) with (virtual) conductances −ai for low edges\nand −bi for high edges. We claim that the response of the resulting network is equal to\nthat of X ′ . Indeed, connect the opposite vertices of Z and X by edges with conductances\nL and −L, without changing the response. Changing resulting triangles into stars using\nthe Y −∆ transformation, and letting L → ∞, we see that there is an infinite conductance\nbetween opposite vertices and zero conductance between other pairs. Thus the two N(1)\nnetworks effectively cancel each other out, and we are left with a network with the same\nresponse as X ′ . See Figure 12.\n\u0003\n\n−L\n\nX\n\nX′\n\na1\n−a1\n−b1 L b1\n−a −L a2\n2\n\n−b2\n\nb2\nL\n\na1\nO(1/L)\n−b1 b1\n∼\n−a2 a2\nO(1/L)\n−b2 b2\n−a1\n\n∼\n\n∞\n∞\n∞\n\nFigure 12. Attaching Z to Y effectively removes the leftmost layer X.\nTheorem 6.2. There are generically m! sets of edge conductances which produce a given\nuniversal response matrix for the network N(m). All the solutions are connected by the\nSm -action via the electrical R-matrix.\nProof. It is easy to see from Theorem 4.3 that the electrical R-matrix swaps the radii\nRk . Assume we have a solution for conductances in N(m) with given universal response\nmatrix. Apply the electrical R-matrix to reorder the radii Rk in non-increasing order.\nThen Theorem 5.11 allows us to recover the conductances in the leftmost N(1) part of\nthe network. In particular, these conductances are the same for any solution. Once we\nknow that, we can use Lemma 6.1 to recover the universal response matrix of the remaining\nN(m−1) part of the network. Then we repeat the procedure. We see that once we require\nthe radii to form a non-increasing sequence, the conductances are recovered uniquely by\nTheorem 5.11. Therefore all other solutions can be obtained from that one by action of\nSm , which is what we want. In the generic case when all radii are distinct, the orbit has\nsize m!.\n\u0003\nRemark 6.1. In the language of [LP10+], Theorem 6.2 says that the group Sm generated\nby electrical R-matrices is exactly the monodromy group of the network N(m). It is the\ngroup acting on the edge weights of N(m) obtained by transforming the network via local\nelectrical equivalences back to itself.\n6.2. Conjectural solution to general case. It is convenient to describe the general\nanswer we expect using the language of medial graphs, see for example [CIM, dVGV].\nDraw wires through the electrical network so that they pass through each edge and connect\ninside each face as shown in the first two pictures in Figure 13. The third picture shows an\nexample of an electrical network and its medial graph. Note that the medial graph always\n\n\f20\n\nTHOMAS LAM AND PAVLO PYLYAVSKYY\n\nhas four-valent vertices, and that the wires of the medial graph \"go straight through\"\neach vertex.\n\nFigure 13. Constructing the medial graph: the black edges belong to the\nelectrical network, and the blue lines constitute the medial graph.\nThe medial graph of the networks N(m) looks like 2n horizontal wires crossed by m\ncycles, as shown in Figure 14.\n\nFigure 14. (N(m) and its medial graph.\nIn the terminology of [CIM] a circular planar electrical network is critical if its medial\ngraph avoids lenses, which is equivalent to saying that every pair of wires crosses as few\ntimes as possible, given their respective homotopy types. If G is a cylindrical electrical\nnetwork, we say that G is critical if the universal cover of G satisfies this condition;\nnamely, the medial graph has wires which cross as few times as possible.\nLet us call a cylindrical network canonical if the medial graph of its universal cover has\nthe following form. First, there are three kinds of wires: (I) some wires connect points\non opposite boundaries, (II) some wires connect points on the same boundary, and (III)\nsome wires do not intersect the boundary at all and correspond to (simple) cycles around\nthe cylinder. Secondly, we require that the third kind of wires do not intersect the second\nkind, and furthermore, all points of intersection of wires of the first kind with themselves\nhappen strictly before they intersect wires of the third kind. An illustration is given in\nFigure 15.\nConjecture 6.3.\n(1') Any cylindrical electrical network can be transformed using local electrical transformations (those in Section 2.2 and the electrical R-matrix) into a critical cylindrical\nelectrical network.\n(2') Any two cylindrical electrical networks G and G′ with the same universal response\nmatrices are connected by local electrical equivalences. Furthermore, if G and G′\nare both critical, then only star-triangle transformations, and electrical R-matrix\ntransformations are needed.\n\n\fINVERSE PROBLEM IN CYLINDRICAL ELECTRICAL NETWORKS\n\n21\n\nFigure 15. The (universal cover of the) medial graph of a canonical network.\n(3') If a cylindrical electrical network is critical canonical, then the conductances corresponding to all crossings involving wires of types (I) and (II) can be recovered\nuniquely. The conductances corresponding to crossings of wires of type (I) and\ntype (III) can be recovered up to the electrical R-matrix action.\n(5') The space X of universal response matrices of cylindrical electrical networks has\ni\ni\nan infinite stratification by X = ⊔Ci where each Ci ≃ Rd>0\n× Re≥0\nis a semi-closed\ncell that can be obtained as the set of universal response matrices for a fixed critical\nnetwork with varying edge weights.\nFor the (missing) cylindrical analogue of (4) of the Theorem in the introduction see\nSection 5.2.\nAnother way to phrase Conjecture 6.3(3') is that the monodromy group of a critical\ncanonical cylindrical network is a symmetric group, generated by electrical R-matrices.\nSee Remark 6.1.\nLet us explain the semi-closed cells in Conjecture 6.3(5'). Let G be a critical canonical\ncylindrical electrical network. Some edge weights can be recovered uniquely and these each\ngive a R>0 in the parametrization. The remaining part of the network is essentially one of\nthe networks N(m), whose edge weights can be recovered uniquely up to the electrical Rmatrix action (Theorem 6.2). So the response matrices would be parametrized by the orbit\nspace (Rmn\n>0 )/Sm . However, we can pick a distinguished element in each orbit: namely the\none where the radii Rk are non-increasing. The corresponding response matrices would\nthen be parametrized by Rm ∈ R>0 , R1 −R2 , R2 −R3 , . . . , Rm−1 −Rm ∈ R≥0 together with\nsome collection of edge weights which can be freely chosen in R>0 . Thus the universal\nresponse matrices of critical canonical cylindrical electrical network is parametrized by a\nsemi-closed cell C ≃ Rd>0 × Re≥0 .\nReferences\n[ASW] M. Aissen, I.J. Schoenberg, and A. M. Whitney: On the generating functions of totally\npositive sequences. I., J. Analyse Math., (1952), no. 2, 93–103.\n[CIM] E.B. Curtis, D. Ingerman and J.A. Morrow: Circular planar graphs and resistor networks,\nLinear Algebra Appl., 283 (1998), no. 1-3, 115–150.\n[CM] E.B. Curtis and J.A. Morrow: Inverse problems for electrical networks, World Scientific, Series\non Applied Mathematics, Vol. 13, 2000.\n\n\f22\n\nTHOMAS LAM AND PAVLO PYLYAVSKYY\n\n[dVGV] Y.C. de Verdière, I. Gitler, D. Vertigan: Réseaux électriques planaires. II, Comment.\nMath. Helv., 71(1) (1996), 144–167.\n[Ken] A.E. Kennelly: Equivalence of triangles and stars in conducting networks, Electrical World and\nEngineer, 34 (1899), 413–414.\n[KKS] R.M. Kashaev, I.G. Korepanov, S.M. Sergeev: Functional Tetrahedron Equation, Theor.\nMath. Phys. 117:3 (1998), 1402–1413.\n[KW] R. Kenyon and D. Wilson: Boundary partitions in trees and dimers, Trans. Amer. Math. Soc.\n363 (2011), no. 3, 1325–1364.\n[KW2] R. Kenyon and D. Wilson: Combinatorics of tripartite boundary connections for trees and\ndimers, Electron. J. Combin. 16 (2009), no. 1, research paper 112.\n[LP08+] T. Lam and P.Pylyavskyy: Total positivity in loop groups I: whirls and curls, preprint,\n2008; arXiv:0812.0840.\n[LP10+] T. Lam and P. Pylyavskyy: Crystals and total positivity on orientable surfaces, preprint,\n2010; arXiv:1008.1949.\n[LP11a+] T. Lam and P. Pylyavskyy: Electrical networks and Lie theory, preprint, 2011;\narXiv:1103.3475.\n[LP11b+] T. Lam and P. Pylyavskyy: Electrical paths, R-matrices and crystals, in preparation.\n[Lus] G. Lusztig: Total positivity in reductive groups, Lie theory and geometry, 531–568, Progr. Math.,\n123, Birkhäuser Boston, Boston, MA, 1994.\nE-mail address: tfylam@umich.edu\nDepartment of Mathematics, University of Michigan, 530 Church St., Ann Arbor, MI\n48109 USA\nE-mail address: ppylyavs@umn.edu\nDepartment of Mathematics, University of Minnesota, 206 Church St. SE, Minneapolis, MN 55455 USA\n\n\f"}