{"id": "http://arxiv.org/abs/0810.2069v2", "guidislink": true, "updated": "2008-10-17T06:40:52Z", "updated_parsed": [2008, 10, 17, 6, 40, 52, 4, 291, 0], "published": "2008-10-12T03:14:44Z", "published_parsed": [2008, 10, 12, 3, 14, 44, 6, 286, 0], "title": "The Effect of Lunar-like Satellites on the Orbital Infrared Light Curves\n  of Earth-analog Planets", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0810.4623%2C0810.2346%2C0810.3810%2C0810.0111%2C0810.3013%2C0810.4537%2C0810.5594%2C0810.1801%2C0810.2813%2C0810.3324%2C0810.3060%2C0810.4248%2C0810.3759%2C0810.2149%2C0810.0047%2C0810.0077%2C0810.4814%2C0810.1741%2C0810.0973%2C0810.4630%2C0810.4914%2C0810.1371%2C0810.3917%2C0810.0711%2C0810.4562%2C0810.2341%2C0810.2961%2C0810.5590%2C0810.0825%2C0810.5132%2C0810.5137%2C0810.3814%2C0810.3948%2C0810.1664%2C0810.5238%2C0810.4404%2C0810.5423%2C0810.3849%2C0810.3485%2C0810.4044%2C0810.3628%2C0810.1951%2C0810.1338%2C0810.0840%2C0810.4919%2C0810.2546%2C0810.0014%2C0810.1889%2C0810.2312%2C0810.5361%2C0810.5005%2C0810.0656%2C0810.2069%2C0810.0224%2C0810.3168%2C0810.4438%2C0810.4336%2C0810.1015%2C0810.5403%2C0810.4799%2C0810.1093%2C0810.3326%2C0810.4884%2C0810.2361%2C0810.2529%2C0810.2404%2C0810.4174%2C0810.4883%2C0810.5091%2C0810.5076%2C0810.0642%2C0810.3440%2C0810.1384%2C0810.0472%2C0810.1779%2C0810.2959%2C0810.5538%2C0810.4095%2C0810.2990%2C0810.2406%2C0810.0296%2C0810.1362%2C0810.2583%2C0810.3654%2C0810.3241%2C0810.3879%2C0810.3325%2C0810.1631%2C0810.2093%2C0810.0618%2C0810.3575%2C0810.3570%2C0810.3833%2C0810.4239%2C0810.0949%2C0810.1811%2C0810.3223%2C0810.5683%2C0810.1459%2C0810.2735%2C0810.2876&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "The Effect of Lunar-like Satellites on the Orbital Infrared Light Curves\n  of Earth-analog Planets"}, "summary": "We investigate the influence of lunar-like satellites on the infrared orbital\nlight curves of Earth-analog extra-solar planets. Such light curves will be\nobtained by NASA's Terrestrial Planet Finder (TPF) and ESA's Darwin missions as\na consequence of repeat observations to confirm the companion status of a\nputative planet. We use an energy balance model to calculate disk-averaged\ninfrared (bolometric) fluxes from planet-satellite systems over a full orbital\nperiod (one year). The satellites are assumed to lack an atmosphere, have a low\nthermal inertia like that of the Moon and span a range of plausible radii. The\nplanets are assumed to have thermal and orbital properties that mimic those of\nthe Earth while their obliquities and orbital longitudes of inferior\nconjunction remain free parameters. Even if the gross thermal properties of the\nplanet can be independently constrained (e.g. via spectroscopy or\nvisible-wavelength detection of specular glint from a surface ocean) only the\nlargest (approximately Mars-size) lunar-like satellites can be detected by\nlight curve data from a TPF-like instrument (i.e. one that achieves a\nphotometric signal-to-noise of 10-20 at infrared wavelengths). Non-detection of\na lunar-like satellite can obfuscate the interpretation of a given system's\ninfrared light curve so that it may resemble a single planet with high\nobliquity, different orbital longitude of vernal equinox relative to inferior\nconjunction and in some cases drastically different thermal characteristics. If\nthe thermal properties of the planet are not independently established then the\npresence of a lunar-like satellite cannot be inferred from infrared data, thus\ndemonstrating that photometric light curves alone can only be used for\npreliminary study of extra-solar Earth-like planets.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0810.4623%2C0810.2346%2C0810.3810%2C0810.0111%2C0810.3013%2C0810.4537%2C0810.5594%2C0810.1801%2C0810.2813%2C0810.3324%2C0810.3060%2C0810.4248%2C0810.3759%2C0810.2149%2C0810.0047%2C0810.0077%2C0810.4814%2C0810.1741%2C0810.0973%2C0810.4630%2C0810.4914%2C0810.1371%2C0810.3917%2C0810.0711%2C0810.4562%2C0810.2341%2C0810.2961%2C0810.5590%2C0810.0825%2C0810.5132%2C0810.5137%2C0810.3814%2C0810.3948%2C0810.1664%2C0810.5238%2C0810.4404%2C0810.5423%2C0810.3849%2C0810.3485%2C0810.4044%2C0810.3628%2C0810.1951%2C0810.1338%2C0810.0840%2C0810.4919%2C0810.2546%2C0810.0014%2C0810.1889%2C0810.2312%2C0810.5361%2C0810.5005%2C0810.0656%2C0810.2069%2C0810.0224%2C0810.3168%2C0810.4438%2C0810.4336%2C0810.1015%2C0810.5403%2C0810.4799%2C0810.1093%2C0810.3326%2C0810.4884%2C0810.2361%2C0810.2529%2C0810.2404%2C0810.4174%2C0810.4883%2C0810.5091%2C0810.5076%2C0810.0642%2C0810.3440%2C0810.1384%2C0810.0472%2C0810.1779%2C0810.2959%2C0810.5538%2C0810.4095%2C0810.2990%2C0810.2406%2C0810.0296%2C0810.1362%2C0810.2583%2C0810.3654%2C0810.3241%2C0810.3879%2C0810.3325%2C0810.1631%2C0810.2093%2C0810.0618%2C0810.3575%2C0810.3570%2C0810.3833%2C0810.4239%2C0810.0949%2C0810.1811%2C0810.3223%2C0810.5683%2C0810.1459%2C0810.2735%2C0810.2876&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We investigate the influence of lunar-like satellites on the infrared orbital\nlight curves of Earth-analog extra-solar planets. Such light curves will be\nobtained by NASA's Terrestrial Planet Finder (TPF) and ESA's Darwin missions as\na consequence of repeat observations to confirm the companion status of a\nputative planet. We use an energy balance model to calculate disk-averaged\ninfrared (bolometric) fluxes from planet-satellite systems over a full orbital\nperiod (one year). The satellites are assumed to lack an atmosphere, have a low\nthermal inertia like that of the Moon and span a range of plausible radii. The\nplanets are assumed to have thermal and orbital properties that mimic those of\nthe Earth while their obliquities and orbital longitudes of inferior\nconjunction remain free parameters. Even if the gross thermal properties of the\nplanet can be independently constrained (e.g. via spectroscopy or\nvisible-wavelength detection of specular glint from a surface ocean) only the\nlargest (approximately Mars-size) lunar-like satellites can be detected by\nlight curve data from a TPF-like instrument (i.e. one that achieves a\nphotometric signal-to-noise of 10-20 at infrared wavelengths). Non-detection of\na lunar-like satellite can obfuscate the interpretation of a given system's\ninfrared light curve so that it may resemble a single planet with high\nobliquity, different orbital longitude of vernal equinox relative to inferior\nconjunction and in some cases drastically different thermal characteristics. If\nthe thermal properties of the planet are not independently established then the\npresence of a lunar-like satellite cannot be inferred from infrared data, thus\ndemonstrating that photometric light curves alone can only be used for\npreliminary study of extra-solar Earth-like planets."}, "authors": ["Nicholas A. Moskovitz", "Eric Gaidos", "Darren Williams"], "author_detail": {"name": "Darren Williams"}, "author": "Darren Williams", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1089/ast.2007.0209", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/0810.2069v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0810.2069v2", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "34 pages, 7 figures, accepted to Astrobiology", "arxiv_primary_category": {"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0810.2069v2", "affiliation": "Penn State Erie, The Behrend College", "arxiv_url": "http://arxiv.org/abs/0810.2069v2", "journal_reference": null, "doi": "10.1089/ast.2007.0209", "fulltext": "The Effect of Lunar-like Satellites on the Orbital Infrared Light\nCurves of Earth-analog Planets\n\narXiv:0810.2069v2 [astro-ph] 17 Oct 2008\n\nNicholas A. Moskovitz1\nInstitute for Astronomy\nUniversity of Hawaii at Manoa\n2680 Woodlawn Drive\nHonolulu, HI 96822, USA\nEmail: nmosko@ifa.hawaii.edu\nPhone: (808) 956-6700\nFax: (808) 956-2901\n\nEric Gaidos\nDepartment of Geology and Geophysics\nUniversity of Hawaii at Manoa\n1680 East-West Road\nHonolulu, HI 96822, USA\n\nDarren M. Williams\nSchool of Science\nPenn State Erie, The Behrend College\nErie, PA 16563, USA\n\nRunning title: IR Light Curves of Planets with Large Satellites\n1\n\nCorresponding Author\n1\n\n\fAbstract\nWe investigate the influence of lunar-like satellites on the infrared orbital light\ncurves of Earth-analog extra-solar planets. Such light curves will be obtained\nby NASA's Terrestrial Planet Finder (TPF) and ESA's Darwin missions as\na consequence of repeat observations to confirm the companion status of a\nputative planet and to determine its orbit. We use an energy balance model\nto calculate disk-averaged infrared (bolometric) fluxes from planet-satellite\nsystems over a full orbital period (one year). The satellites are assumed to\nlack an atmosphere, have a low thermal inertia like that of the Moon and\nspan a range of plausible radii. The planets are assumed to have thermal\nand orbital properties that mimic those of the Earth while their obliquities\nand orbital longitudes of inferior conjunction remain free parameters. Even if\nthe gross thermal properties of the planet can be independently constrained\n(e.g. via spectroscopy or visible-wavelength detection of specular glint from\na surface ocean) only the largest (∼ Mars-size) lunar-like satellites can be\ndetected by light curve data from a TPF-like instrument (i.e. one that achieves\na photometric signal-to-noise of 10-20 at infrared wavelengths).\nNon-detection of a lunar-like satellite can obfuscate the interpretation of a\ngiven system's infrared light curve so that it may resemble a single planet with\nhigh obliquity, different orbital longitude of vernal equinox relative to inferior\nconjunction and in some cases drastically different thermal characteristics. If\nthe thermal properties of the planet are not independently established then\nthe presence of a lunar-like satellite cannot be inferred from infrared data, thus\ndemonstrating that photometric light curves alone can only be used for preliminary study and that the addition of spectroscopic data will be necessary\n2\n\n\fto properly characterize extra-solar Earth-like planets.\n\nKeywords: Planetary systems – planets and satellites: general – astrobiology\n– methods: data analysis\n\n3\n\n\f1. Introduction\nPlanets with a minimum mass of 5-6 Earth masses have recently been detected around low mass stars (Udry et al., 2007; Rivera et al., 2005) and it\nseems likely that observatories such as CoRoT or Kepler will detect yet smaller\nplanets (Gillon et al., 2005). Space-based observatories of the future will be\ncapable of directly detecting Earth-sized planets around other stars. Proposed missions include a coronagraph operating at visible wavelengths (TPFC) (Traub et al., 2006), and a large-baseline interferometer operating in the\ninfrared (TPF-I and Darwin) (Beichman et al., 2006; Fridlund, 2000). One\ngoal of such missions is to distinguish between planets that are Earth-like\nand can support life, and those that are decidedly less so (e.g., analogs to\nMercury, Venus, or Mars). Several techniques have been proposed to carry\nout this classification. Spectroscopy can reveal the presence of atmospheric\ngases such as H2 O, CH4 and O2 , which are indicative of temperate conditions\nand/or biological activity (Des Marais et al., 2002). Photometry in reflected\nlight can reveal diurnal (rotational) variability associated with ice, oceans,\nland and vegetation across the surface of a planet if no clouds are present\n(Ford et al., 2001). The specular \"glint\" from oceans might be detected as an\nincrease in the visible flux and polarization of reflected light at large phase\nangles (Williams & Gaidos, 2008; McCullough, 2008). Selsis (2004) showed\nthat orbital infrared light curves could reveal general thermal properties of\nterrestrial planets. Gaidos & Williams (2004, hereafter GW04) showed that\ndiurnally averaged, orbital light curves at thermal infrared wavelengths contain information about the thermal properties of the planet's emitting layer\n(surface or clouds) and obliquity. Such light curves would be generated as a\n4\n\n\fbyproduct of repeated observations to confirm the companion status and orbit of a putative planet and function as a first step towards characterization.\nOne finding of GW04 was that oceans or a thick atmosphere damp seasonal\nvariations in temperature, and that low or no variability in a planet's infrared\nlight curve is indicative of the presence of oceans or a thick atmosphere. In\nconjunction with other characteristics, this is a signature of habitable surface\nconditions. These authors and the work presented here do not consider the\neffects of variable cloud cover.\nThe disk-averaged infrared flux of an orbiting planet can vary as it presents\ndifferent phases to a distant observer. This phenomenon has been observed\nfor Jupiter-mass extra-solar planets with semi-major axes much less than 1\nAU (Harrington et al., 2006; Cowan et al., 2007; Knutson et al., 2007). The\nvariation in flux from a planet depends on the diurnal pattern of outgoing\ninfrared flux from the emitting surface (either the top of the atmosphere,\nif any is present, cloud layers, or the surface), which is controlled by the\nplanet's thermal properties and day length. In general, significant day-night\ntemperature differences will occur only if\n(1)\n\n\u0012\n\n∂I\ncω ∼\n<\n∂T\n\n\u0013\n\n,\n\nT̄\n\nwhere c is the heat capacity of the surface/atmosphere, ω is the angular rotation rate, and the right hand side is the slope of the outgoing bolometric\ninfrared flux at the emitting surface vs. temperature, T , evaluated at the mean\nsurface temperature of the body, T̄ . For the Earth: c = 8.34 × 107 J m−2 K−1\nand ∂I/∂T = 1.58 W m−2 K−1 for T̄ = 288 K (however the effective emitting\ntemperature of the Earth is 255 K). Thus equation 1 does not hold for the\n5\n\n\fEarth: the Earth's day-night temperature variation is small and would be for\nany Earth-like planet with a rotation period much less than a year. This is\nprimarily due to the high heat capacity of the ocean mixed layer which also\nmoderates surface temperatures over landmasses and controls the outgoing\ninfrared flux budget.\nThe primordial rotation periods of terrestrial planets are thought to be a\nstochastic outcome of the final stages of formation by accretion of planetary\nembryos, and will be on the order of hours to days (Lissauer et al., 2000). As\na consequence, the disk-averaged infrared flux from an Earth-like planet will\nonly vary significantly along the orbit if the planet has a non-zero obliquity or\neccentricity and hence seasons. This was explored in GW04.\nThe Earth's Moon, lacking an atmosphere or oceans and having a lunar day\n29.5 times longer than the Earth, experiences a much larger diurnal surface\ntemperature variation. Absence of recent geologic activity on the Moon has\nallowed a regolith of impact ejecta to accumulate. This material is optically\ndark [the average lunar Bond albedo is 0.07 (Lane & Irvine, 1973) compared\nto the Earth's 0.31] and has a relatively low heat capacity [that of the Moon\nis 4 × 104 J m−2 K−1 at 29.5 days or 0.1% of the Earth, (Muller & Lagerros,\n1998)]. As a result, the inequality of Equation 1 is satisfied and thus the Moon\nmakes a significant or even dominant contribution (depending upon viewing\ngeometry) to the variable component of the infrared flux from the Earth-Moon\nsystem.\nThe Moon is thought to have accreted from a circumterrestrial disk of\nejecta generated by the impact of a Mars-sized body (Hartmann, 1986). The\nhigh ambient temperatures and low gravity in the transient disk explain the\n6\n\n\fMoon's lack of volatiles (Pritchard & Stevenson, 2000). Current scenarios\nfor the final stages of terrestrial planet formation include such giant impacts\n(Canup & Agnor, 1998) and the results of numerical simulations suggest that\nthey are not rare (Ida, Canup & Stewart, 1997). Thus large satellites lacking atmospheres or oceans may be common around extra-solar rocky planets.\nLike the Moon, these satellites would have originally formed closer to their\nparent planets and their rotations would have quickly synchronized to their\norbits (Gladman et al., 1996; Canup & Agnor, 1998). As a result their diurnal\ntemperature variation could be significant. We note that Moon-size satellites\ncould retain an atmosphere against gravitational escape over Gyr time-scales\nif one was originally present.\nSatellites around extra-solar planets will be unresolved by even the most\nambitious planet-finding mission: the angular separation of the Earth and\nMoon at a distance of 10 pc is 0.25 mas. However, a large satellite might\nreveal itself by a significant variation in the total (bolometric) flux from the\nsystem. Such an interpretation requires independent knowledge of the thermal and rotational properties of the parent planet, which can be established\nusing spectroscopy (Des Marais et al., 2002; Selsis, 2004) or optical light curve\ndata (Williams & Gaidos, 2008; McCullough, 2008). If establishment of these\ngross thermal properties leads to the expectation that infrared flux variation\nwould be small (Equation 1) then observation of significant variation could be\nattributed to the presence of a large satellite. In the absence of such auxiliary\ninformation, however, the satellite contribution may result in an assignment\nof erroneous thermal properties to the planet.\n\n7\n\n\fWe present calculations of infrared light curves of an Earth-like planet with\na Moon-like satellite. The terms Earth-like or Earth-analog refer to specific\nthermal and orbital properties that represent those of the Earth (see §2). The\nalbedo, heat capacity and orbital period of the satellite are set to that of the\nMoon (see above) while its radius is allowed to vary.\nIn §2 we describe the details of the analytical energy balance model (EBM)\nused in these calculations. We give an illustrative calculation in §3. We then\ndetermine the minimum radius of lunar-like satellite that can be detected at\ninfrared wavelengths around an Earth-analog planet (§4). In §5 we describe the\nbiases in planetary orbital properties that can be introduced by an undetected\nlunar-like satellite. In §6 we describe the effects that low and high altitude\nclouds would have on our calculations and in §7 we discuss the implications of\nour results.\n\n2. Model\nOur calculations are based on the infrared orbital light curve model of\nGW04. These authors employ a linearized, analytic EBM to calculate the\ninfrared flux emitted by a planet. This model assumes a single, uniform planetary albedo and parameterizes the thermal inertia and meridional heat transport across a planet's surface. The thermal effect of clouds is accounted for\nby subtracting a correction term from the outgoing flux (Caldeira & Kasting,\n1992). The time-dependent surface temperature distribution is described by\na combination of Legendre polynomials and a Fourier series that are solutions\nto a diffusion equation with periodic temporal boundary conditions in a spherical coordinate system. The disk- and diurnally-averaged infrared flux for a\n8\n\n\fprescribed viewing geometry is calculated along an entire orbit. As long as\nEqn. 1 is satisfied, then diurnally averaging the infrared flux justifies the use\nof a single, average planetary albedo.\nWe consider only one set of Earth-like planetary parameters. Although such\nproperties will undoubtedly vary amongst extra-solar planets, those planets\nwith thermal properties similar to the Earth will be the most compelling targets of investigation. The thermal inertia of the surface (8.34×107 J m−2 K−1 )\nand heat diffusion coefficient (0.38 W m−2 K−1 ) were chosen so that with an\nalbedo (A = 0.3055), orbital semi-major axis (a = 1 AU), and eccentricity\n(e = 0.0167) of Earth, the model reproduces the meridional surface temperature distribution of the Earth as well as the seasonal temperature variation at\nseveral latitudes (GW04).\nThe orbital properties (a, e and i) of a real planet can be determined by\nimaging or astrometry, but the thermal properties of the planet may not be\nuniquely determined by independent means. We discuss this scenario in §7.\nUnder the conditions of known orbital and thermal properties, the light curve\nis a function of the planet's obliquity (δ0 ), the orbital longitude of inferior\nconjunction relative to the spring equinox (L0 ), and the orbital longitude of the\napastron (Lap ). If the orbit of the planet is nearly circular then the longitude\nof apoastron Lap (fixed here to 180◦ ) is unimportant.\nOcean and atmospheric circulation and the thickness of an ocean's mixed\nlayer may differ for Earth-like planets with obliquities that are significantly\nlarger than 23.5◦. Thus, the actual light curves of such planets would differ\nfrom those calculated with Earth-like thermal properties. We examined this\neffect by comparing general circulation model (GCM) runs for δ0 = 85◦ to\n9\n\n\four EBM calculations (Figure 1). The GCM used was the three-dimensional\nGENESIS 2 model (Williams & Pollard, 2003) and the calculations were performed with L0 = 120◦ . The amplitude and general shape of the GCM light\ncurves are nearly identical to those of the EBM. However, we find that the\nphase of the GCM light curves tend to lead those of the EBM by ∼ 35◦ , with\nthe greatest differences occurring when the geometry of the system is such that\nthe poles of the planet are pointed towards the observer (e. g. high obliquity\nand high inclination). This is likely due to the inclusion of polar sea ice in the\nGCM.\nThe exact origin of the offset in phase is uncertain, but we suspect that it\ninvolves effects of seasonal changes in cloud cover, sea ice or ocean circulation\nnot included in the EBM. In §4 we show that artificially adjusting the phase of\nthe EBM light curve (for i = 60◦ ) to better match the GCM calculations only\nslightly increases the probability of satellite detection. In §5, we find that this\nphase lag does not affect the conclusion that an Earth-like planet with a lunarlike satellite produces light curves resembling those of an isolated planet with\nhigh obliquity (i.e. one with large amplitude, see GW04 for for a comparison\nof light curves from Earth-like planets with high and low obliquities). We\nare interested only in estimating the detectability of satellites and their gross\neffect on the interpretation of infrared light curves, rather than on detailed\ninferences about the climates of planets themselves and thus use the EBM to\nefficiently calculate light curves over a range of obliquity values.\nOur formalism for calculating the outgoing infrared flux from a lunar-like\nsatellite is also based upon the analysis in GW04. In the absence of an atmosphere or oceans, the energy-balance equation governing the temperature (T )\n10\n\n\fat a given point on the surface of a satellite with no latitudinal heat transfer\nis\n(2)\n\nc\n\n∂T\n= S * (1 − A) − I(T ),\n∂t\n\nwhere time is denoted by t, incident stellar flux by S, albedo by A, and outgoing infrared flux I(T ). S and I(T ) are calculated as functions of longitude\nand latitude on the surface of the satellite taking into account projection effects. To analytically solve this equation three assumptions are made. First\nc is assumed constant in time and across the satellite surface. Second, the\ntemperature dependence of the outgoing infrared flux is approximated as a\nlinearized blackbody:\n(3)\n\n\u0001\nI(T ) = I(T̄ ) * 1 + 4(T − T̄ )/T̄ .\n\nThis follows the approach of classical energy balance models (North et al.,\n1981). Finally, we assume tidally-locked, synchronous rotation as is expected\nfor large, collisionally-formed satellites (Gladman et al., 1996; Canup & Agnor,\n1998). These assumptions allow Fourier series solutions to Equation 2:\n(4)\n\nT (θ, l) = T0 (θ) +\n\nN\nX\n\n[an (θ) cos(nl) + bn (θ) sin(nl)],\n\nn=1\n\nwhere T0 is the mean temperature for a given latitude θ and l is the longitude on the surface of the satellite. N is set to 10 as numerical tests show\nthat larger values do not significantly change the final light curve. Substitution of Equations 3 and 4 into Equation 2 yields expressions for the Fourier\n\n11\n\n\fcoefficients:\n(5)\n\na′n (B + α) − b′n α\nan (θ) =\nα2 + (B + α)2\n\n(6)\n\na′n α − b′n (B + α)\nbn (θ) =\nα2 + (B + α)2\n\nwhere a′n , b′n , B and α are\n(7)\n\na′n\n\n=\n\nZ\n\n2π\n\nS(l, θ)\ncos(nl) dl\nπ\n\nZ\n\n2π\n\nS(l, θ)\nsin(nl) dl\nπ\n\n0\n\n(8)\n\nb′n\n\n=\n\n0\n\n(9)\n\nB=\n\n4I(T̄ )\nT̄\n\n(10)\n\nα=\n\nωc √\nn.\n2\n\nThe infrared emission from the surface is calculated using Equation 3 and the\ntotal signal is determined by geometric projection of the hemisphere facing the\nobserver.\nFor simplicity we assume that the orbit of the satellite is coplanar with that\nof the planet's orbit around the star and, because of synchronous rotation,\nthe satellite has zero obliquity. Thus any variation in outgoing flux from\nthe satellite is due to its finite heat capacity. The disk-averaged flux of the\nsatellite is then independent of the location on its orbit around the planet\nand depends only on the geometric angle described by the star, satellite, and\n12\n\n\fdistant observer (Figure 2). Variability in the satellite signal is due to its\nobserved phase, which changes with the orbital period of the planet. In §4\nwe consider satellites that differ in size (but not surface properties) from the\nMoon.\nA satellite larger than the Moon will retain heat for a longer time and be\nmore likely to have active volcanism. This could make the satellite darker, as\nin the case of the lunar Mare. However, with an average albedo of 0.07 the\nMoon is already quite dark. Fresh basalt from active volcanism on the surface\nof a larger satellite would have little effect on its light curve.\n\n3. Example Light Curves and Observations\nFigure 2 illustrates how an Earth-Moon analog would appear at five evenlyspaced points in the system's orbit. Figure 3 plots the infrared light curves\nproduced by this system. The bottom panel displays the disk-averaged flux,\nwhile the top shows light curves normalized to their respective means. This\nnormalization (which is employed for all subsequent analysis) removes the\nradius of the planet as a degree of freedom in the model. The calculations were\nperformed assuming an Earth \"twin\" (δ = 23.45◦ ) with a satellite of radius,\norbital period and albedo equal to that of the Moon (0.273 R⊕ , 29.5 days and\n0.073 respectively). For these and all simulations the coplanar orbits of the\nplanet and satellite are inclined by 60◦ with respect to the plane of the sky\n(the median value of an isotropic distribution). The dotted line in both panels\nis the contribution from the planet alone. The peak-to-peak amplitude of the\nsatellite's signal (dash-dots in the bottom panel) is 55 W m−2 , whereas the\nplanet's flux alone varies by only 4 W m−2 . Because the thermal inertia of\n13\n\n\fthe satellite is low, it displays a larger relative infrared flux variation than\nthat of the planet (Equation 1). However, because the satellite is smaller, the\nmajority of the average flux originates from the planet.\nThe assignment of erroneous properties to a planet with an undetected satellite is illustrated in the top panel of Figure 3, where the dashed line is the\nbest-fit planet-only model to the planet+satellite observations. This model is\nof a planet with Earth-like thermal properties and δ0 = 75◦ and L0 = 90◦ , i.e.\nquite different than the input values. The phase and amplitude of the light\ncurve produced by these models are not independent and each depends on the\nobliquity and orbital longitude of inferior conjunction. Adjusting the orbital\nlongitude of inferior conjunction could produce better agreement with phase,\nbut would unacceptably decrease the amplitude of the light curve. In general\nlarge light curve amplitudes like those produced by Earth-like planets with\nMoon-like satellites can only be mimicked by single planets with very high\nobliquities and orbital geometries where the northern or southern hemisphere\nis pointed towards the observer.\nAn example of an observation scheme of five evenly-spaced measurements is\nshown in the top panel of Figure 3. In practice a minimum of three observations are required to confirm planetary status and reject background sources\n(Beichman et al., 2006). The TPF mission would conduct a minimum of 3-5\nobservations on each star during the first two years of a five-year mission. The\nremaining time would be spent on spectroscopic follow-up of a few dozen planets (Beichman et al., 2006). Spectroscopic observations could, in principle, be\nsplit into multiple integrations, however these would preferentially occur when\nthe planet was near maximum elongation from the star, thus maximizing the\n14\n\n\fS/N. Both a nulling interferometer (TPF-I, Darwin) or a coronographic imager (TPF-C) will obscure planets along some parts of orbits in the habitable\nzone (Brown, 2004). We thus consider two observing scenarios, one consisting\nof five observations at equal longitudinal intervals around the orbit, and a second consisting of 14 observation points restricted to half of the orbit furthest\nfrom the star. For example, 14 × 2-day integrations of 36 high-priority targets\nmight be obtained in three years. Targets in the habitable zone of solar-mass\nstars (0.9-1.3 AU, Kasting et al. (1993)) will have orbital periods of 300-550\ndays and thus the accessible part of an orbit can be completely observed. For\nthe 5-point \"confirmation\" observation scheme we assume a S/N ratio of 10\nper observation, the median value of the S/N amongst all 234 stars for which\nS/N > 5 is achievable for an Earth-sized planet in a 24-hour integration time.\nFor the 14-point \"characterization\" scheme we assume a S/N of 20, which will\nbe the case for Earth-sized planets around the nearest 20% of the target stars\n(Beichman et al., 2006).\n\n4. Satellite Detection Limits\nWe determine the minimum size of a Moon-like satellite that can be detected\naround an Earth-like planet whose gross thermal properties are outlined in §2.\nWe presume that the inclination of the planet's orbit with respect to the plane\nof the sky is independently measured by astrometry and use a single value of\n60◦ . For these calculations the orbital and thermal parameters of the planet\nand the orbital period, albedo and thermal inertia of the satellite (assumed\nto be equal to that of the Moon) are held fixed, while δ0 , L0 and the satellite\nradius (Rs ) are allowed to vary. With the exception of cases with extremely\n15\n\n\fhigh planetary obliquity where most of the planetary signal is at twice the\norbital period (GW04), the signal from the planet and satellite will have the\nsame period. There are then three unknowns (δ0 , L0 and Rs ) but only two\nmeasurable quantities; the amplitude and phase of the orbital signal. Thus\nit is not possible to uniquely disentangle the planetary and satellite signals.\nInstead, we define a satellite \"detection\" as the case where the observations\ncannot be accounted for by a planet-only model.\nOur detection analysis is as follows: We generate an array of planetary light\ncurves over the full ranges of δ0 [0-90◦] and L0 [0-360◦]. The satellite light\ncurve for a given Rs is calculated and added to each planet light curve in the\narray. Each total light curve is sampled at N specified points according to\neither of the observing schemes described in §3. Random noise with a given\nRMS is added to these measurements. We then perform an exhaustive search\nof planet-only light curves to find the minimum χ2 -fit to the measurements.\nThe analysis is repeated for different values of Rs . We interpret the confidence\nlevel C associated with the value of χ2 and the number of degrees of freedom\nas the probability that the deviation from the planet-only model is due to\nthe presence of a satellite. This is because 1 − C is the probability that\nmeasurements of the light curve of the planet alone would result in a fit with\na χ2 larger than the observed value, i.e. a false positive. We set the effective\nnumber of degrees of freedom to the minimum χ2 value associated with a best\nfit to N observations of the planet-only light curve. Although this minimum χ2\nvalue is sensitive to the random noise characteristics of a given sampling, we\nfind that a more robust calculation of the true χ2 minimum (i.e. averaging over\na large number of random noise patterns) produces results that are in close\n16\n\n\fagreement with this single noise characteristic approximation. Our minimum\nχ2 approximation produces an increase of nearly an order of magnitude in\ncomputational efficiency over the robust method.\nWe average C over L0 , which cannot be independently determined for any\nsystem, but will have a uniform probability distribution. In addition, C is\naveraged over all possible phases of the measurement scenarios, i.e., the longitudes at which the planet is observed are shifted by 2 degree increments over\nthe orbital phase range 2π/N. This produces an average probability of detection hCi for a given Rs and δ0 . The planet's obliquity cannot be independently\ndetermined from the light curve of the planet+satellite, nor can it be assumed\nto have an isotropic distribution (Atobe & Ida, 2007).\nIn Figures 4 and 5 we plot hCi vs. obliquity for several values of satellite\nradius (in units of planetary radius). For an Earth-sized planet, this range\nof radii corresponds to Vesta- to Mars-sized bodies. The two figures correspond to the \"confirmation\" (5 evenly-spaced observations at S/N = 10) and\n\"characterization\" (14 observations at S/N = 20 distributed around 50% of\nthe planet's orbit) observation scenarios described in §3. As the radius of\nthe satellite increases the observations become increasingly inconsistent with\na planet-only light curve, thus the probability of satellite detection increases.\nFor satellites smaller than 0.33 planetary radii the probability of detection\nis lower in the \"characterization\" observing scheme. This is an effect of the\nobservations being distributed around only 50% of the orbit. The incomplete\nphase sampling of this scheme does not capture the peak of the satellite flux\nwhich occurs at the longitude of superior conjunction. However for large satellites (Rs ≥ 0.33 planetary radii) the amplitude of the net light curve becomes\n17\n\n\fso great that the satellite is detected even without complete phase coverage.\nThe scatter in these probability curves is due to the stochastic noise added\nto each of the sample measurements. For both observation schemes < C >\nis very weakly dependent on obliquity. These results show that a Moon-like\nsatellite (0.27 Earth radii) would only be detectable with ∼30% confidence\nby either observation scheme. For the \"confirmation\" and \"characterization\"\nobserving schemes a satellite would have to be 0.5 and 0.38 planetary radii\nrespectively to be detected with 90% confidence. This corresponds to approximately Mars-sized satellites in orbit around an Earth.\nIn Figure 6 we consider how these results would change if a full threedimensional climate model were used to generate the planetary light curves.\nAs previously stated, our EBM produces light curves that lag by ∼ 35◦ relative to those of the GENESIS 2 GCM for obliquities of 23.5◦ and 85◦ . To\nmimic the results of the GCM we offset the phase of the EBM light curves\nby 35◦ and repeat the analysis of Figure 5. It would be computationally prohibitive to generate GCM light curves for the full range of obliquities that are\nincluded in this analysis, thus we approximate the GCM by applying this offset. We find that the probability of detection actually increases slightly with\nthe phase-adjusted pseudo-GCM light curves (Figure 6). Thus, we conclude\nthat our EBM results are conservative estimates for the probability of satellite\ndetection.\n\n5. Errors Introduced by an Undetected Satellites\nAs we showed in Figure 3, the application of planet-only models to a set\nof observations can result in mischaracterization of the Earth-like planet if a\n18\n\n\flarge satellite is present. Even if the gross thermal properties of the planet\nhave been independently established, this will still produce erroneous values\nof δ0 and L0 . We describe this effect by recording the \"true\" (δ0 , L0 ) pair\nfor a given planet+satellite light curve and the (δ0 , L0 ) pair of the best fit\nplanet-only light curve as determined by a χ2 analysis. In some instances, a\nplanet+satellite light curve can be fit with equally low χ2 by more than one\nplanet-only light curve. For these cases, we choose the (δ0 , L0 ) pairs that\nare closest to the true value. Figure 7 plots the direction and proportional\nmagnitude of the error introduced by satellite confusion (The length of the\nvectors have been reduced for clarity). These simulations were run for an\nEarth-like planet with a satellite of radius equal to that of the Moon and (for\nclarity) no intrinsic noise added to the sample points. In nearly all cases,\nthe presence of a lunar-like satellite makes an Earth-analog planet appear to\nhave high (> 80◦ ) obliquity. Shifting the planetary light curve phases by 35◦\nto make them resemble the GCM results does not alter the tendency of the\nbest-fit solutions towards high δ0 .\nThe vectors in Figure 7 converge towards two values of L0 (90◦ and 270◦ )\nbecause the planet-only light curve is in phase with that of the satellite at\nthese L0 . For high obliquity planets, L0 values of 90◦ or 270◦ translate to a\nplanetary configuration in which the southern or northern hemispheres (respectively) face the observer. At high δ0 , these are the only geometries that\nproduce planet-only light curves with large amplitudes that can reasonably\nfit a planet+satellite system. Adjusting for the phase difference between the\n\n19\n\n\fEBM and the GCM does effect these general trends in L0 . Instead of converging to L0 values of 90◦ and 270◦ , the GCM vector field reaches convergence at\nL0 values that are shifted by 35◦ .\n\n6. The Effect of Clouds\nClouds play an important role in the energy balance and climate of the\nEarth by reflecting sunlight and scattering and trapping long-wavelength radiation; they would presumably do so for Earth-like extra-solar planets as well.\nAlthough clouds represent a mean 20 W m−2 (8%) gain in radiation for the\nEarth (Hartmann, 1994) we are concerned here only with their seasonal affect\non the energy budget and disk-integrated outgoing radiation. These seasonal\neffects will be most prominent when one hemisphere is presented to the observer. On the Earth, low clouds (stratocumulus) produce a decrease in net\nradiation, while high clouds (cirrus) produce an increase (Hartmann, 1994).\nWe estimate the thermal effect of seasonal variability in stratocumulus\nclouds on the light curve of an Earth twin. We assume that these low-altitude\nclouds radiate at the same temperature as a clear atmosphere and surface, i.e.\nthey produce no additional greenhouse effect. We use a cloud albedo of 0.7\n(Hartmann, 1994). Comiso & Stock (2001) estimated variation in cloud cover\nover the open ocean around Antarctica to vary by only ±1% around a mean\nof 91%. Seasonal variation of ±10% around a mean of 80% was observed over\nthe North Atlantic (Massons et al., 1998). We adopt a 20% seasonal variation\nin the mean as a reasonable bracketing value. To produce the global mean\nEarth albedo of 0.31, a dark ocean (A = 0.07) must be covered with 37%\nclouds. Although the average cloud cover on Earth is ∼ 60%, only half of\n20\n\n\fthose are low-altitude stratocumulus (Minnis et al., 2002), a value in reasonable agreement with the calculated fraction of 37%. A ± 20% fluctuation in\nthe mean coverage produces an albedo variation of 0.047. We assume that\nthe albedo variation is uniformly distributed over each (northern/southern)\nhemisphere and that it varies sinusoidally in phase with the summer solstice.\n(This obviously produces a non-physical discontinuity at the equator which\nis unimportant for the purposes of estimating the magnitude of the effect of\nclouds). We examined the light curves of two cases: one in which an Earth\ntwin is observed at a moderate inclination (i = 60◦ ) and the other in which\na high-obliquity Earth is observed on an edge-on orbit (i = 90◦ ) so that one\nhemisphere is seen nearly pole-on (results not shown). In both cases the annual\nmean of the disk-averaged flux is slightly lower in the presence of low altitude\nclouds, but the amplitude and phase of the variation is essentially unchanged.\nOf course, pathological deviations from terrestrial patterns of cloudiness are\npossible on planets not quite like the Earth, but we have already shown with a\nGCM model (that includes parameterized cloudiness) that in at least the high\nobliquity regime, our conclusions are not significantly impacted.\nFor an Earth-like planet, high altitude clouds will cause a greenhouse effect\nwhose net effect is to offset any decrease in infrared emission caused by their\nhigh albedo. Variation in the fraction of high-altitude cloud cover on time\nscales of less than ∼ 1 day will be averaged over during typical integrations.\nWe argue that variation in high cloud cover over longer time scales will be\ninsignificant compared to estimated noise characteristics for a typical observation. High altitude clouds with a temperature of 210 K would emit ∼ 40% less\nradiation than the surface. With typical high cloud cover fractions of ∼ 30%\n21\n\n\f(Minnis et al., 2002) and again assuming ± 20% fluctuations in coverage, we\ncalculate that fluctuations in outgoing infrared flux due to high cloud variability will be on the order of a few percent (40% of surface flux × 30% coverage\n× 20% variability), which would be unresolved by observations with an optimistic S/N of 20. In a more extreme case (e.g. larger variability, greater mean\nsurface coverage or lower emitting temperatures) the variability in a light curve\ndue to high altitude clouds will act to further confuse its interpretation.\n\n7. Discussion\nThe simulations presented here show that time-series infrared photometry\nby a TPF- or Darwin-like observatory would reveal only the very largest lunarlike satellites (Mars-sized) around Earth-analog planets, and then only if these\nEarth-like properties, i.e., the presence of oceans and/or a substantial atmosphere, have been established by independent means, e.g. spectroscopy or optical photometry. This conclusion holds for a wide range of planetary obliquity\n(Figs. 4,5,6), assuming that the approximations of the EBM do not grossly\nmisrepresent the infrared light curve of a high-obliquity Earth-like planet (Fig.\n1).\nWhen interpreting infrared light curves, the presence of an undetected lunarlike satellite can suggest erroneous values of planetary obliquity and longitude\nof inferior conjunction. In the case of a planet with high thermal inertia,\ninferred values of δ0 near 90◦ and L0 values within 35◦ of 90◦ or 270◦ may\nindicate the presence of a lunar-like satellite. This result is based on the assumption that the satellite and planetary orbits are coplanar, which may be\nnot be the case for high obliquity planets. Kinoshita (1993) showed that the\n22\n\n\forbit of a satellite will stay in the equatorial plane of its host planet if the\nsecular rate of change of the planet's obliquity is slower than the precessional\nspeed of the satellite orbital plane. Thus satellites around planets that experienced rapid changes in obliquity [possibly by collisions as in the case of\nUranus (Parisi & Brunini, 1997)] would stay in their coplanar orbits.\nIf a satellite's orbit is non-coplanar then its rotation axis will be tilted with\nrespect to the plane of the planet's orbit. This effectively causes a non-zero\nobliquity for the satellite which will modify the amplitude of the satellite's\nlight curve but will not change its period. If this non-coplanar orbit precesses\nthen the signal will change over a time-scale of many orbital periods.\nIf the thermal properties of a planet are not independently established via\nspectroscopy (Des Marais et al., 2002), visible-wavelength detection of glint\nfrom an ocean or significant polarization of visible reflectance (Williams & Gaidos,\n2008; McCullough, 2008), then the flux from an unresolved lunar-like satellite\ncan induce serious errors. If the measurements are modeled with the several\nfree parameters (e.g. δ0 , L0 , A, c and efficiency of meridional heat transport) then a set of planet+satellite measurements can be satisfactorily fit by a\nplanet-only light curve. For instance, the peak-to-peak light curve amplitude\nfrom a system with a large, unresolved lunar-like satellite around an Earthanalog planet can be fit by a planet with low thermal inertia and drastically\ndifferent δ0 and L0 , implying a planet more akin to Mars than Earth. Such an\nerroneous inference would impact the determination of the frequency of habitable planets. This reinforces the need for multiple wavelength observations\nincluding spectroscopy and photometry to disambiguate the characterization\nof extra-solar terrestrial planets (Traub et al., 2006; Beichman et al., 2006).\n23\n\n\fWhere, optimistically, the thermal properties of a planet are known and its\nsatellite is Mars-sized, the existence of a satellite may be inferred from infrared data. Such a discovery would provide information about the collisional\nand kinematic evolution of the parent planet. In addition, a large satellite\ncould be a potential indicator of habitability, as the presence of the Moon is\nknown to stabilize the obliquity and climate of the Earth (Laskar et al., 1993).\n\nAcknowledgments\nThis work has been supported by NASA Terrestrial Planet Finder Foundation science award NNG04GL48G. We thank the anonymous reviewers for\ntheir helpful comments.\n\n24\n\n\fReferences\nAtobe, K. and Ida, S. (2007) Obliquity evolution of extrasolar terrestrial planets. Icarus, 188, 1-17.\nBeichman, C., Lawson, P., Lay, O., Ahmed, A., Unwin, S., and Johnston, K.\n(2006) Status of the terrestrial planet finder interferometer (TPF-I). SPIE\nProceedings, 6268, 62680-S1.\nBrown, R. A. (2004) Obscurational completeness. ApJ, 607, 1003-1013.\nCaldeira, K. and Kasting J. F. (1992) Susceptibility of the early Earth to\nirreversible glaciation caused by carbon dioxide clouds. Nature, 359, 226228.\nCanup, R. M. and Agnor, C. (1998) Accretion of terrestrial planets and the\nEarth-Moon system. In Origin of the Earth and Moon, edited by K. Righter\nand R. Canup, LPI, Houston, pp. 113-129.\nComiso, J. C. and Stock, L. V. (2001) Studies of Antarctic cloud cover variability from 1981 to 1999. Proceedings of IGARSS-2004, 4, 1782-1785.\nCowan, N. B., Agol, E. and Charbonneau, D. (2007) Hot nights on extrasolar\nplanets: mid-infrared phase variations of hot Jupiters. MNRAS, 379, 641646.\nDes Marais, D. J. and 9 co-authors. (2002) Remote sensing of planetary properties and biosignatures on extrasolar terrestrial planets. Astrobiology, 2,\n153-181.\nFord, E. B., Seager, S., and Turner, E. L. (2001) Characterization of extrasolar\nterrestrial planets from diurnal photometric variability. Nature, 412, 885887.\n\n25\n\n\fFridlund, C. V. M. (2000) Darwin - The Infrared Space Interferometry Mission.\nESA Bulletin, 103, 20-25.\nGaidos, E. and Williams, D. M. (2004) Seasonality on terrestrial extrasolar\nplanets: inferring obliquity and surface conditions from infrared light curves.\nNew Astronomy, 10, 67-78.\nGillon, M., Courbin, F., Magain, P., and Borguet, B. (2005) On the potential\nof extrasolar planet transit surveys. A&A, 442, 731-744.\nGladman, B., Dane Quinn, D., Nicholson, P., and Rand, R. (1996) Synchronous locking of tidally evolving satellites. Icarus, 122, 166-192.\nHarrington, J. and 7 co-authors. (2006) The phase-dependent infrared brightness of the extrasolar planet ν Andromedae b. Science, 314, 623-626.\nHartmann, W. K. (1986) Moon origin - The impact trigger hypothesis. In\nOrigin of the Moon, edited by W. K. Hartmann, R. J. Phillips, and G. J.\nTaylor, LPI, Houston, pp. 579-608.\nHartmann, D. L. (1994) Global Physical Climatology. Academic Press, San\nDiego.\nIda, S., Canup, R. M., and Stewart, G. R. (1997) Lunar accretion from an\nimpact-generated disk. Nature, 389, 353-357.\nKasting, J. F., Whitmire, D. P., and Reynolds, R. T. (1993) Habitable zones\naround main sequence stars. Icarus, 101, 108-128.\nKinoshita, H. (1993) Motion of the orbital plane of a satellite due to a secular\nchange of the obliquity of its mother planet. CeMDA, 57, 359-368.\nKnutson, H. A., Charbonneau, D., Allen, L. E., Fortney, J. J., Agol, E., Cowan,\nN. B., Showman, A. P., Cooper, C. S., and Megeath, S. T. (2007) A map\nof the day-night contrast of the extrasolar planet HD 189733b. Nature, 447,\n26\n\n\f183-186.\nLane, A. P. and Irvine, W. M. (1973) Monchromatic phase curves and albedos\nfor the lunar disk. AJ, 78, 267-277.\nLaskar, J., Joutel, F., and Robutel, P. (1993) Stabilization of the Earth's\nobliquity by the Moon. Nature, 361, 615-617.\nLissauer, J. J., Dones, L., and Ohtsuki, K. (2000) Origin and evolution of\nterrestrial planet rotation, In Origin of the Earth and Moon, edited by K.\nRighter and R. Canup, LPI, Houston, pp. 101-112.\nMassons, J., Domingo, D., and Lorente, J. (1998) Annales Geophysicae, 16,\n331-341.\nMcCullough,\n\nP. R. (2008) Models of Polarized Light from Oceans\n\nand Atmospheres of Earth-like Extrasolar Planets. submitted to ApJ,\narXiv:astro-ph/0610518.\nMinnis, P., Young, D. F., Wielicki, B. A., Sun-Mack, S., Trepte, Q. Z., Chen,\nY., Heck, P., and Dong, X. (2002) A Global Cloud Database from VIRS\nand MODIS fro CERES. SPIE 3rd International Asia-Pacific Environmental\nRemote Sensing Symposium, Remote Sensing of the Atmosphere, Ocean,\nEnvironment, and Space. Hangzhou, China. October 23-27, 2002.\nMuller, T. G., and Lagerros, J. S. V. (1998) Asteroids as far-infrared photometric standards for ISOPHOT. A&A, 338, 340-352.\nNorth, G. R., Cahalan, R. F., and Coakley, J. A. (1981) Energy balance climate\nmodels. Rev. Geophys. Space Phys., 19, 91-121.\nParisi, M. G. and Brunini, A. (1997) Constraints to Uranus' Great Collision-II\nP&SS, 45, 181-187.\n\n27\n\n\fPritchard, M. E. and Stevenson, D. J. (2000) Thermal aspects of a lunar origin\nby giant impact, In Origin of the Earth and Moon, edited by K. Righter and\nR. Canup, LPI, Houston, pp. 179-196.\nRivera, E. J. and 8 co-authors. (2005) A ∼ 7.5M⊕ planet orbiting the nearby\nstar GJ 876. ApJ, 634, 625-640.\nSelsis, F. (2004) The Atmosphere of Terrestrial Exoplanets: Detection and\nCharacterization. In Extrasolar Planets: Today and Tomorrow, ASP Conference Proceedings, edited by J. Beaulieu, A. Lecavelier des Etangs and C.\nTerquem, Institut D'Astrophysique de Paris, France, vol. 321, p. 170.\nTraub, W. A. and 25 co-authors. (2006) TPF-C: status and recent progress.\nSPIE Proceedings, 6268, 62680T.\nUdry, S. and 10 co-authors. (2007) The HARPS search for southern extrasolar planets XI. Super Earths (5 & 8 M⊕ ) in a 3-planet system. A&A, 469,\nL43-L47.\nWilliams, D. M., and Pollard, P. (2003) Extraordinary climates of Earth-like\nplanets: three-dimensional climate simulations at extreme obliquity. Inter.\nJ. Astrobio, 2, 1-19.\nWilliams, D. M. and Gaidos, E. J. (2008) Detecting the glint of starlight on\nthe oceans of distant planets. Icarus, 195, 927-937.\n\n28\n\n\fFigure 1. Calculated EBM (solid) and GCM (diamonds) light\ncurves of a high-obliquity (δ0 = 85◦ ) planet with Earth-like thermal properties. Light curves are shown for three values of inclination. L0 = 120◦ (defined with respect to the vernal equinox)\nis used for both models. The two models are in close agreement\nregarding the amplitude of the planetary signal, however the\nphase of the EBM calculations tend to lag by ∼ 35◦ .\n\n29\n\n\f!0\n\nvernal equinox\n\nL0\ninferior\nconjunction\n\nFigure 2. Planet and satellite at five uniformly-spaced orbital\nlongitudes. The vernal equinox corresponds to L = 0 and inferior conjunction to L = L0 . The disk-averaged flux from the\nEarth-like planet, which has a high thermal inertia, varies only\nwith seasonal surface temperature differences between the two\nhemispheres. The disk-average flux from the Moon-like satellite,\nwhich has a low thermal inertia, depends on its observed phase.\nThe observed phase of the satellite depends only on its orbit\naround the star, not around the planet.\n\n30\n\n\fFigure 3. Simulated light curves and observations of an EarthMoon \"twin\". The bottom panel shows disk-averaged flux while\nthe top displays the normalized light curves. In both panels the\ndotted curve is the planetary seasonal flux and the solid curve\nis the \"true\" planet+satellite light curve. The dash-dot curve in\nthe bottom panel is the satellite contribution. In the top panel\nthe sample points are indicated by X's with one-sigma error\nbars for a S/N = 10. The best fit, planet-only light curve to the\nsample points is represented by the dashed line. The top panel\nlight curves have been normalized by their mean to remove any\ndependence on the radius of the planet.\n\n31\n\n\fFigure 4. The L0 averaged probability of satellite detection\nas a function of planetary obliquity for a range of satellite radii\n(0.16, 0.22, 0.27, 0.33, 0.38 and 0.44 planetary radii). The radius\nof the Moon is 0.27 R⊕ . These simulations were performed with\n5 evenly-spaced observations and a S/N of 10. As the radius of\nthe satellite increases it becomes increasingly difficult to explain\nthe sample measurements with a planet-only light curve, thus\nthe probability of detection increases.\n\n32\n\n\fFigure 5. Similar to Figure 4, except for the \"characterization\" observing scheme: 14 sample points with a S/N of 20,\ndistributed around 50% of the planet's orbit. Although the S/N\nis higher than the observations of Figure 4, the distribution of\nsample points around only 50% of the orbit makes it difficult to\ndetect satellites of small radii (≤ 0.33 planetary radii).\n\n33\n\n\fFigure 6. Similar to Figure 5, except that a 35◦ phase shift\nhas been applied to all EBM planetary light curves so that they\nagree with the GENESIS 2 GCM. Using these pseudo-GCM light\ncurves the detection probability actually increases relative to the\nEBM case (Figure 5). This suggests that the EBM places a lower\nlimit on the probability of satellite detection.\n\n34\n\n\fFigure 7. Error induced in the light curve analysis by an undetected satellite. The vectors point from the true (δ0 , L0 ) pair\nthat is used to generate the planet+satellite light curve, towards\nthe best fit planet-only (δ0 , L0 ) pair. For clarity, the length of\nthe vectors have been scaled to the amount of induced error.\nTheir endpoints do not actually fall on the best-fit (δ0 , L0 ) values. Nearly all best fit values cluster at high obliquity and L0\nvalues of ∼ 90◦ or ∼ 270◦.\n\n35\n\n\f"}