{"id": "http://arxiv.org/abs/0812.1001v1", "guidislink": true, "updated": "2008-12-04T18:35:17Z", "updated_parsed": [2008, 12, 4, 18, 35, 17, 3, 339, 0], "published": "2008-12-04T18:35:17Z", "published_parsed": [2008, 12, 4, 18, 35, 17, 3, 339, 0], "title": "Multipole surface solitons in layered thermal media", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0812.0304%2C0812.4493%2C0812.4132%2C0812.5098%2C0812.2314%2C0812.4142%2C0812.2467%2C0812.3141%2C0812.4259%2C0812.1828%2C0812.3853%2C0812.0830%2C0812.2460%2C0812.2118%2C0812.3786%2C0812.2374%2C0812.1376%2C0812.0093%2C0812.4691%2C0812.0261%2C0812.2201%2C0812.0057%2C0812.3969%2C0812.1224%2C0812.0716%2C0812.2524%2C0812.0815%2C0812.1001%2C0812.3797%2C0812.4490%2C0812.1029%2C0812.4033%2C0812.2795%2C0812.2220%2C0812.1217%2C0812.1856%2C0812.2022%2C0812.3903%2C0812.1613%2C0812.0080%2C0812.3077%2C0812.3108%2C0812.0358%2C0812.3451%2C0812.0485%2C0812.4138%2C0812.2420%2C0812.1015%2C0812.4373%2C0812.3861%2C0812.0336%2C0812.2686%2C0812.3182%2C0812.1416%2C0812.5111%2C0812.3018%2C0812.5090%2C0812.4810%2C0812.4845%2C0812.1251%2C0812.1423%2C0812.1073%2C0812.3304%2C0812.4777%2C0812.0322%2C0812.2604%2C0812.4594%2C0812.0677%2C0812.4518%2C0812.1618%2C0812.1793%2C0812.1303%2C0812.1361%2C0812.2984%2C0812.4993%2C0812.4247%2C0812.0208%2C0812.3527%2C0812.1189%2C0812.1266%2C0812.0786%2C0812.3951%2C0812.0032%2C0812.2766%2C0812.0537%2C0812.2979%2C0812.0074%2C0812.0773%2C0812.2334%2C0812.0799%2C0812.3429%2C0812.0059%2C0812.2146%2C0812.1607%2C0812.2231%2C0812.4706%2C0812.2237%2C0812.1450%2C0812.0076%2C0812.0763%2C0812.0201&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Multipole surface solitons in layered thermal media"}, "summary": "We address the existence and properties of multipole solitons localized at a\nthermally insulating interface between uniform or layered thermal media and a\nlinear dielectric. We find that in the case of uniform media, only surface\nmultipoles with less than three poles can be stable. In contrast, we reveal\nthat periodic alternation of the thermo-optic coefficient in layered thermal\nmedia makes possible the stabilization of higher order multipoles.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0812.0304%2C0812.4493%2C0812.4132%2C0812.5098%2C0812.2314%2C0812.4142%2C0812.2467%2C0812.3141%2C0812.4259%2C0812.1828%2C0812.3853%2C0812.0830%2C0812.2460%2C0812.2118%2C0812.3786%2C0812.2374%2C0812.1376%2C0812.0093%2C0812.4691%2C0812.0261%2C0812.2201%2C0812.0057%2C0812.3969%2C0812.1224%2C0812.0716%2C0812.2524%2C0812.0815%2C0812.1001%2C0812.3797%2C0812.4490%2C0812.1029%2C0812.4033%2C0812.2795%2C0812.2220%2C0812.1217%2C0812.1856%2C0812.2022%2C0812.3903%2C0812.1613%2C0812.0080%2C0812.3077%2C0812.3108%2C0812.0358%2C0812.3451%2C0812.0485%2C0812.4138%2C0812.2420%2C0812.1015%2C0812.4373%2C0812.3861%2C0812.0336%2C0812.2686%2C0812.3182%2C0812.1416%2C0812.5111%2C0812.3018%2C0812.5090%2C0812.4810%2C0812.4845%2C0812.1251%2C0812.1423%2C0812.1073%2C0812.3304%2C0812.4777%2C0812.0322%2C0812.2604%2C0812.4594%2C0812.0677%2C0812.4518%2C0812.1618%2C0812.1793%2C0812.1303%2C0812.1361%2C0812.2984%2C0812.4993%2C0812.4247%2C0812.0208%2C0812.3527%2C0812.1189%2C0812.1266%2C0812.0786%2C0812.3951%2C0812.0032%2C0812.2766%2C0812.0537%2C0812.2979%2C0812.0074%2C0812.0773%2C0812.2334%2C0812.0799%2C0812.3429%2C0812.0059%2C0812.2146%2C0812.1607%2C0812.2231%2C0812.4706%2C0812.2237%2C0812.1450%2C0812.0076%2C0812.0763%2C0812.0201&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We address the existence and properties of multipole solitons localized at a\nthermally insulating interface between uniform or layered thermal media and a\nlinear dielectric. We find that in the case of uniform media, only surface\nmultipoles with less than three poles can be stable. In contrast, we reveal\nthat periodic alternation of the thermo-optic coefficient in layered thermal\nmedia makes possible the stabilization of higher order multipoles."}, "authors": ["Yaroslav V. Kartashov", "Victor A. Vysloukh", "Lluis Torner"], "author_detail": {"name": "Lluis Torner"}, "author": "Lluis Torner", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1364/OL.34.000283", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/0812.1001v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0812.1001v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "15 pages, 5 figures, to appear in Optics Letters", "arxiv_primary_category": {"term": "physics.optics", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "physics.optics", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "nlin.PS", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0812.1001v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0812.1001v1", "journal_reference": "Optics Letters 34, 283 (2009)", "doi": "10.1364/OL.34.000283", "fulltext": "Multipole surface solitons in layered thermal media\nYaroslav V. Kartashov, Victor A. Vysloukh*, and Lluis Torner\nICFO-Institut de Ciencies Fotoniques, and Universitat Politecnica de Catalunya, Mediterranean Technology Park, 08860 Castelldefels (Barcelona), Spain\nWe address the existence and properties of multipole solitons localized at a thermally insulating interface between uniform or layered thermal media and a linear dielectric. We find\nthat in the case of uniform media, only surface multipoles with less than three poles can be\nstable. In contrast, we reveal that periodic alternation of the thermo-optic coefficient in layered thermal media makes possible the stabilization of higher order multipoles.\nOCIS codes: 190.0190, 190.6135\nUnder appropriate conditions the nonlinear response of suitable materials can be\nstrongly nonlocal, when material regions located far away from the laser beam waist are affected by the beam and contribute to the refractive index [1]. This may occur in materials\nexhibiting long-range electrostatic interactions, enhanced diffusion, transport processes, etc.\nFor example, nonlocality occurs in liquid crystals, where it affects the interactions between\nbeams [2,3] and results in formation of multipole solitons composed from several out-ofphase spots that can be stable only when the number of spots does not exceed four [4,5].\nThermal media may show even stronger nonlocalities [6-8] because the refractive index\nshape induced by light extends up to the sample borders, and it is always affected by the\nboundary conditions [9,10]. These conditions therefore strongly affect propagation of radiation, especially near the material surface. When the conditions for stationary near-surface\npropagation are met, surface waves form [11,12]. In nonlocal media such waves were studied\nat the interfaces of diffusive Kerr-type materials [13-15]. Recently fundamental surface\nwaves were observed in uniform focusing thermal media near its thermally insulating boundary attracting light [16]. Such two-dimensional interfaces can also support vortices and dipoles with nodal lines perpendicular to the interface [17]. Surface waves form with defocusing thermal nonlinearities too [18,19]. The properties of one-dimensional multipole surface\nsolitons at thermally insulating interfaces remain unexplored.\n\n1\n\n\fIn this Letter we reveal that such states possess specific restriction on the number of\npoles in stable soliton: Only solitons with less than three poles can be stable. Importantly,\nwe also found that if the thermal medium is made of layers with opposite sings of the\nthermo-optic coefficient [20], it can support stable surface multipoles of high orders. Light\nbeams propagating at interface of such layered medium induce a strong nonlinear lattice\nthat causes their dramatic reshaping with increase of power in contrast to multipoles at interfaces of uniform media.\nTo describe the propagation of light beams near the thermally-insulating interface of\nthermal medium we use a nonlinear Schrödinger equation for the dimensionless amplitude q\nof the light field coupled to the equation for normalized temperature variation T :\n\ni\n\n1 ∂2q\n∂q\n=−\n− σ(η)Tq,\n2 ∂η 2\n∂ξ\n\n1 ∂2q\n∂q\ni\n=−\n2 ∂η 2\n∂ξ\n\n∂2T\n=−q\n∂η 2\n\n2\n\nfor − L ≤ η ≤ 0,\n(1)\n\nfor η < −L and η > 0.\n\nHere η is the transverse coordinate; L is the width of the thermal medium; the parameter\n\nσ(η) = σb − σa sgn[sin(πη / d )] accounts for the variations of the thermo-optic coefficient between layers of width d ; σa , σb are the amplitude of variation and constant part of the\nnormalized thermo-optic coefficient; σ(η) > 0 corresponds to focusing, while σ(η) < 0 corresponds to defocusing nonlinearity. We assume that the refractive index of the surrounding\nlinear medium is equal to the unperturbed refractive index of the thermal material. Thus we\nsolve Eq. (1) with the boundary conditions T\n\nη=−L\n\n= 0 and ∂T / ∂η\n\nη =0\n\n= 0 , i.e. η = 0\n\nboundary is assumed thermally insulating (for example, due to large difference of thermal\nconductivities of contacting materials), while η = −L boundary is thermally stabilized by\nmeans of an external heat sink. We set L = 25.6 and d = 0.5 that is typical for experiments.\nThe soliton solutions (including perturbed ones) of Eq. (1) can be found in the form\n\nq = (w + u + iv )exp(ib ξ) , where w(η) is a stationary soliton solution, u(η, ξ ) and v(η, ξ ) are\nsmall perturbations that can grow with complex rate δ = δr + i δi upon propagation, and b\nis the propagation constant. Substitution of the light field in such form into Eq. (1) gives in\n\n2\n\n\fleading order equation for the stationary profile w , while in the next order one gets the linear eigenvalue problem\n\nδu = −\n\n1 d 2v\n− σTv + bv,\n2 d η2\n\n1 d 2u\nδv =\n+ σTu + σΔTw − bu,\n2 d η2\n\n(2)\n\nwhich holds for −L ≤ η ≤ 0 , while outside this region, for η < −L and η > 0 , one has\n0\n\nσ = 0 . The temperature perturbation stands for ΔT = −2∫ G (η, λ)w(λ)u(λ)dλ , with the\n−L\n\nresponse function G (η, λ) = −(η + L) for η ≤ λ and G (η, λ) = −(λ + L) for η ≥ λ .\nFirst, we consider the properties of multipoles at the edge of uniform thermal media\nwhen σa = 0 , σb = 1 . Representative shapes of such solitons are shown in Fig. 1. Such solitons reside mostly inside the thermal medium and only weakly penetrate into the linear region. The refractive index profile σT depicted in Fig. 1(d) explains the formation of a\nthermal lens that results in concentration of light in the vicinity of interface. Note that the\nrefractive index is nonzero in the entire thermal medium and decreases almost linearly toward its left border. In all multipoles in uniform media, the pole located farthest from the\ninterface always exhibits a higher amplitude. The higher the number of poles the larger the\npower U =\n\n∞\n\n∫−∞ q\n\n2\n\nd η carried by solitons at a fixed b . For lowest-order surface states, the\n\npower increases almost linearly with b [Fig. 2(a)]. The refractive index distribution broadens with increase of number of poles n . Increasing b results in the simultaneous contraction\nof all poles toward the interface and in the increase in amplitude and peak refractive index\nat the interface [Figs. 1(a)-1(c)].\nOne of the central results of this Letter is that only multipoles with number of poles\nn ≤ 2 were found to be stable in the case of thermally insulating interface in uniform media. This results resembles the constraint n ≤ 4 on the number of poles in stable multipoles\nin natural nonlocal materials found in [5]. Notice, however, that the presence of the interface\nresults in a more dramatic restriction on a number of spots that can be packed together into\nstable states. In the case of surface solitons with n > 2 the perturbation growth rate increases monotonically with b , at least far from the cutoff where δr (b) may exhibit a nonmonotonic behavior [Fig. 2(b)]. Also, δr increases with n at a fixed b .\n\n3\n\n\fImportantly, a periodic variation of thermo-optic coefficient was found to dramatically\nmodify the properties of surface solitons. Here we consider the case of alternating focusing\nand defocusing layers, i.e. σa = 1 , σb = 0 . A light beam entering such a medium selfinduces a nonlinear lattice that becomes more and more pronounced with increasing peak\namplitude, and that is strongly asymmetric because of the boundary conditions [Fig. 3(d)].\nIn that case the soliton peak may be localized in any of the focusing layers. Fundamental\nsurface solitons residing in the first layer exhibit pronounced oscillations on their left wings\n[Fig. 3(a)]. Increasing the peak amplitude results in concentration of light almost within a\nsingle surface layer. Multipoles with n > 1 centered at intermediate and high powers in second, third, etc focusing layers carry the number of poles equal to the number of layer where\nthe most pronounced peak is located [Figs. 3(b) and 3(c)]. The pole amplitudes decrease toward the interface much faster than in uniform medium. All multipoles feature strong inphase oscillations on their left wings. The power is a monotonically increasing function of b\n[Fig. 4(a)]. When power decreases, the left outermost pole shifts into the bulk of the thermal\nmedium, gradually jumping between neighboring focusing layers. This is readily visible in\nFig. 3(c). In contrast, when power increases light tends to concentrate almost within a single layer with number n , i.e. out-of-phase oscillations in layers n − 1 , n − 2 ,... also gradually vanish and one gets transformation of multipole soliton into fundamental-like looking\nstate with only small wings. Interestingly, the envelope of the refractive index σT for such\nsolitons exhibit almost flat plateau between the layer where soliton is located and interface.\nWe found that the periodic modulation of the thermo-optic coefficient dramatically\nmodifies stability of the multipole surface solitons. In such periodic media multipoles with\nhigher number of spots were found to be stable, provided that the light power exceeds a\nthreshold value. Thus, tripole solitons that were unstable in uniform thermal medium, in\nlayered medium exhibit only a single narrow instability domain [Fig. 4(b)]. This is the case\nfor all multipoles with n up to 10 that we considered here. Notice that the complexity of\nthe structure of instability domain, which for solitons with large number of spots is usually\nlocated close to low-power cutoff, increases with larger number of poles [see Fig. 4(c) showing instability domains for soliton with n = 10 ]. The results of such linear stability analysis\nwere always confirmed by direct simulations of propagation of perturbed multipoles in Eq.\n(1). Figure 5 shows examples of evolution of unstable [Fig. 5(a)] and stable [Fig. 5(b)] tripole solitons. Development of instability causes pronounced amplitude oscillations and\n\n4\n\n\ftransformation of the internal structure of unstable soliton, but since thermally insulating\ninterface tends to attract light, there is almost no radiation emission. Perturbed stable multipole propagate without any noticeable shape deformations.\nSummarizing, we showed that addition of periodic modulation of thermo-optic coefficient substantially modifies the properties and shapes of surface states localized near thermally insulating boundary of composite thermal medium. While a thermally insulating edge\nof uniform thermal medium can not support stable solitons with more than two poles, we\nfound that one can made stable higher-order multipoles in layered thermal media.\n*Visiting from Universidad de las Americas – Puebla, Mexico.\n\n5\n\n\fReferences with titles\n1.\n\nW. Krolikowski, O. Bang, N. I. Nikolov, D. Neshev, J. Wyller, J. J. Rasmussen,\nand D. Edmundson, \"Modulational instability, solitons and beam propagation in\nspatially nonlocal nonlinear media,\" J. Opt. B: Quantum and Semiclass. Opt. 6,\nS288 (2004).\n\n2.\n\nM. Peccianti, C. Conti, and G. Assanto, \"Interplay between nonlocality and nonlinearity in nematic liquid crystals,\" Opt. Lett. 30, 415 (2005).\n\n3.\n\nM. Peccianti, K. A. Brzdakiewicz, and G. Assanto, \"Nonlocal spatial soliton interactions in nematic liquid crystals,\" Opt. Lett. 27, 1460 (2002).\n\n4.\n\nX. Hutsebaut, C. Cambournac, M. Haelterman, A. Adamski, and K. Neyts, \"Singlecomponent higher-order mode solitons in liquid crystals,\" Opt. Comm. 233, 211\n(2004).\n\n5.\n\nZ. Xu, Y. V. Kartashov, and L. Torner, \"Upper threshold for stability of multipolemode solitons in nonlocal nonlinear media,\" Opt. Lett. 30, 3171 (2005).\n\n6.\n\nC. Rotschild, O. Cohen, O. Manela, M. Segev, and T. Carmon, \"Solitons in nonlinear media with an infinite range of nonlocality: first observation of coherent elliptic\nsolitons and of vortex-ring solitons,\" Phys. Rev. Lett. 95, 213904 (2005).\n\n7.\n\nC. Rotschild, M. Segev, Z. Xu, Y. V. Kartashov, L. Torner, and O. Cohen, \"Twodimensional multipole solitons in nonlocal nonlinear media,\" Opt. Lett. 31, 3312\n(2006).\n\n8.\n\nC. Rotschild, B. Alfassi, O. Cohen, and M. Segev, \"Long-range interactions between optical solitons,\" Nat. Phys. 2, 769 (2006).\n\n9.\n\nB. Alfassi, C. Rotschild, O. Manela, M. Segev, and D. N. Christodoulides, \"Boundary force effects exerted on solitons in highly nonlocal nonlinear media,\" Opt. Lett.\n32, 154 (2007).\n\n10.\n\nA. Minovich, D. Neshev, A. Dreischuh, W. Krolikowski, and Y. Kivshar, \"Experimental reconstruction of nonlocal response of thermal nonlinear optical media,\"\nOpt. Lett. 32, 1599 (2007).\n\n11.\n\nNonlinear surface electromagnetic phenomena, Ed. by H. E. Ponath and G. I.\nStegeman, North Holland, Amsterdam (1991).\n\n6\n\n\f12.\n\nD. Mihalache, M. Bertolotti, and C. Sibilia, \"Nonlinear wave propagation in planar\nstructures,\" Progr. Opt. 27, 229 (1989).\n\n13.\n\nP. Varatharajah, A. Aceves, J. V. Moloney, D. R. Heatley, and E. M. Wright,\n\"Stationary nonlinear surface waves and their stability in diffusive Kerr media,\"\nOpt. Lett. 13, 690 (1988).\n\n14.\n\nD. R. Andersen, \"Surface-wave excitation at the interface between diffusive Kerrlike nonlinear and linear media,\" Phys. Rev. A 37, 189 (1988).\n\n15.\n\nY. V. Kartashov, L. Torner, and V. A. Vysloukh, \"Lattice-supported surface solitons in nonlocal nonlinear media,\" Opt. Lett. 31, 2595 (2006).\n\n16.\n\nB. Alfassi, C. Rotschild, O. Manela, M. Segev, and D. N. Christodoulides, \"Nonlocal surface-wave solitons,\" Phys. Rev. Lett. 98, 213901 (2007).\n\n17.\n\nF. Ye, Y. V. Kartashov, and L. Torner, \"Nonlocal surface dipoles and vortices,\"\nPhys. Rev. A 77, 033829 (2008).\n\n18.\n\nY. V. Kartashov, F. Ye, V. A. Vysloukh, and L. Torner, \"Surface waves in defocusing thermal media,\" Opt. Lett. 32, 2260 (2007).\n\n19.\n\nY. V. Kartashov, V. A. Vysloukh, and L. Torner, \"Ring surface waves in thermal\nnonlinear media,\" Opt. Express 15, 16216 (2007).\n\n20.\n\nY. V. Kartashov, V. A. Vysloukh, and L. Torner, \"Propagation of solitons in thermal media with periodic nonlinearity,\" Opt. Lett. 33, 1774 (2008).\n\n7\n\n\fReferences without titles\n1.\n\nW. Krolikowski, O. Bang, N. I. Nikolov, D. Neshev, J. Wyller, J. J. Rasmussen,\nand D. Edmundson, J. Opt. B: Quantum and Semiclass. Opt. 6, S288 (2004).\n\n2.\n\nM. Peccianti, C. Conti, and G. Assanto, Opt. Lett. 30, 415 (2005).\n\n3.\n\nM. Peccianti, K. A. Brzdakiewicz, and G. Assanto, Opt. Lett. 27, 1460 (2002).\n\n4.\n\nX. Hutsebaut, C. Cambournac, M. Haelterman, A. Adamski, and K. Neyts, Opt.\nComm. 233, 211 (2004).\n\n5.\n\nZ. Xu, Y. V. Kartashov, and L. Torner, Opt. Lett. 30, 3171 (2005).\n\n6.\n\nC. Rotschild, O. Cohen, O. Manela, M. Segev, and T. Carmon, Phys. Rev. Lett.\n95, 213904 (2005).\n\n7.\n\nC. Rotschild, M. Segev, Z. Xu, Y. V. Kartashov, L. Torner, and O. Cohen, Opt.\nLett. 31, 3312 (2006).\n\n8.\n\nC. Rotschild, B. Alfassi, O. Cohen, and M. Segev, Nat. Phys. 2, 769 (2006).\n\n9.\n\nB. Alfassi, C. Rotschild, O. Manela, M. Segev, and D. N. Christodoulides, Opt.\nLett. 32, 154 (2007).\n\n10.\n\nA. Minovich, D. Neshev, A. Dreischuh, W. Krolikowski, and Y. Kivshar, Opt. Lett.\n32, 1599 (2007).\n\n11.\n\nNonlinear surface electromagnetic phenomena, Ed. by H. E. Ponath and G. I.\nStegeman, North Holland, Amsterdam (1991).\n\n12.\n\nD. Mihalache, M. Bertolotti, and C. Sibilia, Progr. Opt. 27, 229 (1989).\n\n13.\n\nP. Varatharajah, A. Aceves, J. V. Moloney, D. R. Heatley, and E. M. Wright, Opt.\nLett. 13, 690 (1988).\n\n14.\n\nD. R. Andersen, Phys. Rev. A 37, 189 (1988).\n\n15.\n\nY. V. Kartashov, L. Torner, and V. A. Vysloukh, Opt. Lett. 31, 2595 (2006).\n\n16.\n\nB. Alfassi, C. Rotschild, O. Manela, M. Segev, and D. N. Christodoulides, Phys.\nRev. Lett. 98, 213901 (2007).\n\n17.\n\nF. Ye, Y. V. Kartashov, and L. Torner, Phys. Rev. A 77, 033829 (2008).\n\n18.\n\nY. V. Kartashov, F. Ye, V. A. Vysloukh, and L. Torner, Opt. Lett. 32, 2260\n(2007).\n\n19.\n\nY. V. Kartashov, V. A. Vysloukh, and L. Torner, Opt. Express 15, 16216 (2007).\n\n8\n\n\f20.\n\nY. V. Kartashov, V. A. Vysloukh, and L. Torner, Opt. Lett. 33, 1774 (2008).\n\n9\n\n\fFigure captions\nFigure 1.\n\nProfiles of (a) fundamental, (b) dipole, (c) tripole solitons, and (d) refractive\nindex distributions for fundamental solitons with different b values. In all\ncases σa = 0 , σb = 1 . In gray regions σ > 0 .\n\nFigure 2.\n\n(a) Energy flow versus b for fundamental surface soliton. Circles correspond\nto profiles shown in Fig. 1(a). (b) δr versus b for higher-order solitons with\ndifferent number of poles. In all cases σa = 0 , σb = 1 .\n\nFigure 3.\n\nProfiles of (a) fundamental, (b) dipole, (c) tripole solitons with different b\nvalues, and (d) refractive index distributions for fundamental solitons with\n\nb = 5 (black curve) and b = 1 (red curve). In all cases σa = 1 , σb = 0 . In\ngray regions σ > 0 .\nFigure 4.\n\n(a) Energy flow versus b for fundamental surface soliton. Circles correspond\nto profiles shown in Fig. 3(a). δr versus b for solitons with n = 3 (b) and\nn = 10 (c). In all cases σa = 1 , σb = 0 .\n\nFigure 5.\n\nPropagation of perturbed tripole solitons with (a) b = 7.4 and (b) b = 8.0 . In\nboth cases σa = 1 , σb = 0 . White dashed line indicates interface position.\n\n10\n\n\f11\n\n\f12\n\n\f13\n\n\f14\n\n\f15\n\n\f"}