{"id": "http://arxiv.org/abs/0907.4874v1", "guidislink": true, "updated": "2009-07-28T10:07:06Z", "updated_parsed": [2009, 7, 28, 10, 7, 6, 1, 209, 0], "published": "2009-07-28T10:07:06Z", "published_parsed": [2009, 7, 28, 10, 7, 6, 1, 209, 0], "title": "Electronic structure and magnetic properties of the spin-1/2 Heisenberg\n  system CuSe2O5", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0907.4629%2C0907.0987%2C0907.1654%2C0907.4372%2C0907.4156%2C0907.5568%2C0907.4786%2C0907.4291%2C0907.1719%2C0907.2012%2C0907.3204%2C0907.5148%2C0907.0021%2C0907.0575%2C0907.3241%2C0907.3292%2C0907.3543%2C0907.1891%2C0907.3790%2C0907.2139%2C0907.1253%2C0907.2910%2C0907.0526%2C0907.2681%2C0907.4938%2C0907.0684%2C0907.4001%2C0907.5271%2C0907.4084%2C0907.4612%2C0907.3699%2C0907.0189%2C0907.1350%2C0907.3759%2C0907.4647%2C0907.3453%2C0907.2102%2C0907.0652%2C0907.4762%2C0907.4920%2C0907.3071%2C0907.4627%2C0907.4311%2C0907.4874%2C0907.1723%2C0907.2392%2C0907.0950%2C0907.3316%2C0907.2968%2C0907.4166%2C0907.2028%2C0907.2190%2C0907.0892%2C0907.3791%2C0907.3932%2C0907.0333%2C0907.2201%2C0907.0386%2C0907.1988%2C0907.0195%2C0907.3021%2C0907.3289%2C0907.5441%2C0907.1194%2C0907.0381%2C0907.3130%2C0907.3826%2C0907.0606%2C0907.1257%2C0907.2023%2C0907.2167%2C0907.1093%2C0907.5024%2C0907.3671%2C0907.2998%2C0907.5557%2C0907.5171%2C0907.3427%2C0907.4421%2C0907.3822%2C0907.2383%2C0907.0134%2C0907.1999%2C0907.4493%2C0907.0989%2C0907.1890%2C0907.4072%2C0907.1642%2C0907.3471%2C0907.4899%2C0907.3636%2C0907.0567%2C0907.0295%2C0907.5304%2C0907.4980%2C0907.1147%2C0907.0673%2C0907.3806%2C0907.4598%2C0907.2183%2C0907.0913&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Electronic structure and magnetic properties of the spin-1/2 Heisenberg\n  system CuSe2O5"}, "summary": "A microscopic magnetic model for the spin-1/2 Heisenberg chain compound\nCuSe2O5 is developed based on the results of a joint experimental and\ntheoretical study. Magnetic susceptibility and specific heat data give evidence\nfor quasi-1D magnetism with leading antiferromagnetic (AFM) couplings and an\nAFM ordering temperature of 17 K. For microscopic insight, full-potential DFT\ncalculations within the local density approximation (LDA) were performed. Using\nthe resulting band structure, a consistent set of transfer integrals for an\neffective one-band tight-binding model was obtained. Electronic correlations\nwere treated on a mean-field level starting from LDA (LSDA+U method) and on a\nmodel level (Hubbard model). In excellent agreement of experiment and theory,\nwe find that only two couplings in CuSe2O5 are relevant: the nearest-neighbour\nintra-chain interaction of 165 K and a non-frustrated inter-chain coupling of\n20 K. From a comparison with structurally related systems (Sr2Cu(PO4)2,\nBi2CuO4), general implications for a magnetic ordering in presence of\ninter-chain frustration are made.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0907.4629%2C0907.0987%2C0907.1654%2C0907.4372%2C0907.4156%2C0907.5568%2C0907.4786%2C0907.4291%2C0907.1719%2C0907.2012%2C0907.3204%2C0907.5148%2C0907.0021%2C0907.0575%2C0907.3241%2C0907.3292%2C0907.3543%2C0907.1891%2C0907.3790%2C0907.2139%2C0907.1253%2C0907.2910%2C0907.0526%2C0907.2681%2C0907.4938%2C0907.0684%2C0907.4001%2C0907.5271%2C0907.4084%2C0907.4612%2C0907.3699%2C0907.0189%2C0907.1350%2C0907.3759%2C0907.4647%2C0907.3453%2C0907.2102%2C0907.0652%2C0907.4762%2C0907.4920%2C0907.3071%2C0907.4627%2C0907.4311%2C0907.4874%2C0907.1723%2C0907.2392%2C0907.0950%2C0907.3316%2C0907.2968%2C0907.4166%2C0907.2028%2C0907.2190%2C0907.0892%2C0907.3791%2C0907.3932%2C0907.0333%2C0907.2201%2C0907.0386%2C0907.1988%2C0907.0195%2C0907.3021%2C0907.3289%2C0907.5441%2C0907.1194%2C0907.0381%2C0907.3130%2C0907.3826%2C0907.0606%2C0907.1257%2C0907.2023%2C0907.2167%2C0907.1093%2C0907.5024%2C0907.3671%2C0907.2998%2C0907.5557%2C0907.5171%2C0907.3427%2C0907.4421%2C0907.3822%2C0907.2383%2C0907.0134%2C0907.1999%2C0907.4493%2C0907.0989%2C0907.1890%2C0907.4072%2C0907.1642%2C0907.3471%2C0907.4899%2C0907.3636%2C0907.0567%2C0907.0295%2C0907.5304%2C0907.4980%2C0907.1147%2C0907.0673%2C0907.3806%2C0907.4598%2C0907.2183%2C0907.0913&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "A microscopic magnetic model for the spin-1/2 Heisenberg chain compound\nCuSe2O5 is developed based on the results of a joint experimental and\ntheoretical study. Magnetic susceptibility and specific heat data give evidence\nfor quasi-1D magnetism with leading antiferromagnetic (AFM) couplings and an\nAFM ordering temperature of 17 K. For microscopic insight, full-potential DFT\ncalculations within the local density approximation (LDA) were performed. Using\nthe resulting band structure, a consistent set of transfer integrals for an\neffective one-band tight-binding model was obtained. Electronic correlations\nwere treated on a mean-field level starting from LDA (LSDA+U method) and on a\nmodel level (Hubbard model). In excellent agreement of experiment and theory,\nwe find that only two couplings in CuSe2O5 are relevant: the nearest-neighbour\nintra-chain interaction of 165 K and a non-frustrated inter-chain coupling of\n20 K. From a comparison with structurally related systems (Sr2Cu(PO4)2,\nBi2CuO4), general implications for a magnetic ordering in presence of\ninter-chain frustration are made."}, "authors": ["O. Janson", "W. Schnelle", "M. Schmidt", "Yu. Prots", "S. -L. Drechsler", "S. K. Filatov", "H. Rosner"], "author_detail": {"name": "H. Rosner"}, "author": "H. Rosner", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1088/1367-2630/11/11/113034", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/0907.4874v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0907.4874v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "20 pages, 8 figures, 3 tables", "arxiv_primary_category": {"term": "cond-mat.str-el", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cond-mat.str-el", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0907.4874v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0907.4874v1", "journal_reference": "New J. Phys. 11, 113034 (2009)", "doi": "10.1088/1367-2630/11/11/113034", "fulltext": "arXiv:0907.4874v1 [cond-mat.str-el] 28 Jul 2009\n\nElectronic structure and magnetic properties of\nthe spin-1/2 Heisenberg system CuSe2O5\nO Janson1 , W Schnelle1 , M Schmidt1 , Yu Prots1,\nS-L Drechsler2 , S K Filatov3 , H Rosner1\n1\n\nMax-Planck-Institut für Chemische Physik fester Stoffe, Nöthnitzer Str. 40, 01187\nDresden, Germany\n2\nLeibniz-Institut für Festkörper- und Werkstoffforschung Dresden, P.O. Box 270116,\n01171 Dresden, Germany\n3\nDepartment of Crystallography, St. Petersburg State University, Universitetskaya\nnab. 7/9, St. Petersburg, 199034, Russia\nE-mail: rosner@cpfs.mpg.de, janson@cpfs.mpg.de\nAbstract. A microscopic magnetic model for the spin-1/2 Heisenberg chain\ncompound CuSe2 O5 is developed based on the results of a joint experimental and\ntheoretical study. Magnetic susceptibility and specific heat data give evidence for quasi1D magnetism with leading antiferromagnetic (AFM) couplings and an AFM ordering\ntemperature of 17 K. For microscopic insight, full-potential DFT calculations within\nthe local density approximation (LDA) were performed. Using the resulting band\nstructure, a consistent set of transfer integrals for an effective one-band tight-binding\nmodel was obtained. Electronic correlations were treated on a mean-field level starting\nfrom LDA (LSDA+U method) and on a model level (Hubbard model). In excellent\nagreement of experiment and theory, we find that only two couplings in CuSe2 O5 are\nrelevant: the nearest-neighbour intra-chain interaction of 165 K and a non-frustrated\ninter-chain coupling of 20 K. From a comparison with structurally related systems\n(Sr2 Cu(PO4 )2 , Bi2 CuO4 ), general implications for a magnetic ordering in presence of\ninter-chain frustration are made.\n\nPACS numbers: 71.20.-b, 75.50.Ee\n\n\f2\n1. Introduction\nLow-dimensional spin-1/2 systems attract much interest due to a variety of ground\nstates (GS) found in these systems which originates from an interplay between different\nexchange interactions and strong quantum fluctuations. There are, for instance, the\nspin-Peierls GS in CuGeO3 [1], the helical GS in LiCuVO4 [2], and the quantum\ncritical behaviour in Li2 ZrCuO4 [3, 4] etc. Besides, many of these materials (mostly\ncuprates, vanadates and titanates) appeared to be realizations of theoretically longstudied models in good approximation. One of the most prominent models is the spin1/2 nearest-neighbour (NN) chain described by the Heisenberg Hamiltonian, for which\nthe exact solution has been derived by Bethe [5]. The first compounds proposed to be\ngood material realizations of this model were Sr2 CuO3 and Ca2 CuO3 [6, 7]. Recently,\nSr2 Cu(PO4 )2 and Ba2 Cu(PO4 )2 were suggested as even better realizations [8]–[12],\nfollowed by a study of K2 CuP2 O7 [13] that qualified this compound to be the best\nrealization of the spin-1/2 NN Heisenberg chain up to date. As a natural consequence\nof its simplicity, this model poorly describes one-dimensional and quasi-one-dimensional\nsystems where additional interactions, like longer range couplings or anisotropies, are\npresent. Thus, extensions of this model are required to allow an accurate description of\nreal materials.\nThe simplest extension of the model is the inclusion of a next-nearest-neighbour\n(NNN) coupling J2 leading to the so-called zig-zag chain model. In case of an\nantiferromagnetic (AFM) J2 both NN and NNN couplings cannot be simultaneously\nsatisfied, in other words, the system is magnetically frustrated. Here, the intra-chain\nfrustration enriches the phase diagram with the spiral GS, the gapped AFM GS and a\nquantum critical point at J2 /J1 = −0.25 [14]–[17]. The evaluation of the two parameters\nin the zig-zag chain model allows to estimate quantities which can be directly measured\nor derived from experiments, namely spin-spin correlation functions, thermodynamic\nproperties and the response in high magnetic fields. Nevertheless, this model fails to\ndescribe phenomena like long-range magnetic ordering, since one- or two-dimensional\nsystems do not order at finite temperatures according to the Mermin-Wagner theorem.\nThus, to account for magnetic ordering, the inter-chain (IC) coupling has to be included\nin the model. This problem has been addressed in a series of theoretical works [18]–\n[25], but the simplifications that had to be made to keep the models solvable (at\nleast approximately) impede an accurate description of complex situations. The spin1/2 Heisenberg chain system Sr2 Cu(PO4 )2 is the most prominent example for a huge\ndiscrepancy (two orders of magnitude) between the theoretical (adopting a simple NN\ninter-chain coupling) and the experimentally observed ordering temperature. The origin\nof this discrepancy is hidden in the effects of magnetic frustration and anisotropy, and\nthe disentanglement of the effects is difficult. Thus, a reliable theoretical description of\nthis phenomenon is still missing.\nA natural way towards a deeper understanding is the search for real material\nrealizations of \"easy\" models. For such systems, the experimental data can be\n\n\f3\nsupplemented by reliable microscopic models. This way, joint experimental and\ntheoretical studies can challenge and improve the existing theoretical approaches.\nCu2+ phosphates are up to date the best realizations of the NN spin-1/2 Heisenberg\nchain model [8, 10, 13] and could have a great potential for the discovery of further\nlow-dimensional systems. Unfortunately, the experimental information about these\nmaterials is rather limited since they are up to now available as powders only,\nalthough several attempts have been made to grow single crystals required for advanced\nexperimental studies.\nIn this paper, the structurally closely related compound, CuSe2 O5 , is investigated.\nSince selenites are often susceptible to chemical transport, the advantage of this material\nis the potential to grow large single crystals of high quality. Previous studies on a powder\nsample [26] may hint a 1D character of its magnetic properties, but the low-temperature\ndata are strongly affected by impurities (figure 3 in [26]). Therefore, to probe the 1D\nnature of the system, a new detailed study on high quality samples with lower defect\nconcentration is desirable.\nThough the chain-like arrangement of CuO4 squares in CuSe2 O5 is topologically\nsimilar to that in Cu2+ phosphates, the geometry of magnetic coupling paths between\nthe structural chains is essentially different. Thus, the role of magnetic frustration,\nwhich is ruled by the inter-chain coupling, can be evaluated in a comparative study.\nThe paper is organized as follows. In section 2 we describe the synthesis, sample\ncharacterization and experimental as well as theoretical methods used in this work.\nIn section 3, we discuss the crystal structure of CuSe2 O5 in comparison to related\nsystems. Section 4 reports the results of our measurements and theoretical calculations\nand proposes an appropriate microscopic model. A brief summary and an outlook are\ngiven in section 5.\n2. Method and sample characterization\nSingle crystals of CuSe2 O5 were grown by chemical vapour transport using TeCl4 as a\ntransport agent. Using a micro-crystalline powder of CuSe2 O5 (obtained from a mixture\nof CuO and SeO2 at 723 K) as a source, the transport experiments were carried out in\nan endothermic reaction of T2 (source) 653 K to T1 (sink) 553 K.\nThe obtained crystals have a green colour and form strongly elongated (along [001])\nplates, which macroscopically look like needles. The typical length of a needle is 5–\n10 mm and the width does not exceed 1 mm and for most crystallites it is considerably\nsmaller. The slight disorientation of plates forming a needle intricates a precise X-ray\ndiffraction measurement on single crystals. Thus, the samples were characterized by Xray powder diffraction and energy-dispersive X-ray spectroscopy (EDXS) experiments.\nThe lattice parameters of the synthesized crystals are similar to those reported for\nCuSe2 O5 (table 1). The results of the EDXS analysis (Cu 32.78±0.31, Se 67.14±0.23)\nfor 13 points (2 crystals) yield Cu:Se ≈ 0.488±0.006, very close to the ideal ratio of 0.5.\nThus, the obtained single crystals represent an almost pure CuSe2 O5 phase.\n\n\f4\nMagnetization was measured in a SQUID magnetometer (1.8 – 350 K) in magnetic\nfields up to 1 T. Heat capacity (1.8 – 100 K) was determined by a relaxation method\nup to μ0 H = 9 T.\nDFT calculations were carried out using the full potential local orbital code (FPLO)\nversion 7.00-27 [27]. The standard basis set and the Perdew-Wang parameterization of\nthe exchange-correlation potential were used [28]. Strong on-site Coulomb interaction\nin the Cu 3d orbitals, insufficiently described in the LDA, was taken into account\nindependently (i) by mapping the LDA antibonding Cu-O dpσ bands onto a tightP\nP\nbinding model (Ĥ = i ǫi + <ij>σ tij (c†i,σ cj,σ + H.c.)) and subsequently via a Hubbard\nP\nP\nP\nmodel (Ĥ = i ǫi + <ij>σ tij (ĉi,σ ĉ†j,σ + H.c.) + Ueff i n̂i ,↑ n̂i ,↓ ) onto a Heisenberg model\nP\nˆ ˆ\n(Ĥ = <ij> Jij S~i S~j ) (the procedure is well justified for spin excitations in the strongly\n\ncorrelated limit (Ueff ≫ tij ) at half-filling (hni i = 1)) and (ii) by using the LSDA+U\nmethod [29] (Ud = 6.5 eV, Jd = 1 eV). For the LDA calculations, we used a k-mesh\nof 1296 k-points (355 points in the irreducible wedge), for LSDA+U calculations of\nsupercells irreducible k-meshes of 226, 242, 147 and 126 k-points were used. All kmeshes are well converged.\nQuantum Monte-Carlo simulations have been preformed on N = 1200 sites clusters\nof S = 1/2 spins (30 coupled chains of 40 sites each) using the ALPS software\npackage [30].\n3. Crystal structure and empirical magnetic models\n\nCrystal structures of cuprates are often subdivided into four large groups according\nto their dimensionality, which reflects how their elementary building blocks - CuO4\nplaquettes (planar or distorted) - are connected: they can be isolated (zerodimensional, 0D) or form chains (one-dimensional, 1D), layers (two-dimensional, 2D)\nor frameworks (three-dimensional, 3D). Although it is true for many systems that\nthe magnetic dimensionality follows the dimensionality of the crystal structure, the\nreal situations are often more complex, especially for 0D cases. There, the magnetic\ndimensionality is ruled by (i) the orientation of neighbouring plaquettes, and (ii) the\nposition of anion groups formed by non-magnetic atoms that bridge the magnetic\nplaquettes. In most cases, the connection between structural peculiarities and the\nappropriate magnetic model cannot be accounted for by applying simple empirical rules\n(for instance, Goodenough-Kanamori-Anderson rules).\nTherefore, an almost complete understanding of the macroscopic magnetic\nbehaviour for a certain system of this class can be achieved only basing on a\nrelevant microscopic model. The latter can be constructed either by using advanced\nexperimental techniques (for instance, inelastic neutron scattering) or theoretical (DFT)\ncalculations. Naturally, the most reliable approach is the combination of such a theory\nand experiment. Due to the complexity of such an analysis, it has been accomplished\nonly for a rather limited number of real systems.\nTwo well studied systems of this class - Bi2 CuO4 [31] and Sr2 Cu(PO4 )2 [8]\n\n\f5\n- are both structurally 0D cuprates, but antipodes with respect to their magnetic\nbehaviour. A drastic change of the magnetic coupling regime originates from the\narrangement of neighbouring plaquettes (figure 1, right panel: top and bottom):\nstacking (accompanied by additional twisting) of neighbouring plaquettes on top of\neach other makes Bi2 CuO4 a 3D magnet with TN ≈ 47 K [32] while in Sr2 Cu(PO4 )2\nthe plaquettes are arranged in a planar fashion (formally reminiscent of an edge-sharing\nchain with every second plaquette cut out), leading to a pronounced 1D behaviour and\na very low Néel temperature TN = 0.085 K [9]. In this context we mention that the\nmagnetic dimensionality of these systems is controlled by the dihedral angle φ between\nneighbouring plaquettes (figure 1, right panel, middle). In CuSe2 O5 , the magnetic\nplaquettes are isolated (like in Bi2 CuO4 and Sr2 Cu(PO4 )2 ) but tilted with respect to\neach other forming a dihedral angle φ of about 64◦ , i.e. in between φ = 0◦ for the\n3D Bi2 CuO4 and φ = 180◦ for the 1D Sr2 Cu(PO4 )2 (figure 1, right panel). Another\ncontrolling parameter is the direct Cu-Cu distance d. Again, CuSe2 O5 with d close to 4\nÅ lies in between d = 2.9 Å for Bi2 CuO4 and d = 5.1 Å for Sr2 Cu(PO4 )2 . Thus, CuSe2 O5\nis structurally in between the two closely related systems: the 3D magnet Bi2 CuO4 and\nthe 1D magnet SrCu2 (PO4 )2 . Does this analogy hold also for the magnetism? To answer\nthis question, additional arguments have to be addressed.\nBesides φ and d, further structural features provide a deeper insight into the crystal\nchemical aspects relevant for the magnetism. In CuSe2 O5 , two SeO3 pyramids sharing\nan oxygen atom (forming Se2 O5 polyanions) bridge neighbouring CuO4 plaquettes (see\nfigure 1). This structural peculiarity is reflected in the morphology of the synthesized\ncrystals (section 2): the needle-like shape with an elongation along [001] fits perfectly to\nstructural chains along c (figure 1) formed by alternation of CuO4 plaquettes and Se2 O5\npolyanion groups. From the topological similarity of this structural chain to the one in\nthe structure of Sr2 Cu(PO4 )2 (there, neighbouring plaquettes are bridged by two PO4\ntetrahedra) a 1D behaviour of CuSe2 O5 might be expected. A second argument supports\nthis proposition: in CuSe2 O5 , the structural chains are not connected by covalent\nbonds, making a strong inter-chain coupling unlikely, similar to Sr2 Cu(PO4 )2 , where\nthe neighbouring chains are well separated by Sr cations. These similarities of CuSe2 O5\nand Sr2 Cu(PO4 )2 may lead to the conclusion that both systems imply essentially the\nsame physics. However, a closer inspection of more subtle crystal chemical aspects\nimmediately reveals an important difference related to the inter-chain coupling. As\nit follows from the microscopic model [8], in Sr2 Cu(PO4 )2 there are two relevant NN\ninter-chain couplings (2.7 K), which are equivalent by symmetry. Together with an intrachain NN coupling (187 K), they induce magnetic frustration which commonly leads to a\nconsiderable decrease of the ordering temperature (TN =0.085 K). In CuSe2 O5 , these two\ninter-chain couplings are not symmetry-equivalent. Therefore, by reducing the strength\nof one of them, the frustration can be lifted.\nSo far, crystal chemical considerations provided us with a qualitative insight. For\na quantitative model, a microscopic analysis is required. Thus, in the next section a\nmicroscopic model basing on the results of DFT calculations is constructed.\n\n\f6\n\nBi2 CuO4\n\nφ\n\nCuSe2 O5\n\nSr2 Cu(PO4 )2\nFigure 1. Left panel: the crystal structure of CuSe2 O5 . Isolated CuO4 plaquettes\n(yellow) are bridged by SeO3 pyramids (gray) and form chains running along c. The\nchains are closely stacked in b direction, and well separated in the a direction. Right\npanel: geometry of \"chains\" formed by isolated CuO4 plaquettes. Neighbouring\nplaquettes are stacked and twisted with respect to each other in Bi2 CuO4 (top), tilted\nin CuSe2 O5 (middle) and form planar edge-sharing chains with every second plaquette\ncut out in Sr2 Cu(PO4 )2 (bottom). The non-magnetic groups (BiO4 , SeO3 and PO4\nfor Bi2 CuO4 , CuSe2 O5 and Sr2 Cu(PO4 )2 , respectively) bridging the neighbouring\nplaquettes are not shown.\n\nA prerequisite for an accurate modeling based on a band structure code is reliable\nstructural information. For CuSe2 O5 , two refinements of the same structural model\n(space group C2/c with four formula units per cell) have been proposed so far [33, 34].\nBoth structural data sets agree quite well with each other and with the lattice parameters\nof the synthesized samples (see table 1).‡ The reliability of the structural data has been\nindirectly confirmed a posteriori by the good agreement of calculated and experimentally\nmeasured quantities.\n4. Results and discussion\n4.1. Thermodynamical measurements\nThe first probe for the magnetic properties of a certain system is the measurement\nof magnetization (M) at various temperatures in a constant field (H) yielding\n‡ It is well known, that X-ray diffraction analyses may result in considerable inaccuracies for internal\ncoordinates of light elements (especially, hydrogen). These inaccuracies can have a large impact on the\nmagnetic properties [35]. Since there are no light atoms in CuSe2 O5 , we rely on the diffraction analysis\nand therefore, no structural relaxation has been performed.\n\n\f7\nTable 1. Comparison of measured lattice parameters a, b, c, the monoclinic angle β\nand the unit cell volume V of CuSe2 O5 with previously published data.\nparameter\na, Å\nb, Å\nc, Å\nβ, ◦\nV , Å3\n\nRef. [34]\n12.3869\n4.8699\n7.9917\n109.53\n447.13\n\nRef. [33]\n12.254\n4.858\n7.960\n110.70\n443.27\n\nthis work\n12.272\n4.856\n7.975\n110.91\n443.95\n\nthe temperature dependence of magnetic susceptibility (χ(T ) = M(T )/H). This\nmeasurement already yields valuable information on the magnetic dimensionality, the\nsign and the energy scale of leading couplings, the presence of a spin gap, the spin\nanisotropy and the quality (defects, purity) of a sample.\n\n1.5\n\n3\n\nexp., H || [001]\nexp., H ⊥ [001]\nBethe ansatz (J = 157.1 K, g = 2.14)\nBethe ansatz (J = 157.6 K, g = 2.00)\n\n0.5\n\n1/χ (10 mol / emu)\n\n1\n\n-3\n\nχ (10 emu / mol)\n\n1\n\n0.5\n\nH || ; θ = 166.5 K\nH ⊥; θ = 160.2 K\n\n0\n0\n\n100\n\n200\n\nT (K)\n\n300\n\n-200 -100\n\n0\n\n100 200 300\nT (K)\n\n0\n\nFigure 2. Left panel: magnetic susceptibility of CuSe2 O5 as a function of\ntemperature. The magnetizing field is 10 kOe. For the graphic presentation, we show\nonly one of each five measured points. The Bethe ansatz fits are shown with dashed and\nsolid lines. Right panel: inverse magnetic susceptibility as a function of temperature.\nCurie-Weiss fits (for T > 230 K) are shown with lines. The temperature-independent\ncontribution χ0 in the Curie-Weiss fits was set to zero.\n\nFor CuSe2 O5 , the magnetic susceptibility curves for both field orientations (figure 2,\nleft panel) have a broad maximum at Tmax ≈ 101 K and a finite value of χ at the\nlowest temperature measured (1.8 K), indicating the low-dimensional behaviour and\nthe absence of a spin gap. The high-temperature parts of the curves obey the CurieWeiss law χ(T ) = C/(T +θ) (figure 2, right panel; T > 220 K, Hk : θ = 165 K, C = 0.51,\ng = 2.32; H⊥ : θ = 170 K, C = 0.43, g = 2.15). The positive Curie-Weiss temperature\nevidences that the dominating couplings in CuSe2 O5 are antiferromagnetic. The shape\n\n\f8\nof the experimental curve reveals a close similarity to a spin-1/2 Heisenberg chain\nmodel. This model has an exact solution given by Bethe ansatz [5] and parametrized\nby Johnston et al. [36]. We have fitted the experimental curves using the parametrized\nsolution (figure 2, left panel).\nTo account for the deviation of the fitted curves from experimental ones we have\nfitted both curves independently§ and varied the temperature window. As a result,\nthe magnetic susceptibility measured perpendicular to needle-like crystallites can be\nperfectly fitted by a consistent set of parameters (J = 157.6 K, g = 2.00) in the whole\ntemperature range down to the ordering temperature, while the fit to the susceptibility\nmeasured parallel to the chains (J = 157.1 K, g = 2.14) shows deviations at low\ntemperatures (below Tmax ). This difference likely originates from a slight misalignment\nof microscopic plates in the needle-like crystallites.\nA phase transition is observed at 17 K for both orientations of the magnetizing\nfield. The nature of this magnetic transition can be understood by examination of\nthe low-temperature part of the curve (below the transition). The interpretation\nis straightforward as soon as we account for (i) impurity effects and (ii) effects of\n~ k , as shown above). Due to the\nmisalignment of the sample (relevant especially for H\nhigh quality of samples, the temperature region between the kink at 17 K down to 10 K\nis practically unaffected by defects (no Curie tail). In this range, χ⊥ decreases very\nslightly, while χk drops distinctly on cooling, following the theoretical result for ordered\ncollinear antiferromagnets [37]. We assign the slight decrease of χ⊥ (theory predicts it\nto be constant) to a small misalignment of crystallites, in agreement with the deviations\nof the Bethe ansatz fit. The small upturn in χk at about 6 K (a zero susceptibility\nat zero temperature follows from theory) is likely related to defects and paramagnetic\nimpurities.\nTo get additional information about the magnetic properties, we measured the\ntemperature dependence of the specific heat. The clear anomaly at 17 K (figure\n3) and the linear behavior of C/T 2 (T ) below this temperature are typical for\nantiferromagnets [38]. Thus, we interpret this as a transition to an AFM ordered state\n(TN = 17 K). Remarkably, the anomaly does not shift nor decrease in amplitude in\nmagnetic fields up to μ0 H = 9 T. Prior to the analysis of the magnetic behaviour\nabove TN , the specific heat should be decomposed into the magnetic contribution\n(which reflects the spectrum of magnetic excitations) and the phonon contribution (the\nspectrum of lattice vibrations). This decomposition is reliable only if the overlap of\nthe two spectra (magnetic excitations and phonons) is relatively small (see [39] for an\nexample). As the phonon contribution increases on temperature, the decomposition is\npossible for systems with weak magnetic couplings (Jij < 10 K). As we obtained from\nour susceptibility data, the energy scale of J in CuSe2 O5 is about 165 K. Thus, for a 1D\nHeisenberg chain we expect the maximum of the magnetic specific heat at 0.48J [36], i.e.\n§ A simultaneous fit of both curves implying the same J value in the whole temperature range down\nto the phase transition yields considerable deviations from experiment. The origin of this deviation is\ndiscussed below in the text.\n\n\f9\nclose to 80 K. At this temperature, the phonon contribution to the specific heat strongly\ndominates over the magnetic contribution. As a result, the experimental curve has no\nvisible features in the vicinity of 80 K. For systems with large couplings (Jij > 10 K),\nthe most accurate way to account for the phonon part is to measure an isostructural\nnon-magnetic reference system (see [40] for an example). In case of CuSe2 O5 , it is not\npossible, as ZnSe2 O5 has a different crystal structure [41], and thus a different phonon\nspectrum. Therefore, the specific heat data provide a clear evidence of an AFM ordering\nat 17 K but do not allow an independent justification of the temperature scale for the\nleading magnetic interactions.\n25\n\n30\n20\n\nμ0H = 9 T\n\n25\n\n10\n\n20\n\n0\n\n10\n\n15\n\n0\n\n10\n0\n\n5\n\n10\n\n20\n\n15\n\n15\n\n2\n\n-3\n\n3\n\nCp /T (10 J / mol K )\n\n20\n\nzero field\n\n5\n\n10\n\n5\n\n0\n\n0\n\n20\n\n40\n\n60\n\n80\n\n0\n100\n\nT (K)\nFigure 3. Cp /T 2 of CuSe2 O5 as a function of temperature and magnetic field. The\nNéel temperature is marked with a dashed line. Inset (ordered phase region): the\ncp ∼T 3 behaviour predicted by theory is complicated by a clear kink at 7 K.\n\nThe last remark concerns a pronounced kink at 7 K (figure 3, inset), i.e. the\nregion of the ordered phase. The kink is stable at least up to μ0 H = 9 T and thus not\nrelated to defects. Intriguingly, a similar feature has been observed for a related system\nBi2 CuO4 (figure 3 in [42]) favouring the intrinsic nature of the kink rather than a sample\ndependent effect. For the magnetic contribution to the specific heat, such features have\nbeen proposed to mark a dying out of high frequency spin wave modes [43]. To elucidate\nthis unusual feature, further experimental studies on CuSe2 O5 and similar systems as\nwell as a careful theoretical analysis should be carried out.\n4.2. Microscopic model\nWe start in our microscopic analysis with band structure calculations performed in\nthe local density approximation (LDA). LDA yields a valence band of about 9 eV width\n\n\f10\nformed mainly by Cu 3d, O 2p and Se 4p states (figure 4, right panel). The well-separated\ndouble-peak at the Fermi level εF contains two narrow, half-filled bands (figure 4, left\npanel). The width of this antibonding band complex (0.85 eV) is in between the widths\nof the same complex in Bi2 CuO4 (1.05 eV [31]) and Sr2 Cu(PO4 )2 (0.65 eV [8]). The LDA\nyields a metallic GS, contrary to the experimentally observed insulating behavior. This\ndiscrepancy is caused by the underestimate of strong on-site Coulomb interactions of the\nCu 3d electrons. Nevertheless, LDA reliably yields the relevant orbitals and dispersions.\nThus, we have a closer look to the band complex at εF . The two bands, relevant for\nthe low-lying magnetic excitations, are related to the antibonding dpσ orbital of a CuO4\nplaquette, i.e. the antibonding combination of Cu 3dx2−y2 and O 2pσ states (orbitals\nare denoted with respect to the local coordinate system). The antibonding dpσ orbital\nis well separated (∆E ∼ 0.5 eV) from the lower lying Cu 3d and O 2p states. Thus,\nthe most efficient way to describe the electronic structure is to construct an effective\none-band tight-binding (TB) model (one band per plaquette), parametrized by a set of\nelectron transfer integrals tij . The correlation effects, insufficiently described by LDA\nand thus by the TB model, are accounted for by adopting a corresponding Hubbard\nmodel mapped subsequently onto a Heisenberg model (this mapping is valid for spin\nexcitations in the strongly correlated limit at half-filling, both well justified for undoped\ncuprates with small magnetic exchange).\nPrior to numerical calculations, we compare the dispersions of the two well\nseparated bands at εF (figure 5) to dispersions of the corresponding antibonding dpσ\ncomplexes of Sr2 Cu(PO4 )2 (figure 2 in [8]) and Bi2 CuO4 (figure 5 in [31]). Here, a\nclose similarity of CuSe2 O5 and Sr2 Cu(PO4 )2 is revealed: both band structures have\na dominating dispersion along the chain direction (for CuSe2 O5 , this is the c-axis in\nfigure 1 and Γ-Z region in figure 4) and a weaker dispersion in other directions, unlike\nBi2 CuO4 , where the dispersions along different directions in the k-space are comparable,\nindicating a 3D behaviour.\nFor a quantitative analysis, we constructed an effective one-band TB Hamiltonian\nand determined the set of transfer integrals tij in order to get the best least-squares\nfit to the two LDA bands crossing εF . As an alternative approach, we used a Wannier\nfunctions (WF) technique which implies the construction of WF for the Cu 3dx2 −y2\nantibonding state, relevant for the magnetism, and the calculation of the overlap of\nthe WF. The results of the latter method are affected by the overlap of the relevant\n3dx2 −y2 antibonding state with other states. Therefore, for perfectly separated bands\nas in CuSe2 O5 , both methods should yield the same results within numerical accuracy.\nThe numerical evaluation supports this statement: the difference between the transfer\nintegrals obtained by the WF method and by the TB fit is tiny and does not exceed\n2 meV for individual tij values (the mean value for all tij is 0.2 meV). This deviation can\nbe considered as an error margin for the mapping procedure. Thus, for isolated bands\nthe WF method should not be regarded more accurate than a direct TB fit, but rather\nas an independent alternative procedure [10, 11, 12]. The agreement of the results using\nthe two independent mapping methods reflects the applicability of an effective one-band\n\n\f11\napproach.\nThe resulting set of the transfer integrals (table 2, first column) yields perfect\nagreement with the LDA bands (figure 5).k The hopping paths corresponding to the\nleading terms are shown in figure 5 (right panel).\n\nFigure 4. LDA band structure (left panel) and density of states (right panel) of\nCuSe2 O5 . Notation of k-points: Γ=(000), X=( πa 00), S=( πa πb 0), Y=(0 πb 0), Z=(00 πc ),\nR=( πa 0 πc ), A=( πa πb πc ), M=(0 πb πc ).\n\n0.4\n\nenergy (eV)\n\n0.2\n\ntc\ntcab\n\n0\n-0.2\n\nLDA\nTB\n\nt2c\nab\n\n-0.4\nΓ X\n\nt2c\nb\n\ntcb\n\nΓ\nZ R\nS Y\nwave vector\n\ntab\n\nA M\n\nFigure 5. Left panel: the tight-binding fit (circles) to the LDA band structure\n(antibonding dpσ band, solid line) Right panel: the superexchange paths for the leading\ntransfer integrals. The projection of the structure is the same as in Fig. 1.\n\nWe find that the leading couplings in CuSe2 O5 are the NN intra-chain coupling\ntc = 165 meV and one of the short inter-chain couplings tab ≈ 45 meV. The corresponding\nk To check the results for consistency, we have neglected all tij smaller than 10 meV and repeated the\nfitting. The difference of leading terms in both approaches did not exceed 10%.\n\n\f12\n\na\nb c\n\na\n\nc\n\nFigure 6. Wannier functions for the Cu 3dx2 −y2 orbital. Colours represent the sign\nof a Wannier function. Left panel: the Cu 3dx2 −y2 Wannier function plotted on top of\na CuO4 plaquette, visualizing the antibonding combination of Cu 3dx2 −y2 and O 2pσ\nstates, relevant for the magnetism. Central panel: the overlap of two Wannier functions\ncentered on the neighbouring Cu atoms (corresponds to the nearest neighbour intrachain coupling tc ). Note that the neighbouring plaquettes are tilted which leads to\na sizable π-overlap of the Wannier functions, and hence O 2p wave functions of the\nneighbouring plaquettes, allowing for a considerable ferromagnetic contribution to the\nmagnetic exchange. Right panel: the overlap of the Wannier functions corresponding\nto the leading inter-chain coupling tab .\n\nWannier functions are pictured in figure 6. The value of the largest (NN intrachain) coupling in CuSe2 O5 is slightly larger than the corresponding coupling in\nSr2 Cu(PO4 )2 (135 meV [8]). The difference in the largest inter-chain term is more\npronounced: the size of the inter-chain coupling in CuSe2 O5 (45 meV) is considerably\nhigher than in Sr2 Cu(PO4 )2 (16 meV [8]). Even more important is the difference in\nthe specific coupling geometry - whether it is constructive towards the long-range\nordering or not. As we stated while comparing the crystal structures of CuSe2 O5 and\nSr2 Cu(PO4 )2 (see section 3), in both systems there are two short inter-chain coupling\npaths. The corresponding couplings are identical (symmetry-related) in Sr2 Cu(PO4 )2 ,\nbut independent (and in fact, considerably different) in CuSe2 O5 . The TB analysis\nreveals that only one (tab ) of the two NN inter-chain couplings is relevant for CuSe2 O5\n(table 2). Consequently, the essential difference between the two systems can be best\nunderstood in terms of the spin lattices that are formed by the strongest intra-chain and\ninter-chain couplings, as depicted in figure 7. In Sr2 Cu(PO4 )2 , three relevant couplings\n(the intra-chain NN coupling and two identical inter-chain couplings) are arranged on an\nanisotropic triangular lattice (figure 7, left panel). By switching off one of the inter-chain\ncouplings, the topology of the relevant couplings changes, and the system is described\nby two couplings forming an anisotropic square lattice (figure 7, right panel). The\nmain difference between the two topologies is that in Sr2 Cu(PO4 )2 the competition of\nrelevant couplings, which can not be simultaneously satisfied, leads to strong magnetic\nfrustration, while in CuSe2 O5 the inter-chain couplings are not frustrated. The lifting\nof frustration in CuSe2 O5 has a remarkable influence on the physical properties as will\nbe discussed below.\nThe calculated transfer integrals provide valuable information on the coupling\nregime. To include the missing Coulomb interaction Ueff , as described in the section 2,\n\n\f13\n\nSr2 Cu(PO4 )2\n\nCuSe2 O5\n\n?\n\nFigure 7. Topology of inter-chain couplings in Sr2 Cu(PO4 )2 (left panel) and CuSe2 O5\n(right panel). Red lines denote the AFM coupling. Bold red lines highlight the chains.\nIn Sr2 Cu(PO4 )2 , the intra-chain and the two equivalent inter-chain couplings form\nan anisotropic triangular lattice. In CuSe2 O5 , there is only one relevant inter-chain\ncoupling resulting in an anisotropic square lattice geometry of intra-chain and interchain couplings. The former geometry leads to magnetic frustration, while the latter\nis not frustrated (see insets).\n\nwe can use the TB model to construct a Hubbard model and map the latter onto\na Heisenberg model to obtain the antiferromagnetic (AFM) exchange from JijAFM =\n4t2ij /Ueff . Using the same representative Ueff = 4.5 eV as for Sr2 Cu(PO4 )2 [8], we obtain\nAFM\nJcAFM = 285 K for the NN intra-chain exchange and Jab\n= 27 K for the largest interchain exchange. Other couplings yield values of AFM exchange less than 1.5 K (table 2,\nsecond column) and will be neglected in further discussion.\nTable 2. Leading transfer (first column) and exchange integrals (last column) of\nCuSe2 O5 . The AFM exchange (second column) is calculated via mapping the transfer\nintegrals onto an extended Hubbard (Ueff = 4.5 eV) and subsequently onto a Heisenberg\nmodel. The total exchange is taken from LSDA+U total energy calculations of\nFM\nsupercells. The ferromagnetic exchange Jij\nis evaluated as the difference between\nAFM\nJij and Jij .\npath\n\ntij /meV\n\nAFM\nJij\n/K\n\nFM\nJij\n/K\n\nJij /K\n\nXc\nX ab\nX 2c\nb\nX cab\nX cb\nX 2c\nab\n\n166\n51\n11\n10\n10\n7\n\n285\n27\n1.5\n1\n1\n0.5\n\n−120\n−7\n0\n0\n0\n0\n\n165\n20\n1.5\n1\n<1\n<1\n\nThe calculated leading magnetic exchange JcAFM = 285 K is considerably larger\nthan our estimate from the Bethe ansatz fit (≈155 K) based on experimental χ(T )\ndata. Moreover, it is larger than the corresponding exchange integral in Sr2 Cu(PO4 )2\n(187 K). This discrepancy originates from ferromagnetic (FM) contributions to the total\nmagnetic exchange, which are neglected in the mapping procedure. For the NN exchange\nJc , we expect a considerable FM contribution originating from the overlap of O 2p wave\nfunctions of neighbouring plaquettes. Due to a dihedral angle φ = 64◦ between the\nneighbouring plaquettes, this overlap has a sizable π contribution (this can be seen\n\n\f14\nin the WF in figure 6, central panel) leading to a Hund's rule (FM) coupling. For\nthe leading inter-chain coupling, the FM contribution is expected to be small due to a\npredominantly σ overlap of O 2p wave functions (figure 6, right panel).\nTo get a numerical estimate for the FM contribution, we perform total energy\ncalculations for various spin patterns of magnetic supercells using the LSDA+U method.\nThe method is rather sensitive to the Ud value. As Ud = 6.5 eV yields agreement\nbetween the calculated and experimentally measured exchange integrals of the well\nstudied La2 CuO4 and CuGeO3 , we adopted this value in the calculations for CuSe2 O5 .¶\nThe supercell method has limitations set by numerical accuracy for the small exchange\nintegrals (Jij < 1 K) and the size of the required supercells. In our case, we constructed\nsupercells and spin patterns that yield all exchange couplings which were found to\nbe relevant from the TB analysis. The resulting total energies are mapped onto a\nHeisenberg model, which is parameterized by the total exchange integrals (table 2, last\ncolumn) containing both AFM and FM contributions. Thus, by subtracting the AFM\npart JijAFM from the total exchange Jij , the FM contribution JijFM can be estimated\n(table 2, fourth column).\nIn general, LSDA+U calculations yield a reliable estimate for exchange integrals [8,\n13, 31, 39]. This reliability holds for CuSe2 O5 : we obtain Jc = 165 K and Jab = 20 K, in\nalmost perfect agreement with the estimates from magnetic susceptibility. In accordance\nwith our expectations, JcFM = −120 K has a considerable contribution to the total\nFM\nexchange Jc , while Jab\n= −7 K yields a smaller correction to the Jab value. We should\nnote that the large ferromagnetic contribution JcFM = −120 K may originate, in addition\nto the mentioned π-overlap of O 2p wave functions, also from a destructive interference\nof coupling paths [44] or by a strong coupling to ligands [45]. Which of these mechanisms\nplays a leading role in CuSe2 O5 is an open question. This issue is, however, beyond the\nscope of the present paper and needs further theoretical investigation.\nThough the calculated Jc value (165 K) is very close to the estimate from the Bethe\nansatz (157 K), we decided to check the exchange integrals for consistency by performing\nadditional calculations for Ud = 6.0 eV and Ud = 7.0 eV. Besides the expected change\nof exchange integrals (0.5 eV increase of the Ud results in about 20% decrease of Jij\nand vice versa), we found that the ratio α ≡ Jab /Jc of the leading exchange integrals\n(α = 0.121 for Ud = 6.0 eV, α = 0.129 for Ud = 6.5 eV and α = 0.136 for Ud = 7.0 eV)\nis rather stable with respect to the Ud value.\nThus, the consideration of the FM contribution yielded a valuable improvement of\nAFM\nthe energy scale comparing to the AFM exchange values JcAFM and Jab\n, but the ratio\nα of the two couplings, that is the most relevant for the magnetic ground state, stays\nalmost unchanged. Moreover, this ratio is stable with respect to the model parameters\nUeff and Ud , leading to a very reliable physical picture: CuSe2 O5 can be described as\n¶ It is worth to note, that the Ud parameter is not universal and depends on a calculational scheme\nand consequently on the basis set implemented in a code. Thus, different Ud values adopted in this\nwork for CuSe2 O5 (Ud = 6.5 eV, the code fplo version 7.00-27) and for Sr2 Cu(PO4 )2 (Ud = 8.0 eV [8],\nthe code fplo version 5.00-18) originate from the different basis used in the codes.\n\n\f15\na quasi-1D system with AFM chains characterized by an NN intra-chain exchange of\n165 K. Each chain is coupled to two neighbouring chains by the non-frustrated interchain exchange of 20 K (one order of magnitude smaller that the intra-chain coupling).\n4.3. Simulations\nTurning back to the discussion about the ordering temperature (section 1), it is\nreasonable to point out the advantages of CuSe2 O5 as a model system. First, we have\nevidence from both theory and experiment that the system is mainly 1D. Secondly, the\nmicroscopic analysis revealed that the NNN intra-chain coupling is practically absent\nleading to a valuable simplification for a theoretical analysis. Finally, there is only\none relevant inter-chain coupling. The fact that this latter coupling is not frustrated\nallows to use the powerful quantum Monte Carlo (QMC) method for a simulation of\nthermodynamical data with a subsequent comparison to the experimentally measured\ncurves. The results of the simulations are given in figure 8 in comparison with the\nBethe ansatz fits (where the inter-chain coupling is neglected). Obviously, the inclusion\nof the inter-chain coupling yields only a tiny improvement with respect to the Bethe\nansatz fits. This fact demonstrates a posteriori the importance of a microscopic model\nfor systems like CuSe2 O5 : apart from the microscopic modelling, there is no reliable\nway to account for the small inter-chain coupling directly from measurements of the\nparamagnetic susceptibility.\n\n1\n\n-3\n\nχ (10 emu / mol)\n\n1.5\n\n1.6\n\n1.5\n\nexp., H || [001]\nexp., H ⊥ [001]\n\n0.5\n\nBethe ansatz (J = 157.1 K, g = 2.14)\n\n1.4\n\nBethe ansatz (J = 157.6 K, g = 2.00)\nQMC (J = 152.7 K, g = 2.16)\n\n0\n0\n\n1.3\n60\n\nQMC (J = 154.3 K, g = 2.02)\n80\n\n100\n\n120\n\n140\n\n100\n\n200\n\n300\n\nT (K)\n\nFigure 8. Comparison of Bethe ansatz and quantum Monte Carlo (QMC) fits to the\nexperimental magnetic susceptibility. The temperature-independent contribution χ0\nin both fits was set to zero.\n\n\f16\n4.4. Estimation of the Néel temperature\nTo benefit from the unique combination of the simple microscopic picture and the\nexperimentally well-determined AFM ordering temperature TN , we make an attempt to\nestimate TN from an available simplified theory using the calculated exchange integrals.\nStill, there are three problems, intrinsic for quasi-1D systems, to be accounted for. The\nfirst is the spatial anisotropy of exchange couplings present in a system. This problem\nis resolved in CuSe2 O5 only partially. On one hand, there is only one relevant interchain coupling for every pair of neighbouring chains, but on the other hand, it couples a\ncertain chain with only two of four neighbouring chains. Thus, the couplings to the other\ntwo chains are considerably smaller, resulting in the (spatial) exchange anisotropy. The\nsecond problem is the anisotropy in the spin space. In our microscopic approach, we used\nthe isotropic Heisenberg model where this anisotropy is neglected. Although we observe\na remarkable agreement between the microscopic model and the macroscopic behaviour,\nthe spin anisotropy is present, as evidenced for instance by the strong dependence of\nthe g-factor on the orientation of a magnetizing field (figure 2). In a common sense\napproach, the (spatial) exchange anisotropy is expected to lower TN , while the spin\nanisotropy raises it. In each system, these two effects are balanced. Attempts to find\na suitable description for this balance were made in a number of advanced theoretical\nstudies based on a mean-field formalism [18, 19], [21]–[24]. Still, the problem seems\nnot to be resolved, since a considerable disagreement remains between the numerical\nresults yielded by different theories (none of which is generally accepted) and, even more\nimportant, due to the third problem - the problem of inter-chain magnetic frustration,\nwhich has not been addressed, so far.\nHere, we make an empirical attempt to estimate how the frustration influences the\nmagnetic ordering. For that purpose, we compare several quasi-1D magnetic compounds\nin a systematic way. The two well studied quasi-1D cuprates Sr2 CuO3 and Ca2 CuO3\nare commonly referred as model systems in most theoretical studies regarding the TN\nproblem. We should note that these two systems are essentially different from CuSe2 O5\ndue to the presence of corner-sharing chains of CuO4 plaquettes, which results in\none order of magnitude larger NN coupling. In addition, the NNN coupling is not\nnegligible [6]. Nevertheless, they are referred here for the sake of completeness. In\nboth, Sr2 CuO3 and Ca2 CuO3 , one of the relevant inter-chain couplings is frustrated. To\ncalculate TN , we use formulas given by Schulz [19], Irkhin and Katanin [21] and Yasuda et\nal. [23]. The calculated TN are given in the three last columns of (table 3). Disregarding\nthe method used, the calculated TN considerably overestimate the experimental values\nfor Sr2 CuO3 and Ca2 CuO3 (table 3, fifth column).\nA theoretical approach is expected to work better for systems with more pronounced\n1D nature - e.g. Sr2 Cu(PO4 )2 and K2 CuP2 O7 . The structural peculiarities of these\nsystems were discussed in section 3. The main issue here is the frustration caused\nby the leading inter-chain coupling. For Sr2 Cu(PO4 )2 , theory predicts an ordering\ntemperature TN two orders of magnitude larger than the experimentally observed value.\n\n\f17\nTable 3. Exchange integrals (columns 2 and 3) together with experimental (column\n5) and theoretically calculated (columns 7–10) ordering temperatures TN for quasione-dimensional cuprates (3D magnet Bi2 CuO4 has a similar structural motive and\nwas added for completeness). The ordering temperatures TN were calculated using\nformulas from references [19, 21, 23] and the exchange integrals from columns 2 (nearest\nneighbour intra-chain coupling J1 ) and 3 (leading inter-chain coupling J⊥ ). Note that\nthe first four systems are frustrated due to inter-chain couplings, while in the last two\nthe inter-chain couplings are not frustrated.\ncompound\nSr2 CuO3\nCa2 CuO3\nSr2 Cu(PO4 )2\nK2 CuP2 O7\nCuSe2 O5\nBi2 CuO4\n\nJ1 /K\n2200\n1850\n187\n196\n165\n10\n\nJ⊥ /K\n9\n42\n3\n0.25\n20\n6\n\nRef.\n[6]\n[6]\n[8]\n[13]\n[31]\n\nTN exp./K\n5\n9\n0.085\n<2\n17\n42\n\nRef.\n[46]\n[46]\n[47]\n[13]\n[32]\n\nTN calc./K\n[19] [21]\n[23]\n28\n115\n8.5\n0.9\n23\n\n22\n91\n6.7\n0.7\n18\n\n[31]\n\n21\n85\n6.3\n0.6\n17\n47\n\n(Unfortunately, experimental low-temperature data are not available for K2 CuP2 O7 .)\nThis huge discrepancy is in sharp contrast with the situation for the 3D magnet Bi2 CuO4 ,\nfor which the theoretical estimate coincides with the experimental value within the error\nbars (table 3, last row).+\nIn CuSe2 O5 , each chain is strongly coupled only with two of four neighbouring\nchains (unlike Sr2 CuO3 , Ca2 CuO3 , Sr2 Cu(PO4 )2 and K2 CuP2 O7 with coupling to four\nneighbouring chains). There is no unique way to take this feature into account. A simple\napproximation is to take the arithmetic average, which yields an effective inter-chain\ncoupling value J⊥ = Jab /2.∗ Using this value, theory yields a perfect agreement with\nexperimental value (table 3, fifth row).\nObviously, the existing models describe the magnetic ordering in CuSe2 O5 much\nbetter than in Sr2 CuO3 and Ca2 CuO3 , and especially in Sr2 Cu(PO4 )2 . Despite our crude\nway of accounting for spatial exchange anisotropy and the neglect of spin anisotropy,\nthe theoretical estimate of TN for CuSe2 O5 is in surprisingly good agreement with\nthe experimental value. Though in general the magnetic ordering is affected by the\nspin anisotropy, CuSe2 O5 yields empirical evidence that for systems with a small spin\nanisotropy the isotropic model provides a rather accurate estimate of TN . Thus, it\nis unlikely that the disagreement between theoretical and experimentally observed TN\nvalues for Sr2 Cu(PO4 )2 originates from the neglect of spin anisotropy effects.\nFinally, only the magnetic frustration is left to be a possible reason for a huge\ndiscrepancy between theory and experiment. Our analysis reveals that frustrated interchain couplings play a crucial role for the magnetic ordering. This fact explains why\n+\n\nFor the theoretical estimation of TN , the formula 7 from [31] was used.\n∗ Alternatively, the geometrical averaging can be used. This approach yields a correct limit with\nrespect to the Mermin-Wagner theorem (zero ordering temperature for 1D and 2D systems). Then,\ncalculational schemes from [19], [21] and [23] yield TN values of 14 K, 11 K and 10 K, respectively.\n\n\f18\ntheoretical schemes fail to predict TN for frustrated systems.\nTo illustrate the influence of frustration, we use a simple formula from the spin\nwave theory in a random phase approximation, which connects Néel temperatures\nfor\ncompounds A and B with the values of exchange integrals: TNA /TNB ≈\nq two q\nJ1A J⊥A / J1B J⊥B [6]. Using the values of exchange integrals for Sr2 Cu(PO4 )2 and\nCuSe2 O5 and the experimental Néel temperature for Sr2 Cu(PO4 )2 (table 3), we obtain\nTN ≈ 0.146 K for CuSe2 O5 , almost 120 times smaller than the experimental value.\nIn the existing theoretical approaches, a parameter controlling the frustration\ncaused by inter-chain couplings is missing. Therefore, new theories which would treat\nmagnetic frustration as one of the key issues for the magnetic ordering, are needed. On\nthe other hand, there is a lack of information from the experimental side, resulting in\na very limited number of systems that challenge the theoretical predictions. Besides\nCuSe2 O5 , an almost perfect model system, synthesis and investigation of new systems\nwith similar crystal chemistry are highly desirable.\n5. Summary and outlook\nThe class of quasi-1D magnets attracts much attention as a field of search for prominent\nmodels and a playground for modern theories. Recently, by studying the magnetic\nproperties of Cu2+ phosphates, several systems of this class were found to exhibit\nthe physics of a Heisenberg chain model. In these materials, the remarkable onedimensionality and the absence of long-range intra-chain interactions are ruled by a\nunique arrangement of magnetically active CuO4 plaquettes: they form edge-sharing\nchains where every second plaquette is cut out. The chains are well separated by\nalkaline or alkaline earth cations (K, Sr). The magnetic susceptibility of these systems is\nperfectly described by the Bethe ansatz, which provides an exact solution for the nearest\nneighbour (NN) antiferromagnetic spin-1/2 Heisenberg chain. At the same time, the\nordering temperature TN of the systems reveals a fundamental disagreement between\ntheory and experiment. Unfortunately, the range of available experimental studies of\nthese systems is rather limited, as the materials are presently available only as powders.\nTherefore, we have synthesized CuSe2 O5 - a system implying a similar, isolated\narrangement of neighbouring CuO4 plaquettes (but tilted with respect to each\nother, unlike Cu2+ phosphates) and allowing for a growth of high quality single\ncrystals. Thermodynamic measurements reveal a quasi-1D behaviour with a leading\nantiferromagnetic coupling of about 160 K (obtained from the Bethe ansatz fit for\nthe magnetic susceptibility). The system orders antiferromagnetically at 17 K, as\nevidenced by magnetic susceptibility and specific heat data. A microscopic analysis\nbased on the results of DFT calculations reveals that CuSe2 O5 can be described in good\napproximation by only two relevant exchange integrals: NN intra-chain (Jc = 165 K)\nand the leading inter-chain coupling (Jab = 20 K). The theoretical estimate of\nthe ordering temperature TN is in perfect agreement with experimental value. This\nremarkable agreement is in sharp contrast with a huge overestimate of TN for Cu2+\n\n\f19\nphosphates yielded by a formal application of the same theory. To reveal the origin of\nthis difference on empirical grounds we analyzed systematically the factors affecting TN .\nBeyond the influence of the spatial exchange anisotropy and the spin anisotropy, we\nemphasize the role of the magnetic frustration due to equivalent inter-chain interactions\nin the latter compounds. Comparing theoretical and experimental data for related\nsystems, we show that inter-chain frustrations have a crucial influence on TN and are\nlikely the main cause for the failure of any theory which ignores them.\nFor an outlook, we propose further experimental studies (for instance, Raman\nspectroscopy and inelastic neutron scattering) in order to benefit from the availability\nof single crystals of CuSe2 O5 . Especially, additional experimental data are required in\norder to understand the nature of the specific heat anomaly at 7 K. Secondly, we hope\nthat our work will inspire a directed search for new quasi-1D model systems. Last but\nnot the least, we want to stimulate the development of more sophisticated theories for\nthe estimation of TN . In particular, such theories should explicitly take into account the\nmagnetic frustration arising from complex inter-chain interactions. The well understood\nsystem CuSe2 O5 could give valuable support for these theories.\nAcknowledgements\nWe are grateful to P Scheppan for her help with the EDXS analysis and to R CardosoGil and J A Mydosh for critical reading of the manuscript and valuable suggestions. The\ninvestigation was supported by the GIF (I-811-237.14103) and by the Emmy Noether\nprogram of the DFG.\nReferences\n[1] Hase M, Terasaki I and Uchinokura K 1993 Phys. Rev. Lett. 70 3651–3654\n[2] Enderle M, Mukherjee C, Fåk B, Kremer R K, Broto J M, Rosner H, Drechsler S L, Richter J,\nMálek J, Prokofieva A et al 2005 Europhys. Lett. 70 237–243\n[3] Drechsler S L, Volkova O, Vasiliev A N, Tristan N, Richter J, Schmitt M, Rosner H, Málek J,\nKlingeler R, Zvyagin A A et al 2007 Phys. Rev. Lett. 98 077202 arXiv:cond-mat/0701741\n[4] Schmitt M, Málek J, Drechsler S L and Rosner H To be published\n[5] Bethe H 1931 Z. Phys. 71 205–226\n[6] Rosner H, Eschrig H, Hayn R, Drechsler S L and Málek J 1997 Phys. Rev. B 56 3402\narXiv:cond-mat/9704210\n[7] Ami T, Crawford M K, Harlow R L, Wang Z R, Johnston D C, Huang Q and Erwin R W 1995\nPhys. Rev. B 51 5994–6001\n[8] Johannes M D, Richter J, Drechsler S L and Rosner H 2006 Phys. Rev. B 74 174435\narXiv:cond-mat/0609430\n[9] Belik A A, Azuma M and Takano M 2004 J. Solid State Chem. 177 883–888\n[10] Salunke S S, Ahsan M A H, Nath R, Mahajan A V and Dasgupta I 2007 Phys. Rev. B 76 085104\n[11] Rosner H, Schmitt M, Kasinathan D, Ormeci A, Richter J, Drechsler S L and Johannes M D 2009\nPhys. Rev. B 79 127101\n[12] Salunke S, Ahsan M A H, Nath R, Mahajan A V and Dasgupta I 2009 Phys. Rev. B 79 127102\n[13] Nath R, Kasinathan D, Rosner H, Baenitz M and Geibel C 2008 Phys. Rev. B 77 134451\narXiv:0804.1262\n\n\f20\n[14]\n[15]\n[16]\n[17]\n[18]\n[19]\n[20]\n[21]\n[22]\n[23]\n[24]\n[25]\n[26]\n[27]\n[28]\n[29]\n[30]\n[31]\n[32]\n[33]\n[34]\n[35]\n[36]\n[37]\n[38]\n[39]\n[40]\n[41]\n[42]\n\n[43]\n[44]\n[45]\n[46]\n[47]\n\nFarnell D J J and Parkinson J B 1994 J. Phys: Condens. Matter 6 5521–5532\nOkamoto K and Nomura K 1992 Phys. Lett. A 169 433–437\nChitra R, Pati S, Krishnamurthy H R, Sen D and Ramasesha S 1995 Phys. Rev. B 52 6581–6587\nTonegawa T and Harada I 1989 J. Phys. Soc. Japan 58 2902–2915\nScalapino D J, Imry Y and Pincus P 1975 Phys. Rev. B 11 2042–2048\nSchulz H J 1996 Phys. Rev. Lett. 77 2790–2793 arXiv:cond-mat/9604144\nEssler F H L, Tsvelik A M and Delfino G 1997 Phys. Rev. B 56 11001–11013\narXiv:cond-mat/9705196\nIrkhin V Y and Katanin A A 2000 Phys. Rev. B 61 6757–6764 arXiv:cond-mat/9909257\nBocquet M 2002 Phys. Rev. B 65 184415 arXiv:cond-mat/0110429\nYasuda C, Todo S, Hukushima K, Alet F, Keller M, Troyer M and Takayama H 2005\nPhys. Rev. Lett. 94 217201 arXiv:cond-mat/0312392\nTodo S and Shibasaki A 2008 Phys. Rev. B 78 224411 arXiv:0805.3097\nZvyagin A A and Drechsler S L 2008 Phys. Rev. B 78 014429 arXiv:0806.1074\nKahn O, Verdaguer M, Girerd J J, Galy J and Maury F 1980 Solid State Commun. 34 971–975\nKoepernik K and Eschrig H 1999 Phys. Rev. B 59 1743–1757\nPerdew J P and Wang Y 1992 Phys. Rev. B 45 13244–13249\nEschrig H, Koepernik K and Chaplygin I 2003 J. Solid State Chem. 176 482–495\nAlbuquerque A F, Alet F, Corboz P, Dayal P, Feiguin A, Fuchs S, Gamper L, Gull E, Gürtler S,\nHonecker A et al 2007 J. Magn. Magn. Mater. 310 1187–1193\nJanson O, Kuzian R O, Drechsler S L and Rosner H 2007 Phys. Rev. B 76 115119\nPetrakovskii G A, Sablina K A, Pankrats A I, Vorotinov V M, Furrer A, Roessli B and Fischer P\n1995 J. Magn. Magn. Mater. 140–144 1991–1992\nMeunier G, Svenssen C and Carpy A 1976 Acta Crystallogr. B32 2664\nBecker R and Berger H 2006 Acta Crystallogr. E62 I256–I257\nJanson O, Richter J and Rosner H 2008 Phys. Rev. Lett. 101 106403 arXiv:0806.1592\nJohnston D C, Kremer R K, Troyer M, Wang X, Klümper A, Bud'ko S L, Panchula A F and\nCanfield P C 2000 Phys. Rev. B 61 9558–9606 (see table I, fit 2)\nGoodenough J B 1963 Magnetism and the Chemical Bond (New York: Interscience-Wiley)\nStølen S, Grande T and Allan N L 2004 Chemical Thermodynamics of Materials (Chichester: John\nWiley & Sons, Ltd)\nNath R, Tsirlin A A, Rosner H and Geibel C 2008 Phys. Rev. B 78 064422 arXiv:0803.3535\nKondo S, Johnston D C, Swenson C A, Borsa F, Mahajan A V, Miller L L, Gu T, Goldman A I,\nMaple M B, Gajewski D A et al 1997 Phys. Rev. Lett. 78 3729–3732\nMeunier G and Bertaud M 1974 Acta Crystallogr. B30 2840–2843\nBaran M, Gaidukov Y P, Danilova N P, Inushkin A V, Jedrzejczak A, Koksharov Y A, Nikiforov\nV N, Revcolevschi A, Szymczak R and Szymczak H 1999 J. Magn. Magn. Mater. 196–197\n532–533\nTari A 2003 The specific heat of matter at low temperatures (London: Imperial College Press)\np 148\nFeldkemper S, Weber W, Schulenburg J and Richter J 1995 Phys. Rev. B 52 313–323\nGeertsma W and Khomskii D 1996 Phys. Rev. B 54 3011–3014\nKojima K M, Fudamoto Y, Larkin M, Luke G M, Merrin J, Nachumi B, Uemura Y J, Motoyama\nN, Eisaki H, Uchida S et al 1997 Phys. Rev. Lett. 78 1787–1790\nBelik A A, Uji S, Terashima T and Takayama-Muromachi E 2005 J. Solid State Chem. 178 3461–\n3463\n\n\f"}