{"id": "http://arxiv.org/abs/1203.2835v1", "guidislink": true, "updated": "2012-03-13T15:30:16Z", "updated_parsed": [2012, 3, 13, 15, 30, 16, 1, 73, 0], "published": "2012-03-13T15:30:16Z", "published_parsed": [2012, 3, 13, 15, 30, 16, 1, 73, 0], "title": "Statistical Characterization and Mitigation of NLOS Errors in UWB\n  Localization Systems", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1203.1325%2C1203.5429%2C1203.2828%2C1203.5732%2C1203.2095%2C1203.2027%2C1203.0572%2C1203.1963%2C1203.1188%2C1203.1272%2C1203.3002%2C1203.5241%2C1203.4200%2C1203.5104%2C1203.5757%2C1203.5030%2C1203.6489%2C1203.5627%2C1203.6346%2C1203.4050%2C1203.4262%2C1203.3617%2C1203.6137%2C1203.2577%2C1203.1776%2C1203.0226%2C1203.2835%2C1203.6217%2C1203.1727%2C1203.6808%2C1203.2864%2C1203.3840%2C1203.1905%2C1203.0060%2C1203.2775%2C1203.1557%2C1203.2851%2C1203.4185%2C1203.1812%2C1203.6040%2C1203.6511%2C1203.4422%2C1203.2856%2C1203.2557%2C1203.4036%2C1203.4609%2C1203.5110%2C1203.3644%2C1203.3017%2C1203.3411%2C1203.6163%2C1203.5570%2C1203.0843%2C1203.4497%2C1203.2148%2C1203.4816%2C1203.3355%2C1203.4858%2C1203.2680%2C1203.5761%2C1203.3134%2C1203.3783%2C1203.5037%2C1203.0578%2C1203.0928%2C1203.2909%2C1203.3208%2C1203.6892%2C1203.5611%2C1203.5708%2C1203.4267%2C1203.1969%2C1203.3531%2C1203.6860%2C1203.1153%2C1203.2746%2C1203.1255%2C1203.6204%2C1203.3385%2C1203.3705%2C1203.4510%2C1203.3429%2C1203.6568%2C1203.3037%2C1203.6685%2C1203.3582%2C1203.6228%2C1203.2231%2C1203.5957%2C1203.4078%2C1203.4910%2C1203.2081%2C1203.1330%2C1203.4875%2C1203.0608%2C1203.0276%2C1203.1746%2C1203.4989%2C1203.3747%2C1203.2343%2C1203.2127&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Statistical Characterization and Mitigation of NLOS Errors in UWB\n  Localization Systems"}, "summary": "In this paper some new experimental results about the statistical\ncharacterization of the non-line-of-sight (NLOS) bias affecting time-of-arrival\n(TOA) estimation in ultrawideband (UWB) wireless localization systems are\nillustrated. Then, these results are exploited to assess the performance of\nvarious maximum-likelihood (ML) based algorithms for joint TOA localization and\nNLOS bias mitigation. Our numerical results evidence that the accuracy of all\nthe considered algorithms is appreciably influenced by the LOS/NLOS conditions\nof the propagation environment.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1203.1325%2C1203.5429%2C1203.2828%2C1203.5732%2C1203.2095%2C1203.2027%2C1203.0572%2C1203.1963%2C1203.1188%2C1203.1272%2C1203.3002%2C1203.5241%2C1203.4200%2C1203.5104%2C1203.5757%2C1203.5030%2C1203.6489%2C1203.5627%2C1203.6346%2C1203.4050%2C1203.4262%2C1203.3617%2C1203.6137%2C1203.2577%2C1203.1776%2C1203.0226%2C1203.2835%2C1203.6217%2C1203.1727%2C1203.6808%2C1203.2864%2C1203.3840%2C1203.1905%2C1203.0060%2C1203.2775%2C1203.1557%2C1203.2851%2C1203.4185%2C1203.1812%2C1203.6040%2C1203.6511%2C1203.4422%2C1203.2856%2C1203.2557%2C1203.4036%2C1203.4609%2C1203.5110%2C1203.3644%2C1203.3017%2C1203.3411%2C1203.6163%2C1203.5570%2C1203.0843%2C1203.4497%2C1203.2148%2C1203.4816%2C1203.3355%2C1203.4858%2C1203.2680%2C1203.5761%2C1203.3134%2C1203.3783%2C1203.5037%2C1203.0578%2C1203.0928%2C1203.2909%2C1203.3208%2C1203.6892%2C1203.5611%2C1203.5708%2C1203.4267%2C1203.1969%2C1203.3531%2C1203.6860%2C1203.1153%2C1203.2746%2C1203.1255%2C1203.6204%2C1203.3385%2C1203.3705%2C1203.4510%2C1203.3429%2C1203.6568%2C1203.3037%2C1203.6685%2C1203.3582%2C1203.6228%2C1203.2231%2C1203.5957%2C1203.4078%2C1203.4910%2C1203.2081%2C1203.1330%2C1203.4875%2C1203.0608%2C1203.0276%2C1203.1746%2C1203.4989%2C1203.3747%2C1203.2343%2C1203.2127&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "In this paper some new experimental results about the statistical\ncharacterization of the non-line-of-sight (NLOS) bias affecting time-of-arrival\n(TOA) estimation in ultrawideband (UWB) wireless localization systems are\nillustrated. Then, these results are exploited to assess the performance of\nvarious maximum-likelihood (ML) based algorithms for joint TOA localization and\nNLOS bias mitigation. Our numerical results evidence that the accuracy of all\nthe considered algorithms is appreciably influenced by the LOS/NLOS conditions\nof the propagation environment."}, "authors": ["Francesco Montorsi", "Fabrizio Pancaldi", "Giorgio M. Vitetta"], "author_detail": {"name": "Giorgio M. Vitetta"}, "author": "Giorgio M. Vitetta", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1109/ICUWB.2011.6058928", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1203.2835v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1203.2835v1", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "cs.IT", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cs.IT", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "math.IT", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "stat.AP", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1203.2835v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1203.2835v1", "arxiv_comment": null, "journal_reference": "Montorsi, F.; Pancaldi, F.; Vitetta, G.; \"Statistical\n  Characterization and Mitigation of NLOS Errors in UWB Localization Systems,\"\n  Ultra-Wideband (ICUWB), 2011 IEEE International Conference on, pp. 86-90,\n  14-16 Sept. 2011", "doi": "10.1109/ICUWB.2011.6058928", "fulltext": "Statistical Characterization and Mitigation of NLOS\nErrors in UWB Localization Systems\nFrancesco Montorsi\n\nGiorgio M. Vitetta\n\nFabrizio Pancaldi\n\narXiv:1203.2835v1 [cs.IT] 13 Mar 2012\n\nDepartment of Information Engineering\nDepartment of Science and\nDepartment of Information Engineering\nUniversity of Modena and Reggio Emilia\nMethods for Engineering\nUniversity of Modena and Reggio Emilia\nModena, Italy 0039-0592056323\nUniversity of Modena and Reggio Emilia\nModena, Italy 0039-0592056323\nEmail: giorgio.vitetta@unimore.it\nEmail: francesco.montorsi@unimore.it Reggio Emilia, Italy 0039-0592056323\nEmail: fabrizio.pancaldi@unimore.it\n\nAbstract-In this paper some new experimental results about\nthe statistical characterization of the non-line-of-sight (NLOS)\nbias affecting time-of-arrival (TOA) estimation in ultrawideband\n(UWB) wireless localization systems are illustrated. Then, these\nresults are exploited to assess the performance of various\nmaximum-likelihood (ML) based algorithms for joint TOA localization and NLOS bias mitigation. Our numerical results\nevidence that the accuracy of all the considered algorithms\nis appreciably influenced by the LOS/NLOS conditions of the\npropagation environment.\nIndex Terms-Ultra Wide Band (UWB), Radiolocalization,\nBias mitigation.\n\nI. I NTRODUCTION\nWireless localization in harsh communication environments\n(e.g., in a building where wireless nodes are separated by\nconcrete walls and other obstacles) can be appreciably affected\nby direct path attenuation and NLOS conditions. Various\nsolutions for NLOS error mitigation in UWB environments are\navailable in the technical literature [1], [2], [3], [4]. A simple\ndeterministic model, dubbed wall extra delay, is proposed\nin [1] to estimate the bias introduced by walls. A nonparametric support vector machine is employed in [2] for joint\nbias mitigation and channel status detection; this approach\nexploits multiple features extracted from received signals in\na non-statistical fashion. A few classification algorithms for\nLOS/NLOS detection are compared in [3], where it is shown\nthat the best solution is offered by a statistical strategy based\non the joint probability density function (pdf) of the delay\nspread and the kurtosis extracted from the received signals.\nFinally, in [4] statistical models for the time of arrival (TOA),\nthe received signal strength (RSS) and the root mean square\ndelay spread (RDS) are developed and an iterative estimator\nfor bias mitigation is devised.\nThe contribution of this paper is twofold. In fact, first\nof all, the problem of joint statistical modeling of multiple\nfeatures extracted from a database of waveforms acquired in\na TOA-based localization system is investigated. Note that,\nas far as we know, in the technical literature only univariate\nmodels for bias mitigation have been proposed until now (e.g.,\nsee [1], [4]). The use of multiple signal features in UWB\nlocalization systems has been investigated in [3] for channel\n\nstate detection only and in [5], where, however, the considered\nfeatures (namely, the kurtosis, the mean excess delay and the\ndelay spread) are modelled as independent random variables.\nThe second contribution is represented by a performance\ncomparison of various maximum-likelihood (ML) estimators\nfor TOA-based localization. In particular, unlike other papers\n(e.g., see [2], [3]) we illustrate some numerical results referring\nto the accuracy of different localization strategies, rather than\nto the bias removal on a single radio link.\nThe remaining part of this paper is organized as follows.\nIn Section II some information about our UWB experimental\ncampaign and about the features extracted from the acquired\ndata are provided. In Section III some estimation algorithms\nfor UWB radiolocalization are described, whereas their performance is compared in Section IV. Finally, some conclusions\nare given in Section V.\nII. E XPERIMENTAL SETUP\nA. Measurement arrangement\nA measurement campaign has been conducted by our research group in 2010; it is worth mentioning that various\ndatabases providing a collection of sampled UWB waveforms\nacquired in experimental campaigns and useful for assessing\nthe performance of localization algorithms are already available (e.g., see [6], [7]). However, our database has been specifically generated to assess the correlation between the NLOS\nbias error and various features extracted from the received\nsignals, as it will become clearer in the next Paragraph.\nAll the measured data were acquired by means of two FCCcompliant PulsON220 radios commercialised by TimeDomain\nand were collected in a database. Such devices are equipped\nwith omnidirectional antennas, are characterized by a -10 dB\nbandwidth and a central frequency equal to 3.2 GHz and\n4.7 GHz, respectively, and perform two-way TOA ranging;\nthey also allow to store the digitised received waveforms (a\nsampling frequency of 24.2 GHz and 14 bits per sample are\nused). Our measurement campaign consisted of two phases.\nFirst, the transmitter was placed in a given room (room A\nin Fig. 1) and the receiver in an adjacent room (room B in\nFig. 1) separated from the room A by a wall having thickness\ntwall = 32 cm (NLOS condition); in addition, the transmit\n\n\fCorrelation\nwith bi\nNLOS case\nLOS case\n\nxi,0\n\nxi,1\n\nxi,2\n\nxi,3\n\nxi,4\n\n0.795 0.852 0.894 0.641 0.454\n0.602 0.586 0.129 0.666 0.586\n\nxi,5\n\ndi\n\n0.644\n0.119\n\n0.609\n0.629\n\nTable I\nA BSOLUTE VALUE OF THE CORRELATION COEFFICIENT BETWEEN bi AND\nEACH FEATURE OF THE SET {xi,j , j = 0, 1, ...., 5}.\n\nFigure 1.\n\nMap of the environment of our experimental campaign.\n\nantenna was kept fixed, whereas the receive antenna was\nNLOS\nplaced in Nacq\n= 174 distinct vertices of a dense square grid\n(the distance between a couple of nearest vertices was equal\nto 21 cm). In the second phase of our measurement campaign\nthe transmitter and receiver were both placed in room B (LOS\ncondition); then, the transmit antenna was kept fixed, whereas\nthe receive antenna was moved on the same dense grid as\nLOS\n= 105\nin the first phase, to acquire the UWB signal in Nacq\ndistinct vertices. The distance between the two antennas varied\nbetween 1 m and about 5 m; larger distances were not taken\ninto consideration since we were interested in indoor ranging\nonly. It is important to note that the choice of the measurement\nscenarios described above is motivated by the fact that the\nUWB signals experienced similar propagation in both phases.\nFor each grid position, besides the acquired waveform, a\nTOA estimate (evaluated by the PulsON220 devices) and the\nactual transmitter-receiver distance (evaluated by means of a\nmetric tape with an accuracy better than 1 cm) were also stored\nin the database. The TOA estimates have been used to provide\na common time frame to all the acquired waveforms; this has\nmade possible the estimation of the mean excess delay and of\nother signal statistics in the signal processing phase.\nB. Statistical modeling of signal features\nThe model\nτi =\n\ndi\n+ bi + w i\nc0\n\n(1)\n\nwas adopted for the i-th link for both LOS and NLOS\nconditions. Here, τi denotes the TOA estimated by the PulsON220 devices, based on energy thresholds and a go-back\ntechnique (see [8] for further details), c0 is the speed of\nlight, di denotes the distance between the transmitter and the\nreceiver, bi is the NLOS bias (in seconds) affecting the TOA\nmeasurement (the values taken on by this random parameter\nare always positive for NLOS links and null for LOS links1 )\n2\nand wi ∼ N (0, σw,i\n) is the measurement noise; in addition,\n2\nthe expression σw,i = γσn2 dβi is adopted for the variance of\nthe measurement noise, where γ is a parameter depending\non both the specific TOA estimator employed in the ranging\n1 In\n\nthis case the probability density function (pdf) of bi is fb (b) = δ(b).\n\nmeasurements and on various parameters of the physical layer,\nand β is the path-loss exponent (a known and fixed value is\nassumed for this parameter in both LOS and NLOS conditions\n[4]).\nIn the following we focus on the problem of estimating\nthe bias bi (affecting the TOA estimate τi (1)) from a set of\nNf = 6 different \"features\" {xi,j , j = 0, 1, ..., 5} extracted\nfrom the received waveform ri (t). In particular, like in [2],\nthe following features have been evaluated for the set of the\nreceived waveforms:\n1) the maximum signal amplitude xi,0 = rmax,i ,\nmaxt |ri (t)|;\n ́∞\n2\ndt (the\n2) the mean excess delay xi,1 = τm,i , 0 t |riε(t)|\ni\nparameter εi is defined below);\n ́∞\n2\n3) the delay spread xi,2 = τds,i , 0 (t − τm,i )2 |riε(t)|\ndt;\ni\n ́∞\n4) the energy xi,3 = εi , 0 |ri (t)|2 dt;\n5) the\nrise\ntime\nxi,4\n=\ntrise,i\n,\nmin\n{t : |ri (t)|/ maxt |ri (t)| > 0.9}\n−\nmin {t : |ri (t)|/ maxt |ri (t)| > 0.1};\n\u00014\n ́\n6) the kurtosis xi,5 = κi , σ41 T T |ri (t)| − μ|r| dt,\n|r|\n ́\n ́\n2\nwhere μ|r| , T1 T |ri (t)|dt, σ|r|\n, T1 T (|ri (t)| −\nμ|r| )2 dt and T denotes the observation time.\nIn the following the set {ri (t)} of received waveforms is\nmodelled as a random process, so that the above mentioned\nfeatures form a set of correlated random variables; in addition,\nall of them are statistically correlated with the TOA bias.\nThe last consideration is confirmed by the numerical results\nof Table I, which lists the absolute values of the correlation\ncoefficients of the previously described features with the\nestimated TOA bias for both the LOS and the NLOS scenarios.\nFrom these results it can be easily inferred that not all the\nconsidered features are equally useful to estimate the TOA\nbias. For this reason and to simplify our statistical analysis,\nwe restricted the set of features to {xi,0 , xi,1 , xi,2 } (Nf = 3),\nwhich collects the parameters exhibiting a strong correlation\nwith the bias in the NLOS scenario.\nNote that, in principle, the bias bi is not influenced by the\ndistance di , since it depends only on the thickness of the walls\n(or of other obstacles) encountered by the transmitted signal\nduring its propagation; this is not true, however, for the above\nmentioned triple of signal features (see [1] for further details).\nGenerally speaking, it is useful to derive a TOA bias estimator\nwhich is not influenced by the transmitter-receiver distance\ndi . Therefore, in the attempt of removing the dependence\nof the features {xi,0 , xi,1 , xi,2 } on the link distance, we\n0\nm\ndeveloped the models xi,0 = rmax,i = rmax\n− rmax\ndi ,\n\n\fFigure 2. Estimated joint pdf of the estimated TOA bias and the delay spread\nin NLOS conditions (above) and LOS conditions (below).\n\nm\n0\nm\nxi,1 = τm,i = τm\ndi and xi,2 = τds,i = τds\n+ τds\ndi on the\nbasis of our experimental results and, in particular, on the\nbasis of the estimates of the joint pdf's {fb,x0 , fb,x1 , fb,x2 }\nreferring to the three possible couples (bi , xi,j ) with j = 0, 1,\nNLOS\nLOS\n2 and i = 0, 1, ..., Nacq − 1, where Nacq = Nacq\n+ Nacq\n; here\nm\n0\nm\nm\n0\nrmax , τm and τds are random variables, whereas τds and rmax\nare deterministic parameters having known values (all are\nassumed independent of di and thus also from the link index\ni). Given these\u0002 models, the vector\nof distance-independent\n\u0003\nm m T\n0\n, τds\ncan be evaluated from its\n, τm\nfeatures x̃ , rmax\nT\ndistance-dependent counterpart2 x = [rmax , τm , τds ] and can\nbe used in place of it. However it turns out that parameters of\nx̃ are less correlated with bi than those of x; for this reason,\nwe decided to take into consideration both for localization\npurposes (see Sec. III-B2).\nA complete statistical characterization of the estimated bias\nand of the 3 related signal features we consider is provided\nby the joint pdf fb,rmax ,τm ,τds (*) or, equivalently, by the joint\n0\nm ,τ m (*) (both can be estimated from the acquired\npdf fb,rmax\n,τm\nds\ndata). Some marginalizations, like the one shown in Fig. 2,\nreveal interesting aspects: 1) a significant (limited) correlation\nbetween these parameters is found in the NLOS (LOS) case;\n2) the null region exhibited by the estimated pdf's is due\nto the fact that the TOA bias cannot take on values in the\ninterval [0, twall /c0 ], where twall is the thickness of the wall\nobstructing the direct path; 3) large values of the TOA bias are\nunlikely since they are associated with small incidence angles\nof the transmitted signal on the obstructing wall.\n\nIII. L OCALIZATION ALGORITHMS\nA. Introduction\nIn this Section we develop various algorithms for twodimensional localization in a UWB network composed by\nT\nNa anchors with known positions zai , [xai , yia ] ∈ R2 ,\ni = 0, ..., Na − 1 and by a single node (dubbed mobile\nstation, MS, in the following) with unknown position θ ,\n[x, y]T ∈ R2 . Any couple of the given (Na + 1) devices\ncan operate in a LOS (NLOS) condition with probability PLOS\n2 In the rest of the document, the subscript i has been omitted for simplicity\nwhen not strictly necessary.\n\n(1 − PLOS ). The localization algorithms described below try\nto mitigate the effects of the NLOS bias error and aim at\ngenerating an estimate\nθ̂ of oθ minimizing the mean square\nn\n2\nerror (MSE) Eθ̂ ||θ̂ − θ|| . It is also important to point\nout that localization algorithms developed for NLOS scenarios\nusually consist of two steps. In fact, first the NLOS bias is\nestimated for each involved link and is used to remove the\nbias contribution in the acquired data; then the new data set\nis processed by a least-square (LS) procedure generating an\nestimate of θ (e.g., see [2], [3], [4], [5]). In the following\ninstead, implicit estimation of the bias for each link is adopted;\nthis approach is motivated by the fact that the estimation of the\nbias for the i-th link can benefit from the information acquired\nfrom the other (Na − 1) links; note that in [2] and [5] bias\nmitigation performed in a link-by-link fashion is exploited to\nassign a weight in a weighted least-square (WLS) step but\nsuch an approach is heuristic and differs from our ML-based\napproach.\nB. Maximum Likelihood Estimation\nIf the links between the MS and the Na different anchors are\nassumed mutually independent, the ML estimation strategy of\nthe unknown MS position θ, given a TOA estimate and a set of\nadditional signalQ\nfeatures for each link, can be formulated as\nNa −1\nθ̂ = arg max ln i=0\nfτ,x (τi , xi ; θ̃), where θ̃ = [x̃, ỹ]T ∈\nθ̃\n\nR2 denotes the MS trial position, τi and xi are the TOA and\nNf -dimensional signal vector collecting the received signal\nfeatures acquired for the i-th link and fτ,x (*, *; θ̃) is the joint\npdf of the TOA and the vector of features parameterized by\nthe trial position θ̃. In the following Paragraphs the impact of\nvarious possible options for the ML strategy are investigated.\n1) ML estimation strategy for different sets of observed\ndata: in this Paragraph two different options are considered\nfor the set of features processed by the ML strategy.\na) Option A: in this case it is assumed that the vector of\nfeatures referring to the i-th link is xi = [rmax,i , τm,i , τds,i ]T ;\nthis choice is motivated by the large correlation between\nthese random variables and the link bias b (see Paragraph\nII-B). Then, the joint PDF fτ,x (τi , xi ; θ̃) appearing in the ML\nstrategy can be expressed as (see Eq. (1)):\n!\ndi (θ̃)\n, x̃i ,\n(2)\nfτ,x (τi , xi ; θ̃) = (fb,x̃ ⊗ fw ) τi −\nc0\nwhere\n\"\nx̃i = rmax,i +\n\nm\nrmax\ndi (θ̃),\n\n0\nτm,i τds,i − τds\n,\ndi (θ̃)\ndi (θ̃)\n\n#T\n(3)\n\n0\nm\n(because of the models previously described for rmax\n, τm\nm\nand τds ), di (θ̃) is the distance between the i-th anchor and\nthe MS trial position and fb,x̃ ⊗ fw denotes the convolution\nbetween the joint pdf fb,x̃ (*) and the observation noise pdf\n2 −1/2\n2\nfw (w) = (2πσw\n)\nexp(−w2 /(2σw\n)).\nNote that the shape of the function fb,x̃ (*) under the hypothesis of LOS conditions (HLOS event) is substantially different\n\n\ffrom that found in NLOS conditions (HNLOS event) [4]; for this\nreason, we estimated this function in both cases applying the\nprocedure described in [1] to the data collected in our measurement campaign; this led to two distinct multidimensional\nhistograms, which approximate the pdf's fb,x̃ (b, x̃i |HLOS ) and\nfb,x̃ (b, x̃i |HNLOS ) with a certain accuracy depending on: a) the\nquantity of acquired data; b) the sizes ∆b, ∆rmax , ∆τm and\n∆τds of the quantization bins adopted in the generation of\nthe histograms. Note that these sizes need to be accurately\nselected, since large bins imply a coarse approximation of\npdf's, whereas excessively small bins require a huge amount\nof data.\nGiven an estimate of the above mentioned couple of pdf's,\nthe required pdf fb,x̃ (*) can be trivially evaluated using\nthe law of total probability and the PLOS , Pr{HLOS } and\nPNLOS , Pr{HNLOS } = 1 − Pr{HLOS } probabilities when they\nare available, or assuming PLOS = PNLOS = 0.5 if no a priori\ninformation about the LOS/NLOS conditions are available.\nb) Option B: in this case the set of features employed in\nML estimation consists of a single element, namely the delay\nspread (which exhibits the largest correlation with the NLOS\nbias; see Table I), so that xi = τds,i and the pdf fτ,x (τi , xi ; θ̃)\nof the ML strategy becomes (see (2))\n!\n0\ndi (θ̃) τds,i − τds\nm ⊗ fw )\n,\nfτ,x (τi , xi ; θ̃) = (fb,τds\nτi −\nc0\ndi (θ̃)\n(4)\nm (*) has to be estimated\nLike in the previous case, the pdf fb,τds\nin the LOS and NLOS scenarios (see Fig. 2) from the data\nacquired in our measurement campaign. Note that this option\nleads to a ML localization algorithm which is substantially\nsimpler than that proposed in the analysis of option A.\n2) Parameterization of the observations: the ML strategies\n0\nm ,τ m (*)\ndeveloped above are based on the joint pdf's fb,rmax\n,τm\nds\nm (*) which refer to a set of distance-independent\nand fb,τds\nm\nm\n0\nand τds\nexhibit\n, τm\nparameters. Since the parameters rmax\na lower correlation with b than their distance-dependent counterparts rmax , τm , τds , we believe that the use of the joint\nPDF\n!\ndi (θ̃)\nfτ,x (τi , xi ; θ̃) = (fb,x ⊗ fw ) τi −\n, xi\n(5)\nc0\nin place of (2) deserves to be investigated (similar comments\nhold for (4)).\n3) Estimation of joint pdf's: as already explained above, the\njoint pdf's involved in the proposed ML localization strategies\ncan be easily estimated from the acquired data using a simple\nprocedure based on dividing the space of observed data in\na set of bins of proper size. Such a procedure generates an\nhistogram, which, unluckily, entails poor localization performance if employed as it is, because of the relatively small\nnumber of bins (adopted to avoid empty bins). To mitigate\nthis problem either interpolation followed by low-pass filtering\ncan be applied to raw experimental histograms (this leads\nto interpolated-histogram estimators) or the raw data can be\n\nFigure 3.\n\nFlow diagram of the proposed iterative estimator.\n\nfitted with analytical functions (this results in fitted-histogram\nestimators).\nC. Iterative Estimation\nRecently, an iterative estimator of both the channel state\n(i.e., LOS or NLOS conditions) and the NLOS bias b has\nbeen proposed in [4]. In Fig. 3 the flow diagram of a modified\nversion of this iterative algorithm, employing the joint pdf's\ndescribed above and extracted from our experimental database,\nis proposed. Note that this algorithm operates in a link-by-link\nfashion (in the diagram of Fig. 3 the link index i has been\nomitted to ease the reading).\nIV. N UMERICAL RESULTS\nOur experimental database has also been exploited to assess the RMSE performance of the proposed algorithms for\nlocalization and NLOS bias mitigation schemes via computer\nsimulations. In our simulations the MS coordinates are always\n(0; 0); then, following [2], for the i-th anchor a received\nwaveform from either the LOS database (with probability\nPLOS ) or from the NLOS database (with probability PNLOS )\nwas drawn\nrandomly and was associated\nwith the position\n\u0010\n\u0011\ni−1\ni−1\na\nzi = di sin(2π Na ); di cos(2π Na ) , where di is the distance measured for the selected waveform. Note that these\nwaveforms already include the experimental noise and thus\nno simulated noise was imposed on the waveforms (so that\nthe signal-to-noise ratio is the experimental one). Finally,\nthe parameter Na has been set to 3 (worst case which still\ntheoretically allows unambiguous localization).\nThe RMSE performance of the following algorithms has\nbeen evaluated:\n1) LS - A standard LS estimator for LOS environments;\nthe estimation\nexpressed as θ̂ =\nPNa −1strategy can be\narg minθ̃ i=0\n(c0 τi − di (θ̃))2 .\n2) VE - A LS estimator exploiting TOA measurements\ncorrected by the algorithm proposed by Venkatesh and\nBuehrer in [4]; this algorithm relies on a statistical\n\n\fV. C ONCLUSIONS\nIn this paper various UWB localization techniques processing multiple features extracted from the received signal to mitigate the problem of NLOS bias have been described and their\naccuracy has been assessed exploiting the experimental data\n\n0.5\nLS\nVE\nML−4D\nML−2D\nML−2D−ID\nML−4D−F\nML−4D−IT\nML−2D−IT\n\n0.45\n0.4\n0.35\nRMSE [m]\n\nmodeling of the propagation environment based on our\nexperimental database.\n3) ML-4D - A ML estimator based on (2) and employing\nan interpolated histogram, in the likelihood function,\nreferring to a distance-dependent parameterization.\n4) ML-2D - A ML estimator based on (4) and employing\nan interpolated histogram, in the likelihood function,\nreferring to a distance-dependent parameterization.\n5) ML-2D-ID - A ML estimator based on (4) and employing an interpolated, histogram in the likelihood function,\nreferring to a distance-independent parameterization.\n6) ML-4D-F - A ML estimator based on (2) and employing\na fitted histogram, in the likelihood function, referring\nto a distance-dependent parameterization.\n7) ML-4D-IT - A LS estimator based on (2) and exploiting\nTOA measurements corrected by the modified iterative\nalgorithm illustrated in Section III-C.\n8) ML-2D-IT - A LS estimator based on (4) and exploiting\nTOA measurements corrected by the modified iterative\nalgorithm illustrated in Section III-C.\nIn estimating the RMSE performance of the ML algorithms\nlisted above the likelihood functions were always evaluated at\nthe vertices of a square grid characterized by a step size equal\nto 10 mm. Some numerical results are compared in Fig. 4,\nwhich illustrates the RMSE performance versus the probability\nPLOS . These results evidence that:\n1) The simple LS algorithm is outperformed by all the other\nalgorithms when PLOS ≤ 0.9; this is due to the fact that\nthis strategy does not try to mitigate NLOS bias.\n2) The VE algorithm performs well at the cost of a reasonable complexity, but offers limited bias mitigation\nwhen PLOS = 0; in this case the ML-2D, ML-2D-ID and\nML-4D-F estimators perform much better.\n3) The exploitation of a large set of received signal features\ndoes not necessarily allow to achieve better accuracy\nthan a subset of them (see the curves referring to ML2D and ML-4D estimators); this is due to the fact that\nthe correlation between the different couples of extracted\nfeatures is typically large, so that they provide strongly\ncorrelated information about the NLOS bias.\n4) Distance-dependent parameterization provides better accuracy (see the curves referring to the ML-2D and MLm\n2D-ID estimators); this can be related to the fact that τds\nis less correlated with the NLOS bias than its distancedependent counterpart τds .\n5) The ML-4D-F estimator performs better than the ML-4D\nestimator in NLOS conditions; this means that the use of\nfitted histograms entails an improvement of localization\naccuracy.\n\n0.3\n0.25\n0.2\n0.15\n0.1\n0.05\n0\n\n0.2\n\n0.4\n\nPLOS\n\n0.6\n\n0.8\n\n1\n\nFigure 4. RMSE performance versus PLOS offered by various localization\nalgorithms.\n\nacquired in an measurement campaign. Our results evidence\nthat: a) a restricted set of features has to be employed; b) the\nuse of distance-dependent features and of fitted histograms\nprovides better performance than that offered by distanceindependent features and interpolated histograms.\nACKNOWLEDGEMENTS\nThe authors would like to thank Prof. Marco Chiani and\nProf. Davide Dardari (both from the University of Bologna,\nItaly) for lending us the UWB devices employed in our\nmeasurement campaign and the PhD students Alessandro\nBarbieri and Fabio Gianaroli for their invaluable help in our\nexperimental work. Finally, the authors wish to acknowledge\nthe activity of the Network of Excellence in Wireless COMmunications (NEWCOM++, contract n. 216715), supported by\nthe European Commission which motivated this work.\nR EFERENCES\n[1] D. Dardari, A. Conti, J. Lien, and M. Z. Win, \"The effect of cooperation\non localization systems using UWB experimental data,\" EURASIP J. Adv.\nSignal Process, vol. 2008, Jan. 2008.\n[2] S. Maranó, W. Gifford, H. Wymeersch, and M. Z. Win, \"NLOS identification and mitigation for localization based on UWB experimental data,\"\nIEEE J. Sel. Areas Commun., vol. 28, pp. 1026 –1035, Sept. 2010.\n[3] N. Decarli, D. Dardari, S. Gezici, and A. A. D'Amico, \"LOS/NLOS\ndetection for UWB signals: A comparative study using experimental\ndata,\" in Proc. of the 5th IEEE International Symposium on Wireless\nPervasive Computing (ISWPC 2010), pp. 169 –173, May 2010.\n[4] S. Venkatesh and R. Buehrer, \"Non-line-of-sight identification in ultrawideband systems based on received signal statistics,\" IET Microwaves,\nAntennas Propagation, vol. 1, pp. 1120 –1130, Dec. 2007.\n[5] I. Güvenç, C.-C. Chong, F. Watanabe, and H. Inamura, \"NLOS identification and weighted least-squares localization for UWB systems using\nmultipath channel statistics,\" EURASIP J. Adv. Signal Process, vol. 2008,\nJan. 2008.\n[6] \"WPR.B database.\" Available online at http://www.vicewicom.eu.\n[7] J.-Y. Lee, \"USC ranging test database.\" Available online at http://ultra.\nusc.edu/uwb_database/ranging_test.htm.\n[8] D. Dardari, C.-C. Chong, and M. Z. Win, \"Threshold-based time-ofarrival estimators in UWB dense multipath channels,\" IEEE Trans.\nCommun., vol. 56, pp. 1366 –1378, Aug. 2008.\n\n\f"}