{"id": "http://arxiv.org/abs/1009.2663v1", "guidislink": true, "updated": "2010-09-14T13:41:09Z", "updated_parsed": [2010, 9, 14, 13, 41, 9, 1, 257, 0], "published": "2010-09-14T13:41:09Z", "published_parsed": [2010, 9, 14, 13, 41, 9, 1, 257, 0], "title": "Thermal blinding of gated detectors in quantum cryptography", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1009.1407%2C1009.4231%2C1009.2683%2C1009.5237%2C1009.0154%2C1009.4370%2C1009.5682%2C1009.5419%2C1009.0937%2C1009.2597%2C1009.5657%2C1009.4284%2C1009.5205%2C1009.2379%2C1009.1387%2C1009.4073%2C1009.5758%2C1009.5230%2C1009.0915%2C1009.4986%2C1009.2034%2C1009.2780%2C1009.4466%2C1009.4114%2C1009.0483%2C1009.1925%2C1009.3015%2C1009.2663%2C1009.0962%2C1009.1617%2C1009.1598%2C1009.4120%2C1009.6016%2C1009.1071%2C1009.3046%2C1009.0973%2C1009.5320%2C1009.0199%2C1009.2524%2C1009.2207%2C1009.1057%2C1009.4736%2C1009.0395%2C1009.1070%2C1009.5944%2C1009.3016%2C1009.3575%2C1009.4160%2C1009.1973%2C1009.0091%2C1009.4940%2C1009.3398%2C1009.5390%2C1009.4169%2C1009.4584%2C1009.5248%2C1009.0369%2C1009.0606%2C1009.0654%2C1009.5328%2C1009.0579%2C1009.3630%2C1009.4866%2C1009.2766%2C1009.4532%2C1009.0472%2C1009.3634%2C1009.4307%2C1009.4019%2C1009.3053%2C1009.0553%2C1009.6187%2C1009.1384%2C1009.4178%2C1009.5259%2C1009.5658%2C1009.1524%2C1009.1701%2C1009.5287%2C1009.3655%2C1009.1401%2C1009.1025%2C1009.4554%2C1009.2097%2C1009.2393%2C1009.5971%2C1009.5857%2C1009.1374%2C1009.2025%2C1009.4616%2C1009.5631%2C1009.2639%2C1009.1572%2C1009.3122%2C1009.4874%2C1009.2884%2C1009.4277%2C1009.2611%2C1009.0310%2C1009.5803%2C1009.4090&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Thermal blinding of gated detectors in quantum cryptography"}, "summary": "It has previously been shown that the gated detectors of two commercially\navailable quantum key distribution (QKD) systems are blindable and controllable\nby an eavesdropper using continuous-wave illumination and short bright trigger\npulses, manipulating voltages in the circuit [L. Lydersen et al., Nat.\nPhotonics DOI:10.1038/nphoton.2010.214]. This allows for an attack\neavesdropping the full raw and secret key without increasing the quantum bit\nerror rate (QBER). Here we show how thermal effects in detectors under bright\nillumination can lead to the same outcome. We demonstrate that the detectors in\na commercial QKD system Clavis2 can be blinded by heating the avalanche photo\ndiodes (APDs) using bright illumination, so-called thermal blinding. Further,\nthe detectors can be triggered using short bright pulses once they are blind.\nFor systems with pauses between packet transmission such as the plug-and-play\nsystems, thermal inertia enables Eve to apply the bright blinding illumination\nbefore eavesdropping, making her more difficult to catch.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1009.1407%2C1009.4231%2C1009.2683%2C1009.5237%2C1009.0154%2C1009.4370%2C1009.5682%2C1009.5419%2C1009.0937%2C1009.2597%2C1009.5657%2C1009.4284%2C1009.5205%2C1009.2379%2C1009.1387%2C1009.4073%2C1009.5758%2C1009.5230%2C1009.0915%2C1009.4986%2C1009.2034%2C1009.2780%2C1009.4466%2C1009.4114%2C1009.0483%2C1009.1925%2C1009.3015%2C1009.2663%2C1009.0962%2C1009.1617%2C1009.1598%2C1009.4120%2C1009.6016%2C1009.1071%2C1009.3046%2C1009.0973%2C1009.5320%2C1009.0199%2C1009.2524%2C1009.2207%2C1009.1057%2C1009.4736%2C1009.0395%2C1009.1070%2C1009.5944%2C1009.3016%2C1009.3575%2C1009.4160%2C1009.1973%2C1009.0091%2C1009.4940%2C1009.3398%2C1009.5390%2C1009.4169%2C1009.4584%2C1009.5248%2C1009.0369%2C1009.0606%2C1009.0654%2C1009.5328%2C1009.0579%2C1009.3630%2C1009.4866%2C1009.2766%2C1009.4532%2C1009.0472%2C1009.3634%2C1009.4307%2C1009.4019%2C1009.3053%2C1009.0553%2C1009.6187%2C1009.1384%2C1009.4178%2C1009.5259%2C1009.5658%2C1009.1524%2C1009.1701%2C1009.5287%2C1009.3655%2C1009.1401%2C1009.1025%2C1009.4554%2C1009.2097%2C1009.2393%2C1009.5971%2C1009.5857%2C1009.1374%2C1009.2025%2C1009.4616%2C1009.5631%2C1009.2639%2C1009.1572%2C1009.3122%2C1009.4874%2C1009.2884%2C1009.4277%2C1009.2611%2C1009.0310%2C1009.5803%2C1009.4090&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "It has previously been shown that the gated detectors of two commercially\navailable quantum key distribution (QKD) systems are blindable and controllable\nby an eavesdropper using continuous-wave illumination and short bright trigger\npulses, manipulating voltages in the circuit [L. Lydersen et al., Nat.\nPhotonics DOI:10.1038/nphoton.2010.214]. This allows for an attack\neavesdropping the full raw and secret key without increasing the quantum bit\nerror rate (QBER). Here we show how thermal effects in detectors under bright\nillumination can lead to the same outcome. We demonstrate that the detectors in\na commercial QKD system Clavis2 can be blinded by heating the avalanche photo\ndiodes (APDs) using bright illumination, so-called thermal blinding. Further,\nthe detectors can be triggered using short bright pulses once they are blind.\nFor systems with pauses between packet transmission such as the plug-and-play\nsystems, thermal inertia enables Eve to apply the bright blinding illumination\nbefore eavesdropping, making her more difficult to catch."}, "authors": ["Lars Lydersen", "Carlos Wiechers", "Christoffer Wittmann", "Dominique Elser", "Johannes Skaar", "Vadim Makarov"], "author_detail": {"name": "Vadim Makarov"}, "author": "Vadim Makarov", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1364/OE.18.027938", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1009.2663v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1009.2663v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "10 pages, 12 figures", "arxiv_primary_category": {"term": "quant-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "quant-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1009.2663v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1009.2663v1", "journal_reference": "Optics Express 18, 27938-27954 (2010)", "doi": "10.1364/OE.18.027938", "fulltext": "Thermal blinding of gated detectors in quantum cryptography\n\narXiv:1009.2663v1 [quant-ph] 14 Sep 2010\n\nLars Lydersen,1, 2, ∗ Carlos Wiechers,3, 4, 5 Christoffer Wittmann,3, 4\nDominique Elser,3, 4 Johannes Skaar,1, 2 and Vadim Makarov1\n1\nDepartment of Electronics and Telecommunications,\nNorwegian University of Science and Technology, NO-7491 Trondheim, Norway\n2\nUniversity Graduate Center, NO-2027 Kjeller, Norway\n3\nMax Planck Institute for the Science of Light, Günther-Scharowsky-Str. 1/Bau 24, 91058 Erlangen, Germany\n4\nInstitut für Optik, Information und Photonik, University of\nErlangen-Nuremberg, Staudtstrasse 7/B2, 91058 Erlangen, Germany\n5\nDepartamento de Fı́sica, Universidad de Guanajuato, Lomas del Bosque 103,\nFraccionamiento Lomas del Campestre, 37150, León, Guanajuato, México\n(Dated: May 27, 2018)\n\nIt has previously been shown that the gated detectors of two commercially available quantum key\ndistribution (QKD) systems are blindable and controllable by an eavesdropper using continuouswave illumination and short bright trigger pulses, manipulating voltages in the circuit [L. Lydersen\net al., Nat. Photonics DOI:10.1038/nphoton.2010.214]. This allows for an attack eavesdropping the\nfull raw and secret key without increasing the quantum bit error rate (QBER). Here we show how\nthermal effects in detectors under bright illumination can lead to the same outcome. We demonstrate\nthat the detectors in a commercial QKD system Clavis2 can be blinded by heating the avalanche\nphoto diodes (APDs) using bright illumination, so-called thermal blinding. Further, the detectors\ncan be triggered using short bright pulses once they are blind. For systems with pauses between\npacket transmission such as the plug-and-play systems, thermal inertia enables Eve to apply the\nbright blinding illumination before eavesdropping, making her more difficult to catch.\nPACS numbers: 03.67.Dd\n\nI.\n\nINTRODUCTION\n\nIn theory quantum mechanics allows two parties, Alice and Bob, to grow a private, secret key, even if the\neavesdropper Eve can do anything permitted by the laws\nof nature [1–4]. The field of quantum key distribution\n(QKD) has evolved rapidly in the last two decades, with\ntransmission distance increasing from a table top demonstration to over 250 km in the laboratory [5], and commercial QKD systems available from several vendors[6].\nHowever the components used for the experimental realizations of QKD have imperfections. Numerous imperfections have been addressed in security proofs [7–12].\nFor some loopholes it took several years from their discovery until they were covered by security proofs, for instance the Trojan-horse [13, 14] loophole and detector\nefficiency mismatch [15, 16]. The latter was exploited in\nthe time-shift attack [17] on a commercial QKD system\n[18]. Other loopholes include a variety of side-channels\n[19–22].\nCommon to the loopholes mentioned so far is that\nthey are not implementable in practice, or only leave\na marginal advantage for Eve. For instance, the implementation of the time-shift attack [18] gave Eve an\ninformation-theoretic advantage, allowing her to outperform a straight brute-force search for the key in 4% of\nher attempts. In the practical phase-remapping attack\n[22], Eve caused 19.7% QBER compromising merely the\n\n∗\n\nlars.lydersen@iet.ntnu.no\n\nhardly ever used two-way post-processing protocol which\nproduces secure key at QBER up to 20% [23, 24].\nThere is however one class of attacks which stands\nout in terms of implementability, Eve's information and\nQBER: The blinding attacks [25–27] are fully implementable with current technology, and give Eve the whole\nraw key while causing zero additional QBER. In these\nattacks, the APDs are tricked to exit the single-photon\nsensitive Geiger mode, and are so-called blind. Eve uses\na copy of Bob's apparatus to detect Alice's signals, but\nresends bright trigger pulses instead of single photons,\nas in the after-gate attack [28]. When the detectors are\nblind, Bob will only detect the bright trigger pulses if\nhe uses the same basis as Eve. Otherwise his detectors\nremain silent. Hence Eve gets a full copy of the raw\nkey while causing no additional QBER. Both passively\nquenched detectors [25], actively quenched detectors [26]\nand the gated detectors of two commercially available\nQKD systems [27] have been shown to be vulnerable to\nblinding. In the case of the passively-quenched detectors,\nthis loophole has been exploited in the first full-scale implementation of an eavesdropper [29], which was inserted\nin the middle of the 290 m transmission line in an experimental entanglement-based QKD system [30, 31], and\nrecovered 100% of the raw key.\nPreviously the gated detectors in the commercially\navailable system Clavis2 from manufacturer ID Quantique were subject to continuous-wave (CW) blinding\n[27]. The blinding illumination caused the bias voltage at\nthe APDs to drop due to the presence of DC impedance\nof the bias voltage supply, and therefore the APDs were\nnever in Geiger mode. In this paper we show how the\n\n\f2\nsame detectors, regardless of the impedance of the bias\nvoltage supply, can be blinded by heating the APD, socalled thermal blinding. We show that thermal blinding\nis more sophisticated form of attack than previously reported CW-blinding [27] because the APD can be heated\nwell in advance of the detection times, and is as such\nharder to catch. Especially for Clavis2, all the detector\nparameters such as temperature of the cold plate, bias\nvoltage and APD current indicate single photon sensitivity while the detectors are in fact blind.\nIn this paper we first briefly review how APDs in the\nlinear mode can be exploited to eavesdrop on QKD systems (section II). Then the detector design in Clavis2 is\ndiscussed (section III) before we show how it is possible\nto thermally blind and trigger the detectors (section IV).\nFinally we briefly discuss countermeasures in section V\nand conclude in section VI.\n\nII.\n\nEAVESDROPPING EXPLOITING APDs IN\nLINEAR MODE\n\nIn this section we briefly review how APDs in the linear\nmode can be exploited to eavesdrop on QKD systems\n[26, 27].\nIn Geiger mode operation, an electron-hole pair produced by an absorbed single photon is amplified to a large\ncurrent in the APD, which exceeds a current comparator threshold and reveals the photon's presence. This is\nreferred to as a click [32].\nIn the linear mode however, when an APD is reversebiased at a constant voltage below the breakdown voltage [33], the current through the APD is proportional to\nthe incident optical power. Usually the APD is placed\nin a resistive network, and also has an internal resistance. Hence, the current through the APD lowers the\nbias voltage, and the current through the APD is monotonically increasing with the incident optical power. In\nthis regime, the comparator current threshold translates\nto a classical optical power threshold [27].\nIf APDs are used as detectors in a QKD system, and\nthey are optically accessible to Eve when biased under\nthe breakdown voltage, Eve may eavesdrop on the QKD\nsystem with an intercept-resend (faked-state [34]) attack.\nEve uses a copy of Bob to detect the qubits from Alice\nin a random basis. Eve resends her detection results, but\ninstead of sending single photons she sends bright pulses,\njust above the classical optical power threshold. Bob will\nonly have a detection event if his basis choice coincides\nwith Eve's basis choice (see Fig. 1), otherwise no detector\nclicks.\nAfter the raw key exchange, Bob and Eve are identical both in bit values and basis choices. Since Eve uses\na copy of Bob's detectors, Bob's photon-number detection statistics is equal with or without Eve. Therefore\nthe attack works equally well on the BB84 protocol [1],\nthe Scarani-Acin-Ribordy-Gisin 2004 (SARG04) [35] and\ndecoy-state BB84 protocols [36–38]. In addition to at-\n\na)\n\nb)\n\nClick!\nBS\n\nBS\n\n\"0\"\n\"1\"\n\n\"0\"\n\"1\"\n\nI0\nIth\n\nI0\nIth\nt\n\nI1\nIth\n\nI1\nIth\n\nt\n\nt\n\nt\n\nFIG. 1. The last beam splitter (BS) as well as the detectors in\na phase-encoded QKD system. I0 and I1 is the current running through APD 0/1, and Ith is the comparator threshold\ncurrent above which the detector registers a click. Here we\nassume that the APDs are in the linear mode, and that Eve\nsends a bright pulse slightly above the optical power thresholds. a) Eve and Bob have selected matching bases. Therefore\nthe full intensity in the pulse from Eve hits detector 0. The\ncurrent caused by Eve's pulse crosses the threshold current\nand causes a click. b) Eve and Bob have selected opposite\nbases. Therefore half the intensity of Eve's pulse hits each\ndetector (corresponding to 50% detection probability in either detector for single photons). This causes no click as the\ncurrent is below the threshold for each detector.\n\ntacking the quantum channel, Eve listens on the classical\nchannel between Alice and Bob. Afterwards Eve performs the same classical post-processing as Bob to obtain\nthe identical secret key.\nNote that the classical optical power threshold has to\nbe sufficiently well defined for successful perfect eavesdropping. To be precise, let an optical power of P100%,i\nor greater always cause a click when applied to detector\ni. Likewise, let an optical power of P0%,i or less never\ncause a click when applied to detector i. The sufficient\ncondition for Eve to be able to make any single detector click while none of the other detectors click, can be\nexpressed as\n\u0011\n\u0010\n\b\n\b\n(1)\nmax P100%,i < 2 min P0%,i .\ni\n\nIII.\n\ni\n\nDETECTOR DESIGN\nA.\n\nDetector circuit\n\nFigure 2 shows an equivalent detector bias and comparator circuit diagram for the detectors in Clavis2,\nbased on reverse engineering. The APD is biased just\nabove its breakdown voltage by the high voltage supply VHV,0 = −42.89 V, VHV,1 = −43.08 V. On top of\nthis bias the APD is gated with 2.8 ns TTL pulses every\n200 ns from DD1 to create Geiger mode gates. The gates\n\n\f3\n\n1\n\nAPD\n\nT4\nDA1\nMAX9601\n\nC1\n1.1n\n\n==\nR2\n150\n\nC2\n100n\n\nR4\n150\n\nOutput\nclick\n(PECL)\n\nVgate 1, V\n\nInput\ngate\n(PECL)\n\nT3\nR1\n72\n\n3\n2\n1\n0\n\nVcomp 1, V\n\nT1\nDD1\nSY100H842\n\n0.16\n\nR3\n1k\n\nVth,0/1\n\nVHV,0/1\n\nFIG. 2. Equivalent detector bias and comparator circuit.\nTaps T1-T3 are analog taps of the APD gates (Vgate,0/1 ), the\nAPD bias (Vbias,0/1 ) and the comparator input (Vcomp,0/1 ).\nThe digital tap T4 of the detector output (Vclick,0/1 ) has\nbeen converted to logic levels in all oscillograms. For the\nexperiments presented in section IV, the resistor R3 has been\nshorted.\n\nare applied as PECL signals from the mainboard, and\nthe buffer converts them to TTL levels, 0 V and approximately 3 V. The anode of the APD is AC-coupled to a\nfast comparator DA1 with the thresholds Vth,0 = 78 mV\nand Vth,1 = 82 mV.\nThe normal operation of the detector circuit can be\nseen in Fig. 3. A number of techniques have been developed for compensating the capacitive pulse through\nAPDs in the absence of an avalanche [39–42], but this\nparticular detector simply sets the comparator thresholds above the amplitude of the capacitive pulse.\nAs a side note, applying CW illumination to the APD\nallowed us to measure the timing of the quantum efficiency curve within the gate quite precisely, see Appendix B.\n\nVclick 1, V\n\nT2\nTemporary\nshort\n\n0.08\n0\n−0.08\nLogic 1\nLogic 0\n−40\n\nDetector cooling\n\nTo reduce the probability of dark counts, APDs are\nusually cooled to a low temperature. The two APDs in\nthis QKD system are cooled together by one 4-stage thermoelectric cooler (TEC) (Osterm PE4-115-14-15 [43]).\nThe system software reports the temperature measured\nby a thermistor mounted on the cold side of the top stage\n(cold plate), and close to where the APDs are mounted.\nNote that the cold plate temperature is not always the\nsame as the APD chip temperature, as there is actually\na quite substantial thermal resistance between the two.\nThis will become an important point in section IV B. The\nhot side of the TEC is mounted on a large heatsink with\na fan, such that it stays at approximately room temperature.\nThe temperature of the cold plate is maintained at a\npre-set value by a closed-loop controller that adjusts the\nTEC current. When the system is switched on, the cold\nplate (and thus the APDs) is first cooled to the target\ntemperature, −50 ◦C. The system will not start operation unless the cold plate settles at a temperature below\n−49.8 ◦C. After this initial check however, during system\n\n40\n\n80\n\n120\n\n160\n\n200\n\n240\n\n280\n\nTime, ns\n\nFIG. 3. An example of electrical signals during two gates in\ndetector 1 without any illumination. In the first gate thermal\nfluctuations or trapped carriers have caused an avalanche, and\na click at the comparator output (dark count). A typical amplitude of the avalanche peak is 200 mV for detector 0 and\n300 mV for detector 1. Normally the system removes 50 gates\nafter a detection event, but for this oscillogram this feature\nhas been disabled. In the second gate there is no detection\nevent. When no current runs through the APD, it is equivalent to a capacitor, and thus approximately the derivative\nof the gate pulse shape propagates to the comparator input,\nwith peak positive amplitude ≈ 35 mV.\n\noperation, there seems to be no future checks of the cold\nplate temperature, even if the controller is unable to keep\nit at the target value.\nIV.\n\nB.\n\n0\n\nBLINDING AND CONTROL\n\nBlinding is achieved when the system is insensitive to\nsingle photons. This can be achieved by ensuring that\nthe APD bias voltage is below the breakdown voltage, or\nby lowering the voltage in front of the comparator such\nthat the avalanche current does not cross the comparator threshold. The detectors are controllable if they are\naccessible to Eve in the linear mode with a sufficiently\nwell defined classical optical power click threshold, as in\nEq. 1.\nWe have previously reported that blinding Clavis2 can\nbe achieved by CW illumination due to the bias voltage\nsupply impedance R3 = 1 kΩ, which makes the bias voltage drop to a level where the APD is never in Geiger\nmode [27], even inside the gate.\nOne fast and easy countermeasure could be to use\na low-impedance bias voltage source in the detectors.\nTherefore, in this paper we consider a modified version of the detectors with R3 shorted (see Fig. 2). We\npresent three different blinding techniques which may be\nused against detectors with a low-impedance bias voltage\nsource, and show that the detectors can be controlled by\ntrigger pulses in the blind state. The technique in section IV A clearly works against high-impedance biased\n\n\f4\n\nThermal CW-blinding\n\nIt turns out that it is possible to blind also lowimpedance biased detectors (R3 = 0) by CW illumination. When an APD is illuminated, the power dissipated in the APD is transformed to heat, which may\nincrease the APD temperature. The breakdown voltage\nis temperature dependent: increasing the temperature\nincreases the breakdown voltage. Since the bias voltage\nis constant, this makes the APD leave the Geiger mode.\nTwo effects contribute to the power dissipation: electrical heating (VAPD * IAPD ) and the small contribution by\nthe absorption of the optical power. For the heat dissipation calculations, we simply assume that all the optical\npower is absorbed and transformed to heat. Figure 4\nshows how the heat dissipation increases with the optical\nillumination.\nWhen the sum of the heat dissipations of the two detectors is approximately 300 mW, the cooling system is\nrunning at its maximum capacity with a TEC current of\nabout ITEC = 2.37 A (the air temperature at the heatsink\nfan intake at this time was 23.6 ◦C). When the optical illumination is increased beyond this point, the cold plate\n(and thus APD) temperature starts to increase. Figure 5\nshows how the temperature of the cold plate increases\nwith the total amount of heat dissipated in the APDs.\nWhen the optical illumination, and thus the load is increased beyond the maximum capacity of the TEC, the\ncold plate temperature increases approximately linearly\nwith the heat dissipated by the APD. While not in the\nspecifications of this specific TEC [43], other data sheets\nof similar TECs [44] show that the temperature difference between the hot and cold plate decreases linearly\nwith respect to the load, given a constant TEC current.\nWhen the temperature of the APDs increases, the\nbreakdown voltage also increases with the coefficient of\nabout 0.1 V/K [45]. In this experiment we illuminated\nboth detectors simultaneously, to get sufficient temperature increase without risking a permanent damage to the\nAPDs. We used a fibre-optic coupler (see appendix A\nfor the experimental setup) to illuminate both detectors,\nwith 46.75%/53.25% of the optical power going to detector 0/1. This is approximately equal to the measured\nsplitting ratio for the beam splitter in front of the detec-\n\nHeat dissipation in the APD, mW\n\n450\n400\n350\n300\n250\n200\n150\nDetector 0\nDetector 1\n\n100\n50\n\n0\n\n2\n\n4\n6\n8\nOptical illumination, mW\n\n10\n\n12\n\nFIG. 4. Calculated heat dissipation (based on measured APD\ncurrent and voltage) versus the optical illumination for each\nof the two detectors.\n−25\n\n2.4\n\n−30\n\n2.2\n\n−35\n\n2\n\n−40\n\n1.8\n\n−45\n\nITEC, A\n\nA.\n\n500\n\nCold plate temperature, °C\n\ndetectors as well as against low-impedance biased detectors since it has been demonstrated [27]. The difference\nis that with a low-impedance bias voltage source, the\nblinding originates from thermal effects instead of bias\nvoltage drop. The technique in section IV B has been\nused on low-impedance biased detectors, but we see no\nreason why it should not work similarly well against the\nunmodified high-impedance biased detectors. The technique in section IV C has been used on both high- and\nlow-impedance biased detectors, but we only present the\nresults for the low-impedance biased detectors in this paper.\n\n1.6\nCold plate temperature\nTEC current\n\n−50\n\n0\n\n100\n\n200\n300\n400\n500\n600\nTotal heat dissipation in the APDs, mW\n\n700\n\n1.4\n800\n\nFIG. 5. The temperature of the cold plate and TEC current\nreported by the software, versus the total amount of heat\ndissipated in the APDs. It takes several minutes for the cold\nplate temperature to stabilize at a new value (hotter than\n−50 ◦ C) after the power dissipation in the APDs is changed.\n\ntors in the system, when illuminated through the short\narm of the interferometer [46–48].\nFig. 6 shows the click probability versus the CW illumination of the two detectors. The click probability\ndrops below the normal dark count probability (about\n10−4 ), before it becomes exactly zero when the illumination exceeds 8.8 mW and 10 mW at the detectors. In the\nexperiment the blinding caused clicks for several minutes\nbefore the APDs were properly heated. However, the\nblinding only needs to be turned on once, afterwards Eve\nremains undetected.\nAfter the cold plate has been heated by APD illumination, it takes several tens of seconds before it cools to the\ntarget temperature of −50 ◦C. Therefore, the detectors\nstay blind for some time after the CW blinding illumination is turned off. Detectors 0 and 1 regain dark counts\nwhen the cold plate (and thus the APDs) becomes colder\nthan −39.8 ◦ C and −40.1 ◦C, respectively.\nTo verify that the detectors could be controlled, the\ndetectors were blinded with 9.5 mW at detector 0 and\n10.7 mW at detector 1, and controlled by superimposing\n\n\f5\n1\n\nDetector 0\nDetector 1\n\nClick probability\n\n10−2\n10−4\n10−6\n10−8\n\n0\n0+0\n\n2.3 + 2.7\n4.6 + 5.4\n6.9 + 8.1\nOptical illumination of detector 0 + 1, mW\n\n9.2 + 10.8\n\nFIG. 6. Click probability versus power of CW illumination\napplied to both detectors simultaneously.\n\nTABLE I. Control pulse peak power at 0 % and 100 % click\nprobability thresholds, in CW thermal blinding mode.\nClick probabilities\nDetector\n0%\n100 %\n0\n1.12 mW 1.31 mW\n1\n1.71 mW 2.02 mW\n\na 3 ns long laser pulse slightly after the gate. The click\nprobability thresholds are listed in table I. The thresholds satisfy Eq. 1, and thus the eavesdropping method\ndescribed in section II should be possible when the detectors are thermally blinded by CW illumination.\nAfter observing thermal blinding in this experiment, we realized that this could be the reason why\nthe PerkinElmer SPCM-AQR actively-quenched detector module remained blind at bright pulse frequencies\nabove 400 kHz, despite no substantial bias voltage drop\n[26]. Therefore we did more precise measurements which\nconfirm that PerkinElmer SPCM-AQR can be thermally\nblinded [49].\n\nB.\n\nwhere the frames went blind, and the average current\nthrough the APDs, the thermal resistance between each\nAPD chip and the cold plate is estimated to be at least\n190 K/W.\nTo heat the APDs we used 225 μs long pulses timed\nin between the frames and fired at both APDs simultaneously. The whole frame went blind at approximately\n1.5 mW and 1.7 mW pulse power at detector 0 and 1\nrespectively. The oscillograms in Fig. 7 show the electrical and optical signals in detector 1 when frames of 1072\ngates are thermally blinded by the 225 μs long pulses with\n3.5 mW in-pulse power at detector 0, and 4 mW in-pulse\npower at detector 1. While the system was blind, the\ncold plate temperature reading was −49.5 ◦C, and the\nTEC was running well below its maximum capacity at\nITEC = 2.006 A.\nTo verify that the detectors could be controlled, we\nchecked the response to a 4 ns long control pulse timed\nslightly after the gate of one of the first bits of the frame,\nand the last bit of the frame. The detection probability\nthresholds for the second [52] and the last bit are given\nin tables II and III. Figure 8 shows oscillograms from\ndetector 1 when it is blinded and controlled in the second\nbit of the frame.\nThe click probability thresholds in tables II and III\neach satisfy Eq. 1 individually. However, P0%,0 in the\nlast bit of the frame is less than 1/2 of P100%,1 in the\nsecond bit of the frame. This means that the control\npulse power would have to be decreased throughout the\nframe. Since the second and the last bit of the frame\ncan be controlled, it is plausible that the eavesdropping\nmethod described in section II could be applied to any\nbit of the frame.\nWhat is remarkable about this blinding method is that\ndue to the low thermal conductivity between the APD\nchip and the cold plate, as well as the thermal inertia\nof the nearby parts, the cold plate thermistor reports a\nvalue very close to the normal value. Therefore monitoring the cold plate temperature would not suffice to\nprevent thermal blinding.\n\nThermal blinding of frames\n\nAs this QKD system is of plug-and-play type, it sends\nthe qubits in packets called frames to avoid Rayleigh\nback-scattered photons to arrive during the gates and\nincrease the QBER [46, 50]. For our experiment we used\n1072 qubits per frame [51]. With a 200 ns bit period this\nmakes the frame length 214.4 μs. The break in between\nthe frames varies with the fibre length between Alice and\nBob, but is always longer than the frame itself. In our\nexperiment we simply used a 250 μs frame break, which\nmakes a total frame + break period of 464.4 μs.\nIt turns out that the APD chip and the inner parts\nimmediately touching it (not the APD package and not\nthe cold plate) act as a thermal reservoir on the frame\nperiod time scale. Therefore bright illumination between\nthe frames heats the APD sufficiently that it stays blind\nthroughout the whole frame. Based on the optical power\n\nTABLE II. Control pulse peak power at 0 % and 100 % click\nprobability thresholds for the second bit in the frame, when\nthe frame is thermally blinded.\nClick probabilities\nDetector\n0%\n100 %\n0\n401 μW 533 μW\n1\n580 μW 747 μW\n\nTABLE III. Control pulse peak power at 0 % and 100 % click\nprobability thresholds for the last bit in the frame, when the\nframe is thermally blinded.\nClick probabilities\nDetector\n0%\n100 %\n0\n305 μW 420 μW\n1\n340 μW 532 μW\n\n\f4\n3\n2\n1\n0\n\n1072 gates = 214.4 μs\n\nPlaser, mW\n\n250 μs\n\nVgate 1, V\n\n3\n2\n1\n0\n\n225 μs\n\n0.16\n\nVcomp 1, V\n\nVcomp 1, V\n\nPlaser, mW\n\nVgate 1, V\n\n6\n\n0.08\n0\n\n250 μs\n\n4\n3\n2\n1\n0\n\n1072 gates = 214.4 μs\n\n225 μs\n\n0.16\n0.08\n0\n−0.08\n\nVclick 1, V\n\nVclick 1, V\n\n−0.08\n\n3\n2\n1\n0\n\nLogic 1\nLogic 0\n0\n\n100\n\n200\n\n300\n\n400\n\nLogic 1\nLogic 0\n\n500\n\n0\n\n100\n\n200\n\n300\n\n400\n\nVgate 1, V\n\n3\n2\n1\n0\n\nPlaser, mW\n\n4\n3\n2\n1\n0\n0.16\n0.08\n0\n−0.08\n\n3\n2\n1\n0\n4\n3\n2\n1\n0\n\n580 μW\n\n747 μW\n\n0.16\n0.08\n0\n−0.08\n\nVclick 1, V\n\nVclick 1, V\n\n500\nTime, μs\n\nVcomp 1, V\n\nVcomp 1, V\n\nPlaser, mW\n\nVgate 1, V\n\nTime, μs\n\nLogic 1\nLogic 0\n0\n\n40\n80\n120\n160\n200\n240\n280\n320\nTime, ns (starting 365.12 μs in the upper set of oscillograms)\n\nFIG. 7. Thermal blinding of frames. The oscillograms show\nelectrical and optical signals when frames of 1072 gates in detector 1 are thermally blinded by a 225 μs blinding pulse, with\n3.5 mW pulse power at detector 0, and 4 mW pulse power at\ndetector 1. The blinding pulse causes a detection event outside the frame, where the system probably does not register\nclicks (If the click is registered, it could easily be avoided by\nincreasing the power of the blinding pulse gradually, such that\nthe comparator input AC-coupling keeps the voltage below\nthe comparator threshold).\n\nC.\n\nLogic 1\nLogic 0\n0\n\n40\n\n80\n\n120\n\n0\n\n40\n\n80\n\n120\n\n160\n\nTime, ns (starting 259.52 μs in the upper set of oscillograms)\n\nFIG. 8. Detector control during thermal blinding of frames.\nThe oscillograms show electrical and optical signals when\nframes of 1072 gates in detector 1 are thermally blinded by a\n225 μs blinding pulse, with 3.5 mW pulse power at detector 0,\nand 4 mW pulse power at detector 1, and the detector is controlled by a 4 ns long control pulse timed slightly after the\nsecond gate in the frame. In the upper and lower left sets of\noscillograms, the 580 μW control pulse never causes any click.\nIn the lower right set, the control pulse is applied after the\nsame gate in the frame, but now its increased 747 μW peak\npower always causes a click.\n\nSinkhole blinding\n\nIt is natural to ask whether the framed blinding technique can be applied at the single gate level, i.e. what\nhappens if bright illumination is applied between adjacent gates? It turns out that this also leads to blinding,\nbut not primarily due to thermal effects. Since the comparator input is AC-coupled (see Fig. 2), the signal at the\ninput of the comparator has the same area over and un-\n\nder 0 V level when averaged over time much longer than\nR4 * C1 = 165 ns. Thus by sending long bright pulses between the gates and no illumination near the gate, it is\npossible to superimpose a negative-voltage pulse at the\ncomparator input at the gate time. We call this negative\npulse a sinkhole. An avalanche that occurs within it can\nhave a normal amplitude yet remain below the comparator threshold level.\n\n\f1.5\n\nVgate 1, V\n\nVgate 1, V\n\n3\n2\n1\n0\n\nPlaser, mW\n\n7\n\nPlaser, mW\n\n2\n\n1\n0.5\n\n1.5\n1\n0.5\n0\n\n0.16\n\n0.16\n\nVcomp 1, V\n\n0\n\n0.08\n0\n−0.08\n\nVclick 1, V\n\nVclick 1, V\n\nVcomp 1, V\n\n2\n\n3\n2\n1\n0\n\nLogic 1\nLogic 0\n−40\n\n0\n\n40\n\n80\n\n120\n\n160\n\n200\n\n240\n\n280\n\nTABLE IV. Control pulse peak power at 0 % and 100 % click\nprobability thresholds, during sinkhole blinding.\nClick probabilities\nDetector\n0%\n100 %\n0\n655 μW 751 μW\n773 μW 908 μW\n1\n\nUsing a 140 ns long pulse beginning about 25 ns after the gate, detector 0 becomes completely blind when\nPlaser > 205 μW, and detector 1 becomes blind when\nPlaser > 400 μW. To keep both detectors blind, Plaser =\n500 μW is used subsequently. When a large pulse is applied between the gates, the detector will always experience a dark count in the gate due to trapped carriers. Figure 9 shows detector 1 blinded by a 140 ns long,\n500 μW bright pulse, starting about 25 ns after the gate.\nInitially when the blinding pulses are turned on, there\nis a transient with about 20-100 clicks, which would be\neasily detectable in post-processing. Note again that the\nblinding only needs to be turned on once, and that the\nblinding can be turned on before the raw key exchange\nto avoid the clicks being registered.\nDetector control is obtained by a 3.2 ns long laser pulse\ntimed shortly after the gate. The click probability thresholds found are listed in Table IV. Figure 10 shows oscillograms from detector 1 when it is blind and controlled. Once again, the thresholds in table IV satisfy\n\n0\n−0.08\nLogic 1\nLogic 0\n−40 −20\n\nTime, ns\n\nFIG. 9. Sinkhole blinding. The oscillograms show electrical\nand optical signals when detector 1 is blinded by a 500 μW,\n140 ns long laser pulse in between the gates. The avalanche\namplitude is about 130 mV and would cause a click if it were\nnot sitting in the negative-voltage pulse. It seems that the reduction in avalanche amplitude (compare to Fig. 3) is caused\nby heating of the APD, which effectively rises the breakdown\nvoltage.\n\n0.08\n\n0\n\n20\n\nTime, ns\n\n40\n\n60 −40 −20\n\n0\n\n20\n\n40\n\n60\n\nTime, ns\n\nFIG. 10. Detector control during sinkhole blinding. The oscillograms show electrical and optical signals when detector 1\nis blinded with a 500 μW, 140 ns long laser pulse in between\nthe gates, and controlled with a 3.2 ns long laser pulse timed\nshortly after the gate. To the left, the 773 μW control pulse\nnever causes any click. To the right, the 908 μW control pulse\nalways causes a click.\n\nEq. 1, and thus the eavesdropping method described in\nsection II should be possible when the detectors are sinkhole blinded.\nV.\n\nDISCUSSION AND COUNTERMEASURES\n\nFirst of all, the numerous detectors proved blindable\nand controllable [25–27, 29, 49], and the large number\nof independent blinding methods available show that\navoiding this loophole is non-trivial. Further the results\npresented in this paper clearly show that reducing the\nimpedance of the bias voltage supply is far from being a\nsufficient countermeasure for this detector design.\nAt this point it is not clear to us how to design hackproof detectors. The most obvious countermeasure is to\nmonitor the optical power at Bob's entrance with an additional detector. However it is not obvious that this\nactually closes the loophole; as pointed out previously\nthe click threshold close to the gate may be very low, allowing for practically non-detectable control pulses [27].\nThus it is not clear how to set the threshold value for\nthe entrance monitor; in any case the threshold should\nbe derived from and incorporated into a security proof.\nIt would also be crucial that this monitoring detector is\nnot blindable.\nFor the passively quenched scheme it has been proposed previously to monitor APD parameters such as\nAPD bias voltage, current and temperature [25]. How-\n\n\f8\n\nCONCLUSION\n\nThe detectors in the Clavis2 QKD system have proved\nto be blindable by a variety of methods, even with a lowimpedance bias voltage supply. Further, the detectors\ncan always be controlled in the blind state. This allows\neavesdropping on the QKD system, using the method described in section II. Since Eve may use an exact copy of\nBob's system, no parameters currently available to Bob\nreveal Eve's presence. In practice, this should allow for\nperfect eavesdropping where Eve has an exact copy of\nBob's raw key, and thus can extract the full secret key.\nThe eavesdropping strategy described in section II has\nbeen implemented and used to capture 99.8% of the raw\nkey in a 290 m experimental entanglement-based QKD\nsystem [29]. We see no practical difficulties implementing the same eavesdropper for this commercial QKD system, using off-the-shelf components. Actually we have\nproposed a plug-and-play eavesdropper scheme [27] for\neasy deployment.\nMany detectors have already been proved blindable\nand controllable by Eve [25–27], and the large variety\nof blinding methods available for the system tested could\nprobably be used on other detector designs as well. While\nit is relatively easy to design a countermeasure that prevents blinding attacks with the specific parameters chosen in the present work, it is unclear to us how to build\ngeneric secure detectors.\nThis work further emphasizes the importance of thoroughly investigating the non-idealities of each component\nin a QKD system, as well as battle-testing the system as\na whole.\nID Quantique has been notified about the loophole\nprior to this publication, and has implemented countermeasures.\n\nGates from\ndetector 0\n\nTrigger\n\nChannel\n\nA\nB\nC\n\n33\n33\n\nFiber−pigtailed laser\nAlcatel 1905 LMI\n(1536.22 nm)\n\n22\n\nAPD 0/1\n\n100\n\nFIG. 11. The setup used in the experiment. Both detectors\nwere illuminated simultaneously by inserting a 50/50 fibreoptic coupler (not shown in the diagram) before the APDs.\n\npower. In our experiment, the observed change in pulse\nwidth is less than 10 % after doubling the laser power.\nAlso, the comparator threshold does not seem to be significantly dependent on the pulse width, thus we consider\nour results valid despite this small change in the laser\npulse width.\n\nAppendix B: Direct measurement of quantum\nefficiency\n\nWhen CW illumination is applied to the APD, the\napplied electrical gate \"propagates\" to the comparator\ninput. This might be caused by a change in linear multiplication coefficient caused by the electrical gate. This\nallowed us to measure the quantum efficiency mapped inside the \"propagated\" gate with about 200 ps precision.\nThe single photon sensitivity was measured using a\nid300 short-pulsed laser attenuated to a mean photon\nnumber of 1 per pulse. The quantum efficiency η was derived from the data assuming that the detector is linear\n(i.e. that an n-photon state is detected with probability\n1 − (1 − η)n ). The timing of the photon arrival at the\nAPD relative to the applied gate was aligned by observing a response to unattenuated laser pulse on top of the\n2.1 mW CW illumination. Figure 12 shows the result of\nthe measurement on detector 1.\n3\n\n0.09\nElectrical gate\nQuantum efficiency\n\n2.5\n\n0.075\n\n2\n\n0.06\n\n1.5\n\n0.045\n\n1\n\n0.03\n\n0.5\n\n0.015\n\n0\n−2\n\nQuantum efficiency\n\nVI.\n\nHighland Technology\nP400 digital delay generator\n\nElectrical gate, V\n\never, the results in section IV B show that normal APD\nparameters do not necessarily guarantee single photon\nsensitivity: for thermal blinding of frames all the APD\nparameters report normal values during the frames while\nthe detectors are in fact blind.\nIt is worth emphasizing that the loophole opens when\nEve drives the detectors into an abnormal operating\nregime, namely the linear mode. However, there are also\nquantum detectors which are actually designed to operate in linear mode. For example, homodyne detectors\nused in continuous-variable QKD [53, 54] are probably\nnot susceptible to the described attack.\n\n0\n−1\n\n0\n\n1\n2\nTime, ns\n\n3\n\n4\n\n5\n\nAppendix A: Measurement setup\n\nFigure 11 shows the measurement setup used for this\nexperiment. The trigger signal is tapped directly from\nthe PECL gate signal (before DD1 in Fig. 2).\nWhen pump current is used to control the power of\nthe laser, the pulse width will vary slightly with the peak\n\nFIG. 12. Quantum efficiency measured directly within the\nelectrical gate for detector 1. The photon sensitivity drops\nabout 1 ns before the falling edge of the gate, because\navalanches that start late do not have time to develop a large\nenough current to cross the comparator threshold.\n\n\f9\nACKNOWLEDGMENTS\n\nity program financed by NFR (project no. 199854) and\nDAAD (project no. 50727598).\n\nThis work was supported by the Research Council of\nNorway (grant no. 180439/V30) and DAADppp mobil-\n\n[1] C. H. Bennett and G. Brassard, in Proceedings of IEEE\nInternational Conference on Computers, Systems, and\nSignal Processing (IEEE Press, New York, Bangalore,\nIndia, 1984) pp. 175–179.\n[2] A. K. Ekert, Phys. Rev. Lett., 67, 661 (1991).\n[3] H.-K. Lo and H. F. Chau, Science, 283, 2050 (1999).\n[4] P. W. Shor and J. Preskill, Phys. Rev. Lett., 85, 441\n(2000).\n[5] D. Stucki, N. Walenta, F. Vannel, R. T. Thew, N. Gisin,\nH. Zbinden, S. Gray, C. R. Towery, and S. Ten, New J.\nPhys., 11, 075003 (2009).\n[6] Commercial QKD systems are available from at least two\ncompanies: ID Quantique (Switzerland), http://www.\nidquantique.com; MagiQ Technologies (USA), http:\n//www.magiqtech.com.\n[7] D. Mayers, in Proceedings of Crypto'96, Vol. 1109, edited\nby N. Koblitz (Springer, New York, 1996) pp. 343–357.\n[8] D. Gottesman, H.-K. Lo, N. Lütkenhaus, and J. Preskill,\nQuant. Inf. Comp., 4, 325 (2004).\n[9] H. Inamori, N. Lütkenhaus, and D. Mayers, Eur. Phys.\nJ. D, 41, 599 (2007).\n[10] C.-H. F. Fung, K. Tamaki, B. Qi, H.-K. Lo, and X. Ma,\nQuant. Inf. Comp., 9, 131 (2009).\n[11] L. Lydersen and J. Skaar, Quant. Inf. Comp., 10, 0060\n(2010).\n[12] Ø. Marøy, L. Lydersen,\nand J. Skaar, e-print\narXiv:0903.3525, accepted for publication in Phys. Rev.\nA.\n[13] A. Vakhitov, V. Makarov, and D. R. Hjelme, J. Mod.\nOpt., 48, 2023 (2001).\n[14] N. Gisin, S. Fasel, B. Kraus, H. Zbinden, and G. Ribordy, Phys. Rev. A, 73, 022320 (2006).\n[15] V. Makarov, A. Anisimov, and J. Skaar, Phys. Rev. A,\n74, 022313 (2006), erratum ibid. 78, 019905 (2008).\n[16] V. Makarov and J. Skaar, Quant. Inf. Comp., 8, 0622\n(2008).\n[17] B. Qi, C.-H. F. Fung, H.-K. Lo, and X. Ma, Quant. Inf.\nComp., 7, 73 (2007).\n[18] Y. Zhao, C.-H. F. Fung, B. Qi, C. Chen, and H.-K. Lo,\nPhys. Rev. A, 78, 042333 (2008).\n[19] A. Lamas-Linares and C. Kurtsiefer, Opt. Express, 15,\n9388 (2007).\n[20] S. Nauerth, M. Fürst, T. Schmitt-Manderbach, H. Weier,\nand H. Weinfurter, New J. Phys., 11, 065001 (2009).\n[21] C.-H. F. Fung, B. Qi, K. Tamaki, and H.-K. Lo, Phys.\nRev. A, 75, 032314 (2007).\n[22] F. Xu, B. Qi, and H.-K. Lo, e-print arXiv:1005.2376v1\n[quant-ph].\n[23] H. F. Chau, Phys. Rev. A, 66, 060302 (2002).\n[24] D. Gottesman and H.-K. Lo, IEEE Trans. Inf. Theory,\n49, 457 (2003).\n[25] V. Makarov, New J. Phys., 11, 065003 (2009).\n[26] V. Makarov, A. Anisimov,\nand S. Sauge, e-print\narXiv:0809.3408v2 [quant-ph].\n[27] L. Lydersen, C. Wiechers, C. Wittmann, D. Elser,\n\n[28]\n\n[29]\n[30]\n[31]\n[32]\n[33]\n\n[34]\n[35]\n[36]\n[37]\n[38]\n[39]\n[40]\n[41]\n[42]\n[43]\n[44]\n\n[45]\n\n[46]\n[47]\n[48]\n[49]\n[50]\n\nJ. Skaar, and V. Makarov, Nat. Photonics (2010), doi:\n10.1038/nphoton.2010.214.\nC. Wiechers, L. Lydersen, C. Wittmann, D. Elser,\nJ. Skaar, C. Marquardt, V. Makarov, and G. Leuchs,\n\"After-gate attack on a quantum cryptosystem,\" In\npreparation.\nI. Gerhardt, Q. Liu, J. Skaar, A. Lamas-Linares, C. Kurtsiefer, and V. Makarov, in preparation.\nI. Marcikic, A. Lamas-Linares, and C. Kurtsiefer, Appl.\nPhys. Lett., 89, 101122 (2006).\nM. P. Peloso, I. Gerhardt, C. Ho, A. Lamas-Linares, and\nC. Kurtsiefer, New J. Phys., 11, 045007 (2009).\nS. Cova, M. Ghioni, A. Lotito, I. Rech, and F. Zappa,\nJ. Mod. Opt., 51, 1267 (2004).\nAll references to the APD bias voltage are absolute valued, thus an APD biased \"above\" the breakdown voltage\nis in the Geiger mode. In practice the APDs are always\nreverse-biased.\nV. Makarov and D. R. Hjelme, J. Mod. Opt., 52, 691\n(2005).\nV. Scarani, A. Acı́n, G. Ribordy, and N. Gisin, Phys.\nRev. Lett., 92, 057901 (2004).\nW.-Y. Hwang, Phys. Rev. Lett., 91, 057901 (2003).\nX.-B. Wang, Phys. Rev. A, 72, 012322 (2005).\nH.-K. Lo, X. Ma, and K. Chen, Phys. Rev. Lett., 94,\n230504 (2005).\nS. Cova, A. Longoni, and A. Andreoni, Rev. Sci. Instrum., 52, 408 (1981).\nD. S. Bethune and W. P. Risk, IEEE J. Quantum Electron., 36, 340 (2000).\nA. Tomita and K. Nakamura, Opt. Lett., 27, 1827 (2002).\nZ. L. Yuan, B. E. Kardynal, A. W. Sharpe, and A. J.\nShields, Appl. Phys. Lett., 91, 041114 (2007).\nOsterm,\nPE4-115-14-15,\nhttp://osterm.ru/PAGE/\nMULTISTAGE.HTM, visited 3. August 2010.\nMarlow,\nNL4012,\nhttp://www.marlow.com/media/\nmarlow/product/downloads/nl4012t/NL4012.pdf,\nvisited 3. August 2010.\nThe detectors do not have any dark counts and are assumed blind at a temperature of about −40 ◦ C at the cold\nplate, or when the bias voltage is decreased by 0.97 V. If\none assumes that the APD temperature is equal to the\ncold plate temperature, this means that heating the detectors by 10 K is equivalent to decreasing the bias voltage by about 1 V.\nG. Ribordy, J.-D. Gautier, N. Gisin, O. Guinnard, and\nH. Zbinden, Electron. Lett., 34, 2116 (1998).\nD. Stucki, N. Gisin, O. Guinnard, G. Ribordy, and\nH. Zbinden, New J. Phys., 4, 41 (2002).\nN. Gisin, G. Ribordy, W. Tittel, and H. Zbinden, Rev.\nMod. Phys., 74, 145 (2002).\nS. Sauge, L. Lydersen, A. Anisimov, J. Skaar, and\nV. Makarov, in preparation.\nG. Ribordy, J.-D. Gautier, N. Gisin, O. Guinnard, and\nH. Zbinden, J. Mod. Opt., 47, 517 (2000).\n\n\f10\n[51] The system actually sends the qubits in frames of 1075\nqubits each. We initially made a mistake when counting\nthem and used 1072 qubits, which is very close and does\nnot affect the results.\n[52] We picked the second bit to simplify synchronization\nin our measurement setup. The results for the first bit\n\nshould be very similar to the results for the second bit.\n[53] S. L. Braunstein and P. van Loock, Rev. Mod. Phys., 77,\n513 (2005).\n[54] U. L. Andersen, G. Leuchs, and C. Silberhorn, Laser\nPhoton. Rev., 4, 337 (2010), arXiv:1008.3468v1 [quantph].\n\n\f"}