{"id": "http://arxiv.org/abs/1105.0075v1", "guidislink": true, "updated": "2011-04-30T11:07:08Z", "updated_parsed": [2011, 4, 30, 11, 7, 8, 5, 120, 0], "published": "2011-04-30T11:07:08Z", "published_parsed": [2011, 4, 30, 11, 7, 8, 5, 120, 0], "title": "Magnetic hydrogels derived from polysaccharides with improved specific\n  power absorption: potential devices for remotely triggered drug delivery", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1105.5970%2C1105.0850%2C1105.4297%2C1105.0814%2C1105.1099%2C1105.3535%2C1105.0075%2C1105.2273%2C1105.0241%2C1105.1915%2C1105.5393%2C1105.6177%2C1105.4444%2C1105.2753%2C1105.3400%2C1105.4435%2C1105.5024%2C1105.2279%2C1105.0662%2C1105.6310%2C1105.3555%2C1105.2341%2C1105.3151%2C1105.3750%2C1105.5275%2C1105.2719%2C1105.1981%2C1105.0794%2C1105.2961%2C1105.2470%2C1105.2585%2C1105.4342%2C1105.1021%2C1105.1266%2C1105.3303%2C1105.6319%2C1105.5099%2C1105.1602%2C1105.2282%2C1105.2841%2C1105.4310%2C1105.0924%2C1105.2490%2C1105.4092%2C1105.4636%2C1105.3864%2C1105.1526%2C1105.2984%2C1105.4810%2C1105.4868%2C1105.1101%2C1105.1722%2C1105.5298%2C1105.5436%2C1105.5828%2C1105.3388%2C1105.4772%2C1105.4599%2C1105.0982%2C1105.1512%2C1105.0330%2C1105.4171%2C1105.1566%2C1105.0730%2C1105.0890%2C1105.5626%2C1105.2152%2C1105.1680%2C1105.3530%2C1105.3451%2C1105.3728%2C1105.4498%2C1105.2301%2C1105.0161%2C1105.0894%2C1105.0304%2C1105.4217%2C1105.4118%2C1105.5309%2C1105.6101%2C1105.2589%2C1105.1036%2C1105.0121%2C1105.0404%2C1105.0226%2C1105.4579%2C1105.4951%2C1105.4899%2C1105.3156%2C1105.1815%2C1105.4353%2C1105.5548%2C1105.2456%2C1105.3814%2C1105.5586%2C1105.2131%2C1105.3285%2C1105.4485%2C1105.0270%2C1105.2109%2C1105.0332&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Magnetic hydrogels derived from polysaccharides with improved specific\n  power absorption: potential devices for remotely triggered drug delivery"}, "summary": "We report on novel ferrogels derived from polysaccharides (sodium alginate\nand chitosan) with embedded iron oxide nanoparticles synthesized in situ and\ntheir combination with thermally responsive poly (N-isopropylacrylamide) for\nexternally-driven drug release using AC magnetic fields. Samples were\ncharacterized by Raman spectroscopy, transmission electron microscopy (TEM) and\nmagnetic measurements. The obtained nanoparticles were found to be of ca. 10 nm\naverage size, showing magnetic properties very close to those of the bulk\nmaterial. The thermal response was measured by power absorption experiments,\nfinding specific power absorption (SPA) values between 100-300 W/g, which was\nenough for attaining the lower critical solution temperature (LCST) of the\npolymeric matrix within few minutes. This fast response makes these materials\ngood candidates for externally controlled drug release.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1105.5970%2C1105.0850%2C1105.4297%2C1105.0814%2C1105.1099%2C1105.3535%2C1105.0075%2C1105.2273%2C1105.0241%2C1105.1915%2C1105.5393%2C1105.6177%2C1105.4444%2C1105.2753%2C1105.3400%2C1105.4435%2C1105.5024%2C1105.2279%2C1105.0662%2C1105.6310%2C1105.3555%2C1105.2341%2C1105.3151%2C1105.3750%2C1105.5275%2C1105.2719%2C1105.1981%2C1105.0794%2C1105.2961%2C1105.2470%2C1105.2585%2C1105.4342%2C1105.1021%2C1105.1266%2C1105.3303%2C1105.6319%2C1105.5099%2C1105.1602%2C1105.2282%2C1105.2841%2C1105.4310%2C1105.0924%2C1105.2490%2C1105.4092%2C1105.4636%2C1105.3864%2C1105.1526%2C1105.2984%2C1105.4810%2C1105.4868%2C1105.1101%2C1105.1722%2C1105.5298%2C1105.5436%2C1105.5828%2C1105.3388%2C1105.4772%2C1105.4599%2C1105.0982%2C1105.1512%2C1105.0330%2C1105.4171%2C1105.1566%2C1105.0730%2C1105.0890%2C1105.5626%2C1105.2152%2C1105.1680%2C1105.3530%2C1105.3451%2C1105.3728%2C1105.4498%2C1105.2301%2C1105.0161%2C1105.0894%2C1105.0304%2C1105.4217%2C1105.4118%2C1105.5309%2C1105.6101%2C1105.2589%2C1105.1036%2C1105.0121%2C1105.0404%2C1105.0226%2C1105.4579%2C1105.4951%2C1105.4899%2C1105.3156%2C1105.1815%2C1105.4353%2C1105.5548%2C1105.2456%2C1105.3814%2C1105.5586%2C1105.2131%2C1105.3285%2C1105.4485%2C1105.0270%2C1105.2109%2C1105.0332&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We report on novel ferrogels derived from polysaccharides (sodium alginate\nand chitosan) with embedded iron oxide nanoparticles synthesized in situ and\ntheir combination with thermally responsive poly (N-isopropylacrylamide) for\nexternally-driven drug release using AC magnetic fields. Samples were\ncharacterized by Raman spectroscopy, transmission electron microscopy (TEM) and\nmagnetic measurements. The obtained nanoparticles were found to be of ca. 10 nm\naverage size, showing magnetic properties very close to those of the bulk\nmaterial. The thermal response was measured by power absorption experiments,\nfinding specific power absorption (SPA) values between 100-300 W/g, which was\nenough for attaining the lower critical solution temperature (LCST) of the\npolymeric matrix within few minutes. This fast response makes these materials\ngood candidates for externally controlled drug release."}, "authors": ["R. Hernandez", "J. Sacristan", "L. Asin", "T. E. Torres", "M. R. Ibarra", "G. F. Goya", "C. Mijangos"], "author_detail": {"name": "C. Mijangos"}, "author": "C. Mijangos", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1021/jp105556e", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1105.0075v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1105.0075v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "26 pages, 7 figures", "arxiv_primary_category": {"term": "cond-mat.mtrl-sci", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cond-mat.mtrl-sci", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1105.0075v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1105.0075v1", "journal_reference": "J. Phys. Chem. B, 2010, 114 (37), pp 12002--12007", "doi": "10.1021/jp105556e", "fulltext": "Magnetic hydrogels derived from polysaccharides with improved specific power\nabsorption: potential devices for remotely triggered drug delivery.\n\nR. Hernández1, *, J. Sacristán, L. Asín2, T. E. Torres2,3, M. R. Ibarra2,3 G. F. Goya2,3,\nand C. Mijangos1\n\n1\n\nInstituto de Ciencia y Tecnología de Polímeros, CSIC, Juan Cierva 3, E-28006 Madrid, Spain.\n\n2\n\n3\n\nInstituto de Nanociencia de Aragón (INA), Universidad de Zaragoza, 50018, Spain.\n\nDepartamento de Física de la Materia Condensada, Universidad de Zaragoza, Zaragoza, Spain.\n\n1\n\n\fAbstract\nWe report on novel ferrogels derived from polysaccharides (sodium alginate and\nchitosan) with embedded iron oxide nanoparticles synthesized in situ and their\ncombination with thermally responsive poly (N-isopropylacrylamide) for externallydriven drug release using AC magnetic fields. Samples were characterized by Raman\nspectroscopy, transmission electron microscopy (TEM) and magnetic measurements.\nThe obtained nanoparticles were found to be of ca. 10 nm average size, showing\nmagnetic properties very close to those of the bulk material. The thermal response was\nmeasured by power absorption experiments, finding specific power absorption (SPA)\nvalues between 100-300 W/g, which was enough for attaining the lower critical solution\ntemperature (LCST) of the polymeric matrix within few minutes. This fast response\nmakes these materials good candidates for externally controlled drug release.\n\n2\n\n\f1. Introduction\nThe development of new controlled release formulation techniques has\nbeen boosted by the discovery of new biocompatible polymers and nanomaterials. The\nbottom line is, regarding clinical applications, to enhance patient compliance and to\nproduce improved drug delivery profiles. Controlled release systems based on polymer\ngels and microgels have opened the possibility of remote triggering controlled by\nmagnetic fields by incorporating magnetic nanoparticles (NPs), and thus making\npossible non-invasive release of therapeutic molecules at specific points deeply located\nin the body1-3.\nThe relatively new technique known as magnetic hyperthermia aims the raising\nof the temperature of a magnetic colloid (or targeted cells) from the magnetic coupling\nbetween the magnetic moment of the NPs and the applied alternate magnetic field2. The\nability of generating heat is measured by the specific power absorption (SPA), which is\nthe power absorbed per unit mass of magnetic nanoparticles. Regarding the physical\nmechanisms behind heat generation by power absorption, some details of the model\nproposed by Rosensweig\n\n4\n\nare still being discussed\n\n5, 6\n\n. The heating agents (i.e., the\n\nmagnetic nanoparticles) have been also used to rise the temperature of different target\nsystems, such as polymers 7 and membranes 1, 8, 9 and, as the largest field of application,\ncancer cells 10, 11.\nThe combination of magnetic hyperthermia and controlled drug release is\ncurrently under intensive investigation for cancer treatments12. By combining magnetic\nnanoparticles with thermosensitive polymers, an alternating current (AC) magnetic field\ncan be used to trigger localized heating in vivo, which in turn causes a phase change in\nthe host polymer to allow diffusion and release of drugs\n\n13-15\n\n. Among the temperature\n\nresponsive polymers, one of the most popular for controlled drug release applications is\n\n3\n\n\fthe poly(N-isopropylacrylamide) (PNIPAAm) as it exhibits a lower critical solution\ntemperature (LCST) that can be tailored to be within the physiological range, i.e.,\nhuman body temperature16,\n\n17\n\n. The application of an alternating magnetic field on\n\nPNIPAAm hydrogels loaded with Fe3O4 nanoparticles (20-30 nm) results in uniform\nheating of the ferrogel leading to accelerated collapse and squeezing out large amounts\nof imbibed drug (release at a faster rate). In addition, the drug dose can be modulated\nwith the application time of the alternating magnetic field18.\nWe have recently described a method to obtain ferrogels with response to\ntemperature and magnetic fields, in which the iron oxide NPs synthesis is carried out\nthrough coprecipitation of iron salts in alkaline solutions inside semiinterpenetrating\n(semiIPN) polymer networks constituted of alginate and PNIPAAm 19. These ferrogels\nexhibit an improved deswelling rate with respect to pure PNIPAAm. In addition, the\nsynthesis in situ of iron oxide NPs inside Alg-PNIPAAm semi-IPNs allows controlling\nthe polydispersity of the iron oxide NPs when compared to the reaction carried out in an\nalginate solution. In this way, the polymeric gel acts as a spatial framework to control\nthe iron oxide NPs size distribution20. This method has also been employed for the in\nsitu synthesis of iron oxide NPs inside chitosan ferrogels obtaining systems with\nresponse to pH and magnetic fields21.\nIn this work, we present results on magnetic properties and heating experiments\non hydrogels derived from polysaccharides (chitosan and alginate), aimed to optimize\nthe physical absorption of magnetic power and subsequent heat release by varying the\npolymer composition and the nanoparticles content. The composite ferrogels have\nshown good response to external time-varying magnetic fields, opening the possibility\nof using them as smart drug delivery materials for bioapplications.\n\n4\n\n\f2. Experimental part\n2.1.Preparation of ferrogels\nSemi-interpenetrating polymer networks constituted by alginate and PNIPAAm\nwere obtained as reported elsewhere\n\n19, 20\n\n. The synthesis of iron oxide nanoparticles\n\ninside Alg-PNIPAAm semi-IPNs hydrogels involves two steps. As a first step, gels are\nimmersed in an acid solution containing Fe2+ and Fe3+. As a second step, the solutions\nare carefully immersed in an alkaline solution to oxidize the iron cations to iron oxide\nnanoparticles. For this work, two series with the same degree of crosslinking of the\nPNIPAAm (molBIS/molN-AAm= 3 %) and different alginate concentrations were\nsynthesized, series I with 0.5 wt% sodium alginate (Alg0.5-PNIPAAm) and series II\nwith 1 wt% sodium alginate (Alg1-PNIPAAm). For each of these series, the oxidation\nprocedure was repeated up to three times. The resulting gels were designated as AlgPNIPAAm (1c) and Alg-PNIPAAm (3c) where the numbers in brackets denote the\nnumber of oxidation cycles (see Table I).\nRepresentative TEM images taken on dried ferrogels with different alginate\ncontent (0.5 and 1 wt%) subjected to one oxidation cycle indicate that the iron oxide\nNPs size is independent from the alginate concentration being around 10 nm for both\nsamples (figure 1). A recent study indicated that the particle size slightly increased with\nthe application of repeating oxidation cycles20.\nA similar procedure was carried out for the preparation of chitosan ferrogels\n(Series III)21. Briefly, an aqueous solution of iron ions (0.21g of FeCl2* 4H2O and 0.58\ng of FeCl3* 6H2O) was added under vigorous stirring to a chitosan solution (4 wt%) in a\nN2 atmosphere to obtain a final chitosan concentration of 2 wt %. The solution was cast\non a teflon mould and carefully immersed in a 1 M sodium hydroxide solution in a N2\natmosphere. The immersion time in NaOH was 30 minutes and 60 minutes, and the\n\n5\n\n\fresulting gels were designated as Chit2_30min and Chit2_60min, respectively. TEM\nimages reported elsewhere21 showed a good dispersion of spherical iron oxide\nnanoparticles with an average size of 10 nm for 2 wt% chitosan ferrogels.\nThe mass of iron oxide nanoparticles in the ferrogels (WNPs) was obtained from\nthermogravimetric analysis of dried ferrogels\n\n19, 21\n\n. The total water content, Wt, was\n\ncalculated from the weight of the hydrated gels (Ms) and the weight of the dried gels\n(Mdry) as:\n(1)\n\nWt = Ms- Mdry / Mdry- MNPs\nThe data corresponding to WNPs and Wt are reported in table I.\n2.2. Magnetic characterization\n\nMagnetic measurements as a function of temperature and field of the ferrogels\nwere performed in a commercial SQUID magnetometer (MPMS-XL Quantum Design).\nZero-field-cooled (ZFC) and field-cooled (FC) curves were measured between 5 K and\n300 K. Data were obtained by first cooling the sample from room temperature in zero\napplied field (ZFC process) to the base temperature. Then a magnetic field of HFC = 100\nOe was then applied and the magnetization was measured with increasing temperature\nup to T = 300 K. After the last point was measured, the sample was cooled again to the\nbase temperature keeping the same field (FC process).\n\nMagnetization versus\n\ntemperature data were then measured over increasing temperatures. Hysteresis loops\nwere measured at 5 K and 300 K for applied fields – 5 T < H < 5 T.\n2.3. Remote heating on an alternating magnetic field\nSpecific power absorption (SPA) measurements were done using a home made\nac applicator working at 260 kHz and field amplitudes from up to 16 mT, and equipped\nwith an adiabatic sample space (~0.5 ml) for measurements in liquid phase.\n\n6\n\n\fTemperature data was taken using a fiber optic temperature probe (ReflexTM, Neoptix)\nimmune to rf environments.\n2.4. Raman spectroscopy\nRaman spectra were collected using a Renishaw InVia reflex Raman\nmicroscope. The Raman scattering was excited with a 785 nm near-infrared diode laser.\nA 100×, NA90 objective lens was used, giving a laser spot diameter of ~1 μm and the\nsampling depth is estimated to be around 1.5 μm (half-width of the confocal depth\nprofile for a silicon wafer). In order to avoid thermal decomposition/degradation of the\nsamples, laser intensity at the sample was reduced to 0.5-1%. Spectra were obtained for\na 20-s exposure of the CCD detector in the region 100–1800 cm−1 using the extended\nscanning mode of the instrument and the number of data acquisition cycles that make up\nthe measurement was 2. Raman point maps were acquired using a 100× objective,\ncollecting spectra with 10-20 s exposure time and subsequently moving the sample in a\nraster pattern with a step size of at least 10 μm. The laser intensity at the sample was\nreduced to 0.5% to avoid burning the sample. Data acquisition covered the spectral\nrange 1800–100 cm−1 with a spectral resolution of 4 cm−1 with each exposure of the\nCCD detector. Raman spectra were recorded and subsequently analysed by using Wire\nsoftware (Renishaw).\n\nRESULTS AND DISCUSSION\n1. Molecular structure of iron oxide NPs\nAs it is well known, wide angle X ray diffractograms corresponding to magnetite and\nmaghemite are almost identical and therefore this technique does not allow a detailed\ncharacterization of the molecular structure of iron oxide NPs synthesized inside\nsemiIPN of alginate and PNiPAAm22. That is the reason why we employed Confocal\n\n7\n\n\fRaman spectroscopy to determine the molecular structure of iron oxide NPs which will\nhave a great influence on the magnetization properties of the composite ferrogel as we\nwill show later on.\nRepresentative spectra corresponding to series II (1 wt% alginate) are shown in Figure\n2. The Raman spectrum corresponding to the sample without iron oxide NPs (Alg1PNiPAAm) is also shown for comparison. The low frequency region (300-800 cm-1)\ncontains the most characteristic Raman bands of iron oxides. The presence of iron oxide\nNPs in the samples subjected to 1 and 3 oxidation cycles, Alg1-PNIPAAm (1c) and\nAlg1-PNIPAAm (3c) respectively, is revealed by the appearance of two new peaks at\n500 cm-1 and 700 cm-1. The most intense band located at 700 cm-1 can be deconvoluted\ninto two peaks centered at 670 cm-1 and 720 cm-1 assigned to magnetite and maghemite\nrespectively. The bands detected at 500 and 670 cm-1 can be assigned to maghemite, γFe2O3 whereas the presence of the third band at 720 cm-1 is attributed to magnetite 23, 24.\nFor the sample subjected to 3 oxidation cycles, Alg1-PNiPAAm (3c), the most\nrepresentative Raman bands of iron oxide NPs, underwent a nearly four-fold increase in\nintensity with respect to the sample subjected to 1 oxidation cycle, Alg1-PNiPAAm\n(1c). The significant presence, in all the samples analyzed, of the 720 cm-1 and 670 cm-1\nbands is indicative of the simultaneous formation of magnetite and maghemite from the\noxidation step of the nanoparticle fabrication. These nanoparticles should be considered\nas composite magnetite and maghemite systems. The ratio of the intensity of the\n720/670 cm-1 bands provide a semi-quantitative estimation of the maghemite/magnetite\ncontent in the sample under study. The ratio I720/I670 changes from 1.1 for samples\nsubjected to one oxidation cycle to 1.3 for samples subjected to 3 oxidation cycles.\nAlthough not shown here, a similar behaviour is observed in series I, where I720/I670\nchanges from 1.7 to 2.1 for samples subjected to one and three oxidation cycles\n\n8\n\n\frespectively. This suggests an increase in the maghemite content of nanoparticles as a\nfunction of the oxidizing cycles. Presumably the oxidation takes place at the surface of\nthe nanoparticle progressing towards the center and originating, in this case, NPs with\nlarge magnetocrystalline anisotropy25, 26.\nThe Raman spectra of series III (chitosan) are shown in Figure 3. The spectrum\ncorresponding to the sample without iron oxide NPs is also shown for comparison being\ncomprised of broad bands, involving mainly ν(C-O) and ν(C-C) stretching. In this case\nthe presence of iron oxide nanoparticles is assessed by the appearance of one peak at\n310 cm-1, and a broad band at 705 cm-1. Following the same procedure as in the case of\nseries I and II the band detected at 705 cm-1 can be deconvoluted into two peaks\ncentered at ~670 cm-1 and ~720 cm-1 which are assigned to magnetite and maghemite\nrespectively. In addition to these bands, the presence of a third band at 310 cm-1 should\nbe attributable to maghemite. However, in this series the band observed in figure 3 at\n500 cm-1, associated to maghemite, it is not observed because is totally overlapped with\nsome characteristic bands and shoulders from pure chitosan.\nIn series III the ratio I720/I670 changes from 0.9 for samples subjected to one\noxidation cycle to 1.1 for samples subjected to 3 oxidation cycles, which clearly\nindicates that the concentration of magnetite with respect to maghemite maintains\nalmost constant with the immersion time in alkaline solution.\nThese results demonstrate a strong influence of the method of preparation on the\nmaghemite/magnetite ratio. The application of a repeating number of oxidation cycles in\nAlg-PNiPAAm semiIPNs (series I and II) gives rise to the increase of the maghemite\ncontent. However, in chitosan ferrogels (series III) the maghemite/magnetite ratio does\nnot get affected by the increase in the immersion time in an alkaline solution. These\n\n9\n\n\fresults have an important influence on the heating of these samples when subjected to\nalternating magnetic fields as we will demonstrate later on.\nMagnetic properties\nThe magnetic parameters of the magnetic ferrogels were evaluated in relation to\ntheir efficiency as heating elements. As a general feature, magnetization measurements\nas a function of temperature (ZFC-FC) and hysteresis loops between T = 5 K and 300 K\nfor all samples showed a single-domain behavior of the constituent NPs, having\nblocking temperatures at about TB=100 K. Representative hysteresis curves for samples\nAlg0.5-PNiPAAm (1c) and Alg1-PNiPAAm (1c) are shown in (Figure 4). The\ncoercitivity values extracted from M(H) curves (see Table II) were found to be\nessentially zero at room temperature, in agreement with the blocking temperatures of TB\n≈ 70-160 K found in all samples. Therefore, at room temperature, the NPs that are\ninside the ferrogels are in the SPM state. At low temperatures, both the saturation\nmagnetization MS and the coercivity HC values obtained were comparable to previously\nreported data on similar magnetite (or maghemite) nanoparticles.27 Because of the\nsimilar size (and thus similar surface/core ratio) of the NPs in all ferrogels, the\ncontribution of surface disorder to the magnetic moment of the NPs are expected to be\nsimilar.\nMagnetization curves as a function of temperature taken in zero-field-cooling\nand field-cooling modes for all samples confirmed the SPM behavior at room\ntemperature with blocking temperatures ranging from 60 to 160 K (see Table II).\nRepresentative ZFC-FC curves for samples Alg0.5-PNiPAAm (1c) and Alg1PNiPAAm (1c) are shown in (Figure 5).\nThe observed differences in the values of TB obtained from M (T) data can be\nattributed to differences in the aggregation state in each sample, since the aggregation of\n\n10\n\n\fNPs is known to modify the contribution from dipolar interactions to the anisotropy\nenergy barrier, thus modifying the relaxation times of the nanoparticles 27, 28.\n\n3. Remote heating on the application of an alternating magnetic field\nWe studied the capability of the synthesized ferrogels to remotely trigger the\nrelease process by evaluating their heating performance when submitted to an\nalternating magnetic field. Specifically, we measured the SPA of the NPs synthesized\ninside the ferrogels through temperature vs time profiles. The heating efficiency of the\ncolloids was determined from the temperature increase (∆T) of a given mass of the\nconstituent nanoparticles (mNP) diluted in a mass of liquid carrier (mLIQ) during the time\ninterval (∆t) of the experiment. The expression for power absorption P per unit mass of\nthe magnetic material is given by:\n\nΠ=\n\nm c + mNP cNP\nP\n= LIQ LIQ\nmNP\nmNP\n\n ∆T \n\n\n ∆t \n\n(3)\n\nwhere cLIQ and cNP are the specific heat capacities of the liquid carrier and the\nnanoparticles, respectively. All experiments were done after a waiting time of 60-120 s\nwith the magnetic field off, to allow thermalization of the samples to room temperature.\nSince the time dependence of temperature T is not linear, the slope of the T(t) is also a\nfunction of time. This is usually due to heat losses of the experimental setup, and thus a\ncriterion is needed in order to extract reproducible information from experiments. We\nhave chosen the criterion of the maximum derivative for calculating our SPA values,\nsince this criterion has two main advantages: first, the maximum slope ∆T/∆t happens\nduring the first few second of the experiment, and therefore during this short time the\nheating process can be considered as adiabatic. Second, because it occurs during the\nfirst seconds after the magnetic field is turned on, the maximum slope is located at an\n\n11\n\n\fabsolute temperature close to room temperature, irrespective of the final SPA value.\nConsequently, all SPA values are estimated at nearly the same (room) temperatures.\nThe specific heat c of each sample was estimated from the heat capacity of each\ncomponent in the system (water=4.12, Fe3O4=0.94, chitosan= 1.19 and PNiPAAm=1.2\nJ/g*K).\nFigure 6a shows the results of detailed magnetic field effect on 2 wt% chitosan\nferrogels subjected to 30 min inmersion time in NaOH (Series III). As can be observed,\nthe initial temperature rise is fast (i.e., ≈10 oC/min) and it gradually decreases, although\nafter 20 min of magnetic field applications and at T ≈ 60 oC, temperature was still\nincreasing. This trend is also observed for Alg-PNiPAAm semi-IPNs (series I and II) as\nit can be observed in the representative plot corresponding to the sample Alg0.5PNiPAAm subjected to one oxidation cycle (figure 6b) for which after 20 min of\nmagnetic field application, the temperature reached is T ≈ 45 oC. It is important to note\nthat this temperature is well above the LCST reported for PNiPAAm in Alg-PNiPAAm\nsemi-IPNs and therefore a rapid deswelling of the samples is observed during the course\nof the experiment.\nTable 2 reports the SPA values (W/gsample) obtained for all the samples under study. For\neach series, the SPA value increases with the iron oxide content since the heat\ngeneration is proportional to the amount of magnetic material in each sample. It is\nworth noting that the SPA values obtained are comparable in all cases to other systems\nevaluated for magnetic hyperthermia, for example, the SPA reported for a poly (Nisopropylacrylamide) ferrogel (2 wt% Fe3O4) was 1.45 W/g30 .\nThe SPA values normalized to the iron oxide content show a different trend as it can be\nobserved in Figure 7. For Alg-PNiPAAm semi-IPNs (series I and II), SPA (W/gNPs)\ndecreases with the number of oxidation cycles and hence with the iron oxide content\n\n12\n\n\fbeing the SPA values corresponding to series II (1 wt% alginate) higher than the\ncorresponding to series I (0.5 wt% alginate). On the contrary, SPA values exhibited by\nchitosan ferrogels (series III) remain almost constant with the immersion time in\nalkaline solution being 228 and 211 W/gNPs for the samples subjected to 30 minutes and\n60 minutes immersion time in NaOH respectively.\nThe efficiency as heating agents of iron oxide NPs show a strong dependence of the\nSPA with the particle size, with maximum absorption of rf power within a definite value\n<d>max. For a given material, the most important parameter determining <d>max is the\neffective magnetic anisotropy of each material, as inferred from the Néel relaxation\nmodel in single domain particles31. Additionally, <d>max, depends on sample properties\nlike particle agglomeration and polydispersity. For magnetite, the Neel model predicts\nthat <d>max should be located around 25-30 nm 6.\nWe have previously demonstrated that the average size obtained for the NPs does not\nvary with the number of oxidation cycles, being around 10 nm for all the samples20, 21.\nTherefore, a feasible explanation for the differences in SPA regarding series I and II is\nthe combined effect of agglomeration and the different magneto crystalline anisotropies\nof maghemite and magnetite that, for the observed average size of NPs, should give\ndifferent contributions to the total SPA of the samples. The maghemite/magnetite ratio\nchanges from 1.1 to 1.3 in series II (1 wt% alginate) and from 1.7 to 2.1 in series I (0.5\nwt% alginate) when the number of oxidation cycles is increased from 1 to 3 as\ndetermined through Confocal Raman Spectroscopy. Hence the results suggest a lower\ncontribution of the maghemite crystalline form (the oxidized form from magnetite) to\nthe total SPA of the system.\n\n13\n\n\fConclusions\nIn conclusion, we have demonstrated that the maghemite/magnetite ratio in iron oxide\nNPs synthesized inside polysaccharide hydrogels through coprecipitation of iron\nchlorides in an alkaline solution increases with the number of oxidation cycles but it is\nindependent from the immersion time in the alkaline solution. This in turn influences\nthe heating response of the samples to alternating magnetic fields, which points to a\nlower contribution of the maghemite crystalline form (the oxidized form from\nmagnetite) to the total SPA of the system.\nIn addition, we have observed high-quality thermal response of the ferrogels\nsynthesized, attaining final temperatures well above the required for the volume phase\ntransition of the Poly(N-isopropylacrylamide) ferrogels, and within short application\ntimes (ca 10 min). This makes the present materials an excellent candidate for fast and\ncontrolled drug release by external magnetic fields. Experiments with hydrosoluble\nmodel drugs for quantifying the net amount of drug release, as well as cytotoxicity\neffects of these materials, are being performed as the necessary next step for\nbioapplications of these materials.\n\nREFERENCES\n1.\nHoare, T.; Santamaria, J.; Goya, G. F.; Irusta, S.; Lin, D.; Lau, S.; Padera, R.;\nLanger, R.; Kohane, D. S. Nano Letters 2009, 9, (10), 3651-3657.\n2.\nJordan, A.; Scholz, R.; Wust, P.; Fahling, H.; Felix, R. Journal of Magnetism\nand Magnetic Materials 1999, 201, (1-3), 413-419.\n3.\nMillan, A.; Palacio, F.; Falqui, A.; Snoeck, E.; Serin, V.; Bhattacharjee, A.;\nKsenofontov, V.; Gütlich, P.; Gilbert, I. Acta Materialia 2007, 55, (6), 2201-2209.\n4.\nRosensweig, R. E. Journal of Magnetism and Magnetic Materials 2002, 252, (13), 370-374.\n5.\nSawyer, C. A.; Habib, A. H.; Miller, K.; Collier, K. N.; Ondeck, C. L.;\nMcHenry, M. E. In Modeling of temperature profile during magnetic thermotherapy for\ncancer treatment, 53rd Annual Conference on Magnetism and Magnetic Materials,\nAustin, TX, Nov 11-14, 2008; Amer Inst Physics: Austin, TX, 2008.\n\n14\n\n\f6.\nGonzalez-Fernandez, M. A.; Torres, T. E.; Andrés-Vergés, M.; Costo, R.; de la\nPresa, P.; Serna, C. J.; Morales, M. P.; Marquina, C.; Ibarra, M. R.; Goya, G. F. Journal\nof Solid State Chemistry 2009, 182, (10), 2779-2784.\n7.\nWeigel, T.; Mohr, R.; Lendlein, A. Smart Materials & Structures 2009, 18, (2).\n8.\nLiu, T. Y.; Liu, K. H.; Liu, D. M.; Chen, S. Y.; Chen, I. W. Advanced\nFunctional Materials 2009, 19, (4), 616-623.\n9.\nRijcken, C. J.; Snel, C. J.; Schiffelers, R. M.; van Nostrum, C. F.; Hennink, W.\nE. Biomaterials 2007, 28, (36), 5581-5593.\n10.\nGoya, G. F.; Grazu, V.; Ibarra, M. R. Current Nanoscience 2008, 4, (1), 1-16.\n11.\nDay, E. S.; Morton, J. G.; West, J. L. Journal of Biomechanical EngineeringTransactions of the Asme 2009, 131, (7).\n12.\nMeyer, D. E.; Shin, B. C.; Kong, G. A.; Dewhirst, M. W.; Chilkoti, A. Journal\nof Controlled Release 2001, 74, (1-3), 213-224.\n13.\nBrazel, C. Pharmaceutical Research 2009.\n14.\nLiu, T.-Y.; Hu, S.-H.; Liu, D.-M.; Chen, S.-Y.; Chen, I. W. Nano Today 2009, 4,\n(1), 52-65.\n15.\nEcheverria, C.; Mijangos, C. Macromolecular Rapid Communications 31, (1),\n54-58.\n16.\nSchild, H. G. Progress in Polymer Science 1992, 17, (2), 163-249.\n17.\nBell, C.; Peppas, N., Biomedical membranes from hydrogels and interpolymer\ncomplexes. In Biopolymers II, 1995; pp 125-175.\n18.\nSatarkar, N. S.; Hilt, J. Z. Journal of Controlled Release 2008, 130, (3), 246251.\n19.\nHernández, R.; Mijangos, C. Macromol. Rapid Commun. 2009, 30, (3), 176-181.\n20.\nHernandez, R.; Sacristan, J.; Nogales, A.; Ezquerra, T. A.; Mijangos, C.\nLangmuir 2009, 25, (22), 13212-13218.\n21.\nHernández, R.; Zamora-Mora, V.; Sibaja-Ballestero, M.; Vega-Baudrit, J.;\nLópez, D.; Mijangos, C. Journal of Colloid and Interface Science 2009, 339, (1), 53-59.\n22.\nCornell, R. M.; Schwertmann, U., The Iron Oxides. Structure, properties,\nreactions, occurences and uses. Wiley-VCH: 2003; p 32.\n23.\nHerve, K.; Douziech-Eyrolles, L.; Munnier, E.; Cohen-Jonathan, S.; Souce, M.;\nMarchais, H.; Limelette, P.; Warmont, F.; Saboungi, M. L.; Dubois, P.; Chourpa, I.\nNanotechnology 2008, (46), 465608.\n24.\nHu, S.-H.; Liu, T.-Y.; Liu, D.-M.; Chen, S.-Y. J. Controlled Release 2007, 121,\n(3), 181-189.\n25.\nOdziemkowski, M. S.; Schuhmacher, T. T.; Gillham, R. W.; Reardon, E. J.\nCorrosion Science 1998, 40, 371-389.\n26.\nRitter, K.; Odziemkowski, M. S.; Simpgraga, R.; Gillham, R. W.; Irish, D. E.\nJournal of Contaminant Hydrology 2003, 65, 121-136.\n27.\nLima, E.; Brandl, A. L.; Arelaro, A. D.; Goya, G. F. Journal of Applied Physics\n2006, 99, (8).\n28.\nGoya, G. F.; Berquo, T. S.; Fonseca, F. C.; Morales, M. P. Journal of Applied\nPhysics 2003, 94, (5), 3520-3528.\n29.\nHernández, R.; Fernández, M.; Sacristán, J.; Nogales, A.; Ezquerra, T. A.;\nMijangos, C. in preparation.\n30.\nAng, K. L.; Venkatraman, S.; Ramanujan, R. V. Materials Science and\nEngineering: C\nNext Generation Biomaterials 2007, 27, (3), 347-351.\n31.\nGoya, G. F.; Lima, E.; Arelaro, A. D.; Torres, T.; Rechenberg, H. R.; Rossi, L.;\nMarquina, C.; Ibarra, M. R. IEEE Trans. Magn. 2008, 44, (11), 4444-4447.\n\n15\n\n\fTable I: Composition of the samples\n\nSERIES\n\nSAMPLE\n\nWtH2O (%) WtNPs *(%)\n\nAlg0.5-PNiPAAm(1c)\n\n94.9\n\n15.7\n\nAlg0.5-PNiPAAm(3c)\n\n91.6\n\n30.3\n\nAlg1-PNiPAAm(1c)\n\n92.3\n\n7.3\n\nAlg1-PNiPAAm(3c)\n\n90.5\n\n17.5\n\nChit2_30min\n\n95.7\n\n13.8\n\nChit2_60min\n\n95.1\n\n14.2\n\nI\n\nII\n\nIII\n\n* Referred to the dried ferrogel\n\n16\n\n\fTable II: Magnetic parameters of the samples under study\n\nSERIES\n\nI\n\nSAMPLE\n\nTB\n\nMs (emu/gFe3O4)\n\nHc (Oe)\n\n295 K\n\n5K\n\n295 K\n\n5K\n\nAlg0.5-PNiPAAm(1c) 157(2)\n\n86\n\n90\n\n5(5)\n\n255(5)\n\nAlg0.5-PNiPAAm(3c) 107(2)\n\n82\n\n90\n\n8(5)\n\n190(5)\n\nAlg1-PNiPAAm(1c)\n\n148(2)\n\n89\n\n92\n\n7(5)\n\n230(5)\n\nAlg1-PNiPAAm(3c)\n\n157(2)\n\n85\n\n87\n\n8(5)\n\n168(5)\n\nChit2_30min\n\n134(3)\n\n88\n\n90\n\n4(4)\n\n195(3)\n\nChit2_60min\n\n135(2)\n\n86\n\n89\n\n5(5)\n\n189(3)\n\nII\n\nIII\n\n17\n\n\fTable III. SPA of the samples under study\n\nwt %\nSERIES\n\nSPA\n\nSPA\n\nSAMPLE\nFe3O4 (W/g) (W/gFe3O4)\nAlg0.5-PNiPAAm(1c)\n\n15.7\n\n1.78\n\n236\n\nAlg0.5-PNiPAAm(3c)\n\n30.3\n\n2.39\n\n96\n\nAlg1-PNiPAAm(1c)\n\n7.3\n\n1.48\n\n298\n\nAlg1-PNiPAAm(3c)\n\n17.5\n\n1.91\n\n119\n\nChit2_30min\n\n13.8\n\n1.35\n\n228\n\nChit2_60min\n\n14.2\n\n1.47\n\n211\n\nI\n\nII\n\nIII\n\n18\n\n\fFigure captions\nFigure 1. Representative TEM images of iron oxide nanoparticles synthesized in AlgPNiPAAm semi-IPNs subjected to one oxidation cycle (a) Alg 0.5-PNiPAAm and (b)\nAlg1-PNiPAAm (Scale bar=200 nm). The inset in both figures shows iron oxide NPs at\na higher magnification (Scale bar=10 nm).\nFigure 2. Comparison of micro-Raman spectra of a) Alg1-PNiPAAm, and Alg1PNiPAAm subjected to one oxidation cycle (b) and three oxidation cycles (c). Dashed\ngreen lines correspond to iron oxide Raman spectra bands fitted with Lorentzian\nprofiles.\nFigure 3. Comparison of micro-Raman spectra of a) raw Chitosan and chitosan\nferrogels (2 wt%) subjected to (b) 30 min immersion time in NaOH and (c) 60 min\nimmersion time in NaOH.\nFigure 4. Zero-field-cooled (ZFC) and field-cooled (FC) curves for (a) Alg0.5PNiPAAm (1c) and (b) Alg1-PNiPAAm (3c)\nFigure 5. Magnetization hysteresis curves measured at (■) 10 K and (○) 295 K for (a)\nAlg0.5-PNiPAAm (1c) and (b) Alg1-PNiPAAm (1c). Inset: enlargement of the lowfield region showing the different coercive fields for the NPa at 10K and 295 K.\nFigure 6. Temperature increase of (a) chitosan ferrogels (2 wt%) subjected to 30 min\nimmersion time in NaOH and (b) Alg0.5-PNiPAAm subjected to 1 oxidation cycle\nFigure 7. Specific power absorption of iron oxide NPs synthesized inside AlgPNiPAAm ferrogels (series I and II) and chitosan ferrogels (series III).\n\n19\n\n\fFIGURE 1\n\nFIGURE 2\n\n20\n\n\f21\n\n\fFIGURE 3\n\nFIGURE 4.\n22\n\n\f(a)\n\n0,3\n\nM (emu/g)\n\n0,2\n\n0,1\n0,4\n\n(b)\n0,3\n0,2\n0,1\n0\n\n20\n\n40\n\n60\n\n80 100 120 140 160 180 200 220 240 260\n\nT (K)\n\n23\n\n\fFIGURE 5.\n\n120\n\n(a)\n\n100\n80\n60\n\nM(emu/gNPs)\n\n40\n20\n0\n-20\n\n120\n100\n80\n\n-40\n\n60\n\nM(emu/gNPs)\n\n40\n\n-60\n-80\n\n20\n0\n-20\n-40\n-60\n-80\n-100\n\n-100\n\n-120\n-0,3\n\n-0,2\n\n-0,1\n\n0,0\n\n0,1\n\n0,2\n\n0,3\n\nField (Teslas)\n\n-120\n-5\n\n-4\n\n-3\n\n-2\n\n-1\n\n0\n\n1\n\n2\n\n3\n\n4\n\n5\n\nField (Teslas)\n120\n\n(b)\n\n100\n80\n60\n\n20\n0\n-20\n\n120\n90\n\n-40\n\n60\n30\n\nM(emu/gNPs)\n\nM(emu/gNPs)\n\n40\n\n-60\n-80\n\n0\n-30\n-60\n-90\n\n-100\n\n-120\n-0,3\n\n-0,2\n\n-0,1\n\n0,0\n\n0,1\n\n0,2\n\n0,3\n\nField (Teslas)\n\n-120\n-5\n\n-4\n\n-3\n\n-2\n\n-1\n\n0\n\n1\n\n2\n\n3\n\n4\n\n5\n\nField (Teslas)\n\n24\n\n\fTemperature0C)\n(\n\nFIGURE 6\n\n65\n60\n55\n50\n45\n40\n35\n30\n\n(a)\n\n45\n\n(b)\n\n40\n35\n30\n25\n0\n\n100 200 300 400 500 600 700 800 900 1000 1100 1200\n\nTime (s)\n\n25\n\n\f1c\n\nFIGURE 7\n\nin\nm\n\n200\n\n3c\n\n150\n\n3c\n\nSPA (W/g)\n\n60\n\n30\n\nm\n\n1c\n\n250\n\nin\n\n300\n\n100\n\n50\n\n0\n\nAlg0.5-PNiPAAm3 Alg1-PNiPAAm3\n\nChitosan\n\n26\n\n\f"}