{"id": "http://arxiv.org/abs/0801.3243v1", "guidislink": true, "updated": "2008-01-21T18:09:25Z", "updated_parsed": [2008, 1, 21, 18, 9, 25, 0, 21, 0], "published": "2008-01-21T18:09:25Z", "published_parsed": [2008, 1, 21, 18, 9, 25, 0, 21, 0], "title": "Particle identification with the AMS-02 RICH detector: D/p and\n  anti-D/anti-p separation", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0904.2791%2C0904.3961%2C0904.0260%2C0904.1874%2C0904.2259%2C0904.2459%2C0904.2682%2C0904.0214%2C0904.3065%2C0904.3640%2C0904.1928%2C0904.2843%2C0904.0996%2C0904.1780%2C0904.1348%2C0904.4189%2C0904.1312%2C0904.1774%2C0904.0970%2C0904.2488%2C0904.2653%2C0904.3336%2C0904.1779%2C0904.2668%2C0904.1332%2C0904.4343%2C0904.3566%2C0904.4096%2C0904.4756%2C0801.3702%2C0801.0768%2C0801.4550%2C0801.2849%2C0801.2013%2C0801.2426%2C0801.0952%2C0801.4682%2C0801.1496%2C0801.4532%2C0801.3551%2C0801.0007%2C0801.0732%2C0801.4385%2C0801.2255%2C0801.0607%2C0801.3693%2C0801.3369%2C0801.1964%2C0801.1007%2C0801.1148%2C0801.0797%2C0801.3000%2C0801.0431%2C0801.3107%2C0801.2340%2C0801.2964%2C0801.0144%2C0801.0352%2C0801.4891%2C0801.3356%2C0801.2117%2C0801.4346%2C0801.3577%2C0801.2911%2C0801.4269%2C0801.3474%2C0801.4917%2C0801.4748%2C0801.1631%2C0801.0348%2C0801.0252%2C0801.3717%2C0801.2500%2C0801.1979%2C0801.4366%2C0801.3846%2C0801.3131%2C0801.2026%2C0801.2100%2C0801.4397%2C0801.1083%2C0801.0419%2C0801.3243%2C0801.4865%2C0801.3547%2C0801.2892%2C0801.2006%2C0801.3396%2C0801.3514%2C0801.0304%2C0801.2293%2C0801.1439%2C0801.0437%2C0801.1920%2C0801.1084%2C0801.1356%2C0801.4021%2C0801.1005%2C0801.0762%2C0801.1944%2C0801.2537&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Particle identification with the AMS-02 RICH detector: D/p and\n  anti-D/anti-p separation"}, "summary": "The Alpha Magnetic Spectrometer (AMS), whose final version AMS-02 is to be\ninstalled on the International Space Station (ISS) for at least 3 years, is a\ndetector designed to measure charged cosmic ray spectra with energies up to the\nTeV region and with high energy photon detection capability up to a few hundred\nGeV, using state-of-the art particle identification techniques. Among several\ndetector subsystems, AMS includes a proximity focusing RICH enabling precise\nmeasurements of particle electric charge and velocity. The combination of both\nthese measurements together with the particle rigidity measured on the silicon\ntracker endows a reliable measurement of the particle mass. The main topics of\nthe AMS-02 physics program include detailed measurements of the nuclear\ncomponent of the cosmic-ray spectrum and the search for indirect signatures of\ndark matter. Mass separation of singly charged particles, and in particular the\nseparation of deuterons and antideuterons from massive backgrounds of protons\nand antiprotons respectively, is essential in this context. Detailed Monte\nCarlo simulations of AMS-02 have been used to evaluate the detector's\nperformance for mass separation at different energies. The obtained results and\nphysics prospects are presented.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0904.2791%2C0904.3961%2C0904.0260%2C0904.1874%2C0904.2259%2C0904.2459%2C0904.2682%2C0904.0214%2C0904.3065%2C0904.3640%2C0904.1928%2C0904.2843%2C0904.0996%2C0904.1780%2C0904.1348%2C0904.4189%2C0904.1312%2C0904.1774%2C0904.0970%2C0904.2488%2C0904.2653%2C0904.3336%2C0904.1779%2C0904.2668%2C0904.1332%2C0904.4343%2C0904.3566%2C0904.4096%2C0904.4756%2C0801.3702%2C0801.0768%2C0801.4550%2C0801.2849%2C0801.2013%2C0801.2426%2C0801.0952%2C0801.4682%2C0801.1496%2C0801.4532%2C0801.3551%2C0801.0007%2C0801.0732%2C0801.4385%2C0801.2255%2C0801.0607%2C0801.3693%2C0801.3369%2C0801.1964%2C0801.1007%2C0801.1148%2C0801.0797%2C0801.3000%2C0801.0431%2C0801.3107%2C0801.2340%2C0801.2964%2C0801.0144%2C0801.0352%2C0801.4891%2C0801.3356%2C0801.2117%2C0801.4346%2C0801.3577%2C0801.2911%2C0801.4269%2C0801.3474%2C0801.4917%2C0801.4748%2C0801.1631%2C0801.0348%2C0801.0252%2C0801.3717%2C0801.2500%2C0801.1979%2C0801.4366%2C0801.3846%2C0801.3131%2C0801.2026%2C0801.2100%2C0801.4397%2C0801.1083%2C0801.0419%2C0801.3243%2C0801.4865%2C0801.3547%2C0801.2892%2C0801.2006%2C0801.3396%2C0801.3514%2C0801.0304%2C0801.2293%2C0801.1439%2C0801.0437%2C0801.1920%2C0801.1084%2C0801.1356%2C0801.4021%2C0801.1005%2C0801.0762%2C0801.1944%2C0801.2537&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "The Alpha Magnetic Spectrometer (AMS), whose final version AMS-02 is to be\ninstalled on the International Space Station (ISS) for at least 3 years, is a\ndetector designed to measure charged cosmic ray spectra with energies up to the\nTeV region and with high energy photon detection capability up to a few hundred\nGeV, using state-of-the art particle identification techniques. Among several\ndetector subsystems, AMS includes a proximity focusing RICH enabling precise\nmeasurements of particle electric charge and velocity. The combination of both\nthese measurements together with the particle rigidity measured on the silicon\ntracker endows a reliable measurement of the particle mass. The main topics of\nthe AMS-02 physics program include detailed measurements of the nuclear\ncomponent of the cosmic-ray spectrum and the search for indirect signatures of\ndark matter. Mass separation of singly charged particles, and in particular the\nseparation of deuterons and antideuterons from massive backgrounds of protons\nand antiprotons respectively, is essential in this context. Detailed Monte\nCarlo simulations of AMS-02 have been used to evaluate the detector's\nperformance for mass separation at different energies. The obtained results and\nphysics prospects are presented."}, "authors": ["Luísa Arruda", "Fernando Barão", "Rui Pereira"], "author_detail": {"name": "Rui Pereira"}, "author": "Rui Pereira", "arxiv_comment": "5 pages. Contribution to the Sixth International Workshop on New\n  Worlds in Astroparticle Physics (Faro 2007). Presenter: Rui Pereira", "links": [{"href": "http://arxiv.org/abs/0801.3243v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0801.3243v1", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0801.3243v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0801.3243v1", "journal_reference": null, "doi": null, "fulltext": "Particle identification with the AMS-02 RICH\ndetector: D /p and D̄/p̄ separation\nLuı́sa Arruda, Fernando Barão, Rui Pereira\n\narXiv:0801.3243v1 [astro-ph] 21 Jan 2008\n\nLIP/IST\nAv. Elias Garcia, 14, 1o andar\n1000-149 Lisboa, Portugal\ne-mail: pereira@lip.pt\n\nAbstract- The Alpha Magnetic Spectrometer (AMS), whose\nfinal version AMS-02 is to be installed on the International\nSpace Station (ISS) for at least 3 years, is a detector designed to\nmeasure charged cosmic ray spectra with energies up to the TeV\nregion and with high energy photon detection capability up to\na few hundred GeV, using state-of-the art particle identification\ntechniques.\nAmong several detector subsystems, AMS includes a proximity\nfocusing RICH enabling precise measurements of particle electric\ncharge and velocity. The combination of both these measurements\ntogether with the particle rigidity measured on the silicon tracker\nendows a reliable measurement of the particle mass.\nThe main topics of the AMS-02 physics program include\ndetailed measurements of the nuclear component of the cosmicray spectrum and the search for indirect signatures of dark\nmatter. Mass separation of singly charged particles, and in\nparticular the separation of deuterons and antideuterons from\nmassive backgrounds of protons and antiprotons respectively, is\nessential in this context. Detailed Monte Carlo simulations of\nAMS-02 have been used to evaluate the detector's performance\nfor mass separation at different energies. The obtained results\nand physics prospects are presented.\n\nI. T HE AMS-02\n\nEXPERIMENT\n\nThe Alpha Magnetic Spectrometer (AMS)[1], whose final\nversion AMS-02 is to be installed on the International Space\nStation (ISS) for at least 3 years, is a detector designed to study\nthe cosmic ray flux by direct detection of particles above the\nEarth's atmosphere using state-of-the-art particle identification\ntechniques. AMS-02 is equipped with a superconducting magnet cooled by superfluid helium. The spectrometer is composed of several subdetectors: a Transition Radiation Detector\n(TRD), a Time-of-Flight (TOF) detector, a Silicon Tracker,\nAnticoincidence Counters (ACC), a Ring Imaging Čerenkov\n(RICH) detector and an Electromagnetic Calorimeter (ECAL).\nFig. 1 shows a schematic view of the full AMS-02 detector. A\npreliminary version of the detector, AMS-01, was successfully\nflown aboard the US space shuttle Discovery in June 1998[2].\nThe main goals of the AMS-02 experiment are:\n• A precise measurement of charged cosmic ray spectra\nin the rigidity region between ∼ 0.5 GV and ∼ 2 TV,\nand the detection of photons with energies up to a few\nhundred GeV;\n• A search for heavy antinuclei (Z ≥ 2), which if discovered would signal the existence of cosmological antimatter;\n\nFig. 1.\n\nExploded view of the AMS-02 detector.\n\nA search for dark matter constituents by examining\npossible signatures of their presence in the cosmic ray\nspectrum.\nThe long exposure time and large acceptance (0.5 m2 *sr) of\nAMS-02 will enable it to collect an unprecedented statistics\nof more than 1010 nuclei.\n•\n\nII. T HE AMS RICH\n\nDETECTOR\n\nOne of the subdetectors in AMS-02 is a proximity focusing\nRing Imaging Čerenkov (RICH) detector. It is composed of\n\n\fa dual radiator with silica aerogel (n = 1.050) and sodium\nfluoride (n = 1.334), a high reflectivity lateral conical mirror\nand a detection matrix with 680 photomultipliers coupled to\nlight guides.\nRun\n\n1456 Event\n\n702\n\nFig. 3.\nLIP.\n\nFig. 2.\n\nA simulated proton event as seen in the AMS-02 display.\n\nThe RICH detector will provide a very accurate velocity\nmeasurement (in aerogel, ∆β/β ∼ 10−3 and 10−4 for Z = 1\nand Z = 10 − 20, respectively) and charge identification of\nnuclei up to iron (Z = 26).\nRICH data, combined with information on particle rigidity\nfrom the AMS Silicon Tracker, enable the reconstruction of\nparticle mass. A typical RICH event is shown in Figs. 2 and\n3, where the latter gives a detailed view of the readout matrix.\nThe accuracy of the RICH velocity measurement is essential\ndue to the growth of relative errors when v → c:\n∆m\n∆p\n∆β\n=\n⊕ γ2\nm\np\nβ\nThe assembly of the AMS RICH detector is currently\nunderway at CIEMAT in Madrid. The integration of the RICH\nand the other subdetectors of AMS-02 will take place at CERN\nin 2007.\nThe analysis of RICH data involves the identification of the\nČerenkov ring in a hit pattern which usually includes several\nscattered noise hits and an eventual strong spot in the region\nwhere the charged particle crosses the detection plane. Two\nindependent algorithms for velocity and charge reconstruction\nhave been developed in the AMS collaboration for the analysis\nof RICH events: a geometrical method based on a hit-by-hit\nreconstruction[3], and a method using all the hits with the\nmaximization of a likelihood function[4]).\nA prototype of the RICH detector, consisting of 96 photomultiplier units, was tested both with cosmic ray particles and\nwith beam ions at the CERN SPS in 2002 and 2003. A piece of\n\nThe same event of Fig. 2 as seen in the RICH display developed at\n\nthe conical reflector was included in the beam test setup[5].\nThe algorithms for velocity and charge reconstruction were\nsuccessfully applied to data from these prototype tests[6].\nIII. C OMPONENTS\n\nOF THE COSMIC RAY SPECTRUM\n\nProtons are the most abundant component (∼ 90%) of\ncharged cosmic rays reaching the Earth's vicinity. The remaining fraction is essentially made of atomic nuclei (mostly 4 He)\nand single-charged particles such as e− , e+ and p̄.\nPrecise measurements of the smaller components in the\ncosmic ray spectrum are essential in the context of the study\nof cosmic-ray production and acceleration. The required precision can only be attained through very effective charge and\nmass discrimination methods since the abundances of different\ncomponents differ by several orders of magnitude.\nRatios such as D/p, 3 He/4 He and B/C give information on\nthe interstellar medium since all compare the abundances of\nsecondary and primary species. The beryllium isotope ratio\n10\nBe/9 Be is a probe for galactic confinement times since both\nisotopes are secondary but one of them, 10 Be, is unstable\n(t1/2 = 1.5 × 106 yr).\nThe lightest neutralino (χ̃01 ), predicted by supersymmetric\nmodels, is a strong dark matter candidate. If it exists and\naccounts for the known dark matter density (ΩCDM ≃ Ωm −\nΩb ≃ 0.2) or at least for a significant part of it, neutralino\nannihilation (χ̃01 χ̃01 → ...) must take place and contribute to\nthe observed cosmic ray composition, with the more visible\neffects occurring in the spectra of antiparticles like e+ , p̄\nand especially D̄[7]. Fig. 4 shows a comparison between the\nexpected D̄ fluxes from secondary production and from dark\nmatter annihilation.\n\n\f10\n\n10-1\n\n10-3\n\n10-5\n10-6 -1\n10\n\nFig. 5.\n\nIDENTIFICATION\n\nTo evaluate the capabilities of AMS-02 for mass separation\nof deuterons and antideuterons from other particles with the\nsame charge, studies have been performed using the case of\ndeuteron vs. proton separation. In the past, studies on the\nseparation of helium (Z = 2) and beryllium (Z = 4) isotopes\nhave also been performed using a standalone simulation of the\nRICH detector[8]. In the present case the large difference between proton and deuteron abundances (D/p ∼ 1%) increases\nthe importance of a very effective mass separation to isolate\nthe deuteron signal from a large background of proton events.\nIn the study of D/p separation a full-scale simulation of the\nAMS detector was used. Particles were simulated as coming\nfrom the top plane of a cube, corresponding to an acceptance\nof 47.78 m2 *sr. Three data samples were chosen. Table I shows\nthe momentum ranges and number of events simulated in each\nsample.\nTABLE I\nS AMPLES USED IN THE D/p SEPARATION STUDIES\nSample\np (low momentum)\np (high momentum)\nD\n\nMomentum range\n0.5 − 10 GeV/c\n10 − 200 GeV/c\n0.5 − 20 GeV/c\n\nNo. events\n3.1 × 108\n1.3 × 108\n5.6 × 107\n\ndN\nFor each sample, d(ln\np) = constant. Variable weights were\nassigned to events in order to compensate for the statistics in\neach sample and to reproduce a realistic spectrum (Fig. 5):\n• The\nsimulated\nproton\nspectrum\nfollowed\ndN/dE ∝ E −2.7 ;\n\n1\n\n10\n\n102\nKinetic energy (GeV/nucleon)\n\nSimulated proton and deuteron spectra used in this work.\n\nThe simulated deuteron spectrum was calculated combining the proton spectrum above with D/p ratios taken from\nRef. [9].\nIn each event a set of preliminary data selection cuts using\nreadings from different subdetectors of AMS-02 was applied\nto reduce the fraction of events with a bad reconstruction. Only\ndowngoing events (β > 0) were accepted. In addition, events\nwere accepted if the following conditions were satisfied:\n• Only one particle was detected in the event;\n• A particle track was reconstructed by the Silicon Tracker;\n• No clusters were found in the Anti-Coincidence Counters;\n• Clusters from at least 3 TOF planes (out of 4) were used\nfor event reconstruction;\n• At most one additional cluster was allowed in the TOF;\n• At least 6 Tracker layers (out of 8) were used in the track\nreconstruction;\n• Compatibility was required for the rigidity measurements obtained from two different algorithms, with\n∆R/R < 3%;\n• Compatibility was also required for the rigidity measurements obtained from each half of the Tracker (upper and\nlower), with ∆R/R < 50%;\n• The particle's impact point on the RICH radiator was less\nthan 58 cm from the centre (i. e. more than 2 cm from\nthe mirror);\n• At most one track was present in the TRD;\n• The TOF and Tracker charge reconstructions were compatible.\nAmong the events that triggered the detector, a fraction\ncorresponding to ∼ 15-20% of proton events and ∼ 10-15%\nof deuteron events in the relevant region of kinetic energy (few\nGeV/nucleon) passed this set of preliminary cuts, corresponding to an acceptance of ∼ 0.3 m2 *sr for protons and ∼ 0.2\nm2 *sr for deuterons.\nThe reconstruction of particle masses was then performed\nfor events having a signal in the RICH detector. The extremely accurate velocity measurement provided by the RICH\n(∆β/β ∼ 10−3 in the case of protons and deuterons) is crucial\nto reduce the background level. A series of event selection cuts\nwere introduced, based on data provided by the RICH and the\n•\n\nIV. PARTICLE\n\naerogel threshold\n\n10-2\n\n10-4\n\nFig. 4.\nComparison between expected antideuteron flux from secondary\nprocesses (dashed line) and the flux from the annihilation of a 60 GeV dark\nmatter particle (solid lines: solar minimum; dotted lines: interstellar flux).\nFluxes from dark matter annihilation are shown for three sets of propagation\nparameters. (from Ref. [7])\n\nprotons\ndeuterons\n\n1\n\nNaF threshold\n\nEvents / (GeV/nucleon) (a.u.)\n\nSimulated proton & deuteron spectra\n\n\fD/p ratio as function of Ekin/nuc (1 day)\n\nresults of the two reconstruction algorithms:\n\n0.025\nBefore RICH cuts\n\n104\n\nAfter RICH cuts\n\n0.02\n\n103\n10\n\n2\n\n10\n\n0.015\nD/p\n\nEvents (weighted sum)\n\nAerogel events, Ekin = 2.75-3.31 GeV/nucleon\n\n1\n10-1\n\n0.01\n\n10-2\n10-3 0\n\n0.2\n\n0.4\n\n0.6\n\n0.8\n\n1\n\n1.2\n\n1.4\n1.6\n1.8\n2\ninverse mass (1/GeV)\n\n0.005\n\nEvents (weighted sum)\n\nAerogel events, Ekin = 5.75-6.92 GeV/nucleon\nBefore RICH cuts\n\n104\n\nAfter RICH cuts\n\n0\n\n103\n\n1\n\n10\nEkin (GeV/nuc)\n\n102\n\nFig. 8.\n\nExpected sensitivity of AMS for D/p ratio with one day of data.\n\n10\n1\n\n•\n10-1\n\n•\n\n10-2\n10-3 0\n\n0.2\n\n0.4\n\n0.6\n\n0.8\n\n1\n\n1.2\n\n1.4\n1.6\n1.8\n2\ninverse mass (1/GeV)\n\nFig. 6. Examples of inverse mass distribution in aerogel events for two\nenergy regions.\n\n•\n\n•\n\nEvents (weighted sum)\n\nNaF events, Ekin = 1.32-1.58 GeV/nucleon\nBefore RICH cuts\n\n103\n\nAfter RICH cuts\n\n10\n\n•\n\n1\n\n10-1\n10-2\n10-3 0\n\n0.2\n\nFig. 7.\n\n•\n\n•\n\n•\n\n•\n\n102\n\n0.4\n\n0.6\n\n0.8\n\n1\n\n1.2\n\n1.4\n1.6\n1.8\n2\ninverse mass (1/GeV)\n\nExample of inverse mass distribution in NaF events.\n\nA Čerenkov ring was reconstructed using each method,\nand at least 3 hits were used in both cases;\nThe total ring signal was not higher than 10 photoelectrons in NaF events, and not higher than 15 photoelectrons in aerogel events;\nA Kolmogorov test to the uniformity of the hits azimuthal\ndistribution in the ring gave a result of at least 0.2 in the\ncase of NaF events, and 0.03 in the case of aerogel events;\n\nCompatibility was required for the velocity measurements\nfrom the TOF and RICH detectors, with ∆β/β < 10%;\nCompatibility was also required for the velocity measurements obtained from the two RICH reconstruction methods, with ∆β/β < 0.3% for NaF events, and\n∆β/β < 0.1% for aerogel events;\nThe reconstructed, rounded electric charge obtained from\nthe geometrical method was 1 or 2;\nThe reconstructed, non-rounded electric charge obtained\nfrom the likelihood method was between 0.5 and 1.5 in\nNaF events, and between 0.6 and 1.4 in aerogel events;\nThe ring acceptance (visible fraction), as estimated by the\nlikelihood method, was at least 20% in NaF events, and\nat least 40% in aerogel events;\nThe number of noisy hits not associated to the crossing\nof the charged particle (i. e., hits that were far from the\nreconstructed ring and far from the estimated crossing\npoint of the charged particle in the detection matrix) was\nnot higher than 2 in NaF events, and not higher than 3\nin aerogel events.\nV. A NALYSIS\n\nRESULTS\n\nResults show that mass separation of particles with Z = 1\nis feasible even if one species is orders of magnitude more\nabundant than the other. D/p separation is possible up to\nEkin ∼ 8 GeV/nucleon. Some examples of the mass distributions obtained are shown in Figs. 6 and 7. Solid lines show\nthe mass distributions before the RICH cuts were taken into\nconsideration.\nFig. 8 shows the expected sensitivity of AMS for the D/p\nratio after one day of data taking. Results show that a single\nday of AMS-02 statistics will be sufficient to improve on the\nexisting data for this ratio.\n\n\facceptance (m2 sr)\n\nProton acceptance\n\n1\n\n10-1\n\nACCEPTANCE\nLVL1 trigger\nall pre-cuts\nall RICH cuts\n\n10-2\n\n10-3\n10-1\n\n1\n\n10\nsimulated Ekin (GeV/nucleon)\n\n1\n\n10\nsimulated Ekin (GeV/nucleon)\n\nDeuteron acceptance\nacceptance (m2 sr)\n\nIn the optimal region immediately above the aerogel radiation threshold (Ekin < 5 GeV/nucleon) rejection factors\nhigher than 104 region were attained (Fig. 9). The best relative\nmass resolutions for protons (Fig. 10) and deuterons are\n∼ 2% for both radiators in the regions above their respective\nthresholds.\nAfter all cuts, an acceptance of ∼ 0.07 m2 *sr was obtained for protons, and ∼ 0.05 m2 *sr for deuterons at\nEkin > 3 GeV/nucleon (Fig. 11). The increase by a factor\n∼ 10 in the acceptance above the aerogel threshold reflects the\nrelative dimensions of the two radiators in the RICH detector.\nThe main background in the deuteron case comes from nongaussian tails of proton events with a bad velocity reconstruction. Errors in rigidity reconstruction (∆R/R ∼ 2% in the\nGeV region) are not critical for this case.\nThe specific set of cuts shown here corresponds to an example of a selection procedure. Other variations are possible.\nIn particular, rejection factors may be improved by applying\nstricter cuts, at the expense of a further acceptance reduction.\n\n1\n\n10-1\n\nACCEPTANCE\nLVL1 trigger\nall pre-cuts\nall RICH cuts\n\nRejection factor, aerogel\n\n10-2\n\nRejection factor\n\n105\n10-3\n\n104\n\n10-1\n\n103\n\nFig. 11. Acceptance for protons (top) and deuterons (bottom) at different\nstages of event analysis. The lower line in each plot corresponds to the final\nacceptance.\n\n2\n\n10\n\n10\n\n1\n\nFig. 9.\n\n2\n\n3\n\n5\n8\nKinetic energy (GeV/nucleon)\n\nRejection factor for D/p separation in aerogel events.\n\nmass resolution\n\np mass resolution\n\naerogel\nNaF\n\n10-1\n\n10-2\n\n1010 events will be collected during its operation. Detailed\nsimulations have been performed to evaluate the detector's\nparticle identification capabilities, in particular those of the\nRICH. Simulation results show that the separation of light\nisotopes is feasible. Using a set of simple cuts based on\nevent data, relative mass resolutions of ∼ 2 % and rejection\nfactors higher than 104 have been attained in D/p separation\nat energies of a few GeV/nucleon. The separation procedure\npresented here might be crucial for the identification of an\nantideuteron flux resulting from neutralino annihilation.\nR EFERENCES\n\n1\n\n10\nEkin (GeV/nucleon)\n\nFig. 10. Relative mass resolution for protons: NaF events (open dots) and\naerogel events (filled dots).\n\nVI. C ONCLUSIONS\nAMS-02 will provide a major improvement on the current\nknowledge of cosmic rays. A total statistics of more than\n\n[1] S. P. Ahlen et al., Nucl. Instrum. Methods A 350, 34 (1994).\nV. M. Balebanov et al., AMS proposal to DOE, approved April 1995.\n[2] The AMS Collaboration, Phys. Rep. 366, 331 (2002).\n[3] E. Lanciotti, PhD thesis, Universidad Complutense de Madrid (2005).\n[4] F. Barao et al., Nucl. Instrum. Methods A 502, 310 (2003).\n[5] P. Aguayo, R. Pereira et al., Nucl. Instrum. Methods A 560, 291 (2006).\n[6] L. Arruda, PhD thesis, Universidade Tecnica de Lisboa (2008).\n[7] F. Donato, N. Fornengo, D. Maurin, in Proceedings of the 30th International Cosmic Ray Conference (Merida 2007).\n[8] L. Arruda, MSc thesis, Universidade Tecnica de Lisboa (2003), AMS\nnote 2004-03-05.\n[9] E. S. Seo et al., Astrophys. J. 432, 656 (1994).\n\n\f"}