{"id": "http://arxiv.org/abs/1003.2692v1", "guidislink": true, "updated": "2010-03-13T08:52:47Z", "updated_parsed": [2010, 3, 13, 8, 52, 47, 5, 72, 0], "published": "2010-03-13T08:52:47Z", "published_parsed": [2010, 3, 13, 8, 52, 47, 5, 72, 0], "title": "Modeling share prices of banks and bankrupts", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1003.1251%2C1003.5576%2C1003.4893%2C1003.0368%2C1003.2156%2C1003.6081%2C1003.6064%2C1003.1104%2C1003.3865%2C1003.1021%2C1003.5020%2C1003.1867%2C1003.5645%2C1003.5050%2C1003.2385%2C1003.0761%2C1003.4048%2C1003.4366%2C1003.1711%2C1003.2872%2C1003.0184%2C1003.3700%2C1003.3711%2C1003.1872%2C1003.2540%2C1003.4209%2C1003.0719%2C1003.2538%2C1003.3443%2C1003.1737%2C1003.3128%2C1003.0071%2C1003.5184%2C1003.1952%2C1003.3175%2C1003.3431%2C1003.3470%2C1003.4644%2C1003.5544%2C1003.2692%2C1003.0253%2C1003.3906%2C1003.5474%2C1003.3979%2C1003.3246%2C1003.4383%2C1003.2041%2C1003.1579%2C1003.2121%2C1003.1573%2C1003.0920%2C1003.0263%2C1003.2248%2C1003.0589%2C1003.0081%2C1003.3486%2C1003.5713%2C1003.2497%2C1003.0425%2C1003.0466%2C1003.4404%2C1003.3577%2C1003.5215%2C1003.5122%2C1003.0422%2C1003.2750%2C1003.0867%2C1003.3497%2C1003.3902%2C1003.0417%2C1003.0277%2C1003.3645%2C1003.0503%2C1003.1905%2C1003.2891%2C1003.5442%2C1003.1467%2C1003.2864%2C1003.3172%2C1003.1664%2C1003.5125%2C1003.5518%2C1003.0173%2C1003.5939%2C1003.0231%2C1003.1714%2C1003.1211%2C1003.2637%2C1003.0692%2C1003.4174%2C1003.6009%2C1003.0573%2C1003.3688%2C1003.2944%2C1003.5086%2C1003.4417%2C1003.3763%2C1003.2745%2C1003.3878%2C1003.4876%2C1003.2629&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Modeling share prices of banks and bankrupts"}, "summary": "Share prices of financial companies from the S&P 500 list have been modeled\nby a linear function of consumer price indices in the USA. The Johansen and\nEngle-Granger tests for cointegration both demonstrated the presence of an\nequilibrium long-term relation between observed and predicted time series.\nEconometrically, the pricing concept is valid. For several companies, share\nprices are defined only by CPI readings in the past. Therefore, our empirical\npricing model is a deterministic one. For a few companies, including Lehman\nBrothers, AIG, Freddie Mac and Fannie Mae, negative share prices could be\nforeseen in May-September 2008. One might interpret the negative share prices\nas a sign of approaching bankruptcies.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1003.1251%2C1003.5576%2C1003.4893%2C1003.0368%2C1003.2156%2C1003.6081%2C1003.6064%2C1003.1104%2C1003.3865%2C1003.1021%2C1003.5020%2C1003.1867%2C1003.5645%2C1003.5050%2C1003.2385%2C1003.0761%2C1003.4048%2C1003.4366%2C1003.1711%2C1003.2872%2C1003.0184%2C1003.3700%2C1003.3711%2C1003.1872%2C1003.2540%2C1003.4209%2C1003.0719%2C1003.2538%2C1003.3443%2C1003.1737%2C1003.3128%2C1003.0071%2C1003.5184%2C1003.1952%2C1003.3175%2C1003.3431%2C1003.3470%2C1003.4644%2C1003.5544%2C1003.2692%2C1003.0253%2C1003.3906%2C1003.5474%2C1003.3979%2C1003.3246%2C1003.4383%2C1003.2041%2C1003.1579%2C1003.2121%2C1003.1573%2C1003.0920%2C1003.0263%2C1003.2248%2C1003.0589%2C1003.0081%2C1003.3486%2C1003.5713%2C1003.2497%2C1003.0425%2C1003.0466%2C1003.4404%2C1003.3577%2C1003.5215%2C1003.5122%2C1003.0422%2C1003.2750%2C1003.0867%2C1003.3497%2C1003.3902%2C1003.0417%2C1003.0277%2C1003.3645%2C1003.0503%2C1003.1905%2C1003.2891%2C1003.5442%2C1003.1467%2C1003.2864%2C1003.3172%2C1003.1664%2C1003.5125%2C1003.5518%2C1003.0173%2C1003.5939%2C1003.0231%2C1003.1714%2C1003.1211%2C1003.2637%2C1003.0692%2C1003.4174%2C1003.6009%2C1003.0573%2C1003.3688%2C1003.2944%2C1003.5086%2C1003.4417%2C1003.3763%2C1003.2745%2C1003.3878%2C1003.4876%2C1003.2629&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Share prices of financial companies from the S&P 500 list have been modeled\nby a linear function of consumer price indices in the USA. The Johansen and\nEngle-Granger tests for cointegration both demonstrated the presence of an\nequilibrium long-term relation between observed and predicted time series.\nEconometrically, the pricing concept is valid. For several companies, share\nprices are defined only by CPI readings in the past. Therefore, our empirical\npricing model is a deterministic one. For a few companies, including Lehman\nBrothers, AIG, Freddie Mac and Fannie Mae, negative share prices could be\nforeseen in May-September 2008. One might interpret the negative share prices\nas a sign of approaching bankruptcies."}, "authors": ["Ivan O. Kitov"], "author_detail": {"name": "Ivan O. Kitov"}, "author": "Ivan O. Kitov", "links": [{"href": "http://arxiv.org/abs/1003.2692v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1003.2692v1", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "q-fin.ST", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "q-fin.ST", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1003.2692v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1003.2692v1", "arxiv_comment": null, "journal_reference": null, "doi": null, "fulltext": "Modeling share prices of banks and bankrupts\nIvan O. Kitov, IDG RAS\n\nAbstract\nShare prices of financial companies from the S&P 500 list have been modeled by a linear function of consumer price\nindices in the USA. The Johansen and Engle-Granger tests for cointegration both demonstrated the presence of an\nequilibrium long-term relation between observed and predicted time series. Econometrically, the pricing concept is\nvalid. For several companies, share prices are defined only by CPI readings in the past. Therefore, our empirical pricing\nmodel is a deterministic one. For a few companies, including Lehman Brothers, AIG, Freddie Mac and Fannie Mae,\nnegative share prices could be foreseen in May-September 2008. One might interpret the negative share prices as a sign\nof approaching bankruptcies.\nKey words: share price, modeling, CPI, prediction, the USA, bankruptcy\nJEL classification: E4, G1, G2, G3\n\nIntroduction\nRecently, we have developed and tested statistically and econometrically a deterministic model\npredicting share prices of selected S&P 500 companies (Kitov, 2010). We have found that there\nexists a linear link between various subcategories of consumer price index (CPI) and some share\nprices, with the latter lagging by several months. In order to build a reliable quantitative model from\nthis link one needs to use standard and simple statistical procedures.\nFollowing the general concept and principal results of the previous study, here we are\npredicting stock prices of financial companies from the S&P 500 list. In several cases, robust\npredictions are obtained at a time horizon of several months. In close relation to these financial\ncompanies we have also investigated several cases of bankruptcy and bailout. These cases include\nLehman Brothers (LH), American International Group (AIG), Fannie Mae (FNM) and Freddie Mac\n(FRE). Regarding these bankruptcies, we have tested our model against its predictive power in\nMay and September 2008. The main question was: Could the bankruptcies be foreseen? If yes,\nwhich companies should or should not be bailed out as related to the size of their debt?\nIn the mainstream economics and finances stock prices are treated as not predictable beyond\ntheir stochastic properties.\n\nThe existence of a deterministic model would undermine the\n\nfundamental assumption of the stock market. If the prices are predictable, the participants would\nhave not been actively defining new prices in myriads of tries, but blindly followed the driving\nforce behind the market. It is more comfortable to presume that all available information is already\ncounted in. However, our study has demonstrated that the stochastic market does not mean an\nunpredictable one.\nIn this paper, we analyze sixty six financial companies from the S&P 500 lists as of January\n2010 as well as a few bankrupts from the financials. Some of the companies have been accurately\ndescribed by models including two CPI subcategories leading relevant share prices by several\n1\n\n\fmonths. Other companies are characterized by models with at least one of defining CPI components\nlagging behind related stock prices. We have intentionally constrained our investigation to S&P 500\n- we expect other companies to be described by similar models.\nOur deterministic model for the evolution of stock prices is based on a \"mechanical\"\ndependence on the CPI. Under our framework, the term \"mechanical\" has multiple meanings.\nFirstly, it expresses mechanistic character of the link when any change in the CPI is one-to-one\nconverted into the change in related stock prices, as one would expect with blocks or leverages.\nSecondly, the link does not depend on human beings in sense of their rational or irrational behavior\nor expectations. In its ultimate form, the macroeconomic concept behind the stock price model\nrelates the market prices to populations or the numbers of people in various age groups irrelevant to\ntheir skills. Accordingly, the populations consist of the simplest possible objects; only their\nnumbers matter. Thirdly, the link is a linear one, i.e. the one often met in classical mechanics. In all\nthese regards, we consider the model as a mechanical one and thus a physical one rather than an\neconomic or financial one. Essentially, we work with measured numbers not with the piles of\ninformation behind any stock.\nFor the selected stocks, the model quantitatively foresees at a several month horizon.\nTherefore, there exist two or more CPI components unambiguously defining share prices several\nmonths ahead. It is worth noting that the evolution of all CPI components is likely to be defined, in\npart, by stochastic forces. According to the mechanical dependence between the share prices and the\nCPI, all stochastic features are one-to-one converted into stochastic behavior of share prices. Since\nthe prices lag behind the CPI, this stochastic behavior is fully predetermined. The predictability of a\nmeasured variable using independent measured variables, as described by mathematical\nrelationships, is one of the principal requirements for a science to join the club of hard sciences.\nTherefore, our stock pricing model indicates that the stock market is likely an object of a hard\nscience.\nA model predicting stock prices in a deterministic way is a sensitive issue. It seems unfair to\ngive advantages to randomly selected market participants. As thoroughly discussed in (Kitov,\n2009b; Kitov and Kitov, 2008; 2009ab) the models are piecewise ones. A given set of empirical\ncoefficients holds until the trend in the difference between defining CPI is sustained. Such\nsustainable trends are observed in a majority of CPI differences and usually last between 5 and 20\nyears (Kitov and Kitov, 2008). The most recent trend has been reaching its natural end since 2008\nand the transition to a new trend in 2009 and 2010 is likely the best time to present our model. As a\nresult, there is no gain from the empirical models discussed in this paper. Their predictive power\nhas been fading away since 2008. When the new trend in the CPI is established, one will be able to\nestimate new empirical coefficients, all participants having equal chances.\n2\n\n\fThe remainder of the paper is arranged as follows. Section 1 introduces the model and data,\nwhich include stock prices of sixty six S&P 500 financial companies and seventy CPI components.\nIn Section 2, empirical models are presented both in tabulated and graphical forms. For each model\nwe have estimated standard deviation, which serves as a proxy to the model accuracy. For a few\ncompanies, the estimated models are robust over the previous 10 months. Section 3 tests these\nmodels statistically and econometrically. The Johansen (1988) and Engle-Granger (Newbold and\nGranger, 1967; Hendry and, Juselius, 2001) tests both demonstrate that the null hypothesis of the\nexistence a cointegrating relation between the observed and predicted time series cannot be rejected\nfor a majority of companies. Therefore, the model is justified econometrically, and thus, all\nstatistical inferences are valid. In Section 4, a crucial historical problem is addressed: Could one\npredict in May 2008 the evolution of financial stock prices? For some companies, the models\nestimated in the beginning of 2008 hold over the next year. Hence, the empirical modeling would\nhave allowed accurate prediction of the evolution of stock prices, including those related to\ncompanies who filed for bankruptcy in several months. Finally, Section 5 investigates several cases\nof bankruptcy and bailout in the United States. It is found that many stock price trajectories would\nhave been predicted to dive below the zero line.\nThe results of the presented research open a new field for the future investigations of the stock\nmarket. We do not consider the concept and empirical models as accurate enough or final. There\nshould be numerous opportunities to amend and elaborate the model. Apparently, one can include\nnew and improve available estimates of consumer price indices.\n\n1. Model and data\nKitov (2009b) introduced a simple deterministic pricing model. Originally, it was based on an\nassumption that there exists a linear link between a share price (here only the stock market in the\nUnited States is considered) and the differences between various expenditure subcategories of the\nheadline CPI. The intuition behind the model was simple - a higher relative rate of price growth\n(fall) in a given subcategory of goods and services is likely to result in a faster increase (decrease)\nin stock prices of related companies. In the first approximation, the deviation between pricedefining indices is proportional to the ratio of their pricing powers. The presence of sustainable\n(linear or nonlinear) trends in the differences, as described in (Kitov and Kitov, 2008; 2009ab),\nallows predicting the evolution of the differences, and thus, the deviation between prices of\ncorresponding goods and services. The trends are the basis of a long-term prediction of share prices.\nIn the short-run, deterministic forecasting is possible only in the case when a given price lags\nbehind defining CPI components.\n3\n\n\fIn its general form, the pricing model is as follows (Kitov, 2010):\n\nsp(tj) = Σbi*CPIi(tj-τi) + c*(tj-2000 ) + d + ej\n\n(1)\n\nwhere sp(tj) is the share price at discrete (calendar) times tj, j=1,...,J; CPIi(tj-τi) is the i-th\ncomponent of the CPI with the time lag τi, i=1,..,I; bi, c and d are empirical coefficients of the\nlinear and constant term; ej is the residual error, which statistical properties have to be scrutinized.\nBy definition, the bets-fit model minimizes the RMS residual error. The time lags are expected\nbecause of the delay between the change in one price (stock or goods and services) and the reaction\nof related prices. It is a fundamental feature of the model that the lags in (1) may be both negative\nand positive. In this study, we limit the largest lag to fourteen months. Apparently, this is an\nartificial limitation and might be changed in a more elaborated model. In any case, a fourteenmonth lag seems to be long enough for a price signal to pass through.\nSystem (1) contains J equations for I+2 coefficients. Since the sustainable trends last more\nthan five years, the share price time series have more than 60 points. For the current recent trend,\nthe involved series are between 70 and 90 readings. Due to the negative effects of a larger set of\ndefining CPI components discussed by Kitov (2010), their number for all models is (I=) 2. To\nresolve the system, we use standard methods of matrix inversion. As a rule, solutions of (1) are\nstable with all coefficients far from zero.\nAt the initial stage of our investigation, we do not constraint the set of CPI components in\nnumber or/and content. Kitov (2010) used only 34 components selected from the full set provided\nby the US Bureau of Labor Statistics (2010). To some extent, the original choice was random with\nmany components to be similar. For example, we included the index of food and beverages and the\nindex for food without beverages. When the model resolution was low, defining CPI components\nwere swapping between neighbors.\nFor the sake of completeness we always retain all principal subcategories of goods and\nservices. Among them are the headline CPI (C), the core CPI, i.e. the headline CPI less food and\nenergy (CC), the index of food and beverages (F), housing (H), apparel (A), transportation (T),\nmedical care (M), recreation (R), education and communication (EC), and other goods and services\n(O). The involved CPI components are listed in Appendix 1. They are not seasonally adjusted\nindices and were retrieved from the database provided by the Bureau of Labor Statistics (2010).\nMany indices were started as late as 1998. It was natural to limit our modeling to the period\nbetween 2000 and 2010, i.e. to the current long-term trend.\nSince the number and diversity of CPI subcategories is a crucial parameter, we have extended\nthe set defining components to 70 from the previous set of 34 components. As demonstrated below,\n4\n\n\fthe extended set has provided a significant improvement in the model resolution and accuracy.\nTherefore, we envisage the increase in the number and diversity of defining subcategories as a\npowerful tool for obtaining consistent models. In an ideal situation, any stock should find its\ngenuine pair of CPI components. However, the usage of similar components may have a negative\neffect on the model – one may fail to distinguish between very close models.\nEvery sector in the S&P 500 list might give good examples of companies with defining CPI\ncomponents lagging behind relevant stock prices. As of January 2010, there were 66 financial\ncompanies to model, with the freshest readings being the close (adjusted for dividends and splits)\nprices taken on December 31, 2009. (All relevant share prices were retrieved from\nhttp://www.finance.yahoo.com.) Some of the modeled companies do present deterministic and\nrobust share price models. As before, those S&P 500 companies which started after 2004 are not\nincluded. In addition, we have modeled Fannie Mae and Freddie Mac, which are not in the S&P\n500 list, and Lehman Brothers and CIT Group (CIT) which are out of the S&P 500 list. Due to the\nfact that the latter three companies are both bankrupts, they have been modeled over the period of\ntheir existence. Apparently, there are many more bankrupts to be modeled in the future.\nThere are two sources of uncertainty associated with the difference between observed and\npredicted prices, as discussed by Kitov (2010). First, we have taken the monthly close prices\n(adjusted for splits and dividends) from a large number of recorded prices: monthly and daily open,\nclose, high, and low prices, their combinations as well as averaged prices. Without loss of\ngenerality, one can randomly select for modeling purposes any of these prices for a given month.\nBy chance, we have selected the closing price of the last working day for a given month. The larger\nis the fluctuation of a given stock price within and over the months the higher is the uncertainty\nassociated with the monthly closing price as a representative of the stock price.\nSecond source of uncertainty is related to all kinds of measurement errors and intrinsic\nstochastic properties of the CPI. One should also bear in mind all uncertainties associated with the\nCPI definition based on a fixed basket of goods and services, which prices are tracked in few\nselected places. Such measurement errors are directly mapped into the model residual errors. Both\nuncertainties, as related to stocks and CPI, also fluctuate from month to month.\n\n2. Modeling financial companies\nThe results of modeling are presented in Table 1 and Appendix 2: two defining components with\ncoefficients and lags, linear trend and free terms, and the standard error, σ, expressed in dollars.\nNegative lags, which correspond to leading share prices, are shown in bold. Figure 1 and Appendix\n3 depict the observed and predicted curves. Five companies will be studied in more detail in Section\n5\n\n\f5: American International Group, Citigroup (C), Fifth Third Bancorp (FITB), Legg Mason Inc.\n(LM), Moody's Corporation (MCO) and Morgan Stanley (MS).\nSome financial companies have at least one defining CPI component lagging behind relevant\nstock price. For these companies, it is better to use the term \"decomposition into\" instead of\n\"defining\" CPI components. For example, share price of Aflac Incorporated (AFL) is defined by\nthe index of financial services (FS) and that of transportation services (TS), the former lagging 2\nmonths behind the share price and the latter leading by 6 months. Coefficient b1 is positive. It\nmeans that the higher is the price for financial services the larger is the AFL's share price. The\neffect of the price index of transpiration services is opposite. Standard error for the model for the\nperiod between July 2003 and December 2009 is only $3.71. Figure 1 displays the observed and\npredicted prices for the period between 2003 and 2010. Before July 2003, the model does not hold\nand the curves deviate. Otherwise both curves are is a relatively good agreement including the sharp\ndrop in 2008. From the statistical point of view, this is a key feature because any increase in the\nrange of total change in the price and the defining CPIs is directly converted into higher model\nresolution.\nOverall, standard errors in Table 1 and Appendix 2 vary from $0.77 for People's United\nFinancial Inc. (PBCT) to ~$92 for AIG, which will be thoroughly analyzed in Section 5. When\nnormalized to the stock prices averaged over the whole period, the standard errors fluctuate less.\nHowever, for non-stationary time series with measurement errors dependent on amplitude the\nnormalized errors are likely biased. The predicted curve is Figure 1 is very close to the observed\none and foresees one month ahead. Actually, the predicted curve leads the observed one by one\nmonth.\nAmerican International Group was the first company bailed out by the US financial\nauthorities in September 2008. This action introduced a bias into the link between AIG share price\nand defining CPIs, which existed before September 2008. The model listed in Table 1 is likely to be\ninappropriate as related to the link and not a robust one. The defining CPIs for the December 2009\nmodel are as follows: the index for food away from home (SEFV) leading by 1 month and the index\nof prescribed drugs (PDRUG) leading by 13 months. In Section 5, we investigate the evolution of\nthe bet-fit model from May 2008 to December 2009.\nThe model for Apartment Investment and Management Company (AIV) has both defining\nCPIs leading the share price: the index of pets and pet related products (PETS), a subcategory of the\nindex for recreation, leads by one month and the index of prescribed drugs (PDRUG) is five\nmonths ahead of the price. At first glance, this set of defining CPIs does not look convincing. This\nmight be an effect of the changing trend in the CPI. Before November 2009, the best-fit model\nincluded the index of food and beverages (F) and the PDRUG, both leading by 8 months. This set\n6\n\n\fdetermined the best-fit model during the 12 previous months (Kitov, 2010). In the smaller set of 34\nCPI components used by Kitov (2010), the index of food and beverages and that of medical care\n(M) were the driving ones between November 2008 and October 2009 and provided the standard\nerror of $2.058, but for a shorter period. With the PDRUG, the standard error for the same period\nbetween July 2003 and October 2009 is $2.055, i.e. only marginally better. This fact demonstrates\nhow sensitive the model is to the defining CPIs. When more components are included, one could\nexpect changes in the previously obtained models and lower standard errors.\nThe Allstate Corporation (ALL) has a model with both defining CPIs leading the share price.\nThis model is unstable, however, and minimizes the RMS error only for the period between July\n2003 and December 2009. In 2009, one of two defining components was randomly changing and\none, the index for food away from home (SEFV), fixed. It is likely that the current set of defining\nCPIs do not include the one related to ALL. Thus, further investigations are needed.\nTable 1. Empirical 2-C models for selected S&P 500 financial companies\nb2\nCompany\nb1\nCPI1\nCPI2\nτ1\nAFL\n0.59\nFS\nTS\n-2 -2.37\nAIG\n-191.36 SEFV 1 38.53 PDRUG\nAIV\n-1.64\nPETS 1\n1.09 PDRUG\nALL\n0.07\nE\n11 -6.86\nSEFV\nAVB\n0.57\nCM\n1\n1.92\nAB\nAXP\n-3.81\nF\n4 -2.00\nM\nBAC\n-2.95\nFB\n3 -2.97\nSEFV\nBBT\n-1.57\nF\n3 -0.31\nFRUI\nBEN\n-7.95\nFB\n3\n6.59\nVAA\nBK\n-0.69 MEAT 13 -1.65\nPETS\nBXP\n4.58\nMCC\n5 -5.04\nPETS\nC\n2.54\nHO\n5 -8.26\nSEFV\nFITB\n-4.85\nSEFV 2\n1.45\nHS\nHBAN\n-2.15\nRPR 13 1.32\nFOTO\nHCN\n-1.80\nPETS 2\n0.76\nHOSP\nGS\n21.06\nHO\n10 -29.45 SEFV\nJPM\n-2.49\nF\n4\n3.19\nORG\nL\n-2.49\nFB\n5 -1.51\nTS\nLM\n-6.01\nF\n4 -8.17\nAPL\nPNC\n1.49\nCM\n0 -3.44\nFB\nPSA\n-4.14\nSEFV 3\n2.04 PDRUG\nVNO\n-11.08 SEFV 3\n2.23 PDRUG\n\nτ2\n6\n13\n5\n2\n-1\n10\n13\n13\n13\n1\n3\n2\n6\n13\n5\n3\n0\n3\n13\n4\n5\n5\n\nc\nd\nσ, $\n12.12\n349.73\n3.71\n727.81 21116.78 92.3\n-1.61\n-139.18\n2.15\n45.20 1106.19 2.82\n-12.01 -345.48\n1.36\n49.93 1115.79 2.48\n35.43\n956.52\n2.53\n12.58\n332.95\n2.06\n60.58\n564.48\n6.46\n15.80\n270.32\n2.09\n5.63\n-605.31\n5.04\n36.70 1048.90 2.53\n21.19\n621.56\n1.82\n17.23\n252.80\n0.93\n-7.06\n-40.40\n2.20\n111.40 2496.20 13.48\n26.31\n139.00\n2.49\n28.35\n679.85\n2.07\n33.07 1754.81 6.89\n16.37\n331.72\n3.49\n14.25\n72.98\n4.43\n57.23 1113.14 5.30\n\nAvalonbay Communities (AVB) has a model with one defining index (alcoholic beverages,\nAB) lagging behind the price by one month and the headline CPI less medical care (CM) leading by\n7\n\n\fone month.\n\nThis model is very stable over the previous 10 months and has a standard error of\n\n$1.36.\nAmerican Express Company (AXP) has a model predicting at a four month horizon. The\ndefining CPIs are the index for food and beverages leading by 4 months and the index for medical\ncare leading by 10 months. In the previous study (Kitov, 2010) the model was essentially the same.\nSo, the extended CPI set does not make a better model. The model is a robust one and minimizes\nthe standard error for the period between July and November 2009 as well.\nThe model for Bank of America (BAC) is defined by the index of food and that of food away\nfrom home. The latter CPI component leads by 13 months. From our past experience, the larger is\nthe lag the more unreliable is the model. However, both defining components provide the best fit\nmodel in the second half of 2009. Both coefficients in the BAC model are negative. This means\nthat increasing food price forces the share price down. The growth in the indices of food and food\naway from home has been compensated by linear time trend in the share price.\nFranklin Resources (BEN) is driven by the index of food (FB) and that of video and audio\n(VAA), both leading by several months. The former component has a negative coefficient and the\nlatter one – positive. Bank of New York Mellon Corporation (BK) is defined by the index of meats,\npoultry and fist (MEAT) and the index of pets and per related products, both having negative\ncoefficients. The model has a standard error of $2.09.\nBoston Properties (BXP) has a model with the index of medical care commodities (MCC) and\nPETS leading by 5 and 3 months, respectively. This is a relatively stable model. However, the bestfit model was different before September 2009 and included the index of food and the index of\nmiscellaneous services (MISS). This model had been reining since March 2009.\n\nThe model\n\nobtained in (Kitov, 2010) was based on the CPI less energy (CE) and the index of food. It was a\nmediocre model with the RMS error of $5.54 compared to $5.11 obtained in this study for the same\nperiod.\nCitigroup is of special interest. This company was bailed out in November 2008. For the\npurposes of share modeling the bailout introduces a major disturbance, because the share is not the\none estimated by the free stock market any more.\n\nAccordingly, the models obtained after\n\nNovember 2008 are likely to be biased. In Table 1, a share of Citigroup is defined by the index of\nhousehold operations (HO) and that of food away from home (SEFV). Coefficient b1 (=+2.54) is\npositive and the increase in HO should be converted into a higher share price. The effect of SEFV is\nan opposite one with a larger coefficient b2=-8.26. In 2007 and 2008, the index of household\noperations was increasing at almost the same rate as the SEFV, and the share fell from $50 in April\n2007 to $1.5 in January 2009.\n8\n\n\fThe next ten companies in Table 1 are all robust and have deterministic price models with no\none of defining indexes lagging. Huntington Bancshares (HBAN) is controlled by the index of\nprimary residence rent (RPR) and the index for photography (FOTO), both leading by 13 months.\nThis model holds at least over the 10 months previous to December 2009. Coefficient b1\n\nis\n\nnegative and any increase in RPR is converted into a decrease in the HBAN share price 13 months\nlater. It is instructive to track this model in 2010. It must be fading away with the transition to a new\ntrend in the CPI. The model standard deviation is only $0.92 for the whole period. Figure 1\ndisplays relevant curves. Except four of five points, the agreement is excellent.\nHealth Care REIT (HCN) has a model defined by the PETS and the index of hospital services\n(HOSP). The latter has a permanent positive trend and likely is compensated by the linear trend\nterm with a negative slope (-40.4). The predicted and observed curves are very close. So, the model\naccurately predicts at a two-month horizon.\nGoldman Sachs (GS) is a famous bank. The trajectory of its share price is well predicted by\nthe index of household operations (HO) and the index of food away from home (SEFV) at a three\nmonth horizon. Since coefficient b1 is positive the decreasing price index of household operations\nresults in a fall in GS share price, as was observed in 2008 and 2009. In the second half of 2009,\nthe price was on rise.\nJPMorgan Chase & Co. is defined by food and beverages (F) and other recreation goods\n(ORG). Since the time lag of the ORG is zero the model can predict only contemporary share price.\nIn Figure 1, the observed and predicted curves almost coincide before 2007. The years between\n2007 and 2009 are characterized by extremely high fluctuations in the observed price. The model\nfailed to predict this feature. In 2009, the prediction is good again, however. Therefore, the\nfluctuations are likely to be related to short-term forces not affecting fundamental long-term link\nbetween the price and the defining CPIs.\nThe best-fit model for Loews Corporation (L) includes the index of food (FB) leading by 5\nmonths and the index of transportation services (TS) leading by 3 months. Both coefficients are\nnegative and are counteracted by a positive slope c=28.35. The model for Legg Mason (LM) is\nbased on the index of food and beverages and the index of appliances (APL) from the housing\nindex, the latter leading by 13 months. Overall, the predicted time series is very close to the\nobserved one with standard deviation of $6.89. The largest input to the standard deviation comes\nfrom a short period in 2006. Otherwise, both curves are very close even during the dramatic fall\nfrom $80 per share in the end of 2007 to $10 per share in February 2009 and during the fast\nrecovery in 2009.\nPNC Financial Services (PNC) relies on the headline CPI less medical care (CM) and the\nindex of food (FB), the model being a contemporary to the share. Public Storage (PSA) and\n9\n\n\fVornado Realty Trust have similar models defined by the index of food away from home and the\nPDRUG. The time lags are also identical and are 3 and 5 months, respectively. Figure 1\ndemonstrates that the observed prices of PCA and VNO are similar with a local peak in the first half\nof 2008. A similar pattern is observed for AIV, which model also includes PDRUG. The difference\nbetween PCA and VNO is in the sensitivity to SEFV: b1(PSA)=-4.14 and b1(VNO)=-11.08.\nSo, among the models with both defining CPIs leading relevant shares, there are examples of\nrobust models and unstable models. For the latter companies, no fixed model is available over the\npast year. It is likely that these models express the lack of true defining indices in the current set of\nCPIs and are affected by random measurement noise. One cannot exclude that true robust models\ndo exists for these companies.\nFor other forty four financial companies relevant models and graphs are presented in\nAppendices 2 and 3. These models use quiet several defining CPIs not mentioned in Table 1.\nOtherwise, Table 1 contains all meaningful configurations of leading and lagging share prices and\nthose in the Appendices are given for the sake of completeness.\n\n70\n\n1900\n\n60\n1500\n\n50\n1100\n$\n\n$\n\n40\n30\n\n700\n\nPREDICTED\n\nPREDICTED\n\n10\n0\n2002\n\nAIG\n\nAFL\n\n20\n\n2004\n\n2006\n\n2008\n\n300\n-100\n2002\n\n2010\n\n2004\n\ncalendar year\n\n40\n\n70\n\n35\n\n60\n\n30\n\n2010\n\n40\n\n20\n\n$\n\n$\n\n2008\n\n50\n\n25\n\n15\n\nAIV\n\n10\n\nPREDICTED\n\n30\n\nALL\n\n20\n\nPREDICTED\n\n10\n\n5\n0\n2002\n\n2006\ncalendar year\n\n2004\n\n2006\n\n2008\n\n0\n2002\n\n2010\n\ncalendar year\n\n2004\n\n2006\ncalendar year\n\n10\n\n2008\n\n2010\n\n\f70\n\n90\n\n60\n\n85\n\nAVB\n50\n\nPREDICTED\n\n80\n\nAXP\n\n$\n\n$\n\n40\n75\n30\n\nPREDICTED\n\n70\n20\n65\n\n10\n\n60\n2002\n\n2004\n\n2006\n\n2008\n\n0\n2002\n\n2010\n\n2004\n\n2006\n\ncalendar year\n\n2008\n\n2010\n\n2008\n\n2010\n\ncalendar year\n40\n\n50\n\n35\n\n40\n\n30\n30\n$\n\n$\n\nBAC\n20\n\nPREDICTED\n\nBBT\n20\n\n10\n0\n2002\n\n25\nPREDICTED\n\n15\n\n2004\n\n2006\n\n2008\n\n10\n2002\n\n2010\n\n2004\n\n2006\n\ncalendar year\n\ncalendar year\n160\n\n50\n\n140\n\n40\n\n120\n\n30\n\n80\n\n$\n\n$\n\n100\n\n20\n\n60\n\nBEN\n\n40\n\nPREDICTED\n\nBK\nPREDICTED\n\n10\n\n20\n0\n2002\n\n2004\n\n2006\n\n2008\n\n0\n2002\n\n2010\n\n2004\n\n2006\n\n60\n\n100\n\n50\n\n80\n\n40\n\n60\n\n30\n\n$\n\n$\n\n120\n\n40\n\n20\n\nC\n\n10\n\nPREDICTED\n\nBXP\n20\n0\n2002\n\nPREDICTED\n\n2004\n\n2006\n\n2008\n\n2008\n\n2010\n\ncalendar year\n\ncalendar year\n\n0\n2002\n\n2010\n\n2004\n\n2006\n\n2008\n\ncalendar year\n\ncalendar year\n\n11\n\n2010\n\n\f60\n\n25\n\n50\n\n20\n\n40\nHBAN\n\n$\n\n$\n\n15\n\n30\n\n10\n\n20\n\nPREDICTED\n\nFITB\nPREDICTED\n\n10\n0\n2002\n\n2004\n\n5\n\n2006\n\n2008\n\n0\n2002\n\n2010\n\n2004\n\ncalendar year\n\n2006\n\n2008\n\n2010\n\n2008\n\n2010\n\ncalendar year\n\n60\n\n300\n\n50\n\n250\n\n40\n\n200\n\n30\n\n150\n\nGS\n\n$\n\n$\n\nPREDICTED\n\nHCN\n\n20\n\n100\n\nPREDICTED\n50\n\n10\n0\n2002\n\n2004\n\n2006\n\n2008\n\n0\n2002\n\n2010\n\n2004\n\ncalendar year\n\n2006\ncalendar year\n\n60\n\n60\n\n50\n\n50\n\n40\n\n$\n\n$\n\n40\n30\n\n20\n\nJPM\n20\n10\n2002\n\nPREDICTED\n\n2004\n\n2006\n\n30\n\n2008\n\nL\nPREDICTED\n\n10\n0\n2002\n\n2010\n\n2004\n\n140\n\n80\n\n120\n\n70\n\n2010\n\n50\n$\n\n80\n$\n\n2008\n\n60\n\n100\n\n60\n\n40\n\nPNC\n\n30\nLM\n\n40\n\nPREDICTED\n\n20\n\nPREDICTED\n\n20\n0\n2002\n\n2006\n\ncalendar year\n\ncalendar year\n\n10\n2004\n\n2006\n\n2008\n\n0\n2002\n\n2010\n\ncalendar year\n\n2004\n\n2006\ncalendar year\n\n12\n\n2008\n\n2010\n\n\f120\n100\n\n100\n\nPSA\nPREDICTED\n\n80\n\n60\n\n$\n\n$\n\n80\n\n120\n\n60\n\n40\n\n40\n\n20\n\n20\n\n0\n2002\n\n2004\n\n2006\n\n2008\n\n0\n2002\n\n2010\n\nVNO\nPREDICTED\n\n2004\n\n2006\n\n2008\n\n2010\n\ncalendar year\n\ncalendar year\n\nFigure 1. Observed and predicted share prices of eight financial companies from the S&P 500 list.\nRelevant empirical models are presented in Table 1.\nThe principal purpose of Section 2 consists in presenting tentative empirical models for share\nprices of financial companies. The current set of defining CPIs is far from a complete one and\nfurther investigation may reveal more accurate and reliable models for the same companies.\nHowever, the current models might be good enough because of high correlation between various\nCPI components. For a given share, the currently used CPIs may be very close to the true defining\nCPIs, which are not included in the set yet. Therefore, a direct statistical estimate of the model\naccuracy and reliability is a major task.\n\n3. Cointegration tests\nStatistical properties of the residual error are crucial for any quantitative model. Ideally, a good\nmodel involving time dependent measured variables should describe the essence of real ties. The\nmodel residual error should be a stationary (and thus, integrated of order zero) stochastic process\nwith characteristics close to the uncorrelated white noise with Gaussian distribution. In the best\ncase, residual errors should depend only on measurement errors, with the measurements conducted\nin a consistent way.\nAs in the previous study (Kitov, 2010), we applied the Johansen cointegration test to the\nobserved time series and those predicted in Section 2. For all studied companies, the test resulted in\ncointegration rank 1 or, for two non-stationary variables, in the presence of one cointegrating\nrelation. All results are listed in Table 2. The Johansen approach does not require both variables to\nbe in the same order of integration.\nAs an alternative, we have applied the augmented Dickey-Fuller (ADF) and the PhillipsPerron (PP) tests for unit roots to all residual errors of the models in Table 1, except those with\ndefining CPI lagging behind relevant shares. This procedure is in line with the Granger-Engle twostep method based on several specification tests applied to the residual time series. Having the same\n\n13\n\n\feconometric power as the Johansen procedure, the Granger-Engle test allows a larger variety of\nspecifications.\nTable 2. Results of Johansen cointegration test and unit root tests as applied to the residual errors\nADF\nPP\nJohansen test\nz(t), 1%CV1=-3.54 z(ρ), 1%CV=-19.4 eigenvalue trace statistics, rank\n5%CV=3.76\nAIG\n-4.10\n-29.8\n0.21\n0.24\n1\nAIV\n-6.19\n-47.5\n0.35\n0.15\n1\nALL\n-5.95\n-46.5\n0.32\n0.04\n1\nAXP\n-4.98\n-38.3\n0.25\n0.35\n1\nBAC\n-4.87\n-38.5\n0.21\n0.003\n1\nBBT\n-5.96\n-47.7\n0.29\n0.08\n1\nBEN\n-4.53\n-34.0\n0.22\n1.90\n1\nBK\n-5.00\n-40.0\n0.26\n0.07\n1\nBXP\n-5.47\n-39.6\n0.33\n0.87\n1\nC\n-5.60\n-41.0\n0.36\n0.27\n1\nFITB\n-5.63\n-45.8\n0.26\n2.39\n1\nGS\n-4.56\n-34.0\n0.41\n1.69\n1\nHBAN\n-5.44\n-41.5\n0.29\n0.29\n1\nHCN\n-5.27\n-39.0\n0.37\n1.91\n1\nJPM\n-6.22\n-51.2\n0.30\n1.15\n1\nL\n-5.70\n-43.5\n0.37\n0.96\n1\nLM\n-4.75\n-37.2\n0.18\n0.11\n1\nMS\n-6.20\n-48.4\n0.33\n0.09\n1\nPNC\n-6.12\n-50.0\n0.33\n0.47\n1\nPSA\n-5.84\n-44.3\n0.33\n2.18\n1\nVNO\n-5.46\n-40.0\n0.33\n0.83\n1\n1\nCV – critical value\n\nIn a sense, this Section is a fully technical one. We need only a confirmation that the\nregression technique used in Section 2 is applicable, i.e. the regression does not give spurious\nresults. Both tests for cointegration unambiguously evidence the presence of long-term equilibrium\nrelations between the actual and predicted prices. The predicted prices can be considered as\nweighted sums of prices for goods and services. In this regard, they are similar to the overall CPI\nand can be considered as independent measurements and represent just one variable. Therefore, one\ndoes not need to test both defining CPI for cointegration with relevant share price.\nSo, one can derive a conclusion that the deterministic pricing model provides a statistically\nand econometrically valid description of share prices of S&P 500 financial companies. There is a\nproblem with the model resolution, however. As happens often in physics, in order to obtain a\nconsistent and reliable model one should have a wider dynamic range of involved variables or to\nincrease the accuracy of measurements. The latter is hardly possible with the past CPI readings. So,\none could expect a more reliable model for the companies with share prices varying the most.\n\n14\n\n\f4. May 2008 vs. December 2009\nThe current models predicting future prices are of crucial interest for the stock market. It is always\nimportant to know which stocks will go up/down and at what rate. However, there are significant\nproblems related to the past performance of the stock market also to be considered. One of these\nproblems is associated with the 2008/2009 financial and economic crisis, which exposed many\ncompanies to major risks. Since the late 2007 and very actively since July 2008, stock prices of\nmany companies have been decreasing at an accelerating speed. The decrease costs trillions US\ndollars net lost after the overall asset devaluation. This is a natural challenge to our concept: Could\nthe model predict the fall in stock prices if available in 2008?\nFor all investors and owners it would have been a great relief to predict, and thus, prevent or\nreduce the loss. Here we would like to stress again that the model is valid only when it does not\ndisturb natural functioning of the stock market, i.e. those myriads of well-established direct and\nindirect interactions between economic and financial agents. When everybody shifts to one or few\n\"salvage\" stocks, their behavior becomes highly distorted, biased, and thus unpredictable. A part of\nthe financial market is never equivalent to the whole market and this model will be worthless when\nused by all market players. So, we would not recommend using the model shortly after this book is\npublished. In a sense, this publication may destroy the market configuration described by the model.\nThe principal question posed in this Section can be addressed quantitatively. As a first step,\nwe move back in May 2008 and use contemporary CPI data to obtain the best-fit models for the\nS&P 500 share prices under study. Table 3 and Appendix 4 list these models obtained for selected\nfinancial companies. One should bear in mind that the involved prices had only limited dynamic\nrange in the beginning of 2008 and corresponding models are not fully resolved. In this sense, the\n2009 models are superior.\nThen, we calculate all share prices using the 2008 models and actual CPI data between May\n2008 and December 2009. In Figure 2 we compare the 2008 predictions to those obtained in\nJanuary 2010 (i.e. the models for December 2009) and described in Section 2. If both models for a\ngiven share provide similar predictions then the 2008 fall was predictable, at least for the company.\nA few companies in Table 3 have one defining component of the same nature as that in\nrelevant December 2009 models. For a majority, both defining indices are different. This effect is\nobserved despite our intention to select those 2008 models which provide the best prediction.\nThe May 2008 model for ALL, which includes the index of diary products (DIAR) and the\nindex of intracity transportation (ITR), predicts the evolution of the share price relatively well till\nJuly 2009. Then the May prediction starts to diverge at an accelerating rate from the observed\ntrajectory. The 2008 trough could be forecasted both in time and amplitude in May 2008.\n\n15\n\n\fTable 3. Defining CPI components, coefficients and time lags for the models in May 2008.\nCompany\nAFL\nAIG\nAIV\nALL\nAVB\nAXP\nBAC\nBBT\nBEN\nBK\nBXP\nC\nFITB\nGS\nHBAN\nHCN\nHST\nJPM\nL\nLM\nPNC\nPSA\nVNO\n1\n\nb1\n0.36\n-21.11\n1.78\n1.85\n1.41\n-7.87\n-2.72\n-1.98\n3.28\n-1.44\n-3.96\n-4.02\n-0.40\n12.87\n-2.07\n0.20\n-2.81\n-2.54\n2.02\n-2.56\n2.43\n6.13\n2.63\n\nCPI1\nDIAR\nDIAR\nVAA\nMCC\nEC\nSEFV\nF\nRPR\nPDRUG\nH\nF\nFB\nDIAR\nMVP\nSEFV\nFU\nSEFV\nF\nMVP\nMEAT\nDUR\nMVP\nPDRUG\n\nτ1\n0\n9\n3\n7\n4\n4\n3\n13\n12\n11\n4\n8\n7\n5\n6\n8\n3\n4\n5\n7\n10\n5\n7\n\nb2\n-0.55\n-172.66\n1.23\n-2.22\n1.59\n1.20\n1.77\n-1.16\n-1.90\n3.13\n3.17\n-4.00\n0.84\n27.41\n-1.66\n-2.27\n0.55\n-0.45\n-5.37\n-12.00\n-5.69\n-9.54\n8.56\n\nCPI2\nITR\nSEFV1\nPDRUG\nAPL\nAB\nHS\nTS\nMISS\nHOSP\nHO\nMCC\nRPR\nPDRUG\nFOTO\nRPR\nVAA\nPDRUG\nMEAT\nSEFV\nAPL\nSEFV\nRPR\nFOTO\n\nτ2\n12\n2\n7\n9\n1\n6\n12\n12\n3\n11\n7\n13\n8\n12\n13\n0\n7\n13\n5\n13\n4\n6\n10\n\nc\n8.92\n1148.11\n-10.77\n-10.18\n-10.47\n47.73\n8.86\n25.57\n30.13\n-2.39\n14.55\n46.97\n-12.03\n65.74\n22.63\n1.07\n13.60\n20.29\n33.34\n12.38\n43.97\n57.57\n10.67\n\nd\n38.50\n31872.06\n-525.90\n-207.35\n-340.92\n1098.50\n115.22\n648.22\n-368.96\n-75.70\n-136.73\n1376.82\n-112.79\n-4221.10\n638.78\n225.28\n290.45\n484.70\n643.83\n1528.90\n617.15\n1103.99\n-1683.89\n\nsame defining CPIs as in Table 1 are highlighted.\n\nFor several companies, the agreement between the May 2008 and December 2009 predictions\ndoes not disappear even when models are different. For example, the 2008 model for AXP, defined\nby the SEFV and the index of household services (HS), does not diverge from the observed\ntrajectory since 2008. Similar situation is observed with the model for Host Hotels&Resorts (HST).\nThis effect shows the necessity of a complete or at least more representative set of CPIs. Otherwise,\none can not distinguish between two neighboring models with defining CPI components\ncharacterized by a high degree of correlation.\nThe 2008 and 2010 models for BXP have one common defining variable – the index of\nmedical care commodities (MCC). Nevertheless, the 2008 model fails to predict the future\ntrajectory well. This is due to the difference between the indices for food and beverages and pets.\nSimilar effect is observed with JPM.\nThe 2008 model for GS demonstrates a striking difference with the observed time series. It\npredicted the fall in the share price down to the zero line in the second half of 2009. In reality, no\ncatastrophic drop happened and the price fell only to the level of $70. From the actual time series it\nis clear that the model for GS could not be well resolved because of very limited change in the share\n16\n\n\fprice by May 2008. There are several financial companies with shares predicted to fall below the\nzero. Some predictions were accurate enough. These companies are modeled in Section 5.\n\n70\n\n70\n\n60\n\n60\n50\n\n50\n$\n\n$\n\n40\n40\n\n30\n\n30\nALL\nPREDICTED, January 2010\nPREDICTED, May 2008\n\n20\n10\n2003\n\nAXP\nPREDICTED, January 2010\nPREDICTED, May 2008\n\n20\n\n2004\n\n2005\n\n2006\n\n2007\n\n2008\n\n10\n0\n2003\n2009\n\n2004\n\n2005\n\n2010\n\n30\n\n2008\n\n2009\n\n2010\n\n120\n\n25\n\n100\n\n20\n\n80\n\n15\n\n60\n\n$\n\n$\n\n2007\n\ncalendar year\n\ncalendar year\n\n10\n\n40\nHST\nPREDICTED, January 2010\nPREDICTED, May 2008\n\n5\n0\n2003\n\n2006\n\n2004\n\n2005\n\n2006\n\n2007\n\n2008\n\nBXP\nPREDICTED, January 2010\nPREDICTED, May 2008\n\n20\n\n2009\n\n0\n2003\n\n2010\n\n2004\n\n2005\n\n2006\n\n2007\n\n2008\n\n2009\n\n2010\n\ncalendar year\n\ncalendar year\n60\n\n300\n250\n\n50\n\n200\n\n$\n\n40\n\nGS\nPREDICTED, January 2010\nPREDICTED, May 2008\n\n$\n\n150\n\n30\n100\nJPM\nPREDICTED, January 2010\nPREDICTED, May 2008\n\n20\n10\n2003\n\n2004\n\n2005\n\n2006\n\n2007\n\n2008\n\n50\n\n2009\n\n2010\n\n0\n2003\n\n2005\n\n2007\n\n2009\n\ncalendar year\n\ncalendar year\n\nFigure 2. Comparison of stock prices predicted in May 2008 and December 2009.\nThe number of successful models is relatively small if to consider the initial set of S&P 500\ncompanies. This fact raises delicate questions about the reliability of the models and the concept\nitself. One may assume that the successful models are just a lucky accident. The concept should be\nvalidated by modeling of more companies, extension of the set of defining CPI components, and\nusage of new data in the years to come.\nWe also take into account the fact that quantitative models, also in physics, are better resolved\nthan all involved variables vary in wider ranges. Specifically, the difference between the 2008 and\n2009 models consists in the sharp fall after July 2008. Therefore, the models obtained in 2009 are\n17\n\n\fbetter resolved and thus superior to those from 2008. Data available in 2008 did not allow\nidentification of right models because of high correlation between subcategories of the consumer\nprice index. Good news is that the right models hold once and for all, but with new coefficients.\n\n5. Predicting bankruptcy\nIn Section 4, we have modeled the evolution of share prices of several financial companies from the\nS&P 500 list between May 2008 and December 2009. It was found that some predicted share prices\nsank below the zero line. Under our framework, the presence of a negative stock price may be\nconsidered as an equivalent to a net debt. When long enough and without any positive prospective,\nsuch a debt would likely result in a bankruptcy.\nIn reality, some companies with negative predicted share prices declared bankruptcy, some\nwere bailed out and some have been suffering tremendous difficulties since 2008. The first group is\nrepresented by Lehman Brothers who filed for Chapter 11 bankruptcy protection on September 15,\n2008. The net bank debt was estimated at the level of $600 billion. More than 100 banks filed for\nbankruptcy since then.\nSeveral banks were bailed out, with American International Group the first to obtain a $150\nbillion government bailout. The AIG bailout was presented as a major move to save the collapsing\nUS financial system. The biggest examples of bailout are also Fannie May and Freddie Mac. All\nthree companies had a sharp share price fall in the second half of 2008.\nCIT Group Inc. (CIT) got $2.3 billion of bailout money in December 2008 and $3 billion\nbond holder bailout in July 2009. However, it did not help and CIT declared bankruptcy in\nNovember 2009. These companies and many others have been struggling and likely will struggle in\nthe future trying to restructure their debts and re-enter the stock market.\nSection 5 seeks to answer a number of questions:\n•\n\nWas it possible to predict the evolution of total debt of the bankrupts?\n\n•\n\nWas it possible to predict the dates of these bankruptcies?\n\n•\n\nIs it possible to predict the date of recovery?\n\n•\n\nIt is possible to predict future bankruptcies?\n\n•\n\nWhich company had to be bailed out and when?\n\nAll S&P 500 models with negative share prices were obtained together with other models for\nMay 2008. In this regard we should not distinguish them. The reason for a separate investigation\nconsists in the fact that negative share prices might result in bankruptcies. This is a phenomenon no\ndescribed quantitatively by our models and thus deserving special attention. Otherwise, all models\n18\n\n\fwere equivalent and obtained according to the same procedures. It is worth noting that the models\nfor the same companies obtained in October 2009 are highly biased by bailouts or do not exist\ntogether with bankrupt companies.\n\nTable 4. Models for 10 companies: May, September and December 2008, and October 2009.\nMay 2008\nCompany\nAIG\nC\nCIT\nFITB\nFNM\nFRE\nLEH\nLM\nMCO\nMS\n\nb1\n-21.11\n-4.33\n-4.84\n1.46\n9.62\n-3.54\n-6.27\n-2.57\n-5.50\n7.788\n\nCPI1\nDIAR\nFB\nF\nMCC\nRS\nDUR\nFB\nMEAT\nF\nR\n\nτ1\n\nCPI1\nDIAR\nFB\nDAIR\nF\nSEFV\nCOMM\nFB\nMEAT\nDUR\nTPU\n\nτ1\n\n9\n4\n5\n9\n3\n2\n4\n7\n5\n7\n\nb2\n-172.66\n-3.63\n11.51\n-0.32\n10.84\n-9.66\n-1.38\n-12.02\n-5.83\n-0.85\n\nCPI2\nSEFV\nRPR\nSEFV\nDIAR\nSEFV\nRPR\nHOSP\nAPL\nRPR\nDIAR\n\nb2\n-178.42\n-3.62\n-8.20\n1.06\n4.64\n-14.11\n-5.29\n-12.20\n-9.26\n-0.95\n\nCPI2\nSEFV\nRPR\nRPR\nPDRUG\nHS\nSEFV\nMISS\nAPL\nRPR\nDIAR\n\nb2\n-173.7\n-3.76\n-9.66\n-0.93\n-2.28\n-8.40\n-4.97\n-8.31\n-9.70\n2.83\n\nCPI2\nSEFV\nRPR\nRPR\nLS\nTS\nRPR\nPETS\nAPL\nRPR\nHS\n\nτ2\n2\n12\n6\n8\n6\n13\n3\n13\n9\n4\n\nc\n1148.11\n46.79\n96.99\n13.01\n24.36\n57.75\n77.60\n12.40\n75.37\n1.49\n\nd\n31872\n1358\n2610\n227.5\n733.0\n2180\n1411\n1532\n1909\n-658.8\n\nc\n1198\n46.39\n59.95\n-0.97\n68.38\n90.59\n102.3\n12.46\n72.78\n12.95\n\nd\n32967\n1345\n1584\n250.50\n1937.7\n2433\n2477.7\n1558\n1237.5\n235.2\n\nc\n1169\n44.39\n63.46\n23.20\n35.61\n62.87\n59.65\n39.48\n74.58\n74.88\n\nd\n32260\n1287.6\n1375\n781.5\n1436\n1976.6\n1323\n1967.8\n1350\n1589\n\nSeptember 2008\nCompany\nAIG\nC\nCIT\nFITB\nFNM\nFRE\nLEH\nLM\nMCO\nMS\n\nb1\n-22.10\n-4.26\n-0.77\n-3.07\n-15.39\n-1.14\n-7.37\n-2.62\n3.28\n-0.42\n\n9\n9\n8\n12\n10\n0\n4\n7\n9\n0\n\nτ2\n1\n12\n11\n8\n6\n5\n2\n13\n9\n4\n\nDecember 2008\nCompany\nAIG\nC\nCIT\nFITB\nFNM\nFRE\nLEH\nLM\nMCO\nMS\n\nb1\n-22.34\n-3.74\n2.60\n-3.48\n-5.67\n-2.21\n-5.21\n-7.27\n2.98\n-12.55\n\nCPI1\nDIAR\nFB\nNC\nF\nF\nTS\nF\nF\nDUR\nSEFV\n\nτ1\n9\n9\n12\n7\n8\n0\n5\n5\n9\n3\n\n19\n\nτ2\n1\n13\n13\n11\n0\n13\n0\n13\n10\n10\n\n\fOctober 2009\nCompany\nAIG\nC\nCIT\nFITB\nFNM\nFRE\nLEH\nLM\nMCO\nMS\n\nb1\n-22.79\n-0.59\n4.92\n-4.99\n-15.39\n-1.13\n-7.39\n-5.82\n-12.98\n5.16\n\nCPI1\nDIAR\nDIAR\nHFO\nSEFV\nSEFV\nCOMM\nFB\nFB\nRPR\nHO\n\nτ1\n9\n4\n10\n2\n10\n0\n4\n4\n10\n10\n\nb2\n-156.05\n-5.88\n-9.37\n1.54\n4.64\n-14.12\n-5.29\n-8.18\n3.19\n-9.61\n\nCPI2\nSEFV\nSEFV\nRPR\nHS\nHS\nSEFV\nMISS\nAPL\nMISG\nSEFV\n\nτ2\n0\n5\n12\n6\n6\n5\n2\n13\n8\n3\n\nc\n1066\n38.84\n62.02\n21.86\n68.38\n90.59\n102.3\n32.36\n97.83\n39.62\n\nd\n29580\n1054.8\n1058\n630.7\n1837.7\n2433.8\n2477.7\n1722\n1981\n1017\n\nTable 4 lists 10 models with predicted negative or very close to negative prices as obtained in\nMay, September and December 2008 as well as in October 2009. Figure 3 displays corresponding\npredicted and observed curves between July 2003 and December 2009. American International\nGroup has a very stable model for the entire period as defined by the DIAR and SEFV.\nTheoretically, the company should suffer a rapid drop in share price from ~$1400 to the level of\nabout -$300. In reality, this fall was stopped by a bailout with the share price hovering between $10\nand $50 by the end of 2008 and through 2009. According to all four models the price should start\ngrowing in 2010. It will be an important test for our pricing concept.\nFor Citigroup, the models obtained in 2008 are similar and are based on the indices of food\nand rent of primary residence. Figure 3 demonstrate that negative prices were expected in the end of\n2008. All three models predicted the bottom price at -$30. In October 2009, the defining CPI\ncomponents are different as the model tries to describe the price near $2.\nThe history of CIT Group (CIT) includes two attempts of bailout and a bankruptcy in\nNovember 2009 with a total debt of $10 billion. In Figure 3, the May 2008 model predicts a very\ndeep fall in the share price. Other two models in 2008 demonstrate just a modest fall below the zero\nline. The bailouts have likely biased the October 2009 model and it predicts the company to recover\nin 2010. It would be a good exercise similar to that for the AIG model. Unfortunately, the history\nof CIT Group has ended with a bankruptcy, as expected.\nFanny Mae and Freddie Mac were both bailed out in September 2008. As depicts Figure 3, the\nmodels between May and December 2008 are all different. However, all of them predicted negative\nprices. The models for FNM imply the bottom price level of -$50 to -$60 and the pivot point\nsomewhere in 2009. The models for FRE do predict negative prices with the bottom at -$30, but\nonly the September model has a pivot point.\nLehman Brothers was one of the first giant companies to file for bankruptcy protection in\nSeptember 2008. The May 2009 model does predict negative prices in the beginning of 2009. The\n20\n\n\fSeptember and December 2009 models are likely biased by the bankruptcy but both indicate a deep\nfall in the price. It is important to stress that the bottom price for LEH was predicted at -$20 with a\nquick return into the positive zone. Therefore, the risk might be overestimated.\nThe models predicted for FITB, LM, MCO and MS are presented to emphasize the problem of\nresolution and selection of a valid model. For these four companies there is at least one model\npredicting negative or very close to zero prices. In reality, no one of them has touched the zero line.\nMoreover, they have not been falling since the end of 2008. So, in order to obtain an accurate\nprediction one should the best resolution, which might be guaranteed by the higher possible\ndynamic range. The 2008 crisis and the following recovery allowed the biggest change in the S&P\nshare prices. Hence, the models obtained in 2010 have to be the most resolved and thus the most\nreliable. Good news is that these models will be valid in the future, but with different coefficients\n(Kitov, 2010).\n2000\n\n60\n\n1600\n\n40\n\n1200\n800\n400\n0\n2003\n\n$\n\n$\n\n20\n\nAIG\nMay 2008\nSeptember 2008\nDecember 2008\nOctober 2009\n2005\n\n2007\n\n0\n2003\n\nC\nMay 2008\nSeptember 2008\nDecember 2008\nOctober 2009\n2005\n\n2009\n\n2009\n\n2011\n\n2009\n\n2011\n\n-40\ncalendar year\n\n80\n\n60\n\n60\n\n50\n\n40\n\n40\n30\n\n$\n\n20\n$\n\n20\n\n-60\n\n2011\n\n2011\n\ncalendar year\n\n-40\n\n2009\n\n-20\n\n-400\n\n0\n2003\n-20\n\n2007\n\n2005\n\n2007\n\n2009\n\n10\n\n2011\n\n0\n2003\n-10\n\nCIT\nMay 2008\nSeptember 2008\nDecember 2008\nOctober 2009\n\nFITB\nMay 2008\nSeptember 2008\nDecember 2008\nOctober 2009\n2005\n\n2007\n\n-20\n-30\n\n-80\ncalendar year\n\ncalendar year\n\n100\n\n100\n80\n\n80\n\n60\n\n60\n$\n\n$\n\n40\n20\n0\n2003\n-20\n-40\n-60\n-80\n\n40\n20\n\n2005\n\n2007\n\n2009\n\n2011\n\n0\n2003\n-20\n\nFNM\nMay 2008\nSeptember 2008\nDecember 2008\n\nFRE\nMay 2008\nSeptember 2008\nDecember 2008\n2005\n\n2007\n\n-40\ncalendar year\n\ncalendar year\n\n21\n\n\f100\n\n140\n\n80\n\n120\n100\n\n60\n\n$\n\nLEH\nMay 2008\nSeptember 2008\nDecember 2008\n\n20\n0\n2003\n-20\n\n$\n\n80\n\n40\n\n2005\n\n2007\n\n60\nLM\nMay 2008\nSeptember 2008\nDecember 2008\nOctober 2009\n\n40\n2009\n\n20\n\n2011\n\n0\n2003\n-20\n\n-40\n\n2005\n\ncalendar year\n\n2009\n\n2011\n\n2009\n\n2011\n\ncalendar year\n\n80\n\n100\n80\n\n60\n\nMS\nMay 2008\nSeptember 2008\nDecember 2008\nOctober 2009\n\n60\n\n40\n\n2005\n\n2007\n\n$\n\n$\n\nMCO\nMay 2008\nSeptember 2008\nDecember 2008\nOctober 2009\n\n20\n\n0\n2003\n\n2007\n\n40\n20\n2009\n\n2011\n\n-20\ncalendar year\n\n0\n2003\n\n2005\n\n2007\ncalendar year\n\nFigure 3. Comparison of stock prices for several financial companies as predicted in May,\nSeptember and December 2008, and October 2009\nThere are six companies, all with predicted negative prices but different fate. We have a\nquestion on relative merits of the previous bank bailouts - which bank did deserve a bailout and\nhow much would it really cost? The models in Table 4, although they are only tentative ones and\nshould be used with all necessary precautions, might provide a measure of debt size. One can\nestimate the debt as a product of the number of shares and relevant market price, which was\nnegative for the bailed out and not bailed out companies. Table 5 lists the estimated debts. Lehman\nBrothers had a much smaller debt than that of Citigroup, CIT and AIG. So, it would have been\nmuch easier to bail out LEH from the mathematical point of view. Also, the joint debt of AIG, FRE\nand FNM is less than $200 billion.\nSo, we have answered all questions formulated in the beginning of this Section. When having\nvalid pricing models for the companies under consideration, one could foresee all problems before\nthey become serious and select appropriate measures including bailouts. Moreover, taking into\naccount the deterministic evolution of the CPI and linear trends in the CPI differences (Kitov and\nKitov, 2008), one could predict major problems long before they happen and avoid most of the\n2008/2009 turmoil. For this, financial companies should learn the CPI components defining the\nevolution of their stocks.\n\n22\n\n\fTable 5. Total debt as calculated from negative share prices.\nCompany\n## Shares\nShare price, $\n8\nLEH\n6.89*10\n-20\n9\nC\n1.1*10\n-30\n9\nCIT\n8.12*10\n-20\n8\nAIG\n1.34*10\n-360\n8\nFRE\n6.8*10\n-40\n9\nFNM\n1.11*10\n-50\n\nDebt, $\n1.4*1010\n3.3*1011\n1.6*1011\n1.0*1011\n2.6*1010\n5.5*1010\n\nDiscussion\nA deterministic model has been developed for the prediction of stock prices at a horizon of several\nmonths. The model links the shares of traded companies to consumer price indices. In this paper,\nwe presented empirical models for financial companies from the S&P 500 list. In May 2008, the\nmodel predicted negative share prices in the second half of 2008 for Lehman Brothers, American\nInternational Group, Freddie Mac. With known defining CPI components one could predict the\napproaching bankruptcies. This makes of crucial importance the estimation of correct empirical\nmodels, i.e. defining CPIs, for all shares. When reversed, the model also makes it is possible to\npredict the evolution of various CPI subcategories.\nDespite its apparent opposition to the mainstream concepts, the pricing model is deeply rooted\nin economics: a higher pricing power achieved by a given company should be converted into a\nfaster growth in corresponding consumer price index. This link works excellent for many S&P 500\ncompanies. A further improvement in the model's predictive power is likely possible using\nadvanced methods of statistical and econometrical analysis. However, one should bear in mind that\nthe model will work until its influence on the market is negligible. When a good portion of market\nparticipants uses the model it should fail because the market functioning will be disturbed.\nObserved and predicted share prices are measured variables and the link between them is\nlikely of a causal character during the studied period. Therefore, the mainstream stock pricing\nmodels are, in part, valid – when the evolution of the driving force is random the price is also\nrandom, but predictable.\nAn important possibility arises from our analysis. Using different subsets of the CPI, one can\nimprove our tentative models for the studied companies, and easily obtain similar quantitative\nrelationships for other companies. By extrapolating previously observed trends into the future, one\nmay forecast share prices at various horizons. What likely is more important for a broader investor\ncommunity, the proposed model also allows predicting the turning points between adjacent trends,\nwhen share prices are subject to a substantial decline.\n\n23\n\n\fThe presented results are preliminary ones and do not pretend to provide an optimal price\nprediction. A comprehensive investigation with smaller components of the CPI will likely give\nsuperior results. So, we recommend refining the model in order to obtain accurate quantitative\nresults for actual investment strategies.\n\nAll in all, the lagged differences between two CPI\n\ncomponents provide a good approximation for the evolution of many stock prices.\nOne may pose a question: Why did the researches in economics and finances fail to derive\nthe model many years ago? The answer is a scientific one. There were no appropriate data. First, the\npartition of the headline CPI in hundreds of components is a very new development. Moreover, this\nprocess is ongoing and a researcher obtains a more adequate set of defining variables. This brings\nboth higher resolution and reliability. Second, the reliability critically depends on the dynamic\nrange of data. The crisis of 2008 and 2009 has resulted in a dramatic change in both share prices\nand CPI components. The increased resolution and dynamic range allowed deriving a sound\nquantitative model. There was no chance to find the link between the share prices and CPI before\nthe data allow. This is a general consideration applicable to all economic and financial models –\nadequate data must come first (Kitov, 2009a).\n\nReferences\nBureau of Labor Statistic. (2010). Consumer price index. Table, retrieved 01.02.2010 from\nhttp://www.bls.gov/data/.\nGranger, C., Newbold, P. (1967). Spurious regression in econometrics. Journal of Econometrics, v.\n2, pp. 111-120.\nHendry, D., Juselius, K. (2001). Explaining Cointegration Analysis: Part II. Energy Journal, v. 22,\npp. 75-120\nJohansen, S. (1988). Statistical analysis of cointegrating vectors. Journal of Economic Dynamics and\nControl, v. 12, pp. 231-254.\nKitov, I., (2009a). Does economics need a scientific revolution?, MPRA Paper 14476, University\nLibrary of Munich, Germany.\nKitov, I. (2009b). Predicting ConocoPhillips and Exxon Mobil stock price, Journal of Applied\nResearch in Finance, v., issue 2(2), Winter 2009, pp.129-134.\nKitov, I. (2010). Deterministic mechanics of pricing. Saarbrucken, Germany: LAP LAMBERT\nAcademic Publishing.\nKitov, I., Kitov, O. (2008). Long-Term Linear Trends In Consumer Price Indices, Journal of\nApplied Economic Sciences, Spiru Haret University, Faculty of Financial Management and\nAccounting Craiova, vol. III(2(4)_Summ), pp. 101-112.\nKitov, I., Kitov, O. (2009a). Sustainable trends in producer price indices, Journal of Applied\nResearch in Finance, Spiru Haret University, Faculty of Financial Management and\nAccounting Craiova, vol. I(1(1)_ Summ), pp. 43-51.\nKitov, I., Kitov, O. (2009b). A fair price for motor fuel in the United States, MPRA Paper 15039,\nUniversity Library of Munich, Germany.\n\n24\n\n\fAppendix 1. List of seventy CPI components used in the study; in alphabetic order\nAcronym\nA\nAB\nAPL\nC\nCC\nCE\nCF\nCFSH\nCFSHE\nCM\nCO\nCOMM\nCSH\nDIAR\nDUR\nE\nEC\nED\nF\nFB\nFISH\nFOOT\nFOTO\nFRUI\nFS\nFU\nH\nHFO\nHO\nHOSP\nHS\nITR\nJEW\nLS\nM\n\nDescription\napparel\nalcoholic beverages\nappliances\nCPI\ncore CPI\nCPI less energy\nCPI less food\nCPI less food and shelter\nCPI less food shelter and energy\nCPI less medcare\ncommunication\ncommodities\nCPI less shelter\ndiary products\ndurables\nenergy\neducation and communication\neducation\nfood and beverages\nfood less beverages\nfish\nfootware\nphotography\nfruits and vegetables\nfinancial services\nfuels and utilities (housing)\nhousing\nhousehold furnishing and operations\nhousehold operations\nhospital services\nhousekeeping supplies\nintracity transportation\njewelry and watches\nlegal services\nmedical care\n\n25\n\nAcronym\nMAP\nMCC\nMCS\nMEAT\nMF\nMISG\nMISS\nMVI\nMVP\nMVR\nNC\nNDUR\nO\nORG\nOS\nPC\nPDRUG\nPETS\nR\nRENT\nRPR\nRRM\nRS\nSEFV\nSERV\nSH\nSPO\nT\nTOB\nTPR\nTPU\nTS\nTUIT\nVAA\nWAP\n\nDescription\nmen's and boy's apparel\nmedical care commodities\nmedical care services\nmeats, poultry, and fish\nmotor fuel\nmiscelleneous goods\nmiscellenous services\nmotor vehicle insurance\nmotor vehicle parts\nmotor vehicle repaire\nnew cars\nnondurables\nother goods and services\nother recreation goods\nother services\npersonal care\nprescription drugs\npets and related goods\nrecreation\nrent\nrent primary residence\nrecreational reading materials\nrecreation services\nfood away from home\nservices\nshelter\nsporting goods (apparel)\ntransportation\ntobacco\nprivate transportation\npublic transportation\ntransportation services\ntuition\nvideo and audio\nwomen's and girl's apparel\n\n\fAppendix 2. Empirical 2-C models for S&P 500 financial companies\nCompany\nAIG\nC\nCB\nCINF\nCME\nEQR\nFHN\nFII\nHCBK\nHCP\nHES\nHIG\nHST\nIVZ\nJNS\nKEY\nKIM\nLNC\nLUK\nMCO\nMET\nMI\nMS\nMTB\nNTRS\nPBCT\nPCL\nPFG\nPGR\nPLD\nPRU\nRF\nSLM\nSPG\nSTI\nSTT\nTMK\nTROW\nUNM\nUSB\nVTR\nWFC\nXL\nZION\n\nb1\n\nCPI1\n\nτ1\n\nb2\n\nCPI2\n\nτ2\n\nc\n\nd\n\nσ, $\n\n-191.36 SEFV 1 38.53 PDRUG 13 727.81 21166.78 92.31\n2.94\nHO\n5 -8.26\nSEFV\n2 36.70 1048.90 2.53\n-1.27\nF\n3 -0.41\nO\n313.52\n1.70\n-3 16.53\n-0.06\nTOB -3 -2.79\nSEFV\n486.92\n1.41\n-4 21.53\n-38.62 PETS 0 -30.86\nAB\n10 458.48 8475.35 41.43\n-3.16\nSEFV 3\n1.12 PDRUG 4 11.48\n187.90\n2.14\n1.52\nMCC\n8 -4.10\nSEFV\n340.70\n1.90\n-5 14.30\n1.49\nHO\n12 -1.78\nPETS\n2\n4.02\n38.95\n2.01\n0.03\nE\n1\n0.47\nMISS\n-113.67\n0.83\n-2 -4.43\n1.31\nMCC\n5\n0.30\nFS\n-365.78\n2.10\n-1 -8.35\n3.37\nCSH -2 3.81\nMISS\n-5 -47.75 -1480.90 4.87\n0.53\nTPU 12 -8.35\nPETS\n1 44.41\n741.76\n4.79\n-1.30\nFB\n4 -1.39\nRPR\n11 18.91\n451.01\n1.12\n2.44\nHO\n11 -1.52\nPETS\n3\n-1.04\n-99.66\n1.79\n-2.99\nPETS 2\n3.14\nRPR\n7\n-4.93\n-257.86\n2.63\n-0.36\nDIAR 9 -3.92\nRPR\n11 28.68\n763.73\n1.59\n3.15\nRS\nSEFV\n2 25.07\n454.58\n2.17\n-3 -5.14\n-4.59\nF\n5 -2.35\nTS\n3 41.28 1212.45 3.80\n0.65\nTPR\nMVI\n3\n7.66\n332.12\n3.13\n-2 -1.42\n-0.95 MEAT 4 -8.58\nRPR\n9 69.27 1664.39 3.90\n0.36\nTPU 13 -4.41\nPETS\n2 26.48\n364.93\n2.88\n-2.54\nSEFV 4 -2.44\nRPR\n13 32.35\n850.83\n1.64\n5.27\nHO\n8 -9.75\nSEFV\n2 39.55 1031.57 3.72\n-3.96\nFB\n3 -4.65\nRPR\n11 57.08 1510.23 4.87\n-3.02\nPETS 2\n3.66\nRPR\n5\n-5.16\n-340.09\n3.94\n0.65\nMCC\n7 -0.75\nMVP\n13 0.12\n-82.64\n0.77\n-0.81\nMCC -1 0.57\nFS\n5.27\n79.01\n2.02\n-2\n-3.01\nPETS -2 0.97\nFS\n85.06\n3.55\n-2 14.95\n0.13\nFU\nRPR\n2 11.47\n309.11\n1.29\n-2 -1.74\n-3.09\nPETS -1 1.17\nFS\n42.98\n3.44\n-2 14.18\n-8.13\nPETS 2\n0.18\nTOB\n0 45.25\n723.38\n5.44\n-1.29\nF\nFB\n7 18.09\n554.44\n1.48\n-3 -2.04\n1.91\nPETS 13 -9.31\nRPR\n12 53.36 1490.40 4.12\n-5.78\nF\n3\n0.98\nFS\n693.54\n5.36\n-1 38.82\n-5.70\nFB\n4 -0.16\nTOB\n5 37.05 1010.63 3.65\n5.12\nHO\n11 -4.61\nPETS\n4\n3.78\n-50.41\n5.02\n-8.45\nSEFV 3\n0.77\nHOSP\n2 36.15 1140.20 3.24\n-1.54\nFB\n3 -2.09\nTS\n5 26.41\n644.30\n3.51\n-0.17\nFU\n6 -0.91\nPETS\n2\n8.82\n110.67\n1.56\n-1.10\nFB\n4\n0.32\nFS\n0\n6.26\n117.85\n1.67\n0.45\nFS\n-1.60\nMISS\n8\n18.93\n276.81\n2.41\n-2\n-1.15\nO\nTOB\n0 10.72\n281.54\n2.06\n-3 0.09\n-13.65\nRPR 13 6.35\nMVR\n13 45.24 1413.75 4.37\n-2.19\nF\n4 -8.09\nRPR\n13 67.14 1812.98 3.21\n\n26\n\n\fAppendix 3. Observed and predicted stock prices of S&P 500 financial companies\n60\n\n1900\n\n50\n\n1500\n\n40\n\n$\n\n$\n\n1100\n700\n\nPREDICTED\n\nPREDICTED\n\n10\n\n300\n\n2004\n\nC\n\n20\n\nAIG\n\n-100\n2002\n\n30\n\n2006\n\n2008\n\n0\n2002\n\n2010\n\n2004\n\n60\n\n50\n\n50\n\n40\n\n40\n\n2008\n\n2010\n\n30\nCB\n\n30\n\nCINF\n\n$\n\n$\n\n2006\n\ncalendar year\n\ncalendar year\n\n20\n\nPREDICTED\n\nPREDICTED\n\n20\n10\n10\n0\n2002\n\n2004\n\n2006\n\n2008\n\n0\n2002\n\n2010\n\n2004\n\ncalendar year\n700\n600\n500\n\n2006\n\n2008\n\n2010\n\ncalendar year\n60\n50\n\nCME\nPREDICTED\n\n40\n\n$\n\n$\n\n400\n300\n\n30\n20\n\nEQR\n\n200\n100\n0\n2002\n\nPREDICTED\n\n10\n\n2004\n\n2006\n\n2008\n\n0\n2002\n\n2010\n\n2004\n\ncalendar year\n\n2008\n\n2010\n\ncalendar year\n\n50\n\n50\n\n40\n\n40\n30\n\n30\n$\n\n$\n\nFHN\n\nFII\n\n20\n\nPREDICTED\n\n20\n\nPREDICTED\n10\n\n10\n0\n2002\n\n2006\n\n2004\n\n2006\n\n2008\n\n0\n2002\n\n2010\n\ncalendar year\n\n2004\n\n2006\ncalendar year\n\n27\n\n2008\n\n2010\n\n\f40\n\n15\n\n30\n\n10\n\n$\n\n$\n\n20\n\nHCBK\n\n20\nHCP\n\nPREDICTED\n5\n\nPREDICTED\n\n10\n\n0\n2002\n\n2004\n\n2006\n\n2008\n\n0\n2002\n\n2010\n\n2004\n\ncalendar year\n\n2006\n\n2008\n\n2010\n\ncalendar year\n\n140\n\n100\n\n120\n\n80\n\nHES\n\n100\n\nPREDICTED\n\n60\n$\n\n$\n\n80\n60\n\nHIG\n\n40\n\nPREDICTED\n\n40\n\n20\n\n20\n0\n2002\n\n2004\n\n2006\n\n2008\n\n0\n2002\n\n2010\n\n2004\n\n2006\n\n2008\n\n2010\n\n2008\n\n2010\n\n2008\n\n2010\n\ncalendar year\n\ncalendar year\n\n35\n\n30\n25\n\n30\n\nIVZ\n\n25\n\nPREDICTED\n\n20\n$\n\n$\n\n20\n15\n\n15\n\nHST\n\n10\n\n10\n\nPREDICTED\n5\n0\n2002\n\n5\n\n2004\n\n2006\n\n2008\n\n0\n2002\n\n2010\n\n2004\n\ncalendar year\n\n2006\ncalendar year\n\n40\n\n40\nJNS\n30\n\nPREDICTED\n\n20\n\n$\n\n$\n\n30\n\n20\nKEY\n10\n\n10\n\n0\n2002\n\n2004\n\n2006\n\n2008\n\n0\n2002\n\n2010\n\ncalendar year\n\nPREDICTED\n\n2004\n\n2006\ncalendar year\n\n28\n\n\f80\n\n50\n\n70\n40\n\n60\n50\n\n$\n\n$\n\n30\n20\n\nKIM\nPREDICTED\n\n10\n\n40\n30\n\nLNC\n\n20\n\nPREDICTED\n\n10\n0\n2002\n\n2004\n\n2006\n\n2008\n\n0\n2002\n\n2010\n\n2004\n\n2006\n\n2008\n\n2010\n\n2006\n2008\ncalendar year\n\n2010\n\ncalendar year\n\ncalendar year\n70\n\n80\n\n60\n\n70\n\nLUK\n\n50\n\n60\n\nPREDICTED\n50\n$\n\n$\n\n40\n30\n\n40\n\n20\n\n30\n\n10\n\n20\n\nMCO\nPREDICTED\n\n0\n2002\n\n2004\n\n2006\n\n2008\n\n10\n2002\n\n2010\n\n2004\n\ncalendar year\n\n40\n\n70\n60\n\n30\n\n50\n\n$\n\n$\n\n40\n30\n\n20\n\nMI\n\nMET\n\nPREDICTED\n\nPREDICTED\n\n20\n\n10\n\n10\n0\n2002\n\n2004\n\n2006\n\n2008\n\n0\n2002\n\n2010\n\n2004\n\n2008\n\n2010\n\n2008\n\n2010\n\ncalendar year\n\ncalendar year\n\n70\n\n120\n\n60\n\n100\n\n50\n\n80\n\n$\n\n$\n\n40\n30\n\n60\n\nMTB\n\nMS\n\nPREDICTED\n\n40\n\nPREDICTED\n\n20\n\n20\n\n10\n0\n2002\n\n2006\n\n2004\n\n2006\n2008\ncalendar year\n\n0\n2002\n\n2010\n\n2004\n\n2006\ncalendar year\n\n29\n\n\f90\n\n25\n\n80\n20\n\n70\n60\n\n15\n\n40\n\n$\n\n$\n\n50\n\nPBCT\n\n10\n\nNTRS\n\n30\n\nPREDICTED\n\nPREDICTED\n\n20\n\n5\n\n10\n0\n2002\n\n2004\n\n2006\n\n2008\n\n0\n2002\n\n2010\n\n2004\n\n2006\n\ncalendar year\n\n2008\n\n2010\n\ncalendar year\n\n50\n\n70\n60\n\n40\n50\n30\n$\n\n$\n\n40\n\n20\n\n0\n2002\n\nPREDICTED\n\n2004\n\n2006\n\nPREDICTED\n\n20\n\nPCL\n10\n\nPFG\n\n30\n\n10\n\n2008\n\n0\n2002\n\n2010\n\n2004\n\n2006\n\ncalendar year\n\n2008\n\n2010\n\n2008\n\n2010\n\ncalendar year\n\n30\n\n70\n\n25\n\n60\n50\n\n20\nPGR\n\n$\n\n$\n\n40\n15\n\nPLD\n20\n\n5\n0\n2002\n\n30\n\nPREDICTED\n\n10\n\nPREDICTED\n\n10\n\n2004\n\n2006\n\n2008\n\n0\n2002\n\n2010\n\n2004\n\n2006\n\ncalendar year\n\ncalendar year\n\n120\n\n35\n\n100\n\n30\n25\n\n80\n$\n\n$\n\n20\n60\n40\n\nPRU\n\nRF\n\n10\n\nPREDICTED\n\nPREDICTED\n\n20\n0\n2002\n\n15\n\n5\n\n2004\n\n2006\n\n2008\n\n2010\n\n0\n2002\n\n2004\n\n2006\n\n2008\n\ncalendar year\n\ncalendar year\n\n30\n\n2010\n\n\f70\n\n120\n\n60\n\n100\n\n50\n\n80\n$\n\n$\n\n40\n30\n\nSLM\n\n20\n\n40\n\nSPG\n\nPREDICTED\n\nPREDICTED\n\n20\n\n10\n0\n2002\n\n60\n\n2004\n\n2006\n\n2008\n\n0\n2002\n\n2010\n\n2004\n\ncalendar year\n\n2006\n\n2008\n\n2010\n\ncalendar year\n\n90\n\n100\n\n80\n80\n\n70\n60\n\n60\n$\n\n$\n\n50\n40\n\nSTI\n\n30\n\nPREDICTED\n\n40\nSTT\n\n20\n\n20\n\nPREDICTED\n\n10\n0\n2002\n\n2004\n\n2006\n\n2008\n\n0\n2002\n\n2010\n\n2004\n\ncalendar year\n80\n\n2006\n2008\ncalendar year\n\n2010\n\n70\n\n70\n\n60\n\n60\n\n50\n\n50\n$\n\n$\n\n40\n40\n\nTMK\n\n30\n\n30\n\nPREDICTED\n\n20\n10\n0\n2002\n\n2004\n\n2006\n\n2008\n\n20\n\nTROW\n\n10\n\nPREDICTED\n\n0\n2002\n\n2010\n\n2004\n\n2006\n\n2008\n\n2010\n\ncalendar year\n\ncalendar year\n30\n\n40\n\n25\n30\n\n15\n\n$\n\n$\n\n20\n\nUSB\n\n10\n\nUNM\n\n2004\n\n2006\n\n2008\n\nPREDICTED\n\n10\n\nPREDICTED\n\n5\n0\n2002\n\n20\n\n2010\n\n0\n2002\n\ncalendar year\n\n2004\n\n2006\n\n2008\n\ncalendar year\n\n31\n\n2010\n\n\f40\n\n50\n40\n\n30\n\n$\n\n$\n\n30\n20\n\n20\n\nWFC\n\nVTR\nPREDICTED\n\n10\n0\n2002\n\n2004\n\n2006\n\n2008\n\nPREDICTED\n\n10\n\n0\n2002\n\n2010\n\n2004\n\n120\n\n2008\n\n2010\n\n2008\n\n2010\n\n90\n80\n\n100\n\nXL\n\n70\n\nPREDICTED\n\n80\n\n60\n50\n\n60\n\n$\n\n$\n\n2006\ncalendar year\n\ncalendar year\n\n40\n40\n\nZION\n\n30\n\nPREDICTED\n\n20\n\n20\n\n10\n0\n2002\n\n2004\n\n2006\n\n2008\n\n2010\n\n0\n2002\n\ncalendar year\n\n2004\n\n2006\ncalendar year\n\n32\n\n\fAppendix 4. Empirical models, as of May 2008.\nCompany\nCB\nCINF\nCME\nEQR\nFHN\nFII\nHCBK\nHCP\nHES\nHIG\nIVZ\nJNS\nKEY\nKIM\nLNC\nLUK\nMCO\nMET\nMI\nMTB\nNTRS\nPBCT\nPCL\nPFG\nPGR\nPLD\nPRU\nRF\nSLM\nSPG\nSTI\nSTT\nTMK\nTROW\nUNM\nUSB\nVTR\nWFC\nXL\nZION\n\nb1\n-0.39\n-2.09\n6.79\n3.33\n-6.62\n2.27\n0.07\n4.91\n-7.91\n-5.74\n-0.46\n1.14\n-3.14\n0.98\n3.12\n-4.26\n3.69\n-1.56\n-0.86\n-7.20\n-1.10\n-0.73\n-0.22\n1.57\n0.40\n-2.16\n2.00\n-3.31\n4.67\n15.04\n-8.07\n-3.79\n1.22\n1.54\n-1.09\n-0.04\n1.04\n-1.62\n-2.86\n-3.22\n\nCPI1\nFISH\nF\nTOB\nMVP\nSEFV\nDUR\nTOB\nR\nHO\nRPR\nMEAT\nDUR\nRPR\nPDRUG\nMVP\nVAA\nDUR\nSH\nFB\nRPR\nMEAT\nO\nFU\nAPL\nMVI\nFB\nPDRUG\nRPR\nVAA\nR\nSEFV\nSERV\nMCC\nEC\nFB\nE\nMCC\nF\nO\nAB\n\nτ1\n8\n8\n6\n5\n4\n10\n13\n5\n5\n7\n7\n11\n6\n6\n4\n8\n9\n11\n3\n11\n8\n3\n6\n3\n9\n4\n13\n13\n12\n5\n0\n11\n8\n0\n4\n1\n4\n13\n12\n3\n\nb2\n-2.48\n-3.41\n-169.02\n-5.53\n1.02\n-1.54\n-0.25\n0.94\n17.05\n2.65\n-0.39\n-2.97\n0.98\n2.00\n-10.95\n1.74\n-9.51\n1.13\n-5.19\n-3.57\n0.45\n0.38\n-0.16\n6.50\n1.45\n-1.02\n-1.65\n-1.89\n-6.52\n-5.63\n1.57\n5.71\n0.59\n0.75\n-0.84\n-1.23\n0.85\n-1.38\n2.95\n-7.99\n\n33\n\nCPI2\nRS\nPC\nSEFV\nRPR\nPDRUG\nHS\nPDRUG\nOS\nSEFV\nPDRUG\nMVI\nFOTO\nPDRUG\nFOTO\nSEFV\nOS\nRPR\nPDRUG\nSEFV\nMISS\nDIAR\nPDRUG\nTPU\nFOTO\nRRM\nFS\nHOSP\nRRM\nRPR\nPETS\nPDRUG\nHO\nITR\nPDRUG\nMCC\nMISS\nFS\nFB\nPDRUG\nRPR\n\nτ2\n13\n1\n6\n6\n8\n1\n9\n3\n9\n13\n4\n5\n11\n11\n4\n13\n8\n12\n4\n12\n2\n7\n0\n13\n12\n13\n4\n3\n13\n3\n11\n11\n8\n13\n4\n12\n10\n0\n11\n13\n\nc\n17.32\n27.78\n1014.46\n31.91\n25.99\n11.38\n3.12\n-9.23\n-44.26\n17.33\n8.04\n-4.86\n11.84\n0.13\n61.51\n-5.82\n75.41\n4.74\n37.48\n87.49\n11.12\n4.68\n7.81\n25.34\n-5.52\n26.75\n31.56\n25.57\n41.17\n24.43\n35.94\n8.40\n-9.63\n-4.58\n14.36\n15.68\n-7.35\n18.21\n-14.86\n70.08\n\nd\n335.17\n906.09\n23534.41\n670.54\n810.51\n-48.93\n45.50\n-713.62\n-1925.87\n307.40\n181.92\n183.10\n304.61\n-496.62\n1455.18\n46.26\n1232.98\n-22.58\n979.40\n2180.14\n102.13\n81.62\n59.81\n-840.96\n-368.27\n547.08\n-71.92\n967.64\n706.86\n-1021.99\n893.58\n131.84\n-348.07\n-370.49\n374.29\n307.26\n-430.76\n491.21\n19.28\n1989.05\n\n\f"}