{"id": "http://arxiv.org/abs/0904.0761v1", "guidislink": true, "updated": "2009-04-05T11:52:35Z", "updated_parsed": [2009, 4, 5, 11, 52, 35, 6, 95, 0], "published": "2009-04-05T11:52:35Z", "published_parsed": [2009, 4, 5, 11, 52, 35, 6, 95, 0], "title": "How groups can foster consensus: The case of local cultures", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0904.4595%2C0904.4445%2C0904.4443%2C0904.4751%2C0904.0561%2C0904.4706%2C0904.4220%2C0904.0977%2C0904.0111%2C0904.0874%2C0904.0761%2C0904.2990%2C0904.2024%2C0904.2175%2C0904.2574%2C0904.2366%2C0904.3608%2C0904.3916%2C0904.2176%2C0904.0946%2C0904.2275%2C0904.1004%2C0904.4317%2C0904.0013%2C0904.0482%2C0904.0063%2C0904.3269%2C0904.3263%2C0904.4570%2C0904.3173%2C0904.1422%2C0904.4531%2C0904.1052%2C0904.0339%2C0904.2432%2C0904.3966%2C0904.0441%2C0904.4813%2C0904.2648%2C0904.2881%2C0904.0492%2C0904.3783%2C0904.3418%2C0904.4522%2C0904.1099%2C0904.1694%2C0904.2631%2C0904.3044%2C0904.3054%2C0904.1910%2C0904.4892%2C0904.0653%2C0904.2484%2C0904.2629%2C0904.0681%2C0904.3730%2C0904.1431%2C0904.0950%2C0904.3348%2C0904.3328%2C0904.3229%2C0904.0936%2C0904.3885%2C0904.4821%2C0904.2513%2C0904.0141%2C0904.3761%2C0904.1934%2C0904.4382%2C0904.0416%2C0904.1223%2C0904.1777%2C0904.4028%2C0904.0539%2C0904.4137%2C0904.0971%2C0904.2128%2C0904.0296%2C0904.3636%2C0904.3487%2C0904.4621%2C0904.2284%2C0904.2611%2C0904.4772%2C0904.4689%2C0904.0544%2C0904.3929%2C0904.4628%2C0904.4698%2C0904.0246%2C0904.1504%2C0904.1476%2C0904.3265%2C0904.4353%2C0904.1675%2C0904.3713%2C0904.3255%2C0904.2417%2C0904.4901%2C0904.2151%2C0904.2478&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "How groups can foster consensus: The case of local cultures"}, "summary": "A local culture denotes a commonly shared behaviour within a cluster of\nfirms. Similar to social norms or conventions, it is an emergent feature\nresulting from the firms' interaction in an economic network. To model these\ndynamics, we consider a distributed agent population, representing e.g. firms\nor individuals. Further, we build on a continuous opinion dynamics model with\nbounded confidence ($\\epsilon$), which assumes that two agents only interact if\ndifferences in their behaviour are less than $\\epsilon$. Interaction results in\nmore similarity of behaviour, i.e. convergence towards a common mean. This\nframework is extended by two major concepts: (i) The agent's in-group\nconsisting of acquainted interaction partners is explicitly taken into account.\nThis leads to an effective agent behaviour reflecting that agents try to\ncontinue to interact with past partners and thus to keep sufficiently close to\nthem. (ii) The in-group network structure changes over time, as agents can form\nnew links to other agents with sufficiently close effective behaviour or delete\nlinks to agents no longer close in behaviour. Thus, our model provides a\nfeedback mechanism between the agents' behaviour and their in-group structure.\nStudying its consequences by means of agent-based computer simulations, we find\nthat for narrow-minded agents (low $\\epsilon$) the additional feedback helps to\nfind consensus more often, whereas for open-minded agents (high $\\epsilon$)\nthis does not hold. This counterintuitive result is explained by simulations of\nthe network evolution.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0904.4595%2C0904.4445%2C0904.4443%2C0904.4751%2C0904.0561%2C0904.4706%2C0904.4220%2C0904.0977%2C0904.0111%2C0904.0874%2C0904.0761%2C0904.2990%2C0904.2024%2C0904.2175%2C0904.2574%2C0904.2366%2C0904.3608%2C0904.3916%2C0904.2176%2C0904.0946%2C0904.2275%2C0904.1004%2C0904.4317%2C0904.0013%2C0904.0482%2C0904.0063%2C0904.3269%2C0904.3263%2C0904.4570%2C0904.3173%2C0904.1422%2C0904.4531%2C0904.1052%2C0904.0339%2C0904.2432%2C0904.3966%2C0904.0441%2C0904.4813%2C0904.2648%2C0904.2881%2C0904.0492%2C0904.3783%2C0904.3418%2C0904.4522%2C0904.1099%2C0904.1694%2C0904.2631%2C0904.3044%2C0904.3054%2C0904.1910%2C0904.4892%2C0904.0653%2C0904.2484%2C0904.2629%2C0904.0681%2C0904.3730%2C0904.1431%2C0904.0950%2C0904.3348%2C0904.3328%2C0904.3229%2C0904.0936%2C0904.3885%2C0904.4821%2C0904.2513%2C0904.0141%2C0904.3761%2C0904.1934%2C0904.4382%2C0904.0416%2C0904.1223%2C0904.1777%2C0904.4028%2C0904.0539%2C0904.4137%2C0904.0971%2C0904.2128%2C0904.0296%2C0904.3636%2C0904.3487%2C0904.4621%2C0904.2284%2C0904.2611%2C0904.4772%2C0904.4689%2C0904.0544%2C0904.3929%2C0904.4628%2C0904.4698%2C0904.0246%2C0904.1504%2C0904.1476%2C0904.3265%2C0904.4353%2C0904.1675%2C0904.3713%2C0904.3255%2C0904.2417%2C0904.4901%2C0904.2151%2C0904.2478&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "A local culture denotes a commonly shared behaviour within a cluster of\nfirms. Similar to social norms or conventions, it is an emergent feature\nresulting from the firms' interaction in an economic network. To model these\ndynamics, we consider a distributed agent population, representing e.g. firms\nor individuals. Further, we build on a continuous opinion dynamics model with\nbounded confidence ($\\epsilon$), which assumes that two agents only interact if\ndifferences in their behaviour are less than $\\epsilon$. Interaction results in\nmore similarity of behaviour, i.e. convergence towards a common mean. This\nframework is extended by two major concepts: (i) The agent's in-group\nconsisting of acquainted interaction partners is explicitly taken into account.\nThis leads to an effective agent behaviour reflecting that agents try to\ncontinue to interact with past partners and thus to keep sufficiently close to\nthem. (ii) The in-group network structure changes over time, as agents can form\nnew links to other agents with sufficiently close effective behaviour or delete\nlinks to agents no longer close in behaviour. Thus, our model provides a\nfeedback mechanism between the agents' behaviour and their in-group structure.\nStudying its consequences by means of agent-based computer simulations, we find\nthat for narrow-minded agents (low $\\epsilon$) the additional feedback helps to\nfind consensus more often, whereas for open-minded agents (high $\\epsilon$)\nthis does not hold. This counterintuitive result is explained by simulations of\nthe network evolution."}, "authors": ["Patrick Groeber", "Frank Schweitzer", "Kerstin Press"], "author_detail": {"name": "Kerstin Press"}, "author": "Kerstin Press", "links": [{"href": "http://arxiv.org/abs/0904.0761v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0904.0761v1", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "physics.soc-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "physics.soc-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0904.0761v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0904.0761v1", "arxiv_comment": null, "journal_reference": "Journal of Artificial Societes and Social Simulationsn vol 12, no\n  2/4 (2009)", "doi": null, "fulltext": "Patrick Groeber, Frank Schweitzer, Kerstin Press:\nHow groups can foster consensus - The case of local cultures\nJournal of Artificial Societes and Social Simulationsn vol 12, no 2/4 (2009)\nSee http://www.sg.ethz.ch for more information.\n\nHow groups can foster consensus:\nThe case of local cultures\n\narXiv:0904.0761v1 [physics.soc-ph] 5 Apr 2009\n\nPatrick Groeber, Frank Schweitzer, Kerstin Press\nChair of Systems Design, ETH Zurich, Kreuzplatz 5, 8032 Zurich, Switzerland\n{pgroeber,fschweitzer,kpress}@ethz.ch\nAbstract\nA local culture denotes a commonly shared behaviour within a cluster of firms. Similar to\nsocial norms or conventions, it is an emergent feature resulting from the firms' interaction in\nan economic network. To model these dynamics, we consider a distributed agent population,\nrepresenting e.g. firms or individuals. Further, we build on a continuous opinion dynamics\nmodel with bounded confidence (ε), which assumes that two agents only interact if differences\nin their behaviour are less than ε. Interaction results in more similarity of behaviour, i.e.\nconvergence towards a common mean. This framework is extended by two major concepts:\n(i) The agent's in-group consisting of acquainted interaction partners is explicitly taken into\naccount. This leads to an effective agent behaviour reflecting that agents try to continue to\ninteract with past partners and thus to keep sufficiently close to them. (ii) The in-group\nnetwork structure changes over time, as agents can form new links to other agents with\nsufficiently close effective behaviour or delete links to agents no longer close in behaviour.\nThus, our model provides a feedback mechanism between the agents' behaviour and their ingroup structure. Studying its consequences by means of agent-based computer simulations,\nwe find that for narrow-minded agents (low ε) the additional feedback helps to find consensus\nmore often, whereas for open-minded agents (high ε) this does not hold. This counterintuitive\nresult is explained by simulations of the network evolution.\nKeywords: Social Norms, Conventions, Bounded Confidence, Dynamic Networks\n\n1\n\nIntroduction\n\nSince the early 1990s, economic theory and policy has dedicated a lot of attention to the causes\nand effects of clusters, i.e. spatial concentrations of firms in one or a few related industries\n(Ellison and Glaeser, 1997). Driven by their impressive prosperity, the factors underlying cluster\nsuccess were extensively studied in the hope of replicating areas like the Silicon Valley or London.\nLocating in a cluster provides several benefits for firms. However, the existence of these benefits\nhinges on a set of rules on acceptable business practice – the cluster's 'local culture'. For instance,\nthere is a rule among banks located in Frankfurt that they should not hire personnel away from\ncompetitors. In the Silicon Valley, the local culture is such that firms openly exchange ideas even\nwith direct competitors. In order to partake in the cluster and its dynamics, firms need to respect\nthese rules, which has made it difficult for outside companies (e.g. multinational enterprises) to\ntap into the cluster through subsidiaries While some work has been conducted to determine the\n\n1/22\n\n\fPatrick Groeber, Frank Schweitzer, Kerstin Press:\nHow groups can foster consensus - The case of local cultures\nJournal of Artificial Societes and Social Simulationsn vol 12, no 2/4 (2009)\nSee http://www.sg.ethz.ch for more information.\n\nnature and enforcement of such local cultures, their emergence remains far from understood.\nSo far, anecdotal evidence suggests that it depends on agreement about the nature of desirable\nbusiness practice.\nTo shed light on the emergence of local cultures, the present paper studies the emergence of\nthe initial consensus. It argues that cluster firms have to interact with each other. As these\ninteractions are not cost-free, they give rise to changes in firm behaviour and different interfirm networks that affect the future behaviour of constituent firms. Both mechanisms can lead\nto convergent or divergent behaviour. Those cases finding converging behaviour among all or a\nmajority of cluster firms constitute situations in which the basis for a local culture emerges. This\nis also important for the emergence of clustering benefits and therefore the economic viability\nof the cluster. To study the emergence of converging behaviour (i.e. the first step towards a\nlocal culture), this paper develops an opinion dynamics model with bounded confidence and\ngroup-influence as both aspects are required to mimic the dynamics of inter-firm interaction in\nclusters.\nIn doing so, the paper proceeds as follows. Section 2 describes the case under study. The emergence and effect of local cultures is found to be similar to that of norms and conventions as both\nare means to solve co-ordination and cooperation problems. However, the costliness of inter-firm\ninteractions requires some amendments to existing models (section 3). In particular, it justifies\nthe application of a bounded confidence model introduced in section 4: Agents (= firms) will only\ninteract if they are sufficiently close in their behaviour as the risk of a costly transaction going\nwrong are too high otherwise. Moreover, agents are linked by ties stemming from previous interactions. Thanks to costly interaction, agents try to maintain these 'in-groups' and modify their\nbehaviour accordingly. Section 5 then presents the findings regarding the conditions for consensual behaviour among all or a majority of agents. It is found that the existence and influence of\nin-groups fosters consensus, especially if agents would only interact with behaviourally similar\nactors. As a result, the nature of inter-firm interactions in clusters is conducive to consensus and\nthereby the emergence of a local culture.\n\n2\n\nDefining local cultures\n\nIn economic geography, local cultures with rules like \"do not hire from competitors\", \"exchange\nideas freely\" or \"deliver only the highest quality\" are a phenomenon characterising clusters\nlike Silicon Valley (IT), London (financial services) or Prato, Italy (textiles). The existence of\nclusters is tied to that of local cultures because the benefits to clustering are subject to various\nco-ordination and co-operation issues that are solved by the rules in the local culture.\nUsually, cluster benefits relate to scale and specialisation effects as well as positive externalities.\nThe former (scale and specialisation) emerge since companies in a cluster usually divide the\nproduction process. Rather than having all firms manufacture shoes, one specialises in soles\n\n2/22\n\n\fPatrick Groeber, Frank Schweitzer, Kerstin Press:\nHow groups can foster consensus - The case of local cultures\nJournal of Artificial Societes and Social Simulationsn vol 12, no 2/4 (2009)\nSee http://www.sg.ethz.ch for more information.\n\nwhile other provide laces, tops, linings and so on (Pyke et al., 1990). This division of labour\nleads to scale and specialisation benefits as firms can achieve a greater output with a limited\nbudget and become more efficient in their activities (Smith, 2003). Second, companies conduct\ncompeting and complementary activities under identical local conditions in the cluster. This\nleads to positive externalities in the diffusion of ideas and the availability of skilled labour.1\nTo generate these benefits, cluster firms have to overcome several dilemmas. For a division\nof labour to emerge, suppliers need a fair price and a sufficient market (Smith, 2003, p. 27).\nMoreover, the quantities provided by different firms have to be aligned. Positive externalities in\nknowledge and personnel are tied to respective investments in research and training. This is only\nviable if defection (free-riding) is limited.2 Akin to famous cooperation problems like the Kula\nRing (Ziegler, 2007) or the Chicago diamond market (Coleman, 1990), the cluster literature\nargues, that these dilemmas are solved by rules on acceptable business practice that make up\nthe local culture. While some work has determined what local cultures look like (e.g. Porter 1990;\nPyke et al. 1990; Saxenian 1994) and how their enforcement can be ensured (Holländer, 1990;\nKandel and Lazear, 1992) their emergence is far less understood.\nIt is usually suggested that firms learn about successful behaviour when interacting with others.\nSuccessful past behaviour is then repeated and possibly copied among firms in the cluster,\nwhich implies that gradually, this behaviour spreads in the population. Once etablished, such\na consensus on \"good\" behaviour creates expectation about others' future behaviour, thereby\nreducing frictions in interaction. Specific rules making up a local culture can finally emerge to\nfoster and enforce this consensual behaviour by monitoring and punishment of defecting agents\n(Maskell, 2001, p. 926). The first step towards a local culture is thus a behaviour that is viewed as\ndesirable enough to become the basis of rule-making. We argue that a good candidate for viable\nrules is a behaviour already prevalent in the cluster, i.e. a behaviour that is shared by (a majority\nof) local firms. As a result, consensus on a certain behaviour constitutes the necessary condition\nfor rule-making, rule enforcing and the emergence of local cultures. This paper investigates how\na consensus on a specific behaviour emerges in a cluster. In doing so, the paper argues that the\ndivision of labour in clusters requires interaction between firms to manufacture the product. As\ninteractions are not cost free (Coase, 1937; Williamson, 1975), two mechanisms come into play.\nFirst, interaction costs increase with the difference in firm behaviour. Firms with similar behaviour are likely to respond similarly to future developments. This makes it unnecessary to\nspecify all possible scenarios in a contract thereby reducing the cost of interaction. If all interactions are equally beneficial, the increasing cost of interaction implies that (a) firms will not\n\n1\n\nCompetitors experiment with different strategies under identical conditions. This allows for direct comparisons\nof performance and selection of best practice. In addition, firms tackling the same or related problems may\nexchange knowledge through various mechanisms (Allen, 1983). Both aspects contribute to knowledge spillovers.\nFinally, many firms in a cluster increase the quality of the local labour pool by training activity and immigration\nof skilled people.\n2\nInvestment research and training requires an understanding that allows firms to capitalise on it, i.e. no\nexploitation of others' efforts or hiring away of personnel trained elsewhere.\n\n3/22\n\n\fPatrick Groeber, Frank Schweitzer, Kerstin Press:\nHow groups can foster consensus - The case of local cultures\nJournal of Artificial Societes and Social Simulationsn vol 12, no 2/4 (2009)\nSee http://www.sg.ethz.ch for more information.\n\ninteract with all possible partners and (b) the partners to an interaction modify their behaviour\nto become more similar. Second, costly interactions make it beneficial to maintain links with\nexisting partners. Firms therefore become more embedded in networks emerging from their interaction history. Moreover, the desire to maintain these networks may constrain their behaviour\nas firms seek to remain sufficiently similar to existing partners.\nThe consensus resulting from these mechanisms (if any) can take very different forms. It can\nreside with a behaviour that is very co-operative, i.e. every firm strongly invests in activities\nsubject to externalities and supplier-buyer relations are characterised by fairness. Such a situation provides high incentives to free-ride implying that this behaviour is not self-enforcing. In\nother instances, consensus can reside with very defective behaviour where all firms try to exploit\none another as much as possible and do not investment in activities with externalities. This\nsituation would provide no incentive for deviation (at least not to an individual firm), i.e. the\nlocal culture is self-enforcing.\n\n3\n\nLocal cultures as norms or conventions\n\nOnce established, local cultures fulfill the function of social norms or conventions insofar as they\nsolve co-operation or co-ordination problems. As a result, their emergence mimics that of norms\nand conventions, which unfolds as follows: The first stage is build on consensus formation, where\nagents reach consensus on a certain behaviour through different mechanisms like optimising\nbehaviour (Opp, 1982; Weber, 1999), imitating or replicating successful strategies (Asch, 1956;\nSherif, 1973) or through trial and error search (Demsetz, 1967). Once the consensual behaviour\nspreads and remains in the population, it creates expectations about everyone's future behaviour,\nwhich reduce friction in interactions (Axelrod, 1986; Koford and Miller, 1991; Sugden, 1989).\nDepending on whether the behaviour is self-enforcing (convention) or not (norm), the second\nstage of the process differs. For conventions, the emergence of consensus is sufficient. In case of\nnorms behavioural regularities have to result in a sense of \"oughtness\" (Opp, 2001) that may\neventually lead to an enforceable norm prescribing this behaviour: \"Thus, patterns of action\nemerge that then become normative [...]. Individuals comply with the new norm both for the\noriginal reason that the behaviour was appealing, and also because it is now socially enforced\"\n(Horne, 2001, p. 6).\nDepending on the nature of consensual behaviour (self-enforcing or not), local cultures correspond to conventions or social norms. In either case, the first stage of their emergence process\n(consensus building) is identical. This makes models on the emergence of norms or convention\napplicable to our case. In the literature, most work on norms and conventions is based on gametheory with a smaller subset of research studying consensus formation (through voter models or\nbounded confidence approaches). The game-theoretic approach to norms and conventions (Fehr\nand Fischbacher, 2004; Holländer, 1990; Kandel and Lazear, 1992; Ullmann-Margalit, 1977; Voss,\n2001) is not applicable to our case for several reasons. By focussing on the nature of the game\n\n4/22\n\n\fPatrick Groeber, Frank Schweitzer, Kerstin Press:\nHow groups can foster consensus - The case of local cultures\nJournal of Artificial Societes and Social Simulationsn vol 12, no 2/4 (2009)\nSee http://www.sg.ethz.ch for more information.\n\n(e.g. payoff structure, repetition) and underlying agent interaction, individual incentives and\nefficient outcomes are derived. Conventions correspond to situations where the optimal outcome\nis a non-unique Nash equilibrium. Depending on the underlying mechanisms, different equilibria\nmay be selected (see e.g. Pujol et al., 2005; Shoham and Tennenholtz, 1992). Norms instead\nemerge in situations where the optimal solution is not an equilibrium outcome. The norm is\nviewed as the solution to the problems preventing a better outcome in that particular game.3\nThe focus on payoffs and incentives implies that there is a known optimal behaviour. In other\nwords, agents know the consequences of their actions, anticipate the choices of others and are\nthereby able to determine, what kind of behaviour leads to efficient outcomes. In the Prisoner's\nDilemma situation, cooperation is the ex-ante optimal behaviour when jointly maximising the\nplayers' outcome. Moreover, game theory is less concerned with the emergence of a particular\nnorm or convention but rather with its effect for the game's equilibrium outcomes. Since we\ncannot determine ex-ante payoff values for business strategy and our concern resides more with\nthe emergence than the effect of local cultures, game-theoretic models are not suited for our research question. We therefore focus on an approach that does not assume an 'optimal' behaviour\nbut where the value of an agent's behaviour only depends on the number of agents adhering to\nit and on that behaviour's compliance with the predominant behaviour in the agent's personal\nnetwork. In this sense, any consensus among all agents is 'good' - regardless of the nature of\nconsensual behaviour.\nThere are several models studying the emergence of consensus from agent interaction (Axelrod,\n1997; Deffuant et al., 2000; DeGroot, 1974; Hegselmann and Krause, 2002; Lehrer and Wagner,\n1981). They fall into two main classes: Voter models and bounded confidence models. In voter\nmodels, agents are characterised by a discrete opinion (a binary variable in most cases) and\nare embedded in a network of given topology. They may adopt other opinions according to\ntheir frequency in the agent's neighborhood. In linear voter models, the transition towards a\ngiven opinion is directly proportional its local frequency. In non-linear voter models other types\nof frequency dependent behaviour are possible (Schweitzer, 2007). While consensus is always\nreached in linear voter models, non-linear responses to the local frequency of an opinion may\nprevent (Schweitzer and Behera, 2009) or accelerate (Stark et al., 2008a,b) consensus.4\nAnother class of consensus models deals with continuous opinions xi represented as a real\nnumber between 0 and 1 (Deffuant et al., 2000). Two agents i and j, randomly chosen at each\n\n3\n\nCandidate mechanisms are repeated games, reputation formation, signalling mechanisms or punishment\n(Nowak, 2006). To be effective, consensus about the behaviour that ought to be adopted is needed (e.g. cooperation). To some, this would already constitute a norm (Opp, 2001). In addition to strong information requirements,\ngame-theoretic approaches thus need a general co-operation 'norm' to identify defectors.\n4\nStark et al. (2008a,b) have discussed a modification of the linear voter model, where agents become more\nreluctant to change their current opinion the longer they have it. It was shown that this deceleration of the\nindividual dynamics may, for certain growth rates of the reluctance, even accelerate the formation of consensus on\nthe system's level. This counterintuitive result is partly due to the agent's heterogeneity, i.e. differences in their\nindividual behaviour.\n\n5/22\n\n\fPatrick Groeber, Frank Schweitzer, Kerstin Press:\nHow groups can foster consensus - The case of local cultures\nJournal of Artificial Societes and Social Simulationsn vol 12, no 2/4 (2009)\nSee http://www.sg.ethz.ch for more information.\n\ntimestep, can only interact if the difference in their opinion does not exceed a threshold value\nε. Rather than taking place on a predifined network, agent interactions are randomised and\nconditional here. This mechanism of 'bounded confidence' is applied by Hegselmann and Krause\n(2002) where all possible interactions take place simultaneously. As investigated by means of\nseveral approaches (e.g. Ben-Naim et al., 2003; Lorenz, 2006) consensus then largely depends on\nthe value of the key parameter ε.5\nOur model, formalized in the following section, builds on the bounded confidence approach, but\ncombines it with the consideration of the dynamics in an agent's social network. Dependent\non the relationship between i and j, we distinguish between an in-group (members of a social\nnetwork seen as friends) and an out-group (members with adversary relations, enemies as in Fent\net al. (2007)).6 In addition to in-group relations within a social network, we include a dynamics of\nthe agents' social network. This is based on a feedback mechanism between an agent's behaviour\nand her personal network: past interactions with partners from the agent's in-group affect her\nindividual behaviour which in turn influences the structure of the in-group, iteratively. Hence,\nas the novel element, our model combines both opinion dynamics and network dynamics at the\nlevel of individual agents.\nBoth aspects relate to the fact that interaction between agents is not cost-free. First, we argued\nthat costs increase with differences in agent behaviour since many actions are beneficial as long\nas both agents behave in the same way.7 As a consequence, interactions are conditional on\nsufficient behavioural similarity. Moreover, interacting agents approach each other's behaviour\nto lower interaction cost. Second, costly interactions make keeping past partners very beneficial.\nAs a result, agents will want to keep their past partners (their in-group) and will modify their\nbehaviour accordingly. The behaviour of the group will therefore determine the possible range\nof agent behaviour. Conversely, agent behaviour feeds back on her in-group and therefore allows\nfor changes in group structure as a function of interaction and behavioural dynamics. Section 4\nprovides more detail on the formal treatment of these mechanisms.\n\n4\n\nModelling the emergence of consensual behaviour\n\nWe argued before that costly interactions result in two effects, (i) consensus formation, i.e. optimising behaviour within a group to avoid friction, and (ii) network formation, i.e. optimising\n\n5\n\nDeffuant et al. (2005) incorporate an extension of the bounded confidence mechanism in a model of innovation\ndiffusion. For a survey of results on bounded confidence models see Lorenz (2007).\n6\nFent et al. (2007) have investigated the role of in- and out-group interaction (in a fixed network) for the\nemergence of social norms. Under certain conditions, convergence towards a single norm, coexistence of two\nopposing norms, and coexistence of a multitude of norms can be found. The key element in this dynamics was a\nlocal utility maximization, where agent i tends to maximise similarities with her in-group, while minimising the\ndisutilities from the out-group in her social network.\n7\nThe greatest losses often result from diverging strategies (e.g. prisoner's dilemma).\n\n6/22\n\n\fPatrick Groeber, Frank Schweitzer, Kerstin Press:\nHow groups can foster consensus - The case of local cultures\nJournal of Artificial Societes and Social Simulationsn vol 12, no 2/4 (2009)\nSee http://www.sg.ethz.ch for more information.\n\nthe agents' social network structure by deleting links with agents whose behaviour largely deviates from one's own, thus making interaction more costly (or creating links with agents whose\nbehaviour is more similar). The two interlinked dynamics are specified as follows.\nConsensus formation. In order to reflect the first consequence of costly interactions, we need\na model that makes interaction conditional on agent behaviour. Following Deffuant et al. (2000),\nagent i's behaviour xi is represented as a real number between 0 and 1. Thus, we are able to\nmeasure the distance between two agents behaviour and to model a gradual approach if these\nagents interact. This is different to the cultural dissemination framework of Axelrod (1997)\nwhere cultures constitute a finite, discrete and in general non-metric set. There, interaction\nbetween two agents can only lead to complete assimilation of behaviour for one of them, whereas\nagents approach each other's behaviour in our model. We further define the behaviour profile\nx = (x1 , ..., xn ).\nIn our model, in accordance with Deffuant et al. (2000), two agents i and j are randomly chosen\nat each timestep. They can only interact if the difference in their behaviour does not exceed a\nthreshold value ε which can be regarded as a measure of openness. Regarding agent interaction,\nwe can also interpret ε as the difference in behaviour where the costs and benefits break even:\nWith greater behavioural differences, interaction costs would increase while the benefits are\nassumed to be constant. Such an interaction would lead to a net cost to the agents involved and\nwill therefore not occur.8 As the benefits and costs are identical for all agents, the necessary\ncondition for an interaction of i and j becomes:\n|xi (t) − xj (t)| < ε.\n\n(1)\n\nIf two agents interact, they try to maximise the benefits of this exchange. As benefits are constant\nand costs decrease with behavioural differences, the behaviour of interacting agents becomes\nmore similar as both approach each other by identical amounts:\nxi (t + 1) = xi (t) + μ(xj (t) − xi (t))\nxj (t + 1) = xj (t) + μ(xi (t) − xj (t)).\n\n(2)\n\nThe speed of approach in behaviour depends on the parameter μ. It reflects the well established\nphenomenon that interacting parties become more similar (e.g. Axelrod 1997; Macy and Skvoretz\n1998; McPherson et al. 2001; Strang and Soule 1998).\nThe dynamics specified by Eqs. (1), (2) are referred to as the baseline model in the following, as\nthey result in the known behaviour already discussed by Deffuant et al. (2000). We now extend\nthis model by introducing the second aspect: Costly interactions imply benefits to keeping past\npartners. This is modelled by aggregating each agent's past interaction partners. Each agent i\nthus has a set Ii of other agents constituting her in-group, i.e. the agent's acquainted partners.\nAs the agent would like to interact with these partners later, she tries to keep her behaviour\n\n8\n\nAs in Moscovici and Doise (1992) where opinions too far from the majority don't enter group discussion.\n\n7/22\n\n\fPatrick Groeber, Frank Schweitzer, Kerstin Press:\nHow groups can foster consensus - The case of local cultures\nJournal of Artificial Societes and Social Simulationsn vol 12, no 2/4 (2009)\nSee http://www.sg.ethz.ch for more information.\n\nsufficiently similar to them. As agent behaviour changes with her interactions, we argue that the\nin-group exerts an influence on the agent's future interactions. This is achieved by combining\nan agent's behaviour xi and the mean behaviour of her in-group x̄Ii (t) to determine the effective\nbehaviour\n\u0001\nxeff\n(3)\ni (t) = 1 − αi (t) xi (t) + αi (t)x̄Ii (t)\n\nat time t. The use of the mean behaviour is chosen to mirror that the agent is equally interested\nin interacting with any of her past partners.9\n\nIn Eq. (3), αi ∈ [0, 1] corresponds to the influence of agent i's in-group on her effective behaviour.\nWe use this parameter to mirror the strength of group influence. Based on the aforementioned\nnotion that agents like to keep their past partners, the influence of the group would increase\nwith its size. In this model, we define αi endogenously by\nαi (t) =\n\n|Ii (t)|\n.\n|Ii (t)| + 1\n\n(4)\n\nHence, we assume that each agent puts equal weight on her own and each in-group member's\nbehaviour. If i has never interacted with another agent, her in-group is empty (|Ii | = 0) implying\nαi = 0. Hence, the effective behaviour of agent i is then identical to her behaviour (xeff\ni = xi ).\nFurther, αi approaches 1 with growing in-group size |Ii |. If the in-group is large, i's effective\nbehaviour will therefore tend towards the average in-group behaviour.\nIn our model, two agents wanting to interact now have to compare the distance between their\neffective behaviour (influenced by their respective in-groups) instead of that of their own behaviour. As a result, the necessary condition for interaction between agents becomes\neff\n|xeff\ni (t) − xj (t)| < ε.\n\n(5)\n\neff\nIf two agents with empty in-groups interact, this is identical to Eq. (1) as xeff\ni = xi and xj = xj\nfor Ii = Ij = ∅.\n\nNetwork formation. In addition to maintaining their in-group, agents also seek to expand it\nwith suitable new partners. To specify this, we assume that in-groups are initially empty for all\nagents. Later, they evolve according to the agents' interactions as follows: In each simulation\nstep, two agents i and j are randomly selected. If Eq. (5) holds for them, they interact and\nare added to each other's in-group (if they are not already contained). Over time, agents i and\nj may interact with different agents. Therefore, their effective behaviour can be altered either\ndirectly due to a change of xi and xj resulting from interaction with other agents, or indirectly\n\n9\n\nThis treatment of group influence by averaging has a long tradition. Formal models of group decision-making\n(French, 1956; Harary, 1959; Hegselmann and Krause, 2002; Lehrer, 1956; Lehrer and Wagner, 1981; Wagner,\n1978) account for group influence by weighted averages. Social impact theory (Latané, 1981; Latané and Nowak,\n1997) also constructs group influence by averaging. Similar to social impact theory, our model features a decreasing\nmarginal group influence with respect to adding more agents to the in-group.\n\n8/22\n\n\fPatrick Groeber, Frank Schweitzer, Kerstin Press:\nHow groups can foster consensus - The case of local cultures\nJournal of Artificial Societes and Social Simulationsn vol 12, no 2/4 (2009)\nSee http://www.sg.ethz.ch for more information.\n\nby interactions of agents in their in-group affecting the average behaviour of the respective ingroup. Thus, we may encounter a situation where agents i and j interacted at time t and were\nadded to each other's in-group while later at t′ > t, their effective behaviour may be modified\n′\neff ′\nsuch that |xeff\ni (t ) − xj (t )| ≥ ε. In this case, agents i and j could no longer interact when\nselected and would be removed from each other's in-group.\nThus, if i and j are selected at time t, we have\n(\nIi (t) ∪ {j}\nIi (t + 1) =\nIi (t) \\ {j}\n(\nIj (t) ∪ {i}\nIj (t + 1) =\nIj (t) \\ {i}\n\neff\nif |xeff\ni (t) − xj (t)| < ε\neff\nif |xeff\ni (t) − xj (t)| ≥ ε\neff\nif |xeff\ni (t) − xj (t)| < ε\neff\nif |xeff\ni (t) − xj (t)| ≥ ε\n\n,\n(6)\n.\n\nNote that the in-group relation is symmetric but may not be transitive, i.e. agent i being\ncontained in agent j's in-group and agent j being contained in agent k's in-groups does not\nrequire k being in j's in-group.\nAs indicated before, the behaviour of interacting agents becomes more similar. This means that\ninteraction at time t alters the agents' behaviour according to Eq. (2). For t + 1, this also feeds\nback on the effective behaviour of i and j, Eq. (3), as well as on the effective behaviour of agents\nwhose in-group contains i or j. The effect of modifying i's behaviour for her effective behaviour\nwill decrease with larger Ii . Over time, the agent can interact with others in and outside her\nin-group if Eq. (5) is satisfied. This influences her behaviour as well as the evolution of her ingroup over time. Agents previously outside i's in-group are added to the set Ii once i successfully\ninteracts with them. The addition of new agents to Ii influences her effective behaviour and\nthereby her potential for future interaction.10 Thus this model provides a feedback mechanism\nbetween the agents' behaviour and their in-group's structure.\nIn the context of local cultures, we are mainly interested in whether the dynamics lead to\nconsensus or in quantifying the degree of heterogeneity in agent behaviour. We therefore investigate how the results for the baseline model are affected by the two extensions proposed here,\nnamely the evolving agent network and its feedback on agent behaviour. As known, equilibrium\noutcomes depend on the key parameter ε which distinguishes between open-mindedness and\nnarrow-mindedness of agents. Similar to the baseline model, high values of ε favour consensus or\na small number of unrelated population subgroups (=components).11 Note that in equilibrium,\nthe dynamics always partition the agent population into a certain number of network components, where all agents within a component share the same behaviour. Obviously, the difference\n\n10\n\nMany models in sociology build upon a reciprocal link of behaviour and interaction. See Carley (1991); Coleman (1961, 1980); Friedkin and Johnsen (1990); Marsden and Friedkin (1993); Nowak et al. (1990). Empirically,\nthe mechanism has been observed by Ennett and Baumann (1994) and many others.\n11\nFor both models, this does not hold in general as the probability of consensus and the average maximum\ncomponent size as a function of ε are not monotonically increasing (see Ben-Naim et al. (2003) for the baseline\nmodel).\n\n9/22\n\n\fPatrick Groeber, Frank Schweitzer, Kerstin Press:\nHow groups can foster consensus - The case of local cultures\nJournal of Artificial Societes and Social Simulationsn vol 12, no 2/4 (2009)\nSee http://www.sg.ethz.ch for more information.\n\nbetween the behaviour in any two components is at least the threshold ε as interaction between\nagents from different components would still be possible otherwise. Further, each agent's ingroup coincides with her respective network component: Agents within a component are fully\nconnected but have no links to outside agents.\n\n5\n\nFindings\n\nAs explained before, agents need to agree on a desirable business behaviour to allow for a local\nculture and cluster benefits to emerge. This consensus results from past interactions and the\nsuccessful behaviour therein. The strength of any local culture thus relates to the spread of a\nspecific behaviour in the population. Therefore one quantity measured in our simulations is the\nfrequency of consensus among all agents, i.e. how often all agents exhibit the same behaviour\nin equilibrium. As the behaviour profile does not converge within a finite number of timesteps,\nwe call a behaviour profile x consensus profile if the maximum distance between two agents'\nrespective behaviours is at most ε. In this case, all agents' behaviour will finally converge to\nthe mean behaviour in the population. Similarly, we can define a sufficient condition for nonconvergence. First, there must be two components whose distance is at least ε, i.e. if there exist\nagents i and j with |xi − xj | ≥ ε and there is no other agent whose behaviour is between xi and\nxj . Second, we require that there are no links between these ε-seperated components. In this\ncase, the respective limit behaviours for i and j even for large t cannot coincide. However, we\nshould also take into account to what extent there is a shared behaviour among the agents in case\nof no consensus. We measure this by the size of the largest component of agents with identical\nbehaviour. For example, a situation where 95 agents share the same behaviour is much closer to\nconsensus than one where the population of agents splits into three equally sized components\nwith different behaviour.\nWe analyse the local cultures model with respect to these quantities by means of computer simulations and compare the results to the baseline model that has no feedback between behaviour\nand network. The key parameter varied is ε, high values of which characterize the openmindedness of the agents.\nThe main result relates to the question whether the feedback mechanism between the agents'\nbehaviour and their network structure (group influence) is beneficial in the sense that a common\nbehaviour is fostered. Our simulations (see Figure 1 and Figure 2) show that for more narrowminded agents, i.e. small thresholds ε, the group influence results in both a higher average\nfrequency of consensus and a larger maximum component size as compared to the baseline\nmodel. Hence, the mechanism introduced in our model increases the likelihood of consensus\nformation.\nThis result, interestingly and counterintuitively, changes for larger thresholds and therefore more\nopen-minded agents. Here, the feedback mechanism weakens the emergence of a local culture in\n\n10/22\n\n\fPatrick Groeber, Frank Schweitzer, Kerstin Press:\nHow groups can foster consensus - The case of local cultures\nJournal of Artificial Societes and Social Simulationsn vol 12, no 2/4 (2009)\n\n1\n0.8\n\naverage frequency of consensus\n\naverage frequency of consensus\n\nSee http://www.sg.ethz.ch for more information.\n\nwithout group influence\nwith group influence\n\n0.6\n0.4\n0.2\n0\n0.2\n\n0.25\n\n0.3\n\n0.35\nε\n\n0.4\n\n0.45\n\n1\n0.8\n0.6\n0.4\n0.2\n0\n0.2\n\n0.5\n\n0.25\n\n1\n0.8\n0.6\n0.4\n0.2\n0\n0.2\n\n0.25\n\n0.3\n\n0.35\nε\n\n0.4\n\n0.45\n\naverage frequency of consensus\n\naverage frequency of consensus\n\n0.6\n0.4\n0.2\n\n0.35\nε\n\n0.4\n\n0.5\n\n0.45\n\n0.5\n\n0.45\n\n0.5\n\n0.6\n0.4\n0.2\n\n0.25\n\n0.3\n\n0.35\nε\n\n0.4\n\n(d) n = 100, μ = 0.1\n\n0.8\n\n0.3\n\n0.45\n\n0.8\n\n0\n0.2\n\n0.5\n\n1\n\n0.25\n\n0.4\n\n1\n\n(c) n = 100, μ = 0.5\n\n0\n0.2\n\n0.35\nε\n\n(b) n = 50, μ = 0.1\naverage frequency of consensus\n\naverage frequency of consensus\n\n(a) n = 50, μ = 0.5\n\n0.3\n\n0.45\n\n1\n0.8\n0.6\n0.4\n0.2\n0\n0.2\n\n0.5\n\n(e) n = 500, μ = 0.5\n\n0.25\n\n0.3\n\n0.35\nε\n\n0.4\n\n(f) n = 500, μ = 0.1\n\nFigure 1: Average frequency of consensus dependent on ε for 5000 runs and different values of\nn and μ. The agents' initial behaviour is random according to a uniform distribution, the initial\nnetwork is empty. For narrow-minded agents (small ε), the group influence fosters consensus\nwhile for open-minded agents (high ε), the probability of indentical behaviour is lower than in\nthe baseline model without group influence.\n\n11/22\n\n\fPatrick Groeber, Frank Schweitzer, Kerstin Press:\nHow groups can foster consensus - The case of local cultures\nJournal of Artificial Societes and Social Simulationsn vol 12, no 2/4 (2009)\n\n1\n0.9\n0.8\n0.7\n0.6\n0.5\n0.2\n\nwithout group influence\nwith group influence\n0.25\n\n0.3\n\n0.35\nε\n\n0.4\n\n0.45\n\naverage maximum component size\n\naverage maximum component size\n\nSee http://www.sg.ethz.ch for more information.\n\n0.5\n\n1\n0.9\n0.8\n0.7\n0.6\n0.5\n0.2\n\n0.25\n\n1\n0.9\n0.8\n0.7\n0.6\n0.5\n0.2\n\n0.25\n\n0.3\n\n0.35\nε\n\n0.4\n\n0.45\n\n0.5\n\naverage maximum component size\n\naverage maximum component size\n\n0.9\n0.8\n0.7\n0.6\n\n0.3\n\n0.35\nε\n\n0.4\n\n0.45\n\n0.5\n\n0.45\n\n0.5\n\n0.45\n\n0.5\n\n0.9\n0.8\n0.7\n0.6\n0.5\n0.2\n\n0.25\n\n0.3\n\n0.35\nε\n\n0.4\n\n(d) n = 100, μ = 0.1\n\n1\n\n0.25\n\n0.4\n\n1\n\n(c) n = 100, μ = 0.5\n\n0.5\n0.2\n\n0.35\nε\n\n(b) n = 50, μ = 0.1\naverage maximum component size\n\naverage maximum component size\n\n(a) n = 50, μ = 0.5\n\n0.3\n\n0.45\n\n0.5\n\n(e) n = 500, μ = 0.5\n\n1\n0.9\n0.8\n0.7\n0.6\n0.5\n0.2\n\n0.25\n\n0.3\n\n0.35\nε\n\n0.4\n\n(f) n = 500, μ = 0.1\n\nFigure 2: Average maximum relative component size dependent on ε for 5000 runs and different\nvalues of n and μ. The agents' initial behaviour is random according to a uniform distribution,\nthe initial network is empty. For narrow-minded agents (small ε), our model increases the average\nmaximum component size compared to the baseline model without group influence. For openminded agents (high ε), there is almost no difference between the two models with respect to\nthe average maximum component size.\n\n12/22\n\n\fPatrick Groeber, Frank Schweitzer, Kerstin Press:\nHow groups can foster consensus - The case of local cultures\nJournal of Artificial Societes and Social Simulationsn vol 12, no 2/4 (2009)\n\n0.25\n\naverage frequency of consensus\n\naverage frequency of consensus\n\nSee http://www.sg.ethz.ch for more information.\n\n0.2\n0.15\n0.1\n0.05\n0\n0.2\n\nwithout group influence\nwith group influence\n0.25\n\n0.3\n\n0.35\nε\n\n0.4\n\n0.45\n\n0.25\n0.2\n0.15\n0.1\n0.05\n0\n0.2\n\n0.5\n\n0.25\n\n0.25\n0.2\n0.15\n0.1\n0.05\n0\n0.2\n\n0.25\n\n0.3\n\n0.35\nε\n\n0.4\n\n0.45\n\nstd. dev. of max. component size\n\nstd. dev. of max. component size\n\n0.15\n0.1\n0.05\n\n0.35\nε\n\n0.4\n\n0.5\n\n0.45\n\n0.5\n\n0.45\n\n0.5\n\n0.15\n0.1\n0.05\n\n0.25\n\n0.3\n\n0.35\nε\n\n0.4\n\n(d) n = 100, μ = 0.1\n\n0.2\n\n0.3\n\n0.45\n\n0.2\n\n0\n0.2\n\n0.5\n\n0.25\n\n0.25\n\n0.4\n\n0.25\n\n(c) n = 100, μ = 0.5\n\n0\n0.2\n\n0.35\nε\n\n(b) n = 50, μ = 0.1\nstd. dev. of max. component size\n\naverage frequency of consensus\n\n(a) n = 50, μ = 0.5\n\n0.3\n\n0.45\n\n0.25\n0.2\n0.15\n0.1\n0.05\n0\n0.2\n\n0.5\n\n(e) n = 500, μ = 0.5\n\n0.25\n\n0.3\n\n0.35\nε\n\n0.4\n\n(f) n = 500, μ = 0.1\n\nFigure 3: Standard deviation of the maximum relative group size dependent on ε for 5000 runs\nand different values of n and μ. The agents' initial behaviour is random according to a uniform\ndistribution, the initial network is empty.\n\n13/22\n\n\fPatrick Groeber, Frank Schweitzer, Kerstin Press:\nHow groups can foster consensus - The case of local cultures\nJournal of Artificial Societes and Social Simulationsn vol 12, no 2/4 (2009)\nSee http://www.sg.ethz.ch for more information.\n\ngeneral. Agents subject to group influence reach less consensus on average than in the baseline\nmodel. We note, however, that the mechanism's effect differs between the two measures: While\nthe frequency of consensus is significantly decreased (Figure 1), the effect on the maximum\ncomponent size is much smaller (Figure 2). To explain the influence of agents open-mindedness,\nwe argue that the feedback mechanism in the local cultures model implies two opposed effects\ncompared to the baseline model. On the one hand, agents with \"extreme\" initial behaviour (i.e.\nan initial behaviour close to zero or one) are less likely to interact with other agents and are\ntherefore more likely to stay in that border area. The longer these agents remain in isolation (i.e.\nwithout interacting), the denser the network of other agents becomes, implying more averaging\nof behaviour in determining the effective behaviour of these networked agents. As more averaging\nleads to values closer to the mean, there are fewer and fewer agents within the interaction range\nof any isolated agent (as compared to the baseline model), and full consensus becomes more\nunlikely.\nOn the other hand, the feedback mechanism fosters consensus by increasing the coalescence of\nsubpopulations with different behaviour, i.e. components within the network. To illustrate this,\nconsider the simulation depicted in Figure 4.12 In Figure 4(a), there are two nearly separated\ncomponents in our model, the upper, smaller one with a higher average behaviour, the lower,\nlarger one with a lower average behaviour. The two links that connect these components would\nnot persist in the baseline model as the respective nodes' difference in terms of their own behaviour is above the threshold. However, as this is not the case for their effective behaviour, the\ninvolved agents can still interact in our model. Hence, the two agents from the upper component\nstill influence agents in the lower component by increasing their effective behaviour (compared\nto their other neighbours whose behaviour is lower). For the same reason, the two upper agents'\neffective behaviour is decreased by its neighbours from the lower component. Thus, they could\nestablish further connections to the lower component. Nevertheless, interaction with agents from\nthe upper component would increase their behaviour and hence increase the distance to their\nneighbours from the lower component.13 Therefore, whether the two components stay connected\nand finally evolve to a complete graph or become separated depends on which nodes are chosen\nin the near future, i.e. is a path dependent process. Any interaction between the different components increases the probability of their coalescence, any interaction within the same component\ndecreases that probability. In our example, one agent can establish further connections to the\nlower component (Figure 4(b)) and in return enables its neighbors from different components to\ninteract (Figure 4(c)). Very quickly, more and more agents from the different components interact, become more similar and finally make the components coalesce (Figure 4(d)). This effect\n\n12\n\nA video of this simulation can be found at http://web.sg.ethz.ch/publications/local cultures/\nweb-cultures.html. For a dynamic network layout, we use the arf algorithm (Geipel, 2007).\n13\nThis increase would have two reasons: first the increase of their own behaviour, second the decrease of their\nlower component's neighbours' influence on their effective behaviour as the share of lower component agents of\nthe neighbourhood also decreases.\n\n14/22\n\n\fPatrick Groeber, Frank Schweitzer, Kerstin Press:\nHow groups can foster consensus - The case of local cultures\nJournal of Artificial Societes and Social Simulationsn vol 12, no 2/4 (2009)\nSee http://www.sg.ethz.ch for more information.\n\n(a) t = 240\n\n(b) t = 530\n\n(c) t = 750\n\n(d) t = 810\n\nFigure 4: Network evolution for a simulation with 50 agents and ε = 0.3 at different timesteps.\nThe agents' initial behaviour is random according to a uniform distribution, the initial network is\nempty. A node's colour indicates the respective agent's behaviour (white=0, black=1). A green\ndashed link denotes that the respective agents' difference in effective behaviour is below the\nthreshold while their respective own behaviours differ more than ε. Thus, such a link persists in\nthe local cultures model but would be deleted in the baseline model. A red dotted link indicates\nthat the respective agents' difference in effective behaviour is above the threshold, i.e. the link\nwould be deleted if the respective agents were chosen at that timestep.\n\n15/22\n\n\fPatrick Groeber, Frank Schweitzer, Kerstin Press:\nHow groups can foster consensus - The case of local cultures\nJournal of Artificial Societes and Social Simulationsn vol 12, no 2/4 (2009)\nSee http://www.sg.ethz.ch for more information.\n\nof coalescing components is also apparent in a higher variance of the maximum component size\nfor narrow-minded agents as compared to the baseline model (cf. Figure 3).\nWhich of these effects decides over the strength of a local culture depends on the threshold ε: For\nnarrow-minded agents, the baseline model is generally more likely to obtain several components\ninstead of consensus. Thus, in the local cultures model, the increased probability of the coalescence of components increases both the frequency of consensus and the maximum component\nsize. For open-minded agents, this effect vanishes because of the greater ex-ante likelihood of\nconsensus in the baseline model. In this situation, the effect of isolation of agents with extreme\nbehaviour comes into play: While both models favour consensus in general, it is more likely for\nthe local cultures model to find agents at the spectrum's borders being separated from the other\nagents because of the faster dynamics towards the center. Therefore, the frequency of consensus\nis lower in this model. On the other hand there are only few agents separated from the majority, so the maximum component size is only slightly decreased by the feedback mechanism in\nthe local cultures model. Hence, if we only consider this quantity to measure a local culture's\nmagnitude, the feedback mechanism significantly strengthens a local culture for narrow-minded\nagents and only slightly weakens it for open-minded agents.\nWhat is the effect of variations to the population size n and the convergence speed μ on our\nfindings? To explain this we consider how both parameters affect the consensus frequency in\nour model and the baseline model. In both cases, an increase in the population size usually\nleads to a decreased consensus probability as it becomes more likely that a single agent with\nextreme initial behaviour is separated from the rest of the population. For open-minded agents,\nthis effect is amplified by the the faster dynamics towards the center in the local cultures model.\nThus, we observe that the reduction in frequency of consensus is greater than in the baseline\nmodel (cf. Figure 1). With respect to the average maximum component size, an increase in the\npopulation size increases the advantage of the local cultures model compared to the baseline\nmodel for narrow-minded agents (cf. Figure 2). In this case, the increased number of agents\nleads to a higher probability for bridging links between two almost seperated components. Hence,\nthese components more often coalesce and thereby increase the difference between the maximum\ncomponent size in our model and that in the baseline model as n grows. This is also indicated by\nthe increased distance of the two models' respective variance peak (cf. Figure 3). If we decrease\nthe convergence speed μ, we observe an increase in the consensus frequency for both models\nfor all thresholds ε as the agents' behaviour moves slower towards the center. With respect to\nthe maximum component size, this only holds for the baseline model. Figure 5 shows that this\nquantity decreases for narrow-minded agents, i.e. if ε is small. The reason is that the coalescence\nof components becomes less likely for smaller values of μ as interaction with a bridge link between\ntwo almost seperated components becomes less effective in this case.\n\n16/22\n\n\fPatrick Groeber, Frank Schweitzer, Kerstin Press:\nHow groups can foster consensus - The case of local cultures\nJournal of Artificial Societes and Social Simulationsn vol 12, no 2/4 (2009)\n\n1\n0.9\n0.8\n0.7\n0.6\n0.5\n0.2\n\nμ=0.5\nμ=0.1\n0.25\n\n0.3\n\n0.35\nε\n\n0.4\n\n0.45\n\naverage maximum component size\n\naverage maximum component size\n\nSee http://www.sg.ethz.ch for more information.\n\n0.5\n\n(a) without group influence\n\n1\n0.9\n0.8\n0.7\n0.6\n0.5\n0.2\n\n0.25\n\n0.3\n\n0.35\nε\n\n0.4\n\n0.45\n\n0.5\n\n(b) with group influence\n\nFigure 5: Average maximum relative component size dependent on ε for 5000 runs, 500 agents\nand different values of μ. The agents' initial behaviour is random according to a uniform distribution, the initial network is empty. For the baseline model without group influence, a decrease\nof the convergence speed μ leads to an increase of the maximum component size for all ε. This\nholds only for open-minded agents (high ε) in case of our model.\n\n6\n\nDiscussion\n\nThe present paper set out to study the emergence of local cultures. To do so, it focused on the\nfirst stage of the process where agents need to obtain consensus on acceptable business practice.\nWithin a bounded-confidence model of opinion dynamics, we added a feedback mechanism between a agent's behaviour and the evolving agent network. The effect of this mechanism depends\non the value of the interaction threshold ε. In comparison with the baseline model (Deffuant\net al., 2000), our feedback increased the likelihood of consensus for narrow minded agents (small\nε) as the group effect may foster a coalescence of otherwise separated components. For openminded agents (large ε), the likelihood of consensus decreased because the group effect worked\nto speed up convergence as compared to the baseline case. In some instances, this convergence\nwas too fast for all agents to reach consensus. However, this constellation still had a substantial\nproportion of component agents finding consensus (the maximum component size was almost\nas large as in the baseline case). The fact that all component agents want to maintain their\nnetworks thus leads to behavioural constraints that may impede full consensus for very openminded agents but increases it for narrow-minded ones. As local cultures can also emerge within\na sub-population, the aforementioned results suggest that the desire to maintain interaction\nnetworks has a positive effect on the emergence of (full or partial) consensus, which would then\nform the basis of a local culture.\nA next step in advancing the model would consist in a benchmark against data. Unfortunately,\nthe key model parameters (especially open-mindedness of agents) are very difficult to operationalise and thereby measure. As a result, any data investigation would probably have to rely\n\n17/22\n\n\fPatrick Groeber, Frank Schweitzer, Kerstin Press:\nHow groups can foster consensus - The case of local cultures\nJournal of Artificial Societes and Social Simulationsn vol 12, no 2/4 (2009)\nSee http://www.sg.ethz.ch for more information.\n\non qualitative, case-study evidence investigating how component agents choose to interact with\neach other and whether a concern for one's past partners does exist. Such findings would give\nan inclination of whether the mechanisms proxied in the model are actually at work. Beyond\na data benchmark the link between open-mindedness and group effects on consensus could be\ninvestigated experimentally. Participants could be surveyed on open-mindedness and would be\nallocated to two groups accordingly. The experiment could then study in how far the consensus\ndynamics differ between both groups.\nA second avenue for expanding the present paper consists in model extensions. Two aspects\nspring to mind. First, one could investigate the effect of heterogeneity among agents regarding\ntheir open-mindedness (ε). Recent contributions (Lorenz, 2008) suggest that heterogeneity plays\na substantial role for the likelihood of consensus in the baseline model. Second, one could introduce non-empty initial networks (in-groups) to proxy that entrepreneurs in components often\nhave an initial set of acquaintances from living in the area or studying in the same university.\nGiven the contrasting effect of groups on consensus, it would be interesting to investigate in how\nfar non-empty initial in-groups affect it. In a more general theoretic context, it would pay to\napply this model to the emergence of norms and conventions in general. Given the more expansive body of research in this field, opportunities for benchmarking the model's results against\nother existing studies will probably arise. It would be particularly interesting to see whether our\ncounterintuitive result on group-effects and consensus is applicable to other constellations.\n\nReferences\nAllen, R. C. (1983). Collective invention. Journal of Economic Behavior & Organization 4(1),\n1–24.\nAsch, S. E. (1956). Studies of independence and conformity: I, a minority of one against a\nunanimous majority. Psychological Monographs 70(9), 1–70.\nAxelrod, R. (1986). An evolutionary approach to norms. The American Political Science Review\n80(4), 1095–1111.\nAxelrod, R. (1997). The Dissemination of Culture: A Model with Local Convergence and Global\nPolarization. Journal of Conflict Resolution 41, 203–226.\nBen-Naim, E.; Redner, S.; Kaprivsky, P. L. (2003). Bifurcation and Patterns in Compromise\nProcesses. Physica D 183, 190–204.\nCarley, K. (1991). A Theory of Group Stability. American Sociological Review 56(3), 331–354.\nCoase, R. H. (1937). The nature of the firm. Economica 4(16), 386–405.\nColeman, J. S. (1961). The adolescent society: the social life of the teenager and its impact on\neducation. New York: Free Press.\n\n18/22\n\n\fPatrick Groeber, Frank Schweitzer, Kerstin Press:\nHow groups can foster consensus - The case of local cultures\nJournal of Artificial Societes and Social Simulationsn vol 12, no 2/4 (2009)\nSee http://www.sg.ethz.ch for more information.\n\nColeman, J. S. (1980). Friendship and the peer group in adolescence. In: J. Adelson (ed.),\nHandbook of adolescent psychology, New York: Wiley. pp. 408–431.\nColeman, J. S. (1990). Foundations of Social Theory. Cambridge MA: Harvard University Press.\nDeffuant, G.; Huet, S.; Amblard, F. (2005). An individual-based model of innovation diffusion\nmixing social value and individual benefit. American Journal of Sociology 110(4).\nDeffuant, G.; Neau, D.; Amblard, F.; Weisbuch, G. (2000). Mixing beliefs among interacting\nagents. Advances in Complex Systems 3, 87–98.\nDeGroot, M. H. (1974). Reaching a Consensus. Journal of the American Statistical Association\n69(345), 118–121.\nDemsetz, H. (1967). Towards a theory of property rights. American Economic Review 57(2),\n347–359.\nEllison, G.; Glaeser, E. (1997). Geographic Concentration in U.S. Manufacturing Industries: A\nDartboard Approach. Journal of Political Economy 105(5), 889–927.\nEnnett, S. T.; Baumann, K. E. (1994). The contribution of influence and selection to adolescent\npeer group homogeneity: The case of adolescent cigarette smoking. Journal of Personality\nand Social Psychology 67(4), 653–663.\nFehr, E.; Fischbacher, U. (2004). Third-party punishment and social norms. Evolution and\nHuman Behaviour 25, 63–87.\nFent, T.; Groeber, P.; Schweitzer, F. (2007). Coexistence of Social Norms based on In- and\nOut-group Interactions. Advances of Complex Systems 10(2), 271–286.\nFrench, J. (1956). A formal theory of social power. Psychological Review 63, 181–194.\nFriedkin, N.; Johnsen, J. (1990). Social influence and opinions. Journal of Mathematical Sociology\n15, 193–205.\nGeipel, M. (2007). Self-Organization applied to Dynamic Network Layout. International Journal\nof Modern Physics C 18(10).\nHarary, F. (1959). A criterion for unanimity in French's theory of social power. In: D. Cartwright\n(ed.), Studies in Social Power, Ann Arbour: Institute for Social Research.\nHegselmann, R.; Krause, U. (2002). Opinion dynamics and bounded confidence: Models, analysis,\nand simulation. Journal of Artificial Societies and Social Simulation 5(3).\nHolländer, H. (1990). A Social Exchange Approach to Voluntary Cooperation. American Economic Review 80(December), 1157–1167.\n\n19/22\n\n\fPatrick Groeber, Frank Schweitzer, Kerstin Press:\nHow groups can foster consensus - The case of local cultures\nJournal of Artificial Societes and Social Simulationsn vol 12, no 2/4 (2009)\nSee http://www.sg.ethz.ch for more information.\n\nHorne, C. (2001). Sociological perspectives on the emergence of norms. In: M. Hechter; K. Opp\n(eds.), Social Norms, Russell Sage Foundation. pp. 3–34.\nKandel, E.; Lazear, E. P. (1992). Peer Pressure and Partnership. Journal of Political Economy\n100(4), 801–817.\nKoford, K. J.; Miller, J. B. (1991). Social Norms and Economic Institutions. Ann Arbour, MI:\nUniversity of Michigan Press.\nLatané, B. (1981). The psychology of social impact. American Psychologist 36, 343–356.\nLatané, B.; Nowak, A. (1997). Self-organizing social systems: Necessary and sufficient conditions\nfor the emergence of clustering, consolidation and continuing diversity. In: G. A. Barnett; F. J.\nBoster (eds.), Progress in Communication Sciences: Advances in Persuasion, London: Ablex\nPublishing Corporation. pp. 43–74.\nLehrer, K. (1956). Social consensus and rational agnoiology. Synthese 31, 141–160.\nLehrer, K.; Wagner, C. G. (1981). Rational Consensus in Science and Society. Dordrecht: D.\nReidl Publishing Co.\nLorenz, J. (2006). Consensus Strikes Back in the Hegselmann-Krause Model of Continuous\nOpinion Dynamics under Bounded Confidence. Journal of Artificial Societies and Social\nSimulation 9(1).\nLorenz, J. (2007). Continuous Opinion Dynamics Under Bounded Confidence: A Survey. International Journal of Modern Physics C 18(12), 1819–1838.\nLorenz, J. (2008). Heterogeneous bounds of confidence: Meet, Discuss and Find Consensus! URL\nhttp://arxiv.org/abs/0801.1399v1.\nMacy, M. W.; Skvoretz, J. (1998). The Evolution of trust and cooperation between strangers:\nA computational model. American Sociological Review 63(5), 638–660.\nMarsden, P.; Friedkin, N. (1993). Network studies of social influence. Sociological Methods and\nResearch 22, 127–151.\nMaskell, P. (2001). Towards a Knowledge-based Theory of the Geographical Cluster. Industrial\nand Corporate Change 10(4), 921–943.\nMcPherson, M.; Smith-Lovin, L.; Cook, J. M. (2001). Birds of a Feather: Homophily in Social\nNetworks. Annual Review of Sociology 27, 415–444.\nMoscovici, S.; Doise, W. (1992). Dissension et consensus: Une théorie générale des décisions\ncollectives. Paris: Presses Universitaires de France.\n\n20/22\n\n\fPatrick Groeber, Frank Schweitzer, Kerstin Press:\nHow groups can foster consensus - The case of local cultures\nJournal of Artificial Societes and Social Simulationsn vol 12, no 2/4 (2009)\nSee http://www.sg.ethz.ch for more information.\n\nNowak, A.; Jacek, S.; Latané, B. (1990). From private attitude to public opinion: A dynamic\ntheory of social impact. Psychological Review 97, 362–376.\nNowak, M. A. (2006). Five rules for the evolution of cooperation. Science 314(5805), 1560–\n1563. ISSN 1095-9203.\nOpp, K. (1982). The evolutionary emergence of norms. British Journal of Social Psychology 21,\n139–149.\nOpp, K. (2001). How Do Social Norms Emerge? An Outline of a Theory. Mind and Society 2,\n101–128.\nPorter, M. E. (1990). The Competitive Advantage of Nations. London: Macmillan.\nPujol, J.; Delgado, J.; Sangüesa, R.; Flache, A. (2005). The Role of Clustering on the Emergence\nof Efficient Social Conventions. In: Proceedings of the 19th International Joint Conference on\nArtificial Intelligence IJCAI-05. Edinburgh, Scotland, pp. 965–970.\nPyke, F.; Beccattini, G.; Sengenberger, W. (1990). Industrial districts and inter-firm cooperation in Italy. Geneva: International Institute for Labour Studies.\nSaxenian, A. (1994). Regional Advantage: Culture and Competition in Silicon Valley and Route\n128. Cambridge, Mass.: Harvard University Press.\nSchweitzer, F. (2007). Collective Decisions in Multi-Agent Systems. In: S. Takahashi; D. Sallach;\nJ. Rouchier (eds.), Advancing Social Simulation: The First World Congress, Tokyo: Springer.\npp. 7–12.\nSchweitzer, F.; Behera, L. (2009). Nonlinear voter models: The transition from invasion to\ncoexistence. European Physical Journal B .\nSherif, M. (1973). The Psychology of Social Norms. New York: Octagon Books.\nShoham, Y.; Tennenholtz, M. (1992). Emergent Conventions in Multi-Agent Systems: Initial\nExperimental Results and Observations. In: Proceedings of Knowledge Representation and\nReasoning. pp. 225–231.\nSmith, A. (2003). The Wealth of Nations (1776). Bantam Classic, New York: Bantam Dell.\nStark, H.-U.; Tessone, C. J.; Schweitzer, F. (2008a). Decelerating microdynamics can accelerate\nmacrodynamics in the voter model. Physical Review Letters 101(1), 018701(4).\nStark, H.-U.; Tessone, C. J.; Schweitzer, F. (2008b). Slower is Faster: Fostering Consensus\nFormation by Heterogeneous Inertia. Advances in Complex Systems 11(4).\nStrang, D.; Soule, S. A. (1998). Diffusion in organizations and social movements: From hybrid\ncorn to poison pills. Annual Review of Sociology 24, 265–290.\n\n21/22\n\n\fPatrick Groeber, Frank Schweitzer, Kerstin Press:\nHow groups can foster consensus - The case of local cultures\nJournal of Artificial Societes and Social Simulationsn vol 12, no 2/4 (2009)\nSee http://www.sg.ethz.ch for more information.\n\nSugden, R. (1989). Spontaneous Order. The Journal of Economic Perspectives 3(4), 85–97.\nUllmann-Margalit, E. (1977). The Emergence of Norms. Clarendon Press.\nVoss, T. (2001). Game theoretical perspectives on the emergence of social norms. In: M. Hechter;\nK.-D. Opp (eds.), Social Norms, New York: Russell Sage Foundation. pp. 105–136.\nWagner, C. G. (1978). Consensus through respect: A model of rational group decision-making.\nPhilosophical Studies 34, 335–349.\nWeber, M. (1999). Essays in economic sociology. Princeton NJ: Princeton University Press.\nWilliamson, O. E. (1975). Markets and Hierarchies - Analysis and Anti-Trust Implications. New\nYork: Free Press.\nZiegler, R. (2007). The Kula Ring of Bronislaw Malinowski. Bayerische Akademie der Wissenschaften.\n\n22/22\n\n\f"}