{"id": "http://arxiv.org/abs/1105.0461v1", "guidislink": true, "updated": "2011-05-03T00:45:59Z", "updated_parsed": [2011, 5, 3, 0, 45, 59, 1, 123, 0], "published": "2011-05-03T00:45:59Z", "published_parsed": [2011, 5, 3, 0, 45, 59, 1, 123, 0], "title": "A correction method for the pair density to get close to the ground\n  state one", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1105.4202%2C1105.5170%2C1105.1876%2C1105.2661%2C1105.4166%2C1105.2449%2C1105.1825%2C1105.1592%2C1105.1852%2C1105.4913%2C1105.4259%2C1105.5181%2C1105.5102%2C1105.1401%2C1105.5162%2C1105.3275%2C1105.0091%2C1105.3198%2C1105.1369%2C1105.4621%2C1105.5121%2C1105.1025%2C1105.3411%2C1105.1127%2C1105.3056%2C1105.1995%2C1105.3362%2C1105.1071%2C1105.5473%2C1105.3939%2C1105.1798%2C1105.6236%2C1105.4312%2C1105.4734%2C1105.3310%2C1105.3160%2C1105.1267%2C1105.3338%2C1105.5362%2C1105.1548%2C1105.4760%2C1105.2291%2C1105.5510%2C1105.3626%2C1105.2324%2C1105.0065%2C1105.4799%2C1105.3967%2C1105.2262%2C1105.0655%2C1105.5836%2C1105.3235%2C1105.1015%2C1105.4096%2C1105.2011%2C1105.3344%2C1105.2346%2C1105.1534%2C1105.4914%2C1105.0071%2C1105.5060%2C1105.1020%2C1105.1810%2C1105.5406%2C1105.0750%2C1105.6245%2C1105.4156%2C1105.5864%2C1105.4528%2C1105.4033%2C1105.3690%2C1105.0185%2C1105.1111%2C1105.4948%2C1105.0660%2C1105.3999%2C1105.0943%2C1105.0446%2C1105.4093%2C1105.4682%2C1105.2451%2C1105.0251%2C1105.2672%2C1105.2252%2C1105.4438%2C1105.1593%2C1105.4236%2C1105.4939%2C1105.4180%2C1105.3092%2C1105.6166%2C1105.5230%2C1105.1814%2C1105.6299%2C1105.3845%2C1105.5095%2C1105.0461%2C1105.5551%2C1105.4555%2C1105.0517%2C1105.1540&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "A correction method for the pair density to get close to the ground\n  state one"}, "summary": "We present a correction method for the pair density (PD) to get close to the\nground state one. The PD is corrected to be a variationally-best PD within the\nsearch region that is extended by adding the uniformly-scaled PDs to its\nelements. The corrected PD is kept N-representable and satisfies the virial\nrelation rigorously. The validity of the present method is confirmed by\nnumerical calculations of neon atom. It is shown that the root-mean-square\nerror of the electron-electron interaction and external potential energies,\nwhich is a good benchmark for the error of the PD, is reduced by 69.7% without\nadditional heavy calculations.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1105.4202%2C1105.5170%2C1105.1876%2C1105.2661%2C1105.4166%2C1105.2449%2C1105.1825%2C1105.1592%2C1105.1852%2C1105.4913%2C1105.4259%2C1105.5181%2C1105.5102%2C1105.1401%2C1105.5162%2C1105.3275%2C1105.0091%2C1105.3198%2C1105.1369%2C1105.4621%2C1105.5121%2C1105.1025%2C1105.3411%2C1105.1127%2C1105.3056%2C1105.1995%2C1105.3362%2C1105.1071%2C1105.5473%2C1105.3939%2C1105.1798%2C1105.6236%2C1105.4312%2C1105.4734%2C1105.3310%2C1105.3160%2C1105.1267%2C1105.3338%2C1105.5362%2C1105.1548%2C1105.4760%2C1105.2291%2C1105.5510%2C1105.3626%2C1105.2324%2C1105.0065%2C1105.4799%2C1105.3967%2C1105.2262%2C1105.0655%2C1105.5836%2C1105.3235%2C1105.1015%2C1105.4096%2C1105.2011%2C1105.3344%2C1105.2346%2C1105.1534%2C1105.4914%2C1105.0071%2C1105.5060%2C1105.1020%2C1105.1810%2C1105.5406%2C1105.0750%2C1105.6245%2C1105.4156%2C1105.5864%2C1105.4528%2C1105.4033%2C1105.3690%2C1105.0185%2C1105.1111%2C1105.4948%2C1105.0660%2C1105.3999%2C1105.0943%2C1105.0446%2C1105.4093%2C1105.4682%2C1105.2451%2C1105.0251%2C1105.2672%2C1105.2252%2C1105.4438%2C1105.1593%2C1105.4236%2C1105.4939%2C1105.4180%2C1105.3092%2C1105.6166%2C1105.5230%2C1105.1814%2C1105.6299%2C1105.3845%2C1105.5095%2C1105.0461%2C1105.5551%2C1105.4555%2C1105.0517%2C1105.1540&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We present a correction method for the pair density (PD) to get close to the\nground state one. The PD is corrected to be a variationally-best PD within the\nsearch region that is extended by adding the uniformly-scaled PDs to its\nelements. The corrected PD is kept N-representable and satisfies the virial\nrelation rigorously. The validity of the present method is confirmed by\nnumerical calculations of neon atom. It is shown that the root-mean-square\nerror of the electron-electron interaction and external potential energies,\nwhich is a good benchmark for the error of the PD, is reduced by 69.7% without\nadditional heavy calculations."}, "authors": ["Masahiko Higuchi", "Katsuhiko Higuchi"], "author_detail": {"name": "Katsuhiko Higuchi"}, "author": "Katsuhiko Higuchi", "links": [{"href": "http://arxiv.org/abs/1105.0461v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1105.0461v1", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "cond-mat.str-el", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cond-mat.str-el", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1105.0461v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1105.0461v1", "arxiv_comment": null, "journal_reference": null, "doi": null, "fulltext": "A correction method for the pair density to get close to the ground state one\nMasahiko Higuchi\nDepartment of Physics, Faculty of Science, Shinshu University, Matsumoto 390-8621, Japan\n\nKatsuhiko Higuchi\n\narXiv:1105.0461v1 [cond-mat.str-el] 3 May 2011\n\nGraduate School of Advanced Sciences of Matter,\nHiroshima University, Higashi-Hiroshima 739-8527, Japan\n(Dated: July 19, 2018)\nWe present a correction method for the pair density (PD) to get close to the ground state one.\nThe PD is corrected to be a variationally-best PD within the search region that is extended by\nadding the uniformly-scaled PDs to its elements. The corrected PD is kept N -representable and\nsatisfies the virial relation rigorously. The validity of the present method is confirmed by numerical\ncalculations of neon atom. It is shown that the root-mean-square error of the electron-electron\ninteraction and external potential energies, which is a good benchmark for the error of the PD, is\nreduced by 69.7% without additional heavy calculations.\n\nThe electron correlation is one of main topics in the\nfields of the atomic, molecular and condensed matter physics. The physical quantity that directly expresses the electron correlation is the diagonal element\nof the second-order reduced density matrix, which is socalled the pair density (PD). The PD gives not only\nthe electron density but also expectation values of arbitrary two-particle operators[1–3]. Therefore, the PD\nfunctional theory (PDFT)[4–33] is one of the promising first-principle methods for describing the electron\ncorrelation beyond the conventional density functional\ntheory[34, 35]. In this letter, we present a correction\nmethod for the PD to get close to the ground state one, in\nwhich the search region of PDs is substantially extended.\nThis method can become a powerful tool to overcome the\nwell-known problems of the PDFT.\nThere exist two kinds of well-known problems in developing the PDFT. One is to have to develop the approximate form of the kinetic energy functional since the\nkinetic energy cannot be expressed by the PD alone[1–\n3, 30–33]. Some approximation is needed for the kinetic\nenergy functional of the PDFT[30–33]. The other problem is related to the N -representability problem of the\nPD[1–3, 20–29]. Although we have to search the ground\nstate PD within the set of the N -representable PDs (2nd\nHohenberg-Kohn (HK) theorem of the PDFT), the necessary and sufficient conditions for the N -representability\nof the PD have not yet been known in a practical form[1–\n3, 20–29].\nIn this letter, concerning the first problem we propose\nan approximate functional of the kinetic energy along\nthe strategy shown in the previous paper[19]. Namely,\nan approximate functional is developed by imposing two\nkinds of sum rules for the kinetic energy functional as the\nrestrictive conditions. Although the previous approximate functionals have been developed by imposing excessively the restrictive conditions on them[19], the present\none is devised with removing such excessive restrictive\nconditions[19, 36]. We have\n\n\u001b\nh i ZZ \u001a 2\ncos θ \u0010 r \u0011\nK 2 +K ′ 2 ln ′ γ (2) (rr′;rr′ )drdr′ ,\nT γ (2) =\nr\nr\nr\n(1)\nwhere γ (2) (rr′ ; rr′ ) denotes the PD, and where K and K ′\nare arbitrary constants that are determined later. Equation (1) satisfies the scaling property of the kinetic energy\nfunctional and is consistent with the HK theorem of the\nPDFT[19, 36]. The former fact will be significant later\nin discussing a correction method.\nConcerning the second problem, we have recently\nattempted to extend the variational search region of\nPDs[17, 19] beyond that of the effective initial theory[16,\n18]. However, it has been eagerly anticipated that such\na search region is further extended with keeping the N representability of the PD. In this letter, we shall extend\nthe search region by adding another set of PDs to the\nelements of the search region. This is precisely our correction method, and is a main subject of this letter. Let\nus show this method in the following three steps (i), (ii)\nand (iii).\n(i) First of all, we shall show that the kinetic energy\nfunctional which is consistent with the scaling property\nsatisfies the virial relation exactly. Here suppose that\nthe search region of PDs fully covers a set of the N representable PDs. Applying the scalings of the electron\ncoordinates, γ (2) (rr′ ; rr′ ) is transformed into\n(2)\n\nγλ (rr′ ; rr′ ) = λ6 γ (2) (λrλr′ ; λrλr′ ),\n\n(2)\n\n(2)\n\nwhere λ is the scaling parameter. γλ (rr′ ; rr′ ) is the PD\nscaled from γ (2) (rr′ ; rr′ ), which is called the scaled PD.\nThe kinetic energy functional that is consistent with the\nscaling property satisfies the following relation[8, 16, 19]:\ni\nh\ni\nh\n(2)\nT γλ = λ2 T γ (2) .\n\n(3)\n\n\f2\nSimilarly, the electron-electron interaction and external\npotential energies to the scaled PD are, respectively,\ngiven by\ni\nh\ni\nh\n(2)\nW γλ = λW γ (2) ,\n\n(4)\n\nand\ni\nh\n(2)\nV γλ =\n\n2\nN −1\n\nZZ\n\nvext\n\n\u0010r\u0011\nγ (2) (rr′ ; rr′ )drdr′ , (5)\nλ\n\nwhere vext (r) denotes the external potential and where\nN is the number of electrons. Due to the 2nd HK\ntheorem\nfunctional\n\u0002\n\u0003 of the\n\u0002 PDFT,\n\u0003\n\u0002 the\u0003 total\u0002 energy\n\u0003\u0001\nE γ (2) = T γ (2) + W γ (2) + V γ (2)\nis minimum\n(2)\nat γ0 that corresponds to the variationally-best PD\namong all of the N -representable PDs.hUsing\ni.the scaled\n(2)\nPD, the theorem can be written as dE γ0, λ dλ\n=\n(2)\n\n(2)\n\nλ=1\n\n0. Here γ0, λ is the PD scaled from γ0 , and is defined\nsimilarly to Eq. (2). Substituting Eqs. (3), (4) and (5)\ninto this theorem, we have\n\nh\ni\nh\ni ZZ {r*∇v (r)}\next\n(2)\n(2)\n(2)\n2T γ0 +W γ0 =\nγ0 (rr′;rr′ )drdr′ .\nN −1\n(6)\nEquation (6) is the virial relation of the PDFT. It should\nbe noted that even though the kinetic energy functional\nthat satisfies Eq. (3) is not an exact but an approximate\nform, Eq. (6) exactly holds if the search region fully\ncovers the set of the N -representable PDs.\n(ii) Next, we shall consider the case where the search\nregion not fully but partially covers a set of the N representable PDs. Suppose that such a partial search\nregion is denoted as C1 (See, Fig. 1), and that the total\n(2)\nenergy functional is minimum at γ̃0 that corresponds to\nthe variationally-best PD within the set C1 . Due to the\nincomplete cover of N -representable PDs by the set C1 , it\n(2)\ncould be that not all of the scaled PDs γ̃0, λ are included\nin the set C1 . We denote the set of\n\n(2)\nγ̃0, λ\n\nas C2 (Fig. 1).\nh\ni\n(2)\nIn this case, the total energy functional E γ̃0, λ does\nnot always\nh take\ni. the minimum at λ = 1. Namely, we\n(2)\nhave dE γ̃0, λ dλ\n6= 0. Like the derivation of Eq.\nλ=1\n\n(6), this inequality leads to the relation such that the\nleft-hand side of Eq. (6) is not equal to the right-hand\nside. Thus, if the search region does not fully cover the\nset of the N -representable PDs, the virial relation does\nnot hold even though the kinetic energy functional satisfies Eq. (3). This fact can be used as a criterion of\nwhether the search region fully covers the set of the N representable PDs or not. Here let us define the virial\nratio which indicates to what extent the virial relation\nholds:\n\ni ZZ {r*∇v (r)}\nh\next\n(2)\n(2)\nγ̃ (rr′;rr′ )drdr′\nW γ̃0 −\nN h− 1 i 0\n. (7)\nRv =\n(2)\nT γ̃0\nUsing this ratio, the above-mentioned criterion can be\nrestated as follows; the deviation of Rv from the value\n-2.0 means the insufficiency of the search region of PDs\nif the kinetic energy functional satisfies Eq. (3)[37].\n(iii) When Rv deviates from -2.0, a correction method\nthat is related to the extension of the search region is\ndesired. The key point of the present correction method\nis the extension of the search region by adding the scaled\nPDs to the search region. Figure 1 truly shows the relation between the original search region C1 and newlyadded search region C2 . Both sets C1 and C2 are subsets of the set of the N -representable\nPDs. The aboveh\ni.\n(2)\nmentioned inequality dE γ̃0, λ dλ\n6= 0 means that\nλ=1\nthe set C2 could possibly include the PD that takes a\ntotal energy lower than what the best PD within the set\n(2)\nC1 , i.e., γ̃0 , takes. Such a PD exists in C2 ∩ C̄1 and is\n(2)\ndenoted as γ̃0, Λ , where C̄1 is the complementary set of C1\nh\ni.\n(2)\n(Fig. 1). Then, the inequality dE γ̃0, λ dλ\n6= 0 is\nλ=1\nh\ni.\n(2)\nrewritten as dE γ̃0, λ dλ\n= 0. Substituting Eqs.\nλ=Λ\n\n(3), (4) and (5) into this equation, we obtain\n\nh i ZZ \br*∇r vext ( r )\nh i\n(2)\n(2)\n(2)\nΛ\nΛ\n2ΛT γ̃0 +W γ̃0 =\nγ̃0 (rr′;rr′ )drdr′ .\nΛ2 (N − 1)\n(8)\nIf we consider the isolated atomic system, Eq. (8) is\neasily rewritten as\ni\ni\nh\ni\nh\nh\n(2)\n(2)\n(2)\n2ΛT γ̃0 + W γ̃0 = −V γ̃0 .\n\n(9)\n\nFrom Eq. (8) or (9), we can determine the value of\n(2)\nΛ. The scaled PD γ̃0, Λ with Λ thus determined is the\nvariationally-best one within the union of two sets, i.e.,\nC1 ∪ C2 . That is to say, a correction of the ground state\n(2)\n(2)\nPD from γ̃0 to γ̃0, Λ is accomplished by extending the\nsearch region from C1 to C1 ∪ C2 . It is obvious that\n(2)\nthe corrected PD γ̃0, Λ remains N -representable. Furthermore, it is easily confirmed that the virial relation\n(2)\nexactly holds for the corrected PD γ̃0, Λ .\nThe procedure of this correction method is as follows.\nFirst we prepare the approximate form of the kinetic energy functional that satisfies Eq. (3), and determine the\nsearch region of PDs. Using this kinetic energy func(2)\n(2)\ntional, we calculate γ̃0 . Substituting γ̃0 into Eq. (8)\nor (9), the scaling parameter Λ is obtained. This Λ im(2)\nmediately leads to the corrected PD γ̃0, Λ by using Eq.\n\n\f3\nN-representable PDs\n\nC2\n\nC1\n\n~\nγ0(2)\n\n~\nγ0,(2)Λ\n\nFIG. 1: The relations between various sets of PDs. The set\nC1 covers a set of the N -representable PDs not fully but partially. The set C2 consists of the uniformly-scaled PDs. The\nvariationally-best PD within C1 , and that within C1 ∪ C2 , are\n(2)\n(2)\ndenoted by γ̃0 and γ̃0,Λ , respectively.\n\n(2). Of course, the kinetic energy, electron-electron inter(2)\naction energy and external potential energy for γ̃0, Λ can\nbe easily calculated from Eqs. (3), (4) and (5), respectively. One of striking points of this correction method\nis that the heavy calculation task is not needed for the\ncorrections of the PD and related quantities.\nIn order to check the validity of the present method,\nwe perform numerical calculations for neutral neon atom.\nWe utilize the computational PD functional scheme[19]\n(2)\nso as to obtain γ̃0 . According to this scheme[19], we\nadopt as the search region the set of PDs that are calculated from the correlated wave functions. As the correlated wave functions, we take the linear combination of\nthe ground state and doubly-excited Slater determinants\n(SDs) that consist of eigenfunctions of the effective initial scheme[16, 18]. Among all doubly-excited SDs, we\nchoose the SDs that have non-negligible contributions to\nthe resultant PD. A total of 2,861 SDs and 12,275 SDs,\nthe constituent eigenfunctions of which have the principal quantum number up to 6 and 11, respectively, are\nchosen as basis functions in constructing PDs.\nAs the set C1 , we take the set of PDs that are constructed by 2,861 SDs. First, by means of the computa(2)\ntional PD functional scheme[19], we calculate γ̃0 that is\nthe variationally-best PD within the set C1 . Then, the\n(2)\ncorrected PD γ̃0, Λ is calculated by using Eqs. (2) and (9).\nWe also prepare the search region that is extended with\nincreasing the number of basis SDs (NSD) from 2,861 to\n12,275. Hereafter, we denote this search region of PDs as\nC1′ . For comparison, the variationally-best PD within the\nset C1′ is also calculated by means of the computational\nPD functional scheme[19].\n(2)\n\nUsing γ̃0\n\n(2)\n\nand γ̃0, Λ , we calculate the errors of the\n\nelectron-electron interaction energy, external potential\nenergy, kinetic energy and virial ratio that are denoted\nby ∆W , ∆V , ∆T and ∆Rv , respectively. The rootmean-square error (RMSE) of the electron-electron interaction\np and external potential energies is also calculated\nby {(∆W )2 + (∆V )2 } /2. The RMSE is considered as\na good benchmark for to what extent the resultant PD\nis close to the correct ground state PD. This is because\naccuracies of both the electron-electron interaction and\nexternal potential energies are dependent only on that of\nthe PD.\nThe above-mentioned calculations are performed with\nchanging the values of K and K ′ that appear in Eq. (1).\nThese values are determined by requiring the approximate functional to have two desirable features. One is\nthat the approximate functional reproduces the HartreeFock kinetic energy if the PD coincides with the HartreeFock PD. The other is that the RMSE of the electronelectron interaction and external potential energies is\nminimized with respect to parameters. This determination process is implemented in individual cases before\nand after the correction.\nCalculation results are shown in Fig. 2. From this\nfigure, we find the following points.\n(I) It is found in Fig. 2 that the present method reduces ∆W and ∆V by 89.7% and 66.3%, respectively\n(reductions from case a to c for \"∆W \" and \"∆V \", respectively, in Fig.2). On the other hand, only 1.3% and\n1.1% reductions are made via increasing the NSD from\n2,861 to 12,275 in ∆W and ∆V , respectively (reduction\nfrom case a to b for \"∆W \" and \"∆V \", respectively).\nAlso, as shown in Fig. 2, the RMSE is remarkably reduced by 69.7% (reduction from case a to c) , while it\nis improved only 1.2% by increasing the NSD (reduction\nfrom case a to b). Thus, the reduction rate of the present\nmethod is much larger than that of the extension method\nwith increasing the NSD. This leads to that the search\nregion of PDs is more effectively extended by adding the\nuniformly-scaled PDs than by increasing the NSD. Furthermore, it should be noticed that the present method\nis feasible without additional heavy calculations.\n(II) It is found in Fig. 2 that ∆T is also reduced much\nmore effectively by the present method than by increasing the NSD (80.9% and 1.2% reductions for the former\nand latter, respectively). In general, the accuracy of the\nkinetic energy is dependent on both the appropriateness\nof the approximate form of the functional and that of\nthe resultant PD. Judging from the results of the RMSE,\n∆W and ∆V (Fig. 2), the resultant PD seems to be improved to be close to the ground state one. Therefore,\nwe can deduce that the approximate form itself, which is\ngiven by Eq. (1), would be also sound.\n(III) It is found in Fig. 2 that the virial ratios Rv\nbefore the correction deviate from the correct value -2.0.\nUsing the criterion on the search region, these deviations\nmean that not only the search region C1 but also the\n\n\f0.8\n\n1.6\n\n0.7\n\n1.4\n\n0.6\n\n1.2\n\n0.5\n\n1.0\n\n0.4\n\n0.8\n\n0.3\n\n0.6\n\n0.2\n\n0.4\n\n0.1\n\n0.2\n0% 0.0\n\n0.0\n\na bc\n∆W\n\na bc\n∆V\n\nab c\nRMSE\n\na bc\n∆T\n\nErrors (%)\n\nErrors (%)\n\n4\n\nab c\n∆Rv\n\nFIG. 2: The calculation results of the ∆W , ∆V , RMSE, ∆T\nand ∆Rv . In this figure, the search region C1 , C1′ and C1 ∪ C2\nare simply denoted by the symbols \"a\", \"b\" and \"c\", respectively.\n\nsearch region C1′ are insufficient since the approximate\nfunctional Eq. (1) is consistent with Eq. (3). That\nis to say, even though more than 12,000 SDs are used\nin constructing PDs, the search region is not extended\neffectively. On the other hand, Rv after the correction is\nrigorously equal to -2.0, as it should be. These tendencies\nseem to be consistent with those mentioned in the above\n(I) and (II).\nThus, the present method improves not only ∆W , ∆V\nand RMSE but also ∆T and ∆Rv quite substantially and\neffectively. We can therefore say that the PD is corrected\nto be close to the ground-state one appropriately via the\npresent method.\nIn conclusion, we summarize the features of the correction method proposed here. The most distinctive feature\nis that\n(1) the search region is extended by adding a set of the\nscaled PDs to elements of the search region.\nThe resultant PD that is corrected by this method possesses the following features:\n(2) the corrected PD is N -representable,\n(3) the corrected PD satisfies the virial relation exactly.\nThe validity of the present method is successfully confirmed by numerical calculations of neon atomic system.\nIt is shown that\n(4) not only the RMSE but also the errors of the kinetic\nenergy, electron-electron interaction energy and external\npotential energy are individually all reduced definitely,\n(5) the correction is enough effective even in the small\nsize calculations.\nThis correction method provides an ingenious way to\nextend the search region of PDs efficiently. Due to the\ncomputational easiness of the correction, this method\nwill be extensively applicable to larger systems such as\nmolecules, clusters and solids.\n\n[1] R. G. Parr and W. Yang, Density-Functional Theory\nof Atoms and Molecules (Oxford University Press, New\nYork, 1989), Chap. 2.\n[2] A. J. Coleman, Rev. Mod. Phys. 35, 668 (1963).\n[3] Many-Electron Densities and Reduced Density Matrices,\nedited by J. Cioslowski (Kluwer, Dordrecht /Plenum,\nNew York, 2000).\n[4] P. Ziesche, Phys. Lett. A 195, 213 (1994).\n[5] P. Ziesche, Int. J. Quantum Chem. 60, 1361 (1996).\n[6] A. Gonis, T. C. Schulthess, J. van Ek, and P. E. A.\nTurchi, Phys. Rev. Lett. 77, 2981 (1996).\n[7] A. Gonis, T. C. Schulthess, P. E. A. Turchi, and J. van\nEk, Phys. Rev. B 56, 9335 (1997).\n[8] M. Levy and P. Ziesche, J. Chem. Phys. 115, 9110 (2001).\n[9] F. Furche, Phys. Rev. A 70, 022514 (2004).\n[10] Á. Nagy, Phys. Rev. A 66, 022505 (2002).\n[11] Á. Nagy and C. Amovilli, J. Chem. Phys. 121, 6640\n(2004).\n[12] B. Hetényi, L. Brualla, and S. Fantoni, Phys. Rev. Lett.\n93, 170202 (2004).\n[13] P. W. Ayers and M. Levy, J. Chem. Sci. 117, 507 (2005).\n[14] Á. Nagy, Int. J. Quantum Chem. 106, 1043 (2006).\n[15] P. W. Ayers, S. Golden, and M. Levy, J. Chem. Phys.\n124, 054101 (2006).\n[16] M. Higuchi and K. Higuchi, Physica B 387, 117 (2007).\n[17] M. Higuchi and K. Higuchi, Phys. Rev. A 75, 042510\n(2007).\n[18] M. Higuchi and K. Higuchi, Phys. Rev. B 78, 125101\n(2008).\n[19] K. Higuchi and M. Higuchi, Phys. Rev. B 82, 155135\n(2010).\n[20] E. R. Davidson, Chem. Phys. Lett. 246, 209 (1995).\n[21] S. Kh. Samvelyan, Int. J. Quantum Chem. 65, 127\n(1997).\n[22] M.-E. Pistol, Chem. Phys. Lett. 400, 548 (2004).\n[23] P. Gori-Giorgi and A. Savin, Philos. Mag. 86, 2643\n(2006).\n[24] M.-E. Pistol, Chem. Phys. Lett. 422, 363 (2006).\n[25] M.-E. Pistol, Chem. Phys. Lett. 431, 216 (2006).\n[26] P. W. Ayers and S. Liu, Phys. Rev. A 75, 022514 (2007).\n[27] P. W. Ayers and E. R. Davidson, Adv. Chem. Phys. 134,\n443 (2007).\n[28] M.-E. Pistol, Chem. Phys. Lett. 449, 208 (2007).\n[29] B. Hetényi and A. W. Hauser, Phys. Rev. B 77, 155110\n(2008).\n[30] N. H. March and R. Santamaria, Int. J. Quantum Chem.\n39 585 (1991).\n[31] P. W. Ayers, J. Math. Phys. 46, 062107 (2005).\n[32] P. W. Ayers and M. Levy, Chem. Phys. Lett. 415, 211\n(2005).\n[33] R. Cuevas-Saavedra and P. W. Ayers, Int. J. Quantum\nChem. 109, 1699 (2009).\n[34] P. Hohenberg and W. Kohn, Phys. Rev. 136, B864\n(1964).\n[35] W. Kohn and L. J. Sham, Phys. Rev. 140, A1133 (1965).\n[36] K. Higuchi and M. Higuchi, unpublished.\n[37] This criterion corresponds to just the following statement: Rv is equal to -2.0 if the search region of PDs\ncovers fully the set of the N-representable PDs. Note that\nthe reverse does not necessarily hold.\n\n\f"}