{"id": "http://arxiv.org/abs/0908.0412v3", "guidislink": true, "updated": "2009-11-07T02:49:02Z", "updated_parsed": [2009, 11, 7, 2, 49, 2, 5, 311, 0], "published": "2009-08-04T08:56:07Z", "published_parsed": [2009, 8, 4, 8, 56, 7, 1, 216, 0], "title": "On the Origin of the Checkerboard Pattern in Scanning Tunneling\n  Microscopy Maps of Underdoped Cuprate Superconductors", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0908.4109%2C0908.1127%2C0908.1931%2C0908.1223%2C0908.2264%2C0908.1646%2C0908.4118%2C0908.0137%2C0908.4278%2C0908.2726%2C0908.4343%2C0908.4319%2C0908.1938%2C0908.3574%2C0908.1332%2C0908.1622%2C0908.2806%2C0908.0177%2C0908.4049%2C0908.2035%2C0908.1305%2C0908.0241%2C0908.4362%2C0908.0476%2C0908.2814%2C0908.0320%2C0908.2069%2C0908.4417%2C0908.2667%2C0908.0412%2C0908.0099%2C0908.3006%2C0908.3345%2C0908.2884%2C0908.2181%2C0908.0564%2C0908.1658%2C0908.3692%2C0908.3988%2C0908.2006%2C0908.1472%2C0908.2589%2C0908.3963%2C0908.0614%2C0908.1015%2C0908.3026%2C0908.1218%2C0908.3996%2C0908.1603%2C0908.1182%2C0908.2259%2C0908.3531%2C0908.4507%2C0908.0285%2C0908.0662%2C0908.2888%2C0908.2990%2C0908.0910%2C0908.2881%2C0908.4038%2C0908.0193%2C0908.1155%2C0908.2097%2C0908.2360%2C0908.0466%2C0908.1255%2C0908.0677%2C0908.3514%2C0908.1539%2C0908.3208%2C0908.1078%2C0908.3475%2C0908.3206%2C0908.2849%2C0908.2572%2C0908.1610%2C0908.0827%2C0908.1220%2C0908.4025%2C0908.1497%2C0908.1354%2C0908.1122%2C0908.3838%2C0908.1293%2C0908.3467%2C0908.1952%2C0908.2162%2C0908.0747%2C0908.2479%2C0908.3648%2C0908.3400%2C0908.0063%2C0908.0023%2C0908.2556%2C0908.3297%2C0908.3602%2C0908.3003%2C0908.2537%2C0908.1323%2C0908.1437%2C0908.2713&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "On the Origin of the Checkerboard Pattern in Scanning Tunneling\n  Microscopy Maps of Underdoped Cuprate Superconductors"}, "summary": "The checkerboard pattern in the differential conductance maps on underdoped\ncuprates appears when the STM is placed above the O-sites in the outermost\nCuO$_{\\text{2}}$-plane. In this position the interference between tunneling\npaths through the apical ions above the neighboring Cu-sites leads to an\nasymmetric weighting of final states in the two antinodal regions of\n${\\boldsymbol{k}}$-space. The form of the asymmetry in the differential\nconductance spectra in the checkerboard pattern favors asymmetry in the\nlocalization length rather than a nematic displacement as the underlying\norigin.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0908.4109%2C0908.1127%2C0908.1931%2C0908.1223%2C0908.2264%2C0908.1646%2C0908.4118%2C0908.0137%2C0908.4278%2C0908.2726%2C0908.4343%2C0908.4319%2C0908.1938%2C0908.3574%2C0908.1332%2C0908.1622%2C0908.2806%2C0908.0177%2C0908.4049%2C0908.2035%2C0908.1305%2C0908.0241%2C0908.4362%2C0908.0476%2C0908.2814%2C0908.0320%2C0908.2069%2C0908.4417%2C0908.2667%2C0908.0412%2C0908.0099%2C0908.3006%2C0908.3345%2C0908.2884%2C0908.2181%2C0908.0564%2C0908.1658%2C0908.3692%2C0908.3988%2C0908.2006%2C0908.1472%2C0908.2589%2C0908.3963%2C0908.0614%2C0908.1015%2C0908.3026%2C0908.1218%2C0908.3996%2C0908.1603%2C0908.1182%2C0908.2259%2C0908.3531%2C0908.4507%2C0908.0285%2C0908.0662%2C0908.2888%2C0908.2990%2C0908.0910%2C0908.2881%2C0908.4038%2C0908.0193%2C0908.1155%2C0908.2097%2C0908.2360%2C0908.0466%2C0908.1255%2C0908.0677%2C0908.3514%2C0908.1539%2C0908.3208%2C0908.1078%2C0908.3475%2C0908.3206%2C0908.2849%2C0908.2572%2C0908.1610%2C0908.0827%2C0908.1220%2C0908.4025%2C0908.1497%2C0908.1354%2C0908.1122%2C0908.3838%2C0908.1293%2C0908.3467%2C0908.1952%2C0908.2162%2C0908.0747%2C0908.2479%2C0908.3648%2C0908.3400%2C0908.0063%2C0908.0023%2C0908.2556%2C0908.3297%2C0908.3602%2C0908.3003%2C0908.2537%2C0908.1323%2C0908.1437%2C0908.2713&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "The checkerboard pattern in the differential conductance maps on underdoped\ncuprates appears when the STM is placed above the O-sites in the outermost\nCuO$_{\\text{2}}$-plane. In this position the interference between tunneling\npaths through the apical ions above the neighboring Cu-sites leads to an\nasymmetric weighting of final states in the two antinodal regions of\n${\\boldsymbol{k}}$-space. The form of the asymmetry in the differential\nconductance spectra in the checkerboard pattern favors asymmetry in the\nlocalization length rather than a nematic displacement as the underlying\norigin."}, "authors": ["Kai-Yu Yang", "Wei-Qiang Chen", "T. M. Rice", "Fu-Chun Zhang"], "author_detail": {"name": "Fu-Chun Zhang"}, "author": "Fu-Chun Zhang", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1103/PhysRevB.80.174505", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/0908.0412v3", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0908.0412v3", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "8 pages, 5 figures, final version", "arxiv_primary_category": {"term": "cond-mat.supr-con", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cond-mat.supr-con", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "cond-mat.str-el", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0908.0412v3", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0908.0412v3", "journal_reference": "Phys. Rev. B 80, 174505 (2009)", "doi": "10.1103/PhysRevB.80.174505", "fulltext": "On the Origin of the Checkerboard Pattern in Scanning Tunneling Microscopy Maps\nof Underdoped Cuprate Superconductors\nKai-Yu Yang,1 Wei-Qiang Chen,2 T. M. Rice,1,3 and Fu-Chun Zhang\n\n2,3\n\n1\n\narXiv:0908.0412v3 [cond-mat.supr-con] 7 Nov 2009\n\n3\n\nInstitut für Theoretische Physik, ETH Zürich,CH-8093 Zürich, Switzerland\n2\nCenter for Theoretical and Computational Physics and Department of Physics,\nThe University of Hong Kong, Hong Kong SAR, China\nKavli Institute for Theoretical Physics, University of California, Santa Barbara, CA 93106 USA\n(Dated: October 29, 2018)\n\nThe checkerboard pattern in the differential conductance maps on underdoped cuprates appears\nwhen the scanning tunneling microscopy is placed above the O-sites in the outermost CuO2 -plane. In\nthis position the interference between tunneling paths through the apical ions above the neighboring\nCu-sites leads to an asymmetric weighting of final states in the two antinodal regions of k-space.\nThe form of the asymmetry in the differential conductance spectra in the checkerboard pattern\nfavors asymmetry in the localization length rather than a nematic displacement as the underlying\norigin.\nPACS numbers: 74.72.-h, 74.25.Jb, 74.62.Dh\n\nI.\n\nINTRODUCTION\n\nThe large scale detailed maps of the tunneling density of states (DOS) in underdoped cuprates obtained\nrecently by scanning tunneling microscopy (STM) have\naroused great interest.1 This surface sensitive technique\nto date has been limited to strongly disordered BSCCO\nand Ca2−x Nax CuO2 Cl2 samples. An analysis of these\nDOS-maps found a local breaking of the square symmetry\nof the underlying lattice to form a checkerboard pattern.\nThe presence of this checkerboard pattern in these two\ndifferent underdoped cuprates has been interpreted as evidence for the presence of an intrinsic bond-centered electronic glass with unidirectional domains as a key characteristic of the pseudogap phase in underdoped cuprates.2\nA number of different interpretations of this pattern have\nalso been suggested in the literature.3,4,5,6,7,8,9 In our\nstudy we reexamine possible origins for this pattern in\nlight of very recent STM experiments.10\nThe new STM data taken in the superconducting state\nat low temperatures, show that the checkerboard pattern\nappears most prominently at voltages where the tunneling processes are predominantly into antinodal regions\nin k-space. At lower voltages the spatial pattern of the\nDOS-maps is quite different. The low energy pattern\nin the superconducting state was successfully analyzed\nas arising from interference generated by the scattering\nof propagating Bogoliubov quasiparticles in the presence\nof weak disorder.11 Kohsaka et al. found that a rapid\nchange in the spatial pattern in the DOS-maps occurred\nat the tunneling voltage corresponding to the energy of\nnodal centered arcs of Bogoliubov quasiparticles at their\nendpoints on the diamond formed by the lines in k-space\nconnecting the antinodal points.10 Thus the checkerboard\npattern which appears at higher voltages is formed by the\ntunneling of electrons and holes into pseudogap state located in the antinodal regions of k-space. The key question to be answered is the origin and interpretation of\nthis checkerboard pattern.\n\nThe checkerboard pattern is characterized by a local\nsymmetry breaking which reduces the square C4 symmetry of the Cu-O-Cu bonds in a (CuO)4 square plaquette\nto C2 symmetry leading to a unidirectional pattern of\ndomains with a glassy short range order on the length\nscale of 4a (a: lattice parameter). This short range order with local symmetry breaking has led to proposals\nthat a static spin-charge stripe glass coexists with the\nsuperconductivity.5,6,8,9 Another set of proposals3,4,7 are\nbased on the existence of static fluctuations in an order parameter which breaks both translational and C4\nsymmetry leading to strong scattering of the Bogoliubov quasiparticles consistent with the observations. At\nthis point we should comment on the difficulties associated with an explanation based on an intrinsic symmetry\nbreaking. While it is true that the STM experiments were\nperformed on the highly disordered cuprates, BSCCO\nand Ca2−x Nax CuO2 Cl2 , because of their good surfaces.\nNot all underdoped cuprates are disordered, for example, the two members of the YBCO family, YBa2 Cu4 O8\nand YBa2 Cu3 O6.5 -ortho-II, are well ordered and intrinsically strongly underdoped with hole concentrations estimated to be x = 0.14 and 0.1 respectively. Indeed\nsamples of these cuprates are of sufficient quality to allow the observation of quantum oscillations at high fields\nand low temperatures.12 Zero field experiments on these\nwell ordered samples show no evidence of static broken\ntranslational symmetry in nuclear magnetic resonance\n(YBa2 Cu4 O8 )13 or neutron scattering (YBa2 Cu3 O6.5 ortho-II ) experiments.14 This lead us to conclude that\nthe translational symmetry breaking observed by STM\nin the BSCCO and Ca2−x Nax CuO2 Cl2 samples results\nfrom the strong disorder associated with random doping\na short range spin liquid in these cuprates.\nIn this paper we propose that the checkerboard pattern\nobserved by STM is caused by the local disorder in the\nCuO2 planes. Our explanation goes back to the observation by Chen, Rice and Zhang (CRZ)15 that when the\nSTM tip is centered above the planar O-sites, it couples\n\n\f2\nto two tunneling paths through apical Cl ions above the\nneighboring Cu-sites and as a consequence interference\nbetween these paths plays an important role. This interference leads to a different tunneling matrix elements\nfor electrons into hole states which are bonding (antibonding) upon reflection about the central O-site of the\nCu-O-Cu bond.15 CRZ considered the dilute limit and\nexamined the localized states of a single hole bound to a\nNa+ -acceptor in a Ca2−x Nax CuO2 Cl2 sample. The Na+ acceptor sits above the center of a (CuO)4 square plaquette. They found a doubly degenerate acceptor bound\nstate which in the presence of a local quadrupole electric\nfield splits into two states, each with only C2 bonding\nsymmetry. However this explanation of the local symmetry reduction from C4 to C2 symmetry is not compatible\nwith the recent STM data, which shows that the checkerboard pattern is formed by the tunneling of electrons and\nholes into pseudogap states located in the antinodal regions of k-space. The lowest energy for a single hole is\nat the nodal regions of k-space so that single hole acceptor bound states are made up from combinations of\nhole states near to the nodal not antinodal regions of\nk-space. Nonetheless their main conclusion that interference of tunneling paths occurs when the STM tip is\nabove an O-site, remains valid.\nIn light of this new STM data10 we concentrate our attention on the role of the antinodal regions of k-space as\norigins of the checkerboard pattern. There are two such\nregions, one near (π,0) and the other near (0,π). The\nbonding-antibonding pattern on the Cu-O-Cu bonds differs between the two antinodal regions. For quasiparticle\nnear the (0,π) antinodal region the Bloch phase factor is\nbonding on Cu-O-Cu in the x-direction and anti-bonding\nin the y-direction, as shown in Fig.1(b). This pattern\nis reversed for the case of the (π,0) antinodal region.\nThus when the STM tip lies above the planar O-sites\nin a (CuO)4 square plaquette the stronger signal comes\nfrom the antinodal region with a bonding phase factor\nand a local difference in the tunneling DOS between the\ntwo antinodal regions will cause a breaking of the C4 to\nC2 symmetry. This symmetry breaking occurs only when\nthe STM tip lies above the O-sites in a (CuO)4 square\nplaquette but not when the tip is above Cu-sites. Typical\ncheckerboard patterns display strong modulation above\nthe planar O-sites but much weaker modulation is observed at the Cu sites. This strongly suggests that we\nshould concentrate on possible mechanisms that locally\ndifferentiate the two antinodal regions since it is this difference which will show up at the planar O-sites.\nIn their recent paper, Kohsaka et al. discussed the\nconditions that enhance the checkerboard pattern in the\ntunneling maps. They find that the pattern emerges most\nclearly in Z-maps which plot the ratio of differential conductances g(r, V ), at opposite bias, i.e.\nZ(r, E = eV ) = g(r, +V )/g(r, −V )\n\n(1)\n\nFurther the checkerboard pattern is most pronounced\nwhen the voltage V is adjusted locally to the local pseu-\n\nSTM\n\n-\n\n-\n\n-\n\n-\n\n-\n\n-\n\n+\n\n+\n\n+\n\n+\n\n+\n\n-\n\n-\n\n-\n\n-\n\n-\n\nCu\n\n+\nCu\n\n-\n\nOy\n\n+\n\n+\n\n+\n\n+\n\n+\n\n+\n\n-\n\n-\n\n-\n\n- Ox -\n\n-\n\n+\n\n+\n\n+\n\n+\n\n+\n\n+\n\nFIG. 1: (Color online) Top panel: schematic demonstration\nof the interference of the possible two tunneling paths from\nSTM tip to the Cu-O-Cu hybrid state when the tip is at the\nmidway between two Cl atoms. Lower panel: the contribution\nof the antinodal kA,y = (0, π) state to the two interference\npaths. The blue and red dots are Cu sites with the alternative\nsign along y-direction denoting the sign of the Bloch wave\nfunction of antinodal kA,y quasiparticles as shown in Eq.8.\n(The signs for the dx2 −y2 symmetry of Cu-orbitals are not\nshown.) For the kA,y/x quasiparticle contributions to Oy/x of\nthe two paths cancel each other, meanwhile the contributions\nto Ox/y of the two paths add together.\n\ndogap value. This value varies strongly across the field\nof view in the STM measurements. This is typically\n40a × 40a and the typical length scale of the variation\nin the local value of the pseudogap is roughly 4a, similar\nto the length scale of coherent checkerboard patterns.\n\nIn this paper we examine possible sources of local symmetry breaking from C4 to C2 symmetry in the STM\npatterns in the presence of strong local disorder, combining the CRZ theory for STM tunneling with the Yang,\nRice and Zhang (YRZ)16 phenomenological form for the\nsingle electron propagator in the underdoped pseudogap\nphase.\n\n\f3\nII.\n\nYRZ-PHENOMENOLOGICAL SINGLE\nPARTICLE PROPAGATOR\n\nYRZ based their propagator on a generalization of the\nform of the propagator for a lightly doped array of 2leg Hubbard ladders derived by Konik et al.17 . They\nintroduced a self-energy, ΣR (k, ω, x), which diverges at\nω = 0 on a surface spanned by elastic particle-particle\numklapp scattering analogous to the behavior of the ladder model. In the 2D square lattice this umklapp surface is a diamond connecting antinodal points on the\nBrillouin zone boundary. Note this umklapp surface appears as the energy gap surface also in the case of wider\nHubbard ladders with more than 2 legs18 . YRZ took\nover the form of d-wave RVB gap function ∆R (k, x) =\n∆0 (x)(cos kx − cos ky ) from the renormalized mean field\ntheory of Zhang et al.19 Using their Gutzwiller renormalization factor gt (x) for longer range hopping, YRZ proposed a form for the coherent part of the single particle\npropagator GP (k, ω, x) in the pseudogap state,\ngt (x)\nGP (k, ω, x) =\nω − \u000f(k) − μ − ΣR (k, ω, x)\nX Zi\nk\n= gt (x)\nω\n−\nEki\ni\nΣR (k, ω, x) =\n\n∆2R (k, x)\nω + \u000f0 (k)\n\n(2)\n\nwhere \u000f0 (k) only includes the NN renormalized hopping\ncontribution, meanwhile \u000f(k) includes both the NN and\nlonger range renormalized hopping contributions.\nThe YRZ propagator fits well the quasiparticle dispersion Eki and their weight Zki seen in angle resolved\nphotoemission (ARPES) experiments on the pseudogap\nphase.16,20 It has aslo been used successfully to interpret a number of other experiments on the cuprate superconductor, i.e. Raman scattering21 , optical properties22 ,\nand specific heat23 . Recently Yang et al.20 showed that it\nalso accounts well for the particle-hole asymmetry in the\nquasiparticle properties opening up along the Fermi arcs\nreported by Yang et al. in the normal pseudogap phase.24\nVery recently25 the temperature and doping dependence\nof superconducting penetration depth was also shown to\nfit well to this scheme. In the antinodal regions of k-space\nthe energy gap is largest with a magnitude ∆R (kA , x),\nwhere kA is an antinodal wavevector: kA,x = (π, 0) and\nkA,y = (0, π). The value of ∆0 (x) is taken from the\nrenormalized mean field theory of Zhang et al. for the\nRVB state.19 It is a strong function of the hole density,\nx, dropping linearly with increasing x from ∆0 at x = 0\nto 0 at a critical hole concentration x = xc (∼ 0.2).\nIII. RANDOM ELECTRIC FIELD IN A\nTHOMAS-FERMI APPROXIMATION\n\nIn the cuprates BSCCO and Ca2−x Nax CuO2 Cl2 which\nhave been studied in the STM experiments, the holes are\n\nintroduced by randomly distributed acceptors situated\nabove and below the CuO2 -planes. The random electric\nfield φ(r) associated with the acceptors generates a random component in the local hole density. The case of\na slowly varying potential can be treated in a ThomasFermi approximation. The hole chemical potential μh is\na constant in space. In the YRZ propagator the hole\npocket is determined by the quasiparticle energy contour\nat the chemical potential μh which lies above the minimum hole energy Ehb located at the midway between the\nnode and (π/2, π/2) points in hole notation as shown in\nthe upper panel of Fig. 2. The hole density of states\n(DOS) rises almost linearly with increasing hole energy\nin the YRZ ansatz, in agreement with recent angle integrated photoemission data.26 The spatial varying hole\nFermi energy Eh (r) relative to the bottom of the hole\nband in a simple Thomas-Fermi ansatz is given by\nEh (r) = μh − φ(r)\n\n(3)\n\nleading to a spatial variation in the hole density x(r), as\nshown in the lower panel of Fig. 2. This has two effects,\nfirst, a breathing of the area enclosed by the hole pockets\nand therefore the Fermi arcs observed by ARPES and\nby quasiparticle interference in STM. Second, it introduces a local variation in the RVB gap ∆R (kA , x) which\nas remarked above, is a strong function of the hole density. The strong spatial variation in the RVB gap can\nbe measured by the energy of the maximum in the DOS\nrelative to the constant chemical potential. That has\nbeen reported in several STM studies.2,10,27 A breathing\nof the Fermi arc determined by quasiparticle interference\nin STM spectra, was recently reported by Wise et al.27\nIV.\nINTERFERENCE IN TUNNELING\nSPECTRA WITH THE STM TIP ABOVE O-SITES\n\nThe detailed STM maps showing the checkerboard patterns were taken on two compounds, Dy-doped BSCCO\nand Ca2−x Nax CuO2 Cl2 . In BSCCO samples the outmost surface layer is a BiO plane with the Bi-ions located\ndirectly above the Cu-sites in the CuO2 -plane. Assuming the STM tips couple predominantly to the empty\n6s/6p Bi-orbitals, the analysis presented below will apply also to BSCCO. We shall restrict ourselves to the\nformer which has a simpler structure. At this point it\nis useful to recap the CRZ analysis, which discussed the\nrole interference between neighboring tunneling paths in\nthe STM maps. Meanwhile, we focus on the antinodal\nquasiparticles. With the STM tip centered at position\nr, the differential conductivity at T=0 and voltage V , is\nfollowing Tersoff and Hamann,28\nX\ndI(r)\n∝\n| hm | a†r,σ | Ψ0 i |2 δ(ω − Em + E0 ) (4)\ndV\nσ,m\nwhere a†r,σ is the electron creation operator at position r,\n| mi are final eigenstates with energy Em , and ω = eV ,\n\n\f4\nhalfway between the two Cu-ions at i and i + τ , the integrated current will be sensitive to the relative phase of\nthe hole states centered at the NN Cu -ions. Note the orthogonality of the Cl 3pz -states to the dx2 −y2 -symmetry\nof the hole states centered on the Cu-site underneath\nleads to a dominant hybridization with the hole states\ncentered on the 4 NN Cu-sites.29 Finally, we arrive at\nthe result for the tunneling currents when the STM tip\nlies halfway between NN Cl sites, i.e. above the O-sites\nin the x/y oriented Cu-O-Cu bonds I Ox/y (r + τ /2, ω)\nand I Cu (r, ω) when the STM tip lies above a Cu site\n\n0.4\n0.2\n\n0.4\n0.2\n0\n-0.2\n-0.4\n-0.6\n-0.8\n-1\n\n0\n-0.2\n-0.4\n-0.6\n-0.8\n-1\n\n1.00 /\n0.75 /\n0.00 /\n0.25 /\n0.50 /\n0.75 /\n1.00 /\n\n0.50 /\n0.25 /\n\n0\nΦ( r 2)\n\nI Ox/y = Θ(ω − Em + E0 )\nX\n\u0001\n0\n| hm |\n(−1)τx c†i+τ 0 ,σ + c†i+τ +τ 0 | Ψ0 i |2\n\nΦ( r 2)\n\nE h ( r 1)\n\nτ 0 ,σ\n\nE h ( r 2)\nI\n\nh\n\nCu\n\n= Θ(ω − Em + E0 )\nX\n0\n| hm |\n(−1)τx c†i+τ 0 ,σ | Ψ0 i |2\n\n(7)\n\nτ 0 ,σ\n\nFIG. 2: (Color online) Top Panel: the low band from the\nsingle particle propagator Eq.2 in pseudogap state with the\nFermi surface (hole pocket) projected on the xy plane. The\nbottom of the hole fermi sea is located at the midway between\nthe node and (π/2, π/2). Lower panel: schematic demonstration of the spatial variation of the hole Fermi energy Eh (r)\ndue to the random electric field φ(r).\n\n| Ψ0 i is the ground state with energy E0 . The outermost\nsurface layer is composed of Cl-ions which sit directly\nabove the Cu-ions in the topmost CuO2 -layer, so that\nthe STM tip couples primarily to their 3pz -states (see\nFig 1). When the STM tip is scanned from above the\nCl-ion at i to a NN Cl-ion site, i + τ [τ = (±1, 0) or\n(0, ±1)], we have\na†r,σ = hi, Cl | rip†Cl,i,σ + hi + τ , Cl | rip†Cl,i+τ ,σ\nX\np†Cl,i,σ =\nhi + τ 0 , Cu | i, Clic†i+τ 0 ,σ\n\nc†i,σ ∼ c†kA,x (−1)ix + c†kA,y (−1)iy\n\nτ0\n0\n1X\n(−1)τx c†i+τ 0 ,σ\n∼\n2 0\n\nCRZ considered the case of a single hole bound to a Na+ acceptor which they showed may well have a doubly degenerate ground state. This degeneracy in turn splits\nin the presence of a quadrupole electric field, into states\nwith reflection symmetries with respect to the x and y\naxes Px = ±1, Py = ±1 i.e. bonding and anti-bonding\nstates at the O-sites. They showed that this lower C2\nsymmetry shows up in the tunneling current.\nAs we remarked earlier, the new STM data on underdoped Ca2−x Nax CuO2 Cl2 samples show that the\ncheckerboard pattern is associated into antinodal states\nrather than the single hole bound states considered by\nCRZ. Note, however, quasiparticles in the antinodal regions states are composed of Bloch states near kA,x =\n(π, 0) and kA,y = (0, π), and these have similar reflection\nproperties with opposite parities for reflections about the\nx- and y- axes. Focusing on the contributions from antinodal quasiparticles, we can set\n\n(5)\n\nτ\n\n0\n\nwhere (−1)τ x is from the dx2 −y2 symmetry of the Cuorbital, p†Cl,i,σ is the electron creation operator at site i\nc†i,σ\n\nCl, and\nis the electron creation operator for the dp hybridized orbital centered on the Cu-site at i. The\nintegrated current up to a positive voltage V (electron\ninjection) is then\n\n(8)\n\nwith the sign alternating pattern from kA,y shown in\nFig.1(b). So that when the tip is above the Ox/y site\nat i + τ /2\n\u0003\n0\u0002\n1X\n(−1)τx c†i+τ 0 ,σ + c†i+τ 0 +τ ,σ\n2 0\nτ\nX\n\u0002\n\u0003\n0\n0\n∼\n(−1)τx c†kA,x/y (−1)(i+τ )x/y 1 + (−1)τx/y\n\na†i+τ /2,σ ∼\n\nkA,x/y ,τ 0\n\n(9)\nI(r, ω) =\n\nX\nσ,m\n\n| hm |\n\nX\n\n0\u0002\n(−1)τx hi, Cl | ric†i+τ 0 ,σ\n\nτ0\n\n\u0003\n+hi + τ , Cl | ric†i+τ 0 +τ | Ψ0 i |2\nΘ(ω − Em + E0 )\n\n(6)\n\nΘ is the Heaviside step function. CRZ pointed out that,\nwhen the tip is positioned above the O-ion at i+τ /2 lying\n\nFrom the factor 1 + (−1)τx/y , it is obvious that for Ox/y\nthe contribution from the kA,x/y quasiparticles vanishes,\nmeanwhile that from kA,y/x is enhanced due to the interference effect, as schematically shown in Fig.1 As a\nresult any local perturbation which breaks the symmetry\nbetween the two antinodal regions of k-space will lead\nto a lower C2 symmetry in the tunneling current. This\n\n\f5\nCu\nOy\nOx\n\n12\n\n6\n\n1c-2d-1e\n\n4\n1a-2b-1c\n\n-150-100 -50\n\n0\n\n50 100 150\n\nE (meV)\n\nleads us then to look at various sources that can give rise\nto such local symmetry breaking in this highly random\nsystem. To proceed further it is useful to examine the nature of the anisotropy observed in the tunneling spectra\nmore closely.\nMEASURED ANISOTROPIC STM\nTUNNELING SPECTRA.\n\nKohsaka et al.10 found that the checkerboard pattern\nemerges most clearly in Z-maps which plot the ratio of\ndifferential conductances g(r, V ), at opposite bias, when\nthe voltage V is chosen to be at the local value of the\nantinodal energy gap. In an earlier publication by the\nsame group, individual spectra g(r, V ), where plotted\nfor a series of tip positions placed above O-sites in a\nsmall area with a pronounced checkerboard modulation.2\nThis is illustrated in the checkerboard modulation which\nshows up clearly in the R-map in Fig.3 which is reproduced from their Fig.4B.2 The R-ratio measures the ratio\nof the integrated currents I(r, V ), at positive and negative voltages\n(10)\n\nThe map reproduced in Fig. 3 shows the R-pattern taken\nat an energy E = 150 meV, with clear modulations when\nthe tip is above the O-sites with a local C2 symmetry\nbut almost no modulations are observed over the Cusites (denoted by black crosses). The value of the R-ratio\nover the O-sites ranges from 0.9 (shown as white) to 0.5\n(black).\nThe individual differential conductances taken above a\nseries of O- and Cu- sites were also shown in their Fig.\n\ndI/dV (arb. units)\n\ndI/dV (arb. units)\n\n1e-2f-1g\n\n8\n\n0\n\n3 4\n\nR(r, E = eV ) = I(r, +V )/I(r, −V )\n\n10\n\n2\n\nFIG. 3: (Color online) Typical checkerboard pattern revealed\nby R-map in Na-CCOC observed in one recent STM experiments Ref.2 (reproduced from original paper). The blue solid\ncircles (red solid stars) show the position of the oxygen atoms\non Cu-O-Cu bond along x/y directions [labelled by the combination of vertical lines (1-4) and horizon (a-i)].\n\nV.\n\n4g-3h-4i\n\n10\n\ni\nh\ng\nf\ne\nd\nc\nb\na\n1 2\n\n12\n\n1g-2h-1i\n\n8\n\n4e-3f-4g\n\n6\n4c-3d-4e\n4\n2\n0\n\n4a-3b-4c\n\n-150-100 -50\n\n0\n\n50 100 150\n\nE (meV)\n\nFIG. 4: (Color online) Differential tunneling conductance\nspectra taken on oxygen sites along the vertical lines (1,2,3,4)\nas indicated in Fig. 3, reproduced from Kohsaka et al.10 .\nEach subpanel shows the comparison of dI/dV between the\ntwo neighboring Ox s (blue and cyan) and one Oy (red) on\neach (Cu-O-Cu)4 palette (with the position shown in Fig.3).\nNote that the spectra is normalized to have the same intensity\nat negative voltages to facilitate the comparison and demonstrate the lowering of the symmetry from C4 to C2 .\n\n5B. We have extracted the individual tunneling spectra\ng(r, V ) above the O-sites in this typical small area with\na pronounced checkerboard pattern in the R-map (shown\nin Fig. 5B of Ref[2] ). All spectra on these underdoped\nsamples show a substantial asymmetry between negative\nand positive voltages30,31 . The negative voltage spectra, which correspond to electron extraction or hole injection, show little structure and has the larger differential conductances. Since a hole can easily exchange positions with a neighboring occupied site, while an electron\ncan only hop onto the unoccupied neighboring sites, the\ntunneling processes that accompany an injected hole are\nmuch stronger than those for an electron, as shown by\nAnderson and Ong30 and by Randeria et al. 31 . Within\nthe renormalized mean field theory (RMFT) of Zhang et\nal.19 , the asymmetry is largely due to the incoherent tunneling process in the hole injection. In the approach we\nuse here based on the YRZ normal state propagator, only\ncoherent parts of the tunneling processes are included,\nand the particle-hole asymmetry appears at finite voltages which involves tunneling into quasi-particle states\naway from the chemical potential. The positive voltage\nspectra show a clear peak around an energy of order 100\nmeV. Such a peak appears in the density of states calculated for the YRZ propagator by Yang et al.16 The YRZ\npropagator is an ansatz to describe coherent quasiparticles moving in a RVB background and so should agree\nbetter for positive voltage due to the weaker contribution\nof inelastic processes which accompany electron injection.\nIn the subsequent discussion we will focus on the positive\nvoltage spectra and normalize the spectra to be the same\nin the negative voltage region. In Fig. 4 we show a series\nof the differential conductances with the tip above O-sites\n\n\f5\n\n(a): tx/y /t = 1.0\n\n4\n\nOx/y\n\n3\n2\n1\n\nCu\n\nN(E) (arb. units)\n\nN(E) (arb. units)\n\n6\n\n-150-100-50 0 50 100 150\nE (meV)\n10\n(c): tx/y /t = 1.0\n8\n6\n\nOx/y\n\n4\n2\n\nCu\n0\n-150-100-50 0 50 100 150\nE (meV)\n\n4\n3\n\n(b): tx/y /t = 1.0 +/- 0.1\nOy O\nx\n\n2\n1\n\nCu\n\n0\n\nN(E) (arb. units)\n\nN(E) (arb. units)\n\n0\n\n5\n\n-150-100-50 0 50 100 150\nE (meV)\n10\n(d): tx/y /t = 1.0 +/- 0.1\n8\n6 Oy\n4\n\nOx\nCu\n0\n-150-100-50 0 50 100 150\nE (meV)\n2\n\nsuming that the intrinsic asymmetry in the self energy\nin the YRZ propagator is small, the change of NN hopping integrals tx/y leads to a relative displacement of the\nreference energy for the RVB splitting at kA,x and kA,y .\nThis in turn leads to a shift in the position of the energy\ngaps ∆R (kA , x), relative to the constant chemical potential. This is apparent in Fig. 5 which shows the predicted\nanisotropy arising from a uniform hopping asymmetry.\nThe density of states, N (E), observed by putting the\nSTM tip above Ox/y and Cu sites takes the following\nform from Eq.(7)\nN Ox/y (E) ∼\n\nX\ni,k\n\nN\n\nCu\n\n(E) ∼\n\nX\n\nZki cos2\n\nkx/y\n(cos kx − cos ky )2 δ(Eki − E)\n2\n\nZki (cos kx − cos ky )2 δ(Eki − E)\n\n(11)\n\ni,k\n\nFIG. 5: (Color online) The density of states on Cu and two\nkinds oxygen sites [Ox/y ] from YRZ propagator Eq.11 without\n(panels a and b) and with (panels c and d) the interference\nfactor (cos kx − cos ky )2 . Panels (b, d) are the results in the\npresence of an intrinsic C2 asymmetry in the NN hopping integrals along x and y direction tx/y /t = 1 ± 0.1. The splitting\nof the peaks at positive voltage shows up clearly. The other\nparameters are as following: ∆0 = 0.4, t0 = −0.3, t00 = 0.2,\ndoping x = 0.10 (all energies are of unit t = 300meV). Very\nsmall superconducting gaps are added to each band in pseudogap state, which does not change the RVB gap behavior (the\ntwo pronounced peaks at high energy ∼ 100meV) on Ox/y .2\n\nin the x/y oriented Cu-O-Cu bonds. The difference from\nthe lower C2 -symmetry is clearly visible.\n\nVI. POSSIBLE SOURCES OF THE\nANISOTROPY IN THE TUNNELING SPECTRA.\n\nWe now discuss a number of physical effects which\ncould cause an anisotropy in the tunneling spectra.\n\nA.\n\nIntrinsic C2 asymmetry due to nematic or\nPomeranchuk order\n\nAn asymmetry between the two antinodal regions near\nkA,x = (π, 0) and kA,y = (0, π) suggests that an intrinsic instability which breaks the C4 -symmetry may\nbe present in these samples. The possibility of such an\ninstability has been discussed extensively in the literature. One set of these proposals focuses on a quantum\nelectronic liquid crystal with nematic order.32,33,34,35 A\nsecond on a Pomeranchuk instability which splits the\ntwo Van Hove singularities.36,37 Recent neutron scattering measurements of the low frequency spin fluctuations\nin YBCO samples have been interpreted as evidence for\nsuch intrinsic instabilities.38 In the presence of intrinsic\nasymmetry the NN hopping matrix elements in the xand y- directions tx and ty will be slightly different. As-\n\nwhere (cos kx − cos ky )2 is the interference factor due to\nthe hybridization with the hole states centered on the 4\nNN Cu-sites as discussed earlier.\nIn a clean well ordered sample with intrinsic C2 asymmetry order large domains should occur but in the\nhighly disordered Ca2−x Nax CuO2 Cl2 samples there is a\nstrong spatially varying electric field. The linear coupling between the orientation of the domains and the\nlocal quadrupole component of a random electric field\nacts as a random orienting field on the order. Since the\nsymmetry of the order is Ising like, the random orienting field will act similarly to a random field in an Ising\nmodel. It is well known that the ground state of this\nIsing model consists of a random array of domains, consistent with the orientational domains observed in the\ncheckerboard patterns. A word of caution, however, is in\norder. The local anisotropy in the STM spectra does not\nseem to be consistent with that predicted for this type\nlocal asymmetry order. The spectra in Fig. 4 show a C2\n-modulation pattern arising from an overall reduction in\nthe positive voltage spectra, rather than a shift in the\nmaxima that would signal the presence of this intrinsic\nC2 asymmetry in Fig.5.\nThe theoretical DOS for the STM tip located above\nCu- and O-sites shown in Fig.5 display considerably\nsharper structure in both cases, with and without the\nweighting factor (cos kx − cos ky )2 , than is evident in\nthe experimental conductances in Fig.4. The theoretical DOS contain two prominent features. One is the\napproximately linear drop from negative to positive voltages leading to the minimum at ' 60meV. Interestingly\nthis linear feature has been reported in integrated photoemission studies on BSSCO samples by Hashimoto et\nal.,26 as discussed recently by Yang et al.20 . In the STM\nspectra there are signs of a minimum at positive voltages\nin the spectral 2h, 2f in Fig.4, but at a smaller voltage and\nfaint signs in the other spectra. The second feature is the\nvery sharp peak at ∼ 100meV in the theoretical spectra\nand the much broader peaks at around the same energy\nin the STM spectra. For both discrepancies a possible\nremedy could be the much stronger disorder broadening\n\n\f7\nin the local probe in the STM spectra as compared to\nspatially averaged spectra observed in photoemission.\n\nB.\n\nRandom electric fields\n\nThe random distribution of Na+ -acceptors in\nCa2−x Nax CuO2 Cl2 samples generates a random electric\nfield. The local quadrupole component of this field\nacting on a (CuO)4 plaquette will couple differently to\nthe states at kA,x and kA,y . The former is anti-bonding\non the Cu-O-Cu bonds along the x-axis and bonding\non the Cu-O-Cu bonds along the y-axis while the latter\nhas the opposite bonding pattern. These patterns cause\nopposite quadrupole charge distributions in the two\nstates leading to a potential splitting of the antinodal\nstates in the presence of an external electric quadrupole\nfield. This potential splitting will generate STM spectra\nsimilar to those we found for hopping asymmetry and so\nit also differs from the anisotropy displayed in Fig. 4\n\nC.\n\nVariations in the quasiparticle weight and in\nthe localization length\n\nThe tunneling DOS into quasiparticle states is\nweighted by the quasiparticle weight in the single particle propagator. In the YRZ ansatz this weight is taken\nfrom the RMFT calculations of Zhang et al.19 and is simply proportional to the hole density, x. However the fact\nthat little change in the energy gaps ∆R (kA,x , x), is evident in the spectra shown in Fig. 4 argues against such\nan explanation. Also the spatial variation in the hole\ndensity is longer ranged than the distance between Osites on a (CuO)4 . Another possibility is that there is\nsubstantial anisotropy in the disorder scattering in kspace which causes a local anisotropy in the localization lengths. An anisotropic energy shift and localization length could result, if the potential scattering from\nthe disorder is mainly between opposite antinodal points\nrather than between ±kA,x and ±kA,y . An anisotropic\nenergy shift, for example, could remove weight from the\nenergy range ( 200meV) covered in the STM experiments.\nThe somewhat longer range of the disorder potential is\nconsistent with this suggestion. The umklapp correlated\nscattering wave vector for backscattering between the\n\n1\n\n2\n\n3\n\n4\n5\n\nFor a recent review see K. M. Shen and J. C. S. Davis,\nMaterials Today, 11, 14 (2008).\nY. Kohsaka, C. Taylor, K. Fujita, A. Schmidt, C. Lupien,\nT. Hanaguri, M. Azuma, M. Takano, H. Eisaki, H. Takagi,\nS. Uchida, and J. C. Davis, Science 315, 1380 (2007).\nL. Balents, L. Bartosch, A. Burkov, S. Sachdev, and K.\nSengupta, Phys. Rev. B 71, 144509 (2005)\nZ. Tesanovic, Nature Phys. 4, 408 (2008)\nM. Vojta and O. Rosch, Phys. Rev. B 77, 094504 (2008)\n\nantinodal regions near ±kA,x (or ±kA,y ) is much smaller\nthan the wave vector connecting the two antinodal regions, ' (π, π). The Fourier transforms of the checkerboard maps show peaks arising from short range order\nin the form of 4a wide unidirectional electronic domains.\nThe analysis presented here does not directly address the\npresence of short range order on a length scale > a. Several authors have suggested that the wave vector of this\nshort range order is approximately equal to the wave vector connecting parallel pieces of the bare band structure\nFermi surface near the saddle points11 and also the wave\nvector connecting the turning points of the quasiparticle\ncontours in the normal state YRZ propagators.39 The\nlength scale of the domains at ∼ 4a is roughly the same\nas the disorder potential length scale but the interpretation of the short range order in the checkerboard patterns\nremains to be an open issue.\n\nVII.\n\nCONCLUSION\n\nIn this paper we have examined several possible origins for the local checkerboard pattern in the tunneling\nDOS measured over Ox/y -sites. The presence of interference between two tunneling paths centered above the\nneighboring Cu-sites leads to an anisotropic weighting\nof the two antinodal regions in k-space. Thus the local C2 pattern of the checkerboard can reflect an asymmetry between the two antinodal k-space regions. An\nasymmetric hopping (tx , ty ) could arise from an intrinsic\ninstability e.g. towards nematic or Pomeranchuk order.\nThis would split the energies of the pseudogaps at ±kA,x\nand ±kA,y . However, an examination of the measured\nanisotropy in the differential conductance points rather\ntowards an asymmetry in the average magnitude of the\nconductance, which possibly could result from a difference in the localization lengths at the two antinodal saddle points in the quasiparticle dispersion.\nWe are very grateful to J.C.S. Davis and Y. Kohsaka\nfor permission to reproduce their STM data and Y. Chen\nfor stimulating discussions. Support from the MANEP\nprogram of the Swiss National funds (K.-Y. Y. and T.\nM. R.), and RGC grant of HKSAR (W.-Q. Chen and\nF. C. Z.) is gratefully acknowledged. This research was\nsupported in part by the National Science Foundation\nunder Grant No. PHY05-51164.\n\n6\n7\n\n8\n\n9\n10\n\nM. Granath, Phys. Rev. B 77, 165128 (2008)\nEun-Ah Kim, M. J. Lawler, P. Oreto, S. Sachdev, E. Fradkin, and S. A. Kivelson, Phys. Rev. B 77, 184514 (2008)\nA. Pelissetto, S. Sachdev, and E. Vicari, Phys. Rev. Lett.\n101, 027005 (2008)\nM. Vojta, Phys. Rev. B 78, 144508 (2008)\nY. Kohsaka C. Taylor, P. Wahl, A. Schmidt, Jhinhwan\nLee, K. Fujita, J. W. Alldredge, K. McElroy, Jinho Lee, H.\nEisaki, S. Uchida, D.-H. Lee and J. C. Davis, Nature 454,\n\n\f8\n\n11\n\n12\n\n13\n\n14\n\n15\n\n16\n\n17\n\n18\n\n19\n\n20\n\n21\n\n22\n\n23\n\n24\n\n1072 (2008)\nQ.H. Wang and D. H. Lee, Phys. Rev. B 67, 020511(R)\n(2003)\nD. LeBoeuf, N. Doiron-Leyraud, J. Levallois, R. Daou, J.B. Bonnemaison, N. E. Hussey, L. Balicas, B. J. Ramshaw,\nRuixing Liang, D. A. Bonn, W. N. Hardy, S. Adachi, C.\nProust and L. Taillefer, Nature 450, 533-536 (2007)\nI. Tomeno, T. Machi, K. Tai, N. Koshizuka, S. Kambe,\nA. Hayashi, Y. Ueda, and H. Yasuoka, Phys. Rev. B 49,\n15327 (1994)\nC. Stock, W. J. L. Buyers, Z. Tun, R. Liang, D. Peets,\nD. Bonn, W. N. Hardy, and L. Taillefer, Phys. Rev. B 66,\n024505 (2002); C. Stock, W. J. L. Buyers, R. Liang, D.\nPeets, Z. Tun, D. Bonn, W. N. Hardy, and R. J. Birgeneau,\nPhys. Rev. B 69, 014502 (2004)\nYan Chen, T. M. Rice, Fu-Chun Zhang, Phys. Rev. Lett.\n97, 237004 (2006)\nK.-Y. Yang, T. M. Rice and Fu-Chun Zhang, Phys. Rev.\nB 73 174501 (2006)\nR. M. Konik, T. M. Rice and A. M. Tsvelik, Phys. Rev.\nLett. 96 086407 (2006)\nK. L. Hur and T. M. Rice, Annals of Physics 324, 1452\n(2009)\nF. C. Zhang, C. Gros, T. M. Rice, H. Shiba, Supebcon.\nSci. Technol. 1, 36(1988) or cond-mat/0311604\nK.-Y. Yang, H. B. Yang, P. D. Johnson, T. M. Rice, FuChun Zhang, EuroPhys Lett 86, 37002, (2009)\nB. Valenzuela and E. Bascones, Phys. Rev. Lett. 98,\n227002 (2007)\nE. Illes, E. J. Nicol, and J. P. Carbotte, Phys. Rev. B 79,\n100505(R) (2009)\nJ. P. F. LeBlanc, E. J. Nicol and J. P. Carbotte, Phys.\nRev. B 80, 060505(R) (2009)\nH.-B. Yang, J. D. Rameau, P. D. Johnson, T. Valla, A.\n\n25\n\n26\n\n27\n\n28\n29\n\n30\n\n31\n\n32\n\n33\n\n34\n\n35\n36\n\n37\n\n38\n\n39\n\nTsvelik, G. D. Gu, Nature 456, 77 (2008)\nJ .P. Carbotte, K. A. G. Fisher, J. P. F. LeBlanc and E.\nJ. Nicol, arXiv/0909.3814 (unpublished)\nM. Hashimoto, T. Yoshida, K. Tanaka, A. Fujimori, M.\nOkusawa, S. Wakimoto, K. Yamada, T. Kakeshita, H.\nEisaki, and S. Uchida, Phys. Rev. B 79, 140502(R) (2009)\nW. D. Wise, K. Chatterjee, M. C. Boyer, T. Kondo, T.\nTakeuchi, H. Ikuta, Zhijun Xu, Jinsheng Wen, G. D. Gu,\nYayu Wang and E. W. Hudson Nature Physics 5 213 (2009)\nJ. Tersoff and D. R. Hamann, Phys. Rev. B 31, 805 (1985).\nA. V. Balatsky, I. Vekhter and J.-X. Zhu Rev. Mod. Phys.\n78,373 (2006)\nP. W. Anderson and N. P. Ong, J. Phys. Chem. Solids 67\n1 (2006)\nM. Randeria, R. Sensarma, N. Trivedi, and F. C. Zhang,\nPhys. Rev. Lett. 95, 137001 (2005)\nS. A. Kivelson, E. Fradkin and V. J. Emery, Nature 393,\n550 (1998)\nS. A. Kivelson, I. P. Bindloss, E. Fradkin, V. Oganesyan, J.\nM. Tranquada, A. Kapitulnik and C. Howald, Rev. Mod.\nPhys. 75, 1201 (2003)\nV. Oganesyan, S. A. Kivelson, and E. Fradkin, Phys. Rev.\nB 64, 195109 (2001)\nY.-J. Kao and H.-Y. Kee, Phys. Rev. B 72, 024502 (2005).\nH. Yamase, V. Oganesyan and W. Metzner, Phys. Rev. B\n72, 035114 (2005).\nC. J. Halboth and W. Metzner, Phys. Rev. Lett. 85, 5162\n(2000).\nV. Hinkov, D. Haug, B. Fauque, P. Bourges, Y. Sidis, A.\nIvanov, C. Bernhard, C. T. Lin,1 B. Keimer, Science 319,\n597 (2008)\nE. Bascones and B. Valenzuela, Phys. Rev. B 77, 024527\n(2008)\n\n\f"}