{"id": "http://arxiv.org/abs/0807.4791v2", "guidislink": true, "updated": "2008-10-22T21:12:45Z", "updated_parsed": [2008, 10, 22, 21, 12, 45, 2, 296, 0], "published": "2008-07-30T06:13:26Z", "published_parsed": [2008, 7, 30, 6, 13, 26, 2, 212, 0], "title": "Metal to insulator transition in epitaxial graphene induced by molecular\n  doping", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0807.1230%2C0807.2813%2C0807.3446%2C0807.2976%2C0807.4987%2C0807.2677%2C0807.4446%2C0807.2723%2C0807.4265%2C0807.0686%2C0807.4320%2C0807.0643%2C0807.4080%2C0807.2277%2C0807.3402%2C0807.2362%2C0807.3523%2C0807.4557%2C0807.3479%2C0807.0940%2C0807.3713%2C0807.2703%2C0807.2824%2C0807.0162%2C0807.3392%2C0807.2238%2C0807.0312%2C0807.4832%2C0807.2468%2C0807.1580%2C0807.4656%2C0807.1942%2C0807.2603%2C0807.1953%2C0807.0927%2C0807.4768%2C0807.3018%2C0807.4795%2C0807.2696%2C0807.4791%2C0807.4968%2C0807.0847%2C0807.3153%2C0807.4517%2C0807.4137%2C0807.2863%2C0807.2353%2C0807.1635%2C0807.1428%2C0807.2682%2C0807.2287%2C0807.0206%2C0807.0882%2C0807.0579%2C0807.3190%2C0807.1654%2C0807.4478%2C0807.1876%2C0807.4302%2C0807.2833%2C0807.3002%2C0807.2589%2C0807.3238%2C0807.1691%2C0807.5044%2C0807.2928%2C0807.2666%2C0807.2880%2C0807.0823%2C0807.2450%2C0807.2416%2C0807.4937%2C0807.3471%2C0807.2195%2C0807.2051%2C0807.2504%2C0807.2633%2C0807.0285%2C0807.0396%2C0807.1401%2C0807.0477%2C0807.3315%2C0807.1904%2C0807.5057%2C0807.3186%2C0807.2994%2C0807.0406%2C0807.3051%2C0807.3638%2C0807.4475%2C0807.0524%2C0807.3109%2C0807.3437%2C0807.4389%2C0807.0718%2C0807.3920%2C0807.3210%2C0807.1466%2C0807.0123%2C0807.2418%2C0807.3481&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Metal to insulator transition in epitaxial graphene induced by molecular\n  doping"}, "summary": "The capability to control the type and amount of charge carriers in a\nmaterial and, in the extreme case, the transition from metal to insulator is\none of the key challenges of modern electronics. By employing angle resolved\nphotoemission spectroscopy (ARPES) we find that a reversible metal to insulator\ntransition and a fine tuning of the charge carriers from electrons to holes can\nbe achieved in epitaxial bilayer and single layer graphene by molecular doping.\nThe effects of electron screening and disorder are also discussed. These\nresults demonstrate that epitaxial graphene is suitable for electronics\napplications, as well as provide new opportunities for studying the hole doping\nregime of the Dirac cone in graphene.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0807.1230%2C0807.2813%2C0807.3446%2C0807.2976%2C0807.4987%2C0807.2677%2C0807.4446%2C0807.2723%2C0807.4265%2C0807.0686%2C0807.4320%2C0807.0643%2C0807.4080%2C0807.2277%2C0807.3402%2C0807.2362%2C0807.3523%2C0807.4557%2C0807.3479%2C0807.0940%2C0807.3713%2C0807.2703%2C0807.2824%2C0807.0162%2C0807.3392%2C0807.2238%2C0807.0312%2C0807.4832%2C0807.2468%2C0807.1580%2C0807.4656%2C0807.1942%2C0807.2603%2C0807.1953%2C0807.0927%2C0807.4768%2C0807.3018%2C0807.4795%2C0807.2696%2C0807.4791%2C0807.4968%2C0807.0847%2C0807.3153%2C0807.4517%2C0807.4137%2C0807.2863%2C0807.2353%2C0807.1635%2C0807.1428%2C0807.2682%2C0807.2287%2C0807.0206%2C0807.0882%2C0807.0579%2C0807.3190%2C0807.1654%2C0807.4478%2C0807.1876%2C0807.4302%2C0807.2833%2C0807.3002%2C0807.2589%2C0807.3238%2C0807.1691%2C0807.5044%2C0807.2928%2C0807.2666%2C0807.2880%2C0807.0823%2C0807.2450%2C0807.2416%2C0807.4937%2C0807.3471%2C0807.2195%2C0807.2051%2C0807.2504%2C0807.2633%2C0807.0285%2C0807.0396%2C0807.1401%2C0807.0477%2C0807.3315%2C0807.1904%2C0807.5057%2C0807.3186%2C0807.2994%2C0807.0406%2C0807.3051%2C0807.3638%2C0807.4475%2C0807.0524%2C0807.3109%2C0807.3437%2C0807.4389%2C0807.0718%2C0807.3920%2C0807.3210%2C0807.1466%2C0807.0123%2C0807.2418%2C0807.3481&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "The capability to control the type and amount of charge carriers in a\nmaterial and, in the extreme case, the transition from metal to insulator is\none of the key challenges of modern electronics. By employing angle resolved\nphotoemission spectroscopy (ARPES) we find that a reversible metal to insulator\ntransition and a fine tuning of the charge carriers from electrons to holes can\nbe achieved in epitaxial bilayer and single layer graphene by molecular doping.\nThe effects of electron screening and disorder are also discussed. These\nresults demonstrate that epitaxial graphene is suitable for electronics\napplications, as well as provide new opportunities for studying the hole doping\nregime of the Dirac cone in graphene."}, "authors": ["S. Y. Zhou", "D. A. Siegel", "A. V. Fedorov", "A. Lanzara"], "author_detail": {"name": "A. Lanzara"}, "author": "A. Lanzara", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1103/PhysRevLett.101.086402", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/0807.4791v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0807.4791v2", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "4 pages, 4 figures", "arxiv_primary_category": {"term": "cond-mat.mtrl-sci", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cond-mat.mtrl-sci", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "cond-mat.str-el", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0807.4791v2", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0807.4791v2", "journal_reference": "Phys. Rev. Lett. 101, 086402 (2008)", "doi": "10.1103/PhysRevLett.101.086402", "fulltext": "Metal to insulator transition in epitaxial graphene induced by\nmolecular doping\nS.Y. Zhou,1, 2 D.A. Siegel,1, 2 A.V. Fedorov,3 and A. Lanzara1, 2\n\narXiv:0807.4791v2 [cond-mat.mtrl-sci] 22 Oct 2008\n\n1\n\nDepartment of Physics, University of California, Berkeley, CA 94720, USA\n2\n\nMaterials Sciences Division, Lawrence Berkeley\n\nNational Laboratory, Berkeley, CA 94720, USA\n3\n\nAdvanced Light Source, Lawrence Berkeley National\nLaboratory, Berkeley, California 94720, USA\n(Dated: November 2, 2018)\n\nAbstract\nThe capability to control the type and amount of charge carriers in a material and, in the extreme\ncase, the transition from metal to insulator is one of the key challenges of modern electronics. By\nemploying angle resolved photoemission spectroscopy (ARPES) we find that a reversible metal to\ninsulator transition and a fine tuning of the charge carriers from electrons to holes can be achieved\nin epitaxial bilayer and single layer graphene by molecular doping. The effects of electron screening\nand disorder are also discussed. These results demonstrate that epitaxial graphene is suitable for\nelectronics applications, as well as provide new opportunities for studying the hole doping regime\nof the Dirac cone in graphene.\n\n1\n\n\fChemical doping is a well-known and widely used method of manipulating the electronic\nproperties of materials. For example, it can convert an insulator into a high temperature\nsuperconductor or into a material with colossal magnetoresistance. The modern microelectronics industry probably provides the most notable example since it is almost entirely based\non doped semiconductors. Finding a new material suitable for microelectronics is not easy\nsince one has to find how to change its carrier concentration via doping. In addition, in\nthe ultimate case, it might be necessary or at least useful to induce a reversible metal to\ninsulator transition (MIT) in a material. In the past few years, a great deal of attention\nhas been focused on graphene - a few layers thick graphite sheets, which is considered by\nmany as a material of choice for the future [1, 2]. Although it would certainly be a major\nbreakthrough to induce a MIT in graphene, so far this is reported only in mechanically\nexfoliated graphene by using a complicate gate device configuration [3, 4] which is difficult\nfor large scale fabrication. Recently it has been shown that, when graphene is epitaxially\ngrown on a Si-terminated semiconducting substrate, a gap opens at the Dirac point both\nfor single layer [5] and bilayer graphene [5, 6]. However, because of the charge transfer from\nthe substrate [5, 6, 7] the Dirac point and hence the gap, lie well below the Fermi energy\nEF . Therefore, although epitaxial graphene could be an ideal system to observe a MIT,\nthis can only be realized if EF moves into the gap region. Unfortunately, the control of\ncharge carriers in epitaxial graphene is not as simple as for exfoliated graphene: doping by\napplying a gate voltage to change charger carriers from electrons to holes has been achieved\nonly recently, and only for a small doping range [8], and hole doping by chemical methods\nhas not yet been demonstrated successfully.\nMotivated by the reports that molecular adsorption of NO2 can induce hole doping in\ncarbon nanotubes [9] and exfoliated graphene [10, 11], we have investigated the effect of\nsuch doping on the electronic structure of single layer and bilayer epitaxial graphene by\nusing angle-resolved photoemission spectroscopy (ARPES). ARPES is a powerful tool for\nstudying the doping effects and metal insulator transition [12] as it directly detects the\nexcitation gap, which distinguishes an insulating behavior from a metallic behavior. Here\nwe report a reversible metal to insulator transition associated with almost rigid shift of the\nband structure as a function of doping, leading to a doping independent Fermi velocity and\nelectron-phonon coupling. Moreover we found that scattering by charge impurities induced\nby NO2 adsorption is suppressed by electron screening, in line with the report of constant\n2\n\n\fFIG. 1: Dispersions through the K point for the as-grown single layer graphene (a) and for the\nsample with the highest NO2 doping (c). Panels (b) and (d) show the angle integrated spectra for\n(a) and (c) respectively. In panels (c) and (d) note the appearance of the NO2 states at ≈ 5 and\n11 eV below EF .\n\nFIG. 2: (a) Dispersions of as-grown bilayer graphene for a cut through the K point (see red line in\nthe inset). (b) Dispersions taken after 0.6 Langmuir (1 Langmuir=106 torr * s) NO2 adsorption. (c)\nData taken after NO2 desorption by synchrotron beam. (d) EDCs at k1 , k2 , k3 and k4 as labeled\non the top of panels a and b. The red dots are the raw data points and the red lines are the smooth\ndata as a guide for the eye. The black and red arrows point to the midpoint of the leading edge,\nwhich is shifted to higher binding energy after NO2 doping. (e) Symmetrized EDC with respect\nto EF . The absence of a peak at EF in the red curves shows the insulating property of the sample\nin panel b. (f) Zoom-in of data shown in panel b. The white line is a guide to the eye for the\ndispersions. (g) Momentum distribution curve (MDC) at the energy labeled by the dotted black\nline in panel (f). The dots are the raw data and the solid line is the fit using three Lorentzian\npeaks simulating the cross-section of the hat-like dispersion in panel e.\n\n3\n\n\fmobility by transport measurements [10]. These results mark an important step on a route\nto integrating graphene into semiconductor technology.\nSingle layer and bilayer graphene samples were grown in situ on the silicon-terminated\nface of the SiC substrate by thermal decomposition of electron doped SiC wafers as described\nelsewhere [7, 13]. The average domain size for the monolayer graphene is larger than 50 nm\n[14]. Adsorption of NO2 molecules on otherwise clean graphene samples was achieved via\ncontrolled exposures to the NO2 gas (Matheson, 99.5%). All ARPES spectra were taken\nat beamline 12.0.1 of the Advanced Light Source (ALS) in Lawrence Berkeley National\nLaboratory using SES100 electron spectrometer. The photon energy was 50 eV and the\nenergy resolution was better than 30 meV. The measurement temperature was 20 K, well\nbelow the threshold (140K) for thermal desorption of NO2 from graphite [15]. We studied\nNO2 adsorption in two ways: ARPES data were either taken under the continuous flow of\nNO2 at a pressure of ≈ 5×10−8 torr or by exposing the sample to the gas for a certain\ntime and taking data after the chamber was pumped down to the base pressure. Both\nmeasurements yielded identical results. Although different doping levels were studied, an\nexact estimation of the amount of NO2 adsorbed on the surface of our samples is difficult\ndue to the significant photo-stimulated desorption. To minimize the impact of the photo\ndesorption on our data we had to intentionally reduce the photon flux and accumulate the\nspectra for only 30 seconds. This explains a relatively poor statistics of the data taken from\ngraphene with adsorbed NO2 .\nBefore discussing the effect of molecular doping on the electronic structure of bilayer and\nsingle layer graphene, we shall prove that NO2 is present on the surface of our samples.\nFigure 1 shows ARPES data of the valence band of a single layer graphene sample before\n(panel a) and after (panel b) exposure to NO2 . The exposure to NO2 leads to the appearance\nof two broad peaks centered at 5 eV and 11 eV below EF , similar to those reported previously\non the surfaces of W(110) [16] and Si [17]. Previous studies of NO2 adsorption on W(110)\n[16] and graphite [15] suggested that NO2 forms dimmers (N2 O4 ) upon adsorption. A similar\ndimmerization might also occur here. This is supported by the absence of any spin-polarized\nsignal in the density of states for any doping value (not shown), predicted in the case of\nNO2 adsorption but not in the case of dimers (N2 O4 ) [11].\nFig. 2 shows ARPES data taken on bilayer graphene before and after NO2 adsorption at\n20K. Panel a shows dispersions through the K point in the as-grown graphene. The Dirac\n4\n\n\fFIG. 3: (a-f) Dispersions for single layer graphene through the K point, for the as-grown sample (a)\nand for various dopings after NO2 adsorption (b-f). The white lines are the dispersions extracted\nfrom fitting the MDC peaks. When the MDC peaks cannot be clearly resolved the extrapolated\ndispersion is shown (see dotted lines in panels c-d). (g) EDCs taken in the momentum regions\n(indicated by a small tick mark on top of each panel) where the bands are closest to EF . The\nsymbols are the raw data and the solid lines are guides for the eye. (h) Symmtrized EDCs for data\nshown in panel g with respect to EF .\n\npoint energy is readily identified at the binding energy of 0.3 eV. Strictly speaking, the Dirac\npoint, which separates the upward dispersing conduction band from downward dispersing\nvalence band, is located within a gap. Existence of this gap between valence and conduction\nbands in bilayer graphene has already been shown in previous ARPES studies [5, 6]. Panel\nb shows data taken right after dosing NO2 gas at 1×10−8 torr for 60 seconds (0.6 Langmuir\nof NO2 gas). Clearly, adsorption of NO2 leads to the shift of the entire band structure\ntoward EF , which indicates hole doping of the bilayer graphene. Close inspection of the\nregion near EF shows that EF lies within the gap separating the conduction and valence\nbands with the latter band located above EF . To illustrate this, in Fig. 2(d) we plot the\nenergy distribution curves (EDCs) at the momentum values where the bands are closest to\nEF for data shown in panel a (black curves) and panel b (red curves). It is obvious that\nafter NO2 adsorption, there is a depletion of the states at EF , accompanied by a shift of\nthe leading edge to higher binding energy by ≈ 30 meV. The absence of spectral weight\nat EF is the typical characteristic of a gap, whose magnitude is measured in general from\nthe mipoint in the EDC spectra at kF (leading edge) [18]. The data shown in panel (d)\n5\n\n\fhence supports the insulating nature of our sample upon NO2 absorption (panel b), with a\ngap of ≈ 30 meV. In panel e we show the EDC spectra symmetrized at EF . This method\nallows a direct visualization of the gap by eliminating the contribution of the Fermi function\nfrom the ARPES data, as has been widely used in the case of high Tc superconductors [19].\nThe presence of the peaks at EF in the symmetrized EDCs in the as-grown sample and the\nsuppression of intensity at EF after NO2 adsorption show that the sample undergoes a metal\ninsulator transition upon NO2 adsorption. This metal insulator transition is reversible: the\nsample becomes a metal again if we remove most of the NO2 from the surface by exposure\nto high photon flux, or by annealing the sample. Fig. 2(c) displays the data taken after\ndesorption of NO2 by photon flux. The bands of graphene are shifted back to their original\npositions with the Dirac point at 0.3 eV below EF . However, the peaks in panel 2(c) are\nstill broader than those in panel 2(a), which might indicate a small fraction of residual\nNO2 molecules. By thermal annealing at ≈ 400◦ C the residual molecules can be completely\nremoved, as confirmed by the sharpening of the peaks and the complete recovery of the line\nwidth of pure graphene.\nIn addition to demonstrating molecular hole doping of graphene, the data in Figs.2(b,f)\nalso allow an unobscure view of the top of the valence band which exhibits a characteristic\nhat-like shape [6, 20]. The persistence of this hat-like shape upon NO2 doping is important,\nas it has been predicted that with increasing amount of disorder, the dispersions near ED will\nbecome broader and blurry significantly [21, 22]. The observation of the hat-like structure in\nthe data suggests that electron screening in bilayer graphene is very effective to suppress the\nscattering by charged impurities induced by NO2 adsorption. This is in line with transport\nmeasurements on exfoliated graphene [10], where the mobility is almost unchanged upon\nNO2 adsorption.\nFinally, we wish to attempt to estimate the amount of NO2 adsorbed on the graphene.\nThe amount of carrier concentration in panel a has been estimated by measuring the area\nenclosed by the Fermi contours and through the Luttinger theorem. Assuming that the\nFermi surface is a circle, the charge concentration in panel a is 0.0052 electrons per unit\ncell. Upon exposing the graphene sample to 0.6 Langmuir of NO2 , the sample becomes\ninsulating and the Fermi surface disappears. If we assume that each NO2 molecule accepts\nas much as 1 electron from graphene as suggested by transport measurement [10], change of\n0.0052 electrons per unit cell corresponds to 0.033 Langmuir of NO2 . This suggests that with\n6\n\n\fFIG. 4: (a, b) Plot of ED and Fermi velocity as a function of the carrier concentration for data\ntaken on single layer epitaxial graphene. In panel b, the data are extracted by fitting the dispersion\nbetween EF and -0.3 eV (circles) and between EF and -0.1 eV (diamonds). The open symbols are\nextracted from the dispersions on the left and the filled symbols from the dispersions on the right.\n\nthe dosage 0.6 Langmuir NO2 molecules, only 5.5% of the molecules stick to graphene and\nremove 1 electron from graphene. This is reasonable considering the fast photo-desorption\nof the NO2 molecules.\nIn Figure 3 we show the effect of molecular doping on single layer epitaxial graphene\nfor progressive adsorption of NO2 (panels a-f). Data in panel a are taken on the as-grown\nsample, which is electron doped with the Dirac point located at 0.4 eV below EF . As\npreviously reported [5, 23] the valence and conduction bands deviate from the expected\nconical dispersion near the K point, where an anomalous extended vertical region of finite\nintensity is observed. The origin of this deviation is under debate [5, 23]. By hole doping\nwe have the unique ability to directly access this region and to investigate its origin. Similar\nto the case of bilayer graphene, adsorption of NO2 leads to a significant shift of the entire\nband structure. More specifically the chemical potential can be shifted from the conduction\nband (panels a-b) all the way down to the valence band (panels e-f), with a maximum\nshift of 0.8 eV in energy and a total change of 1.9×1013 cm−2 in carrier concentration.\nThe latter corresponds to applying a gate voltage as large as 260 V in exfoliated graphene\n[24, 25, 26]. When the chemical potential falls in the anomalous region near ED (panels c\nand d), extrapolation of the valence band shows that the top of this band lies below EF (see\n7\n\n\fwhite dashed line) while the bottom of the conduction band lies above EF , the two being\nseparated by a region of finite intensity pinned at the K point. Moreover, the EDCs at the\nK point show a depletion of spectral weight, the absence of a Fermi cutoff and a clear shift\nof the leading edge towards higher binding energy (see curves c and d in panel g). This is in\ncontrast to the case in which the chemical potential falls within the conduction or valence\nbands (curves a, b, e, f of panel g) where a peak near EF (dotted line) and a Fermi crossing\nare observed. This shift of the leading edge resembles that of bilayer graphene discussed\nabove when the chemical potential falls within the gap region (Fig. 2(d)), and therefore,\nis suggestive of an insulating state even for the single layer graphene, which is similarly\nreversible by exposure of the surface to high photon flux or by annealing the sample at\nhigh temperature. Moreover, this result confirms that the gap between the conduction and\nvalence band is indeed an intrinsic property of epitaxial graphene as previously argued [14],\nas is also supported by recent ab initio calculation [27] and the absence of the gap in the\npreliminary ARPES study of exfoliated graphene [28].\nFigure 4 summarizes the effect of NO2 adsorption in single layer graphene. Fig. 4(a) shows\nthe amount of hole doping estimated from the shift of ED (vertical axis) and the change\nof charge carrier concentration (horizontal axis). Upon NO2 doping, the Fermi energy can\nbe shifted by as much as 0.8 eV, and the charge carriers can be tuned in a wide range\nfrom 0.7×1013 cm−2 electrons to 1.2×1013 cm−2 holes. Fig. 4(b) plots the Fermi velocity\n, a quantity that governs the low-energy quasiparticle dynamics, as a function of\nvF = h̄1 ∂E\n∂k\ncarrier concentration. Surprisingly we find that the Fermi velocity is nearly constant for\nall doping levels to within ±20% of the initial value, though small changes, expected on\na scale which is beyond the resolution of the present experiment [29], cannot be excluded.\nThis independence of the Fermi velocity points to a doping independent electron-phonon\ncoupling, in contrast to an earlier report where a huge change of the Fermi velocity by\nelectron doping through K and Ca [30] was reported. Whether this suggests the presence of\na strong electron-hole asymmetry or the hybridization of graphene π bands with those from\nK and Ca [31, 32, 33] in the previous case [30], has to be confirmed. Finally, we note that\na similar doping independent Fermi velocity has been reported for the nodal quasiparticles\nin high temperature superconductors, which are also Dirac fermions, through the insulator\nto superconducting transition [34]. Whether this universality is a general property of Dirac\nFermions is certainly an interesting topic that needs to be further investigated.\n8\n\n\fIn summary, we have performed ARPES measurements of the electronic structure of\nsingle and bilayer epitaxial graphene with adsorbed NO2 . Our data directly prove that NO2\ninduces hole doping of graphene over a wide doping range, tuning the charge carriers from\nelectrons to holes. This results in: a rigid shift of the band structure, and hence a doping\nindependent Fermi velocity and electron-phonon coupling; a reversible MIT; and, in the case\nof bilayer graphene, a suppression of scattering by charge impurities by electron screening.\nOur findings provide new directions for achieving semiconducting graphene and open up an\ninteresting route to studying the physics of the hole doping regime of the Dirac cone.\nWe thank B.S. Mun, B. Freelon for providing us the NO2 gas, A.H. Castro Neto, D.-H. Lee\nand M.I. Katsnelson for useful discussions. The sample growth and ARPES measurements\nwork were supported by the National Science Foundation through Grant No. DMR03-49361.\nThe ARPES measurements and data analysis were supported by the Division of Materials\nSciences and Engineering of the U.S Department of Energy under Contract No. DEAC0376SF00098. S.Y. Zhou thanks the Advanced Light Source Doctoral Fellowship for financial\nsupport.\n\n[1] A. Geim and K.S. Novoselov, Nat. Mat. 6, 183 (2007).\n[2] A. H. Castro Netoet al, arXiv:0709.113 (2007).\n[3] E. V. Castro et al, Phys. Rev. Lett. 99, 216802 (2007).\n[4] J. B. Oostinga et al, Nature Mat. 7, 151, (2008).\n[5] S.Y. Zhou et al, Nature Mat. 6, 770 (2007).\n[6] T. Ohta et al, Science 313, 951 (2006).\n[7] E. Rollings et al, J. Phys. Chem. Solids 67, 2172 (2006).\n[8] J. Kedzierski et al, arXiv:0801.2744 (2007).\n[9] J. Kong et al, Science 287, 622 (2000).\n[10] F. Schedin et al, Nature Mat. 6, 652 (2007).\n[11] T.O. Wehling et al, Nano Lett. 8, 173 (2008).\n[12] L. Perfetti et al, Phys. Rev. Lett. 90, 166401 (2003).\n[13] C. Berger et al, J. Phys. Chem. B 108, 19912 (2004).\n[14] S.Y. Zhou et al, Nature Mat. 7, 259 (2008).\n\n9\n\n\f[15] P. Sjovall et al, Chem. Phys. Lett. 172, 125 (1990).\n[16] J.C. Fuggle et al, Surf. Sci. 79, 1 (1979).\n[17] J.L. Bischoff et al, Phys. Rev. B 39, 3653 (1989).\n[18] Z.X. Shen et al, Phys. Rev. Lett. 70, 1553 (1993).\n[19] M.R. Norman et al, Nature 392, 157 (1998).\n[20] E. McCann et al, Phys. Rev. Lett. 96, 086805 (2006).\n[21] J. Nilsson et al, arXiv:0712.3259 (2008).\n[22] J. Nilsson et al, Phys. Rev. Lett. 98, 126801 (2007).\n[23] A. Bostwick et al, Nature Phys. 3, 36 (2007).\n[24] K.S. Novoselov et al, Science 306, 666-669 (2004).\n[25] K.S. Novoselov et al, Proc. Natl. Acad. Sci. 102, 10451 (2005).\n[26] Y.B. Zhang et al, Nature 438, 201 (2005).\n[27] S. Kim et al, Phys. Rev. Lett. 100, 176802 (2008).\n[28] K.R. Knox et al, arXiv:0806.0355 (2008).\n[29] C.-H. Park et al, Phys. Rev. Lett. 99, 086804 (2007).\n[30] J.L. McChesney et al, arXiv:0705.3264 (2007).\n[31] M. Calandra et al, arXiv:0707.1492 (2007)\n[32] B. Uchoa et al, Phys. Rev. B 77, 035420 (2008).\n[33] C.-H. Park et al, Phys. Rev. B 77, 113410 (2008).\n[34] X.J. Zhou et al, Nature 423, 398 (2003).\n\n10\n\n\f"}