{"id": "http://arxiv.org/abs/1008.2210v1", "guidislink": true, "updated": "2010-08-12T20:05:45Z", "updated_parsed": [2010, 8, 12, 20, 5, 45, 3, 224, 0], "published": "2010-08-12T20:05:45Z", "published_parsed": [2010, 8, 12, 20, 5, 45, 3, 224, 0], "title": "Simulations of the Magellanic Stream in a First Infall Scenario", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1008.1948%2C1008.3839%2C1008.5019%2C1008.0111%2C1008.2108%2C1008.3965%2C1008.1251%2C1008.5057%2C1008.4802%2C1008.3456%2C1008.1640%2C1008.4962%2C1008.1420%2C1008.0979%2C1008.3213%2C1008.2141%2C1008.0696%2C1008.0781%2C1008.4852%2C1008.0340%2C1008.1702%2C1008.1249%2C1008.3332%2C1008.3576%2C1008.4047%2C1008.2814%2C1008.3278%2C1008.4153%2C1008.4555%2C1008.1831%2C1008.0853%2C1008.1023%2C1008.3853%2C1008.2331%2C1008.0661%2C1008.1604%2C1008.4098%2C1008.3693%2C1008.2156%2C1008.1960%2C1008.1977%2C1008.1226%2C1008.0361%2C1008.4505%2C1008.0962%2C1008.0334%2C1008.0741%2C1008.1835%2C1008.4997%2C1008.1767%2C1008.3750%2C1008.1213%2C1008.1248%2C1008.4848%2C1008.0396%2C1008.3985%2C1008.4763%2C1008.5394%2C1008.1210%2C1008.0031%2C1008.4184%2C1008.2075%2C1008.1941%2C1008.2198%2C1008.2933%2C1008.3402%2C1008.1153%2C1008.4914%2C1008.3026%2C1008.3724%2C1008.2926%2C1008.2832%2C1008.1217%2C1008.1418%2C1008.2210%2C1008.1216%2C1008.1253%2C1008.0772%2C1008.5027%2C1008.1072%2C1008.0779%2C1008.2322%2C1008.2481%2C1008.4522%2C1008.0544%2C1008.2139%2C1008.1817%2C1008.5270%2C1008.0616%2C1008.4476%2C1008.4881%2C1008.3500%2C1008.4086%2C1008.0456%2C1008.2083%2C1008.0246%2C1008.0402%2C1008.5392%2C1008.2851%2C1008.3971%2C1008.0646&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Simulations of the Magellanic Stream in a First Infall Scenario"}, "summary": "Recent high precision proper motions from the Hubble Space Telescope (HST)\nsuggest that the Large and Small Magellanic Clouds (LMC and SMC, respectively)\nare either on their first passage or on an eccentric long period (>6 Gyr) orbit\nabout the Milky Way (MW). This differs markedly from the canonical picture in\nwhich the Clouds travel on a quasi-periodic orbit about the MW (period of ~2\nGyr). Without a short period orbit about the MW, the origin of the Magellanic\nStream, a young (1-2 Gyr old) coherent stream of HI gas that trails the Clouds\n~150 degrees across the sky, can no longer be attributed to stripping by MW\ntides and/or ram pressure stripping by MW halo gas. We propose an alternative\nformation mechanism in which material is removed by LMC tides acting on the SMC\nbefore the system is accreted by the MW. We demonstrate the feasibility and\ngenerality of this scenario using an N-body/SPH simulation with cosmologically\nmotivated initial conditions constrained by the observations. Under these\nconditions we demonstrate that it is possible to explain the origin of the\nMagellanic Stream in a first infall scenario. This picture is generically\napplicable to any gas-rich dwarf galaxy pair infalling towards a massive host\nor interacting in isolation.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1008.1948%2C1008.3839%2C1008.5019%2C1008.0111%2C1008.2108%2C1008.3965%2C1008.1251%2C1008.5057%2C1008.4802%2C1008.3456%2C1008.1640%2C1008.4962%2C1008.1420%2C1008.0979%2C1008.3213%2C1008.2141%2C1008.0696%2C1008.0781%2C1008.4852%2C1008.0340%2C1008.1702%2C1008.1249%2C1008.3332%2C1008.3576%2C1008.4047%2C1008.2814%2C1008.3278%2C1008.4153%2C1008.4555%2C1008.1831%2C1008.0853%2C1008.1023%2C1008.3853%2C1008.2331%2C1008.0661%2C1008.1604%2C1008.4098%2C1008.3693%2C1008.2156%2C1008.1960%2C1008.1977%2C1008.1226%2C1008.0361%2C1008.4505%2C1008.0962%2C1008.0334%2C1008.0741%2C1008.1835%2C1008.4997%2C1008.1767%2C1008.3750%2C1008.1213%2C1008.1248%2C1008.4848%2C1008.0396%2C1008.3985%2C1008.4763%2C1008.5394%2C1008.1210%2C1008.0031%2C1008.4184%2C1008.2075%2C1008.1941%2C1008.2198%2C1008.2933%2C1008.3402%2C1008.1153%2C1008.4914%2C1008.3026%2C1008.3724%2C1008.2926%2C1008.2832%2C1008.1217%2C1008.1418%2C1008.2210%2C1008.1216%2C1008.1253%2C1008.0772%2C1008.5027%2C1008.1072%2C1008.0779%2C1008.2322%2C1008.2481%2C1008.4522%2C1008.0544%2C1008.2139%2C1008.1817%2C1008.5270%2C1008.0616%2C1008.4476%2C1008.4881%2C1008.3500%2C1008.4086%2C1008.0456%2C1008.2083%2C1008.0246%2C1008.0402%2C1008.5392%2C1008.2851%2C1008.3971%2C1008.0646&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Recent high precision proper motions from the Hubble Space Telescope (HST)\nsuggest that the Large and Small Magellanic Clouds (LMC and SMC, respectively)\nare either on their first passage or on an eccentric long period (>6 Gyr) orbit\nabout the Milky Way (MW). This differs markedly from the canonical picture in\nwhich the Clouds travel on a quasi-periodic orbit about the MW (period of ~2\nGyr). Without a short period orbit about the MW, the origin of the Magellanic\nStream, a young (1-2 Gyr old) coherent stream of HI gas that trails the Clouds\n~150 degrees across the sky, can no longer be attributed to stripping by MW\ntides and/or ram pressure stripping by MW halo gas. We propose an alternative\nformation mechanism in which material is removed by LMC tides acting on the SMC\nbefore the system is accreted by the MW. We demonstrate the feasibility and\ngenerality of this scenario using an N-body/SPH simulation with cosmologically\nmotivated initial conditions constrained by the observations. Under these\nconditions we demonstrate that it is possible to explain the origin of the\nMagellanic Stream in a first infall scenario. This picture is generically\napplicable to any gas-rich dwarf galaxy pair infalling towards a massive host\nor interacting in isolation."}, "authors": ["Gurtina Besla", "Nitya Kallivayalil", "Lars Hernquist", "Roeland P. van der Marel", "T. J. Cox", "Dusan Keres"], "author_detail": {"name": "Dusan Keres"}, "author": "Dusan Keres", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1088/2041-8205/721/2/L97", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1008.2210v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1008.2210v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "9 pages, 2 figures,1 table, submitted to apjl", "arxiv_primary_category": {"term": "astro-ph.GA", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "astro-ph.GA", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1008.2210v1", "affiliation": "CfA", "arxiv_url": "http://arxiv.org/abs/1008.2210v1", "journal_reference": null, "doi": "10.1088/2041-8205/721/2/L97", "fulltext": "arXiv:1008.2210v1 [astro-ph.GA] 12 Aug 2010\n\nSimulations of the Magellanic Stream in a First Infall Scenario\nG. Besla1 , N. Kallivayalil2 , L. Hernquist1 , R. P. van der Marel3 , T.J. Cox4 , D. Kereš1\ngbesla@cfa.harvard.edu\n\nABSTRACT\nRecent high precision proper motions from the Hubble Space Telescope (HST) suggest that the\nLarge and Small Magellanic Clouds (LMC and SMC, respectively) are either on their first passage\nor on an eccentric long period (>6 Gyr) orbit about the Milky Way (MW). This differs markedly\nfrom the canonical picture in which the Clouds travel on a quasi-periodic orbit about the MW\n(period of ∼2 Gyr). Without a short period orbit about the MW, the origin of the Magellanic\nStream, a young (1-2 Gyr old) coherent stream of HI gas that trails the Clouds ∼150◦ across the\nsky, can no longer be attributed to stripping by MW tides and/or ram pressure stripping by MW\nhalo gas. We propose an alternative formation mechanism in which material is removed by LMC\ntides acting on the SMC before the system is accreted by the MW. We demonstrate the feasibility\nand generality of this scenario using an N-body/SPH simulation with cosmologically motivated\ninitial conditions constrained by the observations. Under these conditions we demonstrate that\nit is possible to explain the origin of the Magellanic Stream in a first infall scenario. This picture\nis generically applicable to any gas-rich dwarf galaxy pair infalling towards a massive host or\ninteracting in isolation.\nSubject headings:\nand dynamics\n\n1.\n\ngalaxies: individual (Magellanic Clouds) - galaxies: halos - galaxies: kinematics\n\nthat they have had a close encounter in the recent\npast.\nToomre & Toomre (1972) demonstrate\nthat two isolated galaxies are capable of removing\nsubstantial amounts of material via tides, forming pronounced features such as bridges and tails.\nInterestingly, the system also possesses a substantial trailing HI component, known as the Magellanic Stream (Mathewson et al. 1974). The\nStream is a filamentary feature of HI gas (no\nstars; Guhathakurta & Reitzel 1998) that trails\nbehind the Clouds for at least 150◦ across the sky\n(Braun & Thilker 2004; Nidever et al. 2010).\nThe Stream has historically been explained as the\nproduct of a tidal and/or hydrodynamic interaction between the Clouds and the MW (e.g., GN96,\nConnors et al. 2006; Mastropietro et al. 2005).\nThis picture stems from the belief that the Clouds\nhave traveled in an orbit that afforded multiple\nclose passages between the Clouds and our Galaxy.\nHowever, recent HST proper motion (PM) measurements of the Clouds by Kallivayalil et al.\n(2006a,b) (hereafter K1 and K2), independently\n\nIntroduction\n\nThe Magellanic Clouds are the closest known\ninteracting pair of galaxies. Optical and infrared\nsurveys of the system present the Clouds as two\ndistinct objects separated in space by a projected\ndistance of ∼20 kpc. The HI distribution, however, paints a different picture. The Clouds are\nconnected by a low metallicity bridge of gas, referred to as the Magellanic Bridge, and share a\ncommon gaseous envelope (Putman et al. 2003;\nBrüns et al. 2005). The existence of such features suggests that the Clouds are a binary interacting pair. The Bridge in particular indicates\n1 Harvard-Smithsonian Center for Astrophysics, 60 Garden Street, Cambridge, MA 02138\n2 MIT Kavli Institute for Astrophysics & Space Research, 70 Vassar Street, Cambridge, MA 02139\n3 Space Telescope Science Institute, 3700 San Martin\nDrive, Baltimore, MD 21218\n4 Carnegie Observatories, 813 Santa Barbara Street,\nPasadena, CA 91101\n\n1\n\n\fof high velocity clouds by Heitsch & Putman\n(2009); Kereš & Hernquist (2009) make it improbable for the Stream to have survived much\nlonger. The Stream also exhibits surprisingly high\nHα emission ( ∼750 mR; Weiner & Williams\n1996), which implies that cloudlets within the\nStream are being ablated away on a 100-200 Myr\ntimescale and must be continuously replenished\n(Bland-Hawthorn et al. 2007). The lifetime of\nthe Stream poses a problem for all past numerical\nmodels, which invoke some combination of MW\ntides and/or ram pressure stripping to form the\nStream. These models require at least one complete orbit about the MW, implying an incompatible age of at least 6 Gyr.\nAs such, regardless of whether the Clouds are\non their first or second passage about the MW,\nin the context of the origin of the Stream we are\nleft with the same problem: How can the Stream\nhave formed without a complete orbit about the\nMW? Or, more generically, how can a pronounced\ntail be formed from a pair of dwarfs on their first\ninfall towards a massive host?\nBased on the above considerations, we explore\nthe following scenario using simulations. We assume that the Clouds were a stable binary system and adopt the simplifying hypothesis that the\nClouds are on their first passage about the MW in\norder to illustrate how the Stream can form without relying on a close encounter with the MW. We\npostulate that the Magellanic Stream and Bridge\nare in fact a classical bridge and tail caused by the\ntidal interaction between the Clouds before they\nhave been accreted by the MW. The MW potential shapes the orbit of the Clouds and thereby\ncontrols the appearance of the tail, causing the\nline-of-sight velocities and spatial location of the\ntail to be as observed in the Stream today.\nGiven these assumptions we attempt to explain\nthe following observed features of the Stream: 1)\nThe absence of stars; 2) The ∼150◦ extent; 3) The\nspatial location projected on the plane of the sky;\n4) The line-of-sight velocities along its length; 5)\nThe HI column densities; and 6) The pronounced\nasymmetry between the trailing and leading components.\n\nconfirmed by Piatek et al. (2008), have challenged this picture. These studies suggest instead\nthat the Clouds have, at best, completed one orbit about the MW or may even be on their first\npassage (Besla et al. 2007, hereafter B07). This\ncalls for a revised interpretation of the origin of\nthe Stream.\nK1 determined a velocity of 378 ± 18 km/s\nfor the LMC, which is 80 km/s higher than that\nderived from theoretical models of the Stream\n(GN96). B07 showed that a backward integration\nscheme (e.g., Murai & Fujimoto 1980) using the\nnew velocities and an isothermal sphere model for\nthe MW yields an orbit for the LMC with an apocenter >200 kpc. It is, however, unlikely that the\nrotation curve of the MW remains flat out to such\ndistances (e.g., Xue et al. 2008). If instead a\nmore cosmologically motivated profile is employed\n(e.g. NFW or Hernquist, Navarro et al. 1996;\nHernquist 1990a) then orbital solutions with multiple pericentric passages are ruled out. In particular, if an NFW model is adopted with a mass of\n1012 M⊙ , B07 conclude that the Clouds have just\nexperienced their first close passage past the MW.\nGiven the uncertainties in the adopted MW\nmodel, it is also possible that the Clouds have\ncompleted at most one orbit about our Galaxy\nwithin a Hubble time. This occurs if either the\nMW's mass were higher (∼ 2 × 1012 M⊙ ; B07), or\nif the velocity inferred from the PM measurements\nwere substantially lower, e.g. if the velocity at the\nSolar circle were higher (Shattow & Loeb 2009;\nReid et al. 2009). In this case, the only previous\npericentric passage about the Galaxy would be ∼6\nGyr ago and the apocenter of the orbit would be\n∼400 kpc (i.e. larger than the virial radius of the\nMW). These values are lower limits since these\nstudies assume the MW's mass is constant over\ntime, whereas in the current LCDM paradigm our\nGalaxy is believed to have been half as massive\n∼8 Gyr ago (Wechsler et al. 2002). Depending\non the mass evolution of the MW it may be impossible for the Clouds to have completed multiple\npassages.\nIndependent of which of the two orbital scenarios outlined above is correct, there is no orbital solution that brings the Clouds near the\nMW over the past 3 Gyr. However, there is\nstrong evidence that the Stream is a young feature (1-2 Gyr). Estimates of the survivability\n2\n\n\f2.\n\nlisions between the Clouds have caused material\nto be loosely bound to the Clouds is not novel\n(GN96, Heller & Rohlfs 1994). However, the\nmorphology resulting from collisions between the\nClouds as the SMC travels in a highly eccentric orbit about the LMC, independent of the MW, has\nnever been explored.\nWe have used the current projected separation\nbetween the Clouds ( 23 kpc), and the observed\nrelative velocity (∼ 105 ± 42 km/s; K2) to constrain the orbital history of the SMC about the\nLMC. The resulting orbit is nearly parabolic (e=\n0.7), with an apocenter of ∼ 100 kpc (see Figure\n1). The SMC disk is oriented 90◦ with respect to\nits orbital plane about the LMC. If the SMC were\nin a coplanar, retrograde orbit about the LMC, no\nmaterial would be removed with this orbital configuration. This implies that dispersion supported\nmaterial (e.g. dark matter or stellar halo) will be\nunaffected within the SMC's disk radius.\nThe presented orbital solution is not unique;\nhowever, a highly eccentric orbit is required to prevent the Clouds from merging. Moreover, these orbits are cosmologically typical (see, e.g., Benson\n2005; Wetzel 2010). Any eccentric orbit that allows for high speed encounters between the Clouds\nwill yield similar bridge and tail structures.\nWe simulated the interaction between the\nClouds as the SMC travels along the orbit shown\nin Figure 1 (top left) starting > 6 Gyr ago. At\neach close passage between the Clouds, gas is removed from the SMC by LMC tides, forming a\ntidal tail and bridge. However, as the Clouds\nmove apart, the tidal material falls back towards\nthe L/SMC disks. These features are thus transient phenomena. Little material is removed from\nthe LMC, despite its extended gaseous disk component: SMC tides are ineffective.\nThe pericentric passage at 4 Gyr in Figure 1\n(top left) results in significant gas removal from\nthe outer regions of the SMC's extended gas disk,\nwhereas the smaller stellar disk remains intact. As\nthe SMC travels away from the LMC, material\nthat was tidally removed by the LMC stretches\nour to distances as large as 100 kpc from the\nClouds. This material will eventually form the\nStream (Figure 1, bottom right). Hence, an extended gaseous tail is produced without the aid of\nMW tides or ram pressure.\n\nMethodology\n\nSimulations were carried out using the Nbody/SPH code GADGET2 (Springel et al 2005).\nStar formation is not included for simplicity, but\nthe gas is allowed to cool radiatively.\nWe model the MW as a static NFW potential\nof mass of 1.5 × 1012 M⊙ , Rvir =240 kpc and a\nconcentration parameter of 12. Dynamical friction\nfrom the MW halo is not explicitly accounted for,\nbut is expected to have little impact on the orbit\nin a first passage (see B07, figure 4). The L/SMC\nare both modeled using Hernquist profiles for their\ndark matter content, and exponential gaseous and\nstellar disks, where the scale length of the gas disk\nis 6 (LMC) or 5 (SMC) times that of the stellar\ndisk. Such extended gaseous disks are not atypical\nfor isolated dwarf galaxies (Swaters et al. 2002).\nThe stellar and gas masses for the Clouds are\nwell constrained within their respective observable limits. However, the total dark matter content of these galaxies is unknown. All previous\nmodels of the Magellanic system have assumed\nthe LMC is tidally truncated to a radius of 15\nkpc (van der Marel et al. 2002), resulting in a\ntotal mass estimate of 2-3 ×1010 M⊙ (e.g., GN96,\nMurai & Fujimoto 1980; Bekki & Chiba 2005).\nOn an orbit where MW tides are largely inconsequential, the L/SMC will not be truncated. Instead, we use current halo occupation models to\nrelate the observed stellar mass of the LMC to its\noriginal halo mass before infall into the MW halo\n(van den Bosch et al. 2003; Conroy et al. 2006;\nWang et al. 2006). In Table 1 we summarize our\nadopted model properties. The L/SMC are found\nto have infall masses an order of magnitude larger\nthan employed in previous models.\n3.\n\nSimulation Results and Comparisons\nwith Data\n\nWe believe that the key to understanding the\norigin of the Stream lies in understanding the interaction history of the Clouds themselves. The\nmajority of previous models of the Stream have\nassumed that the SMC is in a circular orbit about\nthe LMC (separation of ∼20 kpc). Using the cosmologically expected infall masses, the dynamical\nfriction timescale for such an orbit would be much\nless than a Hubble time, so the SMC's orbit about\nthe LMC cannot be circular. The idea that col3\n\n\fWe assume that the Clouds have been an interacting pair for a significant fraction of a Hubble\ntime and have crossed the virial radius (240 kpc)\nof our Galaxy ∼1 Gyr ago. From Figure 1, a 100\nkpc long tail is formed after ∼5 Gyr. We therefore stop the simulation 1 Gyr earlier (i.e. at the\ntimestep corresponding to the bottom left panel\nof Figure 1) and place the binary system outside\nthe virial radius of the MW. We then allow the\nClouds to travel to their current observed locations on an orbit consistent within 1σ of the PMs\nof the LMC (K1, Piatek et al. 2008). We did not\nattempt to reproduce the SMC PM determined by\nK2 and Piatek et al. (2008) since they are discrepant. However, the resulting SMC line-of-sight\nvelocity agrees well with the observed value.\nIn Figure 2 we show the resulting stellar distribution (top) and HI gas column density map\n(middle) for our simulated stream: there are no\nobservable stars in the simulated stream and the\nstream extends ∼150◦. The white line indicates\nthe current location of the observed Stream and is\nwell matched by the simulation. Notice that the\npast orbits (yellow lines) are not co-located with\nthe simulated stream, as expected since the north\ncomponent of the LMC PM vector is not aligned\nwith the Stream (see B07, figure 9). This spatial\nmismatch is a natural result of our model: material is removed from the SMC along the LMC-SMC\nbinary orbital plane, which is not co-planar with\nthe orbital plane of the Clouds about the MW.\nThe SMC disk was oriented 90◦ to the L/SMC binary plane in order to maximize this offset. This\nfurther implies that the SMC is seen ∼edge on\nfrom our viewing perspective, explaining its surprisingly large observed line-of-sight depth (∼5\nkpc; Subramanian & Subramanian 2009).\nFigure 2 (bottom) illustrates the resulting lineof-sight velocities for the simulated stream. The\nwhite line is a fit to the data (Putman et al.\n2003; Nidever et al. 2008)[hereafter, N08] and\nshows good agreement with the simulation. The\nline-of-sight velocities along the new orbits (yellow\nlines) are much larger than those observed along\nthe Stream: since the Stream and the orbits are\nnot co-located, their line-of-sight velocities are not\nsimilar (see also B07, figure 20). The MW's gravitational field serves to stretch the stream and modify its galactocentric distance: the tip of the simulated stream is located ∼100-140 kpc away. Using\n\nthese distance estimates, we find that the mass in\nour simulated stream matches the observed value\n(4.8 × 108M⊙ ; Brüns et al. 2005) to within a factor of 2.\nThe simulated gas column densities range from\n1018 − 1021 /cm2 as observed, although the exact\ncolumn density gradient along the length of the\nStream is not reproduced. The column density\nis not homogeneous across the width of the simulated stream: the inclusion of metal cooling, ionization and confinement/interaction by/with the\nambient MW halo gas will likely aid in reproducing the bifurcated, filamentary nature of the observed Stream.\nThe leading component of the simulated stream\nis much smaller than the trailing component, as\nobserved. This arises because the leading tidal\narm from the SMC falls towards the LMC, while\nthe tail continues to grow (Figure 1). However,\nthe leading component in the model is not in the\ncorrect location on the sky when compared to observations. This material leads the orbit, which is\nnot aligned with the Stream. Consequently, this\napparent problem will also occur in the traditional\ntidal models of e.g. Růžička et al. (2009); Bekki\n(2008); Connors et al. (2006); Bekki & Chiba\n(2005) and Gardiner & Noguchi (1996, hereafter,\nGN96). This indicates that hydrodynamic processes such as ram pressure (Mastropietro et al.\n2005) are needed to shape the final appearance of\nthe simulated stream.\n4.\n\nDiscussion and Conclusions\n\nWe have shown that tidal interactions between\nthe Clouds are sufficient to remove a substantial\namount of material from the SMC without the\naid of MW tides or hydrodynamic interactions.\nOur goal was not to reproduce every detail of\nthe Stream, but merely to show that a plausible Stream model can be formed without a previous passage about the MW. Nevertheless, many\nfeatures of the simulation fit the data remarkably\nwell.\nWe have explained the absence of an observable (brighter than Vband 27 mag/arcsec2) stellar\ncounterpart to the Stream by placing the SMC on\nan orbit about the LMC with a large impact parameter, which allows its compact stellar disk to\nremain intact (see also, Yoshizawa & Noguchi\n\n4\n\n\f2003). The 150◦ extent of the Stream is reproduced owing to the eccentric orbit of the SMC\nabout the LMC (apocenter ∼100-50 kpc) and MW\ntides after the system has been accreted. Such an\neccentric orbit is likely only viable in a first infall scenario, as MW tides would have disrupted\nthe system at the previous pericentric approach.\nThe spatial location of and velocity gradient along\nthe simulated stream are correct and offset from\nthose of the orbits: material is removed in the\nL/SMC binary plane, which is not coplanar with\nthe orbit of the Clouds about the MW. The simulated HI column densities also match the observations, although the exact column density gradient\nis not reproduced without additional physics. Finally, the strong asymmetry between the leading\nand trailing stream components is a natural consequence of a classical tidal bridge and tail scenario.\nThere are, however, other features that require\nadditional physics to address, such as the claim of\ncorrelated bursts of star formation in both Clouds\n(Harris & Zaritsky 2009). In our new scenario,\ncorrelated bursts of star formation may correspond\nto close passages between the Clouds rather than\nwith the MW. Furthermore, without ram pressure and stellar feedback we cannot explore the\nclaim by N08 that half of the Stream originates\nfrom the LMC as a stellar outflow (see also, B07\nand Olano 2004). We intend to examine these\nissues and more detailed comparisons of our simulations to the Magellanic system in future studies.\nHowever, we note that recent metallicity measurements at the tip of the Stream (Fox et al. 2010)\nindicate that the Stream is extremely metal poor\nand thus inconsistent with a stellar outflow scenario. Fox et al. (2010) also find that the oxygen abundance at the tip is more consistent with\nthat of the SMC rather than the LMC. As such, a\nmodel where the Stream originates primarily from\nthe SMC is not ruled out by observations of the\nStream.\nThe simulation results presented here with respect to the L/SMC interaction have broader\napplicability than just to the Magellanic system. Within the current LCDM paradigm halos at all scales are expected to build up their\nmass hierarchically. Interacting dwarf galaxies are\ntherefore cosmologically expected both in isolation and within larger halos (Simha et al. 2010;\nD'Onghia et al. 2009; Knebe et al. 2006). The\n\nisolated interacting Magellanic type galaxies NGC\n4490/85, which are surrounded by an extended HI\nenvelope (Clemens et al. 1998), and the interacting M51/NGC 5195 pair (Hernquist 1990b)\nmay be observational analogs of our initial L/SMC\nsystem. The presented model thus illustrates that\ndwarf-dwarf galaxy tidal interactions are a powerful mechanism to morphologically change dwarf\ngalaxies without the need for repeated interactions\nwith a massive host.\nREFERENCES\nBekki, K., 2008, ApJ, 684, L87\nBekki , K. & Chiba, M., 2005, MNRAS, 356, 680\nBenson, A. J., 2005, MNRAS, 358, 551\nBesla, G., Kallivayalil, N., Hernquist, L., Robertson, B., Cox, T.J., van der Marel, R.P., & Alcock, C., 2007, ApJ, 668, 949, [B07]\nBland-Hawthorn, J., Sutherland, R., Agertz, O. &\nMoore, B., 2007, ApJ, 670, L109\nBraun, R. & Thilker, D.A., 2004, A&A, 417, 421\nBrüns, C., Kerp, J., Staveley-Smith, L., Mebold,\nU., Putman, M.E., Haynes, R.F., Kalberla,\nP.M., Muller, E. & Filipovic, M.D., 2005, ApJ,\n432, 45\nClemens, M.S., Alexander, P. & Green, D.A.,\n1998, MNRAS, 297, 1015\nConnors, T.W., Kawata, D. & Gibson, B.K., 2006,\nMNRAS, 371, 108\nConroy, C., Wechsler, R.H. & Kravtsov, A.V.,\n2006, ApJ, 647, 201\nD'Onghia, E., Besla, G., Cox, T.J. & Hernquist,\nL., 2009, Nature, 460, 605\nFox, A.J., Wakker, B.P., Smoker, J.V., Richter,\nP., Savage, B.D., & Sembach, K.R. 2010,\narXiv:1006.0974\nGardiner, L.T. & Noguchi, M., 1996, MNRAS,\n278, 191 [GN96]\nGuhathakurta, P. & Reitzel, D.B, 1998, Galalctic\nHalos: A UC Santa Cruz Workshop, ed. Zaritsky, D., ASP Conf Series, 136, 22\n\n5\n\n\fHarris, J. & Zaritsky, D., 2009, AJ, 138, 1243\n\nShattow, G. & Loeb, A., 2009, MNRAS, 392, L21\n\nHeller, P. & Rohlfs, K., 1994, A&A, 291, 743\n\nSimha, V., Weinberg, D.H., Davé, R., Gnedin,\nO.Y., Katz, N. & Kereš, D., 2010, MNRAS,\n399, 650\n\nHeitsch, F. & Putman, M.E., 2009, ApJ, 698, 1485\nHernquist, L. , 1990a, ApJ, 356, 359\n\nSpringel, V., 2005, MNRAS, 364, 1105\n\nHernquist, L., 1990b, Dynamics and Interactions\nof Galaxies, ed Wielen, R., 108\n\nStanimirović, S., Staveley-Smith, L. & Jones,\nP.A., 2004, ApJ, 604, 176\n\nKallivayalil, N., van der Marel, R. P., Alcock, C.,\nAxelrod, T., Cook, K. H., Drake, A. J. & Geha,\nM., 2006a, ApJ, 638, 772 , [K1]\n\nStanimirović, S., Hoffman, S., Heiles, C., Douglas,\nK.A., Putman, M.E., & Peek, J.E.G., 2008,\nApJ, 680, 276\n\nKallivayalil, N., van der Marel, R. P. & Alcock,\nC., 2006b, ApJ, 652, 1213, [K2]\n\nSubramanian, S. & Subramanian, A., 2009, A&A,\n496, 399\n\nKereš, D. & Hernquist, L., 2009, ApJ, 700, L1\n\nSwaters, R.A., van Albada, T.S., van der Hulst,\nJ.M. & Sancisi, R., 2002, ApJ, 390, 829\n\nKnebe, A., Power, C., Gill, S.P.D. & Gibson, B.K..\n2006, MNRAS, 368, 741\n\nToomre, A. & Toomre, J. 1972, ApJ, 178, 623\n\nMathewson, D.S., Cleary, M.N., & Murray, J.D.,\n1974, ApJ, 190, 291\n\nvan der Marel, R.P., Alves, D.R., Hardy, E. &\nSuntzeff, N.B., 2002, AJ, 124, 2639\n\nMastropietro, C., Moore, B., Mayer, L., Wadsley,\nJ. & Stadel, J. , 2005, MNRAS, 363, 509\n\nvan den Bosch, F.C., Mo, H.J. & Yang, X., 2003,\nMNRAS, 345, 923\n\nMurai, T. & Fujimoto, M. , 1980, \"Astron. Soc.\nJapan\", 32, 581\n\nWang, L., Li, C., Kauffmann, G. & De Lucia, G.,\n2006, MNRAS, 371, 537\n\nNavarro, J.F., Frenk, C.S. & White, S.D.M., 1996,\nApJ, 490, 493\n\nWechsler, R.H., Bullock, J.S., Primack, J.R.,\nKravtsov, A.V. & Dekel, A., 2002, ApJ, 568,\n52\n\nNidever, D.L., Majewski, S.R. & Burton, W.B.,\n2008, ApJ, 679, 432, [N08]\n\nWeiner, B.J. & Williams, T.B., 1996 AJ, 111, 1156\n\nNidever, D.L., Majewski, S.R. & Burton, W.B.,\n2010, submitted\n\nWetzel, A., 2010, arXiv:1001.4792\n\nOlano, C.A., 2004, A&A, 423, 895\n\nXue, X. X., Rix, H. W. Zhao, G., Re Fiorentin,\nP., Naab, T., Steinmetz, M., van den Bosch,\nF. C., Beers, T. C., Lee, Y. S., Bell, E. F.,\nRockosi, C., Yanny, B., Newberg, H., Wilhelm,\nR., Kang, X., Smith, M. C. & Schneider, D. P.,\n2008, ApJ, 684, 1143\n\nPiatek, S., Pryor, C. & Olszewski, E.W. 2008,\nApJ, 135, 1024\nPutman, M. Staveley-Smith, L., Freeman, K.C.,\nGibson, B.K. & Barnes, D.G., 2003, ApJ, 586,\n170\n\nYoshizawa, A. M. & Noguchi, M., 2003, MNRAS,\n339, 113\n\nReid, M.J., Menten, K.M., Zheng, X.W., Brunthaler, A., Moscadelli, L., Xu, Y., Zhang,\nB., Sato, M., Honma, M., Hirota, T.,\nHachisuka, K., Choi, Y.K., Moellenbrock, G.A.\n& Bartkiewicz, A., 2009, ApJ, 700, 137\nRůžička, A., Theis, C. & Palouš, J., 2009, ApJ,\n691, 1807\n\nThis 2-column preprint was prepared with the AAS LATEX\nmacros v5.2.\n\n6\n\n\fFig. 1.- The orbit of the SMC about the LMC (without the MW). Top left: The separation between the\nClouds as a function of time. The chosen orbit is highly eccentric (e=0.7) and decays rapidly owing to\ndynamical friction. The Stream forms at 4 Gyr (red box) and the time today would correspond to ∼5.2 Gyr\n(blue box). Subsequent Panels: The HI gas column density is plotted as contours over the stellar distribution\nfor specific points in the orbit. Gas contours span a range of 1018 − 1020 /cm2 , where each contour represents\nan increase in column density by a factor of 1.5. HI gas is identified as gas at temperatures below 12000 K\nand column densities larger than 1018 /cm2 , although a background ionizing field is not included. A bridge of\ngas connecting the Clouds and a 100 kpc long gaseous stream with no stellar counterpart is formed without\nthe aid of MW tides or ram pressure.\n\n7\n\n\fFig. 2.- The stellar surface brightness, HI gas column densities and line-of-sight velocities of the simulated\nMagellanic system. Top panel: The resulting stellar distribution is projected in Magellanic coordinates\n(N08), a variation of the Galactic coordinate system where the Stream is straight. The distribution is colorcoded in terms of Vband surface brightness. The past orbit of the L/SMC are indicated by the blue lines.\nMiddle panel: The HI gas column densities of the simulated stream range from 1018 − 1021 /cm2 , as expected\n(Putman et al. 2003). The white circle indicates the observed extent of the LMC's HI disk: the simulated\nLMC is more extended than observed, indicating ram pressure likely plays a role to truncate the disk. In\nboth the top and middle panels, the solid white line indicates the past orbit of the SMC according to the\nold theoretically derived PMs (GN96) which was a priori chosen to trace the Stream on the plane of the\nsky. The true orbits (determined by all PM measurements) for the L/SMC are indicated by the yellow lines.\nBottom panel: The line-of-sight velocities along the simulated stream are plotted and color-coded based on\nHI column density, as in the middle panel. The white line is a fit to the observed data (N08). The LMC\ndisk is too extended, causing a larger velocity spread than observed. The line-of-sight velocities along the\npast orbits of the L/SMC are indicated by the yellow lines, which do not follow the true velocities along the\nStream (e.g. B07 figure 20). The Stream is kinematically distinct from the orbits of the Clouds.\n\n8\n\n\fTable 1\nL/SMC Initial Conditions Adopted\nProperty\n\nLMC\n\nSMC\n\nM∗ (M⊙ )\nMgas (M⊙ )\nMhalo (M⊙ ) a\nV200 (km/s)\nConcentration\nStellar scale length (kpc)\nGas scale length (kpc)\nNstars\nNgas\nNhalo\n\n2.2 × 109\n1.4 × 109\n1.8 × 1011 M⊙\n82\n9\n1.7\n10.2\n100000\n300000\n100000\n\n1.3 × 108\n1.1 × 109\n2.5 × 1010\n42\n15\n0.7\n3.6\n100000\n300000\n100000\n\na\n\nThe total halo mass is determined using the observed\nstellar mass of the LMC(SMC) M∗ = 3 × 109 M⊙ (3 ×\n108 M⊙ ) (van der Marel et al. 2002; Stanimirović et al.\n2004) and the relations from Wang et al. (2006). Note\nthat the observed M∗ is less than that quoted in this table\nin order to account for star formation in future studies.\n\n9\n\n\f"}