{"id": "http://arxiv.org/abs/0807.4257v1", "guidislink": true, "updated": "2008-07-26T20:58:21Z", "updated_parsed": [2008, 7, 26, 20, 58, 21, 5, 208, 0], "published": "2008-07-26T20:58:21Z", "published_parsed": [2008, 7, 26, 20, 58, 21, 5, 208, 0], "title": "Strong correlation effects and optical conductivity in electron doped\n  cuprates", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0807.5096%2C0807.2495%2C0807.0877%2C0807.3797%2C0807.3066%2C0807.2675%2C0807.3631%2C0807.4367%2C0807.2371%2C0807.2700%2C0807.1686%2C0807.0958%2C0807.4030%2C0807.1180%2C0807.4404%2C0807.1757%2C0807.0944%2C0807.5059%2C0807.3015%2C0807.2229%2C0807.3160%2C0807.2951%2C0807.4194%2C0807.1147%2C0807.1591%2C0807.4663%2C0807.0392%2C0807.3475%2C0807.2243%2C0807.0828%2C0807.4325%2C0807.3477%2C0807.2056%2C0807.2237%2C0807.1488%2C0807.3417%2C0807.0815%2C0807.5118%2C0807.3813%2C0807.2809%2C0807.4766%2C0807.0918%2C0807.4100%2C0807.1463%2C0807.1201%2C0807.2683%2C0807.2110%2C0807.1661%2C0807.4555%2C0807.1320%2C0807.3644%2C0807.2885%2C0807.4596%2C0807.4631%2C0807.0539%2C0807.0143%2C0807.5113%2C0807.3955%2C0807.4257%2C0807.0549%2C0807.1080%2C0807.4739%2C0807.0561%2C0807.4023%2C0807.2731%2C0807.3695%2C0807.1756%2C0807.1391%2C0807.3380%2C0807.3616%2C0807.2962%2C0807.4547%2C0807.3065%2C0807.1856%2C0807.1379%2C0807.0632%2C0807.4167%2C0807.1039%2C0807.4992%2C0807.1566%2C0807.3625%2C0807.2455%2C0807.1442%2C0807.1390%2C0807.3549%2C0807.4201%2C0807.2784%2C0807.1345%2C0807.1155%2C0807.2562%2C0807.0097%2C0807.3778%2C0807.2557%2C0807.3098%2C0807.3193%2C0807.2687%2C0807.4922%2C0807.3683%2C0807.3426%2C0807.2764%2C0807.0437&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Strong correlation effects and optical conductivity in electron doped\n  cuprates"}, "summary": "We demonstrate that most features ascribed to strong correlation effects in\nvarious spectroscopies of the cuprates are captured by a calculation of the\nself-energy incorporating effects of spin and charge fluctuations. The self\nenergy is calculated over the full doping range of electron-doped cuprates from\nhalf filling to the overdoped system. The spectral function reveals four\nsubbands, two widely split incoherent bands representing the remnant of the\nsplit Hubbard bands, and two additional coherent, spin- and charge-dressed\nin-gap bands split by a spin-density wave, which collapses in the overdoped\nregime. The incoherent features persist to high doping, producing a remnant\nMott gap in the optical spectra, while transitions between the in-gap states\nlead to pseudogap features in the mid-infrared.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0807.5096%2C0807.2495%2C0807.0877%2C0807.3797%2C0807.3066%2C0807.2675%2C0807.3631%2C0807.4367%2C0807.2371%2C0807.2700%2C0807.1686%2C0807.0958%2C0807.4030%2C0807.1180%2C0807.4404%2C0807.1757%2C0807.0944%2C0807.5059%2C0807.3015%2C0807.2229%2C0807.3160%2C0807.2951%2C0807.4194%2C0807.1147%2C0807.1591%2C0807.4663%2C0807.0392%2C0807.3475%2C0807.2243%2C0807.0828%2C0807.4325%2C0807.3477%2C0807.2056%2C0807.2237%2C0807.1488%2C0807.3417%2C0807.0815%2C0807.5118%2C0807.3813%2C0807.2809%2C0807.4766%2C0807.0918%2C0807.4100%2C0807.1463%2C0807.1201%2C0807.2683%2C0807.2110%2C0807.1661%2C0807.4555%2C0807.1320%2C0807.3644%2C0807.2885%2C0807.4596%2C0807.4631%2C0807.0539%2C0807.0143%2C0807.5113%2C0807.3955%2C0807.4257%2C0807.0549%2C0807.1080%2C0807.4739%2C0807.0561%2C0807.4023%2C0807.2731%2C0807.3695%2C0807.1756%2C0807.1391%2C0807.3380%2C0807.3616%2C0807.2962%2C0807.4547%2C0807.3065%2C0807.1856%2C0807.1379%2C0807.0632%2C0807.4167%2C0807.1039%2C0807.4992%2C0807.1566%2C0807.3625%2C0807.2455%2C0807.1442%2C0807.1390%2C0807.3549%2C0807.4201%2C0807.2784%2C0807.1345%2C0807.1155%2C0807.2562%2C0807.0097%2C0807.3778%2C0807.2557%2C0807.3098%2C0807.3193%2C0807.2687%2C0807.4922%2C0807.3683%2C0807.3426%2C0807.2764%2C0807.0437&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We demonstrate that most features ascribed to strong correlation effects in\nvarious spectroscopies of the cuprates are captured by a calculation of the\nself-energy incorporating effects of spin and charge fluctuations. The self\nenergy is calculated over the full doping range of electron-doped cuprates from\nhalf filling to the overdoped system. The spectral function reveals four\nsubbands, two widely split incoherent bands representing the remnant of the\nsplit Hubbard bands, and two additional coherent, spin- and charge-dressed\nin-gap bands split by a spin-density wave, which collapses in the overdoped\nregime. The incoherent features persist to high doping, producing a remnant\nMott gap in the optical spectra, while transitions between the in-gap states\nlead to pseudogap features in the mid-infrared."}, "authors": ["Tanmoy Das", "R. S. Markiewicz", "A. Bansil"], "author_detail": {"name": "A. Bansil"}, "author": "A. Bansil", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1209/0295-5075/96/27004", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/0807.4257v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0807.4257v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "5 pages, 4 figures", "arxiv_primary_category": {"term": "cond-mat.supr-con", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cond-mat.supr-con", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "cond-mat.str-el", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0807.4257v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0807.4257v1", "journal_reference": "Europhys. Lett. 96, 27004 (2011)", "doi": "10.1209/0295-5075/96/27004", "fulltext": "Strong correlation effects and optical conductivity in electron doped cuprates\nTanmoy Das, R. S. Markiewicz, and A. Bansil\n\narXiv:0807.4257v1 [cond-mat.supr-con] 26 Jul 2008\n\nPhysics Department, Northeastern University, Boston MA 02115, USA\n(Dated: September 25, 2018)\nWe demonstrate that most features ascribed to strong correlation effects in various spectroscopies\nof the cuprates are captured by a calculation of the self-energy incorporating effects of spin and\ncharge fluctuations. The self energy is calculated over the full doping range of electron-doped\ncuprates from half filling to the overdoped system. The spectral function reveals four subbands, two\nwidely split incoherent bands representing the remnant of the split Hubbard bands, and two additional coherent, spin- and charge-dressed in-gap bands split by a spin-density wave, which collapses\nin the overdoped regime. The incoherent features persist to high doping, producing a remnant Mott\ngap in the optical spectra, while transitions between the in-gap states lead to pseudogap features in\nthe mid-infrared.\nPACS numbers: 74.25.Gz, 74.72.-h, 74.20.Mn,74.25.Jb\n\nA key issue in cuprate physics is to understand the\nroutes through which cuprates evolve from a 'Mott' insulator at half filling to a high-Tc superconductor at\noptimal doping. Underdoped cuprates show the presence of a 'pseudogap' or a region of depleted density\nof states extending to several hundred meV's around\nthe Fermi energy and thus are very unconventional,\nbut the overdoped system behaves closer to a normal\nFermi liquid and is thus amenable to a largely conventional description. Along these lines, evidence of small\nFermi surface pockets[1] has been reported in the underdoped regime, while in overdoped Tl2 Ba2 CuO6+δ , a\nlarge, three-dimensional Fermi surface consistent with\nLDA band structure calculations[2] is observed. In sharp\ncontrast, optical studies point to a far more complex and\npuzzling picture in that even in the overdoped case, an\nabsorption peak characteristic of the Mott gap continues to persist[3, 4] in the spectra, suggesting that doping introduces new in-gap states in which the pseudogap\nphysics resides, but that otherwise the Mott gap persists\nat all dopings. Here we show that a relatively simple and\ntransparent model of the electronic self energy, where\nthe quasiparticles are dressed with spin wave excitations,\ncaptures the key experimentally observed features of the\nremarkable doping evolution in optical and other spectroscopies, including in particular the persistence of the\nMott gap in the overdoped regime. Our self-energy is also\nin good accord with quantum Monte Carlo computations\nin the parameter regimes where the latter are available.\nWe evaluate the self-energy Σ as a convolution over the\ngreen function G and the interaction W ∼ U 2 χ (including both spin and charge contributions) as [5],\n′\n\nX\n3\nΣ(~k, σ, iωn ) = U 2\n2\n′\nq\n~,σ\n\nZ\n\n∞\n\n−∞\n\ndωp\n2π\n\n′\nG(~k + ~q, σ ′ , ωn + ωp )Γ(~k, ~\nq , ωn , ωp )Im[χσσ (~\nq , ωp )], (1)\n\nwhere σ is the spin index and the prime over the ~q\nsummation means that the summation is restricted to\n\nthe magnetic Brillouin zone. In the underdoped region, the pseudogap is modeled by an antiferromagnetic\n(AFM) order parameter, resulting in G, χ and Σ becoming 2 × 2 tensors[6]. We define a total self-energy as\nΣt = U S τ ̃1 + Σ, where τ ̃1 is the Pauli matrix along the\nx−direction and U S is the AFM gap defined below. The\nself-energy Σt contains essentially two energy scales: (i) it\ngives rise to the SDW with an additional renormalization\nof the overall quasiparticle dispersions in the low energy\nregion, and (ii) at higher energies it produces the Hubbard bands. We use a modified self-consistent scheme,\nreferred to as quasiparticle−GW (QP−GW )-scheme in\nwhich G and W are calculated from\n\u0001 an approximate selfenergy Σt0 (ω) = U S τ ̃1 + 1 − Z −1 ω 1̃, where the renormalization factor Z is adjusted self-consistently to match\nthe self-energy Σt at low energy.[7, 8]\nWe find that near optimal doping spin waves[7, 8, 9, 10,\n11] dress the quasiparticles into a coherent in-gap state,\nwhile the incoherent high-energy features are remnants of\nthe upper and lower Hubbard bands (U/LHBs)[12]. With\nunderdoping the in-gap state develops into a spin density\nwave (SDW) state which opens a gap between the upper\nand lower magnetic bands (U/LMBs). The model also\ndescribes the high-energy kink or the waterfall effect seen\nin the electronic dispersion[13] as the crossover between\ncoherent and incoherent features.\nThe present calculations are restricted to the electrondoped cuprates in order to avoid possible complications of nanoscale phase separation. The self-energy\nΣt0 splits the LDA-band, ξ~k (modelled by tight-binding\n(TB) parameters[7]) into renormalized UMB (ν = +)\nand LMB (ν = −):\nq\n\u0011\n\u0010\nE~kν = Z ξ~+ ± (ξ~− )2 + (U S)2 ,\nk\n\nk\n\n(2)\n\nwhere ξ~± = (ξ~k ± ξ~k+Q\n~ )/2. The AFM magnetization S\nk\n~ = (π, π) is calculated self-consistently at each dopat Q\ning, assuming a doping dependent U .[14] In the present\nformalism U is renormalized by Z. The doping depen-\n\n\f2\n\n1.6\n1.2\n\nx=0.0\nx=0.05\nx=0.10\nx=0.15\nx=0.17\n\n1/τ (eV)\n\nσ(ω) (105 Ω−1m−1)\n\n2.0\n0.1\n0.05\n0.0\n0\n\n0.1\n\n0.2\n\ndoping\n\n0.8\n0.4\n0.0\n0\n\n1\n\nω (eV)\n\n2\n\n3\n\nFIG. 1: (color online) Calculated optical conductivity (solid\nlines) compared with experiment (symbols of same color) for\ndopings x = 0.0 to x = 0.15 as taken from Ref. 3 and for\nx = 0.17 from Ref. 4. Experimental data for x = 0.17 is\nsubtracted by a background contribution to match the other\ndata set. The dashed line gives the background contribution\nadded to the theoretical spectrum at x = 0. inset: Inferred\ndoping dependence of the scattering rate.\n\ndency of U is chosen such that ZU reproduces the pseudogap in both angle-resolved photoemission spectroscopy\n(ARPES) and optical spectra, while x, S, and Z are determined self-consistently.[15] Finally, the vertex correction Γ(~k, ~q, ω, ωp ) in Eq. 1 is taken as its first order approximation (Ward's identity) as Γ(~k, ~\nq , ω, ωp ) = 1/Z.\nSince the k-dependence of Σ is weak, we further simplify\nthe calculation by assuming a k-independent Σ, which\nwe calculate at a representative point k = (π/2, π/2).\nWe begin by discussing the optical spectra of Fig. 1.\nThe frequency dependent optical conductivity, σ(ω), is\ncalculated using standard linear response theory in the\nAFM state,[16] for the full doping range from the halffilled state to the quantum critical point (QCP) in the\noverdoped region. A very good level of accord is seen\nwith the experimental results[3, 4]. To fit the Drude\nconductivity, we have introduced an impurity scattering\nrate τ which is found to have a strong doping dependence\n(inset). At high energy we include a doping-dependent\nbackground contribution, presumably associated with interband transitions to higher-lying bands not included in\nthe present calculations. We have used the same energydependence of the background for all dopings with an\nintensity that decreases smoothly with doping. The red\ndashed line in Fig. 1 shows this interband contribution\nfor the x = 0.0 spectrum.\nInterestingly, the spectra show a nearly isosbetic (equal\nabsorption) point near 1.4 eV, consistent with the experimental behavior. The doping evolution is completely different on opposite sides of this isosbetic point. Above this\n\npoint the spectrum is dominated by a broad hump feature above 1.5 eV, a signature of the Mott gap. At halffilling, only this feature is present and the optical spectrum shows an insulating gap whose energy, structure,\nand intensity match remarkably with measurements[3].\nAs doping increases the high energy peak shifts to higher\nenergy and broadens.\nBelow the isosbectic point there is little spectral weight\nat half filling, but as doping increases spectral weight is\ngradually transferred from the higher energy region to\nthe mid-infrared (MIR) one. The lower energy spectrum\nis associated with a Drude peak related to intraband\ntransitions and a mid-infrared peak associated with transitions across the magnetic gap [the pseudogap for the\nelectron-doped cuprates]. With doping, this peak shifts\nto lower energy as the magnetic gap collapses and gradually sharpens due to the doping dependent scattering\nrate, see inset to Fig. 1. Note that at x = 0.17, when\nthe pseudogap has collapsed, Mott-gap features still persist in the spectrum. The present mean-field calculation\noverestimates the Néel temperature TN , but this can be\ncorrected by including critical fluctuations, grave a la the\nMermin-Wagner theorem[17].\nThe origin of these features can be understood by looking at the doping dependence of the momentum-resolved\nspectral weight in Fig. 2. In the overdoped case in\nFig. 2(e), a kink due to the bosonic coupling reproduces\nthe waterfall effect below EF , with a corresponding effect\nabove EF , splitting the spectrum into an effective threeband behavior, with UHB, LHB, and in-gap states. The\nfeatures in the optical spectra are associated with transitions between these bands: The residual Mott gap arises\nfrom the transition from the LMB to the incoherent UHB\n[or from LHB to UMB], while the Drude term is associated with intraband transitions near the Fermi level.\nAt lower doping an AFM gap opens in the coherent ingap states[18], leading to the UMB/LMB splitting and a\nfour band behavior similar to that seen in QMC cluster\ncalculations[19]. Consistent with the QMC calculations,\nthe coherent in-gap bands are dressed by magnetic quasiparticles. As the magnetic gap opens, the MIR feature\nin the optical spectra, being associated with transitions\nacross this gap, shifts to higher energy.\nThe quality of self-consistency of our scheme can be\nassessed by noting that the final coherent bands have\nnearly the same dispersion as the Σ0 −dressed ones (gold\nlines) used as input to obtain the self-energy. The doping\ndependence of the two coherent magnetic bands is in excellent agreement with experiments[20] and earlier mean\nfield calculations[14], and captures the incoherent weight\n(the UHB/LHBs) at higher energies seen experimentally.\nNote that the incoherent weight is concentrated near the\ntop and bottom of the bare LDA bands, leading to a\nnearly doping independent UHB-LHB splitting.\nFurther insight is provided by Fig. 3(a), which compares the full QP-GW DOS (blue line) and the Σ0 -\n\n\f(a)\n\nx = 0.04\n\nΣ −dresd.\n0\nΣ−dresd.\nΓ =Z−1\nΓ=1\n\n1.0\n\n(d)\n0.7\n\n0.5\n\n0\n−4\n\n1\n\nZ\n\n′′\n\n−Σ (eV)\n\nx\n(b)\n0.00\n0.04\n0.18\n\nU\n(c)\nZU\nRef. 17\n\n2\nU (eV)\n\nDOS (arb. unit)\n\n3\n\n−2\n\n0\n\nω (eV)\n\n2\n\n4\n\n0.6\n0.0\n\n0.1\n\n0.2\n\nx\n\nFIG. 3: (color online) (a) The QP-GW DOS (blue lines)\nis compared with Σ0 -dressed DOS (red lines) calculated at\nT = 0. The green lines show the DOS without the vertex correction. (b) Solid lines give the imaginary part of\nthe total self-energy, while the dashed lines give the corresponding charge contributions. (c) Doping dependence of selfconsistent values of U and ZU is compared with earlier mean\nfield results[14, 21]. (d) Renormalization factor Z decreases\nlinearly with doping.\n\nFIG. 2: (color online) Spectral intensity as a function of ω\nalong the high-symmetry lines for several dopings (at temperature T = 0). Blue to red color map gives the minimum\nto maximum intensity. In each panel, the gold lines represent\nthe renormalized magnetic bands (Σ0 -dressed).\n\ndressed quasiparticle DOS (red line), normalized to the\nsame peak height, for a representative doping x = 0.04.\nThe good agreement between various computations over\nmost of the energy range indicates the high degree of selfconsistency in the self-energy. The dressed DOS shows\nfour well-separated peaks. A clear leading edge gap of\n∼0.3 eV (∼1 eV at x = 0) can be seen. A gap persists\nat higher doping up to x = 0.18 (Fig. 1), although it is\nobscured in the DOS by band overlap. The importance\n\nof the vertex correction is illustrated by the green line\nin Fig. 3(a), which shows that setting Γ = 1 reduces the\nweight in the U/LHBs.\nFigure 3(b) shows how the calculated imaginary selfenergy Σ′′ evolves with doping. The solid lines give the\ntotal Σ′′ , with the corresponding dashed lines giving the\ncharge contribution. [Σspin = Σtotal − Σcharge is not\nshown]. In the underdoped region the extra splitting at\nhigh energies in the self energy is related to spin-charge\nseparation. The spin response is significant at low energy\nfor all doping but the charge contribution is nearly zero in\nthe low energy region for the lower doping and becomes\nfinite only at higher energies above ∼ 3 eV. As doping\nincreases, the charge response moves toward the Fermi\nlevel and increases in contribution to its total value. At\nx = 18%, when the AFM gap vanishes, the charge and\nspin susceptibility become equal. Note that the broadening of the self-energy evident in Fig. 3(b) is reflected in\nthe increasing broadening of the Mott gap feature with\ndoping. The shift of the peak in the imaginary part of\nthe self-energy towards EF in Fig. 3(b) reflects the doping dependence of the MIR feature in Fig. 1.\nFig. 3(c) describes the doping dependence of U . Although the renormalized Hubbard parameter ZU follows\nalmost the same doping dependence as in mean field\ncalculations[14, 21], the bare U displays considerably\nweaker doping dependence away from half-filling. The\nrenormalization factor Z in Fig. 3(d) actually increases\nwith underdoping.[22] This can be readily understood.\n\n\f4\nQMC\nt′=0\n\nPresent calculations\nt′=0\nt′=−0.3t\n\nx = 0.0\n\n(b)\n\nx = 0.05\n\n(c)\n\nx = 0.10\n\n(d)\n\nx = 0.20\n\nDOS\n\n(a)\n\n−4\n\n−2\n\n0\nω (eV)\n\n2\n\n4 −4\n\n−2\n\n0\nω (eV)\n\n2\n\n4\n\nFIG. 4: (color online) The computed DOS at various dopings\nare compared with the corresponding QMC results (blue lines)\nfor x = 0.0[23] and for x = 0.05 to x = 0.20 [24]. The red\nlines in each panel give our result for t′ = 0, whereas the green\nlines in (b) and (c) are for t′ = −0.3t.\n\nAs we lower doping, the AFM gap increases leading to a\ndecrease of the spectral weight near the Fermi level. This\ncauses a reduction of the real part of the self-energy, shifting the peak in Σ′ towards higher energy. The resulting\nslope decrease leads to a larger Z.\nExisting QMC calculations on the cuprates generally\nemploy simpler hopping parameter sets, so we have repeated our calculations with the same band parameters\nfor a quantitative comparison in Fig. 4. All the QMC results (blue lines) are obtained for t′ = 0, U = 8t with\na momentum dependent self-energy correction[23, 24].\nWe have obtained the corresponding DOSs (red lines)\nfor t′ = 0 for Σ calculated at a fixed momentum of\nk = (π/2, π/2), using a doping dependent renormalized\nU (ZU ) very similar to the one found for the electron\ndoped case in Fig. 3(c). [Note that the QMC automatically generates a renormalized U ]. Our result reproduces\nthe QMC very well for x = 0 in Fig. 4(a) where a prominent electron-hole symmetry is observed. At higher doping, the QMC results show a relatively smaller coherent\npeak above the Fermi level, whereas our result continues\nto exhibit near electron-hole symmetry in the in-gap region as might be expected for t′ = 0 dispersion. We can\nmimic a momentum dependent self-energy by including\nt′ = −0.3t, and find that this provides better agreement\nwith the QMC results as shown by the green lines in\nFigs. 4(b) and 4(c). Finally, at x = 0.20, the pseudogap collapses and our result with t′ = 0 agrees very well\nwith the QMC in Fig. 4(d). As might be expected from\n\nour approximate self-energy calculation, the weight of the\nUHB is generally underestimated.\nIn summary, we find that spin-wave dressing of the\nquasiparticles explains the incoherent U/LHB features\nseen in various experiments including the recent experiments observing waterfall effects in the cuprate spectra.\nThe self-energy corrections not only renormalize the large\nwidths of the LDA dispersions but also restore the residual incoherent spectral weight associated with U/LHBs.\nIn the underdoped regime, we show that the coherent ingap bands reproduce both the four-band behavior seen in\nquantum cluster calculations and the magnetic gap collapse found in the mean-field calculations and a variety\nof experiments. The puzzling persistence of the Mott gap\nin optical spectra, even as the magnetic gap collapses, is\nthus reconciled. The fact that our calculations work so\nwell confirms that the cuprates can be understood within\nthe intermediate coupling regime, with U much less than\ntwice the bandwidth.[25].\nWe thank Mark Jarrell for important conversations.\nThis work is supported by the U.S.D.O.E, Basic Energy\nSciences, contracts DE-FG02-07ER46352 and DE-AC0376SF00098, and benefited from the allocation of supercomputer time at NERSC and Northeastern University's\nAdvanced Scientific Computation Center (ASCC).\n\n[1] N. Doiron-Leyraud et. al. Nature (London) 447, 565\n(2007).\n[2] N. E. Hussey et. al. Nature 425, 814817 (2003).\n[3] Y. Onose et. al., Phys. Rev. B. 69, 024504 (2004).\n[4] S. Uchida et. al., Phys. Rev. B 43, 7942 (1991).\n[5] G. Vignale and M. R. Hedayati, Phys. Rev. B., 42, 786\n(1990).\n[6] J. R. Schrieffer, X. G. Wen, and S. C. Zhang, Phys. Rev.\nB. 39, 11663 (1989). A. V. Chubukov and D. M. Frenkel,\nPhys. Rev. B. 46, 11884 (1992).\n[7] R. S. Markiewicz, S. Sahrakorpi, and A. Bansil, Phys.\nRev. B 76, 174514 (2007).\n[8] R. S. Markiewicz and A. Bansil, Phys. Rev. B 75, 020508\n(2007).\n[9] A. Macridin et. al., Phys. Rev. Lett. 97, 036401 (2006).\n[10] B. Moritz et. al. arXiv:0807.3359.\n[11] While the low-energy carriers are mainly dressed by\nelectronic excitations in the magnetic channel[7, 9], the\ncharge channel can also contribute[8].\n[12] In reality, the Mott physics lies at a higher energy, comparable to the bonding-antibonding separation of the\nCuO2 -hybridized bands, and the bands we refer to as\nU/LHB are the incoherent high energy tails of the antibonding (LDA) band.\n[13] F. Ronning et. al. Phys. Rev. B 71, 094518 (2005); J.\nGraf et .al., Phys. Rev. Lett. 98, 067004 (2007); J. Graf\net .al., Physica C 460, 194 (2007); Z.-H. Pan et. al.\narXiv:cond-mat/0610442 (unpublished).\n[14] C. Kusko et. al., Phys. Rev. B. 66, 140513(R) (2002).\n[15] Tanmoy Das, R. S. Markiewicz, and A. Bansil, Phys.\nRev. B 77, 134516 (2008) .\n\n\f5\n[16] P. B. Allen, arXiv:cond-mat/0407777 (unpublished).\n[17] R.S. Markiewicz, Phys. Rev. B 70, 174518 (2004).\n[18] We use a single renormalisation factor for both bands at\nall dopings.\n[19] C. Gröber, R. Eder, and W. Hanke, Phys. Rev. B 62,\n4336 (2000).\n[20] N.P. Armitage, et al., Phys. Rev. Lett. 88, 257001 (2002).\n[21] Tanmoy Das, R. S. Markiewicz and A. Bansil, Phys. Rev.\nLett. 98, 197004 (2007).s\n\n[22] Recall that this Z parameter represents an average renormalization over the coherent band, and is not necessarily\nequal to the conventional renormalization factor at EF .\n[23] T.A. Maier, M. Jarrell and D.J. Scalapino, Phys. Rev. B\n74, 094513 (2006).\n[24] M. Jarrell et. al., Europhysics Letter, 56, 563 (2001).\n[25] A. Comanac et. al., Nature Physics, 4 287 (2008).\n\n\f"}