{"id": "http://arxiv.org/abs/0711.0944v2", "guidislink": true, "updated": "2009-07-13T16:16:32Z", "updated_parsed": [2009, 7, 13, 16, 16, 32, 0, 194, 0], "published": "2007-11-06T18:37:59Z", "published_parsed": [2007, 11, 6, 18, 37, 59, 1, 310, 0], "title": "The space of tropically collinear points is shellable", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0711.0274%2C0711.0823%2C0711.3778%2C0711.0482%2C0711.1540%2C0711.3260%2C0711.4096%2C0711.0573%2C0711.2913%2C0711.2641%2C0711.2021%2C0711.1989%2C0711.2194%2C0711.2196%2C0711.4797%2C0711.1188%2C0711.1564%2C0711.0224%2C0711.4659%2C0711.2934%2C0711.0501%2C0711.4529%2C0711.4790%2C0711.2909%2C0711.1894%2C0711.2956%2C0711.0872%2C0711.3978%2C0711.0128%2C0711.4989%2C0711.0453%2C0711.2446%2C0711.2647%2C0711.1132%2C0711.1821%2C0711.1391%2C0711.2613%2C0711.4526%2C0711.3721%2C0711.0751%2C0711.0863%2C0711.4674%2C0711.3759%2C0711.2635%2C0711.1911%2C0711.3144%2C0711.0529%2C0711.4933%2C0711.1259%2C0711.3189%2C0711.1984%2C0711.2025%2C0711.4857%2C0711.2231%2C0711.4165%2C0711.3290%2C0711.3572%2C0711.3630%2C0711.4448%2C0711.0799%2C0711.2536%2C0711.1518%2C0711.2333%2C0711.4967%2C0711.4290%2C0711.4566%2C0711.4055%2C0711.0825%2C0711.2581%2C0711.4187%2C0711.0427%2C0711.1352%2C0711.1000%2C0711.4369%2C0711.0728%2C0711.3690%2C0711.2100%2C0711.1488%2C0711.0657%2C0711.2556%2C0711.2015%2C0711.3847%2C0711.0865%2C0711.1827%2C0711.0944%2C0711.2204%2C0711.1658%2C0711.0990%2C0711.4474%2C0711.3157%2C0711.3866%2C0711.4477%2C0711.1004%2C0711.4377%2C0711.4179%2C0711.5017%2C0711.1858%2C0711.1367%2C0711.3604%2C0711.4338%2C0711.4668&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "The space of tropically collinear points is shellable"}, "summary": "The space T_{d,n} of n tropically collinear points in a fixed tropical\nprojective space TP^{d-1} is equivalent to the tropicalization of the\ndeterminantal variety of matrices of rank at most 2, which consists of real d x\nn matrices of tropical or Kapranov rank at most 2, modulo projective\nequivalence of columns. We show that it is equal to the image of the moduli\nspace M_{0,n}(TP^{d-1},1) of n-marked tropical lines in TP^{d-1} under the\nevaluation map. Thus we derive a natural simplicial fan structure for T_{d,n}\nusing a simplicial fan structure of M_{0,n}(TP^{d-1},1) which coincides with\nthat of the space of phylogenetic trees on d+n taxa. The space of phylogenetic\ntrees has been shown to be shellable by Trappmann and Ziegler. Using a similar\nmethod, we show that T_{d,n} is shellable with our simplicial fan structure and\ncompute the homology of the link of the origin. The shellability of T_{d,n} has\nbeen conjectured by Develin in 2005.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0711.0274%2C0711.0823%2C0711.3778%2C0711.0482%2C0711.1540%2C0711.3260%2C0711.4096%2C0711.0573%2C0711.2913%2C0711.2641%2C0711.2021%2C0711.1989%2C0711.2194%2C0711.2196%2C0711.4797%2C0711.1188%2C0711.1564%2C0711.0224%2C0711.4659%2C0711.2934%2C0711.0501%2C0711.4529%2C0711.4790%2C0711.2909%2C0711.1894%2C0711.2956%2C0711.0872%2C0711.3978%2C0711.0128%2C0711.4989%2C0711.0453%2C0711.2446%2C0711.2647%2C0711.1132%2C0711.1821%2C0711.1391%2C0711.2613%2C0711.4526%2C0711.3721%2C0711.0751%2C0711.0863%2C0711.4674%2C0711.3759%2C0711.2635%2C0711.1911%2C0711.3144%2C0711.0529%2C0711.4933%2C0711.1259%2C0711.3189%2C0711.1984%2C0711.2025%2C0711.4857%2C0711.2231%2C0711.4165%2C0711.3290%2C0711.3572%2C0711.3630%2C0711.4448%2C0711.0799%2C0711.2536%2C0711.1518%2C0711.2333%2C0711.4967%2C0711.4290%2C0711.4566%2C0711.4055%2C0711.0825%2C0711.2581%2C0711.4187%2C0711.0427%2C0711.1352%2C0711.1000%2C0711.4369%2C0711.0728%2C0711.3690%2C0711.2100%2C0711.1488%2C0711.0657%2C0711.2556%2C0711.2015%2C0711.3847%2C0711.0865%2C0711.1827%2C0711.0944%2C0711.2204%2C0711.1658%2C0711.0990%2C0711.4474%2C0711.3157%2C0711.3866%2C0711.4477%2C0711.1004%2C0711.4377%2C0711.4179%2C0711.5017%2C0711.1858%2C0711.1367%2C0711.3604%2C0711.4338%2C0711.4668&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "The space T_{d,n} of n tropically collinear points in a fixed tropical\nprojective space TP^{d-1} is equivalent to the tropicalization of the\ndeterminantal variety of matrices of rank at most 2, which consists of real d x\nn matrices of tropical or Kapranov rank at most 2, modulo projective\nequivalence of columns. We show that it is equal to the image of the moduli\nspace M_{0,n}(TP^{d-1},1) of n-marked tropical lines in TP^{d-1} under the\nevaluation map. Thus we derive a natural simplicial fan structure for T_{d,n}\nusing a simplicial fan structure of M_{0,n}(TP^{d-1},1) which coincides with\nthat of the space of phylogenetic trees on d+n taxa. The space of phylogenetic\ntrees has been shown to be shellable by Trappmann and Ziegler. Using a similar\nmethod, we show that T_{d,n} is shellable with our simplicial fan structure and\ncompute the homology of the link of the origin. The shellability of T_{d,n} has\nbeen conjectured by Develin in 2005."}, "authors": ["Hannah Markwig", "Josephine Yu"], "author_detail": {"name": "Josephine Yu"}, "author": "Josephine Yu", "arxiv_comment": "final version, minor revision, 15 pages", "links": [{"href": "http://arxiv.org/abs/0711.0944v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0711.0944v2", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "math.CO", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "math.CO", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "math.AG", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "52B22, 14N10", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0711.0944v2", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0711.0944v2", "journal_reference": "Collectanea Mathematica 60, 1 (2009), pp 63-77", "doi": null, "fulltext": "arXiv:0711.0944v2 [math.CO] 13 Jul 2009\n\nTHE SPACE OF TROPICALLY COLLINEAR POINTS IS\nSHELLABLE\nHANNAH MARKWIG AND JOSEPHINE YU\n\nAbstract. The space Td,n of n tropically collinear points in a fixed tropical\nprojective space TPd−1 is equivalent to the tropicalization of the determinantal\nvariety of matrices of rank at most 2, which consists of real d × n matrices of\ntropical or Kapranov rank at most 2, modulo projective equivalence of columns.\nWe show that it is equal to the image of the moduli space M0,n (TPd−1 , 1) of\nn-marked tropical lines in TPd−1 under the evaluation map. Thus we derive\na natural simplicial fan structure for Td,n using a simplicial fan structure of\nM0,n (TPd−1 , 1) which coincides with that of the space of phylogenetic trees\non d + n taxa. The space of phylogenetic trees has been shown to be shellable\nby Trappmann and Ziegler. Using a similar method, we show that Td,n is\nshellable with our simplicial fan structure and compute the homology of the\nlink of the origin. The shellability of Td,n has been conjectured by Develin in\n[1].\n\n1. Introduction\nLet (R, ⊕, ⊙) be the tropical semiring where the tropical addition ⊕ is taking\nminimum and the tropical multiplication ⊙ is the usual addition. We will work in\nthe tropical projective space TPd−1 = Rd /(1, . . . , 1)R obtained by quotienting out\nthe tropical scalar multiplication (tropical projective equivalence).\nA tropical line in TPd−1 is a one dimensional polyhedral complex in TPd−1 which\nis combinatorially a tree with unbounded edges in directions e1 , . . . , ed and the\nbalancing condition at each vertex as follows. At a vertex V , let u1 , . . . , uk be the\nprimitive integer vectors pointing from V to its adjacent vertices (respectively, in\ndirection of the unbounded edges adjacent to V ). The balancing condition holds\nat V if u1 + * * * + uk = 0 in TPd−1 . A configuration of n points in TPd−1 is called\ntropically collinear if there is a tropical line which passes through the n points. Let\nTd,n be the space of all such configurations. An element of Td,n is represented by a\nreal d × n matrix whose n columns are representatives of the n points in TPd−1 .\nThe columns of a matrix are tropically collinear if and only if the matrix lies\nin the tropical variety of the determinantal ideal generated by 3 × 3 minors of a\nd × n matrix of indeterminates, which is a polyhedral subfan of the Gröbner fan\nconsisting of those cones whose corresponding initial ideal is monomial-free. Since\nTd,n is equal to this tropical variety modulo projective equivalence of the columns in\nthe matrix, it is also a polyhedral fan. However this fan structure is not simplicial,\nand the topology of the link of the origin is difficult to analyze. Develin conjectured\nin [1] that Td,n is shellable for all d and n, and proved his conjecture for d = 3 (or\nn = 3). In this paper we prove his conjecture for all d and n, with a refined fan\n1\n\n\f2\n\nHANNAH MARKWIG AND JOSEPHINE YU\n\nstructure. We give a triangulation of the fan that lets us treat Td,n as a subcomplex\nof the space of phylogenetic trees, which in turns gives us a way to prove strong\ncombinatorial properties such as shellability. Shellability implies that our space is\nCohen-Macaulay and has homology only in the top dimension. Moreover, a shelling\norder gives us a way to compute the top homology of the link of the origin.\nIn Section 2, we will derive a simplicial fan structure on Td,n , using moduli\nspaces of tropical curves and the space of phylogenetic trees Tn+d . Since Td,n is\nclosed under simultaneous translation of all points , we will mod out by this action\n′\nand obtain a pointed simplicial fan that we denote by Td,n\n. We then intersect this\nfan with the unit sphere centered at the origin to obtain a simplicial complex which\n′′\n′\n′′\nwe will call Td,n\n. The simplicial complex structures of Td,n , Td,n\n, and Td,n\nare all\nthe same. In particular, if one of them is shellable, then so are the other two.\nA parametrized tropical line can be thought of as an abstract tropical curve (a\nleaf-labeled tree) Γ together with a map\nh : Γ → TPd−1 ,\nsuch that the image h(Γ) is a tropical line as defined above. Our parametrized\ntropical lines are equipped with certain marked points xi . In section 2, we will\nrecall the definition of moduli spaces of n-marked parametrized tropical lines, and\nevaluation maps which send a tuple (Γ, h, xi ) to h(xi ) ∈ TPd−1 . We will show that\nTd,n is the image of the moduli space of n-marked parametrized tropical lines under\nthe evaluation map.\nModuli spaces of tropical curves can be used to derive results in enumerative\ntropical geometry. This is why these moduli spaces attracted a lot of attention\nrecently (see e.g. [6], [4] or [3]). Their simplicial fan structure equals the structure\nof the space of trees, Tn+d (see [3]). In fact, we can identify Td,n with a subcomplex\nof the space of trees Tn+d on which the evaluation map is injective, the subcomplex\ninduced on the vertices corresponding to \"bicolored splits\" (see definition 2.9).\nIn [10], Trappmann and Ziegler showed that the space of trees Tn+d is shellable.\n′\nSince we derive our simplicial complex structure for Td,n\nusing the space of trees\n′\nTn+d , we will use a similar method to show that the space Td,n\nis shellable, in\n′′\nSection 3. We compute the homology of Td,n in Section 4. Our main results can\nbe summarized as follows:\nTheorem 1.1\n′′\nThe simplicial complex Td,n\nis shellable and has the homotopy type of a wedge of\nn + d − 4-dimensional spheres. The number of spheres is equal to the number of\nsimultaneous partitions of an (n − 1)-set and a (d − 1)-set into the same number of\nnon-empty ordered parts. This number equals\nmin(n−1,d−1)\n\nX\n\n(k!)2 S(n − 1, k)S(d − 1, k),\n\nk=1\n\n\u0012 \u0013\nk\n1 X\nk−i k\nim is the Stirling number of the second kind.\n(−1)\nwhere S(m, k) =\ni\nk! i=1\nThis theorem follows from the theorems 3.2 and 4.1.\n\n\fTHE SPACE OF TROPICALLY COLLINEAR POINTS IS SHELLABLE\n\n3\n\nIn general, not much is known about the algebraic topology of tropical varieties.\nNot all tropical varieties have homology only in the top dimension [9, Example\n5.2]. However, there may be many classes of tropical varieties that have only top\nhomology and are even shellable. For example, it is not known whether the tropical\nvarieties of generic complete intersections studied in [9] are shellable. Hacking [5]\ngave some sufficient conditions for some tropical varieties to have only top homology.\nHe also gave a moduli space interpretation of Td,n and showed that it has only top\nhomology.\nAcknowledgments. We would like to thank Bernd Sturmfels for helpful conversations. This work began when the authors were at the Institute for Mathematics\nand Its Application in Minneapolis. Josephine Yu was supported by a Clay Liftoff\nFellowship during summer 2007.\n\n′\n2. The space Td,n\ninside the space of phylogenetic trees\n\nAs mentioned in the introduction, we want to derive a simplicial fan structure\nfor Td,n using moduli spaces of tropical curves. Let us start by defining tropical\ncurves and their moduli spaces.\n\n2.1. The space M0,N of N -marked abstract tropical curves. An abstract\ntropical curve is a tree Γ whose vertices have valence at least 3. The internal\nedges are equipped with a finite positive length. The leaf edges are considered\nunbounded. An N -marked abstract tropical curve is a tuple (Γ, x1 , . . . , xN ) where\nΓ is an abstract tropical curve and x1 , . . . , xN are distinct unbounded edges. (For\nmore details, see [4], definition 2.2.) The space M0,N is defined to be the space of\nall N -marked abstract tropical curves with exactly N leaves. The following picture\nshows an example of a 5-marked abstract tropical curve:\n2\n\n1\n\n3\nl = 1.5\n\nl=2\n\n4\n5\n\nLet TN be the space of phylogenetic trees on N taxa. A phylogenetic tree (or a\nsemi-labeled tree or a leaf-labeled tree) on N taxa is a tree with N leaves labeled\nby [N ] and vertices of valence at least 3 such that the internal edges have positive\nlengths and the leaf edges have non-negative lengths. In other words, a phylogenetic\ntree on N taxa is an N -marked abstract tropical curve whose leaf-edges are assigned\na non-negative length. Hence M0,N is the space TN of phylogenetic trees modulo\nthe space of star trees. A star tree is a phylogenetic tree with no internal edges.\nThe following figure shows a star tree on 5 taxa.\n\n\f4\n\nHANNAH MARKWIG AND JOSEPHINE YU\n\n2\n1\n3\n\n4\n5\nProposition 2.1\nThe spaces TN and\n\u0001 M0,N can\n\u0001 be embedded as simplicial fans into real vector spaces\nof dimensions N2 and N2 − N respectively.\n\nFor a complete proof, see [8, theorem 4.2] or [3, theorem 3.4]. In fact, M0,N is a\n(N )\ntropical fan or a balanced fan, see [3, 8, 9]. These two fans are the fans G2,N ∩ R+2\n′′\nand G2,N\nrespectively in the tropical Grassmannian [8].\nAs an idea why proposition 2.1 is true, note that a phylogenetic tree is completely\ndetermined by the metric d it induces on the set [N ]: the distance dij between\ntwo elements i, j ∈ [N ] is the sum of the edge lengths along the unique path\nN\nbetween i and j in the tree. Hence TN can be embedded in R( 2 ) , and M0,N can\nN\nbe embedded in R( 2 ) modulo the N -dimensional vector space of star trees. The\nsimplicial complex of TN is a cone over the simplicial complex of M0,N .\nLet us now recall the embedding and the fan structure of TN . The rays of TN\ncorrespond to splits, partitions of [N ] into two non-empty parts. Removing an\nedge in a phylogenetic tree decomposes the tree into two connected components,\ninducing a split on the set of leaf labels. Two splits A|A′ and B|B ′ are compatible if\nat least one of A ∩ B, A ∩ B ′ , A′ ∩ B, and A′ ∩ B ′ is empty. A set of splits is pairwise\ncompatible if and only if there is a (unique) tree whose edges induce exactly those\nsplits [7, theorem 2.35]. We sometimes do not distinguish between a tree and its\ncorresponding set of splits. For a split A|B, we can write it as A | ([N ] \\ A) where\n[N ] := {1, . . . , N }, so we can respresent this split by just A. Edges of a tree are\nlabelled with their split or with the part A of the split not containing 1, which is\nalso called the edge label. A set S of splits generate a cone in TN if and only if the\nsplits in S are pairwise compatible. The singleton splits {i}|([N ]\\{i}), i ∈ N are\ncompatible with all other splits, so every maximal cone in TN contains the cone\ngenerated by those splits.\n2.2. The space M0,n (TPd−1 , 1) of n-marked tropical lines in TPd−1 . Now we\nwill review how the N -marked abstract tropical curves parametrize tropical lines.\nDefinition 2.2\nLet N = n + d. A (parametrized) n-marked tropical line in TPd−1 is a tuple\n(Γ, x1 , . . . , xN , h), where (Γ, x1 , . . . , xN ) is an abstract N -marked tropical curve\nand h : Γ → TPd−1 is a continuous map satisfying:\n\n\fTHE SPACE OF TROPICALLY COLLINEAR POINTS IS SHELLABLE\n\n5\n\n(a) On each edge of Γ the map h is of the form h(t) = a+t*v for some a ∈ Rr and\nv ∈ Zr . The integral vector v occurring in this equation if we parametrize\nE by an interval [0, l(E)] (starting at V ∈ ∂E) will be denoted v(E, V ) and\ncalled the direction of E at V . If E is an unbounded edge and V its only\nboundary point we will write for simplicity v(E) instead of v(E, V ).\n(b) For every vertex V of Γ we have the balancing condition\nX\n\nv(E, V ) = 0.\n\nE|V ∈∂E\n\n(c) v(xi ) = 0 for i = 1, . . . , n - i.e. each of the first n ends is contracted by h.\n(d) v(xi ) = ei−n for i > n - i.e. the remaining N − n ends are mapped to the\nd canonical directions of TPd−1 .\nWe will call the contracted ends the \"marked ends\" and the directed unbounded\nends the \"unmarked ends\". Note that this notion of markedness is different from\nthe marked ends of an abstract tropical curve. The space of all labeled n-marked\ntropical lines in TPd−1 will be denoted M0,n (TPd−1 , 1).\nRemark 2.3\nNote that this definition is a special case of definition 4.1 of [3]. As we are working\nwith lines, the unmarked ends are mapped to different directions. Hence they are\ndistinguishable by their direction and we do not need to label them as in [3]. In\nd\nd\nour case, there is no such difference between Mlab\n0,n (R , ∆) and M0,n (R , ∆) as\nmentioned in construction 4.3 of [3]. To keep notations simple, we will still label\nthe \"unmarked ends\" according to the following rule: the end with direction ei gets\nthe label n + i.\n\u0003\nThe following picture shows an example of an element of M0,2 (TP2 , 1). We will\nalways draw the marked (contracted) ends with a dotted line and the unmarked\n(directed) ends solid.\nTP2\n\n2\n\n1\n\n3\nl = 1.5\n\nh\n\nh(x1 )\n\nl=2\nh(x2 )\n\n4\n5\n\nNotice also that the image of a parametrized 0-marked tropical line is a tropical\nline as defined in the introduction. We only need to check that all direction vectors\nare primitive integral vectors. But this is true because all direction vectors are sums\nof different canonical vectors, v = ei1 + * * * + eir . This observation also shows that\nthe internal edges cannot be contracted, i.e. the direction vector v of an internal\nedge cannot be zero. Hence the space of tropical lines in TPd−1 is M0,0 (TPd−1 , 1).\n\n\f6\n\nHANNAH MARKWIG AND JOSEPHINE YU\n\nDefinition 2.4\nFor each i = 1, . . . , n define the i-th evaluation map evi by\nevi : M0,n (TPd−1 , 1) → TPd−1\n(Γ, x1 , . . . xN , h) 7−→ h(xi )\nThis is well-defined for the contracted ends since for them h(xi ) is a point in TPd−1 .\nThe product ev = ev1 × . . . × evn : M0,n (TPd−1 , 1) → (TPd−1 )n is called the\nevaluation map.\nOne can see easily that evaluation maps are linear on each cone of the fan\nM0,n (TPd−1 , 1) (see e.g. example 3.3 of [4]). In fact, it is even a tropical morphism\n(for more details, see [3]).\nLemma 2.5\nThe following are equivalent for a real d × n matrix M :\n(a)\n(b)\n(c)\n(d)\n(e)\n\nthe columns of M are tropically collinear in TPd−1 ,\nthe rows of M are tropically collinear in TPn−1 ,\nM has Kapranov rank at most 2,\nM has tropical rank at most 2,\nthe columns of M are in the image of the map\nev : M0,n (TPd−1 , 1) → (TPd−1 )n ,\n\n(f) the rows of M are in the image of the map\nev : M0,d (TPn−1 , 1) → (TPn−1 )d .\nProof:\nThe equivalence of (a),(b), and (c) is the definition of the Kapranov rank. The\nequivalence of (c) and (d) follows from [2, theorem 6.5]. If the columns of M are in\nthe image of ev that means that they are n distinguished points (h(x1 ), . . . , h(xn )) ∈\n(TPd−1 )n on a tropical line h(Γ). So obviously they are tropically collinear. Given n\ntropically collinear points (p1 , . . . , pn ), there is a tropical line L through the points.\nWe can find an abstract tropical curve Γ and a map h : Γ → TPd−1 parametrizing\nL. Then we attach new marked ends at the preimages of the pi and required those\nto be contracted by h. In this way, we construct a preimage of (p1 , . . . , pn ) under\nev. This proves the equivalence of (a) and (e). The equivalence of (b) and (f) can\nbe shown analogously.\n\u0003\nWe will now give a simplicial fan structure for M0,n (TPd−1 , 1). Define the\nforgetful map Ψ which forgets the map h as\nΨ : M0,n (TPd−1 , 1) → M0,n+d\n(Γ, x1 , . . . , xN , h) 7→ (Γ, x1 , . . . , xN ).\nThe following proposition that we cite from [3] determines a fan structure of\nM0,n (TPd−1 , 1), using the fact that M0,n+d is a simplicial fan by proposition 2.1.\n\n\fTHE SPACE OF TROPICALLY COLLINEAR POINTS IS SHELLABLE\n\n7\n\nProposition 2.6\nThe map\nev1 ×Ψ : M0,n (TPd−1 , 1) → TPd−1 × M0,n+d\n(Γ, x1 , . . . , xN , h) 7→ (ev1 (Γ, x1 , . . . , xN , h), Ψ(Γ, x1 , . . . , xN , h))\nis a bijection.\nFor a proof, see [3, proposition 4.7]. The idea why this is true is that we can\ndeduce the direction vectors of all edges from the direction vectors which are prescribed for the unmarked ends (see lemma 4.6 of [3]). Once the image h(V ) of one\nvertex is given - in our case we choose the vertex of the marked end x1 - the map\nh is completely determined by the direction vectors of all edges and their lengths,\nhence by the underlying abstract tropical curve.\n′\n2.3. The space Td,n\nas a subcomplex of M0,n+d . As a consequence of lemma\n2.5, we want to describe the space Td,n of n tropically collinear points as the image\nof M0,n (TPd−1 , 1) under ev.\n\nAs before, we let N = n + d, and think of a tree T with N leaves as an abstract\ntropical curve with n marked ends and d unmarked ends, where the unmarked end\nwith the label n + i gets the direction ei as in remark 2.3 above. For the ends,\nwe will sometimes call the property of being marked or unmarked (contracted or\ndirected) the \"color\" of the leaf.\nDefinition 2.7\nDefine a map π : TN → (TPd−1 )n as follows. First we define it for splits. Let\nS = A|B be a non-singleton split with 1 ∈ A. Let u ∈ Rd be the sum of ei such\nthat i + n ∈ B. Let π(S) be the d × n matrix whose j th -column is 0 if j ∈ A and\nu otherwise. For a singleton split S, we define π(S) = 0. We extend π linearly on\neach cone of Td,n .\nNote that π is 0 on the star tree because star tree contain only the singleton\nsplits.\nLemma 2.8\nThe following diagram is commutative:\nM0,n (TPd−1 , 1)\n\nev\n\n/ Td,n\n\nΨ\n\n\u000f\nM0,n+d\n\nπ\n\n\u000f\n′\n/ Td,n\n\nwhere the vertical arrow on the right is modding out by translation of the point\nconfiguration in TPd−1 .\nProof:\nWe only have to check that π maps a tree corresponding to a split S = A|B to a\ntuple in (TPd−1 )n−1 consisting of the positions of the images of the marked points\nrelative to h(x1 ). Since both π and ev are linear on a cone, the commutativity of the\ndiagram above follows. To see this, note that S = A|B corresponds to a tree with\n\n\f8\n\nHANNAH MARKWIG AND JOSEPHINE YU\n\nexactly one bounded edge of length 1 such that the ends marked by the numbers\nin A are on one side and the ends marked by B on the other. The following picture\nshows an example where n = 5, d = 3, A = {1, 3, 6, 7} and B = {2, 4, 5, 8}:\n3\nu\n\nTP2\n\n1\n7\n6\n\n5\n\nh\nh(x1 ) = h(x3 ) = 0\n\n4\n2\n\nh(x2 ) = h(x4 ) = h(x5 ) = u\n8\n\nLet us check the positions h(xi ) of the marked ends relative to h(x1 ). For all\ni ∈ A, i ≤ n (i.e. for all marked ends in A), h(xi ) = h(x1 ) so the relative evaluation\nis 0. Let u denote the direction vector of the bounded edge. By the balancing\ncondition it is equal to the sum of all ei such that i + n ∈ B. Each marked point\nxj with j ∈ B is mapped to h(xj ) = h(x1 ) + u. The relative position to h(x1 ) is\nthus u.\nThis is precisely the definition of π.\n\n\u0003\n\nAs a consequence of this lemma, we can think of π as a \"relative\" or \"reduced\"\nversion of the evaluation map ev. Because of lemma 2.5, we want to understand Td,n\nas the image of M0,n (TPd−1 , 1) under ev. But since we mod out by simultaneous\n′\ntranslations of all points in the definition of Td,n\n, we can do without the information\nev1 (Γ, x1 , . . . , xN , h) = h(x1 ) and consider the image of Tn+d under π instead. We\nwill make this more precise in lemma 2.10.\nDefinition 2.9\nLet Td,n be the subfan of TN consisting of trees whose non-singleton splits contain\nboth marked and unmarked elements on each side. We call such splits bicolored.\nThe subfan Td,n is an induced subcomplex of TN on the rays corresponding to\nthose bicolored splits.\nLet S = A|B be a split which is not bicolored. Let 1 ∈P\nA and assume first\nthat A or B contain only marked ends. Then the vector u = i:i+n∈B ei = 0 and\nπ(S) = 0. If B contains no marked ends, u is not necessarily 0, but no column is\nequal to u. Hence π(S) = 0 in this case, too. It follows immediatly that π is not\ninjective on a cone of TN if one of the generating rays corresponds to a non-bicolored\nsplit. In fact, the subfan Td,n generated by rays corresponding to bicolored splits\nis precisely the union of all closed maximal cones of M0,n on which the relative\nevaluation map π is injective. This is shown in the following lemma.\nLemma 2.10\nFor any configuration of collinear points p1 , . . . , pn ∈ TPd−1 , there is a unique\ncanonical tropical line through them with the property that if we attach a marked\nend at each point then we get a tree T ∈ TN with only bicolored splits. Moreover,\nπ(T ) = (p1 , . . . , pn ).\n\n\fTHE SPACE OF TROPICALLY COLLINEAR POINTS IS SHELLABLE\n\n9\n\nProof:\nThe canonical tropical line can be constructed as in [1, Section 3]. First take\nthe tropical convex hull of the marked points p1 , . . . , pn , which is the union of\ntropical line segments between pairs of points. This is a bounded one-dimensional\npolyhedral complex which is combinatorially a tree. Then there is a unique way to\nattach unbounded rays such that the balancing condition holds [1, Section 3].\nAn edge in a tropical line is called bounded if each end point is either one of the\nmarked points or a vertex of the polyhedral complex. We get a tree T with bicolored\nsplits after attaching marked ends at the marked points if and only if all bounded\nedges of the tropical line lie on a path between two marked points. In other words,\nthe union of bounded edges must be the tropical convex hull of p1 , . . . , pn . The\ncanonical line is unique with this property.\nThe phylogenetic tree T can be considered as an element of M0,N , and the canonical line is an embedding of T . Hence T with this embedding is an element of\nM0,n (TPd−1 , 1). By lemma 2.8, π(T ) = (p1 , . . . , pn ).\n\u0003\n\nCorollary 2.11\n′\nThe map π : Td,n → Td,n\nis an isomorphism of polyhedral fans, i.e. it is linear on\neach cone and is bijective.\nWe sum up the results of this section in the following proposition. We will use\n′\nit to define a shelling order of Td,n\nin the next section. Recall that a subcomplex\nis induced means that a cell is in the subcomplex if and only if all its vertices are.\nProposition 2.12\n′\nhas a triangulation that is isomorphic to the induced subcomplex of\nThe space Td,n\nthe space of phylogenetic trees Td+n on the vertices corresponding to bicolored splits,\ni.e. the splits containing both marked and unmarked leaves on each side.\n′\n3. Shelling of Td,n\n′\nIn this section we will prove that Td,n\nis shellable, in a similar way as in [10] where\nit was shown that the space of trees TN is shellable. We will use the description\n′\nas the induced subcomplex of TN on the vertices of bicolored splits (see\nof Td,n\nproposition 2.12 and definition 2.9).\n\nIn the following, we denote by x ∈ C a vertex of a facet C of a simplicial complex.\nDefinition 3.1\nA shelling is an ordering of the facets of a pure-dimensional simplicial complex such\nthat: For any two facets C ′ < C there exist C ′′ and x ∈ C such that\n(a) C ′′ < C,\n(b) x ∈\n/ C ′ and\n(c) C \\ x ⊂ C ′′ .\n\n\f10\n\nHANNAH MARKWIG AND JOSEPHINE YU\n\nIn [10] it is shown that these three conditions are equivalent to C ′ ∩ C ⊂ C ′′ ∩ C,\nC < C and C ′′ differs from C in only one element, C \\ C ′′ = {x}. The latter\nconditions are more common to define shellings.\n′′\n\nLet us now recall the shelling of TN given in [10]. First define an order on subsets\nof [N ] by:\nA < B :⇔ max((A \\ B) ∪ (B \\ A)) ∈ B.\nTo define the shelling order on the trivalent trees, we first \"split the trees along 1\":\n1\n\nM0\n\nM1\n\nThere is a unique partition of [N ] \\ {1} into two parts M0 , M1 such that the two\nsubtrees induced on the leaf-labels M0 and M1 are disjoint. Let M0 < M1 , i.e.\nN ∈ M1 . Let Ti be the subtree induced on {1} ∪ Mi .\nLet T, T ′ be two trivalent trees, {T0 , T1 }, {T0′ , T1′ } be the pairs of subtrees, and\n{M0 , M1 } and {M0′ , M1′ } be the corresponding pairs of leaf labels as above. Then\nthe order on the trees is defined recursively by:\n\n M1′ < M1 or\nM ′ = M1 and T1′ < T1 or\nT ′ < T ⇐⇒\n ′1\nT1 = T1\nand T0′ < T0\n\nWe can draw a tree respecting this order as in the figure above: then 1 is the\nroot of the tree, and the end vertex of 1 is adjacent to two subtrees (with labels M0\nresp. M1 ) that we order such that the bigger tree is on the right and the smaller\non the left. Inductively, we can continue this process. According to this drawing of\na tree, we will use the words \"child of a vertex V \" for a subtree that is below V .\nWe now come to the main result of the paper.\n\nTheorem 3.2 (Shelling of Td,n )\nThe complex Td,n is shellable. The shelling order on TN defined above restricts to\n′\na shelling order on Td,n\n.\nProof:\nSuppose T ′ < T . We have to find T ′′ ∈ Td,n , T ′′ < T such that T ′′ and T differ\nonly in one split x ∈\n/ T ′ . We use the identification of Td,n with the subcomplex\ninduced on bicolored splits as described in proposition 2.12.\nWithout loss of generality we may assume that M1′ < M1 , for if M1 = M1′ , then\nthere must be vertices V of T and V ′ of T ′ with the same leaf-labels below them\nsuch that the trees T and T ′ are equal above and to the right of V and V ′ , and the\nright child of V in T is bigger than the right child of V ′ in T ′ . Then the following\nargument works after replacing the end vertex of the marked end 1 with V or V ′\nand N with the largest label below V or V ′ .\n\n\fTHE SPACE OF TROPICALLY COLLINEAR POINTS IS SHELLABLE\n\n11\n\nNote that M1 must have at least two leaves, since otherwise, the unique leaf would\nbe labeled N , and there is no smaller M1′ that also contains N . Hence we can split\nM1 into two subsets L0 and L1 satisfying L0 < L1 , i.e. N ∈ L1 .\nLet us first consider the case when M0 contains at least two elements. Since the\nsplit M0 is bicolored, M0 contains both marked and unmarked leaves. In this case\nwe swap subtrees of T in the following way to obtain T ′′ .\n1\n\n1\n\nM0\n\nL1\n\nL1\nM0\n\nL0\n\nL0\n\nT ′′\n\nT\n\nWe replace the split M1 |{1}∪M0 = L0 ∪L1 |{1}∪M0 in T by the split L0 ∪M0 |{1}∪\nL1 to obtain a new tree T ′′ . The split {1} ∪ M0 |L0 ∪ L1 is not in the tree T ′ because\nM1′ < M1 . By our assumption we know that L0 ∪ M0 contains both marked and\nunmarked ends. As 1 is marked and N is unmarked and in L1 , {1} ∪ L1 contains\nboth marked and unmarked ends, too. As all other splits of T ′′ are splits of T , too,\nwe conclude T ′′ ∈ Td,n . Furthermore, T ′′ < T , because M1′′ = L1 < L0 ∪ L1 = M1 .\nNow let us consider the case when M0 contains exactly one element. Then T has\nthe form:\n1\n\nm0\nm1\nm2\n\nml\nK0\n\nK1\n\nwhere m0 > * * * > ml have the same color, and K0 either contains a leaf of different\ncolor or a single leaf ml+1 < ml of the same color. In the first case, we swap the\nsplit K0 ∪ K1 with K0 ∪ {ml }. In the latter case, we swap K0 ∪ K1 with K1 ∪ {ml }.\nThis new tree T ′′ is smaller than T . Note that l may be 0. However, we cannot\nhave the following configuration because there is no smaller tree T ′ < T that agrees\nwith T above and to the right of the vertex V :\n\n\f12\n\nHANNAH MARKWIG AND JOSEPHINE YU\n\n1\n\nV\nm0\nm1\nm2\n\nml\n\nN\n\nWe want to prove that T ′ cannot contain the edge label K0 ∪ K1 . Assume it\ndoes. As N ∈ K1 , K0 ∪ K1 ⊂ M1′ . Thus M0′ can only consist of a subset of\n{m0 , . . . , ml }. But as all mi have the same color, M0′ can contain at most one to\nbe a bicolored split. Thus M1′ = [N ] \\ {1, mi } for some i 6= 0. But as mi < m0 ,\nM1′ = [N ] \\ {1, mi } > [N ] \\ {1, m0 } which is a contradiction. Hence K0 ∪ K1 ∈\n/ T′\nand we choose x := K0 ∪ K1 .\n\u0003\nIn [1], it was shown that T3,n is shellable for all n and a shelling order called\n\"snake ordering\" is given. Our shelling order here is different from that.\n\n4. Homology of Td,n\nIn this section, we will use the shelling to compute the homology. We have to\n′\ncount those trees T ∈ Td,n\nwhich \"close a loop,\" i.e. for each x ∈ T there exists\n′\n′\n′\nT ∈ Td,n , T < T such that T \\ {x} ⊂ T ′ . In the proof of corollary 5 of [10], it was\nshown that a tree with an internal left edge does not satisfy this condition, so all\nleft edges must be leaves. These types of trees are called combs.\n1\n\nN\n\n\fTHE SPACE OF TROPICALLY COLLINEAR POINTS IS SHELLABLE\n\n13\n\nAny comb such that the neighbour of 1 is an unmarked end and the neighbour of\n′\nN is a marked end is in Td,n\n. However, not all of them contribute to the homology\nbecause the existence of a tree T ′ < T with T \\ {x} ⊂ T ′ does not guarantee that\n′\nT ′ ∈ Td,n\n.\nLet T be a 3-valent tree and V be an internal vertex, such that the two children\nof V are the end m0 and a bounded edge leading to a vertex W which has the end\nm1 as child. Assume m0 > m1 and m0 and m1 are either both marked ends or\nunmarked ends. Denote by T1 the subtree of T that can be reached by the parent\nof V and by T2 the subtree that can be reached from W via the second child.\n\nT1\n\nV\nW\n\nm0\nm1\n\nT2\n\nThere are two other trees that differ from T exactly at the split corresponding\nto edge {V, W }:\n\nT1\n\nT1\n\nm1\n\nm1\nm0\n\nT2\n\nm0\n\nT2\n\n′\nThe first tree is bigger than T and the second is not in Td,n\n, hence T does not close\n′\na loop and does not count toward the top homology of Td,n\n.\n\nThe combs which remain are those which satisfy: if a marked (unmarked) end\nml to the left is followed by a marked (unmarked) end ml+1 , then ml < ml+1 .\nWe have to show that for those combs we can find T ′ for each edge label x.\nThere are two cases: either x is an edge between two marked (unmarked) ends ml\nand ml+1 with ml < m1+1 , or ml is marked and m1+1 unmarked (respectively, the\nother way round). In the first case, we just swap ml and ml+1 .\n\n\f14\n\nHANNAH MARKWIG AND JOSEPHINE YU\n\n1\n\n1\n\nml\n\nml+1\nml+1\n\nml\nN\n\nN\nT\n\nT′\n\n′\nThe new tree T ′ is still in Td,n\n. It contains all edge labels of T besides the edge\nlabel x = {ml+1 , . . . , mn+d−1 , N }. Instead of x, it has the edge label\n\n{ml , ml+2 , . . . , mn+d−1 , N }.\nFurthermore, it is smaller than T , because at the vertex above x the right subtree\ncontains ml+1 which is bigger than ml .\nIn the second case, we bring ml and ml+1 together to one vertex:\n1\n\n1\n\nV′\n\nV\nml\nml\nml+1\n\nml+1\n\nN\n\nN\nT\n\nT′\n\nThe edge label x = {ml+1 , . . . , mn+d−2 , N } is replaced by {ml , ml+1 }. All other\n′\nedge labels remain. Of course, T ′ ∈ Td,n\n. Also, T ′ < T , because the right child\n′\nof the vertex V is smaller than the right child of the vertex V , and above those\nvertices, the trees coincide.\nAltogether, this proves the following theorem:\n′′\nTheorem 4.1 (Homology of Td,n\n)\n′′\nh\nThe top homology of Td,n is Z , where h is equal to the number of combs starting\nwith 1 and ending with N , the neighbour of 1 an unmarked end, the neighbour of N\n\n\fTHE SPACE OF TROPICALLY COLLINEAR POINTS IS SHELLABLE\n\n15\n\na marked end, two consecutive ends either have different colors or have the same\ncolor with increasing labels.\nCorollary 4.2\n′′\nThe rank of the top homology of Td,n\nis\nmin(n−1,d−1)\n\nX\n\nk=1\n\n\n! k\n\u0012 \u0013\n\u0012 \u0013\nX\nk\nk\n(−1)k−i\nin−1  (−1)k−j\nj d−1  .\ni\nj\ni=1\nj=1\n\nk\nX\n\nProof:\nIt follows from the previous lemma that the rank of the top homology is the number\nof ways to simultaneously partition an n − 1-element set and a d − 1-element set\ninto the same number of nonempty ordered parts. The number of partitions of an\nm-element set into exactly k nonempty ordered part is\n\u0012 \u0013\nk\nX\nk−i k\nim\n(−1)\nk! * S(m, k) =\ni\ni=1\nwhere S(m, k) are the Stirling numbers of the second kind.\n\n\u0003\n\n′′\n′′\n′′\nThe computations in [1] for the top homology of T3,n\n, T4,4\n, and T4,5\n, which are\n2 − 3, 73, and 301 respectively, agree with our formula.\nn\n\nReferences\n[1] Mike Develin. The moduli space of n tropically collinear points in Rd . Collectanea Mathematica, 56:1–19, 2005.\n[2] Mike Develin, Francisco Santos, and Bernd Sturmfels. On the rank of a tropical matrix. In\nCombinatorial and computational geometry, volume 52 of Math. Sci. Res. Inst. Publ., pages\n213–242. Cambridge Univ. Press, Cambridge, 2005.\n[3] Andreas Gathmann, Michael Kerber, and Hannah Markwig. Tropical fans and the moduli space of rational tropical curves. Compositio Mathematica (to appear). Preprint,\nmath.AG/0708.2268.\n[4] Andreas Gathmann and Hannah Markwig. Kontsevich's formula and the WDVV equations in\ntropical geometry. Advances in Mathematics (to appear). Preprint, math.AG/0509628, 2005.\n[5] Paul Hacking. The homology of tropical varieties. Preprint (2007).\n[6] Grigory Mikhalkin. Moduli spaces of rational tropical curves. math.AG/0704.0839, 2007.\n[7] Lior Pachter and Bernd Sturmfels, editors. Algebraic Statistics for Computational Biology.\nCambridge University Press, 2005.\n[8] David Speyer and Bernd Sturmfels. The tropical Grassmannian. Adv. Geom., 4:389–411, 2004.\n[9] Bernd Sturmfels and Jenia Tevelev. Elimination theory for tropical varieties.\nmath.AG/0704.3471, 2007.\n[10] Henryk Trappmann and Günter M. Ziegler. Shellability of complexes of trees. Journal of\nCombinatorial Theory, Series A, 82:168–178, 1998.\nUniversity of Michigan, Department of Mathematics, 2074 East Hall, 530 Church\nStreet, Ann Arbor, MI 48109-1043\nE-mail address: markwig@umich.edu\nMassachusetts Institute of Technology, Department of Mathematics, Cambridge,\nMA 02139-4307\nE-mail address: jyu@math.mit.edu\n\n\f"}