{"id": "http://arxiv.org/abs/1105.4918v2", "guidislink": true, "updated": "2013-08-21T06:41:45Z", "updated_parsed": [2013, 8, 21, 6, 41, 45, 2, 233, 0], "published": "2011-05-25T01:21:02Z", "published_parsed": [2011, 5, 25, 1, 21, 2, 2, 145, 0], "title": "Dynamics of the Budyko Energy Balance Model", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1105.0378%2C1105.0494%2C1105.3831%2C1105.4897%2C1105.6336%2C1105.5119%2C1105.1584%2C1105.5869%2C1105.0021%2C1105.5312%2C1105.0237%2C1105.0770%2C1105.3618%2C1105.4615%2C1105.1546%2C1105.5714%2C1105.2379%2C1105.6157%2C1105.2692%2C1105.5712%2C1105.3452%2C1105.1862%2C1105.2532%2C1105.2018%2C1105.0582%2C1105.1184%2C1105.3656%2C1105.3055%2C1105.4580%2C1105.6255%2C1105.2933%2C1105.4918%2C1105.3410%2C1105.5741%2C1105.5449%2C1105.3467%2C1105.4046%2C1105.2736%2C1105.5026%2C1105.3574%2C1105.6304%2C1105.5122%2C1105.1332%2C1105.4344%2C1105.2939%2C1105.1521%2C1105.5307%2C1105.0066%2C1105.1244%2C1105.6272%2C1105.3519%2C1105.1855%2C1105.5177%2C1105.0765%2C1105.4471%2C1105.1273%2C1105.1587%2C1105.0846%2C1105.3958%2C1105.3239%2C1105.0722%2C1105.3830%2C1105.0408%2C1105.3144%2C1105.2306%2C1105.0149%2C1105.4512%2C1105.0792%2C1105.0432%2C1105.4907%2C1105.1246%2C1105.2474%2C1105.2803%2C1105.1109%2C1105.1946%2C1105.6356%2C1105.2520%2C1105.3635%2C1105.1376%2C1105.2511%2C1105.6132%2C1105.2901%2C1105.5235%2C1105.3679%2C1105.0742%2C1105.6297%2C1105.2329%2C1105.5634%2C1105.4606%2C1105.1750%2C1105.5614%2C1105.1894%2C1105.3940%2C1105.3578%2C1105.5066%2C1105.2913%2C1105.0300%2C1105.6117%2C1105.5325%2C1105.4472%2C1105.0080&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Dynamics of the Budyko Energy Balance Model"}, "summary": "A dynamical system derived from a conceptual climate model is investigated.\nThe model is often referred to as Budyko-Sellers type Energy Balance Model\n(EBM), or in short, the Budyko model. The focus of this study is on the\nmathematical formulation that further develops the model by capturing the ice\nline dynamics, and thereby places the Budyko model in dynamical systems\nframework. The classical Budyko EBM is represented here as an\nintegro-difference equation, then coupled with an ice line equation. The\nresulting infinite dimensional system is shown to possess an attracting one\ndimensional invariant manifold. The novel formulation captures solutions that\nothers have previously obtained while also making the formulation and the\nanalysis of the model more precise.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1105.0378%2C1105.0494%2C1105.3831%2C1105.4897%2C1105.6336%2C1105.5119%2C1105.1584%2C1105.5869%2C1105.0021%2C1105.5312%2C1105.0237%2C1105.0770%2C1105.3618%2C1105.4615%2C1105.1546%2C1105.5714%2C1105.2379%2C1105.6157%2C1105.2692%2C1105.5712%2C1105.3452%2C1105.1862%2C1105.2532%2C1105.2018%2C1105.0582%2C1105.1184%2C1105.3656%2C1105.3055%2C1105.4580%2C1105.6255%2C1105.2933%2C1105.4918%2C1105.3410%2C1105.5741%2C1105.5449%2C1105.3467%2C1105.4046%2C1105.2736%2C1105.5026%2C1105.3574%2C1105.6304%2C1105.5122%2C1105.1332%2C1105.4344%2C1105.2939%2C1105.1521%2C1105.5307%2C1105.0066%2C1105.1244%2C1105.6272%2C1105.3519%2C1105.1855%2C1105.5177%2C1105.0765%2C1105.4471%2C1105.1273%2C1105.1587%2C1105.0846%2C1105.3958%2C1105.3239%2C1105.0722%2C1105.3830%2C1105.0408%2C1105.3144%2C1105.2306%2C1105.0149%2C1105.4512%2C1105.0792%2C1105.0432%2C1105.4907%2C1105.1246%2C1105.2474%2C1105.2803%2C1105.1109%2C1105.1946%2C1105.6356%2C1105.2520%2C1105.3635%2C1105.1376%2C1105.2511%2C1105.6132%2C1105.2901%2C1105.5235%2C1105.3679%2C1105.0742%2C1105.6297%2C1105.2329%2C1105.5634%2C1105.4606%2C1105.1750%2C1105.5614%2C1105.1894%2C1105.3940%2C1105.3578%2C1105.5066%2C1105.2913%2C1105.0300%2C1105.6117%2C1105.5325%2C1105.4472%2C1105.0080&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "A dynamical system derived from a conceptual climate model is investigated.\nThe model is often referred to as Budyko-Sellers type Energy Balance Model\n(EBM), or in short, the Budyko model. The focus of this study is on the\nmathematical formulation that further develops the model by capturing the ice\nline dynamics, and thereby places the Budyko model in dynamical systems\nframework. The classical Budyko EBM is represented here as an\nintegro-difference equation, then coupled with an ice line equation. The\nresulting infinite dimensional system is shown to possess an attracting one\ndimensional invariant manifold. The novel formulation captures solutions that\nothers have previously obtained while also making the formulation and the\nanalysis of the model more precise."}, "authors": ["Esther R. Widiasih"], "author_detail": {"name": "Esther R. Widiasih"}, "author": "Esther R. Widiasih", "arxiv_comment": "18 pages, 5 figures", "links": [{"href": "http://arxiv.org/abs/1105.4918v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1105.4918v2", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "math.DS", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "math.DS", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1105.4918v2", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1105.4918v2", "journal_reference": null, "doi": null, "fulltext": "1\n\nDYNAMICS OF THE BUDYKO ENERGY BALANCE MODEL\n\narXiv:1105.4918v2 [math.DS] 21 Aug 2013\n\nESTHER R. WIDIASIH\nAbstract. A dynamical system derived from a conceptual climate model is investigated. The model is often\nreferred to as Budyko-Sellers type Energy Balance Model, or in short, the Budyko model. The focus of this study is\non the mathematical formulation that further develops the model by capturing the ice line dynamics, and thereby\nplaces the Budyko model in dynamical systems framework. The classical Budyko EBM is represented here as an\nintegro-difference equation, then coupled with an ice line equation. The resulting infinite dimensional system is\nshown to possess an attracting one dimensional invariant manifold. The novel formulation captures solutions that\nothers have previously obtained while also making the formulation and the analysis of the model more precise.\n\n1. Introduction. We investigate a dynamical system derived from a conceptual climate\nmodel. The model is a version of what is known in climate science as the Budyko Sellers type\nEnergy Balance Model (EBM). The result of this study is purely mathematical with the main focus\non the mathematical formulation that further develops the model and places it in the framework of\ndynamical systems. In particular, we represent the classical Budyko model as an integro-difference\nequation, then couple it with an auxilliary equation that prescribes the ice line dynamics. We\nanalyze the stability of the coupled system and we prove that, under certain conditions, the infinite\ndimensional system has a one dimensional attracting invariant manifold.\nBudyko-Sellers type EBMs model the annual average temperature distribution, and rest on\nthe idea that the energy received is balanced by the energy emitted by the planet. Any imbalance in the system will result in a temperature change. The state variable of a Budyko EBM is\na latitudinally averaged temperature distribution, often referred to as a temperature profile. One\nfeedback admitted by a Budyko-Sellers type model is the ice albedo feedback, which is a positive\nfeedback caused by the contrast between the reflectivity of ice cover and ocean. Much effort has\nbeen devoted to the steady state analysis of differential equations based on the two conceptual\nmodels pioneered independently by Mikhail Budyko [3] and William Sellers [22] in late sixties eg.\n[5, 17, 23, 9]. Here, we are concerned with the formulation of the model in order to clarify the role\nof the ice albedo feedback and make precise the dynamics of both the transient and the steady states.\nGeologic evidence shows that the northern ice cap had in the past advanced to near tropical\nregions [14]. In the more recent past, during the last ice age around 12,000 years ago, 2 mile thick\nglaciers advanced as far as Illinois and Wisconsin [11]. Our planet has also experienced warmer\nclimates with both poles having small to no ice cap. The movement of the ice extent or ice cap\nboundary as a transient response of the climate motivates our study in this work. Indeed, the\nsolar variations of the past few million years are too small to account for the large fluctuations in\nclimate such as glaciation/ interglaciation events. Therefore, climate feedbacks, like those due to\ngreenhouse gases and ice albedo feedback, provide explanations for these major changes and understanding the transient climate response to the feedbacks is of central concern in climate science.\nAt the heart of the Budyko model is the ice albedo feedback. The reflectivity contrast between\na dark blue ocean and a shiny white ice covered surface causes a positive feedback in a climate\nsystem. One may imagine an aquaplanet consisting only of water and ice. A warming climate in\nthis planet causes ice to melt, hence the retreat of an ice cap, which causes an increase exposure of\nthe ocean surface, more energy absorption, and thus a warmer climate. A similar positive feedback\n∗ The author was supported in part by a grant to the University of Arizona from HHMI (52006942).\nThe research described here has been supported by NSF grant DMS-0940363.\n\n1\n\n\falso works in the opposite direction: a cooler climate causes a favorable condition for ice to grow,\nhence the advance of an ice cap, which causes more energy reflected to space, and thus a cooler\nclimate. In such a system, one wonders if extreme states (ie. a completely ice free or a completely\nice covered state) are the only equilibria of the system. A Budyko-Sellers type model is a simple\nclimate model that attempts to answer this question based on the energy balance principle. Here,\nwe focus on an EBM similar to the one introduced by Budyko.\nThe goal of this paper is to further develop the Budyko EBM with the ice albedo feedback\nto place it within a dynamical system framework. Therefore, we focus on the treatment of the\ntransient dynamics of the ice cap boundary location or what we call here the ice line. We obtain an\nequation dictating the ice line movement by exploiting the ice line condition prevalent in current\nliterature. This condition is: when the system is at equilibrium, the annual average temperature\nat the ice line location must be the prescribed critical temperature. The conventional approach,\nwhich only considers Budyko's EBM for the temperature profile without a coupling to an ice line\ndynamics, first finds the equilibrium of the temperature profile, and thereby implicitly assumes that\nsuch equilibrium exists and is attracting in some function space. It then selects an ice line location\nusing some prescribed conditions, and finally, performs the stability analysis on the selected ice\nlines relative to some parameter changes. In contrast to the established approach, in our formulation we first introduce an ice line equation to be coupled to the Budyko EBM equation of the\ntemperature profile, then show the existence of an attracting one dimensional invariant manifold\nfor the coupled system. The ice line dynamics, ie. the advance and retreat of the ice cap, then takes\nplace on this one dimensional invariant manifold, and in this way, the novel formulation reframes\nthe ice line selection mechanism in the context of stability. The bifurcation analysis as parameters\nvary is treated once the stability of the equilibrium states is established.\nThe paper is organized as follows. Section 2 treats the background of the Budyko Energy\nBalance Model, and discusses the equilibrium solutions and introduces the novel formulation as\nthe Budyko equation is coupled with an ice line equation to form a fast-slow system. Section 3\nstates and proves the results: the existence of a one dimensional attracting invariant manifold and\nthe stability analysis. Section 4 presents some bifurcation diagrams and animations that illustrate\nthe transient dynamics of the fast slow system and some discussions about the simulation. Section\n5 concludes the article and discusses some future direction.\n2. Background.\n2.1. Budyko's Original Concept. The energy balance at a given latitude on the planet depends on three main aspects of the climate: the incoming solar radiation (insolation), the planet's\noutgoing radiation and the heat transported to and from that latitude. Budyko's original paper [3]\nhas the following two main relationships on these three aspects of the climate:\n1. The equation of the heat balance of the Earth-atmosphere system for mean annual condition\ngain or loss of heat = Q(1 − α) − I\n= Q(1 − α) − (A + BT )\n\n(2.1)\n(2.2)\n\nwhere the gain or loss of heat comes \"as a result of atmosphere and hydrosphere circulation,\nincluding heat redistribution of phase water formations \"(from p. 613 of [3], note that our\nnotations are slightly different from Budyko's original article). Here,\n2\n\n\fI = A + BT is the outgoing radiation (at a given latitude)\nT is the annual mean temperature at a given latitude, called the\ntemperature profile\nQ is the solar radiation coming to the outer boundary of the atmosphere\nα is the albedo of the surface.\n2. The horizontal heat transfer distribution\ngain or loss of heat = C(T − T ).\nHere,\n\n(2.3)\n\nT is the globally-averaged annual mean temperature\nC is a proportionality constant.\n\n3. When the system is in balance, there is no gain or loss of energy (heat) at each latitude\nand the following equation holds:\n0 = Q(1 − α) − I − C(T − T ).\n\n(2.4)\n\nA similar concept was proposed using a different formulation by William Seller around the\nsame time [22]. Based on this fundamental relationship and by treating the temperature profile as\na static system, Budyko calculated and analyzed the effect of exogenous changes in solar forcing\n(due to variations in Earth's orbital elements) and atmospheric transparency (due to volcanic dust).\nIn a more recent work, Tung [25] established the modern parametrizations of the Budyko model\nand included a nice exposition of the model. In the most recent work McGehee and Lehman [15]\ncombined a Budyko's model version formulated in [25] with Earth's orbital elements and compared\nit with the climate data.\nThe state variable of the Budyko model (2.4) is the temperature profile. Each temperature\nprofile is therefore a function in some infinite dimensional space. To determine the ice line, the conventional approach first finds the steady state temperature profile, then uses a selection mechanism\nspecifying a critical temperature to determine the ice line location (see eg. [25, 24]). The latter\narticle proceeded further by introducing an ice line condition based on the ice-water boundary\ntemperature, without explicitly stating the equation that governs the dynamics of the location of\nthis ice-water boundary.\nMany authors have treated the fundamental relationship (2.4) as the equilibrium of some dynamical system while varying the parameters of the model. Using this approach, the works by\nNorth, et al in [5, 17, 23, 9] studied the stability of a similar system with a diffusive transport,\nwhile the work by Hsieh and Su in [24] studied the stability by including a time variation of the ice\nboundary. The stability analyses done by these authors were based on the perturbation of some\nparameters near the equilibrium temperature profile, and the reader will find a more detailed discussion about this in Section 2.3. However, most authors have not suggested a particular function\nspace for the temperature profile. Furthermore, since most authors placed more emphasis on the\napplication and the parametrization of the model, none suggested an explicit description of the ice\nline transient dynamic as a response to temperature changes. In order to have a complete and a\nclear picture of the ice albedo feedback concept and to analyze the stability of the system, we argue\nthat it is necessary to address both the issues of the function space and the ice line dynamics. Once\ncomplimented with an appropriate function space and the ice line dynamics, the Budyko model\ncan be treated as a mathematical object, and in particular, as a dynamical system for which a\nrigorous stability analysis can be developed.\n3\n\n\fIn the following subsections, we will lay out the description of each aspect of this dynamical\nsystem. The discussion will address:\n1. Budyko's EBM as a difference equation\n(a) The state variable T\n(b) The solar forcing distribution\n(c) The outgoing solar radiation\n(d) The transport term\n(e) The temperature profile equilibrium solutions\n2. The Ice line equation\n2.2. Budyko's EBM as a Difference Equation. Following Budyko [3], the change in the\nannual average temperature in zone y from year n to year n + 1 is:\n\n∆T = f (T, η) :=\n\n1\nR\n\n\u0012\n\n\u0012\nZ\nQs(y)(1 − α(η, y)) − (A + BT (n, y)) − C T (n, y) −\n\n1\n\n\u0013\u0013\nT (n, y)dy\n\n0\n\n(2.5)\nwith ∆T = T (n + 1, y) − T (n, y).\nIn what follows, we describe each term of equation (2.5).\n2.2.1. The state variable T . As explained by North in [17], the latitude θ is more effectively\nrepresented by the location y, where\ny = sin(θ).\nIn this representation, the infinitesimal band\ndy = cos(θ)dθ\nis proportional to the area of the latitudinal strip parallel to y. Here, we assume the symmetry of\nthe planet, and so 0 ≤ θ ≤ 90o or 0 ≤ y ≤ 1.\nThe state variable T in Budyko's EBM is the average temperature profile during year n. The\ntemperature profile T (y) is measured in Celsius and is a function of the independent variable y.\nThus,\nT = T (n, y)\nis the surface temperature during year n at latitude arcsin(y) averaged over the entire year and\naveraged over all longitudes. The constant R is the heat capacity of the surface of the planet.\nWe remark here that in his 1969 paper [3], Budyko formulated the change in the temperature\nprofile T (y) in yearly increments. All other quantities, eg. Q, s(y), α(η, y), etc. in the equation\n(2.5) are also yearly averages, having small variations from year to year. Other authors, eg. [17, 18,\n19, 24, 9] have treated a similar model in the continuous time framework, where the state variable\nis T (t, y) which depends on the continuous time variable t ∈ R. In the continuous time framework,\nthe Budyko equation (2.5) may be written as a differential equation\n\u0012\n\u0012\n\u0013\u0013\nZ 1\n∂T\n1\n=\nQs(y)(1 − α(η, y)) − (A + BT (t, y)) − C T (t, y) −\nT (t, y)dy\n∂t\nR\n0\n4\n\n\fThe reader may observe that both the discrete and the continuous formulations of the Budyko\nmodel are both approximations of Earth's climate. Furthermore, in both frameworks, the systems\nwill retain the same key features eg. the same equilibrium solution, bifurcation diagrams, etc.\nTherefore, it stands to reason that similar arguments for the stability analysis apply and that the\nmain result of this article would also hold in the continuous time framework.\n2.2.2. Incoming energy Qs(y)(1 − α(η, y)). The constant Q is the solar constant, representing the amount of energy received from the sun at the top of the atmosphere. The function\ns(y) is the latitudinal distribution of that energy which can be computed from earth's orbital elements. Many authors, such as Tung [25], and North [17] used the Legendre polynomial function\napproximation\ns(y) = 1 − 0.482\n\n3y 2 − 1\n2\n\nfor this distribution. We will use the same approximation as well.\nThe fraction of the radiative energy absorbed by the planet at y given that the ice line is at η\nis represented by the factor\n1 − α(η, y).\nWe will often write α(η, y) as α(η)(y) to emphasize the fact that for each η, α(η)(y) is a real valued\nfunction over the y−interval.\nHere, it is assumed that the surface is either water (ice free) or ice covered and that there is\nonly one ice line, η. Since ice reflects more sunlight than ocean does, the surface covered with ice\nhas higher albedo than that covered with ocean. The albedo function α(η, y) we use in this paper\nis smooth and is ice line dependent.\nDefinition 2.1. Smooth, Ice line-Dependent Albedo\nGiven that the ice line is at η, the albedo at y is\nα(η, y) =\n\nα2 − α1\nα1 + α2\n+\n* tanh[M * (y − η)]\n2\n2\n\nwhere α1 = the ocean or water albedo and\n\nα2 = the ice albedo.\n\nThe parameter M represents the steepness of the albedo function near the ice line and is a fixed\nquantity. The albedo at the ice line is always the average of the ice and water or ocean albedos.\nEquatorward of the ice line, the albedo is approximately the ocean albedo while poleward it is\nthe ice albedo. Notice that both α1 and α2 are fractions of energy reflected, hence dimensionless.\nSince the reflectivity of ice is higher, the value of α2 is larger than α1 . A similar smooth albedo\nformulation is used in [8], while a piecewise function is used by others, eg. Tung [25]. In the spirit\nof the piecewise albedo function used in the latter work, we chose M \u001d 1.\n2.2.3. Outgoing longwave radiation. The absorbed radiative energy contained in the first\nterm of the left hand side of equation (2.5) is balanced by the re-emission or re-radiation term and\nthe transport term. The re-emission term at y is\n− (A + BT (y))\n5\n\n\fwhich is an approximation of both the Stephan-Boltzman's law of black body radiation and the\ngreenhouse gas effect on the atmosphere. An alternative parametrization, based on the work by\nGraves and North [7], was used by Tung in the Budyko model formulation in [25], where the\nconstants A and B were derived from fitting a linear function through satelite data of Outgoing\nLongwave Radiation (OLR) at the top of the atmosphere.\n2.2.4. Transport. The energy transport is represented by the term,\n\u0012\n\u0013\nZ 1\nC * T (y) −\nT (y)dy .\n\n(2.6)\n\n0\n\nThe constant C in the transport term is traditionally chosen so that one of the equilibria fits the\ncurrent climate with an ice line near the pole. The transport term presented here, which Engler\nand Kaper refered to as the heat transfer [12], is an alternative the diffusion transport. In [19],\nNorth studied the Budyko model with diffusion transport term, and specified a boundary condition\nthat no heat flux shall pass through the equator and the pole. Observe that the diffusive transport\nis inherently a local process which explicitly specifies the heat transport process in a neighborhood\nof each zone y, hence the boundary condition at the equator and the pole. In contrast, the transfer\ntransport (2.6) is a global process that does not necessitate a special treatment of the heat flux at\nthe boundaries, ie. the equator, for y = 0 or pole y = 1.\n2.3. The temperature profile equilibrium solutions. The equilibrium solution of equation (2.5) can be solved by fixing η. For a fixed η, one first integrates both sides of the equation\nf (T, η) = 0 in equation (2.5) with respect to y over the unit interval, then solves for the functional\nR1\n∗\n∗\nT (η) := 0 T ∗ (η)(y)dy. After reinserting the η-dependent expression for T (η) in the equation\n∗\nf (T, η) = 0, one then solves for T (η). We obtain\n∗\n\nT (η) =\n\nQα(η) − A\nB\n\n(2.7)\n\nR1\nwhere α(η) = 0 s(y)(1−α(η)(y))dy. Explicitly, the equilibrium temperature profile of equation\n(2.5), with parameters as in table 4.1 is:\nT ∗ (η)(y) =\n\nQ * s(y) * (1 − α(η)(y)) − A +\nB+C\n\nC\nB\n\n(Qα(η) − A)\n\n(2.8)\n\nThe figures on the bottom row of Figure (4.3) are three examples of local temperature profiles for\nη = 0.1, 0.5, 1, when y is restricted to the unit interval.\nA selection mechanism of the ice line prevalent in the literature is the the following: for an\nice line location η to be an ice line equilibrium, the temperature at that location must reach the\ncritical temperature, Tc . Therefore, the ice line equilibria is the solution of the equation\nT ∗ (η)(η) = Tc .\n\n(2.9)\n\nUsing the parameters in [25], one easily checks that there are two ice lines that satisfies equation\n(2.9), η1 ∼\n= 0.2, and, η2 ∼\n= 0.95. It is customary to call the equilibrium η1 the big ice cap and η2\nthe small ice cap. The first equilibrium will be shown to be a saddle, while the second is a sink.\nIn additional, the two physically attainable state that we must consider are snowball η = 0 and\nice free η = 1.\n6\n\n\fOne may notice that a curve of a parameter, say Q, as a function of the ice line η, can be\nobtained from the ice line selection mechanism, equation (2.9). Using intuitive arguments, Budyko\ndQ\nin 1972 argued that the branch where dQ\ndη > 0 is stable while the branch where dη > 0 is unstable\n[4, 9, 25]. Held and Suarez extended this intuitive argument with a stability analysis based on a\n∗\nlinear perturbation on the T . (See details on p. 615-616 in [9]). Notice that these stability analyses operates in a one dimensional space despite the fact that the temperature profile in the Budyko\nmodel is a function over the unit interval, hence, an infinite dimensional object. Such result points\nto the existence of a one dimensional attracting invariant manifold. In what follows, we expand on\nthe work previously done by specifiying a function space for the temperature profile and introduce\nan ice line equation, thereby providing a context for which a one dimensional attracting invariant\nmanifold exists under the conditions set by the Budyko model and the ice line selection mechanism.\n\n2.4. The Ice line Equation. The equation for the ice line movement must reflect the following:\n1. Poleward or equatorward ice line movement when the ice line\nis, respectively, too hot or too cold with respect to a reference\ncritical temperature.\n2. The ice line moves at a much slower speed than the atmospheric temperature reflecting the rate at which glaciers advance\nor retreat.\n3. When the ice line equation is coupled with equation (2.5),\nthe resulting equilibria must be consistent with the conventional\napproach.\nWe propose the following equation to account for the one year zonal change of the ice line η:\n∆η = g(T, η) := \u000f(T (η) − Tc )\n\n(2.10)\n\nwith ∆η = η(n + 1) − η(n), Tc a reference critical temperature, and \u000f \u001c 1.\nThat is, the ice line moves at a (much slower) rate proportional to the difference between the\nice line temperature and the reference critical temperature. Some authors used Tc = −10 for a\nmodern day parametrization, eg. [25].\nAssuming a certain thickness of ice, the value of \u000f can be computed to be in the order of\n10−5 (/o C year) (see [16]). Here, the value of \u000f = 0.01 is used to create the dynamic version of\nthe simulation in Figure 4.4. This value is chosen so that the animation run time is reasonably short.\nAlthough all of the aforementioned authors in the previous studies indicate a critical temperature at the ice line, none had mentioned the ice line equation explicitly as written in equation\n(2.10). Some authors indicate an ice line rate of change as byproducts of the stability analysis as\ndxs\n0\nindicated in the discussion in subsection 2.3, eg dθ\ndt in the Appendix A of [9] and dt on page 2274\nof [24], however, an explicit formulation of the ice line transient dynamics has been absent.\n\n3. Statements and Proofs of the Main Result and its Corollaries.\n7\n\n\f3.1. The Main Result. The object of our analysis is the following fast-slow system of integrodifference equations consists of the equations from (2.5) and (2.10):\n\u0014\n\u0012\n\u0013\u0015\nZ 1\n1\n∆T = f (T, η) :=\nQs(y)(1 − α(η, y)) − (A + BT ) − C T −\nT dy\n(3.1)\nR\n0\n∆η = g(T, η) := \u000f(T (η) − Tc )\nwhere η, y ∈ [0, 1].\nThe following definition defines the map based on system (3.1):\nDefinition 3.1. The Budyko Map\nThe Budyko map m\nb is the map associated with system (3.1)\nm([T,\nb\nη]) = [T + f ([T, η]), η + g([T, η])] .\nDenote by m\nb k the k − th iteration of the map m.\nb\nObserve that if system (3.2) were formulated instead as a differential equation, the Budyko map\nwould be the forward Euler approximation with time step one year.\nSome conditions on the Budyko model's parameters are necessary to show the main result. We\ncollect the conditions in the following definition:\nDefinition 3.2. The Budyko Parameters Condition\nWe say that the system (3.1) satisfies the Budyko parameters condition if:\n1. The parameters Q, A, B, C, R, M are all positive,\nwith Q \u001d B, A \u001d B, Q \u001d C, A \u001d C and M \u001d 1.\n2. 0 < 1 −\n\n1\nR (B\n\n+ C) < 1, or similarly, 0 <\n\n1\nR (B\n\n+ C) < 1 .\n\nThese conditions are physically reasonable and are consistent with the parameters used by other\nauthors, eg. [25]. The second condition, in particular, is necessary to show the existence of an\ninvariant manifold.\nWe now discuss the function space of the temperature profile. It is not unreasonable to demand\neach temperature profile to be bounded, since physically, planetary temperature is always bounded.\nDenote by BI the space of the continuous function over the unit interval I = [0, 1] with the\nsup norm. The phase space for the temperature profile and ice line we will consider is BI × I, with\nthe norm on the product space k * kBI ×I = max {k * kBI , | * |}. The main result of this paper is the\nfollowing theorem:\nTheorem 3.3. Main result Suppose that η, y ∈ I = [0, 1] and the system (3.1) satisfies the\nBudyko parameter condition. Then for all \u000f sufficiently small:\n1. Attractivity. Under the Budyko map m,\nb there exists a one dimensional locally exponentially attracting Lipschitz continuous manifold with boundary\nMI := {[φ∗ (η)(y), η] : η, y ∈ I} ⊂ BI × I\n2. Invariant alternatives. The action of the Budyko map on MI is either one of the following:\n8\n\n\f(a) m([φ\nb ∗ (η)(y), η]) = [φ∗ (ξ)(y), ξ] , with ξ ∈ [0, 1]\nOR\n(b) m([φ\nb ∗ (η)(y), η]) = [T (y), ξ], T ∈ BI and ξ ∈\n/ [0, 1]\nThe following two corollaries are pertinent to the physical interpretation of the model.\nCorollary 3.4. The invariant manifold MI is within O(\u000f) of the critical set\nTI∗ := {[T ∗ (η)(y), η] : η, y ∈ I = [0, 1]}\nwith T ∗ (η)(y) as defined in (2.8).\nCorollary 3.5. With the parameters as in the table (4.1), the ice free Earth and the big ice\ncap are unstable while the small ice cap and the snowball earth are stable.\nProof.\nIn order to simplify the analysis of the ice line dynamics at the end points, that is for η = 0\nand η = 1, we embed the ice line interval and the domain of the temperature profile in the real\nline. We will also embed the right hand side of (3.1) in such a way that preserves the dynamics\ninside the closed unit interval, then show that a similar result holds in the embedded space. The\nreader will observe that this embedding is a mathematical convenience to show the existence of\nan invariant manifold and to allow the dynamical analysis of the polar and the equatorial ice line,\nparticularly in the details of the proof of Lemma 3.13.\nDenote by B the space of the bounded continuous function over R with the sup norm\nk * k∞ . The temperature profile and ice line phase space is then chosen to be B × R, endowed with\na similar product norm as the restricted space BI × I. That is, k * kB×R := max {k * kB , | * |R }.\nNote that one may continuously embed any function f in BI into B. On the other hand, any\nfunction F ∈ B can be restricted to BI . Furthermore, regardless of the embedding, the norm of\nthe embedded function majorizes its restricted counterpart. We then proceed to prove that the\nattractivity and invariant results holds in the embedded space B × R. The main result Theorem\n3.3 immediately follows.\nThe following definitions give the embedding of the system (3.1) into BR × R, the extended\nBudyko map m of the Budyko map m\nb based on this embedding, and the extended critical set T ∗\n∗\nof the set TI .\nDefinition 3.6.\n∆T := F ([T, η])\n\n(3.2)\n\n∆η := G ([T, η])\nwhere we define:\n\nG([T, η]) := \u000f[T (η) − Tc ]\nand\n9\n\n(3.3)\n\n\fF ([T, η]):=\n\n\u0001\n1\n\n R Q * s(0) * [1 − α(η)(y)] − [A + BT (y)] + C[T − T (y)]\u0001 , when y < 0\n1\nR Q * s(y) * [1 − α(η)(y)] − [A + BT (y)] + C[T − T (y)]\u0001 , when 0 ≤ y ≤ 1\n\n 1\nR Q * s(1) * [1 − α(η)(y)] − [A + BT (y)] + C[T − T (y)] , when 1 < y.\nR1\nwith T = 0 T (y)dy.\n\n(3.4)\n\nThe reader may be tempted to interpret the embedded Budyko equation (3.4) as a treatment\nof the temperature profile at the boundaries. ie. the equator and the pole. Again, we emphasize\nthat the embedding the Budyko equation is a mathematical technique to simplify the analysis, and\nis not a substitute for the physical modeling of the boundary condition for the temperature profile\nT (y) in the Budyko model, akin to the diffusive transport version discussed in §2.2.4. Indeed, the\nmodel may be improved further and the reader will find such discussion in §5.2, Future Directions.\nDefinition 3.7. The Extended Budyko Map\nThe Budyko map m is the map associated with the difference equation (3.2): ie. when the initial\nconditions are T0 = T (0, y) and η0 = η(0),\nm([T0 , η0 ]) = [T0 + F ([T0 , η0 ]), η0 + G([T0 , η0 ])] .\nDenote by mk the k-th iteration of the map m.\nDefinition 3.8. The Extended Critical Set\nThe critical set of the extended system (3.2) is the subset of B\nT ∗ := {T ∗ (η)(y) : η, y ∈ R}\nwhere for a fixed η,\n\n∗\n\nT (η)(y) =\n\n\n\n\n\n\n\n\n\nR\nQ*s(0)*(1−α(η)(y))−A+C 01 T ∗ (η)(y)dy\nB+C\nR\nQ*s(y)*(1−α(η)(y))−A+C 01 T ∗ (η(y))dy\nB+C\nR\nQ*s(1)*(1−α(η)(y))−A+C 01 T ∗ (η)(y)dy\nB+C\n\n, when y < 0\n, when 0 ≤ y ≤ 1\n, when 1 < y.\n\nNotice that T ∗ ⊂ B × R and is the set of temperature profiles T (y) that solve the equation\nF ([(T (y), η]) = 0.\nOne may view T ∗ (η)(y) as the mapping from the reals to the function space B where each ice\nline η is mapped to a critical set T ∗ (η)(y). In this way, T ∗ acts as a graph mapping η ∈ R into the\nset of bounded continuous functions B.\nWe extend this notion of graph over the real line in a more general sense:\nDefinition 3.9. The space of graphs\nWe denote by G the set of graphs:\nG := {Φ : R → B|Φ is uniformly bounded and continuous over R}\nendowed with the uniform norm\nk * kG = supη∈R k * kB .\n10\n\n\fNote here that since B is a Banach space, hence complete, and since R is a metric space, then\n{G, k * kG } is a complete metric space. Also, observe that the albedo function α is a graph in G,\nwhere for each ice line η, α(η)(y) is smooth, hence Lipschitz, with a Lipchitz constant M and a\n(sup) norm α2 , the ice albedo. This observation will be important in the following characterization\nof the graph of the equilibrium temperature profiles.\nThe extended critical set will play an important role in the construction of the invariant manifold. Observe that for each η, T ∗ (η) ∈ B is a Lipschitz function with the steepest decrease at\nthe ice line location y = η, due to the albedo function α(η)(y). It is straightforward to check that\nfor all η, the Lipschitz constant of the bounded continuous function T ∗ (η) is uniformly bounded.\nThe ice line temperature function h(η) := T ∗ (η)(η), viewed as a function of η, is also a bounded\ncontinuous real valued function over the real line, and is also observed to be Lipschitz continuous\nwith uniformly bounded Lipchitz constant. Based on these observations, we define the constant L\nthat will serve as the upper bound for many of the estimates to come. Our definition of the upper\nbound constant L here is admittedly coarse, as one may find a smaller upper bound. Nonethelesss,\nwe choose this definition because it simplifies the analysis considerably.\nDefinition 3.10. The constant L\nWe define\nL := max {kT ∗ kG , LipG (T ∗ ), LipB (T ∗ (η)), Lip(T ∗ (η)(η)).}\n\nwhere\nLipG (Φ) :=\n\nkΦ(η) − Φ(ζ)kB\n|η − ζ|\nη6=ζ;η,ζ∈R\nsup\n\nand\nLipB (Φ(η)) :=\n\nsup\nx6=y;x y∈R\n\n|Φ(η)(x) − Φ(η)(y)|\n.\n|x − y|\n\nAlthough we omit such details here, observe that the constant L may be expressed in terms of\nthe parameters of the Budyko equation. For example, one may show that\n∗\n\n|T (η)| ≤\n\n(QM + A)(B + C)\nB\n\nand so,\nkT ∗ (η)kB ≤ QM + A + C(QM + A).\nSince kT ∗ (η)kB is independent of η, then\nkT ∗ kG ≤ QM + A + C(QM + A).\nThe following result shows the existence of the attracting invariant manifold for the extended\nsystem (3.2).\nTheorem 3.11.\nSuppose that the function F in (3.2) satisfies the Budyko parameter condition. Then for all \u000f\nsufficiently small, there exists an attracting one dimensional invariant manifold for the map m\nassociated with the Budyko equation (3.2). That is,\n11\n\n\f1. There exists a Lipschitz continuous map\nΦ∗ : R → B\nsuch that [Φ∗ (R), R] is invariant under the Budyko map m, ie.\nm([Φ∗ (R), R]) = [Φ∗ (R), (R)]\n2. There exists a closed set C ⊂ B in which the invariant manifold is attracting. That is: if\nT0 ∈ C, the distance between the k-th iterate of T0 and Φ∗ (R), ie.\nsup kmk ([T0 , η]) − (Φ∗ (η), η)kB×R\nη∈R\n\ndecreases exponentially.\nThe proof is based on the Hadamard's Graph Transform method [21]. The idea of the proof is\nto show the existence of a Lipschitz graph over the reals into the Banach space B that is invariant\nunder the action of the extended Budyko map. This result is possible since for a small enough \u000f,\nthe extended Budyko map is a contraction on the closed set C.\nThe statement of Theorem 3.11 gives us some hints how to proceed with the proof. We start\nby defining the Budyko graph transform operator acting on the space of graphs from Definition\n3.9. The last part of the proof is showing the contraction property of the Budyko graph transform\noperator.\nFirst, consider the following definitions and lemmas:\nDefinition 3.12. The subset GL\nThe set GL is defined to be:\nGL := {Φ ∈ G : kΦkG ≤ L, LipG (Φ) ≤ L, and for each η, LipB (Φ(η)) ≤ L} .\nThe following observations are immediate consequences of the definition of GL and are necessary to show some upcoming contraction properties:\n1. The set of graphs GL is sequentially closed in G.\n2. If Φ ∈ GL then for any real values x, y,\n|Φ(x)(x) − Φ(y)(y)|\n≤ 2L,\n|x − y|\nand therefore, Lip(Φ(x)(x)) ≤ 2L.\nWe now show that each ice line has an ice line preimage under G. Notice the convenience of\nthe embedding of [0, 1] in the real line comes into play here, as one need not fuss with the question\nwhether the preimage of the ice line indeed lies in the domain of the temperature profile.\nLemma 3.13. Ice line Preimage\n1\n, then for each η ∈ R and each Φ ∈ GL , there exists ξ ∈ R, with ξ depending on η and Φ,\nIf \u000f < 2L\nsuch that\nη = G(Φ(ξ), ξ) = ξ + \u000f (Φ(ξ)(ξ) − Tc ) .\n12\n\n(3.5)\n\n\fProof. Let Φ ∈ GL and η ∈ R be given. We will show that there is a unique function k = kΦ ∈ B,\n(k depends on Φ), such that for the given η, the following equality holds:\nη = (η + k (η)) + \u000f (Φ (η + k (η)) (η + k (η)) − Tc ) .\nDefine the transformation T acting on k ∈ B as:\n(Tk)(x) = \u000f [Tc − Φ(x + k(x))(x + k(x))] .\nWe next show that T is a contraction mapping in the complete set B by estimating kTk1 −Tk2 kB .\nLet k1 and k2 in B whose norms are no more than L be given.\nTo simplify the presentation we let ξ = x + k1 (x) and ζ = x + k2 (x).\nkT k1 − T k2 kB = sup \u000f| [T c − Φ(x + k1 (x))(x + k1 (x))] − [T c − Φ(x + k2 (x))(x + k2 (x))] |\nx∈R\n\n≤ \u000f sup |Φ(ξ)(ξ) − Φ(ζ)(ζ)|\nx∈R\n\u0014\n\u0015\n≤ \u000f sup |Φ(ξ)(ξ) − Φ(ξ)(ζ)| + sup |Φ(ξ)(ζ) − Φ(ζ)(ζ)|\nx\n\nx∈R\n\n≤ \u000f [Lkξ − ζkB + kΦ(ξ) − Φ(ζ)kB ] , since LipB Φ(ξ) ≤ L\n≤ \u000f2Lkξ − ζkB , since Φ ∈ GL\n≤ \u000f2Lkk1 (x) − k2 (x)kB .\nWe thus showed that T is a contraction mapping. By the Banach contraction mapping theorem,\nthere exists a unique k ∗ ∈ B, k ∗ depends on Φ, such that Tk ∗ = k ∗ . Letting ξ = η + k ∗ (η) in (3.5)\nfinishes the proof. We call ξ the preimage of η associated with Φ.\nWe now define the Budyko graph transform operator.\nDefinition 3.14. Let Φ ∈ GL . We define the operator M acting on a graph Φ by:\nM(Φ)(η) = Φ(ξ) + F (Φ(ξ), ξ)\nwhere ξ is the preimage of η associated with Φ defined as in Lemma 3.13 and F as in the Definition\n(3.2). We call M the Budyko graph transform operator.\nBefore we show the contraction property of the Budyko graph transform operator, we proof\nthe following computational Lemma that provides an upper bound estimate of \u000f.\nLemma 3.15. Suppose that F in Definition (3.2) satisfies the Budyko parameter condition and\nthe constant L satisfies the estimate in Definition 3.10. Denote by\nB0 := 1 −\n\nB\nL\nB\n, δ :=\nand κ :=\n.\nR\nR\nR(δ + 2B0 L)\n\nIf\n\u001a\n\u000f < min\n\n1\nκ\n,\n8L 1 + 4Lκ\n13\n\n\u001b\n(3.6)\n\n\fthen\n0 < B0 (1 + 2ρL) + ρδ < 1\nwith ρ :=\n\n(3.7)\n\n\u000f\n1−4\u000fL .\n\n1\nProof. Notice that since \u000f < 8L\n, by direct computation one may show that 0 < ρ < 1.\nAlso, by the definition of the constant L in Definition 3.10, L > A \u001d 2B, one can show that\nκ\nthen\nδ + 2B0 L = R1 (L − 2B) + 2L \u001d 1, and therefore, 0 < κ < 1. Since 0 < \u000f < 1+4Lκ\n1−B0\n\u000f < κ (1 − 4\u000fL) . Also, notice that we may also write κ = R(δ+2B0 L) . Then the following sequence\nof inequalities leads to the claimed estimate (3.7):\n\n\u000f\n1 − B0\n<\n1 − 4\u000fL\nδ + 2B0 L\n1 − B0\n⇒0<ρ<\nδ + 2B0 L\n⇒ 0 < 2B0 Lρ + ρδ < 1 − B0\n\n0 < \u000f < κ(1 − 4\u000fL) ⇒ 0 <\n\n⇒ 0 < B0 (1 + 2ρL) + ρδ < 1.\nWe will use the same notation used in Lemma (3.15) for the remainder of this article. We now\nstate the contraction result:\nLemma 3.16. If the function F in the extended Budyko map satisfies the Budyko parameters\ncondition and \u000f satisfies estimate (3.6), then the Budyko graph transform operator is a contraction\nmapping on the subset GL of the space of graphs G.\nProof. First, we show that the operator M maps GL to itself. Suppose that Φ ∈ GL , and Φ can\nbe written as Ψ − T ∗ for some Ψ ∈ G. Then for a given η, there exists ξ such that:\nM(Φ)(η) = Φ(ξ) + F (Φ(ξ), ξ)\nB+C\nC\n= (Ψ − T ∗ ) (ξ) −\nΨ(ξ) + Ψ(ξ)\nR\nR\n∗\n(since F (T (ξ), ξ) = 0)\n\u0012\n\u0013\n\u0011\nB+C\nB\nC\u0010\n= 1−\n(Ψ − T ∗ )(ξ) − T ∗ (ξ) +\nΨ(ξ) − T ∗ (ξ) .\nR\nR\nR\n\n(3.8)\n\n(3.9)\n\nTherefore, kM(Φ)kG ≤ L, since for any given η\n\u0012\n\u0013\n1\nB\nkM(Φ)(η)kB ≤ 1 − (B + C) kΨ(ξ) − T ∗ (ξ)kB + kT ∗ (ξ)kB\nR\nR\nC\n+ kΨ(ξ) − T ∗ (ξ)kB\nR\n≤ L.\nFrom equation (3.8) we may also estimate the Lipschitz constant of M (Φ)(η) for each fixed η.\nRecall that the Lipschitz constant of a function is unchanged upon adding a constant. Also, the\nLipschitz constant of the sum of two Lipschitz functions is the sum of their Lipschitz constants.\nTherefore,\n14\n\n\f\u0012\n\u0013\nB+C\nC\nLipB (M(Φ)(η)) = LipB (Ψ − T ∗ ) (ξ) −\nΨ(ξ) + Ψ(ξ)\nR\nR\n\u0012\n\u0013\n\u0012\n\u0013\nB+C\nB+C ∗\n≤ 1−\nLipB (Ψ − T ∗ )(ξ) + LipB\nT (ξ)\nR\nR\n≤ L.\nNext we show that LipG (M(Φ)) ≤ L. Again, by rewriting M(Φ) as in equation (3.8), we have\nthat\n\u0013\n\u0012\nB+C\nΨ\nLipG (M (Φ)) = LipG Φ −\nR\n\u0012\n\u0013\nB+C\nB+C\nLipG (T ∗ )\n≤ 1−\nLipG (Φ) +\nR\nR\n\n≤ L.\n\nWe have shown that M(Φ) satisfies the norm condition and both the Lipschitz conditions of\nGL , and so we conclude M : GL → GL .\nLet Φ, Ψ ∈ GL and let η ∈ R be given. By the Preimage Lemma (3.13), we have the preimages\nx and z associated with Φ and Ψ such that\nη = x + \u000f[Φ(x)(x) − Tc ]\nη = z + \u000f[Ψ(z)(z) − Tc ].\nWe first compare x and z to their respective graphs using the same notation as in Lemma\n(3.15). Recall that\nρ=\n\n\u000f\n.\n1 − \u000f4L\n\nTherefore,\n|x − z| = \u000f|Φ(x)(x) − Ψ(z)(z)|\n≤ \u000f|Φ(x)(x) − Φ(x)(z)| + |Φ(x)(z) − Ψ(x)(z)| + |Ψ(x)(z) − Ψ(z)(z)|\n≤ \u000f (2L|x − z| + kΦ − ΨkG + 2L|x − z|+)\n\u0012\n\u0013\n≤ \u000f kΦ − ΨkG + 4L|x − z| .\nTherefore,\n|x − z| ≤ ρkΦ − ΨkG .\n\n(3.10)\n\nkΦ(x) − Ψ(z)kB ≤ kΦ(x) − Ψ(x)kB + kΨ(x) − Ψ(z)kB\n\n(3.11)\n\nAnother estimate yields\n\n≤ kΦ − ΨkG + 2L|x − z|\n≤ (1 + ρ2L)kΦ − ΨkG .\n15\n\n\fWe now estimate the Budyko graph transform operator on the space of graphs G. Fixing η,\nwe have\nkM(Φ)(η) − M(Ψ)(η)kB\n= kΦ(x) + F (Φ(x), x) − (Ψ(z) + F (Ψ, z)) kB\n1\n1\n= k(1 − (B + C)) [Φ(x) − Ψ(z)] + Qs(y) [α(z)(y) − α(x)(y)]\nR\nR\n\u0015\n\u0014Z 1\nZ 1\n1\nΦ(x)(y)dy −\nΨ(z)(y)dy kB\n+ C\nR\n0\n0\n\u0012\n\u0013\n1\n1\n1\n≤ |1 − (B + C)| + C kΦ(x) − Ψ(z)kB + L|x − z|\nR\nR\nR\n\u0012\n\u0013\n1\n≤ 1 − B kΦ(x) − Ψ(z)kB + δρkΦ − ΨkG\nR\n≤ (B0 (1 + ρ2L) + ρδ) kΦ − ΨkG .\n\n(3.12)\n\nBy inequality (3.7) in Lemma 3.15, we have showed here that the Budyko graph transform operator M is a contraction mapping on the complete set GL . Therefore, by the Banach contraction\nmapping theorem, we conclude that: There exists a unique Lipschitz continuous graph Φ∗ ∈ GL\nsuch that M(Φ∗ ) = Φ∗ .\nThe contraction constant in inequality (3.12) will reappear in the following proofs. It is then\nuseful to denote this constant here. Let\nγ = (B0 (1 + ρ2L) + ρδ) .\n\n(3.13)\n\nWe finish the proof of Theorem 3.3 by showing the invariant and the attracting property of the\nBudyko map m on the manifold Φ∗ (R) × R. Recall from Lemma (3.13), there exists a real valued\nfunction kΦ∗ such that kΦ∗ (x) = \u000f (Tc − Φ∗ (x)(x)). Given x ∈ R, let\ny = x − kΦ∗ (x).\nThen\nΦ∗ (y) = M(Φ∗ (x)) and y = x + \u000f (Φ∗ (x)(x) − Tc ) .\nAnd therefore,\nm ([Φ∗ (x), x]) = [Φ∗ (x) + F (Φ∗ (x), x), x + G(Φ∗ (x), x)]\n= [M(Φ∗ )(x), x + G(Φ∗ (x), x)]\n= [Φ∗ (y), y] .\n\n(3.14)\n\nSo, Φ∗ (R) × R is invariant under the action of the Budyko map m, and thus, we have shown\nthe invariant part, ie. part 1, of Theorem 3.11.\nWe now show part 2 of Theorem 3.11, ie. show that the invariant manifold Φ∗ (R) × R is locally\nattracting.\n16\n\n\fLet\nC := {T ∈ B : kT kB ≤ L, LipB (T ) ≤ L} .\nWe now show the contraction property of the Budyko map m on C ×R and thereby showing the\nattracting property of the invariant manifold. Given T0 ∈ C, then T0 = Φ0 (η), where Φ0 (η) = T0\nfor any η. It is straightforward to check that Φ0 ∈ GL . Again, let x ∈ R be given, and let\ny = x − kΦ∗ (x) and z = x − kΦ0 (x). Recall that both the constants γ in equation (3.13) and ρ in\nLemma 3.15 are positive and are majorized by 1.\nkm([Φ0 , x]) − m([Φ∗ , x])kB×R = k [M(Φ0 )(z) − M(Φ∗ )(y), z − y] kB×R\n≤ max {γkΦ0 − Φ∗ kG , ρkΦ0 − Φ∗ kG }\n\n(3.15)\n\n∗\n\n< k[Φ0 (x) − Φ (x), x − x]kB×R .\nTherefore, kmk (T0 , x) − (Φ∗ , x)k → 0 exponentially, thus, we have shown here part 2 of Theorem 3.11.\nNow that we have a result in the embedded space B × R, ie. there is a one dimensional locally\nattracting manifold invariant under the extended Budyko map m, we will show the main result,\nwhich is the restriction of Theorem 3.11 to the unit interval.\nRecall that the goal of main result is to show the existence of the locally attracting invariant\nmanifold of the Budyko map over the unit interval I. Suppose that η, y ∈ I, let\nφ∗ (η)(y) := Φ∗ (η)(y),\nie. the restriction of Φ∗ (η)(y) over the unit interval. We will show that\nMI := {[φ∗ (η)(y), η] : y, η ∈ I = [0, 1]}\nis the desired manifold.\nWe define a closed set analogous to C,\nCI = {T ∈ BI , kT kBI ≤ L, LipBI (T ) ≤ L} .\nFor the remainder of this proof, let y, η ∈ I = [0, 1]. To show the first part of Theorem 3.3,\nwe show the contraction result (3.15) is also true in this restricted manifold under the restricted\nBudyko mapping m.\nb Suppose that Tb0 ∈ CI and η0 ∈ I, we extend Tb0 in a similar fashion as the\nBudyko map m\nb and define T0 (y) ∈ BI\n\n\n T0 (0) , when y < 0\nT0 (y) :=\nT0 (y) , when 0 ≤ y ≤ 1\n\n\nT0 (1) , when 1 < y.\nIn fact, T0 (y) ∈ C. When the domain of the temperature profile is restricted to the unit interval,\nthe Budyko mapping m is precisely m.\nb Furthermore, since for a given η ∈ [0, 1] we have:\n\u0010\n\u0011\nkm\nb [Tb0 , η0 ] − [φ∗ (η)(y), η]kBI ×I ≤ km ([T0 , η0 ]) − [Φ∗ (η)(y), η]kB×R\n17\n\n\fthen, the contraction result (3.15) is true also for the restricted space BI × I. Hence, MI is locally\nattracting under the action of m.\nb\nTo show the second part of Theorem 3.3, recall the equalities in (3.14) shows that\nm ([Φ∗ (η), η]) = [Φ∗ (ξ), (ξ)].\nSince we already specified that η ∈ [0, 1], then m ([Φ∗ (η), η]) = m\nb ([Φ∗ (η), η]), and if ξ ∈ [0, 1], then\nthe first invariant alternative of the main result follows. Otherwise, ξ ∈\n/ [0, 1], Φ∗ (ξ)(y) ∈ B, so\n∗\nthat the restriction of Φ (ξ) on the unit interval is also bounded continuous, hence in BI , and the\nsecond alternative follows. This ends the proof of the main result Theorem 3.3.\nWe now present the proof of Corollaries 3.4 and 3.5.\nProof. (of Corollary 3.4)\nAgain, we show the result holds in the embedded space, then show that the same result is also\ntrue in the restricted space. Let η ∈ R. Since M(Φ∗ )(R) = Φ∗ (R), then the following holds:\nΦ∗ (η) = Φ∗ (ξ) + F ([Φ∗ (ξ) − T ∗ (ξ) + T ∗ (ξ), ξ])\nwhere ξ = η + kΦ∗ (η).\nUsing reverse triangle inequality and the fact that F (T ∗ (ξ), ξ) = 0 we find:\n||Φ∗ (η) − Φ∗ (ξ)||B = ||(B + C) * [Φ∗ (ξ) − T ∗ (ξ)] − C(Φ∗ (ξ) − T ∗ (ξ))||B\n≥ (B + C) * ||Φ∗ (ξ) − T ∗ (ξ)||B − C||Φ∗ (ξ) − T ∗ (ξ)||B\n≥ B||Φ∗ (ξ) − T ∗ (ξ)||B .\nIn the last step of the above estimate, we used the fact that\nΦ∗ (ξ) − T ∗ (ξ) ≤ kΦ∗ (ξ) − T ∗ (ξ)kB .\n\nWe arrive at the desired estimate:\n1\n∗\n||Φ∗ (η) − Φ∗ (η + kΦ\n)kB\nB\n1\n≤\n* kkΦ∗ (η)k\nB\n\u000fL\n≤\n.\nB\n\n||Φ∗ (ξ) − T ∗ (ξ)||B ≤\n\n(3.16)\n\nSince the estimate is true for any given ice line η and since the upper bound \u000fL\nB is independent\n\u000fL\n∗\n∗\nof η, we conclude that kΦ − T kG < B . In particular, in the restricted space, ie. if y, ξ ∈ [0, 1],\nφ∗ (ξ)(y) = Φ∗ (ξ)(y), and the following inequality holds\n||φ∗ (ξ)(y) − T ∗ (ξ)(y)||BI ≤ ||Φ∗ (ξ)(y) − T ∗ (ξ)(y)||B .\n18\n\n\fThus, the estimate in (3.16) applies to the restricted space, BI . The invariant manifold MI is\ntherefore within O(\u000f) of the critical set TI∗ := {[T ∗ (η)(y), η] : η, y ∈ I = [0, 1]}. This completes the\nproof of Corollary 3.4.\nProof. of Corollary (3.5)\nAs an immediate result of Corollary 3.4, we may estimate, within an order of \u000f, the ice line\ntemperature difference upperbound. That is:\n|φ∗ (η)(η) − T ∗ (η)(η)| <\n\n\u000fL\n.\nB\n\nSo that for a suficiently small \u000f, φ∗ (1)(1) < Tc , prompting a condition for ice to form and ice line\nto move equatorward. Similar calculations yield the stability of the small ice cap and the snowball\nEarth and the instability of the big ice cap. The small ice cap is therefore a sink, while the big ice\ncap is a saddle.\nFigure 3.1 illustrates the one dimensional dynamics of the slow system in Definition (3.2) dictated by G(T, η) = \u000f (T (η) − Tc ), using the parameters in Table 4.1. If an ice line is initiated\nequatorward of the large ice cap equilibrium, the ice line temperature of the equilibrium temperature profile would be colder than the critical temperature Tc and the ice line advances toward the\nequator leaving us with a snowball Earth. If an ice line is initiated between the large ice cap and\nthe small ice cap, the ice line temperature would be warmer than the critical temperature and thus\nit would retreat to the small ice cap equilibrium. Poleward of the small ice cap equilibrium, the\nice line temperature is colder than the critical temperature causing ice to grow, hence, the ice line\nwould advance toward the equator. It can be seen from this figure that the dynamics of the system\nwould stay the same for a value Tc in the range between about −5.5o C to about −12o C, so long\nas the line Tc cuts the solid (red) curve T ∗ (η)(η) in two sites representing the large and the small\nice cap equilibria.\n4. Bifurcation Diagrams and Animations.\n4.1. Bifurcation Diagrams. Readers may find bifurcation diagrams similar to Figures 4.2\nand 4.1 in other literatures (see [1, 25]). We emphasize here that, unlike those presented in previous\nworks, our stability analysis is a result of the ice line dynamics formulated in the slow equation,\nie. (3.1) of the fast-slow system in the statement of the main result Theorem 3.3. This is indeed\npossible because the dynamics of the coupled system collapsed into a one dimensional system of\nthe ice line.\nThe bifurcation diagram of the system with respect to the greenhouse gas parameter A is presented in Figure 4.1. The solid (red) curve in both figures is obtained by solving for the parameter\nA when T ∗ (η, η) is set to the critical temperature Tc = −10o C and the large green arrows indicate\nthe dynamics of the ice line. If a pair of a parameter A and an initial ice line η is chosen to the\nright of this curve then the value of T ∗ (η, η) for this pair will be less than the critical temperature\nTc . In this case, the ice line equation dictates that the ice line moves down toward the equator,\nhence the downward blue arrow to the right of the red curve. Similarly, choosing a combination\nleft of the red curve will move the ice line toward the pole.\nThe value A = 202 in particular is chosen in [25] to indicate a modern value of radiative forcing obtained through satelite observations [7]. With this value of A, the reader will observe the\ninstability of the big ice cap equilibrium at η ∼\n= 0.2 and the small ice cap equilibrium η ∼\n= 0.962.\nFurthermore, one recognizes the stability of the branches above the saddle node bifurcation point\n19\n\n\fFig. 3.1: The ice line temperature graph T ∗ (η)(η) (in solid red) and the critical temperature\nTc = −10 (in the green dash line) graphed using parameters in [25] over the physically relevant\ninterval [0, 1]. The arrows indicate the direction of the ice line movement. The intersections of the\ntwo curves η ∼\n= 0.2 and 0.962 are the large ice cap and the small ice cap equilibria.\n\nfor the values near A = 212 and η = 0.6, represented by the solid red curve, and the instability of\nthe lower branch, represented by the dash red curve.\nWe now focus on the physically relevant bifurcation points at the boundaries, ie. when A ∼\n= 186\n(corresponding to η = 0) and A ∼\n= 198 (corresponding to η = 1), where the determination of the\nbifurcation type is not so straightforward. The physically relevant condition that the ice line is not\nadmissible outside of the unit interval imposes the mathematical restriction on the dynamics of the\nice line at the boundaries, ie. η = 0 and η = 1, namely that\nat the equator or η = 0\nat the pole or η = 1\n\n∆η = max {0, \u000f(T (η)(η) − Tc )}\n\n(4.1)\n\n∆η = min {0, \u000f(T (η)(η) − Tc )} .\n\nUsing this restriction, one may determine the stability of branches in the bifurcation diagram at\nthe physical boundary. In Figure 4.1, the maroon solid lines at the equator η = 0 and the pole\nη = 1 indicates a stable branch of the bifurcation diagram, suggesting an eternally ice covered or\nice free state, depending on the parameter A. The maroon dash lines in the same figure indicates\nan unstable branch of the bifurcation diagram for A.\nThe reader may observe that the mathematical restrictions on ∆η in equation (4.1) introduces\na non-differentiability of the ice line governing equation on a subset of the phase space. Such\nnon-differentiability have known to introduce phenomena called border collision bifurcations [20]\nor discontinuity induced bifurcation [13]. This suggests a more rigorous treatment of the Budykoice line model on the physical boundary, however, such treatment is beyond the scope of this paper.\n20\n\n\fFig. 4.1: The bifurcation diagram of the parameter A. All other parameters are as in Table 4.1.\n\nA similar analysis is repeated for the bifurcation diagram of the parameter Q in Figure 4.2.\nThe phase line diagram for the current value of solar insolation Q = 343 used in [25] is shown\nin Figure 4.2, with blue arrows indicating the ice line dynamics. As in the discussion for the\nbifurcation diagram of parameter A, the stability of each branch of the bifurcation diagram for Q\nis determined using the ice line equation (3.1), for ice line inside the unit interval and using (4.1)\nfor the physical boundaries at the pole and the equator. The color scheme and the line style used\nin these figures are the same as that in Figure 4.1.\n4.2. Animations. The animations (in Figure 4.3) follow the evolution of the system without\nthe ice line equation. In Figure 4.3 the red curve represents the temperature profile of the system,\nthe light blue represents the ice covered region, while the dark blue represents the ice free region.\nThe ice line of the boundary of these region is represented by a purple dot. The top row Figure\n4.3 are the initial temperature profies, ie. the graph of T (y) = 14 − 54y 2 . The initial temperature\nprofile is chosen to represent a decreasing function with temperature at the equator at 14o C and at\nthe pole −40o C resembling a current average temperature at those extreme places. The parameters\nused in this animation can be found in Table 4.1, which is based on parameter values used in [25].\nThe bottom row of Figure 4.3 gives the equilibrium temperature profiles.\nThe animations in Figure 4.3 illustrate the lack of ice line dynamics when the ice line equation\nis not included. In Figure 4.4, the ice line equation is now included and is coupled to the Budyko\nequation. Notice that in contrast to Figure 4.3, the position of the ice line changes. The ice line\ndynamics can be observed in the animations in Figure 4.4. We choose a value of \u000f = 10−2 that\nmakes the animation run time reasonable.\n21\n\n\fFig. 4.2: The bifurcation diagram of the parameter Q. All other parameters are as in Table 4.1.\n\n5. Concluding Discussion.\n5.1. Conclusion. We introduce an auxilliary equation governing the ice line dynamics which\nis coupled to an ice albedo feedback EBM. The reformulation of the model contains two components: one equation representing planetary energy balance based on Budyko's EBM, and the\nother equation representing the dynamics of the ice line. This forms a system of fast-slow integrodifference equations and we show the existence of a one dimensional attracting invariant manifold\nin this system. As a corollary of the main result, under parameter conditions prevalent in current\nliterature, one may deduce the stability of various states of the planet, eg. ice free planet is unstable\nwhile a small ice cap is stable, etc.\n5.2. Future Directions. There are several directions that one can explore based on this\nmodel. One immediate extension is to compute the invariant manifold explicitly similar to the\nwork done by Foias, Sell and Titi [6]. The model formulation would be clarified even further with\nan explicit dynamics of the ice line when it is at the equator or the pole, possibly by introducing\na discontinuity in the ice line equation. Another immediate improvement on this model is an extension to the southern hemisphere with two ice lines and a non symmetric transport. As stated\nin [2], the two main feedbacks that dictate the interglaciation/ glaciation cycles are the ice albedo\n22\n\n\fParameter\n\nValue\n\nQ\nα1\nα2\nA\nB\nC\nTc\nR\nM\n\u000f\n\u000f\n\nUnit\n\nSource\n2\n\n343\n0.32\n0.62\n202\n1.9\n3.04\n-10\n12.6\n25\n−2\n10 (dynamic)\n0 (static)\n\nW atts/m\nDimensionless\nDimensionless\nW atts/m2\nW atts/(m2 o C)\nW atts/(m2 o C)\no\nC\nW atts/(m2 o C)\nnone\no\n/ Cyear\n/o Cyear\n\n[25]\n[25]\n[25]\n[25]\n[25]\n[25]\n[25]\n[16]\nauthor\nauthor\nauthor\n\n40\n\n40\n\n40\n\n30\n\n30\n\n30\n\n20\n\n20\n\n20\n\n10\n\n10\n\n0\n\nEquator\n\nï10\n\nPole\n\nï20\n\n10\n\nTemperature (C)\n\nTemperature (C)\n\nTemperature (C)\n\nTable 4.1: The parameters used to create the simulations in Figures 4.3 and 4.4\n\n0\n\nEquator\n\nï10\n\nPole\n\nï20\n\n0\n\nï30\n\nï30\n\nï40\n\nï40\n\nï40\n\nï50\n\nï50\n\nï60\n\nï60\n\n0.1\n\n0.2\n\n0.3\n\n0.4\n\n0.5\n\n0.6\n\n0.7\n\n0.8\n\n0.9\n\n1\n\nï50\n\n0\n\n0.1\n\n0.2\n\n0.3\n\n0.4\n\ny\n\n0.5\n\n0.6\n\n0.7\n\n0.8\n\n0.9\n\n1\n\nï60\n\n40\n\n40\n\n30\n\n30\n\n20\n\n20\n\n20\n\n10\n\n10\n\n0\n\n0\nEquator\n\nPole\n\nï20\n\n−30\n\nï30\n\n−40\n\n−40\n\nï40\n\n−50\n\n−50\n\n−60\n\n−60\n\n0.4\n\n0.4\n\n0.5\n\n0.5\n\n0.6\n\n0.7\n\n0.8\n\n0.9\n\n1\n\n0.6\n\n0.7\n\n0.8\n\n0.9\n\nEquator\n\nï10\n\n−20\n\n0.3\n\n0.3\n\n1\n\n0\nPole\n\n−30\n\n0.2\n\n0.2\n\n10\n\nEquator\n\n−10\n\n−20\n\n0.1\n\n0.1\n\ny\n\n30\n\n0\n\n0\n\ny\n\n40\n\n−10\n\nPole\n\nï20\n\nï30\n\n0\n\nEquator\n\nï10\n\nPole\n\nï50\n\n0\n\n0.1\n\n0.2\n\n0.3\n\n0.4\n\n0.5\n\n0.6\n\n0.7\n\n0.8\n\n0.9\n\n1\n\nï60\n\n0\n\n0.1\n\n0.2\n\n0.3\n\n0.4\n\n0.5\n\n0.6\n\n0.7\n\n0.8\n\n0.9\n\n1\n\nFig. 4.3: WITHOUT ICE LINE DYNAMICS. The ice free surface is dark blue and the ice\ncovered surface is bright cyan, while the red curve is the temperature profile. The vertical axes\nare the temperature in Celcius, the horizontal axes are the unit interval representing the sin of\nthe latitude. The figures on the top are the initial temperature profile, T (y) = 14 − 54y 2 with ice\nlines at [0.1, Tc ] (left), [0.5, Tc ] (middle) and [1, Tc ] (right), with Tc = −10o C. The figures on the\nbottom are the steady state temperature profiles T ∗ (η)(y) at the respective ice lines. Clicking on\nthe top figures will start the animation. Adobe Acrobat Reader may be required.\n\nand greenhouse gasses feedbacks. The greenhouse gas effect in this model enters through the linear\nterm A + BT (y) affecting the radiative forcings. The work by Hogg in [10] relates the evolution of\ntemperature with that of carbondioxide as a response to the solar input variations caused by the\nMilankovitch cycle. A coupling of Budyko and Hogg's model may be fruitful in obtaining a simple\nmodel to understand the interglaciation/ glaciation cycles. The authors in [17], [5], [18] explore a\nsimilar model with only a diffusion transport. Another interesting modification would be to include\n23\n\n\f40\n\n40\n\n30\n\n30\n\n30\n\n20\n\n20\n\n20\n\n10\n\n10\n\n0\n\nEquator\n\nï10\n\nPole\n\nï20\n\n0\n\nï30\nï40\n\nï50\n\nï50\n\n0.1\n\n0.2\n\n0.3\n\n0.4\n\n0.5\n\n0.6\n\n0.7\n\n0.8\n\n0.9\n\nï60\n\n1\n\nPole\n\nï20\n\nï40\n\n0\n\nEquator\n\nï10\n\nï30\n\nï60\n\n10\n\nTemperature (C)\n\nTemperature (C)\n\nTemperature (C)\n\n40\n\n0\n\nï40\nï50\n\n0\n\n0.1\n\n0.2\n\n0.3\n\n0.4\n\n0.5\n\n0.6\n\n0.7\n\n0.8\n\n0.9\n\n1\n\nï60\n\n40\n\n40\n\n30\n\n30\n\n20\n\n20\n\n20\n\n10\n\n10\n\n0\n\n0\nEquator\n\nPole\n\n−30\n\n−30\n\n−30\n\n−40\n\n−40\n\n−50\n\n−50\n\n0.4\n\n0.4\n\n0.5\n\n0.5\n\n0.6\n\n0.7\n\n0.8\n\n0.9\n\n1\n\n−60\n\n0.6\n\n0.7\n\n0.8\n\n0.9\n\nEquator\n\n−10\n−20\n\n0.3\n\n0.3\n\n1\n\n0\n\n−10\n\nPole\n\n−20\n\n0.2\n\n0.2\n\n10\n\nEquator\n\n−20\n\n0.1\n\n0.1\n\ny\n\n30\n\n0\n\n0\n\ny\n\n40\n\n−60\n\nPole\n\nï20\nï30\n\ny\n\n−10\n\nEquator\n\nï10\n\nPole\n\n−40\n−50\n\n0\n\n0.1\n\n0.2\n\n0.3\n\n0.4\n\n0.5\n\n0.6\n\n0.7\n\n0.8\n\n0.9\n\n1\n\n−60\n\n0\n\n0.1\n\n0.2\n\n0.3\n\n0.4\n\n0.5\n\n0.6\n\n0.7\n\n0.8\n\n0.9\n\n1\n\nFig. 4.4: WITH ICE LINE DYNAMICS. The figures on the top are the initial temperature\nprofiles, T (y) = 14 − 54y 2 with ice lines at η0 = 0.1, 0.5 and 1, and the figure on the bottom\nare the steady state temperature profiles T ∗ (η, y), with the ice lines at the equator or η = 0, and\nη∼\n= 0.962. Again, the ice free surface is dark blue and the ice covered surface is bright cyan, while\nthe red curve is the temperature profile. Clicking on the top figures will start the animations.\nAdobe Acrobat Reader may be required.\n\nboth diffusion (a second derivative term) and averaging (an integral term) in the transport process.\n6. Acknowledgement. The author would like to thank Prof. R. McGehee, for his guidance\nin writing the PhD thesis that makes up the backbone of the main result and for his constant\nsupport during the course of writing this article. Also, the author is grateful for the support\nfrom the colleagues at the Mathematics Climate Research Network, as well as for many helpful\nsuggestions from the editors and the anonymous referees.\nREFERENCES\n[1] Dorian S Abbot, Aiko Voigt, and Daniel Koll, The jormungand global climate state and implications for\nneoproterozoic glaciations, Journal of geophysical research, 116 (2011), p. D18103.\n[2] David Archer, The Global Carbon Cycle, Princeton University Press, New Jersey, 2010.\n[3] M.I. Budyko, The effect of solar radiation on the climate of the earth, Tellus, 21 (1969), pp. 611–619.\n[4]\n, The future climate, Trans. Amer. Geophys. Union, 53 (1972), pp. 868–874.\n[5] Robert F Cahalan and Gerald R North, A stability theorem for energy-balance climate models., Journal\nof Atmospheric Sciences, 36 (1979), pp. 1178–1188.\n[6] Ciprian Foias, George R Sell, and Edriss S Titi, Exponential tracking and approximation of inertial\nmanifolds for dissipative nonlinear equations, Journal of Dynamics and Differential Equations, 1 (1989),\npp. 199–244.\n[7] Charles E Graves, Wan-Ho Lee, and Gerald R North, New parameterizations and sensitivities for simple\nclimate models, Journal of geophysical research, 98 (1993), pp. 5025–5036.\n[8] DH Griffel and PG Drazin, On diffusive climatological models, Journal of the Atmospheric Sciences, 38\n(1981), pp. 2327–2332.\n[9] Isaac M Held and Max J Suarez, Simple albedo feedback models of the icecaps, Tellus, 26 (1974), pp. 613–629.\n[10] Andrew McC Hogg, Glacial cycles and carbon dioxide: A conceptual model, Geophysical Research Letters,\n35 (2008), p. L01701.\n[11] P.D. Hughes J. Ehlers, P.L Gibbard, ed., Quaternary Glaciations - Extent and Chronology, vol. 15 of\nDevelopments in Quaternary Science, Elsevier, New York, 2011.\n24\n\n\f[12] Hans G. Kaper and Hans Engler, Mathematics and Climate, Society for Industrial and Applied Mathematics\n(SIAM), Philadelphia, Pennsylvania, 2013. (in preparation).\n[13] P Kowalczyk and P Glendinning, Boundary-equilibrium bifurcations in piecewise-smooth slow-fast systems.,\nChaos, 21 (2011), p. 023126.\n[14] Francis A Macdonald, Mark D Schmitz, James L Crowley, Charles F Roots, David S Jones, Adam C\nMaloof, Justin V Strauss, Phoebe A Cohen, David T Johnston, and Daniel P Schrag, Calibrating\nthe cryogenian, Science, 327 (2010), pp. 1241–1243.\n[15] Richard McGehee and Clarence Lehman, A paleoclimate model of ice-albedo feedback forced by variations\nin earth's orbit, SIAM Journal on Applied Dynamical Systems, 11 (2012), pp. 684–707.\n[16] R. McGehee and E. Widiasih, A finite dimensional version of a dynamic ice albedo feedback\nmodel, preprint, (2012), p. http://www.math.umn.edu/~mcgehee/publications/McGeheeWidiasih2012/\nMcGeheeWidiasihPreprint2012March.pdf.\n[17] Gerald R North, Theory of energy-balance climate models, J. Atmos. Sci, 32 (1975), pp. 2033–2043.\n, The small ice cap instability in diffusive climate models, Journal of the atmospheric sciences, 41 (1984),\n[18]\npp. 3390–3395.\n, Multiple solutions in energy balance climate models, Global and Planetary Change, 2 (1990), pp. 225–\n[19]\n235.\n[20] Helena E Nusse, Edward Ott, and James A Yorke, Border-collision bifurcations: An explanation for\nobserved bifurcation phenomena, Physical Review E, 49 (1994), p. 1073.\n[21] Clark Robinson, Dynamical systems: stability, symbolic dynamics, and chaos, vol. 28, CRC, 1998.\n[22] William Sellers, A climate model based on the energy balance of the earth-atmosphere system, J. Applied\nMetereology, 8 (1969), pp. 392–400.\n[23] PA Simmons and DH Griffel, Continuous versus discontinuous albedo representations in a simple diffusive\nclimate model, Climate dynamics, 3 (1988), pp. 35–39.\n[24] CH Su and DY Hsieh, Stability of the budyko climate model., Journal of Atmospheric Sciences, 33 (1976),\npp. 2273–2275.\n[25] KK Tung, Topics in mathematical modelling, Princeton University Press, New Jersey, 2007.\n\n25\n\n\f"}