{"id": "http://arxiv.org/abs/1003.0704v2", "guidislink": true, "updated": "2011-09-27T23:00:43Z", "updated_parsed": [2011, 9, 27, 23, 0, 43, 1, 270, 0], "published": "2010-03-02T23:04:26Z", "published_parsed": [2010, 3, 2, 23, 4, 26, 1, 61, 0], "title": "On low-dimensional manifolds with isometric $\\mathrm{SO}_0(p,q)$-actions", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1003.0704%2C1003.5413%2C1003.2365%2C1003.4236%2C1003.5464%2C1003.0118%2C1003.0950%2C1003.1812%2C1003.3777%2C1003.5491%2C1003.1789%2C1003.2460%2C1003.0563%2C1003.1164%2C1003.0176%2C1003.4487%2C1003.3789%2C1003.0197%2C1003.5337%2C1003.3812%2C1003.3103%2C1003.1439%2C1003.2282%2C1003.2869%2C1003.4899%2C1003.0123%2C1003.5816%2C1003.2315%2C1003.3756%2C1003.2860%2C1003.1842%2C1003.3552%2C1003.0083%2C1003.2815%2C1003.0268%2C1003.3941%2C1003.3463%2C1003.1320%2C1003.2321%2C1003.1172%2C1003.1017%2C1003.4596%2C1003.0663%2C1003.5108%2C1003.3173%2C1003.0011%2C1003.3130%2C1003.4412%2C1003.5445%2C1003.4810%2C1003.1763%2C1003.5685%2C1003.5262%2C1003.2141%2C1003.1799%2C1003.0894%2C1003.2398%2C1003.4976%2C1003.6100%2C1003.4934%2C1003.1616%2C1003.5717%2C1003.2287%2C1003.5190%2C1003.4791%2C1003.2054%2C1003.5660%2C1003.2146%2C1003.3605%2C1003.2953%2C1003.5988%2C1003.5258%2C1003.5929%2C1003.1306%2C1003.1502%2C1003.4907%2C1003.2536%2C1003.3054%2C1003.5948%2C1003.1593%2C1003.2474%2C1003.4333%2C1003.1286%2C1003.5508%2C1003.3596%2C1003.3294%2C1003.4144%2C1003.2904%2C1003.4140%2C1003.3907%2C1003.5565%2C1003.0507%2C1003.4261%2C1003.0888%2C1003.4988%2C1003.4958%2C1003.1680%2C1003.0579%2C1003.6080%2C1003.3862%2C1003.4203&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "On low-dimensional manifolds with isometric $\\mathrm{SO}_0(p,q)$-actions"}, "summary": "Let $G$ be a non-compact simple Lie group with Lie algebra $\\mathfrak{g}$.\nDenote with $m(\\mathfrak{g})$ the dimension of the smallest non-trivial\n$\\mathfrak{g}$-module with an invariant non-degenerate symmetric bilinear form.\nFor an irreducible finite volume pseudo-Riemannian analytic manifold $M$ it is\nobserved that $\\dim(M) \\geq \\dim(G) + m(\\mathfrak{g})$ when $M$ admits an\nisometric $G$-action with a dense orbit. The Main Theorem considers the case $G\n= \\widetilde{\\mathrm{SO}}_0(p,q)$ providing an explicit description of $M$ when\nthe bound is achieved. In such case, $M$ is (up to a finite covering) the\nquotient by a lattice of either $\\widetilde{\\mathrm{SO}}_0(p+1,q)$ or\n$\\widetilde{\\mathrm{SO}}_0(p,q+1)$.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1003.0704%2C1003.5413%2C1003.2365%2C1003.4236%2C1003.5464%2C1003.0118%2C1003.0950%2C1003.1812%2C1003.3777%2C1003.5491%2C1003.1789%2C1003.2460%2C1003.0563%2C1003.1164%2C1003.0176%2C1003.4487%2C1003.3789%2C1003.0197%2C1003.5337%2C1003.3812%2C1003.3103%2C1003.1439%2C1003.2282%2C1003.2869%2C1003.4899%2C1003.0123%2C1003.5816%2C1003.2315%2C1003.3756%2C1003.2860%2C1003.1842%2C1003.3552%2C1003.0083%2C1003.2815%2C1003.0268%2C1003.3941%2C1003.3463%2C1003.1320%2C1003.2321%2C1003.1172%2C1003.1017%2C1003.4596%2C1003.0663%2C1003.5108%2C1003.3173%2C1003.0011%2C1003.3130%2C1003.4412%2C1003.5445%2C1003.4810%2C1003.1763%2C1003.5685%2C1003.5262%2C1003.2141%2C1003.1799%2C1003.0894%2C1003.2398%2C1003.4976%2C1003.6100%2C1003.4934%2C1003.1616%2C1003.5717%2C1003.2287%2C1003.5190%2C1003.4791%2C1003.2054%2C1003.5660%2C1003.2146%2C1003.3605%2C1003.2953%2C1003.5988%2C1003.5258%2C1003.5929%2C1003.1306%2C1003.1502%2C1003.4907%2C1003.2536%2C1003.3054%2C1003.5948%2C1003.1593%2C1003.2474%2C1003.4333%2C1003.1286%2C1003.5508%2C1003.3596%2C1003.3294%2C1003.4144%2C1003.2904%2C1003.4140%2C1003.3907%2C1003.5565%2C1003.0507%2C1003.4261%2C1003.0888%2C1003.4988%2C1003.4958%2C1003.1680%2C1003.0579%2C1003.6080%2C1003.3862%2C1003.4203&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Let $G$ be a non-compact simple Lie group with Lie algebra $\\mathfrak{g}$.\nDenote with $m(\\mathfrak{g})$ the dimension of the smallest non-trivial\n$\\mathfrak{g}$-module with an invariant non-degenerate symmetric bilinear form.\nFor an irreducible finite volume pseudo-Riemannian analytic manifold $M$ it is\nobserved that $\\dim(M) \\geq \\dim(G) + m(\\mathfrak{g})$ when $M$ admits an\nisometric $G$-action with a dense orbit. The Main Theorem considers the case $G\n= \\widetilde{\\mathrm{SO}}_0(p,q)$ providing an explicit description of $M$ when\nthe bound is achieved. In such case, $M$ is (up to a finite covering) the\nquotient by a lattice of either $\\widetilde{\\mathrm{SO}}_0(p+1,q)$ or\n$\\widetilde{\\mathrm{SO}}_0(p,q+1)$."}, "authors": ["Gestur Olafsson", "Raul Quiroga-Barranco"], "author_detail": {"name": "Raul Quiroga-Barranco"}, "author": "Raul Quiroga-Barranco", "arxiv_comment": "This version improves and updates the presentation of the original\n  submission to arxiv", "links": [{"href": "http://arxiv.org/abs/1003.0704v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1003.0704v2", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "math.DG", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "math.DG", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "(Primary) 53C24 (Secondary) 57S20, 53B30", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1003.0704v2", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1003.0704v2", "journal_reference": null, "doi": null, "fulltext": "arXiv:1003.0704v2 [math.DG] 27 Sep 2011\n\nON LOW-DIMENSIONAL MANIFOLDS WITH ISOMETRIC\nSO0 (p, q)-ACTIONS\nGESTUR OLAFSSON AND RAUL QUIROGA-BARRANCO\nAbstract. Let G be a non-compact simple Lie group with Lie algebra g.\nDenote with m(g) the dimension of the smallest non-trivial g-module with\nan invariant non-degenerate symmetric bilinear form. For an irreducible finite\nvolume pseudo-Riemannian analytic manifold M it is observed that dim(M ) ≥\ndim(G) + m(g) when M admits an isometric G-action with a dense orbit.\nf 0 (p, q) providing an explicit\nThe Main Theorem considers the case G = SO\ndescription of M when the bound is achieved. In such case, M is (up to a finite\nf 0 (p + 1, q) or SO\nf 0 (p, q + 1).\ncovering) the quotient by a lattice of either SO\n\nIntroduction\nLet G be a connected non-compact simple Lie group acting isometrically on a\nconnected analytic manifold M with a finite volume pseudo-Riemannian metric.\nFollowing Zimmer's program, it has been shown that such actions are rigid in the\nsense of having distinguished properties that restrict the possibilities for M (see\nfor example [10, 20, 22]). The general belief is that any such action, with some\nadditional non-triviality conditions, must essentially be an algebraic double coset\nof the form K\\H/Γ. More precisely, such coset is given by some Lie group H\ntogether with a homomorphism G → H, a lattice Γ ⊂ H and a compact subgroup\nK ⊂ H centralizing the image of G in H. The G-action is then given by the\nnatural left action on K\\H/Γ. We note that when H is semisimple these G-actions\nare isometric for a metric induced by the Killing form of the Lie algebra of H.\nSome results have already been obtained in [15, 16] proving that suitable geometric\nconditions imply that such G-actions are of the double coset type. We refer to\n[2, 3, 9] for similar related results.\nIn this work we observe, that for M complete and weakly irreducible with the\nG-action non-transitive but with a dense orbit, the dimension of M has a bound\nfrom below in terms of the representation theoretic properties of g, the Lie algebra\nof G. More precisely, it is noted in Proposition 1.6 that in this case we have\ndim(M ) ≥ dim(G) + m(g),\n\nwhere m(g) denotes the dimension of the smallest non-trivial representation of g\nthat admits an invariant non-degenerate symmetric bilinear form. Recall that a\nconnected pseudo-Riemannian manifold is weakly irreducible if the tangent space\nat some (and hence any) point has no proper non-degenerate subspaces invariant\nunder the restricted holonomy group at that point.\n1991 Mathematics Subject Classification. 57S20, 53C50, 53C24.\nKey words and phrases. Pseudo-Riemannian manifolds, simple Lie groups, rigidity results.\nThe first author was supported by DMS grants 0402068 and 0801010.\nThe second author was supported by Conacyt, Concyteg and SNI.\n1\n\n\f2\n\nGESTUR OLAFSSON AND RAUL QUIROGA-BARRANCO\n\nf 0 (p, q),\nFor our main result, we consider with further detail the case G = SO\nf 0 (p, q)-actions with p, q ≥ 1 and\nthe universal covering group of SO0 (p, q). For SO\np + q ≥ 4, the following result establishes that the lower bound just considered can\nbe achieved only for double coset models. Note that for a G-action on a manifold\nM and X in the Lie algebra of G we denote by X ∗ the vector field on M whose oneparameter group of diffeomorphisms is given by (exp(tX))t through the G-action\non M .\nMain Theorem. Let M be a connected analytic pseudo-Riemannian manifold.\nSuppose that M is complete weakly irreducible, has finite volume and admits an\nf 0 (p, q)-action with a dense orbit, for some integers p, q\nanalytic and isometric SO\nsuch that p, q ≥ 1 and n = p + q ≥ 5. In this case we have m(so(p, q)) = n. If the\nequality:\nf 0 (p, q)) + m(so(p, q)) = n(n + 1) ,\ndim(M ) = dim(SO\n2\nf 0 (p, q + 1) or SO\nf 0 (p + 1, q) there exist:\nholds, then for H either SO\n(1) a lattice Γ ⊂ H, and\n(2) an analytic finite covering map φ : H/Γ → M ,\nf 0 (p, q)-equivariant, where the SO\nf 0 (p, q)-action on H/Γ is induced\nsuch that φ is SO\nf\nby some non-trivial homomorphism SO0 (p, q) → H. Furthermore, we can rescale\nf 0 (p, q)-orbits and their normal bundle to assume that\nthe metric on M along the SO\nφ is a local isometry for the bi-invariant pseudo-Riemannian metric on H given by\nthe Killing form of its Lie algebra. The result holds for the case (p, q) = (3, 1) as\nwell if we further assume that X ∗ ⊥ Y ∗ on M for all X ∈ su(2) and Y ∈ isu(2)\nunder the identification so(3, 1) ≃ sl(2, C).\n\nNote that there is no R-rank restriction, and so this result applies to the groups\nf 0 (p, 1) when p ≥ 3. Thus, the Main Theorem provides a rigidity result for\nSO\nSO0 (p, 1)-actions.\nThe proof of the Main Theorem is based on the application of representation\ntheory to the Killing vector fields centralizing the G-action, where the latter are\nas found in Gromov-Zimmer's machinery (see [10, 22]). With respect to centralizing Killing fields, our main ingredient is Proposition 1.2 as already found in\n[7, 10, 16, 22] with varying assumptions on the manifold M acted upon by G.\nProposition 1.2 ensures the existence of a Lie algebra g(x), isomorphic to g, of\nKilling fields vanishing at a point x on the universal cover of M and with some\nadditional properties. The Lie algebra g(x) provides a g-module structure to the\ntangent space Tx M that allows to use representation theory to control the behavior\nof the normal to the orbits. Such g-module structure is then related to the Lie\nalgebra H of Killing vector fields centralizing the G-action (see Lemma 1.8), thus\nagain providing control on H. By Gromov-Zimmer's machinery, the Lie algebra of\nH has an open dense orbit in the universal covering space of M . Also, the Lie algebra H yields a Lie group action constructed in Section 1. These elements together\nallow to obtain a very detailed description of the structure of H, which is provided\nin Section 2. Here again, the application of representation theory is a key element.\nFinally, Section 3 completes the proof of the Main Theorem using the Lie group\naction induced by H and the weak irreducibility assumption on M . Some needed\nfacts about the Lie algebra so(p, q) are collected in Appendix A. We will use the\nnotation from the introduction and the Appendix without further comments.\n\n\fON LOW-DIMENSIONAL MANIFOLDS WITH ISOMETRIC SO0 (p, q)-ACTIONS\n\n3\n\n1. Isometric actions of simple Lie groups and Killing fields\nIn this section, we let G be a connected non-compact simple Lie group with Lie\nalgebra g and M a connected finite volume pseudo-Riemannian manifold. Hence,\nevery isometric G-action on M with a dense orbit is locally free (see [17, 19]) and so\nthe orbits define a foliation that we will denote with O. The bundle T O tangent to\nthe foliation O is a trivial vector bundle isomorphic to M ×g, under the isomorphism\nM × g → T O given by (x, X) 7→ Xx∗ . This also defines an isomorphism of every\nfiber Tx O with g. We will refer to it as the natural isomorphism between Tx O and\ng. Recall that, as before and in the rest of this article, for X in the Lie algebra\nof a group acting on a manifold, we denote by X ∗ the vector field on the manifold\nwhose one-parameter group of diffeomorphisms is given by (exp(tX))t through the\naction on the manifold. On the other hand, we will have the occasion to consider\nboth left and right actions and so our convention is to assume that an action is on\nthe left unless otherwise specified.\nFor any given pseudo-Riemannian manifold N , we will denote by Kill(N ) the\nglobally defined Killing vector fields of N . Also, we denote by Kill0 (N, x) the Lie\nalgebra of globally defined Killing vector fields that vanish at the given point x.\nThe following result is an easy application of the Jacobi identity and the fact that\nKilling vector fields are derivations of the corresponding metric. Also note that,\nin the rest of this work, for a vector space W with a non-degenerate symmetric\nbilinear form, we will denote with so(W ) the Lie algebra of linear maps on W that\nare skew-symmetric with respect to the bilinear form.\nLemma 1.1. Let N be a pseudo-Riemannian manifold and x ∈ N . Then, the map\nλx : Kill0 (N, x) → so(Tx N ) given by λx (Z)(v) = [Z, V ]x , where V is any vector\nfield such that Vx = v, is a well defined homomorphism of Lie algebras.\nFor any given point x of a pseudo-Riemannian manifold, the map λx will denote\nfrom now on the homomorphism from the previous lemma.\nGromov [10] proved that the presence of a geometric structure of finite type (in\nthe sense of Cartan) which is invariant under the action of a simple Lie group yields\nlarge spaces of Killing vector fields fixing given points in the manifold being acted\nupon. We refer to [22] for a detailed description of these techniques. The statement\nbelow in the case of germs of Killing fields is essentially contained in Section 9 of\n[7] (see also Proposition 2.3 in [16]). From this, the result for global Killing vector\nf is analytic and simply connected (see [7, 10, 22]).\nfields is straightforward since M\nObserve that, following our notation with M , we denote with O the foliation by\ne\nf.\nG-orbits\nin M\nProposition 1.2. Let G be a connected non-compact simple Lie group acting isometrically and with a dense orbit on a connected finite volume pseudo-Riemannian\ne\nf lifted from the G-action on M . Assume\nmanifold M . Consider the G-action\non M\nthat M and the G-action on M are both analytic. Then, there exists a conull subset\nf such that for every x ∈ S the following properties are satisfied:\nS⊂M\nf) which is an isomorphism onto\n(1) there is a homomorphism ρx : g → Kill(M\nits image ρx (g) = g(x).\nf, x), i.e. every element of g(x) vanishes at x.\n(2) g(x) ⊂ Kill0 (M\n(3) For every X, Y ∈ g we have:\n[ρx (X), Y ∗ ] = [X, Y ]∗ = −[X ∗ , Y ∗ ].\n\n\f4\n\nGESTUR OLAFSSON AND RAUL QUIROGA-BARRANCO\n\nIn particular, the elements in g(x) and their corresponding local flows preserve both O and T O⊥ .\nf) induces a g(4) The homomorphism of Lie algebras λx ◦ ρx : g → so(Tx M\nf for which the subspaces Tx O and Tx O⊥ are gmodule structure on Tx M\nsubmodules.\nWith the above setup, assume that the G-orbits are non-degenerate which, from\nnow on, is considered with respect to the ambient pseudo-Riemannian metric. In\ne\nf are non-degenerate as well and we have a direct sum\nparticular, the G-orbits\non M\nf\ndecomposition T M = T O ⊕ T O⊥ . Hence, we can consider the g-valued 1-form ω\nf → Tx O ∼\nf which is given, at every x ∈ M\nf, by the composition Tx M\non M\n= g of the\nnatural projection onto Tx O and the natural isomorphism of this latter space with\ng. Also, consider the g-valued 2-form given by Ω = dω|∧2 T O⊥ . The following result\nis elementary and a proof can be found in [16].\nLemma 1.3. Let G, M and S be as in Proposition 1.2. If we assume that the\nG-orbits are non-degenerate, then:\nf → g and Ωx : ∧2 Tx O⊥ → g are both\n(1) For every x ∈ S, the maps ωx : Tx M\nhomomorphisms of g-modules, for the g-module structures from Proposition 1.2.\n(2) The normal bundle T O⊥ is integrable if and only if Ω = 0.\nThe non-degeneracy of the orbits is ensured for low dimensional manifolds by\nthe next result, which appears in [16] as Lemma 2.7.\nLemma 1.4. Let G be a connected non-compact simple Lie group acting isometrically and with a dense orbit on a connected finite volume pseudo-Riemannian\nmanifold M . If dim(M ) < 2 dim(G), then the bundles T O and T O⊥ have fibers\nthat are non-degenerate with respect to the metric on M .\nIt turns out that for complete manifolds, if the G-orbits are non-degenerate and\nthe normal bundle to such orbits is integrable, then the universal covering space\ncan be split. Such a claim is the content of the following proposition which is a\nparticular case of Theorem 1.1 of [16]. This result is in the spirit of similar ones\nfound in [5, 6, 10].\nProposition 1.5. Let G be a connected non-compact simple Lie group acting isometrically on a connected complete finite volume pseudo-Riemannian manifold M .\nIf the tangent bundle to the orbits T O has non-degenerate fibers and the bundle\ne × N → M where\nT O⊥ is integrable, then there is an isometric covering map G\ne and with N a\nthe domain has the product metric for a bi-invariant metric on G\ncomplete pseudo-Riemannian manifold.\nAs a consequence, we obtain a lower bound on the dimension of M .\nProposition 1.6. Let M be a connected analytic pseudo-Riemannian manifold and\nG a connected non-compact simple Lie group. Suppose that M is complete weakly\nirreducible, has finite volume and admits an analytic isometric non-transitive Gaction with a dense orbit. Then:\ndim(M ) ≥ dim(G) + m(g),\n\nwhere m(g) is the dimension of the smallest non-trivial representation of g that\nadmits an invariant non-degenerate symmetric bilinear form.\n\n\fON LOW-DIMENSIONAL MANIFOLDS WITH ISOMETRIC SO0 (p, q)-ACTIONS\n\n5\n\nProof. Suppose that dim(M ) < dim(G) + m(g). Since m(g) ≤ dim(G) (the Killing\nform defines an inner product), by Lemma 1.4 the bundle T O⊥ has non-degenerate\nfibers with dimension < m(g). Hence, the definition of m(g) implies that Tx O⊥ is a\ntrivial g-module for the structure defined by Proposition 1.2(4). Hence, Lemma 1.3\nyields the integrability of T O⊥ , and Proposition 1.5 contradicts the irreducibility\nof M .\n\u0003\nf endowed with the G-action\ne\nFor a G-action as in Proposition 1.2, consider M\nobtained by lifting the G-action on M . With such setup, let us denote by H the\nf) consisting of the fields that centralize the G-action\ne\nLie subalgebra of Kill(M\non\nf\nM . The next result provides an embedding of g into H that allows us to apply\nrepresentation theory to study the structure of H. We observe that this statement\nis at the core of Gromov-Zimmer's machinery on the study of actions preserving\ngeometric structures (see [10, 22]).\nLemma 1.7. Let S be as in Proposition 1.2. Then, for every x ∈ S and for ρx\nf) given by:\ngiven as in Proposition 1.2, the map ρbx : g → Kill(M\nρb(X) = ρx (X) + X ∗ ,\n\nis an injective homomorphism of Lie algebras whose image G(x) lies in H. In\nparticular, ρbx induces on H a g-module structure such that G(x) is a submodule\nisomorphic to g.\n\nProof. First, observe that the identity in Proposition 1.2(3) is easily seen to imply\nthat the image of ρbx lies in H.\nTo prove that ρbx is a homomorphism of Lie algebras we apply Proposition 1.2(3)\nas follows for X, Y ∈ g:\n[b\nρx (X), ρbx (Y )] = [ρx (X) + X ∗ , ρx (Y ) + Y ∗ ]\n\n= [ρx (X), ρx (Y )] + [ρx (X), Y ∗ ] + [X ∗ , ρx (Y )] + [X ∗ , Y ∗ ]\n= ρx ([X, Y ]) + [X, Y ]∗ + [X, Y ]∗ + [X ∗ , Y ∗ ]\n= ρx ([X, Y ]) + [X, Y ]∗\n= ρbx ([X, Y ]).\n\nFor the injectivity of ρbx we observe that ρbx (X) = 0 implies Xx∗ = (ρx (X) + X ∗ )x =\n0, which in turns yields X = 0 because the G-action is locally free. The last claim\nis now clear.\n\u0003\nf.\nWe can now relate the g-module structure of H to that of Tx M\n\nf and H endowed with\nLemma 1.8. Let S be as in Proposition 1.2. Consider Tx M\nthe g-module structures given by Proposition 1.2(4) and Lemma 1.7, respectively.\nThen, for every x ∈ S, the evaluation map:\nf, Z 7→ Zx ,\nevx : H → Tx M\nis a homomorphism of g-modules that satisfies evx (G(x)) = Tx O. Furthermore, for\nf.\nalmost every x ∈ S we have evx (H) = Tx M\nProof. For every x ∈ S, if we let Z ∈ H and X ∈ g be given, then:\nevx (X * Z) = [b\nρx (X), Z]x = [ρx (X) + X ∗ , Z]x\n\n= [ρx (X), Z]x = X * Zx = X * evx (Z)\n\n\f6\n\nGESTUR OLAFSSON AND RAUL QUIROGA-BARRANCO\n\nwhere we have used Lemma 1.1 and the definition of the g-module structures involved, thus proving the first part. The last claim follows by an easy adaptation of\nthe proof of Lemma 4.1 of [23], which establishes the transitivity of H on an open\nf.\nconull dense subset of M\n\u0003\n\nTo study in the following sections those G-actions for which T O⊥ is non-integrable\nwe will need to use some known results that relate isometries with Killing fields for\ncomplete manifolds. First, we have the following result, which follows from the\nrigidity (in the sense of [10]) of pseudo-Riemannian metrics and their basic properties.\nLemma 1.9. Let N be an analytic pseudo-Riemannian manifold. Then, every\nKilling vector field of N , either local or global, is analytic. In particular, the isometry group Iso(N ) acts analytically on N.\nBy Proposition 30 of Chapter 9 from [13], on a complete pseudo-Riemannian\nmanifold every global Killing vector field is complete. Hence, Proposition 33 of\nChapter 9 from [13] has the following immediate consequence.\nLemma 1.10. Let N be a complete pseudo-Riemannian manifold and suppose that\nthe action of its isometry group Iso(N ) is considered on the left. If Iso(N ) denotes\nthe Lie algebra of Iso(N ), then the map:\nIso(N ) → Kill(N ),\n\nX 7→ X ∗ ,\n\nis an anti-isomorphism of Lie algebras. In particular, [X, Y ]∗ = −[X ∗ , Y ∗ ] for\nevery X, Y ∈ Iso(N ).\n\nWe now use the above to prove that on a complete manifold every Lie algebra\nof Killing fields can be realized from an isometric right action.\n\nLemma 1.11. Let N be a complete pseudo-Riemannian manifold and H a simply\nconnected Lie group with Lie algebra h. If ψ : h → Kill(N ) is a homomorphism of\nLie algebras, then there exists an isometric right H-action N × H → N such that\nψ(X) = X ∗ , for every X ∈ h. Furthermore, if N is analytic, then the H-action is\nanalytic as well.\nProof. Consider the map α : Iso(N ) → Kill(N ) given by α(Y ) = −Y ∗ , which\nis an isomorphism of Lie algebras by Lemma 1.10. Let Ψ : H → Iso(N ) be the\nhomomorphism of Lie groups induced by the homomorphism α−1 ◦ ψ : h → Iso(n).\nThis yields a smooth isometric right H-action given by:\nN × H → N,\n\n(n, h) 7→ nh = Ψ(h−1 )(n).\n\nFor X ∈ h there is Y ∈ Iso(N ) such that ψ(X) = −α(Y ) = Y ∗ . Hence, for the\nright H-action one computes X ∗ at every p ∈ N as follows:\nd\nd\np exp(tX) =\nΨ(exp(−tX))(p)\nXp∗ =\ndt t=0\ndt t=0\nd\nd\n=\nexp(−t(α−1 ◦ ψ)(X))p =\nexp(tY )p\ndt t=0\ndt t=0\n= Yp∗ = ψ(X)p ,\nwhich proves the first part of the lemma. Note that the first and second to last\nidentities use the definition of Z ∗ for the right H-action and the left Iso(N )-action,\nrespectively. Finally, the last part of our statement follows from the last claim of\nLemma 1.9.\n\u0003\n\n\fON LOW-DIMENSIONAL MANIFOLDS WITH ISOMETRIC SO0 (p, q)-ACTIONS\n\n7\n\nf 0 (p, q)-actions for\n2. Structure of the centralizer of isometric SO\nlow dimensional M and non-integrable T O⊥\nFor n ∈ Z+ let p, q ∈ Z+ be such that p + q = n and\n\u0013\n\u0012\nIp\n0\n.\nIp,q =\n0 −Iq\nThen, so(p, q) is the Lie algebra of linear transformations of Rn that are antisymmetric with respect to the inner product h*, *ip,q on Rn defined by Ip,q , SOo (p, q)\nf 0 (p, q) its\ndenotes the connected group of isometries with respect to h*, *i and SO\np,q\n\nuniversal covering group. We let Rp,q denote the so(p, q)-module defined by the\nnatural representation of so(p, q) in Rn . Denote by C + and C − the so(4, 4)-modules\ngiven by real forms of the two half spin representations of so(8, C). We refer to C +\nand C − as the half spin representations of so(4, 4).\nIn preparation for the proof of the Main Theorem, we assume in this section\nthat M is a connected finite volume analytic pseudo-Riemannian manifold with\ndim(M ) = n(n + 1)/2. We assume that p + q ≥ 5 or (p, q) = (3, 1). We also\nf 0 (p, q) acts analytically, isometrically and with a dense orbit on M .\nassume that SO\nIn particular, by Lemma 1.4 we have the direct sum T M = T O ⊕ T O⊥ . Also note\nthat T O⊥ has rank n. Finally, we also assume in the rest of this section that the\nbundle T O⊥ is non-integrable.\nf 0 (p, q)-action on M can be lifted to M\nf, thus inducing a direct\nAs before, the SO\n⊥\nf\nsum decomposition T M = T O ⊕ T O as a consequence of the corresponding propf whose leaves are the orbits\nerty for M . Again, we denote with O the foliation in M\nf 0 (p, q)-action on M\nf.\nfor the SO\nf)\nIn the rest of this work we will denote with H the Lie subalgebra of Kill(M\nf 0 (p, q)-action. In particular, there is\nconsisting of the fields that centralize the SO\na set S as in Proposition 1.2 for which Lemmas 1.7 and 1.8 hold. We will now see\nthat our hypotheses allow to provide a precise description of the so(p, q)-module\nstructures obtained through these results from the previous section.\nLemma 2.1. Let S be as in Proposition 1.2. Consider Tx O⊥ endowed with the\nso(p, q)-module structure given by Proposition 1.2(4). Then, for almost every x ∈ S:\n(1) for (p, q) 6= (4, 4), the so(p, q)-module Tx O⊥ is isomorphic to Rp,q , and\n(2) for p = q = 4, the so(4, 4)-module Tx O⊥ is isomorphic to either R4,4 , C +\nor C − .\n\nIn particular, so(Tx O⊥ ) is isomorphic to so(p, q) as a Lie algebra and as a so(p, q)module, for almost every x ∈ S.\nProof. By Lemma 1.3(2) and since we are assuming that T O⊥ is non-integrable,\nthe 2-form Ω considered in its statement is non-zero. This 2-form is clearly analytic\nf which is necessarily null.\nand thus it vanishes at a proper analytic subset of M\nHence, Ωx 6= 0 for almost every x ∈ S. Let us choose and fix x ∈ S such that\nΩx 6= 0; we will prove that the conclusions of the statement hold for such x.\nLemma 1.3(1) implies that the map Ωx : ∧2 Tx O⊥ → so(p, q) is a homomorphism\nof so(p, q)-modules, which is then non-trivial by our choice of x. Since dim(Tx O⊥ ) =\nn and because so(p, q) is an irreducible module, it follows that Ωx is an isomorphism.\nThen, the irreducibility of so(p, q) implies that Tx O⊥ is irreducible as well.\n\n\f8\n\nGESTUR OLAFSSON AND RAUL QUIROGA-BARRANCO\n\nBy Lemma A.1 it follows that Tx O⊥ ≃ Rp,q except for the cases given by the\nLie algebras so(3, 1) and so(4, 4). For these Lie algebras the other possibilities are\nC2R for so(3, 1), and real forms C + and C − of the two half spin representations of\nso(8, C), for the case of so(4, 4).\nLet us consider the case of so(3, 1). If (π, V ) is a G-module and χV = tr ◦ \u0001π\nis its character, then for every g ∈ G we have χ∧2 V (g) = 12 χV (g)2 − χV (g 2 ) .\nFor our setup, we need to determine\nfor which of V ≃ R3,1 or V ≃ C2R we have\n\u0001\n1\n2\n2\nχso(3,1) (g) = 2 χV (g) − χV (g ) . A simple calculation using\n\n\ncosh(t) 0 sinh(t)\nI2\n0 \ng= 0\nsinh(t) 0 cosh(t)\nshows that the above holds only for V ≃ R3,1 , and so Tx O⊥ ≃ R3,1 .\nFor the final claim, we observe that the representation of so(p, q) on Tx O⊥ defines\na non-trivial homomorphism so(p, q) → so(Tx O⊥ ). Since so(p, q) is simple, the\nlatter is injective and so it is an isomorphism.\n\u0003\n\nThe previous results allow us to obtain the following decomposition of the cenf 0 (p, q)-action into submodules related to the geometric structure\ntralizer H of the SO\nf\non M .\n\nLemma 2.2. Let S be as in Proposition 1.2. Then, for almost every x ∈ S and for\nthe so(p, q)-module structure on H from Lemma 1.7 there is a decomposition into\nso(p, q)-submodules H = G(x) ⊕ H0 (x) ⊕ V(x), satisfying:\n(1) G(x) = ρbx (so(p, q)) is a Lie subalgebra of H isomorphic to so(p, q) and\nevx (G(x)) = Tx O.\n(2) H0 (x) = ker(evx ), which is either 0 or a Lie subalgebra of H isomorphic\nto so(p, q). In the latter case, H0 (x) is also isomorphic to so(p, q) as a\nso(p, q)-module.\n(3) evx (V(x)) = Tx O⊥ and\n(a) for (p, q) 6= (4, 4), V(x) is isomorphic to Rp,q as so(p, q)-module,\n(b) for p = q = 4, V(x) is isomorphic to either R4,4 , C + or C − as so(4, 4)module.\nIn particular, the evaluation map evx defines an isomorphism of so(p, q)-modules\nf = Tx O ⊕ Tx O⊥ preserving the summands in that order.\nG(x) ⊕ V(x) → Tx M\n\nProof. Note that the conclusions of both Lemmas 1.8 and 2.1 are satisfied for\nalmost every x ∈ S. Let us choose and fix one such point x ∈ S. By Lemma 1.7, we\nconclude that G(x) = ρbx (so(p, q)) is indeed a Lie subalgebra isomorphic to so(p, q).\nDefine H0 (x) = ker(evx ). By Lemma 1.8, it follows that H0 (x) is an so(p, q)f, x) it follows that it is a\nsubmodule of H. Moreover, since H0 (x) = H ∩ Kill0 (M\nLie subalgebra as well.\nOn the other hand, the elements of G(x) are of the form ρx (X) + X ∗ , with\nX ∈ so(p, q), where ρx is the Lie algebra homomorphism from Proposition 1.2.\nHence, for any such element we have evx (ρx (X) + X ∗ ) = Xx∗ ; in particular, the\ncondition evx (ρx (X) + X ∗) = 0 implies X = 0. In other words, G(x) ∩ H0 (x) = {0}.\nHence, there exists an so(p, q)-submodule V ′ (x) complementary to G(x) ⊕ H0 (x)\nin H. In particular, evx restricted to G(x) ⊕ V ′ (x) is an isomorphism of so(p, q)f. Hence, if we choose V(x) as the inverse image of Tx O⊥ under\nmodules onto Tx M\n\n\fON LOW-DIMENSIONAL MANIFOLDS WITH ISOMETRIC SO0 (p, q)-ACTIONS\n\n9\n\nthis isomorphism, then we have the required decomposition into so(p, q)-submodules\nexcept for the properties of H0 (x), which we now proceed to consider.\nf, x, O) be the Lie algebra of Killing vector fields on M\nf that preserve\nLet Kill0 (M\nf, x, O)\nthe foliation O and that vanish at x. Hence, every Killing field in Kill0 (M\n⊥\nleaves invariant the normal bundle T O , and so the map λx from Lemma 1.1\ninduces a homomorphism of Lie algebras:\n⊥\nf\nλ⊥\nx : Kill0 (M , x, O) → so(Tx O ),\n\nX 7→ λx (X)|Tx O⊥ .\n\nWe observe that both Lie algebras ρx (so(p, q)) = so(p, q)(x) and H0 (x) lie inside of\nf, x, O). A number of properties for the restriction of λ⊥ to so(p, q)(x) and\nKill0 (M\nx\nH0 (x) will imply the needed conditions on H0 (x).\nClaim 1: λ⊥\nx restricted to H0 (x) is injective. We recall that a Killing vector field\nis completely determined by its 1-jet at x; this is a consequence of the fact that\npseudo-Riemannian metrics are 1-rigid (see [7, 10]). If Z ∈ H0 (x) is given, then\nZx = 0 and so it is completely determined by the values of [Z, V ]x for V a vector\nfield in a neighborhood of x. On the other hand [Z, X ∗ ]x = 0 for X ∈ so(p, q) and\nso [Z, V ]x = 0 whenever Vx ∈ Tx O. We conclude that Z is completely determined\nby the values of [Z, V ]x for V such that Vx ∈ Tx O⊥ . In other words, [Z, V ]x = 0\nfor every Vx ∈ Tx O⊥ implies Z = 0. This yields the injectivity of λ⊥\nx on H0 (x).\n⊥\nClaim 2: λ⊥\n(so(p,\nq)(x))\n=\nso(T\nO\n).\nBy\nProposition\n1.2(4),\nthe\nvector space\nx\nx\nTx O⊥ has a so(p, q)-module structure induced from the homomorphism λ⊥\nx ◦ρx . By\nour choice of x and Lemma 2.1 such module structure is in fact non-trivial. Hence,\n⊥\nλ⊥\nx ◦ ρx : so(p, q) → so(Tx O ) is non-trivial as well and so it is injective. But then\nit has to be surjective because the domain and target have the same dimensions.\n⊥\n⊥\nClaim 3: λ⊥\nx (H0 (x)) is an ideal in so(Tx O ). Let Z ∈ H0 (x) and T ∈ so(Tx O )\n⊥\nbe given. Then, by Claim 2, there is some X ∈ so(p, q) such that T = λx (ρx (X)).\nFor every local vector field V such that Vx ∈ Tx O⊥ we have:\n⊥\n⊥\n[T, λ⊥\nx (Z)](Vx ) = [λx (ρx (X)), λx (Z)](Vx ) = [ρx (X), [Z, V ]]x − [Z, [ρx (X), V ]]x\n\n= [[ρx (X), Z], V ]x = [[ρx (X) + X ∗ , Z], V ]x = [[b\nρx (X), Z], V ]x .\n\nSince the so(p, q)-module structure on H is defined by ρbx and H0 (x) is a submodule\nof such structure, we have [b\nρx (X), Z] ∈ H0 (x), and so the last formula proves that\n⊥\n[T, λ⊥\n(Z)]\n=\nλ\n([b\nρ\n(X),\nZ]),\nthus showing the claim.\nx\nx\nx\nClaim 1 shows that H0 (x) is a Lie algebra isomorphic to its image in so(Tx O⊥ )\n⊥\nunder λ⊥\nx . Such image is by Claim 3 an ideal of so(Tx O ). By our choice of x\n⊥\nand Lemma 2.1, the Lie algebra so(Tx O ) is isomorphic to so(p, q), which is simple\nsince n ≥ 4 and (p, q) 6= (2, 2). This implies that H0 (x) is either 0 or isomorphic to\nso(p, q) as a Lie subalgebra of H.\nOn the other hand, for X ∈ so(p, q) and Z ∈ H0 (x), considering the definitions\nof the so(p, q)-module structures involved we have:\n⊥\nλ⊥\nρx (X), Z]) = λ⊥\nx (X * Z) = λx ([b\nx ([ρx (X), Z])\n\n⊥\n⊥\n= [λ⊥\nx (ρx (X)), λx (Z)] = X * λx (Z),\n\nwhere the second identity holds by the definition of ρbx in terms of ρx and bef 0 (p, q)-action. But this last relation shows that λ⊥\ncause H0 (x) centralizes the SO\nx\nrestricted to H0 (x) is a homomorphism of so(p, q)-modules. By Lemma 2.1 we\nconclude that H0 (x) is either 0 or isomorphic to so(p, q) as a so(p, q)-module. \u0003\n\n\f10\n\nGESTUR OLAFSSON AND RAUL QUIROGA-BARRANCO\n\nWe now obtain a description of the Lie algebra structure of the centralizer H.\nLemma 2.3. Let S be as in Proposition 1.2. With the notation from Lemma 2.2,\none of the following conditions is satisfied for almost every x ∈ S:\n(1) The radical rad(H) of H is Abelian and rad(H) = V(x).\n(2) H0 (x) 6= {0} and H is the sum of two simple ideals one of them being\nH0 (x) ⊕ V(x).\n(3) H0 (x) = {0} and H = G(x) ⊕ V(x) is isomorphic as a Lie algebra to either\nso(p, q + 1) or so(p + 1, q).\nProof. For this proof let us choose and fix x ∈ S satisfying the conclusions of\nLemmas 1.7, 1.8, 2.1 and 2.2.\nNote that G(x) ⊕ H0 (x) is a Lie subalgebra with H0 (x) as an ideal because\n[G(x), H0 (x)] ⊂ H0 (x) as a consequence of Lemmas 1.7 and 2.2. Since G(x), H0 (x)\nare both isomorphic to so(p, q) if H0 (x) 6= {0}, we conclude that G(x) ⊕ H0 (x) is\nsemisimple. Furthermore, this implies that G(x) ⊕ H0 (x) is isomorphic to either\nso(p, q) or so(p, q) ⊕ so(p, q) according to whether H0 (x) is zero or not, respectively.\nChoose a Levi factor s of H that contains the Lie subalgebra G(x) ⊕ H0 (x).\nSince the so(p, q)-module structure of H is defined by the Lie subalgebra G(x) (see\nLemma 1.7), it follows that s is an so(p, q)-submodule of H. Let W be an so(p, q)submodule of H such that s = G(x) ⊕ H0 (x) ⊕ W . Since rad(H) is an ideal, this\ninduces the following decomposition of H as a direct sum of so(p, q)-submodules:\nH = G(x) ⊕ H0 (x) ⊕ W ⊕ rad(H).\nFrom this decomposition of so(p, q)-modules, as well as Lemmas 1.7 and 2.2, we\nconclude that one of the following holds:\n(a) s = G(x) ⊕ H0 (x) and rad(H) = V(x), or\n(b) rad(H) = {0} and so H is semisimple.\nLet us assume that case (a) holds. Then, the Lie brackets of H restricted to\n∧2 V(x) define, by the Jacobi identity and Lemma 1.7, a homomorphism of so(p, q)modules ∧2 V(x) → V(x). This homomorphism is necessarily trivial since V(x)\nis n-dimensional, ∧2 V(x) ≃ so(p, q) is irreducible and n ≥ 4. This shows that\nV(x) = rad(H) is Abelian and yields (1) from our statement.\nLet us now assume that case (b) holds, and write H = h1 × * * * × hk a direct product of simple ideals. Since each such ideal is invariant by G(x), it is an\nso(p, q)-submodule, and so it follows that k ≤ 3 since the decomposition of H from\nLemma 2.2 has at most 3 irreducible summands. Moreover, if k = 3 we conclude\nthat, after reindexing the ideals, we have V(x) = h1 and G(x) ⊕ H(x) = h2 × h3 . In\nparticular, [G(x), V(x)] = {0} which implies that V(x) is a trivial so(p, q)-submodule\nand contradicts Lemma 2.2(3). Hence we can further assume that the number of\nsimple ideals of H is k ≤ 2.\nFirst suppose that H = h1 × h2 , the direct product of two simple ideals. If\nH0 (x) = {0}, then the decomposition of H from Lemma 2.2 has two irreducible\nsummands and we can reindex the ideals h1 , h2 to assume that h1 = G(x) and\nh2 = V(x). But this implies that [G(x), V(x)] = {0}, a contradiction. Hence we\nconclude that H0 (x) 6= {0} in the current case. In particular, H is the direct sum of\nthree irreducible so(p, q)-submodules. Hence, after decomposing h1 , h2 as the direct\nsum of irreducible so(p, q)-submodules, and reindexing if necessary, we can assume\nthat h1 is an irreducible so(p, q)-submodule and that h2 = V1 ⊕ V2 , where V1 , V2 are\n\n\fON LOW-DIMENSIONAL MANIFOLDS WITH ISOMETRIC SO0 (p, q)-ACTIONS\n\n11\n\nirreducible so(p, q)-submodules. By comparing the decomposition H = h1 ⊕V1 ⊕V2 ,\nwith the one from Lemma 2.2, we conclude that V(x) is either one of h1 , V1 or V2 .\nIf V(x) = h1 , then [V(x), V(x)] ⊂ V(x) and an argument used above shows that\nV(x) is Abelian, which contradicts the simplicity of h1 . Hence, without loss of\ngenerality, we can assume that V(x) = V2 , and so that G(x) ⊕ H0 (x) = h1 ⊕ V1 . In\nparticular, since V1 is a subspace of both of the Lie algebras G(x) ⊕ H0 (x) = h1 ⊕ V1\nand h2 = V1 ⊕ V2 it follows that [V1 , V1 ] ⊂ V1 , thus showing that V1 itself is a Lie\nalgebra. But since [h1 , V1 ] = {0}, this implies that the right-hand side of the sum:\nG(x) ⊕ H0 (x) = h1 ⊕ V1\n\nis the decomposition into simple ideals. Since H0 (x) is an ideal of G(x)⊕H0 (x), it is\neither h1 or V1 . If H0 (x) = h1 , then [H0 (x), V(x)] = {0}, which is in contradiction\nwith Claim 1 in the proof of Lemma 2.2 because evx (V(x)) = Tx O⊥ . Hence,\nH0 (x) = V1 and so H0 (x) ⊕ V(x) = h2 is a simple ideal of H, thus establishing\noption (2).\nFinally, let us assume that H is a simple Lie algebra. We will prove that in this\ncase (3) holds.\nLet us start by assuming that H0 (x) 6= {0}. Hence, from the above remarks, we\ncan write G(x) ⊕ H0 (x) = g1 ⊕ g2 , where g1 , g2 are ideals of G(x) ⊕ H0 (x) both\nisomorphic to so(p, q). Let V be a G(x) ⊕ H0 (x)-submodule of H such that:\nH = G(x) ⊕ H0 (x) ⊕ V.\n\nIn particular, V has dimension n. Moreover, V is necessarily a non-trivial g1 module, since otherwise g1 would be a proper ideal of H. Then, Lemma A.1 implies\nthat we can decompose V = V0 ⊕ V1 where V0 is a trivial g1 -module and V1 is an\nirreducible g1 -module. Note that this can be done so that V0 = {0}, except for\nthe cases given by so(3, 2) and so(3, 3) for which we can assume dim(V0 ) = 1 or\n2, respectively. In any case, this yields a decomposition of H into g1 -submodules\ngiven by:\nH = g1 ⊕ g2 ⊕ V0 ⊕ V1 .\nSince g1 and g2 commute with each other, then for every X ∈ g2 the map adH (X)\ndefines a g1 -module homomorphism of V and so preserves its summands corresponding to given isomorphism classes for the g1 -module structure. Hence, V0\nand V1 are g2 -modules as well, and by Lemma A.1 it follows that V0 is a trivial\ng2 -module, because dim(V0 ) ≤ 2. As before, V1 is a non-trivial g2 -module, since\notherwise g2 would be a proper ideal of H.\nThe above shows that adH restricted to G(x) ⊕ H0 (x) ≃ so(p, q) ⊕ so(p, q) leaves\ninvariant V1 and induces a representation:\nρ : so(p, q) ⊕ so(p, q) → sl(V1 ) ≃ sl(k, R),\nfor some k ≤ n, which is injective when restricted to each summand. Furthermore,\nρ(so(p, q)⊕{0}) and ρ({0}⊕so(p, q)) centralize each other, from which the simplicity\nof so(p, q) implies that ρ(so(p, q) ⊕ {0}) ∩ ρ({0} ⊕ so(p, q)) = {0}. In particular, ρ\nrealizes so(p, q) ⊕ so(p, q) as a Lie subalgebra of sl(k, R). Note that the codimension\nof so(p, q) ⊕ so(p, q) in sl(k, R) is k 2 − 1 − n(n − 1) ≤ n − 1.\nReplacing H with sl(k, R) and repeating these arguments, more than once if necessary, yields a non-trivial representation of so(p, q) with dimension strictly smaller\nthan the lower bound obtained in Lemma A.1 for irreducible non-trivial representations. This contradiction proves that H0 (x) = {0}.\n\n\f12\n\nGESTUR OLAFSSON AND RAUL QUIROGA-BARRANCO\n\nWith our assumption that H is simple we thus obtain H = G(x) ⊕ V(x). Hence,\nto conclude (3) it remains to show that H is isomorphic to either so(p, q + 1) or\nso(p + 1, q).\nRecall from the previous remarks that H = G(x) ⊕ V(x) is the decomposition\ninto irreducible so(p, q)-modules for an isomorphism G(x) ≃ so(p, q) of Lie algebras.\nFurthermore, either V(x) ≃ Rp,q as so(p, q)-modules or p = q = 4 and V(x) is\nisomorphic to one of C + or C − as so(4, 4)-modules. Let us first assume that the\nlatter case holds. Then, H is a 36-dimensional simple Lie algebra. Since there are no\nsimple complex Lie algebras of dimension 18, it follows that the complexification\nHC is a simple Lie algebra. Hence, a direct inspection of the simple complex\nLie algebras shows that HC is up to isomorphism either so(9, C) or sp(4, C). For\nHC ≃ so(9, C) we conclude that H ≃ so(5, 4) since it contains the Lie algebra\nG(x) ≃ so(4, 4). For the case HC ≃ sp(4, C) we obtain a non-trivial homomorphism\nso(8, C) ≃ G(x)C ⊂ HC ≃ sp(4, C), which yields an 8-dimensional so(8, C)-module,\nnon-trivial and so irreducible, with an invariant non-degenerate skew-symmetric\nform. The latter is a contradiction since every 8-dimensional irreducible so(8, C)module carries a unique (up to a constant) invariant non-degenerate symmetric\nform (see page 217 of [4]).\nHence, we can assume that V(x) ≃ Rp,q as so(p, q)-modules. Also, since the\nso(p, q)-module structure on H is induced by G(x), we have [G(x), V(x)] ⊂ V(x).\nOn the other hand, the Lie brackets and the projection H → V(x) define a homomorphism of so(p, q)-modules ∧2 V(x) → V(x), which is thus trivial. This implies\nthat [V(x), V(x)] ⊂ G(x). Hence, there exists a linear isomorphism:\nφ : H = G(x) ⊕ V(x) → so(p, q) ⊕ Rp,q ,\n\nthat preserves the summands in that order, that restricts to an isomorphism of\nLie algebras G(x) → so(p, q) and that defines an isomorphism of so(p, q)-modules.\nMoreover, we also have proved the relations:\n[G(x), G(x)] ⊂ G(x),\n\n[G(x), V(x)] ⊂ V(x),\n\n[V(x), V(x)] ⊂ G(x).\n\nNote that the last relation defines an isomorphism T : ∧2 V(x) → G(x) of G(x)modules; otherwise, V(x) would be a non-trivial Abelian ideal of H. Recall the map\nTc (u ∧ v) = c(hu, *ip,q v − hv, *ip,q u) from Lemma A.3. By Lemma A.3 and with\nrespect to the isomorphism φ, the map T is of the form Tc for some c ∈ R \\ {0},\nif n ≥ 5. Let us now assume that n ≥ 5. Hence, the Lie algebra structure on\nso(p, q) ⊕ Rp,q induced by φ is given by [*, *]c , as in Lemma A.8, for some c 6= 0,\nand so isomorphic to either so(p, q + 1) or so(p + 1, q). This shows that (3) holds\nwhen H is simple and (p, q) 6= (3, 1).\nFinally, consider the case (p, q) = (3, 1). Under such assumption, we have\ndim(H) = dim(G(x)) + dim(V(x)) = 10. Since there is no simple complex Lie\nalgebra of dimension 5 we conclude that HC is simple. Note that, up to isomorphism, so(5, C) is the only simple complex Lie algebra of complex dimension 10.\nFrom this we conclude that H is isomorphic to either so(4, 1) or so(3, 2) (the only\nnon-compact real forms of so(5, C) up to isomorphism) thus showing that (3) holds\nwhen H is simple and (p, q) = (3, 1).\n\u0003\n3. Proof of the Main Theorem\nIn this section we will assume the hypotheses of the Main Theorem. More precisely,\nwe assume that M is a connected analytic pseudo-Riemannian manifold which is\n\n\fON LOW-DIMENSIONAL MANIFOLDS WITH ISOMETRIC SO0 (p, q)-ACTIONS\n\n13\n\ncomplete weakly irreducible and has finite volume. We also assume that M admits\nf 0 (p, q)-action with a dense orbit for some integers p, q\nan analytic and isometric SO\nsuch that p, q ≥ 1 and n = p + q ≥ 5, or (p, q) = (3, 1). In the case (p, q) = (3, 1) we\nassume that X ∗ ⊥ Y ∗ on M for every X ∈ su(2) and Y ∈ isu(2). Finally we are\nassuming that dim(M ) = n(n + 1)/2 and we will consider the three cases provided\nby Lemma 2.3. For this we will use the notation from Section 2. Our first goal is to\nrule out cases (1) and (2) of Lemma 2.3, which is done in the next two subsections.\nThen, we obtain in the third subsection the conclusions of the Main Theorem when\ncase (3) of Lemma 2.3 holds.\n3.1. Case 1: The radical of H is non-trivial. We are assuming that the conf. We will see that this\nclusion (1) of Lemma 2.3 is satisfied for some fixed x0 ∈ M\nyields a contradiction with our assumptions on M .\nFirst note that H(x0 ) = G(x0 ) ⊕ V(x0 ) is a Lie subalgebra of H. This holds because V(x0 ) is Abelian and [G(x0 ), V(x0 )] ⊂ V(x0 ). Hence, G(x0 ) ⊕ V(x0 ) is isomorphic to the semidirect product Lie algebra so(p, q)⋉W , where W is an n-dimensional\nso(p, q)-module endowed with the Abelian Lie algebra structure. Choose a Lie algebra isomorphism ψ : so(p, q) ⋉ W → H(x0 ) that maps so(p, q) onto G(x0 ) and W\nonto V(x0 ).\nf 0 (p, q) ⋉ W the Lie group structure on SO\nf 0 (p, q) × W with\nLet us denote with SO\nthe semidirect product given by:\n(A, v) * (B, w) = (AB, B −1 v + w),\n\nf 0 (p, q) on W induced by that\nwhere we are considering the representation of SO\nf 0 (p, q) ⋉ W is so(p, q) ⋉ W . By\nof so(p, q). In particular, the Lie algebra of SO\nf 0 (p, q) ⋉ W on\nLemma 1.11, there exists an analytic isometric right action of SO\n∗\nf\nM such that ψ(X) = X for every X ∈ so(p, q) ⋉ W . Since H centralizes the left\nf 0 (p, q)-action, then the right SO\nf 0 (p, q) ⋉ W -action centralizes the left SO\nf 0 (p, q)SO\naction as well and so it preserves both T O and T O⊥ .\nf 0 (p, q) ⋉ W )-action, let us now consider the map:\nUsing the right (SO\nf 0 (p, q) ⋉ W → M\nf,\nf : SO\n\nh 7→ x0 h,\n\nf 0 (p, q) ⋉ W )-equivariant for the right action on its domain. In\nwhich is clearly (SO\nf 0 (p, q). Then, df(I,0)\nwhat follows, we will denote with I the identity element in SO\nis the composition:\nf\nso(p, q) ⋉ W → G(x0 ) ⊕ V(x0 ) → Tx0 M\nX 7→ X ∗ 7→ Xx∗0 .\n\nHence by the property ψ(X) = X ∗ (X ∈ so(p, q)⋉ W ) and Lemma 2.2, df(I,0) maps\nso(p, q) onto Tx0 O and W onto Tx0 O⊥ . In particular, f is a local diffeomorphism\nat (I, 0).\nf 0 (p, q) ⋉ W\nFor every w ∈ W , denote with Rw the transformations on both SO\nf given by the assignment x 7→ x(I, w). In particular, a straightforward\nand M\ncomputation shows that we have:\nf 0 (p, q) ⋉ W ) → T(I,v+w) (SO\nf 0 (p, q) ⋉ W )\nd(Rw )(I,v) : T(I,v) (SO\n(X, Yv ) 7→ (X, Yv+w ).\n\n\f14\n\nGESTUR OLAFSSON AND RAUL QUIROGA-BARRANCO\n\nf 0 (p, q) ⋉ W .\nAlso note that Rw (I × W ) = I × W , since W is a subgroup of SO\nf in a neighborhood of\nLet N = f (I × W ), which defines a submanifold of M\nx0 = f (I, 0). By the above remarks on df(I,0) we have:\nTf (I,0) N = df(I,0) (T(I,0) (I × W )) = Tf (I,0) O⊥ .\nBut then, the equivariance of f yields:\nTf (I,w)N = df(I,w) (T(I,w) (I × W )) = df(I,w) (d(Rw )(I,0) (T(I,0) (I × W )))\n= d(Rw ◦ f )(I,0) (T(I,0) (I × W ))) = d(Rw )f (I,0) (Tf (I,0) N )\n\n= d(Rw )f (I,0) (Tf (I,0) O⊥ ) = TRw (f (I,0)) O⊥ = Tf (I,w) O⊥ ,\n\nf the bundle\nwhere we have used in the second to last identity that Rw preserves in M\n⊥\n⊥\nT O . This proves that N is an integral submanifold of T O passing through the\npoint x0 = f (I, 0).\nf 0 (p, q)-action on M\nf we obtain by restriction\nOn the other hand, from the left SO\nto N a map:\nf 0 (p, q) × N → M\nf, (g, x) 7→ gx,\nφ : SO\nwhose differential at (I, x0 ) is given by:\n\nX + v 7→ Xx∗0 + v,\nwhere X ∈ so(p, q) and v ∈ Tx0 N . The latter is an isomorphism and so the map\nφ is a diffeomorphism from a neighborhood of (I, x0 ) onto a neighborhood of x0 .\nf 0 (p, q)-action preserves both T O and T O⊥ , we conclude that there\nSince the left SO\nis an integral submanifold of T O⊥ passing through every point in neighborhood of\nf. Hence, the tensor Ω considered in Lemma 1.3 vanishes in a neighborhood\nx0 in M\nof x0 . Since all our objects are analytic, this implies that Ω vanishes everywhere\nf.\nand so Lemma 1.3 implies the integrability of T O⊥ everywhere in M\nThis last conclusion and Proposition 1.5 contradict the weak irreducibility of M .\nThis shows that case (1) from Lemma 2.3 cannot occur.\n3.2. Case 2: H0 (x0 ) 6= {0} and H is the sum of two simple ideals. We now\nf.\nassume that the conclusion (2) of Lemma 2.3 is satisfied for some fixed x0 ∈ M\nAs in the previous case, we will rule out this possibility.\nIn this case, there exist simple Lie algebras h1 , h2 and an isomorphism of Lie\nalgebras ψ : h1 ×h2 → H so that ψ(h2 ) = H0 (x0 )⊕V(x0 ). Let H1 and H2 be simply\nconnected Lie groups with Lie algebras h1 and h2 , respectively. By Lemma 1.11,\nf such that ψ(X) = X ∗ for\nthere is an analytic isometric right action of H1 ×H2 on M\nf 0 (p, q)-action\nevery X ∈ h1 × h2 . Note that this right action centralizes the left SO\n⊥\nf\non M and so it preserves the bundles T O and T O .\nLet us consider the map:\nf,\nf : H1 × H 2 → M\n\nh 7→ x0 h,\n\nwhich is clearly (H1 × H2 )-equivariant for the right action on its domain. In particular, we have dfe (X) = Xx∗0 = ψ(X)x0 which is surjective with ker(dfe ) =\nψ −1 (H0 (x0 )) by Lemma 2.2. We claim that we also have dfe (h1 ) = Tx0 O and\ndfe (h2 ) = Tx0 O⊥ . The latter follows from our choice of ψ and Lemma 2.2. To\nprove the former, first note that both ψ(h1 ) and G(x0 ) are complementary so(p, q)modules to H0 (x0 ) ⊕ V(x0 ) in H, and so they are isomorphic as so(p, q)-modules.\n\n\fON LOW-DIMENSIONAL MANIFOLDS WITH ISOMETRIC SO0 (p, q)-ACTIONS\n\n15\n\nf = Tx0 O ⊕ Tx0 O⊥ necessarHence, by Lemma 2.2 the evaluation evx0 : H → Tx0 M\nily maps ψ(h1 ) onto Tx0 O since Tx0 O ≃ G(x0 ) 6≃ Tx0 O⊥ as so(p, q)-modules. This\nproves that dfe (h1 ) = Tx0 O.\nLet us denote with H the connected subgroup of H2 with Lie algebra ψ −1 (H0 (x0 )),\nthe latter being isomorphic to so(p, q) by Lemma 2.2. Since H2 is simply connected\nand ψ −1 (H0 (x0 )) is simple, it follows that H is a closed subgroup of H2 (see Exercise D.4(ii), Chapter II from [12]). Hence, the map:\nf,\nfb : H1 × H\\H2 → M\n\n(h1 , Hh2 ) 7→ x0 (h1 , h2 ),\n\nis a well-defined (H1 × H2 )-equivariant analytic map of manifolds. From the properties of dfe , it also follows that fb is a local diffeomorphism at (e1 , He2 ).\nBy considering N = fb(I × H\\H2 ) and using the equivariance of fb, we can\nprove with arguments similar to those used in the previous subsection that T O⊥ is\nintegrable. This again rules out the current case.\n3.3. Case 3: H is simple. In this case we are now assuming that (3) from\nf that we now consider fixed.\nLemma 2.3 holds for some x0 ∈ M\n\nLemma 3.1. There is an isomorphism ψ : so(p, q) ⊕ Rp,q → H = G(x0 ) ⊕ V(x0 ) of\nLie algebras that preserves the summands in that order, where the domain has the\nLie algebra structure given by [*, *]c for some c 6= 0 as defined in Lemma A.8. In\nparticular, ψ is an isomorphism of so(p, q)-modules as well.\n\nProof. The result follows from the arguments in the second to last paragraph in\nthe proof of Lemma 2.3 when V(x0 ) ≃ Rp,q as so(p, q)-modules and n ≥ 5. Hence,\nby Lemma 2.1 we can assume that either (p, q) = (3, 1) or (p, q) = (4, 4) in the rest\nof the proof.\nBy Lemma 2.3 there is an isomorphism ψ : h → H, for h = so(V ) where V\nis either R4,1 or R3,2 for (p, q) = (3, 1), and it is R5,4 for (p, q) = (4, 4). The\nrestriction of this homomorphism to ψ −1 (G(x0 )) yields a representation of G(x0 ) ≃\nso(p, q) on the (n + 1)-dimensional space V . By the description of the irreducible\nrepresentations of so(3, 1) from previous sections we know that there do not exist 5dimensional irreducible representations of so(3, 1). In particular, there is a line L ⊂\nV that is a G(x0 )-submodule for the case (p, q) = (3, 1). On the other hand, since\nso(4, 4) is split and using Weyl's dimension formula we find that so(4, 4) does not\nadmit 9-dimensional irreducible representations. Hence, for the case (p, q) = (4, 4)\nwe similarly conclude the existence of a line L ⊂ V which is a G(x0 )-submodule.\nLet us now consider our two remaining cases (p, q) ∈ {(3, 1), (4, 4)} together. If\nL as above is a null line, then ψ −1 (G(x0 )) lies in the Lie algebra s of the stabilizer\nof some point in either of the pseudo-conformal spaces C p,q−1 or C p−1,q . We recall\nthat C r,s is the projectivization of the null cone of Rr+1,s+1 , is homogeneous under\nO(r + 1, s + 1) and has dimension r + s (see [1] for further details). In particular, s\nhas dimension n(n − 1)/2 + 1. This yields ψ −1 (G(x0 )) ( s ( h, which contradicts\nTheorem A.5. We conclude that L is a non-null line.\nThis yields an orthogonal decomposition V = L ⊕ L⊥ into non-degenerate subspaces which is clearly a decomposition into G(x0 )-submodules. Hence, ψ induces\nan isomorphism so(L⊥ ) → G(x0 ) and a rank argument shows that L⊥ has signature (p, q). In particular, so(L⊥ ) ≃ so(p, q) as Lie algebras under ψ. With respect\nto the corresponding so(p, q)-module structure, it is easily seen that so(L⊥ ) has\na complementary module in h isomorphic to Rp,q . This provides an isomorphism\n\n\f16\n\nGESTUR OLAFSSON AND RAUL QUIROGA-BARRANCO\n\nh ≃ so(p, q) ⊕ Rp,q so that the Lie algebra structure on h corresponds to the one\ngiven by [*, *]c on so(p, q) ⊕ Rp,q for some c 6= 0. Hence, under the identification\nh ≃ so(p, q) ⊕ Rp,q of Lie algebras, ψ is the required isomorphism.\n\u0003\n\nLet us fix an isomorphism of Lie algebras ψ : so(p, q)⊕Rp,q → H = G(x0 )⊕V(x0 )\nas in Lemma 3.1. We will identify h = so(p, q) ⊕ Rp,q with either so(p + 1, q) or\nso(p, q + 1) through the appropriate isomorphism as considered in Lemma A.8.\nf 0 (p + 1, q) or SO\nf 0 (p, q + 1), chosen so that\nAlso, we will denote with H either SO\nLie(H) = h.\nf such that\nBy Lemma 1.11, there is an analytic isometric right H-action on M\nψ(X) = X ∗ for every X ∈ h. As in the previous subsections, we now consider the\norbit map:\nf, h 7→ x0 h\nf :H →M\n∗\nwhich satisfies dfI (X) = Xx0 = ψ(X)x0 for every X ∈ h. By the choice of ψ and\nLemma 2.2 it follows that dfI is an isomorphism that maps so(p, q) onto Tx0 O and\nRp,q onto Tx0 O⊥ . Since f is H-equivariant for the right action on its domain, we\nconclude that it is an analytic local diffeomorphism.\nLemma 3.2. Let g be the metric on h = so(p, q) ⊕ Rp,q defined as the pullback\nf. Then, g is so(p, q)-invariant.\nunder dfI of the metric gx0 on Tx0 M\n\nProof. By the above expression of dfI and since ψ is an isomorphism of Lie algebras\nwith ψ(so(p, q)) = G(x0 ), it is enough to show that the metric on H defined as the\npullback of gx0 with respect to the evaluation map:\nf,\nH → Tx0 M\n\nX 7→ Xx0\n\nis G(x0 )-invariant. For simplicity, we will denote with g such metric on H. Let\nX, Y, Z ∈ H be given with X ∈ G(x0 ). In particular, there exist X0 ∈ so(p, q) such\nthat X = ρx0 (X0 ) + X0∗ , where ρx0 is the homomorphism from Proposition 1.2 and\nf induced by X0 through the left SO\nf 0 (p, q)-action. Then,\nX0∗ is the vector field on M\nthe following proves the required invariance:\ng([X, Y ], Z) = gx0 ([X, Y ]x0 , Zx0 ) = g([X, Y ], Z)|x0\n\n= g([ρx0 (X0 ) + X0∗ , Y ], Z)|x0 = g([ρx0 (X0 ), Y ], Z)|x0\n= ρx0 (X0 )(g(Y, Z))|x0 − g(Y, [ρx0 (X0 ), Z])|x0\n\n= −g(Y, [ρx0 (X0 ), Z])|x0 = −g(Y, [ρx0 (X0 ) + X0∗ , Z])|x0\n= −g(Y, [X, Z])|x0 = −g(Y, [X, Z]).\n\nWe have used in lines 2 and 4 that H centralizes X0∗ . To obtain the third line we\nused that ρx0 (X0 ) is a Killing field for the metric g. And the first identity in line\n\u0003\n4 uses the fact that ρx0 (X0 ) vanishes at x0 .\nFrom the previous result and Lemma A.9, for n ≥ 5 we can rescale the metric\nf satisfies\nalong the bundles T O and T O⊥ in M so that the new metric gb on M\n(dfI )∗ (b\ngx0 ) = K, the Killing form on h.\nLet us now consider the case (p, q) = (3, 1). From the hypotheses of the Main\nf for every X ∈ su(2), Y ∈ Jsu(2)\nTheorem, we are now assuming that X ∗ ⊥ Y ∗ in M\nf\nand the left SL(2, C)-action on M . By Proposition 1.2 and Lemma 1.7, we have\nρbx0 (X)x0 = Xx∗0 and so ρbx0 (X)x0 ⊥ ρbx0 (Y )x0 , for every X ∈ su(2) and Y ∈ Jsu(2).\nHence, for the compact real form U = ρbx0 (su(2)) of G(x0 ) we have Xx0 ⊥ Yx0 when\n\n\fON LOW-DIMENSIONAL MANIFOLDS WITH ISOMETRIC SO0 (p, q)-ACTIONS\n\n17\n\nX ∈ U and Y ∈ JU. By the definition of g and the expression for dfI given above, it\nfollows that for the metric g restricted to so(3, 1) ≃ sl(2, C)R we have g(X, Y ) = 0\nfor every X ∈ ψ −1 (U) and Y ∈ Jψ −1 (U). By the remarks that follow Lemma A.9\nf along T O and\nwe conclude that in this case we can also rescale the metric on M\nT O⊥ to obtain a new metric b\ng such that (dfI )∗ (b\ngx0 ) = K, the Killing form of h.\nNote that, for both cases n ≥ 5 and (p, q) = (3, 1), since the elements of H\nf, b\npreserve the decomposition T M = T O ⊕ T O⊥ , then H ⊂ Kill(M\ng). In other\nwords, the elements of H are Killing vector fields for the metric b\ng rescaled as above.\nf 0 (p, q)In particular, gb is invariant under the right H-action. Similarly, the left SO\nf, from the hypotheses of the Main Theorem, preserves the rescaled\naction on M\nmetric b\ng. Also note that the metric b\ng is the lift of a correspondingly rescaled metric\ng in M .\nb\nConsider the bi-invariant metric on H induced by the Killing form K, which we\nwill denote with the same symbol. The previous discussion implies that the local\nf, b\ndiffeomorphism f : (H, K) → (M\ng) is a local isometry. Then, by Corollary 29 in\nf\npage 202 of [13], the completeness of (H, K) and the simple connectedness of M\nimply that f is an isometry.\nHence, from the previous discussion we obtain the following result.\nLemma 3.3. Let M be as in the statement of the Main Theorem. If dim(M ) =\nf 0 (p, q + 1) or SO\nf 0 (p + 1, q), there exists an analytic\nn(n + 1)/2, then for H either SO\nf and an analytic isometric right H-action on M\nf such\ndiffeomorphism f : H → M\nthat:\nf, the left SO\nf 0 (p, q)-action and the right H-action commute with each\n(1) on M\nother,\n(2) f is H-equivariant for the right H-action on its domain,\n(3) for a pseudo-Riemannian metric gb in M obtained by rescaling the original\nf, b\none on the summands of T M = T O ⊕ T O⊥ , the map f : (H, K) → (M\ng)\nis an isometry where K is the bi-invariant metric on H induced from the\nKilling form of its Lie algebra.\nIf we consider H endowed with the bi-invariant pseudo-Riemannian metric K\ninduced by the Killing form of its Lie algebra, then Lemma 3.3 allows to consider\n(H, K) as the isometric universal covering space of (M, gb). We will use this identification in the rest of the arguments.\nThe isometry group Iso(H) for the pseudo-Riemannian manifold (H, K) has\nfinitely many connected components (see for example Section 4 of [15]). Furthermore, the connected component of the identity is given as Iso0 (H) = L(H)R(H),\nthe subgroup generated by L(H) and R(H), the left and right translations, respectively.\nf 0 (p, q) → Iso0 (H) be the homomorphism induced by isometric left\nLet ρ : SO\nf 0 (p, q)-action on H. With respect to the natural covering H × H → L(H)R(H),\nSO\nf 0 (p, q) → H such that:\nthis yields homomorphisms ρ1 , ρ2 : SO\nρ(g) = Lρ1 (g) ◦ Rρ2 (g)−1 ,\n\nf 0 (p, q). By Lemma 3.3 we have ρ(g) ◦ Rh = Rh ◦ ρ(g) for every\nfor every g ∈ SO\nf\nf 0 (p, q)) lies in the center Z(H) and\ng ∈ SO0 (p, q) and h ∈ H. In particular, ρ2 (SO\nso (being connected) it is trivial. We conclude that ρ = Lρ1 which implies that the\n\n\f18\n\nGESTUR OLAFSSON AND RAUL QUIROGA-BARRANCO\n\nf 0 (p, q)-action on H is induced by the homomorphism ρ1 : SO\nf 0 (p, q) → H and\nSO\nthe left action of H on itself. Note that ρ1 is necessarily non-trivial.\nBy Lemma 3.3, we have π1 (M ) ⊂ Iso(H), and from the above remarks Γ1 =\nπ1 (M ) ∩ Iso0 (H) is a finite index subgroup of π1 (M ). In particular, every γ ∈ Γ1\ncan be written as γ = Lh1 ◦ Rh2 for some h1 , h2 ∈ H.\nf 0 (p, q)-action on H is the lift of an action\nOn the other hand, since the left SO\non M , it follows that it commutes with the Γ1 -action. Applying this property to\nf 0 (p, q),\nγ = Lh1 ◦ Rh2 we conclude that Lh1 ◦ Lρ1 (g) = Lρ1 (g) ◦ Lh1 , for every g ∈ SO\nf 0 (p, q)) in H. By\nwhich implies Γ1 ⊂ L(Z)R(H), where Z is the centralizer of ρ1 (SO\nLemma A.6, the center of Z(H) has finite index in Z, which implies that R(H) has\nfinite index in L(Z)R(H). In particular, Γ = Γ1 ∩ R(H) is a finite index subgroup\nof Γ1 , and so has finite index in π1 (M ) as well.\nHence, the natural identification R(H) = H realizes Γ as a discrete subgroup of\nH such that H/Γ is a finite covering space of M . Furthermore, if φ : H/Γ → M is\nf 0 (p, q)-action on H/Γ given by\nthe corresponding covering map, and for the left SO\nf\nthe homomorphism ρ1 : SO0 (p, q) → H, then the above constructions show that φ\nf 0 (p, q)-equivariant. We also note that φ is a local isometry for the metric b\nis SO\ng\non M considered in Lemma 3.3.\nTo complete the proof of the Main Theorem it only remains to show that Γ is a\nlattice in H. For this it is enough to prove that M has finite volume in the metric\ng. The following result provides proofs of these facts since we are assuming that M\nb\nhas finite volume in its original metric.\nLemma 3.4. Let us denote with vol and volgb the volume elements on M for the\noriginal metric on M and the rescaled metric b\ng, respectively. Then, there is some\nconstant C > 0 such that volgb = Cvol.\nProof. Clearly, it suffices to verify this locally, so we consider some coordinates\n(x1 , . . . , xm ) of M in a neighborhood U of a given point such that (x1 , . . . , xr )\ndefines a set of coordinates of the leaves of the foliation O in such neighborhood.\nFor the original metric g on M , consider as above the orthogonal bundle T O⊥ and\na set of 1-forms θ1 , . . . θm−r that define a basis for its dual (T O⊥ )∗ at every point\nin U . Hence, in U the metric g has an expression of the form:\ng=\n\nr\nX\n\ni,j=1\n\nhij dxi ⊗ dxj +\n\nm−r\nX\n\ni,j=1\n\nkij θi ⊗ θj .\n\nFrom this and the definition of the volume element as an m-form, its is easy to see\nthat:\nq\nvol = | det(hij ) det(kij )|dx1 ∧ * * * ∧ dxr ∧ θ1 ∧ * * * ∧ θm−r .\nOn the other hand, the metric b\ng is obtained by rescaling g along the bundles T O\nand T O⊥ , and so it has an expression of the form:\ng=\nb\n\nr\nX\n\ni,j=1\n\nc1 hij dxi ⊗ dxj +\n\nm−r\nX\n\ni,j=1\n\nc2 kij θi ⊗ θj ,\n\n\fON LOW-DIMENSIONAL MANIFOLDS WITH ISOMETRIC SO0 (p, q)-ACTIONS\n\n19\n\nfor some constants c1 , c2 6= 0. Hence, the volume element of b\ng satisfies:\nq\nvolbg = | det(c1 hij ) det(c2 kij )|dx1 ∧ * * * ∧ dxr ∧ θ1 ∧ * * * ∧ θm−r\nq\n= |cr1 cm−r\n|vol.\n2\n\n\u0003\n\nAppendix A. Facts on the Lie algebra so(p, q)\nIn this appendix we collect some facts about the pairs (so(p + 1, q), so(p, q)) and\n(so(p, q + 1), so(p, q)). We now describe some low-dimensional non-trivial so(p, q)modules. The following result is an easy consequence of well known facts of classical\nLie groups (see [11, 14]). As mentioned in the introduction we denote with m(g)\nthe lowest dimension of a non-trivial g-module with an invariant non-degenerate\nsymmetric bilinear form.\nLemma A.1. Let p, q ≥ 1, n = p + q ≥ 4 such that (p, q) 6= (2, 2). Then,\nm(so(p, q)) = n, i.e. there is no non-trivial so(p, q)-module with dimension < n\nand carrying an invariant inner product. Moreover, the only non-trivial irreducible\nso(p, q)-module of dimension ≤ n is Rp,q , except for the Lie algebras so(3, 1),\nso(3, 2), so(3, 3) and so(4, 4). For the latter, there also exist the following irreducible modules:\n• C2R corresponding to so(3, 1) ≃ sl(2, C)R .\n• R4 corresponding to so(3, 2) ≃ sp(2, R).\n• R4 and R4∗ corresponding to so(3, 3) ≃ sl(4, R).\n• so(4, 4)-invariant real forms of the half spin representations of so(8, C), both\n8-dimensional.\nRemark A.2. We note that the previous statement is not correct in lower dimensions. We have that so(1, 1) is abelian, so every irreducible module is onedimensional. In fact R1,1 = R2 decomposes into irreducible submodules where\nt ∈ R ≃ so(1, 1) acts by multiplication by et respectively e−t .\nThe Lie algebra so(2, 2) ≃ sl(2, R) × sl(2, R) is not simple and acts on R2 . But\nthere is again no non-trivial invariant symmetric bilinear form on R2 . The lowest\ndimensional so(2, 2)-module with a non-trivial invariant form is R2,1 where one of\nthe factors carries the canonical so(2, 1) action, and the other factor acts trivially,\nthus reducing this to the case of so(2, 1). Hence we have m(so(2, 2)) = 3.\nThe following statement is an easy to prove exercise.\nLemma A.3. Let p, q ≥ 1 and n = p + q ≥ 3. Then, for every c ∈ R, the map\nTc : ∧2 Rp,q → so(p, q) given by:\np,q\n\nTc (u ∧ v) = c hu, *ip,q v − c hv, *ip,q u,\n\nfor every u, v ∈ R , is a well defined homomorphism of so(p, q)-modules. Also,\nTc is an isomorphism of so(p, q)-modules if and only if c 6= 0. If n 6= 4, then these\nmaps exhaust all the so(p, q)-module homomorphisms ∧2 Rp,q → so(p, q).\nRemark A.4. The last conclusion fails for so(2, 2) ≃ so(2, 1) × so(2, 1) as it is not\nsimple. It also fails for so(3, 1) ≃ sl(2, C), since the complex structure of sl(2, C)\ndefines an isomorphism which is not multiplication by a real scalar.\nNext we prove the maximality of so(p, q) in both so(p, q + 1) and so(p + 1, q).\n\n\f20\n\nGESTUR OLAFSSON AND RAUL QUIROGA-BARRANCO\n\nTheorem A.5. Assume that p, q ≥ 1 and n = p + q ≥ 3, and let g = so(p + 1, q)\nor g = so(p, q + 1). Suppose that ρ : so(p, q) ֒→ g is an injective Lie algebra\nhomomorphism and let h = ρ(so(p, q)). If g, h 6≃ so(2, 1) × so(2, 1), then h is a\nmaximal subalgebra of g.\nProof. This follows from Theorem 1.2 of [8] for n big and a case by case calculation\nfor the other cases. We give here a simple proof for completeness. The map θ(X) =\n−X t is a Cartan involution on g. As all Cartan involutions are conjugate and every\nCartan involution on h extends to a Cartan involution on g we can assume that\nθ(h) = h. Then the form β(X, Y ) = Tr(XY ) is non-degenerate on g and h. Let\nV be the β-orthogonal complement of h. Hence V is an n-dimensional h-module\nwhich is necessarily non-trivial since otherwise h is an ideal. Furthermore, β|V ×V is\nnon-degenerate and h-invariant. It follows by Lemma A.1 that V is an irreducible\nh-module if n ≥ 4 and (p, q) 6= (2, 2), (3, 2), (3, 3). Hence h is maximal in those\ncases.\nLet us now assume that h = so(2, 1) ≃ sl(2, R), g = so(3, 1) and V is not\nirreducible. Thus V = V1 ⊕V2 with V1 ≃ R and V2 ≃ R2 where the representation on\nV1 is trivial and the representation on V2 is isomorphic to the natural representation\nof sl(2, R). But then it follows that V2 is invariant under θ and hence β|V2 ×V2 is an\nh-invariant non-degenerate form, contradicting the fact that there is no such form\non R2 . The remaining cases (p, q) ∈ {(3, 2), (3, 3)} can be considered similarly using\nLemma A.1.\n\u0003\nLemma A.6. Suppose that G is a connected Lie group locally isomorphic to either\nf 0 (p, q + 1) or SO\nf 0 (p + 1, q), where p, q ≥ 1 and n = p + q ≥ 3, and consider\nSO\nf\nρ : SO0 (p, q) → G a non-trivial homomorphism of Lie groups. Assume that so(p, q),\nso(p, q + 1) and so(p + 1, q) satisfy the same conditions as in Theorem A.5. Then,\nf 0 (p, q))) of ρ(SO\nf 0 (p, q)) in G contains Z(G) (the center of\nthe centralizer ZG (ρ(SO\nG) as a finite index subgroup.\nf 0 (p, q)) and write h for the Lie algebra of H. Then, clearly\nProof. Write H = ρ(SO\nZ(G) ⊆ ZG (H). The Lie algebra of ZG (H) is\nzg (h) = {X ∈ g | [X, Y ] = 0 for all Y ∈ h} .\n\nClearly zg (h) + h is a Lie algebra containing h. By Theorem A.5 we conclude that\nzg (h) ⊂ h. As h is simple, it follows that zg (h) = {0} and so ZG (H) is discrete.\nFinally, it follows easily from [18], Lemma 1.1.3.7, that ZG (H) is contained in any\nmaximal compact subgroup of G and hence that it is finite.\n\u0003\nRemark A.7. If p = q = 1 then h is abelian, hence H ⊆ ZG (H). On the other\nhand Theorem A.5 shows that ZG (H)/H is finite. For so(2, 1) ⊂ so(2, 1) × so(2, 1)\nthe statement remains true if so(2, 1) is embedded diagonally, but clearly not if\nso(2, 1) ≃ so(2, 1) is one of the ideals.\nWe now provide an elementary but useful description of the Lie algebra structures\nof so(p, q + 1) and so(p + 1, q) in terms of so(p, q)-modules. In the next result\nso(p, q) ⋉ Rp,q is considered with the usual semidirect product Lie algebra structure\ncoming from the fact that Rp,q is an so(p, q)-module. Also, we will denote:\n\u0013\n\u0012\n\u0013\n\u0012\nIp,q 0\nc\n0\nif c > 0 and Ip,q (c) =\nif c < 0 .\nIp,q (c) =\n0\nc\n0 Ip,q\n\n\fON LOW-DIMENSIONAL MANIFOLDS WITH ISOMETRIC SO0 (p, q)-ACTIONS\n\n21\n\nLemma A.8. For p, q ≥ 1, n = p + q ≥ 3 and every c ∈ R, let:\n\n[*, *]c : so(p, q) ⊕ Rp,q × so(p, q) ⊕ Rp,q → so(p, q) ⊕ Rp,q ,\n\nbe given by:\n• [X, Y ]c = XY − Y X for X, Y ∈ so(p, q).\n• [X, u]c = −[u, X]c = X(u) for X ∈ so(p, q) and u ∈ Rp,q .\n• [u, v]c = Tc (u∧v) for u, v ∈ Rp,q , where Tc is the map defined in Lemma A.3.\nThen, [*, *]c defines a Lie algebra structure on so(p, q) ⊕ Rp,q which satisfies:\n(1) (so(p, q) ⊕ Rp,q , [*, *]0 ) ≃ so(p, q) ⋉ Rp,q .\n(2) (so(p, q) ⊕ Rp,q , [*, *]c ) ≃ so(Rn+1 , Ip,q (c)) for every c 6= 0.\nIn particular, (so(p, q) ⊕ Rp,q , [*, *]c ) is isomorphic to so(p + 1, q) (so(p, q + 1)) for\nc > 0 (c < 0, respectively) under an isomorphism for which the summand so(p, q)\nis canonically embedded.\nProof. Using Lemma A.3 it is an easy exercise to prove that [*, *]c defines a Lie\nalgebra structure. On the other hand, (1) is the definition of the Lie brackets on\nso(p, q) ⋉ Rp,q .\nFinally, for (2) an isomorphism is easily seen to be given by:\n\u0012\n\u0013\n\u0012\n\u0013\n0 u∗\nX cu\n(X, u) 7→\n, c > 0, and (X, u) 7→\n, c<0\ncu X\nu∗ 0\nwhere u ∈ Rp,q is considered as a column vector and u∗ = −ut Ip,q . For c > 0 an\nisomorphism so(Rn+1 , Ip,q (c)) ≃ so(p + 1, q) is\n\u0012\n\u0013\n\u0012\n√ ∗\u0013\ncu\n0 u∗\n0\n7→ √\ncu\nX\ncu X\nand similarly for c < 0.\n\n\u0003\n\nNext, we state a uniqueness property for so(p, q)-invariant inner products related\nto the constructions of Lemma A.8. Its proof follows easily from Schur's Lemma\nand the uniqueness (up to a multiple) of the Killing form of complex simple Lie\nalgebras.\nLemma A.9. Assume that p, q ≥ 1, n = p + q ≥ 3 and n 6= 4. Let h*, *i1 and h*, *i2\nbe inner products on so(p, q) and Rp,q , respectively. Assume that h*, *i1 and h*, *i2\nare so(p, q)-invariant, in other words:\n• h[X, Y ], Zi1 = − hY, [X, Z]i1 for every X, Y, Z ∈ so(p, q), and\n• hX(u), vi2 = − hu, X(v)i2 for every X ∈ so(p, q) and u, v ∈ Rp,q ,\nIf c ∈ R \\ {0} is given, then there exist a1 , a2 ∈ R such that a1 h*, *i1 + a2 h*, *i2 is\nthe Killing form of (so(p, q) ⊕ Rp,q , [*, *]c ).\nRemark A.10. The previous result is not valid for n = p + q = 4. For p = q = 2, the\ninvariant bilinear forms on so(2, 2) ≃ so(2, 1) × so(2, 1) are the linear combinations\nof the Killing forms of the factors.\nOn the other hand, for the realification gR of a simple complex Lie algebra, the\nb\ncomplex estructure J induces the invariant bilinear form K(X,\nY ) = K(X, J(Y )),\nb is not\nwhere K is its Killing form considered as a real Lie algebra. Note that K\na multiple of K. In fact, using Schur's lemma one can show that the invariant\nb where a, b ∈ R.\nbilinear forms on gR are given by aK + bK,\n\n\f22\n\nGESTUR OLAFSSON AND RAUL QUIROGA-BARRANCO\n\nFurthermore, for u a compact real form of g it is easy to see that a gR -invariant\nb has b = 0 if and only u and Ju are perpenbilinear map of the form h*, *i = aK +bK\ndicular with respect respect to h*, *i. This follows from the fact that gR = u ⊕ Ju is\na Cartan decomposition and the properties of such decompositions with respect to\nthe Killing form. From this, it is easy to see that the proof of Lemma A.9 remains\nvalid for so(3, 1) ≃ sl(2, C)R if we further assume that u and Ju are perpendicular\nwith respect to h*, *i1 for some compact form u of sl(2, C).\n\nReferences\n[1] M.A. Akivis and V.V. Goldberg, Conformal differential geometry and its generalizations.\nPure and Applied Mathematics (New York). A Wiley-Interscience Publication. John Wiley\n& Sons, Inc., New York, 1996.\n[2] U. Bader, C. Frances and K. Melnick, An embedding theorem for automorphism groups of\nCartan geometries. GAFA 19 (2009), no. 2, 333–355.\n[3] U. Bader and A. Nevo, Conformal actions of simple Lie groups on compact pseudoRiemannian manifolds. J. Differential Geom. 60 (2002), no. 3, 355–387.\n[4] N. Bourbaki, Lie groups and Lie algebras. Chapters 7–9. Elements of Mathematics (Berlin).\nSpringer-Verlag, Berlin, 2005.\n[5] G. Cairns, Géométrie globale des feuilletages totalement géodésiques. C. R. Acad. Sci. Paris\nSér. I Math. 297 (1983), no. 9, 525–527.\n[6] G. Cairns and E. Ghys, Totally geodesic foliations on 4-manifolds. J. Differential Geom. 23\n(1986), no. 3, 241–254.\n[7] A. Candel and R. Quiroga–Barranco, Gromov's centralizer theorem, Geom. Dedicata 100\n(2003), 123–155.\n[8] E. B. Dynkin, Maximal subgroups of the classical groups. (Russian) Trudy Moskov. Mat.\nObšč. 1, (1952), 39–166. See also: Translations of the AMS (2) 6, (1957), 245–378.\n[9] C. Frances and K. Melnick, Conformal actions of nilpotent groups on pseudo-Riemannian\nmanifolds, Duke Math. J. 153 (2010), no. 3, 511–550.\n[10] M. Gromov, Rigid transformations groups, in Géométrie différentielle, Colloque Géométrie et\nPhysique de 1986 en l'honneur de André Lichnerowicz (D. Bernard and Y. Choquet-Bruhat,\neds.), Hermann, 1988, 65–139.\n[11] R. Goodman and N.R. Wallach, Representations and Invariants of the Classical Groups. Encyclopedia of Mathematics and its Applications, 68. Cambridge University Press, Cambridge,\n1998.\n[12] S. Helgason, Differential Geometry, Lie Groups and Symmetric Spaces, Pure and Applied\nMathematics 80, Academic Press Inc., 1978.\n[13] B. O'Neill, Semi-Riemannian Geometry. With Applications to Relativity. Pure and Applied\nMathematics, 103. Academic Press, Inc., New York, 1983.\n[14] A. L. Onishchik, Lectures on Real Semisimple Lie Algebras and their Representations, ESI\nLectures in Mathematics and Physics. European Mathematical Society (EMS), Zürich, 2004.\n[15] R. Quiroga-Barranco, Isometric actions of simple Lie groups on pseudo-Riemannian manifolds, Ann. of Math. (2) 164 (2006), no. 6, 941–969.\n[16] R. Quiroga-Barranco, Isometric actions of simple groups and transverse structures: the integrable normal case, \"Geometry, Rigidity and Group Actions\", 229–261, Chicago Lectures in\nMathematics Series, The University of Chicago Press.\n[17] J. Szaro, Isotropy of semisimple group actions on manifolds with geometric structure, Amer.\nJ. Math. 120 (1998), 129–158.\n[18] G. Warner, Harmonic Analysis on Semi-Simple Lie Groups I, Springer, Berlin and New York,\n1972.\n[19] A. Zeghib, On affine actions of Lie groups, Math. Z. 227 (1998), no. 2, 245–262.\n[20] R. J. Zimmer, On the automorphism group of a compact Lorentz manifold and other geometric manifolds. Invent. Math. 83 (1986), no. 3, 411–424.\n[21] R. J. Zimmer, Representations of fundamental groups of manifolds with a semisimple transformation group. J. Amer. Math. Soc. 2 (1989), no. 2, 201–213.\n\n\fON LOW-DIMENSIONAL MANIFOLDS WITH ISOMETRIC SO0 (p, q)-ACTIONS\n\n23\n\n[22] R. J. Zimmer, Automorphism groups and fundamental groups of geometric manifolds. Differential geometry: Riemannian geometry (Los Angeles, CA, 1990), 693–710, Proc. Sympos.\nPure Math., 54, Part 3, Amer. Math. Soc., Providence, RI, 1993.\n[23] R. J. Zimmer, Entropy and arithmetic quotients for simple automorphism groups of geometric\nmanifolds, Geom. Dedicata 107 (2004), 47–56.\nDepartment of Mathematics, 303 Lockett Hall, Louisiana State University, Baton\nRouge, LA, 70803, USA\nE-mail address: olafsson@math.lsu.edu\nCentro de Investigación en Matemáticas, Apartado Postal 402, Guanajuato, Guanajuato, 36250, Mexico\nE-mail address: quiroga@cimat.mx\n\n\f"}