{"id": "http://arxiv.org/abs/0808.0774v2", "guidislink": true, "updated": "2008-08-08T18:09:37Z", "updated_parsed": [2008, 8, 8, 18, 9, 37, 4, 221, 0], "published": "2008-08-06T15:17:40Z", "published_parsed": [2008, 8, 6, 15, 17, 40, 2, 219, 0], "title": "Elementary Techniques for Erdos-Ko-Rado-like Theorems", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1204.4988%2C1204.2455%2C1204.1137%2C1204.0597%2C1204.2490%2C0808.2913%2C0808.2459%2C0808.0684%2C0808.4101%2C0808.3491%2C0808.3617%2C0808.3859%2C0808.2961%2C0808.2057%2C0808.0360%2C0808.3622%2C0808.0662%2C0808.2626%2C0808.0774%2C0808.0983%2C0808.1459%2C0808.0531%2C0808.0423%2C0808.2203%2C0808.3868%2C0808.0265%2C0808.1970%2C0808.0083%2C0808.4018%2C0808.2169%2C0808.3046%2C0808.3154%2C0808.3498%2C0808.3324%2C0808.2832%2C0808.2567%2C0808.3762%2C0808.3279%2C0808.0018%2C0808.1457%2C0808.1898%2C0808.1901%2C0808.0110%2C0808.2353%2C0808.1234%2C0808.3175%2C0808.1068%2C0808.3239%2C0808.2853%2C0808.1501%2C0808.0944%2C0808.3699%2C0808.0713%2C0808.0317%2C0808.1208%2C0808.3635%2C0808.2982%2C0808.2588%2C0808.3168%2C0808.1719%2C0808.3885%2C0808.2807%2C0808.2524%2C0808.0745%2C0808.0679%2C0808.0321%2C0808.1402%2C0808.3696%2C0808.1821%2C0808.1324%2C0808.2392%2C0808.1444%2C0808.3791%2C0808.2260%2C0808.3987%2C0808.4021%2C0808.2556%2C0808.0406%2C0808.1798%2C0808.3242%2C0808.3769%2C0808.0743%2C0808.0279%2C0808.4062%2C0808.4045%2C0808.3831%2C0808.1388%2C0808.3022%2C0808.1496%2C0808.0900%2C0808.3829%2C0808.3037%2C0808.1499%2C0808.3666%2C0808.2856%2C0808.4010%2C0808.1289%2C0808.0096%2C0808.1857%2C0808.3338%2C0808.3176&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Elementary Techniques for Erdos-Ko-Rado-like Theorems"}, "summary": "The well-known Erdos-Ko-Rado Theorem states that if F is a family of\nk-element subsets of {1,2,...,n} (n>2k-1) such that every pair of elements in F\nhas a nonempty intersection, then |F| is at most $\\binom{n-1}{k-1}$. The\ntheorem also provides necessary and sufficient conditions for attaining the\nmaximum. We present elementary methods for deriving generalizations of the\nErdos-Ko-Rado Theorem on several classes of combinatorial objects. We also\nextend our results to systems under Hamming intersection.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1204.4988%2C1204.2455%2C1204.1137%2C1204.0597%2C1204.2490%2C0808.2913%2C0808.2459%2C0808.0684%2C0808.4101%2C0808.3491%2C0808.3617%2C0808.3859%2C0808.2961%2C0808.2057%2C0808.0360%2C0808.3622%2C0808.0662%2C0808.2626%2C0808.0774%2C0808.0983%2C0808.1459%2C0808.0531%2C0808.0423%2C0808.2203%2C0808.3868%2C0808.0265%2C0808.1970%2C0808.0083%2C0808.4018%2C0808.2169%2C0808.3046%2C0808.3154%2C0808.3498%2C0808.3324%2C0808.2832%2C0808.2567%2C0808.3762%2C0808.3279%2C0808.0018%2C0808.1457%2C0808.1898%2C0808.1901%2C0808.0110%2C0808.2353%2C0808.1234%2C0808.3175%2C0808.1068%2C0808.3239%2C0808.2853%2C0808.1501%2C0808.0944%2C0808.3699%2C0808.0713%2C0808.0317%2C0808.1208%2C0808.3635%2C0808.2982%2C0808.2588%2C0808.3168%2C0808.1719%2C0808.3885%2C0808.2807%2C0808.2524%2C0808.0745%2C0808.0679%2C0808.0321%2C0808.1402%2C0808.3696%2C0808.1821%2C0808.1324%2C0808.2392%2C0808.1444%2C0808.3791%2C0808.2260%2C0808.3987%2C0808.4021%2C0808.2556%2C0808.0406%2C0808.1798%2C0808.3242%2C0808.3769%2C0808.0743%2C0808.0279%2C0808.4062%2C0808.4045%2C0808.3831%2C0808.1388%2C0808.3022%2C0808.1496%2C0808.0900%2C0808.3829%2C0808.3037%2C0808.1499%2C0808.3666%2C0808.2856%2C0808.4010%2C0808.1289%2C0808.0096%2C0808.1857%2C0808.3338%2C0808.3176&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "The well-known Erdos-Ko-Rado Theorem states that if F is a family of\nk-element subsets of {1,2,...,n} (n>2k-1) such that every pair of elements in F\nhas a nonempty intersection, then |F| is at most $\\binom{n-1}{k-1}$. The\ntheorem also provides necessary and sufficient conditions for attaining the\nmaximum. We present elementary methods for deriving generalizations of the\nErdos-Ko-Rado Theorem on several classes of combinatorial objects. We also\nextend our results to systems under Hamming intersection."}, "authors": ["Greg Brockman", "Bill Kay"], "author_detail": {"name": "Bill Kay"}, "author": "Bill Kay", "arxiv_comment": "10 pages, 0 figures", "links": [{"href": "http://arxiv.org/abs/0808.0774v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0808.0774v2", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "math.CO", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "math.CO", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "05D05", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0808.0774v2", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0808.0774v2", "journal_reference": null, "doi": null, "fulltext": "arXiv:0808.0774v2 [math.CO] 8 Aug 2008\n\nElementary Techniques for Erdős–Ko–Rado-like\nTheorems\nGreg Brockman and Bill Kay\nHarvard University, University of South Carolina\n\nOctober 26, 2018\nAbstract\nThe well-known Erdős–Ko–Rado Theorem states that if F is a family of k-element\nsubsets\nof {1, 2, . . . , n} (n ≥ 2k) satisfying S, T ∈ F ⇒ |S ∩ T | ≥ 1, then |F| ≤\nn−1\u0001\n.\nThe\ntheorem also provides necessary and sufficient conditions for attaining the\nk−1\nmaximum. We present elementary methods for deriving generalizations of the Erdős–\nKo–Rado Theorem on several classes of combinatorial objects. We also extend our\nresults to systems under Hamming intersection.\n\n1\n\nIntroduction\n\nAs the reader knows, mathematics is many things, but it is never a one-stop trip. The\ndevelopment of a mathematical theory sees shaping by many hands, beginning with the\ninnovator who first dreamed up its foundations and ending years down the road, if at all.\nOften, the discovery of one fundamental theorem will tip over the domino of another result\nin an observer's mind, prompting new results and raising new questions. These results can\nthen prove to be a catalyst of innovation in the work of others, leading to the development\nof a broad-reaching mathematical monolith.\nThe Erdős–Ko–Rado Theorem is such a fundamental result.\nThis discovery was announced to the world in 1961 with the publication of the seminal\npaper Intersection theorems for systems of finite sets by Paul Erdős, Chao Ko, and Richard\nRado [4]. Interestingly enough, they had the paper essentially completed as early as 1938;\nhowever, one reason they did not publish it was due to what Erdős [15] describes as \"relatively\nlittle interest in combinatorics\" at the time. Ironically, the Erdős–Ko–Rado paper has since\nbecome perhaps the most oft-cited of Erdős's joint work with Rado.\nSo what is this celebrated theorem? Let [n] := {1, 2, . . . , n}, and consider any family F of\nk-sets on [n] (by this, we mean k-element subsets of [n]). If we are told that F is intersecting,\nthat is, every pair of k-sets S, T ∈ F satisfy |S ∩ T | ≥ 1, what is the maximum possible size\nof our family F? Note that if n < 2k, by the Pigeonhole Principle every pair of k-sets has\na nonempty intersection, and hence any family F of these sets will be intersecting-not a\nhugely subtle case. However, if we restrict n ≥ 2k, things start getting interesting.\n1\n\n\fIn this case, there is a plethora of non-intersecting families of k-sets. However, a bit of\ninspection reveals that there is an easy-to-define intersecting family that is quite populous:\nin particular, take an arbitrary element of [n] (say, 1) and consider the family of all sets\ncontaining that element. Such a family we will dub trivially intersecting,\nor just trivial for\n\u0001\nn−1\nshort. It is not hard to count that all trivial families have k−1 elements. But as always\nin mathematics, we are forced to ponder, can we do any better than this, given sufficient\ncleverness? How often is it, really, that the obvious way turns out to be the best one?\nAnd this is where the Erdős–Ko–Rado Theorem comes into play: the theorem's statement\nis that indeed the trivial family is actually (strictly) the best! (Incidentally, there is a\nmnemonic to describe situations such as this: \"TONCAS,\" or \"The Obvious Necessary\nConditions are Also Sufficient.\" We borrow this term from West [18], who attributes\nit to Nash-Williams and others.) The original method for proving the Erdős–Ko–Rado\nTheorem was two pages worth of induction, casework, and contradiction. However, in 1972,\nKatona [10] published a quite short and strikingly beautiful probabilistic proof, which we\nhave adapted below.\nTheorem 1.1 (Erdős–Ko–Rado, henceforth EKR). Let F be an intersecting family of k-sets\non [n], n ≥ 2k. Then\n\u0013\n\u0012\nn−1\n,\nmax |F| ≤\nk−1\nwith equality if and only if F is trivial.\nProof. Let σ = σ(1)σ(2) . . . σ(n) be a permutation of [n]. We'll say that σ contains a k-set\nS ∈ F if all of S's elements appear in consecutive positions in σ when σ is read cyclically.\nFor example, if n = 7, k = 3, and σ = (5, 2, 1, 7, 4, 6, 3), then σ would contain {1, 2, 5} and\n{3, 5, 6}, among others (but not, say, {5, 7, 6}). If S is contained in σ, define the head of S\nto be the first element of S to appear in σ.\nNotice that σ can contain at most k elements of F: let i be the least number such that\nσ(i) is the head of one of F's k-sets that is contained in σ. Then the only other possible\nheads of these k-sets are σ(i + 1), σ(i + 2), . . . , σ(i + k − 1), since F 's sets all intersect the\nk-set {σ(i), σ(i + 1), . . . , σ(i + k − 1)}.\nOn the other hand, every k-set in F is contained in exactly k! * n * (n − k)! (k! orderings\nof the set, n choices of which position in σ to place the head, and (n − k)! orderings of the\nother elements in σ) permutations of [n]. Since there are n! total permutations, we combine\nall of this to obtain\n|F|k! * n * (n − k)! ≤ n! * k,\nwhich rearranges to the desired\n(n − 1)!\nF≤\n=\n(k − 1)!(n − k)!\n\n\u0013\n\u0012\nn−1\n.\nk−1\n\nWe leave to the reader the proof of the equality case.\nIn the spirit of Katona's proof, we seek in this paper to provide elementary techniques for\nextending the EKR Theorem. Whereas many EKR papers involve higher-level algebraic or\n2\n\n\fother advanced techniques, we intentionally stay simple in our tactics. While we correspondingly cede some generality in our theorems, we note that proofs requiring little machinery\nhave a natural appeal, and it is always a surprise and a pleasure to discover the true potential of elementary methods. While the Erdős–Ko–Rado theorem applies specifically to\nsets, the directions that we will be most concerned with involve finding similar results for\nother combinatorial objects. In particular, we will be examining k-permutations, words, and\nmultisets, including considering what happens when the standard notion of intersection is\nreplaced by Hamming intersection.\n\n2\n\nHistorical Overview\n\nThe original EKR Theorem appeared at the head of a wave of results in what is now known\nas extremal set theory. It was not strictly the first result in the field, appearing after works\nsuch as Ramsey's Theorem [16] and the Erdős-Szekeres paper on combinatorial geometry [5]\nas well as taking inspiration from the work of Sperner [17]; however, the EKR paper was\ncertainly a pioneer. In the literature, there exist many generalizations of the theorem, and\nwe provide only a sampling of them here. Results immediately relevant to our current study\nwill be mentioned as needed.\nOne very direct generalization is to think about families that are t-intersecting; that is,\nfor S, T ∈ F, we have |S ∩ T | ≥ t. Again, we can think about the \"trivial\" family that\ncontains\nall the k-sets sharing a fixed core of t elements; such a t-intersecting family contains\n\u0001\nn−t\nelements.\nIndeed, the original EKR paper proved that for n large enough, this is\nk−t\nalways optimal. Later, Frankl [6] applied random walks to show that n is \"large enough\"\nwhen n ≥ (t + 1)(k − t + 1) given that t ≥ 15; Wilson [19] then extended this result to all t\nusing linear algebraic techniques.\nOthers have since determined what happens when n < (t + 1)(k − t + 1). These partial\nresults culminated in Ahlswede and Khachatrian's [2] Complete Intersection Theorem. This\ntheorem is as powerful as its name seems to imply, and its proof both utilized and honed\nhigh powered techniques that have wide-reaching implications for EKR-type results.\nAnother vein of generalizations has been in abstracting to objects other than intersecting\nfamilies of k-sets. Some have looked at allowing F to be partitioned into a fixed number of\nclasses which must be intersecting (instead of F as a whole); Frankl and Füredi [7] is one\nexample of such a study. Other works include Katona [11], which uses elegant techniques\nto arrive at an intersection theorem for systems of sets; there are also results for partitions,\nsuch as Meagher and Moura [14] or Ku and Renshaw [12], and a variety of other classes of\ncombinatorial objects.\nThere is also a contingent of EKR papers that seek not to derive new results but instead\nto provide new proofs for old ones. Katona's proof is one such paper, but there are a number\nmore. These include Balogh and Mubayi [3] as well as Frankl and Tokushige [8], amongst\nothers. In general, there is much to be gained from a fresh perspective and departure\nfrom standard techniques. We would like to emphasize that this in no way detracts from\nthe immensely clever and powerful methods used to obtain these results in the first place;\nrather, these reproofs serve to broaden our understanding of the relevant results.\n\n3\n\n\f3\n\nFamilies Under Standard Intersection\n\nIn this section, we will derive Erdős–Ko–Rado-like theorems for families of objects under the\nstandard notion of intersection. Our first modification to the EKR problem will be to add\na component of order to our k-sets. So instead of looking at families of k-sets, we will look\nat families of k-permutations of [n] (we define a k-permutation as an ordered k-set). We'll\ndefine a family P of k-permutations to be intersecting if every P, Q ∈ P satisfy |P ∩ Q| ≥ 1.\nA trivial family has all of its k-permutations sharing a common element (and contains all\npossible sets possessing said element).\nTheorem 3.1. Let P be an intersecting collection of k-permutations on [n], n ≥ 2k. Then\n\u0013\n\u0012\nn−1\n.\n|P| ≤ k!\nk−1\nFurthermore, equality occurs if and only if P is a trivial family.\nProof. We break P up into classes that have the same relative ordering of their elements.\nDefine an equivalence relation ∼ on P such that for P = (p1 , . . . , pk ), Q = (q1 , . . . , qk ), P ∼ Q\nwhen for all 1 ≤ i, j ≤ k,\npi ≤ pj ⇔ qi ≤ qj\n(that is, P and Q have the same ordering of their elements). Then we \u0001can apply the Erdős–\nKo–Rado theorem to find that each equivalence class has at most n−1\nelements, and there\nk−1\n\u0001\nare clearly at most k! equivalence classes, leading to a total of at most k! n−1\nelements.\nk−1\nFurthermore, this maximum is attained only if each equivalence class is a trivial family; it\nis not hard to show that P must also have been a trivial family. After we check that the\ntrivial family attains the maximum value, the result follows.\nNote that this theorem followed by strategically reducing our new problem to a previous\nEKR result. We will see that this is a general theme, and hence a technique of some promise.\nWe now head in a different vein. Instead of imposing order on our sets, we'll drop the restriction that elements must appear only once in our sets. That is, we'll consider intersecting\nfamilies of k-multisets, or multisets with k-elements. The definition of an intersecting family\nM of multisets is precisely analogous to what we've seen before (every pair of elements in M\nhave at least one element in common), and a trivial family is the collection of all multisets\ncontaining a fixed element of [n].\nTheorem 3.2. Let M be an intersecting collection of k-multisets on [n], n ≥ 2k. Then\n\u0013\n\u0012\nn+k−2\n|M| ≤\nk−1\nEquality is attainable and occurs if and only if M is a trivial collection; that is, there is\nsome element that belongs to every multiset of M.\n\n4\n\n\fProof. Let Si (M) = {M|M ∈ M and M contains precisely i distinct elements}. Since\nk\n[\n\nS i = M,\n\ni=1\n\nwe see that {S i } defines a partition of M. Furthermore, since M is intersecting, it follows\nthat each S i is intersecting as well. If M is a multiset and S is a set, we say that M\nreduces to S if the elements of M and S are precisely the same. Let S ′i = {S : ∃M ∈\nS i such that M reduces to S}. Since Si′\u0001 is an intersecting family of i-sets, by the Erdős-KoRado theorem we have that |Si′ | ≤ n−1\n.\ni−1\n\u0001\n′\nNow let S ∈ Si . The number of k-multisets that reduce to S can be calculated as k−1\ni−1\n\u0001 n−1\u0001\nusing your standard stars-and-bars counting argument. So we have that |Si | ≤ k−1\n.\ni−1\ni−1\nThus, we have that\nPk k−1\u0001 n−1\u0001\nP\n|M| = ki=1 |Si | ≤\ni=1 i−1 \u0001 i−1\n\u0001\nPk−1\nk−1\nn−1\n=\ni=0 \u0001 i\nn−i−1\n= n+k−2\nk−1\nafter massaging appropriately.\nNow if M \u0001is a trivial family, we can apply the same sort of counting argument to obtain\n|M| = n+k−2\n, the above maximal value. Conversely, if M is an intersecting family such\nk−1\nthat |M| is maximal, \u0001then \u0001we must have equality in all of the inequalities we summed. In\nn−1\nparticular, S1 = k−1\n= 1, meaning that M contains a set with only one distinct\n0\n0\nelement. Since M is intersecting, every other element of M contains this element as well,\nimplying that M is a trivial collection.\n\nFinally, we make one more transition to round out this section. We now both add a\ncomponent of order and remove the restriction that elements must appear only once in our\nk-sets. That is, we now consider k-words on [n], or ordered k-tuples such that each entry\nis an element of [n]. We will keep the same concept of intersection (the intersection W ∩ V\nbetween two words is defined as the multiset of elements that appear somewhere in both W\nand V , multiplicities included), intersecting families, and trivially intersecting families.\nTheorem 3.3. Let W be an intersecting collection of k-words on [n], n ≥ 2k. Then\n|W| ≤ nk − nk−1 .\nFurthermore, |W| attains this maximal value when and only when W is trivial.\nProof. As before, let's try to relate this version of EKR back to what we already know.\nDefine an equivalence relation ⊲⊳ on W as follows: for W = w1 . . . wk , V = v1 . . . vk , then\nW ⊲⊳ V when, for all 1 ≤ i, j ≤ k,\nwi = wj ⇔ vi = vj .\nInformally, we could say that W and V have the same pattern of equality of letters. It is\nnot hard to check that indeed ⊲⊳ is an equivalence relation. If E is an equivalence class of ⊲⊳,\nlet E ′ be the set obtained by converting all of E's elements to k-permutations (in particular,\n5\n\n\fby retaining only the first occurrence of each element). So if E = {113233, 223433, . . .}, we\nwould have E ′ = {132, 234, . . .}.\nWe note that by construction, E ′ is an intersecting family of i-permutations for some\ni ≤ k, and hence by Theorem 3.1 has maximal size if it is a trivial family. Furthermore,\n|E| = |E ′ |, so we see that |W| is maximized if all of the |E ′ | are maximized. It is not hard to\ncheck that if W is a trivial family, each E ′ is a trivial family of k-permutations, and hence\n|W| is maximized. Conversely, if |W| is maximal, then there must be an equivalence class\ncontaining sets with only one distinct element, implying that W is trivial. We calculate the\nsize of a trivial collection as nk − nk−1 , completing our proof.\nWe have sampled only a quick bite of the diversity of generalizations available, and we\nhope we have whetted the reader's appetite for more. In our next section, we consider a\ndifferent definition of what it means to be intersecting.\n\n4\n\nFamilies Under Hamming Intersection\n\nA notion from coding theory will shape our work in this next section. Recall that the\nHamming distance between two words is defined as the number of positions in which the two\nwords differ (so the Hamming distance between (1, 3, 5) and (1, 4, 5) is 1). Analogously, we\ndefine the size of the Hamming intersection between two words W and V , |W ∩H V |, to be\nthe number of positions in which W and V agree. Thus we have that |(1, 3, 5)∩H (1, 4, 5) = 2.\nIn this new context, we return to and extend our previous results for k-permutations and\nk-words (Hamming intersection is not defined for multisets). First of all, we should start\nthinking about k-permutations. The concepts we used before extend readily: a family P is\nHamming intersecting if for each pair P, Q ∈ P, |P ∩H Q| ≥ 1, and a trivial family is one\nthat has a fixed element appear in a fixed position for each permutation in the family (and\ncontains all such k-permutations).\nNotice that our proof of Theorem 3.1 is useless in this new context, and hence we must\nturn to a new technique. As it turns out, we can use a variant of Katona's [10] probabilistic\nmethod. Ku and Leader [13] were the first to notice this, and they successfully developed\na proof that involved examining bijections between [n] × [n] and [n2 ]. We present our own\nvariant that is slightly simpler.\nTheorem 4.1. Let P be a Hamming intersecting family of k-permutations on [n], n ≥ k.\nThen\n(n − 1)!\n.\n|P| ≤\n(n − k)!\n(n−1)!\nFurthermore, |P| = (n−k)!\nis attainable by the trivial family. (However, we make no claim\nthat it is only attainable by such a family.)\n\nProof. Let σ = σ(1)σ(2) . . . σ(n) be a permutation of {1, 2, . . . , n}. We see that when read\ncyclically, each σ contains at most 1 element of P as a subword, since any two distinct length\nk subwords of σ will not have any two letters in the same position. Furthermore, each kpermutation in P is a subword of exactly n(n − k)! permutations (n choices for the position\n\n6\n\n\fof the head of the subword, and the other n − k letters can be arranged in any order). Thus\nwe have that\n|P|n(n − k)! ≤ n! * 1,\nwhich simplifies to\n|P| ≤\n\n(n − 1)!\n.\n(n − k)!\n\nFurthermore, if we let P be a trivial family, we have that\n|P| = (n − 1)(n − 2) * * * (n − k + 1) =\n\n(n − 1)!\n,\n(n − k)!\n\nas desired.\nThe remaining natural question is to ask is for the case of k-words with Hamming intersection. At this point, the reader can likely predict how we're going to define intersecting\nfamilies, but we include it for completeness. We say that W is a Hamming intersecting\nfamily of words if for each W, V ∈ W, we have that |W ∩H V | ≥ 1, and a trivial family is one\nthat contains all words having a certain fixed element appearing in a certain fixed position.\nWords under Hamming intersection have come up in an EKR context in a variety of\npapers. Ahlswede and Khachatrian [1] give an excellent overview of what has been done in\nthis area. In their paper, Ahlswede and Khachatrian prove an EKR-like theorem for the\nt-intersecting case. Incidentally, Frankl and Tokushige [8] came to the same theorem in a\ndifferent context, utilizing another set of tactics. While our methods are not powerful enough\nto attack the t-intersecting version, we use the toolkit we have been building in this paper\nto concisely prove the 1-intersecting case.\nTheorem 4.2. Let W be a Hamming intersecting collection of k-words on n. Then\n|W | ≤ nk−1 .\nAlso, we can obtain |W | = nk−1 via a trivial family.\nProof. Recall our equivalence relation ⊲⊳ from the proof of Theorem 3.3, where given W =\nw1 . . . wk , V = v1 . . . vk , W ⊲⊳ V when for all 1 ≤ i, j ≤ k,\nwi = wj ⇔ vi = vj .\nAs before, let E be an equivalence class of ⊲⊳, and define E ′ as the set obtained by converting\nall of E's elements to k-permutations.\nWe note that by construction, E ′ is a Hamming intersecting collection of i-permutations\nfor i ≤ n, and hence by Theorem 4.1 has maximal size if it is a trivial family. Furthermore,\n|E| = |E ′ |, so we see that |W| is maximized if all of the |E ′ | are maximized. It is not hard\nto check that if W is a trivial collection, each E ′ is a trivial construction of k-permutations,\nand hence |W| is maximized. We calculate the size of a trivial collection as nk−1 , completing\nour proof.\n\n7\n\n\f5\n\nConclusions and Future Directions\n\nAt this point, we have visited a number of different generalizations of the Erdős–Ko–Rado\nTheorem. In each of our proofs, we noticed that we required only elementary techniques\nto arrive at the desired conclusion. Some of our results have long been discovered, but the\nmethodology is the real gem to mine from this text.\nOur results are only the tip of the iceberg, however. There are many possible directions\nto go from here. Some of our proofs generalize immediately to t-intersecting systems (where\nthe size of the intersection is required to be at least t instead of at least 1); others may\nnot generalize at all. We note that our proof of Theorem 4.2 in particular has potential\nto be generalized to t-Hamming intersecting collections (which would be essentially the\nsame as the Ahlswede and Khachatrian [1]-Frankl and Tokushige [8] result). However, our\ngeneralization would rely on the following conjecture:\nConjecture 5.1. Let P be a t-Hamming intersecting collection (every P, Q ∈ P satisfies\n|P ∩H Q| ≥ t) of k-permutations on [n], n ≥ n0 (k, t). Then\n|W | ≤\n\n(n − t)!\n.\n(n − k)!\n\nOne should note that the Katona-style probabilistic argument we used in Theorem 4.1\nbreaks down for t-intersecting families. However, all hope is not lost. Recently, there has\nbeen been some work done on trying to generalize Katona's proof to the 2- and 3-intersecting\ncases; see Howard and Károlyi [9] for details.\nAnother conjecture we would like to pose is the following:\nConjecture 5.2. Let M be a t-intersecting collection of k-multisets on [n], n ≥ n0 (k, t).\nThen\n\u0013\n\u0012\nn+k−t−1\n.\n|M| ≤\nk−t\nFurthermore, equality is achieved if and only if M is a trivial collection.\nAn interesting note is that the conjecture, if true, would imply that there are as many tintersecting k-multisets on [n] as there are t-intersecting k-sets on [n+k−1], given appropriate\nn, k, t.\nIn any case, we hope that the reader has enjoyed this foray into elementary techniques\nfor Erdős–Ko–Rado results. Our paper is far from the first, and hopefully far from the last,\nto attempt to find simple proofs for these facts. We hope that at the very least, we have\ninspired the reader to consider simple methods as tools for constructing elegant solutions to\ngeneral problems.\n\n6\n\nAcknowledgements\n\nThe authors are indebted to Dr. Anant Godbole for his supervision at the 2008 East Tennessee State University REU. This work was supported by NSF grant 0552730.\n\n8\n\n\fReferences\n[1] R. Ahlswede and L. Khachatrian, The diametric theorem in Hamming space-optimal\nanticodes, 1998.\n[2] Rudolf Ahlswede and Levon H. Khachatrian, The complete intersection theorem for\nsystems of finite sets, Eur. J. Comb. 18 (1997), no. 2, 125–136.\n[3] József Balogh and Dhruv Mubayi, Note: A new short proof of a theorem of Ahlswede\nand Khachatrian, J. Comb. Theory Ser. A 115 (2008), no. 2, 326–330.\n[4] P. Erdős, C. Ko, and R. Rado, Intersection theorems for systems of finite sets, Quart.\nJ. Math. Oxford (2) 12 (1961), 313–320.\n[5] P. Erdős and G. Szekeres, A combinatorial problem in geometry, Compositio Math 2\n(1935), 463–470.\n[6] P. Frankl, The Erdős-Ko-Rado theorem is true for n = ckt, Col. Soc. Math. J. Bolyai\n18 (1978), 365–375.\n[7] P. Frankl and Z. Füredi, Extremal problems concerning Kneser graphs, Journal of Combinatorial Theory, Series B 40 (1986), 270–284.\n[8] P. Frankl and N. Tokushige, The Erdős–Ko–Rado theorem for integer sequences.\n[9] Ralph Howard and Gyula Károlyi, Towards a Katona type proof for the 2-intersecting\nErdős–Ko–Rado theorem.\n[10] G. O. H. Katona, A simple proof of the Erdős–Chao Ko–Rado theorem, Journal of\nCombinatorial Theory (B) 13 (1972), 183–184.\n[11] Gy. Katona, Intersection theorems for systems of finite sets, Acta Math. Acad. Sci.\nHungar. 15 (1964), 329–337.\n[12] Cheng Yeaw Ku and David Renshaw, Erdős–Ko–Rado theorems for permutations and\nset partitions, Journal of Combinatorial Theory, Series A 115 (2008), 1008–1020.\n[13] C.Y. Ku and I. Leader, An Erdős-Ko-Rado theorem for partial permutations, Discrete\nMathematics 306 (2006), 74–86.\n[14] Karen Meagher and Lucia Moura, Erdős–Ko–Rado theorems for uniform set-partition\nsystems, Electronic Journal of Combinatorics 12 (2005).\n[15] Paul Erdős, My joint work with Richard Rado, Surveys in Combinatorics, London Math.\nSoc. Lecture Note Series 123, 53–80.\n[16] F. P. Ramsey, On a problem of formal logic, Proc. London Math. Soc. 30 (1930), 264–\n286.\n[17] E. Sperner, Math. Z. 27 (1928), 544–8.\n9\n\n\f[18] Douglas B. West, Introduction To Graph Theory: Second Edition, Prentice Hall, New\nJersey, USA, 2001.\n[19] Richard M. Wilson, The exact bound in the Erdős–Ko–Rado theorem, Combinatorica 4\n(1984), 247–257.\nGreg Brockman\nHarvard University\nCambridge, MA\nUnited States\ngbrockm@fas.harvard.edu\n\nBill Kay\nUniversity of South Carolina\nColumbia, SC\nUnited States\nkayw@mailbox.sc.edu\n\n10\n\n\f"}