{"id": "http://arxiv.org/abs/0808.2430v2", "guidislink": true, "updated": "2008-09-23T08:07:31Z", "updated_parsed": [2008, 9, 23, 8, 7, 31, 1, 267, 0], "published": "2008-08-18T17:56:47Z", "published_parsed": [2008, 8, 18, 17, 56, 47, 0, 231, 0], "title": "Hopping conduction in strong electric fields: Negative differential\n  conductivity", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0808.0332%2C0808.2312%2C0808.0980%2C0808.3706%2C0808.3730%2C0808.3127%2C0808.2482%2C0808.2660%2C0808.3862%2C0808.2254%2C0808.0035%2C0808.2972%2C0808.2592%2C0808.1134%2C0808.0437%2C0808.2480%2C0808.0615%2C0808.3566%2C0808.1504%2C0808.2734%2C0808.3325%2C0808.2160%2C0808.0051%2C0808.0877%2C0808.1782%2C0808.1441%2C0808.0404%2C0808.0776%2C0808.2090%2C0808.4110%2C0808.2965%2C0808.3055%2C0808.3299%2C0808.2208%2C0808.2841%2C0808.1897%2C0808.3298%2C0808.4073%2C0808.3799%2C0808.2316%2C0808.2945%2C0808.3074%2C0808.2703%2C0808.2631%2C0808.1927%2C0808.0899%2C0808.0884%2C0808.3224%2C0808.1099%2C0808.1796%2C0808.0277%2C0808.0708%2C0808.1411%2C0808.0364%2C0808.0746%2C0808.3842%2C0808.3353%2C0808.2011%2C0808.3813%2C0808.2802%2C0808.3400%2C0808.3608%2C0808.2349%2C0808.4092%2C0808.3405%2C0808.2127%2C0808.1774%2C0808.2149%2C0808.2430%2C0808.2346%2C0808.0137%2C0808.1328%2C0808.3952%2C0808.1802%2C0808.0677%2C0808.0463%2C0808.3946%2C0808.2103%2C0808.0809%2C0808.2344%2C0808.1874%2C0808.4036%2C0808.1448%2C0808.2473%2C0808.3992%2C0808.0762%2C0808.0077%2C0808.2786%2C0808.3004%2C0808.0144%2C0808.0078%2C0808.1069%2C0808.2747%2C0808.2359%2C0808.1044%2C0808.1011%2C0808.0894%2C0808.2705%2C0808.2302%2C0808.3718%2C0808.2995&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Hopping conduction in strong electric fields: Negative differential\n  conductivity"}, "summary": "Effects of strong electric fields on hopping conductivity are studied\ntheoretically. Monte-Carlo computer simulations show that the analytical theory\nof Nguyen and Shklovskii [Solid State Commun. 38, 99 (1981)] provides an\naccurate description of hopping transport in the limit of very high electric\nfields and low concentrations of charge carriers as compared to the\nconcentration of localization sites and also at the relative concentration of\ncarriers equal to 0.5. At intermediate concentrations of carriers between 0.1\nand 0.5 computer simulations evidence essential deviations from the results of\nthe existing analytical theories.\n  The theory of Nguyen and Shklovskii also predicts a negative differential\nhopping conductivity at high electric fields. Our numerical calculations\nconfirm this prediction qualitatively. However the field dependence of the\ndrift velocity of charge carriers obtained numerically differs essentially from\nthe one predicted so far. Analytical theory is further developed so that its\nagreement with numerical results is essentially improved.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0808.0332%2C0808.2312%2C0808.0980%2C0808.3706%2C0808.3730%2C0808.3127%2C0808.2482%2C0808.2660%2C0808.3862%2C0808.2254%2C0808.0035%2C0808.2972%2C0808.2592%2C0808.1134%2C0808.0437%2C0808.2480%2C0808.0615%2C0808.3566%2C0808.1504%2C0808.2734%2C0808.3325%2C0808.2160%2C0808.0051%2C0808.0877%2C0808.1782%2C0808.1441%2C0808.0404%2C0808.0776%2C0808.2090%2C0808.4110%2C0808.2965%2C0808.3055%2C0808.3299%2C0808.2208%2C0808.2841%2C0808.1897%2C0808.3298%2C0808.4073%2C0808.3799%2C0808.2316%2C0808.2945%2C0808.3074%2C0808.2703%2C0808.2631%2C0808.1927%2C0808.0899%2C0808.0884%2C0808.3224%2C0808.1099%2C0808.1796%2C0808.0277%2C0808.0708%2C0808.1411%2C0808.0364%2C0808.0746%2C0808.3842%2C0808.3353%2C0808.2011%2C0808.3813%2C0808.2802%2C0808.3400%2C0808.3608%2C0808.2349%2C0808.4092%2C0808.3405%2C0808.2127%2C0808.1774%2C0808.2149%2C0808.2430%2C0808.2346%2C0808.0137%2C0808.1328%2C0808.3952%2C0808.1802%2C0808.0677%2C0808.0463%2C0808.3946%2C0808.2103%2C0808.0809%2C0808.2344%2C0808.1874%2C0808.4036%2C0808.1448%2C0808.2473%2C0808.3992%2C0808.0762%2C0808.0077%2C0808.2786%2C0808.3004%2C0808.0144%2C0808.0078%2C0808.1069%2C0808.2747%2C0808.2359%2C0808.1044%2C0808.1011%2C0808.0894%2C0808.2705%2C0808.2302%2C0808.3718%2C0808.2995&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Effects of strong electric fields on hopping conductivity are studied\ntheoretically. Monte-Carlo computer simulations show that the analytical theory\nof Nguyen and Shklovskii [Solid State Commun. 38, 99 (1981)] provides an\naccurate description of hopping transport in the limit of very high electric\nfields and low concentrations of charge carriers as compared to the\nconcentration of localization sites and also at the relative concentration of\ncarriers equal to 0.5. At intermediate concentrations of carriers between 0.1\nand 0.5 computer simulations evidence essential deviations from the results of\nthe existing analytical theories.\n  The theory of Nguyen and Shklovskii also predicts a negative differential\nhopping conductivity at high electric fields. Our numerical calculations\nconfirm this prediction qualitatively. However the field dependence of the\ndrift velocity of charge carriers obtained numerically differs essentially from\nthe one predicted so far. Analytical theory is further developed so that its\nagreement with numerical results is essentially improved."}, "authors": ["A. V. Nenashev", "F. Jansson", "S. D. Baranovskii", "R. Österbacka", "A. V. Dvurechenskii", "F. Gebhard"], "author_detail": {"name": "F. Gebhard"}, "author": "F. Gebhard", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1103/PhysRevB.78.165207", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/0808.2430v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0808.2430v2", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "12 pages, 12 figures. References added, figures improved", "arxiv_primary_category": {"term": "cond-mat.dis-nn", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cond-mat.dis-nn", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0808.2430v2", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0808.2430v2", "journal_reference": "Phys. Rev. B 78, 165207 (2008)", "doi": "10.1103/PhysRevB.78.165207", "fulltext": "Hopping conduction in strong electric fields:\nNegative differential conductivity\nA. V. Nenashev,1, 2, ∗ F. Jansson,3, 4 S. D. Baranovskii,5 R. Österbacka,4 A. V. Dvurechenskii,1, 2 and F. Gebhard5\n\narXiv:0808.2430v2 [cond-mat.dis-nn] 23 Sep 2008\n\n1\n\nInstitute of Semiconductor Physics, 630090 Novosibirsk, Russia\n2\nNovosibirsk State University, 630090 Novosibirsk, Russia\n3\nGraduate School of Materials Research, Åbo Akademi University, 20500 Turku, Finland\n4\nDepartment of Physics and Center for Functional Materials, Åbo Akademi University, 20500 Turku, Finland\n5\nDepartment of Physics and Material Sciences Center, Philipps-University, 35032 Marburg, Germany\n(Dated: November 3, 2018)\nEffects of strong electric fields on hopping conductivity are studied theoretically. Monte-Carlo\ncomputer simulations show that the analytical theory of Nguyen and Shklovskii [Solid State Commun. 38, 99 (1981)] provides an accurate description of hopping transport in the limit of very\nhigh electric fields and low concentrations of charge carriers as compared to the concentration of\nlocalization sites and also at the relative concentration of carriers equal to 0.5. At intermediate\nconcentrations of carriers between 0.1 and 0.5 computer simulations evidence essential deviations\nfrom the results of the existing analytical theories.\nThe theory of Nguyen and Shklovskii also predicts a negative differential hopping conductivity\nat high electric fields. Our numerical calculations confirm this prediction qualitatively. However\nthe field dependence of the drift velocity of charge carriers obtained numerically differs essentially\nfrom the one predicted so far. Analytical theory is further developed so that its agreement with\nnumerical results is essentially improved.\nPACS numbers: 72.20.Ht, 72.20.Ee, 72.80.Ng, 72.80.Le\n\nI.\n\nINTRODUCTION\n\nHopping conduction in solids governed by strong electric fields is in the focus of intensive theoretical and experimental study since several decades [see, for instance,\nchapter 7 in Ref. 1 and references therein]. In recent\nyears, particular interest to this research area has been\ncaused by growing device applications of amorphous organic and inorganic materials in which the incoherent\nhopping transitions of charge carriers between spatially\nand energetically distributed localized states dominate\nthe optoelectronic phenomena [see, for instance, Ref. 2\nand references therein]. One of the mostly discussed\ntopics is whether the differential negative conductivity\n(NDC), i.e., the decreasing conductivity with increasing\nelectric field, is possible in the hopping regime. The discussion was, to much extent, provoked by the reports\non the apparent decrease of the drift mobility with rising\nelectric field at relatively high temperatures and low field\nstrengths in disordered organic materials.3,4,5,6,7,8,9,10\nThis apparent decrease of the mobility with increasing\nelectric field was reported to be succeeded by the increase\nof the mobility at higher field strengths. However, the\nself-consistent effective-medium theory for drift and diffusion at low electric fields11 does not show any decrease\nof the mobility with increasing field. Furthermore, it has\nbeen shown experimentally12 and theoretically13 that the\napparent decrease of the mobility with rising field at low\nfield strengths is an artifact. The experimental data were\nobtained by the time-of-flight technique, in which charge\ncarriers are created close to one surface of a sample with a\ngiven thickness L and the transient time τtr is measured,\nwhich is needed for charge carriers to reach the opposite\n\nsurface of the sample at a particular strength of the applied electric field F . Then the drift mobility is calculated\nas μ = L/(τtr F ). However, at high temperatures and low\nelectric fields the current transients in the time-of-flight\nexperiments are determined mostly by diffusion of charge\ncarriers rather than by their drift. Therefore, using the\ndrift formula one strongly overestimates the mobility. It\nis the presence of the field strength in the denominator\nthat leads to the apparent \"increase\" of the mobility at\ndecreasing F .12,13 If one uses at low fields and high temperatures the diffusion formulas instead of the drift ones,\nthen no decrease of the mobility with increasing field can\nbe claimed at low electric fields.12,13\nThis result does not exclude, however, the possibility of the NDC in the hopping regime. Böttger and\nBryksin14 and Shklovskii et al.15,16 have suggested analytical theories for the mobility and conductivity decreasing with increasing electric field in various disordered materials. Remarkably, this effect of the negative\ndifferential conductivity is to be expected at high field\nstrengths. This regime succeeds the very strong increase\nof the mobility with rising field,15,16 and does not precede it at lower fields as claimed on the basis of the drift\nequations.3,4,5,6,7,8,9,10\nThe decreasing conductivity with increasing electric\nfield at high field strengths has been observed experimentally for hopping transport in lightly doped and\nweakly compensated crystalline silicon.17,18,19 The hopping transport mode in such systems at low electric fields\nhad been described theoretically in all detail,20 which\nmade these systems particularly attractive for studying\nthe new non-Ohmic effects. Shklovskii et al.15,17,18,19 developed an analytical theory, which predicted the NDC\n\n\f2\neffect in the lightly doped weakly compensated semiconductors. The experimental observations in lightly\ndoped and weakly compensated crystalline silicon appear\nin qualitative agreement with his theoretical predictions.\nFurthermore computer simulations of Levin et al.21 confirmed qualitatively the existence of the NDC effect,\nthough no quantitative comparison with the analytical\ntheory15 has been attempted. Recent interest in the NDC\neffect has been caused by its importance for construction\nof memory devices. These devices typically contain conducting particles embedded into a nonconductive material. For such devices, made from both inorganic22,23 and\norganic24,25,26,27,28 materials, NDC and switching phenomena have been reported. Since electrical conduction\nin the materials, which are currently being tried for device applications, is dominated by hopping of charge carriers, it is necessary to study the possibility of the NDC\nin this regime in more detail.\nIn the present paper we report on the theoretical study\nof hopping transport in high electric fields. In Section\nII we describe the theoretical model and briefly outline the analytical approach suggested by Nguyen and\nShklovskii15 for the limit of extremely high electric fields.\nIn Section III we present our results obtained by straightforward Monte Carlo computer simulations and show the\nrange of applicability for the analytical theory of Nguyen\nand Shklovskii. In Section IV we further develop the analytical theory whereby we improve its agreement with the\nresults of computer simulations. In particular, the analytical dependence of the drift mobility on the concentration of charge carriers comes in better agreement with the\nsimulation results. Section V is dedicated to the NDC. A\nnew numerical algorithm has been developed to study the\nNDC effect theoretically. Numerical results obtained in\nthe framework of this algorithm confirm qualitatively the\nconclusion of Nguyen and Shklovskii on the possibility of\nthe NDC in the hopping regime. However, the field dependence of the drift velocity of charge carriers obtained\nnumerically differs essentially from the one predicted so\nfar.15 We suggest in Section V a further development of\nthe analytical theory, improving essentially its agreement\nwith numerical results. Concluding remarks are gathered\nin Section VI.\n\nII.\n\nMODEL AND THEORETICAL\nBACKGROUND\n\nAiming to clarify whether the NDC effect is inherent\nfor the hopping transport regime, we consider first, following Nguyen and Shklovskii,15 the simplest possible\nmodel-a three-dimensional array of isoenergetic sites\nwith a random spatial distribution with the concentration N . Each site can be either empty or occupied by a\nsingle electron. Energies of electrons are equal on all sites\nso that no energy disorder and no electron-electron interactions between different sites are taken into account.\nOnly in the final part of Section V we study the ef-\n\nF\n\n(a)\n\nF\n\n(b)\n\nr\n\nr\n\nxi\n\nx\n\nh\n\nFIG. 1: The shape of optimal traps for the infinite (a) and a\nfinite (b) electric fields. The dotted path in (a) is forbidden\nat infinite fields but provides an escape route at finite fields\n\nfect of the energy disorder on the NDC. An electric field\nF = (−F, 0, 0) is put along the negative direction of the\naxis X, so that the drift velocity of the negatively charged\nelectrons is directed along the X axis. Conduction takes\nplace due to tunnelling hops of electrons between the localization sites. The rate Γij for an electron hop from\nsite i to site j is determined as\n\u0013 \u0012\n\u0013\n\u0012\neF (xj − xi )\n2dij\nf\nni (1 − nj ), (1)\nΓij = Γ0 exp −\na\nkT\nwhere dij is the distance between the sites, a is the localization length, e is the elementary charge, k is the\nBoltzmann constant, T is the temperature, and ni , nj\nare the occupation factors of the sites, (ni , nj ∈ {0; 1}).\nThe function f is related to energy the gain or the energy\nloss during the jump:\n(\n1,\nif α > 0,\nf (α) =\nexp(α), if α < 0.\nIn the limit of infinite electric field, the factor\nf [eF (xj − xi )/kT ] reduces to the Heaviside's function\nθ(xj − xi ).\nBelow we will assume that Γ0 = e = 1. As a measure\nof length, we introduce the typical distance between the\nneighboring sites R = N −1/3 .\nUsing this simple model, Nguyen and Shklovskii15 have\nshown analytically that the effect of the NDC is inherent\nfor hopping transport. Let us consider briefly their arguments starting from the case of infinitely high fields F\nand extremely small electron concentrations ne . Under\nsuch circumstances each electron can be treated independently from the others and electrons can move only\ntoward the increasing values of their x coordinate. In\nFig. 1 this is the direction to the right. At each jump,\nan electron moves along the axis X to a distance ≃ R,\nso that its drift velocity can be estimated as v ≃ R/τ ,\nwhere τ is an average time between jumps (dwell time).\nA dwell time τi for hopping from the site i is of the order of exp(2ri /a), where ri is the distance from site i to\nits nearest neighbor \"to the right\", i.e. with co-ordinate\nx larger than xi . In other words, ri is the maximum\n\n\f3\nradius of a hemisphere centered at the site i that does\nnot contain any other sites (Fig. 1(a)). If ri is much\nlarger than R (the typical distance between the neighboring sites), such an empty hemisphere can be considered\nas a trap for electrons. The contribution of traps with\nradii in the range [r, r + dr] to the average dwell time\nτ is proportional to τ (r) = exp(2r/a), and also to the\nprobability of the corresponding configuration of sites,\np(r)dr = 2πN r2 exp(−2πN r3 /3)dr:\nτ=\n\nZ∞\n0\n\nτ (r)p(r)dr =\n\nZ∞\n0\n\n2\n\n2πN r exp\n\n\u0012\n\n\u0013\n2r 2πN 3\n−\nr dr.\na\n3\n\n(2)\nThis integral is easy to evaluate, taking into account\nthat\n√ the integrand has a sharp maximum at r = rm ≡\n1/ πN a. Consequently one obtains for the current density j = ne v\n\u0012 \u0013 32 !\nR\n4\nne R\n3\n1/4\n≃ ne (a R) exp − √\njF →∞,ne →0 ≃\n.\nτ\n3 π a\n(3)\nTherefore, one can conclude that in the limit F →\n∞, ne → 0 the current is determined by hemispherical\n√\ntraps (Fig. 1a) with an \"optimal\" radius rm = 1/ πN a.\nIn the case of finite electric fields, a hemispherical trap\nis not an efficient one, because an electron has a possibility to move in the energetically unfavored directions,\nand thus to escape the trap (for example, along the\ndotted arrows in Fig. 1(a)). According to Nguyen and\nShklovskii,15 an \"optimal\" trap for an electron in large\nthough finite electric fields F consists of a hemisphere to\nthe right and of a cone to the left of the site on which\nan electron is captured, with a chain of sites along the X\naxis that provides an easy path into the trap (Fig. 1b).\nThe height h of the cone is chosen so that it is equally\nhard to escape the trap in all directions taking the chain\nalong the X axes into account: h = 2rkT /F a. Therefore,\nthe smaller is the field, the larger is the volume of a trap\nwith the same dwell time, and consequently the smaller is\nthe probability p(r) of finding\nR ∞such a trap. It means that\nthe average dwell time τ = 0 τ (r)p(r)dr decreases with\ndecreasing field strength, and concomitantly the current\ndensity j ≃ ne R/τ increases with decreasing field. This\nis the essence of the physical mechanism that causes the\nNDC effect.15 To obtain an expression for the current\ndensity, one can substitute the volume of the trap shown\nin Fig. 1b, Vtrap = (1 + kT /F a)2πr3 /3, instead of the\nhemispherical trap volume, 2πr3 /3, into the integral (2).\nThe result reads\n\"\n\u0012 \u0013 32 \u0012\n\u0013− 21 #\nR\nkT\n4\n3\n1/4\n1+\n.\njne →0 ≃ ne (a R) exp − √\n3 π a\nFa\n(4)\nThis is the mathematical expression for the NDC. The\napproach leading to this expression is applicable only for\nfields F ≫ kT /R. In smaller fields, the assumption that\nalmost every jump is directed along the axis X is vio-\n\nlated. Therefore one should expect that Eq. (4) overestimates the current density for F ≃ kT /R.\nEquations (3) and (4) are valid only if the concentration of electrons ne is small as compared to the concentration of \"optimal\" traps, nm = N exp[−N Vtrap (rm )]. In\nthe opposite case, nm ≪ ne ≪ N , the \"optimal\" traps\nare almost always occupied and play a negligible role. In\nsuch a case the most important traps, which determine\nthe drift velocity of electrons, are the ones whose concentration is equal to ne . One can estimate the electron\ndrift velocity as v = 1/τ (rn )ne S, where rn is a radius of\nthe most important traps, τ (rn ) is their dwell time, S is\ntheir capture crosssection. Assuming S ≃ R2 ≡ N −2/3 ,\none obtains for the current flow j = ne v ≃ N 2/3 τ (rn )−1 .\nFor an infinitely large field, the radius rn is defined via\n\u0012\n\u0013\n2πN 3\nne = N exp(−N Vtrap (rn )) ≡ N exp −\nr ,\n3 n\nthat gives rn = R\nrent density is\nj F →∞,\nnm ≪ne ≪1\n\n15\n\n\u0010\n\n3\n2π\n\nlog nNe\n\n\u00111/3\n\n. Consequently, the cur-\n\n\"\n\u0012\n\u00131#\n2\nN 3\nN 2/3\n2 3\n≃ N 3 exp −\nlog\n≃\n.\nτ (rn )\na 2π\nne\n\n(5)\nThe corresponding expression for the concentration\nrange nm ≪ ne ≪ N in the case of finite electric fields\nwas also obtained by Nguyen and Shklovskii [see Eq. (11)\nin Ref. 15].\nThe case of almost filled sites, ne ≈ N , is similar to the\ncase of almost empty sites, ne ≈ 0 due to electron-hole\nsymmetry. The current density is a symmetrical function\nof the electron concentration: j(ne ) = j(N − ne ).\nNguyen and Shklovskii15 also emphasized that a special consideration is needed for the case of half-filled system, ne = N/2. They have shown that the concept of\ndirected percolation can be used to obtain the current\ndensity at infinitely high electric fields. In the half-filled\nsystem the trapping of electrons does not play any role,\nbecause (due to the electron-hole symmetry) it does not\nchange the electron concentration on the infinite cluster\nwhich is responsible for the current. Current is determined by electron jumps to distances d ∈ [rcd , rcd + a/2],\nwhere rcd is the percolation threshold of a directed percolation problem. The number of pairs of sites with distances d ∈ [rcd , rcd + a/2] in the infinite cluster per unit\narea is 1/L2⊥ , where L⊥ = R (2rcd /a)ν⊥ is a transversal\ncorrelation length of the percolation cluster, and ν⊥ is a\ncritical index.15 The current density is equal to15\n\u0012\n\u00132ν⊥\n\u0013\n\u0012\n2\n1\na\n2rcd\n3\nj F →∞, ≃ 2\n.\nexp\n−\n=\nN\nL⊥ τ (rcd )\n2rcd\na\nne =1/2\n\n(6)\nNguyen and Shklovskii15 have also obtained the value of\nthe percolation threshold rcd = (0.93 ± 0.01) R and that\nof the correlation length index ν = 1.2 ± 0.1.\n\n\f4\n-1\n\n10\n\n(a)\n-2\n\n10\n\nv (R)\n\nThe above arguments of Nguyen and Shklovskii15 provide an analytical theory of non-Ohmic hopping conduction, based on the concept of the trapping-determined\ntransport. The theory is valid for the case of large electric fields in two concentration ranges: ne ≪ nm and\nnm ≪ ne ≪ N . Most remarkably, this theory predicts\nthe effect of the NDC. Also a theory for the case of the\nhalf-filled system (ne = N/2) for infinitely high electric\nfields (F → ∞) has been suggested based on the directedpercolation-approach.15\nBelow we present our numerical study of the fielddependent hopping conductivity. It shows the range\nof validity for the analytical theory of Nguyen and\nShklovskii.15 Furthermore, the analytical theory is developed below in order to improve the agreement between\nthe analytical and numerical results.\n\n-3\n\n10\n\n-4\n\n10\n\nEq. (3)\nEq. (11)\nsimulation\n\n-5\n\n10\n\n0.15\n\n0.2\n\n0.25\n\n0.3\n0.35\na (R)\n\n0.4\n\n0.45\n\n0.5\n\n0.7\n0.6\n\nMONTE CARLO SIMULATIONS FOR\nINFINITELY HIGH FIELDS\n\nIn order to calculate the electron drift velocity and the\ncurrent density at high fields, we used a Monte Carlo\napproach. In the limit of infinitely high fields the direction of the electron motion is prescribed. Therefore\nit was possible to simulate by a Monte Carlo algorithm\nthe motion of an electron in an infinite medium along\nthe field direction and therefore to avoid any size effects.\nWithout loosing generality one can restrict the maximal\nlength of electron transitions involved into the algorithm\nby a reasonably large value dmax . In order to simulate\nthe k-th Monte Carlo step in the electron motion, one\nhas to store information only about sites inside a layer\nxk < x < xk + dmax , where xk is the electron coordinate before the k-th step. We have chosen dmax = 3R,\nwhich provides a possibility to hop to 2πd3max N/3 ≃ 57\nneighbors in average. For all sets of parameters used in\nthe simulation the size of the optimal trap rm considered\nby Nguyen and Shklovskii was essentially less than dmax .\nTherefore, the restriction imposed by dmax did not lead\nto any loss of generality. Before making the next step,\nthe computer can forget all the information about sites\nin the layer xk < x < xk+1 , but it has to get information\nabout new sites in a layer xk + dmax < x < xk+1 + dmax .\nAs these \"new\" sites did not affect the calculation at all\nprevious steps, they can be created at random. Therefore, each Monte Carlo step includes not only the choice\nof a jump, but also a generation of some \"new\" sites\nand deleting some \"old\" sites. To make their number\nfinite, one should restrict the system size in the directions perpendicular to the field, i.e. in the plane Y Z. A\ncalculation domain 0 < y < 120R, 0 < z < 120R with periodical boundary conditions in the plane Y Z was used.\nThe motion of a single electron was simulated within the\ndescribed algorithm in order to evaluate the drift velocity\nin the limit ne → 0.\nFor finite electron concentrations, we perform simulations in a cubic domain with size 60R × 60R × 60R\n\n(b)\n\n0.5\nv / vNS\n\nIII.\n\n0.4\n0.3\n0.2\n0.1\n0\n0.05\n\nEq. (11)\nsimulation\n0.1\n\n0.15\n\n0.2\n\n0.25\n\n0.3\n\n0.35\n\n0.4\n\n0.45\n\n0.5\n\na (R)\n\nFIG. 2: (a) Drift velocity v in the limit of infinitely large\nelectric field and small electron concentration, as a function\nof localization length a; (b) the same data divided by the\nvelocity value predicted in Ref. 15 (Eq. (3)).\n\nand with periodic boundary conditions for all three axes.\nThe rates of all possible jumps are calculated before\nstarting the Monte Carlo steps, but without the factor\nni (1 − nj ) related to occupation. This factor determines\nwhich jumps are allowed and which are forbidden. Information about allowed and forbidden jumps is updated at\neach step. We used a binary-tree data structure for storing the jump rates that gives the possibility to \"switch\non\" and \"off\" jumps efficiently.\nA routine Monte Carlo procedure has been used. In\neach Monte Carlo step the final site for electron hops\nwas calculated via the probabilities proportional to the\nhopping rates to different sites and the time ∆t spent to\njump was calculated via the reciprocal of the sum of rates\nof all possible jumps. Hops from an occupied site were\npossible to any empty one in the direction of increasing\ncoordinate x with the restriction that the hop distance\nis less than dmax ≡ 3R. At each hopping event the increment ∆x in electron x-coordinate is calculated. An\noutcome of the simulation is either an average velocity of\n\n\f5\nan electron,\n-6\n\nv=\n\nX\n\n∆x/\n\nX\n\n10\n\n∆t,\n\n-8\n\n10\n\nin the case of single electron hopping, or a flow of electrons,\nX\n1 X\n∆x/\n∆t,\nΩ\n\nin the case of finite electron concentrations (where Ω is\nthe volume of the calculation domain). The summation\nwas carried out over all sequential Monte Carlo steps.\nFor simulations of the behavior of a single electron in an\nempty system, 107 Monte Carlo steps were used for a >\n0.2R, 108 steps for a = 0.10R and 0.15R and 109 steps\nfor a = 0.07R. As a result, for a > 0.15R convergence\nwas not worse than 1%.\nFor finite electron concentration, 5 * 107 Monte Carlo\nsteps were used, this gave a convergence not worse than\n1% for a given realization. At a 6 0.1R, there were\nsometimes essential differences between current densities\nin different realizations. The scatter is shown by error\nbars in the figures.\nSimulation results for the electron drift velocity v =\nj/ne in the limit ne → 0 are shown in Fig. 2(a) by dots\nas a function of the localization length. The analytical result of Nguyen and Shklovskii (Eq. (3)) is shown\nby the solid line. One can see that Eq. (3) correctly\ndescribes the dependence of the drift velocity on the localization length and, furthermore, it correctly estimates\nthe magnitude of the velocity. The concept of Nguyen\nand Shklovskii on the hopping drift velocity controlled\nby hemispherical traps is herewith confirmed. However,\nthere is some deviation of the simulation data from the\nanalytical results. To make this deviation more transparent, we plot the ratio of the simulated drift velocity\nto its analytical prediction (Eq. (3)) in Fig. 2(b). It is\nseen that Eq. (3) overestimates the electron velocity by\na factor of two to five. In Section IVA, some reasons for\nthis mismatch will be considered. The analytical theory\nis further developed there to give a better agreement with\nthe simulation data. The result of the improved theory\nfor the drift velocity (Eq. (11)) is also shown in Fig. 2 by\nthe dashed line.\nThe dependence of the current density on the electron\nconcentration is shown in Figs. 3 and 4. Fig. 3 shows this\ndependence in a wide concentration range, in comparison\nwith the analytical results for small (ne ≪ nm , Eq. (3),\nsolid line) and intermediate (nm ≪ ne ≪ N , Eq. (5),\ndashed line) concentrations. One can see that the simulated concentration dependence can be roughly divided\ninto three parts: for very low concentrations (ne < nm )\nthe dependence is linear,37 in accordance with Eq. (3);\nthen, for nm < ne < 0.03N , it becomes superlinear, as\ndescribed by Eq. (5); and finally, for ne > 0.03N , this\ndependence is sublinear and is not described by the theory based on the transport controlled by traps. In Section IVB, we will present an analytical approach valid for\n\n10\n\n-12\n\n10\nj (N2/3)\n\nj=\n\na=0.15 R\n\n-10\n\na=0.1 R\n\n-14\n\n10\n\n-16\n\n10\n\n-18\n\n10\n\na=0.07 R\n-20\n\n10\n\nEq. (3)\nEq. (5)\nEq. (12)\nsimulation\n\n-22\n\n10\n\n-4\n\n10\n\n-3\n\n10\n\n-2\n\n10\nne (N)\n\n-1\n\n10\n\n0\n\n10\n\nFIG. 3: Current density j as a function of electron concentration ne for values of the localization length 0.2R, 0.1R, and\n0.07R (from top to bottom). The electric field is infinitely\nlarge.\n\nthe range of parameters covering the ranges of applicability of Eqs. (3) and (5). The result of this developed\napproach is Eq. (12) shown by dashed lines in Fig. 3.38\nOne can see that it provides an accurate description of\nthe current density for any concentration less than 0.03N .\nFor ne > 0.03N , the simulated values of the current\ndensity are smaller than those predicted by the analytical theory due to the following reason. At sufficiently\nlarge electron concentrations, the conducting paths are\nnot almost empty, as is assumed in the theory. Moreover, there are \"bottlenecks\" for the current, where the\nelectron concentration is much larger than the mean concentration ne . In these places, the factor of (1 − nj ) in\nEq. (1) turns out to be important, and due to this factor\nthe current density is suppressed.\nIn Fig. 4, the simulation results are shown for the whole\nrange of carrier concentrations. For convenience, all values of current density are divided by the maximum value\nfor the given localization length. For large localization\nlengths (a ≥ 0.15R), the concentration dependence of\nthe current density j obeys approximately a parabolic\nlaw: j(ne ) ∼ ne (N − ne ) at concentrations in the vicinity of the half filling. One can interpret this behavior in\nterms of the hopping rates, namely, by substituting the\nmean occupancy ne /N instead of ni and nj into Eq. (1).\nConcomitantly, one obtains that the contribution of each\npair of sites is proportional to ne (N − ne ). The same\nconcentration dependence is expected then for the current density.\nFig. 5 shows the simulated dependence of the current\ndensity on the localization length (dots) in comparison\n\n\f6\nmore than an order of magnitude from the numerical results. In this Section, we show how to improve the accuracy of the analytical theory.\n\n1\n0.9\n0.8\nj(ne) / j(N/2)\n\n0.7\n0.6\n\nA.\n\n0.4\n0.3\n\na = 0.05 R\na = 0.07 R\na = 0.10 R\na = 0.15 R\na = 0.20 R\n\n0.2\n0.1\n0\n0\n\n0.1\n\n0.2\n\n0.3\n\n0.4\n\n0.5 0.6\nne (N)\n\n0.7\n\n0.8\n\n0.9\n\n1\n\nFIG. 4: Current density j as a function of electron concentration ne , normalized on its maximum value j(N/2), at different\nlocalization lengths. The electric field is infinitely large.\n\n10-4\n\nFor low electron concentrations ne ≪ nm , where nm =\n3/2\nN exp[− 2π\n] is the concentration of the \"opti3 (R/πa)\nmal\" traps, the prediction of Ref. 15 for the electron drift\nvelocity is expressed by Eq. (3). Now we discuss several\ncorrections to this equation.\n1) There is a numeric factor of (4π)1/4 ≈ 1.88 in τ ,\narising from the evaluation of the integral (2) that should\nbe taken into account. It gives a factor of (4π)−1/4 for\nthe drift velocity.\n2) The mean electron displacement along the X axis,\nh∆xi, is taken equal to R in Ref. 15. We performed\nMonte Carlo calculations for h∆xi as a function of the\nlocalization length a and get the following fitting expression:\nh∆xi = R (0.385 + 0.45a2 /R2 )\n\n10-6\n10-8\nj (N2/3)\n\nLimit of ne → 0\n\n0.5\n\n10-10\n10-12\n10-14\n10-16\n10-18\n\nEq. (6)\nsimulation\n\n-20\n\n10\n\n0.05\n\n0.1\n\n0.15\n\n0.2\n\n0.25\n\n0.3\n\n(7)\n\n(the accuracy of fitting is not worse than 0.3 % in the\nrange 0.05 ≤ a/R ≤ 0.2). Therefore, the drift velocity v = h∆xi/τ gets an additional factor equal approximately to 0.5.\n3) The dwell time τ (r) of a trap with a radius r is\nin fact somewhat less than the value exp(2r/a) used in\nRef. 15 because an electron can escape the trap by moving not only to the nearest site to the right, but also to\na more distant site. A contribution Γ1 of these distant\nsites to the escaping rate is\n\na (R)\n\nFIG. 5: Current density j as a function of localization length\na for the half-filled system (ne = N/2). The electric field is\ninfinitely large.\n\nwith the analytical theory based on the concept of directed percolation (Eq. (6), solid line) for ne = N/2.\nApparently, the theory of Nguyen and Shklovskii15 correctly describes this dependence within the range of current densities of almost 15 orders of magnitude. However,\nthe theory underestimates the magnitude of the current\ndensity by approximately a factor of 30. Further research\nis necessary to clarify the reasons of this discrepancy.\n\nIV.\n\nANALYTICAL THEORY FOR INFINITELY\nHIGH FIELDS\n\nOur numerical studies show that although the analytical description of hopping conduction in very strong\nelectric field by Nguyen and Shklovskii is qualitatively\ncorrect the quantitative predictions differ sometimes by\n\nΓ1 =\n\nZ∞\nr\n\n\u0013\n\u0012\na2\n.\ne−2r1 /a 2πN r12 dr1 = e−2r/a πN a r2 +ar+\n2\n\nThen, the dwell time τ (r) is a reciprocal of the sum Γ0 +\nΓ1 , where Γ0 = exp(−2r/a) is the rate of a jump to the\nnearest neighbor:\nτ (r) =\n\n1\nexp(2r/a)\n=\n.\nΓ0 + Γ1\n1 + πN a(r2 + ar + a2 /2)\n\n(8)\n\nFor r = rm ≡ (πN a)−1/2 , τ (r) is approximately half\nof exp(2r/a), that results in a factor of two in the drift\nvelocity.\n4) The geometrical crosssections of larger traps have\nlarger capture crosssections for electrons than the smaller\nones. This results in different probabilities for carriers to\nbe captured by traps with different radii. The probability\np̃(r)dr that the next visited site will be a trap with radius\nin the range (r, r + dr) is\np̃(r)dr =\n\nS(r)\np(r)dr,\nhSi\n\n\f7\nHere vNS = j/ne is the drift velocity corresponding to\nEq. (3). Finally, the latter expression can be fitted (with\naccuracy of about 3 % for a ≤ 0.2R) by a simple formula,\n\u0011\na \u0010\n(11)\n1.4 + 2.1 e−10 a/R vNS .\nv≈\nR\n\n2\n1.8\n1.6\n\nSrel(r)\n\n1.4\n1.2\na=0.05 R\na=0.07 R\na=0.10 R\na=0.15 R\na=0.20 R\na=0.25 R\n2 2\nfitting: 0.81 + 0.36 r /R\n\n1\n0.8\n0.6\n0.4\n0\n\n0.5\n\n1\n\n1.5\n2\n\n2\n\n2.5\n\n3\n\n2\n\nr (R )\n\nFIG. 6: Relative capture crosssection as a function of squared\ntrap radius.\n\nwhere p(r) = 2πN r2 exp(−2πN r3 /3), S(r) is a capture\ncrosssection of a trap with radius r, and hSi =\nR\nS(r)p(r)dr is a mean crosssection. Below we will use\na notation Srel (r) for a \"relative crosssection\" S(r)/hSi.\nThen, instead of Eq. (2) we get\nτ=\n\nZ∞\n\nτ (r)Srel (r)p(r)dr.\n\n(9)\n\n0\n\nWe calculated the relative crosssections with Monte\nCarlo method as ratios Ntr [r, r+∆r]/(Nj p(r)∆r), where\nNtr [r, r+∆r] is a number of traps with radii in the specified range visited by an electron, and Nj is a total number\nof electron jumps. We used Nj = 108 and ∆r = 0.01R.\nThe results are presented in Fig. 6. The relative crosssection is almost independent of the localization length for\nr > 0.3R. Its dependence on the trap radius is described\nby the quadratic function:\n2\n\n2\n\nSrel (r) = 0.81 + 0.36 r /R .\n\nThis expression is to be considered as a corrected analytical form for the drift velocity at infinitely high fields in\nthe limit of small electron concentration.\nA comparison of Eq. (11) with the values of the drift\nvelocity obtained by the Monte Carlo method is shown\nin Fig. 2. The difference between the analytical and simulated results does not exceed 20 %. We believe that the\nmain source of this small difference is some inaccuracy\nin determining τ (r) by Eq. (8). In fact, for a given trap\nradius there is some distribution of the dwell times. The\nquantity τ (r) contributing to Eq. (9) is the mean dwell\ntime for radius r. However, Eq. (8) gives the reciprocal\nvalue of the mean escaping rate that is slightly smaller\nthan τ (r). For this reason, Eq. (11) can slightly overestimate the drift velocity.\nB.\n\nLet us now try to improve the analytical approach at\nfinite, though small electron concentration, ne ≪ N/2.\nIn this case, electron flow can be considered as a homogeneous one on the scale of distances between the\ntraps that determine the transport. Hence one can express the frequency νin of electron capture by a trap as\nνin = jS(1 − n̄), where j is the current density, S is\nthe trap capture crosssection, and n̄ is its mean occupancy. Under the steady-state conditions, νin = νout ,\nwhere νout = n̄/τ is a frequency of emission of electrons\nfrom the trap, τ is a dwell time. From this equation one\ncan get n̄:\nn̄ =\n\n(10)\n\nFor the \"optimal\" traps with r = rm ≡ (πN a)−1/2 we\nget Srel (rm ) ∼ a−1 in the limit a → 0. According to\nEq. (9), it results in a factor of ∼ a−1 for the mean dwell\ntime τ and, consequently, in a factor of ∼ a for the drift\nvelocity.\nNow we can improve Eq. (3) of Nguyen and Shklovskii,\nstarting from Eq. (9). Since the integrand has a sharp\nmaximum at rm = (πN a)−1/2 , we can estimate the integral approximately as\nτ ≈ τ (rm ) Srel (rm ) p(rm ) (πR3 a/4)1/4 N −1 .\nThen, using Eqs. (7), (8), and (10), we get the following\nexpression for the drift velocity v = h∆xi/τ :\nh\n\u0010\n\u0011i\np a\na2\n1\na2\n(0.85+0.45 R\n2 ) 1+πN a\nπN a +\nπN + 2\n\u0001\nv≈\nvNS .\nR\n(4π)1/4 0.81 + 0.36 πa\n\nFinite electron concentration\n\n1\n.\n1 + (jSτ )−1\n\nSince in a snapshot of the system almost all electrons are\ncaptured by traps, the total electron concentration ne is\nne =\n\nZ∞\n\nn̄(r)p(r)dr =\n\n0\n\nZ∞\n\np(r)dr\n.\n1 + (jS(r)τ (r))−1\n\n(12)\n\n0\n\nThe dwell time τ (r) can be estimated by Eq. (8). In order to find the crosssection S(r), one should note that\nthe mean crosssection hSi is equal to 1/N h∆xi. Consequently,\nS(r) =\n\n0.81 R2 + 0.36 r2\nSrel (r)\n.\n= R2\nN h∆xi\n0.385 R2 + 0.45 a2\n\n(13)\n\nEquation (12) with τ (r) and S(r) determined by\nEqs. (8) and (13), respectively, gives a functional dependence between the electron concentration and the current\n\n\f8\ndensity for any ne ≪ N/2. Fig. 3 evidences a good agreement between Eq. (12) and the Monte Carlo calculations\nfor ne ≤ 0.03 N .\nAlthough there is probably no simple way to resolve\nEq. (12) with respect to j analytically in the general case,\nit is possible to simplify this equation in some limiting\ncases. For small ne and j (ne ≪ nm ), the unity term\nin the denominator of Eq. (12) can be dropped, and we\nget ne = j/v, where the drift velocity v = h∆xi/τ̄ is\ndetermined by Eq. (11). In the opposite limit (ne ≫ nm ),\none can evaluate Eq. (12) as\nne ≈\n\nZ∞\n\nrn\n\n\u0013\n\u0012\n2πN rn3\n,\np(r)dr = N exp −\n3\n\nwhere a cutting parameter rn is given by condition\njS(rn )τ (rn ) = 1. Therefore,\nj=\n\n1\nS(rn )τ (rn )\n\n(14)\n\nwith\nrn = R\n\n\u0012\n\n3\nN\nlog\n2π\nne\n\n\u00131/3\n\nj6=i\n\nj6=i\n\nThese equations are solved by\n\n\n\n−Γ1\np1\n Γ12\n p2 \n\n\n\np =  p3  and M =  Γ13\n\n\n\n..\n..\n.\n.\n\n.\n\n(15)\n\nHOPPING TRANSPORT AT FINITE\nELECTRIC FIELDS\n\nSo far we have considered the limiting case of infinitely\nhigh electric fields. Let us now turn to the field dependence of the charge carriers velocity in order to reveal\nthe possibility of the negative differential conductivity\npredicted by Nguyen and Shklovskii.15 Eq. (4) predicts\na decreasing drift velocity with increasing electric field,\nprovided the field is strong enough. On the other hand,\nfor very small fields, Ohmic transport can be expected,\ni.e., the drift velocity should depend linearly on the field.\nIn order to simulate hopping transport at finite electric\nfields, we solved a system of balance equations instead of\nusing a direct MC simulation. In the following subsection A we describe the details of the numerical procedure,\nwhile the results are presented in subsection B.\n\n\n***\n*** \n\n, (18)\n*** \n\n..\n.\n\nthe matrix becomes nonsingular, and the solution can\nbe obtained more efficiently. Additionally, the solution\nobtained in this way is correctly normalized. After this\nreplacement, the equation has the form:\n  \n\n\n1\np1\n1\n1\n1 ***\n Γ12 −Γ2 Γ32 * * *   p2   0 \n  \n\n\n(20)\n Γ13 Γ23 −Γ3 * * *   p3  =  0 \n  \n\n\n..\n..\n..\n..\n.. . .\n.\n.\n.\n.\n.\n.\n\nAs in Section III, the rates for jumps longer than dmax\nare assumed to be zero. Hence, it is efficient to use a\nsparse storage scheme for the matrix, where only the nonzero elements are stored. We obtained the most accurate\nresults in the shortest time by solving the equation by LU\nfactorization (in Matlab or Octave with the \\ operator).\nThis method demands much memory, and did not work\nfor L above about 22 R on a 32-bit computer.\nWhen the steady-state occupation probabilities are\nknown, the average velocity of a charge carrier along the\nfield direction is given by\nX\nhvx i =\npi Γij (xj − xi ),\n(21)\ni,j6=i\n\nhvx i\nF .\n\nBalance equation method\n\nWe consider a cubic system (side length L) with randomly placed sites. Periodic boundary conditions are\nused in all directions. The balance equation for the occupation probability pi of a site i has the form29,30,31,32,33,34\nX\nX\npi Γij (1 − pj ) =\npj Γji (1 − pi ).\n(16)\nj6=i\n\nΓ21 Γ31\n−Γ2 Γ32\nΓ23 −Γ3\n..\n..\n.\n.\n\nP\nwhere Γi = j6=i Γij is the rate of jumping out of site\ni. The equation is then Mp = 0, which we solve numerically. The matrix M defined in this way is singular,\nwhich makes a direct solution rather difficult. By replacing one of the balance equations with the normalization\nX\npi = 1,\n(19)\n\nand the mobility is then μ =\nA.\n\ndefining\n\ni\n\nEquation (14), with parameters determined by Eqs. (8),\n(13) and (15) is the improved version of Eq. (5) by\nNguyen and Shklovskii for the concentration range nm ≪\nne ≪ N/2.\nV.\n\nIf all occupation probabilities pi are small, i.e. the\ncharge carrier concentration is low, the balance equation\ncan be linearized:\nX\nX\npi Γij =\npj Γji .\n(17)\n\nj6=i\n\nB.\n\nField dependence of the current density\n\nThe simulated dependence of the drift velocity v on\nthe electric field F is presented in Fig. 7. Simulations are\nperformed for 203 sites in a cubic domain with the size\nL = 20 R, in the limit of infinitely small electron concentration. Different symbols refer to different localization\n\n\f9\n10-4\n\n10-3\n\n10\n\n10-5\n\na = 0.20 R\n\n-6\n\n10\n\na = 0.15 R\n\n10-7\n\nv (R)\n\nv (R)\n\n10-6\n\n10-8\n\n10-8\n\na = 0.12 R\n\n10\n\n10-10\n\na = 0.10 R\n\n10-10\n\na = 0.15 R\n\n10-7\n\n-9\n\na = 0.12 R\n\n10-9\n\n10-11\n\nEq. (4)\nEq. (24)\n\n10-4\n\na = 0.20 R\n\n-5\n\na = 0.10 R\n\n10-11\n0\n\n5\n\n10\n\n15\n20\nFR (kT)\n\n25\n\n30\n\n35\n\nFIG. 7: Drift velocity as a function of the electric field, for\ndifferent localization lengths. The system size L is 20 R.\n\n10-12\n\n0.1\n\n1\n\n10\nFR (kT)\n\n100\n\n1000\n\nFIG. 9: Drift velocity as a function of the electric field for\ndifferent localization lengths. The curves show Eq. (4) and\nEq. (24), scaled to approach Eq. (11) in the limit of large\nfields. The system size L is 20 R.\n\n4.5\n4.0\n3.5\nFm R (kT)\n\n3.0\n2.5\n2.0\n1.5\n1.0\n0.5\n0.0\n0\n\n0.05\n\n0.1\n\n0.15\n\n0.2\n\n0.25\n\na (R)\n\nFIG. 8: The field Fm corresponding to the maximum of the\ndrift velocity as a function of the localization length a. The\nlinear fit is given by Fm R/kT = 17a/R − 0.2.\n\nlengths and/or different realizations of the distribution\nof sites in the domain. The size of the simulated system\nwas 10 times larger than that in the simulations of Levin\net al.,21 whose computer simulations for the first time\nconfirmed the existence of the NDC effect for hopping\ntransport.\nIn the limit of small electric field, F R/kT ≪ 1, simulations show an Ohmic conductivity, i.e., v is proportional to F , in accordance to the Miller–Abrahams concept of the resistance network.20,35 With increasing field,\nthe drift velocity reaches a maximum value. The field\nstrength Fm corresponding to the maximum of the velocity appears to be nearly proportional to the localization length a within the range 0.08 R < a < 0.2 R (see\nFig. 8). At field strengths F > Fm the NDC appears, i. e.\nthe drift velocity drops with increasing field. Simulations\nshow the presence of the NDC for localization lengths up\nto 0.3 R; when the localization length is decreased, the\n\nNDC effect becomes more pronounced.\nFig. 9 shows the comparison between the simulation\nresults (symbols) and the predictions of Nguyen and\nShklovskii15 (Eq. (4), dashed lines). For better agreement between the theory and the simulation at F → ∞,\nwe take into account the F -independent correction (11)\nto Eq. (4). Some discrepancies between the simulated\nand predicted drift velocities remain at large fields for\na = 0.10 R and a = 0.12 R. We believe that these discrepancies are due to the small size of the simulated system. In fact, the simulated system must be large enough\nto contain a reasonable number of optimal traps. The\nconcentration of optimal traps decreases sharply with decreasing localization length, so that at smaller localization lengths larger systems are needed. Thus, for small\nlocalization length (0.10 R and 0.15 R), only the shape of\nthe simulated filed dependence should be taken as representative, but not the values of the calculated velocities\nthemselves.\nThe range of applicability of Eq. (4) is determined by\nthe condition F R/kT ≫ 1. One can see nevertheless that\neven within this range the field dependence of the velocity\nis much weaker than the one predicted by Eq. (4). This\nresult forced us to consider another possible optimal trap\nshape for the case of a finite field as compared to the one\nconsidered in Ref. 15.\nThe essential feature of the optimal trap proposed by\nNguyen and Shklovskii (Fig. 1b) is the chain of sites along\nthe axis of the cone. This chain was introduced in order\nto provide an easy path for an electron into a trap. The\nchain affects the trap shape and volume, as it serves also\nas a channel for escaping of an electron from the trap. We\nsuggest that at moderate localization lengths (a ≃ 0.1 R)\ntraps without such a chain can also play a significant role.\nOur next aim is to consider the shape of traps without\na chain of sites and to estimate their influence on the\nelectron conduction.\n\n\f10\ny\n\nr\nx\n\nFIG. 10: Geometry of the optimal trap at finite electric fields\nwithout a chain of sites leading into the trap.\n\nA sketch of such a trap is shown in Fig. 10. Its shape is\ndefined by the condition that the rate of jumping from the\ncentral site to any point of the trap's surface is the same.\nFrom Eq. (1) one can see that in the positive direction\nalong the axis X the trap is bounded by a hemisphere,\nand in the negative direction-by a surface defined by an\nequation\nF\n2p 2\n2r\nx−\nx + y2 + z 2 = − ,\nkT\na\na\n\n(22)\n\nwhere r is the radius of the hemisphere, and the origin\nis placed at the central site of the trap. The surface\ndetermined by Eq. (22) is a quadric surface (an ellipsoid,\na paraboloid, or a hyperboloid, depending on the values\n′\nof parameters). The volume of the trap, Vtrap\nis\n\u0012\n\u0013\n2πr3\nc+2\n′\nVtrap\n(r) =\n1+\n,\n(23)\n3\n2(c + 1)2\nwhere c ≡ F a/2kT .\nTo obtain the drift velocity v (or the current density\nj = ne v) in the assumption that the most important\ntraps are those shown in Fig. 10, one can proceed in the\nsame way as the one applied in Section II to get Eq. (4);\n′\nthe only difference is using Vtrap\n(r) instead of Nguyen\n\u0001\n3\nand Shklovskii's trap volume Vtrap (r) = 2πr\n1 + FkTa .\n3\nThe result is\n\"\n\u0013− 21 #\n\u0012 \u0013 32 \u0012\n4\nc\n+\n2\nR\n1\n.\n1+\njne →0 ≃ ne (a3 R) 4 exp − √\n2(c+1)2\n3 π a\n(24)\nFor the optimal trap radius one gets\n1\nrm = √\nπN a\n\n\u0012\n1+\n\nc+2\n2(c + 1)2\n\n\u0013−1/2\n\n.\n\n′\nSince Vtrap\n(r) < Vtrap (r), the new trap shape gives a\nweaker field dependence of the drift velocity, and a better\nagreement with the data from simulations, as one can\nsee in Fig. 9. However, the simulated field dependence\nappears even weaker than the one expressed by Eq. (24).\nIt leads to the assumption that an actual optimal trap\nhas a shape different from both Fig. 1b and Fig. 10, and\nhence has a different volume.\n\nFIG. 11: Time-averaged density of sites around the charge\ncarrier for different fields at the localization length a = 0.15 R.\nThe position of a charge carrier (at the origin) is pointed out\nby a cross. Boundaries of optimal traps predicted in Ref. 15\n(see Fig. 1) are depicted by solid lines, the boundary of the\ntrap sketched in Fig. 10 by the dotted line. Spatial coordinates are in units of R. The value 2.36kT for F R corresponds\nto the maximum of the drift velocity.\n\nTo further investigate the shape of the most efficient\ntraps, we collect information about the trap shape from\nthe simulations. Fig. 11 show the time-average of the\ndensity of sites around the charge carrier. To calculate\nthis density ρ(r), the space was divided into small elements of equal volume ∆V ; then ρ(r) was evaluated as a\nsum over pairs of sites:\nρ(r) =\n\n1 X\npi χij (r),\n∆V\ni6=j\n\nwhere pi is an occupation probability of the i-th site;\nχij (r) = 1 if the vector (rj − ri ) belongs to the same spatial element as the vector r; otherwise χij (r) = 0. Finally,\nvalues of ρ(r) were averaged over several realizations of\nsite distributions.\nSince the carrier spends the most time in the efficient\ntraps, the density distribution ρ(r) directly reflects the\nshape of these traps. At high fields (Fig. 11a) the hemispherical shape and the size of the trap are in an excellent agreement with the Nguyen and Shklovskii's theory.\nHowever, at moderate fields, in the region of the NDC\n(Fig. 11(b)), neither Fig. 1(b) nor Fig. 10 describe the\nsimulated optimal trap. The optimal trap consists in\nsuch a case of a hemisphere in the spatial region x > 0,\nand of a toroidal \"barrier\" in the region x < 0, adjoining\nto a periphery of the hemisphere. The volume of the optimal trap turns out to be smaller than the one predicted\n\n\f11\n1.8\n\nσ/kT = 0.0\nσ/kT = 0.2\nσ/kT = 0.4\nσ/kT = 0.8\nσ/kT = 1.0\nσ/kT = 1.5\nσ/kT = 2.0\nσ/kT = 3.0\nσ/kT = 4.0\nσ/kT = 5.0\nσ/kT = 10.0\n\n1.6\n1.4\n\n106 v (R)\n\n1.2\n1.0\n0.8\n0.6\n0.4\n0.2\n0.0\n0\n\n5\n\n10\n\n15\n20\nFR (kT)\n\n25\n\n30\n\n35\n\nsite (with a Gaussian distribution) decreases the drift\nvelocity and it also decreases the height of the peak of\nthe velocity as a function of the electric field as compared\nto systems with only spatial disorder. This weakening of\nthe NDC effect with the increase of the energetic disorder\n(or with the decrease of temperature) is in agreement\nwith experimental observations.18,19 Generally, the\nNDC effect is confirmed herewith also for systems with\nthe energetic disorder. However, at extremely large\nenergetic disorder (parameter σ), the peak in the field\ndependence of the drift velocity disappears completely.\nThe effect of energetic disorder becomes smaller at\nlarger fields, as expected from the fact that in the limit\nF → ∞ the hopping rates do not depend on site energies.\n\nFIG. 12: Drift velocity v versus electric field F for Gaussian\ndisorder in site energies. Disorder is characterized by a standard deviation σ of site energies from the reference energy.\nThe localization length a = 0.15 R.\n\nby both Eq. (4) and Eq. (24), in accordance with the result that the simulated NDC effect is weaker than the\npredicted one. We would like to emphasize that the numerically obtained NDC has exactly the origin predicted\nby Nguyen and Shklovskii,15 consisting in spreading of\nthe optimal trap into the region x < 0 at finite fields\nand consequently in the increase of the trap volume with\ndecreasing the field strength. The possibility of traps in\nthe form of clusters instead of single chains of sites has\nbeen considered in Ref. 18. We interpret our numerical\nresult as a confirmation of that idea.\nA further decrease of the electric field F results in the\nwashing out the empty region in the density of sites ρ(r),\nas shown in Fig. 11(c) for F = Fm . Finally, at small F\nthe trap almost disappeared (Fig. 11(d)), which points\nto a negligible role of the trapping effect in the regime of\nOhmic conduction.\nMaterials studied experimentally usually have disorder\nnot only in the spatial distribution of localized states,\nbut also in the site energies.3,5,36 It is therefore necessary\nto check how stable the NDC effect is with respect to\nenergetic disorder. In order to study the role of the\nenergetic disorder for the NDC effect, we repeated the\nsimulation in a system with a Gaussian distribution of\nsite energies, characterized by the standard deviation σ.\nFig. 12 shows that introducing a random energy for each\n\n∗\n1\n\n2\n\n3\n\nElectronic address: nenashev@isp.nsc.ru\nH. Böttger and V. V. Bryksin, Hopping conduction in\nsolids (VCH Akademie-Verlag Berlin, 1985).\nS. Baranovski, ed., Charge Transport in Disordered Solids\nwith Applications in Electronics (John Wiley & Sons, Ltd,\nChichester, 2006).\nH. Bässler, Semiconducting Polymers, G. Hadziioannou\nand P. F. van Hutten (eds.) (John Wiley & Sons, Inc.,\n\nVI.\n\nCONCLUSIONS\n\nNumerical studies of the field-dependent drift velocity\nof charge carriers in the hopping regime at high electric\nfields confirm the prediction of the existing analytical\ntheories14,15 that the negative differential conductivity is\ninherent for this transport mode. However, the shape\nof the field dependence on the current density obtained\nnumerically differs essentially from the one predicted so\nfar.15 The analytical theory has been improved to give a\nmuch better agreement with the numerical results. In the\nlimit of the infinitely high electric fields, the predictions\nof the analytical theory of Nguyen and Shklovskii15 are\nto much extent confirmed by our straightforward Monte\nCarlo simulations.\n\nAcknowledgments\n\nThe authors are indebted to Prof. Boris Shklovskii for\nnumerous valuable comments. Financial support from\nthe Academy of Finland project 116995 and the TEKES\nNAMU project, from the Deutsche Forschungsgemeinschaft and that of the Fonds der Chemischen Industrie\nis gratefully acknowledged. A. V. N. thanks the Russian\nFoundation for Basic Research (project 06-02-16988) and\nthe Dynasty Foundation for financial support. The authors thank Oleg Rubel and Kakhaber Jandieri for stimulating discussions.\n\n4\n\n5\n6\n\nNew York, 2000), p. 365.\nM. Pope and C. E. Swenberg, Electronic Processes in Organic Crystals and Polymers (Oxford University Press,\nOxford, 1999).\nH. Bässler, Phys. Status Solidi B 175, 15 (1993).\nP. M. Borsenberger, E. H. Magin, M. van der Auweraer,\nand F. C. de Schryver, Phys. Status Solidi (a) 140, 9\n(1993).\n\n\f12\n7\n\n8\n9\n\n10\n11\n\n12\n\n13\n\n14\n\n15\n\n16\n\n17\n\n18\n\n19\n\n20\n\n21\n\n22\n\nM. van der Auweraer, F. C. de Schryver, P. M. Borsenberger, and H. Bässler, Advanced Materials 6, 199 (1994).\nM. Abkowitz, Phil. Mag. B 65, 817 (1992).\nA. Peled and L. B. Schein, Chem. Phys. Lett. 153, 422\n(1988).\nL. B. Schein, Phil. Mag. B 65, 795 (1992).\nP. E. Parris and B. D. Bookout, Phys. Rev. B 53, 629\n(1996).\nA. Hirao, H. Nishizawa, and M. Sugiuchi, Phys. Rev. Lett.\n75, 1787 (1995).\nH. Cordes, S. D. Baranovskii, K. Kohary, P. Thomas,\nS. Yamasaki, F. Hensel, and J.-H. Wendorff, Phys. Rev.\nB 63, 094201 (2001).\nH. Böttger and V. V. Bryksin, Phys. Status Solidi B 96,\n219 (1979).\nNguyen Van Lien and B. I. Shklovskii, Solid State Commun. 38, 99 (1981).\nE. I. Levin and B. I. Shklovskii, Solid State Commun. 67,\n233 (1988).\nD. I. Aladashvili, Z. A. Adamia, K. G. Lavdovskii, E. I.\nLevin, and B. I. Shklovskii, Pis'ma v Zh. Eksp. Teor. Fiz.\n47, 390 (1988), Sov. Phys. JETP Lett. 47, 466 (1988).\nD. I. Aladashvili, Z. A. Adamia, K. G. Lavdovskii, E. I.\nLevin, and B. I. Shklovskii, Fiz. Tekhn. Poluprov. 24, 234\n(1990), Sov. Phys. Semicond. 24, 143 (1990).\nD. I. Aladashvili, Z. A. Adamiya, K. G. Lavdovskii, E. I.\nLevin, and B. I. Shklovskii, in Hopping and related phenomena, edited by H. Fritzsche and M. Pollak (World Scientific, 1990).\nB. I. Shklovskii and A. L. Efros, Electronic Properties of\nDoped Semiconductors (Springer-Verlag, 1984).\nE. I. Levin, Nguyen Van Lien, and B. I. Shklovskii, Fiz.\nTekh. Poluprov 16, 815 (1982), Sov. Phys. Semicond. 16,\n523 (1982).\nJ. G. Simmons and R. R. Verderber, Proc. R. Soc. London\nA 391, 77 (1967).\n\n23\n\n24\n\n25\n\n26\n\n27\n\n28\n\n29\n\n30\n\n31\n\n32\n\n33\n\n34\n\n35\n36\n\n37\n\n38\n\nR. E. Thurstans and D. P. Oxley, J. Phys. D 35, 802\n(2002).\nL. D. Bozano, B. W. Kean, V. R. Deline, J. R. Salem, and\nJ. C. Scott, Appl. Phys. Lett. 84, 607 (2004).\nL. D. Bozano, B. W. Kean, M. Beinhoff, K. R. Carter,\nP. M. Rice, and J. C. Scott, Advanced Functional Materials\n15, 1933 (2005).\nH. S. Majumdar, J. K. Baral, R. Österbacka, O. Ikkala,\nand H. Stubb, Organic Electronics 6, 188 (2005).\nF. Verbakel, S. C. J. Meskers, R. A. J. Janssen, H. L.\nGomes, M. Colle, M. Buchel, and D. M. de Leeuw, Appl.\nPhys. Lett. 91, 192103 (2007).\nJ. K. Baral, H. S. Majumdar, A. Laiho, H. Jiang, E. I.\nKauppinen, R. H. A. Ras, J. Ruokolainen, O. Ikkala, and\nR. Österbacka, Nanotechnology 19, 035203 (2008).\nZ. G. Yu, D. L. Smith, A. Saxena, R. L. Martin, and A. R.\nBishop, Phys. Rev. Lett. 84, 721 (2000).\nZ. G. Yu, D. L. Smith, A. Saxena, R. L. Martin, and A. R.\nBishop, Phys. Rev. B 63, 085202 (2001).\nW. F. Pasveer, J. Cottaar, P. A. Bobbert, and M. A. J.\nMichels, Synth. Met. 152, 157 (2005).\nJ. Cottaar and P. A. Bobbert, Phys. Rev. B 74, 115204\n(2006).\nF. Jansson, S. D. Baranovskii, G. Sliaužys, R. Österbacka,\nand P. Thomas, Phys. Status Solidi C 5, 722 (2008).\nF. Jansson, S. D. Baranovskii, F. Gebhard, and\nR. Österbacka, Phys. Rev. B 77, 195211 (2008).\nA. Miller and E. Abrahams, Phys. Rev. 120, 745 (1960).\nO. Rubel, S. D. Baranovskii, P. Thomas, and S. Yamasaki,\nPhys. Rev. B 69, 014206 (2004).\nThis linear part in seen in Fig. 3 only for a = 0.15R, because for a = 0.1R and 0.07R the value nm is less than\n10−4 N .\nThe integral in Eq. (12) is evaluated numerically.\n\n\f"}