{"id": "http://arxiv.org/abs/0710.1245v2", "guidislink": true, "updated": "2007-10-07T16:15:16Z", "updated_parsed": [2007, 10, 7, 16, 15, 16, 6, 280, 0], "published": "2007-10-05T14:57:17Z", "published_parsed": [2007, 10, 5, 14, 57, 17, 4, 278, 0], "title": "Spectroscopy of strontium Rydberg states using electromagnetically\n  induced transparency", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0710.2221%2C0710.1060%2C0710.1777%2C0710.3282%2C0710.5904%2C0710.3662%2C0710.4945%2C0710.5660%2C0710.3530%2C0710.3664%2C0710.5505%2C0710.3700%2C0710.1498%2C0710.1554%2C0710.0023%2C0710.1949%2C0710.1632%2C0710.5107%2C0710.3648%2C0710.1635%2C0710.3148%2C0710.2585%2C0710.4521%2C0710.4064%2C0710.1577%2C0710.5362%2C0710.4899%2C0710.3100%2C0710.2005%2C0710.3352%2C0710.3876%2C0710.2755%2C0710.4116%2C0710.5874%2C0710.1113%2C0710.4030%2C0710.1420%2C0710.3369%2C0710.4421%2C0710.0068%2C0710.5677%2C0710.1439%2C0710.1683%2C0710.0541%2C0710.0232%2C0710.1012%2C0710.5792%2C0710.4081%2C0710.5199%2C0710.0255%2C0710.5377%2C0710.2766%2C0710.0042%2C0710.2680%2C0710.2861%2C0710.3796%2C0710.1245%2C0710.0441%2C0710.1396%2C0710.4507%2C0710.5577%2C0710.3056%2C0710.4898%2C0710.0965%2C0710.3804%2C0710.4729%2C0710.0234%2C0710.5557%2C0710.5161%2C0710.2556%2C0710.3175%2C0710.1724%2C0710.0351%2C0710.3093%2C0710.5248%2C0710.1214%2C0710.1279%2C0710.0085%2C0710.3997%2C0710.5726%2C0710.3933%2C0710.3518%2C0710.0693%2C0710.3485%2C0710.3004%2C0710.1927%2C0710.5269%2C0710.1866%2C0710.5924%2C0710.5707%2C0710.3794%2C0710.5344%2C0710.0007%2C0710.5315%2C0710.4865%2C0710.0127%2C0710.1014%2C0710.2334%2C0710.1001%2C0710.2576%2C0710.0391&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Spectroscopy of strontium Rydberg states using electromagnetically\n  induced transparency"}, "summary": "We report on the all-optical detection of Rydberg states in a effusive atomic\nbeam of strontium atoms using electromagnetically induced transparency (EIT).\nUsing narrow-linewidth CW lasers we obtain an EIT linewidth of 5 MHz. To\nillustrate the high spectroscopic resolution offered by this method, we have\nmeasured isotope shifts of the 5s18d ^1D_2 and 5s19s ^1S_0 Rydberg states. This\ntechnique could be applied to high-resolution, non-destructive measurements of\nultra-cold Rydberg gases and plasmas.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0710.2221%2C0710.1060%2C0710.1777%2C0710.3282%2C0710.5904%2C0710.3662%2C0710.4945%2C0710.5660%2C0710.3530%2C0710.3664%2C0710.5505%2C0710.3700%2C0710.1498%2C0710.1554%2C0710.0023%2C0710.1949%2C0710.1632%2C0710.5107%2C0710.3648%2C0710.1635%2C0710.3148%2C0710.2585%2C0710.4521%2C0710.4064%2C0710.1577%2C0710.5362%2C0710.4899%2C0710.3100%2C0710.2005%2C0710.3352%2C0710.3876%2C0710.2755%2C0710.4116%2C0710.5874%2C0710.1113%2C0710.4030%2C0710.1420%2C0710.3369%2C0710.4421%2C0710.0068%2C0710.5677%2C0710.1439%2C0710.1683%2C0710.0541%2C0710.0232%2C0710.1012%2C0710.5792%2C0710.4081%2C0710.5199%2C0710.0255%2C0710.5377%2C0710.2766%2C0710.0042%2C0710.2680%2C0710.2861%2C0710.3796%2C0710.1245%2C0710.0441%2C0710.1396%2C0710.4507%2C0710.5577%2C0710.3056%2C0710.4898%2C0710.0965%2C0710.3804%2C0710.4729%2C0710.0234%2C0710.5557%2C0710.5161%2C0710.2556%2C0710.3175%2C0710.1724%2C0710.0351%2C0710.3093%2C0710.5248%2C0710.1214%2C0710.1279%2C0710.0085%2C0710.3997%2C0710.5726%2C0710.3933%2C0710.3518%2C0710.0693%2C0710.3485%2C0710.3004%2C0710.1927%2C0710.5269%2C0710.1866%2C0710.5924%2C0710.5707%2C0710.3794%2C0710.5344%2C0710.0007%2C0710.5315%2C0710.4865%2C0710.0127%2C0710.1014%2C0710.2334%2C0710.1001%2C0710.2576%2C0710.0391&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We report on the all-optical detection of Rydberg states in a effusive atomic\nbeam of strontium atoms using electromagnetically induced transparency (EIT).\nUsing narrow-linewidth CW lasers we obtain an EIT linewidth of 5 MHz. To\nillustrate the high spectroscopic resolution offered by this method, we have\nmeasured isotope shifts of the 5s18d ^1D_2 and 5s19s ^1S_0 Rydberg states. This\ntechnique could be applied to high-resolution, non-destructive measurements of\nultra-cold Rydberg gases and plasmas."}, "authors": ["S. Mauger", "J. Millen", "M. P. A. Jones"], "author_detail": {"name": "M. P. A. Jones"}, "author": "M. P. A. Jones", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1088/0953-4075/40/22/F03", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/0710.1245v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0710.1245v2", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "8 pages, 4 figures", "arxiv_primary_category": {"term": "quant-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "quant-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0710.1245v2", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0710.1245v2", "journal_reference": null, "doi": "10.1088/0953-4075/40/22/F03", "fulltext": "arXiv:0710.1245v2 [quant-ph] 7 Oct 2007\n\nSpectroscopy of strontium Rydberg states using\nelectromagnetically induced transparency\nS Mauger, J Millen and M P A Jones\nDepartment of Physics, Durham University, Rochester Building, South Road,\nDurham DH1 3LE, United Kingdom\nE-mail: m.p.a.jones@durham.ac.uk\nAbstract. We report on the all-optical detection of Rydberg states in an effusive\natomic beam of strontium atoms using electromagnetically induced transparency\n(EIT). Using narrow-linewidth CW lasers we obtain an EIT linewidth of 5 MHz.\nTo illustrate the high spectroscopic resolution offered by this method, we have\nmeasured isotope shifts of the 5s18d 1 D2 and 5s19s 1 S0 Rydberg states. This\ntechnique could be applied to high-resolution, non-destructive measurements of\nultra-cold Rydberg gases and plasmas.\n\nPACS numbers: 32.80.Rm, 42.50.Gy, 52.25.Ya\n\nSubmitted to: J. Phys. B: At. Mol. Phys.\n\n\fSpectroscopy of strontium Rydberg states using EIT\n\n2\n\nLaser-cooled atoms can be excited into high-lying electronic states to form a\n\"frozen\" gas of Rydberg atoms [1], where the energy scale associated with the\nstrong dipole-dipole interactions between the atoms is much larger than their thermal\nenergy. This system exhibits rich many-body quantum behaviour, such as the \"dipole\nblockade\" effect [2, 3, 4, 5], where a single Rydberg excitation can be shared by several\nentangled atoms [6]. This effect could be used to realise fast two-qubit quantum logic\ngates between trapped neutral atoms [7]. By exciting the atoms above the ionization\nthreshold, an ultra-cold plasma can be created [8]. These plasmas can reach a strongly\ncoupled regime, where the Coulomb interaction between the ions dominates their\nkinetic energy, and spatial correlations become important [9]. Rydberg atoms form\nin these plasmas due to three-body recombination [10], and spectroscopy of Rydberg\natoms inside the plasma could be used to obtain information on the electric field [11].\nAtoms with two valence electrons such as strontium offer several advantages for\nexperiments on ultra-cold Rydberg gases and plasmas. Narrow intercombination lines\nallow laser cooling to temperatures below 1 μK [12], and extremely high spectroscopic\nresolution [13]. In addition, their singly-charged ions have a strong optical transition in\nthe visible, unlike those of alkali metals which have a closed-shell electronic structure.\nThis allows the ions in the plasma to be imaged, yielding spatially resolved information\non the ion density and temperature [14, 15].\nIn most experiments on ultra-cold Rydberg gases the Rydberg atoms are detected\nindirectly by using field ionization and subsequent detection of the electrons and\nions [16]. This technique is efficient and widely applicable, but is destructive.\nRecently [17] , it was shown that electromagnetically induced transparency (EIT) can\nbe used to probe Rydberg states of rubidium atoms in a vapour cell non-destructively\nand with high resolution. In combination with strong Rydberg-Rydberg interactions,\nthis could also be used to realise a phase gate between single photons [18].\nIn this paper we extend this technique to Rydberg states of strontium atoms in a\neffusive atomic beam. This technique could be used to make high-resolution, real time\nmeasurements of the properties of ultracold Rydberg gases and plasmas. Although\nEIT was first observed in strontium [19], most subsequent work has focussed on the\nalkali metals. Recently, an ultra-precise optical lattice clock based on EIT with bosonic\n88\nSr atoms was proposed [20]. This work is the first observation of EIT in strontium\nusing narrow-linewidth CW lasers.\nThe ladder system studied in these experiments and the experimental setup are\nshown in figure 1. The probe beam is resonant with the 5s2 1 S0 → 5s5p 1 P1 transition\nat 460.7 nm, and the coupling beam at 420 nm is resonant with transitions from the\n5s5p 1 P1 intermediate state to a 5sns 1 S0 or 5snd 1 D2 Rydberg state. Both the probe\nand the coupling beams are generated using commercial frequency-doubled diode laser\nsystems, and are tuned using a commerical wavemeter and data on the Rydberg\nenergy levels taken from [21]. The probe and coupling beams are overlapped and\ncounter-propagate perpendicularly to the effusive atomic beam of strontium atoms. A\nphotodiode monitors the transmission of the probe beam as its frequency is scanned\nacross the transition. A second probe laser beam allows real-time measurement of the\nprobe transmission without the coupling laser present. Each probe laser beam has a\npower of 150 μW and a waist of 1 mm (1/e2 radius), and the two beams are separated\nby 4 mm. The coupling beam power is typically 12 mW. The probe laser beams\nare linearly polarized in the vertical direction, and the coupling laser is circularly\npolarized. This combination was chosen empirically as giving the largest EIT signals\nunder our experimental conditions. To produce the atomic beam, strontium metal is\n\n\f3\n\nSpectroscopy of strontium Rydberg states using EIT\n\n\\\u0013 ̄\n\n\u0018VQV\u0003\u00146\u0013\n\n\u0018VQG\u0003\u0014'\n\nSUREH $\nEHDPV\n\n%\n\n\u0015\n\nDWRPLF\nEHDP\n\nFRXSOLQJ\n\u0017\u0015\u0013QP\n\\\u0012 ̄\n\n\u0018V\u0018S\u0003\u00143\u0014\n%6\n\nSUREH\n\u0017\u0019\u0014QP\n\nD\n\\\u0011 ̄\n\nFRXSOLQJ\nEHDP\n\nE\n\n\u0018V\u0015\u0003\u00146\u0013\n\nFigure 1. (a) Energy level diagram showing the two ladder systems available.\n(b) Schematic of the experiment. Probe and coupling beams overlap on a glass\nplate (BS) and counter-propagate at right angles to the atomic beam. Two\nspatially separate probe beams allow simultaneous measurement of the probe\nbeam transmission with and without the coupling light.\n\nheated in an oven, and the beam is collimated by a bundle of stainless steel capillaries\nthat restrict the geometric divergence to 43 mrad full width.\nTo calibrate the probe laser frequency scan, we use saturated absorption\nspectroscopy and the measured isotope shifts of the 5s2 1 S0 → 5s5p 1 P1 transition.\nThe saturated absorption spectrum is obtained by replacing the coupling beam with\na pump beam at 461 nm derived from the probe laser. An example spectrum is shown\nin figure 2. The spectrum is fitted using the sum of six Lorentzian components (one\nfor each isotope and hyperfine component), with the shift and weighting of each\ncomponent taken from table 1, and the width constrained to the natural linewidth\nof the transition (γ2 = 2π × 16 MHz). The free parameters are a linear frequency axis\nscaling and offset, and the peak absorption. The scaling factor and offset are used to\ncalibrate the frequency axis of EIT data obtained with the same probe laser scan. The\naccuracy of the scaling factor determines the accuracy of frequency intervals obtained\nfrom the EIT data. By examining the residuals from this fit we estimate that the\nuncertainty in the scaling factor is 3 %.\nIf the coupling laser is tuned close to the 5s5p 1 P1 → 5s18d 1 D2 transition in the\ndominant 88 Sr isotope, then we obtain the spectrum shown in figure 3a. A narrow EIT\nresonance feature enhances the transmission in a narrow spectral window within the\nDoppler-broadened absorption profile. The position and amplitude of the resonance\ndepends on the detuning of the coupling laser. The difference between the transmission\nof the two probe beams is shown in figure 3b. The width of the EIT peak is 5 MHz\n(FWHM), which is considerably narrower than the natural width of the intermediate\n1\nP1 state (γ2 = 2π × 16 MHz), and the maximum reduction in absorption is 8%. With\nthe coupling laser tuned exactly on resonance, we observe a change in absorption of\nup to 12%.\nIn order to understand these data in more detail, we have compared them to a\n\n\f4\n\nSpectroscopy of strontium Rydberg states using EIT\n\nFigure 2. Saturated absorption spectrum of the 5s2 1 S0 → 5s5p 1 P1 transition\n(dots). The Doppler background is removed using the second probe beam. The\nred dashed line shows the fit used to obtain the frequency axis scaling.\n\nTable 1. Properties of naturally occuring strontium used to model the spectra.\nIsotope shifts and hyperfine splittings for the 5s2 1 S0 → 5s5p 1 P1 transition are\nextracted from [22, 23] and are quoted relative to the principal isotope 88 Sr.\nIsotope\n\nAbundance\n(%)\n\nI\n\nF\n\nShift\n(MHz)\n\nRelative\nstrength\n\n84 Sr\n\n0.56\n\n0\n\n-\n\n-270.8\n\n1\n\n86 Sr\n\n9.86\n\n0\n\n-\n\n-124.5\n\n1\n\n7/2\n\n-9.7\n\n4/15\n\n87 Sr\n\n88 Sr\n\n7.00\n\n82.58\n\n9/2\n\n0\n\n9/2\n\n-68.9\n\n1/3\n\n11/2\n\n-51.9\n\n2/5\n\n-\n\n0\n\n1\n\nmodel based on an approximate expression for the susceptibility χ(v) derived in the\nlimit of a weak probe beam [24]\nχ(v)dv = −i\n\n3λ2p\nγ2 N (v)dv [γ2 − i (∆p − kp * v)\n4π\n2\n\n(Ωc /2)\n+\nγ3 − i [∆p + ∆c − (kp + kc ) * v]\n\n#−1\n\n,\n\n(1)\n\nwhere N (v) is the number density of atoms with transverse velocity v, ∆p,c and kp,c\nare the probe and coupling laser detuning and wavevectors respectively, and Ωc is the\ncoupling laser Rabi frequency. The decay rate γ2 = 2π × 16 MHz is the natural width\nof the intermediate state, and γ3 is the decay rate of the Rydberg state. This includes\nthe lifetime of the Rydberg state as well as other line-broadening mechanisms, and is\ntreated as a fit parameter.\nThe lineshape is obtained by summing the contribution to χ(v) from all four\nisotopes and integrating the imaginary part of (1) over the transverse velocity\ndistribution of the atomic beam. In figure 3b, the coupling laser is tuned such that\nonly the 88 Sr isotope contributes to the EIT resonance part of the signal, and so we\nset Ωc = 0 for the other isotopes to simplify the numerical integration.\nA standard treatment of the transverse velocity distribution of an effusive\n\n\fSpectroscopy of strontium Rydberg states using EIT\n\n5\n\nFigure 3. (a) Probe transmission as the laser is scanned across the 5s2 1 S0 →\n5s5p 1 P1 transition, with the coupling laser tuned almost on resonance with the\n5s5p 1 P1 → 5s18d 1 D2 transition (dots). Also shown is a fit using equation 1 with\nγ3 = 2π × 3.5 MHz, Ωc = 2π × 7.5 MHz, ∆c = 2π × 20 MHz and ∆v = 16.5 ms−1\n(thin blue line). (b) Difference in transmission between the two probe beams for\nthe same scan (dots). The thin blue line is the difference between the fit in (a)\nand the same curve with Ωc = 0 (all other parameters as in (a)).\n\natomic beam [25] assumes that the velocity distribution inside the oven follows a\nMaxwell-Boltzmann distribution, and that the divergence angle ǫ of the beam is\nfixed geometrically by an aperture some distance from the exit slit of the oven.\nCollisions with the walls of the exit slit or the collimation aperture are neglected.\nThe result is a Gaussian transverse velocity distribution, with a Doppler width that\nis reduced by a factor sin ǫ from that obtained in a vapour at thermal equilibrium\nat the same temperature. We find that using a Gaussian velocity distribution, we\nare unable to describe the shape of the Doppler broadened absorption profile. This\nis almost certainly due to collisions with the walls of the capillaries (length=8mm,\ndiameter = 0.17 mm) used to collimate the atomic beam, which modify the transverse\nvelocity distribution. Empirically, we find that a Lorentzian distribution N (v) ∝\nnat /(1 + v 2 /∆v 2 ) for the transverse velocity gives good agreement with our data.\nAs a result, there are five adjustable parameters in our model: the half-width of\nthe Lorentzian velocity distribution ∆v, the density of the atomic beam nat , the\nparameters ∆c , Ωc of the coupling laser and the rate γ3 .\nThe results of this model are compared with our data in figures 3a and 3b. The\nmodel accurately reproduces the shape of the Doppler background in figure 3a, and\n\n\fSpectroscopy of strontium Rydberg states using EIT\n\n6\n\nFigure 4. (a) Probe beam intensity difference with the coupling laser tuned\nslightly away from resonance with the 5s5p 1 P1 → 5s18d 1 D2 transition. A second\nEIT peak appears due to the 86 Sr isotope. (b) EIT signal with the coupling laser\ntuned near the 5s5p 1 P1 → 5s19s 1 S0 transition. Using lock-in detection, all three\nabundant isotopes can be observed. The peak due to the 88 Sr isotope is visible\nwithout the lock-in and gives a ∼ 5 % change in absorption.\n\nthe asymmetry of the EIT peak in figure 3b. By looking at the behaviour of the\nmodel in more detail, we see that the latter effect arises from the combination of\nthe wavelength mismatch between the probe and coupling beams and the velocity\naveraging. However, we do not observe the increase in absorption that is predicted to\noccur on both sides of the EIT peak, and which was observed in similar experiments\nin rubidium [17].\nBy varying the coupling laser detuning, we are also able to observe EIT signals\ndue to the other isotopes. Figure 4a shows EIT signals due to both the 86 Sr and 88 Sr\nisotopes. We do not observe a signal due to the 87 Sr isotope. The hyperfine interaction\nsplits the 87 Sr line into nine components, and for 15 ≤ n ≤ 25 the hyperfine splitting of\nthe 5snd 1 D2 Rydberg states is very large (∼ 1 GHz) due to strong mixing with nearby\ntriplet states [26, 27]. As a result of this it is difficult to observe an EIT signal due\nto this isotope. In contrast, no hyperfine splitting occurs for the 5sns 1S0 states. The\nEIT signal that we obtain with the coupling laser tuned to the 5s5p 1 P1 → 5s19s 1S0\ntransition is shown in figure 4b. In this experiment, the amplitude of the coupling\nlaser was modulated using a chopper, and with lock-in detection we observed the\nsignal from the 86 Sr, 87 Sr and 88 Sr isotopes. Due to the wavelength mismatch between\nthe pump and probe lasers and the velocity averaging, the hyperfine splitting of the\n\n\fSpectroscopy of strontium Rydberg states using EIT\n\n7\n\nTable 2. Transition isotope shifts between the Rydberg states and the ground\nstate calculated from the intervals measured in figure 3 and the data in table 1.\nTransition\n\n88 Sr - 86 Sr\n(MHz)\n\n88 Sr - 87 Sr\n(MHz)\n\n5s2 1 S0 → 5s18d 1 D2\n\n226 ± 7\n\n–\n\n5s2 1 S0 → 5s19s 1 S0\n\n213 ± 7\n\n62 ± 8\n\n5s5p 1 P1 intermediate state is scaled by a factor 1−λc /λp . This results in a separation\nbetween the EIT signals for each hyperfine component of less than 5 MHz, which is\nnot resolved in figure 4b.\nThe frequency intervals measured in figure 3 and the isotope shifts given in\ntable 1 can be used to obtain the isotope shifts of the Rydberg states relative to\nthe 5s2 1 S0 ground state. In addition to the scaling in the intermediate state, the\nwavelength mismatch also results in frequency separations in the Rydberg state being\nscaled by λc /λp . The results are given in table 2. Our measurement of the 88 Sr - 86 Sr\nisotope shift on the 5s2 1 S0 → 5s18d 1D2 transition is in agreement with a previous\nvalue of 229±5 MHz reported in [28]. The uncertainty is dominated by the uncertainty\nin the frequency axis calibration. This could be substantially improved by scanning\nthe laser with an acousto-optic modulator, or by using a well-characterised etalon to\ncalibrate the scan. The narrow linewidth of the EIT features would then allow isotope\nshifts and hyperfine splitting to be determined with better than 1 MHz resolution.\nIn summary we have shown that electromagnetically induced transparency can\nbe used to probe the Rydberg states of strontium atoms with high resolution. As\nan illustration, isotope shifts were measured for transitions from the ground state to\nthe 5s18d 1D2 and 5s19s 1S0 states. This technique could have important applications\nas a non-destructive, high-resolution probe of strongly interacting Rydberg gases and\nplasmas.\nAcknowledgments\nWe are grateful to C. S. Adams, I. G. Hughes, A. Mohapatra and A. Browaeys for\nmany useful discussions. We also thank C. S. Adams for the loan of equipment and\nthe EPSRC for financial support.\n[1] I. Mourachko, D. Comparat, F. de Tomasi, A. Fioretti, P. Nosbaum, V.M. Akulin, and P. Pillet.\nMany-body effects in a frozen Rydberg gas. Phys. Rev. Lett., 80:253, 1998.\n[2] K. Singer, M. Reetz-Lamour, T. Amthor, L. Gustavo Marcassa, and M. Weidemüller.\nSuppression of excitation and spectral broadening induced by interactions in a cold gas of\nRydberg atoms. Phys. Rev. Lett., 93:163001, 2004.\n[3] D. Tong, S. M. Farooqi, J. Stanojevic, S. Krishnan, Y. P. Zhang, R. Côté, E. E. Eyler, and P. L.\nGould. Local blockade of rydberg excitation in an ultracold gas. Phys. Rev. Lett., 93:063001,\n2004.\n[4] T. Cubel Liebisch, A. Reinhard, P. R. Berman, and G. Raithel. Atom-counting statistics in\nensembles of interacting rydberg atoms. Phys. Rev. Lett., 95:253002, 2005.\n[5] T. Vogt, M. Viteau, J. Zhao, A. Chotia, D. Comparat, and P. Pillet. Dipole blockade at Förster\nresonances in high-resolution laser excitation of Rydberg states of cesium atoms. Phys. Rev.\nLett., 97:083003, 2006.\n[6] R. Heidemann, U. Raitzsch, V. Bendkowsky, B. Butscher, R. Löw, L. Santos, and T. Pfau.\nEvidence for coherent collective Rydberg excitation in the strong blockade regime, 2007.\n(Preprint quant-ph/0701120).\n[7] M. D. Lukin, M. Fleischauer, R. Côté, L. M. Duan, D. Jaksch, J. I . Cirac, and P. Zoller. Dipole\n\n\fSpectroscopy of strontium Rydberg states using EIT\n\n[8]\n[9]\n[10]\n[11]\n[12]\n[13]\n[14]\n\n[15]\n\n[16]\n[17]\n\n[18]\n[19]\n[20]\n[21]\n[22]\n[23]\n[24]\n[25]\n[26]\n[27]\n[28]\n\n8\n\nblockade and quantum information processing in mesoscopic atomic ensembles. Phys. Rev.\nLett., 87:037901, 2001.\nT. C. Killian, S. Kulin, S. D. Bergeson, L. A. Orozco, C. Orzel, and S. L. Rolston. Creation of\nan ultracold neutral plasma. Phys. Rev. Lett., 83:4776, 1999.\nT. C. Killian, T. Pattard, T. Pohl, and J. M. Rost. Ultracold neutral plasmas, 2006. (Preprint\nphysics/0612097).\nT. C. Killian, M. J. Lim, S. Kulin, R. Dumke, S. D. Bergeson, and S. L. Rolston. Formation of\nRydberg atoms in an expanding ultracold neutral plasma. Phys. Rev. Lett., 86:3759, 2001.\nS. K. Dutta, D. Feldbaum, and G. Raithel. Spectroscopic electric field measurement in laserexcited plasmas, 2000. (Preprint physics/00007004).\nH. Katori, T. Ido, Y. Isoya, and M. Kuwata-Gonokami. Magneto-optical trapping and cooling\nof strontium atoms down to the photon recoil temperature. Phys. Rev. Lett., 82:1116, 1999.\nM. M. Boyd, T. Zelevinsky, A. D. Ludlow, S. M. Foreman, S. Blatt, T. Ido, and J. Ye. Optical\natomic coherence at the 1-second time scale. Science, 314:1430, 2006.\nC. E. Simien, Y. C. Chen, P. Gupta, S. Laha, Y. N. Martinez, P. G. Mickelson, D. B. Nagel,\nand T. C. Killian. Using absorption imaging to study ion dynamics in an ultracold neutral\nplasma. Phys. Rev. Lett., 92:143001, 2004.\nY. C. Chen, C. E. Simien, S. Laha, P. Gupta, Y. N. Martinez, P. G. Mickelson, D. B. Nagel,\nand T. C. Killian. Electron screening and kinetic-energy oscillations in a strongly coupled\nplasma. Phys. Rev. Lett., 93:265003, 2004.\nT. F. Gallagher. Rydberg Atoms, pages 70–142. Cambridge University Press, 1994.\nA. K. Mohapatra, T. R. Jackson, and C. S. Adams. Coherent optical detection of highly excited\nRydberg states using electromagnetically induced transparency. Phys. Rev. Lett., 98:113003,\n2007.\nI. Friedler, D. Petrosyan, M. Fleischauer, and G. Kurizki. Long-range interactions and\nentanglement of slow single-photon pulses. Phys. Rev. A, 72:043803, 2005.\nK.-J. Boller, A. Imamoǧlu, and S. E. Harris. Observation of electromagnetically induced\ntransparency. Phys. Rev. Lett., 66:2593, 1991.\nR. Santra, E. Arimondo, T. Ido, C. H. Greene, and J. Ye. High-accuracy optical clock via\nthree-level coherence in neutral bosonic 88-Sr. Phys. Rev. Lett., 94:173002, 2005.\nR. Beigang, K. Lücke, A. Timmermann, P. J. West, and D. Frölich. Determination of absolute\nlevel energies of 5sns 1S0 and 5sns 1D2 Rydberg series of Sr. Opt. Comm., 42:19, 1982.\nE. R. Eliel, W. Hogervorst, T. Olsson, and L. R. Pendrill. High resolution laser spectroscopy of\nlow-lying p-states in Sr I and Ba I. Z. Phys. A, 311:1, 1983.\nH.-J. Kluge and H. Sauter. Levelcrossing experiments in the first excited 1P1 states of the\nalkaline earths. Z. Phys., 270:295, 1974.\nM. Xiao, Y. Li, S. Jin, and J. Gea-Banacloche. Measurement of dispersive properties of\nelectromagnetically induced transparency in rubidium atoms. Phys. Rev. Lett., 74:666, 1995.\nW. Demtroder. Laser Spectroscopy: Basic Concepts and Instrumentation, pages 516–524.\nSpringer-Verlag, second edition, 1996.\nR. Beigang, E. Matthias, and A. Timmermann. Influence of singlet-triplet mixing on the\nhyperfine structure of 5snd Rydberg states in 87-Sr. Phys. Rev. Lett., 47:326, 1981.\nR. Beigang, D. Schmidt, and A. Timmermann. Hyperfine induced perturbation of the 5s19d\nRydberg state of 87-Sr. J. Phys. B, 15:L201, 1982.\nC. J. Lorenzen, K. Niemax, and L. R. Pendrill. Isotope shifts of energy levels in the naturally\nabundant isotopes of strontium and calcium. Phys. Rev. A, 28:2051, 1983.\n\n\f"}