{"id": "http://arxiv.org/abs/1108.3767v1", "guidislink": true, "updated": "2011-08-18T14:37:19Z", "updated_parsed": [2011, 8, 18, 14, 37, 19, 3, 230, 0], "published": "2011-08-18T14:37:19Z", "published_parsed": [2011, 8, 18, 14, 37, 19, 3, 230, 0], "title": "New Tools for Decomposition of Sea Floor Pressure Data - A Practical\n  Comparison of Modern and Classical Approaches", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1108.1021%2C1108.3379%2C1108.3485%2C1108.6146%2C1108.3718%2C1108.3129%2C1108.0172%2C1108.4975%2C1108.2079%2C1108.5659%2C1108.3250%2C1108.0027%2C1108.0858%2C1108.6330%2C1108.1266%2C1108.2262%2C1108.5218%2C1108.3471%2C1108.1052%2C1108.5456%2C1108.4137%2C1108.3227%2C1108.1419%2C1108.5754%2C1108.2223%2C1108.2512%2C1108.3640%2C1108.5059%2C1108.2695%2C1108.5527%2C1108.2916%2C1108.4870%2C1108.1119%2C1108.5199%2C1108.0156%2C1108.0838%2C1108.0548%2C1108.1662%2C1108.1461%2C1108.4446%2C1108.3322%2C1108.3355%2C1108.2873%2C1108.4444%2C1108.0736%2C1108.2745%2C1108.0368%2C1108.6294%2C1108.4660%2C1108.1985%2C1108.0313%2C1108.0470%2C1108.4335%2C1108.4719%2C1108.3896%2C1108.2683%2C1108.0066%2C1108.4970%2C1108.5535%2C1108.4661%2C1108.2552%2C1108.4991%2C1108.3035%2C1108.0485%2C1108.0381%2C1108.2108%2C1108.5839%2C1108.3785%2C1108.5465%2C1108.6088%2C1108.3907%2C1108.3544%2C1108.4900%2C1108.5605%2C1108.5513%2C1108.4134%2C1108.3424%2C1108.2130%2C1108.2266%2C1108.0466%2C1108.3415%2C1108.1289%2C1108.6311%2C1108.0535%2C1108.3767%2C1108.5687%2C1108.4974%2C1108.5544%2C1108.2271%2C1108.0893%2C1108.3784%2C1108.3184%2C1108.3448%2C1108.1926%2C1108.0197%2C1108.1647%2C1108.2870%2C1108.1194%2C1108.0868%2C1108.1332%2C1108.4009&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "New Tools for Decomposition of Sea Floor Pressure Data - A Practical\n  Comparison of Modern and Classical Approaches"}, "summary": "In recent years more and more long-term broadband data sets are collected in\ngeosciences. Therefore there is an urgent need of algorithms which\nsemi-automatically analyse and decompose these data into separate periods which\nare associated with different processes. Often Fourier and Wavelet Transform is\nused to decompose the data into short and long period effects but these fail\noften because of their simplicity. In this paper we investigate the novel\napproaches Empircial Mode Decomposition and Sparse Decomposition for long-term\nsea floor pressure data analysis and compare them with the classical ones. Our\nresults indicate that none of the methods fulfils all the requirements but\nSparse Decomposition performed best except for computing efficiency.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1108.1021%2C1108.3379%2C1108.3485%2C1108.6146%2C1108.3718%2C1108.3129%2C1108.0172%2C1108.4975%2C1108.2079%2C1108.5659%2C1108.3250%2C1108.0027%2C1108.0858%2C1108.6330%2C1108.1266%2C1108.2262%2C1108.5218%2C1108.3471%2C1108.1052%2C1108.5456%2C1108.4137%2C1108.3227%2C1108.1419%2C1108.5754%2C1108.2223%2C1108.2512%2C1108.3640%2C1108.5059%2C1108.2695%2C1108.5527%2C1108.2916%2C1108.4870%2C1108.1119%2C1108.5199%2C1108.0156%2C1108.0838%2C1108.0548%2C1108.1662%2C1108.1461%2C1108.4446%2C1108.3322%2C1108.3355%2C1108.2873%2C1108.4444%2C1108.0736%2C1108.2745%2C1108.0368%2C1108.6294%2C1108.4660%2C1108.1985%2C1108.0313%2C1108.0470%2C1108.4335%2C1108.4719%2C1108.3896%2C1108.2683%2C1108.0066%2C1108.4970%2C1108.5535%2C1108.4661%2C1108.2552%2C1108.4991%2C1108.3035%2C1108.0485%2C1108.0381%2C1108.2108%2C1108.5839%2C1108.3785%2C1108.5465%2C1108.6088%2C1108.3907%2C1108.3544%2C1108.4900%2C1108.5605%2C1108.5513%2C1108.4134%2C1108.3424%2C1108.2130%2C1108.2266%2C1108.0466%2C1108.3415%2C1108.1289%2C1108.6311%2C1108.0535%2C1108.3767%2C1108.5687%2C1108.4974%2C1108.5544%2C1108.2271%2C1108.0893%2C1108.3784%2C1108.3184%2C1108.3448%2C1108.1926%2C1108.0197%2C1108.1647%2C1108.2870%2C1108.1194%2C1108.0868%2C1108.1332%2C1108.4009&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "In recent years more and more long-term broadband data sets are collected in\ngeosciences. Therefore there is an urgent need of algorithms which\nsemi-automatically analyse and decompose these data into separate periods which\nare associated with different processes. Often Fourier and Wavelet Transform is\nused to decompose the data into short and long period effects but these fail\noften because of their simplicity. In this paper we investigate the novel\napproaches Empircial Mode Decomposition and Sparse Decomposition for long-term\nsea floor pressure data analysis and compare them with the classical ones. Our\nresults indicate that none of the methods fulfils all the requirements but\nSparse Decomposition performed best except for computing efficiency."}, "authors": ["Matthias Ehrhardt", "Heiner Villinger", "Stefan Schiffler"], "author_detail": {"name": "Stefan Schiffler"}, "author": "Stefan Schiffler", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1016/j.cageo.2012.03.022", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1108.3767v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1108.3767v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "20 pages, 2 tables, 7 figures", "arxiv_primary_category": {"term": "physics.geo-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "physics.geo-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1108.3767v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1108.3767v1", "journal_reference": null, "doi": "10.1016/j.cageo.2012.03.022", "fulltext": "arXiv:1108.3767v1 [physics.geo-ph] 18 Aug 2011\n\nNew Tools for Decomposition of Sea Floor Pressure\nData\nA Practical Comparison of Modern and Classical Approaches\n\nM. Ehrhardta , H. Villingerb , S. Schifflera\na\n\nCenter for Industrial Mathematics, Fachbereich 3, University of Bremen,\nPO Box 33 04 40, D-28334 Bremen, Germany\nb\nDepartment of Geosciences, Fachbereich 5, University of Bremen,\nPO Box 33 04 40, D-28334 Bremen, Germany\n\nAbstract\nIn recent years more and more long-term broadband data sets are collected\nin geosciences. Therefore there is an urgent need of algorithms which semiautomatically analyse and decompose these data into separate periods which\nare associated with different processes. Often Fourier and Wavelet Transform is used to decompose the data into short and long period effects but\nthese fail often because of their simplicity. In this paper we investigate the\nnovel approaches Empircial Mode Decomposition and Sparse Decomposition\nfor long-term sea floor pressure data analysis and compare them with the\nclassical ones. Our results indicate that none of the methods fulfils all the\nrequirements but Sparse Decomposition performed best except for computing\nefficiency.\nKeywords: Time Series, Sea Floor Pressure Data, Fourier Transform,\nWavelet Transform, Empirical Mode Decomposition, Sparse Decomposition\n1. Introduction\n1.1. Motivation\nLong-term monitoring of earth processes becomes more and more essential and indispensable as only long records will reveal small changes which\nEmail addresses: ehrhardt@math.uni-bremen.de (M. Ehrhardt),\nvill@uni-bremen.de (H. Villinger), schiffi@math.uni-bremen.de (S. Schiffler)\nPreprint submitted to Computers and Geosciences\n\nNovember 10, 2018\n\n\fmay eventually have large societal impact in the near future. These processes encompasses geohazards like monitoring of potential landslides and\nvolcanic activity but also processes related to earthquake precursors and climatic signals. In addition real-time observations of tectonic processes with\nhigh-precision GPS measurements and satellite based observations of the\nmagnetic and gravity field of the earth give new insights into geological processes at local, regional and plate-size scales. As these signals are mostly\nsmall in amplitude and often buried in large-amplitude signals caused by\nother sources or only visible after major corrections to the field observations\nhave been made it is a major challenge to separate the wanted from the\nunwanted signal components.\nBroadband data acquisition is now very common as data storage capacity is no major obstacle today and low power data acquisition with autonomous monitoring systems over considerably long time periods (i.e. years)\nin remote places like the deep ocean floor become more and more feasible.\nIn addition large observational networks - either regionally only temporary\nlike EarthScope (http://www.earthscope.org/) - or permanent like Neptune Canada (http://www.neptunecanada.ca/) or national or international\ngeodetic GPS observation networks deliver continuously time series whose\ninformation content is not completely taken advantage of. All time series\ncontain signal periods from short (several seconds) to long (several month\nto years); origin and cause of some signal components is sometimes quite\nwell known (deterministic) as e.g. tides from various origins but in a lot of\ncases especially long-term changes are not well understood. In addition instrumental behaviour like drift and effects of environmental changes severely\nalter the signal.\nIn earth science seismology has faced this problem for a long time which\nbecame even more pressing over the last decade during which the number\nof seismological stations increased accompanied by a tremendous increase of\ndigital storage capacity and a rapid decrease in storage cost. In seismology\nrobust methods were established to extract earthquakes from long data sets\nautomatically and also detect phases and locate earthquakes. This highly automated processing can be achieved because the characteristics of the signals\nare well-known and years of research have been spend until these algorithms\nwere developed (Bormann, 2002).\nTraditional tools for data analysis are mostly based on spectral analysis\nmethods which are well established and available with a lot of software tools.\nHowever they tend to introduce unwanted effects especially at short periods\n2\n\n\fdue to filters and finite length of time series. Also their requirement of a\nstationary time series is often not fulfilled in the case of long-term records.\nTherefore new data exploration tools are needed which enable us to separate\nthe different signal components. These tools should be capable of analysing\nlong time series efficiently and help to identify different signal contributions\noriginating from different processes.\nIn this paper we present the results of time series analysis using four different methods. The times series analysed are sea floor pressure records from\ntwo different locations (details see section 1.2). The motivation for this investigation came from the fact that the sea floor pressure signal is dominated\nby a large deterministic tidal pressure signal but due to the high pressure\nresolution and a technically possible sampling interval of down to 2 seconds,\nsmall and short transient signals can be observed. Superimposed on these\ntides are also long-period transient changes, associated with tectonic and/or\noceanographic phenomena but also short period signals originating from local\nor teleseismic events. The problem was and still is to separate the deterministic from the small-amplitude non-deterministic signals. Traditional tidal\nanalysis methods as described e.g. in Pawlowicz et al. (2002) and available\nas Matlab R toolbox (http://www.eos.ubc.ca/~ rich/) do not always fulfil\nthe requirements.\nWe tested four methods in total: the traditional (1) Harmonic Decomposition, (2) Wavelet Decomposition, (3) Empirical Mode Decomposition (EMD)\nand a novel approach (4) Sparse Decomposition. The last two methods used\nare rather new and their potential use in time series analysis needs still to\nbe explored. All times series were analysed in the same way with the four\nmethods. After a short description of the methods we present the results and\ncompare the results with respect to their capability of signal decomposition.\n1.2. Data\nWe used four data sets to test the four methods for time series decomposition. The first data set (SYN) is a synthetic data set which is composed of\na tidal signal calculated with a published Matlab R -script (Pawlowicz et al.,\n2002), a long-term ramp function and two short-period events. In addition noise with an RMS of 49.16 P a is added. A step in the middle of\nthe time series simulates a tectonic or oceanographic event. The second\ntime series (MAR) consists of sea floor pressure observations from the Logatchev Hydrothermal Field, located at the Mid-Atlantic Ridge (Gennerich\nand Villinger, 2011). Sea floor pressure measurements at this site were made\n3\n\n\fin order to monitor the magmatic and hydrothermal activity of the field which\nmight express themselves as changes in sea floor pressure either due to subsidence or uplift or by tremor-like signals related to hydrothermal processes\nin the subsurface. The third and fourth records (CORK1 and CORK2) come\nfrom a so called CORK (Becker and Davis, 2005) installed at the sea floor\noff Vancouver Island. A CORK (Circulation Obviation Retrofit Kit) is a sea\nfloor installation which is placed on top of a drill hole and isolates the hydrological - and pressure - regime inside the drill hole from the ocean. The main\npurpose of this installation is the long-term monitoring of pressure signals\ninside the drill hole in order to identify either slow earthquakes i.e. long period changes in the sub sea floor stress field or the response of the formation\nto seismic events which reveal the hydrological and permeability structure of\nthe oceanic crust (e.g. Davis et al. (2011)). At every CORK installation sea\nfloor pressures are recorded in addition to the downhole pressures to provide\na local pressure reference signal.\nIn all cases (MAR, CORK1 and CORK2) pressures were recorded with\nhigh-resolution absolute pressure sensors (http://www.paroscientific.com/\nuwapp.htm) with a resolution of 7 P a which is about 7 mm equivalent water\nhight change. More details on location and sample intervals can be found in\ntable 1.\nTable 1: Details of the data sets used in the tests.\n\nData set\n\nSYN\nMAR\nCORK1\nCORK2\n\nStart\n\nEnd\n\nDuration\n∆t\n[days]\n[min]\n41.7\n30\n1046\n3292\n\n01.05.2008 31.05.2008\n26.06.2003 15.09.2005\n11.09.1996 15.09.2005\n\n60\n2\n10\n60\n\nPosition\nLatitude Longitude\n48◦ 26'N 128◦ 43'W\n14◦ 45'N 44◦ 5' W\n48◦ 26'N 128◦ 43'W\n\n2. Methods for Decomposing\nIn this section we discuss the methods used to decompose the data. These\nare\n1. Harmonic Decomposition\n4\n\n\f2. Wavelet Decomposition\n3. Empirical Mode Decomposition\n4. Sparse Decomposition\nThe classical methods Harmonic and Wavelet Decomposition are well known.\nTherefore we have chosen them to have a comparison for the new methods\nEmpirical Mode Decomposition and Sparse Decomposition.\nAll methods have in common that they seek for a new reprensentation,\nas a superposition of several patterns, of the data, in most cases by basis\ntransformation.\n2.1. Harmonic Decomposition\nThe Harmonic Decomposition uses the Fourier Transform with its efficient\nimplementation as Fast Fourier Transform (FFT). It is known since almost\nfifty years and used in many data processing routines. The basic idea is to\ntransform the given time signal into the frequency space. In other words we\nare looking for a reprensentation with sinusiod pattern with different frequencies. We refer to Gröchenig (2001) as a reference for a detailed introduction\nto Fourier Analysis. A much shorter introduction of the Fourier Transform\nis given in nearly every book about signal analysis, like Stark (2005).\nDecomposition of our time series with the help of Fourier Analysis starts\nwith a FFT. As we know the frequencies and amplitudes of the tides from\ntheoretical considerations and from observations, we can decompose the data\ninto several components and remove the unwanted and deterministic ones.\nThe remaining spectrum is transformed into a time series which contains\nonly the non-tidal components.\n2.2. Wavelet Decomposition\nAnother technique for decomposing the data is\nthe Wavelet Decomposition which uses the Wavelet\nTransform. It is not as old as the Fourier Transform but it is also known very well. Like the Fourier\nTransform, it transfers the given time signal in another space. This time the basis vectors are scalings\nand translational displacements of a basic pattern,\ncalled mother wavelet, hence in this space the coefficients encode when an effect is measured and how Figure 1: Wavelet db40\n(scaling function)\n\n5\n\n\flong this effect was. Therefore we can again decompose our data in features of a short and long period\nof time. Just like for the Fourier Transform there are fast implementations\nfor the Wavelet Transform. For further informations about wavelets see Louis\net al. (1997) or Stark (2005).\nFirst of all we have to choose the mother wavelet and a number of levels\nin which we want to decompose our signal. Unlike the Fourier Transform\nwhere the orthogonal functions are pre-defined, we have to choose the mother\nwavelet a priori. If we have extra knowledge about the data, we can improve\nthe results by choosing a wavelet which is 'similar' to the data or rather the\nfeatures we would like to extract. In our case the Wavelets Daubechies 10 Daubechies 40 (often abbreviated by db10 and db40) fit the tidal components\nvery well. After performing the Wavelet Transform with these wavelets, we\nobtained the best results by using db40, which is shown in figure 1.\n2.3. Empirical Mode Decomposition\nThe third method we would like to introduce is the Empirical Mode Decomposition and its enhancement the Ensemble Empirical Mode Decomposition (EEMD). The EMD is a new method, invented by Huang et al. (1998),\nfor decomposing a time signal. Since it is not as basic as the Fourier and\nWavelet Transform, we present the algorithm here. The idea is to decompose\nthe given time signal into a finite number of Intrinsic Mode Functions (IMF),\nwhich are functions which satisfy two conditions:\n1. The number of extrema and the number of zero crossings must differ\nat most by one.\n2. The mean value of the upper and lower envelope is zero at any time,\nwhere the upper envelope is computed by interpolating the maxima\nand the lower envelope by interpolating the minima.\nThe task of the EMD is to find these IMF's and is done by the following\nsifting process, also shown in figure 2.\n1. Find all extrema of the given data.\n2. If the number of extrema is one or less, we have found all IMFs and\nterminate the algorithm.\n3. Compute the upper and lower envelope by interpolation the maxima\nand minima and the mean of these.\n\n6\n\n\f4. If the mean value is zero, we have found an IMF. Start the sifting\nprocess again with the data substracted by this IMF. Otherwise start\nthe sifting process again with the data substracted by the mean.\ninitialize\nsubstract IMF\nsubstract mean\nno\nmean ≈ 0\n\nfind extrema\n#extrema ≤ 1\nyes\n\nno\n\nyes\n\nfound IMF\n\ncompute\nmean value\n\nterminate\nFigure 2: The algorithm of the EMD. The coloured areas represent the loops of the\nalgorithm.\n\nAlso the EMD can be seen as a basis transformation, but this time the\npatterns, which are the IMFs, depend on the data.\nAs we have seen we have done no a priori choices but choosing the interpolating scheme, which is predefined by cubic splines. Since abstracting\nan IMF reduces the number of extrema this algorithm terminates for every\nfinite time signal. A disadvantage of this method is that it is empirical and\nhas no solid theoretical foundation. Compared to the Fourier and Wavelet\nTransform the computing effort to decompose the data by EMD is higher\nbut still tolerable. A detailed introduction to EMD is given in Huang et al.\n(1998).\nA challenge in decomposing time series is to prevent mode mixing. Phenomena of similar time scale should be in the same mode (here: IMF) and\nvice versa phenomena with a totally different scale are expected to have a\ndifferent mode. For this purpose Wu and Huang suggested in 2009 a noise\nassisted data analysis method, called EEMD (Wu and Huang, 2009). For\n7\n\n\fa given signal white noise is added to the signal and then decomposed using the EMD. At the end - after numerous trials - we take the mean of the\nIMF's. \"By adding finite noise, the EEMD elimated largely the mode mixing problem and preserve physical uniqueness of decomposition. Therefore,\nthe EEMD represents a major improvement of the EMD method.\" (Wu and\nHuang, 2009). Of course this is more time consuming than the usual EMD\nand we have to check if this is worthwhile in our application or not.\n2.4. Sparse Decomposition\nThe last method we would like to present is the Sparse Decomposition.\nWe assume that the given data is a superposition of some processes. Then\nwe can find these by minimizing the residual\nk~k1 x1 + . . . + ~kn xn − ~y k2 ,\nwhere ~k1 , . . . , ~kn are the possible patterns. Writing ~k1 , . . . , ~kn as the columns\nof a matrix K, then this is the same as\nkK~x − ~y k2 .\nThe Fourier and the Wavelet Transform can also be written as such a minimization problem by choosing the patterns as harmonics or wavelets respectivly. The advantage compared to the Fourier and Wavelet Transform is that\nwe are not restricted to only one basis to find our decomposition, but we can\nincorporate several bases, which is called a dictionary. For our purposes\nwe have chosen a dictionary with translational displacements and scalings\nof the pattern in figure 3, hence we combine the capability of the Fourier\nand Wavelet Transform. Furthermore, we can also add any other pattern to\nincrease the physical meaning of the decomposition.\nWe are looking for a solution which has a small residual and is sparse,\ni.e. it uses only a few patterns. A decomposition of the data into only a few\npatterns is likely to have physical meaning, especially when the patterns are\nchosen according to physical effects. This can be achieved by minimizing\n1\nkK~x\n2\n\n− ~y k22 + αk~xk1 ,\n\nsee Daubechies et al. (2004). The last term k~xk1 , called penalty term, is the\nsum of the absolute values of ~x. The notion of Sparse Decomposition is also\ninvestigated in an applied manner in Chen et al. (1999).\n8\n\n\f(a) harmonics\n\n(b) wavelets\n\n(c) peaks\n\n(d) blocks\n\n(e) linear trend\n\nFigure 3: The chosen dictionary which contains harmonic waves, a wavelet basis, a peak\nbasis, blocks and a linear trend.\n\nFor our application we have chosen the algorithm Regularized Feature\nSign Search (RFSS), invented by Jin et al. (2009) and based on Lee et al.\n(2007), to minimize these functional.\nThe choice of the dictionary is an advantage and disadvantage at the\nsame time. If we have special knowledge of our data, like in most cases, we\ncan improve the decomposition by choosing 'good' pattern. On the other\nhand an algorithm which requires many input parameters is often difficult to\nhandle. A disadvantage is that the algorithm is much more demanding and\ncomplex compared to the other methods. We will see later on that this is\nworthwhile.\nFurther information and the full algorithm is given by Jin et al. (2009).\n3. Results\nIn this section we present and discuss our results. First of all we have to\nmention that the used data is preprocessed by subtracting the mean value,\nso the important features are emphasized.\nOur results for Harmonic and Wavelet Decomposition are obtained by using Matlab R 's functions fft and wavedec respectivly. For EMD and EEMD\nwe have used the algorithms by Rilling (2007) and Wu (downloaded 04/2011).\nThe RFSS implementation, used for the Sparse Decomposition, was according to Schiffler (2009). All algorithms can be found on the world wide web,\nsee our references.\nThe tidal extraction from the data sets is done very well by all algorithms,\nhence this does not distinguish the methods and is not discussed in the\nfollowing.\n\n9\n\n\f3.1. Decomposition of SYN\nThe results of the decomposition of the synthetic data are shown in figure\n4. Since it is a synthetic data set we can compare the computed decomposition by the real one to evaluate their quality.\nAs we see the methods' ability to decompose this data varies substantially.\nHarmonic and Wavelet Decomposition are able to decompose the data into\nfeatures of three different types. The noise and the short effects are in the\nsame component. The methods EMD and EEMD are not able to extract the\nhigh frequency features from the signal. All algorithms were able to separate\nthe long-term effects from the rest but failed to distinguish between the trend\nand the step.\nHarmonic and Wavelet Decomposition as well as the Sparse Decomposition correctly detect the short time features as well in time as in amplitude.\nOnly large boundary effects in the results obtained by Harmonic and Wavelet\ndegrade their quality. Methodically we can not obtain boundary effects in\nthe results of the Sparse Decomposition, since we have chosen our dictionary\nto contain local and global pattern. Hence local features do not have to be\nreconstructed by global pattern. Additionally the RFSS is not based on filtering, which often causes boundary effects. Overall the Sparse Decomposition\nperforms best in detecting the short time features.\nThe last aim was to extract the long time effects. All algorithms perform\nquite well, but again the boundary effects degrade the Harmonic and Wavelet\nresults. Sparse Decomposition is capable of extracting the trend and the step\nvery well whereas EMD and EEMD reproduce only the trend satisfactorily.\n3.2. Decomposition of MAR\nThe next data set to test is the one from the Mid-Atlantic Ridge and\nthe results can be seen in figure 5. This time all algorithms provide a good\ndecomposition into the short-, medium- and long-period features. Only the\nSparse Decomposition is able to extract also the noise from the short-period\ncomponents. There are just a few peaks visible in the short-period decomposition by Harmonic Decomposition and EMD which are probably aliased\nlocal eartquake signals. These are also extracted very well by the Sparse Decomposition. The short-period features given by Wavelet show again some\nboundary effects. The decomposition by the EEMD has a basic noise level\nwhich is much too high. This is a result of the white noise added in every\nstep of the algorithm but which is clearly not faded away with 100 runs of\nthe EMD.\n10\n\n\fThe trend and long-term feature extraction of the five methods are all\nnearly the same. In all cases pressures decrease initially over the first week\nand then increase by about 0.4 kP a over the rest of the time window. The\nWavelet results differ from the others by significant boundary effects.\n3.3. Decomposition of CORK1\nThe results of the third data set, CORK1, are given in figure 6. This time\nevery method is again capable to decompose the data into the three main\nfeatures. In this data set there are two short time effects whose amplitudes\nare a lot higher than the amplitudes of the other effects so we have also\nshowed the short period effects zoomed in.\nThe similarity between the short period features detected by Harmonic\nand Wavelet Decomposition is worth mentioning. The EMD and EEMD detect these features very similar in time but differ in detecting the amplitude.\nAlso the EEMD is not able to detect short period features with a small amplitude since the added noise prevents this. The Sparse Decomposition is\nable to detect these features as well and separates them additionally from\nthe noise.\nThe trends detected by all methods are again quite similar. Only the\nWavelet trend has huge boundary effects. The behaviour of Harmonic Decomposition at the boundary could be interpreted as a boundary effect, but\nwe guess this is not the case, since Sparse Decomposition predict the same\nand is methodically unaffected by boundary effects. The same behaviour can\nbe obtained from the EEMD's trend.\n3.4. Decomposition of CORK2\nFor the last data set the results are given in figure 7. Since this is a\nlong data set and the sampling interval is only 60 min we focus on the long\nperiod effects. On the other hand we can not expect short time features\nwith a shorter duration than 60 min, like earthquakes, to appear in this data\nset, hence the short time components obtained from this data set has to be\ninterpreted very carefully.\nLike with the dataset SYN, which sampling interval was also 60 min,\nEMD and EEMD are not capable to decompose the features with higher\nfrequencies than the tides. Contrary this is done very well by Harmonic,\nWavelet and Sparse Decomposition. There are one huge and some smaller\nshort period signals associated to earthquakes, which are again detracted\nfrom the noise by Sparse Decomposition.\n11\n\n\fThe trends detected by all methods look quite similar. In any case we\nobtain first a downdrift of 3.5 kP a over 2 years, followed by an updrift the\nsame amount in the next seven years. As seen at the other data sets the\nboundary effects are very high at the Wavelet Decomposition.\n3.5. Discussion\nA summary of the observations described in the previous sections is given\nin table 2. The evaluation of the different decomposition methods was based\non the following more or less qualitative criteria:\n• How successful was the algorithm in decomposing the signal into a long\nand short period components?\n• Did the algorithm find a short period event in the presence of background noise?\n• Does the algorithm create large effects at the boundaries of the time\nwindow?\n• How much CPU time is needed for the decomposition?\nFrom looking at table 2 one can conclude that none of the used methods\nfor decomposition is perfect in every aspect. Harmonic and Wavelet are able\nto detect the short period features and perform also quite well in detracting\nthe trend but their results, especially the results of Wavelet, show massive\nboundary effects. Because of this there is a high uncertainty if the shown\ndecomposition is physically reasonable or not. On the other hand their computing efficiency is so high that the Harmonic and Wavelet Decomposition is\nnearly not restricted by the length of the given data.\nThe performance of EMD and EEMD is directly opposite to Harmonic\nand Wavelet. The EMD and EEMD perform very well on detracting the\ntides and show only small influences of boundary effects but their capability\nof separating components with higher frequencies than the tides is restricted.\nAt least when the data is recorded with a sampling interval of 60 minutes.\nEspecially the EEMD fails because the added noise does not fade away in our\nexperiments. Overall we have seen in every data set that the large additional\ncomputational effort of the EEMD compared to the EMD is not worthwhile\nfor the analysis of sea floor pressure data.\nVery impressive is the capability of the Sparse Decomposition. It was able\nto detract the short period components as well as the large period components\n12\n\n\fshort period\nlong period\neffects\n\nBoundary\n\nDecomposition\n\nTable 2: Overview of our results.\n\nSYN\nMAR\n\n\" indicates good, • fair, and % bad results.\n\nHarmonic\n\nWavelet\n\n•\n\n•\n\n\"\n\n\"\n\nCORK2\n\n\"\n\"\n\n\"\n\"\n\nSYN\n\n•\n\n•\n•\n•\n•\n\nCORK1\n\nMAR\nCORK1\n\n\"\n\"\n\nCORK2\n\n•\n\nSYN\n\n%\n\nMAR\nCORK1\nCORK2\n\nComputing efficiency\n\n%\n%\n%\n%\n\"\n\n•\n•\n•\n\n\"\n\nEMD\n\nEEMD\n\n•\n\n•\n\n%\n\"\n%\n\"\n\"\n\"\n\"\n\"\n\"\n\"\n\"\n•\n\n%\n%\n%\n•\n\n\"\n\"\n\"\n•\n\n\"\n\"\n\"\n%\n\nSparse\n\n\"\n\"\n\"\n\"\n\"\n\"\n\"\n\"\n\"\n\"\n\"\n\"\n%\n\nin every case. Contrary to the other methods, it was also able to detract the\nnoise from the meaningful short period components. A hugh advantage is\nalso that the Sparse Decomposition does not have any boundary effects. Only\nthe computing efficiency needs to be improved.\n\n13\n\n\f0\n−20\n0.5\n0\n\nshort\nmedium\n\npressure variations [kPa]\n\n20\n\nlong\n\nshort\nmedium\n\npressure variations [kPa]\n\nlong\n\n0.5\n0\n−0.5\n\n−0.5\n10\n\n20\ntime [days]\n\n30\n\n0\n0\n\n20\n0\n−20\n0.5\n0\n\nshort\n\npressure variations [kPa]\n\nnot availabl e\n\nmedium\n\n0.5\n0\n−0.5\n\n−0.5\n\n0.5\n0\n−0.5\n\n10\n\n20\ntime [days]\n\n30\n\n40\n\n20\n0\n−20\n0.5\n0\n\n40\n\n0\n\nnoise\n\n0.5\n0\n−0.5\n20\n0\n−20\n0.2\n0\n−0.2\n0.2\n0\n−0.2\n\ntides\n\nshort\n\n0\n\ntrend\n\n−20\n0.5\n0\n−0.5\n\n0.2\n0\n−0.2\n\njump\n\n20\n\n0\n\n10\n\n20\ntime [days]\n\n10\n\n20\ntime [days]\n\n30\n\n40\n\n30\n\n40\n\n(d) EEMD\n\npressure variations [kPa]\n\nnoise\nshort\nmedium\n\npressure variations [kPa]\n\nlong\n\n30\n\nnot availabl e\n\n(c) EMD\n\n0.5\n0\n−0.5\n\n20\ntime [days]\n\n−0.5\n0\n\n0.2\n0\n−0.2\n\n10\n\n(b) Wavelet Decomposition\n\nlong\n\nshort\nmedium\n\n0\n−20\n0.5\n\n40\n\n(a) Harmonic Decomposition\n\npressure variations [kPa]\n\n20\n\n−0.5\n0\n\nlong\n\n0.5\n0\n−0.5\n\n30\n\n40\n\n0\n\n(e) Sparse Decomposition\n\n10\n\n20\ntime [days]\n\n(f) synthetic data\n\nFigure 4: Decomposition of data set SYN. There are shown from the top to the bottom\nthe short, medium and long time components. The real decomposition can be seen in\nfigure 4(f). EMD and EEMD were not capable to detect features with a higher frequency\nthan the tides.\n\n14\n\n\f01/05/2008\n\n16/05/2008\n\n31/05/2008\n\nshort\nmedium\n\npressure variations [kPa]\n\n0.2\n0\n−0.2\n\n31/05/2008\n\nnoise\nshort\nmedium\n\nshort\nmedium\n\npressure variations [kPa]\n\n0.2\n0\n−0.2\n\n31/05/2008\n\n0.2\n0\n−0.2\n10\n0\n\n0.2\n0\n−0.2\n\n01/05/2008\n\n(c) EMD\n\npressure variations [kPa]\n\n16/05/2008\n\n−10\nlong\n\nshort\nmedium\nlong\n\npressure variations [kPa]\n\n0\n−10\n\nlong\n\n0.2\n0\n−0.2\n\n(b) Wavelet Decomposition\n\n0.2\n0\n−0.2\n10\n\n16/05/2008\n\n0\n\n01/05/2008\n\n(a) Harmonic Decomposition\n\n01/05/2008\n\n0.2\n0\n−0.2\n10\n\n−10\nlong\n\nshort\nmedium\n\n0\n−10\n\nlong\n\npressure variations [kPa]\n\n0.2\n0\n−0.2\n10\n\n16/05/2008\n\n31/05/2008\n\n(d) EEMD\n\n0.2\n0\n−0.2\n0.2\n0\n−0.2\n10\n0\n−10\n0.2\n0\n−0.2\n\n01/05/2008\n\n16/05/2008\n\n31/05/2008\n\n(e) Sparse Decomposition\nFigure 5: Decomposition of the data set MAR. There are shown from the top to the\nbottom the short, medium and long time components.\n\n15\n\n\f0\n\n−0.5\n26/06/2003\n\n05/08/2004\n\nshort short(zoom)\n\n0\n\n−0.5\n26/06/2003\n\n15/09/2005\n\nshort short(zoom)\n\n0\n\n15/09/2005\n\n05/08/2004\n\n15/09/2005\n\n(d) EEMD\n\n1\n0\n−1\n1\n0\n−1\n20\n\nmedium\n\n0\n−20\n20\n0\n−20\n0.5\n\nlong\n\nshort short(zoom) noise\n\n0\n−20\n20\n0\n−20\n0.5\n\n−0.5\n26/06/2003\n\n(c) EMD\n\npressure variations [kPa]\n\n0\n−1\n20\n\nmedium\n\npressure variations [kPa]\n05/08/2004\n\n15/09/2005\n\n1\n\nlong\n\n0\n\nmedium\n\nshort short(zoom)\n\n−1\n20\n\nlong\n\npressure variations [kPa]\n\n0\n\n0\n\n05/08/2004\n\n(b) Wavelet Decomposition\n\n1\n\n−0.5\n26/06/2003\n\n0\n−20\n20\n0\n−20\n0.5\n\n(a) Harmonic Decomposition\n\n−20\n20\n0\n−20\n0.5\n\n0\n−1\n20\n\nmedium\n\npressure variations [kPa]\n\n0\n−20\n20\n0\n−20\n0.5\n\n1\n\nlong\n\n−1\n20\n\nmedium\n\nshort short(zoom)\n\n0\n\nlong\n\npressure variations [kPa]\n\n1\n\n0\n\n−0.5\n26/06/2003\n\n05/08/2004\n\n15/09/2005\n\n(e) Sparse Decomposition\nFigure 6: Decomposition of the data set CORK1. There are shown from the top to the\nbottom the short, medium and long time components.\n\n16\n\n\f0\n\n−2\n11/09/1996\n\n15/03/2001\n\nshort short(zoom)\n\n0\n\n−2\n11/09/1996\n\n15/09/2005\n\n15/03/2001\n\nshort\nmedium\n\npressure variations [kPa]\n\n0\n\nlong\n\nshort\nmedium\n\npressure variations [kPa]\n\nlong\n\n0\n−20\n2\n\n0\n\n15/09/2005\n\nnot availabl e\n\n−20\n20\n0\n−20\n2\n0\n\n−2\n11/09/1996\n\n(c) EMD\n\n15/03/2001\n\n15/09/2005\n\nmedium\n\nshort short(zoom) noise\n\n(d) EEMD\n\nlong\n\npressure variations [kPa]\n\n15/09/2005\n\n20\nnot availabl e\n\n−20\n20\n\n1\n0\n−1\n1\n0\n−1\n20\n0\n−20\n20\n0\n−20\n2\n0\n−2\n11/09/1996\n\n15/03/2001\n\n(b) Wavelet Decomposition\n\n20\n\n−2\n11/09/1996\n\n0\n−20\n20\n0\n−20\n2\n\n(a) Harmonic Decomposition\n\n0\n\n0\n−1\n20\n\nmedium\n\npressure variations [kPa]\n\n0\n−20\n20\n0\n−20\n2\n\n1\n\nlong\n\n−1\n20\n\nmedium\n\nshort short(zoom)\n\n0\n\nlong\n\npressure variations [kPa]\n\n1\n\n15/03/2001\n\n15/09/2005\n\n(e) Sparse Decomposition\nFigure 7: Decomposition of the data set CORK2. There are shown from the top to the\nbottom the short, medium and long time components. Since the short time components\nhas features of different amplitudes these are also showed zoomed in. EMD and EEMD\nfailed to detect the short period features.\n\n17\n\n\f4. Conclusion\nTo conclude our investigation we have to state that no method is perfect\nfor every time series. For our data sets we got the best results by using the\nSparse Decomposition. But at the moment it is not recommendable for time\nseries with more than 200,000 measurements. For this kind of time series\nwe recommend the EMD for long period contributions and the Harmonic\nDecomposition for the short ones. EEMD fails to improve the EMD in detecting and is not recommended due to ist large computational needs. We\nobtained sometimes good results using the Wavelet Decomposition but they\nwere never better than the results obtained by the Harmonic Decomposition,\neven in detecting earthquakes which is classically done by Wavelets.\nIt is obvious that the comparison of the computing efficiency is somewhat\nunfair as algorithms to calculate the FFT and Wavelet Transform are highly\noptimized whereas algorithms for EMD, EEMD and especially RFSS are\nnot yet written for speed. However it is very likely that FFT and Wavelet\nTransform will always be faster however the difference to EMD, EEMD and\nRFSS will most likely shrink in the near future due to the improvement of\nthe algorithms and maybe by developing parallel algorithms for them.\n5. Acknowledgements\nWe would like to thank Hans-Hermann Gennerich and Earl Davis for\nproviding the sea floor pressure data and Peter Maass for supporting one of\nus (ME) during this study. All computations were done on the computer\nnetwork provided by the Department of Mathematics and Computer Science\nof the University of Bremen. Their help and support is kindly acknowledged.\nReviews of two anonymous reviewers helped to improve the article.\nReferences\nBecker, K., Davis, E.E., 2005. A review of cork designs and operations during\nthe ocean drilling program. Fisher, A.T., Urabe, T., Klaus, A., and the\nExpedition 301 Scientists Proceedings of the Integrated Ocean Drilling\nProgram 301.\nBormann, P. (Ed.), 2002. IASPEI New manual of seismological observatory\npractice. volume 1 and 2. GeoForschungsZentrum Potsdam.\n\n18\n\n\fChen, S., Donoho, D., Saunders, M., 1999. Atomic decomposition by basis\npursuit. SIAM journal on scientific computing 20, 33–61.\nDaubechies, I., Defrise, M., De Mol, C., 2004. An iterative thresholding\nalgorithm for linear inverse problems with a sparsity constraint. Communications on Pure and Applied Mathematics 57, 1413–1457.\nDavis, E., Heesemann, M., Wang, K., 2011. Evidence for episodic aseismic\nslip across the subduction seismogenic zone off costa rica: Cork borehole\npressure observations at the subduction prism toe. Earth and Planetary\nScience Letters 306, 299–305.\nGennerich, H.H., Villinger, H., 2011. Deciphering the ocean bottom pressure\nvariation in the logatchev hydrothermal field at the eastern flank of the\nmid-atlantic ridge. Geochem. Geophys. Geosyst., .\nGröchenig, K., 2001. Foundations of Time-Frequency Analysis. Applied and\nNumerical Harmonic Analysis, Birkhäuser Boston Inc., Boston, MA.\nHuang, N., Shen, Z., Long, S., Wu, M., Shih, H., Zheng, Q., Yen, N., Tung,\nC., Liu, H., 1998. The Empirical Mode Decomposition and the Hilbert\nSpectrum for Nonlinear and Non-Stationary Time Series Analysis. Proceedings of the Royal Society of London. Series A: Mathematical, Physical\nand Engineering Sciences 454, 903–995.\nJin, B., Lorenz, D.A., Schiffler, S., 2009. Elastic-net regularization: error\nestimates and active set methods. Inverse Problems 25, 115022–+.\nLee, H., Battle, A., Raina, R., Ng, A., 2007. Efficient sparse coding algorithms. Advances in neural information processing systems 19.\nLouis, A.K., Maass, P., Rieder, A., 1997. Wavelets: Theory and Applications.\nWiley: New York.\nPawlowicz, R., Beardsley, B., Lentz, S., 2002. Classical Tidal Harmonic\nAnalysis Including Error Estimates in MATLAB using T TIDE. Computers and Geosciences 28, 929–937.\nPolster, A., Fabian, M., Villinger, H., 2009. Effective resolution and drift\nof paroscientific pressure sensors derived from long-term seafloor measurements. Geochemistry Geophysics Geosystems 10.\n19\n\n\fRilling, G., 2007. EMD-algorithm, emd.m. http://perso.ens-lyon.fr/\npatrick.flandrin/emd.html .\nSchiffler, S., 2009. RFSS-algorithm, rfss.m. http://sites.google.com/\nsite/igorcarron2/cs/ .\nStark, H.G., 2005. Wavelets and Signal Processing: An Application-Based\nIntroduction. Springer. 1 edition.\nWu, Z., downloaded 04/2011. EEMD-algorithm, eemd.m. http://rcada.\nncu.edu.tw/eemd.m .\nWu, Z., Huang, N.E., 2009. Ensemble Empirical Mode Decomposition: A\nNoise-Assisted Data Analysis Method. Advances in Adaptive Data Analysis (AADA) 1, 1–41.\n\n20\n\n\f"}