{"id": "http://arxiv.org/abs/0808.2886v1", "guidislink": true, "updated": "2008-08-21T10:25:14Z", "updated_parsed": [2008, 8, 21, 10, 25, 14, 3, 234, 0], "published": "2008-08-21T10:25:14Z", "published_parsed": [2008, 8, 21, 10, 25, 14, 3, 234, 0], "title": "Transversity Asymmetries", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0808.3713%2C0808.1211%2C0808.3118%2C0808.2654%2C0808.1767%2C0808.0175%2C0808.3027%2C0808.3217%2C0808.3852%2C0808.2031%2C0808.1300%2C0808.0248%2C0808.0781%2C0808.2331%2C0808.1121%2C0808.3493%2C0808.0799%2C0808.2026%2C0808.0207%2C0808.1418%2C0808.0904%2C0808.2501%2C0808.1808%2C0808.0550%2C0808.1655%2C0808.2894%2C0808.3469%2C0808.3387%2C0808.3286%2C0808.3071%2C0808.2818%2C0808.3785%2C0808.2740%2C0808.1303%2C0808.1244%2C0808.3780%2C0808.1199%2C0808.4037%2C0808.0558%2C0808.2622%2C0808.3244%2C0808.3642%2C0808.2523%2C0808.3210%2C0808.1243%2C0808.1637%2C0808.3264%2C0808.2739%2C0808.2810%2C0808.3575%2C0808.1555%2C0808.4044%2C0808.3342%2C0808.2725%2C0808.0594%2C0808.1657%2C0808.1984%2C0808.0521%2C0808.3414%2C0808.0601%2C0808.3344%2C0808.4053%2C0808.1013%2C0808.0752%2C0808.4096%2C0808.4139%2C0808.3796%2C0808.2886%2C0808.0768%2C0808.0515%2C0808.2364%2C0808.3238%2C0808.0953%2C0808.3395%2C0808.3765%2C0808.2075%2C0808.3332%2C0808.0305%2C0808.3256%2C0808.0357%2C0808.2798%2C0808.1315%2C0808.2245%2C0808.3339%2C0808.0665%2C0808.2557%2C0808.0897%2C0808.1978%2C0808.2013%2C0808.2847%2C0808.2794%2C0808.2093%2C0808.3248%2C0808.0794%2C0808.2300%2C0808.2682%2C0808.3333%2C0808.0760%2C0808.0007%2C0808.0393%2C0808.3321&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Transversity Asymmetries"}, "summary": "Ways to access transversity through asymmetry measurements are reviewed. The\nrecent first extraction and possible near future extractions are discussed.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0808.3713%2C0808.1211%2C0808.3118%2C0808.2654%2C0808.1767%2C0808.0175%2C0808.3027%2C0808.3217%2C0808.3852%2C0808.2031%2C0808.1300%2C0808.0248%2C0808.0781%2C0808.2331%2C0808.1121%2C0808.3493%2C0808.0799%2C0808.2026%2C0808.0207%2C0808.1418%2C0808.0904%2C0808.2501%2C0808.1808%2C0808.0550%2C0808.1655%2C0808.2894%2C0808.3469%2C0808.3387%2C0808.3286%2C0808.3071%2C0808.2818%2C0808.3785%2C0808.2740%2C0808.1303%2C0808.1244%2C0808.3780%2C0808.1199%2C0808.4037%2C0808.0558%2C0808.2622%2C0808.3244%2C0808.3642%2C0808.2523%2C0808.3210%2C0808.1243%2C0808.1637%2C0808.3264%2C0808.2739%2C0808.2810%2C0808.3575%2C0808.1555%2C0808.4044%2C0808.3342%2C0808.2725%2C0808.0594%2C0808.1657%2C0808.1984%2C0808.0521%2C0808.3414%2C0808.0601%2C0808.3344%2C0808.4053%2C0808.1013%2C0808.0752%2C0808.4096%2C0808.4139%2C0808.3796%2C0808.2886%2C0808.0768%2C0808.0515%2C0808.2364%2C0808.3238%2C0808.0953%2C0808.3395%2C0808.3765%2C0808.2075%2C0808.3332%2C0808.0305%2C0808.3256%2C0808.0357%2C0808.2798%2C0808.1315%2C0808.2245%2C0808.3339%2C0808.0665%2C0808.2557%2C0808.0897%2C0808.1978%2C0808.2013%2C0808.2847%2C0808.2794%2C0808.2093%2C0808.3248%2C0808.0794%2C0808.2300%2C0808.2682%2C0808.3333%2C0808.0760%2C0808.0007%2C0808.0393%2C0808.3321&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Ways to access transversity through asymmetry measurements are reviewed. The\nrecent first extraction and possible near future extractions are discussed."}, "authors": ["Daniel Boer"], "author_detail": {"name": "Daniel Boer"}, "author": "Daniel Boer", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1142/9789814277785_0002", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/0808.2886v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0808.2886v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "18 pages, 5 postscript figures; Opening talk of the Second\n  International Workshop on Transverse Polarisation Phenomena in Hard Processes\n  (Transversity 2008), Ferrara, Italy, May 28-31, 2008", "arxiv_primary_category": {"term": "hep-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "hep-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0808.2886v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0808.2886v1", "journal_reference": null, "doi": "10.1142/9789814277785_0002", "fulltext": "1\n\narXiv:0808.2886v1 [hep-ph] 21 Aug 2008\n\nTransversity Asymmetries\n\n∗\n\nDaniël Boer\nDepartment of Physics and Astronomy,\nVrije Universiteit Amsterdam,\nDe Boelelaan 1081, 1081 HV Amsterdam,\nThe Netherlands\nE-mail: D.Boer@few.vu.nl\nWays to access transversity through asymmetry measurements are reviewed.\nThe recent first extraction and possible near future extractions are discussed.\nKeywords: Transverse spin physics, cross section asymmetries\n\n1. Transversity from 1978 to 2008\nThe year 1978 marks the birth of transversity as a quark distribution with\nthe submission of the seminal paper1 by Ralston and Soper on November\n14, 1978. Transversity was a pre-existing term, but is meant here as the\ndistribution of transversely polarized quarks inside a transversely polarized\nhadron. It depends on the lightcone momentum fraction x carried by the\nquark and is often denoted by h1 (x). Theoretically it is defined as a hadronic\nmatrix element of a nonlocal operator:\nZ\n\ndλ iλx\ne hP, ST |ψ(0)L[0, λ]iσ i+ γ5 ψ(λn− )|P, ST i = STi h1 (x),\n2π\n\n(1)\n\nwhere P and ST denote the momentum and the transverse spin vector of\nthe hadron, n− is a lightlike direction, and L is a path-ordered exponential that renders the nonlocal operator color gauge invariant. Transversity\nis a chiral-odd or helicity-flip quantity, hence, in observables it always appears accompanied by another chiral-odd quantity, several of which will be\ndiscussed below. Ralston and Soper considered the double transverse spin\nasymmetry in the Drell-Yan process (reconsidered in detail at a later stage\nin Refs.2–4 ), i.e. the asymmetry in the azimuthal angular distribution of a\nproduced lepton pair in the collision of two hadrons, in this case protons,\n\n∗ Opening\n\ntalk of the Second International Workshop on Transverse Polarisation Phenomena in Hard Processes (Transversity 2008), Ferrara, Italy, May 28-31, 2008\n\n\f2\n\nwith transverse spins parallel minus antiparallel:\nAT T =\n\nσ(p↑ p↑ → l l̄ X) − σ(p↑ p↓ → l l̄ X) X 2 q\n∝\neq h1 (x1 ) hq̄1 (x2 ). (2)\nσ(p↑ p↑ → l l̄ X) + σ(p↑ p↓ → l l̄ X)\nq\n\nHowever, polarized Drell-Yan is very challenging experimentally, as witnessed by the fact that even 30 years later it has not yet been performed.\nRHIC at BNL is at present the only place that can do double polarized\nproton-proton scattering, but AT T is expected to be small at RHIC. It involves two unrelated transversity functions: the one for quarks and the one\nfor antiquarks for which likely holds that hq̄1 ≪ hq1 . An upper bound on\nAT T can be obtained by using Soffer's inequality,\n|h1 (x)| ≤\n\n1\n[f1 (x) + g1 (x)].\n2\n\n(3)\n\nThe upper bound on AT T was shown5 to be small at RHIC, of the percent\nlevel, requiring an accuracy that will not be reached soon.\nAlready before the advent of RHIC, people started to search for alternative ways of probing transversity. The first suggestion was made by Collins.6\nThe idea was to exploit what is now referred to as the Collins effect, which is\nparameterized by the transverse momentum dependent fragmentation function H1⊥ (z, kT2 ). It is a spin-orbit coupling effect in the fragmentation of a\ntransversely polarized quark, resulting in an asymmetric azimuthal angular\ndistribution of produced hadrons around the quark polarization direction,\na sin φ distribution. H1⊥ is also a chiral-odd quantity.\nCollins pointed out that there would be a sin(φh + φS ) asymmetry in\nsemi-inclusive DIS (SIDIS) proportional to h1 ⊗ H1⊥ . Here φh and φS are\nthe azimuthal angles of a final state hadron and the transverse spin of the\ninitial state polarized hadron, respectively. The angles are measured w.r.t.\nthe lepton scattering plane, which fixes the polarization state of the virtual\nphoton such that the helicity flip state of the probed quark is selected.\nThe HERMES experiment at DESY was the first to measure a clearly\nnonzero, percent level, sin(φh + φS ) Collins asymmetry in SIDIS.7,8 This\nasymmetry has afterwards also been measured by the COMPASS experiment at CERN using a deuteron target9,10 and, as first reported at this\nTransversity 2008 workshop, also on a proton target.11 These measurements allow for an extraction of transversity once the Collins function H1⊥\nis known. This exemplifies the crucial role played by electron-positron annihilation experiments. In Ref.12 it was pointed out how H1⊥ can be extracted\nfrom a cos 2φ asymmetry in e+ e− → π + π − X (see also the recent, more\nextended Ref.13 ). This turned out to be the method that has actually been\n\n\f3\n\nemployed. The measurement of this cos 2φ asymmetry has been performed\nat KEK using BELLE data.14,15 This allowed for the first extraction of\ntransversity by Anselmino et al.16 in 2007, cf. Fig. 1.\n\nx ∆T u(x, k )\n\n0.5\n\nx ∆T u(x)\n\n0.4\n0.3\n0.2\n0.1\n0\n\n0.1\n\nx ∆T d(x)\n\n0.4\n\nx = 0.1\n\n0.3\n0.2\n0.1\n0\n-0.1\n\nx ∆T d(x, k )\n\n-0.1\n\n0.5\n\n0.05\n0\n\n-0.1\n\n0.1\n0.05\n0\n-0.05\n-0.1\n\nx = 0.1\n\n-0.15\n-0.2\n0.2\n\n0.4\n\n0.6\n\n0.8\n\n1\n\nx\n\n-0.2\n0\n\n0.2\n\n0.4\n\n0.6\n\n0.8\n\n1\n\nk (GeV)\n\nFig. 1. First extraction of transversity by Anselmino et al.16 Left: xh1 (x) for u and\nd quarks, the red curves are the best fits, the blue curves the Soffer bounds. Right:\nkT -dependence using a Gaussian Ansatz.\n\nNext we turn to a discussion of the magnitude of the extracted transversity functions for u and d quarks. Often h1 is compared with its Soffer bound\nin Eq. (3) or with g1 , which is interesting for theoretical reasons, but for\nphenomenology it is more relevant to compare it to f1 , since that is what\ndetermines the magnitude of asymmetries. The first extraction, the best\nfit, indicates that h1 (x) ≈ f1 (x)/3, which means that transversity is not\nparticularly small. Whether it is of the expected magnitude is a different\nmatter though. One way of quantifying this is to compare it to expectations\nfrom lattice QCD and from models for the tensor charge,\nZ 1\n\u0002\n\u0003\nδq =\ndx hq1 (x) − hq̄1 (x) ,\n(4)\n0\n\nwhich is a fundamental charge, like the electric and the axial charge.\nTransversity is the only known way of obtaining the tensor charge experimentally. Using the central fit and assuming antiquark transversity to be\nsmall, the first extraction yields17 (at Q2 = 2.4 GeV2 )\nδu ≃ +0.39, δd ≃ −0.16, s.t. δu − δd ≃ 0.55\n\n\f4\n\nA lattice determination with two dynamical quark flavors yields18 (at μ2 =\n4 GeV2 )\nδu = +0.857 ± 0.013, δd = −0.212 ± 0.005, s.t. δu − δd = 1.068 ± 0.016\nThe combination δu − δd is given, because it has the advantage of cancelation of disconnected contributions which, although expected to be small,\nare not calculated.\nMost models find tensor charges roughly in the range:\nδu = +1.0 ± 0.2,\n\nδd = −0.2 ± 0.2\n\nAll of this is consistent with the bounds derived by Soffer:19\n|δu| ≤ 3/2,\n\n|δd| ≤ 1/3\n\nThe recent extraction via the Collins effect asymmetries seems to indicate a u-quark tensor charge that is smaller than expected from lattice\nQCD and most models. However, at this workshop we learned that a new\nfit using newer and more accurate data yields a larger δu, which seems more\nin line with expectations.20\nThere is nevertheless another issue concerning the magnitude of the extracted transversity functions. The BELLE and SIDIS data are obtained\nat different scales: Q2 = 110 GeV2 and hQ2 i = 2.4 GeV2 , respectively. The\nextraction uses two Collins effect asymmetries, which are not like ordinary\nleading twist asymmetries. Both azimuthal asymmetries involve transverse\nmomentum dependent functions (TMDs) and beyond tree level this becomes quite involved. The formalism that deals with TMDs beyond tree\nlevel is that of Collins-Soper (CS) factorization, initially considered for (almost) back-to-back hadron production in e+ e− annihilation21 , and later\nfor SIDIS and Drell-Yan.22,23 In principle, CS factorization dictates how\nazimuthal asymmetries depend on Q2 , but in practice this has not been implemented in the h1 extraction analysis.16 Evolution is taken into account\nonly partially in the following way. The Collins function is parameterized\nin terms of the unpolarized fragmentation function D1 ,\nH1⊥ (z, kT2 ) ≡ D1 (z)F (z, kT2 ),\n\n(5)\n\nand the evolution is taken to be the one of the collinear function D1 (z).\nThis does not take into account that beyond tree level also the transverse\nmomentum dependence requires modification with changing energy scale.\nCollins effect asymmetries involve convolution integrals, for example the\nSIDIS asymmetry as a function of the observed transverse momentum q T\n\n\f5\n\n(with absolute value QT ),\n|S |\ndσ(e p↑ → e′ h X)\n∝ T sin(φh + φS ) F\nd2 q T\nQT\n\n\u0014\n\n\u0015\nq T *kT\n⊥\nh 1 H1 ,\nM\n\n(6)\n\ninvolves a convolution that at tree level is of the form:\nZ\nF [w f D] ≡ d2 pT d2 kT δ (2) (pT + q T − kT ) w(pT , q T , kT )\n×f (x, p2T )D(z, z 2 k2T ).\n\n(7)\n\nIn general however it involves another factor U (called S in Refs.22,23 ):\nZ\nF [w f D] ≡ d2 pT d2 kT d2 lT δ (2) (pT + lT + q T − kT ) w(pT , q T , kT )\n×f (x, p2T )D(z, z 2 k2T )U (lT2 ).\n\n(8)\n\nIn terms of diagrams the difference is expressed in Fig. 2. As a side remark,\n\nPh\n\nPh\n∆\nq\n\nk\n\nk\n\np\n\np\nΦ\n\nP\n\nP\n\n2) ∝\nFig. 2. The left figure shows pictorially the tree level expression (H = 1 and U (lT\n2 )), the right figure (by F. Yuan) shows the all-order expression (with S = U ).\nδ(lT\n\nwe note that it is possible to get rid of the convolutions by weighted integration over the observed transverse momentum of the asymmetry. This\nrequires that the asymmetry is well-described for all values of the transverse momentum, which means that one has to connect the CS factorization expressions to the collinear factorization ones that are valid at large\ntransverse momenta. For the QT -weighted Collins asymmetry in SIDIS this\nworks, but for the Q2T -weighted cos 2φ asymmetry in e+ e− annihilation a\ndirect extraction of the Collins function is not possible in this way.13,24\nBeyond tree level the soft factor U dilutes the asymmetry, and increasingly so as Q2 increases. Differently stated, for the same functions f and D\nand weight w, the quantity F [w f D] is smaller beyond tree level. This effect\n\n\f6\n\nbecomes stronger as Q increases and is referred to as Sudakov suppression.\nConversely, if F [w f D] is obtained from experiment and if for instance f\nis extracted from it for given w and D, then f will be larger when using\nthe expression beyond tree level. In Ref.25 this was studied numerically and\na rule of thumb for the Q2 dependence of azimuthal asymmetries was put\nforward: asymmetries involving one kT -odd TMD, such as the Collins effect\n√\nasymmetry in SIDIS, approximately fall off as 1/ Q; asymmetries involving two kT -odd functions, such as the Collins effect asymmetry in e+ e−\nannihilation, approximately fall off as 1/Q. This behavior was obtained in\nthe investigated range of Q = 10 − 100 GeV and is to a very large extent independent of model assumptions, even though the magnitude of the\nasymmetries does depend heavily on them.\nThis Sudakov suppression implies that tree level extractions of the\nCollins function from the cos 2φ asymmetry at BELLE, leads to an underestimation of H1⊥ (since beyond tree level it will be larger). Hence, using\nthat underestimated function to extract transversity from SIDIS data at\na lower Q2 (less Sudakov suppression), leads to an overestimation of h1 .\nBased on the results of Refs.13,25 , this overestimation may be as large as\na factor of 2, although there are many uncertainties in this estimate and\nit does not take into account that in Ref.16 some Q2 dependence of H1⊥ is\nincluded through the scale dependence of D1 , as explained above.\nTo get clarity about the magnitude and about the reliability of the\nCollins effect extraction method, of course the best would be to do another\nindependent measurement of transversity. Ideally one wants this to be a\nnon-TMD, self-sufficient transversity measurement. These are the cleanest\ntransversity asymmetries that consist of a single observable that only involves collinear distributions and do not require experimental input from\nother experiments done at different scales and/or using different processes.\nBefore addressing this topic in detail, it may be worth recalling that\nthe scale dependence of h1 (x) itself is quite well-known, i.e. to next-toleading order.26–28 The evolution of h1 (x, Q2 ) is very different from that of\ng1 (x, Q2 ), in part, because there is no gluon transversity distribution. h1\ngrows with increasing Q2 towards smaller x, to eventually become proportional to δ(x), but with a proportionality constant that decreases to zero as\nQ2 → ∞, hence h1 (x, Q2 ) → 0. Therefore, also the tensor charge decreases\nwith Q2 , but it should be emphasized that it is only very mildly energy scale\ndependent. At the Planck scale the tensor charge is still only reduced by a\nfactor 2 w.r.t. Q2 = 1 GeV under next-to-leading order (NLO) evolution.\n\n\f7\n\n2. Transversity asymmetries\nThere is an obvious classification of transversity asymmetries into double\nand single transverse spin asymmetries, but from a theoretical point of\nview there is a more important distinction based on whether TMDs are involved or not. Cases where collinear factorization can be applied are much\nsafer than cases for which CS factorization is expected to apply. The latter\nusually require some as yet unknown nonperturbative input and one has\nto resort to model assumptions, for instance about the transverse momentum shape of the TMDs, as was done for the first transversity extraction in\nRef.16 . For the analysis it also matters whether one has to combine information from several observables, either obtained under the same experimental\nconditions or different ones. Below these aspects will be discussed for the\nexplicit routes to transversity.\n2.1. Double transverse spin asymmetries\nAlmost no experiment aiming to extract h1 will be self-sufficient. Most\ncleanly this requires experiments probing a single \"(h1 )2 \" observable. There\nare only two such processes:\n• p̄↑ p↑ → l l̄ X\n• p↑ p↑ → high-pT jet + X\nBoth processes were discussed by Artru and Mekhfi.2 But the first process was only recently considered in detail, because of plans to use the\nfuture FAIR facility at GSI for its measurement. The second process was\nextensively discussed by Jaffe and Saito29 , who concluded that it is likely\ntoo challenging to be done at RHIC, because it leads to a permille level\nasymmetry (a result confirmed by Vogelsang30).\nA somewhat less clean observable is p̄↑ p↑ → π X, which is ∝ (h1 )2 D1 ,\nconsidered by Mukherjee, Stratmann and Vogelsang.31 Also p̄↑ p or p̄ p↑\nDrell-Yan experiments are self-sufficient, but these involve TMDs and will\nbe discussed in the next subsection on TMD single spin asymmetries.\nFirst we look at double transverse spin asymmetries in p̄↑ p↑ collisions,\nin particular in Drell-Yan. It is ideally suited for h1 extraction, because\nq̄/p̄\nq/p\nh1 = h1 , leading to:\nσ(p̄↑ p↑ → l l̄ X) − σ(p̄↑ p↓ → l l̄ X) X 2 q\n∝\neq h1 (x1 ) hq1 (x2 ) (9)\nAT T =\nσ(p̄↑ p↑ → l l̄ X) + σ(p̄↑ p↓ → l l̄ X)\nq\nAs said, this can perhaps be done at GSI-FAIR. Some of the considered\n√\noptions32,33 are a collider mode at s = 14.5 GeV (the currently preferred\n\n\f8\n\nasymmetric collider option of 15 GeV antiprotons on 3.5 GeV protons) and\n√\na fixed target mode at s = 6.7 GeV (usually quoted as s = 45 GeV2 ).\nA chiral quark soliton model calculation34 of h1 indicates that large\nasymmetries of 40-50% can be expected in the fixed target mode at s = 45\nGeV2 . The asymmetry grows with increasing Q2 , but is generally smaller\n√\nfor the higher- s collider mode. Upper bounds on the asymmetry of approximately 17% at Q = 2 GeV to 38% at Q = 12 GeV for the collider\n√\nmode of s = 14.5 GeV have been obtained by Shimizu et al.35 The first\nextraction of h1 indicates that transversity is not much smaller than its\nupper bound, so asymmetries of order 10% at GSI kinematics should be\nexpected. A Monte Carlo study regarding the feasibility of measuring AT T\nat GSI-FAIR is promising.36,37 But in the end the success of double polarized Drell-Yan at GSI-FAIR depends predominantly on whether significant\npolarization of the antiproton beam can be achieved.\nFrom the study by Shimizu et al.35 of the upper bound on AT T it has\nalso become clear that perturbative corrections hardly affect the asymmetry. The transition from leading to next-to-leading order pQCD is small and\nalso resummation of large logs hardly has an effect. A similar robustness\ncan be observed for a closely related asymmetry investigated in Ref.38 , the\nunintegrated asymmetry AT T (QT ), which depends on the transverse momentum QT of the lepton pair w.r.t. the beam axis. Although resummation\nis essential for this observable, which is described within the CSS formalism39 that derives from the CS formalism discussed before, resummation\nbeyond the leading-logarithmic approximation (LL) has little effect on the\nasymmetry. As explained in Ref.38 this is particular to p̄ p scattering in the\nvalence region.\nIn Ref.38 the upper bound of the asymmetry AT T (QT ) for GSI kinematics was shown to be of similar magnitude as the integrated asymmetry\nAT T (which is obtained from AT T (QT ) by integrating its numerator and\ndenominator separately). Remarkably, AT T (QT ) is very flat as a function\nof QT and remains flat under Q2 evolution.\nThe asymmetry AT T (QT ) for p p scattering,40 which is considerably\n√\n√\nsmaller for RHIC ( s = 200 GeV) than J-PARC ( s = 10 GeV) kinematics, shows a very different behavior compared to p̄ p scattering for potential\nGSI kinematics. The asymmetry is flat at LL level, but not at next-toleading log. Resummation beyond LL clearly matters in p p collisions.\nIn conclusion, the double transverse spin asymmetries in p̄↑ p↑ DrellYan offer clean, direct and unique probes of transversity and in the valence\nregion they are very robust under perturbative corrections.\n\n\f9\n0\n\nAs mentioned, one could also consider AπT T in p̄↑ p↑ → π 0 X, which is a\nslightly less clean observable as it requires input on the pion fragmentation\nfunction, which however is quite well-known. Upper bounds for assumed\nbeam polarizations of 30% for p̄ and 50% for p yield asymmetries of a few\npercent.31 The difference between LO and NLO is a bit larger in this case.\n2.2. TMD single spin asymmetries\nWhat if one only has one polarized beam? This question is relevant for GSI\nif the antiproton beam cannot be polarized significantly. For one polarized\nbeam there is a self-sufficient measurement of transversity which involves\nTMDs, namely the single spin asymmetry in p̄↑ p → l l̄ X or p̄ p↑ → l l̄ X.\nBoth options are equally useful, there is no difference theoretically.\nIn the case of one transversely polarized hadron beam, there is a possible\nspin angle φS dependence of the differential cross section:\nhν\ni\ndσ\n∝ 1 + λ cos2 θ + sin2 θ\ncos 2φ − ρ |S T | sin(φ + φS ) + . . .\ndΩ dφS\n2\nIn a measurement of ρ (from p↑ − p↓ ) also ν can be extracted from the same\ndata (from p↑ + p↓ ), i.e. under exactly the same experimental conditions.\nThis is in contrast to the previously discussed Collins effect asymmetries.\nAt tree level one has\n⊥\nν ∝ h⊥\n1 h1\n\nρ ∝ h1 h⊥\n1\n\nanalogue of cos 2φ asymmetry in e+ e−\nanalogue of Collins asymmetry in SIDIS\n\nThese two expressions involve the TMD distribution function41 h⊥\n1 , which\nin some respects is very similar to the Collins effect fragmentation function,\nbut can be quite different from it. It is depicted in Fig. 3.\n\nq\n\nq\n⊥\n\nh1\n\n= P\n\nkT\n\n−\n\nP\n\nsT\nkT\n\nFig. 3. Nonzero h⊥\n1 means that the transverse polarization ST of quarks (with momentum q ≈ xP + kT ) inside an unpolarized hadron (with momentum P ) is nonzero. It is a\nkT -odd and chiral-odd TMD.\n\nThe asymmetry ν has been measured in π − N → μ+ μ− X by the NA10\nCollaboration42,43 at CERN and the E615 Collaboration44 at Fermilab,\n\n\f10\n\nroughly 20 years ago. The data show an anomalously large asymmetry,\nwhich differs much from the perturbative QCD O(αs ) Lam-Tung relation\nν = (1 − λ)/2 and the O(α2s ) corrections to it.45,46 Nonzero h⊥\n1 offers an\nexplanation for this discrepancy.47 Assuming u-quark dominance, Gaussian\n48\nkT -dependence for h⊥\n1 and x-dependence ∝ f1 (x), ρ can be related to ν:\nr\nν hu1\n1\n(10)\nρ=\n2 νmax f1u\nThe result is displayed in Fig. 4.\n0.5\n\nν\n0.4\n0.3\n\nρ for h1=f1/3\n\n0.2\n0.1\n00\n\n2\n\n4\n\n6\n\n8\n\n10\n\n12\n\nQT [GeV]\n\nFig. 4. Analyzing power ν of cos 2φ asymmetry as fitted to NA10 data using a model\nAnsatz47,48 for h⊥\n1 and the resulting prediction of the single spin asymmetry ρ using Eq.\n(10) for the case h1 = f1 /3.\n\nThe asymmetry ν for p p (e.g. at RHIC, where also ρ can be measured)\nis expected to be smaller than for π p, due to absence of valence antiquarks.\nPreliminary p p data from Fermilab were shown at this workshop49 and\nconfirm this expectation. Earlier p d data50 also show a small asymmetry,\nprobably for the same reason.\nThe asymmetry ν for p̄ p on the other hand is expected to be very similar to π p, due to the presence of valence antiquarks. Therefore, unpolarized\np̄ p Drell-Yan at GSI-FAIR will likely show a large anomalous cos 2φ asymmetry, providing crucial information about its origin. As explained above,\nthe measurement of ν and ρ at GSI-FAIR with only one polarized beam\n(either p̄↑ or p↑ ) offers a probe of transversity. In this case predominantly\n⊥u/p\nu/p\nh1\nand h1 are accessed, due to the charge-squared factor in Eq. (9).\nThe COMPASS experiment plans to do π ± p↑ Drell-Yan51 , which although not self-sufficient would provide valuable information on the flavor\n+ ↑\ndependence of h1 and h⊥\n1 . Especially π p is of interest, as there is no\n\n\f11\n\ndata available on it yet and it provides information on the d-quark ratio\n⊥d/p\nd/p\nh1\n/h1 , without suppression by a charge-squared factor. The ratio ν/ρ\nfor π ± p↑ Drell-Yan in valence approximation namely provides the ratios\nd/p\n⊥d/p\nu/p\n⊥u/p\n/h1 for π − and π + , respectively. Using the input\n/h1 and h1\nh1\n⊥\non h1 from for example unpolarized p p̄ Drell-Yan (either from the Tevatron or from GSI-FAIR) would allow for an extraction of h1 from π ± p↑\nDrell-Yan at COMPASS.\nThe function h⊥\n1 may be extracted from ν at the Tevatron, but the high\n√\ns leads to high Q2 on average. This can result in considerable Sudakov\nsuppression, which would be disadvantageous but interesting to verify. One\nmay also probe h⊥\n1 via a cos 2φ asymmetry in photon-jet production p p̄ →\nγ jet X at the Tevatron,56\ndσ h1 h2 →γ jet X\n∝ (1 + νDY R cos 2(φ⊥ − φγ ))\ndηγ dηj d2 K γ⊥ d2 q ⊥\n\n(11)\n\nwhere φ⊥ is the angle of the transverse momentum q ⊥ of the photon-jet\nsystem and φγ is the angle of the transverse momentum K γ⊥ of the photon.\nThe analyzing power consists of a proportionality factor R times νDY , the\ncos 2φ asymmetry of Drell-Yan probed at the scale |K γ⊥ | which in general\nis different from Q, which might make a difference from the perspective of\nSudakov suppression. The proportionality factor R is only a function of f1 .\nFor typical Tevatron kinematics in the central region, recently investigated\nfor the angular integrated case by the DØ Collaboration57 , νDY R was estimated56 to be ∼ 5 − 15%. That could be large enough to allow transversity\nrelated TMD studies at the Tevatron too.\nAnother \"helper\" process is the cos 2φ asymmetry ν in unpolarized\n⊥\nSIDIS e p → e′ π X, which would be proportional to h⊥\n1 H1 . Given the\n⊥\nCollins function it could in principle be used to extract h1 too. The asymmetry in SIDIS turns out to be of quite different size compared to DrellYan. It has been investigated using model calculations in e.g. Refs.52–54 .\nThe asymmetries as a function of observed transverse momentum of the\npion are typically on the percent level and are very similar in size for HERMES kinematics and JLab kinematics (the 12 GeV upgrade). Interestingly,\nthe π − asymmetries are positive and according to Ref.52 roughly four times\nas large as the π + asymmetries which is of opposite sign. This factor of four\nis not related to the charge-squared factor ratio of u and d quarks.\nThe available data on the cos 2φ asymmetry in unpolarized SIDIS are\nfrom EMC and COMPASS; the latter were presented at this workshop for\nthe first time55 (soon also HERMES data should become available). The\ndata show that νSIDIS ≪ νDY . The SIDIS data are obtained for not too\n\n\f12\n\nlarge values of Q2 , where also higher twist contributions, such as the Cahn\neffect, can be relevant. The recent model calculation of Ref.54 for instance\nshows this very clearly. This limits the usefulness of this observable for\ntransversity related investigations. Nevertheless, it is interesting to study\nthe importance of higher twist effects at HERMES and COMPASS energies\nthrough this observable.\nIt should be added that there is also high Q2 data on the unpolarized\nazimuthal asymmetries in SIDIS from ZEUS (hQ2 i = 750 GeV2 ). Within\nthe sizeable errors the ZEUS data are consistent with pQCD expectations,\nbut they have been presented with a lower cut-off on the transverse momentum of the final state hadron, cutting out contributions of interest here.\n⊥\nApart from that, high Q2 is not favorable to probe the h⊥\n1 H1 contribution\ndue to the Sudakov suppression discussed earlier.\n2.3. Non-TMD single spin asymmetries\nIf one only has one transversely polarized proton beam, then there are two\nfurther possibilities to probe h1 which do not involve TMDs, i.e. to use:\n• transverse Λ polarization\n• two hadron systems within a jet\nBoth options are not self-sufficient, at least not in a straightforward way;\nthey involve unknown fragmentation functions, which most cleanly can be\nobtained from e+ e− data. The big advantage is though that collinear factorization applies, therefore, one only deals with non-TMD functions.\nTransverse Λ polarization enters with the transversity fragmentation\nfunction H1 (z). It is still unknown, but can be measured in e+ e− →\nΛ↑ Λ↑ X: ∝ (H1 )2 .58 Subsequently, h1 can be accessed via the spin transfer\nasymmetry DN N ∝ h1 H1 in either e p↑ → e′ Λ↑ X or p p↑ → Λ↑ X. The\nlatter has been measured by the E704 Collaboration59, yielding a DN N of\norder 20-30% at a transverse momentum pT of the Λ of around 1 GeV/c\n√\n( s ≈ 20 GeV). However, because of the low pT , this result can probably\nnot be used to extract h1 in a trustworthy manner. This should be different\n√\nat RHIC. Upper bounds for DN N calculated60 for RHIC at s = 500 GeV\nshow promisingly large asymmetries at much larger pT .\nThe other option is to use the Interference Fragmentation Function H1<) ,\nor more generally, chiral-odd two-hadron fragmentation functions. Consider\nfor definiteness the final state |(π + π − )Xi, i.e. a π + π − pair inside a jet. The\ncorresponding fragmentation correlation function ∆(z) of this final state\n\n\f13\n\ncan be parameterized as\n\u0014\n\u0015\n6 TP\n6\n<) R\n∆(z) ∝ D1P\n6 + iH1\n,\n2Mπ\n\n(12)\n\nwhere the two-hadron fragmentation functions D1 and H1<) depend on\nthe sum z of the momentum fractions z ± of the π ± and on the invariant mass of the two-pion system (not necessarily in a factorized way as\nassumed in Ref.61 ). The momenta appearing are P = Pπ+ + Pπ− and\nRT = (z + Pπ− − z − Pπ+ )/z. The kT of the pion pair w.r.t. the fragmentating quark is integrated over. See Ref.62 for details.\nNonzero H1<) can arise due to interference between different partial waves\nof the (π + π − ) system and leads to single spin asymmetries sin(φeST + φeRT )\nin61,63,64\ne p↑ → e′ (π + π − ) X\np p↑ → (π + π − ) X\n\n∝ h1 ⊗ H1<)\n\n∝ f1 ⊗ h1 ⊗ H1<)\n\nHERMES SIDIS data65 below and above the ρ mass show a nonzero single spin asymmetry (with the same sign), which is another indication that\ntransversity is nonzero. From the comparison66 of the data to various model\npredictions for HERMES kinematics using different h1 functions, we conclude that the two-hadron asymmetry data are compatible with h1 ≈ f1 /3,\nalbeit with considerable room for other values too. COMPASS data could\nnarrow this range down.\nAs said, both options discussed here have the advantage that one is dealing with collinear factorization. This means no Sudakov suppression and no\nprocess dependence. The latter topic will not be addressed here, but is intimately connected with the gauge invariant definition of TMDs, cf. e.g.\nRef.67 . Another advantage is that the evolution equations for H1 (z) and\nH1<) (z) are known to next-to-leading order68,69 , they are in fact the same.\nTherefore, from a theoretical point of view exploiting the transversely polarized Λ or two-hadron fragmentation functions currently offers the safest\nand most straightforward way to extract transversity.\nLike H1 , H1<) can most cleanly be extracted from electron-positron annihilation, in this case from e+ e− → (π + π − )jet 1 (π + π − )jet 2 X via a\ncos(φeR1T + φeR2T ) asymmetry70 ∝ (H1<) )2 . Since pions are easier to measure than polarized Λ's, this is probably the easiest route to transversity at\nthis moment. BELLE can once again play a crucial role here (as BABAR\ncould). Its data would allow for a non-TMD extraction of transversity in the\nnot too far future. Therefore, all eyes are on BELLE again in this respect.\n\n\f14\n\n3. Routes to transversity\nIn the previous section several different routes to transversity were discussed. They can be classified into four types, which are summarized in\nTable 1 for the processes discussed before. On the one hand, there are the\noptions that use collinear (non-TMD) functions, which are safer from a theoretical point of view. Some of these options are self-sufficient, but others\nrequire additional input, which most cleanly comes from e+ e− collisions.\nOn the other hand, there are the TMD options, which are theoretically\nchallenging and it is somewhat ironic to note that what is theoretically the\nmost challenging option, i.e. exploiting the Collins effect, is the one that\nhas been done first experimentally.\nTable 1.\n\nSummary of routes to transversity\n\nself-sufficient\n\nusing external input\n\nnon-TMD\n\nTMD\n\np̄↑ p↑ → l l̄ X\n\np p̄↑ → l l̄ X\n\np↑\n\np̄ p↑ → l l̄ X\n\np↑\n\n→ (high-pT jet) X\n\ne p ↑ → e ′ Λ↑ X\n\ne p ↑ → e′ π X\n\np p↑\n\nπ p↑ → l l̄ X\n\n→\n\nΛ↑\n\nX\n\ne p↑ → e′ (π + π − ) X\np p↑ → (π + π − ) X\n\nSeveral remarks have to be added in relation to this table. As pointed\nout by Bacchetta and Radici71 H1<) can also be extracted from p p →\n(π + π − ) (π + π − ) X. Similarly, H1 could be extracted from p p → Λ↑ Λ̄↑ X.\nThis makes p p↑ experiments in principle self-sufficient too. But clearly this\nwould be less clean and more involved than using e+ e− extractions of H1<)\nand H1 , due to the appearance of additional distribution and fragmentation functions, and contributions from multiple partonic subprocesses. Here,\ndifferent subprocesses can enter in numerator and denominator of the asymmetries, because of which the observables in p p are likely to be considerably\nsmaller than in e+ e− annihilation. Nevertheless, it is important to keep in\nmind that one can make the experiments that require a separate extraction\nof an unknown fragmentation function, self-sufficient by considering more\ncomplicated p p or e p processes. This may not apply to the Collins function\nhowever. It is currently not clear whether p p → π π X, where the two pions are in separate jets, can be used to safely extract the Collins function.\nConcerns regarding factorization have been raised in e.g. Refs.72,73 .\n\n\f15\n\nNote that the process p p↑ → π X is absent from the table. This is because the single spin asymmetry AN is described by a twist-three expression\nthat consists of several contributions, not all proportional to transversity.\nTherefore, it is not clear how to safely extract it from this observable.\nInstead, p p↑ → γ π X or p p↑ → π jet X (cf. also Ref.74,75 ) could be used,\nalthough also here factorization is yet to be established (which is the reason\nfor not including them in the table).\nFinally, it is worth adding that there is a special role for Drell-Yan at\nRHIC: p↑ p↑ → l l̄ X. It offers a clean way to learn about transversity of\nantiquarks hq̄1 . Its contribution to the tensor charge is important to know. It\nwould not be satisfactory to always have to assume that antiquark transversity is small, without knowing how small. Therefore, AT T at RHIC is still\nworth measuring.\n3.1. Transversity GPD\nNow we turn to a completely independent way of accessing transversity\nthat falls outside the framework of collinear functions and TMDs discussed\nthus far.\nThere are four chiral-odd Generalized Parton Distributions (GPDs),76\nwhich includes the transversity GPD77 HT (x, ξ, t). In the forward limit:\nHT (x, 0, 0) = h1 (x), which offers an alternative way to access transversity\nand the tensor charge. Of course, the latter requires not only the extrapolation to the forward limit, but also integration over all x values. This will\nbe quite challenging, but it may be worth pursuing this route too because\nit can be measured, for instance at JLab or a future electron-ion collider,\nwithout the need to polarize the proton.\nSuggestions to probe HT in exclusive electroproduction have been put\nforward, for instance, via the production of two vector mesons in particular\n80,81\npolarization states78,79 , γ ∗ p → ρ0L ρ+\nT n. Very recently it was suggested\n∗\n0 ′\nthat transversity could be measured via γ p → π p . In both cases the idea\nis that the spin states of the photon and the meson(s) enforce a helicity flip\nof the quarks inside the proton. In this way there is no need to polarize the\nproton. Helicity conservation requires the helicity flip on the proton side.\nThis is similar to how the axial charge can be measured in unpolarized\nelastic ep or νp scattering.\nIt should be mentioned that in case of single vector meson production,\ne.g. γ ∗ p → ρT p′ , problems regarding factorization arise. Unfortunately this\nprocess cannot be used to extract transversity.82,83\nSome information on chiral-odd GPDs has already been obtained from\n\n\f16\n\nlattice QCD.84 Besides yielding results for the tensor charge, they also show\nthere to be nonzero transverse polarization of quarks inside unpolarized\nhadrons, hinting at nonzero h⊥\n1.\n4. Conclusions\nAlthough transversity is a very difficult quantity to measure, several\ntransversity asymmetries have come within reach of present day and nearfuture experiments. Thanks to SIDIS data by HERMES and COMPASS,\nand e+ e− annihilation data by BELLE the first extraction of transversity,\nexploiting the Collins effect, has been possible. This is an important step\nforward. The Collins effect asymmetries involve kT -dependent functions,\nTMDs, and are consequently more difficult to analyze theoretically. Therefore, an independent, preferably non-TMD extraction of transversity is desired. For this, p̄↑ p↑ Drell-Yan would be the ideal process, but two hadron\nfragmentation functions currently offer the most straightforward way. Many\nmore observables could contribute to our knowledge of transversity, the\ntensor charge, and other chiral-odd quantities, such as h⊥\n1 . Unpolarized\nDrell-Yan data and lattice QCD results strongly suggest that the transverse polarization of quarks inside unpolarized hadrons, which is encoded\n↑\n↑\nby h⊥\n1 , is nonzero and large. If so, then especially p̄ p or p̄ p Drell-Yan offers another promising opportunity to probe transversity. Perhaps this will\nbe possible at GSI-FAIR. It is a self-sufficient way of measuring transversity, in the sense that no information from other experiments or even other\nprocesses needs to be included in the analysis. Other, more demanding selfsufficient or nearly self-sufficient options that do not involve TMDs exist\ntoo. Amazingly most of these possibilities are in principle possible with\nexisting accelerators. Further transversity measurements are therefore expected in the coming years, contributing valuably to our understanding of\nhadron spin.\nAcknowledgments\nI wish to thank the organizers for their kind invitation to give the opening\ntalk at this exciting workshop, where so many new results were presented.\nI thank Markus Diehl for a useful discussion on vector meson production\nand Marco Contalbrigo for some feedback on the text.\nReferences\n1. J. P. Ralston, D. E. Soper, Nucl. Phys. B 152, 109 (1979).\n\n\f17\n\n2.\n3.\n4.\n5.\n6.\n7.\n8.\n9.\n10.\n11.\n12.\n13.\n14.\n15.\n16.\n17.\n18.\n19.\n20.\n21.\n22.\n23.\n24.\n25.\n26.\n27.\n28.\n29.\n30.\n31.\n32.\n33.\n34.\n35.\n36.\n37.\n38.\n39.\n40.\n41.\n42.\n43.\n44.\n45.\n\nX. Artru, M. Mekhfi, Z. Phys. C 45, 669 (1990).\nR. L. Jaffe, X. Ji, Nucl. Phys. B 375, 527 (1992).\nJ. L. Cortes, B. Pire, J. P. Ralston, Z. Phys. C 55, 409 (1992).\nO. Martin et al., Phys. Rev. D 60, 117502 (1999).\nJ. C. Collins, Nucl. Phys. B 396, 161 (1993).\nA. Airapetian et al. [HERMES Coll.], Phys. Rev. Lett. 94, 012002 (2005).\nM. Diefenthaler [HERMES Coll.], arXiv:0706.2242 [hep-ex].\nV. Y. Alexakhin et al. [COMPASS Coll.], Phys. Rev. Lett. 94, 202002 (2005).\nE. S. Ageev et al. [COMPASS Coll.], Nucl. Phys. B 765, 31 (2007).\nS. Levorato [COMPASS Coll.], these proceedings.\nD. Boer, R. Jakob, P. J. Mulders, Nucl. Phys. B 504, 345 (1997).\nD. Boer, Nucl. Phys. B (2008) in press, arXiv:0804.2408 [hep-ph].\nR. Seidl et al. [BELLE Coll.], Phys. Rev. Lett. 96, 232002 (2006).\nR. Seidl et al. [BELLE Coll.], arXiv:0805.2975 [hep-ex].\nM. Anselmino et al., Phys. Rev. D 75, 054032 (2007).\nM. Wakamatsu, Phys. Lett. B 653, 398 (2007).\nM. Göckeler, Ph. Hägler et al. [QCDSF Coll.], Phys. Lett. B 627, 113 (2005).\nJ. Soffer, Phys. Rev. Lett. 74, 1292 (1995).\nA. Prokudin, these proceedings.\nJ. C. Collins, D. E. Soper, Nucl. Phys. B 193, 381 (1981).\nX. Ji, J.-P. Ma, F. Yuan, Phys. Rev. D 71, 034005 (2005).\nX. Ji, J.-P. Ma, F. Yuan, Phys. Lett. B 597, 299 (2004).\nA. Bacchetta, D. Boer, M. Diehl, P. J. Mulders, JHEP 0808, 023 (2008).\nD. Boer, Nucl. Phys. B 603, 195 (2001).\nS. Kumano, M. Miyama, Phys. Rev. D 56, 2504 (1997).\nW. Vogelsang, Phys. Rev. D 57, 1886 (1998).\nA. Hayashigaki, Y. Kanazawa, Y. Koike, Phys. Rev. D 56, 7350 (1997).\nR. L. Jaffe, N. Saito, Phys. Lett. B 382, 165 (1996).\nW. Vogelsang, talk presented at the RBRC Workshop on \"Future Transversity Measurements\" held at BNL, September 18-20, 2000.\nA. Mukherjee, M. Stratmann, W. Vogelsang, Phys. Rev. D 72, 034011\n(2005).\nF. Rathmann, P. Lenisa, arXiv:hep-ex/0412078.\nM. Nekipelov, these proceedings.\nA. V. Efremov, K. Goeke, P. Schweitzer, Eur. Phys. J. C 35, 207 (2004).\nH. Shimizu et al., Phys. Rev. D 71, 114007 (2005).\nA. Bianconi, M. Radici, Phys. Rev. D 71, 074014 (2005).\nA. Bianconi, M. Radici, Phys. Rev. D 72, 074013 (2005).\nH. Kawamura, J. Kodaira, K. Tanaka, Phys. Lett. B 662, 139 (2008).\nJ. C. Collins, D. E. Soper and G. Sterman, Nucl. Phys. B 250, 199 (1985).\nH. Kawamura, J. Kodaira, K. Tanaka, Nucl. Phys. B 777, 203 (2007).\nD. Boer, P. J. Mulders, Phys. Rev. D 57, 5780 (1998).\nS. Falciano et al. [NA10 Coll.], Z. Phys. C 31, 513 (1986).\nM. Guanziroli et al. [NA10 Coll.], Z. Phys. C 37, 545 (1988).\nJ. S. Conway et al., Phys. Rev. D 39, 92 (1989).\nA. Brandenburg, O. Nachtmann, E. Mirkes, Z. Phys. C 60, 697 (1993).\n\n\f18\n\n46.\n47.\n48.\n49.\n50.\n51.\n52.\n53.\n54.\n55.\n56.\n57.\n58.\n59.\n60.\n61.\n62.\n63.\n64.\n65.\n66.\n67.\n68.\n69.\n70.\n71.\n72.\n73.\n74.\n75.\n76.\n77.\n78.\n79.\n80.\n81.\n82.\n83.\n84.\n\nE. Mirkes, J. Ohnemus, Phys. Rev. D 51, 4891 (1995).\nD. Boer, Phys. Rev. D 60, 014012 (1999).\nD. Boer, Nucl. Phys. B Proc. Suppl. 79, 638 (1999).\nJ.C. Peng [FNAL-E866/NuSea Coll.], these proceedings.\nL. Y. Zhu et al. [FNAL-E866/NuSea Coll.], Phys. Rev. Lett. 99, 082301\n(2007).\nM. Colantoni [COMPASS Coll.], these proceedings.\nL. P. Gamberg, G. R. Goldstein, M. Schlegel, Phys. Rev. D 77, 094016\n(2008).\nV. Barone, Z. Lu, B. Q. Ma, Phys. Lett. B 632, 277 (2006).\nV. Barone, A. Prokudin, B. Q. Ma, arXiv:0804.3024 [hep-ph].\nW. Kafer [COMPASS Coll.], these proceedings.\nD. Boer, P. J. Mulders, C. Pisano, Phys. Lett. B 660, 360 (2008).\nV. M. Abazov et al. [DØ Coll.], arXiv:0804.1107 [hep-ex].\nA. P. Contogouris et al., Phys. Lett. B 344, 370 (1995).\nA. Bravar et al. [E704 Coll.], Phys. Rev. Lett. 78, 4003 (1997).\nD. de Florian et al., Phys. Lett. B 439, 176 (1998).\nR. L. Jaffe, X. Jin, J. Tang, Phys. Rev. Lett. 80, 1166 (1998).\nA. Bianconi, S. Boffi, R. Jakob, M. Radici, Phys. Rev. D 62, 034008 (2000).\nX. Ji, Phys. Rev. D 49, 114 (1994).\nJ. C. Collins, S. F. Heppelmann, G. A. Ladinsky, Nucl. Phys. B 420, 565\n(1994).\nA. Airapetian et al. [HERMES Coll.], JHEP 0806, 017 (2008).\nA. Bacchetta, M. Radici, Phys. Rev. D 74, 114007 (2006).\nC. J. Bomhof, P. J. Mulders, Nucl. Phys. B 795, 409 (2008).\nM. Stratmann, W. Vogelsang, Phys. Rev. D 65, 057502 (2002).\nF. A. Ceccopieri, M. Radici, A. Bacchetta, Phys. Lett. B 650, 81 (2007).\nX. Artru, J. C. Collins, Z. Phys. C 69, 277 (1996).\nA. Bacchetta, M. Radici, Phys. Rev. D 70, 094032 (2004).\nJ. Collins, J. W. Qiu, Phys. Rev. D 75, 114014 (2007).\nJ. Collins, arXiv:0708.4410 [hep-ph].\nF. Yuan, Phys. Rev. D 77, 074019 (2008).\nF. Yuan, Phys. Lett. B 666, 44 (2008).\nM. Diehl, Eur. Phys. J. C 19, 485 (2001).\nP. Hoodbhoy, X. Ji, Phys. Rev. D 58, 054006 (1998).\nD. Y. Ivanov et al., Phys. Lett. B 550, 65 (2002).\nR. Enberg, B. Pire, L. Szymanowski, Eur. Phys. J. C 47, 87 (2006).\nS. Ahmad, G. R. Goldstein, S. Liuti, arXiv:0805.3568 [hep-ph].\nG. R. Goldstein, these proceedings.\nM. Diehl, T. Gousset, B. Pire, Phys. Rev. D 59, 034023 (1999).\nJ. C. Collins, M. Diehl, Phys. Rev. D 61, 114015 (2000).\nM. Göckeler et al. [QCDSF Coll.], Phys. Rev. Lett. 98, 222001 (2007).\n\n\f"}