{"id": "http://arxiv.org/abs/0909.3835v5", "guidislink": true, "updated": "2011-03-31T13:38:54Z", "updated_parsed": [2011, 3, 31, 13, 38, 54, 3, 90, 0], "published": "2009-09-21T19:10:59Z", "published_parsed": [2009, 9, 21, 19, 10, 59, 0, 264, 0], "title": "Charged Kaluza-Klein double-black holes in five dimensions", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0909.5292%2C0909.4276%2C0909.4127%2C0909.3368%2C0909.1943%2C0909.0575%2C0909.2647%2C0909.2429%2C0909.3610%2C0909.3901%2C0909.3140%2C0909.3899%2C0909.0932%2C0909.0893%2C0909.3247%2C0909.4114%2C0909.0136%2C0909.1055%2C0909.4561%2C0909.4290%2C0909.3258%2C0909.2435%2C0909.2488%2C0909.1341%2C0909.3299%2C0909.0092%2C0909.4267%2C0909.2121%2C0909.5658%2C0909.5442%2C0909.0808%2C0909.5211%2C0909.2628%2C0909.2116%2C0909.0787%2C0909.0377%2C0909.4402%2C0909.5668%2C0909.0859%2C0909.1459%2C0909.2874%2C0909.4580%2C0909.3808%2C0909.4920%2C0909.1716%2C0909.2369%2C0909.2305%2C0909.0693%2C0909.2702%2C0909.0462%2C0909.0437%2C0909.0261%2C0909.1848%2C0909.3727%2C0909.0126%2C0909.1820%2C0909.1273%2C0909.1620%2C0909.3661%2C0909.2222%2C0909.3249%2C0909.0323%2C0909.0422%2C0909.5588%2C0909.3914%2C0909.1642%2C0909.0568%2C0909.3298%2C0909.3635%2C0909.3707%2C0909.2227%2C0909.2906%2C0909.0961%2C0909.3835%2C0909.4334%2C0909.5473%2C0909.0231%2C0909.4383%2C0909.3616%2C0909.5420%2C0909.2729%2C0909.5213%2C0909.5511%2C0909.3091%2C0909.5360%2C0909.5167%2C0909.3482%2C0909.3681%2C0909.0646%2C0909.2192%2C0909.2418%2C0909.3050%2C0909.1879%2C0909.2273%2C0909.2441%2C0909.2201%2C0909.1708%2C0909.2759%2C0909.4501%2C0909.1508%2C0909.2126&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Charged Kaluza-Klein double-black holes in five dimensions"}, "summary": "Using a solution generating technique based on the symmetries of the\ndimensionally reduced Lagrangian we derive an exact solution of the\nEinstein-Maxwell-Dilaton field equations in five dimensions describing a system\nof two general non-extremally charged static Kaluza-Klein black holes with\nspherical horizons. We investigate some of its thermodynamic properties and we\nalso show how to recover various known solutions in particular cases.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0909.5292%2C0909.4276%2C0909.4127%2C0909.3368%2C0909.1943%2C0909.0575%2C0909.2647%2C0909.2429%2C0909.3610%2C0909.3901%2C0909.3140%2C0909.3899%2C0909.0932%2C0909.0893%2C0909.3247%2C0909.4114%2C0909.0136%2C0909.1055%2C0909.4561%2C0909.4290%2C0909.3258%2C0909.2435%2C0909.2488%2C0909.1341%2C0909.3299%2C0909.0092%2C0909.4267%2C0909.2121%2C0909.5658%2C0909.5442%2C0909.0808%2C0909.5211%2C0909.2628%2C0909.2116%2C0909.0787%2C0909.0377%2C0909.4402%2C0909.5668%2C0909.0859%2C0909.1459%2C0909.2874%2C0909.4580%2C0909.3808%2C0909.4920%2C0909.1716%2C0909.2369%2C0909.2305%2C0909.0693%2C0909.2702%2C0909.0462%2C0909.0437%2C0909.0261%2C0909.1848%2C0909.3727%2C0909.0126%2C0909.1820%2C0909.1273%2C0909.1620%2C0909.3661%2C0909.2222%2C0909.3249%2C0909.0323%2C0909.0422%2C0909.5588%2C0909.3914%2C0909.1642%2C0909.0568%2C0909.3298%2C0909.3635%2C0909.3707%2C0909.2227%2C0909.2906%2C0909.0961%2C0909.3835%2C0909.4334%2C0909.5473%2C0909.0231%2C0909.4383%2C0909.3616%2C0909.5420%2C0909.2729%2C0909.5213%2C0909.5511%2C0909.3091%2C0909.5360%2C0909.5167%2C0909.3482%2C0909.3681%2C0909.0646%2C0909.2192%2C0909.2418%2C0909.3050%2C0909.1879%2C0909.2273%2C0909.2441%2C0909.2201%2C0909.1708%2C0909.2759%2C0909.4501%2C0909.1508%2C0909.2126&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Using a solution generating technique based on the symmetries of the\ndimensionally reduced Lagrangian we derive an exact solution of the\nEinstein-Maxwell-Dilaton field equations in five dimensions describing a system\nof two general non-extremally charged static Kaluza-Klein black holes with\nspherical horizons. We investigate some of its thermodynamic properties and we\nalso show how to recover various known solutions in particular cases."}, "authors": ["Cristian Stelea", "Kristin Schleich", "Donald Witt"], "author_detail": {"name": "Donald Witt"}, "author": "Donald Witt", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1103/PhysRevD.83.084037", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/0909.3835v5", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0909.3835v5", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "21 pages, v.5 added references; v.4 changed title of the article;\n  improved the discussion in section 3.2; corrected typos", "arxiv_primary_category": {"term": "hep-th", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "hep-th", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "gr-qc", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0909.3835v5", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0909.3835v5", "journal_reference": "Phys.Rev.D83:084037,2011", "doi": "10.1103/PhysRevD.83.084037", "fulltext": "arXiv:0909.3835v5 [hep-th] 31 Mar 2011\n\nCharged Kaluza-Klein double-black holes in five\ndimensions\n\nCristian Stelea, Kristin Schleich, and Donald Witt\nDepartment of Physics and Astronomy, University of British Columbia\n6224 Agricultural Road, Vancouver, BC V6T 1Z1, Canada\n\nAbstract\nUsing a solution generating technique based on the symmetries of the dimensionally reduced Lagrangian we derive an exact solution of the Einstein-Maxwell-Dilaton\nfield equations in five dimensions describing a system of two general non-extremally\ncharged static Kaluza-Klein black holes with spherical horizons. We investigate some\nof its thermodynamic properties and we also show how to recover various known solutions in particular cases.\nPACS: 04.20.-q, 04.20.Jb, 04.50.+h\n\n\f1\n\nIntroduction\n\nExact solutions of Einstein field equations (with or without matter fields) played a key role\nin the development and the current understanding of gravitational physics in four and higher\ndimensions. Due to their nonlinearity, Einstein equations cannot be solved in every situation\nof physical interest and one often has to recourse to simplifying assumptions and make use\nof various symmetries in order to obtain new exact solutions in a systematic way. Some of\nthe most powerful solution generation techniques in General Relativity have been devised\nfor space-time geometries that belong to the so-called generalized Weyl class, as described in\n[1, 2]. In D-dimensions, solutions in this class assume the existence of D − 2 abelian Killing\nvectors. Performing a dimensional reduction on a (D − 3)-torus and further dualization of\nthe various vector fields to scalars leads to three-dimensional Euclidian gravity coupled to a\nset of scalar fields. It turns out that, in most cases of interest (as in dimensional reductions\nof higher-dimensional supergravities), these scalar fields form non-linear sigma-models with\ncoset spaces G/H as the target model [3]. Here G is some semi-simple group, H a subgroup\nof G and the field equations posses then the 'hidden symmetry group' G, which can be used\nin various solution generating techniques.\nOne caveat of this method is that, in order to obtain asymptotically flat black hole\nsolutions, one has to restrict the space-time dimension to D ≤ 5 since general black holes\nin D > 5 dimensions do not admit (D − 2)-commuting Killing vectors [7]. While the\nfour dimensional case has been extensively studied (see for instance [4]), since the recent\ndiscovery of black rings [5, 6] there is renewed interest in studying gravity in five and higher\ndimensions. The black ring was the first explicit example of an asymptotically flat black\nobject with non-spherical event horizon. Heuristically, one obtains such a black ring by\ntaking a black string in five dimensions, bending it and connecting its ends to form a circle.\nA static black ring configuration would normally collapse to form a black hole with spherical\nhorizon topology; indeed, this is the case in four dimensional asymptotically flat space-times\nas a consequence of topological censorship [8, 9]. However, in five or more dimensions,\nthe spherical topology of infinity does not constrain that of the black hole horizon [10];\ngeometric considerations, however, restrict the topology to those, such as S 3 and S 2 × S 1 ,\nthat admit non-negative scalar curvature [11]. The original black ring system was stabilized\nby the centrifugal effects of its rotation. Since the black ring discovery, many solution\ngenerating techniques were developed to re-derive and further generalize this kind of solutions\n[12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36].\nIn five dimensions there also exist the so-called Kaluza-Klein (KK) black holes. These\ncorrespond to black objects whose horizon geometry is a squashed three-sphere [37, 38,\n39, 40]. By contrast, their geometry is not asymptotically flat; instead it is asymptotic\nto a nontrivial S 1 bundle with constant fiber over the two-sphere in a four-dimensional\nasymptotically flat spacetime. This is also the asymptotic geometry of the Kaluza-Klein\nmonopole [41, 42]. Such black holes look five-dimensional in the near horizon region, while\nasymptotically they look like four-dimensional objects with a compactified fifth dimension.\nFor vacuum metrics, there exists a systematic procedure to add KK-monopole charge to\na general asymptotically flat geometry [43, 44, 45], based on a hidden SL(3, R) symmetry\nof the gravitational sector [46]. One should note here that adding a Kaluza-Klein monopole\n2\n\n\fcharge to a given solution with matter fields is not a trivial task once one departs from\nthe class of supersymmetric/vacuum solutions; in many cases, to find exact solutions one\nhas to solve the Einstein equations by brute force. For instance, a solution describing a\nstatic KK black hole with electric charge has been found in [47], while the corresponding\nEinstein-Yang-Mills solution has been described in [48]. Remarkably, with hindsight, many\nsuch KK solutions can be generated by applying a 'squashing' transformation on suitable\ngeometries [49, 50, 51, 52, 53, 54]. However, not all the KK black hole solutions can be\ngenerated by the squashing transformation. More recently, in the context of the minimal 5dimensional supergravity, there has been developed a solution generating technique based on\nthe G2 U-duality arising in the dimensional reduction of the theory down to three dimensions\n[55, 56, 57, 58, 59, 60] and more general KK black holes have been derived [61, 62, 63].\nIn this article we focus on Kaluza-Klein multi-black hole solutions. In higher dimensions,\nby contrast to the single black hole case, solutions describing general charged multi-black\nhole objects are scarce. The main reason is that, except in particular cases where the\nblack objects are extremal [64, 65, 66, 67], the known solution generating techniques lead to\nmulti-black hole systems with charges proportional to the masses and therefore they cannot\ndescribe the most general charged solution for which the charges and the masses should\nbe independent parameters. However, in five dimensions, a solution describing a general\ndouble-Reissner-Nordström solution has been recently constructed in [68], generalizing the\nuncharged solutions given in [70, 71, 72, 73]. The main purpose of this article is to show that\none can appropriately modify the procedure in [68] to construct the general charged double\nKK black hole in five-dimensions.\nThe structure of this paper is as follows. We first describe the solution generating technique that will allow us to lift four-dimensional charged static configurations to five dimensional Einstein-Maxwell solutions with Kaluza-Klein asymptotics. This technique is based\non a simple modification of the procedure given in [68]. We use the general double ReissnerNordström solutions in four dimensions as a seed and lift it to five dimensions and show\nthat the final solution can be interpreted as the general charged Kaluza-Klein double-black\nhole solution. Our solution generating method extends easily to the more general case of\nEinstein-Maxwell-Dilaton (EMD) gravity with arbitrary coupling constant and we derive the\ncharged Kaluza-Klein double-black hole solutions in this case. We end with a summary of\nour work and consider avenues for future research.\n\n2\n\nSolution generating technique\n\nConsider a charged static solution of the Einstein-Maxwell-Dilaton system in five dimensions:\n\u0014\n\u0015\n√\n1\n1 αφ 2\n2\nL5 = −g R − (∂φ) − e F(2) ,\n(1)\n2\n4\nwhere F(2) = dA(1) . For static electrically charged configurations the only non-zero component of the 1-form gauge potential A(1) will be denoted here by At . The solution is specified\nby the metric:\nφ\n2φ\n\u0003\n√1 \u0002\n− √1\n(2)\nds2(5) = −e 3 dt2 + e 3 e−ψ (dχ − ωdφ)2 + eψ ds2(3) ,\n3\n\n\fthe scalar field φ and the gauge field A(1) = At dt. Here and in what follows we assume that\nall the functions φ1 , ψ, ω, At and the scalar field φ depend only on coordinates ρ and z.\nPerform now a dimensional reduction down to three dimensions: first on the time direction and then on the χ coordinate1 . Denoting the KK 1-form potential from the metric by\nA(1) = ωdφ one obtains a solution of the following Lagrangian in three dimensions:\n\u0015\n\u0014\n1\n1 √2 φ1 +αφ\n1\n1 −2ψ\n1\n√\n2\n2\n2\n2\n2\n3\n(∂At ) − (∂ψ) − e (dA(1) ) . (3)\nL(3) = g R − (∂φ) − (∂φ1 ) + e\n2\n2\n2\n2\n4\nOne should note at this point that one has two decoupled systems: one involving the scalar\nfields φ, φ1 and the electric potential At , while the second sector comprises the scalar ψ and\nthe KK 1-form A(1) . This simple observation is the base of our solution generation technique\nin the present work. To this end, we shall employ Weyl's charging technique as described for\ninstance in [74]. Let us first perform a dualization of the 2-form field strength F(2) = dA(1)\nto a scalar ξ by using:\n√\nFab = ge2ψ ǫabc ∂ c ξ,\n(4)\nwhere ǫabc is the Levi-Civita symbol in three dimensions. Then one can rewrite the (ψ, A(1) )\nsector in the above Lagrangian in the following form:\n\u0015\n\u0014\n\u0003\n1 2ψ\n1\n√ 1 \u0002\n√\n2\n2\n(5)\nL(ψ,A) = g − (∂ψ) + e (∂ξ) = g tr ∂M−1 ∂M ,\n2\n2\n4\nwhere one defines the matrix:\n\nM=\n\n\u0012\n\neψ\nξeψ\nξeψ −e−ψ + ξ 2eψ\n\n\u0013\n\n.\n\n(6)\n\nIt is now manifest that the truncated Lagrangian (5) is invariant under general SL(2, R)\ntransformations if one considers the following transformation law:\n\u0013\n\u0012\nab\nT\n, ad − bc = 1.\n(7)\nM → Ω MΩ,\nΩ=\ncd\nThe scalar fields ψ and ξ transform under Ω as follows:\n′\n\neψ = a2 eψ + 2acξeψ − c2 e−ψ + c2 ξ 2eψ ,\n′\nξ ′ eψ = abeψ + (ad + bc)ξeψ − dce−ψ + dcξ 2eψ .\n\n(8)\n\nSuppose now that one starts with a solution (2) for which ω = 0, that is ξ = 0. Then in\nterms of the initial scalar (denote it by ψ̃) after applying an SL(2, R) transformation (the\nmetric and the remaining fields in (3) remain unchanged) one obtains:2\nc\nξ=−\neψ = eψ̃ (a2 − c2 e−2ψ̃ ),\n,\n(9)\n2\n2\na(a e ψ̃ − c2 )\n1\n\nThe order is important here since if one performs a KK reduction first on χ and then on t one gets\n'mixed' terms in the three-dimensional Lagrangian and further field redefinitions of the scalar fields have to\nbe made to decouple the (φ1 , At , φ) and (ψ, ω) sectors.\n2\nFor further convenience one drops the prime superscripts in the final fields.\n\n4\n\n\fup to the constant term b/a in ξ that can be dropped without losing generality. Next, to\nobtain a solution of the system (3) one has to dualize back the scalar field ξ to obtain the\nKK 1-form A(1) = ωdφ. Replacing the above expression of ξ in (4) it turns out that the\nproblem reduces to find a function ω = 2acΨ such that:\ndΨ = ρ(∂ρ ψ̃dz − ∂z ψ̃dρ)\n\n(10)\n\nThe integrability condition for Ψ leads to following condition on ψ̃:\n1\n∂ρ2 ψ̃ + ∂ρ ψ̃ + ∂z2 ψ̃ = 0,\nρ\n\n(11)\n\nthat is ψ̃ must be a harmonic function. This condition is automatically satisfied for any\ninitial seed solution for which ω = 0 and, therefore, it does not impose any real constraint.\nAs in [44], given a harmonic function ψ̃ we shall call a function Ψ satisfying the above\nequation as 'the dual' of ψ̃ and it turns out that, when ψ̃ is given in terms of simple rods,\none can easily write down the expression for ω = 2acΨ in closed form. Once ω and ψ are\nknown one can replace them in (2) to obtain the new charged solution of the EMD system\nin five dimensions, all the remaining fields being unchanged under the action of the SL(2, R)\ntransformation.\nIn what follows we shall apply this technique on the charged static five-dimensional\nsolutions obtained in [68]. Let us recall first the results of the solution generating technique\nused in that work. Suppose we are given a static solution of the four-dimensional EinsteinMaxwell system:\n\u0015\n\u0014\n√\n1 2\n(12)\nL4 = −g R − F̃(2) ,\n4\nwhere F̃(2) = dÃ(1) and the only non-zero component of Ã(1) is Ãt = Φ. The solution\nto the equations of motion derived from (12) is assumed to have the following static and\naxisymmetric form:\n\u0002\n\u0003\nds24 = −f ̃dt2 + f ̃−1 e2μ̃ (dρ2 + dz 2 ) + ρ2 dφ2 ,\nÃ(1) = Φdt.\n\n(13)\n\nThen the corresponding solution of the Einstein-Maxwell-Dilaton system in five dimensions can be written as:\n\u0014\n\u0015\n6μ̃\n2\n4\n−\n+2γ−2h\n2\n2h\n2\n2\n2\n2\n2\n−2h\n2\n2\n2\n2\n ̃\nds5 = −f ̃3α +4 dt + f 3α +4 e dχ + e 3α +4\n(14)\n(dρ + dz ) + ρ e dφ ,\nwhile the 1-form potential and the dilaton are given by:\nr\n3α\n3\nA(1) =\nΦdt,\ne−φ = f ̃3α2 +4 .\n2\n3α + 4\n5\n\n(15)\n\n\fIt can be checked that this solution solves the equations of motion derived from (1). Here h\nis an arbitrary harmonic function; once its form has been specified for a particular solution\nthen γ can be obtained by simple quadratures using the equations:\n∂ρ γ = ρ[(∂ρ h)2 − (∂z h)2 ],\n\n∂z γ = 2ρ(∂ρ h)(∂z h).\n\n(16)\n\nIt was shown in [68] that, using the four-dimensional Reissner-Nordström as the initial seed,\nby an appropriate choice of h one can obtain either a black hole, or a black ring or a black\nstring in five dimensions.\nRecasting (14) in the form (2) one can read directly the following fields:\ne\n\nφ\n√1\n3\n\n2\n\n−\n= f ̃ 3α2 +4 ,\n\nψ̃ = −2h,\n\n6μ̃\n\nds2(3) = e 3α2 +4\n\n+2γ\n\n(dρ2 + dz 2 ) + ρ2 dφ2 .\n\n(17)\n\nIf one denotes by H the 'dual' of h then the final solution of the EMD system can be\nexpressed as:\n\u0014\n6μ̃\n4\ne2h\n+2γ−2h\n− 22\n2\n2\n2\n ̃\n ̃\n(dρ2 + dz 2 )\n(dχ + 4acHdφ)2 + (a2 − c2 e4h )e 3α2 +4\nds5 = −f 3α +4 dt + f 3α +4 2\n2\n4h\na −c e\nr\n\u0015\n3α\n3\n−φ\n2 2\n2 4h −2h\n2\n ̃3α2 +4 .\nΦdt,\ne\n=\nf\n+ρ (a − c e )e dφ ) ,\nA(1) =\n(18)\n3α2 + 4\nSolutions of the pure Einstein-Maxwell theory in five dimensions are simply obtained\nfrom the above formulae by taking α = 0. In the following sections we shall focus on this\nparticular case.\n\n3\n\nCharged Kaluza-Klein black hole solutions\n\nAs a check of the above solution generating technique we shall first generate the single\ncharged KK black hole, which was originally derived in [47]. Not too much of a surprise, it\nturns out that in order to generate this solution one has to employ the charged black string\nas the initial seed. Motivated by this result, we then use the double-black string solution\nconstructed in [68] to derive the general charged static KK double-black hole system in five\ndimensions.\n\n3.1\n\nSingle charged KK black hole\n\nLet us start with the five-dimensional black string solution. In Weyl coordinates it can be\nwritten in the following form [68]:\n\u0015\n\u0014\n\u0002 3μ̃ +2γ 2\n\u0003\n1\n2h\n2\n−2h\n2\n2\n2\n2\n2\n−\n(19)\ne2\n(dρ + dz ) + ρ dφ ,\nds(5) = −f ̃dt + f ̃ 2 e dχ + e\n\nwhere:\n\n(r1 + r2 )2 − 4σ 2\n(r1 + r2 )2 − 4σ 2\n2μ̃\nf ̃ =\n,\n,\ne\n=\n(r1 + r2 + 2m)2\n4r1 r2\ns\n\u0012\n\u00131\n1 16Y12 4\nr1 + ζ 1\n2h\n2γ\ne =\n,\ne =\n.\nr2 + ζ 2\nK0 r 1 r 2\n6\n\n√\n2 3q\nAt = −\n,\nr1 + r2 + 2m\n(20)\n\n\fp\np\nHere we denote by σ = m2 − q 2 , ri = ρ2 + ζi2 , ζ1 = z − σ, ζ2 = z + σ, while 2Y12 =\n(r1 + r2 )2 − 4σ 2 . Using the explicit form for h given above, it is straightforward to verify\n1 3\nthat its dual is given by H = r2 −r\n.\n4\nThe final solution can be written in the form:\ns\n\u0014\n2\n2\nr1 + ζ 1\nr\n+\nr\n+\n2m\n(r\n+\nr\n)\n−\n4σ\nr\n+\nζ\n1\n2\n1\n2\n2\n2\n2\n√\ndt\n+\n(dχ + ac(r2 − r1 )dφ)2\nds2(5) = −\n2\n2\n2\n(r1 + r2 + 2m)\na (r2 + ζ2 ) − c (r1 + ζ1 ) r2 + ζ2\n2Y12\ns\n!\u0015\n1\na2 (r2 + ζ2 ) − c2 (r1 + ζ1 ) r2 + ζ2 2 4 Y12\n+\n.\n(21)\n(dρ2 + dz 2 ) + ρ2 dφ2\nr2 + ζ 2\nr 1 + ζ 1 K0 r 1 r 2\nBefore we show that this is indeed the charged KK black hole solution, let us notice that\n2l2 −σ\nfor q = 0, a = 1, σ = k 2 and c = 2l\n2 +σ it reduces to the uncharged KK black hole derived in\n[43]. Perform now the following coordinate changes:\np\nρ = (r − m)2 − σ 2 sin θ,\nz = (r − m) cos θ.\n(22)\n5\n\nNoting that r2 − r1 = 2σ cos θ and picking K0 = 2 4 it is now apparent that (21) becomes:\n\u0015\n\u0014\n(r − m)2 − σ 2 2\n1\ndr 2\n2\n2\n2\n2\n2\nds(5) = −\ndt + g(r) (r−m)2 −σ2 + r (dθ + sin θdφ ) +\n(dχ + 2acσ cos θdφ)2 ,\n2\nr\ng(r)\nr2\n√ √\n2\n2\n3 m −σ\nσ(a2 + c2 ) − m(a2 − c2 )\n,\ng(r) = a2 − c2 +\n.\n(23)\nAt = −\nr\nr\nThis is none other than the charged static Kaluza-Klein black hole derived in [47]. To see\nthis, let √\nus fix a such that a2 = c2 + 1 and redefine the constants in our solution such that\nr∞ = 2c c2 + 1σ and r0 = σ(1 + 2c2 ) − m. By expressing c in terms of r∞ and σ it can be\neasily checked that (23) becomes:\n\u0013\n\u0012 2\nr2\ndr\n2\n2\n2\n2\n2\n2\n+ r (dθ + sin θdφ ) + ∞ (dχ + cos θdφ)2 ,\nds = −f (r)dt + g(r)\nf (r)\ng(r)\np\n2 + σ2 − m\nr∞\n(r − m)2 − σ 2\nr0\nf (r) =\n,\ng(r)\n=\n1\n+\n=\n1\n+\n,\n(24)\nr2\nr\nr\nthat is, the solution found in [47].\nThe extremal limit is achieved when σ = 0 while the uncharged black hole is obtained\nby taking σ = m. In absence of the black hole (take m = σ = 0) the solution becomes the\nKK-monopole background as expected. This solution is described in terms of the length at\ninfinity, 4πr∞ , of the χ coordinate.\nIn addition, it can be manifestly checked that the Reissner-Nordström black hole with\nspherical horizon is recovered from (23) if one takes directly a = c and makes the analytical\ncontinuation c → ic to keep g(r) positive.\nIn general, the dual of 21 ln(ri + ζi ) is − 21 (ri − ζi ), while the dual of\np\nri = ρ2 + ζi2 , ζi = z − ai and ai is constant.\n3\n\n7\n\n1\n2\n\nln(ri − ζi ) is − 21 (ri + ζi ), where\n\n\fOne could also apply the above solution generating technique using as seed either the\nfive-dimensional Reissner-Nordström black hole with spherical horizon or the static charged\nblack ring. However, the generated solutions do not seem to have the right KK asymptotics\nand, therefore, they are not amenable to clear physical interpretations. For instance, if\none starts with the spherical black hole, after converting the final solution from the Weyl\ncoordinates to the spherical ones, in the uncharged case one obtains the following metric:\n\u0013\n\u0012\n\u0013\n\u0012\n4m\ndr 2\n2\n2\n2\n2\n2\n2\n2\n2 2 2\n4\n+ r (dθ + sin θdφ )\nds(5) = − 1 − 2 dt + (a − c r (r − 4m) cos θ)\nr\n1 − 4m\nr2\nr 2 cos2 θ\n+ 2\n(dχ − 2ac(r 2 − 2m) sin2 θdφ)2 ,\n(25)\na − c2 r 2 (r 2 − 4m) cos4 θ\nupon performing the coordinate transformations:\n\n1\nz = (r 2 − 2m) cos 2θ.\n(26)\n2\nWe explicitly checked that this is indeed a vacuum solution, however it has peculiar asymptotics and its physical interpretation (if any) is unclear to us at this stage.\nρ2 = r 2 (r 2 − 4m) sin2 θ cos2 θ,\n\n3.2\n\nCharged Kaluza-Klein double-black hole solution\n\nAs we have seen in the previous section, in order to generate the charged KK black hole one\nhas to use the charged black string as seed. To obtain the general charged KK double-black\nhole solution one should then use as initial seed in our solution generating technique the\ncharged double-black string solution constructed in [68]. In Weyl coordinates this solution\ncan be written as:\n\u0015\n\u0014\n\u0002 3μ̃/2+2γ 2\n\u0003\n1\n2h\n2\n−2h\n2\n2\n2\n2\n2\n−\ne\n(dρ + dz ) + ρ dφ ,\nds5 = −f ̃dt + f ̃ 2 e dχ + e\n√\n3C\n.\n(27)\nAt = −\nA+B\nHere one denotes (see [69] for details of the original double Reissner-Nordström solution in\nfour dimensions):\nA2 − B 2 + C 2\nf ̃ =\n,\n(A + B)2\n\ne2μ̃ =\n\nA2 − B 2 + C 2\n,\n16σ12 σ22 (ν + 2k)2 r1 r2 r3 r4\n\n(28)\n\nwhere:\nA = σ1 σ2 [ν(r1 + r2 )(r3 + r4 ) + 4k(r1 r2 + r3 r4 )] − (μ2 ν − 2k 2 )(r1 − r2 )(r3 − r4 ),\nB = 2σ1 σ2 [(νM1 + 2kM2 )(r1 + r2 ) + (νM2 + 2kM1 )(r3 + r4 )]\n−2σ1 [νμ(Q2 + μ) + 2k(RM2 + μQ1 − μ2 )](r1 − r2 )\n−2σ2 [νμ(Q1 − μ) − 2k(RM1 − μQ2 − μ2 )](r3 − r4 ),\nC = 2σ1 σ2 {[ν(Q1 − μ) + 2k(Q2 + μ)](r1 + r2 ) + [ν(Q2 + μ) + 2k(Q1 − μ)](r3 + r4 )}\n−2σ1 [μνM2 + 2k(μM1 + RQ2 + μR)](r1 − r2 )\n−2σ2 [μνM1 + 2k(μM2 − RQ1 + μR)](r3 − r4 ),\n(29)\n8\n\n\fwith constants:\nν = R2 − σ12 − σ22 + 2μ2 ,\nσ12 = M12 − Q21 + 2μQ1 ,\nwhile ri =\n\np\n\nζ1 = z −\n\nk = M1 M2 − (Q1 − μ)(Q2 + μ),\nM2 Q1 − M1 Q2\n,\nσ22 = M22 − Q22 − 2μQ2 ,\nμ=\nM1 + M2 + R\n\n(30)\n\nρ2 + ζi2, for i = 1..4, with:\n\nR\n− σ2 ,\n2\n\nζ2 = z −\n\nR\n+ σ2 ,\n2\n\nζ3 = z +\n\nR\n− σ1 ,\n2\n\nζ4 = z +\n\nR\n+ σ1 .\n2\n\n(31)\n\nTo describe a configuration of two charged black strings one has to pick the following\nharmonic function h, while γ can be found by integrating (16) with the result:\ns\n\u0012\n\u00131\n1 16Y12 Y14 Y23 Y34 4\n(r1 + ζ1 )(r3 + ζ3 )\n2γ\n2h\n,\n(32)\ne =\n,\ne =\n(r2 + ζ2 )(r4 + ζ4 )\nK0 r1 r2 r3 r4 Y13 Y24\nwhere K0 is a constant and we denote Yij = ri rj + ζi ζj + ρ2 , where i, j = 1...4. Let us note\nthat the dual of h is given by:\nH =\n\nr2 + r4 − r1 − r3\n,\n4\n\n(33)\n\nwhile\nΣ ≡ a2 − c2 e4h =\n\na2 (r2 + ζ2 )(r4 + ζ4 ) − c2 (r1 + ζ1 )(r3 + ζ3 )\n.\n(r2 + ζ2 )(r4 + ζ4 )\n\n(34)\n\nThe final solution describing a system of two general charged KK black holes in five dimensions is given by:\n\u0014 2h\n\u0015\n\u0002 3μ̃/2+2γ 2\n\u0003\n1\ne\n2\n2\n−\n2\n−2h\n2\n2\n2\nds(5) = −f ̃dt + f ̃ 2\n(dχ + ac(r2 + r4 − r1 − r3 )dφ) + e Σ e\n(dρ + dz ) + ρ dφ ,\nΣ\n√\n3C\nAt = −\n.\n(35)\nA+B\nThis solution is parameterized by six independent parameters and describes the superposition\nof two general KK black holes, with masses M1,2 , charges Q1,2 , R being the coordinate\ndistance separating them and the asymptotic length of the KK coordinate χ at infinity, or,\nequivalently, by the KK-monopole charge.\nBefore we discuss some of its physical properties, let us first consider the rod structure of\nthis solution. Following the procedure given in [2] one deduces that the rod structure of the\ngeneral solution is described by four turning points that divide the z-axis into five rods as\nfollows.4 For z < −R/2−σ1 one has a semi-infinite rod with direction l1 = (0, 2ac(σ1 +σ2 ), 1),\nfor −R/2 − σ1 < z < −R/2 + σ1 one has a timelike rod with direction l2 = (1, 0, 0), which\ncorresponds to the horizon of the first black hole. For −R/2 + σ1 < z < R/2 − σ2 on has a\n4\n\nWe are writing the vectors in the basis {∂/∂t, ∂/∂χ, ∂/∂φ}.\n\n9\n\n\ffinite spacelike rod with direction l3 = (0, −2ac(σ1 −σ2 ), 1). For R/2−σ2 < z < R/2+σ2 one\nhas a timelike rod with direction l4 = (1, 0, 0), which corresponds to the horizon of the second\nblack hole. Finally, for z > R/2 + σ2 one has a semi-infinite spacelike rod with direction\nl5 = (0, −2ac(σ1 + σ2 ), 1). Note now that the rod directions of the spacelike rods surrounding\nthe horizons are precisely the rod directions of the double-Taub-NUT background [76]. This\nconfirms that the general solution that we derived describes a pair of black holes sitting at\nthe nuts of the double Taub-NUT background.\nTurning now to the discussion of the conical singularities, to avoid a conical singularity\nat the location of a rod with direction li , the period ∆i of the spacelike coordinate ηi (such\nthat li = ∂/∂ηi ) must be fixed as:\ns\nρ2 gρρ\n∆i = 2π lim\n,\n(36)\nρ→0\n|li |2\nwhere gρρ is the ρρ-component of the metric while |li |2 is the norm of li . Specifically we find:\ns√\n8\n(37)\n∆1 = ∆5 = 2π\nK0\nalong the outer axis z < −R/2 − σ1 or z > R/2 + σ2 , while:\ns√\n! 14\n\u0012\n\u00133 2\nν − 2k\nR − (σ1 − σ2 )2\n8\n∆3 = 2π\n,\nK0\nν + 2k\nR2 − (σ1 + σ2 )2\n\n(38)\n\non the portion −R/2 + σ1 < z < R/2 −σ2 in between\nthe KK black hole horizons. We ensure\n√\nregularity of the outer axis, by taking K0 = 8. There will still be a conical singularity\nrunning in between the KK black holes. The equilibrium condition, for which this conical\nsingularity disappears is given by:\n\u0012\n\u00133\nν − 2k\nR2 − (σ1 + σ2 )2\n.\n(39)\n= 2\nν + 2k\nR − (σ1 − σ2 )2\nThis is the same equilibrium condition found in [74] when discussing the double black\nstring solution in the KK flat background. Therefore, as in [74] we conclude that there are\nno nonextremal KK double-black hole solutions with δφ = 0, which also satisfy the physical\nconditions M1 + M2 > 0 and σ1 + σ2 < R. The only way to satisfy this condition is to\nconsider extremal objects for which σ1 = σ2 = 0.\n3.2.1\n\nLimits of the KK double-black hole solution\n\nLet us consider now some particular cases of the above general charged KK double-black\nhole solution. First, in order to prove that it describes indeed a system of two charged KK\nstatic black holes, let us note that one can recover the individual black holes by pushing\nthe other black hole to infinity. For example, to recover the metric describing the second\n10\n\n\fblack hole (with parameters M2 and Q2 ) one has to first center the z origin on its horizon by\nmaking the shift z → z − R2 and, after that, take the infinite separation limit R → ∞. From\np\nthe general expressions in (28), one notes that in this limit ν ∼ R2 , μ ∼ 0, σi = Mi2 − Q2i ,\nfor i = 1..2, k = M1 M2 − Q1 Q2 and r3,4 ∼ R, such that:\nA ∼ 2σ1 σ2 R3 (r1 + r2 ),\n\nB ∼ 4σ1 σ2 R3 M2 ,\n\nC ∼ 4σ1 σ2 R3 Q2 ,\n\nAlso, by taking this limit in the harmonic function h one obtains:\ns\n\u0012\n\u00131\nr1 + ζ 1\n1 16Y12 4\n2h\n2γ\ne =\n.\n,\ne =\nr2 + ζ 2\nK0 r 1 r 2\n\n(40)\n\n(41)\n\nwhile the dual of h and Σ become respectively:\nH =−\n\nr1 − r2\n,\n4\n\nΣ−1 =\n\nr2 + ζ 2\n.\na2 (r2 + ζ2 ) − c2 (r1 + ζ1 )\n\n(42)\n\nReplacing all these quantities in (35) it is now manifest that one √\nrecovers the solution describing a single KK black hole. However, since in this case K0 = 8 there is still a conical\nsingularity along the φ-axis all the way to infinity as expected.\nThe extremally charged limit formally corresponds to taking M1 = ǫQ1 and M2 = ǫQ2\nwith ǫ = ±1. This leads to σ1 = σ2 = k = μ = 0 and, in consequence, in this limit r1 = r2\nwhile r3 = r4 . Apparently, this makes e2h → 1 and H → 0. Therefore, in this unconstrained\nlimit the general solution given in (35) reduces to the extremal double black string seed from\n[68], which describes a pair of extremal strings in a flat background. In order to recover the\nsolution describing extremal black holes a background with KK asymptotics, the extremal\nlimit must be taken with better care, as we shall describe in what follows.\nTo this end, let us first set a2 = 1 + c2 and, for future convenience, perform a shift\nz → z + R/2 of the z coordinate such that one centers on the horizon of the second black\nhole. In the extremal limit one has σ1 , σ2 → 0. To correctly obtain this limit one can consider\nfor instance values of the masses or charges such that σ1 = N1 /2c2 and σ2 = N2 /2c2 , where\nN1 and N2 are constants. Then the extremal limit is simply obtained by taking c → ∞ such\nthat the products 2c2 σ1 ≡ N1 and 2c2 σ2 ≡ N2 are kept constant. One can check that in\nthis constrainted limit one also obtains M1 = ǫQ1 and M2 = ǫQ2 with ǫ = ±1 as expected.\nExpanding to first order in σ1 and σ2 one obtains5 :\n\nwhile\n\n5\n\nN2\nN1\n+ O(σi σj ),\nΣ=1+ p\n+p\nρ2 + (z + R)2\nρ2 + z 2\nac(r2 − r1 + r4 − r3 ) = p\n\nN2 z\n\nN1 (z + R)\n+ O(σi σj ).\n+p\nρ2 + (z + R)2\nρ2 + z 2\n\n(43)\n\n(44)\n\nNote that only the terms linear in σi will survive in the extremal limit with Ni kept constants, while\nterms with higher powers of σi will vanish.\n\n11\n\n\fOn the other hand, once we have σ1 = σ2 = 0 then (28) becomes:\n\u0013−2\n\u0012\nM\nM\n2\n1\n+\n,\nf ̃e = 1 +\nr3\nr1\n\ne2μ̃ |e = 1.\n\n(45)\n\nwhile6\ne2h = 1,\n\ne2γ = 1.\n\n(46)\n\nCollecting all these results into (35) and performing the coordinate transformations:\nρ = r sin θ,\n\nz = r cos θ\n\nthe extremal double black hole solution becomes:\n\u0012\n\u0013−2\n\u0013\u0014\n\u0012\nM1 M2\n1\nM1 M2\n2\n2\ndse = − 1 +\n+\n+\ndt + 1 +\nN2\nr3\nr\nr3\nr\n1+ r +\n\u0013\n\u0015\n\u0012\n\u0003\nN2 N1 \u0002 2\ndr + r 2 (dθ2 + sin2 θdφ2 ) ,\n+ 1+\n+\nr\nr3\n√ \u0012\n\u0013−1\nM1 M2\n3\n1+\n+\n,\nAt = −\n2\nr3\nr\n√\nwhere r3 = r 2 + 2Rr cos θ + R2 , while\nωφ = N2 cos θ + √\n\n(47)\n\nN1\nr3\n\n(dχ + ωφ dφ)2\n\nN1 (r cos θ + R)\n.\nr 2 + 2rR cos θ + R2\n\n(48)\n\n(49)\n\nIt is interesting to note that the above solution is a particular case of the extremal\nsolutions considered in [66] as expected7 . It corresponds to a pair of extremal Kaluza-Klein\nblack holes on a double-Taub-NUT background. In absence of the black holes (setting\nM1,2 = 0), the solution reduces to the double Taub-NUT background. To summarize, we\nfound that the unconstrained limit yields 2 extremal black string solutions but the alternate\nlimit, in which one takes the limit with the constraints that 2c2 σ1 ≡ N1 and 2c2 σ2 ≡ N2 are\nfixed yields another, the extremal double black hole solution.\n3.2.2\n\nConserved charges and thermodynamics\n\nTo find the asymptotic geometry one performs the coordinate transformations:\nρ = r sin θ,\n\nz = r cos θ,\n\n(50)\n\n√\nand take the asymptotic limit r → ∞. Defining now r∞ = 2c 1 + c2 (σ1 +σ2 ) the asymptotic\nlength of the χ-circle becomes L = 4πr∞ .\n\n√\nRecall that we set K0 = 8 to cancel out conical singularities on the outer axis, leaving a conical\nsingularity on the portion of the φ-axis in between the black holes.\n7\nWe thank the anonymous referee for stressing this point to us.\n6\n\n12\n\n\fTo compute the conserved charges we shall make use of the counterterm proposed in\n[77]. This counterterm regularizes the gravitational action for spacetime geometries that are\nasymptotic to the KK-monopole background. To this end, one adds to the Einstein-Maxwell\naction (including the Gibbons-Hawking term) the following surface term:\nZ\n√ √\n1\n(51)\nd4 x −h 2R\nIct =\n8πG\nwhere R is the Ricci scalar of the induced metric on the boundary, hij . By taking the\nvariation of this total action with respect to the boundary metric hij , it is straightforward\nto compute the boundary stress-tensor:\n1\n(Kij − Khij − Ψ(Rij − Rhij ) − hij \u0003Ψ + Ψ;ij )\n8πG\nq\nwhere we denote Ψ = R2 . If the boundary geometry has an isometry generated by a Killing\nvector ξ i , then Tij ξ j is divergence free, from which it follows that the quantity\nI\nQ=\nd3 S i Tij ξ j ,\nTij =\n\nΣ\n\nassociated with a closed surface Σ, is conserved. Physically, this means that a collection\nof observers on the boundary with the induced metric hij measure the same value of Q,\nprovided the boundary has an isometry generated by ξ. In particular, if ξ i = ∂/∂t then Q is\nthe conserved mass M. One should also note that for KK black holes there exists another\nconserved quantity, analogous to the gravitational tension in the black string case [78, 79],\nwhich can be easily computed in the counterterms approach by using the formula [54]:\nZ\nZ\nI\n√\nχ j\n′\n3\nT =\nd Sχ Tj ξ = dt\nd2 x σTχχ ,\n(52)\n2\nS∞\n\nΣ′\n\nwhere now ξ i = ∂/∂χ and the integration is performed over the two-sphere at infinity\n(described by θ and φ) and also along the time direction. This gravitational tension is\ndefined with respect to the asymptotic spatial translation along the circle described by χ.\nSimilarly to the black string case, one notices that one can omit the integration over time\nand work with the 'tension per unit time':\nI\n√\nT =\n(53)\nd2 x σTχχ .\n2\nS∞\n\nA straightforward computation using the boundary stress-tensor leads to the following\nconserved mass and gravitational tension:\np\n2 + (σ + σ )2\np\n\u0003\nr∞\nπr∞ \u0002\n1\n2\n2\n2\n3(M1 + M2 ) + r∞ + (σ1 + σ2 ) , T =\n.\n(54)\nM=\nG\n2G\n\nThe total charge\n√ of the double-black hole solution is computed using Gauss' formula with\n1 +Q2 )\n.\nthe result Q = 3πr∞ (Q\nG\n13\n\n\fFinally, let us notice that, similar to what happens in the single black hole case, one can\ncompute the Komar mass:\nZ\n1 3\nα,\n(55)\nMK = −\n16πG 2 S\nwhere S is the boundary of any spacelike hypersurface and:\nαμνρ = ǫμνρστ ∇σ ξ τ ,\n\n(56)\n\nwith the Killing vector ξ = ∂/∂t. This quantity is a measure of the mass contained in S,\nand if we take S to be the three-sphere at infinity enclosing both horizons then (55) gives\nthe total Komar mass of the system:\nMK =\n\n3π(M1 + M2 )r∞\n3(M1 + M2 )L\n=\n,\nG\n4G\n\n(57)\n\nwhile the Komar mass of each individual black hole is obtained by performing the above\nintegration at the respective black hole horizon. At this point, let us note that the relation\n2MK = 2M − T L is satisfied for the double-black hole system as well (this relation was first\nnoticed in [54] for the single KK black hole system).\nA straightforward computation leads to:\n(1)\n\nMKomar =\n\n3\nσ2 L,\n4G\n\n(2)\n\nMKomar =\n\nwhile\nMK =\n\n(1)\nMKomar\n\n+\n\n(2)\nMKomar\n\n1 3\n−\n16πG 2\n\nHowever, since Einstein's equations imply Rtt =\ndimensional Smarr formula [80]:\n(1)\n\n2\nFμt\n,\n3\n\nZ\n\n3\nσ1 L,\n4G\n\n(58)\n\n√\nRtt −gdV.\n\n(59)\n\none arrives at the following five-\n\n(2)\n\n(60)\n\n(i)\n\n(61)\n\nMK = MK + MK ,\nwhere for each constituent one has:\n(i)\n\n(i)\n2MK\n(i)\n\n=\n\n(i)\n\n3k(5) A(5)\n8πG\n(i)\n\n+ 2ΦH Q(i) ,\n\niL\n. Thus one can regard MK as the individual mass of each black object,\nwhere MK = 3M\n4G\ni\ncontaining an electromagnetic contribution apart from the Komar piece! Here k(5)\n, Ai(5) , ΦiH\nand Qi are in order the surface gravity, horizon area, electric potential and electric charge\ncomputed for each black hole horizon. One should also note that this relation follows from\nthe four-dimensional Smarr relation for each individual black hole and in what follows, using\nthe recent results obtained in [81] we shall show that this is indeed the case.\nFirst, the electric potential on each horizon is easily computed from ΦiH = −At |horizon\nand one obtains:\n\u0012\n\u0013\n√ Mi − σi\ni\n.\n(62)\nΦH = 3\nQi\n\n14\n\n\fAlso, the individual black hole charges turn out to be:\n√\n√\n3πr∞ Qi\n3LQi\nQi =\n=\n.\nG\n4G\n\n(63)\n\nNote that the total charge is Q = Q1 + Q2 , that is the sum of the individual charges, as\nexpected.\nThe main difficulty when discussing the thermodynamic properties of the double black\nhole system consists in computing the temperature and entropy for each horizon. However,\nin what follows we shall show that these quantities are related in a simple manner to those\ndefined in the original four-dimensional seed and, therefore, using the results in [81] one can\nexpress the five-dimensional ones in a simple form.\nIn the four-dimensional seed, the area of each black hole horizon can be expressed in the\nfollowing form:\n\u0011\n\u0010\n(64)\nAi(4) = 4πσi ρf ̃−1 eμ̃ |iρ=0 ,\nwhere for each black hole horizon we have [81]:\n\u0002\n\u00032\n\u0010\n\u0011\n(R + M1 + M2 )(M1 + σ1 ) − Q1 (Q1 + Q2 )\n−1 μ̃\n1\n ̃\n,\nρf e |ρ=0 =\nσ1 [(R + σ1 )2 − σ22 ]\n\u0002\n\u00032\n\u0011\n\u0010\n(R + M1 + M2 )(M2 + σ2 ) − Q2 (Q1 + Q2 )\n2\n−1 μ̃\n ̃\nρf e |ρ=0 =\n.\nσ2 [(R + σ2 )2 − σ12 ]\n\n(65)\n\nFor the final five-dimensional solution the area of each black hole horizon can be written\nas:\n\u0011 21\n\u0002\n\u00033 \u0010 1\nAi(5) = 4πσi L (ρf ̃−1 eμ̃ )|iρ=0 4 (ρ 2 e2γ−2h Σ)|iρ=0 .\n\nLet us note now that near each black hole horizon one can express:\n√\ne2h−2γ = (pi )2 ρ + O(ρ)\n\n(66)\n\n(67)\n\nwhere pi are constants, while Σ|ρ=0 = Σ0 = 1 + c2 is also constant. One finds explicitly:\ns\ns\n1\n1\nR\n+\nσ\n−\nσ\nR + σ2 − σ1\n1\n2\n, (p2 )2 =\n(68)\n(p1 )2 =\n2 σ1 (R + σ1 + σ2 )\n2 σ2 (R + σ1 + σ2 )\nand replacing these relations in (66) one finally finds:\nA1(5)\nA2(5)\n\n! 12 \u0014 \u0002\n\u00033 \u0015 1\n2\n(R + M1 + M2 )(M1 + σ1 ) − Q1 (Q1 + Q2 )\n,\n= 4πσ1 L 1 +\nσ1 (R + σ1 + σ2 )(R + σ1 − σ2 )2\n! 12 \u0014 \u0002\np\n\u00033 \u0015 1\n2 + (σ + σ )2\n2\n(R + M1 + M2 )(M2 + σ2 ) − Q2 (Q1 + Q2 )\nr∞\n1\n2\n= 4πσ2 L 1 +\nσ1 + σ2\nσ2 (R + σ1 + σ2 )(R + σ2 − σ1 )2\np\n\n2 + (σ + σ )2\nr∞\n1\n2\nσ1 + σ2\n\n15\n\n\fAs a check of the correctness of the above formulae for the horizon areas, let us take for\ninstance M1 = Q1 = 0 and further send R → ∞. One readily checks that one obtains the\nhorizon area of the remaining black hole:\nr\nq\n3\n\nA2(5) = 4πL(M2 + σ2 ) 2\n\nσ2 +\n\n2 + σ2\nr∞\n2\n\n(69)\n\nas expected.\nIn order to compute the Hawking temperature we shall use the definition in terms of\nthe surface gravity, which is generally defined as k 2 = − 12 ξ a;b ξa;b , where ξ = ∂/∂t is the\ncanonically normalized timelike Killing vector. From the general expressions in (28) one can\ndeduce that near each black hole horizon one has the following expansions:\nf ̃ = F (z)ρ2 + O(ρ3 ),\n\ne2μ̃ = X(z)f ̃ + O(ρ3 ).\n\n(70)\n\nReplacing these expressions into the four-dimensional8 surface gravity and taking the ρ → 0\nlimit one finds the particularly simple result:\ns\nF (z)\nk(4) =\n.\n(71)\nX(z)\nLet us note at this point that the above expression for the surface gravity is actually independent of z as expected (since it should be constant on the black hole horizon) and one can\nconfirm this by computing:\ns\nX(z)\n1\n(ρf ̃−1 eμ̃ )|ρ=0 =\n,\n(72)\n=\nF (z)\nk(4)\ni\nwhich is manifestly constant according to (65). Then the Hawking temperature is T(4)\n=\nand one obtains:\ni\nk(4)\nAi(4)\n\n8πG(4)\n\n=\n\nσi\n,\n2G(4)\n\ni\nk(4)\n\n2π\n\n(73)\n\nwhere G(4) = G/L is Newton's constant in four dimensions.\nIf one computes the surface gravity for the five-dimensional solution one obtains the\nsimple form:\n3\npi\ni\ni\nk(5)\n= √ (k(4)\n)4 .\nΣ0\n\n(74)\n\nIt is now an easy matter to check that:\ni\nAi(5) k(5)\n\n8πG\n8\n\n=\n\ni\nk(4)\nAi(4)\nLσi\nσi\n=\n.\n=\n2G\n2G(4)\n8πG(4)\n\nThis is computed using the seed metric in four dimensions.\n\n16\n\n(75)\n\n\fIt is now apparent that the individual Smarr relations for each black hole:\n!\ni\nAi(5) k(5)\ni\n2MK = 3\n+ 2Φi Qi\n8πG\n\n(76)\n\nare satisfied and moreover they are equivalent to the Smarr relations in the initial fourdimensional seed as advertised.\nFinally, making use of the relationship between the total Komar mass and the mass\ncomputed in the counterterm approach, one can rewrite the Smarr relation for the double\nKK black hole as:\n!\n2\n1\nA2(5) k(5)\nA1(5) k(5)\n+ T L + 2(Φ1 Q1 + Φ2 Q2 )\n(77)\n+\n2M = 3\n8πG\n8πG\nFor a single KK black hole this Smarr relation reduces to the one previously obtained in\n[54] as expected.\n\n4\n\nConclusions\n\nBy using a simple modification of novel solution generation technique described in [74], we\nwere able to construct the general non-extremally charged KK multi-black hole solutions\nin five dimensions. In particular, this new technique provides us with a mapping between\nstatic charged four-dimensional solutions of the Einstein-Maxwell system to five-dimensional\ncharged and static Einstein-Maxwell-dilaton solutions with KK asymptotics. While the\ngeneral solution of the EMD system can be read in (18), in this paper, when discussing\nthe generated solutions we focused for simplicity on Einstein-Maxwell theory, for which the\ncoupling constant α = 0 in the general solution (18) vanishes.\nIn Section 2 we described this solution generating technique, while in Section 3 we generated KK multi-black hole systems in five dimensions. In the single KK black hole case, it\nturns out that, instead of using the charged black hole with spherical symmetry as the initial\nseed, in order to obtain sensible results one has to use the charged single black string solution. Motivated by this result, we then used as seed the general double black string solution\nin an asymptotically flat background in order to generate the general charged double-black\nhole solution in the KK background. We investigated the conical singularity structure of the\nfinal solution and we also showed how to recover several known solutions as particular cases.\nIn particular we showed that the unconstrained limit yields 2 extremal black string solutions\nbut the alternate limit, in which one takes the limit with the constraints that 2c2 σ1 ≡ N1\nand 2c2 σ2 ≡ N2 are fixed yields another, the extremal double black hole solution. Finally,\nwe computed its conserved charges at infinity and discussed at length its thermodynamic\nproperties. In particular, based on the previous results recently derived in [81] for the initial\nfour-dimensional seed solution, we proved the general Smarr relation for the double black\nhole system in five dimensions.\nAs avenues for further work, it would be interesting to identify the seed solution which\nwill lead to the construction of a black ring system in the KK-background. This last solution\n17\n\n\fhas been recently constructed in [45] and one should be able to recover it using the methods\npresented in this paper.\nAnother interesting possibility is to extend the analysis of [82] to five dimensions and find\nan embedding of the KK multi-black hole solution in string theory. Using the effective string\ndescription one should be able to compute for instance the entropy, including the corrections\nassociated with the interaction among the black holes.\n\nAcknowledgements\nThis work was supported by the Natural Sciences and Engineering Council of Canada.\nCS would like to thank Eugen Radu for interesting remarks on the manuscript.\n\nReferences\n[1] R. Emparan and H. S. Reall, Phys. Rev. D 65, 084025 (2002) [arXiv:hep-th/0110258].\n[2] T. Harmark, Phys. Rev. D 70, 124002 (2004) [arXiv:hep-th/0408141].\n[3] E. Cremmer, B. Julia, H. Lu and C. N. Pope, [arXiv:hep-th/9909099].\n[4] H. Stephani, D. Kramer, M. MacCallum, C. Hoenselaers and E. Herlt,\"Exact solutions\nof Einstein's field equations\" Cambridge University Press, 2003.\n[5] R. Emparan and H. S. Reall, Phys. Rev. Lett. 88, 101101 (2002) [arXiv:hep-th/0110260].\n[6] R. Emparan and H.\n[arXiv:hep-th/0608012].\n\nS.\n\nReall,\n\nClass.\n\nQuant.\n\nGrav.\n\n23,\n\nR169\n\n(2006)\n\n[7] R. Emparan and H. S. Reall, Living Rev. Rel. 11, 6 (2008) [arXiv:0801.3471 [hep-th]].\n[8] J. L. Friedman, K. Schleich and D. M. Witt, Phys. Rev. Lett. 71, 1486 (1993) [Erratumibid. 75, 1872 (1995)] [arXiv:gr-qc/9305017].\n[9] G. J. Galloway, K. Schleich, D. M. Witt and E. Woolgar, Phys. Rev. D 60, 104039\n(1999) [arXiv:gr-qc/9902061].\n[10] G. J. Galloway, K. Schleich, D. Witt and E. Woolgar, Phys. Lett. B 505, 255 (2001)\n[arXiv:hep-th/9912119].\n[11] M. l. Cai and G. J.\n[arXiv:hep-th/0102149].\n\nGalloway,\n\nClass.\n\nQuant.\n\nGrav.\n\n18,\n\n[12] H. Elvang, Phys. Rev. D 68, 124016 (2003) [arXiv:hep-th/0305247].\n[13] R. Emparan, JHEP 0403, 064 (2004) [arXiv:hep-th/0402149].\n[14] S. S. Yazadjiev, Phys. Rev. D 73, 104007 (2006) [arXiv:hep-th/0602116].\n[15] S. S. Yazadjiev, JHEP 0607, 036 (2006) [arXiv:hep-th/0604140].\n18\n\n2707\n\n(2001)\n\n\f[16] S. S. Yazadjiev, Gen. Rel. Grav. 39, 601 (2007) [arXiv:hep-th/0607101].\n[17] H. Iguchi and T. Mishima, Phys. Rev. D 73, 121501 (2006) [arXiv:hep-th/0604050].\n[18] S. Tomizawa, H. Iguchi and T. Mishima, Phys. Rev. D 74, 104004 (2006)\n[arXiv:hep-th/0608169].\n[19] H. Iguchi and T. Mishima, Phys. Rev. D 75, 064018 (2007) [Erratum-ibid. D 78, 069903\n(2008)] [arXiv:hep-th/0701043].\n[20] S. Tomizawa and M. Nozawa, Phys. Rev. D 73, 124034 (2006) [arXiv:hep-th/0604067].\n[21] T. Koikawa, Prog. Theor. Phys. 114, 793 (2005) [arXiv:hep-th/0501248].\n[22] A. A. Pomeransky, Phys. Rev. D 73, 044004 (2006) [arXiv:hep-th/0507250].\n[23] T. Azuma and T. Koikawa, Prog. Theor. Phys. 116, 319 (2006) [arXiv:hep-th/0512350].\n[24] T. Mishima and H. Iguchi, Phys. Rev. D 73, 044030 (2006) [arXiv:hep-th/0504018].\n[25] S. Tomizawa, Y. Morisawa and Y. Yasui, Phys. Rev. D 73, 064009 (2006)\n[arXiv:hep-th/0512252].\n[26] Y. Morisawa, S. Tomizawa and Y. Yasui, Phys. Rev. D 77, 064019 (2008)\n[arXiv:0710.4600 [hep-th]].\n[27] H. Elvang and P. Figueras, JHEP 0705, 050 (2007) [arXiv:hep-th/0701035].\n[28] A. A. Pomeransky and R. A. Sen'kov, [arXiv:hep-th/0612005].\n[29] J. P. Gauntlett and J. B. Gutowski,\n[arXiv:hep-th/0408010].\n\nPhys. Rev. D 71 (2005) 025013\n\n[30] J. P. Gauntlett and J. B. Gutowski,\n[arXiv:hep-th/0408122].\n\nPhys. Rev. D 71,\n\n045002 (2005)\n\n[31] J. Evslin and C. Krishnan, Class. Quant. Grav. 26, 125018 (2009) [arXiv:0706.1231\n[hep-th]].\n[32] S. S. Yazadjiev, Phys. Rev. D 76, 064011 (2007) [arXiv:0705.1840 [hep-th]].\n[33] H. Elvang and M. J. Rodriguez, JHEP 0804, 045 (2008) [arXiv:0712.2425 [hep-th]].\n[34] H. Elvang, R. Emparan\n[arXiv:hep-th/0702111].\n\nand\n\nP.\n\nFigueras,\n\nJHEP\n\n0705,\n\n056\n\n[35] D. Ida and Y. Uchida, Phys. Rev. D 68, 104014 (2003) [arXiv:gr-qc/0307095].\n[36] J. Mei and C. N. Pope, Phys. Lett. B 658, 64 (2007) [arXiv:0709.0559 [hep-th]].\n[37] P. Dobiasch and D. Maison, Gen. Rel. Grav. 14, 231 (1982).\n19\n\n(2007)\n\n\f[38] G. W. Gibbons and D. L. Wiltshire, Annals Phys. 167, 201 (1986) [Erratum-ibid. 176,\n393 (1987)].\n[39] D. Rasheed, Nucl. Phys. B 454, 379 (1995) [arXiv:hep-th/9505038].\n[40] F. Larsen, Nucl. Phys. B 575, 211 (2000) [arXiv:hep-th/9909102].\n[41] R. D. Sorkin, Phys. Rev. Lett. 51, 87 (1983).\n[42] D. J. Gross and M. J. Perry, Nucl. Phys. B 226, 29 (1983).\n[43] J. Ford, S. Giusto, A. Peet and A. Saxena, Class. Quant. Grav. 25, 075014 (2008)\n[arXiv:0708.3823 [hep-th]].\n[44] S. Giusto and A. Saxena, Class. Quant. Grav. 24, 4269 (2007) [arXiv:0705.4484 [hepth]].\n[45] J. Camps, R. Emparan, P. Figueras, S. Giusto and A. Saxena, JHEP 0902, 021 (2009)\n[arXiv:0811.2088 [hep-th]].\n[46] D. Maison, Lect. Notes Phys. 540, 273 (2000).\n[47] H. Ishihara and K.\n[arXiv:hep-th/0510094].\n\nMatsuno,\n\nProg.\n\nTheor.\n\nPhys.\n\n116,\n\n417\n\n(2006)\n\n[48] Y. Brihaye and E. Radu, Phys. Lett. B 641, 212 (2006) [arXiv:hep-th/0606228].\n[49] T. Wang, Nucl. Phys. B 756, 86 (2006) [arXiv:hep-th/0605048].\n[50] T. Nakagawa, H. Ishihara, K. Matsuno and S. Tomizawa, Phys. Rev. D 77, 044040\n(2008) [arXiv:0801.0164 [hep-th]].\n[51] S. Tomizawa, H. Ishihara, K. Matsuno and T. Nakagawa, Prog. Theor. Phys. 121, 823\n(2009) [arXiv:0803.3873 [hep-th]].\n[52] K. Matsuno, H. Ishihara, T. Nakagawa and S. Tomizawa, Phys. Rev. D 78, 064016\n(2008) [arXiv:0806.3316 [hep-th]].\n[53] S. Tomizawa and A. Ishibashi, Class. Quant. Grav. 25, 245007 (2008) [arXiv:0807.1564\n[hep-th]].\n[54] C. Stelea, K. Schleich and D. Witt, Phys. Rev. D 78, 124006 (2008) [arXiv:0807.4338\n[hep-th]].\n[55] A. Bouchareb, G. Clement, C. M. Chen, D. V. Gal'tsov, N. G. Scherbluk and T. Wolf,\nPhys. Rev. D 76, 104032 (2007) [arXiv:0708.2361 [hep-th]].\n[56] G. Clement, J. Math. Phys. 49, 042503 (2008) [Erratum-ibid. 49, 079901 (2008)]\n[arXiv:0710.1192 [gr-qc]].\n\n20\n\n\f[57] G. Clement, arXiv:0811.0691 [hep-th].\n[58] D. V. Galtsov, Prog. Theor. Phys. Suppl. 172, 121 (2008) [arXiv:0901.0098 [gr-qc]].\n[59] D. V. Gal'tsov and N. G. Scherbluk, Phys. Rev. D 78, 064033 (2008) [arXiv:0805.3924\n[hep-th]].\n[60] G. Compere, S. de Buyl, E. Jamsin and A. Virmani, Class. Quant. Grav. 26, 125016\n(2009) [arXiv:0903.1645 [hep-th]].\n[61] S. Tomizawa, Y. Yasui and Y. Morisawa, Class. Quant. Grav. 26, 145006 (2009)\n[arXiv:0809.2001 [hep-th]].\n[62] D. V. Gal'tsov and N. G. Scherbluk, Phys. Rev. D 79, 064020 (2009) [arXiv:0812.2336\n[hep-th]].\n[63] Y. Chen and E. Teo, arXiv:1011.6464 [hep-th].\n[64] R. C. Myers, Phys. Rev. D 35, 455 (1987).\n[65] M. J. Duff and J. X. Lu, Nucl. Phys. B 416, 301 (1994) [arXiv:hep-th/9306052].\n[66] H. Ishihara, M. Kimura, K. Matsuno and S. Tomizawa, Class. Quant. Grav. 23, 6919\n(2006) [arXiv:hep-th/0605030].\n[67] H. Elvang, R. Emparan, D. Mateos and H. S. Reall, JHEP 0508, 042 (2005)\n[arXiv:hep-th/0504125].\n[68] B. Chng, R. Mann, E. Radu and C. Stelea, JHEP 0812, 009 (2008) [arXiv:0809.0154\n[hep-th]].\n[69] V. S. Manko, Phys. Rev. D 76, 124032 (2007) [arXiv:0710.2158 [gr-qc]].\n[70] H. S. Tan and E. Teo, Phys. Rev. D 68, 044021 (2003) [arXiv:hep-th/0306044].\n[71] E. Teo, Phys. Rev. D 68, 084003 (2003) [arXiv:hep-th/0307188].\n[72] E. Teo, Phys. Rev. D 73, 024016 (2006) [arXiv:hep-th/0511007].\n[73] J. Kunz and S. Yazadjiev, Phys. Rev. D 79, 024010 (2009) [arXiv:0811.0730 [hep-th]].\n[74] B. Chng, R. B. Mann and C. Stelea,\n[arXiv:gr-qc/0608092].\n\nPhys. Rev. D 74,\n\n084031 (2006)\n\n[75] D. V. Galtsov, A. A. Garcia and O. V. Kechkin, Class. Quant. Grav. 12, 2887 (1995)\n[arXiv:hep-th/9504155].\n[76] Y. Chen and E. Teo, Nucl. Phys. B 838, 207 (2010) [arXiv:1004.2750 [gr-qc]].\n[77] R. B. Mann and C. Stelea, Phys. Lett. B 634, 531 (2006) [arXiv:hep-th/0511180].\n21\n\n\f[78] D. Kastor and J. Traschen, JHEP 0609, 022 (2006) [arXiv:hep-th/0607051].\n[79] T. Harmark and N. A. Obers, JHEP 0405, 043 (2004) [arXiv:hep-th/0403103].\n[80] G. W. Gibbons and K. i. Maeda, Nucl. Phys. B 298, 741 (1988).\n[81] V. S. Manko, E. Ruiz and J. Sanchez-Mondragon, Phys. Rev. D 79, 084024 (2009)\n[arXiv:0811.2029 [gr-qc]].\n[82] M. S. Costa and M. J. Perry, Nucl. Phys. B 591, 469 (2000) [arXiv:hep-th/0008106].\n\n22\n\n\f"}