{"id": "http://arxiv.org/abs/1112.2338v2", "guidislink": true, "updated": "2012-02-14T08:01:51Z", "updated_parsed": [2012, 2, 14, 8, 1, 51, 1, 45, 0], "published": "2011-12-11T09:26:07Z", "published_parsed": [2011, 12, 11, 9, 26, 7, 6, 345, 0], "title": "Unitarity of Weyl-Invariant New Massive Gravity and Generation of\n  Graviton Mass via Symmetry Breaking", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1112.0070%2C1112.5315%2C1112.2044%2C1112.4543%2C1112.3149%2C1112.3824%2C1112.5197%2C1112.0343%2C1112.1204%2C1112.0776%2C1112.0172%2C1112.3400%2C1112.3285%2C1112.1808%2C1112.5844%2C1112.1966%2C1112.2338%2C1112.0139%2C1112.2940%2C1112.2613%2C1112.5136%2C1112.0848%2C1112.0114%2C1112.3311%2C1112.2079%2C1112.6350%2C1112.4382%2C1112.1521%2C1112.5964%2C1112.4228%2C1112.4970%2C1112.4209%2C1112.3701%2C1112.5242%2C1112.4269%2C1112.0505%2C1112.4881%2C1112.6059%2C1112.5158%2C1112.0800%2C1112.0145%2C1112.4082%2C1112.3924%2C1112.4690%2C1112.5345%2C1112.2059%2C1112.5283%2C1112.1391%2C1112.2293%2C1112.4923%2C1112.1620%2C1112.3964%2C1112.5523%2C1112.5410%2C1112.4042%2C1112.3909%2C1112.2402%2C1112.5488%2C1112.4283%2C1112.6278%2C1112.6039%2C1112.0072%2C1112.0562%2C1112.6332%2C1112.3919%2C1112.3021%2C1112.5117%2C1112.6286%2C1112.3118%2C1112.2018%2C1112.3119%2C1112.2255%2C1112.2721%2C1112.0038%2C1112.0115%2C1112.6175%2C1112.5709%2C1112.6056%2C1112.2356%2C1112.5316%2C1112.3423%2C1112.1579%2C1112.0595%2C1112.0836%2C1112.2352%2C1112.6264%2C1112.6081%2C1112.0534%2C1112.5779%2C1112.4093%2C1112.2731%2C1112.5768%2C1112.0926%2C1112.3704%2C1112.5425%2C1112.1277%2C1112.2924%2C1112.6022%2C1112.3112%2C1112.4028%2C1112.0548&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Unitarity of Weyl-Invariant New Massive Gravity and Generation of\n  Graviton Mass via Symmetry Breaking"}, "summary": "We give a detailed analysis of the particle spectrum and the perturbative\nunitarity of the recently introduced Weyl-invariant version of the new massive\ngravity in 2+1 dimensions. By computing the action up to second order in the\nfluctuations of the metric, the gauge and the scalar fields around the anti-de\nSitter (AdS) and flat vacua, we find that the theory describes unitary (tachyon\nand ghost-free) massive spin-2, massive (or massless) spin-1 and massless\nspin-0 excitations for certain ranges of the dimensionless parameters. The\ntheory is not unitary in de Sitter space. Scale invariance is either broken\nspontaneously (in AdS background) or radiatively (in flat background) and hence\nthe masses of the particles are generated either spontaneously or at the second\nloop order.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1112.0070%2C1112.5315%2C1112.2044%2C1112.4543%2C1112.3149%2C1112.3824%2C1112.5197%2C1112.0343%2C1112.1204%2C1112.0776%2C1112.0172%2C1112.3400%2C1112.3285%2C1112.1808%2C1112.5844%2C1112.1966%2C1112.2338%2C1112.0139%2C1112.2940%2C1112.2613%2C1112.5136%2C1112.0848%2C1112.0114%2C1112.3311%2C1112.2079%2C1112.6350%2C1112.4382%2C1112.1521%2C1112.5964%2C1112.4228%2C1112.4970%2C1112.4209%2C1112.3701%2C1112.5242%2C1112.4269%2C1112.0505%2C1112.4881%2C1112.6059%2C1112.5158%2C1112.0800%2C1112.0145%2C1112.4082%2C1112.3924%2C1112.4690%2C1112.5345%2C1112.2059%2C1112.5283%2C1112.1391%2C1112.2293%2C1112.4923%2C1112.1620%2C1112.3964%2C1112.5523%2C1112.5410%2C1112.4042%2C1112.3909%2C1112.2402%2C1112.5488%2C1112.4283%2C1112.6278%2C1112.6039%2C1112.0072%2C1112.0562%2C1112.6332%2C1112.3919%2C1112.3021%2C1112.5117%2C1112.6286%2C1112.3118%2C1112.2018%2C1112.3119%2C1112.2255%2C1112.2721%2C1112.0038%2C1112.0115%2C1112.6175%2C1112.5709%2C1112.6056%2C1112.2356%2C1112.5316%2C1112.3423%2C1112.1579%2C1112.0595%2C1112.0836%2C1112.2352%2C1112.6264%2C1112.6081%2C1112.0534%2C1112.5779%2C1112.4093%2C1112.2731%2C1112.5768%2C1112.0926%2C1112.3704%2C1112.5425%2C1112.1277%2C1112.2924%2C1112.6022%2C1112.3112%2C1112.4028%2C1112.0548&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We give a detailed analysis of the particle spectrum and the perturbative\nunitarity of the recently introduced Weyl-invariant version of the new massive\ngravity in 2+1 dimensions. By computing the action up to second order in the\nfluctuations of the metric, the gauge and the scalar fields around the anti-de\nSitter (AdS) and flat vacua, we find that the theory describes unitary (tachyon\nand ghost-free) massive spin-2, massive (or massless) spin-1 and massless\nspin-0 excitations for certain ranges of the dimensionless parameters. The\ntheory is not unitary in de Sitter space. Scale invariance is either broken\nspontaneously (in AdS background) or radiatively (in flat background) and hence\nthe masses of the particles are generated either spontaneously or at the second\nloop order."}, "authors": ["M. Reza Tanhayi", "Suat Dengiz", "Bayram Tekin"], "author_detail": {"name": "Bayram Tekin"}, "author": "Bayram Tekin", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1103/PhysRevD.85.064008", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1112.2338v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1112.2338v2", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "11 pages, Einstein-frame version of the Weyl-invariant quadratic\n  gravity added in Appendix B. To appear in Phys. Rev. D", "arxiv_primary_category": {"term": "hep-th", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "hep-th", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "gr-qc", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "hep-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1112.2338v2", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1112.2338v2", "journal_reference": null, "doi": "10.1103/PhysRevD.85.064008", "fulltext": "Unitarity of Weyl-Invariant New Massive Gravity and Generation of Graviton\nMass via Symmetry Breaking\nM. Reza Tanhayi,1, 2, ∗ Suat Dengiz,1 , † and Bayram Tekin1, ‡\n1\n\narXiv:1112.2338v2 [hep-th] 14 Feb 2012\n\nDepartment of Physics,\nMiddle East Technical University, 06531, Ankara, Turkey\n2\nDepartment of Physics,\nIslamic Azad University Central Tehran Branch, Tehran, Iran\n(Dated: May 26, 2018)\nWe give a detailed analysis of the particle spectrum and the perturbative unitarity of the\nrecently introduced Weyl-invariant version of the new massive gravity in 2+1 dimensions.\nBy computing the action up to second order in the fluctuations of the metric, the gauge\nand the scalar fields around the anti-de Sitter (AdS) and flat vacua, we find that the theory\ndescribes unitary (tachyon and ghost-free) massive spin-2, massive (or massless) spin-1 and\nmassless spin-0 excitations for certain ranges of the dimensionless parameters. The theory\nis not unitary in de Sitter space. Scale invariance is either broken spontaneously (in AdS\nbackground) or radiatively (in flat background) and hence the masses of the particles are\ngenerated either spontaneously or at the second loop order.\n\nI.\n\nINTRODUCTION\n\nEinstein's general relativity (GR) is expected to be modified at both large (astrophysical) (IR)\nand small (UV) regions. There are ample theoretical (in the case of UV) and experimental (in\nthe case of IR) reasons to conclude that GR can only be an effective theory that works perfectly\nin the intermediate regions, such as the solar system and etc. Apriori, the nature of UV and\nIR modifications is quite different. For UV modifications, experience from quantum field theory\ndictates that if one is to define a perturbatively well-behaved (that is renormalizable and unitary)\ngravity theory, then one must introduce higher powers of curvature that modify both the tree-level\npropagator structure and the interactions. Unfortunately, it is well-known that such a theory simply\ndoes not exist in four dimensions [1]. On the other extreme, IR modifications consist of introducing\na cosmological constant and/or mass to the graviton. Even though, theoretically, cosmological\nEinstein theory is the easiest extension of GR, the problems with the cosmological constant are\nwell-known (such as the difficulty of keeping it small in the quantum theory). Graviton mass on the\nother hand is a very subtle issue. Given a massless free spin-2 field about a maximally symmetric\nbackground, one can introduce the Fierz-Pauli term respecting the background symmetries to get\na massive spin-2 field. But such a theory does not seem to arise from a diffeomorphism invariant\ninteracting gravity theory save the unique case of the 2+1 dimensions.\nFor D = 2 + 1 dimensions, new massive gravity (NMG) introduced in [2] provides a non-linear\nextension of the Fierz-Pauli massive spin-2 theory. For the mostly plus signature the action reads1\nˆ\n√ h\n1 \u0010 2\n3 \u0011i\n1\n− R2 ,\n(1)\nIN M G = 2 d3 x −g σR − 2λm2 + 2 Rμν\nκ\nm\n8\n∗\n\nElectronic address: m_tanhayi@iauctb.ac.ir\nElectronic address: suat.dengiz@metu.edu.tr\n‡\nElectronic address: btekin@metu.edu.tr\n1\nTo have a maximally symmetric vacuum one must have λ > -1 and one can normalize σ 2 = 1 in NMG. On the other\nhand, λ = 0 and σ should be free in the Weyl-invariant version, since the numerical values of various couplings\nplay a key role in the unitarity analysis.\n†\n\n\f2\nwhich attracted a lot of attention: Detailed works on it appeared in [2–9] regarding its unitarity,\nsolutions and etc. Remarkably, higher curvature terms in this theory provide in some sense both\nthe viable UV and IR modifications that one is interested in. Unfortunately, this state of happy\naffairs do not extend to four dimensions. But in any case, 2+1 dimensional gravity is a valuable\ntheoretical lab for ideas in quantum gravity. [In fact, according to the proposal of Horava for which\nspacetime's spectral dimension reduces at high energies, 3D gravity becomes much more relevant\nand NMG appears as part of the non-covariant 3+1 dimensional action [10].]\nHaving understood that NMG describes a consistent parity-invariant2 massive spin-2 theory in\n2+1 dimensions, the next natural question is to ask if graviton mass can be generated from breaking\na symmetry (not diffeomorphism invariance) in this theory in analogy with the Higgs mechanism\nin the Standard Model. This question was answered in the affirmative recently in [12] by finding a\nlocal scale-invariant (Weyl-invariant) version of NMG and showing that in the case of (A)dS space,\nthe vacuum breaks the conformal symmetry spontaneously and for flat space conformal symmetry\nis broken at the two loop level [13] via the Coleman-Weinberg mechanism [14]. Referring to [12]\nfor the details of how the Weyl-invariant extension of NMG (and other higher curvature models,\nsuch as the Born-Infeld NMG [15]) was introduced and how symmetry gets broken, here we just\nquote the final expression\nˆ\n\u001a\n\u0010\n\u0011\n3 √\nSW N M G = d x −g σΦ2 R − 4∇ * A − 2A2\n+Φ\n\n−2\n\n\u0014\n\n3\n2\nRμν\n− R2 − 2Rμν ∇μ Aν + 2Rμν Aμ Aν\n8\n1\n2\n+ (∇μ Aν )2\n+ R ∇ * A − RA2 + 2Fμν\n2\n\u0015\u001b\n1 4\nμ ν\n2\n− 2Aμ Aν ∇ A − (∇ * A) + A\n+ S Φ + S Aμ ,\n2\n\nwhere SΦ and SAμ are the Weyl-invariant scalar and gauge field actions, which are given by\nˆ\n\u001b\n\u001a\u0010\n\u00112\n1\n1\n6\n3 √\nd x −g ∂μ Φ − Aμ Φ + νΦ ,\nSΦ = −\n2\n2\nˆ\n√\n2\nSAμ = β d3 x −g Φ−2 Fμν\n.\n\n(2)\n\n(3)\n\nThe action (2) is invariant under the simultaneous transformation of the metric and the fields as\n′\n\ngμν → gμν = e2ζ(x) gμν ,\n\n′\n\nΦ → Φ = e−\n\n(n−2)\nζ(x)\n2\n\nΦ,\n\n′\n\nAμ → Aμ = Aμ − ∂μ ζ(x).\n\n(4)\n\nIt is important to note that there are no dimensionful parameters in the theory, on the other\nhand, local scale invariance does not fix the relative numerical coefficients of various parts which\nare independently scale-invariant. Generically, up to a numerical scaling of the total action, there\nare 4 dimensionless parameters that one can introduce. By scaling the total action, we set the\ncoefficient of the kinetic part of the scalar action to its canonical non-ghost form and to keep\ncontact with the NMG, we take the numerical coefficient of the quadratic part of the action to be\n1 (this choice can easily be relaxed). Therefore, we have 3 dimensionless parameters σ, ν, β.\nThe Weyl-invariant theory (2) obviously is much larger than NMG (1) in the sense that when\n√\none sets Φ = m, ν = 2λ and Aμ = 0, at the level of the action, one recovers NMG (1), with a\n2\n\nParity non-invariant massive spin-2 theory with a single helicity degree of freedom, that is the Topologically\nMassive Gravity, was found in 1982 [11].\n\n\f3\nfixed gravitational coupling κ = m−1/2 and a fixed cosmological. [In fact all the dimensionful scales\n√\nare determined by the symmetry breaking order parameter < Φ >= Φ = m]. Let us consider\nthe infinite dimensional field space M = [gμν , Aμ , Φ] to be the space of all fields satisfying the field\n√\nequations derived from the action (2). It was shown in [12] that \"NMG-point\", that is [gμν , 0, m],\nis in M. Moreover, if one freezes the scalar and the gauge fields to these NMG-point values and\nconsider fluctuations just in the metric directions, one exactly gets the same spectrum as NMG\naround its AdS or flat vacua. This was shown in [12] but what was left out in that work and\nwhich will be remedied here, is a complete study of the second order fluctuations of all the fields\naround the NMG point (or the vacuum of the theory). Namely, apriori, the stability and unitarity\nof (2) is not clear for all allowed fluctuations in the metric, gauge and scalar field directions on\nM. The main task of this paper is to show that NMG-point is stable by proving that there are no\nghosts and tachyons in the particle spectrum of the Weyl-invariant action (2). Therefore, mass of\nthe graviton and the mass of the gauge field is consistently generated by the symmetry breaking\nmechanism of the conformal symmetry.\nThe layout of the paper is as follows: In section II, we first find the expansion of the action\nup to second order in the fields around the (A)dS or flat vacua. This section also discusses issues\nabout Jordan versus Einstein frame and the Weyl-invariant gauge-fixing in the gauge sector. In\nsection III, we decouple the fields and identify the masses and also the unitarity regions of the\ndimensionless parameters. We collect some useful computations in the appendices.\nII.\n\nQUADRATIC FLUCTUATIONS ABOUT THE VACUUM\n\nIn [12], the field equations coming from the action (2) and its vacuum solution were given. Here,\nwe do not depict the field equations, since they are rather lengthy, instead we note that the vacuum\nsolution (let us first take a dS or AdS vacuum, as the flat vacuum will follow these) is given as\n√\nAμvac = 0,\ngμν = ḡμν ,\n(5)\nΦvac = m,\nhere R̄μν = 2Λḡμν . And the cosmological constant satisfies3\nΛ2 + 4σm2 − νm4 = 0.\n\n(6)\n\nGiven m2 , generically, there are two vacua\nh\n\nΛ± = m2 − 2σ ±\n\np\n\ni\n\n4σ 2 + ν .\n\n(7)\n\nOur task now is to study the stability of these vacua and also study the particle spectrum of\nthe model. This can be achieved by considering the second order fluctuations about the vacuum\nfollowing from\n√\nAμ = τ AL\ngμν = ḡμν + τ hμν ,\n(8)\nΦ = m + τ ΦL ,\nμ,\nwhere we have introduced τ , a small dimensionless parameter to keep the track of the expansion\norders. In what follows, we will use the conventions given in [16]. The expansions of various\ncurvature terms are needed in the computations, so we collect them in Appendix A.\nSince the action (2) is highly complicated with fields coupled to each other, it is a non-trivial task\nto find the basic oscillators (free particles) of the theory. There are a couple of paths one can take.\n3\n\nHere we take the point of view that Φvac is given and Λ is determined, one can also take a different point of view\nthat Λ is given and Φvac is determined. See [12] for a discussion on this.\n\n\f4\nFor example, one can linearize field equations and try to decouple the fields. Or, one can transform\nthe action to the Einstein frame and then find the field equations and do the linearization. These\ntwo paths do not give an efficient way for the study of the spectrum. [See Appendix B for the\nEinstein frame version of the Weyl-invariant quadratic theory.] As a third way, one can directly\ncompute the action up to quadratic order in the fluctuations about its vacua, which we shall adopt\nhere. This will lead to coupled fields at the quadratic level. Then we will find a way to decouple\nthe basic free fields in the theory. This procedure is quite lengthy but there seems to be no way of\navoiding it and it is still easier than the above mentioned procedures. The action (2), after making\nuse of the field fluctuations (8) and the relevant formulas in the Appendix A, can be written as\n(1)\n\n(2)\n\nSW N M G = S̄W N M G + τ SW N M G + τ 2 SW N M G + O(τ 3 ),\n\n(9)\n\nwhere S̄W N M G is the value of action evaluated in the background which is irrelevant for our\n(1)\npurposes. On the other hand SW N M G vanishes in the vacuum, which also gives us the vacuum\nequations without going into the details of finding the full field equations [12]. Finally the quadratic\n(2)\npart SW N M G , after making use of the vacuum equations and dropping the boundary terms, reads\nas\nˆ\n\u001a\n\u0010\np\n1\n9Λ2\n15νm2 \u0011 2\n(2)\n3\n−\nΦL\nSW N M G = d x −ḡ − (∂μ ΦL )2 + 6σΛ −\n2\n2m2\n2\nΛ\nm\u0011 2\n1  ̄\n2β + 5 L 2 \u0010\n(Fμν ) − 2σm +\n+\n* AL )2\nAL − (∇\n+\n2m\nm\n8\nm\n(10)\n1 L 2 \u0010 σm\nΛ \u0011 μν L\n1 2\n+ (Gμν ) −\n−\nR\nh Gμν −\nm\n2\n4m\n8m L\n√ \u0011\n\u001b\n\u0010 √\nm L ̄\nΛ \u0011 L L \u0010 √\n4Λ\n+ 2σ m + √\nΦ R − 8σ m + √ +\nΦ ∇ * AL .\nm m\nm m\n2\nIn deriving the above expansion, in addition to the formulas in the Appendix, the following relations\nhave also been used\n\u0011\n\u0010\nΦL\nΦ2\nΦ2 = m 1 + 2τ √ + τ 2 L + O(τ 3 ) ,\nm\nm\n\n\u0010\n\n\u0011\n\n\u0010\n\n2\nγ\n ̄ μ AL\n∇μ Aν = τ ∇\nν − τ Γμν\n\n\u0011\n\nL\n\n3\nAL\nγ + O(τ ).\n\n(11)\n\nThe first thing to observe is that to have a non-ghost and canonically normalized (that is − 14 )\nkinetic term for the Maxwell field, we should set β = − 11\n4 , which we do from now on. As it stands,\nthe fields are still coupled and one should find a way to decouple them. Such a coupling between\nthe scalar field and the curvature is expected, since we are dealing with a non-minimally (in fact\nconformally) coupled scalar field to gravity. The scalar field also couples to the gauge field as\ndemanded by conformal invariance. To understand how one could decouple these fields in (10), let\nus study a simpler model (scalar-tensor theory) first, and then come back to our problem.\nA.\n\nQuadratic fluctuations and the spectrum of the conformally coupled scalar-tensor theory\n\nWe choose the 2+1 dimensional conformally coupled scalar-tensor action which is given by\nˆ\n√ \u0010\nν \u0011\n(12)\nSS−T = d3 x −g Φ2 R + 8∂μ Φ∂ μ Φ − Φ6 ,\n2\nand ask what the particle spectrum is around its (A)dS vacuum. By just inspecting the action,\none mistakingly namely think that the scalar field is a ghost since it comes with a negative kinetic\nenergy part. But this is actually a red-herring, since the action is in the Jordan frame one cannot\n\n\f5\ndraw such a conclusion from the full non-linear theory. One must either go to the Einstein frame\nwhere the fundamental degrees of freedom are more transparent or, in the Jordan frame, study the\nquadratic fluctuations of the fields around the vacuum. We will do both below.\nE (x), with Ω ≡ ( Φ )2 , the action (12) transUnder the conformal rescaling gμν (x) = Ω−2 (x)gμν\nΦ0\nforms into the Einstein frame, as\nˆ\nq\n\u0010\nν \u0011\nE\n(13)\nSS−T = d3 x −gE Φ20 RE − Φ40 ,\n2\nin which Φ0 is a constant and introduced in order to keep Ω dimensionless. Therefore, the\nconformally-coupled scalar field simply disappears and one is left with pure cosmological Einstein theory which has a massless spin-2 particle in its spectrum. How does one see this result in\nthe Jordan frame (which we need for our main problem). We take (12) and expand up to quadratic\norder in the scalar and tensor fields about the (A)dS vacuum to get\nˆ\n\u001a\nh\ni\np\n√\nν\nν\nSS−T = d3 x −ḡ 6mΛ − m3 + τ (3mΛ − )h + (12 m − 3νm5/2 )ΦL + m RL\n2\n4\nh 1\nν\n1\n1\nν\nL\n(14)\n+ τ 2 (− mΛ + m3 )h2μν − mhμν Gμν\n+ ( mΛ − m3 )h2\n2\n8\n2\n4\n16\ni\u001b\n√\n15\n+ 2 mRL ΦL + (6Λ − νm2 )Φ2L + 8(∂μ ΦL )(∂ μ ΦL ) .\n2\nAgain O(τ 0 ) part is not relevant. O(τ 1 ) part gives the vacuum of the theory, inserting the value\nof RL (Appendix) in the linear part and dropping the boundary terms, one obtains\nΛ=\n\nνm2\n.\n4\n\nUsing this value in the quadratic part results in\nˆ\n\u001a\n\u001b\np\n√\n1\n(2)\nL\n+ 2 mRL ΦL − 24ΛΦ2L + 8(∂μ ΦL )2 .\nSS−T = d3 x −ḡ − mhμν Gμν\n2\n\n(15)\n\n(16)\n\nBy the redefinition of tensor field as follows\ne μν − √4 ḡμν ΦL ,\nhμν ≡ h\nm\n\n(16) reduces to the linearized version of the cosmological Einstein theory\nˆ\np\n1\n(2)\nL\n.\nhμν Geμν\nSS−T = − m d3 x −ḡ e\n2\n\n(17)\n\n(18)\n\nAs it is clear, just like in the Einstein frame, here at the quadratic level of the Jordan frame, the\nconformally-coupled scalar field with the wrong-sign kinetic energy disappears in (18). We will use\na similar field redefinition in (10).\nB.\n\nWeyl-invariant gauge-fixing condition\n\nBefore we can identify the fundamental degrees of freedom, there is one more issue that we\nmust discuss: The gauge field in its locally Lorentz invariant form, has spurious (non-propagating)\ndegrees of freedom, which we must eliminate. This can be done with a Weyl-invariant gauge-fixing.\n\n\f6\nSuch a gauge condition can be found as follows: Let the gauge-covariant derivative act on the gauge\nfield as [12]\nDμ Aν ≡ ∇μ Aν + Aμ Aν .\n\n(19)\n\nUnder the transformations (4), in n dimensions, it is easy to show that the divergence transforms\nas\n\u0010\n\n\u0011\n\n(Dμ Aμ )′ = e−2ζ Dμ Aμ − Dμ ∂ μ ζ + (n − 3)(Aα ∂α ζ − ∂α ζ∂ α ζ) ,\n\n(20)\n\nso in 3 dimensions by setting Dμ ∂ μ ζ = 0, we have\n\n(Dμ Aμ )′ = e−2ζ (Dμ Aμ ).\n\n(21)\n\nTherefore, we can choose a Lorenz-like condition\nDμ Aμ = ∇ * A + A2 = 0,\n\n(22)\n\nas a Weyl-invariant gauge-fixing condition. It is important to note that Dμ ∂ μ ζ = 0 is also Weylinvariant. [This is a Weyl-invariant generalization of the leftover gauge-invariance, ∂ 2 ζ = 0, after\nthe usual Lorenz gauge ∂μ Aμ = 0 is chosen.] At the linear level, (22) reduces to the background\n ̄ * AL = 0.\ncovariant Lorenz condition: ∇\nThese tools are sufficient to decouple the fundamental degrees of freedom in (10) which we do\nin the next section.\nIII.\n\nPARTICLE SPECTRUM AND THEIR MASSES\n\nThe Weyl-invariant gauge-fixing term (22) at the linear level eliminates the cross term between\nthe gauge field and scalar field in (10). On the other hand, redefinition (17) works well in decoupling\nscalar and tensor fields, so at the end (10) becomes\nˆ\n\u001a\n\u0011\np\n8Λ\n1\u0010\nSeW N M G = d3 x −ḡ − 16σ + 2 + 1 (∂μ ΦL )2\n2\nm\n\u0010\n1\nΛ\nm\u0011 L 2\nL 2\n(23)\n−\n(Fμν\n) − 2σm +\n+\n(Aμ )\n4m\nm\n8\n\u001b\n\u0010 σm\nΛ \u0011e μν eL\n1 e2\n1 eL 2\n−\nR ,\n−\nh Gμν + (Gμν ) −\n2\n4m\nm\n8m L\nwhere we have used the following relations that arise after the field redefinition of (17)\n\ne L + √8 (✷Φ\ne μν )L + √2 (∇\n ̄ μ ∂ν ΦL + ḡμν ✷Φ\n ̄ L + 3ΛΦL ),\n ̄ L ), RL = R\n(Rμν )L =(R\nm\nm\n\u0011\n2 \u0010 ̄\nL\nL\n ̄ L − 2Λḡμν ΦL ,\n∇μ ∂ν ΦL − ḡμν ✷Φ\nGμν\n=Geμν\n+√\nm\n4 e\n16\n48\nL\nL\n ̄ L + ΛΦ2L ,\n+√ R\nhμν Gμν\n=e\nhμν Geμν\nΦL ✷Φ\nL ΦL +\nm\nm\nm\n8\n4\n40\n2 e\n48\nL 2\nL 2\ne L ΦL .\n ̄ L + √ ΛR\n ̄ L )2 + ΛΦL ✷Φ\n ̄ L + Λ2 Φ2L + √ R\n(Gμν\n) =(Geμν\n) + (✷Φ\nL ✷Φ\nm\nm\nm\nm\nm\n\n(24)\n\nThe expression (23) is what we were looking for to identify the fundamental excitations and their\nmasses. The first line shows that we have a unitary massless scalar field as long as we have a\nnon-ghost kinetic term which is guaranteed by\n16σ +\n\n8Λ\n+ 1 ≥ 0.\nm2\n\n(25)\n\n\f7\nIn fact, when the bound is saturated the scalar field ceases to be dynamical. The second line is\nthe action for a massive spin-1 field (a Proca field) which propagates 2 unitary degrees of freedom\nin 2+1 dimensions with mass-square\n1\nMA2 = (4σ + )m2 + 2Λ ≥ 0,\n4\n\n(26)\n\nwhich is exactly equal to the constraint on the kinetic energy of the scalar field (25). The third\nline needs a little more explanation, since the fundamental degrees of freedom are not transparent\nby a cursory look. But, the action is exactly what one gets from the linearization of the NMG\n(1) around its (A)dS vacuum [albeit with fixed ratios of dimensionful parameters]. There are two\nways to find that it describes a massive spin-2 field. The first way is to show with the help of an\nauxiliary field that the action reduces to the massive Fierz-Pauli spin-2 theory [2]. The second way\nis to explicitly decompose the hμν into its irreducible components and at the end express all the\nfundamental degrees of freedom as scalar fields [7]. These two pictures yield obviously the same\nresult showing that the third line of (23) describes a massive spin-2 field with mass-square\nMg2 = −σm2 +\n\nΛ\n.\n2\n\n(27)\n\nUnitarity of the massive spin-2 theory depends whether one is dealing with an AdS (Λ < 0 )\nor a dS (Λ > 0) background. For the AdS background, Breintenlohner-Freedman (BF) bound\n[17, 18] Mg2 ≥ Λ must be satisfied, on the other hand for the dS background, Higuchi [19] bound\nMg2 ≥ Λ > 0 must be satisfied. What we have not yet shown is that all the unitarity conditions\non the spin-0, spin-1 and the spin-2 fields are compatible with each other and with the condition\nthat the theory has a maximally symmetric vacuum (7). First of all one should notice that Λ+\ncorresponds to the dS and Λ− corresponds to the AdS spaces. It is easy to see that (27) is not\ncompatible with the dS branch, therefore the theory is not unitary in dS. On the other hand,\nconsidering all the conditions together, one finds that the theory is unitary in AdS with a massless\nspin-0, a massive spin-1 and a massive spin-2 field as long as4\n−\n\n1\n< σ ≤ 0,\n16\n1\n0<σ≤ ,\n16\n\n1\n(1 − 256σ 2 ),\n64\n1\n0 ≤ ν ≤ (1 − 256σ 2 ).\n64\n\n0<ν≤\n\n(28)\n\nOn the other hand, for AdS the theory has a massless spin-1 field, a massive spin-2 field (with\n2\nMg2 = − 3m\n16 ) (no scalar field) for\nσ=\n\n1\n,\n16\n\nν = 0,\n\nΛ− = −\n\nm2\n.\n4\n\n(29)\n\nFor flat vacuum the theory becomes unitary when\n−\n\n1\n≤ σ ≤ 0,\n16\n\nν = 0,\n\n(30)\n\nfor which generically the theory has a massless spin-0, massive spin-1 and massive spin-2 fields.\n1\nThere are two special points: for σ = − 16\n, there is no scalar field, there is a massless gauge field\nand a massive spin-2 field with mass Mg = m\n4 . For σ = 0, there is a massless spin-0, a massless\nspin-2 and a massive spin-1 field with MA = m\n2.\n4\n\nNote that negative ν is not allowed for the scalar field to have a viable potential with a lower bound. Moreover,\nfor ν = 0, the conformal symmetry cannot be broken since Coleman-Weinberg potential at any loop would vanish\nin the case of flat space, but in what follows below, we include this point to explore the full parameter range.\n\n\f8\nConclusions\n\nBy computing the action up to second order in all directions in the space of gauge and scalar\nfields and the metric, we have shown that the Weyl-invariant extension of NMG is a unitary theory\ngenerically describing a massive spin-2, a massive (or massless) spin-1 and a massless spin-0 field\naround its AdS and flat vacua. The mere existence of an AdS background spontaneously breaks the\nconformal symmetry and provides mass to the spin-1 and spin-2 fields in analogy with the Higgsmechanism. Breaking of the conformal symmetry also fixes all the relevant couplings between the\nfields. In flat space, dimensionful parameter (that is the expectation value of the scalar field) comes\nfrom dimensional transmutation in the quantum theory and the conformal symmetry is broken at\nthe two loop level [13] via the Coleman-Weinberg mechanism. Weyl-invariant version of NMG\nseems to be the only known toy model where a graviton mass is generated by the breaking of a\nsymmetry in such a way that the resultant mass has a non-linear, fully covariant, local extension\nin terms of quadratic curvature terms. In a separate work [20], we study the particle spectrum of\nsimilar Weyl-invariant quadratic theories in generic n-dimensions whose actions were introduced\nin [12]. It would also be interesting to add conformally coupled spin fields to these models.\nIV.\n\nACKNOWLEDGMENTS\n\nThe work of B.T. is supported by the TUBITAK Grant No. 110T339. S.D. is supported by\nTUBITAK Grant No. 109T748.\nAppendix A: Quadratic expressions of the curvature terms\n\nThis part compiles all the relevant tensors expanded up to second order around a background\n(ḡμν ). We take the expressions directly from [16] for generic n-dimensions. The metric perturbation\nhμν is defined as\ngμν = ḡμν − τ hμν + τ 2 hμρ hνρ + O(τ 3 ).\n\ngμν ≡ ḡμν + τ hμν ,\n\n(31)\n\nThe Christoffel connection can be expanded as\n\u0010\n\nΓρμν = Γ̄ρμν + τ Γρμν\n\n\u0011\n\nL\n\n\u0010\n\n− τ 2 hρβ Γβμν\n\n\u0011\n\nL\n\n+ O(τ 3 ),\n\n(32)\n\nfrom which follows the expansions of the Riemann and all the related tensors. We just need the\nfollowing expressions:\n\u0010\n\nΓρμν\n\n√\n\n−g =\n\n\u0011\n\nL\n\n\u0011\n\u0010\n1\n ̄ μ hνλ + ∇\n ̄ ν hμλ − ∇\n ̄ λ hμν ,\n= ḡρλ ∇\n2\n\u0014\n\n(33)\n\u0015\n\n\u0011\nτ\nτ2 \u0010 2\n−ḡ 1 + h +\nh − 2h2μν + O(τ 3 ) ,\n2\n8\n\np\n\n(34)\n\nwhere h = ḡμν hμν .\n\u0010\n\nRμ νρσ =R̄μ νρσ + τ Rμ νρσ\n− τ 2 ḡμα ḡβγ\n\n\u0014\u0010\n\n\u0011\n\nΓγρα\n\nL\n\n\u0011 \u0010\nL\n\n\u0010\n\n− τ 2 hμβ Rβ νρσ\nΓβσν\n\n\u0011\n\nL\n\n\u0010\n\n\u0011\n\n− Γγσα\n\nL\n\n\u0011 \u0010\nL\n\nΓβρν\n\n\u0011 \u0015\nL\n\n+ O(τ 3 ),\n\n(35)\n\n\f9\nwhere the linearized Riemann tensor is defined as follows\n\u0010\n\nRμ νρσ\n\n\u0011\n\nL\n\n=\n\n\u0011\n1\u0010  ̄  ̄ μ  ̄  ̄ μ  ̄  ̄ μ\n ̄ σ∇\n ̄ ρ hμν − ∇\n ̄ σ∇\n ̄ ν hμρ + ∇\n ̄ σ∇\n ̄ μ hρν .\n∇ρ ∇σ hν + ∇ρ ∇ν hσ − ∇ρ ∇ hσν − ∇\n2\n\n(36)\n\nThe quadratic expansion of the Ricci tensor follows as\n\u0010\n\nRνσ =R̄νσ + τ Rνσ\n2 μα\n\n− τ ḡ\n\nḡβγ\n\n\u0011\n\n\u0014\u0010\n\nL\n\n\u0010\n\n− τ 2 hμβ Rβ νμσ\n\nΓγμα\n\n\u0011 \u0010\nL\n\nΓβσν\n\n\u0011\n\nL\n\n−\n\n\u0011\n\nL\n\n\u0010\n\nΓγσα\n\n\u0011 \u0010\n\nΓβμν\n\nL\n\n\u0011 \u0015\nL\n\n(37)\n\n+ O(τ 3 ),\n\nwhere the linearized Ricci tensor is\nL\nRνσ\n=\n\n\u0011\n1\u0010  ̄  ̄ μ  ̄  ̄ μ\n ̄ σ∇\n ̄ νh .\n ̄ σν − ∇\n∇μ ∇σ hν + ∇μ ∇ν hσ − ✷h\n2\n\n(38)\n\nThe quadratic expansion of the curvature scalar is\n\u001a\n\n\u0010\n\nR = R̄ + τ RL + τ 2 R̄ρλ hαρ hαλ − hνσ Rνσ\nνσ μα\n\n− ḡ ḡ\n\nḡβγ\n\n\u0014\u0010\n\nΓγμα\n\n\u0011\n\nL\n\n\u0011 \u0010\nL\n\n\u0010\n\n− ḡνσ hμβ Rβ νμσ\n\nΓβσν\n\n\u0011\n\nL\n\n−\n\n\u0010\n\nΓγσα\n\n\u0011\n\n\u0011 \u0010\nL\n\nL\n\nΓβμν\n\n\u0011 \u0015\u001b\nL\n\n(39)\n3\n\n+ O(τ ),\n\nwhere\nL\nRL = ḡαβ Rαβ\n− R̄αβ hαβ .\n\n(40)\n\nThe linear form of the Einstein tensor that we frequently used in the text is\n2Λ\n1\nL\nhμν .\n= (Rμν )L − ḡμν RL −\nGμν\n2\nn−2\n\n(41)\n\nAppendix B: Weyl-invariant action in the Einstein frame\n\nHere we will transform Weyl-invariant new massive gravity (2), which is necessarily in the\nJordan frame to the Einstein frame. In what follows we will keep some of the computations in\nn-dimensions for the sake of generality and set n = 3 later. gμν (x) denotes the Jordan frame metric\nE (x) denotes the Einstein frame metric which are related as\nand gμν\nE\ngμν (x) = Ω−2 (x)gμν\n(x),\n\n√\n\nq\n\n−g = Ω−n −gE .\n\n(42)\n\nThe Riemann and the Ricci tensors and the curvature scalars in the two frames are related to each\nother, respectively as follows\nRμ νρσ [g] = (Rμ νρσ )E − 2δμ [σ ∇ρ] ∂ν ln Ω − 2gν[ρ ∇σ] ∂ μ ln Ω\n\nμ\nμ\n− 2∂[σ ln Ω δρ]\n∂ν ln Ω + 2gν[σ ∂ρ] ln Ω ∂ μ ln Ω + 2gν[ρ δσ]\n(∂λ ln Ω)2 .\n\nh\n\nE\nRνσ [g] = (Rνσ )E + (n − 2) ∇σ ∂ν ln Ω + ∂ν ln Ω ∂σ ln Ω − gνσ\n(∂λ ln Ω)2\nE\n+ gνσ\n✷ ln Ω.\n\n\u0010\n\n\u0011\n\nR[g] = Ω2 RE + 2(n − 1)✷ ln Ω − (n − 1)(n − 2)(∂λ ln Ω)2 .\n\ni\n\n(43)\n\n(44)\n\n(45)\n\n\f10\nFrom these we can get the invariant relevant for quadratic gravity as :\n2\n\n(Rμνρσ ) [g] = Ω\n\n4\n\n\u001a\n\nE\nE\nE\n(Rμνρσ\n)2 + 8(Rμν\n)∇μ ∂ ν ln Ω + 8(Rμν\n)∂ μ ln Ω ∂ ν ln Ω − 4RE (∂μ ln Ω)2\n\n+ 4(n − 2)(∇μ ∂ν ln Ω)2 + 4(✷ ln Ω)2 − 8(n − 2)✷ ln Ω(∂μ ln Ω)2\n\n\u001b\n\n(46)\n\n+ 8(n − 2)(∂μ ln Ω)(∂ν ln Ω)∇μ ∂ ν ln Ω + 2(n − 1)(n − 2)(∂μ ln Ω)4 ,\n(Rμν )2 [g] =\n\n\u001a\n\nE 2\nE\nE μ\nΩ4 (Rμν\n) + 2(n − 2)(Rμν\n)∇ν ∂ μ ln Ω + 2RE ✷ ln Ω + 2(n − 2)Rμν\n∂ ln Ω ∂ ν ln Ω\n\n− 2(n − 2)RE (∂μ ln Ω)2 + (n − 2)2 (∇ν ∂μ ln Ω)2 + (3n − 4)(✷ ln Ω)2\n\n(47)\n\n+ 2(n − 2)2 (∂μ ln Ω)(∂ν ln Ω)∇μ ∂ ν ln Ω − (4n − 6)(n − 2)✷ ln Ω(∂μ ln Ω)2\n2\n\n4\n\n+ (n − 2) (n − 1)(∂μ ln Ω)\nR2 [g] =\n\n\u001b\n\n,\n\n\u001a\n\nΩ4 (RE )2 + 4(n − 1)RE ✷ ln Ω − 2(n − 1)(n − 2)RE (∂μ ln Ω)2 + 4(n − 1)2 (✷ ln Ω)2\n\u001b\n\n(48)\n\n− 4(n − 1)2 (n − 2)✷ ln Ω(∂μ ln Ω)2 + (n − 1)2 (n − 2)2 (∂μ ln Ω)4 .\nAs noted in the text above equation (13) one should choose Ω ≡ ( ΦΦ0 )2 , where Φ0 is a dimensionful\nconstant which keeps the Einstein-frame metric dimensionless. Note that the mere requirement\nthat there is a transformation between the Jordan and the Einstein frame introduces a dimensionful constant and breaks the scaling symmetry. This symmetry breaking is not the spontaneous\nsymmetry breaking in the vacuum that we discussed in the bulk of the paper. With the help of\nthe above formulas, we can now write the Einstein frame version of the Weyl-invariant quadratic\ntheory (2) (not to clutter the notation, below we will drop the superscript E )\nˆ\n\u001a\nh\ni\n3 √\nS̃N M G = d x −g σΦ20 R − 8(∂μ ln Φ)2 + 8Aμ ∂μ ln Φ − 2A2\nh\n3 2\n2\nμ ν\nμ\nν\n+ Φ−2\n0 Rμν − R + 4Rμν ∇ ∂ ln Φ + 8Rμν ∂ ln Φ∂ ln Φ − 2R✷ ln Φ\n8\n− 2R(∇α ln Φ)2 + 4(∇μ ∂ν ln Φ)2 + 8(∇α ln Φ)4 − 4(✷ ln Φ)2\n\n+ 16(∇μ ∂ν ln Φ)∂ μ ln Φ∂ ν ln Φ − 8Rμν Aμ ∂ ν ln Φ\n1\n+ 2RAμ ∂μ ln Φ − RA2 + 2Rμν Aμ Aν + 4✷ ln Φ∇ * A\n2\n− 8∂μ ln Φ∂ν ln Φ∇μ Aν − 16Aμ ∂μ ln Φ(∂ν ln Φ)2\n\u0010\n\n\u0011\n\n− 4∇μ ∂ν ln Φ ∇μ Aν + 4Aμ ∂ ν ln Φ + 8(Aμ ∂μ ln Φ)2\n\n2\n+ 4(∇μ ∂ν ln Φ)Aμ Aν + 4A2 (∂μ ln Φ)2 + (2 + β)Fμν\n+ (∇μ Aν )2 − (∇.A)2\n\n\u0010\n\n\u0011\n\n+ 4∇μ Aν Aμ ∂ ν ln Φ + Aν ∂ μ ln Φ − 2Aμ Aν ∇μ Aν\n\n\u001b\n\ni\n1\n1 i 1 h\n− 4A2 Aμ ∂μ ln Φ + A4 − Φ20 (∂μ ln Φ)2 + A2 − Aμ ∂μ ln Φ + νΦ40 .\n2\n2\n4\n(49)\n\n\f11\nTo simplify5 this action let us define Φ = Φ0 eφ and Dμ φ ≡ ∂μ φ − 21 Aμ which is actually gauge\ninvariant since under the gauge transformations (4) φ → φ − 21 ζ(x). Then (49) becomes\nS̃N M G\n\n\u001a\n\ni\nh\n√\n1\n5\n1\n2\n= d x −g Φ20 σR − (8σ + )(Dμ φ)2 − νΦ40 + ( + β)Φ−4\n0 Fμν\n2\n2\n2\nh\n3\n2\n2\nμ\nν\n2\n4\n+ Φ−2\n0 Rμν − R + 4Rμν D φD φ − 2R(Dμ φ) + 8(Dα φ)\n8\n\nˆ\n\n3\n\ni\u001b\n\n+ 16(∇μ Dν φ)∂ μ φ∂ ν φ + 8Dμ φ∂ μ φ∇ * A − 2A2 ∇μ Dμ φ\n\n(50)\n\n.\n\nFrom this action, one can find the vacuum and study the excitations about it but this route,\nas we we noted in the text, is rather tedious compared to the Jordan frame action that we worked\nwith. More importantly, the Einstein-frame action is not scale invariant and hence the idea, put\nforward above and in [12], that graviton becomes massive after the scale symmetry gets broken\nspontaneously (or radiatively) needs to be reinterpreted.\n\n[1] K. S. Stelle, Phys. Rev. D 16, 953 (1977); Gen. Rel. Grav. 9, 353 (1978).\n[2] E. A. Bergshoeff, O. Hohm and P. K. Townsend, Phys. Rev. Lett. 102, 201301 (2009); Phys. Rev. D\n79, 124042 (2009).\n[3] I. Gullu and B. Tekin, Phys. Rev. D 80, 064033 (2009).\n[4] S. Deser, Phys. Rev. Lett. 103, 101302 (2009).\n[5] M. Nakasone and I. Oda, Prog. Theor. Phys. 121, 1389 (2009).\n[6] Y. Liu and Y. W. Sun, Phys. Rev. D 79, 126001 (2009).\n[7] I. Gullu, T. C. Sisman and B. Tekin, Phys. Rev. D 81, 104017 (2010).\n[8] I. Gullu, T. C. Sisman and B. Tekin, Phys. Rev. D 83, 024033 (2011).\n[9] H. Ahmedov and A. N. Aliev, Phys. Rev. Lett. 106, 021301 (2011).\n[10] P. Horava, Phys. Rev. D 79, 084008 (2009).\n[11] S. Deser, R. Jackiw and S. Templeton, Phys. Rev. Lett. 48, 975 (1982); Annals Phys. 140, 372 (1982).\n[12] S. Dengiz and B. Tekin, Phys. Rev. D 84, 024033 (2011).\n[13] P. N. Tan, B. Tekin and Y. Hosotani, Phys. Lett. B 388, 611 (1996); Nucl. Phys. B 502, 483 (1997).\n[14] S. R. Coleman and E. J. Weinberg, Phys. Rev. D 7, 1888 (1973).\n[15] I. Gullu, T. C. Sisman and B. Tekin, Class. Quant. Grav. 27, 162001 (2010).\n[16] I. Gullu, T. C. Sisman and B. Tekin, Phys. Rev. D 82, 124023 (2010).\n[17] P. Breitenlohner and D. Z. Freedman, Phys. Lett. B 115, 197 (1982).\n[18] A. R. Gover, A. Shaukat and A. Waldron, Nucl. Phys. B 812, 424 (2009).\n[19] A. Higuchi, Nucl. Phys. B 282, 397 (1987).\n[20] M. R. Tanhayi, S. Dengiz and B. Tekin, \"Weyl-Invariant Higher Curvature Gravity Theories in n\nDimensions,\" arXiv:1201.5068 [hep-th].\n\n5\n\nWe thank a very conscientious referee who not only suggested this simplification but also actully computed a\ndifferent version of it and offered several useful remarks on the rest of the paper.\n\n\f"}