{"id": "http://arxiv.org/abs/0712.1623v1", "guidislink": true, "updated": "2007-12-11T00:37:03Z", "updated_parsed": [2007, 12, 11, 0, 37, 3, 1, 345, 0], "published": "2007-12-11T00:37:03Z", "published_parsed": [2007, 12, 11, 0, 37, 3, 1, 345, 0], "title": "Multidomain lithium niobate microcantilever for smart biosensor", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0712.2158%2C0712.1910%2C0712.4027%2C0712.0452%2C0712.0203%2C0712.0189%2C0712.0326%2C0712.0055%2C0712.4230%2C0712.3000%2C0712.0327%2C0712.1482%2C0712.4144%2C0712.0851%2C0712.3448%2C0712.2225%2C0712.0785%2C0712.0491%2C0712.4270%2C0712.3994%2C0712.1116%2C0712.3403%2C0712.3130%2C0712.0263%2C0712.2739%2C0712.1429%2C0712.3569%2C0712.2829%2C0712.3495%2C0712.3856%2C0712.1400%2C0712.0313%2C0712.2665%2C0712.0302%2C0712.1064%2C0712.1348%2C0712.0876%2C0712.0506%2C0712.2684%2C0712.1366%2C0712.3148%2C0712.0640%2C0712.0664%2C0712.2284%2C0712.3112%2C0712.1650%2C0712.1800%2C0712.2532%2C0712.4173%2C0712.2291%2C0712.0515%2C0712.0466%2C0712.1552%2C0712.3226%2C0712.2620%2C0712.3730%2C0712.1086%2C0712.3202%2C0712.3353%2C0712.3845%2C0712.0526%2C0712.3607%2C0712.3017%2C0712.2327%2C0712.0148%2C0712.1010%2C0712.1588%2C0712.4154%2C0712.3394%2C0712.2706%2C0712.2230%2C0712.1142%2C0712.2264%2C0712.1554%2C0712.0073%2C0712.3203%2C0712.0085%2C0712.3427%2C0712.2946%2C0712.2962%2C0712.0582%2C0712.0566%2C0712.1311%2C0712.4327%2C0712.1697%2C0712.4015%2C0712.0477%2C0712.1935%2C0712.3443%2C0712.1646%2C0712.1623%2C0712.2495%2C0712.4151%2C0712.1809%2C0712.2955%2C0712.3132%2C0712.2035%2C0712.0420%2C0712.2460%2C0712.3170%2C0712.4079&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Multidomain lithium niobate microcantilever for smart biosensor"}, "summary": "Fabrication of the bimorph lithium niobate cantilevers involves a micro\nmachining of a z-cut wafer to create a multidomain structure. After etching,\nthe bimorph ferroelectric cantilevers are fabricated at the locations near\ninterdomain walls. Cantilever vibrations are excited by rf voltage due to\npiezoelectric effect in a ferroelectric chip, and optical detection is employed\nto pickup the vibrations. The self-assembling layers of two different Silanes\nare chemically deposited on the micro cantilevers. The layers are detected\nindependently by two methods including a low frequency shift of cantilever\nnatural vibrations, and Raman spectral lines from the Silane layers. Possible\napplications include smart biosensors in a real time domain.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0712.2158%2C0712.1910%2C0712.4027%2C0712.0452%2C0712.0203%2C0712.0189%2C0712.0326%2C0712.0055%2C0712.4230%2C0712.3000%2C0712.0327%2C0712.1482%2C0712.4144%2C0712.0851%2C0712.3448%2C0712.2225%2C0712.0785%2C0712.0491%2C0712.4270%2C0712.3994%2C0712.1116%2C0712.3403%2C0712.3130%2C0712.0263%2C0712.2739%2C0712.1429%2C0712.3569%2C0712.2829%2C0712.3495%2C0712.3856%2C0712.1400%2C0712.0313%2C0712.2665%2C0712.0302%2C0712.1064%2C0712.1348%2C0712.0876%2C0712.0506%2C0712.2684%2C0712.1366%2C0712.3148%2C0712.0640%2C0712.0664%2C0712.2284%2C0712.3112%2C0712.1650%2C0712.1800%2C0712.2532%2C0712.4173%2C0712.2291%2C0712.0515%2C0712.0466%2C0712.1552%2C0712.3226%2C0712.2620%2C0712.3730%2C0712.1086%2C0712.3202%2C0712.3353%2C0712.3845%2C0712.0526%2C0712.3607%2C0712.3017%2C0712.2327%2C0712.0148%2C0712.1010%2C0712.1588%2C0712.4154%2C0712.3394%2C0712.2706%2C0712.2230%2C0712.1142%2C0712.2264%2C0712.1554%2C0712.0073%2C0712.3203%2C0712.0085%2C0712.3427%2C0712.2946%2C0712.2962%2C0712.0582%2C0712.0566%2C0712.1311%2C0712.4327%2C0712.1697%2C0712.4015%2C0712.0477%2C0712.1935%2C0712.3443%2C0712.1646%2C0712.1623%2C0712.2495%2C0712.4151%2C0712.1809%2C0712.2955%2C0712.3132%2C0712.2035%2C0712.0420%2C0712.2460%2C0712.3170%2C0712.4079&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Fabrication of the bimorph lithium niobate cantilevers involves a micro\nmachining of a z-cut wafer to create a multidomain structure. After etching,\nthe bimorph ferroelectric cantilevers are fabricated at the locations near\ninterdomain walls. Cantilever vibrations are excited by rf voltage due to\npiezoelectric effect in a ferroelectric chip, and optical detection is employed\nto pickup the vibrations. The self-assembling layers of two different Silanes\nare chemically deposited on the micro cantilevers. The layers are detected\nindependently by two methods including a low frequency shift of cantilever\nnatural vibrations, and Raman spectral lines from the Silane layers. Possible\napplications include smart biosensors in a real time domain."}, "authors": ["Igor Ostrovskii", "Andriy Nadtochiy", "Keith Hollis"], "author_detail": {"name": "Keith Hollis"}, "author": "Keith Hollis", "arxiv_comment": "8 pages, 4 figures", "links": [{"href": "http://arxiv.org/abs/0712.1623v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0712.1623v1", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "cond-mat.mtrl-sci", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cond-mat.mtrl-sci", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0712.1623v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0712.1623v1", "journal_reference": null, "doi": null, "fulltext": "Multidomain lithium niobate microcantilever for smart biosensor.\n\nIgor Ostrovskii, Andriy Nadtochiy, Keith Hollis\nUniversity of Mississippi, University, MS 38677(iostrov@phy.olemiss.edu)\nAbstract: Fabrication of the bimorph lithium niobate cantilevers involves a\nmicromachining of a z-cut wafer to create a multidomain structure. After etching, the bimorph\nferroelectric cantilevers are fabricated at the locations near interdomain walls. Cantilever\nvibrations are excited by rf voltage due to piezoelectric effect in a ferroelectric chip, and optical\ndetection is employed to pickup the vibrations. The self-assembling layers of two different\nSilanes are chemically deposited on the micro cantilevers. The layers are detected independently\nby two methods including a low frequency shift of cantilever natural vibrations, and Raman\nspectral lines from the Silane layers. Possible applications include smart biosensors in a real time\ndomain.\n\n1. The fabrication and characterization of micro- and nano-scale cantilevers have been a\nsubject of extensive research efforts\n\n1,2\n\n. Several materials, such as silicon and it's compound\n\nSi3N43,4, carbon nanotubes5, gold6, magnetostrictive metal glass7 are used for cantilevers\nfabrication. Piezoelectric ZnO film8 and PZT ceramic9, 10 are reported in the kinds of composite\ncantilevers, in which a piezoelectric effect was used to excite vibrations. We cannot refer to\nknown publications that use ferroelectric properties in this type of vibrators or ferroelectricsilane system as a component of a cantilever biosensor. At the same time, ferroelectric\nmicrocantilever has an advantage of being easily excited by applying an rf voltage to it.\nIn this work, we report our experiments on fabrication micro cantilevers from widely\nused ferroelectric material LiNbO3 (LN), which has useful chemical-physical surface properties\nthat allow binding the silanes to its surface as a component of a smart biosensor. It is well known\nthat ─Z plane of LN having Li─ ions on top is characterized by much faster chemical etching rate\nthan + Z side11. We use this peculiarity for chemical fabrication of a bimorph ferroelectric\ncantilever by submerging a multidomain ferroelectric crystal into an acid. Fabricated cantilevers\nare shown schematically in Fig. 1a. We use 500-μm-thick optically polished z-cut wafers of\n1\n\n\fLiNO3 available from the marketplace. They were diced on rectangular samples with the\ndimensions of ~10 mm x 10 mm. A central area of ~5 x 5 mm2 is engineered to fabricate the\ninversely poled domains by applying dc electric field of 23 kV/mm. Domain width and period\nare 0.5 and 1 mm, respectively. After that, one side of the sample was cut out along the line\nbetween poled and unpoled regions. Remaining part of the specimen with a length of 1-3 mm is\nmechanically polished to get a thickness of ~0.1-0.15 mm in the multidomain area. Then the\nsample is etched in HNO3:HF (1:1) solution at 100°C while all crystal bulk between the domain\nwalls is dissolved. The cantilever vibrators are formed exactly in the locations of interdomain\nwalls between two inversely poled domains, these walls are shown by dashed lines in fig. 1a.\nEach single cantilever is the bimorph ferroelectric microcrystal with antiparallel orientation of\npolar z-axes in two cantilever sides divided by the domain wall. It is shown in fig. 1a by two\narrows directed up and down. The microphotograph of fabricated cantilever is given in Fig. 1b.\nThe dimensions of fabricated cantilevers are in the range of 5 to 50 μm thick, 30 to150 μm wide,\nand 450 to 2500 μm long. A remaining multidomain part of the initial ferroelectric wafer (1 in\nFig. 1a) is used to drive the cantilevers with the help of rf voltage applied to upper metal\nelectrode 2, since the domain walls vibrate if rf voltage is applied to multidomain array12. We\nfabricated tens of samples with the cantilever masses ranging 300 ng to 100 mg, and resonance\nfrequencies of natural/fundamental vibrations of 83120 Hz to 1920 Hz. All of the specimens\ndemonstrate generally similar vibrational properties.\n2. To measure the resonance vibration frequency, an optical system is used as shown in\nFig. 1a. The experimental setup consists of a HeNe laser focused on the cantilever. A laser beam\nis partly covered by the cantilever, so that an output signal of the photo detector is modulated\nwith cantilever frequency. The data taken are transferred through digital oscilloscope to\ncomputer. All experiments are performed at atmospheric pressure and room temperature. The\nresonance frequency is determined as a point of maximum amplitude in a frequency response\ncurve presented in Fig. 2. The measured quality factor Q of the cantilevers is in the range of 1001500. In our experiments, more thin vibrators usually have lower Q factor, which can be\nexplained by a stronger influence of an ambient air on lighter cantilevers.\nA mass sensitivity is investigated by putting a point-load on a free end of the cantilevers\nas shown Fig. 1a. We use the paraffin beads of 6 - 60 μm in diameter having their masses in the\nrange of 0.1-100 ng, respectively, and our experimental technique is similar to those described\n\n2\n\n\fin13. Paraffin ball has respectively low density and so bigger volume than other materials like\nmetal or sand. Typical examples of the amplitude-frequency dependencies are shown in Fig. 2a.\nWhen the vibrator is loaded, the curve demonstrates the low frequency shift, from initial plot 1 to\nplot 2. The data from three cantilevers loaded by different paraffin beads with masses (∆m) from\n100 pg to 31 ng are presented in Fig. 2b. The plots 1, 2 and 3 proof a good linear relationship\nbetween the load mass ∆m and corresponding frequency shift ∆f. The highest mass sensitivity for\nour small-dimension cantilever operating at normal conditions was found to be S = (─∆f/∆m) =\n0.5 Hz/pg. In reality, we can increase that sensitivity with thinner cantilevers, but than an\ninfluence of ambient air may affect the measurements.\n3. Surface modification of LN wafer by 3-aminopropyltriethoxysilane14 and\nChlorotrimethylsilane15 have been previously done14,15. In our experiments with bimorph microcantilevers, we use Chlorodimethyloctadecylsilane (CDOS), and Z-6920 silane that is a mixture\nof polysulfidosilane components. Fresh cantilevers after etching are washed with deionized water\nand then dried. After that, the cantilevers frequencies are measured, and the calibration process is\nperformed by putting the paraffin beads on the cantilever tips. Immediately after calibration, the\ncantilevers are silanized by immersing a whole LN platform into a 0.1 M solution of CDOS or Z6920-silane in an methylene chloride for 2 hours. After silanization, the cantilever platform is\nwashed with methylene chloride to clean out any non-bounded silane compound, and then dried.\nZ-6920-silane was obtained from Dow Corning, and CDOS and methylene chloride were\nreceived from Sigma-Aldrich.\nTo detect a silane layer onto cantilever by a vibration frequency shift, we need to know a\nmass sensitivity SU for uniformly covered vibrator.\n\nSU = −\n\n∆fU\n∆mU\n\n(1)\n\nTheoretically, one can represent SU in the integral form of equation (2).\n∆f U\n1\n= ∫ ∑ Bn x n dx\n∆mU L 0 n\nL\n\nSU = −\n\n(2)\n\nWhere L is a length of the cantilever, Bn are coefficients that depend on effective spring constant\nof cantilever, and x is a distance from clamp point (0 ≤ x < L). To find the coefficients Bn, we\nmake the experiments with a small paraffin bead positioned at different x, the results are shown\nin Fig. 3. As it is expected, a change in frequency ∆f decreases when a position of load is\n3\n\n\fchanged from maximum x = L to the clamp point at x = 0. From the experimental plot of Fig. 3,\nwe find that it is enough to hold three terms Bn in equation (2). The magnitudes of these\ncoefficients are: B1 = 0.107, B2 = -0.518, B3 = 0.981. After we know the integral in equation (2)\nand the length of a given sample, we can calculate unknown mass of a deposited layer onto the\nwhole surfaces of the cantilever. Actually, a uniformly deposited layer with a total mass ∆mU\ngives a smaller frequency shift ∆fU than those ∆fP resulting from the same point mass ∆mP\ndeposited at x = L. Then, the sensitivities for point mass at x = L (SP) and for uniformly\ndistributed mass (SU) are not equal. For our bimorph ferroelectric cantilevers, we find the ratio\nSU = (f0 / 4.5*∆mP) = 0.22 SP ,\n\n(3)\n\nWhere f0 is initial natural frequency before a load mass is deposited. Expression (3) is in good\nagreement with the calculations for composite PZT-steel10 and magnetostrictive7 cantilevers,\nwhere this coefficient is found to be 0.236. If we take a uniformly distributed mass ∆ mU as a\ncertain effective mass that produces the same frequency shift as the point load at x = L, which\nmeans ∆fU = ∆fP, then from the equation (3) we find for ferroelectric cantilever a relationship\nbetween the point mass and uniformly distributed mass with the same frequency shifts.\n\n∆ mU = 4.5*∆ mP\n\n(4)\n\nAfter we have the mass of Silane film mS onto cantilever surfaces with known area, we can\nestimate a surface density of the molecule groups. For example, typical cantilever LNZC6 with\nlength x width of 1600x100 μ2 yields mS the surface density of 6 ± 2 groups/nm2. The measured\ndensity of our film is in good agreement with a close-packed monolayer data of 4.5-5\ngroups/sq.nm16. We note that in some our experiments the silane films may have a higher density\nthan one monolayer. This could be explaining by 3-D surface-induced polycondensation16.\n4. Alternative experimental test for Silane presence on the cantilever samples is Raman\nspectroscopy. To take Raman spectra at room temperature, we use PTI MD 5020 spectrometer\nwith Hamamatsu R928 PMT detector. The 632.8 nm radiation from a 10-mW He–Ne laser with\nthe plasma line rejection filter is used as the excitation source. Data acquisition time is 200 s for\neach spectrum. A resulting spectrum is obtained after averaging over 100 runs. The Raman\nspectra in the 2400–3300 cm-1 range are presented in Fig. 4. According to well-known source17,\nthe bands observed at 2849 could be assigned to the CH2 symmetric stretch vibrations, 2883 and\n2891 cm-1 to the CH3 symmetric stretch vibrations, and 2916 cm-1 to the CH2 anti-symmetric\n\n4\n\n\fstretch vibrations. Since the main Raman lines of CH2,3-group vibrations are detected, we have a\nvery strong evidence of the surface modification by the silanes.\n5. A final test is to attach the nano-gold particles to DOD Z-6920 silane. Colloidal gold\nwith 10 nm gold particles of 0.005 % concentration was purchased from Sigma-Aldrich. Neat\nsolution is diluted to concentration about 0.0015% in deionized water. After surface modification\nby DOD Z6920-silane, the cantilever platform is submerged into the diluted colloidal gold\nsolution. Following 2-hour treatment, the cantilever platform is rinsed in deionized water and\ndried. Than we measure a frequency shift, it turns to be 2.7-3.4 Hz for different cantilevers. The\nshift is reliably detectable since we can measure frequency change with an accuracy of ±0.05 Hz.\nWe estimate a mass of the gold particles bounded to cantilever surface as 4±1 ng, which\ncorresponds to a surface concentration of (5.1±1.2)*103 nano-gold particles per μ2.\n6. In conclusions, a new type of cantilever sensor is proposed. It is a ferroelectric\nbimorph vibrator covered with a Silane layer. Nano-gold particles are reliably detected by the\nferroelectric-silane composite cantilever at normal pressure and temperature. The lithium\ntantalite cantilevers need more time for chemical processing, since this material has lower\netching rate. Such cantilevers may be used to detect certain biological objects in real time\nmeasurements.\nAcknowledgements\nThis work in part is made possible due to research grant FRP-2007, UM. We are thankful Drs.\nMack Breazeale and Nico Declercq for useful discussions.\nReferences\n1\n\nN. V. Lavrik,M. J. Sepaniak, P. G. Datskos. Rev. Sci. Instrums. 75, 2229 (2004).\n\n2\n\nK. L. Ekinci, Y. T. Yang, M. L. Roukes. J. Appl. Phys. 95, 2682 (2004).\n\n3\n\nB. Ilic, H. G. Craighead, S. Krylov, W. Senaratne and C. Ober, P. Neuzil. J. Appl. Phys. 95,\n\n3694 (2004).\n4\n\nT. P. Burg, S. R. Manalis. Appl. Phys. Lett. 83, 2698 (2003).\n\n5\n\nM. Nishio, S. Sawaya, S. Akita, Y. Nakayama. Appl. Phys. Lett. 86, 133111 (2005).\n\n6\n\nC. W. Baek, Y. K. Kim, Y. Ahn, Y. H. Kim. Sens. Actuators A 117, 17 (2005).\n\n7\n\nS. Li, L. Orona, Z. Li, Z.-Y. Chenga. Appl. Phys. Lett. 88, 073507 (2006).\n\n5\n\n\f8\n\nW. Pang, L. Yan, H. Zhang, H. Yu, E. S. Kim, W. C. Tang. Appl. Phys. Lett. 88, 243503\n\n(2006).\n9\n\nC. Lee, T. Itoh, T. Suga. Sensors and Actuators A72_1999.179–188.\n\n10\n\nJ. W. Yi, W. Y. Shih, W. H. Shih. J. . Appl. Phys. 91, 1680 (2002).\n\n11\n\nC. L. Sones, S. Mailis, W. S. Brocklesby, R. W. Eason, J. R. Owen. J. Mater. Chem. 12, 295\n\n(2002).\n12\n\nI.V. Ostrovskii, A.B. Nadtochiy. Appl. Phys. Lett. 86, 222902 (2005).\n\n13\n\nS. Dohn, Ra. Sandberg, W. Svendsen, A. Boisen. Appl. Phys. Lett. 86, 233501 (2005).\n\n14\n\nS. Seeger, K. Bierbaum, R. Dahint, C. L. Feng, M. Manter, M. Grunze, in Synthetic\n\nmicrostructures in biological research, edited by Joel M. Schnur and Martin Peckerar. (Plenum\n15\n\nT. N. Bailey, Ph. D. thesis, North Carolina State University, 2006.\n\n16\n\nA. Y. Fadeev1, T. J. McCarthy. Langmuir 16, 7268 (2000).\n\n17\n\nD. Lin-Vien, N. B. Colthup, W. B. Fateley, J.G. Graselli. The Handbook of Infrared and\n\nRaman Characteristic Frequencies of Organic Molecules. (Academic Press, Boston, 1991).\nPress, New York, 1992), pp. 53-66.\n\nFIGURES:\n(a)\n\nLaser\n\n4\n\nElectric voltage U = 10÷100 V\nFrequency F = 1÷100 kHz\n\n(c)\nAu\n\n11\n\nAu\nS\n\nMetal electrode\n9- Small mass\n\n2\n\n1\n5\n\n+z\n\nVibra- +z\ntions\n\nDomain walls\n\n10\n\nSi\n\n+z\n─z\n(b)\n\nGenerator\n\n9\n6\n\nPhoto\ndetector\n\n7\n\nDigital\nOscilloscope\n\n8 Computer\n\n300 μ\n\nFig. 1. (a) Schematic of the experimental setup. The micro cantilever platform (1) is\nclamped between two metal electrodes (2), and is driven by rf-voltage from a signal generator\n6\n\n\f2\n\n1.0\n0.8\n0.6\n0.4\n0.2\n0.0\n\n8900\n\n8950\n\nLoad mass (ng)\n\n9000\n\n9050\n\n9100\n\nFrequency (Hz)\n\n(a)\n\n300\n\n35\n30\n25\n20\n15\n10\n5\n0\n-5\n-20\n\n(b)\n\n1\n\n1\n\n2\n\n3\n\n250\n200\n150\n100\n50\n\nLoad mass (pg)\n\nAmplitude (arb. units)\n\n(3). A laser light from (4) irradiates cantilever (5). Transmitted light is detected by photodiode\n(6), which transmits a signal into oscilloscope (7) followed by computer (8). (b)\nMicrophotograph of cantilever (5) loaded with 28-μ-diameter paraffin bead (9). (c) Model of a\nbimorph cantilever with antiparallel polarization (±z) above and below an interdomain wall\nshown by dashed line. Single silane layer (10) modifies cantilever surface, and gold\nnanoparticles (11) are bounded by that layer.\n\n0\n0\n\n20\n\n40\n\n60\n\n-50\n80 100 120\n\nFrequency shift (Hz)\n\nFig. 2. Frequency dependencies and load mass calibration. (a) Vibration amplitude vs\nfrequency from the sample LNZB-13. Plot 1 – free cantilever, in maximum F = 8993 Hz, 2 –\nloaded by 21.5 ng paraffin bead, in maximum F = 8964 Hz, that is 29 Hz low-frequency shift.\n(b) Load mass calibration. Plots 1 and 2 - nanogram-sensitive cantilevers LNZB-11 and LNZB13, respectively; plot 3 - picogram-sensitive cantilever LNZA-3.\n\n7\n\n\f0.5\nX\n\n0.4\n\n0\n\n∆f/f (%)\n\n0.3\n0.2\n\n∆ f/f 0 = B 1*(x/L) + B 2*(x/L)^2 + B 3*(x/L)^3\n\nB 1 = 0.107\nB 2 = -0.518\nB 3 = 0.981\n\n0.1\n0.0\n0.0\n\n0.2\n\n0.4\n\n0.6\n\n0.8\n\n1.0\n\nx/L (arb. units)\n\nFig. 3. Position sensitivity taken from the sample LNZB-14c1 loaded by 30 ng paraffin\nbead, which was put onto cantilever in 5 different points x/L.\n\n2891\n\n2862\n\n2883\n\nRaman Signal\n\n4\n\n2916\n\n3\n\n2849\n\n2\n1\n\n2400\n\n2600\n\n2800\n3000\n-1\nν (cm )\n\n3200\n\nFig. 4. Raman scattering spectra taken from various cantilever samples: Plot 1 –\nuntreated sample LNZB28, 2 - LNZB28 after treatment by CDOS, 3 – LNZB23 modified with\nZ6920, 4 – LNZC6 modified with Z6920. Arrows show well-known Raman frequencies11 of the\nCH2 symmetric stretch vibrations at 2849-2861 cm-1, CH3 symmetric stretch vibrations at 28832884 cm-1, and CH2 anti-symmetric stretch vibrations at 2912-2916 cm-1.\n\n8\n\n\f"}