{"id": "http://arxiv.org/abs/1106.4460v1", "guidislink": true, "updated": "2011-06-22T14:21:43Z", "updated_parsed": [2011, 6, 22, 14, 21, 43, 2, 173, 0], "published": "2011-06-22T14:21:43Z", "published_parsed": [2011, 6, 22, 14, 21, 43, 2, 173, 0], "title": "Total light absorption in graphene", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1106.4825%2C1106.2210%2C1106.0641%2C1106.2219%2C1106.5599%2C1106.2545%2C1106.2213%2C1106.6260%2C1106.3876%2C1106.2487%2C1106.4478%2C1106.2074%2C1106.3539%2C1106.3820%2C1106.4601%2C1106.4070%2C1106.1493%2C1106.4245%2C1106.0873%2C1106.5730%2C1106.6291%2C1106.4248%2C1106.3959%2C1106.5525%2C1106.0027%2C1106.4902%2C1106.1574%2C1106.0936%2C1106.1013%2C1106.4534%2C1106.4835%2C1106.1570%2C1106.4853%2C1106.5997%2C1106.3001%2C1106.6007%2C1106.1915%2C1106.4411%2C1106.1988%2C1106.0781%2C1106.4759%2C1106.1014%2C1106.5793%2C1106.5889%2C1106.1270%2C1106.5716%2C1106.0064%2C1106.5765%2C1106.3878%2C1106.2166%2C1106.0516%2C1106.3835%2C1106.5659%2C1106.5636%2C1106.2932%2C1106.5834%2C1106.0122%2C1106.6182%2C1106.2374%2C1106.0173%2C1106.1189%2C1106.1161%2C1106.2482%2C1106.2321%2C1106.0830%2C1106.4460%2C1106.1488%2C1106.4563%2C1106.2850%2C1106.4809%2C1106.5877%2C1106.4439%2C1106.2560%2C1106.2596%2C1106.3357%2C1106.2609%2C1106.2143%2C1106.2515%2C1106.5597%2C1106.2170%2C1106.4588%2C1106.4786%2C1106.3395%2C1106.0117%2C1106.3888%2C1106.1144%2C1106.5518%2C1106.2104%2C1106.0246%2C1106.3272%2C1106.1780%2C1106.5612%2C1106.2877%2C1106.0021%2C1106.5990%2C1106.0518%2C1106.1927%2C1106.2949%2C1106.1864%2C1106.5004%2C1106.5101&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Total light absorption in graphene"}, "summary": "We demonstrate that 100% light absorption can take place in a single\npatterned sheet of doped graphene. General analysis shows that a planar array\nof small lossy particles exhibits full absorption under critical-coupling\nconditions provided the cross section of each individual particle is comparable\nto the area of the lattice unit-cell. Specifically, arrays of doped graphene\nnanodisks display full absorption when supported on a substrate under total\ninternal reflection, and also when lying on a dielectric layer coating a metal.\nOur results are relevant for infrared light detectors and sources, which can be\nmade tunable via electrostatic doping of graphene.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1106.4825%2C1106.2210%2C1106.0641%2C1106.2219%2C1106.5599%2C1106.2545%2C1106.2213%2C1106.6260%2C1106.3876%2C1106.2487%2C1106.4478%2C1106.2074%2C1106.3539%2C1106.3820%2C1106.4601%2C1106.4070%2C1106.1493%2C1106.4245%2C1106.0873%2C1106.5730%2C1106.6291%2C1106.4248%2C1106.3959%2C1106.5525%2C1106.0027%2C1106.4902%2C1106.1574%2C1106.0936%2C1106.1013%2C1106.4534%2C1106.4835%2C1106.1570%2C1106.4853%2C1106.5997%2C1106.3001%2C1106.6007%2C1106.1915%2C1106.4411%2C1106.1988%2C1106.0781%2C1106.4759%2C1106.1014%2C1106.5793%2C1106.5889%2C1106.1270%2C1106.5716%2C1106.0064%2C1106.5765%2C1106.3878%2C1106.2166%2C1106.0516%2C1106.3835%2C1106.5659%2C1106.5636%2C1106.2932%2C1106.5834%2C1106.0122%2C1106.6182%2C1106.2374%2C1106.0173%2C1106.1189%2C1106.1161%2C1106.2482%2C1106.2321%2C1106.0830%2C1106.4460%2C1106.1488%2C1106.4563%2C1106.2850%2C1106.4809%2C1106.5877%2C1106.4439%2C1106.2560%2C1106.2596%2C1106.3357%2C1106.2609%2C1106.2143%2C1106.2515%2C1106.5597%2C1106.2170%2C1106.4588%2C1106.4786%2C1106.3395%2C1106.0117%2C1106.3888%2C1106.1144%2C1106.5518%2C1106.2104%2C1106.0246%2C1106.3272%2C1106.1780%2C1106.5612%2C1106.2877%2C1106.0021%2C1106.5990%2C1106.0518%2C1106.1927%2C1106.2949%2C1106.1864%2C1106.5004%2C1106.5101&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We demonstrate that 100% light absorption can take place in a single\npatterned sheet of doped graphene. General analysis shows that a planar array\nof small lossy particles exhibits full absorption under critical-coupling\nconditions provided the cross section of each individual particle is comparable\nto the area of the lattice unit-cell. Specifically, arrays of doped graphene\nnanodisks display full absorption when supported on a substrate under total\ninternal reflection, and also when lying on a dielectric layer coating a metal.\nOur results are relevant for infrared light detectors and sources, which can be\nmade tunable via electrostatic doping of graphene."}, "authors": ["Sukosin Thongrattanasiri", "Frank H. L. Koppens", "F. Javier Garcia de Abajo"], "author_detail": {"name": "F. Javier Garcia de Abajo"}, "author": "F. Javier Garcia de Abajo", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1103/PhysRevLett.108.047401", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1106.4460v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1106.4460v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "4 figures", "arxiv_primary_category": {"term": "physics.optics", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "physics.optics", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "cond-mat.mes-hall", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "cond-mat.mtrl-sci", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1106.4460v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1106.4460v1", "journal_reference": "Physical Review Letters 108, 047401 (2012)", "doi": "10.1103/PhysRevLett.108.047401", "fulltext": "Total light absorption in graphene\nSukosin Thongrattanasiri,1 Frank H. L. Koppens,2 and F. Javier Garcı́a de Abajo1, 3, ∗\n\narXiv:1106.4460v1 [physics.optics] 22 Jun 2011\n\n2\n\n1\nInstituto de Óptica - CSIC, Serrano 121, 28006 Madrid, Spain\nICFO-Institut de Ciéncies Fotóniques, Mediterranean Technology Park, 08860 Castelldefels (Barcelona), Spain\n3\nOptoelectronics Research Centre, University of Southampton, Southampton SO17 1BJ, UK\n\nWe demonstrate that 100% light absorption can take place in a single patterned sheet of doped\ngraphene. General analysis shows that a planar array of small lossy particles exhibits full absorption\nunder critical-coupling conditions provided the cross section of each individual particle is comparable\nto the area of the lattice unit-cell. Specifically, arrays of doped graphene nanodisks display full\nabsorption when supported on a substrate under total internal reflection, and also when lying on\na dielectric layer coating a metal. Our results are relevant for infrared light detectors and sources,\nwhich can be made tunable via electrostatic doping of graphene.\nPACS numbers: 78.67.Wj,78.20.Ci,42.25.Bs\n\nBeyond their fundamental interest in quantum theory\nand cosmology, blackbodies have practical relevance in\nlight absorption and emission devices (e.g., detectors,\nphotovoltaics, and optical sources). Inspired by nature,\nthe following two routes have been investigated to achieve\nperfect absorption: (i) diffusion in disordered lossy surfaces, such as black silver, has led to engineered materials made of carbon nanotubes that exhibit extraordinary\nbroadband light absorption [1]; (ii) alternatively, ordered\nperiodic structures, which explain the moth eye effect\nobserved in nocturnal insects [2], have been pioneered by\nexperimental and theoretical studies showing total light\nabsorption (TLA) in the visible using metallic gratings\n[3–5]. Similar phenomena have been reported at infrared\n(IR) [6] and microwave [7, 8] frequencies. Recently, omnidirectional TLA [9] has been realized using periodic\nsurfaces supporting localized plasmon excitations.\nThe availability of high-quality graphene as a stable\nmaterial with extraordinary (opto-)electronic properties\n[10–12] makes a compelling case for exploring its ability\nto harvest light for potential application to optoelectronics, with the advantage of being optically tunable via\nelectrostatic doping [13]. However, a single sheet of homogeneous graphene is poorly absorbing [14] (about 2.3%\nabsorption), so the challenge is to transform it into a perfect absorber, for which we can rely on its power to host\nextremely confined plasmons [15, 16].\nIn this Letter, we show that a single sheet of doped\ngraphene, patterned into a periodic array of nanodisks,\nexhibits 100% light absorption. We first discuss the extinction cross-section of graphene disks, which can exceed\nby over an order of magnitude their geometrical area [16].\nThese disks therefore belong to the class of absorbing particles that can be arranged in periodic planar arrays such\nthat their cross section exceeds than the area of the unit\ncell. We further assume here that all diffracted beams are\nevanescent. Under these conditions, we derive a universal\nmaximum absorption for any thin layer separating two\ndifferent media. In particular, TLA is predicted when\nthe transmission channel is suppressed, for instance un-\n\nder total internal reflection (TIR) by illumination from\na prism substrate, and also when the particles are supported on a dielectric film on top of a thick metal. We\nshow that a patterned graphene sheet displays these effects. Full absorption by an atomically thin carbon film\nis thus possible using currently available technology.\nOptical response of graphene nanodisks.– Doped\ngraphene has been predicted to support strongly confined, long-lived plasmons [15], which produce sharp IR\nresonances in nanodisks tens of times smaller than the\nlight wavelength [16]. Figure 1(a) shows an example simulated with the boundary element method (BEM) [17].\nWe then fit the polarizability of these small disks to [18]\nα(ω) =\n\n1\n3c3 κr\n,\n2\n2\n2\n2ωp ωp − ω − iκω 3 /ωp2\n\n(1)\n\nwhere ωp is the plasmon frequency, κ is its decay rate,\nand κr is the radiative contribution to κ. The extinction\ncross-section σ ext = (4πω/c)Im{α} obtained from α [Fig.\n1(a), broken curve] is in good agreement with rigorous\nnumerical solutions of Maxwell's equations (solid curve).\nWe represent the parameters ωp , κ, and κr in Fig. 1(b-c)\nfor different doping levels (quantified by the Fermi energy EF ) as a function of disk size. Here, we compute\nthe conductivity of graphene in the local-RPA limit [19]\nwith an intrinsic relaxation time τ = μEF /evF2 , where\nvF ≈ c/300 is the Fermi velocity and μ = 10, 000 cm2 /Vs\nis the measured DC mobility [10] (e.g., τ ≈ 10−13 s\nfor EF = 0.1 eV). Interestingly, the maximum extincext\ntion cross-section σmax\n≈ (3λ2 /2π) κr /κ at the resonant\nwavelength λ can exceed by over an order of magnitude\nthe geometrical area, although the disks are far from perfect two-level systems (such as an atom without inelastic\next\ndecay channels), for which σmax\n≈ 0.48λ2 . This is a consequence of the fact that κ \u001d κr .\nUniversal limit to absorption by a thin layer.– In a\nsymmetric environment, the reflection coefficient r of a\nthin material layer (much thinner than λ) determines the\ntransmission coefficient 1 ± r (upper and lower signs are\nfor s- and p-polarized light, respectively, as required to\n\n\f2\n\nFIG. 1: Optical response of doped graphene nanodisks. (a) Characteristic extinction cross-section of a nanodisk (60 nm in\ndiameter, and Fermi energy EF = 0.4 eV), dominated by a pronounced dipolar plasmon and strong near-field enhancement.\nSolid curve: full electrodynamic calculation. Dashed curve: fit to a Lorentzian polarizability. Inset: near-field intensity relative\nto incident intensity for plane-wave illumination with polarization parallel to the disk. (b,c) Size-dependence of the maximum\nextinction cross-section and the polarizability parameters [see Eq. (1)].\n\nenforce the symmetry of the scattered field with respect\nto the layer plane; we use this convention from now on).\nTherefore, the maximum absorption (1 − |r|2 − |1 ± r|2 )\nis limited to 50% (corresponding to r = ∓1/2). This\nvalue can be increased by considering asymmetric environments, such as the patterned graphene sheet depicted\nin Fig. 2(a).\nA simple analysis leads to the maximum possible absorption produced by a thin, periodically structured material layer that is infinitesimally close to the interface\nbetween two media of different permittivities, \u000f1 and \u000f2 .\nThe reflection and transmission coefficients of this structure must read\nR = r0 + (1 ± r0 )η,\n\nT = t0 ± t0 η,\n\n(2)\n\nwhere r0 and t0 are the Fresnel coefficients of the bare\n\u000f1 |\u000f2 interface, while η is the self-consistent amplitude of\nthe wave scattered by the layer in response to both the external field and the multiple reflections within the layerinterface cavity. The scattered field is obviously symmetric for a layer of thickness \u001c λ, and it contributes to Eq.\n(2) with direct (η) and interface-reflected (±r0 η) components, as well as the corresponding transmission (±t0 η).\nThe absorbance A = 1−|R|2 −Re{f }|T |2 , obtained from\nthe integral of the Poynting vector over planes far from\nthe structure, is thus an analytical function of the complex variable η, and its maximum admits the closed-form\nexpressions\nAs,max =\n\n1\n1 + Re{f }\n\n(3)\n\nand\nAp,max = 1 −\n\nRe{f }\nRe{f } + (\u000f1 /\u000f2 )|f |2\n\n(4)\n\nfor s and p polarizations, respectively, where f = (\u000f2 /\u000f1 −\nsin2 θ)1/2 / cos θ and θ is the angle of incidence from\nmedium 1. The dependence of the universal maximum\n\nabsorption on θ and \u000f2 /\u000f1 predicted by Eqs. (3) and\n(4) is shown in Fig. 2(b-c). Interestingly, it becomes\n100% under TIR from the high-index medium (i.e., for\n\u000f1 sin2 θ > \u000f2 , leading to Re{f } = 0), indicating that it\nis possible to simply suppress the reflection when transmission is already prevented by TIR.\nAbsorption in particle and disk arrays.– The universal maximum is just an upper limit to the absorption,\nbut its derivation does not provide any clue on how to\nstructure the material to reach such a limit, or whether\nit is at all possible to obtain it. However, a systematic\ninspection of graphene nanodisk arrays reveals that the\nuniversal limit is indeed reached by engineering the disk\nsize, doping, and spacing. We show several examples in\nFig. 2(d-e), computed from a layer-KKR method [20], in\nwhich the disks are described through their multipolar\npolarizability obtained from BEM (solid curves).\nWe can gain further insight into thin-layer absorption\nby describing each graphene nanodisk (or any other particle) through the polarizability [Eq. (1)]. For arrays of\nsmall period a compared to the wavelength, the reflection\ncoefficient of the layer reduces to [21]\nr=\n\n±iS\n,\n−G\n\nα−1\n\n(5)\n\nwhere G is a lattice sum whose imaginary part is exactly given by Im{G} = S − 2(ω/c)3 /3, whereas its\nreal part reduces to Re{G} ≈ g/a3 for λ \u001d a, with\ng = 5.52 (g = 4.52) for hexagonal (square) arrays. Here,\nS = 2πω/cA cos θ (S = 2πω cos θ/cA) for s-polarized (ppolarized) light and A is the unit-cell area. Equation (5),\ntogether with Eq. (1), permits obtaining the transmission\nand reflection coefficients of the combined array-interface\nsystem analytically (they are simply given by Eq. (2) with\nη = r(1 ± r0 )/(1 − r0 r)), leading to the dashed curves of\nFig. 2(d-e), in excellent agreement with full simulations.\nIn the symmetric configuration (\u000f1 = \u000f2 ), combining\nEqs. (1) and (5), and noticing that κ \u001d κr , the maximum\nabsorption (i.e., 50%, corresponding to r = ∓1/2) is ob-\n\n\f3\n\nFIG. 2: Absorption by a layer of doped graphene nanodisks. (a) Scheme of the geometry under consideration. (b,c) Universal\ncontours showing a maximum limit to the absorbance of a thin material layer sandwiched between two different media for s and\np polarization as a function of incidence angle and dielectric contrast between both media. Light is incident from the \u000f1 medium.\n(d,e) Realization of maximum absorption with arrays of graphene disks [see (a)] of diameter D = 60 nm, EF = 0.4 eV, and\ndifferent lattice spacings and angles of incidence (see labels). The lower-index medium has \u000f = 1 in all cases. The numerical\nlabels in (d,e) correspond to the positions of the symbols in (b,c).\n\ntained at a frequency ω ≈ ωp − 3gκr /4(ωa/c)3 (slightly\nredshifted with respect to the single-disk resonance ωp ),\nunder the condition ζ = 1/2, where we define the parameter\n(\ncos θ,\ns polarization,\nA\nζ = ext ×\nσmax\ncos−1 θ, p polarization.\nThis condition can be fulfilled by adjusting the spacing\next\nis sufficiently large combetween disks, provided σmax\npared to the disk area. For asymmetric environments\n(\u000f1 6= \u000f2 ), the analysis becomes more involved, but simiext\nlar redshifts are obtained for large enough σmax\n.\nThe robustness of TLA under TIR is explored in Fig.\n3, where the peak absorbance is represented as a function\nof incidence angle for various values of the lattice spacing\na, using the same disks in all cases [see parameters in Fig.\n3(b)]. Nearly TLA is observed within the 20◦ -45◦ range\nof incidence angles under critical coupling conditions [9].\nOmnidirectional total light absorption.– The above prediction of TLA under TIR can be generalized to systems in which the transmission channel is suppressed. In\nparticular, we consider a graphene array placed above\na metallic substrate. The graphene plasmons disappear\nclose to a metal, but this problem is solved by introducing an intermediate dielectric coating layer [see inset of\nFig. 4(a)]. In this configuration, the metal can naturally act as a backgate element to dope the graphene. It\nis easy to see that reflection is canceled when the substrate (i.e., metal plus coating) reflection coefficient is\nr0 = −r/(1 ± 2r). The coating-layer thickness d can be\nadjusted to match the required phase in this expression,\nand the condition is simply stated as 1/|r0 | = |2 ± 1/r| ≥\n\nFIG. 3: Angular dependence of the peak absorbance for s\n(a) and p (b) polarization in arrays of graphene nanodisks\n[see Fig. 2(a)]. Each curve represents a fixed sample with\nparameters as shown by labels.\n\n1, where the equality applies to non-absorbing substrates\n(e.g., a dielectric under TIR, or noble metals in the\nIR). Figure 4(b) shows TLA under this scheme for properly adjusted values of a and d. Obviously, the phasematching condition is periodically satisfied along the d\n\n\f4\n\nFIG. 4: Total absorption with graphene on a coated metallic substrate. (a) Normal-incidence absorbance by graphene disk\narrays supported on a dielectric-coated gold surface (see inset) for various values of the dielectric film thickness (\u000fdielectric = 2.1,\n\u000fAu from [22]). (b) Peak absorbance as a function of dielectric thickness d and lattice spacing a for the same disks as in (a).\n(c,d) Incidence-angle and photon-energy dependence of the absorbance under the conditions of (a) for d = 1.12 μm.\n\naxis. Interestingly, the incidence-angle and polarization\ndependence of the absorption is very weak [Fig. 4(c-d)],\npointing at the possibility of omnidirectional absorption.\nTo understand this, we combine Eqs. (1) and (5) together\nwith the relation |2 ± 1/r| = 1 (i.e., the condition of no\nreflection for |r0 | = 1), from which we find two\npfrequencies for TLA, ω = ωp − 3gκr /4(ωa/c)3 ± (κ/2) 1/ζ − 1,\nunder the condition ζ < 1; only the right-most term depends on polarization and angle of incidence (through ζ),\nso total absorption can be made omnidirectional when\nthe second term in the resonant ω dominates (i.e., for\next\nis of the order of A.\n(ωa/c)3 \u001c κr /κ), provided σmax\nConcluding remarks.– Planar textured materials can\nproduce large light absorption, which reaches 100% when\nthe transmission channel is suppressed. We predict that\nthis effect takes place using a single sheet of doped patterned graphene either under TIR or when the carbon\nlayer is deposited on dielectric-coated metal. Full absorption in graphene opens interesting possibilities for light\ndetection (e.g., via electron-hole separation [23], thermoelectric reading [24], etc.). This type of detector should\ninherit the electrical tunability of graphene, which can\nbe used for direct, efficient spectral analysis of IR light\nwith relative spectral resolution ∼ κr /κ. Additionally,\nthermally heated samples can be useful as narrow-band\nIR sources in virtue of Kirchhoff's law. We further predict perfect absorption in planar particle arrays under\nthe condition that the absorption cross-section of an individual particle is comparable to the area of the unit\ncell. This condition is actually fulfilled by many nonideal two-level atoms/molecules (e.g., NV centers). Our\nresults could be tested with optically trapped atomic arrays, although graphene nanodisks are more convenient\nbecause they provide a practical implementation that is\nstable under ambient conditions. Noble-metal nanoparticle arrays can also exhibit similar effects in the near IR,\nwith their spacing controlled through dielectric coating\n[25].\n\nThis work has been supported by the Spanish MICINN\n(MAT2010-14885 and Consolider NanoLight.es), Fundació Cellex Barcelona, and the European Commission (FP7-ICT-2009-4-248909-LIMA and FP7-ICT-20094-248855-N4E).\n\n∗\nCorresponding author: J.G.deAbajo@csic.es\n[1] K. Mizuno et al., Proc. Natl. Academ. Sci. 106, 6044\n(2009).\n[2] P. B. Clapham and M. C. Hutley, Nature 24, 281 (1973).\n[3] M. C. Hutley and D. Maystre, Opt. Commun. 19, 431\n(1976).\n[4] M. Nevière et al., in Proc. of ICO-11 Conference, Madrid,\nSpain (1978), pp. 609–612.\n[5] E. Popov et al., Opt. Express 16, 6146 (2008).\n[6] E. Popov, L. Tsonev, and D. Maystre, Appl. Opt. 33,\n5214 (1994).\n[7] Y. P. Bliokh, J. Felsteiner, and Y. Z. Slutsker, Phys. Rev.\nLett. 95, 165003 (2005).\n[8] N. I. Landy et al., Phys. Rev. Lett. 100, 207402 (2008).\n[9] T. V. Teperik et al., Nat. Photonics 2, 299 (2008).\n[10] K. S. Novoselov et al., Science 306, 666 (2004).\n[11] K. S. Novoselov et al., Nature 438, 197 (2005).\n[12] F. Bonaccorso et al., Nat. Photon. 4, 611 (2010).\n[13] C. F. Chen et al., Nature 471, 617 (2011).\n[14] K. F. Mak et al., Phys. Rev. Lett. 101, 196405 (2008).\n[15] M. Jablan, H. Buljan, and M. Soljac̆ić, Phys. Rev. B 80,\n245435 (2009).\n[16] F. H. L. Koppens, D. E. Chang, and F. J. Garcı́a de\nAbajo, arXiv:1104.2068v1.\n[17] F. J. Garcı́a de Abajo and A. Howie, Phys. Rev. B 65,\n115418 (2002).\n[18] D. V. van Coevorden et al., Phys. Rev. Lett. 77, 2412\n(1996).\n[19] B. Wunsch et al., New J. Phys. 8, 318 (2006).\n[20] N. Stefanou, V. Yannopapas, and A. Modinos, Comput. Phys. Commun. 113, 49 (1998); 132, 189 (2000).\n[21] F. J. Garcı́a de Abajo, Rev. Mod. Phys. 79, 1267 (2007).\n[22] P. B. Johnson and R. W. Christy, Phys. Rev. B 6, 4370\n(1972).\n\n\f5\n[23] M. C. Lemme et al., arXiv: 1012.4745v1.\n[24] J. C. W. Song et al., arXiv:1105.1142v1.\n[25] T. Ung, L. M. Liz-Marzán, and P. Mulvaney, J. Phys.\n\nChem. B 105, 3441 (2001).\n\n\f"}