{"id": "http://arxiv.org/abs/1008.3702v2", "guidislink": true, "updated": "2011-01-17T16:19:04Z", "updated_parsed": [2011, 1, 17, 16, 19, 4, 0, 17, 0], "published": "2010-08-22T15:27:13Z", "published_parsed": [2010, 8, 22, 15, 27, 13, 6, 234, 0], "title": "Dynamics of elastocapillary rise", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1008.1415%2C1008.4672%2C1008.5171%2C1008.1982%2C1008.3125%2C1008.5283%2C1008.3472%2C1008.2126%2C1008.1955%2C1008.5339%2C1008.4969%2C1008.3702%2C1008.4611%2C1008.0282%2C1008.0368%2C1008.1411%2C1008.0086%2C1008.4771%2C1008.0559%2C1008.5348%2C1008.5015%2C1008.4104%2C1008.3432%2C1008.1346%2C1008.1747%2C1008.1743%2C1008.4954%2C1008.3280%2C1008.0094%2C1008.3105%2C1008.1287%2C1008.0989%2C1008.1074%2C1008.2654%2C1008.2993%2C1008.1881%2C1008.0600%2C1008.3783%2C1008.5045%2C1008.1273%2C1008.0707%2C1008.2159%2C1008.3655%2C1008.4944%2C1008.1405%2C1008.0029%2C1008.0648%2C1008.2354%2C1008.2453%2C1008.2428%2C1008.1623%2C1008.0459%2C1008.2952%2C1008.2285%2C1008.2857%2C1008.2057%2C1008.1756%2C1008.0223%2C1008.3828%2C1008.0007%2C1008.1446%2C1008.3704%2C1008.0048%2C1008.1508%2C1008.0992%2C1008.4337%2C1008.1180%2C1008.5030%2C1008.2530%2C1008.0218%2C1008.2860%2C1008.2840%2C1008.3437%2C1008.4927%2C1008.1677%2C1008.5064%2C1008.5299%2C1008.1993%2C1008.0481%2C1008.0114%2C1008.4239%2C1008.2821%2C1008.2241%2C1008.4175%2C1008.5366%2C1008.3425%2C1008.2143%2C1008.2991%2C1008.3778%2C1008.2487%2C1008.0654%2C1008.4303%2C1008.0828%2C1008.4078%2C1008.4465%2C1008.3700%2C1008.5247%2C1008.0731%2C1008.1501%2C1008.5209%2C1008.0784&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Dynamics of elastocapillary rise"}, "summary": "We present the results of a combined experimental and theoretical\ninvestigation of the surface-tension-driven coalescence of flexible structures.\nSpecifically, we consider the dynamics of the rise of a wetting liquid between\nflexible sheets that are clamped at their upper ends. As the elasticity of the\nsheets is progressively increased, we observe a systematic deviation from the\nclassical diffusive-like behaviour: the time to reach equilibrium increases\ndramatically and the departure from classical rise occurs sooner, trends that\nwe elucidate via scaling analyses. Three distinct temporal regimes are\nidentified and subsequently explored by developing a theoretical model based on\nlubrication theory and the linear theory of plates. The resulting free-boundary\nproblem is solved numerically and good agreement is obtained with experiments.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1008.1415%2C1008.4672%2C1008.5171%2C1008.1982%2C1008.3125%2C1008.5283%2C1008.3472%2C1008.2126%2C1008.1955%2C1008.5339%2C1008.4969%2C1008.3702%2C1008.4611%2C1008.0282%2C1008.0368%2C1008.1411%2C1008.0086%2C1008.4771%2C1008.0559%2C1008.5348%2C1008.5015%2C1008.4104%2C1008.3432%2C1008.1346%2C1008.1747%2C1008.1743%2C1008.4954%2C1008.3280%2C1008.0094%2C1008.3105%2C1008.1287%2C1008.0989%2C1008.1074%2C1008.2654%2C1008.2993%2C1008.1881%2C1008.0600%2C1008.3783%2C1008.5045%2C1008.1273%2C1008.0707%2C1008.2159%2C1008.3655%2C1008.4944%2C1008.1405%2C1008.0029%2C1008.0648%2C1008.2354%2C1008.2453%2C1008.2428%2C1008.1623%2C1008.0459%2C1008.2952%2C1008.2285%2C1008.2857%2C1008.2057%2C1008.1756%2C1008.0223%2C1008.3828%2C1008.0007%2C1008.1446%2C1008.3704%2C1008.0048%2C1008.1508%2C1008.0992%2C1008.4337%2C1008.1180%2C1008.5030%2C1008.2530%2C1008.0218%2C1008.2860%2C1008.2840%2C1008.3437%2C1008.4927%2C1008.1677%2C1008.5064%2C1008.5299%2C1008.1993%2C1008.0481%2C1008.0114%2C1008.4239%2C1008.2821%2C1008.2241%2C1008.4175%2C1008.5366%2C1008.3425%2C1008.2143%2C1008.2991%2C1008.3778%2C1008.2487%2C1008.0654%2C1008.4303%2C1008.0828%2C1008.4078%2C1008.4465%2C1008.3700%2C1008.5247%2C1008.0731%2C1008.1501%2C1008.5209%2C1008.0784&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We present the results of a combined experimental and theoretical\ninvestigation of the surface-tension-driven coalescence of flexible structures.\nSpecifically, we consider the dynamics of the rise of a wetting liquid between\nflexible sheets that are clamped at their upper ends. As the elasticity of the\nsheets is progressively increased, we observe a systematic deviation from the\nclassical diffusive-like behaviour: the time to reach equilibrium increases\ndramatically and the departure from classical rise occurs sooner, trends that\nwe elucidate via scaling analyses. Three distinct temporal regimes are\nidentified and subsequently explored by developing a theoretical model based on\nlubrication theory and the linear theory of plates. The resulting free-boundary\nproblem is solved numerically and good agreement is obtained with experiments."}, "authors": ["Camille Duprat", "Jeffrey M. Aristoff", "Howard A. Stone"], "author_detail": {"name": "Howard A. Stone"}, "author": "Howard A. Stone", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1017/jfm.2011.173", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1008.3702v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1008.3702v2", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "physics.flu-dyn", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "physics.flu-dyn", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1008.3702v2", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1008.3702v2", "arxiv_comment": null, "journal_reference": null, "doi": "10.1017/jfm.2011.173", "fulltext": "Under consideration for publication in J. Fluid Mech.\n\n1\n\nDynamics of elastocapillary rise\n\narXiv:1008.3702v2 [physics.flu-dyn] 17 Jan 2011\n\nC A M I L L E D U P R A T, J E F F R E Y M. A R I S T O F F\nA N D H O W A R D A. S T O N E\nDepartment of Mechanical and Aerospace Engineering, Princeton University,\nPrinceton, NJ 08544, USA\n(Received 1 November 2018)\n\nWe present the results of a combined experimental and theoretical investigation of the\nsurface-tension-driven coalescence of flexible structures. Specifically, we consider the dynamics of the rise of a wetting liquid between flexible sheets that are clamped at their\nupper ends. As the elasticity of the sheets is progressively increased, we observe a systematic deviation from the classical diffusive-like behaviour: the time to reach equilibrium\nincreases dramatically and the departure from classical rise occurs sooner, trends that we\nelucidate via scaling analyses. Three distinct temporal regimes are identified and subsequently explored by developing a theoretical model based on lubrication theory and the\nlinear theory of plates. The resulting free-boundary problem is solved numerically and\ngood agreement is obtained with experiments.\nKey Words: imbibition, elastocapillarity, fluid-structure interaction\n\n1. Introduction\nSurface tension plays a role in an enormous variety of industrial problems and natural\nphenomena: the string of dew drops on a spider web, the spontaneous imbibition of water\ninto soil, the stability of water-walking arthropods, the wet lithography of micro-electromechanical systems, the rise of sap in trees, and the wet adhesion of insects on plants, to\nname just a few. It is clear that the elasticity of the substrate is relevant to understand\nsome of these phenomena, including the clumping of the flexible bristles of tarsi of insects\nwhen tarsal oil is released (Eisner & Aneshansley 2000) or the adhesive failure (stiction) of\nmicro-cantilevers bent by capillary forces at the evaporating menisci (Mastrangelo & Hsu\n1993). Although static problems involving the interplay between capillarity, elasticity,\nand possibly other forces are well studied, there are very few studies of the dynamics of\nelastocapillarity, which is the subject of this paper.\nEarly studies of elastocapillarity dealt with the deformation of a solid in contact with a\nliquid drop. From the viewpoint of mechanics, when a liquid drop adheres to a substrate,\nthere must be a balance of the forces acting at the contact line. The familiar Young's\nequation can be interpreted as a balance of the tangential forces. Some authors (Lester\n1961; Fortes 1984) suggested that the normal component is balanced by a force exerted\nby the solid, which deforms upon contact. This deformation is generally negligible on a\nrigid substrate, but can lead to the formation of a ridge (Andrade et al. 1979; PericetCamara et al. 2008) or wrinkles (Huang et al. 2007) on a soft substrate. Motivated by\nthe recent interest in soft materials in engineering, nano-fabrication, and biomechanics,\nseveral authors have addressed the question of how slender objects deform under capillary\nforces (Bico et al. 2004; Kim & Mahadevan 2006; Py et al. 2007; Pokroy et al. 2009),\nmostly considering equilibrium configurations.\n\n\f2\n\nC. Duprat, J. M. Aristoff and H. A. Stone\n\nNevertheless, some elastocapillary effects are essentially dynamic (e.g. sap flow, spore\nrelease), and it is of fundamental and practical importance to estimate the time to reach\nequilibrium in such systems, as well as to understand their transient dynamics. Recent\nexamples of such elastocapillary dynamics include studies of capillary-driven flow in deformable porous media (Siddique et al. 2009) and in flexible channels where gravitational\neffects could be neglected (van Honschoten et al. 2007; Aristoff et al. 2010). Here, we consider a model system to study elastocapillary dynamics with gravity, namely capillary\nrise between flexible sheets that are clamped at their upper ends. In doing so, we extend\nthe work of Bico et al. (2004) and Kim & Mahadevan (2006) by considering the dynamics\nof elastocapillary rise. The experimental set-up and results are described in §2. We begin\nwith statics, identify three different regimes, and then address the transient behaviour.\nWe show how the evolution of the position of the meniscus departs from that of classical\ncapillary rise (i.e. rise between rigid boundaries) and exhibits an unusual behaviour: the\nmeniscus slows down, reaches a plateau, then reaccelerates before finally stopping. In §3,\nwe formulate a free-boundary problem to model the dynamics, and in §4 we describe\nthe solution technique and present the numerical solutions. The transient dynamics is\nanalysed in §5 in light of experimental and numerical results.\n\n2. Experiments\n2.1. Experimental setup and dimensionless numbers\nIn this section we describe our experimental setup to investigate the dynamics of capillary\nrise between flexible sheets (Fig. 1). Two vertical glass sheets (length `, thickness b =\n160 μm, width w = 5 mm and bending stiffness per unit width B = (2.2 ± 0.2) × 10−2\nN*m) are initially parallel. The sheets are clamped at their upper ends, with a separation\ndistance 2h0 , and free at their lower ends. At time t = 0, the lower ends of the sheets are\nbrought into contact with a bath of silicon oil (viscosities and densities μ = 0.096 Pa*s ,\nρ = 963 kg*m−3 (V100), μ = 0.048 Pa*s, ρ = 960 kg*m−3 (V50), μ = 0.0093 Pa*s, ρ =\n930 kg*m−3 (V10), and surface tension γ = 0.021 N*m−1 ) that perfectly wets the glass\n(i.e. the equilibrium contact angle θe = 0). The deflection of the sheets and the position\nof the meniscus as it rises between the sheets are recorded from the side with a digital\ncamera and tracked using customised image-analysis software in MATLAB R .\nWe take the length of the sheet ` and half the initial gap h0 as, respectively, the\ncharacteristic lengths for the meniscus position zm (t) and the deflection of the sheets\nfrom the vertical h(z, t). We can then estimate the capillary energy Ec ∼ w`γ, the\ngravitational energy Eg ∼ ρgwh0 `2 and the bending energy Ee ∼ Bwh20 /`3 for our\nsystem, where g is the gravitational acceleration and here we use ∼ to indicate order-ofmagnitude scaling estimates for which prefactors are typically order one. Balancing Ec\nwith Eg , Ec with Ee , and Eg with Ee yields three characteristic lengths:\n`cg =\n\nγ\n,\nρgh0\n\n\u0012\n`ec =\n\nBh20\nγ\n\n\u00131/4\n\n\u0012\n, and `eg =\n\nBh0\nρg\n\n\u00131/5\n.\n\n(2.1)\n\nThe capillary-gravity length `cg is the classical equilibrium height for the capillary rise\nbetween two rigid plates. The elastocapillary length `ec corresponds to the minimal length\nabove which capillary forces can bring the sheets together and has been identified previously in studies of the failure of micro-mechanical structures upon drying (Mastrangelo\n& Hsu 1993; de Boer & Michalske 1999) or hair clumping (Bico et al. 2004). The scale `eg\n\n\fDynamics of elastocapillary rise\n\n3\n\nz\n\ng\n\n0\n\nof\nath\n\nuid\nliq\n\nb\n\nFigure 1. Sketch of the experimental setup. The top hatched region corresponds to the clamped\nedge of the glass sheets. The shape of the meniscus is indicative of a typical experimental\nobservation. We track the position of the apex of the meniscus.\n\nis an elastogravity length. Our system is thus described by two dimensionless numbers,\n\u0012 \u00134\n`\n`\nB=\nand E =\n,\n(2.2)\n`cg\n`ec\nwhere B is the Bond number and E is the elastocapillary number. Note that we may also\n5\ndefine an elastogravity number G = (`/`eg ) = BE . By changing the spacing 0.18 mm 6\nh0 6 0.39 mm, we varied the elastocapillary length 13.4 mm 6 `ec 6 20 mm. The\nelastocapillary number E is varied within a wide range (0.18 6 E 6 192) by changing\nthe length of the sheets 10 mm 6 ` 6 50 mm. The value of the Bond number B is also\naffected by the changes in `, but remains of order one (1 6 B 6 7) for all experiments.\nWe note that for B 6 1, the meniscus will fill the entire gap between the sheets (i.e.\n`cg > `).\n2.2. Equilibrium configuration\nWhen the free ends of the sheets are brought into contact with the bath, the liquid spontaneously rises up, and the induced pressure distribution leads to an inward deflection\nof the sheets until the meniscus stops at a finite height. This equilibrium state depends\non the combined effects of surface tension, gravity, and elasticity. Depending on the two\ndimensionless parameters (E , B), three different configurations are observed, as depicted\nin Fig. 2. For E . 10, the sheets are slightly deflected while the lower ends remain open\n(Regime I). For E & 100, the sheets deflect and coalesce over a distance comparable to\ntheir length (Regime III). Nevertheless, the sheets do not make dry contact; a thin liquid film remains between them. The statics of these two regimes have been investigated\npreviously (Bico et al. 2004; Kim & Mahadevan 2006). In addition, we have identified\nan intermediate regime (Regime II) wherein the sheets touch at the tip, but there is a\nnonzero angle between them.\nThe equilibrium shape of the sheets is found by solving numerically the nonlinear freeboundary problem developed by Kim & Mahadevan (2006), with a different boundary\n\n\f4\n\nC. Duprat, J. M. Aristoff and H. A. Stone\n\nIII\n\n10\n\n2\n\nII\n\nIII\n\nII\n\n10\n\nI/II\n\n1\n\n10\n\nI\n\n1\n\nI\n\n0\n\n10\n\n1\n\n0\n\n10\n\n1\n\nFigure 2. Equilibrium configurations. Regime diagram of elastocapillary rise in the parameter\nspace (E , B) obtained by studying the static problem experimentally (symbols) and numerically\n(shaded regions). Three regimes, labeled I (◦), II (\u0005) and III (\u0003) are identified and illustrated\nwith experimental photographs and numerically deduced profiles for (I, •) E = 7.2, B = 1.7,\n(II, \u0007) E = 12, B = 1.9 and (III, \u0004) E = 192, B = 3.9. In the region labeled I/II, we predict\nnumerically the coexistence of two regimes (I and II), in agreement with our experimental\nobservations.\n\ncondition at the lower ends of the sheets necessary to find an equilibrium shape for\nintermediate E , which corresponds to Regime II (see §3 and Table 1). We compiled the\npermissible equilibrium configuration(s) for 120,000 different pairings of E and B, and\npresent the results in Fig. 2 (shaded regions). Good agreement with our experimental\nobservations is observed. We note that for 10 . E . 30, solutions for regimes I and II\ncoexist.\nKim & Mahadevan (2006) performed a scaling analysis to determine the onset of large\ndeflection of the sheets, which can be interpreted as the upper boundary of Regime I. To\ndo so they balanced the torque (per unit width) exerted on the sheets, Bh0 /`2 , with the\ncapillary-gravity torque, ρg`2cg (`−`cg /2). They considered the limit ` \u001d `cg , (i.e. B \u001d 1),\nwherein the capillary-gravity torque becomes ρg`2cg `, and thus they obtained a boundary\nthat is given by E ∼ B. Our numerical results suggest that this scaling is indeed valid for\nlarge Bond numbers (not shown). However, our experiments and numerically predicted\nequilibrium shapes show a different behaviour for B . 10, which can be understood\nby considering the limit `/`cg → 1 (i.e. B → 1), wherein the capillary-gravity torque\nbecomes ρg`3 . Hence, we find a boundary that is given by E ∼ B −1 , in agreement with\nour numerical solutions shown in Fig. 2.\n2.3. Dynamics\nWe now focus on dynamics, in particular the time to reach these equilibrium configurations. We measured the time t∗ taken by the meniscus to reach 99% of its final\nheight. Results obtained for h0 = 0.18 mm and three different viscosities are presented\nin Fig. 3(a), where we varied the length of the sheet ` and hence the elastocapillary\nnumber E . For short sheets, t∗ is roughly constant and on the order of a minute. The\nsheets deflect slightly and the final state is close to the one obtained for rigid boundaries\n(Regime I). For larger sheets, the deflection becomes important (Regimes II and III) and\nt∗ increases rapidly with increasing `.\nTo estimate the time to reach equilibrium, we assume that the speed of the meniscus\n\n\fDynamics of elastocapillary rise\n\n(a)\n\n103\n\n5\n\n(b)\n\n103\n102\n102\n\n101\n5 10 15 20 25 30 35 40 45\n\n101\n100\n10-1\n\n100\n\n101\n\n102\n\n103\n\nFigure 3. Time to reach equilibrium. (a) Time t∗ in seconds (s) required to reach 99% of the\nequilibrium height versus the length of the sheet ` in millimeters (mm). Data points correspond\nto experiments with a constant initial gap h0 = 0.18 mm and with silicone oil of viscosity V100\n(\u0007), V50 (∗) and V10 (+). (b) Time t∗ scaled by the characteristic time to reach equilibrium in\nthe classical rigid case, τr , versus B2 E . The dotted line corresponds to t∗ = 3.6τr and the solid\nline to t∗ /τr = B2 E , i.e. t∗ = τve .\n\nu is given by that for a Poiseuille flow u = ∆ph20 /(3μ`). Provided the deflection of\nthe sheets is small, the pressure difference across the meniscus may be approximated\nby ∆p = γ/h0 , and the characteristic length is the capillary-gravity length `cg . The\ntime to reach equilibrium τr is thus given by a balance between capillary, viscosity, and\ngravitational forces, leading to τr = h33μγ\n2 (Quere 1997), which is independent of the\n0 (ρg)\nlength of the sheets `.\nWhen the deflection of the sheets is appreciable, the two dominant effects are viscosity\nand elasticity. The pressure difference ∆p is set by the typical deflection of the sheets h0 ,\ni.e. Bh0 /`4 = ∆p. Therefore, we can define a characteristic visco-elastic time τve = u` =\n3μ`6\nBh30\n\n= B 2 E τr , which rapidly increases with increasing `.\n\nThe time to reach equilibrium, rescaled as t∗ /τr , is presented in Fig. 3(b) versus B 2 E .\nThe data follow two different behaviours. For B 2 E . 10, we recover the classical result for\ncapillary rise between rigid sheets: t∗ ' τr , indicating that elastic effects are negligible.\nConversely, for B 2 E & 10 the time to reach equilibrium scales with the visco-elastic time,\ni.e. t∗ /τr = B 2 E , indicating that elastic effects are dominant.\nNext, we examine the evolution of the shape of the sheets and the position of the\nmeniscus for three experiments representative of Regimes I, II and III (Fig. 4). The\ndynamics of imbibition between flexible sheets is compared to the classical case of rise\nbetween rigid sheets (black lines in Fig. 4), wherein the meniscus follows a diffusive-like\nbehaviour at early times, i.e. zm ∝ t1/2 (Bell & Cameron 1906), and is then slowed\nby gravity until eventually reaching its equilibrium height `cg . In our experiments (grey\npoints in Fig. 4), the meniscus follows this classical behaviour at early times, as the sheets\ndo not appreciably deflect. At later times, the sheets begin to bend and the meniscus\nposition deviates from that of classical capillary rise. For small E (Fig. 4(a)), the sheets\nare slightly deflected. The meniscus slows down and stops at a higher position than\nthe classical height. For intermediate E (Fig. 4(b)), the ends of the sheets touch during\nimbibition. The meniscus slows down, reaches a plateau, then surprisingly, accelerates\nuntil finally stopping. For large E (Fig. 4(c)), the sheets touch soon after imbibition\nbegins, when the meniscus is quite close to the bath and gravity has not yet contributed\nto its deceleration. At intermediate times, the position of the meniscus dips below that\nof classical rise and the meniscus slows down considerably. After roughly one minute\n\n\fC. Duprat, J. M. Aristoff and H. A. Stone\n6\n\n0\n\n101\n\n100\n\n101\n\n(a) Regime I\n\n102\n\n101\n\n0\n\n100\n\n101\n\n102\n\n(b) Regime II\n\n103\n\n101\n\n100\n\n0\n\n100\n\n101\n\n102\n\n(c) Regime III\n\nFigure 4. Image sequences of elastocapillary rise and time evolution of the position of the meniscus zm for h0 = 0.18\nmm, silicone oil V100 (`ec = 13.4 mm) and (a) Regime I, ` = 22 mm, E = 6.8, B = 1.8, (b) Regime II , ` = 25 mm,\nE = 11.4, B = 2 and (c) Regime III, ` = 35, E = 43.9, B = 2.8. The times corresponding to each image are denoted\nby the (•) symbols on the grey curves. For comparison, the solid curves denote the corresponding meniscus position\nfor capillary rise between rigid sheets, given by (4.2).\n\n103\n\n\fDynamics of elastocapillary rise\n\n7\n\n101\n\n100\n\n100\n\n0.24\n\n2\n3\n\n10-1\n\n1.20\n3.07\n4.68\n6.85\n11.4\n\n10-2\n10-3\n\n10-1\n\n10-4 -1\n10\n\n100\n\n101\n\n102\n\n43.9\n\n10-2\n1\n2\n10-5\n\n10-4\n\n10-3\n\n10-2\n\n10-1\n\n100\n\n101\n\n102\n\nFigure 5. Rescaled position of the meniscus (zm /`)(2E )−1/2 as a function of √time\nT = t/τve = t Bh30 /(3μ`6 ). The solid line corresponds to a diffusive-like behaviour Zm ∝ E T .\nInset: evolution of the cross-over time T 0 at which the meniscus position deviates from the classical prediction as a function of E , for experiments (◦) and numerics (+). Numerical solutions\nare described in §4. The solid line represents the predicted scaling T 0 ∝ E −3/2 .\n\nhas elapsed, the sheets begin to coalesce and the meniscus accelerates until eventually\nreaching its equilibrium height.\nTo obtain a better understanding of the dynamics of elastocapillary rise, we compare\nthe motion of the meniscus for several experiments as the elastocapillary number E is\nprogressively increased. Since the meniscus position at early times is given by zm ∝ t1/2 ,\nor equivalently, in dimensionless terms, Zm = zm /` ∝ E 1/2 (t/τve )1/2 , we use the characteristic length and time scales `E 1/2 and τve , respectively, to rescale the experimental\ndata. The evolution of the dimensionless position of the meniscus (zm /`)(2E )−1/2 with\ntime T = t/τve is presented in Fig. 5. The family of curves obtained for various E values\ncollapse onto the same line at early√\ntimes, corresponding to a diffusive-like behaviour of\nthe advancing meniscus, i.e. Zm ∝ E T . Here, we have used ∝ to distinguish order-ofmagnitude results from results indicating proportionality. We have also verified that the\nfluid viscosity enters the dynamics only through τve , as shown by the collapse, in Fig. 5,\nof the curves for three different viscosities (V10, V50, and V100) at E = 11.4.\nThe position of the meniscus deviates from T 1/2 at a time T 0 . Increasing E decreases\nthis cross-over time T 0 , as the sheets bend more easily. Neglecting the deceleration due to\ngravity, we expect this deviation to occur when the deflection of the sheets due to capillary\nforces becomes important, that is for zm ∼ `ec , or in dimensionless terms, Zm ∼ E −1/4 .\n2\nBefore reaching this value, the meniscus evolves accordingly to T ∝ Zm\n/E . Hence, we\n0\n−3/2\n0\nexpect a cross-over time of T ∝ E\n. The dependence of T on E is given in the inset\nof Fig. 5. The predicted scaling is indeed recovered. For times greater than the cross-over\ntime, the speed of the meniscus slows down dramatically. As the elastocapillary number\nE is increased, the motion of the meniscus becomes increasingly complex. In particular,\n\n\f8\n\nC. Duprat, J. M. Aristoff and H. A. Stone\n\nwe observe a plateau region followed by an acceleration of the meniscus. In order to\nunderstand this behaviour quantitatively, we now formulate a theoretical model for the\ndynamics of elastocapillary rise.\n\n3. Theoretical formulation\nIn this section we formulate a free-boundary problem that describes the evolution\nof the shape of the sheets and the rise of liquid between them. We first consider the\ndeflection of the initially vertical sheets. Owing to the symmetric configuration, we need\nonly consider one of the sheets. Provided that the initial gap, 2h0 (set by the clamping\ndistance), is much less than the length of the sheet, `, the slope of the sheet, h0 /`, is\nsmall. We assume that the sheet is sufficiently thin, b \u001c w \u001c `, so that we may use the\nlinear theory of beams to describe the deflection, h(z, t), from the vertical. Hence,\nBhzzzz + mhtt = p(z, t),\n\n(3.1)\n\nwhere subscripts denote partial derivatives, B = Eb3 /12(1 − ν 2 ) is the bending stiffness\nper unit width, E the Young's modulus, ν the Poisson ratio, m the mass per unit length\nper unit width, and p(z, t) the force per unit area (pressure) acting on the sheet. The\nsecond term in (3.1) arises from the inertia of the beam, and may be neglected if the time\nscale of the\nqflow, τve , is much longer than the reaction time of the beam to an applied\n4\n\nload, τ = m`\nB , obtained by balancing the characteristic bending and inertial stresses.\nWe use this quasi-static description of the sheet wherein τve \u001d τ . Hence, in the following,\nBhzzzz = p(z, t).\n\n(3.2)\n\nWe note that the weight of the sheet gives rise to a stretching strain of order mg`/Eb.\nComparing this to a typical bending strain Bh0 /`2 leads to a maximum length `s ∼\n\u00011/3\nEb2 h0 /mg\n, below which stretching effects can be ignored. In our experimental study,\nwe have ` \u001c `s ' 40 cm.\nWe now consider the incompressible, viscous flow of a perfectly wetting liquid (θe = 0)\nthat enters the region between the sheets owing to a reduction in pressure at the meniscus\nrelative to the bath. Our results are extendable to partially wetting liquids (0 < θe <\nπ/2). In what follows, we take the limit h0 \u001c w, relevant to our experiments, so that\nedge effects may be safely neglected. Hence, the pressure drop is given by γκ, where\nκ = cos θd /h(zm , t) is the curvature at the meniscus z = zm (t) and θd is the apparent\ndynamic contact angle. Dynamical features of the moving contact line are treated by\nusing a semi-empirical relationship for the case of total wetting, in which the dynamic\ncontact angle, θd , is defined as\n\u0012\n\u00131/3\nΓμ dz\nθd =\n,\n(3.3)\nγ dt\nas first measured by Hoffman (1975) and later established by Tanner (1979). This relationship accounts for viscous dissipation at the contact line and leads to a reduced driving\npressure during imbibition (Guyon et al. 2001). The parameter Γ = 6 ln (xM /xm ) arises\nfrom evaluating the viscous dissipation near the contact line, where it is necessary to\nintroduce the upper xM and lower xm cut-off lengths to prevent the divergence of the\nintegral measuring the total viscous dissipation. No exact solution for the microscopic\ndescription is currently available, and thus we treat Γ as an adjustable parameter. In\norder to determine its value for our experimental study, we performed a series of control\n\n\fDynamics of elastocapillary rise\n\n9\n\nexperiments where we examined the imbibition of silicone oil between rigid glass boundaries, both in planar and axisymmetric configurations, and with and without gravity.\nThe value of Γ which best describes the results of these control experiments is Γ = 60,\nand so we take it to have this value in our numerical simulations of elastocapillary rise.\nThis value of Γ is comparable with those found in the literature. Finally, we note that\nour numerical results are only slightly dependent on the value of Γ; simulations with\n50 < Γ < 70 give similar results.\nA one-dimensional approximation to the viscously dominated flow is given by Darcy's\nlaw,\n∂p\nμu\n=−\n− ρg,\n(3.4)\nk\n∂z\nwhere u is the cross-sectionally averaged liquid velocity, p the local pressure and z the\naxial coordinate. The permeability, k = h2 /3, where 2h is the total distance between\nthe sheets, is based on the lubrication approximation (Guyon et al. 2001) which requires\n|hz | \u001c 1, and is consistent with our description of the sheets.\nDifferentiating (3.2) once in z and combining the result with (3.4) gives an expression\nfor the liquid velocity,\nh2\n(Bhzzzzz + ρg) ,\n(3.5)\nu(z, t) = −\n3μ\nwhich may be evaluated at z = zm (t) to find an expression for the speed of the meniscus.\nNext, combining (3.5) with the statement of mass conservation, ht + (hu)z = 0, yields a\nnonlinear evolution equation for the deflection of the sheets in the liquid-filled region:\nht =\n\nh2\n(Bhhzzzzzz + 3Bhz hzzzzz + 3ρghz ) .\n3μ\n\n(3.6)\n\nLet h̃(z, t) denote the deflection of the sheets in the liquid-free region. Using (3.2) with\np(z, t) = 0, we have\nB h̃zzzz = 0,\n\n(3.7)\n\nwhich may be integrated analytically. Equation (3.6) is similar to the equation studied\nby Hosoi & Mahadevan (2004), who considered the dynamics of an elastic sheet that was\nclamped at one end and lubricated from below by a single fluid. Our study is distinguished\nby the influence of surface tension and the presence of two fluids whose boundary advances\naccording to (3.5) and depends on the local shape of the sheet.\nThe evolution equation and boundary conditions may be rendered dimensionless using\nthe characteristic length and time scales presented in §2.1. Letting H = h/h0 , Z = z/`,\nZm = zm /`, and T = t/τve , transforms (3.5), evaluated at the meniscus, to\ndZm\n= −H 2 (HZZZZZ + E B)\ndT\n\n(3.8)\nZ=Zm\n\nand (3.6) to\nHT = H 3 HZZZZZZ + 3H 2 HZ HZZZZZ + 3E BH 2 HZ .\n\n(3.9)\n\nTwo initial conditions and six boundary conditions are necessary to solve the freeboundary problem specified by (3.8) and (3.9). The first two boundary conditions are\nHZZ (0, T ) = 0, and HZZZZ (0, T ) = 0. These correspond, respectively, to zero moment\nand zero pressure (relative to the atmosphere) at the lower end of the sheets. If the\nfree ends of the sheets remain open (Regime I), we have the condition HZZZ (0, T ) = 0,\nwhich corresponds to zero force at the lower end of the sheets. If the sheets are in\ncontact (Regime II), they exert an equal but opposite force on each other, and the\n\n\f10\n\nC. Duprat, J. M. Aristoff and H. A. Stone\n\nTable 1. Boundary conditions for (3.9) in each of the three temporal regimes: Regime I (open\nends), Regime II (ends in contact), and Regime III (ends coalescing).\nRegime I\n\nRegime II\n\nRegime III\n\nHZZ (0, T ) = 0\nHZZZZ (0, T ) = 0\nHZZZ (0, T ) = 0\nH(0, T ) = 0\n\nH(Z 6 Zc , T ) = 0\nHZ (Z 6 Zc , T ) = 0\n\nHZZZZ (Zm , T ) = −E cos θd /H(Zm )\nH(Zm , T ) = 1 − 31 (HZZZ (Zm , T ))(Zm − 1)3 + 12 HZZ (Zm , T )(Zm − 1)2\nHZ (Zm , T ) = − 21 (HZZZ (Zm , T ))(Zm − 1)2 + HZZ (Zm , T )(Zm − 1)\n\nforce-free condition HZZZ (0, T ) = 0 must be replaced by H(0, T ) = 0. If the sheets\nare in contact over a finite length 0 < Z 6 Zc (T ), where Zc = zc /` and zc is the\nhighest point at which the sheets contact, as in Regime III, we have an additional unknown, Zc , and an additional condition HZ (Zc , T ) = 0, that enforces a tangentially\nsmooth contact between the sheets. At the meniscus, the jump in pressure given by\n(3.2) is equal to the Laplace pressure γκ, which can be written in dimensionless form as\nHZZZZ (Zm , T ) − H̃ZZZZ (Zm , T ) = −E cos θd /H(Zm ).\nThe remaining two boundary conditions for H(Z, T ) are obtained by expressing the\nmatching conditions at the meniscus between the liquid-filled and the liquid-free regions\nin terms of the boundary conditions at the top end of the sheet (fixed and clamped,\ni.e. H̃(1, T ) = 1 and H̃Z (1, T ) = 0). Combining the conditions of equal deflection\nH̃(Zm , T ) = H(Zm , T ), equal slope H̃Z (Zm , T ) = HZ (Zm , T ), equal moment H̃ZZ (Zm , T ) =\nHZZ (Zm , T ) and equal shear force (since the liquid is perfectly wetting) H̃ZZZ (Zm , T ) =\nHZZZ (Zm , T ), yields\n1\n1\nH(Zm , T ) = 1 − (HZZZ (Zm , T ))(Zm − 1)3 + HZZ (Zm , T )(Zm − 1)2\n3\n2\n\n(3.10)\n\n1\nHZ (Zm , T ) = − (HZZZ (Zm , T ))(Zm − 1)2 + HZZ (Zm , T )(Zm − 1).\n2\n\n(3.11)\n\nand\n\nIn doing so, the solution of (3.9) for the deflection of the sheets in the liquid-filled region\nautomatically satisfies the boundary conditions at Z = 1, and prescribes the deflection of\nthe sheets in the liquid-free region Zm < Z 6 1. The boundary conditions are summarized\nin Table 1. Finally, we take for the initial conditions H(Z, 0) = 1 and Zm (0) = 0.001.\n\n\fDynamics of elastocapillary rise\n\n11\n\n4. Solution of the free-boundary problem\nThe solution to the free-boundary problem defined in §3 is divided into two stages. For\nearly times (T \u001c 1) the deflection of the sheets is small, time enters only through the\nboundary conditions at Zm (T ), and the free-boundary problem admits the approximate\nsolution\nH(Z, T ) = 1 −\n\nE Z5\n+\n120Zm\n\n\u0012\n\n3\nZm\nZ2\nZm\n− m+\n8\n3\n4\n\n\u0013\n\nEZ +\n\n\u0012\n\nZm\nZ3\n1\n− m−\n6\n30\n6\n\n\u0013\n\nE Zm ,\n\n(4.1)\n\nfor the deflection of the sheets in the liquid-filled region, and the liquid advances as though\nit were between rigid sheets. Hence, with Ẑm = Zm B = zm /`cg and T̂ = T E B 2 = t/τr ,\nwe find\ndẐm\ndT̂\n\n=\n\ncos θd\nẐm\n\n− 1,\n\n(4.2)\n\nin accordance with classical capillary rise. When cos θd = 1, (4.2) can be integrated to\ngive an implicit expression for Ẑm (T̂ ):\nT̂ = −Ẑm − ln(1 − Ẑm ).\n\n(4.3)\n\np\n√\nAt early times, (4.3) reduces to Ẑm (T̂ ) = 2T̂ , or equivalently, Zm (T ) = 2E T for\nZm \u001c B −1 . When cos θd 6= 1, the meniscus is slowed down at early time and reaches the\nclassical behaviour at late times.\nFor late times, when the deflection of the sheets is significant, we solve numerically\nthe free-boundary problem using a method similar to the one described in Aristoff et al.\n(2010). We transform the time-dependent domain 0 6 Z 6 Zm (T ) to the fixed domain 0 6 S 6 1 via the substitution S = Z/Zm (T ), and rewrite the time and spatial\nderivatives in (3.8) and (3.9) accordingly. Then, the resulting equations and boundary\nconditions are discretized using an implicit finite-difference scheme and solved numerically in MATLAB R . We use for initial conditions the profile predicted by (4.1) and the\nmeniscus speed given by (4.2).\nThe evolution of the position of the meniscus obtained from our numerical simulation\nis shown in Fig. 6. Comparison with experiments (Fig. 5) shows √\nthat our model captures the essential features of the experiments, the collapse onto E T at early times,\nand the observed plateau and subsequent acceleration at late times and for large E .\nAt early√times, the position of meniscus follows the expected diffusive-like behaviour\nZm = α 2E T . The pre-factor α = 0.65 < 1 arises solely from the deceleration induced\nby the dynamic contact angle (3.3) and is identical in the experiments and in the numerical solutions. Direct comparison between the experimental and numerical results (inset\nin Fig. 6) shows good quantitative agreement between the experimental data and the\ncorresponding numerical solutions. The discrepancy at late times may result from the\ndifficulty in accurately measuring the bending stiffness B or the presence, in Regimes II\nand III, of a thin liquid layer between the sheets, which is neglected in the numerics and\neffectively increases the gap in the experiments. We also verify the scaling law for the\ncross-over time T 0 (inset in Fig. 5) with a numerical pre-factor of 0.25 corresponding to\na cross-over when the meniscus reaches zm ' 0.5 `ec . For E > 35, the equilibrium shape\nis not achieved in the simulations, owing to the meniscus speed reaching nearly zero in\nthe plateau region.\n\n\f12\n\nC. Duprat, J. M. Aristoff and H. A. Stone\n\n100\n\n0.24\n\n100\n\n0.24\n\n1.20\n3.07\n4.68\n6.85\n11.4\n\n1.20\n3.07\n4.68\n6.85\n\n-1\n\n10\n\n10-1\n\n10-2\n\n10-1\n\n100\n\n11.4\n\n101\n\n30\n\n10-2\n\n10-5\n\n10-4\n\n10-3\n\n10-2\n\n10-1\n\n100\n\n101\n\n102\nBh3\n\nFigure 6. Rescaled position of the meniscus (zm /`)(2E )−1/2 as a function of time t/τve = t 3μ`06\n√\nfor numerics. The solid line corresponds to Zm = α 2E T with a pre-factor of α ' 0.65 due to\nthe dynamic contact angle effect given by (3.3). Inset: direct comparison between experimental\ndata (grey points) and numerical solutions (black lines).\n\n5. Discussion\nThe interpretation of our results may be made by considering the geometry of the\nchannel. As the sheets are deflected, the gap evolves from being uniform to having a\ndiverging geometry when the sheets touch. The asymptotic behaviours of the position\nof the meniscus are shown in Fig. 7a (experiment) and Fig. 7b (numerics) for matching\nvalues of E and B. We first consider the experimentally observed dynamics (Fig. 7(a)). At\nearly times, the meniscus obeys the diffusive law Zm ∝ T 1/2 expected for a uniform gap\nin the absence of gravity. When T = T 0 , the deflection of the sheets becomes important\nand the gap resembles a wedge. The meniscus follows the power law expected in a wedge\ngeometry Zm ∝ T 1/3 (Warren 2004). We then observe a plateau of duration τwait during\nwhich the meniscus advances slowly. The channel formed by the two sheets adopts a\ncomplex geometry, and the data roughly follows a power law Zm ∝ T 1/13 . This behaviour\nis consistent with imbibition in a diverging channel having shape h(z) = h0 + βz n , where\nthe time-dependence of the meniscus position is given by Zm ∝ T 1/(2n+1) (Reyssat et al.\n2008). Our results are close to n = 6, although any value of n > 1, hence an exponent of\n1/(2n + 1) < 1/3, is permissible. We note, however, that gravity will slow down the rise\nof liquid and so the analogy is qualitative at best.\nThe asymptotic behaviours found experimentally are recovered in the numerical results\n(Fig. 7(b)), which allow us to accurately investigate the changes in the shape of the\nsheets during imbibition. In particular, we identify the time at which the sheets touch\n(T = 1.18 * 10−1 ) as the time at which the meniscus reaches a plateau, before accelerating\nowing to the new geometry of the channel. We obtain good agreement between the\nexperimental data and the corresponding numerical solution. Nevertheless, the duration\n\n\fDynamics of elastocapillary rise\n\n13\n\n13\n\n1\n-1\n\n10\n\nτwait\n\n1\n3\n1\n2\n\n(a)\n\n10-3\n\n10-2\n\n10-1\n\n100\n\n1\n\n101\n\n13\n\n-1\n\n10\n\nτwait\n\n1\n3\n1\n2\n10-3\n\n(b)\n10-2\n\n10-1\n\n100\n\n101\n\nFigure 7. Position of the meniscus (zm /`)(2E )−1/2 versus time for √\nE = 11.4, B = 2 for (a)\n1/2\n. When T = T 0 ,\nexperiments and (b) numerics. The solid lines correspond to Zm = 0.65 2E T √\nthe meniscus follows the power law expected in a wedge geometry Zm = 0.28 2E T 1/3 (dashed\nlines). At later times, the channel formed by the two sheets adopts a complex geometry and the\nmeniscus roughly follows a power law Zm ∝ T 1/13 (dash-dotted lines) with a pre-factor of 0.12\n(experiments) and 0.11 (numerics). Insets show (a) processed experimental photographs and (b)\ncomputed profiles. The corresponding times are denoted by the symbols (•) on the grey curves.\n\nof the plateau τwait is overestimated in the numerical version of the imbibition, due to\nthe sensitivity of the numerical scheme as the speed of the meniscus approaches zero.\nIn closing, we have provided a framework to study the dynamics of capillary-driven\nflow between flexible boundaries, with particular attention given to a model system where\ncapillarity, elasticity, and gravity compete. We have identified the relevant length and\ntime scales, and shown that the time to reach equilibrium sharply increases with increasing elasticity of the boundaries. Since so many natural phenomena involve elastocapillary\neffects, it is reasonable to think that the dynamical features we describe here will be useful for rationalizing the time-dependent behaviour of a variety of biological and industrial\nsystems.\nC.D. and H.A.S. gratefully acknowledge financial support from Unilever Research;\nJ.M.A. acknowledges the National Science Foundation Mathematical Sciences Postdoc-\n\n\f14\n\nC. Duprat, J. M. Aristoff and H. A. Stone\n\ntoral Research Fellowship Program. We thank D. Vella, and P. Warren and A. Lips at\nUnilever Research for helpful conversations.\n\nREFERENCES\nAndrade, J. D., King, R. N. & Gregonis, D. E. 1979 Surface characterization of\npoly(hydroxyethyl methacrylate) and related polymers. J. Polym. Sci.: Polym. Symp. 66,\n313–336.\nAristoff, J. M., Duprat, C. & Stone, H. A. 2010 Elastocapillary imbibition. Inter. J.\nNonlinear Mech. p. doi:10.1016/j.ijnonlinmec.2010.09.001.\nBell, J. M. & Cameron, F. K. 1906 The flow of liquids through capillary spaces. J. Phys.\nChem. 10, 658–674.\nBico, J., Roman, B., Moulin, L. & Boudaoud, A. 2004 Elastocapillary coalescence in wet\nhair. Nature 432, 690.\nde Boer, M. P. & Michalske, T. A. 1999 Accurate method for determining adhesion of\ncantilever beams. J. App. Phys. 86, 817–827.\nEisner, T. & Aneshansley, D. J. 2000 Defense by foot adhesion in a beetle (hemisphaerota\ncyanea). PNAS 97, 6568–6573.\nFortes, M. A. 1984 Deformation of solid surfaces due to capillary forces. J. Colloid Int. Science\n100, 17–26.\nGuyon, E., Hulin, J.-P. & Petit, L. 2001 Physical Hydrodynamics. Oxford, UK: Oxford\nUniversity Press.\nHoffman, R. L. 1975 A study of the advancing interface: 1. interface shape in liquid-gas\nsystems. Phys. Rev. E 50, 228–241.\nvan Honschoten, J. W., Escalante, M., Tas, N. R., Jansen, H.V. & Elwenspoek, M.\n2007 Elastocapillary filling of deformable nanochannels. J. App. Phys. 101, 094310.\nHosoi, A. E. & Mahadevan, L. 2004 Peeling, healing, and bursting in a lubricated elastic\nsheet. Phys. Rev. Lett. 93, 137802.\nHuang, J., Juszkiewicz, M., de Jeu, W. H., Cerda, E., Emrick, T., Menon, N. & Russell, T. P. 2007 Capillary wrinkling of floating thin polymer films. Science 317, 650–653.\nKim, Ho-Young & Mahadevan, L. 2006 Capillary rise between elastic sheets. J. Fluid Mech.\n548, 141–150.\nLester, G. R. 1961 Contact angles of liquids at deformable solid surfaces. J. Colloid Science\n16, 315–326.\nMastrangelo, C. H. & Hsu, C. H. 1993 Mechanical stability and adhesion of microstructures\nunder capillary forces. J. Microelectromech. Systems 2, 33–55.\nPericet-Camara, R., Best, A., Butt, H.-J. & Bonaccurso, E. 2008 Effect of capillary\npressure and surface tension on the deformation of elastic surfaces by sessile liquid microdrops: An experimental investigation. Langmuir 24, 10565–10568.\nPokroy, B., Kang, S. H., Mahadevan, L. & Aizenberg, J. 2009 Self-organization of a\nmesoscale bristle into ordered, hierarchical helical assemblies. Science 323, 237–240.\nPy, C., Reverdy, P., Doppler, L., Bico, J., Roman, B. & Baroud, C. N. 2007 Capillary\norigami: spontaneous wrapping of a droplet with an elastic sheet. Phys. Rev. Lett. 98,\n156103.\nQuere, D. 1997 Inertial capillarity. Europhys. Lett 39, 533–538.\nReyssat, M., Courbin, L., Reyssat, E. & Stone, H. A. 2008 Imbibition in geometries with\naxial variation. J. Fluid Mech. 615, 335–344.\nSiddique, J. I., Anderson, D. M. & Bondarev, A. 2009 Capillary rise of a liquid into a\ndeformable porous material. Phys. Fluids 21, 013106.\nTanner, L. H. 1979 The spreading of silicone oil drops on horizontal surfaces. J. Phys. D: Appl.\nPhys. 12, 1473.\nWarren, P. B. 2004 Late stage kinetics for various wicking and spreading problems. Phys. Rev.\nE 69, 041601.\n\n\f"}