{"id": "http://arxiv.org/abs/0709.3108v1", "guidislink": true, "updated": "2007-09-19T20:56:59Z", "updated_parsed": [2007, 9, 19, 20, 56, 59, 2, 262, 0], "published": "2007-09-19T20:56:59Z", "published_parsed": [2007, 9, 19, 20, 56, 59, 2, 262, 0], "title": "Integrable systems without the Painlevé property", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0709.0960%2C0709.2504%2C0709.0515%2C0709.2016%2C0709.3344%2C0709.2705%2C0709.2920%2C0709.2102%2C0709.1303%2C0709.4413%2C0709.0888%2C0709.3358%2C0709.2940%2C0709.2925%2C0709.3882%2C0709.4175%2C0709.1852%2C0709.0231%2C0709.3082%2C0709.4138%2C0709.3017%2C0709.2530%2C0709.2776%2C0709.0493%2C0709.2038%2C0709.2976%2C0709.3117%2C0709.4447%2C0709.2415%2C0709.0930%2C0709.1646%2C0709.1273%2C0709.0929%2C0709.2680%2C0709.0700%2C0709.4159%2C0709.1565%2C0709.4316%2C0709.1485%2C0709.4289%2C0709.1407%2C0709.1240%2C0709.1204%2C0709.1036%2C0709.1433%2C0709.3767%2C0709.0285%2C0709.1122%2C0709.0558%2C0709.1822%2C0709.2345%2C0709.3158%2C0709.1072%2C0709.2001%2C0709.3150%2C0709.2749%2C0709.0759%2C0709.2378%2C0709.2557%2C0709.0244%2C0709.0183%2C0709.4280%2C0709.3331%2C0709.0796%2C0709.2890%2C0709.0732%2C0709.3858%2C0709.0890%2C0709.1582%2C0709.1006%2C0709.0157%2C0709.0547%2C0709.1111%2C0709.3142%2C0709.1812%2C0709.3338%2C0709.0554%2C0709.3233%2C0709.2423%2C0709.0223%2C0709.3864%2C0709.2092%2C0709.0408%2C0709.0675%2C0709.0623%2C0709.1828%2C0709.1738%2C0709.1671%2C0709.2173%2C0709.3965%2C0709.3239%2C0709.1427%2C0709.1597%2C0709.1601%2C0709.2366%2C0709.4060%2C0709.4456%2C0709.1389%2C0709.4465%2C0709.3108%2C0709.1480&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Integrable systems without the Painlevé property"}, "summary": "We examine whether the Painlev\\'e property is a necessary condition for the\nintegrability of nonlinear ordinary differential equations. We show that for a\nlarge class of linearisable systems this is not the case. In the discrete\ndomain, we investigate whether the singularity confinement property is\nsatisfied for the discrete analogues of the non-Painlev\\'e continuous\nlinearisable systems. We find that while these discrete systems are themselves\nlinearisable, they possess nonconfined singularities.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0709.0960%2C0709.2504%2C0709.0515%2C0709.2016%2C0709.3344%2C0709.2705%2C0709.2920%2C0709.2102%2C0709.1303%2C0709.4413%2C0709.0888%2C0709.3358%2C0709.2940%2C0709.2925%2C0709.3882%2C0709.4175%2C0709.1852%2C0709.0231%2C0709.3082%2C0709.4138%2C0709.3017%2C0709.2530%2C0709.2776%2C0709.0493%2C0709.2038%2C0709.2976%2C0709.3117%2C0709.4447%2C0709.2415%2C0709.0930%2C0709.1646%2C0709.1273%2C0709.0929%2C0709.2680%2C0709.0700%2C0709.4159%2C0709.1565%2C0709.4316%2C0709.1485%2C0709.4289%2C0709.1407%2C0709.1240%2C0709.1204%2C0709.1036%2C0709.1433%2C0709.3767%2C0709.0285%2C0709.1122%2C0709.0558%2C0709.1822%2C0709.2345%2C0709.3158%2C0709.1072%2C0709.2001%2C0709.3150%2C0709.2749%2C0709.0759%2C0709.2378%2C0709.2557%2C0709.0244%2C0709.0183%2C0709.4280%2C0709.3331%2C0709.0796%2C0709.2890%2C0709.0732%2C0709.3858%2C0709.0890%2C0709.1582%2C0709.1006%2C0709.0157%2C0709.0547%2C0709.1111%2C0709.3142%2C0709.1812%2C0709.3338%2C0709.0554%2C0709.3233%2C0709.2423%2C0709.0223%2C0709.3864%2C0709.2092%2C0709.0408%2C0709.0675%2C0709.0623%2C0709.1828%2C0709.1738%2C0709.1671%2C0709.2173%2C0709.3965%2C0709.3239%2C0709.1427%2C0709.1597%2C0709.1601%2C0709.2366%2C0709.4060%2C0709.4456%2C0709.1389%2C0709.4465%2C0709.3108%2C0709.1480&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We examine whether the Painlev\\'e property is a necessary condition for the\nintegrability of nonlinear ordinary differential equations. We show that for a\nlarge class of linearisable systems this is not the case. In the discrete\ndomain, we investigate whether the singularity confinement property is\nsatisfied for the discrete analogues of the non-Painlev\\'e continuous\nlinearisable systems. We find that while these discrete systems are themselves\nlinearisable, they possess nonconfined singularities."}, "authors": ["Alfred Ramani", "Basile Grammaticos", "Sébastien Tremblay"], "author_detail": {"name": "Sébastien Tremblay"}, "author": "Sébastien Tremblay", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1088/0305-4470/33/15/311", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/0709.3108v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0709.3108v1", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "math-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "math-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "math.MP", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0709.3108v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0709.3108v1", "arxiv_comment": null, "journal_reference": "Journal of Physics A: Mathematical and General, 2000, 33, No 15,\n  3045-3052", "doi": "10.1088/0305-4470/33/15/311", "fulltext": "arXiv:0709.3108v1 [math-ph] 19 Sep 2007\n\nIntegrable systems without the Painlevé property\n\nA. Ramani\nCPT, Ecole Polytechnique\nCNRS, UMR 7644\n91128 Palaiseau, France\nB. Grammaticos\nGMPIB, Université Paris VII\nTour 24-14, 5e étage, case 7021\n75251 Paris, France\nS. Tremblay\nCentre de Recherches Mathématiques\net Département de Physique\nUniversité de Montréal\nC.P. 6128, Succ. Centre-ville\nMontréal, H3C 3J7, Canada\n\nAbstract\nWe examine whether the Painlevé property is a necessary condition for the integrability of nonlinear ordinary differential equations. We show that for a large class\nof linearisable systems this is not the case. In the discrete domain, we investigate\nwhether the singularity confinement property is satisfied for the discrete analogues of\nthe non-Painlevé continuous linearisable systems. We find that while these discrete\nsystems are themselves linearisable, they possess nonconfined singularities.\n\n\f1. Introduction\n\nFor over a century, the Painlevé property [1] has been the cornerstone of integrability.\nThe reason Painlevé introduced this property, which later was called after him, was\na question that was open at the time, and of particular interest: 'Is it possible to\ndefine (new) functions from the solutions of nonlinear differential equations?'\nIn some sense, this amounted to introducing the analogue of special functions into\nthe nonlinear domain. The study of linear equations had shown where the difficulties\nlied [2]. In particular, one had to deal with the multivaluedness that could appear\nas a consequence of the singularities of the coefficients of the equation which, for\nlinear equations, are the only possible singularities of the solutions. The extension\nof these ideas to the nonlinear domain appeared hopeless since the location of bad\nsingularities could now depend on the initial conditions. Then Painlevé made a\nleap of faith by requesting that all critical (i.e. multivalued) movable (i.e. initial\ncondition dependent) singularities be absent.\nThe ordinary differential equations (ODE's) without critical movable singularities\nare said to possess the Painlevé property. Their solutions define functions which\nin some cases (the Painlevé transcendents) cannot be expressed in terms of known\nfunctions. The precise way to integrate (i.e. to construct the solutions of) the\nODE's with the Painlevé property can be very complicated [3] but the important\nfact is that this can in principle be done. Thus, the property came to be synonymous to integrability. At this point it must be made clear that the integrability\nwe are talking about, related to the Painlevé property, is of a special kind often\nreferred to as 'algebraic integrability' [4]. It is, for instance, the kind of integrability\nthat characterises systems integrable in terms of Inverse Scattering Transform (IST)\ntechniques [5]. However, in common practice, many other 'brands' of integrability\ndo exist [6]. Integrability through quadratures, like that encountered in the case\nof finite-dimensional Hamiltonian systems, is of (relatively) frequent occurence, and\nis not identical to algebraic integrability. Linearisability, i.e. the reduction of the\nsystem to a system of linear equations through local transformation, is a further,\ndifferent, type.\nIn this paper, we shall examine the relation of these kinds of integrability to the\nPainlevé property, focusing on linearisable systems. In the second part of the paper,\nwe shall examine the discrete analogues of these notions. In this case, the role of the\nPainlevé property is played by singularity confinement [7]. The latter is believed to\nbe a necessary condition for integrability (but unlike the Painlevé property it has\nturned out not to be sufficient as well [8]). We shall show that in both continuous\nand discrete settings, linearisable systems integrable through linearisation can exist\nwithout the Painlevé property.\n\n\f2. Integrable continuous systems and the Painlevé property.\nA first instance of integrability without the Painlevé property was the derivation of\nthe integrable system described by the Hamiltonian [9]:\nH=\n\n1 2 1 2\n3\npx + py + y 5 + y 3 x2 + yx4\n2\n2\n16\n\n(2.1)\n\nwhich has the second (besides the energy) constant of motion\n1\n3\n1\nC = −yp2x + xpx py + y 4 x2 + y 2 x4 + x6 .\n2\n8\n32\n\n(2.2)\n\nThere are movable singularities where near some singular point t0 , one has y ≈\nα(t − t0 )−2/3 , x ≈ β(t − t0 )−1/3 with α3 = −2/9, β arbitrary. Taking the cube\nof the variables is not sufficient to regularise them, however. Indeed, a detailed\nanalysis of complex-time singularities shows that their expansions contain all powers\nof (t − t0 )1/3 . The fact that some multivaluedness was compatible with integrability\nled to the introduction of the notion of \"weak Painlevé\" property. However, it\nwas soon realised [10] that (2.1) was a member of a vaster family of integrable\nHamiltonian\nsystems associated to the potential V = (F (ρ + y) + G(ρ − y))/ρ where\np\n2\n2\nρ = x + y . Since the two functions F and G are free, one can easily show that\nthe singularities of the solutions of the equations of motion can be arbitrary. The\nHamiltonians of this family are integrable through quadratures and, in fact, the\nassociated Hamilton-Jacobi equations are separable. This leads to the conclusion\nthat this type of integrability is not necessarily related to the Painlevé property.\n(As a matter of fact, the same conclusion could have been reached if we had simply\nconsidered one-dimensional Hamiltonian systems). One may justifiably argue that\nin the case of Hamiltonian systems the term integrability is to be understood as\nLiouville integrability which is not the one we refer to in relation to the Painlevé\nproperty. Still, Liouville integrability, and the dynamical symmetries to which it is\nassociated, may be of utmost importance for physical applications and a systematic\nmethod for the detection would have been most welcome.\nWe turn now to a second case of integrability where the necessary character of the\nPainlevé property can be critically examined: that of linearisable systems. The term\nlinearisable is used here to denote systems that can be reduced to linear equations\nthrough a local variable transformation. The first family of such systems are the\nprojective ones [11]. Starting from the linear system for (N +1) variables:\nXμ′\n\n=\n\nN\nX\n\nAμν Xν\n\nμ = 0, 1, . . . , N\n\n(2.3)\n\nν=0\n\nand introducing the quantities xμ = Xμ /X0 we obtain the projective Riccati system:\nx′μ\n\n= aμ +\n\nN\nX\n\nν=1\n\nbμν xν + xμ\n\nN\nX\n\nν=1\n\ncμν xν\n\nμ = 1, . . . , N\n\n(2.4)\n\n\fwhere aμ , bμν and cμν are given in terms of Aμν . As we have shown in [12] this\nsystem can be rewritten as a single N -th order differential equation. For N =1, this\nis just the Riccati equation for x1 :\nx′1 = a1 + b11 x1 + c11 x21\n\n(2.5)\n\nFor N =2, the system can be reduced to the equation VI of the Painlevé/Gambier\nclassification [2]\nd2 w\ndw\ndw\n= −3w\n− w3 + q(z)(\n+ w2 )\n(2.6)\n2\ndz\ndz\ndz\nfor z some function of the independent variable of (2.4) and w a homographic function of x1 with some specific functions of z as coefficients. Because of the underlying\nlinearisation, the projective Riccati systems possess the Painlevé property by construction. Indeed, the Xμ have no movable singularities at all, and the only movable\nsingularities of the xμ are poles coming from the zeros of X0 .\nHowever, there exists another kind of linearisability for which the Painlevé property\nneed not be satisfied. Let us discuss the best-known second order case. One of the\nequations of the Painlevé/Gambier classification, bearing the number XXVII, is the\nequation proposed by Gambier [13]:\n\u0013\n\u0012\nnf 2\nn−2\nn(f ′ − f φ) 2\n1\nn − 1 x′2\n3\n′′\nx′ −\n+ fx + φ −\nx\n+\nx + ψx − φ −\nx =\n2\nn x\nnx\n(n + 2)\nn+2\nnx\n(2.7)\nwhere f , φ and ψ are definite rational functions of two arbitrary analytic functions\nand of their derivatives [2]. As Gambier has shown, equation (2.7) can be written\nas a system of two Riccati equations in cascade:\ny ′ = −y 2 + φy +\n\n2f\nψ\n+\nn(n + 2)\nn\n\n(2.8a)\n\nnf 2\nx + nyx + 1.\n(2.8b)\nn+2\nGambier has shown that unless the parameter n appearing in (2.7) and (2.8) is\ninteger, the equation does not possess the Painlevé property. (We must point out\nthat this is a first necessary condition and, in general, not a sufficient one: further\nconstraints on the coefficients are needed in order to ensure the Painlevé property).\nOn the other hand, the integration of the two Riccati equations in cascade can always\nbe performed, through reduction to linear second order equations. Thus, although\nthe solution of (2.8) does not in general lead to a well-defined function as solution\nof (2.7), it can still be obtained in cascade.\nx′ =\n\nOnce the Painlevé property is deemed unnecessary for the linearisation of the Gambier system, it is straightforward to extend the latter to the form:\ny ′ = αy 2 + βy + γ\n\n(2.9a)\n\n\fx′ = a(y, t)x2 + b(y, t)x + c(y, t)\n\n(2.9b)\n\nwhere α, β and γ are arbitrary functions of t while a, b and c are arbitrary functions\nof y and t. The integration in cascade of (2.9) can be obtained as previously. As\na matter of fact, an extension like (2.9) gives the handle to the (N +1)-variables\ngeneralisation of the Gambier system:\nx′0 = a0 (t)x20 + b0 (t)x0 + c0 (t)\nx′μ = aμ (x0 , . . . , xμ−1 , t)x2μ +bμ (x0 , . . . , xμ−1 , t)xμ +cμ (x0 , . . . , xμ−1 , t)\n\n(2.10)\nμ = 1, . . . , N\n\nwhere aμ , bμ and cμ are arbitrary functions of their arguments. Again, system (2.10)\ndoes not possess, generically, the Painlevé property while it can be linearised and\nintegrated in cascade.\nUntill now, we have presented rather straightforward generalisations of integrable\nsystems which violate the Painlevé property while preserving their linearisability.\nWe shall close this section by introducing a new (at least to our knowledge) method\nof linearisation which again leads to integrable systems not possessing the Painlevé\nproperty. Let us describe our general approach. The idea is the following: we start\nfrom a linear second order equation in the form:\nαx′′ + βx′ + γx + δ\n=K\nǫx′′ + ζx′ + ηx + θ\n\n(2.11)\n\nwhere α, β, . . . , θ are functions of t with K a constant, and a nonlinear second order\nequation of the form:\nf (x′′ , x′ , x) = M\n(2.12)\nwhere f is a (possibly inhomogeneous) polynomial of degree two in x together with\nits derivatives, but linear in x′′ , and with M a constant. We then ask that the\nderivatives of both equations with respect to the independent variable, i.e. the\nresulting third order equations, be identical up to an overall factor. This is a novel\nlinearisation approach. The explicit integration procedure is the following. We start\nfrom equation (2.12) with given M and initial conditions x0 , x′0 for some value t0\nof the independent variable t. We use (2.12) to compute x′′0 at t0 . Having these\nvalues, we can use (2.11) to compute the value of K. Since the latter is assumed to\nbe a constant, we can integrate the linear equation (2.11) for all values of t. Since\nthis solution will satisfy the third order equation mentioned above, it will also be a\nsolution of (2.12).\nIn order to illustrate this approach, we derive one equation that can be integrated\nthrough this linearisation. Our starting assumption is that (2.12) contains a term\nx′′ x′ . The more general term x′′ (x′ + cx + d) can always be reduced to this form,\ni.e. c=d=0 through a rescaling and translation of x. It is then straightforward to\nobtain the full expression in the homogeneous subcase δ = θ = 0. We thus find:\ntx′′ + (at − 1/2)x′ + btx\n=K\nx′′ + ax′ + bx\n\n(2.13)\n\n\ffor the linear equation, and\nx′′ x′ + 2ax′2 + 3bx′ x + (2ab − b′ )x2 = M\n\n(2.14)\n\nfor the nonlinear one, with b = a2 − a′ /2 and a satisfying the equation\na′′′ = 6a′′ a + 7a′2 − 16a′ a2 + 4a4\n\n(2.15)\n\nwhich is equation XII in the Chazy classification [14]. Its general solution can be\nobtained by putting a = −u′ /2u. Equation (2.15) reduces to\nu(IV ) u − u′′′ u′ + u′′2 /2 = 0\n\n(2.16)\n\nwhich implies u(V ) =0, so u is a quartic polynomial in the independent variable t with\none constraint on its coefficients, because of (2.16). Given a and the corresponding\nb, equation (2.14) is integrable by linearisation through (2.13). On the other hand,\n(2.14) violates the Painlevé property. Solving it for x′′ , we find a term proportional\nto x2 /x′ (or, for that matter, to 1/x′ ) which is incompatible with it.\nMore cases like the one above could have been derived but this is not necessary in\norder to prove our point. Integrability through linearisation does not require the\nPainlevé property. On the other hand we do not know of any systematic way to\ndetect linearisability for a given differential system.\n3. Discrete integrable systems\nIn the case of discrete systems, a difficulty appears from the outset in the sense\nthat the discrete analogue of the Painlevé property is not well established. One of\nthe properties that characterises discrete integrable systems is that of singularity\nconfinement [7]. While analysing a host of integrable mappings it was observed\nthat whenever a singularity appeared at some iteration, due to the particular initial\nconditions, it disappeared after some further iterations. Thus, confinement would\nhave been an excellent candidate for the role of the discrete analogue of the Painlevé\nproperty were it not for the fact that it is not sufficient. There exist mappings which\nhave only confined singularities and which are not integrable [8]. Another property\nwhich has been proposed as an indicator of integrability in (rational) mappings is\nthat of the degree growth of the iterates [15].\nLet us illustrate what we mean by degree in a specific example. We consider a\nthree-point mapping of the form x = f (x, x; n) where f is rational in x, x. (The\n'bar' notation, which will be used throughout this section, is a shorthand for the\nup- and down-shifts in n i.e. x ≡ x(n + 1), x ≡ x(n), x ≡ x(n − 1)). Starting from\nsome initial conditions x0 , x1 we introduce homogeneous variables through x0 = p,\nx1 = q/r and compute the homogeneity degree of the iterates of the mapping in q, r,\n\n\fto which we assign the same degree 1, while p is assigned the degree 0. Other choices\ndo exist but the result does not depend on the particular choice. While the degrees\nobtained do depend on it, the growth of the degree does not. Thus for a generic,\nnonintegrable, mapping the degree growth of the iterates is exponential [16,17]. On\nthe contrary, for integrable mappings, the growth is just polynomial. Moreover, a\ndetailed analysis of discrete Painlevé equations [18] and linearisable mappings [19]\nhas shown that the latter have even slower growth properties (which can be used not\nonly as a detector of integrability but as an indicator of the integration method). In\nwhat follows, we shall examine the results of the application of the two methods to\nintegrable discrete systems.\nThe first case we shall analyse are projective mappings [11]. In perfect analogy to\nthe continuous case one can introduce the discrete projective Riccati equations. The\nstarting point is a linear system for (N +1) variables:\nXμ =\n\nN\nX\n\nAμν Xν\n\nμ = 0, 1, . . . , N\n\n(3.1)\n\nν=0\n\nIntroducing again xμ = Xμ /X0 , we obtain:\nxμ =\n\nAμ0 +\nA00 +\n\nPN\n\nν=1 Aμν xν\n\nPN\n\nν=1 A0ν xν\n\nμ = 1, . . . , N\n\n(3.2)\n\nIn fact we have shown [12] that this system can always be rewritten as a N +1-point\nmapping in terms of a single object. Clearly the case N =1 is just a homographic\n(discrete Riccati) mapping for x1 . For N =2 we finally find [20,21]:\nw =α+\n\nβ\n1\n+\nw ww\n\n(3.3)\n\nfor a quantity w which is obtained from x1 , say, through some homography and α, β\nare given in tems of the Aμν . Because of the underlying linearisation, any singularity\nappearing in the projective Riccati system is confined in one step. Moreover, the\nstudy of the degree of the iterates [19] shows that there is no growth at all: the\ndegree is constant. Thus both criteria are satisfied in this case.\nWe turn now to the more interesting case of the Gambier mapping [22]. The latter\nis, in perfect analogy to the continuous case, a system of two (discrete) Riccati\nequations in cascade:\nαy + β\n(3.4a)\ny=\nγy + δ\nx=\n\nayx + bx + cy + d\nf yx + gx + hy + k\n\n(3.4b)\n\nwhere α, . . . , δ and a, . . . , k are all functions of the independent discrete variable n.\nIn [22] it was shown that system (3.4) is not confining unless the coefficients entering\n\n\fin the equation satisfy certain conditions. On the other hand the same argument\npresented in the continuous case can be transposed here: the integration of the two\nRiccati equations in cascade can always be performed, through reduction to linear\nsecond order mappings. The study of the degree growth of the iterates of (3.4) was\nperformed in [19] where it was found that the growth is always linear, independently\nof the condition we referred to above.\nThis result leads naturally to the following generalisation of the discrete Gambier\nsystem, the singularities of which are, in general, not confined:\nαy + β\nγy + δ\n\n(3.5a)\n\na(y)x + b(y)\nc(y)x + d(y)\n\n(3.5b)\n\ny=\nx=\n\nwhere a, . . . , d are polynomials in y the coefficients of which may depend on the\nindependent variable n. The study of the degree growth of the iterates of (3.5) is\nstraightforward. We find that the degree growth of x is linear. Again, system (3.5)\ncan be integrated in cascade. On the other hand, (3.5) cannot be written as a threepoint mapping for x. Indeed, if we eliminate y, y between (3.5a) (3.5b) and the\nupshift of the latter, we obtain an equation relating x, x and x which is polynomial\nin all three variables, generically not linear in x. This does not define a mapping\nbut rather a correspondence which in general leads to exponential proliferation of\nthe number of images and preimages. This correspondence is not integrable but\nthis is not in contradiction with the integrability of (3.5). The two systems are not\nequivalent.\nAn (N + 1)-variables extension of the Gambier system can be easily produced. We\nhave:\nαx0 + β\nx0 =\n(3.6)\nγx0 + δ\nxμ =\n\naμ (x0 , . . . , xμ−1 )xμ + bμ (x0 , . . . , xμ−1 )\ncμ (x0 , . . . , xμ−1 )xμ + dμ (x0 , . . . , xμ−1 )\n\nμ = 1, . . . , N.\n\nAgain, the degree growth of (3.6) can be computed leading to a linear growth and,\nonce more, the singularities of (3.6) do not confine in general.\nThus, several linearisable systems can be found for which the singularity confinement\ngives more restricted predictions than the degree growth. We shall comment on this\npoint in the conclusion.\nA last point concerns the discrete analogues of the linearisable systems we have\npresented at the end of section 2. The procedure can be transposed to a discrete\nsetting in a pretty straightforward way. We have a linear equation\nαx + β + γx + δ\n=K\nǫx + ζ + ηx + θ\n\n(3.7)\n\n\fwhere α,. . . ,θ are all functions of n with K a constant, and a nonlinear mapping\nf (x, x, x; n) = M\n\n(3.8)\n\nwhere f is globally polynomial of degree two in all the x's but not more than linear\nseparately in each of x and x. Writing that the l.h.s. of (3.7) is the same as that\nof its upshift we get an equation relating x, x, x and x. For appropriate choices of\nα,. . . ,θ this four point equation can be identical (up to unimportant factors) to the\nfour-point equation obtained from (3.8) by writing f (x, x, x; n) = f (x, x, x; n+1).\nThe integration method is quite similar to that described in the continuous case.\nGiven M , and starting with x, x at some n, one gets x from (3.8). Implementing\n(3.7) this fixes the value of K. From then on, one integrates the linear equation\n(3.7) for all n. Since the four-point equation is always satisfied, this means that f\ncomputed at any n has a constant value, which is just M , so (3.8) is satisfied.\nSeveral mappings derived in [23] as special limits of discrete Painlevé equations can\nbe linearised in this way. For instance the nonlinear equation:\n\u0012\n\nx+x−a x\n−\nz\nζ\n\n\u0013\u0012\n\nx+x−a x\n−\nz\nζ\n\n\u0013\n\n−\n\nx2\n=M\nζ2\n\n(3.9)\n\nwith a a constant, where z and ζ are defined from a single arbitrary function g of n\nthrough z = g + g, ζ = g + g, can be solved through the linear equation:\nAx + B(x − a) + Ax\n=K\nzx + (z + z)(x − a) + zx\n\n(3.10)\n\nwhere A = g 2 (g + g) and B = −(g + g)gg − (g + g)gg. Mapping (3.9) is generically\nnon-confining unless g is a constant.\nConclusion\nIn this paper we have adressed the question of integrability which does not necessitate\nthe Painlevé property. We have found that for a large class of integrable, linearisable\nsystems, the Painlevé property is not a prerequisite for integrability. The secondorder Gambier system is the prototype of such a linearisable equation. Once we find\nthat it can be linearised in the absence of the Painlevé property, it is straightforward\nto generalise the Gambier system and to extend it to N variables (violating the\nPainlevé property but preserving integrability through linearisability).\nHaving dispensed of the Painlevé property, it is possible to propose a new method\nof linearisation where the derivative of a nonlinear system coincides with that of a\nlinear one. The usefulness of this method has been illustrated through the derivation\nof a linearisable system which does not satisfy the Painlevé criterion.\n\n\fAt this point, we must stress that the Painlevé property can still be considered as\na necessary condition for integrability provided we qualify the latter. The integrability with which the Painlevé property is associated, often referred to as algebraic\nintegrability, corresponds to the integration through IST methods. This is for instance the case of the transcendental Painlevé equations (or most of the integrable\npartial differential equations). For these cases, the Painlevé property is necessary\nand we believe, sufficient. What this paper shows is that for the simpler case of\nlinearisability, the Painlevé property is superfluous.\nIn the case of discrete systems the situation is more complicated. It would appear\nthat what would play the role of the Painlevé property is singularity confinement.\n(The caveat is that the latter was shown not to be a sufficient condition). Again,\nit turned out that singularity confinement is necessary for integrability through\nIST methods, as for instance in the integration of the discrete Painlevé equations\nthrough isomonodromy techniques. However for integrability through linearisation,\nsingularity confinement is too restrictive just like the Painlevé property. The study\nof the degree growth, on the other hand, shows that this criterion is more suitable for\nthe detection of integrability in a larger sense: it identifies all linearisable systems as\nintegrable with no restrictions whatsoever. This is at variance with the continuous\ncase where no linearisability criterion seems to exist (at least none has been found\nto date). Moreover, the detailed information on the degree growth is a most useful\nindication of the precise integration procedure. Thus, although it is not clear whether\nthe degree growth is the discrete equivalent to the Painlevé property it can be a most\nreliable integrability detector.\nAcknowledgments\nS. Tremblay acknowledges a scholarship from le Centre de Coopération Interuniversitaire Franco-Québécois.\nReferences\n[1] P. Painlevé, Acta Math. 25 (1902) 1.\n[2] E.L. Ince, Ordinary Differential Equations, Dover, London, (1956).\n[3] M.J. Ablowitz and H. Segur, Phys. Rev. Lett. 38 (1977) 1103.\n[4] M. Adler and P. van Moerbeke, Algebraic completely integrable systems: a systematic approach, Perspectives in Mathematics, Academic Press, New York (1988).\n[5] M.J. Ablowitz and P.A. Clarkson, Solitons and the Inverse Scattering Transform,\nSIAM, Philadelphia (1981).\n[6] M.D. Kruskal, A. Ramani and B. Grammaticos, NATO ASI Series C 310, Kluwer\n(1989) 321.\n\n\f[7] B. Grammaticos, A. Ramani and V. Papageorgiou, Phys. Rev. Lett. 67 (1991)\n1825.\n[8] J. Hietarinta and C. Viallet, Phys. Rev. Lett. 81, (1998) 325.\n[9] A. Ramani, B. Dorizzi, B. Grammaticos, Phys. Rev. Lett. 49 (1982) 1539.\n[10] B. Dorizzi, B. Grammaticos, A. Ramani, J. Math. Phys. 25 (1984) 481.\n[11] B. Grammaticos, A. Ramani, P. Winternitz, Phys. Lett. A 245 (1998) 382.\n[12] S. Lafortune, B. Grammaticos, A. Ramani, Physica A 268 (1999) 129.\n[13] B. Gambier, Acta Math. 33 (1909) 1.\n[14] J. Chazy, Acta Math. 34 (1911) 317.\n[15] M.P. Bellon and C.-M. Viallet, Comm. Math. Phys. 204 (1999) 425.\n[16] V.I. Arnold, Bol. Soc. Bras. Mat. 21 (1990) 1.\n[17] A.P. Veselov, Comm. Math. Phys. 145 (1992) 181.\n[18] Y. Ohta, K.M. Tamizhmani, B. Grammaticos and A. Ramani, Phys. Lett. A. 262\n(1999) 152.\n[19] A. Ramani, B. Grammaticos, S. Lafortune and Y. Ohta, Linearisable mappings and\nthe low-growth criterion, preprint (1999).\n[20] A. Ramani, B. Grammaticos, G. Karra, Physica A 180 (1992) 115.\n[21] A. Ramani, B. Grammaticos, K.M. Tamizhmani, S. Lafortune, Physica A 252 (1998)\n138.\n[22] B. Grammaticos, A. Ramani, Physica A 223 (1996) 125.\n[23] A. Ramani, B. Grammaticos, Y. Ohta, B. Grammaticos, Discrete integrable systems\nfrom continuous Painlevé equations through limiting procedures, preprint (1999).\n\n\f"}