{"id": "http://arxiv.org/abs/1109.1316v2", "guidislink": true, "updated": "2011-11-29T09:55:00Z", "updated_parsed": [2011, 11, 29, 9, 55, 0, 1, 333, 0], "published": "2011-09-06T22:27:18Z", "published_parsed": [2011, 9, 6, 22, 27, 18, 1, 249, 0], "title": "Field-Induced Freezing of a Quantum Spin Liquid on the Kagome Lattice", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1109.5988%2C1109.0718%2C1109.4097%2C1109.1898%2C1109.4918%2C1109.5214%2C1109.3420%2C1109.1017%2C1109.0963%2C1109.6883%2C1109.1376%2C1109.2477%2C1109.4882%2C1109.1041%2C1109.0211%2C1109.4608%2C1109.1028%2C1109.4618%2C1109.0639%2C1109.2761%2C1109.1824%2C1109.0684%2C1109.0482%2C1109.3895%2C1109.1494%2C1109.2672%2C1109.1185%2C1109.6336%2C1109.0227%2C1109.0755%2C1109.0231%2C1109.1368%2C1109.0360%2C1109.2959%2C1109.3014%2C1109.3816%2C1109.0088%2C1109.0636%2C1109.0192%2C1109.5473%2C1109.6471%2C1109.0760%2C1109.2816%2C1109.6834%2C1109.1316%2C1109.0866%2C1109.0835%2C1109.4385%2C1109.3933%2C1109.5649%2C1109.4329%2C1109.2759%2C1109.3676%2C1109.4828%2C1109.3660%2C1109.5646%2C1109.5834%2C1109.2995%2C1109.3307%2C1109.6513%2C1109.4347%2C1109.0615%2C1109.6238%2C1109.2115%2C1109.3375%2C1109.4190%2C1109.1023%2C1109.1280%2C1109.6532%2C1109.5229%2C1109.5414%2C1109.1702%2C1109.1196%2C1109.4338%2C1109.5670%2C1109.5327%2C1109.0040%2C1109.2028%2C1109.2976%2C1109.0156%2C1109.4086%2C1109.6609%2C1109.3239%2C1109.4628%2C1109.0530%2C1109.4578%2C1109.4811%2C1109.0528%2C1109.2583%2C1109.2386%2C1109.1574%2C1109.4522%2C1109.4955%2C1109.6399%2C1109.4994%2C1109.5932%2C1109.6842%2C1109.1421%2C1109.1966%2C1109.2245%2C1109.0116&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Field-Induced Freezing of a Quantum Spin Liquid on the Kagome Lattice"}, "summary": "We report 17O NMR measurements in the S=1/2 Cu2+ kagome antiferromagnet\nHerbertsmithite ZnCu3(OH)6Cl2 down to 45mK in magnetic fields ranging from 2T\nto 12T. While Herbertsmithite displays a gapless spin-liquid behavior in zero\nfield, we uncover an instability toward a spin-solid phase at sub-kelvin\ntemperature induced by an applied magnetic field. The latter phase shows\nlargely suppressed moments $\\lesssim 0.1\\muB$ and gapped excitations. The H-T\nphase diagram suggests the existence of a quantum critical point at the small\nbut finite magnetic field mu0 Hc=1.55(25)T. We discuss this finding in light of\nthe perturbative Dzyaloshinskii-Moriya interaction which was theoretically\nproposed to sustain a quantum critical regime for the quantum kagome Heisenberg\nantiferromagnet model.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1109.5988%2C1109.0718%2C1109.4097%2C1109.1898%2C1109.4918%2C1109.5214%2C1109.3420%2C1109.1017%2C1109.0963%2C1109.6883%2C1109.1376%2C1109.2477%2C1109.4882%2C1109.1041%2C1109.0211%2C1109.4608%2C1109.1028%2C1109.4618%2C1109.0639%2C1109.2761%2C1109.1824%2C1109.0684%2C1109.0482%2C1109.3895%2C1109.1494%2C1109.2672%2C1109.1185%2C1109.6336%2C1109.0227%2C1109.0755%2C1109.0231%2C1109.1368%2C1109.0360%2C1109.2959%2C1109.3014%2C1109.3816%2C1109.0088%2C1109.0636%2C1109.0192%2C1109.5473%2C1109.6471%2C1109.0760%2C1109.2816%2C1109.6834%2C1109.1316%2C1109.0866%2C1109.0835%2C1109.4385%2C1109.3933%2C1109.5649%2C1109.4329%2C1109.2759%2C1109.3676%2C1109.4828%2C1109.3660%2C1109.5646%2C1109.5834%2C1109.2995%2C1109.3307%2C1109.6513%2C1109.4347%2C1109.0615%2C1109.6238%2C1109.2115%2C1109.3375%2C1109.4190%2C1109.1023%2C1109.1280%2C1109.6532%2C1109.5229%2C1109.5414%2C1109.1702%2C1109.1196%2C1109.4338%2C1109.5670%2C1109.5327%2C1109.0040%2C1109.2028%2C1109.2976%2C1109.0156%2C1109.4086%2C1109.6609%2C1109.3239%2C1109.4628%2C1109.0530%2C1109.4578%2C1109.4811%2C1109.0528%2C1109.2583%2C1109.2386%2C1109.1574%2C1109.4522%2C1109.4955%2C1109.6399%2C1109.4994%2C1109.5932%2C1109.6842%2C1109.1421%2C1109.1966%2C1109.2245%2C1109.0116&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We report 17O NMR measurements in the S=1/2 Cu2+ kagome antiferromagnet\nHerbertsmithite ZnCu3(OH)6Cl2 down to 45mK in magnetic fields ranging from 2T\nto 12T. While Herbertsmithite displays a gapless spin-liquid behavior in zero\nfield, we uncover an instability toward a spin-solid phase at sub-kelvin\ntemperature induced by an applied magnetic field. The latter phase shows\nlargely suppressed moments $\\lesssim 0.1\\muB$ and gapped excitations. The H-T\nphase diagram suggests the existence of a quantum critical point at the small\nbut finite magnetic field mu0 Hc=1.55(25)T. We discuss this finding in light of\nthe perturbative Dzyaloshinskii-Moriya interaction which was theoretically\nproposed to sustain a quantum critical regime for the quantum kagome Heisenberg\nantiferromagnet model."}, "authors": ["M. Jeong", "F. Bert", "P. Mendels", "F. Duc", "J. C. Trombe", "M. A. de Vries", "A. Harrison"], "author_detail": {"name": "A. Harrison"}, "author": "A. Harrison", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1103/PhysRevLett.107.237201", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1109.1316v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1109.1316v2", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "One link added for supplemental materials. Published in : Phys. Rev.\n  Lett. 107, 237201 (2011)", "arxiv_primary_category": {"term": "cond-mat.str-el", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cond-mat.str-el", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1109.1316v2", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1109.1316v2", "journal_reference": null, "doi": "10.1103/PhysRevLett.107.237201", "fulltext": "Field-Induced Freezing of a Quantum Spin Liquid on the Kagomé Lattice\nM. Jeong,1 F. Bert,1 P. Mendels,1 F. Duc,2, 3 J. C. Trombe,2 M. A. de Vries,4, 5 and A. Harrison4, 6\n1\n\narXiv:1109.1316v2 [cond-mat.str-el] 29 Nov 2011\n\n2\n\nLaboratoire de Physique des Solides, Université Paris-Sud 11, UMR CNRS 8502, 91405 Orsay, France\nCentre d'Élaboration des Matériaux et d'Études Structurales, CNRS UPR 8011, 31055 Toulouse, France\n3\nLaboratoire National des Champs Magnétiques Intenses, CNRS UPR 3228, F-31400 Toulouse, France\n4\nCSEC and School of Chemistry, University of Edinburgh, Edinburgh, EH9 3JZ, UK\n5\nSchool of Physics and Astronomy, E.C. Stoner Laboratory, University of Leeds, Leeds LS2 9JT, UK\n6\nInstitut Laue-Langevin, 6 rue Jules Horowitz, F-38042 Grenoble, France\nWe report 17 O NMR measurements in the S = 1/2 (Cu2+ ) kagomé antiferromagnet Herbertsmithite ZnCu3 (OH)6 Cl2 down to 45 mK in magnetic fields ranging from 2 T to 12 T. While\nHerbertsmithite displays a gapless spin-liquid behavior in zero field, we uncover an instability toward a spin-solid phase at sub-kelvin temperature induced by an applied magnetic field. The latter\nphase shows largely suppressed moments <\n∼ 0.1μB and gapped excitations. The H − T phase diagram suggests the existence of a quantum critical point at the small but finite magnetic field\nμ0 Hc = 1.55(25) T. We discuss this finding in light of the perturbative Dzyaloshinskii-Moriya interaction which was theoretically proposed to sustain a quantum critical regime for the quantum\nkagomé Heisenberg antiferromagnet model.\n\nQuantum spin liquids (QSL) are appealing states of\nmatter which do not break any symmetry of the spin\nHamiltonian. While QSL behaviors are well established for one-dimensional spin systems, their existence\nin higher dimensions remains questionable. The quantum\nkagomé Heisenberg antiferromagnet (QKHA) is considered as the best candidate to stabilize such a QSL phase\nin two dimensions [1–3]. The specificity of this model\nrelies on the unique combination of strong quantum fluctuations enhanced by low spins S = 1/2 and high geometrical frustration of the lattice of corner-sharing triangles. Early numerical studies have shown, despite finite size limitations, that the ground state of the QKHA\nmodel does not support any simple order parameter [4–\n6] and have evidenced an original excitation spectrum\nwith dense sets of low energy excitations in all spin sectors [5, 6]. A recent state-of-the-art calculation [7] favors a QSL ground state with a small gap much like\nthe resonating-valence-bond state [8, 9]. Other recent\nproposals with similar ground-state energies encompass\nlarge unit-cell valence-bond-crystals [10] as well as gapless 'critical' spin liquids with algebraic spin correlations\n[11, 12]. Clearly, the exact ground state of QKHA remains a challenging and highly debated issue [13, 14]. In\nthis respect, studying the effect of perturbation, such as\ndisorder, anisotropies or external field, is not only necessary to compare to real materials but also proves to be\nefficient to discriminate between the competing ground\nstates - critical QSL are expected to be easily destabilized [15, 16] while gapped ones should be more robust.\nTo confront theories, a significant step was achieved\nwith the synthesis [17] of the first \"structurally perfect\" QKHA, ZnCu3 (OH)6 Cl2 , called Herbertsmithite.\nThe electron spin moments of Cu2+ ions (S=1/2) form\nundistorted kagomé planes, well separated from each\nother by diamagnetic Zn2+ triangular planes which ensure the quasi-two-dimensionality of the magnetic net\n\nFIG. 1. Structure of Herbertsmithite. In this ideal structure,\nCu and O atoms each occupy one crystallographic site.\n\n(Fig. 1). Despite a sizable antiferromagnetic superexchange J = 180(10) K, Herbertsmithite develops no onsite magnetization [18, 19] and remains in an unfrozen,\nfluctuating state under zero field with short-ranged spin\ncorrelations down to at least 50 mK (≃ J/4000), as\nexpected for a liquid state [18, 20]. Inelastic neutron\nscattering [18] and nuclear magnetic resonance (NMR)\n[21, 22] investigations consistently point to the absence\nof a spin gap larger than ∼ J/200 and evidence a peculiar\npower-law temperature dependence of the spin dynamics,\na possible hint of quantum criticality. At such a low energy scale, small perturbations to the ideal nearest neighbour Heisenberg model may become relevant and determine the properties of the ground state. First, intersite\nCu2+ /Zn2+ mixing defects are known to be present at the\nlevel of 5 − 10 % [18, 23] which could stabilize a gapless\nvalence-bond-glass [24]. More fundamentally, the lack\nof inversion center of the magnetic bonds on the kagomé\nlattice allows for Dzyaloshinskii-Moriya (DM) interaction\nof spin-orbit origin. In Herbertsmithite, the DM magnitude is estimated to be D ∼ 0.04J − 0.08J [25, 26], not\nfar from a theoretically expected quantum critical point\n\n\f2\n\nTc\n\n2.0 T\n3.1 T\n6.8 T\nref. 21\n\n0.1\n\nTc\n\nTc\n\n12.0 T\n\nTc\n\n1/\n\nT\n\n1\n\n-1\n\n(ms )\n\n0.01\n\n1E-3\n\nT (K\n\n1/\n\n0\n\n2\n\n4\n\n6\n\n-1\n\n)\n\n8 10 12 14\n\n0.1\n\n-1\n\n(ms )\n\n1E-4\n\nFIG. 3. H-T phase diagram of Herbertsmithite from this\nstudy (black circles) and from the absence of spin freezing\nat least down to 50 mK in μSR experiment (black square)\n[19]. Tc separates the spin-liquid phase from the spin-solid\nphase characterized by strongly suppressed fluctuations. The\ndashed line is a plot of (H − Hc )δ with μ0 Hc = 1.53 T and\nδ = 0.65 (see text). Inset: ∆ versus Tc .\n\n1/\n\nT\n\n1\n\n0.01\n\n1E-3\n\n1E-5\n\n0.01\n\n0.1\n\n1\n\n10\n\nT (K)\nFIG. 2. 17 O nuclear spin-lattice relaxation rate, 1/T1 , as a\nfunction of T in Herbertsmithite down to 45 mK. Inset: solid\nline represents the initial slope below Tc .\n\nat Dc ∼ 0.1J [27].\nIn this Letter, we report the spin dynamics of Hertsmithite in a magnetic field down to very low temperature, T ≃ J/4000, probed by 17 O NMR, in order to uncover the ultimate ground-state properties and test for\ncriticality. The location of oxygen on the superexchange\npath between two adjacent Cu ions in the kagomé lattice\nconfers on the oxygen nucleus a dominant coupling to the\nmagnetic properties of the kagomé plane (Fig. 1). This\nsite-selectivity is decisive in the context where the lowT thermodynamic properties and the response of lesscoupled local probes are dominated by interplane defects\n[28, 29]. We uncover a field induced transition to a frozen\nphase for applied fields higher than μ0 Hc = 1.55(25) T\nand draw the H − T phase diagram.\nNMR measurements were performed on the powder\nsample of 17 O-enriched Herbertsmithite used in ref. [21].\nThe spin-echo was obtained with the standard pulse sequence, π/2 − τ − π. The NMR spectra were obtained by\nrecording the integrated echo intensity, point-by-point,\nwhile sweeping the external magnetic field with a fixed\nrf frequency [30]. The spin-lattice relaxation rate, 1/T1 ,\nwas obtained by saturation-recovery method. The abso-\n\nlute values of T1 were obtained by scaling the recovery\ncurves to previous results at 6.8 T [21, 30].\nIn Fig. 2, we display our 1/T1 results as a function\nof temperature down to 45 mK in four different magnetic fields. At μ0 H = 6.8 T, in contrast to the known\nmodest sublinear T -dependence of 1/T1 ∼ T 0.73 above\n1 K [21], we find a three orders of magnitude decrease\nof 1/T1 below Tc = 520(30) mK. Both the marked onset\nand the magnitude of the drastic slowing down of the underlying dynamics indicate a transition from the high-T\nspin-liquid phase to a low-T solid-like phase. This drastic change of the dynamics is detected not only in the\nvicinity of the peak of the NMR spectrum but also at\nvarious positions on the wings, which points to a homogeneous transition. The 1/T1 data taken at 2.0, 3.1 and\n12.0 T display a similar drop below a temperature Tc\nwhich is found to increase with the applied field. The\ncorresponding phase diagram is drawn in Fig. 3. By extrapolation to still lower fields, it seems that Tc vanishes\nat some small but finite critical field Hc . This is in line\nwith the absence of freezing in zero field evidenced with\nμSR [19]. Fitting the data to a phenomenological expression Tc ∝ (H − Hc )δ yields a quantum critical point at\nμ0 Hc = 1.55(25) T and δ = 0.6(1). Note that removing\nthe 12 T data point, which may be too far away from\nthe critical regime, improves significantly the quality of\nthe fit (see dashed line in Fig. 3). The Zeeman energy\nμB Hc ∼ J/180, where μB is the Bohr magneton, is quite\nsmall on the scale of J which underlines the fragility of\nthe zero-field spin-liquid state of Herbertsmithite.\nThe inset of Fig. 2 shows an Arrhenius plot of 1/T1\n\n\f3\n0.6\n\n0.5\n\nTc\n\nLinewidth (T)\n\n0.4\n\n0.3\n\nTc\n\nTc\n\n0.2\n\n~ 2 T\n\nTc\n\n~ 3 T\n~ 7 T\n\n0.1\n\n~ 12 T\n\n0.0\n0.0\n\n0.2\n\n0.4\n\n0.6\n\n0.8\n\n1.0\n\n1.2\n\n1.4\n\nT (K)\n\nFIG. 4. Linewidth (full-width at half-maximum) of the 17 O\nNMR spectra vs. T for the different fields investigated here,\nafter correction for inhomogeneous spin-spin relaxation effect.\n\n1.2\n\nT1\n\n1.2 K\n1.0\n\nNMR intensity (arb. unit)\n\nversus 1/T . The linear behavior below Tc , evident at\n6.8 T and 12.0 T, strongly supports the existence of a\ngap in the spin dynamics. This gap in the spin-solid\nphase likely reveals some magnetic stiffness arising from\nthe DM anisotropic interaction. For T <\n∼ 200 mK, the\nrelaxation originates from a residual contribution which\nis marginal at high fields but sizeable at μ0 H = 2.0 and\n3.1 T. This residual relaxation may be attributed to the\ninterplane Cu defects which behave like nearly free S =\n1/2 spins with a small antiferromagnetic coupling of ∼\n1 K [23]. Their contribution is expected to decrease as the\nfield increases, i.e. as their magnetization gets saturated.\nFrom the initial slope of the 1/T1 curves just below Tc\n(Fig. 2, inset), discarding the lowest T data points, we\nextract the gap ∆. The inset of Fig. 3 displays the values\nobtained for ∆ and their comparison to Tc . Within error\nbars, ∆ increases linearly with Tc with the slope α =\n∆/kB Tc = 2.3(3) [31].\nWe now turn to the NMR spectra which reflect the\ndistribution of local magnetization around the probe nuclei. For H > 3 T and for T >\n∼ Tc , we find that the\nspectrum width is both field and temperature independent (see Fig. 4). This is in agreement with an earlier\nstudy at μ0 H ∼ 7 T [21] which demonstrated a sizeable broadening of the spectra with 1/T at high temperature and a saturation below 5 K. It suggests that\nthe width is related to the interplane defects above Tc .\nThe smaller width observed at 2 T and T = 0.2 K is\nin agreement with this picture when the defects are becoming less saturated. At this smallest field, the width\ncannot be measured reliably above T > 0.2 K because\nof inhomogeneous, strong spin-spin relaxation processes.\nSpectra at 12 T, where the longer spin-spin relaxations\ndo not affect the lineshape, are displayed in Fig. 5. Below\nTc , the increase of the width, much like that of an order\nparameter, contrasts sharply with the absence of variation observed above Tc . This points clearly to a static\nmagnetization which develops in the kagomé plane in the\nspin-solid phase. The Gaussian-like lineshape implies a\nrandom static phase whereas, in the case of an ordered\nphase, the well-defined internal field at the O site would\nyield a rectangular shape for a powder averaged spectrum [32]. Given the hyperfine constant 3.5 T/μB , and\nindependently from any model, we can extract a typical moment value μCu ∼ 0.1μB , an order of magnitude\nsmaller than the full moment for a spin 1/2. This small\nvalue likely reflects a renormalization of the moment by\nstrong quantum fluctuations. The absence of any clear\nbroadening below Tc for the lower fields suggests even\nweaker Cu moments, in line with an enhanced quantum\nreduction in the vicinity of the critical point Hc .\nWe now aim to discuss which model could best account\nfor a weak-field induced transition in the context of quantum criticality. The algebraic (critical) spin liquid model\n[12] captures both the absence of a gap in zero field and\nthe instability under an applied field. A transition to\n\n700 mK\n52 mK\n\n0.8\no\n\n120\n\nLRO\n\n0.6\n\n0.4\n\n0.2\n\n0.0\n10.5\n\n11.0\n\n11.5\n\n12.0\n\n12.5\n\n13.0\n\nH (T)\n0\n\nFIG. 5. 17 O NMR spectra normalized to their maximum intensity in ∼12 T at different T . The vertical arrow shows the\nlocation at which 1/T1 measurements were performed. The\ndashed rectangle represents the expected spectral shape for\n120◦ long-range-ordered (LRO) phase with 0.1μB static moments.\n\nan XY long-range ordered phase and an accompanying\non-site magnetization M ∝ H α was predicted to occur\nat Tc ∝ H [16]. This is not consistent with our data\nwhich suggest a finite critical field. Also, the presence of\na sizeable DM interaction in Herbertsmithite should induce long-range order already in zero field in this model\n[15].\nA different approach using exact diagonalization [27] or\nSchwinger boson techniques [33, 34] consists, on the contrary, of including the DM interaction in the Heisenberg\nmodel as a starting point. Although the QKHA model\nmay be gapped [7], the DM perturbation might naturally account for the gapless zero-field phase of Herbert-\n\n\f4\nsmithite by admixing singlet and triplet states. Also in\nthis framework, Herbertsmithite lies close to a quantum\ncritical point that is in fact sustained by DM anisotropy.\nA quantum critical region is expected to open at finite\ntemperatures within a finite range of a control parameter\naround its critical value [35], which could in this case be\nthe magnetic field. From the point of view of symmetrybreaking, the effects of the DM and Zeeman terms may in\nessence not be very different. Such an interplay between\nthese two terms was established for S = 1/2 Heisenberg\nantiferromagnetic chains, a canonical example of a QSL\nstate in one dimension [36]. Then, Herbertsmithite could\nbe driven from a QSL to a spin-solid phase by a moderate field, Hc ∼ Dc − D. In this framework, the smallness\nof the moment expresses the weakness of the order parameter in the vicinity of the quantum critical point [27].\nMoreover, the quantum critical region is characterized\nby the absence of energy scale other than temperature\nwhich can explain the power-law behavior of spin correlations [18, 20–22]. It is then interesting to compare the\nresults with other kagomé compounds of different D/J,\ne.g. vesignieite, with possibly D/J > 0.1, shows an unusual heterogeneous ground state where spin liquid and\nfrozen moments coexist [37, 38].\nOur\nresults\nshare\ncertain\nfeatures\nwith\nthe\nfield-induced\ntransition\nrecently\nreported\nfor the organic triangular quantum antiferromagnets\nκ−(BEDT − TTF)2 Cu2 (CN)3\nand\nEtMe3 Sb[Pd(dmit)2 ]2 which lie close to Mott transition and show a QSL ground state [39, 42]. As\nin Herbertsmithite, small magnetic fields induce the\nfreezing of the zero-field QSL ground state toward a\nspin-solid phase with strongly suppressed moments.\nIn NMR measurements, no critical divergence in 1/T1\nnor critical broadening in the spectra are detected\n[40–42], similarly to Herbertsmithite as shown here.\nThis similarity is quite intriguing since the two lattices,\ntriangular and kagomé, have been believed for long to\nyield very different ground-states and excitation spectra\naccording to numerical studies [2, 5, 6].\nIn conclusion, the QSL ground state of Herbertsmithite\nappears quite fragile against external magnetic field.\nHowever, in Herbertsmithite, the observed spin freezing\nlikely results from the combination of both a finite applied field and sizeable DM interaction which eventually\nsuggests that the QSL ground state of pure QKHA itself is somewhat robust against perturbations. It opens\nup the possibility for a spin gap in the pure QKHA in\naccordance with most recent calculations [7]. The field\ninduced frozen phase that we evidenced here calls for\nfurther investigation. Experiments in higher magnetic\nfields that saturate the interplanar defect contributions\nand induce larger moments within the kagomé plane are\ndesirable. Our finding along with the results reported\nfor the quantum triangular antiferromagnets, prompts a\ncomparative study of the growing class of QSL materials\n\nto understand their generic behavior in a broader context\nof frustration and quantum criticality.\nThe authors wish to thank O. Cépas and C. Lhuillier for stimulating and informative discussions. M.J. is\ngrateful to the Embassy of France in Korea for its support through Blaise Pascal Scholarship. This work was\nsupported by the ANR-09-JCJC-0093-01 grant and by\nthe ESF-HFM network.\n\n[1] L. Balents, Nature 464, 199 (2010).\n[2] G. Misguich and C. Lhuillier, in Frustrated Spin Systems,\nedited by H. T. Diep (World Scientific, Singapore, 2005).\n[3] C. Lhuillier, G. Misguich, in Introduction to Frustrated\nMagnetism, edited by C. Lacroix, P. Mendels, and F.\nMila. (Springer, Berlin Heidelberg, 2010).\n[4] C. Zeng and V. Elser, Phys. Rev. B 42, 8436 (1990).\n[5] P. Lecheminant, B. Bernu, C. Lhuillier, L. Pierre and P.\nSindzingre, Phys. Rev. B 56, 2521 (1997).\n[6] C. Waldtmann et al., Eur. Phys. J. B 2, 501 (1998).\n[7] S. Yan, D. A. Huse and S. R. White, Science 332, 1173\n(2011).\n[8] S. Sachdev, Phys. Rev. B 45, 12377 (1992).\n[9] P. W. Anderson, Mat. Res. Bull. 8, 153 (1973).\n[10] R. R. P. Singh and D. A. Huse, Phys. Rev. B 76,\n180407(R) (2007).\n[11] M. B. Hastings, Phys. Rev. B 63, 014413 (2000).\n[12] Y. Ran, M. Hermele, P. A. Lee and X.-G. Wen, Phys.\nRev. Lett. 98, 117205 (2007).\n[13] Y. Iqbal, F. Becca and D. Poilblanc, Phys. Rev. B 83,\n100404 (2011).\n[14] Y.M. Lu, Y. Ran and P.A. Lee, Phys. Rev. B 83, 224413\n(2011).\n[15] M. Hermele, Y. Ran, P. A. Lee, X.-G. Wen, Phys. Rev.\nB 77, 224413 (2008).\n[16] Y. Ran, W.-H. Ko, P. A. Lee and X.-G. Wen, Phys. Rev.\nLett. 102, 047205 (2009).\n[17] M. P. Shores, E. A. Nytko, B. M. Bartlett and D. G.\nNocera, J. Am. Chem. Soc. 127, 13462 (2005).\n[18] J. S. Helton et al., Phys. Rev. Lett. 98, 107204 (2007).\n[19] P. Mendels et al., Phys. Rev. Lett. 98, 077204 (2007).\n[20] M. A. de Vries et al., Phys. Rev. Lett. 103, 237201\n(2009).\n[21] A. Olariu et al., Phys. Rev. Lett. 100, 087202 (2008).\n[22] T. Imai, E. A. Nytko, B. M. Bartlett, M. P. Shores and\nD. G. Nocera, Phys. Rev. Lett. 100, 077203 (2008).\n[23] P. Mendels and F. Bert, J. Phys. Soc. Jpn. 79, 011001\n(2010).\n[24] R. R. P. Singh, Phys. Rev. Lett. 104, 177203 (2010).\n[25] A. Zorko et al., Phys. Rev. Lett. 101, 026405 (2008).\n[26] S. ElShawish, O. Cépas and S. Miyashita, Phys. Rev. B\n81, 224421 (2010).\n[27] O. Cépas, C. M. Fong, P. W. Leung and C. Lhuillier,\nPhys. Rev. B 78, 140405(R) (2008).\n[28] O. Ofer et al., J. Phys.: Condens. Matter 23, 164207\n(2011).\n[29] T. Imai, M. Fu, T.H. Han and Y.S. Lee, Phys. Rev. B\n84, 020411(R) (2011).\n[30] See Supplemental Material at http://link.aps.org/ supplemental/10.1103/PhysRevLett.107.237201 for details\n\n\f5\non NMR measurements and determination of T1 values.\n[31] The error bar on the slope includes an alternative determination of the gap by fitting the data below Tc to a two\nmagnon process 1/T1 ∝ T exp(−∆/kB T ).\n[32] Y. Yamada and A. Sakata, J. Phys. Soc. Jpn. 55, 1751\n(1986)\n[33] L. Messio, O. Cépas and C. Lhuillier, Phys. Rev. B 81,\n064428 (2010).\n[34] Y. Huh, L. Fritz and S. Sachdev, Phys. Rev. B 81, 144432\n(2010).\n\n[35] S. Sachdev, Nat. Phys. 4, 173 (2008).\n[36] M. Oshikawa and I. Affleck, Phys. Rev. Lett. 79, 2883\n(1997).\n[37] R. Colman et al., Phys. Rev. B 83, 180416(R) (2011).\n[38] J. A. Quilliam et al., arXiv:1105.4338 (2011).\n[39] F. L. Pratt et al., Nature 471, 612 (2011).\n[40] Y. Shimizu et al., Phys. Rev. Lett. 91, 107001 (2003).\n[41] Y. Shimizu et al., Phys. Rev. B 73, 140407(R) (2006).\n[42] T. Itou, A. Oyamada, S. Maegawa and R. Kato, Nat.\nPhys. 6, 673 (2010).\n\n\f"}