{"id": "http://arxiv.org/abs/0902.3627v1", "guidislink": true, "updated": "2009-02-20T17:39:10Z", "updated_parsed": [2009, 2, 20, 17, 39, 10, 4, 51, 0], "published": "2009-02-20T17:39:10Z", "published_parsed": [2009, 2, 20, 17, 39, 10, 4, 51, 0], "title": "Elastic Instability Triggered Pattern Formation", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0902.0653%2C0902.0164%2C0902.0303%2C0902.3486%2C0902.1686%2C0902.3642%2C0902.0793%2C0902.2223%2C0902.2850%2C0902.2739%2C0902.0392%2C0902.1569%2C0902.2469%2C0902.1723%2C0902.2182%2C0902.2490%2C0902.2177%2C0902.0771%2C0902.3032%2C0902.1247%2C0902.0195%2C0902.2271%2C0902.4129%2C0902.2918%2C0902.4615%2C0902.0726%2C0902.0671%2C0902.0467%2C0902.3243%2C0902.2173%2C0902.0577%2C0902.3169%2C0902.0031%2C0902.2413%2C0902.1183%2C0902.4589%2C0902.4638%2C0902.4416%2C0902.4198%2C0902.0764%2C0902.3878%2C0902.0720%2C0902.0821%2C0902.3193%2C0902.4462%2C0902.3198%2C0902.3522%2C0902.4742%2C0902.4262%2C0902.3272%2C0902.3627%2C0902.1630%2C0902.4665%2C0902.3216%2C0902.3357%2C0902.4280%2C0902.1190%2C0902.2625%2C0902.1820%2C0902.2112%2C0902.0014%2C0902.4016%2C0902.4898%2C0902.0459%2C0902.4145%2C0902.0760%2C0902.0556%2C0902.4377%2C0902.0666%2C0902.3792%2C0902.3438%2C0902.4058%2C0902.1080%2C0902.1993%2C0902.3791%2C0902.2916%2C0902.2155%2C0902.4542%2C0902.1258%2C0902.1306%2C0902.3839%2C0902.3336%2C0902.3087%2C0902.3390%2C0902.2953%2C0902.1438%2C0902.2524%2C0902.0651%2C0902.0054%2C0902.0513%2C0902.4154%2C0902.4711%2C0902.0165%2C0902.0454%2C0902.1002%2C0902.3392%2C0902.4194%2C0902.0281%2C0902.3413%2C0902.1926%2C0902.4278&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Elastic Instability Triggered Pattern Formation"}, "summary": "Recent experiments have exploited elastic instabilities in membranes to\ncreate complex patterns. However, the rational design of such structures poses\nmany challenges, as they are products of nonlinear elastic behavior. We pose a\nsimple model for determining the orientational order of such patterns using\nonly linear elasticity theory which correctly predicts the outcomes of several\nexperiments. Each element of the pattern is modeled by a \"dislocation dipole\"\nlocated at a point on a lattice, which then interacts elastically with all\nother dipoles in the system. We explicitly consider a membrane with a square\nlattice of circular holes under uniform compression and examine the changes in\nmorphology as it is allowed to relax in a specified direction.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0902.0653%2C0902.0164%2C0902.0303%2C0902.3486%2C0902.1686%2C0902.3642%2C0902.0793%2C0902.2223%2C0902.2850%2C0902.2739%2C0902.0392%2C0902.1569%2C0902.2469%2C0902.1723%2C0902.2182%2C0902.2490%2C0902.2177%2C0902.0771%2C0902.3032%2C0902.1247%2C0902.0195%2C0902.2271%2C0902.4129%2C0902.2918%2C0902.4615%2C0902.0726%2C0902.0671%2C0902.0467%2C0902.3243%2C0902.2173%2C0902.0577%2C0902.3169%2C0902.0031%2C0902.2413%2C0902.1183%2C0902.4589%2C0902.4638%2C0902.4416%2C0902.4198%2C0902.0764%2C0902.3878%2C0902.0720%2C0902.0821%2C0902.3193%2C0902.4462%2C0902.3198%2C0902.3522%2C0902.4742%2C0902.4262%2C0902.3272%2C0902.3627%2C0902.1630%2C0902.4665%2C0902.3216%2C0902.3357%2C0902.4280%2C0902.1190%2C0902.2625%2C0902.1820%2C0902.2112%2C0902.0014%2C0902.4016%2C0902.4898%2C0902.0459%2C0902.4145%2C0902.0760%2C0902.0556%2C0902.4377%2C0902.0666%2C0902.3792%2C0902.3438%2C0902.4058%2C0902.1080%2C0902.1993%2C0902.3791%2C0902.2916%2C0902.2155%2C0902.4542%2C0902.1258%2C0902.1306%2C0902.3839%2C0902.3336%2C0902.3087%2C0902.3390%2C0902.2953%2C0902.1438%2C0902.2524%2C0902.0651%2C0902.0054%2C0902.0513%2C0902.4154%2C0902.4711%2C0902.0165%2C0902.0454%2C0902.1002%2C0902.3392%2C0902.4194%2C0902.0281%2C0902.3413%2C0902.1926%2C0902.4278&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Recent experiments have exploited elastic instabilities in membranes to\ncreate complex patterns. However, the rational design of such structures poses\nmany challenges, as they are products of nonlinear elastic behavior. We pose a\nsimple model for determining the orientational order of such patterns using\nonly linear elasticity theory which correctly predicts the outcomes of several\nexperiments. Each element of the pattern is modeled by a \"dislocation dipole\"\nlocated at a point on a lattice, which then interacts elastically with all\nother dipoles in the system. We explicitly consider a membrane with a square\nlattice of circular holes under uniform compression and examine the changes in\nmorphology as it is allowed to relax in a specified direction."}, "authors": ["Elisabetta A. Matsumoto", "Randall D. Kamien"], "author_detail": {"name": "Randall D. Kamien"}, "author": "Randall D. Kamien", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1103/PhysRevE.80.021604", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/0902.3627v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0902.3627v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "15 pages, 7 figures, the full catastrophe", "arxiv_primary_category": {"term": "cond-mat.soft", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cond-mat.soft", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0902.3627v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0902.3627v1", "journal_reference": "Phys. Rev. E 80 (2009) 021604", "doi": "10.1103/PhysRevE.80.021604", "fulltext": "Elastic Instability Triggered Pattern Formation\nElisabetta A. Matsumoto and Randall D. Kamien\n\narXiv:0902.3627v1 [cond-mat.soft] 20 Feb 2009\n\nDepartment of Physics and Astronomy, University of Pennsylvania, Philadelphia, PA 19104-6396, USA\n(Dated: October 3, 2018)\nRecent experiments have exploited elastic instabilities in membranes to create complex patterns.\nHowever, the rational design of such structures poses many challenges, as they are products of\nnonlinear elastic behavior. We pose a simple model for determining the orientational order of\nsuch patterns using only linear elasticity theory which correctly predicts the outcomes of several\nexperiments. Each element of the pattern is modeled by a \"dislocation dipole\" located at a point\non a lattice, which then interacts elastically with all other dipoles in the system. We explicitly\nconsider a membrane with a square lattice of circular holes under uniform compression and examine\nthe changes in morphology as it is allowed to relax in a specified direction.\nI.\n\nINTRODUCTION\n\nIt is a testament to the ingenuity of Nature that at\nall length scales there exists a multitude of complex selfassembled patterns. The formation of patterns, from the\ntextured dimples in a grain of pollen to the labyrinth of\ncreases in a coral colony to the ridges in a fingerprint,\nis consistent and repeatable [1–3]; the mechanisms that\ndrive them are far from understood. Mastery of such\nprocesses would revolutionize the fabrication and design\nof novel materials with specific properties. By harnessing elastic instabilities in elastomeric membranes [4], the\nonce lofty goal of creating self-assembled complex patterns with long range order is now a one step closer.\nWhen an elastomeric membrane with a square lattice\nof circular holes (with diameter roughly half the lattice\nspacing) in it is uniformly swollen or, alternatively, is\ncompressed hydrostatically, the holes deform into a diamond plate pattern. The order persists for upwards of\n105 times the original lattice spacing with only phase-slip\ndefects, which do not change the overall symmetry of the\npattern. It is interesting to note that the same diamond\nplate pattern emerges from membranes with vastly different lattice spacings, ranging from 1 μm to 1 cm. Because\nthe same mechanism causes patterns to form over such a\nwide range of length scales, this technique is well suited\nto create devices for many fields and industries. In particular, when a material is in the diamond plate state, it\nhas a photonic band-gap [5]; hence, merely by compressing and relaxing a membrane, we can control its band\nstructure.\nThis effect occurs in the highly non-linear regime of\nelasticity; thus, only finite element simulations using specific models of nonlinear elasticity capture the entire process of the holes collapsing [6]. However, some simulations merely predict the orientational order of the collapsed holes and cannot capture the details of their final\nshape. With the sole assumption that each hole collapses\nto some elongated shape, our model uses only linear elasticity to successfully predict the orientational order in\nthe diamond plate pattern and the herringbone pattern\nformed from an underlying triangular lattice. Not only\ndoes our model shed light on the interactions in the sys-\n\ntem, it greatly facilitates the rational design of other patterns and devices.\nIn the next section, we review the linear theory of elasticity and consider a hydrostatically compressed membrane containing either a single hole or two holes. The\nbreakdown of linear elasticity illustrates the need for nonlinear analysis. In section III, we adopt the spirit of the\ntheory of cracks and show that complex behavior can\nbe explained by recasting the problem using linear dislocation theory. While an explicit analytic description of\nthe shape of a collapsed hole cannot be reached through\nthis method, each hole can be modeled as an elastically\ninteracting distribution of parallel edge dislocations, or\n\"dislocation dipoles,\" whose centers are fixed to the center of their corresponding hole but are allowed to rotate\nfreely. In the simple case of a quartet of holes, the resulting configuration exactly reproduces the unit cell for the\ndiamond plate pattern. Since elastic interactions are long\nranged, the collective interactions of all the holes must be\nincluded to find the true groundstate of the system– the\ninclusion of which additionally stabilize the pattern. We\nend with technical appendices which argue the validity\nof our approximation.\n\nII.\n\nIN WHICH THE LINEAR THEORY OF\nELASTICITY FAILS\nA.\n\nLinear Elasticity in a Nutshell\n\nThe theory of linear elasticity describes the deformation and energetics of a solid body under external force\nor load. While this theory was originally developed over\na century ago and has been presented time and again\n[7–10], this brief tutorial will illuminate a few salient features as well as familiarize the reader to our notation.\nThe goal is to develop the framework for a generalization\nof Hooke's Law for solid three dimensional bodies. When\na solid is deformed, the displacement of every point, x\nis described by the vector u, such that its final positions\nare given by x′ = x + u(x).\n√ Let us first consider two\npoints separated by ds = dx * dx that are very close\ntogether. After being deformed, their separation becomes\n\n\f2\nds′ , where ds′2 = (dxi + dui )2 using the Einstein summation convention. By noting dui = (∂ui /∂xk )dxk , we\nmay rewrite this as\n\u0013\nX \u0012 ∂ui\n∂uk\n∂ui ∂uk\n′2\n2\ndxi dxk\n+\n+\nds = ds +\n∂xk\n∂xi\n∂xk ∂xi\nik\nX\n= ds2 + 2\nuL\n(1)\nik dxi dxk ,\nik\n\nwhere uL\nik is the Lagrangian strain tensor. However, for\nsmall deformations we need only consider terms linear in\n∂ui /∂xk and the linearized strain tensor is\n\u0012\n\u0013\n1 ∂ui\n∂uk\nuik =\n.\n(2)\n+\n2 ∂xk\n∂xi\nIn the following, we will rely upon orthogonal coordinates, ξμ ,Pwith the diagonal metric ds2 = h2α dα2 +\n2\nh2β dβ 2 =\nμ (hμ dξμ ) [11]. In general, the orthogonal\ncoordinates are nonholonomic but the benefit of orthogonality outweighs this complication.\nWhat is the linearized Lagrangian strain tensor in our\nnew coordinates? By definition\nds′2 − ds2 = 2uL\nμν hμ dξμ hν dξν\n\n(3)\n\nwhere we only sum over the repeated indices i and ρ,\nnot μ or ν associated with the scale factor h. In the following we will adopt the Einstein summation convention\nand, only when there is ambiguity, will we specify which\nindices are to be implicitly summed.\nIn the spirit of Hooke's Law, there is an energy cost associated with displacing every point from its equilibrium\nposition. While the general form is quite complicated, to\nfirst order the energy can be constructed from the linear\nstrain tensor. Because the strain tensor is a symmetric\nrank two tensor, the only two possible scalar invariants\nthat can be constructed are (uii )2 and (uik )2 . Because\nthese terms are invariants of the system, they cannot depend on coordinate system. From this we deduce the\nform of the energy density\nǫ=\n\nǫ=\n(4)\n\nSince u is a vector, we may write it in either coordinate\nsystem:\nu = ui x̂i = uμ ξ̂μ\n\n(5)\n\nP\nfrom which we have ui = μ uμ ξˆμ * x̂i . In order to calculate the direction cosines, we note that if xi = xi (ξμ ),\nthen\nX ∂xi\n1\nξˆμ = r\nx̂i\nP \u0010 ∂xj \u00112 i ∂ξμ\nj\n\n(6)\n\n∂ξμ\n\nWe recognize the radicand in the denominator as h2μ and\nwe have\n\u0013 \u0014\n\u0012\n\u0013\u0015\n\u0012\n∂xi\n∂\nuρ ∂xi\n∂ui\ndξμ (7)\ndxk =\n+\ndxi +\n∂xk\n∂ξμ\n∂ξμ hρ ∂ξρ\nP ∂xi ∂xi\n= h2μ δμν , it is straightUsing orthogonality, i ∂ξ\nμ ∂ξν\nforward to find\n\u0012\n\u0013\nX \u0014 ∂uμ\n∂uν\n∂\n1 ∂xi ∂xi\nhμ\nuμν =\n+ hν\n+\nuρ\n∂ξν\n∂ξμ\n∂ξμ hρ ∂ξρ ∂ξν\niρ\n\u0015\n\u0012\n\u0013\n1 ∂xi ∂xi\n∂\nuρ /(2hμ hν ),\n(8)\n+\n∂ξν hρ ∂ξρ ∂ξμ\n\n(9)\n\nwhere λ and μ are Lamé coefficients. Since any deformation may be written in terms of uniform or hydrostatic\ncompression and pure shear, we rewrite the strain tensor,\nuik = 31 δik ull + (uik − d1 δik ull ). The hydrostatic compression is given by the first term, as it involves only the\ntrace of uik . And the second term describes pure shear\nbecause its trace is zero. In terms of these quantities, the\nenergy becomes\n\nand\n\u0013\u0012\n\u0013\nX\u0012\n∂ui\n∂ui\n′2\ndxi +\ndxi +\ndxk\ndxj\nds =\n∂xk\n∂xj\ni\n\n\u0001\n1\nλuii 2 + 2μuik 2 ,\n2\n\n\u00012 \u0011\n1\u0010\nKull 2 + 2μ uik − 1d δik ull\n,\n2\n\n(10)\n\nwhere the bulk modulus K = λ + d1 μ, and μ is the shear\nmodulus.\nWhen a body is deformed, the displaced internal elements experience forces which tend to restore them\nto their equilibrium positions. The volume element\nbounded by the surfaces x = x0 , x = x0 + δx, y = y0 ,\ny = y0 + δy, z = z0 , and z = z0 + δz experiences a force\nalong any surface with normal n, fi = σik nk , where σik\nis the stress tensor and\nI\nZ\n∂σik\nFiext = dA σik nk = dV\n.\n(11)\n∂xk\nIn equilibrium, the internal stresses of the system must\nbalance the external forces exerted upon it; thus, the\nequilibrium condition for the system is\n∂σik\n− fiext = 0.\n∂xk\n\n(12)\n\nIn curvilinear coordinates, this entire discussion can be\nrepeated and the stress tensor in these coordinates is\nmerely a transformation of the stress tensor in Cartesian\ncoordinates:\nσμν =\n\n1 1 X ∂xi ∂xk\nσik ,\nhμ hν\n∂ξμ ∂ξν\n\n(13)\n\nik\n\nwhere, again, there is no sum over μ or ν. The equilib-\n\n\f3\nrium conditions become\n\u0015\nX 1 ∂ \u0012 1 ∂xi \u0013 \u0014 1 ∂xi\n1 ∂xi\nσνλ +\nσμλ\nhν ∂ξν hλ ∂ξλ\nhμ ∂ξμ\nhν ∂ξν\n\nand the converse by,\nuik =\n\niνλ\n\n+\n\n1 ∂σμν\n− fμext = 0.\nhν ∂ξν\n\n(14)\n\nwhere we have followed the same procedure as in the\nderivation of uμν which requires expanding the tensor in\nboth the x̂i and ξˆμ frames.\nThe relation between stress and strain follows the argument in Cartesian coordinaties. If the system is deformed an infinitesimal amount δui , the work done by\nthe change in internal\nstresses is the force times the disR\nplacement, W = dV (∂σik /∂xi )δuk . When integrated\nby parts, the work is\nI\nZ\n∂δui\nW =\ndA σik nk δui − dV σik\n∂xk\n\u0013\n\u0012\nZ\n1\n∂δui\n∂δuk\n= −\n+\ndV σik\n2\n∂xi\n∂xk\nZ\n= − dV σik duik .\n(15)\nNote that the surface integral vanishes because\nσik = 0 at infinity.\nThus, dE = σik δuik .\nBy taking the total differential of equation (10),\ndE = K ull dull + 2μ(uik − \u0001d1 δik ull )d(uik − d1 δik ull ) =\nK ull δik + 2μ(uik − d1 δik ull ) duik , we can rewrite the\nstress tensor in terms\nof the strain tensor, σik = Kδik ull −\n\u0001\n2μ uik − d1 δik ull , or conversely, the strain in\u0001 terms of\n1\nthe stress, uik = d21K δik σll + 2μ\nσik − d1 δik σll .\nSimilarly, it is instructive to consider a homogeneous\ndeformation, which has constant stain tensor everywhere\nin the volume. For a d-dimensional solid, uniform pressure is applied to the faces with normals in the ±ẑ\ndirections. In 3-dimensions, for example, we consider\nthe simple compression of a rod. This implies that\nσzi ni = p, or σzz = p. Thus, all off diagonal components of the strain tensor are zero, and the diagonal\n1\n1\n− 2μ\n)/d, for all l 6= z, and\ncomponents are ull = p( dK\n1\nd−1\nuzz = p( dK + μ )/d. The relative longitudinal compression is given by uzz = p/Yd , where\nYd =\n\n2d2 Kμ\n2μ + (d2 − d)K\n\n(16)\n\nis the d-dimensional Young's modulus. The ratio of\ntransverse extension to longitudinal compression is given\nby the Poisson ratio γ = −ull /uzz = (dK − 2μ)/((d2 −\nd)K +2μ). Conversely, the bulk and shear moduli written\nin terms of the Young's modulus and Poisson ratio are,\nrespectively, K = d1 Yd /(1−(d−1)γ) and μ = 21 Yd /(1+γ).\nThe stress tensor is given in terms of the strain tensor by,\n\u0012\n\u0013\nYd\nγ\nσik =\nuik +\n(17)\nδik ull ,\n1+γ\n1 − (d − 1)γ\n\n1\n((1 + γ)σik − γδik σll ) .\nYd\n\n(18)\n\nThe conventional form of the energy is given in terms of\nYd and γ,\n\u0013\n\u0012\nZ\nYd\nγ\nE=\null 2 . (19)\ndd x uik 2 +\n2(1 + γ)\n1 − (d − 1)γ\nNow that we have derived the relations between the stress\nand strain tensors, the equilibrium condition may be recast in terms of the displacement vector,\n\u0012 2\n\u0013\nYd\n∂ ui\n1 − (d − 3)γ ∂ 2 ul\n− fi = 0. (20)\n+\n2(1 + γ) ∂x2k\n1 − (d − 1)γ ∂xi ∂xl\nIf the force only acts through the surface, then fi vanishes\nin the bulk and we recover the result that ∇2 ∇ * u = 0\nfrom which it follows that ∇4 u = 0.\nB.\n\nElasticity in Flatland [12]\n\nOur ultimate goal is to study the effects of uniform\ntension on a thin sheet of elastic material with a square\nlattice of circular holes cut in it, as it models an elastic\nsheet that is uniformly swollen. In general, the resulting deformations are constant across the thickness of the\nsheet and may be considered to be purely longitudinal.\nThis is because forces act primarily in the plane of the\nfilm, yielding the boundary condition σik nk = 0. Henceforth, we will only consider two dimensional systems with\nplanar deformations.\nLet us pause for a minute to derive the equilibrium\nconditions of this system. Since the deformations are\nconstant throughout the thickness of the sheet, we may\nassume that uzz = 0, and thus σzz = σiz = 0. We\nare left with the two equilibrium equations h∂σik /∂xk =\n−pi , where i, k = x, y, and h is the thickness of the film.\nWhen no external body forces are present the equations\nof equilibrium reduce to ∂σik /∂xk = 0 or,\n∂σxy\n∂σxy\n∂σyy\n∂σxx\n+\n= 0,\n+\n= 0.\n∂x\n∂y\n∂x\n∂y\n\n(21)\n\nViewing these both as equations of the form ∇ * A = 0,\nwe know that σxi = ǫik ∂k φy and σjy = ǫjk ∂k φx and it\nfollows that ∂x φy + ∂y φx = σxy − σxy = 0 (where ǫik is\nthe totally antisymmetric tensor). Thus φm = ǫmn ∂n χ\nfor some scalar χ, known as the Airy stress function.\nWe thus have σik = ǫim ǫkn ∂m ∂n χ. Moreover, since\nuik = (∂i uk + ∂k ui )/2, we have ǫim ǫkn ∂i ∂k umn = 0. The\nrelation between stress and strain, (17) implies that\n\u0012\n\u0013\nγ\n∂ 2 σmn\nYd\n0+\n=\nǫim ǫkn\n∇2 ∇ * u = 0\n∂xi ∂xk\n1+γ\n1 − (d − 1)γ\n(22)\n\n\f4\nAs a result, we deduce that the stress function satisfies\nthe biharmonic equation, ∇4 χ = 0. In orthogonal coordinates, we recast the components of the stress tensor in\nterms of the Airy stress function by taking advantage of\nEq. (13) and reexpressing σij in terms of σμν ,\n\u0014\n\u0015\nX\n1\n∂ \u0010 1 ∂χ \u0011\n1 ∂hρ ∂χ\nσμν =\nǫμλ\nǫνρ\n+ ǫμρ\n,\nhλ\n∂ξλ hρ ∂ξρ\nhμ hν ∂ξμ ∂ξν\n\nIn order for the second stress function to respect the\nbroken symmetry of the system, it must have the form\nχ(1) = f (r)+g(r) cos 2φ. Since the stress function satisfies\nthe biharmonic equation, we can easily integrate to find\nf (r) = ar2 log r + br2 + c log r\ng(r) = sr2 + tr4 + u/r2 + v\n\nρλ\n\n(23)\nwhere ǫαβ = 1 because {α̂, β̂} is a right-handed orthonormal basis. Equations (23) are solutions to the equilibrium\nequations, Eq. (14), and the Airy stress function solves\nthe biharmonic equation in orthogonal coordinates.\n1.\n\nFixing a Hole (Demo)\n\n(1)\n\nThe first boundary conditions σik (r = ∞) = 0 dictate\nthat a = b = s = t = 0, leaving\n\u0001\n(1)\nσrr\n(r) = c/r2 − 6u/r4 + 4v/r2 cos 2φ\n(1)\n\nσφφ (r) = −c/r2 + 6(u/r4 ) cos 2φ\n\u0001\n(1)\nσrφ (r) = − 6u/r4 + 4v/r2 sin 2φ\n(1)\n\nThe simplest system to study is an infinite elastic sheet\nwith a circular hole, of radius R, cut in it under uniform\ntension P x̂. This problem naturally lends itself to polar\ncoordinates, for which the equations for the stress function become,\n∂2χ\n1 ∂2χ\n1 ∂χ\n,\n+ 2 2 , σφφ =\nr ∂r\nr ∂φ\n∂φ2\n\u0012\n\u0013\n∂ 1 ∂χ\n= −\n.\n∂r r ∂φ\n\nσrr =\nσrφ\n\n(24)\n\nA standard procedure for solving such problems is to\nsolve first for the deformation of a continuous sheet under the proper forces. Secondly, we solve a for a second\nstress function respecting the symmetry broken by the\nforce with boundary conditions σik (r = ∞) = 0. The\nfinal stress function is given by the sum of the two stress\nfunctions, where the matching condition is given by the\nstress free boundary condition at the edge of the hole.\nThe components of the stress tensor for a continuous\n(0)\nelastic sheet under uniform tension P x̂ are σxx = P and\n(0)\n(0)\nσyy = σxy = 0, which, by integrating Eqs. (21) yield\nthe stress function\nχ(0) = P y 2 /2 = P r2 (sin2 φ)/2 = P r2 (1−cos 2φ)/4 (25)\nfrom which it follows that the components of the stress\n(0)\n(0)\ntensor are σrr (r) = P (1 + cos 2φ)/2, σφφ (r) = P (1 −\n(0)\n\ncos 2φ)/2, and σrφ (r) = P (sin 2φ)/2. Clearly, rotational\nsymmetry is broken in the x̂-direction.\n\nur\nuφ\n\n(26)\n\n(27)\n(0)\n\nUsing the final boundary conditions, σμν (R) = −σrφ (R)\nthe remaining constants are found to be c = −P R2 /2,\nu = −P R4 /4, and v = P R2 /2. Note that even though\nthere are only two equations for three unknowns, this\nsystem is not underdetermined because the constant c\ncannot depend on φ. Assembling this, the components\nof the stress tensor are given by\n\u0014\n\u0013\n\u0015\n\u0012\nP\nR2\n4R2\n3R4\nσrr (r) =\n1 − 2 + 1 − 2 + 4 cos 2φ ,\n2\nr\nr\nr\n\u0014\n\u0013\n\u0015\n\u0012\nP\nR2\n3R4\nσφφ (r) =\n1 + 2 − 1 + 4 cos 2φ\n2\nr\nr\n\u0012\n\u0013\n3R4\n2r2\nP\n1 + 2 − 4 sin 2φ.\nσrφ (r) = −\n(28)\n2\nr\nr\nwhich may be rewritten, using equation (18), as components of the strain tensor\n1\n(σrr − γσφφ )\nY2\n1\n=\n(σφφ − γσrr )\nY2\n1+γ\nσrφ .\n=\nY2\n\nurr =\nuφφ\nurφ\n\n(29)\n\nRecall, the strain tensor is the relative displacement\nof every element from its equilibrium position. In polar\ncoordinates we have urr = ∂ur /∂r, uφφ = (∂uφ /∂φ)/r +\nur /r, and 2urφ = ∂uφ /∂r + (∂ur /∂φ) − uφ /r, from which\nit follows that the displacement vector is\n\n\u0013\n\u0015\n\u0013\n\u0014\n\u0012\n\u0012\n4R2\n(1 + γ)R2\nR4\nP\ncos 2φ\n(1 − γ)r +\n+ (1 + γ) r − 3 +\n=\n2Y2\nr\nr\nr\nP (R2 + r2 )2 + γ(R2 − r2 )2\nsin 2φ.\n= −\n2Y2\nr3\n\n(30)\n\n\f5\nHowever, if we repeat the above process for an infinite\nsheet under hydrostatic compression (or expansion), to\nlinear order the rotational symmetry of this system is\nnot broken. Consider an annulus of inner radius R0 and\nouter radius R1 under uniform hydrostatic compression\n(0)\n(0)\nwith boundary conditions given by σrr = −P and σφφ =\n(0)\n\nσrφ = 0. Clearly, the displacements are purely radial,\nand we need only solve ∇4 u = 0, subject to the boundary conditions σrr (r = R1 ) = −P and σrr (r = R0 ) = 0.\nThe displacements are given \u0002by ur (r) = a/r + br; from\n\u0003\nY2\n2\nwhich it follows σrr = 1−γ\n2 −(1 − γ)a/r + (1 + γ)b .\nThe boundary conditions determine the values of the conR2 R2\nR21\nstants a = − YP2 (1 + γ) R20−R12 and b = − YP2 (1 − γ) R2 −R\n2.\n1\n0\n1\n0\nThe solution to an annulus under hydrostatic compression is\n\u0012\n\u0013\nR02\nR12\nP\n(1 + γ)\n+ (1 − γ)r , (31)\nur (r) =\nY2 R12 − R02\nr\n\nwith the components of the stress tensor given by\nR2\nr2 − R02\nσrr (r) = −P 2 1 2\nR1 + R0\nr2\nR2\nr2 + R02\nσφφ (r) = −P 2 1 2\nR1 + R0\nr2\nσrφ (r) = 0.\n\nFIG. 1: Curves of constant α and β are circles in bipolar\ncoordinates.\n\n(32)\n\nIn the case of a finite sheet or a pipe under hydrostatic\ncompression, there is the well known von Mises buckling\ninstability at a critical pressure where the circular hole\ndeforms into an ellipse whose major axis is chosen at\nrandom [13]. This critical pressure scales with the ratio\nof the system size to the hole radius and, thus, diverges\nfor large systems. The system we are studying, on the\nother hand, has an underlying lattice which breaks the\nrotational symmetry of each hole. A superposition of\nthe above solutions would not account for the interaction\nbetween holes.\n2.\n\nFixing a Hole (Take 2)\n\nUnderstanding the elastic interaction between holes in\nan elastic sheet was, during the first half of the last century, the subject of much research [9, 14–16, 18, 19].\nMost of which was dedicated to finding the maximum\nstress felt along the perimeter of each hole. While linear\nelasticity may provide reasonable solutions to such analysis, we will demonstrate that linear theory breaks down\nupon further investigation.\nThe simplest system accounting for the interaction between holes is an infinite elastic sheet containing two\nholes of radius R, whose centers are separated by distance 2d. This sheet is then subjected to uniform tension\nP . The analysis of this system will closely follow that of\nLing [19]. Bipolar coordinates, defined by\nx=\n\na sinh α\n,\ncosh α − cos β\n\ny=\n\na sin β\n,\ncosh α − cos β\n\n(33)\n\nfor β ∈ [0, 2π), α ∈ (−∞, ∞), are the natural choice for\nthis problem, as lines of constant α or β are circles in the\nxy-plane defined by x2 + (y − a cot β)2 = a2 csc2 β and\n(x − a coth α)2 + y 2 = a2 csch2 α. The system of two equal\nholes corresponds to α = ±s, s = cosh−1 (d/R), and\na2 = d2 − R2 . When the system is under uniform tension\nP , the components of the stress tensor are σxx = P ,\nσyy = P , and σxy = 0. By integrating the Eqs. (21),\nthe stress function for an infinite system under uniform\ntension is\nχ(0) =\n\nP 2\nP a2 cosh α + cos β\n(x + y 2 ) =\n.\n2\n2 cosh α − cos β\n\n(34)\n\nUsing the method outlined in the previous section, we\nundertake the tedious calculation, detailed in Appendix\nA, to find the equilibrium configuration of this system.\nThe results for uniform compression and tension are displayed in FIG. II B 2. Upon further analysis of the compressed system, large enough values of P yield overlapping solutions for the displacement vectors, signaling the\nbreakdown of the linear theory.\n\nIII.\n\nTHE LINEAR THEORY OF NONLINEAR\nELASTICITY\n\nEven were there no instability in the linear theory of\ntwo elastic holes, the sheer complexity of the equations\nwould make calculations of increasing numbers of holes\na nearly impossible task, and understanding the mechanism by which the holes collapse and the shapes they\nform requires a nonlinear theory of elasticity. Thus, we\nturn to the theory of cracks for inspiration. In the linear\n\n\f6\nas a dislocation dipole [21]. This formalism allows us to\nrecover the same physics by the simple numerical minimization of algebraic equations, once described by a complex system of coupled differential equations.\nA.\n\nFilling a Crack\n\nOur model system consists of an isotropic solid where\neach collapsed hole is represented by a thin line of material that has been taken out of the system, or a dislocation dipole. The Burgers vector for a dislocation dipole\n\nFIG. 3: Two dipoles of strengths d1 and d2 are separated by\nR.\n\nFIG. 2: An elastic sheet with two circular holes cut out (a)\nis subjected to uniform tension (b) and compression (c). The\ndark blue curves are the the boundary of the holes. The other\ncurves show deformations of the circles in (a) to aid the eye.\n\ntheory of elasticity, cracks can be described by a continuous distribution of parallel dislocations [8, 20]. The\nstresses in a body due to a crack are the same as the\nstresses in an isotropic body with a distribution of dislocations with the same height profile as that of the crack.\nAs a first approximation, we model each of the collapsed\nholes as a pair of oppositely charged dislocations, known\n\nY2 b2 d1 d2\nE=\n(2π)2\n\nZ\n\nd2 q\n\nof strength b with dipole vector d located at r is\n\u0013\n\u0013\u0015\n\u0012\n\u0014\n\u0012\nd\nd\n2\n2\nb (x) = ẑ × d̂ b −δ x − − r + δ x + − r ,\n2\n2\n(35)\nor in Fourier space,\n\u0015\n\u0014\nqd\niqr cos θ\ncos(θ − θ0 )\nb (q) = 2ibẑ × d̂ e\nsin\n2\n≈ ibqẑ × d eiqr cos θ cos(θ − θ0 ).\n\nwhere θ is angle of q and θ0 is the direction of the dipole\nand we have, in the spirit of the dipole approximation,\ntaken the lowest order term in d = |d|.\nThe interaction energy of two dipoles d1 and d2 both\nof strength b separated by R is given by\n\nh\ni h\ni\nq × (ẑ × d̂1 ) * q × (ẑ × d̂2 )\nq4\n\n(36)\n\n\u0001\n(iq cos(θ − θ1 )) −iqe−iqR cos θ cos(θ − θ2 ) ,\n\n(37)\n\nwhere d1 is at the origin. After carrying out the integration (see Appendix B 1), the pairwise interaction between two\ndislocation dipoles is\nEint\n\nY2 b2 d1 d2\n=−\nπ R2\n\n\u0013\n\u0012\n1\n.\ncos(θ1 + θ2 ) sin θ1 sin θ2 +\n4\n\n(38)\n\n\f7\nNote that the interaction energy is invariant under θ1 →\nθ1 + π and θ2 → θ2 + π, which reaffirms each collapsed\nhole is represented by a line, not a vector. The total\ninteraction energy of an array of dislocation dipoles is\nmerely a sum of all pairwise interactions, because we are\nusing linear theory. The centers of the initial holes set the\nposition of each dislocation dipole, but they are allowed\nto rotate freely. The equilibrium state minimizes the free\nenergy over the angle each dipole makes with respect to\na fixed axis.\n\n1.\n\nThe 2 × 2 Diamond Plate Plaquette\n\nThe simplest case consists of four holes located at\n{±a/2, ±a/2}. Because all four holes have the same radius, their dipole vectors should have the same magnitude. We minimize the energy functional, composed of\nthe sum of six pairwise terms,\n\nY2 b2 d2 \u0002\ncos(θ1 + θ2 ) sin θ1 sin θ2 + cos(θ3 + θ4 ) sin θ3 sin θ4 + cos(θ1 + θ3 − π) sin(θ1 − π2 ) sin(θ3 − π2 )\nπa2\n+ cos(θ2 + θ4 − π) sin(θ2 − π2 ) sin(θ4 − π2 ) + 21 cos(θ1 + θ4 − π2 ) sin(θ1 − π4 ) sin(θ4 − π4 )\n\u0003\n3π\n3π\n(39)\n+ 12 cos(θ2 + θ3 − 3π\n2 ) sin(θ2 − 4 ) sin(θ3 − 4 ) ,\n\nE2×2 = −\n\nover each of the angles, which are measured with respect\nto the x-axis. Minimizing with respect to the four angles\nwe find θ1 = θ4 and θ2 = θ3 by symmetry and\nsin 4θ1 − cos 2θ1 − 4 sin 2(θ1 + θ2 ) = 0\nsin 4θ2 + cos 2θ2 − 4 sin 2(θ1 + θ2 ) = 0.\n\norientations of the ground state of each lattice. We find\nthat the diamond plate order of the 2 × 2 plaquette persists for larger and larger samples with increasing alignment along the lattice directions.\n\n(40)\n\nThe minimum is\nθ1 =\n\n1\nsin−1\n2\n\n\u0012\n\n1\n10\n\n\u0013\n\n= θ2 −\n\nπ\n.\n2\n\n(41)\n\nWhile one might have postulated that the lowest energy\nconfiguration would have θ1 = 0 and θ2 = π/2, it turns\nout that the energy is slightly lowered if these angles\nare slightly shifted. This is due to the finite size of our\nsystem – as we shall see, for larger systems the dipoles\nalign along the crystal axes and there is a boundary effect\nwhich distorts the dipole directions at the edges.\n2.\n\nWe Had to Count Them All: n × n Systems of Holes\n\nOne might wonder how we can study larger and larger\nsystems since the interaction only falls off as 1/R2 . Because the interactions is between dipoles, the interaction\nenergy at large distances decreases because the angle of\nthe dipoles rotates around the circle. Indeed, consider the\ninteraction of a single dipole at the origin with N 2 − 1\nother dipoles in an N a × N a lattice. The angular dependence in (38) will wash out the power law if the dipoles\nrotate through 2π uniformly. As we will see in the next\nsection, this is precisely what happens as shown in Fig.\n5.\nFor these larger arrays of holes, the sheer number of\ncoupled equations makes it impractical to find solutions\nby hand, and we turn to numerical methods to find the\n\nFIG. 4: The groundstate orientation of the 2 × 2 plaquette.\n\nB.\n\nStretching the Lattice\n\nIn experimental systems [4], the elastic sheet was\nstretched in a specific direction before allowing it to\nswell, leading to a background stress σxx = T cos φ,\nσyy = T sin φ. To calculate the coupling energy between\nthe stretching and the dipole angle, we will rotate the\nsystem, such that the x-axis is defined by the direction\nof stretching, or σxx = T and the dipole is located at the\norigin, or\nb(q) = ibq ẑ × d cos(θ − θ0 + φ).\n\n(42)\n\nIt is most appropriate to use the energy functional E =\n\u00012\nR 2\n1\nd x ∇2 χ . In Fourier space, the dipole term is\n2Y2\ngiven by ∇2 χ = iǫik qqk2 bi (q) [21] and the stretching term\n\n\f8\n\nFIG. 5: The groundstate orientations for square lattices of\n10 × 10 (a), 13 × 13 (b), 17 × 17 (c), and 20 × 20 (d).\n\nby ∇2 χ = T δ(q)\nq δ(θ). The energy is\n\u0012\n\u0013\nZ\nδ(q)\nd2 q\n1\n2\nT\nδ(θ) − bd cos (θ − θ0 + φ)\nE =\n2Y2\n(2π)2\nq\n\u0012\n\u0013\nδ(q)\n2\n× −T\nδ(θ) + bd cos (θ − θ0 + φ) ,\n(43)\nq\n\nFIG. 6: The 4 × 4 and 7 × 7 system of holes are stretched\nby tension T x̂. For small tensions (in (a) and (d) T =\n2 2\n0.1 Yπ2 bad2 ), the diamond plate groundstate is only slightly\nfrom which the coupling energy is\nperturbed. Whereas for large tensions (in (b), (c), (e), and\n2 2\n(f) T = 2 Yπ2 bad2 ), the holes align along the x̂-axis, the direcZ\nZ\nT bd\nδ(q)\nEstretch = −\nδ(θ) cos2 (θ − θ0 + φ) tion of stretching. In (b) and (e) the angle of stretching is\nqdq dθ\nY2 (2π)2\nq\nθStretch = π/4 from horizontal.\n\n= −\n\nT bd\ncos2 (φ − θ0 )\nY2 (2π)2\n\n(44)\n\nThe new term causing the dislocation dipoles to align\nwith the direction of stretching competes with original\ninteraction energy, favoring the diamond plate pattern.\nFollowing the same minimization procedure as before, we\nfind that for small tensions the diamond plate pattern is\nonly slightly perturbed, and for large tensions, the dislocation dipoles align along the direction of stretching,\nwhich may be seen in Fig.6.\nIV.\n\nCONCLUSION\n\nWe have created a model system for an elastic sheet\nwith a square lattice circular holes cut out of it. When\nthe sheet is swollen, or, equivalently, subjected to uniform\ntension, the holes snap shut. Their major axes align into\na diamond plate pattern with long ranged order. While\nother methods of calculating the orientational order of\nthe holes rely upon nonlinear elasticity theory and finite\n\nelement simulations, we use simple linear elasticity theory to obtain the same results. Our system also corroborates experimental results of the sheet under external\nforces. This method may easily extended to holes on\nother lattices. It is difficult to extend it to an infinite\nlattice, since the minimization would then be over an infinite number of angles. An Ewald type summation may\nbe used for an infinite system whose unit cell is the 2 × 2\nplaquette. However, this is unlikely to lead to new insight, as the diamond plate order is clearly maintained\nfor large systems. Moreover, as we show in the appendix,\nthe dipole interactions are the dominant terms even for\nmore general elliptical holes.\n\nAcknowledgments\n\nWe thank G.P. Alexander, B.G. Chen, C.D. Modes, S.\nYang, and Y. Zhang for useful discussions. This work\n\n\f9\nwas supported by NSF MRSEC Grant DMR05-20020.\nAPPENDIX A: LINEAR ELASTICITY IN\nBIPOLAR COORDINATES\n1.\n\n∂χ\nY2\nY2\n− 1−σ\nhuα and ∂G\n∂α = − ∂β + 1−σ huβ . Using these\nequations, we eliminate uα and uβ from equation (A5)\n∂χ\n∂α\n\n∂2\n∂α∂β\n\nThe Basics\n\nFor clarity's sake, we take a moment to explicitly write\nout the useful equations in bipolar coordinates. From\nequations (8), we simply read off the components of the\nstrain tensor\n1 ∂uα\n1 ∂h\n1 ∂uβ\n1 ∂h\nuαα =\n+ 2\nuβ , uββ =\n+ 2\nuα ,\nh ∂α\nh ∂β\nh ∂β\nh ∂α\n∂ \u0010 uβ \u0011\n∂ \u0010 uα \u0011\n2uαβ =\n+\n.\n(A1)\n∂α h\n∂β h\nThe stress tensor may be written as a function of the\nAiry stress function χ, from equation (23)\n\u0012\n\u0013\n1 ∂h ∂χ\n1 ∂χ\n1 ∂\n+ 3\n,\nσαα =\nh ∂β h ∂β\nh ∂α ∂α\n\u0012\n\u0013\n1 ∂h ∂χ\n1 ∂χ\n1 ∂\n+ 3\n,\nσββ =\nh ∂α h ∂α\nh ∂β ∂β\n\u0013\n\u0012 2\n1\n∂ χ\n1 ∂h ∂χ\n1 ∂h ∂χ\nσαβ = − 2\n−\n−\nh\n∂α∂β\nh ∂β ∂α h ∂α ∂β\n\u0014\n\u0012\n\u0013\n\u0012\n\u0013\u0015\n1 ∂\n∂\n1 ∂χ\n1 ∂χ\n= −\n+\n. (A2)\n2 ∂α h2 ∂β\n∂β h2 ∂α\n\nor in terms of the relative displacement vector, from Eq.\n(17)\nY2\n(uαα + σuββ ) ,\n1 − σ2\nY2\nσββ =\n(uββ + σuαα ) ,\n1 − σ2\nY2\n2σαβ =\nuαβ .\n(A3)\n1+σ\nAt first glance, it seems an insurmountable goal to solve\nthe differential equations for the displacements in terms\nof the Airy stress function. However, following [14], they\nbecome much more tractable if one considers the terms\n\u0013\n\u0012\nY2 1 ∂(huα ) ∂(huβ )\n+\nσαα + σββ =\n1 − σ h2\n∂α\n∂β\n\u0012 2\n\u0013\n2\n1 ∂ χ ∂ χ\n= 2\n,\n(A4)\n+\nh\n∂α2\n∂β 2\nσαα =\n\nσαα − σββ\n\nfrom σαα +σββ and σαα −σββ , respectively. There exists a\nfunction G which satisfies equation (A6) for which ∂G\n∂β =\n\n\u0012\n\u0013\n∂ \u0010 uα \u0011\n∂ \u0010 uβ \u0011\nY2\n−\n=\n1 + σ ∂α h\n∂β h\n\u0012\n\u0013\n\u0012\n\u0013\n∂\n∂\n1 ∂χ\n1 ∂χ\n= −\n+\n(A5)\n∂α h2 ∂α\n∂β h2 ∂β\n\nor, equivalently, we arrange equations to obtain,\n\u0012\n\u0013\n\u0012\n\u0013\n∂\n∂χ Y2 (huα )\n∂χ Y2 (huβ )\n∂\n+\n= 0,\n−\n−\n∂α ∂α\n1−σ\n∂β ∂β\n1−σ\n(A6)\n\n\u0012\n\nG\nh\n\n\u0013\n\n=−\n\nh\n(σαα − σββ ) ,\n1+σ\n\n(A7)\n\nthe left hand side of this equation may be written in this\n∂2 1\nmanner because ∂α∂β\nh = 0. Thus, the relative displacement vectors are given by\n\u0012\n\u0013\n1 − σ 1 ∂χ ∂G\n−\nY2 h ∂α\n∂β\n\u0012\n\u0013\n1 − σ 1 ∂χ ∂G\n.\n+\n=\nY2 h ∂β\n∂α\n\nuα =\nuβ\n\n2.\n\n(A8)\n\nFixing a Hole (Outtake)\n\nRecall, χ is the solution to the biharmonic equation\n∇4 χ = 0 with respect to the symmetries in our system.\nThe biharmonic equation when written in terms of the\nfunction χ/h has the simplified form,\n\u0012\n\n∂4\n∂4\n∂4\n∂2\n∂2\n+\n+\n2\n−\n2\n+\n2\n+1\n∂α4\n∂β 4\n∂α2 ∂β 2\n∂α2\n∂β 2\n\n\u0013\n\nχ\n= 0.\nh\n(A9)\nSimilarly, the components of the stress tensor are given\nby,\nσαα\nσββ\nσαβ\n\n\u0015\n1 ∂2\nsinh α ∂\nsin β ∂\ncosh α χ\n=\n−\n−\n+\nh ∂β 2\na ∂α\na ∂β\na\nh\n\u0014\n\u0015\n2\n1 ∂\nsinh α ∂\nsin β ∂\ncos β χ\n=\n−\n−\n+\n2\nh ∂α\na ∂α\na ∂β\na\nh\n1 ∂2 \u0010 χ \u0011\n.\n(A10)\n= −\nh ∂α∂β h\n\u0014\n\nOur system, while undergoing uniform hydrostatic\ncompression, is described by the stress function in equation (34),\nχ(0)\nPa\n=\n(cosh α + cos β) ,\nh\n2\nor, equivalently, is given by the components of the stress\ntensor\n(0)\n\n(0)\nσαα\n= σββ = P,\n\n(0)\n\nσαβ = 0.\n\n(A11)\n\nWe aim to find solutions to the biharmonic equation that\nare even in both α and β. Thus, the Airy stress function\nis given by\n\n\f10\n\n∞\nX\nχ(1)\n= C (cosh α − cos β) log (cosh α − cos β) +\nφn (α) cos nβ,\nh\nn=1\n\n(A12)\n\nwhere φn (α) = An cosh(n + 1)α + Bn cosh(n − 1)α. The components of the stress tensor corresponding to this Airy\nstress function are\n1\nC\n(cosh 2α − 2 cosh α cos β + cos 2β) + φ1 (α)\n2a\na\n∞\n1 X1\n+\n[fn+1 (α) − 2 cosh αfn (α) + fn−1 (α) − 2 sinh αgn (α)] cos nβ\n2a n=1 n\n\n(1)\nσαα\n= −\n\n(1)\n\n(A13)\n\nC\n1\n1\n(cosh 2α − 2 cosh α cos β + cos 2β) + φ1 (α) − φ′′1 (α)\n2a\na\n2a\n∞\nX\n\u0002 ′′\n\u0003\nφn+1 (α) − 2 cosh αφ′′n (α) + φ′′n−1 (α) + (n + 2)φn+1 (α) + 2 sinh αφ′n (α) + (n − 2)φn−1 (α) cos nβ (A14)\n−\n\nσββ =\n\nn=1\n\n(1)\n\nσαβ = −\n\n∞\n1 X\nC\nsinh α sin β −\n[gn+1 (a) − 2 cosh αgn (α) + gn−1 (α)] sin nβ,\na\n2a n=1\n\nwhere fn (α) = (n+1)n(n−1)φn (α) and gn (α) = nφ′n (α).\nThe boundary conditions require there be no stress at\ninfinity (α = 0), hence\n∞\nX\n\n[An + Bn ] = 0,\n\n(A16)\n\nn=1\n\nand the normal and tangential stresses must vanish along\nthe edges of the holes, located at α = ±s. Thus, the\nconstants An , Bn and C must satisfy the following recurrence relations for n ≥ 2\nfn+1 (s) − 2 cosh sfn (s) + fn−1 (s) = 2 sinh sgn (s),(A17)\ngn+1 (s) − 2 cosh sgn (s) + gn−1 (s) = 0,\n(A18)\n\nnomial tn+1 − 2 cosh stn + tn−1 = 0, yielding gn (s) =\nc1 e−ns + c2 ens . However, the stress must be finite\neverywhere, thus, c2 = 0.\nEquation (A22) completes the relation for gn (s) as c1 = 2C sinh s. Because, equation (A17) is a non-linear recurrence relation, we must consider fn+2 − 2 cosh sfn+1 s + fn s −\ngn+1\nTwo of\ngn (fn+1 (s) − 2 cosh sfn (s) + fn−1 (s)) = 0.\nthe roots of the characteristic polynomial for this equation are degenerate, the equation is fn (s) = d1 e−ns +\nd2 ne−ns + d3 ens . From the boundary conditions, we determine fn (s) = −2K (cosh s + n sinh s) e−ns . From the\ndefinitions of fn (α) and gn (α), we find that the coefficients An , Bn and C satsify,\n\nsubject to the conditions\n\ne−ns sinh ns + ne−s sinh s\n,\nn(n + 1) (sinh 2ns + n sinh 2s)\ne−ns sinh ns + nes sinh s\n= −2C\n,\nn(n − 1) (sinh 2ns + n sinh 2s)\nC\nwith B1 = tanh s cosh 2s + P,\n2\n\nAn = 2C\n\nP\n− C cosh 2s,\na\nf2 (s) − 2 sinh sg1 (s) = 2 cosh s,\ns − 2 cosh sf2 (s) + f3 (s) = 2 sinh sg2 (s) + 2C,\n2 cosh sg1 (s) − g2 (s) = 2C sinh s.\n2φ1 (s) = −2\n\n(A19)\n\n(\n\nBn\n\n(A20)\n(A21)\n(A22)\n\nUsing equation (A18), we find gn (s) = c1 λn1 + c2 λn2 ,\nwhere λ1 and λ2 are roots of the characteristic poly-\n\nC = −P\n\n(A15)\n\n(A23)\nand\n\n\u0015\n∞ \u0014 −ns\nX\ne\nsinh ns + n sinh s (n sinh s + cosh s)\n1\n2\n+ tanh s sinh s − 4\n2\nn(n2 − 1) (sinh 2ns + n sinh 2s)\nn=2\n\n)−1\n\n.\n\n(A24)\n\nNow that we have equations for the stresses everywhere, we may now solve for the field of relative displacement\n\n\f11\nvectors. Recall, our function G is given by,\n\u001b\n\u001a 2\nZ Z\n∂2\nχ\nh\n∂\n−\n−1\nG =\ndαdβ\n2\n2\n1+σ\n∂α\n∂β\nh\n\" \u0012\n#\n\u0012\n\u0012\n\u0013\n\u0013\n\u0013 X\n∞\n2h\nα\nα\nβ\nβ\n=\n2C tan−1 tanh cot\ncos β + tan−1 coth tan\ncosh α +\nψn (α) sin nβ , (A25)\n1+σ\n2\n2\n2\n2\nn=1\nwhere χ = χ(0) + χ(1) and ψ(α) = An sinh(n + 1)α + Bn sinh(n − 1)α. To calculate the displacement field, we will\nneed to know the following relations,\n!\n\u0015\n∞ \u0014\nX\nh\n∂χ\n′\n= h sinh α(−P h cos β + C) −\nφn (α) sinh α − φn (α) cos nβ\n(A26)\n∂α\na\nn=1\n\u0014\n\u0015!\n∞\nX\n∂χ\nh\n= h sin β(−P h cosh α + C) −\nφn (α)\nsin β cos nβ + n sin nβ\n(A27)\n∂β\na\nn=1\n!\n\u0012\n\u0013 X\n\u0015\n∞ \u0014\nh\nh\n2h\n∂G\n′\nC π sinh α cos β + sin β +\n= −\nψn (α) sinh α − ψn (α) sin nβ\n(A28)\n∂α\n1+σ\na\na\nn=1\n\u0012\n\u0013 X\n\u0014\n\u0015!\n∞\nh\n2h\nh\n∂G\nC π cosh α sin β − sinh α +\n= −\nψn (α)\nsin β sin nβ − n cos nβ\n.\n(A29)\n∂β\n1+σ\na\na\nn=1\n\nThese equations, together with Eqs. (A8), complete our\ndescription of the system of two holes under hydrostatic\ncompression, which may be seen in Fig. 2. It should\nbe noted that in the compressed system there is an instability for large enough values of P wherein the displacements intersect each other, causing overlap in the\nsystem.\nDue to the nature of problems in the theory of linear elasticity theory, the most useful identities involve\nthe directional cosines relating the {α, β} to the {x, y}\ncoordinates. The unit vectors\nare\n\u0001 in the new∂xsystem\n\u0001\n∂y\n∂y\n∂x\nŷ and β̂ = h1β ∂β\nx̂ + ∂α\nx̂ + ∂β\nŷ .\ngiven by α̂ = h1α ∂α\nThe orthogonality condition α̂ * β̂ = 0 implies\n\n∂y\n∂α\nh2α\nh2β\n\n∂x ∂x\n∂α ∂β\n\n+\n\n∂y\n∂β\n\n= 0. The directional cosines are related because\n\u0001\n\u0001 \u0001\n\u0001\n\u0001 \u0001\n∂y ∂x 2\n∂x ∂y 2\n∂x 2\n∂x 2\n/ ∂α\n/ ∂β\n1 + ∂α\n= ∂α\n1 + − ∂β\n=\n= ∂α\n\u0001\n\u0001\n∂x 2 ∂y −2\n, or\n∂α\n∂β\n1 ∂x\n1 ∂y\n=\n,\nhα ∂α\nhβ ∂β\n\n1 ∂y\n1 ∂x\n=−\n,\nhα ∂α\nhβ ∂β\n\n\u0012\n\n1 ∂x\nhα ∂α\n\n\u0013\n\nμ\n\nμ\n\nμ μ\n\nν\n\nν\n\nwritten as\n\naμν =\n\n1 ∂xi ∂xj\naij .\nhμ hν ∂ξμ ∂ξν\n\n∂\n∂α\n\n\u0012\n\n1 ∂x\nhα ∂α\n\n\u0013\n\n=−\n\n1 ∂hα ∂x\n1 ∂2x\n,\n+\nh2α ∂α ∂α hα ∂α2\n\n∂hα\n∂β\n\n=\n\n∂ 2 x ∂x\n∂α∂β ∂α\n\n(A32)\n\nand by taking the derivative of the product of α scale\nfunction and orthogonality condition with respect to α\n\n\u0013\n\u0012\n∂x\n1\n∂ 2 y ∂y\n∂ 2 x ∂x\n∂ 2 y ∂y\n1 ∂hα ∂y ∂y\n=\n−\n−\n−\n∂b\nhα hα ∂α ∂α ∂β\n∂α2 ∂β\n∂α∂β ∂α ∂α∂β ∂α\n1 ∂ 2 y ∂y\n∂hα\n1 ∂hα ∂y ∂y\n−\n−\n,\n= 2\n2\nhα ∂α ∂α ∂β\nhα ∂α ∂β\n∂β\n\nwhere we have made use of the definition\n\n(A31)\n\nThe derivatives of the directional cosines can be made\nfrom linear combinations of derivatives of the orthogonal∂y ∂y\n∂x ∂x\nity condition ∂α\n∂β + ∂α ∂β = 0\n\u0001 and the scale functions.\n∂\n∂x\nFor example, to find ∂α h1α ∂α\n, first note there are two\nways of obtaining this derivative; directly,\n\n(A30)\n\nwhere the sign is chosen such that both {x̂, ŷ, ẑ} and\n\n∂\n∂α\n\n{α̂, β̂, ẑ} form right-handed orthonormal triads. Thus,\nunder the change of coordinates {x, y, z} → {α, β, z},\nas Aμν =\nx̂i xˆj transforms\na rank-2 tensor\u0010 Aij =\u0011 aij \u0010\n\u0011\nˆ\nˆ\nˆ\nˆ\nˆ\nˆ\naμν ξ ξ = aij ξ * x̂i ξ ξ * xˆj ξ , which may be\n\n2\n\n∂ y ∂y\n+ ∂α∂β\n∂α . Next multiplying Eqn. A32 by\n\n(A33)\n∂x\n∂β\n\nand Eqn. A33\n\n\f12\nby\n\n\u0001\n∂y 2\n∂β\n\nand taking their sum, this becomes\nh2β\n\n∂\n∂α\n\n\u0012\n\n1 ∂x\nhα ∂α\n\n\u0013\n\n\u0012\n\u0013\n\u0012\n\u0013\n1 ∂hα ∂y ∂y ∂x\n∂hα ∂x\n∂x ∂ 2 y\n∂y ∂x\n1 ∂y ∂y ∂ 2 x\n= 2\n−\n−\n−\n+ 2\nhα ∂α ∂β ∂α ∂β\n∂β ∂α\n∂β ∂β\nhα ∂β ∂β ∂α2\n∂β ∂α2\n1 ∂hα ∂y hβ\n∂hα ∂x\n1 ∂y hβ ∂hα\n= 2\n−\n−\n.\nhα ∂α ∂β hα\n∂β ∂β\nhα ∂β hα ∂α\n\nBy following a the same procedure, the formulae for the derivatives of the directional cosines are\n\u0012\n\u0013\n\u0012\n\u0013\n1 ∂hα ∂xi\n1 ∂hβ ∂xi\n1 ∂xi\n1 ∂xi\n∂\n∂\n= − 2\n=\n,\n,\n∂α hα ∂α\nhβ ∂β ∂β\n∂β hα ∂α\nhα hβ ∂α ∂β\n\u0012\n\u0013\n\u0012\n\u0013\n1 ∂hα ∂xi\n1 ∂hβ ∂xi\n1 ∂xi\n1 ∂xi\n∂\n∂\n=\n=− 2\n,\n,\n∂α hβ ∂β\nhα hβ ∂β ∂α\n∂β hβ ∂β\nhα ∂α ∂α\n\nwhere i = 1, 2 and x1 = x and x2 = y. Note that\nthe cross partial derivatives of the directional cosines are\nequal,\n\u0012\n\u0012\n\u0013\u0013\n\u0012\n\u0012\n\u0013\u0013\n∂\n∂\n∂\n1 ∂xi\n∂\n1 ∂xi\n−\n= 0,\n∂β ∂α hα ∂α\n∂α ∂β hα ∂α\n\u0012\n\u0012\n\u0013\u0013\n\u0012\n\u0012\n\u0013\u0013\n∂\n∂\n∂\n1 ∂xi\n∂\n1 ∂xi\n−\n= 0,(A36)\n∂β ∂α hβ ∂β\n∂α ∂β hβ ∂β\nwhich leads to our final identity\n\u0012\n\u0013\n\u0012\n\u0013\n∂\n1 ∂hα\n1 ∂hβ\n∂\n+\n= 0.\n∂β hβ ∂β\n∂α hα ∂α\n3.\n\n(A34)\n\n(A35)\n\n\u0001\n\u0001\n∂y 2\n∂x 2\nlent statement of the scale functions h2α = ∂α\n+ ∂α\n\u0001\n\u0001\n∂y 2\n∂x 2\nand h2β = ∂β\n+ ∂β\n. By transforming from orthogonal back to Cartesian coordinates, the differen\u0001\n\u0001\n∂x 2\n∂x 2\n+ h2β ∂β\n= 1 and\ntial line element gives h2α ∂α\n\u0001\n\u0001\n2 ∂y 2\n2 ∂y 2\nhα ∂α + hβ ∂β = 1; from which, we obtain the first\nset of identities:\n∂x\n∂α\n= h2α\n,\n∂α\n∂x\n∂x\n∂β\n= h2β\n,\n∂β\n∂x\n\n(A37)\n\n∂y\n∂α\n= h2α\n∂α\n∂y\n∂y\n∂β\n= h2α .\n∂β\n∂y\n\n(A38)\n\nAPPENDIX B: FILLING THE CRACKS: THE\nDISLOCATION DIPOLE\n\nIdentities in Orthogonal Coordinates\n\nWe include these for completeness. These were necessary for us to study the Airy stress formalism in orthogonal coordinates and we did not find these, presumably\nknown identities, in any reference.\nConsider the general set of orthogonal coordinates,\n{α(x, y), β(x, y)}. The new basis preserves length of the\ndifferential line element, ds2 = dx2 + dy 2 = h2α dα2 +\n\u00012\n\u00012\n∂β\n∂α\nh2β dβ 2 = h2α ∂α\n+ h2β ∂β\n∂x dx + ∂y dy\n∂x dx + ∂y dy , defin\u0001\n\u00012\n∂α 2\ning the scale functions h−2\n+ ∂α\nand h−2\nα = ∂x\nβ =\n∂y\n\u0001\n\u0001\n∂β 2\n∂β 2\n+ ∂y . However, it is often more useful to con∂x\nsider Cartesian coordinates as functions of the new orthogonal ones, {x(α, β), y(α, β)}, which yield an equiva-\n\nE=\n\nY2 b2 d1 d2\n(2π)2\n\nZ\n\n0\n\n2π\n\ndθ\n\nZ\n\nWe devote this Appendix to the technical details of\nthe mathematical manipulation required to compute the\nenergetics of a lattice of dislocation dipoles.\n\n1.\n\nThe Dipole Term\n\nDespite the complex form of the integral in the dislocation dipole interaction energy, when completed it has a\nsurprisingly simple form. The integral becomes tractable\nby transforming to polar coordinates, and then manipulating the trigonometric functions. In polar coordinates,\nthe integral in Eq. (37) becomes,\n\n∞\n0\n\n\u0001\nq dq cos − q R cos(θ) cos2 (θ − θ1 ) cos2 (θ − θ2 )\n\nEmploying Bessel function and trigonometric identities,\nwe find\n\u0013\n\u0012\n1\nY2 b2 d1 d2\n.\ncos(θ1 + θ2 ) sin θ1 sin θ2 +\nE=−\nπ R2\n4\n(B2)\n\n2.\n\n(B1)\n\nWhy We Can Ignore Higher Order Terms\n\nOur goal is to prove that we need only consider the\nfirst order dipole-dipole term when considering collapsed\n\n\f13\nholes. For simplicity sake, we will study an elongated\nshape that is symmetric about both its semi-major and\nsemi-minor axes, (see FIG. 7). Here, we consider only\nshapes for which the ratio of minor and major axes\n2a/d ≪ 1. In the theory of cracks, the height profile\nof a crack h(x) may be constructed from a continuous\ndistribution of finite parallel edge dislocations. A finite\nedge dislocation of length l can be thought of as a two\ninfinite edge dislocations of the same strength but opposite charge which is given by Burgers vectors situated at\nb+ = b δ(x−l/2) and b− = −b δ(x+l/2), in other words,\na dislocation dipole. Given the height profile of a shape,\nit is trivial to construct it from such dislocation dipoles,\nh(x) = d(x). Thus, the interaction energy between such\na shape made from dislocation dipoles and a single dislocation dipole d2 located a distance R0 away is given\nby:\n\nFIG. 7: Set up for dipole expansion of an elongated shape\nsymmetric about both the x- and y-axes, in this case, an\nellipse.\n\nY2 b2 d2\nE=−\nπ\n\na\n\nd(x)\ndx 2\nR\n(x)\n−a\n\nZ\n\n\u0012\n\u0013\n1\ncos (φ(x) + θ2 (x)) sin (φ(x)) sin (θ2 (x)) +\n.\n4\n\n(B3)\n\nBy repeated application of the law of cosines, the functional forms of R(x), φ(x) = π/2 − α(x), and θ2 (x) are:\n\u0010π\n\u0011\nR2 (x) = R02 + x2 − 2 R0 x cos\n(B4)\n+ θ0 = R02 + x2 + 2 R0 x sin θ0\n2\n!\nx + R0 sin θ0\nα(x) = cos−1 p\n(B5)\nR02 + x2 + 2 R0 x sin θ0\nθ2 (x) = θ20 − θ0 − α(x) + π/2.\n\n(B6)\n\nThe energy density is\nd(x)\nY2 b2 d2\nf =−\nπ\nR02 + x2 + 2 R0 x sin θ0\n\n\u0013\n\u0012\n1\n,\n− cos(θ̃ − 2 α(x)) cos(α(x)) cos(θ̃ − α(x)) +\n4\n\n(B7)\n\nwhere θ̃ = θ20 − θ0 . This may be vastly simplified by expanding the angular terms:\ncos(θ̃ − 2 α(x)) =\ncos(θ̃ − α(x)) =\n\ncos θ̃(x + R0 sin θ0 )2 R02 cos2 θ0 + 2 sin θ̃ (x + R0 sin θ0 ) R0 cos θ0\nR02 + x2 + 2 R0 x sin θ0\ncos θ̃ (x + R0 sin θ0 ) + sin θ̃R0 cos θ0\np\n.\nR02 + x2 + 2 R0 x sin θ0\n\n(B8)\n(B9)\n\n\f14\nThe energy density becomes:\nY2 b2 d2\nd(x)\nf = −\n3\nπ\n(R02 + x2 + 2 R0 x sin θ0 )\n= −\n\nR02 + x2 + 2 R0 x sin θ0\n4\n\n\u00012\n\n−\n\n4\nX\n\nn\n\ncn (x + A)\n\nn=1\n\n4\nn\nX\nX\nd(x)\nn!\nY2 b2 d2\nAn−m xm\nc\nn\n3\n2\n2\nπ\n(R0 + x + 2 R0 x sin θ0 ) n=0 m=0 m!(n − m)!\n\n!\n(B10)\n\nwhere A = R0 sin θ0 and B = R0 cos θ0 , and the coefficients cn are given by c0 = B 4 /4, c1 = B 3 cos θ̃ sin θ̃, c2 =\nB 2 (cos2 θ̃ − 2 sin2 θ̃) + B 2 /2, c3 = −3 B cos θ̃ sin θ̃, and c4 = − cos2 θ̃ + 1/4. While the above energy is for general\nshape of dislocations, we choose a shape to do thepactual calculation. For simplicity sake, we choose an ellipse of\nmajor axis d0 and minor axis 2a. Thus, d(x) = d0 1 − x2 /a2 . With the change of variables, y = x/a, our energy\nintegral becomes:\np\nZ\n4\nn\nX\nX\nn!\nY2 b2 d2 1\nd0 a 1 − y 2\nAn−m (a y)m .\n(B11)\nE=−\nc\ndy\n\u0010\n\u0011\nn\n3\nπ R06\nm!(n\n−\nm)!\na\na\n−1\n2\n1 + ( R0 y) + 2 R0 y sin θ0 n=0 m=0\n\u0010\n\u0011−3\na\na\na\n2\n≪\n1,\nwe\nfind,\n1\n+\n(\ny)\n+\n2\ny\nsin\nθ\n≈\nExpanding\nthe\ndenominator\nfor\n0\nR0\nR0\nR0\n\u0010\n\u0011\np\n\u0001\nR\n2\n1\n1 − 6 Ra0 sin θ0 y + 3 Ra0 (8 sin2 θ0 − 1)y 2 + * * * . Now we need only do the integral −1 dy 1 − y 2 y n =\np\nR1p\n2(1 − (−1)n ) 0 1 − y 2 y N , for, since\n1 − y 2 is even, this integral is zero for odd integer n This is very\nsimple using beta functions, which we may see by the change of variables t = y ′2 :\nZ 1\nZ 1\nZ 1\np\ndt √\n√ 1 − t tn/2 =\ndy ′ 1 − y ′2 y ′N =\n2\ndt t(n+1)/2−1 (1 − t)3/2−1\nt\n0\n0\n0\n\u0010 1 + n 3 \u0011 Γ 1+n \u0001 Γ 3 \u0001\nπ(1 + (−1)n ) (n − 1)!!\n2\n\u00012 =\n(B12)\n=\n,\n≡ B\nn\nn\n2\n2\n( n2 + 1)!\n2 2 +1\nΓ 2+ 2\nThe interaction energy is thus:\n\n\u0012\n\u0012\n4\nn\n(m − 1)!!\nY2 b2 d2 d0 a X X\nn!\nπ\nm\nn−m m\n(1\n+\n(−1)\n)\n2 m\nc\nA\na\nn\nm/2+2\nπ R06\nm!(n\n−\nm)!\n( 2 + 1)!\n2\nn=0 m=0\n\u0013\n\u0013\n√\n\u0001 (m + 1)!!\na\na2\nm!!\n−6\nsin θ0 2(1 − (−1)m ) m+1\n.\n+ 3 2 8 sin2 θ0 − 1 m\nR0\n( 2 + 2)!\nR0\n( 2 + 1)!\n\nE = −\n\n(B13)\n\nWhile this appears to be a complicated expression, let us, for the moment consider only the first order term in a:\n\u0012\n4\nY2 b2 d2 d0 a B 4\nY2 b2 d2 d0 a X\nn\nc\nA\n=\n−\n+ A B 3 cos θ̃ sin θ̃\nE0 = −\nn\n6\n4 R06\n4\nR\n4\n0\nn=0\n\u0012\n\u0012\n\u0013\n\u0013\u0013\n1\n1\n2\n2\n2 2\n3\n4\n2\n+ A B cos θ̃ − 2 sin θ̃ +\n− 3 A B cos θ̃ sin θ̃ + A\n− cos θ̃\n2\n4\n\u0012\n\u0001\nY2 b2 d2 d0 a cos4 θ0\n+ cos3 θ0 sin θ0 − 3 sin3 θ0 cos θ0 cos θ̃ sin θ̃\n= −\n2\n4 R0\n4\n\u0012\n\u0012\n\u0013\n\u0013\u0013\n1\n1\n2\n2\n2\n2\n4\n2\n+ cos θ0 sin θ0 cos θ̃ − 2 sin θ̃ +\n+ sin θ0\n− cos θ̃\n.\n(B14)\n2\n4\nThis does not appear to have the same functional form as the original energy. However, with the help of some\ntrigonometric identities, we begin to simplify the energy:\n\u0010\n\u0011 1\ncos4 θ0 + sin4 θ0 1 − 4 cos2 θ̃ = sin2 2θ0 cos 2θ̃ + 1 − 4 sin2 θ0 cos2 θ̃\n(B15)\n2\n\u0001\n1\n(B16)\ncos3 θ0 sin θ0 − 3 sin3 θ0 cos θ0 cos θ̃ sin θ̃ = (2 cos 2θ0 − 1) sin 2θ0 sin 2θ̃\n4\n\u0011\n\u0010\n3\n1\ncos2 θ0 sin2 θ0 = cos 2θ̃ sin2 2θ0 .\ncos2 θ̃ − 2 sin2 θ̃ +\n(B17)\n2\n8\n\n\f15\nWe now use these identities in the energy to find:\n\u0013\n\u0012\n1\n1\n3\nY2 b2 d2 d0 a 1\n2\n2\n2\n2\nsin 2θ0 cos 2θ̃ + − sin θ0 cos θ̃ + (2 cos 2θ0 − 1) sin 2θ0 sin 2θ̃ + cos 2θ̃ sin 2θ0\nE0 = −\n4 R02\n8\n4\n4\n8\n\u0013\n\u0012\n\u0010\n\u0011\n1\nY2 b2 d2 d0 a 1\n1\n2\n2\nθ̃\n−\nsin\n2θ\ncos\n2\nθ̃\n+\ncos\n2θ\nsin\n2\nθ̃\n−\nsin\ncos\n.\n(B18)\n= −\nθ\nsin\n2θ\nsin\n2θ\nsin\n2\nθ̃\n+\n0\n0\n0\n0\n0\n4 R02\n2\n4\n4\nNow we substitute θ̃ = θ20 − θ0 to find,\n\u0013\n\u0012\n1\nY2 b2 d2 d0 a 1\n2\n2\nsin 2θ0 sin 2θ20 − sin θ0 cos θ̃ − sin θ0 cos θ0 sin θ̃ cos θ̃ +\nE0 = −\n4 R02\n2\n4\n\u0013\n\u0012\n2\nY2 b d2 d0 a\n1\n= −\n.\ncos(θ0 + θ20 ) sin θ0 sin θ20 +\n4 R02\n4\n\n(B19)\n\nSo we have found that to first order in a/R0 an ellipse of\nmajor axis d and minor axis 2a interacts with a dislocation dipole of strength d2 a distance R0 away like a dislocation dipole with effective dipole strength d ̃ = π d0 a/4.\n\nHigher order terms contain more powers of a/R0 , which\ncan be neglected for very thin shapes or for dipoles that\nare very far away.\n\n[1] E. Katifori et al. (private communication).\n[2] R.E. Reichlet and R.H. Bradbury, Mar. Ecol. Prog. Ser.,\n17, 251 (1984). A.L. Cohen and T.A. McConnaughey,\nRev. Mineral Geochem., 54, 151 (2003).\n[3] R. Penrose, Ann. Hum. Genet., 42, 435 (1979).\n[4] Y. Zhang et al., Nano Lett., 8, 1192 (2008).\n[5] X. Zhu et al., Appl. Phys. Lett., 93, 161911 (2008).\n[6] T. Mullin et al., Phys. Rev. Lett. 99, 084301 (2007). K.\nBertoldi et al., J. Mech. Phys. Solids, 56, 2642 (2008).\n[7] A. E. H. Love, A Treatise on the Mathematical Theory\nof Elasticity, 2nd Edition, (Cambridge University Press,\nCambridge, 1906).\n[8] L.D. Landau and E.M. Lifshitz, Theory of Elasticity, 3rd\nEdition, (Translated by J.B. Sykes and W.H. Reid), (Elsevier, New York, 1986).\n[9] A.E. Green and W. Zerna, Theoretical Elasticity,\n(Clarendon Press, Oxford, 1954).\n[10] J.H. Heinbockel, Introduction to Tensor Calculus and\nContinuum Mechanics, (Trafford, Victoria, B.C., 2001).\n[11] We use the convention xi to represent the ith component\nof a Cartesian coordinate system, where the subscript can\nbe any Roman letter. Components of another orthogonal\n\ncoordinate system are denoted by ξμ , for any Greek subscript.\nE.A. Abbott, Flatland: a romance of many dimensions,\n(Barnes & Noble Books, New York, 1963).\nR. von Mises, \"The critical external pressure of cylindrical tubes under uniform radial and axial load\", in U.S.\nExperimental Model Basin, Report 366, Trans. 6, (Navy\nTar, Washington, D.C. 1933).\nG.B. Jeffery, Phil. Trans. Roy. Soc. London Ser. A., 221,\n265 (1920).\nR.C.J. Howland, Proc. Roy. Soc. A., 148, 471 (1935).\nR.C.J. Howland and R.C. Knight, Phil. Trans. Roy. Soc.\nLondon Ser. A., 238, 357 (1939).\nA.E. Green, Proc. Roy. Soc. A., 176, 121 (1940).\nA.C. Stevenson, Proc. Roy. Soc. A., 184, 218 (1945).\nChih-Bing Ling, J. App. Phys., 19, 77 (1948).\nJ.P. Hirth and J. Lothe, Theory of Dislocations, Second\nEdition, (John Wiley & Sons, New York, 1982).\nP.M. Chaikin and T.C. Lubensky, Principles of Condensed Matter Physics, (Cambridge University Press,\nCambridge, 1995).\n\n[12]\n[13]\n\n[14]\n[15]\n[16]\n[17]\n[18]\n[19]\n[20]\n[21]\n\n\f"}