{"id": "http://arxiv.org/abs/1005.3669v1", "guidislink": true, "updated": "2010-05-20T11:48:59Z", "updated_parsed": [2010, 5, 20, 11, 48, 59, 3, 140, 0], "published": "2010-05-20T11:48:59Z", "published_parsed": [2010, 5, 20, 11, 48, 59, 3, 140, 0], "title": "Stabilization of antiferromagnetism in CeFe2 alloys: Effects of chemical\n  and hydrostatic pressure", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1005.0077%2C1005.0579%2C1005.5635%2C1005.2700%2C1005.3931%2C1005.2819%2C1005.2959%2C1005.4796%2C1005.4729%2C1005.4509%2C1005.0283%2C1005.1428%2C1005.2971%2C1005.2680%2C1005.1819%2C1005.3669%2C1005.4084%2C1005.3461%2C1005.0263%2C1005.0158%2C1005.3281%2C1005.1421%2C1005.4852%2C1005.1849%2C1005.3596%2C1005.4100%2C1005.5319%2C1005.5216%2C1005.3246%2C1005.1277%2C1005.2993%2C1005.4058%2C1005.3707%2C1005.1978%2C1005.4083%2C1005.2751%2C1005.0641%2C1005.3156%2C1005.5099%2C1005.0429%2C1005.3880%2C1005.4412%2C1005.4045%2C1005.1892%2C1005.3305%2C1005.3604%2C1005.4326%2C1005.3023%2C1005.0215%2C1005.1418%2C1005.0751%2C1005.0209%2C1005.3646%2C1005.5115%2C1005.2455%2C1005.5466%2C1005.5202%2C1005.1551%2C1005.1884%2C1005.5293%2C1005.0306%2C1005.3663%2C1005.0879%2C1005.3888%2C1005.3766%2C1005.1530%2C1005.1807%2C1005.2879%2C1005.0245%2C1005.2328%2C1005.0725%2C1005.5591%2C1005.3036%2C1005.5610%2C1005.4541%2C1005.0610%2C1005.0704%2C1005.5279%2C1005.1586%2C1005.2646%2C1005.4844%2C1005.2386%2C1005.2299%2C1005.3718%2C1005.3215%2C1005.5133%2C1005.5493%2C1005.4135%2C1005.2416%2C1005.0423%2C1005.5659%2C1005.0956%2C1005.3260%2C1005.1630%2C1005.5262%2C1005.3235%2C1005.5121%2C1005.1947%2C1005.1340%2C1005.1264%2C1005.3982&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Stabilization of antiferromagnetism in CeFe2 alloys: Effects of chemical\n  and hydrostatic pressure"}, "summary": "Effects of Al, Mn and Sb dopings in CeFe2 and effect of applied pressure have\nbeen investigated. Al doping gives rise to the FM-AFM transition and a\nreduction in the magnetic moment and TC values, clearly indicating the growth\nof the AFM component. Mn and Sb dopings only cause a reduction in TC value. It\nis found that in general external pressure enhances the antiferromagnetism in\nboth the pure and the doped alloys. Enhancement of the Ce 4f- Fe 3d\nhybridization as a result of dopings and with the external pressure may be the\nreason for the stabilization of antiferromagnetism in these alloys.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1005.0077%2C1005.0579%2C1005.5635%2C1005.2700%2C1005.3931%2C1005.2819%2C1005.2959%2C1005.4796%2C1005.4729%2C1005.4509%2C1005.0283%2C1005.1428%2C1005.2971%2C1005.2680%2C1005.1819%2C1005.3669%2C1005.4084%2C1005.3461%2C1005.0263%2C1005.0158%2C1005.3281%2C1005.1421%2C1005.4852%2C1005.1849%2C1005.3596%2C1005.4100%2C1005.5319%2C1005.5216%2C1005.3246%2C1005.1277%2C1005.2993%2C1005.4058%2C1005.3707%2C1005.1978%2C1005.4083%2C1005.2751%2C1005.0641%2C1005.3156%2C1005.5099%2C1005.0429%2C1005.3880%2C1005.4412%2C1005.4045%2C1005.1892%2C1005.3305%2C1005.3604%2C1005.4326%2C1005.3023%2C1005.0215%2C1005.1418%2C1005.0751%2C1005.0209%2C1005.3646%2C1005.5115%2C1005.2455%2C1005.5466%2C1005.5202%2C1005.1551%2C1005.1884%2C1005.5293%2C1005.0306%2C1005.3663%2C1005.0879%2C1005.3888%2C1005.3766%2C1005.1530%2C1005.1807%2C1005.2879%2C1005.0245%2C1005.2328%2C1005.0725%2C1005.5591%2C1005.3036%2C1005.5610%2C1005.4541%2C1005.0610%2C1005.0704%2C1005.5279%2C1005.1586%2C1005.2646%2C1005.4844%2C1005.2386%2C1005.2299%2C1005.3718%2C1005.3215%2C1005.5133%2C1005.5493%2C1005.4135%2C1005.2416%2C1005.0423%2C1005.5659%2C1005.0956%2C1005.3260%2C1005.1630%2C1005.5262%2C1005.3235%2C1005.5121%2C1005.1947%2C1005.1340%2C1005.1264%2C1005.3982&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Effects of Al, Mn and Sb dopings in CeFe2 and effect of applied pressure have\nbeen investigated. Al doping gives rise to the FM-AFM transition and a\nreduction in the magnetic moment and TC values, clearly indicating the growth\nof the AFM component. Mn and Sb dopings only cause a reduction in TC value. It\nis found that in general external pressure enhances the antiferromagnetism in\nboth the pure and the doped alloys. Enhancement of the Ce 4f- Fe 3d\nhybridization as a result of dopings and with the external pressure may be the\nreason for the stabilization of antiferromagnetism in these alloys."}, "authors": ["Arabinda Haldar", "K. G. Suresh", "A. K. Nigam", "A. A. Coelho", "S. Gama"], "author_detail": {"name": "S. Gama"}, "author": "S. Gama", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1088/0953-8984/21/49/496003", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1005.3669v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1005.3669v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "14 pages, 7 figures", "arxiv_primary_category": {"term": "cond-mat.str-el", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cond-mat.str-el", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1005.3669v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1005.3669v1", "journal_reference": "J. Phys.: Condens. Matter 21, 496003 (2009)", "doi": "10.1088/0953-8984/21/49/496003", "fulltext": "Stabilization of antiferromagnetism in CeFe2 alloys: Effects\nof chemical and hydrostatic pressure\nArabinda Haldar1, K. G. Suresh1,*, A. K. Nigam2, A. A. Coelho3 and S. Gama3\n1\nDepartment of Physics, Indian Institute of Technology Bombay, Mumbai –\n400076, India\n2\nTata Institute of Fundamental Research, Homi Bhabha Road, Mumbai 400005,\nIndia\n3\nInstituto de Fisica 'Gleb Wataghin,' Universidade Estadual de CampinasUnicamp, CP 6165, Campinas 13 083 970, SP, Brazil\nE-mail: suresh@phy.iitb.ac.in\nAbstract. Effects of Al, Mn and Sb dopings in CeFe2 and effect of applied pressure have\nbeen investigated. Al doping gives rise to the FM-AFM transition and a reduction in the\nmagnetic moment and TC values, clearly indicating the growth of the AFM component.\nMn and Sb dopings only cause a reduction in TC value. It is found that in general external\npressure enhances the antiferromagnetism in both the pure and the doped alloys.\nEnhancement of the Ce 4f- Fe 3d hybridization as a result of dopings and with the\nexternal pressure may be the reason for the stabilization of antiferromagnetism in these\nalloys.\n\nKeywords: antiferromagnetism, hydrostatic pressure, chemical pressure\n\n*\n\nAuthor to whom any correspondence should be addressed.\n\n\f1. Introduction\nMagnetism of pure and doped CeFe2 has attracted considerable interest from the researchers for\nmany decades [1]-[3]. The strong hybridization between Ce 4f and Fe 3d electronic states makes\nCeFe2 very special among the series of RFe2(R= Rare earth) compounds. Although Ce is a light\nrare earth, 4f electrons hybridize antiferromagnetically with the 3d electrons. This is due to the\nquenching of orbital 4f moment by band formation [1]. Lattice parameter, Curie temperature and\nthe magnetic moment show a strong deviation from the normal trend observed in the RFe2 series\n[1, 4]. As shown previously, the ground state of CeFe2 at ambient pressure can be viewed as a\ncanted ferromagnet (FM), i.e., a small antiferromagnetic (AFM) component (<0.1μB)\nsuperimposed on a dominant ferromagnetic component [5].\nIt was predicted that with the application of pressure, the magnetic moments of Fe and Ce would\ndecrease rapidly. Theoretical calculations have shown that with a compression of the unit cell by\nabout 6-7%, the compound loses most of its magnetic property, thereby becoming paramagnetic\n[6]. It was experimentally found that at 220 kbar and at low temperatures CeFe2 loses its\nmagnetism [7]. Nevertheless, it is clear that this critical pressure is considerably lower than that\nestimated for YFe2 (1050 kbar [8]). Further comparison with YFe2 shows that, at low pressures,\nthe Curie temperature increases with pressure for YFe2 [9], whereas it decreases in CeFe2 despite\na continuous decrease of the iron moment in both the compounds. This again indicates that CeFe2\noccupies a special position amongst the RFe2 compounds [7].\nEnhancement of antiferromagnetic spin correlations has been shown in CeFe2 single crystals at\npressures up to 8 kbar [10]. A recent pressure study on CeFe2 single crystals shows that the\ntransition to the AFM state at low temperatures occurs at pressures less than 20 kbar [11]. They\nhave also found that the temperature at which it undergoes the antiferromagnetic transition (at the\nNeel temperature,,TN) increases monotonically with pressure. Neutron diffraction studies indicate\nthat the static Fe magnetic moment is suppressed to be only half of that under P=1 bar at 5K and\nthat the antiferromagnetic spin fluctuation with a propagation vector q= (1 2 ,1 2 ,1 2 ) is\nenhanced by applying hydrostatic pressure of 15 kbar [12].\nOn the other hand, it is also well known that, at ambient pressure too, the stabilization of the\nantiferromagnetic component in CeFe2 can be achieved with the help of substitution of small\namounts (3-6%) of selected elements such as Co, Al, Ga, Ru, Ir, Os and Re [2, 3, 13]. The first\n\n2\n\n\forder nature of the FM-AFM transition (on cooling) gives rise to distinct features of\nsupercooling/superheating and kinetic arrest behavior [14]. It is worth noting that, among these\nsubstitutions, while Al causes an increase in the lattice parameter, Co results in lattice\ncontraction. However, surprisingly in both these cases, the AFM spin correlations get enhanced,\ngiving rise to the stable low temperature AFM state. Therefore, it is clear that the chemical\npressure (positive or negative) alone is not responsible for the stabilization of the AFM state.\nEffect of external pressure has been reported on a few substituted CeFe2 compounds as well [15,\n16].\nThe moments on the trivalent Ce ion and Fe in the ReFe2 series are 2.54 μ B and 1.77 μ B ,\nrespectively [17]. From the polarized neutron study of CeFe2, Ce and Fe moments are found to be\n-0.14 μ B / atom and 1.17 μ B / atom , respectively [18]. Due to hybridization of Ce 4f and Fe 3d\nelectronic states, Ce remains in mixed valance state (+3.29) rather than its normal trivalent state\nin CeFe2 and this must be the reason for the anomalous magnetic moments of Ce as well as Fe in\nCeFe2. Therefore, it is of interest to investigate the effect of pressure created by chemical\nsubstitution (chemical pressure) and by external means (hydrostatic pressure) on the magnetic\nproperties. With the view of comparing the pressure effects in different doped CeFe2 compounds\nwhich undergo lattice expansion and contraction as a result of substitutions, we report the\npressure studies on Al, Mn and Sb doped CeFe2 . The compounds studied in this work are CeFe2,\nCe(Fe1-xAlx)2 [x = 0.01, 0.025 & 0.05], Ce(Fe0.95Mn0.05)2, Ce(Fe0.95Sb0.05)2. While Al and Mn\ndoping are known to cause lattice expansion, Sb causes lattice contraction.\n\n2. Experimental Details\nPolycrystalline CeFe2, Ce(Fe0.95Mn0.05)2, Ce(Fe0.95Sb0.05)2 and Ce(Fe1-xAlx)2 [x = 0.01, 0.025 and\n0.05] compounds have been prepared by arc melting the stoichiometric proportion of the\nconstituent elements of at least 99.9% purity in water cooled copper hearth in argon atmosphere.\nThe resulting ingots were turned upside down and remelted several times to ensure homogeneity.\nThe as-cast samples were annealed for 10 days in the sequence: 600 oC for 2 days, 700 oC for 5\ndays, 800 oC for 2 days and 850 oC for a day [2]. The structural characterization of these annealed\ncompounds was done by room temperature powder x-ray diffraction (XRD) using Cu-Kα\nradiation. XRD data was refined by Rietveld refinement method using Fullprof suite program.\nStructural parameters have been calculated from this refinement. Magnetization measurements\nhave been performed in a Vibrating Sample Magnetometer attached to a Physical Property\n\n3\n\n\fMeasurement System (PPMS, Quantum Design Model 6500) and/or a SQUID magnetometer.\nThe magnetization measurements under applied pressures have been carried out using a Cu-Be\nclamp type cell attached to the SQUID magnetometer. The maximum pressure that can be\nobtained in the cell was 10kbar. Magnetization has been measured in zero field cooled (ZFC),\nfield cooled cooling (FCC) and field cooled warming (FCW) modes. The sample was in the form\nof a small piece weighing a few tens of milligrams and of irregular shape.\n3. Results and Discussions\n\nCe(Fe1-xAlx)2 [x = 0, 0.01, 0.025 & 0.05]\nRoom temperature x-ray diffraction patterns along with the Rietveld refinement plots confirm the\nphase purity of all the compounds. All of them possess the cubic structure with space group:\n\nFd 3 m . The lattice parameters are found to increase as Al concentration increases from 0 to\n0.05.\n\n4\n\n\fFigure 1. (a) Temperature dependence of the magnetization of Ce(Fe1-xAlx)2\ncompounds for x= 0, 0.01, 0.025, 0.05. (b) Temperature dependence of ZFC and\nFCW magnetization of Ce(Fe0.99Al0.01)2 in different applied fields. Open and\nclosed symbols refer to FCW and ZFC modes of data respectively.\n\nFigure 1(a) shows the temperature variation of magnetization data at a low field of H=500 Oe for\npure and Al doped samples at ambient pressure. While parent compound, CeFe2 shows a normal\nferromagnetic behavior with a Curie temperature (TC) of 230K [19], Al doped compounds show\nthe stabilized AFM state at low temperatures, in agreement with earlier reports [2, 20]. There is a\nsignificant reduction in TC with substitution of Al along with an increase in the FM-AFM\ntransition temperature, TN. Both these observations point towards the fact that the AFM strength\nincreases with Al. In figure 1(b), magnetization data is shown for x=0.01 in different fields. The\neffect of external field is to reduce the AFM coupling and favor a FM behavior in the material.\nWith increase in field, the TC values increase and the TN values decrease. The difference between\nZFC and FCW data increases with increase in field, which is consistent with our recent results on\nGa substituted CeFe2 [19]. It is clear from figure 1(b) that the AFM phase is very strong at\n0.5kOe, but the strength decreases as the field is increased to higher values. This gives rise to the\nbifurcation between the ZFC and the FCW data at 20 kOe and 50 kOe.\n\n5\n\n\fFigure 2. Temperature variation of magnetization in ZFC and FCC modes under\nvarious applied pressures for the compounds (a) x=0.01, (b) x=0.025, and (c)\nx=0.05. In each plot filled symbols refer to ZFC and solid lines refer to FCC data.\nThe insets in (a) and (b) are the M-T curves at two different fields at the highest\npressure.\n\n6\n\n\fFigure 2(a)-(c) shows the temperature dependence of magnetization at different pressures for\nCe(Fe1-xAlx)2 compounds with x=0.01, 0.025 and 0.05. In all the three compounds, with increase\nin pressure the TC decreases and the TN increases, which suggests that the effect of external\npressure is to stabilize the AFM phase. The magnetization values also decrease with pressure.\nThese observations are due to the pressure induced enhancement of antiferromagnetic\ncorrelations in the system. With pressure the widening of Ce f level occurs which in turn\nenhances hybridization between Ce 4f and Fe 3d electronic states. As a result, the Fe–Fe\nexchange interaction responsible for the Curie temperature, gets weaker and the outcome is a\ndecrease of TC and an increase of TN. Another important observation from figure 2 is that the\ndifference between ZFC and FCC data increases with the increase in pressure. This can be\nunderstood in the following way. The FM-AFM transition in these compounds is known to be\naccompanied by a structural transition (at TN) from cubic to rhombohedral structure [2]. Because\nof this magnetostructural coupling, increase of pressure prefers the rhombohedral phase.\nTherefore, the magnetization variation during cooling (FCC) and heating (ZFC) is expected to be\ndifferent. This is because the energy barrier that the system encounters during heating and cooling\nwill be different. This explains the considerable ZFC-FCC difference at higher pressures,\ncompared to that at the ambient pressure.\n\n7\n\n\fFigure 3. (a) M-H isotherms at T=2.8 K at ambient pressure for Ce(Fe0.99Al0.01)2.\nArrows indicate the direction of field in which data have been taken. (b) M-H\nloops at T=8 K for x=0.01 and 0.05\nFigure 3(a) shows the five loop M(H) isotherm at T=2.8 K under ambient pressure (P=0 kbar) for\nx=0.01 compound. This measurement has been made with a field sweep rate of 100 Oe per\nsecond. The sample was zero-field cooled from room temperature (paramagnetic region) to the\nmeasurement temperature. With increasing field, the moment shows a rapid initial increase, then\nbecomes flat and shows a smooth jump at a critical field Hc ~ 28kOe. The moment does not get\nsaturated even in a field of 70kOe. Between increasing and decreasing cycles, a large hysteresis is\nobserved, but with zero coercivity. This observation confirms the first order nature of the\nmagnetic field induced AFM to FM transition. Another observation to be noticed here is that the\nvirgin curve remains outside of the envelope curve which was also observed earlier for x=0.04\n[20]. Super cooling and kinetic arrest associated with the first order transition are responsible for\nthis behavior [20]. With increase in the concentration of Al, the antiferromagnetic correlation\nincreases, as reflected by the increase in the ciritical field values shown in figure 3(b). Although\nAl substitution causes increase in the lattice parameter, it shows the effect similar to that with\napplied hydrostatic pressure. It may be due to modification in density of sates (DOS) around\nFermi level with Al substitution. Another point to be noted in is that at 8K the 5th loop follows the\nsame path as the 1st loop, which is not the case at T=2.8K (see figure 3(a)). This indicates that\nthermal fluctuations reduce the effects associated with the kinetic arrest of the FM phase.\n\n8\n\n\fFigure 4. M vs. H loop at T=8 K under various pressures for (a) x=0.01 and (b)\nx=0.05 compounds.\nIn figure 4(a)-(b), the nine-loop magnetization isotherms are shown for x=0.01 and 0.05 at 8 K\nand at various pressures. For this measurement also, the sample was zero field cooled from the\nparamagnetic region to 8 K and then the data was taken in increasing and decreasing modes for\nboth positive and negative fields. For a given pressure, there is no difference between the data in\nthe first and second cycles of magnetic field variation. The M-H behavior is almost identical to\nthat seen in figure 3(b). Here also, the moment does not get saturated at a field of 70kOe. With\npressure the critical field (Hc) increases and the moment reduces considerably. Effect of pressure\nseems to reinforce the 3d-4f hybridization present in Al doped CeFe2 compounds which in turn\nreinforces the AFM correlations in the material. This gives rise to an increase in HC as shown in\n\n9\n\n\ffigure 5. Comparison of 8 K and 50 K data in figure 5 implies that thermal fluctuation converts\nthe system towards more parallel alignment of moments, reducing the HC values. The decrease in\nmoment seen in figure 4 can also be attributed to the enhanced hybridization with pressure.\n\nFigure 5. Pressure dependence of critical field in Ce(Fe0.99Al0.01)2 at different\ntemperatures.\nIt can be noticed that the AFM-FM transition in Al doped compounds is rather smooth, unlike the\ncase in Ru, Re and Ga doped compounds [19, 21]. Furthermore, the region of existence of\nferromagnetism is very narrow (see figures 1 & 2) in the Al-doped case as compared to other\nsubstitutions. Similarly, the M-H isotherms at temperatures below TN in the case of Ru, Re and\nGa doped compounds are generally accompanied by multiple sharp jumps. Such jumps are absent\nin the case of Al doped compounds. Kennedy et al. have shown that there is a broad overlap\nbetween two magnetic phases (AFM and FM) in the case of Al doping compared to the narrow\noverlap seen with other dopants [3], which may be the reason for the smooth transition in the\nformer. The application of magnetic field at low temperatures favors the FM phase, and as the\nfield is increased, the volume ratio of the FM phase to the AFM phase evolves gradually in this\ncase, due to a broad overlap region between these phases. So instead of getting sharp jumps in the\nmagnetization isotherms, a smooth behavior is found across the field induced AFM-FM\ntransition.\n\n10\n\n\fMn and Sb doped CeFe2 compounds\nAt the ambient pressure, Mn doped CeFe2 compounds are known to be ferromagnets [22, 23].\nLikewise, we find that Sb substitution also does not stabilize the AFM fluctuations. Even a\npressure of about 9 kbar is not able to stabilize the AFM phase at low temperatures in both these\ncompounds. However, there is a monotonic reduction in the ferro-para transition temperature,\n(TC) in both the cases, as shown in figure 6, which also shows the variation in pure CeFe2. As\nobserved in the earlier section, pressure has a considerable effect on the hybridization between\nthe Ce 4f and Fe 3d electronic states. It is clear from figure 6 that the pressure dependence of TC\nis maximum in CeFe2, whereas it is lower in both Mn and Sb doped compounds. In fact, the\npressure dependence seen in these two cases is found to be nearly equal to that of Al doped\ncompounds. Therefore, it is clear that the effect of applied pressure is maximum in CeFe2, as\nthere is no chemical pressure in the undoped case. Like in Al doped compounds, the pressure\nseems to enhance the 3d-4f hybridization in Mn and Sb substituted compounds to such an extent\nthat there is a reduction in TC. However, this hybridization is not enough to result in a strong\nAFM state as seen in the Al doping.\n\nFigure 6. Variation of Cuire temperature (TC) with external pressures for\nundoped, Mn and Sb doped CeFe2 compounds.\n\n11\n\n\fFigure 7. Isothermal magnetization loops at T=8K for Ce(Fe0.05Sb0.05)2. The inset\nshows the first quadrant of the M-H loop at the ambient pressure and at 2.7 kbar.\nAt ambient pressure, the saturation moments are 2.6 and 2.7 μ B / f .u. for CeFe2 and\nCe(Fe0.95Mn0.05)2 respectively at 8 K. With the application of pressure no significant change is\nobserved in these values. On the other hand, at ambient pressure, in Ce(Fe0.95Sb0.05)2, the moment\nis 3.3 μ B / f .u. which reduces to 2.6 μ B / f .u. at the highest pressure. Another interesting\nobservation in the case of Ce(Fe0.95Sb0.05)2 is the metamagnetic transition found at P= 2.7 kbar\n(see inset of figure 7). At higher pressures, a similar transition seems to appear at fields above 75\nkOe. The presence of metamagnetic transition indicates that the system possesses a AFM state, at\nleast in very small fraction, at low temperatures, though the M vs. T curve does not show any\nclear evidence of this fact. However, this tendency is in agreement with the reduction in TC seen\nin figure 6.\nTherefore, it is clear that there is an enhancement in the AFM component in the case of Mn and\nSb dopings in CeFe2, though a transition to the AFM state is not observed. This may be due to the\nfact that the 4f-3d overlap increases only nominally in the case of Mn and Sb dopings or these\nsubstitutions may be unable to change the DOS near Fermi level in such a way to stabilize AFM\nstate in these materials.\n\n12\n\n\f4. Conclusions\nWe have shown the pressure effect on the magnetization of the undoped and doped CeFe2\ncompounds. It is found that in general external hydrostatic pressure enhances the AFM\ncomponent in doped CeFe2. The increase in the TN values and the decrease in the magnetic\nmoment and TC values clearly show the growth of the AFM component. The results have been\ndiscussed on the basis of the mixed valent behavior of Ce ion as well as the change in the\nhybridization between the Ce 4f and Fe 3d electronic states. External pressure seems to enhance\nthe hybridization present in these materials. Results obtained on different dopings indicate that it\nis not the ionic radii, but the extent of hybridization and modification in the mixed valency that\nare responsible for the stabilization of the antiferromagnetic phase. Detailed band structure\ncalculations on all these dopings and experimental data using techniques like photoelectron\nspectroscopy are essential to unravel the underlying physics of the anomalies observed in\ndifferent dopings. The effect of external pressure observed here opens up the opportunity to\ntheoretically model these materials.\n\nAcknowledgement\nKGS and AKN thank BRNS for the financial support for carrying out this work.\n\nReferences\n[1] Eriksson O, Nordstrom L, Brooks M S S, Johansson B 1988 Phys. Rev. Lett. 60 2523\n[2] Roy S B and Coles B R 1989 J. Phys.: Condens. Matter 1 419\n[3] Kennedy S J and Coles B R 1990 J. Phys.: Condens. Matter 2 1213\n[4] Giorgetti C, Pizzini S, Dartyge E, Fontaine A, Baudelet F, Brouder C, Bauer P, Krill G,\nMiraglia S, Fruchart D and Kappler J P 1993 Phys. Rev. B 48 12732\n[5] Paolasini L, Dervenagas L P, Vulliet P, Sanchez J P, Lander G H, Hiess A, Panchula A and\nCanfield P 1998 Phys. Rev. B 58 12117\n[6] Khowash P K 1990 Physica B 163 197-200\n[7] Sanchez J P, Vulliet P, and Abd Elmeguid M M 2001 Hyperfine Interact. 133 5\n[8] Lubbers R, Pleines M, Hesse H J, Wortmann G, Gr ̈unsteudel H F, Ruffer R, Leupold O and\nZukrowski J 1999 Hyperfine Interactions 120/121 49–58\n\n13\n\n\f[9] Brouha M and Buschow K H J 1973 J. Appl. Phys. 44 1813\n[10] Fukuda H, Fujii H, Kamura H, Uchida A, Kosoka M, Uwatoko Y 2001 Journal of Mag.\nMag. Mat. 226-230 1200-1202\n[11] Braithwaite D, Lapertot G, Salce B, Cumberlidge A M and Alireza P L 2007 Phys. Rev. B 76\n224427\n[12] Fujiwara T, Fujii H, Ishii Y, Koiwai S, Kosaka M, Uwatoko Y, Nishi M, and Kakurai K,\n2002 Physica B 312-313 336\n[13] Roy S B and Coles B R 1989 Phys. Rev. B 39 9360\n[14] Roy S B, Perkins G K, Chattopadhyay M K, Nigam A K, Sokhey K J S, Chaddah P, Caplin\nA D, and Cohen L F 2004 Phys. Rev. Lett. 92 147203\n[15] Braithwaite D, Paolasini L, Deen P P, Kernavanois N, Yakhou F, Canfield P, Lapertot G\n2006 Physica B 378–380 782–783\n[16] K. Koyama, K. Fukushima, M. Yamada, T. Goto, Y. Makihara, H. Fujii, and K. Watanabe,\nPhysica B 346-347, 187 (2004).\n[17] Tang C C, Li Y X, Du J, Wu G H and Zhan W S 1999 J. Phys.: Condens. Matter 11 2027.\n[18] Kennedy S J, Brown P J and Coles B R 1993 J. Phys.: Condens. Matter 5 5169\n[19] Haldar A, Suresh K G and Nigam A K 2008 Phys. Rev. B 78 144429\n[20] Manekar M A, Chaudhary S, Chattopadhyay M K, Singh K J, Roy S B and Chaddah P 2001\nPhys. Rev. B 64 104416\n[21] Roy S B, Chattopadhyay M K, and Chaddah P 2005 Phys. Rev. B 71 174413\n[22] Paolasini L, Dervenagas P, Vulliet P, Sanchez J P, Lander G H, Hiess A, Panchula A and\nCanfield P 1998 Phys. Rev. B 58 12117\n[23] Khowash P K 1991 Phys. Rev. B 43 6170\n\n14\n\n\f"}