{"id": "http://arxiv.org/abs/1111.0175v1", "guidislink": true, "updated": "2011-11-01T11:40:16Z", "updated_parsed": [2011, 11, 1, 11, 40, 16, 1, 305, 0], "published": "2011-11-01T11:40:16Z", "published_parsed": [2011, 11, 1, 11, 40, 16, 1, 305, 0], "title": "Mechanical surface tension governs membrane thermal fluctuations", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1111.6224%2C1111.0984%2C1111.3860%2C1111.3246%2C1111.5339%2C1111.2342%2C1111.2187%2C1111.0170%2C1111.2271%2C1111.5009%2C1111.3630%2C1111.0175%2C1111.6762%2C1111.5491%2C1111.4558%2C1111.2026%2C1111.5576%2C1111.0908%2C1111.4038%2C1111.6122%2C1111.5436%2C1111.5246%2C1111.6706%2C1111.0394%2C1111.0296%2C1111.0797%2C1111.5905%2C1111.0851%2C1111.2383%2C1111.0110%2C1111.3951%2C1111.2975%2C1111.3859%2C1111.5485%2C1111.7110%2C1111.2087%2C1111.7181%2C1111.1007%2C1111.4952%2C1111.1370%2C1111.4781%2C1111.2072%2C1111.3764%2C1111.7304%2C1111.5202%2C1111.7263%2C1111.2495%2C1111.2076%2C1111.6959%2C1111.3416%2C1111.3886%2C1111.4678%2C1111.3616%2C1111.7191%2C1111.5357%2C1111.4469%2C1111.2334%2C1111.2972%2C1111.2863%2C1111.6144%2C1111.1546%2C1111.6729%2C1111.3779%2C1111.3877%2C1111.6397%2C1111.5890%2C1111.4485%2C1111.1320%2C1111.4033%2C1111.4297%2C1111.2821%2C1111.1515%2C1111.3820%2C1111.4293%2C1111.1892%2C1111.3340%2C1111.7127%2C1111.4392%2C1111.7207%2C1111.1131%2C1111.6977%2C1111.6945%2C1111.4458%2C1111.0079%2C1111.1964%2C1111.2694%2C1111.2734%2C1111.3908%2C1111.3138%2C1111.1557%2C1111.6117%2C1111.5766%2C1111.6174%2C1111.6645%2C1111.0058%2C1111.5295%2C1111.3685%2C1111.3480%2C1111.3513%2C1111.2720%2C1111.4644&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Mechanical surface tension governs membrane thermal fluctuations"}, "summary": "Motivated by the still ongoing debate about the various possible meanings of\nthe term surface tension of bilayer membranes, we present here a detailed\ndiscussion that explains the differences between the \"intrinsic\",\n\"renormalized\", and \"mechanical\" tensions. We use analytical considerations and\ncomputer simulations to show that the membrane spectrum of thermal fluctuations\nis governed by the mechanical and not the intrinsic tension. Our study\nhighlights the fact that the commonly used quadratic approximation of Helfrich\neffective Hamiltonian is not rotationally invariant. We demonstrate that this\nnon-physical feature leads to a calculated mechanical tension that differs\ndramatically from the correct mechanical tension. Specifically, our results\nsuggest that the mechanical and intrinsic tensions vanish simultaneously, which\ncontradicts recent theoretical predictions derived for the approximated\nHamiltonian.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1111.6224%2C1111.0984%2C1111.3860%2C1111.3246%2C1111.5339%2C1111.2342%2C1111.2187%2C1111.0170%2C1111.2271%2C1111.5009%2C1111.3630%2C1111.0175%2C1111.6762%2C1111.5491%2C1111.4558%2C1111.2026%2C1111.5576%2C1111.0908%2C1111.4038%2C1111.6122%2C1111.5436%2C1111.5246%2C1111.6706%2C1111.0394%2C1111.0296%2C1111.0797%2C1111.5905%2C1111.0851%2C1111.2383%2C1111.0110%2C1111.3951%2C1111.2975%2C1111.3859%2C1111.5485%2C1111.7110%2C1111.2087%2C1111.7181%2C1111.1007%2C1111.4952%2C1111.1370%2C1111.4781%2C1111.2072%2C1111.3764%2C1111.7304%2C1111.5202%2C1111.7263%2C1111.2495%2C1111.2076%2C1111.6959%2C1111.3416%2C1111.3886%2C1111.4678%2C1111.3616%2C1111.7191%2C1111.5357%2C1111.4469%2C1111.2334%2C1111.2972%2C1111.2863%2C1111.6144%2C1111.1546%2C1111.6729%2C1111.3779%2C1111.3877%2C1111.6397%2C1111.5890%2C1111.4485%2C1111.1320%2C1111.4033%2C1111.4297%2C1111.2821%2C1111.1515%2C1111.3820%2C1111.4293%2C1111.1892%2C1111.3340%2C1111.7127%2C1111.4392%2C1111.7207%2C1111.1131%2C1111.6977%2C1111.6945%2C1111.4458%2C1111.0079%2C1111.1964%2C1111.2694%2C1111.2734%2C1111.3908%2C1111.3138%2C1111.1557%2C1111.6117%2C1111.5766%2C1111.6174%2C1111.6645%2C1111.0058%2C1111.5295%2C1111.3685%2C1111.3480%2C1111.3513%2C1111.2720%2C1111.4644&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Motivated by the still ongoing debate about the various possible meanings of\nthe term surface tension of bilayer membranes, we present here a detailed\ndiscussion that explains the differences between the \"intrinsic\",\n\"renormalized\", and \"mechanical\" tensions. We use analytical considerations and\ncomputer simulations to show that the membrane spectrum of thermal fluctuations\nis governed by the mechanical and not the intrinsic tension. Our study\nhighlights the fact that the commonly used quadratic approximation of Helfrich\neffective Hamiltonian is not rotationally invariant. We demonstrate that this\nnon-physical feature leads to a calculated mechanical tension that differs\ndramatically from the correct mechanical tension. Specifically, our results\nsuggest that the mechanical and intrinsic tensions vanish simultaneously, which\ncontradicts recent theoretical predictions derived for the approximated\nHamiltonian."}, "authors": ["Oded Farago"], "author_detail": {"name": "Oded Farago"}, "author": "Oded Farago", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1103/PhysRevE.84.051914", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1111.0175v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1111.0175v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "A shorter version of this paper has been submitted for publication in\n  Phys. Rev. E", "arxiv_primary_category": {"term": "cond-mat.soft", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cond-mat.soft", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "cond-mat.stat-mech", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1111.0175v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1111.0175v1", "journal_reference": "Phys. Rev. E 84, 051914 (2011)", "doi": "10.1103/PhysRevE.84.051914", "fulltext": "Mechanical surface tension governs membrane thermal fluctuations\nOded Farago1\n\narXiv:1111.0175v1 [cond-mat.soft] 1 Nov 2011\n\n1\n\nDepartment of Biomedical Engineering and Ilse Katz Institute for Nanoscale Science and Technology,\nBen Gurion University, Be'er Sheva 84105, Israel\nMotivated by the still ongoing debate about the various possible meanings of the term surface\ntension of bilayer membranes, we present here a detailed discussion that explains the differences between the \"intrinsic\", \"renormalized\", and \"mechanical\" tensions. We use analytical considerations\nand computer simulations to show that the membrane spectrum of thermal fluctuations is governed\nby the mechanical and not the intrinsic tension. Our study highlights the fact that the commonly\nused quadratic approximation of Helfrich effective Hamiltonian is not rotationally invariant. We\ndemonstrate that this non-physical feature leads to a calculated mechanical tension that differs dramatically from the correct mechanical tension. Specifically, our results suggest that the mechanical\nand intrinsic tensions vanish simultaneously, which contradicts recent theoretical predictions derived\nfor the approximated Hamiltonian.\nPACS numbers:\n\nI.\n\nINTRODUCTION\n\nBilayer membranes are quasi-two-dimensional (2D)\nfluid sheets formed by spontaneous self-assembly of lipid\nmolecules in water [1]. Their elasticity is traditionally\nstudied in the framework of the Helfrich effective surface\nHamiltonian for 2D manifolds with local principle curvatures c1 and c2 [2]\n\u0014\n\u0015\nZ\n1\n2\ndS σ0 + κ0 (c1 + c2 − 2c0 ) + κ̄0 c1 c2 , (1)\nH0 =\n2\nA\nwhere the integration is carried over the whole surface of\nthe membrane. The Helfrich Hamiltonian involves four\nparameters: the spontaneous curvature c0 , the surface\ntension σ0 , the bending modulus κ0 , and the saddle-splay\nmodulus κ̄0 . For symmetric bilayer membranes, c0 = 0.\nIf, in addition, the discussion is limited to deformations\nthat preserve the topology of the membrane, then (by\nvirtue of the Gauss-Bonnet theorem) the total energy associated with the last term is a constant, and one arrives\nto the more simple form\n\u0014\n\u0015\nZ\n1\n1\n2\ndS σ0 + κ0 (c1 + c2 ) = σ0 A + κ0 J 2 , (2)\nH0 =\n2\n2\nA\nwhere A Ris the total area of the membrane and J, defined\nby J 2 = dS (c1 + c2 )2 , is the integrated total curvature.\nThe surface tension appearing in Eq.(2) is known as\nthe \"intrinsic tension\". It represents the elastic energy\nrequired to increase the surface of the membrane by a\nunit area, and can be identified with the derivative of\nthe energy with respect to the area A, σ0 = (∂H/∂A), at\nconstant J. As this quantity is not directly measurable,\nits physical meaning is still a matter of a fierce debate. In\nmolecular simulations, one can attach the membrane to a\n\"frame\" and measure the \"mechanical (frame) tension\",\nτ , which is the lateral force per unit length exerted on the\nboundaries of the membrane [3–6]. Experimentally, the\nmechanical tension is routinely measured by micropipette\naspiration of vesicles [7, 8]. Formally, the mechanical\n\ntension is obtained by taking the full derivative of the\nfree energy F with respect to the frame (projected) area:\nτ = dF/dAp [9]. From a comparison of the above definitions of σ0 and τ , it becomes clear that the intrinsic\nand mechanical tensions are different quantities. Contrary the former, the latter is a thermodynamic quantity\nthat also depends on the entropy of the membrane. Bilayer membranes usually exhibit relatively large thermal\nundulations at room temperature [10] and, indeed, their\nmechanical tension also includes an entropic contribution\ndue to the suppression of the amplitude of the undulations upon increasing the projected area.\nThe surface tension can be also measured indirectly by\nrecording and analyzing the statistics of the membrane\nheight fluctuations [11, 12]. The analysis is based on the\nso called Monge parametrization, where the surface of the\nfluctuating membrane is represented by a height function, h(x, y), above the frame (x, y) plane. The Helfrich\nHamiltonian does not have a simple form when expressed\nin terms of h(x, y). However, for a nearly flat membrane,\ni.e., when the derivatives of h with respect to x and y\nare small (|∂x h|, |∂y h| ≪ 1), one obtains the quadratic\napproximation\nZ\nhσ\n\u00012 i\nκ0\n0\n2\nM\nH2 = σ0 Ap + dxdy\n. (3)\n∇2 h\n(∇h) +\n2\n2\nNote that unlike Eq.(2), the integral in Eq.(3) runs over\nthe frame area rather than over the area of the manifold. The quadratic approximation can be diagonalized byR introducing the Fourier transformation: hq =\n(1/Ap ) dxdy h(x, y) exp(−i~q * ~r). In Fourier space the\nHamiltonian reads\n\u0001\nAp X\nH2M = σ0 Ap +\n(4)\nσ0 q 2 + κ0 q 4 |hq |2 ,\n2\nq\n~\n\nand by invoking the equipartition theorem, we find that\nthe mean square amplitude of mode ~q (\"spectral intensity\"):\nh|hq |2 i =\n\nkB T\n.\nAp (σ0 q 2 + κ0 q 4 )\n\n(5)\n\n\f2\nFrom the last result, it seems as if σ0 can be extracted\nfrom the fluctuation spectrum of the membrane. Results of both fully-atomistic and coarse-grained simulation [13–17] show that spectral intensity can indeed be\nfitted to the form\nh|hq |2 i =\n\nkB T\nAp (rq 2 + O(q 4 ))\n\n(6)\n\nHowever, the derivation of Eq.(5) is based on the approximated Hamiltonian H2M and, therefore, it is not apriory clear why the so called \"q 2 -coefficient\" appearing\nin Eq.(6), r = σ0 . In fact, some theoretical studies have\nargued that the q 2 coefficient is actually equal to the\nmechanical tension τ [18–20]. This conclusion has been\nrejected more recently in favor of the more common interpretation that r = σ0 [21, 22]. Membrane simulations\ncarried at fixed mechanical tension (usually performed\nfor τ = 0) tend to agree with the result that r = τ\n[4, 13, 15, 16, 23], but simulations that show the opposite r 6= τ also exist [21, 24]. In this paper we settle\nthis problem and prove, analytically and computationally, that the correct result is indeed r = τ .\nII.\n\nWHAT DOES THE INTRINSIC TENSION\nREPRESENT?\n\nMuch of the confusion associated with the physical\nmeaning of surface tension in membranes is related to\nfact that the concept of surface tension has been originally defined for an interface between bulk phases (e.g.,\nbetween water and oil) [25]. In its original context, the\nsurface tension represents the access free energy ∆F per\nunit area A of the interface between the bulk phases\nγ=\n\n∆F\n.\nA\n\n(7)\n\nWhen the concept of surface tension is introduced into\nthe theory of bilayer membranes, its meaning is distorted\ndue to the following two major differences between membranes and interfaces of bulk phases\n1. In the case of bulk phases, it is often assumed that\nthe interface between them is flat. There is usually very little interest in the thermal roughness of\nthe interface, unless it is very soft. In contrast, bilayer membranes are treated as highly fluctuating\nsurfaces whose elastic response is very much influenced by the entropy associated with the thermal\nfluctuations.\n2. The changes in the areas of both systems arise\nfrom very different origins. In the case of, say,\na water-oil interface, the changes in the interfacial area are not produced by elastic deformations\n(dilation/compression) that modify the molecular\ndensities of the bulk phases. Instead, they result\nfrom transfer of molecules between the bulk phases\n\nand the interface occurring, for instance, when the\nshape of the container is changed. The surface tension γ is essentially a chemical potential which is\ndirectly related to the exchange parameter between\nthe coexisting phases [26]. The case of bilayer membranes is completely different. Here, there is an exchange of water between the bulk fluid and interfacial region, but almost no exchange of lipid material\nbecause the concentration of free lipids in the embedding solution is extremely low (10−6 − 10−10 M\n[1]). In other words, there is no reservoir of lipids\noutside of the bilayer and, therefore, a changes in\nthe bilayer area result in a change in the area density of the lipids. The membrane surface tension\nmeasures the response to this elastic deformation,\nincluding the indirect contribution due to the exchange of water between the bilayer and solution\nresulting from the deformation (which has influence\non the effective elastic moduli).\nMost earlier theoretical investigations of membranes\ninvolved the assumption that the area per lipid a is constant. This assumption relies on the observation that the\nenergy cost involved in density fluctuations is much larger\nthan the energy scale associated with curvature fluctuations. Further assuming that the lipids are insoluble in\nwater (and, therefore, they all reside on the membrane\nwhere their number N is constant) implies that the total area of the membrane A = N a is constant. If that\nis the case, then why does one need to include this constant in the Helfrich Hamiltonian [first term on the right\nhand side of Eq.(2)], and what does the coefficient, σ0 ,\nrepresent? The answer is simple. It is technically very\nhard to calculate analytically the partition function for a\nfluctuating manifold with a fixed area A. The first term\nin Eq.(2) is a Lagrange multiplier that fixes the mean\narea hAi of the membrane, and the value of σ0 is set by\nthe requirement that A = hAi = ∂F/∂σ0 . As usual, it\nis assumed that in the thermodynamic limit the relative\nfluctuations in the total area become negligible, and there\nis no distinction between hAi and A.\nThe renewed interest in the meaning of surface tension\nduring the past decade is very much linked with the rapid\ndevelopment in computer modeling and simulations of\nbilayer membranes. In molecular simulations the number of lipids N is usually fixed, but the total area in\nnot. Membranes are no longer treated as incompressible\nthin films, but rather as stretchable/compressible surfaces whose elastic response result from their intermolecular forces. With this point of view in mind, it is clear\nthat the intrinsic tension σ0 in Helfrich Hamiltonian represents an elastic coefficient which, potentially, may be\nrelated to the mechanical tension τ . There is, of course,\nno reason to expect that the elastic energy E of the membrane is linear in A [27]. A quadratic elastic function\nE = 1/2KA(A−A0 )2 seems like a more appropriate form,\nwhere KA is the stretching/compression modulus and A0\nis the relaxed area of the membrane [28] (also known as\nSchulman's area [29]). Expressing the total area as the\n\n\f3\n\na\n\nb\n\nc\n\nd\n\nFIG. 1: A fluctuating membrane with a projected area Ap\nat four different states: (a) the reference undeformed state,\n(b) under shear deformation, (c) subjected to an arbitrary\ndeformation, and (d) as in (c) but with periodic boundary\nconditions. Each state is characterized by the mean height\nprofile function h̄(x, y) which is indicated by a thick solid\nline. The dashed thin line in (a) serves as a reminder that the\nmembrane is fluctuating around its mean profile.\n\nsum of the projected and undulations areas A = Ap +δA,\nand assuming that δA ≪ |Ap − A0 |, yields the linear approximation E ≃ 1/2KA(Ap − A0 )2 + KA (Ap − A0 )δA\nfrom which one identifies that σ0 = KA (Ap − A0 ). The\nassumption that δA ≪ |Ap − A0 | becomes increasingly\naccurate at high tensions; but, nevertheless, the linear\nrelationship between E and A is used in Eq.(2) over the\nentire range of intrinsic tensions.\n\nIII.\n\nHELFRICH ELASTIC FREE ENERGY\n\nThe proof that r = τ consists of three steps and involves the introduction of two additional surface tensions:\n(i) σ, the renormalized surface tension, and (ii) μ, the\nout-of-plane shear modulus (which, as it will turn out\nbelow, is also a surface tension). Let us first understand\nwhat these two quantities represent. The out-of-plane\nshear modulus μ is the force per unit length required to\nintroduce the deformation depicted in fig. 1(b) from the\ninitial reference state depicted in fig. 1(a). This deformation is achieved by applying opposite normal forces\non boundaries of the membrane. (Notice that the outof-plane shear deformation changes the area of the membrane, but preserves the volume of the three-dimensional\nEuclidean metric. We will revisit this point later in section III C.) The shear modulus is not related to the deformation of a specific configuration but rather to the deformation of a fluctuating membrane. The out of plane\n\nshear is a special case of a more general family of elastic\ndeformations resulting from the action of normal stress\nfields. A representative of this family of deformations is\nshown schematically in fig. 1(c). Mathematically, such\ndeformations can be characterized by the mean height\nprofile of the membrane: hh(x, y)i ≡ h̄(x, y). This function, which vanishes in the undeformed reference state\nh̄(x, y) = 0, serves as the strain field that describes arbitrary deformations of the fluctuating membrane at fixed\nprojected area Ap . Specifically for the shear deformation shown in fig. 1(b), h̄(x, y) = ǫx where ǫ is the shear\nstrain. The normal stress field associated with the strain\nfunction h̄(x, y) can be derived from the elastic free energy F (h̄). Based on the same physical arguments used\nto justify the introduction of Helfrich effective Hamiltonian Eq.(2), we hereby assume that the elastic free energy\nF (h̄) can be written in a similar form\n\u0001 1\n\u0001\n\u0001\nF h̄ (x, y) = σ Ã h̄ + κ(J ̃)2 h̄ ,\n2\n\n(8)\n\n ̃ h̄) are the total area and integrated\nwhere Ã(h̄) and J(\ntotal curvature of the mean height profile of the membrane, h̄(x, y). Our conjecture of Eq.(8) is based on\nthe fact (which will be proved in the following section\nIII A) that this form of the free energy yields the experimentally and computationally well established Eq.(6) for\nthe spectral intensity. The coefficient σ and κ appearing in Eq.(8) are the renormalized surface tension and\nbending rigidity. These quantities are thermodynamic\nproperties of the membranes which, in general, include\nentropic contributions and, therefore, are different than\nthe corresponding microscopic coefficients appearing in\nthe Helfrich effective Hamiltonian.\n\nA.\n\nLinear response theory\n\nThe first step in the proof that r = τ is to show\nthat r = σ, which follows from static linear response\ntheory. Detailed proof of this point can be found in\nref. [19]; here we provide a short version of the derivation.\nLet us consider an elastic deformation with a function\nh̄(x, y) that satisfies periodic boundary conditions (see,\ne.g., fig. 1(d)). Introducing h̄q , the Fourier transform of\nthe function h̄(x, y), and expanding Ã and J ̃ in powers\nof h̄q , we find\nF\n\n\u0001\n\u0003\n\u0001\n\b\nAp X \u0002 2\nσq + κq 4 h̄q h̄−q + O |h̄q |4\nh̄q = σAp +\n2\nq\n~\n\n(9)\nwhere h̄−q = h̄∗q since the function h̄(x, y) is real [30].\nLetP\nus now consider the perturbed Hamiltonian H =\nH0 − q~ jq hq , where H0 is the Hamiltonian of the membrane. Notice that we do not need to know the specific\nform of H0 and, in particular, we do not assume here\nthat H0 is necessarily the Helfrich Hamiltonian Eq.(2) or\nits quadratic approximation Eq.(3). Instead, we assume\n\n\f4\na\n\nthat the free energy is given by Eq.(8) [or by its Fourier\nspace counterpart Eq.(9)]; and as we shall now show, this\nis the key assumption that ultimately leads to Eq.(6).\nThe derivation is as follows: Introducing the Gibbs free\nenergy G({jq }) = −kB T ln[Tr exp(−H/kB T )], and taking the derivative of G with respect to jq yields\nh̄q = −\n\ndG ({jq })\n.\ndjq\n\nwhich, by using Eq.(9) for the Helmholtz free energy F ,\nreads\n\u0001\n\u0001\n(12)\njq = Ap σq 2 + κq 4 h−q + O |h̄q |3 .\n\nDeriving Eq.(10) with respect to j−q yields the relationship between the elastic linear response and the equilibrium fluctuations in hq\n\u0012\n\u0013−1\ndh̄q\ndj−q\n2\n= kB T\n|hq | 0 = kB T\n,\ndj−q\ndh̄q\njq =0\n\nh̄q =0\n\n(13)\nwhere h* * * i0 denote a thermal average using the unperturbed Hamiltonian H0 . Using Eq.(12) in Eq.(13), one\narrives to the result that\nkB T\n.\n(14)\nh|hq |2 i =\nAp (σq 2 + κq 4 )\nThis completes the proof that r = σ which, as noted\nabove, is independent of the explicit form of H0 .\nB.\n\nunstrained\n\n(10)\n\nThe conjugate thermodynamic variables h̄q and jq can\nbe also related to each other via\n\u0001\n\b\ndF h̄q\n,\n(11)\njq =\ndh̄q\n\nF\nμ\n= f0 + ǫ2 + O(ǫ4 ).\nAp\n2\n\n(15)\n\n(The expansion includes only even powers of ǫ because of\nthe symmetry of the problem with respect to reflections\nin the direction normal to the projected area.). However,\nfor the shear deformation, the mean profile is flat, i.e.\nJ ̃ = 0, and therefore Eq.(8) reads\n\u0001\nF h̄ (x, y) = σ Ã.\n(16)\n√\nThe area Ã and ǫ are related by Ã = 1 + ǫ2 Ap = Ap [1+\nǫ2 /2 + O(ǫ4 )], which yields\nσ\nF\n= f0 + ǫ2 + . . . .\nAp\n2\n\n(17)\n\nc\n\nsheared\n\nrotated\n\nFIG. 2: (a) The unstrained reference state of a thin film.\n(b) The film subjected to a simple shear deformation. (c)\nThe film subjected to a pure shear deformation. The two\ndeformed states have the same elastic free energy since they\ncan be transformed into each other by rotation. The volume\nof the film (indicated by the gray shaded area) is the same at\nall three states.\n\nComparison of Eqs.(15) and (17) leads to the result σ = μ\nwhich, again, is independent of the explicit form of the\nmembrane Hamiltonian H0 .\nC.\n\nRotational invariance\n\nHaving demonstrated that r = σ = μ, the last step\nin the proof that r = τ is to show that τ = σ = μ.\nThis follows immediately from the invariance of Helfrich\nfree energy Eq.(8) with respect to rigid transformations.\nSpecifically, the sheared membrane which is replotted in\nfig. 2(b), can be rotated (see fig. 2(c)) so that the mean\nprofile of the deformed membrane lies in the (x, y) plane\ndefined by the undeformed state (fig. 2(a)). In this orientation Ã = Ap , and from Eq.(16) one gets that the free\nenergy cost of imposing the deformation in fig. 2(c) is\nF = σAp . From this result one finds that the mechanical\ntension\n\nThe renormalized tension is a shear modulus\n\nThe second step is to prove that σ = μ. This can\nbe done easily by considering the shear deformation\nh̄(x, y) = ǫx shown in fig. 1(b). The out of plane shear\nmodulus is defined by the expansion of the free energy\ndensity in powers of ǫ\n\nb\n\nτ=\n\ndF\n=σ\ndAp\n\n(18)\n\n.\nWhile Eq.(18) is correct, it misses an important issue\nwhich cannot be captured within the framework of Helfrich model that treats the membrane as a 2D manifold\nwith no 3D volume. In figs. 2(a)-(c) we have intentionally\ndrawn the membranes as thin films, which highlights a\nvery important point. The transition from the reference\nstate (a) to the deformed state (c) is achieved via a sequence of two volume-preserving transformations - shear\nfollowed by rotation. Therefore, the reference state and\nthe deformed one have different areas but the same volume, which means that in Eq.(18) one must take the\nderivative at a constant volume:\nτ=\n\n∂F\n∂Ap\n\n= μ.\n\n(19)\n\nV\n\nExperimentally and computationally, there is no practical way to fix or even determine the volume of a bilayer at the molecular resolution. This, however, does\n\n\f5\nformations (fig. 2(c)), which is the same as the response\nto \"simple shear\" (fig. 2(b)). The modulus of pure shear\ncan be derived by considering the free energy cost associated with changing the dimensions of a system from\nLx × Ly × Lz to [Lx (1 + ǫ)] × [Ly (1 + ǫ)] × [Lz /(1 + ǫ)2 ].\nThe expansion of the free energy density in powers of ǫ\nreads\n\nnot render the above argument irrelevant to lipid bilayer\nmembranes. The membrane and the embedding fluid\nmedium are placed in a \"container\" whose volume can be\neasily controlled. Eq.(19) states that the frame tension\nof the bilayer can be measured by changing the crosssectional area of the container while keeping its volume\nfixed. This tension is associated with the entire \"interfacial region\" of the system that includes both the bilayer of\nlipids as well as the hydration layers of structured water\naround the bilayer. The fluid bulk water has no elastic\nresponse to volume preserving deformations and, therefore, it make no contribution to τ .\nThe fact that τ is associated with a volume preserving\ndeformation is important. The reader may have noticed\nthat in Eq.(18) we wrote τ = σ, while in Eq.(19) we preferred the equality τ = μ. Obviously, the latter is also\ncorrect since, as discussed above in section III B, σ = μ.\nIn writing τ = μ in Eq.(19) we wish to emphasize the\nfact that the frame tension is also a shear modulus. It\nrepresents the response of the system to \"pure shear\" de-\n\nF\n= f0 + (2Pz − Px − Py )ǫ + O(ǫ2 ),\nLx Ly Lz\n\nwhere Pi is the pressure along the i-th Cartesian axis.\nDue to the deformation, the projected area Ap = Lx Ly\nchanges by ∆Ap ≃ 2Ap ǫ. Therefore, Eq.(20) can also be\nwritten as\n\u0014\n\u0015\n\u0011\n\u0010\nPx + Py\n2\n+ O (∆Ap ) , (21)\nF = F0 + Lz ∆Ap Pz −\n2\nand the frame tension is given by\n\n\u0014\n\u0015\nPx + Py\nF − F0\n= Lz [Pn − Pt ] ,\n= Lz Pz −\nτ = lim\n∆Ap →0 ∆AP\n2\n\nwhere Pn and Pt are, respectively, the normal and transverse components of the pressure tensor (the negative\nCauchy stress tensor) relative to the plane of the membrane. Eq.(22) is known as the mechanical definition of\nthe surface tension [25].\nD.\n\nAt this point only one question is left: why does one\nget r = σ0 rather than r = τ when dealing with the\nquadratic approximation of the effective surface Hamiltonian, Eq.(3)? The answer is simple - the approximated\nHamiltonian is not rotationally invariant. This striking\n\nZ\n\ndxdy\n\nhσ\n\n0\n\n2\n\n2\n\n(∇hμ ) +\n\nFrom this result one finds that\nμ=\n\n1 d2 H2M (hμ (x, y))\n= σ0 ,\nAp\ndǫ2\n\n(24)\n\nand, thus, r = μ = σ0 . This conclusion that r = σ0\nis in agreement with what the equipartition theorem\n\n(22)\n\nfact (which has been discussed by Grinstein and Pelcovitz in the context of lamellar liquid crystalline phases\n[31]) can be demonstrated by considering a certain configuration parametrized by the height function h(x, y)\nwhich satisfies periodic boundary conditions, and evaluating the elastic energy cost corresponding to simple and\npure shear deformations. As discussed above, the result\nthat r = μ is Hamiltonian-independent, but the following\nconclusion that μ = τ depends on rotational invariance,\ni.e., on the fact that the two shear deformations result\nin the same elastic response. This, unfortunately, is not\nthe case with Eq.(3). For the simple shear deformation\nhμ (x, y) = h(x, y) + ǫx, and upon substituting hμ (x, y)\nin Eq.(3) one gets\n\nThe approximated Hamiltonian\n\nH2M (hμ (x, y)) = σ0 Ap +\n\n(20)\n\n\u00012 i\nǫ2\nκ0\n= H2M (h (x, y)) + σ0 Ap .\n∇2 hμ\n2\n2\n\n(23)\n\nEq.(5) predicts for the approximated Hamiltonian. The\nresponse to pure shear is determined by considering the\ntransformation hτ (x′ , y ′ ) = h(x(1 + ǫ), y(1 + ǫ))/(1 + ǫ)2 ,\nwith 0 < x′ ≤ Lx (1 + ǫ), 0 < y ′ ≤ Ly (1 + ǫ). For this\ndeformation: Ap (ǫ) = Ap (ǫ = 0) * (1 + ǫ)2 , dx′ dy ′ = (1 +\nǫ)2 dxdy, ∇hτ = ∇h/(1 + ǫ)3 , and ∇2 hτ = ∇2 h/(1 + ǫ)4 .\n\n\f6\nWhen these relations are used in Eq.(3), we gets:\n\nZ\nhσ\n\u00012 i\nκ0\n0\n2\nH2M (hτ (x, y)) = (1 + ǫ)2 σ0 Ap (ǫ = 0) + dx′ dy ′\n=\n∇2 hτ\n(∇hτ ) +\n2\n2\nZ\nh\n\u00012 i\n2\n+ O(ǫ2 ).\nH2M (h (x, y)) + 2ǫσ0 Ap (ǫ = 0) − dxdy 2ǫσ0 (∇h) + 3ǫκ0 ∇2 h\n\n(25)\n\nFrom this result, one derives the mechanical tension, which is given by\n1 d H2M (hτ (x, y))\nτ=\n2Ap\ndǫ\n\nǫ=0\n\n1\n= σ0 −\nAp\n\nThe second term on the right hand side of Eq.(26) is the\nentropic part of the mechanical tension, evaluated within\nthe framework of the approximated quadratic Hamiltonian. This entropic contribution to τ is not reflected in\nthe fluctuation spectrum of the quadratic Hamiltonian,\nwhich has the non-physical feature of not being rotationally invariant.\nIV.\n\nCOMPUTER SIMULATIONS\n\nTo summarize our discussion: For any Hamiltonian\nwhose corresponding free energy is given by the rotationally invariant free energy Eq.(8), the correct result\nis r = τ . For the not rotationally invariant quadratic\nHamiltonian Eq.(3), r = σ0 6= τ . In order to test\nthese predictions, we performed Monte Carlo simulations\n\nH2 = σ0 Lp +\n\n\u001cZ\n\n\u0014\n\n\u00012\n3\ndxdy σ0 (∇h) + κ0 ∇2 h\n2\n2\n\n.\n\n(26)\n\nof the one-dimensional (1D) analogs of Eqs.(2) and (3).\nWithin these two models, the membrane is represented\nby a string of N = 1024 points, the positions of which\nin 2D space are given by {~ri = (xi , hi )}. In both cases,\nthe simulations are performed at a constant projected\nlength Lp with periodic boundary conditions. Denoting\nby ~bi = ~ri+1 − ~ri , the distance vector (\"bond\") between\nadjacent points, the 1D analog of the rotationally invariant Helfrich effective Hamiltonian is given by [32]\n\nH1 = σ0\n\nX\ni\n\n|~bi | + κ0\n\nX\ni\n\n\"\n\n#\n~bi * ~bi−1\n1−\n.\n|~bi ||~bi−1 |\n\n(27)\n\nThe quadratic approximation of this Hamiltonian is given\nby\n\nκ0 X\nσ0 X\n(hi+1 + hi−1 − 2hi )2 ,\n(hi+1 − hi )2 + 2\n2lp i\n2lp i\n\nwhere lp = LP /N . Notice that in the 1D models, the\ntension has units of a force (energy per unit length). A\nmajor difference between the two 1D models is related to\nthe positions of the points. In the rotationally invariant\ncase Eq.(27), the points are allowed to be anywhere in\nthe available 2D space. At low tensions, this creates configurations in which the chain forms overhangs (see e.g.,\nfig. 3(a)). The existence of such configurations does not\ninvalidate any of the above discussion which only requires\nthat the mean height profile h̄(x, y) is a well defined function. Within the quadratic approximation Eq.(28), the\npoints are allowed to move only in the direction normal\nto the projected length [in the spirit of Eq.(3) in which\nthe height is measured from the x − y plane]. Thus, the\nposition of the i-th point is given by ~ri = (ilp , hi ) and,\n\n\u0015\u001d\n\n(28)\n\nobviously, such moves do not generate any overhangs (see\na typical configuration in fig. 3(b)).\nIn the simulations, we vary σ0 and measure both the\nmechanical tension, τ , and the q 2 -coefficient, r. For each\nvalue of σ0 , the simulations extended over 2 − 4 × 108\nMC time units, where each time unit consists of N single\nparticle move attempts and one collective \"mode excitation Monte Carlo\" (MEMC) move that accelerates the\nvery slow relaxation dynamics of the 10 largest Fourier\nmodes [33]. The introduction of MEMC moves is essential for the equilibration of the system. The mechanical\ntension is calculated using the 1D equivalent of Eq.(22),\nτ = fn − ft , where fn and ft are the normal and transverse forces acting of the chain. Expressing these forces\nas thermal averages, one arrives to the following virial\n\n\f7\nformulae. For the rotationally invariant Helfrich Hamil-\n\nτ =\n\n*\n\nX\n\n2\n\nσ0\n\n(xi+1 − xi ) − (hi+1 − hi )\nlp |~bi |\n\n2\n\n(hi − hi−1 ) (hi+1 − hi ) (xi − xi−1 )2 − (xi − xi−1 ) (xi+1 − xi ) (hi − hi−1 )2\nlp |~bi−1 ||~bi |\n|~bi−1 |2\n!#+\n2\n2\n(xi − xi−1 ) + (hi − hi−1 )\n.\n|~bi |2\n\n+ κ0\n+\n\ni\n\n\"\n\ntonian H1\n\n2\n\nFor the approximated quadratic Hamiltonian H2\n*\n\u0015+\nX \u0014 3σ0\n2κ0\n2\n2\nτ = σ0 −\n.\n(hi+1 − hi ) + 3 (hi+1 + hi−1 − 2hi )\n2lp2\nlp\ni\n\nThe q 2 -coefficient r is obtained by taking the Fourier\ntransform of the the function hi , and fitting the measurements to Eq.(6). Our results for r are based on the analysis of the fluctuations of the 10 largest Fourier modes.\nOur simulation results for the quadratic Hamiltonian\nH2 are summarized in fig. 4. For both κ0 = 0 and\nκ0 = 1kB T and for all values of σ0 , we find that, indeed,\nall our measurements of the q 2 -coefficient agree with the\npredicted relationship r = σ0 (which is denoted by the\ndashed line). As expected from Eq.(30), the mechanical\ntension τ is smaller than r and for small values of σ0 even\n\nμ=\n\n*\n\ni\n\n(xi+1 − xi )\n1\nσ0\n−\nlp kB T\nlp |~bi |3\n\nOur results for μ agree perfectly with the results for τ\nand r.\n\nV.\n\nCONCLUSIONS\n\nMotivated by the still ongoing debate about the various\nmeanings of the term \"surface tension\" in membranes, we\npresented here a detailed discussion which highlights the\nimportance of distinguishing between Helfrich free energy\nand Helfrich Hamiltonian, and between the Hamiltonian\nand its approximated quadratic form. Our key findings\nare the followings:\n1. We have demonstrated that, contrary to common\nperception, the observation that the spectrum of\n\n(30)\n\ngets negative values. In comparison, the simulation results for the rotationally invariant Helfrich Hamiltonian\nH1 are shown in fig 5. In agreement with our expectations for this case, the various tensions satisfy the relationship that r = τ 6= σ0 . To further demonstrate the\nvalidity of our discussion in section III, we computed the\nsimple shear modulus μ, which for Hamiltonian H1 , is\nalso expected to be equal to r and τ . The shear modulus μ can be computed using a rather cumbersome virial\nexpression. For κ0 = 0, the virial expression for μ takes\nthe more simple form:\n\n4\n\nX\n\n(29)\n\nX\ni\n\n(xi+1 − xi ) (hi+1 − hi )\nσ0\n|~bi |\n\n!2 +\n\n.\n\n(31)\n\nthermal fluctuations follows Eq.(6), is not an evidence for the validity and accuracy of the quadratic\nHelfrich Hamiltonian Eq.(3). Instead, we have derived Eq.(6) based on the assumption that the thermodynamic properties of the membrane are correctly depicted by Heflrich free energy Eq.(8).\n2. In most thermodynamic theories the state of the\nmembrane is specified by the extensive variables\nAp and A (or N ) [34]. In our approach, Eq.(8)\nis understood as the elastic free energy functional\nthat depends on the mean profile around which the\nmembrane fluctuates. Thus, the state of the membrane should be described by not only two variables, but through a function h̄ that serves as the\nstrain field for the deformed membrane.\n\n\f8\na\n\nr, τ [kBT/lp]\n\n2\n\n1\n\n0\n2\n\nq coefficient ; κ0=0\n\n-1\n\n-2\n\n2\n\nq coefficient ; κ0=1 kBT\nmechanical tension ; κ0=0\nmechanical tension ; κ0=1 kBT\n\n0\n\n0.5\n\n1\n\nb\n\n1.5\nσ0 [kBT/lp]\n\n2\n\n2.5\n\nFIG. 4: Simulation results for Hamiltonian H2 [Eq.(28)]:\nThe q 2 -coefficient r (circles) and the mechanical tension τ\n(squares) as a function of the intrinsic tension σ0 . Results\nare shown for both κ0 = 0 (solid symbols) and κ0 = 1kB T\n(open symbols). The dashed line is a guide to the eye for the\nrelationship r = σ0 .\n1.5\n\n2\n\nq coefficient ; κ0=0\nmechanical tension ; κ0=0\nshear modulus ; κ0=0\n\nFIG. 3: Typical configurations of the chain in (a) the rotationally invariant Hamiltonian Eq.(27), and (b) its quadratic\napproximation Eq.(28). Both configurations have been obtained for σ0 = 0.75kB T /lp and κ0 = 0. In (a) the points of\nthe chain are allowed be anywhere in the available 2D space\nwhich creates overhangs such as those shown inside the bold\ncircles. In (b) the points move only vertically to the line that\nconnects the end points of the chain.\n\n3. The q 2 -coefficient is equal to the renormalized surface tension σ, i.e., the coefficient of proportionality\nbetween the elastic free energy and the total area of\nthe mean profile in Eq.(8). The renormalized tension is a thermodynamic quantity that also depends\non the entropy of the membrane.\n4. The result that r = σ follows from linear response\ntheory and, therefore, is independent of the particular form the membrane Hamiltonian. In contrast,\nthe conclusion that r = τ is based on the assumption that the system is rotationally invariant and\nrespond equally to all shear deformations irrespective of the relative orientations of the deformed and\nundeformed membranes.\n5. The last point (rotational invariance) is not satisfied when the membrane is described by the approximated quadratic form Eq.(3), which calls for\na reconsideration of some of the results derived\nthrough this model. Specifically, in refs. [21, 22, 28]\nthe quadratic form has been used for a deriva-\n\nr, τ, μ [kBT/lp]\n\n2\n\nq coefficient ; κ0=1 kBT\nmechanical tension ; κ0=1 kBT\n\n1\n\n0.5\n\n0\n\n0\n\n0.5\n\n1\n\n1.5\nσ0 [kBT/lp]\n\n2\n\n2.5\n\nFIG. 5: Simulation results for Hamiltonian H1 [Eq.(27)]: The\nq 2 -coefficient r (solid symbols) and the mechanical tension\nτ (open symbols) as a function of the intrinsic tension σ0 .\nResults are shown for both κ0 = 0 (circles) and κ0 = 1kB T\n(squares). The pluses denote our results for the shear modulus\nμ for κ0 = 0.\n\ntion of negative mechanical tension for positive intrinsic tension [see also Eq.(26) in the present paper]. Our computational results demonstrate that\nthis result is achieved only with the faulty (nonphysical) quadratic Hamiltonian H2 (see fig. 4); but\nfor the corresponding rotationally invariant Hamiltonian H1 , the mechanical tension is always positive for σ0 > 0 (see fig. 5). Our computational\nresults actually suggest that σ0 and τ vanish simultaneously.\n6. To express the last point in a different manner - in\norder to correctly describe the elastic properties of\n\n\f9\nmembranes, one needs to include anharmonic terms\nin the Hamiltonian, which leads to mode coupling.\n\ning the manuscript with great scrutiny. I also thank the\ncomments of Phil Pincus and Adrian V. Parsegian.\n\nAcknowledgments: I am deeply grateful to Haim Diamant for numerous stimulating discussions and for read-\n\n[1] J. Israelachvili, Intermolecular and Surface Forces (Academic, London, 1985).\n[2] W. Helfrich, Z. Naturforsch. 28c, 693 (1973).\n[3] R. Goetz and R. Lipowsky, J. Chem. Phys. 108, 7397\n(1998).\n[4] E. Lindahl and O. Edholm, J. Chem. Phys. 113, 3882\n(2000).\n[5] G. Brannigan, P. F. Philips, and F. L. H. Brown, Phys.\nRev. E 72, 011915 (2005).\n[6] J. Neder, B. West, P. Nielaba, and F. Schmid, J. Chem.\nPhys. 132, 115101 (2010).\n[7] E. Evans and W. Rawicz, Phys. Rev. Lett. 64, 2094\n(1990).\n[8] W. Rawicz, K. C. Olbrich, T. McIntosh, D. Needham\nand E. Evans, Bophys. J. 79, 328 (2000).\n[9] Later, it will become clear that one needs to take this\nderivative while keeping the volume of the system fixed.\nMathematically, this implies that the surface in Helfrich\nHamiltonian should be treated as a thin film whose width\nbecomes vanishingly small.\n[10] S. Safran, Statistical Thermodynamics of Surfaces, Interfaces, and Membranes (Addison-Wesley, New York,\n1994).\n[11] H. P. Duwe, J. Kaes, and E. Sackmann, J. Phys. France\n51, 945 (1990).\n[12] H.-G. Döbereiner et al.. Phys. Rev. Lett. 91, 048301\n(2003).\n[13] S. J. Marrink and A. E. Mark, J. Phys. Chem. B 105,\n6122 (2001).\n[14] O. Farago, J. Chem. Phys. 119, 596 (2003).\n[15] I. R. Cooke, K. Kremer, and M. Deserno, Phys. Rev. E\n72, 011506 (2005).\n[16] Z.-J. Wang and D. Frenkel, J. Chem. Phys. 122, 234711\n(2005).\n[17] E. S. Boek, J. T. Padding, W. K. den Otter, and W. J.\nBriels, J. Phys. Chem. B 109, 19851 (2005).\n[18] W. Cai, T. C. Lubensky, P. Nelson, and T. Powers, J.\nPhys. II France 4, 931 (1994).\n[19] O. Farago and P. Pincus, J. Chem. Phys. 120, 2934\n(2004).\n[20] F. Schmid, Europhys. Lett. 95, 28008 (2011).\n[21] A. Imparato, J. Chem. Phys. 124, 154714 (2006).\n[22] J.-B. Fournier and C. Barbetta, Phys. Rev. Lett. 100,\n\n078103 (2008).\n[23] O. Farago, Phys. Rev. E 78, 051919 (2008).\n[24] J. Stecki, J. Chem. Phys. 125, 154902 (2006).\n[25] J. S. Rowlinson and B. Widom, Molecular Theory of Capillarity (Dover Publications, Mineola NY, 2002).\n[26] See chapter 15 in K. A. Dill and S. Bromberg, Molecular\nDriving Forces (Garland Science, New York, 2002).\n[27] The total elastic energy E does not depend on the total area A only, but also on the distribution of the lipids\nwithin the given area. The local density of the lipids defines the local strain field, and E is calculated by\nR integrating the local elastic energy density E : E = A E dS.\nWhen speaking about the area-dependent energy, E(A),\nwe refer to the mean energy averaged over density fluctuations.\n[28] O. Farago and P. Pincus, Eur. Phys. J. E 11, 399 (2003).\n[29] J.H. Schulman and J.B. Montagne, Ann. N. Y. Acad. Sci.\n92, 366 (1961).\n[30] The number of modes in the sum in Eq.(9) is the number of degrees of freedom needed to specify the mean\nheight profile function h̄. This number cannot be larger\nthan the number of lipids N . In practice, the continuum\ndescription of the membrane holds only above a characteristic microscopic length scale which is typically of\nthe width of the bilayer membrane, i.e., of the order of\na few nanometers. This smallest scale is also the lateral\nsize of a small membrane patch consisting of about 10\nlipids. The number of such patches (which is fixed and\nproportional to N ) defines the number of degrees of freedom. For an interesting discussion about the membrane\nprofile and the associated \"optically resolved scale\" see\nJ.-B. Fournier, A. Ajdari, and L. Peliti, Phys. Rev. Lett.\n86, 4970 (2001).\n[31] G. Grinstein and R. A. Pelcovitz, Phys. Rev. Lett. 47,\n856 (1981).\n[32] The second term in Hamiltonian (27) differs from the curvature term in Eq.(13) in ref. [22]. This change has been\nintroduced to avoid the buckling instability occurring at\nlow tensions when L is allowed fluctuate.\n[33] O. Farago, J. Chem Phys. 128, 184105 (2008).\n[34] For vesicles, one also needs to include the volume enclosed by the membrane.\n\n\f"}