{"id": "http://arxiv.org/abs/1108.5074v1", "guidislink": true, "updated": "2011-08-25T13:02:43Z", "updated_parsed": [2011, 8, 25, 13, 2, 43, 3, 237, 0], "published": "2011-08-25T13:02:43Z", "published_parsed": [2011, 8, 25, 13, 2, 43, 3, 237, 0], "title": "Investigating Biological Matter with Theoretical Nuclear Physics Methods", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1108.5292%2C1108.4518%2C1108.3089%2C1108.5111%2C1108.1608%2C1108.3107%2C1108.3763%2C1108.3877%2C1108.4432%2C1108.0536%2C1108.0670%2C1108.3793%2C1108.2205%2C1108.6253%2C1108.5247%2C1108.1125%2C1108.4609%2C1108.1806%2C1108.0218%2C1108.2447%2C1108.2668%2C1108.4931%2C1108.4829%2C1108.1070%2C1108.5074%2C1108.0447%2C1108.1456%2C1108.5607%2C1108.0098%2C1108.3191%2C1108.5704%2C1108.5155%2C1108.0312%2C1108.3918%2C1108.1904%2C1108.5783%2C1108.2276%2C1108.5572%2C1108.0581%2C1108.4680%2C1108.3646%2C1108.4003%2C1108.2164%2C1108.4086%2C1108.1241%2C1108.0302%2C1108.1440%2C1108.2444%2C1108.3308%2C1108.0220%2C1108.5092%2C1108.1049%2C1108.4724%2C1108.5250%2C1108.0859%2C1108.0942%2C1108.4048%2C1108.1258%2C1108.2809%2C1108.5668%2C1108.4542%2C1108.2558%2C1108.4574%2C1108.2466%2C1108.2614%2C1108.3592%2C1108.1648%2C1108.1496%2C1108.3326%2C1108.5252%2C1108.5469%2C1108.3284%2C1108.3942%2C1108.5654%2C1108.2591%2C1108.0379%2C1108.5834%2C1108.3542%2C1108.2580%2C1108.3870%2C1108.1520%2C1108.3478%2C1108.0445%2C1108.3203%2C1108.2863%2C1108.3768%2C1108.4472%2C1108.4105%2C1108.3435%2C1108.0805%2C1108.2639%2C1108.3026%2C1108.0779%2C1108.4353%2C1108.0222%2C1108.3043%2C1108.2894%2C1108.0413%2C1108.3707%2C1108.0350%2C1108.1142&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Investigating Biological Matter with Theoretical Nuclear Physics Methods"}, "summary": "The internal dynamics of strongly interacting systems and that of\nbiomolecules such as proteins display several important analogies, despite the\nhuge difference in their characteristic energy and length scales. For example,\nin all such systems, collective excitations, cooperative transitions and phase\ntransitions emerge as the result of the interplay of strong correlations with\nquantum or thermal fluctuations. In view of such an observation, some\ntheoretical methods initially developed in the context of theoretical nuclear\nphysics have been adapted to investigate the dynamics of biomolecules. In this\ntalk, we review some of our recent studies performed along this direction. In\nparticular, we discuss how the path integral formulation of the molecular\ndynamics allows to overcome some of the long-standing problems and limitations\nwhich emerge when simulating the protein folding dynamics at the atomistic\nlevel of detail.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1108.5292%2C1108.4518%2C1108.3089%2C1108.5111%2C1108.1608%2C1108.3107%2C1108.3763%2C1108.3877%2C1108.4432%2C1108.0536%2C1108.0670%2C1108.3793%2C1108.2205%2C1108.6253%2C1108.5247%2C1108.1125%2C1108.4609%2C1108.1806%2C1108.0218%2C1108.2447%2C1108.2668%2C1108.4931%2C1108.4829%2C1108.1070%2C1108.5074%2C1108.0447%2C1108.1456%2C1108.5607%2C1108.0098%2C1108.3191%2C1108.5704%2C1108.5155%2C1108.0312%2C1108.3918%2C1108.1904%2C1108.5783%2C1108.2276%2C1108.5572%2C1108.0581%2C1108.4680%2C1108.3646%2C1108.4003%2C1108.2164%2C1108.4086%2C1108.1241%2C1108.0302%2C1108.1440%2C1108.2444%2C1108.3308%2C1108.0220%2C1108.5092%2C1108.1049%2C1108.4724%2C1108.5250%2C1108.0859%2C1108.0942%2C1108.4048%2C1108.1258%2C1108.2809%2C1108.5668%2C1108.4542%2C1108.2558%2C1108.4574%2C1108.2466%2C1108.2614%2C1108.3592%2C1108.1648%2C1108.1496%2C1108.3326%2C1108.5252%2C1108.5469%2C1108.3284%2C1108.3942%2C1108.5654%2C1108.2591%2C1108.0379%2C1108.5834%2C1108.3542%2C1108.2580%2C1108.3870%2C1108.1520%2C1108.3478%2C1108.0445%2C1108.3203%2C1108.2863%2C1108.3768%2C1108.4472%2C1108.4105%2C1108.3435%2C1108.0805%2C1108.2639%2C1108.3026%2C1108.0779%2C1108.4353%2C1108.0222%2C1108.3043%2C1108.2894%2C1108.0413%2C1108.3707%2C1108.0350%2C1108.1142&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "The internal dynamics of strongly interacting systems and that of\nbiomolecules such as proteins display several important analogies, despite the\nhuge difference in their characteristic energy and length scales. For example,\nin all such systems, collective excitations, cooperative transitions and phase\ntransitions emerge as the result of the interplay of strong correlations with\nquantum or thermal fluctuations. In view of such an observation, some\ntheoretical methods initially developed in the context of theoretical nuclear\nphysics have been adapted to investigate the dynamics of biomolecules. In this\ntalk, we review some of our recent studies performed along this direction. In\nparticular, we discuss how the path integral formulation of the molecular\ndynamics allows to overcome some of the long-standing problems and limitations\nwhich emerge when simulating the protein folding dynamics at the atomistic\nlevel of detail."}, "authors": ["Pietro Faccioli"], "author_detail": {"name": "Pietro Faccioli"}, "author": "Pietro Faccioli", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1088/1742-6596/336/1/012030", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1108.5074v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1108.5074v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "Prepared for the proceedings of the \"XII Meeting on the Problems of\n  Theoretical Nuclear Physics\" (Cortona11)", "arxiv_primary_category": {"term": "physics.bio-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "physics.bio-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "hep-lat", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "hep-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "nucl-th", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "q-bio.BM", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1108.5074v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1108.5074v1", "journal_reference": null, "doi": "10.1088/1742-6596/336/1/012030", "fulltext": "arXiv:1108.5074v1 [physics.bio-ph] 25 Aug 2011\n\nInvestigating Biological Matter with Theoretical\nNuclear Physics Methods\nPietro Faccioli\nDipartimento di Fisica, Università degli Studi di Trento, Via Sommarive 14, Povo (Trento),\nI-38123 Italy.\nINFN, Gruppo Collegato di Trento, Via Sommarive 14, Povo (Trento), I-38123 Italy.\nE-mail: faccioli@science.unitn.it\nAbstract. The internal dynamics of strongly interacting systems and that of bio-polymers\nsuch as proteins display several important analogies, despite the huge difference in their\ncharacteristic energy and length scales. For example, in all such systems, collective excitations,\ncooperative transitions and phase transitions emerge as the result of the interplay of strong\ncorrelations with quantum or thermal fluctuations. In view of such an observation, some\ntheoretical methods initially developed in the context of theoretical nuclear physics have been\nadapted to investigate the dynamics of biomolecules. In this talk, we review some of our\nrecent studies performed along this direction. In particular, we discuss how the path integral\nformulation of the molecular dynamics allows to overcome some of the long-standing problems\nand limitations which emerge when simulating the protein folding dynamics at the atomistic\nlevel of detail.\n\n1. Introduction\nProteins are macromolecules involved in virtually all the biochemical processes which take\nplace inside the cell, such as e.g. catalysis, charge transport, signal transduction. Clearly,\nunderstanding the physical principles which drive the internal dynamics of individual proteins\nand shape the protein-protein interaction would have countless implications in molecular biology,\ndrug design and nano-biotechnology. In particular, a central open challenge at the interface\nof physics, biochemistry and molecular biology concerns the prediction of the protein folding\npathways i.e. the sequence of conformational transitions which these molecules perform in order\nto reach their stable and biologically active configuration (see e.g. Fig. 1) .\nFrom a theoretical perspective, the problem of determining the time evolution of proteins has\nbeen mostly investigated by means of Molecular Dynamics (MD) simulations, i.e. through the\ndirect integration of the classical equations of motion of all the atoms in the system. From the\nconceptual point of view, such an approach should provide a reasonable approximation, since\nquantum corrections are expected to be quite small. On the other hand, from the practical\npoint of view, the applicability of classical MD simulations is strongly limited by their intrinsic\ncomputational complexity. Indeed, even using computational resources comparable with those\nemployed in the largest contemporary lattice QCD simulations, it is possible to follow the\ndynamics over time intervals which do not exceed a few hundreds ns [1]. Unfortunately, the\ndynamics which drives the protein phenomenology occurs at time scales which are several orders\nof magnitude larger, typically ranging from few ms to several seconds.\n\n\fnative state\nFigure 1. Schematic representation of a protein folding pathway. This trajectory corresponds\nto a biological instanton and was obtained using the Dominant Reaction Pathways approach\n(see discussion in section 4.\nThe decoupling of the microscopic time scales from the time scales at which conformational\nreactions occur is a common feature in many bio-molecular systems. It is due to the fact\nthat most conformational transitions are cooperative and involve the overcoming of free-energy\nbarriers. As a result, in a MD simulation, most computational time is wasted to describe thermal\noscillations inside the initial meta-stable state.\nGiven the huge gap between the time scales at which the relevant physics takes place and\nthe time intervals which can be covered by MD simulations, it is natural to expect that a real\nbreakthrough in our comprehension of biological matter at the fundamental level is more likely\nto come from new ideas and new theoretical approaches, rather than from the next several\ngenerations of supercomputers.\nIn the next sections, we discuss how functional integral approaches originally developed\nin the context of nuclear theory can provide an extremely powerful framework to investigate\nthe dynamics of proteins as well as other complex molecular systems. Before introducing the\nmathematical details of this theory, it is instructive to discuss some basic aspects of protein\nstructure and phenomenology and to highlight several analogies with the dynamics of strongly\ninteracting systems.\n2. QCD and Protein Dynamics: So Far Yet So Close\nFrom the biochemical point of view, proteins are poly-peptide chains, i.e. weakly branched\npolymers formed by 20 different types of monomers called amino-acids. Typical globular proteins\nconsist of about 100 amino-acids, but some chains can contain as many as ∼ 30, 000 of such\nmonomers.\nFrom the physical point of view [2], proteins are very different from essentially all other\nknown polymers: indeed, while standard hetero-polymers are prototypes of disordered mesoscale\nsystems, proteins are characterized by their unique \"ability\" to spontaneously and reversibly fold\ninto a well-defined stable configuration (denominated the native state), in which they perform\ntheir biological functions (see e.g. Fig. 2). Such a remarkable feature is the result of the\nevolutionary pressure, which has selected only a very specific subset in the space of all possible\n\n\fFigure 2. Ball-and-stick representation of the native state of a globular protein. The tube\nrepresents the back-bone of the chain.\namino-acid sequences.\nThe native state of a protein is characterized by an extremely low entropy, since it is defined\nby the small thermal oscillations around a single conformation. In this sense, proteins may be\nregarded as non-symmetric mesoscale crystals. If the temperature of the water surrounding the\nmolecule is increased, or if a denaturant agent (typically urea) is added to the solvent, then\nproteins can reach a much more entropic phase called the molten globule. In this state, the\nchain is still collapsed, but is free to explore the different compact configurations, in analogy\nwith a liquid drop. Finally, at even higher temperatures or denaturant concentrations, proteins\nswell and start to behave as flexible random coils (see right panel of Fig. 3).\nInterestingly, the phase diagram of proteins in solution displays several analogies with that\nof strongly interacting matter (see left panel of Fig. 3). Indeed, the low-temperature and\nlow-density phase of QCD is characterized by a very low entropy, since only colorless hadrons\nare present in the spectrum. On the other hand, above the deconfinement phase transition,\nthe entropy is much larger, since also quantum states in color multiplets can contribute to the\npartition function.\nIn addition, flavor symmetry implies that the hadronic spectrum can be approximatively\norganized into SU(3) multiplets. Hence, since quantum states belonging to the same multiplet\ncan be transformed into one another by a flavor rotation, the number of truly distinct hadronic\nwave-functions is actually much smaller than the number of hadrons recorded in the particle\ndata book. Similarly, it has been experimentally observed that nearly identical native structures\nare adopted by poly-peptide chains characterized by very different amino-acid sequences. This\nis to say that the number of native structures which can be realized is much smaller than the\nnumber of sequences in the data bank of known proteins.\nThese analogies are not accidental. They reflect the fact that the dynamics of both hadrons\nand proteins is characterized by the interplay of large correlations and quantum or thermal\nfluctuations. It is natural to address the question whether some of the powerful theoretical\ntechniques developed to describe the non-perturbative internal dynamics of hadrons may be\nexported to describe the non-perturbative internal dynamics of proteins. In the next section,\nwe shall see that this intuition can be made rigorous, i.e. that it is possible to formulate the\ndynamics of biomolecular systems in terms of an effective quantum many-body problem.\n\n\fdeconfined\nphase\n\nPHASE DIAGRAM OF PROTEINS\n\ntemperature\n\ntemperature\n\nPHASE DIAGRAM OF QCD\n\nhadronic\nphase\n\nCFL\nphase\n\nmolten\nglobule\nphase\n\ncoil\nphase\n\nfolded\nphase\n\nchemical poten/al\n\ndenaturant concentra/on (urea)\n\nFigure 3. Comparison between the phase diagram of QCD and of proteins in solution.\n3. Path Integral Formulation of Molecular Dynamics\nThe dynamics of biomolecular systems in solution is often described by means of the Langevin\nequation, which reads\nm ẍ = −γ ẋ − ∇U (x) + ξ(t),\n(1)\nIn this equation, x = (x1 , x2 , ..., xN ) is a macro-vector specifying the coordinates of all the\natomic nuclei in the molecule, U (x) is the potential energy and ξ(t) is a stochastic force, which\nsimulates the effects of the random Brownian collisions with the molecules in the solvent. The\ncontemporary models for the potential energy U (x) - which is often improperly called the force\nfield - are defined phenomenologically in order to reproduce the results of quantum chemistry\ncalculations of the equilibrium configurations of small molecules [3]. For sake of simplicity and\nwithout loss of generality, in the following we present the formalism in the case of one particle\nin one spacial dimension. The generalization to the multi-dimensional case is straightforward.\nThe acceleration term on the left hand side of Eq. (1) introduces inertial effects which are\ndamped on a time-scale t ∼ m/γ ≡ τD . For most biomolecular systems, τD is of order of the\nfraction of a ps, hence much smaller than the relevant microscopic time-scale associated to the\ndynamics of the torsional angles, which takes place at the ns time-scale.\nFor t \u001d τD the Langevin Eq. (1) reduces to\nD\n∂x\n=−\n∇U (x) + η(t),\n∂t\nkB T\nBT\nwhere D = kmγ\nis the so-called diffusion coefficient and η(t) =\nthat satisfy the so-called fluctuation-dissipation relationship:\n\n(2)\n1\nγ\n\nξ(t) is a rescaled white noise\n\nhη(t)η(t0 )i = 2Dδ(t − t0 ).\n\n(3)\n\nIt can be shown -see e.g. [4]- that the probability distribution sampled by the stochastic\ndifferential Eq. (2) satisfies then the Fokker-Planck (FP) equation:\n∂\n1\nP (x, t) = D∇\n∇ U (x) P (x, t)\n∂t\nkB T\n\u0012\n\n\u0013\n\n+ D ∇2 P (x, t).\n\n(4)\n\nA universal property of all the solutions of the Eq. (4) is that, in the long time limit, they\nconverge to the Boltzmann weight, regardless of their initial conditions.\n\n\fBy performing the substitution\nP (x, t) ≡ e\n\n− 2k1\n\nBT\n\nU (x)\n\nψ(x, t),\n\n(5)\n\nthe FP Eq. (4) can be formally re-written as a Schrödinger Equation in imaginary time:\n−\n\n∂\nψ(x, t) = Ĥeff ψ(x, t),\n∂t\n\n(6)\n\nwhere the effective \"Quantum Hamiltonian\" operator reads\nĤeff = − D∇2 + Veff (x),\n\n(7)\n\nand Vef f (x) is an effective potential and is defined as\nVeff (x) =\n\nh\ni\nD\n2\n2\n(∇U\n(x))\n−\n2k\nT\n∇\nU\n(x)\n.\nB\n4(kB T )2\n\n(8)\n\nHence, we have shown that the problem of studying the real time stochastic dynamics of a protein\nin solution can be mapped into the problem of determining the imaginary time evolution of an\neffective quantum many-body system.\nBased on the analogy with quantum mechanics, it is immediate to obtain a path-integral\nrepresentation of the solution of (4), subject to the boundary conditions x(0) = xi and x(t) = xf :\n− 2k1\n\n(U (xf )−U (xi ))\n\n− 2k1 T\nB\n\nZ xf\n(U (xf )−U (xi ))\n\nP (xf , t |xi ) = e\n= e\n\nBT\n\nhxi |e−Ĥeff t |xf i\n−\n\nRt\n0\n\nDx(τ ) e\n\ndτ\n\n\u0010\n\n\u0011\n\nẋ2 (τ )\n+Veff [x(τ )]\n4D\n\n.\n\n(9)\n\nxi\n\nThis equation expresses the fact that the Green's function of the Fokker-Planck equation is\nformally equivalent to a quantum-mechanical propagator in imaginary time. On the other hand,\nit is important to stress that the variable t which enters in these equations corresponds to the\nphysical time.\n4. The Theory of Biological Instantons\nThe path integral formulation of the stochastic dynamics of protein is particularly convenient if\none is interested in investigating the structure of the protein folding pathways. Indeed, such a\nformalism allows to focus directly on the non-equilibrium dynamical trajectories which actually\nreach the native state xf in a given time interval t. This way, one avoids wasting time to simulate\ntrajectories which remain confined in the initial denatured state. A second important advantage\nof Eq. (9) is that it assigns a probability density to each folding pathway x(τ ):\nProb.[x(τ )] ∝ exp[−Sef f [x]].\n\n(10)\n\nClearly, the folding pathways which are most likely to be realized by a given protein are the\nsolutions of the \"classical\" equations of motion generated by the effective action\nZ t\n\nSef f [x] =\n\ndτ\n0\n\nẋ2\n+ Vef f [x]\n4D\n\n!\n\n.\n\n(11)\n\nThese trajectories typically overcome barriers of the effective potential Vef f (x). Hence, they\ncorrespond to instantons in the effective quantum theory. The so-called Dominant Reaction\n\n\fPathways (DRP) approach developed by our group [5, 6, 7, 8, 9] is based on the saddle-point\napproximation of the stochastic path integral (9) and focuses on such \"biological instantons\".\nUnlike in QCD, such an approach is not affected by infrared divergences, hence it is completely\nrigorous. The expansion parameter controlling the accuracy of this approximation is the thermal\nenergy kB T , which enters in the definition of the diffusion constant D and of the effective\npotential Vef f (x).\nIn principle, the instantons can be obtained by relaxing numerically a discretized\nrepresentation of the effective action functional Sef f [x], in complete analogy with the cooling\nprocedure developed in lattice field theory. In practice, however, the simultaneous presence of\nfast and slow internal time scales (which range from fs to ns) makes such a task very challenging.\nIndeed, the discretized elementary time interval ∆t has to be chosen much smaller than the\nsmallest time scale. Hence, computing a single dominant pathway would require to find a\nminimum of a function with a gigantic number of degrees of freedom: 3N × Nt , where N is the\nnumber of atoms in the protein -typically from several hundreds to many thousands- and Nt\nis the number of time discretization steps -typically 106 -.\nFortunately, a major numerical simplification of this problem can be achieved by exploiting\nthe fact that the dynamical system defined by the effective action (11) is simplectic, i.e. it\nconserves the \"effective energy\" 1\nEef f =\n\n1 2\nẋ (t) − Vef f [x(t)].\n4D\n\n(12)\n\nHence, rather than minimizing directly the effective action Sef f [x], it is possible to obtain the\nbiological instantons using the Hamilton-Jacobi (HJ) formulation of classical mechanics. In other\nwords, the trajectories obeying the classical equations of motion and subject to the boundary\nconditions x(t) = xf , and x(0) = xi are those which minimize the effective HJ functional\n1\nSHJ [x(l)] = √\nD\n\nZ xf\nxi\n\nq\n\ndl Eef f (t) + Vef f [x(l)],\n\n(13)\n\n√\nwhere dl = dx2 is the measure of the distance covered by the system in configuration space,\nduring the transition. Hence, the dominant reaction pathways can be viewed as the geodesic in\na space with a curved metric.\nThe major advantage of the HJ formulation is that it allows to remove the time as the\nindependent variable and replacing it with the curvilinear abscissa l, which has the dimension of\na length scale. Since there is no gap in the length scales of molecular systems, the discretization of\nthe HJ is expected to converge extremely much faster than the time discretization of the effective\naction Sef f [x]. Indeed, typically 100 slices are sufficient to achieve an accurate representation\nof the path.\nThe effective energy Eef f is an external parameter which determines the time at which\neach configuration of a dominant reaction pathway x̄(τ ) is visited, according to the usual HJ\nrelationship\nZ x\n\nt(x) =\nxi\n\n1\n.\ndl q\n4D(Eef f + Vef f [x̄(l)])\n\n(14)\n\nTypically, one is interested in studying transitions which terminate close the local minima of\nthe potential energy U (x). The residence time in such end-point configurations must be much\nlonger than that in the configurations visited during the transition. From Eq. (14) it follows\n1\n\nNote that Eef f has the dimension of a rate, therefore this quantity does not have the physical interpretation\nof a mechanical energy\n\n\fthat these conditions are verified if Eef f ∼ −Vef f (xo ), where xo is a configuration in the vicinity\nof a local minimum of U (x).\nIn practice, computing the dominant reaction pathway connecting two given configurations\nxi to xf amounts to minimizing a discretized version of the effective HJ functional:\nd\nSHJ\n[x(l)]\n\n=\n\nr\nNX\ns −1\nn=1\n\n1\n[Eef f + Vef f (x(n))] ∆ln,n+1 ,\nD\n\n(15)\n\nwhere Ns is the number of path discretization slices. Once such a path has been determined,\none can reconstruct the time at which each of the configurations is visited during the transition,\nusing Eq. (14). In particular, the time interval between the n-th and the (n + 1)-th slice is\n∆tn+1,n = q\nwhere ∆ln+1,n =\n\n∆ln+1,n\n\n,\n\n(16)\n\n4D(Eef f + Vef f [x̄(n)])\n\np\n\n(x̄(n + 1) − x̄(n))2 .\n\n4.1. Thermal Fluctuations Around the Dominant Folding Pathways\nThe biological instantons encode information about the reactive dynamics, hence can be used as\nstarting point to compute the folding rate, whose inverse gives the typical time a protein takes\nto reach the native state, starting from a denatured state. This is a fundamental observable in\nprotein kinetics, which is accessible from fluorescence experiments.\nIt turns out that, in order to obtain an equation for the rate, it is necessary to go beyond\nthe lowest-order saddle-point approximation, and estimate the contribution of small thermal\nfluctuations around the dominant paths [8].\nThis corresponds to evaluating the instanton weight at one-loop level, by functionally\nexpanding the effective action to quadratic order, around the instanton solution x(τ ):\n1 t 0 t 00 δ 2 Sef f [x]\ndτ\ndτ\n(xi (τ 0 ) − xi (τ 0 )) (xk (τ ) − xk (τ )) + . . .\n2 0\nδxi (τ 0 )δxk (τ 00 )\n0\nZ t\nZ\n1 t\nτ,τ 0\ndτ 0 (xi (τ 0 ) − xi (τ 0 )) F̂ik\ndτ\n[x] (xk (τ ) − xk (τ )),\n(17)\n' Sef f [x] +\n2 0\n0\nZ\n\nZ\n\nSef f [x] = Sef f [x] +\n\nwhere we have introduced the fluctuation operator F̂ [x], defined as\nτ,τ 0\nF̂ik\n[x]\n\n\"\n\n#\n\nδ 2 Sef f [x]\n1\nd2\n≡\n=\n−\nδ\n+ ∂i ∂k Vef f [x(t)] δ(τ − τ 0 ).\nik\nδxi (τ 0 )δxk (τ 00 )\n2D\ndτ 2\n\n(18)\n\nThe formal one-loop expression for the conditional probability is therefore\nβ\n\nP (xf , t|xi ) ' N\n\ne− 2 (U (xf )−U (xi ))\nq\n\ne−Sef f [x] .\n\n(19)\n\ndet F̂ [x]\n\nSuch an expression is clearly divergent and needs to be regularized. To this end, one can\nmultiply and divide by the conditional probability density of a reference system Preg. (xf , t|xi ).\nFor example, one can use as regulator the conditional probability associated to the diffusion in\nan external harmonic potential, for which the propagator Preg. (x0 , t|x0 ) is analytically known.\nThe result is [8]:\nPDRP (xf , t|xi ) = Preg. (x0 , t|x0 ) e\n\n− β2 (U (xf )−U (xi ))\n\nreg.\nSef\n[xreg. ]−Sef f [x]\nf\n\ne\n\nv\nu\nu\nt\n\n1\n\u0010\n\n\u0011,\n\n−1\ndet F̂reg.\n[xreg. ] F̂ [x]\n\n(20)\n\n\fwhere F̂reg is the fluctuation operator\n\u0010 for the reference \u0011system used in the regularization.\nIn practice, the determinant det F̂reg. [xreg. ] F̂ −1 [x] has to be evaluated numerically from\nthe discretized representation of the fluctuation operators. To obtain such a representation, one\nneeds to express the time derivative using discretized time intervals. It is most convenient to\nuse the intervals ∆ti,i+1 evaluated from the dominant trajectory, according to Eq. (16). The\nfluctuation operator reads\nF̂ [x̄]i,j\nk,m\n\n=\n+\n\n−1/D\nδi,j\n∆tm+1,m + ∆tm,m−1\n∂2V\n\nef f (x̄(k))\n\n∂xi ∂xj\n\n\"\n\nδk,m+1\n− δk,m\n∆tm+1,m\n\n1\n∆tm+1,m\n\n+\n\nδk,m ,\n\n1\n∆tm,m−1\n\n!\n\nδk,m−1\n+\n∆tm,m−1\n\n#\n\n(21)\n\nwhere the indexes k, m = 1, . . . , Ns run over the path frames, while the indexes i, j = 1, . . . , d\nlabel the degrees of freedom of the system.\n4.2. Improved Effective Actions\nThe main numerical advantage of the DRP formalism arises from the possibility of removing the\ntime as a dynamical variable, and replace it with the curvilinear abscissa l. Since there is no gap\nin the characteristic length scales of molecular systems, the convergence of the discretization\nof l is usually very fast compare to that of the discretization of t. As a result, using such\na formulation, it is possible to gain information about the reaction mechanism at a very low\ncomputational cost.\nOn the other hand, in order to obtain information about the dynamics, one needs to compute\nthe times at which each configuration is visited along the dominant path, using Eq.s (14) and\n(16). The calculation of the time intervals ∆ti,i+1 is also needed in the discretized representation\nof the fluctuation operator (21), which enters in the calculation of the order kB T corrections\narising from non-equilibrium stochastic fluctuations around the dominant path.\nClearly, the trick to remove time by switching to the HJ formulation does not help in the\nevaluation of explicitly time-dependent observables. As a result, in order to achieve an accurate\ndescription of the dynamics, or in order properly take into account of the effects of fluctuations,\none would need to use a large number of path frames, with a consequent significant increase of\nthe computational cost of a DRP simulation.\nFortunately, the convergence of the calculation of the time intervals in the DRP approach can\nbe greatly improved by adopting the effective stochastic theory (EST) developed in [10]. The\nmain idea of the EST is to exploit the gap in the internal time scales in order to analytically\nperform the integral over the fast Fourier components of the paths x(τ ) which contribute to the\npath integral (9), using Wilson's approach. Through such a procedure, the effects of the fast\ndynamics is rigorously and systematically integrated out by renormalizing the effective potential:\nEST\nR\nVef f (x) → Vef\nf (x) = Vef f (x) + Vef f (x).\n\n(22)\n\nwhere, to leading order in the effective theory one has\nR\nVef\nf (x) =\n\nD∆tc (1 − b) 2\n∇ Vef f (x) + . . .\n2π 2 b\n\n(23)\n\nIn such an Eq., ∆tc is a cut-off time scale which must be chosen much smaller than the fastest\ninternal dynamical time scale and b is a parameter which defines the interval of Fourier modes\nwhich are being analytically integrated out. Typically, for molecular systems ∆tc ∼ 10−3 ps and\nb ∼ 10−2 [11]. The dots in Eq. (23) denote higher order correction in an expansion in the ratio\n\n\fof slow and fast time scales (so-called slow-mode perturbation theory) and can be found in the\noriginal publication [10].\nThe EST generates by construction the same long-time dynamics of the original \"bare\"\ntheory, but has a lower time resolution. In the context of MD simulations, this implies that the\nEST can be integrated using much larger discretization time steps [11]. In the context of the\nDRP simulations, the utility of the EST resides in the fact that much fewer path discretization\ntime steps are required in order to achieve a convergent calculation of the time interval from the\ndominant path, through Eq. (14).\n4.3. Generalization to Ab-Initio Quantum Chemistry Calculations\nSo far we have discussed the DRP formalism in the specific context of protein folding. On the\nother hand, this theory applies in general to any physical system described by the over-damped\nLangevin Eq. (2). In particular, it can be applied to investigate rare chemical reactions taking\nplace in solution [12]. Typically, such reactions involve large modifications of the electronic\nstructure, e.g. associated to the breaking or forming of covalent bonds. Hence, in investigating\nsuch processes, a classical description based on some phenomenological expression for the\nmolecular potential energy U (x) entering in the Langevin equation is no longer appropriate,\nand one must adopt a sub-atomic approach, in which the quantum electronic degrees of freedom\nare explicitly taken into account.\nIn the Born-Oppenheimer approximation [3], this is done in two steps. First, the Schrd̈inger\nequation for the electronic degrees of freedom is (approximatively) solved holding fixed all the\nnuclear coordinates. The corresponding ground-state energy is then interpreted as the potential\nmolecular energy U (x) and is used to derive the effective potential Vef f (x), which enters the\nDRP formulas. This approach allows to rigorously take into account of the quantum effects on\nthe electron dynamics, to all order in h̄ and to leading order in the ratio m/M between the mass\nof the electron m and the typical mass of the atomic nuclei M .\n4.4. Quantum Corrections to the Diffusive Dynamics of the Atomic Nuclei\nIn the discussion performed so far, the dynamics of the atomic nuclei has been assumed to be\nentirely classical, and to evolve according to the Langevin Eq. (2). Such an approximation\nis certainly reliable for most atomic species which are found in biomolecular systems, such as\ncarbon or oxygen. On the other hand, it becomes questionable for the lightest species, notably\nhydrogen. Hence, in the study of reactions involving a large number of such atoms, the quantum\ncorrections to the stochastic dynamics of nuclei should be consistently taken into account.\nTo tackle this problem, we have derived the multidimensional generalization [15] of the\nsemiclassical extension of the Langevin Eq. (2) and of the corresponding FP equation (4), in\nwhich quantum corrections are systematically included to order h̄2 [13, 14]. From these equations\nit is immediate to compute the quantum corrections to the DRP equations [15]. We found that\nthe effective action receives contribution from an additional term in the form (adopting again\nfor simplicity a one-dimensional notation):\nQ\nSef\nf [x] =\n\nZ t\n0\n\nQ\ndτ Vef\nf [x(τ )],\n\n(24)\n\nwhere\nQ\nVef\nf (x) '\n\nDλ\n|∇U (x)|2 ∇2 U (x)\n4(kB T )3\n2\n\n(25)\n\nis the correction to the effective potential and λ = 12 kh̄B T mi is a characteristic parameter\nwhich determines the size of quantum fluctuations. In conformational transitions driven by\nthe formation of hydrogen bonds, the quantum corrections to the dominant reaction pathways\nhave been found to give raise to sizable effects, see Ref. [15].\n\n\fMD (trajectory)\nDRP (average)\nMD (average)\n\nd1-16 [nm]\n\n1\n\n0.5\n0\n\n10\n\n20\n\nTime [ps]\n\nFigure 4. Evolution of the end-point distance of the protein during a folding reaction, averaged\nover folding trajectories obtained in DRP and MD simulations, respectively. The dashed line\nrepresents a typical trajectory.\n5. Some Applications\nThe DRP approach has been extensively tested and validated on toy systems [7, 8] and\nsimplified protein models [16, 17], and then applied to investigate realistic transitions, including\nconformational transitions of peptides [6, 18], chemical reactions [12] and realistic protein folding\nreactions [21]. In this section, we briefly review some of these studies.\n5.1. Validation of the DRP Theory on a Coarse-Grained Model\nThe most straightforward way to assess the accuracy of the DRP approach consists in comparing\nits predictions with those obtained directly from MD simulations. Unfortunately, for realistic\nmodels MD simulations of protein folding reactions are not presently feasible.\nHence, we have validated the DRP approach using much simpler coarse-grained models, with\nprotein-like properties. For example, the model used in Ref.[17] displays a folding transition\nwith a well-defined and unique native state. The predictions for the time evolution of the\ndistance between the end-points of the chain (a typical observable in protein folding) obtained\nin the DRP and MD approaches is compared in Fig. 4. We see that the biological instanton\nstandpoint provides a realistic description of the reactive dynamics.\n5.2. Atomistically Detailed Protein Folding Simulations\nThe computational efficiency of the DRP approach allows to investigate a large class of reactions\nwhich cannot be studied on the existing supercomputer using standard MD simulations. Only\nvery few examples of successful MD simulations of protein folding reactions have been reported\nto date. These studies were either performed on a special purpose supercomputing machine in\nwhich all the key MD algorithms are implemented at the hardware level [19] or through very long\nlarge-scale simulations performed on several thousands of CPU's, distributed world wide [20].\nOn the other hand, using the DRP method [21] it was possible to simulate the same reaction\nat a comparable level of statistics in less than a single day on only 32 CPU's. The DRP results\nwere found to be consistent with those reported in [19], and provided an explanation of the\ndiscrepancy between the results of Ref. [19] and Ref. [20]. An illustration of one of the folding\n\n\fXi\n\nXf\n\n!\"#$%&'($)%!#!*)\n\nFigure 5. Folding of a peptide obtained from quantum DRP calculations. The shaded area\nrepresents the distribution of electric charge.\ntrajectories obtained in the DRP approach is displayed in Fig. 1. Simulations on much larger\nsystems (unaccessible to MD simulations) are now being performed.\n5.3. Folding of a Small Peptide from Ab-Initio Quantum Mechanical Simulations\nUsing the DRP approach we have performed the first study of the folding of a peptide\nbased on ab-initio Quantum Mechanical calculations, using the Born-Oppenheimer approach\ndescribed in section 4.3. This type of analysis could never performed using MD or Car-Parinello\napproaches [3]. The results of our simulations are schematically represented in Fig. 5. This\nstudy allowed for the first time to access the reliability of the existing classical force fields in\npredicting non-equilibrium reactive trajectories. This is an important and non-trivial issue,\nsince the phenomenological force fields are fitted in order to reproduce quantum mechanical\ncalculations on static configurations, or in equilibrium condition. Hence, there is in principle no\nguarantee that they should be accurate in also in the regions of phase-space which are mostly\nvisited by the non-equilibrium reactive trajectories. On the other hand, our studies have revealed\nthat classical calculations give results that are indeed in good agreement with those of quantum\nab-initio simulations. This study also allowed to quantify to what extent the electronic structure\nof the chain is modified during the reaction.\n6. Conclusions\nNuclear physics provides an excellent training ground where developing advanced theoretical\napproaches to interacting many-particle systems.\nIndeed, a number of schemes and\napproximations originally proposed in this context [22] have later become standard tools in\nthe field of strongly correlated electrons, quantum liquids, cold atoms, . . . .\nIn particular, in this talk we have reviewed our recent attempt to export functional integral\ntechniques originally derived in QCD to investigate the non-equilibrium diffusive dynamics of\nbiomolecules such as proteins. We have argued that such an approach opens the door to the\nstudy of a large number of processes which simply could not be investigated using standard MD\nsimulations.\nInterdisciplinary studies of this type may also emphasize the importance of pushing forward\nthe fundamental research in nuclear theory. Indeed, they show that this activity is valuable also\nin a perspective which goes beyond the traditional perimeter of nuclear physics.\n\n\fAcknowledgments\nI would like to thank all the collaborators which have been involved in the development of the\nDRP approach, and in particular H. Orland, F. Pederiva, G. Garberoglio, S. a Beccara and M.\nSega.\nPF is a member of the Interdisciplinary Laboratory for Computational Science (LISC), a\njoint venture of Trento University and Bruno Kessler foundation. The numerical simulations\nwere performed on the Aurora supercomputer at LISC. This research was partially funded by\nthe Provincia Autonoma di Trento and by INFN, through the AuroraScience project.\nReferences\n[1] P. L. Freddolino et al., Biophys. J. 94, L75 (2008).\n[2] A.V. Finkelstein and O.B. Ptitsyn, \"Protein Physics: a Course of Lectures\", Academic Press, London (2002).\n[3] A.R. Leach, \"Molecular modeling: principle and applications\" (2nd ed.) Pearson Education (Harlow,\nEngland), 2001.\n[4] F. Schwabl, \"Statistical Mechanics\" (2nd ed.), Springer-Verlag, Berlin 2006.\n[5] P. Faccioli, M. Sega, F. Pederiva and H. Orland, Phys. Rev. Lett. 97, 108101 (2006).\n[6] M. Sega, P. Faccioli, F. Pederiva, G. Garberoglio and H. Orland, Phys. Rev. Lett. 99, 118102 (2007).\n[7] E. Autieri, P. Faccioli, M. Sega, F. Pederiva and H. Orland, J. Chem Phys. 130, 064106 (2009).\n[8] G. Mazzola, S. a Beccara, P.Faccioli, and H. Orland, J. Chem. Phys. 134, 164109 (2011).\n[9] R. Elber, and D. Shalloway, J. Chem. Phys. 112, 5539 (2000).\n[10] O. Corradini, P. Faccioli and H. Orland, Phys. Rev. E80 061112 (2009) .\n[11] P. Faccioli, J. Chem. Phys. 133 164106 (2010).\n[12] S. a Beccara, G. Garberoglio, P. Faccioli and F. Pederiva, J. Chem. Phys. 132, 111102 (2010).\n[13] J. Ankerhold, P. Pechukas and H. Grabert, Phys. Rev. Lett. 87, 086802 (2001). J. Ankerhold and H. Grabert,\nPhys. Rev. Lett. 101, 119903 (2008) (Erratum). J. Ankerhold, Phys. Rev. E64, 060102 (2001).\n[14] W. T. Coffey, Y. P. Kalmykov, S. V. Titov, and B. P. Mulligan, J. Phys. A 40, F91(2007). W. T. Coffey, Y.\nP. Kalmykov, S. V. Titov, AND L. Cleary, Phys. Rev. E 78 031114 (2008).\n[15] S. a Beccara, G. Garberoglio and P. Faccioli, J. Chem. Phys. 135 034103 (2011).\n[16] P. Faccioli, J. Phys. Chem. B112, 137560 (2008).\n[17] P. Faccioli, A. Lonardi and H. Orland, J. Chem. Phys. 133, 045104 (2010).\n[18] S. a Beccara, P. Faccioli, M. Sega, G. Garberoglio, F. Pederiva and H. Orland, J. Chem. Phys. 134, 024501\n(2011).\n[19] D.E. Shaw et al., Science 330, 341 (2010).\n[20] D.E. Ensign and V.J. Pande, Biophys. Journ. 96 L53 (2009).\n[21] S. a Beccara, T. Skrbic, R. Covino and P. Faccioli, presently under review.\n[22] J.W. Negele and H. Orland, \"Quantum many-particle systems\", Westview Press 1998.\n\n\f"}