{"id": "http://arxiv.org/abs/0807.2337v2", "guidislink": true, "updated": "2008-07-23T16:40:14Z", "updated_parsed": [2008, 7, 23, 16, 40, 14, 2, 205, 0], "published": "2008-07-15T10:31:31Z", "published_parsed": [2008, 7, 15, 10, 31, 31, 1, 197, 0], "title": "AdS black holes as reflecting cavities", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0807.0607%2C0807.1746%2C0807.4066%2C0807.4108%2C0807.2912%2C0807.3119%2C0807.4726%2C0807.1468%2C0807.0218%2C0807.1769%2C0807.1426%2C0807.3935%2C0807.4413%2C0807.0642%2C0807.5049%2C0807.4037%2C0807.3331%2C0807.2676%2C0807.0247%2C0807.2698%2C0807.3562%2C0807.3875%2C0807.2314%2C0807.3103%2C0807.1689%2C0807.1288%2C0807.3911%2C0807.1735%2C0807.0903%2C0807.0031%2C0807.1748%2C0807.0522%2C0807.2341%2C0807.2793%2C0807.2128%2C0807.3048%2C0807.5020%2C0807.4490%2C0807.4431%2C0807.1959%2C0807.0421%2C0807.3328%2C0807.3130%2C0807.3829%2C0807.4309%2C0807.2086%2C0807.3351%2C0807.3841%2C0807.5042%2C0807.3227%2C0807.1957%2C0807.4045%2C0807.0292%2C0807.0016%2C0807.2510%2C0807.3064%2C0807.4847%2C0807.4808%2C0807.4741%2C0807.0252%2C0807.4707%2C0807.4158%2C0807.4288%2C0807.2337%2C0807.5027%2C0807.1480%2C0807.1628%2C0807.1988%2C0807.4501%2C0807.4742%2C0807.3853%2C0807.1671%2C0807.1918%2C0807.1797%2C0807.3483%2C0807.4291%2C0807.4289%2C0807.0241%2C0807.0371%2C0807.0263%2C0807.1607%2C0807.3448%2C0807.4719%2C0807.0491%2C0807.5128%2C0807.2182%2C0807.3789%2C0807.0239%2C0807.4083%2C0807.0530%2C0807.4926%2C0807.4936%2C0807.2156%2C0807.1873%2C0807.4542%2C0807.4552%2C0807.3619%2C0807.3877%2C0807.0709%2C0807.0515%2C0807.1712&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "AdS black holes as reflecting cavities"}, "summary": "We use the identification between null singularities of correlators in the\nbulk with time singularities in the boundary correlators to study the analytic\nstructure of time-dependent thermal Green functions using the eikonal\napproximation for classical solutions in the AdS black hole background. We show\nthat the location of singularities in complex time can be understood in terms\nof null rays bouncing on the boundaries and singularities of the eternal black\nhole, giving the picture of a `reflecting cavity'. We can then extract the\ngeneral analytic expression for the asymptotic values of the frequencies of\nquasinormal modes in large AdS black holes.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0807.0607%2C0807.1746%2C0807.4066%2C0807.4108%2C0807.2912%2C0807.3119%2C0807.4726%2C0807.1468%2C0807.0218%2C0807.1769%2C0807.1426%2C0807.3935%2C0807.4413%2C0807.0642%2C0807.5049%2C0807.4037%2C0807.3331%2C0807.2676%2C0807.0247%2C0807.2698%2C0807.3562%2C0807.3875%2C0807.2314%2C0807.3103%2C0807.1689%2C0807.1288%2C0807.3911%2C0807.1735%2C0807.0903%2C0807.0031%2C0807.1748%2C0807.0522%2C0807.2341%2C0807.2793%2C0807.2128%2C0807.3048%2C0807.5020%2C0807.4490%2C0807.4431%2C0807.1959%2C0807.0421%2C0807.3328%2C0807.3130%2C0807.3829%2C0807.4309%2C0807.2086%2C0807.3351%2C0807.3841%2C0807.5042%2C0807.3227%2C0807.1957%2C0807.4045%2C0807.0292%2C0807.0016%2C0807.2510%2C0807.3064%2C0807.4847%2C0807.4808%2C0807.4741%2C0807.0252%2C0807.4707%2C0807.4158%2C0807.4288%2C0807.2337%2C0807.5027%2C0807.1480%2C0807.1628%2C0807.1988%2C0807.4501%2C0807.4742%2C0807.3853%2C0807.1671%2C0807.1918%2C0807.1797%2C0807.3483%2C0807.4291%2C0807.4289%2C0807.0241%2C0807.0371%2C0807.0263%2C0807.1607%2C0807.3448%2C0807.4719%2C0807.0491%2C0807.5128%2C0807.2182%2C0807.3789%2C0807.0239%2C0807.4083%2C0807.0530%2C0807.4926%2C0807.4936%2C0807.2156%2C0807.1873%2C0807.4542%2C0807.4552%2C0807.3619%2C0807.3877%2C0807.0709%2C0807.0515%2C0807.1712&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We use the identification between null singularities of correlators in the\nbulk with time singularities in the boundary correlators to study the analytic\nstructure of time-dependent thermal Green functions using the eikonal\napproximation for classical solutions in the AdS black hole background. We show\nthat the location of singularities in complex time can be understood in terms\nof null rays bouncing on the boundaries and singularities of the eternal black\nhole, giving the picture of a `reflecting cavity'. We can then extract the\ngeneral analytic expression for the asymptotic values of the frequencies of\nquasinormal modes in large AdS black holes."}, "authors": ["Irene Amado", "Carlos Hoyos-Badajoz"], "author_detail": {"name": "Carlos Hoyos-Badajoz"}, "author": "Carlos Hoyos-Badajoz", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1088/1126-6708/2008/09/118", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/0807.2337v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0807.2337v2", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "14 pages, 2 figures, reference added", "arxiv_primary_category": {"term": "hep-th", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "hep-th", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "gr-qc", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0807.2337v2", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0807.2337v2", "journal_reference": "JHEP 0809:118,2008", "doi": "10.1088/1126-6708/2008/09/118", "fulltext": "IFT-UAM/CSIC-08-45\n\nAdS black holes as reflecting cavities\nIrene Amado,a Carlos Hoyos,b\na\n\nInstituto de Fı́sica Teórica IFT-UAM/CSIC, C-XVI Universidad Autónoma de Madrid\n\narXiv:0807.2337v2 [hep-th] 23 Jul 2008\n\nE-28049 Madrid, Spain\nb\n\nDepartment of Physics, Swansea University\nSwansea, SA2 8PP, UK\n\nE-mail: Irene.Amado@uam.es, C.H.Badajoz@swansea.ac.uk\n\nAbstract\nWe use the identification between null singularities of correlators in the bulk with time singularities in\nthe boundary correlators to study the analytic structure of time-dependent thermal Green functions\nusing the eikonal approximation for classical solutions in the AdS black hole background. We show that\nthe location of singularities in complex time can be understood in terms of null rays bouncing on the\nboundaries and singularities of the eternal black hole, giving the picture of a 'reflecting cavity'. We can\nthen extract the general analytic expression for the asymptotic values of the frequencies of quasinormal\nmodes in large AdS black holes.\n\n1\n\nIntroduction\n\nBlack holes in asymptotically AdS spaces provide an interesting frame to study the relation\nbetween thermal field theories and classical gravity through the AdS/CFT correspondence [1–3].\nThe analytic extension of the AdS black hole, the 'eternal black hole', has two disconnected\nboundaries. This has been interpreted as having two independent copies of the field theory\neach one living in one of the two boundaries [4–7], based on the original ideas of Israel [8].\nIn Schwarzschild time, that is identified with the time in the dual field theory, the second\nboundary corresponds to the extension to complex values t → t − iβ/2, where β is the inverse of\n\nthe temperature. This suggests a natural identification in the field theory with the SchwingerKeldysh formalism1 [10], where the description of the thermal field theory in Lorentzian signature\nneeds to double the degrees of freedom and extend time to complex values. The corresponding\nSchwinger-Keldysh path starts at some time ti , extends along the real axis to a time tf and\nthen moves in the imaginary direction to tf − iβ/2. Then it comes back in the real direction\n\nto ti − iβ/2 and finally it goes to ti − iβ. The second set of field operators live on the t − iβ/2\npiece.\n\nOne of the most interesting results of the correspondence is the relation between the quasinormal mode spectrum that describes the decay of perturbations in black holes and the singularities\n1A\n\ndescription of the Schwinger-Keldysh formalism can be found in Thermal Field Theory books, like [9].\n\n\fin the complex frequency plane of two-point correlation functions in the holographic dual [11,12].\nSemiclassical computations suggest that both could be simply related to geometric properties\nof the bulk, in particular to its causal structure [13–18]. Very massive fields, corresponding to\noperators of large conformal dimension, can be studied using a WKB approximation where the\nfield propagates along geodesics. In the black hole background, the space has an analytic extension through the horizon to another asymptotically AdS region. Spacelike geodesics can explore\nboth regions and give information about the thermal state where the field theory is defined. It\nis also possible to relate different geodesics with the frequency in the field theory, in such a way\nthat in the large frequency limit the geodesic approaches a null ray. The geodesic approximation\nhas been used to compute the asymptotic position of quasinormal modes in the large mass limit,\nalthough it has been argued that the results should be generalizable to the case of fields with\nsmall mass [16].\nIn this paper we argue that null geodesics in the bulk give useful information about the\nsingularities of the dual correlators even for fields with small mass. In the large frequency limit,\nthat we can associate to the ultraviolet behaviour of the field theory, the classical solutions to\nthe equations of motion can be described in terms of the eikonal approximation. Therefore, the\npropagation of fields in the bulk is well approximated by null rays and it reduces to a problem\nof geometric optics in the curved spacetime. In section 2 we illustrate this by introducing\na mirror in AdS and studying the spectrum of the dual theory. We then proceed in section\n3 to find the eikonal approximation for a scalar field in AdSd+1 black hole backgrounds and\nshow how the solution bouncing on the singularity can be extended to the asymptotic region\nbehind the horizon. In section 4 we explain the asymptotic location of the singularities of field\ntheory correlators and hence the quasinormal mode spectrum of the black hole in simple terms\nof the geometric shape of the black hole, seen as a reflecting cavity with the asymptotically\nAdS boundaries and the future and past singularities as walls. Finally, we discuss possible\napplications of the high frequency-null ray identification and the interpretation in thermal field\ntheories.\n\n2\n\nAdS with a mirror\n\nTo illustrate that null geodesics in AdS contain the relevant information about the singularities\nof the dual two-point correlators let us pick up a very simple example, a scalar field in AdSd+1\nspacetime. We work with the metric\nds2 =\n\n\u0001\n1\n−dt2 + dz 2 + dx2 ,\nz2\n\n(2.1)\n\nwhere z = 0 is the boundary of AdS and we introduce a mirror at a finite value of the radial\ncoordinate z = z0 . This translates into Dirichlet boundary conditions for the fields at this\nsurface.\nA scalar field φ with mass m2 = ∆(∆ − d) is dual to a scalar operator O of conformal\n\ndimension ∆. The source j(t) of the operator in the field theory corresponds to a boundary\n\n\fcondition for the dual field in the bulk. Consider a spatially homogeneous source localized in\ntime j(t) = δ(t). Then, the expectation value (vev) of the operator will be given by the two-point\ncorrelator G(t, x) as\nhO(t)i ∼\n\nZ\n\ndt\n\n′\n\nZ\n\ndx\n\nZ\n\ndx′ G(x − x′ , t − t′ )δ(t′ ) = V G(t, q = 0) ,\n\n(2.2)\n\nwhere V is the volume of the space and q is the spatial momentum. The singularities of the vev\nare thus related to singularities of the correlator. In the holographic description, the expectation\nvalue is implicit in the asymptotic behaviour of the field, that we can compute using Witten\ndiagrams [3]. We are interested in the propagation from points (z = 0, t0 , x0 ) at the boundary,\nto the bulk at (z, t′ , x′ ) and back to the boundary at (z = 0, t, x). The value of the field at the\nboundary can be computed using the convolution of two bulk-to-boundary propagators\nZ\nZ z0\nz 2∆ δ(t0 )\ndz\nφ0 (t) ∼ dxdx0 dx′ dt0 dt′\nz d+1 |z 2 + (x − x′ )2 − (t − t′ )2 |∆ |z 2 + (x′ − x0 )2 − (t′ − t0 )2 |∆\n0\n(2.3)\nAfter integrating over the spatial directions and t0 and introducing Schwinger parameters w1\nand w2 , we find\nZ\nZ\nφ0 (t) ∼ V\ndt′\n\nz0\n\ndzz 2∆−d−1\n\n0\n\nZ\n\n∞\n0\n\ndw1\n\nZ\n\n∞\n\n0\n\ndw2 (w1 w2 )∆−(d+1)/2 e−w1 |z\n\n2\n\n−(t−t′ )2 | −w2 |z 2 −t′2 |\n\ne\n\n.\n\n(2.4)\n\nThe ultraviolet limit corresponds to w1 → ∞, w2 → ∞. The integral is dominated in this case\n\nby null trajectories z = ±t′ and z = ±(t− t′ ). If t = 0, the two classes of null trajectories become\n\ndegenerate and there is a singularity. In the presence of a mirror, we can consider a null ray going\nfrom the boundary to the mirror and back as part of a single trajectory, so in some heuristic\nsense the two null trajectories also become degenerate when t = 2z0 . In the following we will\n\nshow that this intuitive picture gives the correct answer by computing explicitly two-point Green\nfunctions in the field theory.\nThe field theory correlator G(k) as a function of the four-momentum k can be computed\nfrom the on-shell action for classical solutions of the bulk field φk (z). The result is a boundary\nterm\nG(k) ∼ lim\n\nz→0\n\n√\n\n−gg zz φk (z)φ′k (z) .\n\n(2.5)\n\nFor simplicity, we will consider zero spatial momentum and modes with fixed frequency φ(t, z) =\ne−iωt φ(z). The equations of motion for the field are\n\u0001\n(\u0003 − m2 ) φ = 0 ⇒ z d+1 ∂z z 1−d φ′ (z) + (z 2 ω 2 − ∆(∆ − d))φ(z) = 0 .\n\n(2.6)\n\nIn order to regularize, we introduce a cutoff at z = ǫ, ǫ → 0, such that φ(ǫ) = 1. The solution\nis given in terms of Bessel functions. Imposing Dirichlet boundary conditions on the field at\n\u00012\n2\nz = z0 and using ν 2 = m2 + d4 = ∆ − d2 ,\nφ(z) =\n\nz d/2 (Yν (ωz0 )Jν (ωz) − Jν (ωz0 )Yν (ωz))\n.\nǫd/2 (Yν (ωz0 )Jν (ωǫ) − Jν (ωz0 )Yν (ωǫ))\n\n(2.7)\n\nWe then introduce this expression in (2.5) and take the limit ǫ → 0. Up to contact terms, the\nGreen function is given by\n\nG∆ (ω) = c∆ ω 2ν\n\nYν (ωz0 )\n.\nJν (ωz0 )\n\n(2.8)\n\n\fIf ν is an integer, there are extra logarithmic terms that cancel the branch cut in Yν (ωz0 ) when\nω → 0. As an example, in AdS5 a massless scalar field gives\n\u0013\n\u0012\n\u0003\n\u0002\nπY2 (ωz0 )\n2\n4\n.\n− log (ωz0 )\nG4 (ω) = c4 ω\nJ2 (ωz0 )\n\n(2.9)\n\nApart from a possible branch cut coming from the ω 2ν factor, the only singularities of the\nGreen function are poles ωn on the real frequency axis, associated to the zeroes of the Bessel\nfunction\nJν (ωn z0 ) = 0, n = 1, 2, 3 . . .\n\n(2.10)\n\nSince Jν (−x) = (−1)ν Jν (x), the poles are paired ωn and −ωn .\nWe are interested in the ultraviolet behaviour of the correlator and how it is related to lightlike propagation in the bulk, so we take the ω → ∞ limit. Then, (2.8) can be approximated\nby\n\nG∆ (ω) ≃ c∆ ω\n\n2ν\n\n\u0013 \u0015\n\u0012\n1 π\n.\ntan ωz0 − ν −\n2 2\n\u0014\n\nThe asymptotic position of the poles is therefore\n\u0013\n\u0012\nπ\n1 π\nωn z0 = (2n + 1) + ν −\n≡ nπ + ω0 z0 , n ∈ Z .\n2\n2 2\n\n(2.11)\n\n(2.12)\n\nTo show explicitly the relation with null trajectories is more convenient to look at the timedependent propagator.\nG∆ (t) =\n\nZ\n\ndωe−iωt G∆ (ω) .\n\n(2.13)\n\nC\n\nFor the Feynman propagator, the contour C in the complex frequency plane is defined in such a\n\nway that it picks up all the positive frequencies for t ≥ 0 and the negative frequencies for t < 0,\n\nso it passes slightly above the real axis for ω > 0 and slightly below for ω < 0. Above some\n\nfrequency ωk , the position of the poles will be well approximated by the asymptotic expression\n(2.12), so the propagator would have a piece coming form the lowest modes plus the contribution\nfrom the infinite high-frequency modes. For t ≥ 0, we find\n+\n2ν −iω0 t\nG+\n∆,F (t) ≃ GF,IR (t) + 2πic∆ (i∂t ) e\n\n∞\nX\n\ne−iπnt/z0 =\n\nn=k\n\ne−i(k−1)πt/z0\n.\n(2.14)\neiπt/z0 − 1\nWe can understand this expression as being defined using the usual prescription for spacetime2ν −iω0 t\n= G+\nF,IR (t) + 2πic∆ (i∂t ) e\n\ndependent correlators t → t − i0+ . Strictly speaking, the expression above is well defined only\n\nwhen 2ν is an integer (ν ≥ 0 by unitarity). When this is not the case, there will be a branch\ncut that must be taken properly into account. This will introduce power-like corrections, but\n\nthe location of the singularities of the propagator in time is determined by the sum over highfrequency poles. For t < 0\n−\n2ν iω0 t\nG−\n∆,F (t) ≃ GF,IR (t) − 2πic∆ (−i∂t ) e\n\ne−i(k−1)πt/z0\n.\neiπt/z0 − 1\n\n(2.15)\n\n\fWe can see now that the singularities associated to the ultraviolet behaviour of the Feynman\npropagator appear at regular intervals of time\nt = 2nz0 , n ∈ Z .\n\n(2.16)\n\nThe identification of these singularities with the singularities on the null trajectories of the bulk\npropagator leads to the geometric interpretation of a light ray bouncing on and off from the\nboundary at z = 0 and the mirror at z = z0 , if we take t = 0 as the 'initial point'. The points\nwhere the ray reaches the boundary coincide with the singularities in the time-dependent Green\nfunction, see figure 1.\nz = zo\n\nz=0\nt=0\n\nt = 2 zo\n\nt = 4 zo\n\nFigure 1: Null geodesic bouncing on and off from the boundary at z = 0 and the mirror surface at\nz = z0 .\n\n3\n\nThe eikonal approximation in AdS black holes\n\nIn black hole backgrounds, the absorption of classical fluctuations of the fields is described by\nan infinite set of modes with complex frequencies, known as the quasinormal modes. In the\nholographic dual the frequencies of these modes correspond to singularities of the two-point\ncorrelators, that are in last instance responsible for the dissipative behaviour of the thermal\ntheory. The relation between null trajectories ending on the boundary and the high frequency\nbehaviour of the correlators strongly suggests that the analytic continuation of the space behind\nthe horizon can explain the asymptotic location of quasinormal frequencies or equivalently, the\nsingularities of the dual correlators in complex frequency and time.\nThe eikonal approximation is a high frequency limit where ω ≫ R and R is the typical\n\ncurvature of the spacetime. This approximation leads to the classical limit of geometric optics\n\nin the curved spacetime, similar to ray optics in ordinary electromagnetism. The null trajectories\nwe want to describe start at the AdS boundary and propagate into the interior until they hit the\nsingularity. Presumably it should be possible to extend the geodesic to the asymptotically AdS\nregion behind the horizon by joining it to a null ray that starts at the singularity and continues\ntowards the second boundary. However, the eikonal approximation is expected to fail at the\nsingularity, so it is a matter of concern what is the fate of solutions there. In the following,\nwe construct the classical solutions in the eikonal approximation in the two asymptotically AdS\nregions and find the matching conditions at the future and past singularities.\nIn the eikonal approximation, an ansatz for the field is\nφ(x) = A(x)eiθ(x) ,\n\n(3.1)\n\n\fwhere the eikonal phase θ(x) is O(ω) and the amplitude A(x) is O(1). We consider a scalar field\nwith the Klein-Gordon equation of motion\n\u0001\n√\n1\n−gg μν ∂ν φ − m2 φ = 0 .\n(\u0003 − m2 ) φ = 0 ⇒ √ ∂μ\n−g\n\n(3.2)\n\nExpanding this equation in ω, we find that the leading order gives the eikonal equation\ng μν ∂μ θ∂ν θ = 0 ,\n\n(3.3)\n\nso k μ = ∂ μ θ is a null vector field. It defines a family of null geodesics tangent to the field and\nin electromagnetism it can also be identified with the four-momentum of the photons. Notice\nthat the mass is neglected in this approximation, it will appear as a lower energy effect, while\nthe leading behaviour is universal. The next orders give the equations\n1\n− ∂μ k μ A ,\n2\n0.\n\nk μ ∂μ A =\n(\u0003 − m2 ) A =\n\n(3.4)\n\nThe first equation describes the evolution of the amplitude along the geodesic, while the last\nstart to take into account subleading effects like the mass.\nTo work out the eikonal approximation we will use the Rosen coordinate system, that is\nbetter adapted to null geodesics. A nice explanation of coordinate systems adapted to the\nPenrose limit can be found in [19] and an example of its application to the eikonal expansion\nin [20]. The AdSd+1 black hole metric is (d ≥ 2)\nds2 = −f (r)dt2 +\n\n2\n\n1\ndr2\n+ r2 dx2 , f (r) = r2 − d−2 .\nf (r)\nr\n\n(3.5)\n\nWe will consider only geodesics at a fixed point in the spatial directions x, so in terms of the\naffine parameter u they are determined by two functions (t(u), r(u)). These functions can be\nfound by solving the variational problem with Lagrangian\n\u0012\n\u0013\n1\nṙ2\n2\nL=\n−f (r) ṫ +\n2\nf (r)\n\n(3.6)\n\nwhere ṫ, ṙ are the first derivatives with respect to u. The variation with respect to t introduces\na conserved quantity E, so that\nṫ =\n\nE\n.\nf (r)\n\n(3.7)\n\nFor null geodesics we can further impose the condition L = 0, so we find\nṙ2 = f (r)2 ṫ2 = E 2 .\n\n(3.8)\n\nThis also implies that r̈ = 0. In the Rosen coordinate system we take the affine parameter of the\nnull geodesics u to be one of the coordinates, while we introduce another coordinate v satisfying\n2 We\n\nhave taken the AdS radius R = 1, and the coordinates are rescaled as (t, r, x) → (t/rH , rH r, x/rH ).\n\nRestoring the units, the Hawking temperature of the black hole is T = drH /4πR2 .\n\n\fthe null condition g μν ∂μ v∂ν v = 0 and that corresponds to the Hamilton-Jacobi function of the\nvariational problem. We have several possibilities\n1) E > 0, ṙ = −E\n\nu = −r\n\n3) E < 0, ṙ = −E\n\nu=r\n\n2) E > 0, ṙ = E\n4) E < 0, ṙ = E\n\nu=r\n\nu = −r\n\nv = −t −\n\nv = −t +\nR\nv =t+\nR\nv =t−\n\ndr\nf (r)\ndr\nf (r)\ndr\nf (r)\ndr\nf (r)\n\nR\n\nR\n\n(3.9)\n\nThe choices of coordinates 1) and 4) correspond to geodesics starting at the boundary u = −∞\n\nand reaching the singularity at u = 0. On the other hand, 2) and 3) correspond to geodesics\nthat go from the singularity at u = 0 to the boundary at u = ∞. Geodesics described by 1)\nand 2) go forwards in time while the ones described by 3) and 4) go backwards. The metric in\nRosen coordinates is\nds2 = 2dudv − f± (u)dv 2 + u2 dx2 , f± (u) = u2 −\n\n(±1)d−2\n,\nud−2\n\n(3.10)\n\nwhere f+ (u) = f (u) is valid for 2) and 4), while for 1) and 3) we have f− (u), instead. This\ndistinction is important only when d is odd, since when d is even f− (u) = f+ (u) = f (u).\nWe can now write the eikonal ansatz (3.1) as φ(u, v) = A(u)eiωv and expand in inverse\npowers of the frequency\nφ(u, v) = A0 (u)e\n\niωv\n\n\u0013\n\u0012\nA1 (u) A2 (u)\n+ ... .\n+\n1+\niω\n(iω)2\n\n(3.11)\n\nPlugging back in the equation of motion (3.2), we see that the eikonal equation (3.3) is automatically satisfied by our choice of v. The next orders in the expansion (3.4) have the following\nsolution to O(1/ω)\nA0 (u) =\nA1 (u) =\n\n(−g)−1/4 = u(1−d)/2 ,\n1 2\nd − 1 1−d\n(d − 1 + 4m2 )u − (±1)d−2\nu\n,\n8\n8\n\n(3.12)\n\nwhere the + solution applies for geodesics 2) and 4), while the − is valid for 1) and 3). Then,\n\nchoosing the correct definition of v and the correct sign in A1 (u), the solution (3.11) describes\n\nthe four possible geodesics given by (3.9).\nThis solution is valid as long as ud−1 ω ≫ 1 and u/ω ≪ 1, so it will stop to be trustable when\n\nwe get close to the singularity u = 0 or the boundary u → ∞. There is an extra issue concerning\nthe definition of v in (3.9). The function f (r) has a pole at r = 1, so in general v will be shifted\n\nby a complex value for r < 1. This could be compensated by defining v differently for r > 1 and\nr < 1 with a compensating constant in this region. The right treatment pass by using Kruskal\ncoordinates, we will analyze this more thoroughly in section 4.\n\n3.1\n\nMatching of eikonal solutions and bouncing rays\n\nThere are two possible descriptions of a ray bouncing on the boundary, one joining the geodesics\nassociated to 2) with 1) in (3.9) or the time reversed process joining 3) with 4). In terms of the\n\n\feikonal approximation we should find a matching when we continue the solutions close to the\nboundary.\nAt large values of the radial coordinate r the black hole factor can be neglected f (r) ≃ 1 and\n\nit is better to switch to the coordinate system focused on the boundary (2.1). In this case, the\nright identification of eikonal phases will be\n1) eiωv ∼ e−iω(t+r) ∼ e−iω(t−z)\n\n2) eiωv ∼ e−iω(t−r) ∼ e−iω(t+z)\n\n3) eiωv ∼ eiω(t+r) ∼ eiω(t−z)\n\n4) eiωv ∼ eiω(t−r) ∼ eiω(t+z)\n\nFrom section 2 we know that the solutions close to the boundary are Bessel functions. To match\nwith the plane wave behaviour of 2), we take the combination that gives the second Hankel\nfunction\nφ(2) ≃ e−iωt Hν(2) (ωz) ∼ e−iω(t+z) , ωz ≫ 1 .\n\n(3.13)\n\nWe can treat the bouncing on the boundary as the continuation of this solution to negative\nvalues of z, z → −z, that we should interpret as a parity transformation of the solutions in the\n\nz direction. Under this transformation, the solution changes to the first Hankel function, that\nshows the right asymptotic behaviour to match with the eikonal solution of 1)\nφ(1) ≃ e−iωt Hν(1) (ωz) ∼ e−iω(t−z) .\n\n(3.14)\n\nThe time reversed process can be found using the transformation t → −t, so it works in the\n\nsame way, the initial solution is\n\nφ(3) ≃ eiωt Hν(2) (ωz) ∼ eiω(t−z) ,\n\n(3.15)\n\nwhile the reflected one is found again by analytic continuation z → −z\nφ(4) ≃ eiωt Hν(1) (ωz) ∼ eiω(t+z) .\n\n(3.16)\n\nWe are interested now in rays coming from the boundary that bounce on the future singularity\nand rays coming from the region behind the horizon that bounce on the past singularity. The\nexpansion of the amplitude (3.11) fails close to the singularity ud−1 ω < 1. However, the ansatz\n(3.1) in the form φ = A(u)eiωv gives still valid solutions to the equations of motion. We can\nsolve the Klein-Gordon equation as a Frobenius expansion, being the general solution of the\nform\nA(u) = C1 y1 (u) + C2 [y2 (u) + log u y1 (u)] ,\n\n(3.17)\n\nwhere y1 (u) and y2 (u) are series expansions in the u coordinate. For d ≥ 2 we find\ny1 (u) =\ny2 (u) =\n\n3ω 2\niω d−1 m2 d\nu2(d−1) + . . .\nu\n− 2u −\nd−1\nd\n4(d − 1)2\niω d−1 d2 − (d − 2)m2 d (4 − 3d)ω 2 2(d−1)\n1+\nu +\nu\n+ ...\nu\n+\nd−1\nd3\n4(d − 1)3\n\n1+\n\n(3.18)\n\n\fTo describe the bouncing on the singularity we need to extend the geodesic associated to 1) and\ndefined for u < 0 to positive values of the affine parameter. In the original coordinates, r is\nextended to negative values. The eikonal phase does not change, but the branch cut appearing\nin (3.17) implies that the amplitude will in general pick up a non-trivial phase factor. In order to\nunderstand the extended solution from the point of view of an observer in the second boundary,\nwe must change r → −r keeping u > 0. The time runs forwards for an observer in the second\nboundary, so there is no time reversal. The solution is then of the type 2), so we come to a\n\nsituation analogous to the starting one and we can use the results we have already obtained\nto describe the bouncing on the second boundary and on the past singularity, that from this\nperspective looks like a future singularity.\n\n4\n\nBlack holes as reflecting cavities\n\nWe have shown that in the high frequency limit, the eikonal approximation provides a good\ndescription of classical solutions in the bulk, and that the matching conditions at the boundary\nand singularities are consistent with a limit where a geometric description can be given in terms\nof null rays bouncing on the boundaries and singularities, so the black hole looks effectively as a\nbox. We have also related null geodesics reaching the boundary with ultraviolet singularities in\nthe time-dependent correlators of the dual field theory and hence with the asymptotic location\nof singularities in the high frequency limit. We will now proceed to study null geodesics in the\nblack hole in order to extract information about the singularity structure of the correlators in\nthe thermal field theory.\nConsider a geodesic starting at the AdS boundary, bouncing on the singularity and reaching\nthe AdS boundary behind the horizon. This corresponds to the analytic extension to positive\nvalues of u for the case 1) in (3.9). Notice that v will be shifted in general due to the contribution\nR\nfrom dr/f (r). In order to keep a constant eikonal phase, the value of t has to be shifted as\nwell as part of the analytic continuation. We find then\nZ ∞\ndu\n.\n∆t =\nf\n−∞ (u)\n\n(4.1)\n\nThe function f (u) has two poles at the horizon u = ±1, since for d odd we must switch between\n\nf− (u) and f+ (u). The contour we pick pass above the first pole at u = −1 and below the second\npole at u = 1. Then, using the expression\n\n1\n1\n= P ± iπδ(x) ,\nx ∓ iǫ\nx\nthe shift in time on the AdS boundary behind the horizon is\n\u0011\nπ\n2π \u0010\ncot − i .\n∆t =\nd\nd\n\n(4.2)\n\n(4.3)\n\nWe have seen that the geodesic coming from the region behind the horizon after bouncing on the\npast singularity is equivalent to the one we have just described. We can also consider geodesics\ngoing backwards in time using the analytic extension of 3), as well as a contour that surrounds\n\n\fthe poles at the horizon in the opposite way. We can then identify the complex values of time\nwhere the geodesics hit one of the AdS boundaries with the location of singularities of field\ntheory correlators in the complex time plane. The time coordinate is given in dimensionless\nunits, in order to restore the temperature dependence β = 1/T , we must divide by the radius of\nthe horizon rH = 4π/dβ. For the lowest dimensional AdSd+1 spaces, the singularities tn , n ∈ Z\n\nare at\n\ntn = i nβ\n2\u0010\n\u0011\nnβ √1\n±\ni\ntn = 2\n3\n\nAdS2+1\nAdS3+1\nAdS4+1\n\ntn =\n\nnβ\n2 (1\n\n(4.4)\n\n± i)\n\nThe value of the imaginary part can be understood in terms of the Wick rotation of the metric\nto Euclidean time (c.f. [4]), where it can be seen that the second boundary of AdS corresponds\nto the antipodal point in the thermal circle, with β being the full period. The value of the\nreal part can also be understood in simple geometric terms. For this purpose, the best suited\ncoordinate system are Kruskal coordinates\nU =e\n\n2(t+r∗ )\n\n, V = −e\n\nwith a metric\n\n−2(t−r∗ )\n\n, r∗ =\n\nZ\n\ndr\n.\nf (r)\n\n(4.5)\n\n−dU dV\n+ r2 (U V )dx2\n4U V f (U V )\n\nds2 =\n\n(4.6)\n\nIn AdS3 , the metric takes the particularly simple form\n−dU dV\n+\nds =\n4(1 + U V )2\n2\n\n\u0012\n\n1 − UV\n1 + UV\n\n\u00132\n\ndx2 .\n\n(4.7)\n\nThe black hole does not cover the entire (U, V ) plane, but it is limited by the asymptotic AdS\nboundary and by the singularity. They can be deduced from the conditions r2 (U V ) → ∞ and\n\nr2 (U V ) → 0, using the relation\n\nU V = −e4r∗ (r) .\n\n(4.8)\n\nFor instance,\nAdSd+1\n\nsingularity\n\nboundary\n\nd=2\n\nUV = 1\n\nU V = −1\n\nd=3\n\nUV = e\n\nd=4\n\nUV = 1\n\n2π\n√\n3 3\n\nU V = −e\n\n(4.9)\n\n2π\n√\n3\n\nU V = −eπ\n\nThe real value of the position of the singularities tn in the complex time plane can be found following the path of null geodesics in the Kruskal diagram, and using that t = log(−U/V )/4. The\nnull geodesics bounce on the boundaries and the singularities, giving the picture of a reflecting\ncavity. Following figure 2, the points where the singularities are located are\nAdSd+1\nd=2\nd=3\nd=4\n\n(U, V ) : t = 0 → singularity → boundary\n(e\n\nπ\n√\n3\n\n, −e\n\n(1, −1) → (1, 1) → (−1, 1)\n\nπ\n√\n3\n\n) → (e\n\nπ\n√\n3\n\n,e\n\nπ\n− 3√\n3\n\n) → (−e\n\n(e 2 , −e 2 ) → (e 2 , e− 2 ) → (−e\nπ\n\nπ\n\nπ\n\nπ\n\n7π\n√\n3\n\n3π\n2\n\n,e\n\nπ\n− 3√\n3\n\n, e− 2 )\nπ\n\n⇒ Re t = 0\n\n) ⇒ Re t =\n⇒ Re t =\n\n2π\n√\n3 3\nπ\n2\n\n(4.10)\n\n\fIn agreement with eq. (4.3). From this formula we can also do a Fourier transformation to\ndeduce the asymptotic quasinormal frequencies, up to a shift that depends on the mass of the\nfield considered. The general formula is\n\u0011\n\u0010\nπ\nπ\nωn ≃ 4πT cot ± i sin2 n ,\nd\nd\n\n(4.11)\n\nthat coincides with the results found in [21, 22] using a WKB approximation to the equations of\nmotion in the AdS black hole backgrounds.\nU\n\nV\n\nt = (cot π /d−i) β\n\nt=0\nt = (cot π /d−i) β /2\n\nFigure 2: Kruskal diagram of a eternal black hole in AdS space. The light solid line represents a\nnull geodesic starting on the boundary at t = 0 bouncing on the future singularity, on the second AdS\nboundary, on the past singularity and back to the boundary at t = (cot\n\n5\n\nπ\nd\n\n− i)β.\n\nDiscussion\n\nUsing the eikonal approximation, we have seen that the asymptotic formula for the quasinormal\nspectrum of fields with large mass in AdS black holes is also valid for fields with small mass in the\nlarge frequency limit. The analytic formula derived for the the asymptotic value of quasinormal\nfrequencies (4.11), agrees with the expressions found in [21, 22] using a WKB analysis, and with\nexpressions derived for fields with large mass [16–18] and for fields with small mass in AdS2+1\n√\n√\nωn ≃ 4πiT n [12], the numerical results in AdS3+1 ωn ≃ ( 3 ± 3i)πT n = 34 ( 3 ± 3i)n rH [23]\nand AdS4+1 ωn ≃ 2πiT n(1 ± i) [11].\n\nAn interesting question is whether a geometric analysis of null geodesics in the analytic\nextension of the black hole could be applied to more general cases, like charged or rotating black\nholes or black holes with different asymptotics. A simple example is the topological AdS4+1\nblack hole of [24]3 , where the (t, r) part of the metric is the same as AdS2+1 , so the zeromomentum quasinormal spectrum will have the same asymptotic behaviour. In the dual theory,\nthe correlators are then similar to a free theory, in contrast with the non-extremal black hole.\nThis could be related to the fact that the topological black hole corresponds to D3 branes in the\nMilne universe, so non-renormalization theorems could still hold. The non-extremal black hole,\non the other hand, corresponds to a high temperature phase of the theory.\n3 We\n\nwould like to thank P. Kumar for pointing out this example to us.\n\n\fIn this analysis the AdS boundary has played a crucial role since it is there where the value\nof the quasinormal modes is determined. Other geometries, like asymptotically flat spacetimes,\ndo not have a similar boundary, making more difficult to find a similar prescription. Although in\nprinciple there could be a description of extended null geodesics bouncing on the singularities, it\nis not clear that they can return in the way they do in AdS spacetimes. Nevertheless addressing\nthis issues could give interesting results.\nThe relation between null geodesics and the high-frequency singularities of the dual correlators also gives a good starting point to solve the inverse holographic problem: how to construct\na gravitational background from the field theory. The information contained in the location of\nthe singularities in time is quite topological, it only knows about the causal structure of the\nspace-time. Interesting ideas related to the emergence of the causal structure of the bulk from\nthe field theory can also be found in [25, 26]. For operators with large conformal dimension, the\ngeodesic approximation could be used to gather more information, see [27] for instance.\nLet us now discuss the holographic interpretation of the black hole computation for Green\nfunctions in the thermal field theory. The relation between the Schwinger-Keldysh path and\nthe second boundary of the eternal black hole was pointed out in [10]. The analysis shows that\nthere is only one SK path consistent with the prescription of [28] to compute the retarded Green\nfunction, corresponding to the symmetric choice\n(0, t) → (t, t − iβ/2) → (t − iβ/2, −iβ/2) → (−iβ/2, −iβ) .\nIn the thermal field theory, the SK correlator is built introducing insertions of operators at\nIm t = 0 or Im t = −iβ/2, so it is a matrix with components\nGSK (t) =\n\nGF (t)\n\nG< (t + iβ/2)\n\nG> (t − iβ/2)\n\nGF (t)†\n\n!\n\n.\n\nWhere G> (t), G< (t) are the Wightman Green functions and GF (t) is the time-ordered (Feynman) correlator. The short-time singularity of Green functions, together with the KMS relation4\nG> (t) = G< (t + iβ) ,\nimply that the SK correlator should have singularities on the time imaginary axis. Since for\nd > 2 we find no such singularities, this means that the singularities associated to null rays\nshould correspond to the commutator, that is the spectral function. This is consistent with the\nidentification of the singularities of frequency-dependent correlators with quasinormal modes.\nThe singularities of frequency-dependent thermal correlators computed from holography turn\nout to be poles, indicating that there is always an exponential decay with time. For fields\nwith larger conformal dimensions the location of the poles is modified due to the shift of the\nquasinormal spectrum. Also notice that all this analysis has been made at zero momentum. At\nnon-zero momentum the singularities of the spectral function move in the complex frequency\nplane, but they remain as poles, in contrast with Green functions at weak coupling where poles\n4 Which\n\ncan be derived from the periodicity in imaginary time of Euclidean correlators.\n\n\fopen up in branch singularities. Also in [29] it was argued that higher curvature corrections in\nthe bulk, that correspond to quantum corrections in the field theory, do not change the nature\nof the singularities. On the other hand the analysis of [30] shows that subleading corrections in\nthe large-N expansion can introduce power-like tails in time. These corrections correspond to\nquantum corrections in the bulk, so it would be interesting to analyze Green functions in the\nblack hole background beyond the classical approximation.\n\nAcknowledgments: We want to thank T. Hollowood, P. Kumar, K. Landsteiner, C. Nuñez,\nG. Shore and D.T. Son for useful comments and discussions. I. Amado also wants to thank the\nhospitality of the Physics Department of Swansea University. I. A. is supported by grant BES2007-16830 and by the Plan Nacional de Altas Energı́as FPA-2006-05485, FPA-2006-05423 and\nEC Commission under grant MRTN-CT-2004-005104.\n\nReferences\n[1] J. M. Maldacena, Adv. Theor. Math. Phys. 2 (1998) 231 [Int. J. Theor. Phys. 38 (1999)\n1113];\n[2] S. S. Gubser, I. R. Klebanov and A. M. Polyakov, Phys. Lett. B 428 (1998) 105;\n[3] E. Witten, Adv. Theor. Math. Phys. 2, 253 (1998)\n[4] J. M. Maldacena, JHEP 0304 (2003) 021 [arXiv:hep-th/0106112].\n[5] V. Balasubramanian, P. Kraus, A. E. Lawrence and S. P. Trivedi, Phys. Rev. D 59, 104021\n(1999) [arXiv:hep-th/9808017].\n[6] G. T. Horowitz and D. Marolf, JHEP 9807, 014 (1998) [arXiv:hep-th/9805207].\n[7] B. G. Carneiro da Cunha, Phys. Rev. D 65, 026001 (2002) [arXiv:hep-th/0105219].\n[8] W. Israel, Phys. Lett. A 57 (1976) 107.\n[9] M. Le Bellac, Thermal Field Theory, (Cambridge University Press, UK, 2000) 270 p.\n[10] C. P. Herzog and D. T. Son, JHEP 0303 (2003) 046 [arXiv:hep-th/0212072].\n[11] G. T. Horowitz and V. E. Hubeny, Phys. Rev. D 62, 024027 (2000) [arXiv:hep-th/9909056].\nA. O. Starinets, Phys. Rev. D 66 (2002) 124013;\nA. Nunez and A. O. Starinets, Phys. Rev. D 67 (2003) 124013\nP. K. Kovtun and A. O. Starinets, Phys. Rev. D 72, 086009 (2005) [arXiv:hep-th/0506184].\n[12] D. Birmingham, I. Sachs and S. N. Solodukhin, Phys. Rev. Lett. 88 (2002) 151301;\n[arXiv:hep-th/0112055]. V. Cardoso and J. P. S. Lemos, Phys. Rev. D 63 (2001) 124015\n[arXiv:gr-qc/0101052].\n\n\f[13] V.\n\nBalasubramanian\n\nand\n\nS.\n\nF.\n\nRoss,\n\nPhys.\n\nRev.\n\nD\n\n044007\n\n61,\n\n(2000)\n\n[arXiv:hep-th/9906226].\n[14] J. Louko,\n\nD. Marolf and S. F. Ross,\n\nPhys. Rev. D 62,\n\n044041 (2000)\n\nPhys.\n\n124022 (2003)\n\n[arXiv:hep-th/0002111].\n[15] P.\n\nKraus,\n\nH.\n\nOoguri and\n\nS.\n\nShenker,\n\nRev.\n\nD\n\n67,\n\n[arXiv:hep-th/0212277].\n[16] L. Fidkowski, V. Hubeny, M. Kleban and S. Shenker, JHEP 0402 (2004) 014\n[arXiv:hep-th/0306170].\n[17] G. Festuccia and H. Liu, JHEP 0604 (2006) 044 [arXiv:hep-th/0506202].\n[18] V. E. Hubeny, H. Liu and M. Rangamani, JHEP 0701 (2007) 009 [arXiv:hep-th/0610041].\n[19] M. Blau, http://www.unine.ch/phys/string/Lecturenotes.html.\n[20] T. J. Hollowood and G. M. Shore, arXiv:0806.1019 [hep-th].\n[21] V. Cardoso,\n\nJ. Natario and R. Schiappa,\n\nJ. Math. Phys. 45 (2004) 4698\n\n[arXiv:hep-th/0403132].\n[22] J.\n\nNatario\n\nand\n\nR.\n\nSchiappa,\n\nAdv.\n\nTheor.\n\nMath.\n\nPhys.\n\n8\n\n(2004)\n\n1001\n\n[arXiv:hep-th/0411267].\n[23] V. Cardoso, R. Konoplya and J. P. S. Lemos, Phys. Rev. D 68, 044024 (2003)\n[arXiv:gr-qc/0305037].\n[24] V. Balasubramanian, K. Larjo and J. Simon, Class. Quant. Grav. 22, 4149 (2005)\n[arXiv:hep-th/0502111].\n[25] D. N. Kabat and G. Lifschytz, JHEP 9905, 005 (1999) [arXiv:hep-th/9902073].\n[26] G. T. Horowitz and N. Itzhaki, JHEP 9902, 010 (1999) [arXiv:hep-th/9901012].\n[27] M. Porrati and R. Rabadan, JHEP 0401 (2004) 034 [arXiv:hep-th/0312039].\n[28] D. T. Son and A. O. Starinets, JHEP 0209 (2002) 042 [arXiv:hep-th/0205051].\n[29] S. A. Hartnoll and S. Prem Kumar, JHEP 0512 (2005) 036 [arXiv:hep-th/0508092].\n[30] P. Kovtun and L. G. Yaffe, Phys. Rev. D 68 (2003) 025007 [arXiv:hep-th/0303010].\n\n\f"}