{"id": "http://arxiv.org/abs/1105.1481v2", "guidislink": true, "updated": "2011-05-15T15:49:28Z", "updated_parsed": [2011, 5, 15, 15, 49, 28, 6, 135, 0], "published": "2011-05-08T00:15:16Z", "published_parsed": [2011, 5, 8, 0, 15, 16, 6, 128, 0], "title": "Hydrodynamic Interaction between the Be Star and the Pulsar in the TeV\n  Binary PSR B1259-63/LS 2883", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1105.4273%2C1105.2056%2C1105.0282%2C1105.1786%2C1105.3350%2C1105.4597%2C1105.0586%2C1105.6100%2C1105.3950%2C1105.1760%2C1105.1103%2C1105.3027%2C1105.2322%2C1105.5147%2C1105.3985%2C1105.5285%2C1105.4357%2C1105.1255%2C1105.2859%2C1105.4305%2C1105.1880%2C1105.5197%2C1105.5263%2C1105.5782%2C1105.1347%2C1105.1314%2C1105.4299%2C1105.3812%2C1105.2716%2C1105.1141%2C1105.5938%2C1105.3692%2C1105.1331%2C1105.3316%2C1105.0946%2C1105.2759%2C1105.1282%2C1105.1060%2C1105.3458%2C1105.3081%2C1105.3430%2C1105.3060%2C1105.0497%2C1105.2659%2C1105.0438%2C1105.0486%2C1105.0334%2C1105.1382%2C1105.4925%2C1105.2769%2C1105.0863%2C1105.6296%2C1105.0800%2C1105.3138%2C1105.4816%2C1105.3311%2C1105.0613%2C1105.4746%2C1105.0105%2C1105.2923%2C1105.1264%2C1105.2289%2C1105.4400%2C1105.0147%2C1105.2784%2C1105.0788%2C1105.1291%2C1105.0984%2C1105.2517%2C1105.5350%2C1105.4687%2C1105.0980%2C1105.2148%2C1105.5901%2C1105.3577%2C1105.2861%2C1105.1673%2C1105.5775%2C1105.3697%2C1105.3850%2C1105.3386%2C1105.1844%2C1105.0987%2C1105.1151%2C1105.4200%2C1105.1971%2C1105.5581%2C1105.5936%2C1105.3243%2C1105.0635%2C1105.2712%2C1105.6105%2C1105.4589%2C1105.1481%2C1105.1296%2C1105.4917%2C1105.1230%2C1105.4319%2C1105.3743%2C1105.4455%2C1105.5215&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Hydrodynamic Interaction between the Be Star and the Pulsar in the TeV\n  Binary PSR B1259-63/LS 2883"}, "summary": "We study the interaction between the Be star and the pulsar in the TeV binary\nPSR B1259-63/LS 2883, using 3-D SPH simulations of the tidal and wind\ninteractions in this Be-pulsar system. We first run a simulation without pulsar\nwind nor Be wind, taking into account only the gravitational effect of the\npulsar on the Be disk. In this simulation, the gas particles are ejected at a\nconstant rate from the equatorial surface of the Be star, which is tilted in a\ndirection consistent with multi-waveband observations. We run the simulation\nuntil the Be disk is fully developed and starts to repeat a regular tidal\ninteraction with the pulsar. Then, we turn on the pulsar wind and the Be wind.\nWe run two simulations with different wind mass-loss rates for the Be star, one\nfor a B2V type and the other for a significantly earlier spectral type.\nAlthough the global shape of the interaction surface between the pulsar wind\nand the Be wind agrees with the analytical solution, the effect of the pulsar\nwind on the Be disk is profound. The pulsar wind strips off an outer part of\nthe Be disk, truncating the disk at a radius significantly smaller than the\npulsar orbit. Our results, therefore, rule out the idea that the pulsar passes\nthrough the Be disk around periastron, which has been assumed in the previous\nstudies. It also turns out that the location of the contact discontinuity can\nbe significantly different between phases when the pulsar wind directly hits\nthe Be disk and those when the pulsar wind collides with the Be wind. It is\nthus important to adequately take into account the circumstellar environment of\nthe Be star, in order to construct a satisfactory model for this prototypical\nTeV binary.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1105.4273%2C1105.2056%2C1105.0282%2C1105.1786%2C1105.3350%2C1105.4597%2C1105.0586%2C1105.6100%2C1105.3950%2C1105.1760%2C1105.1103%2C1105.3027%2C1105.2322%2C1105.5147%2C1105.3985%2C1105.5285%2C1105.4357%2C1105.1255%2C1105.2859%2C1105.4305%2C1105.1880%2C1105.5197%2C1105.5263%2C1105.5782%2C1105.1347%2C1105.1314%2C1105.4299%2C1105.3812%2C1105.2716%2C1105.1141%2C1105.5938%2C1105.3692%2C1105.1331%2C1105.3316%2C1105.0946%2C1105.2759%2C1105.1282%2C1105.1060%2C1105.3458%2C1105.3081%2C1105.3430%2C1105.3060%2C1105.0497%2C1105.2659%2C1105.0438%2C1105.0486%2C1105.0334%2C1105.1382%2C1105.4925%2C1105.2769%2C1105.0863%2C1105.6296%2C1105.0800%2C1105.3138%2C1105.4816%2C1105.3311%2C1105.0613%2C1105.4746%2C1105.0105%2C1105.2923%2C1105.1264%2C1105.2289%2C1105.4400%2C1105.0147%2C1105.2784%2C1105.0788%2C1105.1291%2C1105.0984%2C1105.2517%2C1105.5350%2C1105.4687%2C1105.0980%2C1105.2148%2C1105.5901%2C1105.3577%2C1105.2861%2C1105.1673%2C1105.5775%2C1105.3697%2C1105.3850%2C1105.3386%2C1105.1844%2C1105.0987%2C1105.1151%2C1105.4200%2C1105.1971%2C1105.5581%2C1105.5936%2C1105.3243%2C1105.0635%2C1105.2712%2C1105.6105%2C1105.4589%2C1105.1481%2C1105.1296%2C1105.4917%2C1105.1230%2C1105.4319%2C1105.3743%2C1105.4455%2C1105.5215&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We study the interaction between the Be star and the pulsar in the TeV binary\nPSR B1259-63/LS 2883, using 3-D SPH simulations of the tidal and wind\ninteractions in this Be-pulsar system. We first run a simulation without pulsar\nwind nor Be wind, taking into account only the gravitational effect of the\npulsar on the Be disk. In this simulation, the gas particles are ejected at a\nconstant rate from the equatorial surface of the Be star, which is tilted in a\ndirection consistent with multi-waveband observations. We run the simulation\nuntil the Be disk is fully developed and starts to repeat a regular tidal\ninteraction with the pulsar. Then, we turn on the pulsar wind and the Be wind.\nWe run two simulations with different wind mass-loss rates for the Be star, one\nfor a B2V type and the other for a significantly earlier spectral type.\nAlthough the global shape of the interaction surface between the pulsar wind\nand the Be wind agrees with the analytical solution, the effect of the pulsar\nwind on the Be disk is profound. The pulsar wind strips off an outer part of\nthe Be disk, truncating the disk at a radius significantly smaller than the\npulsar orbit. Our results, therefore, rule out the idea that the pulsar passes\nthrough the Be disk around periastron, which has been assumed in the previous\nstudies. It also turns out that the location of the contact discontinuity can\nbe significantly different between phases when the pulsar wind directly hits\nthe Be disk and those when the pulsar wind collides with the Be wind. It is\nthus important to adequately take into account the circumstellar environment of\nthe Be star, in order to construct a satisfactory model for this prototypical\nTeV binary."}, "authors": ["Atsuo T. Okazaki", "Shigehiro Nagataki", "Tsuguya Naito", "Akiko Kawachi", "Kimitake Hayasaki", "Stanley P. Owocki", "Jumpei Takata"], "author_detail": {"name": "Jumpei Takata"}, "author": "Jumpei Takata", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1093/pasj/63.4.893", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1105.1481v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1105.1481v2", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "10 pages, 5 figures, accepted for publication in PASJ", "arxiv_primary_category": {"term": "astro-ph.HE", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "astro-ph.HE", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1105.1481v2", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1105.1481v2", "journal_reference": null, "doi": "10.1093/pasj/63.4.893", "fulltext": "PASJ: Publ. Astron. Soc. Japan , 1–??,\nc 2018. Astronomical Society of Japan.\n\nHydrodynamic Interaction between the Be Star and the Pulsar in the\nTeV Binary PSR B1259−63/LS 2883\nAtsuo T. Okazaki\nFaculty of Engineering, Hokkai-Gakuen University, Toyohira-ku, Sapporo 062-8605, Japan\nokazaki@elsa.hokkai-s-u.ac.jp\n\narXiv:1105.1481v2 [astro-ph.HE] 15 May 2011\n\nShigehiro Nagataki\nYukawa Institute for Theoretical Physics, Oiwake-cho, Kitashirakawa, Sakyo-ku, Kyoto 606-8502, Japan\n\nTsuguya Naito\nFaculty of Management Information, Yamanashi Gakuin University, Kofu, Yamanashi 400-8575, Japan\n\nAkiko Kawachi\nDepartment of Physics, Tokai University, Hiratsuka, Kanagawa 259-1292, Japan\n\nKimitake Hayasaki\nDepartment Astronomy, Kyoto University, Oiwake-cho, Kitashirakawa, Sakyo-ku, Kyoto 606-8502, Japan\n\nStanley P. Owocki\nBartol Research Institute, University of Delaware, Newark, DE 19716, USA\n\nand\nJumpei Takata\nDepartment of Physics, University of Hong Kong, Pokfulam Road, Hong Kong, China\n(Received ; accepted )\n\nAbstract\nWe study the interaction between the Be star and the pulsar in the TeV binary PSR B1259−63/LS 2883,\nusing 3-D SPH simulations of the tidal and wind interactions in this Be-pulsar system. We first run a\nsimulation without pulsar wind nor Be wind, taking into account only the gravitational effect of the pulsar\non the Be disk. In this simulation, the gas particles are ejected at a constant rate from the equatorial\nsurface of the Be star, which is tilted in a direction consistent with multi-waveband observations. We run\nthe simulation until the Be disk is fully developed and starts to repeat a regular tidal interaction with the\npulsar. Then, we turn on the pulsar wind and the Be wind. We run two simulations with different wind\nmass-loss rates for the Be star, one for a B2V type and the other for a significantly earlier spectral type.\nAlthough the global shape of the interaction surface between the pulsar wind and the Be wind agrees with\nthe analytical solution, the effect of the pulsar wind on the Be disk is profound. The pulsar wind strips off\nan outer part of the Be disk, truncating the disk at a radius significantly smaller than the pulsar orbit. Our\nresults, therefore, rule out the idea that the pulsar passes through the Be disk around periastron, which\nhas been assumed in the previous studies. It also turns out that the location of the contact discontinuity\ncan be significantly different between phases when the pulsar wind directly hits the Be disk and those\nwhen the pulsar wind collides with the Be wind. It is thus important to adequately take into account the\ncircumstellar environment of the Be star, in order to construct a satisfactory model for this prototypical\nTeV binary.\nKey words: gamma rays: theory – stars: emission-line, Be – stars: winds, outflows – stars: individual\n(B 1259−63)\n1.\n\nIntroduction\n\nPSR B1259−63/LS 2883 is a massive binary system\nconsisting of a 48-ms radio pulsar and a Be star with a circumstellar disk (Johnston et al. 1992). The system is one\nof only three binaries from which periodic TeV gamma-ray\nemission has been detected (the others are LS I +61−303\nand LS 5039; e.g., Paredes 2008). Among these TeV\ngamma-ray binaries, PSR B1259−63/LS 2883 has several\ndistinctive properties. First, the compact star of this system is identified as a radio pulsar, namely neutron star,\nwhile the nature of the compact object of the other two\nsources is still under debate. Second, the orbital period\n\n(3.4 yr) is very long compared to the other systems (3.9 d\nfor LS 5039 and 26.5 d for LS I +61 303), and the eccentricity is so high that the binary separation at periastron is\nless than a tenth of that at apastron (Johnston et al. 1994).\nThird, nonthermal emission is detected in X-ray and radio\nwave bands as well, and light curves of all bands including TeV gamma-rays exhibit multiple-peaked features, in\nmost cases one before periastron and another after it, although the curves differ orbit to orbit (Chernyakova et al.\n2009; Aharonian et al. 2009).\nConsidering the passage of the neutron star through a\nmisaligned Be disk, shock acceleration in the disk-pulsar\ninteraction region has been proposed as the mechanism\n\n\f2\n\nA. T. Okazaki et al.\n\nfor double-peaked light curves. Modeling of gamma-ray\nemission was first discussed by Tavani et al. (1994) for\nMeV energies following the CGRO observation. They\nconsidered shock acceleration in the interaction region,\nand showed that the double-peaked feature appeared in\nX-ray and MeV gamma-ray ranges. Much theoretical\nwork for high-energy emissions followed (e.g. Tavani &\nArons 1997; Ball & Kirk 2000; Murata et al. 2003) and\nthe emission in TeV energy range has been discussed in\nBall & Kirk (2000) in particular. Assuming a disk-like\noutflow around the Be star, Kawachi et al. (2004) proposed a double-peaked light curve in TeV range, which\nwas followed by the TeV gamma-ray detection with a\nmarginal pre-periastron peak and a clear post-periastron\npeak (Aharonian et al. 2005). As shown in the radio observations, the light curve varies from orbit to orbit and\nthe TeV double-peak was not clearly seen in the next 2007\nperiastron passage. Aharonian et al. (2009) suggests that\nthe detection of the TeV emission 50 days prior to the\nperiastron disfavors that the pulsar-disk interaction is the\nprimary TeV emission mechanism.\nIt can be pointed out that all the previous theoretical\nstudies have either neglected the recent progress in Be star\nresearch and adopted an out-of-dated view of the Be disk\nor neglected even the presence of the Be disk. Given that\nthe gas pressure in the Be disk is much higher than the\nram pressure of the Be wind, it is important to take into\naccount the interaction between the pulsar wind and the\nBe disk adequately. In this series of papers, we will study\nthe high energy emission from PSR B1259−63/LS 2883,\nfor the first time based on 3-D numerical simulations with\nthe latest model of the Be disk. As a first step, this paper\nexplores the hydrodynamic interaction between the pulsar\nwind and the circumstellar environment of the Be star.\nThe structure of the paper is as follows. In section 2,\nwe first describe the Be disk model and the numerical\nmethod. We then discuss the viscous evolution of the Be\ndisk under the tidal interaction with the pulsar, based on\nsimulations where only the tidal interaction is taken into\naccount. In section 3, we show the results from simulations that also take account of both the pulsar wind and\nthe Be wind, and examine the effects of the pulsar wind on\nthe circumstellar environment of the Be star. In section 4,\nwe discuss implications for multi-wavelength observations\nand summarize the conclusions.\n2.\n2.1.\n\nTidal Effect of the Pulsar on the Be Disk\nViscous decretion disk model for Be stars\n\nIn this subsection, we briefly summarize key observational features of Be stars and describe the up-to-date\nmodel of the Be disk that is widely accepted in the Be star\ncommunity (see Porter & Rivinius 2003 for more detailed\ndescriptions of Be stars and their circumstellar disks).\nA Be star has a two-component extended atmosphere, a\npolar wind region and an equatorial disk region. The former consists of a low-density fast flow (∼ 103 kms−1 ) emitting UV radiation. The wind structure is well explained\nby the line-driven wind model (Castor et al. 1975; Friend\n\n[Vol. ,\n\n& Abbott 1986). On the other hand, the equatorial disk\nconsists of a high-density plasma, from which the optical\nemission lines and the IR excess arise. The relationship\nbetween the disk size resolved with the optical interferometers (Quirrenbach et al. 1994; Quirrenbach et al. 1997)\nand the separation of the two peaks of the Hα line profile\nis in agreement with that expected for a Keplerian disk.\nThe outflow in the Be disk is very subsonic. Hanuschik\n(1994, 2000) and Waters & Marlborough (1994) showed\nthat the radial velocity of the disk is smaller than a few\nkm s−1 , at least within ∼ 10 stellar radii. Thus, it is unlikely that the Be disk is formed by channeling/focusing\nof the polar wind. Indeed, it is established that the Be\ndisk cannot be modeled as a low velocity wind.\nOne model which can reproduce all key features of the\nBe disk and is thus widely accepted, is the viscous decretion disk model proposed by Lee et al. (1991) and developed by Porter (1999) and others (Okazaki 2001, 2007;\nCarciofi & Bjorkman 2006; Carciofi 2010). The model assumes that the star can eject material with the Keplerian\nvelocity at the stellar equatorial surface. The ejected material then drifts outward by viscous diffusion and forms\na geometrically thin Keplerian disk. Recent Monte Carlo\nrediative transfer simulations show that such a disk has\na temperature approximately constant at ∼ 60% of the\nstellar effective temperature, except in an inner opticallythick region where the disk is significantly cooler (Carciofi\n& Bjorkman 2006). It should be noted that the viscous\ndecretion disk model also provides a firm basis for the\nstudy of tidal interaction between the Be disk and the\nneutron star in Be/X-ray binaries (Negueruela & Okazaki\n2001; Okazaki & Negueruela 2001).\n2.2.\n\nNumerical model\n\nThe simulation presented below was performed with\na three dimensional Smoothed Particle Hydrodynamics\n(SPH) code. The code is basically the same as that used\nby Okazaki et al. (2002) (see also Bate et al. 1995). Using\na variable smoothing length, the SPH equations with a\nstandard cubic-spline kernel are integrated with an individual time step for each particle. In our code, the Be\ndisk is modeled by an ensemble of gas particles with negligible self-gravity. For simplicity, the gas particles are\nassumed to be isothermal at 0.6 Teff with Teff being the\neffective temperature of the Be star. On the other hand,\nthe Be star and the neutron star are represented by sink\nparticles with the appropriate gravitational mass. Gas\nparticles that fall within a specified accretion radius are\naccreted by the sink particle.\nIn simulations shown in this section, the numerical viscosity is adjusted so as to keep the Shakura-Sunyaev viscosity parameter αSS = 0.1, using the approximate relation\nαSS = 0.1 αSPH h/H and βSPH = 0 (Okazaki et al. 2002),\nwhere αSPH and βSPH are the artificial viscosity parameters 1 , and h and H are the smoothing length of individual\n1\n\nThe artificial viscosity commonly used in SPH consists of two\nterms: a term that is linear in the velocity differences between\nparticles, which produces a shear and bulk viscosity, and a term\nthat is quadratic in the velocity differences, which is needed to\n\n\fNo. ]\n\nHydrodynamic Interaction in the TeV Binary PSR B1259−63/LS 2883\n\n3\n\nTable 1. Model parameters\n\nFig. 1. The model configuration of the VHE gamma-ray binary PSR B1259−63/LS 2883. The binary orbit is in the x-y\nplane. The polar axis of Be star is tilted by 45◦ to the z-axis\nand has 19◦ of azimuth of tilt to the x-axis.\n\nparticles and the scale-height of the Be decretion disk, respectively. No effect of pulsar wind or Be wind is taken\ninto account in these simulations.\nWe set the binary orbit in the x-y plane with the major axis along the x-axis. At t = 0, the pulsar is at the\napastron (Phase = 0.5). It orbits about the Be star with\nthe orbital period Porb = 1236.79 d and the eccentricity\ne = 0.87. It has long been expected that the Be disk is\ninclined from the orbital plane, because the pulsed radio\nemission disappears for about five weeks centered on the\nepoch of periastron, e.g., ∼ 18 d prior to the 2004 periastron through ∼ 16 d after it (Johnston et al. 2005). We set\nthe tilt angle between the binary orbital axis and the Be\nstar's polar axis to 45◦ as a parameter and the azimuth\nof tilt, i.e., the azimuthal angle of the Be star's polar axis\nfrom the x-axis (the direction of apastron) to 19◦ as suggested in Chernyakova et al. (2006) (see Fig. 1). In order\nto emulate the mass ejection from a Be star, we inject\ngas particles just outside the stellar equatorial surface at\nthe rate of 3.5 × 10−9M⊙ yr−1 , which gives rise to a typical disk base density of 10−11 g cm−3 . Once injected, gas\nparticles interact with each other. As a result, most injected particles fall onto the Be star by losing angular momentum, but a small fraction of particles drift outwards,\ngetting the angular momentum from the other particles,\nand form a disk.\nTable 1 summarizes the parameters adopted in the\nfollowing simulations. Note that not all parameters in\nTable 1 are independent. For instance, all Be disk parameters except for the tilt angles are derived from other\nparameters.\n2.3.\n\nLong-term evolution of the Be disk under no influence of the pulsar wind\n\nFigure 2 shows the evolution of surface density from t =\n0 to 12 Porb (panel a) and the disk structure at t = 12 Porb\n(panel b). In Fig. 2, the volume density is integrated vertically and averaged azimuthally, while the velocity components are averaged vertically and azimuthally. Figure 2(a)\nexhibits how a decretion disk forms if there is no influence of the pulsar wind. The disk density gradually\neliminate particle interpenetration in high Mach number shocks.\nThe parameters αSPH and βSPH control the linear and quadratic\nterms, respectively.\n\nBe star parameters\nMass of the Be star M∗ = 10 M⊙ a\nRadius of the Be star R∗ = 6 R⊙ a\nEffective temperature Teff = 22, 800 K b\nCritical velocity Vcrit (R∗ ) = 563.9 km s−1\nWind velocity Vwind = 103 km s−1\nWind mass-loss rate\n\u001a\n10−9 M⊙ yr−1 (\"weak′′ case)\nṀwind =\n10−8 M⊙ yr−1 (\"strong′′ case)\nMass injection rate to the disk\nṀdisk = 3.5 × 10−9M⊙ yr−1 c\nBe disk parameters\nDisk temperature Td = 13, 680 K d\nDisk thickness H(R∗ )/R∗ = 0.024\nSound speed cs = 13.8 km s−1\nInitial tilt angles: Misalignment by 45◦ from the binary orbital axis, with the polar axis projection of\n19◦ from apastron e (see Fig. 1)\nPulsar and orbital parameters\nPulsar wind power ĖPSR = 8.2 × 1035 erg s−1 a\nOrbital period Porb = 1236.79 d (= 3.386 yr) f\nOrbital eccentricity e = 0.87 a\nMass ratio q = 0.14 (MPSR = 1.4 M ⊙) a\nSemimajor axis a = 181.82 R∗ = 7.59 * 1013 cm a\na\nJohnston et al. (1994)\nb\nThe effective temperature of a B2V star (Cox 2000)\nc\nMass ejection rate that gives the typical disk base\ndensity of 10−11 g cm3\nd\nAssumed to be isothermal at 0.6 Teff (Carciofi &\nBjorkman 2006).\ne\nChernyakova et al. (2006)\nf\nTaken from Johnston et al. 1994. Recent timing\nanalyses give Porb = 1236.72 d (Wang et al. 2004).\nincreases with time and approaches an asymptotic distribution. The timescale of the disk growth is the viscous timescale, which is given by [αSS (H/r)2 ΩK ]−1 , where\nΩK = (GM∗ /R∗3 )1/2 is the Keplerian angular frequency.\nFor parameters summarized in Table 1, this timescale is\n∼ 12(α/0.1)−1(r/10R∗ )1/2 yr. Thus, at t ∼ 12Porb ∼ 40yr,\nthe disk is already fully developed, as seen in Fig. 2(a).\nWe also note from Fig. 2(a) that the disk extends beyond the periastron separation (r ∼ 24R∗ ) with no break\nin the radial density distribution. This suggests that the\nBe disk in long-period, highly-eccentric systems like PSR\nB1259−63 is not truncated solely by the tidal torques of\nthe neutron star, unlike disks in other Be-neutron star\nbinaries with shorter orbital periods and lower eccentricities. In such systems, the neutron star passes through,\nand thus strongly disturbs, the Be disk around every periastron passage, as we will see in section 2.4.\nAs discussed in section 2.1, the Be disk is Keplerian.\nFig. 2(b) shows that the angular velocity (the dashed line)\n\n\f4\n\nA. T. Okazaki et al.\n3.\n3.1.\n\nFig. 2. Left: Surface density evolution from t =0 to 12 in\nunits of Porb in a simulation where only the tidal interaction\nis taken into account. The interval of time between adjacent\ncontours is 2 (t = 2, 4, . . ., 12 from bottom). Right: Disk\nstructure at t = 12. The thick solid, dashed, and dash-dotted\nlines denote the surface density, the azimuthal velocity normalized by the stellar critical velocity, and the radial Mach\nnumber, respectively. For comparison, the Keplerian rotation\ndistribution is shown by the thin solid line. In both panels,\nthe density is integrated vertically and averaged azimuthally,\nwhile the velocity components are averaged vertically and azimuthally.\n\nfor r <\n∼ 100R∗ is indistinguishable from the Keplerian rotation (the thin solid line). The radial velocity, Vr , is very\nsubsonic. It increases with radius, but even at 100R∗, Vr\nis still of the order of ∼ 0.1cs ∼ 1 km s−1 , where cs is the\nisothermal sound speed in the Be disk. These are typical\nfeatures of viscous decretion disks around Be stars (e.g.,\nLee et al. 1991).\n2.4.\n\nTidal interaction around periastron passage\n\nFigure 3 provides snapshots over a month from 13 d before periastron passage (φ = 0.99) to 23 d after it (φ =\n0.02). The upper and lower panels show respectively the\ncolumn density in cgs units along the binary orbital axis\n(z-axis) and the minor axis of the binary orbit (y-axis).\nThe first disk-passing event of the pulsar starts about 20\ndays prior to periastron passage, while the second event\nstarts ∼ 12 days after it. Each event lasts for ∼ 2 weeks.\nAs seen in the figure, the Be disk is strongly disturbed\nby these events. The disk is temporarily warped at each\nof these events via the tidal interaction with the pulsar.\nAt the same time, the tidal interaction around periastron\nexcites a two-armed spiral wave, via which angular momentum is removed from the disk (see, e.g., Artymowicz\n& Lubow 1994). This angular momentum transfer causes\nshrinking of the Be disk. Its radius gradually recovers afterward by viscous diffusion (Okazaki et al. 2002). Note\nthat because of the cumulative effect of the tidal torques,\nthe disturbance in the Be disk is larger after periastron\npassage, despite that the distance between the Be disk\nand pulsar is closest at the first disk-passing event.\n\n[Vol. ,\n\nEffects of the Pulsar Wind on the\nCircumstellar Environment of the Be star\nNumerical setup\n\nIn order to see how the pulsar wind interacts with the\nBe disk and wind, we carried out simulations where both\nthe pulsar and Be winds are now taken into account, using the data from the above tidal simulation. In these new\nwind simulations, we turned on the pulsar and Be winds\nat a certain time, after the Be disk was fully developed\nin the tidal simulation. We started the wind simulation\nat t = 11.44 Porb , 74 days prior to periastron, much longer\nthan the crossing time of the Be wind over the simulation volume, ∼ 10 d. The relativistic pulsar wind crosses\nthe simulation volume much faster. Although in the following we model the pulsar wind by a flow with the nonrelativistic speed of 104 kms−1 , the crossing time for such\na slow wind is only ∼ 1 d. Therefore, the starting time\ndoes not matter as long as it is at least several tens of\ndays before periastron.\nIn the tidal simulation, we emulated the ShakuraSunyaev viscosity, adopting variable αSPH over space and\ntime and fixing βSPH to 0. In the wind simulation, however, this method would fail, allowing the particle interpenetration at strong shocks. Therefore, we adopted the\nstandard values of the artificial viscosity parameters in the\nwind simulation, i.e., αSPH = 1 and βSPH = 2. In the wind\nsimulations, the energy equation is also different from the\ntidal simulation. In the latter, the gas was assumed to\nbe isothermal, in order to emulate the temperature distribution in the Be disk. However, the purpose of the\nwind simulation is to study the structure of the wind-wind\nand wind-disk collisions. Therefore, in the wind simulation, we take account of optically thin radiative cooling.\nNumerical implementation of radiative cooling is done by\nadopting Townsend (2009)'s Exact Integration Scheme\nfor radiative cooling, with the cooling function generated\nwith CLOUDY 90.01 for an optically thin plasma with\nsolar abundances (Ferland 1996).\nWith a large binary separation, the winds are likely to\ncollide after the Be wind reaches a terminal speed. Thus,\nfor simplicity, we assume that the winds coast without any\nnet external forces, assuming in effect that gravitational\nforces are either negligible (i.e. for the pulsar wind) or\nare canceled by radiative driving terms (i.e. for the Be\nwind). The relativistic pulsar wind is emulated by a nonrelativistic 104 kms−1 wind with the adjusted mass-loss\nrate so as to give the same momentum flux as a relativistic\nflow with the assumed energy, as in Romero et al. (2007).\nIn the following, for simplicity, we assume that all\nthe spin down energy ĖPSR = 8.2 × 1035 erg s−1 goes\nto the kinetic energy of a spherically symmetric pulsar\nwind. We also assume the Be wind to be spherically\nsymmetric. Given a recent high-resolution spectroscopic\nstudy of LS 2883 suggesting a significantly earlier spectral type than the conventionally used spectral type B2V\n(Negueruela et al. 2011), we take two different values of\nmass-loss rates, 10−9 M⊙ yr−1 for the conventional spectral type B2V and 10−8 M⊙ yr−1 for an earlier spectral\n\n\fNo. ]\n\nHydrodynamic Interaction in the TeV Binary PSR B1259−63/LS 2883\n\n5\n\nFig. 3. Snapshots over a month around periastron passage for ρ0 = 10−11 g cm−3 , where ρ0 is the base density of the Be disk. The\nupper panels show the column density along the z-axis (binary orbital axis) in cgs units, while the lower panels the column density\nalong the y-axis (minor axis of the binary orbit). Annotated in each panel are the phase and time measured from periastron passage\nand the number of SPH particles.\n\ntype. The mass injection rate to the Be disk is fixed to\n3.5 × 10−9 M⊙ yr−1 .\n3.2.\n\nInteraction between the pulsar wind and the Be disk\nand wind\n\nOnce winds are turned on, the faster pulsar wind soon\nfills up the whole simulation volume of r ≤ a. Then,\nthe slower Be wind pushes the pulsar wind back to the\nradii where the ram pressures of both winds are balanced.\nWithout the Be disk, the shape of the interaction surface\nwould be determined by the wind-wind collision. A key\nparameter would, then, be the ratio of wind momentum\nfluxes, given by\nη=\n\nĖPSR\n,\nṀwind Vwind c\n\n(1)\n\nwhere Vwind and Ṁwind are the velocity and mass loss rate\nof the Be wind, respectively, and ĖPSR is the power of the\npulsar wind. Taking ĖPSR = 8.2 × 1035 erg s−1 for the\nspherically symmetric pulsar wind and Vwind = 103 km s−1\nas the velocity of the Be wind, we have η ∼ 4.3 for the\n\"weak\" wind case (Ṁwind = 10−9 M⊙ yr−1 ) and η ∼ 0.43\nfor the \"strong\" wind case (Ṁwind = 10−8 M⊙ yr−1 ). Note\nthat the pulsar wind dominates the Be wind in the former\ncase, while the Be wind is about twice stronger than the\npulsar wind in the latter case. Thus, having an accurate\nspectral type of the Be star is important to construct any\nsatisfactory model for this VHE gamma-ray binary.\nIn a simple 2D model that ignores orbital motion, the\nram pressure balance then implies that, for a binary separation D, the interface should be located at a distance\n\u001a\nD\n0.60D (strong wind)\nd=\n(2)\n√ ∼ 0.33D (weak wind)\n1+ η\nfrom the Be star (Stevens et al. 1992; Canto et al. 1996).\n\nIn adiabatic shocks, the interaction surface approaches a\ncone with the half opening angle,\n\u001a\n\u00011/4\n102◦ (strong wind)\n(3)\n∼\nθ = 2 tan−1 η\n69◦\n(weak wind)\n(Gayley 2009), measured from the Be star. Thus, the\nshock is wrapped around the Be star in the weaker wind\ncase, while it is around the pulsar in the stronger wind\ncase.\nIn PSR B1259−63/LS 2883, the presence of the Be disk\nadds extra complications in the interaction with the pulsar\nwind. Figure 4 shows how the interaction occurs around\nperiastron in the weak (upper figure) and strong (lower figure) wind simulations. In each figure, the upper and lower\npanels respectively present the column density along the\nz-axis (binary orbital axis) along the y-axis (minor axis\nor the binary orbit). The change in the Be disk structure\nfrom that in the tidal simulation (Fig. 3) is drastic. The\npulsar wind now strips off an outer part of the Be disk on\nthe side facing the pulsar, truncating it at a radius where\nthe gas pressure of the disk is roughly comparable to the\nram pressure of the pulsar wind. Since the pulsar wind\nhas a velocity component tangential to the line connecting the Be star and the pulsar, the material in the disk\noutside this truncation radius is pushed sideways, forming\na warped filament in the prograde direction. This feature\nis more remarkable in the weak wind simulation than in\nthe strong wind simulation, because, unlike in the latter\nsimulation, the Be wind in the former simulation is too\nweak to shield the disk from the pulsar wind.\nThe interaction between the pulsar wind and the Bestar circumstellar environment is more clearly seen in\nFig. 5, in particular in the upper panels, where the volume density in the binary orbital plane (upper panels)\nand along the disk mid-plane (lower panels) is shown at\nthe same phases as in Figs. 3 and 4. Comparing Fig.5(a)\n\n\f6\n\nA. T. Okazaki et al.\n\n[Vol. ,\n\n(a) Ṁwind = 10−9 M⊙ yr−1\n\n(b) Ṁwind = 10−8 M⊙ yr−1\n\nFig. 4. Snapshots over a month around periastron passage from simulations in which both the pulsar wind and the Be wind are taken\ninto account: (a) Ṁwind = 10−9 M⊙ yr−1 and (b) Ṁwind = 10−8 M⊙ yr−1 . The mass-loss rate via the Be disk is 3.5 × 10−9 M⊙ yr−1 ,\nwhere Ṁwind is the mass-loss rate through the Be wind. In each panel, N1 , N2 , and N3 annotated at the lower left corner are the\nnumbers of particles in the Be wind, the pulsar wind, and the Be disk, respectively.\n\nfor the weak wind case with Fig.5(b) for the strong wind\ncase, we note that the effect of the pulsar wind on the Be\ndisk depends on the relative strength of the Be wind. In\nthe case of weak Be wind, the Be disk is not only truncated\nbut also strongly deformed by the pulsar's ram pressure\naround periastron. In contrast, little deformation is seen\nin the case of strong Be wind, where the Be wind shields\nthe Be disk from the pulsar wind.\nIn both simulations, the truncation of the Be disk is\nso efficient that the disk has a sharp density drop at the\nouter radius. At phases of closest encounter of the pulsar\nwith the disk outer radius, the density at the outer radius\nis enhanced by the shock by a factor of several, as seen in\nthe lower panels of Fig. 5. This sharp truncation of the\n\nBe disk is likely a characteristic to be seen only in systems\nconsisting of a Be star and an object with a strong wind.\nAlthough Be disks in binaries are, in general, tidally truncated, the density decrease beyond the disk outer radius\nis much more gradual in the tidal truncation. The density\ndrop near the central star is due to ablation by the Be\nwind.\nDespite these features related to the Be disk, the location and global shape of the interaction surface between\nthe pulsar wind and the circumstellar environment of the\nBe star, i.e., the Be disk and wind, is consistent with that\nexpected in the above analysis using a simple 2D model\nwithout the Be disk. We can see that in Fig. 5, where the\ndensity on the binary orbital plane is shown at the same\n\n\fNo. ]\n\nHydrodynamic Interaction in the TeV Binary PSR B1259−63/LS 2883\n\n7\n\n(a) Ṁwind = 10−9 M⊙ yr−1\n\n(b) Ṁwind = 10−8 M⊙ yr−1\n\nFig. 5. Snapshots of the volume density in the orbital plane (upper panels) and along the disk mid-plane (lower panels): (a)\nṀwind = 10−9 M⊙ yr−1 and (b) Ṁwind = 10−8 M⊙ yr−1 . In the lower panels of each figure, the x > 0 part corresponds to the x > 0\ndisk region (lower-right direction along the disk mid-plane) in the upper panels. Times of the plots are the same as in Figs. 3 and 4.\n\nphases as in Figs. 3 and 4, the apex location and conical shape of the interaction surface in the simulation, in\ngeneral, agree with those given by equations (2) and (3).\n4.\n\nSummary and Discussion\n\nIn this paper, we have numerically investigated the hydrodynamic interaction of the circumstellar environment\nof the Be star with the pulsar in the TeV binary PSR\nB1259−63/LS 2883. We have broken the computation\n\ninto two separate, but linked parts. The first part considers only the gravitational interaction with the pulsar,\nignoring the effects of both the pulsar and Be star winds.\nOne purpose of this part of simulation is to see how the\nBe disk evolves by the effect of viscosity and modulates by\nthe tidal interaction with the pulsar. The other purpose\nis to set up the initial configuration for the second part\nof simulation, which takes account of both pulsar and Be\nwinds.\nFrom the first part, we confirmed the viscous decretion\n\n\f8\n\nA. T. Okazaki et al.\n\ndisk scenario that the material ejected from the stellar\nequatorial surface drifts outward by the effect of viscosity,\nand forms a Keplerian disk. Note that the radial velocity\ncaused by viscous diffusion is very subsonic, so it takes\nmore than a decade for this very wide system to have a\nfully developed Be disk. Without the pulsar wind, the Be\ndisk is not truncated in such a highly eccentric system,\nunlike tidally truncated Be disks in binaries with lower\neccentricities. Then, the pulsar passes through the disk\ntwice an orbit, causing the tidal stream between the disk\nand the pulsar.\nThe second part focuses on the interaction between the\npulsar wind and the circumstellar material of the Be star\naround periastron. It shows that once winds from the\npulsar and the Be star are switched on, their effect soon\nbecomes apparent in the structure of the Be disk. The\npulsar truncates the Be disk on the side facing the pulsar,\nsweeping up an outer part to a dense filament. The resulting structure of the disk is strongly asymmetric and phase\ndependent. The size of the truncated disk is so small that\nthe pulsar never passes through the disk. Despite these\nfeatures, the location and global shape of the interaction\nsurface between the pulsar wind and the Be wind is well\ndescribed by a simple 2D model.\nWe performed numerical simulations of Newtonian hydrodynamics without magnetic fields, although both of\nrelativity and magnetic fields can play important roles on\nthe dynamics of the system. A highly relativistic pulsar\nwind was emulated by a Newtonian wind by equating its\nmomentum flux (thrust). Some studies of special relativistic hydrodynamic simulations show that highly supersonic\nflows display extended cocoons with high pressure (Martı́\net al. 1997), which correspond to the shocked pulsar\nwinds in this study. The cocoons (or pulsar winds) have\nsmoother local structure in relativistic simulations than in\nnon-relativistic simulations, because the inertia of a relativistic flow is smaller than that of a non-relativistic flow\nwith the same thrust (Rosen et al. 1999). The global\nstructure of the shocked pulsar wind, however, will not\nconsiderably be changed, since we have tuned the wind\nmomentum flux in the simulation identical to that of relativistic wind of PSR B1259-63. The overall structure of\nthe shock is basically determined by the balance of momentum fluxes of the flows. It is unlikely as well that\nthe magnetic fields strongly affects the overall interaction\nfeature, given that the kinetic energy is, in general, much\ngreater than the magnetic field energy in pulsar winds\nnear termination shocks (e.g. Kennel & Coroniti 1984).\nIntroduction of magnetic fields into the simulation, however, may be needed to study the local structure in detail\n(McKinney 2006; Kommisarov et al. 2009; Nagataki\n2009; Nagataki 2010). Therefore, it will be important to\nextend our code to a relativistic regime (e.g. Monaghan &\nPrice 2001; Ryu et al. 2006; Rosswog 2010) with magnetic fields (e.g. Price & Monaghan 2005) in the future\nso that we can self-consistently study these effects.\nIt is frequently discussed that the particle acceleration\nhappens at the shock in the pulsar wind side and the\naccelerated, non-thermal electron-positron pairs emit ra-\n\n[Vol. ,\n\ndio to X-ray photons through synchrotron radiation while\nVHE (GeV-TeV) gamma-rays are produced by inverseCompton scatterings of soft photons from the Be star\n(Tavani & Arons 1997; Sierpowska-Bartosik & Bednarek\n2008; Takata & Taam 2009; Naito et al. 2010). It is\nalso claimed that proton acceleration at the shock in the\nBe star side and VHE gamma-rays from pion decays that\nare produced through proton-proton interactions may be\nrelevant to explain VHE gamma-rays (Kawachi et al.\n2004; Chernyakova et al. 2006). From the point of view\nof the time-correlation among radio, X-rays, and VHE\ngamma-rays (Chernyakova et al. 2006), hadronic scenario\nmay be favored. This is because the anti-correlation of\nfluxes between synchrotron emission and inverse-Compton\nscatterings is expected for the leptonic scenario, which\nseems to contradict the observations (Tavani & Arons\n1997). To explain the observed correlation between X-ray\nand VHE emissions, therefore, Takata & Taam (2009)\ninvoked the scenario that the observed emission in different orbital phases emanate from different magnetic field\nlines, giving rise to the pulsar wind parameters changing with the orbital phase or that the power law index\nof the accelerated particles varies with the orbital phase.\nHowever, since these discussions depend on one-zone models adopted, the anti-correlation may not appear even for\nthe leptonic scenario when we investigate a more realistic\nsituation using the results from our simulations. For example, the previous leptonic models have assumed that\nthe pulsar is confined by the shock (Tavani & Arons\n1997; Takata & Taam 2009), whereas the result from\nthe present simulations suggests that the shock geometry\nis sensitive to the mass loss rate from the Be star and to\nthe orbital phase, as Figure 5 shows. It is thus essential to\ncalculate the high energy emission processes with a more\nrealistic situation. We are planning to investigate it as\nour next step.\nWhile a pulsar wind + stellar wind interaction model\nhas also been proposed for other high-mass binaries with\nGeV-TeV gamma-ray emission (e.g., LS I +61 303 and\nLS 5039), PSR B1259−63 is so far the only such system\nwith direct detection of pulsed radio emission. Johnston et\nal. (1996) showed that this radio emission disappears for a\nperiod of about 5 weeks centered on the periastron epoch\nof 1994 January 9. They attributed this as \"most likely\ndue to a combination of free-free absorption and severe\npulse scattering in the Be-star disc\". But note that GHz\nradio emission is expected also to undergo strong free-free\nabsorption by the much lower-density Be-star wind, since\nfor typical wind parameters, the associated free-free optical depth can be of several thousand at orbital distances\naround an AU [see, e.g., equation (4) of Torres (2010)]. As\nsuch, the detection of radio pulses in PSR B1259−63 may\nactually be due to an observer perspective that is nearly\naligned to the major axis of the binary orbit, such that\nduring most of the orbit around apastron, the observed\nradio emission propagates mostly through the low-density\nshock cone surrounding the relativistic pair wind. In this\nscenario, the disappearance of radio emission near periastron could actually be attributed to the rapid rotation of\n\n\fNo. ]\n\nHydrodynamic Interaction in the TeV Binary PSR B1259−63/LS 2883\n\nthe shock cone away from the viewer's line of sight, causing strong free-free attenuation of the radio emission by\nthe Be-star wind and its associated shock cone. A similar\nviewer perspective has been used to explain the severalweek-long attenuation of X-ray emission in the colliding\nwind binary η Carinae (Okazaki et al. 2008). Our future\nwork will further explore this shock-cone scenario as an\nalternative to the standard Be-disk attenuation model for\nthe periastron disappearance of pulsar radio emission.\nObservations of TeV binaries in high energy bands provide important information on the type of interaction and\nthe emission mechanisms. For TeV binaries with Be stars,\nhowever, the high energy bands are not the sole window to\nprobe these systems. As mentioned in section 2, the optical emission lines and infrared excess arise from the Be\ndisk, while the Be wind emits UV radiation. Observations\nin these bands are thus suitable to study the effects of the\npulsar wind on the circumstellar environment of the Be\nstar. Particularly, spectroscopic and polarimetric observations in the optical and infrared can provide valuable information on the structure and dynamics of the disturbed Be\ndisk, which gives clues for the interaction between the pulsar wind and the Be disk. UV observations, on the other\nhand, are adequate for studying the strongly asymmetric\nBe wind around periastron (see Fig. 5 for the asymmetric structure of the Be wind). For better understanding\nof TeV binaries with Be stars, including PSR B1259−63,\nmulti-band observations are highly desirable.\nWe thank Ignacio Negueruela and Mark Ribó for\nletting us know about their newly determined spectral type of LS 2883.\nThe SPH simulations were\nperformed on HITACHI SR11000 at the Information\nInitiative Center (iiC), Hokkaido university, Sapporo,\nJapan. This work was partially supported by the iiC\ncollaborative research program 2009-2010, the Grant-inAid for the Global COE Program \"The Next Generation\nof Physics, Spun from Universality and Emergence\" from\nthe Ministry of Education, Culture, Sports, Science and\nTechnology (MEXT) of Japan, and the Grant-in-Aid\nfor Scientific Research (18104003, 19047004, 19104006,\n19740100, 20540236, 21105509, 21540304, 22340045,\n22540243). SPO acknowledges partial support from\ngrant #NNX11AC40G from NASA's Astrophysics Theory\nProgram.\nReferences\nAharonian, F., Akhperjanian, A. G., Aye, K.-M.,& BazerBachi, A. R. 2005, A&A, 442, 1\nAharonian, F et al. 2009, A&A, 507, 389\nAlbert, J. et al. 2007, ApJ, 665, L51\nAntokhin, I. I., Owocki, S. P., & Brown, J. C. 2004, ApJ, 611,\n434\nArtymowicz P., Lubow S.H., 1994, ApJ, 421, 651\nBall, L., Kirk, J. G., 2000, Astropart. Phys., 12, 335\nBate M.R., Bonnell I.A., Price N.M., 1995, MNRAS, 285, 33\nBenz W., 1990, in Buchler J. R.,ed.,The Numerical Modelling\nof Nonlinear Stellar Pulsations. Kluwer, Dordrecht, p.269\n\n9\n\nBenz W., Bowers R.L., Cameron A.G.W., Press W.H., 1990,\nApJ, 348, 647\nCanto, J., Raga, A. C., & Wilkin, F. P. 1996, ApJ, 469, 729\nCarciofi, A. C. 2010, in C. Neiner, G. Wade, G. Meynet & G.\nPeters, eds., IAU Symp. 272, Active OB Stars: Structure,\nEvolution, Mass Loss & Critical Limits (Cambridge\nUniversity Press, Cambridge) in press\nCarciofi, A. C., Bjorkman, J.E. 2006, ApJ, 639, 1081.\nCastor, J. I., Abbott, D. C., & Klein, R.I. 1975, ApJ, 195, 157\nChernyakova, M., Neronov, A., Lutovinov, A., Rodriguez, J.,\nJohnston, S. 2006, MNRAS, 367, 1201.\nChernyakova, M., Neronov, A., Aharonian, F., Uchiyama, Y.,\n& Takahashi, T. 2009, MNRAS, 397, 2123.\nCox, A.N. 2000, in Allen's Astrophysical Quantities Fourth\nEdition (New York: Springer), p. 389\nFerland G.J., 1996, CLOUDY: 90.01\nFrank J., King A.R., Raine D.J., 2002, Accretion power in\nAstrophysics, 3rd edn. Cambridge Univ. Press, Cambridge\nFriend, D. B. & Abbott, D. C. 1986, ApJ, 311, 701\nGayley, K. G. 2009, ApJ, 703, 89\nHayasaki, K., Okazaki, A.T., 2006, MNRAS, 372, 1140\nHanuschik, R. W. 1994, in Balona, L. A., Henrichs, H. &\nLe Contel, J. M. ed. Pulsation, Rotation and Mass Loss\nof Early-Type Stars, IAU Symp. 162, Kluwer Academic\nPublishers, Dordrecht, p.399\nHanuschik, R.W. 2000, in Smith, M. A., Henrichs, H. F., &\nFabregat J. ed. Be Phenomenon in Early-Type Stars, IAU\nColloq. 175, ASP, San Francisco, p.518\nJohnston S., Manchester R.N., Lyne A.G., Bailes M., Kaspi\nV.M., Qiao G., D'Amico N., 1992, ApJ, 387, L37\nJohnston S., Manchester R.N., Lyne A., Nicastro, L.,\nSpyromilio, J., 1994, MNRAS, 268, 430\nJohnston S., Manchester, R. N., Lyne, A. G., D'Amico, N.,\nBailes, M., Gaensler, B. M., Nicastro, L., 1996, MNRAS,\n279, 1036\nJohnston S., Ball, L., Wang, N. & Manchester, R. N., 2005,\nMNRAS, 358, 1069\nKaspi, V.M. et al., 1995, ApJ, 453, 424\nKawachi, A. Naito, T., Patterson, J. R., et al. 2004, ApJ, 607,\n949\nKennel, C.F., Coroniti, F.V. 1984, ApJ, 283, 710\nKomissarov, S.S., Vlahakis, N., Königl, A., Barkov, M.V. 2009,\nMNRAS, 394, 1182\nLee, U., Saio, H., Osaki, Y., 1991, MNRAS, 250, 432\nMartı́, J.M., Müller, E., Font, J.A., Ibáñez, J.M., Marquina,\nA. 1997, ApJ, 479, 151\nMcKinney, J.C. 2006, MNRAS, 388, 1561\nMonaghan, J.J., Price, D.J., 2001, MNRAS, 328, 381\nMurata, K., Tamaki, H., Maki, H., Shibazaki, N., 2003, PASJ,\n55, 467\nNagataki, S. 2009, ApJ, 704, 937\nNagataki, S. 2010, PASJ, submitted (arXiv:1010.4964)\nNaito, T., Okazaki, A. T., Nagataki, S., Kawachi, A.,\nHayasaki, K., 2010, in ASP Conf. Series, High Energy\nPhenomena in Massive Stars (Astronomical Society of the\nPaci c, San Francisco), Vol. 422, p.69\nNegueruela I., Okazaki A.T., 2001, A&A, 369, 108\nNegueruela I., Ribó, M., Herrero, A., Lorenzo, J., Khangulyan,\nD., Aharonian, F.A., 2011, ApJ, 732, L10\nOkazaki, A. T., 2001, PASJ, 53, 119\nOkazaki, A. T., 2007, in ASP Conf. Series, Active OB\nStars: Laboratories for Stellar & Circumstellar Physics\n(Astronomical Society of the Pacific, San Francisco), p.230\n\n\f10\n\nA. T. Okazaki et al.\n\nOkazaki A.T., Bate M.R., Ogilvie G.I., Pringle J.E., 2002,\nMNRAS, 337, 967\nOkazaki A.T., Negueruela I., 2001, A&A, 377, 161\nOkazaki, A. T., Owocki, S. P., Russell, C. M. P., Corcoran, M.\nF. 2008, MNRAS, 388, L39\nParedes, J. M., 2008, AIP Conference Proceedings, Vol. 1085,\n157\nPrice, D.J., Monaghan, J.J., 2005, MNRAS, 364, 384\nPorter J.M. 1999, A&A, 348, 512\nPorter, J. M., Rivinius, Th. 2003, PASP, 115, 1153\nPringle J.E. 1991, MNRAS, 248, 754\nQuirrenbach et al. 1994\nQuirrenbach, A., Bjorkman, K. S., Bjorkman, J. E., Hummel,\nC. A., Buscher, D. F., Armstrong, J. T., Mozukewich, D.,\nElias, N. M. II., & Babler, B. L. 1997, ApJ, 479, 477\nRomero G.E., Okazaki A.T., Orellana M., Owocki S.P., 2007,\nA&A, 474, 15\nRosen, A., Hughes, P.A., Duncan, G.C., Hardee, P.E. 1999,\nApJ, 516, 729\nRosswog, S. 2010, arXiv:1005.1679\nRyu, D., Chattopadhyay, I., Choi, E. 2006, ApJS, 166, 410\nStevens, I. R., Blondin, J. M., & Pollock, A. 1992, ApJ, 386,\n265\nSierpowska-Bartosik, A., Bednarek, W. 2008, MNRAS, 385\n2279\nTakata, J., Taam, R. E. 2009, ApJ, 702, 100\nTavani, M., Arons, J. 1997, ApJ, 477, 439.\nTavani, M. Arons, J., Kaspi, V. M. 1994, ApJ, 433, L37\nTorres, D. F. 2010, arXiv:1008.0483\nTownsend, R.H.D., 2009, ApJS, 181, 391\nWang, N., Johnston, S., Manchester, R. N. 2004, MNRAS,\n351, 599\nWaters L. B. F. M., Marlborough J. M., 1994, in Balona L. A.,\nHenrichs H., Le Contel J. M., ed. Pulsation, Rotation and\nMass Loss of Early-Type Stars, IAU Symp. 162, Kluwer\nAcademic Publishers, Dordrecht, p.399\n\n[Vol. ,\n\n\f"}