{"id": "http://arxiv.org/abs/1103.5224v1", "guidislink": true, "updated": "2011-03-27T15:12:40Z", "updated_parsed": [2011, 3, 27, 15, 12, 40, 6, 86, 0], "published": "2011-03-27T15:12:40Z", "published_parsed": [2011, 3, 27, 15, 12, 40, 6, 86, 0], "title": "Efficiency of cyclic devices working with non-Boltzmannian fluids:\n  challenging the second principle of thermodynamics", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1103.3904%2C1103.5514%2C1103.5484%2C1103.5517%2C1103.2995%2C1103.0027%2C1103.6018%2C1103.2946%2C1103.0391%2C1103.6231%2C1103.2774%2C1103.4217%2C1103.5224%2C1103.1081%2C1103.1429%2C1103.3897%2C1103.4661%2C1103.0992%2C1103.2117%2C1103.3969%2C1103.1378%2C1103.2949%2C1103.1483%2C1103.5729%2C1103.0332%2C1103.0939%2C1103.2840%2C1103.4558%2C1103.2133%2C1103.5098%2C1103.4679%2C1103.5210%2C1103.2368%2C1103.5380%2C1103.5597%2C1103.2118%2C1103.5109%2C1103.2749%2C1103.0971%2C1103.3030%2C1103.4367%2C1103.5212%2C1103.5461%2C1103.2880%2C1103.5545%2C1103.4445%2C1103.4840%2C1103.6049%2C1103.1093%2C1103.1126%2C1103.2422%2C1103.5525%2C1103.5118%2C1103.2350%2C1103.1948%2C1103.6041%2C1103.1747%2C1103.2645%2C1103.4797%2C1103.0277%2C1103.1119%2C1103.0283%2C1103.4450%2C1103.4283%2C1103.3790%2C1103.1854%2C1103.4834%2C1103.0424%2C1103.5794%2C1103.1956%2C1103.0183%2C1103.3349%2C1103.0440%2C1103.4793%2C1103.2699%2C1103.2616%2C1103.4955%2C1103.1412%2C1103.5627%2C1103.4684%2C1103.5022%2C1103.0849%2C1103.2196%2C1103.2893%2C1103.5726%2C1103.5351%2C1103.2306%2C1103.1377%2C1103.5781%2C1103.4899%2C1103.5646%2C1103.2406%2C1103.3360%2C1103.3378%2C1103.4525%2C1103.2781%2C1103.1076%2C1103.1981%2C1103.2540%2C1103.2003%2C1103.3801&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Efficiency of cyclic devices working with non-Boltzmannian fluids:\n  challenging the second principle of thermodynamics"}, "summary": "According to classical Boltzmannian thermodynamics, the efficiency of a\ncyclic machine is strictly lower than one. Such a result is a straightforward\nconsequence of the second principle of thermodynamics. Recent advances in the\nstudy of the thermodynamics of long-range interacting system report however on\na rather intricate zoology of peculiar behaviors, which are occasionally in\ncontrast with customarily accepted scenarios, dueling with intuition and common\nsense. In this paper, a thermodynamical cycle is assembled for an ideal device\nworking with non-Boltzmaniann long-range fluid and operating in contact with\ntwo thermal reservoirs. The system is analytically shown to violate the second\nprinciple of thermodynamics, a phenomenon that ultimately relates to the\nexistence of regions with negative kinetic specific heat, in the canonical\nensemble for the system under scrutiny. We argue that the validity of the\nsecond principle of thermodynamics can be possibly restored, by revisiting the\ndefinition of canonical ensemble, as well as the Fourier law of heat transport,\nand consequently relaxing the constraint on the maximal efficiency as imposed\nby the Carnot theorem.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1103.3904%2C1103.5514%2C1103.5484%2C1103.5517%2C1103.2995%2C1103.0027%2C1103.6018%2C1103.2946%2C1103.0391%2C1103.6231%2C1103.2774%2C1103.4217%2C1103.5224%2C1103.1081%2C1103.1429%2C1103.3897%2C1103.4661%2C1103.0992%2C1103.2117%2C1103.3969%2C1103.1378%2C1103.2949%2C1103.1483%2C1103.5729%2C1103.0332%2C1103.0939%2C1103.2840%2C1103.4558%2C1103.2133%2C1103.5098%2C1103.4679%2C1103.5210%2C1103.2368%2C1103.5380%2C1103.5597%2C1103.2118%2C1103.5109%2C1103.2749%2C1103.0971%2C1103.3030%2C1103.4367%2C1103.5212%2C1103.5461%2C1103.2880%2C1103.5545%2C1103.4445%2C1103.4840%2C1103.6049%2C1103.1093%2C1103.1126%2C1103.2422%2C1103.5525%2C1103.5118%2C1103.2350%2C1103.1948%2C1103.6041%2C1103.1747%2C1103.2645%2C1103.4797%2C1103.0277%2C1103.1119%2C1103.0283%2C1103.4450%2C1103.4283%2C1103.3790%2C1103.1854%2C1103.4834%2C1103.0424%2C1103.5794%2C1103.1956%2C1103.0183%2C1103.3349%2C1103.0440%2C1103.4793%2C1103.2699%2C1103.2616%2C1103.4955%2C1103.1412%2C1103.5627%2C1103.4684%2C1103.5022%2C1103.0849%2C1103.2196%2C1103.2893%2C1103.5726%2C1103.5351%2C1103.2306%2C1103.1377%2C1103.5781%2C1103.4899%2C1103.5646%2C1103.2406%2C1103.3360%2C1103.3378%2C1103.4525%2C1103.2781%2C1103.1076%2C1103.1981%2C1103.2540%2C1103.2003%2C1103.3801&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "According to classical Boltzmannian thermodynamics, the efficiency of a\ncyclic machine is strictly lower than one. Such a result is a straightforward\nconsequence of the second principle of thermodynamics. Recent advances in the\nstudy of the thermodynamics of long-range interacting system report however on\na rather intricate zoology of peculiar behaviors, which are occasionally in\ncontrast with customarily accepted scenarios, dueling with intuition and common\nsense. In this paper, a thermodynamical cycle is assembled for an ideal device\nworking with non-Boltzmaniann long-range fluid and operating in contact with\ntwo thermal reservoirs. The system is analytically shown to violate the second\nprinciple of thermodynamics, a phenomenon that ultimately relates to the\nexistence of regions with negative kinetic specific heat, in the canonical\nensemble for the system under scrutiny. We argue that the validity of the\nsecond principle of thermodynamics can be possibly restored, by revisiting the\ndefinition of canonical ensemble, as well as the Fourier law of heat transport,\nand consequently relaxing the constraint on the maximal efficiency as imposed\nby the Carnot theorem."}, "authors": ["Duccio Fanelli", "Giovanni De Ninno", "Alessio Turchi"], "author_detail": {"name": "Alessio Turchi"}, "author": "Alessio Turchi", "arxiv_comment": "6 pages, 3 figures", "links": [{"href": "http://arxiv.org/abs/1103.5224v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1103.5224v1", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "cond-mat.stat-mech", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cond-mat.stat-mech", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1103.5224v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1103.5224v1", "journal_reference": null, "doi": null, "fulltext": "Efficiency of cyclic devices working with non-Boltzmannian fluids: challenging the\nsecond principle of thermodynamics\n\narXiv:1103.5224v1 [cond-mat.stat-mech] 27 Mar 2011\n\nD. Fanelli1 , G. De Ninno2,3 , A. Turchi4\n1. Dipartimento di Energetica \"S. Stecco\" and INFN,\nUniversity of Florence, Via S. Marta 3, 50139 Florence, Italy\n2. Sincrotrone Trieste, S.S. 14 km 163.5, Basovizza (Ts), Italy\n3. Physics Department, Nova Gorica University, Nova Gorica, Slovenia\n4. Dipartimento di Sistemi e Informatica and INFN,\nUniversity of Florence, Via S. Marta 3, 50139 Florence, Italy\nAccording to classical Boltzmannian thermodynamics, the efficiency of a cyclic machine is strictly\nlower than one. Such a result is a straightforward consequence of the second principle of thermodynamics. Recent advances in the study of the thermodynamics of long-range interacting system\nreport however on a rather intricate zoology of peculiar behaviors, which are occasionally in contrast\nwith customarily accepted scenarios, dueling with intuition and common sense. In this paper, a thermodynamical cycle is assembled for an ideal device working with non-Boltzmaniann long-range fluid\nand operating in contact with two thermal reservoirs. The system is analytically shown to violate\nthe second principle of thermodynamics, a phenomenon that ultimately relates to the existence of\nregions with negative kinetic specific heat, in the canonical ensemble for the system under scrutiny.\nWe argue that the validity of the second principle of thermodynamics can be possibly restored, by\nrevisiting the definition of canonical ensemble, as well as the Fourier law of heat transport, and\nconsequently relaxing the constraint on the maximal efficiency as imposed by the Carnot theorem.\nPACS numbers:\n\nThe second principle of thermodynamics represents a\nfundamental milestone of physics [1]. It is a principle,\nand as such cannot be proven on a rigorous mathematical basis. Its validity is however supported by an impressively large gallery of experimental facts and consequently assurged to the status of inviolable universal\nlaw. It admits different formulations, the first of which\nis credited to the German physicist Rudolf Clausius [2]:\nNo process is possible whose sole result is the transfer of\nheat from a body of lower temperature to a body of higher\ntemperature. This in turn traces back to the concept\nof irreversibility: the heat cannot flow from cold to hot\nregions without external work being performed on the\nsystem, as e.g. it happens in a refrigerator.\nAn alternative formulation of the second principle due\nto the Irish physicist Lord Kelvin [3] recites instead: No\nprocess is possible in which the sole result is the absorption of heat from a reservoir and its complete conversion\ninto work. In practice, one cannot entirely transform the\nheat absorbed by a reservoir into work, without dissipating part of it. Rephrasing the latter statement: it\nis thermodynamically impossible to obtain a 100 % efficiency from a cyclic heat engine.\nIndeed, Carnot's theorem [4] limits the maximum efficiency η for any possible engine, and can be seen as a\ndirect byproduct of the second principle. All irreversible\nheat engines operating between two heat reservoirs, respectively characterized by thermodynamic temperatures\nTC (cold) and TH (hot), are less efficient than a Carnot\nengine working in contact with the very same reservoirs.\nThe Carnot maximal efficiency can be straightforwardly\nquantified in η = 1 − TC /TH as discussed in any basic\ntextbooks.\n\nThe validity of the second principle of thermodynamic\nreflects, as a corollary, the impossibility of realizing perpetual motion of the second kind. This undisputed verdict is recognized by the whole scientific community, despite the fact that the pursuit of perpetual motion remains a popular subject of speculations. If such a device\nexisted, it could transform heat into useful work, without requiring any dissipative losses, a procedure that is\nultimately against the second law.\nAs already emphasized, the above picture is at core\nof our current understanding of physics, it appears to\nbe solidly grounded on experiments and no doubt is\ncast on its correctness. Recently, however, a large body\nof evidence has emerged which testifies on the peculiar\nand rather unintuitive thermodynamic properties of long\nrange interacting systems [5]. Microcanonical and canonical statistical ensemble can be inequivalent, an intriguing\nphenomenon that has been associated to e.g. negative\n(microcanonical) specific heat [6, 7] and susceptibility\n(for magnetic-like systems) [8, 9]. In classical thermodynamics, the specific heat measures the energy required\nto increase the temperature of a unit quantity of a substance by a unit of (thermodynamic) temperature. As\ncommon sense dictates, providing energy to the system\nshould induce heating, meaning an increase in the system\ntemperature. At odd with intuition, non-Boltzmannian\nsystems (as those displaying long range traits) can cool\ndown when forced to increase their internal energy. The\ncanonical specific heat is however always positive [10],\na mathematical constraint that descends from statistical mechanics. For non-Boltzmannian systems, however,\nthe kinetic temperature differs from the thermodynamic\none, the former providing a direct measure of microscopic\n\n\f2\nagitation. By elaborating on this scenario, it was demonstrated [11] that negative kinetic specific heat can be\nmeasured in the canonical statistical ensemble. In fact,\ndue to a complex self-organized interplay between collective and microscopic degrees of freedom, the particles\nbelonging to the system under scrutiny can gain in kinetic\nenergy when an energy quota is passed from the system\nto the heat reservoir. The opposite holds when the energy\nis instead released from the thermostat to the system. In\nreference [11], it was speculated that this peculiar prerogative traces back to the non-Boltzmanniann (equilibrium) character of the particles' statistics. This could\neventually open up the perspective of realizing novel,\nmore efficient thermal devices.\nThis paper is devoted to shed light onto such an issue, elucidating on a viable direction of investigation of\nparamount importance for both applied and fundamental research. Working within a paradigmatic mean field\nmodel, and assuming the conventional definition of the\ncanonical ensemble, we rigorously show that a thermodynamic device operating with a non-Boltzmannian fluid\ncan be conceived, which violates the second law of thermodynamics. The only possibility we see to reconcile\nour results with the second principle is to modify the\nFourier law of heat conduction, by assuming that heat is\ntransported along the gradient of the kinetic temperature\nand not the thermodynamic temperature, as classically\nbelieved. This modification is not innocent and can impact the upper boundary of thermal efficiency, as specified by Carnot theorem. In both ways, we hence argue\nthat working with unconventional non-Boltzmannian fluids can alter our current perception of the concept of efficiency, beyond the standard Boltzmann picture to which\npredictive tools are at present indirectly anchored.\nThe long-range non Boltzmannian fluid.\nLet us now turn to introducing the general background\nthat defines the playground arena for our thermodynamics derivation. We will deal with a simple onedimensional model and label with θ the configuration\nvariable, p being its conjugate momentum. In the continuum limit, we assume the single particle distribution\nfunction f (θ, p, t) to obey to the following Vlasov equation:\n∂f\n∂f\ndV ∂f\n+p\n−\n=0\n∂t\n∂θ\ndθ ∂p\n\n,\n\n(1)\n\nwhere the potential V (θ)[f ] is self-consistently defined in\nterms of the distribution itself. The problem is hence\ncast in a general setting which embraces diverse fields\nof application, from plasma physics to cosmology. Our\ndeclared aim is to construct and study an (equilibrium)\ncyclic machine working with a Vlasov fluid. To this end,\nwe shall specialize further by assuming a specific form of\nthe potential, which will enable us to carry out the sought\ncalculations in details. The implications of our analysis\ncan be however extended to other realms, provided the\nprototypical equation (1) holds true. In fact, equation\n(1) yields a Fermi like entropy functional, which embeds\n\ndynamical constraints and that can be derived from first\nprinciples through the usual counting of accessible microscopic states. As a test case, we consider a paradigmatic\nexample of long range systems, the so called Hamiltonian\nMean Field (HMF) model, subject to an external magnetic forcing of strength h. The HMF is a popular model\nof spins, interacting all–to–all via a cosinus like potential.\nV (θ)[f ] takes in this case the form:\nV (θ)[f ] = 1 − M [f ] cos(θ) + h cos(θ)\n\n(2)\n\nwhere M [f ] stands for the magnetization:\nM [f ] =\n\nZ\n\nπ\n\n−π\n\nZ\n\n∞\n\nf (θ, p, t) cos θdθdp\n\n,\n\n(3)\n\n−∞\n\nwhich measures the degree of spatial spins' bunching. Including Rthe\ncontribution, the specific energy reads\nR kinetic\ne[f ] =\n(p2 /2)f (θ, p, t)dθdp − (M 2 − 1)/2 + hM . In\nits original formulation, the HMF is a discrete model\ncomposed of N particles (spins) in mutual interaction,\nand has been thoroughly studied in the unperturbed\nlimit h = 0. Starting from out–of–equilibrium initial\nconditions, the system gets trapped in Quasi-Stationary\nStates (QSS) [5], whose lifetime diverges when increasing the number of particles N . When performing the\nthermodynamic limit (N → ∞) before the infinite time\nlimit, the system remains permanently confined in the\nQSS, which are characterized by non Gaussian distributions and hence substantially differ from the deputed\nBoltzmann-Gibbs equilibrium. It has been shown that\nQSS's can be related to the stable (equilibrium) steady\nstates of the Vlasov equation (1) describing the system in\nthe continuum limit [5] [24] Studying the equilibria of the\nVlasov equations could be hence equivalently interpreted\nas addressing the out of equilibrium QSS dynamics of the\nassociated HMF model.\nThe microcanonical (constant energy) behavior of system (1) can be investigated via a direct statistical\nmechanics treatment, inspired to the seminal work of\nLynden-Bell [12], and originally developed in the context of stellar dynamics (see, e.g., [13]). Starting from an\narbitrary initial condition, the Vlasov evolution makes\nthe single-particle distribution function stir and distort\nin phase space. The hypervolumes of its values η (levels of phase density) are however conserved. Label with\nρ(θ, p, η) the probability density of finding the level of\nphase density η in a small neighborhood of the position\n(θ, p) in phase space. One can thus define\nR a \"coarsegrained\" distribution function f ̄(θ, p) = ρ(θ, p, η)ηdη.\nThe microcanonical equilibrium\ndistribution maximases\nR\nthe mixing entropy s = − ρ(θ, p, η) ln ρ(θ, p, η)dηdθdp,\nwhile conserving the invariant of the motion, as prescribed by standard statistical mechanics. For the sake\nof simplicity, and to allow for relatively straightforward\nanalytical progress, we solely consider the case of a twolevel water-bag initial conditions, i.e. η = f0 or η = 0\n\n\f3\n[25]. Within this approximation, the entropy reads:\n\u0013 \u0012\n\u0013\u0015\n\u0012\n\u0014  ̄\nZ\nf ̄\nf ̄\nf ̄\nf\nln 1 −\n,\nln\n+ 1−\ns[f ̄] = − dpdθ\nf0 f0\nf0\nf0\n(4)\nwhere f ̄ = f0 ρ. By maximizing the entropy functional,\none obtains the microcanonical solution in terms of a\nfermionic distribution (see below), which coincides with\na particular class of stable stationary solutions of the\nVlasov equation.\nGiven the microcanonical entropy (that selfconsistently depends on the energy e), one can\nalways calculate the canonical rescaled free energy,\nφ(β, f ̄), as the\u0002 Legendre-Fenchel\nTransform (LFT):\n\u0003\nφ(β, f ̄) = infe βe − s(e, f ̄) . This is a universally\nadopted procedure: β is a free parameter equal to the\ninverse of the (constant, in the canonical ensemble)\nthermodynamic temperature of the system. Requiring\nthe free energy to be stationary, under the dynamical\nconstraints, one recovers a closed mathematical prediction for the particles distribution, which again is\nfermionic. Concretely, the canonical distribution is:\n\nR\nnamely Tk = p2 f ̄(θ, p)dθdp. For a Boltzmannian system f ̄(θ, p) ∝ exp(−βp2 /2) [16] and it is therefore immediate to see that Tk = 1/β = Tth . When instead the system displays non-Boltzmannian traits, Tk 6= Tth . Unintuitive phenomena can thus set in as the emergence of negative kinetic heat in the canonical ensemble, a possibility\ndemonstrated in [11]. Moreover, for a non-Boltzmannian\nfluid, a word of caution should be exercised on the usage\nof Fourier's heat law: does the heat flow across the kinetic or thermodynamic temperature gradient? We shall\nreturn later on this crucial point.\nConstructing the thermodynamic cycle. Having\nreviewed the definition of canonical and microcanonical\nensembles, we can formally construct a thermodynamic\ncycle, reminiscent of Carnot's one, for an hypothetic device working with the Vlasov fluid introduced above. We\nwill in particular consider two isothermal transformations, the reservoirs being characterized by the (thermodynamic) temperatures TH (hot) and TC (cold). The\ncycle is then closed by assuming two adiabatic transformations. As concerns the latter transformation, we recall\n[17] that the first principle of thermodynamics reads:\nδQ = de − hdM.\n\nf ̄(θ, p) =\nf0\n. (5)\nβf\n(p\n/2\n−\nM\n[\nf ̄] cos θ − h cos θ) + α\n1+e 0\n2\n\nwhere α plays the role of a Lagrange multiplier associated to mass conservation. The latter equation is\nformally identical to the one obtained by requiring the\nentropy (4) to be stationary in the framework of the microcanonical ensemble [14]. In that case, β and α are\nLagrange multipliers associated to energy and mass conservation. In both cases, the respective Lagrange multipliers can be calculated by solving the self-consistent\nsystem of equations obtained by imposing the constraints\nconditions. Consequently, the coarse grained distribution\nfunction f ̄ and the magnetization M can be calculated,\nfor any fixed initial condition, i.e. given f0 , h and e (resp.\nβ) in the microcanonical (resp. canonical) setting.\nA remark is mandatory at this point, which will prove\ncrucial in the forthcoming discussion. The thermodynamic temperature Tth is equal to 1/β when working\nin the canonical framework, or specified by the fundamental relation (∂s/∂e)−1 , if the microcanonical viewpoint is instead adopted. A system and a thermal reservoir are said to be in equilibrium (no heat is exchanged)\nif their respective thermodynamic temperatures match.\nThe canonical ensemble, as defined by the above LFT,\nprovides hence the appropriate descriptive scenario for\nthe system dynamics, β being fixed as the inverse of\nthe thermostat thermodynamic temperature. If a difference in temperature manifests between two adjacent\nsystems, the heat flows against the temperature gradient\nso to eventually restore the equilibrium condition. This\nis the celebrated Fourier's law. With reference to both\nmicrocanonical and canonical pictures, one can alternatively consider the definition of kinetic temperature [15],\n\n(6)\n\nHere, Q is the heat provided by the environment to the\nsystem. The adiabatic transformation δQ = 0 is hence\nrealized by tuning the field strength as h = de/dM\nalong the path. A representative cycle obtained by implementing the procedure outlined above is depicted in\nfigure 1. Each point displayed in the three dimensional\nspace (h, M, e) is either a stationary solution of the entropy functional s (microcanical, adiabatic lines) or of\nthe free energy φ (canonical, isothermal). Notice that\none needs to circulate the cycle in figure 1 (lower panel)\ncounter-clockwise,\nso to extract a positive work amount\nR\n(LHMF = − cycle hdM ). The heat exchanged with the\nhot and cold reservoirs, labeled respectively QH and\nQC , can be readily evaluated as an application of the\nfirst principle (6) and upon calculation of the work performed along the isothermal tracks. Surprisingly, and as\na straightforward application of the above procedure, we\nobtain QH < 0 and QC > 0. Moreover, QC > |QH |. This\nis at odds with the physical constraints imposed by the\nsecond law of thermodynamics. The virtual machine that\nwe have constructed works in fact as a refrigerator, cooling down the reservoir with the lower temperature. In\ndoing so, it however generates a positive work load, which\nviolates Clausius formulation of the second law of thermodynamics. In principle, and admitting this conclusion\nto be correct, one could insert between the two considered\nreservoirs a standard thermal machine that, in a cycle,\nreceives from the hotter bath the heat quota QH (i.e. the\nvery same released by our Vlasov device), and returns to\nthe colder reservoir the heat Q′C , such that |Q′C | < QH ,\nwhile producing a positive work L. The machine obtained by pairing together the two considered devices,\nsubtracts heat from a single reservoir (QC − |Q′C | > 0)\nand returns the positive work Ltot = LHMF + L, against\n\n\f4\n\n0.72\n0.7\n\ne\n\n0.68\n0.66\n0\n\n0.64\n0.62\n0\n\n−0.2\n0.05\n\n0.1\n\n0.15\n\n0.2\n\n0.25\n\n−0.4\n\nM\n\nh\n0.25\n\n0.2\n\n0.15\n\nh\n\nthe second law of thermodynamics in the Kelvin-Planck\nformulation. In other words, the machine that we have\nassembled, and which intimately exploits the unintuitive\nfeatures of long range systems, is characterized by an efficiency η = Ltot /(QC − |Q′C |) equal to one. This is so\nunexpected that, at first sight, it would be tempting to reject the results as a whole. It is however possible to elaborate on a thermodynamic interpretation of the results\nand pinpoint to the specific, and highly unconventional\nphenomenon, that is ultimately responsible for such an\nastonishing behavior. Then we will come back to discussing the foundation of the theory, especially the customarily adopted definition of canonical ensemble, and\nsuggest that the validity of the second principle could\nbe eventually restored provided the kinetic temperature\nand not the thermodynamic one is employed in the law\nof Fourier for the heat transport.\nNegative kinetic heat capacity and the violation\nof the second principle of thermodyamics.\nThe cycle reproduced in figure 1 extends within a domain of the parameters space yielding magnetized states.\nIn [11], it was shown that negative (kinetic) specific heat\nis found in the canonical ensemble, i.e. along the isothermal lines of the cycle, when the magnetization is different\nfrom zero. This fact is indeed responsible for the apparently unphysical conclusions reached above. Consider in\nfact the first law and isolate the two terms that enter\nthe right hand side of equation (6). The second term\nis related to the actual physical work: when proceeding\ncounter-clockwise along the isothermal transformation,\nin contact with the hot reservoir, the quantity −hdM is\npositive as can be deduced by looking at figure 1 (lower\npanel, red line). In practice, and as it happens for an\nideal gas performing an isothermal transformation, the\nwork applied perturbes the system from its equilibrium\ncondition, while constraining it to the same thermodynamic temperature of the bath. A (positive) heat quota\n(−hdM ) is consequently transferred from the bath to the\nsystem, when circulating counter-clockwise. The opposite clearly holds when the the cold isothermal is considered, together with the chosen versus of circulation:\n−hdM is negative, see figure 1 (upper panel, blue line).\nWhile the thermodynamic temperature is kept constant,\nthe kinetic one Tk changes along the considered transformation: in particular, Tk increases along the isothermal\nat TH , decreases when the system is evolved in contact\nwith the colder bath TC .\nThe other contribution to the heat δQ, the first term\n(de) on the right hand side of equation (6), gets also modulated along the transformation. In figure 2, the energy e\nis shown to decrease when Tk increases, for both cold and\nhot isothermals (resp. red and blue). The kinetic specific\nheat is thus negative, a condition that realises because of\nthe non-Boltzmannian character of the system. Increasing the kinetic temperature, as the system does when in\ncontact with the hot bath TH , implies decreasing the energy e, and so contributing with a negative term to the\nglobal heat exchanged with the reservoir. Incidentally,\n\n0.1\n\n0.05\n\n0\n−0.4\n\n−0.3\n\n−0.2\n\n−0.1\n\n0\n\n0.1\n\nM\nFIG. 1: Upper panel: The thermodynamics cycle is represented in the three dimensional space (h, M, e). The red line\nstands for the isothermal transformation carried out at TH ,\nwhile the blue line refers to the choice TC < TH . Here\nTH = 1/βH = 0.33 and TC = 1/βC = 0.26. The adiabatic transformations that close up the cycle are depicted\nin green. The heat exchanged with the reservoirs are respectively: QH = −0.0363 (heat flows out the system) and\nQC = 0.0416 (the heat flows towards the system). Here,\nf0 = 0.12. Lower panel: The cycle is projected in the (M, h)\nsubspace. The arrows indicate the direction of circulation\nthat produces a positive work.\n\nthe latter contribution turns out to be larger in absolute\nvalue, than the positive contribution associated to the\nmagnetic work. The total contribution is hence negative\nand for this reason the system cedes heat to the hot reservoir. Similar conclusions can be drawn when looking at\nthe other isothermal transformation: now de is positive\n(the kinetic temperature decreases) and overcomes the\nnegative −hdM contribution. When kinetic and thermodynamics temperature are equal (as they should for\nconventional Boltzmannian short range systems) the (kinetic) specific heat has to be necessarily positive, and the\n\n\f5\n0.71\n0.7\n0.69\n\ne\n\n0.68\n\nTC\n\nT\n\nH\n\n0.67\n0.66\n0.65\n0.64\n0.63\n0.2\n\n0.22\n\n0.24\n\n0.26\n\nTk\n\n0.28\n\n0.3\n\n0.32\n\nFIG. 2: The energy e of the system is plotted versus the\nkinetic energy Tk , along the two isothermal transformations\n(in red TH = 0.33, in blue TC = 0.26). The transformations\nproceed along the directions highlighted by the arrows. Here,\nf0 = 0.12.\n\ncritical point has to do with the definition of the canonical ensemble, that we have here mutuated from equilibrium classical statistical mechanics, by performing the\nLegendre-Fenchel Transform of the entropy functional.\nIn doing so, one requires that the canonical dynamics\npreserves the thermodynamic temperature of the system\nsetting it to a constant value imposed by the external\nreservoir. Alternatively, one could imagine that nonBoltzmannian systems, when placed in contact with a\nthermal bath, would organize so to freeze their kinetic\ntemperature to the temperature [26] of the bath. As a\nnatural consequence, already stressed before, the Fourier\nlaw [18] should require that the heat flows along the kinetic temperature gradient, and not along the thermodynamic one, as the definition of canonical thermodynamical equilibrium would indirectly imply. Pushing further\nthis proposal, we could possibly ends up with a cyclic\nnon-Boltzmannian engine which meets the second law requirement, while still exceeding the Carnot upper bound\nof efficiency, since the thermodynamic temperature is related to the kinetic one by a non linear functional relation\n[11]. This is an important issue that touches the foundation of modern physics and that deserves to be carefully\naddressed.\n\nabove surprising condition cannot realize.\nDiscussion.\nSumming up we have analytically shown that nonBoltzmannian systems can apparently violate the second\nlaw of thermodynamics, and explained such an astonishing ability in terms their peculiar statistical mechanics, i.e. existence of negative kinetic specific heat in the\ncanonical ensemble. Importantly, and as a direct consequence of the above analysis, a cyclic thermal device\nworking with a non-Boltzmannian fluid can be imagined\nwhich has efficiency equal to one. It is however hard to\naccept such a conclusion, which would revolutionize our\ncurrent understanding of the laws of nature.\nA way out in our view exists which potentially allows\none to respect the second principle and confirm its validity for the class of systems being here considered. The\n\nTo conclude, we would like to stress that our study is\nrelevant for a quite large class of systems and for many\npractical physical situations. In fact, the Vlasov equation\nis often invoked as the reference model for several experimental systems, involving a large number of individual\ncomponents, e.g. charged systems, plasmas [19], freeelectron lasers [20] and magnetic dipolar systems [21]. In\nparticular, it can be shown that, under some hypotheses, the specific system here considered can be formally\nreduced, in the limit for h = 0, to that governing the dynamics of collective atomic recoil lasers (CARL) [22, 23].\nThis important observation could open up the perspective for an experimental verification of our theoretical\npredictions.\n\n[1] M.W. Zemansky, Heat and Thermodynamics McGrawHill, NY (1957)\n[2] R. Clausius, The Mechanical Theory of Heat - with its\napplications to the Steam Engine and to Physical Properties of Bodies London: John van Voorst, (1865).\n[3] Kelvin, W. Thomson, Mathematical and physical papers,\nLondon: C.J. Clay and son, Cambridge University Press\nLondon, (1882); Kelvin, W. Thomson, \"An Account of\nCarnot's Theory of the Motive Power of Heat - with Numerical Results Deduced from Regnault's Experiments\non Steam.\" Transactions of the Edinburg Royal Society,\nXVI. January 2 (1849).\n[4] S. Carnot Reflexions sur la puissance motrice du feu et\nsur les machines propres a developper cette puissance,\nParis: Bachelier. (1824)\n[5] T.Dauxois et al., Dynamics and Thermodynamics of Sys-\n\ntems with Long Range Interactions, Lect. Not. Phys. 602,\nSpringer (2002); A. Campa et al. Phys. Rep. B. 76 064415\n(2007).\nJ. Barré et al. Phys. Rev Lett. 87, 030601 (2001);\nW. Thirring, Z. Phys. 235, 339 (1970); P. Hertel and W.\nThirring, Ann. Phys. (N.Y.) 63, 520 (1971).\nG. De Ninno, D. Fanelli, submited to Phys. Rev. Lett,\narXiv:1011.2981 (2010)\nA. Campa, S. Ruffo, H. Touchette, Physica A 385, 233248 (2007).\nD.H.E. Gross, Microcanonical Thermodynamics, Phase\nTransitions in \"Small\" Systems, World Scientific (2001).\nF. Staniscia et al. Phys. Rev. Lett., 105, 010601 (2010).\nD. Lynden-Bell and R. Wood, Mon. Not. R. Astron. Soc.\n138, 495 (1968).\nP.H. Chavanis, Astrophys. J. 471, 385 (1996).\n\n[6]\n[7]\n[8]\n[9]\n[10]\n[11]\n[12]\n[13]\n\n\f6\n[14] A. Antoniazzi et al. Phys. Rev. Lett., 98, 150602 (2007);\nA. Antoniazzi et al. Phys. Rev. Lett., 99, 040601 (2007).\n[15] R. Balescu, Statistical Dynamics - Matter out of Equilibrium. (Imperial College Press, London, 1997)\n[16] R. K. Pathria, Statistical Mechanics, Elsevier, Oxford\n(2006).\n[17] D.J. Amit, Y. Verbin, Statistical Physics: an introductory course, World Scientific, (1999).\n[18] F. Bonetto et al., Fourier's Law: A Challenge to Theorists. Mathematical Physics 2000, 128-150, London, Imperial College Press (2000)\n[19] D. H. Dubin and T.M. O'Neil, Rev Mod. Phys. 71, 87\n(1999).\n[20] J. Barré et al., Phys. Rev. E 69, 045501(R) (2004).\n[21] A. Campa et al., Phys. Rev. B 75, 064415 (2007).\n[22] R. Bonifacio and L. De Salvo, Nucl. Instrum. Methods\nPhys. Res., Sect. A 341, 360 (1994).\n\n[23] R. Bachelard et al., J. Stat Mech: Theory and Experiments, P6009 (2010)\n[24] It is worth stressing, that according to the Kac scaling\nprescription, the Vlasov limit is obtained by reducing the\ninteraction strength (by a factor 1/2N ), while increasing\nthe number of particles. As a result, the energy scales\nlike N , and the system is extensive (but not additive).\n[25] The adequacy of Lynden-Bell approach is corroborated\nthrough direct comparison with simulations. It can be\nalso shown that the theory works well when generalizing\nthe initial condition to account for more levels. In the\nfollowing we will assume an initial water-bag distribution\nwith zero momentum.\n[26] Kinetic temperature, in general. If one deals with a Boltzmannian bath, kinetic and thermodynamics temperature\nclearly coincide.\n\n\f"}