{"id": "http://arxiv.org/abs/0911.5151v1", "guidislink": true, "updated": "2009-11-26T21:02:24Z", "updated_parsed": [2009, 11, 26, 21, 2, 24, 3, 330, 0], "published": "2009-11-26T21:02:24Z", "published_parsed": [2009, 11, 26, 21, 2, 24, 3, 330, 0], "title": "Recurrent words with constant Abelian complexity", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0911.2682%2C0911.0103%2C0911.0951%2C0911.0005%2C0911.0511%2C0911.5210%2C0911.0181%2C0911.2047%2C0911.3628%2C0911.2120%2C0911.3369%2C0911.0169%2C0911.0485%2C0911.1240%2C0911.4709%2C0911.4138%2C0911.0362%2C0911.5579%2C0911.2265%2C0911.0625%2C0911.5588%2C0911.4399%2C0911.2674%2C0911.4747%2C0911.5043%2C0911.3280%2C0911.1274%2C0911.4711%2C0911.4736%2C0911.3739%2C0911.5657%2C0911.2001%2C0911.3683%2C0911.1152%2C0911.3287%2C0911.1541%2C0911.5581%2C0911.3486%2C0911.1827%2C0911.0462%2C0911.4965%2C0911.4648%2C0911.0909%2C0911.4112%2C0911.1738%2C0911.3775%2C0911.4649%2C0911.0791%2C0911.3320%2C0911.0954%2C0911.3830%2C0911.4400%2C0911.4951%2C0911.4836%2C0911.5530%2C0911.3479%2C0911.4982%2C0911.2777%2C0911.2060%2C0911.2504%2C0911.3391%2C0911.5151%2C0911.2486%2C0911.2070%2C0911.5180%2C0911.2292%2C0911.5394%2C0911.0654%2C0911.4069%2C0911.5505%2C0911.0902%2C0911.1999%2C0911.0640%2C0911.4899%2C0911.0609%2C0911.4468%2C0911.5463%2C0911.2566%2C0911.2557%2C0911.0483%2C0911.4218%2C0911.3875%2C0911.0376%2C0911.0058%2C0911.0832%2C0911.2809%2C0911.0087%2C0911.1975%2C0911.2460%2C0911.2722%2C0911.2952%2C0911.3291%2C0911.5415%2C0911.2184%2C0911.4500%2C0911.1730%2C0911.4431%2C0911.4977%2C0911.1357%2C0911.4320%2C0911.3214&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Recurrent words with constant Abelian complexity"}, "summary": "We prove the non-existence of recurrent words with constant Abelian\ncomplexity containing 4 or more distinct letters. This answers a question of\nRichomme et al.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0911.2682%2C0911.0103%2C0911.0951%2C0911.0005%2C0911.0511%2C0911.5210%2C0911.0181%2C0911.2047%2C0911.3628%2C0911.2120%2C0911.3369%2C0911.0169%2C0911.0485%2C0911.1240%2C0911.4709%2C0911.4138%2C0911.0362%2C0911.5579%2C0911.2265%2C0911.0625%2C0911.5588%2C0911.4399%2C0911.2674%2C0911.4747%2C0911.5043%2C0911.3280%2C0911.1274%2C0911.4711%2C0911.4736%2C0911.3739%2C0911.5657%2C0911.2001%2C0911.3683%2C0911.1152%2C0911.3287%2C0911.1541%2C0911.5581%2C0911.3486%2C0911.1827%2C0911.0462%2C0911.4965%2C0911.4648%2C0911.0909%2C0911.4112%2C0911.1738%2C0911.3775%2C0911.4649%2C0911.0791%2C0911.3320%2C0911.0954%2C0911.3830%2C0911.4400%2C0911.4951%2C0911.4836%2C0911.5530%2C0911.3479%2C0911.4982%2C0911.2777%2C0911.2060%2C0911.2504%2C0911.3391%2C0911.5151%2C0911.2486%2C0911.2070%2C0911.5180%2C0911.2292%2C0911.5394%2C0911.0654%2C0911.4069%2C0911.5505%2C0911.0902%2C0911.1999%2C0911.0640%2C0911.4899%2C0911.0609%2C0911.4468%2C0911.5463%2C0911.2566%2C0911.2557%2C0911.0483%2C0911.4218%2C0911.3875%2C0911.0376%2C0911.0058%2C0911.0832%2C0911.2809%2C0911.0087%2C0911.1975%2C0911.2460%2C0911.2722%2C0911.2952%2C0911.3291%2C0911.5415%2C0911.2184%2C0911.4500%2C0911.1730%2C0911.4431%2C0911.4977%2C0911.1357%2C0911.4320%2C0911.3214&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We prove the non-existence of recurrent words with constant Abelian\ncomplexity containing 4 or more distinct letters. This answers a question of\nRichomme et al."}, "authors": ["James Currie", "Narad Rampersad"], "author_detail": {"name": "Narad Rampersad"}, "author": "Narad Rampersad", "links": [{"href": "http://arxiv.org/abs/0911.5151v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0911.5151v1", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "math.CO", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "math.CO", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "68R15", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0911.5151v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0911.5151v1", "arxiv_comment": null, "journal_reference": null, "doi": null, "fulltext": "arXiv:0911.5151v1 [math.CO] 26 Nov 2009\n\nRecurrent words with constant Abelian\ncomplexity\nJames Currie∗and Narad Rampersad†\nDepartment of Mathematics and Statistics\nUniversity of Winnipeg\n515 Portage Avenue\nWinnipeg, Manitoba R3B 2E9 (Canada)\nj.currie@uwinnipeg.ca\nn.rampersad@uwinnipeg.ca\nNovember 6, 2018\n\nAbstract\nWe prove the non-existence of recurrent words with constant Abelian complexity containing 4 or more distinct letters. This answers a question of\nRichomme et al.\nKeywords: Combinatorics on words, abelian complexity, words on graphs\n\n1\n\nIntroduction\n\nOne of the central notions in combinatorics on words is that of the subword\ncomplexity of an infinite word. Richomme, Saari, and Zamboni [3] have recently\nbegun a systematic study of the Abelian analogue of the subword complexity of\ninfinite words. In this paper we resolve one of the open problems from their study\n∗\n†\n\nThe author is supported by an NSERC Discovery Grant.\nThe author is supported by an NSERC Postdoctoral Fellowship.\n\n1\n\n\fby showing the non-existence of recurrent words with constant Abelian complexity\ncontaining 4 or more distinct letters.\nLet Σ be a finite alphabet and let Σ∗ be the set of all finite words over the\nalphabet Σ. Consider the equivalence relation ∼ on Σ∗ , defined by\nu ∼ v if u is an anagram of v.\nThus 1232 ∼ 2132. We write [u] for the equivalence class of u under ∼. For\nexample, [121] = {112, 121, 211}. We call [u] an Abelian word. If u is a factor\nof a word w, we call [u] an Abelian factor of w. The length of an Abelian factor\nis the length of any one of its representatives.\nIf w is an infinite word, the subword complexity function of w is the\nfunction f : N → N, where for m = 1, 2, . . ., the value of f (m) is the number\nof factors of w of length m. Similarly, the Abelian complexity function of w\nis the function f ̃(m) : N → N, where for m = 1, 2, . . ., the value of f ̃(m) is the\nnumber of Abelian factors of w of length m.\nAn infinite word w = w0 w1 * * * , where wi ∈ Σ for i = 0, 1, 2 . . ., is ultimately\nperiodic if there exist a non-negative integer c and a positive integer p such that\nwi = wi+p for all i ≥ c. A classical result of Morse and Hedlund [2] shows that an\ninfinite word w is ultimately periodic if and only if its complexity function f is\neventually constant. If w is not ultimately periodic, then f (m) ≥ m + 1 for all m.\nThe well-studied Sturmian words are precisely the aperiodic words of minimal\ncomplexity (i.e., those words for which f (m) = m + 1 for all m ≥ 1). Coven and\nHedlund [1] showed that any Sturmian word has constant Abelian complexity. In\nparticular, for any Sturmian word, one has f ̃(m) = 2 for all m ≥ 1.\nSturmian words are necessarily over a binary alphabet; it is therefore natural\nto ask if over an n-letter alphabet, where n ≥ 3, there is an infinite word w\nwith Abelian complexity function f ̃(m) = n for all m ≥ 1. Without further\nqualification, this question is not very interesting, as one easily sees that the word\n123 * * * (n − 1)nnnnnnnn * * *\nover the alphabet {1, 2, . . . , n} has exactly n Abelian factors of each length m ≥ 1.\nThis observation leads us to the following definition. We say that a word\nw is recurrent if every factor of w occurs infinitely often in w. Any Sturmian\nword is recurrent, so such words provide examples of recurrent words with constant Abelian complexity over a binary alphabet. Richomme, Saari, and Zamboni\nshowed that there are recurrent words over a 3-letter alphabet with exactly 3\n2\n\n\fAbelian factors of each length m ≥ 1, thereby answering a question of Rauzy.\nThey also posed a question of their own, namely, \"Does there exist a recurrent\nword over a 4-letter alphabet with exactly 4 Abelian factors of each length?\" They\nalso conjectured that the answer to the question should be \"no\". We show that\nthis is indeed the case. Moreover, our main result also applies to alphabets of size\ngreater than 4.\nTheorem 1 Let n ≥ 4 be an integer. There is no recurrent word over an n-letter\nalphabet with exactly n Abelian factors of each length ≥ 1.\n\n2\n\nProof of Theorem 1\n\nFix a positive integer n ≥ 4. Let Σ be the alphabet {1, 2, 3, . . . , n}. Let w be\na finite or infinite word. Consider the graph G with vertex set Σ, and an edge\nij whenever at least one of ij and ji is a factor of w. Note that G may contain\nloops, but not multiple edges.1 From now on suppose that w is a fixed recurrent\nword, having constant Abelian complexity n.\nLemma 2 Graph G consists of a spanning tree and one additional edge. Thus G\ncontains a unique cycle C (which is possibly a loop).\nProof: Since w has Abelian complexity n, it contains all n letters. It follows\nthat G must be connected. This implies that G contains a spanning tree. The\nspanning tree contains n − 1 edges. Since the factors of w of length 2 represent\nexactly n Abelian words, G contains exactly n edges. ✷\nLet b ∈ Σ. Define T (b) = {[abc] : abc is a factor of w for some a, c ∈ Σ.}. We\ncall an element of T (b) a triple associated with b. Since w is recurrent, every\nletter of Σ occurs in w as the middle letter of at least one factor of length 3. This\nmeans that each letter of Σ has at least one triple associated with it.\nLemma 3 Suppose that a 6= b but triple [abc] is associated with both a and b.\nThen exactly one of he following occurs:\n1. abc is a triangle in G\n1\n\nFor definiteness of notation, let us say that we never call a a neighbour of itself; however,\nwe will count a loop based at a as contributing 1 to the degree of a. Thus the degree of a vertex\na in G will be the number of distinct neighbours of a, plus the number of loops based at a; since\nwe do not allow multiple edges, the number of loops based at a is 0 or 1.\n\n3\n\n\f2. a = c and G contains the loop aa.\n3. b = c and G contains the loop bb.\nProof: Since abc is associated to b, at least one of abc and cba is a factor of w. It\nfollows that ab and bc are edges of G. Since abc is a triple associated to a, at least\none of bac and cab is a factor of w, so that ca is also an edge of G. If a, b and c\nare distinct, then G contains triangle abc. If two of them are the same, then since\na 6= b, one of bc and ca is a loop.✷\nLemma 4 Suppose that b, c and d are distinct neighbours of a in G. Then\n|T (a)| ≥ 2.\nProof: Since b is a neighbour of a, then either ba or ab is a factor of w. By\nrecurrence, either bax or xab will therefore be a factor of w for some x ∈ Σ, and\n[xab] is a triple associated with a. Similarly, a must have associated triples [cay],\n[daz] for some letters y, z ∈ Σ. If [bax] 6= [cay], then we are done. Otherwise,\nx = c and y = b so that [daz] 6= [bax].✷\nLemma 5 Suppose that a has distinct neighbours b and c in G. Either [bac] ∈\nT (a) or |T (a)| ≥ 2.\nProof: One of ab and ba is a factor of G. Suppose ab is a factor of w. (The other\ncase is similar). By recurrence, w has a factor xab for some x. If x = c, then\n[bac] is associated to a, and we are done. Otherwise, [xab] ∈ T (a), and T (a) also\nincludes a triple involving c.✷\n\nCase 1: Cycle C is an m-cycle, m ≥ 4.\nBy Lemma 2,C is the unique cycle in G. This implies that G contains no loops or\ntriangles, so that triples associated with distinct vertices are distinct by Lemma 3.\nAt least one triple is associated with each of the n vertices of G. Since the\nAbelian complexity of w is exactly n, the total number of triples associated with\nthe vertices of G is n. We conclude that |T (a)| = 1 for each a ∈ Σ. From\nLemma 4 we conclude that each vertex of C has degree exactly 2, so that C is a\nconnected component of G. Since G is connected, G = C is an n-cycle. Without\nloss of generality let the vertices be connected in the natural order 123 * * * n1.\nBy Lemma 5, we conclude that the triples associated with the vertices of G are\n[123], [234], [345], . . . , [(n − 2)(n − 1)n], [(n − 1)n1], [n12]. Since w must be walked\n4\n\n\fon G respecting the possible triples, we conclude that w is a suffix of (123 * * * n)ω\nor of (n * * * 321)ω and thus has period n. However, this means that w contains\nexactly one factor of length n, up to anagrams. This is a contradiction.\n\nCase 2: Cycle C is a loop.\nWithout loss of generality, let the loop edge be 11. At least one triple is associated\nwith each of the n vertices of G. A triple of the form [111] could only ever be\nassociated to 1. Also, b, c are neighbours of 1 and [b1c] is associated to b, then\n1bc or cb1 is a factor of w. This implies that bc is an edge of G so that ibc is a\ntriangle (if b 6= c) or bc is a loop (if b = c). Since 11 is the only cycle in G by\nLemma 2, this is impossible. It follows that triples of the form 111 or b1c with\nb and c neighbours of 1 can only ever be associated to 1. It now follows that 1\ncan be associated to at most a single triple of the form 111 or b1c where b, c are\nneighbours of 1; if 1 is associated to two such triples T1 and T2 , then each of the\nn − 1 other vertices of G is associated to a triple, and these triples are distinct\nfrom T1 and T2 , and from each other by Lemma 3. Then, however, we have at\nleast n + 1 distinct triples, violating the Abelian complexity of w.\nWe make cases based on whether 1 is associated to a triple of the form 111 or\nb1c where b and c are neighbours of 1.\nCase 2a: Vertex 1 is associated to a triple of the form [111].\nEach vertex of G − {1} is associated to some triple other than [111], and those\ntriples are distinct from each other and from 111. Let b be a neighbour of 1. At\nleast one of b1 and 1b is a factor of w. Since 1 is not associated to any triple\n[b1c] where b and c are neighbours of 1, it follows that b11 or 11b must be a factor\nof w. Since the Abelian complexity of w is n, we conclude that [11b] = [1b1] is\nthe unique triple associated with b. From Lemma 5, it follows that 1 is the only\nneighbour of b. Graph G is therefore the star with center 1; the edges of G are\nprecisely E(G) = {1k : 1 ≤ k ≤ n}.\nLet m be least such that w has a factor d1m e where d, e 6= 1. Without loss\nof generality, say that 21m 3 is a factor of w. Let b be any vertex of G − {1}.\nSince 1b is an edge of G, w has a factor b1 or 1b, hence a factor 12 b1m or 1m b12 .\n(Recall that 1 is the only neighbour of b in G.) It follows that up to anagrams,\nthe n factors of w of length m + 3 are 121m 3, 1m 212 , 1m 312 , 1m 412 , . . ., 1m n12 . In\nparticular, w has no factor 1m+2 , and in any factor of the form b1k c with b, c 6= 1\nand k ≤ m we must have {b, c} = {2, 3} and k = m.\n5\n\n\fNow consider the shortest factor of w containing a letter from {2, 3} and a\nletter from {4, 5, . . . , n}. By our last remark, it must have the form b1k c or c1k b\nwhere b ∈ {2, 3}, c ∈ {4, 5, . . . , n} and k ≥ m + 1. Since w has no factor 1m+2 ,\nk = m + 1, and we have found an (n + 1)st Abelian factor of w. This is a\ncontradiction.\nCase 2b: Vertex 1 is associated to exactly one triple of the form [b1c]\nwhere b and c are neighbours of 1.\nIn this case, [111] is not associated with 1; i.e., 111 is not a factor of w. Each\nvertex of G − {1} is again associated to some triple other than [b1c], and these\ntriples are distinct from each other. Let d be a neighbour of 1 other than b or c.\nVertex 1 cannot be associated to another triple [d1e] where e is a neighbour of 1.\nTherefore, at least one of d11 and 11d is a factor of w. It follows that [11d] = [1d1]\nis the unique triple associated with d. We conclude that 1 is the only neighbour\nof d; viz., d is a leaf. We see also that (except possibly once at the beginning of\nw) d always appears in w in the context 11d11.\nNow consider the shortest factor of w containing a letter from {b, c} and a\nneighbour of 1 other than b or c. By our last remark, and relabeling b and c if\nnecessary, this factor must have the form c1k d or d1k c, k ≥ 2, d some neighbour\nof 1 other than b and c. If [11c] is not associated to c, then [11c] and [b1c] are\nassociated only to 1, and we can count n + 1 distinct triples associated to vertices\nof G. This violates the Abelian complexity of G. We conclude that [11c] must be\nthe unique triple associated with c, and c is a leaf.\nCase 2bi: Vertex b is a leaf.\nIn this case, each neighbour of 1 is a leaf; graph G is the star with center 1. The\nedges of G are precisely E(G) = {1k : 1 ≤ k ≤ n}. Let m be least such that w\nhas a factor x1m d or d1m x where x ∈ {b, c}, d ∈\n/ {1, b, c}. Since [b1c] is the unique\ntriple associated only with 1, m ≥ 2. On the other hand 111 is not a factor of w,\nso m = 2. Without loss of generality, assume that b = 2, c 6= 3, and 2113 or 3112\nis a factor of w. Since 1 is the only neighbour of 2, it follows that 12113 or 31121\nis a factor of w. We have already seen that 11d11 is a factor of w if d 6= 1, b, c. It\nfollows that, up to anagrams, the following n + 1 factors of length 4 appear in w:\n121c, 2113, 1121, 1131, 1141, . . . , 11n1.\nThis is a contradiction.\n6\n\n\fCase 2bii: Vertex b has degree at least 2.\nSince our Abelian complexity is n, and triple b1c is associated only with 1, for\nany vertex d of G − {1}, |T (d)| = 1. By Lemma 4, deg(d) ≤ 2. We may therefore\nassume that the edges of G are\n11, 1n, 1(n−1), 1(n−2), . . . 1(r + 1), 1r, r(r −1), (r −1)(r −2), (r −2)(r −3), . . . , 32\nand the triples are\n[11n], [11(n − 1)], [11(n − 2)], . . .\n[11(r + 1)], (r + 1)1r], [1r(r − 1)], [r(r − 1)(r − 2)], . . . , [432], [323].\n(We have c = r + 1, b = r.) It follows that up to anagrams, w has the n length 4\nfactors\n11n1, 11(n − 1)1, . . . , 11(r + 1)1\n1(r + 1)1r, (r + 1)1r(r − 1)\n1r(r − 1)(r − 2), r(r − 1)(r − 2)(r − 3), . . . , 5432, 4323\n\n(n − r factors)\n(2 factors)\n(r − 2 factors).\n\nNow however, consider the shortest factor of w containing letters from both {n, n−\n1, . . . , r − 2} and {r + 1, r}. This must have the form x1k y or y1k x where x ∈\n{n, n − 1, . . . , r − 2} and y ∈ {r + 1, r}. Since [b1c] is the unique triple associated\nonly to 1, we cannot have k = 1. Since 111 is not a factor of w, we must have\nk = 2. This gives an (n + 1)st length 4 Abelian word in w, namely x11y. This is\na contradiction.\nCase 2c: Every triple associated with 1 has the form [11b], b 6= 1.\nIn this case, w has no factors 111 or b1c with b, c 6= 1. If b is any neighbour of 1\ntherefore, either b11 or 11b is a factor of w. If 1 has no non-leaf neighbour, G is\na star centered at 1; for 2 ≤ k ≤ n, the only length three factors of w containing\nk are among 11k, 1k1 and 11k. The triples of G are precisely those of the form\n[11k], k 6= 1, and G has only n − 1 triples. This is a contradiction.\nTherefore, let b be a non-leaf neighbour of 1, let b′ 6= 1 be a neighbour of b.\nThe shortest factor of w containing 1 and b′ must be 1bb′ or b′ b1, so [1bb′ ] is a triple\nassociated with b. Now every vertex of G − {1} has at least one triple associated\nwith it, and all such associated triples must be distinct. Moreover, b has triples\n[11b] and [1bb′ ] associated with it. We have now listed n distinct triples associated\nwith the vertices of G − {1}. If 1 had another non-leaf neighbour c 6= b, then an\n7\n\n\f(n + 1)st triple [1cc′ ] would be associated to c. Since this is impossible, it follows\nthat b is the only non-leaf neighbour of 1.\nWithout loss of generality, let the neighbours of 1 be exactly 2, 3, . . . r = b,\nand let r + 1 be a neighbour of r. The r triples [112], [113], . . . [11r], [1r(r + 1)]\nwill be associated to vertices 1, 2, . . . , r, while the triples associated with vertices\n(r + 1), (r + 2), . . . , n must be distinct from these and from each other. This means\nthat exactly one triple is associated to each of vertices (r + 1), (r + 2), . . . , n, so\nthat by Lemma 4, they each have degree at most 2. Without loss of generality we\nmay thus assume that the edges of G are\n11, 12, 13, . . .\n1r, r(r + 1), (r + 1)(r + 2), (r + 2)(r + 3), . . . , (n − 1)n\nsome r, 1 < r ≤ n. The n triples associated to vertices of G must thus be precisely\n[112], [113], [114],\n[11r], [1r(r + 1)], [r(r + 1)(r + 2)], . . . , [(n − 2)(n − 1)n], [(n − 1)n(n − 1)].\nFor 2 ≤ k ≤ r−1, the only neighbour of vertex k is vertex 1. Since w has no factors\n111 or b1c with b, c 6= 1, it follows that w has a factor 11k1 for 2 ≤ k ≤ r − 1. In\naddition to these r − 2 factors of length 4, the specification of triples forces w to\nhave (up to reversal) the n − r + 1 factors\n11r(r + 1), 1r(r + 1)(r + 2), r(r + 1)(r + 2)(r + 3), (r + 1)(r + 2)(r + 3)(r + 4),\n. . . , (n − 3)(n − 2)(n − 1)n, (n − 2)(n − 1)n(n − 1).\nIn addition, since 11r or r11 is a factor of w, so is a word c11r or r11c, where c is\nsome neighbour of 1 in G. This brings the count of Abelian factors of length 4 to\n(r − 2) + (n − r + 1) + 1 = n. Suppose now that d is a neighbour of 1 other than\nr and c. Then w contains a factor d11 or 11d, hence a word d11e or e11d, where\ne is a neighbour of 1. This brings the number of length 4 Abelian factors of w to\nn + 1, which is a contradiction. It follows that the only neighbours of 1 are r and\nc. (Note that perhaps r = c.) The length 4 Abelian factors of w are thus\n[c11r], [11r(r+1)], [1r(r+1)(r+2)], [r(r+1)(r+2)(r+3)], [(r+1)(r+2)(r+3)(r+4)], . . . ,\n[(n − 3)(n − 2)(n − 1)n], [(n − 2)(n − 1)n(n − 1)].\n8\n\n\fIn the case that c 6= r, this forces w to be a suffix of\n(c11r(r + 1)(r + 2)(r + 3)(r + 4) * * *\n(n − 2)(n − 1)n(n − 1)(n − 2) * * * (r + 4)(r + 3)(r + 2)(r + 1)r11)ω ,\nand w is periodic, with period 2n. However, this means that w contains exactly\none factor of length 2n, up to anagrams, which is a contradiction.\nIn the case that c = r, this forces w to be a suffix of\n(r(r + 1)(r + 2)(r + 3)(r + 4) * * *\n(n − 2)(n − 1)n(n − 1)(n − 2) * * * (r + 4)(r + 3)(r + 2)(r + 1)r11)ω ,\nand again w is periodic, with a contradiction.\n\nCase 3: Cycle C is a 3-cycle.\nLet the vertices of C be a, b, c. By Lemma 3, the only triple which can be associated with more than one vertex is [abc]. Each vertex of G − {a, b, c} is associated\nwith some triple, and these must all be distinct. This accounts for n − 3 triples.\nSince G is connected, w must contain some factor of the form xab, xba, xbc, xcb,\nxca or xac, for some x ∈\n/ {a, b, c}. Suppose without loss of generality that [xab]\nis associated to a for some x 6∈ {a, b, c}. Then a has degree at least 3, so that\n|T (a)| ≥ 2 by Lemma 4. Since |T (b)|, |T (c)| ≥ 1 but the total number of distinct\ntriples associated to vertices of G is n, at least two of a, b and c have an associated triple in common. That triple must be [abc]. So far, we have found that\n[xab], [abc] ∈ T (a) ∪ T (b) ∪ T (c).\nCase 3a: T (a) ∪ T (b) ∪ T (c) = {[abc], [bax]}.\nThe shortest factor of w starting with x and ending in one of b or c will be xab.\n(Such a factor exists because w is recurrent.) Let uxab be a prefix of w. As the only\ntriple associated to b is [abc], w has uxabc as a prefix. Again, T (c) = {[abc]}, so\nuxabca is a prefix of w. The only triple in T (a) having c as one of its letters is [abc],\nso uxabcab is a prefix of w. Continuing in this way, we find that w = ux(abc)ω .\nThis is impossible, since x must appear in w infinitely often, by recurrence.\n\n9\n\n\fCase 3b: |T (a) ∪ T (b) ∪ T (c)| = 3.\nThe argument of Case 3a can still be applied if we add to T (a) ∪ T (b) ∪ T (c)\nanother triple from bab, cbc or aca; none of these triples allows us to break the\ncircular order a − b − c − a on {a, b, c} which commences with xab. Similarly,\nadding to T (a) ∪ T (b) ∪ T (c) a triple [ybc] where y 6= {a, c} is a neighbour of b\nwould lead to the same contradiction. Again a triple [yca] where y 6= {b, a} is a\nneighbour of c, or a triple [yab] where y 6= {b, c} is a neighbour of a leads to a\ncontradiction.\nWe may therefore assume w contains a factor aba, bcb, cac, or a factor of the\nform aby, bcy or cay, y 6∈ {a, b, c}.\nSince T (a) ∪ T (b) ∪ T (c) contains three distinct triples, and a distinct triple\nis associated to each of the n − 3 vertices of G − {a, b, c}, we deduce that each\nvertex of G − {a, b, c} is only associated with a single triple, and thus has degree\nat most 2 by Lemma 4. We recall that G contains exactly one cycle. Graph G\ntherefore consists of the triangle abc, together with 1 or more paths radiating from\nits vertices.\nCase 3bi: Word w contains a factor aba, bcb, cac.\nIn this case, the only vertex of G − {a, b, c} which is adjacent to any of a, b and c\nis x. Graph G consists of triangle abc together with a single path adjacent to a.\nRelabel x = a1 , and let the edges of G be\nab, bc, ca, aa1 , a1 a2 , a2 a3 , . . . , ar−1 ar\nwhere r = n − 3.2 By Lemma 5, the triples of G are precisely\n[baa1 ], [aa1 a2 ], [a1 a2 a3 ], [a2 a3 a4 ], . . . , [ar−2 ar−1 ar ], [ar−1 ar ar−1 ], [abc], T\nwhere T is one of [aba], [bcb] and [cac].\nThe only two triples containing both a and a1 are [baa1 ] and [aa1 a2 ]. We\nconclude that w contains Abelian factor [aba1 a2 ]. Reasoning similarly, we find\nthat for r ≥ 4, the following n − 2 length 4 Abelian factors must be in w :\n[baa1 a2 ], [aa1 a2 a3 ], [a1 a2 a3 a4 ], . . . , [ar−3 ar−2 ar−1 ar ], [ar−2 ar−1 ar ar−1 ].\n(The stipulation r ≥ 4 is only for notational convenience. If r = 3, let a0 = a,\nand the 3 length 4 Abelian factors are [baa1 a2 ], [aa1 a2 a3 ], [a1 a2 a3 a2 ]. If r = 2, let\n2\n\nIf r = 1, we use the convention a0 = a2 = a.\n\n10\n\n\fa0 = a, a−1 = b, and the 2 length 4 Abelian factors are [baa1 a2 ], [aa1 a2 a1 ]. Finally,\nif r = 1, a length 4 Abelian factor is [baa1 a].)\nNow consider a factor v of w of the form a1 {a, b, c}∗ a1 , containing ac or ca\nas a factor. Such a v exists by recurrence. Since the only triple joining abc and\nG − {a, b, c} is [baa1 ], v can be written in the form a1 abv1 baa1 where v1 ∈ {a, b, c}∗\nand ac or ca appears in v1 . The circular order of abv1 ba changes exactly once,\nfrom a − b − c − a to a − c − b − a, at triple T . Thus v1 cannot both begin and end\nwith a, lest aba appear twice in abv2 ba. Thus v1 must either begin or end with\nc, so that a1 abc or cbaa1 is a factor of w, yielding Abelian factor [a1 abc] in either\ncase. Notice that we have shown that abv1 ba cannot both begin and end with a\npalindrome.3 It thus follows that [tz] is also an Abelian factor of w, where t ∈ T\nis a palindrome and z is the letter of {a, b, c} not appearing in t.\nSuppose now that v1 begins with a. The case where v1 ends in a is similar.\nThen a1 aba is a factor of w, and we have enumerated all n length 4 Abelian\nfactors of w: the n − 3 previously listed, plus [a1 abc], [tz] = [abac] and [a1 aba].\nThe circular order of {a, b, c} in abv1 ba changes exactly once (with aba), so that\nabv1 ba ∈ aba(cba)+ . It follows that bacba is a suffix of abv1 ba, and w also contains\nAbelian factor [bacb]. This is a contradiction. We conclude that v1 cannot begin\nor end with a, and hence must begin and end with c. Since [ca] is an Abelian\nfactor of v, we cannot have abv1 ba = abcba.\nThus far, w has Abelian factors [a1 abc] and [tz] in addition to the n − 3 length\n4 Abelian factors previously listed. Let y be the central letter of palindrome t\nand write abv1 ba = v2 yv3 where v2 y is a prefix of (abc)ω and yv3 is a suffix of\n(cba)ω . We must have |v2 | ≡ |v3 | (mod 3). Also, |v2 |, |v3| ≥ 2. Suppose that\n|v2 | > |v3 |. Then |v2 | ≥ |v3 | + 3 ≥ 5. In this case, abv1 has a prefix abcabc, and\nw contains Abelian factors [abca], [bcab], [cabc]. One of these is [tz], but this still\ngives n + 1 length 4 Abelian factors of w, which is impossible. We similarly rule\nout |v2 | < |v3 |. Note that we may also assume that |v2 | ≤ 4. Since |abv1 ba| > 5,\nwe find that 3 ≤ |v2 | = |v3 | ≤ 4. If |v2 | = 3, then abv1 ba = abcacba, t = cac\nand [abca] and [bcac] are Abelian factors of w. We have now specified all length\n4 Abelian factors of w; none of these is [a1 t], the central letter in t is not c and\nthe set of length 4 Abelian factors of w turns out to be determined by t and\n|v| = 2|v2 | + 3. Similarly, if |v2 | = 4, then abv1 ba = abcabacba, t = aba and [abca]\nand [bcab] are Abelian factors of w. Again the set of all length 4 Abelian factors\nof w is determined by t and |v|, none of the Abelian factors is [a1 t] and c is not\nthe central letter in t.\n3\n\nThroughout, when we say \"palindrome\" we mean one of the three palindromes aba, bcb, cac.\n\n11\n\n\fSince the two different possible lengths for v give different sets of Abelian\nfactors in w, it follows that w contains exactly one factor v of the form a1 {a, b, c}∗ a1\ncontaining [ac] as an Abelian factor. Now let v ′ be any factor of w of the form\na1 {a, b, c}+ a1 . Word v ′ must have prefix a1 ab and suffix baa1 . However, since\n[a1 t] is not an Abelian factor of w, v ′ cannot have a1 aba as a prefix or abaa1 as\na suffix. Word v ′ therefore has a1 abc as a prefix and cbaa1 as a suffix. Again,\nv ′ 6= a1 abcbaa1 , since the central letter of t is not c. We deduce that v ′ has prefix\na1 abca or suffix acbaa1 , and must contain [ac] as an Abelian factor. In summary,\nw contains exactly one factor of the form v = a1 {a, b, c}∗ a1 . If r = 1, this shows\nthat w is periodic, giving a contradiction. If r ≥ 2, our earlier specification of the\nn − 3 triples of w along the path baa1 * * * ar shows that w contains a single factor\nof the form a1 (Σ − {a, b, c})∗ a1 , namely a1 a2 * * * ar−1 rar−1 * * * a2 a1 . Since aa1 a is\nnot a factor of w, we again deduce that w is periodic, giving a contradiction.\nCase 3bii: Word w contains a factor aby, bcy or cay, y 6∈ {a, b, c}.\nWe consider first the case where w contains a factor aby, y 6∈ {a, b, c}. Since b, c\nand x are neighbours of a, and abc is the only cycle in G, we cannot have y = x.\nGraph G consists of triangle abc together with two paths adjacent to a and b.\nRelabel x = a1 , y = b1 and let the edges of G be\nab, bc, ca, aa1 , a1 a2 , a2 a3 , . . . , ar−1 ar , bb1 , b1 b2 , . . . , bs−1 bs\nwhere r + s = n − 3. By Lemma 5, the n triples of G are\n[baa1 ], [aa1 a2 ], [a1 a2 a3 ], [a2 a3 a4 ], . . . , [ar−2 ar−1 ar ], [ar−1 ar ar−1 ], [abc]\nand\n[abb1 ], [bb1 b2 ], [b1 b2 b3 ], [b2 b3 b4 ], . . . , [bs−2 bb−1 bs ], [bs−1 bs bs−1 ].\nThe following n − 3 length 4 Abelian factors must be in w:\n[baa1 a2 ], [aa1 a2 a3 ], [a1 a2 a3 a4 ], . . . , [ar−3 ar−2 ar−1 ar ], [ar−2 ar−1 ar ar−1 ]\nand\n[abb1 b2 ], [bb1 b2 b3 ], [b1 b2 b3 b4 ], . . . , [bs−3 bs−2 bs−1 bs ], [bs−2 bs−1 bs bs−1 ].\nLet v be a shortest factor of w of the form {a1 , b1 }uc. A prefix of v must be\na1 ab or b1 ba. Suppose v has prefix a1 ab. Then v ∈ a1 ab{a, b, c}∗ c. Letters a, b, c\n12\n\n\fmust have circular order a − b − c − a in v, since there are no palindromes in v to\nchange the circular order, and v starts a1 abc. Let p be a prefix of w of the form\nqa1 (abc)j with j as large as possible. If j = 2, then abcabc is a factor of w, so that\nw contains 4 more Abelian factors:\n[a1 abc], [abca], [bcab], [cabc].\nThis is impossible, since then w has n + 1 distinct length 4 Abelian factors. It\nfollows that j = 1, and qa1 abcabb1 is a prefix of w. (Recall that the only triples\nassociated with a, b or c are [abc], [a1 ab], [abb1 ].) Now, however, w contains Abelian\nfactors\n[a1 abc], [abca], [bcab], [cabb1 ],\nagain giving a contradiction.\nNow consider the case where w contains a factor bcy, y 6∈ {a, b, c}. Since abc\nis the only cycle in G, y is not a neighbour of b or a. Since ac is an edge of G,\neither ac or ca is a factor of w. Suppose ac is a factor of w. (The other case is\nsimilar.) Recall that the only triples associated with one of a, b or c are [abc], [xab]\nand [bcy]. The only one of these containing both a and c is [abc]. If ac is a factor\nof w, then it must therefore be preceded and followed by b, and occurs in the\ncontext bacb. Since neither of [xab] and [bcy] is associated with b, cb is followed\nby a. Again. ba is preceded by c, so ac occurs in the context cbacba. Since w is\nrecurrent, it cannot have (cba)ω as a suffix. It follows that w must have a factor\ncbacbax. This implies that [cbac], [bacb], [acba], [cbax] are length 4 Abelian factors\nof w. As in previous cases, the paths attached to vertices a and c of triangle abc\nfurnish another n − 3 distinct length 4 Abelian factors, giving a contradiction.\nThe final case occurs when w contains a factor cay, y 6∈ {a, b, c}. In this case\nG consists of a triangle with two disjoint paths attached at a. In the usual way,\nwe find n − 3 length 4 Abelian factors of w, each containing at least two path\nvertices (i.e. vertices of G − {a, b, c}). If abcabc or cbacba were a factor of w, w\nwould then contain 4 additional length 4 Abelian factors [abca], [bcab], [cabc] and\n[bcay], giving a contradiction. We therefore conclude that the only factor of w of\nthe form x{a, b, c}∗ y is xabcay, and the only factor of w of the form y{a, b, c}∗x is\nxabcay. Thus, if L1 is the leaf at the end of the path starting with a − x and L2\nis the leaf at the end of the path starting with a − y, w has only one factor of the\nform L1 (Σ − {L1 , L2 }∗ )L2 , and only one factor of the form L2 (Σ − {L1 , L2 }∗ )L1 ,\nso that w is periodic, oscillating between L1 and L2 . The periodicity of w gives a\ncontradiction.✷\n13\n\n\fReferences\n[1] E. M. Coven and G. A. Hedlund, \"Sequences with minimal block growth\",\nMathematical Systems Theory 7 (1973), 138–153.\n[2] M. Morse and G. A. Hedlund, \"Symbolic Dynamics II: Sturmian trajectories\",\nAmer. J. Math. 62 (1940), 1–42.\n[3] G. Richomme, K. Saari, L. Q. Zamboni, \"Abelian complexity in minimal\nsubshifts\". Preprint available at http://arxiv.org/abs/0911.2914.\n\n14\n\n\f"}