{"id": "http://arxiv.org/abs/0806.3017v8", "guidislink": true, "updated": "2009-12-31T09:42:59Z", "updated_parsed": [2009, 12, 31, 9, 42, 59, 3, 365, 0], "published": "2008-06-18T14:36:47Z", "published_parsed": [2008, 6, 18, 14, 36, 47, 2, 170, 0], "title": "Classical and relativistic orbital motions around a mass-varying body", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0806.3578%2C0806.3110%2C0806.4240%2C0806.2563%2C0806.1502%2C0806.1326%2C0806.4242%2C0806.4640%2C0806.2219%2C0806.0311%2C0806.1825%2C0806.1759%2C0806.4957%2C0806.2618%2C0806.2093%2C0806.2871%2C0806.1048%2C0806.2588%2C0806.0713%2C0806.1914%2C0806.0226%2C0806.0228%2C0806.1769%2C0806.4421%2C0806.1024%2C0806.3407%2C0806.3309%2C0806.1349%2C0806.0261%2C0806.0574%2C0806.1324%2C0806.1190%2C0806.2273%2C0806.3306%2C0806.1306%2C0806.1696%2C0806.2584%2C0806.3017%2C0806.1732%2C0806.1359%2C0806.2293%2C0806.2789%2C0806.3323%2C0806.4073%2C0806.3016%2C0806.4575%2C0806.1606%2C0806.2459%2C0806.0304%2C0806.4333%2C0806.1948%2C0806.2282%2C0806.3031%2C0806.3760%2C0806.2105%2C0806.1576%2C0806.4913%2C0806.1362%2C0806.3107%2C0806.0289%2C0806.2629%2C0806.4507%2C0806.0444%2C0806.1255%2C0806.4049%2C0806.0632%2C0806.4379%2C0806.2859%2C0806.4650%2C0806.0680%2C0806.3571%2C0806.1287%2C0806.4312%2C0806.0987%2C0806.2485%2C0806.3160%2C0806.2394%2C0806.0401%2C0806.2145%2C0806.1410%2C0806.0033%2C0806.1653%2C0806.4662%2C0806.1321%2C0806.0855%2C0806.3930%2C0806.4372%2C0806.1631%2C0806.3354%2C0806.2272%2C0806.2553%2C0806.3210%2C0806.0056%2C0806.2265%2C0806.2711%2C0806.3198%2C0806.1775%2C0806.2109%2C0806.2194%2C0806.1939%2C0806.2137&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Classical and relativistic orbital motions around a mass-varying body"}, "summary": "I calculate the classical effects induced by an isotropic mass loss of a body\non the orbital motion of a test particle around it; the present analysis is\nalso valid for a variation of the Newtonian constant of gravitation. I\nperturbatively obtain negative secular rates for the osculating semimajor axis,\nthe eccentricity and the mean anomaly, while the argument of pericenter does\nnot undergo secular precession; the node and the inclination i remain\nunchanged. The anomalistic period is different from the Keplerian one, being\nlarger than it. The true orbit, instead, expands, as shown by a numerical\nintegration of the equations of motion in Cartesian coordinates; in fact, this\nis in agreement with the seemingly counter-intuitive decreasing of the\nsemimajor axis and the eccentricity because they refer to the osculating\nKeplerian ellipses which approximate the trajectory at each instant. A\ncomparison with the results obtained with different approaches by other\nresearchers is made. General relativity induces positive secular rates of the\nsemimajor axis and the eccentricity completely negligible in the present and\nfuture evolution of the solar system.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0806.3578%2C0806.3110%2C0806.4240%2C0806.2563%2C0806.1502%2C0806.1326%2C0806.4242%2C0806.4640%2C0806.2219%2C0806.0311%2C0806.1825%2C0806.1759%2C0806.4957%2C0806.2618%2C0806.2093%2C0806.2871%2C0806.1048%2C0806.2588%2C0806.0713%2C0806.1914%2C0806.0226%2C0806.0228%2C0806.1769%2C0806.4421%2C0806.1024%2C0806.3407%2C0806.3309%2C0806.1349%2C0806.0261%2C0806.0574%2C0806.1324%2C0806.1190%2C0806.2273%2C0806.3306%2C0806.1306%2C0806.1696%2C0806.2584%2C0806.3017%2C0806.1732%2C0806.1359%2C0806.2293%2C0806.2789%2C0806.3323%2C0806.4073%2C0806.3016%2C0806.4575%2C0806.1606%2C0806.2459%2C0806.0304%2C0806.4333%2C0806.1948%2C0806.2282%2C0806.3031%2C0806.3760%2C0806.2105%2C0806.1576%2C0806.4913%2C0806.1362%2C0806.3107%2C0806.0289%2C0806.2629%2C0806.4507%2C0806.0444%2C0806.1255%2C0806.4049%2C0806.0632%2C0806.4379%2C0806.2859%2C0806.4650%2C0806.0680%2C0806.3571%2C0806.1287%2C0806.4312%2C0806.0987%2C0806.2485%2C0806.3160%2C0806.2394%2C0806.0401%2C0806.2145%2C0806.1410%2C0806.0033%2C0806.1653%2C0806.4662%2C0806.1321%2C0806.0855%2C0806.3930%2C0806.4372%2C0806.1631%2C0806.3354%2C0806.2272%2C0806.2553%2C0806.3210%2C0806.0056%2C0806.2265%2C0806.2711%2C0806.3198%2C0806.1775%2C0806.2109%2C0806.2194%2C0806.1939%2C0806.2137&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "I calculate the classical effects induced by an isotropic mass loss of a body\non the orbital motion of a test particle around it; the present analysis is\nalso valid for a variation of the Newtonian constant of gravitation. I\nperturbatively obtain negative secular rates for the osculating semimajor axis,\nthe eccentricity and the mean anomaly, while the argument of pericenter does\nnot undergo secular precession; the node and the inclination i remain\nunchanged. The anomalistic period is different from the Keplerian one, being\nlarger than it. The true orbit, instead, expands, as shown by a numerical\nintegration of the equations of motion in Cartesian coordinates; in fact, this\nis in agreement with the seemingly counter-intuitive decreasing of the\nsemimajor axis and the eccentricity because they refer to the osculating\nKeplerian ellipses which approximate the trajectory at each instant. A\ncomparison with the results obtained with different approaches by other\nresearchers is made. General relativity induces positive secular rates of the\nsemimajor axis and the eccentricity completely negligible in the present and\nfuture evolution of the solar system."}, "authors": ["Lorenzo Iorio"], "author_detail": {"name": "Lorenzo Iorio"}, "author": "Lorenzo Iorio", "links": [{"title": "doi", "href": "http://dx.doi.org/10.3814/2010/261249", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/0806.3017v8", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0806.3017v8", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "LaTex, 27 pages, no tables, 7 figures, 31 references. To appear in\n  Scholarly Research Exchange (SRX Physics)", "arxiv_primary_category": {"term": "gr-qc", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "gr-qc", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "physics.space-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0806.3017v8", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0806.3017v8", "journal_reference": "SRX Physics Volume 2010 (2010), Article ID 261249", "doi": "10.3814/2010/261249", "fulltext": "arXiv:0806.3017v8 [gr-qc] 31 Dec 2009\n\nClassical and relativistic orbital motions around\na mass-varying body\nL. Iorio∗\n∗ INFN-Sezione di Pisa. Address for correspondence: Viale Unità di Italia\n68 70125 Bari (BA), Italy.\ne-mail: lorenzo.iorio@libero.it\nAbstract\nI work out the Newtonian and general relativistic effects due to an\nisotropic mass loss Ṁ /M of a body on the orbital motion of a test particle around it; the present analysis is also valid for a variation Ġ/G\nof the Newtonian constant of gravitation. Concerning the Newtonian\ncase, I use the Gauss equations for the variation of the elements and\nobtain negative secular rates for the osculating semimajor axis a, the\neccentricity e and the mean anomaly M, while the argument of pericenter ω does not experience secular precession; the longitude of the\nascending node Ω and the inclination i remain unchanged as well. The\nanomalistic period is different from the Keplerian one: it turns out\nto be larger than it. The true orbit, instead, expands, as shown by a\nnumerical integration of the equations of motion with MATHEMATICA; in fact, this is in agreement with the seemingly counter-intuitive\ndecreasing of a and e because they refer to the osculating Keplerian\nellipses which approximate the trajectory at each instant. A comparison with the results obtained with different approaches by other\nresearchers is made. General relativity induces positive secular rates\nof the semimajor axis and the eccentricity completely negligible in the\npresent and future evolution of the solar system.\n\nKeywords gravitation; stars: mass-loss; celestial mechanics\nPACS 95.30.Sf; 97.10.Me; 95.10.Ce\n\n1\n\nIntroduction\n\nIn this paper I investigate the classical orbital effects induced by an isotropic\nvariation Ṁ /M of the mass of a central body on the motion of a test particle; my analysis is valid also for a change Ġ/G of the Newtonian constant\nof gravitation. This problem, although interesting in itself, is not only an\nacademic one because of the relevance that it may have on the ultimate\ndestiny of planetary companions in many stellar systems in which the host\n1\n\n\fstar experiences a mass loss, like our Sun [1]. With respect to this aspect,\nmy analysis may be helpful in driving future researches towards the implementation of long-term N-body simulations including the temporal change\nof GM as well, especially over timescales covering paleoclimate changes, up\nto the Red Giant Branch (RGB) phase in which some of the inner planets\nshould be engulfed by the expanding Sun. Another problem, linked to the\none investigated here, which has recently received attention is the observationally determined secular variation of the Astronomical Unit [2, 3, 4, 5].\nMoreover, increasing accuracy in astrometry pointing towards microarcsecond level [6], and long-term stability in clocks [7] require to consider the\npossibility that smaller and subtler perturbations will be soon detectable in\nthe solar system. Also future planetary ephemerides should take into account Ṁ /M . Other phenomena which may, in principle, show connections\nwith the problem treated here are the secular decrease of the semimajor axes\nof the LAGEOS satellites, amounting to 1.1 mm d−1 , [8] and the increase\nof the lunar orbit's eccentricity of 0.9 × 10−11 yr−1 [9].\nMany treatments of the mass loss-driven orbital dynamics in the framework of the Newtonian mechanics, based on different approaches and laws\nof variation of the central body's mass, can be found in literature; see, e.g.,\n[10, 11, 12, 13, 14, 15, 16, 17, 18, 2, 4] and references therein. However, they\nare sometimes rather confused and involved, giving unclear results concerning the behavior of the Keplerian orbital elements and the true orbit.\nThe plan of the paper is as follows. Section 2 is devoted to a theoretical description of the phenomenon in a two-body scenario. By working in\nthe Newtonian framework, I will analytically work out the changes after\none orbital revolution experienced by all the Keplerian orbital elements of a\ntest particle moving in the gravitational field of a central mass experiencing\na variation of its GM linear in time. Then, I will clarify the meaning of\nthe results obtained by performing a numerical integration of the equations\nof motion in order to visualize the true trajectory followed by the planet.\nConcerning the method adopted, I will use the Gauss perturbation equations [19, 20], which are valid for generic disturbing accelerations depending\non position, velocity and time, the \"standard\" Keplerian orbital elements\n(the Type I according to, e.g., Ref. [16]) with the eccentric anomaly E as\n\"fast\" angular variable. Other approaches and angular variables like, e.g.\nthe Lagrange perturbation equations [19, 20], the Type II orbital elements\n[16] and the mean anomaly M could be used, but, in my opinion, at a price\nof major conceptual and computational difficulties1 . With respect to possi1\n\nThink, e.g., about the cumbersome expansions in terms of the mean anomaly and the\n\n2\n\n\fble connections with realistic situations, it should be noted that, after all,\nthe Type I orbital elements are usually determined or improved in standard\ndata reduction analyses of the motion of planets and (natural and artificial)\nsatellites. Instead, my approach should, hopefully, appear more transparent and easy to interpret, although, at first sight, some counter-intuitive\nresults concerning the semimajor axis and the eccentricity will be obtained;\nmoreover, for the chosen time variation of the mass of the primary, no approximations are used in the calculations which are quite straightforward.\nHowever, it is important to stress that such allegedly puzzling features are\nonly seemingly paradoxical because they will turn out to be in agreement\nwith numerical integrations of the equations of motion, as explicitly shown\nby the numerous pictures depicted. Anyway, the interested reader is advised\nto look also at Ref. [16] for a different approach. In Section 3 I will work\nwithin the general relativistic gravitoelectromagnetic framework by calculating the gravitoelectric effects on all the Keplerian orbital elements of a\nfreely falling test particle in a non-stationary gravitational field. Section 4\nis devoted to a discussion of the findings of other researchers and contains\nsome numerical calculations concerning the previously mentioned orbital\nphenomena of LAGEOS and the Moon. Section 5 summarizes my results.\n\n2\n\nAnalytical calculation of the orbital effects by\nμ̇/μ\n\nBy defining\nμ ≡ GM\n\n(1)\n\nat a given epoch t0 , the acceleration of a test particle orbiting a central body\nexperiencing a variation of μ is, to first order in t − t0 ,\n\u0014\n\u0012 \u0013\n\u0015\nμ̇\nμ\nμ(t)\n(t − t0 ) r̂,\n(2)\nA = − 2 r̂ ≈ − 2 1 +\nr\nr\nμ\nwith μ̇ ≡ μ̇|t=t0 . μ̇ will be assumed constant throughout the temporal\ninterval of interest ∆t = t − t0 , as it is, e.g., the case for most of the\nremaining lifetime of the Sun as a Main Sequence (MS) star [1]. Note that μ̇\ncan, in principle, be due to a variation of both the Newtonian gravitational\nconstant G and the mass M of the central body, so that\nĠ Ṁ\nμ̇\n= +\n.\nμ\nG M\n\n(3)\n\nHansen coefficients, the subtleties concerning the choice of the independent variable in the\nLagrange equations for the semimajor axis and the eccentricity [19].\n\n3\n\n\fMoreover, while the orbital angular momentum is conserved, this does not\nhappen for the energy.\nBy limiting ourselves to realistic astronomical scenarios like our solar\nsystem, it is quite realistic to assume that\n\u0012 \u0013\nμ̇\n(t − t0 ) ≪ 1\n(4)\nμ\nover most of its remaining lifetime: indeed, since Ṁ /M is of the order of2\n10−14 yr−1 for the Sun [1], the condition (4) is satisfied for the remaining3\n≈ 7.58 Gyr before the Sun will approach the RGB tip in the HertzsprungRussell Diagram (HRD). Thus, I can treat it perturbatively with the standard methods of celestial mechanics.\nThe unperturbed Keplerian ellipse at epoch t0 , assumed coinciding with\nthe time of the passage at perihelion tp , is characterized by\nr = a(1 − e cos E),\ndt =\n\n1−e cos E\nn\n\ncos f =\nsin f =\n\n\u0001\n\ndE,\n\ncos E−e\n1−e cos E ,\n\n(5)\n\n√\n\n1−e2 sin E\n1−e cos E ,\n\nwhere a and e are the semimajor axis and the eccentricity, respectively,\nwhich\nfix the size and the shape of the unchanging Keplerian orbit, n =\np\n3\nμ/a is its unperturbed Keplerian mean motion, f is the true anomaly,\nreckoned from the pericentre, and E is the eccentric anomaly. This would\nbe the path followed by the particle for any t > tp if the mass loss would\nsuddenly cease at tp . Instead, the true path will be different because of\nthe perturbation induced by μ̇ and the orbital parameters of the osculating\nellipses approximating the real trajectory at each instant of time will slowly\nchange in time.\n2\n\nAbout 80% of such a mass-loss is due to the core nuclear burning, while the remaining\n20% is due to average solar wind.\n3\nThe age of the present-day MS Sun is 4.58 Gyr, counted from its zero-age MS star\nmodel [1].\n\n4\n\n\f2.1\n\nThe semimajor axis and the eccentricity\n\nThe Gauss equation for the variation of the semimajor axis a is [19, 20]\n\u0010 p \u0011i\nh\nda\n2\n,\n(6)\n= √\neAr sin f + Aτ\ndt\nr\nn 1 − e2\n\nwhere Ar and Aτ are the radial and transverse, i.e. orthogonal to the direction of r̂, components, respectively, of the disturbing acceleration, and\np = a(1 − e2 ) is the semilatus rectum. In the present case\nA ≡ Ar = −\n\nμ̇\n(t − tp ),\nr2\n\n(7)\n\ni.e. there is an entirely radial perturbing acceleration. For μ̇ < 0, i.e. a\ndecrease in the body's GM , the total gravitational attraction felt by the\ntest particle, given by (2), is reduced with respect to the epoch tp . In order\nto have the rate of the semimajor axis averaged over one (Keplerian) orbital\nrevolution (7) must be inserted into (6), evaluated onto the unperturbed\nKeplerian ellipse with (5) and finally integrated over ndt/2π from 0 to 2π\nbecause n/2π = 1/P Kep (see below). Note that, from (5), it can be obtained\nt − tp =\n\nE − e sin E\n.\nn\n\n(8)\n\nAs a result, I have\n\u001c \u001d\n\u0012 \u0013 Z 2π\n\u0013\u0012 \u0013\n\u0012\nda\n(E − e sin E) sin E\nμ̇\ne μ̇\ne\n=−\na\na. (9)\ndE = 2\n2\ndt\nπ μ\n1−e\nμ\n(1 − e cos E)\n0\nNote that if μ decreases a gets reduced as well: hȧi < 0. This may be\nseemingly bizarre and counter-intuitive, but, as it will be shown later, it is\nnot in contrast with the true orbital motion.\nThe Gauss equation for the variation of the eccentricity is [19, 20]\n√\n\u0015\u001b\n\u001a\n\u0014\n1 − e2\nde\nr\u0011\n1\u0010\n1−\n=\n.\n(10)\nAr sin f + Aτ cos f +\ndt\nna\ne\na\n\nFor A = Ar , it reduces to\n\nde\n=\ndt\nso that\n\n\u001c\n\nde\ndt\n\n\u001d\n\n\u0012\n\n1 − e2\n2ae\n\n\u0013\n\nda\n,\ndt\n\n\u0012 \u0013\nμ̇\n= (1 + e)\n;\nμ\n5\n\n(11)\n\n(12)\n\n\falso the eccentricity gets smaller for μ̇ < 0.\nAs a consequence of the found variations of the osculating semimajor\naxis and the eccentricity, the osculating orbital angular momentum per unit\nmass, defined by L2 = μa(1 − e2 ), remains constant: indeed, by using (9)\nand (12), it turns out\n\u001c 2\u001d\ndL\n= μ hȧi (1 − e2 ) − 2μae hėi = 0.\n(13)\ndt\nThe osculating total energy E = −μ/2a decreases according to\n\u0012\n\u0013\n\u001c \u001d\ne\nμ̇\nμ\ndE\n.\n= 2 hȧi =\ndt\n2a\n1−e a\nMoreover, the osculating Keplerian period\ns\n2π\na3\nP Kep ≡\n= 2π\n,\nn\nμ\n\n(14)\n\n(15)\n\nwhich, by definition, yields the time elapsed between two consecutive perihelion crossings in absence of perturbation, i.e. it is the time required to\ndescribe a fixed osculating Keplerian ellipse, decreases according to\n\u0012 \u00133/2\n\u001c Kep \u001d\na\n6πeμ̇\n3 Kep hȧi\ndP\n.\n(16)\n=\n= P\ndt\n2\na\n(1 − e) μ\nAs I will show, also such a result is not in contrast with the genuine orbital\nevolution.\n\n2.2\n\nThe pericentre, the node and the inclination\n\nThe Gauss equation for the variation of the pericentre ω is [19, 20]\n√\n\u0014\n\u0013\n\u0015\n\u0012\ndω\ndΩ\n1 − e2\nr\n=\n−Ar cos f + Aτ 1 +\nsin f − cos i ,\ndt\nnae\np\ndt\n\n(17)\n\nwhere i and Ω are the the inclination and the longitude of the ascending\nnode, respectively, which fix the orientation of the osculating ellipse in the\ninertial space. Since dΩ/dt and di/dt depend on the normal component\nAν of the disturbing acceleration, which is absent in the present case, and\nA = Ar , I have\n\u001c \u001d √\n\u0012 \u0013 Z 2π\n1 − e2 μ̇\ndω\n(E − e sin E)(cos E − e)\ndE = 0 :\n(18)\n=\ndt\n2πe\nμ\n(1 − e cos E)2\n0\nthe osculating ellipse does not change its orientation in the orbital plane,\nwhich, incidentally, remains fixed in the inertial space because Aν = 0 and,\nthus, dΩ/dt = di/dt = 0.\n6\n\n\f2.3\n\nThe mean anomaly\n\nThe Gauss equation for the mean anomaly M, defined as M = n(t − tp ),\n[19, 20] is\n\u0012\n\u0013\ndM\ndω\n2\nr p\ndΩ\n2\n=n−\nAr − 1 − e\n+ cos i\n.\n(19)\ndt\nna a\ndt\ndt\n\nIt turns out that, since\n−\n\nr\n2μ̇\n2\nAr dt = 3 3 (E − e sin E)dE,\nna a\nn a\n\u001c\n\u001d\n\u0012 \u0013\ndM\nμ̇\n= n + 2π\n;\ndt\nμ\n\n(20)\n(21)\n\nthe mean anomaly changes uniformly in time at a slower rate with respect\nto the unperturbed Keplerian case for μ̇ < 0.\n\n2.4\n\nNumerical integration of the equations of motion and\nexplanation of the seeming contradiction with the analytical results\n\nAt first sight, the results obtained here may be rather confusing: if the\ngravitational attraction of the Sun reduces in time because of its mass loss\nthe orbits of the planets should expand (see the trajectory plotted in Figure\n1, numerically integrated with MATHEMATICA), while I obtained that the\nsemimajor axis and the eccentricity undergo secular decrements. Moreover,\nI found that the Keplerian period P Kep decreases, while one would expect\nthat the orbital period increases.\nIn fact, there is no contradiction, and my analytical results do yield us\nrealistic information on the true evolution of the planetary motion. Indeed,\na, e and P Kep refer to the osculating Keplerian ellipses which, at any instant,\napproximate the true trajectory; it, instead, is not an ellipse, not being\nbounded. Let us start at tp from the osculating pericentre of the Keplerian\nellipse corresponding to chosen initial conditions: let us use a heliocentric\nframe with the x axis oriented along the osculating pericentre. After a\ntrue revolution, i.e. when the true radius vector of the planet has swept\nan angular interval of 2π, the planet finds itself again on the x axis, but\nat a larger distance from the starting point because of the orbit expansion\ninduced by the Sun's mass loss. It is not difficult to understand that the\nosculating Keplerian ellipse approximating the trajectory at this perihelion\npassage is oriented as before because there is no variation of the (osculating)\n7\n\n\fy, AU\n\n0.4\n0.2\n-2\n\n-1.5\n\n-1\n\nx, AU\n\n-0.5\n-0.2\n-0.4\n\nFigure 1: Black continuous line: true trajectory obtained by numerically\nintegrating with MATHEMATICA the perturbed equations of motion in\nCartesian coordinates over 2 yr; the disturbing acceleration (2) has been\nadopted. The planet starts from the perihelion on the x axis. Just for\nillustrative purposes, a mass loss rate of the order of 10−2 yr−1 has been\nadopted for the Sun; for the planet initial conditions corresponding to a = 1\nAU, e = 0.8 have been chosen. Red dashed line: unperturbed Keplerian\nellipse at t = t0 = tp . Blue dash-dotted line: osculating Keplerian ellipse\nafter the first perihelion passage. As can be noted, its semimajor axis and\neccentricity are clearly smaller than those of the initial unperturbed ellipse.\nNote also that after 2 yr the planet has not yet reached the perihelion as\nit would have done in absence of mass loss, i.e. the true orbital period is\nlonger than the Keplerian one of the osculating red ellipse.\n\n8\n\n\fargument of pericentre, but has smaller semimajor axis and eccentricity.\nAnd so on, revolution after revolution, until the perturbation theory can be\napplied, i.e. until μ̇/μ(t − tp ) << 1. In Figure 1 the situation described so\nfar is qualitatively illustrated. Just for illustrative purposes I enhanced the\noverall effect by assuming μ̇/μ ≈ 10−2 yr−1 for the Sun; the initial conditions\nfor the planet correspond to an unperturbed Keplerian ellipse with a = 1 AU,\ne = 0.8 with the present-day value of the Sun's mass in one of its foci. It is\napparent that the initial osculating red dashed ellipse has larger a and e with\nrespect to the second osculating blue dash-dotted ellipse. Note also that the\ntrue orbital period, intended as the time elapsed between two consecutive\ncrossings of the perihelion, is larger than the unperturbed Keplerian one of\nthe initial red dashed osculating ellipse, which would amount to 1 yr for the\nEarth: indeed, after 2 yr the planet has not yet reached the perihelion for\nits second passage.\nNow, if I compute the radial change ∆r(E) in the osculating radius vector\nas a function of the eccentric anomaly E I can gain useful insights concerning how much the true path has expanded after two consecutive perihelion\npassages. From the Keplerian expression of the Sun-planet distance\nr = a(1 − e cos E)\n\n(22)\n\none gets the radial component of the orbital perturbation expressed in terms\nof the eccentric anomaly E\n∆r(E) = (1 − e cos E) ∆a − a cos E ∆e + ae sin E ∆E;\n\n(23)\n\nit agrees with the results obtained by, e.g., Casotto in Ref. [21]. Since\n\u0010 \u0011\u0010\n\u0011\n\n2ae μ̇\nsin E−E cos E\n\n∆a\n=\n−\n,\n\nn\nμ\n1−e cos E\n\n\n\n\n\n\n\u0010 \u0011\u0010\n\u0011\n2)\nμ̇\nsin E−E cos E\n(24)\n∆e = − (1−e\n,\nn\nμ\n1−e cos E\n\n\n\n\n\n\u0011\n\u0010 \u0011\n\u0010\n\n\n∆M+sin E ∆e\n ∆E =\n= 1 μ̇ [A(E) + B(E) + C(E)] ,\n1−e cos E\n\nwith\n\nn\n\nμ\n\n\n2\nE−1)\n\n,\nA(E) = E +2e(cos\n\n1−e cos E\n\n\n\n\n\u0010 2\u0011h\ni\n\n1+e−(1+e) cos E−E sin E\n1−e\nB(E) =\n,\ne\n(1−e cos E)2\n\n\n\n\n\n\n C(E) = − (1−e2 ) sin E(sin E−e cos E) ,\n(1−e cos E)2\n9\n\n(25)\n\n\fit follows\n\na\n∆r(E) =\nn\n\n\u0012 \u0013\nμ̇\n[D(E) + F(E)] ,\nμ\n\nwith\n\n\u0014\n\n D(E) = e −2(sin E − E cos E) +\n\n\n\nsin E [E 2 +2e(cos E−1)]\n1−e cos E\n\n(26)\n\n−\n\n(1−e2 ) sin2 E(sin E−e cos E)\n(1−e cos E)2\n\n\n\u0010\n\u0011n\nh\nio\n\n\n1+e−(1+e) cos E−E sin E\n1−e2\n F(E) =\ncos\nE(sin\nE\n−\nE\ncos\nE)\n+\nsin\nE\n.\n1−e cos E\n1−e cos E\n(27)\nFrom (26) and (27) it turns out that for E > 0 ∆r(E) never vanishes;\nafter one orbital revolution, i.e. after that an angular interval of 2π has\nbeen swept by the (osculating) radius vector, a net increase of the radial\n(osculating) distance occurs according to4\n\u0012 \u0013\nμ̇\n2π\n(1 − e).\n(28)\n∆r(2π) − ∆r(0) = ∆r(2π) = − a\nn\nμ\nThis analytical result is qualitatively confirmed by the difference5 ∆r(t)\nbetween the radial distances obtained from the solutions of two numerical\nintegrations with MATHEMATICA of the equations of motion over 3 yr\nwith and without μ̇/μ; the initial conditions are the same. For illustrative\npurposes I used a = 1 AU, e = 0.01, μ̇/μ = −0.1 yr−1 . The result is depicted\nin Figure 2. Note also that (26) and (27) tell us that the shift at the aphelion\nis\n\u0012\n\u0013\n1 1+e\n∆r(π) =\n∆r(2π),\n(29)\n2 1−e\n\nin agreement with Figure 1 where it is 4.5 times larger than the shift at the\nperihelion.\nSince Figure 1 tells us that the orbital period gets larger than the Keplerian one, it means that the true orbit must somehow remain behind with\nrespect to the Keplerian one. Thus, a negative perturbation ∆τ in the\ntransverse direction must occur as well; see Figure 3.\nLet us now analytically compute it. According to Ref. [21], it can be\nused\np\na sin E\n+ a 1 − e2 ∆E + r(∆ω + ∆Ω cos i).\n(30)\n∆τ = √\n1 − e2\n4\n\nAccording to (26) and (27), ∆r(0) = 0.\nStrictly speaking, ∆r and the quantity plotted in Figure 2 are different objects, but,\nas the following discussion will clarify, I can assume that, in practice, they are the same.\n5\n\n10\n\n\u0015\n\n,\n\n\fDr HAUL\n0.4\n0.3\n0.2\n0.1\n\n0.5\n\n1\n\n1.5\n\n2\n\n2.5\n\n3\n\nt HyrL\n\nFigure 2: Difference ∆r(t) between the radial distances obtained from the\nsolutions of two numerical integrations with MATHEMATICA of the equations of motion over 3 yr with and without μ̇/μ; the initial conditions are\nthe same. Just for illustrative purposes a mass loss rate of the order of\n−10−1 yr−1 has been adopted for the Sun; for the planet initial conditions\ncorresponding to a = 1 AU, e = 0.01 have been chosen. The cumulative\nincrease of the Sun-planet distance induced by the mass loss is apparent.\n\n11\n\n\fTrue orbit\nUnperturbed ellipse\nr\n\n∆r\n∆τ\n\nr pert\n\n∆\n\nLine of the\napsides\n\nFigure 3: Radial and transverse perturbations ∆r and ∆τ of the Keplerian\nradius vector (in blue); the presence of the transverse perturbation ∆τ\nmakes the real orbit (in red) lagging behind the Keplerian one.\n\n12\n\n\fBy recalling that, in the present case, ∆Ω = 0 and using\n√\n\u0012 \u0013\u0014\n\u0015\n1 + e − (1 + e) cos E − E sin E\n1 − e2 μ̇\n∆ω = −\n,\nne\nμ\n1 − e cos E\n\n(31)\n\nit is possible to obtain from (24) and (31)\n\u0012 \u0013 √\na μ̇\n1 − e2\n∆τ (E) =\n[G(E) + H(E) + I(E) + J (E) + K(E)] ,\nn μ (1 − e cos E)\n(32)\nwith\n\n\nG(E) = sin E(E cos E − sin E),\n\n\n\n\n\n\n\n\nH(E) = (1−e ecos E) [(1 + e)(cos E − 1) + E sin E] ,\n\n\n\n\n\n\n\nI(E) = E 2 + 2e(cos E − 1),\n(33)\n\n\nh\ni\n\n2\n\ncos E−sin E)\n\n\nJ (E) = sin E (1−e )(e\n\n1−e cos E\n\n\n\n\n\ni\n\u0010 2\u0011h\n\n\n(1+e)(1−e cos E)−E sin E\n\n1−e\n K(E) =\n.\ne\n\n1−e cos E\n\nFrom (32) and (33) it turns out that for E > 0 ∆τ (E) never vanishes; at\nthe (osculating) time of perihelion passage\n\u0012 \u0013r\n4π 2\n1+e\nμ̇\n∆τ (2π) − ∆τ (0) =\na\n< 0.\n(34)\nn\nμ\n1−e\nThis means that when the Keplerian path has reached the perihelion, the\nperturbed orbit is still behind it. Such features are qualitatively confirmed\nby Figure 1.\nFrom a vectorial point of view, the radial and transverse perturbations\nto the Keplerian radius vector r yield a correction\n∆ = ∆r r̂ + ∆τ τ̂ ,\n\n(35)\n\nr pert = r + ∆.\n\n(36)\n\nso that\nThe length of ∆ is\n∆(E) =\n\np\n\n∆r(E)2 + ∆τ (E)2 ;\n\n13\n\n(37)\n\n\f(28) and (32) tell us that at perihelion it amounts to\ns\n(1 + e)\n.\n∆(2π) = ∆r(2π) 1 + 4π 2\n(1 − e)3\n\n(38)\n\nThe angle ξ between ∆ and r is given by\ntan ξ(E) =\n\n∆τ (E)\n;\n∆r(E)\n\nat perihelion it is\ntan ξ(2π) = −2π\n\n√\n\n1+e\n,\n(1 − e)3/2\n\n(39)\n\n(40)\n\ni.e. ξ is close to −90 deg; for the Earth it is −81.1 deg. Thus, the difference\nδ between the lengths of the perturbed radius vector rpert and the Keplerian\none r at a given instant amounts to about\nδ ≈ ∆ cos ξ;\n\n(41)\n\nif fact, this is precisely the quantity determined over 3 yr by the numerical\nintegration of Figure 2. At the perihelion I have\ns\n(1 + e)\nδ = ∆r(2π) 1 + 4π 2\ncos ξ;\n(42)\n(1 − e)3\nsince for the Earth\ns\n\n1 + 4π 2\n\n(1 + e)\ncos ξ = 1.0037,\n(1 − e)3\n\n(43)\n\nδ ≈ ∆r(2π).\n\n(44)\n\nit holds\nThis explains why Figure 2 gives us just ∆r.\nSince the approximate calculations of other researchers often refer to\ncircular orbits, and in view of the fact that when a Sun-like star evolves into a\ngiant tidal interactions circularize6 the orbit of a planet [22], it is interesting\nto consider also such limiting case in which other nonsingular osculating\norbital elements must be adopted. The eccentricity and the pericentre lose\ntheir meaning: thus, it is not surprising that (12), although formally valid\nfor e → 0, yields a meaningless result, i.e. the eccentricity would become\nnegative. Instead, the semimajor axis is still valid and (9) predicts that\n14\n\n\fy, AU\n1\n\n0.5\n\n-1\n\n-0.5\n\n0.5\n\n1\n\nx, AU\n\n-0.5\n\n-1\n\nFigure 4: Black continuous line: true trajectory obtained by numerically\nintegrating with MATHEMATICA the perturbed equations of motion in\nCartesian coordinates over 2 yr ; the disturbing acceleration (2) has been\nadopted. The planet starts from a point on the x axis. Just for illustrative\npurposes, a mass loss rate of the order of −10−2 yr−1 has been adopted\nfor the Sun; for the planet initial conditions corresponding to a = 1 AU,\ne = 0.0 have been chosen. Red dashed line: unperturbed Keplerian circle\nat t = t0 . Blue dash-dotted line: osculating Keplerian circle after the first\nx axis crossing. As can be noted, its semimajor axis and eccentricity are\nequal to those of the initial unperturbed circle. Note also that after 2 yr the\nplanet has not yet reached the x axis as it would have done in absence of\nmass loss.\n15\n\n\fhȧi = 0 for e → 0. The constancy of the osculating semimajor axis is not in\ncontrast with the true trajectory, as clearly showed by Figure 4. Again, the\ntrue orbital period is larger than the Keplerian one which, contrary to the\neccentric case, remains fixed. Since D(E) = 0 for e = 0 and F(2π)|e=0 =\n−2π, F(0)|e=0 = 0, the radial shift per revolution is\n\u0012 \u0013\n2π\nμ̇\n∆r(2π)|e=0 = − a\n.\n(45)\nn\nμ\nAlso in this case the secular increase of the radial distance is present, as\nqualitatively shown by Figure 5. Concerning ∆τ , after 2π it is\n\u0012 \u0013\nμ̇\n4π 2\n∆τ (2π) =\na\n;\n(46)\nn\nμ\nalso in this case, the orbital period is larger than the unperturbed one.\n\n3\n\nThe general relativistic case\n\nThe field equations of general relativity are non-linear, but in the slowmotion (β = v/c ≪ 1) and weak-field (U/c2 ≪ 1) approximation they get\nlinearized resembling to the linear equations of the Maxwellian electromagnetism; here v and U are the magnitudes of the typical velocities and the\ngravitational potential of the problem under consideration. This scenario\nis known as gravitoelectromagnetism [24, 25]. In this case the space-time\nmetric is given by\n\u0012\n\u0013\n\u0013\n\u0012\nΦ\n4\nΦ\n(47)\nds2 = 1 − 2 2 c2 dt2 + (H * dr) dt − 1 + 2 2 δij dxi dxj ,\nc\nc\nc\nwhere, far from the source, the dominant contributions to the gravitoelectromagnetic potentials can be expressed as\nΦ=\n\nGJ ×r\nμ\n, H=\n.\nr\nc r3\n\n(48)\n\nHere J is the proper angular momentum of the central body of mass M\nand r is so that r ≫ GM/c2 and r ≫ J/(M c); c is the speed of light in\nvacuum. For a non-stationary source the geodesic equations of motion yield\n6\n\nThis fact has been quantitatively proven by the observation of convective binary stars\n[23].\n\n16\n\n\fDr HAUL\n0.4\n\n0.3\n\n0.2\n\n0.1\n\n0.5\n\n1\n\n1.5\n\n2\n\n2.5\n\n3\n\nt HyrL\n\nFigure 5: Difference ∆r(t) between the radial distances obtained from the\nsolutions of two numerical integrations with MATHEMATICA of the equations of motion over 3 yr with and without μ̇/μ; the initial conditions are\nthe same. Just for illustrative purposes a mass loss rate of the order of 10−1\nyr−1 has been adopted for the Sun; for the planet initial conditions corresponding to a = 1 AU, e = 0.0 have been chosen. The cumulative increase\nof the Sun-planet distance induced by the mass loss is apparent.\n\n17\n\n\f[26], among other terms, −β i (3 − β 2 )Φ,0 , i = 1, 2, 3 which, to order O(c−2 ),\nreduces to\n!\nμ̇ v\nGM Ġ Ṁ v\nA = −3 2 = −3 2\n+\n.\n(49)\nc r\nc\nG M r\nFor μ̇ < 0 such a perturbing acceleration is directed along the velocity of the\ntest particle. Although of no practical interest, being of the order of 10−24\nm s−2 in the case of a typical Sun-planet system with Ṁ /M = −9 × 10−14\nyr−1 , I will explicitly work out the orbital effects of (49); the effects of the\ntemporal variations of J have already been worked out elsewhere [27, 26].\nAlso in this case I will use the Gauss perturbative case. Since the radial and\ntransverse components of the unperturbed velocity are\nnae sin f\n,\nvr = √\n1 − e2\nvτ =\n\nna(1 + e cos f )\n√\n,\n1 − e2\n\n(50)\n(51)\n\nthe radial and transverse components of (49), evaluated onto the unperturbed Keplerian orbit, are\n3μ̇ ne sin E\n,\nc2 (1 − e cos E)2\n√\n3μ̇ n 1 − e2\nAτ = − 2\n.\nc (1 − e cos E)2\nAr = −\n\nAfter lengthy calculations they yield\n\u0012\n\u001c \u001d\n\u0013\n2\nda\n6μ̇\n=− 2 √\n−1 ,\ndt\nc\n1 − e2\n\u0012\n\u0013\n\u001c \u001d\n1\n3μ̇μ\nde\n√\n= 2 4 (2 − e) 1 −\n.\ndt\nc a e\n1 − e2\n\n(52)\n\n(53)\n\n(54)\n(55)\n\nContrary to the classical case, now both the osculating semimajor axis and\nthe eccentricity increase for μ̇ < 0. It turns out that the pericentre and the\nmean anomaly do not secularly precess. Also in this case the inclination and\nthe node are not affected The qualitative features of the motion with the\nperturbation (49) are depicted in Figure 6 in which the magnitude of the\nrelativistic term has been greatly enhanced for illustrative purposes.\n\n18\n\n\fy, AU\n0.75\n0.5\n0.25\n-2.5\n\n-2\n\n-1.5\n\n-1\n\n-0.5\n-0.25\n\nx, AU\n\n-0.5\n-0.75\nFigure 6: Black continuous line: true trajectory obtained by numerically\nintegrating over 3 yr the equations of motion perturbed by (49). The planet\nstarts from the perihelion on the x axis. Just for illustrative purposes, a\nfactor −3μ̇/c2 of the order of 5×10−2 AU yr−1 has been adopted for the Sun;\nfor the planet initial conditions corresponding to a = 1 AU, e = 0.8 have\nbeen chosen. Red dashed line: unperturbed Keplerian ellipse at t = t0 = tp .\nBlue dash-dotted line: osculating Keplerian ellipse after the first perihelion\npassage. As can be noted, its semimajor axis and eccentricity are larger\nthan those of the initial unperturbed ellipse.\n\n19\n\n\f4\n\nDiscussion of other approaches and numerical\ncalculations\n\nHere I will briefly review some of the results obtained by others by comparing\nwith ours.\nHadjidemetriou in Ref. [14] uses a tangential perturbing acceleration\nproportional to the test particle's velocity v,\n\u0014\n\u0015\n1 μ̇\nA=−\nv,\n(56)\n2 μ(t)\nand a different perturbative approach by finding that, for a generic mass loss,\nthe semimajor axis secularly increases and the eccentricity remains constant.\nIn fact, with the approach followed here it would be possible to show that,\nto first order in (μ̇/μ)(t − t0 ), hȧi = −(μ̇/μ)a and hėi = 0 and that the true\norbit is expanding, although in a different way with respect to (2) as depicted\nby Figure 7 in which the magnitude of the mass-loss has been exaggerated\nfor better showing its orbital effects. However, it must be noted that a term\nlike (56) is inadmissible in any relativistic theory of gravitation because it\nviolates the Lorentz invariance. Indeed, this fact is explicitly shown for\ngeneral relativity by Bini et al. in Ref. [26] where the full equations of\nmotion of a test particle in a non-stationary gravitoelectromagnetic field are\nworked out (see, eq. (14) of Ref. [26]). In deriving them it is admitted that,\nin general, Φ = Φ(t, r), but no gravitoelectric terms like (56) occur. Instead,\n(2) is compatible with eq. (14) of Ref. [26].\nSchröder and Smith in Ref. [1], by assuming the conservation of the\nangular momentum, derive the orbital expansion by means of equations\nvalid, instead, for orbits with constant radius only, i.e. v 2 /r = μ(t)/r 2\nand L p\n= vr. Then, they assume that not only v but also r vary and put\nv(t) = μ(t)/r, which is, instead, valid for circular orbits of constant radius\nonly, into L = v(t)r(t) = vr getting μ(t)r(t) = μr, where in my notation r\nand μ refers to the initial epoch t0 . With such an approach they obtain an\nexpanded terrestrial orbit up to about 2 times larger than mine.\nNoerdlinger in Ref. [4], following Jeans [12] and Kevorkian and Cole [18],\nassumes for the variation of a quantity identified by him with the semimajor\naxis the following expression\na(t)μ(t) = aμ :\n\n(57)\n\nthus, his semimajor axis gets larger. Note that such an equation is the same\nobtained by Ref. [1]. By assuming a variation of μ linear in time (57) would\n20\n\n\fy, AU\n0.75\n0.5\n0.25\n-2.5\n\n-2\n\n-1.5\n\n-1\n\n-0.5\n-0.25\n\nx, AU\n\n-0.5\n-0.75\nFigure 7: Black continuous line: true trajectory obtained by numerically\nintegrating with MATHEMATICA the perturbed equations of motion in\nCartesian coordinates over 2 yr ; the disturbing acceleration (56) has been\nused. The planet starts from the perihelion on the x axis. Just for illustrative purposes, a mass loss rate of the order of −10−1 yr−1 has been adopted\nfor the Sun; for the planet initial conditions corresponding to a = 1 AU,\ne = 0.8 have been chosen. Red dashed line: unperturbed Keplerian ellipse\nat t = t0 = tp . Blue dash-dotted line: osculating Keplerian ellipse after the\nfirst perihelion passage. As can be noted, its semimajor axis is larger than\nthat of the initial unperturbed ellipse, while the eccentricity remaines constant. Note also that after 2 yr the planet has not yet reached the perihelion\nas it would have done in absence of mass loss.\n\n21\n\n\fyield an increase of a according to\n\u0012 \u0013\nμ̇\nȧ = −\na > 0;\nμ\n\n(58)\n\ncfr. with my (9). As a consequence of the constancy of L2 = μ(t)a(t)[1 −\ne(t)2 ] and of (57) he obtains that the eccentricity remains constant, i.e.\nė = 0;\n\n(59)\n\ncfr. with my (12). Moreover, another consequence of (57) obtained by\nNoerdlinger in Ref. [4] is that the Keplerian period increases as\n\u0014\n\u0015\nμ 2\nP Kep (t)\n;\n=\nP Kep\nμ(t)\n\n(60)\n\ncfr. with my (16). Should the quantities dealt with by Noerdlinger are to be\nidentified with the usual osculating Keplerian elements, his results would be\nincompatible with the real dynamics of a test particle in the field of a linearly\nmass-losing body, as I have shown. The quantity obtained by us which\nexhibits the closest resemblance with (58) seems to be the secular variation\nof ∆r(2π) for e = 0. Apart from matters of interpretation, the quantitative\nresults are different. Indeed, I obtain for the Earth a secular variation of\nthe semimajor axis of −2 × 10−4 m yr−1 and a shift in the radial position\nalong the fixed line of the apsides of +1.3 × 10−2 m yr−1 , while Noerdlinger\nin Ref. [4] gets a secular rate of his semimajor axis, identified with the\nAstronomical Unit, of about +1 × 10−2 m yr−1 . Note that Noerdlinger uses\nfor the Sun Ṁ /M = −9 × 10−14 yr−1 as in the present work.\nKrasinski and Brumberg in Ref. [2] deal, among other things, with the\nproblem of a mass-losing Sun in the framework of the observed secular increase of the Astronomical Unit for which, starting with an equation of\nmotion like (2), they obtain an equation like (58). A mass-loss rate of\n−3 × 10−14 yr−1 , considered somewhat underestimated by Noerdlinger [4],\nyields an increase of the Astronomical Unit of 3 × 10−3 m yr−1 . With such a\nvalue for μ̇/μ I would obtain a decrease of the semimajor axis of −7 × 10−5\nm yr−1 and an increase in r of +4 × 10−3 m yr−1 .\nConcerning the observationally determined increase of the Astronomical\nUnit, more recent estimates from processing of huge planetary data sets by\nPitjeva point towards a rate of the order of 10−2 m yr−1 [28, 29]. It may\nbe noted that my result for the secular variation of the terrestrial radial\nposition on the line of the apsides would agree with such a figure by either\n22\n\n\fassuming a mass loss by the Sun of just −9 × 10−14 yr−1 or a decrease of the\nNewtonian gravitational constant Ġ/G ≈ −1 × 10−13 yr−1 . Such a value for\nthe temporal variation of G is in agreement with recent upper limits from\nLunar Laser Ranging [30] Ġ/G = (2 ± 7) × 10−13 yr−1 . This possibility is\nenvisaged in Ref. [31] whose authors use ȧ/a = −Ġ/G by speaking about a\nsmall radial drift of −(6 ± 13) × 10−2 m yr−1 in an orbit at 1 AU. I, now,\napply my analysis to the daily decrement of the semimajor axis of LAGEOS\n[8] whose relevant orbital parameters are a = 12270 km, e = 0.0045. From\n(9) it turns out that a secular decrease of a of the order of ≈ 1 mm d−1\ncould only be induced by μ̇⊕ /μ⊕ = −3 × 10−6 yr−1 . Clearly, it cannot be\ndue to a variation of the Earth's mass M ; if it had to be attributed to a\nvariation of G, it would be orders of magnitude too large with respect to\nthe bounds in Ref. [30] and Ref. [31]. Adopting (28) does not substantially\nalter the situation because the required μ̇⊕ /μ⊕ would be only two orders of\nmagnitude smaller. Now I look at the anomalous increase of the eccentricity\nof the lunar orbit amounting to ėMoon = (0.9 ± 0.3) × 10−11 yr−1 [9]. Such a\nfigure and (12) yield μ̇⊕ /μ⊕ = 8.5 × 10−12 yr−1 ; it is one order of magnitude\nlarger than the present-day bounds on Ġ/G [30, 31].\n\n5\n\nConclusions\n\nI started in the framework of the two-body Newtonian dynamics by using a\nradial perturbing acceleration linear in time and straightforwardly treated\nit with the standard Gaussian scheme. I found that the osculating semimajor axis a, the eccentricity e and the mean anomaly M secularly decrease\nwhile the argument of pericentre ω remains unchanged; the longitude of the\nascending node Ω and the inclination i are not affected by the phenomenon\nconsidered. The radial distance from the central body, taken on the fixed\nline of the apsides, experiences a secular increase ∆r. For the Earth, such\nan effect amounts to about 1.3 cm yr−1 . By numerically integrating the\nequations of motion in Cartesian coordinates I found that the real orbital\npath expands after every revolution, the line of the apsides does not change\nand the apsidal period is larger than the unperturbed Keplerian one. I\nhave also clarified that such results are not in contrast with those analytically obtained for the Keplerian orbital elements which, indeed, refer to\nthe osculating ellipses approximating the true trajectory at each instant. I\nalso computed the orbital effects of a secular variation of the Sun's mass in\nthe framework of the general relativistic linearized gravitoelectromagnetism\nwhich predicts a perturbing gravitoelectric tangential force proportional to\n\n23\n\n\fv/r. I found that both the semimajor axis and the eccentricity secularly\nincrease; the other Keplerian elements remain constant. Such effects are\ncompletely negligible in the present and future evolution of, e.g., the solar\nsystem.\nAs a suggestion to other researchers, it would be very important to\ncomplement my analytical two-body calculation by performing simultaneous\nlong-term numerical integrations of the equations of motion of all the major\nbodies of the solar system by including a mass-loss term in the dynamical\nforce models as well to see if the N-body interactions in presence of such\nan effect may substantially change the picture outlined here. It would be\nimportant especially in the RGB phase in which the inner regions of the\nsolar system should dramatically change.\n\nAcknowledgments\nI thank Prof. K.V. Kholshevnikov, St.Petersburg State University, for useful\ncomments and references.\n\nReferences\n[1] K. P. Schröder and R. C. Smith, \"Distant future of the Sun and Earth\nrevisited,\" Monthly Notices of the Royal Astronomy Society, vol. 386, no.\n1, pp. 155-163, 2008.\n[2] G. A. Krasinsky and V. A. Brumberg, \"Secular increase of astronomical\nunit from analysis of the major planet motions, and its interpretation,\"\nCelestial Mechanics and Dynamical Astronomy, vol. 90, no. 3-4, pp. 267288 2004.\n[3] E. M. Standish, \"The Astronomical Unit now,\" in Transits of Venus:\nNew Views of the Solar System and Galaxy. Proceedings of the IAU Colloquium 196, 2004, D. W. Kurtz, Ed., pp. 163-179, Cambridge University\nPress, Cambridge, 2005.\n[4] P. D. Noerdlinger, \"Solar mass loss, the Astronomical Unit, and the scale\nof the solar system,\" http://arxiv.org/abs/0801.3807.\n[5] S. A. Klioner, \"Relativistic scaling of astronomical quantities and the\nsystem of astronomical units,\" Astronomy and Astrophysics, vol. 478, no.\n3, pp. 951-958, 2008.\n\n24\n\n\f[6] W. Jin, P. Imants and M. Perryman Eds., A Giant Step: from Millito Micro-arcsecond Astrometry. Proceedings of the IAU Symposium 248,\n2007, Cambridge University Press, Cambridge, 2008.\n[7] W. H. Oskay, S. A. Diddams, E. A. Donley, T. M. Fortier, T. P. Heavner,\nL. Hollberg, W. M. Itano, S. R. Jefferts, M. J. Delaney, K. Kim, F. Levi,\nT. E. Parker and J. C. Bergquist, \"Single-Atom Optical Clock with High\nAccuracy,\" Physical Review Letters, vol. 97, no. 2, id. 020801, 2006.\n[8] D. P. Rubincam, \"On the secular decrease in the semimajor axis of Lageos's orbit,\" Celestial Mechanics and Dynamical Astronomy, vol. 26, pp.\n361-382, April 1982.\n[9] J. D. Anderson and M. M. Nieto, \"Astrometric Solar-System Anomalies,\" to appear in Relativity in Fundamental Astronomy: Dynamics,\nReference Frames, and Data Analysis Proceedings IAU Symposium No.\n261, 2009, S. Klioner, P. K. Seidelmann and M. Soffel, Eds., 2009,\nhttp://arxiv.org/abs/0907.2469.\n[10] E. Strömgren, \"ber die Bedeutung kleiner Massennderungen fr die Newtonsche Centralbewegung,\" Astronomische Nachrichten, vol. 163, no. 9,\npp. 129-136, 1903.\n[11] J. H. Jeans, \"Cosmogonic problems associated with a secular decrease\nof mass,\" Monthly Notices of the Royal Astronomy Society, vol. 85, pp.\n2-11, November 1924.\n[12] J. H. Jeans, Astronomy and Cosmogony, Dover, New York, 1961.\n[13] G. Armellini, \"The variation of the eccentricity in a binary system of\ndecrasing mass,\" The Observatory, vol. 58, pp. 158-159, May 1935.\n[14] J. D. Hadjidemetriou, \"Two-body problem with variable mass: a new\napproach,\" Icarus, vol. 2, pp. 440-451, 1963.\n[15] J. D. Hadjidemetriou, \"Analytic solutions of the two-body problem with\nvariable mass,\" Icarus, vol. 5, pp. 34-46, 1966.\n[16] K. V. Kholshevnikov and M. Fracassini, \"Le Problème des deux corps\navec G variable selon l'hypothèse de Dirac,\" Conferenze dell' Osservatorio\nAstronomico di Milano-Merate, Serie I, No. 9, pp. 5-50, 1968.\n[17] A. Deprit, \"The secular accelerations in Gylden's problem,\" Celestial\nMechanics and Dynamical Astronomy, vol. 31, pp. 1-22, September 1983.\n25\n\n\f[18] J. Kevorkian and J. D. Cole, Multiple Scale and Singular Perturbation\nMethods, Springer, New York and Berlin, 1966.\n[19] B. Bertotti, P. Farinella and D. Vokrouhlickŕm y, Physics of the Solar\nSystem, Kluwer, Dordrecht, 2003.\n[20] A. E. Roy, Orbital motion. Fourth edition, Institute of Physics, Bristol,\n2005.\n[21] S. Casotto, \"Position and velocity perturbations in the orbital frame\nin terms of classical element perturbations,\" Celestial Mechanics and Dynamical Astronomy, vol. 55, no. 3, pp. 209-221, 1993.\n[22] J. P. Zahn, \"Tidal friction in close binary stars,\" Astronomy and Astrophysics, vol. 57, pp. 383-394, May 1977; \"Erratum; Tidal Friction in\nClose Binary Stars, \" Astronomy and Astrophysics, vol. 67, p. 162, June\n1978.\n[23] M. Beech, \"Tidal circularization in massive binaries,\" Astrophysics and\nSpace Science, vol. 132, no. 2, pp. 269-276, 1987.\n[24] B. Mashhoon, \"Gravitoelectromagnetism,\" in Reference Frames and\nGravitomagnetism, J.-F. Pascual-Sánchez, L. Florı́a, A. San Miguel and\nF. Vicente, Eds., pp. 121-132, World Scientific, Singapore, 2001.\n[25] B. Mashhoon, \"Gravitoelectromagnetism: A Brief Review,\" in Measuring Gravitomagnetism: A Challenging Enterprise, L. Iorio, Ed., pp.\n29-39, NOVA, Hauppauge, 2007.\n[26] D. Bini, C. Cherubini, C. Chicone and B. Mashhoon, \"Gravitational\ninduction,\" Classical and Quantum Gravity, vol. 25, no. 22, id. 225014,\n2008.\n[27] L. Iorio, \"A Gravitomagnetic Effect on the Orbit of a Test Body Due\nto the Earth's Variable Angular Momentum,\" International Journal of\nModern Physics D, vol. 11, no. 5, pp. 781-787, 2002.\n[28] E. V. Pitjeva, cited by E. M. Standish, \"The Astronomical Unit now,\"\nin Transits of Venus: New Views of the Solar System and Galaxy. Proceedings of the IAU Colloquium 196, 2004, D. W. Kurtz, Ed., p. 177,\nCambridge University Press, Cambridge, 2005.\n[29] E. V. Pitjeva, private communication to Noerdlinger P., 2008.\n\n26\n\n\f[30] J. Müller and L. Biskupek, \"Variations of the gravitational constant\nfrom lunar laser ranging data,\" Classical and Quantum Gravity, vol. 24,\nno. 17, pp. 4533-4538, 2007.\n[31] J. G. Williams, S. G. Turyshev and D. H. Boggs, \"Williams, Turyshev,\nand Boggs Reply:,\" Physical Review Letters, vol. 98, no. 5, id. 059002,\n2007.\n\n27\n\n\f"}