{"id": "http://arxiv.org/abs/0910.3671v1", "guidislink": true, "updated": "2009-10-19T22:38:48Z", "updated_parsed": [2009, 10, 19, 22, 38, 48, 0, 292, 0], "published": "2009-10-19T22:38:48Z", "published_parsed": [2009, 10, 19, 22, 38, 48, 0, 292, 0], "title": "W+3 jet production at the LHC as a signal or background", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0910.3176%2C0910.5432%2C0910.2417%2C0910.0794%2C0910.5607%2C0910.4331%2C0910.0735%2C0910.0061%2C0910.2470%2C0910.4557%2C0910.2428%2C0910.5169%2C0910.2525%2C0910.2093%2C0910.0616%2C0910.4576%2C0910.1709%2C0910.5033%2C0910.4718%2C0910.1995%2C0910.3671%2C0910.2960%2C0910.1191%2C0910.5879%2C0910.5561%2C0910.4863%2C0910.3670%2C0910.5312%2C0910.1528%2C0910.1742%2C0910.0611%2C0910.0351%2C0910.2029%2C0910.5104%2C0910.1515%2C0910.3164%2C0910.4379%2C0910.2297%2C0910.5049%2C0910.3035%2C0910.0116%2C0910.4982%2C0910.4783%2C0910.1193%2C0910.0894%2C0910.5371%2C0910.1711%2C0910.3401%2C0910.5150%2C0910.5040%2C0910.3516%2C0910.0340%2C0910.5348%2C0910.3635%2C0910.0928%2C0910.2688%2C0910.1011%2C0910.3454%2C0910.1708%2C0910.3773%2C0910.1647%2C0910.3208%2C0910.0856%2C0910.4319%2C0910.2491%2C0910.3574%2C0910.2237%2C0910.4641%2C0910.3385%2C0910.3368%2C0910.1364%2C0910.3805%2C0910.5760%2C0910.0454%2C0910.4018%2C0910.4010%2C0910.3765%2C0910.3200%2C0910.5175%2C0910.3965%2C0910.2186%2C0910.3976%2C0910.0459%2C0910.3586%2C0910.4316%2C0910.4341%2C0910.5654%2C0910.0314%2C0910.0954%2C0910.5386%2C0910.0709%2C0910.1892%2C0910.5610%2C0910.4859%2C0910.4282%2C0910.4971%2C0910.1809%2C0910.4489%2C0910.0270%2C0910.4522%2C0910.3253&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "W+3 jet production at the LHC as a signal or background"}, "summary": "We discuss the production of W bosons in association with three jets at the\nLHC. We investigate how next-to-leading order QCD corrections modify basic\nkinematic distributions of jets and leptons. We also address the magnitude of\nNLO QCD effects in W+3 jet observables, relevant for SUSY searches at the LHC.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0910.3176%2C0910.5432%2C0910.2417%2C0910.0794%2C0910.5607%2C0910.4331%2C0910.0735%2C0910.0061%2C0910.2470%2C0910.4557%2C0910.2428%2C0910.5169%2C0910.2525%2C0910.2093%2C0910.0616%2C0910.4576%2C0910.1709%2C0910.5033%2C0910.4718%2C0910.1995%2C0910.3671%2C0910.2960%2C0910.1191%2C0910.5879%2C0910.5561%2C0910.4863%2C0910.3670%2C0910.5312%2C0910.1528%2C0910.1742%2C0910.0611%2C0910.0351%2C0910.2029%2C0910.5104%2C0910.1515%2C0910.3164%2C0910.4379%2C0910.2297%2C0910.5049%2C0910.3035%2C0910.0116%2C0910.4982%2C0910.4783%2C0910.1193%2C0910.0894%2C0910.5371%2C0910.1711%2C0910.3401%2C0910.5150%2C0910.5040%2C0910.3516%2C0910.0340%2C0910.5348%2C0910.3635%2C0910.0928%2C0910.2688%2C0910.1011%2C0910.3454%2C0910.1708%2C0910.3773%2C0910.1647%2C0910.3208%2C0910.0856%2C0910.4319%2C0910.2491%2C0910.3574%2C0910.2237%2C0910.4641%2C0910.3385%2C0910.3368%2C0910.1364%2C0910.3805%2C0910.5760%2C0910.0454%2C0910.4018%2C0910.4010%2C0910.3765%2C0910.3200%2C0910.5175%2C0910.3965%2C0910.2186%2C0910.3976%2C0910.0459%2C0910.3586%2C0910.4316%2C0910.4341%2C0910.5654%2C0910.0314%2C0910.0954%2C0910.5386%2C0910.0709%2C0910.1892%2C0910.5610%2C0910.4859%2C0910.4282%2C0910.4971%2C0910.1809%2C0910.4489%2C0910.0270%2C0910.4522%2C0910.3253&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We discuss the production of W bosons in association with three jets at the\nLHC. We investigate how next-to-leading order QCD corrections modify basic\nkinematic distributions of jets and leptons. We also address the magnitude of\nNLO QCD effects in W+3 jet observables, relevant for SUSY searches at the LHC."}, "authors": ["Kirill Melnikov", "Giulia Zanderighi"], "author_detail": {"name": "Giulia Zanderighi"}, "author": "Giulia Zanderighi", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1103/PhysRevD.81.074025", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/0910.3671v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0910.3671v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "10 pages, 13 figures, OUTP-09-26-P", "arxiv_primary_category": {"term": "hep-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "hep-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0910.3671v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0910.3671v1", "journal_reference": "Phys.Rev.D81:074025,2010", "doi": "10.1103/PhysRevD.81.074025", "fulltext": "W + 3 jet production at the LHC as a signal or background\nKirill Melnikov\nDepartment of Physics and Astronomy,\nJohns Hopkins University, Baltimore, MD, USA\n\narXiv:0910.3671v1 [hep-ph] 19 Oct 2009\n\nGiulia Zanderighi\nRudolf Peierls Centre for Theoretical Physics,\n1 Keble Road, University of Oxford, UK\n\nWe discuss the production of W bosons in association with three jets at the LHC. We investigate\nhow next-to-leading order QCD corrections modify basic kinematic distributions of jets and leptons.\nWe also address the magnitude of NLO QCD effects in W + 3 jet observables, relevant for SUSY\nsearches at the LHC.\nI.\n\nINTRODUCTION\n\nA good understanding of complicated multi-particle\nprocesses is important for the LHC physics. To achieve\nthis goal it is useful to have next-to-leading order (NLO)\nQCD predictions for such processes (see e.g. Ref. [1]). In\nthe past, three final state particles was the highest multiplicity for which NLO QCD computations were feasible,\nbut this changed this year when four groups [2, 3, 4, 5,\n6, 7, 8] reported first results on NLO QCD corrections to\nprocesses with four particles in the final state. To arrive\nat these results a variety of methods including highlyrefined Passarino-Veltman reduction algorithm [9, 10],\nOssola-Pittau-Papadopoulos (OPP) method [11, 12] and\nunitarity techniques [13, 14, 15, 16, 17, 18] were used.\nSuccessful completion of these computations and a large\nnumber of one-loop amplitudes with six and more external particles computed recently [19, 20, 21, 22, 23, 24, 25],\nprovides a proof of principle that reliable description of\nmany 2 → 4 processes is now within reach.\nA major reason for extending leading order results to\nnext-to-leading order is a significant reduction of the unphysical dependence on factorization and renormalization scales in NLO QCD cross sections and distributions.\nSuch reduction is very important, especially for high multiplicity processes, where the unphysical dependence on\nscales can be significant. Indeed, for such processes, the\nscale dependence is amplified by the high power of the\nstrong coupling constant. For a cross-section involving n\njets σn ∼ αns (μ), so that small changes in the renormalization scale μ lead to large changes in the corresponding\ncross sections\nμ\n\n∂σn\n∼ −2nβ0 αs σn , β0 = (11Nc − 2nf )/(12π).\n∂μ\n\n(1)\n\nThere are many cases where NLO computations reduce\n\nthe dependence of cross sections on unphysical scales to\n10 − 20% which, given typical cross section uncertainties\nat leading order (LO) of about 50%, is a great success.\nHowever, even if such scale-independence is observed for\nthe total-cross section, it is not always possible to claim\nthat a particular process is described reliably, for the\npurpose of LHC phenomenology. The reason is the dual\nrole that many complicated processes at the LHC will\nplay. Indeed, depending on the cuts on the final states,\nprocesses that involve e.g. top quarks and/or electroweak\ngauge bosons and QCD jets are treated as either primary\nsignals or unwanted backgrounds and very different cuts\nare applied to final states in the two cases. We will refer generically to these cuts as \"signal\" or \"background\"\ncuts, respectively 1 These cuts force final state particles\nto live in different regions of phase-space, so that a'priori\nit is not possible to relate QCD corrections to the same\nprocess subject to either \"signal\" or \"background\" cuts.\nA candidate procedure for dealing with LHC processes\nwhich have this dual role is as follows. One starts the\nstudy of these processes by applying signal cuts and using the resultant data set to refine the theoretical tools,\ne.g. Monte Carlo event generators. Once a good understanding of a given process is achieved with signal cuts,\none uses the refined tools to extrapolate to a different\nkinematic situation, specified by the background cuts.\nUnfortunately, the reliability of this extrapolation is not\nassured. The purpose of applying the background cuts\n\n1\n\nSince we are mainly concerned with the process W + 3 jets, we\ncall \"signal cuts\" the ones where this process is considered a\nsignal, and \"background cuts\" the ones for which this process\nis an unwanted background to some other New Physics signal.\nWe caution the reader that these terms are often used in the\nliterature in exactly the opposite way.\n\n\f2\n45\n\n30\nLO\nNLO, inclusive\nNLO, exclusive\n\n26\nσ(μ) [pb/GeV]\n\nσ(μ) [pb/GeV]\n\n40\n\nLO\nNLO, inclusive\nNLO, exclusive\n\n28\n\n35\n30\n\n24\n22\n20\n\n25\n18\n20\n\n16\n80\n\n100\n\n120\n\n140\n\n160\n\n180\n\n200\n\n220\n\n240\n\n80\n\nμ [GeV]\n\n100\n\n120\n\n140\n\n160\n\n180\n\n200\n\n220\n\n240\n\nμ [GeV]\n\nFIG. 1: The dependence of the W + + 3 jet inclusive production cross section at the LHC on the factorization and renormalization scale μ. All cuts and parameters are described in\nthe text. The leading color adjustment procedure is applied.\n\nFIG. 2: The dependence of the W − + 3 jet inclusive production cross section at the LHC on the factorization and renormalization scale μ. All cuts and parameters are described in\nthe text. The leading color adjustment procedure is applied.\n\nis to suppress, as far as possible, the very kinematic configurations that are allowed by signal cuts. Therefore,\nsuch an extrapolation can only work if the influence of\nkinematics on QCD radiative effects is correctly captured\nby the available tools. Since only relatively simple theoretical tools, such as leading order parton integrators or\nparton showers, are currently available for complicated\nfinal states, the modeling of the radiative effects is only\napproximate. On the other hand, if a NLO QCD computation is available, such an extrapolation can be done\nwith a smaller ambiguity since all the relevant scales are\ngenerated dynamically in NLO computations, largely independent of the choices made initially. For cases with\ncomplicated kinematics, this is clearly indispensable.\nIn this paper we discuss and illustrate this issue, taking\nthe production of W bosons in association with three jets\nat the LHC as an example. For definiteness,\nwe choose\n√\nto consider proton-proton collisions at s = 10 TeV [26].\nHowever, we do not aim to describe W + 3 jet production at the LHC in all possible detail, since knowledge\nof the exact experimental setup would be required. Instead, we look for and try to understand differences between NLO and LO QCD results for basic observables,\nfor the case of signal cuts. We point out that it is not always clear which leading order predictions should be used\nin those comparisons since different choices of renormalization and factorization scales affect the leading order\npredictions strongly. We therefore compare our results\nto a variety of leading order predictions including most\nadvanced ones, where matrix element computations are\nmatched to parton showers.\nWe note that NLO QCD corrections to W +3 jet production at the LHC have been studied in great detail\nrecently in Ref. [6], mostly for signal cuts. We have\nchecked a number of results for W ± production crosssections at the LHC, reported in that reference, and\nfound agreement within a few percent in all cases con-\n\nsidered. These small differences are compatible with the\nfact that our calculation employs the leading color approximation with color adjustment procedure, explained\nin detail in Ref. [5], whereas computation in Ref. [6] accounts for complete color dependence.\nWe also discuss QCD corrections to background cuts,\nstudied by the ATLAS [27, 28, 29] and CMS collaborations [30, 31] for SUSY searches at the LHC. Such\nanalyses often assume that Standard Model backgrounds\ncan be measured in SUSY-free regions to fix normalizations and then employ LO computations to extrapolate to kinematic regions where supersymmetric signal\nis expected. Hence, an implicit assumption in those\nanalyses is that LO distributions have correct shapes\nand that higher-order QCD effects provide a kinematicindependent renormalization. We are now in position\nto check these assumptions with the explicit NLO QCD\ncomputation of W + 3 jet process for typical ATLAS and\nCMS cuts.\nThe remainder of the paper is organized as follows. In\nSection II, we discuss W +3 jet production for signal cuts\nat the LHC. In Section III we study W + 3 jet production\nas a background to SUSY searches for two typical sets of\ncuts close to those suggested by the ATLAS and CMS\ncollaborations. In Section IV we present our conclusions.\n\nII.\n\nSTUDY OF W + 3 JET PROCESS\n\nIn this Section, we discuss NLO QCD effects in W + 3\njet production for a set of cuts, designed to study the W\nproduction in association with jets. We follow Ref. [5]\nclosely and perform calculations in the leading color approximation. The calculation relies heavily on the framework provided by MCFM [32] and uses one-loop amplitudes computed in [22]. We employ the Catani-Seymour\ndipole subtraction [33] to compute real emission correc-\n\n\f3\n0\n\n0\n\n10\n\nNLO, μ0\nLO, μ0\n\nσNLO/σ dσ/ET,j1 [pb/GeV]\n\ndσ/ET,j1 [pb/GeV]\n\n10\n\n-1\n\n10\n\n-2\n\n10\n\n-3\n\n10\n\nNLO, μ0\nLO, local scale\nAlpgen+Herwig\n\n-1\n\n10\n\n-2\n\n10\n\n-3\n\n50\n\n100\n\n150\n200\nET,j1 [GeV]\n\n250\n\n300\n\n350\n\nFIG. 3: The transverse momentum distribution of the leading\njet for W + + 3 jet inclusive production cross section at the\nLHC. All cuts and parameters are described in the text. The\nleading color adjustment procedure is applied.\n\ntion; details of our implementation are given in [4]. We\nuse the leading color adjustment procedure described in\nthat paper to correct for deficiencies of the leading color\napproximation, to the extent possible. We note that production cross-sections for W + and W − at the LHC are\nnot the same; we have chosen to discuss the case of W +\nproduction almost everywhere in this paper. We do, however, show results for the W − + 3 jet production crosssection at the LHC in dependence of factorization and\nrenormalization scales.\nWe begin by summarizing all the relevant cuts and\ninput parameters that are employed in the computation.\nWe take the LHC center-of-mass energy to be 10 TeV. We\nrequire that the transverse momentum and pseudorapidity of the three jets satisfy pT,j > 30 GeV and |ηj | < 3.\nWe consider the leptonic decay of the W to electron (or\nmuon) and employ the following restrictions on lepton\ntransverse momentum, missing transverse energy, lepton\nrapidity and W -boson transverse mass, pT,e > 20 GeV,\n6 ET > 15 GeV, |ηe | < 2.4, MTW > 30 GeV. We\ndo not apply an isolation cut on the leptons. To define p\njets, we use the SISCone jet-algorithm [34] with\nR = ∆η 2 + ∆φ2 = 0.5 and merging parameter f = 0.5.\nWe consider the production of on-shell W + bosons,\nthat decay into a pair of massless leptons. Finite width\neffects are about 1%; they tend to decrease the cross\nsection. The CKM matrix is set equal to the identity\nmatrix; this reduces the W + 3 jet production cross section at the LHC by less than 1%. All quarks, with the\nexception of the top quark, are considered massless. The\ntop quark is considered infinitely heavy and its contribution is neglected. The mass of the W boson is taken to be\nmW = 80.419 GeV; its couplings to fermions are obtained\nfrom αQED (mZ ) = 1/128.802 and sin2 θW = 0.230. We\nuse CTEQ6L parton distribution functions for leading\norder and CTEQ6M for next-to-leading order computations [35, 36]. Note that we do not include the factor\n\n10\n\n50\n\n100\n\n150\n200\nET,j1 [GeV]\n\n250\n\n300\n\n350\n\nFIG. 4: The transverse momentum distribution of the leading jet for W + + 3 jet inclusive production cross section at\nthe LHC. All cuts and parameters are described in the text.\nThe leading color adjustment procedure is applied. All LO\ndistributions are rescaled by constant factor, to ensure that\nthe LO and NLO normalizations coincide.\n\nBr(W → lνl ) in the results for cross-sections quoted below.\nWe first discuss results for total cross sections.\nWe set renormalization and factorization scales μ to\nμ = [80, 120, 160, 200, 240] GeV and calculate the crosssections with the cuts defined at the beginning of this\nSection. The result of the calculation is illustrated in\nFig.1. For full-color leading order cross section we find\nLO,FC\nσW\n+ +≥3j = 35(10) pb ,\n\n(2)\n\nwhere the ±10 pb uncertainty from scale variation is\nshown in brackets. Calculating the same cross-section\nin the leading color approximation, we find the leading\ncolor adjustment parameter\nLO,FC\nLO,LC\nR = σW\n+ +≥3j /σW + +≥3j = 0.940(5) ,\n\n(3)\n\nwhere the uncertainty indicates changes in this ratio that we observe when we change factorization/renormalization scales chosen in leading order computations or cuts on the final state particles. We also find\nthat the R ratio for the W − production is the same as\nfor the W + . Since R does not depend in any significant\nway on the details of the process, applied cuts and chosen\nscales, we use the central value for R given in Eq.(3) in\nwhat follows.\nAt NLO we obtain the adjusted leading-color inclusive\nNLO,aLC\nNLO,LC\ncross-section, σW\n+ +≥3j (incl) = R * σW + +≥3j (incl),\nNLO,aLC\nσW\n+ +≥3j (incl) = 32.4(1.5) pb .\n\n(4)\n\nThis result implies (see Fig.1) that for our choice of\ncuts and input parameters, NLO QCD corrections to\nthe inclusive cross-section are very moderate for μ ∼\n140 − 160 GeV. We also observe a remarkable reduction\n\n\f4\n0\n\nNLO, μ0\n\n-1\n\n10\n\n-2\n\n10\n\nNLO, μ0\n\n0\n\n10\n\nLO, local μ\n\nσNLO/σ dσ/dET,j3 [pb/GeV]\n\nσNLO/σ dσ/dET,j2 [pb/GeV]\n\n10\n\nLO, local μ\n\n-1\n\n10\n\n-2\n\n10\n\n-3\n\n40\n\n60\n\n80\n\n100 120 140\nET,j2 [GeV]\n\n160\n\n180\n\n200\n\n10\n\n40\n\n60\n\n80\n\n100 120 140\nET,j3 [GeV]\n\n160\n\n180\n\n200\n\nFIG. 5: The transverse momentum distribution of the second hardest jet in W + + 3 jet production at the LHC. All\ncuts and parameters are described in the text. The leading\ncolor adjustment procedure is applied. The LO distribution is\nrescaled by constant factor, to ensure that the LO and NLO\nnormalizations coincide.\n\nFIG. 6: The transverse momentum distribution of the third\nhardest jet in W + + 3 jet production at the LHC. All cuts\nand parameters are described in the text. The leading color\nadjustment procedure is applied. The LO distribution is\nrescaled by constant factor, to ensure that the LO and NLO\nnormalizations coincide.\n\nin scale dependence from more than ±30% at leading\norder to only ±5% at NLO. While corrections to the exclusive cross-section are larger for similar values of μ, the\nscale independence of the exclusive NLO cross-section is\nsimilar to the inclusive one. In Fig.2 the cross-section\nfor W − + 3 jet production is shown in dependence on\nthe factorization and renormalization scales. The cross\nsection is smaller in this case, while the stabilization of\nscale dependence that occurs at next-to-leading order is\nvery similar for W − and W + production cross-sections.\nGiven that NLO QCD corrections to the total cross\nsections are small, it is tempting to surmise that the\ncorrections to kinematic distributions should also be insignificant. As we will now show, the actual situation\nis more complex. We consider kinematic distributions\nfor the inclusive W + + 3 jet production. We choose\nto show\nq the NLO distributions for the dynamical scale\nμ0 = p2T,W + m2W , where pT,W is the transverse mo-\n\nhigher values of the transverse energy. A similar feature\nis observed in other distributions related to jet transverse\nmomenta if the NLO result is compared to LO predictions\nwith the scale μ0 .\nThe origin of these shape changes was recently discussed in Ref. [38] using soft-collinear effective theory\nand in Refs. [5, 7] in connection with NLO QCD computations for W + 3 jets production at the Tevatron and\nthe LHC. Here, we recapitulate the explanation of the\ninadequacy of the scale μ0 given in Ref. [5]. This inadequacy is related to two facts: a) in the region where\nthe jets have large transverse momentum, the W -boson\ntransverse momentum spectrum is softer than that of the\njets; b) the probability of parton branching is determined\nby the relative transverse momentum of the two daughter partons produced in that branching; such transverse\nmomentum should be the appropriate scale for the strong\ncoupling constant. When these two facts are combined,\none is led to the conclusion that in the kinematic region\nwhere the jets have large transverse momenta, the use of\nαs (μ0 ) in LO computations overestimates the cross section. At next-to-leading order, the appropriate scale for\nthe strong coupling constant μ ∼ pT,j ≫ μ0 is generated\ndynamically and the cross section in that region becomes\nsmaller.\nIs it possible to account for the shape modifications by\nmore sophisticated LO computations? The affirmative\nanswer to this question was given in Refs. [7, 38], where\nparticular choices of scales set by e.g. the hadronic invariant mass or total transverse energy in an event, were\nadvocated. It should be emphasized, however, that the\nidea to employ scales of the strong coupling that are determined from local kinematics on an event-by-event basis is not new since it is central to both parton showers\nand advanced leading order computations that employ\nmatrix elements and parton shower matching [39].\n\nmentum of the W boson as done e.g. in [37]. We note\nLO\nthat for such a scale the LO cross-section is σW\n+ +≥3j =\n37.6 pb and the adjusted leading color NLO cross-section\nNLO,aLC\nis σW\n+ +≥3j = 34.2 pb, consistent with Eq. (4) within\nthe indicated uncertainties. The radiative corrections to\nW + 3 jet production cross-section at scale μ0 are therefore small, about −10%. For the following discussion,\nscale choices in NLO computations are not very important since, as it turns out, shapes of NLO distributions\nare fairly insensitive to them.\nWe begin by studying the transverse momentum distribution of the leading jet. In Fig. 3 we compare NLO\nand LO predictions for scale μ0 . We find that the NLO\nQCD corrections change the shape of this distribution –\nthe leading order distribution underestimates the NLO\nresult at small values of the transverse energy by about\n30 percent and systematically exceeds the NLO result for\n\n\f5\n0\n\n10\n\n10\n\nNLO, μ0\nσNLO/σ dσ/dHT,tot [pb/GeV]\n\nσNLO/σ dσ/dηj1 [pb]\n\nLO, local μ\n8\n\n6\n\n4\n\nNLO, μ0\nLO, local μ\n\n-1\n\n10\n\n-2\n\n10\n\n-3\n\n10\n\n-4\n\n-3\n\n-2\n\n-1\n\n0\nηj1\n\n1\n\n2\n\n3\n\n10\n\n0\n\n100 200 300 400 500 600 700 800 900\nHT,tot [GeV]\n\nFIG. 7: The rapidity distribution of the leading jet for\nW + + 3 jet inclusive production cross section at the LHC. All\ncuts and parameters are described in the text. The leading\ncolor adjustment procedure is applied. The LO distribution is\nrescaled by constant factor, to ensure that the LO and NLO\nnormalizations coincide.\n\nFIG. 8: The total transverse energy distribution for W + +3 jet\ninclusive production cross section at the LHC. All cuts and parameters are described in the text. The leading color adjustment procedure is applied. The LO distribution is rescaled\nby constant factor, to ensure that the LO and NLO normalizations coincide.\n\nSince such \"local\" scales capture the kinematics of\ncomplicated events correctly, it is conceivable that they\nproduce shapes that are close to exact NLO results. We\nshow the comparison of the NLO prediction with two\nleading order results in Fig.4.\nOne LO distribution is obtained by following the MLM\nprocedure whose application to W + 3 jet production\nis described in Ref. [37]. The MLM procedure and its\nclose relative the CKKW algorithm [39] are the most advanced techniques available currently for leading order\npredictions, so it is interesting to see how it compares\nwith NLO computations. We use Alpgen [40] to generate unweighted events that are matched to the Herwig\n[41] parton shower. We produce hard events with up to\nfive QCD partons in the final state with Alpgen, using a\ntransverse momentum cut of ptj,min = 20 (25) GeV and\na separation parameter drj = 0.35 (0.45) [40]. To shower\nthe hard events with Herwig we used Rclus = drj and\nEt,clus = ptj,min as matching parameters for the MLM\nprescription [40]. We find that results are fairly independent of the cuts used in the generation of the hard events\nand that samples with five hard partons contribute little. This indicates that hard samples with yet higher\nmultiplicity can be safely neglected.\nThe other LO prediction shown in Fig. 4 is our implementation of the local scales in the strong coupling\nconstant; it is close in spirit to the re-weighting part of\nthe CKKW procedure [39]. To this end, for a given LO\npartonic event that passes jet cuts, we cluster partons\naccording to the measure given by k⊥ -jet algorithm2 . A\n\nrepeated clustering gives us a \"branching history\" that\ncan be associated with the event; at each branching the\nscale of the strong coupling constant is chosen as the relative momentum of two daughters in the branching. We\nwill refer to scales of the strong coupling constant chosen\nby this algorithm as \"local\" scales. Note that this procedure is strictly a simple way to set scales of the strong\ncoupling constant to reasonable values in W + 5 parton\nleading order matrix elements. In doing so, we do not\ntry to combine matrix elements of different multiplicities\nnor do we attempt to shower leading order partonic configuration. Differences between distributions produced\nwith Alpgen and with the local scale procedure give an\nidea of the importance of the parton shower and Sudakov\nre-weighting.\nWe point out that such modifications of leading order computations may lead to large changes in the crosssections. For example, Alpgen cross-section is ∼ 22 pb\nand the local scale cross-section is ∼ 47 pb, to be compared with ∼ 33 pb NLO cross-section. However, the\nnormalization of cross-sections is a hard problem where\nnext-to-leading computations or direct normalization to\ndata are the only known solutions. To separate issues\nof normalization from the shape, we normalize all leading order results in Fig. 4 to the NLO cross-section. We\nobserve that both the Alpgen+Herwig distribution and\nthe local scale distribution describe the NLO result fairly\nwell. Also, the proximity between the shapes of the two\nleading order results tells us that parton shower does relatively little to alter the shape of the distribution.\nWe find that these observations are generic: leading\norder computations obtained with either Alpgen+Herwig\nor local scales are similar and they work reasonably well\nin reproducing shapes of NLO distributions. We believe\nthis is important conclusion, especially in the case of\nAlpgen+Herwig since those programs are used by experi-\n\n2\n\nWe note that the jet cuts can be defined with any jet algorithm;\nthe k⊥ -algorithm is only used to reconstruct the event branching\nhistory.\n\n\f6\n0\n\nNLO, μ0\n\nNLO, μ0\n\nLO, local μ\n\nLO, local μ\n\nσNLO/σ σ/dpt,miss [pb/GeV]\n\nσNLO/σ dσ/dpt,l [pb/GeV]\n\n10\n\n-1\n\n10\n\n-2\n\n10\n\n-1\n\n10\n\n-2\n\n20\n\n40\n\n60\n\n80\n100\npt,l [GeV]\n\n120\n\n10\n\n140\n\nFIG. 9: The transverse momentum distribution of the charged\nlepton for W + + 3 jet inclusive production cross section at\nthe LHC. All cuts and parameters are described in the text.\nThe leading color adjustment procedure is applied. The LO\ndistribution is rescaled by constant factor, to ensure that the\nLO and NLO normalizations coincide.\n\nmenters as tools for understanding properties of W + jets\nprocess. In order to avoid too busy plots, we choose to\nonly show leading order results computed with the \"local\" scale choice for the strong coupling constant in what\nfollows. We stress that for all distributions the normalization of the leading order cross-section is adjusted to\nagree with next-to-leading order result. We show the\ndistribution in transverse energy of the second-hardest\nand third-hardest jet in Figs. 5,6, rapidity of the hardest jet in Fig. 7 and\nP the distribution in total transverse\nenergy HT,tot =\njets |pT,j | + pT,l + 6 pT in Fig.8. We\nalso show leptonic distributions in Figs. 9 and 10 where\nwe plot the lepton transverse momentum and the missing transverse momentum, respectively. As stated, in all\nconsidered cases local scales reproduce shapes of the distributions quite well.\n\nIII. W + 3 JET PRODUCTION AS A MODEL\nFOR BACKGROUND TO SUPERSYMMETRIC\nSEARCHES\n\nIn this Section we investigate QCD corrections to W +3\njet production at the LHC for a set of cuts appropriate\nin supersymmetric searches. By construction, these background cuts seek to suppress the production of W bosons\nin association with jets as much as possible, effectively\ndriving W + jet production to corners of the available\nphase-space. It is therefore unclear if QCD radiative effects in those regions of phase-space are similar to QCD\ncorrections to the production cross-sections discussed in\nthe previous Section. To answer this question, we discuss two types of cuts, very similar to those suggested\nby the ATLAS and CMS collaborations, in their planned\n\n20\n\n40\n\n60\n\n80\n100\npt,miss [GeV]\n\n120\n\n140\n\nFIG. 10: The missing transverse momentum distribution for\nW + + 3 jet inclusive production cross section at the LHC. All\ncuts and parameters are described in the text. The leading\ncolor adjustment procedure is applied. The LO distribution is\nrescaled by constant factor, to ensure that the LO and NLO\nnormalizations coincide.\n\nsearches for supersymmetry at the LHC. 3 All the input\nparameters are the same as in the previous Section except that we use merging parameter f = 0.7 to define\njets using SIScone algorithm.\n\nA.\n\nATLAS setup – faking jets from τ decays\n\nWe begin by considering cuts employed by the ATLAS collaboration to search for SUSY with R-parity conservation. In that case, the typical signal comes from\ngluino pair-production. If each gluino decays into two\njets and a neutralino, a SUSY signature will involve 4\njets and missing transverse energy. A dominant background to this process comes from Z + 4 jet production, with the subsequent decay of the Z-boson into\ntwo neutrinos. Another important background comes\nfrom W + + 3 jet production4 , followed by the decays\nW + → τ̄ ντ → ν̄τ ντ + hadrons, so that hadrons from\nsemileptonic decay of the τ lepton produce the fourth\njet.\nOne can use peculiar kinematic properties of the fourth\njet to connect it to τ decays and then reject such events\nbut, because of limited efficiency in identifying τ decays\nand because the cross section for W + 3 jet production is\nalmost two orders of magnitude larger than the Z + 4 jet\n\n3\n\n4\n\nWe point out that we kept cuts very similar to those used in\nthe experimental studies done at 14TeV despite the fact that we\nuse 10 TeV as center-of-mass energy. As a consequence crosssections in this section are very small. A more realistic study\nwould require adapting those cuts to the centre-of mass energy,\nbut this is beyond the scope of this paper.\nClearly, there is also a similar background from W − + 3 jet production but we do not consider it here.\n\n\f7\n1\n\n10\n\nNLO, μ0\nLO, local scale\n\n0\n\n10\ndσ/dHT [fb/GeV]\n\nproduction cross section, it is important to consider this\nsource of the background as well.\nWe begin by listing a typical set of cuts that the ATLAS collaboration applies to suppress the W → τ + 3j\nbackground [27, 28, 29]. First, all jets are required to\nhave transverse momenta larger than 50 GeV and the\ntransverse momentum of the leading jet should exceed\n100 GeV. Second, missing energy in the event should\nsatP\nisfy 6 ET > max(100 GeV, 0.2HT ) with HT = j pT,j +\n6 ET . Third, no leptons with transverse momenta higher\nthan 20 GeV should be present. Fourth, jets should be\ncentral |ηj | < 3. Finally, the event is required to be\nspherical and the cut ST > 0.2 is applied on the transverse sphericity. We will not employ the sphericity cut in\nwhat follows because this observable is not collinear safe\nat parton level. In addition, since we consider semileptonic decays of the τ lepton, no high-pT lepton is present\nin our events and we do not need to employ a 20 GeV\nlepton cut. The primary observable is the distribution\nin the effective mass HT defined above and the range of\na particular interest for SUSY searches, given existing\n>\n1 TeV.\nbounds on gluino masses, is HT ∼\nA clear exposition of the effect that the ATLAS cuts\nhave on W → τ + 3j background at leading order was\nrecently given in Ref. [29]. It turns out that these cuts\nprimarily change the normalization of the background\nbut do not significantly affect the shape of the effective\n>\n1 TeV.\nmass distribution, especially in the region HT ∼\nWe would like to understand the impact of NLO QCD\ncorrections to W → τ +3 jet on the HT distribution. Our\nimplementation of radiative corrections incorporates W\ndecay to any leptonic final state but subsequent hadronic\ndecays of the τ -lepton are not included. Yet, as we will\nargue now, this is not necessary if all we need is an estimate of the QCD effects.\nWe note that, given the above cuts and, in particular,\nthe cut on the missing transverse energy, the τ lepton\nproduced in W decays will be highly boosted and its decay products will be very collimated. We then completely\nneglect the angular distribution of the τ decay products\nand assume a perfect collinear splitting. If, in addition,\nwe neglect all the spin correlations in τ decay τ → ντ qi q̄j ,\nwe conclude that the neutrino has to carry away about a\nthird of the τ momentum while the hadronic jet formed\nby a quark and an anti-quark from τ decay has to carry\naway two-thirds of the original τ momentum. We also\nexpect that, since the τ lepton is highly boosted, all its\nhadronic decay channels will contribute to the same jet,\nmaking the inclusive treatment of jet properties a reasonable approximation.\nWe can implement this set up in our calculation by\nproducing a W boson and letting it decay to a massless\nlepton and a massless neutrino. We then carry through\nall the steps required for the NLO QCD computation\nuntil the moment when the kinematics of events is examined and weights, relevant for various histogram bins,\nare calculated. At this point, we assign one-third of the\nlepton momentum to additional missing energy carried\n\n-1\n\n10\n\n-2\n\n10\n\n-3\n\n10\n\n-4\n\n10\n\n500\n\n1000\n\n1500\n2000\nHT [GeV]\n\n2500\n\n3000\n\nFIG. 11: Distributions in effective mass HT for (W + → τ̄ )+3\njet sample for ATLAS SUSY cuts described in the text. All\ncuts and parameters are described in the text. The leading\ncolor adjustment procedure is applied. The large difference\nbetween LO and NLO distributions can be absorbed by rescaling the LO distribution by a constant factor.\n\naway by ντ and two-thirds of the lepton momentum to\nthe fourth (τ ) jet in the event. Note that we do not apply\nthe jet algorithm to check whether or not the hadronic jet\nfrom τ decay is sufficiently separated from the other three\njets. 5 Since this step is not necessary for infra-red safety,\nwe feel that it is entirely justified to omit it, given the\napproximate nature of our analysis. For next-to-leading\ncomputations, we use the leading color adjustment procedure; we find that R = 0.93 is an appropriate value of\nthe re-scaling parameter for ATLAS cuts.\nThe results of our computation are presented in Fig. 11\nwhere the LO H⊥ distribution for our default local scale\ncompared to the NLO distribution for the factorization\nand renormalization scales set to μ0 . We point out that\nthe shape of the leading order distribution is similar to\nthat obtained with Alpgen presented in Ref. [29], especially at high values of the effective mass. At lower values of the effective mass, there is a dependence on the\nmodeling of τ → hadrons transition and, given the very\napproximate nature of our procedure, it is not surprising\nthat it tends to fail. It is reassuring, however, that our\nprocedure seems to work quite well for high values of the\neffective mass.\nAs follows from Fig. 11, the HT mass distribution receives large positive QCD corrections for ATLAS cuts.\nNote that distributions for local scales are not normalized to match the NLO distribution there. We studied\nthe scale dependence of the leading order predictions by\nvarying local scales around the central value by a factor\nof two. While we observe large ∼ ±50% scale dependence\nin the LO result, the NLO QCD corrections are ∼ 100%\n\n5\n\nWe did however impose a separation Rlj = 0.5 between the τ lepton and the jets.\n\n\f8\n\nB.\n\nCMS indirect lepton veto cut\n\nHow robust is the situation discussed in connection\nwith ATLAS cuts? To answer this question, we study\nanother example of background cuts. Those cuts are\nadopted by the CMS collaboration for SUSY searches\nat the LHC [30, 31]. The target signal is gluino pair\nproduction and the final state involves jets and missing\ntransverse energy.\nThe CMS collaboration does not veto leptons directly.\nRather, cuts are designed in such a way that the contribution of W +jets becomes naturally small. Such cuts are\nusually referred to as indirect lepton veto cuts. We approximate the CMS indirect lepton veto cut by requiring\nthat there are three or more jets in the event. The missing energy in the event should be large, Emiss > 200 GeV.\n\n0\n\n10\n\ndσ/dHT,24 [fb/GeV]\n\nand are thus considerably larger than what the LO scale\nvariation suggests. The scale dependence of the H⊥ distribution does decrease considerably at NLO. We find\nthat NLO QCD effects provide a universal enhancement\nof HT distribution without distorting its shape. Interestingly, the cuts on jets and missing energy presented\nat the beginning of this Section have a similar impact on\nthe (W → τ ) + 3 jet background – each of the individual\ncuts reduces the magnitude of (W → τ ) + 3 jet by a factor between three and four, without affecting the shape\nof the HT distribution [29]. NLO QCD effects therefore\nare comparable to the effects of the cuts and work in the\nopposite direction.\nWe emphasize that, had we chosen scale μ0 also in LO\ncomputation, we would observe large positive NLO QCD\neffects for H⊥ distribution, in sharp contrast with large\nnegative corrections for such scale choice in high-p⊥,j regions, described in the previous Section (see Fig. 3). This\nis not surprising since, in contrast to W + 3 jet signal\ncuts, ATLAS cuts require large amount of missing energy, which forces W transverse momentum to be comparable or larger than transverse momenta of hard jets in\nthe event. Jet branching on the other hand, can occur at\nlower relative transverse momenta. Taking the relative\ntransverse momentum as the correct scale for the strong\ncoupling constant, it is natural that LO cross sections\nfor μ = μ0 strongly underestimate the HT distribution.\nThis is indeed what we see when LO and NLO results\nare compared.\nWe believe that this discussion shows explicitly how\nproblematic extrapolation from signal to background region can be since the NLO QCD effects for ATLAS cuts\nhave no relation whatsoever to the NLO QCD effects for\nthe total cross section. This mismatch happens because\nthe kinematic region selected by ATLAS cuts gives negligible contribution to the total cross section. On the other\nhand, it appears that one can use low HT < 1 TeV bins\nfor ATLAS cuts to fix background normalization since\nQCD effects seem to be HT -independent and SUSY contamination in low-HT bins is small.\n\nNLO, μ0\nLO, local scale\n\n-1\n\n10\n\n-2\n\n10\n\n-3\n\n10\n\n600\n\n800\n\n1000\n1200\nHT,24 [GeV]\n\n1400\n\n1600\n\nFIG. 12: Distributions in reduced transverse mass HT,24 for\nW + + 3 jet events with CMS SUSY cuts that define indirect lepton veto procedure as described in the text. All cuts\nand parameters are described in the text. The leading color\nadjustment procedure is applied.\n\nThe leading jet in the event should be very central\n|ηlead jet | < 1.7 while all other jets should be in the central region |ηother jets | < 3. Jets are defined with the\ntransverse momentum cut of pT,j > 30 GeV but the\ntransverse momentum of the leading and sub-leading jets\nshould be larger that 180 and 110 GeV, respectively. Leptons from W decays should satisfy the same cuts as jets\nbut lepton transverse momentum can not be the largest\nor next-to-largest in a particular event; experimentally,\nthis requirement is implemented by cutting on the fraction of electromagnetic energy carried by a \"jet\". Finally, a particular effective mass is required to be large\n4\nP\npT,j + Emiss > 500 GeV. To calculate the\nHT,24 =\nj=2\n\nsum in this formula one orders leptons and jets according to their hardness, disregards the leading jet and sums\nover transverse momenta of second-to-leading, third-toleading and fourth-to-leading particles/jets.\nWe show the result of our computation of the NLO\nQCD corrections to the W + 3 jet cross section in case\nof CMS-style cuts in Figs. 12,13, where distributions in\nHT,24 and missing energy are plotted. We again use μ0 ,\nas the factorization and renormalization scales and vary\nit by a factor two up and down to estimate scale uncertainties. The NLO corrections for these cuts change the\nLO result by −40% to −10% depending on the scale chosen in LO computations. For μ = μ0 , the corrections are\nabout −10% and no significant changes of shape are observed. In this case, the scale variation at leading order\ngives a good indication of the size of NLO QCD corrections.\nIt is striking that the magnitude of NLO QCD corrections for CMS cuts is in strong contrast with the magnitude of NLO QCD effects for ATLAS cuts, discussed in\nthe previous Section. This emphasizes the dependence of\nNLO QCD corrections on exact implementation of kine-\n\n\f9\n0\n\n10\n\nNLO, μ0\nLO, local scale\n\n-1\n\ndσ/dpt,miss [fb/GeV]\n\n10\n\n-2\n\n10\n\n-3\n\n10\n\n-4\n\n10\n\n-5\n\n10\n\n-6\n\n10\n\n400\n\n800\n1200\npt, miss [GeV]\n\n1600\n\nFIG. 13: Distributions in the missing transverse energy for\nW + + 3 jet events with CMS SUSY cuts that define indirect lepton veto procedure as described in the text. All cuts\nand parameters are described in the text. The leading color\nadjustment procedure is applied.\n\nmatic cuts even if such cuts are designed to target very\nsimilar physics beyond the Standard Model. On the other\nhand, we find that shapes of basic distributions employed\nin supersymmetric searches are described fairly well by\nleading order computations, for both ATLAS and CMS\ncuts. If one can verify that, say, low-H⊥ bins are not\ncontaminated by New Physics, those bins can be used to\ndetermine the normalization of the background.\nIV.\n\nCONCLUSIONS\n\nwe find a large difference in shapes between LO and NLO\ndistributions. On the other hand, it is clear a'priori that\nbetter results are achievable if scales are chosen based on\nlocal probabilities for jet branching. Here we have shown\nexplicitly that when a local scale choice for the strong\ncoupling constant is employed in leading order computations, such computations reproduce shapes of various\nNLO distributions quite well. Note that any leading order computation matched to parton shower in the spirit\nof CKKW procedure [39] does employ such local scales\nand our NLO analysis therefore confirms that, as far as\nshapes of various kinematic distributions are concerned,\nthis is a very reasonable procedure.\nThe production of W -bosons in association with three\njets is an important background for SUSY searches in\njets + missing energy channels. We studied NLO QCD\ncorrections to cuts employed by ATLAS and CMS collaborations for SUSY searches and found that such corrections are not at all correlated with corrections to the\ntotal cross sections. It is peculiar that the magnitude of\nNLO QCD corrections to, say, effective transverse mass\ndistributions, is very different for ATLAS and CMS cuts\nin spite of the fact that these cuts are designed to serve\nthe same purpose. We find large (∼ 100%) corrections\nfor ATLAS and small (∼ 10%) QCD corrections for CMS\ncuts. We believe that this non-uniformity of corrections\nand their apparent strong dependence of the experimental set-up emphasizes the need for extending NLO QCD\nstudies to other relevant backgrounds such as W + 4 jets\nand Z + 3, 4 jets. We hope that techniques for NLO\nQCD computations developed in recent years make such\ncomputations possible.\n\nWe have discussed the NLO QCD corrections to W + 3\njet production at the LHC. We found that the inclusion\nof NLO QCD corrections leads to a significant reduction\nin dependence of LO results on the renormalization and\nfactorization scales; the residual uncertainty associated\nwith the total cross section is ±5%. We showed that\nsmall corrections to total cross sections do not necessarily imply that corrections to differential distributions are\nsmall and there is a high degree of non-uniformity in\nthese corrections across the available phase-space.\nIt should be stressed that the last statement depends\nupon renormalization and factorization scales chosen in\nleading order computations. In particular ifqleading order\ncalculations are done with the scale μ = p2T,W + m2W\n\nAcknowledgments We would like to thank Keith Ellis for collaboration at the early stages of this work, useful\ndiscussions and advice. We are grateful to Zoltan Kunszt,\nFabio Maltoni, Michelangelo Mangano, Fulvio Piccinini\nand Gavin Salam for useful discussions and correspondence. Parts of this work were carried our during stays\nat Fermilab and CERN whose support and hospitality we\ngratefully acknowledge. K.M. is supported by NSF under\ngrant PHY-0855365 and by the start up funds provided\nby Johns Hopkins University. G.Z. is supported by the\nBritish Science and Technology Facilities Council. Calculations reported in this paper were performed on the\nHomewood High Performance Cluster of Johns Hopkins\nUniversity.\n\n[1] Z. Bern et al. [NLO Multileg Working Group],\narXiv:0803.0494 [hep-ph].\n[2] A. Bredenstein, A. Denner, S. Dittmaier and S. Pozzorini, JHEP 0808, 108 (2008) [arXiv:0807.1248 [hepph]].\n[3] A. Bredenstein, A. Denner, S. Dittmaier and\nS. Pozzorini, Phys. Rev. Lett. 103 (2009) 012002\n\n[arXiv:0905.0110 [hep-ph]].\n[4] R. K. Ellis, K. Melnikov and G. Zanderighi, JHEP 0904,\n077 (2009) [arXiv:0901.4101 [hep-ph]].\n[5] R. K. Ellis, K. Melnikov and G. Zanderighi,\narXiv:0906.1445 [hep-ph].\n[6] C. F. Berger et al., arXiv:0907.1984 [hep-ph].\n[7] C. F. Berger et al., Phys. Rev. Lett. 102, 222001 (2009)\n\n\f10\n[arXiv:0902.2760 [hep-ph]].\n[8] G. Bevilacqua, M. Czakon, C. G. Papadopoulos, R. Pittau and M. Worek, arXiv:0907.4723 [hep-ph].\n[9] G. Passarino and M. J. G. Veltman, Nucl. Phys. B 160,\n151 (1979).\n[10] A. Denner and S. Dittmaier, Nucl. Phys. B 734, 62\n(2006) [arXiv:hep-ph/0509141].\n[11] G. Ossola, C. G. Papadopoulos and R. Pittau, Nucl.\nPhys. B 763, 147 (2007) [arXiv:hep-ph/0609007].\n[12] G. Ossola, C. G. Papadopoulos and R. Pittau, JHEP\n0803 042 (2008) [arXiv:0711.3596 [hep-ph]].\n[13] Z. Bern, L. J. Dixon, D. C. Dunbar and D. A. Kosower,\nNucl. Phys. B 425, 217 (1994) [arXiv:hep-ph/9403226].\n[14] Z. Bern, L. J. Dixon, D. C. Dunbar and D. A. Kosower,\nNucl. Phys. B 435, 59 (1995) [arXiv:hep-ph/9409265].\n[15] Z. Bern, L. J. Dixon and D. A. Kosower, Nucl. Phys. B\n513, 3 (1998) [arXiv:hep-ph/9708239].\n[16] R. Britto, F. Cachazo and B. Feng, Nucl. Phys. B 725,\n275 (2005) [arXiv:hep-th/0412103].\n[17] R. K. Ellis, W. T. Giele and Z. Kunszt, JHEP 0803, 003\n(2008) [arXiv:0708.2398 [hep-ph]];\n[18] W. T. Giele, Z. Kunszt and K. Melnikov, JHEP 0804,\n049 (2008) [arXiv:0801.2237 [hep-ph]].\n[19] C. F. Berger et al., Phys. Rev. D 78, 036003 (2008)\n[arXiv:0803.4180 [hep-ph]].\n[20] W. T. Giele and G. Zanderighi, JHEP 0806, 038 (2008)\n[arXiv:0805.2152 [hep-ph]].\n[21] C. F. Berger et al., arXiv:0808.0941 [hep-ph].\n[22] R. K. Ellis, W. T. Giele, Z. Kunszt, K. Melnikov and\nG. Zanderighi, JHEP 0901, 012 (2009) [arXiv:0810.2762\n[hep-ph]].\n[23] A. Lazopoulos, arXiv:0812.2998 [hep-ph].\n[24] J. C. Winter and W. T. Giele, arXiv:0902.0094 [hep-ph].\n[25] A. van Hameren, C. G. Papadopoulos and R. Pittau,\n\nJHEP 0909, 106 (2009) [arXiv:0903.4665 [hep-ph]].\n[26] See the LHC schedule at http://lhc.web.cern.ch/lhc/ .\n[27] T. Yamazaki [ATLAS Collaboration and CMS Collaboration], arXiv:0805.3883 [hep-ex].\n[28] S. Yamamoto [ATLAS Collaboration], arXiv:0710.3953\n[hep-ex].\n[29] M. L. Mangano, Eur. Phys. J. C 59 (2009) 373\n[arXiv:0809.1567 [hep-ph]].\n[30] The CMS Collaboration Journ. Phys. G: Nucl. Part.\nPhys. 34 (2007), 995-1579.\n[31] M. Spiropulu, Eur. Phys. J. C 59, 445 (2009).\n[32] See http://mcfm.fnal.gov .\n[33] S. Catani and M. H. Seymour, Nucl. Phys. B485,\n291 (1997) [Erratum-ibid. B 510, 503; (1998)]\n[arXiv:hep-ph/9605323].\n[34] G. P. Salam and G. Soyez, JHEP 0705, 086 (2007)\n[arXiv:0704.0292 [hep-ph]].\n[35] J. Pumplin, D. R. Stump, J. Huston, H. L. Lai,\nP. M. Nadolsky and W. K. Tung, JHEP 0207, 012 (2002)\n[arXiv:hep-ph/0201195].\n[36] P. M. Nadolsky et al., Phys. Rev. D 78, 013004 (2008)\n[arXiv:0802.0007 [hep-ph]].\n[37] J. Alwall et al., Eur. Phys. J. C 53, 473 (2008)\n[arXiv:0706.2569 [hep-ph]].\n[38] C. W. Bauer and B. O. Lange, arXiv:0905.4739 [hep-ph].\n[39] S. Catani, F. Krauss, R. Kuhn and B. R. Webber, JHEP\n0111, 063 (2001) [arXiv:hep-ph/0109231].\n[40] M.L. Mangano, M. Moretti, F. Piccinini, R. Pittau, A.\nPolosa, JHEP 0307:001, (2003).\n[41] G. Corcella, I.G. Knowles, G. Marchesini, S. Moretti,\nK. Odagiri, P. Richardson, M.H. Seymour and B.R. Webber, JHEP 0101 (2001) 010.\n\n\f"}