{"id": "http://arxiv.org/abs/1201.4178v1", "guidislink": true, "updated": "2012-01-19T21:11:42Z", "updated_parsed": [2012, 1, 19, 21, 11, 42, 3, 19, 0], "published": "2012-01-19T21:11:42Z", "published_parsed": [2012, 1, 19, 21, 11, 42, 3, 19, 0], "title": "Chandra & HST Imaging of the Quasars PKS B0106+013 & 3C345: Inverse\n  Compton X-rays and Magnetized Jets", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1201.4111%2C1201.5702%2C1201.3530%2C1201.5701%2C1201.2976%2C1201.4440%2C1201.3726%2C1201.4570%2C1201.5231%2C1201.4995%2C1201.6052%2C1201.3609%2C1201.5254%2C1201.3149%2C1201.4705%2C1201.0872%2C1201.5862%2C1201.1070%2C1201.5610%2C1201.4659%2C1201.1276%2C1201.3376%2C1201.2796%2C1201.3132%2C1201.2806%2C1201.1213%2C1201.0527%2C1201.2081%2C1201.3773%2C1201.4115%2C1201.1876%2C1201.2106%2C1201.5282%2C1201.1202%2C1201.6425%2C1201.5492%2C1201.1299%2C1201.2502%2C1201.3813%2C1201.4178%2C1201.4949%2C1201.3803%2C1201.1930%2C1201.2118%2C1201.3152%2C1201.1106%2C1201.3112%2C1201.0016%2C1201.1495%2C1201.2361%2C1201.4736%2C1201.2547%2C1201.6019%2C1201.0196%2C1201.0703%2C1201.4689%2C1201.4553%2C1201.5010%2C1201.5972%2C1201.0219%2C1201.6574%2C1201.5745%2C1201.5946%2C1201.4271%2C1201.3329%2C1201.1347%2C1201.1012%2C1201.6643%2C1201.6658%2C1201.5321%2C1201.4183%2C1201.2330%2C1201.1342%2C1201.1181%2C1201.2372%2C1201.6383%2C1201.3012%2C1201.2610%2C1201.2614%2C1201.1838%2C1201.3796%2C1201.3509%2C1201.0582%2C1201.0296%2C1201.3458%2C1201.3209%2C1201.2163%2C1201.3740%2C1201.1416%2C1201.1698%2C1201.0001%2C1201.5703%2C1201.1431%2C1201.5966%2C1201.1611%2C1201.5330%2C1201.0757%2C1201.4491%2C1201.0586%2C1201.6680%2C1201.2789&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Chandra & HST Imaging of the Quasars PKS B0106+013 & 3C345: Inverse\n  Compton X-rays and Magnetized Jets"}, "summary": "We present results from deep (70 ks) Chandra ACIS observations and Hubble\nSpace Telescope ACS F475W observations of two highly optically polarized\nquasars belonging to the MOJAVE blazar sample, viz., PKS B0106+013 and 1641+399\n(3C345). These observations reveal X-ray and optical emission from the jets in\nboth sources. X-ray emission is detected from the entire length of the 0106+013\nradio jet, which shows clear bends or wiggles - the X-ray emission is brightest\nat the first prominent kpc jet bend. A picture of a helical kpc jet with the\nfirst kpc-scale bend representing a jet segment moving close(r) to our line of\nsight, and getting Doppler boosted at both radio and X-ray frequencies, is\nconsistent with these observations. The X-ray emission from the jet end however\npeaks at about 0.4\" (~3.4 kpc) upstream of the radio hot spot. Optical emission\nis detected both at the X-ray jet termination peak and at the radio hot spot.\nThe X-ray jet termination peak is found upstream of the radio hot spot by\naround 0.2\" (~1.3 kpc) in the short projected jet of 3C345. HST optical\nemission is seen in an arc-like structure coincident with the bright radio hot\nspot, which we propose is a sharp (apparent) jet bend instead of a terminal\npoint, that crosses our line of sight and consequently has a higher Doppler\nbeaming factor. A weak radio hot spot is indeed observed less than 1\"\ndownstream of the bright radio hot spot, but has no optical or X-ray\ncounterpart. By making use of the pc-scale radio and the kpc-scale radio/X-ray\ndata, we derive constraints on the jet Lorentz factors (Gamma_jet) and\ninclination angles (theta): for a constant jet speed from pc- to kpc-scales, we\nobtain a Gamma_jet of ~70 for 0106+013, and ~40 for 3C345. On relaxing this\nassumption, we derive a Gamma_jet of ~2.5 for both the sources. Upper limits on\ntheta of ~13 degrees are obtained for the two quasars. (ABRIDGED)", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1201.4111%2C1201.5702%2C1201.3530%2C1201.5701%2C1201.2976%2C1201.4440%2C1201.3726%2C1201.4570%2C1201.5231%2C1201.4995%2C1201.6052%2C1201.3609%2C1201.5254%2C1201.3149%2C1201.4705%2C1201.0872%2C1201.5862%2C1201.1070%2C1201.5610%2C1201.4659%2C1201.1276%2C1201.3376%2C1201.2796%2C1201.3132%2C1201.2806%2C1201.1213%2C1201.0527%2C1201.2081%2C1201.3773%2C1201.4115%2C1201.1876%2C1201.2106%2C1201.5282%2C1201.1202%2C1201.6425%2C1201.5492%2C1201.1299%2C1201.2502%2C1201.3813%2C1201.4178%2C1201.4949%2C1201.3803%2C1201.1930%2C1201.2118%2C1201.3152%2C1201.1106%2C1201.3112%2C1201.0016%2C1201.1495%2C1201.2361%2C1201.4736%2C1201.2547%2C1201.6019%2C1201.0196%2C1201.0703%2C1201.4689%2C1201.4553%2C1201.5010%2C1201.5972%2C1201.0219%2C1201.6574%2C1201.5745%2C1201.5946%2C1201.4271%2C1201.3329%2C1201.1347%2C1201.1012%2C1201.6643%2C1201.6658%2C1201.5321%2C1201.4183%2C1201.2330%2C1201.1342%2C1201.1181%2C1201.2372%2C1201.6383%2C1201.3012%2C1201.2610%2C1201.2614%2C1201.1838%2C1201.3796%2C1201.3509%2C1201.0582%2C1201.0296%2C1201.3458%2C1201.3209%2C1201.2163%2C1201.3740%2C1201.1416%2C1201.1698%2C1201.0001%2C1201.5703%2C1201.1431%2C1201.5966%2C1201.1611%2C1201.5330%2C1201.0757%2C1201.4491%2C1201.0586%2C1201.6680%2C1201.2789&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We present results from deep (70 ks) Chandra ACIS observations and Hubble\nSpace Telescope ACS F475W observations of two highly optically polarized\nquasars belonging to the MOJAVE blazar sample, viz., PKS B0106+013 and 1641+399\n(3C345). These observations reveal X-ray and optical emission from the jets in\nboth sources. X-ray emission is detected from the entire length of the 0106+013\nradio jet, which shows clear bends or wiggles - the X-ray emission is brightest\nat the first prominent kpc jet bend. A picture of a helical kpc jet with the\nfirst kpc-scale bend representing a jet segment moving close(r) to our line of\nsight, and getting Doppler boosted at both radio and X-ray frequencies, is\nconsistent with these observations. The X-ray emission from the jet end however\npeaks at about 0.4\" (~3.4 kpc) upstream of the radio hot spot. Optical emission\nis detected both at the X-ray jet termination peak and at the radio hot spot.\nThe X-ray jet termination peak is found upstream of the radio hot spot by\naround 0.2\" (~1.3 kpc) in the short projected jet of 3C345. HST optical\nemission is seen in an arc-like structure coincident with the bright radio hot\nspot, which we propose is a sharp (apparent) jet bend instead of a terminal\npoint, that crosses our line of sight and consequently has a higher Doppler\nbeaming factor. A weak radio hot spot is indeed observed less than 1\"\ndownstream of the bright radio hot spot, but has no optical or X-ray\ncounterpart. By making use of the pc-scale radio and the kpc-scale radio/X-ray\ndata, we derive constraints on the jet Lorentz factors (Gamma_jet) and\ninclination angles (theta): for a constant jet speed from pc- to kpc-scales, we\nobtain a Gamma_jet of ~70 for 0106+013, and ~40 for 3C345. On relaxing this\nassumption, we derive a Gamma_jet of ~2.5 for both the sources. Upper limits on\ntheta of ~13 degrees are obtained for the two quasars. (ABRIDGED)"}, "authors": ["Preeti Kharb", "Matthew Lister", "Herman Marshall", "Brandon Hogan"], "author_detail": {"name": "Brandon Hogan"}, "author": "Brandon Hogan", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1088/0004-637X/748/2/81", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1201.4178v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1201.4178v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "46 pages, 11 figures, Accepted for publication in ApJ", "arxiv_primary_category": {"term": "astro-ph.CO", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "astro-ph.CO", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "astro-ph.HE", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1201.4178v1", "affiliation": "El Camino College, Marymount College, CA", "arxiv_url": "http://arxiv.org/abs/1201.4178v1", "journal_reference": null, "doi": "10.1088/0004-637X/748/2/81", "fulltext": "Chandra & HST Imaging of the Quasars PKS B0106+013 &\n3C 345: Inverse Compton X-rays and Magnetized Jets\n\narXiv:1201.4178v1 [astro-ph.CO] 19 Jan 2012\n\nP. Kharb\nDepartment of Physics, Rochester Institute of Technology, Rochester, NY 14623\nkharb@cis.rit.edu\nM. L. Lister\nDepartment of physics, Purdue University, West Lafayette, IN 47906\nH. L. Marshall\nCenter for Space Research, Massachusetts Institute of Technology, Cambridge, MA 02139\nand\nB. S. Hogan\nDepartment of physics, Purdue University, West Lafayette, IN 47906\nEl Camino College, 16007 Crenshaw Blvd. Torrance, CA 90506\nMarymount College, 30800 Palos Verdes Drive East, Rancho Palos Verdes, CA 90275\nReceived\n\n;\n\naccepted\n\n\f–2–\nABSTRACT\nWe present results from deep (∼70 ks) Chandra ACIS observations and Hubble\nSpace Telescope (HST) ACS F475W observations of two highly optically polarized\nquasars belonging to the MOJAVE (Monitoring Of Jets in Active galactic nuclei\nwith VLBA Experiments) blazar sample, viz., PKS B0106+013 and 1641+399\n(3C 345). These observations reveal X-ray and optical emission from the jets in\nboth sources. X-ray emission is detected from the entire length of the 0106+013\nradio jet, which shows clear bends or wiggles - the X-ray emission is brightest\nat the first prominent kpc jet bend. A picture of a helical kpc jet with the first\nkpc-scale bend representing a jet segment moving close(r) to our line of sight,\nand getting Doppler boosted at both radio and X-ray frequencies, is consistent\nwith these observations. The X-ray emission from the jet end however peaks\nat about 0.′′ 4 (∼3.4 kpc) upstream of the radio hot spot. Optical emission is\ndetected both at the X-ray jet termination peak and at the radio hot spot. The\nX-ray jet termination peak is found upstream of the radio hot spot by around 0.′′ 2\n(∼1.3 kpc) in the short projected jet of 3C 345. HST optical emission is seen in\nan arc-like structure coincident with the bright radio hot spot, which we propose\nis a sharp (apparent) jet bend instead of a terminal point, that crosses our line of\nsight and consequently has a higher Doppler beaming factor. A weak radio hot\nspot is indeed observed less than 1′′ downstream of the bright radio hot spot, but\nhas no optical or X-ray counterpart. By making use of the pc-scale radio and the\nkpc-scale radio/X-ray data, we derive constraints on the jet Lorentz factors (Γjet)\nand inclination angles (θ): for a constant jet speed from pc- to kpc-scales, we\nobtain a Γjet of ∼70 for 0106+013, and ∼40 for 3C 345. On relaxing this assumption, we derive a Γjet of ∼2.5 for both the sources. Upper limits on θ of ∼ 13◦ are\nobtained for the two quasars. Broad-band (radio-optical-X-ray) spectral energy\n\n\f–3–\ndistribution modeling of individual jet components in both quasars suggests that\nthe optical emission is from the synchrotron mechanism, while the X-rays are\nproduced via the inverse Compton mechanism from relativistically boosted cosmic microwave background seed photons. The locations of the upstream X-ray\ntermination peaks strongly suggest that the sites of bulk jet deceleration lie upstream (by a few kpc) of the radio hot spots in these quasars. These regions are\nalso the sites of shocks or magnetic field dissipation, which reaccelerate charged\nparticles and produce high energy optical and X-ray photons. This is consistent\nwith the best fit SED modeling parameters of magnetic field strength and electron powerlaw indices being higher in the jet termination regions compared to\nthe cores. The shocked jet regions upstream of the radio hot spots, the kpc-scale\njet wiggles and a \"nose cone\" like jet structure in 0106+013, and the V-shaped\nradio structure in 3C 345, are all broadly consistent with instabilities associated\nwith Poynting flux dominated jets. A greater theoretical understanding and more\nsensitive numerical simulations of jets spanning parsec- to kpc-scales are needed,\nhowever, to make direct quantitative comparsions.\nSubject headings: galaxies: active - galaxies: jets - quasars: individual (0106+013,\n3C 345) - radio continuum: general - X-rays: galaxies\n\n\f–4–\n1.\n\nIntroduction\n\nBlazars are radio-loud active galactic nuclei (AGNs) characterized by the presence of\nbright, compact radio cores that are highly polarized and variable in total and polarized\nintensity. They also typically exhibit superluminal motion in their parsec-scale jets.\nThis extreme behavior is commonly understood to be a consequence of relativistic\nDoppler boosting effects in jets that are aligned at small angles to our line of sight (e.g.,\nAngel & Stockman 1980). In terms of emission-line properties, the blazar class comprises\nof optically violently variable (OVV) quasars and BL Lac objects, with their rest-frame\nemission-line equivalent widths greater than or less than 5 Å, respectively (Stocke et al.\n1991; Stickel et al. 1991). In terms of radio jet properties, apart from total radio power,\nquasars and BL Lacs are distinguished by the presence or absence of narrow collimated\njets with terminal hot spots, respectively (although see Rector & Stocke 2001; Kharb et al.\n2010).\nIn the last decade, the Chandra X-ray Observatory has added a new dimension to the\nfield of jet astrophysics by detecting large kpc-scale X-ray jets in the majority of blazars\nstudied (e.g., Sambruna et al. 2004; Marshall et al. 2005, 2011; Hogan et al. 2011). This\nis intriguing because X-ray synchrotron emitting electrons are expected to have short\nradiative lifetimes, typically of the order of 10 years, in an \"equipartition\" magnetic field\n(Beq , typically ≤0.1 mG). While the X-ray emission in some low radio power jets can\nindeed be best described as synchrotron radiation (e.g., Harris et al. 1998; Sambruna et al.\n2007), X-ray jets in powerful radio sources seem to be consistent with inverse-Compton\n(IC) emission associated with boosted cosmic microwave background (CMB) photons\n(e.g., Tavecchio et al. 2000; Celotti et al. 2001), or IC emission associated with the\nsynchrotron photons themselves, i.e., the synchrotron self-Compton (SSC) mechanism (e.g.,\nHardcastle et al. 2001). A two-zone model has been invoked for the jet in the quasar 3C 273,\n\n\f–5–\nwhere a fast-moving \"spine\" produces most of the X-ray emission through the IC/CMB\nmechanism, and a slower-moving \"sheath\" produces X-rays through the synchrotron process\n(Jester et al. 2006). The IC/CMB model is attractive as it can explain the emission in\na majority of X-ray jets, without straying far from the minimum energy condition or\nthe \"equipartition\" magnetic field (Harris & Krawczynski 2002). However, the model\nrequires that the jet remain highly relativistic on kiloparsec-scales (bulk Lorentz factors,\nΓjet ∼ 5 − 10), so that in the jet frame, the CMB photon energy density is boosted by Γ2jet .\nThe difficulty arises because a Γjet ∼ 2 is generally deduced for kpc-scale jets, through jet to\ncounterjet brightness ratio arguments (Bridle et al. 1994; Wardle & Aaron 1997). However,\nit is fair to say that jet speeds in kpc jets are still largely unconstrained due to the lack of\ndirect observations. The SSC model, on the other hand, usually requires the jet magnetic\nfield to be significantly lower than Beq . The synchrotron emission model is also inconsistent\nwith the shape of the broad band spectral energy distributions (SEDs) in many quasar jet\nknots (Harris & Krawczynski 2006). Therefore, the exact X-ray emission mechanism(s) in\nthe kpc-scale jets or jet knots of different AGN subclasses, is still an unresolved issue.\nThe uncertainties associated with the X-ray jet emission mechanisms are compounded\nby the fact that observations of large well-defined samples of distinct AGN subclasses have\nnot yet been carried out. Only pilot observations of sizable samples (> 10 sources) have\nbeen presented so far by Sambruna et al. (2004); Hardcastle et al. (2004); Marshall et al.\n(2005); Massaro et al. (2010); Marshall et al. (2011). We recently concluded a pilot (∼10\nksec) X-ray study of 27 superluminal quasars belonging to the MOJAVE-Chandra sample\n(MCS, Hogan et al. 2011). The MOJAVE (Monitoring Of Jets in Active galactic nuclei\nwith VLBA Experiments) sample is a complete parsec-scale flux density-limited sample at\n15 GHz of 135 radio-loud AGNs, most of which are blazars (Lister & Homan 2005). The\nsample members of the MCS have large 1.4 GHz Very Large Array (VLA) extended flux\ndensities (> 100 mJy), and long radio jets (≥ 3′′ in extent). The pilot study revealed X-ray\n\n\f–6–\njets in nearly 80% of the sample (Hogan et al. 2011). As the majority of the MCS quasars\nlie between redshifts 0.5 and 1 (three sources are at z >1), the high detection rate could be\nconsidered to be consistent with the IC/CMB model, as the CMB photon energy density\nincreases with redshift as (1 + z)4 .\nIn order to expressly test this idea, by creating and modeling broad band SEDs of\nindividual jet components, we recently acquired deep ∼70 ksec Chandra and single-orbit\nHubble Space Telescope (HST) imaging data on two MCS quasars, viz., PKS B0106+013,\nand 1641+399 (3C 345). The results from these observations are presented here. The paper\nis structured as follows. Section 2 describes the two targets, while Section 3 describes\nthe multi-waveband observations and data-analysis. Section 4 discusses the imaging,\nX-ray spectral analysis and broad-band SED modeling. Section 5 describes an attempt to\nconstrain the jet speed and viewing angle through pc- and kpc-scale data. The discussion\nand summary follow in Section 6. The spectral index α is defined such that flux density\nat frequency ν is, Sν ∝ ν −α and the photon index Γ = 1 + α. Throughout this paper, we\nadopt the cosmology in which H0 =71 km s−1 Mpc−1 , Ωm =0.27 and ΩΛ =0.73.\n\n2.\n\nObserved Sources\n\nFor our deep follow-up Chandra - HST study, we chose two MCS quasars which showed\nX-ray jets in the pilot observations, had large 1.4 GHz VLA extended flux densities (> 500\nmJy), and archival HST imaging data through at least one broad band filter.\n\n2.1.\n\nPKS B0106+013\n\nPKS B0106+013 is a highly optically polarized quasar (HPQ) at a redshift of 2.099\n(1′′ at the distance of the source corresponds to a spatial scale of ∼8.4 kpc). Its projected\n\n\f–7–\n∼38 kpc radio jet is clearly one-sided (Figure 1), which could be suggestive of a highly\nrelativistic jet on kpc-scales, oriented close to our line of sight. The kpc jet has a gently\nundulating S-shape around a position angle of 180◦ . Diffuse emission from a radio lobe is\nnot detected in its 1.6 GHz or 4.9 GHz images, either in the jet or the counterjet direction\n(Cooper et al. 2007). This may be due to the fact that only the VLA A-array configuration\nwas used at both the radio frequencies, and could therefore be missing a significant fraction\n(∼15%−20%) of the diffuse lobe emission as opposed to combined array observations (see\nKharb et al. 2008c, 2010). Indeed, the averaged total flux density at 4.8 GHz from the\nsingle-dish University of Michigan Radio Astronomy Database (UMRAO) is ∼3.0 Jy for\nthe year 1988, while it is ∼2.5 Jy from our January 1989 VLA data, indicating a ∼ 17%\nloss of (possibly extended) emission. However, there is an alternate explanation which is\nmore in line with our conclusions below that this jet is highly magnetized. This quasar may\nrepresent a rare class of powerful radio sources that do not possess radio lobes, but rather\nhave \"nose-cones\". Magnetized plasma then moves forward through the terminal shocks in\nthe jets, rather than backward like in radio lobes (Komissarov 1999; Clarke et al. 1986).\nThe parsec-scale 15 GHz radio emission of 0106+013 has been monitored by MOJAVE\n(Lister et al. 2009a) and the 2 cm Survey (Kellermann et al. 2004) since 1995. The jet\nstructure is dominated by a bright, optically thick core, and at least four individual jet\nfeatures have been seen to move outward from the core region (Lister et al. 2009b). These\nhave apparent speeds ranging from 21c to 26c, which are within the upper range seen in the\nradio-selected MOJAVE jet sample, and imply a bulk Lorentz factor of at least ∼ 21. The\nfeatures are moving outward at different individual position angles with respect to the core\n(between 229◦ and 260◦ ), and are following shallow curved paths. The jet rapidly drops\nbelow the sensitivity level of the MOJAVE 2 cm images at ∼3 milliarcsec (mas) from the\ncore. VLBA images at longer wavelengths (Fomalont et al. 2000) indicate a structure that\ncurves southward out to ∼ 30 mas at a position angle of 210◦.\n\n\f–8–\n2.2.\n\n3C 345\n\n3C 345 or B3 1641+399 is a powerful HPQ located at redshift z = 0.593 (1′′ at the\ndistance of the source corresponds to ∼6.6 kpc). The primary radio structure consists of a\nshort jet at position angle 327◦ that contains a bright hotspot, 2.′′ 7 away from the unresolved\ncore (Figure 1). The radio jet extends to a projected distance of ∼25 kpc. The 1.5 GHz\nimage shows an asymmetric halo centered on the core that has a radius of approximately\n10′′ . Although there is no clear indication of a radio counterjet, there is a suggestion of\na weak hot spot along the counterjet direction so that the hotspot-core-counter-hotspot\nforms a V-shape (see Murphy et al. 1993). This is likely to be the result of a somewhat\nmisaligned jet and counterjet that is oriented at a very small angle to line of sight. We note\nthat the averaged total flux density at 4.8 GHz from December, 1988 to February, 1989,\nis ∼8.6 Jy from the single-dish UMRAO database, while it is ∼8.8 Jy from our January\n1989 VLA data. This indicates that the VLA 4.8 GHz A-array observations do not miss\nmuch/any diffuse extended emission in this source. Core variability and/or amplitude and\nphase calibration errors could be contributing factors in the flux differences. It is interesting\nto note that V-shaped sources and S-shaped jets (as in 0106+013) are easier to explain in\nPoynting flux or magnetically-dominated jets, as they are easier to deflect in the presence\nof clumpy media (Benford 1978; Nakamura et al. 2007). We return to this suggestion in\nSection 6.\nBeing one of the most compact and powerful radio sources in the northern sky, the\nparsec-scale radio jet of 3C 345 has been studied for several decades with Very Long Baseline\nInterferometry. The jet starts out at a position angle of ∼ 270◦ , but then at 4 mas from the\ncore it abruptly curves northward and then propagates at a position angle of ∼ 315◦. A\nlong term campaign to study the jet kinematics (Schinzel et al. 2010) has shown that this\nbend has slowly migrated outward over time, and they have found numerous superluminal\n\n\f–9–\nfeatures with complex motions on scales of 0.3 to 15 mas. There appears to be no common\nvelocity for features within 0.7 mas of the core, but at farther distances numerous features\nhave been seen to move at speeds between 10c and 13c. The MOJAVE program has\nreported a maximum speed of 19.7c in the jet (Lister et al. 2009b). Many of the features\nhave helical or strongly curved trajectories on the sky, leading Lobanov & Roland (2005)\nto postulate a precessing jet model driven by a supermassive binary black hole system in\n3C 345.\n\n3.\n\nMultiwavelength Observations and Data Analysis\n3.1.\n\nChandra Data\n\nThe observations for 0106+013 took place on 2008 November 7 and 9, and for 3C 345\non 2009 November 1 and 3 (Table 1). The observations were obtained using the AXAF\nCCD Imaging Spectrometer (ACIS) S3 chip (which is back illuminated for low-energy\nresponse) in the very faint (VFAINT) timed mode. In order to reduce the effect of pileup\nof the bright quasar cores, the observations were carried out using the 1/8 subarray mode\n(frame time = 0.441 sec). For both the sources a range of roll angles were specified so that\nthe charge transfer trail of the nucleus did not contaminate the jet emission.\nThe Chandra data were reduced and analysed using the CIAO software version 4.2 and\ncalibration database (CALDB) version 4.2.11 . Using the CIAO tool \"acis process events\"\nwe reprocessed the level 1 data to remove the 0.5 pixel randomization. We did not attempt\nthe VFAINT mode background cleaning since both the targets were affected by pileup in\nthe nuclear regions (e.g., Davis 2001). The observations reveal that the core of 0106+013\nhas 0.06 counts frame−1 , corresponding to a small pileup fraction (2%), while the core of\n1\n\nhttp://cxc.harvard.edu/ciao/\n\n\f– 10 –\n\n03.0\n02.0\n\nDeclination\n\n01.0\n1:35:00.0\n59.0\n58.0\n57.0\n56.0\n34:55.0\n1:08:39.0 38.9 38.8 38.7 38.6\nRight ascension\n50\n\n38.5\n\n100\n\n150 200\n\n41.0\n39:48:40.0\nDeclination\n\n39.0\n38.0\n37.0\n36.0\n35.0\n34.0\n33.0\n16:42:59.0 58.8\n58.6\nRight ascension\n100\n\n300\n\n500\n\nFig. 1.- Energy filtered (0.5−7.0 keV) Chandra X-ray image of 0106+013 (top) and 3C 345\n(bottom) in color, with the 4.9 GHz VLA radio contours superimposed. Images were binned to\n0.25 of the native pixel size, and smoothed with a Gaussian of kernel radius = 3. The radio contours\nare (top) 0.001, 0.002, 0.006, 0.01, 0.03, 0.08, 0.2, 0.5, 1.3, 3.2, and (bottom) 0.002, 0.005, 0.01,\n0.02, 0.05, 0.11, 0.24, 0.52, 1.14, 2.5, 5.5 Jy beam−1 , respectively. The color scale goes from white\nto black for the X-ray intensity range of 0.5 to 70 counts arcsec−2 .\n\n\f– 11 –\n\nCore_bgnd\nJet_bgnd\n\nCore\nJet_1\nJet_2\nJet_3\n\n20\n\n40\n\n60\n\n80 100\n\nHotspot\n\nCore\n\nCore_bgnd\nHotspot_bgnd\n\n100\n\n200\n\n300\n\nFig. 2.- Regions used to extract the X-ray spectra for the cores, jet components, and background\nfor 0106+013 (top panel) and 3C 345 (bottom panel).\n\n\f– 12 –\n3C 345 has 0.18 counts frame−1 , corresponding to a pileup fraction of 8%. The data were\nfiltered on the Advanced Satellite for Cosmology and Astrophysics (ASCA) grades 0, 2, 3,\n4, 6 and on status. Finally, the Good Time Intervals (GTI) supplied with the pipeline were\napplied to create the new level 2 events file. The background light curves were examined\nfor flares, using the relevant thread in CIAO2 . A binning time of 100×frame-time was used\nfor creating the light curves. No significant background flares were detected in the data of\neither source.\nThe X-ray images with the 4.9 GHz radio contours superimposed are displayed in\nFigure 1. For the purpose of creating these images, we merged the two observations of each\nsource with \"dmmerge\" in CIAO, after reprojecting the two new event 2 files around the\ntangent point of one of them with CIAO tool \"reproject events\". The X-ray and radio cores\nwere matched using the FITS file editing software, Fv3 , after first \"locking\" the crosshair\non the radio core World Coordinate System (WCS) position in the astronomical imaging\nand data visualization application, DS9, and noting the position difference in pixels with\nrespect to the X-ray core. The X-ray image was smoothed with a Gaussian of kernel radius\n3 prior to the estimation of the pixel shift. The final shifts in the x, y direction were 0.24,\n0.25 pixels for 0106+013, and 0.60, 0.16 pixels for 3C 345. These pixel shifts are consistent\nwith the expected accuracy of the Chandra astrometry. Table 1 lists some observed and\nderived source parameters. The magnetic field strength, Beq , was derived assuming an\n\"equipartition\" of relativistic particle energy density and magnetic field energy density\n(Burbidge 1959), for a cylindrical jet geometry. The radio spectrum was assumed to extend\nfrom 107 to 1015 Hz, with a spectral index of 0.8. Furthermore, a volume filling factor of\nunity, and zero contribution to the particle energy density from protons was assumed.\n2\n\nhttp://cxc.harvard.edu/ciao/threads/filter/index.sl.html#filterback\n\n3\n\nhttp://heasarc.nasa.gov/ftools/fv/\n\n\f– 13 –\nThe CIAO tool \"specextract\" was used to extract the spectrum from the core and\njet regions. Figure 2 displays the regions used in the spectral extraction. Subsequently,\nthe spectral fitting and analysis was done using the XSPEC software (HEASOFT version\n6.6.3), using events with energy >0.5 keV and <10 keV, where the calibration is well\nknown. We attempted the spectral fitting for the core, using a circular region with diameter\nof 2′′ , centered on the pixel with the highest number of counts. The background was chosen\nas a source-free circular region with a diameter of 5′′ . A binning of 50 counts bin−1 was used\nfor the core.\nWe extracted jet spectra in 0106+013 from three circular regions of diameter 1.′′ 3\n(jet 1), 1.′′ 1 (jet 2), and 1.′′ 1 (jet 3), respectively (Figure 2, top panel). The background\nregion for the jet spectra was chosen as an elliptical region of size 2′′ × 4′′ . A binning of 20\ncounts bin−1 was used for the jet region \"jet 1\", and 15 counts bin−1 for regions \"jet 2\" and\n\"jet 3\". The jet knot/hot spot spectra for 3C 345 were extracted using a circular region of\ndiameter 2′′ , with a similar sized region used for the jet knot/hot spot background spectra\n(Figure 2, bottom panel). A binning of 20 counts bin−1 was used for this region. Spectra\nfrom the two observations of each source (shown as red and black data in Figures 7 to 8),\nwere fit simultaneously in XSPEC. The results of the spectral analysis are presented in\nTable 3 and discussed below in Section 4.3.\n\n\f– 14 –\n\nTable 1. Observed and Derived Source Parameters\n\nParameter\n\n0106+013\n\n1641+399\n\nOBSID\n\n10380, 10799 10379, 12011\n\nExposure (sec)\n\n33727, 31907 32770, 24865\n\nDate\n\n2008-11-07\n\n2009-10-27\n\nJet P.A. (deg)\n\n185\n\n−30\n\nrin , rout (arcsec)\n\n1.0, 5.0\n\n1.0, 5.0\n\nS4.9 (mJy)\n\n150.5 ± 0.8\n\n309.8 ± 2.1\n\nCount rate (ksec−1 )\n\n20.81 ± 0.98\n\n7.45 ± 1.04\n\nS1keV (nJy)\n\n20.8\n\n7.4\n\nαrx\n\n0.89 ± 0.00\n\n0.99 ± 0.01\n\nR (IC/syn)\n\n197.4\n\n34.3\n\nVolume (pc−3 )\n\n1.0E+12\n\n5.2E+11\n\nBeq (mG)\n\n157\n\n96\n\nK\n\n24±5\n\n23±4\n\nNote. - rin , rout are the inner and outer extents of\nthe jet region used for the derived parameters listed\nbelow. \"S4.9 \" and \"S1keV \" refer to the flux density at\n4.9 GHz and 1 keV, respectively. \"R\" is the ratio of\nthe observed X-ray (assumed to be inverse Compton)\nand radio (synchrotron) emission in the jets. \"R\"\n\n\f– 15 –\nalong with the equipartition magnetic field, Beq , is\nused for the estimation of the dimensionless \"K\" parameter (cf. equation 2). The K parameter can be\nused to provide constraints on the jet viewing angle\nand Lorentz factors, as described in Section 5.\n\n\f– 16 –\n3.2.\n\nHST Data\n\nThe HST observations for 3C 345 took place on 2010 July 11, and for 0106+013\non 2010 November 2, with the Wide Field Channel #1 of the Advanced Camera for\nSurveys (ACS/WFC1) through the F475W filter (pivot wavelength 4747 Å). Each source\nwas observed for a single HST orbit, which resulted in an exposure time of 2300 sec for\n0106+013, and 2280 sec for 3C 345. The data were obtained from the Space Telescope\nScience Institute (STScI) archive with the pipeline processing applied. The pipeline images\nhad been fully calibrated with the MultiDrizzle program (Koekemoer et al. 2002).\nDue to an error in the alternate roll angle range specification for 3C 345, a point\nspread function (PSF) spike fell close to the jet position. This has probably led to some\ncontamination of the flux of the single bright jet knot/hot spot present in this source.\nAs this source had archival data from the Space Telescope Imaging Spectrograph (STIS)\nCCD in the CLEAR (unfiltered) imaging mode (see Sambruna et al. 2004), we could\nobtain independent flux estimates for this jet feature. For this we combined the four\nsub-exposures in the STIS observations (at a pivot wavelength of 5850 Å) using the NOAO\nImage Reduction Analysis Facility (IRAF) tool crrej, which also got rid of the cosmic\nrays. We find that using the largely un-contaminated STIS flux and the contaminated ACS\nflux, yields a relatively flat optical spectral index, ∼ 0.06 for the \"hot spot\" of 3C 345.\nThis suggests that the contamination from the spike may not be as significant as initially\npresumed.\nAlthough the HST archive lists wide-field planetary camera 2 (WFPC2) data through\nthe F702W filter on 0106+013, the source is situated at the edge and just off the field\nof view. This makes the F475W image presented in this paper, the first HST image of\n0106+013. Figure 3 displays the PSF-subtracted HST images of 0106+013 and 3C 345 with\nthe 4.9 GHz radio and X-ray contours superimposed. The peak optical, X-ray and radio\n\n\f– 17 –\n\n02.0\n01.0\n\nDeclination\n\n1:35:00.0\n59.0\n58.0\n57.0\n56.0\n34:55.0\n1:08:39.0\n\n-0.015 -0.01\n\n-0.005\n\n38.9\n38.8\n38.7\nRight ascension\n\n0\n\n0.005\n\n38.6\n\n0.01\n\n41.0\n\nDeclination\n\n39:48:40.0\n39.0\n38.0\n37.0\n36.0\n35.0\n34.0\n16:42:59.0\n58.8\n58.6\nRight ascension\n-0.02\n\n-0.01\n\n0\n\n0.01\n\nFig. 3.- The PSF-subtracted HST/ACS F475W color image of 0106+013 (top) and 3C 345\n(bottom), with the 4.9 GHz radio (black) and X-ray (blue) contours superimposed. The HST\nimage was smoothed with a Gaussian kernel radius of 9. The \"squared-zscale\" option was used for\nthe color scale. The radio contour levels are the same as in Figure 1. The X-ray contour levels are\n(top) 1.38, 1.98, 2.85, 4.10, 5.90, 8.48, 12.19, 17.54, 25.22, 36.27, 52.15, 75.00, and (bottom) 1.33,\n1.77, 2.35, 3.12, 4.14, 5.5, 7.3 counts arcsec−2 .\n\n\f– 18 –\ncore positions were matched using the FITS file editing Fv software. We subtracted the\nscaled PSF from the image to reveal the jet features clearly. The PSFs were created using\nthe TinyTim software4 . The scaling was done using the integrated flux of the quasar cores,\nrather than the peak flux. Figure 3 highlights the result that in 0106+013, optical hot spots\nare spatially coincident with the radio and X-ray hot spots, while in 3C 345, the optical hot\nspot is spatially coincident only with the radio hot spot.\nThe optical fluxes for the core and jet components of 0106+013 were estimated using\ncircular regions of diameter ∼ 0.′′ 5 in DS9 (Table 4). Source-free circular background regions\nof diameter 2′′ were used for the jet components, while an annular region of diameter\nbetween 0.′′ 5 − 1′′ was used for the core. The core flux of 3C 345 was estimated using similar\nsource and background regions. The jet knot/hot spot optical flux for 3C 345 was estimated\nusing a circular region of diameter ∼ 0.′′ 66 in DS9, while the background was estimated\nfrom an annular region between diameters 0.′′ 66 − 1.′′ 3. The source counts in the respective\nregions were estimated using the Chandra Education Analysis Tool in DS9 through the\nVirtual Observatory option. The net background-subtracted counts were estimated using\nthe relation, Net counts = Src counts − (ASrc /ABgnd ) × Bgnd counts, where \"A\" is the area\nin pixels from which the counts were extracted, \"Src\" and \"Bgnd\" refer to the source and\nbackground, respectively. Finally, the net counts were converted into fluxes using the inverse\nsensitivity keyword PHOTFLAM and the pivot wavelength keyword PHOTPLAM in the\nimage headers. After experimenting with slightly different aperture sizes for the source and\nbackground regions, and noting the differences in the count estimates, we conclude that the\nerrors in the optical flux estimations are typically ∼ 5% − 10% for the ACS measurement\nof 0106+013 and 3C 345, and between ∼ 5% − 20% for the STIS measurement of 3C 345.\nThe symbol sizes in Figures 9 - 10 can therefore be considered representative of the error\n4\n\nhttp://www.stecf.org/instruments/TinyTim/\n\n\f– 19 –\nbars in the optical flux estimates.\n\n3.3.\n\nVLA Data\n\nThe 1.6 and 4.9 GHz VLA A-array configuration data for 0106+013 and 3C 345 were\nobtained from the NRAO data archive (Table 2). Typically 10 min scans of the targets\nwere interspersed with 3−4 min scans of the phase calibrators (2.5 min scans of target\nwith 2 min scans of phase calibrator for the 1.6 GHz observations of 3C 345). The data\nreduction was carried out following standard calibration and reduction procedures in the\nAstronomical Image Processing System (AIPS). After the initial amplitude and phase\ncalibration, AIPS tasks CALIB and IMAGR were used iteratively to self-calibrate (Schwab\n1980) and image the sources. The jet component flux densities were obtained in AIPS using\nverbs TVWIN+IMSTAT, while the core estimates were derived using the Gaussian-fitting\ntask JMFIT. For the purpose of creating the broad-band SEDs, we created higher resolution\n1.6 GHz radio images of beam-sizes ∼ 0.′′ 7 (by fixing the BMAJ and BMIN parameters in\nIMAGR) to approximately match the resolution of the 4.9 GHz radio, the optical and X-ray\nimages, before estimating the flux densities. The flux estimates are listed in Table 4.\n\n4.\n4.1.\n\nResults\n\nImage Analysis: 0106+013\n\nThe one-sided kpc-scale jet in 0106+013 suggests that the jet is relativistic up to\nhundreds of kiloparsecs. The X-ray jet is nearly as long as the radio jet (Figure 1). It\nfollows the radio jet trajectory, which has a gentle S-shape, extremely well. The X-ray jet\nfirst brightens (and is the brightest) at the point where the kpc-scale radio jet first changes\ntrajectory and also becomes brighter. At the next radio bend, the X-ray jet emission is\n\n\f– 20 –\n\nFig. 4.- Surface brightness profiles of the radio jet at 4.9 GHz for 0106+013 (left panel) and\n3C 345 (right panel). The thin solid lines give the radio profiles along the position angle of the jets.\nThe dashed lines indicate the radio profile at a position angle of 90◦ counterclockwise from the jet\nto avoid any non-jet emission and counterjet emission. The solid, bold line indicates the difference\nbetween the two profiles so that core emission is removed and the effective flux can be measured.\nThe horizontal dot-dashed lines are set to a value five times the average noise level and the vertical\ndashed lines show the inner and outer radius limits.\n\n\f– 21 –\n\nFig. 5.- X-ray jet profiles for 0106+013 (left panel) and 3C 345 (right panel). These are represented as histograms of the counts in 0.′′ 2 bins. The solid lines give the profile along the position\nangle of the jet, as defined by the radio images. The dashed lines show the profile along the\ncounterjet direction, which is defined as 180◦ opposite to the jet.\n\n\f– 22 –\nTable 2. VLA A-Configuration Radio Observations\n\nSource\n\nObs\n\nFreq\n\nProject\n\nTOS\n\nBeam\n\nrms\n\nDate\n\n(GHz)\n\nID\n\n(min)\n\n(′′ × ′′ )\n\n(mJy beam−1 )\n\n1989, Jan 07\n\n1.64\n\nAR197\n\n115\n\n1.25×1.14\n\n0.2\n\n1989, Jan 07\n\n4.86\n\nAR197\n\n108\n\n0.43×0.38\n\n0.1\n\n1641+399 1984, Dec 23\n\n1.55\n\nAB310\n\n12\n\n1.36×1.25\n\n0.8\n\n1989, Jan 08\n\n4.86\n\nAR196\n\n190\n\n0.36×0.35\n\n0.25\n\n0106+013\n\nNote. - Cols. 2, 3 & 4: Observing date, frequency and project IDs. Col. 5: Time on\nsource. Col. 6: Restoring beam-size. Col. 7: Final rms noise in the radio images.\n\n0106+013\n\nCounterjet\n\n1\n\nVLBI jet\n\n2\n3\n\nBrightest\nX−ray\n\n1641+399\nRadio hot spot #2\n\n0.2\"\n\n4\n\nRadio & optical\nhot spot #1\nX−ray hot spot\n\n0.4\"\n\nX−ray & optical hot spot\nRadio & optical hot spot\n\nCounterjet\n\nVLBI jet\n\nFig. 6.- Schematics showing the kpc-scale jets in 0106+013 (left panel) and 3C 345 (right panel).\n\n\f– 23 –\nconcentrated closer to one (outer) edge of the jet. The X-ray emission brightens once again\njust before the radio hot spot, and terminates before the radio hot spot. The surface\nbrightness profiles of the radio and X-ray jets are displayed in Figures 4 and 5. From these\nit is clear that the radio and X-ray peaks are offset by about 0.′′ 4 (∼ 3.4 kpc) in 0106+013.\nIf the angle between the kpc-scale radio jet and line of sight is ∼ 5◦ (cf. Section\n4.4), then the deprojected jet length of 0106+013 is 38 kpc/sin(5◦ ) = 436 kpc. As the\nparsec-scale jet has a position angle of 238◦ , this implies an apparent pc-to-kpc-scale jet\nmisalignment angle of ∼ 54◦ (Kharb et al. 2010). If the parsec-scale jet bends only once\nbefore 12 kpc or so (corresponding to the Chandra PSF of ∼ 1.′′ 5) before aligning with\nthe kpc-scale jet, then the radio jet has about four bends before it terminates at the hot\nspot. Figure 6 presents a schematic of the jet structure. The fact that the brightest X-ray\nemission is from bend#3 is consistent with the idea that the Doppler factor is larger here\nas the jet inclination is smaller (i.e., the jet moves closer to our line of sight here). The\njet plasma could therefore be following a helical path around the surface of a cone with a\nconstant opening angle, the projected version of which is seen in Figures 1 - 6. Two optical\nknots close to the jet terminal point are clearly detected in the HST image of 0106+013\n(Figure 3). The knot closer to the core is coincident with the terminal point of the X-ray\njet, while the knot further downstream is coincident with the radio hot spot.\n\n4.2.\n\nImage Analysis: 3C 345\n\nIf the angle between the kpc-scale radio jet in 3C 345 and the line of sight is ∼ 5◦ (cf.\nSection 4.4), then the de-projected jet length is 25 kpc/sin(5◦ ) = 287 kpc. The Chandra\nimage of 3C 345 reveals a short X-ray jet with a hot spot. The termination peak of the\nX-ray jet lies upstream of the radio hot spot (Figure 3). From the surface brightness profiles\nof the radio and X-ray jets displayed in Figures 4 and 5, it is clear that the radio and X-ray\n\n\f– 24 –\npeaks are offset by about 0.2′′ (∼ 1.3 kpc) in 3C 345.\nThe HST image of 3C 345 image shows that the optical hot spot is not compact but\narc-like and extended, transverse to the jet direction (Figure 3). The 4.9 GHz radio image\nalso reveals a fainter, more compact hot spot further downstream from this optical hot spot.\nIt appears as if the jet changed direction in this source by the angular extent of the optical\n\"hot spot\" (see Figure 6 for a schematic). This could be considered as being consistent\nwith the suggestion that this source contains a binary black hole (e.g., Lobanov & Roland\n2005), which could give rise to jet re-alignment on short timescales. The enhanced radio\nand optical emission from this jet bend could arise because the jet aligns closer to our line\nof sight in this section. There is no optical or X-ray emission in the region of the weak radio\nextension downstream of the bright hot spot.\n\n4.3.\n\nX-ray Spectral Analysis: 0106+013 & 3C 345\n\nThe core and jet/hot spot emission for both 0106+013 and 3C 345 were fitted with a\npowerlaw model with photoelectric absorption (XSPEC model = phabs(powerlaw)), where\nwe allowed the hydrogen column density (NH ) to first, be freely variable, and second,\nto be frozen to the Galactic NH value. We found that the best-fit NH values were not\nwell constrained for the jet or hot spot components of either 0106+013 or 3C 345. We\ntherefore regard the estimates obtained with NH fixed to the Galactic value as more\nrobust. The small number of X-ray counts (typically <100) precluded an analysis with\nmore sophisticated spectral models. The results of the spectral model-fitting, along with\nthe error estimates at the 90% confidence level, are presented in Table 3, while the best-fit\ncore and jet models along with the residuals are displayed in Figures 7 to 8. The best-fit\njet models have the NH value frozen to the Galactic value toward the source direction. The\n1 keV flux estimates are listed in Table 4.\n\n\fTable 3. Spectral Analysis Results\nSource\n\nComponent\n\nConstraint\n\nNH (Error)\n\nΓ (Error)\n\n(×1022 cm−2 )\n\n0106+013\n\nCore (bin=50)\nJet 1 (bin=20)\n\nJet 2 (bin=15)\n\nJet 3 (bin=15)\n1641+399\n\nNH free\n\n3.6E−02 (−0.014, 0.012)\n\nFx (Error)\n\nχ2 /d.o.f.\n\n(×10−14 erg cm−2 s−1 )\n\n1.6 (−0.09, 0.04)\n\n125 (−3, 2)\n\n166.42/149\n\nNH free\n\n1.6E−05 (−2.1E−06, 0.093)\n\n1.7 (−0.28, 0.43)\n\n2.9 (−0.1, 0.4)\n\n6.47/8\n\nNH frozen\n\n0.028\n\n1.8 (−0.30, 0.32)\n\n2.9 (−0.2, 0.2)\n\n7.00/9\n\nNH free\n\n2.2E−13 (−8.8E−14, 0.31)\n\n2.1 (−0.49, 0.81)\n\n1.2 (−0.1, 0.5)\n\n4.37/3\n\nNH frozen\n\n0.028\n\n2.1 (−0.50, 0.63)\n\n1.2 (−0.1, 0.1)\n\n4.55/4\n\nNH frozen\n\n0.028\n\n1.9 (−0.62, 0.78)\n\n1.1 (−0.1, 0.1)\n\n4.58/3\n\nNH free\n\n3.0E−02 (−0.007, 0.005)\n\n1.8 (−0.05, 0.05)\n\n384 (−5, 10)\n\n338.19/329\n\nNH free\n\n0.14 (−0.14, 0.23)\n\n2.1 (−0.60, 0.93)\n\n2.5 (−0.5, 1)\n\n7.58/8\n\nNH frozen\n\n0.0104\n\n1.8 (−0.30, 0.33)\n\n2.2 (−0.1, 0.1)\n\n8.75/9\n\n(bin=20)\n\nNote. - Results from fitting an absorbed powerlaw (XSPEC model = phabs(powerlaw)) to the X-ray data. For some fits, NH was\nfrozen to the Galactic value which is 2.8×1020 cm−2 toward 0106+013 and 1.04×1020 cm−2 toward 3C 345. Col. 2: Source components (see\nFigure 2). Cols. 4 and 5: Best-fit hydrogen column density and photon index, respectively, with errors quoted at the 90% confidence level.\nCol. 6: Unabsorbed 0.5−7.0 keV flux density with errors. These errors were derived from the 90% confidence level errors in the \"norm\"\nparameter derived in the model-fits. Col. 7: χ2 by degrees of freedom.\n\n– 25 –\n\nCore (bin=50)\nJet\n\n\f– 26 –\n\nJet_1 Spectrum: 0106+013\n\nnormalized counts s−1 keV−1\n\nnormalized counts s−1 keV−1\n\nCore Spectrum: 0106+013\n\n0.1\n\n0.05\n\n3×10−3\n\n2×10−3\n\n10−3\n\n0\n10−3\nresiduals\n\nresiduals\n\n0\n0.02\n0\n\n5×10−4\n0\n\n−0.02\n1\n\n2\nEnergy (keV)\n\n5\n\n1\n\nJet_2 Spectrum: 0106+013\n\n2\nEnergy (keV)\nJet_3 Spectrum: 0106+013\n\nnormalized counts s−1 keV−1\n\nnormalized counts s−1 keV−1\n\n1.5×10−3\n\n10−3\n\n5×10−4\n\n1.5×10−3\n\n10−3\n\n5×10−4\n\n0\nresiduals\n\nresiduals\n\n0\n2×10−4\n0\n\n−4\n\n5×10\n\n0\n\n−2×10−4\n1\n\n2\n\n5\nEnergy (keV)\n\n1\n\n2\nEnergy (keV)\n\nFig. 7.- Spectral analysis results for an absorbed powerlaw model for the core (top left), \"jet 1\"\n(top right), \"jet 2\" (bottom left) and \"jet 3\" component (bottom right) of 0106+013. The residuals\nof the model-fit are displayed at the bottom of each panel. The red and black data denote the two\nindividual exposures, which were fit simultaneously.\n\n\f– 27 –\n\nTable 4. Flux Estimates from the Multiwavelength Data\n\nSource\n\nComp\n\nSr1.6\n\nSr4.9\n\nSo4747\n\nSo5850\n\nSx1 keV\n\n0106+013\n\nCore\n\n5.2E−14\n\n1.2E−13\n\n...\n\n7.4E−13\n\n6.8E−15\n\nJet 1\n\n3.7E−16\n\n3.8E−16\n\n...\n\n2.0E−16\n\n1.9E−16\n\nJet 2\n\n6.4E−16\n\n6.5E−16\n\n...\n\n2.4E−16\n\n9.9E−17\n\nJet 3\n\n4.9E−15\n\n4.8E−15\n\n...\n\n1.5E−16\n\n7.5E−17\n\nCore\n\n1.2E−13\n\n4.1E−13\n\n3.7E−12 1.5E−12\n\n2.2E−14\n\nJet\n\n6.0E−15\n\n8.9E−15\n\n2.0E−15 2.0E−15\n\n1.4E−16\n\n1641+399\n\nNote. - Cols. 1 & 2: Source names and components, respectively (see Figure 2). Cols. 3 to 7: Flux estimates in ergs cm−2 sec−1 at 1.6 GHz (VLA), 4.9\nGHz (VLA), 4747 Å (HST/ACS), 5850 Å (HST/STIS), and 1 keV (Chandra),\nrespectively.\n\n\f– 28 –\n4.4.\n\nSpectral Energy Distributions and Modeling\n\nWe constructed broad-band (radio-optical-X-ray) SEDs for the core and jet components\nof the two sources, and tried model-fitting with the synchrotron, IC and SSC emission\nmodels, using the modified SED code of Xue et al. (2008). The original SED code5 from\nKrawczynski et al. (2004) was modified by Xue et al., to include IC scattering off CMB\nphotons. A single powerlaw was assumed for the electron population. The broad-band SED\nmodel-fitting results for the core and jet components of 0106+013 and 3C 345 are tabulated\nin Table 5, and displayed in Figures 9 to 10. For the creation of the 3C 345 jet/hot spot\nSED, the small (∼ 0.′′ 2) offset between the radio, optical and X-ray peak emission, was\nignored. The errors associated with fitting the electron powerlaw indices are of the order of\n0.05. Similarly, the errors in fitting γmin and γmax values are of the order of 10 to 15, and\n1E+5 to 1.5E+5, respectively. The Doppler factors are constrained by the X-ray bow-tie\nslopes to within a few. In turn, the magnetic field strengths are restricted to within a few\nto few tens of μG.\nThe SED modeling primarily suggests that the optical emission has a synchrotron\norigin in both the jets, while the X-ray emission is primarily from the IC/CMB mechanism\nthroughout. We note that even though the X-ray data lies roughly along or below the\nextrapolation of the radio-optical slope in the Sν vs. ν plots in all instances, the X-ray\nslopes (as represented by the bow-ties in Figures 9 − 10), preclude the synchrotron model\nas the primary emission mechanism for the X-rays. The SSC model component is also\nplotted in the SED model-fits. In all cases, the SSC model predictions lie well below the\nobserved data. We discuss the implications of the best-fit parameters in Section 6.\n5\n\nhttp://jelley.wustl.edu/multiwave/spectrum/download.htm\n\n\f– 29 –\n\nTable 5. SED best fit parameters\n\nSource\n\n0106+013\n\n1641+399\n\nFeature\n\nFitted Parameters\n\nCore\n\nδ = 11, B = 60 μG,\n\nγmin = 4,\n\nγmax = 2E+5, n = 1.63\n\nJet 1\n\nδ = 3, B = 54 μG,\n\nγmin = 125, γmax = 1E+6, n = 2.95\n\nJet 2\n\nδ = 3, B = 53 μG,\n\nγmin = 175, γmax = 7E+5, n = 2.95\n\nJet 3\n\nδ = 3, B = 140 μG, γmin = 211, γmax = 3E+5, n = 3.00\n\nCore\n\nδ = 45, B = 7 μG,\n\nγmin = 1,\n\nγmax = 2E+5, n = 1.10\n\nJet\n\nδ = 5, B = 75 μG,\n\nγmin = 3,\n\nγmax = 2E+5, n = 2.20\n\nNote. - δ = Doppler factor, B = magnetic field strength, γmin , γmax = minimum\nand maximum electron Lorentz factors, respectively, n = electron powerlaw index. The\nradius of the emission volumes was 2.5E+22 cm and 2.0E+22 cm for 0106+013 and\n1641+399, respectively. The CMB photon energy density was assumed to be 3.7E−11\nerg cm−3 for 0106+013, and 2.6E−12 erg cm−3 for 1641+399. The errors in the fitted\nparameters are discussed in Section 4.4.\n\n\f– 30 –\n5.\n\nConstraints on Jet Speed and Inclination from Pc- and Kpc-scale Data\nHogan et al. (2011) found that the extended radio flux densities were closely correlated\n\nwith the detection rate of the X-ray jets in the MCS: the jet detection was 100% for jets\nwith 1.4 GHz extended flux density >300 mJy, but only ∼ 60% for jets below this value.\nAs Kharb et al. (2010) have reported a significant trend between the parsec-scale apparent\njet speeds and the extended radio luminosity in MOJAVE blazars, it was suggested by\nHogan et al. that there could be a link between the X-ray jet detection and jet speed.\nThis suggestion is fully consistent with the expectations of the IC/CMB beaming model,\nsince faster jets would have an increased CMB photon density (by a factor Γ2jet ) in the\njet rest-frame. Therefore, through the use of the parsec-scale apparent jet speed data, a\nconnection to the kpc-scale X-ray emission was indicated from the Chandra pilot study.\nFurthermore, model-dependent constraints on the jet inclination and Lorentz factors were\nderived by Hogan et al. (2011), using parsec and kpc-scale radio and X-ray data. Following\nthe same approach, we present below the results from our newer, more sensitive data.\nAssuming that the jet speed, β (≡ v/c), and jet inclination, μ (= cos θ), remains\nconstant going from parsec to kiloparsec scales, the jet speed can be expressed as a function\nof the parsec-scale apparent jet speed, βapp , and the angle to the line of sight, θ, as,\nβ=\n\nβapp\np\n.\nβapp μ + 1 − μ2\n\n(1)\n\nMarshall et al. (2005) defined the K parameter as a combination of the magnetic field\nstrength and the ratio of the observed X-ray (assumed to be inverse Compton) to radio\n(synchrotron) luminosities of the kpc jets through the relation,\nK = Beq (aR)1/(αr +1) (1 + z)−(αr +3)/(αr +1) b(1−αr )/(αr +1)\n\n(2)\n\nwhere a = 9.947 × 1010 G−2 , b = 3.808 × 104 G (e.g., Harris & Krawczynski 2002) and αr\nis the radio spectral index (= 0.8). The a and b parameters were found by equating the\n\n\f– 31 –\nexpected and observed values of the ratio of X-ray to radio energy densities, R (see Table\n1), under the equipartition assumption. For a jet with Lorentz factor Γjet > 1.5, K can be\ndefined as a function of jet speed and inclination angle as,\nK=\n\n1 − β + μ − βμ\n.\n(1 − βμ)2\n\n(3)\n\nThe relationship between the K parameter and the jet speed β can thus be explored\nfor any given source. Such an attempt has been made in Figure 11 for the two quasars.\nThe black curve (parsec scale) is defined by equation 1, while the blue curve (kpc scale) is\ndefined by equation 3. The intersection of the blue dashed and black solid curves in Figure\n11 provides a single (μ, Γjet) pair that satisfies equations 1 and 3.\nIf we relax the assumption of constant Lorentz factor and allow for the possibility\nof deceleration between parsec and kpc scales, then the kpc-scale bulk Lorentz factor\nis given by the intersection of the red dashed line with the tail of the blue K curve at\nlow Γjet . The cyan shaded region represents the possible range of jet inclination angles\nif the jet decelerates from parsec to kpc scales, but does not bend. We note that the\nobserved K values indicate upper limits of ∼ 13◦ on the jet inclination angle for the two\nquasars, irrespective of any assumptions about bending or deceleration. The errors in the\nK parameter (in Table 1 and Figure 11) have been estimated using a Monte Carlo error\nanalysis approach described by Hogan et al. (2011).\nThis method can yield large or even extreme Γjet values in some jets. 0106+013 is\nspecifically one of the jets in the MCS which has a large bulk Lorentz factor when examined\nin this way (Γjet ∼ 70). 3C 345 has a Γjet value of ∼40, which places it in the uppermost\nrange of observed speeds for the bright radio blazar population (Lister et al. 2009b),\nalthough still not as high as 0106+013. If we relax the assumption of constant Γjet between\nparsec and kiloparsec scales, then the best fit value of the kpc-scale Γjet becomes ∼ 2.5. It\nis likely that both jet deceleration and jet bending may need to be invoked in these jets for\n\n\f– 32 –\na more realistic picture (see Hogan et al. 2011).\n\n6.\n\nSummary and Discussion\n6.1.\n\nPKS B0106+013\n\nThe one-sided kiloparsec jet of 0106+013 displays distinct jet bends, which appear to\nincrease in amplitude further along the jet. There is a distinct lack of radio lobes in this\nsource. Instead, the radio jet morphology resembles that of a \"nose-cone\" (e.g., Clarke et al.\n1986). Magnetized plasma appears to move forward through the terminal shocks in the\njets, rather than backward like in radio lobes (e.g., Komissarov 1999). The X-ray emission\nfollows the one-sided radio jet closely. There is no X-ray emission from the counterjet\ndirection. X-ray emission peaks at the site of the first prominent jet bend on kpc scales\n(bend #3 in Figure 6). The jet could be pointing closer to our line of sight at the position\nof this bend, which could be making both the radio and the X-ray emission brighter due to\nDoppler boosting. As there is no optical counterpart to the radio and X-ray peak emission\nat this jet bend, the X-ray emission is likely to be from the IC/CMB mechanism. If the jet\nbend was due to jet-medium interaction, deceleration in the jet flow should have occurred,\nwhich would have in turn decreased the X-ray intensity after the bend, instead of increasing\nit, as is observed. Therefore, we favor the picture of a kpc-scale jet with a ridge line that\nwraps around the surface of a cone, following a helical path.\nAround the second prominent jet bend (bend #4 in Figure 6), the X-ray emission\nbecomes more prominent at the outer edge of the radio jet. This \"edge-brightening\" could be\na result of particle acceleration in a \"sheath\", as proposed by Stawarz & Ostrowski (2002).\nIt could also imply that the electrons in a slower moving sheath upscatter relativistically\nboosted photons from the faster-moving jet spine (Ghisellini et al. 2005). As this portion\n\n\f– 33 –\nof the jet is expected to be moving away from our line of sight in the helical jet picture, it\ncould explain why the spine emission fails to dominate in the X-ray emission here. After the\nsecond jet bend, however, the bulk of the X-ray emission shifts to the central regions of the\nradio jet, as if arising in the jet \"spine\". Finally, the X-ray jet terminates about 0.′′ 4 (∼ 3.4\nkpc) upstream of the radio hot spot. The X-ray termination peak could be indicative of the\nonset of bulk deceleration in the kpc scale jets. As the jet Lorentz factor decreases further\ndownstream, the X-ray emission, which has an inverse Compton origin (as indicated by the\nX-ray slopes in the multiwaveband SEDs in Figure 9), decreases due to the decrease in the\nrelativistically boosted CMB photons seen in the rest frame of the jet.\nThe HST image of 0106+013 source shows two clear jet knots close to its terminal point\n- one of them corresponds to the termination point of the X-ray jet, while the second one is\ncoincident with the radio hot spot. The optical counterpart of the X-ray termination point\nhas a synchrotron origin (see Figure 9). We expect that the shocks that are associated with\nthe bulk deceleration sites and the radio hot spots are likely to reaccelerate and re-energize\nparticles that give rise to optical synchrotron emission. The presence of the two discrete\noptical hot spots suggests that the shocked regions are highly localized.\n\n6.2.\n\n3C 345\n\nThe kpc-scale radio image of 1641+399 or 3C 345 exhibits a bright core and hot spots\nalong the jet and counterjet direction, with the hot spot-core-counter-hot spot forming a\nV-shape (Cooper et al. 2007). The X-ray jet of 3C 345 follows the short projected radio jet\nup until its bright \"hot spot\" (hot spot #1 in Figure 6). There is no X-ray emission from\nthe counterjet direction. The X-ray jet termination peak is found upstream of the radio hot\nspot by around 0.′′ 2 (∼1.3 kpc). While the radio jet continues after this hot spot, the X-ray\njet does not. HST optical emission is seen in an arc-like structure, well coincident with\n\n\f– 34 –\nthe bright radio hot spot. We propose that this feature is a sharp jet bend rather than a\ntermination peak. A weak radio hot spot (hot spot#2 in Figure 6) is indeed observed less\nthan 1′′ downstream of the bright radio hot spot, but does not have an optical or X-ray\ncounterpart. It is likely that the optical and radio emission is enhanced in the sharp jet\nbend as it approaches closer to our line of sight. On the other hand, the sharp jet bend\ncould reflect rapid jet deflection in this binary black hole candidate.\n\n6.3.\n\nConstraints on Jet Speed & Inclination Angle\n\nUsing the parsec-scale radio and kpc-scale radio-X-ray data, we have derived constraints\non the jet inclination angles and bulk Lorentz factors for the two quasars. Assuming a\nconstant jet speed from parsec to kpc scales, a Γjet of ∼70 is derived for 0106+013, and\n∼40 for 3C 345. On relaxing this assumption, the best fit value of the kpc-scale Lorentz\nfactor becomes ∼2.5. Upper limits of ∼ 13◦ on the jet inclination angle are obtained for the\ntwo quasars, irrespective of any assumptions about jet bending or deceleration. It is likely\nthat both jet deceleration and jet bending may need to be invoked in these jets for a more\nrealistic picture (Hogan et al. 2011).\n\n6.4.\n\nRadio-X-ray Offsets\n\nAs the X-ray terminal peak emission is likely to be coincident with sites of bulk jet\ndeceleration, the offsets between the X-ray terminal emission and the radio hot spots of a\nfew kiloparsecs as observed in 0106+013 and 3C 345, suggest that the radio hot spot is not\nthe primary site of bulk jet deceleration in these jets (e.g., Hardcastle et al. 2007). This\nsuggestion gives credence to the idea that jet instabilities rather than jet interaction with\nthe surrounding medium are the primary cause of the bulk jet deceleration. Offsets between\n\n\f– 35 –\nthe X-ray and radio hot spots have been observed in several jets. For example, in the\njets of quasars 4C 74.26 (Erlund et al. 2007), PKS 1055+201 (Schwartz et al. 2006), PKS\n2101−490 (Godfrey et al., 2011, ApJ, submitted), and in the jets of radio galaxies 3C 390.3,\n3C 227 (Hardcastle et al. 2007), 3C 353 (Kataoka et al. 2008) and 3C 445 (Perlman et al.\n2010).\n\n6.5.\n\nSED Modeling Trends\n\nBroad-band spectral energy distribution modeling of individual core/jet components\nin both 0106+013 and 3C 345, suggests that the optical emission is from the synchrotron\nmechanism, while the X-rays are produced via the inverse Compton mechanism from\nrelativistically boosted cosmic microwave background seed photons. We see from the\nbest-fit parameters in Table 5, that there is a trend of increased magnetic field strength\nat the jet termination regions compared to the cores, for both the sources. This could be\nindicative of shocked regions that locally enhance the magnetic field strengths, as well as\nreaccelerate particles, close to the jet termination points. There is also a trend of a steeper\nelectron powerlaw index in the jet regions as compared to the cores. While the γmax values\ndo not show a clear trend between the various core/jet components, the γmin values seem\nto increase downstream. Overall, these results are consistent with shocks amplifying the\nmagnetic fields and reaccelerating charged particles toward the terminal regions of the\njets. In highly magnetized jets, these \"shocks\" could be sites of magnetic field dissipation\ninstead, and could also reaccelerate charged particles.\n\n\f– 36 –\n6.6.\n\nThe Case for Magnetized Jets\n\nNakamura et al. (2007) have suggested that the wiggling structures in AGN jets could\nbe a result of current-driven instabilities in highly magnetized jets. These instabilities are\nalso capable of accelerating particles to high enough energies to emit X-ray and gamma ray\nphotons (e.g., Lyutikov 2003). However, it has also been suggested that jets are likely to\nbe Poynting flux dominated close to the jet launching sites, on scales of less than a parsec,\nbut become particle dominated on kiloparsec scales (e.g., Sikora et al. 2005). Whether\nAGN jets are highly magnetized or particle-dominated, and if/where in the jet such a\ntransition occurs, is a highly contentious issue. TeV gamma ray flux variability has both\nbeen explained by particle-dominated jets via broadband SED modeling (e.g., in the blazar\nMrk 421, Acciari 2011), and by the \"jet-in-jet\" model inside Poynting flux dominated jets\n(e.g., Giannios et al. 2009; Lyutikov & Lister 2010).\nEven so, it is intriguing to consider the idea of highly magnetized jets, as the role of the\nkpc-scale environment in influencing the jet power and structure seems to be undermined\nin our recent MOJAVE VLA study (Kharb et al. 2010). This was concluded primarily from\nthe presence of a strong correlation between the parsec-scale apparent jet speeds and the\nkpc-scale radio lobe emission, and the lack of a correlation between the parsec-to-kpc-scale\njet misalignment and redshift. Magnetically dominated jets are suggested to not be as\ninfluenced by interaction with the environment, compared to hydrodynamic jets (e.g.,\nLyutikov 2003). Moreover, there are indications of highly magnetized jets on scales of\nseveral parsecs, through observed rotation measure (RM) gradients transverse to the jets\n(e.g., Kharb et al. 2009; Croke et al. 2010, Hovatta et al., 2012, in prep.). Bimodal magnetic\nfield structures can be interpreted (although not a unique explanation; Kharb et al.\n(2008b)) as arising from helical/toroidal fields (e.g., Lyutikov et al. 2005; Kharb et al. 2005;\nPushkarev et al. 2005; Kharb et al. 2008a). Helical magnetic fields have also been inferred\n\n\f– 37 –\nthrough the presence of correlated asymmetries in total intensity and fractional polarization\nin transverse slices across parsec-scale jets (e.g., Clausen-Brown et al. 2011).\nAs noted earlier, the jet morphology in 0106+013 resembles a \"nose-cone\" from a\nhighly magnetized jet. This morphology is similar to that observed in the quasar 3C 273\n(Bahcall et al. 1995), which is another candidate for a \"nose-cone\" and a highly magnetized\njet (Clarke et al. 1986). 3C 273 also happens to exhibit the best case of an RM gradient\nacross its parsec-scale jet; RM gradients being a tell-tale signature of large scale helical\nmagnetic fields (Asada et al. 2002). The magnetized nature of the jet in 3C 345 has also\nbeen inferred, from jet acceleration on parsec-scales (Vlahakis & Königl 2004). In short,\nthe shocked jet regions upstream of the radio hot spots, the kpc-scale jet wiggles and\na \"nose-cone\" like radio jet in 0106+013, the V-shaped kpc-scale radio structure and\njet acceleration on parsec-scales in 3C 345, are all broadly consistent with instabilities\nassociated with Poynting flux dominated jets. A greater theoretical understanding and\nsensitive numerical simulations of jets spanning parsec- to kpc-scales are needed, however,\nto make direct quantitative comparsions. At the observational end, high frequency radio\nand optical polarimetry of radio jets that can clearly resolve the jets in the transverse\ndirection, and a search for robust Faraday rotation gradients and circular polarization,\nneeds to be carried out. The persistence of the handedness of circular polarization over\ntime could serve as a possible indicator of helical magnetic fields, in addition to being used\nas a diagnostic of plasma conditions and properties (e.g., Homan et al. 2009).\n\nWe thank the referee for making useful suggestions which have improved this paper.\nPK thanks R. Montez, E. Clausen-Brown, M. Lyutikov and M. Huarte Espinosa for\nenlightening discussions, W. Cui for sharing the SED modeling code, M. Aller for the\nUMRAO flux densities, and E. Perlman for suggestions on dealing with the PSF spike. BH\nthanks B. Zitzer for his error analysis contributions. Support for this work was provided\n\n\f– 38 –\nby the National Aeronautics and Space Administration (NASA) through Chandra Award\nNumber G09-0128X issued by the Chandra X-ray Observatory Center (CXC), which is\noperated by the Smithsonian Astrophysical Observatory (SAO) for and on behalf of NASA\nunder contract NAS8-03060. Support for Program number HST-GO-11831.04-A was\nprovided by NASA through a grant from the Space Telescope Science Institute, which is\noperated by the Association of Universities for Research in Astronomy, Incorporated, under\nNASA contract NAS5-26555. Support for this work was provided in part by NASA through\nthe SAO contract SV3-73016 to MIT for support of the CXC, which is operated by SAO\nfor and on behalf of NASA under contract NAS8-03060. The National Radio Astronomy\nObservatory is a facility of the National Science Foundation operated under cooperative\nagreement by Associated Universities, Inc.\nFacilities: VLA, HST (ACS), CXO (ACIS).\n\n\f– 39 –\n\nJet Spectrum: 1641+399\n\nnormalized counts s−1 keV−1\n\nnormalized counts s−1 keV−1\n\nCore Spectrum: 1641+399\n\n0.3\n\n0.2\n\n0.1\n\n0\n−0.05\n−0.1\n\n10−3\n\n0\nresiduals\n\nresiduals\n\n0\n0.05\n\n2×10−3\n\n5×10−4\n0\n−4\n\n−5×10\n1\n\n2\nEnergy (keV)\n\n5\n\n1\n\n2\nEnergy (keV)\n\n5\n\nFig. 8.- Spectral analysis results for an absorbed powerlaw model for the core (left panel) and\njet component/hot spot (right panel) of 3C 345. The residuals of the model-fit are displayed at the\nbottom of each panel. The red and black data denote the two individual exposures, which were fit\nsimultaneously.\n\n\f– 40 –\n\n0106+013: Core\n\n0106+013: Jet_1\nlog νFν (erg cm-2 s-1)\n\nlog νFν (erg cm-2 s-1)\n\n-8\n\n-12\n\n-16\n\n-14\n\n-16\n\n-18\n10\n\n15\n20\nlog ν (Hz)\n\n25\n\n10\n\n25\n\n0106+013: Jet_3\nlog νFν (erg cm-2 s-1)\n\nlog νFν (erg cm-2 s-1)\n\n0106+013: Jet_2\n\n15\n20\nlog ν (Hz)\n\n-14\n\n-16\n\n-18\n\n-14\n\n-16\n\n-18\n10\n\n15\n20\nlog ν (Hz)\n\n25\n\n10\n\n15\n20\nlog ν (Hz)\n\n25\n\nFig. 9.- Broad-band SED model-fits for the 0106+013 core (top left), \"jet 1\" (top right), \"jet 2\"\n(bottom left) and \"jet 3\" (bottom right). The solid line, dot-dashed and dashed lines represent the\nsynchrotron, IC and SSC models, respectively, while the data are represented by the open circle\nsymbols. The symbol sizes are indicative of the flux error estimates. The best-fit parameters are\nlisted in Table 5.\n\n\f– 41 –\n\n1641+399: Core\n\n1641+399: Jet\nlog νFν (erg cm-2 s-1)\n\nlog νFν (erg cm-2 s-1)\n\n-4\n-8\n-12\n-16\n5\n\n10\n\n15\n20\nlog ν (Hz)\n\n25\n\n-12\n\n-14\n\n-16\n\n5\n\n10\n\n15\n20\nlog ν (Hz)\n\n25\n\nFig. 10.- Broad-band SED model-fits for the 1641+399 core (left panel) and hot spot (right\npanel). The solid line, dot-dashed and dashed lines represent the synchrotron, IC and SSC models,\nrespectively, while the data are represented by open circles. The best-fit parameters are listed in\nTable 5.\n\nFig. 11.- Plot of viewing angle versus the bulk Lorentz factor of the jet. The black curve (parsec\nscale) is defined by equation 1, while the blue curve (kpc scale) is defined by equation 3 (cf. Section\n5). The intersection of the two curves indicates the Lorentz factor and viewing angle of the jet,\nin the case of no bending or deceleration between pc- and kpc-scales. The cyan shaded region\nrepresents the possible range of jet inclination angles if the jet decelerates from pc- to kpc-scales,\nbut does not bend.\n\n\f– 42 –\nREFERENCES\nAcciari, V. A. 2011, ApJ, 738, 25\nAngel, J. R. P., & Stockman, H. S. 1980, ARA&A, 18, 321\nAsada, K., Inoue, M., Uchida, Y., Kameno, S., Fujisawa, K., Iguchi, S., & Mutoh, M. 2002,\nPASJ, 54, L39\nBahcall, J. N., Kirhakos, S., Schneider, D. P., Davis, R. J., Muxlow, T. W. B., Garrington,\nS. T., Conway, R. G., & Unwin, S. C. 1995, ApJ, 452, L91\nBenford, G. 1978, MNRAS, 183, 29\nBridle, A. H., Hough, D. H., Lonsdale, C. J., Burns, J. O., & Laing, R. A. 1994, AJ, 108,\n766\nBurbidge, G. R. 1959, ApJ, 129, 849\nCelotti, A., Ghisellini, G., & Chiaberge, M. 2001, MNRAS, 321, L1\nClarke, D. A., Norman, M. L., & Burns, J. O. 1986, ApJ, 311, L63\nClausen-Brown, E., Lyutikov, M., & Kharb, P. 2011, MNRAS, 415, 2081\nCooper, N. J., Lister, M. L., & Kochanczyk, M. D. 2007, ApJS, 171, 376\nCroke, S. M., O'Sullivan, S. P., & Gabuzda, D. C. 2010, MNRAS, 402, 259\nDavis, J. E. 2001, ApJ, 562, 575\nErlund, M. C., Fabian, A. C., Blundell, K. M., Moss, C., & Ballantyne, D. R. 2007,\nMNRAS, 379, 498\n\n\f– 43 –\nFomalont, E. B., Frey, S., Paragi, Z., Gurvits, L. I., Scott, W. K., Taylor, A. R., Edwards,\nP. G., & Hirabayashi, H. 2000, ApJS, 131, 95\nGhisellini, G., Tavecchio, F., & Chiaberge, M. 2005, A&A, 432, 401\nGiannios, D., Uzdensky, D. A., & Begelman, M. C. 2009, MNRAS, 395, L29\nHardcastle, M. J., Birkinshaw, M., & Worrall, D. M. 2001, mnras, 323, L17\nHardcastle, M. J., Croston, J. H., & Kraft, R. P. 2007, ApJ, 669, 893\nHardcastle, M. J., Harris, D. E., Worrall, D. M., & Birkinshaw, M. 2004, ApJ, 612, 729\nHarris, D. E., & Krawczynski, H. 2002, ApJ, 565, 244\n-. 2006, ARA&A, 44, 463\nHarris, D. E., Leighly, K. M., & Leahy, J. P. 1998, ApJL, 499, L149\nHogan, B. S., Lister, M. L., Kharb, P., Marshall, H. L., & Cooper, N. J. 2011, ApJ, 730, 92\nHoman, D. C., Kadler, M., Kellermann, K. I., Kovalev, Y. Y., Lister, M. L., Ros, E.,\nSavolainen, T., & Zensus, J. A. 2009, ApJ, 706, 1253\nJester, S., Harris, D. E., Marshall, H. L., & Meisenheimer, K. 2006, ApJ, 648, 900\nKataoka, J., Stawarz, L., Harris, D. E., Siemiginowska, A., Ostrowski, M., Swain, M. R.,\nHardcastle, M. J., Goodger, J. L., Iwasawa, K., & Edwards, P. G. 2008, ApJ, 685,\n839\nKellermann, K. I., Lister, M. L., Homan, D. C., Vermeulen, R. C., Cohen, M. H., Ros, E.,\nKadler, M., Zensus, J. A., & Kovalev, Y. Y. 2004, ApJ, 609, 539\nKharb, P., Gabuzda, D., & Shastri, P. 2008a, MNRAS, 384, 230\n\n\f– 44 –\nKharb, P., Gabuzda, D. C., O'Dea, C. P., Shastri, P., & Baum, S. A. 2009, ApJ, 694, 1485\nKharb, P., Lister, M. L., & Cooper, N. J. 2010, ApJ, 710, 764\nKharb, P., Lister, M. L., & Shastri, P. 2008b, International Journal of Modern Physics D,\n17, 1545\nKharb, P., O'Dea, C. P., Baum, S. A., Daly, R. A., Mory, M. P., Donahue, M., & Guerra,\nE. J. 2008c, ApJS, 174, 74\nKharb, P., Shastri, P., & Gabuzda, D. C. 2005, ApJ, 632, L69\nKoekemoer, A. M., Fruchter, A. S., Hook, R. N., & Hack, W. 2002, in The 2002 HST\nCalibration Workshop : Hubble after the Installation of the ACS and the NICMOS\nCooling System, ed. S. Arribas, A. Koekemoer, & B. Whitmore, 337\nKomissarov, S. S. 1999, MNRAS, 308, 1069\nKrawczynski, H., Hughes, S. B., Horan, D., Aharonian, F., Aller, M. F., Aller, H., Boltwood,\nP., Buckley, J., Coppi, P., Fossati, G., Götting, N., Holder, J., Horns, D., Kurtanidze,\nO. M., Marscher, A. P., Nikolashvili, M., Remillard, R. A., Sadun, A., & Schröder,\nM. 2004, ApJ, 601, 151\nLister, M. L., Aller, H. D., Aller, M. F., Cohen, M. H., Homan, D. C., Kadler, M.,\nKellermann, K. I., Kovalev, Y. Y., Ros, E., Savolainen, T., Zensus, J. A., &\nVermeulen, R. C. 2009a, AJ, 137, 3718\nLister, M. L., Cohen, M. H., Homan, D. C., Kadler, M., Kellermann, K. I., Kovalev, Y. Y.,\nRos, E., Savolainen, T., & Zensus, J. A. 2009b, AJ, 138, 1874\nLister, M. L., & Homan, D. C. 2005, AJ, 130, 1389\nLobanov, A. P., & Roland, J. 2005, A&A, 431, 831\n\n\f– 45 –\nLyutikov, M. 2003, New A Rev., 47, 513\nLyutikov, M., & Lister, M. 2010, ApJ, 722, 197\nLyutikov, M., Pariev, V. I., & Gabuzda, D. C. 2005, MNRAS, 360, 869\nMarshall, H. L., Gelbord, J. M., Schwartz, D. A., Murphy, D. W., Lovell, J. E. J., Worrall,\nD. M., Birkinshaw, M., Perlman, E. S., Godfrey, L., & Jauncey, D. L. 2011, ApJS,\n193, 15\nMarshall, H. L., Schwartz, D. A., Lovell, J. E. J., Murphy, D. W., Worrall, D. M.,\nBirkinshaw, M., Gelbord, J. M., Perlman, E. S., & Jauncey, D. L. 2005, ApJS, 156,\n13\nMassaro, F., Harris, D. E., Tremblay, G. R., Axon, D., Baum, S. A., Capetti, A., Chiaberge,\nM., Gilli, R., Giovannini, G., Grandi, P., Macchetto, F. D., O'Dea, C. P., Risaliti,\nG., & Sparks, W. 2010, ApJ, 714, 589\nMurphy, D. W., Browne, I. W. A., & Perley, R. A. 1993, MNRAS, 264, 298\nNakamura, M., Li, H., & Li, S. 2007, ApJ, 656, 721\nPerlman, E. S., Georganopoulos, M., May, E. M., & Kazanas, D. 2010, ApJ, 708, 1\nPushkarev, A. B., Gabuzda, D. C., Vetukhnovskaya, Y. N., & Yakimov, V. E. 2005,\nMNRAS, 356, 859\nRector, T. A., & Stocke, J. T. 2001, AJ, 122, 565\nSambruna, R. M., Donato, D., Tavecchio, F., Maraschi, L., Cheung, C. C., & Urry, C. M.\n2007, ApJ, 670, 74\nSambruna, R. M., Gambill, J. K., Maraschi, L., Tavecchio, F., Cerutti, R., Cheung, C. C.,\nUrry, C. M., & Chartas, G. 2004, ApJ, 608, 698\n\n\f– 46 –\nSchinzel, F. K., Lobanov, A. P., & Zensus, J. A. 2010, in Astronomical Society of the Pacific\nConference Series, Vol. 427, Astronomical Society of the Pacific Conference Series,\ned. L. Maraschi, G. Ghisellini, R. Della Ceca, & F. Tavecchio, 153\nSchwab, F. R. 1980, in Presented at the Society of Photo-Optical Instrumentation Engineers\n(SPIE) Conference, Vol. 231, Society of Photo-Optical Instrumentation Engineers\n(SPIE) Conference Series, ed. W. T. Rhodes, 18–25\nSchwartz, D. A., Marshall, H. L., Lovell, J. E. J., Murphy, D. W., Bicknell, G. V.,\nBirkinshaw, M., Gelbord, J. M., Georganopoulos, M., Godfrey, L., Jauncey, D. L.,\nJester, S., Perlman, E. S., & Worrall, D. M. 2006, ApJ, 647, L107\nSikora, M., Begelman, M. C., Madejski, G. M., & Lasota, J.-P. 2005, ApJ, 625, 72\nStawarz, L., & Ostrowski, M. 2002, ApJ, 578, 763\nStickel, M., Padovani, P., Urry, C. M., Fried, J. W., & Kuehr, H. 1991, ApJ, 374, 431\nStocke, J. T., Morris, S. L., Gioia, I. M., Maccacaro, T., Schild, R., Wolter, A., Fleming,\nT. A., & Henry, J. P. 1991, ApJS, 76, 813\nTavecchio, F., Maraschi, L., Sambruna, R. M., & Urry, C. M. 2000, ApJL, 544, L23\nVlahakis, N., & Königl, A. 2004, ApJ, 605, 656\nWardle, J. F. C., & Aaron, S. E. 1997, MNRAS, 286, 425\nXue, Y., Wu, X.-B., & Cui, W. 2008, MNRAS, 384, 440\n\nThis manuscript was prepared with the AAS LATEX macros v5.2.\n\n\f"}