{"id": "http://arxiv.org/abs/0807.1485v2", "guidislink": true, "updated": "2009-01-23T11:11:58Z", "updated_parsed": [2009, 1, 23, 11, 11, 58, 4, 23, 0], "published": "2008-07-09T16:20:02Z", "published_parsed": [2008, 7, 9, 16, 20, 2, 2, 191, 0], "title": "Superuniversality in phase-ordering disordered ferromagnets", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0807.1006%2C0807.0107%2C0807.5101%2C0807.2482%2C0807.0833%2C0807.3832%2C0807.4704%2C0807.0987%2C0807.3334%2C0807.5107%2C0807.1461%2C0807.5023%2C0807.3135%2C0807.2508%2C0807.2726%2C0807.3014%2C0807.2169%2C0807.4532%2C0807.1406%2C0807.2327%2C0807.4395%2C0807.0691%2C0807.0249%2C0807.3502%2C0807.1485%2C0807.5043%2C0807.3818%2C0807.3551%2C0807.5130%2C0807.0321%2C0807.1890%2C0807.4440%2C0807.3999%2C0807.3281%2C0807.1716%2C0807.2938%2C0807.0795%2C0807.2661%2C0807.0384%2C0807.0529%2C0807.3708%2C0807.4566%2C0807.2396%2C0807.5091%2C0807.0458%2C0807.2224%2C0807.4966%2C0807.1619%2C0807.4856%2C0807.2717%2C0807.4819%2C0807.2620%2C0807.0618%2C0807.3987%2C0807.0993%2C0807.5028%2C0807.4962%2C0807.3664%2C0807.2673%2C0807.1131%2C0807.5083%2C0807.4014%2C0807.0885%2C0807.4149%2C0807.5004%2C0807.0496%2C0807.0741%2C0807.3316%2C0807.0692%2C0807.1542%2C0807.3429%2C0807.4678%2C0807.3564%2C0807.3000%2C0807.0528%2C0807.3427%2C0807.2999%2C0807.2217%2C0807.0318%2C0807.2281%2C0807.3178%2C0807.3599%2C0807.1109%2C0807.2246%2C0807.3232%2C0807.1190%2C0807.0462%2C0807.3352%2C0807.2380%2C0807.1821%2C0807.3445%2C0807.2733%2C0807.0146%2C0807.4314%2C0807.2779%2C0807.1831%2C0807.3501%2C0807.4984%2C0807.0481%2C0807.1313%2C0807.3297&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Superuniversality in phase-ordering disordered ferromagnets"}, "summary": "The phase-ordering kinetics of the ferromagnetic two-dimensional Ising model\nwith uniform bond disorder is investigated by intensive Monte Carlo\nsimulations. Simple ageing behaviour is observed in the single-time correlator\nand the two-time responses and correlators. The dynamical exponent z and the\nautocorrelation exponent lambda_C only depend on the ratio eps/T, where eps\ndescribes the width of the distribution of the disorder, whereas a more\ncomplicated behaviour is found for the non-equilibrium exponent a of the\ntwo-time response as well as for the autoresponse exponent lambda_R. The\nscaling functions are observed to depend only on the dimensionless ratio eps/T.\nIf the length scales are measured in terms of the time-dependent domain size\nL(t), the form of the scaling functions is in general independent of both eps\nand T. Conditions limiting the validity of this `superuniversality' are\ndiscussed.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0807.1006%2C0807.0107%2C0807.5101%2C0807.2482%2C0807.0833%2C0807.3832%2C0807.4704%2C0807.0987%2C0807.3334%2C0807.5107%2C0807.1461%2C0807.5023%2C0807.3135%2C0807.2508%2C0807.2726%2C0807.3014%2C0807.2169%2C0807.4532%2C0807.1406%2C0807.2327%2C0807.4395%2C0807.0691%2C0807.0249%2C0807.3502%2C0807.1485%2C0807.5043%2C0807.3818%2C0807.3551%2C0807.5130%2C0807.0321%2C0807.1890%2C0807.4440%2C0807.3999%2C0807.3281%2C0807.1716%2C0807.2938%2C0807.0795%2C0807.2661%2C0807.0384%2C0807.0529%2C0807.3708%2C0807.4566%2C0807.2396%2C0807.5091%2C0807.0458%2C0807.2224%2C0807.4966%2C0807.1619%2C0807.4856%2C0807.2717%2C0807.4819%2C0807.2620%2C0807.0618%2C0807.3987%2C0807.0993%2C0807.5028%2C0807.4962%2C0807.3664%2C0807.2673%2C0807.1131%2C0807.5083%2C0807.4014%2C0807.0885%2C0807.4149%2C0807.5004%2C0807.0496%2C0807.0741%2C0807.3316%2C0807.0692%2C0807.1542%2C0807.3429%2C0807.4678%2C0807.3564%2C0807.3000%2C0807.0528%2C0807.3427%2C0807.2999%2C0807.2217%2C0807.0318%2C0807.2281%2C0807.3178%2C0807.3599%2C0807.1109%2C0807.2246%2C0807.3232%2C0807.1190%2C0807.0462%2C0807.3352%2C0807.2380%2C0807.1821%2C0807.3445%2C0807.2733%2C0807.0146%2C0807.4314%2C0807.2779%2C0807.1831%2C0807.3501%2C0807.4984%2C0807.0481%2C0807.1313%2C0807.3297&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "The phase-ordering kinetics of the ferromagnetic two-dimensional Ising model\nwith uniform bond disorder is investigated by intensive Monte Carlo\nsimulations. Simple ageing behaviour is observed in the single-time correlator\nand the two-time responses and correlators. The dynamical exponent z and the\nautocorrelation exponent lambda_C only depend on the ratio eps/T, where eps\ndescribes the width of the distribution of the disorder, whereas a more\ncomplicated behaviour is found for the non-equilibrium exponent a of the\ntwo-time response as well as for the autoresponse exponent lambda_R. The\nscaling functions are observed to depend only on the dimensionless ratio eps/T.\nIf the length scales are measured in terms of the time-dependent domain size\nL(t), the form of the scaling functions is in general independent of both eps\nand T. Conditions limiting the validity of this `superuniversality' are\ndiscussed."}, "authors": ["Malte Henkel", "Michel Pleimling"], "author_detail": {"name": "Michel Pleimling"}, "author": "Michel Pleimling", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1103/PhysRevB.78.224419", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/0807.1485v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0807.1485v2", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "Latex2e, 10pp with 8 figures included, PR macros", "arxiv_primary_category": {"term": "cond-mat.dis-nn", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cond-mat.dis-nn", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "cond-mat.stat-mech", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0807.1485v2", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0807.1485v2", "journal_reference": "Phys. Rev. B78, 224419 (2008)", "doi": "10.1103/PhysRevB.78.224419", "fulltext": "Superuniversality in phase-ordering disordered ferromagnets\nMalte Henkel1 and Michel Pleimling2\n\narXiv:0807.1485v2 [cond-mat.dis-nn] 23 Jan 2009\n\n1\n\nLaboratoire de Physique des Matériaux (LPM)∗ , Nancy Université, CNRS,\nB.P. 239, F – 54506 Vandoeuvre lès Nancy Cedex, France\n\n2\n\nDepartment of Physics, Virginia Polytechnic Institute and State University,\nBlacksburg, Virginia 24061-0435, USA\n(Dated: October 30, 2018)\n\nAbstract\nThe phase-ordering kinetics of the ferromagnetic two-dimensional Ising model with uniform bond\ndisorder is investigated by intensive Monte Carlo simulations. Simple ageing behaviour is observed\nin the single-time correlator and the two-time responses and correlators. The dynamical exponent\nz and the autocorrelation exponent λC only depend on the ratio ε/T , where ε describes the width\nof the distribution of the disorder, whereas a more complicated behaviour is found for the nonequilibrium exponent a of the two-time response as well as for the autoresponse exponent λR . The\nscaling functions are observed to depend only on the dimensionless ratio ε/T . If the length scales\nare measured in terms of the time-dependent domain size L(t), the form of the scaling functions is\nin general independent of both ε and T . Conditions limiting the validity of this 'superuniversality'\nare discussed.\nPACS numbers: 64.60.Ht,75.10.Nr, 05.70.Ln\n\n∗\n\nLaboratoire associé au CNRS UMR 7556\n\n1\n\n\fI.\n\nINTRODUCTION\n\nAging phenomena have become one of the paradigmatic examples which are used to study\nfundamental aspects of non-equilibrium criticality, besides their practical use in materials\nprocessing. If some physical system is brought rapidly out of equilibrium by a sudden\nchange of an external control parameter (an often-used device is to quench the system by\nlowering its temperature rapidly from the disordered high-temperature phase to its ordered\nlow-temperature phase where at least two thermodynamically stable states co-exist) one\noften finds simultaneously the following three properties: (i) slow (i.e. non-exponential)\ndynamics, (ii) breaking of time-translation invariance and (iii) dynamical scaling, which\ntogether are said to constitute ageing behaviour. These features were first observed together\nin the mechanical properties of many polymeric materials by Struik [1] and it has since\nbeen understood that the broad characteristics of ageing can be found in many different\ntypes of non-equilibrium systems. Besides spin glasses [2, 3], other well-studied examples\nmay be found in the phase-ordering kinetics of a ferromagnet quenched below its critical\ntemperature Tc > 0 [4] or in granular media [5].\nThe analysis of phase-ordering as it occurs in ferromagnets quenched from an initially\ndisordered state into its coexistence phase with temperature T < Tc is particularly simple\nto formulate. The motion of the domain walls is driven by the surface tension between the\nordered domains. The typical time-dependent length scale is related to the linear size of\nthese ordered domains which grows as L = L(t) ∼ t1/z where z is the dynamical exponent.\nFor a non-conserved order-parameter, it is well-known that z = 2 [4]. Because of the simple\nalgebraic scaling of the linear domain size L(t), one expects the following scaling behaviour\nfor the single-time correlation function\n−b\n\nC(t; r) := hφ(t, r)φ(t, 0)i = t F\n\n\u0012\n\n|r|\nL(t)\n\n\u0013\n\n(1)\n\nfor sufficiently large times t ≫ tmicro (with a microscopic reference time tmicro such that\nL(tmicro ) is of the order of the lattice constant). Similarly, for the two-time correlation and\nresponse functions (in the ageing regime, where the observation time t and the waiting time\n\n2\n\n\fs satisfy t, s ≫ tmicro and t − s ≫ tmicro ):\n\u0013\nt |r|\nC(t, s; r) := hφ(t, r)φ(s, 0)i = s FC\n,\n,\ns L(s)\n\u0012\n\u0013\nt |r|\nδhφ(t, r)i\n−1−a\n=s\nFR\n.\n,\nR(t, s; r) :=\nδh(s, 0) h=0\ns L(s)\n−b\n\n\u0012\n\n(2)\n(3)\n\nHere φ(t, r) is the space-time-dependent order-parameter, whereas h(s, r) is the conjugate\nmagnetic field (spatial translation-invariance of all averages will be assumed throughout this\npaper) and a and b are ageing exponents. The scaling functions FC,R (y, 0) ∼ y −λC,R /z for\ny → ∞ which defines the autocorrelation exponent λC and the autoresponse exponent λR .\nFor phase-ordering kinetics in pure systems, it is generally admitted that b = 0 and simple\nscaling arguments show that a = 1/z. For an initial high-temperature state and for pure\nferromagnets, λC = λR is independent of the known equilibrium exponents [2, 4, 6, 7, 8, 9,\n10]. The scenario just described is referred to as simple ageing. The conditions for the onset\nof ageing and the possible scaling forms have been carefully discussed in [11, 12].\nIn going from phase-ordering kinetics in simple ferromagnets to glassy systems (usually\nmodelled by spin systems with disorder and frustration), one expects more complicated\ngrowth laws L = L(t) which describe a cross-over from the domain growth of essentially pure\nsystems (as long as L(t) is small compared to the typical distance between disorder-created\ndefects) to a late-time regime with a slower growth and dominated by the defect structure.\nFor disordered ferromagnets without frustration, this can be studied through generalisations\nof the Allen-Cahn equation, which attempt to describe how the pinning of the domain walls\ncreated by the disorder should be overcome by thermal activation [13, 14]. In addition, it\nwas suggested that once the unique reference length scale is chosen to be L(t), the resulting\nscaling functions should become superuniversal in the sense that they should be independent\nof the disorder [15]. This superuniversality has indeed been confirmed for the single-time\nspin-spin correlator [16, 17, 18, 19, 20, 21]. Furthermore, superuniversality is in qualitative\nagreement with the experimental observation in several distinct polymers and metals that\nthe linear response to a small mechanical stress can be described in terms of an universal\nmaster curve which is independent of the material studied [1]. The universal scaling functions\nof the pure case can be calculated from the theory of local scale-invariance [22]. Tests in\nnon-integrable systems include the auto- and space-time-responses in the two- and threedimensional Ising models [23], the autocorrelation function in the two-dimensional Ising\n3\n\n\fmodel [24], the same quantities in the two-dimensional q-states Potts model with q = 2, 3, 8\n[25] as well as the autoresponse function in several other cases, see [26] for a recent review.\nTherefore, with the help of superuniversality, if confirmed, the scaling functions describing\nnon-equilibrium relaxation of quite complex systems would become analytically treatable.\nIn this work, we shall consider a two-dimensional ferromagnetic Ising model with\nquenched bond disorder. The nearest-neighbour Hamiltonian is given by [27, 28]\nH=−\n\nX\n\nJij σi σj ,\n\nσi = ±1 .\n\n(4)\n\n(i,j)\n\nThe random variables Jij are uniformly distributed over [1 − ε/2, 1 + ε/2] where 0 ≤ ε ≤ 2.\nThe model has a second-order phase transition at a critical temperature Tc (ε) > 0 between\na paramagnetic and a ferromagnetic state. It is thought that Tc (ε) ≈ Tc (0) ≃ 2.269 . . .\nshould not depend strongly on ε. Using heat-bath dynamics with a non-conserved orderparameter and starting from a fully disordered initial state, phase-ordering occurs and there\nis evidence which suggests that the characteristic length scale L = L(t) ∼ t1/z should scale\nalgebraically and where the dynamical exponent z = z(T, ε) should depend continuously on\nthe temperature and the disorder ε. Indeed, generalising the Huse-Henley heuristic argument\n[13] by considering the case when the disorder-created energy barriers for the motion of the\ndomain walls are distributed logarithmically with respect to the domain size L(t), the form\n[27, 29]\n?\n\nz = z(T, ǫ) = 2 + ǫ/T .\n\n(5)\n\nwas proposed, where the constant ǫ parametrises the barrier height. Simulations of the linear\ndomain size [27] seemed to confirm this, with the empirical identification ǫ = ε and are\nalso consistent with the results of field-theoretical studies in the Cardy-Ostlund model [30].\nRs\nData from the thermoremanent magnetisation MTRM (t, s) = h 0 du R(t, u) = s−a fM (t/s)\nwere used to estimate the exponent a and, assuming a = 1/z, also looked consistent with\n(5) and ǫ = ε, at least for values for T and ε for which z did not become too large [31].\nSuperuniversality has been confirmed recently for the hull enclosed area [32]. On the other\nhand, the conclusion of a simple ageing reached in [27, 28, 29] has been questioned by\nmore recent simulations for the random-site Ising model [33]. In that work, a scaling form\n\u0010 1−μ \u0011\nC(t, s) = Cst (t − s) + Cag (h(t − s)/h(s)) with h(u) = exp u1−μ was considered, where μ is\n\na fit parameter. In the limit μ → 1, one recovers the simple ageing scenario described above\n4\n\n\f(the stationary part Cst (t−s) merely represents an irrelevant correction to the leading scaling\nbehaviour). The case μ < 1 is called sub-ageing, and the case μ > 1 is called super-ageing.\nIn [33], systematic deviations from the dynamical scaling of simple ageing were observed in\nthe 2D random-site Ising model quenched to below Tc . A data collapse could be achieved,\nhowever, by allowing μ to vary and values in the range μ ≈ 1.03 − 1.04 were reported [33].\nThis finding was interpreted as to suggest the presence of a slight super-ageing effect [33].\nIn the following, we shall present new data on the single-time and two-time correlations\nas well as on two-time response functions. As we shall see in section II, our data are fully\ncompatible with the simple ageing scenario and furthermore, looking at a larger range of\nvalues of z, we find that the dynamical exponent z = z(T, ε) = z(ε/T ) depends on the\ncontrol parameters in a more complicated way than suggested in eq. (5). These conclusions\nare also valid for the two-time response function. The dependence of the various nonequilibrium exponents on both ε and T will be studied. We also show evidence that the\nscaling functions only depend on the ratio ε/T of the control parameters and finally confirm\nthe generic superuniversality of the scaling functions of correlation and response functions.\nHowever, we also find two conditions which must be satisfied for superuniversality to hold.\nOur conclusions are given in section III.\n\nII.\n\nRESULTS\n\nThe simulations are carried out as follows. For the integrated response we simulated\nsystems with N = 3002 spins using the standard heat-bath algorithm. Prepared in an\nuncorrelated initial state corresponding to infinite temperatures, the system is quenched to\nthe final temperature in the presence of a random binary field hi = ±h with strength h =\n0.05, following the well-established method of Barrat [34] (using a random field avoids a bias\nwhich would drive the system rapidly out of the scaling regime). Turning off the random field\nP\nafter a waiting time s, the thermoremanent magnetisation MTRM (t, s) = T1N i hσi (t)hi (s)i\nis measured at time t. We averaged over at least 5 * 104 different runs with different initial\n\nstates and different realizations of the noise. We point out that the data discussed in this\npaper are of much higher quality than our earlier data [31] for the autoresponse. For the\nautocorrelation function, we considered systems with up to 6002 spins in order to avoid the\n\n5\n\n\f0.0\n\n0.0\n\nln(C(t,s))\n\nln(C(t,s))\n\n-0.3\n\n-0.7\n\ns=100\ns=200\ns=400\ns=800\n\n-0.2\n\ns=100\ns=200\ns=400\ns=800\n\n-0.1\nln(C(t,s))\n\ns=100\ns=200\ns=400\ns=800\n\n0.0\n\n-0.2\n\n-0.4\n-1.0\n(a)\n\n-1.4\n\n0\n\n-0.3\n\n(b)\n\n1\n2\nln(t/s)\n\n3\n\n-0.6\n\n0\n\n1\n2\nln(t/s)\n\n3\n\n(c)\n\n0\n\n1\n2\nln(t/s)\n\n3\n\nFIG. 1: Scaling of the autocorrelation C(t, s) for (a) ε = 0.5, T = 1, (b) ε = 1, T = 0.4 and (c)\nε = 2, T = 0.4, for several values of s. Here and in the following error bars are smaller than the\nsizes of the symbols, unless explicitly stated otherwise.\n\nappearance of finite-size effects for the times accessed in the simulations. The data discussed\nin the following have been obtained after averaging over at least 5000 different runs with\ndifferent random numbers. Our main focus was on ε = 0.5, ε = 1, and ε = 2 where we\nconsidered for every case at least four different temperatures. In addition, some runs where\nalso done for other values of ε. The total study took approximately 2 * 105 CPU hours\non Virginia Tech's System X supercomputer composed of Dual 2.3 GHz PowerPC 970FX\nprocessors.\nOur first question is about the scaling form to be used. In figure 1, we show data\nP\nfor the autocorrelation C(t, s) = N −1 i hσi (t)σi (s)i, plotted over against t/s, for several\n\ntypical values of ε and T . A nice data collapse is seen, which is fully consistent with simple\n\nageing. Our scaling plots also imply that the exponent b = 0, analogously to what is\nfound in the phase-ordering of pure systems. In [33], a 'super-ageing' scaling form C(t, s) =\n\u0002\n1−μ\n1−μ \u0003\u0001\nwas considered for the random-site Ising model where the exponent\nC exp (t−s) 1−μ−s\nμ > 1 is fitted to the data. Simple ageing is recovered in the μ → 1 limit. However, the\nvalues of μ ≈ 1.03 reported in [33] are so close to unity that a careful study on possible\n6\n\n\f8\n0.4\n\n(a)\n6\n\n(b)\n\na\n\nz\n\n0.3\n0.2\n\n4\n\n0.1\n2\n0\n\n2\n\nε/T\n\n4\n\n0\n\n6\n\n0\n\n2\n\nε/T\n\n4\n\n6\n\n!\n\nFIG. 2: Left panel: Dynamical exponent z, determined from the condition C(t, L(t)) =\n\n1\n2,\n\nas a\n\nfunction of ε/T . The dashed line corresponds to the equation (5). Right panel: ageing exponent\na, as determined from the scaling of MTRM (t, s). In some cases we have more than one data point\nfor a given value of ε/T . These data points correspond to different values of ε and T with ε/T\nconstant, see table I, showing that a is not simply a function of the ratio ε/T but that it depends\nin a more complicated way on both ε and T .\n\nfinite-time corrections to scaling appears to be required before such a conclusion could be\naccepted [35]. For all ε < 2, our data for the random-bond model show no hint for a 'superageing' behaviour [37], in contrast to the findings in [33]. Note that the observed scaling\nform of simple ageing would be incompatible with a non-power-law form of L(t) in the range\nof times considered. We also remark that for ε = 2 and larger temperatures finite-time\ncorrections to simple ageing are observed, see [31, 36].\nHaving in this way checked that the relevant length scale L = L(t) should indeed scale\nalgebraically with time, we next determined the dynamical exponent z = z(T, ε) from the\ncriterion [32] involving the single-time correlator\n!\n\nC(t, L(t)) =\n\n1\n, L(t) ∼ t1/z(T,ε) .\n2\n\n(6)\n\nThe results for z are shown in figure 2 and listed in table I. First, we observe that the values\nof z obtained in fact only depend on the dimensionless ratio ε/T , to within our numerical\n7\n\n\fε\n\nT\n\nz\n\na\n\nλC /z\n\nλR /z\n\n0.5 1.5\n\n2.08(1)\n\n−\n\n0.59(1)\n\n0.5 1.0\n\n2.11(1)\n\n0.41(1)\n\n0.565(10)\n\n0.61(2)\n\n0.5 0.8\n\n2.16(1)\n\n0.41(1)\n\n0.56(1)\n\n0.61(3)\n\n0.5 0.6\n\n2.33(1)\n\n0.40(1)\n\n0.54(1)\n\n0.60(2)\n\n0.5 0.5\n\n2.46(1)\n\n0.36(1)\n\n0.48(1)\n\n0.55(2)\n\n0.5 0.4\n\n2.64(2)\n\n0.33(1)\n\n0.46(1)\n\n0.50(2)\n\n0.5 0.3\n\n3.02(2)\n\n0.29(1)\n\n0.385(10)\n\n0.46(2)\n\n1.0 1.0\n\n2.45(1)\n\n0.32(1)\n\n0.49(1)\n\n0.51(2)\n\n1.0 0.8\n\n2.65(2)\n\n0.31(1)\n\n0.445(10)\n\n0.50(2)\n\n1.0 0.6\n\n3.02(2)\n\n0.25(1)\n\n0.38(1)\n\n0.43(2)\n\n1.0 0.4\n\n3.85(3)\n\n0.17(1)\n\n0.29(1)\n\n0.34(1)\n\n1.5 0.9\n\n3.02(3)\n\n−\n\n0.375(10)\n\n−\n\n2.0 1.0\n\n3.39(3)\n\n0.10(1)\n\n0.315(10)\n\n0.35(2)\n\n2.0 0.8\n\n3.92(4)\n\n0.09(1)\n\n0.270(5)\n\n0.32(2)\n\n2.0 0.6\n\n4.97(4)\n\n0.075(10)\n\n0.217(3)\n\n0.28(1)\n\n2.0 0.5\n\n5.76(5)\n\n−\n\n0.189(3)\n\n−\n\n2.0 0.4\n\n7.22(6)\n\n0.05(1)\n\n0.155(3)\n\n0.21(1)\n\n−\n\nTABLE I: Dynamical exponent z, non-equilibrium response exponent a, the autocorrelation exponent λC /z and the autoresponse exponent λR /z for different values of ε and T .\n\naccuracy. Second, we see that the function z = z(ε/T ) is non-linear and only becomes an\napproximately linear function in a relatively small region of values of z. We are confident\nthat our results are more reliable than earlier ones since they do not just describe the scaling\nof a single quantity, but rather will be needed for the correct scaling description of several\nother observables, as we shall show below. We stress that only the values of z as given in\ntable I will lead to a good scaling according to simple ageing without having to consider\npossible corrections to scaling.\nIn the same way, in figure 3 we show data for the scaling of the thermoremanent mag-\n\n8\n\n\f-1.0\n\n-2.5\n(a)\n\n-3.0\n0\n\n1\n\n-2.0\n-2.5\n\n3\n\ns=50\ns=100\ns=200\ns=400\n\n-2.0\n\n-2.5\n\n-3.0\n\n(b)\n\n-3.0\n2\nln(t/s)\n\nMTRM(t,s)/h)\n\n-1.5\n\n0.09\n\nln(s\n\nln(s\n\n0.25\n\n-2.0\n\ns=50\ns=100\ns=200\ns=400\n\nln(s\n\n-1.5\n\nMTRM(t,s)/h)\n\ns=50\ns=100\ns=200\ns=400\n\n0.33\n\nMTRM(t,s)/h)\n\n-1.0\n\n-1.5\n\n0\n\n1\n\n2\nln(t/s)\n\n3\n\n(c)\n\n0\n\n1\n\n2\nln(t/s)\n\n3\n\nFIG. 3: Scaling of the thermoremanent magnetisation MTRM (t, s) for several values of s, with (a)\nε = 0.5, T = 0.4, (b) ε = 1, T = 0.6 and (c) ε = 2, T = 0.8.\n\nnetisation, expected to be of the form\nMTRM (t, s) = s−a fM (t/s) .\n\n(7)\n\nThe exponent a is obtained in the usual way [39] by plotting the thermoremanent magnetisation as a function of the waiting time s for fixed values of the ratio t/s. The resulting\npower-law decay, see eq. (7), then yields the value of the exponent a. The numerical values\nand error bars given in table I and shown in figure 2 are obtained after averaging over the\nvalues obtained for five different values of t/s, namely 3, 5, 7, 10, and 15. Looking at these\nvalues (see figure 2), we observe that the estimates a = a(T, ε) scatter considerably more\nthan those for z. We consider this scatter to be large enough to conclude that a cannot be\nreduced to a function of the single variable ε/T . Furthermore, considering in detail the numerical values from table I, we see that the relation a = 1/z, known from the phase-ordering\nof pure ferromagnets [2, 40, 41], is no longer valid.\nIn order to understand this finding, let us briefly reconsider how the relation a = 1/z may\nbe derived for pure ferromagnets. Consider a pure ferromagnet in an external oscillating\nmagnetic field of angular frequency ω. The dissipative part of the linear response is given\n\n9\n\n\fas the imaginary part of the dynamic susceptibility and reads (see e.g. [2])\nZ t\n\u0001\n′′\nχ (ω, t) =\ndu R(t, u) sin ω(t − u) = χ′′1 (ω) + t−a χ′′2 (ωt) + . . .\n\n(8)\n\n0\n\nwhere the last relation follows from the usually assumed scaling (3) of the autoresponse\nfunction R(t, s). On the other hand, motivated from the physical picture that the dynamics\nin phase-ordering should only come from the motion of the domain walls between the ordered\ndomains, one would expect to find [40]\nχ′′ (ω, t) = χ′′st (ω) + L(t)−1 χ′′age (ωt) + . . .\n\n(9)\n\nfrom which one may identify the stationary and the ageing part with the terms in eq. (8)\ncoming from the scaling analysis. Since only the domain boundaries contribute to the\ndynamics, the leading time-dependent part should be proportional to the surface area of\nthe domain divided by the total volume, hence to L(t)d−1 /L(t)d = 1/L(t) which accounts\nfor the factor 1/L(t) in (9). Comparison of eqs. (8,9), together with L(t) ∼ t1/z , then gives\na = 1/z.\nOur empirical observation that az < 1 suggests that the above argument should no longer\napply to random ferromagnets. Since (8) only depends on the dynamical scaling assumption\n(3), and given that our numerical results appear to be compatible with it, we expect that\n(8) should remain valid for disordered ferromagnets. Since also for disordered ferromagnets,\nthe contribution to the ageing behaviour should come from the boundary region between\nordered domains (this is also suggested by looking at the microscopic spin configurations,\nsee e.g. [36]), we expect it to be proportional to Nd (L)/Nb (L) where Nb,d (L) denote the\nnumber of mobile spins in the bulk and at the domain boundaries, respectively. While one\nshould still have Nb (L) ∼ Ld , disorder may cause the domain boundary to become fractal\nand, hence, Nd (L) ∼ Ldf with df the fractal dimension (and df = d − 1 for the pure case).\nThen eq. (9) would be replaced by\nχ′′ (ω, t) = χ′′st (ω) + L(t)−(d−df ) χ′′age (ωt) + . . .\n\n(10)\n\nand comparison with (8) would now imply\na=\n\nd − df\n.\nz\n\n(11)\n\nOur empirical results (table I) imply that df > d − 1, that is, the disorder should modify\nthe domain boundaries into fractal curves. From eq. (11), since a depends on the dynamical\n10\n\n\f1.0\n\n0.8\n\n0.6\n\ny=2\n\n0.4\n\n0.5\ny=6\n\n0.4\n\n0.075\n\n0.6\n\nC(t,s;r)\n\nC(t,r)\n\n0.8\n\ns=64\ns=125\ns=216\n\n0.7\n\n(a)\n\n0.0\n\n0 0.5 1 1.5 2\nr/L(t)\n\n0.2\n0.1\n\ns=100\ns=200\ns=400\n\n0.10\n\n0.05\n\ns\n\n0.3\n0.2\n\nMTRM(t,s;r)/h\n\nt=500\nt=1000\nt=2000\n\n0.15\n\n(b)\n\n(c)\n\n0 0.5 1 1.5 2\nr/L(s)\n\n0.00\n\n0 1 2 3 4 5\nr/L(s)\n\nFIG. 4: (a) Scaling behaviour of the single-time correlator C(t, r) for ε = 1 and T = 0.8 and several\nvalues of t, as a function of the scaling variable r/L(t). (b) Scaling of the space-time-dependent\ncorrelator C(t, s; r) for ε = 0.5 and T = 0.5 for several values of s and two fixed values of y = t/s, as\na function of the scaling variable r/L(s). (c) Scaling of the space-time-dependent thermoremanent\nmagnetisation MT RM (t, s; r) for ε = 2 and T = 0.6 for several values of s, with y = t/s = 5. The\nlines are guides to the eye.\n\nexponent z = z(ε/T ) as well as the fractal dimension df , it may appear more natural that a\ncannot be written as a function of the single variable ε/T .\nIn figure 4 we show the scaling behaviour of the space- and time-dependent correlation\nand response functions for various values of the waiting time s. For the selected typical\nvalues of ε and T , a simple ageing behaviour is observed, in agreement with the observed\nscaling behaviour of the autocorrelation and of the autoresponse. We have found completely\nanalogous results for all other values of ε and of T which we considered. In fact, the\nscaling is much cleaner than for the r = 0 quantities and for none of the studied cases\na sizeable correction to scaling could be identified. Obviously, space- and time-dependent\nquantities are much better suited for an investigation of the scaling forms than quantities\nthat only depend on time. Similar conclusions have recently been drawn from a study of\nnonequilibrium growth models [42].\n11\n\n\f1.0\n\n0.4\n\ns=100\ns=200\ns=400\ns=800\ns=100\ns=200\ns=400\ns=800\n\n0.9\n0.8\nC(t,s)\n\ny=2\n\n0.6\nC(t,s;r)\n\ns=64\ns=125\ns=216\ns=64\ns=125\ns=216\n\ny=6\n\n0.7\n0.6\n\n0.4\n\n(a)\n0\n\n1\n\na\n\n0.5\n0.2\n\n2 3\nz\nr /s\n\n4\n\n5\n\n0.3\n\n5\n\n0.20\n\ny=2\n\n0.15\n0.10\ny=6\n\n0.05\n\n(b)\n0\n\n10\nt/s\n\n15\n\ns=64\ns=125\ns=216\ns=65\ns=125\ns=216\n\n0.25\ns MTRM(t,s;r)/h\n\n0.8\n\n20\n\n0.00\n\n(c)\n0\n\n1\n\n2 3\nz\nr /s\n\n4\n\n5\n\nFIG. 5: (a) Space-time correlator C(t, s; r) for ε = T = 1 (filled symbols) and ε = T = 0.5 (open\nsymbols) for several waiting times s and the values y = t/s = 2 and y = t/s = 6. The full curves\nare guides to the eye. (b) Autocorrelator C(t, s) for ε = T = 1 (filled symbols) and ε = T = 0.5\n(open symbols) for several waiting times s. (c) Scaled space-time thermoremanent magnetisation\nfor ε = T = 1 (filled symbols) (with a = 0.32) and ε = T = 0.5 (open symbols) (with a = 0.36) for\nseveral waiting times s and the values y = t/s = 2 and y = t/s = 6. The full curves are guides to\nthe eye.\n\nUsing the scaling forms (2,3) in the limit of large y = t/s for the autocorrelation and\nautoresponse functions (where r = 0), we have also extracted the exponents λC /z and λR /z\nand list our results in table I. In contrast to the pure case, where for fully disordered initial\nconditions one may show that λC = λR [4, 10], the values of the autocorrelation exponent\nλC are different from those of the autoresponse exponent λR . In particular, we find that\nwithin our numerical accuracy, λC /z is a function of the single variable ε/T , at least for\nε < 2, while λR /z cannot be expressed in this way. Our data suggest that λR ≥ λC and they\nare consistent with the rigorous Yeung-Rao-Desai inequality λC ≥ d/2 [43]. Furthermore,\nwe observe that λR /z − a should be practically constant (again for ε < 2 and with a value\nin the range ≈ 0.17 − 0.20).\nIn conclusion, our data are clearly consistent with simple ageing of the single-time and\ntwo-time correlation functions, as well as for the thermoremanent magnetisation, and fully\nconfirm the anticipated scaling forms (1,2,3) with L(t) ∼ t1/z .\n12\n\n\fNext, we shall compare the form of the scaling functions, for several values of the control\nparameters ε and T . Since the dynamical exponent z = z(ε/T ), see figure 2, one might\nexpect that the scaling functions themselves should only depend on the ratio ε/T , rather\nthan on ε and T separately. In figure 5, we test this idea by comparing data for ε = T = 1\nwith those for ε = T = 0.5, for the three cases of (a) the space-time-dependent correlation\nC(t, s; r), (b) the autocorrelation C(t, s) and (c) the space-time-dependent thermoremanent\nRs\nmagnetisation MTRM (t, s; r) = h 0 du R(t, u; r). In all cases, there is a clear scaling be-\n\nhaviour consistent with simple ageing [44] and the scaling functions nicely superpose (for\n\nthe integrated response, the data for ε = T = 0.5 were multiplied by 1.17 in order to take\ninto account the well-known presence of the non-universal numerical prefactor). This result,\nnamely that the form of the scaling function only depends on the ratio ε/T , goes beyond\nthe standard scaling form (1,2,3), yet it does not require to re-scale the length by the typical\ndomain size L(t), as it would be required for a test of superuniversality. More systematic\ntests of this result would be welcome. We point out that the findings of figure 5 are consistent with our earlier observation that λC = λC (ε/T ). The more complicated dependence of\nλR on both ε and T would only appear if in plots such as figure 5c one would concentrate\non the region |r| ≈ 0.\nAfter these preparations, we are ready for a test of superuniversality. Superuniversality\nof the single-time correlator C(t, r) is tested in figure 6. First, we show in figure 6a data for\nseveral values of 0 ≤ ε < 2 and T , where the values of z may be read off from figure 2 and\ntable I. The times were chosen sufficiently large such that a clear scaling behaviour has set\nin. Using the typical length scale L(t) as determined earlier from eq. (6), we see that indeed\nall data, including the one for the case without disorder, collapse nicely onto a single curve,\nwithin the numerical accuracy. This is a clear confirmation of superuniversality, very much\nin agreement with earlier studies [16, 17, 18, 19, 20, 21, 32]. However, when considering\nthe case ε = 2, which is shown in figure 6b, a different picture emerges. Clearly, the scaling\ncurves for C(t, r) as obtained for several values of T again collapse onto each other, but, as\nthe comparison with the scaling function of the pure case shows, the scaling function is no\nlonger the same as the one of the pure case. Therefore, if taken at face value, the case ε = 2\nmight represent a distinct superuniversality class. In order to get a better understanding\non this point, we show in figure 6c data for a relatively large value of ε. One sees that\n\n13\n\n\f0.8\n0.6\n0.4\n\n0.6\n\nε=1.6, T=1.0, t=60\nε=1.6, T=1.0, t=600\nε=1.6, T=1.0, t=12000\n\n0.1\n\n0.4\n\n0.2\n\n0.2\n\n(a)\n0.0\n\n0.2\n\nε=2, T=1.0, t=600\nε=2, T=0.8, t=2400\nε=2, T=0.6, t=4800\nε=2, T=0.4, t=9600\nε=0, T=1.0, s=600\n\n0.8\n\nC(t,r)\n\nC(t,r)\n\n1.0\n\nε=0.5, T=1.0, t=9600\nε=0.5, T=0.4, t=600\nε=1.0, T=1.0, t=1200\nε=1.0, T=0.6, t=4800\nε=1.5, T=0.9, t=2400\nε=0, T=1.0, t=600\n\nC(t,r)\n\n1.0\n\n0\n\n(b)\n2\nr/L(t)\n\n4\n\n0.0\n\n(c)\n\n0\n\n2\nr/L(t)\n\n4\n\n0.0\n\n2\n\n3\nr/L(t)\n\n4\n\nFIG. 6: (Colour online) Test of the superuniversality for the single-time correlation function. In\npanel (a), data for ε = 0, 0.5, 1, 1.5 are shown to fall onto the same rescaled curve. In panel (b),\nwe show that the data for ε = 2 describe a curve different from the one of panel (a). The green\ncurve is the scaling function of the pure system. In panel (c), data for ε = 1.6 and different times\nare compared with the scaling curves as measured for ε = 0 (lower green line) and ε = 2 (upper\ngreen line).\n\nfor moderately large times, the data are very close to the curve found for ε = 2, but when\nthe time t is made very large, a cross-over to the curve of the pure case ε = 0 is observed.\nQualitatively, the cross-over time t× increases when ε → 2 and becomes so large that a crossover is no longer detectable for the times (and the lattice sizes, which must be increased to\nlarge times in order to avoid finite-size effects) reachable with our numerical methods. We\ndid not see any sign for a cross-over in our data with ε = 2, but purely numerical techniques\ncannot distinguish between a very large and an infinite cross-over time t× .\nWe extend the test of superuniversality to the case of space-time-dependent two-time correlators in figure 7 and similarly for the space-time-dependent two-time response in figure 8.\nQualitatively, we arrive at essentially the same conclusion as for the single-time correlator.\nIn both cases, panel (a) demonstrates a superuniversal behaviour for values of 0 ≤ ε < 2.\nWe show here our data for y = t/s = 4, but the same behaviour is observed for other values\nof t/s accessed in this study, namely 2 ≤ t/s ≤ 10. However, closer inspection also shows\nthat superuniversality is no longer true for relatively small spatial distances |r|/L(s) . 0.5.\n14\n\n\f1.0\n\n0.5\n0.95\n0.90\n\n0.8\n\nε=2.0, T=1.0\nε=2.0, T=0.8\nε=2.0, T=0.6\nε=2.0, T=0.4\nε=0, T=1.0\n\n0.4\n\n0.85\n\n0.6\n\n0.75\n0.00\n\n0.25\n\n0.2\n\n(a)\n0\n\n1\n\n0.50\n\nε=0.5, T=1.0\nε=0.5, T=0.8\nε=0.5, T=0.6\nε=0.5, T=0.4\nε=1.0, T=1.0\nε=1.0, T=0.8\nε=1.0, T=0.6\nε=1.0, T=0.4\nε=0, T=1.0\n\n0.4\n\n0.0\n\nC(t,s;r)\n\nC(t,s;r)\n\n0.80\n\n2\n\n3\n\n4\n\n5\n\n0.3\n\n0.2\n\n0.1\n\n(b)\n0.0\n\n6\n\n1\n\n2\n\nr/L(s)\n\n3\n\n4\n\n5\n\nr/L(s)\n\nFIG. 7: (Colour online) Test of the superuniversality of the two-time correlation function, with\ny = t/s = 4 and analogous to Figure 6. The data shown are for s = 100. The green curves show\nthe data of the pure system. The inset in panel (a) is a magnification of the area within the dashed\nbox. The black lines are guides to the eye.\n\nThis is shown in the insets of the panels (a) in figures 7 and 8. Indeed, systematic deviations are observed for small spatial distances, the largest deviations being observed for the\nautocorrelation and autoresponse functions with |r| = 0. The value of |r|/L(s) where the\ndeviations set in seems to depend slightly on the value of s, but a larger range of s values\nthan accessed in the present study is needed for a more quantitative discussion of this point.\nThat means that although dynamical scaling does hold true even down to the autocorrelators and autoresponses, correlators and responses taken over a spatial distance of at least a\ntypical cluster size L(t) show yet a larger degree of universality.\nThis requirement appears to be consistent with the known numerical values of the exponents λC /z and λR /z as listed in table I. Superuniversality at r = 0 would have required\nthat their values should have been equal to those of the pure case ε = 0, but we have rather\nseen that they depend on ε and T .\nOn the other hand, the case ε = 2 again stands apart, as we illustrate in the panels (b)\n15\n\n\f0.04\n\n0.15\n0.14\n\nε=2.0, T=1.0\nε=2.0, T=0.8\nε=2.0, T=0.6\nε=0, T=1.0\n\n0.12\n\n0.03\n\n0.10\n\n0.10\n0.00\n\n0.25\n\n(a)\n0\n\n0.50\n\nε=0.5, T=1.0\nε=0.5, T=0.8\nε=0.5, T=0.6\nε=0.5, T=0.4\nε=1.0, T=1.0\nε=1.0, T=0.8\nε=1.0, T=0.6\nε=1.0, T=0.4\nε=0, Τ=1.0\n\n0.05\n\n0.00\n\nM(t,s;r)/h\n\nM(t,s;r)/h\n\n0.08\n\n1\n\n2\n\n3\n\n0.02\n\n0.01\n\n(b)\n0.00\n\n4\n\nr/L(s)\n\n1\n\n2\n\n3\n\n4\n\nr/L(s)\n\nFIG. 8: (Colour online) Test of the superuniversality of the two-time thermoremanent magnetisation, with y = t/s = 4 and analogous to Figure 6. The data shown are for s = 100. In order to\ncompare the data for different ε and T , we have to take care of the fact that the response contains\na non-universal multiplicative factor. The data have been multiplied by a constant in such a way\nthat the different curves coincide with the curve for ε = 0 and T = 1 for large values of r/L(s).\nThe green curves show the data of the pure system. The inset in panel (a) is a magnification of\nthe area within the dashed box. The black lines are guides to the eye.\n\nin both figure 7 and 8. Comparing the data for ε = 2 with the scaling functions found for\n0 ≤ ε < 2 (see panels (a)), we find small but systematic deviations. We stress that although\nthese deviations are not very large, they are well outside the error bars of our high-quality\ndata. As for the single-time correlator, it remains a possibility that for enormous times there\nmight occur a cross-over to the scaling function of the pure case, but the relevant cross-over\ntime t× is far larger than the time scales reached by our simulation.\n\n16\n\n\fIII.\n\nDISCUSSION\n\nIn this work, we have studied the non-equilibrium scaling behaviour of a disordered\nIsing model without frustration, in an attempt to appreciate better the role of disorder by\nconsidering its effects in a system which is no longer identical to a pure system but which\nyet does not show the full complexity of a spin glass. Our conclusions are as follows:\n1. When quenched to a temperature T < Tc from a totally disordered state, the twodimensional bond-disordered Ising model undergoes phase-ordering kinetics. The typical length scale L(t) ∼ t1/z of the ordered domains scales algebraically with time,\nwhere the dynamical exponent z = z(ε/T ) depends continuously on the dimensionless\nratio ε/T of the control parameters.\nQuantitatively, this dependence can be read off from figure 2, and does not agree with\nearlier proposals of a linear relation such as in eq. (5). We have seen that this value\nof z correctly describes the dynamical scaling of not only single-time correlators, but\nof the two-time correlators and responses as well.\n2. Our data are completely compatible with simple ageing.\n3. While the non-equilibrium exponent b = 0 of the correlation function is un-modified\nwith respect to pure phase-ordering systems, the non-equilibrium exponent a which\ndescribes the scaling of the response function is no longer simply related to the dynamical exponent z, see table I and figure 2.\nWe propose to account for this finding in terms of a postulated fractal structure of\nthe domain walls, which has led us to eq. (11). Further tests of this idea would be\nwelcome.\nThe autocorrelation and autoresponse exponents λC = λC (ε/T ) and λR = λR (T, ε)\nare distinct from each other, in contrast to the pure case.\n4. Our data suggest that the form of the scaling functions only depends on the dimensionless ratio ε/T . It remains to be seen to what extent this observation can be extended\nto different systems.\n\n17\n\n\f5. In general, our data appear to confirm the superuniversality hypothesis, that is when\nall length scales are expressed in terms of L(t), the form of the scaling function is\nindependent of both the disorder ε and the temperature T .\nHowever, we have also found two important qualifications:\n(a) Superuniversality does not hold for sufficiently small spatial distances |r|/L(t) .\n0.5.\n(b) For ε = 2, although we find throughout a similar data collapse, the form of the\nscaling functions no longer coı̈ncide with the ones of the pure case. It is not\nunderstood whether the data presented here should be viewed as giving evidence\nfor a distinct superuniversality class or else if there is a cross-over to the scaling\nfunctions of the pure scale at time scales much larger than the ones reached in\nour study.\nA better understanding of superuniversality will require an explanation of these conditions.\nWhat can these findings tell us on the behaviour of real materials ? Indeed, it has\nbeen shown recently, in a comparative study of the three-dimensional random-field Ising\nmodel and the three-dimensional Edwards-Anderson spin glass [21], that superuniversality\nis apparently satisfied in the former case (in which the disorder is 'weak' such that the ground\nstate is still ferromagnetically ordered) while in the latter it is not [45]. Our own result is\nin qualitative agreement with this, but it raises the question how to explain the celebrated\nuniversality of the scaling functions for the linear response found in largely different materials\n[1].\n\n18\n\n\fAcknowledgements\n\nWe thank Leticia Cugliandolo for useful discussions. The simulations have been done on\nVirginia Tech's System X. MH thanks H. Park for kind hospitality at the KIAS Seoul, where\nthe writing-up of this work was finished.\n\n[1] L.C.E. Struik, Physical ageing in amorphous polymers and other materials, Elsevier (Amsterdam 1978)\n[2] L.F. Cugliandolo, in Slow relaxation and non equilibrium dynamics in condensed matter,\neditors J.-L. Barrat, J. Dalibard, J. Kurchan, and M. V. Feigel'man (Springer, 2003),\ncond-mat/0210312\n[3] E. Vincent, in M. Henkel, M. Pleimling and R. Sanctuary (eds) Ageing and the glass transition,\nSpringer Lecture Notes in Physics 716, Springer (Heidelberg 2007); p. 7\n[4] A.J. Bray, Adv. Phys. 43, 357 (1994)\n[5] O. Dauchot, in M. Henkel, M. Pleimling and R. Sanctuary (eds) Ageing and the glass transition, Springer Lecture Notes in Physics 716, Springer (Heidelberg 2007); p. 161\n[6] C. Godrèche. and J.-M. Luck, J. Phys. Cond. Matt. 14, 1589 (2002)\n[7] C. Chamon, L.F. Cugliandold, and H. Yoshino, J. Stat. Mech., P01006 (2006)\n[8] C. Chamon and L.F. Cugliandolo, J. Stat. Mech., P07022 (2007)\n[9] G.F. Mazenko, Nonequilibrium statistical mechanics, ch. 11 Wiley (New York 2006)\n[10] A. Picone and M. Henkel, Nucl. Phys. B688, 217 (2004)\n[11] W. Zippold, R. Kühn and H. Horner, Eur. Phys. J. B13, 531 (2000)\n[12] A. Andreanov and A. Lefèvre, Europhys. Lett. 76, 919 (2006)\n[13] D.A. Huse and C.L. Henley, Phys. Rev. Lett. 54, 2708 (1985)\n[14] Z.W. Lai, G.F. Mazenko and O.T. Valls, Phys. Rev. B37, 9481 (1988).\n[15] D.S. Fisher and D.A. Huse, Phys. Rev. B38, 373 (1988)\n[16] A.J. Bray and K. Humayun, J. Phys. A24, L1185 (1991)\n[17] S. Puri, D. Chowdhuri and N. Parekh, J. Phys. A24, L1087 (1991)\n[18] H. Hayakawa, J. Phys. Soc. Jpn. 60, 2492 (1991)\n\n19\n\n\f[19] T. Iwai and H. Hayakawa, J. Phys. Soc. Japon 62, 1583 (1993)\n[20] B. Biswal, S. Puri and D. Chowdhury, Physica A229, 72 (1996)\n[21] C. Aron, C. Chamon, L.F. Cugliandolo and M. Picco, J. Stat. Mech. P05016 (2008).\n[22] M. Henkel, Nucl. Phys. B641, 605 (2002)\n[23] M. Henkel and M. Pleimling, Phys. Rev. E68, 065101(R) (2003)\n[24] M. Henkel, A. Picone and M. Pleimling, Europhys. Lett. 68, 191 (2004)\n[25] E. Lorenz and W. Janke, Europhys. Lett. 77, 10003 (2007)\n[26] M. Henkel and F. Baumann, J. Stat. Mech., P07015 (2007)\n[27] R. Paul, S. Puri and H. Rieger, Europhys. Lett. 68, 881 (2004)\n[28] H. Rieger, G. Schehr and R. Paul, Prog. Theor. Phys. Suppl. 157, 111 (2005)\n[29] R. Paul, S. Puri and H. Rieger, Phys. Rev. E71, 061109 (2005)\n[30] G. Schehr and P. Le Doussal, Europhys. Lett. 71, 290 (2005);\nG. Schehr and H. Rieger, Phys. Rev. B71, 184202 (2005)\n[31] M. Henkel and M. Pleimling, Europhys. Lett. 76, 561 (2006)\n[32] A. Sicilia, J.J. Arenzon, A.J. Bray and L.F. Cugliandolo, Europhys. Lett. 82, 10001 (2008).\n[33] R. Paul, G. Schehr and H. Rieger, Phys. Rev. E75, 030104 (2007)\n[34] A. Barrat, Phys. Rev. E57, 3629 (1998).\n[35] Indeed, if we take ε = 2, then for T & 0.6 notable finite-time corrections to simple ageing are\nseen, which may be accounted for by including a finite-time correction term [31, 36]\n′\n\nC(t, s) = FC (t/s) − s−b GC (t/s)\nand a new correction exponent b′ > 0.\n[36] M. Henkel and M. Pleimling, in W. Janke (ed) Rugged free-energy landscapes: common computational approaches in spin glasses, structural glasses and biological macromolecules, Springer\nLecture Notes in Physics 736, Springer (Heidelberg 2007); p. 107\n\u0001\n[37] If one uses a scaling form C(t, s) = C (t − s)s−μ , it can be shown that the 'super-ageing' case\nμ > 1 is incompatible with basic requirements from probability theory [38].\n\n[38] J. Kurchan, Phys. Rev. E66, 017101 (2002)\n[39] M. Henkel and M. Pleimling, Europhys. Lett. 69, 524 (2005).\n[40] J.-P. Bouchaud, in M.E. Cates and M.R. Evans (eds), Soft and fragile matter, IOP (Bristol\n2000), p. 285\n\n20\n\n\f[41] M. Henkel, M. Paessens and M. Pleimling, Europhys. Lett. 62, 644 (2003).\n[42] A. Röthlein, F. Baumann, and M. Pleimling, Phys. Rev. E74, 061604 (2006); A. Röthlein, F.\nBaumann, and M. Pleimling, Phys. Rev. E76, 019901(E) (2007)\n[43] C. Yeung, M. Rao and R.C. Desai, Phys. Rev. E53, 3073 (1996).\n[44] The consideration of the spatio-temporal response allows for a much more demanding test of\ndynamical scaling than is possible by merely considering the autoresponse alone. Our results\nhence strengthen the conclusions of a simple power-law scaling in the disordered Ising model\nreached earlier [27, 29, 31].\n[45] It is conceivable that our finding of a distinct behaviour for ε = 2 might be a sort of borderline\nbehaviour when going from ferromagnets to frustrated magnet.\n\n21\n\n\f"}