{"id": "http://arxiv.org/abs/1202.4568v3", "guidislink": true, "updated": "2012-11-10T15:51:07Z", "updated_parsed": [2012, 11, 10, 15, 51, 7, 5, 315, 0], "published": "2012-02-21T09:24:25Z", "published_parsed": [2012, 2, 21, 9, 24, 25, 1, 52, 0], "title": "The automorphism group of a variety with torus action of complexity one", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1202.6116%2C1202.5872%2C1202.1762%2C1202.2844%2C1202.4586%2C1202.3106%2C1202.1410%2C1202.4537%2C1202.3764%2C1202.4568%2C1202.0040%2C1202.6065%2C1202.2220%2C1202.4864%2C1202.4550%2C1202.2226%2C1202.0946%2C1202.5501%2C1202.1369%2C1202.0755%2C1202.0976%2C1202.2927%2C1202.2242%2C1202.2816%2C1202.0118%2C1202.5164%2C1202.6628%2C1202.6019%2C1202.1728%2C1202.2136%2C1202.1977%2C1202.3363%2C1202.5077%2C1202.3580%2C1202.2977%2C1202.5241%2C1202.4265%2C1202.3692%2C1202.0204%2C1202.3950%2C1202.1468%2C1202.2394%2C1202.0410%2C1202.4677%2C1202.6346%2C1202.6175%2C1202.0121%2C1202.0051%2C1202.2788%2C1202.5469%2C1202.1092%2C1202.1160%2C1202.5382%2C1202.5671%2C1202.1102%2C1202.0355%2C1202.1352%2C1202.4895%2C1202.1283%2C1202.3483%2C1202.3768%2C1202.5590%2C1202.4474%2C1202.2751%2C1202.5376%2C1202.3485%2C1202.3328%2C1202.1910%2C1202.0508%2C1202.3550%2C1202.3216%2C1202.1420%2C1202.4911%2C1202.1038%2C1202.1877%2C1202.4404%2C1202.2713%2C1202.2113%2C1202.6599%2C1202.1034%2C1202.1220%2C1202.2377%2C1202.6042%2C1202.2206%2C1202.0083%2C1202.3428%2C1202.3783%2C1202.5201%2C1202.4971%2C1202.4532%2C1202.1382%2C1202.5601%2C1202.0084%2C1202.1658%2C1202.3917%2C1202.6292%2C1202.0228%2C1202.4652%2C1202.1158%2C1202.4033%2C1202.2173&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "The automorphism group of a variety with torus action of complexity one"}, "summary": "We consider a normal complete rational variety with a torus action of\ncomplexity one. In the main results, we determine the roots of the automorphism\ngroup and give an explicit description of the root system of its semisimple\npart. The results are applied to the study of almost homogeneous varieties. For\nexample, we describe all almost homogeneous (possibly singular) del Pezzo\nk*-surfaces of Picard number one and all almost homogeneous (possibly singular)\nFano threefolds of Picard number one having a reductive automorphism group with\ntwo-dimensional maximal torus.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1202.6116%2C1202.5872%2C1202.1762%2C1202.2844%2C1202.4586%2C1202.3106%2C1202.1410%2C1202.4537%2C1202.3764%2C1202.4568%2C1202.0040%2C1202.6065%2C1202.2220%2C1202.4864%2C1202.4550%2C1202.2226%2C1202.0946%2C1202.5501%2C1202.1369%2C1202.0755%2C1202.0976%2C1202.2927%2C1202.2242%2C1202.2816%2C1202.0118%2C1202.5164%2C1202.6628%2C1202.6019%2C1202.1728%2C1202.2136%2C1202.1977%2C1202.3363%2C1202.5077%2C1202.3580%2C1202.2977%2C1202.5241%2C1202.4265%2C1202.3692%2C1202.0204%2C1202.3950%2C1202.1468%2C1202.2394%2C1202.0410%2C1202.4677%2C1202.6346%2C1202.6175%2C1202.0121%2C1202.0051%2C1202.2788%2C1202.5469%2C1202.1092%2C1202.1160%2C1202.5382%2C1202.5671%2C1202.1102%2C1202.0355%2C1202.1352%2C1202.4895%2C1202.1283%2C1202.3483%2C1202.3768%2C1202.5590%2C1202.4474%2C1202.2751%2C1202.5376%2C1202.3485%2C1202.3328%2C1202.1910%2C1202.0508%2C1202.3550%2C1202.3216%2C1202.1420%2C1202.4911%2C1202.1038%2C1202.1877%2C1202.4404%2C1202.2713%2C1202.2113%2C1202.6599%2C1202.1034%2C1202.1220%2C1202.2377%2C1202.6042%2C1202.2206%2C1202.0083%2C1202.3428%2C1202.3783%2C1202.5201%2C1202.4971%2C1202.4532%2C1202.1382%2C1202.5601%2C1202.0084%2C1202.1658%2C1202.3917%2C1202.6292%2C1202.0228%2C1202.4652%2C1202.1158%2C1202.4033%2C1202.2173&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We consider a normal complete rational variety with a torus action of\ncomplexity one. In the main results, we determine the roots of the automorphism\ngroup and give an explicit description of the root system of its semisimple\npart. The results are applied to the study of almost homogeneous varieties. For\nexample, we describe all almost homogeneous (possibly singular) del Pezzo\nk*-surfaces of Picard number one and all almost homogeneous (possibly singular)\nFano threefolds of Picard number one having a reductive automorphism group with\ntwo-dimensional maximal torus."}, "authors": ["Ivan Arzhantsev", "Juergen Hausen", "Elaine Herppich", "Alvaro Liendo"], "author_detail": {"name": "Alvaro Liendo"}, "author": "Alvaro Liendo", "arxiv_comment": "34 pages, minor additions", "links": [{"href": "http://arxiv.org/abs/1202.4568v3", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1202.4568v3", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "math.AG", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "math.AG", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "14J50, 14M25, 14J45, 13A02, 13N15", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1202.4568v3", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1202.4568v3", "journal_reference": "Moscow Math. J. 14, 429-471 (2014)", "doi": null, "fulltext": "arXiv:1202.4568v3 [math.AG] 10 Nov 2012\n\nTHE AUTOMORPHISM GROUP OF A VARIETY\nWITH TORUS ACTION OF COMPLEXITY ONE\nIVAN ARZHANTSEV, JÜRGEN HAUSEN, ELAINE HERPPICH, AND ALVARO LIENDO\nAbstract. We consider a normal complete rational variety with a torus action of complexity\none. In the main results, we determine the roots of the automorphism group and give an explicit\ndescription of the root system of its semisimple part. The results are applied to the study of\nalmost homogeneous varieties. For example, we describe all almost homogeneous (possibly\nsingular) del Pezzo K∗ -surfaces of Picard number one and all almost homogeneous (possibly\nsingular) Fano threefolds of Picard number one having a reductive automorphism group with\ntwo-dimensional maximal torus.\n\n1. Introduction\nFor any complete rational algebraic variety X, the unit component Aut(X)0 of its automorphism\ngroup is linear algebraic and it is a natural desire to understand the structure of this group.\nEssential insight is provided by the roots, i.e. the eigenvalues of the adjoint representation of a\nmaximal torus on the Lie algebra. Recall that if a linear algebraic group is reductive, then its set\nof roots forms a so-called root system and, up to coverings, determines the group. In the general\ncase, the group is generated by its maximal torus and the additive one-parameter subgroups\ncorresponding to the roots. Seminal work on the structure of automorphism groups has been done\nby Demazure [7] for the case of smooth complete toric varieties X. Here, the acting torus T of X\nis as well a maximal torus of Aut(X)0 and Demazure described the roots of Aut(X)0 with respect\nto T in terms of the defining fan of X; see [6, 5, 17, 19] for further development in this direction.\nCox [6] presented an approach to the automorphism group of a toric variety via the homogeneous\ncoordinate ring and thereby generalized Demazure's results to the simplicial case; see [4] for an\napplication of homogeneous coordinates to the study of automorphism groups in the more general\ncase of spherical varieties.\nIn the present paper, we go beyond the toric case in the sense that we consider normal complete\nrational varieties X coming with an effective torus action T × X → X of complexity one, i.e. the\ndimension of T is one less than that of X; the simplest nontrivial examples are K∗ -surfaces,\nsee [20, 21]. Our approach is based on the Cox ring R(X) and the starting point is the explicit\ndescription of R(X) in the complexity one case provided by [13, 14]; see also Section 3 for details.\nGenerators and relations of R(X) as well as the grading by the divisor class group Cl(X) can\nbe encoded in a sequence A = a0 , . . . , ar of pairwise linearly independent vectors in K2 and an\nintegral matrix\n\n\n−l0 l1 . . . 0 0\n ..\n.. \n.\n.. . .\n\n. ..\n. \n.\nP =  .\n\n −l0 0 . . . lr 0 \nd0 d1 . . . dr d′\n\nof size (n + m) × (r + s), where li are nonnegative integral vectors of length ni , the di are\ns × ni blocks, d′ is an s × m block and the columns of P are pairwise different primitive vectors\ngenerating the column space Qr+s as a convex cone. Conversely, the data A, P always define a\nCox ring R(X) = R(A, P ) of a complexity one T -variety X. The dimension of X equals s + 1\nand the acting torus T has Zs as its character lattice. The matrix P determines the grading\n2000 Mathematics Subject Classification. 14J50, 14M25, 14J45, 13A02, 13N15.\n1\n\n\f2\n\nI. ARZHANTSEV, J. HAUSEN, E. HERPPICH, AND A. LIENDO\n\nand the exponents occuring in the relations, whereas A is responsible for continuous aspects, i.e.\ncoefficients in the relations.\nThe crucial concept for the investigation of the automorphism group Aut(X) are the Demazure\nP -roots, which we introduce in Definition 5.2. Roughly speaking, these are finitely many integral\nlinear forms u on Zr+s satisfying a couple of linear inequalities on the columns of P . In particular,\ngiven P , the Demazure P -roots can be easily determined. In contrast with the toric case, the\nDemazure P -roots are divided into two types. Firstly, there are \"vertical\" ones corresponding to\nroot subgroups whose orbits are contained in the closures of generic torus orbits. Such Demazure\nP -roots are defined by free generators of the Cox ring and their description is analogous to the toric\ncase. Secondly, there are \"horizontal\" Demazure P -roots corresponding to root subgroups whose\norbits are transversal to generic torus orbits. Dealing with this type heavily involves the relations\namong generators of the Cox ring. Our first main result expresses the roots of Aut(X)0 and,\nmoreover, the approach shows how to obtain the corresponding root subgroups, see Theorem 5.5\nand Corollary 5.11 for the precise formulation:\nTheorem. Let X be a nontoric normal complete rational variety with an effective torus action\nT × X → X of complexity one. Then Aut(X) is a linear algebraic group having T as a maximal\ntorus and the roots of Aut(X) with respect to T are precisely the Zs -parts of the Demazure P -roots.\nThe basic idea of the proof is to relate the group Aut(X) to the group of graded automorphisms\nof the Cox ring. This is done in Section 2 more generally for arbitrary Mori dream spaces, i.e. normal complete varieties with a finitely generated Cox ring R(X). In this setting, the grading by the\ndivisor class group Cl(X) defines an action of the characteristic quasitorus HX = Spec K[Cl(X)]\nb ⊆ X by\non the total coordinate space X = Spec R(X) and X is the quotient of an open subset X\nthe action of HX . The group of Cl(X)-graded automorphisms of R(X) is isomorphic to the group\nAut(X, HX ) of HX -equivariant automorphisms of X. Moreover, the group Bir2 (X) of birational\nautomorphisms of X defined on an open subset of X having complement of codimension at least\ntwo plays a role. Theorem 2.1 brings all groups together:\nTheorem. Let X be a (not necessarily rational) Mori dream space. Then there is a commutative diagram of morphisms of linear algebraic groups where the rows are exact sequences and the\nupwards inclusions are of finite index:\n1\n\n/ HX\n\n1\n\n/ HX\n\n/ Aut(X, HX )\nO\n\n/ Bir2 (X)\nO\n\n/1\n\n\u001f?\n/ Aut(X,\nb HX )\n\n\u001f?\n/ Aut(X)\n\n/1\n\nThis means in particular that the unit component of Aut(X) coincides with that of Bir2 (X)\nwhich in turn is determined by Aut(X, HX ), the group of graded automorphisms of the Cox ring.\nComing back to rational varieties X with torus action of complexity one, the task then is a detailed\nstudy of the graded automorphism group of the rings R(X) = R(A, P ). This is done in a purely\nalgebraic way. The basic concepts are provided in Section 3. The key result is the description\nof the \"primitive homogeneous locally nilpotent derivations\" on R(A, P ) given in Theorem 4.3.\nThe proof of the first main theorem in Section 5 then relates the Demazure P -roots via these\nderivations to the roots of the automorphism group Aut(X).\nIn Section 6 we apply our results to the study of almost homogeneous rational K∗ -surfaces\nX of Picard number one; where almost homogeneous means that Aut(X) has an open orbit in\nX. It turns out that these surfaces are always (possibly singular) del Pezzo surfaces and, up to\nisomorphism, there are countably many of them, see Corollary 6.3. Finally in the case that X is\nlog terminal with only one singularity, we give classifications for fixed Gorenstein index.\nIn Section 7, we investigate the semisimple part Aut(X)ss ⊆ Aut(X) of the automorphism\ngroup; recall that the semisimple part of a linear algebraic group is a maximal connected semisimple subgroup. In the case of a toric variety, by Demazure's results, the semisimple part of the\n\n\fTHE AUTOMORPHISM GROUP OF A VARIETY WITH TORUS ACTION\n\n3\n\nautomorphism group has a root system composed of systems Ai . Here comes a summarizing version of our second main result which settles the complexity one case; see Theorem 7.2 for the\ndetailed description.\nTheorem. Let X be a nontoric normal complete rational variety with an effective torus action\nT × X → X of complexity one. The root system Φ of the semisimple part splits as Φ = Φvert ⊕ Φhor\nwith\nM\nAmD −1 ,\nΦhor ∈ {∅, A1 , A2 , A3 , A1 ⊕ A1 , B2 },\nΦvert =\nCl(X)\n\nwhere mD is the number of invariant prime divisors in X with infinite T -isotropy that represent a\ngiven class D ∈ Cl(X). The number mD as well as the possibilities for Φhor can be read off from\nthe defining matrix P .\nExamples and applications of this result are discussed in Section 8. The main results concern\nvarieties of dimension three which are almost homogeneous under the action of a reductive group\nand additionally admit an effective action of a two-dimensional torus. In Proposition 8.4, we\nexplicitly describe the Cox rings of these varieties. Moreover, in Proposition 8.6, we list all those\nhaving Picard number one and a reductive automorphism group; it turns out that any such variety\nis a Fano variety.\nContents\n1. Introduction\n2. The automorphism group of a Mori dream space\n3. Rings with a factorial grading of complexity one\n4. Primitive locally nilpotent derivations\n5. Demazure roots\n6. Almost homogeneous surfaces\n7. Structure of the semisimple part\n8. Applications\nReferences\n\n1\n3\n7\n11\n15\n20\n24\n30\n33\n\n2. The automorphism group of a Mori dream space\nLet X be a normal complete variety defined over an algebraically closed field K of characteristic\nzero with finitely generated divisor class group Cl(X) and Cox sheaf R; we recall the definition\nbelow. If X is a Mori dream space, i.e. the Cox ring R(X) = Γ(X, R) is finitely generated as a\nK-algebra, then we obtain the following picture\nSpecX R\n\n=\n\nb\nX\n\n⊆\n\nX\n\n=\n\nSpec R(X)\n\n//HX\n\n\u000f\nX\n\nwhere the total coordinate space X comes with an action of the characteristic quasitorus HX :=\nb i.e. the relative spectrum of the Cox sheaf, occurs as\nSpec K[Cl(X)], the characteristic space X,\nb → X is a good quotient for the action\nan open HX -invariant subset of X and the map pX : X\nof HX .\nb By an HX -equivariant\nWe study automorphisms of X in terms of automorphisms of X and X.\ne where φ : X → X is an automorphism of varieties and\nautomorphism of X we mean a pair (φ, φ),\nφ\ne : HX → HX is an automorphism of linear algebraic groups satisfying\nφ(t*x) = φ(t)*φ(x)\ne\n\nfor all x ∈ X, t ∈ HX .\n\nWe denote the group of HX -equivariant automorphisms of X by Aut(X, HX ). Analogously, one\nb HX ) of HX -equivariant automorphisms of X.\nb A weak automorphism of\ndefines the group Aut(X,\n\n\f4\n\nI. ARZHANTSEV, J. HAUSEN, E. HERPPICH, AND A. LIENDO\n\nX is a birational map φ : X → X which defines an isomorphism of big open subsets, i.e., there\nare open subsets U1 , U2 ⊆ X with complement X \\ Ui of codimension at least two in X such that\nφ|U1 : U1 → U2 is a regular isomorphism. We denote the group of weak automorphisms of X by\nBir2 (X).\nTheorem 2.1. Let X be a Mori dream space. Then there is a commutative diagram of morphisms\nof linear algebraic groups where the rows are exact sequences and the upwards inclusions are of\nfinite index:\n/ HX\n/ Aut(X, HX )\n/ Bir2 (X)\n/1\n1\nO\nO\n/ HX\n\n1\n\n\u001f?\nb HX )\n/ Aut(X,\n\n\u001f?\n/ Aut(X)\n\n/1\n\nMoreover, there is a big open subset U ⊆ X with Aut(U ) = Bir2 (X) and the groups Aut(X, HX ),\nb HX ), Aut(X) act morphically on X, U , X,\nb X, respectively.\nBir2 (X), Aut(X,\n\nOur proof uses some ingredients from algebra which we develop first. Let K be a finitely\ngenerated abelian group and consider a finitely generated integral K-algebra\nM\nR =\nRw .\nw∈K\n\nThe weight monoid of R is the submonoid S ⊆ K consisting of the elements w ∈ K with Rw 6= 0.\nThe weight cone of R is the convex cone ω ⊆ KQ in the rational vector space KQ = K ⊗Z Q\ngenerated by the weight monoid S ⊆ K. We say that the K-grading of R is pointed if the weight\ncone ω ⊆ KQ contains no line and R0 = K holds. By an automorphism of the K-graded algebra\nR we mean a pair (ψ, F ), where ψ : R → R is an isomorphism of K-algebras and F : K → K is\nan isomorphism such that ψ(Rw ) = RF (w) holds for all w ∈ K. We denote the group of such\nautomorphisms of R by Aut(R, K).\nProposition 2.2. Let K be a finitely generated abelian group and R = ⊕w∈K Rw a finitely generated integral K-algebra with R∗ = K∗ . Suppose that the grading is pointed. Then Aut(R, K) is\na linear algebraic group over K and R is a rational Aut(R, K)-module.\nProof. The idea is to represent the automorphism group Aut(R, K) as a closed subgroup of the\nlinear automophism group of a suitable finite dimensional vector subspace V 0 ⊆ R. In the subsequent construction of V 0 , we may assume that the weight cone ω generates KQ as a vector\nspace.\nConsider the subgroup Γ ⊆ Aut(K) of Z-module automorphisms K → K such that the induced\nlinear isomorphism KQ → KQ leaves the weight cone ω ⊆ KQ invariant. By finite generation of\nR, the cone ω is polyhedral and thus Γ is finite. Let f1 , . . . , fr ∈ R be homogeneous generators\nand denote by wi := deg(fi ) ∈ K their degrees. Define a finite Γ-invariant subset and a vector\nsubspace\nM\nS 0 := Γ * {w1 , . . . , wr } ⊆ K,\nV 0 :=\nRw ⊆ R.\nw∈S 0\n\nFor every automorphism (ψ, F ) of the graded algebra R, we have F (S 0 ) = S 0 and thus ψ(V 0 ) =\nV . Moreover, (ψ, F ) is uniquely determined by its restriction on V 0 . Consequently, we may regard\nthe automorphism group H := Aut(R, K) as a subgroup of the general linear group GL(V 0 ). Note\nthat every g ∈ H\nL\n0\n(i) permutesPthe components Rw of the decomposition VP\n= w∈S 0 Rw ,\n(ii) satisfies ν aν g(f1 )ν1 * * * g(fr )νr = 0 for any relation ν aν f1ν1 * * * frνr = 0.\nObviously, these are algebraic conditions. Moreover, every g ∈ GL(V 0 ) satisfying the above\nconditions can be extended uniquely to an element of Aut(R, K) via\n!\nX\nX\n:=\ng\naν g(f1 )ν1 * * * g(fr )νr .\naν f1ν1 * * * frνr\n0\n\nν\n\nν\n\n\fTHE AUTOMORPHISM GROUP OF A VARIETY WITH TORUS ACTION\n\n5\n\nThus, we saw that H ⊆ GL(V 0 ) is precisely the closed subgroup defined by the above conditions\n(i) and (ii). In particular H = Aut(R, K) is linear algebraic. Moreover, the symmetric algebra\nSV 0 is a rational GL(V 0 )-module, hence SV 0 is a rational H-module for the algebraic subgroup\nH of GL(V 0 ), and so is its factor module R.\n\u0003\nCorollary 2.3. Let K be a finitely generated abelian group and R = ⊕w∈K Rw a finitely generated\nintegral K-algebra with R∗ = K∗ . Consider the corresponding action of H := Spec K[K] on\nX := Spec R. Then we have a canonical isomorphism\nAut(X, H) → Aut(R, K),\n\n(φ, φ)\ne 7→ (φ∗ , φ\ne∗ ),\n\nwhere φ∗ is the pullback of regular functions and φ\ne∗ the pullback of characters. If the K-grading\nis pointed, then Aut(X, H) is a linear algebraic group acting morphically on X.\n\nWe will also need details of the construction of the Cox sheaf R on X which we briefly recall\nnow. Denote by c : WDiv(X) → Cl(X) the map sending the Weil divisors to their classes, let\nPDiv(X) = ker(c) denote the group of principal divisors and choose a character, i.e. a group\nhomomorphism χ : PDiv(X) → K(X)∗ with\ndiv(χ(E)) = E,\n\nfor all E ∈ PDiv(X).\n\nThis can be done by prescribing χ suitably on a Z-basis of PDiv(X). Consider the associated\nsheaf of divisorial algebras\nM\nSD ,\nSD := OX (D).\nS :=\nWDiv(X)\n\nDenote by I the sheaf of ideals of S locally generated by the sections 1 − χ(E), where 1 is\nhomogeneous of degree zero, E runs through PDiv(X) and χ(E) is homogeneous of degree −E.\nThe Cox sheaf associated to K and χ is the quotient sheaf R := S/I together with the Cl(X)grading\n\n\nM\nM\nR[D] ,\nR[D] := π \nSD′  .\nR =\nD′ ∈c−1 ([D])\n\n[D]∈Cl(X)\n\nwhere π : S → R denotes the projection. The Cox sheaf R is a quasicoherent sheaf of Cl(X)-graded\nOX -algebras. The Cox ring is the ring R(X) of global sections of the Cox sheaf.\n\nProof of Theorem 2.1. We set GX := Aut(X, HX ) for short. According to Corollary 2.3, the\ngroup GX is linear algebraic and acts morphically on X. Looking at the representations of HX\nand GX on Γ(X, O) = R(X) defined by the respective actions, we see that the canonical inclusion\nHX → GX is a morphism of linear algebraic groups.\nNext we construct the subset U ⊆ X from the last part of the statement. Consider the translates\nb where g ∈ G . Each of them admits a good quotient with a complete quotient space:\ng * X,\nX\nb → (g * X)/\nb /HX .\npX,g : g * X\n\nBy [3], there are only finitely many open subsets of X with such a good quotient. In particular,\nb is finite.\nthe number of translates g * X\nc → W , where\nLet W ⊆ X denote the maximal open subset such that the restricted quotient W\n−1\nc\nW := pX (W ), is geometric, i.e. has the HX -orbits as its fibers. Then, for any g ∈ GX , the\nc ⊆ g* X\nb is the (unique) maximal open subset which is saturated with respect to the\ntranslate g* W\nquotient map pX,g and defines a geometric quotient. Consider\n\\\nc ⊆ X.\nb\nb :=\ng *W\nU\ng∈GX\n\nb is open, and by construction it is G -invariant and saturated\nBy the preceding considerations U\nX\nc is big in X. Consequently, also U\nb is big in X.\nwith respect to pX . By [1, Prop. 6.1.6] the set W\nb\nThus, the (open) set U := pX (U ) is big in X. By the universal property of the geometric quotient,\n\n\f6\n\nI. ARZHANTSEV, J. HAUSEN, E. HERPPICH, AND A. LIENDO\n\nb → U equivariant. Thus, we have\nthere is a unique morphical action of GX on U making pX : U\nhomomorphism of groups\nGX → Aut(U ) ⊆ Bir2 (X).\nWe show that π : GX → Bir2 (X) is surjective. Consider a weak automorphism φ : X → X.\nThe pullback defines an automorphism of the group of Weil divisors\nφ∗ : WDiv(X) → WDiv(X),\n\nD 7→ φ∗ D.\n\nAs in the construction of the Cox sheaf, consider the sheaf of divisorial algebras S = ⊕SD associated to WDiv(X) and fix a character χ : PDiv(X) → K(X)∗ with div(χ(E)) = E for any\nE ∈ PDiv(X). Then we obtain a homomorphism\nα : PDiv(X) → K∗ ,\n\nE 7→\n\nφ∗ (χ(E))\n.\nχ(φ∗ (E))\n\nWe extend this to a homomorphism α : WDiv(X) → K∗ as follows. Write Cl(X) as a direct sum\nof a free part and cyclic groups Γ1 , . . . , Γs of order ni . Take D1 , . . . , Dr ∈ WDiv(X) such that the\nclasses of D1 , . . . , Ds are generators for Γ1 , . . . , Γs and the remaining ones define a basis of the\nfree part. Set\np\nα(Di ) := 1 for s + 1 ≤ i ≤ r.\nα(Di ) := ni α(ni Di ) for 1 ≤ i ≤ s,\n\nThen one directly checks that this extends α to a homomorphism WDiv(X) → K∗ . Using α(E)\nas a \"correction term\", we define an automorphism of the graded sheaf S of divisorial algebras:\nfor any open set V ⊆ X we set\nφ∗ : Γ(V, SD ) → Γ(φ−1 (V ), Sφ∗ (D) ),\n\nf 7→ α(D)f ◦ φ.\n\nBy construction φ∗ sends the ideal I arising from the character χ to itself. Consequently, φ∗\ndescends to an automorphism (ψ, F ) of the (graded) Cox sheaf R; note that F is the pullback of\ndivisor classes via φ. The degree zero part of ψ equals the usual pullback of regular functions on\nb →U\nb maps to φ.\nX via φ. Thus, the element in Aut(X, HX ) defined by Spec ψ : U\nClearly, HX lies in the kernel of π : GX → Bir2 (X). For the reverse inclusion, consider an\nelement g ∈ ker(π). Then g is a pair (φ, φ)\ne and, by the construction of π, we have a commutative\ndiagram\nb\nU\n\nφ\n\npX\n\n\u000f\nU\n\nb\n/U\n\npX\n\nid\n\n\u000f\n/U\n\nb , O) =\nIn particular, φ stabilizes all HX -invariant divisors. It follows that the pullback φ∗ on Γ(U\nR(X) stabilizes the homogeneous components. Thus, for any homogeneous f of degree w, we\nhave φ∗ (f ) = λ(w)f with a homomorphism λ : K → K∗ . Consequently φ(x) = h*x holds with an\nelement h ∈ HX . The statements concerning the upper sequence are verified.\nb is big in X, every automorphism of X\nb extends to\nNow, consider the lower sequence. Since X\nb HX ) is the (closed) subgroup of G leaving\nan automorphism of X. We conclude that Aut(X,\nX\nb invariant. As seen before, the collection of translates G * X\nb is finite and\nthe complement X \\ X\nX\nb HX ) of G is of finite index. Moreover, lifting φ ∈ Aut(X) as before\nthus the subgroup Aut(X,\nX\nb invariant. Thus, Aut(X,\nb HX ) → Aut(X) is surjective\ngives an element of Aut(X, HX ) leaving X\nb → X, the action of Aut(X)\nwith kernel HX . By the universal property of the qood quotient X\non X is morphical.\n\u0003\nCorollary 2.4. The automorphism group Aut(X) of a Mori dream space X is linear algebraic\nand acts morphically on X.\n\nCorollary 2.5. If two Mori dream spaces are isomorphic in codimension one, then the unit\ncomponents of their automorphism groups are isomorphic to each other.\n\n\fTHE AUTOMORPHISM GROUP OF A VARIETY WITH TORUS ACTION\n\n7\n\nLet CAut(X, HX ) denote the centralizer of HX in the automorphism group Aut(X). Then\nCAut(X, HX ) consists of all automorphisms φ : X → X satisfying\nφ(t*x) = t*φ(x)\n\nfor all x ∈ X, t ∈ HX .\n\nIn particular, we have CAut(X, HX ) ⊆ Aut(X, HX ). The group CAut(X, HX ) may be used to\ndetect the unit component Aut(X)0 of the automorphism group of X.\nCorollary 2.6. Let X be a Mori dream space. Then there is an exact sequence of linear algebraic\ngroups\n1\n\n/ HX\n\n/ CAut(X, HX )0\n\n/ Aut(X)0\n\n/ 1.\n\nb invariant. Thus, we\nProof. According to [24, Cor. 2.3], the group CAut(X, HX )0 leaves X\n0\nb\nhave CAut(X, HX ) ⊆ Aut(X, HX ) and the sequence is well defined. Moreover, for any φ ∈\nAut(X)0 , the pullback φ∗ : Cl(X) → Cl(X) is the identity. Consequently, φ lifts to an element of\n\u0003\nCAut(X, HX ). Exactness of the sequence thus follows by dimension reasons.\nCorollary 2.7. Let X be a Mori dream space. Then, for any closed subgroup F ⊆ Aut(X)0 , there\nis a closed subgroup F ′ ⊆ CAut(X, HX )0 such that the induced map F ′ → F is an epimorphism\nwith finite kernel.\nCorollary 2.8. Let X be a Mori dream space such that the group CAut(X, HX ) is connected, e.g.\na toric variety. Then there is an exact sequence of linear algebraic groups\n1\n\n/ HX\n\n/ CAut(X, HX )\n\n/ Aut(X)0\n\n/ 1.\n\nExample 2.9. Consider the nondegenerate quadric X in the projective space Pn+1 , where n ≥ 4\nis even. Then the Cox ring of X is the Z-graded ring\n2\nR(X) = K[T0 , . . . , Tn+1 ] / hT02 + . . . + Tn+1\ni,\n\ndeg(T0 ) = . . . = deg(Tn+1 ) = 1.\n\nThe characteristic quasitorus is HX = K∗ . Moreover, for the equivariant automorphisms and the\ncentralizer of HX we obtain\nAut(X, HX ) = CAut(X, HX ) = K∗ En+2 *On+2 .\nThus, CAut(X, HX ) has two connected components. Note that for n = 4, the quadric X comes\nwith a torus action of complexity one.\n3. Rings with a factorial grading of complexity one\nHere we recall the necessary constructions and results on factorially graded rings of complexity\none and Cox rings of varieties with a torus action of complexity one from [13]. The main result\nof this section is Proposition 3.5 which describes the dimension of the homogeneous components\nin terms of the (common) degree of the relations. As before, we work over an algebraically closed\nfield K of characteristic zero.\nLet K be an abelian group and R = ⊕K Rw a K-graded algebra. The grading is called effective\nif the weight monoid S of R generates K as a group. Moreover, we say that the grading is of\ncomplexity one, if it is effective and dim(KQ ) equals dim(R) − 1. By a K-prime element of R we\nmean a homogeneous nonzero nonunit f ∈ R such that f | gh with homogeneous g, h ∈ R implies\nf | g or f | h. We say that R is factorially K-graded if every nonzero homogeneous nonunit of R\nis a product of K-primes.\nConstruction 3.1. See [13, Section 1]. Fix r ∈ Z≥1 , a sequence n0 , . . . , nr ∈ Z≥1 , set n :=\nn0 + . . . + nr and let m ∈ Z≥0 . The input data are\n• a matrix A := [a0 , . . . , ar ] with pairwise linearly independent column vectors a0 , . . . , ar ∈\nK2 ,\n\n\f8\n\nI. ARZHANTSEV, J. HAUSEN, E. HERPPICH, AND A. LIENDO\n\n• an integral r × (n + m) block matrix P0 = (L0 , 0),\ni\ntuples li := (li1 , . . . , lini ) ∈ Zn≥1\nas follows\n\n−l0 l1 . . .\n ..\n.. . .\nL0 =  .\n.\n.\n−l0\n\n0\n\nwhere L0 is a r × n matrix build from\n\n\n0\n..  .\n. \n. . . lr\n\nConsider the polynomial ring K[Tij , Sk ] in the variables Tij , where 0 ≤ i ≤ r, 1 ≤ j ≤ ni and Sk ,\nwhere 1 ≤ k ≤ m. For every 0 ≤ i ≤ r, define a monomial\nTili\n\nlin\n\nli1\n* * * Tini i .\n:= Ti1\n\nDenote by I the set of all triples I = (i1 , i2 , i3 ) with 0 ≤ i1 < i2 < i3 ≤ r and define for any I ∈ I\na trinomial\n\u0015\n\u0014 li\nl\nl\nTi1 1 Ti2i2 Ti3i3\n.\ngI := det\nai3\nai2\nai1\n\nLet P0∗ denote the transpose of P0 . We introduce a grading on K[Tij , Sk ] by the factor group\nK0 := Zn+m /im(P∗0 ). Let Q0 : Zn+m → K0 be the projection and set\ndeg(Tij ) := wij := Q0 (eij ),\n\ndeg(Tk ) := wk := Q0 (ek ),\n\nn+m\n\nwhere eij ∈ Z\n, for 0 ≤ i ≤ r, 1 ≤ j ≤ ni , and ek ∈ Zn+m , for 1 ≤ k ≤ m, are the canonical\nbasis vectors. Note that all the gI are K0 -homogeneous of degree\nμ := l01 w01 + . . . + l0n0 w0n0 = . . . = lr1 wr1 + . . . + lrnr wrnr ∈ K0 .\nIn particular, the trinomials gI generate a K0 -homogeneous ideal and thus we obtain a K0 -graded\nfactor algebra\nR(A, P0 ) :=\n\nK[Tij , Sk ] / hgI ; I ∈ Ii.\n\nTheorem 3.2. See [13, Theorems 1.1 and 1.3]. With the notation of Construction 3.1, the\nfollowing statements hold.\n(i) The K0 -grading of ring R(A, P0 ) is effective, pointed, factorial and of complexity one.\n(ii) The variables Tij and Sk define a system of pairwise nonassociated K0 -prime generators\nof R(A, P0 ).\n(iii) Every finitely generated normal K-algebra with an effective, pointed, factorial grading of\ncomplexity one is isomorphic to some R(A, P0 ).\nNote that in the case r = 1, there are no relations and the theorem thus treats the effective,\npointed gradings of complexity one of the polynomial ring.\nExample 3.3 (The E6 -singular cubic I). Let r = 2, n0 = 2, n1 = n2 = 1, m = 0 and consider\nthe data\n\u0014\n\u0015\n\u0014\n\u0015\n0 −1 1\n−1 −3 3 0\nA =\n,\nP0 = L0 =\n.\n1 −1 0\n−1 −3 0 2\nThen we have exactly one triple in I, namely I = (1, 2, 3), and, as a ring, R(A, P0 ) is given by\nR(A, P0 ) =\n\n3\n3\n2\nK[T01 , T02 , T11 , T21 ] / hT01 T02\n+ T11\n+ T21\ni.\n\nThe grading group K0 = Z4 /im(P0∗ ) is isomorphic to Z2 and the grading can be given explicitly\nvia\n\u0012\n\u0013\n\u0012\n\u0013\n−3\n1\ndeg(T01 ) =\n,\ndeg(T02 ) =\n,\n3\n1\n\u0012\n\u0013\n\u0012 \u0013\n0\n0\ndeg(T11 ) =\n,\ndeg(T21 ) =\n.\n2\n3\n\nRecall that for any integral ring R = ⊕K Rw graded by an abelian group K, one has the subfield\nof degree zero fractions inside the field of fractions:\n\u001b\n\u001a\nf\n; f, g ∈ R homogeneous, g 6= 0, deg(f ) = deg(g) ⊆ Q(R).\nQ(R)0 =\ng\n\n\fTHE AUTOMORPHISM GROUP OF A VARIETY WITH TORUS ACTION\n\n9\n\nProposition 3.4. Take any i, j with i 6= j and 0 ≤ i, j ≤ r. Then the field of degree zero fractions\nof the ring R(A, P0 ) is the rational function field\n!\nl\nTj j\n.\nQ(R(A, P0 ))0 = K\nTili\nQ\nProof. It suffices to treat the case m = 0. Let F = Tij be the product of all variables. Then\nTn = KnF is the n-torus and P0 defines an epimorphism having the quasitorus H0 := Spec K[K0 ]\nas its kernel\n!\ntl11\ntlrr\nn\nr\nπ: T → T ,\n(tij ) 7→\n, . . . , l0 .\ntl00\nt0\nSet X := Spec R(A, P0 ). Then π(X F ) = X F /H0 is a curve defined by affine linear equations in\nthe coordinates of Tr and thus rational. The assertion follows.\n\u0003\nThe following observation shows that the common degree μ = deg(gI ) of the relations generalizes\nthe \"remarkable weight\" introduced by Panyushev [22] in the factorial case. Recall that the weight\nmonoid S0 ⊆ K0 consists of all w ∈ K0 admitting a nonzero homogeneous element.\nProposition 3.5. Consider the K0 -graded ring R := R(A, P0 ) and the degree μ = deg(gI ) of the\nrelations as defined in 3.1. For w ∈ S0 let sw ∈ Z≥0 be the unique number with w − sw μ ∈ S0 and\nw − (sw + 1)μ 6∈ S0 . Then we have\ndim(Rw ) = sw + 1 for all w ∈ S0 .\nThe element μ ∈ K0 is uniquely determined by this property. We have dim(Rμ ) = 2 and any two\nnonproportional elements in Rμ are coprime. Moreover, any w ∈ S0 with w − μ 6∈ S0 satisfies\ndim(Rw ) = 1.\nProof. According to Proposition 3.4, the field Q(R)0 of degree zero fractions is the field of rational\nfunctions in p1 /p0 , where p0 := T0l0 and p1 := T1l1 are coprime and of degree μ. Moreover, by the\nstructure of the relations gI , we have dim(Rμ ) = 2.\nNow, consider w ∈ S0 . If we have dim(Rw ) = 1, then dim(Rμ ) = 2 implies sw = 0 and the\nassertion follows in this case. Suppose that we have dim(Rw ) > 1. Then we find two nonproportional elements f0 , f1 ∈ Rw and two coprime homogeneous polynomials F0 , F1 of a common\ndegree s > 0 such that\nF1 (p0 , p1 )\nf1\n=\n.\nf0\nF0 (p0 , p1 )\nObserve that F1 (p0 , p1 ) must divide f1 . This implies w − sμ ∈ S0 . Repeating the procedure with\nw − sμ and so on, we finally arrive at a weight w\ne = w − sw μ with dim(Rwe ) = 1. Moreover, by\nthe procedure, any element of Rw is of the form hF (p0 , p1 ) with 0 6= h ∈ Rwe and a homogeneous\npolynomial F of degree sw . The assertion follows.\n\u0003\nCorollary 3.6. Assume that we have r ≥ 2 and that li1 + . . . + lini ≥ 2 holds for all i.\n(i) The K0 -homogeneous components R(A, P )wij and R(A, P )wk of the generators Tij and\nSk are all of dimension one.\n(ii) Consider w = wi1 j1 +. . .+wit jt ∈ K0 , where 1 ≤ t ≤ r. If lik jk = 1 holds for 1 ≤ k ≤ t−1,\nthen R(A, P0 )w is of dimension one.\nProof. According to Proposition 3.5, we have to show that the shifts of the weights wij , wk and w\nby −μ do not belong to the weight monoid S0 . For wk this is clear. For wij , the assumption gives\nX\nwij − μ = −(lij − 1)wij −\nlib wib 6∈ S0 .\nb6=j\n\nLet us consider the weight w of (ii). Since t ≤ r holds, there is an index 0 ≤ i0 ≤ r with i0 6= ik\nfor k = 1, . . . , t. We have w − μ = Q0 (e) for\ne := ei1 j1 + . . . + eit jt − (li0 1 ei0 1 + . . . + li0 ni0 ei0 ni0 ) ∈ Zn+m .\n\n\f10\n\nI. ARZHANTSEV, J. HAUSEN, E. HERPPICH, AND A. LIENDO\n\nBy the assumptions, we find 1 ≤ ai ≤ ni , where 0 ≤ i ≤ r, such that aik 6= jk holds for 1 ≤ k ≤ t−1\nand ait 6= jt or lit ait ≥ 2. Then the linear form\n−1 ∗\n−1 ∗\ne\nl0a\ne + . . . + lra\nr rar\n0 0a0\n\nvanishes along the kernel of Q0 : Qn+m → (K0 )Q and thus induces a linear form on (K0 )Q which\nseparates w − μ = Q0 (e) from the weight cone.\n\u0003\nWe turn to Cox rings of varieties with a complexity one torus action. They are obtained by\nsuitably downgrading the rings R(A, P0 ) as follows.\nConstruction 3.7. Fix r ∈ Z≥1 , a sequence n0 , . . . , nr ∈ Z≥1 , set n := n0 + . . . + nr , and fix\nintegers m ∈ Z≥0 and 0 < s < n + m − r. The input data are\n• a matrix A := [a0 , . . . , ar ] with pairwise linearly independent column vectors a0 , . . . , ar ∈\nK2 ,\n• an integral block matrix P of size (r + s) × (n + m) the columns of which are pairwise\ndifferent primitive vectors generating Qr+s as a cone:\n\u0012\n\u0013\nL0 0\nP =\n,\nd d′\nwhere d is an (s × n)-matrix, d′ an (s × m)-matrix and L0 an (r × n)-matrix build from\ni\ntuples li := (li1 , . . . , lini ) ∈ Zn≥1\nas in 3.1.\n\nLet P ∗ denote the transpose of P , consider the factor group K := Zn+m /im(P∗ ) and the projection\nQ : Zn+m → K. We define a K-grading on K[Tij , Sk ] by setting\ndeg(Tij ) := Q(eij ),\n\ndeg(Sk ) := Q(ek ).\n\nThe trinomials gI of 3.1 are K-homogeneous, all of the same degree. In particular, we obtain a\nK-graded factor ring\nR(A, P )\n\n:= K[Tij , Sk ; 0 ≤ i ≤ r, 1 ≤ j ≤ ni , 1 ≤ k ≤ m] / hgI ; I ∈ Ii.\n\nTheorem 3.8. See [13, Theorem 1.4]. With the notation of Construction 3.7, the following\nstatements hold.\n(i) The K-grading of the ring R(A, P ) is factorial, pointed and almost free, i.e. K is generated\nby any n + m − 1 of the deg(Tij ), deg(Sk ).\n(ii) The variables Tij and Sk define a system of pairwise nonassociated K-prime generators\nof R(A, P ).\nRemark 3.9. As rings R(A, P0 ) and R(A, P ) coincide but the K0 -grading is finer than the Kgrading. The downgrading map K0 → K fits into the following commutative diagram built from\nexact sequences\n0\n\u000f\nZs\n\n0\n0\n\n\u000f\n/ Zr\n\n0\n\n\u000f\n/ Zr+s\n\u000f\nZs\n\nP0∗\n\nP\n\n∗\n\n/ Zn+m\n/ Zn+m\n\nQ0\n\nQ\n\n\u000f\n/ K0\n\n/0\n\n\u000f\n/K\n\n/0\n\n\u000f\n0\n\n\u000f\n0\nThe snake lemma [15, Sec. III.9] allows us to identify the direct factor Zs of Zr+s with the kernel\nof the downgrading map K0 → K. Note that for the quasitori T , H0 and H associated to abelian\ngroups Zs , K0 and K we have T = H0 /H.\n\n\fTHE AUTOMORPHISM GROUP OF A VARIETY WITH TORUS ACTION\n\n11\n\nConstruction 3.10. Consider a ring R(A, P ) with its K-grading and the finer K0 -grading. Then\nb ⊆ X be a\nthe quasitori H = Spec K[K] and H0 := Spec K[K0 ] act on X := Spec R(A, P ). Let X\nbig H0 -invariant open subset with a good quotient\nb → X = X/\nb /H\np: X\n\nsuch that X is complete and for some open set U ⊆ X, the inverse image p−1 (U ) ⊆ X is big and\nH acts freely on U . Then X is a Mori dream space of dimension s + 1 with divisor class group\nCl(X) ∼\n= K and Cox ring R(X) ∼\n= R(A, P ). Moreover, X comes with an induced effective action\nof the s-dimensional torus T := H0 /H.\nRemark 3.11. Let X be a T -variety arising from data A and P via Construction 3.10. Then\nevery Tij ∈ R(A, P ) defines an invariant prime divisor Dij = T *xij in X such that the isotropy\ngroup Txij is cyclic of order lij and the class of dij ∈ Zs in (Z/lij Z)s is the weight vector of the\ntangent presentation of Txij at xxij . Moreover, each Sk defines an invariant prime divisor Ek ⊆ X\nsuch that the one-parameter subgroup K∗ → T corresponding to d′k ⊆ Zs acts trivially on Ek .\nTheorem 3.12. Let X be an n-dimensional complete normal rational variety with an effective\naction of an (n − 1)-dimensional torus S. Then X is equivariantly isomorphic to a T -variety\narising from data (A, P ) as in 3.10.\nProof. We may assume that X is not a toric variety. According to [13, Theorem 1.5], the Cl(X)graded Cox ring of X is isomorphic to a K-graded ring R(A, P ). Thus, in the notation of 3.10,\nb /H. Applying [24, Cor. 2.3] to a\nb of X with X ∼\nthere is a big H-invariant open subset X\n= X/\nb\nsubtorus T0 ⊆ H0 projecting onto T = H0 /H, we see that X is even invariant under H0 . Thus, T\nacts on X. Since the T -action is conjugate in Aut(X) to the given S-action on X, the assertion\nfollows.\n\u0003\nExample 3.13 (The E6 -singular cubic II). Let r = 2, n0 = 2, n1 = n2 = 1, m = 0, s = 1 and\nconsider the data\n\n\n\u0014\n\u0015\n−1 −3 3 0\n0 −1 1\nA =\n,\nP =  −1 −3 0 2  .\n1 −1 0\n−1 −2 1 1\n\nThen, as remarked before, we have exactly one triple I = (1, 2, 3) and, as a ring, R(A, P ) is given\nby\nR(A, P )\n\n3\n3\n2\n= K[T01 , T02 , T11 , T21 ] / hT01 T02\n+ T11\n+ T21\ni.\n\nThe grading group K = Z4 /im(P ∗ ) is isomorphic to Z and the grading can be given explicitly via\ndeg(T01 ) = 3,\n\ndeg(T02 ) = 1,\n\ndeg(T11 ) = 2,\n\ndeg(T21 ) = 3.\n\nAs shown for example in [10], see also [12, Example 3.7], the ring R(A, P ) is the Cox ring of the\nE6 -singular cubic surface in the projective space given by\nX = V (z1 z22 + z2 z02 + z33 ) ⊆ P3 .\n4. Primitive locally nilpotent derivations\nHere, we investigate the homogeneous locally nilpotent derivations of the K0 -graded algebra\nR(A, P0 ). The description of the \"primitive\" ones given in Theorem 4.3 is the central algebraic tool\nfor our study of automorphism groups. As before, K is an algebraically closed field of characteristic\nzero.\nLet us briefly recall the necessary background. We consider derivations on an integral K-algebra\nR, that means K-linear maps δ : R → R satisfying the Leibniz rule\nδ(f g) = δ(f )g + f δ(g).\n\n\f12\n\nI. ARZHANTSEV, J. HAUSEN, E. HERPPICH, AND A. LIENDO\n\nAny such δ : R → R extends uniquely to a derivation δ : Q(R) → Q(R) of the quotient field. Recall\nthat a derivation δ : R → R is said to be locally nilpotent if for every f ∈ R there is an n ∈ N with\nδ n (f ) = 0. Now suppose that R is graded by a finitely generated abelian group:\nM\nR =\nRw .\nw∈K\n\nA derivation δ : R → R is called homogeneous if for every w ∈ K there is a w′ ∈ K with\nδ(Rw ) ⊆ Rw′ . Any homogeneous derivation δ : R → R has a degree deg(δ) ∈ K satisfying\nδ(Rw ) ⊆ Rw+deg(δ) for all w ∈ K.\nDefinition 4.1. Let K be a finitely generated abelian group, R = ⊕K Rw a K-graded K-algebra\nand Q(R)0 ⊆ Q(R) the subfield of all fractions f /g of homogeneous elements f, g ∈ R with\ndeg(f ) = deg(g).\n(i) We call a homogeneous derivation δ : R → R primitive if deg(δ) does not lie in the weight\ncone ω ⊆ KQ of R.\n(ii) We say that a homogeneous derivation δ : R → R is of vertical type if δ(Q(R)0 ) = 0 holds\nand of horizontal type otherwise.\nConstruction 4.2. Notation as in Construction 3.1. We define derivations of the K0 -graded\nalgebra R(A, P0 ) constructed there. The input data are\n• a sequence C = (c0 , . . . , cr ) with 1 ≤ ci ≤ ni ,\n• a vector β ∈ Kr+1 lying in the row space of the matrix [a0 , . . . , ar ].\nNote that for 0 6= β as above either all entries differ from zero or there is a unique i0 with βi0 = 0.\nAccording to these cases, we put further conditions and define:\n(i) if all entries β0 , . . . , βr differ from zero and there is at most one i1 with li1 ci1 > 1, then\nwe set\n\nl\n∂Tkk\n Q\n,\nj = ci ,\nβi k6=i ∂Tkc\nδC,β (Tij ) :=\nk\n0,\nj 6= ci ,\nδC,β (Sk ) :=\n\n0 for k = 1, . . . , m,\n\n(ii) if βi0 = 0 is the unique zero entry of β and there is at most one i1 with i1 6= i0 and\nli1 ci1 > 1, then we set\n\nl\n∂Tkk\n Q\nβi k6=i,i0 ∂Tkc\n,\nj = ci ,\nδC,β (Tij ) :=\nk\n0,\nj=\n6 ci ,\nδC,β (Sk ) :=\n\n0 for k = 1, . . . , m.\n\nThese assignments define K0 -homogeneous primitive locally nilpotent derivations δC,β : R(A, P0 ) →\nR(A, P0 ) of degree\n(\nP\nrμ − k deg(Tkck ),\nin case (i),\ndeg(δC,β ) =\nP\nin case (ii).\n(r − 1)μ − k6=i0 deg(Tkck ),\nProof. The assignments (i) and (ii) on the variables define a priori derivations of the polynomial\nring K[Tij , Sk ]. Recall from 3.1 that R(A, P0 ) is the quotient of K[Tij , Sk ] by the ideal generated\nby all\n\u0014 li\nli\nli \u0015\n1\nTi2 2 Ti3 3 ,\ngI = det Ti1\nai3\nai2\nai1\nwhere I = (i1 , i2 , i3 ). Since the vector β lies in the row space of [a0 , . . . , ar ], we see that δC,β sends\nevery trinomial gI to zero and thus descends to a well defined derivation of R(A, P0 ).\n\n\fTHE AUTOMORPHISM GROUP OF A VARIETY WITH TORUS ACTION\n\n13\n\nWe check that δC,β is homogeneous. Obviously, every δC,β (Tij ) is a K0 -homogeneous element\nof K[Tij ]. Moreover, with the degree μ of the relations gI , we have\n(\nP\nin case (i),\nrμ − k deg(Tkck ),\ndeg(δC,β (Tij )) − deg(Tij ) =\nP\nin case (ii).\n(r − 1)μ − k6=i0 deg(Tkck ),\n\nIn particular, the left hand side does not depend on (i, j). We conclude that δC,β is homogeneous\nof degree deg(δC,β (Tij )) − deg(Tij ).\nFor primitivity, we have to show that the degree of δC,β does not lie in the weight cone of\nR(A, P0 ). We exemplarily treat case (i), where we may assume that i1 = 0 holds. As seen before,\nthe degree of δC,β is represented by the vector\nX\nX\nlrj erj ∈ Zn+m .\nl1j e1j + . . . +\nvC,β := −e0c0 +\nj6=c1\n\nj6=cr\n\nn+m\n\nThus, we look for a linear form on Q\nseparating this vector from the orthant cone(eij , ek ) and\nvanishing along the kernel of Qn+m → (K0 )Q , i.e. the linear subspace spanned by the columns of\nP0∗ . For example, we may take\n−1 ∗\n−1 ∗\n−1 ∗\ne .\ne + . . . + lrc\ne + l1c\nl0c\nr rcr\n1 1c1\n0 0c0\n\nFinally, we show that δC,β is locally nilpotent. If lici = 1 holds for all i, then δC,β (Tij ) is a\n2\nproduct of variables from the kernel of δC,β and thus δC,β\nannihilates all generators. If l0c0 > 1\nholds, then we have\n2\nδC,β\n(T0c0 ) = 0,\n\nl\n\nδC,β (Tici ) = T0c0c00\n\n−1\n\nhi ,\nl0c +1\n\nwhere i ≥ 1 and hi lies in the kernel of δC,β . Putting all together, we obtain that δC,β0\nall generators Tij and thus δC,β is locally nilpotent.\n\nannihilates\n\u0003\n\nTheorem 4.3. Let δ : R(A, P0 ) → R(A, P0 ) be a nontrivial primitive K0 -homogeneous locally\nnilpotent derivation.\n(i) If δ is of vertical type, then δ(Tij ) = 0 holds for all i, j and there is a k0 such that δ(Sk0 )\ndoes not depend on Sk0 and δ(Sk ) = 0 holds for all k 6= k0 .\n(ii) If δ is of horizontal type, then we have δ = hδC,β , where δC,β is as in 4.2 and h is\nK0 -homogeneous with h ∈ ker(δC,β ).\nIn the proof of this theorem we will make frequently use of the following facts; the statements\nof the first Lemma occur in Freudenburg's book, see [8, Principles 1, 5 and 7, Corollary 1.20].\nLemma 4.4. Let R be an integral K-algebra, δ : R → R a locally nilpotent derivation and let\nf, g ∈ R.\n(i) If f g ∈ ker(δ) holds, then f, g ∈ ker(δ) holds.\n(ii) If δ(f ) = f g holds, then δ(f ) = 0 holds.\n(iii) The derivation f δ is locally nilpotent if and only if f ∈ ker(δ) holds.\n(iv) If g | δ(f ) and f | δ(g), then δ(f ) = 0 or δ(g) = 0.\nLemma 4.5. Let δ : R(A, P0 ) → R(A, P0 ) be a primitive K0 -homogeneous derivation induced by\nb I ) = 0 holds for all relations\na K0 -homogeneous derivation δb: K[Tij , Sk ] → K[Tij , Sk ]. Then δ(g\ngI .\n\nb ⊆ a for the ideal a ⊆ K[Tij , Sk ] generated by the gI . Recall that all\nProof. Clearly, we have δ(a)\nb is not in the weight cone. Thus,\ngI are of the same degree μ. By primitivity, deg(δ) = deg(δ)\nb\nK[Tij ]μ+deg(δ)\n\u0003\nb ∩ a = {0} holds. This implies δ(gI ) = 0.\n\nProof of Theorem 4.3. Suppose that δ is of vertical type. Then δ(Tili /Tsls ) = 0 holds for any two\n0 ≤ i < s ≤ r. By the Leibniz rule, this implies\nδ(Tili )Tsls\n\n= Tili δ(Tsls ).\n\n\f14\n\nI. ARZHANTSEV, J. HAUSEN, E. HERPPICH, AND A. LIENDO\n\nWe conclude that Tili divides δ(Tili ) and Tsls divides δ(Tsls ). By Lemma 4.4 (ii), this implies\nδ(Tili ) = δ(Tsls ) = 0. Using Lemma 4.4 (i), we obtain δ(Tij ) = 0 for all variables Tij . Since δ is\nnontrivial, we should have δ(Sk0 ) 6= 0 at least for one k0 . Consider the basis ek = deg(Sk ) of Zm ,\nwhere k = 1, . . . , m, and write\ndeg(δ) = w′ +\n\nm\nX\n\nbk ek ,\n\nwhere\n\nw ′ ∈ K0\n\nand bk ∈ Z.\n\nk=1\n\nP\nThen deg(δ(Sk0 )) = w′ + k6=k0 bk ek + (bk0 + 1)ek0 . By Lemma 4.4, the variable Sk0 does not\ndivide δ(Sk0 ). This and the condition δ(Sk0 ) 6= 0 imply bk0 = −1 and bk ≥ 0 for k 6= k0 . This\nproves that δ(Sk ) = 0 for all k 6= k0 and δ(Sk0 ) is K0 -homogeneous and does not depend on Sk0 .\nNow suppose that δ is of horizontal type. Then there exists a variable Tij with δ(Tij ) 6= 0.\nWrite\nm\nX\n′\ndeg(δ(Tij )) = deg(Tij ) + w +\nbk ek .\nk=1\n\nThen all coefficients bk are nonnegative and consequently we obtain δ(Sk ) = 0 for k = 1, . . . , m.\nWe show that for any Tili there is at most one variable Tij with δ(Tij ) 6= 0. Assume that we\nfind two different j, k with δ(Tij ) 6= 0 and δ(Tik ) 6= 0. Note that we have\n∂Tili\n∂Tili\nδ(Tij ),\nδ(Tik )\n∂Tij\n∂Tik\n\n∈\n\nR(A, P0 )μ+deg(δ) .\n\nBy Proposition 3.5, the component of degree μ + deg(δ) is of dimension one. Thus, the above two\nlik\nterms differ by a nonzero scalar and we see that Tik\ndivides the second term. Consequently, Tik\nmust divide δ(Tik ) which contradicts 4.4 (ii).\nA second step is to see that for any two variables Tij and Tks with δ(Tij ) 6= 0 and δ(Tks ) 6=\n0 we must have lij = 1 or lks = 1. Otherwise, we see as before that ∂Tili /∂Tij δ(Tij ) and\n∂Tklk /∂Tks δ(Tks ) differ by a nonzero scalar. Thus, we conclude δ(Tij ) = f Tks and δ(Tks ) = hTij ,\na contradiction to 4.4 (iv).\nFinally, we prove the assertion. As already seen, for every 0 ≤ k ≤ r there is at most one ck with\nδ(Tkck ) 6= 0. Let K ⊆ {0, . . . , r} denote the set of all k admitting such a ck . From Proposition 3.5\nwe infer R(A, P )μ+deg(δ) = Kf with some nonzero element f . We claim that\nf = h\n\nY ∂T lk\nk\n,\n∂Tkck\n\nδ(Tici ) = βi h\n\nk∈K\n\nY\n\nk∈K\\{i}\n\n∂Tklk\n,\n∂Tkck\n\nhold with a homogeneous element h ∈ R(A, P ) and scalars β0 , . . . , βr ∈ K. Indeed, similar to the\nprevious arguments, the first equation follows from fact that all ∂Tklk /∂Tkck δ(Tkck ) are nonzero\nelements of the same degree as f and hence each ∂Tklk /∂Tkck must divide f . The second equation\nis clear then.\nThe vector β := (β0 , . . . , βr ) lies in the row space of the matrix A. To see this, consider the lift\nof δ to K[Tij , Sk ] defined by the second equation and apply Lemma 4.5. Now let C = (c0 , . . . , cr )\nbe any sequence completing the ck , where k ∈ K. Then we have δ = hδC,β . The fact that h\nbelongs to the kernel of δC,β follows from Lemma 4.4.\n\u0003\nExample 4.6 (The E6 -singular cubic III). Situation as in 3.3. The locally nilpotent primitive\nhomogeneous derivations of R(A, P0 ) of the form δC,β are the following\n(i) C = (1, 1, 1) and β = (β0 , 0, −β0 ). Here we have deg(δC,β ) = (3, 0) and\nδC,β (T01 ) = 2β0 T21 ,\n\n3\n,\nδC,β (T21 ) = −β0 T02\n\nδC,β (T02 ) = δC,β (T11 ) = 0.\n\n(ii) C = (1, 1, 1) and β = (β0 , −β0 , 0). Here we have deg(δC,β ) = (3, 1) and\n2\nδC,β (T01 ) = 3β0 T11\n,\n\n3\nδC,β (T11 ) = −β0 T02\n,\n\nδC,β (T02 ) = δC,β (T21 ) = 0.\n\n\fTHE AUTOMORPHISM GROUP OF A VARIETY WITH TORUS ACTION\n\n15\n\nThe general locally nilpotent primitive homogeneous derivation δ of R(A, P0 ) has the form hδC,β\nwith h ∈ ker(δC,β ), and\ndeg(δ) = deg(h) + deg(δC,β ) ∈\n/ ω.\nIn the above case (i), the only possibilities for deg(h) are deg(h) = (k, k) or deg(h) = (k, k) + (0, 2)\nand thus we have\nk\nk\nδ = T02\nδC,β or δ = T02\nT11 δC,β .\nIn the above case (ii), the only possibility for deg(h) is deg(h) = (k, k) and thus we obtain\nk\nδ = T02\nδC,β .\n\n5. Demazure roots\nHere we present and prove the main result, Theorem 5.5. It describes the root system of the\nautomorphism group of a rational complete normal variety X coming with an effective torus action\nT × X → X of complexity one in terms of the defining matrix P of the Cox ring R(X) = R(A, P ),\nsee Construction 3.10 and Theorem 3.12.\nDefinition 5.1. Let A, P be as in Construction 3.7. We say that R(A, P ) is minimally presented\nif r ≥ 2 holds and for every 0 ≤ i ≤ r we have li1 + . . . + lini ≥ 2\nThe assumption that R(A, P ) is minimally presented means that the resulting variety is nontoric\nand there occur no linear monomials in the defining relations gI ; the latter can always be achieved\nby omitting redundant generators.\nDefinition 5.2. Let P be a matrix as in Construction 3.7. Denote by vij , vk ∈ N = Zr+s the\ncolumns of P and by M the dual lattice of N .\n(i) A vertical Demazure P -root is a tuple (u, k0 ) with a linear form u ∈ M and an index\n1 ≤ k0 ≤ m satisfying\nhu, vij i ≥\n\n0\n\nfor all i, j,\n\nhu, vk i ≥\nhu, vk0 i =\n\n0\n−1.\n\nfor all k 6= k0 ,\n\n(ii) A horizontal Demazure P -root is a tuple (u, i0 , i1 , C), where u ∈ M is a linear form,\ni0 6= i1 are indices with 0 ≤ i0 , i1 ≤ r, and C = (c0 , . . . , cr ) is a sequence with 1 ≤ ci ≤ ni\nsuch that\nlici\n\n=\n\nhu, vici i =\n\nhu, vij i ≥\nhu, vk i ≥\ns\n\n1\n(\n\n0,\n−1,\n\n\nlij ,\n0,\n\n\n0,\n\n0\n\nfor all i 6= i0 , i1 ,\ni 6= i0 , i1 ,\ni = i1 ,\ni 6= i0 , i1 , j 6= ci ,\ni = i0 , i1 , j 6= ci ,\ni = i0 ,\nj = ci ,\nfor all k.\n\n(iii) The Z -part of a Demazure P -root κ = (u, k0 ) or κ = (u, i0 , i1 , C) is the tuple ακ of the\nlast s coordinates of the linear form u ∈ M = Zr+s . We call ακ also a P -root.\nNote that in the minimally presented case, the P -roots are by their defining conditions always\nnonzero.\nExample 5.3 (The E6 -singular cubic IV). As earlier, let r = 2, n0\ns = 1 and consider the data\n\n\u0014\n\u0015\n−1 −3\n0 −1 1\nA =\n,\nP =  −1 −3\n1 −1 0\n−1 −2\n\n= 2, n1 = n2 = 1, m = 0,\n3\n0\n1\n\n\n0\n2 .\n1\n\n\f16\n\nI. ARZHANTSEV, J. HAUSEN, E. HERPPICH, AND A. LIENDO\n\nThere are no vertical Demazure P -roots because of m = 0. There is a horizontal Demazure P -root\nκ = (u, i0 , i1 , C) given by\nu = (−1, −2, 3),\n\ni0 = 1,\n\ni1 = 2,\n\nC = (1, 1, 1).\ns\n\nA direct computation shows that this is the only one. The Z -part of κ is the third coordinate of\nthe linear form u, i.e. it is u3 = 3 ∈ Z = Zs .\nNote that the Demazure P -roots are certain Demazure roots [7, Section 3.1] of the fan with the\nrays through the columns of P as its maximal cones. In particular, there are only finitely many\nDemazure P -roots. For computing them explicitly, the following presentation is helpful.\nRemark 5.4. The Demazure P -roots are the lattice points of certain polytopes in MQ . For an\nexplicit description, we encode the defining conditions as a lattice vector ζ ∈ Zn+m and an affine\nsubspace η ⊆ MQ :\n(i) For any index 1 ≤ k0 ≤ m define a lattice vector ζ = (ζij , ζk ) ∈ Zn+m and an affine\nsubspace η ⊆ MQ by\nζij := 0 for all i, j,\n′\n\nζk := 0 for all k 6= k0 ,\n\nζk0 := −1,\n\n′\n\nη := {u ∈ MQ ; hu , vk0 i = −1} ⊆ MQ .\nThen the vertical Demazure P -roots κ = (u, k0 ) are given by the lattice points u of the\npolytope\nB(k0 ) := {u′ ∈ η; P ∗ u′ ≥ ζ} ⊆ MQ .\n(ii) Given i0 6= i1 with 0 ≤ i0 , i1 ≤ r and C = (c0 , . . . , cr ) with 1 ≤ ci ≤ ni such that lici = 1\nholds for all i 6= i0 , i1 , set\n\n\nlij , i 6= i0 , i1 , j 6= ci ,\nζk = 0 for 1 ≤ l ≤ m.\nζij := −1, i = i1 ,\nj = ci1 ,\n\n\n0\nelse,\nη := {u′ ∈ MQ ; hu′ , vici i = 0 for i 6= i0 , i1 , hu′ , vi1 ci1 i = −1, }.\n\nThen the horizontal Demazure P -roots κ = (u, i0 , i1 , C) are given by the lattice points u\nof the polytope\nB(i0 , i1 , C) := {u′ ∈ η; P ∗ u′ ≥ ζ} ⊆ MQ .\nIn order to state and prove the main result, let us briefly recall the necessary concepts from\nthe theory of linear algebraic groups G. One considers the adjoint representation of the torus T\non the Lie algebra Lie(G), i.e. the tangent representation at eG of the T -action on G given by\nconjugation (t, g) 7→ tgt−1 . There is a unique T -invariant splitting Lie(G) = Lie(T ) ⊕ n, where n\nis spanned by nilpotent vectors, and one has a bijection\n1-PASGT (G) → {T -eigenvectors of n},\n\nλ 7→ λ̇(0).\n\nHere 1-PASGT (G) denotes the set of one parameter additive subgroups λ : Ga → G normalized\nby T and λ̇ denotes the differential. A root of G with respect to T is an eigenvalue of the T representation on n, that means a character χ ∈ X(T ) with t * v = χ(t)v for some T -eigenvector\n0 6= v ∈ n.\nTheorem 5.5. Let A, P be as in Construction 3.7 such that R(A, P ) is minimally presented and\nlet X be a (nontoric) variety with a complexity one torus action T × X → X arising from A, P\naccording to Construction 3.10.\n(i) The automorphism group Aut(X) is a linear algebraic group with maximal torus T .\n(ii) Under the canonical identification X(T ) = Zs , the roots of Aut(X) with respect to T are\nprecisely the P -roots.\nThe rest of the section is devoted to the proof. We will have to deal with the K0 - and K-degrees\nof functions and derivations. It might be helpful to recall the relations between the gradings from\nRemark 3.9. The following simple facts will be frequently used.\n\n\fTHE AUTOMORPHISM GROUP OF A VARIETY WITH TORUS ACTION\n\n17\n\nLemma 5.6. In the setting of Constructions 3.1 and 3.7, consider the polynomial ring K[Tij , Sk ]\nwith the K0 -grading and the coarser K-grading.\nQ eij Q ek\n(i) For a monomial h =\nTij\nSk with exponent vector e = (eij , ek ), the K0 - and Kdegrees are given as\ndegK0 (h) = Q0 (e),\n(ii) A monomial h ∈\n\nK[Tij±1, Sk±1 ]\n\nh = hu :=\n\nY\n\ndegK (h) = Q(e).\n\nis of K-degree zero if and only if there is an u ∈ M with\nY P ∗ (u)\nY hu,v i Y hu,v i\nP ∗ (u)ij\nk\nTij\nSk\n=\nTij ij\nSk k .\n\n(iii) Let δ be a derivation on K[Tij , Sk ] sending the generators Tij , Sk to monomials. Then δ\nis K-homogeneous of K-degree zero if and only if\ndegK (Tij−1 δ(Tij )) = degK (Sk−1 δ(Sk )) = 0 holds for all i, j, k.\nIf 0 6= δ is K0 -homogeneous, then degK (δ) = 0 holds if and only if one of the Tij−1 δ(Tij )\nand Sk−1 δ(Sk ) is nontrivial of K-degree zero.\nAs a first step towards the roots of the automorphism group Aut(X), we now associate K0 homogeneous locally nilpotent derivations of R(A, P ) to the Demazure P -roots.\nConstruction 5.7. Let A and P be as in Construction 3.7. For u ∈ M and the lattice vector\nζ ∈ Zn+m of Remark 5.4 consider the monomials\nY hu,v i Y hu,v i\nY ζ Y ζ\nhu =\nTij ij\nSk k ,\nhζ :=\nTijij\nSkk .\ni,j\n\ni,j\n\nk\n\nk\n\nWe associate to any Demazure P -root κ a locally nilpotent derivation δκ of R(A, P ). If κ = (u, k0 )\nis vertical, then we define a δκ of vertical type by\n(\nSk0 hu , k = k0 ,\nδκ (Tij ) := 0 for all i, j,\nδκ (Sk ) :=\n0,\nk 6= k0 .\nIf κ = (u, i0 , i1 , C) is horizontal, then there is a unique vector β in the row space of A with βi0 = 0,\nβi1 = 1 and we define a δκ of horizonal type by\nhu\nδC,β .\nhζ\nis K0 -homogeneous; its K0 -degree is the Zs -part of κ and the\nδκ\n\n:=\n\nIn all cases, the derivation δκ\nK-degree is zero:\ndegK0 (δκ ) = Q0 (P ∗ (u)),\n\ndegK (δκ ) = 0.\n\nProof. In the vertical case δκ (Sk0 ) does not depend on Sk0 and in the horizontal case the factors\nbefore δC,β in the definitions of δκ are contained in ker(δC,β ). Thus, the derivations δκ are locally\nnilpotent. Clearly, the δκ are K0 -homogeneous. By Lemma 5.6, the monomial hu is of K0 -degree\nQ0 (P ∗ (u)). In the vertical case, this implies directly that δκ is of K0 -degree Q0 (P ∗ (u)). In the\nhorizontal case, we use Lemma 5.6 and the degree computation of Construction 4.2 to see that\nhζ and δC,β have the same K0 -degree. Thus δκ is of K0 -degree Q0 (P ∗ (u)). Since P ∗ (u) ∈ ker(Q)\nholds, we obtain that all δκ are of K-degree Q(P ∗ (u)) = 0.\n\u0003\nProposition 5.8. Consider a minimally presented algebra R(A, P ) with its fine K0 -grading and\nthe coarser K-grading and let δ be a K0 -homogeneous locally nilpotent derivation of K-degree zero\non R(A, P ).\n(i) If δ is of vertical type, then there is an index 1 ≤ k0 ≤ m such that δ is a linear\ncombination of derivations δκt with Demazure P -roots κt = (ut , k0 ).\n(ii) If δ is of horizontal type, then are indices 0 ≤ i0 , i1 ≤ r and a sequence C = (c0 , . . . , cr )\nsuch that δ is a linear combination of derivations δκt with Demazure P -roots κt =\n(ut , i0 , i1 , C).\n\n\f18\n\nI. ARZHANTSEV, J. HAUSEN, E. HERPPICH, AND A. LIENDO\n\nLemma 5.9. Let δ be a nontrivial K0 -homogeneous locally nilpotent derivation on a minimally\npresented algebra R(A, P ) and let r ≥ 2. If δ is of K-degree zero, then δ is primitive with respect\nto the K0 -grading.\nProof. We have to show that the K0 -degree w of δ does not lie in the weight cone of the K0 grading. First observe that w 6= 0 holds: otherwise Corollary 3.6 yields that δ annihilates all\ngenerators Tij and Sk , a contradiction to δ 6= 0. Now assume that w lies in the weight cone of the\nK0 -grading. Then, for some d > 0, we find a nonzero f ∈ R(A, P )dw . The K-degree of f equals\nzero and thus f is constant, a contradiction.\n\u0003\nProof of Proposition 5.8. First assume that δ is vertical. Lemma 5.9 tells us that δ is primitive\nwith respect to the K0 -grading. According to Theorem 4.3, there is an index 1 ≤ k0 ≤ m and an\nelement h ∈ R(A, P ) represented by a polynomial only depending on variables from ker(δ) such\nthat we have\nδ(Tij ) = 0 for all i, j,\n\nδ(Sk ) = 0 for all k 6= k0 ,\n\nδ(Sk0 ) = h.\n\nis K0 -homogeneous of K-degree zero. Lemma 5.6 shows that the monomials of hSk−1\nClearly,\n0\nu\nand\ndo\nnot\ndepend\non\nS\nwith\nu\n∈\nM\n.\nThe\nfacts\nthat\nthe\nmonomials\nh\nS\nare of the form hu Sk−1\nk\nk\n0\n0\n0\nhave nonnegative exponents yield the inequalities of a vertical Demazure P -root for each (u, k0 ).\nConsequently, δ is a linear combination of deriviations arising from vertical Demazure P -roots.\nWe turn to the case that δ is horizontal. Again by Lemma 5.9, our δ is primitive with respect to\nthe K0 -grading and by Theorem 4.3 it has the form hδC,β for some K0 -homogeneous h ∈ ker(δC,β ).\nBy construction, δC,β is induced by a homogeneous derivation of K[Tij , Sk ] having the same K0 and K-degrees; we denote this lifted derivation again by δC,β . Similarly, h is represented by a\npolynomial in K[Tij , Sk ] which we again denote by h.\nWe show that any monomial of h depends only on variables from ker(δC,β ). Indeed, suppose\nthat there occurs a monomial Tij h′ with δC,β (Tij ) 6= 0 in h. Then, using the fact that δ is of\nK-degree zero, we obtain\nhSk−1\n0\n\ndeg(Tij ) = deg(δ(Tij )) = deg(Tij ) + deg(h′ ) + deg(δC,β (Tij )).\nThis implies deg(h′ ) + deg(δC,β (Tij )) = 0; a contradiction to the fact that the weight cone of the\nK-grading contains no lines. This proves the claim. Thus, we may assume that the polynomial h\nis a monomial.\nThe next step is to see that it is sufficient to take derivations δC,β with a vector β in the row\nspace having one zero coordinate. Consider a general β, that means one with only nonvanishing\ncoordinates. By construction, the row space of A contains unique vectors β 0 and β 1 with β00 =\nβ11 = 0 and β = β 0 + β 1 . With these vectors, we have\nhδC,β\n\n= h\n\n∂T l1\n∂T0l0\nδC,β 0 + h 1 δC,β 1 .\n∂T0c0\n∂T1c1\n\nBy Construction 4.2, the K0 -degrees and thus the K-degrees of the left hand side and of the summands coincide. Moreover, h is a monomial in generators from ker(δC,β ) and any such generator\nis annihilated by δC,β 0 and by δC,β 1 too.\nLet e = (eij , ek ) denote the exponent vector of the monomial h. According to Lemma 5.6, the\ncondition that the (K0 -homogeneous) derivation δ has K-degree zero is equivalent to the fact that\nthe monomial\nY e Y\nY ∂T li\nei0 ci\nij\nek\n−1\ni\n0\nT\nT\n)\n=\nT\nhδ\n(T\nTi−1\nS\nβ\nC,β\ni1 ci1\ni1\nij\ni1 ci1 i0 ci0\nk\n1 ci1\n∂T\nic\ni\ni\nj6=ci\n\nk\n\ni6=i0 ,i1\n\nhas the form hu for some linear form u ∈ M . Taking into account that the exponents eij and ek\nare nonnegative, we see that these conditions are equivalent to equalities and inequalities in the\ndefinition of a horizontal Demazure P -root.\n\u0003\nWe recall the correspondence between locally nilpotent derivations and one parameter additive\nsubgroups. Consider any integral affine K-algebra R, where K is an algebraically closed field of\n\n\fTHE AUTOMORPHISM GROUP OF A VARIETY WITH TORUS ACTION\n\n19\n\ncharacteristic zero. Every locally nilpotent derivation δ : R → R gives rise to a rational representation ̺δ : Ga → Aut(R) of the additive group Ga of the field K via\n̺δ (t)(f ) := exp(tδ)(f ) :=\n\n∞ d\nX\nt\nd=0\n\nd!\n\nδ d (f ).\n\nThis sets up a bijection between the locally nilpotent derivations of R and the rational representations of Ga by automorphisms of R. The representation associated to a locally nilpotent derivation\nδ : R → R gives rise to a one parameter additive subgroup (1-PASG) of the automorphism group\nof X := Spec R:\nt 7→ Spec(̺δ (t)).\nλδ : Ga → Aut(X),\nNow suppose that R is graded by some finitely generated abelian group K0 and consider the\nassociated action of H0 := Spec K[K0 ] on X = Spec R. We relate homogeneity of locally nilpotent\nderivation δ to properties of the associated subgroup U δ := λδ (Ga ) of Aut(X).\nLemma 5.10. In the above setting, let δ be a locally nilpotent derivation on R. The following\nstatements are equivalent.\n(i) The derivation δ is K0 -homogeneous.\n(ii) One has hU δ h−1 = U δ for all h ∈ H0 .\nMoreover, if one of these two statements holds, then the degree w := deg(δ) ∈ K0 is uniquely\ndetermined by the property\nh̺δ (t)h−1 = ̺δ (χw (h)t) for all h ∈ H0 .\nProof of Theorem 5.5. Assertion (i) is clear by Corollary 2.4 and the fact that X is nontoric. We\nprove (ii). Consider R(A, P ) with its fine K0 -grading and the coarser K-grading. The quasitori\nH0 := Spec K[K0 ] and H := Spec K[K] act effectively on X = Spec R(A, P ). We view H0 and H\nas subgroups of Aut(X). For any locally nilpotent deriviation δ on R(A, P ) and U δ = λδ (Ga ),\nLemma 5.10 gives\nδ is K0 -homogeneous\nδ is K-homogeneous of degree 0\n\n⇐⇒\n⇐⇒\n\nhU δ h−1 = U δ for all h ∈ H0 ,\nhuh−1 = u for all h ∈ H, u ∈ U δ .\n\nb /H for an open H0 -invariant set X\nb ⊆ X. Moreover, the action of\nRecall that X arises as X = X/\nb → X equivariant. Set\nT = H0 /H on X is the induced one, i.e. it makes the quotient map p : X\nfor short\nG := CAut(X, H)0 ,\nG := Aut(X)0 .\nDenote by 1-PASGH0 (G) and 1-PASGT (G) the one parameter additive subgroups normalized by\nH0 and T respectively. Moreover, let LND(R(A, P ))0 denote the K-homogeneous locally nilpotent\nderivations of K-degree zero and LNDK0 (R(A, P ))0 the subset of K0 -homogeneous ones. Then\nwe arrive at a commutative diagram\nLNDK0 (R(A, P ))0\nO\n\n⊆\n\n∼\n=\n\n\u000f\n1-PASGH0 (G)\n\n∼\n=\n⊆\n\n\u000f\n1-PASG(G)\n\n⊆\n\n\u000f\n1-PASG(G)\n\np∗\n\n\u000f\n1-PASGT (G)\n\nLND(R(A, P ))0\nO\n\np∗\n\nConstruction 5.7 associates an element δκ ∈ LNDK0 (R(A, P ))0 to any Demazure P -root κ.\nGoing downwards the left hand side of the above diagram, the latter turns into an element λκ ∈\n1-PASGT (G). Differentiation gives the T -eigenvector λ̇κ (0) ∈ Lie(G) having as its associated root\nthe unique character χ of T satisfying\ntλκ (z)t−1 = λκ (χ(t)z)\n\nfor all t ∈ T, z ∈ K.\n\n\f20\n\nI. ARZHANTSEV, J. HAUSEN, E. HERPPICH, AND A. LIENDO\n\nRemark 3.9 and Lemma 5.10 show that under the identification X(T ) = Zs the character χ\nis just the Zs -part of the Demazure P -root κ. Proposition 5.8 tells us that any element of\nLNDK0 (R(A, P ))0 is a linear combination of derivations δκ arising from Demazure P -roots. Moreover, by Corollary 2.7, the push forward p∗ maps 1-PASGH0 (G) onto 1-PASGT (G). We conclude\nthat Lie(G) is spanned as a K-vector space by Lie(T ) and λ̇κ (0), where κ runs through the Demazure P -roots. Assertion (ii) follows.\n\u0003\nCorollary 5.11 (of proof). Let X be a nontoric normal complete rational variety with a torus\nb → X from R(A, P ) according\naction T ×X → X of complexity one arising as a good quotient p : X\nto Construction 3.10.\n\n(i) Every Demazure P -root κ induces an additive one parameter subgroup λκ = p∗ λδκ : Ga →\nAut(X).\n(ii) The Demazure P -root κ is vertical if and only if the general orbit of λκ is contained in\nsome T -orbit closure.\n(iii) The Demazure P -root κ is horizontal if and only if the general orbit of λκ is not contained\nin any T -orbit closure.\n(iv) The unit component Aut(X)0 of the automorphism group is generated by T and the images\nλκ (Ga ).\n\nProof. Assertions (i) and (iv) are clear by the proof of Theorem 5.5. For (ii) and (iii) recall that κ\nis vertical (horizontal) if and only if δκ is of vertical (horizontal) type. The latter is equivalent to\nsaying that λκ (Ga ) acts trivially (non-trivially) on the field of T -invariant rational functions. \u0003\nExample 5.12 (The E6 -singular cubic V). Let A and P as in Example 5.3. From there we infer\nthat R(A, P ) admits precisely one horizontal Demazure P -root. For the automorphism group\nof the corresponding surface X this means that Aut(X)0 is the semidirect product of K∗ and\nGa twisted via the weight 3, see again 5.3. In particular, the surface X is almost homogeneous.\nMoreover, in this case, one can show directly that the group of graded automorphisms of R(A, P )\nis connected. Thus, Theorem 2.1 yields that Aut(X) is the semidirect product of K∗ and Ga . This\nis in accordance with [23]; we would like to thank Antonio Laface for mentioning this reference to\nus.\n6. Almost homogeneous surfaces\nA variety is almost homogeneous if its automorphism group acts with an open orbit. We take\na closer look to this case with a special emphasis on almost homogeneous rational K∗ -surfaces of\nPicard number one. The first statement characterizes the almost homogeneous varieties coming\nwith a torus action of complexity one in arbitrary dimension.\nTheorem 6.1. Let X be a nontoric normal complete rational variety with a torus action T ×X →\nX of complexity one and Cox ring R(X) = R(A, P ). Then the following statements are equivalent.\n(i) The variety X is almost homogeneous.\n(ii) There exists a horizontal Demazure P -root.\nMoreover, if one of these statements holds, and R(A, P ) is minimally presented, then the number\nr − 1 of relations of R(A, P ) is bounded by\nr − 1 ≤\n\ndim(X) + rk(Cl(X)) − m − 2.\n\nProof. If (i) holds, then Aut(X) acts with an open orbit on X and by Corollary 5.11, there must\nbe a horizontal Demazure P -root κ. Conversely, if (ii) holds, then there is a horizontal Demazure\nP -root κ and Corollary 5.11 says that for U = p∗ (δκ (Ga )), the group T ⋉ U acts with an open\norbit on X.\nFor the supplement, recall first that R(A, P ) is a complete intersection with r − 1 necessary\nrelations and thus we have\nn + m − (r − 1) = dim(R(A, P )) = dim(X) + rk(Cl(X)).\n\n\fTHE AUTOMORPHISM GROUP OF A VARIETY WITH TORUS ACTION\n\n21\n\nNow observe that any relation gI involving only three variables prevents existence of a horizontal\nDemazure P -root. Consequently, by suitably arranging the relations, we have n0 , n1 ≥ 1 and\nni ≥ 2 for all i ≥ 2. Thus, n ≥ 2 + 2(r − 1) holds and the assertion follows.\n\u0003\nWe specialize to dimension two. Any normal complete rational K∗ -surface X is determined\nby its Cox ring and thus is given up to isomorphism by the defining data A and P of the ring\nR(X) = R(A, P ); we also say that the K∗ -surface X arises from A and P and refer to [12, Sec. 3.3]\nfor more background. A first step towards the almost homogeneous X is to determine possible\nhorizontal Demazure P -roots in the following setting.\nProposition 6.2. Consider integers l02 ≥ 1, l11 ≥ l21 ≥ 2 and d01 , d02 , d11 , d21 such that the\nfollowing matrix has pairwise different primitive columns generating Q3 as a convex cone:\n\n\n−1 −l02 l11\n0\nP :=  −1 −l02\n0 l21  .\nd01\nd02 d11 d21\n\nMoreover, assume that P is positive in the sense that det(P01 ) > 0 holds, where P01 is the 3 × 3\nmatrix obtained from P by deleting the first column. Then the possible horizontal Demazure P roots are\n\u0010\n\u0011\nα+1\nα+1\n(i) κ = (u, 1, 2, (1, 1, 1)), where u = d01 α + d21l21\n, − d21l21\n, α with an integer α satisfying\nl11\nl02\n≤ α ≤ −\n,\nl21 | d21 α + 1,\nd02 − l02 d01\nl21 d11 + l11 d21 + d01 l11 l21\n\u0011\n\u0010\nα+1\nα+1\n, − d21l21\n, α with an integer\n(ii) if l02 = 1: κ = (u, 1, 2, (2, 1, 1)), where u = d02 α + d21l21\nα satisfying\nl11\n1\nl21 | d21 α + 1,\n−\n≤ α ≤\n,\nl21 d11 + l11 d21 + d02 l11 l21\nd01 − d02\n\u0011\n\u0010\nα+1\nα+1\n, d01 α + d11l11\n, α with an integer α satisfy(iii) κ = (u, 2, 1, (1, 1, 1)), where u = − d11l11\ning\nl21\nl02\n≤ α ≤ −\n,\nl11 | d11 α + 1,\nd02 − l02 d01\nl21 d11 + l11 d21 + d01 l11 l21\n\u0011\n\u0010\nα+1\nα+1\n, d02 α + d11l11\n, α with an integer\n(iv) if l02 = 1: κ = (u, 2, 1, (2, 1, 1)), where u = − d11l11\nα satisfying\nl21\n1\nl11 | d11 α + 1,\n−\n≤ α ≤\n.\nl21 d11 + l11 d21 + d02 l11 l21\nd01 − d02\nProof. In the situation of (i), evaluating the general linear form u = (u1 , u2 , u3 ) on the columns\nof P gives the following conditions for a Demazure P -root:\n−u1 − u2 + u3 d01 = 0,\n\nu2 l21 + u3 d21 = −1,\n\n−u1 l02 − u2 l02 + u3 d02 ≥ l02 ,\nu1 l11 + u3 d11 ≥ 0.\nResolving the equations for u1 , u2 and plugging the result into the inequalities gives the desired\nroots with α := u3 . The other cases are treated analogously.\n\u0003\nCorollary 6.3. The nontoric almost homogeneous normal complete rational K∗ -surfaces X of\nPicard number one are precisely the ones arising from data\n\n\n\u0014\n\u0015\n−1 −l02 l11\n0\n0 −1 1\n0 l21 \nA =\n,\nP =  −1 −l02\n1 −1 0\nd01\nd02 d11 d21\nas in 6.2 allowing an integer α according to one of the Conditions 6.2 (i) to (iv). In particular,\nthe Cox ring of X is given as\nR(X)\n\nl02\nl11\nl21\n= K[T01 , T02 , T11 , T21 ] / hT01 T02\n+ T11\n+ T21\ni\n\n\f22\n\nI. ARZHANTSEV, J. HAUSEN, E. HERPPICH, AND A. LIENDO\n\nwith the grading by Z4 /im(P ∗ ). Moreover, the anticanonical divisor of X is ample, i.e. X is a del\nPezzo surface.\nProof. As any surface with finitely generated Cox ring, X is Q-factorial. Since X has Picard\nnumber one, the divisor class group Cl(X) is of rank one. Now take a minimal presentation\nR(X) = R(A, P ) of the Cox ring. Then, according to Theorem 6.1, we have m = 0 and there\nis exactly one relation in R(A, P ). Thus P is a 3 × 4 matrix. Moreover, Theorem 6.1 says that\nthere is a horizontal Demazure P -root. Consequently, one of the exponents l01 and l02 must equal\none, say l01 . Fixing a suitable order for the last two variables we ensure l11 ≥ l21 . Passing to the\nK∗ -action t−1 * x instead of t * x if necessary, we achieve that P is positive in the sense of 6.2.\nLet us see why X is a del Pezzo surface. Denote by Pij the matrix obtained from P by deleting\nthe column vij . Then, in Cl(X)0 = Z, the factor group of Cl(X) by the torsion part, the weights\n0\nwij\nof Tij are given up to a factor α as\n0\n0\n0\n0\n, w11\n, w21\n) =\n(w01\n, w02\n\nα(det(P01 ), − det(P02 ), det(P11 ), − det(P21 )).\n\nAccording to [1, Prop. III.3.4.1], the class of the anticanonical divisor in Cl(X)0 is given as the\n0\nminus the degree of the relation. The inequalities on the lij , dij implied by the\nsum over all wij\nexistence of an integer α as in 6.2 (i) to (iv) show that the anticanonical class is positive (note\nthat α rules out).\n\u0003\nWe turn to the case of precisely one singular point. The diophantic aspect of Conditions 6.2 (i)\nto (iv) on existence of Demazure P -roots then disappears: there is no divisibility condition any\nmore.\nConstruction 6.4 (K∗ -surfaces with one singularity). Consider a triple (l0 , l1 , l2 ) of integers\nsatisfying the following conditions:\nl0 ≥ 1,\n\nl1 ≥ l2 ≥ 2,\n\nl0 < l1 l2 ,\n\ngcd(l1 , l2 ) = 1.\n\nLet (d1 , d2 ) be the (unique) pair of integers with d1 l2 + d2 l1 = −1 and 0\nthe data\n\n\u0014\n\u0015\n−1 −l0 l1\n0 −1 1\nA =\n,\nP =  −1 −l0\n0\n1 −1 0\n0\n1 d1\n\n≤ d2 < l2 and consider\n\n0\nl2 \nd2\n4\n∗ ∼\nThen the associated ring R(l0 , l1 , l2 ) := R(A, P ) is graded by Z /im(P ) = Z, and is explicitly\ngiven by\nR(l0 , l1 , l2 ) = K[T1 , T2 , T3 , T4 ]/hT1 T2l0 + T3l1 + T4l2 i,\ndeg(T1 ) = l1 l2 − l0 ,\n\ndeg(T2 ) = 1,\n\ndeg(T3 ) = l2 ,\n\ndeg(T4 ) = l1 .\n\nProposition 6.5. For the K∗ -surface X = X(l0 , l1 , l2 ) with Cox ring R(l0 , l1 , l2 ), the following\nstatements hold:\n(i) X is nontoric and we have Cl(X) = Z,\n(ii) X comes with precisely one singularity,\n(iii) X is a del Pezzo surface if and only if l0 < l1 + l2 + 1 holds,\n(iv) X is almost homogeneous if and only if l0 ≤ l1 holds.\nMoreover, any normal complete rational nontoric K∗ -surface of Picard number one with precisely\none singularity is isomorphic to some X(l0 , l1 , l2 ).\nProof. First note that X = X(l0 , l1 , l2 ) is obtained as in Construction 3.10: the group HX = K∗\nacts on K4 by\nt*z\n\n= (tl1 l2 −l0 z1 , tz2 , tl2 z3 , tl1 z4 ),\n\nthe total coordinate space X := V (T1 T2l0 + T3l1 + T4l2 ) is invariant under this action and we have\nb = X \\ {0},\nX\n\nb ∗.\nX = X/K\n\nThus, Cl(X) = Z holds and, since the Cox ring R(X) = R(l0 , l1 , l2 ) is not a polynomial ring, X\nis nontoric.\n\n\fTHE AUTOMORPHISM GROUP OF A VARIETY WITH TORUS ACTION\n\n23\n\nUsing [1, Prop. III.3.1.5], we show that the sest of singular points of X consists of the image\nb under the quotient map X\nb → X. If l1 l2 − l0 > 1 holds, then\nx0 ∈ X of the point (1, 0, 0, 0) ∈ X\nthe local divisor class group\nCl(X, x0 ) =\n\nZ/(l1 l2 − l0 )Z\n\nis nontrivial and thus x0 ∈ X singular. If l1 l2 − l0 = 1 holds, then we have l0 > 1 and therefore\nb and hence x0 ∈ X is singular. Since all other local divisor class groups of X are\n(1, 0, 0, 0) ∈ X\nb lie in the orbit K∗ * (1, 0, 0, 0), we conclude that\ntrivial and, moreover, all singular points of X\nx0 ∈ X is the only singular point.\nAccording to [1, Prop. III.3.4.1], the anticanonical class of X is l1 + l2 + 1 − l0 . This proves (iii).\nFinally, for (iv), we infer from Proposition 6.2 that existence of a horizontal Demazure P -root is\nequivalent to existence of an integer α with l0 ≤ α ≤ l1 which in turn is equivalent to l0 ≤ l1 .\nWe come to the supplement. The surface X arises from a ring R(A, P ), where we may assume\nthat R(A, P ) is minimally presented. The first task is to show that n = 4, m = 0 and r = 2 holds.\nWe have\nn + m − (r − 1) = dim(X) + rk(Cl(X)) = 3.\nAny relation gI involving only three variables gives rise to a singularity in the source and a\nsingularity in the sink of the K∗ -action. We conclude that at most two of the monomials occuring\nin the relations may depend only on one variable. Thus, the above equation shows that n = 4,\nm = 0 and r = 2 hold.\nl01 l02\nl11\nl21\nWe may assume that the defining equation is of the form T01\nT02 + T11\n+ T21\n. Again, since\none of the two elliptic fixed points must be smooth, we can conclude that one of l0j equals one,\nsay l01 . Now it is a direct consequence of the description of the local divisor class groups given\nin [1, Prop. III.3.1.5] that a K∗ -surface with precisely one singularity arises from a matrix P as in\nthe assertion.\n\u0003\nNow we look at the log terminal ones of the X(l0 , l1 , l2 ); recall, that a singularity is log terminal if\nall its resolutions have discrepancies bigger than −1. Over C, the log terminal surface singularities\nare precisely the quotient singularities by subgroups of GL2 (C), see for example [18, Sec. 4.6]. The\nGorenstein index of X is the minimal positive integer ı(X) such that ı(X) times the canonical\ndivisor KX is Cartier.\nCorollary 6.6. Assume that X = X(l1 , l2 , l3 ) is log terminal. Then we have the following three\ncases:\n(i) the surface X is almost homogeneous,\n(ii) the singularity of X is of type E7 ,\n(iii) the singularity of X is of type E8 .\nMoreover, for the almost homogenoeus surfaces X = X(l1 , l2 , l3 ) of Gorenstein index ı(X) = a,\nwe have\n(i) (l0 , l1 , l2 ) = (1, l1 , l2 ) with the bounds l2 ≤ l1 ≤ 2a2 + 34 a,\n(ii) (l0 , l1 , l2 ) = (2, l1 , 2) with the bound l1 ≤ 3a + 2,\n(iii) (l0 , l1 , l2 ) = (3, 3, 2), (2, 4, 3), (2, 5, 3), (3, 5, 2).\nProof. The condition that X is log terminal means that the number l0 l1 l2 is bounded by l0 l1 +\nl0 l2 + l1 l2 ; this can be seen by explicitly performing the canonical resolution of singularities of\nX(l0 , l1 , l2 ), see [12, Sec. 3]. Thus, the allowed (l0 , l1 , l2 ) must be platonic triples and we are left\nwith\n(1, l1 , l2 ), (2, l1 , 2), (3, 3, 2), (2, 4, 3), (2, 5, 3), (3, 5, 2), (4, 3, 2), (5, 3, 2).\nThe last two give the surfaces with singularities E7 , E8 and in all other cases, the resulting surface\nis almost homogeneous by Proposition 6.5. The Gorenstein condition says that aKX lies in the\nPicard group. According to [1, Cor. III.3.1.6], this is equivalent to the fact that l1 l2 − l0 divides\na * (l1 + l2 + 1 − l0 ). The bounds then follow by elementary estimations.\n\u0003\n\n\f24\n\nI. ARZHANTSEV, J. HAUSEN, E. HERPPICH, AND A. LIENDO\n\nCorollary 6.7. The following tables list the triples (l0 , l1 , l2 ) together with roots of Aut(X) for\nthe log terminal almost homogeneous complete rational K∗ -surfaces X = X(l0 , l1 , l2 ) with precisely\none singularity up to Gorenstein index ı(X) = 5.\nı(X) = 2\nı(X) = 1\n(1, 3, 2) : {1, 2, 3} (1, 7, 3) : {1, 3, 4, 7}\n(2, 3, 2) : {2, 3}\n(3, 3, 2) : {3}\n\nı(X) = 3\n(2, 7, 2) : {2, 3, 5, 7}\n(1, 13, 4) : {1, 4, 5, 9, 13}\n(1, 8, 5) : {3, 5, 8}\n\nı(X) = 5\nı(X) = 4\n(2, 5, 2) : {2, 3, 5}\n(2, 11, 2) : {2, 3, 5, 7, 9, 11}\n(1, 21, 5) : {1, 5, 6, 11, 16, 21} (1, 13, 7) : {2, 6, 13}\n(2, 4, 3) : {3, 4}\n(1, 17, 3) : {2, 3, 5, 8, 11, 14, 17}\n(1, 31, 6) : {1, 6, 7, 13, 19, 25, 31}\n(1, 18, 7) : {4, 7, 11, 18}\n7. Structure of the semisimple part\nWe describe the root system of the semisimple part of the automorphism group of a nontoric\nnormal complete rational variety admitting a torus action of complexity one. Let us first recall\nthe necessary background on semisimple groups and their root systems.\nA connected linear algebraic group G is semisimple if it has only trivial closed connected commutative normal subgroups. Any linear algebraic group G admits a maximal connected semisimple\nsubgroup Gss ⊆ G called a semisimple part. The semisimple part is unique up to conjugation by\nelements from the unipotent radical. If G is semisimple, then the set ΦG ⊆ XR (T ) of roots with\nrespect to a given maximal torus T ⊆ G is a root system, i.e. for every α ∈ ΦG one has\nΦG ∩ Rα = {±α},\n\nsα (ΦG ) = ΦG ,\n\nwhere sα : XR (T ) → XR (T ) denotes the reflection with fixed hyperplane α⊥ with respect to a\ngiven scalar product on XR (T ). The possible root systems are elementarily classified; for us, the\nfollowing types (always realized with the standard scalar product) will be important:\nAn := {ei − ej ; 1 ≤ i, j ≤ n + 1, i 6= j} ⊆ Rn+1 ,\nB2 := {±e1 , ±e2 , ±(e1 + e2 ), ±(e1 − e2 )} ⊆ R2 .\nThe root system of a connected semisimple linear group G determines G up to coverings; for\nexample, An belongs to the (simply connected) special linear group SLn+1 and B2 to the (simply\nconnected) symplectic group Sp4 .\nWe turn to varieties with a complexity one torus action. Consider data A, P as in Construction 3.7 and the resulting ring R(A, P ) with its fine K0 -grading and the coarser K-grading. Recall\nthat the fine grading group K0 splits as\nK0 = K0vert ⊕ K0hor ,\n\nwhere\n\nK0vert := hdegK0 (Sk )i,\n\nK0hor := hdegK0 (Tij )i.\n\nNote that K0vert ∼\n= Zm is freely generated by degK0 (S1 ), . . . , degK0 (Sm ). Moreover, by Remark 3.9,\nthe direct factor Zs of the column space Zr+s of P is identified via Q0 ◦ P ∗ with the kernel of the\ndowngrading map K0 → K.\nDefinition 7.1. Let A, P be as in Construction 3.7 such that the associated ring R(A, P ) is\nminimally presented and write ακ for the P -root, i.e. the Zs -part, associated to Demazure P root κ.\n(i) We call a P -root ακ semisimple if −ακ = ακ′ holds for some Demazure P -root κ′ .\n(ii) We call a semisimple P -root ακ vertical if ακ ∈ K0vert and horizontal if ακ ∈ K0hor holds.\nvert\n(iii) We write Φss\nand Φhor\nP , ΦP\nP for the set of semisimple, vertical semisimple and horizontal\nsemisimple P -roots in Rs respectively.\n\n\fTHE AUTOMORPHISM GROUP OF A VARIETY WITH TORUS ACTION\n\n25\n\nTheorem 7.2. Let A, P be as in Construction 3.7 such that R(A, P ) is minimally presented and\nlet X be a (nontoric) variety with a complexity one torus action T × X → X arising from A, P\naccording to Construction 3.10. Then the following statements hold.\nhor\nss\nss\nvert\nhor\nss\n(i) Φvert\nP , ΦP and ΦP are root systems, we have ΦP = ΦP ⊕ΦP and ΦP is the root system\nss\nwith respect to T of the semisimple part Aut(X) .\n(ii) For p ∈ K denote by mp the number of variables Sk with degK (Sk ) = p. Then we have\nM\nX\n∼\nΦvert\nAmp −1 ,\n(mp − 1) < dim(X) − 1.\n=\nP\np∈K\n\np∈K\n\nΦhor\nP\n\n(iii) Suppose\n6= ∅. Then r = 2 holds, and, after suitably renumbering the variables one\nhas\n(a) T01 T02 + T11 T12 + T2l2 , w 01 = w11 and w02 = w 12 ,\n2\n(b) T01 T02 + T11\n+ T2l2 , and w 01 = w 02 = w 11\nfor the defining relation of R(A, P ) and the degrees wij = degK (Tij ) of the variables.\n(iv) In the above case (iii a), we obtain the following possibilities for the root system Φhor\nP :\n• If l21 + . . . + l2n2 ≥ 3 holds, then one has\n(\nA1 ⊕ A1 , w01 = w 02 = w 11 = w12 ,\nhor\nΦP =\nA1 ,\notherwise.\n• If n2 = 2 and l21 = l22 = 1 hold, then one has\n\nA3 ,\nw 01 = w 02 = w11 = w12 = w 21 = w 22 ,\n\n\n\n\nw 01 = w 11 = w21 , w02 = w 12 = w 22 , w 01 =\n6 w02 ,\nA2 ,\n=\nΦhor\nP\n\nA\n⊕\nA\n,\nw\n=\nw\n=\nw\n=\nw\n,\nw\n=\n6\nw\n,\nw\n6 w22 ,\n1\n1\n01\n02\n11\n21\n01\n21\n01 =\n\n\n\nA1 ,\notherwise.\n\n(v) In the above case (iii b), we obtain the following possibilities for the root system Φhor\nP :\n• If l21 + . . . + l2n2 ≥ 3 holds, then one has\nΦhor\n= A1 .\nP\n• If n2 = 1 and l21 = 2 hold, then one has\n(\nA1 ⊕ A1 , w01 = w 02 = w 11 = w21 ,\nhor\nΦP =\nA1 ,\notherwise.\n• If n2 = 2 and l21 = l22 = 1 hold, then one has\n(\nB2 , w 01 = w02 = w 11 = w 21 = w 22 ,\nΦhor\n=\nP\nA1 , otherwise.\nThe rest of the section is devoted to the proof of this theorem. Some of the steps are needed\nlater on and therefore formulated as Lemmas. We fix A, P as in Construction 3.7 and assume that\nR(A, P ) is minimally presented.\nLemma 7.3. Let δ be a nonzero primitive K0 -homogeneous locally nilpotent derivation on R(A,\nP P ),\nbk wk\ndecompose degK0 (δ) = wvert + whor according to K0 = K0vert ⊕ K0hor and write wvert =\nwith wk = degK0 (Sk ) and bk ∈ Z.\n(i) If δ is of vertical type, then there is a k0 with bk0 = −1 and bk ≥ 0 for all k 6= k0 .\nMoreover, whor belongs to the weight monoid of R(A, P ).\n(ii) If δ is of horizontal type, then bk ≥ 0 holds for all k. Moreover, −whor does not belong\nto the weight monoid of R(A, P ).\nProof. If δ is nonzero of vertical type, then Theorem 4.3 (i) directly yields the assertion. If δ is\nnonzero of horizontal type, then it is of the form δ = hδC,β as in Theorem 4.3 (ii). For the degree\nof δ, we have\ndegK0 (δ) = wvert + whor = degK0 (h)vert + degK0 (h)hor + degK0 (δC,β ),\n\n\f26\n\nI. ARZHANTSEV, J. HAUSEN, E. HERPPICH, AND A. LIENDO\n\nwhere degK0 (δC,β ) lies in K0hor by Construction 4.2. Since degK0 (h)vert belongs to the weight\nmonoid S and, due to primitivity, degK0 (δ) lies outside the weight cone, we must have whor 6= 0.\nMoreover, for a Tij with δ(Tij ) 6= 0 and wij := degK0 (Tij ), the degree computation of Construction 4.2 shows\n0 6= degK0 (h)hor + degK0 (δC,β ) + wij = degK0 (δ(Tij ))hor .\nThus, whor + wij is a nonzero element in S. If also −whor belongs to S, then we can take\n0 6= f, g ∈ R(A, P ) homogeneous of degree whor + wij and −whor respectively. The product f g\nis of degree wij . By Corollary 3.6, this means f g = cTij with c ∈ K. A contradiction to the fact\nthat Tij is K0 -prime.\n\u0003\nBy definition, the semisimple roots occur in pairs α+ , α− with α+ + α− = 0. Given a pair\nκ+ , κ− of Demazure P -roots defining α+ , α− , write δ+ , δ− for the derivations arising from κ+ , κ−\nvia Construction 5.7. We call the pairs κ+ , κ− and δ+ , δ− associated to α+ , α− . Note that\nassociated pairs κ+ , κ− or δ+ , δ− are in general not uniquely determined by α+ , α− .\nLemma 7.4. Let δ+ , δ− be a pair of primitive K0 -homogeneous locally nilpotent derivations associated to a pair α+ , α− of semisimple roots.\n(i) The roots α+ , α− are the K0 -degrees of the derivations δ+ , δ− . In particular, we have\ndegK0 (δ+ ) + degK0 (δ− ) = α+ + α− = 0.\n(ii) If δ+ is of vertical type, then also δ− is of vertical type and α+ , α− are both vertical.\n(iii) If δ+ is of horizontal type, then also δ− is of horizontal type and α+ , α− are both horizontal.\nProof. The first assertion is clear by Construction 5.7. Using the decomposition K0 = K0vert ⊕K0hor ,\nwe obtain\nvert\nhor\nαvert\n= 0,\nαhor\n= 0.\n+ + α−\n+ + α−\nhor\nIf δ+ is of horizontal type, then Lemma 7.3 (ii) shows that −αhor\n+ = α− does not belong to\nthe weight monoid. Thus Lemma 7.3 (i) says that δ− must be of horizontal type. Moreover,\nvanish and thus α+ , α− are horizontal.\nand αvert\nLemma 7.3 (ii) shows that αvert\n−\n+\nIf δ+ is of vertical type, then, by the preceeding consideration, also δ− must be vertical. Morehor\nover, Lemma 7.3 (i) tells us that αhor\n+ and α− both belong to the weight monoid. As seen above\nhor\nthey have opposite signs. Since the weight cone is pointed, we obtain αhor\n+ = α− = 0 which\nmeans that α+ , α− are vertical.\n\u0003\n\nFor the subsequent study, we will perform certain elementary column and row operations with\nthe matrix P which we will call admissible:\n(I) swap two columns inside a block vij1 , . . . , vijni ,\n(II) swap two whole column blocks vij1 , . . . , vijni and vi′ j1 , . . . , vi′ jni′ ,\n(III) add multiples of the upper r rows to one of the last s rows,\n(IV) any elementary row operation among the last s rows.\n(V) swap two columns inside the d′ block.\nThe operations of type (III) and (IV) do not change the ring R(A, P ) whereas the types (I), (II),\n(V) correspond to certain renumberings of the variables of R(A, P ) keeping the (graded) isomorphy\ntype.\nFor a Demazure P -root κ = (u, k0 ) of vertical type, the index k0 is uniquely determined by the\nZs -part of u. Thus, we may speak of the distinguished index of a vertical P -root. Note that for\nany pair α± of vertical semisimple P -roots, the distinguished indices satisfy k0+ 6= k0− .\nLemma 7.5. Let 1 ≤ k0+ < k0− ≤ m be given and denote by f ∈ Zn+m the vector with fk± = ∓1\n0\nand all other entries zero. Then the following statements are equivalent.\n(i) There exists a pair α± of vertical semisimple roots with distinguished indices k0± .\n(ii) The vector f can be realized by admissible operations of type (III) and (IV) as the (r+1)th\nrow of P .\n\n\fTHE AUTOMORPHISM GROUP OF A VARIETY WITH TORUS ACTION\n\n27\n\n(iii) The variables Sk+ and Sk− have the same K-degree.\n0\n\n0\n\nProof. Suppose that (i) holds. Let κ± = (u± , k0± ) be a pair of Demazure P -roots associated to\nα± . Then u := u+ + u− satisfies hu, vij i ≥ 0 for all i, j and hu, vk i ≥ 0 for all k. Since the columns\nof P generate Qr+s as a cone, we obtain u = 0. Consequently u− = −u+ holds and we conclude\nhu+ , vk i = 0 for all k 6= k0± ,\n\nhu+ , vij i = 0 for all i, j,\nhu+ , vk+ i = −1,\n0\n\n+\n\n+\n(u+\n1 ,α )\n+\n\nNow write u =\nthe (primitive) row α\n\ns\n\nhu+ , vk− i = 1.\n0\n\n+\n\nwith the Z -part α and let σ be an (s − 1) × s matrix complementing\nto a unimodular matrix. Consider the block matrix\n\n\nEr\n0\n u+\nα+  .\n1\n0\nσ\n\nApplying this matrix from the left to P describes admissible operations of type (III) and (IV)\nrealizing the vector f as the (r + 1)th row of P . Thus, (i) implies (ii).\nTo see that (ii) implies (i), we may assume that f is already the (r + 1)th row of P . Consider\ns\n±\nu± ∈ Zr+s having u±\nr+1 = ±1 as the only nonzero coordinate. Then the Z -parts α of the vertical\n±\n± ±\nDemazure P -roots κ = (u , k0 ) are as wanted.\nClearly, (ii) implies (iii). Conversely, the implication \"(iii)⇒(ii)\" is obtained by similar arguments as \"(i)⇒(ii)\".\n\u0003\nLemma 7.6. Let Eq denote the q × (q + 1) block matrix [−1, Eq ], where 1 is a column with all\nentries equal one and Eq is the q × q unit matrix. After admissible operations of type (III), (IV)\nand (V), the [d, d′ ] block of P is of the form\n\n\n0\n0\n0 Emp1\n ..\n.. \n..\n\n.\n. \n[d, d′ ] =  .\n\n 0\n0\nEmpt 0 \nd′′\n...\nd′′t\nd∗\nd′′1\nwhere p1 , . . . , pt ∈ K are the elements such that the number mpi of variables Sk of degree pi is at\nleast two and d′′i is a block of length mpi with only the first column possibly nonzero. Moreover,\nΦvert\nis a root system and we have\nP\nM\nX\n∼\nΦvert\nAmp −1 ,\n(mp − 1) < dim(X) − 1.\n=\nP\np∈K\n\np∈K\n\nProof. This is a direct application of Lemma 7.5.\n\n\u0003\n\nLemma 7.7. If there exists a pair of semisimple roots α± ∈ Φhor\nP , then r = 2 holds, and after\nsuitably renumbering l0 , l1 , l2 , the following two cases remain\n(i) We have n0 = n1 = 2 and l01 = l02 = l11 = l12 = 1 and for any pair δ± of derivations\n−\nassociated to α± one has i+\n0 = i0 = 2.\n(ii) We have n0 = 1, l01 = 2 and n1 = 2, l11 = l12 = 1 and for any pair δ± of derivations\n−\nassociated to α± one has i+\n0 = i0 = 2.\nProof. Lemma 7.4 says that δ+ , δ− are of horizontal type, by Construction 5.7 they are of the\nform δ± = h± δC ± ,β ± and the degree computation of Construction 4.2 gives\nX\ndegK0 (δ± ) = (r − 1)μ −\nwkc± + w± ,\nk\n\nk6=i±\n0\n\nwhere μ is the common K0 -degree of the relations, wij the K0 -degree of Tij , the i±\n0 -th component\nof β± vanishes and w± is the K0 -degree of h± . Now fix two distinct i+ , i− with i± 6= i±\n0 and\n\n\f28\n\nI. ARZHANTSEV, J. HAUSEN, E. HERPPICH, AND A. LIENDO\n\nli+ c+ = 1. Then degK0 (δ+ ) + degK0 (δ− ) = 0 leads to\ni+\nX\nX\nw := w+ + w− +\n(μ − wkc+ ) +\n(μ − wkc− ) = wi+ c+ + wi− c− .\nk\n\nk\n\ni+\n\n−\nk6=i−\n0 ,i\n\n+\nk6=i+\n0 ,i\n\ni−\n\nNote that all summands are elements of the weight monoid of R(A, P ) and, except possibly w± , all\nare nonzero. Moreover, Corollary 3.6 (ii) shows that the K0 -homogeneous component R(A, P )w\nis generated by f + f − , where\nf + := Ti+ c+ ,\n\nf − := Ti− c− .\ni−\n\ni+\n\nNow, choosing suitable presentations of the μ, write the first presentation of w as the K0 -degree\nof a monomial f in the variables Tij corresponding to the occuring wij . Then f = f + f − holds.\n+\nSince f + and f − are K0 -prime, we conclude w± = 0 and r = 2. Renumbering i+\n0 7→ 2, i 7→ 1,\nthe above equation simplifies to\nw = μ − w0c+ + μ − wi− c−\n0\n\n−\ni\n2\n\n2\n\ni−\n\n1\n\ni−\n2\n\ni−\n0\n\ni−\n2\n\n= w1c+ + wi− c− ,\n\n= 1 and\nand i− . We conclude further\ndiffers from\nwhere\nSince li+ c+ = l1c+ equals one, we arrive at the cases (i) and (ii).\ni+\n\n1\n\nP\n\nl0j =\n\nP\n\n+\nl1j = 2 and i−\n0 = i0 .\n\u0003\n\nThe above lemma shows that for a given pair α± ∈ Φhor\nP , all associated pairs of Demazure P −\nroots (or derivations) share the same i0 = i+\n=\ni\n.\nThis\nallows\nus to speak about the distinguished\n0\n0\nindex i0 of α± ∈ Φhor\n.\nP\nLemma 7.8. Suppose n0 = n1 = 2, l01 = l02 = l11 = l12 = 1. If there exists a pair α± ∈ Φhor\nP\nwith distinguished index i0 = 2, then P can be brought by admissible operations, without moving\nthe n2 -block, into the form\n\n\n−1 −1 1\n1 0 0\n −1 −1 0\n0 l2\n0 \n,\nP = \n(7.8.1)\n −1\n0 0\n1 0 0 \n0\n0 0 d∗12 d∗2 d′∗\n\nwhere the lower line is a matrix of size (s − 1) × (n + m). Conversely, if P is of the above shape,\nthen α± = (±1, 0) ∈ Φhor\nhas distinguished index i0 = 2. Moreover, up to admissible operations\nP\nof type (III) and (IV), situation (7.8.1) is equivalent to\ndegK (T01 ) = degK (T12 ),\n±\n\ndegK (T02 ) = degK (T11 ).\n\n, 2, i±\n1 , C± )\n\nProof. Fix an associated pair κ± = (u\nables, we first achieve i+\n1 = 1 and C+ = (1, 1, 1).\nP to the lower s rows, brings P into the form\n\n−1 −1\nP =  −1 −1\n0 d02\n\nof Demazure P -roots. Renumbering the variAdding suitable multiples of the top two rows of\n1\n0\n0\n\n1\n0\nd12\n\n0\nl2\nd2\n\n\n0\n0 \nd′\n\nNow we explicitly go through the defining conditions of the Demazure P -root κ+ with\n+\n±\nu+ = (u+\n1 , u2 , α+ ), where ui ∈ Z,\n\nu+\n1\n\ni+\n1 = 1,\n\nC+ = (1, 1, 1).\n\nu−\n1\n\nThis gives in particular,\n= −1 and\n= 1. Going through the conditions of a Demazure\nP -root κ− = (u− , 2, i−\n,\nC\n)\nleaves\nus\nwith\nthe\ntwo possibilities\n−\n1\nu− = (1, −1, −α+ ),\n−\n\nu = (0, −1, −α+ ),\nIn both cases, we obtain\n\ni−\n1 = 0,\n\nC− = (2, 2, 1),\n\ni−\n1\n\nC− = (1, 1, 1).\n\n= 1,\n\nhα+ , d02 i = hα+ , d12 i = 1,\nhα+ , d2j i = −l2j for j = 1, . . . , n2 ,\nhα+ , d′k i = 0 for j = 1, . . . , m.\n\n\fTHE AUTOMORPHISM GROUP OF A VARIETY WITH TORUS ACTION\n\n29\n\nNow choose any invertible s × s matrix with α+ as its first row and apply it from the left to P .\nThen the third row of P looks as follows\n\u0002\n\u0003\n0 1 0 1 −l2 0\nAdding suitable multiples of the third row to the last s − 1 rows and adding the second to the\nthird row brings P into the desired form. The remaining statements are directly checked.\n\u0003\n\nLemma 7.9. Consider a pair α± ∈ Φhor\nwith distinguished index i0 = 2. There exists another\nP\npair α̃± ∈ Φhor\nwith\ndistinguished\nindex\nĩ\n=\n2 if and only if we have\n0\nP\ndegK (T01 ) = degK (T02 ) = degK (T11 ) = degK (T12 ).\nMoreover, if the latter holds, then α± , α̃± are the only pairs of semisimple roots with distinguished\nindex 2 and they form a root system isomorphic to A1 ⊕ A1 .\nProof. We may assume that we are in the setting of Lemma 7.8. Then we just have to go through\nthe possible cases ĩ±\n1 and C− and observe that the existence of α̃± implies a special shape of P\nequivalent to the above degree condition.\n\u0003\nLemma 7.10. Suppose n0 = 1, l01 = 2 and n2 = 2, l11 = l12 = 1. Then there is at most one pair\nα± ∈ Φhor\nwith distinguished index i0 = 2. If there is one, then P can be brought by admissible\nP\noperations, without moving the n2 -block, into the form\n\n\n−2 1 1 0 0\n −2 0 0 l2\n0 \n\n(7.10.1)\nP = \n −1 0 1 0 0  ,\nd∗01 0 0 d∗2 d′∗\n\nwhere the lower line is a matrix of size (s − 1) × (n + m). Conversely, if P is of the above shape,\nthen α± = (±1, 0) ∈ Φhor\nhas distinguished index i0 = 2. Moreover, up to admissible operations\nP\nof type (III) and (IV), situation (7.10.1) is equivalent to\ndegK (T01 ) = degK (T11 ) = degK (T12 ).\n\nProof. This is a similar computation as in the previous lemma. Clearly, we may assume C+ =\n(1, 1, 1) and by suitable row operations, we bring P into the form\n\n\n−2 1\n1 0 0\n0 l2 0 \nP =  −2 0\nd01 0 d12 d2 d′\n\n+\nNow enter the defining conditions of a Demazure P -root κ+ with u+ = (u+\n1 , u2 , α+ ). It turns out\n+\nthat C− = (1, 2, 2) must hold. We end up with u1 = 0 and\n\nhα+ , d01 i = 2u+\n2 − 1,\nhα+ , d12 i = 1,\nhα+ , d2j i = −u+\n2 l2j for j = 1, . . . , n2 ,\nhα+ , d′k i = 0 for j = 1, . . . , m.\nAs before, this enables us to bring P via suitable row operations into the desired form. Again, the\nremaining statements are directly seen.\n\u0003\nis a root system and has the desired form. This\nProof of Theorem 7.2. Lemma 7.6 shows that Φvert\nP\nproves (ii). Concerning Φhor\nP , assertion (iii) as well as the cases l21 + . . .+ l2n2 ≥ 3 of assertions (iv)\nand (v) are proven by Lemmas 7.7, 7.8 and 7.9. The remaining cases of (iv) and (v) are deduced\nare root systems of\nand Φhor\nusing the special shape of P guaranteed by Lemma 7.7. So, Φvert\nP\nP\nthe desired shape. Lemma 7.4 and the decomposition of K0 into a vertical and a horizontal part\nvert\nand Φhor\nshow that Φss\nP .\nP splits into the direct sum of ΦP\nTo conclude the proof, we have to verify that Φss\nP is in fact the root system of the semisimple\npart of Aut(X). For this, it suffices to realize the root system Φss\nP as the root system of some\nsemisimple subgroup G ⊆ Aut(X) (which then necessarily is a semisimple part). Consider X :=\n\n\f30\n\nI. ARZHANTSEV, J. HAUSEN, E. HERPPICH, AND A. LIENDO\n\nSpec R(A, P ) and the action of HX := Spec K[K]. The group G ⊆ Aut(X) will be induced by\na representation of a suitable semisimple group on Kn+m commuting with the action of HX and\nleaving X := Spec R(A, P ) invariant.\nvert\nWe first care about Φvert\n:= ×p SLmp . It acts on Kn+m :\nP . Consider the semisimple group G\ntriviallly on Kn and blockwise on Km = ⊕p Kmp . This action commutes with the action of HX and\nb invariant. Thus the Gvert -action descends to X. This realizes Gvert ⊆ Aut(X)\nleaves X as well as X\nas a subgroup with root system Φvert\nP .\nSimilarly, going through the cases, we realize Φhor\nas a root system of a semisimple group\nP\nGhor ⊆ Aut(X). Recall that for the defining relation, we have the possibilities\n(a) T01 T02 + T11 T12 + T2l2 ,\n\n2\n(b) T01 T02 + T11\n+ T2l2 .\n\nConsider case (a). If we have the equations w01 = w 11 and w 02 = w 12 , then g ∈ SL2 acts on the\nT01 , T11 -space as (g t )−1 and on the T02 , T12 -space as g. By trivial extension, we obtain an action\non Kn+m commuting with the H-action, leaving the defining relation and thus X invariant. Thus,\nwe have an induced effective action of a semisimple group Ghor with root system A1 on X.\nIf we have w 01 = w 02 = w11 = w 12 , then the canonical action of the group SO4 on the\nT01 , T11 , T02 , T12 -space extends trivially to Kn+m , commutes with the action of HX and leaves X\ninvariant. Again, this gives an induced effective action of a semisimple group Ghor on X, this time\nthe root system is A1 ⊕ A1 ; recall that SO4 has SL2 × SL2 as its universal covering.\nNow let n2 = 2 and l21 = l22 = 1. Then we have n = 6. If all six K-degrees w ij coincide,\nthen take the action of SO6 on Kn and extend it trivially to Kn+m . This induces an action of a\nsemisimple group Ghor on X. The root system is that of the universal covering SL4 , i.e. we obtain\nA3 . If all w i1 and all wi2 coincide but we have w 01 6= w 02 , then consider the action of SL3 given\nby (g t )−1 on the Ti1 -space and by g on the Ti2 -space. This leads to a Ghor with root system A2 .\nFinally, consider case (b). If w 01 = w 02 = w11 holds, then the canonical action of the group SO3\non the T01 , T02 , T11 -space defines a semisimple subgroup Ghor of Aut(X) with root system A1 . If\nn2 = 1 and l21 = 2 holds and we have w01 = w 02 = w 11 = w21 , then n = 4 holds and the canonical\naction of SO4 on Kn induces a semisimple subgroup Ghor of Aut(X) with root system A1 ⊕ A1 .\nIf we have n2 = 2 and l21 = l22 = 1 and all degrees w ij coincide, then the canonical action of SO5\non K5 extends to Kn+m and induces a subgroup Ghor of Aut(X) with root system B2 .\nAlltogether, we realized the root systems Φvert\nand Φhor\nby semisimple subgroups Gvert and\nP\nP\nhor\nG\nof Aut(X). By construction, these groups commute and thus define a semisimple subgroup\nvert\nG := Gvert Ghor of Aut(X) with the desired root system Φss\n⊕ Φhor\n\u0003\nP = ΦP\nP .\nCorollary 7.11 (of proof). In the situation of Theorem 7.2, any pair of semisimple roots defines\na subgroup of the automorphism group locally isomorphic to SL2 .\n8. Applications\nIn this section we present applications of Theorem 7.2. A first one concerns the automorphism\ngroup of arbitrary nontoric Mori dream surfaces (not necessarily admitting a K∗ -action).\nProposition 8.1. Let X be a nontoric Mori dream surface. Then Aut(X)0 is solvable and the\nfollowing cases can occur:\n(i) X is a K∗ -surface,\n(ii) Aut(X)0 is unipotent.\nProof. Consider a maximal torus T ⊆ Aut(X)0 . If T is trivial, then we are in case (ii). In\nparticular, Aut(X)0 is solvable then. If T is one-dimensional, then we are in case (i) and the task\nis to show that the semisimple part of Aut(X) is trivial, i.e. Aut(X) has no semisimple roots. For\nthis, we remark first that as a Mori dream surface with a nontrivial K∗ -action, X is rational. Thus,\nwe may assume that X arises from A, P as in Construction 3.7 and that R(A, P ) is minimally\npresented. Note that we have s = 1.\nThe estimate of Theorem 7.2 (ii) forbids vertical semisimple P -roots. Let us see why there\nare no horizontal semisimple P -roots. Otherwise, Lemmas 7.8 and 7.10 show that we must have\n\n\fTHE AUTOMORPHISM GROUP OF A VARIETY WITH TORUS ACTION\n\nm = 0 and, up to admissible operations,\n\n−1 −1 1 1\n −1 −1 0 0\n−1\n0 0 1\n\n31\n\nthe matrix P is one of the following:\n\n\n\n0\n−2 1 1 0\n −2 0 0 l2  .\nl2  ,\n0\n−1 0 1 0\n\nSince the columns of P are pairwise different primitive vectors, we obtain n2 = 1 and l21 = 1; a\ncontradiction to the assumption that the ring R(A, P ) is minimally presented.\n\u0003\nWe take a brief look at q-dimensional varieties X coming with a nontrivial action of SLq . They\nwere classified (in the smooth case) by Mabuchi [16]. Let us see how to obtain the rational nontoric\npart of his list with the aid of Theorem 7.2.\nExample 8.2. Let X a nontoric q-dimensional complete normal variety with a nontrivial action\nof SLq . Since SLq has only finite normal subgroups, X comes with a torus action T × X → X of\ncomplexity one. Proposition 8.1 tells us that X is of dimension at least three. If SLq acts with an\nopen orbit, then X has a finitely generated divisor class group and, by existence of the T -action of\ncomplexity one, must be rational. So, we may assume that we are in the setting of Theorem 7.2,\nwhere we end up in the cases A2 , A3 of second item of (iv) which amounts to the following two\npossibilities.\n(i) We have q = 3 and X is the flag variety SL3 /B3 ; in particular, Cl(X) ∼\n= Z2 and\nR(X) ∼\n= K[T01 , T02 , T11 , T12 , T21 , T22 ] / hT01 T02 + T11 T12 + T21 T22 i\nhold, where the Z2 -grading is given by\ndeg(T01 ) = deg(T11 ) = deg(T21 ) = (1, 0),\ndeg(T02 ) = deg(T12 ) = deg(T22 ) = (0, 1).\n(ii) We have q = 4 and X is the smooth quadric V (T0 T1 + T2 T3 + T4 T5 ) in P5 , where SL4\nacts as the universal covering of SO6 .\nNow assume that SLq acts with orbits of dimension at most q − 1. Then this action gives a root\nsystem Aq−1 ⊆ Φvert\nP . If X were rational, then Theorem 7.2 (ii) would require q < dim(X) which\nis excluded by assumption. Thus, X must be nonrational. In particular, the rational nontoric\npart of Mabuchi's list is established, even for a priori singular varieties.\nWe turn to nontoric varieties with a torus action of complexity one which are almost homogeneous under some reductive group. Recall that an action of a reductive group G on X is spherical\nif some Borel subgroup of G acts with an open orbit on X.\nProposition 8.3. Let X be a nontoric complete normal variety. Then the following statements\nare equivalent.\n(i) X allows a torus action of complexity one and an almost homogeneous reductive group\naction.\n(ii) X is spherical with respect to an action of a reductive group of semisimple rank one.\n(iii) X is isomorphic to a variety as in Theorem 7.2 (iii).\nProof. The implication \"(ii)⇒(i)\" is obvious. For the implication \"(iii)⇒(ii)\", take a pair of\nsemisimple horizontal P -roots α+ and α− . Then the acting torus T of X and the root subgroups\nU± associated to α± generate a reductive group G of semisimple rank one in Aut(X) and X is\nspherical with respect to the action of G.\nAssume that (i) holds. Then the open orbit of the acting reductive group G is unirational.\nThus, X is unirational. By the existence of a torus action of complexity one, X contains an open\nsubset of the form T × C with some affine curve C. We conclude that C and hence X are rational.\nConsequently, X is a Mori dream space. In particular, Corollary 2.4 yields that Aut(X) is linear\nalgebraic. Moreover, we may assume that we are in the setting of Theorem 7.2. The image of\nG0 in Aut(X) is contained in a maximal connected reductive subgroup G′ of Aut(X). Suitably\nconjugating G′ , we may assume that the acting torus T of X is a maximal torus of G′ . Since\nG′ is generated by root subgroups, we infer from Corollary 5.11 that there must be a horizontal\nDemazure P -root. Since every root of G′ is semisimple, we end up in Case 7.2 (iii).\n\u0003\n\n\f32\n\nI. ARZHANTSEV, J. HAUSEN, E. HERPPICH, AND A. LIENDO\n\nSpecializing to dimension three, we obtain a quite precise picture of the possible matrices P in\nthe above setting.\nProposition 8.4. Let X be a three-dimensional nontoric complete normal rational variety. Suppose that X is almost homogeneous under an action of a reductive group and there is an effective\naction of a two-dimensional torus on X. Then the Cox ring of X is given as R(X) = R(A, P )\nwith a matrix P according to the following cases\n\n\n−1 −1 1\n1 0 0\n −1 −1 0\n0 l2\n0 \n,\n(i)\nP = \n −1\n0 0\n1 0 0 \n0\n0 0 d∗12 d∗2 d′∗\n\n\n−2 1 1 0 0\n −2 0 0 l2\n0 \n\n(ii)\nP = \n −1 0 1 0 0 .\nd∗01 0 0 d∗2 d′∗\nIn both cases, we have m ≤ 2; that means that the d′∗ -part can be either empty, equal to ±1 or\nequal to (±1, ∓1).\nProof. Clearly, we may assume that we are in the situation of Theorem 7.2. Since X is nontoric but\nalmost homogeneous, there must be a semisimple horizontal P -root. Thus, Lemmas 7.8 and 7.10\nshow that after admissible operations, P is of the desired shape.\n\u0003\nAs a direct consequence, one retrieves results of Haddad [9] on the Cox rings of three-dimensional\nvarieties that are almost homogeneous under an SL2 -action and additionally come with an effective\naction of a two-dimensional torus T ; compare also [2] for the affine case.\nCorollary 8.5. Let X be a three-dimensional nontoric complete normal rational variety. Suppose\nthat X is almost homogeneous under an action of SL2 and there is an effective action of a twodimensional torus T on X. Then X has at most two T -invariant prime divisors with infinite\nT -isotropy, i.e., we have m ≤ 2 and the Cox ring of X is given as\nR(X) =\n\nl\n\nl21\nK[Tij , Sk ]/hT01 T02 + T11 T12 + T21\n* * * T2n2n22 i.\n\nProof. We are in the situation of Proposition 8.4. The assumption that SL2 acts with an open\norbit implies that we are in case (i).\n\u0003\nFinally, we consider almost homogeneous varieties with reductive automorphism group; see for\nexample [19] for results on the toric case. Here, we list all almost homogeneous threefolds of Picard\nnumber one with a reductive automorphism group having a maximal torus of dimension two.\nProposition 8.6. Let X be a Q-factorial three-dimensional complete normal variety of Picard\nnumber one. Suppose that Aut(X) is reductive, has a maximal torus of dimension two and acts\nwith an open orbit on X. Then X is a rational Fano variety and, up to isomorphy, arises from a\nmatrix P from the following list:\n\n\n−1 −1 1\n1\n0\n −1 −1 0\n0 l21 \n , l > 1, d12 > 2, − d21 < l21 < −d21 ,\n(i) \nd12 −1\n −1\n0 0\n1\n0  21\n0\n0 0 d12 d21\n\n\n−2 1 1\n0\n0\n −2 0 0 l21 l22 \n , l , l > 1, 2d22 > −d01 l22 , −2d21 > d01 l21 ,\n(ii) \n −1 0 1\n0\n0  21 22\nd01 0 0 d21 d22\n\n\n−2 1 1\n0\n0\nl22 > 1, d22 > d21 l22 + l22 , 2d22 > −d01 l22 , −2d21 > d01 ,\n −2 0 0\n1 l22 \n , or\n(iii) \n −1 0 1\n\n0\n0\nl22 > 1, 2d22 > −d01 l22 , 1 − 2d21 > d01 ,\nd01 0 0 d21 d22\n\n\fTHE AUTOMORPHISM GROUP OF A VARIETY WITH TORUS ACTION\n\n33\n\n\n\n\n−2 1 1 0 0\n −2 0 0 1 1 \n\n(iv) \n −1 0 1 0 0  ,\n−1 0 0 1 0\n\n\n−2 1 1\n0 0\n −2 0 0 l21 0 \n , 1 < l21 < −2d21 < 2l21 .\n(v) \n −1 0 1\n0 0 \n1 0 0 d21 1\nConversely, each of the above listed matrices defines a Q-factorial rational almost homogeneous\nFano variety with reductive automorphism group having a two-dimensional maximal torus.\nProof. According to Proposition 8.3, we may assume that X arises from a matrix P . The fact that\nAut(X) is reductive means that every root must be semisimple and the fact that it acts with an\nopen orbit means that there exists at least one pair of horizontal semisimple roots. Now, suppose\nwe have m = 0. If there is only one pair of horizontal semisimple P -roots, then reductivity of the\nautomorphism group forbids further P -roots and we end up with the first three cases. If there are\nmore then one pair of semisimple roots, then we end up in case four. Finally, if m > 0 holds, then\nm = 1 is the only possibility and one is left with case (v).\n\u0003\nReferences\n[1] I. Arzhantsev, U. Derenthal, J. Hausen, A. Laface: Cox rings, arXiv:1003.4229, see also the authors' webpages.\n[2] I. Arzhantsev, A. Liendo: Polyhedral divisors and SL2 -actions on affine T -varieties. To appear in Michigan\nMath. J., arXiv:1105.4494v1.\n[3] A. Bialynicki-Birula: Finiteness of the number of maximal open subsets with good quotients. Transform. Groups\n3 (1998), no. 4, 301–319.\n[4] M. Brion: The total coordinate ring of a wonderful variety. J. Algebra 313 (2007), no. 1, 61–99\n[5] W. Bruns, J. Gubeladze: Polytopal linear groups. J. Algebra 218 (1999), no. 2, 715–737.\n[6] D. Cox: The homogeneous coordinate ring of a toric variety. J. Alg. Geom. 4 (1995), no. 1, 17–50.\n[7] M. Demazure: Sous-groupes algébriques de rang maximum du groupe de Cremona. Ann. Sci. École Norm. Sup.\n(4) 3 (1970), 507–588.\n[8] G. Freudenburg: Algebraic theory of locally nilpotent derivations. Encyclopaedia of Mathematical Sciences, 136.\nInvariant Theory and Algebraic Transformation Groups, VII. Springer Verlag, Berlin, 2006.\n[9] F. Haddad: Spherical quasihomogeneous SL(2)-varieties. PhD Thesis, Universität Tübingen, 2010.\n[10] B. Hassett, Yu. Tschinkel: Universal torsors and Cox rings. In: Arithmetic of higher-dimensional algebraic\nvarieties, Progr. Math., 226, Birkhäuser Boston, Boston, MA, 149–173 (2004)\n[11] J. Hausen: Cox rings and combinatorics II. Mosc. Math. J. 8 (2008), no. 4, 711–757.\n[12] J. Hausen: Three Lectures on Cox rings. To appear in: Torsors, étale homotopy and applications to rational\npoints - Proceedings of the ICMS workshop in Edinburgh, 10–14 January 2011. London Mathematical Society\nLecture Note Series.\n[13] J. Hausen, E. Herppich: Factorially graded rings of complexity one. To appear in: Torsors, étale homotopy and\napplications to rational points - Proceedings of the ICMS workshop in Edinburgh, 10–14 January 2011. London\nMathematical Society Lecture Note Series.\n[14] J. Hausen, H. Süß: The Cox ring of an algebraic variety with torus action. Advances Math. 225 (2010),\n977–1012.\n[15] S. Lang: Algebra. Revised third version. Graduate Texts in Mathematics 211, Springer, 2002.\n[16] T. Mabuchi: On the classification of essentially effective SL(n; C)-actions on algebraic n-folds. Osaka J. Math.\n16 (1979), no. 3, 745–758.\n[17] M. Masuda. Symmetry of a symplectic toric manifold. J. Symplectic Geometry 8 (2010), no. 4, 359–380\n[18] K. Matsuki: Introduction to the Mori program. Universitext. Springer-Verlag, New York, 2002.\n[19] B. Nill: Complete toric varieties with reductive automorphism group. Math. Z. 252 (2006), no. 4, 767–786.\n[20] P. Orlik, P. Wagreich: Isolated singularities of algebraic surfaces with C∗ -action. Ann. of Math. (2) 93 (1971),\n205–228.\n[21] P. Orlik, P. Wagreich: Algebraic surfaces with k ∗ -action. Acta Math. 138 (1977), no. 1-2, 43–81.\n[22] D.I. Panyushev: Good properties of algebras of invariants and defect of linear representations. J. Lie Theory\n5 (1995), 81–99.\n[23] Y. Sakamaki: Automorphism groups on normal singular cubic surfaces with no parameters. Trans. Amer.\nMath. Soc. 362 (2010), no. 5, 2641–2666.\n[24] J. Świȩcicka: A combinatorial construction of sets with good quotients by an action of a reductive group.\nColloq. Math. 87 (2001), no. 1, 85–102.\n\n\f34\n\nI. ARZHANTSEV, J. HAUSEN, E. HERPPICH, AND A. LIENDO\n\nDepartment of Higher Algebra, Faculty of Mechanics and Mathematics, Moscow State University,\nLeninskie Gory 1, Moscow 119991, Russia\nE-mail address: arjantse@mccme.ru\nMathematisches Institut, Universität Tübingen, Auf der Morgenstelle 10, 72076 Tübingen, Germany\nE-mail address: juergen.hausen@uni-tuebingen.de\nMathematisches Institut, Universität Tübingen, Auf der Morgenstelle 10, 72076 Tübingen, Germany\nE-mail address: elaine.herppich@uni-tuebingen.de\nMathematisches Institut, Universität Bern, Sidlerstrasse 5, 3012 Bern, Switzerland\nE-mail address: alvaro.liendo@math.unibe.ch\n\n\f"}