{"id": "http://arxiv.org/abs/0704.1579v1", "guidislink": true, "updated": "2007-04-12T13:17:11Z", "updated_parsed": [2007, 4, 12, 13, 17, 11, 3, 102, 0], "published": "2007-04-12T13:17:11Z", "published_parsed": [2007, 4, 12, 13, 17, 11, 3, 102, 0], "title": "A Study of Catalogued Nearby Galaxy Clusters in the SDSS-DR4: I. Cluster\n  Global Properties", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0704.3491%2C0704.2696%2C0704.0344%2C0704.1187%2C0704.2582%2C0704.0533%2C0704.3309%2C0704.0426%2C0704.0093%2C0704.1050%2C0704.2314%2C0704.3145%2C0704.3575%2C0704.3040%2C0704.1395%2C0704.3987%2C0704.0948%2C0704.2712%2C0704.0708%2C0704.0983%2C0704.1189%2C0704.1282%2C0704.0860%2C0704.2602%2C0704.2018%2C0704.1612%2C0704.3371%2C0704.2963%2C0704.1785%2C0704.0162%2C0704.0774%2C0704.2370%2C0704.0946%2C0704.1838%2C0704.3483%2C0704.2479%2C0704.2951%2C0704.1856%2C0704.0613%2C0704.3018%2C0704.2103%2C0704.3782%2C0704.2857%2C0704.2627%2C0704.1239%2C0704.0855%2C0704.2743%2C0704.3829%2C0704.1579%2C0704.2237%2C0704.1188%2C0704.3085%2C0704.0321%2C0704.1613%2C0704.3605%2C0704.2854%2C0704.2892%2C0704.0761%2C0704.0630%2C0704.3646%2C0704.0662%2C0704.2291%2C0704.1587%2C0704.0211%2C0704.3594%2C0704.1312%2C0704.0334%2C0704.1179%2C0704.1948%2C0704.3462%2C0704.0369%2C0704.2484%2C0704.2758%2C0704.1605%2C0704.3098%2C0704.2538%2C0704.0982%2C0704.0061%2C0704.1706%2C0704.2694%2C0704.3819%2C0704.3231%2C0704.3025%2C0704.1618%2C0704.1487%2C0704.3868%2C0704.2172%2C0704.0289%2C0704.3807%2C0704.1159%2C0704.2394%2C0704.0036%2C0704.0200%2C0704.1157%2C0704.2740%2C0704.3241%2C0704.1378%2C0704.1966%2C0704.2503%2C0704.3325%2C0704.2725&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "A Study of Catalogued Nearby Galaxy Clusters in the SDSS-DR4: I. Cluster\n  Global Properties"}, "summary": "We have selected a sample of 88 nearby (z<0.1) galaxy clusters from the\nSDSS-DR4 with redshift information for the cluster members. We have derived\nglobal properties for each cluster, such as their mean recessional velocity,\nvelocity dispersion, and virial radii. Cluster galaxies have been grouped in\ntwo families according to their $u-r$ colours. The total sample consists of\n10865 galaxies. As expected, the highest fraction of galaxies (62%) turned to\nbe early-type (red) ones, being located at smaller distances from the cluster\ncentre and showing lower velocity dispersions than late-type (blue) ones. The\nbrightest cluster galaxies are located in the innermost regions and show the\nsmallest velocity dispersions. Early-type galaxies also show constant velocity\ndispersion profiles inside the virial radius and a mild decline in the\noutermost regions. In contrast, late-type galaxies show always decreasing\nvelocity dispersions profiles. No correlation has been found between the\nfraction of blue galaxies and cluster global properties, such as cluster\nvelocity dispersion and galaxy concentration. In contrast, we found correlation\nbetween the X-ray luminosity and the fraction of blue galaxies. These results\nindicate that early- and late-type galaxies may have had different evolution.\nThus, blue galaxies are located in more anisotropic and radial orbits than\nearly-type ones. Their star formation seems to be independent of the cluster\nglobal properties in low mass clusters, but not for the most massive ones.\nThese observational results suggest that the global environment could be\nimportant for driving the evolution of galaxies in the most massive cluster\n($\\sigma > 800$ km s$^{-1}$). However, the local environment could play a key\nrole in galaxy evolution for low mass clusters.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0704.3491%2C0704.2696%2C0704.0344%2C0704.1187%2C0704.2582%2C0704.0533%2C0704.3309%2C0704.0426%2C0704.0093%2C0704.1050%2C0704.2314%2C0704.3145%2C0704.3575%2C0704.3040%2C0704.1395%2C0704.3987%2C0704.0948%2C0704.2712%2C0704.0708%2C0704.0983%2C0704.1189%2C0704.1282%2C0704.0860%2C0704.2602%2C0704.2018%2C0704.1612%2C0704.3371%2C0704.2963%2C0704.1785%2C0704.0162%2C0704.0774%2C0704.2370%2C0704.0946%2C0704.1838%2C0704.3483%2C0704.2479%2C0704.2951%2C0704.1856%2C0704.0613%2C0704.3018%2C0704.2103%2C0704.3782%2C0704.2857%2C0704.2627%2C0704.1239%2C0704.0855%2C0704.2743%2C0704.3829%2C0704.1579%2C0704.2237%2C0704.1188%2C0704.3085%2C0704.0321%2C0704.1613%2C0704.3605%2C0704.2854%2C0704.2892%2C0704.0761%2C0704.0630%2C0704.3646%2C0704.0662%2C0704.2291%2C0704.1587%2C0704.0211%2C0704.3594%2C0704.1312%2C0704.0334%2C0704.1179%2C0704.1948%2C0704.3462%2C0704.0369%2C0704.2484%2C0704.2758%2C0704.1605%2C0704.3098%2C0704.2538%2C0704.0982%2C0704.0061%2C0704.1706%2C0704.2694%2C0704.3819%2C0704.3231%2C0704.3025%2C0704.1618%2C0704.1487%2C0704.3868%2C0704.2172%2C0704.0289%2C0704.3807%2C0704.1159%2C0704.2394%2C0704.0036%2C0704.0200%2C0704.1157%2C0704.2740%2C0704.3241%2C0704.1378%2C0704.1966%2C0704.2503%2C0704.3325%2C0704.2725&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We have selected a sample of 88 nearby (z<0.1) galaxy clusters from the\nSDSS-DR4 with redshift information for the cluster members. We have derived\nglobal properties for each cluster, such as their mean recessional velocity,\nvelocity dispersion, and virial radii. Cluster galaxies have been grouped in\ntwo families according to their $u-r$ colours. The total sample consists of\n10865 galaxies. As expected, the highest fraction of galaxies (62%) turned to\nbe early-type (red) ones, being located at smaller distances from the cluster\ncentre and showing lower velocity dispersions than late-type (blue) ones. The\nbrightest cluster galaxies are located in the innermost regions and show the\nsmallest velocity dispersions. Early-type galaxies also show constant velocity\ndispersion profiles inside the virial radius and a mild decline in the\noutermost regions. In contrast, late-type galaxies show always decreasing\nvelocity dispersions profiles. No correlation has been found between the\nfraction of blue galaxies and cluster global properties, such as cluster\nvelocity dispersion and galaxy concentration. In contrast, we found correlation\nbetween the X-ray luminosity and the fraction of blue galaxies. These results\nindicate that early- and late-type galaxies may have had different evolution.\nThus, blue galaxies are located in more anisotropic and radial orbits than\nearly-type ones. Their star formation seems to be independent of the cluster\nglobal properties in low mass clusters, but not for the most massive ones.\nThese observational results suggest that the global environment could be\nimportant for driving the evolution of galaxies in the most massive cluster\n($\\sigma > 800$ km s$^{-1}$). However, the local environment could play a key\nrole in galaxy evolution for low mass clusters."}, "authors": ["J. A. L. Aguerri", "R. Sanchez-Janssen", "C. Munoz-Tunon"], "author_detail": {"name": "C. Munoz-Tunon"}, "author": "C. Munoz-Tunon", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1051/0004-6361:20066478", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/0704.1579v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0704.1579v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "19 pages, 11 figures, accepted for publication in A&A", "arxiv_primary_category": {"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0704.1579v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0704.1579v1", "journal_reference": null, "doi": "10.1051/0004-6361:20066478", "fulltext": "c ESO 2018\n\nAstronomy & Astrophysics manuscript no. aguerri ̇rv\nNovember 5, 2018\n\narXiv:0704.1579v1 [astro-ph] 12 Apr 2007\n\nA Study of Catalogued Nearby Galaxy Clusters in the SDSS-DR4\nI. Cluster Global Properties\nJ. A. L. Aguerri, R. Sánchez-Janssen & C. Muñoz-Tuñón\nInstituto de Astrofı́sica de Canarias C/ Vı́a Láctea s/n, 38200 La Laguna, Spain. e-mail: jalfonso@iac.es, ruben@iac.es, cmt@iac.es\nReceived ; accepted\nABSTRACT\n\nContext. Large surveys as the Sloan Digital Sky Survey have made available large amounts of spectroscopic and photometric data of galaxies,\nproviding important information for the study of galaxy evolution in dense environments.\nAims. We have selected a sample of 88 nearby (z < 0.1) galaxy clusters from the SDSS-DR4 with redshift information for the cluster members.\nIn particular, we focus our results on the galaxy morphological distribution, the velocity dispersion profiles, and the fraction of blue galaxies in\nclusters.\nMethods. Cluster membership was determined using the available velocity information. We have derived global properties for each cluster,\nsuch as their mean recessional velocity, velocity dispersion, and virial radii. Cluster galaxies have been grouped in two families according to\ntheir u − r colours.\nResults. The total sample consists of 10865 galaxies. As expected, the highest fraction of galaxies (62%) turned to be early-type (red) ones,\nbeing located at smaller distances from the cluster centre and showing lower velocity dispersions than late-type (blue) ones. The brightest\ncluster galaxies are located in the innermost regions and show the smallest velocity dispersions. Early-type galaxies also show constant velocity\ndispersion profiles inside the virial radius and a mild decline in the outermost regions. In contrast, late-type galaxies show always decreasing\nvelocity dispersions profiles. No correlation has been found between the fraction of blue galaxies and cluster global properties,such as cluster\nvelocity dispersion and galaxy concentration. In contrast, we found correlation between the X-ray luminosity and the fraction of blue galaxies.\nConclusions. These results indicate that early- and late-type galaxies may have had different evolution. Thus, blue galaxies are located in more\nanisotropic and radial orbits than early-type ones. Their star formation seems to be independent of the cluster global properties in low\nmass clusters, but not for the most massive ones. We consider that it is unlikely that the whole blue population consists of recent arrivals\nto the cluster. These observational results suggest that the global environment could be important for driving the evolution of galaxies\nin the most massive cluster (σ > 800 km s−1 ). However, the local environment could play a key role in galaxy evolution for low mass\nclusters.\nKey words. galaxies: clusters: general\n\n1. Introduction\nThe large amount of spectroscopic and photometric data obtained during the last years by surveys such as the Sloan Digital\nSky Survey (SDSS; York et al. 2000) or the 2dF Galaxy\nRedshift Survey (2dFGRS; Colless et al. 2001) have opened\na new horizon for the study of galaxy evolution, and in particular in the study of galaxy clusters. It is well known that the\nenvironment plays an important role in the evolution of galaxies, and it is one of the keys that a good galaxy evolution theory should address. There are several physical mechanisms, not\npresent in the field, which can dramatically transform galaxies\nin high density environments. Galaxies in clusters can evolve\ndue to, e.g., dynamical friction, which can slow down the\nmore massive galaxies, circularise their orbits and enhance\ntheir merger rate (den Hartog & Katgert 1996; Mamon 1992).\nSend offprint requests to: J. A. L. Aguerri\n\nInteractions with other galaxies and with the cluster gravitational potential can disrupt the outermost regions of the\ngalaxies and produce galaxy morphological transformations\nfrom late- to early-types (Moore et al. 1996), or even change\nmassive galaxies into dwarf ones (Mastropietro et al. 2005).\nSwept of cold gas produced by ram pressure stripping\n(Gunn & Gott 1972 ; Quilis et al. 2000) or swept of the hot\ngas reservoirs (Bekki et al. 2002) can alter the star formation\nrate (SFR) of galaxies in clusters. But it is still a matter of\ndebate which of these mechanisms is the main responsible\nof the galaxy evolution in galaxy clusters (see Goto 2005).\nNevertheless, it is clear that all of these mechanisms transform\ngalaxies from late- to early-types, and can produce the different\nsegregations observed in galaxy clusters.\nOne of the first segregations discovered in galaxy clusters was the morphological one. The first evidences of such\nsegregation date from Curtis (1918) and Hubble & Humason\n\n\f2\n\nAguerri et al.: Global Properties of Nearby Galaxy Clusters\n\n(1931), and was quantified by Oemler (1974) and Melnick\n& Sargent (1977). In a thorough work, Dressler (1980)\nanalysed a sample of 55 nearby galaxy clusters, containing over 6000 galaxies, and observed that elliptical and\nS0 galaxies represent the largest fraction of galaxies located in the innermost and denser regions of galaxy clusters. In contrast, the outskirts of the clusters were dominated by spiral galaxies. In more distant clusters the fraction of E galaxies is as large or larger than in low-redshift\nclusters, but the S0 fraction is smaller (Dressler et al. 1997;\nFasano et al. 2000). This has been interpreted as an evolution\nwith redshift, being late-type galaxies transformed into earlytype ones. Segregations in velocity space have also been observed in galaxy clusters. Early observations found that E\nand S0 galaxies showed smaller velocity dispersions than spirals and irregulars (Tammann 1972; Melnick & Sargent 1977;\nMoss & Dickens 1977). This has also been confirmed by\nother authors during the last two decades (Sodre et al. 1989;\nBiviano et al. 1992; Andreon et al. 1996; Stein 1997). The data\nfrom the ENACS survey (Katgert et al. 1998) produced a large\nsample of galaxies with spectroscopic redshifts and shed more\nlight to this problem. Thus, Adami et al. (1998) studied a sample of 2000 galaxies, confirming early findings that the velocity dispersion of galaxies increases along the Hubble sequence: E/S0 galaxies show smaller velocity dispersions than\nearly- and late-type spirals. This segregation was also observed\nin the velocity dispersion profiles (VDPs): late-type galaxies\nhave decreasing VDPs, while E, S0 and early spirals show almost flat VDPs (Adami et al. 1998). The different kinematics\nshown by the different types of galaxies was analysed in more\ndetail by Biviano & Katgert (2004) who found that the velocity segregation of the different Hubble types is due to differences in orbits. Thus, early-type spirals have isotropic orbits, while late-type ones are located in more anisotropic orbits. The observed morphological and velocity segregation in\nclusters have been usually used to conclude that late-type spiral galaxies in clusters are recent arrivals to the cluster potential\n(Stein 1997; Adami et al. 1998).\nStar formation in galaxies is also affected by the environment. Butcher & Oemler (1984) found that the fraction\nof blue galaxies, fb , in clusters is smaller than in the field\nand evolves with redshift: more distant clusters show larger\nvalues of fb . This trend was interpreted as an evolutionary\neffect of the SFR in galaxy clusters. But the significant\nincrease of new data has made it clear that the Butcher-Oemler\neffect is not only an evolutionary trend. A large scatter\nin the values of fb has been observed in narrow redshift\nranges (Smail et al. 1998; Margoniner & de Carvalho 2000;\nGoto et al. 2003), which suggests that the variation of fb\nis influenced by environmental effects. In the past, many\nauthors have tried to find correlations of fb with cluster\nproperties, such as X-ray luminosity (Andreon & Ettori 1999;\nSmail et al. 1998; Fairley et al. 2002), luminosity limit\nand\nclustercentric\ndistance\n(Ellingson et al. 2001;\nGoto et al. 2003;\nDe Propris et al. 2004),\nrichness\n(Margoniner et al. 2001; De Propris et al. 2004), cluster concentration (Butcher & Oemler 1984; De Propris et al. 2004),\npresence of substructure (Metevier et al. 2000) or cluster\n\nvelocity dispersion (De Propris et al. 2004). Some of these\nworks found correlations between fb and the cluster environment while others did not, being such connection still a\nmatter of debate. However, these works were usually done\nusing small and heterogeneous cluster samples (but see e.g.,\nDe Propris et al. 2004).\nEnvironmental effects have also been invoked in order\nto explain the differences between the photometrical components of cluster and field spiral galaxies. Thus, it has been\nobserved that the scale-lengths of the disks of spiral galaxies in the Coma cluster are smaller than those of similar\ngalaxies in the field (Gutiérrez et al. 2004; Aguerri et al. 2004).\nInteractions between galaxies or with the cluster potential\ncan disrupt the disks of spiral galaxies in clusters. They\ncan be strong enough for transforming bright late-type spiral galaxies in dwarfs (Aguerri et al. 2005a). The disrupted\nmaterial would be part of the intracluster light already detected in some nearby galaxy clusters (Arnaboldi et al. 2002;\nArnaboldi et al. 2004 ; Aguerri et al. 2005b) and galaxy groups\n(Castro-Rodrı́guez et al. 2003; Aguerri et al. 2006).\nThe observational results summarised before illustrate the\nimportant role played by environment in galaxy evolution.\nThey also indicate that late-type and early-type galaxies in\nclusters are two different families of objects with different properties, which points to different origins or evolution.\nNevertheless, the main mechanisms responsible of this different evolution still remain unknown. In the present paper, we\nstudy one of the largest and more homogeneous galaxy cluster\nsample available in the literature. We have obtained the cluster\nmembership, mean velocity, velocity dispersion, virial radius\nand positions for a sample of 88 clusters located at z < 0.1.\nWe have investigated the main properties of a large sample of\nearly (red) and late (blue) types of galaxies, such as their location within the cluster, their mean velocity dispersion, their\nVDPs, the LX − σ relation, and the fraction of blue galaxies for\neach cluster. This work provides important information about\nthe properties of galaxies in nearby clusters, which will be\nuseful in order to put constraints on cosmological models of\ncluster formation. This is the first paper of a series in which\nwe will analyse the properties of the dwarf galaxy population\n(Sánchez-Janssen et al. in preparation), substructure in galaxy\nclusters (Aguerri et al. in preparation), and composite luminosity function of galaxy clusters (Sánchez-Janssen et al., in preparation).\nThe paper is organised as follows. Section 2 shows the discussion about the galaxy cluster sample. The cluster membership and cluster global parameters are presented in Section 3.\nThe results obtained about the morphological segregation, velocity dispersion profiles, LX − σ relation, and the fraction of\nblue galaxies are given in Sections 4, 5, 6 and 7, respectively.\nThe discussion and conclusions are presented in Sections 8 and\n9, respectively. Throughout this work we have used the cosmological parameters: Ho = 75 km s−1 Mpc−1 , Ωm = 0.3 and\nΩΛ = 0.7.\n\n\fAguerri et al.: Global Properties of Nearby Galaxy Clusters\n\n3\n\n2. Galaxy cluster Sample\nWe have used photometric and spectroscopic data of objects classified as galaxies from the SDSS-DR4, an imaging and spectroscopic survey of a large area in the sky\n(York et al. 2000). The imaging survey was carried out\nthrough five broad-band filters, ugriz, spanning the range\nfrom 3000 to 10000 Å, reaching a limiting r-band magnitude ≈ 22.2 with 95% completeness, and covering an\narea of 6670 deg2 (Adelman-McCarthy et al. 2006). A series of pipelines process the imaging data and perfom the\nastrometric calibration (Pier et al. 2003), the photometric reduction (Lupton et al. 2002) and the photometric calibration\n(Hogg et al. 2001). Objects brighter than mr = 17.77 were selected as possible targets for the spectroscopic survey, covering\nan area of 4783 deg2 of the sky for the DR4. The spectroscopic\n′′\ndata were obtained with optical fibers with a diameter of 3 at\nthe focal plane, resulting in an spectral covering in the wavelength range 3800–9200 Å with a resolution of λ/∆λ ≈ 2000.\nOur sample consists of all clusters with known redshift at\nz < 0.1 from the catalogues of Abell et al. (1989), Zwicky et\nal. (1961), Böhringer et al.(2000) and Voges et al. (1999) that\nhave been mapped by the SDSS-DR4. We downloaded only\nthose galaxies located within a radius of 4.5 Mpc around the\ncentres of the galaxy clusters. Only those clusters with more\nthan 30 galaxies with spectroscopic data in the searching radius\nwere considered, resulting in a sample formed by 240 clusters\nfollowing the previous criteria. The SDSS-DR4 spectroscopic\ngalaxy target selection was done by an automatic algorithm\n(see Strauss et al. 2002). The main galaxy sample consists of\ngalaxies with r-band Petrosian magnitudes brighter than 17.77\nand r-band Petrosian half-light surface brightness brighter than\n24.5 mag arcsec−2 . The completeness of this sample is high,\nexceeding 99% (see Strauss et al. 2002). However, some of\nthe selected spectroscopic targets were not observed at the end.\nThis incompleteness has several causes, including the fact that\n′′\ntwo spectroscopic fibers cannot be placed closer than 55 on a\ngiven plate, possible gaps between the plates, fibers that fall out\nof their holes, and so on. According to these reasons, we expect\nthat the incompleteness of the spectroscopic data will be more\nimportant for bright galaxies in high density environments such\nas galaxy clusters. Figure 1 shows the mean completeness1 of\nthe SDSS-DR4 spectroscopic data as a function of the r-band\nmagnitude for the selected galaxies, where a fast increment towards faint magnitudes can be observed. In order to avoid possible effects on the results due to this effect, we have completed\nthe spectroscopic SDSS-DR4 observations with the data available at the Nasa Extragalactic Database (NED). Figure 1 also\nshows the mean completeness as a function of r-band magnitude after the spectroscopic data from NED were included in\nthe sample. Notice that the new mean completeness is almost\nconstant (≈ 85%) for all magnitudes brighter than mr = 17.77.\nWe have made a second selection of the clusters by considering\nonly those from our original list with completeness larger than\n70% for galaxies brighter than 17.77 in the r-band.\n1\n\nWe have defined the spectroscopic completeness per magnitude\nbin as the ratio of the number of galaxies with spectroscopic data to\nthe number of galaxies with photometric information.\n\nFig. 1. Mean completeness of the cluster sample as a function\nof the r-band magnitude. Diamonds represent the spectroscopic\ndata from SDSS-DR4 and black circles after the completion\nwith data from NED.\n\n3. Cluster Membership\nClusters properties such as the mean cluster velocity, the velocity dispersion, the cluster centre or the virial radius can\nbe significantly affected by projection effects. Several methods\nhave been developed during decades in order to obtain reliable\ngalaxy cluster membership and avoid the presence of interlopers. They can be classified in two families. First, those algorithms that use only the information in the velocity space, e.g.\n3σ-clipping techniques (Yahil & Vidal 1977), gapping procedures (Beers et al. 1990; Zabludoff et al. 1990, hereafter ZHG\nalgorithm) or the KMM algorithm (Ashman et al. 1994). The\nother family corresponds to those algorithms which use information of both position and velocity, such as the methods designed by Fadda et al. (1996), den Hartog & Katgert (1996), or\nRines et al. (2003).\nThe cluster membership in our sample was obtained using\na combination of two algorithms. A first rough cluster membership determination was obtained using the ZHG algorithm,\nwhich in a second step was then refined using the KMM algorithm. The ZHG algorithm is a typical gapping procedure\nwhich determines the cluster membership by the exclusion of\nthose galaxies located at more than a certain velocity distance\n(∆v) from the nearest galaxy in the velocity space. Then, the\nmean velocity (vm ) and velocity dispersion (σ) of the remaining galaxies are calculated. After sorting objects with velocities\ngreater than vm , any galaxy separated in velocity more than σ\nfrom the previous one is classified as non member. The same is\ndone for those galaxies with velocities less than vm . The process is repeated several times and finally the mean cluster velocity (vc ) and the cluster velocity dispersion (σc ) are obtained.\nZabludoff et al. (1990) pointed out that this method lacks statistical rigour and tends to give overestimated values of σc . One\nof the disadvantages of this method is that the results obtained\nstrongly depend on the chosen value of ∆v. Large values of ∆v\nimply that a large fraction of interlopers are identified as cluster members. On the contrary, small values of ∆v result in the\n\n\f4\n\nAguerri et al.: Global Properties of Nearby Galaxy Clusters\n\nlost of cluster galaxies. We have investigated the variation of\nσc for different values of ∆v, obtaining that ∆v=500 km s−1\nis an appropriate value for our clusters. This method has also\nthe advantage that has an easy implementation and does not require too much computational time. Recently, it has been used\nin works involving a large number of clusters, such as those\nfrom the 2dFGRS (De Propris et al. 2003). The ZHG algorithm\nsplits the velocity histograms in different galaxy groups, being one of them located at the catalogued redshift of the cluster. That group was taken and analysed in more detail with the\nKMM algorithm. In the few cases where there was no galaxy\ngroup located at the catalogued redshift we identified the most\nsignificant groups having z < 0.1 as the cluster itself.\nThe KMM algorithm (Ashman et al. 1994) estimates the\nstatistical significance of bi-modality in a dataset. We have run\nit to the group of galaxies given by the ZHG algorithm which\ncontains the catalogued redshift of the cluster. The KMM algorithm gives us the compatibility of the velocity distribution of\nsuch group of galaxies with a single or multiple Gaussian distribution. We considered three different cases which are summarised in Fig. 2:\n– Single cluster: the velocity distribution of the galaxies is\ncompatible with a single Gaussian, e.g. Abell 757.\n– Cluster with substructure: the velocity distribution is compatible with multiple groups. We identified the cluster as\nthe group with the largest number of galaxies plus those\ngroups which mean velocities lie within 3σ from the mean\nvelocity of the largest one2 , e.g. Abell 1003.\n– Cluster with contamination: the velocity distribution is\ncompatible with the presence of several groups, but the\nmean velocities of the smaller groups deviate more than\n3σ from the most populated one, which we identify as the\ncluster itself, e.g. Abell 168 .\nWe have explored the differences in the values of vc and σc\nif we consider as interlopers those groups of galaxies located at\na velocity distance larger than 1σ or 3σ from the mean velocity\nof the main galaxy group. We obtained that the differences in vc\nand σc in 90% of the clusters are less than 20%. The remaining\n10% of the clusters are those with significant structure in the\nvelocity distribution, being most of them more than one cluster\nalong the line of sight. Thus, we have adopted 3σ as the default\nexcept for those clusters with significant differences between\n1σ and 3σ, for which we have measured the mean velocity and\nvelocity dispersion of the cluster adopting the criteria of 1σ.\nThrough all of this process, the determination of vc and σc was\ndone using the biweight robust estimator of Beers et al. (1990).\n\n3.1. Cluster global parameters\nOnce the cluster membership was determined, we obtained the\nglobal parameters of each cluster, i.e., mean velocity (vc ), velocity dispersion (σc ), cluster centre, and the radius r200 . All of\nthese parameters were computed using only the cluster members.\n2\nIn this case σ is the velocity dispersion of the largest group of\ngalaxies.\n\nFig. 2. Velocity histograms of three representative clusters of\nthe sample. The vertical full lines represent the mean velocity\nof the different groups of galaxies in which KMM algorithm\nhas divided the velocity histogram. The dotted vertical lines\nrepresent vc ± 3σc .\nThe determination of the cluster centre is important in order to accurately compute the other parameters of the clusters.\nThe centre of the cluster is determined by the potential well,\nwhich can be traced by the position of the peak of the X-ray luminosity of the cluster. That peak was considered as the centre\nof those clusters from our sample with X-ray measurements in\nthe literature. Unfortunately, not all the clusters from the sample have X-ray data. In that case, the centre of these clusters\nwas determined by the peak of the galaxy surface density3 . For\nthose clusters with X-ray data we have compared the centres\ngiven by the peaks of X-ray luminosity and galaxy surface density, obtaining a mean difference of 150 kpc.\nAnalytic\nmodels\n(Gott 1972)\nand\nsimulations\n(Cole & Lacey 1996) indicate that the virialized mass of\nclusters is generally contained inside the surface where the\nmean inner density is 200ρc , where ρc is the critical density\nof the Universe. The radius of that surface is called r200 .\nWe have computed the r200 for our clusters using the same\napproximation as Carlberg et al. (1997):\n√\n3σc\nr200 =\n,\n(1)\n10 H(zc )\nwhere H(zc ) is the Hubble constant at the cluster redshift\nzc .\n3\nThe galaxy surface density was computed using the algorithm designed by Pisani (1996).\n\n\fAguerri et al.: Global Properties of Nearby Galaxy Clusters\n\nThe previous global parameters of the clusters (vc , σc , r200\nand centre) were obtained as described above but in a recurrent way. In a first step, they where determined using all cluster\nmember galaxies around 4.5 Mpc from the centre of the cluster. After this step we recalculated the parameters using only\nthose galaxies located inside r200 . The method was repeated\nseveral times until the difference in the parameters obtained in\ntwo consecutive steps was less than 5%. Three or four iterations\nwere usually enough for reaching the convergence. In order to\nobtain reliable parameters of the clusters, those with less than\n15 galaxies within r200 were removed from our list. This results in a final sample formed by 110 nearby galaxy clusters.\nTable 1 shows the sample of galaxy clusters and their global\nparameters. The columns of Table 1 represent: (1) galaxy cluster name, (2, 3) cluster centres (α (J2000), δ (J2000)), (4) mean\nradial velocity, (5) cluster velocity dispersion, (6) r200 radius,\n(7) number of galaxies within r200 , and (8) spectroscopic completeness.\nFor 6 clusters (Abell 1003, Abell 1032, Abell 1459, Abell\n2023, Abell 2241 and ZwCl1316.4-0044) large differences in\nthe mean recessional velocity have been found between the values given in Table 2 and those from NED. These are the clusters\nwith no significant galaxy group at the catalogued redshift (see\nSection 3).\nIn order to consider the possible influence of neighbouring\nclusters on the global properties of the sample we searched in\nthe surroundings of each cluster for the presence of companions. Following Biviano & Girardi (2003), we have considered\nthat two clusters, i and j, are in interaction when:\n|vi − vj | < 3(σi + σj )\n\nRi,j < 2(r200,i + r200,j ),\n\n(2)\n\nwhere Ri, j is the projected distance between the centres of\nthe clusters and vi, j , σi, j , r200,i, j their respective mean velocities,\nvelocity dispersions and r200 . We found 16 couples of clusters\nin interaction according to the previous criteria. The remaining\nsample (88 clusters) followed the isolation criteria, and will be\nused in the analysis presented in the following sections. Figure\n3 shows the sky distribution of the cluster members and the\ngalaxy velocities as a function of clustercentric distance for a\nsample of 8 clusters. Red points represent the galaxies taken as\ncluster members while black points are interlopers. Notice the\nlarge number of interlopers in some of the galaxy clusters, such\nas Abell 1291, Abell 1383, Abell 2244. Some of them, Abell\n1291 and Abell 1383, were not included in the final isolated\nsample due to the presence of companions.\n\n3.2. Corrections to line-of-sight velocities\nLine-of-sight velocities of galaxies in clusters were corrected\nby two effects: cosmological redshift and global velocity field.\nWe should take into account that we will compare the velocity dispersion of clusters located at different redshifts. Thus,\nfor each galaxy we have 1 + zobs = (1 + zc )(1 + zgal )\n(Danese et al. 1980), being zobs the apparent redshift of the\ngalaxies, zc the cosmological redshift of the cluster, and zgal\nthe redshift of the galaxy respect to the cluster centre. This correction can affect up to 10% for the most distant clusters in our\nsample.\n\n5\n\nGalaxy clusters are frequently part of larger cosmological\nstructures such as filaments, superclusters or multiple systems,\nwhich can affect the velocity field resulting in a modified cluster velocity dispersion. The interaction between galaxy clusters can also produce distorted velocity fields. We have investigated the importance of these effects in the velocity field of\nour clusters by making a least-square fit to the radial velocities\nof cluster galaxies with respect to their position in the plane of\nthe sky (see den Hartog & Katgert 1996; Girardi et al. 1996).\nFor each fit we computed the coefficient of multiple determination, R2 . In order to test the significance of the fitted velocity gradients, we run 1000 Monte Carlo simulations for each\ncluster for which the correlation between position and velocity was removed. This was achieved by shuffling the velocities of the galaxies with respect to their positions. We defined the significance of velocity gradients as the fraction of\nMonte Carlo simulations with R2 smaller than the observed\none. This correction of the velocity field was applied to those\ncluster in which the significance of velocity gradients is larger\nthan 99% ( 30% of the total sample). However, this correction\nhas small effects both in the shape of the velocity dispersion\nprofiles and on the total velocity dispersion (the mean absolute correction was about 40 ± 15 km s−1 ). This is in agreement with similar corrections applied in other cluster samples\n(den Hartog & Katgert 1996; Girardi et al. 1996).\n\n3.3. Comparison with other methods\nSome of the clusters presented in our sample have been previously studied by other authors. However, we have avoided comparing our results with those from the literature given the different datasets used. In order to compare our cluster membership\nmethod with others proposed in the literature, we have computed σc of our clusters with two more methods: a 3σ-clipping\nand the method proposed by Fadda et al. (1996). The median\nabsolute difference between our σc and those computed by the\n3σ-clipping method is only 17 km s−1 . Only 10% of the clusters show important diferences (∆σc > 200 km s−1 ) in the computation of the velocity dispersion of the cluster with the two\nmethods. They correspond to those clusters affected by large\namount of structure along the line of sight. The 3σ-clipping\nmethod gives for these clusters considerably larger values of\nσc than ours. Differences were larger when we compared with\nFadda's method. In this case the mean absolute difference in\nσc between the two methods was 84 km s−1 and 80% of the\nclusters show differences smaller than 200 km s−1 .\nRecently, Popesso et al. (2006) have obtained the values of\nσc for a sample of Abell clusters using SDSS-DR4 data, for\nwhich cluster membership was obtained using the selection algorithm of Katgert et al. (2004). The median absolute difference between our and their σc is 45 km s−1 for the 28 clusters\nin common. Only for 4 clusters (Abell 1750, Abell 1773, Abell\n2244 and Abell 2255) the absolute differences in σc is larger\nthan 200 km s−1 .\nWe have also compared our results with those given in the\ncluster catalogue presented by Miller et al. (2005). We found 16\nclusters in common, being 74 km s−1 the median absolute dif-\n\n\f6\n\nAguerri et al.: Global Properties of Nearby Galaxy Clusters\n\nFig. 3. Galaxy surface density (images) and radial velocity versus distance to the cluster center for the galaxy cluster member\n(red points) of a subsample of 8 clusters. The overplotted circle have a radius equal to r200 for each cluster. The black points\nrepresent interloper galaxies.\nference between our and their σc . In this case, 3 clusters show\nan absolute differences in σc larger than 200 km s−1 .\nWe can conclude that in most of the cases our cluster membership method reported values of σc similar to those given by\nother methods. Only for 10-20% of the clusters the absolute\ndifferences in σc between our method and the others is larger\nthan 200 km s−1 . For these clusters the structure along the line\nof sight is the responsible of the difference, being our σc values\nsmaller than the others.\n\n3.4. L x -σ relation\nWe can learn about the nature of cluster assembly by studying\nthe relations between cluster observables. One of the most universals is the well known relation between the cluster X-ray luminosity and the velocity dispersion of its galaxies (LX ∝ σbc ).\nCluster formation models predict that if the only energy source\nin the cluster comes from the gravitational collapse, then b ≈ 4.\nThis relation has been studied in the literature by many authors\nusing different cluster samples, finding values of b between\n2.9 and 5.3 (Edge & Stewart 1991; Quintana & Melnick 1982;\nMulchaey & Zabludoff 1998;\nMahdavi & Geller 2001;\n\nGirardi & Mezzetti 2001;\nBorgani et al. 1999;\nXue & Wu 2000; Ortiz-Gil et al. 2004; Hilton et al. 2005).\nThe study of the LX − σc relation in our cluster sample will\nbe also useful as another check for the values of σc we have\nderived. We have X-ray data for 48 galaxy clusters from our\nsample. The X-ray data have been obtained from Ebeling et\nal. (1998), Böhringer et al.(2000), Ebeling et al.(2000) and\nLedlow et al.(2003), and the X-ray luminosities are measured\nin the ROSAT band (0.1-2.4 keV).\nFigure 4 shows the LX −σ relation for this subset with available X-ray data in the literature. The Spearman coefficient of\nthe relation is 0.56 and the significance from zero correlation\nis greater than 3σ. This indicates the existence of a correlation\nbetween LX and σc for the clusters of our sample. We used the\nbivariate correlated errors and intrinsic scatter (BCES) bisector\nmethod of Akritas & Bershady (1996) to obtain the coefficient\nand power-law slope estimates of the relation. This fitting technique takes into account errors in both variables and intrinsic\nscatter. The LX − σc relation for our clusters is given by:\nLX (0.1 − 2.4 keV) = 1033.7±1.2σ3.9±0.4\n\n(3)\n\n\fAguerri et al.: Global Properties of Nearby Galaxy Clusters\n\n7\n\n4. Morphological Segregation\n\nFig. 4. LX −σ relation for the 48 galaxy clusters with X-ray data\nin the ROSAT band (0.1-2.4 keV) from our sample. The full\nline represents the best fit using the BCES bisector algorithm\n(see text for more details).\n\nFig. 5. Absolute r-band magnitude as a function of redshift for\nthe galaxies of our cluster sample.\nThis result is in very good agreement with another measurement of this relation using the same ROSAT band (0.1-2.4\nkeV) for the X-ray data and the same fitting algorithm (see\nHilton et al. 2005).\n\n3.5. Redshift distribution and sample completeness\nThe 88 isolated galaxy clusters are located in a redshift range\nbetween 0.02 and 0.1, with an average redshift of 0.071. Figure\n5 shows the absolute r-band magnitude (Mr ) as a function\nof the redshift for the galaxies in our cluster sample4 . It is\nclear that the completeness magnitude is a function of redshift.\nThis figure shows that the full sample is complete for galaxies\nbrighter than Mr = −20.0. The lack of completeness for fainter\ngalaxies will be taken into account in the subsequent analysis.\n4\n\nSee section 3 for the explanation of the computation of the absolute magnitudes of the galaxies.\n\nLight concentration or colours have been used extensively in\nthe literature in order to classify galaxies. Shimasaku et al.\n(2001) and Strateva et al. (2001) using SDSS data, found that\nthe ratio of Petrosian 50 percent light radius to Petrosian 90\npercent light radius, Cin , measured in the r-band image was a\nuseful index for quantifying galaxy morphology. Strateva et al.\n(2001) also found that the colour u − r = -2.22 efficiently separates early- and late-type galaxies at z < 0.4. We have used\ncolours for classifying galaxies, because properties such as velocity dispersion in galaxy clusters are better correlated with\ngalaxy colours than galaxy morphology (Goto 2005). The magnitude of the galaxies were corrected by two effects: Galactic\nabsorption and k−correction. The Galactic absorption in the\ndifferent filters was obtained from the dust maps of Schlegel\net al. (1998). We applied the k−correction using the kcorrect.v4 1 4 code by Blanton et al. (2003) in order to obtain the\nrest-frame magnitudes of the galaxies for the different bandpasses. Once these two corrections were done, we classified\nthe galaxies in red (u − r ≥ 2.22) and blue ones (u − r < 2.22).\nThe galaxy data was downloaded from the SDSS database\naccording to a metric criteria: we downloaded the information\nof all galaxies located within a radius of 4.5 Mpc at each galaxy\ncluster redshift. This means that we are mapping different physical regions for each cluster. In order to avoid this problem we\nhave studied the ratio rmax /r200 for each cluster, being rmax the\nmaximum distance of a galaxy from the cluster centre for each\ngalaxy cluster. We have obtained that all clusters of our sample\nreach rrmax\n= 2, and 50% of them reach rrmax\n= 5.\n200\n200\nOur sample of galaxies consists of 6880 galaxies located\nwithin a radius 2 × r200 , being 62% of them red galaxies and\n38% blue ones. If we consider all galaxies within 5 × r200 then\nthe sample has 10865 galaxies, being 55% and 45% red and\nblue galaxies, respectively. The red and blue galaxies were also\ngrouped in three categories according to their r-band magnitude: Mr < Mr∗ − 1, Mr∗ − 1 < Mr < Mr∗ + 1, and Mr > Mr∗ + 15 .\nThe first group contains the brightest members of the clusters,\nthe third group contains the so-called dwarf population and the\nsecond one is formed by normal bright galaxies. Table 2 shows\nthe median location, r-band absolute magnitude, velocity dispersion and local density6 of the different galaxy groups. In\ngeneral, red galaxies are brighter than blue ones, and are also\nlocated closer to the cluster centre at higher local density regions. The two families of galaxies present different kinematics, in the sense that red galaxies show a smaller velocity dispersion than blue ones. This different kinematic between red\nand blue galaxies has also been seen in other studies, and have\nbeen interpreted as red and blue galaxies having different kind\nof orbits, being the orbits of blue galaxies more anisotropic\nthan the red ones (Adami et al. 1998; Biviano & Katgert 2004).\nOther authors interpret this difference in velocity dispersion as\nan evidence that ram pressure is not playing an important role\nin galaxy evolution in clusters. In contrast, tidal interactions\n5\n\nMr∗ − 5log(h) = −20.04, Blanton et al. (2005)\nThe local surface density (Σ) was computed with the 10 nearest\nneighbours to each galaxy belonging to the cluster.\n6\n\n\f8\n\nAguerri et al.: Global Properties of Nearby Galaxy Clusters\n\nshould be the dominant mechanism (Goto 2005). All of these\nproperties are independent of the sampled area.\nIt is also interesting that red dwarf galaxies are located\nat similar environments as the brightest red ones: close to\nthe cluster centre in high local density regions (see also\nHogg et al. 2004). But the red dwarf population shows a larger\nvelocity dispersion than the brightest red galaxies. Biviano &\nKatgert (2004) found that the brightest cluster members were\nnot in equilibrium with the cluster potential. They are especial\ngalaxies that could have formed close to the cluster centre or\nhave fallen to this region due to dynamical friction. In contrast,\ndynamical friction is not so efficient in the dwarf population, so\nthat the main presence of these galaxies in the central regions of\nthe clusters should be due to their origin. The discussion about\nthe properties and origin of the dwarf population will be given\nin another paper (Sánchez-Janssen et al., in preparation).\n\n5. Velocity Dispersion Profiles\nThe adopted cluster velocity dispersion was calculated with the\ngalaxies located within the r200 radius of each cluster. But, how\ndoes σ depend on the clustercentric distance in our sample?.\nThis can be answered by studying the integrated velocity dispersion profiles (VDPs) of the clusters. These profiles also provide information about the dynamical properties of the galaxies. Thus, a system with galaxies predominantly in radial orbits produces an outwards declining VDP, while the opposite\nbehaviour suggests instead that the galactic orbits are largely\ncircular. In contrast, constant VDPs are characteristic of an\nisotropic distribution of velocities (Solanes et al. 2001). Figure\n6 shows the VDPs for some of the clusters in our sample. They\nshow the velocity dispersion of the cluster at a given radius\nevaluated using all the galaxies within that radius, without any\nrestriction in their luminosities. The errors showed in Fig. 6\nwere computed using the approximation given by Danese et al.\n(1980).\nIn order to classify the VDPs of our clusters, we computed\nthe velocity dispersion (σi , i = 1, 2, 3, 4, 5) of the galaxies in the\nclusters located within five different radius: 0.4×r200 , 0.6×r200 ,\n2×r200 , 3×r200 and 4×r200 , respectively. We compared these\nvalues with σc , given in Table 1. The resulting mean ratios\nσi /σc were: 1.02± 0.04, 1.01±0.01, 0.97±0.01, 0.94±0.02 and\n0.94±0.02, for i = 1, 2, 3, 4, 5, respectively. These values indicate that within r200 the VDPs of the total galaxy cluster population are consistent with being flat. The mean variation of the\nVDPs inside r200 is only 2%. The values of σi /σc , i = 3, 4, 5\nshow that, outside r200 the VDPs slowly decrease. The mean\nvariation of the VDPs outside r200 is −6%. No differences in the\nratios σi /σc have been found when we have divided the galaxy\nsample between bright (Mr < Mr∗ +1) and dwarf (Mr > Mr∗ +1)\ngalaxies. This flat behaviour of the VDPs inside r200 suggests\nthat galaxies in these areas have an isotropic distribution of velocities. In contrast, the decline with radius of VDPs outside\nr200 points to radial orbits (Solanes et al. 2001).\nFigure 6 also shows the VDPs of early- (red) and late-type\n(blue) galaxies. In most profiles the velocity dispersion of blue\ngalaxies is larger than the corresponding one for early-type\nones. We have also analysed the shape of VDPs of blue and\n\nFig. 7. Histograms of the ratios σi /σc , i = 1, 2, 3, 4, 5 for the\ngalaxies in the clusters. The black full line represent all galaxies, the blue and red lines correspond to late- and early-type\nones. See text for more details.\n\nred galaxies as we did for the total sample. For red galaxies,\nwe obtained that σi /σc,r are 1.04± 0.03, 1.03±0.03, 0.97±0.02,\n0.96±0.02 and 0.96±0.03, for i = 1, 2, 3, 4, 5, respectively.\nThe values of σi /σc,b for the blue galaxies are: 1.15± 0.07,\n1.04±0.03, 0.95±0.04 and 0.93±0.04 and 0.92±0.04, respectively. In those computations, σc,r and σc,b represent the velocity dispersion of the red and blue galaxies within a radius\nequal to r200 , respectively. Figure 7 show the distribution of\nσi /σc , i = 1, 2, 3, 4, 5 for the blue, red and the total galaxy sample.\nThe VDPs have been studied in the literature by several authors. Most of them conclude that for large radii\n(r > 1 Mpc) the VDPs are flat (Girardi & Mezzetti 2001;\nRines & Diaferio 2006; Fadda et al. 1996; Muriel et al. 2002).\nThis is consistent with the mild decrease that we have found\nin our clusters. The VDPs for red galaxies in our sample are\nalmost flat outside r200 . This is not the case of the VDPs of\nblue galaxies which clearly decrease with radius outside r200 .\nIn the inner regions (r < r200 ) the VDPs of the total sample\nand those corresponding to the red galaxies are flat. In contrast, the VDPs of blue galaxies decrease with radius. Different\nauthors show that VDPs can decrease or increase with radius.\nden Hartog & Katgert (1996) made a thorough study and found\nthat the variations of the VDPs in the innermost regions of clusters (r < 0.5 Mpc) are real and not due to noise or bad centre\nelection. We have re-computed σ1 /σc and σ2 /σc only for those\nclusters with X-ray centres, and our results did not significantly\nchange. Thus, we can conclude that in our galaxy cluster sample only blue galaxies show increasing VDPs towards the centre of the cluster, while red galaxies show flat VDPs.\n\n\fAguerri et al.: Global Properties of Nearby Galaxy Clusters\n\n9\n\nTable 1. Main properties of the different types of galaxies\nGalaxies within r/r200 < 5\nu − r < 2.22\nu − r < 2.22 & Mr < Mr∗ − 1\nu − r < 2.22 & Mr∗ − 1 < Mr < Mr∗ + 1\nu − r < 2.22 & Mr > Mr∗ + 1\nu − r ≥ 2.22\nu − r ≥ 2.22 & Mr < Mr∗ − 1\nu − r ≥ 2.22 & Mr∗ − 1 < Mr < Mr∗ + 1\nu − r ≥ 2.22 & Mr > Mr∗ + 1\nGalaxies within r/r200 < 2\nu − r < 2.22\nu − r < 2.22 & Mr < Mr∗ − 1\nu − r < 2.22 & Mr∗ − 1 < Mr < Mr∗ + 1\nu − r < 2.22 & Mr > Mr∗ + 1\nu − r ≥ 2.22\nu − r ≥ 2.22 & Mr < Mr∗ − 1\nu − r ≥ 2.22 & Mr∗ − 1 < Mr < Mr∗ + 1\nu − r ≥ 2.22 & Mr > Mr∗ + 1\n\n< r/r200 >\n1.85±0.02\n1.79±0.11\n1.90±0.02\n1.74±0.03\n1.03±0.01\n0.95±0.05\n1.10±0.02\n0.85±0.04\n< r/r200 >\n0.97±0.01\n1.15±0.07\n1.04±0.01\n0.85±0.01\n0.67±0.01\n0.57±0.03\n0.69±0.01\n0.61±0.02\n\nThe previous findings can also be seen in Fig 8. We show\nthe VDPs of the different galaxy classes for the normalised\ncluster, which was obtained by normalising the scales and velocities of each galaxy of the sample. Thus, the radial distance\nof each galaxy to the cluster centre was scaled by r200 of the\ncorresponding cluster, and the relative velocity of each galaxy\ncluster was normalised by the velocity dispersion of the cluster. Figure 8 shows the VDPs which correspond to the total,\nbright (Mr < Mr∗ + 1) and dwarf (Mr > Mr∗ + 1) galaxy samples. We have also distinguished between red and blue objects.\nThe VDPs of the total galaxy sample indicate that blue galaxies have always larger velocity dispersion than red ones. They\nalso show always decreasing VDPs, while red ones have almost\nconstant and slowly decrease VDPs inside and outside r200 , respectively. These features can also be seen in the VDPs of the\nbright galaxy sample. In contrast, red and blue dwarfs show\ndecreasing VDPs inside r200 .\nThe shape of the VDPs can provide information about\nthe dynamical state of the galaxies. Thus, clusters with\ngalaxies predominantly in radial orbits produce an outwards\ndeclining VDP. This is the case of the blue galaxies of\nour sample, which is in agreement with previous findings\n(Biviano & Katgert 2004; Adami et al. 1998). We have also\nobtained that the red dwarf galaxies inside r200 has an outwards\ndeclining VDP. This would imply that this kind of galaxies may\nalso be located in radial orbits. In contrast, constant VDPs imply an isotropic distribution of velocities (Solanes et al. 2001).\nThis is the case of the red bright galaxy population inside r200 .\n\n6. Fraction of blue galaxies\nButcher & Oemler (1984) observed that the fraction of blue\ngalaxies ( fb ) in clusters evolves with redshift, in the sense that\ngalaxy clusters located at medium redshift have a larger fb than\nnearby ones. This has been usually interpreted as an evolutionary trend in clusters. But it is a matter of debate which is the\nrole played by the environment in the change of the fraction\n\n< Mr >\n-19.65±0.01\n-21.54±0.02\n-20.00±0.01\n-18.74±0.02\n-20.16±0.01\n-21.62±0.02\n-20.20±0.01\n-18.91±0.02\n< Mr >\n-19.61±0.02\n-21.56±0.03\n-19.96±0.01\n-18.70±0.02\n-20.14±0.01\n-21.65±0.02\n-20.19±0.01\n-18.92±0.02\n\n<σ>\n1.04±0.01\n1.08±0.09\n1.03±0.01\n1.05±0.02\n0.90±0.01\n0.78±0.03\n0.91±0.01\n0.90±0.03\n<σ>\n1.08±0.02\n1.18±0.13\n1.08±0.02\n1.07±0.03\n0.91±0.01\n0.80±0.03\n0.92±0.01\n0.89±0.03\n\n< log(Σ) >\n0.46±0.08\n0.40±0.25\n0.38±0.08\n0.64±0.14\n0.80±0.05\n0.89±0.14\n0.75±0.06\n1.06±0.12\n< log(Σ) >\n0.80±0.07\n0.62±0.24\n0.70±0.07\n1.02±0.09\n0.98±0.04\n1.02±0.13\n0.94±0.05\n1.19±0.10\n\nNgal\n4937\n94\n3126\n1717\n5928\n537\n4592\n729\nNgal\n2636\n54\n1648\n934\n4244\n397\n3239\n608\n\nof blue galaxies. We have computed fb in our sample of galaxy\nclusters, studying the variation with z and the possible influence\nof the environment.\n\n6.1. Adopted aperture and limiting magnitude\nThe original analysis of Butcher & Oemler (1984) defined blue\ngalaxies as those within a radius containing 30 per cent of the\ncluster population, being brighter than Mv = −20 and bluer by\n0.2 mag in B − V than the colour-magnitude relation defined\nby the cluster early-type galaxies. It has been noticed by several authors that the fraction of blue galaxies strongly depends\non the magnitude limit and the clustercentric distance used\n(Ellingson et al. 2001; Goto et al. 2003; De Propris et al. 2004;\nAndreon et al. 2006). They observed that fb grows when the\nmagnitude limit is fainter and the aperture is larger, reflecting the existence of a large fraction of blue faint galaxies in\nthe outer regions of the clusters. De Propris et al. (2004) considered appropriate to measure fb in apertures based on cluster physical properties. They used r200 as the aperture radius\nwhere they measured fb for their clusters. We have adopted\nalso this radius in order to determine fb in our galaxy clusters. As it was previously commented, fb depends also on\nthe adopted limiting magnitude of the galaxies in clusters.\nIt should be noticed that as we move to higher redshifts we\nsystematically lose faint galaxies (see Fig 2). Our clusters\nspread in a redshift range 0.02 < z < 0.1, and only galaxies brighter than Mr = −20.0 (≈ Mr∗ + 0.5) can be observed\nat all redshifts. For this reason, we have adopted this absolute magnitude as the limiting magnitude for the computation of fb . This ensures us to work with a complete galaxy\nsample at all redshifts. Other authors adopted fainter limiting\nmagnitudes, e.g. M ∗ + 1.5 (De Propris et al. 2004) or M ∗ + 3\n(Margoniner & de Carvalho 2000). If there is a large number\nof blue galaxies at faint magnitudes, we expect that our values of fb will be smaller than those reported by the previous\nauthors.\n\n\f10\n\nAguerri et al.: Global Properties of Nearby Galaxy Clusters\n\nFig. 6. Velocity dispersion profiles of some clusters of our sample. The black symbols represent the velocity dispersion profile\ntaking into account all types of galaxies. Blue and red symbols represent the velocity dispersion profiles corresponding to blue\nand red galaxies, respectively.\n\n6.2. Colour-magnitude diagrams\nWe determined the g − r versus r colour-magnitude diagrams\nfor all the clusters in our sample. The colour-magnitude relation was measured by a robust fitting routine by minimising the\nabsolute deviation in g−r colour, using only early-type galaxies\nlocated within an aperture of radius equal to r200 . The galaxy\ntypes were determined according to the u−r colour and the light\ngalaxy concentration parameter, Cin . These two criteria allow\nus to identify the most reliable sample of E/S0 galaxies (see\nShimasaku et al. 2001; Strateva et al. 2001). Thus, we considered early-type galaxies those with u − r ≥ 2.22 and Cin < 0.4.\nFigure 9 shows the colour-magnitude diagrams of four representative galaxy clusters. The colour-magnitude relation fitted\nin each case is also overploted. Figure 9 (left column) also\nshows the histograms of the colour distribution, marginalised\nover the fitted colour-magnitude relation.\nThe average of the slopes of the colour-magnitude relations\nof the early-type galaxies of the clusters is -0.014±0.008. This\nslope is within the errors in agreement with the slope obtained\nby Gallazzi et al. (2006) for a large sample of galaxies using\nSDSS data. It is also in agreement with the average B − R slope\n\nobtained by De Propris et al. (2004) for a sample of galaxy\nclusters from 2dFGRS.\n\n6.3. Calculation the blue fraction of galaxies\nAs we explained before, the blue fraction of galaxies was computed using only those galaxies brighter than Mr = −20 and\nlocated within an aperture of radius r200 . In the present study\nwe only used spectroscopically confirmed galaxy cluster members. This should not bias our results, especially due to our high\ncompleteness. Figure 10 presents fb as a function of redshift.\nThe errors of fb were computed according to the prescription\ngiven by De Propris et al. (2004). We observe no evolution of\nfb with redshift, which means that our sample is ideal to study\nthe effects of the environment on fb .\nWe have considered three cluster properties (concentration,\nvelocity dispersion and X-ray luminosity) of each cluster in order to analyse the dependence of fb on the environment. The\nconcentration parameter was computed following the prescription of De Propris et al. (2004), i.e. C = log(r60 /r20 ), where r60\nand r20 are the radii containing 60 and 20 per cent of the cluster\ngalaxies, respectively. The velocity dispersion of the clusters\n\n\fAguerri et al.: Global Properties of Nearby Galaxy Clusters\n\n11\n\nFig. 8. Velocity dispersion profiles of the galaxies of the normalised cluster. The total galaxy population is showed in the top\npanel. Bright galaxies (Mr < Mr∗ + 1) are in the middle panel, and the bottom panel shows the VDPs corresponding to the dwarf\ngalaxy sample (Mr > Mr∗ + 1). The VDP of the total, blue and red galaxy samples are represented by black, blue and red colours,\nrespectively (see text for more details).\nEbeling et al. 2000 and Ledlow et al. 2003), being measured in\nthe ROSAT band (0.1-2.4 keV). We only found X-ray data for\n48 clusters of the sample.\n\nFig. 10. The fraction of blue galaxies ( fb ) as a function of redshift of the galaxy clusters.\nwas taken from Table 1. The X-ray luminosities were obtained\nfrom the literature (Ebeling et al. 1998, Böhringer et al.2000,\n\nFigure 11 shows the dependence of the fraction of blue\ngalaxies on concentration, cluster velocity dispersion and Xray luminosity. The non-parametric Spearman test returns that\nfb has a low correlation with concentration and velocity dispersion. The fraction of blue galaxies correlates best with the\nvelocity dispersion, but the significance of the correlation is\n2.6σ. In contrast, the Spearman test shows correlation between\nfb and X-ray luminosity, being the significance of this correlation just 3σ. Notice that the points are distributed in the LX − fb\nplane following a triangular shape. Clusters with large X-ray\nluminosity (LX (0.1 − 2.4keV) > 1045 ergs−1 ) show small fractions of blue galaxies (less than 10%). Nevertheless, those clusters with small X-ray lumisosity show small and large fraction\nof blue galaxies. This correlation could indicate that there is a\nthreshold over which cluster environment can affect the galaxy\ncolours, and play a role in the galaxy evolution. This means\nthat, according with our LX − σ relation, the evolution of galaxies could be driven by the cluster environment for those clusters\n\n\f12\n\nAguerri et al.: Global Properties of Nearby Galaxy Clusters\n\nFig. 9. Colour-magnitude relation (left) and histograms (right) of marginalised colour distribution for four representative clusters\nat different redshifts of our cluster sample. The full line in left panels represent the fitted colour-magnitude relation. The vertical\npoint lines in right panel represent the blue/red separation in the Butcher-Oemler effect. The red points are the galaxies with\nu − r ≥ 2.22 and Cin < 0.4 (see text for more details).\nwith velocity dispersion larger than σ ≈ 800 km s−1 . Recently,\n(Popesso et al. 2006) found a similar correlation between LX\nand fb for a larger cluster sample. The shape of the our LX − fb\ncorrelation is similar to the correlation between cluster velocity dispersion and the fraction of [OII] emitters for clusters at\nlow redshift reported by Poggianti et al. (2006). They found\nthat clusters with σ > 550 km s−1 have a constant low fraction\n(less than 30%) of [OII] emiters. In contrast, those clusters with\nsmaller σ show large and small fractions of [OII] emiters.\nWe have recomputed fb taking into account those galaxies within an aperture of radius equal to r200 and brighter than\nMr = −19.5. We restricted the analysis only to those clusters with z < 0.05, because our sample is complete down to\nMr = −19.5 in this redshift range. In this case the number of\ncluster decreases to 13. We have again studied the correlations\nof fb with galaxy concentration, velocity dispersion and X-ray\nluminosity, obtaining similar correlations as with the full sample.\n\n7. Discussion\nFrom the study presented in this paper, most of the galaxies\n(62%) located in the central regions of galaxy clusters (r/r200 <\n2) are early-type galaxies (see section 4). In contrast, the field\npopulation is dominated by late-type galaxies. In the literature\nit is also well established that the colour of galaxies in clus-\n\nters and field is different, an indication of the low star formation activity found in cluster galaxies (e.g. Balogh et al. 1998;\nLewis et al. 2002; Gómez et al. 2003). These differences in\nmorphology and stellar content between field and cluster galaxies suggest different evolutionary processes. The facts that latetype galaxies show larger velocity dispersions and are located\nat larger distances from the cluster centre than early-type ones\nhave been interpreted as late-type galaxies being recent arrivals to the cluster potential, forming a non-relaxed group of\ngalaxies moving in more radial orbits than early-type ones (e.g.\nStein 1997; Adami et al. 1998). As late-type galaxies fall into\nthe cluster potential and encounter denser environments, they\nevolve to early-type ones. The results presented in the present\nwork are in agreement with previous findings. However, as\npointed out by Goto (2005), this would imply that a large fraction of galaxies (≈ 40% according to our sample) should be\nrecent arrivals to the cluster, a possibility that seems unlikely.\nGoto (2005) concluded that the different observational properties between red and blue galaxies may indicate which is the\nmain mechanism driving the evolution of galaxies in clusters.\nGas stripping, mergers and interactions with other galaxies and\nwith the cluster potential are the main mechanisms which are\nable to transform galaxies in clusters, making late-type galaxies lose their gas content, stop their star formation, circularise\ntheir orbits and transform their morphology from disk-like objects to spheroids. All of these mechanisms affect galaxies in\n\n\fAguerri et al.: Global Properties of Nearby Galaxy Clusters\n\n13\n\nFig. 11. The fraction of blue galaxies ( fb ) as a function of galaxy distribution (top), cluster velocity dispersion (middle), and\nX-ray luminosity (bottom) of the galaxy clusters.\nclusters but, can we infer from the observational results which\nis the dominant one?.\nIt should be noted that the different mechanisms of galaxy\nevolution have very different time-scales. While gas stripping\nhas a very short time-scale (≈ 50 Myr, Quilis et al. 2000), the\ngalaxy infall process can take ≈ 1 Gyr. The different mechanisms also have different underlying physics. Thus, ram pressure stripping is proportional to the density of the intracluster\nmedium (ICM) and to the square of the velocity of the galaxy.\nIn contrast, dynamical interactions are more efficient when the\nrelative velocity of galaxies is smaller (Mamon 1992). This\nmeans that gas stripping is stronger in the cluster centres and\nfor galaxies with high velocities, while dynamical interactions\nshould be more efficient for galaxies with smaller velocity dispersions. Numerical simulations have shown that most of the\ngalaxies inside the virial radius have already been through the\ncluster core more than once (Mamon et al. 2004). If gas stripping were the main mechanism driving galaxy evolution in\nclusters, according to the short time scale of this process, only\nfew blue (late-type) galaxies should be observed in the central\nregions of clusters. Moreover, gas stripping is also stronger in\ngalaxies with larger velocity dispersion which means that latetype galaxies should be more affected by this mechanism than\nearly-type ones. Based on these considerations, Goto (2005)\nconcluded that gas stripping is not the main responsible mechanism driving the evolution of galaxies in clusters. Instead,\ngalaxies in clusters evolve mainly by dynamical interactions.\nWe can add to Goto's discussion that if gas stripping were the\n\nmain galactic evolution mechanism in clusters, then the fraction of blue galaxies should depend on the cluster mass as the\ntemperature and density of the gas increases with the cluster\nmass. According to our results, this is true for those clusters\nwith large X-ray luminosities. In contrast, the cluster environment is not so important in driving the evolution of galaxies in low mass clusters. Thus, gas stripping may not be the\nmain responsible mechanism transforming late-type to earlytype galaxies in low mass clusters, but could be important in\nthe most massive ones. This does not mean that gas stripping\nis absent in the evolution of galaxies in clusters; some clear examples of gas stripping have been observed in galaxies in Virgo\n(Kenney et al. 2004).\nDynamical interactions include both interactions with the\ncluster potential and with other galaxies. These effects can trigger temporary star formation in cluster galaxies (Fujita 1998),\nwhich can be analysed by studying their colour distribution.\nThese interactions can also disrupt stars from galaxies, forming at the beginning long tidal tails that subsequently will\nbe diluted and will form the diffuse light observed in some\nnearby clusters like Virgo (see Aguerri et al. 2005b, and references therein). These effects will be more important in those\ngalaxies with smaller relative velocities. Fujita (1998) conclude that if the tidal effects enhance the SFR in the galaxies,\nthen the bluest galaxies should be located close to the cluster centre (within ≈ 300 kpc), whereas they should be in the\nouter parts of the cluster if the SFR is induced by galaxygalaxy encounters. We have investigated the fraction of blue\n\n\f14\n\nAguerri et al.: Global Properties of Nearby Galaxy Clusters\n\ngalaxies in our clusters located within 300 kpc from the centre of the cluster. The sample has been divided in bright and\ndwarf galaxies (Mr < Mr∗ + 1 and Mr > Mr∗ + 1, respectively). We have obtained that 40% of the blue bright galaxies and 30% of the blue dwarf ones are located at smaller distance than 300 kpc from the cluster center. This means that\ntidal interactions with the cluster potential are not the responsible mechanism for the formation of most of the blue galaxies in our clusters. The lack of blue galaxies in the central regions of clusters has been observed also in nearby clusters like\nComa (Aguerri et al. 2004) as well as in other distant clusters\n(Rakos et al. 1997; Abraham et al. 1996; Balogh et al. 1997).\nThese evidences indicate that the evolution of galaxies in\nclusters could be driven by the cluster environment in the most\nmassive ones, but galaxies in low mass clusters could mainly\nevolve due to the local environment.\n\n8. Conclusions\nIn the present paper we have analysed the main properties of\nthe galaxies of one of the largest (10865 galaxies) and homogeneous sample presented in the literature. The galaxies have\nbeen grouped in two families according to their u − r colour.\nThose galaxies with u − r ≥ 2.22 formed the red (early-type)\nfamily, and those with u − r < 2.22 the blue (late-type) one.\nWe have derived the position, velocity dispersion, and VDPs of\nboth families of galaxies, obtaining:\n– Within 2×r200 , 62% and 38% of the galaxies turned to be\nred and blue, respectively.\n– The median positions and velocity dispersions are smaller\nfor red galaxies than for blue ones.\n– Bright (Mr < Mr∗ −1) and dwarf (Mr > Mr∗ +1) red galaxies\nare located at smaller distances than the blue ones, sharing\nthe same cluster environment.\n– The brightest cluster members (Mr < −21.0) show smaller\nvelocity dispersions than the remaining.\n– The VDPs of the total galaxy cluster population are constant with radius in the central regions of the clusters\n(r < r200 ), while slowly decrease in the outermost regions\n(r ≥ r200 ). The red galaxy population have also flat VDPs in\nthe central regions (r < r200 ). In contrast, the VDPs of blue\ngalaxies grow towards the cluster centre. In the outer regions (r > r200 ), the VDPs of red galaxies decline smoothly\nwith radius, while for blue ones the decrement is faster.\nThis indicates that the galaxies in the outermost regions of\nthe clusters are dominated by the blue population, and have\nmore radial and anisotropic orbits than galaxies in the inner\nregions dominated by the red population.\n– The fraction of blue galaxies in our cluster sample does not\ncorrelate with cluster global properties, such as the concentration of the galaxy distribution and cluster velocity dispersion. However, we found a correlation between the X-ray\nluminosity and the fraction of blue galaxies. Those clusters\nwith LX (0.1 − 2.4keV) > 1045 erg s−1 have a low fraction\nof blue galaxies (less than 10%). In contrast, clusters with\nlow of X-ray luminosity show large and small fractions of\nblue galaxies. This could indicate that the star formation in\n\ncluster galaxies may be regulated by global cluster properties for clusters with LX (0.1 − 2.4keV) > 1045 erg s−1 , i.e.\nthose clusters with σc > 800 km s−1 .\nAll these results are in agreement with previous findings\nfrom other cluster samples, indicating that red and blue galaxies have different evolution in galaxy clusters. We have discussed these results according to the different galaxy transformation mechanisms presented in galaxy clusters, concluding\nthe local environment plays a key role in galaxy evolution in\nlow mass clusters, while the evolution of galaxies in massive\nclusters could be driven by the global cluster environment.\nAcknowledgements. We wish to thank to the anonymous referee\nfor useful coments which have improved this manuscript. We\nalso acknowledge financial support by the Spanish Ministerio de\nCiencia y Tecnologı́a grants AYA2004-08260. We would like also\nto thank T. Beers for providing us with copy of his code ROSTAT,\nand K. M. Ashman and S. Zepf for making their KMM code\navailable to us. Funding for the SDSS and SDSS-II has been\nprovided by the Alfred P. Sloan Foundation, the Participating\nInstitutions, the National Science Foundation, the U.S. Department\nof Energy, the National Aeronautics and Space Administration,\nthe Japanese Monbukagakusho, the Max Planck Society, and\nthe Higher Education Funding Council for England. The SDSS\nWeb Site is http://www.sdss.org/. The SDSS is managed by the\nAstrophysical Research Consortium for the Participating Institutions.\nThe Participating Institutions are the American Museum of Natural\nHistory, Astrophysical Institute Potsdam, University of Basel,\nCambridge University, Case Western Reserve University, University\nof Chicago, Drexel University, Fermilab, the Institute for Advanced\nStudy, the Japan Participation Group, Johns Hopkins University, the\nJoint Institute for Nuclear Astrophysics, the Kavli Institute for Particle\nAstrophysics and Cosmology, the Korean Scientist Group, the Chinese\nAcademy of Sciences (LAMOST), Los Alamos National Laboratory,\nthe Max-Planck-Institute for Astronomy (MPIA), the Max-PlanckInstitute for Astrophysics (MPA), New Mexico State University, Ohio\nState University, University of Pittsburgh, University of Portsmouth,\nPrinceton University, the United States Naval Observatory, and\nthe University of Washington. This research has made use of the\nNASA/IPAC Extragalactic Database (NED) which is operated by the\nJet Propulsion Laboratory, California Institute of Technology, under\ncontract with the National Aeronautics and Space Administration.\n\nReferences\nAbell, G. O., Corwin, H. G., Jr., & Olowin, R. P. 1989, ApJS,\n70, 1\nAbraham, R. G., et al. 1996, ApJ, 471, 694\nAdami, C., Biviano, A., & Mazure, A. 1998, A&A, 331, 439\nAdelman-McCarthy, J. K., et al. 2006, ApJS, 162, 38\nAguerri, J. A. L., Castro-Rodrı́guez, N., Napolitano, N.,\nArnaboldi, M. & Gerhard, O., 2006, astro-ph/0607263\nAguerri, J. A. L., Iglesias-Páramo, J., Vı́lchez, J. M., MuñozTuñón, C., & Sánchez-Janssen, R. 2005a, AJ, 130, 475\nAguerri, J. A. L., Gerhard, O. E., Arnaboldi, M., Napolitano,\nN. R., Castro-Rodriguez, N., & Freeman, K. C. 2005b, AJ,\n129, 2585\nAguerri, J. A. L., Iglesias-Paramo, J., Vilchez, J. M., &\nMuñoz-Tuñón, C. 2004, AJ, 127, 1344\nAkritas, M. G., & Bershady, M. A. 1996, ApJ, 470, 706\n\n\fAguerri et al.: Global Properties of Nearby Galaxy Clusters\n\nAndreon, S., Quintana, H., Tajer, M., Galaz, G., & Surdej, J.\n2006, MNRAS, 365, 915\nAndreon, S., & Ettori, S. 1999, ApJ, 516, 647\nAndreon, S., Davoust, E., Michard, R., Nieto, J.-L., &\nPoulain, P. 1996, A&AS, 116, 429\nArnaboldi, M., Gerhard, O., Aguerri, J. A. L., Freeman, K. C.,\nNapolitano, N. R., Okamura, S., & Yasuda, N. 2004, ApJ, 614,\nL33\nArnaboldi, M., et al. 2002, AJ, 123, 760\nAshman, K. M., Bird, C. M., & Zepf, S. E. 1994, AJ, 108,\n2348\nBalogh, M. L., Schade, D., Morris, S. L., Yee, H. K. C.,\nCarlberg, R. G., & Ellingson, E. 1998, ApJ, 504, L75\nBalogh, M. L., Morris, S. L., Yee, H. K. C., Carlberg, R. G.,\n& Ellingson, E. 1997, ApJ, 488, L75\nBeers, T. C., Flynn, K., & Gebhardt, K. 1990, AJ, 100, 32\nBekki, K., Couch, W. J., & Shioya, Y. 2002, ApJ, 577, 651\nBiviano, A., & Katgert, P. 2004, A&A, 424, 779\nBiviano, A., & Girardi, M. 2003, ApJ, 585, 205\nBiviano, A., Girardi, M., Giuricin, G., Mardirossian, F., &\nMezzetti, M. 1992, ApJ, 396, 35\nBlanton, M. R., Lupton, R. H., Schlegel, D. J., Strauss, M. A.,\nBrinkmann, J., Fukugita, M., & Loveday, J. 2005, ApJ, 631,\n208\nBlanton, M. R., et al. 2003, AJ, 125, 2348\nBöhringer, H., et al. 2000, ApJS, 129, 435\nBorgani, S., Girardi, M., Carlberg, R. G., Yee, H. K. C., &\nEllingson, E. 1999, ApJ, 527, 561\nButcher, H., & Oemler, A. 1984, ApJ, 285, 426\nCarlberg, R. G., Yee, H. K. C., & Ellingson, E. 1997, ApJ,\n478, 462\nCastro-Rodrı́guez, N., Aguerri, J. A. L., Arnaboldi, M.,\nGerhard, O., Freeman, K. C., Napolitano, N. R., & Capaccioli,\nM. 2003, A&A, 405, 803\nCole, S., & Lacey, C. 1996, MNRAS, 281, 716\nColless, M., et al. 2001, MNRAS, 328, 1039\nCurtis, H. D. 1918, Publications of Lick Observatory, 13, 55\nDanese, L., de Zotti, G., & di Tullio, G. 1980, A&A, 82, 322\nden Hartog, R., & Katgert, P. 1996, MNRAS, 279, 349\nDe Propris, R., et al. 2004, MNRAS, 351, 125\nDe Propris, R., et al. 2003, MNRAS, 342, 725\nDressler, A., et al. 1997, ApJ, 490, 577\nDressler, A. 1980, ApJ, 236, 351\nEbeling, H., Edge, A. C., Allen, S. W., Crawford, C. S.,\nFabian, A. C., & Huchra, J. P. 2000, MNRAS, 318, 333\nEbeling, H., Edge, A. C., Bohringer, H., Allen, S. W.,\nCrawford, C. S., Fabian, A. C., Voges, W., & Huchra, J. P.\n1998, MNRAS, 301, 881\nEdge, A. C., & Stewart, G. C. 1991, MNRAS, 252, 414\nEllingson, E., Lin, H., Yee, H. K. C., & Carlberg, R. G. 2001,\nApJ, 547, 609\nFadda, D., Girardi, M., Giuricin, G., Mardirossian, F., &\nMezzetti, M. 1996, ApJ, 473, 670\nFairley, B. W., Jones, L. R., Wake, D. A., Collins, C. A.,\nBurke, D. J., Nichol, R. C., & Romer, A. K. 2002, MNRAS,\n330, 755\nFasano, G., Poggianti, B. M., Couch, W. J., Bettoni, D.,\nKjaergaard, P., & Moles, M. 2000, ApJ, 542, 673\n\n15\n\nFujita, Y. 1998, ApJ, 509, 587\nGallazzi, A., Charlot, S., Brinchmann, J., & White, S. D. M.\n2006, MNRAS, 370, 1106\nGirardi, M., & Mezzetti, M. 2001, ApJ, 548, 79\nGirardi, M., Fadda, D., Giuricin, G., Mardirossian, F.,\nMezzetti, M., & Biviano, A. 1996, ApJ, 457, 61\nGómez, P. L., et al. 2003, ApJ, 584, 210\nGoto, T. 2005, MNRAS, 359, 1415\nGoto, T., et al. 2003, PASJ, 55, 739\nGott, J. R. I. 1972, ApJ, 173, 227\nGunn, J. E., & Gott, J. R. I. 1972, ApJ, 176, 1\nGutiérrez, C. M., Trujillo, I., Aguerri, J. A. L., Graham, A. W.,\n& Caon, N. 2004, ApJ, 602, 664\nHaines, C. P., La Barbera, F., Mercurio, A., Merluzzi, P., &\nBusarello, G. 2006, ApJ, 647, L21\nHilton, M., et al. 2005, MNRAS, 363, 661\nHogg, D. W., et al. 2004, ApJ, 601, L29\nHogg, D. W., Finkbeiner, D. P., Schlegel, D. J., & Gunn, J. E.\n2001, AJ, 122, 2129\nHubble, E., & Humason, M. L. 1931, ApJ, 74, 43\nKatgert, P., Biviano, A., & Mazure, A. 2004, ApJ, 600, 657\nKatgert, P., Mazure, A., den Hartog, R., Adami, C., Biviano,\nA., & Perea, J. 1998, A&AS, 129, 399\nKenney, J. D. P., van Gorkom, J. H., & Vollmer, B. 2004, AJ,\n127, 3361\nLedlow, M. J., Voges, W., Owen, F. N., & Burns, J. O. 2003,\nAJ, 126, 2740\nLewis, I., et al. 2002, MNRAS, 334, 673\nLupton, R. H., Ivezic, Z., Gunn, J. E., Knapp, G., Strauss,\nM. A., & Yasuda, N. 2002, Proc. SPIE, 4836, 350\nMahdavi, A., & Geller, M. J. 2001, ApJ, 554, L129\nMamon, G. A., Sanchis, T., Salvador-Solé, E., & Solanes,\nJ. M. 2004, A&A, 414, 445\nMamon, G. A. 1992, ApJ, 401, L3\nMastropietro, C., Moore, B., Mayer, L., Debattista, V. P.,\nPiffaretti, R., & Stadel, J. 2005, MNRAS, 364, 607\nMargoniner, V. E., de Carvalho, R. R., Gal, R. R., &\nDjorgovski, S. G. 2001, ApJ, 548, L143\nMargoniner, V. E., & de Carvalho, R. R. 2000, AJ, 119, 1562\nMelnick, J., & Sargent, W. L. W. 1977, ApJ, 215, 401\nMetevier, A. J., Romer, A. K., & Ulmer, M. P. 2000, AJ, 119,\n1090\nMiller, C. J., et al. 2005, AJ, 130, 968\nMoore, B., Katz, N., Lake, G., Dressler, A., & Oemler, A.\n1996, Nature, 379, 613\nMoss, C., & Dickens, R. J. 1977, MNRAS, 178, 701\nMulchaey, J. S., & Zabludoff, A. I. 1998, ApJ, 496, 73\nMuriel, H., Quintana, H., Infante, L., Lambas, D. G., & Way,\nM. J. 2002, AJ, 124, 1934\nOemler, A. J. 1974, ApJ, 194, 1\nOrtiz-Gil, A., Guzzo, L., Schuecker, P., Böhringer, H., &\nCollins, C. A. 2004, MNRAS, 348, 325\nPier, J. R., Munn, J. A., Hindsley, R. B., Hennessy, G. S.,\nKent, S. M., Lupton, R. H., & Ivezić, Ž. 2003, AJ, 125, 1559\nPisani, A. 1993, MNRAS, 278, 697\nPoggianti, B. M., et al. 2006, ApJ, 642, 188\nPopesso, P., Biviano, A., Bohringer, H. & Romaniello, M.,\n2006, astro-ph/0606191\n\n\f16\n\nAguerri et al.: Global Properties of Nearby Galaxy Clusters\n\nQuilis, V., Moore, B., & Bower, R. 2000, Science, 288, 1617\nQuintana, H., & Melnick, J. 1982, AJ, 87, 972\nRakos, K. D., Odell, A. P., & Schombert, J. M. 1997, ApJ,\n490, 194\nRines, K., & Diaferio, A. 2006, AJ, 132, 1275\nRines, K., Geller, M. J., Kurtz, M. J., & Diaferio, A. 2003, AJ,\n126, 2152\nSchlegel, D. J., Finkbeiner, D. P., & Davis, M. 1998, ApJ, 500,\n525\nShimasaku, K., et al. 2001, AJ, 122, 1238\nSmail, I., Edge, A. C., Ellis, R. S., & Blandford, R. D. 1998,\nMNRAS, 293, 124\nSodre, L. J., Capelato, H. V., Steiner, J. E., & Mazure, A.\n1989, AJ, 97, 1279\nSolanes, J. M., Manrique, A., Garcı́a-Gómez, C., GonzálezCasado, G., Giovanelli, R., & Haynes, M. P. 2001, ApJ, 548,\n97\nStein, P. 1997, A&A, 317, 670\nStrateva, I., et al. 2001, AJ, 122, 1861\nStrauss, M. A., et al. 2002, AJ, 124, 1810\nTammann, G. A. 1972, A&A, 21, 355\nXue, Y.-J., & Wu, X.-P. 2000, ApJ, 538, 65\nVoges, W., et al. 1999, A&A, 349, 389\nYahil, A., & Vidal, N. V. 1977, ApJ, 214, 347\nYork, D. G., et al. 2000, AJ, 120, 1579\nZabludoff, A. I., Huchra, J. P., & Geller, M. J. 1990, ApJS, 74,\n1\nZwicky, F., Herzog, E., & Wild, P. 1961, Pasadena: California\nInstitute of Technology (CIT), -c1961,\n\n\fAguerri et al.: Global Properties of Nearby Galaxy Clusters\n\n17\n\nTable 2. Cluster characteristics\n\nName\nAbell0085\nAbell0117\nAbell0152\nAbell0168\nAbell0257\nAbell0602\nAbell0628\nAbell0671\nAbell0690\nAbell0695\nAbell0699\nAbell0724\nAbell0727\nAbell0757\nAbell0779\nAbell0819\nAbell0883\nAbell0971\nAbell0999\nAbell1003\nAbell1016\nAbell1024\nAbell1032\nAbell1035\nAbell1066\nAbell1142\nAbell1149\nAbell1169\nAbell1173\nAbell1189\nAbell1190\nAbell1205\nAbell1215\nAbell1238\nAbell1270\nAbell1291\nAbell1318\nAbell1346\nAbell1377\nAbell1383\nAbell1385\nAbell1390\nAbell1424\nAbell1436\nAbell1452\nAbell1459\nAbell1507\nAbell1516\nAbell1552\nAbell1564\nAbell1616\nAbell1620\nAbell1630\n\nα (J2000)\n(degrees)\n10.4571\n14.0100\n17.5229\n18.7429\n27.3396\n118.341\n122.543\n127.121\n129.815\n130.309\n131.236\n134.600\n134.976\n138.277\n139.962\n143.076\n147.822\n154.997\n155.842\n156.235\n156.762\n157.096\n157.547\n158.092\n159.911\n165.229\n165.769\n166.967\n167.328\n167.775\n167.902\n168.328\n170.100\n170.711\n172.366\n173.092\n173.883\n175.304\n176.883\n176.973\n177.017\n177.378\n179.361\n180.095\n180.802\n181.108\n183.766\n184.729\n187.392\n188.720\n191.817\n192.510\n192.942\n\nδ (J2000)\n(degrees)\n-9.30694\n-10.0022\n13.9804\n0.365833\n14.0372\n29.3717\n35.2958\n30.4169\n28.9033\n32.4174\n27.7508\n38.5137\n39.4389\n47.7036\n33.7714\n9.68861\n5.48799\n40.9925\n12.8466\n47.8442\n10.9780\n3.76341\n4.03417\n40.1817\n5.17444\n10.5477\n7.57833\n43.9506\n41.5624\n1.09899\n40.8417\n2.53867\n4.34280\n1.09389\n54.0428\n55.9783\n55.0767\n5.74613\n55.7597\n54.7089\n11.5864\n12.3034\n5.12000\n56.2314\n51.6642\n1.88281\n59.8947\n5.24731\n11.7733\n1.78056\n55.0006\n-1.53764\n4.59694\n\nvc\n(km s−1 )\n16633+40\n−29\n16568+31\n−42\n17888+67\n−34\n13534+23\n−14\n21060+47\n−21\n18202+34\n−51\n25139+24\n−89\n14599+19\n−33\n23689+44\n−23\n20251+46\n−37\n25375+35\n−49\n28134+25\n−55\n28571+54\n−14\n15402+27\n−36\n6921+13\n−33\n22872+39\n−50\n21750+109\n−30\n27809+54\n−43\n9618+10\n−54\n18762+44\n−84\n9629+34\n−9\n22067+40\n−20\n20008+26\n−24\n20270+36\n−34\n20708+4\n−81\n10601+30\n−25\n21479+2\n−64\n17532+24\n−35\n22789+23\n−69\n28860+109\n−60\n22610+17\n−39\n22852+17\n−53\n14747+25\n−10\n22140+9\n−54\n20728+49\n−36\n17144+43\n−60\n17185+54\n−22\n29523+41\n−25\n15378+35\n−33\n17855+38\n−35\n25337+49\n−44\n25101+48\n−29\n22736+33\n−39\n19432+39\n−77\n18609+56\n−58\n6010+37\n−21\n18009+9\n−70\n23019+24\n−84\n26495+64\n−42\n23763+30\n−64\n24882+65\n−93\n25400+64\n−38\n19458+36\n−33\n\nσc\n(km s−1 )\n979+42\n−39\n531+31\n−27\n538+43\n−38\n578+31\n−28\n381+52\n−44\n834+68\n−61\n666+43\n−38\n610+37\n−33\n395+28\n−24\n456+39\n−32\n438+45\n−37\n433+36\n−32\n423+33\n−29\n409+35\n−30\n336+24\n−21\n536+44\n−37\n523+77\n−58\n816+72\n−61\n271+19\n−17\n617+39\n−34\n259+20\n−17\n532+40\n−34\n355+38\n−32\n575+52\n−45\n826+49\n−44\n557+43\n−38\n352+37\n−31\n433+37\n−32\n611+46\n−41\n+104\n807−88\n706+33\n−30\n890+59\n−53\n214+46\n−39\n544+48\n−41\n569+45\n−39\n720+39\n−36\n360+28\n−25\n790+70\n−62\n671+42\n−37\n456+26\n−23\n609+52\n−45\n483+47\n−41\n617+49\n−43\n712+50\n−44\n533+35\n−30\n527+58\n−48\n379+41\n−36\n720+48\n−43\n442+37\n−32\n641+72\n−62\n565+52\n−45\n829+49\n−43\n444+45\n−37\n\nr200\n(Mpc)\n2.10\n1.19\n1.12\n1.19\n0.81\n1.87\n1.47\n1.42\n0.85\n1.04\n0.91\n1.00\n0.96\n0.84\n0.79\n1.19\n1.17\n1.88\n0.60\n1.37\n0.60\n1.26\n0.77\n1.34\n1.71\n1.33\n0.85\n0.91\n1.33\n1.76\n1.50\n2.04\n0.48\n1.30\n1.31\n1.58\n0.81\n1.69\n1.47\n1.02\n1.34\n1.06\n1.46\n1.51\n1.30\n1.18\n0.85\n1.49\n0.93\n1.51\n1.32\n1.76\n0.98\n\nNgal\n\nC\n\n273\n60\n27\n106\n26\n78\n43\n72\n22\n16\n19\n29\n33\n30\n57\n31\n18\n40\n25\n29\n25\n35\n25\n49\n95\n59\n26\n35\n35\n41\n77\n83\n17\n60\n43\n45\n22\n66\n69\n35\n22\n27\n63\n66\n18\n65\n23\n60\n20\n46\n29\n58\n30\n\n0.93\n0.88\n0.85\n0.88\n0.94\n0.74\n0.83\n0.89\n0.95\n0.86\n0.73\n0.94\n0.96\n0.85\n0.75\n0.94\n0.91\n0.87\n0.90\n0.94\n0.91\n0.90\n0.89\n0.97\n0.92\n0.88\n0.94\n0.94\n0.95\n0.94\n0.92\n0.84\n0.89\n0.91\n0.99\n0.97\n0.96\n0.85\n0.96\n0.95\n0.86\n0.86\n0.95\n0.96\n0.91\n0.95\n0.91\n0.90\n0.88\n0.91\n0.87\n0.88\n0.90\n\n\f18\n\nAguerri et al.: Global Properties of Nearby Galaxy Clusters\n\nTable 2. continued.\n\nName\nAbell1650\nAbell1663\nAbell1692\nAbell1728\nAbell1750\nAbell1767\nAbell1773\nAbell1780\nAbell1783\nAbell1809\nAbell1885\nAbell1999\nAbell2018\nAbell2023\nAbell2026\nAbell2030\nAbell2061\nAbell2067\nAbell2092\nAbell2110\nAbell2122\nAbell2124\nAbell2145\nAbell2149\nAbell2169\nAbell2175\nAbell2199\nAbell2241\nAbell2244\nAbell2245\nAbell2255\nAbell2428\nAbell2670\nMACSJ0810.3+4216\nMACSJ1440.0+3707\nNSCJ152902+524945\nNSCJ161123+365846\nRBS1385\nRXCJ0137.2-0912\nRXCJ0828.6+3025\nRXCJ0953.6+0142\nRXCJ1115.5+5426\nRXCJ1121.7+0249\nRXCJ1351.7+4622\nRXCJ1424.8+0240\nRXJ1017.7-0002\nRXJ1022.1+3830\nRXJ1053.7+5450\nWBL238\nWBL518\nZwCl0027.0-0036\nZwCl0743.5+3110\nZwCl1207.5+0542\n\nα (J2000)\n(degrees)\n194.672\n195.717\n198.060\n200.876\n202.709\n204.024\n205.533\n206.149\n205.848\n208.245\n213.431\n223.522\n225.266\n227.496\n227.106\n227.844\n230.317\n230.780\n233.348\n234.953\n236.259\n236.263\n240.094\n240.350\n243.422\n245.132\n247.154\n254.928\n255.663\n255.640\n258.222\n334.065\n358.556\n122.600\n220.011\n232.309\n242.854\n215.969\n24.3137\n127.162\n148.393\n168.887\n170.428\n207.940\n216.159\n154.452\n155.583\n163.449\n146.732\n220.179\n7.31721\n116.655\n182.578\n\nδ (J2000)\n(degrees)\n-1.76417\n-2.51782\n-0.976000\n11.2960\n-1.86389\n59.2042\n2.24805\n2.86750\n55.6261\n5.16139\n43.6634\n54.2682\n47.2831\n2.98910\n-0.267500\n-0.0857717\n30.6122\n30.8703\n31.1475\n30.7173\n36.1161\n36.1172\n33.2306\n53.9061\n49.1261\n29.8953\n39.5244\n32.6161\n34.0411\n33.5056\n64.0653\n-9.34139\n-10.4133\n42.2733\n37.0839\n52.8433\n36.9700\n40.2619\n-9.20277\n30.4280\n1.70550\n54.4350\n2.81840\n46.3668\n2.75677\n-0.0595327\n38.5308\n54.8500\n54.4183\n3.45305\n-0.183598\n31.0136\n5.38500\n\nvc\n(km s−1 )\n25138+86\n−18\n24953+60\n−20\n25395+51\n−47\n26977+95\n−22\n26259+19\n−14\n21174+39\n−32\n23544+31\n−48\n23285+35\n−22\n20550+48\n−11\n23815+39\n−31\n26793+33\n−50\n29841+11\n−57\n26246+93\n−5\n27743+48\n−18\n27188+62\n−37\n27399+38\n−27\n23646+24\n−19\n23039+33\n−34\n20000+42\n−17\n29250+94\n−28\n19793+28\n−42\n19783+41\n−32\n26583+80\n−23\n19564+63\n−44\n17286+30\n−50\n28876+61\n−64\n9118+15\n−30\n29403+70\n−68\n28927+50\n−57\n25686+40\n−49\n24052+19\n−39\n25207+15\n−68\n22755+29\n−20\n19193+44\n−25\n29402+88\n−46\n22063+101\n−7\n20221+39\n−25\n24544+40\n−78\n12169+27\n−30\n14630+50\n−25\n29450+24\n−63\n20965+35\n−66\n14807+25\n−14\n18937+32\n−40\n16337+44\n−57\n19169+44\n−28\n16300+37\n−38\n21623+23\n−49\n13995+51\n−17\n8141+19\n−28\n17994+18\n−44\n17419+49\n−89\n23137+43\n−36\n\nσc\n(km s−1 )\n790+53\n−47\n729+44\n−40\n607+49\n−43\n824+72\n−62\n518+37\n−33\n885+44\n−40\n481+36\n−31\n624+59\n−53\n383+36\n−32\n737+53\n−47\n541+72\n−56\n463+62\n−54\n635+43\n−37\n516+88\n−73\n747+57\n−49\n495+51\n−45\n622+35\n−32\n917+50\n−46\n458+35\n−30\n622+59\n−49\n826+52\n−47\n826+52\n−47\n632+69\n−56\n459+31\n−27\n521+38\n−33\n878+66\n−57\n747+20\n−19\n806+73\n−62\n428+59\n−49\n535+44\n−39\n883+38\n−35\n433+44\n−37\n642+32\n−29\n505+42\n−35\n587+62\n−49\n652+51\n−43\n485+45\n−39\n419+44\n−36\n453+35\n−30\n628+37\n−33\n584+70\n−59\n639+43\n−38\n567+46\n−41\n531+30\n−27\n539+44\n−36\n413+47\n−39\n591+38\n−33\n665+51\n−45\n602+34\n−30\n454+22\n−20\n465+42\n−36\n694+51\n−45\n580+46\n−40\n\nr200\n(Mpc)\n1.61\n1.54\n1.32\n1.88\n1.15\n2.05\n1.09\n1.45\n0.94\n1.68\n1.23\n1.07\n1.45\n1.12\n1.50\n1.10\n1.43\n2.19\n0.93\n1.25\n1.80\n1.78\n1.40\n1.01\n1.24\n1.76\n1.77\n1.61\n0.99\n1.28\n1.86\n0.95\n1.46\n1.23\n1.31\n1.4\n1.17\n0.84\n0.93\n1.45\n1.30\n1.35\n1.40\n1.16\n1.19\n0.90\n1.35\n1.52\n1.30\n1.03\n0.99\n1.40\n1.20\n\nNgal\n\nC\n\n63\n72\n40\n50\n35\n109\n32\n53\n33\n89\n22\n24\n39\n23\n43\n38\n98\n118\n41\n21\n91\n90\n24\n20\n40\n58\n269\n37\n23\n39\n184\n26\n137\n32\n18\n45\n30\n16\n49\n76\n22\n50\n73\n40\n22\n16\n51\n46\n44\n103\n36\n29\n40\n\n0.85\n0.88\n0.89\n0.70\n0.95\n0.94\n0.87\n0.90\n0.94\n0.82\n0.92\n0.92\n0.88\n0.86\n0.91\n0.91\n0.83\n0.85\n0.86\n0.83\n0.92\n0.92\n0.87\n0.85\n0.82\n0.87\n0.92\n0.90\n0.94\n0.95\n0.91\n0.87\n0.94\n0.84\n0.91\n0.89\n0.86\n0.91\n0.92\n0.89\n0.96\n0.94\n0.85\n0.94\n0.91\n0.91\n0.82\n0.86\n0.87\n0.85\n0.85\n0.82\n0.91\n\n\fAguerri et al.: Global Properties of Nearby Galaxy Clusters\n\n19\n\nTable 2. continued.\n\nName\nZwCl1215.1+0400\nZwCl1316.4-0044\nZwCl1730.4+5829\n\nα (J2000)\n(degrees)\n184.422\n199.816\n261.856\n\nδ (J2000)\n(degrees)\n3.66040\n-0.907816\n58.4749\n\nvc\n(km s−1 )\n23229+22\n−40\n24972+56\n−31\n8379+26\n−36\n\nσc\n(km s−1 )\n955+43\n−39\n557+22\n−20\n491+24\n−22\n\nr200\n(Mpc)\n2.17\n1.16\n1.02\n\nNgal\n\nC\n\n130\n38\n33\n\n0.90\n0.87\n0.86\n\n\f"}