{"id": "http://arxiv.org/abs/1007.4760v1", "guidislink": true, "updated": "2010-07-27T15:48:02Z", "updated_parsed": [2010, 7, 27, 15, 48, 2, 1, 208, 0], "published": "2010-07-27T15:48:02Z", "published_parsed": [2010, 7, 27, 15, 48, 2, 1, 208, 0], "title": "Effective field theory approach to Casimir interactions on soft matter\n  surfaces", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1007.4061%2C1007.2733%2C1007.4223%2C1007.5276%2C1007.3776%2C1007.0817%2C1007.3597%2C1007.0300%2C1007.4744%2C1007.3813%2C1007.3038%2C1007.0935%2C1007.4026%2C1007.5384%2C1007.5183%2C1007.4161%2C1007.3447%2C1007.2605%2C1007.4306%2C1007.4923%2C1007.1810%2C1007.3231%2C1007.1349%2C1007.4760%2C1007.0465%2C1007.3841%2C1007.5464%2C1007.1296%2C1007.4033%2C1007.3112%2C1007.1567%2C1007.3697%2C1007.2566%2C1007.3174%2C1007.4268%2C1007.4227%2C1007.1424%2C1007.5347%2C1007.5487%2C1007.4347%2C1007.3238%2C1007.1444%2C1007.5088%2C1007.1071%2C1007.4849%2C1007.0349%2C1007.2638%2C1007.0625%2C1007.2701%2C1007.4978%2C1007.5055%2C1007.1855%2C1007.0066%2C1007.5153%2C1007.3892%2C1007.4445%2C1007.3720%2C1007.0035%2C1007.1467%2C1007.5383%2C1007.3154%2C1007.2096%2C1007.3967%2C1007.0156%2C1007.3927%2C1007.1621%2C1007.3294%2C1007.0554%2C1007.2663%2C1007.5306%2C1007.5394%2C1007.4777%2C1007.2607%2C1007.4929%2C1007.2687%2C1007.1902%2C1007.2296%2C1007.0917%2C1007.3770%2C1007.0495%2C1007.4810%2C1007.4662%2C1007.2246%2C1007.4954%2C1007.0940%2C1007.5231%2C1007.1435%2C1007.4372%2C1007.4135%2C1007.4567%2C1007.1988%2C1007.2260%2C1007.0943%2C1007.3046%2C1007.4247%2C1007.1136%2C1007.0703%2C1007.0793%2C1007.1943%2C1007.0184%2C1007.3713&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Effective field theory approach to Casimir interactions on soft matter\n  surfaces"}, "summary": "We utilize an effective field theory approach to calculate Casimir\ninteractions between objects bound to thermally fluctuating fluid surfaces or\ninterfaces. This approach circumvents the complicated constraints imposed by\nsuch objects on the functional integration measure by reverting to a point\nparticle representation. To capture the finite size effects, we perturb the\nHamiltonian by DH that encapsulates the particles' response to external fields.\nDH is systematically expanded in a series of terms, each of which scales\nhomogeneously in the two power counting parameters: \\lambda \\equiv R/r, the\nratio of the typical object size (R) to the typical distance between them (r),\nand delta=kB T/k, where k is the modulus characterizing the surface energy. The\ncoefficients of the terms in DH correspond to generalized polarizabilities and\nthus the formalism applies to rigid as well as deformable objects.\nSingularities induced by the point particle description can be dealt with using\nstandard renormalization techniques. We first illustrate and verify our\napproach by re-deriving known pair forces between circular objects bound to\nfilms or membranes. To demonstrate its efficiency and versatility, we then\nderive a number of new results: The triplet interactions present in these\nsystems, a higher order correction to the film interaction, and general scaling\nlaws for the leading order interaction valid for objects of arbitrary shape and\ninternal flexibility.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1007.4061%2C1007.2733%2C1007.4223%2C1007.5276%2C1007.3776%2C1007.0817%2C1007.3597%2C1007.0300%2C1007.4744%2C1007.3813%2C1007.3038%2C1007.0935%2C1007.4026%2C1007.5384%2C1007.5183%2C1007.4161%2C1007.3447%2C1007.2605%2C1007.4306%2C1007.4923%2C1007.1810%2C1007.3231%2C1007.1349%2C1007.4760%2C1007.0465%2C1007.3841%2C1007.5464%2C1007.1296%2C1007.4033%2C1007.3112%2C1007.1567%2C1007.3697%2C1007.2566%2C1007.3174%2C1007.4268%2C1007.4227%2C1007.1424%2C1007.5347%2C1007.5487%2C1007.4347%2C1007.3238%2C1007.1444%2C1007.5088%2C1007.1071%2C1007.4849%2C1007.0349%2C1007.2638%2C1007.0625%2C1007.2701%2C1007.4978%2C1007.5055%2C1007.1855%2C1007.0066%2C1007.5153%2C1007.3892%2C1007.4445%2C1007.3720%2C1007.0035%2C1007.1467%2C1007.5383%2C1007.3154%2C1007.2096%2C1007.3967%2C1007.0156%2C1007.3927%2C1007.1621%2C1007.3294%2C1007.0554%2C1007.2663%2C1007.5306%2C1007.5394%2C1007.4777%2C1007.2607%2C1007.4929%2C1007.2687%2C1007.1902%2C1007.2296%2C1007.0917%2C1007.3770%2C1007.0495%2C1007.4810%2C1007.4662%2C1007.2246%2C1007.4954%2C1007.0940%2C1007.5231%2C1007.1435%2C1007.4372%2C1007.4135%2C1007.4567%2C1007.1988%2C1007.2260%2C1007.0943%2C1007.3046%2C1007.4247%2C1007.1136%2C1007.0703%2C1007.0793%2C1007.1943%2C1007.0184%2C1007.3713&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We utilize an effective field theory approach to calculate Casimir\ninteractions between objects bound to thermally fluctuating fluid surfaces or\ninterfaces. This approach circumvents the complicated constraints imposed by\nsuch objects on the functional integration measure by reverting to a point\nparticle representation. To capture the finite size effects, we perturb the\nHamiltonian by DH that encapsulates the particles' response to external fields.\nDH is systematically expanded in a series of terms, each of which scales\nhomogeneously in the two power counting parameters: \\lambda \\equiv R/r, the\nratio of the typical object size (R) to the typical distance between them (r),\nand delta=kB T/k, where k is the modulus characterizing the surface energy. The\ncoefficients of the terms in DH correspond to generalized polarizabilities and\nthus the formalism applies to rigid as well as deformable objects.\nSingularities induced by the point particle description can be dealt with using\nstandard renormalization techniques. We first illustrate and verify our\napproach by re-deriving known pair forces between circular objects bound to\nfilms or membranes. To demonstrate its efficiency and versatility, we then\nderive a number of new results: The triplet interactions present in these\nsystems, a higher order correction to the film interaction, and general scaling\nlaws for the leading order interaction valid for objects of arbitrary shape and\ninternal flexibility."}, "authors": ["Cem Yolcu", "Ira Z. Rothstein", "Markus Deserno"], "author_detail": {"name": "Markus Deserno"}, "author": "Markus Deserno", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1209/0295-5075/96/20003", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1007.4760v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1007.4760v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "4 pages, 1 figure", "arxiv_primary_category": {"term": "cond-mat.soft", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cond-mat.soft", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "cond-mat.stat-mech", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1007.4760v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1007.4760v1", "journal_reference": null, "doi": "10.1209/0295-5075/96/20003", "fulltext": "Effective field theory approach to Casimir interactions on soft matter surfaces\nCem Yolcu, Ira Z. Rothstein and Markus Deserno\n\narXiv:1007.4760v1 [cond-mat.soft] 27 Jul 2010\n\nDepartment of Physics, Carnegie Mellon University, 5000 Forbes Ave., Pittsburgh, PA 15213, USA\n(Dated: May 11, 2018)\nWe utilize an effective field theory approach to calculate Casimir interactions between objects\nbound to thermally fluctuating fluid surfaces or interfaces. This approach circumvents the complicated constraints imposed by such objects on the functional integration measure by reverting to a\npoint particle representation. To capture the finite size effects, we perturb the Hamiltonian by ∆H\nthat encapsulate the particles' response to external fields. ∆H is systematically expanded in a series\nof terms, each of which scales homogeneously in the two power counting parameters: λ ≡ R/r , the\nratio of the typical object size (R) to the typical distance between them (r), and δ ≡ kB T /k, where\nk is the modulus characterizing the surface energy. The coefficients of the terms in ∆H correspond\nto generalized polarizabilities and thus the formalism applies to rigid as well as deformable objects.\nSingularities induced by the point particle description can be dealt with using standard renormalization techniques. We first illustrate and verify our approach by re-deriving known pair forces\nbetween circular objects bound to films or membranes. To demonstrate its efficiency and versatility,\nwe then derive a number of new results: The triplet interactions present in these systems, a higher\norder correction to the film interaction, and general scaling laws for the leading order interaction\nvalid for objects of arbitrary shape and internal flexibility.\n\nObjects which constrain a fluctuating field experience a\nCasimir interaction [1]. The underlying fluctuations can\nbe either quantum mechanical or thermal in origin [2].\nIn this letter we will be interested in forces induced by\nthermal fluctuations between particles bound to surfaces\ncharacterized by surface tension (films) [3–6] or bending\nrigidity (membranes) [6–9].\nThe non-trivial aspect of such calculations tends to\narise from the constraints that the extended objects impose on the partition sum. This issue is usually dealt with\nby pinning the field to the surface of the objects through\ndelta-functions in the integration measure [3]. A clear\nexposition of this method, applied to compact objects in\nfluid membranes and films, can be found in Ref. [6]. For\nthe electromagnetic Casimir effect this approach was recently improved and systematized within the framework\nof scattering theory, where the constraints of the objects\nenter the interaction energy through their scattering matrix coefficients [10].\nIn this paper we employ an effective field theory (EFT)\nformalism, orignally developed to study the gravity wave\nprofile for inspiralling black holes [11], to streamline the\nboundary condition issue. This formalism has been utilized to derive not only new results in gravitational wave\nphysics [12] but also to calculate the leading order finite size correction to the Abraham-Dirac-Lorentz radiation reaction force law in classical electrodynamics [13].\nBoth of the these applications dealt with classical nonfluctuating fields, whereas here we will generalize the formalism to allow for finite temperatures.\nTo illustrate the effective field theory approach to soft\nmatter surfaces most transparently, we will focus on constraints imposed by mobile but rigid objects which pin\nfield fluctuation modes along their circumference. Extensions towards more general types of constraints entails no\nchange in formalism.\n\nWe will assume that the bare surface Hamiltonian H\nis a quadratic functional of some field φ(r):\nZ\n1\nH[φ] = k d2 r φK̂φ ,\n(1)\n2\nwhere k is a generalized modulus and the kernel K̂ defines\nthe physics of the problem. For films K̂ = −∇2 while for\nmembranes K̂ = (∇2 )2 . In both cases φ(r) is the surface\nheight in Monge parametrization [14].\nThe idea behind the EFT formalism is to treat the\nobjects as point particles and to recapture their\nP internal\nstructure through additional terms ∆H = a Ca Oa in\nthe Hamiltonian, where the scalars Oa are polynomial\nin the field and its derivatives and a labels the particles. The coefficients Ca are chosen to reproduce the long\nwavelength physics, in analogy with block spin renormalization, and are fixed by a matching calculation. In principle one must add all terms which are consistent with\nthe underlying theory. On dimensional grounds the coefficients of these new terms will scale with powers of the\nparticle size, R, such that the limit R → 0 is well defined.\nLet us for the moment assume that the new terms obey\na shift symmetry ∆H(φ) = ∆H(φ + h), where h is a constant. This symmetry eliminates boundary conditions\nin which the object is pinned to a fixed height. Violating this symmetry leads to long wavelength fluctuations\nwhich can lead to pathologies. Given this restriction, it is\nclear that we may truncate the sum in a derivative expansion, as each derivative will scale as λ ≡ R/r. Quadratic\nterms in φ generate multipoles when the particles are\nsubjected to external fields, hence we may interpret their\ncoefficients as polarizabilities. Terms which are higher\norder in the fields will not have such a simple interpretation. Such terms are suppressed by powers of δ ≡√kB T /k.\nTo see this, we may simply rescale the field φ → δ φ. In\nthis way the leading term in the partition function has a\n\n\f2\nwell defined δ → 0 limit and non-linearities are automatically suppressed by powers of δ. These δ-corrections will\nbe treated in a forthcoming publication. Here we will be\nonly concerned with the more canonical λ-corrections.\nThe leading order in λ is unique and O(λ2 ):\n1X a\nC [∂i φ(r a )∂j φ(r a )] .\n(2)\n∆H(2) =\n2 a ij\n\na\nThe tensorial polarizability Cij\nallows for non-axisymmetric objects, but for the sake of simplicity we will rea\nstrict to the symmetric case Cij\n= CaD δij . The coefficient\nD\nCa , which can be fixed by treating a single object in isolation, is the isotropic dipole polarizability. The reason\nfor this nomenclature will become clear once we match\nfor CaD . Note that in the EFT formalism determining\nthe proper Hamiltonian to reproduce the long distance\nphysics is both conceptually and technically independent\nof finding the associated force between objects. We will\ntherefore first discuss how to compute Casimir interactions between polarizable objects, as described by the\nHamiltonian Heff = H+∆H, and afterwards explain how\nthe polarizabilities are fixed by a matching procedure.\nThe canonical partition function of the system described by the effective Hamiltonian Heff is given by\nZ\nZ = Dφ e−β Heff = Z0 e−β∆H ,\n(3)\n\nwhere Z0 is the partition function of the free Hamiltonian\n(∆H = 0) and h* * * i denotes the associated Gaussian\naverage. Substituting ∆H from its definition in Eqn. (2),\none obtains the free energy of interaction, U, through\n− β U = log(Z/Z0 ) = log e−β∆H\n*\n!n +\n∞\nX\nβX D\n1\n2\n−\n. (4)\nC [∂i φ(r a )]\n=\nn!\n2 a a\nn=1\nc\n\nThis cumulant expansion can be represented as a series\nof diagrams [15], each depicting a (connected) 2n-point\nfunction of some derivatives of the field.\nThe expansion (4) encodes n-body contributions to\nthe free energy from the nth term onwards. For a given\nn-body force there are subleading corrections stemming\nfrom higher multipoles as well as terms non-linear in the\nlower multipole polarizabilities.\nLet us now illustrate this formalism by applying it to\nsome cases of interest. We first consider circular particles\non a surface with tension-dominated energy density, i.e.\na film. The relevant differential operator is then −∇2 ,\n1\nlog|r − r′ |, and the\nwith Green function G(r, r ′ ) = − 2π\nmodulus k will be replaced by the more familiar σ for surface tension. At O(λ4 ) we have the diagram in Fig. 1(a),\nwhich represents the lowest order pair interaction. It\nWick-contracts to\nX CDCD\n2\na b\n− β U (4) =\n[∂i ∂j G(r a , rb )]\n(5)\n4σ 2\na,b\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\n(e)\n\nFIG. 1: Relevant Feynman diagrams for the calculations in\nthis letter. Solid lines correspond to propagators, as usual,\nwhile dashed lines represent world lines of particles.\n\nand evaluates to the pair potential\n(4)\n\n− β U{ab} =\n\nCaD CbD\n4 ,\n4π 2 σ 2 rab\n\n(6)\n\nwhere we define r ab = ra − r b and denote by {. . .} an\nn-tuplet of distinct particles. Self energies corresponding\nto self-links in diagrams, such as the one in Fig. 1(c),\nlead to divergent contributions to the interaction energy.\nHowever, for derivative interactions these divergences are\nall power like and can be absorbed into CaD . These divergences carry no physical information, as there is no\nnon-trivial renormalization group flow, and thus effectively we may set these diagrams to zero.\nLet us now consider contributions beyond O(λ4 ) to the\ntwo body interaction, for which there are two possible\nsources: Higher order corrections to ∆H itself and higher\norder terms in the cumulant expansion. The next order\nterm in ∆H, which is not subleading in δ, is given by\n∆H(4) =\n\n1X Q\n2\nC [∂i ∂j φ(r a )] .\n2 a a\n\n(7)\n\nIt corresponds to a quadrupole polarizability and is\nO(λ4 ). In principle there is also a term involving\n∂i ∂i φ(r a ), but it can be removed by a redefinition of\nφ [16], owing to the fact that ∂i ∂i φ = 0 is the EulerLagrange equation for the problem. Inserting (2)+(7)\ninto the cumulant expansion (4) generates a quadrupoledipole interaction at O(λ6 ), given by\n(6)\n\n− β U{ab} =\n\n2(CaQ CbD + CaD CbQ )\n.\n6\nπ 2 σ 2 rab\n\n(8)\n\nAt O(λ6 ) one might additionally expect a contribution\ninvolving three dipole interactions in the cumulant expansion. However these vanish, since such terms necessarily involve self-energies, c.f. diagram 1(c).\nAt O(λ8 ) we expect the quadrupole-quadrupole interaction, arising from [∂ 4 G(r a , rb )]2 , but also a non-linear\ndipole-dipole term, proportional to four dipole polarizabilities and stemming from the 4th cumulant, and diagram 1(e), with [∂ 2 G(r a , r b )]4 :\n#\n\"\n36 CaQ CbQ\n(CaD )2 (CbD )2 1\n(8)\n+\n(9)\n− β U{ab} =\n8 .\nπ2 σ2\n32π 4 σ 4\nrab\n\n\f3\nAs long as the objects resist curvature, CaQ 6= 0. However,\nif in addition to vertical translations the objects can also\ntilt, their ability to align with local gradients in φ implies\nCaD = 0 and the lowest order interaction is O(λ8 ). While\nthe precise value of CaQ might be hard to calculate for\narbitrarily shaped rigid or elastic objects, Eqns. (6,8,9)\nnevertheless show that on films these will always interact\nwith an asymptotic r−8 potential, thus generalizing a\nfinding obtained in Ref. [5] for ellipsoidal objects. If the\nobjects are identical, (C Q )2 > 0 implies they attract.\nThe lowest order 3-body interaction arises from three\ndipole insertions. Henceforth using the shorthand notation Gab = G(r a , r b ) and denoting partial derivatives by\nsubscripts, the relevant interaction is\n(6)\n\n− β U{abc}\n\nC DC DC D\nbc ca\n= − a b3 c Gab\nij Gjk Gki ,\nσ\n\n(≤8)\n\n(10)\n\nwhich corresponds to diagram 1(b) and yields a triplet in−2\nteraction that scales as (rab rbc rca ) . However, owing to\nthe symmetries of the tensor Gij = (δij − 2r̂i r̂j )/(2πr2 ),\nTr[Gn ] = 0 if n is odd. Thus the leading dipole contribution to any n-body interaction vanishes for n odd. The\nfirst non-vanishing 3-body interaction therefore arises at\nO(λ8 ), from terms which are quadratic in one of the\ndipole polarizabilities, diagram 1(d):\n\u0012 D\n\u0013\nCa\nCbD\nCcD\nC DC DC D\n(8)\n.\n+\n+\n− β U{abc} = a b4 4c\n4 r4\n4 r4\n4 r4\n16π σ\nrab\nrba\nrcb\nac\nca\nbc\n(11)\nThis term drives triplets to attract, irrespective of their\nrelative placement, as long as C D > 0. A possible dipolequadrupole-dipole interaction also scales as O(λ8 ), but\nagain the symmetries of Gij and Gijkl force it to vanish.\nSo far we have calculated the forces in terms of a set\nof polarizability coefficients. These are fixed by calculating an observable in the full (finite-sized particle) theory,\nexpanding it in powers of λ, and choosing the polarizabilities such that the EFT reproduces the result to the\nappropriate order in λ. The point to emphasize is that we\nare free to fix these coefficients by any means we choose.\nThus it behooves us to choose as simple a setting as possible: we will place a single particle in a simple stationary\nexternal field where we can easily calculate its response.\nTo illustrate the procedure, let us match for CaD in the\ncase of a rigid horizontal inclusion on a film. Consider\nplacing the point particle in a background field such that\nthe total field is given by δφ(r) + φbg (r), where δφ(r)\nis the induced field generated by the polarization of the\ninclusion. Terms linear in δφ in the Hamiltonian correspond to induced point sources\nρa (r) = −CaD ∂i [δ(r − ra )∂i φbg (r)]\n\n(12)\n\nin the effective theory. The field emitted by an induced\nsource is thus given by\nφa (r) = −\n\nCaD (a)\n(a)\n∂ G(r, ra )∂i φbg (r a ) .\nk i\n\nWe may pick any background field we wish, but clearly\nit is simplest to choose the lowest multipole field configuration necessary to generate a non-zero response.\nFor a rigid horizontal inclusion this is a dipole field\nφbg ∼ r cos φ, i.e. one of constant slope. After solving\nthe elementary boundary value problem (BVP) in the full\ntheory and comparing to the effective theory result, one\nfinds C D = 2πR2 σ. To match for C Q , we need a background with curvature, so we choose φbg ∼ r2 cos(2φ).\nRepeating the exercise we just performed, after appropriately generalizing (12) to account for the two derivative\nnature of (7), gives C Q = π2 R4 σ. By Eqns. (6,8,9) this\nyields the pair interaction up to O(λ8 ):\n\n(13)\n\n− β U{ab} =\n\n\u0013\n\u0012\nR4\nR6\n1 R8\n+\n4\n+\n9\n+\n4\n6\n8 .\nrab\nrab\n2 rab\n\n(14)\n\n−4\n−6\nThe rab\n(dipole-dipole) and rab\n(dipole-quadrupole)\ninteractions shown above agree with those derived in\n−8\nRef. [4]. However, the rab\nterm consists of a lowest order\nquadrupole-quadrupole piece (prefactor \"9\", also given in\nRef. [4]) plus a non-linear dipole-dipole correction (prefactor \"1/2\") that has not been previously calculated. Recall that if the discs can also tilt, every term proportional\nto a dipole polarizability will vanish and thus only the\ninteraction −9 kB T (R/rab )8 will survive. As discussed\n−8\nbefore, a rab\n-term will remain even for non-circular or\nbendable objects; only its prefactor will be different, owing to the associated BVP being slightly different.\nObserve that the surface tension σ (or generally the\nmodulus k) cancels from the final result, because in every term of −β U the number of Green functions, each\naccompanied by a factor σ −1 , always matches the number of polarizabilities, each proportional to σ. This will\nno longer be the case once corrections beyond lowest order in δ are included.\nNow consider the case of particles embedded in a surface with a bending-dominated energy density, i.e. a\nmembrane. The kernel of the Hamiltonian in this case\nis K̂ = (∇2 )2 , with the Green function G(r, r′ ) =\n1\n′ 2\n′\n8π |r − r | log|r − r |, and the generic modulus k will be\nreplaced by the bending rigidity κ. We will assume that\nthe particles can adjust to a constant slope background\nby tilting, so the first non-vanishing polarizability will be\nquadrupole in nature. Observe that this time, at O(λ2 ),\nwe need to write down two distinct terms:\ni\n′\n1 Xh Q\n∆H =\nC̄a (∂i ∂j φ)2 (r a ) + C̄aQ (∂i ∂i φ)2 (r a ) .\n2 a\n(15)\nTerms involving the Laplacian cannot be removed via\na field re-definition, because ∂i ∂i φ = 0 is no longer the\nEuler-Lagrange equation. Notice that due to the different\n′\nkernel the quadrupole polarizabilities C̄ Q and C̄ Q scale\n∼ R2 , and not ∼ R4 as in the film case.\nThe pair interaction follows easily from an expression\n\n\f4\nanalogous to Eqn. (5):\n\u00012 C̄aQ C̄bQ + C̄aQ C̄bQ\nC̄aQ C̄bQ\nGab\nijkl +\n2\n2κ\n2κ2\n′\n\n(4)\n\n−β U{ab} =\n\n′\n\nGab\niikl\n\n\u00012\n\n.\n\n(16)\nThe term ∝\nvanishes because\n=\nδ(r a − rb ) by definition of the biharmonic Green func2\ntion. The other contractions are found to be (Gab\nijkl ) =\n2 2\nab 2\n2 2\n4/(2πrab ) and (Giikl ) = 2/(2πrab ) .\nThe leading 3-body interaction in the membrane case\nstems from the third order cumulant. The interaction is\nderived from an expression analogous to Eqn. (10) and is\ngiven by\n\u0014\n\u0010\n\u0011\n1\n(6)\nbc\nca\n− β U{abc} = − 3 C̄aQ C̄bQ C̄cQ Gab\nijkl Gklmn Gmnij\nκ\n\u0011\u0015\n\u0010\nX\nab\nbc\nca\nQ′ Q Q\n,\n+\nC̄a C̄b C̄c Giikl Gklmn Gmnjj (17)\n′\n′\n2\nC̄aQ C̄bQ (Gab\niikk )\n\nGab\niikk\n\nwhere the sum includes three terms in which the prime\naccompanies a, b, or c. The full expression for this result\nis rather lengthy, but it simplifies greatly once we have\n′\nthe relationship between C̄ Q and C̄ Q .\nIn the case of membranes we may perform a completely\nanalogous matching procedure to the one described for\nthe film. One finds the polarizabiliy coefficients C̄ Q =\n′\n4πR2 κ and C̄ Q = −πR2 κ, which through Eqn. (16) then\nyield the well-known pair potential [6, 7]\n(4)\n\n− β U{ab} = 6\n\nR4\n4 .\nrab\n\n(18)\n\nA similar force law could be derived for soft objects, after\nsolving the relevant BVP to extract the polarizabilities.\nThe potential would again decay ∼ (R/rab )4 , while its\nstrength would depend on the relative elastic moduli of\nthe objects and the bulk membrane, approaching 6 in the\nlimit of rigid objects.\nWith the polarizabilities fixed, we can simplify the 3body interaction (17) for the membrane, leaving\n(6)\n\n− β U{abc} = −4 (cab + cbc + cca )\n\nR6\n2 r2 r2\nrab\nbc ca\n\n,\n\n(19)\n\nwhere cab = cos[2(αa − αb )] and αa denotes the inner angle of the triangle at point a, etc. Unlike in the\nfilm-case, the sign of this triplet interaction depends on\nthe relative orientation of the three particles. For instance, for an equilateral triangle of side-length s one\n(6)\nfinds Utriplet (s) = +12 kB T (R/s)6 , but for an isosceles\ntriangle with angles (30◦ , 120◦ , 30◦ ) and short side s one\n(6)\nfinds Utriplet (s) = − 34 kB T (R/s)6 .\nTo conclude, in this letter we have utlilized the effective field theory approach introduced in [11] to streamline\ncalculations of Casimir forces on fluctuating two dimensional surfaces. We have reproduced well known results\nand derived several new ones, pertaining to non-linear\n\ncorrections, 3-body terms, and general scaling laws for\nthe leading order interaction between objects that are\narbitrarily shaped and possibly flexible. However, this\nformalism extends well beyond the basic cases studied\nhere and can be applied to many further situations in\nwhich existing techniques become rather unwieldy. For\ninstance, the corrections beyond linear order in kB T /k\nfollow in a straightforward manner and will be presented\nelsewhere. In addition, our results can be utilized to calculate the forces and torques between non-rigid objects\nor phase-segregated surface domains. This does not require further field-theoretical sophistication but merely\nthe calculation of their polarizability, which for complicated objects one might even decide to extract from experiment.\nWe gratefully acknowledge stimulating discussions\nwith J. Guven and M. Oettel. IZR is supported by US\nDOE contract, 22645.1.1110173. IZR is thankful to the\nCaltech high energy theory group for its hospitality and\nto the Gordon and Betty Moore Foundation for support.\nMD would like to thank the Theory Department of the\nMPI for Polymer Research for its hospitality.\n\n[1] H. B. G. Casimir, Proc. K. Ned. Akad. Wet. 51, 793\n(1948); M. Bordag, U. Mohideen U, and V. M. Mostepanenko, Phys. Rep. 353, 1 (2001); K. A. Milton, The\nCasimir effect: Physical manifestations of zero-point energy, (River Edge, USA, World Scientific, 2001).\n[2] For a review see M. Kardar and R. Golestanian, Rev.\nMod. Phys. 71, 1233 (1999).\n[3] H. Li and M. Kardar, Phys. Rev. Lett. 67, 3275 (1991).\n[4] H. Lehle and M. Oettel, Phys. Rev. E 75, 011602 (2007).\n[5] E. Noruzifar and M. Oettel, Phys. Rev. E 79, 051401\n(2009).\n[6] R. Golestanian, M. Goulian and M. Kardar, Europhys.\nLett. 33, 241 (1996); Phys. Rev. E 54, 6725 (1996).\n[7] M. Goulian, R. Bruinsma and P. Pincus, Europhys. Lett.\n22, 145 (1993); erratum: ibid. 23, 155 (1993).\n[8] J.-M. Park and T. C. Lubensky, J. Phys. (France) I 7,\n1217 (1996)\n[9] P. G. Dommersnes and J.-B. Fournier, Europhys. Lett.\n46, 256 (1999).\n[10] T. Emig, N. Graham, R. L. Jaffe and M. Kardar, Phys.\nRev. Lett. 99, 170403 (2007).\n[11] W. D. Goldberger and I. Z. Rothstein, Phys. Rev. D 73,\n104029 (2006) [arXiv:hep-th/0409156].\n[12] See e.g. R. A. Porto, A. Ross and I. Z. Rothstein,\narXiv:1007.1312 [gr-qc] and references therein.\n[13] C. R. Galley, A. K. Leibovich and I. Z. Rothstein,\narXiv:1005.2617 [gr-qc].\n[14] S. A. Safran, Statistical Thermodynamics of Surfaces, Interfaces, and Membranes, (Perseus, Cambridge, 1994).\n[15] J. J. Binney, N. J. Dowrick, A. J. Fisher and M. E. J.\nNewman, The Theory of Critical Phenomena, (Clarendon Press, Oxford, 1995).\n[16] For a proof see e.g. I. Z. Rothstein, \"TASI lectures on\neffective field theories,\" arXiv:hep-ph/0308266.\n\n\f"}