{"id": "http://arxiv.org/abs/1007.2975v1", "guidislink": true, "updated": "2010-07-18T07:33:55Z", "updated_parsed": [2010, 7, 18, 7, 33, 55, 6, 199, 0], "published": "2010-07-18T07:33:55Z", "published_parsed": [2010, 7, 18, 7, 33, 55, 6, 199, 0], "title": "Realization of Quantum State Privacy Amplification in a Nuclear Magnetic\n  Resonance Quantum System", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1007.3723%2C1007.2394%2C1007.0067%2C1007.3582%2C1007.2495%2C1007.3262%2C1007.5443%2C1007.5327%2C1007.1690%2C1007.4046%2C1007.0466%2C1007.0920%2C1007.1790%2C1007.3185%2C1007.0329%2C1007.3049%2C1007.0347%2C1007.2293%2C1007.4968%2C1007.4781%2C1007.3000%2C1007.2940%2C1007.0026%2C1007.5424%2C1007.5081%2C1007.4373%2C1007.1701%2C1007.4055%2C1007.5485%2C1007.4248%2C1007.3566%2C1007.3467%2C1007.0239%2C1007.5235%2C1007.5115%2C1007.0484%2C1007.0653%2C1007.3993%2C1007.1429%2C1007.2168%2C1007.5189%2C1007.4106%2C1007.4240%2C1007.2081%2C1007.5204%2C1007.5440%2C1007.1959%2C1007.0648%2C1007.0845%2C1007.4403%2C1007.3865%2C1007.3378%2C1007.4381%2C1007.4522%2C1007.4174%2C1007.5486%2C1007.1314%2C1007.3409%2C1007.5012%2C1007.2508%2C1007.5288%2C1007.2975%2C1007.0805%2C1007.3282%2C1007.1875%2C1007.5303%2C1007.3702%2C1007.1403%2C1007.0782%2C1007.1209%2C1007.4175%2C1007.4610%2C1007.0651%2C1007.2389%2C1007.5098%2C1007.2573%2C1007.1778%2C1007.3079%2C1007.1059%2C1007.0481%2C1007.0758%2C1007.0216%2C1007.1783%2C1007.2683%2C1007.3402%2C1007.1664%2C1007.1872%2C1007.1131%2C1007.2378%2C1007.0303%2C1007.4756%2C1007.3886%2C1007.3908%2C1007.4930%2C1007.2806%2C1007.2696%2C1007.0419%2C1007.4577%2C1007.3668%2C1007.0851%2C1007.4921&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Realization of Quantum State Privacy Amplification in a Nuclear Magnetic\n  Resonance Quantum System"}, "summary": "Quantum state privacy amplification (QSPA) is the quantum analogue of\nclassical privacy amplification. If the state information of a series of single\nparticle states has some leakage, QSPA reduces this leakage by condensing the\nstate information of two particles into the state of one particle. Recursive\napplications of the operations will eliminate the quantum state information\nleakage to a required minimum level. In this paper, we report the experimental\nimplementation of a quantum state privacy amplification protocol in a nuclear\nmagnetic resonance system. The density matrices of the states are constructed\nin the experiment, and the experimental results agree with theory well.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1007.3723%2C1007.2394%2C1007.0067%2C1007.3582%2C1007.2495%2C1007.3262%2C1007.5443%2C1007.5327%2C1007.1690%2C1007.4046%2C1007.0466%2C1007.0920%2C1007.1790%2C1007.3185%2C1007.0329%2C1007.3049%2C1007.0347%2C1007.2293%2C1007.4968%2C1007.4781%2C1007.3000%2C1007.2940%2C1007.0026%2C1007.5424%2C1007.5081%2C1007.4373%2C1007.1701%2C1007.4055%2C1007.5485%2C1007.4248%2C1007.3566%2C1007.3467%2C1007.0239%2C1007.5235%2C1007.5115%2C1007.0484%2C1007.0653%2C1007.3993%2C1007.1429%2C1007.2168%2C1007.5189%2C1007.4106%2C1007.4240%2C1007.2081%2C1007.5204%2C1007.5440%2C1007.1959%2C1007.0648%2C1007.0845%2C1007.4403%2C1007.3865%2C1007.3378%2C1007.4381%2C1007.4522%2C1007.4174%2C1007.5486%2C1007.1314%2C1007.3409%2C1007.5012%2C1007.2508%2C1007.5288%2C1007.2975%2C1007.0805%2C1007.3282%2C1007.1875%2C1007.5303%2C1007.3702%2C1007.1403%2C1007.0782%2C1007.1209%2C1007.4175%2C1007.4610%2C1007.0651%2C1007.2389%2C1007.5098%2C1007.2573%2C1007.1778%2C1007.3079%2C1007.1059%2C1007.0481%2C1007.0758%2C1007.0216%2C1007.1783%2C1007.2683%2C1007.3402%2C1007.1664%2C1007.1872%2C1007.1131%2C1007.2378%2C1007.0303%2C1007.4756%2C1007.3886%2C1007.3908%2C1007.4930%2C1007.2806%2C1007.2696%2C1007.0419%2C1007.4577%2C1007.3668%2C1007.0851%2C1007.4921&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Quantum state privacy amplification (QSPA) is the quantum analogue of\nclassical privacy amplification. If the state information of a series of single\nparticle states has some leakage, QSPA reduces this leakage by condensing the\nstate information of two particles into the state of one particle. Recursive\napplications of the operations will eliminate the quantum state information\nleakage to a required minimum level. In this paper, we report the experimental\nimplementation of a quantum state privacy amplification protocol in a nuclear\nmagnetic resonance system. The density matrices of the states are constructed\nin the experiment, and the experimental results agree with theory well."}, "authors": ["Liang Hao", "Chuan Wang", "Gui Lu Long"], "author_detail": {"name": "Gui Lu Long"}, "author": "Gui Lu Long", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1088/0953-4075/43/12/125502", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1007.2975v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1007.2975v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "8 pages 6 figures", "arxiv_primary_category": {"term": "quant-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "quant-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1007.2975v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1007.2975v1", "journal_reference": "Liang Hao, ChuanWang and Gui Lu Long, J. Phys. B: At. Mol. Opt.\n  Phys. 43 (2010) 125502", "doi": "10.1088/0953-4075/43/12/125502", "fulltext": "Realization of Quantum State Privacy Amplification in a Nuclear Magnetic\nResonance Quantum System∗\nLiang Hao1 , Chuan Wang1,2 and Gui Lu Long1,3\n1\n\narXiv:1007.2975v1 [quant-ph] 18 Jul 2010\n\nKey Laboratory for Atomic and Molecular NanoSciences and Department of Physics,\nTsinghua University, Beijing 100084, P. R. China\n2\nSchool of Science, Beijing University of Posts and Telecommunications, Beijing 100876, China\n3\nTsinghua National Laboratory for Information Science and Technology, Beijing 100084, China\nQuantum state privacy amplification (QSPA) is the quantum analogue of classical privacy amplification. If the state information of a series of single particle states has some leakage, QSPA reduces\nthis leakage by condensing the state information of two particles into the state of one particle.\nRecursive applications of the operations will eliminate the quantum state information leakage to a\nrequired minimum level. In this paper, we report the experimental implementation of a quantum\nstate privacy amplification protocol in a nuclear magnetic resonance system. The density matrices\nof the states are constructed in the experiment, and the experimental results agree with theory well.\nPACS numbers: 03.67.Dd, 03.67.Hk,03.67.Ac\nKeywords: quantum state privacy amplification, QSPA, nuclear magnetic resonance, quantum secure direct\ncommunication\n\nI.\n\nINTRODUCTION\n\nThe combination of quantum physics with communication gives rise to quantum communication. The physics principles of quantum mechanics offer the advantage of provable security, and higher capacity of quantum communication\nover its classical counterparts. There are various quantum communication tasks, such as quantum key distribution\nwhere random keys are distributed among two users separated at a distance [1–4], quantum secret sharing [5–10]\nwhere a secret is shared among several users and the users can read out the shared secret only by cooperation, and\nquantum secure direct communication [11–17] where secret messages are transmitted directly over a quantum channel.\nThey serve the various needs of communication.\nUnder practical conditions, quantum communication is inevitably affected by noise in quantum channels. It is hard\nto distinguish whether the errors are due to an eavesdropping behavior or the noise in the channel itself. Therefore\nquantum communication over a noisy channel is not completely secure, and some post-processing must be done. For\ninstance in quantum key distribution, privacy amplification [20] is performed to distill secure keys from the less secure\nraw keys. Quantum privacy amplification [21–23] is exploited for a sequence of entangled Einstein-Podolsky-Rosen\n(EPR) pairs so as to obtain maximally entangled pairs in protocols using EPR pairs.\nIn some quantum communication protocols, in the end and intermediate results of the quantum communication,\nthere are a sequence\nquantum states [15, 18, 19], for instance in states |0i, |1i,\n√ of single photons in nonorthogonal\n√\n|+xi = (|0i + |1i)/ 2 and |−xi = (|0i − |1i)/ 2, where |0i and |1i represent the horizontal and vertical polarization\nstate of the photon respectively. These single photons are sent from Bob to Alice. After eavesdropping check, Alice\nencodes the bit values on the single photons by performing some unitary operations, and then sends the encoded\nphotons back to Bob. If the information of the quantum states of the photons are leaked due to either eavesdropping\nor channel noise, then one needs to reduce the information leakage by some operation. The usual privacy amplification\nused in QKD post-processing is not applicable, because the single photons are in states in two conjugate basis, and\nthey cannot be added together in the manner used for the usual privacy amplification. Quantum privacy amplification\ndesigned for the EPR based protocols is not applicable to this case either, because the single photons are not entangled\nstates. For this purpose, quantum state privacy amplification was proposed recently [24] and it reduces the information\nleakage in the quantum states of single photons. The essential idea of QSPA [24] is to perform combined operations\nof controlled-NOT gates and Hadamard gates on two qubits, and make a measurement on one qubit. Using the\nmeasurement result, one can specify the state of the remaining qubit. However the state of remaining particle is\nunknown to an adversary, hence reduces his/her knowledge of the quantum state. In this way, the information leakage\nis reduced.\nIt is appealing to choose the nuclear magnetic resonance (NMR) system to implement the QSPA protocol. First,\n\n∗\n\nLiang Hao, ChuanWang and Gui Lu Long, J. Phys. B: At. Mol. Opt. Phys. 43 (2010) 125502 (6pp),\ndoi:10.1088/0953-4075/43/12/125502\n\n\f2\nthe NMR technique is a well-developed and sophisticated technique. It has been a powerful tool for experimental\nstudy of quantum information processing which can demonstrate the quantum manipulation of various quantum\ninformation processing tasks. The essential features of quantum algorithms can be demonstrated in such a quantum\nsystem, and the technique developed in NMR system is also helpful in other candidate quantum systems. For example,\nmany quantum algorithms have been successfully demonstrated in NMR quantum system [25–30], and some quantum\ncommunication protocols, such as teleportation [31] and dense coding [32, 33], have been implemented in the NMR\nsystem. Secondly, quantum gates are relatively easier to implement in NMR system than in optical system. For\ntransmission, it is no doubt that optical system is the best candidate information carrier. However in terms of gate\noperations, NMR system is easier because the quantum gates can be realized by radio-frequency pulses and free\nevolutions. Thus, demonstrating quantum algorithms in NMR enjoys the ease of gate operations while testing the\nessential quantum operations. On the other hand, there have been many efforts in building interfaces between flying\nqubits and stationary qubits [34–37]. The combination of flying qubits and stationary qubits may be a good candidate\nfor quantum information processing, especially for those involving both the transmission and processing of qubits.\nIf such interface could be successfully build, nuclear spin qubit may well be a good candidate of stationary qubit.\nIn that case, the flying photon qubit may first be transferred to a stationary electron spin qubit, and then further\ntransferred to nuclear spin qubit.\nThis paper reports the experimental study of QSPA in a nuclear magnetic resonance quantum system. In this work,\nwe have experimentally implemented the QSPA protocol in a nuclear magnetic resonance system, and all the quantum\noperations needed in the QSPA are demonstrated. Density matrices of states during the QSPA were constructed.\nThe experimental results agree with theory well.\nII.\n\nTHE PRINCIPLE OF QUANTUM STATE PRIVACY AMPLIFICATION\n\nFirstly, we briefly describe the QSPA protocol, for details see Ref. [24]. It is the quantum analogue of classical\nprivacy amplification. In classical cryptography, if a sequence key of n bits has some leakage to the outside, the legitimate users can use the privacy amplification to reduce this information leakage. The common privacy amplification\nprotocol [20] uses the parities of m partitions of subsets of the original raw key with some permutations. Thus, instead\nof using the original n-bits key, the legitimate users use m bits of parities as the new key. Usually, m is less than\nn, the privacy of the key has been amplified, and hence has better security. The task of QSPA is as follows. Two\nsingle-qubit states,\n|φi1 = a1 |0i + b1 |1i ,\n|φi2 = a2 |0i + b2 |1i ,\n\n(1)\n(2)\n\nwhere the coefficients a1 , b1 , a2 and b2 satisfy the normalization requirement,\n2\n\n2\n\n2\n\n2\n\n|a1 | + |b1 | = |a2 | + |b2 | = 1,\n\n(3)\n\nare known to the legitimate users, and however have an information leakage to an adversary Eve. The task of QSPA\nis to reduce this state information leakage. Because the single-qubit states are usually not orthogonal, the approach\nto take the parity is not applicable. Instead, the quantum state privacy amplification protocol in Ref.[24] uses two\ncontrolled-not (CNOT) gates and a Hadamard (H) gate, which may be simply called the CHC operation (for simplicity,\nwe call this QSPA protocol as CHC-QSPA protocol hereafter). The schematic circuit is shown in Fig.1. The initial\nstate |ψiin of the QSPA is the product of two single photon states,\n|ψiin = |φi1 ⊗ |φi2 .\n\n(4)\n\nAfter the CHC operation, the state of the joint system is changed to\n1\n|ψiout = √ {(a1 a2 + b1 b2 ) |0i1 + (a1 b2 − b1 a2 ) |1i1 } |0i2\n2\n1\n+ √ {(a1 a2 − b1 b2 ) |1i1 + (a1 b2 + b1 a2 ) |0i1 } |1i2 .\n2\n(5)\nThen one measures the second qubit in the σz basis. If |φi2,out = |0i is obtained, the state of control qubit is\n|φi1,out = (a1 a2 + b1 b2 ) |0i1 + (a1 b2 − b1 a2 ) |1i1 .\n\n(6)\n\n\f3\n\n1\n\n1,out\n\n2\n\n2,out\n\n!\n\nin\n\n!\n\nout\n\nFIG. 1: Circuit of the CHC-QSPA protocol. |φ1 i and |φ2 i denotes the states of the two qubits, respectively. The target qubit\nis measured at the end so as to incorporate the state information of the second qubit into the first qubit.\n\nOtherwise, the first qubit state is\n|φi1,out = (a1 a2 − b1 b2 ) |1i1 + (a1 b2 + b1 a2 ) |0i1 .\n\n(7)\n\nIn this way, no matter what the measurement result of second qubit is, the state information of two qubits is\nconcentrated on the first one. So the privacy of the state is amplified.\nφ1\nφ2 | + zi | − zi | + xi | − xi\n| + zi |0i\n|1i | − xi | + xi\n| − zi |1i\n|0i | + xi | − xi\n| + xi | + xi | − xi |0i\n|1i\n|0i\n| − xi | − xi | + xi |1i\nTABLE I: The truth table of the output state for the control qubit |φi1,out , when the measurement result of the target qubit\nis |0i. |φi1 and |φi2 are the input states of the control and target qubit,respectively.\n\nφ1\nφ2 | + zi | − zi | + xi | − xi\n| + zi |1i\n|0i | + xi | − xi\n|1i | − xi | + xi\n| − zi |0i\n| + xi | + xi | − xi |0i\n|1i\n| − xi | − xi | + xi |1i\n|0i\nTABLE II: The truth table of the output state of the control qubit |φi1,out , when the measurement result of the target qubit\nis |1i. |φi1 and |φi2 are the input states of the control and target qubit,respectively.\n\nWe take the quantum one-time-pad protocol [15] as an example, where the single photon states are | ± xi and | ± zi\nrespectively. The truth table of the output state of first qubit |φi1,out is shown in Tables I and II for the measurement\nresults of the target qubit |0i and |1i, respectively. When |φi1 = |0i, |φi2 = |1i, after the CHC operation, the output\nstate is\n1\n|ψiout = √ (|1i1 |0i2 + |0i1 |1i2 ).\n2\n\n(8)\n\nIf the measurement result of the target qubit |φi2,out = |0i, the final state of the control qubit |φi1,out = |1i. So\nthe privacy of the input state |0i1 |1i2 is concentrated on the final state of the control qubit |1i1 . If |φi2,out = |1i\nis obtained, the initial key |0i1 |1i2 is compressed to the condensed key |0i1 . It is obvious that the condensed key\ndepends not only on the input states of two single photons, but also on the result of the measurement on the target\nqubit.\nSuppose an adversary Eve knows the complete information of the control qubit but nothing about the target qubit.\nShe can only guess the input state of the target qubit to deduce the condensed key. In most quantum communication\n\n\f4\nprotocols, the single photons prepared by the legitimate user are in one of the four states |0i, |1i, |+xi, |−xi randomly.\nEven if Eve knows completely the information of both qubits, which is a small probability event[24], she can not deduce\nthe condensed state with certainty, because the final state of the control qubit |φi1,out has two possible results even\nthough the input state |ψiin is fixed. The output state depends on the measurement result of the target qubit,\naccording to the truth tables, when the input state |φi2 = |0i.\nIn practice, the process of QSPA can be used repeatedly to get more secure quantum state by using the retained\nqubit from the last round as a control and choosing a third qubit from the sequence as the target. The more one\nrepeats the QSPA operations, the lower the state information leakage.\nIII.\n\nNMR REALIZATION\n\nThe QSPA protocol was experimentally realized in NMR in a sample of Carbon-13 labeled chloroform (13 CHCL3 )\nwhich was dissolved in d6 acetone. The experiments were done at 22◦ C with a Bruker Avance III 400 MHz spectrometer. We assign the 13 C as the control qubit, and the 1 H as the target qubit, here the two qubits are denoted\nas C1 and H2. With the convention that magnetic field is along the z-axis, we define the spin up |↑i as |0i state\nand spin down |↓i as |1i state, which correspond to the low-frequency part and high-frequency part of the spectrum\nrespectively. The system Hamiltonian is\n1\nHN MR = −πν1 σz1 − πν2 σz2 + πJ12 σz1 σz2 ,\n2\n\n(9)\n\nwhere ν1 and ν2 are the resonance frequencies for C1 and H2, respectively. The scalar coupling between two spins\nJ12 has been measured to be 215Hz.\nThe pseudopure state |0i1 |0i2 is prepared from the thermal equilibrium state of the two qubits system using the\nspatial averaging method [26, 29], where the pulse sequence is [θ]2x → [grad]z → [−π/4]2x → [1/2J] → [π/4]2y → [grad]z ,\nwhere [grad]z is the gradient field. The state evolution under these pulses is\nγC Iz1 + γH Iz2\n2\n[θ]x\n\n⇒\n\n[grad] ⇒\n\u0002 π \u00032\n4 −x ⇒\nh\ni\n1\n2J12 ⇒\n\u0002 π \u00032\n4 y ⇒\n\n[grad] ⇒\n\nγC (Iz1\n\n+\n\n2Iz2 )\n\n−\n\ns\n\n1−\n\n2\n4γC\nI2\n2\nγH y\n\nγC (Iz1 + 2Iz2 )\n√\n√\nγC (Iz1 + 2Iz2 + 2Iy2 )\n√\n√\nγC (Iz1 + 2Iz2 − 2 2Iz1 Ix2 )\nγC (Iz1 + Iz2 + Ix2 − 2Iz1 Ix2 + 2Iz1 Iz2 )\n1\n1\n1\n2γC [( + Iz1 )( + Iz2 ) − ],\n2\n2\n4\n\n(10)\n\nk\n\nwhere [θ]α is defined as the rotation of spin k through angle θ about α̂-axis. [τ ] is the free evolution of the system for\nτ time interval, and [grad]z denotes a gradient pulse along the ẑ-axis. Accordingly,\ncos θ = 2γC /γH ,\n\n(11)\n\nwhere γC and γH are the gyromagnetic ratios of spin 13 C and proton 1 H, respectively.\nThe pulse sequence of the QSPA operation in the CHC-QSPA protocol is found to be\nπ\nπ\n1\n[ ]2y → [\n] → [π]2−y → [ ]2x\n2\n2J12\n2\nπ 1\nπ\nπ 1,2\n→ [ ]z → [ ]y → [π]1−x → [ ]2y\n2\n2\n2\nπ\nπ\n1\n] → [π]2−y → [ ]2x → [ ]1,2\n.\n→[\n2J12\n2\n2 z\n(12)\nThe optimized CNOT gate pulse sequence is shown in Fig.2. The free evolution [ 2J112 ] is realized by using a free time\ndelay τ = 1/4J12 separated by a pair of π pulses in the opposite directions, and these pulses can average out the\n\n\f5\n\nX\n\nX\n\nXYX\n\nYX\n\nX\n\nYX\n\nFIG. 2: Optimal NMR pulse sequence for the controlled-NOT gate. The wide and narrow boxes denote π and π/2 pulses,\nrespectively. the upper and lower lines are for the control and target qubits respectively. X and Y denote the axes along which\nthe pulses are applied, and the overbars indicate the opposite direction. The time period τ , during which no pulses are applied,\nis set equal to 1/4J12 . The order of pulses are from the left to the right.\n\n1\n0.8\n0.6\n0.4\n0.2\n0\n1\n2\n\n4\n3\n\n3\n4\n\n2\n1\n\nFIG. 3: The density matrix of initial state |ψiin = |0i1 |1i2 .\n\neffects of free Hamiltonian evolution of two spins σz1 and σz2 . In this way, we can also reduce the error accumulations\ncaused by imperfect calibration of the π pulses. The H gate is implemented by a π/2 pulse along ŷ-axis, followed by\nˆ\na π pulse along −x-axis.\n\nthe QSPA protocol for two kinds of initial states, |ψiin = |0i1 |1i2 , and |ψiin =\n\u0010 √We have implemented\n\u0011\n3\n1\no\no\n2 |0i1 + 2 |1i1 (cos 15 |0i2 + sin 15 |1i2 ). The state |0i1 |1i2 can be obtained by rotating the second spin π about\n\nŷ-axis from the pseudopure state |0i1 |0i2 . The experimental density matrix for initial state |0i1 |1i2 is shown in\nFig.3. After the CHC-operation, the outcome state is |ψiout = √12 (|01i + |10i), and the experimental density matrix\nwas reconstructed by state tomography technique [38, 39] and is shown in Fig. 4. The density matrices agree with\ntheoretical predictions very well.\n\u0010√\n\u0011\n3\n1\nFor quantum communication, the case with state |ψiin =\n|0i\n+\n|1i\n(cos 15o |0i2 + sin 15o |1i2 )\n1\n1\n2\n2\nis\nbecause it represents the more general nonorthogonal state case.\nThe state\n\u0011\n\u0010 √ more interesting\n1\n2π 1\nπ 2\n3\no\no\n|0i\n+\n|1i\n(cos\n15\n|0i\n+\nsin\n15\n|1i\n)\ncan\nbe\nprepared\nby\napplying\n[\n]\n→\n[\n]\nto\nthe\npseudopure\nstate.\n1\n1\n2\n2\n2\n2\n3 y\n3 y\nThe density matrices of the initial and output state are shown in Fig.5 and 6 respectively. For comparisons, we\n\n\f6\n\n1\n0.8\n0.6\n0.4\n0.2\n0\n1\n2\n\n4\n3\n\n3\n4\n\n2\n1\n\nFIG. 4: The density matrix of outcome state |ψiout after the QSPA operation on state |0i1 |1i2 .\n\n(a)\n\n(b)\n\n1\n\n1\n\n0.5\n\n0.5\n\n0\n\n0\n1\n\n2\n\n1\n3\n\n4\n1\n\n2\n\nFIG. 5: The density matrix of initial state |ψiin =\ntheoretical prediction.\n\n4\n\n3\n\n2\n\n3\n\n4\n1\n\n\u0010√\n\n3\n2\n\n|0i1 +\n\n1\n2\n\n|1i1\n\n\u0011\n\n2\n\n3\n\n4\n\n\u0001\ncos 15o |0i2 + sin 15o |1i2 : (a) experiment result; (b)\n\nhave also shown the theoretical density matrices for these states. The output state has a more complicated form for\nthis initial state, and it is |ψiout = (0.6830 |00i + 0.5000 |01i − 0.1830 |10i + 0.5000 |11i). Fig.6(a) shows the density\nmatrix of the outcome state. The agreement between theory and experiment is good.\nIV.\n\nSUMMARY\n\nIn conclusion, we have constructed the pulse sequence for the QSPA operation in the CHC-QSPA protocol. The\nresults of the experiments agree with the theoretical predictions well both in the case with computational basis states\nand the general case of nonorthogonal states. The output carries the state information of two qubits in the QSPA.\nWith the information about the measurement result and the information of the two input qubits, a legitimate user\nknows the state of qubit after QSPA, whereas an illegal user lacks the proper information of all the qubits involved, and\nhence loses his/her knowledge about the quantum state after the QSPA. In this way, the quantum state information\n\n\f7\n\n(a)\n\n(b)\n\n0.5\n\n0.5\n\n0\n\n0\n\n−0.5\n\n−0.5\n1\n\n2\n\n1\n3\n\n4\n1\n\n2\n\n3\n\n4\n\n2\n\n3\n\n4\n1\n\nFIG. 6: The density matrix of outcome state after the CHC-operation\nperimental result; and (b) theoretical result.\n\n\u0010√\n\n3\n2\n\n|0i1 +\n\n1\n2\n\n|1i1\n\n\u0011\n\n2\n\n3\n\n4\n\n\u0001\ncos 15o |0i2 + sin 15o |1i2 : (a) ex-\n\nleakage is reduced. The present experiment clearly demonstrated the protocol.\nThis work is supported by the National Natural Science Foundation of China Grant No. 10874098, the National\nBasic Research Program of China (2006CB921106, 2009CB929402).\nReferences\n\n[1] C. H. Bennett, G. Brassard, Proceedings of the IEEE International Conference on Computers, Systems, and Signal\nProcessing. Bangalore, India, IEEE, New York, 175 (1984).\n[2] A. K. Ekert, Phys. Rev. Lett. 67, 661 (1991).\n[3] N. Gisin, G. Ribordy, W. Tittel, and H. Zbinden, Rev. Mod. Phys. 74 145 (2002).\n[4] X. L. Zhang, Y. X. Zhang, and K. L. Gao, Commun. Theor. Phys. 43 627 (2005).\n[5] M. Hillery, V. Buz̀ek, and A. Berthiaume, Phys. Rev. A 59 1829 (1999).\n[6] A. Karlsson, M. Koashi, and N. Imoto, Phys. Rev. A 59 162 (1999).\n[7] S. Bandyopadhyay, Phys. Rev. A 62 012308 (2000).\n[8] R. Cleve, D. Gottesman, and H. K. Lo, Phys. Rev. Lett. 83 648 (1999).\n[9] Y. M. Li, K. S. Zhang, and K. C. Peng, Phys. Lett. A 324 420 (2004).\n[10] F. G. Deng, X. H. Li, C. Y. Li, P. Zhou, and H. Y. Zhou, Phys. Rev. A 72 044301 (2005).\n[11] G.L. Long and X.S. Liu, Phys. Rev. A 65, 032302 (2002).\n[12] A. Beige et al., Acta Phys. Pol. A 101, 357 (2002).\n[13] K. Boström and T. Felbinger, Phys. Rev. Lett. 89 187902 (2002).\n[14] F. G. Deng, G. L. Long, and X.S. Liu, Phys. Rev. A 68 042317 (2003).\n[15] F.G. Deng and G.L. Long, Phys. Rev. A 69 052319 (2004).\n[16] F. L. Yan and X. Q. Zhang, Eur. Phys. J. B 41 75 (2004).\n[17] C. Wang, F. G. Deng, Y. S. Li, X. S. Liu, and G. L. Long, Phys. Rev. A 71 044305 (2005).\n[18] Z. J. Zhang, Y. Li and Z. X. Man Phys. Rev. A 71, 044301 (2005)\n[19] Ai-Dong Zhu, Yan Xia, Qiu-Bo Fan, and Shou Zhang, Phys. Rev. A 73, 022338 (2006)\n[20] C. H. Bennett, G. Brassard, and J. M. Robert, SIAM J. Comput. 17 210 (1988).\n[21] C. H. Bennett, G. Brassard, S. Popescu, B. Schumacher, J. A. Smolin, and W. K. Wootters, Phys. Rev. Lett. 76, 722\n(1996).\n[22] C. H. Bennett, D. P. DiVincenzo, J. A. Smolin, and W. K. Wootters, Phys. Rev. A 54, 3824 (1996).\n[23] D. Deutsch, A. Ekert, R. Jozsa, C. Macchiavello, S. Popescu, and A. Sanpera, Phys. Rev. Lett. 77 2818 (1996).\n[24] F. G. Deng and G. L. Long, Commun. Theor. Phys. 46 443 (2006).\n\n\f8\n[25] N. Gershenfeld and I. L. Chuang, Science 275, 350 (1997).\n[26] D. G. Cory, A. F. Fahmy, and T. F. Havel, Proc. Natl. Acad. Sci. U.S.A. 94, 1634 (1997); D.G. Cory, M. D. Price, and T.\nF. Havel, Physica D 120, 82 (1998).\n[27] R. Marx et al., Phys. Rev. A 62, 012310 (2000).\n[28] L. Xiao and G.L. Long, Phys. Rev. A 66, 052320 (2002).\n[29] D. X. Wei, X. D. Yang, J. Luo, X. P. Sun, X. Z. Zeng and M. L. Liu, Chin. Sci. Bull. 49, 5423-426 (2004).\n[30] W. Z. Liu, J. F. Zhang, Y. Cao, W. Y. Huo, L. Hao, G. L. Long, and Z. W. Deng, Appl. Phys. Lett. 94, 064103 (2009).\n[31] M. A. Nielsen, E. Knill, and R. Laflamme, Nature (London) 396, 52 (1998).\n[32] X. Fang, X. Zhu, M. Feng, X. Mao and F. Du, Phys. Rev. A 61, 022307 (2000).\n[33] J.F. Zhang, J. Y. Xie, C. Wang, Z. W. Deng, Z. H. Lu and G. L. Long, Sciences in China, G48, 706-715 (2005).\n[34] V. Jacques, P. Neumann, J. Beck, M. Markham, D. Twitchen, J. Meijer, F. Kaiser, G. Balasubramanian, Phys. Rev. Lett.\n102, 057403 (2009).\n[35] F. Casagrande, A. Lulli, and M. G. A. Paris, Phys. Rev. A 79, 022307 (2009).\n[36] S. Tanzilli, W. Tittel, M. Halder, O. Alibart, P. Baldi, N. Gisin and H. Zbinden, Nature, 437, 116-120 (2005).\n[37] H. Kosaka, H. Shigyou, Y. Mitsumori, Y. Rikitake, H. Imamura, T. Kutsuwa and K. Edamatsu, AIP Conference Proceedings 1110, 245-248 (2009).\n[38] G. L. Long, H. Y. Yan, and Y. Sun, J. Opt. B: Quantum Semiclassical Opt. 3, 376 (2001).\n[39] G. M. Leskowitz and L. J. Mueller, Phys. Rev. A 69, 052302 (2004).\n\n\f"}