{"id": "http://arxiv.org/abs/1106.2364v1", "guidislink": true, "updated": "2011-06-13T01:12:18Z", "updated_parsed": [2011, 6, 13, 1, 12, 18, 0, 164, 0], "published": "2011-06-13T01:12:18Z", "published_parsed": [2011, 6, 13, 1, 12, 18, 0, 164, 0], "title": "Pairings of automorphic distributions", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1106.3863%2C1106.0789%2C1106.5729%2C1106.2976%2C1106.3028%2C1106.6191%2C1106.0100%2C1106.2806%2C1106.2642%2C1106.5011%2C1106.1548%2C1106.0371%2C1106.6086%2C1106.2024%2C1106.1984%2C1106.1070%2C1106.0581%2C1106.2714%2C1106.4985%2C1106.6013%2C1106.0815%2C1106.0382%2C1106.4237%2C1106.0222%2C1106.3852%2C1106.3594%2C1106.0942%2C1106.5794%2C1106.3701%2C1106.0326%2C1106.0935%2C1106.5025%2C1106.0635%2C1106.4592%2C1106.5420%2C1106.4686%2C1106.2518%2C1106.1744%2C1106.3314%2C1106.4438%2C1106.6276%2C1106.5184%2C1106.1162%2C1106.1698%2C1106.4566%2C1106.1734%2C1106.1658%2C1106.6177%2C1106.3707%2C1106.5950%2C1106.0527%2C1106.1535%2C1106.0557%2C1106.2944%2C1106.6178%2C1106.1728%2C1106.3162%2C1106.4875%2C1106.0863%2C1106.4215%2C1106.1774%2C1106.1430%2C1106.0647%2C1106.2364%2C1106.4004%2C1106.3948%2C1106.0220%2C1106.0422%2C1106.1103%2C1106.0950%2C1106.4818%2C1106.4547%2C1106.3130%2C1106.2437%2C1106.3179%2C1106.5200%2C1106.4798%2C1106.1183%2C1106.2448%2C1106.5620%2C1106.1285%2C1106.2331%2C1106.3823%2C1106.0085%2C1106.0971%2C1106.5717%2C1106.0820%2C1106.4296%2C1106.4001%2C1106.1346%2C1106.6253%2C1106.5466%2C1106.6173%2C1106.2778%2C1106.5045%2C1106.0636%2C1106.4224%2C1106.3685%2C1106.5499%2C1106.3126%2C1106.5054&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Pairings of automorphic distributions"}, "summary": "We present a pairing of automorphic distributions that applies in situations\nwhere a Lie group acts with an open orbit on a product of generalized flag\nvarieties. The pairing gives meaning to an integral of products of automorphic\ndistributions on these varieties. This generalizes classical integral\nrepresentations or \"Rankin-Selberg integrals\" of L-functions, and gives new\nconstructions and analytic continuations of automorphic L-functions.\n  Keywords: Automorphic forms, invariant pairings, automorphic distributions,\nL-functions, analytic continuation, rapid decay.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1106.3863%2C1106.0789%2C1106.5729%2C1106.2976%2C1106.3028%2C1106.6191%2C1106.0100%2C1106.2806%2C1106.2642%2C1106.5011%2C1106.1548%2C1106.0371%2C1106.6086%2C1106.2024%2C1106.1984%2C1106.1070%2C1106.0581%2C1106.2714%2C1106.4985%2C1106.6013%2C1106.0815%2C1106.0382%2C1106.4237%2C1106.0222%2C1106.3852%2C1106.3594%2C1106.0942%2C1106.5794%2C1106.3701%2C1106.0326%2C1106.0935%2C1106.5025%2C1106.0635%2C1106.4592%2C1106.5420%2C1106.4686%2C1106.2518%2C1106.1744%2C1106.3314%2C1106.4438%2C1106.6276%2C1106.5184%2C1106.1162%2C1106.1698%2C1106.4566%2C1106.1734%2C1106.1658%2C1106.6177%2C1106.3707%2C1106.5950%2C1106.0527%2C1106.1535%2C1106.0557%2C1106.2944%2C1106.6178%2C1106.1728%2C1106.3162%2C1106.4875%2C1106.0863%2C1106.4215%2C1106.1774%2C1106.1430%2C1106.0647%2C1106.2364%2C1106.4004%2C1106.3948%2C1106.0220%2C1106.0422%2C1106.1103%2C1106.0950%2C1106.4818%2C1106.4547%2C1106.3130%2C1106.2437%2C1106.3179%2C1106.5200%2C1106.4798%2C1106.1183%2C1106.2448%2C1106.5620%2C1106.1285%2C1106.2331%2C1106.3823%2C1106.0085%2C1106.0971%2C1106.5717%2C1106.0820%2C1106.4296%2C1106.4001%2C1106.1346%2C1106.6253%2C1106.5466%2C1106.6173%2C1106.2778%2C1106.5045%2C1106.0636%2C1106.4224%2C1106.3685%2C1106.5499%2C1106.3126%2C1106.5054&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We present a pairing of automorphic distributions that applies in situations\nwhere a Lie group acts with an open orbit on a product of generalized flag\nvarieties. The pairing gives meaning to an integral of products of automorphic\ndistributions on these varieties. This generalizes classical integral\nrepresentations or \"Rankin-Selberg integrals\" of L-functions, and gives new\nconstructions and analytic continuations of automorphic L-functions.\n  Keywords: Automorphic forms, invariant pairings, automorphic distributions,\nL-functions, analytic continuation, rapid decay."}, "authors": ["Stephen D. Miller", "Wilfried Schmid"], "author_detail": {"name": "Wilfried Schmid"}, "author": "Wilfried Schmid", "arxiv_comment": "19 pages, to appear in Mathematische Annalen", "links": [{"href": "http://arxiv.org/abs/1106.2364v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1106.2364v1", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "math.NT", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "math.NT", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "math.RT", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1106.2364v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1106.2364v1", "journal_reference": null, "doi": null, "fulltext": "arXiv:1106.2364v1 [math.NT] 13 Jun 2011\n\nPairings of automorphic distributions∗\nStephen D. Miller\n\nWilfried Schmid\n\nMarch 28, 2011\n\nAbstract\nWe present a pairing of automorphic distributions that applies in\nsituations where a Lie group acts with an open orbit on a product of\ngeneralized flag varieties. The pairing gives meaning to an integral of\nproducts of automorphic distributions on these varieties. This generalizes classical integral representations or \"Rankin-Selberg integrals\"\nof L-functions, and gives new constructions and analytic continuations\nof automorphic L-functions.\nKeywords: Automorphic forms, invariant pairings, automorphic\ndistributions, L-functions, analytic continuation, rapid decay.\n\n1\n\nIntroduction\n\nAmong its many and deep predictions, the Langlands conjectures attach\nfamilies of L-functions to each automorphic representation. The Langlands\nL-functions are expected to have holomorphic continuations – or sometimes\nmeromorphic continuations with poles only at certain specific points – and\nto satisfy functional equations. This has been established in relatively few\ncases so far, generally by one of two methods. One, the Langlands-Shahidi\nmethod, deduces the meromorphic continuation and functional equation from\nthe analogous properties of Eisenstein series – Eisenstein series induced from\nthe automorphic representation in question. The other is called the method\nof integral representations, although it is perhaps more a collection of very\nPartially supported by NSF grants DMS-0500922 and DMS-0601009, and DARPA\ngrant HR0011-04-1-0031\n∗\n\n1\n\n\fclever ideas than a systematic method. These integral representations express\nthe L-function as an integral of matrix coefficients (i.e., automorphic forms),\nor products of matrix coefficients, of the automorphic representation; the\nfunctional equation then follows by applying some appropriate involution,\nwhich has the desired effect on the argument of the L-function.\nThe Langlands-Shahidi method presents the functional equation in exactly the form conjectured by Langlands, with the Gamma factors predicted\nby him. Its range of applicability is limited, because the group which acts on\nthe automorphic representation must arise as Levi component of a maximal\nparabolic in some ambient group. The method of integral representations\ntypically does not produce the Gamma factors directly. As a result, this\nmethod cannot always rule out all unwanted poles of the L-function. The\nsame is true, for different reasons, of the Langlands-Shahidi method.\nIn the papers [4, 5] we have introduced a new approach: we work not\nwith matrix coefficients of an automorphic representation, as in the method\nof integral representations, but with its automorphic distribution. The latter,\nin effect, is the datum of the embedding of the automorphic representation\ninto L2 (Γ\\G); it does not involve the choice of particular matrix coefficients.\nOur approach has the advantage of making the Gamma factors computable\nand allows us to rule out all the unwanted poles. There is a cost, of course –\ndistributions are more difficult to work with than C ∞ functions.\nIn this paper we develop an important analytic tool for our program,\nthe analogue, in the setting of automorphic distributions, of Rankin-Selberg\ntype integrals. Those are integral representations of L-functions, as integrals\nof products of automorphic forms – i.e., multilinear pairings of automorphic\nforms. The analytic properties of the L-functions are then deduced from the\nintegrals in question. Our main result, theorem 2.30, provides an alternative\nby establishing an invariant multilinear pairing of automorphic distributions.\nIn our forthcoming paper [7] we shall use a particular instance of our pairings\nto obtain new analytic information, such as the full analytic continuation, of\nthe exterior square L-function for GL(2n). We intend to use theorem 2.30\nin the future to obtain new results on other L-functions, results that are\ninaccessible by the Rankin-Selberg and Langlands-Shahidi methods. Indeed,\nfor every integral representation we are aware of, there exists an analogous\ndistributional pairing of the type covered by theorem 2.30.\n\n2\n\n\f2\n\nStatement of the main theorem\n\nOur main result involves two reductive Lie groups, G and H. We suppose\nthat both are finite covers – typically but not always the trivial cover – of\nthe groups of real points of algebraic reductive subgroups GQ ⊂ GL(NG , Q)\nand HQ ⊂ GL(NH , Q), respectively. By an arithmetic subgroup Γ ⊂ G, we\nmean a subgroup commensurate with the inverse image, in G, of the group\nof integral points GZ ⊂ GL(NG , Z). We use the same terminology in the case\nof H, of course. We shall suppose that G is realized as a subgroup of H, via\nan inclusion\n(2.1)\n\nG ֒→ H\n\nthat is defined over Q ; in other words, the inclusion is compatible with a\nQ-homomorphism GQ → HQ . It then follows that any arithmetic subgroup\nof ΓH ⊂ H intersects G in an arithmetic subgroup ΓG ⊂ G. To simplify\nvarious statements, we suppose that\n(2.2)\n\nZH , the center of H , is compact.\n\nIn the context of automorphic forms on H, that is not a restrictive hypothesis:\nany automorphic form on which the center of H acts according to a character\nis completely determined by its restriction to the derived group [H, H].\nWe consider a generalized real flag variety Y for H – a compact real algebraic variety with a transitive action of H, such that the isotropy subgroups\nare parabolic. If we let P denote the isotropy subgroup at some base point\ny0 ∈ Y , we can make the identification\n(2.3)\n\nY ∼\n= H/P ,\n\ny0 ∼\n= eP .\n\nWe do not require that the parabolic subgroup P ⊂ H be defined over Q .\nVia the embedding (2.1) G acts on Y . In addition, we consider the datum\nof a connected unipotent subgroup U ⊂ H, which is normalized by G and\ndefined over Q , such that\na) U is the unipotent radical of a Q-parabolic subgroup PU ⊂ H,\n(2.4)\n\nb) G ⊂ MU for some Langlands decomposition PU = MU *AU *U,\nc) U * G has an open orbit O in Y , and\nd) G preserves the bi-invariant measure on U.\n3\n\n\fSince G is reductive and normalizes U it can be extended to a Levi component\nof PU . Thus b) is implied by the simpler, but more restrictive condition\n(2.4)\n\nb′ ) ZG , the center of G, is compact.\n\nWe note that the semidirect product U * G is defined over Q , since both\nfactors are.\nAt this point two examples may be helpful. In the first, G is the group\n±1\nSL (n, R) equipped with the standard Q-structure, H = G × G × G, which\ncontains G diagonally, and U = {e}. Thus a) and d) are vacuously satisfied,\nand the semisimplicity of G implies b). Let Xn denote the flag variety of\nG = SL±1 (n, R),\n(2.5)\n\nXn = { 0 = F0 ⊂ F1 ⊂ * * * ⊂ Fk ⊂ * * * ⊂ Fn = Rn | dim Fk = k } .\n\nThen G acts on Xn with isotropy subgroups conjugate to the lower triangular\nsubgroup. Note that RPn−1 is a generalized flag variety for G. The product\nY = Xn × Xn × RPn−1 can be regarded as a generalized flag variety for H.\nIt is not difficult to see that G, via the diagonal embedding G ֒→ G × G, has\na unique open orbit in Xn × Xn , and that the isotropy subgroup of G at any\npoint of the open orbit is G-conjugate to the diagonal Cartan subgroup. The\ndiagonal Cartan has a unique open orbit in RPn−1 . It follows that U * G = G\nhas a unique open orbit O in Y = Xn ×Xn ×RPn−1 , so (2.4c) is also satisfied.\nFor the second example, G is again SL±1 (n, R) with the standard Qstructure, H = SL±1 (2n, R) × G, also with the standard Q-structure,\n\u0012\u0012\n\u0013\n\u0013\ng 0\n(2.6)\nG ∋ g 7→\n, g\n∈ H = SL±1 (2n, R) × G\n0 g\ndescribes the embedding of G into H, and Y = X2n × RPn−1 , which is a\ngeneralized flag variety for H. The abelian subgroup\n\u0013\n\u0013\n\u001b\n\u001a\u0012 \u0012\ne c\n, e\nc ∈ M(n × n, R)\n(2.7)\nU =\n0 e\nof H is unipotent, defined over Q, and normalized by G. It can also be\ndescribed as the unipotent radical of the (n, n) parabolic in SL±1 (2n, R),\nhence as the unipotent radical of a Q-parabolic subgroup of H. Again the\nsemisimplicity of G implies b). The conjugation action of G = SL±1 (n, R)\non M(n × n, R) preserves the Euclidean measure, so d) is satisfied. The\n4\n\n\fassertion c) can be reduced to the corresponding assertion about the first\nexample: when we embed Xn × Xn diagonally into X2n , and correspondingly\nXn × Xn × RPn−1 into Y , the U-translates of Xn × Xn × RPn−1 sweep out a\ndense open subset of Y ; thus, since G has an open orbit in Xn × Xn × RPn−1 ,\nU * G = G* U does have an open orbit O ⊂ Y .\nWe need to briefly recall the notion of an automorphic distribution.\nLet ΓH ⊂ H denote an arithmetic subgroup. Then H acts unitarily on\nL2 (ΓH \\H), via right translation. An automorphic representation consists of\nan irreducible unitary representation (π, V ) of H, together with a H-invariant\nembedding\n(2.8)\n\nj : V ֒→ L2 (ΓH \\H) .\n\nIf v ∈ V is a C ∞ vector1 , then j(v) is a ΓH -invariant C ∞ function on H.\nThat makes evaluation of j(v) at e ∈ G meaningful. The linear map\n(2.9)\n\nτj : V ∞ −→ C ,\n\nτj (v) = j(v)(e) ,\n\ndefined on the space of C ∞ vectors V ∞ , is continuous with respect to the\nintrinsic topology on V ∞ , and is also ΓH -invariant. Thus τj can be regarded\nas a ΓH -invariant distribution vector for the dual representation (π ′ , V ′ ),\n(2.10)\n\nτj ∈ ((V ′ )−∞ )ΓH .\n\nWe refer to τj as the automorphic distribution associated to the automorphic\nrepresentation (2.8). It completely determines j, since V ∞ is dense in V and\nj(v)(h) = (π(h)j(v))(e) = hτj , π(h)vi for all v ∈ V ∞ , h ∈ H.\nTo simplify the notation, we drop the subscript j, and we interchange the\nroles of (π, V ) and its dual (π ′ , V ′ ); from now on,\n(2.11)\n\nτ ∈ (V −∞ )ΓH .\n\nWe shall also relax the assumption that τ corresponds to an irreducible subspace of L2 (ΓH \\H), as in (2.8–2.9): in the discussion that follows, τ will\ndenote an arbitrary ΓH -invariant distribution vector for an admissible representation (π, V ) of finite length, on a reflexive Banach space2 . In particular,\nτ may denote the automorphic distribution arising from an Eisenstein series.\n1\n2\n\ni.e., a vector such that H ∋ h 7→ π(h)v is a C ∞ V -valued function on H.\nFor an expository discussion of these matters see [6, §5 and appendix].\n\n5\n\n\fWe return to the situation of a generalized real flag variety Y ∼\n= H/P ,\nwith P ⊂ H parabolic, but not necessarily defined over Q . To any finite\ndimensional complex representation\n(2.12)\n\nμ : P → GL(E)\n\nwe associate the H-invariant vector bundle E → Y modeled on E. In other\nwords, E is a vector bundle to which the action of H on Y lifts, and whose\nfiber at the identity coset y0 ∼\n= eP is isomorphic to E as a P -module. Tracing\nback through the definition, one obtains the description\nC∞\n\n(2.13) C ∞ (Y, E) ∼\n= { f : H −→ E | f (hp) = μ(p−1 )f (h) for h ∈ H, p ∈ P }\nof its space of C ∞ sections. This isomorphism relates the action of H on the\nspace of smooth sections C ∞ (Y, E), by means of the structure of equivariant\nvector bundle, to the action, via left translation, on the space of smooth\nE-valued functions on H.\nWe follow the convention of using the term \"distribution\" in the sense\nof \"generalized function\": scalar valued distributions are dual to smooth\nmeasures, and thus continuous functions can be viewed as distributions. In\ncomplete analogy to (2.13), there exists a natural, H-invariant isomorphism\nC −∞\n\n(2.14) C −∞ (Y, E) ∼\n= {σ : H −→ E | σ(hp) = μ(p−1 )σ(h) for h ∈ H, p ∈ P }\nbetween the space C −∞ (Y, E) of sections of E with distribution coefficients\nand the space of E-valued distributions on H which transform in the specified\nmanner under right translation by elements of H. The identity σ(hp) =\nμ(p−1 )σ(h) has only symbolic meaning, of course, since distributions cannot\nbe evaluated at points.\nWhen one puts a Riemannian metric on Y and a hermitian metric on\nthe vector bundle E, it makes sense to consider the space of all L2 sections\nof E → Y . That is a Hilbert space, on which H acts continuously, but\ngenerally not unitarily. The resulting representation of H is known to be\nadmissible, of finite length. Its spaces of C ∞ and distribution vectors are\nnaturally isomorphic to the spaces (2.13) and (2.14), respectively. From now\non we keep fixed an arithmetic subgroup ΓH ⊂ H and a particular\n(2.15)\n\nτ ∈ C −∞ (Y, E)ΓH .\n\n6\n\n\fThen τ is an automorphic distribution in the sense of our earlier discussion.\nAccording to the Casselman embedding theorem [2] and results of CasselmanWallach [8, §11], the space of distribution vectors for any irreducible unitary\nrepresentation can be embedded into the space of distribution vectors (2.14),\nwith appropriate choices of Y and E. In that sense, all automorphic distributions τj that encode irreducible subspaces of L2 (ΓH \\H) as in (2.8–2.9) can\nbe realized as in (2.15); for details see [4, 5].3\nWe denote the action of H on sections of E → Y , and also on functions\nand distributions on H, by the letter l, for left translation. In analogy to\nthe case of automorphic forms, the automorphic distribution τ is said to be\ncuspidal if\nZ\n(2.16)\nl(n)τ dn = 0\nN/(ΓH ∩N )\n\nfor any unipotent subgroup {e} =\n6 N ⊂ H which arises as the unipotent\nradical of a Q-parabolic subgroup P ⊂ H. We also need a weaker notion.\nSuppose\n(2.17)\n\nH = H1 × H2\n\n(in the category of groups defined over Q)\n\ncan be expressed as the product of two reductive, non-abelian factors. We\nshall then say that τ is cuspidal with respect to the factor H1 if the integral\n(2.16) vanishes for any unipotent subgroup {e} =\n6 N ⊂ H1 which arises as\nthe unipotent radical of a Q-parabolic subgroup P ⊂ H1 . That will be a\npotential hypothesis in the statement of our main theorem, but under the\nadditional assumption that\n(2.18)\n\nthe projection of G ⊂ H into Hj has a finite kernel,\n\nfor both j = 1, 2.\nRecall the conditions (2.4). We choose a base point o ∈ O and let (UG)o\ndenote the isotropy subgroup of U * G at o . The surjective map\n(2.19)\n\np : U * G −→ O ,\n\n3\n\np(u g) = u g*o ,\n\nIn those references, we consider only line bundles, rather than vector bundles E → Y .\nFor linear groups, line bundles suffice. In this paper we also consider nonlinear groups.\nThe Cartan subgroups of a non-linear group H need not be abelian, which necessitates\nworking with representations parabolically induced from finite dimensional representations\nof dimension greater than one – or in geometric terms, with vector bundles rather than\nline bundles.\n\n7\n\n\finduces a (U * G)-equivariant identification O ≃ (U * G)/(UG)o . Distribution\nsections of the H-equivariant vector bundle E → Y can be restricted to the\nopen subset O ⊂ Y , and then pulled back from O ≃ (U* G)/(UG)o to U* G\nvia p. We choose s ∈ H so that\n(2.20) o = sP ∈ H/P ∼\n= Y, and consequently (UG)o = (U * G) ∩ sP s−1.\nThe (U * G)-equivariant vector bundle E|O → O ∼\n= (U * G)/(UG)o is attached\nto the representation\n(2.21)\n\n(UG)o ∋ v 7→ μ(s−1vs) ∈ GL(E) ,\n\nhence, in analogy to (2.14),\n(2.22)\nC −∞\n\nC −∞ (O, E) ≃ { σ : (U * G) −→ E | r(v)σ = μ(s−1 v −1 s)σ for v ∈ (UG)o } .\nHere r denotes the right translation action on possibly vector valued functions\nand its natural extension to distributions.\nEven if the representation (2.12) is irreducible, its restriction to s−1 (UG)o s\nmay well have a trivial quotient. We suppose that is the case4 , and fix\n\u0001\n(2.23)\nq : E −→ C\n(s−1 (UG)o s)-equivariant projection .\nComposing, from right to left, restriction of sections of E from Y to O,\npullback from O to U* G, and the projection q from E to C, we obtain a map\npe∗ from C −∞ (Y, E) to scalar valued distributions on U * G,\n(2.24)\n\npe∗ : C −∞ (Y, E) −→ C −∞ (U * G) .\n\nIn terms of the isomorphisms (2.14) and (2.22), is given by the explicit formula\n\u0001\n\u0001\n(2.25)\npe∗ σ (ug) = q σ(ugs) .\n4\n\nThis hypothesis is necessary to construct the distributional pairing. Geometrically\nit means that the restriction of E to the open orbit O has a U * G-equivariantly trivial\nrank one quotient bundle. When we are dealing with a line bundle L rather than a vector\nbundle E – cf. the previous footnote – it reduces to the assumption that the restriction\nof L to O is U * G-equivariantly trivial. In some applications, such as [7], it is vacuously\nsatisfied.\n\n8\n\n\fThen pe∗ is (U * G)-equivariant by construction. In particular, it maps ΓH invariant distribution sections, such as τ , to scalar distributions invariant\nunder both ΓH ∩ U and ΓH ∩ G.\nTo continue with the hypotheses of our main theorem, we note that the\ntwo subgroups\n(2.26)\n\nΓG = ΓH ∩ G ⊂ G\n\nand\n\nΓU = ΓH ∩ U ⊂ U\n\nare arithmetic. Since G normalizes U, ΓG normalizes ΓU ; moreover\n(2.27)\n\nΓU \\U is compact,\n\nas is the quotient of any unipotent linear group over Q modulo an arithmetic\nsubgroup. For any character\n(2.28)\n\nψ : U → C∗ such that\na) ψ ≡ 1 on ΓU , and\nb) ψ(gug −1) = ψ(u) for all g ∈ G , u ∈ U ,\n\nwe define the averaging operator\n(2.29)\n\nAψ : C −∞ (Y, E)ΓH −→ C −∞ (Y, E)ΓU *ΓG ,\nZ\n1\nAψ (σ) =\nψ(u) l(u)σ du .\nvol(U/ΓU ) U/ΓU\n\nThis makes sense because of (2.4d) and (2.27–2.28). We shall briefly comment\non the analytic aspects of the definition in section 3.\nTheorem 2.30. Under the hypotheses just stated, for any φ ∈ Cc∞ (G),\nZ\nFτ,q,ψ,φ =def\nφ(g) r(g) pe ∗(Aψ τ ) dg\nG\n\nis a left ΓG -invariant smooth function on U * G, translating under the right\naction of U on U* G according to the character ψ, and under the left action of\nU according to the complex conjugate character ψ. In particular the restriction of Fτ,q,ψ,φ to G lies in C ∞ (ΓG \\G). If τ ∈ C −∞ (Y, E)ΓH is cuspidal or\nis at least cuspidal with respect to one factor Hj in the setting (2.17–2.18),\nthis restricted function decays rapidly along all the cusps of ΓG \\G, and the\nintegral\nZ\nFτ,q,ψ,φ (g) dg\nΓG \\G\n\n9\n\n\fconverges absolutely. The value of the integral does notR depend on the choice\nof φ, provided φ satisfies the normalizing condition G φ(g) dg = 1. If τ\ndepends holomorphically on a parameter5 , then the value of the integral also\ndepends holomorphically on that parameter.\nLet us re-state the theorem informally, in more suggestive terms. First of\nall, the action of U * G on its open orbit O allows us to think of pe∗ (Aψ τ ) ∈\nC −∞ (U * G) as\nZ\n1\n∗\n(2.31)\npe (Aψ τ )(ug) =\nψ(u1)−1 q(τ (u1 ugs)) du1 .\nvol(ΓU \\U) ΓU \\U\n\nThis distribution transforms by the character ψ in the u-variable, and thus\nhas smooth dependence on u ∈ U. It therefore makes sense to speak of its\nrestriction to the G factor, in which it is formally automorphic under ΓG .\nSuppose momentarily that ΓG is cocompact in G. Then the integral of this\nrestriction over ΓG \\G,\nZ\nZ\n1\nψ(u)−1 q(τ (ugs)) du dg ,\n(2.32)\nvol(ΓU \\U) ΓG \\G ΓU \\U\nmakes sense as the integral of a distribution against the smooth measure dg\nover a compact manifold. Right translating g by g1 ∈ G does not change the\nvalue of (2.32), nor does integrating the resulting integral over g1 against a\nsmooth function φ of compact support and total integral 1. In other words,\nthe integral of the function\nZ Z\n1\n(2.33) Fτ,q,ψ,φ (g) =\nψ(u)−1 q(τ (ugg1 s)) φ(g1) du dg\nvol(ΓU \\U) G ΓU \\U\nover ΓG \\G – the integral in the statement of the theorem – equals (2.32),\nagain assuming that ΓG is cocompact in G. In the noncompact setting (where\nnearly all our applications lie), we cannot directly make sense of (2.32), but\nrather use (2.33) to define pairing in the statement of the theorem.\n5\n\nHolomorphic dependence is to be taken in the weak sense: a distribution σs depends\nholomorphically on the parameter s if the integral of σs against any test function depends\nholomorphically on s. Eisenstein distributions – the analogues of Eisenstein series in the\ncontext of automorphic distributions – are typical examples of distributions depending\nholomorphically on a parameter.\n\n10\n\n\fIn applications of theorem 2.30, H typically factors as a product H =\nH1 × H2 , and correspondingly τ = τ1 * τ2 as the product of two automorphic distributions, one for each of the factors Hj . One can then think of the\nintegral of Fτ,q,ψ,φ in the theorem as defining a pairing between the two automorphic distributions. That is the reason for the title of our paper. Often\none of the factors τj is an Eisenstein series – not a classical Eisenstein series,\nof course, but its distribution version. Nonetheless one can \"unfold\", just\nas one does in the traditional Rankin-Selberg approach. This can be carried\nout in one of several ways, depending on the particular application – see, for\nexample, [5, 7]. For that reason, we shall treat the unfolding not here, but in\npapers in which we apply theorem 2.30.\nWe conclude with some explicit examples of pairings that are explained\nin further detail in [5]. Recall that s ∈ H was introduced in (2.20) in order to\nidentify the quotient (U* G)/(UG)o with its open orbit O. It is a straightforward matter to make this explicit in any particular example. For instance,\nlet us consider the open orbit of G = SL±1 (2, R) on RP1 × RP1 × RP1 that\nwas considered above in the earlier examples. If f1 = ( 10 01 ), f2 = ( 10 11 ), and\nf3 = ( 10 −1\n0 ), the diagonal action of G on H = G × G × G gives an open\norbit in the flag variety RP1 × RP1 × RP1 with basepoint represented by\ns = (f1 , f2 , f3 ) ∈ H. Thus if τ1 , τ2 , and τ3 are automorphic distributions for\nG, the integral defined in theorem 2.30 is equal to\nZ\nZ\n(2.34)\nτ1 (ghf1 ) τ2 (ghf2 ) τ3 (ghf3 ) φ(h) dh dg ,\nΓG \\G\n\nG\n\nand is related to the Rankin-Selberg L-function of τ1 ⊗τ2 when τ3 is an Eisenstein series distribution. As an example with a nontrivial unipotent integration, let us return to (2.6)-(2.7) and let τ1 be an automorphic distribution\nfor SL±1 (4, R), and τ2 be an automorphic distribution for G = SL±1 (2, R).\nThe integral defined in theorem 2.30 in this case is\n(2.35)\nZ\nZ Z\n\u0001\u0001\n1\nψ(u)−1 τ1 u ghf1 ghf2 τ2 (ghf3 ) du dh dg ,\nvol(ΓU \\U) ΓG \\G G ΓU \\U\nand is related to the exterior square L-function of τ1 when τ2 is an Eisenstein\nseries distribution.\n\n11\n\n\f3\n\nSmoothing the integrand\n\nIn this section we will first prove the invariance and smoothness properties\nasserted in theorem 2.30, and then give a construction of Fτ,q,ψ,φ as an integral\nof an automorphic form on H in lemma 3.9. The integral is then used in the\nfollowing section to prove the remaining properties asserted in the theorem.\nWe continue with the hypotheses and notation of the previous section, and\nreturn briefly to the definition (2.29) of the averaging operator Aψ . Like the\nspace of distributions on any C ∞ manifold, C −∞ (Y, E) has an intrinsic topology as complete, locally convex, Hausdorff topological vector space. These\nare precisely the properties one needs to define the integral of a continuous,\ncompactly supported function with values in a topological vector space. The\naction of H on C −∞ (Y, E) is continuous by general principles. It follows\nthat u 7→ ψ(u)l(u)τ , for τ ∈ C −∞ (Y, E)ΓH , can be regarded as a continuous\nfunction, defined on the compact manifold U/ΓU , with values in the topological vector space C −∞ (Y, E). As such it has a well defined integral, which\nrepresents Aψ τ .\nLet us first examine the smoothness and the invariance properties asserted\nby the theorem. For u ∈ U,\nZ\n1\nl(u)(Aψ τ ) =\nψ(v)l(uv)τ dv\nvol(U/ΓU ) U/ΓU\nZ\n(3.1)\n1\n=\nψ(u−1 v)l(v)τ dv = ψ(u) Aψ τ ,\nvol(U/ΓU ) U/ΓU\nand therefore, in view of the (U * G)-equivariance of pe∗ ,\n\n(3.2)\n\nl(u) pe∗(Aψ τ ) = ψ(u) pe∗ (Aψ τ ) .\n\nIn terms of the identification U* G ≃ U × G, the distribution pe∗ (Aψ τ ) transforms according to the character ψ in the U-variable. Without loss of information, we can set the U-variable equal to the identity and – temporarily –\nregard pe∗ (Aψ τ ) as distribution on G. Convolution with a compactly supported smooth function turns any distribution on G into a smooth function.\nWe then put the U-variable back in and conclude:\nZ\n(3.3)\nFτ,q,ψ,φ =\nφ(g) r(g) pe ∗(Aψ τ ) dg is a C ∞ function on U * G ,\nG\n\n12\n\n\ffor every φ ∈ C ∞ (G). Convolution on the right commutes with left translation. Hence, for u ∈ U, (3.2) implies\n(3.4)\n\nl(u)Fτ,q,ψ,φ = ψ(u)Fτ,q,ψ,φ .\n\nNow suppose g ∈ G, u, u1 ∈ U. Then, in view of (2.28b) and (3.4),\n(r(u)Fτ,q,ψ,φ)(u1 g) = Fτ,q,ψ,φ (u1 gug −1g) = (l((u1gug −1)−1 )Fτ,q,ψ,φ )(g)\n= ψ(u1 gug −1)Fτ,q,ψ,φ (g) = ψ(u)ψ(u1)Fτ,q,ψ,φ (g)\n(3.5)\n\u0001\n= ψ(u) l(u−1\n1 )Fτ,q,ψ,φ (g) = ψ(u)Fτ,q,ψ,φ (u1 g) ,\n\nso r(u)Fτ,q,ψ,φ = ψ(u)Fτ,q,ψ,φ . Since Aψ τ is ΓG -invariant on the left, since\npe∗ is G-equivariant, and since right and left translation commute,\n(3.6)\n\nl(γ)Fτ,q,ψ,φ = Fτ,q,ψ,φ , for every γ ∈ ΓG .\n\nThese are the smoothness and the invariance properties of Fτ,q,ψ,φ , as asserted.\nFor the proof of rapid decay in the next section, we need to work with\nan auxiliary function Φτ,q,ψ,φ,φU , whose definition involves the choice of some\nφU ∈ Cc∞ (U), in addition to τ , ψ, and φ. We impose the normalization\nconditions\nZ\nZ\nφ(g) dg = 1 ,\nφU (u) du = 1 ,\n(3.7)\nG\n\nU\n\nand regard q◦τ as a scalar valued distribution on H, via (2.14) and (2.23).\nThat allows us to consider\nZ Z\n(3.8)\nΦτ,q,ψ,φ,φU =\nφ(g) φU (u) ψ(u) r(u) r(gs) q◦τ du dg ,\nG\n\nU\n\nas a scalar distribution on H. Recall that s ∈ H, as defined in (2.20), relates\nthe base points y0 ∈ Y and o ∈ O.\nLemma 3.9. Φτ,q,ψ,φ,φU is a ΓH -automorphic form6 on H – i.e., a ΓH -invariant C ∞ function of uniformly moderate growth, which transforms finitely\nunder the action of the algebra of bi-invariant differential operators on H.\nMoreover, for all g ∈ G,\nZ\n1\nψ(u) (l(u) Φτ,q,ψ,φ,φU ) (g) du = Fτ,q,ψ,φ (g) .\nvol(U/ΓU ) U/ΓU\n6\n\na smooth automorphic form, not required to transform finitely under the right action\nof a maximal compact subgroup, as is often assumed.\n\n13\n\n\fProof: Let E ∗ → Y denote the H-invariant vector bundle dual to E, and\n∧top T ∗ Y the top exterior power of the cotangent bundle of Y – i.e., the line\nbundle whose C ∞ sections are smooth measures on Y . We shall produce a\nsmooth section ω of the tensor product,\n(3.10)\nZ\nω ∈ C ∞ (Y, E ∗ ⊗ ∧top T ∗ Y ) , such that Φτ,q,ψ,φ,φU (h) =\n\nh l(h−1 )τ , ω i ;\n\nY\n\n−1\n\nhere h l(h )τ , ω i denotes the contraction between ω ∈ C (Y, E ∗ ⊗∧top T ∗ Y )\nand l(h−1 )τ ∈ C −∞ (Y, E), resulting in a scalar valued, distribution coefficient\nform of top degree on the compact manifold Y . As such, it can be integrated\nover Y against any smooth function, in particular the constant function 1.\nWe assume the existence of ω for the moment. In section 2 we mentioned\nthat C −∞ (Y, E) is the space of distribution vectors V ∞ for an admissible,\nrepresentation (π, V ) of H, of finite length, on a Hilbert space. Analogously\nits topological dual C ∞ (Y, E ∗ ⊗ ∧top T ∗ Y ) can be regarded as the space of C ∞\nvectors (V ′ )∞ for the dual representation (π ′ , V ′ ). If we now let h , i denote\nthe pairing between V −∞ and (V ′ )∞ , we can rewrite the equality in (3.10) as\n(3.11)\n\n∞\n\nΦτ,q,ψ,φ,φU (h) = h l(h−1 )τ , ω i .\n\nSince h 7→ l(h−1 )τ is a smooth function on H, with values in the topological\nvector space V −∞ , and since the pairing is linear and continuous in each\nvariable, the description (3.11) exhibits Φτ,q,ψ,φ,φU as a C ∞ function. Moreover, any function of this type, with τ ∈ (V −∞ )ΓH , is a C ∞ automorphic\nform [6, (2.15)].\nWe continue to assume the existence of ω. We shall establish the identity\nstated at the end of the lemma. Since it only involves the values of Φτ,q,ψ,φ,φU\non U * G, we now regard this function as defined on U * G, rather than on H\nas in (3.8). Recall the definition of the averaging operator Aψ in (2.29). Left\nand right translation commute, hence\nZ\n1\nψ(u) (l(u) Φτ,q,ψ,φ,φU ) du =\nvol(U/ΓU ) U/ΓU\nZ Z\n=\nφ(g) φU (u) ψ(u) r(u) r(g) pe ∗(Aψ τ ) dg du\nZU G\n(3.12)\n=\nφU (u) ψ(u) r(u)Fτ,q,ψ,φ du\nZU\n=\nφU (u) |ψ(u)|2 Fτ,q,ψ,φ du = Fτ,q,ψ,φ .\nU\n\n14\n\n\fAt the first step of this chain of equalities, we have used the definition (3.8)\nof Φτ,q,ψ,φ,φU , the definition (2.29) of Aψ , as well as the characterization\nof the map pe∗ in (2.24); at the second step we have used the definition of\nFτ,q,ψ,φ in the statement of the main theorem; and finally, in the third step,\nthe transformation law (3.5) and the normalization (3.7) of φU .\nWe shall construct ω first as a smooth, compactly supported, E-valued\nmeasure on O. Since O is open in Y , we can then regard ω as an element\nof C ∞ (Y, E ∗ ⊗ ∧top T ∗ Y ). Recall the definition, above (2.19), of (UG)o as the\nisotropy subgroup of U* G at o = s*y0 ∼\n= sP . Since U* G and P are defined,\nrespectively, over Q and over R ,\n(3.13)\n\n(UG)o = (U * G) ∩ sP s−1\n\nis an R-subgroup of H . We define\n(3.14)\n\nf0 ∈ Cc∞ (U * G) ,\n\nf0 (ug) = φ(g) φU (u) ψ(u) .\n\nNote that U* G is unimodular because of (2.4d). Haar measure on this group\ncan be described as the product du dg of the Haar measures on U and G.\nThe normalizations (3.7) imply that f0 du dg is well-defined, independently\nof the scaling of du and dg . We let (μ∗ , E ∗ ) denote the representation of P\ndual to (μ, E), and choose e∗ ∈ E ∗ such that\n(3.15)\n\nq(e) = h e∗ , e i\n\nfor all e ∈ E .\n\nUsing this notation, we interpret (3.8) as an identity between distributions\non H,\nZ\nh f0 (ug) e∗ , τ (hugs) i du dg .\n(3.16)\nΦτ,q,ψ,φ,φU (h) =\nU *G\n\nThe group (UG)o may not be unimodular. We pick a left invariant Haar measure dv ; the particular normalization will turn out not to matter. Averaging\nfirst over (UG)o and integrating the result over the quotient (U * G)/(UG)o ,\nwe find\nZ\nZ\ndu dg\nh f0 (ugv) e∗ , τ (hugvs) i dv\n(3.17) Φτ,q,ψ,φ,φU (h) =\n;\ndv\n(U *G)/(U G)o (U G)o\nhere du dg/dv is regarded as smooth measure on (U*G)/(UG)o in the obvious\nmanner.\n15\n\n\fAll along we have used (2.14) to regard τ as E-valued distribution on H,\ntransforming under right translation by p ∈ P according to μ(p−1 ). Hence\n(3.18)\n\nh f0 (ugv) e∗ , τ (hugvs) i = h f0 (ugv) e∗ , μ(s−1 v −1 s)τ (hugs) i\n= h f0 (ugv) μ∗(s−1 vs)e∗ , τ (hugs) i .\n\nThe C ∞ function f : U * G → E ∗ , defined by\nZ\nf0 (ugv) μ∗(s−1 vs)e∗ dv ,\n(3.19)\nf (ug) =\n(U G)0\n\nis well defined because the support of any left translate of f0 intersects (UG)o\nin a compact subset. As direct consequence of the construction,\n(3.20)\n\nf (ugv) = μ∗ (s−1 v −1 s)f (ug)\n\nfor all v ∈ (UG)o .\n\nThat, in analogy to (2.22) with C ∞ in place of C −∞ , allows us to regard f\nas a C ∞ section of E ∗ → (U * G)/(UG)o ∼\n= O . The fact that f0 has compact\nsupport in U * G implies the compact support, modulo (UG)o , of f ,\nf ∈ Cc∞ (O, E ∗) .\n\n(3.21)\n\nAt this point we can reinterpret the outer integral in (3.17) as the integral\nof the smooth, compactly supported, E ∗ -valued measure\n(3.22)\n\nω = f\n\ndu dg\n∈ Cc∞ (O, E ∗ ⊗ ∧top T ∗ Y )\ndv\n\nagainst the E-valued distribution section l(h−1 )τ ∈ C ∞ (Y, E). In effect, we\nhave verified (3.10), completing the proof of the lemma.\n\u0003\nTo construct ω in the preceding proof, we averaged f0 over (UG)0 on the\nright, and f0 involved the function φ as a factor. Hence:\nRemark 3.23. If the support of φ is kept fixed, the dependence of ω on φ is\nbounded in C k norm, for every k ∈ N.\n\n4\n\nRapid decay\n\nIn this section we finish the proof of theorem 2.30, using lemma 3.9 as a\nmain tool. We shall use the results of [6], in particular theorem 4.7 of that\n16\n\n\fpaper. The notation there differs from our current notation, since the two\npapers were written for different purposes. The role of the current ambient\ngroup H, or of its factors Hj in (2.17), is played by G in [6], and the role of\nthe unipotent group U by N1 . The group G in [6] satisfies exactly the same\nhypotheses as our ambient group H. Since our current G is reductive and\ndefined over Q , it can be extended to a Levi component, defined over Q , of\nthe parabolic subgroup PU ⊂ H. Thus we may assume that the Langlands\ndecomposition in (2.4b) is defined over Q. That, in view of (2.28), makes G\na reductive Q-subgroup of the group denoted by L in [6, §4]. If L1 ⊂ L2 is\nan inclusion of real reductive groups defined over Q , any Siegel set in L1 is\ncontained in the intersection of L1 with an appropriately chosen Siegel set\nin L2 . Thus, for statements about rapid decay on Siegel sets of automorphic\nforms on some ambient group, any decay statement for L2 directly implies\nthe analogous statement for L1 . In our words, for our purposes it is really\nirrelevant whether the current G is a subgroup of the L in [6, §4], or all of it.\nLet us restate theorem 4.7 of [6] in our current notation. We consider\nthe automorphic form Φτ,q,ψ,φ,φU on H associated to a cuspidal automorphic\ndistribution τ ∈ C −∞ (Y, E) and ω ∈ Cc∞ (O, E ∗ ⊗ ∧top T ∗ Y ) as in (3.10); in\nthe proof of lemma 3.9, ω was constructed in terms of q, ψ, φ, φU , of course.\nThen for any Siegel set SG ⊂ G, any c in the inverse image of GQ in G – cf.\nthe discussion at the beginning of section 2 – and any n ∈ N, there exists a\nconstant C > 0 such that\n(4.1)\n\nu ∈ U , g ∈ SG\n\n=⇒\n\n|Φτ,q,ψ,φ,φU (u c g)| ≤ Ckgk−n .\n\nWhen Fτ,q,ψ,φ (u c g) is defined in terms of Φτ,q,ψ,φ,φU by the formula in lemma\n3.9, the above estimate directly implies\n(4.2)\n\ng ∈ SG\n\n=⇒\n\n|Fτ,q,ψ,φ (u c g)| ≤ Ckgk−n .\n\nA finite number of translates c SG cover ΓG \\G, so (4.2) implies the integrability of Fτ,q,ψ,φ (u c g) over ΓG \\G, at least when τ is cuspidal.\nThe preceding argument must be modified when τ is only cuspidal with\nrespect to one of the factors in a factorization (2.17) – say with respect to\nH1 for definiteness. In that situation [6, theorem 5.13] asserts the simultaneous rapid decay in the first factor and moderate growth in the second for\nΦτ,q,ψ,φ,φU (h1 h2 ) , provided h1 varies in a Siegel set S1 ⊂ H1 and h2 over H2 .\nRapid decay trumps moderate growth when Φτ,q,ψ,φ,φU is restricted to U* G ;\nthis depends on the hypothesis (2.18), of course. Thus both (4.1) and (4.2)\nremain valid even in the partially cuspidal case.\n17\n\n\fOnly two assertions remain to be verified to complete the proof of theorem\n2.30. First of all, we need to show that the integral\nZ\nZ\nZ\n(4.3)\nFτ,q,ψ,φ (g) dg =\nφ(g1 ) pe∗ (Aψ τ )(gg1) dg1 dg\nΓG \\G\n\nΓG \\G\n\nG\n\ndepends only on the total integral of the smoothing function φ, but not\notherwise on the particular choice of φ. Since the measure on ΓG \\G is Ginvariant on the right, we can right translate the argument g by any fixed\ng2 ∈ G without changing the value of the integral (4.3). Equivalently, we\ncan replace φ by l(g2 )φ without affecting the integral. On the infinitesimal\nlevel this means that the integral vanishes whenever φ = l(Z)φ̃ is the left\ninfinitesimal translate of some φ̃ ∈ Cc∞ (G) by some Z ∈ g . Thus the integral\n(4.3) depends only on the image of φ in the quotient\n(4.4)\n\nCc∞ (G)/l(g)Cc∞ (G) .\n\nSince G is parallelizable, this quotient represents the top cohomology group\nof the de Rham complex with compact support. As such, it is naturally dual\nto H0 (G, C), and the duality is implemented by integration over the various\nconnected components of G. If G is connected, we can conclude that\nR\n(4.5)\nl(g)Cc∞ (G) = { φ ∈ Cc∞ (G) | G φ(g) dg = 0 } ,\nwhich implies the conclusion we want. The case of several connected components reduces readily to the connected case; what matters here is that\nreplacing φ by l(g2 )φ, with g2 ∈ G, does not affect the value of the integral.\nThe preceding argument involves interchanging the order of differentiation and integration. To make this legitimate, one needs to know that the\nabsolute convergence of the integral of Fτ,q,ψ,φ over ΓG \\G can be estimated –\nwhen τ , ψ, and the support of φ are kept fixed – in terms of some C k norm\non φ. Recall the remark 3.23. Since Fτ,ψ,φ was expressed in terms of the\nautomorphic form Φτ,ψ,φ,φU , which involves φ via ω in the identity (3.11),\nwe need to quantify the decay of Φτ,ψ,φ,φU in terms of some C k norm of ω,\nagain assuming τ is fixed. In the notation of [6, theorem 5.13], ω corresponds\nto the vector v. The estimate in that theorem depends linearly on the C k\nnorm of v, which provides the necessary justification.\nAs was remarked earlier, for us holomorphic dependence of a distribution\non a complex parameter means dependence in the \"weak sense\" – i.e., the\n18\n\n\fintegral of the distribution against any test function depends holomorphically\non the parameter in question. According to (3.10), the values of the function\nΦτ,q,ψ,φ,φU can be interpreted as the result of paring the distribution section τ\nof the vector bundle E over the compact manifold Y against a smooth measure\nwith values in the dual vector bundle. Thus, if τ depends holomorphically\non a complex parameter, then so does the function Φτ,q,ψ,φ,φU , and in view\nof lemma 3.9, also the function Fτ,q,ψ,φ . This completes the proof of theorem\n2.30.\n\nReferences\n[1] A. Borel, Introduction aux groupes arithmétiques, Actualités scientifiques et industrielles 1341, Hermann, Paris, 1969.\n[2] W. Casselman, Jacquet modules for real reductive groups, Proceedings of the International Congress of Mathematicians (Helsinki, 1978), 1980, pp. 557–563.MR 83h:22025\n[3]\n\n, Canonical extensions of Harish-Chandra modules to representations of G,\nCanad. J. Math. 41 (1989), no. 3, 385–438.MR 90j:22013\n\n[4] Stephen D. Miller and Wilfried Schmid, Automorphic Distributions, L-functions,\nand Voronoi summation for GL(3), Annals of Math. 164 (2006), no. 2, 423–488.\nMR2247965 (2007j:11065)\n[5]\n\n[6]\n[7]\n\n, The Rankin-Selberg method for automorphic distributions, Representation theory and automorphic forms, Progr. Math., vol. 255, Birkhäuser Boston, Boston, MA,\n2008, pp. 111–150.\n, On the rapid decay of cuspidal automorphic forms (2010). preprint.\n, The archimedean theory of the Exterior Square L-functions over Q (2010).\nPreprint.\n\n[8] Nolan R. Wallach, Real Reductive Groups I, II, Pure and Applied Mathematics,\nvol. 132-I,II, Academic Press, 1988,1992.\n\nStephen D. Miller\nDepartment of Mathematics\nHill Center-Busch Campus\nRutgers, The State University of New Jersey\n110 Frelinghuysen Rd\nPiscataway, NJ 08854-8019\nmiller@math.rutgers.edu\n\n19\n\nWilfried Schmid\nDepartment of Mathematics\nHarvard University\nCambridge, MA 02138\nschmid@math.harvard.edu\n\n\f"}