{"id": "http://arxiv.org/abs/0706.0054v1", "guidislink": true, "updated": "2007-06-01T14:06:29Z", "updated_parsed": [2007, 6, 1, 14, 6, 29, 4, 152, 0], "published": "2007-06-01T14:06:29Z", "published_parsed": [2007, 6, 1, 14, 6, 29, 4, 152, 0], "title": "Evidence for ablated flows in the shell of nova DQ Her", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0706.1717%2C0706.0700%2C0706.1811%2C0706.2736%2C0706.2117%2C0706.3171%2C0706.3757%2C0706.3276%2C0706.0294%2C0706.3914%2C0706.3258%2C0706.3892%2C0706.1954%2C0706.3041%2C0706.4156%2C0706.2119%2C0706.1034%2C0706.2567%2C0706.0102%2C0706.2934%2C0706.2630%2C0706.0351%2C0706.0960%2C0706.0054%2C0706.1910%2C0706.1528%2C0706.0916%2C0706.0264%2C0706.1261%2C0706.0019%2C0706.1349%2C0706.1129%2C0706.1145%2C0706.4378%2C0706.0487%2C0706.1900%2C0706.2087%2C0706.0869%2C0706.3244%2C0706.0915%2C0706.0593%2C0706.0544%2C0706.2390%2C0706.2325%2C0706.3799%2C0706.0338%2C0706.2453%2C0706.3912%2C0706.3125%2C0706.3616%2C0706.3624%2C0706.1840%2C0706.4008%2C0706.2912%2C0706.1308%2C0706.0637%2C0706.3310%2C0706.4145%2C0706.0460%2C0706.3284%2C0706.4024%2C0706.2295%2C0706.1314%2C0706.4271%2C0706.3493%2C0706.3410%2C0706.1238%2C0706.3726%2C0706.4109%2C0706.1533%2C0706.2971%2C0706.4458%2C0706.3251%2C0706.1754%2C0706.4060%2C0706.1922%2C0706.0992%2C0706.2808%2C0706.1080%2C0706.3864%2C0706.0941%2C0706.1156%2C0706.1562%2C0706.1721%2C0706.3761%2C0706.1250%2C0706.3638%2C0706.2397%2C0706.2594%2C0706.1294%2C0706.0454%2C0706.1690%2C0706.2169%2C0706.3290%2C0706.3514%2C0706.3353%2C0706.0820%2C0706.2447%2C0706.2083%2C0706.3158%2C0706.3658&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Evidence for ablated flows in the shell of nova DQ Her"}, "summary": "High-resolution longslit Halpha spectra of the shell of the old nova DQ Her\nhave been obtained with the William Herschel Telescope using the ISIS\nspectrograph. An equatorial expansion velocity of 370+/-14 km/s is derived from\nthe spectra which, in conjunction with a narrowband Halpha image of the\nremnant, allows a distance estimate of 525+/-28 pc. An equatorial ring which\nexhibits enhanced [NII] emission has also been detected and the inclination\nangle of the shell is found to be 86.8+/-0.2 degrees with respect to the line\nof sight. The spectra also reveal tails extending from the clumps in the shell,\nwhich have a radial velocity increasing along their length. This suggests the\npresence of a stellar wind, collimated in the polar direction, which ablates\nfragments of material from the clumps and accelerates them into its stream up\nto a terminal velocity of order 800-900 km/s.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0706.1717%2C0706.0700%2C0706.1811%2C0706.2736%2C0706.2117%2C0706.3171%2C0706.3757%2C0706.3276%2C0706.0294%2C0706.3914%2C0706.3258%2C0706.3892%2C0706.1954%2C0706.3041%2C0706.4156%2C0706.2119%2C0706.1034%2C0706.2567%2C0706.0102%2C0706.2934%2C0706.2630%2C0706.0351%2C0706.0960%2C0706.0054%2C0706.1910%2C0706.1528%2C0706.0916%2C0706.0264%2C0706.1261%2C0706.0019%2C0706.1349%2C0706.1129%2C0706.1145%2C0706.4378%2C0706.0487%2C0706.1900%2C0706.2087%2C0706.0869%2C0706.3244%2C0706.0915%2C0706.0593%2C0706.0544%2C0706.2390%2C0706.2325%2C0706.3799%2C0706.0338%2C0706.2453%2C0706.3912%2C0706.3125%2C0706.3616%2C0706.3624%2C0706.1840%2C0706.4008%2C0706.2912%2C0706.1308%2C0706.0637%2C0706.3310%2C0706.4145%2C0706.0460%2C0706.3284%2C0706.4024%2C0706.2295%2C0706.1314%2C0706.4271%2C0706.3493%2C0706.3410%2C0706.1238%2C0706.3726%2C0706.4109%2C0706.1533%2C0706.2971%2C0706.4458%2C0706.3251%2C0706.1754%2C0706.4060%2C0706.1922%2C0706.0992%2C0706.2808%2C0706.1080%2C0706.3864%2C0706.0941%2C0706.1156%2C0706.1562%2C0706.1721%2C0706.3761%2C0706.1250%2C0706.3638%2C0706.2397%2C0706.2594%2C0706.1294%2C0706.0454%2C0706.1690%2C0706.2169%2C0706.3290%2C0706.3514%2C0706.3353%2C0706.0820%2C0706.2447%2C0706.2083%2C0706.3158%2C0706.3658&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "High-resolution longslit Halpha spectra of the shell of the old nova DQ Her\nhave been obtained with the William Herschel Telescope using the ISIS\nspectrograph. An equatorial expansion velocity of 370+/-14 km/s is derived from\nthe spectra which, in conjunction with a narrowband Halpha image of the\nremnant, allows a distance estimate of 525+/-28 pc. An equatorial ring which\nexhibits enhanced [NII] emission has also been detected and the inclination\nangle of the shell is found to be 86.8+/-0.2 degrees with respect to the line\nof sight. The spectra also reveal tails extending from the clumps in the shell,\nwhich have a radial velocity increasing along their length. This suggests the\npresence of a stellar wind, collimated in the polar direction, which ablates\nfragments of material from the clumps and accelerates them into its stream up\nto a terminal velocity of order 800-900 km/s."}, "authors": ["N. M. H. Vaytet", "T. J. O'Brien", "A. P. Rushton"], "author_detail": {"name": "A. P. Rushton"}, "author": "A. P. Rushton", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1111/j.1365-2966.2007.12057.x", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/0706.0054v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0706.0054v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "7 pages, 6 figures", "arxiv_primary_category": {"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0706.0054v1", "affiliation": "Jodrell Bank Observatory, School of Physics and Astronomy, The University of Manchester, Macclesfield, Cheshire, UK", "arxiv_url": "http://arxiv.org/abs/0706.0054v1", "journal_reference": null, "doi": "10.1111/j.1365-2966.2007.12057.x", "fulltext": "Mon. Not. R. Astron. Soc. 000, 1–7 (2007)\n\nPrinted 4 November 2018\n\n(MN LATEX style file v2.2)\n\nEvidence for ablated flows in the shell of nova DQ Her\nN. M. H. Vaytet⋆, T. J. O'Brien and A. P. Rushton\n\narXiv:0706.0054v1 [astro-ph] 1 Jun 2007\n\nJodrell Bank Observatory, School of Physics and Astronomy, The University of Manchester, Macclesfield, Cheshire, SK11 9DL, UK\n\nTo appear in the Monthly Notices of the Royal Astronomical Society\n\nABSTRACT\n\nHigh-resolution longslit Hα spectra of the shell of the old nova DQ Her have been\nobtained with the William Herschel Telescope using the ISIS spectrograph. An equatorial expansion velocity of 370 ± 14 km s−1 is derived from the spectra which, in\nconjunction with a narrowband Hα image of the remnant, allows a distance estimate\nof 525 ± 28pc. An equatorial ring which exhibits enhanced [Nii] emission has also been\ndetected and the inclination angle of the shell is found to be 86.8 ± 0.2 degrees with\nrespect to the line of sight. The spectra also reveal tails extending from the clumps in\nthe shell, which have a radial velocity increasing along their length. This suggests the\npresence of a stellar wind, collimated in the polar direction, which ablates fragments\nof material from the clumps and accelerates them into its stream up to a terminal\nvelocity of order 800–900 km s−1 .\nKey words: novae, cataclysmic variables - stars: winds, outflows - stars: individual:\nDQ Her\n\n1\n\nINTRODUCTION\n\nDQ Herculis is a classical nova that outburst in 1934. It\nwas first detected on December 12 of the same year at a\nmagnitude of 3.3 (Campbell 1935). It then reached a maximum apparent magnitude of 1.4 and declined with a t3 of\n94 days (t3 is the time it takes the nova to decline 3 magnitudes in brightness from peak) (Gaposchkin 1956; see also\nBeer 1974). DQ Her is the prototype of its own cataclysmic\nvariable sub-class of intermediate polars (or DQ Her stars),\ndistinguished by a rapidly rotating highly magnetic white\ndwarf (WD) and a companion red star. The powerful magnetic field of the accreting WD (few×106 Gauss) disrupts\nthe inner accretion disc, only allowing material to accrete\nonto its magnetic poles (Patterson 1994). As matter piles\nup on the surface of the primary, the increase in pressure\nand temperature in the degenerate layer of accreted hydrogen eventually leads to a thermonuclear runaway (TNR) on\nthe surface of the WD, resulting in the ejection of a shell of\nmaterial into the circumstellar medium (Starrfield 1989).\nThe components of the central binary system of DQ\nHer have masses of MW D = 0.6M⊙ and Mc = 0.4M⊙ for the\nWD and the companion respectively (Horne, Welsh & Wade\n1993). The distance to DQ Her is still a matter of debate.\nUntil recently, it was believed to be of order 400 ± 100 pc\n(Young & Schneider 1981) and 485 ± 50 pc (Martin 1989).\nHerbig & Smak (1992) however, propose a value of 561 ± 20\npc.\n\n⋆\n\nemail: neil.m.vaytet@postgrad.manchester.ac.uk\n\nIn this paper, we present the results from highresolution longslit spectroscopy of the shell of DQ Her. Expansion velocities, physical size and distance were derived.\nRecent studies of winds from WDs in cataclysmic variables\nhave also suggested that the accretion disc of the central\nbinary has an important role in the polar collimation of the\nwind (Shlosman & Vitello 1993; Knigge & Drew 1996). This\npaper addresses the kinematics of polar tails flowing radially out of the shell. Their origin is believed to be the result of either ablation of clumps situated on the surface of\nthe nova shell by a fast stellar wind, or shadowing from\nthe central photoionising radiation by the dense clumps\n(Slavin, O'Brien & Dunlop 1995). We here disambiguate the\nmechanism by showing that their velocity profiles are accordant to wind ablation.\n\n2\n\nOBSERVATIONS AND RESULTS\n\nLongslit spectra of DQ Her were taken with the ISIS spectrometer on the 4.2 m William Herschel Telescope (WHT)\nin La Palma, Canary Islands on 1996 August 1–3. This instrument possesses a blue and red arm, allowing simultaneous high-resolution spectroscopy at two different wavelength ranges. The TEK-1 and TEK-2 CCD detectors (both\ndevices have a useful imaging area of 1024 × 1024 pixels\nfor a pixel size of 24 × 24μm) were used with the R1200B\nand R1200R gratings, achieving a spectral range of approximately 420 Å with a dispersion of 0.41 Å per pixel and\ncentral wavelengths of 4950 Å and 6600 Å for the blue\nand red arms respectively. This permits study of the Hβ\n\n\f2\n\nN. M. H. Vaytet, T. J. O'Brien and A. P. Rushton\na\n\nb\nN\n\nPos 2\n5\n\n4\n\nE\n\n6\n\n3\n\n1\n\nPos 3\n\nPos 1\n\n2\n\nFigure 1. (a) The nova remnant DQ Her. The axes show distances in arcseconds relative to the centre of DQ Her. The position of 1\"\nwidth slits are superimposed on the image (see text for details).\n(b) Red-arm ISIS spectrum for slit position 1. The clumpiness in the elliptical shell is clearly visible. We also note the faint presence of\nthe [Nii] velocity ellipse centred around λ = 6583.5Å on the right hand side of the bright Hα emission. The horizontal dark line going\nthrough the centre of the image is the continuum emission from the bright central stellar system. The six most visible tails are indicated\nby the arrows.\n\n(λ = 4861.3Å) and [Oiii] 5007 Å (λ = 5006.9Å) emission\nlines at the blue end, and the Hα (λ = 6562.8Å) and the\ntwo [Nii] lines at λ = 6548.1Å and λ = 6583.5Å at the red\nend of the spectrum. The spatial resolution was 0.36 arcseconds/pixel and each spectrum was taken with an exposure\ntime of 1800s. The spectral data were processed using starlink software packages. They were bias and sky subtracted,\ncleaned from cosmic rays and then wavelength calibrated\nusing a Thorium-Argon calibration lamp.\nA 1200s Hα narrowband (filter FWHM = 55Å) image\nof the nova was taken at the WHT on October 25 1997 using the TEK-5 CCD chip (1024 × 1024 24 × 24μm pixels)\nand is shown on Fig. 1 (the image was also de-biased, skysubtracted and cosmic ray cleaned). The scale of the chip at\nthe f ratio of the camera combined with the WHT was 0.11\"\nper pixel, theoretical resolution which is swamped by seeing\neffects of the order of 0.6\"−0.7\" estimated from the FWHM\nof stellar profiles on the image. It revealed a very irregular, clumpy elliptical shell structure, which had a pinched\nappearance at the equator, confirming the observations of\nHerbig & Smak (1992).\nDQ Her is also known to be an eclipsing system (Walker\n1956), which limits the tilt angle of the shell with respect\nto the line of sight to an inclination i > 80◦ , assuming the\ninclination of the shell is the same as the inclination of the\nbinary system. It is in fact believed to be very close to 90◦\n(Wood et al. 2000; Herbig & Smak 1992).\n\n2.1\n\nGeneral structure\n\nThe slit positions are shown on Fig. 1a and the Hα + [Nii]\nspectrum for position 1 is shown in greyscale on Fig. 1b.\nThe red-arm spectra for positions 2 and 3 are displayed on\nFig 2.\nGaussian profiles were fitted to the emission lines using the manual fitting program longslit. The centroids of\nthese Gaussians were then used to calculate the line of sight\nheliocentric velocity (vhel ) as a function of position along\nthe slit. The position-velocity (p-v) array for the position 1\nHα emission is displayed in Fig. 3.\nThe image and p-v array are consistent with an expanding ellipsoidal shell seen almost side-on. The ellipse\nappears to be centred on a systemic heliocentric velocity vsys = −20 ± 10 km s−1 . The resulting maximum\nline of sight velocities were found around the equator with\nvhel = ±(370 ± 14) km s−1 which is close to the expansion velocity of the system since the shell is thought to be\nviewed at an inclination i ≈ 90◦ . The expansion velocity of\nthe equatorial belt must be somewhat smaller as the nebula\npresents a pinched equatorial waist.\nThe major and minor axes are a = 25.31 ± 0.44 arcsec\nand b = 18.70 ± 0.44 arcsec respectively (ignoring the pinch\nat the equator, and this will be the case for all calculations).\nThe eccentricity of the ellipse is therefore e = 0.674 ± 0.024.\nAssuming a constant expansion rate since the explo-\n\n\fEvidence for ablated flows in the shell of nova DQ Her\n\n3\n\na\n\nb\n\nFigure 2. (a) Hα + [Nii] spectrum for slit position 2. (b) Hα + [Nii] spectrum for slit position 3 offset from the central star. The\nequatorial ring enhancement in [Nii] emission is circled (see text).\n\nsion, a distance estimate can be made. The time between\noutburst in December 1934 and the epoch of the image is\napproximately t = 62.88 ± 0.05 years. Hence the equatorial\nradius of the object is (7.34 ± 0.20) × 1014 m. Assuming a\nconstant expansion velocity of 370 ± 14 km s−1 and using\nthe angular size of the nova found on Fig. 1a, the distance\nis d = 525 ± 28 pc. The expansion velocity of the nova in\nthe polar direction can also be estimated by converting the\nangular semi-major axis of 12.66 ± 0.22 arcsec to a physical\nsize of (9.94 ± 0.63) × 1014 m at this distance and then dividing by t. This gives vpol = 501 ± 32 km s−1 . Using the same\nmethod, the expansion velocity for the pinched equatorial\nbelt is found to be veq = 340 ± 14 km s−1 .\n\nbinary system and hence equatorial features in the spectra\nare more clearly visible. Fig. 2b reveals variations in relative brightness between the Hα and [Nii]6583Å emission. By\ncomparing emission intensities through aperture photometry, the Hα /[Nii] ratio for the two circled features is 3.4,\nwhilst the other clumps typically have a ratio of 9.1 with a\nstandard deviation of 0.5. This is evidence for the presence of\nan equatorial ring enhanced in [Nii] in DQ Her, as seen in FH\nSer (Gill & O'Brien 2000). Petitjean, Boisson & Pequignot\n(1990) also claim to have detected an [Nii] equatorial ring\naround DQ Her. An explanation for the origin of these equatorial [Nii] enhancements is yet to come (see Gill & O'Brien\n2000).\n\nSlit position 3 does not intersect with the bright central\n\nIn addition, we note that in Fig. 2b the blueshifted\n\n\fN. M. H. Vaytet, T. J. O'Brien and A. P. Rushton\ntion of the shell to be 81±4degrees from narrowband images\nof DQ Her showing different structural components of DQ\nHer. This implies, along with our results, that the inclination\nangle of the shell is somewhat smaller than that suggested\nby Wood et al. (2000). Finally, the equatorial ring is most\nclearly visible on Fig. 1e of Slavin, O'Brien & Dunlop (1995)\nwhich is taken through a filter whose bandpass is tuned to\nthe emission from [Nii] 6583 Å. This is strong evidence for\nthe existence of an [Nii]-enhanced equatorial ring.\n\n0\n\n5\n\nFrom the geometrical parameters described previously,\nthe volume of the shell is V = (2.24±0.14)×1045 m3 . Assuming that DQ Her has not been previously contaminated by\nother mass-loss processes and taking an average interstellar\nmedium (ISM) density of ρ = 10−21 kg m−3 , the corresponding swept-up mass is Mswept = (1.10 ± 0.08) × 10−6 M⊙ .\nThe mass of the ejected shell is believed to be Mshell =\n2.2×10−4 M⊙ (Martin 1989), much larger than the swept-up\nmass, and hence DQ Her should still be in the free expansion\nphase.\n\n−5\n\nFig. 4 shows the expansion of the shell's semi-major\nand semi-minor axes as a function of time. The slopes of\nthe straight line fits suggest expansion of the shell with constant velocities of vmajor = 525±37 km s−1 for the poles and\nvminor = 399 ± 28 km s−1 for the equator. A likely reason\nwhy these velocities are slightly higher than our measurements made from the spectra is that the early size measurements (between t = 0 and t = 40 years) were made by\nmeasuring the outer angular radius of the shell, whereas in\nthis work the midpoint of the emission was used to determine the size of the shell.\n\n−20\n\n−15\n\n−10\n\nDistance from centre (arcsec)\n\n10\n\n15\n\n20\n\n4\n\n−400\n\n−200\n\n0\n\n+200\n\n+400\n\nVelocity (km/s)\n\nFigure 3. Hα velocity profile of DQ Her for the position 1 spectrum. The ellipse shows the p-v array expected for an ellipsoid\nwith the same minor and major axes expanding at a constant rate,\nwith expansion velocity proportional to distance from centre (i.e.\nHubble type expansion law). The dotted line going through the\ncentre of the ellipse indicates the systemic velocity of the system\nat −20 km s−1 . Extended tails at the poles are clearly visible.\nFinally, we can also see emission interior to the shell; see section\n2.2 for details.\n\ncomponent of the equatorial ring lies below the faint stellar continuum while the redshifted component is situated\nabove it. This can be interpreted as having a slit passing across a circular ring seen almost edge-on but tilted at\na slight angle, which enables a measurement of the inclination of the shell. By measuring the vertical separation\nof the front and back components of the ring, the inclination is estimated at 86.8 ± 0.2 degrees, consistent with\nHerbig & Smak (1992). This is also in reasonable agreement with Wood et al. (2000), who obtain their estimate of\nthe inclination of the central binary system at 89.6 ± 0.1\ndegrees via smoothed particle hydrodynamic simulations.\nThis is strong evidence for a direct relationship between the\ncentral binary and the structure of the extended remnant\nshell. Further evidence for this inclination can be found in\nSlavin, O'Brien & Dunlop (1995) who measure the inclina-\n\nWe compare the evolution of DQ Her to that of nova\nGK Per (1901), for which shell radii were also measured\nover time (see Anupama & Kantharia 2005). The expansion velocity of GK Per remained approximately constant\nat ∼ 1100 km s−1 during the first 60 years. The mass contained in its ejected shell is believed to be of the order of\n10−4 M⊙ (Balman & Ögelman 1999; Balman 2005), which is\ncomparable to that of DQ Her. We can thus conclude that\nDQ Her, having a much smaller expansion velocity, should\nbe in a free expansion phase for at least 60 years.\nStudies of the nova shells of V603 Aql, GK Per, V476\nCyg and DQ Her (Duerbeck 1987) have suggested that they\nexperience strong deceleration from their interaction with\nthe ISM, with more rapidly expanding remnants slowing\ndown the fastest. However three out of the four distances\nlisted have since been revised (see Downes & Duerbeck 2000\nfor GK Per and V476 Cyg, and this paper for DQ Her), having a direct impact on the velocity calculations. We also\nnote that the half-lifetime (time after which the expansion velocity has dropped to half its initial value) quoted\ncannot be valid for GK Per and DQ Her. Indeed, from\nAnupama & Kantharia (2005), the initial expansion rate for\nGK Per is measured at ∼ 1150 km s−1 , and after about\n60 years (approximately the half-lifetime quoted), it is still\n∼ 1080 km s−1 , a long way from half its initial value. Similarly in DQ Her where an initial expansion velocity of\n325 km s−1 is quoted, we find 370 km s−1 today. Deceleration\nof expanding nova shells is expected from interaction with\nthe ISM but our results along with Anupama & Kantharia\n(2005) show that it tends to be much less significant than\npreviously anticipated.\n\n\fEvidence for ablated flows in the shell of nova DQ Her\n\n5\n\na\n\n14\nSemi−major axis\n12\n\nSemi−minor axis\n\n−12\n\n8\n\n−13\n\n6\n\n4\n\n2\n\n0\n0\n\n10\n\n20\n30\n40\nTime since outburst (years)\n\n50\n\n60\n\nDistance from centre (arcsec)\n\nSemi−axis size (arcsec)\n\n10\n\nFigure 4. The expansion of the shell of DQ Her as a function\nof time. Here we have added our measurements (last two points\non the major axis curve and the last point on the minor axis\ncurve) to figures found in the literature (Mustel & Boyarchuck\n1970, Williams et al. 1978 and Duerbeck 1987). As indicated, the\nsquares and the dashed straight line fit represent the semi-major\naxis expansion whilst the circles and the solid straight line fit\nrepresent the semi-minor axis evolution.\n\n−14\n\n−15\n\n−16\n\n−17\n\n−280\n\n−260\n\n−240\nVelocity (km/s)\n\n−220\n\nb\nTails\n\nSlavin, O'Brien & Dunlop (1995) were able to remove from\ntheir images the emission components that presented elliptical symmetry in order to discover extended tails. They\nargued that these filaments may originate either from an\ninner fast wind breaking through a clumpy shell or, alternatively, may represent regions which are shadowed by the\ndense clumps from the central photoionising radiation field.\nThese tails are also clearly visible on Fig. 1b, 2 and 3 where\nit is also evident that their velocities increase with distance\nfrom the centre. In the case of tail 1 (see Fig. 1b), we can\nsee that the magnitude of the line of sight velocity of the\ntail increases along its own length. This supports a model\nin which they are formed by wind ablation of clumps by a\nstrong stellar wind. The top central clump in the Hα spectrum of position 2 (Fig. 2a) also exhibits a structure resembling a bow-shock, which would be expected in the case of\na wind flowing past clumps. Velocity profiles for these tails\nwere extracted in order to determine whether the material\nis accelerating linearly or approaching a terminal velocity,\nwhich again would be anticipated in a situation where material is ablated from the clumps and joins the wind stream\nflowing past.\nThe results obtained for tails 1 and 3 are presented in\nFig. 5. This shows that the tails tend to attain a terminal\nvelocity at their tips. The ratio of terminal velocity to wind\nstream velocity depends on the temperature contrast between the ablated and stream gas (Dyson et al. 2006), and it\nis thus not possible here to measure the wind velocity due to\nthe lack of temperature data. The terminal radial velocities\nof tails 1 and 3 were found to be v1 = −280 ± 15 km s−1 and\nv3 = +265 ± 15 km s−1 , respectively. The tails appear to be\nmost clearly visible on the polar ends of the shell and not\n\n−12\n\n−13\n\nDistance from centre (arcsec)\n\n2.2\n\n−14\n\n−15\n\n−16\n\n−17\n\n220\n\n240\n260\nVelocity (km/s)\n\n280\n\nFigure 5. Position-velocity arrays for tails 1 (a) and 3 (b). Line\nof sight velocities (x-axis), which have not been corrected for systemic velocity, are plotted against distance from the central star\n(y-axis). Both tails appear to reach a terminal velocity which is\nbelieved to be close to the projected wind velocity.\n\n\f6\n\nN. M. H. Vaytet, T. J. O'Brien and A. P. Rushton\ny\n\nx\n\n∆x\n\nline of sight\n\nα\n\n∆y\nr\nClump\nVr\nV\n\nFigure 6. Velocity projection along the line of sight for clumps\non the surface of an ellipsoid. The ∆y position of the clumps was\nmeasured on the spectrum. The geometrical ellipse equation of\nthe shell (found from Fig. 1) was then used to calculate the angle\nα. Because the spectra and image were taken only a year apart,\nthe same ellipticity was used proportionally between the datasets\nwhich was a suitable approximation.\n\naround the equator. This would also suggest the presence\nof a stellar wind that is collimated in the polar direction.\nEvidence for the presence of a wind in DQ Her has been discovered by Eracleous et al. (1998) through the study of the\nCiv emission line and Mukai, Still & Ringwald (2003) from\nthe study of scattered X-ray emission. Selvelli & Friedjung\n(2003) also report the presence of a bipolar wind in nova\nHR Del (see however Slavin, O'Brien & Dunlop 1995 whose\ndecomposed image of DQ Her (Fig. 2c) reveals equatorial\ntail features).\nAbsolute velocities for the tails were derived according to the following method. Our assumed geometry is an\nellipsoidal shell with its minor axis along the line of sight\nand its major axis perpendicular to the line of sight (see\nFig. 6), which is the case for DQ Her since i ≈ 90◦ . A clump\nis situated on the surface of the shell lies at an angle α\nfrom the line of sight. A radially expanding tail emanating\nfrom this clump will have absolute velocity v and line of\nsight velocity vr = v cos α. By de-projecting the velocities\nmeasured on Fig. 5 (α = 72◦ ± 3◦ for tails 1 and 3), the\nabsolute terminal velocities of the tails are thus found to\nbe ∼ 800 − 900 km s−1 , which could be close to the wind\nvelocity.\n\n3\n\nDISCUSSION AND CONCLUSIONS\n\nHigh resolution longslit spectroscopy was performed on the\nshell of nova DQ Her, essential to accurately determine the\nexpansion velocity of the remnant. The physical size of the\nellipsoidal shell was then measured by inferring a constant\nequatorial expansion velocity, thus providing an accurate\ndistance through expansion parallax. The size of the shell as\na function of time is consistent with a constant expansion\nrate. The presence of accelerating tails emanating from the\nclumps around the poles of the shell suggests the existence\nof a fast ablating stellar wind collimated in the polar direction, rather than photoionisation-shadowed regions. Shock\n\ninteraction between the clumps and the fast wind could also\nbe an explanation for the localised extended X-ray emission\nregions observed by Mukai, Still & Ringwald (2003).\nWe have considered possible evidence for abnormally\nhigh velocities of clumps close to the poles of the shell\ncompared to that expected for a Hubble expansion. Given\ntheir current positions and velocities, they could have gone\nthrough an early slower velocity phase and were subsequently accelerated, possibly by the fast collimated wind.\nThis could provide an attractive alternative mechanism\nfor nova shell shaping (see Lloyd, O'Brien & Bode 1997;\nPorter, O'Brien & Bode 1998 who consider the effects of a\nrotating WD envelope in the creation of prolate ellipsoidal\nshells). However, the high uncertainties on the velocities and\npositions of the clumps (mostly due to projection effects)\nalong with the assumption of axisymmetry prevent us from\npresenting these results as firm conclusions.\nSome aspects of the shell are still to be explained, such\nas the pinch observed at the equator and the [Nii]-enhanced\nequatorial ring. As opposed to the tails discussed above,\nemission extending inside the shell is also visible on Fig. 3.\nThese inner clumps can clearly be seen in the spectra (Figs. 1\nand 2), the most prominent example being the top clump on\nFig. 2b. Due to their position in the spectra, these clumps\nare either situated on the surface of the shell but have an\nabnormally low velocity, or are actually inside the shell,\nwhich is far more likely. The origin of such inner clumps\nand whether they are only located close to the poles or filling the whole shell volume is not clear.\n\nACKNOWLEDGEMENTS\nNMHV is supported by a University of Manchester research\nstudentship and APR by a PPARC research studentship.\nWe would like to thank Deborah Mitchell for help with the\ndata reduction and sensible comments on the writing of this\npaper, and Chris Gill for his preliminary work on DQ Her in\nhis PhD thesis (Gill 1999). WHT image of DQ Her (Fig. 1a)\ntaken by Vik Dhillon, University of Sheffield.\n\nREFERENCES\nAnupama, G. C., Kantharia, N. G. 2005, A&A, 435, 167\nBalman, Ş 2005, ApJ, 627, 933\nBalman, Ş, Ögelman, H. B. 1999, ApJL, 518, L111\nBeer, A. 1974, Vistas Astr., 16, 179\nCampbell, L. 1935, Harvard College Observatory Bulletin,\n898, 20\nDownes, R. A., Duerbeck, H. W. 2000, AJ, 120, 2007\nDuerbeck, H. W., Ap&SS, 131, 461\nDyson, J. E., Pittard, J. M., Meaburn, J., Falle, S. A. E.\nG. 2006, A&A, 457, 561\nEracleous, M., Livio, M., Williams, R. E., Horne, K., Patterson, J., Martell, P., Korista, K. T., 1998, ASP Conf.\nSeries, 137, 438\nGaposchkin, S. 1956, AJ, 61, 36\nGill, C. D., 1999, PhD Thesis, Liverpool John Moores University\nGill, C. D., O'Brien, T. J., 2000, MNRAS, 314, 175\nHerbig, G. H., Smak, J. I., 1992, Acta Astronomica, 42, 17\n\n\fEvidence for ablated flows in the shell of nova DQ Her\nHorne, K., Welsh, W. F., Wade, R. A. 1993, ApJ, 410, 357\nKnigge, C., Drew, J. E., 1996, MNRAS, 281, 1352\nLloyd, H. M., Bode, M. F., O'Brien, T. J., Kahn, F. D.,\n1993, MNRAS, 265, 457\nLloyd, H. M., O'Brien, T. J., Bode, M. F. 1997, MNRAS,\n284, 137\nMartin, P. G., 1989, in Bode, M. F., Evans, A. eds, Classical\nNovae, Wiley & Sons Ltd, Chichester, p.93\nMukai, K., Still, M., Ringwald, F. A. 2003, ApJ, 594, 428\nMustel, E. R., Boyarchuk, A. A., 1970, Astrophysics and\nSpace Science, 4, 183\nPatterson, J. 1994, PASP, 106, 209\nPetitjean, P., Boisson, C., Pequignot, D., 1990, A&A, 240,\n433\nPorter, J. M., O'Brien, T. J., Bode, M. F., 1998, MNRAS,\n296, 943\nSelvelli, P., Friedjung, M. 2003 A&A, 401, 297\nShlosman, I., Vitello, P., 1993, ApJ, 409, 372\nSlavin, A. J., O'Brien, T. J., Dunlop, J. S., 1995, MNRAS,\n276, 353\nStarrfield, S. 1989, Classical Novae, eds Bode M. F. &\nEvans A., Wiley, Chichester, p39\nWalker, M. F., 1956, ApJ, 123, 68\nWilliams, R. E., Woolf, N. J., Hege, E. K., Moore, R. L.,\nKopriva, D. A., 1978, ApJ, 224, 171\nWood, M. A., Simpson, J. C., Kawaler, S. D., O'Brien,\nM. S., Nather, R. E., Metcalfe, T. S., Winget, D. E.,\nMontgomery, M., Jiang, X. J., Leibowitz, E. M., Ibbetson,\nP., O'Donoghue, D., Krzesinski, J., Pajdosz, G., Zola, S.,\nVauclair, G., Dolez, N., Chevreton, M., 2000, Baltic Astronomy, 9, 211\nYoung P., Schneider D. P., 1981, ApJ, 247, 960\n\n7\n\n\f"}