{"id": "http://arxiv.org/abs/0804.2924v1", "guidislink": true, "updated": "2008-04-18T01:40:11Z", "updated_parsed": [2008, 4, 18, 1, 40, 11, 4, 109, 0], "published": "2008-04-18T01:40:11Z", "published_parsed": [2008, 4, 18, 1, 40, 11, 4, 109, 0], "title": "The Exceptionally Large Debris Disk around γOphiuchi", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0804.2705%2C0804.4218%2C0804.3243%2C0804.4835%2C0804.2851%2C0804.4134%2C0804.2526%2C0804.2670%2C0804.4087%2C0804.3352%2C0804.4718%2C0804.1027%2C0804.2187%2C0804.0509%2C0804.1784%2C0804.3249%2C0804.4135%2C0804.2248%2C0804.2487%2C0804.2038%2C0804.2924%2C0804.3706%2C0804.4595%2C0804.1639%2C0804.0858%2C0804.2548%2C0804.3930%2C0804.2325%2C0804.4076%2C0804.2954%2C0804.2456%2C0804.4126%2C0804.3673%2C0804.4616%2C0804.2799%2C0804.0605%2C0804.1158%2C0804.1409%2C0804.4816%2C0804.3626%2C0804.3608%2C0804.0316%2C0804.3295%2C0804.4195%2C0804.0352%2C0804.2595%2C0804.0670%2C0804.2510%2C0804.3918%2C0804.0676%2C0804.1478%2C0804.2886%2C0804.3682%2C0804.1059%2C0804.4690%2C0804.4006%2C0804.4477%2C0804.3841%2C0804.1646%2C0804.4878%2C0804.0193%2C0804.3843%2C0804.4698%2C0804.2387%2C0804.2517%2C0804.0723%2C0804.0819%2C0804.1863%2C0804.3819%2C0804.3691%2C0804.3053%2C0804.3195%2C0804.3845%2C0804.1213%2C0804.3595%2C0804.4694%2C0804.2263%2C0804.2078%2C0804.3230%2C0804.0750%2C0804.0807%2C0804.3272%2C0804.0995%2C0804.2266%2C0804.1215%2C0804.2855%2C0804.2734%2C0804.2785%2C0804.3537%2C0804.2945%2C0804.0155%2C0804.0814%2C0804.2574%2C0804.1907%2C0804.0687%2C0804.1879%2C0804.2498%2C0804.4342%2C0804.2182%2C0804.1266%2C0804.1978&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "The Exceptionally Large Debris Disk around γOphiuchi"}, "summary": "Spitzer images resolve the debris disk around \\gamma Ophiuchi at both 24 and\n70 um. The resolved images suggest a disk radius of ~520 AU at 70 um and >=260\nAU at 24 um. The images, along with a consistent fit to the spectral energy\ndistribution of the disk from 20 to 350 um, show that the primary disk\nstructure is inclined by ~50 degree from the plane of the sky at a position\nangle of 55+/-2 degree. Among a group of twelve debris disks that have similar\nhost star spectral types, ages and infrared fractional luminosities, the\nobserved sizes in the infrared and color temperatures indicate that evolution\nof the debris disks is influenced by multiple parameters in addition to the\nproto-planetary disk initial mass.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0804.2705%2C0804.4218%2C0804.3243%2C0804.4835%2C0804.2851%2C0804.4134%2C0804.2526%2C0804.2670%2C0804.4087%2C0804.3352%2C0804.4718%2C0804.1027%2C0804.2187%2C0804.0509%2C0804.1784%2C0804.3249%2C0804.4135%2C0804.2248%2C0804.2487%2C0804.2038%2C0804.2924%2C0804.3706%2C0804.4595%2C0804.1639%2C0804.0858%2C0804.2548%2C0804.3930%2C0804.2325%2C0804.4076%2C0804.2954%2C0804.2456%2C0804.4126%2C0804.3673%2C0804.4616%2C0804.2799%2C0804.0605%2C0804.1158%2C0804.1409%2C0804.4816%2C0804.3626%2C0804.3608%2C0804.0316%2C0804.3295%2C0804.4195%2C0804.0352%2C0804.2595%2C0804.0670%2C0804.2510%2C0804.3918%2C0804.0676%2C0804.1478%2C0804.2886%2C0804.3682%2C0804.1059%2C0804.4690%2C0804.4006%2C0804.4477%2C0804.3841%2C0804.1646%2C0804.4878%2C0804.0193%2C0804.3843%2C0804.4698%2C0804.2387%2C0804.2517%2C0804.0723%2C0804.0819%2C0804.1863%2C0804.3819%2C0804.3691%2C0804.3053%2C0804.3195%2C0804.3845%2C0804.1213%2C0804.3595%2C0804.4694%2C0804.2263%2C0804.2078%2C0804.3230%2C0804.0750%2C0804.0807%2C0804.3272%2C0804.0995%2C0804.2266%2C0804.1215%2C0804.2855%2C0804.2734%2C0804.2785%2C0804.3537%2C0804.2945%2C0804.0155%2C0804.0814%2C0804.2574%2C0804.1907%2C0804.0687%2C0804.1879%2C0804.2498%2C0804.4342%2C0804.2182%2C0804.1266%2C0804.1978&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Spitzer images resolve the debris disk around \\gamma Ophiuchi at both 24 and\n70 um. The resolved images suggest a disk radius of ~520 AU at 70 um and >=260\nAU at 24 um. The images, along with a consistent fit to the spectral energy\ndistribution of the disk from 20 to 350 um, show that the primary disk\nstructure is inclined by ~50 degree from the plane of the sky at a position\nangle of 55+/-2 degree. Among a group of twelve debris disks that have similar\nhost star spectral types, ages and infrared fractional luminosities, the\nobserved sizes in the infrared and color temperatures indicate that evolution\nof the debris disks is influenced by multiple parameters in addition to the\nproto-planetary disk initial mass."}, "authors": ["K. Y. L. Su", "G. H. Rieke", "K. R. Stapelfeldt", "P. S. Smith", "G. Bryden", "C. H. Chen", "D. E. Trilling"], "author_detail": {"name": "D. E. Trilling"}, "author": "D. E. Trilling", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1086/589508", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/0804.2924v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0804.2924v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "Accepted to ApJ Letters", "arxiv_primary_category": {"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0804.2924v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0804.2924v1", "journal_reference": null, "doi": "10.1086/589508", "fulltext": "A CCEPTED FOR PUBLICATION IN A P JL\nPreprint typeset using LATEX style emulateapj v. 2/19/04\n\nTHE EXCEPTIONALLY LARGE DEBRIS DISK AROUND γ OPHIUCHI\n1\n\nK. Y. L. S U , G. H. R IEKE 1 , K. R. S TAPELFELDT 2, P. S. S MITH 1 , G. B RYDEN 2 , C. H. C HEN 3 , D. E. T RILLING 1\n\narXiv:0804.2924v1 [astro-ph] 18 Apr 2008\n\nAccepted for publication in ApJL\n\nABSTRACT\nSpitzer images resolve the debris disk around γ Ophiuchi at both 24 and 70 μm. The resolved images suggest a disk radius\nof ∼520 AU at 70 μm and &260 AU at 24 μm. The images, along with a consistent fit to the spectral energy distribution of\nthe disk from 20 to 350 μm, show that the primary disk structure is inclined by ∼50◦ from the plane of the sky at a position\nangle of 55◦ ±2◦ . Among a group of twelve debris disks that have similar host star spectral types, ages and infrared fractional\nluminosities, the observed sizes in the infrared and color temperatures indicate that evolution of the debris disks is influenced by\nmultiple parameters in addition to the proto-planetary disk initial mass.\nSubject headings: circumstellar matter – infrared: stars – planetary systems – stars: individual (γ Oph)\n1. INTRODUCTION\n\nPlanetary debris disks are one of the best means to explore the evolution of planetary systems. The Spitzer mission\nhas made fundamental contributions to our understanding of\nthem, including documenting the wide variety in properties\nsuch as amounts of excess emission, disk size and grain properties derived from mineralogical features (Rieke et al. 2005,\nSu et al. 2006, Trilling et al. 2008, Chen et al. 2006). Two\npossibilities for this variety are: 1.) disks share a similar evolution, but with a wide range of initial masses (e.g., Wyatt et\nal. 2007b; Kenyon & Bromley 2008); and 2.) there are substantial evolutionary differences such as large collisions that\ndominate the amount of debris for a period of time (Wyatt et\nal. 2007a). There may also be a mixture of these possibilities\n(Rieke et al. 2005; Wyatt et al. 2007b). In any case, understanding debris disks requires determination of their range of\nbehavior where critical boundary conditions that might influence these systems are held fixed.\nHere we report a detailed study of the debris disk around\nγ Ophiuchi, a 184 Myr-old A0 V star (Song et al. 2001, Rieke\net al. 2005) at a distance of 29.1±0.8 pc with an infrared excess detected in the IRAS point-source catalog (Sadakane &\nNishida 1986). Fajardo-Acosta et al. (1997) report marginal\nevidence that γ Oph is extended at 60 μm. In this paper,\nwe describe imaging with Spitzer that confirms this result by\nclearly resolving the disk at both 24 and 70 μm. Although the\nradii of other resolved disks (e.g., Fomalhaut) are typically\nonly about 150 AU, we find that the γ Oph disk is almost\nfour times as large. We combine this size measurement with\nthe detailed spectral energy distribution (SED) of the disk to\nderive its properties, and compare them to those of a small\nsample of debris disks with similar host stars.\n2. OBSERVATIONS AND DATA REDUCTION\n\nThe observations presented here are from various Spitzer\nprograms. The IRS spectrum of γ Oph was previously published based on an older pipeline reduction (S11) by Chen\net al. (2006). Here we present the S15 reduction with updated flux non-linearity corrections. Observations at 24 μm\nwere obtained at two epochs in standard small-field photometry mode using 3 sec×4 cycles at 5 sub-pixel-offset positions,\n1\n\nSteward Observatory, University of Arizona, 933 N Cherry Ave., Tucson,\nAZ 85721; ksu@as.arizona.edu\n2 JPL/Caltech, 4800 Oak Grove Drive, Pasadena, CA 91109\n3 Spitzer Fellow; NOAO, Tucson, AZ 85726\n\nresulting in a total integration of 840 sec on source for each\nepoch. The observation at 70 μm was done in fine-scale mode\nwith 3 sec×1 cycle at 4 sub-pixel-offset positions, resulting\nin a total integration of ∼100 sec on source. A MIPS SEDmode observation was obtained with 10 sec×10 cycles, and a\n1′ chop distance for background subtraction.\nAll of the MIPS data were processed using the Data Analysis Tool (Gordon et al. 2005) for basic reduction (e.g., dark\nsubtraction, flat fielding/illumination corrections), with additional processing to minimize artifacts (see Engelbracht et\nal. 2007). For the 70 μm fine-scale data, each of the on-source\nexposures was subtracted from an average background composed of before and after off-source exposures to remove the\ntime-dependent column offsets in the background. The final\nmosaics were combined with pixels half the size of the physical pixel scale (Figure 1). The MIPS SED-mode data were\nreduced and calibrated as described by Lu et al. (2008).\nAt 24 μm, the non-color-corrected measurement gives\n434±3 mJy using an aperture radius of 15′′ with a background\nannulus of 30′′ –42′′ , and an aperture correction of 1.143. The\nexpected photospheric flux density in the 24 μm band is 236\nmJy, resulting in a 24 μm infrared excess of 202 mJy after a\ncolor correction of 1.021 (for a blackbody temperature of 80\nK, which is the characteristic color temperature of the disk\n(see §3.2)). The total color-corrected flux density in the 24\nμm band is 438±18 mJy, including the uncertainty in the calibration factor of 0.0454 MJy sr−1 (DN s−1 )−1 (Engelbracht et\nal. 2007). For the 70 μm fine-mode photometry, we use an\naperture with a radius of 16′′ , sky annulus of 18′′ –39′′ , and an\naperture correction of 1.9. A total flux density of 1140 mJy\nwas estimated using a flux calibration factor of 2894 MJy sr−1\nMIPS70F−1 (Gordon et al. 2007). The expected photospheric\nflux density in the 70 μm band is 26 mJy; therefore, the disk\nflux density is 1185 mJy after a color correction of 1.064 (for\na blackbody temperature of 80K). The total color-corrected\nflux density in the 70 μm band is 1211±121 mJy. All available photometry and spectra of γ Oph are shown in the SED\nplot in Figure 2.\n3. ANALYSIS\n3.1. PSF Subtraction\n\nThe excess emission at 24 μm is roughly equal in brightness to the expected photospheric value and yet the source\nappears point-like at 24 μm. To reveal the disk, the Point\nSpread Function (PSF) must be subtracted. We used deep ob-\n\n\f2\n\nF IG . 2.- Spectral Energy Distribution (SED) of γ Oph. The photometry\nof 80±20 mJy at 350 μm is obtained with the Caltech Submillimeter Observatory (Dowell et al. in prep.). The optical and near-infrared photometry\nis from the Simbad database and 2MASS catalog, while the other symbols\nare defined on the plot. The dotted-dashed line is the output SED using the\nbest-fit parameters.\n\nF IG . 3.- The excess SED of the γ Oph disk. Symbols and lines are the\nsame as in Figure 2 except for the stars showing the ten photometric points\nused for χ2 fitting. Two single component models are shown (p=0 with grains\nof 5–63 μm and χ2 =0.8, and p=1 with grains 1.6-100 μm and χ2 =10.4). As\nan illustration, the total SED of a three-component (not unique) disk model\nwith χ2 =0.7 is shown along with the SED of each component.\n\nservations of the non-excess A4 V star τ3 Eri4 to determine the\nPSF. At 24 μm, the Full-Width-Half-Maximum (FWHM24 ) of\nthe τ3 Eri image is 5.′′ 52×5.′′48 using a 2-D Gaussian fitting\nfunction on a field of 26′′ with an uncertainty of 0.′′ 02×0.′′02\nbased on ∼100 calibration star observations. The τ3 Eri image\nwas scaled to the expected photospheric flux density of γ Oph\nand to 1.6 times this value for PSF subtraction. The higher\nvalue (over-subtraction) allows for the possibility of a significant portion of the excess emission lying close to the star as\nin Fomalhaut (Stapelfeldt et al. 2004). The results of the PSF\nsubtractions are shown in Figure 1. An elliptical outer disk\nalong the position angle of ∼56◦ is seen in the over-subtracted\nimage, while the photospheric-subtracted image confirms that\nmuch of the disk emission lies within the PSF. The disk is at\nleast 9′′ (∼260 AU) in radius at 24 μm.\nTo test for any color dependence in this process, we subtracted the image of τ3 Eri from the image of ζ Lep, a debris disk known to be largely confined to within 3 AU (0.′′ 14)\nradius at 20 μm (Moerchen et al. 2007), with various scaling factors. There are no disk-like residuals in the subtracted\nimage. The FWHM24 of the photosphere-subtracted ζ Lep\nimage (5.′′ 61×5.′′55) gives a characteristic resolution for a\nred point source, slightly broader than given by a blue PSF\n(τ3 Eri). The FWHM24 of γ Oph before photospheric subtraction is 5.′′ 84×5.′′61, which is only 1.06×1.03 broader than a\nblue PSF. However, this difference is significant at 16-σ compared to a blue PSF and 11-σ to a red PSF. The FWHM24 of\nthe γ Oph disk after photospheric subtraction is 6.′′ 41×5.′′75,\nwhich is 1.14×1.03 broader than a red PSF represented by the\nunresolved core of the ζ Lep disk.\nThe source appears slightly elongated at 70 μm (Figure 1c).\nNo photospheric subtraction is needed because the disk is\n∼50 times brighter than the stellar photosphere. However, the\nfaint extended disk emission is more evident after the subtraction of a PSF representing the bright inner disk (Figure 1d).\nThe faint extended emission can be traced up to ∼18′′ (∼520\nAU, at 3-σ level) in radius along the position angle of ∼55◦.\nThe disk has a FWHM70F of 18.′′ 5×16.′′1 determined using a\nGaussian fitting on a field of 55′′ . Examining two blue calibration stars (HD 48348 and HD 48915), a typical FWHM70F\n\nof 15.′′ 3×14.′′4 with an uncertainty of 0.′′ 2×0.′′06 was determined, suggesting that the γ Oph image core at 70 μm is\n1.2×1.1 times wider than a blue PSF, and resolved at 16- and\n28-σ levels for the major and minor axises. The position angle of the disk determined from both 24 and 70 μm images is\n55◦ ±2◦ . The MIPS slit (width of 19.′′ 8) was at the position\nangle of ∼95◦ when the SED-mode observation was taken. A\nsmall fraction of the faint extended disk emission was outside\nthe slit, which may explain the slightly lower (∼5%) SEDmode flux compared to the fine-mode photometry.\n\n4 MIPS 24 μm measurement (247±3 mJy) and an updated IRS spectrum\nshow no excess in this source.\n\n3.2. Spectral Energy Distribution Fitting\n\nThe broadband excess photometry at 24 and 70 μm indicates a color temperature (Tc ) of 81 K, which over predicts the\nobserved flux at 28–35 μm and 55–65 μm (see Figure 2). This\nsuggests that the dust grains in the system have a wider range\nof temperatures. To model the disk SED (Figure 3), we use\na simple geometrically-thin debris disk model where the central star is the only heating source and the dust is distributed\nradially between inner (Rin ) and outer (Rout ) radii according\nto a r−p power law for the surface number density. The grains\nin the disk follow a n(a) ∼ a−q size distribution with a minimum radius of amin and a maximum radius of amax , assumed\nto be the same throughout the disk. To minimize the free parameters, we assume that the grains are astronomical silicates\n(Laor & Draine 1993) with a density of 2.5 g cm−3 and are in\ntheoretical collisional equilibrium; i.e. q = −3.5.\nWe determined the best-fit Kurucz model for the stellar photosphere by fitting the optical to near-IR photometry (Su et\nal. 2006), and estimated the stellar temperature and luminosity to be 9750 K and 28.6 L⊙ . With these stellar parameters, grains smaller than ∼5 μm are subject to radiation pressure blowout since β, the ratio between radiation and gravitational forces (Burns et al. 1979), is > 0.5. To capture the\nslope of the IRS spectrum and MIPS SED-mode data, we selected two points (26.5 and 30 μm) in the IRS spectrum and\nfour wavelengths (55.4, 65.6, 75.8, and 86.0 μm) in the MIPS\nSED-mode data for the global SED fitting. Combined with\nthe broadband photometry, a total of ten data points shown\nas stars in Figure 3 are used to compute χ2 to determine the\nbest-fit debris disk model.\nTo fit the fairly flat slope between 55 and 95 μm and the\n\n\f3\n\nF IG . 4.- Comparison cuts along the disk major axis at 24 μm (upper panel)\nand 70 μm (lower panel). The cuts at 24 μm are averaged over a width of\n5′′ , and a width of 10.′′ 5 at 70 μm. A dotted line in each panel indicates a\nnominal 1-σ detection on the image.\n\nobserved flux at 350 μm simultaneously, the maximum grain\nsize has to be <100 μm. This might be an artifact of the\nassumption that the grains have the same size distribution\nthroughout the disk (see §4). In addition, since there are no\nobvious silicate features, the majority of the grains in the disk\nare larger than a few microns. Therefore, we assume amin to be\nthe blowout size, ∼5 μm, and amax to be ∼63 μm, and that the\ndisk has a constant surface density consistent with a PoyntingRobertson (P-R) drag dominated disk. With these grain properties and density distribution, the SED is consistent with a\n1-component disk with an inner radius of 13+4\n−3 AU and outer\nradius of 430+130\n−30 AU. However, a P-R drag dominated disk\nis not expected physically given the high disk density (fractional luminosity fd ∼9×10−5) since collisions should destroy\ngrains before they can spiral inward (Wyatt 2005).\nWe also explored the possibility of fitting the SED with an\noutflow disk, in which the majority of the grains are smaller\nthan the blowout size and the surface density follows a r−1\npower law (e.g., the Vega debris disk; Su et al. 2005). Various\ncombinations of amin , amax , Rin and Rout were tried, and none\nyield a correct spectral slope between 20–30 μm (one example\nis shown in Figure 3). In addition, because smaller grains\nhave higher temperatures than larger ones at the same radius,\nmodels including grains smaller than the blowout size force\nRin to be a large distance (∼100 AU=3.′′ 4), contradicting the\nobserved compact core of the disk. This suggests that the\nγ Oph system cannot be an outflow disk entirely.\n3.3. Debris Disk Imaging Fitting\n\nLimited by the spatial resolutions, no multiple disk components can be distinguished in the observed images except\nfor the extent of the disk. To further constrain the model,\nwe constructed model images with the best-fit SED param-\n\neters (p=0, amin ∼5 μm, amax ∼63 μm, Rin =13+4\n−3 AU, and\nRout =430+130\n−30 AU) from the SED fitting. These model images\nwere then convolved with appropriate PSFs to compare with\nthe observed images based on the FWHMs and radial surface\nbrightness distributions.\nFor a geometrically thin disk model, the observed disk morphology only depends on how the disk is viewed, i.e., the inclination angle of the disk with respect to the plane of the sky,\ni. We first explored the influence of the outer radius by fixing\nRin =13 AU, the grain parameters and i=90◦ . The FWHM24\nof the convolved model images with outer radii ranging from\n350 to 1000 AU shows no change, but a major-axis FWHM70F\nof the convolved model images varies from 17.′′ 0 to 20.′′ 4 with\nthe minor-axis FWHM70F of 14.′′ 2. This again confirms that\nthe 24 μm emission arises from warm grains that are not sensitive to the outer extent of the disk. The observed majoraxis FWHM70F of the disk (18.′′ 5) implies a Rout of ∼520\nAU. With the Rin , Rout and grain parameters fixed, we determined the inclination angle by fitting both major- and minoraxis FWHMs. Convolved model images were constructed for\nface-on (i=0◦ ) to edge-on (i=90◦ ) disks in increments of 5◦ .\nThe major-axis FWHMs of the model images remain the same\nwithin measurement errors at both 24 and 70 μm. From 0◦ to\n90◦ , the minor-axis FWHM24 and FWHM70F changed from\n6.′′ 1 to 5.′′ 6 and 17.′′ 6 to 14.′′ 2, respectively. We conclude that\nthe observed FWHMs at 24 and 70 μm are consistent with a\ndisk viewed at i=50◦ ±5◦ .\nFor a quantitative comparison, we show cuts along the disk\nmajor axis for both the observed and best-fit model images at\n24 and 70 μm in Figure 4. Similar cuts made on point-source\nPSFs, scaled to match the peak values of the observations,\nare also shown. Our simple 1-component, bound-grain debris\ndisk model is in very good agreement with the observed disk\nsurface brightness at 24 μm over a dynamic range of two orders of magnitude. At 70 μm, the observed signal-to-noise\nratios are not as good as at 24 μm, but the model agrees to\nwithin the estimated uncertainties and approximates the data\nmuch better than a point source.\n4. DISCUSSION AND SUMMARY\n\nBased on the Spitzer images and SED modeling, the disk\naround γ Oph has inner and outer boundaries of ∼13 and\n∼520 AU, respectively, viewed at an inclination angle of\n∼50◦, assuming a 1-component constant-surface (p=0) density disk consisting of bound (5–63 μm) astronomical silicate\ngrains. The dust mass is ∼1.0×10−2 M⊕ . The star's projected\nrotation velocity is 210 km s−1 (Royer et al. 2007), suggesting an equatorial velocity of 256-300 km s−1 with i ranging\nfrom 55◦ to 45◦ . Although these values are very close to the\nmaximum permissible velocity (Gulliver et al. 1994), the estimated disk inclination angle is within the permitted range of\nplausible stellar inclination angles.\nThe broadband SED alone provides too little information to\nconstrain properly the variables needed for even the simplest\ndisk models, but a better understanding can be achieved by\nconsidering other constraints. The exact Rin of the disk is\nsensitive to amin used in the model. The fact that the excess\nemission starts at .15 μm suggests that dust exists as close\nas ∼10 AU, assuming blackbody radiators. Since the grains\nin a debris disk are generated by collisional cascades from\nlarge (∼km-size) parent bodies, amax is usually assumed to be\n∼1000 μm. To make the single component model consistent\nwith the faint extended disk detected at 70 μm and with the\nassumed grain size distribution, amax has to be reduced to ∼63\n\n\f4\nμm. A more physically realistic model will involve multiple\ncomponents while requiring the presence of very large grains\nin the disk.\nWe used a three-component disk to derive a model consistent with the expected grain physics and the observed\nspectrum/SED. The three components are: (1) a narrow\n(δR∼0.1R) ring of parent bodies at ∼80 AU where large\ngrains are located; (2) an outflow disk (80–520 AU) with\ndensity ∝ r−1 outside the narrow ring consisting of grains being ejected by radiation pressure with sizes smaller than the\nblowout size; (3) a component with density ∝ r0 interior to\nthe narrow ring and extending to ∼10 AU (e.g., as of grains\nslowly drifting inward due to P-R drag). Many combinations\nof parameters in this three-component disk model would yield\nacceptable fits to the observed data. One example is shown in\nFigure 3, but it is not unique without further constraints.\nGiven the exceptionally large disk seen in the γ Oph images, one may wonder whether it is another Vega-like disk\n(an outflow disk observed at 24 and 70 μm extending from a\nring of large parent bodies that dominate the emission at 850\nμm, Su et al. 2005). The failure to fit all of the available data\nwith our simple 1-component outflow model suggests that the\ncontribution by grains escaping from the γ Oph disk is weak,\nunlike for the Vega disk where such grains dominate the disk\nemission (∼100% at 24 μm and ∼75% at 70 μm). Persuasive evidence of γ Oph being another Vega-like disk would\nrequire the disk size at 350 μm to be substantially smaller\nthan the size inferred in the infrared. However, the signal-tonoise of the 350 μm data is too low to show the extent of the\nemission. Observations at longer submillimeter or millimeter\nwavelengths and higher spatial resolution are needed to determine the exact location and amount of the cold component.\nAn attractive comparison sample of debris disks for γ Oph\nis defined by systems with stellar ages between 150 and 400\nMyr, spectral types between A0V and A3V, and fd between\n10−5 and 10−4 , for which Su et al. (2006) find a total of 12\nstars5 including the resolved disks around Vega and Fomalhaut. The disk around Fomalhaut defines the expected template structure given our knowledge of the solar system. It\nconsists of two separate dust belts: a Kuiper-Belt-analog ring\n5 Besides γ Oph, Vega and Fomalhaut: ι Cen: T ∼250 K, ζ Lep: T ∼206\nc\nc\nK, α CrB: Tc ∼125 K, β UMa: Tc ∼116 K, 30 Mon: Tc ∼105 K, HD 38056:\n\nwith a radius of ∼150 AU prominent at λ &70 μm and a\nfair amount of zodiacal-analog warm dust located <20 AU\nfrom the star. Little emission originates from outside of the\nKuiper Belt ring. In the Fomalhaut disk, the ratio between\nthe central unresolved and the extended emission is 3–6 at\n24 μm (Stapelfeldt et al. 2004), while the ratio is ∼2–3 in\nthe γ Oph disk. The Kuiper-Belt-analog ring in the Fomalhaut system totally dominates the emission at 70 μm, but at\nthe distance of γ Oph (∼4× that of Fomalhaut), such a ring\nwould be unresolved.\nTwo of the twelve systems (ζ Lep and ι Cen) have 24 to\n70 μm color temperatures > 200 K (Su et al. 2006). Groundbased 20 μm imaging of ζ Lep shows it to be dominated by a\nvery compact inner warm disk (Moerchen et al. 2007). Three\nmore systems (30 Mon, β UMa, α CrB) have color temperatures of 100–150 K, indicating relatively large amounts of\nmaterial in their inner zones. All of these systems are likely\nto have more debris-generating activity close to the star than\nthe disks around Fomalhaut (color temperature of 70 K) or\nγ Oph. Of the remaining seven systems, at least two have\nanomalous activity in their outer zones: Vega with its large\n(∼800 AU) halo, and γ Oph with a disk ∼520 AU in radius.\nIt appears that much of the overall debris disk behavior can\nbe explained as the result of similar evolution from starting\npoints that differ in the initial disk mass (Wyatt et al. 2007b).\nHowever, the large variety in behavior among the sample of\ntwelve middle-aged disks demonstrates that one or more additional parameters must also be at play. For instance, the presence and number of massive planets, the recent collisional history of the system (Kenyon & Bromley 2005, 2006), as well\nas the variety in the initial disk size may all play important\nroles in the wealth of disk behavior.\n\nBased on observations made with the Spitzer Space Telescope, which is operated by the Jet Propulsion Laboratory,\nCalifornia Institute of Technology. Support for this work was\nprovided by NASA through contract 1255094 and 1256424\nissued by JPL/Caltech to the University of Arizona.\nTc ∼96 K, HD 79108 : Tc ∼88 K, λ Boo: Tc ∼86 K, γ Tri: Tc ∼75 K.\n\nREFERENCES\nBurns, J. A., Lamy, P. L., & Soter, S. 1979, Icarus, 40, 1\nChen, C. H., et al. 2006, ApJS, 166, 351\nEngelbracht, C. W., et al. 2007, PASP,119, 994\nFajardo-Acosta, S. B., Stencel, R. E., & Backman, D. E. 1997, ApJ, 487,\nL151\nGulliver, A. F., Hill, G., & Adelman, S. J. 1994, ApJ, 429, L81\nGordon, K. D., et al. 2005, PASP, 117, 503\nGordon, K. D., et al. 2007, PASP, 119, 1019\nKenyon, S. J., & Bromley, B. C. 2005, AJ, 130, 269\nKenyon, S. J., & Bromley, B. C. 2006, AJ, 131, 1837\nKenyon, S. J & Bromley, B. C., 2008, submitted.\nLaor, A. & Draine, B. T. 1993, ApJ, 402, 441\nLu, N., et al. 2008, astro-ph 0802.3723\nMoerchen, M. M., Telesco, C. M., Packham, C., & Kehoe, T. J. J. 2007, ApJ,\n655, L109\nRieke, G. H., et al. 2005, ApJ, 620, 1010\n\nRoyer, F., Zorec, J., & Gómez, A. E. 2007, A&A, 463, 671\nSadakane, K., & Nishida, M. 1986, PASP, 98, 685\nSong, I., Caillault, J.-P., Barrado Y Navascués, D., & Stauffer, J. R. 2001,\nApJ, 546, 352\nStapelfeldt, K. R., et al. 2004, ApJS, 154, 458\nSu, K. Y. L., et al. 2005, ApJ, 628, 487\nSu, K. Y. L., et al. 2006, ApJ, 653, 675\nTrilling, D. E., et al. 2008, ApJ, 674, 1086\nWyatt, M. C. 2005, A&A, 433, 1007\nWyatt, M. C., Smith, R., Greaves, J. S., Beichman, C. A., Bryden, G., & Lisse,\nC. M. 2007a, ApJ, 658, 569\nWyatt, M. C., Smith, R., Su, K. Y. L., Rieke, G. H., Greaves, J. S., Beichman,\nC. A., & Bryden, G. 2007b, ApJ, 663, 365\n\n\f5\n\nF IG . 1.- MIPS 24 and 70 μm images of γ Oph with colorbars showing the surface brightness levels between the 1-σ detection and the peak value of the image.\n(a) shows the deep 24 μm image of γ Oph after photospheric PSF subtraction. (b) shows the over-subtracted image of γ Oph at 24 μm, where an elliptical disk\nis evident. (c) shows the disk image at 70 μm. (d) shows the over-subtracted image at 70 μm after applying boxcar smoothing. The contours show the detection\nboundaries at 1-, 3- and 5-σ levels; 1-σ =0.126 mJy arcsec−2 . All panels have the same orientation with N up and E to the left. A circle at the corner of each\npanel indicates the typical resolution.\n\n\f"}