{"id": "http://arxiv.org/abs/1010.2509v1", "guidislink": true, "updated": "2010-10-12T20:29:33Z", "updated_parsed": [2010, 10, 12, 20, 29, 33, 1, 285, 0], "published": "2010-10-12T20:29:33Z", "published_parsed": [2010, 10, 12, 20, 29, 33, 1, 285, 0], "title": "Differential Rotation and Magnetism in Simulations of Fully Convective\n  Stars", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1010.2987%2C1010.4964%2C1010.1470%2C1010.1752%2C1010.2279%2C1010.0633%2C1010.5168%2C1010.4659%2C1010.4392%2C1010.0243%2C1010.5008%2C1010.2331%2C1010.1564%2C1010.3764%2C1010.0944%2C1010.4594%2C1010.5326%2C1010.3549%2C1010.1193%2C1010.4854%2C1010.0816%2C1010.4473%2C1010.4812%2C1010.1260%2C1010.4882%2C1010.0888%2C1010.1323%2C1010.6187%2C1010.3063%2C1010.2856%2C1010.6189%2C1010.3235%2C1010.4478%2C1010.1722%2C1010.5023%2C1010.3334%2C1010.5219%2C1010.1743%2C1010.2181%2C1010.3499%2C1010.3318%2C1010.3228%2C1010.4969%2C1010.3632%2C1010.0508%2C1010.3802%2C1010.4208%2C1010.3663%2C1010.0719%2C1010.5004%2C1010.5276%2C1010.2899%2C1010.2474%2C1010.1251%2C1010.1936%2C1010.6060%2C1010.0649%2C1010.6151%2C1010.5050%2C1010.2642%2C1010.4237%2C1010.2015%2C1010.0585%2C1010.6054%2C1010.5294%2C1010.3454%2C1010.2232%2C1010.3346%2C1010.2670%2C1010.5230%2C1010.2234%2C1010.2216%2C1010.1577%2C1010.0929%2C1010.1124%2C1010.4547%2C1010.0570%2C1010.3595%2C1010.3286%2C1010.2780%2C1010.4999%2C1010.0889%2C1010.0401%2C1010.5325%2C1010.5606%2C1010.3338%2C1010.0519%2C1010.3872%2C1010.5426%2C1010.2960%2C1010.3548%2C1010.2055%2C1010.5197%2C1010.0550%2C1010.4202%2C1010.1155%2C1010.3924%2C1010.2977%2C1010.3425%2C1010.2509%2C1010.4966&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Differential Rotation and Magnetism in Simulations of Fully Convective\n  Stars"}, "summary": "Stars of sufficiently low mass are convective throughout their interiors, and\nso do not possess an internal boundary layer akin to the solar tachocline.\nBecause that interface figures so prominently in many theories of the solar\nmagnetic dynamo, a widespread expectation had been that fully convective stars\nwould exhibit surface magnetic behavior very different from that realized in\nmore massive stars. Here I describe how recent observations and theoretical\nmodels of dynamo action in low-mass stars are partly confirming, and partly\nconfounding, this basic expectation. In particular, I present the results of\n3--D MHD simulations of dynamo action by convection in rotating spherical\nshells that approximate the interiors of 0.3 solar-mass stars at a range of\nrotation rates. The simulated stars can establish latitudinal differential\nrotation at their surfaces which is solar-like at ``rapid'' rotation rates\n(defined within) and anti-solar at slower rotation rates; the differential\nrotation is greatly reduced by feedback from strong dynamo-generated magnetic\nfields in some parameter regimes. I argue that this ``flip'' in the sense of\ndifferential rotation may be observable in the near future. I also briefly\ndescribe how the strength and morphology of the magnetic fields varies with the\nrotation rate of the simulated star, and show that the maximum magnetic\nenergies attained are compatible with simple scaling arguments.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1010.2987%2C1010.4964%2C1010.1470%2C1010.1752%2C1010.2279%2C1010.0633%2C1010.5168%2C1010.4659%2C1010.4392%2C1010.0243%2C1010.5008%2C1010.2331%2C1010.1564%2C1010.3764%2C1010.0944%2C1010.4594%2C1010.5326%2C1010.3549%2C1010.1193%2C1010.4854%2C1010.0816%2C1010.4473%2C1010.4812%2C1010.1260%2C1010.4882%2C1010.0888%2C1010.1323%2C1010.6187%2C1010.3063%2C1010.2856%2C1010.6189%2C1010.3235%2C1010.4478%2C1010.1722%2C1010.5023%2C1010.3334%2C1010.5219%2C1010.1743%2C1010.2181%2C1010.3499%2C1010.3318%2C1010.3228%2C1010.4969%2C1010.3632%2C1010.0508%2C1010.3802%2C1010.4208%2C1010.3663%2C1010.0719%2C1010.5004%2C1010.5276%2C1010.2899%2C1010.2474%2C1010.1251%2C1010.1936%2C1010.6060%2C1010.0649%2C1010.6151%2C1010.5050%2C1010.2642%2C1010.4237%2C1010.2015%2C1010.0585%2C1010.6054%2C1010.5294%2C1010.3454%2C1010.2232%2C1010.3346%2C1010.2670%2C1010.5230%2C1010.2234%2C1010.2216%2C1010.1577%2C1010.0929%2C1010.1124%2C1010.4547%2C1010.0570%2C1010.3595%2C1010.3286%2C1010.2780%2C1010.4999%2C1010.0889%2C1010.0401%2C1010.5325%2C1010.5606%2C1010.3338%2C1010.0519%2C1010.3872%2C1010.5426%2C1010.2960%2C1010.3548%2C1010.2055%2C1010.5197%2C1010.0550%2C1010.4202%2C1010.1155%2C1010.3924%2C1010.2977%2C1010.3425%2C1010.2509%2C1010.4966&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Stars of sufficiently low mass are convective throughout their interiors, and\nso do not possess an internal boundary layer akin to the solar tachocline.\nBecause that interface figures so prominently in many theories of the solar\nmagnetic dynamo, a widespread expectation had been that fully convective stars\nwould exhibit surface magnetic behavior very different from that realized in\nmore massive stars. Here I describe how recent observations and theoretical\nmodels of dynamo action in low-mass stars are partly confirming, and partly\nconfounding, this basic expectation. In particular, I present the results of\n3--D MHD simulations of dynamo action by convection in rotating spherical\nshells that approximate the interiors of 0.3 solar-mass stars at a range of\nrotation rates. The simulated stars can establish latitudinal differential\nrotation at their surfaces which is solar-like at ``rapid'' rotation rates\n(defined within) and anti-solar at slower rotation rates; the differential\nrotation is greatly reduced by feedback from strong dynamo-generated magnetic\nfields in some parameter regimes. I argue that this ``flip'' in the sense of\ndifferential rotation may be observable in the near future. I also briefly\ndescribe how the strength and morphology of the magnetic fields varies with the\nrotation rate of the simulated star, and show that the maximum magnetic\nenergies attained are compatible with simple scaling arguments."}, "authors": ["Matthew Browning"], "author_detail": {"name": "Matthew Browning"}, "author": "Matthew Browning", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1017/S1743921311017467", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1010.2509v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1010.2509v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "9 pages, 2 color figures, to appear in Proc. IAU Symposium 271,\n  \"Astrophysical Dynamics: from Stars to Galaxies\"", "arxiv_primary_category": {"term": "astro-ph.SR", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "astro-ph.SR", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "physics.flu-dyn", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1010.2509v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1010.2509v1", "journal_reference": null, "doi": "10.1017/S1743921311017467", "fulltext": "Astrophysical Dynamics from Stars to Galaxies\nProceedings IAU Symposium No. 271, 2010\nN. Brummell & A.S. Brun, eds.\n\nc 2010 International Astronomical Union\nDOI: 00.0000/X000000000000000X\n\nDifferential Rotation and Magnetism in\nSimulations of Fully Convective Stars\nMatthew K. Browning1\n1\n\narXiv:1010.2509v1 [astro-ph.SR] 12 Oct 2010\n\nCanadian Institute for Theoretical Astrophysics,\nUniversity of Toronto, 60 St. George St, Toronto, Canada\nemail: browning@cita.utoronto.ca\nAbstract. Stars of sufficiently low mass are convective throughout their interiors, and so do not\npossess an internal boundary layer akin to the solar tachocline. Because that interface figures\nso prominently in many theories of the solar magnetic dynamo, a widespread expectation had\nbeen that fully convective stars would exhibit surface magnetic behavior very different from\nthat realized in more massive stars. Here I describe how recent observations and theoretical\nmodels of dynamo action in low-mass stars are partly confirming, and partly confounding, this\nbasic expectation. In particular, I present the results of 3–D MHD simulations of dynamo action\nby convection in rotating spherical shells that approximate the interiors of 0.3 solar-mass stars\nat a range of rotation rates. The simulated stars can establish latitudinal differential rotation\nat their surfaces which is solar-like at \"rapid\" rotation rates (defined within) and anti-solar\nat slower rotation rates; the differential rotation is greatly reduced by feedback from strong\ndynamo-generated magnetic fields in some parameter regimes. I argue that this \"flip\" in the\nsense of differential rotation may be observable in the near future. I also briefly describe how\nthe strength and morphology of the magnetic fields varies with the rotation rate of the simulated\nstar, and show that the maximum magnetic energies attained are compatible with simple scaling\narguments.\nKeywords. convection, MHD, stars: low-mass, stars: magnetic fields, stars: rotation, turbulence\n\n1. Introduction: Puzzles of Low-Mass Stellar Magnetism\nMagnetic fields are ubiquitous in low-mass stars, and in at least some cases those\nmagnetic fields exhibit a remarkable amount of spatial and temporal organization. The\nmost famous example is the Sun's cyclical magnetism: sunspots appear on the solar\ndisk first at mid-latitudes, then progressively nearer the equator over the course of a\nroughly 11-year cycle; the number and polarity of the spots varies in the same way\n(see., e.g., Ossendrijver 2003). These organized magnetic fields are widely (though not\nuniversally) thought to be generated partly in the tachocline of shear at the base of the\nsolar convective envelope – in part because it is a site of strong differential rotation, but\nalso because the stable stratification below the convection zone might allow magnetic\nfields to be amplified enormously before becoming susceptible to magnetic buoyancy\ninstabilities (see, e.g., Parker 1993; see Spruit 2010 for a different view).\nBut not all stars have a tachocline. Moving down the main sequence to lower masses\nand cooler temperatures, the convective envelope deepens and the radiative core shrinks.\nStars of less than about a third a solar mass (corresponding to spectral types of roughly\nM3.5 or later) are thought to be convective throughout their interiors, and so do not\npossess an internal boundary layer akin to the solar tachocline. Although these lowmass stars might in principle still possess differential rotation – like the latitudinal shear\npresent throughout the solar convection zone – a widespread theoretical expectation had\n119\n\n\f120\n\nMatthew K. Browning\n\nbeen that they would exhibit magnetic fields that differed appreciably from those realized\nin more massive solar-like stars (e.g., Durney et al. 1993).\nObservations of stellar magnetism paint a somewhat murkier picture. On the one hand,\nthere have been recent suggestions (particularly from spectropolarimetric observations)\nthat the surface magnetic topologies of stars with a small radiative core do differ appreciably from those of stars that are fully convective (e.g., Morin et al. 2010; Reiners\n& Basri 2009). Fully convective stars (with late-M spectral types) also appear to spin\ndown (through angular momentum loss via a magnetized stellar wind) much more slowly\nthan early-M dwarfs (e.g., Browning et al. 2010; Reiners et al. 2009), though it is unclear\nwhether this is due to changes in the strength or morphology of surface magnetic fields\nor to changes in the mass loss rate. On the other hand, it also seems clear that some fully\nconvective stars can build magnetic fields with remarkably strong large-scale components\n(Donati et al. 2006), with the strength of those fields sensitive to rotation at some level\n(e.g., Mohanty & Basri 2003). Indeed, some recent comparisons between line-of-sight and\nunsigned field measurements (extracted from Stokes V and Stokes I observations) suggest\nthat some fully convective stars actually harbor more organized fields than slightly more\nmassive stars with a small radiative core (Reiners & Basri 2009). Puzzlingly, some of\nthese stars appear to show large-scale magnetic field organization but no evident surface\ndifferential rotation (e.g., Donati et al. 2006).\nThe most central question raised by these observations is, simply, how are spatially\norganized fields realized in fully convective stars? But this basic issue is tightly linked to a\nwhole set of other questions: what is the nature of the differential rotation in these stars,\nand what role does it play in the dynamo process? Can these stars ever drive solar-like\ndifferential rotation at observable levels? How do the strength and morphology of the\ndynamo-generated fields vary with rotation rate? How does the magnetism modify the\ntransport of energy and angular momentum throught the stellar interior? These questions\nmotivate the work described in this paper.\nHere, I describe the results of a series of 3-D simulations of convection and magnetism\nin rotating spherical domains that are intended to represent fully convective stars of 0.3\nsolar masses at various rotation rates. In §2 I describe the basic setup of these simulations\nand the numerical methods employed. The convective flow patterns and some aspects of\nenergy transport are detailed in §3. I describe the differential rotation that arises in these\nmodels in §4. In §5 I describe the strength and morphology of the magnetic fields realized\nat various rotation rates.\n\n2. Model Formulation and Numerical Methods\nThe simulations described here are highly idealized representations of 0.3 solar-mass\nstars rotating between one-tenth and ten times as rapidly as the Sun (0.1–10 ×Ω0 =\n2.6 × 10−6 s−1 ). They were all carried out using the Anelastic Spherical Harmonic (ASH)\ncode, which solves the 3–D Navier-Stokes equations with magnetism in the anelastic\napproximation (Clune et al. 1999; Miesch et al. 2000; Brun, Miesch & Toomre 2004).\nThe setup at each rotation rate is essentially identical to that described in Browning\n(2008); here I summarize only the most important details. Before delving into them,\nnote that the ASH code is well-suited to this problem because it correctly captures the\nglobal spherical geometry of the star, thereby allowing the study of intrinsically largescale processes like differential rotation, meridional circulation, and global-scale dynamo\naction. The tradeoff, of course, is that because we can only resolve a finite range of spatial\nand temporal scales in the simulation, including the largest possible length scales (the\nradius of the star) in our modeling implies that the smallest lengths resolved are still quite\n\n\fIAUS 271. Simulations of Fully Convective Stars\n\n121\n\nlarge – typically about 1 Mm. Thus I focus here on the dynamics of the largest scales,\nwhile recognizing that at some level of detail these must be influenced by smaller-scale\ndynamics that these simulations cannot resolve.\nThe spherical computational domain typically extends from 0.06-0.96R, where R is\nthe overall stellar radius of 2.07 × 1010 cm, thus excluding both the surface boundary\nlayer and the innermost portions of the star. I exclude the inner few percent of the\nstar from these calculations both because the coordinate systems employed in ASH are\nsingular there, and because the small numerical mesh sizes at the center of the star would\nrequire impractically small timesteps. The initial stratifications of the mean density,\nenergy generation rate, gravity, radiative diffusivity, and entropy gradient dS/dr are\nadopted from a 1-D stellar model (I. Baraffe, private communication, after Baraffe &\nChabrier 2003). These thermodynamic quantities are updated throughout the course\nof the simulation as the evolving convection modifies the spherically symmetric mean\nstate. Variables are expanded in terms of spherical harmonic basis functions Ylm (θ, φ)\nin the horizontal directions and Chebyshev polynomials Tn (r) in the radial. As with all\nnumerical simulations, the eddy viscosities and diffusivities employed are vastly greater\nthan their counterparts in actual stars; here I have taken these to be constant in radius,\nand adopted a Prandtl number ν/κ = 0.25 and a magnetic Prandtl number P m = ν/η\nthat varies between 0.25 and 8 depending on the simulation. At a detailed level, the flows\nand magnetic fields attained in the simulations are sensitive to the values of these nondimensional numbers. Because of this, I focus here on the broad trends these simulations\nexhibit: the types of flows and magnetic fields they can achieve as the basic parameters\nof the problem are varied, rather than the precise values of magnetic energy, zonal wind\nvelocity, etc, that are attained. I particularly concentrate here on the role that changes\nin the overall stellar rotation rate play, since this turns out to have an outsized influence\non the flows and magnetic fields that are achieved.\n\n3. Convective Flows and Energy Transport\nThe convective flows in these simulations possess structure on many scales. Although\nmany small-scale features continually emerge, propagate, and survive only for a short\nwhile, there are also large-scale organized motions that can persist for extended intervals.\nA sampling of this behavior is provided by Figure 1, which shows volume renderings of the\nradial velocity in two simulations, one rotating at the solar angular velocity and the other\nten times slower. (The opacity mapping used in that figure is such that only motions near\n\nFigure 1. Radial velocity in simulations rotating at the solar angular velocity (b, c) and tenfold\nslower (a). Upflows are reddish (light), downflows are blueish (dark). Panel c shows a cutaway\nof one hemisphere.\n\n\f122\n\nMatthew K. Browning\n\nthe outer boundary of the simulation are visible in Fig. 1a, 1b; Figure 1c shows a cutaway\nof one hemisphere in the more rapidly rotating simulation, to highlight the radial extent\nof the motions.) Rotation has a strong effect on the convective patterns that are realized:\nwhen rotation is very slow, the convection is more or less isotropic on each spherical\nsurface, with a network of upflows and downflows that meanders in orientation over\nthe sphere. Increasing the rotation rate breaks this symmetry and imposes a preferred\ndirection, leading (in some cases) to convective rolls like those shown in Figure 1b, 1c. (If\nthe eddy viscosity in the simulations is decreased, these rolls become less pronounced and\ncan break up, but there is still a tendency towards alignment along the rotation axis.)\nThese roll-like structures are a well-known feature of convection in rotating spherical\nshells (see, e.g., Busse 2002; Gilman 1977).\nOne other feature worth highlighting is the strong asymmetry between upflows and\ndownflows realized near the top of the simulated stars: the downflows are stronger and\nnarrower than the former, mainly because of the strong density stratification. (Downflows\nare cool and contract; upflows are hot and expand.) Deeper in the interior, the flows\nare weaker and of somewhat larger physical scale: motions can span large fractions of a\nhemisphere and extend radially for some distance. Flow amplitudes also vary appreciably\nwith depth, with typical rms velocities declining by a factor of about ten in going from\nthe surface to the center.\nThe variation in flow amplitude with radius is linked to both the density stratification\nand to radial variations in the amount of energy that must be transported by convection. Convection ultimately arises because of a need to transport heat outwards: if more\nenergy has to be carried by convection, the convective velocity will generally be higher.\nAlthough the interior is unstably stratified everywhere, radiation still carries some of the\nenergy at small radii. This is because the end state of efficient convection is an interior\nstratification that is approximately isentropic, not isothermal as in unstratified convection: thus there is still a non-zero radiative flux. Together with the overall increase of the\ntotal luminosity with radius (out to the point where nuclear energy generation stops),\nthis implies that the total luminosity carried by convection peaks at large radii (around\nr = 0.80R). Thus the convective velocity is appreciably greater near the surface than at\ndepth. Another important effect arises because of the asymmetry between upflows and\ndownflows: this implies a negative (inward) kinetic energy flux, which in a steady state\nmust be compensated for by an increased outward enthalpy (convective) flux. This effect,\ntoo, depends on depth (since the star is more strongly stratified near the surface), again\nleading to more vigorous convection near the top of the simulation domain.\n\n4. Differential Rotation: Solar or Anti-Solar\nIn addition to transporting heat, the convective flows also transport angular momentum. One might naively expect that parcels of fluid would individually conserve angular\nmomentum – so that (for instance) a fluid element moving outward would tend to slow\ndown (move retrograde relative to the frame), and a fluid element moving latitudinally\nfrom equator to pole would tend to spin up. This would imply anti-solar differential rotation at the surface, with a slow equator and fast poles, and longitudinal velocities that\ndecrease with distance from the rotation axis. The fact that the Sun in fact has a fast\nequator and slow pole is enough to suggest that there is more to the story than this: that\nconvection, acting in concert or conflict with meridional circulations and magnetic fields,\ncan redistribute angular momentum in surprising ways. Here I describe briefly the types\nof differential rotation that are achieved in these simulations at varying rotation rates,\n\n\fIAUS 271. Simulations of Fully Convective Stars\n\n123\n\nwhile deferring an in-depth analysis of the angular momentum transport to forthcoming\nwork (Browning & Miesch 2010).\nAll of the MHD calculations described here had hydrodynamical progenitor simulations. These all began in a state of uniform rotation, but convection quickly established\ninterior rotation profiles that varied with radius and latitude. The resulting differential\nrotation, displayed in Figure 2 for two hydrodynamic cases, depends on the overall stellar\nrotation rate: in Figure 2a, from a simulation rotating at one-tenth the solar angular\nvelocity, the rotation profile is \"anti-solar\" at the surface, with a slow equator and fast\npoles; in Figure 2b, from a simulation rotating at the solar angular velocity, the rotation\nprofile is solar-like at the surface. Both cases also show angular velocity contrasts in radius, with angular velocity decreasing with depth in the more rapidly rotating case and\ndecreasing with depth in the slower rotator. In the simulation rotating at the solar rate,\nthe interior angular velocity profile is largely constant on cylinders, reflecting the strong\nProudman-Taylor constraint; in the more slowly rotating case this cylindrical alignment\nis not evident.\nSimilar transitions in the nature of angular momentum transport and differential rotation have been noted by several previous authors in other contexts. In particular, Gilman\n(1977) noted that his simulations of a solar-like convection zone exhibited solar-like equatorial acceleration in some regimes and anti-solar rotation profiles in others; he identified\nthe transition between these two regimes with a transition from a convective Rossby\nnumber (essentially the ratio of buoyancy driving to Coriolis forces) greater than unity\nto less than unity. When the rotational influence on the convection was strong relative\nto buoyancy driving, he attained equatorial acceleration; when it was weak, the equator\nrotated more slowly than the poles. Similar results were obtained in simulations of core\nconvection in A-type stars (Browning et al. 2004). The simulations here exhibit qualitatively similar behavior. Convection influenced by rotation (that is, with a Rossby number\nroughly less than unity) tends to drive solar-like differential rotation; when rotation is\nslower, the differential rotation profile is anti-solar.\nThe interior rotation profiles can be quite different in the presence of strong dynamogenerated magnetic fields. In MHD simulations, the magnetic fields react back strongly\nupon the flows, acting to quench and in some instances essentially eliminate the differential rotation. An example of this for a simulation rotating at the solar rate was explored\nin Browning (2008). The extent to which the differential rotation is reduced depends on\nthe overall magnetic field strength, which in turn (as discussed below) depends somewhat\non the overall stellar rotation rate. Thus, there is a \"sweet spot\" for differential rotation:\nwhen the simulations rotate very slowly, they drive weak anti-solar differential rotation;\nwhen the rotation rate is somewhat larger they drive strong solar-like differential rotation; and when rotation is more rapid still they build magnetic fields so strong that the\ndifferential rotation is partly quenched. These transitions occur at fairly slow overall rotation rates: because the luminosities of M-dwarfs are so low, their convective velocities\nare also low, and so they are strongly influenced by rotation even at solar-like angular\nvelocities. Only the very slowest rotators (those with rotation periods much longer than\nthe solar value) drive anti-solar differential rotation.\nIt seems plausible that these basic predictions could be testable in the near future\nby photometric monitoring with, e.g., Kepler. The exact rotation periods at which stars\nmight transition from anti-solar to solar-like differential rotation, and then again to no\nevident differential rotation (because it has been wiped out by the dynamo-generated\nMaxwell stresses), are probably not reliably predictable by these calculations. They depend on the values of viscosity, magnetic diffusivity, etc, adopted in the modeling. But\nthe basic existence of these different regimes, and their rough dependence on rotation\n\n\f124\n\nMatthew K. Browning\n\nrate, might well be robust. The main challenge observationally will probably be to measure differential rotation reliably in the slowest rotators, which are presumably less active\nand so less spotted.\n\n5. Dynamo Action Achieved\nThe flows in each simulation act as a magnetic dynamo, amplifying a tiny seed field by\nmany orders of magnitude and sustaining it against Ohmic decay. The magnetic energy\n(ME) grows exponentially until it reaches a steady state. In the most rapid rotators\n(which, again, are not really rotating all that rapidly in absolute terms), the final magnetic\nenergy density is approximately in equipartition with the flows; in slower rotators it tends\nto be smaller. The exact values of the magnetic energy are sensitive at some level to\nthe values of the magnetic Reynolds number, magnetic Prandtl number, etc, that I have\nadopted in each calculation. To give a specific example: in an evolved calculation rotating\nat the solar angular velocity, ME was approximately 120% of the total kinetic energy KE\n(relative to the rotating frame) and about 140% of the convective (non-axisymmetric)\nkinetic energy (CKE).\nAs the fields grow, they react back on the flows through the Lorentz force. Thus KE\nbegins to decline once ME reaches a threshold value of about 5% of KE; here this decline\nis associated mainly with a decrease in the energy of differential rotation DRKE, whereas\nCKE is less affected by the growing fields.\nLike the flows that build them, the magnetic fields possess both intricate small-scale\nstructure and substantial large-scale components. The typical length scale of the field\nincreases with depth, partly tracking the radial variation in the size of typical convective\nflows. The smallest field structures are typically on finer scales than the smallest flow\nfields, partly because I have adopted a magnetic Prandtl number Pm greater than unity.\nBy decomposing the magnetism into its azimuthal mean (TME), and fluctuations around\n\nFigure 2. Differential rotation achieved in sample hydrodynamic simulations rotating at the\nsolar angular velocity (a) and ten times slower (b). Light tones are prograde, dark ones retrograde.\n\n\fIAUS 271. Simulations of Fully Convective Stars\n\n125\n\nthat mean (FME), we can gain a coarse estimate of the typical size of field structures: if\nthe field is predominantly on small scales, only a small signal will survive this azimuthal\naveraging. In these simulations, TME accounts for at most about 20% of the total magnetic energy in the bulk of the interior; it is smallest near the surface (where TME is\ntypically less than 5 % ME), and largest (as a fraction of ME) at depth.\nThe fraction of energy in the mean (axisymmetric) components increases with increasing rotation rate. The ratio of the toroidal mean energy to the poloidal mean also changes:\nin the very slowest rotators the two components are comparable, while in more rapidly\nrotating cases with strong differential rotation, TME exceeds the poloidal mean energy\n(PME) by a factor of a few.\nThe mean (axisymmetric) fields realized in some of the simulations are remarkably\nstrong and long-lived. Mean toroidal field strengths can exceed 10 kG in some locations;\nsome prominent field structures persist for thousands of days. The overall field polarity\nis stable over long intervals (decades), in sharp contrast to some simulations of solar\nconvection without a tachocline (Brun et al. 2004), in which the field polarity flipped at\nirregular intervals of less than 600 days.\n\n6. Closing Thoughts\nThe overall picture that emerges from these simulations is that fully convective stars\ncan act effectively as magnetic dynamos, building fields that have structure on both\nlarge and small spatial scales. The large-scale fields can be remarkably strong and longlived. The convection drives differential rotation, in a manner that depends on the overall\nrotation rate: the very slowest rotators would appear anti-solar at their surface, while\nmore rapid rotators establish a fast equator and slow pole. That differential rotation is,\nhowever, largely quenched by Maxwell stresses in cases that build strong magnetic fields.\nThe maximum magnetic energy densities attained in these calculations are of order\nequipartition with the kinetic energy density relative to the rotating frame. Although\nstronger magnetic fields might be possible in some instances (see, e.g., Featherstone et\nal. 2009), it is worth noting that the assumption of equipartition yields magnetic field\nestimates broadly in line with those recently predicted on somewhat different grounds\nby Christensen and collaborators (see, e.g., Christensen et al. 2009; Reiners et al. 2009).\nSpecifically, Reiners et al. (2009) argue, based on an energy flux scaling derived empirically from a series of planetary dynamo calculations, that the magnetic flux in stars\nshould scale approximately as\nBf ∝ M 1/6 L1/3 R−7/6\n\n(6.1)\n\nwith M , L, and R the stellar mass, luminosity and radius, and where Bf is the surface\nmagnetic flux. This turns out to be the same scaling one derives by assuming that 1.\nmagnetic fields are in approximate equipartition with the convective kinetic energy and\n2. that convective energy is given roughly by mixing-length arguments, so that it is proportional to the heat flux to the one-third power. To order of magnitude, the convective\nluminosity is given by\nL∼\n\nρv 2 ( 43 πd3 )\nconvective energy\n∼\nconvective overturning time\nlc /v\n\n(6.2)\n\nwith d a lengthscale characterizing the depth of the convection zone and lc the length\n3L\nlc )1/3 d1 . Meanwhile,\ncharacterizing convective eddies. This in turn implies that v ∼ ( 4πρ\nequipartition of kinetic and magnetic energy densities implies that B ∼ ρ1/2 v. If we then\n\n\f126\n\nMatthew K. Browning\n\ntake ρ ∼ M/R3 , and assume that to order of magnitude all lengthscales are comparable\n(lc ∼ d ∼ R), we obtain that v ∼ L1/3 R1/3 M −1/3 , so that finally B ∼ L1/3 M 1/6 R−7/6 ,\nas in the Reiners et al. (2009) scaling. This is not to suggest that greater or lesser\nfield energies are not possible, but does indicate that objects deviating greatly from the\nReiners et al. (2009) scaling are breaking one of the assumptions I made above. Either\nequipartition does not hold, or the relevant flow velocity is not related to the background\nheat flux in the way assumed here.\nIt is a pleasure to acknowledge many helpful conversations about this and related\npuzzles in stellar rotation and magnetism with Juri and the other members of the \"ASH\nmob.\"\nReferences\nBrowning, M.K., 2008, ApJ, 676, 1262\nBrowning, M.K., Basri, G., Marcy, G.W., West, A.A., & Zhang, J., 2010, AJ, 139, 504\nBrun, A. S., Miesch, M. S., & Toomre, J. 2004, ApJ, 614, 1073\nChristensen, U.R., Holzwarth, V., & Reiners, A., 2009, Nature, 457, 167\nDonati, J.F., Forveille, T., Cameron, A.C., Barnes, J.R., Delfosse, X., Jardine, M.M., & Valenti,\nJ.A., 2006, Science, 311, 633\nDurney, B.R., De Young, B.S., & Roxburgh, I.W., 1993, Sol. Phys., 145, 207\nFeatherstone, N.A., Browning, M.K., Brun, A.S., & Toomre, J., 2009, ApJ, 706, 1000\nGilman, P.A., 1977, GAPFD, 8, 93\nMiesch, M. S., Elliott, J. R., Toomre, J., Clune, T. L., Gl atzmaier, G. A., & Gilman, P. A.,\n2000, ApJ, 532, 593\nMohanty, S. & Basri, G., 2003, ApJ, 583, 451\nMorin, J., et al., 2010, MNRAS 1077\nOssendrijver, M. 2003, Astron. Astrophys. Rev., 11, 287\nParker, E. N. 1993, ApJ, 408, 707\nReiners, A. & Basri, G., 2009, A&A, 496, 787\nReiners, A., Basri, G., & Christensen, U.R., 2009, ApJ, 697, 373\nSpruit, H.C. 2010, arXiv:1004.4545\n\nDiscussion\nA. Brandenburg: Is the dependence of rotation rate on spectral type real and how\ndoes this depend on age?\nM. Browning: The conclusion that very low-mass stars take longer to spin down than\nsomewhat higher-mass ones appears to me to be quite robust. But there is certainly an\nage effect: if you look at young enough clusters, many stars of all spectral types are still\nrotating quite rapidly. In the field, though – i.e., looking at much older stars – you tend\nto find that very few early-M stars are detectably rotating (see, e.g., Browning et al.\n(2010), where we used Keck HIRES spectra to look for signs of rotation in dozens of field\nM-dwarfs). A significantly larger fraction of late-M stars (or L-dwarfs) are detectably\nrotating.\nK. Moffat: Your conclusion that rotation plus convection are conducive to the growth\nof large-scale fields is hardly new! These ingredients imply large-scale helicity and so\na corresponding α-effect. Have you been able to interpret your simulations from this\n\"mean-field\" point of view?\nM. Browning: The short answer is no, these simulations do not seem to be particularly\nwell-described by mean-field theory. There is certainly large-scale helicity of the predicted\n\n\fIAUS 271. Simulations of Fully Convective Stars\n\n127\n\nsense, but it doesn't seem to be especially well-linked to the growth of the large-scale\nfield. The role of rotation in these simulations seems to be partly about increasing the\ncorrelation length of the convection to something on the order of the domain size, rather\nthan just imparting a preferred sign to the helicity in each hemisphere. That said, we\ncertainly have more work to do in trying to make connections between these results and\nmean-field theory.\nK. Ferriere: Why in the Sun does the equator rotate faster than the poles?\nM. Browning: I would say that, honestly, we still have a \"description\" of how this\nhappens rather than a first-principles theory. (See Miesch et al., these proceedings, for\nsome of that description.) Ultimately there are Reynolds stresses arising from correlations\nin the fluctuating velocity components, and the sense of those stresses is such that you\nbreak the tendency for individual parcels of fluid to just conserve angular momentum\nas they move outward or inward. But baroclinic effects, meridional circulations, etc, all\nappear to play roles as well.\n\n\f"}