{"id": "http://arxiv.org/abs/0802.1599v1", "guidislink": true, "updated": "2008-02-12T11:22:35Z", "updated_parsed": [2008, 2, 12, 11, 22, 35, 1, 43, 0], "published": "2008-02-12T11:22:35Z", "published_parsed": [2008, 2, 12, 11, 22, 35, 1, 43, 0], "title": "Newton's second law versus modified-inertia MOND: a test using the\n  high-latitude effect", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0802.4462%2C0802.1601%2C0802.3716%2C0802.0495%2C0802.0306%2C0802.2039%2C0802.2689%2C0802.2609%2C0802.0615%2C0802.3580%2C0802.0595%2C0802.2878%2C0802.2467%2C0802.4184%2C0802.1874%2C0802.3764%2C0802.0634%2C0802.3018%2C0802.0847%2C0802.2421%2C0802.3842%2C0802.0639%2C0802.2365%2C0802.1083%2C0802.2865%2C0802.0656%2C0802.0396%2C0802.4312%2C0802.0332%2C0802.2212%2C0802.2549%2C0802.1528%2C0802.3861%2C0802.4387%2C0802.1617%2C0802.2654%2C0802.3042%2C0802.3467%2C0802.3362%2C0802.3780%2C0802.3762%2C0802.4034%2C0802.1067%2C0802.2393%2C0802.2261%2C0802.3965%2C0802.2144%2C0802.3254%2C0802.0217%2C0802.1763%2C0802.2813%2C0802.0590%2C0802.3169%2C0802.3025%2C0802.3376%2C0802.2815%2C0802.1599%2C0802.3671%2C0802.0249%2C0802.1108%2C0802.2838%2C0802.0460%2C0802.4280%2C0802.0147%2C0802.0108%2C0802.3707%2C0802.2518%2C0802.2007%2C0802.3435%2C0802.0878%2C0802.3367%2C0802.1619%2C0802.4197%2C0802.3597%2C0802.2086%2C0802.4154%2C0802.1983%2C0802.4053%2C0802.2186%2C0802.3766%2C0802.4103%2C0802.3931%2C0802.4038%2C0802.3562%2C0802.2121%2C0802.4119%2C0802.3667%2C0802.4064%2C0802.2535%2C0802.2188%2C0802.3108%2C0802.2950%2C0802.1640%2C0802.3172%2C0802.2298%2C0802.0705%2C0802.2811%2C0802.3960%2C0802.2342%2C0802.3457%2C0802.3196&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Newton's second law versus modified-inertia MOND: a test using the\n  high-latitude effect"}, "summary": "The modified-inertia MOND is an approach that proposes a change in Newton's\nsecond law at small accelerations as an alternative to dark matter. Recently it\nwas suggested that this approach can be tested in terrestrial laboratory\nexperiments. One way of doing the test is based on the Static High-Latitude\nEquinox Modified Inertia (SHLEM) effect: around each equinox date, 2 spots\nemerge on the Earth where static bodies experience spontaneous displacement due\nto the violation of Newton's second law required by the modified-inertia MOND.\nHere, a detailed theory of this effect is developed and estimates of the\nmagnitude of the signal due to the effect are obtained. The expected\ndisplacement of a mirror in a gravitational wave interferometer is found to be\nabout 10^{-14} m. Some experimental aspects of the proposal are discussed.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0802.4462%2C0802.1601%2C0802.3716%2C0802.0495%2C0802.0306%2C0802.2039%2C0802.2689%2C0802.2609%2C0802.0615%2C0802.3580%2C0802.0595%2C0802.2878%2C0802.2467%2C0802.4184%2C0802.1874%2C0802.3764%2C0802.0634%2C0802.3018%2C0802.0847%2C0802.2421%2C0802.3842%2C0802.0639%2C0802.2365%2C0802.1083%2C0802.2865%2C0802.0656%2C0802.0396%2C0802.4312%2C0802.0332%2C0802.2212%2C0802.2549%2C0802.1528%2C0802.3861%2C0802.4387%2C0802.1617%2C0802.2654%2C0802.3042%2C0802.3467%2C0802.3362%2C0802.3780%2C0802.3762%2C0802.4034%2C0802.1067%2C0802.2393%2C0802.2261%2C0802.3965%2C0802.2144%2C0802.3254%2C0802.0217%2C0802.1763%2C0802.2813%2C0802.0590%2C0802.3169%2C0802.3025%2C0802.3376%2C0802.2815%2C0802.1599%2C0802.3671%2C0802.0249%2C0802.1108%2C0802.2838%2C0802.0460%2C0802.4280%2C0802.0147%2C0802.0108%2C0802.3707%2C0802.2518%2C0802.2007%2C0802.3435%2C0802.0878%2C0802.3367%2C0802.1619%2C0802.4197%2C0802.3597%2C0802.2086%2C0802.4154%2C0802.1983%2C0802.4053%2C0802.2186%2C0802.3766%2C0802.4103%2C0802.3931%2C0802.4038%2C0802.3562%2C0802.2121%2C0802.4119%2C0802.3667%2C0802.4064%2C0802.2535%2C0802.2188%2C0802.3108%2C0802.2950%2C0802.1640%2C0802.3172%2C0802.2298%2C0802.0705%2C0802.2811%2C0802.3960%2C0802.2342%2C0802.3457%2C0802.3196&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "The modified-inertia MOND is an approach that proposes a change in Newton's\nsecond law at small accelerations as an alternative to dark matter. Recently it\nwas suggested that this approach can be tested in terrestrial laboratory\nexperiments. One way of doing the test is based on the Static High-Latitude\nEquinox Modified Inertia (SHLEM) effect: around each equinox date, 2 spots\nemerge on the Earth where static bodies experience spontaneous displacement due\nto the violation of Newton's second law required by the modified-inertia MOND.\nHere, a detailed theory of this effect is developed and estimates of the\nmagnitude of the signal due to the effect are obtained. The expected\ndisplacement of a mirror in a gravitational wave interferometer is found to be\nabout 10^{-14} m. Some experimental aspects of the proposal are discussed."}, "authors": ["A. Yu. Ignatiev"], "author_detail": {"name": "A. Yu. Ignatiev"}, "author": "A. Yu. Ignatiev", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1103/PhysRevD.77.102001", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/0802.1599v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0802.1599v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "15 pages, 1 figure", "arxiv_primary_category": {"term": "gr-qc", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "gr-qc", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "hep-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0802.1599v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0802.1599v1", "journal_reference": "Phys.Rev.D77:102001,2008", "doi": "10.1103/PhysRevD.77.102001", "fulltext": "Newton's second law versus modified-inertia MOND: a test using\nthe high-latitude effect\nA. Yu. Ignatiev∗\nTheoretical Physics Research Institute,\nMelbourne 3163,\nAustralia.\n\narXiv:0802.1599v1 [gr-qc] 12 Feb 2008\n\nAbstract\nThe modified-inertia MOND is an approach that proposes a change in Newton's second law at\nsmall accelerations as an alternative to dark matter. Recently it was suggested that this approach\ncan be tested in terrestrial laboratory experiments. One way of doing the test is based on the\nStatic High-Latitude Equinox Modified inertia (SHLEM) effect: around each equinox date, 2 spots\nemerge on the Earth where static bodies experience spontaneous displacement due to the violation\nof Newton's second law required by the modified-inertia MOND. Here, a detailed theory of this\neffect is developed and estimates of the magnitude of the signal due to the effect are obtained.\nThe expected displacement of a mirror in a gravitational wave interferometer is found to be about\n10−14 m. Some experimental aspects of the proposal are discussed.\nPACS numbers: 04.80.Cc, 45.20.D\n\n∗\n\nElectronic address: a.ignatiev@ritp.org\n\n1\n\n\fI.\n\nINTRODUCTION\n\nIn this paper I examine the experimentally testable consequences of the hypothesis that\nNewton's second law should be changed for small accelerations. This hypothesis - called\nthe modified Newtonian dynamics (MOND) with modified inertia - has been proposed by\nMilgrom [1] as an alternative to the more conventional Dark Matter explanation of the shape\nof the galactic rotation curves.\nThe main assumption of the modified-inertia MOND is that Newton's second law should\nbe modified to read\nF = maμ(a/a0 ),\n(1.1)\nwhere a0 is a fundamental acceleration of the order of 10−10 m s−2 and μ is a function\nsatisfying the two conditions: μ(a/a0 ) → 1 at a \u001d a0 and1 μ(a/a0 ) → a/a0 at a \u001c a0 .\n(More details about μ and a0 are in Sec. V and VI.)\nFurther, the universal gravitation law is assumed to keep its conventional form\nF =\n\nGm1 m2\n.\nr2\n\n(1.2)\n\nAt this stage, the modified-inertia MOND is only formulated in the context of Newtonian\nphysics, i.e., a flat-space picture, which will be assumed throughout this paper.\nAt the moment the MOND approach is attracting constantly growing interest. Various\nastrophysical aspects of this approach are under active discussion (see [2] and the last Ref.\n[1] for a comprehensive bibliography). However, until lately the analysis of terrestrial (as\nopposed to astrophysical) consequences of MOND has been missing in the literature. The\nunusual smallness of the acceleration a0 makes it very difficult to think of a laboratory test.\nIt also explains why we do not see any deviations from Newton's second law under ordinary\ncircumstances. Surprising first results of such analysis have recently been described in [3].\nOne of these results is the existence of a new effect that has been called Static HighLatitude Equinox Modified inertia or SHLEM: around each equinox date, 2 spots emerge on\nthe Earth where static bodies experience spontaneous displacement due to the violation of\nNewton's second law required by the modified-inertia MOND. The laboratory observation\nof this effect may be accessible to current experimental capabilities.\nConsequently, it could serve as a basis for a proposal to test the validity of Newton's\nsecond law for small accelerations in a laboratory based experiment-the first of its kind.\nIn fact, such a test could become a crucial experiment in view of the lack of conclusive\nastrophysical evidence either in favour or against the modified Newtonian dynamics.\nHere, a detailed theory of this effect is developed and estimates of the magnitude of the\nsignal due to the effect are obtained. The expected displacement of a mirror in a gravitational\nwave interferometer is found to be about 10−14 m.\n1\n\nThe difference between this asymptotic condition and that of Ref. [3] is due to a misprint in the latter.\n\n2\n\n\fThe nature of inertia has long been one of the most fundamental puzzles of physics. In\nrecent times, this puzzle has widened to include also the problem of the origin of mass in the\nStandard Model. Despite concerted theoretical efforts over decades, the path to the solution\nis still to be found.\nThus the pursuit of MOND as an alternative explanation of the 'dark matter' puzzle\nseems well motivated. If true, it will bring about the need to revise foundations of modern\nphysics.\nThe paper is organized as follows. To make the exposition more understandable and\nself-contained, Sections II and III review and extend the background material from [3].\nSection IV describes the SHLEM effect qualitatively. In Sec. V and VI the equation of\nmotion is derived and its solution is obtained. In Sec. VII some experimental suggestions\nare discussed. Finally, the conclusions are presented in Sec. VIII.\n\nII.\n\nACCELERATION: 'ABSOLUTE' OR 'RELATIVE' ?\n\nFirst I emphasize that to obtain laboratory-testable predictions, MOND needs to be formulated not only in inertial reference systems, but also in non-inertial systems as well [3]. (In\nthe MOND context all laboratory reference systems should be considered as non-inertial.)\nBecause the dynamical law is modified depending on the acceleration, the transition between inertial and non-inertial systems in MOND becomes less straightforward than in the\nconventional mechanics.\nOf particular interest are transformation properties of a0 . Logically, at least 2 options\ncould be imagined. First, one can assume that the fundamental acceleration that determines\nthe onset of the MOND regime equals a0 only in the inertial reference systems. Second, it\ncould be assumed that a0 is invariant under transformations from inertial to non-inertial\nsystems. One would expect that these 2 types of theories would lead to drastically different\nexperimental predictions.\nFor instance, the first type of theory requires that the MOND regime is reached as soon\n< a0 with respect to the Galactic reference\nas the test body moves with a tiny acceleration ∼\nframe 2 .\nOn the other hand, the second type of theory implies that in order to reach the MOND\n< a0 with\nregime, we should try to ensure that the test body moves with a tiny acceleration ∼\nrespect to the laboratory reference frame.\n2\n\nAlthough the choice of the Galactic reference frame is a natural one, a question can be raised whether\nalternative choices are possible. For instance, what if we take a reference frame with the origin at the\ncenter of mass of the Local Group of galaxies? Fortunately, that would not significantly affect the results\nbecause the acceleration due to the neighbouring galaxies is much smaller than a0 . For example, the\nacceleration due to the Andromeda galaxy is less than 10−12 m s−2 .\n\n3\n\n\fHowever, it has been pointed out that the second version (invariant acceleration a0 ) is not\nself-consistent [3]. The reason is that the invariance of a0 is inconsistent with the kinematical\nrules of acceleration addition. Indeed, let us take two reference frames: an inertial S, and a\nnon-inertial S0 that is in translational motion with acceleration b relative to S. Then, in the\nsystem S the equation of motion will be\nF = maμ(a/a0 ),\n\n(2.1)\n\nwhere a is the acceleration of a test body in the system S. If we assume that a0 is invariant,\nthen the equation of motion in the system S0 is\nF = ma0 μ(a0 /a0 ) + mb,\n\n(2.2)\n\nwhere a0 = a − b is the acceleration of the test body in the system S0 . However, equations\n(2.1) and (2.2) cannot hold simultaneously for all a and b: for instance, if we put a = 0\nthen we obtain\nmμ(b/a0 ) = m\n(2.3)\nfor all b which means that μ(z) = 1 for all z. Thus the invariant-a0 version of MOND is\ninconsistent.\nIn addition, this version has been ruled out experimentally [4]. In what follows, only the\nfirst version will be considered.\n\nIII.\n\nCONDITION OF ENTRY INTO SHLEM REGIME\n\nWe will now recall what conditions must be realized in order to obtain the SHLEM effect\nfor test bodies at rest in the ground-based laboratory [3].\nThis question is easy to answer in the inertial system S0 . (It is the system with the origin\nin the centre-of-mass of our Galaxy and the axes pointing to certain far-away quasars). In\nthis system, we should ensure that the test body moves with a tiny acceleration agal with\nrespect to S0 :\nagal ≈ 0.\n(3.1)\nIn this Section, the ≈ sign will mean that the difference between the left-hand side and the\nright-hand side of an equation is much less than the characteristic MOND acceleration a0 .\nNext, we are going to the laboratory system with the help of\nagal ≈ a1 (t) + ω × (ω × (r + r1 )) + a2 ,\n\n(3.2)\n\nwhere a1 is the acceleration of the Earth's centre with respect to the heliocentric reference\nframe, ω is the angular velocity of the Earth's rotation, a2 is the Sun's acceleration with\nrespect to S0 ; r is the position of the test body with respect to the laboratory reference\nframe; r1 is the position vector of the origin of the lab frame with respect to the terrestrial\n4\n\n\fframe with the origin at the Earth's centre3 . A number of terms have not been written\nout in Eq. (3.2) on account of their smallness. They include terms due to: the Coriolis\nacceleration of the Sun, the length-of-day (LOD) variation, precession and nutation of the\nEarth's rotation axis, polar motion and Chandler's wobble (see Table 1 for their approximate\nmagnitudes).\nTABLE I: Accelerations that can be ignored.\nSource\n\nApproximate magnitude, m/s2\n\n\"Galactic Coriolis\"\n\n2 × 10−11\n\nshort period LOD variation\n\n3 × 10−12\n\nannual LOD variation\n\n1 × 10−13\n\nprecession\n\n2 × 10−14\n\nsecular increase of LOD\n\n3 × 10−15\n\nnutation (main term, epoch 1900,0)\n\n9 × 10−20\n\nChandler's wobble\n\n1 × 10−20\n\nannual pole motion\n\n4 × 10−21\n\nsecular polar motion\n\n3 × 10−24\n\nFrom Eq. (3.1) and Eq. (3.2) we obtain the necessary and sufficient condition for realisation of the MOND regime in the laboratory:\nas (t) + ω × (ω × r1 ) ≈ 0,\n\n(3.3)\n\nwhere I have introduced as = a1 + a2 for convenience and put r = 0 (without loss of\ngenerality).\nWe note that this equation has no solutions unless as is orthogonal to ω, so we must first\nlook for those instants tp when\nask (tp ) ≈ 0 or ask (tp )| \u001c a0 ,\n\n(3.4)\n\nwhere ask = (as ω)/ω. A continuity argument shows that this equation has at least 2\nsolutions during each year. Indeed, at the instant of a (nothern) summer solstice ask > 0\nwhereas at the instant of a winter solstice ask < 0. Therefore, there must be at least one\ninstant during autumn and one instant during spring when ask = 0 exactly. Neglecting\nthe effects due to the Moon and planets, these instants would coincide exactly with the\nautumnal and vernal equinoxes. In reality, the instants will be shifted from the equinoxes.\nHowever, the above 'existence theorem' guarantees that these instants tp can be found with\n3\n\nAs practical, high-precision realizations of these intermediate frames one can take the International Celestial Reference System (ICRS) [5] and the International Terrestrial Reference System (ITRS) [6].\n\n5\n\n\fastronomical precision through a straightforward but time-consuming procedure using the\nlunar and planetary ephemerides. In addition, one can show that the off-equinox shift, in\nany case, should be less than a few days.\nOnce tp is found and plugged into Eq. (3.3), the corresponding solution for the laboratory\nlocation is\nas (tp )\nr1⊥ =\n.\n(3.5)\nω2\nThis key relation allows us to find both the latitude and the longitude of the right spot.\nIf we again ignore the lunar and planetary effects, the relevant magnitude is |as (tp )| '\n0.00593 m s−2 which gives the required latitude φ ' ±79o 500 . As for the longitude, it would\ngenerally vary from year to year. For instance, on the autumnal equinox of September 22,\n2008 these spots would be at 56o W-one in Greenland, (79o 500 N), another in Antarctica\n(79o 500 S). Predictions for the years 2008-2019 are shown in Table 2. The dates and times\nof the equinoxes are taken from Ref. [7].\nThe account of lunar perturbation can significantly change the longitude, but the latitude\nprediction is much more robust: it would not change by more than ∼ 60 , or 10 km.\n\nIV.\n\nTHE GENERAL PICTURE OF MOTION\n\nThe signature of the SHLEM effect would be a spontaneous displacement of the test\nbody occurring around the instant tp defined by Eq. (3.4), and we are now ready to start\ncalculating its magnitude. The qualitative scenario runs as follows: around the instant tp the\ntest body and the reference body move according to two different laws of motion. Roughly\nspeaking, MOND makes the test body to 'lose' its mass while the the reference body keeps\nits normal mass (because it lies outside of the MOND regime). Therefore the test body will\nshift with respect to the reference body by a tiny but non-zero, time-dependent distance\nx(t).\nThroughout the paper I will work in the 'Earth-Sun' approximation in which the corrections due to the Moon and planets are ignored. A question arises: how would account of\nthese corrections change the results? As was shown previously [3], the time and location of\nthe SHLEM event can change slightly, but the effect itself will survive because its existence\nis based on topological arguments.\nAnother worry is whether we can use Newtonian, not modified inertia mechanics to\ncalculate the instant tp [30]. To address this, we note that this calculation rests on the fact\nthat the motion of the Earth as a whole obeys the Newtonian mechanics. Of course, within\nthe MOND approach this is not absolutely true. Moreover, the approach developed in [3]\nand here allows one to calculate the MOND corrections to the value of tp as precisely as\none wishes. However, these corrections appear to be so tiny that they can be completely\nneglected even without their precise calculation. Indeed, they would, in any case, include\nthe suppressing factor of MM ON D /MEarth where MM ON D is the mass of the part of the Earth\n6\n\n\fTABLE II: Longitudes of the 'SHLEM spots' calculated in the 'Earth-Sun' approximation.\nDate\n\nTime (UT)\n\nLongitude\n\n2008 Mar 20\n\n5:48\n\n93◦ E\n\n2008 Sept 22\n\n15:44\n\n56◦ W\n\n2009 Mar 20\n\n11:44\n\n4◦ E\n\n2009 Sept 22\n\n21:18\n\n139◦ 300 W\n\n2010 Mar 20\n\n17:32\n\n83◦ W\n\n2010 Sept 23\n\n3:09\n\n132◦ 450 E\n\n2011 Mar 20\n\n23:21\n\n170◦ 150 W\n\n2011 Sept 23\n\n9:04\n\n44◦ E\n\n2012 Mar 20\n\n5:14\n\n101◦ 300 E\n\n2012 Sept 22\n\n14:49\n\n42◦ 150 W\n\n2013 Mar 20\n\n11:02\n\n14◦ 300 E\n\n2013 Sept 22\n\n20:04\n\n121◦ W\n\n2014 Mar 20\n\n16:57\n\n74◦ 150 W\n\n2014 Sept 23\n\n2:29\n\n142◦ 450 E\n\n2015 Mar 20\n\n22:45\n\n161◦ 150 W\n\n2015 Sept 23\n\n8:20\n\n55◦ E\n\n2016 Mar 20\n\n4:30\n\n112◦ 300 E\n\n2016 Sept 22\n\n14:21\n\n35◦ 150 W\n\n2017 Mar 20\n\n10:28\n\n23◦ E\n\n2017 Sept 22\n\n20:02\n\n120◦ 300 W\n\n2018 Mar 20\n\n16:15\n\n63◦ 450 W\n\n2018 Sept 23\n\n1:54\n\n151◦ 300 E\n\n2019 Mar 20\n\n21:58\n\n149◦ 300 W\n\n2019 Sept 22\n\n13:30\n\n22◦ 300 W\n\naffected by MOND.\nThe MOND-affected mass can be (generously) bounded from above as follows\n< 2RE sin φ(vr δt)2 ρE ,\nMM ON D ∼\n\n(4.1)\n\nwhere RE , ρE , and vr are the Earth radius, density, and linear rotation speed at the latitude\nφ ≈ 80o . The time scale δt was defined in [3] as\nδt ∼ (a0 /as )(4\u000f/T )−1 ∼ 1 s\nwhere \u000f = 23o 270 = 0.41, T = 1 yr.\n\n7\n\n(4.2)\n\n\fAltogether, the suppressing factor is\n< 10−10 ,\nMM ON D /MEarth ∼\n\n(4.3)\n\nwhich means that for the purposes of calculating the SHLEM instant and coordinates of the\nSHLEM spot, the Newtonian mechanics can be used quite safely.\nV.\n\nEQUATION OF MOTION\n\nWe start by working in an inertial reference frame S0 first. Denote by f the total physical\nforce acting on the unit mass. Then the MOND equation of motion is\nf = r̈μ(|r̈|/a0 ).\n\n(5.1)\n\nAlthough the present treatment can be used with any interpolating function μ, to obtain\na definite result one needs to fix its concrete form; the standard choice has been [1, 11, 12]\nμ(z) = √\n\nz\n.\n1 + z2\n\n(5.2)\n\nIt is a matter of current debate [9, 10] whether this function satisfies the constraints derived\nfrom the precision solar system data [8]. In any case, a new function can only be introduced\nafter a reanalysis of the galactic rotation curves and a corresponding reestimate of the\nacceleration scale a0 . (For instance, it would be inconsistent to use a new interpolating\nfunction with the old value of a0 .) For this reason, at the moment we have no choice for μ\nother than (5.2), and it will be used from now on.\nSolving Eq. (5.1) for r̈ we obtain\nr̈ = f Φ(f 2 /a20 ),\nwhere\n\n(5.3)\n\nv\nq\nu\nu1 + 1 + 4\nt\nζ\n\n.\n(5.4)\n2\nNext, we go into the laboratory reference frame by adding the non-inertial accelerations\nfin :\nr̈ = f Φ(f 2 /a20 ) + fin .\n(5.5)\nΦ(ζ) =\n\nTo obtain a more specific equation, let us make simplifying assumptions similar to those\nusually made when analyzing the response of the gravitational wave detectors (these assumptions will be justified in the next Section when the solution of the equation of motion\nis obtained):\n-the body interacts with its environment (such as a support, suspension etc.) through\nan elastic force with negligible dissipation:\nfel = −ω02 r.\n8\n\n(5.6)\n\n\f-random forces (e.g., due to thermal and vibrational noises) are ignored.4\n-the test body is treated as a point mass, i.e., we ignore a small variation of f over its\nvolume.\n-terms of the second and higher order in the small parameter ω(t − tp ) are neglected.\n-displacement of the reference body is negligible. (The reference body is the body that\nplays the role of the origin of the laboratory reference frame. For example, in interferometers\nthe reference body is one of the mirrors.)\nTherefore, the total physical force will consist of the sum of gravitational forces and the\nelastic coupling:\nX\nf=\nfgr + fel = fΣgr − ω02 r,\n(5.7)\nand the resulting equation of motion will take the form:\nr̈ + ω02 rΦ = fΣgr Φ + fin .\n\n(5.8)\n\nLet us now introduce the following coordinate system within the laboratory reference frame:\nx is the West-to-East axis, y -the South-to-North axis, and z is the vertical axis. Then in\nour approximation the projection of the above equation on these axes will give\nẍ + ω02 xΦ ' f (t)Φ − f (t), ÿ ' 0, z̈ ' 0,\n\n(5.9)\n\nf (t) ' as ω(t − tp ), Φ ' Φ[(f − ω02 x)2 /a20 ].\n\n(5.10)\n\nwhere\nThus we can ignore motion along y and z axes and our problem becomes one-dimensional.\n\nVI.\n\nSOLUTION OF THE EQUATION OF MOTION\n\nThe obtained non-linear equation of motion is best solved numerically. But first we need\nto fix the frequency ω0 = 2πf0 . It is determined by the suspension design: for example,\nf0 = 0.65 Hz in the case of LIGO5 . Therefore, ω0 = 4.1 s−1 will be used.\nAt present there is some uncertainty in the magnitude of a0 , the fundamental parameter of\nthe theory. For instance, in Refs. [11] and [12] it was found that a0 = (1.5±0.7)×10−10 m s−2\nand a0 = (1.35 ± 0.51) × 10−10 m s−2 , respectively.6 Because of that, we will first assume\nthat a0 = 2 × 10−10 m s−2 and then repeat the calculation with a0 = 1.2 × 10−10 m s−2 and\na0 = 1 × 10−10 m s−2 .\n4\n\n5\n6\n\nThe account of these would require a detailed knowledge of the experimental setup. If a gravitational-wave\ntype of detector is considered, the account can be made using methods developed in that area.\nVIRGO has a very close frequency: f0 = 0.60 Hz.\nRef. [12] also quotes a slightly different value: a0 = (1.21 ± 0.27) × 10−10 m s−2 . It is obtained if one\noutlier galaxy is removed from the sample on the basis of a possible error in the determination of its\ndistance. The value a0 = 1.2 × 10−10 m s−2 is generally assumed in the literature.\n\n9\n\n\fFIG. 1: Displacement of the mirror as function of time. The instant tp corresponds to t = 16 s.\n\nThe resulting solution for a0 = 2 × 10−10 m s−2 is shown in Fig. 1. The displacement\namplitude has a maximum of ' 3.8 × 10−14 m. This maximum is reached ' 0.76 s after the\nSHLEM instant tp .\nHaving obtained the solution we can now fully justify the assumptions made earlier while\nderiving the equation of motion. First, the damping can indeed be completely neglected\ngiven that the relevant quality factor is Q = few × 103 [22].\nSecondly, the linear time dependence in f (t) can only be used for 'short' times t so that\nω(t − tp ) \u001c 1, where ω is the Earth's angular velocity. In other words, the time intervals\nmust be much less than 24 h/2π ' 4 hours. For our solution this condition obviously holds\nby a wide margin.\nThirdly, the neglect of transverse motion is justified by the same condition ω(t − tp ) \u001c 1.\nFourthly, let us confirm that the size of the mirror does not matter. Indeed, the difference\nin centrifugal accelerations that act on the mirror edges is\n∆a = as\n\nx\n,\nRE cos φ\n\n(6.1)\n\nwhere x is the distance between edges, RE is the Earth's radius and φ - the lab latitude.\nIn the case of LIGO, depending on the mirror orientation, x can take the values of 9.3 cm\n(the mirror thickness) or 25 cm (the mirror diameter). To ensure that this difference is\ninsignificant we must require that it be less than the 'driving force' f (t) = as ω(t − tp ) in\nEq. (5.9). It is easy to check that this requirement is always fulfilled except during a very\nshort interval\n\u0012\n\u0013\nx\nx\n−3\n∆t ∼\n∼ 3 × 10\ns\n(6.2)\nRE ω cos φ\n25 cm\n10\n\n\faround tp . But the contribution of this interval to the total displacement of the mirror is\nquite negligible as can be seen from Fig. 1. This justifies our treatment of the mirror as a\nmass point.\nFinally, we can check if the displacement of the second (reference) mirror can be neglected.\nAt the SHLEM latitude φ ≈ 80o the Earth rotates with a linear speed of vr = RE ω cos φ ≈ 80\nm/s (eastward). This means that the SHLEM spot runs on the Earth's surface with the\nsame speed (westward). Thus, if a reference mirror is farther than 80 m from the test mirror,\nthen the reference mirror's motion can be neglected during an observation interval of about\n1 s around the SHLEM instant tp . Otherwise (i.e., if the distance is shorter than 80 m or\nthe observation interval is longer than 1 s) the motion of the reference mirror must be taken\ninto account. In that case, the signal will be equal to the difference between the two mirrors'\ndisplacements.\nNow, it is of interest to see how sensitive is the obtained solution to the variation of\na0 . If we use the value a0 = 1 × 10−10 m s−2 instead of a0 = 2 × 10−10 m s−2 then the\nmaximum of the displacement amplitude will drop to ' 0.95 × 10−14 m (i.e., by a factor\nof 4). Finally, if the currently favored value a0 = 1.2 × 10−10 m s−2 is used, the maximum\nwill be at ' 1.4 × 10−14 m. In all cases considered, it takes approximately the same time\n(' 0.76 s counting from the SHLEM instant tp ) to reach the maximum.\nVII.\n\nEXPERIMENTAL CONSIDERATIONS\n\nA variety of approaches to the experimental searches for the modified inertia effects have\nbeen proposed in Ref. [3]. Because we want to detect a tiny displacement/acceleration, it\nis natural to turn to the vast and vigorous area of gravitational experiments. In particular,\nit was pointed out that the existing gravitational wave detectors could be a good starting\npoint in designing the experiment.7\nAt present, there are 2 types of gravitational wave facilities: the interferometers and\nresonators. The interferometers are generally more sensitive. So it is reasonable to start our\ndiscussion with them8 .\nThe most sensitive of the currently operating interferometers are LIGO and Virgo [15–\n18]. The heart of such a detector is a suspended mirror whose position can be monitored\nwith an ultrahigh accuracy δl ∼ 10−18 m. This is achieved by using a Michelson-type of\ninterferometer with a long arm length: L = 4 km and L = 2 km for LIGO, or L = 3 km\nfor Virgo. The detector's sensitivity is determined by the dimensionless ratio δl/L ∼ 10−21\nwhich can be translated into the dimensionless amplitude of a detectable gravitational wave.\n7\n\n8\n\nRecently, an analog of the SHLEM effect for the satellites' motion was considered by McCulloch [13]\nstarting from a different way of modifying inertia [14].\nThe resonant detectors can be analysed in a similar way, but technically there are some differences which\nwill not be considered here.\n\n11\n\n\fIn some respects, the expected SHLEM signal would be similar to the signal expected from\na gravitational wave. However, there is a crucial difference between the two. The SHLEM\nsignal is characterized by dimensional quantity-displacement of the test body δl-rather\nthan a dimensionless ratio δl/L.\nAs a consequence, having long arm length L is unnecessary for us as it does not affect\nthe detector sensitivity to the SHLEM signal. This opens up an interesting opportunity of\nconsidering a 'short-arm LIGO/Virgo-like' detector that would be based on the same ideas\nand technical know-how as LIGO/Virgo themselves, but would have a much smaller size\nthat would allow it to be more easily transported and installed in a required location.\nIn other words, we can imagine a setup that would be similar to LIGO/Virgo, but with a\nmuch shorter arm length (as is the case for TAMA300 [20], GEO [21], or ACIGA/AIGO [19],\nwhere the respective arm lengths are about 300 m, 600 m, and 80 m). LIGO's Prototype\nInterferometer on the Caltech campus has even a shorter arm length of 40 metres.9\nIt is quite possible that additional effort would be required to ensure that the shorter\narm-length does not compromize the overall sensitivity of the detector. For example, the\nissue of high laser power in a short arm would have to be carefully analyzed. At this stage,\nthough, it seems premature to go deeper into these details.\nTo assess the future potential of an interferometer setup, we have to take into account\nthe plans [22] to upgrade both LIGO and Virgo in the near future. The second generation\ndetectors (Enhanced LIGO and Virgo+) will have their sensitivities increased two- or threefold by 2009. At the next stage (Advanced LIGO, Advanced Virgo, 2014) the increase of\nsensitivity will be ten-fold. Further, the third generation underground detectors, such as the\nEinstein gravitational-wave Telescope (E.T.), are currently under active discussion.\nThus it does not seem unrealistic to think that a suitable laboratory based on the\nLIGO/Virgo technology can be conceived in which the position of the mirror can be monitored with an accuracy sufficient for detecting the SHLEM effect.\nIn that case, how should one analyze the data? Because of a similarity between a SHLEM\nsignal and a gravitational wave, the approach to this problem could be similar to that used\nin Refs. [23–29]. In particular, the paper [29] by the joint LIGO-Virgo working group gives\na detailed analysis of various statistical procedures aimed at detecting gravitational wave\nbursts using LIGO and Virgo facilities. As an input, astrophysical calculations are used\nwhich give the waveforms and amplitudes of signals corresponding to different sources.\nSince the distance, position, and nature of the source are not known in advance, one has\nto take into account many possibilities which lead to considerable uncertainty in the input\ndata. By contrast, in our case, the input is unique: it is as if someone were able to predict\n9\n\nA lower bound on the arm length would be set by the desirability to keep the second mirror unaffected by\nSHLEM. As discussed at the end of Sec. VI, one way to do this is to make the distance between mirrors\nlarge enough. It is hard to work out the precise lower bound in advance because it would depend on the\norientation of the arm and other unknowns.\n\n12\n\n\feverything about the burst–the source, its distance, right ascension and declination, and\neven the exact time of the burst. It makes the statistical analysis rather more certain and\nrobust compared to the analysis required by a largely uncertain gravitational burst.\nThe complete information about the profile of the signal in our case is contained in\nEq. (5.9) and Fig. 1 that give the time-dependence of the test body's displacement. If one\nis interested in the signal spectrum, it can be obtained from the same equation.\nBased on this information, the candidate filters can be constructed via methods similar\nto those employed in Ref. [23–29]. Their performance can then be tested using simulations\nwith the signal shape known from Eq. (5.9) and Fig. 1 and thus the optimal filter can be\nselected.\nAs is well known, the coincidence of signals in different detectors plays an important role\nin the strategies of the gravitational wave searches. In our case, various coincidence and\nanticoincidence schemes can be conceived due to the strict localization of the effect in time\nand space. For example, one can use the scheme in which the first detector is placed in the\nSHLEM spot in the northern hemisphere while the second detector is located symmetrically\nin the southern hemisphere.\nWe can therefore hope that the chances of detecting the SHLEM signal could be better\nthan the chances of detecting a gravitational wave burst of a similar magnitude.\nBecause the effect can only be observed at high latitudes, a question can be raised [30]\nif icebergs floating in the ocean nearby (say, D ' 10 km away) can trigger false alarms by\ncreating an excess of gravity of the order of a0 .\nTo assess this possibility, we note that the short time scale of the effect needs to be\ntaken into account. Namely, to create a false alarm, external source must provide a variable\ngravity: its variation δgnet over the interval δt ∼ 1 s must be of the order of a0 . Here gnet\nis the net excess gravity which the difference between the gravity due to the ice and the\n'negative' gravity due to the displaced water:\ngnet = gice − gwater ' gice\n\nd\nD\n\n!2\n\n' gice\n\nh\nD\n\n!2\n\n,\n\n(7.1)\n\nwhere d is the distance between the centers of mass of the ice and the displaced water, h is\nthe hight of the above-water tip of the iceberg. The exact relation between d and h depends\non the iceberg's shape. For instance, a cubic shape gives d = h/2. As we will see shortly,\nthe 'shape factor' would not greatly affect the final result so d ∼ h will be assumed.\nNext, suppose that the iceberg's velocity is v. Then during the time δt it will shift by\nthe distance δD ∼ vδt relative to the lab. That will lead to gravity variation of the order of\n|δgnet | ∼\n\nGM h2\nGM h2\nδD\n∼\nvδt.\nD5\nD5\n\n(7.2)\n\nRequiring |δgnet | ∼ a0 leads to the following condition:\nM h2 v\na0\n∼\n.\n5\nD\nGδt\n13\n\n(7.3)\n\n\fTherefore, the iceberg mass, tip height, and velocity must satisfy\nM h2 v ' 3 × 1020 kg m3 s−1 .\n\n(7.4)\n\nSuch parameters appear to be unrealistically large. Indeed, a very large iceberg would have\na mass of about M ∼ 1011 kg, with h ∼ 100 m [31] so the product M h2 v falls short by\nseveral orders of magnitude. Thus icebergs cannot trigger false alarms.\n\nVIII.\n\nCONCLUSIONS\n\nAstrophysically inspired laboratory-based experiments such as dark matter searches have\nbecome a common part of the physics landscape. The laboratory tests of MOND is a much\nneeded, complementary activity. It is a new virgin territory waiting to be explored.\nThis paper shows that methods and installations used in the gravitational wave research\nare likely to be useful also in the new area of searching for modified inertia and the SHLEM\neffect.\nHelpful discussions with L.A.Ignatieva, V.A.Kuzmin, M.E.Shaposhnikov, and H.S.Zhao\nare gratefully acknowledged.\nI am also thankful to E.Adelberger, P.Ball, O. Bertolami, J.Cartwright, D.Castelvecchi,\nE.Gallo, J.Lucentini, M.Marquit, Z.Merali, and O.M.Moreschi for their interest in the subject matter and stimulating comments.\n\n[1] M. Milgrom, Astrophys. J. 270, 365 (1983); ibid. 270, 371 (1983); ibid. 270, 384 (1983);\nAnn. Phys. 229, 384 (1994); Phys. Lett. A 253, 273 (1999); arXiv: astro-ph/0510117; arXiv:\nastro-ph/0801.3131.\n[2] S. McGaugh's website http://www.astro.umd.edu/∼ssm/mond/.\n[3] A. Yu. Ignatiev, Phys. Rev. Lett. 98, 101101 (2007), arXiv:gr-qc/0612159.\n[4] J. H. Gundlach et al., Phys. Rev. Lett. 98, 150801 (2007).\n[5] http://aa.usno.navy.mil/faq/docs/ICRS doc.html#REFS.\n[6] http://itrf.ensg.ign.fr.\n[7] http://aa.usno.navy.mil/data/docs/EarthSeasons.php.\n[8] E. V. Pitjeva, Astron. Lett. 31, 340 (2005); Sol. System Res. 39, 176 (2005).\n[9] M. Sereno and Ph. Jetzer, Mon. Not. R. Astron. Soc. 371, 626 (2006), arXiv: hep-ph/0606197.\n[10] L. Iorio, arXiv: gr-qc/0711.2791.\n[11] M. Milgrom, Astrophys. J. 333, 689 (1988); S. M. Kent, Astron. J. 93, 816 (1987).\n[12] K. G. Begeman, A. H. Broeils, and R. H. Sanders, Mon. Not. R. Astron. Soc. 249, 523 (1991).\n[13] M. E. McCulloch, arXiv: astro-ph/0712.3022.\n[14] M. E. McCulloch, Mon. Not. R. Astron. Soc. 376, 338 (2007), arXiv: astro-ph/0612599.\n\n14\n\n\f[15] B. Abbott et al. (The LIGO Scientific Collaboration), Class. Quantum Grav. 23, S653 (2006).\n[16] S. Waldman (on behalf of the LIGO Scientific Collaboration), Talk at HEP 2007 Conference\n(Manchester, July 19-25, 2007).\n[17] F. Acernese et al. (The Virgo Collaboration), Class. Quantum Grav. 24, S381 (2007).\n[18] E. Tournefier (for the Virgo Collaboration), Talk at HEP 2007 Conference (Manchester, July\n19-25, 2007).\n[19] C. Zhao et al., J. Phys.: Conf. Ser. 32, 368 (2006).\n[20] D. Tatsumi et al., Class. Quantum Grav. 24, S399 (2007).\n[21] B. Willke (for the LIGO Scientific Collaboration), Class. Quantum Grav. 24, S389 (2007).\n[22] G. Losurdo, Talk at HEP 2007 Conference (Manchester, July 19-25, 2007).\n[23] B. Abbott et al. (The LIGO Scientific Collaboration), Phys. Rev. D 69, 102001 (2004).\n[24] B. Abbott et al. (The LIGO Scientific Collaboration), Phys. Rev. D 72, 062001 (2005).\n[25] B. Abbott et al. (The LIGO Scientific Collaboration), Class. Quantum Grav. 23, S29 (2006).\n[26] B. Abbott et al. (The LIGO Scientific Collaboration), Class. Quantum Grav. 24, 5343 (2007).\n[27] F. Acernese et al. (The Virgo Collaboration), Class. Quantum Grav. 23, S197 (2006).\n[28] F. Acernese et al. (The Virgo Collaboration), Class. Quantum Grav. 24, S415 (2007).\n[29] F. Beauville et al. (The joint LSC/Virgo working group), arXiv:gr-qc/0701026.\n[30] P. Ball, Nature, 446, 357 (2007).\n[31] International Ice Patrol website http://www.uscg.mil/lantarea/iip/faq/icebergs\n\n15\n\n\f"}