{"id": "http://arxiv.org/abs/1102.4814v2", "guidislink": true, "updated": "2012-03-28T19:53:11Z", "updated_parsed": [2012, 3, 28, 19, 53, 11, 2, 88, 0], "published": "2011-02-23T18:37:17Z", "published_parsed": [2011, 2, 23, 18, 37, 17, 2, 54, 0], "title": "Wick Theorem for General Initial States", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1102.4506%2C1102.4890%2C1102.3527%2C1102.4715%2C1102.2152%2C1102.1367%2C1102.2359%2C1102.0680%2C1102.0021%2C1102.2646%2C1102.1340%2C1102.5436%2C1102.1371%2C1102.1119%2C1102.2200%2C1102.4560%2C1102.1257%2C1102.2729%2C1102.2627%2C1102.2675%2C1102.3814%2C1102.5321%2C1102.4077%2C1102.4532%2C1102.1707%2C1102.1517%2C1102.5400%2C1102.2808%2C1102.5504%2C1102.4353%2C1102.5397%2C1102.5216%2C1102.1758%2C1102.5602%2C1102.5066%2C1102.0681%2C1102.4527%2C1102.2364%2C1102.4126%2C1102.3824%2C1102.2855%2C1102.3732%2C1102.5402%2C1102.3899%2C1102.2478%2C1102.0878%2C1102.2233%2C1102.4757%2C1102.3863%2C1102.4760%2C1102.5096%2C1102.2616%2C1102.2838%2C1102.2377%2C1102.1629%2C1102.2020%2C1102.0343%2C1102.4390%2C1102.4706%2C1102.3721%2C1102.3564%2C1102.2061%2C1102.1085%2C1102.3454%2C1102.5730%2C1102.4361%2C1102.1984%2C1102.5286%2C1102.0081%2C1102.5157%2C1102.2622%2C1102.3828%2C1102.5351%2C1102.3890%2C1102.1167%2C1102.1879%2C1102.1035%2C1102.4028%2C1102.3815%2C1102.1693%2C1102.2194%2C1102.1264%2C1102.1049%2C1102.3105%2C1102.1710%2C1102.3014%2C1102.5751%2C1102.2969%2C1102.4254%2C1102.1677%2C1102.3862%2C1102.3858%2C1102.4814%2C1102.2191%2C1102.5257%2C1102.3577%2C1102.0152%2C1102.5138%2C1102.2669%2C1102.4127%2C1102.0622&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Wick Theorem for General Initial States"}, "summary": "We present a compact and simplified proof of a generalized Wick theorem to\ncalculate the Green's function of bosonic and fermionic systems in an arbitrary\ninitial state. It is shown that the decomposition of the non-interacting\n$n$-particle Green's function is equivalent to solving a boundary problem for\nthe Martin-Schwinger hierarchy; for non-correlated initial states a one-line\nproof of the standard Wick theorem is given. Our result leads to new\nself-energy diagrams and an elegant relation with those of the imaginary-time\nformalism is derived. The theorem is easy to use and can be combined with any\nground-state numerical technique to calculate time-dependent properties.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1102.4506%2C1102.4890%2C1102.3527%2C1102.4715%2C1102.2152%2C1102.1367%2C1102.2359%2C1102.0680%2C1102.0021%2C1102.2646%2C1102.1340%2C1102.5436%2C1102.1371%2C1102.1119%2C1102.2200%2C1102.4560%2C1102.1257%2C1102.2729%2C1102.2627%2C1102.2675%2C1102.3814%2C1102.5321%2C1102.4077%2C1102.4532%2C1102.1707%2C1102.1517%2C1102.5400%2C1102.2808%2C1102.5504%2C1102.4353%2C1102.5397%2C1102.5216%2C1102.1758%2C1102.5602%2C1102.5066%2C1102.0681%2C1102.4527%2C1102.2364%2C1102.4126%2C1102.3824%2C1102.2855%2C1102.3732%2C1102.5402%2C1102.3899%2C1102.2478%2C1102.0878%2C1102.2233%2C1102.4757%2C1102.3863%2C1102.4760%2C1102.5096%2C1102.2616%2C1102.2838%2C1102.2377%2C1102.1629%2C1102.2020%2C1102.0343%2C1102.4390%2C1102.4706%2C1102.3721%2C1102.3564%2C1102.2061%2C1102.1085%2C1102.3454%2C1102.5730%2C1102.4361%2C1102.1984%2C1102.5286%2C1102.0081%2C1102.5157%2C1102.2622%2C1102.3828%2C1102.5351%2C1102.3890%2C1102.1167%2C1102.1879%2C1102.1035%2C1102.4028%2C1102.3815%2C1102.1693%2C1102.2194%2C1102.1264%2C1102.1049%2C1102.3105%2C1102.1710%2C1102.3014%2C1102.5751%2C1102.2969%2C1102.4254%2C1102.1677%2C1102.3862%2C1102.3858%2C1102.4814%2C1102.2191%2C1102.5257%2C1102.3577%2C1102.0152%2C1102.5138%2C1102.2669%2C1102.4127%2C1102.0622&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We present a compact and simplified proof of a generalized Wick theorem to\ncalculate the Green's function of bosonic and fermionic systems in an arbitrary\ninitial state. It is shown that the decomposition of the non-interacting\n$n$-particle Green's function is equivalent to solving a boundary problem for\nthe Martin-Schwinger hierarchy; for non-correlated initial states a one-line\nproof of the standard Wick theorem is given. Our result leads to new\nself-energy diagrams and an elegant relation with those of the imaginary-time\nformalism is derived. The theorem is easy to use and can be combined with any\nground-state numerical technique to calculate time-dependent properties."}, "authors": ["R. van Leeuwen", "G. Stefanucci"], "author_detail": {"name": "G. Stefanucci"}, "author": "G. Stefanucci", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1103/PhysRevB.85.115119", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1102.4814v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1102.4814v2", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "9 pages, 5 figure; extended version published in Phys. Rev. B", "arxiv_primary_category": {"term": "cond-mat.stat-mech", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cond-mat.stat-mech", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "hep-th", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1102.4814v2", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1102.4814v2", "journal_reference": "Phys. Rev. B 85, 115119 (2012)", "doi": "10.1103/PhysRevB.85.115119", "fulltext": "Wick Theorem for General Initial States\nR. van Leeuwen1, 2 and G. Stefanucci3, 4, 2\n\narXiv:1102.4814v2 [cond-mat.stat-mech] 28 Mar 2012\n\n1\n\nDepartment of Physics, Nanoscience Center, FIN 40014, University of Jyväskylä, Jyväskylä, Finland\n2\nEuropean Theoretical Spectroscopy Facility (ETSF)\n3\nDipartimento di Fisica, Università di Roma Tor Vergata,\nVia della Ricerca Scientifica 1, 00133 Rome, Italy\n4\nIstituto Nazionale di Fisica Nucleare, Laboratori Nazionali di Frascati, Via E. Fermi 40, 00044 Frascati, Italy\nWe present a compact and simplified proof of a generalized Wick theorem to calculate the Green's\nfunction of bosonic and fermionic systems in an arbitrary initial state. It is shown that the decomposition of the non-interacting n-particle Green's function is equivalent to solving a boundary problem\nfor the Martin-Schwinger hierarchy; for non-correlated initial states a one-line proof of the standard\nWick theorem is given. Our result leads to new self-energy diagrams and an elegant relation with\nthose of the imaginary-time formalism is derived. The theorem is easy to use and can be combined\nwith any ground-state numerical technique to calculate time-dependent properties.\nPACS numbers: 05.30.-d,71.10.-w,05.70.Ln\n\nI.\n\nINTRODUCTION\n\nThe theory of Green's functions is probably the most\npowerful and versatile formalism in physics. Due to its\ngenerality it has found widespread applications in any\nbranch of physics dealing with many-particle systems\nsuch as in nuclear physics, condensed matter physics and\natomic and molecular physics. The key of its success\nlies in the possibility of expanding the dressed (interacting) n-particle Green's function Gn in terms of the bare\n(non-interacting) Green's functions gm , m ≥ n, which\nare then reduced to an (anti)symmetrized product of g1\nby means of the Wick theorem.1 In his memorable talk in\n1948 Feynman showed how to represent the cumbersome\nWick expansion in terms of physical insightful diagrams,\nand since then the Feynman diagrams became an invaluable tool in many areas of physics.\nThe standard Green's function formalism (GFF) is,\nhowever, applicable to non-degenerate systems initially\nin their ground state and cannot be straightforwardly\napplied to systems with more general initial states or to\nsystems with degenerate ground states. This leaves out\nmodern fields of research like, e.g., non-equilibrium phase\ntransitions,2 relaxation dynamics of ultracold gases,3 response of nanoscale systems in non-equilibrium steadystates,4 optimal control theory,5 etc. The correct description of initial correlations is obviously crucial for the\nshort-time dynamics of general quantum systems such as\nin transient dynamics in quantum transport4,6 or in the\nstudy of atoms and molecules in external laser fields.7,8\nIn the case of finite systems it is clear that initial correlations also affect the long-time dynamics due to the\npresence of discrete quantum numbers. However, also\nin extended systems initial correlations can have infinite\nmemory when the underlying Hamiltonian is integrable.\nThis has, for instance, recently been demonstrated for\ninteraction quenches9–14,16 and quantum transport15 in\nLuttinger liquids. Another case in which the standard\nGFF is problematic, even for equilibrium properties, is\nthat of systems with degenerate ground states such as in\n\nopen shell atoms or molecules. These systems are ubiquitous in quantum chemistry but the standard Wick theorem can only deal with the highest spin- or angular momentum component of a multiplet.17 There is therefore\na clear need to go beyond the standard GFF.\nIn 1975 Hall18 used the textbook expansion of timeordered products of operators into normal-ordered products and contractions to extend the Wick theorem to\narbitrary initial states. Although the general structure is\noutlined there, the calculations of the various prefactors\nis very laborious as it requires the explicit determination\nof the sign of all possible permutations of the 2m indices\nof the gm 's. Further progress was made in the classic\nreview of Danielewicz19 in which it was shown that one\ncan deal with arbitrary initial states by introduction of an\nextended Keldysh contour with an additional imaginary\ntrack on which the initial density matrix is represented as\nthe exponential of an, in general, n-body operator. This\nwas worked out further in detail by Wagner20 who derived the Feynman rules for the Green's function involving diagrams with arbitrary n-body correlators. Later\nthe approach was used by Mozorov and Röpke21 to derive\nquantum kinetic equations with arbitrary initial correlations. Furthermore Bonitz and co-workers have presented\nalternative derivations of the equations of motion of the\nnon-equilibrium Green's functions with arbitrary initial\ncorrelations using functional derivative techniques and\napplied them to study the decay of initial correlations in\nan electron gas.22 Recent work has further explored how\nan initial density matrix on the extended Keldysh contour can be related to diagrammatic expansions on the\nstandard Keldysh contour.23\nThe aim of the present work is to extend these developments in three different ways. First of all, we recognize that the generalized Wick theorem is simply the\nsolution of the coupled system of differential equations\nfor the gm 's, the so called Martin-Schwinger hierarchy\n(MSH),24 with proper boundary conditions. This completely avoids the introduction of normal-ordered products or contractions and therefore greatly simplifies the\n\n\f2\nmathematics. In particular the standard Wick theorem\nfollows as a one-line proof. Secondly, our reformulation\nbased on an initial value problem allows us to prove that\nthe generalized Wick expansion has a form identical to\nthat of a Laplace expansion for permanents/determinants\n(for bosons/fermions). Consequently, the calculation of\nthe various prefactors is both explict and greatly simplified. We provide a systematic way to express the gm in\nterms of g1 and of the initial k-particle density matrices,\nk ≤ m. The latter encode all the necessary information\non the initial state and are completely determined by it.\nWhen the initial state is a permanent/determinant of single particle states the gm is expressed solely in terms of\nthe g1 (standard Wick theorem). Novel terms, instead,\nappear for initially correlated or entangled states. Such\nterms have a simple diagrammatic representation and\nare easier to evaluate if compared to standard diagrams.\nThirdly, we discuss the relation between GFF based on\nthe generalized Wick theorem and GFF as formulated\non the extended Keldysh contour. These two approaches\nare complementary: the former requires the knowledge\nof the initial state while the latter requires the knowledge of the Hamiltonian with such initial state as the\nground state. Clearly the convenience of using one approach or the other depends on the information at hand.\nWe present a straightforward proof of the existence of a\nDyson equation for general initial states and derive an\nexact mathematical relation between its self-energy and\nthe self-energy of GFF on the extended Keldysh contour.\n\nII.\n\nTHE STANDARD GREEN'S FUNCTION\nFORMALISM\n\nLet us briefly review under which circumstances the\nWick theorem can be used to calculate the n-particle\nGreen's function Gn . Consider a system in the state |Ψi\nat time t0 and evolving according to the time-dependent\nSchrödinger equation with Hamiltonian Ĥ(t). At this\nstage the state |Ψi is a general many-body state and\ndoes not have to be the ground state of Ĥ(t0 ). We write\n\nof the GFF are the n-th particle Green's functions\nGn (1 . . . n; 1′ . . . n′ )\nn\no\n1\n†\n†\n= n hΨ|T ψ̂H (1) . . . ψ̂H (n)ψ̂H\n(n′ ) . . . ψ̂H\n(1′ ) |Ψi,\ni\n(3)\nwhere T is the time-ordering operator, the subscript \"H\"\ndenotes the Heisenberg picture and the short-hand notation 1 = (x1 , t1 ), 1′ = (x′1 , t′1 ) etc. has been introduced. The n-body Green's function gives a complete\ndescription of n-body correlations in a many-particle system. If we write the evolution operator as Û (t, t0 ) =\nÛ0 (t, t0 )F̂ (t, t0 ), where Û0 is the non-interacting evolution operator, then F̂ is the evolution operator in the\ninteraction picture and fulfills\ni\n\nd\nF̂ (t, t′ ) = ŴI (t)F̂ (t, t′ )\ndt\n\nwith boundary condition F̂ (t, t) = 1 (the subscript \"I\"\ndenotes the interaction picture). Consequently, we can\nrewrite Gn (omitting its arguments) as\nn\nR∞\n1\nGn = n hΨ|F̂ (t0 , ∞)T e−i −∞ dt̄ ŴI (t̄) ψ̂I (1) . . . ψ̂I (n)\ni\no\n× ψ̂I† (n′ ) . . . ψ̂I† (1′ ) F̂ (−∞, t0 )|Ψi\n(5)\nThe Wick theorem applies to the gm 's, i.e., the timeordered product of field operators in the interaction picture averaged over a non-interacting state |Φ0 i. Thus to\nexpress Gn in terms of the gm 's Eq. (5) needs to be further manipulated. Let us choose |Φ0 i as the ground state\nof Ĥ0 = Ĥ0 (t0 ) and construct the Hamiltonian\nĤ M = Ĥ0 + Ŵ M\n\n(1)\n\nwhere\nĤ0 (t) =\n\nZ\n\ndx ψ̂ † (x)h(x, t)ψ̂(x)\n\n(2)\n\n(6)\n\nwith ground state |Ψi.25 According to the Gell-Mann and\nLow theorem26,27 the state |Ψi (for a more mathematical discussion on the precise conditions see Refs. 28,29)\ncan be reached from |Φ0 i by adiabatically turning on the\ninteraction Ŵ M . Then,\n|Ψi = F̂ M (t0 , −∞)|Φ0 i,\n\nĤ(t) = Ĥ0 (t) + Ŵ (t),\n\n(4)\n\n(7)\n\nwhere F̂ M fulfills equation (4) with Ŵ → Ŵ M e−η|t−t0 |\nand η an infinitesimal positive constant. Equation (7)\nalso implies that we can reach the state |Ψi (up to a\nphase factor26,27 ) with a backward propagation in time\nand hence\n|Ψi = eiα F̂ M (t0 , ∞)|Φ0 i,\n\n(8)\n\n†\n\nis quadratic in the field operators ψ̂(x) and ψ̂ (x) (here\nx is a one-body quantum number like, e.g., the positionspin coordinate); this decomposition is arbitrary as Ĥ0 (t)\ncan be any one-body operator. The remaining term Ŵ (t)\nwill often be a two-body operator describing interactions\nbetween the particles, but can in fact be a general n-body\noperator with any time-dependence. The basic quantities\n\nExploiting these results the Green's function Gn in equation (5) takes the form\nGn =\n\n∞\ne−iα + n −i R−∞\ndt̄ ŴI (t̄)\nhΦ0 |T e\nψ̂I (1) . . . ψ̂I (n)\nin\no\n\n× ψ̂I† (n′ ) . . . ψ̂I† (1′ ) |Φ−\n0 i,\n\n(9)\n\n\f3\n\nt0\n+ branch\n\ntf\n\n- branch\n\nγ\n\n[i∂zk − h(k)]gm =\n\n8\n\nti\n\nfulfill the non-interacting MSH24\n\n[−i∂zj′ − h(j ′ )]gm =\n\nFIG. 1: The original Keldysh contour. The contour time\nz = t± lies on the ± branch at a distance t from the origin.\nThe end-points are ti = t0− and tf = t0+ .\n\nwhere\nM\n|Φ±\n0 i = F̂ (±∞, t0 )F̂ (t0 , ±∞)|Φ0 i.\n\n(10)\n\nIn most textbooks the interaction Ŵ (t) = Ŵ is timeindependent and |Ψi = |Ψ0 i is the ground state of\nM\nĤ = Ĥ(t0 ); then |Φ±\n= Ŵ . In\n0 i = |Φ0 i since Ŵ\nthis case we can expand the exponent in equation (9)\nin powers of ŴI , express Gn in terms of the noninteracting m-particle Green's functions gm 's with m ≥ n and in\nturn the gm 's in terms of g1 using the Wick theorem.30 To\nthe contrary if the interaction is time-dependent and/or\n|Ψi 6= |Ψ0 i, the standard Wick theorem is of no use to\ncalculate Gn . Our aim is therefore to lift these restrictions in a generalized version of Wick's theorem which\ncan be applied to general initial states for both equilibrium and non-equilibrium systems.\nIII.\n\nGENERALIZED WICK THEOREM\n\nReading the time-arguments in equation (5) from right\nto left it is natural to design the Keldysh contour31 γ of\nFig. 1 and define the generalized Green's function\nn\nR\n1\nGn = n hΨ|Tγ e−i γ dz̄ ŴI (z̄) ψ̂I (1) . . . ψ̂I (n)\ni\no\n× ψ̂I† (n′ ) . . . ψ̂I† (1′ ) |Ψi,\n(11)\n\nwith Tγ the contour-ordering operator and 1 = (x1 , z1 ),\n1′ = (x′1 , z1′ ) etc. collective indices with times z's on the\ncontour. The new Gn coincides with the time-ordered\none of Eq. (5) when all contour-times lie on the upper\nbranch. Expanding the exponent in powers of ŴI , the\nKeldysh Gn can be written as the sum of integrals over\nnon-interacting Keldysh Green's functions\ngm (1 . . . m; 1′ . . . m′ )\nn\no\n1\n= m hΨ|Tγ ψ̂I (1) . . . ψ̂I (m)ψ̂I† (m′ ) . . . ψ̂I† (1′ ) |Ψi\ni\n(12)\nwhere m > n. For these functions a generalized Wick\ntheorem will now be derived.\nFrom the equations of motion of the field operators ψ̂I\nand ψ̂I† it follows immediately that the gm in Eq. (12)\n\nm\nX\n\n(±)k+j δ(k, j ′ )gm−1 (k̆; j̆ ′ ),\n\nj=1\nm\nX\n\n(±)k+j δ(k, j ′ )gm−1 (k̆; j̆ ′ ), (13)\n\nk=1\n\n′\n\nwhere δ(k, j ) = δ(xk , x′j )δ(zk , zj′ ), h is the one-body\nHamiltonian of Eq. (2) and the upper/lower sign refers\nto bosons/fermions. Here and in the following the symbol \"  ̆ \" over the indices specifies the missing indices of\ngm . Thus for instance g3 (1̆; 2̆′ ) = g3 (23; 1′ 3′ ). It is worth\nnoting that Eqs. (13) constitute a system of recursive\nrelations since gm can be calculated from the sole knowledge of gm−1 . The solution for gm depends, of course, on\nthe boundary conditions that we impose. The boundary\nconditions for gm follow directly from its definition (12)\nΓm (x1 . . . xm ; x′1 . . . x′m )\n= (±i)m lim\n′\n\nzk ,zj →ti\n\ngm (1 . . . m; 1′ . . . m′ )\n(14)\n\n′\nwith z1 < . . . < zm < zm\n< . . . < z1′ (from now on\nlimzk ,zj′ →ti will always be taken in such order) where ti\nis the initial time of Fig. 1 and\n\nΓm (x1 . . .xm ; x′1 . . . x′m )\n= hΨ|ψ̂ † (x′1 ) . . . ψ̂ † (x′m )ψ̂(xm ) . . . ψ̂(x1 )|Ψi\n(15)\nis the initial m-body density matrix describing the initial m-body correlations. One can readily verify by\nexpanding along a row or a column that the permanent/determinant\ngm (1 . . . m; 1′ . . . m′ ) =\n\ng(1; 1′ ) . . . g(1; m′ )\n..\n..\n.\n.\ng(m; 1′ ) . . . g(m; m′ )\n\n≡ |g|m\n\n±\n\n(16)\n\nof one-particle Green's functions g ≡ g1 is a solution\nof Eq. (13). However, in general the solution (16)\nwill not satisfy the boundary conditions (14). This will\nonly happen when the m-particle density matrix Γm of\nequation (15) is averaged over a non-interacting state\n|Ψi = |Φ0 i. Note that this result constitutes a one-line\nproof of the standard Wick theorem which, in our formulation, amounts to solving a boundary problem for the\nMSH.\nFor arbitrary initial states |Ψi the particular solution\n(16) must be supplied with the additional solution g̃m of\nthe homogeneous equations\n[i∂zk − h(k)]g̃m = 0\n\n(17)\n\nand its adjoint to satisfy the boundary conditions. For\nillustrative purposes we first consider the examples of g2\n\n\f4\nand g3 . The most general solution of Eqs. (13) for m = 2\nreads\ng2 = |g|2 + g̃2 .\n\nlim\n\ng̃2 (12; 1′ 2′ ) = (∓i)2 C2 (x1 x2 ; x′1 x′2 )\n\n2\n\n1\n\n1'\n1\n\n2\n\n3\n\n1\n\n2\n\n3\n\n2'\n\n1\n\n2\n\n(a)\n\n3\n\n+\n−\n1' 2' 3'\n\n1\n\n1\n\n1 2\n\n2\n\n3\n\n2\n\n3\n\n+\n\n+\n1 2\n\n3\n\n+\n1' 2'\n1\n\n+\n\n3'\n\n3'\n\n3\n\n1 2\n\n3\n\n+\n−\n\nC2\n\nC2\n\n1' 2'\n\n3'\n\n1 2\n\n1 2\n\n3\n\n1\n\n3\n\n3\n\n+\n\nC2\n\n+\n−\n\n1' 2'\n\n1' 2' 3'\n\n3'\n\n1\n\nC2\n\n3\n\n1' 2'\n\n1' 2'\n\n2 3\n\n2\n\n1' 2' 3'\n\n+\n−\n\nC2\n\n1\n\n+\n−\n\n1' 2' 3'\n\n1' 2' 3'\n\nand Γ ≡ Γ1 the one-particle density matrix. The limit\nin Eq. (19) is now independent of the time-ordering in\nwhich the limit is taken. The same applies to all functions g̃m defined by Eq. (17), i.e., their limit is defined\nindependent of the time-ordering taken. We can express\ng̃2 in terms of g and C2 as follows. The spectral function\non the contour\n\u0002\n\u0003\nA(1; 1′ ) ≡ i g > (1; 1′ ) − g < (1; 1′ )\n\n1'\n\n1' 2' 3'\n\n+\n\n(20)\n\n2\nC2\n\n2'\n\n+\n−\n\nwith the correlation function\nC2 ≡ Γ2 − |Γ|2\n\n1\n\n+\n1'\n\n2'\n\ng3 =\n\n(19)\n\n2\n\n+\n−\n\ng2 =\n\n(18)\n\nBeing a homogeneous solution, g̃2 = g2 − |g|2 is not discontinuous when a contour-time zk passes through zj′ ,\nwhich implies that the discontinuity of g2 is compensated\nby an identical discontinuity in |g|2 . The initial value of\ng̃2 is fixed by the boundary conditions (14) for g2 and g\nand reads\nzk ,zj′ →ti\n\n1\n\n2 3\n\n1'\n\n2' 3'\n\n1\n\n+\n\nC2\n\n1'\n\nC2\n\n1' 2'\n\n3'\n2 3\n\n1\n\n+\n\nC2\n\n+\n−\n\nC2\n\n1' 2'\n\n3'\n\n2\n\n2' 3'\n\n3'\n2\n\n3\n\nC3\n\n1'\n\n2'\n\n3'\n\n(b)\n\nFIG. 2: Diagrammatic representation of g2 (a) and g3 (b).\n\n= hΨ|ψ̂I (1)ψ̂I† (1′ ) ± ψ̂I† (1′ )ψ̂I (1)|Ψi (21)\n\nsatisfies the homogeneous equations\n′\n\n′\n\n′\n\n[i∂z1 − h(1)]A(1; 1 ) = [−i∂z1′ − h(1 )]A(1; 1 ) = 0, (22)\n(hence it has no discontinuity when z1 passes through z1′ )\nand equals δ(x1 , x2 ) for z1 = z1′ . If we define\nδ− (z) ≡ δ(z, ti ) − δ(z, tf ),\n\n(23)\n\nwhere ti and tf are the end-points of the Keldysh contour\nof Fig. 1, we can write\nA(1, x′1 ti ) = i [g(1, x′1 ti ) − g(1, x′1 tf )]\nZ\n= i dz̄ g(1, x′1 z̄)δ− (z̄)\n\ng3 = |g|3 +\n\nZ\n\ndz̄ δ− (z̄)g(x1 z̄, 1′ ).\n\n(25)\n\nlim\n\nzk ,zj′ →ti\n\n(29)\n\nTherefore, introducing the time-local correlation function\non the contour\n\nit is immediate to realize that\nZ\ng̃2 (12; 1′ 2′ ) = (∓i)2 d1̄d2̄d1̄′ d2̄′ g(1; 1̄)g(2; 2̄)\n\nwith\nC3 = Γ3 −\n\n3\nX\n\n(±)k+j Γ(xk ; x′j )C2 (x̆k ; x̆′j ) − |Γ|3 . (30)\n\nk,j=1\n\n(26)\n\nγ\n\n× C2 (1̄2̄; 1̄′ 2̄′ )g(1̄′ ; 1′ )g(2̄′ ; 2′ )\n\n(28)\n\ng̃3 (123; 1′2′ 3′ ) = (∓i)3 C3 (x1 x2 x3 ; x′1 x′2 x′3 ),\n\nγ\n\nC2 (12; 1′ 2′ ) ≡ δ− (z1 )δ− (z2 )\n× C2 (x1 x2 ; x′1 x′2 )δ− (z1′ )δ− (z2′ )\n\n(±)k+j g(k; j ′ )g̃2 (k̆; j̆ ′ ) + g̃3 ,\n\nwhere the homogeneous solution g̃3 is fixed by the boundary conditions for g3 , g2 and g:\n\n32\n\nA(x1 ti , 1′ ) = −i\n\n3\nX\n\nk,j=1\n\n(24)\n\nγ\n\nand similarly\n\nprovides an explicit solution to the initial value problem\nfor g2 , i.e., it Rsatisfies Eqs.\n(17)\nR and (19). Here and in\nR\nthe following γ d1 = dx1 γ dz1 . The diagrammatic\nrepresentation of the generalized Wick theorem for g2 is\ndisplayed in Fig. 2(a); it is worth noting that for a noninteracting initial state C2 = 0 and the standard Wick\ntheorem is recovered.\nInserting g2 = |g|2 + g̃2 into Eq. (13) we find in a\nsimilar way that the general solution for g3 is\n\n(27)\n\nUsing the (anti)-symmetry of g̃2 and g̃3 one can readily\ncheck that g3 in Eq. (28) is properly (anti)-symmetric in\nthe primed and the unprimed variables. The second term\nin Eq. (28) has exactly the same structure of a generalized Laplace expansion for permanents/determinants. As\nwe shall see this is a general feature of all terms of the\n\n\f5\nexpansion of gm . Similarly to the two-particle case we\ncan define the time-local density matrix function on the\ncontour and write\nZ Y\n3\n′ ′ ′\n3\ng̃3 (123; 1 2 3 ) = (∓i)\ndk̄ g(k; k̄)\nγ k=1\n\n× C3\n\n(1̄2̄3̄; 1̄′ 2̄′ 3̄′ )\n\n3\nY\n\n′\n\n′\n\n′\n\ndj̄ g(j̄ ; j ).\n\nj=1\n\nThe diagrammatic representation of the generalized Wick\ntheorem for g3 is displayed in Fig. 2(b). For instance,\nthe second diagram of the last line in Fig. 2(b) gives\nthe contribution (±)3+2 g(3, 2′ )g̃2 (12; 1′ 3′ ) to Eq. (28).\nNote that the sign of a diagram is given by (±)nc where\nnc is the number of crossings of Green's function lines.\nAlternatively it is given by (±)nc where nc is the number\nof transpositions needed to reorder the labels k k̆ and j ′ j̆ ′\nin Eq. (28) to 123 and 1′ 2′ 3′ , as is readily checked for\nour example.\nAt this point it is not difficult to guess the solution for\ngm . Let us introduce the collective ordered indices K =\n(k1 . . . kl ), with k1 < . . . < kl and XK = (xk1 . . . xkl ),\nand define\n\n\n!\nl\nl\nY\nY\nCl (K; J ′ ) =\nδ− (zkα ) Cl (XK ; XJ′ ) \nδ− (zj′ β )\nα=1\n\nβ=1\n\n(31)\nwhere Cl (XK ; XJ′ ) is defined by the recursive relations\nCl (XK ; XJ′ ) = Γl (XK ; XJ′ ) −\n\nl−2 X\nX\n\n(±)|P +Q|\n\nn=1 P Q\n\n×\n−\n\n′\n′\n|Γ|n (XP ; XQ\n)Cn−l (X̆P ; X̆Q\n)\n′\n|Γ|l (XK ; XJ )\n\n(32)\n\nwith C2 ≡ Γ2 − |Γ|2 . In equation (32) the sum runs over\nall ordered sequences Q = (q1 . . . qn ), P = (p1 . . . pn ) with\nindices between 1 and l, and the sign is determined by\n|P + Q| ≡\n\nn\nX\n\n(qα + pα ).\n\n(33)\n\nα=1\n\nFor example, let l = 5 and n = 2 with P = (1, 4) and\nQ = (2, 4) and hence P̆ = (2, 3, 5) and Q̆ = (1, 3, 5).\n′\n= (x′2 , x′4 ) and the\nWe then have XP = (x1 , x4 ), XQ\ncomplementary collective coordinates X̆P = (x2 , x3 , x5 ),\n′\nX̆Q\n= (x′1 , x′3 , x′5 ). The corresponding term for C5 under\nthe summation sign in (32) is given by\n(±)1+4+2+4 |Γ|2 (x1 x4 ; x′2 x′4 )C3 (x2 x3 x5 ; x′1 x′3 x′5 )\n=±\n\nΓ(x1 ; x′2 ) Γ(x1 ; x′4 )\nΓ(x4 ; x′2 ) Γ(x4 ; x′4 )\n\nC3 (x2 , x3 , x5 ; x′1 , x′3 , x′5 ).\n±\n\n(34)\nWe will now prove the generalized Wick theorem:\n\n1\n\n3\n\n2\n\n4\n\n5\n\n2'\n\n3'\n\n2\n\n+\n\nC3\n\n1'\n\n1\n\n4'\n\n3\n\n4\n\n5\n\n4'\n\n5'\n\nC3\n\n5'\n\n1'\n\n2'\n\n3'\n\nFIG. 3: Diagrammatic representation of the terms of the\nexpansion (35) for m = 5 and l = 2 with P = (1, 4) and\nQ = (2, 4) corresponding to Eq. (34).\n\n- Theorem: The solution of the MSH of Eqs. (13) with\nthe boundary conditions (14) is\ngm = |g|m +\n\nm−2\nX\n\n(l)\ngm\n+ g̃m\n\n(35)\n\nl=1\n\nwhere we defined\nX\n(l)\ngm\n(K; J ′ ) ≡\n(±)|P +Q| |g|l (P ; Q′ )g̃m−l (P̆ ; Q̆′ ) (36)\nPQ\n\nand, in complete analogy with g̃2 and g̃3 ,\ng̃l (K; J ′ ) = (∓i)l\n\nZ Y\nl\n\ndk̄α g(kα ; k̄α )\n\nγ α=1\n\n× Cl (K̄; J ̄′ )\n\nl\nY\n\ndj̄β′ g(j̄β′ ; jβ′ ).\n\n(37)\n\nβ=1\n\nEquations (35)-(37) give a complete solution of the initial value problem for the MSH for both equilibrium and\nnonequilibrium systems. The only input is the initial mbody correlations incorporated in Γm . Let us make some\n(l)\nadditional remarks. The function gm is the sum of all\npossible diagrams with a single correlation block Cm−l in\nwhich m − l Green's function lines enter and leave, multiplied by l separate Green's function lines. For instance,\nfor m = 5 and l = 2 the term of the sum in Eq. (35)\nwith P = (1, 4) and Q = (2, 4) has the diagrammatic\nrepresentation in Fig. 3 and corresponds to Eq. (34).\nThe sign of the diagrams is (±)nc where nc equals the\nnumber of crossings (in Fig. 3 nc = 3 for the first diagram and nc = 6 for the second diagram). Although the\ngeneral structure of gm was outlined in Refs. 18,19 our\ntheorem contains a precise statement on how to construct\nit. When |Ψi is a non-interacting product state the recursive relations in Eq. (32) yield Cl = 0, hence g̃l = 0\nand consequently gm = |g|m , i.e., we recover the standard Wick theorem,33 in agreement with the previous\ndiscussion. The generalized Wick theorem superseeds all\ncommon limitations of the standard GFF, i.e., the nondegeneracy of the ground state, the assumptions of the\nGell-Mann and Low theorem and the requirement of a\ntime-independent Hamiltonian for times t → ±∞. Finally we would like to point out that Eq. (35) has the\nstructure of the permanent/determinant of the sum of\n\n\f6\ntwo matrices A and B. Indeed according to the Laplace\nformula\n|A + B|m = |A|m +\n\nm−1\nXX\n\n+\n−\n\nG =\n\n+\n−\n\n+\n\nC2\n\n(±)|P +Q|\n\nl=1 P Q\n\n× |A|l (P ; Q)|B|m−l (P̆ ; Q̆) + |B|m (38)\nwhere |A|l (P ; Q) is the permanent/determinant of the\nl × l matrix obtained with the rows P and the columns Q\nof the matrix A. In the special case l = m we have P =\nQ = (1 . . . m) and hence |A|m (P ; Q) = |A|m . The same\nnotation has been used for the matrix B. With the identification Akj = g(k; j ′ ) and |B|m−l (P̆ ; Q̆) = g̃m−l (P̆ ; Q̆′ )\nfor l = 1 . . . m − 2 and the definition g̃1 ≡ 0 Eqs. (35)\nand (38) become identical. We can thus symbolically\nwrite the generalized Wick theorem as\ngm = |g + g̃|m\n\nzk ,zj →ti\n\nm−2\nXX\n\n(±)|P +Q| |Γ|l Cm−l +Cm .\n\nl=1 P Q\n\n(40)\nWriting the last term Cm as in equation (32) we see by\ninspection that all terms of the sum cancel out and the\nr.h.s. reduces to Γm . We therefore exactly satisfy the\nboundary condition (14). This concludes the proof \u0004\nIV.\n\nGENERALIZED GREEN'S FUNCTION\nFORMALISM\n\nWith our generalized Wick theorem we can now directly expand the one-particle Green's function G ≡ G1\nin powers of the interaction ŴI , see Eq. (11). In what follows we restrict the analysis to interactions which are represented by two-body operators like, e.g., the Coulomb\n\n+\n\nC2\n\n+\n−\n\nC2\n\n1\n+2\n\nC3\n\nFIG. 4: First-order expansion of G for a two-body interaction.\nThe last three diagrams vanish since both lines enter a Cl block and hence the internal time-integration can be reduced\nto a point. This is a completely general feature.\n\ninteraction. From Eq. (11) the interacting Green's function is then given by\n\n(39)\n\nwhose precise meaning is given by Eq. (35).\n- Proof: The proof consists of two steps. We first\nprove that gm satisfies the MSH. For this purpose it\n(l)\nis enough to prove the MSH for each gm since, as already noticed, the MSH is obviously satisfied by |g|m .\nWe will consider only the first of equations (13) as the\nsame reasoning applies to the second. If we act with\n(l)\n(i∂zk − h(k)) on a particular diagram of gm the result\nis zero if k is an ingoing line to a Cl -block. This follows\nimmediately from the definition (37) and Eq. (22). To\nthe contrary, if the diagram contains a free line g(k; j ′ )\n(l)\nthe result is (±)k+j δ(k, j ′ )×[a diagram for g̃m−1 (k̆; j̆ ′ )].\nP\n(l)\nThus, (i∂zk − h(k)) [all diagrams in gm containing\n(l)\n(l)\ng(k; j ′ )] = (±)k+j δ(k, j ′ )g̃m−1 (k̆; j̆ ′ ). The MSH for gm\nfollows from this relation when summing over all j. Taking into account that (i∂zk − h(k))g̃m = 0 we conclude\nthat gm satisfies the MSH.\nNext we prove that gm has the correct boundary conditions (14). In Eq. (35) we take the limit zk , zj′ → ti .\nSince |g|l → (∓i)l |Γ|l and g̃m−l → (∓i)m−l Cm−l we find\n(±i)m gm = |Γ|m +\nlim\n′\n\nC2\n\n+\n−\n\nG(a, b) =\n\nZ\n∞\nX\n1 i k\n( )\nw(1, 1′ ) . . . w(k, k ′ )\nk! 2\nγ\n\nk=0\n\n× g2k+1 (a, 1, 1′ . . . k, k ′ ; b, 1+ , 1′+ . . . k + , k ′+ )\n(41)\nin which w(j, j ′ ) is the two-body interaction and we\nintegrate over all space-time coordinates j and j ′ for\nj = 1 . . . k. By inserting Eq. (35) into Eq. (41) we obtain a diagrammatic expansion of the interacting Green's\nfunction. For example, to first order in the interaction we\nonly need the g3 of Fig. 2. If we then take into account\nthat the disconnected pieces vanish we find that to first\norder in the interaction the Green's function is given by\nthe connected diagrams displayed in Fig. 4. In general\nthe expansion of G in powers of ŴI leads to a diagrammatic series which starts end ends with a g-line. The kernel of this expansion is therefore the reducible self-energy\n(r)\nwhich we denote by Σtot . In the case of general initial\n(r)\nstates the Σtot -diagrams contain at most one correlation\nblock and either begin and end with an interaction line\n(we call their sum Σ(r) ) or begin/end with an interaction\nline and end/begin with a correlation block (we call their\n(r)\nsum left/right reducible self-energy ΣL,R ).19 This means\nthat the general structure of the diagrammatic expansion\nis\nZ\n(r)\n(42)\nG(1; 2) = g(1; 2) + g(1; 1̄)Σtot (1̄; 2̄)g(2̄; 2)\nγ\n\n(r)\n\n(r)\n\n(r)\n\nwhere Σtot = Σ(r) + ΣL + ΣR and34\n(r)\n\n(r)\n\nΣL (1; 2) = ΣL (1; x2 )δ− (z2 ),\n(r)\n\n(r)\n\nΣR (1; 2) = δ− (z1 )ΣR (x1 ; 2).\n\n(43)\n(44)\n\nThus the self-energy is modified by the addition of a\nleft/right reducible self-energy which is non-zero only if\nits right/left time-argument is one of the end-points of\n\n\f7\n\nt0\n+ branch\n\ntf\n\n- branch\n\n8\n\nti\n\ningredient is the appearance of the Cm -blocks which describe the initial m-body correlations.\n\nγe\n\nV. RELATION TO THE IMAGINARY TIME\nFORMALISM AND EXISTENCE OF A DYSON\nEQUATION\n\nt0 -iβ\n\nWe next discuss the relation between the above results and the imaginary-time formalism19,20 and in doing so will also generalize some recent work by Garny\nand Müller.23 The average over the state |Ψi can also\nbe computed by tracing the field operators with ρ̂(β) =\nM\nM\ne−β Ĥ /Tr[e−β Ĥ ] where β is a real positive number (inverse temperature) and then letting β → ∞. We remind the reader that Ĥ M is the Hamiltonian with |Ψi as\nground state, see Eq. (6), and can be a general n-body\noperator. This is discussed in more detail in Refs. 19–21.\nThen,\n\nFIG. 5: Extended Keldysh contour with an imaginary track\nbetween t0 and t0 − iβ. The contour time z = t± lies on\nthe ± branch at a distance t from the origin and z = t0 − iτ\nlies on the imaginary track. The end-points are ti = t0− and\ntf = t0 − iβ.\n\nthe Keldysh contour. The diagrammatic expansion of\nthese new self-energies is very similar to that of the standard GFF, as it is exemplified in Fig. 4. The only extra\n\n1 Tr[e−β Ĥ0 Tγe {e−i\nGn (1 . . . n; 1′ . . . n′ ) = n\ni\n\nwhere γe is the extended Keldysh contour of Fig. 5 and\nŴ (z) = Ŵ M for z on the imaginary track of the extended\ncontour.35,36 These new Green's functions coincide with\nthe old ones when all contour-times lie on the original\nKeldysh contour γ. The advantage of this formulation\nis that the corresponding new non-interacting Green's\nfunctions can be expanded using the standard Wick theorem, g0,m = |g0 |m , since both g0,m and g0 obey the\nKubo-Martin-Schwinger boundary conditions,24,37 i.e.,\nthey are periodic/antiperiodic in the contour-time arguments. Note that g0,m 6= gm : the former is averaged with\nρ̂0 (β) = e−β Ĥ0 /Tr[e−β Ĥ0 ] while the latter with ρ̂(β). The\nnew Green's function with both arguments on γ obeys the\nequations of motion7,19,35,36 (integral over barred variables is understood)\nZ\n[i∂z1 − h(1)]G(1, 2) = δ(1, 2) + Σe (1; 1̄)G(1̄; 2)\nγ\n\n− i\n\nZ\n\n0\n\nβ\n\nΣ⌉e (1; 1̄)G⌈ (1̄; 2),\n\nR\n\nγe\n\ndz̄ ŴI (z̄)\n\nTr[e−β Ĥ M ]\n\n(45)\n\nDyson equation on γ for general initial states. From the\nLangreth rules on γe 35 we have\nZ\nG⌈ (1; 2) = −i dx̄ GM (1; x̄t0 )GA (x̄t0 ; 2)\n+ [GM ⋆ Σ⌈e * GA ](1; 2).\n\n(47)\n\nIn this equation GR/A (1; 2) = ±θ(±t1 ∓ t2 )[G> (1; 2) −\nG< (1; 2)] is the retarded/advanced Green's function, GM\nis the Matsubara Green's function with both arguments\non the imaginary track, and we used the short-hand notation \"⋆\" for convolutions between t0 and t0 −iβ and \"*\"\nfor convolutions between t0 and ∞. Inserting this result\ninto the last term of Eq. (46) and taking into account\nthat for any function f (xt± ) = f (xt) it holds\nZ ∞\nZ\ndx̄dt̄f (x̄t̄)GA (x̄t̄, 2),\n(48)\nf (1̄)G(1̄; 2) =\nγ\n\nt0\n\nwe find\n\n(46)\n\nand its adjoint, where Σe is the standard self-energy, i.e.,\nthe same as in Wagner work,20 with internal integrals\nover all space and contour-times on γe . In Eq. (46) the\nsymbol \"⌉\" specifies that the first contour argument lies\non γ and the second on the imaginary track; the opposite\nis specified by \"⌈\".35,36 We will now derive an elegant\n(r)\nrelation between Σe and the reducible self-energy Σtot ,\nrelation which will be used to prove the existence of a\n\nψ̂I (1) . . . ψ̂I (n)ψ̂I† (n′ ) . . . ψ̂I† (1′ )}]\n\nwhere\n\n[i∂z1 − h(1)]G(1; 2) = δ(1; 2)\n\u0011\ni\nh\u0010\n+ Σe + Σ⌉e ⋆ GM ⋆ Σ⌈e + Σe,L * G (1; 2), (49)\nΣe,L (1; 2) = −i[Σ⌉e ⋆ GM ](1; x2 t0 )δ− (z2 ).\n\n(50)\n\nSimilarly for the adjoint equation we have\n[−i∂z2 − h(2)]G(1; 2) = δ(1; 2)\n\u0011i\nh\n\u0010\n+ G * Σe + Σ⌉e ⋆ GM ⋆ Σ⌈e + Σe,R (1; 2), (51)\n\n\f8\nwith\nΣe,R (1; 2) = δ− (z1 )i[GM ⋆ Σ⌈e ](x1 t0 ; 2).\n\n(52)\n\nInserting this expansion into Eq. (55) we obtain a Dyson\nequation in which the irreducible self-energy depends\nonly on g and correlation blocks.\n\nGiven the self-energy and the Green's function with arguments on the imaginary track we can regard Eqs. (49)\nand (51) as the equations of motion for G with arguments\non γ. To integrate these equations we cannot use the noninteracting Green's function g0 which satisfies the KuboMartin-Schwinger relations as the point t0 − iβ does not\nbelong to γ. However we can use the non-interacting\nGreen's function g of Eq. (12) since it satisfies\nlim\n\nz1 ,z2 →ti\n\ng(1; 2) =\n\nlim\n\nz1 ,z2 →ti\n\nG(1; 2) = Γ(x1 ; x2 ).\n\n(54)\n\nwe can write the following Dyson equation on γ (integral\nover barred variables is understood)\nZ\nG(1; 2) = g(1; 2) + g(1; 1̄)Σtot (1̄; 2̄)G(2̄, 2).\n(55)\nγ\n\nComparing now this equation with (42) we deduce an\n(r)\nimportant relation between the reducible self-energy Σtot\nwritten in terms of correlation blocks and the irreducible\nself-energy Σtot written in terms of integral over the\nimaginary track\n(r)\n\nΣtot = Σtot + Σtot gΣtot + Σtot gΣtot gΣtot + . . .\n\n(56)\n\nThis relation constitute a bridge between two different\nand complementary approaches [each built to optimize\nthe nature (density matrix or Hamiltonian) of the initial\ninformation] and give a deep insight in the physics of\ninitial correlations. Indeed we can now express Σtot in\n(r)\nterms of Σtot to obtain an irreducible self-energy in terms\nof correlation blocks. From Eq. (56) we have\n(r)\n\nΣtot = Σtot\n\n1\n1 − gΣtot\n\n(57)\n\nand hence\n(r)\n\nΣtot = Σtot (1 − gΣtot )\n(r)\n\n(r)\n\n(r)\n\n(r)\n\n(r)\n\n(r)\n\n= Σtot − Σtot gΣtot + Σtot gΣtot gΣtot − . . . (58)\n\n1\n2\n3\n\n4\n\n5\n\nSOME APPLICATIONS AND\nCONCLUSIONS\n\n(53)\n\nThus if we define the total self-energy as\nΣtot = Σe + Σ⌉e ⋆ GM ⋆ Σ⌈e + Σe,L + Σe,R\n\nVI.\n\nG. C. Wick, Phys. Rev. 80, 268 (1950).\nG. Odor, Rev. Mod. Phys. 76, 663 (2004).\nM. A. Cazalilla and M. Rigol, New J. Phys. 12, 055006\n(2010).\nP. Myöhänen, A. Stan, G. Stefanucci and R. van Leeuwen,\nEPL 84, 67001 (2008).\nC. Brif, R. Chakrabarti and H. Rabitz, New J. Phys. 12,\n\nThe rules to expand the Green's function around any\ninitial state constitute a powerful theoretical tool and the\nrange of applicability can be vaster than we can imagine\nat present. Possible applications are in quantum chemistry where spin-degenerate ground-states are ubiquitous\nwhile the standard Wick theorem can only cope with the\nhighest spin component. The generalized Wick theorem\nis not limited to determinantal states thereby permitting\nto resolve the spin-multiplet properties. This versatility\ncan be used in the context of quantum entanglement as\nwell. Another application is in the formalism of the rate\nequations which gives rise to negative time-dependent\nprobabilities when the standard Wick theorem is applied\nto initially correlated states. Corrections with the Cl blocks should result in an improved theory. The generalized Wick theorem also allows us to address the effect\nof integrability-breaking perturbations using the exact\nGreen's function of the integrable model. More generally the generalized Wick theorem can be combined with\nany ground-state numerical technique to calculate timedependent properties. Indeed from the ground-state density matrix we can calculate the non-equilibrium Green's\nfunction to any order in the interaction strength.\nThe practical implementation of the generalized Wick\ntheorem is no more difficult than the standard Wick theorem. We expect that the generalized Wick theorem will\nbe useful in a broad range of physical problems both in\nand out of equilibrium. We wish to conclude by observing that even though all derivations in this work pertain\nto Green's functions defined as averages over an initial\nstate the generalization to Green's function defined as\nensemble averages is straightforward and no extra complications arise.\n\n6\n\n7\n\n8\n\n075008 (2010).\nP. Myöhänen, A. Stan, G. Stefanucci and R. van Leeuwen,\nPhys. Rev. B 80, 115107 (2009).\nN. E. Dahlen and R. van Leeuwen, Phys. Rev. Lett. 98,\n153004 (2007).\nK. Balzer, S. Bauch and M. Bonitz, Phys. Rev. A 82,\n033427 (2010)\n\n\f9\n9\n10\n11\n\n12\n13\n\n14\n\n15\n16\n\n17\n\n18\n19\n20\n21\n22\n\n23\n\n24\n\nM. A. Cazalilla, Phys. Rev. Lett. 97, 156403 (2006).\nE. Perfetto, Phys. Rev. B. 74,205123 (2006).\nA. Iucci and M. A. Cazalilla, Phys. Rev. A 80, 063619\n(2009).\nG. S. Uhrig, Phys. Rev. A 80, 061602(R) (2009).\nZhou Zong-Li and Lou Ping, Commun. Theor. Phys. 51\n1139 (2009).\nB. Dóra, M. Haque and G. Zaránd, Phys. Rev. Lett. 106,\n156406 (2011).\nE. Perfetto and G. Stefanucci, EPL 95, 10006 (2011).\nE. Perfetto, G. Stefanucci and M. Cini Phys. Rev. Lett.\n105, 156802 (2010).\nL. S. Cederbaum and J. Schirmer, Z. Physik 271, 221\n(1974).\nA. G. Hall, J. Phys. A: Math. Gen. 8, 214 (1975).\nP. Danielewicz, Ann. Phys. (N.Y.) 152, 239 (1984).\nM. Wagner, Phys. Rev. B 44, 6104 (1991).\nV. G. Mozorov and G. Röpke, Ann. Phys. 278, 127 (1999).\nD. Semkat, D. Kremp, and M. Bonitz, Phys. Rev. E 59,\n1557 (1999).\nM. Garny and M. M. Müller, Phys. Rev. D 80, 085011\n(2009).\nP. C. Martin and J. Schwinger, Phys. Rev. 115, 1342\n\n25\n\n26\n\n27\n\n28\n29\n\n30\n\n31\n32\n33\n\n34\n\n35\n\n36\n37\n\n(1959).\nWe are implicitly assuming that the ground state is nondegenerate.\nA. L. Fetter and J. D. Walecka, Quantum theory of manyparticle systems (McGraw-Hill, New York) (1971).\nE. Runge, E. K. U. Gross and O. Heinonen, Many-particle\ntheory (Adam Hilger, Bristol) (1991).\nG. Nenciu and G. Rasche, Helv. Phys. Acta 62, 372 (1989).\nC. Brouder, G. Panati and G. Stoltz, Ann. Henri Poincare\n10, 1285 (2010).\nA similar expansion of the (infinite) phase factor cancels\nall disconnected diagrams.\nL. V. Keldysh,\nJETP 20, 1018 (1965).\nR\nR\nNote ∂z1 γ dz̄g(1, x′1 ti )δ− (z̄) 6= γ dz̄∂z1 g(1, x′1 ti )δ− (z̄).\nDue to the time integration along γ the disconnected diagrams vanishes automatically.\nNote that Σl (1; x) and Σr (x; 1) takes the same value for\nz1 = t1± on the two branches of the Keldysh contour.\nG. Stefanucci and C.-O. Almbladh, Phys. Rev. B 69,\n195318 (2004);\nR. van Leeuwen et al., Lect. Notes Phys. 706, 33 (2006).\nR. Kubo, J. Phys. Soc. Jpn. 12, 570 (1957).\n\n\f"}