{"id": "http://arxiv.org/abs/0906.4947v1", "guidislink": true, "updated": "2009-06-26T14:16:18Z", "updated_parsed": [2009, 6, 26, 14, 16, 18, 4, 177, 0], "published": "2009-06-26T14:16:18Z", "published_parsed": [2009, 6, 26, 14, 16, 18, 4, 177, 0], "title": "A liquid-solid critical point in a simple monatomic system", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0906.2527%2C0906.0648%2C0906.2675%2C0906.4094%2C0906.4030%2C0906.4449%2C0906.3039%2C0906.1465%2C0906.2514%2C0906.1652%2C0906.1899%2C0906.5292%2C0906.4433%2C0906.3120%2C0906.4284%2C0906.1214%2C0906.2807%2C0906.0063%2C0906.1118%2C0906.3553%2C0906.0807%2C0906.0754%2C0906.1821%2C0906.4219%2C0906.2053%2C0906.0856%2C0906.0960%2C0906.1130%2C0906.0992%2C0906.2898%2C0906.2538%2C0906.4562%2C0906.4947%2C0906.0682%2C0906.2773%2C0906.0497%2C0906.0125%2C0906.2212%2C0906.1059%2C0906.0232%2C0906.1603%2C0906.2530%2C0906.0056%2C0906.0771%2C0906.1731%2C0906.3771%2C0906.3090%2C0906.3042%2C0906.2148%2C0906.1428%2C0906.3717%2C0906.2026%2C0906.3973%2C0906.5574%2C0906.3417%2C0906.0396%2C0906.1476%2C0906.2964%2C0906.4323%2C0906.5521%2C0906.5390%2C0906.0502%2C0906.3146%2C0906.3067%2C0906.1486%2C0906.5185%2C0906.3929%2C0906.4584%2C0906.2814%2C0906.1838%2C0906.0058%2C0906.3663%2C0906.3045%2C0906.1950%2C0906.4732%2C0906.5281%2C0906.1894%2C0906.2993%2C0906.0452%2C0906.1137%2C0906.3251%2C0906.2446%2C0906.0144%2C0906.1165%2C0906.0267%2C0906.4877%2C0906.5384%2C0906.4315%2C0906.4587%2C0906.4009%2C0906.0616%2C0906.0699%2C0906.4995%2C0906.0598%2C0906.5144%2C0906.5442%2C0906.2810%2C0906.0512%2C0906.4558%2C0906.1111%2C0906.0158&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "A liquid-solid critical point in a simple monatomic system"}, "summary": "It is commonly believed that the transition line separating a liquid and a\nsolid cannot be interrupted by a critical point. This opinion is based on the\ntraditional symmetry argument that an isotropic liquid cannot be continuously\ntransformed into a crystal with a discrete rotational and translational\nsymmetry. We present here a molecular-dynamics simulation of a simple monatomic\nsystem that demonstrates a liquid-solid spinodal terminating at a critical\npoint. We show that, in the critical region, the isotropic liquid continuously\ntransforms into a phase with a mesoscopic order similar to that of the smectic\nliquid crystals. We argue that the existence of both the spinodal and the\ncritical point can be explained by the close structural proximity between the\nmesophase and the crystal. This indicates a possibility of finding a similar\nthermodynamic behaviour in gelating colloids, liquid crystals and polymers.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0906.2527%2C0906.0648%2C0906.2675%2C0906.4094%2C0906.4030%2C0906.4449%2C0906.3039%2C0906.1465%2C0906.2514%2C0906.1652%2C0906.1899%2C0906.5292%2C0906.4433%2C0906.3120%2C0906.4284%2C0906.1214%2C0906.2807%2C0906.0063%2C0906.1118%2C0906.3553%2C0906.0807%2C0906.0754%2C0906.1821%2C0906.4219%2C0906.2053%2C0906.0856%2C0906.0960%2C0906.1130%2C0906.0992%2C0906.2898%2C0906.2538%2C0906.4562%2C0906.4947%2C0906.0682%2C0906.2773%2C0906.0497%2C0906.0125%2C0906.2212%2C0906.1059%2C0906.0232%2C0906.1603%2C0906.2530%2C0906.0056%2C0906.0771%2C0906.1731%2C0906.3771%2C0906.3090%2C0906.3042%2C0906.2148%2C0906.1428%2C0906.3717%2C0906.2026%2C0906.3973%2C0906.5574%2C0906.3417%2C0906.0396%2C0906.1476%2C0906.2964%2C0906.4323%2C0906.5521%2C0906.5390%2C0906.0502%2C0906.3146%2C0906.3067%2C0906.1486%2C0906.5185%2C0906.3929%2C0906.4584%2C0906.2814%2C0906.1838%2C0906.0058%2C0906.3663%2C0906.3045%2C0906.1950%2C0906.4732%2C0906.5281%2C0906.1894%2C0906.2993%2C0906.0452%2C0906.1137%2C0906.3251%2C0906.2446%2C0906.0144%2C0906.1165%2C0906.0267%2C0906.4877%2C0906.5384%2C0906.4315%2C0906.4587%2C0906.4009%2C0906.0616%2C0906.0699%2C0906.4995%2C0906.0598%2C0906.5144%2C0906.5442%2C0906.2810%2C0906.0512%2C0906.4558%2C0906.1111%2C0906.0158&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "It is commonly believed that the transition line separating a liquid and a\nsolid cannot be interrupted by a critical point. This opinion is based on the\ntraditional symmetry argument that an isotropic liquid cannot be continuously\ntransformed into a crystal with a discrete rotational and translational\nsymmetry. We present here a molecular-dynamics simulation of a simple monatomic\nsystem that demonstrates a liquid-solid spinodal terminating at a critical\npoint. We show that, in the critical region, the isotropic liquid continuously\ntransforms into a phase with a mesoscopic order similar to that of the smectic\nliquid crystals. We argue that the existence of both the spinodal and the\ncritical point can be explained by the close structural proximity between the\nmesophase and the crystal. This indicates a possibility of finding a similar\nthermodynamic behaviour in gelating colloids, liquid crystals and polymers."}, "authors": ["Måns Elenius", "Mikhail Dzugutov"], "author_detail": {"name": "Mikhail Dzugutov"}, "author": "Mikhail Dzugutov", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1063/1.3213616", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/0906.4947v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0906.4947v1", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "cond-mat.mtrl-sci", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cond-mat.mtrl-sci", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0906.4947v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0906.4947v1", "arxiv_comment": null, "journal_reference": null, "doi": "10.1063/1.3213616", "fulltext": "A liquid-solid critical point in a simple monatomic system\n\narXiv:0906.4947v1 [cond-mat.mtrl-sci] 26 Jun 2009\n\nMåns Elenius1 and Mikhail Dzugutov2\n\n1\n\nDepartment of Numerical Analysis and 2 Dept. of Materials Science and Engineering, Royal\n\nInstitute of Technology, SE-100 44 Stockholm, Sweden\n\nAbstract\nIt is commonly believed that the transition line separating a liquid and a solid\ncannot be interrupted by a critical point. This opinion is based on the traditional\nsymmetry argument that an isotropic liquid cannot be continuously transformed into\na crystal with a discrete rotational and translational symmetry. We present here a\nmolecular-dynamics simulation of a simple monatomic system that demonstrates a\nliquid-solid spinodal terminating at a critical point. We show that, in the critical\nregion, the isotropic liquid continuously transforms into a phase with a mesoscopic\norder similar to that of the smectic liquid crystals. We argue that the existence of both\nthe spinodal and the critical point can be explained by the close structural proximity\nbetween the mesophase and the crystal. This indicates a possibility of finding a similar\nthermodynamic behaviour in gelating colloids, liquid crystals and polymers.\n\n1\n\n\f1\n\nIntroduction\n\nIn many systems, a domain of spinodal instability can be observed where a liquid\nphase coexists in equilibrium with a gas phase. The spinodal terminates at a critical\npoint1 which manifests a possibility of a continuous transformation between the two\nphases. Whether a single-component system can exhibit a spinodal where a liquid and\na crystalline solid phase coexist in equilibrium, and a respective critical point, still\nremains an unanswered question of a significant conceptual interest. A liquid-solid\ncritical point has never been observed hitherto, and its existence is commonly regarded\nimpossible based on the argument that a continuous transformation from an isotropic\nliquid to a crystal with a discrete symmetry is inconceivable.1\nHere, we report a molecular dynamics simulation of a simple monatomic system that\ndemonstrates under cooling a first-order transition from a liquid phase into a spinodal\ndomain where the liquid coexists in equilibrium with a crystalline phase. Within the\nspinodal, the relative volume occupied by the crystalline phase shrinks with density\nreduction, vanishing in the low-density limit where the spinodal is terminated by a\ncritical point. It is demonstrated that, upon cooling to the vicinity of the critical\npoint, the isotropic liquid continuously transforms into a low-density phase with a\nmesoscopic order similar to that of smectic liquid crystals.2 Furthermore, we observed\na close structural proximity between the mesophase and the crystal which extends much\nbeyond the local order of nearest neighbours. We argue that this structural peculiarity\nof the mesophase can account for the existence of both the spinodal and the critical\npoint. It also makes it possible to conjecture that a liquid-solid critical point like the\n\n2\n\n\fone we observe here might exist in liquid crystals, polymers and in gelating colloidal\nsystems.\nThe following crystallization scenario suggested by the classical nucleation theory is\ncommonly accepted. In a metastable supercooled liquid, nuclei of the lower free energy\ncrystalline phase are being spontaneously created by virtue of thermal fluctuations.\nBecause the two phases are symmetry-unrelated, appearance of a nucleus involves\ncreation of an interface. The free-energy cost of the interface blocks the growth of the\nnucleus unless the latter exceeds a critical size. In this scenario, the entire volume of\na metastable supercooled liquid rapidly crystallizes as soon as a critical nucleus has\nbeen created. The existence of a spinodal instability domain where no single phase can\nbe in a stable or metastable equilibrium implies that the interfacial free-energy barrier\nvanishes.\nIn general, there are two independent order parameters involved in a first-order\nphase transition: density and the local structural symmetry. The former controls\nfluid-fluid phase transitions where a spinodal instability domain is commonly observed,\nwhereas the latter plays the key role in crystallization of dense liquids. However, it was\npointed out that density fluctuations seen in the vicinity of a metastable liquid-liquid\nspinodal with a critical point may cause a dramatic increase of the nucleation rate,\nindicating a reduction of the interfacial barrier for crystallization.3–5 The possibility\nof a liquid-solid spinodal was also inferred from the crystallization anomalies in simple\nliquids under deep supercooling6–8 and phase transformations in atomic clusters.9–12\nIt was also predicted, based on analytic arguments, that a fluid-solid spinodal region\nmay appear in the system of hard spheres in higher dimensions13\n\n3\n\n\fA possible microscopic mechanism for the density-driven spinodal domain in the\nliquid-solid transition of a simple single-component system was conjectured by Debenedetti\net al.14 based on a lattice model. A pair potential, attractive at the nearest-neighbour\ndistance and repulsive at the second-nearest neighbour distance, was shown to induce\nlow-density open structures, associated with the liquid phase, which collapse into a\ndense solid phase under pressure. Due to a significant difference in density, the two\nphases can coexist within a spinodal domain of infinite compressibility.\n\n2\n\nSimulation details\n\nIn the present simulation study, we explore the type of the pair potential suggested in\nthe above conjecture in a molecular dynamics simulation of a single-component system.\nThe pair potential we exploit15 (denoted as Z2 in that reference) has been found to\ninduce a pronounced icosahedral local ordering of the nearest neighbours due to the\ndesign of its short-range attraction, while the repulsion incorporated in its longer-range\npart inhibits bulk packing of icosahedra. In this simulation, we used a system of 3456\nidentical particles in the NVT ensemble. All results here are presented in reduced\nsimulation units following from the definition of the pair potential.15\n\n3\n\nResults\n\nThe phase behaviour of the simulated system was explored within a wide range of\ndensities by cooling it at constant density ρ from the high-temperature isotropic liquid\nstate. The cooling was performed stepwise, with comprehensive equilibration at each\n\n4\n\n\ftemperature point. The isochoric variation of enthalpy H as a function of temperature\nT is shown in Fig. 1a. For each isochore where ρ > 0.32 we observe a discontinuity\nin H(T ) indicating a first-order freezing transition into a low-temperature state. The\nfirst-order character of this transition is confirmed by distinct hysteresis loops in the\nH(T ) isochores that are observed when the system is heated from the low-temperature\nstate towards the high-temperature liquid.\nBoth the freezing and melting temperatures derived from the isochoric enthalpy\nvariations are shown in the ρ − T phase diagram, Fig. 1b. A distinctive anomaly of\nthe observed phase transition is that the melting line and the freezing line confining\nthe metastability domain converge at ρ = 0.33 and T = 0.31. The first-order phase\ntransition apparently disappears at densities below ρ = 0.33. This is confirmed in\nFig. 1c that shows the density dependence of the latent heat ∆H of this transition.\nThat quantity reduces in an apparently linear manner with the reduction of density,\neventually vanishing at the indicated density point. Indeed, no trace of discontinuity\nor hysteresis can be discerned in the isochoric variation of enthalpy within the relevant\ntemperature interval at ρ = 0.32 presented in Fig. 1a. These observations lead to the\nconclusion that at ρ = 0.33 and T = 0.31 we observe a critical point which terminates\nthe first-order transition line.\nAnother interesting anomaly of this phase transition can be observed in the behaviour of the isothermal compressibility χT . It is related to the low-Q limit of the\nstructure factor S(Q) as χT = ρT S(0). The structure factor is defined as S(Q) =\nhρ(Q)ρ(−Q)i, where Q = |Q| and ρ(Q) is the Fourier transform of the system's den-\n\n5\n\n\fsity:\nρ(Q) =\n\nN\n1 X\nexp(−iQrk )\nN k=1\n\n(1)\n\nN being the number of particles and rk the real space location of particle k. Fig. 1d\nshows the density dependence of S(0) in the low-temperature state along the freezing\nline. Within the density interval above the estimated critical density S(0) evidently\ndemonstrates a pronounced tendency for divergence. The observed behaviour of the\nisothermal compressibility indicates the system's large-scale decomposition into domains of different density, a characteristic signature of spinodal instability. We stress\nthat this result was obtained after a thorough equilibration of the low-temperature\nstate and, therefore, cannot be regarded as a transient effect of the phase transition.\nIn order to gain an insight into the microscopic mechanism of these thermodynamic\nanomalies, we now analyse the structural aspects of the observed phase transformation\nby directly inspecting the atomic configurations of the low-temperature state. We\nnote that, to get rid of the thermal noise, all the configurations investigated here were\nsubjected to steepest-descent minimization of potential energy.\nFig. 2 depicts a set of configurations representing the system's states equilibrated at\nT immediately below the freezing transition, at different densities. At ρ = 0.5, the transition evidently produces a structure characterised by a well-defined global periodic order. This is a low-density crystalline phase with a local order apparently dominated by\ntetrahedral close packing. The central element of its unit cell is a cubically-symmetric\nconfiguration composed of eight icosahedra which are kept apart by low-dimensional\narrangements of tetrahedra. In a similar manner, low-dimensional tetrahedral bridges\nlink the described cubes into a periodic structure. To the best of our knowledge, this\n\n6\n\n\fcrystalline structure has not been reported so far. A detailed crystallographic description of this phase will be reported elsewhere.\nOther atomic configurations shown in Fig. 2 b-d represent the density domain of\ndiverging isothermal compressibility that we identified as spinodal. Within each of\nthese configurations, we are able to discern a distinct compact domain of the same\ncrystalline structure as the one observed at ρ = 0.5. These crystalline domains are\nmarked by red in the plots. The rest of the volume of the MD simulation cell outside\nthe crystalline domains is occupied by an apparently different structure that is visibly\nless dense and doesn't exhibit any immediately detectable global order. Its local order,\nhowever, appears to be quite similar to that of the crystalline structure, being dominated by the same kind of tetrahedral close packing with a high number of icosahedra\nlinked in a low-dimensional manner. The plots in Fig. 2 also demonstrate that the\nrelative volume occupied by the crystalline phase shrinks approximately linearly with\nreduction of density, eventually vanishing at the critical point. This observation is\nevidently consistent with the respective variation of the latent heat shown in Fig. 1c.\nIt demonstrates that the liquid phase can be continuously transformed into a crystal\nvia the critical point.\nWe now analyse the transformation of the liquid phase under cooling. First, we\nconsider the isochore ρ = 0.32, i.e. below the critical density. Temperature variations of\nthe specific heat CV at that density, shown in Fig. 3a, displays a pronounced maximum\nat Tm = 0.45. The density dependence of Tm is shown in the phase diagram, Fig. 1b.\nThe line of CV maximum extends to higher densities until it eventually encounters\nthe freezing transition line. The appearance of excess specific heat under cooling is\n\n7\n\n\fan indicator of the development of bonded structures, and a common precursor of\npercolation.16, 17 Indeed, a steep increase in the number of icosahedra can be observed\nbelow Tm , Fig. 3b. This leads to the development of extended clusters and a rapid\ngrowth of the correlation length, as it is demonstrated by the temperature-dependence\nof the maximum cluster size, Fig. 3b. These clusters are extended low-dimensional\nstructures composed of interconnected icosahedra and face sharing tetrahedra, like the\none exemplified in Fig. 3c. Upon further cooling, the maximum cluster size diverges,\nand at T = 0.28, a continuous tetrahedrally packed network is formed that includes\napproximately 90 % of all the atoms. An example of that network is shown in Fig. 2e.\nAnother interesting structural feature developed in this liquid state under cooling is a\nlow-Q pre-peak of S(Q), Fig. 3d. This anomaly, as well as the maximum of CV , are\ncommonly observed in the context of gelation in colloidal systems.18\nFig. 3e presents the ratio of the number of icosahedra in the high temperature state\nto the respective number in the low temperature state within the metastability domain,\nas a function of density. It indicates that, as the density is reduced, the difference\nin the local order between the two states shrinks, vanishing at the critical point. A\nconsiderable degree of local structural similarity between the liquid in the critical-point\nregion and the crystal is exemplified by the ring-like arrangement of icosahedra depicted\nin Fig. 2e. A trend for the formation of similar structural arrangement, although in a\nmore defective rudimentary form, can be detected in the higher-temperature cluster,\nFig. 3c. Moreover, the liquid exhibits an instantaneous mesoscopic-scale periodicity\nconsistent with that of the crystal. Fig. 4a shows the intensity pattern of the liquid's\nS(Q) on a sphere in the Q-space, with a radius equal to Qpp , the position of the low-Q\n\n8\n\n\fpre-peak of S(Q); Fig. 4b shows the respective pattern exhibited by the crystal on\nthe Q-sphere of the same radius. The liquid diffraction pattern shows a sizable degree\nof periodicity along two perpendicular axis, consistent with the respective periodicity\npattern in the crystal. The observed periodic order in the liquid is however limited\nin both time and space. Its dissipation in time is demonstrated in Fig. 4c where\nwe present the decay of the respective component of the density-density correllator\nF (Qpp , t) = hρ(Qpp , 0)ρ(−Qpp , t)i, for a set of temperatures. The density-correlation\npattern manifested by the pre-peak of S(Q) evidently dissipates. The relaxation time\nexhibits a strong temperature-dependence, and exceeds the timescales accessible in our\nsimulation for temperatures below T = 0.28.\n\n4\n\nDiscussion\n\nThe liquid phase formed by cooling from the high-temperature liquid at ρ = 0.32\ncan be classified as a mesophase similar to the smectic phases2 observed in polymeric\nliquids. We also mention that a liquid-crystal smectic phase interposed between the\nisotropic liquid and the crystalline solid was discussed19 as a possible scenario for the\nbond ordering in the supercooled liquid state. Both melting of such a phase and its\ntransformation to a crystal were conjectured to be continuous. The present result supports that conjecture. Another possible candidate for the observation of a liquid-solid\ncritical point may be polymers where a liquid-solid spinodal was recently observed.20\nBased on these observations, we can understand the existence of a spinodal domain\nwhere the mesophase coexists with the crystal, and the critical point considering two\n\n9\n\n\ffactors. First, there is a significant difference in density between the two coexisting\nphases. The characteristic low-density open structure of the mesophase is induced by\nthe pair potential which enforces a strong tendency for icosahedral ordering of the\nnearest neighbours while keeping the icosahedra apart due to the repulsion incorporated in its long-range part. Second, the structural proximity between the mesophase\nand the crystal that extends well beyond the nearest-neighbours' configurations can\nbe expected to greatly reduce the free-energy cost for the interface separating the two\nstructural domains. These two factors render the system unstable with respect to\ndensity fluctuations of a large spatial scale, making possible both an equilibrium coexistence of the two phases within the spinodal domain and the existence of the critical\npoint at its low-density limit. In this way, the present observation can be compared\nwith the coexistence of structurally similar liquid phases discriminated by density, and\na respective critical point observed in a simulation of a one-component system using a\npair potential with a long-range repulsion.21\nThe structural similarity between the mesoscopic liquid state formed by the present\nsystem under cooling at sub-critical density and gel-forming colloidal systems that we\nhave already mentioned deserves an additional comment. It was found22 that the appearance of spanning clusters involved in gelation in low-density systems of colloidal\nparticles with short-range interaction can be interpreted in terms of density fluctuations caused by the existence of a liquid-gas spinodal instability. A possible relation\nbetween that instability and the higher-density liquid-solid critical point we report here\nlooks quite intriguing, and deserves to be investigated in future studies. In particular,\na question of significant interest is whether the tetrahedrally-packed colloidal clusters\n\n10\n\n\fdemonstrating gelation at low densities17, 18 would at higher densities display coexistence between a disordered phase and a crystal, and a respective liquid-solid critical\npoint like the one we report here.\n\n5\n\nConclusions\n\nIn summary, the molecular dynamics simulation presented here demonstrates a novel\nkind of phase behaviour in a simple one-component system. Its phase diagram is found\nto include a spinodal domain separating a stable liquid phase and a crystalline solid\nphase where the two phases coexist in equilibrium. Moreover, it is demonstrated that\nthe spinodal terminates at a critical point. The existence of a liquid-solid critical point\nimplies that an isotropic liquid can be transformed into a crystal without crossing the\nline of first-order phase transition. We argue that the existence of both the spinodal\nand the critical point can be explained by the structural transformation of the liquid\nphase. Upon cooling towards the critical point, the liquid is found to develop a mesoscopic order, reminiscent of that in smectic liquid crystals, which demonstrates a strong\nstructural similarity with the crystalline phase. We conjecture that the observed phase\nbehaviour can be expected in other systems possessing a similar kind of mesoscopic\norder, including liquid crystals, polymers and gelating colloidal systems.\n\nAcknowledgements\nWe would like to thank Prof. F. Sciortino, Prof. D. Frenkel and Prof. D. J. Wales for\nreading the manuscript and very useful comments.\n\n11\n\n\fReferences\n[1] L. D. Landau, and E. M. Lifshitz, Statistical Physics, Oxford: Pergamon (1980)\n[2] M. A. Anisimov, Critical Phenomena in Liquids and Liquid Crystals, Gordon\nand Breach Science Publishers (1991)\n[3] P. R. ten Wolde, and D. Frenkel, Science 277, 1975-1978 (1997)\n[4] P. D. Olmsted, W. C. K. Poon, T. C. B. mcLeish, N. J. Terrill, and A. I. Ryan,\nPhys. Rev. Lett. 81, 373-376 (1998)\n[5] V. Talanquer, and D. W. Oxtoby,. J. Chem. Phys. 109, 223-227 (1998)\n[6] W. Klein, and F. Leyvraz Phys. Rev. Lett. 57, 2845-2848 (1986)\n[7] P. R. ten Wolde, M. J. Ruiz-Montero, and D. Frenkel, J. Chem. Phys. 104,\n9932-9947 (1996)\n[8] F. Trudu, D. Donadio, M. Parrinello Phys. Rev. Lett. 97, 105701-15704 (2006)\n[9] R. S. Berry, in: Strength from Weakness: Structural Consequences of Weak Interactions in Molecular, Supermolecules and Crystals, A. Domenicano and I. Hargittai (eds), Kluwer Academic Publishers 143-168 (2002)\n[10] D. J. Wales, and R. S. Berry, J. Chem. Phys. 92, 4473-4482 (1990)\n[11] D. J. Wales, and J. P. K. Doye, J. Chem. Phys. 103, 3061-3070 (1995)\n[12] E. Mendes-Villuendas, I. Saika-Voivod, J. Chem. Phys. 127, 154703-154707\n(2007)\n[13] W. Klein, and H. L. Fisch, J. Chem. Phys. 95, 968-970 (1986)\n\n12\n\n\f[14] P. G. Debenedetti, V. S. Raghavan, S. S. Borick, J. Phys. Chem. 95, 4540-4552\n(1991)\n[15] J. P. K Doye, D. J. Wales, F. H. M. Zetterling, and\nM. Dzugutov, J. Chem. Phys. 118, 2792-2799 (2003)\n[16] C. A. Angell, B. E. Richards, V. Velikov, J. Phys.: Condens. Matter 11, A75-A94\n(1999).\n[17] E. Bianchi, P. Tartaglia, E. La Nave, and F. Sciortino, J. Phys. Chem. B 111,\n11765-11769 (2007)\n[18] F. Sciortino, P. Tartaglia, and E. Zaccarelli J. Phys. Chem. B 109, 21942-21953\n(2005)\n[19] D. R. Nelson, and J. Toner, Phys. Rev. B 24, 363-387 (1981)\n[20] R. H. Gee, N. Lacevich, and L. E. Fried, Nature Materials, 5, 39-43 (2006)\n[21] G. Franzese, G. Malescio, A. Skibinsky, S. V. Buldyrev, and H. E. Stanley,\nNature, 409, 692-695 (2001)\n[22] P. J. Lu, et al. Nature 453, 499-503 (2008)\n\n13\n\n\fCaptions\n\nFigure 1\nLiquid-solid phase transformation. a. Isochoric temperature variations of the enthalpy\nH at indicated densities. Blue dots and line: cooling; red dots and line: heating. b.\nDensity-temperature phase diagram of the simulated system. Blue symbols and line:\nthe freezing transition; triangles: crystallization; circles: spinodal. Green symbols and\nline: melting transition. Red line and symbols denote maximum of CV in the liquid\nphase. MP and CP respectively abbreviate mesophase and critical point. c. Densitydependence of the latent heat ∆H for the freezing transition. d. Density-dependence\nof the estimated small-Q limit of the structure factor S(Q) at the freezing line.\n\nFigure 2\nInstantaneous configurations of the low temperature state. a. ρ = 0.5, T = 0.48. b.\nρ = 0.4, T = 0.41. c. ρ = 0.36, T = 0.36. d. ρ = 0.34, T = 0.3125. e. ρ = 0.32,\nT = 0.28. The cubic arrangement of 8 icosahedra shown separately in a represents the\ncentral element of the crystalline phase. In b-d, red colour marks crystalline domains\ncoexisting with the liquid phase. Separate plots present the same domains in a different\nprojection. In e, the configuration domain marked by red, also shown in a separate\nplot, is an arrangement of four icosahedra, with some defects, representing a rudiment\nof the crystalline structure.\n\n14\n\n\fFigure 3\nEvolution of the liquid phase under cooling. a. Temperature variation of the liquid\nspecific heat CV along the isochore ρ = 0.32. b. Temperature variation, along the\nisochore ρ = 0.32, of the number of icosahedra Ni (black) and the number of atoms\nNc in the maximum-size cluster composed of face sharing tetrahedra, scaled by the\ntotal number of atoms in the system N (blue). c. A maximum-size tetrahedral cluster\nobserved at ρ = 0.32, T = 0.34. d. Temperature variation of the structure factor S(Q).\nBlack, T = 1.10; green, T = 0.40; red, T = 0.28. e. The ratio of the number of\nicosahedra in the high temperature state, NHT , to the respective number in the low\ntemperature state, NLT , within the metastability domain, as a function of density.\n\nFigure 4\nMesoscopic-scale anisotropy in the low-temperature liquid phase. a. Intensity of the\nstructure factor S(Q) on a Q-space sphere of the radius Qpp , the position of the low-Q\npre-peak of S(Q) for a liquid configuration at ρ = 0.32, T = 0.28. b. The same plot\nas Fig. 4a but for the crystalline phase at ρ = 0.5, T = 0.48. c. The decay of the\ndensity-density correllator F (Q, t) at ρ = 0.32. Red lines: Q corresponding to the\nposition of the main peak of S(Q). Blue lines: Q = Qpp . From left to right, T = 0.30,\n0.29, 0.28, 0.27.\n\n15\n\n\fρ = 0.40\n\n0\n\n−0.5\nH\n\nρ = 0.36\n\n−1\nρ = 0.32\n−1.5\n\n0.3\n\n0.35\n\n0.4\nT\n\n1a\n\n16\n\n0.45\n\n\f0.55\n\nIsotropic Fluid\n\n0.5\n\nCrystal\n\nT\n\n0.45\n\n0.4\n\n0.35\nMP\n0.3\n\nCP\n0.35\n\n0.4\nρ\n\n1b\n\n17\n\n0.45\n\n0.5\n\n\f0.8\n0.7\n0.6\n\n∆H\n\n0.5\n0.4\n0.3\n0.2\n0.1\n0\n0.3\n\n0.35\n\n0.4\nρ\n\n1c\n\n18\n\n0.45\n\n0.5\n\n\f3\n2.5\n\nS(0)\n\n2\n1.5\n1\n0.5\n0\n0.3\n\n0.35\n\n0.4\nρ\n\n1d\n\n19\n\n0.45\n\n0.5\n\n\f2a\n\n20\n\n\f2b\n\n21\n\n\f2c\n\n22\n\n\f2d\n\n23\n\n\f2e\n\n24\n\n\f10\n9\n8\n\nC\n\nV\n\n7\n6\n5\n4\n3\n0.25\n\n0.3\n\n0.35\n\n0.4\n\n0.45\nT\n\n3a\n\n25\n\n0.5\n\n0.55\n\n0.6\n\n\f0.25\n1\n\n0.3\n\n0.35\n\n0.4\n\n0.45\n\n0.5\n\n0.55\n250\n\n200\n\n0.6\n\n150\n\n0.4\n\n100\n\n0.2\n\n50\n\nc\n\nN /N\n\n0.8\n\n0\n0.25\n\n0.3\n\n0.35\n\n0.4\n\n0.45\nT\n\n3b\n\n26\n\n0.5\n\n0.55\n\n0\n\nNumber of icosahedra\n\nClustersize\nIcosahedra\n\n\f3c\n\n27\n\n\f8\nT = 0.28\nT = 0.40\nT = 1.10\n\n7\n6\n\nS(Q)\n\n5\n4\n3\n2\n1\n0\n0\n\n5\n\n10\nQ\n\n3d\n\n28\n\n15\n\n20\n\n\f1\n0.9\n\nHT\n\nN /N\n\nLT\n\n0.8\n0.7\n0.6\n0.5\n0.4\n0.35\n\n0.4\n\nρ\n\n3e\n\n29\n\n0.45\n\n0.5\n\n\f35\n\ndegrees\n\n80\n60\n\n30\n\n40\n\n25\n\n20\n\n20\n\n0\n15\n\n−20\n−40\n\n10\n\n−60\n\n5\n\n−80\n−80 −60 −40 −20 0 20\ndegrees\n4a\n\n30\n\n40\n\n60\n\n80\n\n0\n\n\f70\n\ndegrees\n\n80\n60\n\n60\n\n40\n\n50\n\n20\n\n40\n\n0\n30\n\n−20\n−40\n\n20\n\n−60\n\n10\n\n−80\n−80 −60 −40 −20 0 20\ndegrees\n4b\n\n31\n\n40\n\n60\n\n80\n\n0\n\n\f1\n\nF(Q,t)/F(Q,0)\n\n0.8\n\n0.6\n\n0.4\n\n0.2\n\n0 0\n10\n\n2\n\n10\n\n4\n\n10\ntime\n\n4c\n\n32\n\n6\n\n10\n\n8\n\n10\n\n\f"}