{"id": "http://arxiv.org/abs/0804.2027v2", "guidislink": true, "updated": "2008-04-21T20:18:28Z", "updated_parsed": [2008, 4, 21, 20, 18, 28, 0, 112, 0], "published": "2008-04-12T19:31:52Z", "published_parsed": [2008, 4, 12, 19, 31, 52, 5, 103, 0], "title": "Quantum aspects of a noncommutative supersymmetric kink", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0804.0951%2C0804.1897%2C0804.0439%2C0804.3718%2C0804.0374%2C0804.1894%2C0804.4786%2C0804.1194%2C0804.0682%2C0804.2324%2C0804.1872%2C0804.3829%2C0804.0760%2C0804.4767%2C0804.0643%2C0804.2027%2C0804.2865%2C0804.1333%2C0804.3417%2C0804.1519%2C0804.2442%2C0804.2345%2C0804.3494%2C0804.1220%2C0804.0624%2C0804.2826%2C0804.0749%2C0804.1583%2C0804.0639%2C0804.1844%2C0804.1256%2C0804.1809%2C0804.0738%2C0804.1208%2C0804.3547%2C0804.0883%2C0804.2532%2C0804.2658%2C0804.3949%2C0804.2481%2C0804.4551%2C0804.3733%2C0804.1725%2C0804.2612%2C0804.2549%2C0804.0220%2C0804.2569%2C0804.2713%2C0804.3832%2C0804.0737%2C0804.4162%2C0804.2422%2C0804.4623%2C0804.1989%2C0804.0492%2C0804.3335%2C0804.1901%2C0804.4618%2C0804.3940%2C0804.1239%2C0804.3345%2C0804.1307%2C0804.0124%2C0804.0208%2C0804.3973%2C0804.1230%2C0804.2381%2C0804.2781%2C0804.3100%2C0804.4584%2C0804.2962%2C0804.3189%2C0804.4412%2C0804.3637%2C0804.4050%2C0804.0236%2C0804.2042%2C0804.0919%2C0804.2280%2C0804.4061%2C0804.3060%2C0804.4875%2C0804.3837%2C0804.3290%2C0804.1997%2C0804.0562%2C0804.1033%2C0804.2421%2C0804.4234%2C0804.3942%2C0804.3750%2C0804.4840%2C0804.1678%2C0804.3692%2C0804.3795%2C0804.3172%2C0804.1899%2C0804.2315%2C0804.0887%2C0804.2033%2C0804.2636&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Quantum aspects of a noncommutative supersymmetric kink"}, "summary": "We consider quantum corrections to a kink of noncommutative supersymmetric\nphi^4 theory in 1+1 dimensions. Despite the presence of an infinite number of\ntime derivatives in the action, we are able to define supercharges and a\nHamiltonian by using an unconventional canonical formalism. We calculate the\nquantum energy E of the kink (defined as a half-sum of the eigenfrequencies of\nfluctuations) which coincides with its' value in corresponding commutative\ntheory independently of the noncommutativity parameter. The renormalization\nalso proceeds precisely as in the commutative case. The vacuum expectation\nvalue of the new Hamiltonian is also calculated and appears to be consistent\nwith the value of the quantum energy E of the kink.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0804.0951%2C0804.1897%2C0804.0439%2C0804.3718%2C0804.0374%2C0804.1894%2C0804.4786%2C0804.1194%2C0804.0682%2C0804.2324%2C0804.1872%2C0804.3829%2C0804.0760%2C0804.4767%2C0804.0643%2C0804.2027%2C0804.2865%2C0804.1333%2C0804.3417%2C0804.1519%2C0804.2442%2C0804.2345%2C0804.3494%2C0804.1220%2C0804.0624%2C0804.2826%2C0804.0749%2C0804.1583%2C0804.0639%2C0804.1844%2C0804.1256%2C0804.1809%2C0804.0738%2C0804.1208%2C0804.3547%2C0804.0883%2C0804.2532%2C0804.2658%2C0804.3949%2C0804.2481%2C0804.4551%2C0804.3733%2C0804.1725%2C0804.2612%2C0804.2549%2C0804.0220%2C0804.2569%2C0804.2713%2C0804.3832%2C0804.0737%2C0804.4162%2C0804.2422%2C0804.4623%2C0804.1989%2C0804.0492%2C0804.3335%2C0804.1901%2C0804.4618%2C0804.3940%2C0804.1239%2C0804.3345%2C0804.1307%2C0804.0124%2C0804.0208%2C0804.3973%2C0804.1230%2C0804.2381%2C0804.2781%2C0804.3100%2C0804.4584%2C0804.2962%2C0804.3189%2C0804.4412%2C0804.3637%2C0804.4050%2C0804.0236%2C0804.2042%2C0804.0919%2C0804.2280%2C0804.4061%2C0804.3060%2C0804.4875%2C0804.3837%2C0804.3290%2C0804.1997%2C0804.0562%2C0804.1033%2C0804.2421%2C0804.4234%2C0804.3942%2C0804.3750%2C0804.4840%2C0804.1678%2C0804.3692%2C0804.3795%2C0804.3172%2C0804.1899%2C0804.2315%2C0804.0887%2C0804.2033%2C0804.2636&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We consider quantum corrections to a kink of noncommutative supersymmetric\nphi^4 theory in 1+1 dimensions. Despite the presence of an infinite number of\ntime derivatives in the action, we are able to define supercharges and a\nHamiltonian by using an unconventional canonical formalism. We calculate the\nquantum energy E of the kink (defined as a half-sum of the eigenfrequencies of\nfluctuations) which coincides with its' value in corresponding commutative\ntheory independently of the noncommutativity parameter. The renormalization\nalso proceeds precisely as in the commutative case. The vacuum expectation\nvalue of the new Hamiltonian is also calculated and appears to be consistent\nwith the value of the quantum energy E of the kink."}, "authors": ["D. V. Vassilevich"], "author_detail": {"name": "D. V. Vassilevich"}, "author": "D. V. Vassilevich", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1088/1126-6708/2008/05/093", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/0804.2027v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0804.2027v2", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "20 pages, v2: a reference added", "arxiv_primary_category": {"term": "hep-th", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "hep-th", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0804.2027v2", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0804.2027v2", "journal_reference": "JHEP 0805:093,2008", "doi": "10.1088/1126-6708/2008/05/093", "fulltext": "arXiv:0804.2027v2 [hep-th] 21 Apr 2008\n\nQuantum aspects of a noncommutative\nsupersymmetric kink\nD. V. Vassilevich∗\nInstituto de Fı́sica, Universidade de São Paulo,\nCaixa Postal 66318, CEP 05315-970, São Paulo, S.P., Brazil\nJanuary 12, 2019\n\nAbstract\nWe consider quantum corrections to a kink of noncommutative supersymmetric φ4 theory in 1 + 1 dimensions. Despite the presence of an\ninfinite number of time derivatives in the action, we are able to define\nsupercharges and a Hamiltonian by using an unconventional canonical formalism. We calculate the quantum energy E of the kink (defined as a\nhalf-sum of the eigenfrequencies of fluctuations) which coincides with its'\nvalue in corresponding commutative theory independently of the noncommutativity parameter. The renormalization also proceeds precisely as in\nthe commutative case. The vacuum expectation value of the new Hamiltonian is also calculated and appears to be consistent with the value of the\nquantum energy E of the kink.\n\n1\n\nIntroduction\n\nThe study of quantum corrections to solitons in 1 + 1 dimensions started in\n1970's [1–4], and since that time a considerable progress has been made (see [5]\nfor a recent review). Noncommutative (NC) solitons [6, 7] were included in these\nstudies only recently [8, 9]. The work [8] used the small θ expansion, while the\npaper [9] was concentrated on moderate and large values of the NC parameter.\nBoth papers left many questions unanswered, mostly related to the renormalization and to the possibility of a smooth extension of the results to the region of\nlarge (respectively, small) noncommutativity. Besides, in 1 + 1 dimensions one\ndeals with time-space noncommutativity which brings an infinite number of time\nOn leave from V. A. Fock Institute of Physics, St. Petersburg University, Russia. E.mail:\ndmitry(at)dfn.if.usp.br\n∗\n\n1\n\n\fderivatives into the action, so that the very definition of energy becomes less\nobvious.\nAnother line of research considers quantum corrections to supersymmetric\nsolitons [10,11]. It was found [12], that naive arguments leading to zero quantum\ncorrections to the mass of supersymmetric solitons were incorrect, and a new\nanomaly (the anomaly in the central charge [13–15]) was discovered. Taking this\nanomaly into account restores saturation of the BPS bound at the quantum level.\nIn this paper we consider quantum correction to the mass of an NC supersymmetric kink in 1 + 1 dimensions. Our motivation is twofold. First, it is interesting\nto study the interplay between supersymmetry and noncommutativity with this\nparticular example. Second, supersymmetry simplifies the structure of divergences of quantum field theory and may help to resolve some problems existing\nin the non-supersymmetric case. Practically, we adapt the methods developed\nearlier in [16] to the NC case. Supersymmetrization of the NC space-time is done\nin the most straightforward way [17–19] where only the bosonic coordinates are\ndeformed. The model we study in here is a supersymmetric extension on the NC\nφ4 model in 1 + 1 dimensions.\nIn time-space NC theories there are well-known difficulties with the construction of a canonical formalism (due to the presence of an infinite number of time\nderivatives). Besides, generically there are no locally conserved currents corresponding to global classical symmetries. Therefore, it is a priori unclear whether\none can define supercharges in such theories. However, as we show below, this\ntask can be successfully addressed in the framework of an unconventional canonical formalism [20], so that one can introduce supercharges whose brackets give\nan analog of the Hamiltonian and a central charge. The Hamiltonian has the\nmeaning of the energy integrated over an interval T of time. For a static field\nconfiguration it simply reads T E, where E is the energy. The main reason to\ncall these quantities supercharges and a Hamiltonian is that with respect to the\nnew brackets they indeed generate global supesymmetry transformations and the\nequations of motion, respectively.\nStatic solutions in NC models in (1+1) dimensions are not deformed, i.e. they\nare the same as in corresponding commutative models. The equations of motion\nfor small fluctuations above such solutions are deformed, and the fluctuations are\ndescribed by wave equations with frequency-dependent potentials. Nevertheless,\nin the model we consider, bosonic and fermionic modes are isospectral. To use all\nadvantages of the isospectrality, we employ the zeta-function regularization and\nmake the spectrum discrete by introducing boundaries in the spatial direction.\n(These boundaries are removed at the end of the calculations). The quantum\nenergy is defined as one half the sum over the eigenfrequencies. The width of the\neffective potential in the wave equations for the fluctuations with the frequency ω\nis proportional to θω, where θ is the NC parameter. To keep boundaries far away\nfrom the location of the potential we have to make the position of the boundaries\nfrequency-dependent [9]. In this approach, quantum energy of the kink is defined\n2\n\n\fas the energy of a system consisting of the kink and the boundaries minus the\n(Casimir) energy of the boundaries [16]. For the renormalization, we use the\nheat kernel subtraction scheme which was shown to be equivalent to the notadpole condition in the commutative case [16]. The divergences are removed by\na renormalization of the mass, which is precisely the same as in the commutative\ncase. The renormalized energy (mass shift of the kink) does not depend on θ and\ncoincides with its' commutative value.\nKeeping in mind future applications to the verification of the quantum BPS\nbound saturation, we also calculate quantum corrections to the new Hamiltonian.\nWe find the value T E, where E is the mass shift of the soliton. Two apparently\ndifferent definitions of the quantum energy give consistent results. Also, the\nrenormalization required for the Hamiltonian is the same mass renormalization\nwhich we described above.\nThis paper is organized as follows. In the next section we introduce a classical\naction and collect some preliminary information. In section 3 we study the new\nunconventional definition of the canonical algebra, and define supercharge, the\nHamiltonian, and the central charge. In section 4 we study the spectrum of\nfluctuations above the kink. Quantum corrections to the mass of the kink are\ncalculated in section 5, and corrections to the new Hamiltonian are considered in\nsection 6. Concluding remarks are given in section 7.\n\n2\n\nThe classical action\n\nWe shall describe noncommutativity of the space-time coordinates by the Moyal\nproduct\n\u0014\n\u0012\n\u0013\n\u0015\ni μν x y\n(f ⋆ g)(x) = exp\nΘ ∂μ ∂ν f (x)g(y)\n,\n(1)\n2\ny μ =xμ\nwhere Θμν is a constant skew-symmetric matrix which can be chosen as Θμν =\n2θǫμν with ǫ01 = 1. After splitting the coordinates into time and space, {xμ } =\n{t, x}, we have the following useful formulae\nf (x) ⋆ eiωt = eiωt f (x + θω),\n\neiωt ⋆ f (x) = eiωt f (x − θω) .\n\nThe Moyal product is closed,\nZ\nZ\n2\nd x f1 ⋆ f2 = d2 x f1 * f2 ,\nand has the property that\nZ\nZ\n2\ng1 g2\nd2 x f2 ⋆ f1 ,\nd x f1 ⋆ f2 = (−1)\n\n(2)\n\n(3)\n\n(4)\n\nwhere the grading gi = 0 if fi is bosonic, and gi = 1 if fi is fermionic. To derive the\nproperties (3) and (4) one has to integrate by parts in (1). In general, boundary\n3\n\n\fterms may appear. To avoid them, we assume that in the time direction all fields\nare periodic with a very large period which should be sent to infinity at the end.\nIn the spatial directions all fields must approach constant values sufficiently fast.\nSuch boundary conditions are satisfied by static solitons and classical variations\nof the fields which produce the equations of motion. A different set of boundary\nconditions will be used in sec. 4 to analyze quantum fluctuations.\nThe action for a supersymmetric NC φ4 model reads\nZ\n\u0001\n1\nd2 x (∂μ φ)2 + U ′ (φ) ⋆ ψ̄ ⋆ ψ + ψ̄γ μ ∂μ ψ − 2F ⋆ U − F 2 . (5)\nS=−\n2 M\n\nHere φ is a real scalar field, and ψ is a Majorana spinor. We take γ-matrices in\nthe Majorana representation\n\u0013\n\u0013\n\u0012\n\u0012\n1 0\n0 −1\n1\n3\n0\n2\n.\n(6)\n,\nγ =σ =\nγ = −iσ =\n0 −1\n1 0\nIn this representation the components of ψ are real. ψ̄ = ψ\u0012T iγ 0 . \u0013\nComponents\nof\n\u0013\n\u0012\nǫ+\nψ+\n.\n,ǫ=\nthe spinors will be marked by the subscripts ±, so that ψ =\nǫ−\nψ−\nFor the φ4 model\nr\n√\nλ 2\n(v0 − φ ⋆ φ),\nU ′ (φ) = − 2λφ .\nU(φ) =\n(7)\n2\nNote, that though due to (3) one star can always be deleted under an integral,\nit is more convenient to write all stars explicitly in all terms higher that second\norder in the fields since mixed (star with ordinary) products are not associative.\nThe supersymmetry transformations\nδφ = ǭψ,\n\nδψ = (γ μ ∂μ φ + F )ǫ,\n\nδF = ǭγ μ ∂μ ψ.\n\n(8)\n\nare linear, and, therefore, are undeformed. The invariance of (5) under (8) follows\nfrom the general analysis of [18, 19], but can also be verified directly.\nThe auxiliary field F may be excluded by means of its' algebraic1 equation of\nmotion\nF = −U(φ).\n(9)\nThe action (5) becomes\nZ\n\u0001\n1\nS=−\nd2 x (∂μ φ)2 + U ′ (φ) ⋆ ψ̄ ⋆ ψ + ψ̄γ μ ∂μ ψ + U ⋆ U ,\n2 M\n\n(10)\n\nand the supersymmetry transformations read\nδφ = ǭψ,\n1\n\nδψ = (γ μ ∂μ φ − U)ǫ.\n\nThis means that no derivatives acting on F appear.\n\n4\n\n(11)\n\n\fThe equations of motion corresponding to the action (10) are\nr\n1\nλ\nψ̄ ⋆ ψ − (U ⋆ U ′ + U ′ ⋆ U) = 0,\n∂μ ∂ μ φ +\n2\n2\n1 ′\n/ + (U ⋆ ψ + ψ ⋆ U ′ ) = 0.\n∂ψ\n2\n\n(12)\n(13)\n\nStatic solutions of these equations are the same as in the commutative case. In\nparticular, there is the kink solution\nr !\nλ\nΦ(x) = v0 tanh v0\nx .\n(14)\n2\nThis solution satisfies the Bogomolny equation\n∂1 Φ(x) = U(Φ)\n\n(15)\n\nand is invariant under the supersymmetry transformations (11) with ǫ− = 0.\n\n3\n\nCanonical realization of the supersymmetry\nalgebra\n\nWe have no locally conserved supercurrent in the model (as there is no locally\nconserved energy-momentum tensor in NC theories [21]), but still by using an\nunconventional canonical formalism for time-space noncommutative theories [20]\nwe can define supercharges which generate the supersymmetry transformations\n(11). Let us briefly outline the formalism of [20] (in [20] only the bosonic case\nwas considered, but an extension to the presence of fermions is straightforward).\nThe canonical pairs are defined ignoring the time derivatives hidden in the starproduct. In our model this implies that they are precisely the same as in the\ncommutative case. To read off the symplectic form, let us re-write the action\n(10) in a \"hamiltonian\" form\n\u0012\n\u0013\nZ\ni\n1\n2\nS =\nd x − (∂0 ψ+ * ψ+ + ∂0 ψ− * ψ− ) + ((∂0 φ)p − (∂0 p)φ) − H (16)\n2\n2\n\u0013\n\u0012\nZ\n1\n=\nd2 x − (C −1 )AB ∂0 zA * zB − H .\n2\n(We use the conventions of Henneaux [22]). Here {zA } ≡ {φ, p, ψ+ , ψ− }.\nH=\n\n\u0001\n1\n(∂1 φ)2 + p2 + U ⋆ U + U ′ ⋆ ψ̄ ⋆ ψ + ψ̄γ 1 ∂1 ψ\n2\n\n(17)\n\ndoes not contain explicit time derivatives (all time derivatives are hidden in the\nstar product).\n5\n\n\fThe canonical brackets are taken between variables at different times and\nare postulated to be proportional to two-dimensional delta-functions instead of\none-dimensional ones, {zA (t, x), zB (t′ , x′ } = CAB δ(t−t′ )δ(x−x′ ). More explicitly,\n{φ(t, x), p(t′ , x′ )} = δ(x − x′ )δ(t − t′ ),\n{ψ± (t, x), ψ± (t′ , x′ )} = −iδ(x − x′ )δ(t − t′ ),\n\n(18)\n(19)\n\nand p = ∂0 φ. Usual grading rules are understood. Now we have to extend\nthe definition of the brackets to star-polynomials of zA and their derivatives.\nHere we face a difficulty since a star product by a delta-function is not a well\ndefined object. However, we can define brackets between space-time integral of\npolynomials. Let F , G be two such integrals. Then\nZ\nδr F\nδlG\n2\n{F, G} = d x\n⋆ CAB\n.\n(20)\nδzA (x)\nδzB (x)\n\nHere δ r and δ l are right and left variational derivatives. For a practical use, the\nformula (20) has to be understood in the following way. One has to take all pairs\nof canonical variables zA , zB in F and G respectively, then one uses the property\n(4) to bring zA to the rightmost position in F , and zB to the leftmost position in\nG. Then one integrates by parts to remove all explicit derivatives form zA and\nzA . Then one deletes zA and zB , star-multiply the expressions obtained, contracts\nwith CAB and integrates over the space-time. The brackets defined in this way\nsatisfy the (graded) Jacobi identities. For bosonic theories this was demonstrated\nin [20], and an extension\nto fermions is straightforward.\nR\nBy taking F = f ⋆ F̂ , where f is a smooth function, calculating the bracket\nwith G, and then varying with respect to f , one can extend the definition to\nbrackets between star-polynomials F̂ and integrated star-polynomials G. This\ntrick does not work twice. Therefore, it is not possible to define a bracket between\nunintegrated polynomials, but we shall not need such an object.\nIn [20] it was shown that these unconventional Poisson brackets can be used\nto define first-class constraints and generate gauge transformations in time-space\nNC theories (see also [23] for an example of practical use of these brackets). Here\nwe shall apply them to analyze global symmetries.\nFirst we note, that if we define the \"Hamiltonian\" as a space-time integral\nZ\nH = d2 x H\n(21)\nof the density (17), then the brackets with H generate the equations of motion\n{H, zA } = −∂0 zA .\n\n(22)\n\nA definition of the \"supercharge\" then follows by an educated guess as a\nsuitable generalization of corresponding commutative expression. Let us take\nZ\n/ + U(φ)) ⋆ γ 0 ψ .\nQ = − d2 x(∂φ\n(23)\n6\n\n\fIt is easy to check that this \"supercharge\" indeed generates the supesymmetry\ntransformations\n{ǭQ, zA } = −δ̃zA\n(24)\n\nof the Hamiltonian action (16). On shell the transformations δ̃ coincide with\n(11).\nWe see, that the \"Hamiltonian\" and the \"supercharge\" possess the characteristic features which we expect from a Hamiltonian and a supercharge. Therefore,\nwe shall sometimes omit the quotation marks in what follows.\nThe kink solution (14) is invariant under the ǫ+ transformations, which are\ngenerated by Q− . The bracket of two such supercharges reads\n{Q− , Q− } = −2i(H − Z)\n\n(25)\n\nwhere2\nZ\n\nd2 x∂1 W (φ),\nr \u0012\n\u0013\nλ\n1\n2\nW (φ) =\nv0 φ − φ ⋆ φ ⋆ φ .\n2\n3\n\nZ=\n\n(26)\n(27)\n\nZ is a natural generalization of the central charge to the NC case. We obtained a\nstandard form of a central extension of the supersymmetry algebra in a topologically non-trivial sector [24], though the generators are given by two-dimensional\nintegrals and the brackets are unconventional.\nOn the kink background both H and Z are divergent unless one restricts the\nintegration over t to a finite interval. Note, that the difference H − Z for the\nkink is finite and vanishes.\n\n4\n\nFluctuations\n\nThe spectrum of fluctuations is defined by the linearized equations of motion (12)\nand (13). For the fermionic fluctuations we have\n\u0013\n\u0013\u0012\n\u0012\n−∂0\nψ+\n∂1 + 21 (L(U ′ (Φ)) + R(U ′ (Φ)))\n= 0.\n∂0\n−∂1 + 21 (L(U ′ (Φ)) + R(U ′ (Φ)))\nψ−\n(28)\nHere L and R denote left and right Moyal multiplications respectively, f1 ⋆ f2 =\nL(f1 )f2 = R(f2 )f1 . The fluctuation operator commutes with ∂0 . Consequently,\nwe can look for the solutions in the form\nψ± (t, x) = eiωf t ψ± (ωf , x).\n\n(29)\nR\n\n2\nNote, that there is another total derivative term in {Q− , Q− }, namely −i ∂1 (ψ̄ψ). This\nterm vanishes if one considers fluctuations above the kink solution with the asymptotic conditions we discussed above. However, such terms are important for the \"supersymmetry without\nboundary conditions\" approach [25].\n\n7\n\n\fThe equation (28) then yields\n1\niωf ψ+ (ωf , x) = (∂1 − (U ′ (Φ+ ) + U ′ (Φ− )))ψ− (ωf , x),\n2\n1 ′\niωf ψ− (ωf , x) = (∂1 + (U (Φ+ ) + U ′ (Φ− )))ψ+ (ωf , x),\n2\n\n(30)\n\nwhere\nΦ± (x) ≡ Φ(x ± θω) .\n\n(31)\n\nThe property (2) of the Moyal product has been used. By iterating the equations\n(30) one obtains\nωf2 ψ+ (ωf , x) = −D− (ωf )D+ (ωf )ψ+ (ωf , x),\n\nωf2 ψ− (ωf , x) = −D+ (ωf )D− (ωf )ψ− (ωf , x),\n\nwhere\n\n(32)\n\nr\n\nλ\n(Φ+ + Φ− ).\n(33)\n2\nIn the bosonic sector, we decompose the scalar field as φ = Φ + φ. The\nfluctuations φ satisfy the linearized field equation\nD± (ω) = ∂1 ∓\n\n− ∂02 φ = −(∂12 + λv02 − λ(L(Φ2 ) + R(Φ2 ) + L(Φ)R(Φ))φ .\n\n(34)\n\nAgain, we look for the solutions in the form φ(ωb , x) = eiωt φ(ωb , x). The equation\n(34) yields\nωb2 φ(ωb ) = −(∂12 + λv02 − λ(Φ2+ + Φ2− + Φ+ Φ− ))φ(ωb ).\n\n(35)\n\nBy using the Bogomolny equation (15) we obtain\nωb2φ(ωb ) = −D+ (ωb )D− (ωb )φ(ωb).\n\n(36)\n\nThe spectrum of the eigenfrequencies is defined by two operators, P1 (ω) =\n−D+ (ω)D− (ω) and P2 (ω) = −D− (ω)D+ (ω). Due to the intertwining relations\nP1 (ω)D+ (ω) = D+ (ω)P2(ω),\n\nD− (ω)P1 (ω) = P2 (ω)D− (ω)\n\n(37)\n\nthese operators are isospectral up to zero modes. Indeed, these relations imply\nthat if P1 ψ1 = λψ1 , then D− ψ1 is an eigenfunction of P2 with the same eigenvalue.\nAlso, if P2 ψ2 = λψ2 , then P1 (D+ ψ2 ) = λ(D+ ψ2 ).\nAn explicit form of P1 follows from (35). For the sake of completeness we also\npresent\nP2 (ω) = −(∂12 − λv02 − λΦ+ Φ− ).\n(38)\nIn calculations of the quantum corrections it is convenient to go from the continuous to discrete spectrum of P1 and P2 by introducing boundaries [16] in the\n8\n\n\fx-direction. We like the boundary to interact with the soliton as weak as possible.\nTherefore, the boundary should be far away from the place where the kink is localized. However, as we see e.g. from eq. (35), the width of the effective potential\nis proportional to θω and becomes infinite for ω → ∞. No boundary seems to be\nsufficiently far away. To overcome this difficulty, in [9] it was suggested to make\nthe boundary ω-dependent, i.e. to place it to the points x = ±l(ω) = ±(l0 + θω)\nwith a large l0 . Having a boundary, one has to impose some boundary conditions on the fluctuations. Particular choice of the boundary conditions is not\ntoo important (as anyway we are going to subtract the vacuum energy related to\nthe boundary), but too use the full strength of supersymmetry it is convenient\nto take supersymmetric boundary conditions which respect the intertwining relations (37) and, therefore, preserve isospectrality of P1 (ω) and P2 (ω) for any ω.\nThe simplest choice is to impose the Dirichlet boundary conditions on φ and ψ− ,\nφ|x=±l(ω) = ψ− |x=±l(ω) = 0.\n\n(39)\n\nThe intertwining relations then require a Robin (generalized Neumann) boundary\ncondition for ψ+ :\nD+ ψ+ |x=±l(ω) = 0.\n(40)\n(Note that the same boundary condition on ψ+ follows from the consistency of\nthe Dirac equation (30)).\nIn general, the Moyal product cannot be restricted to an interval with frequency dependent boundaries. However, for operators commuting with the time\nderivatives (in particular, for Moyal multiplications by a time-independent function) such a restrictions can be made along the lines described in this section.\n\n5\n\nQuantum corrections to the mass\n\nHere we use a generalization of the method [16] to the NC case. Namely, we\nfirst consider the kink with boundaries with fluctuations subject to the boundary conditions (39) and (40), calculate the total quantum energy of this system\nEk+b , and then subtract the vacuum energy Eb which is due to the presence of\nboundaries. The energy associated with the kink is then\nEk = Ek+b − Eb .\n\n(41)\n\nThe vacuum energy for each of the systems is defined as a half-sum of the\neigenfrequencies,\n1X\n1X\nE=\nωb −\nωf\n(42)\n2\n2\n(we set ~ = 1). In time-space NC theories there is no standard canonical Hamiltonian to justify this formula for the energy (though, there is a non-standard\none, see sec. 3 and 6). For systems with a finite number of additional time\n9\n\n\fderivatives (with fields in stationary but non-static geometries being an example\nof such systems) it was shown that this definition of the energy is equivalent\nto the canonical one, and the presence of extra time derivative (which results\nin modifications of the Klein-Gordon current and corresponding scalar product)\ninfluences the results of quantum computations through modification of the spectral density [26, 27] (see also [9, 28] for an extension of this analysis to NC case).\nAdopting the same approach here looks as the most reliable extension of the\nnotion of vacuum energy to time-space NC theories.\nBecause of the presence of boundaries we deal with a discrete spectrum of\neigenfrequencies. It is convenient to use the zeta-function regularization [29, 30].\nThe operator P1 (resp., P2 ) is a product of a first-order operator and its' formal\nadjoint. Therefore, both P1 and P2 are non-negative. In the positive spectrum,\nthe zeta-regularized energy reads\nE(s) =\n\nμ2s \u0010X′ 2 1 −s X′ 2 1 −s \u0011\n,\n(ωf ) 2\n(ωb ) 2 −\n2\n\n(43)\n\nwhere prime tells us that the summation runs over the positive spectrum only.\n(Zero frequencies do not contribute to the vacuum energy). The parameter μ of\nthe dimension of the mass is introduced in order to keep right dimensionality of\nthe energy independently of the regularization parameter s. Both sums on the\nright hand side of (43) are convergent for Re (s) sufficiently large. At the end of\nthe calculations the result must be analytically continued to the physical value\ns = 0.\nLet us first analyze Ek+b . Due to the isospectrality properties discussed above\nE(s)k+b = 0,\n\n(44)\n\ni.e., the regularized vacuum energy vanished identically.\nAlthough, obviously, the vacuum energy (44) is not divergent, there might\nbe some finite contribution due to a finite renormalization 3 . To define such a\ncontribution one should fix a normalization condition or a subtraction scheme.\nHere we use the heat-kernel subtraction scheme which is frequently employed in\nthe Casimir energy calculations and is discussed in detail in [33, 34]. Consider a\n(bosonic) system in 1 + 1 dimensions with a discrete frequency spectrum {ωn }.\nLet kn2 = ωn2 −m2 , where m is the mass (or, the asymptotic value of the potential).\nThe regularized vacuum energy for this system admits a representation,\n1\nμ2 X 2\nμ2\n(kn + m2 ) 2 −s =\n2 n\n2\n\nZ\n\n∞\n\n0\n\n3\n\n1\n\ndτ τ s− 2\n2\n\u0001 K(τ )e−τ m ,\n1\nτ Γ s− 2\n\n(45)\n\nThis indeed happens in some models. For example, the whole correction to the mass\nof the supersymmetric Abrikosov-Nielsen-Olesen vortex is due to a finite renormalization of\ncouplings [31, 32].\n\n10\n\n\fwhere\nK(τ ) =\n\nX\n\n2\n\ne−τ kn\n\n(46)\n\nn\n\nis the corresponding heat kernel. Usually, the heat kernel admits an asymptotic\nexpansion4\nX\nK(τ ) ≃\nap τ p−1\n(47)\np>0\n\nas τ → +0. For s = 0 contributions to (45) from the terms with p = 0, 1, 2 are\ndivergent at the lower limit. We define the divergent part of the vacuum energy\nas\nZ\n1\n2\nX\nμ2 ∞ dτ τ s− 2\n2\ndiv\n\u0001\nan τ n−1 e−τ m\nE ≡\n1\n2 0 τ Γ s − 2 n=0\n\u0013\n\u001a\n\u0012\nμ2\n1\n2−2s\n\u0001 a0 Γ(s − 1)m\nm1−2s\n=\n+ a1 Γ s −\n2\n2Γ s − 21\n+a2 Γ(s)m−2s .\n\n(48)\n\nThe renormalized energy is then\nE ren = [E(s) − E div (s)]s=0\n\n(49)\n\nThis subtraction scheme has two important advantages. First, in the case of\ncommutative scalar theories in 1 + 1 dimensions it is equivalent [16] to the \"no\ntadpole\" normalization condition which is commonly used to calculate the mass\nshift of two-dimensional solitons. Second, this scheme can easily be extended to\nthe NC case.\nLet us return to Ek+b . Due to (44) the heat kernel is also identically zero, as\ndiv\nwell as all heat kernel coefficients and Ek+b\n(s). We conclude, that\nren\nEk+b\n= 0.\n\n(50)\n\nNext we have to study the vacuum energy Eb due to the presence of boundaries. Far away from the kink,\n√ the excitations are free bosonic and fermionic\nmodes with the mass m = v0 2λ which is defined by asymptotic values of the\npotential in (35) and (38). In the bosonic sector, the boundary conditions are\nDirichlet. In the fermionic sector, one mode satisfies the Dirichlet conditions as\nwell, another one satisfies the Robin boundary conditions (each of the modes\ncarries one half of a degree of freedom)5 .\n4\nSuch an expansion indeed exists for practically all case appearing in the context of quantum\nfield theory. A more precise and complete information on the heat kernel expansion can be\nfound in [37] for commutative space, and in [38] in the NC case. The heat kernel for frequencydependent problems was analyzed in [27, 35, 36].\n5\nIt is important that, as in the commutative case [16], we use for the fermions an asymptotic\nform of the squared Dirac equation (32). One cannot substitute asymptotic values of the fields\nin the Dirac equation (28) itself and then extend it smoothly to the whole space [−l, l].\n\n11\n\n\fLet us study the Robin sector first. For large l0 , (we remind that l(ω) =\nl0 + θω) the condition (40) yields\n(∂x + S1 )ψ|x=−l(ω) = 0,\nwhere\n\n(−∂x + S2 )ψ|x=l(ω) = 0,\n\n(51)\n\n√\nS1 = S2 = v0 2λ ≡ S.\n\n(52)\n\n0 = f (α1 , α2 ; k) ≡ sin(2kl(ω) + α1 + α2 )\n\n(53)\n\nα1,2 = − arctan(k/S1,2 ) ≡ α .\n\n(54)\n\nThere are no bound states (ω 2 < m2 ) for these boundary conditions.\nThe spec√\n2\n2\ntrum of oscillating modes, ψ = A sin(kx) + B cos(kx), k = ω − m is given by\nsolutions of the equation [16]\n\nwith\nIt is easy to see, that the spectrum in the Dirichlet sector is defined by the\nequation\n0 = f (0, 0; k) .\n(55)\nNext we represent the vacuum energy as a contour integral [16, 39]. The\nfunction ∂k ln f (k) has poles with unit residues at the points where f (k) = 0.\nTherefore, we can write\nI\n1\ndk 2\nμ2s\n∂\n(k + m2 ) 2 −s (ln f (α, α; k) − ln f (0, 0; k)),\n(56)\nEb (s) = −\n4\n2πi\n∂k\nwhere the contour goes anticlockwise around the positive real semiaxis. Along the\nupper part of the contour we approximate sin(2(kl(ω)+α)) by −(1/2i) exp(−2i(kl(ω)+\nα)) since the term exp(2i(kl(ω) + α)) vanishes as l0 → ∞. Along the lower part\nwe keep (1/2i) exp(2i(kl(ω) + α)). Then,\nZ ∞\n1\ndk 2\n∂α\n2s\nEb (s) = −μ\n(k + m2 ) 2 −s\n.\n(57)\n2π\n∂k\n0\nWe see, that all contributions containing l(ω) are cancelled. Therefore, the regularized boundary energy is given by precisely the same expression as in the\ncommutative case (cf. [16]). Without any further calculations we can read off the\nrenormalized value\np\nv0\nEbren = λ/2\n(58)\nπ\nfrom [16]. Consequently, the renormalized vacuum energy of the kink\np\nv0\nren\n(59)\nEkren = Eb+k\n− Ebren = − λ/2\nπ\ndoes not depend on θ and coincides with its' value in the commutative theory.\n12\n\n\f6\n\nVacuum expectation value of the new canonical Hamiltonian\n\nThere is little doubt in the correctness of the definition of the vacuum energy used\nin the previous section. However, keeping in mind the applications to saturation\nof the BPS bound one should also calculate corrections to the new Hamiltonian\n(21) which participates in the supersymmetry algebra.\nTo calculate vacuum expectation value of the Hamiltonian (21) we need the\npropagators for small fluctuations over the kink background. Let us start in the\nbosonic sector. Consider eigenfunctions of the operator P1 (ω),\nP1 (ω)φ̃ω,λω (x) = λ2ω φ̃ω,λω (x) ,\n\n(60)\n\nand normalize them according to the condition\nZ\ndx φ̃∗ω,λω (x)φ̃ω,λ′ω (x) = δλω ,λ′ω .\n\n(61)\n\nWe assumed, that there is a boundary in the x-direction, so that the spectrum is\ndiscrete. The functions φ̃ω,λω are defined initially on the interval [−l(ω), l(ω)] but\ncan be extended to the whole R as φ̃ω,λω = 0 for |x| > l(ω). The operator P1 (ω)\nacts by its analytic formula inside the interval and is extended as multiplication\nby λ2ω outside the interval and on the boundary. (Of course, as long as l(ω) is\nfinite the functions φ̃ω,λω cannot be used to expand an arbitrary function on R).\nThe integration in (61) can run over R, but the dual formula\nX\nφ̃∗ω,λω (x)φ̃ω,λω (x′ ) = δ(x − x′ )\n(62)\nλ\n\nis valid only if both x and x′ belong to [−l(ω), l(ω)]. Otherwise, the right hand\nside is zero.\nThe functions\n(63)\nφω,λω (xμ ) = e−iωt φ̃ω,λω (x)\nare the eigenfunctions of the full kinetic operator acting on fluctuations (restricted\nto an interval) with eigenvalues −ω 2 + λ2ω . The propagator can then be constructed in the standard way as\nZ\nX φω,λω (xμ )φ∗ω,λ (xμ′ )\n1\nω\nμ\nμ′\ndω\nG(x , x ) =\n,\n(64)\n2\n2\n2π\n−ω + λω − iε\nλ\nω\n\n′\n\nbut the relation P1 G(xμ , xμ′ ) = δ(xμ xμ′ ) is true only if both x1 and x1 belong\nto the intersection of the intervals [−l(ω), l(ω)], i.e., to [−l0 , l0 ]. For l0 → ∞ one\nrecovers the Feynman propagator. Then,\nhφ(xμ )φ(y ν )i = −iG(y ν , xμ ).\n13\n\n(65)\n\n\fWith the help of this equation one calculates the one-loop vacuum expectation\nof the bosonic part of the Hamiltonian\nZ\ni\nhHiB = −\nd2 x(−∂02 − ∂12 + λv02 − λ(L(Φ2 ) + R(Φ2 ) + L(Φ)R(Φ))x\n2\n× G(xμ , y ν )|y1 =x1 , y0 =x0 +σ .\n(66)\nwhere we introduced a time-splitting regularization with the parameter σ. The\noperator acting on G should be understood as −∂02 + P1 . The action of P1 on\nφ̃ω,λω is already defined above. It is easy to see, that the integrand does not\ndepend on x0 . In order to remove the corresponding divergence we restrict the\nintegration over x0 to [0, T ] with some finite T . We have,\nZ\nZ\nX\nω 2 + λ2ω\niT\ndω\nhHiB = −\ndx1\n(x1 )φ̃∗ω,λω (x1 ) eiωσ\nφ̃\n2 + λ2 − iε ω,λω\n2\n2π\n−ω\nω\nλω\nZ\n2\n2\nω + λω\niT\ndω X\n=−\neiωσ\n(67)\n2\n2\n2\n2π λ −ω + λω − iε\nω\n\nLet σ < 0. The integration contour can be closed in the lower complex halfplane. For each value of ω there is a discrete set of eigenvalues {λjω }. Let ωj be\npositive solutions of the equation ωj = λjωj (there could be multiple solutions of\nthis equation for each j, but we do not consider such case for simplicity). Then,\n\u0012\n\u0013−1\ndλjω\nT X\nωj 1 −\n.\n(68)\n|ω=ωj\nhHiB =\n2 j\ndω\nFor σ > 0 the result is the same.\nThis formula admits a rather simple interpretation. The factor T appears\nsince our Hamiltonian has the meaning of energy integrated over the time. The\nexpression under the sum is an energy of an excitation with the frequency ωj .\nIn the commutative limit the derivative in the bracket vanishes, so that each\nexcitation contributes 21 ω. In the NC case, a correction factor appears. The\npresence of this factor means that the contribution of an individual mode to hHi\ndiffers from that to E. As we shall see below, due to the supersymmetry this\ndifference does not affect the final result when contributions of all modes, bosonic\nand fermionic, are taken into account.\nFor contribution of the fermionic fluctuations one obtains similarly6\n\u0012\n\u0013−1\nT X\ndλjω\nhHiF = −\nωj 1 −\n,\n(69)\n|ω=ωj\n2 j\ndω\n6\nThe only subtlety is the way to extend the eigenfunctions satisfying Robin boundary conditions outside the interval [−l(ω), l(ω)]. This should be done again by setting these function\nto zero. Possible discontinuities at the boundary do not play a role. In this way we preserve\nthe isospectrality of P1 and P2 .\n\n14\n\n\fwhere, as expected, the overall sign is different from (68). ωj now denote the\nfermionic frequencies.\nDue to the isospectrality of bosonic and fermionic fluctuations on a background of the kink in the presence of boundaries\nhHib+k\n+ hHib+k\n= 0.\nF\nB\n\n(70)\n\n(It is understood that these quantities must be regularized by replacing ω with\nω 1−2s . The calculations proceed precisely as in the previous section.)\nLet us now calculate the boundary contribution hHib to the vacuum expectation value of the Hamiltonian. An effective free field theory which must be\nused to calculate boundary contributions was described in the previous section.\nThe boundary conditions are given by (39) and (40), and the spectrum of λjω is\ndefined by the solutions of the equation f (ω|λω ) = 0, where\n√\n(71)\nf (ω|λ) = sin(2(k(λ)l(ω) + α(k(λ)))),\nk(λ) = λ2 − m2 ,\nα(k) = 0 for Dirichlet conditions, α(k) = − arctan(S/k) for Robin ones. The\nquantity\n\u0013−1\n\u0012\nX\ndλjω\n1−2s\n,\n(72)\n|ω=ωj\nh(s) =\nωj\n1−\ndω\nj\n\nwhich is a zeta-regularized expression for the right hand sides of (68) and (69),\ncan be represented as a contour integral\n\u0013−1\n\u0012\nI\n1\ndλω\n1−2s\nh(s) =\n1−\ndω ω\n∂ω (ln f (ω|ω)),\n(73)\n|ω=λω\n2πi\ndω\nwhere the contour encircles [m, ∞[. One can write\n∂ω f (ω|ω) = [∂ω f (ω|λ) + ∂λ f (ω|λ)]λ=ω .\n\n(74)\n\nOn the other hand, the condition f (ω|λω ) = 0 defines the dependence of λω on\nω. By differentiating this condition, one gets\n0 = ∂ω f (ω|λω ) = [∂ω f (ω|λ)]λ=λω + [∂λ f (ω|λ)]λ=λω\nBy using (74) and (75) we rewrite (73) as7\nI\n1\ndω ω 1−2s [∂λ ln f (ω|λ)]λ=ω .\nh(s) =\n2πi\n\ndλω\n.\ndω\n\n(75)\n\n(76)\n\n7\nThis equation can be also obtained in a different way. As follows from the analysis of [27,28],\nthe factor (1 − (dλ/dω))−1 is the difference between the spectral density of eigenfrequencies ωj\nand the spectral density of the eigenvalues λ for a given ω taken at λ = ω. The integral (76) is\nsimply a sum over the eigenfrequencies with the latter density.\n\n15\n\n\fBy using the identities which we have just derived one can represent the zetaregularized boundary contribution to the v.e.v. of H in the form\nI\nT μ2s 1\nb\ndω ω 1−2s [∂λ (ln fD (ω|λ) − ln fR (ω|λ))]λ=ω ,\n(77)\nhHi (s) =\n4 2πi\nwhere fD,R correspond to Dirichlet and Robin boundary conditions respectively\n(cf. eq. (71) and the line below). As in the previous section, on the upper part\nof the contour we approximate sin(2(kl(ω) + α) by −(1/2i) exp(−2i(kl(ω) + α)),\nand by (1/2i) exp(2i(kl(ω) + α)) on the lower part. Then the terms with l(ω)\ncancel, and we arrive at the expression\nZ ∞\ndω 1−2s\nb\n2s\nhHi (s) = −T μ\nω\n[∂λ α(k(λ))]λ=ω .\n(78)\nm 2π\n√\nNext we observe that [∂λ α(k(λ))]λ=ω = ∂ω α(k(ω)) with k(ω) = ω 2 − m2 and\nchange the integration variable to k.\nZ ∞\n1\ndk 2\nb\n2s\n(79)\n(k + m2 ) 2 −s ∂k α(k),\nhHi (s) = −T μ\n2π\n0\nor,\nhHib (s) = T E b (s).\n\n(80)\n\nb\n.\nhHibren = T Eren\n\n(81)\n\nIn the heat kernel subtraction scheme hHidiv (s) = T E div (s), so that for the\nrenormalized values we also have the relation\n\nTaking into account (50) and (70), we conclude that\nk\nhHikren = T Eren\n= −T\n\np\nv0\nλ/2 .\nπ\n\n(82)\n\nThis is a very natural result. It tells us that the interpretation of the new canonical Hamiltonian as the energy integrated over a time interval remains valid also\nat the one-loop level.\n\n7\n\nConclusions\n\nIn this work we studied quantum corrections to the mass of the kink of supersymmetric NC φ4 . Contrary to the nonsupersymmetric case [9], the counterterm\nrequired to remove the divergences is precisely the same as in the commutative theory. The strategy of calculations of the one-loop corrections was taken\nfrom [16]. We introduced boundaries, so that the spectrum of the fluctuations\nbecomes discrete. Because of the nonlocality of NC theories, the position of\n16\n\n\fthe boundary depends on the frequency of each fluctuation. For the system of\nthe kink and the boundaries, we used the isospectrality of bosonic an fermionic\nfluctuations which follows from supersymmetry. The total energy of this system\nvanishes. Then we subtracted the contribution from the boundaries, which was\ncalculated in a relatively simple effective theory. The heat kernel subtraction\nscheme (which is equivalent to the \"no-tadpole\" normalization condition in twodimensional commutative models) gave a value of the mass correction which did\nnot depend on the NC parameter and coincided with the commutative value.\nBy making use of an unconventional canonical formalism we were able to define supercharges (despite the presence of an infinite number of time derivatives\nand the absence of locally conserved currents), and to show that the new brackets of these supercharges give an analog of the Hamiltonian and an analog of\nthe central charge. (Note, that the supercharges do generate the supersymmetry\ntransformations, and the Hamiltonian does generate the equations of motion, provided the new canonical brackets are used). This Hamiltonian can be interpreted\nas the energy integrated over an interval T of the time. The one-loop vacuum\nexpectation value of this Hamiltonian appears to be the quantum correction to\nthe mass of the kink times T , i.e., the picture remains consistent after turning\non the quantum effects. Although we have two different definitions of quantum\ncorrections to the energy (one through a sum over the eigenfrequencies, and the\nother through the Hamiltonian of the unconventional canonical formalism), both\ndefinitions give essentially equivalent results.\nIn a future publication we are going to calculate quantum corrections to the\ncentral charge. This will allow to check whether the quantum BPS bound remains\nsaturated in NC theories. It would also be interesting to consider quantum corrections to solitons in higher dimensional NC theories.\n\nAcknowledgments\nThis work was supported in part by FAPESP and CNPq.\n\nReferences\n[1] R. F. Dashen, B. Hasslacher and A. Neveu, \"Nonperturbative Methods And\nExtended Hadron Models In Field Theory. 2. Two-Dimensional Models And\nExtended Hadrons,\" Phys. Rev. D 10, 4130 (1974).\n[2] J. Goldstone and R. Jackiw, \"Quantization Of Nonlinear Waves,\" Phys. Rev.\nD 11 (1975) 1486.\n[3] R. Rajaraman, Solitons and instantons (Elsivier, Amsterdam, 1996).\n\n17\n\n\f[4] L. D. Faddeev and V. E. Korepin, \"Quantum Theory Of Solitons: Preliminary Version,\" Phys. Rept. 42, 1-87 (1978).\n[5] A. A. Izquierdo, W. G. Fuertes, M. A. G. Leon, M. d. la Torre Mayado,\nJ. M. Guilarte and J. M. M. Castaneda, \"Lectures on the mass of topological\nsolitons,\" arXiv:hep-th/0611180.\n[6] M. R. Douglas and N. A. Nekrasov, \"Noncommutative field theory,\" Rev.\nMod. Phys. 73, 977-1029 (2001) [arXiv:hep-th/0106048].\n[7] O. Lechtenfeld, \"Noncommutative solitons,\" arXiv:hep-th/0605034.\n[8] S. Kurkcuoglu and O. Lechtenfeld, \"Quantum Aspects of the Noncommutative Sine-Gordon Model,\" JHEP 0709, 020 (2007) [arXiv:0708.1310 [hepth]].\n[9] R. A. Konoplya and D. V. Vassilevich, \"Quantum corrections to noncommutative kink,\" JHEP 0801 (2008) 068 [arXiv:0712.0360 [hep-th]].\n[10] A. Rebhan, P. van Nieuwenhuizen and R. Wimmer, \"New developments in the quantization of supersymmetric solitons (kinks, vortices and\nmonopoles),\" Braz. J. Phys. 34, 1273-1287 (2004) [arXiv:hep-th/0404223].\n[11] M. Shifman and A. Yung, \"Supersymmetric Solitons and How They Help\nUs Understand Non-Abelian Gauge Theories,\" arXiv:hep-th/0703267.\n[12] A. Rebhan and P. van Nieuwenhuizen, \"No saturation of the quantum Bogomolnyi bound by two-dimensional N = 1 supersymmetric solitons,\" Nucl.\nPhys. B 508, 449-467 (1997) [arXiv:hep-th/9707163].\n[13] H. Nastase, M. A. Stephanov, P. van Nieuwenhuizen and A. Rebhan, \"Topological boundary conditions, the BPS bound, and elimination of ambiguities in the quantum mass of solitons,\" Nucl. Phys. B 542, 471-514 (1999)\n[arXiv:hep-th/9802074].\n[14] N. Graham and R. L. Jaffe, \"Energy, central charge, and the BPS bound\nfor 1+1 dimensional supersymmetric solitons,\" Nucl. Phys. B 544, 432-447\n(1999) [arXiv:hep-th/9808140].\n[15] M. A. Shifman, A. I. Vainshtein and M. B. Voloshin, \"Anomaly and quantum\ncorrections to solitons in two-dimensional theories with minimal supersymmetry,\" Phys. Rev. D 59, 045016 (1999) [arXiv:hep-th/9810068].\n[16] M. Bordag, A. S. Goldhaber, P. van Nieuwenhuizen and D. Vassilevich,\n\"Heat kernels and zeta-function regularization for the mass of the SUSY\nkink,\" Phys. Rev. D 66 (2002) 125014 [arXiv:hep-th/0203066].\n18\n\n\f[17] C. S. Chu and F. Zamora, \"Manifest supersymmetry in non-commutative\ngeometry,\" JHEP 0002 (2000) 022 [arXiv:hep-th/9912153].\n[18] S. Ferrara and M. A. Lledo, \"Some aspects of deformations of supersymmetric field theories,\" JHEP 0005 (2000) 008 [arXiv:hep-th/0002084].\n[19] S. Terashima, \"A note on superfields and noncommutative geometry,\" Phys.\nLett. B 482 (2000) 276 [arXiv:hep-th/0002119].\n[20] D. V. Vassilevich, \"Constraints, gauge symmetries, and noncommutative\ngravity in two dimensions,\" Theor. Math. Phys. 148 (2006) 928 [Teor. Mat.\nFiz. 148 (2006) 64] [arXiv:hep-th/0502120].\n[21] A. Gerhold, J. Grimstrup, H. Grosse, L. Popp, M. Schweda and R. Wulkenhaar, \"The energy-momentum tensor on noncommutative spaces: Some pedagogical comments,\" arXiv:hep-th/0012112.\n[22] M. Henneaux, \"Hamiltonian Form Of The Path Integral For Theories With\nA Gauge Freedom,\" Phys. Rept. 126 (1985) 1.\n[23] D. V. Vassilevich, R. Fresneda and D. M. Gitman, \"Stability of a noncommutative Jackiw-Teitelboim gravity,\" Eur. Phys. J. C 47 (2006) 235\n[arXiv:hep-th/0602095].\n[24] E. Witten and D. I. Olive, \"Supersymmetry Algebras That Include Topological Charges,\" Phys. Lett. B 78 (1978) 97.\n[25] D. V. Belyaev and P. van Nieuwenhuizen, \"Rigid supersymmetry with\nboundaries,\" arXiv:0801.2377 [hep-th].\n[26] D. V. Fursaev, \"Kaluza-Klein method in theory of rotating quantum\nfields,\" Nucl. Phys. B 596 (2001) 365 [Erratum-ibid. B 664 (2003) 403]\n[arXiv:hep-th/0006217].\n[27] D. V. Fursaev, \"Statistical mechanics, gravity, and Euclidean theory,\" Nucl.\nPhys. Proc. Suppl. 104 (2002) 33 [arXiv:hep-th/0107089].\n[28] A. V. Strelchenko and D. V. Vassilevich, \"On space-time noncommutative theories at finite temperature,\" Phys. Rev. D 76 (2007) 065014\n[arXiv:0705.4294 [hep-th]].\n[29] J. S. Dowker and R. Critchley, \"Effective Lagrangian And Energy Momentum Tensor In De Sitter Space,\" Phys. Rev. D 13 (1976) 3224.\n[30] S. W. Hawking, \"Zeta Function Regularization Of Path Integrals In Curved\nSpace-Time,\" Commun. Math. Phys. 55 (1977) 133.\n\n19\n\n\f[31] D. V. Vassilevich, \"Quantum corrections to the mass of the supersymmetric\nvortex,\" Phys. Rev. D 68 (2003) 045005 [arXiv:hep-th/0304267].\n[32] A. Rebhan, P. van Nieuwenhuizen and R. Wimmer, \"Nonvanishing quantum\ncorrections to the mass and central charge of the N = 2 vortex and BPS\nsaturation,\" Nucl. Phys. B 679 (2004) 382 [arXiv:hep-th/0307282].\n[33] M. Bordag, K. Kirsten and D. Vassilevich, \"On the ground state energy for a\npenetrable sphere and for a dielectric ball,\" Phys. Rev. D 59 (1999) 085011\n[arXiv:hep-th/9811015].\n[34] M. Bordag, U. Mohideen and V. M. Mostepanenko, \"New developments in\nthe Casimir effect,\" Phys. Rept. 353 (2001) 1 [arXiv:quant-ph/0106045].\n[35] D. Fursaev and A. Zelnikov, \"Thermodynamics, Euclidean gravity\nand Kaluza-Klein reduction,\" Class. Quant. Grav. 18 (2001) 3825\n[arXiv:hep-th/0104027].\n[36] D. V. Fursaev, \"Spectral asymptotics of eigen-value problems with non-linear\ndependence on the spectral parameter,\" Class. Quant. Grav. 19 (2002) 3635\n[Erratum-ibid. 20 (2003) 565] [arXiv:hep-th/0201219].\n[37] D. V. Vassilevich, \"Heat kernel expansion: User's manual,\" Phys. Rept. 388\n(2003) 279 [arXiv:hep-th/0306138].\n[38] D. V. Vassilevich, \"Heat Trace Asymptotics on Noncommutative Spaces,\"\nSIGMA 3 (2007) 093 [arXiv:0708.4209 [hep-th]].\n[39] M. Bordag, \"Vacuum energy in smooth background fields,\" J. Phys. A 28\n(1995) 755.\n\n20\n\n\f"}