{"id": "http://arxiv.org/abs/1111.4626v2", "guidislink": true, "updated": "2013-03-01T04:43:02Z", "updated_parsed": [2013, 3, 1, 4, 43, 2, 4, 60, 0], "published": "2011-11-20T12:34:19Z", "published_parsed": [2011, 11, 20, 12, 34, 19, 6, 324, 0], "title": "On an Achievable Rate of Large Rayleigh Block-Fading MIMO Channels with\n  No CSI", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1111.3329%2C1111.2159%2C1111.2526%2C1111.1629%2C1111.0277%2C1111.3793%2C1111.4626%2C1111.6084%2C1111.5428%2C1111.1598%2C1111.4357%2C1111.1452%2C1111.5588%2C1111.5775%2C1111.5341%2C1111.0237%2C1111.1231%2C1111.0968%2C1111.7162%2C1111.6463%2C1111.6255%2C1111.4745%2C1111.2091%2C1111.0047%2C1111.4582%2C1111.5388%2C1111.3508%2C1111.4785%2C1111.6129%2C1111.3448%2C1111.5735%2C1111.5825%2C1111.2211%2C1111.3472%2C1111.5040%2C1111.6436%2C1111.2486%2C1111.1686%2C1111.0179%2C1111.3957%2C1111.0474%2C1111.6492%2C1111.2169%2C1111.1556%2C1111.2953%2C1111.0814%2C1111.6126%2C1111.5022%2C1111.4665%2C1111.1883%2C1111.4927%2C1111.5945%2C1111.4001%2C1111.5076%2C1111.6259%2C1111.0735%2C1111.5645%2C1111.2581%2C1111.3337%2C1111.7146%2C1111.4758%2C1111.6561%2C1111.6881%2C1111.2447%2C1111.3897%2C1111.1306%2C1111.6652%2C1111.3061%2C1111.7214%2C1111.1820%2C1111.0541%2C1111.4478%2C1111.3557%2C1111.3278%2C1111.0574%2C1111.2657%2C1111.3736%2C1111.0009%2C1111.6038%2C1111.3703%2C1111.3997%2C1111.1756%2C1111.2502%2C1111.4610%2C1111.0744%2C1111.4876%2C1111.3589%2C1111.6318%2C1111.4976%2C1111.5054%2C1111.0293%2C1111.3574%2C1111.4769%2C1111.5105%2C1111.4019%2C1111.3087%2C1111.1645%2C1111.4471%2C1111.3398%2C1111.1352%2C1111.2453&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "On an Achievable Rate of Large Rayleigh Block-Fading MIMO Channels with\n  No CSI"}, "summary": "Training-based transmission over Rayleigh block-fading multiple-input\nmultiple-output (MIMO) channels is investigated. As a training method a\ncombination of a pilot-assisted scheme and a biased signaling scheme is\nconsidered. The achievable rates of successive decoding (SD) receivers based on\nthe linear minimum mean-squared error (LMMSE) channel estimation are analyzed\nin the large-system limit, by using the replica method under the assumption of\nreplica symmetry. It is shown that negligible pilot information is best in\nterms of the achievable rates of the SD receivers in the large-system limit.\nThe obtained analytical formulas of the achievable rates can improve the\nexisting lower bound on the capacity of the MIMO channel with no channel state\ninformation (CSI), derived by Hassibi and Hochwald, for all signal-to-noise\nratios (SNRs). The comparison between the obtained bound and a high SNR\napproximation of the channel capacity, derived by Zheng and Tse, implies that\nthe high SNR approximation is unreliable unless quite high SNR is considered.\nEnergy efficiency in the low SNR regime is also investigated in terms of the\npower per information bit required for reliable communication. The required\nminimum power is shown to be achieved at a positive rate for the SD receiver\nwith no CSI, whereas it is achieved in the zero-rate limit for the case of\nperfect CSI available at the receiver. Moreover, numerical simulations imply\nthat the presented large-system analysis can provide a good approximation for\nnot so large systems. The results in this paper imply that SD schemes can\nprovide a significant performance gain in the low-to-moderate SNR regimes,\ncompared to conventional receivers based on one-shot channel estimation.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1111.3329%2C1111.2159%2C1111.2526%2C1111.1629%2C1111.0277%2C1111.3793%2C1111.4626%2C1111.6084%2C1111.5428%2C1111.1598%2C1111.4357%2C1111.1452%2C1111.5588%2C1111.5775%2C1111.5341%2C1111.0237%2C1111.1231%2C1111.0968%2C1111.7162%2C1111.6463%2C1111.6255%2C1111.4745%2C1111.2091%2C1111.0047%2C1111.4582%2C1111.5388%2C1111.3508%2C1111.4785%2C1111.6129%2C1111.3448%2C1111.5735%2C1111.5825%2C1111.2211%2C1111.3472%2C1111.5040%2C1111.6436%2C1111.2486%2C1111.1686%2C1111.0179%2C1111.3957%2C1111.0474%2C1111.6492%2C1111.2169%2C1111.1556%2C1111.2953%2C1111.0814%2C1111.6126%2C1111.5022%2C1111.4665%2C1111.1883%2C1111.4927%2C1111.5945%2C1111.4001%2C1111.5076%2C1111.6259%2C1111.0735%2C1111.5645%2C1111.2581%2C1111.3337%2C1111.7146%2C1111.4758%2C1111.6561%2C1111.6881%2C1111.2447%2C1111.3897%2C1111.1306%2C1111.6652%2C1111.3061%2C1111.7214%2C1111.1820%2C1111.0541%2C1111.4478%2C1111.3557%2C1111.3278%2C1111.0574%2C1111.2657%2C1111.3736%2C1111.0009%2C1111.6038%2C1111.3703%2C1111.3997%2C1111.1756%2C1111.2502%2C1111.4610%2C1111.0744%2C1111.4876%2C1111.3589%2C1111.6318%2C1111.4976%2C1111.5054%2C1111.0293%2C1111.3574%2C1111.4769%2C1111.5105%2C1111.4019%2C1111.3087%2C1111.1645%2C1111.4471%2C1111.3398%2C1111.1352%2C1111.2453&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Training-based transmission over Rayleigh block-fading multiple-input\nmultiple-output (MIMO) channels is investigated. As a training method a\ncombination of a pilot-assisted scheme and a biased signaling scheme is\nconsidered. The achievable rates of successive decoding (SD) receivers based on\nthe linear minimum mean-squared error (LMMSE) channel estimation are analyzed\nin the large-system limit, by using the replica method under the assumption of\nreplica symmetry. It is shown that negligible pilot information is best in\nterms of the achievable rates of the SD receivers in the large-system limit.\nThe obtained analytical formulas of the achievable rates can improve the\nexisting lower bound on the capacity of the MIMO channel with no channel state\ninformation (CSI), derived by Hassibi and Hochwald, for all signal-to-noise\nratios (SNRs). The comparison between the obtained bound and a high SNR\napproximation of the channel capacity, derived by Zheng and Tse, implies that\nthe high SNR approximation is unreliable unless quite high SNR is considered.\nEnergy efficiency in the low SNR regime is also investigated in terms of the\npower per information bit required for reliable communication. The required\nminimum power is shown to be achieved at a positive rate for the SD receiver\nwith no CSI, whereas it is achieved in the zero-rate limit for the case of\nperfect CSI available at the receiver. Moreover, numerical simulations imply\nthat the presented large-system analysis can provide a good approximation for\nnot so large systems. The results in this paper imply that SD schemes can\nprovide a significant performance gain in the low-to-moderate SNR regimes,\ncompared to conventional receivers based on one-shot channel estimation."}, "authors": ["Keigo Takeuchi", "Ralf R. Mueller", "Mikko Vehkaperae", "Toshiyuki Tanaka"], "author_detail": {"name": "Toshiyuki Tanaka"}, "author": "Toshiyuki Tanaka", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1109/TIT.2013.2268848", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1111.4626v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1111.4626v2", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "re-submitted to IEEE Trans. Inf. Theory", "arxiv_primary_category": {"term": "cs.IT", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cs.IT", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "math.IT", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1111.4626v2", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1111.4626v2", "journal_reference": null, "doi": "10.1109/TIT.2013.2268848", "fulltext": "IEEE TRANSACTIONS ON INFORMATION THEORY, VOL. , NO. , 2011\n\n1\n\nOn an Achievable Rate of Large Rayleigh\nBlock-Fading MIMO Channels with No CSI\nKeigo Takeuchi, Member, IEEE, Ralf R. Müller, Senior Member, IEEE,\n\narXiv:1111.4626v2 [cs.IT] 1 Mar 2013\n\nMikko Vehkaperä, Member, IEEE, and Toshiyuki Tanaka, Member, IEEE,\n\nAbstract\nTraining-based transmission over Rayleigh block-fading multiple-input multiple-output (MIMO) channels is investigated. As a training method a combination of a pilot-assisted scheme and a biased signaling scheme is considered. The\nachievable rates of successive decoding (SD) receivers based on the linear minimum mean-squared error (LMMSE)\nchannel estimation are analyzed in the large-system limit, by using the replica method under the assumption of replica\nsymmetry. It is shown that negligible pilot information is best in terms of the achievable rates of the SD receivers in\nthe large-system limit. The obtained analytical formulas of the achievable rates can improve the existing lower bound\non the capacity of the MIMO channel with no channel state information (CSI), derived by Hassibi and Hochwald,\nfor all signal-to-noise ratios (SNRs). The comparison between the obtained bound and a high SNR approximation\nof the channel capacity, derived by Zheng and Tse, implies that the high SNR approximation is unreliable unless\nquite high SNR is considered. Energy efficiency in the low SNR regime is also investigated in terms of the power\nper information bit required for reliable communication. The required minimum power is shown to be achieved at\na positive rate for the SD receiver with no CSI, whereas it is achieved in the zero-rate limit for the case of perfect\nCSI available at the receiver. Moreover, numerical simulations imply that the presented large-system analysis can\nprovide a good approximation for not so large systems. The results in this paper imply that SD schemes can provide\nManuscript received August, 2011. The work of K. Takeuchi was in part supported by the Grant-in-Aid for Young Scientists (B) (No. 23760329)\nfrom JSPS, Japan. The work of M. Vehkaperä was supported by the Norwegian Research Council under grant 171133/V30. The work of T. Tanaka\nwas in part supported by the Grant-in-Aid for Scientific Research on Priority Areas (No. 18079010) from MEXT, Japan. The material in this\npaper was presented in part at 2009 IEEE International Symposium on Information Theory, Seoul, Korea, July 2009, and at 2010 International\nSymposium on Information Theory and its Applications & 2010 International Symposium on Spread Spectrum Techniques and Applications,\nTaichung, Taiwan, Oct. 2010.\nK. Takeuchi is with the Department of Communication Engineering and Informatics, the University of Electro-Communications, Tokyo\n182-8585, Japan (e-mail: ktakeuchi@uec.ac.jp).\nR. R. Müller is with the Department of Electronics and Telecommunications, the Norwegian University of Science and Technology (NTNU),\nNO–7491 Trondheim, Norway (e-mail: ralf@iet.ntnu.no).\nM. Vehkaperä is with the School of Electrical Engineering, Royal Institute of Technology (KTH), SE–100 44 Stockholm, Sweden (e-mail:\nmikkov@kth.se).\nT. Tanaka is with the Department of Systems Science, Graduate School of Informatics, Kyoto University, Kyoto, 606-8501, Japan (e-mail:\ntt@i.kyoto-u.ac.jp).\n\nOctober 25, 2018\n\nDRAFT\n\n\fIEEE TRANSACTIONS ON INFORMATION THEORY, VOL. , NO. , 2011\n\n2\n\na significant performance gain in the low-to-moderate SNR regimes, compared to conventional receivers based on\none-shot channel estimation.\nIndex Terms\nMultiple-input multiple-output (MIMO) systems, Rayleigh block-fading channels, noncoherent capacity, trainingbased transmission, linear minimum mean-squared error (LMMSE) channel estimation, successive decoding (SD),\nbiased signaling, large-system analysis, replica method.\n\nI. I NTRODUCTION\nA. Motivation\nMultiple-input multiple-output (MIMO) transmission is a promising scheme for increasing the spectral efficiency\nof wireless communication systems, and has been applied to several modern standards, such as wireless LAN (IEEE\n802.11n) and Mobile WiMAX (IEEE 802.16e). However, the ultimate achievable rate of MIMO systems is not fully\nunderstood. Thus, it is an important issue in information theory to elucidate the channel capacity of MIMO systems.\nThe capacity of MIMO channels with perfect channel state information (CSI) at the receiver was analyzed in\nthe early pioneering works [1], [2]. Telatar [2] proved that independent and identically distributed (i.i.d.) Gaussian\nsignaling is optimal for i.i.d. Rayleigh fading MIMO channels with perfect CSI at the receiver. See e.g. [3] for the\ncase of more sophisticated fading models. The assumption of perfect CSI available at the receiver is a reasonable\nassumption if the coherence time is sufficiently long compared to the number of transmit antennas. However, this\nassumption becomes unrealistic for mobile communications with short coherence time or a large number of transmit\nantennas. Thus, it is worth considering the assumption of CSI available neither to the transmitter nor to the receiver,\nwhile the receiver is assumed to know the statistical model of the channel perfectly. In this paper, this assumption\nis simply referred to as the no CSI assumption.\nMarzetta and Hochwald [4] considered i.i.d. Rayleigh block-fading MIMO channels with no CSI, and characterized a class of capacity-achieving signaling schemes. In block-fading channels, the channel is fixed during one\nfading block and independently changes at the beginning of the next fading block. The assumption of block-fading\nsimplifies analyzing the capacity, although it might be an idealized assumption.1 See [5], [6] for the capacity of\ntime-varying MIMO channels with no CSI. In this paper, we consider block-fading MIMO channels with no CSI.\nThe capacity-achieving inputs are not i.i.d. over space or time for block-fading MIMO channels with no CSI [4].\nThese dependencies over space and time make it difficult to calculate the capacity. In order to circumvent this\ndifficulty, three kinds of strategies have been considered in the literature. A first strategy is to obtain a closed form\nfor a lower bound on the capacity by considering unitary space-time modulation [7], although the insight provided\nby the closed form is not very clear. It is possible to calculate a lower bound of the capacity numerically for all\nsignal-to-noise ratios (SNRs) [8], [9], while this task is not necessarily easy in terms of computational complexity.\n1\n\nThe assumption of block-fading is valid for time-division multiple-access (TDMA) schemes.\n\nOctober 25, 2018\n\nDRAFT\n\n\fIEEE TRANSACTIONS ON INFORMATION THEORY, VOL. , NO. , 2011\n\n3\n\nA second strategy is to consider the high or low SNR limits. This strategy can provide an analytical formula of\nthe capacity in return for giving up the capacity result in the moderate SNR regime. High SNR approximations of\nthe capacity were derived in [10], [11]. The approximations tolerate an error of o(1) in the high SNR limit. The\nanalytical formula by Zheng and Tse [10] provides a useful geometric insight, i.e., the capacity of MIMO channels\nwith no CSI has an interpretation as sphere packing in the Grassmann manifold, while the capacity for the case of\nperfect CSI available at the receiver has an interpretation in terms of sphere packing in the Euclidean space.\nThe power per information bit Eb required for reliable communication is a key performance measure in the low\nSNR regime. Verdú [12] proved that the SNR per information bit Eb /N0 , with N0 denoting noise power, required\nfor MIMO channels with no CSI achieves the minimum N Eb /N0 = ln 2 ≈ −1.59 dB in the low SNR limit, with\nN denoting the number of receive antennas. This result provides a fundamental limit in terms of energy efficiency.\nSee [13], [14] for more detailed analysis.\nThe last strategy is to analyze the achievable rate of a training-based system, which obviously provides a lower\nbound on the capacity. Since accurate channel estimates are assumed to be obtained by training, i.i.d. signaling\nover space and time is commonly used for training-based systems. This signaling contains practical modulation\nschemes, such as quadrature phase shift keying (QPSK) or quadrature amplitude modulation (QAM). Results based\non this strategy are less explored than those based on the other two strategies. An advantage of the training-based\nstrategy is that it is possible to obtain an analytical bound that can be easily evaluated for all SNRs. Hassibi\nand Hochwald [15] derived an analytical lower bound on the achievable rate of a pilot-assisted system, called\nthe Hassibi-Hochwald (HH) bound in this paper. Another advantage is that it can provide a useful guideline for\ndesigning practical training-based MIMO systems. In fact, it was shown in [15] that the optimal number of pilot\nsymbols is equal to the number of transmit antennas in terms of their lower bound. A weakness is that lower bounds\nderived by the last strategy might be looser than those derived by the first strategy. In this paper, we focus on the\nlast strategy and improve the existing lower bound of the capacity based on training.\nHassibi and Hochwald [15] used a method for lower-bounding the achievable rate of a pilot-assisted system,\ndeveloped by Médard in [16]. As shown in [17], using this method requires the assumption of one-shot channel\nestimation, under which the decoder regards the channel estimates provided by the channel estimator as the true\nones. In other words, the decoded data symbols are not re-utilized for refining the channel estimates. Thus, a lower\nbound based on training-based systems should improve by refining the channel estimates with the decoded data\nsymbols.\nWe follow a successive decoding (SD) strategy considered in [17]–[19], in which the data symbols decoded in\nthe preceding stages are utilized for refining the channel estimates. In the initial channel estimation, the channel\nestimator utilizes pilot signals transmitted by using a fraction of resources. As a training-based scheme suitable for\nthe SD strategy, we consider a combination of the conventional pilot-assisted scheme and a bias-based scheme [20].\nIn the bias-based scheme, a probabilistic bias of transmitted symbols is used for the initial channel estimation,\nwhile time-division multiplexed pilot symbols are utilized in the pilot-assisted scheme. The bias-based scheme was\nnumerically shown to outperform pilot-assisted schemes for practical iterative receivers [21]–[23]. The goal of this\nOctober 25, 2018\n\nDRAFT\n\n\fIEEE TRANSACTIONS ON INFORMATION THEORY, VOL. , NO. , 2011\n\n4\n\npaper is to derive an analytical bound based on the SD strategy with a combination of the pilot-assisted scheme\nand the bias-based scheme.\nB. Contributions & Methodology\nThe main contribution of this paper is to derive lower bounds on the achievable rates of SD receivers in the\nlarge-system limit, where the number of transmit antennas, the number of receive antennas, and coherence time tend\nto infinity while their ratios are kept constant. The lower bounds can be evaluated easily, whereas Padmanabhan et\nal. [19] calculated bounds on the corresponding achievable rate by numerical simulations. Numerical simulations\nin this paper show that the large-system results can provide a good approximation for not so large systems. The\nderived lower bounds are used to optimize the overhead for training. It is shown that negligibly small overhead\nfor training is best in terms of the lower bounds. The optimized bound outperforms the HH bound [15] for all\nSNRs. Furthermore, the comparison between our bound and the high-SNR approximation of the capacity [10], [11]\nimplies that the high-SNR approximation is valid only for quite high SNR.\nThe derivation of the proposed bounds consists of two steps: First, the optimal channel estimator is replaced\nby the linear minimum mean-squared error (LMMSE) channel estimator. Since the optimal channel estimator is\nnonlinear in general, the distribution of the channel estimates becomes non-Gaussian. This non-Gaussianity makes\nit difficult to calculate the achievable rates of the SD receivers with the optimal channel estimator. In order to\ncircumvent this difficulty, we consider a lower bound based on LMMSE channel estimation.\nNext, we take the large-system limit to obtain analytical results. The large-system limit has been extensively\nconsidered in the analysis of code-division multiple-access (CDMA) and MIMO systems with perfect CSI at the\nreceiver, by using random matrix theory [24]–[27] and the replica method [28]–[34]. The advantage of taking the\nlarge-system limit is that several performance measures, such as mutual information and signal-interference-plusnoise ratio (SINR), are expected to be self-averaging, i.e., they converge in probability to deterministic values in\nthe large-system limit. This self-averaging property allows us to obtain analytical results. The large-system limit in\nprevious works for the perfect CSI case may be regarded as the limit in which the numbers of transmit and receive\nantennas tend to infinity at the same rate after taking the long coherence-time limit, since the receiver can obtain\naccurate channel estimates in these limits. In order to consider the no CSI case, on the other hand, the coherence\ntime and the numbers of transmit and receive antennas tend to infinity at the same rate in this paper. Note that\nthe coherence time must also tend to infinity to obtain meaningful results when the number of antennas tends to\ninfinity, since there is no point in using transmit antennas more than the coherence time [4].\nWe use the replica method to evaluate the achievable rates in the large-system limit. The replica method was\noriginally developed in statistical physics [35]. See [36]–[38] for the details of the replica method. Recently, it has\nbeen recognized that the replica method is useful for analyzing nonlinear receivers [28]–[34]. A weakness of the\nreplica method is that it is based on several non-rigorous assumptions in the present time. See [39], [40] for a\nrecent remarkable progress with respect to the replica method.\n\nOctober 25, 2018\n\nDRAFT\n\n\fIEEE TRANSACTIONS ON INFORMATION THEORY, VOL. , NO. , 2011\n\n5\n\nC. Notation\nFor a complex number z ∈ C, throughout this paper, j, R[z], I[z], and z ∗ denote the imaginary unit, the real and\n\nimaginary parts of z, and the complex conjugate of z, respectively. For a complex matrix A, AT , AH , Tr(A), and\n\ndet A represent the transpose, the conjugate transpose, the trace, and the determinant of A, respectively. The vector\n1n denotes the n-dimensional vector whose elements are all one. The n × n identity matrix is denoted by I n . The\noperator ⊗ denotes the Kronecker product of two matrices. The matrix diag(a1 , . . . , an ) represents the diagonal\n\nmatrix with ai as the ith diagonal element. M+\nn denotes the set of all positive definite n × n Hermitian matrices.\nlog x, ln x, δ(*), and δa,b denote log2 x, loge x, the Dirac delta function, and the Kronecker delta, respectively. For\nrandom variables X, Y , and Z, I(X; Y |Z) denotes the conditional mutual information between X and Y given Z\n\nwith the logarithm to base 2. For a complex random vector x and a random variable Y , cov[x|Y ] represents the\ncovariance matrix of x given Y . CN (m, Σ) denotes a proper complex Gaussian distribution with mean m and a\ncovariance matrix Σ [41]. For covariance matrices Σ and Σ̃, Da (ΣkΣ̃) represents the Kullback-Leibler divergence\nwith the logarithm to base a between CN (0, Σ) and CN (0, Σ̃).\nAs notational convenience for subsets of the natural numbers N, we use [a, b) = {i ∈ N : a ≤ i < b}\nfor integers a and b (> a). The other sets [a, b], (a, b), and so on are defined in the same manner. The set\nJ \\{j} = {j ′ ∈ J : j ′ 6= j} denotes the set obtained by eliminating the element j from a set of indices J . When\nJ equals the set of all indices, J \\{j} is simply written as \\j.\nFor a set of indices J = {j1 , . . . , jn } and scalars {vj : j ∈ J }, v J denotes the column vector v =\n\n(vj1 , . . . , vjn )T , while ~v J does the row vector ~v J = (vj1 , . . . , vjn ). For example, v [a,b) = (va , . . . , vb−1 )T and\nv J \\{j2 } = (vj1 , vj3 , . . . , vjn )T . Note that v J \\{j} is written as v \\j when J is the set of all indices, since J \\{j}\nis abbreviated as \\j. For column vectors {aj : j ∈ J }, similarly, AJ denotes the matrix AJ = (aj1 , . . . , ajn ).\nFor example, A[a,b) = (aa , . . . , ab−1 ) and AJ \\{j2 } = (aj1 , aj3 , . . . , ajn ). We use symbols with tildes and hats\nto represent random variables for postulated (or virtual) channels and estimates of random variables, respectively.\nUnderlined symbols are used to represent random variables for decoupled channels.\nThe remainder of this paper is organized as follows: A Rayleigh block-fading MIMO channel is introduced in\nSection II. The achievable rates of SD receivers based on LMMSE channel estimation are formulated in Section III.\nThe main results of this paper are presented in Section IV. The obtained analytical bounds are compared to existing\nresults in Section V. We conclude this paper in Section VI. The derivation of the main results is summarized in\nappendices.\nII. C HANNEL M ODEL\nA. MIMO Channel\nA narrowband MIMO system with M transmit antennas and N receive antennas is considered. We assume\nblock-fading with coherence time Tc , i.e., the channel matrix H ∈ CN ×M is kept constant during one fading block\nconsisting of Tc symbol periods, and at the beginning of the next fading block the channel matrix is independently\n\nOctober 25, 2018\n\nDRAFT\n\n\fIEEE TRANSACTIONS ON INFORMATION THEORY, VOL. , NO. , 2011\n\n6\n\nsampled from a distribution. The received vector y t ∈ CN in the tth symbol period within a fading block is given\nby\n1\ny t = √ Hxt + nt ,\nM\n\nt = 1, . . . , Tc ,\n\n(1)\n\nwhere xt = (x1,t , . . . , xM,t )T and nt ∼ CN (0, N0 I N ) denote the transmitted vector in the tth symbol period\nand an additive white Gaussian noise (AWGN) vector with a covariance matrix N0 I N , respectively. The MIMO\nchannel (1) can be represented in matrix form as\n1\nY = √ HX + N ,\nM\n\n(2)\n\nwith Y = (y 1 , . . . , y Tc ), X = (x1 , . . . , xTc ), and N = (n1 , . . . , nTc ).\nFor the simplicity of analysis, we assume i.i.d. Rayleigh fading MIMO channels, i.e., the channel matrix H has\nmutually independent entries, and each entry hn,m = (H)n,m is drawn from the circularly symmetric complex\nGaussian (CSCG) distribution CN (0, 1) with unit variance. Note that the assumption of i.i.d. Rayleigh fading might\nbe an idealized assumption since there can be correlations between the elements of the channel matrix in practice.\nWe impose a power constraint\nM Tc\n\u0002\n\u0003\n1 XX\nE |xm,t |2 ≤ P,\nM Tc m=1 t=1\n\n(3)\n\nfor P > 0. Marzetta and Hochwald [4] proved that the capacity does not decrease even if the power constraint is\nstrengthened to a power constraint on each transmitted symbol,\n\u0002\n\u0003\nE |xm,t |2 ≤ P.\n\n(4)\n\nThe former power constraint (3) allows us to use power allocation over space and time, whereas the latter power\nconstraint (4) does not. In this paper, we only consider the latter power constraint (4), which simplifies the analysis.\nB. Training-Based Transmission\nWe assume that neither the transmitter nor the receiver has CSI. More precisely, only the statistical properties\nof the MIMO channel (1) are assumed to be known to the receiver. The previous works [10], [15] showed that\npilot-assisted channel estimation can achieve the capacity in the leading order of SNR in the high SNR regime, i.e.,\nthe full spatial multiplexing gain, while the obtained lower bounds are loose in the low-to-moderate SNR regime.\nChannel estimation based on pilot information is also considered in this paper. The main difference between the\nprevious works and this paper appears in the receiver structure. We consider joint channel and data estimation based\non SD, whereas in the previous works data symbols decoded successfully were not utilized for refining channel\nestimates.\nOne fading block is decomposed into the training phase TTtr = {1, . . . , Ttr } and the communication phase\nCTtr +1 = {Ttr + 1, . . . , Tc }, which consist of the first Ttr symbol periods and of the remaining (Tc − Ttr ) symbol\nperiods, respectively. The transmitter sends pilot symbol vectors in the training phase, and transmits data symbol\nvectors in the communication phase. Therefore, the transmitted vector xt is assumed to be known to the receiver\n\nOctober 25, 2018\n\nDRAFT\n\n\fIEEE TRANSACTIONS ON INFORMATION THEORY, VOL. , NO. , 2011\n\n7\n\nfor t ∈ TTtr . For simplicity, we assume that the pilot symbol matrix X TTtr = (x1 , . . . , xTr ) ∈ CM×Ttr has zeromean i.i.d. entries with i.i.d. real and imaginary parts. Furthermore, we assume that each pilot symbol satisfies\nE[|xm,t |2 ] = P for t ∈ TTtr , since the accuracy of channel estimation should improve as the power of pilot\nsymbols increases. The transmission of i.i.d. data symbols can achieve the capacity of the MIMO channel (1) with\nperfect CSI at the receiver. If accurate channel estimates are obtained by joint channel and data estimation, thus,\ni.i.d. signaling should be a reasonable option for training-based transmissions. We assume that the data symbols\n{xm,t : t ∈ CTtr +1 } are i.i.d. random variables with i.i.d. real and imaginary parts for all m and t ∈ CTtr +1 . Note\nthat zero-mean is not assumed for the data symbols. Under this assumption, the achievable rate is monotonically\nincreasing with the power of each data symbol. We hereinafter let E[|xm,t |2 ] = P .\nIn this paper, we consider a biased signaling scheme, in which the mean E[xm,t ] = θm,t of the data symbol for\nPTc\nt ∈ CTtr +1 is biased while the long-term average (Tc − Ttr )−1 t=T\nθm,t tends to zero as Tc → ∞. In order to\ntr +1\n\napply the replica method, we assume that {R[θm,t ], I[θm,t ] : for all m, t} are independently drawn from a zero-\n\nmean hyperprior probability density function (pdf)2 p(θ) with variance σθ2 /2. The transmitter informs the receiver\nin advance about the bias matrix Θ = (O, θTtr +1 , . . . , θTc ) ∈ CM×Tc , with θ t = (θ1,t , . . . , θM,t )T . In other words,\nΘ is assumed to be known to the receiver. The biased signaling can reduce the overhead for training [20] compared\nto the conventional pilot-assisted schemes. We present two examples of biased signaling: biased QPSK and biased\nGaussian signaling. See [21]–[23] for implementations of biased QPSK.\np\nExample 1 (Biased QPSK). For R[xm,t ], I[xm,t ] ∈ {± P/2}, the prior pmf of xm,t for biased QPSK is given\n\nby\n\np(xm,t |θm,t ) =\n\n1 + R[θm,t ]/R[xm,t ] 1 + I[θm,t ]/I[xm,t ]\n.\n2\n2\n\n(5)\n\np\np\nThe non-negativity of probability restricts the support of the hyperprior pdf p(θ) to R[θm,t ] ∈ [− P/2, P/2]\np\np\nand I[θm,t ] ∈ [− P/2, P/2]. It is straightforward to check that E[xm,t |θm,t ] = θm,t and E[|xm,t |2 |θm,t ] = P .\nExample 2 (Biased Gaussian Signaling). The prior pdf of xm,t ∈ C for biased Gaussian signaling is given by\n2\n\n|x\n−θm,t |\n− Pm,t\n1\n−|θm,t |2\np(xm,t |θm,t ) =\ne\n.\n(6)\nπ(P − |θm,t |2 )\n√\nNote that the support of the hyperprior pdf p(θ) is restricted to |θm,t | < P , due to the positivity of variance.\n\nThe main results presented in this paper hold for a general prior of xm,t with finite moments. The performance\nfor the biased Gaussian signaling corresponds to a performance bound for multilevel modulation with trellis\nshaping [42], [43].\n2\n\nWhen θm,t is discrete, p(θ) denotes a probability mass function (pmf).\n\nOctober 25, 2018\n\nDRAFT\n\n\fIEEE TRANSACTIONS ON INFORMATION THEORY, VOL. , NO. , 2011\n\n8\n\nstage number\nTtr+1\n\nt\n\nTc\n\nsubstage number\n\n1\n\nm\nM\n\nFig. 1.\n\nSuccessive decoding.\n\nIII. R ECEIVERS\nA. Successive Decoding\nWe consider an SD receiver [18], [19] (See Fig. 1). The data symbol vectors {xt } are decoded in the order\n\nt = Ttr + 1, . . . , Tc . In stage t, the matrix X (Ttr ,t) = (xTtr +1 , . . . , xt−1 ) ∈ CM×(t−Ttr −1) contains the data symbol\nvectors decoded in the preceding stages. Stage t consists of M substages, in which the elements {xm,t } are decoded\n\nin the order m = 1, . . . , M . In substage m within stage t, the vector x[1,m),t = (x1,t , . . . , xm−1,t )T ∈ Cm−1 consists\nof the data symbols decoded in the preceding substages. The channel estimator utilizes the data symbols X (Ttr ,t)\n\ndecoded in the preceding stages, along with the received matrix Y \\t ∈ CN ×(Tc −1) and the pilot information\n{X TTtr , Θ(t,Tc ] }, in which the matrices Y \\t and Θ(t,Tc ] ∈ CM×(Tc −t) are obtained by eliminating the tth column\n\nvector from the received matrix Y and the first t column vectors from the bias matrix Θ, respectively. We write the\ninformation used for channel estimation in stage t as It = {X̄ \\t , Y \\t }, with X̄ \\t = (X TTtr , X (Ttr ,t) , Θ(t,Tc ] ) ∈\n\nCM×(Tc −1) . In substage m within stage t, the detector with successive interference cancellation (SIC) uses the data\nsymbols x[1,m),t decoded in the preceding substages and the bias vector θ [m,M],t = (θm,t , . . . , θM,t )T to subtract\ninter-stream interference from the received vector y t , and then perform multiuser detection (MUD).\nLet us define the constrained capacity of the MIMO system based on the pilot information {X TTtr , Θ} as the\nconditional mutual information per symbol period between all data symbol vectors {xt : t ∈ CTtr +1 } and the\nreceived matrix Y conditioned on the pilot symbol matrix X TTtr and the bias matrix Θ [44]\nC=\n\n1\nI({xt : t ∈ CTtr +1 }; Y |X TTtr , Θ).\nTc\n\n(7)\n\nIt is straightforward to confirm that the optimal SD receiver can achieve the constrained capacity (7). Applying the\n\nOctober 25, 2018\n\nDRAFT\n\n\fIEEE TRANSACTIONS ON INFORMATION THEORY, VOL. , NO. , 2011\n\n9\n\nchain rule for mutual information to (7) repeatedly [44], we obtain\nC=\n\n=\n\n=\n\n1\nTc\n1\nTc\n1\nTc\n\nTc\nX\n\nt=Ttr +1\nTc\nX\n\nt=Ttr +1\nTc\nX\n\nI(xt ; Y |X TTtr , Θ, X (Ttr ,t) )\nI(xt ; y t |It , Θ(Ttr ,t) , θt )\nM\nX\n\nt=Ttr +1 m=1\n\nI(xm,t ; y t |It , x[1,m),t , θ[m,M],t ),\n\n(8)\n\nwith Θ(Ttr ,t) = (θ Ttr +1 , . . . , θt−1 ). In the derivation of the second equality, we have used the fact that xt and\nY \\t are independent of each other, due to the i.i.d. assumption of the data symbols. In the last expression, we\nhave omitted conditioning with respect to Θ(Ttr ,t) and θ[1,m),t = (θ1,t , . . . , θm−1,t )T , which are not utilized by the\nreceiver in substage m within stage t since they are the parameters of the known data symbols X (Ttr ,t) and x[1,m),t .\nFor notational simplicity, this omission is applied throughout this paper. Note that Θ(Ttr ,t) and θ[1,m),t affect the\nachievable rate (8). Expression (8) implies that the SD scheme results in no loss of information if the detector with\nSIC can achieve the mutual information I(xm,t ; y t |It , x[1,m),t , θ [m,M],t ) in substage m within stage t.\nIt is difficult to evaluate the mutual information I(xm,t ; y t |It , x[1,m),t , θ [m,M],t ) exactly. Instead, we derive a\nlower bound based on LMMSE channel estimation. We first introduce the optimal channel estimator and then define\nthe LMMSE channel estimator.\nB. Channel Estimators\n1) Optimal Channel Estimator: We focus on stage t in this section. The optimal channel estimator uses the\ninformation It to estimate the channel matrix H, and sends the joint posterior pdf\np(H|It ) = R\n\np(Y \\t |H, X̄ \\t )p(H)\n,\np(Y \\t |H, X̄ \\t )p(H)dH\n\n(9)\n\nto the detector with SIC. In (9), the pdf p(Y \\t |H, X̄ \\t ) is decomposed into the product of pdfs p(Y \\t |H, X̄ \\t ) =\nQt−1\nQTc\nt′ =1 p(y t′ |H, xt′ )\nt′ =t+1 p(y t′ |H, θ t′ ), given by\nZ\n(10)\np(y t′ |H, θt′ ) = p(y t′ |H, xt′ )p(xt′ |θt′ )dxt′ ,\nwhere p(y t′ |H, xt′ ) represents the MIMO channel (1). Note that the joint posterior pdf (9) is decomposed into the\nQ\n1×M\n~\n~\nproduct N\ndenoting the nth row vector of H, due\nn=1 p(hn |It ) of the marginal posterior pdfs, with hn ∈ C\nto the assumption of i.i.d. fading.\n\nThe optimal channel estimator is nonlinear in general, which makes it difficult to analyze detectors with SIC, while\nit is possible to evaluate the performance of the optimal channel estimator. In order to circumvent this difficulty,\nwe reduce the optimal channel estimator to an LMMSE channel estimator by considering a virtual MIMO channel.\n2) LMMSE Channel Estimator: We use Médard's method [16] to replace the MIMO channels (1) for t′ =\nt + 1, . . . , Tc by virtual MIMO channels\n1\nỹ t′ = √ Hθ t′ + wt′ + nt′ ,\nM\nOctober 25, 2018\n\n(11)\n\nDRAFT\n\n\fIEEE TRANSACTIONS ON INFORMATION THEORY, VOL. , NO. , 2011\n\n10\n\nwhere wt′ ∈ CN denotes a CSCG random vector with the covariance matrix (P −σt2′ )I N , with σt2′ = M −1\n\nPM\n\nm=1\n\n|θm,t′ |2 .\n\nThe virtual MIMO channel (11) is obtained by extracting the term M −1/2 H(xt′ − θ t′ ) from the first term of the\nright-hand side (RHS) in the original MIMO channel (1) and then replacing it by the AWGN term wt′ with\n\nthe covariance matrix cov[M −1/2 H(xt′ − θt′ )|θ t′ ]. This replacement implies that information about the channel\nmatrix included in H(xt′ − θt′ ) is discarded. Thus, channel estimation based on the virtual MIMO channel (11)\nshould be inferior to that based on the original MIMO channel (1). In other words, the mutual information\nI(xm,t ; y t |It , x[1,m),t , θ [m,M],t ) should be bounded from below by\nI(xm,t ; y t |It , x[1,m),t , θ[m,M],t ) ≥ I(xm,t ; y t |Ĩt , x[1,m),t , θ[m,M],t ),\n\n(12)\n\nwhich denotes the constrained capacity of the MIMO channel (1) in symbol period t with side information Ĩt =\n{X̄ \\t , Ỹ \\t }, x[1,m),t , and θ [m,M],t , in which Ỹ \\t = (y 1 , . . . , y t−1 , ỹ t+1 , . . . , ỹ Tc ) contains the received vectors\nof the virtual MIMO channel (11) in the last (Tc − t) elements while the first (t − 1) elements of Ỹ \\t are the same\nas those of the original one Y \\t . From (1) and (11), the matrix Ỹ \\t is explicitly given by\n1\nỸ \\t = √ H X̄ \\t + (O, W (t,Tc ] ) + N \\t ,\nM\n\n(13)\n\nwith W (t,Tc ] = (w t+1 , . . . , wTc ) ∈ CN ×(Tc −t) . In (13), the matrix N \\t ∈ CN ×(Tc −1) is obtained by eliminating\nthe tth column vector from the noise matrix N .\nLet us consider channel estimation based on the information Ĩt . The optimal channel estimator for this case\nconstructs the joint posterior pdf p(H|Ĩt ) and feeds it to the detector with SIC. The joint posterior pdf of H given\nĨ t is defined by (9) in which the pdf (10) for t′ = t + 1, . . . , Tc is replaced by\nZ\np(ỹ t′ |H, θt′ ) = p(ỹ t′ |H, θt′ , wt′ )p(wt′ |θt′ )dw t′ ,\n\n(14)\n\nwhere p(ỹ t |H, θt′ , wt′ ) represents the virtual MIMO channel (11). A straightforward calculation indicates that\n\nthe joint posterior pdf p(H|Ĩt ) is a proper complex Gaussian pdf with mean Ĥ t ∈ CN ×M and covariance\n\n~ 1, . . . , ~\ncov[(h\nhN )T |Ĩt ] = I N ⊗ Ξt , given by\n\" t−1\n#\nTc\nX y ′ xH′\nX\nỹ t′ θH\n1\nt t\nt′\nΞt ,\n+\nĤ t = √\nP − σt2′ + N0\nM t′ =1 N0\nt′ =t+1\n!#−1\n\"\nTc\nt−1\nX\nθt′ θH\n1 X xt′ xH\nt′\nt′\n.\n+\nΞt = I M +\nM ′\nN0\nP − σt2′ + N0\n′\nt =1\n\n(15)\n\n(16)\n\nt =t+1\n\nThe posterior mean Ĥ t coincides with the LMMSE estimator of H based on the received matrix Ỹ \\t and the\nknown information X̄ \\t . Furthermore, Ξt is equal to the error covariance matrix of the LMMSE estimator for\neach row vector of H. Thus, we refer to the optimal channel estimator for the virtual MIMO channel (11) as the\nLMMSE channel estimator.\nNote that the linear filter given by (15) provides the LMMSE estimates of H for the original MIMO channel (1).\nOne should not confuse the LMMSE channel estimator for the virtual MIMO channel (11) with that for the original\nMIMO channel (1). The former, which is considered in this paper, is the optimal channel estimator for the virtual\nMIMO channel (11), while the latter is a suboptimal channel estimator for the original MIMO channel (1).\nOctober 25, 2018\n\nDRAFT\n\n\fIEEE TRANSACTIONS ON INFORMATION THEORY, VOL. , NO. , 2011\n\n11\n\nC. Detectors\n1) Optimal Detector: We focus on substage m within stage t and define the optimal detector with SIC, which\nachieves the lower bound (12). The optimal detector with SIC feeds to the associated decoder the posterior pdf3\nof xm,t based on the knowledge about the received vector y t , the data symbols x[1,m),t decoded in the preceding\nsubstages, the bias θ[m,M],t for the unknown data symbols x[m,M],t = (xm,t , . . . , xM,t )T , and the joint posterior\npdf p(H|Ĩt ) provided by the LMMSE channel estimator, given by\nR\np(y t |xt , Ĩt )p(x[m,M],t |θ[m,M],t )dx(m,M],t\np(xm,t |y t , Ĩt , x[1,m),t , θ[m,M],t ) = R\np(y t |xt , Ĩt )p(x[m,M],t |θ [m,M],t )dx[m,M],t\n\nwith x(m,M],t = (xm+1,t , . . . , xM,t )T ∈ CM−m . In (17), the pdf p(y t |xt , Ĩt ) is given by\nZ\np(y t |xt , Ĩt ) = p(y t |H, xt )p(H|Ĩt )dH,\n\n(17)\n\n(18)\n\nwhere p(y t |H, xt ) represents the MIMO channel (1). The use of SIC appears in the pdf (18), which is a proper com-\n\nplex Gaussian pdf with mean M −1/2 Ĥ t xt and covariance (N0 +M −1 xH\nt Ξt xt )I N . Expression (17) implies that the\noptimal detector with SIC subtracts the known inter-stream interference M −1/2 Ĥ t (x[1,m),t T , 0, θ(m,M],t T )T from\nthe received vector y t , with θ (m,M],t = (θm+1,t , . . . , θM,t )T , and then mitigates residual inter-stream interference\nby performing the optimal nonlinear MUD.\nLet x̃m,t ∈ C denote a random variable following the marginal posterior pdf (17). Since the lower bound (12)\nis equal to the mutual information I(xm,t ; x̃m,t |Ĩt , x[1,m),t , θ [m,M],t ), the achievable rate (8) of the optimal SD\nreceiver is bounded from below by\n1\nC≥\nTc\n\nTc\nX\n\nM\nX\n\nt=Ttr +1 m=1\n\nI(xm,t ; x̃m,t |Ĩt , x[1,m),t , θ[m,M],t ),\n\n(19)\n\nwhich is given via the equivalent channel between the data symbol xm,t and the associated decoder\np(x̃m,t |xm,t , Ĩt , x[1,m),t , θ[m,M],t )\nZ\n= p(xm,t = x̃m,t |y t , Ĩt , x[1,m),t , θ[m,M],t )p(y t |xt , Ĩt )p(x(m,M],t |θ(m,M],t )dx(m,M],t dy t .\n\n(20)\n\n2) LMMSE Detector: Since the optimal detector is infeasible in terms of the complexity, it is important in\npractice to obtain a lower bound based on the LMMSE detector with SIC. We follow [17] to derive the LMMSE\ndetector that feeds to the associated detector an approximate posterior pdf of xm,t based on the knowledge about the\nreceived vector y t , the data symbols x[1,m),t decoded in the preceding substages, the bias θ[m,M],t for the unknown\ndata symbols x[m,M],t = (xm,t , . . . , xM,t )T , and the joint posterior pdf p(H|Ĩt ) provided by the LMMSE channel\nestimator.\nWe first divide the RHS of the MIMO channel (1) into two terms:\n1\n1\ny t = √ Ĥ t xt + √ (H − Ĥ t )xt + nt ,\nM\nM\n3 The\n\n(21)\n\nmarginal posterior pdf (17) is replaced by the posterior pmf of xm,t if xm,t is a discrete random variable.\n\nOctober 25, 2018\n\nDRAFT\n\n\fIEEE TRANSACTIONS ON INFORMATION THEORY, VOL. , NO. , 2011\n\n12\n\nwith Ĥ t denoting the LMMSE estimate (15) of the channel matrix. Let Ĥ [1,m),t ∈ CN ×(m−1) and Ĥ [m,M],t ∈\nCN ×(M−m+1) denote the matrices that consist of the first (m − 1) column vectors of the LMMSE estimate (15)\n\nand of the last (M − m + 1) column vectors, respectively. The first term of the RHS in (21) is further decomposed\ninto two terms:\n1\n1\n1\ny t = √ Ĥ [1,m),t x[1,m),t + √ Ĥ [m,M],t x[m,M],t + √ (H − Ĥ t )xt + nt ,\nM\nM\nM\n\n(22)\n\nwhere the first term of the RHS is a known quantity. From this expression, the LMMSE detector is defined via the\npostulated MIMO channel\n(L)\n\nỹ t\n(L)\n\nwhere ỹ t\n\n1\n1\n(L)\n(L)\n− √ Ĥ [1,m),t x[1,m),t = √ Ĥ [m,M],t x̃[m,M],t + w̃t + nt ,\nM\nM\n(L)\n\n(L)\n\n(23)\n\n(L)\n\n∈ CN and x̃[m,M],t = (x̃m,t , . . . , x̃M,t )T ∈ CM−m+1 denote the received vector and the data symbol\n(L)\n\nvector postulated by the LMMSE detector, respectively. The postulated data symbol vector x̃[m,M],t is assumed to\nbe a proper complex Gaussian random vector with mean θ[m,M],t and covariance\nΣm,t = P I M−m+1 − diag(|θm,t |2 , . . . , |θM,t |2 ),\n\n(24)\n(L)\n\nwhich are the same as the mean and covariance of the original vector x[m,M],t , respectively. Furthermore, w̃ t\n\n∈ CN\n\nis a CSCG random vector with the covariance matrix ζm,t I N , in which\nζm,t =\nwith\n\n\u0001\n1\nTr E[xt xH\nt |x[1,m),t ]Ξt ,\nM\n\n2\n2\nE[xt xH\nt |x[1,m),t ] = diag(|x1,t | , . . . , |xm−1,t | , P, . . . , P ).\n(L)\n\nNote that w̃t\n\n(25)\n\n(26)\n\nhas the same first and second moments as those of the third term on the RHS of (22).\n(L)\n\n(L)\n\nThe posterior distribution of x̃[m,M],t given ỹ t , Ĩt , x[1,m),t , and θ[m,M],t is a proper complex Gaussian\n(L)\n\n(L)\n\ndistribution with mean x̂[m,M],t and covariance Ξm,t , given by\n\u001a\n\u0013\n\u001b\n\u0012\nH\n1\n1\n(L)\n(L)\n(L)\nθ\nx̂[m,M],t = (Ξm,t )−1 √ (N0 + ζm,t )−1 Ĥ [m,M],t ỹ t − √ Ĥ [1,m),t x[1,m),t + Σ−1\nm,t [m,M],t ,\nM\nM\n\u0012\n\u0013−1\nH\n1\n(L)\n−1\n−1\nΞm,t = Σm,t +\n(N0 + ζm,t ) Ĥ [m,M],t Ĥ [m,M],t\n.\nM\n(L)\n\nNote that the posterior mean (27) with ỹ t\n\n(27)\n(28)\n\n= y t is equal to the LMMSE estimate of x[m,M],t . The LMMSE\n(L)\n\n(L)\n\n= y t , Ĩt , x[1,m),t , θ[m,M],t ), corresponding to (17),\n(L)\n(L)\np(x̃[m,M],t |ỹ t , Ĩt , x[1,m),t , θ [m,M],t ). Thus, we have a\n\ndetector with SIC sends the marginal posterior pdf p(x̃m,t |ỹ t\ngiven via the marginalization of the joint posterior pdf\n\nlower bound of the achievable rate based on the LMMSE detector with SIC\nTc\nM\nX\n1 X\n(L)\nC≥\nI(xm,t ; x̃m,t |Ĩt , x[1,m),t , θ[m,M],t ),\nTc\nm=1\n\n(29)\n\nt=Ttr +1\n\nwhich is given via the equivalent channel between the data symbol xm,t and the associated LMMSE detector in\nthe same manner as in (19).\nThe goal of this paper is to optimize the length of training phase Ttr , the prior pdf of the data symbols, and the\nhyperprior pdf of the bias in terms of the two lower bounds (19) and (29).\nOctober 25, 2018\n\nDRAFT\n\n\fIEEE TRANSACTIONS ON INFORMATION THEORY, VOL. , NO. , 2011\n\n13\n\nIV. M AIN R ESULTS\nA. Large-System Analysis\nFirst, the lower bound (19) based on the optimal detector is evaluated in the large-system limit. We focus\non substage m within stage t in the SD receiver. In order to calculate I(xm,t ; x̃m,t |Ĩt , x[1,m),t , θ[m,M],t ), we\nhave to evaluate the distribution of the equivalent channel (20), which is a probability distribution on the space\nof distributions and depends on the omitted variables Θ(Ttr ,t) and θ[1,m),t implicitly through the posterior pdf\np(H|Ĩt ) and x[1,m),t . This evaluation is quite difficult in general for finite-sized systems. A key assumption of\ncircumventing this difficulty is the assumption of the large-system limit in which M , N , Tc , Ttr , t, and m tend to\ninfinity while their ratios α = M/N , β = M/Tc , τ0 = Ttr /Tc , τ = t/Tc , and μ = m/M are kept constant. The\nself-averaging property for the equivalent channel (20) is expected to hold in the large-system limit: The distribution\nof the equivalent channel (20) converges to a Dirac measure on the space of distributions in the large-system limit.\nSee [45] for a mathematical treatment of self-averaging. The assumption of self-averaging implies that the detection\nperformance for each data symbol coincides with the corresponding average performance in the large-system limit.\nUnder this assumption, the replica method allows us to analyze the equivalent channel (20) in the large-system\nlimit.\nThe self-averaging properties are classified into those for extensive quantities and those for non-extensive quantities. The former quantities are proportional to the size of systems, while the latter quantities are not. The selfaveraging property for extensive quantities, such as sum capacity and the so-called free-energy in statistical physics,\nhas been rigorously justified for linear systems [25] and general systems [46], [47]. It might be possible to prove the\nself-averaging property for the lower bound (19) by using the method developed in [46], [47]. However, we need\nthe self-averaging property for each equivalent channel (20), which is non-extensive. The self-averaging property\nfor non-extensive quantities is less understood except for several simple cases.\nWe also need the self-averaging property for each element of the error covariance matrix (16), along with that\nfor the equivalent channel (20). Note that the error covariance matrix (16) is a random matrix depending on X̄ \\t\nexplicitly and on Θ(Ttr ,t) implicitly through the data symbol vectors decoded in the preceding stages. See [48] for\nthe self-averaging property of each diagonal element for random covariance matrices.\nAssumption 1. Each element of the error covariance matrix (16) for the LMMSE channel estimation converges in\nprobability to a deterministic value in the large-system limit,\n\n\n\nξ 2 (τ )\n\n\n(Ξt )m̃,m̃′ →\nρ(τ )\n\n\n\n ρ∗ (τ )\n\ni.e.,\nfor m̃ = m̃′\nfor m̃ < m̃′\n\n(30)\n\nfor m̃ > m̃′ .\n\nThe error covariance matrix (16) does not depend on the number of receive antennas N or the current substage m.\n\nThus, the limits (30) do not depend on α or μ, while they may depend on β, τ0 , and τ . Assumption 1 has been\nrigorously proved for the unbiased case θm,t = 0 in [26].\n\nOctober 25, 2018\n\nDRAFT\n\n\fIEEE TRANSACTIONS ON INFORMATION THEORY, VOL. , NO. , 2011\n\n14\n\nAssumption 2. The equivalent channel (20) is self-averaging with respect to Ỹ \\t and x[1,m),t : (20) converges\nin law to a conditional pdf of x̃m,t given xm,t , X̄ \\t , and θ t , which does not depend on Ỹ \\t or x[1,m),t , in the\nlarge-system limit.\nThe self-averaging property for equivalent channels has been rigorously proved in the case of linear receivers by\nusing random matrix theory [24], [26], while its justification is still open for nonlinear receivers. The equivalent\nchannel (20) is also expected to be self-averaging with respect to the other random variables. However, Assumption 2\nis sufficient for using the replica method. We postulate Assumptions 1 and 2 since their justification is beyond the\nscope of this paper.\nFollowing the replica methodology raises the issue of whether replica symmetry (RS) or replica symmetry breaking\n(RSB) should be assumed. The formal definition of the RS assumption will be presented in Appendices B and C.\nRoughly speaking, RSB should be assumed for complicated optimization problems in which the object function has\nmulti-valley structure [36], [37]. There are many local optima for such an object function. On the other hand, the RS\nassumption is applicable to simple problems such that the object function has the unique global optimum or a few\nlocal optima. Nishimori's rigorous result [49] suggests that the individually optimal (IO) detection [50] considered\nin this paper should have a simple structure corresponding to the RS assumption, while the jointly optimal (JO)\ndetection [50] should be a complicated problem corresponding to the RSB assumption. A recent rigorous study [51]\nalso supports the RS assumption for the IO detection. Thus, the RS assumption is postulated in this paper. Note\nthat the self-averaging property for the equivalent channel might not hold if the system had a complicated structure\ncorresponding to the RSB assumption [37], [52].\nThe lower bound (19) is given as a double integral of the constrained capacity for AWGN channels. We first\nderive the AWGN channels in a heuristic manner. The heuristic derivation described below provides an intuitive\ninterpretation of the AWGN channels, although the formal derivation is based on the replica method. In the current\nstage t = τ Tc , with τ0 ≤ τ ≤ 1, we consider fading channels with time diversity for channel estimation,\n1\ny n,t′ = √ hn,m xm,t′ + w n,t′ ,\nM\n1\nyn,t′ = √ hn,m θm,t′ + wn,t′ ,\nM\n\nfor all t′ < t,\n\n(31)\n\nfor all t′ > t,\n\n(32)\n\n2\nwith w n,t′ ∼ CN (0, σtr\n) for t′ < t and with w n,t′ ∼ CN (0, σc2 ) for t′ > t. The fading channels are obtained by\n\nextracting the first terms in (31) and (32) from the original and virtual MIMO channels (1) and (11), and then by\n2\napproximating the remaining terms by CSCG random vectors with covariance σtr\nI N and σc2 I N , respectively. We\n\napply maximal-ratio combining (MRC) to (31) and (32),\nτX\nTc −1\n1\nz tr = p\nx∗m,t′ yn,t′ ,\nP (τ Tc − 1) t′ =1\n\n1\nzc = p 2\nσθ (1 − τ )Tc\nOctober 25, 2018\n\nTc\nX\n\n∗\n.\nθm,t\n′y\nn,t′\n\n(33)\n\n(34)\n\nt′ =τ Tc +1\n\nDRAFT\n\n\fIEEE TRANSACTIONS ON INFORMATION THEORY, VOL. , NO. , 2011\n\n15\n\nTaking the large-system limit, due to the weak law of large numbers, we obtain\n √\n \n\n \nτP\nz tr\nw\n1\n  = √ p\n hn,m +  tr  ,\n2\nβ\n(1 − τ )σθ\nzc\nwc\n\n(35)\n\n2\nwhere wtr and wc are mutually independent CSCG random variables with variances σtr\nand σc2 , respectively. The\n\nminimum mean-squared error (MMSE) estimate of hn,m for the channel (35) is given by [53]\n!\np\n√\n(1 − τ )σθ2\nτP\n1\nzc .\nĥn,m = √ 2\n2 z tr +\nσtr\nσc2\nβξ (τ )\nwhere the mean-squared error (MSE) ξ 2 (τ ) for the MMSE estimate (36) is explicitly given by\n\u0012\n\u0013−1\nτP\n(1 − τ )σθ2\n2\nξ (τ ) = 1 + 2 +\n.\nσtr β\nσc2 β\n\n(36)\n\n(37)\n\nIt is well known that the MMSE estimate ĥn,m and the estimation error ∆hn,m = hn,m − ĥn,m are uncorrelated\nCSCG random variables with variances (1 − ξ 2 (τ )) and ξ 2 (τ ), respectively.\n\nWe next consider fading channels with spatial diversity for data estimation in the current substage m = μM for\n0 ≤ μ ≤ 1,\n\no\n1 n\nĥn,m xm,t + ∆hn,m xm,t + wn,t ,\ny n,t = √\nM\n\nn = 1, . . . , N,\n\n(38)\n\nwhere w n,t ∈ C denotes a CSCG random variable with variance σ 2 (τ, μ). Applying the MRC to {yn,t }, we obtain\nN\nX\n∗\n1\nz= p\nĥn,m y n,t .\nN (1 − ξ 2 (τ )) n=1\n\nTaking the large-system limit gives the AWGN channel\nr\n1 − ξ 2 (τ )\nxm,t + w,\nz=\nα\n\n(39)\n\n(40)\n\nwith w ∼ CN (0, σ 2 (τ, μ)). The MMSE estimate x̂m,t of xm,t for the AWGN channel (40) is given as the mean\nR\nx̂m,t = xm,t p(xm,t |z, θm,t )dxm,t with respect to the posterior pdf\np(xm,t |z, θm,t ) = R\n\np(z|xm,t )p(xm,t |θm,t )\n,\np(z|xm,t )p(xm,t |θm,t )xm,t\n\n(41)\n\nwhere p(z|xm,t ) represents the AWGN channel (40). The MSE for the MMSE estimate x̂m,t given θm,t is defined\nas\n\u0002\n\u0003\nMSE(σ 2 , θm,t ) = E |xm,t − x̂m,t |2 θm,t .\n\n(42)\n\n2\nWe have not so far specified the variances σtr\n, σc2 , and σ 2 (τ, μ). The constrained capacity of the AWGN\n\nchannel (40) corresponds to the mutual information in the lower bound (19) when the three variances are determined\nas solutions to fixed-point equations.\nProposition 1 (Optimal Detector). Suppose that Assumption 1, Assumption 2, and the RS assumption hold. Then,\nthe constrained capacity (7) per transmit antenna is bounded from below by\nZ\nZ\nC\nI(xm,t ; z|θm,t )dτ dμ,\n≥\nM\nτ ∈[τ0 ,1] μ∈[0,1]\nOctober 25, 2018\n\n(43)\n\nDRAFT\n\n\fIEEE TRANSACTIONS ON INFORMATION THEORY, VOL. , NO. , 2011\n\n16\n\nin the large-system limit, in which the mutual information I(xm,t ; z|θm,t ) is equal to the constrained capacity of\n2\n, σc2 } is given as the solution to the coupled fixed-point\nthe AWGN channel (40). In evaluating I(xm,t ; z|θm,t ), {σtr\n\nequations\n2\nσtr\n= N0 + P ξ 2 (τ ),\n\n(44)\n\nσc2 = N0 + (P − σθ2 ) + σθ2 ξ 2 (τ ),\n\n(45)\n\nwhere ξ 2 (τ ) is given by (37). Furthermore, σ 2 (τ, μ) is given as a solution σ 2 to the fixed-point equation\n\u0002\n\u0003\nσ 2 = N0 + P ξ 2 (τ ) + (1 − μ)(1 − ξ 2 (τ ))E MSE(σ 2 , θm,t ) ,\n\n(46)\n\nwhere MSE(σ 2 , θm,t ) is given by (42). If the fixed-point equation (46) has multiple solutions, one should choose\nthe solution minimizing the following quantity\n(1 − μ)I(xm,t ; z|θm,t ) +\n\n\u0014\n\u0015\n1\nξ 2 (τ )\nD2 (N0 kσ 2 ) +\nlog\ne\n.\n2\nα\nσ2\n\n(47)\n\nDerivation of Proposition 1: See Appendix A.\n2\nNote that the last terms in the coupled fixed-point equations (44) and (45) depend on σtr\nand σc2 through (37).\n\nEquation (46) for given ξ 2 (τ ) provides a fixed-point equation with respect to σ 2 . The second and last terms in the\nRHS of (46) correspond to contributions from channel estimation errors and inter-stream interference, respectively.\nThe integrand in (43) depends on the variables τ and μ through the SNR P (1 − ξ 2 (τ ))/(ασ 2 (τ, μ)).\nThe existence of multiple solutions in (46) relates to the so-called phase transition in statistical physics. See [28],\n[31] for an interpretation in the context of communications. Numerical evaluation of (46) for QPSK modulation\nimplies that multiple solutions do not appear when α ≤ 1. In the high SNR regime there is no point to use\ntransmit antennas more than receive antennas or half the coherence time. In fact, Zheng and Tse [10] proved\nthat the full spatial multiplexing gain of the MIMO channel with no CSI is given by M̄ (1 − M̄ /Tc ), with M̄ =\nmin{M, N, ⌊Tc /2⌋}, which is achieved by using min{N, ⌊Tc /2⌋} transmit antennas out of M transmit antennas\nif M > N or M > ⌊Tc /2⌋. Thus, we consider α ≤ 1 and β ≤ 1/2 in the high SNR regime.\nNext, the lower bound (29) based on the LMMSE detector is evaluated in the large-system limit. The following\nproposition is obtained in the same manner as in the derivation of Proposition 1.\nAssumption 3. The equivalent channel for the LMMSE detector is self-averaging with respect to Ỹ \\t and x[1,m),t\nin the large-system limit.\nProposition 2 (LMMSE Detector). Suppose that Assumption 1, Assumption 3, and the RS assumption hold. Then,\nthe constrained capacity (7) per transmit antenna is bounded from below by (43) in the large-system limit. In\n2\nevaluating (43), {σtr\n, σc2 } is given as the solution to the coupled fixed-point equations (44) and (45). On the other\n\nhand, σ 2 (τ, μ) is given as the unique solution σ 2 to the fixed-point equation\n\u0015\n\u0014\n(P − |θm,t |2 )ασ 2\n2\n2\n2\n.\nσ = N0 + P ξ (τ ) + (1 − μ)(1 − ξ (τ ))E\n(1 − ξ 2 (τ ))(P − |θm,t |2 ) + ασ 2\n\nOctober 25, 2018\n\n(48)\n\nDRAFT\n\n\fIEEE TRANSACTIONS ON INFORMATION THEORY, VOL. , NO. , 2011\n\n17\n\nDerivation of Proposition 2: Proposition 2 is obtained by repeating the derivation of Proposition 1. Thus, we\nonly prove the uniqueness of the solution to the fixed-point equation (48). The RHS of (48) is a concave function\nof σ 2 , which intersects with a straight line passing the origin with slope 1 at two points. Since the concave function\npasses the point (0, N0 +ξ 2 (τ )), which is above the origin, one intersection must be in σ 2 < 0. Thus, the fixed-point\nequation (48) has the unique solution in the region σ 2 > 0.\nThe expectation in the RHS of (48) corresponds to the MSE for the LMMSE estimator of the data symbol xm,t\ntransmitted through the AWGN channel (40), while (42) in the fixed-point equation (46) is the MSE for the MMSE\nestimator.\nB. Optimization\nThe next goal is to optimize the lower bound (43) based on the optimal detector with respect to τ0 , the hyperprior\npdf of θm,t , and the prior pdf of xm,t . We first notice that the lower bound (43) is monotonically nonincreasing\nwith respect to τ0 since the integrand is non-negative and does not depend on τ0 . Thus, the lower bound (43) is\nmaximized as τ0 → 0. Note that the limit τ0 → 0 does not necessarily indicate no pilot symbols, since we have\ntaken the limit τ0 → 0 after the large-system limit. In other words, the effect of pilot symbols is negligible in\nProposition 1 if Ttr is sublinear in Tc , i.e., Ttr = o(Tc ).\nNext, we maximize the lower bound (43) with respect to the hyperprior pdf of θm,t . For a fixed hyperprior pdf,\nthe SNR P (1−ξ 2 (τ ))/(ασ 2 (τ, μ)) improves as the variance σθ2 grows, since the increase of σθ2 results in reductions\nof the channel estimator error ξ 2 (τ ) and the inter-stream interference given by the last term in the RHS of (46).\nHowever, increasing σθ2 reduces the mutual information I(xm,t ; z|θm,t ) for a fixed SNR, due to the reduction of\npayload. Interestingly, numerical results presented in Section V show that the lower bound (43) is maximized as\nσθ2 → 0 for a fixed hyperprior pdf of θm,t . This indicates that the lower bound (43) is maximized when θm,t = 0\nwith probability one.\nThe arguments described above indicate that negligible pilot information, or more precisely, the limits τ0 , σθ2 → 0\nare best in the large-system limit, while τ0 = β is best in terms of the HH bound [15]. Thus, we can conclude that\nthe SD scheme can reduce the overhead for training significantly. It is worth noting that using a capacity-achieving\nerror-correcting code is assumed in our analysis. We conjecture that if some practical coding is used finite τ0 or\nσθ2 are required for getting accurate channel estimates in the initial stage. See [54] for the case of practical coding.\nFinally, we optimize the lower bound (43) with respect to the prior pdf of xm,t . This optimization problem is\nnonlinear since the prior pdf of xm,t depends on σ 2 through the last term in the RHS of the fixed-point equation (46).\nInstead of solving the nonlinear optimization problem exactly, we consider the biased Gaussian signaling xm,t ∼\n\nCN (θm,t , P − |θm,t |2 ) as a suboptimal solution. This choice of the prior pdf should be reasonable since Gaussian\nsignaling is optimal if accurate channel estimates can be obtained. In this case, Proposition 1 reduces to the following\ncorollary.\nCorollary 1. Suppose that Assumption 1, Assumption 2, and the RS assumption hold. If xm,t ∼ CN (θm,t , P −\nOctober 25, 2018\n\nDRAFT\n\n\fIEEE TRANSACTIONS ON INFORMATION THEORY, VOL. , NO. , 2011\n\n|θm,t |2 ), then the constrained capacity (7) per transmit antenna is bounded from below by cg given by\n\u0013\u0015\n\u0014 \u0012\nZ\nZ\nC\n(1 − ξ 2 (τ ))(P − |θm,t |2 )\ndτ dμ,\nE log 1 +\n≥ cg =\nM\nασ 2 (τ, μ)\nτ ∈[τ0 ,1] μ∈[0,1]\n\n18\n\n(49)\n\nin the large-system limit. In evaluating the integrand in (49), ξ 2 (τ ) is given by (37), defined via (44) and (45).\nFurthermore, σ 2 (τ, μ) is given as the unique solution σ 2 to the fixed-point equation (48).\nProof of Corollary 1: It is straightforward to confirm that the lower bound (43) and the fixed-point equation (46)\nreduce to (49) and (48) under the biased Gaussian signaling, respectively.\nWe believe that the biased Gaussian signaling maximizes the quantity (47), following the argument in [55]. If\nξ 2 (τ ) = 0 and σ 2 = N0 were satisfied for all τ and μ, the biased Gaussian signaling would maximize the lower\nbound (43). However, ξ 2 (τ ) is bounded from below by a positive value for τ < β. This implies the suboptimality\nof the i.i.d. Gaussian signaling.\nProposition 2 and Corollary 1 imply that the large-system performance of the LMMSE detector coincides with\nthat of the optimal detector when the i.i.d. Gaussian signaling is used. Note that this observation is not necessarily\ntrivial, since we have made the Gaussian approximation of the third term on the RHS of (22) in the derivation\nof the LMMSE detector. Our results imply that, for the i.i.d. Gaussian signaling, the performance loss due to the\nGaussian approximation vanishes in the large-system limit.\nC. High SNR Regime\nIn the high SNR limit N0 → 0, the lower bound (49) is shown to achieve the full spatial multiplexing gain when\nTtr ≤ M .\nProposition 3. Suppose that Assumption 1, Assumption 2, and the RS assumption hold. For α ≤ 1 and τ0 ≤ β ≤ 1/2,\n\nthe lower bound (49) with the biased Gaussian signaling xm,t ∼ CN (θm,t , P − |θm,t |2 ) achieves the full spatial\nmultiplexing gain in the high SNR limit N0 → 0, i.e.,\nlim inf\nN0 →0\n\ncg\n= 1 − β.\nlog(P/N0 )\n\n(50)\n\n2\nProof of Proposition 3: We first prove that the solution σtr\nto the coupled fixed-point equations (44) and\n2\n(45) converges to zero in the high SNR limit for τ > β. The proof is by contradiction. Suppose that σtr\nis strictly\n2\npositive in the high SNR limit. Dividing both sides of (44) by σtr\nand taking the high SNR limit, we have\n\n1=\n\nβP σc2\n2 σ 2 + τ P σ 2 + (1 − τ )σ 2 σ 2 .\nβσtr\nc\nc\nθ tr\n\n(51)\n\nRearranging (51), we obtain\n2\nσtr\n=−\n\n(τ − β)P σc2\n.\nβσc2 + (1 − τ )σθ2\n\n(52)\n\n2\nHowever, the RHS of (52) is negative, due to τ > β, which is a contradiction. Thus, the solution σtr\nmust converge\n\nto zero in the high SNR limit for τ > β. This result implies that the MSE (37) also converges to zero in the high\nSNR limit for τ > β.\nOctober 25, 2018\n\nDRAFT\n\n\fIEEE TRANSACTIONS ON INFORMATION THEORY, VOL. , NO. , 2011\n\n19\n\nIt is straightforward to show in a similar manner that the solution σ 2 to the fixed-point equation (48) is O(N0 )\nin the high SNR limit for α ≤ 1 when the MSE (37) converges to zero. Thus, we have\nlim inf\nN0 →0\n\ncg\n= 1 − β,\nlog(P/N0 )\n\n(53)\n\nwhich is equal to the full spatial multiplexing gain for α ≤ 1 and β ≤ 1/2.\nThe proof of Proposition 3 indicates that in the first M stages the performance of the SD receiver is limited by\nchannel estimation errors, rather than inter-stream interference in MUD. This phenomenon is robust in the sense\nthat it occurs regardless of the prior of data symbols.\nD. Low SNR Regime\nThe power per information bit Eb required for reliable communication is a key performance measure in the\nlow SNR regime. Verdú [12] proved that the capacity Copt of the MIMO channel (1) wit no CSI is given by\nCopt = N P/(N0 ln 2) + o(N0 ) in the low SNR limit N0 → ∞, or N Eb /N0 ≥ limN0 →∞ N P/(N0 Copt ) = ln 2 ≈\n−1.59 dB. Since using multiple transmit antennas wastes valuable power in the low SNR regime, the number of\n\ntransmit antennas used should be reduced as N0 increases. One option is to increase M −1 and N0 at the same rate.\n\nThus, we consider the limit, in which α, β → 0 and N0 → ∞ while β/α and s = P/(βN0 ) are kept constant. The\nfollowing proposition provides an upper bound on the normalized SNR N Eb /N0 = N P/(N0 C) required for the\noptimal SD receiver, with C denoting the achievable rate (8) of the optimal SD receiver.\nProposition 4. Suppose that the optimal SD receiver achieves a rate R/M . Then, the normalized SNR N Eb /N0\nis bounded from above by\nN\n\nβs\nEb\n≤\n+ o(N0 ),\nN0\nαR\n\n(54)\n\nin the limit where α, β → 0 and N0 → ∞ while β/α and s = P/(βN0 ) are kept constant. In (54), s is implicitly\ngiven by\n\n\u0013\n\u0013−1 #\n\u0012\n\u0013 \u0012\n\u0012\nβ\n1\nβ 2\nlog(1 + s).\nlog 1 + s + s2 − 1 +\nR = 1+ s+ s\nα\nα\ns\n\"\n\n(55)\n\nProof of Proposition 4: Using the lower bound (49) for Gaussian signaling, we obtain an upper bound\nN Eb /N0 ≤ N P/(M N0 cg ) = βs/(αcg ). Thus, it is sufficient to prove that the maximum of cg with respect to τ0\n\nand σθ2 is given by the RHS of (55).\n\n2\nWe evaluate the solutions to the fixed-point equations (44), (45), and (48). It is straightforward to find that σtr\n/N0 ,\n\nσc2 /N0 , and σ 2 /N0 tend to 1 as N0 → ∞, since (37) and (42) are bounded. This observation implies\n\u0014\n\u0012\n\u0013\n\u0015\nZ 1\nβs\nσ2\nτ + (1 − τ )σθ2 /P\nlog 1 +\ncg ≤\n1− θ\ndτ + o(N0 ),\nα\nP s−1 + τ + (1 − τ )σθ2 /P\nτ0\n\n(56)\n\nin the limit described in Proposition 4. In the derivation of (56), we have used Jensen's inequality. The equality holds\nonly when |θm,t |2 takes σθ2 with probability one. It is easy to confirm that the integrand in (56) is monotonically\ndecreasing with respect to σθ2 . Thus, the maximum of cg is achieved at τ0 = 0 and σθ2 = 0, and given by\n\u0015\n\u0014\nZ 1\nβ s2 τ\ndτ + o(N0 ).\nmax cg =\nlog 1 +\nα 1 + sτ\nτ0 ,σθ2 ≥0\n0\n\nOctober 25, 2018\n\n(57)\n\nDRAFT\n\n\fIEEE TRANSACTIONS ON INFORMATION THEORY, VOL. , NO. , 2011\n\n20\n\n1.6\nGaussian\nAchievable Rate per Transmit Antenna (bps/Hz)\n\n1.4\n\nQPSK\nβ=M/Tc=0.1\n\n1.2\n\n1\n\n0.8\n\nβ=M/Tc=0.5\n\n0.6\n\n0.4\n\n0.2\n\n0\n0\n\n0.1\n\n0.2\n\n0.3\n\n0.4\n\n0.5\nσ\n\nFig. 2.\n\n0.6\n\n0.7\n\n0.8\n\n0.9\n\n1\n\n2\nθ\n\nAchievable rate versus the variance of the bias σθ2 for the SNR P/N0 = 6 dB, α = M/N = 1, and τ0 = Ttr /Tc = 0.\n\nCalculating the integration in (57), we find that the first term in the RHS of (57) is equal to the RHS of (55).\nIn the proof of Proposition 4, we have proved that the lower bound (49) is maximized at τ0 = 0 and σθ2 = 0 in\nthe low SNR regime. This result implies that negligible pilot information is best in terms of the lower bound (49)\nin the low SNR regime.\nIt is interesting to note that the achievable rate (55) is approximated by R = βs2 /(2α ln 2) + O(s3 ) as s → 0,\np\nwhich implies that N Eb /N0 ≤ 2β ln 2/αR + o(N0 , R) in the low rate regime, i.e., the upper bound (54) diverges\n\nin R → 0. In other words, the minimum of the upper bound (54) is achieved at a strictly positive rate, as shown\nin Section V. We remark that a similar result was reported in [56].\nThe reason why the minimum is achieved at a positive rate is because we have spread power over all time slots.\n\nIt is well known that on-off keying is optimal in the low SNR regime, in other words, that spreading power over\nall time slots results in a waste of valuable power. If on-off keying was used, the normalized SNR required would\nreduce monotonically as the achievable rate decreases, as shown in [56]. However, on-off keying requires high\npeak-to-average power ratio (PAPR), which is unfavorable in practice. Thus, the minimum of the upper bound (54)\nmay be interpreted as a practical performance bound in terms of energy efficiency.\n\nOctober 25, 2018\n\nDRAFT\n\n\fIEEE TRANSACTIONS ON INFORMATION THEORY, VOL. , NO. , 2011\n\n21\n\n2.75\nGaussian\n\n2.5\nAchievable Rate per Transmit Antenna (bps/Hz)\n\nQPSK\n2.25\n\nHH bound [15]\n\n2\n1.75\nβ=M/Tc=0.1\n1.5\n1.25\n1\nβ=M/Tc=0.5\n0.75\n0.5\n0.25\n0\n0\n\n1\n\n2\n\n3\n\n4\n\n5\n\n6\n\n7\n\n8\n\n9\n\n10\n\n11\n\n12\n\nP/N0 in dB\n\nFig. 3.\n\nAchievable rate versus SNR in the moderate SNR regime for the variance of the bias σθ2 = 0, α = M/N = 1, and τ0 = Ttr /Tc = 0.\n\nV. N UMERICAL R ESULTS\nA. Large Systems\nThe lower bound (49) for the biased Gaussian signaling is compared to two existing bounds in this section. One\nis the HH bound [15], which corresponds to the achievable rate of receivers based on one-shot channel estimation,\nin which the decoded data symbols are not re-utilized for refining the channel estimates. The other one is the\nhigh-SNR approximation of the capacity [10], which includes a deviation of o(1) from the capacity at high SNR.\nIn all numerical results, we chose τ0 = 0 since the lower bound (49) is maximized at τ0 = 0. In order to investigate\nthe optimal choice of σθ2 , we display the lower bound (49) for the biased Gaussian signaling with respect to σθ2\nin Fig. 2. The lower bound (43) for the biased QPSK signaling is also shown in the same figure. We have used\np(θ) = [δ(θ − σθ ) + δ(θ + σθ )]/2 as the distribution of θm,t , i.e., θm,t takes ±σθ with equal probability. We find\nthat the lower bound for the biased Gaussian signaling is larger than that for the biased QPSK signaling for all σθ2 .\n\nFurthermore, both lower bounds are monotonically decreasing as σθ2 grows. The latter observation implies that the\nlower bounds are maximized at σθ2 = 0, in other words, negligible pilot information is best in terms of the lower\nbounds. Hereinafter, we consider the unbiased case σθ2 = 0.\n\nOctober 25, 2018\n\nDRAFT\n\n\fIEEE TRANSACTIONS ON INFORMATION THEORY, VOL. , NO. , 2011\n\n22\n\n11\nhigh-SNR approximation [10]\n\n10\nAchievable Rate per Transmit Antenna (bps/Hz)\n\nGaussian\n9\n\nHH bound [15]\n\n8\nβ=M/Tc=0.1\n\n7\n6\n5\n\nβ=M/Tc=0.5\n\n4\n3\n2\n1\n0\n10\n\n12.5\n\n15\n\n17.5\n\n20\n\n22.5\n\n25\n\n27.5\n\n30\n\n32.5\n\n35\n\n37.5\n\n40\n\nP/N0 in dB\n\nFig. 4.\n\nAchievable rate versus SNR in the high SNR regime for the variance of the bias σθ2 = 0, α = M/N = 1, and τ0 = Ttr /Tc = 0.\n\nFigure 3 provides a comparison between the lower bound (49) for unbiased Gaussian signaling and the HH\nbound in the moderate SNR regime. The lower bound (43) for QPSK modulation is also displayed. The HH bound\nis a lower bound on the capacity for finite-sized systems [15, Theorem 3]. We have used a large-system formula\nof the HH bound, which is easily derived in the same manner as in [25]. There is a significant gap of 1 dB to\n1.8 dB between the lower bound for unbiased Gaussian signaling and the HH bound for all SNRs. Moreover,\nthe HH bound is inferior even to the lower bound for QPSK modulation in the case of short coherence time\n(β = 0.5). These observations imply that SD receivers can provide a substantial performance gain in the moderate\nSNR regime, compared to receivers based on one-shot channel estimation, since they can reduce overhead for\ntraining significantly.\nNext, we compare the lower bound for unbiased Gaussian signaling with the high-SNR approximation of the\ncapacity [10, Corollary 11] in the high-SNR regime in Fig. 4. The HH bound is also displayed in the same figure.\nNote that in the high-SNR approximation the large-system limit is taken after the high SNR limit. Thus, the\ncomparison makes sense under the assumption that the large-system limit and the high SNR limit commute for the\nhigh-SNR approximation. We find that the high-SNR approximation is smaller than the lower bound for unbiased\n\nOctober 25, 2018\n\nDRAFT\n\n\fIEEE TRANSACTIONS ON INFORMATION THEORY, VOL. , NO. , 2011\n\n23\n\n6\nHH bound [15]\n\n5.5\n\nQPSK\nGaussian\n\n5\n4.5\n\nNEb/N0 in dB\n\n4\n3.5\n\nβ/α=N/Tc=0.5\n\n3\n2.5\n2\nβ/α=N/Tc=0.1\n\n1.5\n1\n0.5\n0\n0\n\n0.25\n\n0.5\n\n0.75\n\n1\n\n1.25\n\n1.5\n\n1.75\n\n2\n\nAchievable Rate per Transmit Antenna (bps/Hz)\n\nFig. 5.\n\nNormalized SNR versus achievable rate in the low SNR regime for the variance of the bias σθ2 = 0 and τ0 = Ttr /Tc = 0.\n\nGaussian signaling in the SNR region of below 17.5 dB for β = 0.5 or below 20 dB for β = 0.1. This implies that\nthe high-SNR approximation derived by Zheng and Tse [10] is valid only for quite high SNR. The lower bound\nfor unbiased Gaussian signaling is close to the HH bound, rather than the high-SNR approximation, in the quite\nhigh SNR regime, which indicates the suboptimality of Gaussian signaling in the quite high SNR regime.\nFinally, we consider the low SNR regime and take the limit described in Proposition 4, in which the power\nper information bit Eb required for reliable communication is a key performance measure. Figure 5 displays the\nupper bound (54) of N Eb /N0 required for the SD receiver with unbiased Gaussian signaling as a function of the\nachievable rate per transmit antenna. The normalized SNRs N Eb /N0 are also plotted for the SD receiver with\nQPSK modulation and for the HH bound. We find that N Eb /N0 has a minimum at a positive achievable rate. This\nobservation is due to the suboptimality of i.i.d. Gaussian signaling. If perfect CSI was available at the receiver, the\nnormalized SNR N Eb /N0 would be monotonically decreasing with the reduction of the achievable rate [12], since\ni.i.d. Gaussian signaling is optimal in that case. For the case of no CSI, however, the normalized SNR N Eb /N0\ndiverges as the achievable rate tends to zero, since i.i.d. signaling wastes valuable power in the low SNR regime,\nas discussed in Section IV-D. Another observation is that there is a large gap of 1 dB to 1.5 dB between the\n\nOctober 25, 2018\n\nDRAFT\n\n\fIEEE TRANSACTIONS ON INFORMATION THEORY, VOL. , NO. , 2011\n\n24\n\nminimal normalized SNRs for the SD receivers and the HH bound, while all bounds are far from the ultimate limit\nN Eb /N0 ≈ −1.59 dB. This result implies that the SD scheme can significantly improve the HH bound in the low\nSNR regime.\nB. Finite-Sized Systems\nWe have so far considered the large-system performance. In order to confirm the usefulness of the large-system\nanalysis in practice, numerical simulations are presented for finite-sized systems with no CSI. Since the optimal\ndetector has high complexity, only the performance of the LMMSE detector is investigated. Unbiased QPSK and\nunbiased Gaussian signaling are considered. Note that, for the unbiased case, the performance of the LMMSE\nchannel estimator depends on stage t, rather than the coherence time Tc . Figure 6 shows the normalized MSE for\nthe LMMSE estimate (27) of the data symbols in substage m within stage t for the SD receiver. For comparison,\nwe plot the large-system results based on Proposition 2 with α = M/N , β/τ = M/(t − 1), and μ = (m − 1)/M .\nThe normalized MSE is given by the expectation in the RHS of (48) divided by P in the large-system limit. A\ncorrection of minus one for the stage index t is because the performance in stage t is approximated by that in\nstage t + 1 in the large-system limit. See (33)–(35). A correction for the substage index is also due to the same\nreason. We find that the large-system results are in good agreement with those for not so large systems.\nVI. C ONCLUSIONS\nWe have investigated the achievable rates of SD receivers for the Rayleigh block-fading MIMO channel with\nno CSI. Analytical formulas for the achievable rates have been derived in the large-system limit, by using the\nreplica method. It has been shown that negligible pilot information is best in terms of the information-theoretical\nachievable rates. From a theoretical point of view, the formulas provide the best lower bound on the capacity among\nexisting analytical lower bounds that can be easily evaluated for all SNRs, while it is far from the true capacity\nin the low or quite high SNR regimes. From a practical point of view, the analytical lower bounds derived in\nthis paper can be regarded as a fundamental performance limit for practical training-based systems with QPSK or\nmultilevel modulation. We conclude that the SD receiver can reduce overhead for training significantly. Thus, it\nprovides a substantial performance gain, compared to receivers based on one-shot channel estimation, especially in\nthe low-to-moderate SNR regime.\nOne important future work is to investigate spatially correlated MIMO channels with no CSI. On the one hand,\nspatial correlations cause a reduction of diversity. On the other hand, they make it possible to estimate the channel\nmatrix more accurately than without correlations, since one can utilize the knowledge about the correlations for\nchannel estimation. Thus, it should be worth investigating impacts of these two effects onto the performance for\ntraining-based systems. It does not seem to be straightforward to extend the results presented in this paper to the\ncase of spatially correlated MIMO channels.\n\nOctober 25, 2018\n\nDRAFT\n\n\fIEEE TRANSACTIONS ON INFORMATION THEORY, VOL. , NO. , 2011\n\n25\n\n1\nlarge-system\nGaussian\nQPSK\n\n(M, N, t, m)=(8, 8, 17, 3)\n\nNormalized MSE\n\n10\n\n-1\n\n(M, N, t, m)=(8, 8, 81, 3)\n\n10\n\n-2\n\n10\n\n-3\n\n0\n\nFig. 6.\n\n5\n\n10\n\n15\nP/N0 in dB\n\n20\n\n25\n\n30\n\nNormalized MSE for the LMMSE detector versus SNR in substage m within stage t for the SD receiver. m = 3, t = 17, 81, M = 8\n\ntransmit antennas, N = 8 receive antennas, and the variance of the bias σθ2 = 0.\n\nA PPENDIX A\nD ERIVATION\n\nOF\n\nP ROPOSITION 1\n\nA. Sketch\nLet us consider substage m = μM within stage t = τ Tc in the SD receiver for 0 ≤ τ ≤ 1 and 0 ≤ μ ≤ 1. For\nsome m̃ ∈ N, we decompose the lower bound (19) into two terms,\n\" m̃\n#\nTc\nM\nX\nX\nX\nC\n1\n≥\nI(xm,t ; x̃m,t |Ĩt , x[1,m),t , θ [m,M],t ) ,\nI(xm,t ; x̃m,t |Ĩt , x[1,m),t , θ[m,M],t ) +\nM\nTc M\nm=m̃+1\nt=Ttr +1 m=1\n(58)\nand then take the limit in which M , N , Tc , Ttr , t, m, and m̃ tend to infinity while their ratios α = M/N ,\nβ = M/Tc , τ0 = Ttr /Tc , τ = t/Tc , μ = m/M , and μ0 = m̃/M are kept constant. The second term consists\nof the mutual information for the decoding problem after an extensive number of users have been decoded, while\nthe first term contains the mutual information for the problem after a finite number of users have been decoded.\nWe will show below that I(xm,t ; x̃m,t |Ĩt , x[1,m),t , θ[m,M],t ) for μ ≥ μ0 converges to the integrand in (43) in the\n\nOctober 25, 2018\n\nDRAFT\n\n\fIEEE TRANSACTIONS ON INFORMATION THEORY, VOL. , NO. , 2011\n\n26\n\nPM\nPTc\nlarge-system limit. The definition of the Riemann integral implies that the sum (Tc M −1 ) t=T\nm=m̃+1 in\ntr +1\nR1\nR1\nthe second term of (58) tends to τ0 dτ μ0 dμ. Taking the limit μ0 → 0, we arrive at Proposition 1, since the first\nterm of (58) tends to zero as μ0 → 0.\n\nThe evaluation of I(xm,t ; x̃m,t |Ĩt , x[1,m),t , θ[m,M],t ) consists of two parts: analysis of the error covariance\nmatrix (16) and analysis of the equivalent channel (20). We apply the replica method to both analyses.\nB. Analysis of Channel Estimator\nWe evaluate the error covariance matrix (16) for the LMMSE channel estimation in the large-system limit. Since\nQN\n~ n |Ĩt ), without loss of generality, we focus on the\nthe joint posterior pdf p(H|Ĩt ) is decomposed into n=1 p(h\n\nestimation problem for the first row of H, denoted by ~h1 . The first row vector ~y \\t,1 ∈ C1×(Tc −1) of (13) is given\nby\n1\n~y \\t,1 = √ ~h1 X̄ \\t + (~0, w\n~ (t,Tc ],1 ) + n\n~ \\t,1 ,\nM\n\n(59)\n\n~ (t,Tc ],1 ∈ C1×(Tc −t) and n\n~ \\t,1 ∈ C1×(Tc −1) denote the first row vectors of the matrices W (t,Tc ] and N \\t ,\nwhere w\nrespectively.\nThe channel (59) can be regarded as a MIMO channel with the channel matrix X̄ \\t known to the receiver.\nThe main difference between X̄ \\t and zero-mean channel matrices considered in previous works [24]–[26], [28],\n[30], [31] is that X̄ \\t has the nonzero mean X̂ \\t = (O, Θ(Ttr ,t) , Θ(t,Tc ] ) ∈ CM×(Tc −1) conditioned on Θ. Let\nus decompose the channel matrix X̄ \\t into the mean X̂ \\t and the difference X̄ \\t − X̂ \\t . The problem would\nreduce to the zero-mean case if the two matrices were independent of each other, since the sum of two independent\nmatrices with i.i.d. zero-mean entries is also a matrix with i.i.d. zero-mean entries. However, the two matrices are\nnot independent while they are uncorrelated zero-mean matrices. Thus, we have to treat the influence of higher-order\ncorrelations carefully.\nThe following proposition implies that the large-system results for each element of the error covariance matrix (16)\ncoincide with those for the case as if the two matrices X̂ \\t and X̄ \\t − X̂ \\t were mutually independent. In other\nwords, higher-order correlations between the two matrices do not affect the results for each element of the error\ncovariance matrix (16) in the large-system limit. Note that we do not claim the norm convergence kΞt −ξ 2 (τ )I M k →\n0.\nProposition 5. Suppose that Assumption 1 and the RS assumption hold. Then, each diagonal element of the\nerror covariance matrix (16) converges in probability to (37), defined by (44) and (45), in the large-system limit.\nFurthermore, each off-diagonal element of the error covariance matrix (16) converges in probability to zero in the\nlarge-system limit.\nProof: See Appendix B.\nProposition 5 was rigorously proved without Assumption 1 for the unbiased case θm,t = 0 in [26]. Since we\ncannot claim the norm convergence kΞt − ξ 2 (τ )I M k → 0, a careful treatment of Ξt is required in the analysis of\nthe equivalent channel (20).\nOctober 25, 2018\n\nDRAFT\n\n\fIEEE TRANSACTIONS ON INFORMATION THEORY, VOL. , NO. , 2011\n\n27\n\nWe remark that the convergence of each off-diagonal element to zero results from the fact that the MMSE estimate\n~ 1 and its error h\n~ 1 − ĥ1 are uncorrelated with each other. In fact, we can show a stronger result for the\nĥ1 of h\noff-diagonal elements without the replica method.\nLemma 1. Suppose that Assumption 1 holds. For a constant A ≥ 0, each off-diagonal element (Ξt )m̃,m̃′ (m̃ 6= m̃′ )\nof (16) satisfies\nlim sup M 3/4 |(Ξt )m̃,m̃′ | = A in probability,\n\n(60)\n\nM→∞\n\nwhere the limit denotes the large-system limit.\nProof: We use the fact that the covariance matrices Ξt and I − Ξt for ~h1 − ĥ1 and ĥ1 are positive definite. Let\n{λm̃ > 0 : m̃ = 1, . . . , M } denote the eigenvalues of Ξt . The positive definiteness of I − Ξt implies 1 − λm̃ > 0\n\nfor all m̃, or, 0 < λm̃ < 1 for all m̃. This observation implies that I M − Ξkt is also positive definite for any k ∈ N,\nor\nlim sup\nM→∞\n\n1\nTr(Ξkt ) < 1\nM\n\n(61)\n\nin the large-system limit. Note that Assumption 1 implies that the left-hand side (LHS) of (61) tends to the expected\none M −1 Tr(E[Ξkt ]).\nIn order to prove Lemma 1, we evaluate Tr(E[Ξ4t ]). Let ρt denote the elements of E[Ξt ] in the strictly upper\ntriangular part. A direct calculation implies that the the leading term of Tr(E[Ξ4t ]) is given by |ρt |2 M 4 (2|ρt |2 −\nR[ρ2t ])/3 as M → ∞. Applying this result and R[ρ2t ] ≤ |ρt |2 to (61), we have\nlim sup M 3 |ρt |4 < 3,\n\n(62)\n\nM→∞\n\nwhich implies that Lemma 1 holds.\nLemma 1 implies (Ξt )m̃,m̃′ = O(M −3/4 ) in the large-system limit. We believe that it is possible to prove\n(Ξt )m̃,m̃′ = O(M −1 ) by calculating Tr(E[Ξkt ]) and taking k → ∞ after the large-system limit. However, Lemma 1\nis sufficient for deriving Proposition 1.\nC. Analysis of Detector\nWe focus on substage m within stage t and analyze the equivalent channel (20) in the large-system limit. It is\nshown that the equivalent channel reduces to a MIMO channel with perfect CSI at the receiver in the large-system\n(c)\n\nlimit. Let Ξt\n\n∈ C(M−m+1)×(M−m+1) denote the posterior covariance matrix of (h1,m , . . . , h1,M )T ∈ CM−m+1\n\ngiven Ĩt , i.e., the bottom-right block of the error covariance matrix (16),\n\n\n∗\n∗\n.\nΞt = \n(c)\n∗ Ξt\n\nThe equivalent MIMO channel with perfect CSI at the receiver is defined as\nq\n(c)\n−1/2\nz=α\nI − Ξt x[m,M],t + w,\nOctober 25, 2018\n\n(63)\n\n(64)\n\nDRAFT\n\n\fIEEE TRANSACTIONS ON INFORMATION THEORY, VOL. , NO. , 2011\n\nwith w ∼ CN (0, σ 2 I M−m+1 ). In (64), the matrix\nq\nHq\n(c)\n(c)\nI − Ξt\nI − Ξt .\n\n28\n\nq\n(c)\n(c)\n(c)\nI − Ξt denotes a squared root of I − Ξt , i.e., I − Ξt =\n\nThe equivalent channel between xm,t and the associated decoder for the MIMO channel (64) with perfect CSI\n\nat the receiver is given by\n(c)\n\np(x̃m,t |xm,t , Ξt , θ [m,M],t )\nZ\n(c)\n(c)\n= p(xm,t = x̃m,t |z, Ξt , θ[m,M],t )p(z|Ξt , x[m,M],t )p(x(m,M],t |θ(m,M],t )dx(m,M],t dz,\n(c)\n\n(65)\n\n(c)\n\nwhere p(xm,t |z, Ξt , θ[m,M],t ) represents the pdf of xm,t conditioned on z, Ξt , and θ [m,M],t .\nProposition 6. Suppose that Assumption 2 and the RS assumption hold. Then, the equivalent channel (20) converges\nin law to the equivalent channel (65) for the MIMO channel (64) with perfect CSI at the receiver in the large-system\nlimit. In evaluating (65), the variance σ 2 of w is given as the solution to the fixed-point equation,\nP\nTr(Ξt ) + V (σ 2 ),\nM→∞ M\n\nσ 2 = N0 + lim\n\n(66)\n\nwith\ni\n1 h\n(c)\n(c)\nE (x[m,M],t − hx[m,M],t i)H (I − Ξt )(x[m,M],t − hx[m,M],t i) Ξt , θ[m,M],t ,\nM→∞ M\n\nV (σ 2 ) = lim\n\n(67)\n\n(c)\n\nwhere hx[m,M],t i denotes the mean of x[m,M],t with respect to the posterior pdf p(x[m,M],t |z, Ξt , θ[m,M],t ). If\n\nthere are multiple solutions, one should choose the solution σ 2 minimizing the following quantity\n\u0014\n\u0015\n1\n1\nlog2 e\n2\nlim\nD2 (N0 kσ ) + lim\nI(x[m,M],t ; z) +\nTr(Ξt ) ,\nM→∞ M\nM→∞ σ 2 M\nα\n\n(68)\n\nwhere I(x[m,M],t ; z) denotes the mutual information between x[m,M],t and z given realizations of Ξt and θ [m,M],t .\nProof: See Appendix C.\nWe have implicitly assumed that the equivalent channel (65) and the last two terms in (66) converge as M → ∞.\nThis assumption is justified below by using Proposition 5 and Lemma 1.\nProposition 6 implies that the mutual information I(xm,t ; x̃m,t |Ĩt , x[1,m),t , θ[m,M],t ) tends to the constrained\n(c)\n\ncapacity I(xm,t ; x̃m,t |Ξt , θ[m,M],t ) of the MIMO channel (64) with perfect CSI at the receiver in the large(c)\n\nsystem limit. In order to complete the derivation of Proposition 1, we show that I(xm,t ; x̃m,t |Ξt , θ[m,M],t ) tends\nto the integrand in (43). A proof of this statement is given in Appendix D. One may expect that if the convergence\nof each off-diagonalqelement of the error covariance matrix (16) to zero is fast enough, the off-diagonal elements of\nthe channel matrix\n\n(c)\n\nI − Ξt\n\nfor the MIMO channel (64) with perfect CSI at the receiver are negligible. Thus, the\n\nMIMO channel (64) with perfect CSI at the receiver is decoupled into the bank of the AWGN channels (40). The\n(c)\n\nproof presented in Appendix D implies that the convergence speed shown in Lemma 1, i.e., (Ξt )m̃,m̃′ = O(M −3/4 )\nfor m̃ 6= m̃′ , is fast enough. In order to explain this argument intuitively, we apply the matched filter (MF)\nq\nH\n(c)\nr = α−1/2 I − Ξt z for the received vector z of the MIMO channel (64) with perfect CSI at the receiver,\nr=\n\nOctober 25, 2018\n\nξ t,m\nxm,t +\nα\n\nM\nX\n\nm′ =m+1\n\nξt,m′\nxm′ ,t + η,\nα\n\n(69)\n\nDRAFT\n\n\fIEEE TRANSACTIONS ON INFORMATION THEORY, VOL. , NO. , 2011\n\n29\n\n(c)\n\n(c)\n\nwith η ∼ CN (0, σ 2 (I −Ξt )/α). In (69), the vector ξ t,m′ denotes the (m′ −m+1)th column vector of I −Ξt for\nm′ = m, . . . , M . Note that the MF output vector (69) contains sufficient information for the estimation of x[m,M],t .\n\nThe magnitude of the inter-stream interference, given by the second term of the RHS in (69), would be proportional\nto the magnitude of each interfering signal multiplied by M − m if a constructive superposition of all interfering\nsignals occurred. However, it does not occur due to the independence of data symbols with high probability. On\naverage, the magnitude of the inter-stream interference is proportional to the magnitude of each interfering signal\n√\nmultiplied by M − m. Since the magnitude of each interfering signal is O(M −3/4 ), the magnitude of inter-stream\n\ninterference is O(M −1/4 ). Thus, the inter-stream interference is negligible in the large-system limit.\n\nWe have so far presented the derivation of Proposition 1. Finally, we discuss the performance degradation caused\n~ 1 of H\nby using the LMMSE channel estimator. Let us consider the estimation problem for the first row vector h\nbased on the first row vector of the received matrix Y \\t , instead of Ỹ \\t . It is worth noticing the similarity between\nthis problem and the detection problem of xm,t in stage t. This similarity allows us to analyze the performance of\nthe optimal channel estimator (9) in the large-system limit.\nProposition 7. Suppose that the error covariance matrix for the optimal channel estimator (9) is self-averaging\nin the large-system limit. Under the RS assumption, then, each diagonal element of the error covariance matrix\nconverges in probability to the same value as that for the LMMSE channel estimator, defined in Proposition 5, in\nthe large-system limit.\nThe derivation of Proposition 7 is omitted since it is straightforwardly derived by combining the methods for\nderiving Propositions 5 and 6. Proposition 7 allows us to expect that the gap between the achievable rate of the\noptimal SD receiver and its lower bound (43) may be quite small in the large-system limit, although we cannot\nimmediately conclude that the lower bound (43) is tight in the large-system limit.\nA PPENDIX B\nD ERIVATION\n\nOF\n\nP ROPOSITION 5\n\nA. Formulation\nPM\nIt is sufficient from Assumption 1 to show that the averaged quantities ξ ̄t2 = M −1 m̃=1 E[(Ξt )m̃,m̃ ] and\nPM\nρ̄t = (M − 1)−1 m̃=2 E[(Ξt )1,m̃ ] converge to ξ 2 (τ ) and zero, respectively, in the large-system limit, in which\n\nM , Tc , Ttr , and t tend to infinity while β = M/Tc , τ0 = Ttr /Tc , and τ = t/Tc are kept constant.\n\nFor notational convenience, hereinafter, we drop the subscript 1 in (59) from all variables. For example, ~y \\t,1\n~ (a) = (h(a) , . . . , h(a) ) ∈ C1×M denote replicas of h\n~ for a ∈ N:\nand ~h1 are written as ~y \\t and ~\nh, respectively. Let h\n1\nM\n(a)\n\n~\n{h\n\n~ Furthermore, we write h\n~ as h\n~ (0) = (h(0) , . . . , h(0) ).\n: a ∈ N} are i.i.d. random vectors drawn from p(h).\n1\nM\n\nThe replica analysis is based on the following lemma.\nLemma 2. Let us define a function Zn (ω; f ) as\n\"Z\n#\n\u001b\n\u001aZ\n\u001bn−2 Y\n2 \u001a\n(a)\n(a)\n(a)\nMωf\n~ =h\n~ , X̄ \\t )p(h\n~ )dh\n~\n~ h\n~\n~ X̄ \\t )p(h)d\nZn (ω; f ) = E\nd~y \\t , (70)\np(~y \\t |h\ne\np(~y \\t |h,\na=0\n\nOctober 25, 2018\n\nDRAFT\n\n\fIEEE TRANSACTIONS ON INFORMATION THEORY, VOL. , NO. , 2011\n\n30\n\n~ (a) : a = 0, 1, 2}. In (70), p(~y |h,\n~ X̄ \\t ) represents the virtual MIMO channel (59).\nwith a complex function f of {h\n\\t\nFor n ≥ 0 and ω ∈ R,\n\n1 ∂\nln Zn (ω; f1 ),\n(71)\nM ∂ω\n1 ∂\nρ̄t = lim lim\nln Zn (ω; f2 ),\n(72)\nn→+0 ω→0 M ∂ω\nP\nPM\n−1\nwhere the functions f1 and f2 are given by f1 = M −1 M\nm̃=1 fm̃,m̃ and f2 = (M − 1)\nm̃=2 f1,m̃ , respectively,\nξ̄t2 = lim lim\n\nn→+0 ω→0\n\nwith\n\n(1)\n\n(0)\n\n(0)\n\n(2)\n\nfm̃,m̃′ = (hm̃ − hm̃ )(hm̃′ − hm̃′ )∗ .\n\n(73)\n\nProof: We only present the proof of (71) since the proof of (72) is the same as that of (71). Let ĥt ∈ C1×M\n\n~ with respect to p(h|\n~ Ĩt ). Then, we\ndenote the first row vector of the LMMSE estimate (15), i.e., the mean of h\nhave\nξ ̄t2\n\n1\n=\nE\nM\n\n\"Z\n\n~ (2) H\n\n~ −h\n(h\n\n(1)\n\n~ −h\n~\n) (h\n\n\u001b#\n2 \u001a\nY\n(a)\n(a)\n~ =h\n~ |Ĩt )dh\n~\n,\np(h\n)\n\n(74)\n\na=1\n\n~ given Ĩt . The\nwhere we have used the fact that the error covariance matrix (16) is the posterior covariance of h\nintroduction of a non-negative real number n gives\n\"Z\n#\n\u001b\n\u001aZ\n\u001bn−2 Y\n2 \u001a\n(a)\n(a)\n(a)\n2\n ̄\n~\n~\n~\n~\n~\n~\n~\nξt = lim E\nd~y \\t .\np(~y \\t |h = h , X̄ \\t )p(h )dh\nf1\np(~y \\t |h, X̄ \\t )p(h)dh\nn→+0\n\n(75)\n\na=0\n\nIt is straightforward to confirm that (71) is equivalent to (75), since Zn (ω; f1 ) = 1 as n, ω → 0.\n\nIt is difficult to evaluate (70) for a real number n. The main trick of the replica method is that n is regarded as\na non-negative integer in evaluating (70). For n = 2, 3, . . ., we have a simple expression of (70),\n#\n\"\nZ Y\nn\n(a)\nMωf\n~ = ~h , X̄ \\t )d~y\nZn (ω; f ) = E e\np(~y \\t |h\n\\t .\n\n(76)\n\na=0\n\nIn order to use Lemma 2, we have to take the operations with respect to ω before the large-system limit. However,\n\nwe need to take the operations after the large-system limit, since it is possible to get an analytical formula of\n(76) only in the large-system limit, as shown in the next section. We circumvent this dilemma by assuming the\ncommutativity of the large-system limit and the operations.\nAssumption 4. For a non-negative integer n,\nlim lim\n\nM→∞ ω→0\n\n1\n1 ∂\n∂\nln Zn (ω; f ) = lim\nlim\nln Zn (ω; f ),\nω→0 ∂ω M→∞ M\nM ∂ω\n\n(77)\n\nwhere limM→∞ denotes the large-system limit.\nAn analytical formula of (76) obtained in the large-system limit is not generally defined for n ≥ 0. In order to\npredict the correct asymptotic formula of (70) in a neighborhood of n = 0, we will assume a symmetric statistics\nwith respect to replica indices, called the RS assumption. Assuming that the order of the large-system limit and\nthe operations with respect to n and ω in (71) and (72) is commutative, we obtain analytical expressions of (71)\nand (72) in the large-system limit. It is a challenging open problem to prove whether these assumptions are valid\nor whether the obtained result is correct.\nOctober 25, 2018\n\nDRAFT\n\n\fIEEE TRANSACTIONS ON INFORMATION THEORY, VOL. , NO. , 2011\n\n31\n\nB. Average over Non-Replicated Variables\nIn this section, we evaluate the expectations in (76) with respect to the non-replicated variables Θ(Ttr ,t) and X̄ \\t =\n(X TTtr , X (Ttr ,t) , Θ(t,Tc ] ). The matrix X̄ \\t consists of three kinds of random vectors: {xt′ } for t′ = 1, . . . , Ttr are\n\nthe pilot symbol vectors, {xt′ } for t′ = Ttr + 1, . . . , t − 1 are the data symbol vectors decoded in the preceding\nstages, and {θt′ } for t′ = t + 1, . . . , Tc are the bias vectors for the data symbol vectors unknown in the current\n~ (a) : a = 0, 1, . . .}\nstage. Since the elements of ~y \\t , given by (59), are mutually independent conditioned on H = {h\nand X̄ \\t , (76) yields\n(\nZn (ω; f ) = E e\n\nMωf\n\n)\nTc\nh\niTtr h\nit−Ttr −1 Y\nh\ni\n(a)\n(a)\n(a)\n2\nen (vp , N0 , H)\nen (vd , N0 , H)\nen (vc , N0 + P − σt′ , H) , (78)\nt′ =t+1\n\nwith\nen (v (a) , σ 2 , H) = E\n\n\"Z\n\nn\nY\n\na=0\n\n#\n\ng(y; v (a) , σ 2 )dy H ,\n\n(79)\n\nwhere g(y; v (a) , σ 2 ) denotes the pdf of a proper complex Gaussian random variable y ∈ C with mean v (a) and\nPM\n(a)\n(a)\n(a)\nvariance σ 2 . In (78), σt2′ is given by σt2′ = M −1 m̃=1 |θm̃,t′ |2 . Furthermore, vp ∈ C, vd ∈ C, and vc ∈ C\nare given by\n\nM\n1 X (a)\nvp(a) = √\nhm̃ xm̃,1 ,\nM m̃=1\n\n(80)\n\nM\n1 X (a)\n(a)\nhm̃ xm̃,t−1 ,\nvd = √\nM m̃=1\n\n(81)\n\nvc(a)\nrespectively.\n\nM\n1 X (a)\nhm̃ θm̃,Tc ,\n= √\nM m̃=1\n\n(82)\n\n(a)\n\nWe first evaluate en (vp , N0 , H) in the large-system limit, following [28], [31]. Calculating the Gaussian\nintegration with respect to y, we obtain\nen (vp(a) , N0 , H) =\n(0)\n\ni\nh\n−1 H\nE e−N0 vp Avp H\n(πN0 )n (1 + n)\n\n,\n\n(83)\n\n\n\n(84)\n\n(n)\n\nwith v p = (vp , . . . , vp )T and\n\nn\n1\n\nA=\n(1 + n) −1n\n\n−1T\nn\n\n(1 + n)I n − 1n 1T\nn\n\n.\n\nIn M → ∞, due to the central limit theorem, v p conditioned on H converges in distribution to a CSCG random\nvector with the covariance matrix P Q, given by\nQ=\n(0)\n\n(n)\n\nM\n1 X\nhm̃ hH\nm̃ ,\nM m̃=1\n\n(85)\n\nwith hm̃ = (hm̃ , . . . , hm̃ )T . Thus,\n\u0013\u001b\n\u001a \u0012\nP\nQ\n+ O(M −1 ),\nen (vp(a) , N0 , H) = exp G\nN0\nOctober 25, 2018\n\n(86)\n\nDRAFT\n\n\fIEEE TRANSACTIONS ON INFORMATION THEORY, VOL. , NO. , 2011\n\n32\n\nin the large-system limit, in which the function G(Q) is given by\nG(Q) = − ln det(I n+1 + AQ) − n ln(πN0 ) − ln(1 + n).\n\n(87)\n\n(a)\n\nWe next calculate en (vc , N0 + P − σt2′ , H). Expanding it with respect to the difference σt2′ − σθ2 , we have\nen (vc(a) , N0 + P − σt2′ , H) = en (vc(a) , N0 + P − σθ2 , H) + O(M −1/2 ),\n\n(88)\n\n√\nin the large-system limit, since the standard deviation of σt2′ − σθ2 is O(1/ M ). In the same manner as in the\nderivation of (86), we have\n\u001a \u0012\nen (vc(a) , N0 + P − σt2′ , H) = exp G\n(a)\n\n\u0013\u001b\nσθ2\nQ\n+ O(M −1/2 ).\nN0 + P − σθ2\n(0)\n\n(89)\n(n)\n\nThe quantity en (vd , N0 , H) is different from the other two quantities since v d = (vd , . . . , vd )T has the\n(0)\n\n(n)\n\nnonzero mean v θ = (vθ , . . . , vθ )T , with\n\n(a)\n\nvθ\n\nM\n1 X (a)\nhm̃ θm̃,t−1 .\n= √\nM m̃=1\n\n(90)\n\nThe difference v d − v θ conditioned on H and θ t−1 converges in distribution to a CSCG random vector with the\nPM\nH\n1\n2\ncovariance matrix Qd = P Q − M\nm̃=1 |θm̃,t−1 | hm̃ hm̃ in the large-system limit. We first take the expectation\nwith respect to xt−1 to obtain\n\nwith\n\nh\ni\n−1\n−1\nH\n(a)\nen (vd , N0 , H) = E eG(N0 Qd ) e−vθ B(Qd ,N0 A)vθ H + O(M −1 ),\n\n(91)\n\nB(Q, A) = Q−1 − Q−1 (A + Q−1 )−1 Q−1 .\n\n(92)\n\n√\nIn order to eliminate the dependence of θ m−1 on Qd , we use kQd − (P − σθ2 )Qk = O(1/ M ) in the large-system\n\nlimit. Expanding the exponent in (91) around Qd = (P − σθ2 )Q, we obtain\n\u0013\u001b \u0014\n\u001a\n\u0012\n\u0013 \u001b \u0015\n\u001a \u0012\nP − σθ2\nP − σθ2\n(a)\n−1 H\nQ\nE exp −N0 v θ B\nQ, A v θ H + O(M −1/2 ), (93)\nen (vd , N0 , H) = exp G\nN0\nN0\nwhere we have used the identity B(Q, N0−1 A) = N0−1 B(N0−1 Q, A). Applying the central limit theorem with\n\nrespect to v θ to (93), after some calculation, we arrive at\n\u0013\u001b\n\u001a \u0012\nP\n(a)\nQ\n+ O(M −1/2 ).\nen (vd , N0 , H) = exp G\nN0\n\n(94)\n\nIt is interesting to compare (86) for the pilot symbols and (94) for the data symbols decoded in the preceding\nstages. These expressions imply that random biases do not contribute to the performance of channel estimation in\nthe leading order.\nWe substitute (86), (89), and (94) into (78) to obtain\no\nn\n√\n1\n1\nln Zn (ω; f ) =\nln E eM [ωf +G̃(Q)] + O(1/ M ),\nM\nM\n\n(95)\n\nin the large-system limit, with\n\nτ\nG̃(Q) = G\nβ\nOctober 25, 2018\n\n\u0012\n\n\u0013\n\u0012\n\u0013\n1−τ\nP\nσθ2\nQ +\nG\nQ .\nN0\nβ\nN0 + P − σθ2\n\n(96)\n\nDRAFT\n\n\fIEEE TRANSACTIONS ON INFORMATION THEORY, VOL. , NO. , 2011\n\n33\n\nDifferentiating (95) with respect to ω and using Assumption 4, we have\ni\nh\nE fm1 ,m2 eM G̃(Q)\n1 ∂\ni\nh\nlim lim\n,\nln Zn (ω; f ) = lim\nM→∞ ω→0 M ∂ω\nM→∞\nE eM G̃(Q)\n\n(97)\n\nwith fm1 ,m2 = f1,1 for f = f1 and fm1 ,m2 = f1,2 for f = f2 . Expression (97) implies that the problem of\nevaluating (71) and (72) reduces to that of evaluating (97) for f = fm1 ,m2 .\nC. Average over Replicated Variables\nIn this section, we take the expectation in (97) with respect to the replicated variables H, following [57]. For\nnotational convenience, we define a set M = {m1 , m2 } of integers. We first evaluate the conditional pdf μ(Q) of\nQ given HM = {hm̃ : m̃ ∈ M}.\nM\n1 X\nhm̃ hH\nμ(Q) = E δ Q −\nm̃\nM\n\n\"\n\nm̃=1\n\n!\n\n#\n\nHM .\n\n(98)\n\nIt might be possible to obtain the analytical expression of the pdf (98) since Q is a Wishart matrix. However, we\nderive an asymptotic expression in the large-system limit by using the inversion formula for the moment generating\nfunction F (Q̃) of Q given by\ni\nh\nF (Q̃) = E eMTr(QQ̃) HM ,\n\nwhere a positive definite (n + 1) × (n + 1) Hermitian matrix Q̃ is given by\n\n\n1\n1\nq̃0,0\n***\n2 q̃0,1\n2 q̃0,n\n\n\n..\n..\n1 ∗ ..\n\n.\n 2 q̃0,1 .\n\n.\n.\nQ̃ = \n\n\n..\n..\n..\n1\n\n\n.\n.\n.\n\n2 q̃n−1,n \n1 ∗\n2 q̃0,n\n\n***\n\n1 ∗\n2 q̃n−1,n\n\n(99)\n\n(100)\n\nq̃n,n\n\nThe inversion formula for moment generating functions implies\n\u0012\n\u0013(n+1)2 Z\nM\nμ(Q) =\ne−MTr(QQ̃) F (Q̃)dQ̃,\n(101)\n2πj\nQ\nQ\nwith dQ̃ = na=0 dq̃a,a a<a′ {dR[q̃a,a′ ]dI[q̃a,a′ ]}. In (101), the integrations with respect to dq̃a,a , dR[q̃a,a′ ], and\n\ndI[q̃a,a′ ] are taken along the imaginary axes from −j∞ to j∞, respectively. Since {hm̃ } are i.i.d. for all m̃, the\nQ\nmoment generating function (99) reduces to {F1 (Q̃)}M−|M| m̃∈M exp(hH\nm̃ Q̃hm̃ ), given by\ni\nh H\n(102)\nF1 (Q̃) = E eh1 Q̃h1 .\nSubstituting this expression into (101) gives\n\u0012\n\u0013(n+1)2 Y\nZ\nH\nM\nμ(Q) =\nehm̃ Q̃hm̃ e−MI(Q,Q̃) dQ̃,\n2πj\n\n(103)\n\nm̃∈M\n\nwith\n\u0013\n\u0012\n|M|\nln F1 (Q̃).\nI(Q, Q̃) = Tr(QQ̃) − 1 −\nM\n\nOctober 25, 2018\n\n(104)\n\nDRAFT\n\n\fIEEE TRANSACTIONS ON INFORMATION THEORY, VOL. , NO. , 2011\n\n34\n\nIn order to obtain an analytical expression of (103), we use the saddle-point method. Let us define q̃ ∈ R(n+1)\n\n2\n\nT T\nT\n2(n−a)+1\nas q̃ = (q̃ T\n. Expanding\n0 , . . . , q̃ n ) , given by q̃ a = (q̃a,a , R[q̃a,a+1 ], I[q̃a,a+1 ], . . . , R[q̃a,n ], I[q̃a,n ]) ∈ R\n\n(104) with respect to Q̃ around the saddle-point\nQ̃s = argsup lim I(Q, Q̃),\nQ̃∈M+\nn+1\n\nM→∞\n\n(105)\n\nwith M+\nn+1 denoting the space of positive definite (n + 1) × (n + 1) Hermitian matrices, we have\n√ !(n+1)2\n\u001bh\n\u001a\nZ\nY\n√ i\nM\n1 T 2\nhH\nQ̃s hm̃ −MI(Q,Q̃s )\nm̃\nμ(Q) =\ne\ne\nq̃ ∇q̃ I(Q, Q̃s )q̃ 1 + O(1/ M ) dq̃,\nexp\n2π\n2\nR(n+1)2\nm̃∈M\n(106)\nwhere ∇2q̃ I(Q, Q̃s ) denotes the Hesse matrix of I(Q, Q̃) with respect to q̃. In the derivation of (106), we have\n√\n′\n′\ntransformed the variable Q̃ into Q̃ = M (Q̃ − Q̃s )/j and then rewritten Q̃ as Q̃. The Hesse matrix ∇2q̃ I(Q, Q̃s )\nis negative definite since the cumulant generating function ln F1 (Q̃) is convex. Thus, we can perform the Gaussian\nintegration in (106) to obtain\nr !(n+1)2\nh\nY\n√ i\nH\nM\n| det{∇2q̃ I(Q, Q̃s )}|−1\nμ(Q) =\nehm̃ Q̃s hm̃ e−MI(Q,Q̃s ) 1 + O(1/ M ) .\n2π\n\n(107)\n\nm̃∈M\n\nWe next calculate the numerator in (97) by using the pdf (107). Substituting (107) into the quantity E[fm1 ,m2 eM G̃(Q) ]\nand then using the saddle-point method, we have\n#\n\"\nh\ni\nh\nY\n√ i\nM G̃(Q)\nhH\nQ̃s hm̃\n−MΦ(Qs )\nm̃\nE fm1 ,m2 e\ne\n= Cn (Q, Qs )e\nE fm1 ,m2\n1 + O(1/ M ) ,\n\n(108)\n\nm̃∈M\n\nwith Φ(Q) = I(Q, Q̃s ) − G̃(Q) and Cn (Q, Qs ) = | det{∇2q̃ I(Q, Q̃s )}|−1 det{∇2 Φ(Qs )}−1 . In (108), Qs denotes\nthe saddle-point\nQs = arginf\n\nQ∈M+\nn+1\n\nlim Φ(Q).\n\nM→∞\n\n(109)\n\nFurthermore, ∇2 Φ(Qs ) represents the Hesse matrix of Φ(Q) at the saddle-point Q = Qs , and is assumed to be\npositive definite.\nSimilarly, we can obtain an analytical expression of the denominator in (97). Substituting the obtained expression\nand (108) into (97), we arrive at\n\"\n#\nY ehHm̃ Q̃s hm̃\n1 ∂\nlim lim\nln Zn (ω; f ) = E fm1 ,m2\n,\nhH\nM→∞ ω→0 M ∂ω\nm̃ Q̃s hm̃ ]\nm̃∈M E[e\n\n(110)\n\nwith fm1 ,m2 = f1,1 for f = f1 and fm1 ,m2 = f1,2 for f = f2 .\n\nThe calculations of the stationarity conditions for (105) and (109) implies that (Qs , Q̃s ) is given as the solution\nto the coupled fixed-point equations\n\nτP\nQ̃ = −\nβN0\nOctober 25, 2018\n\ni\nh\nhH\n1 Q̃h1\nE h1 hH\n1e\ni ,\nh\nQ=\nH\nE eh1 Q̃h1\n\n\u0012\n\u0012\n\u0013−1\n\u0013−1\nσθ2\nP\n(1 − τ )σθ2\nI n+1 +\nI n+1 +\nAQ\nAQ\nA−\nA.\nN0\nβ(N0 + P − σθ2 )\nN0 + P − σθ2\n\n(111)\n\n(112)\n\nDRAFT\n\n\fIEEE TRANSACTIONS ON INFORMATION THEORY, VOL. , NO. , 2011\n\n35\n\nD. Replica Symmetry\nThe expression (110) is defined only for n ∈ N, since (n + 1) is the dimension of Q and Q̃. In order to obtain\na formula of (110) defined for n ∈ R, we assume RS for the solution to the coupled fixed-point equations (111)\nand (112).\nAssumption 5. The solution (Qs , Q̃s ) is invariant under all permutations of replica indices:\n\n\na\nb1T\nn\n,\nQs = \nb∗ 1n (d − c)I n + c1n 1T\nn\n\n\nT\nã\nb̃1n\n.\nQ̃s = \n∗\n ̃\nb̃ 1n (d − c̃)I n + c̃1n 1T\nn\n(0)\n\n(113)\n\n(114)\n\n(0)\n\n2\nWe first evaluate the fixed-point equation (112). Let us define (σtr )2 , σtr\n, (σc )2 , and σc2 as\n(0)\n\n(σtr )2 = N0 + P (a − b − b∗ + c),\n2\nσtr\n= N0 + P (d − c),\n\n(σc(0) )2 = N0 + P − σθ2 + σθ2 (a − b − b∗ + c),\nσc2 = N0 + P − σθ2 + σθ2 (d − c),\n\n(115)\n\nrespectively. After some calculation for (112), we obtain\nã = −\n\nn\nn\nτP\n(1 − τ )σθ2\n,\n−\n(0)\n2 + n(σ (0) )2\n2\nβ σtr\nβ\nσc + n(σc )2\ntr\n\nb̃ =\n\n1\n1\n(1 − τ )σθ2\nτP\n+\n,\n(0)\n(0)\n2 + n(σ\n2\n2\nβ σtr\nβ\nσc + n(σc )2\ntr )\n\nc̃ =\n\nτP\n(σtr )2\n(σc )2\n(1 − τ )σθ2\n,\n+\n(0)\n2 + n(σ (0) )2 )σ 2\nβ (σtr\nβ\n(σc2 + n(σc )2 )σc2\ntr\ntr\n\n(0)\n\n(0)\n\n(1 − τ )σθ2\nτP\n−\n.\nd ̃ = c̃ −\n2\nβσtr\nβσc2\n\n(116)\nH\n\nWe next evaluate the fixed-point equation (111) by calculating ehm̃ Q̃hm̃ with (116).\n\n\n\n\n2\nn\nn\nn\n(a) 2\n(a)\n(a)\n\n2\nX\nX\nH\n|hm̃ |  (1 − τ )σθ  2 X hm̃\nτP  2\nhm̃\n−\n+\nehm̃ Q̃hm̃ = exp\nσ̃tr\nσ̃\nc\n(a) 2\n(a) 2\n(a) 2\n β\nβ\na=0 (σtr )\na=0 (σtr )\na=0 (σc )\n\nwith\n\n2\nσ̃tr\n\n=\n\n(a)\n\n−2\n(nσtr\n\n2\n(σtr )2 = σtr\n, and\n\n(0)\n+ (σtr )−2 )−1 and\n(a)\n(σc )2 = σc2 for a\n\nσ̃c2\n\n=\n\n(nσc−2\n\n+\n\n(0)\n(σc )−2 )−1 .\n\nIn (117),\n\n(a)\n(σtr )2 ,\n\n2\n\nand\n\n\nn\n(a) 2 \nX\n|hm̃ | \n−\n,\n(a)\n(σc )2 \na=0\n\n(117)\n\n(a)\n(σc )2\n\nare given by\n\n= 1, . . . , n. In order to linearize the two quadratic forms in (117), we use\n\nthe identity\ne\n\nσ̃2 |a|2\n\n=\n\nZ\n\nC\n\nOctober 25, 2018\n\n1 − |y|22 +a∗ y+ay∗\ne σ̃\ndy,\nπσ̃ 2\n\n(118)\n\nDRAFT\n\n\fIEEE TRANSACTIONS ON INFORMATION THEORY, VOL. , NO. , 2011\n\n36\n\np\nPn\n(a)\n(a)\n2\n) or (a, σ̃ 2 ) =\nfor y = y tr ∈ C or y = y c ∈ C. Substituting (118) with (a, σ̃ 2 ) = ( τ P/β a=0 hm̃ /(σtr )2 , σ̃tr\np\nP\n(a)\n(a)\nn\n( (1 − τ )σθ2 /β a=0 hm̃ /(σc )2 , σ̃c2 ) into (117), we have\nZ Y\nn\n(a)\nhH\nQ̃hm̃\nm̃\n(119)\n= Dn\ne\nq(y|hm̃ )dy,\na=0\n\n(0)\n\n(0)\n\n(a)\n\n2 2 n\n2\nwith Dn = (π 2 σtr\nσc ) (1+n(σtr )2 /σtr\n)(1+n(σc )2 /σc2 ). In (119), the function q(y|hm̃ ) for y = (y tr , y c )T ∈ C2\n\nis defined as\n(a)\nq(y|hm̃ )\n\n= q y tr\n\ns\n\nτ P (a) (a)\nh ;σ\nβ m̃ tr\n\n! \n\nq y c\n\nwith\n\ns\n\n\n(1 − τ )σθ2 (a) (a) \nhm̃ ; σc\n,\nβ\n\n(120)\n\n2\n1 − |y−h|\ne σ2 .\n2\nπσ\n\nq(y|h; σ) =\n\n(121)\n\nApplying the expression (119) to (111), we arrive at\n\u0014\nh\nn\nion \u0015\n2\nR (0)\n(0)\n(1)\n(1)\ndy\nE\nh1 − hh1 i q(y|h1 ) Eh(1) q(y|h1 )\n1\n∗\nh\nhR\nn\nion i\n,\na−b−b +c=\n(0)\n(1)\nE q(y|h1 ) Eh(1) q(y|h1 )\ndy\n1\n\u0014 \u001c\n\u001d\nn\nh\nion \u0015\n2\nR\n(0)\n(1)\n(1)\n(1)\ndy\nh1 − hh1 i\nE\nq(y|h1 ) Eh(1) q(y|h1 )\n1\nhR\nn\nion i\nh\n,\nd−c=\n(0)\n(1)\ndy\nE q(y|h1 ) Eh(1) q(y|h1 )\n\n(122)\n\n(123)\n\n1\n\nwith\n\nh\n\ni\n(1)\n(1)\nEh(1) h1 q(y|h1 )\n(1)\n1\ni .\nh\nhh1 i =\n(1)\nEh(1) q(y|h1 )\n\n(124)\n\n1\n\nE. Replica Continuity\nEquations (115), (122), and (123) provide the coupled fixed-point equations of (a − b − b∗ + c, d − c) under the\nRS assumption, and are well defined for n ∈ R. We regard n as a real number and take the limit n → +0 to obtain\n\u0014\n\u0015\n2\n(0) 2\n(0)\n(1)\n(σtr ) = N0 + P E h1 − hh1 i ,\n(125)\n2\nσtr\n= N0 + P E\n\n(σc(0) )2\nσc2\n\n= N0 + P −\n\n= N0 + P −\n\n\u0014\n\nσθ2\n\nσθ2\n\n+\n\n(1)\n\n(1)\n\nh1 − hh1 i\n\n+\n\nσθ2 E\n\nσθ2 E\n\n\u0014\n\n\u0014\n\n(0)\nh1\n\n(1)\nh1\n\n−\n\n2\n\n−\n\n\u0015\n\n,\n\n(126)\n\n(1)\nhh1 i\n\n(1)\nhh1 i\n(0)\n\n2\n\n2\n\n\u0015\n\n\u0015\n\n,\n\n(127)\n\n,\n\n(128)\n(1)\n\n(1)\n\nwhere the expectations for y are taken with respect to the measure p(y|h1 )dy. Note that E[|h1 − hh1 i|2 ] and\n(1)\n\n(1)\n\n(0)\n\n(0)\n\n2\nE[|h1 − hh1 i|2 ] depend on (σtr )2 , σtr\n, (σc )2 , and σc2 . Furthermore, the quantity (110) is given by\n\n E[|h(0) − hh(1) i|2 ] for f = f\n1 ∂\n1\n1\n1\nln Zn (ω; f ) =\nlim lim\nM→∞ ω→0 M ∂ω\n\n0\nfor f = f2 .\n\n(129)\n\nOctober 25, 2018\n\nDRAFT\n\n\fIEEE TRANSACTIONS ON INFORMATION THEORY, VOL. , NO. , 2011\n\n37\n\nUnder the assumption of the commutativity between the large-system limit and the limit n → +0, the substitution\nof (129) into (71) or (72) gives\nlim ξ̄t2 = E\n\nM→∞\n\n\u0014\n\n(0)\n\n(1)\n\nh1 − hh1 i\n\n2\n\n\u0015\n\n,\n\n(130)\n\nlim ρ̄t = 0,\n\n(131)\n\nM→∞\n\nin the large-system limit. Note that we have implicitly assumed that the RHSs of (130) and (131), obtained by the\nreplica method, coincide with the correct ones.\nIn order to complete the derivation of Proposition 5, we show that (130) reduces to (37), defined by the fixed-point\n(a)\n\n(0)\n\n(1)\n\n(1)\n\n(1)\n\nequations (44) and (45). Since h1 ∼ CN (0, 1), the quantities E[|h1 − hh1 i|2 ] and E[|h1 − hh1 i|2 ] reduce to\n!\n\u0014\n\u0015\n(0)\n(0)\n2\n(σc )2 (1 − τ )σθ2\n(σtr )2 τ P\n(0)\n(1)\n4\n,\n(132)\n+\nE h1 − hh1 i\n=ξ 1+\n4β\nσtr\nσc4 β\n\u0015\n\u0014\n2\n(1)\n(1)\n= ξ2,\n(133)\nE h1 − hh1 i\nwith\n\n\u0012\n\u0013−1\nτP\n(1 − τ )σθ2\nξ = 1+ 2 +\n.\nσtr β\nσc2 β\n2\n\n(134)\n\n2\nEquations (126), (128), and (133) provide a closed form for (σtr\n, σc2 ). Furthermore, (125), (127), and (132) for a\n(0)\n\n(0)\n\n2\ngiven solution (σtr\n, σc2 ) form two independent linear equations with respect to (σtr )2 and (σc )2 , and have the\n(0)\n\n(0)\n\n2\n, σc2 ). These observations indicate that the averaged MSE (130) is given as\nunique solution ((σtr )2 , (σc )2 ) = (σtr\n\n(37), defined by the fixed-point equations (44) and (45).\nA PPENDIX C\nD ERIVATION\n\nOF\n\nP ROPOSITION 6\n\nA. Formulation\nLet EỸ \\t ,x[1,m),t [* * * ] denote the expectation with respect to Ỹ \\t and x[1,m),t given x̃m,t , xm,t , X̄ \\t and θt .\nIt is sufficient from Assumption 2 to show that EỸ \\t ,x[1,m),t [p(x̃m,t |xm,t , Ĩt , x[1,m),t , θ[m,M],t )], given by (20),\nconverges in law to the equivalent channel (65) in the large-system limit. Substituting the posterior pdf (17) into\n(20) and then introducing a non-negative number n, we have\ni\nh\nEỸ \\t ,x[1,m),t p(x̃m,t |xm,t , Ĩt , x[1,m),t , θ[m,M],t ) = lim Zn(d) ,\n\n(135)\n\nn→+0\n\nwith\n\nZn(d)\n\n= EỸ \\t ,x[1,m),t\n\n\"Z \u001aZ\n\np(y t |x̃t , Ĩt )p(x̃[m,M],t |θ [m,M],t )dx̃[m,M],t\n\n\u001bn−1\n\np(y t |x̃t , Ĩt )\n\ni\n×p(x̃[m,M],t |θ[m,M],t )dx̃(m,M],t p(y t |xt , Ĩt )p(x(m,M],t |θ (m,M],t )dx(m,M],t dy t ,\n\n(136)\n\nwhere we have introduced x̃t = ((x[1,m),t )T , (x̃[m,M],t )T )T , in which x̃[m,M],t = (x̃m,t , . . . , x̃M,t )T has the same\nstatistical properties as x[m,M],t . Furthermore, x̃(m,M],t is given by x̃(m,M],t = (x̃m+1,t , . . . , x̃M,t )T . Note that\n\nOctober 25, 2018\n\nDRAFT\n\n\fIEEE TRANSACTIONS ON INFORMATION THEORY, VOL. , NO. , 2011\n\n38\n\n(136) is a quantity of O(1), while (70) is exponential in M . Thus, we have to evaluate (136) up to O(1) in the\nlarge-system limit.\nLet us regard n in (136) as a positive integer. For n = 2, 3, . . ., (136) reduces to a special expression,\n\"Z n\nn n\no\nY\nY\n(a)\n(a)\n(a)\n(d)\np(x[m,M],t |θ[m,M],t )dx[m,M],t\np(y t |xt , Ĩt )\nZn = EỸ \\t ,x[1,m),t\na=0\n\na=2\n\n(1)\n(1)\n(0)\n(0)\n×p(x(m,M],t |θ(m,M],t )dx(m,M],t p(x[m,M],t |θ[m,M],t )dx(m,M],t dy t\n\n(a)\n\nIn (137), xt\n(a)\n\n(a)\n\ni\n\n.\n\n(137)\n(a)\n\n= ((x[1,m),t )T , (x[m,M],t )T )T ∈ CM denotes replicas of x̃t for a = 2, . . . , n, in which {x[m,M],t =\n\n(a)\n\n(xm,t , . . . , xM,t )T } conditioned on θ [m,M],t are independent random vectors drawn from p(x[m,M],t |θ[m,M],t ). For\n(a)\n\n(a)\n\n(a)\n\nnotational convenience, we have written x[m,M],t and x̃[m,M],t as x[m,M],t = (xm,t , . . . , xM,t )T for a = 0 and\n(a)\n\n(a)\n\n(a)\n\n(a)\n\na = 1, respectively. The vector x(m,M],t is defined as x(m,M],t = (xm+1,t , . . . , xM,t )T . Furthermore, we have\n(a)\n\nwritten xt and x̃t as xt\n\n(a)\n\n= ((x[1,m),t )T , (x[m,M],t )T )T for a = 0 and a = 1, respectively.\n\nB. Average over Non-Replicated Variables\nThe goal of this section is to evaluate the expectation in (137) with respect to the non-replicated variables Ỹ \\t .\nWe first calculate the integration in (137) with respect to y t . The substitution of (18) into (137) gives\n\"Z n\nn n\no\noY\nYn\n(a)\n(a)\n(a)\n(d)\np(x[m,M],t |θ [m,M],t )dx[m,M],t\np(y t |H (a) , xt )p(H (a) |Ĩt )dH (a)\nZn = EỸ \\t ,x[1,m),t\na=2\n\na=0\n\n(1)\n(1)\n(0)\n(0)\n×p(x(m,M],t |θ (m,M],t )dx(m,M],t p(x[m,M],t |θ[m,M],t )dx(m,M],t dy t\n\ni\n\n,\n\n(138)\n\n~ (a) )T , . . . , (h\n~ (a) )T )T ∈ CN ×M denotes replicas of H for a = 0, . . . , n: {H (a) } conditioned on\nwhere H (a) = ((h\n1\nN\nĨt are mutually independent random matrices drawn from p(H|Ĩt ). This expression is useful since the covariance\n(a)\n\n(a)\n\n(a)\n\nmatrix of y t for p(y t |H (a) , xt ) does not depend on xt , while the covariance matrix of y t for p(y t |xt , Ĩt )\n\n(a)\n(a)\n~ (a)\ndepends on xt . Using the fact that the row vectors {h\nare mutually independent, we obtain\nn′ } of H\n( N\n\"Z n \u001a\n)\n\u001b #\nY\nY\n1 − N1 |y−vn(a)′ ,m,t |2\n(1) (1)\n(1)\n(0)\n(d)\nZn = p(xm,t |θm,t )E\nE{h\n(139)\ndy xm,t , xm,t , X̄ \\t , θt ,\ne 0\n~ (a)\n}\nπN0\nn′\n′\na=0\nn =1\n\nwith\n\n(a)\nvn′ ,m,t\n(a)\n\n(a)\n\n1\n= √\nM\n\n\" m−1\nX\n\nm′ =1\n\n(a)\n∆hn′ ,m′ ,t xm′ ,t\n\n+\n\nM\nX\n\nm′ =m\n\n(a)\n(a)\nhn′ ,m′ xm′ ,t\n\n#\n\n,\n\n(140)\n(a)\n\nwhere hn′ ,m′ and ∆hn′ ,m′ ,t denote the (n′ , m′ )th element of H (a) and the LMMSE estimation error ∆hn′ ,m′ ,t =\n(a)\n\nhn′ ,m′ − ĥn′ ,m′ ,t , respectively, with ĥn′ ,m′ ,t denoting the (n′ , m′ )th element of the LMMSE estimate (15). In\n\n~ (a)\n~ (a)\n(139), the expectation E{h\n[* * * ] is taken with respect to the measure p(h\nn′ |Ĩt )dhn′ . In the derivation of (139),\n~ (a)\nn′ }\nPm−1\nwe have eliminated the bias b = M −1/2 m′ =1 ĥn′ ,m′ ,t xm′ ,t known to the receiver by transforming (y t )n′ into\ny = (y t )n′ − b. Performing the Gaussian integration with respect to y, we have\n\n\ni\nh\n−N0−1 v H\nAv n′ ,m,t\nn′ ,m,t\nN E (a)\ne\nY\n~ ′ }\n{h\n\n\n(1)\n(0)\n(1)\n(1)\nn\nxm,t , xm,t , X̄ \\t , θt  ,\nZn(d) = p(xm,t |θm,t )E \nn (1 + n)\n(πN\n)\n0\n′\n\n(141)\n\nOctober 25, 2018\n\nDRAFT\n\nn =1\n\n\fIEEE TRANSACTIONS ON INFORMATION THEORY, VOL. , NO. , 2011\n\n39\n\n(n)\n\n(0)\n\nwith v n′ ,m,t = (vn′ ,m,t , . . . , vn′ ,m,t )T . In (141), the matrix A is given by (84).\n(a)\n~ (a)\nWe next calculate the expectation in (141) with respect to {h\nn′ }. Since {hn′ ,m′ } conditioned on Ĩt are proper\n(a)\n\ncomplex Gaussian random vectors4, the random vector v n′ ,m,t conditioned on Xt = {xt\n\n: for all a} and Ĩt is\n\nalso a proper complex Gaussian random variable with mean\nM\n1 X\nun′ ,m,t = √\nĥn′ ,m′ ,t xm′ ,t ,\nM m′ =m\n(0)\n\n(0)\n\n(n)\n\n(142)\n(n)\n\nand with the covariance matrix D = M −1 diag{(xt )H Ξt xt , . . . , (xt )T Ξt xt }, in which xm′ ,t ∈ Cn+1 is\n(0)\n\n(n)\n\ngiven by xm′ ,t = (xm′ ,t , . . . , xm′ ,t )T . In the same manner as in the derivation of (91), we take the expectation\nwith respect to v n′ ,m,t conditioned on Xt and Ĩt to obtain\n\" N\n#\nY G(N −1 D)−uH\n−1\n(1)\n(1)\n(1)\n(0)\nB(D,N\nA)u\n′\n(d)\n′\nn\n,m,t\n0\n0\nn ,m,t\nZn = p(xm,t |θm,t )E\ne\nxm,t , xm,t , X̄ \\t , θt ,\n\n(143)\n\nn′ =1\n\nwhere G(Q) and B(D, N0−1 A) are given by (87) and (92), respectively.\n\nFinally, we evaluate the expectation in (143) with respect to Ỹ \\t . Expression (15) implies that the LMMSE\nestimates {(ĥn′ ,m,t , . . . , ĥn′ ,M,t ) : for all n′ } conditioned on X̄ \\t are mutually independent CSCG random vectors\n(c)\n\nwith the covariance matrix I − Ξt . Thus, the vectors {un′ ,m,t } conditioned on X̄ \\t and Xt are also mutually\n(a′ )\n\nindependent CSCG random vectors with covariance E[(un′ ,m,t )a (un′ ,m,t )∗a′ |X̄ \\t , Xt ] = M −1 (x[m,M],t )H (I −\n(c)\n\n(a)\n\nΞt )x[m,M],t for all n′ . Taking the expectation with respect to Ỹ \\t , after some calculation, we have\nh\ni\n−1\n(1) (1)\n(1)\n(0)\nZn(d) = p(xm,t |θm,t )E eN G(N0 Qd ) xm,t , xm,t , Ξt , θ t ,\n\n(144)\n\nwhere the (n + 1) × (n + 1) Hermitian matrix Qd is given by\n(a)\n\n(a)\n\n(Qd )a,a′ = M −1 δa,a′ (xt )H Ξt xt\n\n(a′ )\n\n(c)\n\n(a)\n\n+ M −1 (x[m,M],t )H (I − Ξt )x[m,M],t .\n\n(145)\n\nC. Average over Replicated Variables\nIn order to evaluate the conditional expectation in (144) with respect to the replicated variables Qd , we evaluate\n(1)\n(0)\nthe pdf of Qd conditioned on xm,t , xm,t , Ξt , and θ t . Let us define the function I ̃d (Qd , Q̃d ) as\n\nI ̃d (Qd , Q̃d ) = Tr(Qd Q̃d ) − lim\n\nM→∞\n\n1\nln F̃d (Q̃d ),\nM\n\n(146)\n\nwith\ni\nh\nF̃d (Q̃d ) = E eMTr(Qd Q̃d ) Ξt , θt ,\n\n(147)\n\nwhere a positive definite (n + 1) × (n + 1) Hermitian matrix Q̃d is defined in the same manner as in (100). In (146),\n(s)\n\nwe have implicitly assumed that the limit in the RHS of (146) exists. Furthermore, we define the saddle-point Q̃d\nas\n(s)\nQ̃d = argsup I ̃d (Qd , Q̃d ).\n\n(148)\n\nQ̃d ∈M+\nn+1\n\n4\n\nWe could not immediately conclude the Gaussianity of v n′ ,m,t if the optimal channel estimator (9) were used.\n\nOctober 25, 2018\n\nDRAFT\n\n\fIEEE TRANSACTIONS ON INFORMATION THEORY, VOL. , NO. , 2011\n\n40\n\n(1)\n\n(0)\n\nWe represent the pdf μ(Qd ) of Qd conditioned on xm,t , xm,t , Ξt , and θt by using the inversion formula for the\nmoment generating function of Qd , given by\ni\nh\n(1)\n(0)\nFd (Q̃d ) = E eMTr(Qd Q̃d ) xm,t , xm,t , Ξt , θt .\n\n(149)\n\nUsing the saddle-point method in the same manner as in the derivation of (107) gives\n\u0012 \u0013(n+1)2\n(s)\n−1\n(s)\nM\n| det{∇2Q̃ Id (Qd , Q̃d )}|−1 e−MId (Qd ,Q̃d )+O(M ) [1 + O(M −1/2 )],\nμ(Qd ) =\nd\n2π\n\n(150)\n\nin the large-system limit. In (150), the function Id (Qd , Q̃d ) is given by\nId (Qd , Q̃d ) = Tr(Qd Q̃d ) −\n\n1\nln Fd (Q̃d ).\nM\n\n(151)\n\nFurthermore, ∇2Q̃ Id (Q, Q̃d ) denotes the Hesse matrix of (151) with respect to Q̃d .\nd\n\nThe factor O(M −1 ) in the exponent in (150) is due to a small deviation of the saddle-point (148). The removal\n\nor addition of one transmit antenna results in a small change of M Tr(Qd Q̃d ), more precisely, in a change of O(1).\nThis observation implies that Id (Qd , Q̃d ) = I ̃d (Qd , Q̃d ) + O(M −1 ) in the large-system limit. Differentiating both\n(s)\n\nsides with respect to Q̃d at the saddle-point (148), we find that the gradient ∇Q̃d Id (Qd , Q̃d ) of (151) with respect\n\nto Q̃d at the saddle-point is O(M −1 ), which explains the factor O(M −1 ) in the exponent in (150) since a deviation\n(s)\n\nof the saddle-point results in a deviation of the exponent which is proportional to M k∇Q̃d Id (Qd , Q̃d )k2 .\nWe repeat the same argument to evaluate (144). Applying (150) to (144) and using the saddle-point method, we\narrive at\n(1)\n\n(s)\n\n(1)\n\n(s)\n\n(s)\n\nZn(d) = p(xm,t |θm,t )Cn(d) (Qd , Q̃d )e−MΦd (Qd ) [1 + O(M −1/2 )].\n\n(152)\n\nIn (152), the function Φd (Qd ) is defined as\n(s)\n\nΦd (Qd ) = Id (Qd , Q̃d ) − α−1 G(N0−1 Qd ).\n\n(153)\n\n(s)\n\nThe saddle-point Qd is given by\n(s)\n\nQd = arginf Φ̃d (Qd ),\n\n(154)\n\nQd ∈M+\nn+1\n\nwith\n(s)\n\nΦ̃d (Qd ) = I ̃d (Qd , Q̃d ) − α−1 G(N0−1 Qd ).\n\n(155)\n\n(d)\n\nFurthermore, Cn (Qd , Q̃d ) is defined as\nCn(d) (Qd , Q̃d ) = | det{∇2Q̃ Id (Qd , Q̃d )}|−1 det{α−1 ∇2Qd G(N0−1 Qd )}−1 ,\nd\n\n(156)\n\nwhere ∇2Qd G(N0−1 Qd ) denotes the Hesse matrix of G(N0−1 Qd ) with respect to Qd . Note that we have assumed\n(s)\n\nthe positive definiteness of the Hesse matrix ∇2Qd G(N0−1 Qd ) at the saddle-point Qd = Qd .\n(s)\n\n(s)\n\nThe calculation of the stationarity conditions for (148) and (154) implies that (Qd , Q̃d ) is given as the solution\nto the coupled fixed-point equations\nh\ni\nE Qd eMTr(Qd Q̃d ) Ξt , θt\ni ,\nh\nQd = lim\nM→∞\nE eMTr(Qd Q̃d ) Ξt , θ t\nOctober 25, 2018\n\n(157)\n\nDRAFT\n\n\fIEEE TRANSACTIONS ON INFORMATION THEORY, VOL. , NO. , 2011\n\nα−1\nQ̃d = −\nN0\n\n41\n\n\u0013−1\n\u0012\nA\nA.\nI n+1 +\nQ\nN0 d\n\n(158)\n\nD. Evaluation of Fixed-Point Equations\nIn order to evaluate the coupled fixed-point equations (157) and (158), we assume RS. The assumption of RS is\nconsistent with Assumption 2, i.e., the assumption of the self-averaging property for the equivalent channel (20) [52].\n(s)\n\n(s)\n\nAssumption 6. The solution (Qd , Q̃d ) is invariant under all permutations of replica indices:\n\n\nad\nb d 1T\nn\n(s)\n,\nQd = \nb∗d 1n (dd − cd )I n + cd 1n 1T\nn\n\n\nT\nb̃\n1\nã\n(s)\nd n\nd\n.\nQ̃d = \n∗\n ̃\nb̃d 1n (dd − c̃d )I n + c̃d 1n 1T\nn\n\n(159)\n\n(160)\n\nWe first evaluate the fixed-point equation (158). Let us define σ02 and σ 2 as\nσ02 = N0 + (ad − bd − b∗d + cd ),\n\n(161)\n\nσ 2 = N0 + (dd − cd ),\n\n(162)\n\nrespectively. After some calculation, we obtain\n−1\nα−1\nα−1 σ02\nα−1 n\n ̃d = c̃d − α .\n,\nd\n,\nb̃\n=\n,\nc̃\n=\n(163)\nd\nd\nσ 2 + nσ02\nσ 2 + nσ02\n(σ 2 + nσ02 )σ 2\nσ2\nq\n(s) (s)\n(c)\n(c)\nWe next calculate the quantity exp{M Tr(Qd Q̃d )}. Let I − Ξt denote a square root of I − Ξt , i.e.,\nq\nq\nH\n(c)\n(c)\n(c)\nI − Ξt = I − Ξt\nI − Ξt . Substituting (163) into that quantity gives\n\nq\nq\n2\n\n(c) (a)\n2\nn\nn k I − Ξ(c) x(a)\n\nX\nX\nI\n−\nΞ\nx\n(s) (s)\nt\nt\n[m,M],t\n[m,M],t k\n2\nMTr(Qd Q̃d )\n√ 2\n= exp σ̃0\ne\n−\n\nασa\nασa2\n\na=0\na=0\n)\nn\nX\n(0) H\n(0)\n(a)\n(a)\n,\n(164)\n+ãd (x ) Ξt x + d ̃d\n(x )H Ξt x\n\nãd = −\n\nt\n\nt\n\nt\n\nt\n\na=1\n\nwith σ̃02 = (nσ −2 + σ0−2 )−1 and σa2 = σ 2 for a = 1, . . . , n. In order to linearize the quadratic form in (164), we\nuse the identity\ne\n\nσ̃02 kak2\n\n=\n\nZ\n\nCM −m+1\n\nwith a =\n\n1\n(πσ̃02 )M−m+1\n\n2\n\ne\n\nH\nH\n− kzk\n2 +a z+z a\nσ̃0\n\ndz,\n\nq\n√\n(c) (a)\nI − Ξt x[m,M],t /( ασa2 ) to obtain\na=0\nZ Y\nn n\no\n(s) (s)\n(a)\nq̃a (z|xt , Ξt ) dz,\neMTr(Qd Q̃d ) = Dn(d)\n\n(165)\n\nPn\n\n(166)\n\na=0\n\n(d)\n\n(0)\n\n(a)\n\nwith Dn = (πσ 2 )n(M−m+1) (1 + nσ02 /σ 2 )M−m+1 . In (166), the functions q̃0 (z|xt , Ξt ) and q̃a (z|xt , Ξt ) for\na = 1, . . . , n are given by\n(0)\n\n(0)\n\n(c)\n\n(0) H\n\nq̃0 (z|xt , Ξt ) = q0 (z|x[m,M],t , Ξt )eãd (xt\nOctober 25, 2018\n\n(0)\n\n) Ξt x t\n\n,\n\n(167)\nDRAFT\n\n\fIEEE TRANSACTIONS ON INFORMATION THEORY, VOL. , NO. , 2011\n\n(a)\n\n42\n(a) H\n\n(c)\n\n(a)\n\nq̃a (z|xt , Ξt ) = qa (z|x[m,M],t , Ξt )ed̃d (xt\n(a)\n\n(a)\n\n) Ξt x t\n\n,\n\n(168)\n\n(c)\n\nrespectively, where qa (z|x[m,M],t , Ξt ) represents the pdf of a proper complex Gaussian random vector z ∈\nq\n√\n(c) (a)\nCM−m+1 with mean I − Ξt x[m,M],t / α and covariance σa2 I, i.e.,\n\n\nq\n√ 2\n\n(c) (a)\n\n\n/\n−\nI\n−\nΞ\nx\nαk\nkz\n1\nt\n[m,M],t\n(c)\n(a)\nqa (z|x[m,M],t , Ξt ) =\n.\n(169)\nexp\n−\n\n\n(πσa2 )M−m+1\nσa2\n\n\nFinally, we evaluate the fixed-point equation (157). Substitution of (166) into (157) gives expressions of ad −\n\nbd − b∗d + cd and dd − cd well-defined for n ∈ R. Taking n → +0, we have\n\u001aZ\n1\n(c)\n(0)\n∗\nlim (ad − bd − bd + cd )= lim\nE\nq0 (z|x[m,M],t , Ξt )\nn→+0\nM→∞ M\nq\n(0) H\n(0)\n(1)\n(c)\n(0)\n× (xt ) Ξt xt +\nI − Ξt (x[m,M],t − hx[m,M],t i)\n1\nE\nlim (dd − cd ) = lim\nn→+0\nM→∞ M\n*\n×\n\n\u001aZ\n\ndz Ξt , θt\n\n)\n\n, (170)\n\n(c)\n\n(0)\n\nwith\n=\n\n!\n\nq0 (z|x[m,M],t , Ξt )\n\n(1)\n(1)\n(xt )H Ξt xt\n\n(1)\nhxt i\n\n2\n\nR\n\nq\n(1)\n(c)\n(1)\nI − Ξt (x[m,M],t − hx[m,M],t i)\n+\n\n(1)\n\n(1)\n\n(1)\n\n2\n\n+\n\ndz Ξt , θ t\n\n)\n\n,\n\n(171)\n\n(1)\n\nxt q̃1 (z|xt , Ξt )p(xt |θt )dxt\n.\nR\n(1)\n(1)\n(1)\nq̃1 (z|xt , Ξt )p(xt |θt )dxt\n\n(172)\n\nSubstituting these expressions into (161) or (162), we have the coupled fixed-point equations\nio\nh\n1 n\n(1)\n(c)\n(0)\n(c)\n(1)\n(0)\nσ02 = N0 + lim\nP Tr(Ξt ) + E (x[m,M],t − hx[m,M],t i)H (I − Ξt )(x[m,M],t − hx[m,M],t i) Ξt , θt ,\nM→∞ M\n(173)\nn\nh\nio\n1\n(1)\n(c)\n(1)\n(c)\n(1)\n(1)\nσ 2 = N0 + lim\nP Tr(Ξt ) + E (x[m,M],t − hx[m,M],t i)H (I − Ξt )(x[m,M],t − hx[m,M],t i) Ξt , θt ,\nM→∞ M\n(174)\n(c)\n\n(0)\n\nwhere the average over z is taken with respect to the measure q0 (z|x[m,M],t , Ξt )dz.\nThe coupled fixed-point equations (173) and (174) have the solution σ02 = σ 2 . Nishimori's result [36] implies\nthat σ02 = σ 2 is the correct solution. Assuming σ02 = σ 2 , we have the single fixed-point equation\nσ 2 = N0 + lim\n\nM→∞\n\nP\nTr(Ξt ) + V (σ 2 ),\nM\n\n(175)\n\nwith\ni\n1 h (1)\n(c)\n(1)\n(c)\n(1)\n(1)\nE (x[m,M],t − hx[m,M],t i)H (I − Ξt )(x[m,M],t − hx[m,M],t i) Ξt , θ[m,M],t .\nM→∞ M\n\nV (σ 2 ) = lim\n\n(176)\n\n(c)\n\n(0)\n\nIn (175), the average over z is taken with respect to the measure q0 (z|x[m,M],t , Ξt )dz with σ02 = σ 2 . Furthermore,\n(1)\n\n(c)\n\n(1)\n\n(1)\n\n(1)\n\nhx[m,M],t i denotes the expectation of x[m,M],t with respect to the posterior measure q1 (x[m,M],t |z, Ξt )dx[m,M],t ,\ngiven by\n\n(c)\n\n(1)\n\n(1)\n(c)\nq1 (x[m,M],t |z, Ξt , θ[m,M],t )\n\n= R\n\n(1)\n\n(c)\n\nq1 (z|x[m,M],t , Ξt )p(x[m,M],t |θm,t )\n(1)\n\n(c)\n\n(1)\n\n(1)\n\nq1 (z|x[m,M],t , Ξt )p(x[m,M],t |θ[m,M],t )dx[m,M],t\n\n.\n\n(177)\n\nNote that the fixed-point equation (175) is equivalent to (66).\nOctober 25, 2018\n\nDRAFT\n\n\fIEEE TRANSACTIONS ON INFORMATION THEORY, VOL. , NO. , 2011\n\n43\n\nE. Replica Continuity\n(s)\n\nWe evaluate (152) under the RS assumption (Assumption 6). The function G(N0−1 Qd ), given by (87), reduces\nto [17]\n(s)\n\nG(N0−1 Qd ) = −(n − 1) ln σ 2 − ln(σ 2 + nσ02 ) − n ln π,\n\n(178)\n\nwhich is well defined for n ∈ R and tends to zero as n → +0.\nApplying (161), (162), and (163) to (151), we obtain\n\u0014\n\u0015\nN0\n1\nN0\nN0 σ02\n(s)\n(s)\nn\n(s)\n1− 2\n−\n− 2 + 2 2\nln Fd (Q̃d ).\nId (Qd , Q̃d ) = −\n2\n2\nα\nσ + nσ0\nσ\nσ (σ + nσ0 )\nM\n\n(179)\n\nSubstituting (166) into the moment generating function (149), we have an expression of (179) well defined for\nn ∈ R. Taking n → +0, under the assumption of σ02 = σ 2 , we have\n(s)\n\n(s)\n\nlim Id (Qd , Q̃d )\nZ\n1\n(0)\n(c)\n(0)\n(c)\n(0)\n(1)\n=− ln q1 (xm,t |z, Ξt , θ[m,M],t )q0 (z|x[m,M],t , Ξt )p(x(m,M],t |θ(m,M],t )dx(m,M],t dz,\n(180)\nM\nR\n(1)\n(c)\n(1)\n(c)\n(1)\nwith the marginal q1 (xm,t |z, Ξt , θ[m,M],t ) = q1 (x[m,M],t |z, Ξt , θ[m,M],t )dx(m,M],t of (177). Substituting\nn→+0\n\n(178) and (180) into (153) and assuming that the obtained expression is correct as n → +0, from (135), we arrive\n\nat\nh\ni\n(s)\n(s)\nEỸ \\t ,x[1,m),t p(x̃m,t |xm,t , Ĩt , x[1,m),t , θ[m,M],t ) = lim Cn(d) (Qd , Q̃d )\nn→+0\nZ\n(0)\n(c)\n(0)\n(c)\n(0)\n(1)\n× q1 (xm,t |z, Ξt , θ[m,M],t )q0 (z|x[m,M],t , Ξt )p(x(m,M],t |θ(m,M],t )dx(m,M],t dz,\n\n(181)\n\nwhere we have assumed that the large-system limit and the limit n → +0 are commutative. Due to the normalization\n(d)\n\n(s)\n\n(s)\n\nof pdfs, the quantity Cn (Qd , Q̃d ) should tend to 1 as n → +0. This observation implies that the RHS of (181)\nis equal to the equivalent channel (65) between xm,t and the associated decoder for the MIMO channel (64) with\nperfect CSI at the receiver.\nF. Multiple Solutions\nThe fixed-point equation (175) may have multiple solutions. In that case, one has to choose the solution minimizing\n(s)\n\n(s)\n\nthe quantity (155). Due to limn→+0 Φ̃d (Qd ) = 0, the quantity Φ̃d (Qd ) is given by Φ̃d (Qd ) = nF + O(n2 )\nas n → +0, with the so-called free energy F = limn→+0\n\n(s)\n∂\n∂n Φ̃d (Qd ).\n\nThus, one should choose the solution\n\nminimizing the free energy F .\nIn order to calculate the free energy F , in the same manner as in the derivation of (179), we evaluate (146) as\n\u0014\n\u0015\n(s)\nn\nN0\n1\nN0\nN0 σ02\n(s)\nI ̃d (Qd , Q̃d ) = −\n1− 2\n− lim\n−\n+\nln Dn(d)\nM→∞ M\nα\nσ + nσ02\nσ2\nσ 2 (σ 2 + nσ02 )\nZ\nn\non\n1\n(0)\n(1)\n(182)\nln Ex(0) [q̃0 (z|xt , Ξt )] Ex(1) [q̃1 (z|xt , Ξt )] dz.\n− lim\nt\nt\nM→∞ M\n\nWe differentiate (178) and (182) with respect to n at n = 0 to obtain\n\u0014\n\u0015\n1\n1\n1\nF = lim\nDe (N0 kσ 2 ) + lim\nTr(Ξ\n)\n+\nln(πeN\n)\n,\nI(x[m,M],t ; z) +\nt\n0\nM→∞ M\nM→∞ M σ 2\nα\nOctober 25, 2018\n\n(183)\n\nDRAFT\n\n\fIEEE TRANSACTIONS ON INFORMATION THEORY, VOL. , NO. , 2011\n\n44\n\nwith\nI(x[m,M],t ; z) =\n\nZ\n\n(c)\n\n(0)\n\n(0)\n\nq0 (z|x[m,M],t , Ξt )p(x[m,M],t |θ [m,M],t )\n(c)\n\n(0)\n\n× ln R\n\nq1 (z|x[m,M],t , Ξt )\n\n(0)\n\n(1)\n(c)\n(1)\n(1)\nq1 (z|x[m,M],t , Ξt )p(x[m,M],t |θ[m,M],t )dx[m,M],t\n\ndx[m,M],t dz.\n\n(184)\n\nMinimizing (183) is equivalent to minimizing (68).\nA PPENDIX D\nR EDUCTION\n\nOF\n\nP ROPOSITION 6 TO P ROPOSITION 1\n\nLet us prove that the fixed-point equation (66) coincides with the fixed-point equation (46). We first show that the\nlast term in (46) is a lower bound on the last term in (66), by considering the MIMO channel (64) with additional side\ninformation. Let a genie inform the receiver about the correct values of the data symbols x(m,M],t . The MSE (67)\nfor the genie-aided receiver should provide a lower bound on the original one. In order to eliminate the inter-stream\nPM\ninterference from the MF output vector (69), the genie-aided receiver calculates r s = r − m′ =m+1 ξt,m′ xm′ ,t /α,\n\ngiven by\n\nrs =\n\n1\nξ xm,t + η.\nα t,m\n\n(185)\n\nThe performance of the interference-free channel (185), such as the MSE and the constrained capacity, is determined\nby the SNR\nsnr =\n\nP kξt,m k4\n\n(c)\n\nασ 2 ξ H\nt,m (I − Ξt )ξ t,m\n\n.\n\n(186)\n\nProposition 5 and Lemma 1 imply that the numerator and denominator in (186) are given by P kξt,m k4 = P (1 −\n(c)\n\n2\n2\n3\n−1/4\nξ 2 (τ ))4 + O(M −1/4 ) and ασ 2 ξ H\n) in the large-system limit,\nt,m (I − Ξt )ξ t,m = ασ (1 − ξ (τ )) + O(M\n\nrespectively. Thus, the SNR (186) converges in probability to snr = (1 − ξ 2 (τ ))P/(ασ 2 ) in the large-system limit,\n\nwhich coincides with the SNR for the AWGN channel (40) with σ 2 (τ, μ) = σ 2 . This expression implies that the\n\nlast term (67) in the fixed-point equation (66) is bounded from below by (1 − μ)(1 − ξ 2 (τ ))E[MSE(σ 2 , θm,t )] in\nthe large-system limit.\nWe next prove that the last term in (46) is an upper bound on the last term in (66). Let us consider a suboptimal\nreceiver, which estimates xm,t only from the first element rm of the MF output vector (69), given by\n(c)\n\nrm =\n\n1 − (Ξt )m,m\nxm,t +\nα\n\nM\nX\n\nm′ =m+1\n\n(c)\n\n(Ξt )m,m′\nxm′ ,t + ηm ,\nα\n\n(187)\n\nwith ηm denoting the first element of η. In order to evaluate an upper bound on the MSE (67) for this suboptimal\nreceiver, we replace the inter-stream interference in (187) by the AWGN with the same variance. The MSE (67)\nfor the obtained channel provides an upper bound on the original one, and is determined by the SNR\n(c)\n\nsnr =\n\nOctober 25, 2018\n\nP\n\nPM\n\nm′ =m+1\n\nP (1 − (Ξt )m,m )2\n(c)\n\n(c)\n\n|(Ξt )m,m′ |2 + ασ 2 (1 − (Ξt )m,m )\n\n,\n\n(188)\n\nDRAFT\n\n\fIEEE TRANSACTIONS ON INFORMATION THEORY, VOL. , NO. , 2011\n\n45\n\nwhich converges in probability to snr = (1 − ξ 2 (τ ))P/(ασ 2 ) in the large-system limit, due to Proposition 5\nand Lemma 1. This result implies that the last term (67) in the fixed-point equation (66) is bounded from above\nby (1 − μ)(1 − ξ 2 (τ ))E[MSE(σ 2 , θm,t )] in the large-system limit. Combining the two bounds, we find that the\nfixed-point equation (66) is equal to the fixed-point equation (46).\nThe argument described above implies that the inter-stream interference is negligible in the large-system limit. It\n(c)\n\nis straightforward to confirm that the mutual information I(xm,t ; x̃m,t |Ξt , θ[m,M],t ) converges to the constrained\ncapacity of the AWGN channel (40), i.e., the integrand in (43), by repeating the same argument. Similarly, it\nis straightforward to find that (68) is equal to (47). Combining these results and the argument described in\nAppendix A-A, we find that Proposition 1 holds.\nR EFERENCES\n[1] G. J. Foschini and M. J. Gans, \"On limits of wireless communications in a fading environment when using multiple antennas,\" Wireless\nPers. Commun., vol. 6, pp. 311–335, 1998.\n[2] E. Telatar, \"Capacity of multi-antenna Gaussian channels,\" Euro. Trans. Telecommun., vol. 10, no. 6, pp. 585–595, Nov.–Dec. 1999.\n[3] A. M. Tulino, A. Lozano, and S. Verdú, \"Impact of antenna correlation on the capacity of multiantenna channels,\" IEEE Trans. Inf. Theory,\nvol. 51, no. 7, pp. 2491–2509, Jul. 2005.\n[4] T. L. Marzetta and B. M. Hochwald, \"Capacity of a mobile multiple-antenna communication link in Rayleigh flat fading,\" IEEE Trans.\nInf. Theory, vol. 45, no. 1, pp. 139–157, Jan. 1999.\n[5] A. Lapidoth and S. M. Moser, \"Capacity bounds via duality with applications to multiple-antenna systems on flat-fading channels,\" IEEE\nTrans. Inf. Theory, vol. 49, no. 10, pp. 2426–2467, Oct. 2003.\n[6] S. M. Moser, \"The fading number of multiple-input multiple-output fading channels with memory,\" IEEE Trans. Inf. Theory, vol. 55, no. 6,\npp. 2716–2755, Jun. 2009.\n[7] B. M. Hochwald and T. L. Marzetta, \"Unitary space-time modulation for multiple-antenna communications in rayleigh flat fading,\" IEEE\nTrans. Inf. Theory, vol. 46, no. 2, pp. 543–564, Mar. 2000.\n[8] B. Hassibi and T. L. Marzetta, \"Multiple-antennas and isotropically random unitary inputs: The received signal density in closed form,\"\nIEEE Trans. Inf. Theory, vol. 48, no. 6, pp. 1473–1484, Jun. 2002.\n[9] A. L. Moustakas, S. H. Simon, and T. L. Marzetta, \"Capacity of differential versus nondifferential unitary space-time modulation for\nMIMO channels,\" IEEE Trans. Inf. Theory, vol. 52, no. 8, pp. 3622–3634, Aug. 2006.\n[10] L. Zheng and D. N. C. Tse, \"Communication on the Grassmann manifold: A geometric approach to the noncoherent multiple-antenna\nchannel,\" IEEE Trans. Inf. Theory, vol. 48, no. 2, pp. 359–383, Feb. 2002.\n[11] W. Yang, G. Durisi, and E. Riegler, \"On the capacity of large-MIMO block-fading channels,\" IEEE J. Sel. Areas Commun., vol. 31, no. 2,\npp. 117–132, Feb. 2013.\n[12] S. Verdú, \"Spectral efficiency in the wideband regime,\" IEEE Trans. Inf. Theory, vol. 48, no. 6, pp. 1319–1343, Jun. 2002.\n[13] L. Zheng, D. N. C. Tse, and M. Médard, \"Channel coherence in the low-SNR regime,\" IEEE Trans. Inf. Theory, vol. 53, no. 3, pp.\n976–997, Mar. 2007.\n[14] S. Ray, M. Médard, and L. Zheng, \"On noncoherent MIMO channels in the wideband regime: Capacity and reliability,\" IEEE Trans. Inf.\nTheory, vol. 53, no. 6, pp. 1983–2009, Jun. 2007.\n[15] B. Hassibi and B. M. Hochwald, \"How much training is needed in multiple-antenna wireless link?\" IEEE Trans. Inf. Theory, vol. 49,\nno. 4, pp. 951–963, Apr. 2003.\n[16] M. Médard, \"The effect upon channel capacity in wireless communications of perfect and imperfect knowledge of the channel,\" IEEE\nTrans. Inf. Theory, vol. 46, no. 3, pp. 933–946, May 2000.\n[17] K. Takeuchi, M. Vehkaperä, T. Tanaka, and R. R. Müller, \"Large-system analysis of joint channel and data estimation for MIMO DS-CDMA\nsystems,\" IEEE Trans. Inf. Theory, vol. 58, no. 3, pp. 1385–1412, Mar. 2012.\n\nOctober 25, 2018\n\nDRAFT\n\n\fIEEE TRANSACTIONS ON INFORMATION THEORY, VOL. , NO. , 2011\n\n46\n\n[18] T. Li and O. M. Collins, \"A successive decoding strategy for channels with memory,\" IEEE Trans. Inf. Theory, vol. 53, no. 2, pp. 628–646,\nFeb. 2007.\n[19] K. Padmanabhan, S. Venkatraman, and O. M. Collins, \"Tight upper and lower bounds on the constrained capacity of non-coherent multiantenna channels,\" in Proc. 2008 IEEE Int. Symp. Inf. Theory, Toronto, Canada, Jul. 2008, pp. 2588–2592.\n[20] K. Takeuchi, R. R. Müller, M. Vehkaperä, and T. Tanaka, \"Practical signaling with vanishing pilot-energy for large noncoherent block-fading\nMIMO channels,\" in Proc. 2009 IEEE Int. Symp. Inf. Theory, Seoul, Korea, Jun. 2009, pp. 759–763.\n[21] K. Takeuchi, R. R. Müller, and M. Vehkaperä, \"Bias-based training for iterative channel estimation and data decoding in fast fading\nchannels,\" IEICE Trans. Commun., vol. E94-B, no. 7, pp. 2161–2165, Jul. 2011.\n[22] --, \"A construction of turbo-like codes for iterative channel estimation based on probabilistic bias,\" in Proc. IEEE Global Commun.\nConf. (GLOBECOME 2011), Houston, Texas, USA, Dec. 2011.\n[23] --, \"Iterative LMMSE channel estimation and decoding based on probabilistic bias,\" submitted to IEEE Trans. Commun., 2012.\n[24] D. N. C. Tse and S. V. Hanly, \"Linear multiuser receivers: effective interference, effective bandwidth and user capacity,\" IEEE Trans. Inf.\nTheory, vol. 45, no. 2, pp. 641–657, Mar. 1999.\n[25] S. Verdú and S. Shamai (Shitz), \"Spectral efficiency of CDMA with random spreading,\" IEEE Trans. Inf. Theory, vol. 45, no. 2, pp.\n622–640, Mar. 1999.\n[26] J. Evans and D. N. C. Tse, \"Large system performance of linear multiuser receivers in multipath fading channels,\" IEEE Trans. Inf. Theory,\nvol. 46, no. 6, pp. 2059–2078, Sep. 2000.\n[27] S. Shamai (Shitz) and S. Verdú, \"The impact of frequency-flat fading on the spectral efficiency of CDMA,\" IEEE Trans. Inf. Theory,\nvol. 47, no. 4, pp. 1302–1327, May 2001.\n[28] T. Tanaka, \"A statistical-mechanics approach to large-system analysis of CDMA multiuser detectors,\" IEEE Trans. Inf. Theory, vol. 48,\nno. 11, pp. 2888–2910, Nov. 2002.\n[29] A. L. Moustakas, S. H. Simon, and A. M. Sengupta, \"MIMO capacity through correlated channels in the presence of correlated interferers\nand noise: A (not so) large N analysis,\" IEEE Trans. Inf. Theory, vol. 49, no. 10, pp. 2545–2561, Oct. 2003.\n[30] R. R. Müller and W. H. Gerstacker, \"On the capacity loss due to separation of detection and decoding,\" IEEE Trans. Inf. Theory, vol. 50,\nno. 8, pp. 1769–1778, Aug. 2004.\n[31] D. Guo and S. Verdú, \"Randomly spread CDMA: Asymptotics via statistical physics,\" IEEE Trans. Inf. Theory, vol. 51, no. 6, pp.\n1983–2010, Jun. 2005.\n[32] K. Takeda, S. Uda, and Y. Kabashima, \"Analysis of CDMA systems that are characterized by eigenvalue spectrum,\" Europhys. Lett.,\nvol. 76, no. 6, pp. 1193–1199, 2006.\n[33] C. K. Wen and K. K. Wong, \"Asymptotic analysis of spatially correlated MIMO multiple-access channels with arbitrary signaling inputs\nfor joint and separate decoding,\" IEEE Trans. Inf. Theory, vol. 53, no. 1, pp. 252–268, Jan. 2007.\n[34] K. Takeuchi, T. Tanaka, and T. Yano, \"Asymptotic analysis of general multiuser detectors in MIMO DS-CDMA channels,\" IEEE J. Sel.\nAreas Commun., vol. 26, no. 3, pp. 486–496, Apr. 2008.\n[35] D. Sherrington and S. Kirkpatrick, \"Solvable model of a spin-glass,\" Phys. Rev. Lett., vol. 35, no. 26, pp. 1792–1796, Dec. 1975.\n[36] H. Nishimori, Statistical Physics of Spin Glasses and Information Processing.\n[37] Mézard, G. Parisi, and M. A. Virasoro, Spin Glass Theory and Beyond.\n[38] K. H. Fischer and J. A. Hertz, Spin Glasses.\n\nNew York: Oxford University Press, 2001.\n\nSingapore: World Scientific, 1987.\n\nCambridge, UK: Cambridge University Press, 1991.\n\n[39] F. Guerra, \"Broken replica symmetry bounds in the mean field spin glass model,\" Commun. Math. Phys., vol. 233, pp. 1–12, 2003.\n[40] M. Talagrand, \"The Parisi formula,\" Annals of Mathematics, vol. 163, pp. 221–263, 2006.\n[41] F. D. Neeser and J. L. Massey, \"Proper complex random processes with applications to information theory,\" IEEE Trans. Inf. Theory,\nvol. 39, no. 4, pp. 1293–1302, Jul. 1993.\n[42] G. D. Forney, Jr., \"Trellis shaping,\" IEEE Trans. Inf. Theory, vol. 38, no. 2, pp. 281–300, Mar. 1992.\n[43] K. Takeuchi, R. R. Müller, M. Vehkaperä, and T. Tanaka, \"An achievable rate of large block-fading MIMO systems with no CSI via\nsuccessive decoding,\" in Proc. 2010 Int. Symp. Inf. Theory and its Appl & Int. Symp. Spread Spectrum Tech. and Appl., Taichung, Taiwan,\nOct. 2010, pp. 519–524.\n[44] T. M. Cover and J. A. Thomas, Elements of Information Theory, 2nd ed. New Jersey: Wiley, 2006.\n[45] M. Ledoux, The Concentration of Measure Phenomenon.\n\nOctober 25, 2018\n\nProvidence, RI: American Mathmatical Society, 2001.\n\nDRAFT\n\n\fIEEE TRANSACTIONS ON INFORMATION THEORY, VOL. , NO. , 2011\n\n47\n\n[46] F. Guerra and F. L. Toninelli, \"The thermodynamic limit in mean field spin glass models,\" Commun. Math. Phys., vol. 230, pp. 71–79,\n2002.\n[47] --, \"The infinite volume limit in generalized mean field disordered models,\" Markov. Proc. Rel. Fields, vol. 9, pp. 195–207, 2003.\n[48] L. Cottatellucci and R. R. Müller, \"A systematic approach to multistage detectors in multipath fading channels,\" IEEE Trans. Inf. Theory,\nvol. 51, no. 9, pp. 3146–3158, Sep. 2005.\n[49] H. Nishimori, \"Comment on \"statistical mechanics of CDMA multiuser demodulation\" by Tanaka,\" Europhys. Lett., vol. 57, no. 2, pp.\n302–303, Jan. 2002.\n[50] S. Verdú, Multiuser Detection.\n\nNew York: Cambridge University Press, 1998.\n\n[51] S. B. Korada and A. Montanari, \"Applications of the Lindeberg principle in communicaitons and statistical learning,\" IEEE Trans. Inf.\nTheory, vol. 57, no. 4, pp. 2440–2450, Apr. 2011.\n[52] L. A. Pastur and M. V. Shcherbina, \"Absence of self-averaging of the order parameter in the Sherrington-Kirkpatrick model,\" J. Stat. Phys.,\nvol. 62, no. 1/2, pp. 1–19, 1991.\n[53] D. N. C. Tse and P. Viswanath, Fundamentals of Wireless Communication.\n\nCambridge, UK: Cambridge University Press, 2005.\n\n[54] M. Vehkaperä, K. Takeuchi, R. R. Müller, and T. Tanaka, \"How much training is needed for iterative multiuser detection and decoding?\"\nin Proc. IEEE Global Communications Conference (GLOBECOM 2009), Honolulu, USA, Nov. 2009.\n[55] K. Kitagawa and T. Tanaka, \"Optimization of sequences in CDMA systems: A statistical-mechanics approach,\" Computer Networks, vol. 54,\npp. 917–924, 2010.\n[56] M. C. Gursoy, \"On the capacity and energy efficiency of training-based transmissions over fading channels,\" IEEE Trans. Inf. Theory,\nvol. 55, no. 10, pp. 4543–4567, Oct. 2009.\n[57] K. Nakamura and T. Tanaka, \"Microscopic analysis for decoupling principle of linear vector channel,\" in Proc. 2008 IEEE Int. Symp. Inf.\nTheory, Toronto, Canada, Jul. 2008, pp. 519–523.\n\nOctober 25, 2018\n\nDRAFT\n\n\f"}