{"id": "http://arxiv.org/abs/0706.2411v1", "guidislink": true, "updated": "2007-06-18T16:56:08Z", "updated_parsed": [2007, 6, 18, 16, 56, 8, 0, 169, 0], "published": "2007-06-18T16:56:08Z", "published_parsed": [2007, 6, 18, 16, 56, 8, 0, 169, 0], "title": "Violation of the London Law and Onsager-Feynman quantization in\n  multicomponent superconductors", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0706.2181%2C0706.3831%2C0706.4236%2C0706.3209%2C0706.0980%2C0706.3312%2C0706.2647%2C0706.3704%2C0706.1487%2C0706.4166%2C0706.2175%2C0706.2302%2C0706.2915%2C0706.1196%2C0706.3280%2C0706.4171%2C0706.0301%2C0706.1554%2C0706.3516%2C0706.1731%2C0706.2454%2C0706.1254%2C0706.3120%2C0706.1605%2C0706.3625%2C0706.0026%2C0706.0015%2C0706.2942%2C0706.4153%2C0706.0468%2C0706.4225%2C0706.4237%2C0706.3774%2C0706.1122%2C0706.0053%2C0706.0557%2C0706.0910%2C0706.3664%2C0706.0551%2C0706.2735%2C0706.3906%2C0706.2608%2C0706.1141%2C0706.2274%2C0706.3832%2C0706.0751%2C0706.1934%2C0706.3890%2C0706.1640%2C0706.3231%2C0706.0667%2C0706.3574%2C0706.2566%2C0706.3270%2C0706.0188%2C0706.1328%2C0706.3529%2C0706.2827%2C0706.2009%2C0706.1939%2C0706.3409%2C0706.4469%2C0706.1885%2C0706.2388%2C0706.1058%2C0706.3266%2C0706.1115%2C0706.2743%2C0706.1082%2C0706.4136%2C0706.4250%2C0706.2349%2C0706.1748%2C0706.0709%2C0706.0610%2C0706.3727%2C0706.3394%2C0706.0628%2C0706.2452%2C0706.2666%2C0706.0347%2C0706.0239%2C0706.2450%2C0706.3132%2C0706.2947%2C0706.2028%2C0706.1674%2C0706.2486%2C0706.2157%2C0706.2719%2C0706.2411%2C0706.1443%2C0706.3257%2C0706.0408%2C0706.4371%2C0706.3307%2C0706.1157%2C0706.3228%2C0706.3385%2C0706.0086%2C0706.0212&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Violation of the London Law and Onsager-Feynman quantization in\n  multicomponent superconductors"}, "summary": "Non-classical response to rotation is a hallmark of quantum ordered states\nsuch as superconductors and superfluids. The rotational responses of all\ncurrently known single-component \"super\" states of matter (superconductors,\nsuperfluids and supersolids) are largely described by two fundamental\nprinciples and fall into two categories according to whether the systems are\ncomposed of charged or neutral particles: the London law relating the angular\nvelocity to a subsequently established magnetic field and the Onsager-Feynman\nquantization of superfluid velocity. These laws are theoretically shown to be\nviolated in a two-component superconductor such as the projected liquid\nmetallic states of hydrogen and deuterium at high pressures. The rotational\nresponses of liquid metallic hydrogen or deuterium identify them as a new class\nof dissipationless states; they also directly point to a particular\nexperimental route for verification of their existence.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0706.2181%2C0706.3831%2C0706.4236%2C0706.3209%2C0706.0980%2C0706.3312%2C0706.2647%2C0706.3704%2C0706.1487%2C0706.4166%2C0706.2175%2C0706.2302%2C0706.2915%2C0706.1196%2C0706.3280%2C0706.4171%2C0706.0301%2C0706.1554%2C0706.3516%2C0706.1731%2C0706.2454%2C0706.1254%2C0706.3120%2C0706.1605%2C0706.3625%2C0706.0026%2C0706.0015%2C0706.2942%2C0706.4153%2C0706.0468%2C0706.4225%2C0706.4237%2C0706.3774%2C0706.1122%2C0706.0053%2C0706.0557%2C0706.0910%2C0706.3664%2C0706.0551%2C0706.2735%2C0706.3906%2C0706.2608%2C0706.1141%2C0706.2274%2C0706.3832%2C0706.0751%2C0706.1934%2C0706.3890%2C0706.1640%2C0706.3231%2C0706.0667%2C0706.3574%2C0706.2566%2C0706.3270%2C0706.0188%2C0706.1328%2C0706.3529%2C0706.2827%2C0706.2009%2C0706.1939%2C0706.3409%2C0706.4469%2C0706.1885%2C0706.2388%2C0706.1058%2C0706.3266%2C0706.1115%2C0706.2743%2C0706.1082%2C0706.4136%2C0706.4250%2C0706.2349%2C0706.1748%2C0706.0709%2C0706.0610%2C0706.3727%2C0706.3394%2C0706.0628%2C0706.2452%2C0706.2666%2C0706.0347%2C0706.0239%2C0706.2450%2C0706.3132%2C0706.2947%2C0706.2028%2C0706.1674%2C0706.2486%2C0706.2157%2C0706.2719%2C0706.2411%2C0706.1443%2C0706.3257%2C0706.0408%2C0706.4371%2C0706.3307%2C0706.1157%2C0706.3228%2C0706.3385%2C0706.0086%2C0706.0212&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Non-classical response to rotation is a hallmark of quantum ordered states\nsuch as superconductors and superfluids. The rotational responses of all\ncurrently known single-component \"super\" states of matter (superconductors,\nsuperfluids and supersolids) are largely described by two fundamental\nprinciples and fall into two categories according to whether the systems are\ncomposed of charged or neutral particles: the London law relating the angular\nvelocity to a subsequently established magnetic field and the Onsager-Feynman\nquantization of superfluid velocity. These laws are theoretically shown to be\nviolated in a two-component superconductor such as the projected liquid\nmetallic states of hydrogen and deuterium at high pressures. The rotational\nresponses of liquid metallic hydrogen or deuterium identify them as a new class\nof dissipationless states; they also directly point to a particular\nexperimental route for verification of their existence."}, "authors": ["Egor Babaev", "N. W. Ashcroft"], "author_detail": {"name": "N. W. Ashcroft"}, "author": "N. W. Ashcroft", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1038/nphys646", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/0706.2411v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0706.2411v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "Nature Physics in print. This is an early version of the paper. The\n  final version will be posted 6 months after its publication Nature Physics,\n  according to the journal policy", "arxiv_primary_category": {"term": "cond-mat.supr-con", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cond-mat.supr-con", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "hep-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0706.2411v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0706.2411v1", "journal_reference": "Nature Physics 3, 530 - 533 (2007)", "doi": "10.1038/nphys646", "fulltext": "Violation of the London Law and Onsager-Feynman quantization in multicomponent\nsuperconductors\nEgor Babaev1,2 and N. W. Ashcroft1\n\narXiv:0706.2411v1 [cond-mat.supr-con] 18 Jun 2007\n\n1\n\nLaboratory of Atomic and Solid State Physics, Cornell University, Ithaca, NY 14853 USA\n2\nDepartment of Physics, The Royal Institute of Technology 10691 Stockholm, Sweden\n\nTwo quite fundamental principles governing the\nresponse to rotation of single-component superfluids and superconductors, the London law [1]\nrelating the angular velocity to a subsequently\nestablished magnetic field, and the OnsagerFeynman quantization of superfluid velocity [2, 3]\nare shown to be violated in a two-component\nsuperconductor. The manifestation of the two\nprinciples normally involves the fundamental constants alone, but this no longer holds as is demonstrated explicitly for the projected liquid metallic\nstates of hydrogen and deuterium at high pressures. The rotational responses of liquid metallic\nhydrogen or deuterium identify them as a new\nclass of dissipationless states; they also directly\npoint to a particular experimental route for verification of their existence.\nNon-classical response to rotation is a hallmark of\nquantum ordered states such as superconductors and superfluids. The rotational responses of all presently known\nsingle-component \"super\" states of matter (superconductors, superfluids and supersolids) are largely described\nby two fundamental principles and fall into two categories according to whether the systems are composed\nof neutral or charged particles. For superfluid systems\ncomposed of electrically neutral particles (liquids, vapors, or even solids [4]) and for slow rotations, a fraction of the system, the superfluid fraction, remains irrotational. However in response to rotation exceeding\na certain critical rotation frequency, the superfluid fraction comes into rotation by means of vortex formation.\nOnsager and Feynman [2, 3] pointed out that the superfluid velocity (v) in these vortices in single-component\nsystems is quantized and the circulation quantum K depends only on particle's\nmass m and Planck's constant\nH\nh̄: K = (1/2π) v * dl = h̄/m. Here we mention that\nfor superfluids with e.g. p- wave symmetry of the order\nparameter which are also invariant under simultaneous\nphase and spin transformations this quantization is modified [5]. We also mention that a special situation occur in\na multicomponent superfluid with a dissipationless drag\n(Andreev-Bashkin effect) where a superfluid velocity of\none condensate can carry superfluid density of another\n[6, 7]. Below however we will consider the mixture of\ncharged condensates only with the simplest symmetry of\nthe order parameter coupled by a gauge field.\nFor systems composed of charged particles and which\nare also superconducting (electronic Cooper pairs in met-\n\nals, or protonic Cooper pairs in neutron stars) vortices\nare not induced by rotation; however, the rotational response of these systems is no less interesting. London\nshowed that a uniformly rotating single component superconductor generates a persistent current in a thin\nlayer near its surface, and this in turn produces a detectable magnetic field, the London field [1]. London\nrelated this field to the rotation frequency, Ω, according\nto B = −(2mc/e)Ω, where m is the electron's mass, e\ndenotes it electric charge and c is the speed of light. This\nlaw is experimentally confirmed (see e.g. [8] and references therein). Of crucial significance is the fact that the\nexperimentally observed London Law involves only the\nexact values of the fundamental constants, and not on\nmaterials properties specific to the superconductor (such\nas an effective mass for electrons). This law also holds\nfor electronic superconductors with d- and p-wave pairing\nsymmetry.\nWe here consider the responses to rotation of the projected novel quantum states of metallic hydrogen and\nmetallic deuterium, two-component systems exhibiting\noff-diagonal long-range order. These are now the subjects of renewed experimental pursuit especially because\nof the recent breakthrough in artificial diamond technology. The expectation of achieving static pressures in diamond anvil cells perhaps exceeding the expected metallization pressure of hydrogen at low temperatures has\nnow been raised. Liquid metallic states of hydrogen were\npredicted earlier to exhibit Cooper pairing both in protonic and electronic channels [9]; however it should be\nnoted that an even simpler situation may occur in liquid metallic deuterium because deuterons are bosons and\ncan undergo condensation without the need for a pairing\ninstability. Another possible system where such states\nmay be realized is a hydrogen-rich alloy where under extreme but experimentally accessible pressures both electrons and protons may be mobile in a crystalline lattice\n[10]. Finally a rotational response similar to that discussed below would be present in solid metallic hydrogen\nor deuterium if it exhibits a metallic equivalent of supersolidity. For brevity below we shall always refer to \"liquid\nmetallic hydrogen (LMH)\" but it is important to keep in\nmind that the range of potential applications is much\nwider, including recent discussions of possible presence\nof several charged barionic condensates in neutron stars\n[11]. The main motivation of our study is to identify an\neffect which can provide a possible experimental probe\nfor the renewed experimental search for superconducting\n\n\f2\nliquid metallic hydrogen.\nIt has been observed that because in these systems the\ncharged condensates are replicated twice (e.g. coexistent\nelectronic and protonic, or deuteronic, condensates) composite neutral superfluid modes exist [12, 13]. These cannot be classified as superconductors in the usual sense;\nwe will see below that also the superfluid mode is quite\ndifferent from superfluid modes in one-component neutral systems. Previous studies of this state have, however, mostly focused on the reaction of the system to\nan applied magnetic field [12, 14, 15]; here our intention\nis to study the reaction of the system to rotation. The\ncomposite superfluid and superconducting modes in this\nsystem are inextricably intertwined and as we find below\nthis has unusual manifestations in rotational response,\nwhich extend our general understanding of quantum ordered fluids.\nThe general route to describe a two component superconductor is the London (or hydrodynamic) approach.\nThe sysem in this approach is described by the following\nfree energy:\nF =\n\n(∇ × A)2\n1\n|Ψα |2 (∇θα ± eA)2 +\n.\n2mα\n2\nα=e,p\nX\n\nHere, Ψα and mα , (α = e, p) denote electronic and\nprotonic condensate wave functions and corresponding\nmasses and A is the vector potential. In what follows\ne stands for an electric charge of a Cooper pair and we\nset h̄ = 1, c = 1. In this work we focus on the effects\ncaused by the coupling to the gauge field and thus we do\nnot consider possible drag effects [6]. Nor do we consider\ndifferent pairing symmetries.\nThis model can be rewritten as [12]\n2\n\nWe first focus on a (0,1) vortex. For this case, the\nsolution for vector potential A at distances from the\ncore much larger than penetration length is given by\nh\ni−1\n2\n|Ψp |2\n|Ψe |2\n1 |Ψp |\n, where r is the dis+\n[12] |A| = |e|r\nmp\nmp\nme\ntance from the core center. The superfluid velocities of\nelectrons and protons in such a vortex at a large distance from the core are vp = (∇θp + eA)/mp ; and ve =\n−eA/me . An equilibrium of a rotating system is achieved\nwhen the quantity Er = E − M * Ω is minimal (Ω is the\nrotation frequency and M and E are the angular momentum and energy). Observe that if a system nucleates a vortex (1,0) then not only protons but also electrons contribute to the angular momentum\nR whose magnitude is given by: |M| = |Mp + Me | = (mp |Ψp |2 vp +\nme |Ψe |2 ve )rdV\nThe superfluid velocity circulations forH protons and\nelectrons in a vortex (0, 1) are given by: v(e,p) * dl =\ni−1\nh\n|Ψ\n|2 |Ψp |2\n|Ψe |2\n1\n2πK(e,p) = 2π m(p,e)\n+\nm\nm\nm(e,p) . From this\np\ne\n(p,e)\nwe observe that in the two-component superconductor\nthe Onsager-Feynman quantization rule is violated: the\nsuperfluid velocity quantization is fractional and the electronic and protonic circulation quanta Ke,p depend not\nonly on mass but also on densities according to:\n\nKe =\n\n2\n\n|Ψe | |Ψp |\n\u0001\u00012\n1 me mp\nF = |Ψ |2\n+\n∇ θe + θp\n2 e + |Ψp |2\nme\nmp\n\u0010 |Ψ |2\nh |Ψ |2\n|Ψp |2\ne\ne\n∇θe −\n∇θp − eA\nme\nmp\nme\n\nto electronic and protonic condensates, both the (1, 0)\nvortex and (0, 1) vortex have identical configurations of\nthe neutral composite (i.e. consisting of both electrons\nand protons) superflow. The difference between these\ntwo vortices lies only in the contribution to the second\nterm in (1) representing the charged (superconducting)\nsector of the model.\n\n1\n2\n\n1\n\n|Ψp |2\nmp\n|Ψp |2\n|Ψe |2\nmp + me\n\n1\n; Kp =\nme\n\n|Ψe |2\nme\n|Ψp |2\n|Ψp |2\nmp + me\n\n1\n.\nmp\n\n(2)\n\n×\n|Ψ |2\n+ mpp\nThe quantization conditions (2) holds also for the vor|Ψp |2 i\u00112 B2\ntex (1, 0) It has been argued previously that quanti+\n(. 1)\n+\nmp\n2\nzation of magnetic flux in LMH is also fractional [12].\nThe fractionalization of superfluid velocity quantization\nThe first term here displays no coupling to the gauge field\nwhich we find here has, however, a different pattern. To\nand therefore represents a neutral or superfluid mode\ncompare the fractionalization of magnetic flux quantum\nwhich is associated with co-directed flows of electronic\nΦ0 = 2π/e and the fractionalization of superflow quantiand protonic Cooper pairs (with no net charge transfer)\nzation we introduce an angle β as a measure of the ratio\n\u0001 of\n[12]. The second term accounts for the superconductthe average consensates densities, as follows: sin2 β2 =\n\u0001 |Ψ |2 \u0002 |Ψ |2\n2 \u0003−1\ning (or charged) sector of the model describing electrical\n|Ψe |2 \u0002 |Ψp |2\n|Ψe |2 \u0003−1\n; cos2 β2 = mpp mpp + |Ψmee|\n.\nme\nmp + me\ncurrents. In what follows, we denote a vortex with phase\n0\nLet\nK\n=\n1/m\nbe\nthe\nstandard\nsuperflow\ncircu(e,p)\nwindings (∆θe = 2πne , ∆θp = 2πnp ) as (ne , np ).\n(e,p)\nlation quantum in a one component neutral superfluid\nLet us begin with inspection of the composite neutral\ncomposite of particles with the masses of electronic and\nmode's response to rotation. The simplest topological\nprotonic Cooper pairs correspondingly. The quantization\nexcitation in the superfluid sector of the model [i.e. a\nfractionalization pattern in this notation is then summasimplest vortex which has a nontrivial winding in the\nrized in the Table 1.\nphase sum (θe + θp )] is a vortex with the windings of\nonly of one of the phases: (±1, 0) or (0, ±1). We note\nThe energy per unit length E of vortices (1, 0) and (0, 1)\nthat since the first term in (1) is symmetric with respect\ncontains a logarithmically divergent part arising from the\n|Ψe |2\nme\n\n\f3\nTABLE I: Fractionalization of superflow circulation and magnetic flux quanta.\nvortex:\n(1, 0)\n(0, 1)\nmagnetic flux sin2 (β/2)Φ0 − cos2 (β/2)Φ0\nelectronic superflow circulation cos2 (β/2)Ke0 cos2 (β/2)Ke0\nprotonic superflow circulation sin2 (β/2)Kp0 sin2 (β/2)Kp0\n\nfirst term in (1) [12, 13]:\n\u0012 \u0013\n\u0015\n\u0012 \u0013\n\u0014\nR\nβ |Ψe |2\nβ |Ψp |2\nlog ,\n+ cos4\nE ≈ π sin4\n2\nmp\n2\nme\na\nwhere a is a cut-off length which depends on the core\nstructure and R is the distance from the vortex center\nto the system boundary. The formation of vortices in\nresponse to rotation is controlled by the neutral mode\n[i.e. by the first term in (1)]. As discussed above, the\nvortices (1, 0) and (0, 1) have the same neutral superflow\nbut different contributions to the second term in (1). The\nenergetically preferred excitations forming in response to\nrotation are therefore the (0, 1) vortices which carry a\nsmaller fraction of Φ0 . We remark that composite vortices of the type (±1, ∓1) do not contribute to superfluid\nsector of the model and are irrelevant in this rotational\nphysics. On the other hand it is straightforward to show\nthat the vortices (±1, ±1) are unstable.\nIf a vortex (0, 1) is now placed into a cylindrical system with radius R and unit height\nthe system acquires an angular momentum:\nh\ni−1\n2\n|Ψ |2 |Ψp |2\n|Ψe |2\n(me + mp ) .\n|M|\n=\nπR2 |Ψmee| mpp\nmp + me\nVortices form when Er = E − M * Ω < 0. This\ndetermines the critical rotation frequency as\nΩc ≈\n\nR2 (m\n\n1\nR\nlog\na\ne + mp )\n\nA quite deep difference in the rotational physics in two\ncomponent charged systems is manifested especially in\nthe novel \"aggregate states\" of vortex matter they should\nallow. As discussed above, in the simplest case the rotating system forms a lattice of vortices (0, 1) (see Fig. 1A).\nIn this respect the main difference between this system\nand an ordinary superfluid is that the rotation-induced\nvortices are also carrying magnetic flux Φ = cos2 (β/2)Φ0 .\nThe most interesting situation arises when a rotating system is also subjected to a magnetic field. In this case the\npossible states of vortex matter are numerous and we will\nconsider here some particularly interesting possibilities of\nnovel states of \"vortex matter\".\nIf a weak magnetic field is applied in a direction opposite to the field of rotation-induced vortices the superconducting sector of (1) would try to minimize its energy\nby introducing (1, −1) vortices. These vortices have no\nneutral superflow (electronic and protonic currents are\ncounter-directed) but carry one magnetic flux quantum\n[12]. However a vortex (1, −1) is not stable in a lattice\nof (0, 1) vortices because it experiences an attraction to\nsuch vortices within the range of the penetration length\nscale [13]. A vortex (1, −1) therefore should annihilate\nwith a (0, 1) vortex, resulting in a (1, 0) vortex state. At\nlength scales larger than the penetration length a vortex\n(1, 0) has a Coulomb repulsive interaction with a vortex\n(0, 1) similar to interaction between two (0, 1) vortices\n[13] and therefore under normal conditions will occupy\na space in a rotation-induced lattice of (0, 1) vortices;\nit can therefore be viewed as a ground state \"electronic\nvortex-impurity\" in a \"protonic vortex lattice\" (see Fig.\n1B). The concentration of these \"vortex-impurities\" depends on the applied magnetic field and there are indeed many interesting possibilities for their orderings and\nphase transitions.\n\n(3)\n\nWe can make a rough estimate of critical frequency:\nΩc ≈ (me /mp )(e2 /a0 )(a0 /R)2 log(R/a), where a0 is the\nBohr radius, which for a 100μ sample is of order of 10Hz.\nThough we deal with a composite superfluid mode and\nfractional circulation quantization, the critical frequency\nis approximately the same as it would be in liquid of\nCooper pairs of neutral particles with a mass of the proton. However the underlying physics is indeed quite different. One circumstance is that besides fractional quantization of circulation, only a small fraction of the condensates participates in the superfluid mode (its stiffness\nh\ni−1\n2\n|Ψ |2 |Ψp |2\n|Ψe |2\n). Another difference can\nis |Ψmee| mpp\nmp + me\nbe seen by considering a similar system but composed\nof two types of particles with equal masses and charge.\nThis also features a superfluid mode but no vortices can\nbe induced by rotation (this also applies to electronic superconductors where multicomponent order parameters\narises from non s-wave pairing symmetry).\n\nConsider next a situation with a stronger magnetic\nfield and with a rotation frequency just above Ωc . Then\nthe dominant structure is a field-induced lattice of composite vortices (1, −1) (as in the case of no rotation\n[12, 14, 15]). Here the energetically most favorable way to\nintroduce a superfluid momentum-carrying vortex is the\nsubstitution of one of the (1, −1) vortices by a (1, 0) vortex (see Fig. 1C). This vortex interacts repulsively with\nits neighbors, carries almost one magnetic flux quantum,\nbut also posseses angular momentum in the superfluid\nsector. This vortex is therefore an \"elementary vorteximpurity\" in a lattice of composite vortices. Such a system should exhibit a number of novel phase transitions\nand vortex matter states. One such transition will occur\nbecause there is a finite potential barrier for a \"vortex impurity\" to jump from one lattice site to another. At certain temperatures the vortex impurities should be able to\nmove from one site to another freely. There is an analogy\nbetween \"light\" vortices, which in the ground state are\n\n\f4\n\nFIG. 1: A: A rotating two-component superconductor forms\na lattice of \"protonic\" vortices (0, 1) (red small tubes). The\narrow denotes the direction of the self-induced magnetic field;\nB: When an external field is applied in the direction opposite\nto the field carried by rotation-induced vortices, the ground\nstate posseses \"electonic vortices\" (1, 0) (blue tubes) placed as\n\"impurities\" in protonic vortex lattice; C, D: In a strong magnetic field, and for rotations just above the critical frequency,\nthe ground state features either \"electronic vortex impurities\"\nin the lattice of composite vortices or \"interstitial\" protonic\nvortices, depending on the applied field direction.\n\nco-centered with \"heavy\" vortices and a system of Bose\nparticles living on sites of a triangular lattice which is\nknown to possess a supersolid state (see for example [16]).\nIn this analogy the z-direction in the vortex lattices plays\nthe role of \"time\" in the Bose system and the\"heavy\" vortices play the role of a robust \"lattice potential\". There\narises therefore the possibility of an interesting \"aggregate state of vortex matter\", analogous to the supersolid\nstate of Bose particles which in our case may be called\na \"vortex supersolid\". This state should feature coexistence of crystalline order of vortices and \"fluidity\" of\n\"vortex impurities\". Because of the fluid state of light\nvortices the phase of the corresponding condensate will\nbe disordered in the z-direction which in turn should destroy the order in gauge-invariant phase sum. For this\nreason the transition into this \"vortex supersolid\" phase\nhas an important physical consequence, namely, the disappearance of superfluidity of particles along the rotation\naxis, which constitututes the phase transition from superconducting superfluidity to superconductivity selectively\nalong this direction.\nIn the case where the rotation direction is inverted,\nwhile the magnetic field unchanged, the topological defects in the superfluid sector which minimize energy in a\nrotating frame are (−1, 0) and (0, −1). The former vortex\nsubtracts almost one magnetic flux quantum and should\nbe compensated by two (1, −1) vortices. In this scenario\n\na lattice should becomes more dense (with a certain energy penalty). On the other hand there is a second possibility to acquire angular momentum: the introduction\nof a (0, −1) vortex. This results in a different type of the\nenergy penalty: a vortex (0, −1) interacts via a screened\npotential with a composite vortex (1, −1) but the interaction strength is much weaker than between two composite\nvortices [13]. Therefore such a vortex can be introduced\nas an \"interstitial vortex defect\" (see Fig 1D) which, for a\nrange of parameters, should be a more energetically preferred way to acquire angular momentum than the first\npossibility. The \"light\" vortices may form an \"interstitial vortex liquid\" state, while the co-centricity of light\nvortices with the lattice of heavy vortices is controlled by\na different energy scale. This is again a state with coexistent vortex crystalline order and vortex defect fluidity\nand yet another example of a \"vortex supersolid\" which\nresembles the supersolid state of interstitial particles in\ncrystals discussed in [4].\nFinally, let us consider the reaction of the superconducting sector of the system to rotation. It is important to note that electronic and protonic Cooper pair\nmomenta depend on the same vector potential, Pα ≡\nmα\nα\n∇θα = mα vα + eα A and hence A = P\neα − eα vα (where\ne(e,p) = ±e). Consider now the situation without an applied external field and low rotation frequencies, so that\nthere are no vortices (i.e. Ω < Ωc ). Then taking the curl\nof the previous expression we arrive at the constraint dictated by gauge-invariance:\nmp\nme\n∇ × vp =\n∇ × ve .\nep\nee\n\n(4)\n\nLet us consider first the zero temperature case when there\nis no normal component. If the condensate charges entering the problem are opposite (as is indeed the case for\nLMH) this equation has a trivial solution: vp = ve = 0\ni.e. at T = 0 for Ω < Ωc the condensates remain irrotational. However in the presence of a normal component\nwith a net electric charge its rotation produces an electric current so the superconducting component necessarily has to respond (i.e. vp = ve = 0 can no longer be a\nstationary solution). From (4) it also follows that in contrast to London's picture for ordinary superconductors\n[1], superconducting electrons and protons will not follow the rotation of normal component because it would\nviolate constraint (4). This dictates a counter-intuitive\nsituation, namely that in response to slow rotation the\nsuperconducting electrons and protons can only move\nin opposite directions and at different speeds. Their superconducting velocities can be expressed in the following\nform: vα = γα Ω×r. To find γα we first observe that from\nthe stationarity requirement we can obtain an extra condition by equating the rotation-induced electric current of\nthe normal component (multiplied by -1) to the rotationinduced current response of superconducting sector subject to constraint (4): Js = (ep γp |Ψp |2 + ee γe |Ψe |2 )Ω × r.\n\n\f5\nFrom the overall electrical neutrality of the system it follows that the rotation-induced normal current is Jn =\n−(ep |Ψp |2 + ee |Ψe |2 )Ω × r. Hence we find\nvp =\n\n|Ψe |2 − |Ψp |2\n|Ψp |2 − |Ψe |2\nΩ × r.\nΩ × r; ve =\nmp\nme\n2\n2\n|Ψp |2\n|Ψe |2 + m\n|Ψp | + me |Ψe |\np\n\nTo sustain these counter currents a rotating two-gap superconductor should generate in its bulk a vector potential and hence rotation induces a magnetic field:\nBrot =\n\n2 |Ψp |2 − |Ψe |2\nΩ.\ne |Ψp |2 + |Ψe |2\nmp\n\n(5)\n\nme\n\nWhile in the bulk the superfluid electrons and protons have the velocities ve,p , the field Brot is generated by velocity variations in the layer near the system's edge with the thickness of the penetration length\nλ = (e2 [|Ψp |2 /mp + |Ψe |2 /me ])−1/2 .\nThis follows\nfrom the equation for magnetic field variation, namely:\n−λ2 ∇2 B(r) + B(r) = Brot . Eq. (5) demonstrates a\nremarkable circumstance: the London Law in the twocomponent superconductor is actually violated. The\nrotation-induced field is not a universal function of the\nfundamental constants irrespective of microscopic details.\nIndeed it aquires a dependence on densities. At temperatures just below superconducting transition for protons\na rotating sample of radius R generates a magnetic flux\nof order of R2 Ω flux quanta (R given in cm and Ω in s−1 )\nwhich could be detectable with modern SQUIDs even for\nsamples as small as 10μ rotating at 1Hz (we note that it\nis easier to achieve high pressures in small samples which\nmakes it a very convenient experimental probe). Going to\na larger sample or higher rotation frequency would even\nallow measurement of rathio of the condensates densities\nand their temperature dependences, as follows from (5).\nAnd, of course, its absence would even rule out protonic\nsuperconductivity or deuteronic condensation. It follows\nthat a direct experimental route exists for the verification\nof this possible new class of dissipationless states.\n\nThough this has been cast in terms of a possible failure of London's law (otherwise rigorously applicable up\nto relativistic corrections in electronic superconductors)\nthe major issue discussed here might well be viewed as a\npossible extension of the classifications of the rotational\nresponses of quantum fluids. Rotational response is a\nquintessentially state-defining property of quantum fluids, and the one we find in LMH (as summarized in Figure\n2) is seen to be quite complex, and it involves both coand counter-directed electrical currents, and in particular a current in the direction opposite to rotation. This\nsuggests a classification of the projected liquid state of\nmetallic hydrogen as a new quantum fluid, and one which\nmay be presenting considerable opportunity for new and\n\nFIG. 2: If a two-component superconductor is brought into\nrotation two types of particle flow are generated: for slow rotation the two components (here electrons and protons) start\ncirculating in opposite directions (schematically denoted by\nthick red and blue arrows) inducing a magnetic field B along\nthe rotation axis. At a faster rotation a second type of particle flow also appears in the form of quantum vortices. Here\nelectrons and protons flow in the same direction (thin dashed\nlines). As discussed in the text in this picture the basic laws\ngoverning rotational response of one-component quantum fluids: the Onsager-Feynman superflow circulation and the London law are violated.\n\nemerging physics. From an experimental point of view\nit now appears that the rotational response of muticomponent superconductors may well offer the most direct\nprobe, both qualitative and quantitative, of the corresponding quantum orderings of hydrogen and deuterium\nin experiments in diamond anvil cells. It may also be\nextendable to the ternary systems formed by addition\nof further multivalent ions to the proposed ground state\nmetallic fluids where under high pressure protonic diffusive states may yet persist in the presence of periodic\nordering of the ions.\nThis work was supported by the National Science Foundation under Grants DMR-0302347 and DMR-0601461.\nCorrespondence and requests for materials should be addressed to E.B.\n\n[1] London, F. Superfluids, Wiley, New York, (1950).\n[2] Onsager, L. Statistical hydrodynamics Nuovo Cimento,\nSuppl. 6, 279 (1949).\n[3] Feynman, R.P. in Progress in Low Temperature Physics,\nNorth-Holland, Amsterdam, (1955).\n[4] Andreev, A. F. and Lifshitz, I. M. Quantum theory of\ndefects in crystals. Sov. Phys. JETP 29, 1107-1113 (1969)\n[5] Volovik , G. The Universe in a Helium Droplet, Oxford\nUniversity Press, USA (2003)\n[6] Andreev, A. F. and Bashkin , E. P. Three-velocity hydrodynamics of superfluid solutions Sov. Phys. JETP 42\n164 (1975)\n[7] Alpar, M.A, Langer, S.A., Sauls, J.A. Rapid Postglitch\nSpin-up of the Superfluid Core in Pulsars Astr. J. 282,\n533 (1984).\n[8] Verheijen, A.A., van Ruitenbeek, J. M., de Bruyn\n\n\f6\n\n[9]\n[10]\n[11]\n\n[12]\n\nOuboter, A and de Jongh, L. J. Measurement of the London moment in two high-temperature superconductors\nNature 345, 418 (1990)\nAshcroft, N.W. Hydrogen at high density J. Phys. A:\nMath. Gen. 36, 6137 (2003).\nAshcroft, N.W. Hydrogen dominant metallic alloys: high\ntemperature superconductors? Phys. Rev. Lett. 92,\n187002 (2004)\nJones, P.B. Type I and Two-Gap Superconductivity in\nNeutron Star Magnetism Mon. Not. Roy. Astron. Soc.\n371 1327 (2006)\nBabaev, E. Vortices with fractional flux in two-gap superconductors and in extended Faddeev model. Phys. Rev.\nLett. 89, 067001 (2002)\n\n[13] Babaev, E. Phase diagram of planar U(1)xU(1) superconductors: condensation of vortices with fractional flux\nand a superfluid state Nucl.Phys. B 686 397 (2004).\n[14] Babaev, E. Sudbø, A. and Ashcroft, N.W. A superconductor to superfluid phase transition in liquid metallic\nhydrogen Nature, 431, 666 (2004);\n[15] Smørgrav, E. Babaev, E, Smiseth, J. and Sudbø, A. Observation of a metallic superfluid in a numerical experiment Phys. Rev. Lett. 95, 135301 (2005).\n[16] Wessel, S. Troyer, M. Supersolid Hard-Core Bosons\non the Triangular Lattice Phys. Rev. Lett. 95, 127205\n(2005);\n\n\f"}