{"id": "http://arxiv.org/abs/1106.5396v3", "guidislink": true, "updated": "2011-07-11T13:03:35Z", "updated_parsed": [2011, 7, 11, 13, 3, 35, 0, 192, 0], "published": "2011-06-27T14:05:11Z", "published_parsed": [2011, 6, 27, 14, 5, 11, 0, 178, 0], "title": "Pound-locking for characterization of superconducting microresonators", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1106.2467%2C1106.2088%2C1106.3267%2C1106.4912%2C1106.5308%2C1106.5683%2C1106.3726%2C1106.6140%2C1106.5668%2C1106.1684%2C1106.1932%2C1106.1643%2C1106.3508%2C1106.1006%2C1106.2394%2C1106.6025%2C1106.0909%2C1106.1422%2C1106.4794%2C1106.6333%2C1106.6221%2C1106.0428%2C1106.6067%2C1106.6020%2C1106.5885%2C1106.0022%2C1106.6202%2C1106.3327%2C1106.4393%2C1106.3273%2C1106.2459%2C1106.4292%2C1106.4468%2C1106.4039%2C1106.3690%2C1106.5491%2C1106.3958%2C1106.2445%2C1106.4705%2C1106.0372%2C1106.0434%2C1106.6267%2C1106.0904%2C1106.0998%2C1106.5543%2C1106.2220%2C1106.1655%2C1106.3079%2C1106.5129%2C1106.1644%2C1106.1400%2C1106.0977%2C1106.4074%2C1106.5180%2C1106.3301%2C1106.2916%2C1106.5801%2C1106.6294%2C1106.4635%2C1106.4586%2C1106.5932%2C1106.5396%2C1106.5566%2C1106.3397%2C1106.2767%2C1106.0548%2C1106.3106%2C1106.0176%2C1106.0180%2C1106.2424%2C1106.1317%2C1106.5239%2C1106.4368%2C1106.3469%2C1106.5585%2C1106.1280%2C1106.2628%2C1106.1405%2C1106.4138%2C1106.5846%2C1106.2961%2C1106.2330%2C1106.0748%2C1106.5725%2C1106.0374%2C1106.4009%2C1106.4338%2C1106.5277%2C1106.5328%2C1106.5540%2C1106.4499%2C1106.3814%2C1106.5869%2C1106.5879%2C1106.1704%2C1106.0793%2C1106.5251%2C1106.0669%2C1106.5891%2C1106.1895%2C1106.0657&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Pound-locking for characterization of superconducting microresonators"}, "summary": "We present a new application and implementation of the so-called Pound\nlocking technique for the interrogation of superconducting microresonators. We\ndiscuss how by comparing against stable frequency sources this technique can be\nused to characterize properties of resonators that can not be accessed using\ntraditional methods. Specifically, by analyzing the noise spectra and the Allan\ndeviation we obtain valuable information about the nature of the noise in\nsuperconducting planar resonators. This technique also greatly improves the\nread-out accuracy and measurement throughput compared to conventional methods.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1106.2467%2C1106.2088%2C1106.3267%2C1106.4912%2C1106.5308%2C1106.5683%2C1106.3726%2C1106.6140%2C1106.5668%2C1106.1684%2C1106.1932%2C1106.1643%2C1106.3508%2C1106.1006%2C1106.2394%2C1106.6025%2C1106.0909%2C1106.1422%2C1106.4794%2C1106.6333%2C1106.6221%2C1106.0428%2C1106.6067%2C1106.6020%2C1106.5885%2C1106.0022%2C1106.6202%2C1106.3327%2C1106.4393%2C1106.3273%2C1106.2459%2C1106.4292%2C1106.4468%2C1106.4039%2C1106.3690%2C1106.5491%2C1106.3958%2C1106.2445%2C1106.4705%2C1106.0372%2C1106.0434%2C1106.6267%2C1106.0904%2C1106.0998%2C1106.5543%2C1106.2220%2C1106.1655%2C1106.3079%2C1106.5129%2C1106.1644%2C1106.1400%2C1106.0977%2C1106.4074%2C1106.5180%2C1106.3301%2C1106.2916%2C1106.5801%2C1106.6294%2C1106.4635%2C1106.4586%2C1106.5932%2C1106.5396%2C1106.5566%2C1106.3397%2C1106.2767%2C1106.0548%2C1106.3106%2C1106.0176%2C1106.0180%2C1106.2424%2C1106.1317%2C1106.5239%2C1106.4368%2C1106.3469%2C1106.5585%2C1106.1280%2C1106.2628%2C1106.1405%2C1106.4138%2C1106.5846%2C1106.2961%2C1106.2330%2C1106.0748%2C1106.5725%2C1106.0374%2C1106.4009%2C1106.4338%2C1106.5277%2C1106.5328%2C1106.5540%2C1106.4499%2C1106.3814%2C1106.5869%2C1106.5879%2C1106.1704%2C1106.0793%2C1106.5251%2C1106.0669%2C1106.5891%2C1106.1895%2C1106.0657&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We present a new application and implementation of the so-called Pound\nlocking technique for the interrogation of superconducting microresonators. We\ndiscuss how by comparing against stable frequency sources this technique can be\nused to characterize properties of resonators that can not be accessed using\ntraditional methods. Specifically, by analyzing the noise spectra and the Allan\ndeviation we obtain valuable information about the nature of the noise in\nsuperconducting planar resonators. This technique also greatly improves the\nread-out accuracy and measurement throughput compared to conventional methods."}, "authors": ["Tobias Lindström", "Jonathan Burnett", "Mark Oxborrow", "Alexander Ya. Tzalenchuk"], "author_detail": {"name": "Alexander Ya. Tzalenchuk"}, "author": "Alexander Ya. Tzalenchuk", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1063/1.3648134", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1106.5396v3", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1106.5396v3", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "5 pages", "arxiv_primary_category": {"term": "physics.ins-det", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "physics.ins-det", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1106.5396v3", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1106.5396v3", "journal_reference": "Rev. Sci. Instrum. 82, 104706 (2011)", "doi": "10.1063/1.3648134", "fulltext": "Pound-locking for characterization of superconducting microresonators\nT. Lindström,1, 2 J. Burnett,1, 2 M. Oxborrow,1 and A Ya. Tzalenchuk1\n1)\n2)\n\nNational Physical Laboratory, Hampton Road, Teddington, TW11 0LW, UK\nRoyal Holloway, University of London, Egham Hill, Egham, TW20 0EX, UK\n\narXiv:1106.5396v3 [physics.ins-det] 11 Jul 2011\n\n(Dated: 26 October 2018)\n\nWe present a new application and implementation of the so-called Pound locking technique for the interrogation of superconducting microresonators. We discuss how by comparing against stable frequency sources\nthis technique can be used to characterize properties of resonators that can not be accessed using traditional\nmethods. Specifically, by analyzing the noise spectra and the Allan deviation we obtain valuable information\nabout the nature of the noise in superconducting planar resonators. This technique also greatly improves the\nread-out accuracy and measurement throughput compared to conventional methods.\nI.\n\nINTRODUCTION\n\nResonators are ubiquitous devices used in one form or\nanother in most areas of physics and in many important\napplications, from filters in mobile phones to experiments\nin cavity Quantum Electrodynamics (QED)1 . Over the\npast few years advances in on-chip quantum information\nprocessing have meant that planar microwave resonators\nhave taken on new roles: as quantum buses2 , for generating Fock states3 and as read-out elements for solidstate qubits4 . Superconducing resonators are also used\nas kinetic-inductance detectors5 . These applications involve measurements that need to be done quickly and accurately. It is natural to look at techniques already in use\nin the fields of optics and frequency metrology for inspiration on how to meet these new measurement challenges.\nA commonly used technique for reading-out resonators in\nprecision frequency metrology is Pound-locking6,7 , routinely used in quantum optics8 and precision frequency\nmetrology9 but surprisingly little known outside those\nfields.\nThe intrinsic properties of a resonator are described\nby its centre frequency ν0 and unloaded quality factor Qu = ν0 /∆ν, where ∆ν is the width of the resonance. This in turn is related to the attenuation rate\nα = πν0 /2Q. All these parameters are routinely measured using a vector network analyzer (VNA). Resonator\nmeasurements using a VNA are in principle accurate as\nlong as the resonance shape is known and fitting techniques can be used to obtain Q and ν0 , but are also quite\nslow, only measures the average behaviour and do not\nprovide any direct information about the level of noise\nin the system. Another common approach is to use homodyne detection techniques where the carrier is mixed\ndown to DC (using a mixer)5 . Pound-locking has a few\nimportant advantages over both these methods. The\nmain improvement comes from the fact that the modulation frequency fm (see below) can be chosen to be\nmuch higher than the 1/f corner frequency of amplifiers\netc; this is important since microwave amplifiers are very\nnoisy at low offset frequencies, meaning the noise in a\nhomodyne measurement5,10 scheme can be easily dominated by system noise. We typically use fm of 1-5 MHz,\nwell above the corner frequency of our amplifiers. It is\n\nalso a \"real time\" technique (within the bandwidth of the\nloop) in that it always \"tracks\" the centre frequency of\nthe resonator irrespective of the magnitude of the fluctuation; leading to a significant speedup in the measurement\nthroughput. Finally, it also allows for accurate measurements of very small shifts in the centre frequency of a\nresonator which is important in many experiments.\nThe purpose of this paper is to describe a new application and appropriate implementation of this wellestablished technique. We have adapted Pound-locking\nto the read-out and characterization of superconducting\nmicroresonators. We will also describe how one can obtain information about the nature of the noise in samples\nby using analysis techniques from precision frequency\nmetrology. It is our hope that this work will expand\nthe applications of the Pound locking technique.\n\nII.\n\nPOUND-LOCKING\n\nFigure 1(a) show the basic schematic of a Pound-loop.\nHere we will describe how this is implemented in the case\nof microwave oscillators; for a very intuitive discussion\nof how Pound locking is used in optics see the review\nby Black11 . The main building blocks are a voltagecontrolled oscillator (VCO) that generates a carrier of\nfrequency fc , a phase modulator used to add sidebands\n±fm to the signal, the resonator, a square-law power detector, a down-converting mixer and finally a regulator\ncircuit which controls the VCO. The principle of operation is as follows: assuming the carrier is near resonance\nand the modulation frequency has been chosen so that\nfm ≫ ∆ν the sidebands do not enter the resonator (note\nthat this means that no extra power is injected into the\nresonator; nor is the bandwidth limited by α). The phase\nmodulated signal going into the sample will be of the\nform11\nVin = V0 [J0 (β) + 2jJ1 (β) sin 2πfm t]e2πjfc t\n\n(1)\n\nwhere J0,1 are Bessel functions and β is the modulation\ndepth, it can be shown that the latter should be chosen\nso that the power in the sidebands is -3 dB smaller than\nthe carrier. The resonator can be anything that has a\n\"notch\" type frequency response, most Pound loops are\n\n\f2\n\nLO\n\nfM\n\nCryostat\n\n‐50 dB\n\nTunable\nAttenuator\n\nPhase Modulator\n\nAnalysis\nMod.\ngenerator\n30 dB\n\nController\n\nREF\n\nf\n\nData aquisition\n\nRF\nLock‐in\n\n(a)The basic Pound loop\n\nPower detector\n\n50 dB\n\n(b)Practical implementation of the Pound loop. Various auxiliary\ncomponents (filters etc.) have been left out for clarity.\n\nFIG. 1.\n\nimplemented using a circulator (meaning the sample is\nactually probed in reflection) but our planar resonator\n(see below and ref.12 ) have this response in transmission,\nsee fig. 2. The scattering parameter S21 for a piece of\ntransmission line shunted by a resonator can be written\nS21 =\n\nFIG. 2. Micrograph and equivalent circuit for one of our\nlumped element resonators. The electromagnetic radiation is\nprimarily inductively coupled to the inductive part of the resonator. The coupling strength is set by the mutual inductance\nbetween the coplanar transmission line and the resonator.\n\n2(1 + 2jQu y)\ng + 2(1 + 2jQu y)\n\nWhere g is a parameter determining the coupling\nstrength and y is the normalized centre frequency (f −\nν0 )/ν0 . After going through the sample the signal is\ndetected by a square-law diode after which it is demodulated using a mixer. The circuit therefore creates\nan error signal that is due to the interference between\nthe transmitted signal and the energy leaking out from\nthe resonator back into the transmission line. The signal\nfrom the diode can be written13,14\n\nǫ ∝ 2V02 kJ0 (β)J1 (β){Im[S21 (fc )](Re[S21 (fc + fm )] + Re[S21 (fc − fm )])−\nRe[S21 (fc )](Im[S21 (fc + fm )] + Im[S21 (fc − fm )])}\n\nwhere ǫ is the error signal; and k is a constant that depends on the conversion efficiencies of the diode and the\nde-modulator. The net effect of the Pound loop is that\nwhenever the carrier is off resonance, the transmitted signal is phase shifted and will have an AM component, i.e.\nthere is partial PM to AM conversion. The AM signal is\nthen detected and used to correct the error. Hence, ideally this circuit will \"lock\" the frequency of the carrier\nfc to the resonance frequency ν0 . Figure 3 shows what\n\n(2)\n\n(3)\n\nthe error signal ǫ will look like for a loop with a typical\nresonator. Once the system has locked to the resonator\nit will only undergo small excursions from ν0 and ǫ is\nnearly linear, using eq.2 we can simplify eq.3\nǫlin ∝ kV02\n\n4gQu\ny\n(g + 2)2\n\n(4)\n\nwhere we have assumed optimum modulation depth (β =\n1.08) and coupling (g = 2). Hence, the slope of the error\n\n\f3\n0.5\n0.4\n0.3\n0.2\n\nε\n\n0.1\n0\n−0.1\n−0.2\n−0.3\n−0.4\n−0.5\n−5\n\n−4\n\n−3\n\n−2\n\n−1\n\n(−f −ν )/ν\nm\n\n0\n\n0\n\n0\ny\n\n1\n\n2\n\n3\n\n(f −ν )/ν\nm\n\n0\n\n0\n\n4\n\n5\n−4\n\nx 10\n\nFIG. 3. Simulated typical error signal. The parameters are\nfm = ν0 /2000, Q=50000,g=2 and β = 1.08.\n\nsignal depends on the uncoupled quality factor and the\ncoupling strength of the resonator.\n\nIII.\n\nEXPERIMENTAL\n\nThe actual set up used in our experiment can be seen\nin 1(b). Our resonators are thin-film devices microfabricated on 5x10 mm2 chips (see ref12 for a full description). The chip is glued to a copper cold-finger and\nbonded to a connectorized chip carrier which is enclosed\nin an aluminium box; the box is then mounted on the\nmixing chamber of a dilution fridge which has a base\ntemperature of 30 mK. The in-signal to the resonator\ngoes via a filtered and heavily attenuated (50 dB) line.\nThe out-signal passes through an isolator and then into\na low-noise cryogenic amplifier with a noise temperature\nof about 4 K.\nThe microwave signal (hereon referred to as the carrier)\nis generated by a voltage-controlled oscillator, in practice\nthis is usually a microwave generator where the output\nfrequency can be modulated using an external voltage\n(at a rate of for example 10 kHz/V). Another option is\nto use a local oscillator (LO) held at a fixed frequency\nand mix it with an intermediate frequency (IF) from a\nlow-frequency VCO (in practice e.g. a function generator that can be frequency modulated) using for example\na single sideband modulator (SSB). The performance of\nthe latter setup is in principle better since a low phasenoise LO can be used (the phase noise of the IF source is\nnegligible) but makes the circuit more complicated (and\ncare has to be taken to minimize the amplitude of the\nside-bands). Another advantage of this latter arrangement is that the frequency shift can be read out directly\nwith high accuracy using a standard counter. The carrier then passes through a phase modulator which adds\nsidebands ±fm . The shape of the error signal depends\non the phase of the modulating signal, so this needs to\nbe adjusted to compensate for lead/lag caused by the cables, filters etc. The signal from the diode then goes to\nan RF lock-in amplifier (referenced to fm ) which is used\nwith a very short time constant (as to not limit the bandwitdh of the loop), essentially being operated as a mixer\nwith gain. The error signal in the loop is the in-phase\n\nsignal from the lock-in amplifier, and is fed to the PID\ncontroller. The output voltage from the controller then\ncontrols the VCO (which in our case outputs the IF) in\norder to null the error; we generally use a deviation of\n5-100 kHz/V. The PID controller is configured so that it\nattempts to keep the error signal as close to zero as possible while still maintaining a loop bandwidth much larger\nthan the frequency range of any noise we want to study.\nCare has to be taken to avoid dependence of the observed\nnoise level on the loop parameters, this can happen e.g. if\nthe gain is too high (resulting in oscillations that distort\nthe noise spectrum) or the bandwidth too low(resulting\nin a roll-off of the noise at higher frequencies) .\nMost of our measurement data is acquired using a standard 16-bit data acquisition system connected to the output of the PID controller. Sampling rates from 10 Hz to\nabout 50 kHz are used, depending on the measurement\ntime which varies from a few seconds to tens of hours. We\nalso monitor the output signal using an FFT analyzer. In\norder to get an independent measure of the frequency we\nmonitor the frequency of the IF source using a separate\ncounter. All microwave equipment, counters etc in our\nexperiment use an external 10 MHz frequency reference\nderived from a hydrogen maser. Our current setup allows\nus to track any change to the resonance frequency of the\nresonator with a bandwidth of a few kHz (limited by the\nPID controller) and a \"real-time\" frequency resolution of\na few parts in 108 (limited by the intrinsic noise of the\nresonator).\nOur experiment is essentially dual to that of the conventional setup used to improve the stability of an oscillator. In a conventional experiment a \"bad\" oscillator is\nlocked to a \"good\" resonator, we are here doing the exact opposite. The frequency noise level of our resonator\nis much higher than that of the carrier; by observing\nhow the circuit strives to null the error signal we obtain direct information about the resonator. Moreover,\nsince we are operating at offset frequencies smaller than\nfL = ν0 /2Q(∼ 75 kHz), the Leeson effect9 will not affect\nthe shape of the frequency spectrum15 .\nOur superconducting planar lumped element (LE) resonators are about 300x300 μm2 in size, fabricated from\nniobium on a sapphire substrate. Several resonators\n(usually 5) are fabricated on the same chip and are coupled to the same transmission line allowing for frequency\nmultiplexing. The data shown here comes from a resonator with ν0 of 7.5 GHz and a loaded Q=50 000, it is\nsimilar to the ones discussed in ref12 . Here we only show\na subset of our results, for a full discussion see16 .\nIn order to verify that our data really represents properties of the sample and are not measurement artifacts;\nwe also employ a number of reference samples. Here we\nwill therefore also show data from a common dielectric\nresonator (DRO) in the shape of a 'puck' about 7 mm\nin diameter mounted inside a metal box and measured\nat room temperature. In this experiment we locked to\na mode with a resonance frequency of 5.12 GHz and a\nloaded Q=5500.\n\n\f4\n10\n\n10\n\n4\n\n3\n\n10\n\n3\n2\n\n10\n\n2\n\n−1\n\nf\n\nσ (τ)\n\n√\nPSD (Hz/ Hz)\n\n10\n\n10\n\nα=1\n\n1\n\n10\n\nα=−0.5\n\n1\n\n−0.5\n10\n\n10\n\n0\n\n0\n\n10\n\n−1\n−2\n\n10\n\n10\n\n−1\n\n10\n\n0\n\n1\n\n10\nf(Hz)\n\n10\n\n2\n\n3\n\n10\n\n4\n\n10\n\n−1\n\n10\n\n10\n\n√\nFIG. 4. Root power spectral density (in units of Hz/ Hz)\nfor a 7.5 GHz lumped element resonator measured at 30mK.\nthe solid lines have a slope of -1 and -0.5, respectivly and are\nmeant as guides for the eye.\n\nIV.\n\nDATA ANALYSIS\n\nThe most straightforward way to measure noise is to\nuse a spectrum analyzer or -equivalently- to calculate the\npower spectral density (PSD) from sampled time-domain\ndata. Figure 4 shows a typical PSD from one of our LE\nresonators. Note that√what is plotted is the frequency\nnoise (in units of Hz/ Hz) meaning the PSD represent\nspectral information of how the centre frequency of the\nresonator changes. The spectrum shows that random\nwalk frequency noise (slope -1) dominates at low frequencies but that processes with a white (slope 0) spectra gradually takes over as the frequency increases. The\nsolid line with slope -0.5 can be identified with flicker\nfrequency noise.\nOne limitation of PSD is that it is often very difficult\nto analyze \"slow\" processes. Another little known, but\nhighly useful tool from the arsenal of frequency metrology\nis the Allan deviation (ADEV)17,18 . Here we have used\nthe overlapping Allan deviation σ:\n1\nσ2 =\n2m2 (M − 2m + 1)\n\n\n\nM−2m+1\nX\nX j+m−1\nj=1\n\n\n\ni=j\n\n2\n\n(y i+m − y i )\n\n\n(5)\nwhere M is the number of samples, τ0 is the measurement\ntimebase and y is the time-averaged fractional frequency.\nADEV is the most common measure of time-domain stability, but other related types of measures such as the\nmodified Allan deviation (MDEV), Hadamard deviation\netc are also very useful for analyzing and identifying noise\n(e.g. the MDEV in particular can distinguish between\nwhite and flicker phase noise). Using the Allan deviation\nit is relatively easy to identify noise processes that happen over a long timescale. Just as in the case of the PSD\nwe categorize the noise depending on the slope of the\ncurve17 when plotted in a log-log plot. Table I shows a\nsummary. Note that we have included frequency drift in\n\n−4\n\n10\n\n−3\n\n10\n\n−2\n\n10\n\n−1\n\nτ(s)\n\n10\n\n0\n\n10\n\n1\n\n10\n\n2\n\n3\n\n10\n\nFIG. 5. (colour online) Allan deviation plot for the dielectric\nresonator, with(diamonds) and without(points) temperature\nstabilisation.\n\ntable I; although stricly speaking not a noise, drift due\nto e.g. temperature fluctuations are often seen in real\nmeasurements.\nIn order to demonstrate how ADEV can be used to\nanalyze the intrinsic noise of resonators we first show the\nexperimental data from the DRO in figure 5. White frequency noise (slope -0.5) dominates as expected for short\ntimes until linear drift (slope +1) takes over and the deviation increases rapidly. This large drift in the resonance\nfrequency (about 10-20 Hz/second)is due to a changing\ntemperature and agrees with the specified temperature\nstability of a few ppm/K. By employing some rudimentary temperature stabilization we can shift the onset of\nthe drift further to the right on the plot. According to\nthis plot the best one can hope for is a short term stability\n(and read-out accuracy δf ) of about 0.2 Hz; which agrees\nwith the white noise level measured using an FFT analyzer as well as the direct read-out using a counter. This\ncorresponds to a line splitting factor ∆ν/δf of 5 * 106 .\nFigure 6 shows the ADEV -calculated using the same\ndataset as was used for the PSD- for the lumped element\nresonator measured at 30 mK. It is quite clear that the\nbehaviour is very different from that of the dielectric resonator. Flicker frequency noise (slope 0) dominates at\nboth long and short timescales, but the dominant feature is the sudden rise at timescales between 1 ms to\n\nTABLE I. Noise processes and the resulting slope in the root\nPSD and Allen deviation(ADEV) plots\nNoise type\nWhite phase\nFlicker Phase\nWhite frequency\nFlicker frequency\nRandom walk\nLinear drift\n\nroot PSD slope\n1\n0.5\n0\n-0.5\n-1\n-\n\nADEV slope\n-1\n-1\n-0.5\n0\n0.5\n1\n\n\f5\n\n2\n\nf\n\nσ (τ)\n\n10\n\ngent due to two-level fluctuators in the sample. This can\nbe a time-consuming process if one needs to \"step\" the\ntemperature and wait for it to stabilize before acquiring\nthe scattering parameters (S21 and/or S11) using a VNA.\nHowever, by using a Pound-loop one is only limited by\nthe thermal time-constant between the sample and the\ntemperature sensor, allowing for the temperature to be\nramped relatively quickly.\n\nα=0.6\n\nACKNOWLEDGMENTS\n1\n\n10 −4\n10\n\n−3\n\n10\n\n−2\n\n10\n\n−1\n\n10\n\n10\n\n0\n\nτ(s)\n\n10\n\n1\n\n10\n\n2\n\n10\n\n3\n\n10\n\n4\n\nFIG. 6. Allan deviation plot for a 7.5 GHz lumped element\nresonator measured at 30mK. The power in the resonator is\napproximately -100 dBm.\n\nThe authors would like to thank Phil Meeson, Gregoire\nIthier, John Gallop, Ling Hao and Enrico Rubiola for\nstimulating discussions, advice and help. This work was\nsupported by EPSRC and the Pathfinder program of the\nNational Measurement Office.\n1 C.\n\n1s. We attribute this to random walk noise (slope 0.5).\nIt is interesting to compare this with the PSD shown in\nfig. 4. One obvious difference is that we can now distiguish the types of noise much more easily. The random\nwalk noise -which is the most prominent feature in fig. 6is quite difficult to distinguish from other types of noise\nin the PSD and the ADEV also makes it easier to see over\nwhich timescale a particular noise process dominates.\nNote that the line splitting factor at long times for\nthe LE resonator is about 1500; much worse than for the\ndieletric resonator. This is simply a consequence of the\nfact that the lumped element resonator is -despite having\na much higher Q- much worse at stabilizing the Pound\nloop. This in turn can be attributed to the fact that the\nLE resonator is subject to noise from its environment: the\nflicker frequency noise is most likely due to the presence\nof two-level fluctuators5 ; the random walk noise might\nbe due to random changes in the dielectric environment\n(due to hopping) or the movement of trapped vortices in\nthe superconducting film.\nV.\n\nCONCLUSION\n\nBy bringing well-known measurement techniques and\nanalysis methods from time and frequency metrology to\nbear on the problem of the nature of noise in superconducting resonators one can gain a lot of information not\nreadily obtainable using more widely known techniques.\nBy implementing a Pound loop and analyzing the data\nusing the Allan deviation we are able to identify noise\nprocesses that are hard to distinguish by conventional\nmeans. Moreover, the fact that the loop directly measures the resonance frequency makes the analysis more\nstraigtforward. Finally, we would also like to mention\nthat the ability to \"track\" the value of ν0 can also lead\nto significant improvement in measurement throughput.\nA good example is measurements of ν0 vs. temperature\nwhich can e.g. be used to determine the intrinsic loss tan-\n\nC. Gerry and P. L. Knight, Introductory Quantum Optics\n(Cambridge University Press, 2005).\n2 M. A. Sillanpaa, J. I. Park, and R. W. Simmonds, \"Coherent\nquantum state storage and transfer between two phase qubits via\na resonant cavity,\" Nature 449, 438–442 (2007).\n3 M. Hofheinz, E. M. Weig, M. Ansmann, R. C. Bialczak,\nE. Lucero, M. Neeley, A. D. O/'Connell, H. Wang, J. M. Martinis,\nand A. N. Cleland, \"Generation of fock states in a superconducting quantum circuit,\" Nature 454, 310–314 (2008).\n4 A. Wallraff, D. Schuster, A. Blais, L. Frunzio, R. Huang, J. Majer, S. Kumar, S. Girvin, and R. Schoelkopf, \"Strong coupling of\na single photon to a superconducting qubit using circuit quantum\nelectrodynamics,\" Nature 431, 162–167 (2004).\n5 J. Gao, J. Zmuidzinas, B. A. Mazin, H. G. LeDuc, and P. K. Day,\n\"Noise properties of superconducting coplanar waveguide microwave resonators,\" Applied Physics Letters 90, 102507 (2007).\n6 R. Pound, \"Electronic frequency stabilization of microwave oscillators,\" Review of Scientific Instruments 17, 490 (1946).\n7 R. Drever, \"Laser phase and frequency stabilization using an optical resonator,\" Applied Physics B: Photophys. Laser Chem. 31,\n97–105 (1983).\n8 Pound-locking is sometimes also referred to as Pound-Drever-Hall\nlocking.\n9 E. Rubiola, Phase Noise and Frequency Stability in Oscillators\n(Cambridge University Press, 2009).\n10 R. Barends, H. L. Hortensius, T. Zijlstra, J. J. A. Baselmans,\nS. J. C. Yates, J. R. Gao, and T. M. Klapwijk, \"Noise in nbtin,\nal, and ta superconducting resonators on silicon and sapphire\nsubstrates,\" 19, 936–939 (2009).\n11 E.\nD.\nBlack,\n\"An\nintroduction\nto\npound–\ndrever–hall\nlaser\nfrequency\nstabilization,\"\nAmerican Journal of Physics 69, 79–87 (2001).\n12 T. Lindström, J. E. Healey, M. S. Colclough, C. M.\nMuirhead,\nand A. Y. Tzalenchuk, \"Properties of superconducting planar resonators at millikelvin temperatures,\"\nPhys. Rev. B 80, 132501 (2009).\n13 J. Anstie, A 50K Dual-Mode sapphire oscillator and whispering\nspherical mode oscillators, Ph.D. thesis, University of Western\nAustralia (2006).\n14 S. Chang, Ultrastable cryogenic microwave sapphire resonator\noscillator, Ph.D. thesis, University Wester Australia (2000).\n15 E. Rubiola, Private communications.\n16 T. Lindström, J. Burnett, M. Oxborrow, and A. Y. Tzalenchuk,\nIn preparation.\n17 W. Riley, \"Handbook of frequency stability analysis,\" Tech. Rep.\n1065 (2008).\n18 T. Witt and D. Reymann, \"Using power spectra and allan variances to characterise the noise of zener-diode voltage standards,\"\nIEEE Proc. Sci. Meas. Technol. 147, 177–182 (2000).\n\n\f"}