{"id": "http://arxiv.org/abs/0708.0345v1", "guidislink": true, "updated": "2007-08-02T14:14:33Z", "updated_parsed": [2007, 8, 2, 14, 14, 33, 3, 214, 0], "published": "2007-08-02T14:14:33Z", "published_parsed": [2007, 8, 2, 14, 14, 33, 3, 214, 0], "title": "Quasi-classical rate coefficient calculations for the rotational\n  (de)excitation of H2O by H2", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0708.2355%2C0708.1670%2C0708.2056%2C0708.2103%2C0708.1447%2C0708.0668%2C0708.0753%2C0708.2064%2C0708.1653%2C0708.3833%2C0708.0437%2C0708.0795%2C0708.3626%2C0708.0829%2C0708.0440%2C0708.3664%2C0708.0914%2C0708.1021%2C0708.4216%2C0708.1937%2C0708.3951%2C0708.1134%2C0708.0345%2C0708.2014%2C0708.3743%2C0708.3469%2C0708.2095%2C0708.0745%2C0708.4168%2C0708.0973%2C0708.3166%2C0708.0453%2C0708.3564%2C0708.1420%2C0708.0858%2C0708.3605%2C0708.3221%2C0708.0281%2C0708.2433%2C0708.1560%2C0708.3009%2C0708.4401%2C0708.1235%2C0708.2235%2C0708.3289%2C0708.1266%2C0708.1972%2C0708.2353%2C0708.4141%2C0708.0942%2C0708.2807%2C0708.1541%2C0708.4410%2C0708.1998%2C0708.0400%2C0708.0331%2C0708.1040%2C0708.0610%2C0708.3115%2C0708.2047%2C0708.2293%2C0708.2385%2C0708.2347%2C0708.4240%2C0708.2199%2C0708.4306%2C0708.4226%2C0708.0067%2C0708.0154%2C0708.0180%2C0708.1985%2C0708.4393%2C0708.0929%2C0708.2201%2C0708.2739%2C0708.2951%2C0708.4157%2C0708.4227%2C0708.2501%2C0708.0456%2C0708.3942%2C0708.1199%2C0708.1970%2C0708.3153%2C0708.1470%2C0708.1775%2C0708.3910%2C0708.2924%2C0708.1853%2C0708.0441%2C0708.0426%2C0708.3045%2C0708.1263%2C0708.4017%2C0708.3015%2C0708.2991%2C0708.4228%2C0708.1336%2C0708.2006%2C0708.3168%2C0708.1315&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Quasi-classical rate coefficient calculations for the rotational\n  (de)excitation of H2O by H2"}, "summary": "The interpretation of water line emission from existing observations and\nfuture HIFI/Herschel data requires a detailed knowledge of collisional rate\ncoefficients. Among all relevant collisional mechanisms, the rotational\n(de)excitation of H2O by H2 molecules is the process of most interest in\ninterstellar space. To determine rate coefficients for rotational de-excitation\namong the lowest 45 para and 45 ortho rotational levels of H2O colliding with\nboth para and ortho-H2 in the temperature range 20-2000 K. Rate coefficients\nare calculated on a recent high-accuracy H2O-H2 potential energy surface using\nquasi-classical trajectory calculations. Trajectories are sampled by a\ncanonical Monte-Carlo procedure. H2 molecules are assumed to be rotationally\nthermalized at the kinetic temperature. By comparison with quantum calculations\navailable for low lying levels, classical rates are found to be accurate within\na factor of 1-3 for the dominant transitions, that is those with rates larger\nthan a few 10^{-12}cm^{3}s^{-1}. Large velocity gradient modelling shows that\nthe new rates have a significant impact on emission line fluxes and that they\nshould be adopted in any detailed population model of water in warm and hot\nenvironments.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0708.2355%2C0708.1670%2C0708.2056%2C0708.2103%2C0708.1447%2C0708.0668%2C0708.0753%2C0708.2064%2C0708.1653%2C0708.3833%2C0708.0437%2C0708.0795%2C0708.3626%2C0708.0829%2C0708.0440%2C0708.3664%2C0708.0914%2C0708.1021%2C0708.4216%2C0708.1937%2C0708.3951%2C0708.1134%2C0708.0345%2C0708.2014%2C0708.3743%2C0708.3469%2C0708.2095%2C0708.0745%2C0708.4168%2C0708.0973%2C0708.3166%2C0708.0453%2C0708.3564%2C0708.1420%2C0708.0858%2C0708.3605%2C0708.3221%2C0708.0281%2C0708.2433%2C0708.1560%2C0708.3009%2C0708.4401%2C0708.1235%2C0708.2235%2C0708.3289%2C0708.1266%2C0708.1972%2C0708.2353%2C0708.4141%2C0708.0942%2C0708.2807%2C0708.1541%2C0708.4410%2C0708.1998%2C0708.0400%2C0708.0331%2C0708.1040%2C0708.0610%2C0708.3115%2C0708.2047%2C0708.2293%2C0708.2385%2C0708.2347%2C0708.4240%2C0708.2199%2C0708.4306%2C0708.4226%2C0708.0067%2C0708.0154%2C0708.0180%2C0708.1985%2C0708.4393%2C0708.0929%2C0708.2201%2C0708.2739%2C0708.2951%2C0708.4157%2C0708.4227%2C0708.2501%2C0708.0456%2C0708.3942%2C0708.1199%2C0708.1970%2C0708.3153%2C0708.1470%2C0708.1775%2C0708.3910%2C0708.2924%2C0708.1853%2C0708.0441%2C0708.0426%2C0708.3045%2C0708.1263%2C0708.4017%2C0708.3015%2C0708.2991%2C0708.4228%2C0708.1336%2C0708.2006%2C0708.3168%2C0708.1315&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "The interpretation of water line emission from existing observations and\nfuture HIFI/Herschel data requires a detailed knowledge of collisional rate\ncoefficients. Among all relevant collisional mechanisms, the rotational\n(de)excitation of H2O by H2 molecules is the process of most interest in\ninterstellar space. To determine rate coefficients for rotational de-excitation\namong the lowest 45 para and 45 ortho rotational levels of H2O colliding with\nboth para and ortho-H2 in the temperature range 20-2000 K. Rate coefficients\nare calculated on a recent high-accuracy H2O-H2 potential energy surface using\nquasi-classical trajectory calculations. Trajectories are sampled by a\ncanonical Monte-Carlo procedure. H2 molecules are assumed to be rotationally\nthermalized at the kinetic temperature. By comparison with quantum calculations\navailable for low lying levels, classical rates are found to be accurate within\na factor of 1-3 for the dominant transitions, that is those with rates larger\nthan a few 10^{-12}cm^{3}s^{-1}. Large velocity gradient modelling shows that\nthe new rates have a significant impact on emission line fluxes and that they\nshould be adopted in any detailed population model of water in warm and hot\nenvironments."}, "authors": ["A. Faure", "N. Crimier", "C. Ceccarelli", "P. Valiron", "L. Wiesenfeld", "M. -L. Dubernet"], "author_detail": {"name": "M. -L. Dubernet"}, "author": "M. -L. Dubernet", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1051/0004-6361:20077678", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/0708.0345v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0708.0345v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "8 pages, 2 figures, 1 table (the online material (4 tables) can be\n  obtained upon request to afaure@obs.ujf-grenoble.fr)", "arxiv_primary_category": {"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0708.0345v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0708.0345v1", "journal_reference": null, "doi": "10.1051/0004-6361:20077678", "fulltext": "c ESO 2018\n\nAstronomy & Astrophysics manuscript no. arxiv-7678\nOctober 25, 2018\n\nQuasi-classical rate coefficient calculations for the rotational\n(de)excitation of H2 O by H2\nA. Faure1 , N. Crimier1 , C. Ceccarelli1 , P. Valiron1 , L. Wiesenfeld1 , and M. L. Dubernet2\n\narXiv:0708.0345v1 [astro-ph] 2 Aug 2007\n\n1\n2\n\nLaboratoire d'Astrophysique, UMR 5571 CNRS, Université Joseph-Fourier, B.P. 53, 38041 Grenoble cedex 09, France\ne-mail: afaure@obs.ujf-grenoble.fr\nObservatoire de Paris-Meudon, LERMA UMR 8112 CNRS, 5 Place Jules Janssen, 92195 Meudon Cedex, France\n\nReceived 20 April 2007 / Accepted 4 June 2007\nABSTRACT\n\nContext. The interpretation of water line emission from existing observations and future HIFI/Herschel data requires a detailed\nknowledge of collisional rate coefficients. Among all relevant collisional mechanisms, the rotational (de)excitation of H2 O by H2\nmolecules is the process of most interest in interstellar space.\nAims. To determine rate coefficients for rotational de-excitation among the lowest 45 para and 45 ortho rotational levels of H2 O\ncolliding with both para and ortho-H2 in the temperature range 20−2000 K.\nMethods. Rate coefficients are calculated on a recent high-accuracy H2 O−H2 potential energy surface using quasi-classical trajectory\ncalculations. Trajectories are sampled by a canonical Monte-Carlo procedure. H2 molecules are assumed to be rotationally thermalized\nat the kinetic temperature.\nResults. By comparison with quantum calculations available for low lying levels, classical rates are found to be accurate within a\nfactor of 1−3 for the dominant transitions, that is those with rates larger than a few 10−12 cm3 s−1 . Large velocity gradient modelling\nshows that the new rates have a significant impact on emission line fluxes and that they should be adopted in any detailed population\nmodel of water in warm and hot environments.\nKey words. molecular data – molecular processes – ISM: molecules\n\n1. Introduction\nSince its discovery in interstellar space (Cheung et al. 1969),\nwater vapour has been detected in a great variety of astronomical objects using both Earth-based and, foremost, spacecraft\nobservations. The Infrared Space Observatory (ISO), in particular, has revealed the ubiquity of water in the interstellar\n(ISM) and circumstellar (CSM) media (for a recent review see\nCernicharo & Crovisier 2005). The more recent Submillimetre\nWave Astronomy Satellite (SWAS) and Odin missions have also\nmeasured gaseous water in a wide variety of sources using\nthe single ground-state rotational transitions of ortho-H2O at\n557 GHz (e.g. Melnick & Bergin 2005; Hjalmarson et al. 2003).\nFinally, water is also detected at radio and (sub)millimeter wavelengths through maser transitions which are commonly associated with star-forming regions (e.g. Cernicharo et al. 1990, 1999;\nGoddi et al. 2007 and references therein or extraglactic sources\n(e.g. Cernicharo et al. 2006; Kondratko et al. 2006 and references\ntherein).\nThe abundance of water varies largely in cold and warm media. In the former, because of the freezing of water onto the dust\ngrains, water does not exceed ∼ 10−8 (Bergin & Snell 2002;\nPoelman et al. 2007 and references therein). But in warm regions, water can become the most abundant molecule after H2 ,\nwith an abundance of ∼ 10−4 . In star forming regions, this occurs both because of the release in the gas phase of the grain ices\nand because of endothermic reactions efficiently forming water\nin the gas phase (e.g. Ceccarelli et al. 1996; Doty & Neufeld\nSend offprint requests to: A. Faure\n\n1997 and references therein). Under these conditions, water becomes a crucial molecule in the thermal and chemical balance.\nIn fact, owing to its large dipole, water lines will dominate the\ncooling (and sometime even heating) of the gas in a large range\nof gas densities and temperatures (e.g. Neufeld & Melnick 1991;\nCeccarelli et al. 1996; Cernicharo et al. 2006 and references\ntherein). Also, since oxygen will be mostly locked in water\nmolecules at temperatures larger than about 200 K, the chemical abundance of more complex and less abundant molecules\nwill depend on the water abundance.\nFor all these reasons, water is a key molecule in space, and\nits observation and the determination of its abundance are critical for many theoretical aspects. Indeed, observing and measuring the water lines and their abundance is an important task for\nthe high resolution spectrometer Heterodyne Instrument for the\nFar Infrared (HIFI) on board the ESA funded Herschel satellite, which will be launched in 2008. However, as stated by\nCernicharo & Crovisier (2005), \"little new information will be\nobtained if collisional rates adapted to the temperatures of the\nclouds in the ISM and CSM are not available\".\nCollisional rate coefficients are indeed essential in the description of the energy exchange processes responsible for\nmolecular line formation in astronomical environments. Spectral\nfeatures such as maser emission are produced in low-density\nconditions far from thermodynamic equilibrium and through\na complex competition between radiative and collisional processes, including infrared emission from dust (e.g. Poelman et\nal. 2007). In the ISM and CSM, the main colliding partners are\nhydrogen molecules, hydrogen and helium atoms, and electrons.\n\n\f2\n\nA. Faure et al.: Quasi-classical rate coefficient calculations for the rotational (de)excitation of H2 O by H2\n\nIn general, however, H2 is the dominant form of hydrogen and\nas it is more abundant than He (by a factor of ∼ 5) and electrons (by ∼ 4−8 orders of magnitude), H2 is usually the dominant exciting species. At typical ISM and CSM temperatures\n(T < 2000 K), the dominant energy exchange process is thus\nrotational (de)excitation by H2 , although vibrational excitation\ncannot be neglected in the highest temperature and density regions.\nTo the best of our knowledge no experimental state-to-state\ndata is available for H2 O−H2 except for the total relaxation rate\nof the water bending mode (see Faure et al. 2005a and references\ntherein). On the theoretical side, quantum close-coupling (CC)\nstate-to-state calculations for the rotational excitation of H2 O by\nH2 and He have been performed for kinetic temperatures and\nenergy levels lower than 140 K and 2000 K, respectively (Green\net al. 1993; Phillips et al. 1996; Dubernet et al. 2002; Grosjean et\nal. 2003; Dubernet et al. 2006). Hence, current models of water\nemission in warm and hot environments rely exclusively on rates\nfor excitation by He atoms, usually scaled by the reduced mass\nratio (μH2 O−H2 /μH2 O−He )1/2 (e.g. Poelman & Spaans 2005). It has\nbeen shown by Phillips et al. (1996), however, that excitation by\npara-H2 in its J=0 level is not too different from excitation by\nHe atoms (with most rates differing by a multiplicative factor\nof 1−3) but that excitation by H2 in excited rotational levels is\nsignificantly different. This mainly reflects the importance of the\nlong-range interaction between the H2 quadrupole moment and\nthe dipole of H2 O (Phillips et al. 1996). Rates for excitation of\nH2 O by H2 at high temperatures and/or for high rotational levels\nare therefore urgently needed for the interpretation of existing\nand future water emission spectra.\nIn principle, scattering calculations based on the quantum\nCC method can provide an absolute accuracy of a few percent\nfor a given potential energy surface (PES). As an illustrative\nexample, the recent study of Gilijamse et al. (2006) has shown\nan excellent agreement between experimentally measured cross\nsections and CC calculations based on ab initio PES. The major drawback of the quantum CC method is its computational\ncost which increases dramatically with the number of coupled\nchannels, i.e. with the total energy and the number of degrees\nof freedom. Very recently, Dubernet et al. (2006) provided new\nrotational rate coefficients for H2 O−H2 at temperatures below\n20 K using fully converged CC calculations based on the recent\nhigh-accuracy PES of Faure et al. (2005a). The main objective\nof their study was to test the influence of the new PES on the\nscattering calculations and to make comparisons with previous\nresults based on the PES of Phillips et al. (1994). A significant\nre-evaluation of rates was observed, especially for para-H2 , with\ndifferences up to a factor of 3 at 20 K. Full CC calculations,\naugmented with coupled-states and infinite order sudden (IOS)\ncalculations, are currently in progress at higher collision energies with the objective of obtaining quantum CC rates for kinetic\ntemperatures and rotational levels up to ∼ 2000 K and making\ncomparisons with pressure broadening experiments (Dubernet\net al., in preparation).\nThe present study is motivated by the possibility of performing high temperature quasiclassical trajectory (QCT) calculations as an alternative to quantum mechanical calculations.\nIn contrast to CC calculations, the computational time required\nfor QCT calculations decreases as the collisional energy increases and such calculations are thus particularly adapted to\nhigh temperatures where purely quantum effects are usually negligible. QCT calculations have been shown to accurately reproduce quantum results provided that the relevant transition probabilities are large enough. In particular, Faure et al. (2006) re-\n\ncently observed a good agreement between classical and quantum rates for the rotational de-excitation of H2 O by H2 at a single temperature of 100 K. The average accuracy of classical results was found to be better than a factor of 2 for the transitions\nwith the largest probabilities, i.e. those with a rate greater than\n∼ 10−11 cm3 s−1 . The classical approach is thus expected to provide a good compromise between accuracy and computational\neffort at temperatures where converged quantum CC calculations\nare extremely expensive (typically T >300 K). The next section\ndescribes details of the QCT calculations. Rate coefficients are\npresented in Sect. 3. A first application of these rates is given in\nSect. 4. Conclusions are drawn in Sect. 5.\n\n2. Quasi-classical trajectory method\n2.1. Potential energy surface and general procedure\n\nAll calculations presented below were performed with rigid\nmolecules using the vibrationally averaged PES of Faure et al.\n(2005a), where full details can be found. The angular expansion\nof the PES was obtained as a least square fit of thousands of ab\ninitio values over 149 angular functions which are specifically\nadapted to quantum calculations and provide analytical derivatives for the classical equations of motion. In order to reduce\ncomputational time in integrating these equations, a subset of\nonly 45 angular functions was retained. This selection was found\nto reproduce the ab initio values within a few cm −1 in the Van\nder Waals minimum region. The inclusion of additional angular functions was tested through trajectory analysis and found to\nbe negligible. The water and hydrogen geometries were taken\nat their effective rotational values, that is those corresponding to\nthe spectroscopically determined rotational constants.\nAs inelastic (nonreactive) collisions cannot interconvert the\northo- and para-forms of either species, QCT calculations were\ndone separately for the four nuclear spin combinations, namely\npara-H2 O−para-H2, para-H2 O−ortho-H2, ortho-H2O−para-H2\nand ortho-H2O−ortho-H2. Classical trajectories were run using\nthe Monte-Carlo procedure described in Faure et al. (2006).\nThe rate coefficients were computed by a canonical sampling\nof the initial Maxwell-Boltzmann distribution of collisional energy at four kinetic temperatures, namely T =100, 300, 1000\nand 2000 K. Some test calculations were also performed at 50 K\n(see Fig. 1). The classical equations of motion were numerically\nsolved using an extrapolation Bulirsch-Stoer algorithm. The total energy was conserved up to six digits, i.e. within ∼0.1 cm−1 .\nThe maximum impact parameter bmax , defined as the smallest impact parameter for which 1000 trajectories produced no\nchange in the rotational state of H2 O, was found to range between 10 and 16 a.u. at the selected temperatures. Batches of\n10,000 trajectories were run for each of the lowest 44 para and\n44 ortho excited rotational levels of H2 O, resulting in a total\nof 7,040,000 trajectories. These calculations required approximately 150 hours of computer time on AMD Opteron quadriprocessors for each temperature and for each of the four nuclear\nspin cases.\n2.2. Initial state selection\n\nFor each molecule, the classical rotational angular momentum\nwas taken as [J(J + 1)]1/2 , where J is the rotational quantum\n(integer) number, using the correspondence principle. For water, initial values of the classical angular momentum components\nwere simply assigned to the pseudoquantum numbers Ka and Kc\n(projection of J along the axis of the least and greatest moments\n\n\fA. Faure et al.: Quasi-classical rate coefficient calculations for the rotational (de)excitation of H2 O by H2\n\nof inertia, respectively). This trivial initial selection was found\nto reproduce exact quantum eigenvalues within a few cm−1 for\nthe lowest levels (see Table 1 in Faure et al. 2006) and within\na few percent for the highest. For H2 , the initial para and ortho rotational levels were weighted separately according to the\nBoltzmann distribution:\nE\n\n(2J2 + 1) exp(− kTJ2 )\nρ(J2 ) = P\n,\nE J2\nJ2 (2J2 + 1) exp(− kT )\n\n(1)\n\nwhere J2 is the H2 angular momentum, k is the Boltzmann constant and the sum in the denominator extends only over even\n(odd) numbers for para (ortho) H2 . We thus assumed that each\nnuclear spin species of H2 has a thermal distribution of rotational\nlevels. This is obviously not necessarily the case in astronomical\nenvironments, in particular for high-J2 levels. However, from the\nH2 Einstein coefficients tabulated by Wolniewicz et al. (1998)\nand the H2 -He rates reported by Flower et al. (1998), we have\nestimated the He critical densities to be below ∼ 103 cm−3 up to\nJ2 = 5, that is up to H2 levels lying more than ∼2000 K above the\nground states. These levels are therefore likely to be at or close\nto local thermodynamic equilibrium (LTE) at typical ISM and\nCSM densities. Observationally, the detections of H2 in shocks\nby Lefloch et al. (2003) and Neufeld et al. (2006) also suggest\nthat the H2 rotational populations are close to LTE for J2 as high\nas 9. As the dependence of the H2 O rates on the H2 rotational\nlevel is modest (see Sect. 3), the assumption of rotationally thermalized H2 molecules seems reasonable. Furthermore, this assumption has the advantage that the rate coefficients rigorously\nsatisfy the principle of detailed balance (see below).\n\n3\n\nIn the following, statistical errors are defined as two standard\ndeviations which, in practice, correspond to a typical statistical\naccuracy of 10−30%.\n2.4. Detailed balance\n\nThe principle of detailed balance (microsopic reversibility),\nwhich is the consequence of the invariance of the interaction under time reversal, states that the rate coefficients, as defined in\nEq. (2), must obey the relation:\n#\n\" ′\nE Jα ′ − E Jα\n(2J + 1)\nR(Jα → Jα′ ′ , T ).(5)\nR(Jα′ ′ → Jα , T ) =\nexp\n(2J ′ + 1)\nkT\nAs shown by Faure et al. (2006), however, QCT calculations\nsignificantly overestimate the excitation (endoergic) rates in the\ncase of H2 O transitions whose energies are larger or comparable\nto the kinetic temperature. This 'threshold effect' results from\nthe rotational degrees of freedom of H2 O that are classically active at energies below quantum thresholds. The competing effect\ninduced by the rotational degrees of freedom of H2 was also observed, to a lesser extent, in the case of H2 O transitions whose\nenergies are lower than the kinetic temperature. Such effects\nwere also reported for other hydrogenic systems (see Mandy\n& Pogrebnya 2004 and references therein). As a result, detailed\nbalance is not rigorously satisfied at the classical level and excitation rates can be ovestimated by an order of magnitude. The\nrecommended practical procedure is therefore to employ QCT\ncalculations for de-excitation (exoergic) transitions and to apply\nEq. (5) to obtain the reverse, endoergic, rates. We note, however,\nthat detailed balance was actually satisfied within error bars for\na number of low energy transitions at the highest temperatures2 .\n\n2.3. Final state selection and rate calculation\n\nIn the case of an asymmetric top molecule, the standard bin histogram method used to assign the final classical action has been\nshown to be ambiguous (Faure & Wiesenfeld 2004). However, in\nthe particular case of water-like molecules, i.e. asymmetric rotors with i) dipole along the axis of intermediate moment of inertia and ii) C2V symmetry, the ambiguities can be solved by taking\nadvantage of the fact that ortho/para transitions are not permitted\n(see Faure et al. 2006). For H2 , no final assignment was required\nas rate coefficients must be summed over all possible H2 rotational levels. The rate coefficients reported in the present study\nare therefore defined, for each of the four spin combinations, as:\nX\n(2)\nR(Jα → Jα′ ′ ) =\nρ(J2 ) R(Jα , J2 → Jα′ ′ , J2′ ),\nJ2 ,J2′\n\nwhere α = Ka , Kc . According to the canonical Monte-Carlo procedure described above, these rates were computed as:\n!1/2\n8kT\nN\nR(Jα → Jα′ ′ , T ) =\n,\n(3)\nπb2max\nπμ\nNtot\nwhere μ is the reduced mass, N is the number of trajectories\nleading to a specified final level of water Jα′ ′ and Ntot is the total\nnumber of 'physical' trajectories1 , typically between 9,000 and\n10,000. The Monte-Carlo standard deviation is:\n!1/2\n∆R(Jα → Jα′ ′ )\nNtot − N\n.\n(4)\n=\nR(Jα → Jα′ ′ )\nNtot N\n1\n\nA small fraction (less than 10%) of trajectories are indeed rejected\ndue to either non-conservation of energy (failure of numerical integration) or unphysical final values of Ka , Kc .\n\n2.5. Advantages, shortcomings and accuracy of the classical\nmethod\n\nThe shortcomings of the classical approach are well known and\nare usually marked at low kinetic temperatures where purely\nquantum effects are significant. In particular, between ∼ 1 and\n100 K where the Van der Waals interactions are dominant, quantum rates exhibit oscillatory temperature dependence due to\nthe presence of quantum resonances (of shape and/or Feshbach\ntype). In this regime, classical calculations are obviously questionable. Amplitudes of these oscillations are however usually\nmodest and not much larger than the accuracy of QCT calculations. We note, for instance, that the recent study of Wernli et al.\n(2007) showed a quite good agreement between QCT and quantum rates down to 10 K. A greater limitation of the classical approach is the quantization of the rotational degrees of freedom,\nas explained above. Finally, a major disadvantage of classical\nmechanics is its inability to reproduce small probabilities, the\nso-called classically forbidden transitions corresponding to rates\nlower than ∼10−13 − 10−12 cm3 s−1 . Owing to all these intrinsic\nlimitations that add to the Monte-Carlo statistical deviations, an\naccuracy of greater than 10% is difficult to achieve by QCT rate\ncalculations. The recent work of Faure et al. (2006) has shown,\nhowever, that classical rates for H2 O−H2 are accurate within a\nmultiplicative factor of 1−3 for low lying levels. Precision of\n∼30% was even observed for the greatest rates. Such accuracies\n2\n\nIt should be noted that 'effective' rates which depend on the initial\nrotational levels of H2 and which are summed over the final H2 rotational levels (as defined in Eq. (1) of Dubernet et al. 2006) do not obey\ndetailed balance since they do not involve a complete thermal average.\nThese effective rates were reported in the previous quantum studies.\n\n\fA. Faure et al.: Quasi-classical rate coefficient calculations for the rotational (de)excitation of H2 O by H2\n\n3. Quasi-classical trajectory results\n3.1. Comparison to quantum data\n\nIn Fig. 1, four sets of rate coefficients for rotational de-excitation\nof the ortho-H2O 303 level by para and ortho-H2 are plotted as\na function of temperature: i) current QCT data between 50 and\n2000 K, ii) quantum data of Phillips et al. (1996) between 20 and\n140 K, iii) H2 O−He quantum data of Green et al. (1993) multiplied by the reduced mass ratio (μH2 O−H2 /μH2 0−He )1/2 = 1.348\nbetween 20 and 2000 K, iv) quantum data of Dubernet et al.\n(2006) at 20 K augmented with unpublished data for para-H2 between 20 and 1500 K. These latter unpublished rates have been\ncomputed using Eq. (2) with the sum extending over J2 = 0, 2, 4\nand with a scaling procedure for estimating the rates for excitation by H2 (J2 = 4) from those by H2 (J2 = 2)3 . We have\nselected the 303 level because it is the highest initial state included by Phillips et al. (1996). Firstly, it can be observed that\nthere is an overall good agreement (within a factor of 1−3) between the present rates and those of both Phillips et al. (1996)\nand Dubernet et al. while large differences (up to 2 orders of\nmagnitude) are found with the scaled H2 O−He rates, especially\nso for ortho-H2 at T <100 K. It should be noted in particular\nthat at low temperatures, the transition 303 − 110 has a larger\nrate than 303 − 221 for para-H2 while the reverse holds for orthoH2 . Second, in the case of para-H2 , the agreement between the\npresent classical calculations and the quantum calculations of\nDubernet et al. is excellent above 100 K, where quantum data are\nwithin the error bars of the QCT data. At and below 100 K, the\nagreement is not as good, reflecting the limitations of the classical approach (see Sect. 2.5), but differences do not exceed a factor of 2. Third, the influence of the new H2 O−H2 PES is modest,\nexcept for para-H2 at low temperature. Classical rates for orthoH2 are thus found to be in very good agreement with those of\nPhillips et al. (1996). This small impact of the PES on the orthoH2 rates was previously observed by Dubernet et al. (2006).\nFourth, we observe that the differences between the present classical rates and the scaled H2 O−He rates decrease with increasing\ntemperature. This reflects the fact that at high collision energy,\nthe scattering process becomes dominated by kinematics rather\nthan specific features of the PES. Finally, above 300 K, the difference between para and ortho-H2 rates becomes minor. This\nclearly shows that the dependence of the rates on the H2 rotational level is weak, provided that J2 ≥ 1. We have actually\nchecked that differences between de-excitation rates of the 303\nlevel by H2 (J2 = 1) and H2 (J2 = 6) do not differ by more than\nfour Monte-Carlo standard deviations, i.e. by less than a factor of\n3\nA scaling factor of 1.2 has been uniformly employed for all transitions.\n\n2. This finding is consistent with the quantum results of Phillips\net al. (1996) who found similar rates for excitation of para-H2O\nby H2 (J2 = 1) and H2 (J2 = 2).\n\n1e-10\n\n303-212\n\npara-H2\n\n303-221\n303-110\n\n3 -1\n\nare still much lower than the few percent precision of quantum\nCC calculations.\nHowever, a major advantage of classical trajectories is to allow the computation of de-excitation rates for high initial values\nof the rotational angular momenta. In particular, the calculation\nof rate coefficients as defined in Eq. (2) requires the inclusion of\nall significantly populated levels of H2 . At 2000 K and assuming\nLTE, the most populated level is J2 =4 (3) for para(ortho) H2 but\nlevels up to J2 =14 (13) were in fact included in our QCT calculations. At the quantum CC level, a calculation with J2 > 4 is\ncurrently not feasible. Thus, classical mechanics proves particularly suited to collisions between 'hot' molecules where standard\nquantum methods are not applicable.\n\nDe-excitation rate coefficient (cm s )\n\n4\n\n1e-11\n\n1e-12\n303-212\n\n1e-10\n\n303-221\n303-110\n1e-11\n\northo-H2\n1e-12\n10\n\n100\n1000\nTemperature (K)\n\n10000\n\nFig. 1. Rate coefficients, Eq. (2), for rotational de-excitation of\nthe ortho-H2O state 303 as functions of temperature for paraH2 (upper panel) and ortho-H2 (lower panel). Squares denote\nquantum results by Phillips et al. (1996); stars refer to the quantum calculations of Dubernet et al.; dashed lines denote quantum (scaled) results of Green et al. (1993) for H2 O−He; circles with error bars (95% statistical confidence level) give the\npresent QCT results. See text for details. Note that the transition\n303 → 101 is not plotted for clarity.\n\n3.2. Accuracy and propensity rules\n\nThe above observations obviously hold for other initial levels\nand, from numerous comparisons, we estimate the QCT results\nto be accurate within a factor of 1−3 for the largest rates, i.e.\nthose larger than a few 10−12 cm3 s−1 , as observed in Faure et al.\n(2006). For smallest rates, errors larger than a factor of 3 can be\nencountered, illustrating the inability of classical mechanics to\nreproduce small probability events. As a result, rates less than ∼\n10−12 cm3 s−1 , which correspond to very poor statistics (zero or\nless than ∼10 events over 10,000), were set to zero. This means\nthat a significant number of transitions, the so-called classically\nforbidden or rare transitions, have null classical rates. Moreover,\nsome transitions were found to have null rates at 100 K but\nsignificant rates at higher temperatures. Our strategy to tackle\nthis problem was to retain transitions obeying the following two\ncriteria: the rate must be i) larger than 10−12 cm3 s−1 at 300 K\nand above and ii) larger than 10−11 cm3 s−1 at 2000 K. If one\nof the two criteria is not fulfilled, then the transition is classified as a rare event and the corresponding (scaled) H2 O−He\nrate is adopted. It should be noted that these rare events correspond in most cases to transitions with ∆J > 3 which are not\nexpected to play a dominant role in the radiative transfer equations (see Sect. 4). Moreover, despite the fact that no rigorous\n\n\fA. Faure et al.: Quasi-classical rate coefficient calculations for the rotational (de)excitation of H2 O by H2\n\nselection rules hold for molecule-molecule collisions, we actually observed the following propensity rules:\n∆J = 0, ±1;\n\n∆Ka = 0, ±1;\n\n∆Kc = 0, ±1,\n\n(6)\n\n5\n\nTable 1. Critical densities, in cm−3 , for (scaled) He, para-H2 and\northo-H2, as functions of temperature and for a set of representative H2 O levels. Powers of 10 are given in parentheses. See text\nfor details.\n\nwhich are consistent with the classical picture of a minimum reorientation of the angular momentum of a strongly asymmetrictop molecule4 . These rules are illustrated in Fig. 1 where the\ntransition 303 − 212 is indeed found to be strongly favoured.\n\nJKa Kc\n110\n\nT (K)\n100\n300\n1000\n\nHe\n1.3(08)\n5.7(07)\n3.0(07)\n\np-H2\n6.3(07)\n3.6(07)\n2.3(07)\n\no-H2\n3.0(07)\n2.5(07)\n2.2(07)\n\nHe/p-H2\n2.1\n1.6\n1.3\n\nHe/o-H2\n4.3\n2.3\n1.4\n\n3.3. Fitting procedure\n\n313\n\nFor use in astrophysical modelling, the transition rates R(Jα′ ′ →\nJα , T ) must be evaluated on a sufficiently fine temperature grid.\nFor this, the rates were first least-square fitted over 100−2000 K\nby the analytic form used by Faure et al. (2004):\n\n100\n300\n1000\n\n3.2(09)\n1.6(09)\n8.4(08)\n\n1.1(09)\n7.7(08)\n5.1(08)\n\n7.0(08)\n5.6(08)\n4.5(08)\n\n2.9\n2.1\n1.6\n\n4.6\n2.9\n1.9\n\n414\n\n100\n300\n1000\n\n6.6(09)\n3.2(09)\n1.5(09)\n\n2.5(09)\n1.5(09)\n9.3(08)\n\n1.4(09)\n1.1(09)\n8.2(08)\n\n2.6\n2.1\n1.6\n\n4.7\n2.9\n1.8\n\n515\n\n100\n300\n1000\n\n1.2(10)\n5.8(09)\n2.5(09)\n\n4.8(09)\n2.9(09)\n1.6(09)\n\n2.6(09)\n1.9(09)\n1.4(09)\n\n2.5\n2.0\n1.6\n\n4.6\n3.1\n1.8\n\n616\n\n100\n300\n1000\n\n2.3(10)\n1.0(10)\n4.1(09)\n\n8.6(09)\n4.9(09)\n2.5(09)\n\n4.2(09)\n3.1(09)\n2.1(09)\n\n2.7\n2.0\n1.6\n\n5.5\n3.2\n2.0\n\n1029\n\n100\n300\n1000\n\n2.0(11)\n6.9(10)\n2.0(10)\n\n4.0(10)\n1.9(10)\n8.5(09)\n\n9.8(09)\n8.1(09)\n6.3(09)\n\n5.0\n3.6\n2.4\n\n20.4\n8.5\n3.2\n\nlog10 R(Jα′ ′ → Jα , T ) =\n\nN\nX\n\na n xn ,\n\n(7)\n\nn=0\n\nwhere x = T −1/6 . A typical fitting accuracy of a few percent\nwas obtained. In the case of rare events with large error bars, the\nfitting method was also found to smooth the temperature dependence of the rates and thus remove irregularities caused by poor\nstatistics. Note that T =50 K was investigated only for a few levels and was not retained in the fitting procedure. We then evaluated the fitted rates at the following grid temperature values:\n100, 200, 400, 800, 1200, 1600 and 2000 K. From the H2 O−H2\ndata of Phillips et al. (1996), we observed the temperature dependence of de-excitation rates below 100 K to be very weak:\nde-excitation rates at 20 K are always within a factor of 2 of\nthose at 100 K. This is clearly illustrated in Fig. 1. Below 100 K,\na flat temperature dependence of the de-excitation rate was thus\nassumed, except for the lowest five para- and five ortho-H2O levels for which the values at 20 K were taken from the quantum\nCC results of Dubernet et al. (2006). Such a flat low temperature dependence actually reflects the influence of the deep potential well of the H2 O−H2 PES (∼ 235 cm−1 ) which supports\nlarge shape resonances, in contrast to H2 O−He (∼ 35 cm−1 ).\nObviously, the above low temperature extrapolation procedure\nintroduces errors but these are believed not to exceed a factor of\n2−3 for the largest rates. The complete set of de-excitation rates\namong all 45 para- and ortho-H2O levels between 20 and 2000 K\nare provided as online material and will be made available in\nthe BASECOL database (http://www.obspm.fr/basecol/).\nExcitation rates can be obtained from the detailed balance relation, Eq. (5).\nIn order to assess quantitatively the impact of the new\nH2 O−H2 collisional rates on water emission, detailed radiative\ntransfer studies adapted to various astronomical environments\nare required. In Sect. 4 below, this impact is investigated for a\nrange of density and temperature conditions by neglecting all\nexcitation mechanisms other than collisions. A first-order indicator is also provided by the impact of rates on critical densities.\nFor a multi-level system, the critical density of a given partner\n(here para- or ortho-H2) is usually defined, in the optically thin\ncase, given that the density at which the sum of the collisional\nde-excitation rates of a given level is equal to the sum of the\nspontaneous radiative de-excitation rates:\nP\n′\nJα′ ′ A(Jα → Jα′ )\nncr (Jα , T ) = P\n.\n(8)\n′\nJα′ ′ R(Jα → Jα′ , T )\n\n4\nIn the case of a slightly asymmetric-top such as H2 CO, Ka and Kc\nare further constrained by the value of J.\n\nWhen the colliding partner has a density n ≫ ncr , collisions\nmaintain rotational levels in LTE at the kinetic temperature while\nfor densities n . ncr , deviations from LTE including population\ninversions are expected. Eq. (8) was computed with the present\ncollisional rates for para-H2 and ortho-H2 and with the scaled\nH2 O−He rates of Green et al. (1993). Einstein coefficients were\ntaken from the Jet Propulsion Laboratory catalogue. Results are\npresented in Table 1 for 6 representative water levels, namely\nthe upper level of the 557 GHz transition (110 − 101 ) and the upper levels of maser transitions known to be collisionally pumped\n(Yates et al. 1997): the 183 GHz line (313 − 220 ), the 380 GHz\nline (414 − 321 ), the 325 GHz line (515 − 422 ), the 22 GHz line\n(616 − 523 ) and the 321 GHz line (1029 − 936 ). Note that maser\ntransitions are expected to be quite sensitive to relatively small\ndifferences in collisional rates. As illustrated in Table 1, critical\ndensities for H2 are decreased with respect to the scaled He values by a typical factor of 2−5 at 100 K and by a factor of 1−3 at\nhigher temperatures. These differences are still modest (with the\nexception of 1029 ) because collisional rates are summed over all\npossible downward transitions, thus averaging the impact of the\nnew rates. Larger differences in the emission line fluxes are however expected as individual state-to-state collisional rates, in particular with ortho-H2, can exceed the scaled He values by more\nthan an order of magnitude. This is demonstrated in Sect. 4. We\nconclude that using the new H2 O−H2 collisional rates, non-LTE\neffects including population inversions will be quenched at lower\nH2 densities, especially in regions where the H2 ortho/para ratio\nis large.\n\n4. Modelling of water emission\nIn this section we explore, by means of a LVG code, the impact of the new computed collisional coefficients on the theoretical predictions of water line emission. The code is adapted\nfrom the one described in Ceccarelli et al. (2002). It refers to\n\n\f6\n\nA. Faure et al.: Quasi-classical rate coefficient calculations for the rotational (de)excitation of H2 O by H2\n\na semi-infinite isodense and isothermal slab (plane-parallel geometry). The code solves self-consistently the statistical level\npopulations and the radiative transfer equations under the approximation of the escape probability, assuming a gradient in the\nvelocity field (Capriotti 1965). We consider the first 45 levels of\nboth ortho- and para-H2 O separately. The computed line spectrum depends on a few basic parameters: the density of the colliders (H2 ), the temperature of the emitting gas, the water column\ndensity and the maximum gas velocity. To have a relatively exhaustive study, we explored a large parameter space. We varied\nthe H2 density between 104 and 1010 cm−3 ; the kinetic temperature between 20 and 2000 K; the water column density between\n1010 and 1015 cm−2 , keeping the velocity equal to 1 km/s. Note\nthat the velocity only enters in the line opacity, coupled with the\nH2 O column density. In the present study we considered specifically the case of optically thin lines (the low H2 O column density case), and the case where the lines are optically thick (the\nhigh H2 O column density case). In both cases, depending on the\ngas density, the collisional coefficients may play a major role in\nthe predicted flux. Indeed, even in the case of strongly optically\nthick lines, the lines could be \"effectively optically thin\" if the\nlevels are very sub-thermally populated, as is often the case for\nwater lines. Finally, since the scope of this study is to understand\nthe impact of the newly computed collisional coefficients in the\nline predictions, compared to the old ones, we did not consider\nthe pumping of the levels by infrared and submillimetre radiation, which would unnecessarily complicate the problem.\nWe compared the results of the LVG computations with three\nsets of collisional data: the scaled H2 O-He rates of Green et al.\n(1993) between 20 and 2000 K, the H2 O−H2 rates of Phillips\net al. (1996) between 20 and 140 K and the present H2 O−H2\nclassical rates beween 20 and 2000 K. The results of this comparison are reported in Fig. 2, where we show the line flux ratios for ortho-H2O at representative densities and temperatures.\nCollision rates with ortho-H2 only are considered to simplify the\ninterpretation. The H2 O column density is fixed at 1015 cm−2 . It\ncan be observed that LVG fluxes based on the classical rates are\nincreased up to a factor of 10 with respect to LVG fluxes based\non the scaled H2 O−He rates of Green et al. (1993). Even larger\ndifferences were observed at lower temperatures. Second, LVG\nfluxes based on the classical rates are very similar to those based\non the rates of Phillips et al. (1996), with flux ratios close to 1.\nThese findings clearly reflect the differences in collision rates,\nsuch as those illustrated in Fig. 1. They also show that differences in rates are not amplified within the radiative transfer equations. In particular, it is worth noting that the typical increase of\nfluxes at 1000 K is less than a factor of 2 at the investigated\ndensities. Similar results were obtained with para-H2 , especially\nabove 300 K where differences between para- and ortho-H2 rates\nare minor. We note, however, that below 100 K, the classical\npara-H2 rates are not necessarily more accurate than the scaled\nH2 O−He rates. Third, we observe that the flux ratios rise steeply\nwith increasing upper energies. This is expected since the critical\ndensities are larger for higher levels and, therefore, the impact of\ncollision rates, i.e. non-LTE effects, becomes more pronounced.\nFinally, when the temperature increases, the impact of collision\nrates is reduced, partly because the low lying levels become thermalized and partly because the differences in rates decrease. It\nshould be noted, however, that at densities higher than 108 cm−3 ,\nlarge flux ratios (∼ 10) were still observed at 1000 K for high\nlying levels.\nWe also tested the influence of the scaled H2 O−He rates\nemployed as substitutes for H2 rates in the case of classicallyforbidden transitions. These rates, which generally correspond\n\nto ∆J > 3 and are lower than 10−12 cm3 s−1 , were found to play\na minor role, especially at low temperatures (T ≤300 K). This\nsuggests that the radiative transfer equations are above all sensitive to the largest rates. These findings however merit further\ninvestigation.\n\n5. Conclusions\nWe have computed classical rate coefficients for rotational deexcitation among the lowest 45 para and 45 ortho rotational levels of H2 O colliding with both para and ortho-H2 in the temperature range 20−2000 K. Trajectories were run on a recent highaccuracy H2 O−H2 PES using a canonical Monte-Carlo sampling. H2 molecules were assumed to be rotationally thermalized\nat the kinetic temperature. By comparison with quantum calculations available for low lying levels, classical rates were found to\nbe accurate within a factor of 1−3 for the dominant transitions,\ni.e. those with rates larger than a few 10−12 cm3 s−1 . Large differences with the scaled H2 O−He rates of Green et al. (1993) were\nobserved and emission line fluxes were shown to be increased by\nup to a factor of 10. The present classical rates should therefore\nbe adopted in any detailed population model of water in warm\nand hot environments.\nIt should be noted, however, that quantum CC calculations\nare currently in progress (Dubernet and co-workers) and quantum rates will ultimately replace the classical rates. It will thus\nbe possible in future studies to further test the sensitivity of water emission to uncertainties in the collision rates and to identify,\nfor example, physical regimes where classical rates are of sufficient accuracy. We also stress that the QCT method is currently\nthe only practical approach to investigate very high rotational angular momenta. For example, water in supergiant stars has been\nobserved through levels with rotational quantum number J up to\n23 (e.g. Jennings & Sada 1998). In order to assess non-LTE effects in such environments, classical calculations might provide\nprecious information. Finally, we note that the first excited vibrational level of water lies only 2300 K above the ground state and\nit has been detected in several sources (e.g. Menten et al. 2006).\nRate coefficients for the total vibrational relaxation of H2 O by\nH2 molecules have been computed by Faure et al. (2005a) and\nsome \"J-resolved\" cross sections can be found in Faure et al.\n(2005b). Rovibrational state-to-state rates are however unknown\nand will be considered in future works.\nAcknowledgements. All QCT calculations were performed on the Service\nCommun de Calcul Intensif de l'Observatoire de Grenoble with the valuable\nhelp from F. Roch. This research was supported by the CNRS national program\n\"Physique et Chimie du Milieu Interstellaire\" and by the FP6 Research Training\nNetwork \"Molecular Universe\" (contract number MRTN-CT-2004-512302).\n\nReferences\nBalakrishnan, N., Yan, M., & Dalgarno, A. 2002, ApJ, 568, 443\nBergin, E. A., & Snell, R. L. 2002, ApJ, 581, L105\nCapriotti, E. R. 1965, ApJ, 142, 1101\nCeccarelli, C., Hollenbach, D. J., & Tielens, A. G. G. M. 1996, ApJ, 471, 400\nCeccarelli, C., et al. 2002, A&A, 383, 603\nCecchi-Pestellini, C., Bodo, E., Balakrishnan, N., & Dalgarno, A. 2002, ApJ,\n571, 1015\nCernicharo, J., Thum, C., Hein, H., John, D., Garcia, P., & Mattioco, F. 1990,\nA&A, 231, L15\nCernicharo, J., Pardo, J. R., González-Alfonso, E., Serabyn, E., Phillips, T. G.,\nBenford, D. J., & Mehringer, D. 1999, ApJ, 520, L131\nCernicharo, J., & Crovisier, J. 2005, Space Science Reviews, 119, 29\nCernicharo, J., Pardo, J. R., & Weiss, A. 2006, ApJ, 646, L49\nCheung, A. C., Rank, D. M., Townes, C. H., Thornton, D. D., & Welch, W. J.\n1969, Nature, 221, 626\n\n\fA. Faure et al.: Quasi-classical rate coefficient calculations for the rotational (de)excitation of H2 O by H2\nDoty, S. D., & Neufeld, D. A. 1997, ApJ, 489, 122\nDubernet, M.-L., & Grosjean, A. 2002, A&A, 390, 793\nDubernet, M.-L., Daniel, F., Grosjean A., et al. 2006, A&A, 460, 323\nDutta, J. M., Jones, C. R., Goyette, T. M., & de Lucia, F. C. 1993, Icarus, 102,\n232\nFaure, A., Gorfinkiel, J. D., & Tennyson, J. 2004, MNRAS, 347, 323\nFaure, A., & Wiesenfeld, L. 2004, J. Chem. Phys., 121, 6771\nFaure, A., Valiron, P., Wernli, M., Wiesenfeld, L., Rist, C., Noga, J., & Tennyson,\nJ. 2005a, J. Chem. Phys., 122, 1102\nFaure, A., Wiesenfeld, L., Wernli, M., & Valiron, P. 2005b, J. Chem. Phys., 123,\n4309\nFaure, A., Wiesenfeld, L., Wernli, M., & Valiron, P. 2006, J. Chem. Phys., 124,\n214310\nFlower, D. R., Roueff, E., & Zeippen, C. J. 1998, J. Phys. B: At. Mol. Opt. Phys.,\n31, 1105\nGilijamse, J. J., Hoekstra, S., van de Meerakker, S. Y. T., Groenenboom, G. C.,\nMeijer, G., Science, 313, 1617\nGoddi, C., Moscadelli, L., Sanna, A., Cesaroni, R., & Minier, V. 2007, A&A,\n461, 1027\nGreen, S., Maluendes, S., & McLean, A. D. 1993, ApJS, 85, 181\nGrosjean, A., Dubernet, M.-L., & Ceccarelli, C. 2003, A&A, 408, 1197\nHjalmarson, Å., Frisk, U., Olberg, M., et al. 2003, A&A, 402, L39\nJennings, D. E., & Sada, P. V. 1998, Science, 279, 844\nKondratko, P. T., Greenhill, L. J., & Moran, J. M. 2006, ApJ, 652, 136\nLefloch, B., Cernicharo, J., Cabrit, S., Noriega-Crespo, A., Moro-Martı́n, A., &\nCesarsky, D. 2003, ApJ, 590, L41\nMandy, M. E., & Pogrebnya, S. K. 2004, J. Chem. Phys., 120, 5585\nMelnick, G. J., & Bergin, E. A. 2005, Advances in Space Research, 36, 1027\nMenten, K. M., Philipp, S. D., Güsten, R., Alcolea, J., Polehampton, E. T., &\nBrünken, S. 2006, A&A, 454, L107\nNeufeld, D. A., & Melnick, G. J. 1991, ApJ, 368, 215\nNeufeld, D. A., Melnick, G J., Sonnentrucker, P., et al. 2006, ApJ, 649, 816\nPhillips, T. R., Maluendes, S., McLean, A. D., & Green, S. 1994, J. Chem. Phys.,\n101, 5824\nPhillips, T. R., Maluendes, S., & Green, S. 1996, ApJS, 107, 467\nPoelman, D. R., & Spaans, M. 2005, A&A, 440, 559\nPoelman, D. R., Spaans, M., & Tielens, A. G. G. M. 2007, A&A, 464, 1023\nWernli, M., Wiesenfeld, L., Faure, A., & Valiron, P. 2007, A&A, 464, 1147\nWolniewicz, L., Simbotin, I., & Dalgarno, A. 1998, ApJS, 115, 293\nYates, J. A., Field, D., & Gray, M. D. 1997, MNRAS, 285, 303\n\n7\n\n\f8\n\nA. Faure et al.: Quasi-classical rate coefficient calculations for the rotational (de)excitation of H2 O by H2\n6\n\n-3\n\n8\n\nn=10 cm\n\n-3\n\nn=10 cm\n\n10\nT=100K\n1\n0.1\nFlux ratio\n\n10\nT=300K\n1\n0.1\n10\nT=1000K\n1\n0.1\n10\n\n100\n\n10\n\n100\n\n1000\n\n-1\n\nUpper level energy (cm )\nFig. 2. Emission line flux ratios from LVG modelling as functions of the upper energy levels of ortho-H2 O for representative\ndensities and temperatures. Three differents sets of collision rates were employed (see text for details). The H2 O column density is\nfixed at 1015 cm−2 . Squares denote the ratios between LVG fluxes based on the classical rates and LVG fluxes based on the H2 O−H2\nrates of Phillips et al. (1996). Diamonds and stars give the ratio between LVG fluxes based on the classical rates and LVG fluxes\nbased on the scaled H2 O−He rate of Green et al. (1993). Diamonds correspond to transitions whose fluxes are larger than 1% of the\ntotal flux; stars correspond to the radio transitions at 22 and 380 GHz.\n\n\f"}