{"id": "http://arxiv.org/abs/0801.2629v2", "guidislink": true, "updated": "2012-01-23T09:15:39Z", "updated_parsed": [2012, 1, 23, 9, 15, 39, 0, 23, 0], "published": "2008-01-17T08:00:43Z", "published_parsed": [2008, 1, 17, 8, 0, 43, 3, 17, 0], "title": "Anomalous thermoelectric power of Mg1-xAlxB2 system with x = 0.0 to 1.0", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0801.1650%2C0801.1687%2C0801.1517%2C0801.4124%2C0801.3723%2C0801.3429%2C0801.1069%2C0801.0951%2C0801.3383%2C0801.1377%2C0801.2448%2C0801.2721%2C0801.0141%2C0801.2346%2C0801.3753%2C0801.1280%2C0801.0140%2C0801.2073%2C0801.2629%2C0801.2535%2C0801.3686%2C0801.3986%2C0801.0777%2C0801.3528%2C0801.2766%2C0801.4879%2C0801.4341%2C0801.4340%2C0801.3968%2C0801.3553%2C0801.2650%2C0801.2534%2C0801.2642%2C0801.0343%2C0801.3288%2C0801.0563%2C0801.3824%2C0801.3561%2C0801.1673%2C0801.3700%2C0801.4081%2C0801.3745%2C0801.1174%2C0801.2508%2C0801.4572%2C0801.0743%2C0801.0128%2C0801.3488%2C0801.2857%2C0801.2987%2C0801.2197%2C0801.4700%2C0801.2916%2C0801.3599%2C0801.4841%2C0801.0298%2C0801.0018%2C0801.2982%2C0801.4435%2C0801.2130%2C0801.3739%2C0801.0005%2C0801.0570%2C0801.1629%2C0801.0611%2C0801.2083%2C0801.0715%2C0801.4378%2C0801.0124%2C0801.1730%2C0801.4036%2C0801.4709%2C0801.2992%2C0801.4671%2C0801.0655%2C0801.3903%2C0801.2050%2C0801.2929%2C0801.3681%2C0801.1574%2C0801.4403%2C0801.4271%2C0801.4586%2C0801.4219%2C0801.2387%2C0801.4763%2C0801.1921%2C0801.3316%2C0801.3248%2C0801.3214%2C0801.0979%2C0801.4908%2C0801.1279%2C0801.4892%2C0801.1215%2C0801.3434%2C0801.3907%2C0801.0420%2C0801.2306%2C0801.1958%2C0801.3473&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Anomalous thermoelectric power of Mg1-xAlxB2 system with x = 0.0 to 1.0"}, "summary": "Thermoelectric power, S(T) of the Mg1-xAlxB2 system has been measured for x =\n0.0, 0.1, 0.2, 0.4, 0.6, 0.8 and 1.0. XRD, resistivity and magnetization\nmeasurements are also presented. It has been found that the thermoelectric\npower is positive for x = 0.4 and is negative for x = 0.6 over the entire\ntemperature range studied up to 300 K. The thermoelectric power of x = 0.4\nsamples vanishes discontinuously below a certain temperature, implying\nexistence of superconductivity. In general, the magnitude of the thermoelectric\npower increases with temperature up to a certain temperature, and then it\nstarts to decrease towards zero base line. In order to explain the observed\nbehavior of the thermoelectric power, we have used a model in which both\ndiffusion and phonon drag processes are combined by using a phenomenological\ninterpolation between the low and high temperature behaviors of the\nthermoelectric power. The considered model provides an excellent fit to the\nobserved data. It is further found that Al doping enhances the Debye\ntemperature.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0801.1650%2C0801.1687%2C0801.1517%2C0801.4124%2C0801.3723%2C0801.3429%2C0801.1069%2C0801.0951%2C0801.3383%2C0801.1377%2C0801.2448%2C0801.2721%2C0801.0141%2C0801.2346%2C0801.3753%2C0801.1280%2C0801.0140%2C0801.2073%2C0801.2629%2C0801.2535%2C0801.3686%2C0801.3986%2C0801.0777%2C0801.3528%2C0801.2766%2C0801.4879%2C0801.4341%2C0801.4340%2C0801.3968%2C0801.3553%2C0801.2650%2C0801.2534%2C0801.2642%2C0801.0343%2C0801.3288%2C0801.0563%2C0801.3824%2C0801.3561%2C0801.1673%2C0801.3700%2C0801.4081%2C0801.3745%2C0801.1174%2C0801.2508%2C0801.4572%2C0801.0743%2C0801.0128%2C0801.3488%2C0801.2857%2C0801.2987%2C0801.2197%2C0801.4700%2C0801.2916%2C0801.3599%2C0801.4841%2C0801.0298%2C0801.0018%2C0801.2982%2C0801.4435%2C0801.2130%2C0801.3739%2C0801.0005%2C0801.0570%2C0801.1629%2C0801.0611%2C0801.2083%2C0801.0715%2C0801.4378%2C0801.0124%2C0801.1730%2C0801.4036%2C0801.4709%2C0801.2992%2C0801.4671%2C0801.0655%2C0801.3903%2C0801.2050%2C0801.2929%2C0801.3681%2C0801.1574%2C0801.4403%2C0801.4271%2C0801.4586%2C0801.4219%2C0801.2387%2C0801.4763%2C0801.1921%2C0801.3316%2C0801.3248%2C0801.3214%2C0801.0979%2C0801.4908%2C0801.1279%2C0801.4892%2C0801.1215%2C0801.3434%2C0801.3907%2C0801.0420%2C0801.2306%2C0801.1958%2C0801.3473&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Thermoelectric power, S(T) of the Mg1-xAlxB2 system has been measured for x =\n0.0, 0.1, 0.2, 0.4, 0.6, 0.8 and 1.0. XRD, resistivity and magnetization\nmeasurements are also presented. It has been found that the thermoelectric\npower is positive for x = 0.4 and is negative for x = 0.6 over the entire\ntemperature range studied up to 300 K. The thermoelectric power of x = 0.4\nsamples vanishes discontinuously below a certain temperature, implying\nexistence of superconductivity. In general, the magnitude of the thermoelectric\npower increases with temperature up to a certain temperature, and then it\nstarts to decrease towards zero base line. In order to explain the observed\nbehavior of the thermoelectric power, we have used a model in which both\ndiffusion and phonon drag processes are combined by using a phenomenological\ninterpolation between the low and high temperature behaviors of the\nthermoelectric power. The considered model provides an excellent fit to the\nobserved data. It is further found that Al doping enhances the Debye\ntemperature."}, "authors": ["Monika Mudgel", "V. P. S. Awana", "R. Lal", "H. Kishan", "L. S. Sharth Chandra", "V. Ganesan", "A. V. Narlikar", "G. L. Bhalla"], "author_detail": {"name": "G. L. Bhalla"}, "author": "G. L. Bhalla", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1088/0953-8984/20/9/095205", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/0801.2629v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0801.2629v2", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "19 pages Text + Figs.\n  suggestions/comments(awana@mail.nplindia.ernet.in)", "arxiv_primary_category": {"term": "cond-mat.str-el", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cond-mat.str-el", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "cond-mat.supr-con", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0801.2629v2", "affiliation": "Univ. Delhi, India", "arxiv_url": "http://arxiv.org/abs/0801.2629v2", "journal_reference": "Phys. Cond. Matt. 20, 095205 (2008)", "doi": "10.1088/0953-8984/20/9/095205", "fulltext": "For correct citation of the MS Please look for J. Phys. Cond. Mat t & search Awana\n\nAnomalous thermoelectric power of Mg1-xAlxB2 system with x = 0.0 to 1.0\nMonika Mudgel, V. P. S. Awana, * R. Lal, and H. Kishan\nSuperconductivity and Cryogenics Division, National Physical Laboratory, Dr. K.S. Krishnan\nMarg, New Delhi-110012, India\nL. S. Sharth Chandra, V. Ganesan and A.V. Narlikar\nUGC-DAE Consortium for Scientific Research, University Campus, Khandwa Road, Indore452017, India\nG. L. Bhalla\nDepartment of Physics and Astrophysics, University of Delhi, Delhi-110007, India\nAbstract\nThermoelectric power, S(T) of the Mg1-xAlxB2 system has been measured for x = 0.0, 0.1,\n0.2, 0.4, 0.6, 0.8 and 1.0. XRD, resistivity and magnetization measurements are also\npresented. It has been found that the thermoelectric power is positive for x ≤ 0.4 and is\nnegative for x ≥ 0.6 over the entire temperature range studied up to 300 K. The\nthermoelectric power of x ≤ 0.4 samples vanishes discontinuously below a certain\ntemperature, implying existence of superconductivity. In general, the magnitude of the\nthermoelectric power increases with temperature up to a certain temperature, and then it\nstarts to decrease towards zero base line. In order to explain the observed behavior of the\nthermoelectric power, we have used a model in which both diffusion and phonon drag\nprocesses are combined by using a phenomenological interpolation between the low and high\ntemperature behaviors of the thermoelectric power. The considered model provides an\nexcellent fit to the observed data. It is further found that Al doping enhances the Debye\ntemperature.\n\nPACS Nos. 74.25.fy, 74.62.Dh, 74.70.Ad\nKeywords: MgB2 superconductor,\nTemperature, Phonon contribution\n\nAl\n\nsubstitution,\n\nThermoelectric power,\n\nDebye\n\n*: Corresponding author for further queries: Dr. V.P.S. Awana\nFax No. 0091-11-25726938: Telephone. 0091-11-25748709\ne-mail: awana@mail.nplindia.ernet.in\nWeb page: www.freewebs.com/vpsawana/\n1\n\n\fI. INTRODUCTION\nWith the advent of high temperature superconductivity in 1986 [1] the possibility of\nelectron–phonon interaction as a superconductivity mechanism became scant. However, the\nsituation changed after the discovery of superconductivity at 39 K in MgB2 [2], where it was\nrealized that mechanism of superconductivity could yet be based on the electron-phonon\ninteraction within the strong coupling limits [3]. This was perceived from the fact that both\nMg and B being light elements their lattice contributions could be sufficiently strong to\npromote the relatively high Tc observed [4]. Besides, the lattice of MgB2 is stretched in cdirection in comparison to other same structure borides viz., TaB2, AlB2, ZrB2 or MoB2 [57]. Stretched lattice may result in its instability and hence further more contribution to\nphonon interaction. It seems, the basic stretched lattice structure of MgB2 being constructed\nfrom relatively lighter elements Mg and B is responsible for strong electron-phonon\ninteraction. MgB2 possess simple hexagonal AlB2-type structure with space group P6/mmm.\nIt contains the graphite-type boron layers, which are separated by hexagonal close-packed\nlayers of magnesium. The magnesium atoms are located at the center of hexagons formed by\nboron. The spacing between the boron planes is significantly larger than the in-plane B-B\nspacing. In fact, the characteristic c/a ratio is ~ 1.14 in MgB2, while it is ~ 1.08 in AlB2.\nAnother important difference between MgB2 and AlB2 is that in MgB2 the cation\n(Mg2+) is divalent while in AlB2 the cation (Al3+) is trivalent. This means that if we gradually\nreplace Mg by Al, the population of the holes in the two-dimensional (2D) σ-band will start\ndecreasing. In fact, it has been shown by band structure calculations that the σ-band is placed\nlower than the Fermi energy in AlB2 [3,8]. So substitution of Mg by Al will fill the σ-band\ncompletely (with electrons) even before a 100% substitution level. In this situation, only πband will take part in various physical processes so that the system will no more be a twoband (σ-band and π-band) system. This two-band to one-band system crossover by\nincreasing substitution of Mg by Al in MgB2 prompted us to carry out the present study of\nMg1-xAlxB2 system for x = 0.0 to x = 1.0. Earlier reports on Mg1-xAlxB2 were limited to x ≤\n0.4 [5], x ≤ 0.1 [9] and x ≤ 0.5 [10] only. Slusky et al [5] have studied crystal structure and\nmagnetization of Mg1-xAlxB2 for x ≤ 0.4. Their main finding is that Al doping near 10%\ncauses partial collapse of the spacing between boron layers and that the superconductivity\n2\n\n\fhas a close connection with such a structural instability. Lorenz et al [9] have measured the\nthermoelectric power (TEP) of the Al-substituted samples up to x = 0.1. They made an effort\nto explain the observed behavior of TEP on the basis of the parabolic one-band model. Very\nrecently, Monika et al [10] have presented a detailed X-ray diffraction study along with the\nresistivity and magnetization measurements for the Mg1-xAlxB2 for x ≤ 0.5. Mainly the\nexistence of superstructure is shown in the Mg0.5Al0.5B2 system.\nIn this paper we focus on the thermoelectric power of Mg1-xAlxB2 for Al\nconcentrations ranging from x = 0.0 to x = 1.0. This wide range of x values allow us to study\nthe behavior of Mg1-xAlxB2 system for varying contributions of the σ - band. Recently Souma\nand Takahashi [11] (cf. Figs. 1 & 4 of these authors) had shown the π-band structure to be\nessentially same for both MgB2 and AlB2. So, we can consider the contributions of the πband to be similar for all x. As mentioned above, TEP of Mg1-xAlxB2 has been observed\nearlier also [9] but for x ≤ 0.1. We shall not only present TEP data for Mg1-xAlxB2 for a much\nwider range of x (0.0 ≤ x ≤ 1.0) but we shall also provide a reasonable explanation of the\nTEP behavior. In fact the explanation of the TEP behavior given by Lorenz et al [9] for the\nMg1-xAlxB2 system and also by Gahtori et al for the Mg1-xFexB2 system [12] seems defective\nbecause of the following reasons. (1) The linear theoretical fits based on the parabolic one\nband model used by these authors do not pass through the origin of the temperature-TEP\nplane. This amounts to inconsistency because according to Eq. (3) of Lorenz et al and Eq.\n(12) of Gahtori et al [12], TEP should vanish for zero temperature. On the other hand, Lorenz\net al find S = -1.0μV/K for T=0, and Gahtori et al find S = -1.2μV/K for T=0 for their\nrespective MgB2 samples. (Here S denotes TEP and T denotes temperature). These values are\nquite significant as the TEP of MgB2 is of the order of 1.0 μV/K (near 50 K) for both the\ncases. (2) The agreement between the theoretical model and experimental results tends to\nbecome poorer with increasing temperature within the one-band model employed by Lorenz\net al and Gahtori et al (cf. Fig. 2 of Ref. [9] and Fig. 3 of Ref. [12]). For a realistic\nexplanation of the TEP, we, in the present paper, shall consider the phonon drag contribution\nalso. Apart from this, we shall also consider the high-T behavior of the TEP simultaneously.\n\n3\n\n\fII. EXPERIMENTAL DETAILS\nPolycrystalline Mg1-xAlxB2 samples with x = 0.0, 0.10, 0.20, 0.40, 0.60, 0.80 and 1.0\nare synthesized by solid-state reaction route with ingredients of Mg, B, and Al. The Mg\npowder used is from Reidel-de-Haen of assay 99%. B powder is amorphous and Fluka\nmake of assay 95-97%. The Al powder is from Reidel-de-Haen with above 93% assay. For\nsynthesis of Mg1-xAlxB2 samples, the nominal weighed samples are ground thoroughly,\npalletized, encapsulated in soft iron tube and put in a programmable furnace under flow of\nArgon at one atmosphere pressure. The temperature of furnace is programmed to reach\n8500 C over 2 hours, hold at same temperature for two and a half hours, and subsequently\ncooled to room temperature over a span of 6 hours in the same Argon atmosphere. X- ray\ndiffraction patterns were taken using Ni Filtered CuKα radiation. Resistivity measurements\nwere carried out by conventional 4-probe method. Thermoelectric power measurements\nwere carried out by dc differential technique over a temperature range of 5 – 300 K, using a\nhome made set up. Temperature gradient of ~1 K was maintained throughout the TEP\nmeasurements. Magnetization measurements are carried out with a Quantum-Design\nSQUID magnetometer MPMS-7.\n\nIII. RESULTS AND DISCUSSION\nRoom temperature X-ray diffraction (XRD) patterns for the Mg1-xAlxB2 with x = 0.0\nto 1.0 are shown in Fig. 1. All the samples crystallize in simple hexagonal AlB2-type\nstructure with space group P6/mmm. For pristine sample all characteristic peaks are indexed\nwhich are in well corroborated by literature [2,4,5,10]. With successive substitution of Al at\nMg site in Mg1-xAlxB2, till x = 0.40, though the structure (hexagonal) and space group\nP6/mmm remain the same, all the XRD peak positions are shifted towards higher angle side,\nindicating a decrease in lattice parameters. The upper and lower insets of Fig. 1 show shifts\nof (002) and (100) peak confirming the decrease of a and c parameter. For MgB2; a=3.0857Å\n& c= 3.5230 Å, while for AlB2; a = 3.0036 Å & c = 3.2519 Å. For other samples of the series\nboth a and c lattice parameters have intermediate values according to Al content in them. The\nstructural anomaly related with broadening of (002) peak up to x = 0.50 is described in detail\n4\n\n\fby us elsewhere [10]. Here we have analyzed the samples up to full Al substitution. Beyond x\n= 0.50, some additional phases arise, as shown by * in Fig. 1, which might be due to AlB4.\nResistivity versus temperature plots of the Mg1-xAlxB2 series with x = 0.0, 0.10, 0.20,\n0.40, 0.60, 0.80 & 1.0 are shown in Fig. 2. In the normal state i.e. above Tc, all samples show\nmetallic behavior. The normal state ρ-T plot of our pure MgB2 corresponds to ρ(300)/ρ(Tc) ∼\n3, which agrees with that for the MgB2 samples of Lorenz et al [9] and Gahtori et al [12].\nCritical temperature Tc (ρ = 0) for pristine sample is about 38 K. As we substitute Al, loss of\nsuperconductivity is observed in terms of decreasing critical temperatures [9,13,14]. In fact\nTc is 34, 30 & 7 K for Al content of 10%, 20% and 40% respectively. This means that, there\nis slow decrease in Tc up to x = 0.20, which is followed by relatively much sharper\ndecrement till x = 0.40. The samples are no longer superconducting (ρ =0) beyond x = 0.40,\nwhile sample with x = 0.60 exhibits a Tconset only. The superconducting transition width is\nsmall up to x = 0.20 samples, but for x = 0.40 sample, Tconset is 26.2 K, while Tc (ρ = 0) is\nonly 6.9 K. No superconductivity (in terms of ρ =0) is observed in Mg0.5Al0.5B2 sample &\nbeyond that. magnetization measurements (χ - T) for Mg1-xAlxB2 series with x = 0.0, 0.04,\n0.10, 0.20, 0.25 and 0.40 are shown in the inset of Fig. 2. The critical temperatures obtained\nfrom here (Tcdia) are in close agreement with the critical temperature (Tc\n\nρ=0\n\n) obtained from\n\nresistivity measurements except in the case of x = 0.40 for which a broad transition is seen\nand the saturation of moment is not seen down to 5 K. Qualitatively both ρ - T and χ - T\nmeasurements confirm a similar decrease in Tc with Al doping. The decrease of Tc with Al\ncan easily be explained in terms of electron doping. Each Al atom provides an extra electron\nand results in the hole band filling. Electron doping raises the Fermi level to higher energies\nand hence density of states decreases at Fermi Level, which results in loss of\nsuperconductivity. It is believed that superconductivity in Mg1-xAlxB2 is due to electronphonon interaction, and that the Tc suppression due to increasing Al is caused by the\nlowering of the σ-band [8]. Moreover, Lattice parameters also decrease continuously with Al\ndoping. The c/a value for MgB2 is 1.14 while the same is just 1.08 for AlB2. So the AlB2\nlattice is quite compressed in comparison to MgB2 This lattice strain also affects the electron\nphonon interactions and hence may be a secondary reason for the suppression of\nsuperconductivity.\n5\n\n\fThe measured thermoelectric power of the Mg1-xAlxB2 samples for x = 0.0, 0.1, 0.2,\n0.4, 0.6, 0.8 and 1.0 are presented in Fig. 3 by using different symbols for different samples.\nFor low x, i.e., x < 0.4, the behavior of the TEP is similar to that of the Mg1-xAlxB2 samples\nof Lorenz et al [9], and to that of the Mg1-xFexB2 samples of Gahtori et al [12]. In particular,\nthere is signature of superconductivity in the behavior of TEP for the x ≤ 0.4 samples. This is\nconsistent with the magnetization and resistivity measurements shown in Fig. 2. The TEP of\nthe x ≥ 0.6 samples is negative for all the considered temperature values, signifying the\nineffectiveness of the hole based σ-band. Also the TEP of the x ≥ 0.6 samples does not show\nany feature of superconductivity.\nIn order to explain the observed behavior of TEP of the present Mg1-xAlxB2 samples,\nwe notice that in general this system involve two bands – the σ-band and the π-band. It is\nbelieved that the σ-band is primarily responsible for the occurrence of the superconductivity\n[8]. Then, since the observed behavior of TEP involves the effect of superconductivity (for x\n≤ 0.4), we may say that σ-band holes provide essential contribution to the TEP values in this\ndoping range. Since, for higher x, the extra electrons donated by Al tend to make the σ-band\nineffective beyond a certain doping level of Al, hence it may be argued that the TEP of the x\n> 0.4 samples will arise due to the π-band only. The features of the π-band are reported\nsimilar in MgB2 and AlB2 [11], this we will use below for setting a reasonable expression of\nthe TEP.\nTheoretically, two processes contribute to the TEP. The first is the diffusion process,\nand second is the phonon drag process. The contribution to TEP due to diffusion process is\ngiven by the Mott formula [15]\nSd = (π2kB2T/3e)[∂lnσ(ω)/∂ω]EF\n\n(1)\n\nHere kB is the Boltzmann constant, e is carrier charge, σ (ω) is conductivity corresponding to\nthe electron energy ω, and EF is Fermi Energy. In the low temperature limit, the carrier\nrelaxation time is limited by impurity scattering. From the extrapolation of the resistivity of\nMg1-xAlxB2 (shown in Fig.2) to zero temperature, it turns out that the present samples\ncorrespond to significant resistivity at zero temperature. This means that there is an essential\n6\n\n\fpresence of impurity scattering in the present samples. Thus for low temperatures, where\nphonons have not yet started to play a significant role, we can use the conductivity formula\n[16]\nσ = ne2τ/m\n\n(2)\n\nHere n is carrier density, τ is carrier relaxation time and m is carrier mass. For a three\ndimensional system, it is well known that Eqs. (1) and (2) lead to Eq. (3) below [15]\n\nSd = π2kB2T/3eEF\n\n(3)\n\nIn order to obtain an expression for diffusion thermoelectric power corresponding to a\ntwo-dimensional band, we follow the same steps as used in arriving at Eq. (3) from Eqs. (1)\nand (2). We use the 2D form of σ from Eq. (2c) of Fukuyama [16] and find that formally Eq.\n(3) is valid for the 2D band also. We emphasize that this is only for parabolic 2D and 3D\nbands. The result may be different for other band structures. Since the TEP is additive (cf. Eq\nH8 of Bailyn [17]), the combined contribution of the 3D π-band and 2D σ-band of the Mg1xAlxB2\n\nto TEP may be written as\nSd = (π2kB2T/3e)(Wσ-1-Wπ-1) = AT\n\n(4)\n\nHere Wσ is the separation of the Fermi level from the bottom of the hole-like σ-band, and Wπ\nis the separation of the Fermi level from the bottom of the π-band. A is a constant,\nindependent of temperature. From the band structure calculations of An and Pickett [8], one\nfinds that Wσ =0.72 eV, and Wπ =7.4 eV. This means that the contribution of the π–band\nelectrons to Sd is about 10 times smaller than that of the σ–band holes.\nAs mentioned in introduction, the diffusion contribution to TEP leads to inconsistent\nexplanation of the reported data [9,12]. In fact, we obtain TEP approximately equal to –\n1.0μV/K for T = 0, while it should have vanished according to Eq. (4) used in Refs. [9] and\n[12]. Since Eq. (4) is justified for T→0, and also we get inconsistency by the use of Eq. (4), it\nbecomes necessary to consider the phonon drag contribution along with the diffusion term to\nthe thermoelectric power. For the 3D π-band the phonon drag contribution will vary like T3\n7\n\n\ffor low T [18], and like T-1 for high T [19]. Though for the intermediate temperature values,\nthe behavior of the phonon drag TEP is given by a very complicated expression [17, 19], but\nstill the same varies smoothly from low T values to the high T values. We thus hope that a\nsimple interpolation will provide a reasonable phenomenology of the variation of the phonon\ndrag contribution to TEP from T→0 to T→∞. Since TEP varies as T3 for T→0 and as T-1 for\nT→∞, we consider the interpolation\nSpd, π = T3/(B+CT4)\n\n(5)\n\nfor the 3D π- band. Here the suffix 'pd' on S implies phonon-drag and the suffix 'π' implies\nthe 3D π- band.\nFrom Eq. (5), we see that, Spd,π→T3/B for T→0. Here B should vary like θD3 [18].\nHere θD is the Debye temperature. C is also a constant, but not dependent on θD.\nIn order to work out an expression for the phonon drag contribution of the 2D σ-band,\nwe notice that the 2D character of the σ-band will allow the phonons to drag only in a 2D\nplane. As a result of this, the reason that led to a T3 variation of the phonon drag contribution\nfrom a 3D band, will lead to a T2 variation for a 2D band. Thus using the interpolation\nsimilar to that of Eq. (5), we may express the phonon drag TEP due to the σ-band by\nSpd, σ = T2/(D+ET3)\n\n(6)\n\nNotice that here D is expected to vary like vary like θD2. However, since the σ-band\nchanges with Al doping in MgB2, D may also have a dependence on the electronic structure.\nWe shall see below what the present data inform in this connection.\nCombining all the contributions from Eqs. (4) - (6), we obtain finally the\nfollowing expression for the TEP of the Mg1-xAlxB2 samples.\nS = AT +T3/(B+CT4) + T2/(D+ET3)\n\n(7)\n\nWe emphasize that we have not included high-T contribution in Eq. (7) due to the\ndiffusion process. The reason for this is that for higher values of temperature, the carrier\n8\n\n\fconductivity will depend upon the electron phonon interaction [12]. In fact, the conductivity\ndue to electron-phonon interaction is a complicated expression [12]. We have to take\nlogarithm of this expression (cf. Eq. (1)), and then a differentiation. This is almost an\nimpractical task. So here we have not considered the effect of the electron-phonon interaction\non the diffusion of the carriers.\nWe now turn to the explanation of the observed TEP data. Using Eq. (7) we have\nfitted the observed data. The fitting parameters are presented in Table 1. The parameter E\nacquires practically zero value. From Fig. 3 we see that Eq. (7) provides an excellent\nagreement of the theoretical Eq. (7) with the observed data in the whole temperature range\nexcept for the x = 0.8 and 1.0 samples. In fact, the x = 0.8 and 1.0 samples also show good\nagreement qualitatively. In view of such an agreement we would like to know about the\nrelative contributions of the diffusion process and phonon drag process. For this purpose, we\ntake a specific temperature T = 100 K, and consider values of S for the x = 0 and x = 0.6\nsamples. From the calculated values, it turns out that the x = 0 sample corresponds to Sd = 4.0\nμV/K, Spd, σ = -0.46 μV/K and Spd, π = -1.09 μV/K. We see that the phonon drag corresponds\nto significant contribution. Here we would like to clarify that depending upon the electronic\nstructure; the contribution of the phonon drag process to TEP may be positive or negative\nirrespective of the charge of the carriers. This argument is based on the work of Bailyn [20].\nWe now consider the relative contribution of the diffusion process and phonon drag\nprocess to TEP for the x = 0.06 sample at T=100 K. We find Sd = -0.17 μV/K, Spd, σ = 0\nμV/K and Spd, π = -0.29 μV/K. From these values it is clear that the phonon drag process is a\ndominating process for the TEP contribution in the x = 0.6 sample. In fact, as is clear from\nthe values of A of Table 1, the diffusion contribution is almost negligible for the x ≥ 0.6\nsamples. The main reason for this is the very large values of Wπ (see above).\nIn order to extract more information from the parameters of Table 1, we first of all\nnotice that the values of the parameter A are significant only for the superconducting (x ≤\n0.4) samples. Moreover, the value of A decreases with increasing x. This is in contradiction\nwith that of Lorenz et al [9] who find an increasing linear- T slope of TEP. An obvious\nreason for this is the modification of the theoretical TEP due to phonon drag. In fact, Lorenz\net al have not considered phonon drag. In order to see how phonon drag may affect the value\nof the linear-T co-efficient in Eq. (7), we start from the fact that the phonon drag contribution\nto TEP varies from a T3-like behavior for low-T to T-1 like behavior for high-T. Since the\n9\n\n\flow-T to high-T variation of the phonon drag contribution takes place smoothly, we will\ncome across T2-like, T-like and T0 like variations while going from low T-side to high Tside. In fact the region near the peak of S may be considered to be a T0 like (constant)\nbehavior while below that it is a T-like behavior. The T-like portion will get combined with\nthe T-like diffusion contribution. Thus the value of A will be modified than what it would\nhave been in the absence of the phonon drag. For MgB2 we find A = 0.04 μV/K2, while\nLorenz et al find a slope equal to 0.042 μV/K2. These slopes are almost equal. In fact, using\nWπ = 7.4 eV [8] in Eq. (4), we find that Wσ ≈ 0.57 eV, which is the same as that obtained by\nLorenz et al [9]. However, since the phonon drag affects the value of A, it is doubtful to treat\nthe value of Wσ as the value of the (σ-band) Fermi energy. We thus argue that the first term\nof Eq. (7) provides only the linear-T contribution to TEP where the diffusion process is\nmodified by the phonon drag process.\nWe next consider the parameter B. As mentioned above (the magnitude of) B should\nvary like θD3. Let θD0 be the Debye temperature of the MgB2 sample. Then using the values\nof B from Table 1, we can estimate the Debye temperature θD (x) for different x with respect\nto θD0. The values of θD (x)/ θD0 obtained in this way are given in the last column of table I.\nFrom these values we see that θD (x) increases with Al content up to x = 0.4. Then θD(x) start\nto decrease with further increase in x so that for the x = 0.8 sample θD(x) takes the lowest\nvalue of 0.94 θD0. For the AlB2 sample, the Debye temperature is 55% higher than that of the\nMgB2 sample. So, in general Al enhances the Debye temperature of the Mg1-xAlxB2 system,\nalthough in a non-monotonic way. The Debye temperature depends mainly upon two factors.\nThe first is the interatomic coupling, and second is the mass of the constituent atoms. While\nθD(x) increases with the interatomic coupling, it decreases with the atomic mass. Since Al is\nheavier than Mg, we expect a decrease in θD(x) due to the mass effect of Al . But table I\nshows that θD(x) increases with Al content. So we may say that doping of Al enhances the\ninteratomic coupling in Mg1-xAlxB2. As the lattice parameters a and c are found to be\ndecrease with Al, the atoms are coming closer with Al doping. This may be a possible reason\nfor the enhancement of interatomic coupling in the considered samples. It is surprising that\nthe Debye temperature of the x = 0.8 sample is lower than θD0. From Fig.2 we see that the\nresistivity of this sample has much higher slope values at different T than the other Al doped\n\n10\n\n\fsamples. This means that the situation in x= 0.8 sample is different, which is reflected in the\nobserved TEP also.\nAs mentioned above, the parameter D also depends on θD, like θD2. However, D is\nexpected to involve the effect of varying features of the σ-band also with Al doping. In fact,\nif D were to depend on θD only, the factor p = |D|θD02/θD2 should have been independent of x.\nLet us see what actually happens. From Table 1 we find that p = 2.16, 1.73, 1.33 and 1.53 in\nunits of 104 K3/μV for x = 0.0, 0.1, 0.2 and 0.4 respectively. Since p is not constant but varies\nsignificantly with x, we may say that there is a variation in the σ-band structure due to Al\ndoping, and that the variation has affected the TEP behavior for different Al content.\n\nIV. Conclusions\nIn this paper, we have presented measurements of the thermoelectric power of the\nMg1-xAlxB2 system for different values of x ranging from zero to one. Measurements of\nXRD, magnetization and resistivity are also presented. The thermoelectric power of the x ≤\n0.4 samples vanishes discontinuously below a certain temperature, implying existence of\nsuperconductivity. The thermoelectric power of the x ≥ 0.6 samples is negative, and does not\nvanish below a finite temperature. This is argued to show that thermoelectric power does not\nindicate superconducting effect in the x ≥ 0.6 samples. Another important feature of the\nthermoelectric power is that its magnitude, |S| starts to increase with temperature, and\ncontinues so up to a certain temperature. The temperature at which |S| is maximum, decreases\nin general with x, going to as low as T ≈ 80 K, for the x = 0.8 sample.\nIn order to explain the observed behavior of the thermoelectric power, we have used a\ntwo-band model wherein one band is the 3D π-band and the other one is the 2D σ-band. We\nhave considered both the diffusion process and the phonon drag process to arrive at an\ninterpolation formula from the low-T behavior of the diffusion and phonon drag process and\nthe high-T behavior of the phonon drag process. The interpolation formula provides an\nexcellent agreement especially for the x ≤ 0.6 samples. For the x= 0.8 and 1.0 sample, there\nis some quantitative disagreement but the qualitative behavior remains matching very well.\nWe have found that the slope of S with respect to T is almost equal for the x = 0 sample to\nthat of the Lorenz et al [9] sample.\n\n11\n\n\fAnother important information from the present study is that in general the Al doping\nenhances the Debye temperature. The thermoelectric power of AlB2 sample does not have a\nsizable straight-line portion towards low temperature, implying practically no diffusion\ncontribution.\n\nAcknowledgement\nThe authors from NPL would like to thank Dr. Vikram Kumar (Director, NPL) for\nshowing his keen interest in the present work. One of us (AVN) thanks the Indian National\nScience Academy (INSA), New Delhi for Senior Scientist position. Two of us (MM and\nLSSC) would also thank CSIR for financial support in the form of (by providing JRF)\nfellowship.\n\n12\n\n\fREFERENCE\n1. J. G. Bednorz and K. A. Muller, Z. Phys. B 64,189 (1986)\n2. J. Nagamatsu, N. Nakagawa, T. Muranaka, Y. Zenitani and J. Akimitsu, Nature 410, 63\n(2001)\n3. J. Kortus, I. Mazin, K. D. Belashchenko, V. P. Antropovz and L. L. Boycry, Phys. Rev.\nLett. 86, 4656 (2001)\n4. S.L. Budko J. Laperot and C. Petrovic, Phys. Rev. Lett. 86, 1877 (2001)\n5. J. S. Slusky, N. Rogado, K. A. Regan, M. A. Hayward, P. Khallfah, T. He, K. Innumaru,\nS. M. Loureiro, M. K. Haas, H. W. Zandbergan and R. J. Cava, Nature 410, 343 (2001)\n6. L. Leyrovska and E. Leyrovski, J. Less-Common Metals 67, 249 (1979)\n7. A.S. Cooper, E. Corenzwit, L. D. Longinotti, B. T. Matthias and W. H. Zachariasen, Proc.\nNatl. Acad. Sci. 67, 313 (1970)\n8. J.M. An and W.E. Pickett, Phys. Rev. Lett. 86, 4366 (2001).\n9. B. Lorenz, R. L. Meng, Y. Y. Xue and C. W. Chu, Phys. Rev. B 64, 052513 (2001)\n10. Monika Mudgel, V. P. S. Awana, H. Kishan and G. L. Bhalla, Physica C 467,31 (2007).\n11. S. Souma and T. Takahashi, J. Phys. Cond. Matt. 19, 355003 (2007)\n12. B. Gahtori, R. Lal, S. K. Agarwal, Y. K. Kuo, K. M. Sivakumar, J. K. Hsu, J. Y. Lin, A.\nRao, S. K. Chen and J. L. MacManus-Driscoll, Phys. Rev. B. 75, 184513 (2007)\n13. M. Putti, C. Ferdeghini, M. Monni I. Pallecchi, C. Tarantini, P. Manfrinetti, A.\nPalenzona, D. Daghero, R. S. Gonnelli and V. A. Stepanov, Phys. Rev. B 71, 144505 (2005)\n14. Min-Seok Park, Heon-Jung Kim, Byeongwon Kang and Sung-Ik Lee, Supercond. Sci.\nand Technol. 18, 183 (2005)\n15. F.J. Blatt, P.A. Schroeder and C.L. Foiles, thermoelectric power of metals (Plenum press,\nNew York, 1976)\n16. H. Fukuyama, Percolation, Localization and Superconductivity, eds. A.M. Goldmen and\nS.A. Wolf (Plenum Press, New York, 1984)\n17. M. Bailyn, Phys. Rev 120, 381 (1960)\n13\n\n\f18. J. Mucha, M. Pekala, J. Szydlowska, W. Gadomski, J. Akimitsu, J. F. Fagnard, P.\nVanerbemden, R. Cloots and M. Ausloos, Supercond. Sci. Technol. 16, 1167 (2003)\n19. J.L. Cohn, S.A. Wolf, V. Selvamanicken and K. Salama, Phys. Rev. Lett. 66, 1098\n(1991)\n20. M. Bailyn, Phys. Rev. 157, 480 (1967)\n21. S. Suzuki, S. Higai and K. Nakao, cond-mat/0102484\n\n14\n\n\fFigure Captions\nFig.1 XRD patterns for Mg1-xAlxB2 series (x = 0.0 to x = 1.0) Upper and lower insets show\nshifts of the (002) & (100) peaks respectively.\nFig. 2 Resistivity vs temperature plots for all Mg1-xAlxB2 samples (x = 0.0 to x = 1.0), The\ninset shows the zero field cooled (ZFC) magnetization as a function of temperature for\nsuperconducting Mg1-xAlxB2 (x = 0.0 to x= 0.40) samples.\nFig.3 Thermopower vs temperature plots in the temperature range 0 to 300 K for all samples\nof series Mg1-xAlxB2 (x = 0.0 to 1.0). The experimental data points are shown by different\nsymbols, while the theoretical fits to Eq. (7) are shown by solid lines.\n\n15\n\n\fTable1: Values of the parameters A, B, C and D of Eq. (7) for various values of Al content in\nMg1-xAlxB2. The values of E turn out to be less than 10-40 so it has been taken zero for all x in\nMg1-xAlxB2. The relative values of the Debye temperature θD/θDo are also given. θD is the\nDebye temperature of the x = 0 sample.\n\nx\n0.0\n0.1\n0.2\n0.4\n0.6\n0.8\n1.0\n\nA (μV/K2)\n0.040\n0.036\n0.036\n0.012\n-0.002\n-0.001\n0.0\n\nB (K4/μV)\n-5.91×104\n-6.84×104\n-10.29×104\n-37.56×104\n-27.97×104\n-4.89×104\n-21.83×104\n\nC (1/μV)\n-8.59×10-3\n-17.18×10-3\n-17.44×10-3\n-38.37×10-3\n-31.11×10-3\n-6.43×10-3\n-6.50×10-3\n\nD (K3/μV)\n-2.16×104\n-1.82×104\n-1.59×104\n-2.83×104\n-\n\nθD(x)/θD0\n1.00\n1.05\n1.20\n1.85\n1.68\n0.94\n1.55\n\n16\n\n\fFig. 1\n\n(002)\n\nx=1.0\n\nMg1-xAlxB2\n\nx=0.75\n\nx =1.0\n*\n\nx=0.50\nx=0.25\nx=0.10\nx=0.08\n\nx = 0.6\n\nx=0.06\n\nIntensity (arb. units)\n\nx=0.04\nx=0.02\nx=0.0\n\nx = 0.4\n50 52 54 56\n\n(100)\nx=1.0\n\nx = 0.2\nx=0.75\nx=0.50\nx=0.25\n\nx = 0.1\n\nx=0.10\nx=0.08\nx=0.06\nx=0.04\n\n(101)\n\nx=0.02\n\nx = 0.0 (100)\n\n20\n\n30\n\n(002) (110) (102)\n#\n40\n\n50\n\n60\n\nx=0.0\n\n32\n\n70\n\n33\n\n34\n\n80\n\n35\n\n90\n\n2θ (deg.)\n\n17\n\n\fFig. 2\n\n0.0\n\n600\n\nρ (μΩ-cm)\n\nM (emu/g)\n\n500\n\n-0.2\n\nx=0.40\n\nMg1-xAlxB2\nx=0.25\n\n-0.4\n\nx=0.20\n\n-0.6\nx=0.0\n\n-0.8\nx=0.10\n\n-1.0\n\n400\n\n0\n\n10\n\n20\n\n30\n\nx=0.04\n\nx=0.60\n\n40\n\nx=0.10\n\nT (K)\n\nx=0.40\n\n300\nx=0.80\n\nx=0.0\n\n200\n\nx=0.20\n\n100\n\nx=1.0\n\n0\n0\n\n50\n\n100 150 200 250 300\n\nT (K)\n\n18\n\n\fFig. 3\n\nPure MgB2\n10% Al\n20% Al\n40% Al\n60% Al\n80% Al\nAlB2\n\n7\n6\n5\n\nS (microV/K)\n\n4\n3\n2\n1\n0\n-1\n-2\n0\n\n50 100 150 200 250 300\n\nT (K)\n\n19\n\n\f"}