{"id": "http://arxiv.org/abs/0905.0289v3", "guidislink": true, "updated": "2009-09-30T19:35:11Z", "updated_parsed": [2009, 9, 30, 19, 35, 11, 2, 273, 0], "published": "2009-05-03T21:25:48Z", "published_parsed": [2009, 5, 3, 21, 25, 48, 6, 123, 0], "title": "Viable inflationary models ending with a first-order phase transition", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0905.0089%2C0905.1219%2C0905.2531%2C0905.2587%2C0905.3328%2C0905.3268%2C0905.4275%2C0905.3872%2C0905.4634%2C0905.0919%2C0905.0343%2C0905.4566%2C0905.3105%2C0905.2056%2C0905.0289%2C0905.4134%2C0905.0034%2C0905.2529%2C0905.4902%2C0905.4656%2C0905.4025%2C0905.0027%2C0905.0577%2C0905.4017%2C0905.4631%2C0905.4591%2C0905.1363%2C0905.3408%2C0905.2824%2C0905.4167%2C0905.3611%2C0905.1950%2C0905.0362%2C0905.3437%2C0905.3140%2C0905.2969%2C0905.2405%2C0905.4680%2C0905.3700%2C0905.3221%2C0905.2122%2C0905.0242%2C0905.2455%2C0905.3457%2C0905.0300%2C0905.4298%2C0905.1200%2C0905.3541%2C0905.3001%2C0905.0643%2C0905.1167%2C0905.0924%2C0905.2629%2C0905.4389%2C0905.0830%2C0905.0825%2C0905.0140%2C0905.1128%2C0905.0318%2C0905.0887%2C0905.1484%2C0905.2136%2C0905.2988%2C0905.1345%2C0905.1533%2C0905.3570%2C0905.1378%2C0905.1264%2C0905.4212%2C0905.0475%2C0905.1895%2C0905.2951%2C0905.3183%2C0905.2161%2C0905.4509%2C0905.1534%2C0905.1371%2C0905.1357%2C0905.2906%2C0905.0590%2C0905.3793%2C0905.4640%2C0905.2931%2C0905.1181%2C0905.0141%2C0905.3368%2C0905.2647%2C0905.4880%2C0905.3190%2C0905.4092%2C0905.2975%2C0905.1407%2C0905.0189%2C0905.4224%2C0905.2783%2C0905.2272%2C0905.4351%2C0905.2427%2C0905.0454%2C0905.0539%2C0905.1034&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Viable inflationary models ending with a first-order phase transition"}, "summary": "We investigate the parameter space of hybrid inflation models where inflation\nterminates via a first-order phase transition causing nucleation of bubbles.\nSuch models experience a tension from the need to ensure nearly scale invariant\ndensity perturbations, while avoiding a near scale-invariant bubble size\ndistribution which would conflict observations. We perform an exact analysis of\nthe different regimes of the models, where the energy density of the inflaton\nfield ranges from being negligible as compared to the vacuum energy to\nproviding most of the energy for inflation. Despite recent microwave anisotropy\nresults favouring a spectral index less than one, we find that there are still\nviable models that end with bubble production and can match all available\nobservations. As a by-product of our analysis, we also provide an up-to-date\nassessment of the viable parameter space of Linde's original second-order\nhybrid model across its full parameter range.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0905.0089%2C0905.1219%2C0905.2531%2C0905.2587%2C0905.3328%2C0905.3268%2C0905.4275%2C0905.3872%2C0905.4634%2C0905.0919%2C0905.0343%2C0905.4566%2C0905.3105%2C0905.2056%2C0905.0289%2C0905.4134%2C0905.0034%2C0905.2529%2C0905.4902%2C0905.4656%2C0905.4025%2C0905.0027%2C0905.0577%2C0905.4017%2C0905.4631%2C0905.4591%2C0905.1363%2C0905.3408%2C0905.2824%2C0905.4167%2C0905.3611%2C0905.1950%2C0905.0362%2C0905.3437%2C0905.3140%2C0905.2969%2C0905.2405%2C0905.4680%2C0905.3700%2C0905.3221%2C0905.2122%2C0905.0242%2C0905.2455%2C0905.3457%2C0905.0300%2C0905.4298%2C0905.1200%2C0905.3541%2C0905.3001%2C0905.0643%2C0905.1167%2C0905.0924%2C0905.2629%2C0905.4389%2C0905.0830%2C0905.0825%2C0905.0140%2C0905.1128%2C0905.0318%2C0905.0887%2C0905.1484%2C0905.2136%2C0905.2988%2C0905.1345%2C0905.1533%2C0905.3570%2C0905.1378%2C0905.1264%2C0905.4212%2C0905.0475%2C0905.1895%2C0905.2951%2C0905.3183%2C0905.2161%2C0905.4509%2C0905.1534%2C0905.1371%2C0905.1357%2C0905.2906%2C0905.0590%2C0905.3793%2C0905.4640%2C0905.2931%2C0905.1181%2C0905.0141%2C0905.3368%2C0905.2647%2C0905.4880%2C0905.3190%2C0905.4092%2C0905.2975%2C0905.1407%2C0905.0189%2C0905.4224%2C0905.2783%2C0905.2272%2C0905.4351%2C0905.2427%2C0905.0454%2C0905.0539%2C0905.1034&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We investigate the parameter space of hybrid inflation models where inflation\nterminates via a first-order phase transition causing nucleation of bubbles.\nSuch models experience a tension from the need to ensure nearly scale invariant\ndensity perturbations, while avoiding a near scale-invariant bubble size\ndistribution which would conflict observations. We perform an exact analysis of\nthe different regimes of the models, where the energy density of the inflaton\nfield ranges from being negligible as compared to the vacuum energy to\nproviding most of the energy for inflation. Despite recent microwave anisotropy\nresults favouring a spectral index less than one, we find that there are still\nviable models that end with bubble production and can match all available\nobservations. As a by-product of our analysis, we also provide an up-to-date\nassessment of the viable parameter space of Linde's original second-order\nhybrid model across its full parameter range."}, "authors": ["Marina Cortês", "Andrew R. Liddle"], "author_detail": {"name": "Andrew R. Liddle"}, "author": "Andrew R. Liddle", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1103/PhysRevD.80.083524", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/0905.0289v3", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0905.0289v3", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "9 pages, 7 figures. Revised version: corrections to description of\n  the historical development of the models. v3: Minor corrections to match\n  version accepted by PRD", "arxiv_primary_category": {"term": "astro-ph.CO", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "astro-ph.CO", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "hep-th", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0905.0289v3", "affiliation": "Univ. Sussex", "arxiv_url": "http://arxiv.org/abs/0905.0289v3", "journal_reference": "Phys.Rev.D80:083524,2009", "doi": "10.1103/PhysRevD.80.083524", "fulltext": "Viable inflationary models ending with a first-order phase transition\nMarina Cortês1, 2 and Andrew R. Liddle1\n\narXiv:0905.0289v3 [astro-ph.CO] 30 Sep 2009\n\n1\n\nAstronomy Centre, University of Sussex, Brighton BN1 9QH, United Kingdom\n2\nBerkeley Lab, Berkeley, CA 94720, USA\n\nWe investigate the parameter space of two-field inflation models where inflation terminates via a\nfirst-order phase transition causing nucleation of bubbles. Such models experience a tension from\nthe need to ensure nearly scale invariant density perturbations, while avoiding a near scale-invariant\nbubble size distribution which would conflict observations. We perform an exact analysis of the\ndifferent regimes of the models, where the energy density of the inflaton field ranges from being\nnegligible as compared to the vacuum energy to providing most of the energy for inflation. Despite\nrecent microwave anisotropy results favouring a spectral index less than one, we find that there are\nstill viable models that end with bubble production and can match all available observations. As a\nby-product of our analysis, we also provide an up-to-date assessment of the viable parameter space\nof Linde's original second-order hybrid model across its full parameter range.\nPACS numbers: 98.80.Cq\n\nI.\n\nINTRODUCTION\n\nOne of the open questions in inflationary cosmology is\nthe mechanism by which inflation came to an end. The\ncurrent literature is dominated by two paradigms, violation of slow roll bringing inflation to an end while the field\nis still evolving, and a second-order phase transition of\nhybrid inflation type. However, Guth's original (but unsuccessful) proposal [1] invoked a first-order phase transition whereby inflation ended by nucleation of bubbles of\ntrue vacuum. First-order transitions have subsequently\nexperienced bursts of popularity. In the late 1980s, La\nand Steinhardt [2] initiated intensive investigation of 'extended inflation' models, where modifications to Einstein\ngravity allowed bubble nucleation to complete in singlefield inflation. A few years later those models were struggling in face of observations, and focus instead returned\nto Einstein gravity, now in a two-field context with one\nrolling and one tunnelling field [3, 4, 5], although see\n[6, 7].\nIn addition to the usual quantum fluctuation mechanism, first-order inflation models produce density perturbations through the bubble collisions and subsequent\nthermalization. The spectrum of bubble sizes produced\nmust be far from scale invariance to avoid clear violation\nwith observed microwave anisotropies - the largest of\nthe bubbles would otherwise be blatantly visible [8, 9, 10].\nThis requirement is typically at odds with the need to\nmaintain scale invariance in the spectrum produced by\nquantum fluctuations, a tension sufficient to exclude extended inflation variants except in extremely contrived\ncircumstances [11]. The purpose of this paper is to investigate whether the strengthened constraints of the\npost Wilkinson Microwave Anisotropy Probe (WMAP)\nera have eliminated the Einstein gravity first-order models too and, by implication, assess whether it is plausible\nthat voids exist below current detection limits.\nIn Guth's original model, with one field, the inflaton\nmust remain in the metastable vacuum long enough to\nallow for sufficient e-folds of inflation but in this case\n\ninflation never ends, the bubbles never thermalize and\nthe transition doesn't complete. Introduction of a second\nfield allows a time-dependent nucleation rate, permitting\nenough inflation to occur while the nucleation rate is low\nand a successful end when the rate rises to high enough\nvalues. This idea was proposed independently by Linde\n[3] and, in more detail, by Adams and Freese [4] under\nthe name 'double-field inflation'.\n\nTypically the second field, which is trapped in the\nmetastable vacuum, also provides most of the energy density for inflation, although this depends on the particular\nvalues of parameters chosen. In that regime, the usual\nprediction is for a blue spectrum of density perturbations, nS > 1. In the last few years the trend in cosmic\nmicrowave background (CMB) observations has been a\ntightening of the confidence limits around a central value\nnS smaller than one, disfavouring this regime. Since our\ngoal is to investigate the general viability of this type of\nmodel we will probe the entire parameter space, including the intermediate region where the contributions of\neach field to the energy density are comparable, making\nno approximations based on inflaton or the false vacuum\ndomination.\n\nAs stated above one expects these models to run into\ndifficulty with recent observations closing in on a nearly\nscale invariant scalar spectrum. CMB anisotropies observations place constraints on the maximum size of bubbles that survive from a first-order phase transition, at\nthe time when scales of cosmological interest leave the\nhorizon. In turn this places a strong upper limit on the\nnucleation rate at this time, after which it must rise sufficiently to complete the transition and provide a graceful\nexit for inflation. In order to meet these two requirements\nthe field must proceed swiftly along the potential, what,\nin light of observations, places the model under stress.\n\n\f2\nGeneration of Perturbations\n\nGeneration of Perturbations\n\nΦinst\n\nΦinfl\n\nV\n\nV\nΦ\nTransition\nComplete\n\nΨ\n(a)\n\nΦ\nTransition\nComplete\n\nΨ\n(b)\n\nFIG. 1: (a) The potential for a second-order phase transition. The field reaches the true vacuum through a continuous\ntransition, and the breaking of the symmetry implies that there will be defect formation at the end of the transition. The\ntrue vacuum minima develop once the field passes the point of instability, φinst (b) The same for the first-order case. In this\ncase the transition is discontinuous and proceeds through quantum tunneling of the ψ field to the true vacuum. The second\nminimum develops after the point of inflection φinfl . The couplings in both (a) and (b) have been chosen so as to produce a\nvisible barrier height (in working models this is negligible compared to the false vacuum energy).\n\nII.\n\nTHE FIRST-ORDER MODEL\n\nWe consider throughout a fairly general form of the\npotential for a first-order phase transition, given by\nCopeland et al [5].\n1\n1\n1\nλ(M 4 + ψ 4 ) + αM 2 ψ 2 − γM ψ 3\n4\n2\n3\n1 2 2 1 ′ 2 2\n(1)\n+ m φ + λφ ψ .\n2\n2\nThis extends the simplest second-order hybrid inflation\nmodel by addition of the cubic term for the ψ field. As in\nconventional hybrid inflation, one envisages that initially\nthe inflaton field φ is displaced far from its minimum,\nand the auxiliary field ψ is then held in a false vacuum\nstate by its coupling to the inflaton. Perturbations are\ngenerated during this initial phase as φ rolls slowly along\nthe flat direction. The dynamics in this region are pretty\nmuch those of single-field slow-roll inflation, though the\nauxiliary field ψ may provide most of the energy density\nfor inflation, see Fig. 1.\nIn a model where the phase transition is second-order,\nshown in Fig. 1a, the false vacuum becomes unstable after\nφ passes a certain value, φinst , and the fields evolve classically to their true vacuum (here producing topological\ndefects as causally separated regions make independent\nchoices as to which minimum to finish in). Although\nnot the main topic of this paper, we explore current constraints on this model in the Appendix.\nIn the first-order case, shown in Fig. 1b, if the parameters in Eq. (1) are chosen appropriately, a second\nV (φ, ψ) =\n\nminimum develops once the field evolves past a point of\ninflection, φinfl . At this point bubbles of the true vacuum begin to nucleate and expand at the speed of light.\nThe percolation rate is initially very small as the vacuum energies are comparable, but as φ approaches zero\nthe interaction between the fields triggers a steep rise in\nthe bubble production. Inflation ends when the nucleation rate reaches high enough values that the bubbles\npercolate and thermalize. In this case there is only one\ntrue vacuum and hence no topological defects. The channel in which the field rolls after tunnelling is much too\nsteep to sustain any inflation within the bubbles.\nFor large values of φ there is only one minimum of\nthe potential, and in the ψ direction the potential looks\nlike Fig. 2a. However if γ 2 > 4αλ, a second minimum\ndevelops after φ reaches a point of inflection\nφ2infl = M 2\n\nγ 2 − 4αλ\n,\n4λ′\n\n(2)\n\nas in Fig. 2b. The presence of the cubic term in the\npotential then breaks the degeneracy between the two\nminima, making it possible for the field to tunnel to the\nnewly formed minimum. It is this second minimum that\neventually becomes the true vacuum and the ψ field begins to tunnel once the transition becomes energetically\nfavourable, Fig. 2c.\nAs mentioned in the previous section the quantum generation of perturbations occurs away from this minimum,\nwhile the inflaton is rolling in the φ direction, and we\nconsider horizon exit to occur around 55 e-folds before\nthe end of inflation [12]. This evolution of φ is a cru-\n\n\f3\nΦ > Φinflection\n\nΦ = Φinflection\n\nΦ < Φinflection\nV\n\nV\n\nV\n\nat the end of transition, Φ=0\n\nat horizon exit, Φ = Φ55\n\nΨ\n\nΨ\n\n(a)\n\nΨ\n\n(b)\n\n(c)\n\nFIG. 2: (a) At early times, away from φ = 0, there is only minimum available for ψ and the field is trapped in the false\nvacuum. (b) Given appropriate choices for the couplings a second minimum begins to develop when the field reaches the point\nof inflection of the potential. (c) Once the transition becomes energetically favourable the ψ field begins to tunnel to the newly\nformed minimum, which eventually becomes the true vacuum.\n\ncial feature of the model since it is the introduction of\na time dependence in the tunneling rate that will allow\nthe phase transition to complete, bringing inflation to an\nend.\nThe rate at which the bubbles nucleate is given by the\npercolation parameter (the number of bubbles generated\nper unit time per unit volume),\np=\n\nΓ\n.\nH4\n\n(3)\n\nIn the limit of zero temperature (taken because the transition occurs during inflation) the nucleation rate of bubbles can be approximated by [13],\np=\n\nλM 4\nexp(−SE ) ,\n4H 4\n\n(4)\n\nwhere SE is the four-dimensional Euclidean action. SE\nwas obtained for first-order transition quartic potentials\nby Adams [14], who fitted the result as\n2\n\nSE =\n\n4π\n(2 − δ)−3 (α1 δ + α2 δ 2 + α3 δ 3 ) ,\n3λ\n\n(5)\n\nwhere α1 = 13.832, α2 = −10.819, α3 = 2.0765, and δ\nis a monotonic increasing function of φ2 ,\nδ=\n\n9λα 9λλ′ φ2\n+ 2 2 .\nγ2\nγ M\n\n(6)\n\nThe allowed range has 0 < δ < 2 (outside this range solutions correspond to energetically disallowed transitions).\nThe transition to the true vacuum is complete once the\npercolation reaches unity, (one bubble per Hubble time\nper Hubble volume), allowing the bubbles of the true\nvacuum to coalesce.\nHowever in the most general case inflation need not end\nthrough bubble nucleation. If the potential is too steep\nslow-roll is violated before bubbles thermalize and inflation ends before the transition completes. In this case the\nprecise mechanism which completes the transition is irrelevant given that it occurs after inflation ends, and for\n\nour purposes the scenario is indistinguishable from the\nsingle-field case. (In this paper we do not consider gravitational waves produced via bubble collisions, but these\nmay provide a further observable [15, 16, 17, 18] that can\nultimately be used to constrain this type of model.)\nThe distinction between the two possibilities is given\nby the two values of the field, that at which the nucleation\nrate reaches unity, and that which makes ǫ ∼ 1 (violation\nof slow-roll), where ǫ is the usual slow roll parameter\ndefined in Eq. (9). Inflation ends by whichever value of\nφ is reached first,\nφend = max(φǫ , φcrit ) .\n\nIII.\n\n(7)\n\nINFLATIONARY DYNAMICS\nA.\n\nRegimes\n\nTwo different regimes can be distinguished, regarding\nwhich field we wish to have dominate the energy density. In the usual hybrid inflation regime the energy density of the potential is dominated by the false vacuum\nλM 4 ≫ m2 φ2 , which provides the energy for inflation.\nIn the opposite regime, in which the inflaton dominates\nthe energy density, the dynamics rapidly approach those\nof single-field inflation since, as we will see, slow-roll violation occurs sooner.\nWorking in either of these two regimes would allow us\nto simplify some of the expressions governing the dynamics during inflation, such as the number of e-folds and the\nslow-roll parameters, Eqs. (12), (9) and (15), and to proceed via an analytical treatment instead of a numerical\none. However our purpose here is to probe the dynamics\nof the full nS − r parameter space, (r is the tensor-toscalar ratio given by Eq. (14)) so as to determine whether\nthere still remain models consistent with CMB observations. Hence we also include the intermediate regime in\nour analysis, where the energy densities of the two fields\nare comparable, particularly when the transition between\nslow roll violation and bubble nucleation occurs. For this\n\n\f4\nreason we will retain the full form of the potential and\nproceed through numerical calculations.\n\nB.\n\nnS − 1 = −6ǫ + 2η ;\nr = 16ǫ ,\n\nField dynamics\n\nIn order to specify the dynamics of each model we begin by finding the field value, φmax , at which inflation\nends so we need to determine φǫ and φcrit . φǫ is obtained by evaluating the first slow-roll parameter for our\npotential and taking it to unity, 1\nǫ≡\n\nm2Pl\n16π\n\n\u0012\n\nV\nV\n\n\u0013\n′ 2\n\n=\n\nm4 φ2 m2Pl\n≈ 1.\nπ(λM 4 + 2m2 φ2 )2\n\n(8)\n\nInverting for φ yields,\np\nm2 m2Pl − 8πλM 4 − 4πλM 4\n=\n,\n8πm2\n(9)\nand we take the largest value of φ. Note that the solution\nexists only for large values of m, where m2 m2Pl > 8πλM 4 .\nTo determine φcrit we need to find the value at which\nthe percolation parameter reaches unity, pcrit ∼ 1. Solving Eq. (4), we get\nφ2ǫ\n\nm2 m2Pl ± mmPl\n\nScrit ∼ ln\n\nλM 4\n,\n4pcrit H 4\n\n(10)\n\nwhere Scrit is given by Eq. (5).\nInverting Eq. (10) yields a value for φcrit (only one of\nthe three roots lies in the allowed range) and in turn this\nallows us to determine φend , and, by comparison with φǫ ,\nthe mechanism by which inflation ends.\nKnowing φend we can calculate the value of the field\nat horizon exit, φ55 . In this model φ rolls towards its\nminimum at φ = 0 so φ55 > φend . Using the expression\nfor the number of e-folds between two field values φ1 and\nφ2 we get,\na2\n8π\nN (φ1 , φ2 ) ≡ ln\n∼− 2\na1\nmPl\n\nZ\n\nφ2\n\nφ1\n\nV\ndφ .\nV′\n\n(11)\n\nFor φ1 = φ55 and φ2 = φend , and substituting for V , we\nhave\n2π\nφ55\nM4\n+ 2 (φ255 − φ2end ) ,\nln\nm2 m2Pl φend\nmPl\n(12)\nwhere we make no assumptions on the relative size of the\ntwo masses and retain both terms. Substitution of φend\nyields φ55 and now we can calculate the scalar spectral\nN (φ55 , φend ) = 2πλ\n\n1\n\nindex, nS , and the tensor-to-scalar ratio, r, at horizon\nexit, by use of their expressions in terms of the usual\nslow-roll parameters,\n\nThe field ψ sits in the false vacuum during the inflationary phase,\nsince this is the only minimum available to ψ in this region of\nthe potential. This happens regardless of the means to ending\ninflation, so ψ is set to zero throughout this section.\n\n(13)\n(14)\n\nwhere ǫ is given by Eq. (9), and η is\nη≡\n\nm2 m2Pl\nm2Pl V ′′\n=\n,\n8π V\n2π(λM 4 + 2m2 φ2 )\n\n(15)\n\nwhere the last equality is obtained by substitution of the\npotential.\nAt this point we can locate the model in the nS − r\nplane and determine its position in relation to WMAP5\nconfidence limits [19].\nC.\n\nChoosing parameters\n\nThroughout we set the self-interaction and coupling\nconstants, λ and λ′ respectively, equal to unity. We are\nthen left with two constants, α and γ, and requiring the\nenergy density of the true vacuum to be zero fixes one of\nthese in terms of the other. We will fix α in terms of γ\nbut the reverse option could just as well be taken.\nThe CMB amplitude normalization can be used to relate the two masses. We use this to fix the mass of the\nlight field φ and then we are left with only two undetermined parameters: the energy of the false vacuum, M ,\nand the constant α. For each value of α, varying M fully\ndetermines the dynamics of the fields, and describes a\ntrajectory in the nS − r plane shown in Fig. 3.\nEach line is composed of two branches which correspond to the two solutions of the WMAP normalization,\nand converge for large values of M ∼ 2.7 × 10−3mPl . For\nvalues of M larger than this there is no solution to the\namplitude normalization hence no viable models. This\ncan be seen also in Fig. 4 which illustrates how the two\ndifferent approximation schemes converge to a common\nbehaviour and cease to exist after a certain value of M\n(c.f. Fig. 1 of Ref. [5]).\nThe right-hand branch in Fig. 3 corresponds to the\nlower branch in Fig. 4 and to the smaller value of m\nfrom the WMAP normalization. In this branch the approximate relation M ∼ m2/5 (in Planck units) holds and\nthe false vacuum dominates. The dynamics are indistinguishable in the nS − r plane when M < 10−4 mPl . We\nstart with the typical slightly blue tilted spectrum and\nnegligible tensor fraction. As m continues to increase so\ndoes the deviation from nS ∼ 1 until the approximate relation between the two masses breaks down and we have\nthe inflaton playing a more significant role in the relative\ncontribution of the two fields. At this point we observe\na turn in the nS − r plane, and the solution enters the\nintermediate region of comparable field energy densities.\nDespite this we still observe inflation ending by bubble\nnucleation throughout this branch, from small values of\nM to the maximum at M ∼ 2.7 × 10−3 mPl .\n\n\f5\n\nΑ=0.1\nΑ=0.01\n\n0.5\n\nWMAP5 68% and\n95% contours\nTransition to\nbubble nucleation\nTwo mass solutions\nconverge\n\nM=3 * 10-3\n\n0.4\n\nr\n\nM increases\n\n0.3\n0.2\n\nM=5 * 10-4\n\n0.1\nM increases\n-5\n\nM < 10\n\n0\n0.9\n\n0.95\n\n1\n\n1.05\n\n1.1\n\n1.15\n\n1.2\n\nnS\nFIG. 3: The trajectories described in the nS − r parameter plane for first-order models when M is varying and m is set by the\nCMB normalization. The two lines correspond to different values of the coupling constant α, the outermost α = 0.1 and the\ninnermost α = 0.01. The two endpoints correspond to the endpoints in Fig. 4 and converge at M ∼ 10−3 mPl corresponding to\nthe union of the branches in Fig. 4, at (nS , r) ∼ (0.99, 0.5). Mass values are given in Planck units.\n\n~HnS ,rL=H0.96,0.14L throughout~\n\nm\u0090mPl\n\n10-8\n\nH0.99,0.5L\n\nH1.13, 10^-8L\n\n10-12\nH1.02, 10^-14L\n10-16\n\ninside the inflaton dominated regime. Similarly to the\nother branch we observe an initial period where there is\nlittle dependence on the false vacuum energy, corresponding to the plateau on Fig. 4, and the dynamics are very\nwell approximated by those of standard single-field inflation with a φ2 potential, well known to satisfy WMAP5\ndata.\n\nH1.00,0L\n10-20\nHnS ,rL=~H1.00,0L\n10-9\n\n10-7\n\n10-5\n\n10-3\n\n10-1\n\nM\u0090mPl\nFIG. 4: The relation between the two mass scales. The\nWMAP normalization admits two solutions for m, corresponding to false vacuum domination over the inflaton (lower\nbranch), and the opposite regime, for large m, which is nearly\nindependent of M (upper branch). The two regimes converge\nto common behaviour. We consider all three regimes in the\nanalysis and set α = 0.1, given by the upper curve in Fig. 3.\n\nIn the opposite branch, on the left-hand side, the model\nstarts inside the WMAP5 95% confidence contour, well\n\nThis regime breaks down as the false vacuum energy\nincreases and eventually we recover the regime where\nthe phase transition triggers the end of inflation before the violation of slow roll, meaning we are again in\nthe bubble production scenario. The interesting results\nhere draw from the fact that the transition occurs inside\nthe WMAP5 95% confidence contour, making these viable models even away from false vacuum domination.\nFig. 5 is a zoom of this region showing the field mass,\nM , at which the transition to bubble nucleation occurs,\nM ∼ 5 × 10−4 mPl , still allowed by the 95% confidence\nlimits.\n\n\f6\n\nΑ=0.1, 0.01\nWMAP5 contour\nTransition to\nbubble nucleation\n\n0.22\n\nInflaton domination\nlimit\n\nM=10-3\n\n0.2\n\nInflation ends\nwith bubbles\n\n8*10-4\n\nInflation ends\n\nr\n\n0.18\n\nwith\nslow roll\n\n6*10-4\n\n0.16\n\nviolation\n-4\n\n5*10\n\nM<10-5\n\n0.14\n0.95\n\n0.96\n\n0.97\n\n0.98\n\nnS\nFIG. 5: Zoom of Fig. 3 showing the transition between models ending by slow roll violation and bubble inflation. The transition\nhappens around M ∼ 5 × 10−4 mPl , well within the WMAP5 95% confidence contour. Mass values in Planck mass units.\n\nIV.\n\nTHREE CONSTRAINTS\n\nIn the previous section we looked at constraints in the\nnS − r plane. By specifying a value for α, one of our\ntwo free parameters (M, α), the CMB normalization then\nallows us to recover a trajectory in this plane and assess where the density perturbations are compatible with\nWMAP5 data. We now compute other constraints on the\nscenario, in the M − α plane.\n\nspecified by the CMB normalization instead). This yields\nthe region below the upper (blue) curve in Fig. 6. We see\nthat specifying a value for the false vacuum density imposes an upper limit on the coupling α (alternatively on\nthe inflaton mass, m) in order for the model to have the\npossibility to complete the phase transition.\n\nB.\nA.\n\nBig bubble constraint\n\nModel consistency\n\nWe begin with the requirement that M be not larger\nthan an upper limit above which, for a particular choice\nof couplings, the transition does not complete (φcrit does\nnot exist). We call this the model consistency constraint,\nwhich translates to a relation for the value of φcrit , coming from the requirement that there exists a solution of\nEq. (6) for δ. Because of the constant term in Eq. (6)\nthis is an additional requirement to 0 < δ < 2.\nSince we have chosen to set m by the CMB normalization this can be translated into an excluded region in\nthe (M, α) plane (although alternatively we could have\nexpressed it in terms of a region in (M, m), by having α\n\nWe adopt here a fairly crude criterion to judge whether\nthe bubbles are compatible with observations, which is\nthat any bubbles produced at the end of inflation and\nexpanded to astrophysical sizes must, during the epoch\nof recombination, have a comoving size not larger than\n20h−1 Mpc [8]. This corresponds to a maximum filling\nfraction at that time of 10−5 , and puts an upper bound\non the percolation rate of bubbles at the time the scales\nwe observe today left the horizon:\n\u0012\n\nΓ\nH4\n\n\u0013\n\n55\n\n≤ 10−5 .\n\n(16)\n\n\f7\nWith our form for the action Eq. (5) and choice of potential this becomes\nS55 ∼ −2.9 + 4 ln\n\nmPl\n+ 11.5 .\nλ1/4 M\n\n(17)\n\nThis gives us the region between the short dashed (black)\nlines in Fig. 6.\n\nC.\n\nWMAP constraint\n\nWe can similarly place constraints on the (M, α) plane,\nby considering the 95% confidence limit resulting from\nthe WMAP5 nS − r plane when tensors are included.\nnS . 1.05 .\n\n(18)\n\nInverting Eq. (18) gives us an upper limit on M in terms\nof α, resulting in the region left of the long dashed (red)\nline in Fig. 6.\nWe also see from Fig. 6 that this constraint is opposed\nto that coming from the CMB maximum bubble size requirement, as we argued in Section I. Big bubbles at last\nscattering put an upper limit on the nucleation rate at\nhorizon crossing while CMB constraints on the spectral\ntilt put a lower bound on the nucleation rate, from the\nrequirement that nS is not too distant from scale invariance.\nNevertheless, a region of parameter space survives all\nconstraints.\n\nV.\n\nCONCLUSIONS\n\nOur principal conclusion is that there do remain Einstein gravity models of first-order inflation which are\ncompatible with observations, despite the increasing tension between the need for a scale-invariant primordial\nspectrum and the suppression of large-scale bubbles. We\nhave exhibited a particular class of model and found the\nparameter region where the first-order model is viable.\nIts predictions for nS and r are similar to the simple\nm2 φ2 slow-roll inflation model, though a little further\nfrom scale-invariance.\nIn this paper we have imposed a relatively simple constraint on the bubbles, and have then assumed that their\nimpact on the CMB is negligible as far as constraints\non the primordial perturbations are concerned. A more\ndetailed treatment would combine the two perturbation\nsources and refit to the CMB data, which may lead to\nsome modification to the outcome in regimes where the\nbubble production is close to the observational limit. For\nmodels where the bubbles are safely within the observational limits this is not an issue.\nThis paper demonstrates that we are still some way\nfrom having a clear view as to how the inflationary period\nof the Universe may have ended. The literature contains\nthree different mechanisms - violation of slow-roll, a\n\nsecond-order instability during slow-roll, and bubble nucleation - and we have shown that the last (and least\npopular) of these remains a viable option. First-order\nmodels are of phenomenological interest as the bubble\nspectrum is an additional source of inhomogeneity that\ncould be considered in matching high-precision observations. The bubble collisions may also generate detectable\ngravitational waves [15, 16, 17, 18]. There is therefore an\nongoing need to refine understanding of the nature of\nperturbations induced by a primordial bubble spectrum.\nAcknowledgments\n\nM.C. was supported by FCT (Portugal) and by the\nDirector, Office of Science, Office of High Energy Physics,\nof the U.S. Department of Energy under Contract No.\nDE-AC02-05CH11231. A.R.L. was supported by STFC\n(UK). We thank Andy Albrecht, Katie Freese, Andrei\nLinde, and Eric Linder for discussions and comments.\nAPPENDIX A: THE SECOND-ORDER MODEL\n\nAlthough not part of our main study, the full parameter range of the second-order hybrid inflation model\n[5, 20, 21] is easily studied using the machinery we have\nused for the first-order case. The second-order model\nalso uses the energy density of an auxiliary field to raise\nthe energy scale for inflation without endangering slow\nroll. The phase transition in this case is continuous,\nwith the ψ field rolling down to the true vacuum (see\nFig. 1(a)). There are no bubbles now and hence no bubble constraint; we just have to consider whether the usual\nperturbations are compatible with WMAP5 data. Furthermore since now there is no cubic term to break the\ndegeneracy between the two minima, there is the possibility of topological defect formation at the end of inflation,\nas different regions in space roll towards one or the other\nminimum. However we do not consider their possible\nimpact here.\nThe dynamics are closely related to those in the firstorder case. The critical point where the phase transition\ncompletes is a point of instability φinst , after which ψ = 0\nbecomes unstable and starts to roll. The potential for\nthis case is a particularization of the first-order potential\nEq. (1) with λ = −α and γ = 0, and becomes,\nV (φ, ψ) =\n\n1\n1\n1\nλ(ψ 2 − M 2 )2 + m2 φ2 + λ′ φ2 ψ 2 . (A1)\n4\n2\n2\n\nApart from the expression determining φinst , we can\nretain most of the expressions from the first-order model\nand build a similar picture in the nS −r plane. We present\nthis in Fig. 7, again for λ = λ′ = 1. We see that the\nfalse vacuum dominated regime, which has nS > 1 and\nnegligible r, lies entirely outside the WMAP5 allowed\nregion, as does the main curve of the intermediate regime.\nOnly once the trajectory heads towards the slow-roll limit\n\n\f8\n\nModel Consistency\nWMAP 95% limit\nBig Bubble Size\n\n0.3\n\nJoint Constraints\nRegion\n\n0.25\n\nΑ\n\n0.2\n0.15\n0.1\n0.05\n10-9\n\n10-7\n\n10-5\n\n10-3\n\n10-1\n\nM\u0090mPl\nFIG. 6: Excluded regions in the (M, α) parameter space. The continuous (blue) line corresponds to ensuring model consistency;\nif the model lies above this region the phase transition will not take place. The long dashed (red) line corresponds to WMAP5\nconstraints on the value of the scalar perturbations tilt and allows models to the left of the bound. The region between the\nshort dashed (black) lines indicates models satisfying the maximum size of bubbles allowed by the level of anisotropy in the\nCMB.\n\ndoes it become compatible with observations. At M ∼\n9 × 10−4 mPl the models cross the WMAP5 95% contour\n\nand at M ∼ 5 × 10−4mPl inflation ends through slow roll\nviolation instead of a phase transition.\n\n[1] A. H. Guth, Phys. Rev. D23, 347 (1981).\n[2] D. La and P. J. Steinhardt, Phys. Rev. Lett. 62, 376\n(1989).\n[3] A. D. Linde, Phys. Lett. B249, 18 (1990).\n[4] F. C. Adams and K. Freese, Phys. Rev. D43, 353 (1991),\nhep-ph/0504135.\n[5] E. J. Copeland, A. R. Liddle, D. H. Lyth, E. D. Stewart, and D. Wands, Phys. Rev. D49, 6410 (1994), astroph/9401011.\n[6] F. Di Marco and A. Notari, Physical Review D 73,\n063514 (2006), astro-ph/0511396.\n[7] T. Biswas and A. Notari, Physical Review D 74, 043508\n(2006), hep-ph/0511207.\n[8] A. R. Liddle and D. Wands, Mon. Not. Roy. Astron. Soc.\n253, 637 (1991).\n[9] A. R. Liddle and D. Wands, Phys. Lett. B276, 18 (1992).\n[10] L. M. Griffiths, M. Kunz, and J. Silk, Mon. Not. Roy.\nAstron. Soc. 339, 680 (2003), astro-ph/0204100.\n[11] A. R. Liddle and D. Wands, Phys. Rev. D45, 2665\n(1992).\n\n[12] A. R. Liddle and S. M. Leach, Phys. Rev. D68, 103503\n(2003), astro-ph/0305263.\n[13] C. G. Callan and S. R. Coleman, Phys. Rev. D16, 1762\n(1977).\n[14] F. C. Adams, Phys. Rev. D48, 2800 (1993), hepph/9302321.\n[15] C. Hogan, Mon. Not. Roy. Astron. Soc. 218, 629 (1986).\n[16] A. Kosowsky, M. S. Turner, and R. Watkins, Phys. Rev.\nD45, 4514 (1992).\n[17] S. J. Huber and T. Konstandin, JCAP 0809, 022 (2008),\narXiv:0806.1828.\n[18] C. Caprini, R. Durrer, T. Konstandin, and G. Servant,\nPhys. Rev. D 79, 083519 (2009), arXiv:0901.1661.\n[19] E. Komatsu et al. (WMAP), Astrophys. J. Suppl. 180,\n330 (2009), arXiv:0803.0547.\n[20] A. D. Linde, Phys. Lett. B259, 38 (1991).\n[21] A. D. Linde, Phys. Rev. D49, 748 (1994), astroph/9307002.\n\n\f9\n\n2nd order models\nWMAP5 68% and\n95% contours\nM < 10-5\n\n0.5\n\nTwo mass solutions\nconverge\n\n-3\n\nM=2.5 * 10\n\nInflation ends with\nslow-roll violation\n\n0.4\nM increases\n\nr\n\n0.3\n0.2\n\nM=4.8 * 10-4\n\n0.1\nM increases\n\n0\n0.95\n\n1\n\n1.05\n\n1.1\n\nnS\nFIG. 7: Trajectory in parameter space nS − r describing second-order hybrid inflation models when M evolves from small\nthrough large values. The potential has one less coupling compared to the first-order case and all models are described by a\nsingle curve, as opposed to Fig. 3. Allowed models are those which approximate slow roll behaviour. False vacuum, blue tilted,\nmodels all lie outside the 95% C.L.\n\n\f"}