{"id": "http://arxiv.org/abs/0903.5355v1", "guidislink": true, "updated": "2009-03-31T01:58:58Z", "updated_parsed": [2009, 3, 31, 1, 58, 58, 1, 90, 0], "published": "2009-03-31T01:58:58Z", "published_parsed": [2009, 3, 31, 1, 58, 58, 1, 90, 0], "title": "Stroke saturation on a MEMS deformable mirror for woofer-tweeter\n  adaptive optics", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0903.0369%2C0903.3015%2C0903.3640%2C0903.3568%2C0903.1296%2C0903.2398%2C0903.3127%2C0903.3344%2C0903.2572%2C0903.3586%2C0903.1987%2C0903.3966%2C0903.2982%2C0903.0550%2C0903.4775%2C0903.1442%2C0903.1374%2C0903.0475%2C0903.0755%2C0903.4796%2C0903.0746%2C0903.1441%2C0903.1482%2C0903.1995%2C0903.0596%2C0903.0896%2C0903.2969%2C0903.2263%2C0903.3311%2C0903.1034%2C0903.1557%2C0903.0112%2C0903.4368%2C0903.4982%2C0903.4261%2C0903.3146%2C0903.4588%2C0903.0322%2C0903.3832%2C0903.2078%2C0903.5323%2C0903.0370%2C0903.4112%2C0903.2939%2C0903.0858%2C0903.1565%2C0903.2030%2C0903.0253%2C0903.3538%2C0903.1241%2C0903.4890%2C0903.3708%2C0903.1672%2C0903.1166%2C0903.4038%2C0903.2306%2C0903.4646%2C0903.3876%2C0903.0982%2C0903.2707%2C0903.0169%2C0903.2664%2C0903.2101%2C0903.5107%2C0903.3413%2C0903.4770%2C0903.1397%2C0903.3131%2C0903.4613%2C0903.4825%2C0903.2351%2C0903.0612%2C0903.2952%2C0903.2319%2C0903.3400%2C0903.3145%2C0903.3030%2C0903.5355%2C0903.0424%2C0903.2043%2C0903.3809%2C0903.4645%2C0903.1801%2C0903.1699%2C0903.3817%2C0903.0639%2C0903.4574%2C0903.0285%2C0903.4506%2C0903.0297%2C0903.4783%2C0903.5010%2C0903.4766%2C0903.2986%2C0903.3275%2C0903.4263%2C0903.4844%2C0903.0503%2C0903.1949%2C0903.2979%2C0903.5505&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Stroke saturation on a MEMS deformable mirror for woofer-tweeter\n  adaptive optics"}, "summary": "High-contrast imaging of extrasolar planet candidates around a main-sequence\nstar has recently been realized from the ground using current adaptive optics\n(AO) systems. Advancing such observations will be a task for the Gemini Planet\nImager, an upcoming \"extreme\" AO instrument. High-order \"tweeter\" and low-order\n\"woofer\" deformable mirrors (DMs) will supply a >90%-Strehl correction, a\nspecialized coronagraph will suppress the stellar flux, and any planets can\nthen be imaged in the \"dark hole\" region. Residual wavefront error scatters\nlight into the DM-controlled dark hole, making planets difficult to image above\nthe noise. It is crucial in this regard that the high-density tweeter, a\nmicro-electrical mechanical systems (MEMS) DM, have sufficient stroke to deform\nto the shapes required by atmospheric turbulence. Laboratory experiments were\nconducted to determine the rate and circumstance of saturation, i.e. stroke\ninsufficiency. A 1024-actuator 1.5-um-stroke MEMS device was empirically tested\nwith software Kolmogorov-turbulence screens of r_0=10-15cm. The MEMS when\nsolitary suffered saturation ~4% of the time. Simulating a woofer DM with ~5-10\nactuators across a 5-m primary mitigated MEMS saturation occurrence to a\nfraction of a percent. While no adjacent actuators were saturated at opposing\npositions, mid-to-high-spatial-frequency stroke did saturate more frequently\nthan expected, implying that correlations through the influence functions are\nimportant. Analytical models underpredict the stroke requirements, so empirical\nstudies are important.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0903.0369%2C0903.3015%2C0903.3640%2C0903.3568%2C0903.1296%2C0903.2398%2C0903.3127%2C0903.3344%2C0903.2572%2C0903.3586%2C0903.1987%2C0903.3966%2C0903.2982%2C0903.0550%2C0903.4775%2C0903.1442%2C0903.1374%2C0903.0475%2C0903.0755%2C0903.4796%2C0903.0746%2C0903.1441%2C0903.1482%2C0903.1995%2C0903.0596%2C0903.0896%2C0903.2969%2C0903.2263%2C0903.3311%2C0903.1034%2C0903.1557%2C0903.0112%2C0903.4368%2C0903.4982%2C0903.4261%2C0903.3146%2C0903.4588%2C0903.0322%2C0903.3832%2C0903.2078%2C0903.5323%2C0903.0370%2C0903.4112%2C0903.2939%2C0903.0858%2C0903.1565%2C0903.2030%2C0903.0253%2C0903.3538%2C0903.1241%2C0903.4890%2C0903.3708%2C0903.1672%2C0903.1166%2C0903.4038%2C0903.2306%2C0903.4646%2C0903.3876%2C0903.0982%2C0903.2707%2C0903.0169%2C0903.2664%2C0903.2101%2C0903.5107%2C0903.3413%2C0903.4770%2C0903.1397%2C0903.3131%2C0903.4613%2C0903.4825%2C0903.2351%2C0903.0612%2C0903.2952%2C0903.2319%2C0903.3400%2C0903.3145%2C0903.3030%2C0903.5355%2C0903.0424%2C0903.2043%2C0903.3809%2C0903.4645%2C0903.1801%2C0903.1699%2C0903.3817%2C0903.0639%2C0903.4574%2C0903.0285%2C0903.4506%2C0903.0297%2C0903.4783%2C0903.5010%2C0903.4766%2C0903.2986%2C0903.3275%2C0903.4263%2C0903.4844%2C0903.0503%2C0903.1949%2C0903.2979%2C0903.5505&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "High-contrast imaging of extrasolar planet candidates around a main-sequence\nstar has recently been realized from the ground using current adaptive optics\n(AO) systems. Advancing such observations will be a task for the Gemini Planet\nImager, an upcoming \"extreme\" AO instrument. High-order \"tweeter\" and low-order\n\"woofer\" deformable mirrors (DMs) will supply a >90%-Strehl correction, a\nspecialized coronagraph will suppress the stellar flux, and any planets can\nthen be imaged in the \"dark hole\" region. Residual wavefront error scatters\nlight into the DM-controlled dark hole, making planets difficult to image above\nthe noise. It is crucial in this regard that the high-density tweeter, a\nmicro-electrical mechanical systems (MEMS) DM, have sufficient stroke to deform\nto the shapes required by atmospheric turbulence. Laboratory experiments were\nconducted to determine the rate and circumstance of saturation, i.e. stroke\ninsufficiency. A 1024-actuator 1.5-um-stroke MEMS device was empirically tested\nwith software Kolmogorov-turbulence screens of r_0=10-15cm. The MEMS when\nsolitary suffered saturation ~4% of the time. Simulating a woofer DM with ~5-10\nactuators across a 5-m primary mitigated MEMS saturation occurrence to a\nfraction of a percent. While no adjacent actuators were saturated at opposing\npositions, mid-to-high-spatial-frequency stroke did saturate more frequently\nthan expected, implying that correlations through the influence functions are\nimportant. Analytical models underpredict the stroke requirements, so empirical\nstudies are important."}, "authors": ["Katie Morzinski", "Bruce Macintosh", "Donald Gavel", "Daren Dillon"], "author_detail": {"name": "Daren Dillon"}, "author": "Daren Dillon", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1364/OE.17.005829", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/0903.5355v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0903.5355v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "16 pages, 10 figures", "arxiv_primary_category": {"term": "astro-ph.IM", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "astro-ph.IM", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0903.5355v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0903.5355v1", "journal_reference": "Opt.Express 17:5829-5844,2009", "doi": "10.1364/OE.17.005829", "fulltext": "arXiv:0903.5355v1 [astro-ph.IM] 31 Mar 2009\n\nStroke saturation on a MEMS\ndeformable mirror for woofer-tweeter\nadaptive optics\nKatie Morzinski,1,2∗ Bruce Macintosh,1,3 Donald Gavel,1,2 and\nDaren Dillon1,2\n1 National Science Foundation Center for Adaptive Optics\n2 UCO/Lick Observatory, 1156 High St., University of California, Santa Cruz, CA, 95064,\nUSA\n3 Lawrence Livermore National Laboratory, 7000 East Ave., Livermore, CA 94550, USA\nktmorz@ucolick.org\n\nAbstract: High-contrast imaging of extrasolar planet candidates around a\nmain-sequence star has recently been realized from the ground using current\nadaptive optics (AO) systems. Advancing such observations will be a task\nfor the Gemini Planet Imager, an upcoming \"extreme\" AO instrument.\nHigh-order \"tweeter\" and low-order \"woofer\" deformable mirrors (DMs)\nwill supply a >90%-Strehl correction, a specialized coronagraph will suppress the stellar flux, and any planets can then be imaged in the \"dark hole\"\nregion. Residual wavefront error scatters light into the DM-controlled dark\nhole, making planets difficult to image above the noise. It is crucial in this\nregard that the high-density tweeter, a micro-electrical mechanical systems\n(MEMS) DM, have sufficient stroke to deform to the shapes required\nby atmospheric turbulence. Laboratory experiments were conducted to\ndetermine the rate and circumstance of saturation, i.e. stroke insufficiency.\nA 1024-actuator 1.5-μ m-stroke MEMS device was empirically tested with\nsoftware Kolmogorov-turbulence screens of r0 =10–15 cm. The MEMS\nwhen solitary suffered saturation ∼4% of the time. Simulating a woofer DM\nwith ∼5–10 actuators across a 5-m primary mitigated MEMS saturation\noccurrence to a fraction of a percent. While no adjacent actuators were\nsaturated at opposing positions, mid-to-high-spatial-frequency stroke did\nsaturate more frequently than expected, implying that correlations through\nthe influence functions are important. Analytical models underpredict the\nstroke requirements, so empirical studies are important.\n© 2018 Optical Society of America\nOCIS codes: (010.1080) Active or adaptive optics; (230.4685) Optical microelectromechanical\ndevices; (350.1260) Astronomical optics; (010.1285) Atmospheric correction\n\nReferences and links\n1. C. Marois, B. Macintosh, T. Barman, B. Zuckerman, I. Song, J. Patience, D. Lafreniere, and R. Doyon, \"Direct\nimaging of multiple planets orbiting the star HR 8799,\" Science 322, 1348–1352 (2008).\n2. P. Kalas, J. R. Graham, E. Chiang, M. P. Fitzgerald, M. Clampin, E. S. Kite, K. Stapelfeldt, C. Marois, and J.\nKrist, \"Optical Images of an Exosolar Planet 25 Light-Years from Earth,\" Science 322, 1345–1348 (2008).\n\n\f3. A.-M. Lagrange, D. Gratadour, G. Chauvin, T. Fusco, D. Ehrenreich, D. Mouillet, G. Rousset, D. Rouan, F.\nAllard, É. Gendron, J. Charton, L. Mugnier, P. Rabou, J. Montri, and F. Lacombe, \"A probable giant planet\nimaged in the β Pictoris disk. VLT/NaCo deep L'-band imaging,\" Astron. Astrophys. 493, L21–L25 (2009).\n4. C. Marois, D. Lafrenière, R. Doyon, B. Macintosh, and D. Nadeau, \"Angular Differential Imaging: A powerful\nhigh-contrast imaging technique,\" Astrophys. J. 641, 556–564 (2006).\n5. B. A. Macintosh, J. R. Graham, D. W. Palmer, R. Doyon, J. Dunn, D. T. Gavel, J. Larkin, B. Oppenheimer, L.\nSaddlemyer, A. Sivaramakrishnan, J. K. Wallace, B. Bauman, D. A. Erickson, C. Marois, L. A. Poyneer, and\nR. Soummer, \"The Gemini Planet Imager: From science to design to construction,\" Proc. SPIE 7015, 701518\n(2008).\n6. P. Kalas, \"GPI: Gemini Planet Imager,\" http://gpi.berkeley.edu.\n7. S. A. Cornelissen, P. A. Bierden, T. G. Bifano, \"A 4096 element continuous facesheet MEMS deformable mirror\nfor high-contrast imaging,\" Proc. SPIE 6888, 68880V-1–10 (2008).\n8. K. M. Morzinski, D. T. Gavel, A. P. Norton, D. R. Dillon, and M. R. Reinig, \"Characterizing MEMS deformable\nmirrors for open-loop operation: High-resolution measurements of thin-plate behavior,\" Proc. SPIE 6888, 68880S\n(2008a).\n9. K. M. Morzinski, J. W. Evans, S. Severson, B. Macintosh, D. Dillon, D. Gavel, C. Max, and D. Palmer, \"Characterizing the potential of MEMS deformable mirrors for astronomical adaptive optics,\" Proc. SPIE 6272, 627221\n(2006).\n10. J. W. Evans, B. Macintosh, L. Poyneer, K. Morzinski, S. Severson, D. Dillon, D. Gavel, and L. Reza, \"Demonstrating sub-nm closed loop MEMS flattening,\" Opt. Express 14, 5558–5570 (2006).\n11. J. W. Evans, K. Morzinski, L. Reza, S. Severson, L. Poyneer, B. A. Macintosh, D. Dillon, G. Sommargren, D.\nPalmer, D. Gavel, and S. Olivier, \"Extreme adaptive optics testbed: High contrast measurements with a MEMS\ndeformable mirror,\" Proc. SPIE 5905, 59050Y (2005).\n12. D. Gavel, S. Severson, B. Bauman, D. Dillon, M. Reinig, C. Lockwood, D. Palmer, K. Morzinski, M. Ammons,\nE. Gates, and B. Grigsby, \"Villages: An on-sky visible wavelength astronomy AO experiment using a MEMS\ndeformable mirror,\" Proc. SPIE 6888, 688804 (2008).\n13. D. Gavel, M. Ammons, B. Bauman, D. Dillon, E. Gates, B. Grigsby, J. Johnson, C. Lockwood, K. Morzinski, D.\nPalmer, M. Reinig, and S. Severson, \"Visible light laser guidestar experimental system (Villages): On-sky tests\nof new technologies for visible wavelength all-sky coverage adaptive optics systems,\" Proc. SPIE 7015, 70150G\n(2008).\n14. F. Malbet, J. W. Yu, and M. Shao, \"High-dynamic-range imaging using a deformable mirror for space coronography,\" Publ. Astron. Soc. Pac. 107, 386–398 (1995).\n15. R. Soummer, \"Apodized pupil Lyot coronagraphs for arbitrary telescope apertures,\" Astrophys. J. L. 618, L161–\nL164 (2005).\n16. S. J. Thomas, R. Soummer, D. Dillon, B. Macintosh, J. W. Evans, D. Gavel, A. Sivaramakrishnan, C. Marois,\nand B. R. Oppenheimer, \"Testing the APLC on the LAO ExAO testbed,\" Proc. SPIE 7015, 701561 (2008).\n17. K. M. Morzinski, B. A. Macintosh, D. Dillon, D. Gavel, D. Palmer, and A. Norton, \"Empirical measurement\nof MEMS stroke saturation, with implications for woofer-tweeter architectures,\" Proc. SPIE 7015, 70153N–\n70153N-12 (2008b).\n18. A. Norton, J. W. Evans, D. Gavel, D. Dillon, D. Palmer, B. Macintosh, K. Morzinski, S. Cornelissen, \"Preliminary\ncharacterization of Boston Micromachines' 4096-actuator deformable mirror,\" Proc. SPIE 7209, 720916 (2009).\n19. S. A. Severson, Department of Physics and Astronomy, Sonoma State University, 300L Darwin Hall, Rohnert\nPark, CA 94928, (personal communication, 2006).\n20. V. I. Tatarski, Wave propagation in a turbulent medium (McGraw-Hill Book Company, Inc., 1961).\n21. J. W. Hardy, \"Instrumental limitations in adaptive optics for astronomy,\" Proc. SPIE 1114, 2–13 (1989).\n22. R. J. Noll, \"Zernike polynomials and atmospheric turbulence,\" J. Opt. Soc. Am. 66, 207–211 (1976).\n23. R. Hudgin, \"Wave-front compensation error due to finite corrector-element size,\" J. Opt. Soc. Am. 67, 393–395\n(1977).\n24. J. W. Hardy, Adaptive optics for astronomical telescopes (Oxford University Press, 1998).\n25. R. Conan, \"Mean-square residual error of a wavefront after propagation through atmospheric turbulence and after\ncorrection with Zernike polynomials,\" J. Opt. Soc. Am. A 25, 526–536 (2008).\n26. J.-F. Lavigne and J.-P. Véran, \"Woofer-tweeter control in an adaptive optics system using a Fourier reconstructor,\"\nJ. Opt. Soc. Am. A 25, 2271–2279 (2008).\n27. G. E. Sommargren, D. W. Phillion, M. A. Johnson, N. Q. Nguyen, A. Barty, F. J. Snell, D. R. Dillon and L. S.\nBradsher, \"100-picometer interferometry for EUVL,\" Proc. SPIE 4688, 316–328 (2002).\n28. J. W. Evans, K. Morzinski, S. Severson, L. Poyneer, B. Macintosh, D. Dillon, L. Reza, D. Gavel, D. Palmer, S.\nOlivier, and P. Bierden, \"Extreme adaptive optics testbed: Performance and characterization of a 1024-MEMS\ndeformable mirror,\" Proc. SPIE 6113, 61130I (2006).\n29. S. A. Severson, B. Bauman, D. Dillon, J. Evans, D. Gavel, B. Macintosh, K. Morzinski, D. Palmer, and L.\nPoyneer, \"The extreme adaptive optics testbed at UCSC: Current results and coronagraphic upgrade,\" Proc. SPIE\n6272, 62722J (2006).\n30. R. Conan, C. Bradley, P. Hampton, O. Keskin, A. Hilton, C. Blain, \"Distributed modal command for a two-\n\n\fdeformable-mirror adaptive optics system,\" Appl. Opt. 46, 4329–4340 (2007).\n31. K. Morzinski, K. B. W. Harpsøe, D. Gavel, S. M. Ammons, \"The open-loop control of MEMS: Modeling and\nexperimental results,\" Proc. SPIE 6467, 64670G, (2007).\n32. C. R. Vogel and Q. Yang, \"Modeling, simulation, and open-loop control of a continuous facesheet MEMS deformable mirror,\" J. Opt. Soc. Am. A 23, 1074–1081 (2006).\n33. J. B. Stewart, A. Diouf, Y. Zhou, and T. G. Bifano, \"Open-loop control of a MEMS deformable mirror for largeamplitude wavefront control,\" J. Opt. Soc. Am. A 24, 3827–3833 (2007).\n\n1.\n\nIntroduction\n\nDirect imaging of extrasolar planet candidates around main-sequence stars has recently been\nrealized[1, 2, 3] employing current adaptive optics (AO) systems and the angular differential\nimaging technique[4]. Such high-contrast observations with ground-based telescopes require\ncareful control of the incident wavefront, eliminating noise so that faint sources can be detected.\nDesigned specifically for high-contrast imaging, the Gemini Planet Imager (GPI)[5, 6] will use\nan \"extreme\" adaptive optics (ExAO) system to flatten the incident wavefront.\nKey to this ExAO system is the high-order deformable mirror (DM), a polysilicon\nmicro-electrical mechanical systems (MEMS) DM developed by Boston Micromachines\nCorporation[7]. Consisting of thousands of individually addressable actuators in a coin-sized\nspace, MEMS DMs are a low-cost approach to high-order wavefront correction; however,\nMEMS devices exhibit less mechanical stroke than conventional piezo-actuated DMs.\nStroke saturates when the desired DM shape at a given actuator is beyond that actuator's\nrange of motion. Saturation degrades the wavefront correction and scatters light into the region\nthat should remain dark for detection of faint sources. This paper evaluates avoiding stroke\nsaturation through addition of a second low-order, high-stroke DM in tandem with the MEMS\nDM.\n2.\n\nBackground\n\nMEMS devices were chosen as the high-order wavefront corrector for GPI because of their\ncost-effectiveness, high-actuator density, and agreeable performance. The mirrors can be batchfabricated using a silicon foundry approach similar to that used to make integrated circuits, for\na cost an order of magnitude cheaper per actuator than that of traditional piezoelectric DMs.\nMEMS technology is scalable to the actuator count required for ExAO high-contrast imaging.\nA series of prototype MEMS devices (two 144-element, ten 1024-element, and two 4096element DMs) has been thoroughly tested at the University of California at Santa Cruz's Laboratory for Adaptive Optics (LAO). At the sub-nanometer level, hysteresis is negligible[8] and\nMEMS devices are temporally stable and precisely positionable[9]. A MEMS DM has been\nflattened to 0.54 nm rms in the control band[10] and has achieved 10−6 contrast at the far\nfield[11]. An AO system using a 144-actuator MEMS DM has been successfully tested onsky at Lick Observatory[12, 13]. Figure 1 shows the LAO's first 4096-actuator DM, called an\n\"engineering-grade\" device because it is useable for testing and characterizing but is not fully\nfunctional across the mirror as required for GPI's \"science-grade\" MEMS.\nResidual low-frequency wavefront error in the GPI optical train will scatter star light into the\nregion of the focal plane that should be kept dark in order to detect planets. This is often referred\nto as the \"dark hole\" region, and its size is set by the smallest-spatial-frequency control band,\ni.e. the spacing of the MEMS actuators in the Fourier domain[14]. Actuators on the deformable\nmirror that are broken, dead, or stuck scatter light into the dark hole by virtue of their influence\nfunctions producing a wide PSF in the far-field image. Saturated actuators are problematic for\nhigh-contrast imaging because, optically, insufficient stroke has the same effect as a broken,\ndead, or stuck actuator.\n\n\fFig. 1. 4096-element MEMS deformable mirror in the Laboratory for Adaptive Optics.\nCenter square is the reflective surface. The DM is packaged on a ceramic chip carrier and\nenclosed within a refillable dry-nitrogen-gas chamber behind a pressure window.\n\nThe following example (Fig. 2) shows the effects of actuator saturation. A high-Strehl AO\ncorrection is effected by high-pass-filtering a Kolmogorov phase screen (left top, linear scale),\nwith the corresponding image at the far field (left bottom, log scale). The far-field image is\ngenerated by the Fraunhofer approximation, propagating light from the phase-aberrated pupil\nplane (the DM) with an apodized transmission function[15, 16] to the focal plane. If the phase\nmeasured at the MEMS plane is φ and the apodizer function is A, then the intensity I at the\nfar-field is simulated by calculating\n2π\nI = FT A exp\niφ\nλ\n\u0014\n\n\u0012\n\n\u0013\u0015\n\n2\n\n(1)\n\nwhere λ is the wavelength of the monochromatic light and FT means to take the Fourier transform. The second case (center) is an exaggerated illustration of actuator saturation. A low-passfiltered Kolmogorov phase screen is clipped such that all values above 2 μ m are set to 2 μ m.\nThe residuals are displayed in linear scale (center top), and below that is the corresponding\nsimulated far-field image in log scale. At right, radial averages of the two far-field images show\nthe dramatic contrast achieved in the dark hole at low spatial frequencies when there is a highStrehl AO correction (solid line). Therefore, stroke saturation (dashed line) cannot be tolerated\nsince it obscures the dark hole and any planets located there.\nThe statistics of Kolmogorov turbulence determine the stroke required of the wavefront corrector, whereas physical constraints on the DM determine its stroke capabilities. Variables that\naffect stroke capabilities include actuator design, size and spacing of actuators (i.e. pitch), and\nmaximum voltage applied to the actuator. Due to the small (340–400-μ m) pitch and the continuous facesheet on the MEMS, bending stresses limit high-spatial-frequency stroke on current\ndevices to 1.2 μ m surface. The capacitor gap limits low-spatial-frequency stroke to 3.4 μ m\nsurface. Furthermore, stroke may also be drawn on to remove inherent curvature of the device\nand for tip/tilt residuals.\nPrevious LAO articles reported on MEMS stroke as a function of spatial frequency[9, 17, 18].\nThree MEMS devices have been tested and the GPI MEMS has been specified for stroke at low\n\n\fFig. 2. Illustration of the consequences of stroke saturation. Left top: High-pass-filtered\nKolmogorov phase screen, linear scale, and its simulated far-field image (left bottom), log\nscale. Center top: Exaggerated simulation of saturation with clipped Kolmogorov phase\nscreen, linear scale, and its simulated far-field image (center bottom), log scale. Right:\nRadial averages of the simulated far-field images. Solid line: High-Strehl AO correction.\nDashed line: Stroke saturated above 2 μ m.\n\nand high spatial frequencies; Table 1 compiles the results. Norton et al.[18] give more details of\nthe \"engineering-grade\" 4k-MEMS characterization. The GPI \"science-grade\" 4k-MEMS has\nnot yet been delivered, but its specifications are given.\nMEMS\nActuator Pitch\nDevice\nCount\n[μ m]\nEmpirical Measurements\nW107#X\n1024\n340\nW107#X†\n1024\n340\nW95#39\n1024\n400\n4kEng#1\n4096\n400\nSpecifications\nGPI 4k\n4096\n400\n\nMax. Volt.\nApplied\n\nLow-freq. stroke\n[μ m surface]\n\nHigh-freq. stroke\n[μ m surface]\n\n160\n200\n200\n225\n\n1.0\n1.5\n3.2\n3.4\n\n0.2\n0.2\n0.9\n1.2\n\n260\n\n4.0\n\n1.0\n\nTable 1. Stroke measurements for a variety of MEMS DMs in the Laboratory for Adaptive\nOptics[17]. † W107#X at a maximum voltage of 200 V is the same MEMS device used for\nthe Kolmogorov saturation experiments described in Section 4.\n\nTo measure MEMS stroke at a range of spatial frequencies, one-dimensional sinusoids of\nvarying period were applied to two 1024-actuator DMs, and the resulting stroke was measured\nin each case[9, 17]. The results are plotted in Fig. 3 for the devices W107#X (pitch 340 μ m\nand tested on the voltage range 0–160 V) and W95#39 (pitch 400 μ m and tested on the voltage\nrange 0–200 V). MEMS stroke decreases with increasing spatial frequency, whereas a horizontal line on Fig. 3 would be produced by both a segmented mirror and a DM with actuators\nhaving narrow sinc influence functions (with the first zero occurring at a spacing of one actuator away). This departure from the narrow-sinc case indicates that the broad MEMS influence\nfunctions[19] have the effect of reducing the stroke as spatial frequency increases.\nRather than plotting a single line with each data series on Fig. 3, two line segments joined\n\n\fby a \"knee\" fit each measurement series better. The knee in both cases is located around 9\ncycles per aperture, a 3.6-actuator period, while the influence function measured for a 340-μ mpitch MEMS falls to 4% at 2 actuators away[19], about half this period. This implies that the\nhigh-spatial-frequency stroke is controlled locally by neighboring-actuators' influence functions, whereas the low-spatial-frequency stroke is in a distinct whole-MEMS regime.\n\nFig. 3. LAO testing of stroke as a function of spatial frequency for two MEMS deformable\nmirrors. Diamonds: Device W107#X, pitch 340 μ m, voltage range 0–160 V. Plus-signs:\nDevice W95#39, pitch 400 μ m, voltage range 0–200 V. The \"knee\" is located around 9\ncycles per aperture for both devices. Note that a DM having sinc influence functions that\nfall to zero one actuator away would produce a horizontal line on this plot, as would a\nsegmented mirror.\n\n3.\n\nTheory\n\nIn a woofer-tweeter architecture, two DMs are arranged in series and both are conjugate to the\nsame optical plane, usually that of the telescope pupil. The low-actuator-count, high-stroke DM\nis termed the \"woofer,\" and the high-actuator-count, low-stroke DM is the \"tweeter,\" a MEMS\nin the case of GPI. As a consequence of the Kolmogorov turbulence spectrum, atmospheric turbulence strength decreases with spatial frequency[20], making the woofer-tweeter architecture\nfeasible. The woofer DM corrects the higher-stroke, lower-spatial-frequency aberrations while\nthe tweeter corrects the lower-stroke, higher-spatial-frequency aberrations.\nFrom Kolmogorov turbulence theory one can calculate the expected stroke requirement for a\ndeformable mirror at a given telescope[21]. At Gemini South, the planned location of GPI, the\nprimary is D = 8 m and a typical Fried parameter is r0 = 14 cm. The power spectral density Φ\nof Kolmogorov turbulence goes as Φ(κ ) ∝ κ −5/3 , where κ is the wave number. The formula\n\n\ffor fitting error in radians σF as a function of r0 and the actuator spacing d is\n\nσF2\n\n= αF\n\n\u0012\n\nd\nr0\n\n\u00135/3\n\n,\n\n(2)\n\nwhere αF is a constant that depends on the influence function for the deformable mirror in\nquestion[22, 23].\nFor a continuous facesheet DM, αF = 0.14 for circular segments with piston and tip/tilt\nactuation capabilities[24]. Let us take this value for αF , put the primary diameter D = d = 8 m,\nr0 = 14 cm, and λ = 500 nm. To calculate the total stroke requirement, we convert Equation 2\nfrom square radians to microns surface, and multiply by 5 to obtain a ±5σ correction:\n\nσF = (±5)\n\n\u0012 \u00135/6\n\u0012 \u0013\u0012 \u0013\nλ √\nD\n1\nαF\n= ±2.17 μ m surface = 4.3 μ m surface P − V.\n2\n2π\nr0\n\n(3)\n\nThe factor of 1/2 converts from phase to surface and λ /(2π ) converts from radians to microns.\nHowever, 4.3 μ m surface is the stroke requirement at the center of the pupil, and due to factors\nincluding non-stationarity of phase[25] (which adds 20% at the edges of the pupil), inherent\ncurvature of the MEMS (on the order of a few μ m for current devices), and tip/tilt residuals, up\nto ∼ 10 μ m stroke is desired[26]. From Table 1 we see that the 4k-MEMS devices do not get\nas much as 10 μ m stroke, so it was determined that a woofer DM was needed.\nEquation 2 can also be used to calculate the residuals after applying a woofer, which gives\nthe stroke requirement for the tweeter in microns surface:\n\nσF =\n\n\u0012\n\u0013\n\u0012 \u0013\u0012 \u0013\ndwoo f 5/6\n1\nλ √\n,\nαF\n2\n2π\nr0\n\n(4)\n\nwhere dwoo f is the woofer actuator spacing. In this case the αF parameter becomes 0.28-\nappropriate for the influence function of a continuous facesheet DM[24].\nVarying dwoo f in Equation 4 and multiplying the final result by ±3–5 to get the 3–5-sigma\nstroke requirement, the tweeter stroke required for each woofer degree of freedom is plotted in\nFig. 4. Note that the stroke requirement quoted above of 10 μ m is for a 8-m pupil and r0 = 14 cm\nwhile Fig. 4 is for a 5-m pupil and r0 = 15 cm. For the parameters in Fig. 4, using a woofer\nmitigates the tweeter stroke requirement to a more manageable ∼1 μ m surface. Total stroke\n5\nrequired rises as D 6 with primary diameter (i.e. Equation 3), which increases the requirement\non the woofer but not the tweeter. Rather, tweeter stroke is a function of the woofer pitch,\nnot the primary diameter. Therefore, experiments simulating a 5-m pupil are still valid for the\n8-m pupil case in regards to the tweeter. Laboratory experiments follow to verify empirically\nthe ability of the MEMS to form Kolmogorov atmosphere shapes, using a woofer to avoid\nsaturation.\n4.\n\nExperiment\n\nWe tested MEMS device W107#X for stroke saturation when being deformed to correct for\nKolmogorov turbulence. W107#X has a 340-μ m pitch and was applied with a maximum voltage of 200 V. From Table 1, we see its low-order stroke is 1.5 μ m surface and its high-order\nstroke is 0.2 μ m surface. While this DM does not have as much stroke as the final GPI 4kMEMS will, the experiments are useful in determining whether inter-actuator or peak-to-valley\nstroke causes more saturation events.\nDevice W107#X has 1024 actuators (32 across) rather than the 44-actuators-across GPI will\nuse. Thus, because the high spatial frequencies on the MEMS were of more interest than the\n\n\fFig. 4. Tweeter stroke required as a function of woofer degrees of freedom for r0 = 15 cm,\nbased on Equation 4.\n\nlow, the MEMS pitch with respect to the primary was held fixed at the GPI value (18 cm), meaning the size of the pupil in this experiment corresponds to a 5-m telescope. The comparative\nmapping between the MEMS actuators and the telescope pupils is shown in Fig. 5, superimposed over a Kolmogorov phase screen. The entire square image contains 44x44 actuators,\nthe outer inscribed circle delineates an 8-m pupil (GPI), the inner black square marks 32x32\nactuators, and the inner inscribed circle delineates a 5-m pupil (this laboratory experiment).\nMeasurements were made using the phase-shifting diffraction interferometer[27], a subnanometer-absolute-accuracy measuring instrument situated on the ExAO testbed[28, 29] at\nthe LAO. A spherical wave (f/220) converges from a beam size of 12 mm at the MEMS plane\nto the surface of a pinhole aligner, where it is combined with a reference beam. The reference\nbeam emerges from a fiber in spherical waves, emitted through the 2.5-μ m pinhole to interfere\nwith the reflected test beam. This reference wave has an excellent wavefront quality (λ /500)\nwith which to compare the test beam. The resulting diverging spherical wave fringes are imaged\non a CCD camera. The interferogram is numerically back-propagated using a Huygens method\nto obtain phase and amplitude data at the MEMS plane.\nThe free parameters in the saturation experiment were the Fried coherence size, r0 , and the\nwoofer pitch, dwoo f . The procedure was as follows: An atmospheric turbulence screen with the\nspecified r0 was generated in software by enforcing Kolmogorov turbulence statistics upon an\narray of random numbers. Compensation of the atmosphere screen by an ideal woofer DM with\nthe specified dwoo f was simulated by removing all the power at low spatial frequencies below\nthe appropriate cutoff frequency in the Fourier domain. The resultant phase screen contained\nonly the higher spatial frequencies. The MEMS was then \"closed to\" this turbulence screen\nin closed-loop by using the screen as the reference. That is, rather than taking a flat shape as\nthe target of the closed-loop algorithm, the target for convergence was the phase screen. After\n\n\fFig. 5. To-scale mapping of 8m Gemini pupil (outer gray circle), 5m testbed pupil (inner\ngray circle), 44x44-actuator array for GPI (full grid), and 32x32-actuator array of MEMS\nin testbed (black). Fine white grid delineates individual MEMS actuators.\n\nrunning 20 closed-loop iterations, the iteration with the lowest rms wavefront error between the\ntarget phase screen and the measurement was taken for analysis, along with the corresponding\nvoltage array on the MEMS. Convergence did not generally improve after 15 iterations.\nFig. 6 is a histogram of the stroke inputs at individual actuators' locations. Three curves are\nplotted, showing the input Kolmogorov phase screens for r0 = 15 cm cases with no woofer\n(piston and tip/tilt removal only), 100-cm-pitch woofer, and 50-cm-pitch woofer. There were\nten screens of each case for these parameters. This plot shows the stroke range applied to the\nindividual actuators to make the input Kolmogorov phase screens. The woofer dramatically\nreduces the phase variance input to the tweeter.\n5.\n\nResults\n\nTaking the best closed-loop iteration in each case, any phase-wrapping (an interferometry artifact) was removed by masking out the bad data points. Additionally masked out was the 3x3\nregion centered on a dead actuator located at coordinate [22, 8] (the origin is in the lower-lefthand corner and counting starts with 0). This was to avoid its being counted as \"saturated\" in\neach frame.\nThe corresponding array of voltages applied to the MEMS was used to determine saturation\nby the criteria that any actuator commanded to the minimum (0 V) or maximum (200 V) was\n\n\fFig. 6. Histogram of individual actuator phases input for the r0 = 15 cm experiment.\nDashed line: No woofer (piston and tip/tilt removal only); Dashed-dotted line: 100-cmpitch woofer correction; Solid line: 50-cm-pitch woofer correction.\n\ndeclared \"saturated.\" Table 2 lists the set of parameters explored and gives the number of actuators saturated. The number of actuators tested varies due to different numbers of trials and\ndifferent numbers of actuators remaining within the unmasked region after discarding phasewrapped data. For r0 = 10 cm and dwoo f = 31 cm, zero actuators were saturated out of the 4852\ntested. Therefore, the probability of saturation in that case was calculated using the binomial\ntheorem and taking the outside-3-σ probability for the upper limit. Figure 7 plots the saturation√\nfrequency as a function of woofer pitch for r0 = 10–15 cm. Error bars are standard error\n(σ / N). A power law is fit to each series.\nActuator voltage maps give a qualitative picture of close saturation encounters for the MEMS\nin closing to a Kolmogorov phase screen. Figure 8 shows three typical actuator voltage maps.\nSaturated actuators are identified with a white cross (saturated low) or a black diamond (saturated high). The first case is a typical iteration for r0 = 10 cm and no woofer (piston and\ntip/tilt removal only). The mean number of saturated actuators for these parameters was 16 per\ntrial, and this particular iteration has three actuators saturated high and eleven saturated low.\nThe second case is a typical iteration for r0 = 10 cm and dwoo f = 134 cm. The mean number\nof saturated actuators for these parameters was two per trial, and this particular iteration has\ntwo actuators saturated low and none saturated high. The third case is a typical iteration for\nr0 = 10 cm and dwoo f = 62 cm. The mean number of saturated actuators for these parameters\nwas one per trial, and this particular iteration has one actuator saturated low and none saturated\nhigh.\nBesides using these actuator voltage maps to display the number of saturated actuators, we\nalso notice something qualitative yet important with these plots: saturated actuators occur either\nsingly or else in clumps. They do not, however, occur in pairs of one up and one down: in the\nclumpy patches of saturated actuators, all members of the saturated clump are either high or low.\nIn all, 140 trials total were done (57 046 actuators were tested after masking out bad data), and\nthere are no instances of two adjacent saturated actuators in which one was saturated high and\nthe other low. Thus, the most extreme case of inter-actuator saturation at opposing positions\n\n\fFig. 7. Saturation frequency as a function of woofer pitch. Data for experiments at r0 = 10–\n15 cm are represented by asterisks and diamonds, respectively, while a power-law fit to each\nexperiment is represented by a dotted and a dashed line, respectively. Solid and dasheddotted curves are predictions for r0 = 10–15 cm, respectively, calculated with Equation 4\n(see details in Section 6). The fitting-error constant αF used to derive the predictions was\nvaried smoothly from 0.14 (piston/tip/tilt only) to 0.28 (continuous facesheet DM) over the\nrange dwoo f /D > 0.25. This is due to mapping arguments: at the largest dwoo f /D ratios, the\npitch of one woofer actuator is a good fraction of the primary diameter, and thus whether\nthe woofer actuators overlap or align with the pupil edge becomes important in determining\nthe fitting error. This choice (of 4-woofer-actuators-across as the limit for where the DM\nbecomes like a continuous facesheet) affects the steepness of the predicted curves but not\ntheir endpoints, and we note that only one of our experimental data points (290-cm-pitch\nwoofer for r0 =15 cm) is well inside this regime where αF is approximated. We see that the\nsaturation incidence if narrow sinc influence functions are assumed should have fallen off\nmore steeply than measured. Thus decreasing the woofer pitch did not reduce saturation\noccurrence as much as expected. Moderate to high spatial frequencies are saturating more\non the MEMS than expected, and a simple analytical calculation underpredicts the stroke\nrequirement.\n\n\fr0\n[cm]\n10\n10\n10\n10\n10\n10\n15\n15\n15\n\nWoofer Pitch\n[cm]\n31\n40\n62\n134\n290\npiston/tip/tilt⋆\n50\n100\npiston/tip/tilt⋆\n\n# Actuators\nTested\n4852\n4359\n12 943\n6228\n2790\n9494\n5699\n5620\n5061\n\nFrac. Saturated Actuators\n[parts per thousand]\n0.01†\n2.2\n2.5\n7.0\n21\n46\n0.17\n0.37\n30\n\nTable 2. Stroke saturation results: Fraction of actuators saturated for each set of (r0 , dwoo f )\nparameters, after removing piston and tip/tilt. The number of actuators tested in each case is\nequal to the total number of MEMS actuators within the pupil, summed over all trials. This\nquantity varies according to two effects: there is a non-uniform number of trials conducted\nfor each set of parameters, and there is a non-uniform number of actuators analyzed inside\nthe pupil for each trial. The pupil nominally encircles ∼ 600 actuators, but actuators are\nmasked out and not counted if they are in regions where phase-wrapping occurs in the\ninterferometric measurement. ⋆ At the largest woofer-pitch end, no woofer was used-only\npiston and tip/tilt were removed over a 5-m aperture. We therefore adopted \"500 cm\" as\nthe abscissa for these data to be able to plot the corresponding ordinate from column 4 onto\nFig. 7. † Upper limit.\n\nis not occurring. However, we will see below that moderate to high spatial frequencies were\nproblematic in another sense.\nFigure 9 shows the peak-to-valley stroke histogram for various woofer pitches, as noted in\nthe legend. The trials without a woofer (piston and tip/tilt removal only) had a peak-to-valley\nstroke ranging from 0.8 to 1.7 μ m surface. Using a woofer reduces the peak-to-valley stroke\nrequired of the MEMS by a factor of 3–4, down to 0.2 to 0.5 μ m surface. Note that a maximum\nof 1.5 μ m surface stroke was measured for this MEMS, device W107#X (Table 1), in the lowfrequency stroke test. Obtaining more stroke, up to 1.7 μ m surface, with a Kolmogorov phase\nscreen is attributed to the curvature of the inherent shape of the MEMS, which is 450 nm surface\nfor this device.\nFigure 10 shows the inter-actuator stroke histogram for the same cases. Inter-actuator stroke\nis calculated by differencing the measured phase between each pair of neighboring actuators.\nNeighbors to a particular actuator are horizontally, vertically, or diagonally adjacent to that\nactuator. The woofer reduces the required inter-actuator stroke by a factor of 2–3, a smaller\nimprovement than the peak-to-valley reduction. This is as expected because the woofer actuator\nspacing remains much larger than the inter-actuator MEMS spacing (340 μ m), so the interactuator stroke is at a higher spatial frequency than the woofer can control. In addition, a highamplitude low-frequency aberration will create a slope between two neighboring actuators,\nintroducing further power at the inter-actuator level.\n6.\n\nAnalysis\n\nIn order to be able to scale these results to other configurations than our r0 and dwoo f ranges on\na 5m primary, we design a model and test it by using it to predict the measured saturation occurrence. A histogram of Kolmogorov-turbulence phase (i.e. Fig. 6) follows Gaussian statistics,\nwhich can be plotted from theory by calculating the standard deviation with Equation 4. For\n\n\fFig. 8. Maps of MEMS actuator voltages, with saturated actuators marked as follows: actuators saturated low are marked with white crosses, whereas actuators saturated high are\nmarked with black diamonds. Typical results are shown. Left: r0 = 10 cm, no woofer (piston and tip/tilt removal only). Three actuators were saturated high and 11 were saturated\nlow. Center: r0 = 10 cm, dwoo f = 134 cm. Two actuators were saturated low (none were\nsaturated high). Right: r0 = 10 cm, dwoo f = 62 cm. One actuator was saturated low (none\nwere saturated high).\n\na DM having sinc influence functions with the first zero located one actuator away, the stroke\nof the DM is the same at all spatial frequencies. Suppose the stroke of such a sinc-influencefunction DM is 1.5 μ m surface. Plot a histogram of Kolmogorov turbulence, and the phase\nwithin +1.5 μ m and −1.5 μ m are within the capabilities of this sinc-influence-function DM to\ncorrect, whereas the area outside the ±1.5 μ m cut-off is proportional to the fraction of actuators\nthat saturate.\nTable 1 and Fig. 3 show, however, that the MEMS influence functions are not ideal. Therefore, instead of using a constant 1.5 μ m as the stroke cut-off, we can take the stroke at each\nspatial frequency, scaling it by a constant multiplier to go from the measurements at 160V to\n200V. Table 3 lists the predicted number of actuators saturated for each set of parameters using\nthese methods of finding the area under the Gaussian distribution beyond the cut-off stroke.\nTwo cut-off strokes are used for comparison, the ideal DM case and the MEMS W107#X case\nwith stroke varying as a function of spatial frequency. The measurements from Table 2 are\nrepeated for comparison.\nSaturation was as frequent as expected for cases with larger woofer pitches, but was more\nfrequent than expected for cases with smaller woofer pitches. The moderate to high spatial\nfrequencies were predicted to cause less saturation on the 1.5-μ m-stroke MEMS than occurred.\nTherefore, since the model did not fit the data in this case, the theory could not be used to\nextrapolate to other configurations. However, the GPI 4k-MEMS is specified to have 5 times\nmore high-order stroke than the MEMS used in this experiment, which will further reduce\nstroke saturation.\nSurprisingly, even the second attempt at prediction (using a variable stroke cut-off for each\nparticular spatial frequency) did not match the experiments at the moderate to high spatial\nfrequencies. This can be explained by looking again at Fig. 3 and seeing how stroke continues\nto fall off, albeit less steeply past the knee, no matter what spatial frequency is taken. If the\nstroke beyond a certain point were uniform, we would be in the ideal-influence-function regime\nfor those spatial frequencies. The prediction, by using a single stroke value (at each spatial\nfrequency) for the cut-off of the Gaussian distribution, is still assuming uncorrelated narrowsinc-function actuators, whereas on the MEMS there are always higher spatial frequencies that\nlimit the stroke.\n\n\fFig. 9. Histogram of peak-to-valley (i.e. low-spatial-frequency) stroke measured for all\nMEMS actuators in the r0 = 15 cm experiment. Dashed line: No woofer (piston and tip/tilt\nremoval only); Dashed-dotted line: 100-cm-pitch woofer correction; Solid line: 50-cmpitch woofer correction. The woofer reduces the peak-to-valley stroke on the MEMS by a\nfactor of 3–4.\n\nFig. 10. Histogram of inter-actuator (i.e. high-spatial-frequency) stroke measured for all\nMEMS actuators in the r0 = 15 cm experiment. Dashed line: No woofer (piston and tip/tilt\nremoval only); Dashed-dotted line: 100-cm-pitch woofer correction; Solid line: 50-cmpitch woofer correction. The woofer reduces the inter-actuator stroke on the MEMS by a\nfactor of 2–3.\n\n\fr0\n[cm]\n\nWoofer\nPitch\n[cm]\n\n10\n10\n10\n10\n10\n10\n15\n15\n15\n\n31\n40\n62\n134\n290\npiston/tip/tilt⋆\n50\n100\npiston/tip/tilt⋆\n\nMeasured Frac.\nSat. Actuators,\nMEMS W107#X\n[parts/thousand]\n0.01†\n2.2\n2.5\n7.0\n21\n46\n0.17\n0.37\n30\n\nPredicted Frac.\nSat. Actuators,\nsinc 1.5μ m DM\n[parts/thousand]\n0.0\n0.0\n0.0\n0.04\n15\n53\n0.0\n0.0\n6.7\n\nPredicted Frac.\nSat. Actuators,\nMEMS W107#X\n[parts/thousand]\n0.0\n0.0\n0.0\n0.05\n13\n46\n0.0\n0.0\n5.2\n\nTable 3. Table of measured versus predicted stroke saturation occurrence. Predictions were\nmade by using Equation 4 as the standard deviation to plot a Gaussian distribution of all\nthe probable Kolmogorov phase values, taking the area under the curve outside the cut-off\nstroke to be proportional to the fraction of actuators saturated. The failure of the predicted\nvalues to match the measured values, except at the lowest spatial frequencies, indicates\nthat the decreasing stroke with increasing spatial frequency of W107#X is producing more\nsaturation than expected for a segmented DM or a DM with sinc influence functions. ⋆ At\nthe largest woofer-pitch end, no woofer was used-only piston and tip/tilt were removed\nover a 5-m aperture. We therefore adopted \"500 cm\" as the abscissa for these data to be\nable to plot the corresponding ordinate from columns 3–5 onto Fig. 7. † Upper limit.\n\n7.\n\nDiscussion\n\nIn systems where saturation cannot be tolerated, the wavefront correctors must have sufficient\nstroke to correct the amplitude of the phase aberrations. If deformable mirror stroke is limited, stroke can be conserved for dynamical corrections by instead using static correctors to\nremove inherent curvature to the DM itself and for correcting static aberrations in the optical path. Similarly, the unpowered shape of the DM itself should be as flat as possible so as\nto conserve stroke for correcting turbulence. The stroke requirement increases with power in\nthe Kolmogorov spectrum, so better astronomical seeing conditions will give less saturation.\nAccordingly, the astronomical site and observing conditions could be favorably selected to\nminimize stroke saturation.\nIn designing a deformable mirror, factors that reduce stroke saturation include decreasing the\nthickness of the facesheet, increasing the spacing (pitch) between actuators, increasing the operating voltage, and modifying the mechanical design of the actuator (varying parameters such\nas the capacitor gap, spring constant, flexural rigidity of the plate, or using leverage bending).\nThese are varied primarily at the research and development phase.\nIn this work we assume that piston and tip/tilt modes are corrected by other devices, and that\nthe stroke of the woofer DM is high enough to correct the frequencies below the cutoff; therefore, we are only concerned with avoiding saturation on the tweeter DM. In a dual-DM system,\nfactors that reduce tweeter saturation via sending saturable stroke to a second low-order woofer\nDM include: employing a woofer with more actuators across the pupil (the subject explored in\nthis paper); and carefully controlling the frequency distribution sent to each wavefront corrector\nin the control loop[26, 30].\nTweeter saturation occurrence can be predicted by analyzing simulations of correcting turbulence screens with model MEMS mirrors[31, 8, 32, 33]. Our results show the analytic fitting-\n\n\ferror model based on the turbulence power spectrum underpredicts incidence of stroke saturation. Our original goal in this work was to measure whether stroke saturation would be problematic for GPI. In order to assure the higher-stroke MEMS mirrors (now being fabricated) are\nadequate for GPI, we plan to measure saturation statistics with similar testing on \"engineeringgrade\" versions of the 4k-MEMS.\n8.\n\nConclusions\n\nIn this experiment we applied Kolmogorov-turbulence atmospheric phase screens to a MEMS\ndeformable mirror. The r0 of the phase screens ranged from 10–15 cm, and the pitch of the\nwoofer used to remove the low spatial frequencies ranged from 8–16 actuators across an 8-m\nprimary.\nThe MEMS when solitary suffered saturation ∼4% of the time. Using a woofer DM reduces\ndramatically the amount of phase sent to the MEMS, and thus mitigated MEMS saturation\noccurrence to a fraction of a percent.\nThe woofer did not mitigate mid-to-high-spatial-frequency stroke as much as expected. No\nneighboring actuators were saturated at opposing positions, meaning the most extreme case of\ninter-actuator saturation did not occur.\nHowever, moderate to high spatial frequencies did saturate more often than predicted based\non a Gaussian distribution of phase and somewhat-idealized influence functions. This implies\nthat correlations in actuators, i.e. high-spatial-frequency stroke limits, are significant. Attempts\nto derive the expected saturation using a simple analytical model underpredicted the stroke\nrequirements, showing that empirical studies are important.\nAcknowledgments\nThe authors thank Claire Max, Sandrine Thomas, Andrew Norton, Lisa Poyneer, Jean-Pierre\nVéran, Jean-François Lavigne, and our other lab-mates, co-workers, and colleagues for insightful discussions that contributed to this work. Furthermore, we thank the anonymous reviewers\nfor their valuable comments that improved the accuracy, clarity, and scope of the paper.\nThis work was performed under the Michelson Graduate Fellowship for the Jet Propulsion\nLaboratory, California Institute of Technology, sponsored by the United States Government\nunder a Prime Contract between the California Institute of Technology and NASA.\nThis research was supported in part by the National Science Foundation Science and Technology Center for Adaptive Optics, managed by the University of California at Santa Cruz\nunder cooperative agreement No. AST-9876783, PI Claire E. Max.\nSupport for this work was also provided by a grant from the Gordon and Betty Moore Foundation to the Regents of the University of California, Santa Cruz, on behalf of the UCO/Lick\nLaboratory for Adaptive Optics, directed by Don Gavel. The content of the information does\nnot necessarily reflect the position or the policy of the Gordon and Betty Moore Foundation,\nand no official endorsement should be inferred.\nPortions of this work were performed under the auspices of the U. S. Department of Energy by the University of California, Lawrence Livermore National Laboratory under Contract\nW-7405-ENG-48. Additionally, support for this work was provided by a minigrant from the Institute of Geophysics and Planetary Physics through Lawrence Livermore National Laboratory.\nThis research has made use of NASA's Astrophysics Data System Bibliographic Services.\n\n\f"}