{"id": "http://arxiv.org/abs/0903.2971v1", "guidislink": true, "updated": "2009-03-17T14:20:39Z", "updated_parsed": [2009, 3, 17, 14, 20, 39, 1, 76, 0], "published": "2009-03-17T14:20:39Z", "published_parsed": [2009, 3, 17, 14, 20, 39, 1, 76, 0], "title": "The role of Background Independence for Asymptotic Safety in Quantum\n  Einstein Gravity", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0903.0885%2C0903.5045%2C0903.0035%2C0903.3352%2C0903.5489%2C0903.3700%2C0903.2567%2C0903.0262%2C0903.3928%2C0903.1505%2C0903.4753%2C0903.2579%2C0903.2712%2C0903.1002%2C0903.1262%2C0903.1243%2C0903.4017%2C0903.0240%2C0903.2784%2C0903.3188%2C0903.2777%2C0903.1918%2C0903.0339%2C0903.3820%2C0903.4805%2C0903.5245%2C0903.2590%2C0903.0406%2C0903.3439%2C0903.0747%2C0903.0577%2C0903.5365%2C0903.3204%2C0903.0448%2C0903.2794%2C0903.2160%2C0903.4102%2C0903.1719%2C0903.5519%2C0903.0498%2C0903.2630%2C0903.3510%2C0903.2484%2C0903.5180%2C0903.2963%2C0903.4687%2C0903.2149%2C0903.4564%2C0903.1836%2C0903.3088%2C0903.4780%2C0903.0043%2C0903.4169%2C0903.4968%2C0903.1114%2C0903.0948%2C0903.0591%2C0903.2569%2C0903.1377%2C0903.1684%2C0903.3952%2C0903.5426%2C0903.0557%2C0903.4095%2C0903.1599%2C0903.3497%2C0903.4769%2C0903.2638%2C0903.3531%2C0903.0071%2C0903.2995%2C0903.0567%2C0903.3525%2C0903.5103%2C0903.2907%2C0903.3078%2C0903.5028%2C0903.2853%2C0903.1516%2C0903.1544%2C0903.4899%2C0903.4365%2C0903.4384%2C0903.4595%2C0903.2971%2C0903.3035%2C0903.0166%2C0903.5162%2C0903.3067%2C0903.0595%2C0903.1644%2C0903.0041%2C0903.3142%2C0903.0660%2C0903.4111%2C0903.4373%2C0903.2587%2C0903.0682%2C0903.0489%2C0903.0701%2C0903.3901&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "The role of Background Independence for Asymptotic Safety in Quantum\n  Einstein Gravity"}, "summary": "We discuss various basic conceptual issues related to coarse graining flows\nin quantum gravity. In particular the requirement of background independence is\nshown to lead to renormalization group (RG) flows which are significantly\ndifferent from their analogs on a rigid background spacetime. The importance of\nthese findings for the asymptotic safety approach to Quantum Einstein Gravity\n(QEG) is demonstrated in a simplified setting where only the conformal factor\nis quantized. We identify background independence as a (the ?) key prerequisite\nfor the existence of a non-Gaussian RG fixed point and the renormalizability of\nQEG.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0903.0885%2C0903.5045%2C0903.0035%2C0903.3352%2C0903.5489%2C0903.3700%2C0903.2567%2C0903.0262%2C0903.3928%2C0903.1505%2C0903.4753%2C0903.2579%2C0903.2712%2C0903.1002%2C0903.1262%2C0903.1243%2C0903.4017%2C0903.0240%2C0903.2784%2C0903.3188%2C0903.2777%2C0903.1918%2C0903.0339%2C0903.3820%2C0903.4805%2C0903.5245%2C0903.2590%2C0903.0406%2C0903.3439%2C0903.0747%2C0903.0577%2C0903.5365%2C0903.3204%2C0903.0448%2C0903.2794%2C0903.2160%2C0903.4102%2C0903.1719%2C0903.5519%2C0903.0498%2C0903.2630%2C0903.3510%2C0903.2484%2C0903.5180%2C0903.2963%2C0903.4687%2C0903.2149%2C0903.4564%2C0903.1836%2C0903.3088%2C0903.4780%2C0903.0043%2C0903.4169%2C0903.4968%2C0903.1114%2C0903.0948%2C0903.0591%2C0903.2569%2C0903.1377%2C0903.1684%2C0903.3952%2C0903.5426%2C0903.0557%2C0903.4095%2C0903.1599%2C0903.3497%2C0903.4769%2C0903.2638%2C0903.3531%2C0903.0071%2C0903.2995%2C0903.0567%2C0903.3525%2C0903.5103%2C0903.2907%2C0903.3078%2C0903.5028%2C0903.2853%2C0903.1516%2C0903.1544%2C0903.4899%2C0903.4365%2C0903.4384%2C0903.4595%2C0903.2971%2C0903.3035%2C0903.0166%2C0903.5162%2C0903.3067%2C0903.0595%2C0903.1644%2C0903.0041%2C0903.3142%2C0903.0660%2C0903.4111%2C0903.4373%2C0903.2587%2C0903.0682%2C0903.0489%2C0903.0701%2C0903.3901&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We discuss various basic conceptual issues related to coarse graining flows\nin quantum gravity. In particular the requirement of background independence is\nshown to lead to renormalization group (RG) flows which are significantly\ndifferent from their analogs on a rigid background spacetime. The importance of\nthese findings for the asymptotic safety approach to Quantum Einstein Gravity\n(QEG) is demonstrated in a simplified setting where only the conformal factor\nis quantized. We identify background independence as a (the ?) key prerequisite\nfor the existence of a non-Gaussian RG fixed point and the renormalizability of\nQEG."}, "authors": ["Martin Reuter", "Holger Weyer"], "author_detail": {"name": "Holger Weyer"}, "author": "Holger Weyer", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1007/s10714-008-0744-z", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/0903.2971v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0903.2971v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "2 figures. Talk given by M.R. at the WE-Heraeus-Seminar \"Quantum\n  Gravity: Challenges and Perspectives\", Bad Honnef, April 14-16, 2008; to\n  appear in General Relativity and Gravitation", "arxiv_primary_category": {"term": "hep-th", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "hep-th", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "gr-qc", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0903.2971v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0903.2971v1", "journal_reference": "Gen.Rel.Grav.41:983-1011,2009", "doi": "10.1007/s10714-008-0744-z", "fulltext": "arXiv:0903.2971v1 [hep-th] 17 Mar 2009\n\nMZ-TH/08-23\n\nThe role of Background Independence\nfor Asymptotic Safety in\nQuantum Einstein Gravity∗\nM. Reuter and H. Weyer\nInstitute of Physics, University of Mainz\nStaudingerweg 7, D–55099 Mainz, Germany\n\nAbstract\nWe discuss various basic conceptual issues related to coarse graining flows in\nquantum gravity. In particular the requirement of background independence is\nshown to lead to renormalization group (RG) flows which are significantly different from their analogs on a rigid background spacetime. The importance of these\nfindings for the asymptotic safety approach to Quantum Einstein Gravity (QEG) is\ndemonstrated in a simplified setting where only the conformal factor is quantized.\nWe identify background independence as a (the ?) key prerequisite for the existence\nof a non-Gaussian RG fixed point and the renormalizability of QEG.\n\nTalk given by M.R. at the WE-Heraeus-Seminar \"Quantum Gravity: Challenges and Perspectives\",\nBad Honnef, April 14-16, 2008.\n∗\n\n\f1\n\nIntroduction\nFinding a logically consistent and predictive quantum theory of gravity continues\n\nto be one of the most challenging open problems in theoretical physics. Even though\nthe recent years have seen considerable progress in loop quantum gravity, string theory,\nand asymptotic safety, to mention just three approaches [1], it seems that certain essential\ningredients of a satisfactory microscopic theory are still missing or only poorly understood.\nIn any of these approaches one typically encounters problems which are conceptually very\ndifficult and deep, and at the same time highly complex from the calculational point of\nview. On the conceptual side, the most severe problem is perhaps the issue of background\nindependence [2–4]. Already classically General Relativity is distinguished from all other\nphysical theories in that it does not only tell us how physical processes take place in a\ngiven spacetime but also describes the dynamics of spacetime itself. Many problems one\nencounters when searching for a quantum theory of gravity can be traced back to this\ncrucial property of General Relativity, namely that it dynamically generates the \"arena\"\nin which all physics is going to take place. In particular, the mediator of the gravitational\ninteraction, the metric or closely related fields, defines the proper length or mass scale of\nall dimensionful physical quantities.\n(A) Asymptotic Safety In the following we investigate a particular aspect of background (in)dependence which is particularly important in the context of asymptotic\nsafety [5–28]. In this approach gravity is described by a quantum field theory of the\nmetric tensor which is renormalized at a non-Gaussian renormalization group (RG) fixed\npoint. This quantum field theory is defined by a functional RG trajectory on a \"'theory space\" consisting of well-behaved diffeomorphism invariant action functionals. This\ntrajectory must be complete in the sense that it has neither an infrared nor an ultraviolet cutoff. In the ultraviolet the absence of unphysical divergences is guaranteed by the\nrequirement that the trajectory must hit a fixed point there.\n(B) Coarse graining in gravity In order to implement this idea one has to pick a\nconcrete RG framework. In principle many choices are possible here; they differ by the\ngenerating functionals they employ, in the way field configurations get \"integrated out\"\n\n1\n\n\falong the RG flow, and, related to that, the interpretation of the corresponding RG scale,\nhenceforth denoted k. In theories on flat spacetime there exist implementations of the\nWilsonian RG, the effective average action [29–32] for instance, which have the special\nproperty that the mass scale k has a \"quasi–physical\" meaning in the following sense: The\nbasic functional RG equation (FRGE) describes the k-dependence of a family of effective\nactions {Γk , 0 ≤ k < ∞} each of which defines an effective field theory valid near the\n\nscale k.\n\nGoing over to quantum gravity it is not clear a priori how one could introduce an RG\nscale with a comparable physical meaning. The problem is that if k is to have the status\nof a physical momentum it must be a proper rather than merely a coordinate momentum.\nHowever, proper momenta, distances, or other dimensionful quantities require a metric\nfor their definition, and if the metric is dynamical it is not clear with respect to which\nmetric k should be \"proper\". Proceeding naively, the average action of gravity would be\na functional Γk [gμν ] which, besides k, depends on a single argument gμν . More precisely,\nΓk [ * ], for every fixed value of k, is a map from the space of metrics into the reals. This\n\nimplies that from the point of view of Γk [ * ] with k fixed all metrics have an equal status\n\nso that k cannot be \"proper\" with respect to any particular one of them. This is a direct\n\nconsequence of background independence. It entails that the naive implementation of\nthe average action idea, leading to a family of functionals {Γk } which depend only on\n\none metric argument, cannot be labeled by an RG scale with the above \"quasi–physical\"\ninterpretation.\n\n(C) The gravitational average action The actual effective average action for gravity\nconstructed in [6] achieves the desired \"quasi–physical\" status of k by using the background field technique. The idea is to fix an arbitrary background metric g μν , quantize\nthe (not necessarily small) metric fluctuations hμν nonperturbatively in this background,\nand finally adjust g μν in such a way that the expectation value of the fluctuation vanishes:\nhμν ≡ hhμν i = 0. In this way the background gets fixed dynamically. The advantage of\n\nthis procedure is that the quantization can take advantage of many nonperturbative tools\ndeveloped for field theories on non-dynamical backgrounds. More imortantly it is background independent in the sense that no special g μν plays any distinguished role. During\n\n2\n\n\fthe quantization of the hμν -field the background metric is kept fixed but is never specified\nexplicitly.\nIn this construction the RG scale k is \"proper\" with respect to the background\nmetric. Technically one organizes the path integral over hμν according to eigenmodes of\nthe covariant Laplacian D 2 (g μν ) built from g μν and cuts off the integration at the infrared\n(IR) scale k 2 . This is done by adding a mode suppression term ∆k S to the bare action.\nHence k is a g μν -proper momentum related to the scale set by the \"last mode integrated\nout\" and can be given an approximate physical meaning therefore. (See [22, 23] for a\ndetailed discussion of this point.) This property of the gravitational average action is the\ncentral prerequisite for the effective field theory interpretation and for the possibility of\nperforming \"RG improvements\" on the basis of Γk [33–44].\nThe price one has to pay for this advantage is that the average action is now a functional of two metrics: Γk [gμν , g μν ] ≡ Γk [ hμν ; g μν ]. Here gμν ≡ g μν + hμν is the expectation\n\nvalue of the microscopic metric. Only after having solved for the (now more complicated) RG flow of Γk [gμν , g μν ] one can impose hμν = 0 and define the reduced functional\nΓk [gμν ] ≡ Γk [gμν , gμν ] which generates the same on-shell matrix elements as the original\n\none [45].\n\n(D) \"Background independence\" via background field technique It should be\nstressed that the average action Γk [ * , * ] and its RG flow are \"background independent\"\n\nobjects, in the sense of the word as it is used in loop quantum gravity [2–4], for instance.\n\nBoth metrics, gμν and g μν , are just freely variable arguments and no metric plays any\ndistinguished role1 . Furthermore, the mode cutoff is defined in terms of D 2 ( gμν ) which\ninvolves the variable metric g μν and not any rigid one. This is in sharp contrast to\nnon-dyn\nmatter field theories on a non-dynamical spacetime with a metric gμν\n. There ∆k S is\nnon-dyn\nconstructed from D 2 (gμν\n) which does indeed single out a specific metric. The resulting\n\nflow is not \"background independent\" in the above sense.\nBesides fixing the physical scale of k, the use of the background field technique has\n1\n\nHere and in the following the term \"background independence\", put in quotation marks, means the\n\nabsence of a preferred metric. Referring to the background field formalism, no quotation marks will be\nused.\n\n3\n\n\fa second, conceptually completely independent advantage: If one employs a gauge fixing\nterm which is invariant under the background gauge transformations the resulting average\naction is a diffeomorphism invariant functional of its arguments [45].\nIn the construction of the gravitational average action in [6] these two issues are\nintertwined and because of the complexity of realistic RG flows it is not easy to see how\nprecisely the g μν -dependence of the IR cutoff ∆k S[hμν ; g μν ] influences the flow. We shall\ndescribe this influence in a setting as \"clean\" as possible, namely in an approximation to\nthe full gravitational RG flow where gauge issues play no role and the impact of this gdependence of the cutoff can be studied in isolation. The implications of the g-dependence\nare at the very heart of quantum gravity. It arises only because the metric has the crucial\nproperty, not shared by any other field, of defining the proper size of all dimensionful\nquantities, including that of k.\nWithin a different theory of gravity, and in a different formal setting, Floreanini and\nPercacci [46] have made similar observations. They studied a perturbatively renormalizable gauge theory of vielbein and spin connection fields. While asymptotic safety is not an\nissue there, they demonstrated that the quantization of the model results in a \"bimetric\ntheory\", and depending on which metric is used in the ultraviolet (UV) regulator different\neffective potentials are obtained for the conformal factor.\n(E) The conformally reduced theory The system we are going to study in the following obtains by approximating the gravitational RG flow in two ways: First, we restrict the\ntheory space to that of the familiar Einstein–Hilbert truncation whose RG flow is known\nin full generality [6, 9]. Second, we quantize only the conformal factor of the metric but\nnot the other degrees of freedom it carries. This \"conformally reduced Einstein–Hilbert\"\n(or \"CREH\") truncation leads to a modified RG flow on the same theory space as the full\nEinstein–Hilbert truncation, and it will be very instructive to compare the two.\nAll metrics appearing in the CREH framework, the integration variable in the path\ngμν \" where\nintegral, γμν , as well as g μν and gμν , are of the type \"conformal factor times b\n\ngμν is a reference metric which is never changed; for example, b\nb\ngμν = δμν . In this way,\n\nγμν , g μν , and gμν get represented by a single \"scalar\" function, their respective conformal\ngμν . If one inserts\nfactor. The background metric, for instance, is written as g μν = χ2B (x) b\n4\n\n\fthe metric φ2 b\ngμν into the Einstein–Hilbert action one obtains a φ4 -type action for the\nfield φ, with a φ4 -coupling proportional to the cosmological constant. We shall analyze\nthis scalar–looking theory by means of an effective average action. We use a background\n\napproach which is analogous to the one used in the full gravitational FRGE. In particular\nthe conformal factor of g μν sets the physical scale of k. So, conceptually, this simplified\nsetting is exactly the same as in the full gravitational flow equation, the only difference is\nthat we allow only the quantum fluctuations of the conformal factor to contribute to the\nRG running of the couplings, i. e. the Newton and the cosmological constant, respectively.\n(F) Conformal factor vs. φ4 -theory The standard quantization of φ4 -theory by means\nof an FRGE for the average action is fairly well understood [31]. It amounts to using a\ng μν -independent cutoff. Here ∆k S is built from b\ngμν which is usually taken to be the metric\n\nof flat Euclidean space. It is this metric b\ngμν which defines the meaning of k. This scheme\n\nis the natural one when φ is a conventional scalar matter field. By now a lot is known\nabout the resulting RG flow [31]. In particular, above all mass thresholds one recovers\nthe ln(k)-running of the φ4 -coupling which is familiar from perturbation theory.\n\nIf φ is the conformal factor of the metric the situation is different. Now it is natural\ngμν ;\nto define ∆k S and hence k in terms of the adjustable background metric g μν = χ2B (x) b\n\nits conformal factor χB is determined dynamically by the condition that the fluctuations\n\nabout χB have vanishing expectation value. We shall see that the resulting RG flow is\nquite different from the standard scalar one. Typically one finds that the RG running is\nmuch faster in the gravitational case.\nFor instance, there is a regime where the slow ln(k)-running of the standard scalar is\nreplaced by a much stronger k 4 -running of the φ4 -coupling. In this regime the φ4 -coupling\nis proportional to the cosmological constant, Λk . Hence, in this particular regime, Λk ∝ k 4 .\n\nThis quartic cutoff dependence is something very well known, of course. It is precisely\n\nwhat one finds by summing zero-point energies, or rediscovers as quartic divergences in\nordinary Feynman diagram calculations. Moreover it agrees with the result from the full\nEinstein–Hilbert truncation.\nTo summarize this important point: The (expected) behavior Λk ∝ k 4 obtains only\n\nif we respect \"background independence\" and appreciate the very special role of gravity,\n\n5\n\n\fnamely that it determines all proper scales, including that of k. We find Λk ∝ k 4 only if\nwe define the cutoff with g μν = χ2B (x) b\ngμν , while we obtain the much weaker k-dependence\nΛk ∝ ln(k) if we treat φ as an ordinary scalar.\n\nEarlier on Polyakov [47] and Jackiw et al. [48] have pointed out that in the CREH\n\napproximation the gravitational action is of the φ4 -type and argued on the basis of standard scalar field theory that the cosmological constant should have a logarithmic scale\ndependence therefore. Our results indicate that if one wants to attach a physical meaning\nto k by measuring it in units of φ itself the running of Λk is much faster in fact.\n(G) Asymptotic safety in a φ4 -type theory Perhaps the most unexpected and striking feature of the CREH flow is that it admits a non-Gaussian RG fixed point (NGFP)\nwith exactly the same qualitative properties as the one in the full Einstein–Hilbert truncation. The comparatively simple dynamics of a φ4 -theory is enough to achieve asymptotic\nsafety provided one quantizes the theory in a \"background independent\" way.\nAt the NGFP the cosmological constant is positive and this translates to a negative\nφ4 -coupling. Long ago Symanzik [49,50] showed that the scalar φ4 -theory with a negative\ncoupling constant is asymptotically free; its coupling strength vanishes logarithmically at\nhigh momenta. Using the cutoff appropriate for the gravitational field the asymptotically\nfree RG flow becomes an asymptotically safe one, a NGFP develops.\nThe investigations using the gravitational average action which have been performed\nduring the past few years [6–19] indicate that full Quantum Einstein Gravity (QEG) is\nindeed likely to possess a NGFP which makes the theory asymptotically safe. Increasingly\ncomplicated truncations of theory space were analyzed whereby all modes of the metric\nwere retained. The results which we shall describe in the following indicate that the NGFP\nthat was found in these analyses is perhaps easier to understand than it was thought up\nto now. It seems that, to some extent, it owes its existence to an essentially \"kinematical\"\nphenomenon which is related to the requirement of \"background independence\" and the\nfact that the dynamical field itself, the metric, determines the proper value of the coarse\ngraining scale. The complicated selfinteractions of the helicity-2 modes, on the other\nhand, can be omitted without destroying the NGFP. While also characteristic of gravity,\nthey seem not to be essential for asymptotic safety.\n\n6\n\n\fThe remaining sections of this paper are organized as follows. As a preparation we\ndiscuss in Section 2 the conformally reduced Einstein–Hilbert action. Then, in Section\n3, we derive an exact flow equation for conformally reduced gravity. In Section 4 we\nspecialize it for the CREH truncation and explain in particular the conceptual differences\nof the theory presented here and standard scalar matter field theories. In Section 5 we\nanalyze the RG equations obtained from the CREH truncation and show that they predict\na NGFP. The conclusions are contained in Section 6.\nFor further details we refer the reader to [24] and [25].\n\n2\n\nThe Conformally Reduced Einstein–Hilbert Action\nIn d spacetime dimensions, the Euclidean Einstein–Hilbert action reads\nZ\n\u0001\n√\n1\ndd x g R(g) − 2 Λ .\nSEH [gμν ] = −\n16π G\n\n(2.1)\n\nHenceforth we shall assume that the argument gμν is a conformal factor times a fixed,\nnon-dynamical reference metric b\ngμν . We would like to parameterize this conformal factor\nin terms of a \"scalar\" function φ(x) in such a way that the kinetic term for φ becomes standard, ∝ (∂μ φ)2 . This is indeed possible for any dimensionality. Introducing φ according\n\nto [48],\n\nwith the exponent\n\ngμν = φ2ν(d) b\ngμν ,\nν(d) ≡\n\n2\nd−2\n\n(2.2)\n\n(2.3)\n\nstandard formulas for Weyl rescalings yield the following result for SEH evaluated on\nmetrics of the form (2.2):\nZ\n\u0011\np \u0010\n1\nb φ2 − ξ(d) Λ φ2d/(d−2) . (2.4)\ndd x b\nSEH [φ] = −\ng 12 gb μν ∂μ φ ∂ν φ + 12 ξ(d) R\n8π ξ(d) G\nb is the curvature scalar of the reference metric b\nHere R\ngμν , and\nξ(d) ≡\n\nd−2\n.\n4 (d − 1)\n\n7\n\n(2.5)\n\n\fIn 4 dimensions we have ν = 1 and ξ = 1/6 so that the choice\ngμν = φ2 b\ngμν\n\nconverts the Einstein–Hilbert action to a kind of \"φ4 -theory\":\nZ\n\u0011\np \u0010\n3\n1 b 2\nSEH [φ] = −\nR φ − 16 Λ φ4 .\ng 12 gb μν ∂μ φ ∂ν φ + 12\nd4 x b\n4π G\n\n(2.6)\n\n(2.7)\n\nWe shall refer to the action (2.4) and its special case (2.7) as the conformally reduced\nEinstein–Hilbert or \"CREH\" action.\nUp to now b\ngμν is an arbitrary metric, defined on the same smooth manifold as gμν .\n\nLater on we shall fix the topology of this manifold to be that of flat space Rd or of the\nsphere Sd .\n\nFor d > 2, the case we shall always assume in the following, the kinetic term in\nSEH [φ] of eq. (2.4) is always negative definite due to the \"wrong sign\" of its prefactor.\nAs a result, the action is unbounded below: for a φ(x) which varies sufficiently rapidly\nSEH [φ] can become arbitrarily negative. This is the notorious conformal factor instability.\nLeaving aside issues related to the functional measure, quantizing gravity in the\nCREH approximation based upon the bare action SEH [φ] is similar to quantizing a scalar\ntheory with an action of the general type\nZ\no\nn\nS[φ] = c d4 x − 21 (∂φ)2 + U(φ)\n\n(2.8)\n\nwhere c is a positive constant. For the sake of the argument let us assume that b\ngμν = δμν\n\nis the flat metric on R4 . Then SEH of (2.7) is indeed of the form (2.8) with the potential\nU(φ) =\n\n1\n6\n\nΛ φ4 and c = 3/(4πG) > 0. Let us assume that the cosmological constant is\n\npositive, the case which will be relevant later on. For Λ > 0 the potential term in the\naction (2.8) is positive definite, while the kinetic piece is negative definite. We would like\nto explore the quantum theory based upon the functional integral\nZ\ne\nI ≡ Dφ eiS[φ]\n\n(2.9)\n\nwhere Se is the Wick rotated version of S, with (∂φ)2 ≡ η μν ∂μ φ ∂ν φ. One would expect\n\nthat in this theory the wrong sign of the kinetic term drives the condensation of spatially\n\n8\n\n\finhomogeneous (x-dependent) modes, i. e. the formation of a \"kinetic condensate\" similar\nto the one discussed in [51]. The amplitude of the inhomogeneous modes cannot grow\nunboundedly since this would cost potential energy.\nNext let us look at the closely related theory with the \"inverted\" action Sinv [φ] ≡\n\n−S[φ]. Thus\n\nSinv [φ] = c\nwith the negative potential\n\nZ\n\nd4 x\n\nn\n\n+ 21 (∂φ)2 + V (φ)\n\no\n\nV (φ) ≡ −U(φ) ≤ 0.\n\n(2.10)\n\n(2.11)\n\nIn pulling out a global minus sign from S the instability inherent in the theory has been\nshifted from the kinetic to the potential term. According to Sinv , the kinetic energy\nassumes its minimum for homogeneous configurations φ = const, but the inverted potential V (φ) = − 16 Λ φ4 becomes arbitrarily negative for large φ.\n\nEven though S and Sinv appear to be plagued by instabilities of a very different\n\nnature, they nevertheless describe the same physics (up to a time reflection). The path\nintegrals involving S and Sinv are related by a simple complex conjugation:\nZ\ne\nIinv ≡ Dφ e−iS[φ] = I ∗ .\n\n(2.12)\n\nWe shall refer to the formulation in terms of S and Sinv as the original picture and the\ninverted picture, respectively.\nSo we see that for pure gravity in the CREH approximation the \"wrong\" sign of the\nkinetic term can be traded for an upside down potential. The FRGE formalism we are\ngoing to develop will effectively correspond to the inverted picture. As we shall see it is\nindeed the Λ > 0 case that will be relevant to asymptotic safety. Hence the conformal\nfactor dynamics is described by an action with positive kinetic but negative potential\nterm.\nInterestingly enough, this kind of φ4 -theory with a negative coupling constant was\ndiscussed by Symanzik [49] long ago. He showed that the coupling strength vanishes at\nshort distances, thus providing the first example of an asymptotically free quantum field\ntheory [50].\n\n9\n\n\f3\n\nEffective Average Action for the Conformal Factor\n\n3.1\n\nThe Background Field Method\nThe most important difference between the conformal factor and an ordinary scalar\n\nis that φ determines the magnitude of all physical scales; in particular it determines the\nproper scale that is to be ascribed to a given numerical value of the IR cutoff k appearing\nin the FRGE context. For this reason the quantization of φ by means of an FRGE differs\nfrom the standard one. In fact, even though gauge issues do not play any role here,\nthe background field method has to be employed. This approach will allow us to give a\nmeaning to statements like \"Γk describes the dynamics of fields averaged over spacetime\nvolumes of extension ∼ k −1 \" in presence of a quantized metric where a priori it is unclear\nin which metric the extension of those spacetime volumes is measured.\n\nBefore we can set up the RG formalism we must explain the background–reformulation\nof the path integral underlying the quantum field theory of the conformal factor. We start\nfrom a formal path integral2\n\nZ\n\nDχ e−S[χ]\n\n(3.1)\n\nwhere S is an arbitrary bare action (perhaps related, but not necessarily identical to SEH )\nand χ(x) denotes the microscopic (\"quantum\") conformal factor field. (The notation φ(x)\nwill be reserved for its expectation value.) We think of (3.1) as descending from a path\nintegral over quantum metrics γμν (x),\nZ\nDγμν e−Sgrav [γμν ] ,\n\n(3.2)\n\nby a restriction to metrics of the form\nγμν = χ2ν b\ngμν .\n\n(3.3)\n\nThe integrals (3.1) and (3.2) refer to a spacetime manifold of a given topology and gbμν is a\n\nreference metric consistent with this topology. The action S[χ] depends parametrically on\n2\n\nSince this is customary in the literature we shall use a Euclidean notation in the general discussions.\n\nAt the formal level it is trivial to obtain the corresponding Lorentzian formulas by replacing −S → iS,\n\netc.; for the time being the positivity properties of S play no role.\n\n10\n\n\fgμν but we shall not indicate this dependence notationally. The non-dynamical, classical\nb\n\nmetric b\ngμν is considered fixed once and for all; it has no analog in the full theory and is\n\nnot to be confused with the background metric and the corresponding conformal factor\nwhich we introduce next.\n\nWe decompose the variable of integration, χ, as the sum of a classical, fixed background field χB and a fluctuation f :\nχ(x) = χB (x) + f (x).\n\n(3.4)\n\nEven though we frequently use the term \"fluctuation\", f (x) is not assumed small, and\nno expansion in powers of f (x) is performed here. We assume that the measure Dχ is\nR\ntranslational invariant so that (3.1) can be replaced by Df exp(−S[χB + f ]). Actually\nit is sufficient to assume that the original Dχ equals a translational invariant measure up\n\nto a Jacobian since we may include the logarithm of this Jacobian in S.\n\nAt this point it is natural to introduce a background–type generating functional by\ncoupling an external source J(x) to the fluctuation only:\n\u0013\n\u0012\nZ\nZ\np\n\u0001\nd\ng J(x) f (x) .\nexp W [J; χB ] = Df exp −S[χB + f ] + d x b\n\n(3.5)\n\nRepeated differentiation of W with respect to the source yields the connected n-point\nfunctions of f in presence of J. In particular the normalized expectation value of the\nfluctuation is\nf (x) ≡ hf (x)i = p\n\n1\n\nδW [J; χB ]\n.\nδJ(x)\ng (x)\nb\n\n(3.6)\n\nThe field thus obtained is functionally dependent on both J and χB , i. e. f = f [J; χB ]. We\nassume that this relationship can be solved for the source, J = J[ f ; χB ], and introduce\nthe Legendre transform of W :\nZ\np\n\u0002\n\u0003\ng J[ f ; χB ](x) f (x) − W J[ f ; χB ]; χB .\nΓ[ f ; χB ] = dd x b\n\n(3.7)\n\nThis definition implies the effective field equation\n\nδΓ[ f ; χB ]\n= J(x).\nδf (x)\n\n11\n\n(3.8)\n\n\fMore generally, repeated differentiation of Γ with respect to f (x) yields the 1PI n-point\ncorrelators of f in presence of J. The source can be \"switched off\" by equating f after\nthe differentiations to the function f 0 [χB ](x) ≡ f [J = 0; χB ](x). Note that f 0 has no\n\nreason to vanish in general, and that the resulting n-point functions still depend on χB .\nThe expectation value of the complete conformal factor reads\nφ ≡ (χB + f ) = χB + f ,\n\n(3.9)\n\nand sometimes it will be convenient to regard Γ a functional of φ and χB rather than f\nand χB :\nΓ[φ, χB ] ≡ Γ[ f = φ − χB ; χB ].\n\n(3.10)\n\nFor the restriction of this function to equal arguments φ = χB which amounts to a\nvanishing fluctuation expectation value we write\nΓ [φ] ≡ Γ[φ, φ] = Γ[ f = 0; χB = φ].\n\n(3.11)\n\nIt is instructive to compare the above generating functionals in the background\napproach with those in the standard (\"st\"), i. e. non-background formalism. There one\nwould define Wst [J] by\n\u0001\n\nexp Wst [J] =\n\nZ\n\n\u0012\n\nDχ exp −S[χ] +\n\nZ\n\nd\n\nd x\n\np\n\ng J(x) χ(x)\nb\n\n\u0013\n\n(3.12)\n\nand the standard effective action Γst [φ] would obtain as the Legendre transform of Wst [J].\nExploiting the translational invariance of Dχ it is easy to see that the two sets of func-\n\ntionals are related in a rather trivial way:\n\nW [J; χB ] = Wst [J] −\nΓ[ f ; χB ] = Γst [χB + f ]\n\nZ\n\ndd x\n\np\n\n⇐⇒\n\ng J(x) χB (x)\nb\n\nΓ[φ, χB ] = Γst [φ]\n\nΓ [φ] = Γst [φ].\n\n(3.13)\n(3.14)\n(3.15)\n\nThe key property of the background formalism is that the standard n-point functions\nδ n Γst [φ]\nδφ(x1 ) * * * δφ(xn )\n\n12\n\n(3.16)\n\n\fcan alternatively be computed by differentiating the functional Γ[ f = 0; χB ] = Γ [χB ]\nwith respect to the background χB :\nδ n Γ[ f = 0; χB ]\nδχB (x1 ) * * * δχB (xn )\n\nχB =φ\n\n≡\n\nδ n Γst [φ]\n.\nδφ(x1 ) * * * δφ(xn )\n\n(3.17)\n\nIn the case at hand the equality of (3.16) and (3.17) is trivial since Γ[ f = 0; χB ] and\nΓst [χB ] are exactly equal here.\nThe situation is less trivial when one applies this formalism to gauge theories, employing a gauge fixing term invariant under background gauge transformations. Then the\nanalogs of the n-point functions (3.16) and (3.17) are not exactly equal, but they are equal\n\"on-shell\". As a result, both sets of correlators give rise to the same set of physical Smatrix elements [45]. The important conclusion is that even then the functional Γ which\nobtains by requiring that the fluctuation has no expectation value ( f = 0) and depends\nonly on one field (χB ≡ φ) contains all of the physical, gauge–invariant information.\n\nBefore continuing let us summarize the status of the various metrics, all conformal\n\nbμν , a\nto one another, that enter the construction. First, there is the reference metric g\nclassical field which is fixed once and for all and never gets varied. Second, there is the\nquantum metric, the integration variable\n\nγμν = χ2ν b\ngμν = (χB + f )2ν b\ngμν .\n\n(3.18)\n\nIn the canonical approach this metric corresponds to an operator. Third, there is the\nbackground metric defined by\ng μν ≡ χ2ν\ngμν .\nB b\n\n(3.19)\n\nIt is a classical field again which is considered variable, however. In particular it can be\nadjusted to achieve f = 0 if this is desired. Fourth, there is the expectation value of\nthe quantum metric\ngμν .\ngμν ≡ hγμν i ≡ (χB + f )2ν b\n\n(3.20)\n\nAnd finally, fifth, there is the metric with the conformal factor φ. As φ ≡ χB + f =\n\nχB + hf i, it reads\n\nğμν ≡ φ2ν gbμν ≡ χB + hf i\n13\n\n\u00012ν\n\ngμν .\nb\n\n(3.21)\n\n\fIn general gμν and ğμν are not exactly equal. However, they are approximately equal if\nthe quantum fluctuations of f are small. In d = 4 where ν = 1, for instance, we have\n\u0002\n\u0003\ngμν = g μν + 2 χB hf i + f 2 gbμν\n\nğμν = g μν\n\n\u0002\n\u0003\n+ 2 χB hf i + hf i2 b\ngμν .\n\n(3.22)\n\nHence the difference gμν − ğμν = [hf 2 i − hf i2 ] b\ngμν is proportional to the variance of f\n\nso that gμν and ğμν are not very different if the fluctuations of f are \"small\". However,\nin order to make this statement precise one first would have to give a meaning to the\nexpectation value of the operator product f 2 with both operators at the same point,\n\nsomething we shall not attempt here. Notice also that ğμν reduces to g μν if f = 0 while\ngμν .\ngμν does not: gμν = g μν + hf 2 i b\n\nThe metrics gμν and g μν are analogous to the fields with the same names in the con-\n\nstruction of the exact gravitational average action [6]. Certain differences arise, however,\nsince there a linear background–quantum split is performed at the level of the full metric,\nwhile in the present approach the split is linear at the level of the conformal factor. In\nref. [6] where the integral over all metrics γμν is dealt with, one decomposes γμν = g μν +hμν\nand then integrates over the fluctuation hμν . As a result, gμν = hγμν i = g μν + hhμν i is\n\nlinear in the expectation value of the fluctuation so that there is no difference between gμν\n\nand ğμν . In the present setting, on the other hand, the metric γμν is parameterized by the\nfluctuation in a nonlinear way: γμν = (χB + f )2ν b\ngμν . This nonlinearity is the price we\n\nhave to pay if we want the CREH action to look like that of a standard scalar φ4 -theory.\n\n3.2\n\nThe Average Action of the Conformal Factor\nFrom the technical point of view, the main problem consists in (approximately)\n\ncomputing the path integral (3.5). Next we shall set up an RG formalism which translates\nthis problem into the equivalent problem of solving a certain functional RG equation\nsubject to a boundary condition involving S.\n(A) Introducing a mode cutoff Using a variant of the effective average action for\nscalars [28, 29] we modify (3.5) by introducing a mode–cutoff term into the path integral\n\n14\n\n\fdefining W :\n\u0001\nexp Wk [J; χB ]\n\u0012\n\u0013\nZ\nZ\np\nd\n= Df exp −S[χB + f ] − ∆k S[f ; χB ] + d x b\ng J(x) f (x) .\n\n(3.23)\n\nThe action ∆k S[f ; χB ] is to be constructed in such a way that the factor exp(−∆k S)\nsuppresses the long–wavelength modes of f (x) with momenta p . k while it does not\naffect the short–wavelength modes with p & k. In order to arrive at an FRGE of the\nfamiliar second–order type we take ∆k S to be quadratic in f :\nZ\np\n1\n∆k S[f ; χB ] = 2 dd x b\ng f (x) Rk [χB ] f (x).\n\n(3.24)\n\nHere Rk is a pseudodifferential operator which may depend on the background field.\nAllowing for this χB -dependence is crucial in order to implement \"background indepen-\n\ndence\" [2–4] and to give a \"proper\" meaning to the coarse graining scale k in a theory\nwith a dynamical metric.\n(B) Giving a meaning to k In flat space the parameter k, by elementary Fourier\ntheory, has the interpretation of the inverse length scale over which the microscopic fields\nare averaged or \"coarse grained\". If we want to have a similar interpretation in quantum\ngravity we must decide with respect to which metric this length scale is measured. In the\nbackground field approach, there is a canonical candidate for a metric measuring the coarse\ngμν . In fact, as we discussed in\ngraining scale, namely the background metric g μν = χ2ν\nB b\n\nthe Introduction, the RG flow becomes \"background independent\" (in the sense of [2–4])\nif ∆k S is constructed from g μν , or χB here, rather than from a rigid metric. The key\n\nproperty of Rk [χB ] is to distinguish \"long–wavelength\" and \"short–wavelength\" modes\n\nof f (x) whereby the \"length\" is defined in terms of g μν , i. e. the background conformal\n\nfactor χB .\nThe advantage of using the background field method is that at an intermediate\nstage it decouples the field integrated over, the fluctuation f , from the field that fixes the\nphysical value of k, namely χB . At the very end, after the quantization has been performed\nand the RG trajectories are known, we may set f = 0 without loosing information. Then\nthe scale dependent version of the single–argument functional defined above, Γk [φ ≡\n\n15\n\n\fχB ], depends only on one conformal factor, corresponding to \"the\" metric gμν , and its\nparameter k is a momentum measured, indirectly, with respect to this metric.\n(C) Which spectrum is cut off ? A cutoff operator Rk with the desired properties\n\ncan be constructed along the following lines. We think of the functional integral (3.23)\nover f as being organized according to eigenfunctions of the Laplace–Beltrami operator\nconstructed from g μν :\n\u0003 ≡ g −1/2 ∂μ g 1/2 g μν ∂ν .\n\n(3.25)\n\nExpanding f in terms of (−\u0003 )-eigenfunctions, the task of Rk is to suppress those with\n\neigenvalues smaller than k 2 by giving them a \"mass\" of the order k, while those with larger\n\neigenvalues must remain \"massless\" [28, 29]. In the simplest case when the f -modes have\na kinetic operator proportional to \u0003 itself the rule is that the correct Rk when added to\n(2)\n\nΓk leads to the replacement\n\n(−\u0003 ) −→ (−\u0003 ) + k 2 R(0)\n\n−\u0003\nk2\n\n\u0001\n\n.\n\n(3.26)\n\nHere R(0) (z) is an arbitrary \"shape function\" interpolating between R(0) (0) = 1 and\nR(0) (∞) = 0, with a transition region centered around z = 1. These conditions guarantee\nthat the effective inverse propagator of the long– and short–wavelength modes is −\u0003 + k 2\n\nand −\u0003, respectively, and that the long/short–transition is at the −\u0003-eigenvalue k 2 , as\nit should be.\n\nThe coarse graining scale l = l(k) corresponding to the cutoff value k is found\nby investigating the properties of the −\u0003-eigenfunction with eigenvalue k 2 , the so-called\n\n\"cutoff mode\" [22, 23]: one determines its typical scale of variation with respect to x (a\nperiod, say) and converts this coordinate length to a physical, i. e. proper length using g μν .\nThe result, l(k), is an approximate measure for the extension of the spacetime volumes\nup to which the dynamics has been \"coarse grained\". If g μν is close to a flat metric, l(k)\nequals approximately π/k. (See [22, 23] for a detailed discussion.) It is in this sense that\nthe background metric g μν , or rather its conformal factor χB , determines the physical\n(proper) scale of k.\nDefining the scale k as a cutoff in the spectrum of the covariant Laplacian built from\n\n16\n\n\fg μν is in accord with the construction of the exact gravitational average action in [6]; there,\ntoo, it is the background metric which sets the scale of k.\n(D) Matter fields vs. quantized gravity While the above choice of Rk appears very\n\nnatural, and in fact is the only meaningful one in the gravitational context, every standard quantization and RG scheme which treats φ as an ordinary scalar uses a differently\nb Here \u0003\nb denotes the Laplace–Beltrami operdefined cutoff, namely one based upon \u0003.\n\nb = gb −1/2 ∂μ b\nator pertaining to the reference metric, \u0003\ng 1/2 b\ng μν ∂ν , and Rk is designed to\nimplement the replacement\n\nb −→ (−\u0003)\nb + k 2 R(0)\n(−\u0003)\n\nb\n−\u0003\nk2\n\n\u0001\n.\n\n(3.27)\n\nIn this case the proper scale of k is determined by the metric b\ngμν which, however, at no\n\nstage of the construction acquires any physical meaning. As we emphasized, b\ngμν is never\n\nvaried. It \"knows\" nothing about the true (\"on-shell\") metric of spacetime, namely the\n\nparticular background metric which adjusts itself dynamically upon setting hf i = 0. The\n\nscheme (3.27) is the correct choice if one considers χ a standard scalar field on a non-\n\ndynamical spacetime with metric gbμν , on flat space (b\ngμν = δμν ), for instance. The average\n\naction formalism based upon (3.27) reproduces all the familiar results of perturbation\ntheory, the ln(k)-running of the quartic coupling in φ4 -theory, for instance.\n\nSince b\ngμν is a rigid metric, the flow resulting from the substitution (3.27) is not\n\n\"background independent\" in the sense of [2–4], while (3.26) does indeed give rise to a\n\"background independent\" RG flow.\n\nAs we shall see, the flow based upon the \u0003-scheme (3.26) is extremely different from\nthe one for standard scalars. The reason is, of course, that via the χB -dependence of \u0003\nthe gravitational field itself sets the scale of k. The difference between (3.26) and (3.27)\ngμν are related\nbecomes manifest when we recall that the Laplacians of b\ngμν and g μν = χ2ν\nB b\nby\n\nb + O(∂χB ).\n\u0003 = χ−2ν\n\u0003\nB\n\n(3.28)\n\nThe factor χ−2ν\nleads to dramatic modifications of the RG flow whereas the O(∂χB )-terms\nB\nare less important; within the Einstein–Hilbert truncation they play no role.\n\n17\n\n\f(E) Defining Γk The remaining steps of the construction follow the familiar rules [28,\n29, 31]. One defines the k-dependent field expectation value\nf (x) ≡ f (x)\n\nk\n\n=p\n\n1\n\nδWk [J; χB ]\n,\nδJ(x)\ng (x)\nb\n\n(3.29)\n\nsolves for the source, J(x) = Jk [ f ; χB ](x), and finally defines the effective average action\nΓk as the Legendre transform of Wk with ∆k S[ f ; χB ] subtracted:\nZ\np\n\u0002\n\u0003\ng f (x) Jk [ f ; χB ](x) − Wk Jk [ f ; χB ]; χB\nΓk [ f ; χB ] = dd x b\n−\n\n1\n2\n\nZ\n\np\nd x b\ng f Rk [χB ] f .\n\n(3.30)\n\nd\n\nIn analogy with (3.10) and (3.11) we also introduce\n\nΓk [φ, χB ] ≡ Γk [ f = φ − χB ; χB ]\n\n(3.31)\n\nΓk [φ] ≡ Γk [φ, φ] = Γk [ f = 0; χB = φ].\n\n(3.32)\n\n(F) The flow equation The main properties of Γk are easily established along the same\nlines as in standard scalar theories [28, 29, 31]. In particular, differentiating (3.23) with\nrespect to k leads to the following FRGE which governs the scale dependence of Γk :\n\u0014\u0010\n\u0015\n\u0011−1\n(2)\n1\nk∂k Γk [ f ; χB ] = 2 Tr Γk [ f ; χB ] + Rk [χB ]\nk∂k Rk [χB ] .\n(3.33)\n(2)\n\nHere Γk is the matrix of second functional derivatives of Γk [ f ; χB ] with respect to f at\nfixed χB . In bra–ket notation,\nδ 2 Γk [ f ; χB ]\n1\n(2)\np\n.\nhx|Γk |yi = p\ng (x) gb(y) δf (x) δf (y)\nb\n\n(3.34)\n\nNote that the metric appearing in formulas such as (3.29) or (3.34) is b\ngμν (and not g μν ).\nR d p\ng hx|(* * * )|xi. Notice also that, since the f -derivatives\nCorrespondingly Tr(* * * ) ≡ d x b\n\nare to be performed at fixed χB , the FRGE (3.33) cannot be formulated in terms of\nthe single–argument functional Γk alone. Hence the relevant theory space consists of\nfunctionals depending on two fields, f and χB , or alternatively φ and χB .\n\n18\n\n\fBy construction Rk vanishes for k → 0. As a consequence, Γk reduces to the ordinary\n\neffective action in this limit:\n\nΓk=0 [ f ; χB ] = Γ[ f ; χB ]\n(3.35)\nΓk=0 [φ] = Γ [φ].\nHence Γk→0 and Γk→0 satisfy the relations (3.14) and (3.15), respectively. They entail\nthat Γk=0 [ f ; χB ] actually depends on the sum χB + f only. This is not true for k 6= 0, the\nreason being that in general ∆k S[f ; χB ] depends on f and χB separately, not only on their\n\nsum. In the opposite limit k → ∞, Γk [ f ; χB ] approaches S[χB + f ] plus a computable\ncorrection term, see [52] for a detailed discussion of this point.\n\n4\n\nThe CREH Truncation\n\n4.1\n\nThe Ansatz for Γk\nIn this section we specialize the as to yet exact flow equation (3.33) for the \"CREH\n\ntruncation\"3 . It involves two approximations:\n1. The usual Einstein–Hilbert truncation.\n2. The conformal reduction: only the conformal factor is quantized while all other\ndegrees of freedom contained in the metric as well as the Faddeev–Popov ghost\nfields are neglected.\nTo make the presentation as transparent as possible we specialize for d = 4 in the following.\nThe truncation ansatz for Γk [ f ; χB ] is given by the reduced functional SEH [χB + f ]\nfrom eq. (2.7) with a k-dependent Newton constant Gk and cosmological constant Λk :\nZ\np n\n\u0001\n\u0001\n3\nb χB + f\ng − 12 χB + f \u0003\nd4 x b\nΓk [ f ; χB ] = −\n4π Gk\n(4.1)\n\u00012 1\n\u00014 o\n1 b\n+ 12 R χB + f − 6 Λk χB + f\n.\n3\n\nFor a different approach to the quantization of conformal fluctuations see [53].\n\n19\n\n\fHere χB and f are still arbitrary functions of x. Parametrically the average action also\nb and Laplace–\ndepends on the, equally arbitrary, reference metric b\ngμν with Ricci scalar R\n(2)\n\nb For this action the Hessian (3.34) has the form hx|Γ |yi =\nBeltrami operator \u0003.\nk\np\n(2) 4\n(2)\nΓk δ (x − y)/ b\ng (x) where Γk is to be interpreted as a differential operator acting\non x; it reads\n\n(2)\n\nΓk [ f ; χB ] = −\n\n\u00012 o\n3 n b\nb\n− \u0003x + 61 R(x)\n− 2 Λk χB (x) + f (x)\n.\n4π Gk\n\n(4.2)\n\nWe shall come back to this operator shortly.\n\n4.2\n\nThe projected RG Equations\n\n(A) The strategy In order to determine the β-functions for the running Newton constant\nGk and cosmological constant Λk we proceed as follows. The first step consists in inserting\nthe ansatz into the flow equation, both on its LHS, where we get k-derivatives of Gk and\nΛk , and on its RHS where we are left with the problem of calculating a functional trace\n(2)\n\ninvolving Γk . It is sufficient to compute this trace in a derivative expansion which retains\nonly those terms which are also present on the LHS of the flow equation, namely those\nb φ2 , and φ4 where φ ≡ χB + f . If we then equate\nb φ, R\nproportional to the monomials φ \u0003\nthe coefficients of equal monomials on the LHS and RHS we find the desired RG equations\nof Gk and Λk .\n\n(B) The derivative expansion Without loosing information this calculation can be\nperformed with a homogeneous background field: χB (x) = const ≡ χB . The following\n\ntwo calculations are necessary then in order to \"project out\" the three monomials of\ninterest:\n\n(i) Evaluation of the functional trace for a flat metric gbμν = δμν and a non-zero, nonb f must be retained. Comparing it to the relevant\nconstant field f (x). Only the term f \u0003\nterm of the LHS,\n\n3\nk∂k Γk [ f ; χB ] = + k∂k\n4π\n\n\u0012\n\nyields the β-function of Gk .\n\n20\n\n1\nGk\n\n\u0013Z\n\nd4 x\n\n1\n2\n\nb f +***\nf\u0003\n\n(4.3)\n\n\f(ii) Evaluation of the functional trace for f ≡ 0 and b\ngμν arbitrary whereby only the\nb χ2 are retained. Comparison with the corresponding terms on the\nmonomials χ4B and R\nB\nLHS,\n\n3\nk∂k Γk [0; χB ] = −\n4π\n\nZ\n\n4\n\ndx\n\np\n\ng\nb\n\n\u001a\n\n1\n12\n\nk∂k\n\n\u0012\n\n1\nGk\n\n\u0013\n\nb χ2 − 1 k∂k\nR\nB\n6\n\n\u0012\n\nΛk\nGk\n\n\u0013\n\nχ4B\n\n+***\n\n\u001b\n\n(4.4)\n\nallows for the computation of ∂k (Λk /Gk ) and an alternative determination of ∂k Gk .\nb φ2 term appear with the same prefactor 1/Gk we can\nb φ and the R\nSince both the φ \u0003\nderive a β-function for Gk from either of them. They involve the anomalous dimension\n\nηN , and the two versions stemming from the kinetic and the potential term ∝ φ2 will be\n(kin)\n\ndenoted ηN\n\n(pot)\n\nand ηN\n\n, respectively. We do not expect these β-functions or anomalous\n\ndimensions to be exactly equal, but if our approximation makes sense they should be\nsimilar at least.\n(C) The explicit form of Rk Before we can embark on these calculations we must\naddress the question of how Rk is to be adjusted. The IR cutoff at k must be imposed\nb Since χB = const in the case at hand, the two\non the spectrum of \u0003, not that of \u0003.\noperators are related by\n\n(2)\n\nso that we may reexpress Γk as\n(2)\n\nΓk [ f ; χB ] = −\n\nb = χ2B \u0003\n\u0003\n\n\u0001 o\n3 n\nb − 2 Λk χB + f 2 .\n− χ2B \u0003 + 16 R\n4π Gk\n\n(4.5)\n\n(4.6)\n\nNow we define Rk in such a way that it leads to the replacement (3.26) when added to\n(2)\n\nΓk :\n\n(2)\n\nΓk [ f ; χB ] + Rk [χB ]\n\n\u0003\n\u0001 o\n3 n 2\u0002\nb − 2 Λk χB + f 2 .\n=−\nχB −\u0003 + k 2 R(0) (−\u0003/k 2 ) + 61 R\n4π Gk\n\n(4.7)\n\nAs a consequence, the cutoff operator has an explicit dependence on the background field:\n\u0001\n3\nχ2B k 2 R(0) − k\u00032\nRk [χB ] = −\n4π Gk\n(4.8)\n3\nb \u0001\n2 2 (0)\n\u0003\nχ k R − χ2 k 2\n=−\nB\n4π Gk B\n\n21\n\n\fThe two factors of χ2B appearing in the second line of (4.8) are the crucial difference\nbetween our treatment of the conformal factor and a standard scalar. If, instead of\n(3.26), we had applied the \"substitution rule\" (3.27) they would have been absent.\nb 2\n(D) The functional trace Upon inserting the above Rk and reexpressing \u0003 as \u0003/χ\nB\n\nthe flow equation assumes the form\nk∂k Γk [ f ; χB ]\n=\n\nχ2B\n\n2\n\nk Tr\n\n\"(\n\n\u0001\n\n1 − 21 ηN R\n\n(0)\n\nb\n− χ2\u0003k2\nB\n\n\u0001\n\n\u0010\nb \u0011\n\u0003\n′\nb \u0001\n− − 2 2 R(0) − χ2\u0003k2\nB\nχB k\n\n)\n\n(4.9)\n\n\u0013−1 #\n\u0012\n\u0001\n\u0001\n2\nb\nb + χ2 k 2 R(0) − 2\u0003 2 − 2 Λk χB + f\nb+1R\n.\n× −\u0003\nB\n6\nχ k\nB\n\nk∂k Γk [ f ; χB ]\n= χ2B k 2 Tr\n\n\"( \u0012\n\n1−\n\n×\n\n1\nηN\n2\n\n\u0013\n\n\u0012\n\u0012\n\u0013 \u0012\n\u0013\n\u0013)\nb\nb\nb\n\u0003\n\u0003\n\u0003\n′\nR(0) − 2 2 − − 2 2 R(0) − 2 2\nχB k\nχB k\nχB k\n\n(4.10)\n\n!−1 #\n\u0012\nb \u0013\n\u0001\n\u0003\n1\n2\nb + χ2 k 2 R(0) −\nb+ R\n− 2 Λk χB + f\n−\u0003\n.\nB\n6\nχ2B k 2\n\nIn evaluating the derivative ∂k Rk we encountered the anomalous dimension ηN , defined\nin the same way as in [6]:\n\nηN ≡ +k∂k ln Gk .\n\n(4.11)\n\nNote that in eq. (4.10) the overall minus sign of Rk , and hence k∂k Rk , got canceled\n(2)\n\nagainst the overall minus sign of Γk + Rk in (4.7). This is the step where, within the\n\npresent setting, the transition from the \"original\" to the \"inverted\" picture has taken\n\nplace. The factor (* * * )−1 under the trace of (4.10) is the propagator of a mode with\n\npositive kinetic, but negative potential energy. This is an example of the \"Zk = zk rule\"\ndiscussed in [6] and [10].\n\nThe only specialization which entered eq. (4.10) is χB = const; the reference metric\ngμν and the fluctuation average f are still arbitrary. Therefore equation (4.10) can serve\nb\n22\n\n\fas the starting point for the two calculations (i) and (ii) which must be performed at this\npoint.\n(E) The resulting beta functions The details of the calculations, for an arbitrary shape\nfunction R(0) and any spacetime dimension d can be found in [24]. Here we only present\nthe final result for the RG equations, in d = 4 dimensions, employing the \"optimized\"\nshape function of ref. [54]:\nR(0) (z) = (1 − z) θ(1 − z).\n\n(4.12)\n\nIt is convenient to express the coupled system of differential equations for Newton's constant and the cosmological constant in terms of the dimensionless couplings\ng k ≡ k 2 Gk ,\n\nλk ≡ Λk /k 2 .\n\n(4.13)\n\nThis choice of variables makes the system autonomous:\n\u0002\n\u0003\nk∂k gk = βg (gk , λk ) = 2 + ηN (gk , λk ) gk\n\nk∂k λk = βλ (gk , λk ).\n\n(4.14)\n(4.15)\n\nFor the anomalous dimension coming from the kinetic term we obtain explicitly\n(kin)\nηN (gk , λk )\n\ngk λ2k\n2\n.\n=−\n3π (1 − 2λk )4\n\n(4.16)\n\nThe one derived from the potential has the familiar structure [6]\n(pot)\n\nηN\n\n(gk , λk ) =\n\ngk B1 (λk )\n1 − gk B2 (λk )\n\n(4.17)\n\nwith the following B-functions:\n\u0012\n\n\u0013\n1\n1\n− λk\n4\n(1 − 2λk )2\n\u0012\n\u0013\n1\n1\n1\n− λk\n.\nB2 (λk ) = −\n12π 3\n(1 − 2λk )2\n\n1\nB1 (λk ) =\n3π\n\n(4.18a)\n(4.18b)\n\nFor βλ one finds\ngk\nβλ (gk , λk ) = − (2 − ηN ) λk +\n4π\n\n23\n\n\u0012\n\u0013\n1\n1\n1 − ηN\n6\n1 − 2λk\n\n(4.19)\n\n\f(kin)\n\nwhere either ηN\n\n(kin)\n\nUsing ηN\n\n(pot)\n\nor ηN\n\nis to be inserted for ηN .\n\nthe β-functions have poles at λ = 1/2 and are regular otherwise. The\n\nphysically relevant part of the parameter space is the half plane to the left of this line\n(λ < 1/2), as in the full theory [9].\n(pot)\n\nWith ηN\n\nthe boundary of the \"physical\" parameter space is given by a curve to\n(pot)\n\nthe left of the λ = 1/2–line. Along this line, 1 − g B2 (λ) = 0, so that ηN\n(pot)\n\n|ηN\n\n(pot)\n\n| = ∞. Parameterizing this curve as g = gη\ngη(pot) (λ) = 12π\n\ndiverges there,\n\n(λ) we have explicitly\n\n(1 − 2λ)2\n.\nλ − 1/3\n\n(4.20)\n\nIn either of the two cases, the existence of a boundary in (g, λ)-space entails that\nsome of the RG trajectories terminate already at a finite value of k when they run into the\nboundary line. Within the full Einstein–Hilbert truncation, the status of the singularities\nhas been discussed in detail in the literature [9,14,19,41]. They have been interpreted as a\nbreakdown of the truncation in the infrared. The continuation to k = 0 would presumably\nrequire a more general ansatz for Γk .\n\n4.3\n\nComparison with the Standard Scalar FRGE\nOne might wonder how the RG equations for the conformal factor relate to those\n\nfor a standard scalar [31]. The comparison reveals that both the structure of the equation\nand their solutions are quite different in the two cases. We shall see this in more detail\nin Section 5. Here we only mention the most striking deviation.\nLet us consider an RG trajectory in a regime where the anomalous dimension is\nsmall so that we may approximate ηN = 0. (In the next section we shall see that there\nare indeed trajectories with ηN ≈ 0 over a large range of scales.) Then (4.11) integrates\nto Gk = const ≡ G, and the equation for λk involves the correspondingly simplified\n\nβ-function (4.19), with gk ≡ G k 2 . In terms of the ordinary, dimensionful cosmological\nconstant Λk ≡ k 2 λk this RG equation reads\nk∂k Λk =\n\nG\nk6\n.\n4π k 2 − 2Λk\n\n24\n\n(4.21)\n\n\fIn particular, when Λk ≪ k 2 it simplifies to\nk∂k Λk =\n\n1\nG k4.\n4π\n\n(4.22)\n\nObviously the RG equations of the CREH truncation imply a quartic running of the cosmological constant as long as Λ is small and G is approximately constant.\nWith quantum gravity in the back of our mind this result is no surprise. It is\nexactly what one finds in the full Einstein–Hilbert truncation [6], except for the prefactor\nof G k 4 which is anyhow non-universal. In fact, the k 4 -running (4.22) is what all methods\nfor summing zero–point energies would agree upon. In particular it can be seen as a\nreflection of the well known quartic divergences which appear in all Feynman diagram\ncalculations (and are usually \"renormalized away\"). So there can be no doubt that (4.22)\nis the physically correct answer for the regime considered.\nOn the other hand, from the scalar field perspective, the quartic running is a surprise. In the CREH ansatz for Γk the cosmological constant Λk plays the role of a φ4 coupling constant which behaves as Λk ∝ k 4 here. This very strong scale dependence has\n\nto be contrasted with the much weaker, merely logarithmic k-dependence one finds in an\nordinary scalar theory on a 4-dimensional flat spacetime (provided k is above all mass\nthresholds, if any).\nThe origin of this significant difference in the RG running of the φ4 -coupling, proportional to ln(k) for a standard scalar and ∝ k 4 for the conformal factor, is clear: The\n\nconformal factor determines the proper scale of the cutoff, while a scalar matter field does\nnot. When we constructed the operator Rk in Subsection 4.2 we explained how the special\n\nstatus of the conformal factor comes into play. We saw that if the coarse graining scale\n\nis to be given a physical meaning, k should be a cutoff in the spectrum of the background\nfield dependent operator \u0003, and this led to the substitution rule (3.26).\nThus it becomes obvious that \"background independence\" leads to RG equations\ndifferent from those of a scalar matter field. In the construction of the exact gravitational\naverage action in [6] where all degrees of freedom carried by the metric are quantized\n\"background independence\" has likewise been taken care of. There it is the full background metric g μν , the generalization of χ2B here, which enters Rk and sets the scale of\n\n25\n\n\fk.\n\n5\n\nAsymptotic Safety in the CREH Truncation\nIn this section we analyze the physical contents of the RG flow in the CREH trun-\n\ncation, being particularly interested in the asymptotic safety issue.\n\n5.1\n\nAntiscreening\nFrom the definition (4.11) it follows that the RG running of the dimensionful Newton\n\nconstant is given by\nk∂k Gk = ηN Gk .\n\n(5.1)\n\nIf ηN > 0, Newton's constant increases with increasing mass scale k, while it decreases\nif ηN < 0. In analogy with gauge theory one refers to the first case as \"screening\", the\nsecond as \"antiscreening\". In the full4 calculation, ηN was of the antiscreening type in the\nentire physical part of the (g, λ)-plane.\n(kin)\n\nIf we determine ηN from the kinetic term, the corresponding CREH result ηN\n\nis negative for any value of g > 0 and λ. This corresponds to the antiscreening case: Newton's constant decreases at high energies. So the remarkable result is that the quantization\nof the conformal factor alone is already sufficient to obtain gravitational antiscreening.\nThe spin-2 character of the metric field seems not essential and its selfinteractions (verR\n√\ntices) coming from d4 x g R seem not to play the dominant role.\nIf we take the ηN from the potential we find that, if g > 0,\n(pot)\n\n(pot)\n\nThe anomalous dimension ηN\n4\n\nηN\n\n≤ 0,\n\nif λ ≥ 1/4,\n\n(pot)\nηN\n\n> 0,\n\nif λ < 1/4.\n\n(5.2)\n\nvanishes along the line λ = 1/4.\n\nHere and in the following \"full calculation\" always refers to the complete calculation within the\n\nEinstein–Hilbert truncation in ref. [6].\n\n26\n\n\f5.2\n\nFixed Points\nNext we search for fixed points of the system of differential equations (4.14), (4.15),\n\ni. e. points (g∗ , λ∗ ) such that βg (g∗ , λ∗ ) = 0 = βλ (g∗ , λ∗ ).\nFrom (4.16), (4.18), and (4.19) it is obvious that for either choice of ηN the system\nhas a fixed point at the origin, referred to as the Gaussian Fixed Point (GFP): g∗GFP =\nλGFP\n= 0.\n∗\nA Non-Gaussian Fixed Point (NGFP), if any, would satisfy the condition βg = 0\nwith non-zero values of g∗ or λ∗ such that ηN (g∗ , λ∗ ) = −2. Upon inserting ηN = −2 into\n(4.19) the condition βλ = 0 assumes the simple form\n\ng∗ = 12π λ∗ (1 − 2λ∗ ) .\n\n(5.3)\n\nThe second condition for g∗ and λ∗ depends on the choice for ηN .\nIf we use the ηN from the kinetic term given by eq. (4.16) the condition\n(kin)\nηN (g∗ , λ∗ )\n\n= −2 reads\ng∗\n\nλ2∗\n= 3π.\n(1 − 2λ∗ )4\n\n(5.4)\n\nThe system of equations (5.3), (5.4) is easily decoupled by inserting g∗ of (5.3) into (5.4).\nRemarkably, one does indeed find a real solution:\nλ∗ =\n\n21/3\n1\n≈ 0.279\n2 (1 + 21/3 )\n\ng∗ = 6π\n\n21/3\n(1 + 21/3 )\n\n2\n\n≈ 4.650\n\n(5.5a)\n(5.5b)\n\nThe existence of this NGFP comes as a true surprise; it has no counterpart in ordinary\n4-dimensional φ4 -theory.\nIf instead we use the ηN from the potential given by (4.17) with (4.18) the\n(pot)\n\ncondition ηN\n\n(g∗ , λ∗ ) = −2 can be written as\ng ∗ λ∗ −\n\n5\n18\n\n\u0001\n\n= 4π (1 − 2λ∗ )2 .\n\n27\n\n(5.6)\n\n\fThe coupled equations (5.6) and (5.3) can be solved analytically again and they, too, give\nrise to real and positive fixed point coordinates:\nλ∗ =\n\n\u0011\n7 \u0010p\n481/49 − 1 ≈ 0.415\n36\n\ng∗ = 12π λ∗ (1 − 2λ∗ ) ≈ 2.665\n\n(5.7a)\n(5.7b)\n\nThe individual values of g∗ and λ∗ as obtained from the two calculational schemes\ndo not quite agree. However, this does not come unexpected. The mere coordinates of\nthe fixed point are not directly related to anything observable and, in fact, are scheme\ndependent or \"non-universal\". On the other hand, the product g∗ λ∗ has been argued [8,10]\nto be universal and can be measured in principle. And indeed, the products of the numbers\nin (5.5) and in (5.7) agree almost perfectly within the precision one could reasonably\nexpect:\n(g∗ λ∗ )(kin) ≈ 1.296,\n\n(g∗ λ∗ )(pot) ≈ 1.106\n\n(5.8)\n\nAccording to both calculations the respective NGFP is always located within the\nphysical part of the (g, λ)-plane.\nIt is straightforward to generalize the calculations for arbitrary dimensionalities d,\nsee ref. [24]. The numerical results for d between 3 and 10 are displayed in Table 1. In\nall dimensions considered a NGFP is found to exist, with g∗ > 0 and λ∗ > 0. For each\nvalue of d, the table contains the results obtained within the full Einstein–Hilbert (EH)\ntruncation as well as the \"pot\" and \"kin\" variants of the CREH truncation. It contains\n2/(d−2)\n\nalso the generalization of g∗ λ∗ , namely τd ≡ λ∗ g∗\n\nof the dimensionless combination\n\n2/(d−2)\nΛ k Gk\n\n=\n\nwhich is the fixed point value\n\n2/(d−2)\n.\nλk g k\n\n(Note that in d dimensions\n\ngk = k d−2 Gk and λk = k −2 Λk .) It is impressive to see how well the \"pot\" and \"kin\"\nvalues of τd agree for any d ≥ 4. As compared to the full Einstein–Hilbert result, the\n\nτd -values are always larger by about a factor of 10.\n\nWe interpret this factor as indicating that the conformal factor is not the only degree\nof freedom driving the formation of a NGFP, but its contribution is typical in the sense\nthat it leads to an RG flow which is qualitatively similar to the full one.\n\n28\n\n\fd\n\nTrunc.\n\ng∗\n\n3\n\nfull EH\n\n0.202139\n\n0.0651806 0.00266329\n\nCREH, pot\n\n0.172872\n\nCREH, kin\n4\n\n5\n\n6\n\n7\n\n8\n\n9\n\n10\n\nθ′\n\nθ ′′\n\n1.11664\n\n0.827598\n\n0.233092\n\n0.00696588 -3.54754\n\n4.92795\n\n0.391798\n\n0.126945\n\n0.0194868\n\n2.04572\n\n3.60445\n\nfull EH\n\n0.707321\n\n0.193201\n\n0.136655\n\n1.4753\n\n3.04321\n\nCREH, pot\n\n2.6654\n\n0.41477\n\n1.10553\n\n1.47122\n\n9.30442\n\nCREH, kin\n\n4.65005\n\n0.278753\n\n1.29622\n\n4.0\n\n6.1837\n\nfull EH\n\n2.85863\n\n0.234757\n\n0.472851\n\n2.76008\n\n5.12941\n\nCREH, pot\n\n26.9696\n\n0.557727\n\n5.01577\n\n5.81627\n\n12.0556\n\nCREH, kin\n\n42.3258\n\n0.417188\n\n5.06681\n\n6.27681\n\n8.6899\n\nfull EH\n\n13.8555\n\n0.255477\n\n0.950958\n\n4.48592\n\n7.07967\n\nCREH, pot\n\n243.547\n\n0.674559\n\n10.5272\n\n10.8493\n\n14.3777\n\nCREH, kin\n\n361.57\n\n0.537523\n\n10.221\n\n8.81712\n\n11.1844\n\nfull EH\n\n76.3589\n\n0.269073\n\n1.5241\n\n6.51007\n\n8.9431\n\nCREH, pot\n\n2134.67\n\n0.77282\n\n16.5886\n\n17.0223\n\n15.9635\n\nCREH, kin\n\n3069.3\n\n0.641211\n\n15.9154\n\n11.591\n\n13.6754\n\nfull EH\n\n464.662\n\n0.279376\n\n2.16389\n\n8.78536\n\n10.7446\n\nCREH, pot\n\n18744.8\n\n0.857143\n\n22.7691\n\n24.6444\n\n16.0092\n\nCREH, kin\n\n26451.9\n\n0.730796\n\n21.7745\n\n14.5789\n\n16.1597\n\nfull EH\n\n3066.23\n\n0.287851\n\n2.85326\n\n11.2969\n\n12.4932\n\nCREH, pot\n\n167205.0\n\n0.930559\n\n28.9135\n\n33.9881\n\n12.4239\n\nCREH, kin\n\n233516.0\n\n0.808694\n\n27.6432\n\n17.7666\n\n18.6307\n\nfull EH\n\n21673.5\n\n0.295179\n\n3.58153\n\n14.044\n\n14.1871\n\nCREH, pot 1.52489*106\n\n0.995177\n\n34.9712\n\n2.11943*106\n\n0.876935\n\n33.4597\n\n21.1433\n\n21.0813\n\nCREH, kin\n\nλ∗\n\nTable 1:\n\n29\n\nτd\n\n\f5.3\n\nCritical Exponents of the NGFP\nThe properties of the RG flow on (g, λ)-space linearized about the NGFP are deter-\n\nmined by the stability matrix\nB=\n\n\n\n∂βλ\n ∂λ\n∂βg\n∂λ\n\n\n\n∂βλ\n∂g \n∂βg\n∂g\n\n(5.9)\n\nevaluated at (g∗ , λ∗ ). Using the same notation as in [8, 9] we write the corresponding\neigenvalue problem as B V = −θ V and refer to the negative eigenvalues θ as the \"critical\n\nexponents\". In general B is not expected to be symmetric.\n\nEmploying the ηN from the kinetic term the resulting eigenvalues are non-zero\nand complex. The two critical exponents θ1,2 = θ′ ± iθ′′ form a complex conjugate pair\nwith real and imaginary parts given by, respectively,\nθ′ = 4,\n\n√ p\nθ′′ = 2 2 1 + 3 * 21/3 ≈ 6.1837\n\n(5.10)\n\nThe positive real part indicates that the NGFP is UV attractive (attractive for k → ∞)\nin both directions of the (g, λ)-plane. The non-vanishing imaginary part implies that near\n\nthe NGFP the RG trajectories are spirals. This is exactly the same pattern as in the full\nEinstein–Hilbert truncation [9].\nUsing instead the ηN from the potential we find the same qualitative behavior,\nbut the exponents are somewhat different:\nθ′ ≈ 1.471,\n\nθ′′ ≈ 9.304\n\n(5.11)\n\nThe discrepancy between (5.10) and (5.11) can serve as a rough measure for the\naccuracy of the calculation. First of all it is gratifying to see that both calculations lead\nto the same qualitative behavior: attractivity in both directions of parameter space, and\na non-zero imaginary part. Numerically, the values for θ′ and θ′′ probably can be trusted\nonly within a factor of 2 or so. In Table 1 we display the critical exponents also for the\nother dimensions and compare them to the values in the full calculation.\nIt has to be emphasized, however, that even in an exact treatment of the conformally\nreduced theory the resulting critical exponents would have no reason to agree with those\n\n30\n\n\fg\n15\n\n10\n\n5\nType Ia\n\nType IIa\n\nType IIIa\nΛ\n\n0\n\n0\n\n-0.1\n\n0.1\n\n0.2\n\n0.3\n\n0.4\n\nFigure 1: The figure shows the RG flow on the (g, λ)-plane which is obtained from the\n(kin)\n\nCREH truncation with ηN\n\n. The arrows point in the direction of decreasing k.\n\nfrom full QEG which quantizes also the other degrees of freedom contained in the metric.\nThe field contents of the two theories is different, and so one would expect them to belong\nto different universality classes, with different θ's.\n\n5.4\n\nThe Phase Portrait\nFinally we solve the coupled equations (4.14), (4.15) numerically in order to obtain\n(kin)\n\nthe phase portrait of the CREH flow. Using the anomalous dimension ηN\n\nwe find the\n\nresult displayed in Fig. 1. This flow diagram is strikingly similar to the corresponding\ndiagram of the full Einstein–Hilbert truncation5 . The flow is dominated by the NGFP\nand the GFP at the origin, and we can distinguish three types of trajectories spiraling\nout of the NGFP. They are heading for negative, vanishing, and positive cosmological\nconstant, respectively, and correspond exactly to the Type Ia, IIa, and IIIa trajectories\n5\n\nSee the diagram in Fig. 12 of ref. [9].\n\n31\n\n\fg\n15\n\n10\n\n5\n\nΛ\n\n0\n\n-0.1\n\n0\n\n0.1\n(pot)\n\nFigure 2: As in Fig. 1, but with ηN\n(pot)\n\nparameter space on which ηN\n\n0.2\n\n0.3\n\n0.4\n\n0.5\n\n. The fat line is the boundary of the physical\n\ndiverges.\n\nof the full flow [9]. The trajectories of the CREH Types Ia and IIa extend down to k = 0,\nthose of Type IIIa terminate at a non-zero kterm when they reach λ = 1/2, exactly as in\nthe full theory.\nIf we solve the RG equations with the second version of the anomalous dimension,\n(pot)\nηN ,\n\nwe obtain the phase portrait shown in Fig. 2. In the vicinity of the GFP and NGFP,\n\nrespectively, the structure of the flow, again, is exactly the same as in the full theory. The\nonly new feature here is that there exist trajectories which begin and end on the boundary\nof the physical part of (g, λ)-space which is given by eq. (4.20). Even though this feature\nis different from the full EH flow we see that the conformal factor drives the flow in the\nsame direction as the full metric and is in this sense representative. It is, however, too\nweak to push the trajectories sufficiently strongly away from the hyperbolic shape they\nhave in absence of any non-trivial RG effects [41].\nThe overall conclusion of this anaysis is that the RG flow implied by the scalar-like\n\n32\n\n\fCREH theory, at least in a neighborhood of the two fixed points, is qualitatively identical\nto that of the full Einstein–Hilbert truncation. In particular both versions of ηN agree on\nthe existence of a NGFP with precisely the properties required for asymptotic safety.\n\n6\n\nSummary\nThe ultimate theory of quantum gravity we are aiming at should be able to explain\n\nrather than merely postulate the spacetime we are living in. Therefore the conceptual\nfoundations of this theory, at no point, should depend on any special non-dynamical\nspacetime. For QEG this entails that the quantization must not involve any distinguished\nmetric, that is, it should be performed in a \"background independent\" way. Within the\nasymptotic safety program one tries to define QEG in terms of an RG trajectory on\nthe theory space of the gravitational average action Γk , and this trajectory is supposed to\npossess an ultraviolet fixed point. Since renormalization group concepts are crucial in this\ncontext one is led to ask what is the significance and role of \"background independence\"\nfor RG flows.\nAmong all the fields we use in order to describe Nature the metric enjoys a special\nstatus since it fixes the proper value of any dimensionful physical quantity. When one\napplies the Kadanoff–Wilson interpretation of RG flows as a sequence of consecutive\ncoarse graining steps to quantum gravity one would like to give an, at least approximate,\nphysical meaning to the notion of a coarse graining scale. The effective average action\nΓk [gμν , g μν ] meets this requirement by introducing k as a cutoff in the spectrum of the\ncovariant Laplacian pertaining to the background metric g μν . Hence the mass scale k\nis \"proper\", in the sense of the \"cutoff modes\" [22, 23], with respect to g μν . Therefore\nthe mode suppression term ∆k S and, as a result, the cutoff operator Rk depend on the\nbackground field in a non-trivial way which has a strong impact on the resulting RG flow.\nWe saw that to some extent asymptotic safety, the formation of a non-Gaussian fixed\npoint, is an essentially \"kinematical\" phenomenon resulting from this g μν -dependence of\nthe cutoff operator. This specific g μν -dependence is forced upon us by the requirement of\n\"background independence\"; it has no analog in matter field theories on a non-dynamical\n\n33\n\n\fspacetime.\nWe illustrated these issues by means of the CREH truncation which quantizes only\none of the degrees of freedom contained in the metric, the conformal factor. If we proceed\nnaively and ignore the special status of the metric we arrive at the φ4 -theory with a\nnegative quartic coupling which, according to Symanzik, is asymptotically free. If, instead,\nthe metric itself is used to set the proper scale of k, then the RG flow is different; in\nparticular there exists a non-Gaussian fixed point which is suitable for the asymptotic\nsafety program.\nIt is quite remarkable that, at the qualitative level, this simple scalar–like theory\nhas exactly the same flow diagram as the full Einstein–Hilbert truncation. It is therefore plausible to conjecture that the complicated selfinteractions of the helicity-2 modes,\nanother feature that distinguishes the metric from matter fields, is possibly not at the\nheart of asymptotic safety in gravity. Rather, a \"background independent\" quantization\nscheme seems to be essential.\n\n34\n\n\fReferences\n[1] For a general introduction see C. Kiefer, Quantum Gravity, Second Edition,\nOxford Science Publications, Oxford (2007).\n[2] A. Ashtekar, Lectures on non-perturbative canonical gravity,\nWorld Scientific, Singapore (1991);\nA. Ashtekar and J. Lewandowski, Class. Quant. Grav. 21 (2004) R53.\n[3] C. Rovelli, Quantum Gravity, Cambridge University Press, Cambridge (2004).\n[4] Th. Thiemann, Modern Canonical Quantum General Relativity,\nCambridge University Press, Cambridge (2007).\n[5] S. Weinberg in General Relativity, an Einstein Centenary Survey,\nS.W. Hawking and W. Israel (Eds.), Cambridge University Press (1979);\nS. Weinberg, hep-th/9702027.\n[6] M. Reuter, Phys. Rev. D 57 (1998) 971 and hep-th/9605030.\n[7] D. Dou and R. Percacci, Class. Quant. Grav. 15 (1998) 3449.\n[8] O. Lauscher and M. Reuter, Phys. Rev. D 65 (2002) 025013 and hep-th/0108040.\n[9] M. Reuter and F. Saueressig, Phys. Rev. D 65 (2002) 065016 and hep-th/0110054.\n[10] O. Lauscher and M. Reuter, Phys. Rev. D 66 (2002) 025026 and hep-th/0205062.\n[11] O. Lauscher and M. Reuter, Class. Quant. Grav. 19 (2002) 483 and hep-th/0110021.\n[12] O. Lauscher and M. Reuter, Int. J. Mod. Phys. A 17 (2002) 993 and hep-th/0112089.\n[13] W. Souma, Prog. Theor. Phys. 102 (1999) 181.\n[14] M. Reuter and F. Saueressig, Phys. Rev. D 66 (2002) 125001 and hep-th/0206145;\nFortschr. Phys. 52 (2004) 650 and hep-th/0311056.\n[15] A. Bonanno and M. Reuter, JHEP 02 (2005) 035 and hep-th/0410191.\n\n35\n\n\f[16] For reviews see: M. Reuter and F. Saueressig, arXiv:0708.1317 [hep-th],\nO. Lauscher and M. Reuter in Quantum Gravity, B. Fauser,\nJ. Tolksdorf and E. Zeidler (Eds.), Birkhäuser, Basel (2007) and hep-th/0511260;\nO. Lauscher and M. Reuter in Approaches to Fundamental Physics,\nI.-O. Stamatescu and E. Seiler (Eds.), Springer, Berlin (2007).\n[17] R. Percacci and D. Perini, Phys. Rev. D 67 (2003) 081503;\nPhys. Rev. D 68 (2003) 044018; Class. Quant. Grav. 21 (2004) 5035.\n[18] A. Codello and R. Percacci, Phys. Rev. Lett. 97 (2006) 221301;\nA. Codello, R. Percacci and C. Rahmede, Int. J. Mod. Phys. A 23 (2008) 143;\npreprint arXiv:0805.2909 [hep-th].\n[19] D. Litim, Phys. Rev. Lett. 92 (2004) 201301; AIP Conf. Proc. 841 (2006) 322;\nP. Fischer and D. Litim, Phys. Lett. B 638 (2006) 497;\nAIP Conf. Proc. 861 (2006) 336.\n[20] P. Machado and F. Saueressig, Phys. Rev. D 77 (2008) 124045.\n[21] O. Lauscher and M. Reuter, JHEP 10 (2005) 050 and hep-th/0508202.\n[22] M. Reuter and J.-M. Schwindt, JHEP 01 (2006) 070 and hep-th/0511021.\n[23] M. Reuter and J.-M. Schwindt, JHEP 01 (2007) 049 and hep-th/0611294.\n[24] M. Reuter and H. Weyer, preprint arXiv:0801.3287 [hep-th].\n[25] M. Reuter and H. Weyer, preprint arXiv:0804.1475 [hep-th].\n[26] J.-E. Daum and M. Reuter, preprint arXiv:0806.3907 [hep-th].\n[27] P. Forgács and M. Niedermaier, hep-th/0207028;\nM. Niedermaier, JHEP 12 (2002) 066; Nucl. Phys. B 673 (2003) 131;\nClass. Quant. Grav. 24 (2007) R171.\n\n36\n\n\f[28] For detailed reviews of asymptotic safety in gravity see:\nM. Niedermaier and M. Reuter, Living Reviews in Relativity 9 (2006) 5;\nR. Percacci, arXiv:0709.3851 [hep-th].\n[29] C. Wetterich, Phys. Lett. B 301 (1993) 90.\n[30] M. Reuter and C. Wetterich,\nNucl. Phys. B 417 (1994) 181, Nucl. Phys. B 427 (1994) 291,\nNucl. Phys. B 391 (1993) 147, Nucl. Phys. B 408 (1993) 91;\nM. Reuter, Phys. Rev. D 53 (1996) 4430, Mod. Phys. Lett. A 12 (1997) 2777.\n[31] J. Berges, N. Tetradis and C. Wetterich, Phys. Rep. 363 (2002) 223;\nC. Wetterich, Int. J. Mod. Phys. A 16 (2001) 1951.\n[32] For reviews of the effective average action in Yang–Mills theory see:\nM. Reuter, hep-th/9602012; J. Pawlowski, hep-th/0512261; H. Gies, hep-ph/0611146.\n[33] A. Bonanno and M. Reuter, Phys. Rev. D 62 (2000) 043008 and hep-th/0002196;\nPhys. Rev. D 73 (2006) 083005 and hep-th/0602159;\nPhys. Rev. D 60 (1999) 084011 and gr-qc/9811026.\n[34] M. Reuter and E. Tuiran, hep-th/0612037.\n[35] A. Bonanno and M. Reuter, Phys. Rev. D 65 (2002) 043508 and hep-th/0106133;\nM. Reuter and F. Saueressig, JCAP 09 (2005) 012 and hep-th/0507167.\n[36] A. Bonanno and M. Reuter, Phys. Lett. B 527 (2002) 9 and astro-ph/0106468;\nInt. J. Mod. Phys. D 13 (2004) 107 and astro-ph/0210472;\nE. Bentivegna, A. Bonanno and M. Reuter, JCAP 01 (2004) 001\nand astro-ph/0303150.\n[37] A. Bonanno and M. Reuter, JCAP 08 (2007) 024 and arXiv:0706.0174 [hep-th].\n[38] A. Bonanno, G. Esposito and C. Rubano, Gen. Rel. Grav. 35 (2003) 1899;\nClass. Quant. Grav. 21 (2004) 5005;\n\n37\n\n\fA. Bonanno, G. Esposito, C. Rubano and P. Scudellaro,\nClass. Quant. Grav. 23 (2006) 3103 and 24 (2007) 1443.\n[39] M. Reuter and H. Weyer, Phys. Rev. D 69 (2004) 104022 and hep-th/0311196.\n[40] M. Reuter and H. Weyer, Phys. Rev. D 70 (2004) 124028 and hep-th/0410117.\n[41] M. Reuter and H. Weyer, JCAP 12 (2004) 001 and hep-th/0410119.\n[42] F. Girelli, S. Liberati, R. Percacci and C. Rahmede,\nClass. Quant. Grav. 24 (2007) 3995.\n[43] D. Litim and T. Plehn, Phys. Rev. Lett. 100 (2008) 131301.\n[44] J. Moffat, JCAP 05 (2005) 2003;\nJ.R. Brownstein and J. Moffat, Astrophys. J. 636 (2006) 721;\nMon. Not. Roy. Astron. Soc. 367 (2006) 527.\n[45] L.F. Abbott, Nucl. Phys. B 185 (1981) 189;\nB.S. DeWitt, Phys. Rev. 162 (1967) 1195;\nM.T. Grisaru, P. van Nieuwenhuizen and C.C. Wu, Phys. Rev. D 12 (1975) 3203;\nD.M. Capper, J.J. Dulwich and M. Ramon Medrano, Nucl. Phys. B 254 (1985) 737;\nS.L. Adler, Rev. Mod. Phys. 54 (1982) 729.\n[46] R. Floreanini and R. Percacci, Nucl. Phys. B 436 (1995) 141;\nPhys. Rev. D 46 (1992) 1566.\n[47] A.M. Polyakov, Yad. Fiz. 64 (2001) 594\n[English Translation: Phys. Atom. Nucl. 64 (2001) 540].\n[48] R. Jackiw, C. Núñez and S.-Y. Pi, Phys. Lett. A 347 (2005) 47.\n[49] K. Symanzik, Nuovo Cim. Lett. 6 (1973) 77.\n[50] For a historic account see: G. 't Hooft, Nucl. Phys. B 254 (1985) 11.\n\n38\n\n\f[51] O. Lauscher, M. Reuter and C. Wetterich,\nPhys. Rev. D 62 (2000) 125021 and hep-th/0006099.\n[52] M. Reuter and C. Wetterich, Nucl. Phys. B 506 (1997) 483 and hep-th/9605039.\n[53] J.V. Narlikar and T. Padmanabhan,\nGravity, Gauge Theories and Quantum Cosmology, D. Reidel, Dordrecht (1986),\nChapter 12 and references therein.\n[54] D. Litim, Phys. Lett. B 486 (2000) 92; Phys. Rev. D 64 (2001) 105007;\nInt. J. Mod. Phys. A 16 (2001) 2081.\n\n39\n\n\f"}