{"id": "http://arxiv.org/abs/0809.1557v2", "guidislink": true, "updated": "2008-10-28T20:27:42Z", "updated_parsed": [2008, 10, 28, 20, 27, 42, 1, 302, 0], "published": "2008-09-09T13:45:51Z", "published_parsed": [2008, 9, 9, 13, 45, 51, 1, 253, 0], "title": "Oblique ion collection in the drift-approximation: how magnetized\n  Mach-probes really work", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0809.4534%2C0809.4531%2C0809.1799%2C0809.0811%2C0809.1645%2C0809.1653%2C0809.1182%2C0809.4103%2C0809.1121%2C0809.2320%2C0809.0502%2C0809.4733%2C0809.1186%2C0809.3753%2C0809.2789%2C0809.2723%2C0809.0941%2C0809.1047%2C0809.4267%2C0809.3926%2C0809.3357%2C0809.1215%2C0809.0670%2C0809.4600%2C0809.0700%2C0809.1926%2C0809.0002%2C0809.1414%2C0809.1314%2C0809.2712%2C0809.1849%2C0809.0424%2C0809.2780%2C0809.2851%2C0809.2702%2C0809.0958%2C0809.2864%2C0809.5044%2C0809.5250%2C0809.0582%2C0809.2226%2C0809.3762%2C0809.4054%2C0809.2719%2C0809.2450%2C0809.3724%2C0809.1915%2C0809.5009%2C0809.4530%2C0809.1456%2C0809.3617%2C0809.3580%2C0809.4185%2C0809.1957%2C0809.5285%2C0809.0211%2C0809.0581%2C0809.2362%2C0809.3255%2C0809.1524%2C0809.0110%2C0809.3232%2C0809.0925%2C0809.5215%2C0809.1536%2C0809.3170%2C0809.0209%2C0809.2220%2C0809.1526%2C0809.4604%2C0809.3961%2C0809.1557%2C0809.2372%2C0809.3283%2C0809.2623%2C0809.1841%2C0809.2225%2C0809.4215%2C0809.3557%2C0809.3452%2C0809.5179%2C0809.4669%2C0809.4991%2C0809.4072%2C0809.2520%2C0809.0527%2C0809.1360%2C0809.1537%2C0809.1977%2C0809.2059%2C0809.4217%2C0809.4325%2C0809.3570%2C0809.2126%2C0809.3869%2C0809.4287%2C0809.3427%2C0809.4708%2C0809.3524%2C0809.2108%2C0809.1499&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Oblique ion collection in the drift-approximation: how magnetized\n  Mach-probes really work"}, "summary": "The anisotropic fluid equations governing a frictionless obliquely-flowing\nplasma around an essentially arbitrarily shaped three-dimensional ion-absorbing\nobject in a strong magnetic field are solved analytically in the quasi-neutral\ndrift-approximation, neglecting parallel temperature gradients. The effects of\ntransverse displacements traversing the magnetic presheath are also quantified.\nIt is shown that the parallel collection flux density dependence upon external\nMach-number is $n_\\infty c_s \\exp[-1 -(M_{\\parallel\\infty}-\nM_\\perp\\cot\\theta)]$ where $\\theta$ is the angle (in the plane of field and\ndrift velocity) of the object-surface to the magnetic-field and\n$M_{\\parallel\\infty}$ is the external parallel flow. The perpendicular drift,\n$\\M_\\perp$, appearing here consists of the external $\\E\\wedge\\B$ drift plus a\nweighted sum of the ion and electron electron diamagnetic drifts that depends\nupon the total angle of the surface to the magnetic field. It is that somewhat\ncounter-intuitive combination that an oblique (transverse) Mach probe\nexperiment measures.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0809.4534%2C0809.4531%2C0809.1799%2C0809.0811%2C0809.1645%2C0809.1653%2C0809.1182%2C0809.4103%2C0809.1121%2C0809.2320%2C0809.0502%2C0809.4733%2C0809.1186%2C0809.3753%2C0809.2789%2C0809.2723%2C0809.0941%2C0809.1047%2C0809.4267%2C0809.3926%2C0809.3357%2C0809.1215%2C0809.0670%2C0809.4600%2C0809.0700%2C0809.1926%2C0809.0002%2C0809.1414%2C0809.1314%2C0809.2712%2C0809.1849%2C0809.0424%2C0809.2780%2C0809.2851%2C0809.2702%2C0809.0958%2C0809.2864%2C0809.5044%2C0809.5250%2C0809.0582%2C0809.2226%2C0809.3762%2C0809.4054%2C0809.2719%2C0809.2450%2C0809.3724%2C0809.1915%2C0809.5009%2C0809.4530%2C0809.1456%2C0809.3617%2C0809.3580%2C0809.4185%2C0809.1957%2C0809.5285%2C0809.0211%2C0809.0581%2C0809.2362%2C0809.3255%2C0809.1524%2C0809.0110%2C0809.3232%2C0809.0925%2C0809.5215%2C0809.1536%2C0809.3170%2C0809.0209%2C0809.2220%2C0809.1526%2C0809.4604%2C0809.3961%2C0809.1557%2C0809.2372%2C0809.3283%2C0809.2623%2C0809.1841%2C0809.2225%2C0809.4215%2C0809.3557%2C0809.3452%2C0809.5179%2C0809.4669%2C0809.4991%2C0809.4072%2C0809.2520%2C0809.0527%2C0809.1360%2C0809.1537%2C0809.1977%2C0809.2059%2C0809.4217%2C0809.4325%2C0809.3570%2C0809.2126%2C0809.3869%2C0809.4287%2C0809.3427%2C0809.4708%2C0809.3524%2C0809.2108%2C0809.1499&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "The anisotropic fluid equations governing a frictionless obliquely-flowing\nplasma around an essentially arbitrarily shaped three-dimensional ion-absorbing\nobject in a strong magnetic field are solved analytically in the quasi-neutral\ndrift-approximation, neglecting parallel temperature gradients. The effects of\ntransverse displacements traversing the magnetic presheath are also quantified.\nIt is shown that the parallel collection flux density dependence upon external\nMach-number is $n_\\infty c_s \\exp[-1 -(M_{\\parallel\\infty}-\nM_\\perp\\cot\\theta)]$ where $\\theta$ is the angle (in the plane of field and\ndrift velocity) of the object-surface to the magnetic-field and\n$M_{\\parallel\\infty}$ is the external parallel flow. The perpendicular drift,\n$\\M_\\perp$, appearing here consists of the external $\\E\\wedge\\B$ drift plus a\nweighted sum of the ion and electron electron diamagnetic drifts that depends\nupon the total angle of the surface to the magnetic field. It is that somewhat\ncounter-intuitive combination that an oblique (transverse) Mach probe\nexperiment measures."}, "authors": ["I H Hutchinson"], "author_detail": {"name": "I H Hutchinson"}, "author": "I H Hutchinson", "arxiv_comment": "Revised version following refereeing for Physics of Plasmas", "links": [{"href": "http://arxiv.org/abs/0809.1557v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0809.1557v2", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "physics.plasm-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "physics.plasm-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "physics.space-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0809.1557v2", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0809.1557v2", "journal_reference": null, "doi": null, "fulltext": "arXiv:0809.1557v2 [physics.plasm-ph] 28 Oct 2008\n\nOblique ion collection in the drift-approximation: how\nmagnetized Mach-probes really work.\nI H Hutchinson\nPlasma Science and Fusion Center and\nDepartment of Nuclear Science and Engineering,\nMassachusetts Institute of Technology,\nCambridge, MA 02139, USA\nSeptember 24, 2018\nAbstract\nThe anisotropic fluid equations governing a frictionless obliquely-flowing plasma\naround an essentially arbitrarily shaped three-dimensional ion-absorbing object in a\nstrong magnetic field are solved analytically in the quasi-neutral drift-approximation,\nneglecting parallel temperature gradients. The effects of transverse displacements\ntraversing the magnetic presheath are also quantified. It is shown that the parallel collection flux density dependence upon external Mach-number is n∞ cs exp[−1 −\n(Mk∞ − M⊥ cot θ)] where θ is the angle (in the plane of field and drift velocity) of the\nobject-surface to the magnetic-field and Mk∞ is the external parallel flow. The perpendicular drift, M⊥ , appearing here consists of the external E ∧ B drift plus a weighted\nsum of the ion and electron diamagnetic drifts that depends upon the total angle of\nthe surface to the magnetic field. It is that somewhat counter-intuitive combination\nthat an oblique (transverse) Mach probe experiment measures.\n\n1\n\nIntroduction\n\nIon collection by solid objects immersed in a plasma is a problem of perennial interest in\nplasma physics. It provides the basis for the measurement of plasma parameters by electric\n(Langmuir) probes[1] as well as the charging of dust[2] and spacecraft[3]. The present work\naddresses the situation where the ion Larmor radius (in the background magnetic field B)\nis much smaller than the object, so that perpendicular plasma flow is strongly constrained.\nThis problem has important similarities to the solution of the flow of plasma to a plane\naligned obliquely to the field, the most obvious example being a tokamak divertor plate.\nThat problem can be formulated[4] as one-dimensional, taking the coordinates in the plane\nas being ignorable. However, it is well established that no spatially-varying solution of the\n1\n\n\fquasi-neutral plasma equations in one dimension is possible without additional sources of\nparticles (e.g. through ionization) or momentum (e.g. from collisions). Recent studies of this\nproblem of the one-dimensional magnetized plasma and oblique presheath (e.g. [5, 6]) have\nmostly focussed on collisions as the mechanism allowing the acceleration of the plasma into\nthe magnetic presheath. For localized probes, however, if one conceptualizes the problem\nas being dominated by the one-dimensional dynamics along the field, the cross-field flux\ndivergence is the most natural effective source to permit parallel gradients.\nPrior theoretical probe studies have focussed on situations where the cross-field magnetizedion flux can be described (somewhat phenomenologically) as diffusive. The full numerical\nsolutions for this formulation [7, 8] yield the dependence of the collected ion flux density\non the plasma density and temperature, and the parallel (to B) Mach-number. That provides the theoretical calibration factor for a (parallel) Mach-probe (a probe with electrodes\nfacing parallel and anti-parallel to the field), when the perpendicular drift velocity is ignorable. This \"calibration\" proves to be in good agreement with independent measurements\nand calculations [9] and has been widely adopted for experimental interpretation.\nThe approximate one-dimensional diffusive treatment has been generalized[10] to include\nan additional perpendicular plasma drift velocity, accounting for the boundary-condition\nmodification[11] that the transverse drift causes. Measuring the dependence of the ion collection current-density on orientation of oblique probe faces then allows one to deduce the\nperpendicular as well as the parallel external drift velocity. The generalized solution can\nbe shown[1] to be a simple Galilean transformation of the solution for zero transverse drift,\nwhich incidentally reminds us of the elementary physical equivalence of E ∧ B drift past a\nfixed object and motion of the object through a stationary plasma. The equivalence also indicates, though, that the generalized diffusion solution is rigorously valid only for an oblique\nsurface of effectively infinite dimension in the transverse drift direction (so that the Galilean\nequivalence in this direction is valid), but finite in the direction perpendicular to both flow\nand magnetic field (so that diffusion in this perpendicular direction dominates the cross-field\ndivergence). Practical Mach-probes generally do not have this configuration. They are more\noften multi-faceted 'Gundestrup' types[12, 13, 14], where many short adjacent collectors are\nused with different orientations. So it is not obvious that the generalized diffusive solution\napplies.\nIn fact, when there is substantial pre-existing cross-field drift of the ions, it is perhaps\nphysically more reasonable to regard that drift as the dominant cross-field transport mechanism, and to ignore diffusion. Gunn [15, 9] has explored this problem, with a uniform\nimpressed cross-field drift, in two dimensions with his particle-in-cell code. This drift physics\nis appropriate to many space and astrophysical problems too; for example to the interaction\nof Jupiter's satellites with its magnetosphere. It is the purpose of the present work to derive a general analytic (3-dimensional) solution to this purely advective problem, with fully\nself-consistent drift velocity.\nFirst, to introduce the solution by characteristics, we recall a recent complete exact\nsolution to this problem[16] for an arbitrary shaped probe under the model ansatz that the\nperpendicular drift velocity is uniform. This is a generalization of an earlier self-similar\n\n2\n\n\fsolution[17] mathematically equivalent to a one-dimensional free expansion into a vacuum.\nThe very simple general analytic result obtained for the ion flux is gratifyingly close to the\ndiffusive-plasma result, and hence to the PIC calculations of Gunn (which include full ion\ndistribution-function parallel gradients). The solution demonstrates that provided the probe\nis convex, the flux is not affected (for negligible Larmor radius) by spatial derivatives of the\nsurface angle in the drift-direction. The uniform drift ansatz is justified by inspection only\nwhen the probe is two-dimensional; so that the coordinate perpendicular to the field and\ndrift is ignorable and the probe-perturbation of the plasma does not introduce additional\ndrifts except along the ignorable coordinate. Again, practical probes are generally not wellapproximated as two-dimensional, so the question remains as to whether that uniform-driftvelocity solution applies in practice.\nThe following remarkable result is rigorously demonstrated in section 4. The ion flux to\nthe probe surfaces derived for uniform-drift-velocity does apply even when the full spatiallyvarying self-consistent drift velocity, including the perturbation from an arbitrarily-shaped\nthree-dimensional probe, is accounted for. When the external drift arises purely from electric\nfield, one can obtain the full self-consistent spatial dependence of the density and velocity\nthroughout the perturbed plasma region, using an elementary geometric algorithm. Some\nexamples are given.\nFurthermore, external diamagnetic drifts can also be included, again for arbitrary-shaped\nthree-dimensional probes. They make important but counterintuitive contributions to the\nobserved ion current density. In addition to the effects that arise in the plasma, it is essential to account for transverse displacements that arise in the magnetic presheath; they are\ncalculated in section 5. Such local drifts in the magnetic presheath have previously been\nidentified[18, 19] as important contributors to oblique boundary conditions. Based on these\nprior considerations, it has sometimes been asserted that diamagnetic drifts do not transport mass to a surface. The present work provides a more general solution of the magnetic\npresheath displacement effects, dispensing with small-angle approximations, and clarifies\nrigorously the extent to which diamagnetic drifts actually do contribute to the observed\nflux.\nThe final result is that a transverse Mach-probe measures effectively the sum of the\nexternal E ∧ B drift and a combination of the ion and electron diamagnetic drifts. At small\nangles between the field and the collector, the dominant diamagnetic term is the electron\ndiamagnetic drift, which of course is generally in the opposite direction to the ion diamagnetic\ndrift.\nThe presheath displacements can give rise to bias in Mach probe measurements. Its\nrelative magnitude is of order the ratio of Larmor radius to electrode size. The effects of\northogonal displacements in the plasma region are also calculated rigorously. They modify the expression for the flux in ways that are usually of little importance for practical\nmeasurements.\n\n3\n\n\f2\n\nFormulation\n\nWe analyse the dynamics of the ion-fluid through the steady-state continuity and momentum\nequations\n∇.(nv) = 0\nmn(v.∇)v = −nZe∇φ − ∇p + nZe(v ∧ B) ,\n\n(1)\n(2)\n\nwhere m, Z, n, p, Ti , v are the ion mass, charge-number, density, pressure, temperature,\nand velocity, and φ is the potential. We split the momentum equation into the components\nparallel (k ) and perpendicular (⊥ ) to the (assumed uniform) magnetic field, and take the\ncross-product with B of the perpendicular part to obtain the form\nv⊥ = −\n\n\u0014\u0012\n\n∇⊥ φ +\n\n1\nm\nB\n∇⊥ p +\n(v.∇)v⊥ ∧ 2 .\nnZe\nZe\nB\n\u0015\n\n\u0013\n\n(3)\n\nWe can immediately identify the first two terms in this expression as the E ∧ B and diamagnetic drifts. The last term can be considered to be the polarization drift, which we will\nregard as ignorable. The approximation of omitting the polarization drift requires the Larmor radius to be small c.f. the perpendicular scale-length, generally the probe dimensions.\nIt can be shown by a posteriori calculation that the polarization drift is smaller than the\nimposed perpendicular drift by a factor that is second-order in the Larmor radius. Ignoring\nthe polarization drift term is the meaning here of the expression \"drift-approximation\". By\ntaking B to be uniform we have of course eliminated the grad-B and curvature drifts. We\nadopt the simplest possible fluid closure scheme, that the ion temperature, Ti , is invariant, so\nthat the pressure is simply proportional to density. Together with dropping the polarization\ndrift, this makes v⊥ divergenceless:\nB\nTi\nB\n1\n∇⊥ p ∧ 2 = −∇⊥ φ +\nln n ∧ 2 .\nv⊥ = − ∇⊥ φ +\nnZe\nB\nZe\nB\n\u0012\n\n\u0013\n\n\u0012\n\n\u0013\n\n(4)\n\nUnder these approximations the continuity and parallel-momentum equations become\n(v.∇) ln n + ∇k vk = 0\n\u0012\n\u0013\nZe\nTi\n(v.∇)vk +\n∇k φ +\nln n = 0 ,\nm\nZe\n\n(5)\n(6)\n\nwhile the perpendicular-momentum conservation is expressed by the drift v⊥ expression.\nThe potential is eliminated from these equations by accounting for the self-consistent\nsolution of the electric field arising from the ion and electron densities. The electron density\nresponse along the magnetic field is, as usual, taken to involve rapid equilibration; so that\nthe electron pressure gradient is balanced by electric field:\n∇k φ = (Te /e)∇k ln ne ,\n\n(7)\n\nwhere the parallel gradient of the electron temperature, ∇k Te , is taken to be zero and the\nelectron density is ne . Assuming that the Debye length is much smaller than the probe, we\nwill treat the plasma as quasi-neutral, so that ne = Zn.\n4\n\n\fUsing the notation c2s ≡ (ZTe + Ti )/m and M ≡ v/cs , the ion equations then take the\nnormalized form:\nM.∇ ln n + ∇k Mk = 0\nM.∇Mk + ∇k ln n = 0 ,\n\n(8)\n(9)\n\nwhich can be rearranged by adding and subtracting to show explicitly the \"characteristics\"\n[20]\n(M.∇ + ∇k )(ln n + Mk ) = 0\n(M.∇ − ∇k )(ln n − Mk ) = 0 .\n\n(10)\n(11)\n\nThus the quantities (ln n ± Mk ) are constant along their corresponding characteristics dx =\n(M ± B/B)ds. And we can fully solve the problem by analysis of the characteristics.\n\n3\n\nUniform perpendicular-velocity ansatz\n\nFirst we review the solution under the condition that the perpendicular velocity is simply\na constant, M⊥ , independent of space. This ansatz is clearly justified if the coordinate\nperpendicular to B and M⊥ is ignorable. See ref [16] for additional details and explanation\nof the following derivation. We choose axes such that B is aligned along x and M⊥ = Mh ŷ\nalong y. The requirements expressed by the characteristics (10, 11) are that both\n(ln n + Mk ) = const along dx = dy(Mk + 1)/Mh ,\n\n(12)\n\n(ln n − Mk ) = const along dx = dy(Mk − 1)/Mh .\n\n(13)\n\nand\nThese will be referred to respectively as the positive and negative characteristics.\nFor definiteness, we now consider plasma that is on the higher-x side (to the right) of the\nobject. Figure 1 will be used for illustration. For any point in the plasma, a positive and a\nnegative characteristic pass through it. If both characteristics originate in the unperturbed\nplasma at y → −∞, and do not enclose the object, then values at the point satisfy both\nln n + Mk = ln n∞ + M∞ and ln n − Mk = ln n∞ − Mk∞ (where ∞ indicates values in\nthe unperturbed region). These simultaneous equations have only one solution: n = n∞ ,\nMk = Mk∞ , showing that the point is in the unperturbed region, for example: P0 . The\ncharacteristics for such points are straight lines with slopes Mh /(Mk∞ ± 1).\nThe most important case is when just one of the characteristics originates not at y =\n−∞, but on the surface of the object (e.g. P1 ). The positive characteristic is always to\nthe left of the negative characteristic, when tracing backward from a common point. So\nthe characteristic that originates on the object is the positive one. On that characteristic,\n(ln n + Mk ) is constant, but not equal to the unperturbed value. Each point along the\npositive characteristic satisfies also ln n − Mk = ln n∞ − Mk∞ because there are negative\ncharacteristics from infinity to each point. The only way to satisfy these two requirements\n5\n\n\fP4\n\nM⊥\n\ny\nθ4\nP2\n\nθ\n\nx\nB\n\nθ2\nObject Region\n\nPerturbed\nPlasma Region\nP1\n\nP3\n\nPositive\nCharacteristic\nθm\n\nP0\n\nNegative\nCharacteristic\nUnperturbed\nPlasma Region\n\nFigure 1: (Color online). Construction of the solutions at different points. P0 is in the\nunperturbed region. For P1 the characteristics are shown. P3 is in a concave region and\nso its positive characteristic is not tangent at P3 . A value θ > π/2 such as for P4 is not\nproblematic.\nis that, along the positive characteristic, Mk = const and n = const. If Mk = const, then\nthe slope of the characteristic, Mh /(Mk + 1) is constant. It is a straight line.\nThe line's slope is determined by the absorbing boundary condition at the plasma edge.\nThat condition requires[16] Mk to be as negative as possible consistent with the overall\nsolution, which requires the greatest possible slope-angle θ ≡ arctan[Mh /(Mk + 1)] (even\nperhaps such that θ > π/2). The characteristic must therefore always be tangential to\nthe object boundary where it intersects it. Thus, all positive characteristics that originate\non the boundary do so as tangents, and for any point in the perturbed plasma region the\npositive characteristic is that straight line passing through the point which has greatest θ and\noriginates as a tangent on the object. Once that line is determined geometrically, its slope\ndetermines Mk and hence n at all points along it. If the steepest tangent angle is less than\nθm = arctan[Mh /(Mk∞ + 1)], then the positive characteristic does not intersect the object,\nbut has slope θ = θm ; and the point is in unperturbed plasma. The entire solution for the\nplasma in the perturbed neighborhood of an arbitrary-shaped object is thus\nn = n∞ exp(Mk − Mk∞ ),\n\nMk = Mh cot θ − 1.\n\n(14)\n\nThe solution (14) provides an extremely simple formula for the ion flux to a surface not\naffected by concavity. Adding the perpendicular and parallel components, the total flux\ndensity along the outward normal within the (x, y)-plane, i.e. in the direction (− sin θ, cos θ),\nis ncs (Mh cos θ − Mk sin θ) = ncs sin θ. Written as flux per unit area perpendicular to the\nmagnetic field, this is\nΓk = n∞ cs exp[−1 − (Mk∞ − Mh cot θ)].\n6\n\n(15)\n\n\fFirst, this form indicates, importantly, that for points not in a concave region of the\nobject, the collected flux depends only on the angle of the surface there, and not on the\nshape of the object at smaller y. Second, the exponential dependence upon Mk∞ is within\n10% of the dependence, exp[−1 − 1.1(Mk∞ − Mh cot θ)], that fits the diffusive solution[10, 1].\nThird, consideration of the characteristics shows unambiguously that leading faces, for which\nθ < θm receive simply the unperturbed flux [Γk = n∞ cs (Mh cot θ−Mk∞ )], while trailing faces,\neven those for which Mk∞ − Mh cot θ > 1, are governed by the formula (15). The boundary\ncondition at the magnetic presheath edge is just the same as what is sometimes called the\n\"magnetized Bohm condition\" but arises here naturally from the analysis of the quasi-neutral\nequations.\nIn a concave region of the object, e.g. at P3 , the surface angle (local tangent) θs , is\nsmaller than the characteristic's angle θ, and the distinction must be retained. This leads to\nan enhanced ion flux, equal to equation (15) times the extra factor (Mh cot θs −Mh cot θ + 1).\n\n4\n\nAccounting for self-consistent drifts\n\nThe presence of the probe perturbs the plasma potential and density, for example as calculated in the model case of the previous section. Most probes are of limited extent in the\ndirection (z) perpendicular to the plane containing B and M⊥∞ , and indeed may have a\nnon-zero z-component of the normal to the collecting surface. The plasma perturbations\ntherefore give rise to spatially-varying ion drifts that frequently break the (z-translational)\nsymmetry assumption used to justify the homogeneous-M⊥ ansatz. So we must now return\nto the full equations (10, 11) accounting for the complete, self-consistent, spatially-varying,\nperpendicular velocity.\nThe interesting case is of points for which (only) one of the characteristics starts not at\ninfinity but on the probe itself. As before, for definiteness, but without loss of generality, we\nwill take that to be the positive characteristic. At this point then (ln n+Mk ) 6= (ln n∞ +Mk∞ );\nnevertheless, because of the negative characteristic, it is still true that (ln n−Mk ) = (ln n∞ −\nMk∞ ) = const. This shows that in a region whose points have any characteristic starting\nat infinity, the nature of the solution is of the form Mk = Mk (n), and especially ∇Mk\nis parallel to ∇n. Consequently if there is a self-consistent combination of density and\nvelocity fields {n, Mk , M⊥ = M⊥0 } that satisfies the advection equations (10, 11) (and\nthe drift equation, 4), any perpendicular vector field, M⊥1 , that satisfies M⊥1 .∇n = 0, also\nsatisfies M⊥1 .∇Mk = 0. We can therefore subtract any such M⊥1 from M⊥ without affecting\nthe characteristic equations (10, 11). In other words, the combination {n, Mk , M⊥ =\n(M⊥0 − M⊥1 )} also satisfies the characteristic equations (though not the drift equation,\n4). Moreover, the subtraction of M⊥1 leaves the boundary condition at the plasma edge\ninvariant provided probe curvature is small compared with 1/ρs . The invariance follows\nfrom the boundary condition being that the positive characteristic be tangent to the surface.\nIf the surface is expressed by the equation s(x, y, z) = 0, then tangency is dx.∇s = 0,\nwhich along the characteristic is (Mk + 1)∇k s + M⊥ .∇⊥ s = 0. In so far as ∇s and ∇n are\nparallel (i.e. the density is invariant in the tangential directions) subtracting M⊥1 leaves this\n7\n\n\fcondition unchanged. But n is indeed invariant along the surface when given by eq (14)\nprovided that the surface angle (θs ) gradient (i.e. curvature) can be ignored.\nThe significance of these observations is profound. It means that although the actual\nperpendicular velocity M⊥ may be very complicated, and include drifts arising from the\nself-consistent potential- and density-gradients caused by the presence of the probe, we do\nnot have to solve the associated complicated characteristics. Instead, we can subtract from\nM⊥ any drift that satisfies M⊥1 .∇n = 0, and solve the resulting simpler characteristics. The\nresulting solution for n and Mk is correct then also for the full drift M⊥ expression.\n\n4.1\n\nPure E ∧ B external drift\n\nConsider first the case when the unperturbed plasma has uniform density (n∞ = const)\nas well as temperature, but has a uniform impressed perpendicular electric field in the zdirection perpendicular to the field , (B/B = x̂), giving rise to an E∧B drift. In other words,\nwe have a non-uniform potential, φ∞ (z), such that ∇φ∞ = −ẑE; so that the homogenous\ndrift is vh = ŷE/B = Mh cs .\nIn the presence of the probe, the electron parallel momentum (force-balance) equation\ncan be integrated along the field, from infinity to any position to give the perturbed potential\nφ − φ∞ (z) = (Te /e) ln(n/n∞ ) .\n\n(16)\n\nWe substitute this into the drift expression to get\nv⊥\n\nTe\nTi\nB\n= −∇ φ∞ +\nln(n/n∞ ) +\nln n ∧ 2\ne\nZe\nB\n!\nmc2s\nB\n= − ∇φ∞ +\n∇ ln n ∧ 2 .\nZe\nB\n\u0012\n\n\u0013\n\n(17)\n(18)\n\nOr, in normalized form:\nM⊥ = Mh − ρs ∇ ln n ∧ B/B ,\n\n(19)\n\nwhere ρs is the ion Larmor radius at the sound speed. The perpendicular drift velocity thus consists of a uniform term Mh , equal to the external drift, plus a term M⊥1\n(= −ρs ∇ ln n ∧ B/B) arising from local gradients of density (and associated potential),\nwhich satisfies M⊥1 .∇n = 0. Our approach is therefore to solve along characteristics defined\nnot by the complicated full drift velocity M⊥ , but using the uniform external drift velocity\nMh which arises from subtracting off M⊥1 , as we have shown we are permitted to do because\nM⊥1 .∇n = 0. But such an approach, of using a uniform impressed perpendicular drift, is\nprecisely the ansatz solved in the previous section, albeit without this detailed justification.\nTherefore, the solution obtained there applies without modification. What is modified is\nthat the condition of translational invariance in the orthogonal (z-) direction is removed. In\nother words, the restriction that the probe be two-dimensional, which was invoked previously\nto justify the neglect of the density-gradient-induced drifts is proven here to be unnecessary.\nThe results of that section, the dependence of n on Mk , the spatial variation of Mk embodied\n8\n\n\fin the equation tan θ = Mh /(Mk + 1), and the surface flux expression, apply to any shape\nof three-dimensional probe, provided only that the condition of convexity (that the surface\nis not reentrant) is satisfied. This convexity condition must be applied along the original\ncharacteristic (before subtracting M⊥∞ ) so it depends on the full 3-D shape of the probe\n(and the z-drifts).\nThe flux-density of ions from the plasma to the probe surface in this case is given by\nthe vector sum of Mh and Mk because the additional term M⊥1 is always locally tangential\nto the surface, even if the surface-normal has a non-zero z-component. Therefore eq (15) is\nvalid.\n\nFigure 2: (Color online). Contours of Mk + 1 = 1 + Mk∞ + ln(n/n∞ ) at intervals of 0.1,\nin planes of constant-x near a sphere of unit radius in a plasma with external drift velocity\nMk∞ = 0.2, Mh = 0.24.\nAs an illustration of this complete solution of the problem, Fig 2 shows a representation\nof the 3-Dimensional variation of Mk and equivalently ln n by contours of the quantity Mk +1\ndrawn in perpendicular planes at various distances from a spherical object. Regions empty\nof contours to lower-y (left) of the contours shown have uniform unperturbed plasma. To\nthe right of the contours is the wake region where the equations are not valid.\nA second illustration is in Fig 3, which shows the contours for a pyramid shaped probe\nsimilar to what is used in Alcator C-Mod experiments[21]. A different drift velocity is\nillustrated.\n\n9\n\n\fFigure 3: (Color online). Contours of Mk + 1 = 1 + Mk∞ + ln(n/n∞ ) at intervals of 0.1, in\nplanes of constant-x near a pyramidal Mach probe in a plasma with external drift velocity\nMk∞ = −0.1, Mh = 0.15.\n\n4.2\n\nInclusion of external ∇n diamagnetic drift\n\nThe presence of a diamagnetic drift arising from external density gradient leads to several\ncomplicating factors. We consider an unperturbed density, n∞ , that in this case is not\nuniform but is a function also of perpendicular position. The usual case has ∇⊥ φ∞ and ∇⊥ n∞\napproximately parallel to each other, because both are perpendicular to the flux surface in\na confined plasma. This is actually essential for the consistency of the unperturbed state,\nif it has no parallel gradients. Then the total drift velocity does not satisfy ∇.(n∞ v∞ ) = 0\nunless B.(∇φ∞ ∧ ∇n∞ ) = 0 so that the drifts arising from the φ and n gradients are parallel\nto each other. We stick to this case here, and consistently take all external gradients to be\nin the z-direction, but note that effects in tokamak scrape-off-layers where parallel gradients\nare present and give rise to cross-flux-surface drifts are thereby ignored. In other words, we\nare dealing with a case of negligible parallel gradients in the external plasma.\nWe suppose that the external logarithmic gradient of the density is constant:\n∇ ln n∞ (z) = ẑ/Ln ,\n\n(20)\n\nwhere Ln is the (constant) density scale length. Equations (16) and (17) still apply. We\nstill can rely upon integration along the negative characteristic to write down a relationship\nbetween n and Mk , but that relationship is now\nln n − Mk = ln(n∞ (z∞ )) − Mk∞ ,\n10\n\n(21)\n\n\fwhere n∞ (z∞ ) is the unperturbed value of density at large distance from the probe, but\nat a value, z∞ , of z corresponding to tracking backward along the negative characteristic\nfrom the point of interest. Because n∞ is a function of z when there are diamagnetic drifts,\nthe value of ln n∞ (z∞ ) depends upon the total z-displacement, δz = z − z∞ between the\ncharacteristic's start and the point of interest. Thus it is no longer the case that n = n(Mk ).\nWrite the relationship between density and Mk , deduced from the negative characteristic\nintegration as\nln(n/n∞ (z)) = −Mk∞ + Mk − δz/Ln .\n(22)\nIn this expression, δz is not a constant. We will demonstrate in the following, however, that\na solution exists in which δz is a function only of Mk . So taking δz = δz(Mk ) we observe\nthat ln(n/n∞ ) is also a function only of Mk . [Here and following we use the notation n∞\nwithout an argument to denote the unperturbed density at the position of the point, n∞ (z)\nnot n∞ (z∞ ).] The drift velocity from eq (17) can be written\n\"\n\n#\n\nTi\nmc2s\nB\nv⊥ = − ∇ φ∞ +\nln n∞ +\n∇ ln(n/n∞ ) ∧ 2 ,\nZe\nZe\nB\n\u0012\n\n\u0013\n\n(23)\n\nin which the first two terms give rise to perpendicular Mach number Mh = ME + Mni , the\nsum of external E ∧ B and ion diamagnetic drifts. The final term, which we identify as M⊥1\nis perpendicular to ∇ ln n/n∞ and, because ln n/n∞ is a function of Mk , perpendicular also\nto ∇Mk .\nNow we write the positive characteristic equation so as to use these expressions:\n0 =\n\nd\ncs dt\n\n+\n\n\u0010\n\n\u0011\n\nln n + Mk =\n\n= Mz /Ln +\n\nd\ncs dt\n\n+\n\nd\ncs dt\n\n\u0010\n\n\u0010\n\n\u0011\n\nln n/n∞ + Mk + Mz /Ln\n\n+\n\n\u0011\n\n2Mk − δz/Ln = Mz /Ln +\n\nd\ncs dt\n\n(2 ln n/n∞ + δz/Ln ) , (24)\n+\n\nwhere we use the notation\nd\ncs dt\n\n±\n\n≡ M.∇ ± ∇k = (Mk ± 1)\n\n∂\n∂\n∂\n+ My\n+ Mz\n∂x\n∂y\n∂z\n\n(25)\n\nfor the derivative along the positive or negative characteristics. Because the arguments\nof the derivatives in the last two forms of eq (24) are explicitly functions only of Mk , we\ncan subtract M⊥1 .∇ from the characteristic derivative without effect. In other words, in\nthose expressions, we can interpret the derivative in the alternative version (valid only when\noperating on functions only of Mk )\nd\ncs dt\n\n±\n\n= (Mk ± 1)\n\n∂\n∂\n+ Mh\n∂x\n∂y\n\n(26)\n\nNow we eliminate y-derivatives of ln n from the last form of the positive characteristic equation using the expression for the z drift velocity:\nMz = ρs\n\n∂ ln n\n∂ ln n/n∞\n= ρs\n∂y\n∂y\n11\n\n(27)\n\n\fto find\n\n∂\n(Mk + 1) ln n/n∞ = −Mz\n∂x\n\nMh\n1\n+\n2Ln\nρs\n\n!\n\n−\n\n1 d\n2 cs dt\n\nδz\n.\nL\n+ n\n\n(28)\n\nIn the same way, we express the negative characteristic equation in terms of ln n/n∞ , reinterpret the derivative as the form (26) and then we eliminate x- and y-derivatives of ln n/n∞\nusing eqs (28) and (27).\nd\nMk =\ncs dt −\n\nd\ncs dt\n\nln n/n∞ + Mz /Ln\n−\n\n\"\n\nMk − 1\nMh\n1\n−Mz\n+\n=\nMk + 1\n2Ln\nρs\n\n!\n\nd\n−\ncs dt\n\n#\n\nδz\nMh Mz Mz\n+\n+\n.\n2Ln\nρs\nLn\n+\n\n(29)\n\nFor compactness we define d/dMk (δz/2Ln ) ≡ r; so that\nd\ncs dt\nEliminate\n\nd\nM\ncs dt + k\n\nd δz\nδz\nd\nd\nMk .\nMk .\n=\n=r\n2Ln\ncs dt +\ndMk 2Ln\ncs dt +\n+\n\n(30)\n\nbetween this expression and the Mk form of eq (24) to obtain\nd\ncs dt\n\nδz\nMz r\n=−\n.\n2Ln\n2Ln 1 − r\n+\n\n(31)\n\nSubstituting into eq (29) and eliminating Mz and the right hand side's\nidentity\n,\n,\nMz\nδz\nd\nd\nd\nMk =\nMk ,\nr=\ncs dt − 2Ln\ncs dt −\n2Ln\ncs dt −\n\nd\nM\ncs dt − k\n\nusing the\n(32)\n\nwe arrive at the following quadratic equation for r\nr\nr\n1=\nMk + 3 +\n(Mk − 1) + 4Ln Mh /ρs .\nMk + 1\n1−r\n\u0014\n\n\u0015\n\n(33)\n\nWe solve this equation, using the simplifying notation\na ≡ 1/(4 + 4Ln Mh /ρs ) ,\nto find\nr = (1/2)[1 + 2u ±\n\n√\n\nu ≡ aMk ,\n\n(34)\n\n1 − 4a + 4u2] .\n\n(35)\n\nThen we can integrate to obtain the z-displacement\nZ\nq\nq\nδz\n1\nu + u2 − u u2 − a + 14 + (a − 14 ) ln u + u2 − a +\n= 2 rdMk =\nLn\na\n\u0012\n\n\u0014\n\n12\n\n1\n4\n\n\u0013\u0015u\n\nu∞\n\n,\n\n(36)\n\n\fThis solution is real only if 14 − a > 0, which is equivalent to ρs /(Ln Mh ) > −1. Since the\nion diamagnetic drift is Mni = −ρs /Ln and Mh is positive by presumption, this requires\nMni > −ME and ME > 0.\nIn Fig 4 are plotted the solutions for δz as a function of Mk for the entire useful range\nof a, i.e. of Mh Ln /ρs = −Mh /Mni . We take that to be constrained by −ME < Mni < ME\n(and ME > 0) which is equivalent to ρs /(Ln Mh ) > −1/2. Whether normalized by Ln or by\nρs /Mh , these results show that the displacement, δz , while non-zero, is modest. Moreover\nthe curves are quite close to being mirror-symmetric about the line Mk = −1.\n\n(a)\n\n(b)\n\nFigure 4: Solutions for the z-displacement normalized to the density scale-length (a) or the\nLarmor radius (b), for the useful range −ME < Mni < ME . It is assumed that Mk∞ is zero,\nbut the curve shapes are the same regardless of the starting value of Mk .\nThe value of δz together with the negative characteristic integration, eq (22) provide the\ncomplete solution for ln(n/n∞ ) which is a function only of Mk . The characteristic equations\ncan be considered to be\nMz\nd\n(ln n/n∞ ± Mk ) = −\n,\n(37)\ncs dt ±\nLn\nin which the characteristic derivatives can be taken as eq (26), that is, lying in a z = const\nplane. The characteristics are now curved, and cannot be constructed directly from the\ngeometry, as was possible in the absence of diamagnetic drift. But this does not matter\nfor the purposes of obtaining the flux to the probe. The boundary condition at the plasma\nedge is, as before, that provided the boundary is convex, the positive characteristic must be\ntangential to the surface; that is, Mk + 1 = Mh cot θ.\nIn practice, the perpendicular velocity is generally deduced from Mach probe measurements effectively by comparing values of the ion current density for faces having equal and\n13\n\n\fObject\n\nObject\n\nθm My\n1 + Mk∞\n\n(a)\n\nθm My\n1 + Mk∞\n\n(b)\n\nFigure 5: (Color online). Schematic illustration of shape of positive characterstics in the x-y\nplane. In (a) Ln is positive corresponding to diamagnetic drift opposing E ∧ B drift, and\nthe displacement δl being down the density gradient. In (b) Ln is negative.\nopposite values of cos θ; that is, having the same angle to the magnetic field, but pointing\nupstream or downstream with respect to the perpendicular flow. Although δz changes the\nvalue of ln n and thus affects the ion flux density, if δz is of exactly even parity in Mk + 1\nand hence in cot θ, it will contribute nothing to the ratio of the ion fluxes on which the\nmeasurement is based. For Ln → ∞ (zero diamagnetic drift) or Mh Ln = 0 (zero net drift)\nδz is indeed exactly of even parity. The maximum value of the odd-parity part of δz/Ln is\napproximately 0.02 for |Mk +1| < 0.6 for |Mni /ME | ≤ 1 (and rapidly decreasing as |Mni /ME |\ndecreases). Thus the contribution of the δz term to Mach probe velocity measurement is\ntypically less than 2%, which is for practical purposes negligible. The magnitude of δz is\nsufficiently great, however, that it would be inadvisable to attempt to deduce the perpendicular flow without taking advantage of its approximate parity. In other words, a Mach-probe\nmeasurement really must be based on electrodes with equal and opposite values of cot θ, and\nnot, for example, on comparing positive cot θ with cot θ = 0.\nIt is, in effect, the δz variation that causes the positive characteristics to have curvature.\nThis curvature has magnitude approximately 1/Ln . When considering whether or not a\nprobe surface is convex, this curvature has to be accounted for. Schematic representations\nof the positive characteristic shapes are illustrated in Fig 5, for an object with two plane\nfaces. When the curvature is towards such a face, it is concave, and the plasma flows into the\nprobe with a negative parallel velocity greater than 1 − My cot θ. This concavity is avoided\nin general if the probe has a convex curvature that is greater than 1/Ln . The characteristics\ncurve either away from or towards the line x = const. depending on whether Ln is positive\nor negative. (My is taken always positive.)\nTo summarize, then, the ion flux per unit perpendicular area from the plasma to a\nconvex surface in the presence of combined (colinear) E∧B and density-gradient diamagnetic\n\n14\n\n\fexternal drifts can be written precisely as eq (15):\nΓk = ncs = n∞ (z∞ )cs exp[−1 − (Mk∞ − Mh cot θ)],\n\n(38)\n\nMh = ME + Mni\n\n(39)\n\nn∞ (z∞ ) = n∞ (z − δz) = n∞ (z) exp(−δz/Ln ).\n\n(40)\n\nbut with\nand\nBecause of its near even parity in Mk + 1, the δz term can generally be ignored for the\npurposes of M⊥ determination.\n\n5\n\nEffects from presheath displacement\n\nThe expressions obtained so far are for the flux leaving the plasma region where the drift\nexpressions hold. Between that region and the probe surface lie the magnetic presheath, of\norder a Larmor radius thick, which we assume is small compared with the probe, and the\nDebye sheath, of order 4 Debye lengths thick, which we shall ignore altogether. The dynamics\nin the magnetic presheath are not ignorable. The flux to the probe itself is different from the\nflux from the plasma into the magnetic presheath when diamagnetic drifts are important.\n\n5.1\n\nMagnetic presheath displacement calculation\n\nIn the magnetic presheath, the electric field normal to the surface is strong enough that\nE⊥ /B is of order the sound speed. The normal gradients of the resulting drift give rise to\nnon-negligible convective derivative (i.e. polarization drift) terms. Indeed, it is those terms\nthat permit the ion fluid trajectory to acquire sufficient cross-field velocity to satisfy the\nBohm condition at the Debye-sheath edge. We assume on the magnetic presheath scale\nthe probe surface can be approximated as planar and the gradients can be considered all\nto be normal to it. Let the direction of the normal (outward from the plasma) to the\nprobe surface be k̂. Define sin α = −k̂.B/B and the unit vector l̂ = B ∧ k̂/B cos α in the\ndirection perpendicular to B and k̂. Define the third unit vector by ĵ = k̂ ∧ l̂. See figure\n6. Denote vector components in the respective directions by subscripts. Then the (normal)\nk̂-component of the momentum equation (2) is\nmv.∇vk = −Ze∇k φ − (1/n)∇k p + Zev.(B ∧ k̂)\n\n(41)\n\nwe eliminate the potential gradient using eq (16), and density gradient using the continuity\nequation (1) in the form nvk = const., so that ∇k ln n = −∇k ln vk , to obtain\nvl Ωi cos α = (−c2s /vk + vk )∇k vk .\n\n(42)\n\nWe wish to calculate the total displacement, δl in the l̂-direction, experienced by the ion\nfluid traversing the magnetic presheath. This is simply the time integral of eq (42):\nδl Ωi cos α =\n\nZ\n\n(−c2s /vk + vk )∇k vk dt =\n15\n\nZ\n\n(1 − c2s /vk2 )dvk = [vk + c2s /vk ] ,\n\n(43)\n\n\fFigure 6: (Color online). Illustration of the coordinates referred to the field and drift directions (x, y, z) and the unit vectors referred to the probe surface directions (ĵ, k̂, l̂).\n(recognizing that vk dvk /dxk = dvk /dt). The limits of the integral are vk /cs = Γk /ncs ≡ S at\nthe magnetic presheath outer edge (where Γk is the normal flux density) and vk /cs = 1 at\nits inner edge, entering the Debye sheath (whose thickness we ignore). Therefore\nδl = ρs [2 − S − 1/S]/ cos α = −ρs\n\n[1 − S]2\n.\nS cos α\n\n(44)\n\nThus, for small incidence angle of the magnetic field (S small) a rather large displacement\n(δl ∼ ρs /S) along the magnetic presheath occurs. This displacement has been noted and\nroughly estimated [18] in previous discussions of magnetic presheath structure. Its significance is that ions exit the magnetic presheath (and are collected by the probe) a tangential\ndistance δl from where they entered it. If there is a tangential gradient ∇l Γk of the normal\nflux-density Γk entering the magnetic presheath at position xl , then the flux-density to the\nprobe will be not Γk (xl ) but Γk (xl − δl ) = Γk (xl ) exp[−δl ∇l ln(Γk )] (choosing consistently\nwith our ln n assumption, uniformity of ∇ ln Γk when surface curvature is ignored). This\nalteration of the flux-density is precisely the phenomenon that Cohen and Ryutov [19] calculated in the small-α limit. In their Eulerian viewpoint, the alteration is attributable to\ndivergence of the tangential flux in the magnetic presheath. From the present Lagrangean\nviewpoint, it arises from the integrated convective derivative. We can demonstrate this by\nevaluation. Identifying ∇ ln Γk = ∇ ln n∞ and using the definitions of S and l̂ we find\nδl ∇l ln Γk = −\n\n[1 − S]2 Ti + ZTe\n[1 − S]2\nρs l̂.∇ ln Γk = −\n(∇ ln n∞ ∧ B).k̂\nS cos α\nS cos2 α cs ZeB 2\n16\n\n\f=\n\n[1 − S]2\n[1 − S]2 k̂y\n(v\n−\nv\n).\nk̂\n=\n(Mni − Mne )\nni\nne\nS cos2 α cs\nS cos2 α\n\n(45)\n\nCohen and Ryutov's calculation assuming small S and α gave this expression with the\ngeometric term [1−S]2 k̂y / cos2 α equal to 1, yielding a δl ∇l Γk equal to the difference between\nthe ion and electron diamagnetic normal flux densities. Now we evaluate the total flux\ndensity to the probe using eq (38), which yields S = sin α, and recognizing that when the\norientation of k̂ perpendicular to B is defined by setting k̂z = sin β, it immediately follows\nthat k̂x = − cos β sin θ, k̂y = cos β cos θ and sin α = cos β sin θ. We obtain\n\u001a\n\nΓk (xl − δl ) = ncs sin α exp −\n\n\u0014\n\n1 − sin α\n(Mni − Mne ) cot θ\n1 + sin α\n\u0015\n\n\u001b\n\n.\n\n(46)\n\nThe ion flux to the probe surface per unit perpendicular area is then\nΓkp\n\n1 − sin α\n(Mni − Mne ) cot θ\n= n∞ cs exp −1 − Mk∞ + Mh cot θ −\n1 + sin α\n\u001a\n\n\u0014\n\n\u0015\n\n\u001b\n\n.\n\n(47)\n\nThe logarithm of ratio of the flux for positive and negative cos θ is\nln(Γ+ /Γ− ) = −\n\n1 − sin α\nδz+ − δz−\n+ 2Mh cot θ − 2\n(Mni − Mne ) cot θ .\nLn\n1 + sin α\n\n(48)\n\nIgnoring the δz term, this becomes\nln(Γ+ /Γ− )\nMni 2 sin α + Mne (1 − sin α)\n= ME +\n.\n2 cot θ\n1 + sin α\n\n(49)\n\nThus, in addition to ME , the velocity combination measured by the Mach probe ratio is\nan interpolation between the ion and electron diamagnetic velocities (which of course have\nopposite sign), dependent upon the angle α between the probe face and the field. Normally\nin practice an intermediate value of θ (not too small but not too close to π/2) must be used,\nwhich generally means an intermediate value of α.\n\n5.2\n\nProbe curvature and finite facet size\n\nThe displacement in the magnetic presheath also gives rise to a flux correction when the\nprobe surface has curvature. The flux at any point on an electrode is characteristic of the\nflux into the magnetic presheath at a position −δl away. If the surface is curved, then\nthe angles at that position will be different, giving rise to a different flux. But also, the\ndisplacement may have a divergence, which gives rise to flux enhancement even if the flux\ninto the magnetic presheath were uniform.\nWe note that the displacement strictly contains a component δj , along the direction\nĵ ≡ k̂ ∧ l̂, which for small α is mostly along B, and is of approximate magnitude ρs / sin α,\nsimilar to δl . This displacement δj can be calculated in the form of a closed integral expression\nby solving the magnetic presheath equations using the techniques of references [22, 4]. We\n17\n\n\fignore it, here and in the previous section, because it is mostly motion along the magnetic\nfield, which can be considered to be accounted for by surface projection along the field,\nand because both the projection and any additional cross-field motion (in the k̂-direction)\nthat makes δj different from the pure field-line projection, make flux contributions that are\nsymmetric: of even parity under reversals of ky and hence of cos θ. In other words, there\nis a small correction to the total flux density from δj , which can be pictured as arising\nfrom the fact that the probe collects ions from a cross-field area that is larger than its solid\ncross-section by a margin of width approximately ρs . But that correction does not affect the\ndeduced Mach-numbers, because they are based on ratios of collection fluxes from surfaces\nwith opposite ky , which are equally perturbed by even-parity terms.\nThe perpendicular flux-density perturbation arising from δl along l̂ has contributions\nδl ∂n/∂xl = δl nMh ∂ cot θ/∂xl and from the convective derivative of the perpendicular area\nelement, which can be written (differentially) ∆A/A = ∇s (δl l̂) = δl ∇s .l̂ + l̂.∇s δl , where ∇s\ndenotes the two-dimensional gradient (∂/∂y, ∂/∂z) in the perpendicular coordinates, but\nevaluated along the probe surface (not at constant x). Thus the total correction arising from\nsurface curvature is\n− ∆Γk /Γk = Mh δl l̂.∇s cot θ + δl ∇s .l̂ + l̂.∇s δl .\n\n(50)\n\nIn this equation the first term has even parity with respect to ky -reversal and therefore does\nnot contribute to flow-measurement bias. The last two have odd parity and do contribute.\nTheir order of magnitude is δl /Rc where Rc is the typical radius of curvature of the surface. (Note that this is a real physical effect, not the elementary mathematical integration\ndiscussed by Pelemann et al[23].)\nA related, but more intuitive and probably more relevant correction comes from edges\nof plane facets. Most Mach probes have electrodes at or near their ends [12, 9, 13, 24] The\ndirection δl l̂ associated with the surfaces points forward, beyond the probe end, on one side\nand backward towards the probe stalk on the other, as illustrated in Fig 7. The surface\nfor which it points backward collects essentially zero flux for a distance ≈ δl from the end,\nbecause of the magnetic presheath displacement; then it collects the full flux from then on.\nThe surface for which δl l̂ points forward collects full flux at its end. The electrode will\ncollect full flux throughout its area, provided that it is embedded in a surface of constant\nangle which extends a distance ≈ δl past the (backward) edge of the electrode. Therefore the\nlikely effect (dependent on the detailed electrode placement) of δl is to induce a depleted flux\nregion on just the forward edge of just the electrode for which δl l̂ is backward. An appropriate\nestimate of the odd-parity part of the resulting flux change is\nρs (1 − S)2 cos β\n(1 − sin α)2\n∆Γk /Γk ≈ δl ˆlz /2h̄ = −\n≈ −ρs\n,\n2h̄S cos α\n2h̄ cos α sin θ\n\n(51)\n\napproximating S as sin α to lowest order in M⊥ , and denoting the average z-extent of the\nelectrode as h̄.\nSince in a perpendicular Mach-probe measurement Mh is estimated from the expression\nMh | cot θ| = (1/2) ln[Γk+ /Γk− ] ,\n18\n\n(52)\n\n\fB\n\nEnd\n\nE\nE\n\nE\n\nz\n\n2\n\n1\nE∧B\n\ny\n\nE∧B\nδl l̂\n\nδl l̂\n\nE\n\nE\n\nθ1\nx\n\nθ2\n\nStalk\n\nFigure 7: (Color online). Illustration of the opposite directions of magnetic presheath displacement (δl l̂) for opposite values of cos θ. The electric field is towards the probe and δl l̂ is\nin the E ∧ B direction. When the displacement is towards the stalk, as it is for facet 1 but\nnot facet 2, a depleted region exists at the probe end. (In this figure \"forward\" is up and\n\"backward\" is down.)\n(where subscript ± refers to the sign of cos θ) the perturbation ∆Mh to the deduced Mh is\nrelated to the odd-parity perturbation to flux, ∆Γk , by\nρs (1 − sin α)2\n∆Mh = | tan θ|∆Γk /Γk ≈ −\n.\n2h̄ cos α cos θ\n\n(53)\n\nThere is therefore an intrinsic bias of order ρs /2h̄ in such a Mach-probe measurement. Its\ndirection is such that if the gradient of plasma pressure is in the forward direction of the\nprobe, in other words the probe is introduced from the \"outside\" of the plasma where pressure\nis low (as is generally the case), then the spurious apparent drift is in the same direction as\nthe ion-diamagnetic drift. This end-effect can in principle be avoided if the electrode does\nnot sample the plasma at the end of the facets, but instead approaches the end no closer\nthan a z-distance of approximately ρs (1 − S)2 cos β/(S cos α).\n\n6\n\nTemperature gradient drifts\n\nDiamagnetic drifts might also arise from temperature gradients, which have so far been\nexcluded. A physically justifiable approach for electron temperature gradients simply regards\n19\n\n\fTe as constant along the field, but having an externally imposed gradient in the z-direction.\nA similar mathematical ansatz will be applied to Ti but with less clear physical justification.\nThe equations of continuity and parallel momentum (6) may once more be rearranged into\ncharacteristic form to obtain\n(v.∇ ± cs ∇)[ln n/n∞ ± vk /cs ] = ±(vk /cs )(−vz /Lc ) − vz /Lp .\n\n(54)\n\nHere there are two inhomogeneous terms on the RHS. The first arises from the variation of\ncs with z because of temperature gradients. Its gradient has been written as dcs /dz = cs /Lc .\nThe second arises because of (a) the gradient of n∞ (compare with eq (37)) and (b) the\ndivergence v⊥ acquires when there are temperature gradients, which can be written ∇.v⊥ =\nvz /LT , where LT ≡ Ti /(dTi /dz) is the scale-length of ion-temperature gradient. Because (a)\nand (b) are of identical form, we combine them as −vz /Lp with 1/Lp ≡ 1/LT + 1/Ln .\nThe inhomogeneous terms on the RHS are the same order as the LHS terms near the\nboundary of the unperturbed region. They cannot therefore simply be ignored because\nof ordering. Their effects are to change the value of ln n/n∞ − vk /cs along the negative\ncharacteristic, which is what determines the flux at the boundary. This change can be\ncalculated, and proves to be usually ignorable, as we now show. We assume that the value\nof this negative characteristic quantity can be expressed as a function only of Mk :\nln n/n∞ − Mk = g(Mk )\n\n(55)\n\nand solve for g using the same approach as we used for density gradients. In outline, the\ncalculation is as follows.\nThe positive characteristic equation gives\n− vz\n\nMk\n1\n+\nLc\nLp\n\n!\n\n=\n\nd\nd\n(2Mk + g) =\n(2 ln n/n∞ − g)\ndt +\ndt +\n\nd\ng\ndt ±\n\nWe define dg/dMk = 2q so that\ncharacteristics to obtain\n\n−Mk\nd\n1\ng = −vz\n+\ndt −\nLc\nLp\n\n(56)\n\n= 2q dtd Mk and eliminate Mk derivatives from the\n±\n\n!\n\n,\n\nd\ng = −vz\ndt +\n\nMk\n1\n+\nLc\nLp\n\n!\n\nq\n.\n1+q\n\n(57)\n\nWe eliminate partial x-derivatives between the positive and negative characteristics:\n− (Mk − 1)\n\nd\n∂\nd\ng + (Mk + 1)\ng = 2cs Mh g .\ndt +\ndt −\n∂y\n\n(58)\n\nWe re-express y-derivatives using the z-velocity expression (27), which yields\nMz = ρs (1 + 1/2q)∂g/∂y.\n\n(59)\n\nSubstituting (57) and (59) into (58) and dividing the resultant through by vz we arrive at\nMk\n1\n− (Mk − 1)\n+\nLc\nLp\n\n!\n\n−Mk\nq\n1\n+ (Mk + 1)\n+\n1+q\nLc\nLp\n20\n\n!\n\n=\n\n−2Mh\n.\nρs (1 + 1/2q)\n\n(60)\n\n\fThis quadratic equation for q can be solved to obtain\nq\n\n2(Mk2 − s − w) + (1 − s)Mk ± [(1 − s)2 − 4]Mk2 + 2(s + 2)w\n1 dg\n=q=\n2 dMk\n−4(Mk2 − s − w)\n\n(61)\n\nwhere w ≡ Mh Lc /ρs and s ≡ Lc /Lp .\nProvided Mk∞ , w, and s are indeed constant, this is a consistent solution. In view of\nthe variation of cs and hence ρs with z, it is clear that the constancy of u requires cs (z) to\nsatisfy a simple differential equation, whose solution gives the required cs (z). This is not as\nsimple a profile as the linear ln n∞ profile for the density-gradient. But we are interested in\na local region on the gradient, where it is acceptable to choose the precise form of cs (z) to\nsatisfy the consistency condition without substantially changing the problem, in-so-far as a\nlocal expansion of cs is allowable.\nThe limit of eq (61), when s and w → ∞ together, is minus eq (35) although with different\nnotation. Equation (61), can also be integrated analytically, but the resulting expression is\nlong and cumbersome, so it is not given here. Instead, numerical integrations are illustrated\nin Fig 8. We choose to illustrate s = 0, which corresponds to a case where only the electron\ntemperature has an external gradient. The case Mk∞ = 0.2 is shown, to emphasize the\n\nFigure 8: Solutions for the quantity g + Mk∞ = ln n/n∞ − Mk + Mk∞ accounting solely for\nperpendicular gradients of sound-speed (s = 0).\napplicability of the solution shapes to all Mk∞ . The solution becomes imaginary for some\n21\n\n\frelevant negative values of Mk when 0 < w <\n∼ 7, illustrated by the w = 1, 3 curves. Provided\nsuch parameters are avoided, it can be seen that the values and especially the odd parity (in\nMk + 1) part of g + Mk∞ are small.\nA second modification of the governing equations, arising from temperature gradients, is\nthat additional terms are present in the drift velocity eq (3). Ion temperature gradients are\neasy to treat because they can be expressed as a uniform term like ∇φ∞ , but Te gradients\nintroduce a new type of term (c.f. 23). The total drift velocity is:\n\"\n\n#\n\nTe\nTi\nTi\nmc2s\nB\nv⊥ = − ln(n/n∞ )∇\n+ ∇ φ∞ +\n+\n∇ ln n∞ +\n∇ ln n/n∞ ∧ 2 . (62)\ne\nZe\nZe\nZe\nB\n\u0012\n\n\u0013\n\n\u0012\n\n\u0013\n\nWe can still discard the final (∇ ln n/n∞ ) term as an M⊥1 giving no advection because\nM⊥1 .∇ ln n/n∞ = 0. The rest should be regarded as vh , having no z-component. The first\nterm is the new one, so far not treated. It is non-uniform; but a function of ln n/n∞ and\nhence, within the solution schemes we have developed, a function of Mk . The vh variation\ncan be incorporated into the scheme above, except that the consistency condition upon the\ncs profile becomes that w (= Mh Lc /ρs ), which varies with vh , must be a function only of Mk .\nAssuming an appropriate cs shape is chosen, eq (61) still applies, and could still be integrated\nprovided that w(Mk ) were known. Plainly, provided that w stays within acceptable ranges\nduring the integration, curves that bear resemblance to those of Fig (8) will be obtained.\nGenerally then, the arguments that g + Mk∞ can usually be ignored will remain as valid as\nbefore, provided w stays within the range of their validity.\nThe boundary condition at the plasma edge is still that the positive characteristic be\ntangent to the probe surface, that is (eq 14) Mk = Mh cot θ − 1, but with the following\ndefinition:\nTe\nTi\nTi\nB\n+∇\n+ φ∞ +\n∇ ln n∞ ∧ 2\ne\nZe\nZe\nB cs\n= − ln(n/n∞ )MT e + MT i + ME + Mni ,\n\u0014\n\nMh = − ln(n/n∞ )∇\n\n\u0012\n\n\u0013\n\n\u0012\n\n\u0013\n\n\u0015\n\n(63)\n(64)\n\nwhere MT e and MT i are the (external) diamagnetic drift due to temperature gradient of the\nelectrons and ions. We can then substitute into eq (55) to eliminate Mk and obtain after\nrearrangement:\n−1 + g + (MT i + ME + Mni ) cot θ\n,\n(65)\nln n/n∞ =\n1 + MT e cot θ\nin which, for the purposes of perpendicular velocity measurement, we can take g ≈ −Mk∞ .\nTo first order in the perpendicular velocities this can be written\nln n/n∞ ≈ −1 − Mk∞ + [(1 + Mk∞ )MT e + MT i + ME + Mni ] cot θ ,\n\n(66)\n\nshowing that the effect of the electron temperature-gradient drift can be amplified or attenuated, compared with the other drifts, depending upon the parallel external velocity Mk∞ .\nFinally we must account for the temperature gradients in the correction arising from\nmagnetic presheath displacement. We can ignore the next order corrections to δl arising\n22\n\n\ffrom approximations in its derivation. But we must account for the fact that since δl ∝ cs ,\na transverse derivative of cs gives rise to transverse divergence which alters the flux density\nas it traverses the magnetic presheath. The change in area A arising from this effect is\n∆A/A = δl l̂.∇ ln cs . This gives rise to a change in ln Γ of −δl l̂.∇ ln cs . In addition, the\ndisplacement gives rise to a convective difference between the flux to the probe and that\nentering the presheath that, since Γ ∝ ncs can be expressed as\n∆ ln(ncs ) = −δl l̂.(∇ ln n + ∇ ln cs )\n\n(67)\n\nadding these two effects gives the total magnetic presheath difference:\n∆ ln Γk = −δl l̂.(∇ ln n + 2∇ ln cs ) = −δl l̂.(∇ ln n + ∇ ln(ZTe + Ti ))\n\n(68)\n\nApplying the transformations of eq (45), we see that our result is the same as before except\nthat the total diamagnetic difference velocity MD ≡ MDi −MDe = (Mni +MT i )−(Mne +MT e )\nis involved rather than just the density-gradient part calculated before.\nThe final expression for flux per unit perpendicular area to the probe is thus\n(\n\n)\n\nΓkp\n−1 + g + (MT i + ME + Mni ) cot θ\n1 − sin α\n(MDi − MDe ) cot θ ,\n= exp\n−\nncs\n1 + MT e cot θ\n1 + sin α\n\u0014\n\n\u0015\n\n(69)\n\nor, to first order in perpendicular velocities, and approximating g,\n(\n\nΓkp\nln\nncs\n\n)\n\n\u0014\n\n= −1 − Mk∞ + (1 + Mk∞ )MT e + MDi + ME −\n\n\u0012\n\n1 − sin α\nMD cot θ,\n1 + sin α\n\u0013\n\n\u0015\n\n(70)\n\nwhere α is the angle between the probe surface and the magnetic field (in 3-dimensions),\nand θ is the angle within the plane containing field and external drift. All drift velocities\nhere refer to the external, unperturbed plasma.\n\n7\n\nDiscussion\n\nThe complete solution of the drift equations that has been obtained here is highly appropriate\nwhen the E ∧ B drift dominates. Then the positive characteristics are straight and the full\nsolution in the plasma region can readily be constructed. Notice that the parallel length of\nthe presheath (i.e. the perturbed plasma region) is approximately the transverse size of the\nprobe rp (say) times (Mk + 1)/M⊥ . If the perpendicular Mach number is not very small,\nthis length ∼ rp /M⊥ is likely substantially shorter than that from the standard diffusive\nestimate: rp2 cs /D. Certainly it can easily be shorter than the mean-free-path for electron-ion\nCoulomb collisions, which is required for the ignoring of friction inherent in our treatment. In\nsuch a situation taking the electron temperature to be invariant along the field is completely\nnatural. It is not so natural to make that approximation for the ions. However, it is\nknown from other calculations [25, 9] that the isothermal approximation gives results quite\nclose to those that arise from more physically plausible approximations. In any case, the\n23\n\n\fstandard widely-accepted formulas are based upon isothermal-ion calculations. In addition to\nproviding rigorous analytical justification, regardless of probe geometry, for formulas that are\npractically the same as those arising from a diffusive treatment, the present treatment helps\nto resolve another conceptual problem of long standing. It is that probes are often smaller\nthan the typical transverse size of the turbulence that is responsible for transport in the\nregions of plasma in which they are used. In other words, transport, for example in tokamak\nedges and scrape-off-layers, is actually known to be dominated by fluctuating cross-field\nflows that in many situations have eddies larger than the probes. In such situations, using a\nheuristic approximation that cross-field flux is expressible through a diffusion coefficient, as\nprior treatments have done, is questionable. The present treatment, regarded as a short-time\nsnap-shot of a situation that is fluctuating, is more appropriate. Fortunately the result is\nthe same, although with much sharper physical justification.\nThe drift-approximation is unproblematic for E ∧ B drifts, because there is nothing to\nprevent the probe being bigger than the Larmor radius while the drift Mach number is of\norder unity. This is not so for diamagnetic drifts. The diamagnetic Mach number is of\norder MD ∼ ρs /L (where L is the pressure scale-length). Consequently if MD ∼ 1, there\nis no separation of scales between the Larmor radius and the gradient scale-length. It is\nthen impossible to choose a probe size that is both bigger than the Larmor radius (in order\nto justify the drift approximation) and smaller than the gradient scale-length (to justify a\nlocal approximation of the drifts). This is an inherent difficulty that underlies the need\nin the calculations to choose a specific shape of the plasma profiles. Only if MD is small\ndoes a local approximation to the flow make sense. Therefore, the usefulness of the present\ncalculation is increasingly compromised as MD approaches unity. A calculation that avoids\nthe drift-approximation is then really needed. It seems unlikely that an analytic solution\nlike the present one will be forthcoming.\nIn summary, complete solutions of the problem of ion collection by an arbitrary-shaped\nobject have been obtained in the drift approximation (ignoring the polarization drift). The\nnormalized flux density (69), (70) is a function only of the orientation of the surface, provided\nthe object is convex. The precise meaning of \"convex\" here is that no positive characteristic\nthat originates elsewhere on the object should pass through the point of interest. A transverse\nMach probe using a variety of electrode orientations measures the E ∧ B drift plus this\nspecified combination of both ion and electron diamagnetic drifts. Its ideal calibration has\nbeen derived, and possible problems arising from finite size identified and quantified.\n\nReferences\n[1] I. H. Hutchinson, Principles of Plasma Diagnostics (Cambridge University Press, Cambridge, 2002), 2nd ed., chapter 3.\n[2] P. K. Shukla and A. A. Mamun, Introduction to Dusty Plasma Physics (IOP Publishing,\nBristol, 2002).\n\n24\n\n\f[3] D. Hastings and H. Garret, Spacecraft-Environment Interactions (Cambridge University\nPress, 2004).\n[4] K.-U. Riemann, Phys. Plasmas 1, 552 (1994).\n[5] T. Daube and K.-U. Riemann, Phys. Plasmas 6, 2409 (1999).\n[6] S. Devaux and G. Manfredi, Phys. Plasmas 13, 083504 (2006).\n[7] I. H. Hutchinson, Phys. Fluids 30, 3777 (1987).\n[8] I. H. Hutchinson, Phys. Rev. A 37, 4358 (1988).\n[9] J. P. Gunn, C. Boucher, P. Devynck, I. Duran, K. Dyabilin, J. Horacek, M. Hron,\nJ. Stockel, G. Van Oost, H. Van Goubergen, et al., Phys. Plasmas 8, 1995 (2001).\n[10] H. Van Goubergen, R. R. Weynants, S. Jachmich, M. Van Schoor, G. Van Oost, and\nE. Desoppere, Plasma Phys. Control. Fusion 41, L17 (1999).\n[11] I. H. Hutchinson, Phys. Plasmas 3, 6 (1996).\n[12] C. MacLatchy, C. Boucher, D. Poirier, and J. Gunn, Rev. Sci. Instrum. 63, 3923 (1992).\n[13] S. Gangadhara and B. LaBombard, Plasma Physics and Controlled Fusion 46, 1617\n(2004).\n[14] P. Peleman, S. Jachmich, Y. Xu, C. Boucher, G. Van Oost, B. Schweer, and M. Mitri,\nRev. Sci. Instrum. 77, 10E710 (2006).\n[15] J. Gunn, Czech. J. Phys. 48, S2, 293 (1998).\n[16] I. H. Hutchinson, Phys. Rev. Lett. 101, 03500 (2008).\n[17] I. H. Hutchinson, Phys. Fluids 31, 2728 (1988).\n[18] A. V. Chankin and P. C. Stangeby, Plasma Phys. Control. Fusion 36, 1485 (1994).\n[19] R. H. Cohen and D. D. Ryutov, Phys. Plasmas 2, 2011 (1995).\n[20] R. Courant and D. Hilbert, Methods of Mathematical Physics, vol. II (Wiley, Interscience, 1962), chap V.\n[21] N. Smick and B. LaBombard, Bull. Amer. Phys. Soc. 51, 243 (2006), [Division of Plasma\nPhysics, paper QP1-66].\n[22] R. Chodura, Phys. Fluids 25, 1628 (1982).\n[23] P. Peleman, S. Jachmich, M. Van Schoor, G. Van Oost, W. Knaepen, and C. Boucher,\nContrib. Plasma Phys. p. 422 426 (2006).\n25\n\n\f[24] T. Shikama, S. Kado, A. Okamoto, S. Kajita, and S. Tanaka, Phys. Plasmas 12, 044504\n(2005).\n[25] K.-S. Chung and I. H. Hutchinson, Phys. Rev. A 38, 4721 (1988).\n\n26\n\n\f"}