{"id": "http://arxiv.org/abs/1110.3747v2", "guidislink": true, "updated": "2012-03-19T15:14:46Z", "updated_parsed": [2012, 3, 19, 15, 14, 46, 0, 79, 0], "published": "2011-10-17T18:05:15Z", "published_parsed": [2011, 10, 17, 18, 5, 15, 0, 290, 0], "title": "Feynman diagrams versus Fermi-gas Feynman emulator", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1110.1462%2C1110.5232%2C1110.0879%2C1110.0099%2C1110.0141%2C1110.3747%2C1110.3305%2C1110.4220%2C1110.2806%2C1110.2492%2C1110.6565%2C1110.2159%2C1110.3006%2C1110.5599%2C1110.2527%2C1110.1082%2C1110.2156%2C1110.0584%2C1110.1150%2C1110.3279%2C1110.2232%2C1110.2038%2C1110.5793%2C1110.4919%2C1110.2848%2C1110.6543%2C1110.3354%2C1110.0333%2C1110.4190%2C1110.3317%2C1110.0809%2C1110.1280%2C1110.3856%2C1110.2646%2C1110.4675%2C1110.2664%2C1110.5284%2C1110.5984%2C1110.0672%2C1110.5498%2C1110.3534%2C1110.6482%2C1110.0312%2C1110.4591%2C1110.0942%2C1110.2063%2C1110.4089%2C1110.1161%2C1110.3700%2C1110.4769%2C1110.0414%2C1110.3087%2C1110.3684%2C1110.2043%2C1110.4861%2C1110.5813%2C1110.5397%2C1110.0745%2C1110.4978%2C1110.1855%2C1110.5349%2C1110.3886%2C1110.0914%2C1110.2426%2C1110.5512%2C1110.2892%2C1110.4004%2C1110.6926%2C1110.4867%2C1110.6539%2C1110.1601%2C1110.1067%2C1110.0875%2C1110.4443%2C1110.2150%2C1110.6651%2C1110.4383%2C1110.6326%2C1110.5867%2C1110.1439%2C1110.6767%2C1110.0686%2C1110.5073%2C1110.0394%2C1110.0946%2C1110.1591%2C1110.1923%2C1110.2814%2C1110.0411%2C1110.0426%2C1110.3242%2C1110.6458%2C1110.2387%2C1110.1542%2C1110.0388%2C1110.3032%2C1110.4927%2C1110.4690%2C1110.2142%2C1110.5615%2C1110.3901&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Feynman diagrams versus Fermi-gas Feynman emulator"}, "summary": "Precise understanding of strongly interacting fermions, from electrons in\nmodern materials to nuclear matter, presents a major goal in modern physics.\nHowever, the theoretical description of interacting Fermi systems is usually\nplagued by the intricate quantum statistics at play. Here we present a\ncross-validation between a new theoretical approach, Bold Diagrammatic Monte\nCarlo (BDMC), and precision experiments on ultra-cold atoms. Specifically, we\ncompute and measure with unprecedented accuracy the normal-state equation of\nstate of the unitary gas, a prototypical example of a strongly correlated\nfermionic system. Excellent agreement demonstrates that a series of Feynman\ndiagrams can be controllably resummed in a non-perturbative regime using BDMC.\nThis opens the door to the solution of some of the most challenging problems\nacross many areas of physics.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1110.1462%2C1110.5232%2C1110.0879%2C1110.0099%2C1110.0141%2C1110.3747%2C1110.3305%2C1110.4220%2C1110.2806%2C1110.2492%2C1110.6565%2C1110.2159%2C1110.3006%2C1110.5599%2C1110.2527%2C1110.1082%2C1110.2156%2C1110.0584%2C1110.1150%2C1110.3279%2C1110.2232%2C1110.2038%2C1110.5793%2C1110.4919%2C1110.2848%2C1110.6543%2C1110.3354%2C1110.0333%2C1110.4190%2C1110.3317%2C1110.0809%2C1110.1280%2C1110.3856%2C1110.2646%2C1110.4675%2C1110.2664%2C1110.5284%2C1110.5984%2C1110.0672%2C1110.5498%2C1110.3534%2C1110.6482%2C1110.0312%2C1110.4591%2C1110.0942%2C1110.2063%2C1110.4089%2C1110.1161%2C1110.3700%2C1110.4769%2C1110.0414%2C1110.3087%2C1110.3684%2C1110.2043%2C1110.4861%2C1110.5813%2C1110.5397%2C1110.0745%2C1110.4978%2C1110.1855%2C1110.5349%2C1110.3886%2C1110.0914%2C1110.2426%2C1110.5512%2C1110.2892%2C1110.4004%2C1110.6926%2C1110.4867%2C1110.6539%2C1110.1601%2C1110.1067%2C1110.0875%2C1110.4443%2C1110.2150%2C1110.6651%2C1110.4383%2C1110.6326%2C1110.5867%2C1110.1439%2C1110.6767%2C1110.0686%2C1110.5073%2C1110.0394%2C1110.0946%2C1110.1591%2C1110.1923%2C1110.2814%2C1110.0411%2C1110.0426%2C1110.3242%2C1110.6458%2C1110.2387%2C1110.1542%2C1110.0388%2C1110.3032%2C1110.4927%2C1110.4690%2C1110.2142%2C1110.5615%2C1110.3901&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Precise understanding of strongly interacting fermions, from electrons in\nmodern materials to nuclear matter, presents a major goal in modern physics.\nHowever, the theoretical description of interacting Fermi systems is usually\nplagued by the intricate quantum statistics at play. Here we present a\ncross-validation between a new theoretical approach, Bold Diagrammatic Monte\nCarlo (BDMC), and precision experiments on ultra-cold atoms. Specifically, we\ncompute and measure with unprecedented accuracy the normal-state equation of\nstate of the unitary gas, a prototypical example of a strongly correlated\nfermionic system. Excellent agreement demonstrates that a series of Feynman\ndiagrams can be controllably resummed in a non-perturbative regime using BDMC.\nThis opens the door to the solution of some of the most challenging problems\nacross many areas of physics."}, "authors": ["K. Van Houcke", "F. Werner", "E. Kozik", "N. Prokofev", "B. Svistunov", "M. J. H. Ku", "A. T. Sommer", "L. W. Cheuk", "A. Schirotzek", "M. W. Zwierlein"], "author_detail": {"name": "M. W. Zwierlein"}, "author": "M. W. Zwierlein", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1038/NPHYS2273", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1110.3747v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1110.3747v2", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "cond-mat.quant-gas", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cond-mat.quant-gas", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "cond-mat.str-el", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "nucl-th", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "physics.atom-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "physics.comp-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1110.3747v2", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1110.3747v2", "arxiv_comment": null, "journal_reference": "Nature Phys. 8, 366 (2012)", "doi": "10.1038/NPHYS2273", "fulltext": "Feynman diagrams versus Fermi-gas Feynman emulator\nK. Van Houcke,1, 2 F. Werner,1, 3 E. Kozik,4, 5 N. Prokof'ev,1, 6 B. Svistunov,1, 6\nM. J. H. Ku,7 A. T. Sommer,7 L. W. Cheuk,7 A. Schirotzek,8 and M. W. Zwierlein7\n1\nDepartment of Physics, University of Massachusetts, Amherst, MA 01003, USA\nDepartment of Physics and Astronomy, Ghent University, Proeftuinstraat 86, B-9000 Ghent, Belgium\n3\nLaboratoire Kastler Brossel, Ecole Normale Supérieure,\nUPMC-Paris 6, CNRS, 24 rue Lhomond, 75005 Paris, France\n4\nTheoretische Physik, ETH Zürich, CH-8093 Zürich\n5\nCentre de Physique Théorique, Ecole Polytechnique, 91128 Palaiseau Cedex, France\n6\nRussian Research Center \"Kurchatov Institute\", 123182 Moscow, Russia\n7\nDepartment of Physics, MIT-Harvard Center for Ultracold Atoms, and Research Laboratory of Electronics,\nMIT, Cambridge, Massachusetts 02139, USA\n8\nAdvanced Light Source, Lawrence Berkeley National Laboratory, Berkeley, California 94720, USA\n\narXiv:1110.3747v2 [cond-mat.quant-gas] 19 Mar 2012\n\n2\n\nPrecise understanding of strongly interacting fermions, from electrons in modern materials to\nnuclear matter, presents a major goal in modern physics. However, the theoretical description of\ninteracting Fermi systems is usually plagued by the intricate quantum statistics at play. Here we\npresent a cross-validation between a new theoretical approach, Bold Diagrammatic Monte Carlo\n(BDMC), and precision experiments on ultra-cold atoms. Specifically, we compute and measure\nwith unprecedented accuracy the normal-state equation of state of the unitary gas, a prototypical\nexample of a strongly correlated fermionic system. Excellent agreement demonstrates that a series\nof Feynman diagrams can be controllably resummed in a non-perturbative regime using BDMC.\nThis opens the door to the solution of some of the most challenging problems across many areas of\nphysics.\n\nIn his seminal 1981 lecture [1], Feynman argued that\nan arbitrary quantum system cannot be efficiently simulated with a classical universal computer, because generally, quantum statistics can only be imitated with a classical theory if probabilities are replaced with negative (or\ncomplex) weighting factors. For the majority of manyparticle models this indeed leads to the so-called sign\nproblem which has remained an insurmountable obstacle. According to Feynman, the only way out is to employ\ncomputers made out of quantum-mechanical elements [1].\nThe recent experimental breakthroughs in cooling, probing and controlling strongly interacting quantum gases\nprompted a challenging effort to use this new form of\nquantum matter to realize Feynman's emulators of fundamental microscopic models [1, 2]. Somewhat ironically,\nFeynman's arguments which led him to the idea of emulators may be defied by a theoretical method that he\nhimself devised, namely Feynman diagrams. This technique organizes the calculation of a given physical quantity as a series of diagrams representing all possible ways\nparticles can propagate and interact (see, e.g., Ref. [3]).\nFor the many-body problem, this diagrammatic expansion is commonly used either in perturbative regimes or\nwithin uncontrolled approximations. However, the introduction of Diagrammatic Monte Carlo recently allowed to go well beyond the first few diagrams, and even\nreach convergence of the series in a moderately correlated\nregime [4, 5].\nIn this Letter we show that for a strongly correlated\nsystem and down to a phase transition, the diagrammatic\nseries can still be given a mathematical meaning and\nleads to controllable results within Bold Diagrammatic\n\nMonte Carlo. This approach, proposed in Refs. [4, 6, 7],\nis first implemented here for the many-body problem.\nWe focus on the unitary gas, i.e. spin-1/2 fermions with\nzero-range interactions at infinite scattering length [8–\n10]. This system offers the unique possibility to stringently test our theory against a quantum emulator realized here with trapped ultracold 6 Li atoms at a broad\nFeshbach resonance [8–10]. This experimental validation\nis indispensable for our theory based on resummation of a\npossibly divergent series: although the physical answer is\nshown to be independent from the applied resummation\ntechnique – suggesting that the procedure is adequate\n– its mathematical validity remains to be proven. In\nessence, Nature provides the 'proof'. This presents the\nfirst – though long-anticipated – compelling example of\nhow ultra-cold atoms can guide new microscopic theories\nfor strongly interacting quantum matter.\nAt unitarity, the disappearance of an interactionimposed length scale leads to scale invariance. This property renders the model relevant for other physical systems\nsuch as neutron matter. It also makes the balanced (i.e.,\nspin-unpolarised) unitary gas ideally suited for the experimental high-precision determination of the equation\nof state (EOS) described below. Finally, it implies the\nabsence of a small parameter, making the problem notoriously difficult to solve.\nIn traditional Monte Carlo approaches, which simulate\na finite piece of matter, the sign problem causes an exponential increase of the computing time with system size\nand inverse temperature. In contrast, BDMC simulates a\nmathematical answer in the thermodynamic limit. This\nradically changes the role of the fermionic sign. Dia-\n\n\f2\n\nG\n\n=\n\nΓ\n\nG0\nΓ0\n\n=\n\n+\n+\n\nG0\nΓ0\n\nΣ\nΠ\n\nG\nΓ\n\nG\nΣ\n\nΠ\n\n=\n\nΓ\nG\n\n=\n\n+\n\n+...\nG0\n\n‐\nG\n\n+\n\n+...\n\nG0\n\nFIG. 1. Bold Diagrammatic Monte Carlo evaluates skeleton diagrammatic series for the self-energy Σ and the pair\nself-energy Π (lower box). The diagrams are built on dressed\none-body propagators G and pair propagators Γ, which themselves are the solution of the Dyson and Bethe-Salpeter equations (upper box). This cycle is repeated until convergence is\nreached. G0 is the non-interacting propagator, and Γ0 is the\npartially dressed pair propagator obtained by summing the\nbare ladder diagrams.\n\ngrammatic contributions are sign-alternating with order,\ntopology and values of internal variables. Since the number of graphs grows factorially with diagram order, a\nnear cancellation between these contributions is actually\nnecessary for the series to be resummable by techniques\nrequiring a finite radius of convergence. We find that this\n'sign blessing' indeed takes place.\nIn essence, BDMC solves the full quantum many-body\nproblem by stochastically summing all the skeleton diagrams for irreducible single-particle self-energy Σ and\npair self-energy Π, expressed in terms of bold (i.e., fully\ndressed) single-particle and pair propagators G and Γ\nwhich are determined self-consistently (see Fig. 1). The\ndensity EOS (i.e., the relation between total density n,\nchemical potential μ and temperature T ) is given by G\nat zero distance and imaginary time, n(μ, T ) = 2 G(r =\n0, τ = 0− ). The thermodynamic limit can be taken analytically. The sum of ladder diagrams built on the bare\nsingle-particle propagator defines a partially dressed pair\npropagator Γ0 . Since Γ0 is well defined for the zerorange continuous-space interaction, the zero-range limit\ncan also be taken analytically. This is in sharp contrast\nwith other numerical methods [11–13] where taking the\nthermodynamic and zero-range limits is computationally\nvery expensive. BDMC performs a random walk in the\nspace of irreducible diagrams using local updates. The\nsimulation is run in a self-consistent cycle (along the lines\nof Ref. [6]) until convergence is reached. Full details will\nbe presented elsewhere. In essence, our approach upgrades the standard many-body theories based on one\n\nlowest-order diagram (see, e.g., Refs. [14, 15]) to millions\nof graphs.\nIn the quantum degenerate regime, we do not observe\nconvergence of the diagrammatic series for Σ and Π evaluated up to order 9. Here, order N means Σ-diagrams\nwith N vertices (i.e., N Γ-lines) and Π-diagrams with\nN − 1 vertices. To extract the infinite-order result, we\napply the following Abelian resummation methods [16].\nThe contribution of all diagrams of order N is multiplied by e−\u000fλN −1 where λn depends on the resummation\nmethod: (i) λn = n log n (with λ0 = 0) for Lindelöf [16],\n(ii) λn = (n−1) log(n−1) (with λ0 = λ1 = 0) for \"shifted\nLindelöf\", or (iii) λn = n2 for Gaussian [17]. A full simulation is performed for each \u000f, and the final result is\nobtained by extrapolating to \u000f = 0, see Fig. 2.\nThis protocol relies on the following crucial mathematical assumptions: (i) the N -th order contribution of the\ndiagrammatic expansion for Σ (for fixed external variables) is the N -th coefficient of the Taylor series at z = 0\nof a function g(z) which has a non-zero convergence radius, (ii) the analytic continuation g(1), performed by\nthe above resummation methods [16, 17], is the physically correct value of Σ. The same assumptions should\nhold for Π.\nProving these assumptions is an open mathematical\nchallenge. Note that Dyson's collapse argument [18]\nis not applicable to immediately disprove the assumption (i) of a non-zero convergence radius: Indeed, unlike\nQED, our skeleton series is not an expansion in powers\nof a coupling constant whose sign change would lead to\nan instability. A first important evidence for the validity\nof our mathematical assumptions is that the three different resummation methods yield consistent results. For\nan independent test, we turn to experiments.\nThe present experiment furnishes high-precision data\nfor the density n as a function of the local value V of the\ntrapping potential (see Fig. 3 and Methods). We start\nthe process by obtaining the EOS at high temperatures\nin the non-degenerate wings of the atom cloud where the\nvirial expansion is applicable. Once the temperature and\nthe chemical potential have been determined from fits\nto the wings of the cloud, the data closer to the cloud\ncenter provides a new prediction of the EOS. The process\nis iterated to access lower temperatures.\nScale invariance allows to write\nthe density EOS as\np\nn(μ, T )λ3 = f (βμ), with λ = 2π~2 /(mkB T ) the thermal de Broglie wavelength, β = 1/(kB T ) the inverse temperature and f a universal function. A convenient normalization of the data is provided by the EOS of a noninteracting Fermi gas, n0 λ3 = f0 (βμ). In Fig. 4a we thus\nreport the ratio n(μ, T )/n0 (μ, T ) = f (βμ)/f0 (βμ), bringing out the difference between the ideal and the strongly\ninteracting Fermi gas. The Gibbs-Duhem relation allows\nus to also calculate Rthe pressure at a given chemical poμ0\ntential, P (μ0 , T ) = −∞\ndμ n(μ, T ) = βλ1 3 F (βμ0 ), where\n\n\f3\n8.5\n\n1.5\n1.0\n\nn (10\n\n200\nz (μm)\n\n7.5\n\n3\n\nnλ (βμ=1)\n\n8.0\n\n-3\n\n300\n\ncm )\n\nb)\n\n11\n\nc) 2.0\na)\n\n0.0\n0.0\n\n100\n\n7.0\n\n0.5\n\nd) 2.0\n\n0.2\n\n0.4 0.6\nV (μK)\n\n0.8\n\n1.0\n\n0.0\n\n0.5\n\n1.5\n\n0.2\n\n0.4\n\n0.6\n\n0.8\nε\n\n1.0\n\n1.2\n\n1.4\n\nFIG. 2. Cross-validation between resummation procedure and experiment at βμ = +1. Bold Diagrammatic\nMonte Carlo data for the dimensionless density nλ3 , as a\nfunction of the parameter \u000f controlling the resummation procedure, for three different resummation methods: Lindelöf\n(blue circles), shifted Lindelöf (black diamonds), and Gauss\n(open green squares). The solid lines are linear fits to the\nMonte Carlo data, their \u000f → 0 extrapolation agrees within error bars with the experimental data point (filled red square).\n[In the opposite limit \u000f → ∞, the Lindelöf (resp. shifted Lindelöf) curves will asymptote to the first [15, 19] (resp. third)\norder results, shown by the dashed (resp. dash-dotted) line.]\nError bars for each \u000f represent the statistical error, together\nwith the estimated systematic error coming from not sampling\ndiagrams of order > 9.\n\nRx\nF (x) = −∞ dx0 f (x0 ). We normalize it by the pressure of\nthe ideal Fermi gas and show F (βμ)/F0 (βμ), see Fig. 4b.\nThe agreement between BDMC and experiment is excellent. The comparison is sufficiently sensitive to validate the procedure of resumming and extrapolating (see\nFig. 2). The result was checked to be independent of the\nmaximal sampled diagram order Nmax ∈ {7; 8; 9} within\nthe error bars displayed in Fig. 2 for each \u000f. The BDMC\nfinal error bar in Fig. 4 is the sum of the conservatively\nestimated systematic errors from the uncertainty of the\n\u000f → 0 extrapolation and from the dependence on numerical grids and cutoffs, the latter being reduced by analytically treating high-momentum short-time singular parts.\nThe systematic error in the experiment is determined to\nbe about 1% by the independent determination of the\nEOS of the non-interacting Fermi gas. The experimental error bars of Fig. 4 also include the statistical error,\nwhich is < 0.5% thanks to the scale invariance of the\nbalanced unitary gas: irrespective of shot-to-shot fluctuations of atom number and temperature, all experimental profiles contribute to the same scaled EOS-function\nf . The dominant uncertainty on the experimental EOS\nstems from the uncertainty in the position of the 6 Li Feshbach resonance known to be at 834.15±1.5 G from spectroscopic measurements [20]. The change in energy, pressure and density with respect to the interaction strength\nis controlled by the so-called contact [21] that is obtained\n\n3\n\n0\n\n20\n40 0\n20\n40\nx (μm)\nρ (μm)\n\nnλ\n\n6.5\n0.0\n\n0\n\n1.0\n0.5\n0.0\n-2.0 -1.5 -1.0 -0.5\nμ/kBT\n\nFIG. 3. Constructing the EOS from in situ imaging.\nThe atom cloud shown contains N = 8 × 104 atoms for each\nspin-state, with a local Fermi energy of EF = 370 nK at the\ncenter. a) Absorption image of the atomic cloud after quadrant averaging. b) Reconstructed local density n(ρ, z). c)\nEquipotential averaging produces a low-noise density profile\nn vs V . Thermometry is performed by fitting the experimental data (red) to the known portion of the EOS (solid\nblue line), starting with the virial expansion for βμ < −1.25\n(green dashed line). In this example, the EOS is known\nto βμ ≤ −0.25, and the fit to the density profile yields\nT = 113 nK, and βμ = 1.63. d) Given μ and T , the density profile can be rescaled to produce the EOS nλ3 vs βμ.\n\nfrom Γ in the BDMC calculation. This allows us to define the uncertainty margins above and below the experimental data (see Fig. 4) that give the prediction for the\nunitary EOS if the true Feshbach resonance lied 1.5 G\nbelow or above 834.15 G, respectively.\nWe clearly discriminate against previous theoretical\nand experimental results. Deviations from the theory\nbased on the first-order Feynman diagrams [15, 19] are\nexpected, and rather remarkably moderate. Differences\nwith lattice Monte Carlo data [11, 13] may seem more\nsurprising, since in the particular case of the balanced\nsystem these algorithms are free of the sign problem, allowing in principle to approach the balanced unitary gas\nmodel in an unbiased way. However, eliminating systematic errors from lattice-discretization and finite volume\nrequires extrapolations which are either not done [11]\nor difficult to control [12, 13]. The ENS experimental\npressure EOS [22] lies systematically below ours, slightly\noutside the reported error bar. The experimental results\nfrom Tokyo [23] do not agree with the virial expansion at\nhigh temperature. The BDMC results agree excellently\nwith the present experimental data all the way down to\nthe critical temperature for superfluidity (see Fig. 4). On\napproach to (βμ)c , we observe the growth of the correlation length in the BDMC pair correlation function Γ.\n\n\f4\na)\n3.0\n\nb)\n2.4\n2.2\nP(μ,T) / P0(μ,T)\n\nn(μ,T) / n0(μ,T)\n\n2.5\n\n2.0\n\n1.5\n\n2.0\n1.8\n1.6\n1.4\n1.2\n1.0\n\n1.0\n-1\n\n0\n\nμ / kBT\n\n1\n\n2\n\n-1\n\n0\n\nμ / kBT\n\n1\n\n2\n\nFIG. 4. Equation of state of the unitary Fermi gas in the normal phase. (a) Density n and (b) pressure P of\na unitary Fermi gas, normalized by the density n0 and the pressure P0 of a non-interacting Fermi gas, versus the ratio of\nchemical potential μ to temparature T . Blue filled squares: Bold Diagrammatic Monte Carlo (this work), red filled circles:\nMIT experiment (this work). The BDMC error bars are estimated upper bounds on systematic errors. The MIT error bars are\none standard deviation systematic plus statistical errors, with the additional uncertainty from the Feshbach resonance position\nshown by the upper and lower margins in red solid lines. Black dashed line and red triangles: Theory and MIT experiment (this\nwork) for the ideal Fermi gas, used to assess the experimental systematic error. Green solid line: third order virial expansion.\nOpen squares: first order bold diagram [15, 19]. Green open circles: Auxiliary Field QMC [11]. Star: superfluid transition point\nfrom Determinental Diagrammatic Monte Carlo [13]. Filled diamonds: ENS experimental pressure EOS [22]. Open pentagons:\npressure EOS from Tokyo experiment [23].\n\nA protocol for extracting the critical temperature itself\nfrom the BDMC simulation will be presented elsewhere.\nWe are not aware of any system of strongly correlated\nfermions in Nature where experimental and unbiased theoretical results were compared at the same level of accuracy. Even for bosons, the only analog is liquid 4 He. This\npromotes the unitary gas to the major testing ground for\nunbiased theoretical treatments. The present BDMC implementation should remain applicable at finite polarization and/or finite scattering length, opening the way to\nrich physics which was already addressed by cold atoms\nexperiments [10, 24–27]. We also plan to extend BDMC\nto superfluid phases by introducing anomalous propagators. Moreover, since the method is generic, we expect\nnumerous other important applications to long-standing\nproblems across many fields.\nNote added in proof: After a preprint of this work became available, new Auxiliary Field QMC data were presented [31], with undetermined systematic errors whose\nevaluation in future work is called for by the authors of\nRef. [31].\n\nMethods\nThe experimental setup has been described previously [24]. In short, ultracold fermionic 6 Li is brought to\ndegeneracy via sympathetic cooling with 23 Na. A twostate mixture of the two lowest hyperfine states of 6 Li\nis further cooled in a hybrid magnetic and optical trap\nat the broad Feshbach resonance at 834 G. We employ\nhigh-resolution in situ absorption imaging to obtain the\ncolumn density of the gas, that is converted into the full\n3D density via the inverse Abel transform [28]. Equidensity lines provide equipotential lines that are precisely\ncalibrated via the known axial, harmonic potential (axial\nfrequency νz = 22.83 ± 0.05 Hz). Equipotential averaging yields low-noise profiles of density n versus potential\nV . Density is absolutely calibrated by imaging a highly\ndegenerate, highly imbalanced Fermi mixture, and fitting the majority density profile to the ideal Fermi gas\nEOS [24]. In contrast to previous studies [22, 23], our\nanalysis does not rely on the assumption of harmonic\ntrapping.\nThermometry is performed by fitting the density profile to the EOS constructed thus far, restricting the fit to\nthe portion of the density profile where the EOS is valid.\nIn the high-temperature regime, the EOS is given by the\n\n\f5\nvirial expansion\nnλ3 = eβμ + 2b2 e2βμ + 3b3 e3βμ + ...\n\n(1)\n\n√\nwhere the virial coefficients are b2 = 3 2/8 [29], and\nb3 = −0.29095295 [30]. Fitting a high-temperature\ncloud to the virial expansion gives the temperature T\nand the chemical potential μ of the cloud, and the EOS\nnλ3 = f (βμ) can be constructed. We have used Eq.(1)\nfor βμ < (βμ)max = −1.25 and we checked that our EOS\ndid not change within statistical noise if we instead used\n(βμ)max = −0.85. Once a new patch of EOS has been\nproduced, it can then in turn be used to fit colder clouds.\nIteration of this method allows us to construct the EOS\nto arbitrarily low temperature. A total of ∼ 1000 profiles were used, with 10 to 100 profiles (50 on average)\ncontributing at any given βμ.\nAcknowledgements\nWe thank R. Haussmann for providing propagator\ndata from [15, 19] for comparison, and the authors of\nRefs. [11, 13, 22, 23] for sending us their data. This collaboration was supported by a grant from the Army Research Office with funding from the DARPA Optical Lattice Emulator program. Theorists acknowledge the financial support of the Research Foundation - Flanders FWO\n(K.V.H.), NSF grant PHY-1005543 (UMass group), SNF\nFellowship for Advanced Researchers (E.K.), and IFRAF\n(F.W.). Simulations ran on the clusters CM at UMass\nand brutus at ETH. The MIT work was supported by the\nNSF, AFOSR-MURI, ARO-MURI, ONR, DARPA YFA,\nan AFOSR PECASE, the David and Lucile Packard\nFoundation, and the Alfred P. Sloan Foundation.\nAuthor Contributions\nK.V.H. (theory) and M.J.H.K. (experiment) contributed equally to this work. K.V.H., F.W., E.K., N.P.\nand B.S. developed the BDMC approach for unitary\nfermions; the computer code was written by K.V.H. assisted by F.W.; simulation data were produced by F.W.,\nE.K. and K.V.H.; M.J.H.K., A.T.S., L.W.C., A.S. and\nM.W.Z. all contributed to the experimental work and\nthe analysis. All authors participated in the manuscript\npreparation.\nAdditional Information\nCorrespondence and requests for materials should be\naddressed to K.V.H. (email:kris.vanhoucke@ugent.be).\n\n[1] R. Feynman, International Journal of Theoretical\nPhysics, 21, 467 (1982).\n[2] I. Bloch, J. Dalibard, and W. Zwerger, Rev. Mod. Phys.,\n80, 885 (2008).\n[3] A. Fetter and J. Walecka, Quantum Theory of ManyParticle Systems (McGraw-Hill, New York, 1971).\n\n[4] K. Van Houcke, E. Kozik, N. Prokof'ev, and B. Svistunov, in \"Computer Simulation Studies in Condensed\nMatter Physics XXI\", Eds. D.P. Landau, S.P. Lewis, and\nH.B. Schuttler, Springer Verlag, 2008 (arXiv:0802.2923).\n[5] E. Kozik, K. Van Houcke, E. Gull, L. Pollet,\nN. Prokof'ev, B. Svistunov, and M. Troyer, EPL, 90,\n10004 (2010).\n[6] N. Prokof'ev and B. Svistunov, Phys. Rev. Lett., 99,\n250201 (2007).\n[7] N. V. Prokof'ev and B. V. Svistunov, Phys. Rev. B, 77,\n125101 (2008).\n[8] M. Inguscio, W. Ketterle, and C. Salomon, eds., Ultracold Fermi Gases, Proceedings of the International\nSchool of Physics \"Enrico Fermi\", Course CLXIV,\nVarenna, 20 - 30 June 2006 (IOS Press, Amsterdam,\n2008).\n[9] S. Giorgini, L. P. Pitaevskii, and S. Stringari, Rev. Mod.\nPhys., 80, 1215 (2008).\n[10] W. Zwerger, ed., BCS-BEC Crossover and the Unitary\nFermi Gas, Lecture Notes in Physics (Springer, 2012).\n[11] A. Bulgac, J. E. Drut, and P. Magierski, Phys. Rev.\nLett., 96, 090404 (2006).\n[12] E. Burovski, N. Prokof'ev, B. Svistunov, and M. Troyer,\nPhys. Rev. Lett., 96, 160402 (2006).\n[13] O. Goulko and M. Wingate, Phys. Rev. A, 82, 053621\n(2010).\n[14] G. C. Strinati, in \"BCS-BEC Crossover and the Unitary\nFermi Gas\", Lecture Notes in Physics, W. Zwerger, ed.\n(Springer, 2012), arXiv:1011.5615.\n[15] R. Haussmann, Phys. Rev. B, 49, 12975 (1994).\n[16] G. Hardy, Divergent Series (Oxford University Press,\nNew York, 1949).\n[17] A. Fruchard, Collect. Math., 43, 71 (1992).\n[18] F. J. Dyson, Phys. Rev., 85, 631 (1952).\n[19] R. Haussmann, W. Rantner, S. Cerrito, and W. Zwerger,\nPhys. Rev. A, 75, 023610 (2007).\n[20] M. Bartenstein, A. Altmeyer, S. Riedl, R. Geursen,\nS. Jochim, C. Chin, J. Hecker-Denschlag, R. Grimm,\nA. Simoni, E. Tiesinga, C. J. Williams, and P. S. Julienne, Phys. Rev. Lett., 94, 103201 (2004).\n[21] E. Braaten, in \"BCS-BEC Crossover and the Unitary\nFermi Gas\", Lecture Notes in Physics, W. Zwerger, ed.\n(Springer, 2012), arXiv:1008.2922.\n[22] S. Nascimbène, N. Navon, K. J. Jiang, F. Chevy, and\nC. Salomon, Nature, 463, 1057 (2010).\n[23] M. Horikoshi, S. Nakajima, M. Ueda,\nand\nT. Mukaiyama, Science, 327, 442 (2010).\n[24] W. Ketterle and M. Zwierlein, Rivista del Nuovo Cimento, 31, 247 (2008).\n[25] Y. Shin, C. Schunck, A. Schirotzek, and W. Ketterle,\nNature, 451, 689 (2007).\n[26] Y. Shin, Phys. Rev. A, 77, 041603(R) (2008).\n[27] N. Navon, S. Nascimbène, F. Chevy, and C. Salomon,\nScience, 328, 729 (2010).\n[28] Y. Shin, M. Zwierlein, C. Schunck, A. Schirotzek, and\nW. Ketterle, Phys. Rev. Lett., 97, 030401 (2006).\n[29] T.-L. Ho and E. J. Mueller, Phys. Rev. Lett., 92, 160404\n(2004).\n[30] X.-J. Liu, H. Hu, and P. D. Drummond, Phys. Rev.\nLett., 102, 160401 (2009).\n[31] J. E. Drut, T. A. Lähde, G. Wlazlowski, and P. Magierski, \"The equation of state of the unitary fermi gas: An\nupdate on lattice calculations,\" arXiv:1111.5079v1.\n\n\f"}