{"id": "http://arxiv.org/abs/0804.3551v4", "guidislink": true, "updated": "2009-03-31T16:51:59Z", "updated_parsed": [2009, 3, 31, 16, 51, 59, 1, 90, 0], "published": "2008-04-22T15:35:33Z", "published_parsed": [2008, 4, 22, 15, 35, 33, 1, 113, 0], "title": "A noncommutative view on topology and order", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0804.2066%2C0804.1531%2C0804.3411%2C0804.0953%2C0804.4201%2C0804.0319%2C0804.1530%2C0804.1835%2C0804.1061%2C0804.4146%2C0804.3143%2C0804.4112%2C0804.2185%2C0804.2234%2C0804.3551%2C0804.2742%2C0804.1669%2C0804.2177%2C0804.0015%2C0804.3404%2C0804.4791%2C0804.3975%2C0804.3487%2C0804.2825%2C0804.2312%2C0804.0368%2C0804.2564%2C0804.4375%2C0804.4761%2C0804.2201%2C0804.1719%2C0804.3214%2C0804.4887%2C0804.4663%2C0804.1086%2C0804.2980%2C0804.3349%2C0804.4575%2C0804.3578%2C0804.4525%2C0804.4769%2C0804.0173%2C0804.3211%2C0804.4327%2C0804.2018%2C0804.0612%2C0804.2461%2C0804.1036%2C0804.2385%2C0804.1152%2C0804.1960%2C0804.2686%2C0804.2547%2C0804.4533%2C0804.4181%2C0804.1455%2C0804.0958%2C0804.2508%2C0804.4033%2C0804.3698%2C0804.3835%2C0804.4883%2C0804.3237%2C0804.2314%2C0804.1631%2C0804.1949%2C0804.4716%2C0804.1655%2C0804.2527%2C0804.4091%2C0804.0884%2C0804.0851%2C0804.2107%2C0804.1837%2C0804.4482%2C0804.0361%2C0804.2592%2C0804.1526%2C0804.0411%2C0804.4180%2C0804.2516%2C0804.4008%2C0804.3575%2C0804.1842%2C0804.1320%2C0804.4500%2C0804.0611%2C0804.1986%2C0804.1229%2C0804.3594%2C0804.2604%2C0804.1748%2C0804.4128%2C0804.0748%2C0804.4145%2C0804.0661%2C0804.0301%2C0804.1525%2C0804.1823%2C0804.0675%2C0804.3884&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "A noncommutative view on topology and order"}, "summary": "In this paper we put forward the definition of particular subsets on a unital\nC*-algebra, that we call isocones, and which reduce in the commutative case to\nthe set of continuous non-decreasing functions with real values for a partial\norder relation defined on the spectrum of the algebra, which satisfies a\ncompatibility condition with the topology (complete separateness). We prove\nthat this space/algebra correspondence is a dual equivalence of categories,\nwhich is in fact only a mild generalization of the Gelfand-Naimark duality.\nThus we can expect that general isocones could serve to define a notion of\nnoncommutative ordered spaces. We also explore some basic algebraic\nconstructions involving isocones, and classify those which are defined in\nM_2(C).", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0804.2066%2C0804.1531%2C0804.3411%2C0804.0953%2C0804.4201%2C0804.0319%2C0804.1530%2C0804.1835%2C0804.1061%2C0804.4146%2C0804.3143%2C0804.4112%2C0804.2185%2C0804.2234%2C0804.3551%2C0804.2742%2C0804.1669%2C0804.2177%2C0804.0015%2C0804.3404%2C0804.4791%2C0804.3975%2C0804.3487%2C0804.2825%2C0804.2312%2C0804.0368%2C0804.2564%2C0804.4375%2C0804.4761%2C0804.2201%2C0804.1719%2C0804.3214%2C0804.4887%2C0804.4663%2C0804.1086%2C0804.2980%2C0804.3349%2C0804.4575%2C0804.3578%2C0804.4525%2C0804.4769%2C0804.0173%2C0804.3211%2C0804.4327%2C0804.2018%2C0804.0612%2C0804.2461%2C0804.1036%2C0804.2385%2C0804.1152%2C0804.1960%2C0804.2686%2C0804.2547%2C0804.4533%2C0804.4181%2C0804.1455%2C0804.0958%2C0804.2508%2C0804.4033%2C0804.3698%2C0804.3835%2C0804.4883%2C0804.3237%2C0804.2314%2C0804.1631%2C0804.1949%2C0804.4716%2C0804.1655%2C0804.2527%2C0804.4091%2C0804.0884%2C0804.0851%2C0804.2107%2C0804.1837%2C0804.4482%2C0804.0361%2C0804.2592%2C0804.1526%2C0804.0411%2C0804.4180%2C0804.2516%2C0804.4008%2C0804.3575%2C0804.1842%2C0804.1320%2C0804.4500%2C0804.0611%2C0804.1986%2C0804.1229%2C0804.3594%2C0804.2604%2C0804.1748%2C0804.4128%2C0804.0748%2C0804.4145%2C0804.0661%2C0804.0301%2C0804.1525%2C0804.1823%2C0804.0675%2C0804.3884&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "In this paper we put forward the definition of particular subsets on a unital\nC*-algebra, that we call isocones, and which reduce in the commutative case to\nthe set of continuous non-decreasing functions with real values for a partial\norder relation defined on the spectrum of the algebra, which satisfies a\ncompatibility condition with the topology (complete separateness). We prove\nthat this space/algebra correspondence is a dual equivalence of categories,\nwhich is in fact only a mild generalization of the Gelfand-Naimark duality.\nThus we can expect that general isocones could serve to define a notion of\nnoncommutative ordered spaces. We also explore some basic algebraic\nconstructions involving isocones, and classify those which are defined in\nM_2(C)."}, "authors": ["Fabien Besnard"], "author_detail": {"name": "Fabien Besnard"}, "author": "Fabien Besnard", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1016/j.geomphys.2009.03.009", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/0804.3551v4", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0804.3551v4", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "31 pages. To appear in Journal of Geometry and Physics", "arxiv_primary_category": {"term": "math.OA", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "math.OA", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "gr-qc", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "46L85; 54F05", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0804.3551v4", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0804.3551v4", "journal_reference": "J.Geom.Phys.59:861-875,2009", "doi": "10.1016/j.geomphys.2009.03.009", "fulltext": "arXiv:0804.3551v4 [math.OA] 31 Mar 2009\n\nA Noncommutative View on Topology and\nOrder\nFabien Besnard\nEPF, 3 bis rue Lakanal, 92330 Sceaux, FRANCE\n\nAbstract\nIn this paper we put forward the definition of particular subsets on a unital C ∗ algebra, that we call isocones, and which reduce in the commutative case to the set\nof continuous non-decreasing functions with real values for a partial order relation\ndefined on the spectrum of the algebra, which satisfies a compatibility condition\nwith the topology (complete separateness). We prove that this space/algebra correspondence is a dual equivalence of categories, which generalizes Gelfand-Naimark\nduality. Thus we can expect that general isocones could serve to define a notion of\n\"noncommutative ordered spaces\". We also explore some basic algebraic constructions involving isocones, and classify those which are defined in M2 (C).\nKey words: Noncommutative topology, Causal sets, Noncommutative ordered\nspaces\n1991 MSC: 58B34, 54F05, 46L85, 46L89\n\n1\n\nIntroduction\n\nConnes' noncommutative geometry is a promising candidate for the merging\nof General Relativity and the Standard Model of particle theory. However, it\nEmail address: Fabien.Besnard@wanadoo.fr (Fabien Besnard).\n\nPreprint submitted to Elsevier\n\n29 October 2018\n\n\ffaces two major challenges. The first is quantization, and will not be discussed\nin this paper (see [1] and references therein). The second is compatibility with\nLorentz signature. One way to deal with this problem would be to perform\nback and forth Wick rotations. Although this has been proved to be a successful procedure in Minkowski space, it is known to be unreliable at least in some\nbackground independent contexts [2]. A more satisfying approach is needed\nthat would be an adaptation of the axiomatic description of spectral triples.\nSeveral attempts have already been made. A first option is to define semiriemannian spectral triples, in which one replaces C ∗ -algebras with ∗-algebras\nof bounded operators on a Krein space [3]. A perhaps less radical possibility is to use the splitting of a globally hyperbolic manifold into space+time.\nOne can then define a collection of noncommutative 3-spaces with causal relationships between them [4], [5]. It is also possible to arrive at an axiomatic\ncharacterization of the collection of local algebras of causal functions on a\nglobally hyperbolic spacetime [6]. This last paper has been very inspirational\nto the author of these lines. Indeed, the axioms that we will state below are\nalready present in [6] with the exception of one, which turns out to be crucial,\nhowever.\nThus, the main motivation for this work is to look for a correct setting for\n\"Lorentzian noncommutative geometry\". However, we will focus only on one\naspect of the problem, namely causal order. It is known that all the conformal\nstructure of a spacetime can be recovered from its causal order relation alone\n[7]. For this reason, it has long been advocated (see [8]) that causal order\nshould be the central object of quantum gravity and that spacetime should\nbe replaced at microscopic scales by what is called a \"causal set\", or \"causet\"\nfor short. In the spirit of noncommutative geometry, a dual formulation of a\ncauset in terms of functions preserving the causal order is thus needed. We\nwill arrive at such a formulation in this article. Note, however, that it will be\ndifferent from the algebraization of causets in terms of indecomposable ideals\nin the incidence algebra proposed in [9]. More precisely, what we seek is a\ngeneralization of the Gelfand-Naimark theorem. Just as the Gelfand-Naimark\ntheorem is the point of departure of noncommutative geometry, we can see\nthis generalization to the poset context as the point of departure of noncommutative poset theory.\nTo be more specific, the kind of space we seek to render noncommutative is\na partially ordered set M, or poset, endowed with a topology. The two structures have to satisfy a compatibility condition. Several conditions of this kind\nhave been studied. In order to obtain good duality results, the minimal condition to ask is, tautologically, that there are enough continuous non-decreasing\nfunctions to fully determine the order relation. Spaces of this kind are called\n\"completely separated ordered spaces\" but we will more shortly call them\n\"toposets\". We will state some results about toposets in section 2, most of\nthem directly coming from the classic book [10]. Of course, we will need to\n2\n\n\fformulate a set of axioms defining the dual objects. This we will do in section 3, defining the category of I ∗ -algebras. These are couples (I, C) where\nC is a C ∗ -algebra and I a closed convex cone in C, subject to several additional hypotheses inferred from the properties of the cone of non-decreasing\nfunctions defined on a toposet. We will then prove our main result in section\n4, that is the extension of the Gelfand-Naimark theorem to the category of\nunital commutative I ∗ -algebras. Unitarity of the algebra means compacity of\nthe underlying space, and one may worry about Lorentzian manifolds being\nnon-compact. But in this case, as we will recall in section 5, one may work\nwith non-decreasing bounded functions, which gives rise to an ordered compactification known as the Nachbin compactification. Section 6 is devoted to\nthe formulation of the definition of noncommutative causal toposets. Finally,\nin section 7, we will classify the simplest noncommutative I ∗ -algebras one can\nthink of, namely those with M2 (C) as algebras.\n\n2\n\nCompletely separated ordered spaces\n\nFirst some notations. In a poset, the symbol ≤ will always denote a partial\norder relation. We also denote by this symbol the natural order of R. If in a\nposet we have two elements x and y such that x ≤ y and x 6= y we will write\nx < y. If neither x < y nor y < x we write x ∼ y.\nLet M and N be two posets. We recall that a map f : M → N is called\nisotone iff :\n∀x, y ∈ M, x ≤ y ⇒ f (x) ≤ f (y)\n\n(1)\n\nIt is called antitone if f (x) ≥ f (y) in (1), it is an order-embedding if the\nimplication is an equivalence in (1), and it is an (order-)isomorphism if it is a\nsurjective order-embedding.\nDefinition 1 A triple (M, ≤, τ ) will be called an ordered topological space if\n(M, ≤) is a poset and (M, τ ) a topological space. We set :\nI(M, ≤, τ ) := {f : M → R|f is isotone and continuous}\nand\nIb (M, ≤, τ ) := {f ∈ I(M, ≤, τ )|f is bounded }\nIn the sequel τ and ≤ will be understood and we will write I(M) for short.\nThe sets I(M) and Ib (M) may also be defined in case M is only a preordered\nset. This will be useful later.\n3\n\n\fThe following definition is taken from [10].\nDefinition 2 A completely separated ordered space is an ordered topological\nspace such that the continuous real isotonies determine the order of M. That\nis to say :\n∀x, y ∈ M, x ≤ y ⇔ ∀f ∈ I(M), f (x) ≤ f (y)\n\n(2)\n\nNote in particular that if f (x) = f (y) for all f ∈ I(M), then x ≤ y and\ny ≤ x, thus x = y. This shows that the continuous isotone functions separate\nthe points of M. However, condition 2 is strictly stronger than separation of\npoints by I(M). Consider for instance the set M = [0; 1] endowed with its\nusual topology and the partial order \u0016 defined by x \u0016 1/2 and 1 ∼ x for all\nx ∈ [0; 1[. Then a function f belongs to I(M) if, and only if, it is a continous\nfunction which attains its supremum at x = 1/2. It is clear that I(M) separates\nthe points, but do not determine the order. Indeed, every f ∈ I(M) satisfies\nf (1) ≤ f (1/2) wheras 1 6\u0016 1/2.\nSince the expression \"completely separated ordered space\" is rather lengthy\nand should have to be used several times, we will call a space of this kind a\ntoposet (to recall its topological and poset structures).\nIt is clear that in definition (2) one can use Ib (M) instead of I(M), since\nwhenever f (x) ≤ f (y) for some f ∈ I(M), the same relation will hold for the\nbounded isotone function arctan ◦f .\nObvious examples of toposets are posets with the discrete topology. To see this\njust consider \"step functions\" defined by Hx (y) = 1 if x ≤ y, else Hx (y) = 0.\nIt is readily verified that they are isotone and determine the order.\nRemark : This example shows that toposet theory is a generalization of poset\ntheory. In fact, it is also a generalization of the theory of functionally Hausdorff\nspaces 1 , i.e. spaces in which points are separated by continuous functions.\nIndeed, a space of this kind is obviously turned into a toposet when endowed\nwith the trivial order relation (x ≤ y ⇔ x = y).\nAnother example is given by (M, \u0016) where M is a globally hyperbolic spacetime and \u0016 is the causal order relation. This is so because in such spacetimes\nthere exists a global time function T such that x ≺ y ⇒ T (x) < T (y) [11],\nand if x ∼ y it is possible to find global time functions T1 and T2 such that\nT1 (x) < T1 (y) and T2 (x) > T2 (y). To do so, take xǫ in the future of x and\nclose enough to x so that xǫ ∼ y still holds. Then, using the results of [12],\nthere exists a global time function T1 such that T1 (x) < T1 (xǫ ) = T1 (y) = 0.\n1\n\nSometimes called T2 1 spaces.\n2\n\n4\n\n\fOne finds T2 by exchanging the roles of x and y.\nGiven two posets (M1 , ≤1 ) and (M1 , ≤2 ), the product M1 ×M2 can be endowed\nwith the product order (x, y) ≤ (x′ , y ′) iff x ≤1 y and x′ ≤2 y ′ . It is easy to see\nthat the product of two compact toposets is a toposet for the product order.\nOn the other hand, the product of two toposets is generally not a toposet for\nthe lexicographic order.\nIf M is an interval of the real line with the induced topology, one can show\nthat the only total orders which can give M the structure of a toposet are the\nnatural order ≤ and its dual ≥.\nSeveral other compatibility conditions between topology and order have been\nexplored. One is the following :\nDefinition 3 A pospace is an ordered topological space M such that {(x; y) ∈\nM × M|x ≤ y} is closed in M × M with the product topology.\nA pospace is sometimes called a T2 -ordered space. It is obvious that a pospace\nis a Haussdorff topological space. It is also obvious that a toposet is a pospace,\nsince the condition (2) determines a closed subset of M × M. It happens that\nif M is compact, the converse holds ([10], p 114, corollary). Thus compact\ntoposets and compact pospaces are the same. Note also that they are simply\ncalled \"compact ordered space\" by Nachbin.\nThe next two propositions will be useful later :\nProposition 4 Let M be a set and S ⊂ RM . Define ≤S on M × M by\nx ≤S y ⇔ ∀s ∈ S, s(x) ≤ s(y). Then ≤S is a preorder, which is a partial\norder relation if, and only if, S separates the points of M. In this case, if M\nis a topological space and S only contains continuous functions, then (M, ≤S )\nis a toposet.\nThe proof is immediate. We will call ≤S the (pre-)order defined by S. Note\nthat S will not necessarily be equal to I(M, ≤S ). A condition for this to happen\nwill be given in corollary 7.\nProposition 5 Let (M, τ, \u0016) be a preordered topological set. That is, τ is a\ntopology, and \u0016 a reflexive and transitive relation. Then there exists a topological quotient of M, that we will call Mred , such that Mred is a toposet and\nthe projection p : M → Mred is isotone. Moreover, Mred satisfies the following\nuniversal property : for each isotone and continuous g : M → T , where T is a\ntoposet, there exists g̃ : Mred → T , isotone and continuous, such that g̃ ◦p = g.\nMoreover, Mred is uniquely determined up to canonical isomorphism by this\n5\n\n\funiversal property.\n\ng\n\nM\np\n\n\u000f z\n\n/\nz< T\n\nz\nz g̃\n\nMred\n\nPROOF. Let us define the equivalence relation x ≡ y iff ∀f ∈ Ib (M), f (x) =\nf (y).\nWe set Mred = M/ ≡, equipped with the quotient topology, and call the p the\nquotient map. Recall that h : Mred → X, where X is any topological space, is\ncontinuous if and only if h ◦ p is.\nFor two classes p(x) and p(y) we define :\np(x) ≤ p(y) ⇔ ∀f ∈ Ib (M), f (x) ≤ f (y)\n\n(3)\n\nIt is clear that ≤ is a well-defined partial order relation such that p is isotone.\nNow suppose ψ(p(x)) ≤ ψ(p(y)) for all ψ ∈ Ib (Mred ). It is clear by construction\nthat any f ∈ Ib (M) goes to the quotient and determines f ̃ ∈ Ib (Mred ) such\nthat f = f ̃ ◦ p. By hypothesis we thus have f (x) ≤ f (y) for each f ∈ Ib (M),\nand then p(x) ≤ p(y). This shows that Mred is a toposet.\nNow let g : M → T be as above. Let us show that g goes to the quotient. For\nthis take x, y ∈ M such that x ≡ y. For each φ ∈ Ib (T ), φ◦g ∈ Ib (M) and thus\nφ(g(x)) = φ(g(y)). Now since T is a toposet, this implies that g(x) = g(y).\nThus g defines g̃ as stated in the theorem, which is continuous by property of\nthe quotient topology. Now it is easy to show that g̃ is isotone by the same\ntechnique as above. Explicitly :\np(x) ≤ p(y)\n⇒ ∀f ∈ Ib (M), f (x) ≤ f (y)\n⇒ ∀φ ∈ Ib (T ), φ(g(x)) ≤ φ(g(y)), since φ ◦ g ∈ Ib (M)\n⇒\ng(x) ≤ g(y), since T is a toposet\n⇒\ng̃(p(x)) ≤ g̃(p(y))\nThere only remains to prove the unicity part. This is usual abstract nonsense,\nand we leave it to the reader.\nRemark : The universal property of Mred is equivalent to the following one :\nfor each γ ∈ I(M), there exists γ̃ ∈ I(Mred ) such that γ̃ ◦ p = γ. Indeed, given\nthat, take a toposet T and g : M → T isotone and continuous. Then for any\n6\n\n\fφ ∈ I(T ), φ ◦ g := γ ∈ I(M). Then, since γ goes to the quotient, it means\nthat φ(g(x)) = φ(g(y)) whenever p(x) = p(y). But this holds for all φ, and T\nis a toposet. Thus g(x) = g(y) whenever p(x) = p(y).\nThe theorem below is an adaption of the Stone-Weierstrass theorem to toposets.\nWe will call it the Stone-Nachbin theorem in future references.\nTheorem 6 Let M be a compact toposet, and J ⊂ I(M) be such that :\n(1) J contains the real constants,\n(2) J is stable by +, ∨, ∧, multiplication by λ ≥ 0 (i.e. J is a sublattice\ncone),\n(3) J determines the order, i.e. ∀x, y ∈ M, x ≤ y ⇔ ∀f ∈ J, f (x) ≤ f (y)\nThen J ̄ = I(M).\n\nPROOF. This theorem and its proof can be found in [10] (p. 114, theorem\n3) in a slightly different wording. For convenience let us repeat the proof here.\nIf J satisfies the hypotheses of the theorem then J ̄ also does. We can then\nsuppose that J is closed and prove that J = I(M). We take F in I(M). All\nwe need to do is to apply the lattice version of the Stone-Weierstrass theorem,\nand for this, we have to show that for all x, y ∈ M with x 6= y, there exists an\nfx,y in J such that fx,y (x) = F (x) and fx,y (y) = F (y). If F (x) = F (y) then\nwe can take a constant. If not, we can suppose without loss of generality that\nF (x) < F (y). Since F is isotone, this implies that x 6≥ y. But J determines\nthe order, so there exists j ∈ J with j(x) < j(y). Now define :\nλ :=\n\nF (y) − F (x)\n;\nj(y) − j(x)\n\nμ := F (x) −\n\nF (y) − F (x)\nj(x)\nj(y) − j(x)\n\nWe have λ > 0. Thus fx,y := λj + μ1 ∈ J and has the required property.\nThe following immediate corollary is in fact the initial formulation of theorem\n3 in [10].\nCorollary 7 Let M be a compact topological space and J ⊂ C(M). Then\n(M, ≤J ) is a toposet such that I(M) = J if and only if J is stable by +, ∨,\n∧, multiplication by λ ≥ 0, contains the constants, separates the points, and\nis closed.\nFinally, there is a generalization of Tietze's extension theorem in compact\ntoposets.\n7\n\n\fTheorem 8 Let M be a compact toposet and F a closed subset of M. Then\nevery element of I(F ) can be extended to an element of I(M).\nThis \"Tietze-Nachbin\" theorem is a corollary of [10], theorem 4 p. 48, which\nstates that compact ordered spaces (i.e. compact toposets) are normally ordered, and theorem 6 p. 49 which formulates the extension property for normally ordered spaces.\n\n3\n\nIsocones and I ∗ -algebras\n\nLet C be a unital C ∗ -algebra. We will use the following notations : the set of\nhermitean elements of C is Re C := {a ∈ C|a = a∗ } and the set of positive\nelements of C is C+ := {a ∈ Re C|σ(a) ⊂ R+ } where σ(a) denotes the\nspectrum of a. We will write a ≥ 0 if a ∈ C+ . It is well known that a ≥ 0 iff\n∃b ∈ C, a = b∗ b and that for\n√ any a ≥ 0, there exists a unique b ≥ 0 such that\n2\na = b√, and we write b = a. We also recall that for any a ∈ C one defines\n|a| = a∗ a.\nAt times we will need the set C+× := {a ∈ Re C|σ(a) ⊂ ]0; +∞[}. So a ∈ C+×\niff a is both positive and invertible. It is easy to see that C+× is an open subset\nof Re C.\nLet a, b ∈ Re C. We define :\na∧b=\n\na + b |a − b|\n−\n;\n2\n2\n\na∨b=\n\na + b |a − b|\n+\n2\n2\n\nWe must make some comments here. The two operations just defined are not\nin general meet and join in the sense of the partial order induced by C+ . For\ninstance, it is known [12] that two self-adjoint bounded operators on a Hilbert\nspace have a least upper bound only when they are comparable. One must\nalso pay attention to the fact that ∨ and ∧ do not generally satisfy the lattice\naxioms. They do only when the algebra is commutative [13].\nIn view of the Stone-Nachbin theorem, the following definition is a natural\nnoncommutative generalization of the set of isotone functions on a toposet.\nDefinition 9 A (strong) I ∗ -algebra is a couple (I, C) such that :\n(1) C is a unital C ∗ -algebra,\n(2) I is a closed convex cone of Re C, containing the constants and stable by\n∧ and ∨, i.e. :\n(a) I ⊂ Re C,\n(b) I = I,\n8\n\n\f(c) ∀b, b′ ∈ I, b + b′ ∈ I,\n(d) ∀λ ∈ R+ , ∀b ∈ I, λb ∈ I,\n(e) ∀b, b′ ∈ I, one has b ∨ b′ ∈ I and b ∧ b′ ∈ I,\n(f ) ∀x ∈ R, x1 ∈ I.\n(3) Span(I) = C\nExamples of I ∗ -algebras are given by couples (I(M), C(M)) where M is a\ncompact toposet. The direct part of corollary 7 shows that the second set of\nproperties is satisfied. To see that the third property also is consider V =\nSpanR (I(M)). This is a real algebra of continuous functions on a compact\nspace. Indeed, an element h of V may be written h = f − g where f, g ∈\nI(M). Moreover, using the compacity of M we can write f = f+ − λ1 and\ng = g+ − μ1 where f+ and g+ are positive functions, and λ, μ ∈ R+ . Thus we\nhave h = (f+ + μ1) − (g+ + λ1), so any element of V can be expressed as a\ndifference of two positive elements of I(M). This easily entails that V is stable\nby products. Since it also contains the constants and separates the points by\nthe toposet property, it is dense in Re C(M) = C(M, R) by the algebra version\nof the Stone-Weierstrass theorem. But C(M) = Re C(M) + iRe C(M) and so\nSpanC (I(M)) is dense in C(M).\nFor an obvious, but trivial, example of a noncommutative I ∗ -algebra one can\ntake (Re A, A) where A is any noncommutative C ∗ -algebra.\nRemark: The \"causal cones\" defined in [6] satisfy some of the axioms of isocones, but 2e is lacking. The reason is that Moretti's setting contains other\nstructures, satisfying their own axioms, which interact with causal cones. In\nthe end, the causal structure of a globally hyperbolic manifold is recovered,\namong other things. In particular this implies that causal cones are indeed\nisocones. If we are concerned with the causal structure only, and do not have\nother structures at our disposal, then the axioms of isocone are necessary and\nsufficient, as we will see.\nOf course, any condition which reduces to the stability under meet and join\nwhen the algebra is commutative could be required instead of 2e. In particular\nwe could ask for the less restrictive condition :\n(2e′ ) : ∀b, b′ ∈ I such that [b, b′ ] = 0, one has b ∨ b′ ∈ I and b ∧ b′ ∈ I\nThe corresponding objects will be called weak I ∗ -algebras. In the sequel, when\nwe make a statement about I ∗ -algebra (without adjective), it will be understood that it stands for both strong and weak I ∗ -algebras.\nRemark 1 : Let us call I+ = I ∩ C+ . Then I = I+ + R− 1. Indeed, for all x ∈ I,\nx + kxk1 ∈ I+ .\n9\n\n\fRemark 2 : Using the identity (a + k1) ∧ (b + k1) = a ∧ b + k1, with k ∈ R,\nand similarly for ∨, we see that using axioms 2c and 2f we can weaken axiom\n2e or 2e' by assuming that b, b′ ∈ C+× .\nA subset of a C ∗ -algebra satisfying the axioms 2a to 2f above will be called a\npre-isocone (strong or weak, depending on which version of axiom 2e is used).\nIf it moreover satisfies the third axiom, it will be called an isocone. Thus an\nI ∗ -algebra is a C ∗ -algebra equipped with an isocone. A sub-I ∗ -algebra of (I, C)\nis a couple (J, B) such that B is a sub-C ∗ -algebra of C, J ⊂ I is a pre-isocone\nand (J, B) is an I ∗ -algebra.\nLet us now see how the usual algebraic constructions extend to the I ∗ -algebra\nsetting.\nDefinition 10 An I ∗ -morphism from (I, C) to (I ′ , C ′ ), where the latter are\ntwo strong I ∗ -algebras, is a mapping ρ from C to C ′ such that :\n(1) ρ is a ∗-morphism between C and C ′ ,\n(2) ρ(I) ⊂ I ′ ,\n(3) For all pre-isocone J ⊂ I, ρ(J) is closed.\nWhen (I, C) and (I ′ , C ′ ) are two weak I ∗ -algebras, an I ∗ -morphism ρ from\n(I, C) to (I ′ , C ′ ) is required to satisfy\n(4) For all pre-isocones J ⊂ I, ∀x, y ∈ J, [x, y] ∈ ker ρ ⇒ x ∧ y and x ∨ y ∈\nJ + ker ρ.\nin addition to the three above conditions.\nAs a result of this definition, if ρ is an I ∗ -isomorphism, one has ρ(I) = I ′ . We\nalso note that requirements 3 and 4 are trivially satisfied when ρ is injective.\nProposition 11 Let ρ be a morphism from (I, C) to (I ′ , C ′ ). Then the couple\n(ρ(I), ρ(C)) is an I ∗ -algebra. Moreover, for all pre-isocone J ⊂ I, ρ(J) is a\npre-isocone of C ′ .\n\nPROOF. We know from the definition of I ∗ -morphims that ρ(I) is closed.\nMoreover, it is immediate that ρ automatically respects ∨ and ∧ as a ∗morphism. All verifications are then trivial in the \"strong\" context. For a\nmorphism of weak I ∗ -algebras and a pre-isocone J ⊂ I, let us show that ρ(J)\nsatisfies 2e'. For this take ρ(x) and ρ(y) such that x, y ∈ J and [ρ(x), ρ(y)] =\nρ([x, y]) = 0. Thus, [x, y] ∈ ker ρ, and the fourth condition ensures that ρ(x) ∧\nρ(y) ∈ ρ(J), and similarly for ∨.\nProposition 12 The class of strong (resp. weak) I ∗ -algebras with their mor10\n\n\fphisms is a category.\n\nPROOF. Let ρ : (I, A) → (J, B) and ρ′ : (J, B) → (K, C) be two morphisms\nbetween I ∗ -algebras. We need to prove that ρ′ ◦ ρ is an I ∗ -morphism. The\ntwo first conditions are obvious. Let F be a pre-isocone of A. Then ρ(F ) is a\npre-isocone of B and lies in J. Thus ρ′ (ρ(F )) is closed, and the third condition\nis satisfied.\nFinally, in the weak case, we consider x, y ∈ F such that [x, y] ∈ ker ρ′ ρ. Then\n[ρ(x), ρ(y)] ∈ ker ρ′ . Now since ρ(F ) is a pre-isocone of J, we have ρ(x)∧ρ(y) =\nρ(x ∧ y) ∈ ρ(F ) + ker ρ′ . Thus, x ∧ y ∈ ρ−1 (ρ(F ) + ker ρ′ ) = F + ker ρ′ ρ, and\nthe result follows. The same holds with ∨ instead of ∧.\nWe will call IC the category of strong I ∗ -algebras, and WIC the category of\nweak ones.\nRemark : Take two I ∗ -algebras of the form (Re A, A), (Re B, B). Then any\n∗-morphism between A and B gives rise to an I ∗ -morphism if and only if the\nthird condition is fulfilled. Were it always the case, strong I ∗ -algebras would\nbe a generalization of C ∗ -algebras in the same way as compact toposets are a\ngeneralization of compact sets. Or to put it in categorical terms, C ∗ -algebras\nand their morphisms would form a full subcategory of IC. We do not know\nwhether this is true or not.\nBy the Gelfand-Naimark-Segal theorem, every unital C ∗ -algebra is isomorphic to a sub-C ∗ -algebra of the algebra B(H) of bounded operators on some\nHilbert space H. By proposition 11 and the remark above that any injective ∗morphism satisfies points 3 and 4 of the definition of I ∗ -morphisms, we obtain\n:\nProposition 13 Any I ∗ -algebra is a sub-I ∗ -algebra of (Re B(H), B(H)) for\nsome Hilbert space H.\nWe next define ideals so that they are the kernels of morphisms.\nDefinition 14 Let (I, C) be an I ∗ -algebra. A subset N of C is called an I ∗ ideal of (I, C) (or simply an ideal, if the context is clear) if it is a closed\ntwo-sided ideal of C such that J + N is closed for every pre-isocone J ⊂ I. If\n(I, C) is a weak I ∗ -algebra, we additionaly ask that for all pre-isocone J ⊂ I,\nand for all x, y ∈ J, [x, y] ∈ N ⇒ x ∧ y and x ∨ y ∈ J + N .\nWith this definition and proposition 11, the quotient of an I ∗ -algebra by an\nideal is an I ∗ -algebra.\n11\n\n\fIt is a simple matter to verify that for two isocones I of C and I ′ of C ′ , the\ndirect sum I ⊕ I ′ is an isocone of C ⊕ C ′ . If (I, C) = (I(M), C(M)) and\n`\n(I ′ , C ′ ) = (I(M ′ ), C(M ′ )) then I ⊕ I ′ = I(M M ′ ) where the order on the\ndisjoint union of the toposets M and M ′ is the unique order extending the\nones on M and M ′ and such that M ∼ M ′ .\nIf B is a unital sub-C ∗ -algebra of C, and (I, C) is an I ∗ -algebra, then (I ∩B, B)\nis not necessarily an I ∗ -algebra. The only axiom that is not always satisfied 2\nis 3.\nWhen it is the case, we will say that B is transverse to I. If C ∗ (a), the C ∗ algebra generated by an element a of C, is transverse to I, we will say that a\nis transverse to I.\nLet S be a subset of C+ such that Span(S) = C. Since Re C is an isocone\ncontaining S, the intersection hSi of all isocones containing S will be nonempty. It is clearly an isocone, and we will call it the isocone generated by\nS. Let (I, C) and (I ′ , C ′ ) be two I ∗ -algebras. Then for any notion of tensor\nproduct, hI+ ⊗ I+′ i defines an isocone in C ⊗ C ′ .\nFor instance, using the Stone-Nachbin theorem, one can prove that if C =\nC 0 ([a; b]), and I is the set of continuous non-decreasing functions on [a; b], then\nhI+ ⊗ I+ i is the set of continous functions on [a; b]2 that are non-decreasing\nfor the product ordering.\n\n4\n\nThe Gelfand-Naimark theorem for I ∗ -algebras\n\nThe class of toposets (resp. compact toposets or equivalently compact pospaces)\ntogether with their continuous isotonies forms a category. This category will\nbe called T (resp. KT ).\nIf f : M → N is a continuous isotony between two toposets then we write f ∗\nfor the pullback by f from I(N) to I(M). That is : f ∗ (g) = g ◦ f .\nTheorem 15 Let (M, \u0016) and (N, ≤) be two compact toposets and f : M → N\na continuous isotony. Then write I(M) = (I(M), C(M)) where C(M) is the\nset of continuous maps from M to C, and write I(f ) = f ∗ . Then I is a\ncontravariant functor from KT to ab − IC.\nPROOF. The only thing we still need to prove is that f ∗ is a morphism of\n2\n\nFor a counterexample, take C = C([0; 1]) and I the isocone of continuous nondecreasing functions for the natural order, and take B = {f ∈ C|f (0) = f (1)}.\n\n12\n\n\fI ∗ -algebras.\nIt is well known that f ∗ is ∗-morphism. Clearly f ∗ I(N) ⊂ I(M). Let (φn ◦f )n∈N\nbe a sequence in f ∗ I(N) converging to an element θ. Now θ ∈ I(M), since\nI(M) is closed, and it defines a function ψ on f (M) such that θ = ψ ◦ f .\nSince M is compact and both θ and f are continuous, ψ is continuous, and\nsince φn ◦ f converges to θ, φn converges to ψ on f (M), which shows that ψ\nis isotone. Thus ψ ∈ I(f (M)). Now since f (M) is closed by compacity of M,\nwe can use the Tietze-Nachbin theorem to extend ψ to a function φ ∈ I(N)\nsuch that θ = φ ◦ f . This proves that f ∗ I(N) is closed.\nNow if J ⊂ I(N) is a pre-isocone of N, then (N, ≤J ) is a pre-ordered set. If\nwe call Ñ the quotient of N obtained by identifying the points which are not\nseparated by J, we obtain a compact toposet ordered by p(x) ≪ p(y) ⇔ x ≤J\ny, where p is the quotient map. The construction is almost the same as that\nof proposition 5 and the verifications are left to the reader. Moreover, since\n≤J is finer than the original order on N, f is again a continuous isotony from\nM to (N, ≤J ) and p is a continuous isotony from (N, ≤J ) to (Ñ, ≪). By the\nsame reasoning as above, (p ◦ f )∗ I(Ñ) = f ∗ p∗ I(Ñ) is closed.\nNow we just have to show that p∗ I(Ñ ) = J.\nJO\n\n⊂\n\nI(N, ≤J )\n\n⊂\n\np∗ ≃\n\nJ ̃\n\np∗ C(O Ñ )\n\n⊂\n\nC(N)\n\np∗ ≃\n\n=\n\n⊂\n\nI(Ñ)\n\nC(Ñ )\n\nFor any function φ : N → R going down to Ñ , write φ̃ for the unique function\nsuch that φ = φ̃ ◦ p. Then the map φ 7→ φ̃ is the reciprocal of p∗ : C(Ñ ) →\np∗ C(Ñ ), which is an isometric ∗-isomorphism. Let J ̃ be the image of J under\nthis map. Then J ̃ ⊂ I(Ñ ) and satisfies every hypothesis of corollary 7. Thus\nwe have J ̃ = I(Ñ). Since p∗ J ̃ = J by definition, the result follows.\n\nWe would like to define a functor which goes the other way round. For this\nwe need first to associate a toposet to an I ∗ -algebra.\nDefinition 16 Let (I, C) be an I ∗ -algebra and S(C) the space of states on C.\nLet s1 , s2 ∈ S(C). We define :\ns1 ≤I s2 ⇔ ∀c ∈ I, s1 (c) ≤ s2 (c)\n\n(4)\n\nWe know from proposition 4 that ≤I is a preorder. Now suppose s1 ≤I s2 and\ns2 ≤I s1 . Then by definition s1 and s2 coincide on I, thus on Span(I). But s1\n13\n\n\fand s2 are continuous and then must coincide by axiom 3. Thus ≤I is a partial\norder on S(C). In particular ≤I defines a partial order on PS(C), the space of\npure states and on χ(C), the character space of C. Recall that a character of\nC is ∗-morphism from C to C and that χ(C), S(C) and PS(C) are compact\nfor the ∗-weak topology. In the general case one has χ(C) ⊂ PS(C), while\nthere is equality in the commutative case.\nAnother space which is associated to C is its structure space Ĉ, namely the\nspace of equivalence classes of non-trivial irreducible representations modulo\nunitary equivalence. Through GNS theory, this space can be identified with\na quotient of PS(C). Note that, unless this equivalence relation is identity,\nwhich happens exactly when C is commutative, there is no reason ≤I should\ndescend to Ĉ.\nIn general we can turn elements of C into continuous functions on χ(C) by\nthe Gelfand transform :\nG(c) : C → C(χ(C))\nc 7→ (m 7−→ m(c))\n\n(5)\n\nNow it is obvious by definition that G(c) will be isotone when c ∈ I. Thus\nG(I) ⊂ I(χ(C)). But G(I) determines the order ≤I by definition, and this\nshows that (χ(C), ≤I ) is a toposet. One can show in the same way that S(C)\nand PS(C) are toposets.\nNote that G is always a ∗-morphism. Since ab and ba have the same image, it\ncannot be into unless C is abelian. If it is the case, then G is a ∗-isomorphism\nby Gelfand-Naimark theorem. We now state an extension of this theorem\nto the I ∗ -algebra setting. In the sequel we identify Ĉ with χ(C) when C is\ncommutative.\nTheorem 17 Let (I, C) be an I ∗ -algebra such that C is abelian. Then Ĉ is\na compact toposet (or equivalently a compact pospace) when it is equipped\nwith the partial order defined by I, and the Gelfand transform G : (I, C) →\n(I(Ĉ), C(Ĉ)) is an isometric isomorphism of I ∗ -algebras.\nPROOF. By the Gelfand-Naimark theorem we know that G : C → C(Ĉ)\nis an isometric ∗-isomorphism, when Ĉ is given the relative weak-∗ topology,\nand we have already shown that Ĉ is a compact toposet for this topology and\nthe partial order ≤I . Now G respects ∧ and ∨ since it is a ∗-morphism. Thus\nG(I) is a subset of I(Ĉ) having the following properties :\n(1) It contains the real constants,\n(2) it is stable by sum, ∧, ∨ and mutliplication by a non-negative real,\n14\n\n\f(3) it determines the order.\nIn addition to this, G satisfies the third requirement of I ∗ -morphisms since it\nis a linear isometry. In particular, G(I) is closed. Thus by theorem 6, G(I) =\nI(Ĉ).\n\nWhen A is not commutative the Gelfand transform G : A → C(M) is not\nsurjective, where M = PS(A). Would it still be possible that for a given\ntoposet M, there exists a noncommutative I ∗ -algebra (I, A) such that G(I) is\nexactly the set of continuous isotonies on M ? The next proposition answers\nnegatively.\nProposition 18 Let A be a C ∗ -algebra and M its space of pure states. If\nthere exists an isocone I of A such that G(I) ⊂ I(M) is stable by ∧ and ∨,\nthen A is abelian.\n\nPROOF. It is clear that G(I) satisfies the hypotheses of the Stone-Nachbin\ntheorem and is closed. Thus G(I) = I(M). Now since I and I(M) satify the\nthird axiom of isocones, we have G(A) = C(M). But this is possible only when\nA is abelian. Indeed, G since preserves positivity, it is order-preserving for the\norder induced by A+ and C(M)+ , respectively. Thus it preserves the lattice\noperations. From this we can conclude that A+ is a lattice, which proves that\nA is abelian [13].\n\nLet us now explain in details why the categories ab-IC of abelian I ∗ -algebras\nand KT are (dually) equivalent.\nProposition 19 Let us call b the \"mapping\" which associates (Ĉ, ≤I ) to an\nabelian I ∗ -algebra (I, C) and the pullback φ̂ to a morphism φ : (I, C) → (I ′ , C ′ )\nbetween two abelian I ∗ -algebras. Then b is a contravariant functor from ab−IC\nto KT .\nPROOF. The only thing that is not already known from the usual case is\nthat φ̂ is an isotony. Let us prove this. Take m, n ∈ Ĉ ′ . We have :\nm≤n\n⇒ ∀c′ ∈ I ′ , m(c′ ) ≤ n(c′ ) by (4)\n⇒ ∀c ∈ I, m(φ(c)) ≤ n(φ(c)) since φ(I) ⊂ I ′\n⇒ ∀c ∈ I, φ̂(m)(c) ≤ φ̂(n)(c)\n⇒\nφ̂(m) ≤ φ̂(n)\n15\n\n\fRemark : Note in passing that we nowhere used the fact that φ satisfies the\nthird requirement of I ∗ -morphisms in the above proof. We will need this fact\nlater.\nProposition 20 The functors b and I realize a dual equivalence between abIC and KT .\nPROOF. We have to show that the named functors are inverse to each other\nup to natural isomorphisms.\n\\\nLet us consider a compact toposet M and its image under b ◦ I, i.e. C(M)\nwith the partial order defined by (4). These sets are homeomorphic by the\nfollowing map :\n\\\nǫM : M −→ C(M)\nx 7−→ evx\n\nwhere evx is the evaluation at x : f 7→ f (x). Now if x, y ∈ M we have :\nǫM (x) ≤ ǫM (y)\n⇔\nevx ≤ evy\n⇔ ∀f ∈ I(M), f (x) ≤ f (y) by (4)\n⇔\nx≤y\n\\\nwhere in the last line we used the fact that M is a toposet. Thus M ≃ C(M)\nas toposets. Moreover, if f : M → M ′ is a continuous isotony between two\n\\ → C(M\n\\′ ) reads evx 7→ evf (x) which is clearly\ncompact toposets, then fc∗ : C(M)\na continuous isotony. Thus ǫ is a natural transformation between the functor\nb ◦ I and the identity functor.\n\nConversely, if (I, C) is an abelian I ∗ -algebra, we have shown in theorem 17\nˆ C(Ĉ)). Now we consider :\nthat G is an isomorphism between (I, C) and (I(C),\nI(φ̂) : (I(Ĉ), C(Ĉ)) −→ (I(Ĉ ′ ), C(Ĉ ′ ))\nf 7−→ f ◦ φ̂\n\nWe already know from the usual case that this commutes with G.\n\nThanks to this equivalence, exactly as one thinks of a noncommutative algebra as an algebra of continuous functions on some virtual noncommutative\n16\n\n\f(compact or locally compact) space, one can think of a noncommutative I ∗ algebra as an algebra of continuous and isotone functions on some virtual\nnoncommutative compact toposet.\nWe have seen how ideals, quotients and morphisms are defined in I ∗ -algebras.\nIn the commutative case, things are a little simpler. Take two commutative\nI ∗ -algebras (I, C) and (I ′ , C ′ ). Thanks to theorem 17 we can as well consider\nthe case where I = I(M) and C = C(M) with M a compact toposet, and\nsimilarly for the primed objects. A ∗-morphism φ from C to C ′ is always the\npullback of a continuous f : M ′ → M. Now if φ(I) ⊂ I ′ it means that f\nis a continuous isotony from M ′ to M. In fact, we have already proved this\nabove in showing that b is a contravariant functor, since, as we have remarked,\nwe nowhere used the third axiom of I ∗ -morphisms. Thus, if φ(I) ⊂ I ′ then\nφ = f ∗ with f a continuous isotony and this proves that φ is an I ∗ -morphism.\nTherefore, an I ∗ -morphism between the commutative I ∗ -algebras (I, C) and\n(I ′ , C ′ ) is just a ∗-morphism φ between C and C ′ such that φ(I) ⊂ φ(I ′ ), and\nφ automatically fulfills the third axiom. Consequently, an I ∗ -ideal N of (I, C)\nis just any closed ideal of C.\nRemember that a closed ideal of C is always of the form N = {f ∈ C|f|F =\n0}, where F is closed subset of M, and that the quotient algebra C/N is\ncanonically isomorphic to C(F ). As expected, this isomorphism carries I to\nI(F ), by the extension property 8.\nWe will now introduce a class of I ∗ -algebra which, as we will show, corresponds\nto totally ordered toposets.\nDefinition 21 Let (I, A) be an I ∗ -algebra. We will say that (I, A) is minimal\nif there exists no J ⊂ I such that J is an isocone of A and J 6= I. In this\ncase, we will also say that I is a minimal isocone of A.\nProposition 22 Let M be a compact toposet. Then M is totally ordered if,\nand only if, (I(M), C(M)) is a minimal I ∗ -algebra.\n\nPROOF. Let M be totally ordered and suppose that (I(M), C(M)) is not\nminimal. Then there exists a strict subset J of I(M) such that J is an isocone\nof C(M). Let ≤ be the original order on M. Then it is clear that for all\nx, y ∈ M, x ≤ y ⇒ x ≤J y. Now if the converse of this implication were true,\nJ would satisfy all conditions of the Stone-Nachbin theorem and we would\nhave J = I(M). Therefore, since ≤ is a total order, there exist x, y ∈ M such\nthat x ≤J y and y < x. But y < x ⇒ y <J x, a contradiction.\nConversely, suppose (I(M), C(M)) is minimal, and ≤ is not total. Then there\nexist x, y ∈ M such that x ∼ y and x 6= y. Let J = {f ∈ I(M)|f (x) ≤ f (y)}.\nNotice first that by definition of a toposet, x 6= y and x ∼ y ⇒ ∃g, g ′ ∈ I(M)\n17\n\n\fsuch that g(x) < g(y) and g ′ (x) > g ′(y). Thus, there is a g ∈ J such that\ng(x) < g(y). We will use this g later in the proof. Since we have a g ′ ∈ I(M)\nsuch that g ′ ∈\n/ J, we also have J 6= I(M).\nNow J is obviously a closed and convex cone, and a sublattice of I(M). We\njust need to show that Span(J) is dense in C(M). For this we prove that\nV = SpanR (J) is dense in C(M, R). It is clear that V = J+ −J+ is a subalgebra\nof C(M, R) containing R1, so we only need to show that it separates the points.\nFor this, we take a 6= b in M and f ∈ I(M) such that f (a) 6= f (b). Now if\nf (x) ≤ f (y), or if g(a) 6= g(b) we are done. So we suppose that f (x) > f (y)\nand g(a) = g(b). Let us define h ∈ C(M) by\nh=f −2\n\n[evx − evy ](f )\ng\n[evx − evy ](g)\n\nf (x) − f (y)\n> 0, and so h ∈ I(M). Of course, h being the\ng(x) − g(y)\nsymmetrical of f with respect to ker(evx − evy ) in the direction of g, we have\nh(x) − h(y) < 0 by construction, so h ∈ J. Now we have h(a) − h(b) =\nf (a) − f (b) 6= 0. Thus J, and then V , separate the points.\nWe see that −2\n\n5\n\nApplications\n\nThe first applications of theorem 17 are to the general (noncommutative)\ntheory of I ∗ -algebras, exactly as in the case of C ∗ -algebras with the GelfandNaimark theorem.\nProposition 23 Let (I, C) be an I ∗ -algebra and x1 , . . . , xp ∈ I such that\n[xi , xj ] = 0 for 1 ≤ i ≤ j ≤ p. Then (I ∩ C ∗ (x1 , . . . , xp ), C ∗ (x1 , . . . , xp )) is an\nI ∗ -algebra which is isomorphic to (I(K, \u0016), C(K)) where K is compact subset\nof Rp and \u0016 is a partial order on K which is less fine than the natural product\nordering inherited from Rp .\nPROOF. We already know from C ∗ -algebra theory that there exists such a\ncompact K ⊂ Rp and a ∗-isomorphism ψ : C ∗ (x1 , . . . , xp ) → C(K) such that\nψ(xi ) is the projection on the i-th coordinate.\nWe know that I ∩ C ∗ (x1 , . . . , xp ) is a pre-isocone. It remains to show that\nthe subalgebra C ∗ (x1 , . . . , xp ) is transverse. For this, consider J = ψ(I ∩\nC ∗ (x1 , . . . , xp )). Since ψ is a ∗-isomorphism, J is a pre-isocone of C(K). Let\n\u0016 be the preorder determined by J on K. We know from proposition 4 that\n\u0016 is a partial order if and only if J separates the points. Now this last point\nis clear since J contains the projections on all coordinates. Thus, (K, \u0016) is\n18\n\n\fa compact toposet, and by corollary 7 we have J = I(K, \u0016). This shows\nthat (I ∩ C ∗ (x1 , . . . , xp ), C ∗ (x1 , . . . , xp )) is an I ∗ -algebra which is isomorphic\nto (I(K, \u0016), C(K)). The fact that \u0016 is less fine than the product ordering\ninherited from Rp comes from the fact that the projections on coordinates are\nisotone for \u0016.\nIf we specialize this proposition to the case p = 1, we obtain the following.\nCorollary 24 Let (I, C) be an I ∗ -algebra and a ∈ I. Then (I ∩ C ∗ (a), C ∗ (a))\n\\\n∗ (a) defined by I ∩ C ∗ (a). Then\nis an I ∗ -algebra. Write \u0016 for the order on C\nthe map :\n∗ (a), \u0016) −→ (σ(a), ≤)\n\\\nθ : (C\nφ 7−→ φ(a)\n\nwhere ≤ is the natural order of R, is an isotone homeomorphism.\nThe easy proof of the last part of the corollary is left to the reader. Note that\nθ need not be an order-embedding. We will see an example below.\nCorollary 25 With the same hypotheses, if f : σ(a) → R is continuous and\nnon-decreasing (for the natural order) then f (a) ∈ I ∩ C ∗ (a).\nPROOF. By theorem 17 and corollary 24 we have an isomorphism :\n∗ (a), \u0016), C\n∗ (a))\n\\\n\\\nG : (I ∩ C ∗ (a), C ∗ (a)) ≃ (I(C\n\nNow the map θ defined above, being an isotone homeomorphism, gives rise to\nan I ∗ -algebra morphism :\n∗ (a), \u0016), C\n∗ (a))\n\\\n\\\nθ∗ : (I(σ(a), ≤), C(σ(a))) −→ (I(C\n\nwhich is an isomorphism at the level of C ∗ -algebras. Thus I(σ(a), ≤) is nat\\\n∗ (a), \u0016). Now remember that we call f (a)\nurally seen as a subset of I(C\n∗\nthe preimage of θ f by the Gelfand-Naimark isomorphism G. By the above,\nf (a) ∈ I ∩ C ∗ (a).\nSince this may be a little confusing, let us rephrase the proof. By theorem 17,\nI ∩ C ∗ (a) is seen as the set of continuous isotone functions on its spectrum,\nequipped with the order \u0016. By corollary 24, the spectrum of C ∗ (a) is identified\nwith the spectrum of a as compact spaces. If we use this identification to\ntransport \u0016 we get a partial order that is less fine than the natural order.\nThus the continuous functions that are non-decreasing for the natural order\nwill be isotone for \u0016 and have a preimage in I ∩ C ∗ (a).\n19\n\n\fFor instance let us take M = [0; 1] with the partial order x \u0016 y iff y = 1/2 or\nx = y. It is clear that \u0016 determines a closed subset of M × M and this shows\nthat M is a compact pospace, hence a toposet. We consider the I ∗ -algebra\n(I(M), C(M)). Then I(M) is the set of continuous functions on [0; 1] reaching\ntheir maximum at x = 1/2. Let a be the function a(x) = x for x ≤ 1/2,\nand a(x) = 1/2 for x ≥ 1/2. It is obvious that C ∗ (a) is the set of continuous\nfunctions on [0; 1] which are constant on [1/2; 1] and that I(M)∩C ∗ (a) contains\nthose which are maximal on [1/2; 1]. Then σ(a) = [0; 1/2] and if f is continuous\nand non-decreasing (for the natural order) on [0; 1/2] then f ◦a = f (a) belongs\nto I(M), but there are other functions in I(M) ∩ C ∗ (a). This shows that θ∗\nneed not be an isomorphism of I ∗ -algebras, and that θ need not be an orderisomorphism (which amounts to the same).\nCorollary 26 Let (I, C) be a finite dimensional I ∗ -algebra. Then I+ is the\npositive span of the set of all the projections it contains.\nPROOF. Let a ∈ I+ and (λi )1≤i≤n its sequence of eigenvalues in increasing\nP\norder. Then for all j the function hj = k≥j 1λk is positive non-decreasing on\nσ(a), so the projection hj (a) ∈ I+ . We have\na=\n\nX\n\n(λk − λk−1)hk (a) + λ1 h1 (a)\n\nk≥2\n\nThus a belongs to the positive span of all projections contained in I+ .\nLet us see some other applications to proposition 23.\nCorollary 27 Let (I, C) be an I ∗ -algebra, and c, c′ ∈ I+ . If [c, c′ ] = 0 then\ncc′ ∈ I+ .\nPROOF. This is obvious by the proposition since for any toposet the set of\npositive continuous isotonies is stable by product.\nThis easily entails the next corollary.\nCorollary 28 Let I be a pre-isocone of a commutative C ∗ -algebra A. Let us\nwrite C ∗ (I) for the smallest sub-C ∗ -algebra of A containing I. Then C ∗ (I) =\nSpan(I).\nThis says that when I is a pre-isocone of a commutative C ∗ -algebra B, then\n(I, C ∗ (I)) is an I ∗ -algebra. Remember that given a preordered topological\nspace M we were able to define a reduced space Mred which is a toposet,\n20\n\n\ftogether with a continuous isotone projection p : M → Mred . Now in the case\nof a pre-ordered M, the set I(M) is a pre-isocone of C(M) and it is easy to\nsee that the quotient M → Mred corresponds to the embedding (I, C ∗ (I)) ֒→\n(I, B).\nProposition 29 Let I be a pre-isocone of a commutative C ∗ -algebra B and\nlet A = C ∗ (I). Then B̂red is canonically isomorphic to Â as a toposet.\n\nPROOF. Let us just sketch the proof. Thanks to the Gelfand-Naimark theorem we can focus on the case where B = C(M) and A ≃ C(N), with N a\nquotient space of M. The hypotheses furnish a preorder on M and a partial\norder on N for which N is a toposet and the quotient map is isotone. Moreover, each element of I(M) = I obviously descend to I(N) = I. Therefore, the\nuniversal property of the reduced toposet (in the version quoted as a remark\nafter theorem 5) is satisfied.\n\nAnother application is the Nachbin compactification. Let M be a completely\nregular ordered space. That is :\n(1) If ∀x, y ∈ M, ∀f : M → [0; 1] isotone and continuous, f (x) ≤ f (y) then\nx ≤ y.\n(2) ∀x ∈ M, ∀V neighbourhood of x, there exist f and g two continuous\nmaps from M to [0; 1] such that f is isotone and g is antitone, and such\nthat f (x) = g(x) = 1, and f (y) ∧ g(y) = 0 for all y ∈ M \\ V .\nFirst we remark that the first condition required to be a completely regular\nordered space is clearly equivalent to the definition of a toposet. A second\nobvious remark is that the second condition implies (by considering h = f ∧ g)\nthat a completely regular ordered space is completely regular as a topological\nspace, and since it is also Hausdorff by the first condition, it is a Tychonoff\nspace.\nNachbin proved an extension of the Stone-Čech compactification for these\nspaces.\nTheorem 30 (Nachbin)\nLet M be completely regular ordered space. Then there exists a compact toposet\nνM, unique up to isomorphism, such that :\n(1) νM is an order-compactification of the topological space M, i.e. there is\na natural inclusion map i : M → νM, which is an order-embedding and a\nhomeomorphism onto its image, and such that i(M) is everywhere dense\nin νM.\n21\n\n\f(2) The following universal property is satisfied : for each continuous isotony\nF from M to a compact toposet T , there exists a continuous and isotone\nF̃ : νM → T such that F = F̃ ◦ i (i.e. the following diagram commutes).\nF\n\nM\ni\n\n\u000f {\n\n/\n{= T\n\n{\n{ F̃\n\nνM\n\nWe wish to recover this theorem by an isocone construction. We could consider\nthe couple (Ib (M), B), where B = Cb (M) stands for the set of continuous\nbounded functions from M to C, but it is not necessarily an I ∗ -algebra. Indeed,\nlet us call A = Span(Ib (M)). Then A is a closed subalgebra of B, and hence\na C ∗ -algebra itself. But A 6= B in general. For instance if M = R with the\nnatural order, then it is easy to see that f ∈ A ⇒ limx→±∞ f (x) both exist.\nOn the other hand, Ib (M) is clearly a pre-isocone. Thus, (Ib (M), A) is an I ∗ algebra by corollary 28. By theorem 17 we have (Ib (M), A) ≈ (I(Â), C(Â))\nfor a compact toposet Â. What is the relation between M and Â ? Using\nproposition 29 we clearly have Â = B̂red . Moreover we know that B̂ = βM is\nthe Stone-Čech compactification of M. We will show below that Â is also the\nNachbin compactification of M.\nTheorem 31 Let M be a toposet which is completely regular as an ordered\nspace. Let A and B be defined as above. Write βM for the Stone-Čech compactification B̂ of M, and νM for its Nachbin compactification. Then :\n(1) Â is canonically isomorphic to νM.\n(2) Let \u0016 be the preorder on βM defined by Ib (M), i.e. φ \u0016 φ′ if, and only if,\n∀a ∈ Ib (M), φ(a) ≤ φ′ (a). Then νM is the reduced toposet βMred with\nrespect to this preorder.\n\nPROOF. The second assertion is obvious given the first. We summarize what\nwe already know from usual C ∗ -theory and from what we said above in the\nfollowing commutative diagram, where Â is a compact toposet, p a continuous\nisotone surjection, the continuous maps ǫ and i are given by x 7→ evx and ǫ is\ninjective.\n\nβM\nw;\nw\nww\nww\nw\nw\nǫw\np\nw\nww\nw\nww\nww\n\u000f\u000f\n- ww\ni\n/\nM\nÂ = βM\n\nred\n\n22\n\n\fNow i is also injective precisely because M is a toposet. If f ∈ C(Â) ≃ A\nvanishes on i(M), then clearly f = 0. This shows that i(M) is dense in Â,\nsince we can use Urysohn's lemma in the compact and thus completely regular\nspace Â.\nWe now show that i is a homeomorphism onto its image. Indeed, take U\nan open set in M and x ∈ M. Then use complete regularity of the ordered\nspace M to find f and g as in the definition (note that g ∈ A). The set\nO = {φ ∈ Â|φ(f ) > 0, φ(g) > 0} is a ∗-weak open set. This shows that\nV = i(M)∩O is an open set for the induced topology on i(M) and furthermore,\nit is clear that i(x) ∈ V and thanks to properties of f and g, V ⊂ i(U). Thus,\ni(U) is open, proving that i is a homeomorphism.\nNow the partial order on Â is defined by :\nφ ≤ φ′ ⇔ ∀f ∈ I, φ(f ) ≤ φ′ (f )\n\nSpecializing to φ = evx and φ′ = evy , we see that i is an order-embedding.\nThis already shows that Â is an ordered compactification of M.\nNow let us prove that βMred satisfies the same universal property as νM. For\nthis, let F be a continuous isotony to a compact toposet T . Using the fact that\nSpan(I(T )) is dense in C(T ), we see that for any ψ ∈ C(T ), ψ ◦ F ∈ A. Take\nχ ∈ Â and define F̃ (χ) := [ψ 7→ χ(ψ ◦ F )]. It is clear that F̃ is continuous map\n[) = T extending F , where we allow ourselves to identify spaces\nfrom Â to C(T\nisomorphic in a well-behaved way with respect to every map in sight. Now let\nχ ≤ χ′ in Â. Then F̃ (χ) ≤ F̃ (χ′ ) iff ∀φ ∈ I(T ), χ(φ ◦ F ) ≤ χ′ (φ ◦ F ), which\nis true by definition of the order on Â. Thus F̃ is isotone and the theorem is\ntrue.\n\n6\n\nNoncommutative causal toposets\n\nWe now look for a noncommutative generalization of causal sets. Let us first\nrecall the definition of these objects.\nDefinition 32 A causal set is a poset P which is locally finite, i.e. ∀x, y ∈ P ,\n{z ∈ P |x ≤ z ≤ y} is finite. We will say that P is a causal toposet if P is a\nlocally finite toposet.\nNote that a causet does not have a topology defined on it. However, if we stick\nto finite causets, the discrete topology naturally endows them with a toposet\nstructure. The dual object of a finite causet is obviously a finite dimensional\ncommutative I ∗ -algebra. Thus, the noncommutative generalization of a finite\n23\n\n\fcauset is just a finite dimensional I ∗ -algebra. This is a special case, but it\nis the most useful one. Indeed, a causet appearing in a quantum theory of\ngravity will certainly be finite, or at most be a countable inductive limit of\nfinite causets. In this last case, the noncommutative version would be a countable projective limit of finite dimensional I ∗ -algebras. However, this definition\nis unsatisfactory because the inductive limit is not canonically defined. For\nthis reason, and also for the sake of generality, we need to look for a dual\nformulation of the local finiteness condition of causal sets.\nFirst, we recall a few definitions. In a poset P , the set {z ∈ P |x ≤ z ≤ y}\nis called a closed interval. A poset is called bounded if it has a greatest and a\nlowest element. A subposet M ⊂ P is called a gem 3 if it is a bounded poset\nfor the induced order. Note that a subposet M is called bounded if it has a\nupper and a lower bound in P , so that a gem is not just a bounded subposet.\nThus we can say that a causal set is a poset in which every closed interval is\nfinite. Since a closed interval is a gem, and each gem is contained in a closed\ninterval, it is clear that P is a causal set iff P is a poset in which every gem\nis finite.\nProposition 33 If M is a compact bounded toposet 4 , then :\n(1) ∀f, g ∈ I+ (M), kf + gk = kf k + kgk\n(2) ∀f, g ∈ I+× (M), kf −1 + g −1k = kf −1 k + kg −1 k\nConversely, if (I, C) is a commutative I ∗ -algebra such that :\n(1) ∀f, g ∈ I+ , kf + gk = kf k + kgk\n(2) ∀f, g ∈ I+× , kf −1 + g −1 k = kf −1 k + kg −1k\nthen (Ĉ, ≤I ) is a compact bounded toposet.\nPROOF. For the first part, let a be the least and b the greatest element of\nM. Then every element of I(M) will attain its minimum at a and its maximum\nat b. The result follows.\nFor the converse, we can use theorem 17 and consider only the case where\nC = C(M), I = I(M) with M a compact toposet. Let us show that M is\nbounded. Let f, g ∈ I+ . Then kf +gk is attained at some x ∈ M by compacity.\nSo, using the hypothesis, kf + gk = f (x) + g(x) = sup f + sup g which easily\nentails that f and g reach their respective suprema at the same point x. By\n3\n\nThis terminology is particular to us, and has been suggested by the shape of the\nHasse diagram of such a subposet. We hope not to be in conflict with any existing\nvocabulary.\n4 That is, M is compact as a topological space and bounded as a poset.\n\n24\n\n\finduction, one can show that ∀f1 , . . . , fn ∈ I+ , ∃x ∈ M such that f1 , . . . , fn\nall reach their sup at x. For all f ∈ C+ , write S(f ) = {x ∈ M|f (x) = kf k}.\nObviously, S(f ) is a closed subset of M. We have shown that\n∀f1 , . . . , fn ∈ I+ ,\ntherefore\n\n\\\n\nf ∈I+\n\nn\n\\\n\ni=1\n\nS(fi ) 6= ∅\n\nS(f ) 6= ∅\n\nby compacity of M. Let b belong to this intersection. Let x ∈ M. For all f ∈ I,\nf + kf k ∈ I+ and one has f (x) + kf k ≤ f (b) + kf k by definition of b. Since\nM is a toposet, this shows that x ≤ b. Consequently, b is a maximal element\nfor M.\nThe proof that there exists a minimal element is similar, using sup(1/f ) =\n1/ inf(f ), which is valid for f ∈ I+× .\nSince the dual formulation of boundedness does not use commutativity of the\nalgebra, this motivates the following definition :\nDefinition 34 An I ∗ -algebra (I, A) is said to be co-bounded if\n(1) ∀a, b ∈ I+ , ka + bk = kak + kbk\n(2) ∀a, b ∈ I+× , ka−1 + b−1 k = ka−1 k + kb−1 k\nHowever it is much easier in practice to use the following equivalent formulation in terms of pure states :\n(1) ∀a, b ∈ I+ ,\n(2) ∀a, b ∈ I+ ,\n\nsup φ(a + b) =\nφ∈PS(A)\n\ninf\n\nφ∈PS(A)\n\nsup φ(a) + sup φ(b),\nφ∈PS(A)\n\nφ(a + b) =\n\ninf\n\nφ∈PS(A)\n\nφ∈PS(A)\n\nφ(a) +\n\ninf\n\nφ∈PS(A)\n\nφ(b).\n\nFor a noncommutative example of a co-bounded I ∗ -algebra, take any I ∗ algebra (I, C) and then consider the C ∗ -algebra A = C ⊕ C ⊕ C, and define\nF to be set of hermitian elements of A of the form λ ⊕ a ⊕ μ, with a ∈ I,\nλ ≥ kak and μ ≤ inf φ(a). It is readily verified that (F, A) is a co-bounded\nφ∈PS(A)\n\nI ∗ -algebra. In the commutative case this construction is dual to the adjunction\nof topologically isolated top and a bottom elements to a compact toposet.\n\nNow every inclusion M ֒→ P of a gem into a toposet corresponds to surjective\nI ∗ -morphism going in the other direction. Thus the dual notion of co-gem is\nnaturally defined as follows.\nDefinition 35 Let (I, A) be an I ∗ -algebra. A co-gem of (I, A) is a quotient\nof (I, A) which is co-bounded.\n25\n\n\fAnd we finally arrive at the noncommutative version of a \"causal toposet\",\nthat is, a toposet which is also a causet.\nDefinition 36 A causal I ∗ -algebra is an I ∗ -algebra such that each of its cogems is finite-dimensional.\nTo go from causal toposets to causal sets, we could try to see if a causet is\ncanonically a toposet for a topology generated by the order in some way. This\nis a direction we look forward to exploring. Note that the correspondence\nbetween causal toposets and causal algebras is functorial, contrarily to the\ncorrespondence with incidence algebras explored in [9].\n\n7\n\nIsocones on M2 (C)\n\nWe will now focus on the simplest possible cases of noncommutative I ∗ algebras, namely ones with M2 (C) as algebra. For a finite-dimensional abelian\nC ∗ -algebra, there is only a finite number of possible isocones, in one-to-one\ncorrespondence with the different partial orders on the character space, which\nis finite. Now we will see already with the case of M2 (C) that there is an\n(uncountably) infinite number of different isocones.\nWe use the basis of Re M2 (C) given by the Pauli matrices :\n\n0\n\nσ = I2 =\n\n\u0012\n\n\u0013\n\n1 0\n, σ1 =\n0 1\n\n\u0012\n\n\u0013\n\n0 1\n, σ2 =\n1 0\n\n\u0012\n\n\u0013\n\n0 −i\n, σ3 =\ni 0\n\n\u0012\n\n1 0\n0 −1\n\n\u0013\n\nWe let T = SpanR {σ 1 , σ 2 , σ 3 } be the space of traceless matrices. If I is an\nisocone of M2 (C) (it makes no difference if it is weak or strong, as we will\nsee), then C = I ∩ T is obviously a closed convex cone in T . Moreover, since\nI satisfies axiom 3, it must contain a 4-ball B. If a is the center of B, then\n(B − 21 Tr(a)σ 0 ) ∩ T is a 3-ball contained in C. Thus we have a well-defined\nmap φ : I → Γ, from the set I of (strong or weak) isocones of M2 (C) to the\nset Γ of closed convex cones with non-empty interior in T ≃ R3 .\nTheorem 37 The map φ is a bijection with φ−1 given by C 7→ C + Rσ 0 .\nPROOF. The fact that C 7→ C + Rσ 0 defines an inverse to φ is immediate\nprovided we prove that C + Rσ 0 is an isocone when C belongs to I. All\naxioms except 2e are directly seen to be satisfied. It turns out that 2e is\nthen automatically true. Indeed, it is an easy exercise to prove that for all\n26\n\n\fa, b ∈ Re M2 (C) :\nand\n\na ∨ b = αa + (1 − α)b + βσ 0\na ∧ b = (1 − α)a + αb − βσ 0\n\nwith α ∈ [0; 1] and β ∈ R+ . This shows that for a subset of Re M2 (C), the\naxioms 2c, 2d and 2f of isocones imply 2e. In particular, there is no difference\nbetween strong and weak isocones in M2 (C).\n\nSince a convex cone in T is characterized by its intersection with the unit\nsphere Σ of this space, it is also possible to classify the isocones of M2 (C) by\nthe subsets of Σ which are closed, have a non-empty interior (for the topology\nof the sphere), and are either the whole sphere or a geodesically convex subset\nof a closed half-sphere. If K is a subset of Σ of the sort just mentioned, we\nwrite IK for the isocone it generates, that is : IK = R+ K + Rσ 0 .\nIt is is easy to classify I ∗ -algebra structures up to isomorphism. Indeed, any\n∗-automorphism of M2 (C) is of the form a 7→ pap∗ , with p ∈ SU(2) and induce\na rotation of T . Thus the list of isocones given by theorem 37, up to rotations,\ngives the list of isomorphism classes of I ∗ -algebra structures on M2 (C). In particular, the automorphisms of (IK , M2 (C)) are given by those rotations which\nleave K invariant. In the commutative case, the automorphisms correspond\nby duality to the order-automorphisms of the underlying toposet. We see that\nthe automorphism group is much larger in the noncommutative case.\nGiven a set K of the above kind, and a corresponding isocone IK , one can\nwonder what is the induced partial order relation ≤IK on the set of pure states\nof M2 (C). It turns out that it has a simple geometric interpretation.\nRecall that the pure states space of M2 (C) is P 1 (C), and that for each unit\nvector ξ in C2 with class [ξ] in P 1 (C) the corresponding state is given by\nφ[ξ] (m) = ξ ∗ mξ. Now it is easy to see that\nφ[ξ] ≤IK φ[η] ⇔ ∀m ∈ K, φ[ξ](m) ≤ φ[η] (m)\n→\nThis shows that ≤IK =≤K . Moreover, if we write −\nm for the column vector of\n1\n2\n3\ncoordinates of m in the basis (σ , σ , σ ), then by a direct calculation we find\n→\n−\n→\n−\n→\nthat φ[ξ] (m) = −\nm. h ([ξ]), where h : P 1 (C) → S 2 is the isomorphism between\nP 1 (C) and S 2 induced by the Hopf fibration :\n\n2Re (ξ ̄1 ξ2 )\n→\n−\n\n\nh ([ξ1 , ξ2 ]) =  2I(ξ ̄1 ξ2 ) \n|ξ1|2 − |ξ2 |2 )\n\n\n27\n\n\f→\n−\n→\n−\n→\n→\nThus we have φ[ξ] ≤K φ[η] ⇔ ∀m ∈ K, −\nm. h ([ξ]) ≤ −\nm. h ([η]). If we set d(a, b)\nfor the geodesic distance between the points a and b in S 2 , we then have\n→\n−\n→\n−\n→\n→\nφ[ξ] ≤K φ[η] ⇔ ∀m ∈ K, d(−\nm, h ([ξ])) ≥ d(−\nm, h ([η]))\n\n(6)\n\nNow, since the Hopf fibration takes the canonical metric of the sphere to the\nFubini-Study metric of P 1 (C) (up to an irrelevant scale factor), we finally\nobtain\nφ[ξ] ≤K φ[η] ⇔ ∀x ∈ K ′ , δ(x, [ξ]) ≥ δ(x, [η])\n\n(7)\n\n→−1\n−\nwhere K ′ = h (K) and δ is the Fubini-Study metric.\nRemark : This kind of order relation can be generalized to any metric space.\nLet us say that a subset K of a metric space E is GPS-complete if any point x\nin E is uniquely characterized by the set of distances d(x, z) with z ∈ K. Then,\ndefine the GPS-ordering ≤K to be the relation x ≤K y iff d(x, z) ≤ d(y, z) for\nall z ∈ K. This relation is an order relation thanks to the GPS-completeness\nproperty of K, and it turns E into a toposet since the functions x 7→ d(x, z)\nare continuous, isotone, and determine the order. This furnishes a abundant\nsupply of toposets.\nAnother question we can ask is what is the order induced on the spectrum\n∗\nof a transverse normal element n. Take n such that n∗ n = nn\n\u0012 , and call\n\u0013 p a\nλ\n0\n1\nunitary matrix diagonalizing n such that n = pdp∗ with d =\nwith\n0 λ2\n\u0012 \u0013\n\u0012\n\u0013\nz1\n−z̄2\nλ1 6= λ2 . Let us write ξ =\nand ξ ′ =\nfor the columns of p. With\nz2\nz̄1\n→\n−\n→\n−\nthis choice one has pσ 3 p∗ = h ([ξ]) = − h ([ξ ′ ]). Thus we have\n1\n→\n−\nx = ((λ1 + λ2 )σ 0 + (λ1 − λ2 ) h ([ξ]))\n2\n\n(8)\n\n→\n−\nand Re C ∗ (n) = SpanR {σ0 , h ([ξ])}. We see that n is transverse if and only\n→\n−\nif the line R h ([ξ]) cuts K. Since the intersection point will act as an isotone\n→\n−\nfunction on σ(n), and h ([ξ]) = pσ 3 p∗ acts on σ(n) by λ1 7→ 1 and λ2 7→ −1,\nwe have, writing \u0016 for the induced order on σ(n) in case n is transverse :\n(1)\n(2)\n(3)\n(4)\n\nIf\nIf\nIf\nIf\n\n−\n→\nh ([ξ]) ∈ K, then λ2 \u0016 λ1 .\n→\n−\n− h ([ξ]) ∈ K, then λ1 \u0016 λ2 .\nboth belong to K then λ1 ∼ λ2 .\nneither belong to K then n is not transverse.\n28\n\n\fIn particular, for a hermitian element x, we see thanks to (8) that x is transverse if and only if x ∈ I, or −x ∈ I. If x ∈ I and −x ∈\n/ I then we can directly\ncheck that the order induced on σ(x) = {λ1 ; λ2 } is the natural order of R, in\naccordance with proposition 24, whereas it is the dual order if −x ∈ I and\nx∈\n/ I.\nWe can give a quantum mechanical interpretation of this fact. Let us consider\na two-state system characterized by the values of an observable x. When observed, the system can be found in the state [t] (for top), corresponding to\nthe largest eigenvalue of x, or [b] (for bottom), corresponding to the smallest\neigenvalue. We can see [t] and [b] as the north and south poles of the pure state\nspace P 1 (C) identified with a sphere. Now any isocone of the form IK with K\n→\n−\ncontaining the north pole (that is, h ([t])) in its interior will induce a partial\norder on P 1(C) which will extend the relation [b] < [t] to the quantum superpositions of these two states. A natural choice for K would be the geodesic disk\nof radius ǫ, for any ǫ ∈]0; π/4] (remember that π/4 is the distance from the\npole to the equator in the Fubini-Study metric). It is then easy to check that,\nfor any pure state [ξ], if d([b], [ξ]) < 2ǫ then [b] ∼ [ξ], if d([b], [ξ]) ≥ 2ǫ, then\n[b] ≤K [ξ], and similarly, if d([t], [ξ]) < 2ǫ, then [t] ∼ [ξ], and if d([t], [ξ]) ≥ 2ǫ,\n[ξ] ≤K [t]. Now when the system is in the state [ξ], the probability that it will\ncollapse to [t] when x is measured is cos2 (d([ξ], [t])). Thus, we have just seen\nthat for the order ≤K with our choice of K, a state [ξ] is smaller that [t] (or\nlarger than [b]) if the probability that it will collapse to the other eigenstate\nis larger than some level dependending on ǫ, namely 1 − cos2 (2ǫ).\n8\n\nConclusion\n\nIn this paper we have seen that it is possible to add a line corresponding\nto a class of ordered space in the algebra/geometry dictionary set up by the\nnoncommutative geometry programme. Not only is it possible, but it is indeed\nquite natural, at least at the level of generality where we have settled.\nOn the mathematical side many questions arise. To quote only a few, we\nwould like to know if the nice geometric characterization of isocones on M2 (C)\nsurvives in any way in more elaborate examples. It is not completely hopeless.\nIndeed, though the pure state space PS(A) of a C ∗ -algebra A does not suffice\nto characterize the algebra in the noncommutative case, it is possible to add\nmore structures on PS(A) (namely its uniform structure, an orientation and\ntransition probabilities, see [14]) so that it does. In our context, it is natural\nto expect that (I, A) will be completely determined by its pure states space if\nwe add a toposet structure compatible in some way with these data. It would\nalso be interesting to know if the definition of morphisms can be relaxed. It\nis also clear that more examples of noncommutative I ∗ -algebras are needed.\n29\n\n\fWork in this direction is in progress.\n\n9\n\nAcknowledgement\n\nWe would like to thank the anonymous referee for his interesting suggestions\nand remarks.\n\nReferences\n[1] F. Besnard, Canonical quantization and the spectral action : a nice example, J.\nGeom. Phys. 57, 9 (2007), 1757, gr-qc/0702049\n[2] J. Ambjorn, J.L. Nielsen, J. Rolf, R. Loll, Euclidean and Lorentzian Quantum\nGravity : Lessons from Two Dimensions, Chaos Solitons Fractals 10 (1999),\n177, hep-th/9806241\n[3] A. Strohmaier, On Noncommutative and semi-Riemannian Geometry, J. Geom.\nPhys. 56 (2006), 175, math-ph/0110001\n[4] E. Hawkins, Hamiltonian gravity and noncommutative geometry, Commun.\nMath. Phys. 187 (1997) 471, gr-qc/9605068\n[5] T. Kopf, Spectral geometry and causality, Int. J. Mod. Phys. A 13 (1998), 2693,\ngr-qc/9609050\n[6] V. Moretti, Aspects of noncommutative Lorentzian geometry for globally\nhyperbolic spacetimes, Rev. Math. Phys. 15 (2003), 1171, gr-qc/0203095\n[7] D. Malament, The class of continuous timelike curves determines the topology\nof spacetime, J. Math. Phy. 18, no 7 (1977), 1399\n[8] R. Sorkin, Causal Sets: Discrete Gravity (Notes for the Valdivia Summer\nSchool), gr-qc/0309009\n[9] R. Sorkin, Indecomposable Ideals in Incidence Algebras, Mod. Phys. Lett. A18\n(2003), 2491, math.CO/0309126\n[10] L. Nachbin, Topology and Order, D. Van Nostrand Company, 1965\n[11] J. K. Beem, P.E. Eherlich, K.L. Easley, Global Lorentzian Geometry (Second\nEdition). Marcel Dekker Inc. (1996), p. 64.\n[12] A. Bernal, M. Sanchez, Further results on the smoothability of Cauchy\nhypersurfaces and Cauchy time functions, Lett. Math. Phys. 77 (2006), no.\n2, 183-197, gr-qc/0512095\n[12] R.V. Kadison, Order properties of bounded self-adjoint operators, Proc. Am.\nMath. Soc. 2 (1951), 505-510\n\n30\n\n\f[13] S. Sherman, Order in operator algebras, Amer. J. Math. 73 (1951), 227-232\n[14] F. Schultz, Pure States as Dual Objects for C ∗ -algebras, Proc. of Symposia in\nPure Math., vol. 38 (1982), part 1\n\n31\n\n\f"}