{"id": "http://arxiv.org/abs/1102.4241v3", "guidislink": true, "updated": "2012-10-17T09:18:07Z", "updated_parsed": [2012, 10, 17, 9, 18, 7, 2, 291, 0], "published": "2011-02-21T14:52:34Z", "published_parsed": [2011, 2, 21, 14, 52, 34, 0, 52, 0], "title": "Support of Interactive 3D/4D Presentations by the Very First Ever Made\n  Virtual Laboratories of Antennas", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1102.2879%2C1102.0120%2C1102.3538%2C1102.2029%2C1102.1191%2C1102.1378%2C1102.3728%2C1102.5497%2C1102.0667%2C1102.5224%2C1102.3755%2C1102.4772%2C1102.4228%2C1102.2614%2C1102.0685%2C1102.1709%2C1102.5475%2C1102.4568%2C1102.1451%2C1102.1824%2C1102.3122%2C1102.5291%2C1102.3081%2C1102.5116%2C1102.4635%2C1102.0207%2C1102.3000%2C1102.5488%2C1102.2049%2C1102.2081%2C1102.1650%2C1102.0921%2C1102.0271%2C1102.5708%2C1102.1068%2C1102.2279%2C1102.1728%2C1102.4511%2C1102.4285%2C1102.0760%2C1102.2410%2C1102.4421%2C1102.4241%2C1102.3307%2C1102.1895%2C1102.5302%2C1102.4108%2C1102.1999%2C1102.3936%2C1102.2962%2C1102.4982%2C1102.0653%2C1102.0788%2C1102.0266%2C1102.2415%2C1102.0794%2C1102.2175%2C1102.2072%2C1102.1469%2C1102.2760%2C1102.5064%2C1102.2906%2C1102.2562%2C1102.3118%2C1102.2244%2C1102.0482%2C1102.3033%2C1102.1061%2C1102.4052%2C1102.3325%2C1102.3353%2C1102.5703%2C1102.0431%2C1102.5212%2C1102.0178%2C1102.1480%2C1102.5414%2C1102.0758%2C1102.4485%2C1102.3398%2C1102.0627%2C1102.1757%2C1102.1767%2C1102.3186%2C1102.5309%2C1102.3959%2C1102.3475%2C1102.4138%2C1102.2537%2C1102.4207%2C1102.1396%2C1102.1422%2C1102.2030%2C1102.4303%2C1102.1066%2C1102.3406%2C1102.1724%2C1102.4142%2C1102.2267%2C1102.4050%2C1102.0292&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Support of Interactive 3D/4D Presentations by the Very First Ever Made\n  Virtual Laboratories of Antennas"}, "summary": "Based on the experience we have gained so far, as independent reviewers of\nRadioengineering journal, we thought that may be proved useful to publicly\nshare with the interested author, especially the young one, some practical\nimplementations of our ideas for the interactive representation of data using\n3D/4D movement and animation, in an attempt to motivate and support her/him in\nthe development of similar dynamic presentations, when s/he is looking for a\nway to locate the stronger aspects of her/his research results in order to\nprepare a clear, most appropriate for publication, static presentation figure.\nFor this purpose, we selected to demonstrate a number of presentations, from\nthe simplest to the most complicated, concerning well-known antenna issues with\nrather hard to imagine details, as it happens perhaps in cases involving\nSpherical Coordinates and Polarization, which we created to enrich the very\nfirst ever made Virtual Laboratories of Antennas, that we distribute over the\nOpen Internet through our website Virtual Antennas. These presentations were\ndeveloped in a general way, without using antenna simulators, to handle output\ntext and image data from third-party CAS Computer Algebra Systems, such as the\nMathematica commercial software we use or the Maxima FLOSS we track its\nevolution.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1102.2879%2C1102.0120%2C1102.3538%2C1102.2029%2C1102.1191%2C1102.1378%2C1102.3728%2C1102.5497%2C1102.0667%2C1102.5224%2C1102.3755%2C1102.4772%2C1102.4228%2C1102.2614%2C1102.0685%2C1102.1709%2C1102.5475%2C1102.4568%2C1102.1451%2C1102.1824%2C1102.3122%2C1102.5291%2C1102.3081%2C1102.5116%2C1102.4635%2C1102.0207%2C1102.3000%2C1102.5488%2C1102.2049%2C1102.2081%2C1102.1650%2C1102.0921%2C1102.0271%2C1102.5708%2C1102.1068%2C1102.2279%2C1102.1728%2C1102.4511%2C1102.4285%2C1102.0760%2C1102.2410%2C1102.4421%2C1102.4241%2C1102.3307%2C1102.1895%2C1102.5302%2C1102.4108%2C1102.1999%2C1102.3936%2C1102.2962%2C1102.4982%2C1102.0653%2C1102.0788%2C1102.0266%2C1102.2415%2C1102.0794%2C1102.2175%2C1102.2072%2C1102.1469%2C1102.2760%2C1102.5064%2C1102.2906%2C1102.2562%2C1102.3118%2C1102.2244%2C1102.0482%2C1102.3033%2C1102.1061%2C1102.4052%2C1102.3325%2C1102.3353%2C1102.5703%2C1102.0431%2C1102.5212%2C1102.0178%2C1102.1480%2C1102.5414%2C1102.0758%2C1102.4485%2C1102.3398%2C1102.0627%2C1102.1757%2C1102.1767%2C1102.3186%2C1102.5309%2C1102.3959%2C1102.3475%2C1102.4138%2C1102.2537%2C1102.4207%2C1102.1396%2C1102.1422%2C1102.2030%2C1102.4303%2C1102.1066%2C1102.3406%2C1102.1724%2C1102.4142%2C1102.2267%2C1102.4050%2C1102.0292&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Based on the experience we have gained so far, as independent reviewers of\nRadioengineering journal, we thought that may be proved useful to publicly\nshare with the interested author, especially the young one, some practical\nimplementations of our ideas for the interactive representation of data using\n3D/4D movement and animation, in an attempt to motivate and support her/him in\nthe development of similar dynamic presentations, when s/he is looking for a\nway to locate the stronger aspects of her/his research results in order to\nprepare a clear, most appropriate for publication, static presentation figure.\nFor this purpose, we selected to demonstrate a number of presentations, from\nthe simplest to the most complicated, concerning well-known antenna issues with\nrather hard to imagine details, as it happens perhaps in cases involving\nSpherical Coordinates and Polarization, which we created to enrich the very\nfirst ever made Virtual Laboratories of Antennas, that we distribute over the\nOpen Internet through our website Virtual Antennas. These presentations were\ndeveloped in a general way, without using antenna simulators, to handle output\ntext and image data from third-party CAS Computer Algebra Systems, such as the\nMathematica commercial software we use or the Maxima FLOSS we track its\nevolution."}, "authors": ["Nikolitsa Yannopoulou", "Petros Zimourtopoulos"], "author_detail": {"name": "Petros Zimourtopoulos"}, "author": "Petros Zimourtopoulos", "arxiv_comment": "Inadequately justified rejection (with reviewers' grades: [4, 4, 3,\n  4] + [4, 4, 4, 4] + [2, 4, 4, 4] out of 3 x [5, 5, 5, 5]) from publication to\n  the Proceedings of 21st International Conference Radioelektronika 2011, April\n  19-20, Brno, Czech Republic - No changes in the paper since [v1] Mon, 21 Feb\n  2011 14:52:34 GMT (412kb): [v3] = [v2] = [v1]", "links": [{"href": "http://arxiv.org/abs/1102.4241v3", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1102.4241v3", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "cs.OH", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cs.OH", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "physics.comp-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1102.4241v3", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1102.4241v3", "journal_reference": "FunkTechnikPlus # Journal, Issue 3 - Year 1, 31 January 2014, v1,\n  7-18, otoiser ftp#j", "doi": null, "fulltext": "Support of Interactive 3D/4D Presentations by the\nVery First Ever Made Virtual Laboratories of Antennas\nNikolitsa YANNOPOULOU1, Petros ZIMOURTOPOULOS2\n1\n\n2\n\nAntennas Research Group, Palaia Morsini, Xanthi, Thrace, Hellas, EU\nAntennas Research Group, Dept. of Electrical Engineering and Computer Engineering, Democritus University of Thrace,\nV. Sofias 12, 671 00 Xanthi, Thrace, Hellas, EU\nyin@antennas.gr, pez@antennas.gr, www.antennas.gr\n\nAbstract. Based on the experience we have gained so far,\nas independent reviewers of Radioengineering journal, we\nthought that may be proved useful to publicly share with\nthe interested author, especially the young one, some\npractical implementations of our ideas for the interactive\nrepresentation of data using 3D/4D movement and\nanimation, in an attempt to motivate and support her/him\nin the development of similar dynamic presentations, when\ns/he is looking for a way to locate the stronger aspects of\nher/his research results in order to prepare a clear, most\nappropriate for publication, static presentation figure. For\nthis purpose, we selected to demonstrate a number of\npresentations, from the simplest to the most complicated,\nconcerning well-known antenna issues with rather hard to\nimagine details, as it happens perhaps in cases involving\nSpherical Coordinates and Polarization, which we created\nto enrich the very first ever made Virtual Laboratories of\nAntennas, that we distribute over the Open Internet\nthrough our website Virtual Antennas. These presentations\nwere developed in a general way, without using antenna\nsimulators, to handle output text and image data from\nthird-party CAS Computer Algebra Systems, such as the\nMathematica commercial software we use or the Maxima\nFLOSS we track its evolution.\n\nKeywords\nAntennas, virtual laboratories, dynamic presentation,\ninteractive presentation.\n\n1. Introduction\nThe very first ever made Virtual Laboratories of\nAntennas, which are available on the Internet through\nVirtual Antennas website [1], are exclusively based on our\nalternative form of Antenna Theory [2], and are founded,\nby applying the learning by teaching method to Antennas\neducation [3], in order to support the quick comprehension\nof 3D space matters unavoidably related to antennas. The\ninitial material of Virtual Antennas was prepared during the\nyears 1996-1997 and presented to Antenna students during\n\nthe spring semester of 1998 [4]. On 1999, the existence of\nthis visual material was announced to the first ever\nappeared on the web EMLIB Electromagnetics Library,\nmaintained those years by Jet Propulsion Laboratory of\nNASA [5]. On the same year, all of the material was\napproved for inclusion to MathSource repository of\nMathematica [6]. Since 2000 and until today, the Virtual\nAntennas material is constantly increased and improved.\nMoreover, a number of websites either use this material or\nsuggest its use [7]. On 2009, a sample of its current\ndevelopment state was approved for publication by the\nWolfram Demonstrations Project [8], an event that was\nannounced in our Creative Commons Network web pages\n[9]. During the last years, our voluntary reviewing work\nrevealed some needs of potential authors -especially the\nyoung ones- related to the presentation of their research\nresults, which perhaps may be confronted by similar to our\ninteractive presentation techniques, and thus we decided to\npresent in this paper our continuing work for the Virtual\nLaboratories of Antennas.\n\n2. Presentation Development and Use\nThe implementation of a presentation idea demands\nthe expression of the theoretical idea formulation in the\nCAS language we select to produce output data in the\nappropriate file format for movement or/and animation (we\nwould like to emphasize that in the case of Mathematica we\nuse, while we abandoned the package written by Novak\n[10], we still run the one written by Donley [11]). These\nfiles are: (a) WRL (WoRLd: Open by Web3D Consortium),\na plain text file with a known structure described in the\nVRML Virtual Reality Modeling Language [12] for a\nvisual object, (b) a bunch of images in a selected nondestructive format; usually BMP, and (c) NBP text file\n(Note Book Player: Mathematica proprietary). After that,\nthe development of the presentation requires: (a) either a\ntext editor to correct bugs or to add special features into\nWRL output file, (b) a graphics editor to align images or\ncorrect blemishes, as well as, a video editor to handle these\nimages as frames of the final movie file in a selected\nformat, usually AVI (Audio Visual Interleave: Microsoft\n\n\fproprietary). It is worth to notice that according to our\nexperience, the non-computing time needed: (a) to design\nthe idea implementation, has been reduced by the years,\nfrom a couple of weeks at the beginning to just a couple of\ndays now, and (b) to develop the presentation, after a\ntedious, routine work of editing each frame, varies\nconsiderably according to the frame theme, e.g. from 1.5\nminutes for that in Fig. 7, to 10 minutes of Fig. 10.\nThe software needed for presentations to work under\nMS Windows is: a web browser (MS-IE 3.02r+), a VRML\nviewer add-on to that browser (WorldView 2.1), an AVI\nplayer (Mplayer2), and the Mathematica 7 Notebook\nPlayer.\n\nFig. 2-right shows a screen-shot of a WRL\npresentation of a 4D space-time asynchronous movement\nfrom a view-point in the 1st-octant, for the triples of SCS\nunit vectors in the shown directions, that is 13 triples on the\nCCS main-planes, as well as, 2 undefined triples on the\nirregular z-axis of the CCS-to-SCS transformation.\nFig. 2-left shows a screen-shot of a WRL presentation\nof 4D space-time asynchronous movement from a view\npoint in the 1st-octant, of the 3D difference volume element\nformed by adjacent SCS coordinate surfaces and lying\nbetween the 1st and 2nd octant.\n\n3. 3D/4D Presentation Samples\nIn order to abbreviate the figure descriptions in the\nfollowing, we have to notice that: (a) for every animation\npresentation, a typical full-window screen capture of the\nrecommended AVI player is shown after its pause button\nwas pressed, (b) for every movement presentation, a typical\nfull-window screen capture of the recommended online\nWRL viewer, with a cursor perhaps to indicate the\nexistence of an additional feature, and (c) for both\npresentation types, the basic colors (R, G, B) are used in\nthat order to correspond either to the CCS Cartesian\nCoordinate System (x, y, z) axes, (xoy, yoz, zox) planes,\nand its unit vectors, or to the SCS Spherical Coordinate\nSystem (r-radius, theta-semi-circle, phi-circle) curves, (rsphere, theta-semi-cone, phi-semi-plane) surfaces, and its\nunit vectors, while the same color correspondence holds for\nthe radiation pattern cuts by the mentioned CCS planes or\nSCS surfaces.\n\nFig. 1. Current waves - Standing current-voltage waves relation.\n\nFig. 2. SCS: Volume element - Unit vectors.\n\nAfter that, short descriptions of the samples, are\nfollowing, while all of these presentations will be always\navailable in authors' group repositories in Virtual Antennas\n[13] and GoogleCode [14].\n\nFig. 3-left shows a screen-shot of a WRL presentation\nof a 4D space-time asynchronous movement from a viewpoint in the 1st-octant, for all 3 SCS surfaces, curves, and\nunit vectors in a direction of the 1st- octant.\n\nFig. 1-left shows 1 frame out of 12 of an AVI\nrepeated-for-ever animation for the 3D plane-time\npresentation of the considered as time-harmonic sinusoidal\ncurrent wave amplitude, on a 3 wavelengths portion of a\nlong thin wire loop antenna terminated on some complex\nimpedance. The propagated current wave p is decomposed\nin the dual couples: (incident wave i, reflected wave r) and\n(standing wave s, transmitted wave t), while the imposed\nletters and arrows on the figure indicate these current waves\nas well as the direction of their motion.\n\nFig. 3-right, shows 1 frame out of 37 of an AVI\nanimation for the 4D plane-time presentation of a SCS phicircle curve as the intersection between 2 SCS surfaces, that\nis of a r-sphere and a theta-semi-cone, while theta angle\n-which changes from 0° to 180°- has the value of 50°.\nDifferent colors illustrate the inner and outer surfaces of the\nr-sphere and a cut off spherical section between adjacent\nmeridians permit us to see the interior of that sphere.\n\nFig. 1-right shows a screen-shot of a WRL\npresentation with 5 additional predefined view points of 12\nframes animation, as the cursor indicates, of a 4D spacetime asynchronous movement, from a view-point in the 1stoctant. In essence, this presentation is an alternative\ngeometric meaning of the considered as standing wave\ncurrent on an adequate length of a thin wire dipole antenna.\n\nFig. 4-left shows a screen-shot of a WRL presentation\nof a 4D space-time asynchronous movement for three\ndifferent polarizations at three different points: linear,\ncircular and elliptical on each of the coordinate axes x, y\nand z respectively to emphasize that, in general, the\npolarization of an antenna is not constant.\nFig. 4-right shows 1 frame out of 20 of an AVI\nanimation for the 4D space-time presentation of the nonlinearly CCW polarized time-harmonic real electric field E,\nfrom an antenna, as well as, its decomposition to two\n\n\flinearly polarized time-harmonic real electromagnetic\nfields, as they are uniquely defined by the constant of time\nlinearly independent space vectors Ec and Es.\nFig. 5-left shows the last frame out of 23 of an AVI\nanimation for the 4D space-time presentation of the path\ntraced by the electric far-field arrow tip, which is CW\nelliptically polarized in the direction of y-axis.\n\nFig. 7 shows 4 frames out 38 of an AVI animation for\nthe 4D space-time presentation of the space radiation\npattern and its three main-planes cuts, for the specific case\nof an antenna consisting of 2 dipoles, with the same\ndirection of the unit vector (0.2, 0.4 0.894), each of 2.4λ\nlength long, with their centers placed 0.25λ apart on an axis\nwith a unit directional vector (0.3 0.5 0.812), fed with a 30°\ncurrent phase difference.\nFig. 8 shows a screen-shot of a WRL presentation\nwith 1 additional predefined view point of 12 frames\nanimation possibility, as the cursor indicates, of a 4D\nspace-time asynchronous movement, from a view-point in\nthe 1st-octant. This presentation concerns the interior of an\nanechoic chamber and imitates a discone antenna rotation\nin order to visualize the way by which the measurement of a\nplane-cut of its radiation pattern is accomplished.\n\nFig. 3. SCS: Coordinate curves, surfaces and unit vectors.\n\nFig. 5-right shows 1 frame out of 19 of an AVI for the\n4D space-time presentation of a normalized CCW\nelliptically polarized electromagnetic far-field in the shown\ndirection of propagation, from a point of view in the 1st\noctant of an observer mirrored to (r, theta) plane.\nFig. 6 shows 3 frames out of 73 of an AVI for the 4D\nspace-time presentation of the direction dependency of\nantenna polarization from a center fed short crossed dipoles\non y and z axes, which have a current phase difference of\n90°. The three different polarizations are shown with their\norientation for an observer on the xOy plane (theta =\n90°) and in three different phi angles of 0°, 240° and 270°.\n\nFig. 4. Polarization: Directional dependence - Non-linear CCW.\n\nFig. 9 shows a sophisticated combination of a\nmovement with an animation presentation, which in fact is\nan application that was developed using the version 7 of\nMathematica, in a way that permits the definition of any\n(theta, phi) direction in space for a dipole of variable\nlength. Notably, this application has all the available\nVRML movement features, with 6 predefined view points,\nwhile 3 different animations can be run simultaneously. In\naddition, the mesh, opacity, rendering goal, and the\nevaluation step for the radiation pattern can be also defined.\nFig. 10 shows the last frame out of 100 of an AVI for\nthe 4D space-time presentation of a detailed study for some\nof the linear dipole characteristics regarding the plane and\nspace radiation patterns, the direction from the dipole axis\nof their first common maximum, the directivity, and the\ninput radiation resistance; this really is a 4-tuple of frames.\n\nFig. 5. Polarization: CW elliptical - Far-Field CCW elliptical.\n\nFig. 6. Polarization: CW Circular - CCW Elliptical - Linear.\n\n\fFig. 7. Radiation Pattern: 3D and its 2D main-plane cuts.\n\nFig. 10. Antenna characteristics.\n\n[3] WIKIPEDIA, Learning by Teaching\nhttp://en.wikipedia.org/wiki/Learning_by_teaching\n[4] VIRTUAL ANTENNAS, An On-Line Course, DUTH Computer\nCenter, Spring 1998\nhttp://www.antennas.gr/TheLaboratory/VirtualAntennas/VirtualAnte\nnnas33A.htm\n\nFig. 8. Anechoic chamber - discone antenna.\n\n[5] EMLIB, EM Educational Resources: Virtual Antennas, Last\nmodified: 14 January 1999\nhttp://web.archive.org/web/19990221012605/emlib.jpl.nasa.gov/EM\nLIB/education.html\n[6] YANNOPOULOU, N., ZIMOURTOPOULOS, P., Virtual Antennas.\nAntennas Research Group DUTh, 1999-2000\nhttp://library.wolfram.com/database/MathSource/868\n[7] VIRTUAL ANTENNAS, Backlinks\nhttp://www.antennas.gr/backlinks/\n[8] YANNOPOULOU, N., ZIMOURTOPOULOS, P., Dipole Antenna\nRadiation Pattern, Wolfram Demonstrations Project, 2009\nhttp://demonstrations.wolfram.com/DipoleAntennaRadiationPattern/\n[9] CREATIVE COMMONS NET, Licensed Works\nhttps://creativecommons.net/yin/\nhttps://creativecommons.net/pez/\n[10] NOVAK, J. M. Arrow3D 1.0 Package for Mathematica, 1996\nhttp://forums.wolfram.com/mathgroup/archive/1998/Mar/msg00102.\nhtml\n\nFig. 9. Radiation Pattern: A composite 3D/4D presentation.\n\nReferences\n[1] ANTENNAS RESEARCH GROUP, Virtual Antennas 1996-2011\nhttp://www.antennas.gr\n[2] ZIMOURTOPOULOS, P., YANNOPOULOU, N., Antennal\nCalculus (forthcoming book)\nhttp://www.antennas.gr/zyacbook/\n\n[11] DONLEY, E. H. VRMLConvert 1.0 Package for Mathematica, 1996\nhttp://www.ma.iup.edu/projects/VRMLConvert/\n[12] ISO/IEC 14772-1:1997, 14772-2:2004, Virtual Reality Modeling\nLanguage (VRML97 Specifications)\nhttp://www.web3d.org/x3d/specifications/vrml/ISO-IEC-14772VRML97/\n[13] ANTENNAS RESEARCH GROUP, File Repository\nhttp://www.antennas.gr/3D4DX\n[14] GOOGLE CODE, Antennas Research Group File Repository\nhttp://code.google.com/p/rga/\n\n\f"}