{"id": "http://arxiv.org/abs/0907.4713v2", "guidislink": true, "updated": "2009-09-10T09:24:21Z", "updated_parsed": [2009, 9, 10, 9, 24, 21, 3, 253, 0], "published": "2009-07-27T17:36:46Z", "published_parsed": [2009, 7, 27, 17, 36, 46, 0, 208, 0], "title": "The QCD Phase Diagram from Chiral Approaches", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0907.4219%2C0907.0991%2C0907.3637%2C0907.3579%2C0907.1882%2C0907.1198%2C0907.2669%2C0907.0520%2C0907.3199%2C0907.3066%2C0907.0404%2C0907.5594%2C0907.3400%2C0907.4518%2C0907.3639%2C0907.3740%2C0907.0307%2C0907.0625%2C0907.1420%2C0907.0666%2C0907.1210%2C0907.4713%2C0907.5286%2C0907.1762%2C0907.5109%2C0907.4051%2C0907.0978%2C0907.3969%2C0907.2754%2C0907.3245%2C0907.5466%2C0907.3634%2C0907.3928%2C0907.0915%2C0907.0264%2C0907.0027%2C0907.2026%2C0907.3009%2C0907.4093%2C0907.3337%2C0907.4472%2C0907.5133%2C0907.4095%2C0907.0682%2C0907.1406%2C0907.1844%2C0907.1644%2C0907.2882%2C0907.3233%2C0907.3393%2C0907.5509%2C0907.0245%2C0907.4328%2C0907.5564%2C0907.4904%2C0907.3488%2C0907.0784%2C0907.4261%2C0907.5004%2C0907.0270%2C0907.3538%2C0907.1458%2C0907.4939%2C0907.4240%2C0907.1733%2C0907.2565%2C0907.2718%2C0907.5421%2C0907.5353%2C0907.0559%2C0907.3383%2C0907.3911%2C0907.2140%2C0907.0542%2C0907.2243%2C0907.3720%2C0907.4951%2C0907.0817%2C0907.1007%2C0907.0362%2C0907.1179%2C0907.4140%2C0907.5071%2C0907.1505%2C0907.5000%2C0907.0088%2C0907.0131%2C0907.0086%2C0907.0462%2C0907.2777%2C0907.2912%2C0907.3078%2C0907.4617%2C0907.3719%2C0907.4080%2C0907.4989%2C0907.3840%2C0907.1637%2C0907.1786%2C0907.2905%2C0907.4040&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "The QCD Phase Diagram from Chiral Approaches"}, "summary": "I show an updated QCD phase diagram with recent developments from chiral\neffective theories and phenomenological models. Expected signals of a QCD\ncritical point accessible in heavy-ion collisions are also discussed. In\nparticular, non-monotonic behavior of fluctuations associated with conserved\ncharges is focused on.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0907.4219%2C0907.0991%2C0907.3637%2C0907.3579%2C0907.1882%2C0907.1198%2C0907.2669%2C0907.0520%2C0907.3199%2C0907.3066%2C0907.0404%2C0907.5594%2C0907.3400%2C0907.4518%2C0907.3639%2C0907.3740%2C0907.0307%2C0907.0625%2C0907.1420%2C0907.0666%2C0907.1210%2C0907.4713%2C0907.5286%2C0907.1762%2C0907.5109%2C0907.4051%2C0907.0978%2C0907.3969%2C0907.2754%2C0907.3245%2C0907.5466%2C0907.3634%2C0907.3928%2C0907.0915%2C0907.0264%2C0907.0027%2C0907.2026%2C0907.3009%2C0907.4093%2C0907.3337%2C0907.4472%2C0907.5133%2C0907.4095%2C0907.0682%2C0907.1406%2C0907.1844%2C0907.1644%2C0907.2882%2C0907.3233%2C0907.3393%2C0907.5509%2C0907.0245%2C0907.4328%2C0907.5564%2C0907.4904%2C0907.3488%2C0907.0784%2C0907.4261%2C0907.5004%2C0907.0270%2C0907.3538%2C0907.1458%2C0907.4939%2C0907.4240%2C0907.1733%2C0907.2565%2C0907.2718%2C0907.5421%2C0907.5353%2C0907.0559%2C0907.3383%2C0907.3911%2C0907.2140%2C0907.0542%2C0907.2243%2C0907.3720%2C0907.4951%2C0907.0817%2C0907.1007%2C0907.0362%2C0907.1179%2C0907.4140%2C0907.5071%2C0907.1505%2C0907.5000%2C0907.0088%2C0907.0131%2C0907.0086%2C0907.0462%2C0907.2777%2C0907.2912%2C0907.3078%2C0907.4617%2C0907.3719%2C0907.4080%2C0907.4989%2C0907.3840%2C0907.1637%2C0907.1786%2C0907.2905%2C0907.4040&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "I show an updated QCD phase diagram with recent developments from chiral\neffective theories and phenomenological models. Expected signals of a QCD\ncritical point accessible in heavy-ion collisions are also discussed. In\nparticular, non-monotonic behavior of fluctuations associated with conserved\ncharges is focused on."}, "authors": ["Chihiro Sasaki"], "author_detail": {"name": "Chihiro Sasaki"}, "author": "Chihiro Sasaki", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1016/j.nuclphysa.2009.09.054", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/0907.4713v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0907.4713v2", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "8 pages, 6 figures - To appear in the conference proceedings for\n  Quark Matter 2009, March 30 - April 4, Knoxville, Tennessee v2: minor\n  corrections", "arxiv_primary_category": {"term": "hep-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "hep-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "nucl-th", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0907.4713v2", "affiliation": "TU Munich", "arxiv_url": "http://arxiv.org/abs/0907.4713v2", "journal_reference": "Nucl.Phys.A830:649c-656c,2009", "doi": "10.1016/j.nuclphysa.2009.09.054", "fulltext": "The QCD Phase Diagram from Chiral Approaches\nChihiro Sasaki\n\narXiv:0907.4713v2 [hep-ph] 10 Sep 2009\n\nPhysik-Department, Technische Universität München, D-85747 Garching, Germany\n\nAbstract\nI show an updated QCD phase diagram with recent developments from chiral effective theories\nand phenomenological models. Expected signals of a QCD critical point accessible in heavy-ion\ncollisions are also discussed. In particular, non-monotonic behavior of fluctuations associated\nwith conserved charges is focused on.\n\n1. Introduction\nOne of the main issues addressed in QCD is the phase structure of strongly interacting matter\nat finite temperature and baryon density. Remarkable progress in lattice QCD simulations provides a reliable description of bulk QCD matter for small chemical potentials, i.e. equations of\nstate and order of phase transitions, which is an input to heavy-ion phenomenologies [1]. Model\nstudies of dense baryonic and quark matter have suggested a rich phase structure of QCD at temperatures and quark chemical potentials being of order ΛQCD . Our knowledge on the QCD phase\nstructure is however still limited: The physics around normal nuclear matter density has been\nempirically known and can be successfully described by chiral effective field theories guided\nby experimental data [2]. At asymptotically high density the Color-Flavor-Locked phase is preferred as the QCD ground state [3]. In intermediate densities where lattice QCD is not accessible,\na description of dense matter still relies on effective theories and models.\nThe order of the QCD phase transition is neither established at low temperature or high density. First-order phase transitions for cold dense matter have been predicted in several approaches\nusing chiral models [4], Schwinger-Dyson equations [5] and lattice QCD in strong coupling\nlimit [6]. This along with the observation of a crossover at zero chemical potential from lattice\nQCD computations might suggest a critical point in the QCD phase plane [4]. The existence of\na QCD critical point is still an issue under debate. In fact, the location of a critical point strongly\ndepends on parameters, e.g. current quark masses and coupling strengths of hadronic interactions\nin model studies [7].\nThe presence of diquarks in dense matter leads to a possibility of new critical points at low\ntemperature depending on couplings of the chiral condensate to diquarks [8, 9]. A hypothetical\nphase diagram is shown in Figure 1 assuming multiple critical points A-C. Since the critical\npoint C appears in the two-flavored Nambu–Jona-Lasinio (NJL) model with a fine-tuning of the\nrelative strength of the chiral and diquark couplings [9], this might disappear from the phase\ndiagram due to correlations via pion exchanges in dense medium. The appearance of the point\nB indicates a crossover from hadronic matter to color superconductor. This is a realization of\nhadron-quark continuity [10] in the Ginzburg-Landau description. Close similarities to the BECBCS crossover in ultra-cold atomic systems are also suggestive [11].\nPreprint submitted to Nuclear Physics A\n\nMay 30, 2018\n\n\fT\nlattice QCD\nQuark Gluon Plasma\nA\nHadrons\n\nmodels\n\nB\nnuclear phys.\n\nColor\nSuperconductor\nC\nμ\nB\n\nFigure 1: A sketch of the QCD phase diagram.\n\n2. Chiral symmetry breaking vs. confinement\nStrong interaction leads not only to dynamical breaking of chiral symmetry but also to confinement. Both features are characterized by strict order parameters associated with global symmetries of the QCD Lagrangian in two limiting situations: the quark bilinear hq̄qi in the limit\nof massless quarks, and the Polyakov loop hΦi in the limit of infinitely heavy quarks. The NJL\nmodel with Polyakov loops (PNJL model) has been developed to deal with those features simultaneously [12]. The model describes that only three-quark states are thermally relevant below\nthe chiral critical temperature, which is reminiscent of confinement. The two order parameters\nin the PNJL model, chiral condensate and Polyakov loop expectation values, are shown in Figure 2. Due to finite quark masses chiral and deconfinement transitions are crossover and the\ncorresponding pseudo-critical temperatures, T ch and T dec , are defined as the steepest points of\nderivatives of hq̄qi and hΦi. The interference of quark with gluon sectors makes both T ch and\nT dec mutually shifted. At zero chemical potential one sees that the two transitions take place\nalmost simultaneously, as indicated in lattice QCD.\nThe phase transitions at higher chemical potential may have a close relation to the notion\nof Quarkyonic Phase which has been proposed as a novel phase of dense quarks based on the\nargument using large Nc counting where Nc denotes number of colors [14]: In the large Nc\nlimit there are three phases which are rigorously distinguished using hΦi and the baryon number\ndensity hNB i. The quarkyonic phase is characterized by hΦi = 0 indicating the system confined\nand non-vanishing hNB i above μB = MB with a baryon mass MB . The phase structure in large\nNc is shown in Figure 3. A possible deformation of the phase boundaries in Figure 3 together\nwith chiral phase transition is illustrated using a PNJL model [15]. Finite Nc corrections make the\ntransition lines bending down. One finds that for Nc = 3 deconfinement and chiral crossover lines\nare on top of each other in a wide range of μ. A critical point associated with chiral symmetry\nappears around the junction of those crossovers.\nThe separation of the quarkyonic from hadronic phase is not clear any more in a system\nwith finite Nc . Nevertheless, a rapid change in the baryon number would be interpreted as the\n2\n\n\f1.0\n\n1.0\n\n0.8\n\nNJL\nHchiral limitL\n\n0.6\n\n0.6\n\n|hψ̄ψi|\n|hψ̄ψi|0 0.4\nPSfrag replacements\n\n2nd order\n\n0.2\n0.0\n0.0\n\n0.8\n\nPNJL\npure\ngauge\n\n0.4\n\n1st order\n\n0.2\n\nhΦi\n\n0.0\n0.5\n\n1.0\n\n1.5\n\nT /Tc\nFigure 2: The chiral condensate normalized to its vacuum value (solid line) and the Polyakov loop (dashed dotted line)\nin a PNJL model [12]. The data from lattice calculations for the Polyakov loop in pure gauge and in full QCD are shown\nin [13].\n\nT\n\n<Φ>=1\n<N B >=0\n\ndeconfined O(N 2C )\n\nhadronic <Φ>=0 quarkyonic\nO(N C )\n<Φ>=0 <N B >=0\nmesons\nmesons\n<N B >=0\nbaryons\nbaryons\nmesons\npert. quarks\nO(1)\nΛQCD\nMq\n>> ΛQCD μq\nFigure 3: The phase diagram in large Nc proposed in [14].\n\n3\n\n\f0.3\n0.25\nT [GeV]\n\n0.2\n0.15\n0.1\n\ndeconf. crossover\nchiral crossover\nchiral 1st-order\nchiral CP\n\n0.05\n0\n0\n\n0.05 0.1 0.15 0.2 0.25 0.3 0.35\nμ [GeV]\n\nFigure 4: The phase diagram of a PNJL model for different Nc [15]. Two straight lines indicate the deconfinement and\nchiral phase transitions for Nc = ∞ and the lower curves for Nc = 3.\n\nquarkyonic transition which separates meson dominant from baryon dominant regions. This\nmight appear near the boundary for chemical equilibrium where one would expect a rapid change\nin the number of degrees of freedom [14]. More realistic models including mesons and baryons,\nrather than chiral quarks, are indispensable to further understanding of the physics of dense\nbaryonic matter and possible appearance of the quarkyonic \"phase\" in Nc = 3 QCD. In particular,\nchiral symmetry restoration for baryons must be worked out. Although two alternatives for\nchirality assignment to baryons have been known, it remains an open question which scenario is\npreferred by nature [16].\n3. Fluctuations and critical points\nModifications in the magnitude of fluctuations or the corresponding susceptibilities are considered as a possible signal for deconfinement and chiral symmetry restoration. In this context,\nfluctuations related to conserved charges play an important role since they are directly accessible\nin experiments [17]. Especially, non-monotonic behavior of baryon number fluctuations could be\na clear indication for the existence of a critical point in the QCD phase diagram. Higher moments\nand their signs have also been proposed as more sensitive probes to the phase transitions [18]. If\nthe critical region is sufficiently large, the critical point could be an attractor of isentropes and\nlead to a change in the transverse velocity dependence of proton-antiproton ratio [19]. However, a model study has recently suggested that such strong modifications are washed out by\nquantum fluctuations [20] and this indicates no focusing. Besides, isentropes are not universal\nsince entropy and baryon number densities have no derivatives of the order parameter which are\nresponsible for the universality.\n4\n\n\fCP\n\nχ q / Λ2\n100\n10\n1\n0.1\n\nisoth. spinodals\n\n100\n80\n60\n40\n\nT [MeV]\n\n20\n\n0.4\n0\n\n0.8\n\n1.2\n\n1.6\n\n2.0\n\nn q [fm−3]\n\nFigure 5: The net quark number susceptibility χq in the stable and meta-stable regions [21]. Here χq is normalized to\nthe three-momentum cutoff Λ = 587.9 MeV used in the N f = 2 NJL model.\n\nThe suppression of density fluctuations along the first-order transition appears under the assumption that this transition takes place in equilibrium. This is modified when there is a deviation\nfrom equilibrium [21]. When entering the coexistence region, a singularity in the net quark number susceptibility χq appears at the isothermal spinodal lines, where the fluctuations diverge and\nthe susceptibility changes sign. In between the spinodal lines, the susceptibility is negative. This\nimplies instabilities in the baryon number fluctuations when crossing from a meta-stable to an\nunstable phase. The above behavior of χq is a direct consequence of the thermodynamics rela\u0010 \u0011\nn2\n∂P\ntion, ∂V\n= − Vq χ1q . Along the isothermal spinodals the pressure derivative vanishes. Thus, for\nT\nnon-vanishing density nq , χq must diverge to satisfy this relation. The evolution of the singularity\nat the spinodal lines in the T -nq plane under the mean field approximation is shown in Figure 5.\nThe critical exponent at the isothermal spinodal line is found to be γ = 1/2, with χq ∼ (μ − μc )−γ ,\nwhile γ = 2/3 at the critical point [21]. Thus, the singularities at the two spinodal lines conspire\nto yield a somewhat stronger divergence as they join at the critical point. The critical region of\nenhanced susceptibility around the critical point is found to be fairly small in and beyond the\nmean field approximation [22], while in the more realistic non-equilibrium system one expects\nfluctuations in a larger region of the phase diagram, i.e. over a broader range of beam energies,\ndue to the spinodal instabilities.\n4. Conclusions\nOur understanding of the QCD phases remains inadequate to make a firm statement about\nthe phase diagram and the existence of one or more critical points. Model studies carried out\nunder the mean field approximation are expected to capture some essential features associated\n5\n\n\f1\n0.9\n0.8\ncondensate ratio\n\n0.7\n0.6\n\n135MeV\n\n0.5\n0.4\n0.3\n\nlinear\n\n0.2\n0.1\n0\n\n0\n\nmπ=0\n\n0.05\n\n0.1\n\n70MeV\n\n0.2\n0.15\n0.25\n-3\nnucleon density: ρ [fm ]\n\n0.3\n\n0.35\n\nFigure 6: The ratio of the in-medium chiral condensate to its vacuum value as a function of the nucleon density for\nseveral pion masses, mπ = 0 , 70 , 135 MeV [23].\n\nwith chiral dynamics. However, since under this approximation one omits important effects, e.g.\nquantum fluctuations, from a theory with a limited number of degrees of freedom, the models\ncould lead to even qualitatively a different result from QCD.\nSome lessons for more realistic modeling can be found in chiral effective field theories (EFTs)\napplied to normal nuclear matter: The nuclear equation of state (EoS) for various nuclei and the\nliquid-gas phase transition have been explored within the chiral approaches which allow us to\nmake quantitative science [2]. Figure 6 shows the in-medium chiral condensate normalized to its\nvacuum value calculated in the chiral EFT constrained by nuclear EoS [23]. One observes that\nthe in-medium condensate strongly relies on the pion mass. This comes from two-pion exchange\ncorrelations with virtual ∆(1232) excitations and stabilizes the dropping of the condensate for\nphysical pion mass with increasing density. This indicates that the chiral symmetry restoration\nis delayed and would take place much higher density than 2 ρ0 . This also could suggest that inmedium correlations make a phase transition obscure and eventually first-order phase transition\nmight disappear from the phase diagram. On the other hand, in the chiral limit the condensate\nvanishes already at ∼ 1.5 ρ0 . It is remarkable that small quark masses, mu,d ∼ 5 MeV, influence\nover thermodynamics so strongly. Obviously, a more realistic description for hadronic matter\nat higher densities and the critical point(s) should be provided in systematic approaches with\nmesons and baryons.\nIn condensed matter physics strongly coupled systems can be described by EFTs where the\nnotion of e.g. quasi-particles and BCS pairings has been successful. One would thus expect\na similarity in nuclear many-body systems in high densities. In fact, the spectroscopic factor\nfor various nuclei indicating a deviation from the fully occupied mean-field orbits clearly shows\nthat single-particle-ness of excitations reaches ∼70 %, see e.g. Figure 11 in [24]. This would\nencourage modeling dense baryonic matter in a quasi-particle picture.\n6\n\n\fAcknowledgments\nI am grateful for fruitful discussions with L. McLerran, K. Redlich, M. Rho and W. Weise.\nThe work has been supported in part by the DFG cluster of excellence \"Origin and Structure of\nthe Universe\".\nReferences\n[1] P. Petreczky, these proceedings.\n[2] see e.g., P. Finelli, N. Kaiser, D. Vretenar and W. Weise, Nucl. Phys. A 735, 449 (2004); Nucl. Phys. A 770, 1\n(2006), S. Fritsch, N. Kaiser and W. Weise, Nucl. Phys. A 750, 259 (2005).\n[3] M. Alford, these proceedings.\n[4] M. Asakawa and K. Yazaki, Nucl. Phys. A 504, 668 (1989), J. Berges and K. Rajagopal, Nucl. Phys. B 538, 215\n(1999), A. M. Halasz, A. D. Jackson, R. E. Shrock, M. A. Stephanov and J. J. M. Verbaarschot, Phys. Rev. D\n58, 096007 (1998), O. Scavenius, A. Mocsy, I. N. Mishustin and D. H. Rischke, Phys. Rev. C 64, 045202 (2001),\nH. Fujii, Phys. Rev. D 67, 094018 (2003), H. Fujii and M. Ohtani, Phys. Rev. D 70, 014016 (2004).\n[5] A. Barducci, R. Casalbuoni, S. De Curtis, R. Gatto and G. Pettini, Phys. Lett. B 231, 463 (1989); Phys. Rev. D 41,\n1610 (1990), Y. Taniguchi and Y. Yoshida, Phys. Rev. D 55, 2283 (1997), M. Harada and A. Shibata, Phys. Rev. D\n59, 014010 (1999).\n[6] E. M. Ilgenfritz and J. Kripfganz, Z. Phys. C 29, 79 (1985), P. H. Damgaard, D. Hochberg and N. Kawamoto, Phys.\nLett. B 158, 239 (1985), F. Karsch and K. H. Mutter, Nucl. Phys. B 313, 541 (1989), N. Kawamoto, K. Miura,\nA. Ohnishi and T. Ohnuma, Phys. Rev. D 75, 014502 (2007).\n[7] S. Klimt, M. Lutz and W. Weise, Phys. Lett. B 249, 386 (1990), Y. Hatta and T. Ikeda, Phys. Rev. D 67, 014028\n(2003), B. J. Schaefer and J. Wambach, Nucl. Phys. A 757, 479 (2005), P. de Forcrand and O. Philipsen, JHEP\n0701, 077 (2007).\n[8] M. Kitazawa, T. Koide, T. Kunihiro and Y. Nemoto, Prog. Theor. Phys. 108, 929 (2002), T. Hatsuda, M. Tachibana,\nN. Yamamoto and G. Baym, Phys. Rev. Lett. 97, 122001 (2006), N. Yamamoto, M. Tachibana, T. Hatsuda and\nG. Baym, Phys. Rev. D 76, 074001 (2007).\n[9] Z. Zhang, K. Fukushima and T. Kunihiro, Phys. Rev. D 79, 014004 (2009).\n[10] T. Schafer and F. Wilczek, Phys. Rev. Lett. 82, 3956 (1999).\n[11] G. Baym, T. Hatsuda, M. Tachibana and N. Yamamoto, J. Phys. G 35, 104021 (2008).\n[12] K. Fukushima, Phys. Lett. B 591, 277 (2004), C. Ratti, M. A. Thaler and W. Weise, Phys. Rev. D 73, 014019 (2006),\nE. Megias, E. Ruiz Arriola and L. L. Salcedo, Phys. Rev. D 74, 065005 (2006), S. K. Ghosh, T. K. Mukherjee,\nM. G. Mustafa and R. Ray, Phys. Rev. D 73, 114007 (2006), S. Roessner, C. Ratti and W. Weise, Phys. Rev. D\n75, 034007 (2007), C. Ratti, S. Roessner and W. Weise, Phys. Lett. B 649, 57 (2007), C. Sasaki, B. Friman and\nK. Redlich, Phys. Rev. D 75, 074013 (2007), H. Hansen, W. M. Alberico, A. Beraudo, A. Molinari, M. Nardi and\nC. Ratti, Phys. Rev. D 75, 065004 (2007), Z. Zhang and Y. X. Liu, Phys. Rev. C 75, 064910 (2007), S. Roessner,\nT. Hell, C. Ratti and W. Weise, Nucl. Phys. A 814, 118 (2008), K. Kashiwa, H. Kouno, M. Matsuzaki and M. Yahiro,\nPhys. Lett. B 662, 26 (2008), Y. Sakai, K. Kashiwa, H. Kouno and M. Yahiro, Phys. Rev. D 77, 051901 (2008);\nPhys. Rev. D 78, 036001 (2008), H. Abuki, M. Ciminale, R. Gatto, G. Nardulli and M. Ruggieri, Phys. Rev. D 77,\n074018 (2008); Phys. Rev. D 78, 034034 (2008), K. Fukushima, Phys. Rev. D 77, 114028 (2008) [Erratum-ibid. D\n78, 039902 (2008)]; arXiv:0901.0783 [hep-ph], H. Abuki, M. Ciminale, R. Gatto and M. Ruggieri, Phys. Rev. D\n79, 034021 (2009), T. Hell, S. Roessner, M. Cristoforetti and W. Weise, Phys. Rev. D 79, 014022 (2009), H. Abuki\nand K. Fukushima, Phys. Lett. B 676, 57 (2009).\n[13] O. Kaczmarek and F. Zantow, Phys. Rev. D 71, 114510 (2005).\n[14] L. McLerran and R. D. Pisarski, Nucl. Phys. A 796, 83 (2007), Y. Hidaka, L. D. McLerran and R. D. Pisarski,\nNucl. Phys. A 808, 117 (2008).\n[15] L. McLerran, K. Redlich and C. Sasaki, Nucl. Phys. A 824, 86 (2009).\n[16] C. E. Detar and T. Kunihiro, Phys. Rev. D 39, 2805 (1989), Y. Nemoto, D. Jido, M. Oka and A. Hosaka, Phys. Rev.\nD 57, 4124 (1998), D. Jido, Y. Nemoto, M. Oka and A. Hosaka, Nucl. Phys. A 671, 471 (2000), H. c. Kim, D. Jido\nand M. Oka, Nucl. Phys. A 640, 77 (1998), D. Jido, T. Hatsuda and T. Kunihiro, Phys. Rev. Lett. 84, 3252 (2000).\n[17] M. A. Stephanov, K. Rajagopal and E. V. Shuryak, Phys. Rev. Lett. 81, 4816 (1998), S. Jeon and V. Koch, Quark\nGluon Plasma 3, Eds. R.C. Hwa and X. N. Wang, World Scientific Publishing, 2004.\n[18] S. Ejiri, F. Karsch and K. Redlich, Phys. Lett. B 633, 275 (2006), B. Stokic, B. Friman and K. Redlich, Phys. Lett.\nB 673, 192 (2009), M. A. Stephanov, Phys. Rev. Lett. 102, 032301 (2009), M. Asakawa, S. Ejiri and M. Kitazawa,\narXiv:0904.2089 [nucl-th].\n\n7\n\n\f[19] C. Nonaka and M. Asakawa, Phys. Rev. C 71, 044904 (2005), M. Asakawa, S. A. Bass, B. Muller and C. Nonaka,\nPhys. Rev. Lett. 101, 122302 (2008).\n[20] E. Nakano, B. J. Schaefer, B. Stokic, B. Friman and K. Redlich, arXiv:0907.1344 [hep-ph].\n[21] C. Sasaki, B. Friman and K. Redlich, Phys. Rev. Lett. 99, 232301 (2007); Phys. Rev. D 77, 034024 (2008).\n[22] B. J. Schaefer and J. Wambach, Phys. Rev. D 75, 085015 (2007); C. Sasaki, B. Friman and K. Redlich, Phys. Rev.\nD 75, 054026 (2007).\n[23] N. Kaiser, P. de Homont and W. Weise, Phys. Rev. C 77, 025204 (2008).\n[24] W. H. Dickhoff and C. Barbieri, Prog. Part. Nucl. Phys. 52, 377 (2004).\n\n8\n\n\f"}