{"id": "http://arxiv.org/abs/1202.1649v1", "guidislink": true, "updated": "2012-02-08T10:31:40Z", "updated_parsed": [2012, 2, 8, 10, 31, 40, 2, 39, 0], "published": "2012-02-08T10:31:40Z", "published_parsed": [2012, 2, 8, 10, 31, 40, 2, 39, 0], "title": "Critère d'irréductibilité pour les courbes elliptiques\n  semi-stables sur un corps de nombres", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1202.6633%2C1202.0151%2C1202.3746%2C1202.2506%2C1202.3678%2C1202.1504%2C1202.5971%2C1202.2873%2C1202.5853%2C1202.3762%2C1202.6095%2C1202.2745%2C1202.2575%2C1202.5084%2C1202.4146%2C1202.6323%2C1202.2554%2C1202.5289%2C1202.4595%2C1202.0421%2C1202.4551%2C1202.5126%2C1202.3063%2C1202.3606%2C1202.1915%2C1202.3989%2C1202.0613%2C1202.5795%2C1202.3096%2C1202.6302%2C1202.0159%2C1202.2256%2C1202.1638%2C1202.2996%2C1202.6425%2C1202.3005%2C1202.5520%2C1202.6301%2C1202.1923%2C1202.2070%2C1202.1346%2C1202.5827%2C1202.0044%2C1202.3686%2C1202.3658%2C1202.2234%2C1202.4134%2C1202.5710%2C1202.1440%2C1202.3644%2C1202.1074%2C1202.4185%2C1202.0815%2C1202.4126%2C1202.3455%2C1202.1185%2C1202.4215%2C1202.5235%2C1202.3782%2C1202.2915%2C1202.3939%2C1202.4898%2C1202.3369%2C1202.1264%2C1202.5458%2C1202.1095%2C1202.6470%2C1202.0011%2C1202.3923%2C1202.1649%2C1202.4045%2C1202.4980%2C1202.2325%2C1202.4296%2C1202.0714%2C1202.5269%2C1202.1205%2C1202.0399%2C1202.0739%2C1202.0188%2C1202.4492%2C1202.1525%2C1202.5794%2C1202.4407%2C1202.0423%2C1202.0467%2C1202.3435%2C1202.4927%2C1202.2559%2C1202.2395%2C1202.2505%2C1202.5061%2C1202.2539%2C1202.2098%2C1202.3393%2C1202.5394%2C1202.6259%2C1202.2321%2C1202.2627%2C1202.3404%2C1202.3057&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Critère d'irréductibilité pour les courbes elliptiques\n  semi-stables sur un corps de nombres"}, "summary": "For a fixed number field and an elliptic curve defined and semi-stable over\nthis number field, we consider the set of prime numbers p such that the Galois\nrepresentation attached to the p-torsion points of the elliptic curve is\nreducible. When the number field satisfies a certain necessary condition, we\ngive an explicit bound, depending only on the number field and not on the\nsemi-stable elliptic curve, for these primes. This generalizes previous results\nof Kraus.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1202.6633%2C1202.0151%2C1202.3746%2C1202.2506%2C1202.3678%2C1202.1504%2C1202.5971%2C1202.2873%2C1202.5853%2C1202.3762%2C1202.6095%2C1202.2745%2C1202.2575%2C1202.5084%2C1202.4146%2C1202.6323%2C1202.2554%2C1202.5289%2C1202.4595%2C1202.0421%2C1202.4551%2C1202.5126%2C1202.3063%2C1202.3606%2C1202.1915%2C1202.3989%2C1202.0613%2C1202.5795%2C1202.3096%2C1202.6302%2C1202.0159%2C1202.2256%2C1202.1638%2C1202.2996%2C1202.6425%2C1202.3005%2C1202.5520%2C1202.6301%2C1202.1923%2C1202.2070%2C1202.1346%2C1202.5827%2C1202.0044%2C1202.3686%2C1202.3658%2C1202.2234%2C1202.4134%2C1202.5710%2C1202.1440%2C1202.3644%2C1202.1074%2C1202.4185%2C1202.0815%2C1202.4126%2C1202.3455%2C1202.1185%2C1202.4215%2C1202.5235%2C1202.3782%2C1202.2915%2C1202.3939%2C1202.4898%2C1202.3369%2C1202.1264%2C1202.5458%2C1202.1095%2C1202.6470%2C1202.0011%2C1202.3923%2C1202.1649%2C1202.4045%2C1202.4980%2C1202.2325%2C1202.4296%2C1202.0714%2C1202.5269%2C1202.1205%2C1202.0399%2C1202.0739%2C1202.0188%2C1202.4492%2C1202.1525%2C1202.5794%2C1202.4407%2C1202.0423%2C1202.0467%2C1202.3435%2C1202.4927%2C1202.2559%2C1202.2395%2C1202.2505%2C1202.5061%2C1202.2539%2C1202.2098%2C1202.3393%2C1202.5394%2C1202.6259%2C1202.2321%2C1202.2627%2C1202.3404%2C1202.3057&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "For a fixed number field and an elliptic curve defined and semi-stable over\nthis number field, we consider the set of prime numbers p such that the Galois\nrepresentation attached to the p-torsion points of the elliptic curve is\nreducible. When the number field satisfies a certain necessary condition, we\ngive an explicit bound, depending only on the number field and not on the\nsemi-stable elliptic curve, for these primes. This generalizes previous results\nof Kraus."}, "authors": ["Agnès David"], "author_detail": {"name": "Agnès David"}, "author": "Agnès David", "arxiv_comment": "19 pages ; en fran\\c{c}ais. arXiv admin note: text overlap with\n  arXiv:1103.3892", "links": [{"href": "http://arxiv.org/abs/1202.1649v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1202.1649v1", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "math.NT", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "math.NT", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "11G05, 11G15, 11F80", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1202.1649v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1202.1649v1", "journal_reference": null, "doi": null, "fulltext": "arXiv:1202.1649v1 [math.NT] 8 Feb 2012\n\nCritère d'irréductibilité pour les courbes elliptiques\nsemi-stables sur un corps de nombres\nAgnès David\nLaboratoire de mathématiques de Versailles\nUniversité de Versailles Saint-Quentin-en-Yvelines\n45 avenue des États-Unis\n78035 Versailles Cedex\nAgnes.David@ens-lyon.org\n\nRésumé\nFor a fixed number field and an elliptic curve defined and semi-stable\nover this number field, we consider the set of prime numbers p such that the\nGalois representation attached to the p-torsion points of the elliptic curve is\nreducible. When the number field satisfies a certain necessary condition, we\ngive an explicit bound, depending only on the number field and not on the\nsemi-stable elliptic curve, for these primes. This generalizes previous results\nof Kraus.\n\nIntroduction\nCet article traite de la réductibilité de la représentation galoisienne associée\naux points de torsion d'une courbe elliptique semi-stable définie sur un corps de\nnombres.\nPour les points de torsion dont l'ordre est un nombre premier strictement\nsupérieur à une certaine borne, qui ne dépend que du corps de base et qu'on explicite, on démontre que, lorsque cette représentation est réductible, sa semi-simplifiée\nest isomorphe à la représentation associée à une courbe elliptique semi-stable et\nayant des multiplications complexes sur le corps de base (voir le théorème II).\nOn en déduit, lorsque le corps de base vérifie la condition nécessaire que\nde telles courbes semi-stables et à multiplications complexes n'existent pas, une\nborne supérieure uniforme pour les nombres premiers pouvant donner lieu à une\nreprésentation réductible pour une courbe elliptique semi-stable (voir le théorème I).\nOn généralise ainsi des résultats de Kraus (voir [Kra96] et [Kra07]). Enfin, on donne\ndes exemples de corps satisfaisant le théorème I (voir la partie 3.4).\nLes notations sont les suivantes. On fixe un corps de nombres K et un plongement de K dans C (dans tout le texte, on considérera ainsi K comme un sous-corps\nde C). Soit Q la clôture algébrique de Q dans C ; on note GK le groupe de Galois\n\n1\n\n\fabsolu Gal(Q/K) de K. À partir de la partie 2 et pour toute la fin du texte, on\nsuppose que l'extension K/Q est galoisienne.\nOn fixe une courbe elliptique E définie sur K qui est semi-stable sur K, c'està-dire qui a, en toute place finie de K, soit réduction multiplicative (déployée ou\nnon) soit bonne réduction.\nOn fixe un nombre premier p supérieur ou égal à 5 et non ramifié dans K.\nOn note Ep l'ensemble des points de E dans Q qui sont de p-torsion ; c'est un\nespace vectoriel de dimension 2 sur Fp , sur lequel le groupe de Galois absolu GK\nde K agit Fp -linéairement. On désigne par φE,p la représentation de GK ainsi\nobtenue ; elle prend ses valeurs dans le groupe GL(Ep ) qui, après choix d'une base\npour Ep , est isomorphe à GL2 (Fp ). On note enfin χp le caractère cyclotomique\nde GK dans F×\np ; il coı̈ncide avec le déterminant de la représentation φE,p .\nLorsque le corps de base K est celui des rationnels Q, Mazur a démontré\ndans [Maz78] que, pour p strictement supérieur à 7 et E semi-stable (ou pour p\nstrictement supérieur à 163 et E définie sur Q, pas forcément semi-stable), la\nreprésentation φE,p est irréductible. Le théorème de Mazur constitue, pour le\ncorps Q, une partie de la réponse au ≪ problème de Serre uniforme ≫ (voir la\npartie 4.3 de [Ser72]) qui consiste à déterminer s'il existe une borne BK vérifiant :\npour toute courbe elliptique E définie sur K et sans multiplication complexe sur Q\net tout nombre premier p strictement supérieur à BK , la représentation φE,p est\nsurjective. On pourra à ce sujet consulter les travaux récents de Bilu, Parent et\nRebolledo (voir [BPR11]).\nOn supposera donc dans tout ce texte que le corps K est différent de Q et\non se limitera à l'étude des courbes elliptiques semi-stables sur K. Dans la direction d'une généralisation du résultat de Mazur pour les courbes elliptiques semistables, Kraus a posé, et traité dans certains cas, la question suivante (voir [Kra96]\net [Kra07]).\nQuestion. Existe-t-il une borne CK , ne dépendant que du corps de nombres K et\nvérifiant : pour toute courbe elliptique E définie et semi-stable sur K et tout nombre\npremier p strictement supérieur à CK , la représentation φE,p est irréductible ?\nKraus a résolu cette question, en explicitant la borne CK , pour les corps quadratiques dans [Kra96] et pour les corps vérifiant une certaine condition (C)\ndans [Kra07]. L'appendice B de [Kra07] mentionne également que le théorème\nnon effectif de [Mom95], allié aux bornes de Merel (voir [Mer96]) sur l'ordre des\npoints de torsion d'une courbe elliptique, donne des résultats semblables pour les\ncorps K ne contenant le corps de classes de Hilbert d'aucun corps quadratique\nimaginaire.\nUne condition nécessaire sur le corps K pour que la réponse à la question cidessus soit positive est qu'il n'existe pas de courbe elliptique définie et semi-stable\nsur K, ayant de plus des multiplications complexes sur K (on remarque qu'une\ntelle courbe elliptique a alors bonne réduction en toute place de K). En effet, pour\nune telle courbe elliptique E, ayant des multiplications complexes par un corps\nquadratique imaginaire L contenu dans K, la représentation φE,p est réductible\npour tout nombre premier p décomposé dans L (voir proposition 1.2 de [Bil11]).\n\n2\n\n\fOn montre ici que cette condition est suffisante. Lorsqu'elle est réalisée, on\ndonne de plus une forme explicite pour une borne CK répondant à la question\n(voir définition 3.5).\nThéorème I (Borne uniforme d'irréductibilité). On suppose que le corps K\nest galoisien sur Q. Les assertions suivantes sont équivalentes.\n1. Il n'existe pas de courbe elliptique définie sur K, ayant des multiplications\ncomplexes sur K et partout bonne réduction sur K.\n2. Il existe une borne CK , ne dépendant que du corps de nombres K et vérifiant :\npour toute courbe elliptique E définie et semi-stable sur K et tout nombre\npremier p strictement supérieur à CK , la représentation φE,p est irréductible.\nLorsqu'elles sont vérifiées, la borne CK donnée par la définition 3.5 satisfait la\ndeuxième assertion.\nOn trouvera dans la partie 3.4 (théorème III) des exemples de corps K satisfaisant le théorème I.\nOn renvoie aux définitions 2.8, 2.10, 3.2, 3.5, pour une formule explicite pour\nla borne CK . Elle dépend du degré, du discriminant, du nombre de classes et\ndu régulateur du corps K, ainsi que d'une constante absolue intervenant dans\nune forme explicite du théorème de Chebotarev due à Lagarias, Montgomery et\nOdlyzko (voir la partie 2.3 et [LMO79]). La détermination de la borne CK utilise\négalement les bornes de Bugeaud et Győry (voir [BG96]) sur la hauteur d'un\ngénérateur d'un idéal (voir partie 2.2) et, de manière cruciale, la borne uniforme\nsur l'ordre des points de torsion d'une courbe elliptique de Merel et Oesterlé qui\nfigure dans les introductions de [Mer96] et [Par99] (voir la proposition 3.6).\nLe théorème I découle du théorème II suivant, qui précise, pour les courbes elliptiques semi-stables, les résultats de [Dav08] (théorème I), [Dav11b] (théorème II)\net (dans une forme non explicite) [Mom95] (théorème A).\nThéorème II (Forme de la représentation semi-simplifiée). On suppose\nque le corps K est galoisien sur Q et qu'il existe une courbe elliptique E semistable sur K et un nombre premier p strictement supérieur à CK tels que la\nreprésentation φE,p est réductible.\nAlors il existe une courbe elliptique E ′ définie sur K, ayant des multiplications\ncomplexes sur K et partout bonne réduction sur K, telle que que la semi-simplifiée\nde la représentation φE,p est isomorphe à la représentation φE ′ ,p .\nOn remarque que le type supersingulier du théorème II de [Dav11b] n'apparaı̂t\npas ici ; en effet, il ne se produit que pour des courbes elliptiques ayant réduction\nadditive aux places de K au-dessus de p.\nDans tout le texte, on suppose que la courbe elliptique E est semi-stable sur K\net que la représentation φE,p est réductible. La courbe E possède alors un sousgroupe d'ordre p défini sur K. On fixe un tel sous-groupe W ; il lui est associé une\nisogénie de E de degré p, définie sur K. L'action de GK sur W (Q) est donnée par un\ncaractère continu de GK dans F×\np ; on le note λ et, suivant la terminologie introduite\ndans [Maz78], on l'appelle le caractère d'isogénie associé au couple (E, W ). On\n\n3\n\n\ffixe également une base de Ep dont le premier vecteur engendre W (Q) ; dans cette\nbase la matrice de la représentation φE,p est triangulaire supérieure, de caractères\ndiagonaux (λ, χp λ−1 ).\nLa méthode de démonstration du théorème I suit celle de [Dav08] et [Dav11b],\ninspirée de [Mom95]. Plutôt qu'appliquer les résultats de [Dav11b] (ou [Dav08])\nà une courbe elliptique semi-stable, on a choisi d'en retracer la démonstration,\nqui donne une meilleure borne CK (comparer les définitions 2.10, 3.2 et 3.5 du\nprésent texte avec les définitions 2.10, 2.13 et 4.3 de [Dav11b]) et permet d'exprimer\ndirectement la semi-simplifiée de la représentation φE,p au lieu de sa puissance\ndouzième. Néanmoins, lorsque c'était possible, on s'est référé à des résultats connus\ndans le cas général, en précisant l'amélioration propre aux courbes semi-stables.\nLa première partie de l'article rappelle les propriétés locales du caractère d'isogénie,\nen l'occurence ses restrictions aux sous-groupes de décomposition des places finies\nde K hors de p et ses restrictions aux sous-groupes d'inertie des places de K\nau-dessus de p.\nLa deuxième partie regroupe des propriétés globales du caractère d'isogénie\net du corps K (dont on suppose à partir de ce point du texte qu'il est galoisien\nsur Q). On y trouve notamment la théorie du corps de classes globale pour le carré\ndu caractère d'isogénie, qui relie entre elles les propriétés locales de la première\npartie.\nLa troisième partie comporte la démonstration du théorème II (partie 3.3),\ndont le théorème I est une conséquence directe. Enfin, on donne dans la partie 3.4\n(théorème III) une liste de corps satisfaisant les assertions du théorème I.\n\n1\n\nPropriétés locales du caractère d'isogénie\n\n1.1\n\nAux places finies hors de p\n\nSoient q un nombre premier rationnel différent de p et q un idéal premier de K\nau-dessus de q.\nProposition 1.1. Le caractère λ est non ramifié en q.\nDémonstration. Lorsque la courbe E a bonne réduction en q, le résultat est donné\npar le théorème 1 de [ST68].\nLorsque la courbe E a réduction multiplicative en q, il découle de la partie §1.12\nde [Ser72]. Pour un énoncé précis, on renvoie à la proposition 1.1.1 de [Dav08], la\nproposition 3 de [Kra07] ou la proposition 1.4 de [Dav11b] (avec l'entier eq égal\nà 1, voir §1.1.1 de loc. cit.).\nNotations 1.2.\n1. On fixe dans GK un élément de Frobenius σq pour q ; comme le caractère λ est\nd'image abélienne et non ramifié en q, l'image de σq par λ est indépendante\nde ce choix.\n2. On note N q le cardinal du corps résiduel de K en q.\n\n4\n\n\fProposition 1.3. On suppose que E a réduction multiplicative en q. Alors λ2 (σq )\nvaut 1 ou (N q)2 modulo p.\nDémonstration. Voir par exemple la proposition 1.1.1 de [Dav08] ou la proposition 1.4 de [Dav11b].\nOn rappelle également les résultats de [ST68] qui serviront dans la suite (voir\naussi la proposition 1.1.2 de [Dav08] ou la partie 1.3.2 de [Dav11b]).\nProposition 1.4 (Théorème 3 de [ST68]). On suppose que E a bonne réduction\nen q. Alors le polynôme caractéristique de l'action de σq sur le module de Tate\nen p de E est à coefficients\n√ dans Z (et indépendant de p) ; ses racines ont pour\nvaleur absolue complexe N q.\nNotations 1.5.\n1. On note Pq (X) le polynôme caractéristique de l'action de σq sur le module\nde Tate en p de E. Il est de la forme X√2 − Tq X + N q avec Tq un entier\nde valeur absolue inférieure ou égale à 2 N q. Son discriminant Tq2 − 4N q\nest donc un entier négatif et ses racines sont conjuguées complexes l'une de\nl'autre.\n2. On note Lq le sous-corps engendré dans C par les racines de Pq (X) ; le\ncorps Lq est soit Q soit un corps quadratique imaginaire.\nProposition 1.6. On suppose que E a bonne réduction en q. Soit P q un idéal\npremier de Lq au-dessus de p. Alors les images dans OLq /P q des racines de Pq (X)\nsont dans F×\np ; il existe une racine βq de Pq (X) vérifiant :\n\u0001\n\u0001\n\u0001\nλ(σq ), χp λ−1 (σq ) = βq mod P q, βq mod P q .\n\nDémonstration. Cela résulte de la réductibilité de la représentation φE,p (voir\naussi la proposition 1.1.2 de [Dav08] ou la proposition 1.8 de [Dav11b]).\n\n1.2\n\nAux places finies au-dessus de p : action de l'inertie\n\nSoit p un idéal premier de K situé au-dessus de p. On fixe dans GK un sousgroupe d'inertie Ip pour p.\nProposition 1.7.\n1. On suppose que E a réduction multiplicative en p. Alors λ restreint à Ip est\ntrivial ou égal à χp .\n2. On suppose que E a bonne réduction en p. Alors cette réduction est ordinaire\net λ restreint à Ip est trivial ou égal à χp .\nDémonstration. Lorsque E a réduction multiplicative en p, le résultat est donné\npar la proposition 13 (et son corollaire) de [Ser72], §1.12.\nLorsque E a bonne réduction en p, on suppose d'abord par l'absurde que E a\nréduction supersingulière en p. Alors, par la proposition 12 (§1.11(2)) de [Ser72],\n\n5\n\n\fl'image par Ip de φE,p est un groupe cyclique d'ordre p2 − 1. Ceci contredit l'hypothèse que la représentation φE,p est réductible et que l'ordre de son image divise\ndonc p(p − 1)2 . La courbe E a ainsi réduction ordinaire en p ; le résultat découle\nalors de la proposition 11 et son corollaire dans [Ser72] (§1.11(1)) (voir aussi la\nproposition 3 de [Kra07]).\nNotation 1.8. On note ap l'entier, égal à 0 ou 1, tel que λ restreint au sous-groupe\na\nd'inertie Ip coı̈ncide avec χpp .\n\n2\n\nDes propriétés globales\n\n2.1\n\nThéorie du corps de classes pour le caractère λ2\n\nLa théorie du corps de classes globale associe au caractère abélien λ2 de GK\n×\n×\ndans F×\np un morphisme de groupes du groupe des idèles AK de K dans Fp qui est\ncontinu et trivial sur les idèles diagonales. On note r ce morphisme.\nPour toute place (finie ou infinie) ν de K, on note Kν le complété de K en ν\net rν la composée de l'injection de Kν× dans les idèles A×\nK et du morphisme r.\nLorsque ν est une place finie, on note UKν les unités du corps local Kν ; dans ce\ncas, on utilise indifféremment en indice la place ν et l'idéal maximal de K qui lui\ncorrespond.\nLes propriétés locales du caractère λ2 établies dans la partie 1 ont les interprétations suivantes pour le morphisme r (voir également [Dav08] §2.1, [Dav11b]\n§2.1 ou [Bil11] §2.3) pour des discussions semblables) :\n(i) pour une place infinie ν de K, l'application rν est triviale ;\n\n(ii) pour un idéal maximal q de K qui n'est pas au-dessus de p, l'application rq\nenvoie toute uniformisante de Kq sur λ2 (σq ) et sa restriction à UKq est\ntriviale ;\n(iii) pour un idéal maximal p de K au-dessus de p, la restriction de rp à UKp\ncoı̈ncide avec la composée d'applications\nNKp /Qp\n\nréduction\n\nélévation\n\nmodulo p\n\nà la puissance −2ap\n\nUKp −−−−−→ UQp −−−−−−→ F×\n−−−−−−−−−−−−→ F×\np −\np.\nNotations 2.1. Pour toute place ν de K, on note ιν le plongement de K dans le\ncomplété Kν . Pour tout idéal maximal L de K, on note valL la valuation de K\nassociée à L dont l'image est Z.\nProposition 2.2. Soit α un élément de K non nul et premier à p ; alors on a :\nY\nY\n2a\nval (α)\nNKp /Qp (ιp (α)) p mod p.\nλ2 (σq ) q\n=\nq∤p\n\np|p\n\nDémonstration. La démonstration repose sur le même principe que celle du lemme 1\nde [Mom95] (voir aussi la proposition 2.2.1 de [Dav08] ou la proposition 2.4\n\n6\n\n\fde [Dav11b]). L'image par r de l'idèle principale (ιν (α))ν étant triviale, on a (tous\nles produits étant finis) :\nQ\nQ\nQ\nQ\n1 = r ((ιν (α))ν ) = rν (ιν (α)) =\n1 × rq (ιq (α)) × rp (ιp (α))\nν\nq∤p\nν|∞\n\u0011 p|p\nQ\u0010\nQ 2\n−2ap\nvalq (α)\nλ (σq )\n×\n=\nNKp /Qp (ιp (α))\nmod p .\np|p\n\nq∤p\n\nNotations 2.3. Pour toute la suite du texte :\n• on suppose que l'extension K/Q est galoisienne et on note G son groupe\nde Galois ;\n• on fixe un idéal p0 de K au-dessus de p ;\n• pour tout élément τ de G, on note aτ l'entier ap associé à l'idéal p = τ −1 (p0 ) ;\n• on note N l'application de K dans lui-même qui envoie un élément\nQα sur la\nnorme tordue par les entiers (2aτ )τ ∈G (c'est-à-dire qu'on a N (α) = τ ∈G τ (α)2aτ ) ;\non remarque que l'application N préserve K × , OK et les éléments de K premiers à p.\nAvec ces notations, la proposition 2.2 admet la reformulation globale suivante.\nProposition 2.4. Soit α un élément de K non nul et premier à p ; alors on a :\nY\nval (α)\nλ2 (σq ) q\n= ιp0 (N (α)) mod p0 .\nq∤p\n\nQ\n2a\nDémonstration. L'élément p|p NKp /Qp (ιp (α)) p de Zp est l'image par l'injection\nQ\ncanonique ιp0 de K dans son complété Kp0 de l'élément τ ∈G τ (α)2aτ de K.\n\n2.2\n\nBorne pour la hauteur d'un générateur d'idéal\n\nCette partie reprend les résultats de la partie 2.3 de [Dav08] (voir aussi les\nparties 2.3 et 2.4 de [Dav11b]) qui donnent une borne pour toutes les valeurs\nabsolues archimédiennes de la norme tordue N d'un certain générateur d'idéal\ndans OK .\n\nNotations 2.5. On note dK le degré du corps K sur Q et hK son nombre de classes\nd'idéaux. Soit α un élément non nul de K. On note H la hauteur absolue de α\ndéfinie par\n\n1/dK\nY\nH(α) = \nmax (1, |α|ν )\n,\nν place de K\n\navec les normalisations suivantes pour les valeurs absolues | * |ν :\n• si ν est une place réelle, associée à un élément τ de G, | * |ν = |τ (*)|C ;\n• si ν est une place complexe, associée à un élément τ de G, | * |ν = |τ (*)|2C ;\n• si ν est une place finie, associée à un idéal premier L de K, |*|ν = (N L)−valL (*) .\n\n7\n\n\fLorsque α est un entier de K, les seules places apportant une contribution non\ntriviale dans le produit définissant H(α) sont les places infinies.\nLemme 2.6. Soit α un élément non nul de OK ; alors, pour tout τ dans G, on a :\n|τ (N (α))|C ≤ H(α)2dK .\nDémonstration. La démonstration repose sur un calcul semblable à celui de la\ndémonstration de la proposition 2.3.1 de [Dav08] (voir aussi le lemme 2 (partie 2.3)\nde [Dav11b]), à ceci près que les entiers intervenant en exposant dans la définition\nde N valent ici 0 ou 2, alors qu'ils sont compris entre 0 et 12 dans loc. cit..\nNotations 2.7. Suivant [BG96], on note :\n• RK le régulateur de K ;\n• rK le rang du groupe des unités de K (K étant supposé galoisien sur Q, rK\nvaut dK − 1 si K est totalement réel et d2K − 1 sinon) ;\n• δK un réel strictement positif minorant dK ln (H(α)) pour tout élément non\nnul α de K qui n'est pas une racine de l'unité ; si dK est égal à 2, on peut\nln 2\nprendre δK égal à rK\n+1 ; si dK est supérieur ou égal à 3, on peut prendre δK\n\u00113\n\u0010\nln(ln dK )\n1\n1\n.\nou\négal à 53dK ln(6d\n1201\nln dK\nK)\n\nDéfinition 2.8 (Borne C1 (K)). On pose :\n\n−(rK −1)\n\nC1 (K) =\n\nrK +1\nrK\nδK\n2\n\n.\n\nOn remarque que C1 (K) peut s'exprimer en n'utilisant que le degré dK de K\nsur Q. Avec ces notations, le lemme 2 (partie 3) de [BG96] s'écrit de la manière\nsuivante.\nLemme 2.9. Pour tout élément non nul α de OK , il existe une unité u de K\nvérifiant :\n1/dK\nexp (C1 (K)RK ) .\nH(uα) ≤ NK/Q (α)\nDéfinition 2.10 (Borne C2 (K)). On pose :\nC2 (K) = exp (2dK C1 (K)RK ) .\nOn remarque que C2 (K) ne dépend que du degré et du régulateur de K.\nProposition 2.11. Soit L un idéal maximal de K. Il existe un générateur γL\nde LhK satisfaisant pour tout τ dans G :\n|τ (N (γL ))|C ≤ (N L)2hK C2 (K).\nDémonstration. Par le lemme 2.9, on peut choisir un générateur de l'idéal principal LhK dont la hauteur est bornée par (N L)hK /dK exp (C1 (K)RK ) ; on conclut\nalors par le lemme 2.6 (voir aussi la proposition 2.3.4 de [Dav08] ou la proposition 2.11 de [Dav11b]).\n8\n\n\f2.3\n\nUne version effective du théorème de Chebotarev\n\nThéorème (Chebotarev effectif, [LMO79]). Il existe une constante absolue\net effectivement calculable A ayant la propriété suivante : soient M un corps de\nnombres, N une extension finie galoisienne de M , ∆N le discriminant de N , C\nune classe de conjugaison du groupe de Galois Gal(N/M ) ; alors il existe un idéal\npremier de M , non ramifié dans N , dont la classe de conjugaison des frobenius\ndans l'extension N/M est la classe de conjugaison C et dont la norme dans l'extension M/Q est un nombre premier rationnel inférieur ou égal à 2(∆N )A .\nNotation 2.12. On note ∆K le discriminant de K.\nDéfinition 2.13 (Ensemble d'idéaux JK ). On note JK l'ensemble des idéaux\nmaximaux de K dont la norme dans l'extension K/Q est un nombre premier rationnel totalement décomposé dans K et inférieur ou égal à 2(∆K )AhK .\nProposition 2.14. Toute classe d'idéaux de K contient un idéal de JK .\nDémonstration. Voir [Dav08], proposition 3.1.2 ou [Dav11b], proposition 4.2.\n\n3\n3.1\n\nDémonstrations des théorèmes\nCompatibilité des actions au-dessus et hors de p\n\nNotations 3.1. Soit q un idéal maximal de K premier à p en lequel E a bonne\nréduction.\n1. On fixe un idéal pq0 de KLq au-dessus de p0 (voir notations 1.5 et 2.3).\nComme le corps Lq est soit Q, soit un corps quadratique imaginaire, il y a\nau plus deux choix possibles pour pq0 ; si Lq est inclus dans K, le seul choix\npossible pour pq0 est pq0 = p0 .\n2. On note P0q l'unique idéal de Lq situé au-dessous de pq0 .\n3. D'après la proposition 1.6, il existe une racine du polynôme Pq (X) dont la\nclasse modulo P0q (qui est dans Fp ) vaut λ(σq ) ; on note βq une telle racine.\nDéfinition 3.2 (Borne C(K, n)). Pour tout entier n, on pose :\n\u00012dK\n.\nC(K, n) = n2hK C2 (K) + nhK\n\nProposition 3.3. Soient q un idéal maximal de K premier à p et γq un générateur\nde qhK vérifiant l'inégalité de la proposition 2.11. On suppose que p est strictement\nsupérieur à C(K, N q). Alors on est dans l'un des trois cas suivants (avec les\nnotations 2.3 et 3.1) :\nType de réduction de E en q\nmultiplicatif\nbon\n\nλ2 (σq )\n\nN (γq )\n\nCas\n\n1 mod p\n\nN (γq ) = 1\n\nM0\n\n(N q)2 mod p\nβq2 mod\n9\n\nP0q\n\nN (γq ) = (N q)2hK\nN (γq ) = βq2hK\n\nM1\nB\n\n\fDémonstration. La démonstration est semblable à celle de la proposition 2.4.1\nde [Dav08] (ou de la proposition 2.14 de [Dav11b]). On en rappelle ici le principe.\nD'après les propositions 1.3 et 1.6 et en appliquant la proposition 2.4 à l'élément γq\nde OK , on obtient qu'on est dans l'un des trois cas suivants :\nType de réduction de E en q\nmultiplicatif\n\nλ2 (σq )\n\nCongruence\n\nCas\n\n1 mod p\n\nN (γq ) ≡ 1 mod p0\n\nM0\n\n2\n\n(N q) mod p\nβq2 mod P0q\n\nbon\n\n2hK\n\nN (γq ) ≡ (N q)\n\nmod p0\n\nN (γq ) ≡ βq2hK mod pq0\n\nM1\nB\n\nAinsi, selon chaque cas, \u0001p divise l'un des trois entiers\u0001 relatifs NK/Q (N (γq ) − 1),\nNK/Q N (γq ) − (N q)2hK ou NKLq /Q N (γq ) − βq2hK . Comme p est choisi strictement supérieur à C(K, N q), qui par la proposition 2.11 est supérieur ou égal\naux valeurs absolues de ces trois entiers, on obtient que dans chaque cas, l'entier\nrelatif en question est nul, ce qui donne la conclusion de la proposition.\nProposition 3.4. Soient q un nombre premier rationnel totalement décomposé\ndans K et q un idéal premier de K au-dessus de q. On suppose que p est strictement\nplus grand que C(K, q). Alors on est dans l'un des quatre cas suivants (avec les\nnotations 3.1) :\nλ2 (σq )\n\nFamille (aτ )τ ∈G\n\nCas\n\n1 mod p\n\n∀τ ∈ G, aτ = 0\n\nM0\n\n∀τ ∈ G, aτ = 1\n\nM1\n\nRéduction de E en q\nmultiplicative\n\nq\nbonne (ordinaire),\ncorps Lq quadratique,\ninclus dans K,\np décomposé dans Lq\n\n2\n\nmod p\n\nq\n\nNK/Lq (q) = βq OLq\n\nNK/Lq (q) = βq OLq\n\n∀τ ∈ Gal(K/L ), aτ = 1\n\nBO\n\net aτ = 0 sinon\n∀τ ∈ Gal(K/Lq ), aτ = 0\n\nBO'\n\net aτ = 1 sinon\n\nDémonstration. La démonstration est semblable à celle de la proposition 2.15\nde [Dav11b] (voir aussi la proposition 2.4.2 de [Dav08] et le lemme 2 de [Mom95]).\nOn en rappelle ici les principaux arguments, car la proposition 3.4 est centrale\npour la démonstration du théorème II.\nComme le nombre premier q est supposé totalement décomposé dans l'extension galoisienne K/Q, les idéaux τ (q) sont deux à deux distincts lorsque τ décrit G,\nleur produit est l'idéal qOK et la norme de q dans K/Q est égale à q. En particulier, en supposant que p est strictement supérieur à C(K, q), on se place dans\nles hypothèses de la proposition 3.3. On raisonne donc selon les trois cas de cette\nproposition.\n\n10\n\n\fL'idéal engendré par N (γq ) dans OK est :\nN (γq )OK =\n\nY\n\nτ (γq )2aτ\n\nτ ∈G\n\n!\n\nOK =\n\nY\n\nτ q\n\nτ ∈G\n\n\u0001\u0001\nhK 2aτ\n\n=\n\nY\n\naτ\n\nτ (q)\n\nτ ∈G\n\n!2hK\n\nDans les cas M0 et M1, la comparaison de l'idéal engendré dans OK par N (γq )\navec celui engendré par 1 ou q 2hK donne le résultat de la proposition.\nDans le cas B, l'élément N (γq ) de K est contenu dans Lq ; ainsi, soit il est\nrationnel, soit il engendre Lq (qui est alors contenu dans K).\nOn suppose d'abord que N (γq ), qui est égal à βq2hK , est rationnel. Alors βq2hK\nest à la fois un entier algébrique (de Lq ) et rationnel ; il appartient donc à Z.\nComme sa valeur absolue complexe est q hK , on a βq2hK égal à q hK ou −q hK . Dans\nles deux cas, βq2hK , qui est égal à N (γq ), engendre dans OK l'idéal :\nY\n\nτ ∈G\n\naτ\n\nτ (q)\n\n!2hK\n\n= N (γq )OK =\n\nβq2hK OK\n\n=q\n\nhK\n\nOK =\n\nY\n\nτ ∈G\n\n! hK\n\nτ (q)\n\n.\n\nCeci est impossible (avec les idéaux (τ (q))τ ∈G deux à deux distincts et les entiers (aτ )τ ∈G valant 0 ou 1).\nAinsi, l'élément N (γq ) de K engendre Lq , qui est quadratique imaginaire et\ncontenu dans K. La fin de la démonstration de la proposition 2.15 de [Dav11b] (à\npartir de la page 20 ; voir aussi la proposition 2.4.2 de [Dav08]) s'applique alors\ndirectement, en prenant garde que les entiers (aτ )τ ∈G de loc. cit. valent 12 fois\nceux du présent texte.\nOn résume ici les étapes de cette démonstration. Le fait que N (γq ) appartienne à Lq donne que les entiers (aτ )τ ∈G sont constants sur les classes modulo Gal(K/Lq), sous-groupe d'indice 2 de Gal(K/Q). Alors N (γq ) engendre\ndans OLq l'idéal (avec γ un élément de G induisant sur Lq la conjugaison complexe) :\nN (γq )OLq = (βq OLq )\n\n2hK\n\n=\n\n\u0010\n\n\u0011aγ \u00112hK\n\u0001a \u0010\n.\nNK/Lq (q) id NK/Lq (q)\n\nComme on a supposé q totalement décomposé dans l'extension K/Q, q est également\ntotalement décomposé dans les extensions Lq /Q et K/Lq. La norme NK/Lq (q) est\ndonc un idéal premier de Lq au-dessus de q. Or l'égalité q = βq βq indique que\nles deux idéaux premiers (distincts) de Lq au-dessus de q sont βq OLq et βq OLq .\nAinsi NK/Lq (q) est égal soit à βq OLq soit à βq OLq . L'égalité entre idéaux ci-dessus\ndonne alors les cas BO et BO' de la proposition.\nComme le polynôme X 2 − TqX + q (voir les notations 1.5) est scindé modulo p\n(voir la proposition 1.6), l'entier Tq2 − 4q est un carré modulo p. Ainsi, soit p est\ndécomposé dans Lq, soit p divise l'entier relatif non nul Tq2 − 4q. Comme la valeur\nabsolue de Tq2 − 4q est 4q − Tq2 et inférieure ou égale à 4q, le choix de p strictement\nsupérieur à C(K, q) (cette borne étant strictement supérieure à 4q), implique que p\nest décomposé dans le corps quadratique Lq .\n11\n\n\fEnfin, on suppose par l'absurde que E a réduction supersingulière en q. Ceci\néquivaut à ce que q divise Tq , entier relatif de valeur absolue inférieure ou égale\n√\nà 2 q. Alors on est dans l'un des cas suivants : Tq est nul ; q est égal à 2 et Tq est\négal à 0, 2 ou −2 ; q est égal à 3 et Tq est égal√à 0, 3 ou −3. Si Tq est nul ou q est\négal à 3 et Tq vaut ±3, alors Lq est égal à Q( −q), dans lequel q est ramifié ; si q\nest égal à 2 et Tq vaut ±2, alors Lq est égal à Q(i), dans lequel 2 est ramifié. Or,\non a montré que q est décomposé dans le corps Lq, qui est inclus dans K. On en\ndéduit que E a réduction ordinaire en q.\nDéfinition 3.5 (Borne CK ). On pose\n\u0012\n\u00112 \u0013\n\u0001 \u0010\ndK hK\nAhK\n2\n.\n, 1+3\nCK = max C K, 2(∆K )\n\nLe nombre CK ne dépend que du corps de nombres K.\nLes bornes uniformes sur l'ordre des points de torsion d'une courbe elliptique\nfigurant dans [Mer96] ou [Par99] permettent d'éliminer les cas M0 et M1 de la\nproposition 3.4 (voir aussi l'appendice B de [Kra07]).\n\nProposition 3.6. On suppose que p est strictement supérieur à CK . Alors, en tout\nidéal de JK , la courbe E a bonne réduction et tous les idéaux de JK appartiennent\nau même cas (BO ou BO') de la proposition 3.4.\nDémonstration. Par construction, la borne CK est supérieure ou égale à la borne C(K, q)\npour tout nombre premier rationnel q totalement décomposé dans K et inférieur\nou égal à 2(∆K )AhK . Ainsi, pour tout idéal q dans JK , on est dans les conditions\nd'application de la proposition 3.4.\nChaque cas de la proposition 3.4 (M0, M1, BO et BO') détermine une famille\ndifférente de coefficients (aτ )τ ∈G (on distingue les cas BO et BO' par le fait que\ndans le cas BO, l'ensemble des éléments τ de G pour lesquels aτ est égal à 1\nest un sous-groupe de G alors que dans le cas BO', c'est le complémentaire d'un\nsous-groupe).\nPour éliminer les cas M0 et M1, on raisonne comme dans le lemme 3.8 de [Dav11a]\n(voir aussi la partie 3.2.1 de [Dav08] ou [Dav11b], proposition 3.4).\nDans le cas M0, pour tout idéal premier p de K au-dessus de p, le coefficient ap est nul. Par définition de ap (notation 1.8), cela implique que caractère λ\nest non ramifié en toute place de K au-dessus de p. Ainsi, l'extension K λ de K\ntrivialisant λ, qui est abélienne, est non ramifiée en toute place finie de K (voir\nproposition 1.1) ; le corps K λ est donc inclus dans le corps de classes de Hilbert\nde K et son degré (sur Q) est inférieur ou égal à dK hK . Or, la courbe E possède un\npoint d'ordre p défini sur K λ . D'après des travaux de Merel et Oesterlé mentionnés\ndans les introductions de [Par99] et [Mer96], on a alors\n\u00112\n\u0010\ndK hK\n,\np≤ 1+3 2\n\nce qui contredit le choix de p strictement supérieur à CK .\nDans le cas M1, pour tout idéal premier p de K au-dessus de p, ap est égal\nà 1. Ainsi, le caractère χp λ−1 est non ramifié en toute place de K au-dessus de p,\n12\n\n\fet par suite en toute place finie de K. On considère alors le quotient de E par\nle sous-groupe d'isogénie W . On obtient une courbe elliptique E ′ définie sur K,\nisogène à E sur K ; le sous-groupe E[p]/W de E ′ est défini sur K et d'ordre p\net le caractère d'isogénie associé à ce sous-groupe est χp λ−1 . Le caractère χp λ−1\nétant non ramifié en toute place finie de K, on applique le même raisonnement\nque précédemment.\n\n3.2\n\nVers un Grössencharakter\n\nProposition 3.7. On suppose que p est strictement supérieur à CK .\n1. Il existe un unique corps quadratique imaginaire L contenu dans K tel que\npour tout q dans JK , Lq est égal à L.\n\n2. Le corps de classes de Hilbert de L est contenu dans K.\n3. Le nombre premier p est décomposé dans L.\n\n4. Il existe un unique idéal premier pL de L au-dessus de p tel que λ est non\nramifié hors de pL .\n5. Soit p un idéal premier de K au-dessus de p ; alors ap est égal à 1 si et\nseulement si p est au-dessus de pL ; sinon, ap est égal à 0.\n6. Soit q dans JK ; il existe une racine βq′ de Pq (X) vérifiant NK/L (q) = βq′ OL\net λ(σq ) = βq′ mod pL .\nDémonstration. On est dans les conditions de la partie 4.2.2 de [Dav11b] (voir\naussi la partie 3.2.3 de [Dav08] et le théorème 1 de [Mom95]). Les cinq premiers\npoints de la proposition découlent ainsi des propositions 4.6, 4.7 et 4.8 de [Dav11b]\n(ou de manière équivalente de la proposition 3.2.5 et des lemmes 3.2.8 et 3.2.9\nde [Dav08]). Pour le point 5, on notera que l'entier ap de [Dav11b] et [Dav08]\nvaut 12 fois l'entier ap du présent texte.\nOn démontre enfin le point 6. En suivant les notations 3.1, on a λ(σq ) = βq\nmod P0q. D'après la remarque 3.2.10 de [Dav08] (voir aussi les démonstrations\ndes propositions 4.8 et 4.10 de [Dav11b]), l'idéal pL du point 4 est égal à P0q si\ntous les idéaux de JK sont de type BO dans la proposition 3.4 et il est égal au\nconjugué complexe de P0q si tous les idéaux de JK sont de type BO'. Or, d'après\nla proposition 3.4, on a NK/L (q) = βq OL dans le cas BO et NK/L (q) = βq OL\ndans le cas BO'. On peut donc prendre βq′ = βq dans le cas BO et βq′ = βq dans\nle cas BO'.\nLemme 3.8. Soit α un élément non nul de K premier à pL ; alors on a :\nY\nval (α)\nλ (σq ) q\n= NK/L (α) mod pL .\nq∤pL\n\nDémonstration. On note r′ et (rν′ )ν les applications associées par la théorie du\ncorps de classes au caractère λ, comme les applications r et (rν )ν sont associées\nau caractère λ2 au début de la partie 2.1.\n\n13\n\n\fD'après la proposition 3.7, le caractère λ est non ramifié hors de pL et pour\ntout idéal premier p au-dessus de pL , on a ap = 1. De plus, par le point 1 de la proposition 3.7 le corps K contient un corps quadratique imaginaire. Ainsi, toutes ses\nplaces archimédiennes sont complexes et pour toute telle place ν, l'application rν′\nest triviale. On obtient donc, comme dans la démonstration de la proposition 2.2 :\nQ\nQ\nQ ′\nQ ′\n1 = r′ ((ιν (α))ν ) = rν′ (ιν (α)) =\n1×\nrq (ιq (α)) ×\nrp (ιp (α))\nν\nν|∞\np|pL\nq∤pL\n\u0010\n\u0011\nQ\nQ\nNKp /Qp (ιp (α))−ap mod p\n=\nλ(σq )valq (α) ×\np|pL\nq∤pL\n!−1\nQ\nQ\n=\nλ(σq )valq (α) ×\nNKp /Qp (ιp (α)) mod p\n.\nq∤pL\n\np|pL\n\nComme le nombre premier p est décomposé dans L (point 3 de la proposition 3.7),\nle complété LpL de L en pL coı̈ncide avec Qp et on a :\nY\nY\nNKp /LpL (ιp (α)) mod p = NK/L (α) mod pL .\nNKp /Qp (ιp (α)) mod p =\np|pL\n\np|pL\n\nProposition 3.9. Soit q un idéal maximal de K premier à pL . Il existe un unique\nélément αq de OL vérifiant :\nNK/L (q) = αq OL et λ(σq ) = αq mod pL .\nDémonstration. Soit q un idéal maximal de K premier à pL . D'après la proposition 2.14, il existe un idéal premier q′ dans JK et un élément non nul α de K qui\nvérifient : q = q′ * (αOK ).\nSoit βq′ ′ dans OL qui vérifie le point 6 de la proposition 3.7 pour l'idéal q′ .\nAlors l'idéal (entier) NK/L (q) de OL est engendré par βq′ ′ × NK/L (α). De plus, par\nle lemme 3.8 appliqué à α, on a :\nλ(σq )λ(σq′ )−1 = NK/L (α) mod pL .\nComme on a, par choix de βq′ ′ , λ(σq′ ) = βq′ ′ mod pL , on obtient finalement :\n\u0001\nλ(σq ) = λ(σq′ ) NK/L (α) mod pL = βq′ ′ × NK/L (α) mod pL .\n\nAinsi, on peut prendre pour αq l'élément βq′ ′ × NK/L (α) de OL .\nOn suppose que deux éléments αq et α′q de OL satisfont la conclusion de la\nproposition. Alors αq et α′q engendrent le même idéal de OL , donc sont associés\npar une unité uq de OL . Comme αq et α′q ont même image (non nulle) modulo pL ,\nl'unité uq se réduit sur 1 modulo pL . Pour p supérieur ou égal à 5, cela implique\nque uq est égal à 1, donc que αq et α′q sont égaux.\nLemme 3.10. Soit α un élément non nul de K premier à pL ; alors on a dans L :\nY val (α)\nαq q .\nNK/L (α) =\nq∤pL\n\n14\n\n\fQ\nval (α)\net NK/L (α)\nDémonstration. Par la proposition 3.9, les éléments q∤pL αq q\nengendrent le même idéal fractionnaires de L. Ils diffèrent donc d'une unité uα\nde L. Par le lemme 3.8 et la proposition 3.9, on a :\nY val (α)\nαq q\nmod pL ≡ NK/L (α) mod pL .\nq∤pL\n\nAinsi, l'unité uα se réduit sur 1 modulo pL . Pour p supérieur ou égal à 5, on obtient\ndonc que uα est égal à 1.\nDans le but d'étendre la relation du lemme 3.10 à tous les éléments non nuls\nde K, on associe à tout idéal premier p de K au-dessus de pL un élément αp de L×\nde la manière suivante.\nNotation 3.11. Soit p un idéal premier de K au-dessus de pL . On fixe un élément xp\nde K × vérifiant :\n(i) valp (xp ) = 1 ;\n(ii) pour tout idéal p′ de K au-dessus de pL différent de p, valp′ (xp ) = 0.\nOn définit alors :\n\nY\n\nαp = NK/L (xp )\n\n−valq (xp )\n\nαq\n\n.\n\nq∤pL\n\nLemme 3.12. Soit α un élément non nul de K. Alors on a dans L :\nY\nν (α)\nαval\n.\nNK/L (α) =\nν\nν∤∞\n\nDémonstration. On considère : α′ = α\n\n−valp (α)\n\nQ\n\nxp\n\n. Par choix des (xp )p|pL , α′ est\n\np|pL\n\npremier à pL ; on a donc par le lemme 3.10 : NK/L (α′ ) =\n\nQ\n\nvalq (α′ )\n\nαq\n\nq∤pL\n\ndéduit :\nNK/L (α)\n\n= NK/L (α′ )\n\nQ\n\nNK/L (xp )valp (α)\n\np|pL\n\n=\n\nQ\n\nval (α′ )\nαq q\n\nQ\n\nq∤pL\n\n=\n\nQ\n\nαp\n\np|pL\nvalp (α)\n\nQ\n\nαp\n\np|pL\n\nQ\n\nval (x )\nαq q p\n\n!valp (α)\n\nq∤pL\nP\nvalq (α′ )+\nvalq (xp )valp (α)\n\nαq\n\np|pL\n\nq∤pL\n\nOr, pour un idéal premier q de K premier à pL , on a :\nX\nvalq (xp )valp (α).\nvalq (α′ ) = valq (α) −\np|pL\n\nOn en déduit : NK/L (α) =\n\nQ\n\nvalν (α)\n\nαq\n\n.\n\nν∤∞\n\n15\n\n.\n\n. On en\n\n\f3.3\n\nDémonstration du théorème II\n\nOn rappelle que l'existence d'une courbe semi-stable sur K et ayant des multplications complexes sur K est caractérisée par l'existence de certains caractères\ndes idèles de K, selon la proposition suivante (voir la partie 2.1 pour les notations).\nProposition 3.13. Les assertions suivantes sont équivalentes.\n1. Il existe une courbe elliptique définie sur K, ayant des multiplications complexes sur K et partout bonne réduction sur K.\n2. Il existe un corps quadratique imaginaire F contenu dans K et un caractère\n×\ncontinu ε de A×\nvérifiant :\nK dans F\nQ × Q\nUKν de A×\nKν\n(i) ε est trivial sur le sous-groupe\nK;\nν|∞\n\nν∤∞\n\n(ii) ε coı̈ncide avec la norme NK/F sur les idèles principales.\n\nDémonstration. On renvoie à [Ser72], §4.5 (théorème 5 et remarque 2) et §3.1. On\nremarquera que la semi-stabilité sur K d'une courbe elliptique à multiplications\ncomplexes associée au caractère ε provient plus spécialement de la condition (i).\nThéorème 3.14 (Théorème II). On suppose que le corps K est galoisien sur Q\net qu'il existe une courbe elliptique E semi-stable sur K et un nombre premier p\nstrictement supérieur à CK tels que la représentation φE,p est réductible.\nAlors il existe une courbe elliptique E ′ définie sur K, ayant des multiplications\ncomplexes sur K et partout bonne réduction sur K, telle que que la semi-simplifiée\nde la représentation φE,p est isomorphe à la représentation φE ′ ,p .\nDémonstration. On est dans les conditions d'application de la partie 3.2. Avec les\nnotations de cette partie, on considère le corps quadratique imaginaire L (contenu\ndans K) donné par la proposition 3.7 et la famille (αν )ν∤∞ d'éléments de L×\ndonnée par la proposition 3.9 et la notation 3.11.\n×\nOn définit un caractère continu ε de A×\nK dans L par :\nQ × Q\nU Kν ;\n(i) ε est trivial sur le sous-groupe\nKν\nν|∞\n\nν∤∞\n\n(ii) pour toute place finie ν de K, ε envoie toute uniformisante de Kν sur αν .\n\nD'après le lemme 3.12, ε coı̈ncide donc avec la norme NK/L sur les idèles diagonales.\nPar la proposition 3.13 et la partie 4.5 (remarque 2) de [Ser72], le caractère ε\nest associé à une courbe elliptique E ′ définie sur K, ayant des multiplications complexes par un ordre de L et partout bonne réduction sur K. La représentation φE ′ ,p\n×\nde GK associée aux points de p-torsion de E ′ est abélienne et à valeurs dans (OL /pOL ) .\nComme p est décomposé dans L (proposition 3.7), φE ′ ,p est la somme de deux caractères de GK , chacun à valeurs dans F×\np , et vérifie, pour tout idéal premier q\nde K premier à p :\nφE ′ ,p (σq ) = (αq mod pL , αq mod pL ).\n\n16\n\n\fLa représentation φE,p est réductible ; sa semi-simplifiée est donc la somme des\ndeux caractères λ et χp λ−1 , chacun à valeurs dans F×\np . D'après la proposition 3.9,\non a pour tout idéal premier q de K premier à p :\nφE,p (σq ) =\n=\n\n(αq mod pL , (N q)α−1\nmod pL )\nq\n(αq mod pL , αq mod pL ) = (αq mod pL , αq mod pL ).\n\nAinsi, la semi-simplifiée de φE,p et la représentation φE ′ ,p sont isomorphes.\nLe théorème I de l'introduction est une conséquence directe du théorème II.\n\n3.4\n\nExemples de corps vérifiant le théorème I\n\nDans cette partie on donne quelques exemples de corps vérifiant le théorème I.\nThéorème III. On suppose que le corps K est galoisien sur Q et vérifie l'une\ndes propriétés suivantes.\n1. Le corps K ne contient le corps de classes de Hilbert d'aucun corps quadratique imaginaire. Cette situation se produit notamment dans les cas suivants :\n(1a) K est de degré impair sur Q ;\n(1b) K est totalement réel.\n2. Pour tout corps quadratique imaginaire L dont le corps de classes de Hilbert\nest inclus dans K, il existe une unité de K (pouvant dépendre de L) dont la\nnorme dans l'extension K/L est différente de 1. Cette situation se produit\nnotamment dans les cas suivants :\n(2a) le degré de K sur Q est le double d'un nombre impair ;\n(2b) K est égal à F M , avec F un corps quadratique imaginaire et M un\ncorps totalement réel, galoisien, possédant une unité de norme sur Q\négale à −1 ;\n(2c) K vérifie la condition (C) de [Kra07].\n\nAlors il n'existe pas de courbe elliptique définie sur K, ayant des multiplications\ncomplexes sur K et partout bonne réduction sur K.\nDémonstration. On montre d'abord que les propriétés 1 et 2 du théorème impliquent sa conclusion.\nOn suppose pour cela qu'il existe une courbe elliptique E définie sur K, ayant\ndes multiplications complexes sur K et semi-stable sur K, c'est-à-dire ayant partout bonne réduction sur K. Soit R l'anneau des endomorphismes de E sur K.\nAlors R est un ordre dans un corps quadratique imaginaire L, qui est donc contenu\ndans K (voir [Ser72] §4.5). De plus l'invariant j de E (qui est contenu dans K) engendre sur L un corps qui contient le corps de classes de Hilbert de L (voir [Ser67]).\nAinsi, K contient L et son corps de classes de Hilbert. Ceci montre que, si K\nvérifie la propriété 1, alors une telle courbe elliptique n'existe pas.\n×\nDe plus, il est associé à la courbe E un caractère ε de A×\ncomme\nK dans L\ndans la proposition 3.13. Les propriétés du caractère ε donnent alors que la norme\n17\n\n\fde toute unité de K dans l'extension K/L est égale à 1. Ceci montre donc que,\nsi K vérifie la propriété 2, alors un tel caractère ε n'existe pas.\nSi le corps K vérifie (1a) ou (1b), alors il vérifie la propriété 1 du théorème.\nSi le corps K vérifie (2a), alors −1 vérifie la propriété 2 pour tout corps quadratique imaginaire L contenu dans K. On suppose que le corps K vérifie (2b). Soit u\nune unité de M de norme (sur Q) égale à −1. Alors pour tout corps quadratique\nimaginaire L inclus dans K, les corps L et M sont linéairement disjoints et on\na : NK/L (u) = NM/Q (u) = −1. Ainsi, K vérifie la propriété 2.\nOn démontre enfin que si K vérifie la condition (C) de [Kra07], il vérifie la\npropriété 2 du théorème. On utilise ici les notations de la partie 1.1.2 de [Kra07].\nSoit n égal à d2K . La condition (C) donne une unité u de K telle que 1 n'est pas\n(u)\n(u)\nracine du polynôme Hn (X). Or, les racines de Hn (X) sont les produits de n\nracines (pas forcément distinctes) du polynôme minimal de u sur Q. En particulier,\npour tout corps quadratique imaginaire L inclus dans K, la norme NK/L (u) de u\n(u)\n\ndans l'extension K/L est une racine de Hn (X). Cette norme est donc différente\nde 1 et l'unité u satisfait la propriété 2 pour tous les corps L considérés.\nRemarques 3.15.\n1. D'après le théorème 1 de [Kra07], tous les corps de nombres satisfaisant la\ncondition (C) de [Kra07] vérifient l'assertion 2 du théorème I de l'introduction. Ils vérifient donc aussi l'assertion nécessaire 1. Le théorème III donne\nune démonstration directe de ce fait.\n2. Parmi les corps satisfaisant la condition (C) de [Kra07] et qui ne figurent\npas explicitement dans les autres cas du théorème III, on notera les corps de\ngroupe de Galois isomorphe à un groupe symétrique ou à un groupe alterné et\nles corps cyclotomiques engendrés par des racines de l'unité d'ordre premier\n(voir le théorème 2 de [Kra07]).\n\nRéférences\n[BG96]\n\nYann Bugeaud and Kálmán Győry. Bounds for the solutions of unit\nequations. Acta Arith., 74(1):67–80, 1996.\n\n[Bil11]\n\nNicolas Billerey. Critères d'irréductibilité pour les représentations des\ncourbes elliptiques. Int. J. Number Theory, 7(4):1001–1032, 2011.\n\n[BPR11] Yuri Bilu, Pierre Parent, and Marusia Rebolledo. Rational points\non X0+ (pr ). preprint, 2011. Disponible en ligne arXiv:1104.4641v1.\n[Dav08]\n\nAgnès David. Caractère d'isogénie et borne uniforme pour les homothéties. PhD thesis, IRMA, Strasbourg, 2008.\n\n[Dav11a] Agnès David. Borne uniforme pour les homothéties dans l'image de Galois associée aux courbes elliptiques. J. Number Theory, 131(11):2175–\n2191, 2011.\n[Dav11b] Agnès David. Caractère d'isogénie et critères d'irréductibilité. Soumis,\n2011. Disponible en ligne arXiv:1103.3892v2.\n18\n\n\f[Kra96]\n\nAlain Kraus. Courbes elliptiques semi-stables et corps quadratiques. J.\nNumber Theory, 60(2):245–253, 1996.\n\n[Kra07]\n\nAlain Kraus. Courbes elliptiques semi-stables sur les corps de nombres.\nInt. J. Number Theory, 3(4):611–633, 2007.\n\n[LMO79] J. C. Lagarias, H. L. Montgomery, and A. M. Odlyzko. A bound for\nthe least prime ideal in the Chebotarev density theorem. Invent. Math.,\n54(3):271–296, 1979.\n[Maz78] B. Mazur. Rational isogenies of prime degree (with an appendix by D.\nGoldfeld). Invent. Math., 44(2):129–162, 1978.\n[Mer96]\n\nLoı̈c Merel. Bornes pour la torsion des courbes elliptiques sur les corps\nde nombres. Invent. Math., 124(1-3):437–449, 1996.\n\n[Mom95] Fumiyuki Momose. Isogenies of prime degree over number fields. Compositio Math., 97(3):329–348, 1995.\n[Par99]\n\nPierre Parent. Bornes effectives pour la torsion des courbes elliptiques\nsur les corps de nombres. J. Reine Angew. Math., 506:85–116, 1999.\n\n[Ser67]\n\nJ.-P. Serre. Complex multiplication. In Algebraic Number Theory (Proc.\nInstructional Conf., Brighton, 1965), pages 292–296. Thompson, Washington, D.C., 1967.\n\n[Ser72]\n\nJean-Pierre Serre. Propriétés galoisiennes des points d'ordre fini des\ncourbes elliptiques. Invent. Math., 15(4):259–331, 1972.\n\n[ST68]\n\nJean-Pierre Serre and John Tate. Good reduction of abelian varieties.\nAnn. of Math. (2), 88:492–517, 1968.\n\n19\n\n\f"}