{"id": "http://arxiv.org/abs/0903.1670v1", "guidislink": true, "updated": "2009-03-10T01:52:26Z", "updated_parsed": [2009, 3, 10, 1, 52, 26, 1, 69, 0], "published": "2009-03-10T01:52:26Z", "published_parsed": [2009, 3, 10, 1, 52, 26, 1, 69, 0], "title": "Determining exciton bandwidth and film microstructure in polythiophene\n  films using linear absorption spectroscopy", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0903.3237%2C0903.1019%2C0903.1047%2C0903.1580%2C0903.3027%2C0903.1122%2C0903.0432%2C0903.3217%2C0903.0633%2C0903.0360%2C0903.4051%2C0903.3786%2C0903.3140%2C0903.5243%2C0903.3574%2C0903.0960%2C0903.1782%2C0903.4122%2C0903.2474%2C0903.3625%2C0903.3890%2C0903.1354%2C0903.1088%2C0903.1717%2C0903.3680%2C0903.1773%2C0903.0715%2C0903.1430%2C0903.4842%2C0903.4171%2C0903.3304%2C0903.0520%2C0903.5501%2C0903.2282%2C0903.4992%2C0903.5134%2C0903.1762%2C0903.3554%2C0903.3958%2C0903.4179%2C0903.4581%2C0903.2646%2C0903.0674%2C0903.4868%2C0903.1556%2C0903.2264%2C0903.5409%2C0903.5156%2C0903.0723%2C0903.1670%2C0903.2944%2C0903.0600%2C0903.3673%2C0903.5499%2C0903.3517%2C0903.2592%2C0903.5452%2C0903.3974%2C0903.1700%2C0903.5012%2C0903.1899%2C0903.4787%2C0903.2041%2C0903.2857%2C0903.4678%2C0903.4884%2C0903.4113%2C0903.4657%2C0903.3200%2C0903.2817%2C0903.1795%2C0903.1209%2C0903.4973%2C0903.4900%2C0903.0782%2C0903.0601%2C0903.5475%2C0903.1231%2C0903.1694%2C0903.4540%2C0903.2676%2C0903.5196%2C0903.0019%2C0903.2002%2C0903.0154%2C0903.0843%2C0903.0876%2C0903.4823%2C0903.4557%2C0903.0574%2C0903.5016%2C0903.4005%2C0903.4841%2C0903.5241%2C0903.0733%2C0903.1251%2C0903.1163%2C0903.5036%2C0903.2687%2C0903.5536%2C0903.0622&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Determining exciton bandwidth and film microstructure in polythiophene\n  films using linear absorption spectroscopy"}, "summary": "We analyze the linear absorption spectrum of regioregular\npoly(3-hexylthiophene) films spun from a variety of solvents to probe directly\nthe film microstructure and how it depends on processing conditions. We\nestimate the exciton bandwidth and the percentage of the film composed of\naggregates quantitatively using a weakly interacting H-aggregate model. This\nprovides a description of the degree and quality of crystallites within the\nfilm and is in turn correlated with thin-film field-effect transistor\ncharacteristics.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0903.3237%2C0903.1019%2C0903.1047%2C0903.1580%2C0903.3027%2C0903.1122%2C0903.0432%2C0903.3217%2C0903.0633%2C0903.0360%2C0903.4051%2C0903.3786%2C0903.3140%2C0903.5243%2C0903.3574%2C0903.0960%2C0903.1782%2C0903.4122%2C0903.2474%2C0903.3625%2C0903.3890%2C0903.1354%2C0903.1088%2C0903.1717%2C0903.3680%2C0903.1773%2C0903.0715%2C0903.1430%2C0903.4842%2C0903.4171%2C0903.3304%2C0903.0520%2C0903.5501%2C0903.2282%2C0903.4992%2C0903.5134%2C0903.1762%2C0903.3554%2C0903.3958%2C0903.4179%2C0903.4581%2C0903.2646%2C0903.0674%2C0903.4868%2C0903.1556%2C0903.2264%2C0903.5409%2C0903.5156%2C0903.0723%2C0903.1670%2C0903.2944%2C0903.0600%2C0903.3673%2C0903.5499%2C0903.3517%2C0903.2592%2C0903.5452%2C0903.3974%2C0903.1700%2C0903.5012%2C0903.1899%2C0903.4787%2C0903.2041%2C0903.2857%2C0903.4678%2C0903.4884%2C0903.4113%2C0903.4657%2C0903.3200%2C0903.2817%2C0903.1795%2C0903.1209%2C0903.4973%2C0903.4900%2C0903.0782%2C0903.0601%2C0903.5475%2C0903.1231%2C0903.1694%2C0903.4540%2C0903.2676%2C0903.5196%2C0903.0019%2C0903.2002%2C0903.0154%2C0903.0843%2C0903.0876%2C0903.4823%2C0903.4557%2C0903.0574%2C0903.5016%2C0903.4005%2C0903.4841%2C0903.5241%2C0903.0733%2C0903.1251%2C0903.1163%2C0903.5036%2C0903.2687%2C0903.5536%2C0903.0622&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We analyze the linear absorption spectrum of regioregular\npoly(3-hexylthiophene) films spun from a variety of solvents to probe directly\nthe film microstructure and how it depends on processing conditions. We\nestimate the exciton bandwidth and the percentage of the film composed of\naggregates quantitatively using a weakly interacting H-aggregate model. This\nprovides a description of the degree and quality of crystallites within the\nfilm and is in turn correlated with thin-film field-effect transistor\ncharacteristics."}, "authors": ["Jenny Clark", "Jui-Fen Chang", "Frank C. Spano", "Richard H. Friend", "Carlos Silva"], "author_detail": {"name": "Carlos Silva"}, "author": "Carlos Silva", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1063/1.3110904", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/0903.1670v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0903.1670v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "Applied Physics Letters (in press); 9 pages, three figures", "arxiv_primary_category": {"term": "cond-mat.mtrl-sci", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cond-mat.mtrl-sci", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0903.1670v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0903.1670v1", "journal_reference": "Appl. Phys. Lett. 2009 vol. 94 (16) pp. 163306", "doi": "10.1063/1.3110904", "fulltext": "In press, Appl. Phys. Lett.\n\nDetermining exciton bandwidth and film microstructure in\npolythiophene films using linear absorption spectroscopy.\nJenny Clark,1 Jui-Fen Chang,2 Frank C. Spano,3 Richard H. Friend,2 and Carlos Silva4\n\narXiv:0903.1670v1 [cond-mat.mtrl-sci] 10 Mar 2009\n\n1\n\nPolitecnico di Milano, Dipartimento di Fisica,\n\nPiazza Leonardo da Vinci, 32, Milano 20133, Italy\n2\n\nCavendish Laboratory, University of Cambridge,\n\nJ.J. Thomson Avenue, Cambridge, CB3 OHE, United Kingdom\n3\n\nDepartment of Chemistry, Temple University, Beury Hall 201,\nPhiladelphia, Pennsylvania 19122, United States of America\n\n4\n\nDépartement de physique et Regroupement québécois sur les matériaux de pointe,\nUniversité de Montréal, C.P. 6128,\nSuccursale centre-ville, Montréal QC H3C 3J7, Canada\n(Dated: March 10, 2009)\n\nAbstract\nWe analyze the linear absorption spectrum of regioregular poly(3-hexylthiophene) films spun\nfrom a variety of solvents to probe directly the film microstructure and how it depends on processing conditions. We estimate the exciton bandwidth and the percentage of the film composed of\naggregates quantitatively using a weakly interacting H-aggregate model. This provides a description of the degree and quality of crystallites within the film and is in turn correlated with thin-film\nfield-effect transistor characteristics.\n\n1\n\n\fIn thin films, regioregular poly(3-hexylthiophene) (rrP3HT) self-organizes into twodimensional π-stacked lamellar structures [1, 2]. The degree of order within and around\nthese supramolecular structures depends sensitively on polymer characteristics and thin\nfilm processing conditions [1, 3]. These in turn greatly affect device performance. Here we\nuse linear absorption spectroscopy as a simple probe of how thin film microstructure varies\nwith processing conditions. The absorption spectrum of rrP3HT thin films can be comprehensively explained using a weakly interacting H-aggregate model [4, 5, 6]. This model can\nbe used to dissect the absorption spectrum, providing quantitative estimates not only of\nthe fraction of the film made up of aggregates (recently determined using different methods\n[7, 8]), but also the degree of excitonic coupling within the aggregates, a parameter which\nis related to average conjugation length and the crystalline quality. Using this information,\nwe obtain an overall description of the microstructure of the films, which we find to be well\ncorrelated with thin-film field effect transistor (FET) characteristics.\nrrP3HT (Plextronics and Merck) was dissolved in various solvents (Aldrich) at a concentration of 10 gL−1 and spin-coated onto either fused silica spectrocil B or patterned FET\nsubstrates. The films were annealed at 100◦ C for 1 hr. The FET-patterned substrates were\nfabricated in a bottom gate, bottom-contact configuration. The gate electrode was a heavily\nn-doped Si wafer with 200 nm thermally grown SiO2 as dielectric. A Au layer of 15–20 nm\nwas patterned on the substrates as source/drain electrodes with a channel length of 20 μm by\nconventional photolithography. The channel widths were 1 cm. The patterned substrates\nwere treated with hexamethyldisilazane (HMDS). All processing, and I-V measurements\nwere performed in a N2 atmosphere. Absorption measurements were performed in ambient\nconditions using a HP 8453 uv-vis spectrometer and tapping-mode atomic force microscopy\n(AFM) measurements were taken using a Digital Instruments Dimension 3100 AFM.\nThe absorbance spectra of rrP3HT thin films spun from various solvents are shown in\nFig. 1 (a). The film absorption spectrum is composed of two parts [6], a lower energy,\ndominant part from crystalline regions of the film which form weakly interacting H-aggregate\nstates and a higher energy part due to more disordered chains which form intrachain states.\nThe ratio of the 0–0 and 0–1 peak absorbance is related to the exciton bandwidth of the\naggregates, W , and the energy of the main oscillator coupled to the electronic transition,\n\n2\n\n\fEp , by the following expression (assuming a Huang-Rhys factor of 1 [4, 6]):\nA0−0\n≈\nA0−1\n\n\u0012\n\n1 − 0.24W/Ep\n1 + 0.073W/Ep\n\n\u00132\n.\n\n(1)\n\nUsing the 0–0/0–1 ratio from Fig. 1, and assuming the C=C symmetric stretch at 0.18 eV\ndominates the coupling to the electronic transition [9], W can be estimated. Assuming\nsimilar interchain order in the films, W is related to the conjugation length and intrachain\norder. An increase in conjugation length and order will lead to a decrease in W [10, 11, 12].\nW is shown in part (b) of Fig. 1 as a function of solvent boiling point (bp). Also shown in the\nfigure is the percentage of the film made up of aggregates. This is found by determining first\nthe relative oscillator strength of the aggregated species compared with the intrachain species\nand second, the percentage of the absorption spectrum made up of aggregate absorption.\nThe relative oscillator strength of the aggregated versus intrachain species is determined\nby examining the absorption spectrum of a 1% wt solution as a function of temperature\n(Fig. 1 of Ref. [6]). The isosbestic point demonstrates that the reduction in the number\nof chains in the amorphous phase is equal to the increase in the number of chains in the\naggregated phase. Therefore, the increase in oscillator strength going from the amorphous\nto the aggregated phase can be calculated (see supplementary information) and is found to\nbe 39 ± 10%.\nThe fraction of the spectrum made up of aggregate absorption is determined using a\nmodified Frank-Condon fit to the absorption spectrum, which takes into account the Haggregate nature of the state (Ref. [5]),\n\u00132\nX \u0012 e−S S m \u0013 \u0012\nW e−S\n1−\nA∝\nGm Γ(h̄ω − E0−0 − mEp ).\nm!\n2Ep\nm=0\n\n(2)\n\nThe vibrational level is denoted m and Gm is a constant that depends on m according to\nGm = Σn(6=m) λ2n /n!(n − m), where the sum is over vibrational states, n [5]. For simplicity\nwe used a Gaussian lineshape, Γ, with the same width for each vibronic transition. Fig. 1(a)\nshows a sample fit for the film spun from mesitylene. Note that in Eq. 2 we have omitted\nsecond order corrections to the vibrational peak frequencies [5].\nAs a general trend, Fig. 1 (b) demonstrates that films spun from low bp solvents, such\nas chloroform, exhibit larger W and hence shorter conjugation lengths (lower crystalline\nquality), while those from higher bp solvents show lower W with correspondingly longer\n3\n\n\fconjugation lengths (higher crystalline quality). Furthermore, films spun from low bp solvents have a lower proportion of crystalline aggregated regions compared with those spun\nfrom high bp solvents, as expected [13].\nTo verify that the changes in the spectra are microstructural in origin, we have studied\nthe morphology of the films using AFM. Fig. 2 shows AFM images of films spun from\nvarious solvents. The films spun from high bp solvents show rough surfaces (isodurene\nfilm root-mean-square (rms) roughness 5.7 nm), while those spun from low bp solvents are\nsmoother (chloroform film rms roughness 0.95 nm). The roughness is due to the formation\nof micro-structures [3, 7, 8, 13, 14].\nWe therefore find that films with increased average conjugation lengths, order and percentage of crystalline structures, as predicted from the absorption spectra, demonstrate\nmorphologies with micro-crystalline structures. Those with an increased percentage of disordered regions in the film demonstrate amorphous films. The absorption spectrum is therefore\na useful and easy-to-measure tool to determine film micro-structure.\nTransfer curves and plots of mobility versus gate-voltage (Vg ) of transistors spun from\na variety of solvents are shown in Fig.s 3 (a) and (b), respectively. Using a linear fit of\nthe forward sweep of the mobility, from Vg =-10 to -40 V, we estimated how the slope of\nthe mobility versus Vg changes as a function of solvent bp. This is shown in Fig. 3 (c) (left\naxis). Also plotted is the free exciton bandwidth, W (right axis), reproduced from Fig. 1 (c).\nThere is an excellent correlation between W , obtained from the absorbance spectra, and the\ndegree to which the mobility is Vg -dependent. Changes in slope of the mobility versus Vg\nas a function of solvent bp have previously been noted [14] and have been explained in the\ncontext of the multiple trapping and release model [15, 16, 17, 18]. The model assumes\na large concentration of localized states below the mobility edge. At low Vg , most of the\ncharges fill the localized states (traps) and the mobility is low. As Vg increases more of\nthe traps are filled as the Fermi level moves closer to the mobility edge. More charges\ncan be released to the extended, mobile states which leads to an increase in the effective\nmobility. At sufficiently high Vg , all of the traps are filled and any additional charges are\ninjected into the extended states. Once this occurs, the mobility is constant with Vg . The\ndegree to which the mobility is a function of Vg is thus dependent on the width of the\nlocalized density of states below the mobility edge. Shallow trap distributions will result in\na weakly Vg -dependent mobility, while wider trap distributions will result in a pronounced\n4\n\n\fVg -dependence. From Fig. 3 we can therefore deduce that, for example, the device spun from\nisodurene has a shallow distribution of traps, while that spun from chloroform has a wide\ntrap distribution. There is a clear correlation between the crystalline quality, as determined\nfrom the absorbance spectrum, and the width of the trap distribution.\nWe note however, that if we assume that there is no change in spatial disorder between\nhopping sites, we would expect devices with wider trap distributions to have correspondingly lower mobilities. Fig. 3 (b) shows that this is not the case. The reason for this is\nunclear from our absorption spectra analysis, probably due to the fact that the absorbance\nspectra provides a measure of the bulk film microstructure, while properties at interfaces\nare often important, especially in FETs where transport occurs in a narrow region close to\nthe dielectric/semiconductor interface [19, 20].\nNevertheless, we have demonstrated that the absorbance spectrum by itself, can be used\nas a simple yet powerful probe of thin film excitonic coupling, intrachain order and fraction\nof crystalline regions within the film. Furthermore, it can be used to predict the relative\ndistribution of trap states below the mobility edge in FETs, providing evidence that the\nquality of the crystallites is homogeneous throughout the film and does not change between\nthe bulk and the interface. Therefore, linear absorption spectroscopy is a usefully simple\ntool to determine bulk film microstructure and this knowledge will help understanding of\ndevice characteristics in a variety of optoelectronic devices [7].\nJC acknowledges support from EPSRC and an industrial Case award from Seiko Epson\nUK. CS acknowledges support from the NSERC and the Canada Research Chairs program.\nFCS is supported by the NSF, Grant No. DMR 0606028.\n\n5\n\n\f[1] H. Sirringhaus, P. J. Brown, R. H. Friend, M. M. Nielsen, K. Bechgaard, B. M. W. LangeveldVoss, A. J. H. Spiering, R. A. J. Janssen, E. W. Meijer, P. Herwig, D. M. de Leeuw, Nature\n401, 685 (1999).\n[2] R. D. McCullough, S. Tristramnagle, S. P. Williams, R. D. Lowe, and M. Jayaraman,\nJ. Am. Chem. Soc. 115, 4910 (1993).\n[3] R. J. Kline and M. D. McGehee, Polymer Rev. 46, 27 (2006).\n[4] F. C. Spano, J. Chem. Phys. 122, 234701 (2005).\n[5] F. C. Spano, Chem. Phys. 325, 22-35 (2006).\n[6] J. Clark C. Silva, R. H. Friend, and F. C. Spano, Phys. Rev. Lett. 98, 206406 (2007).\n[7] A. J. Moulé and K. Meerholz, Adv. Mater. 20, 240 (2008).\n[8] S. Berson R. De Bettingnies, S. Bailly, and S. Guillerez, Adv. Func. Mater. 17, 1377 (2007).\n[9] G. Louarn, M. Trznadel, J. P. Buisson, J. Laska, A. Pron, M. Lapkowski, and S. Lefrant,\nJ. Phys. Chem. 100, 12532 (1996).\n[10] E. S. Manas and F. C. Spano, J. Chem. Phys. 109, 8087 (1998).\n[11] D. Beljonne, J. Cornil, R. Silbey, P. Millie, and J. L. Bredas, J. Chem. Phys. 112, 4749 (2000).\n[12] W. Barford, J. Chem. Phys. 126, 134905 (2007).\n[13] R. Chang, J. H. Hsu, W. S. Fann, J. Yu, S. H. Lin, Y. Z. Lee, and S. A. Chen, Chem. Phys. Lett.\n317, 153 (2000).\n[14] J. F. Chang, B. Q. Sun, D. W. Breiby, M. M. Nielsen, T. I. Solling, M. Giles, I. McCulloch,\nand H. Sirringhaus, Chem. Mater. 16, 4772 (2004).\n[15] H. Sirringhaus, N. Tessler, and R. H. Friend, Science 280, 1741 (1998).\n[16] H. Sirringhaus, Adv. Mater. 17, 2411 (2005).\n[17] A. Salleo, T. W. Chen, A. R. Volkel, Y. Wu, P. Liu, B. S. Ong, and R. A. Street, Phys. Rev. B\n70 (2004).\n[18] G. Horowitz, R. Hajlaoui, D. Fichou, and A. El Kassmi, J. Appl. Phys. 85, 3202 (1999).\n[19] R. J. Kline, M. D. McGehee, and M. F. Toney, Nature Materials 5, 222 (2006).\n[20] J. F. Chang, J. Clark, N. Zhao, H. Sirringhaus, D. W. Breiby, J. W. Andreasen, M. M. Nielsen,\nM. Giles, M. Heeney, and I. McCulloch, Phys. Rev. B 74, 115318 (2006).\n\n6\n\n\fFigure 1: (a) Normalized Absorbance spectra taken on films spun from different solvents. A sample\nfit is also shown. (b) Exciton bandwidth, W (open black circles), left axis and percentage of film\nmade up of aggregates (full red circles), right axis. (TCB is 1,2,4 tri-chlorobenzene).\n\n7\n\n\fFigure 2: Tapping mode atomic force microscopy (AFM) images of films spun from (a) chloroform,\n(b) xylene, (c) isodurene (IsoD) and (d) 1,2,4 tri-chlorobenzene (TCB). Images are 5×5 μm. Insets\nare 0.5×0.5 μm. Height-scales (z) are marked in the figure.\n\n8\n\n\fFigure 3: Linear regime (Vds =-5 V) (a) transfer characteristics and (b) mobility as a function of gate\nvoltage for films spun from different solvents (TCB mobility is divided by 10 for easier comparison).\n(c) Inverse slope of mobility versus Vg (left axis, red squares) and free exciton bandwidth, W (right\naxis, black open circles) as a function of solvent boiling point.\n\n9\n\n\f"}