{"id": "http://arxiv.org/abs/1108.5247v1", "guidislink": true, "updated": "2011-08-26T06:24:01Z", "updated_parsed": [2011, 8, 26, 6, 24, 1, 4, 238, 0], "published": "2011-08-26T06:24:01Z", "published_parsed": [2011, 8, 26, 6, 24, 1, 4, 238, 0], "title": "Electronic Structure and Bonding of Icosahedral Core-Shell Gold-Silver\n  Nanoalloy Clusters Au_(144-x)Ag_x(SR)_60", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1108.5292%2C1108.4518%2C1108.3089%2C1108.5111%2C1108.1608%2C1108.3107%2C1108.3763%2C1108.3877%2C1108.4432%2C1108.0536%2C1108.0670%2C1108.3793%2C1108.2205%2C1108.6253%2C1108.5247%2C1108.1125%2C1108.4609%2C1108.1806%2C1108.0218%2C1108.2447%2C1108.2668%2C1108.4931%2C1108.4829%2C1108.1070%2C1108.5074%2C1108.0447%2C1108.1456%2C1108.5607%2C1108.0098%2C1108.3191%2C1108.5704%2C1108.5155%2C1108.0312%2C1108.3918%2C1108.1904%2C1108.5783%2C1108.2276%2C1108.5572%2C1108.0581%2C1108.4680%2C1108.3646%2C1108.4003%2C1108.2164%2C1108.4086%2C1108.1241%2C1108.0302%2C1108.1440%2C1108.2444%2C1108.3308%2C1108.0220%2C1108.5092%2C1108.1049%2C1108.4724%2C1108.5250%2C1108.0859%2C1108.0942%2C1108.4048%2C1108.1258%2C1108.2809%2C1108.5668%2C1108.4542%2C1108.2558%2C1108.4574%2C1108.2466%2C1108.2614%2C1108.3592%2C1108.1648%2C1108.1496%2C1108.3326%2C1108.5252%2C1108.5469%2C1108.3284%2C1108.3942%2C1108.5654%2C1108.2591%2C1108.0379%2C1108.5834%2C1108.3542%2C1108.2580%2C1108.3870%2C1108.1520%2C1108.3478%2C1108.0445%2C1108.3203%2C1108.2863%2C1108.3768%2C1108.4472%2C1108.4105%2C1108.3435%2C1108.0805%2C1108.2639%2C1108.3026%2C1108.0779%2C1108.4353%2C1108.0222%2C1108.3043%2C1108.2894%2C1108.0413%2C1108.3707%2C1108.0350%2C1108.1142&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Electronic Structure and Bonding of Icosahedral Core-Shell Gold-Silver\n  Nanoalloy Clusters Au_(144-x)Ag_x(SR)_60"}, "summary": "Atomically precise thiolate-stabilized gold nanoclusters are currently of\ninterest for many cross-disciplinary applications in chemistry, physics and\nmolecular biology. Very recently, synthesis and electronic properties of\n\"nanoalloy\" clusters Au_(144-x)Ag_x(SR)_60 were reported. Here, density\nfunctional theory is used for electronic structure and bonding in\nAu_(144-x)Ag_x(SR)_60 based on a structural model of the icosahedral\nAu_144(SR)_60 that features a 114-atom metal core with 60 symmetry-equivalent\nsurface sites, and a protecting layer of 30 RSAuSR units. In the optimal\nconfiguration the 60 surface sites of the core are occupied by silver in\nAu_84Ag_60(SR)_60. Silver enhances the electron shell structure around the\nFermi level in the metal core, which predicts a structured absorption spectrum\naround the onset (about 0.8 eV) of electronic metal-to-metal transitions. The\ncalculations also imply element-dependent absorption edges for Au(5d)\n\\rightarrow Au(6sp) and Ag(4d) \\rightarrow Ag(5sp) interband transitions in the\n\"plasmonic\" region, with their relative intensities controlled by the Ag/Au\nmixing ratio.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1108.5292%2C1108.4518%2C1108.3089%2C1108.5111%2C1108.1608%2C1108.3107%2C1108.3763%2C1108.3877%2C1108.4432%2C1108.0536%2C1108.0670%2C1108.3793%2C1108.2205%2C1108.6253%2C1108.5247%2C1108.1125%2C1108.4609%2C1108.1806%2C1108.0218%2C1108.2447%2C1108.2668%2C1108.4931%2C1108.4829%2C1108.1070%2C1108.5074%2C1108.0447%2C1108.1456%2C1108.5607%2C1108.0098%2C1108.3191%2C1108.5704%2C1108.5155%2C1108.0312%2C1108.3918%2C1108.1904%2C1108.5783%2C1108.2276%2C1108.5572%2C1108.0581%2C1108.4680%2C1108.3646%2C1108.4003%2C1108.2164%2C1108.4086%2C1108.1241%2C1108.0302%2C1108.1440%2C1108.2444%2C1108.3308%2C1108.0220%2C1108.5092%2C1108.1049%2C1108.4724%2C1108.5250%2C1108.0859%2C1108.0942%2C1108.4048%2C1108.1258%2C1108.2809%2C1108.5668%2C1108.4542%2C1108.2558%2C1108.4574%2C1108.2466%2C1108.2614%2C1108.3592%2C1108.1648%2C1108.1496%2C1108.3326%2C1108.5252%2C1108.5469%2C1108.3284%2C1108.3942%2C1108.5654%2C1108.2591%2C1108.0379%2C1108.5834%2C1108.3542%2C1108.2580%2C1108.3870%2C1108.1520%2C1108.3478%2C1108.0445%2C1108.3203%2C1108.2863%2C1108.3768%2C1108.4472%2C1108.4105%2C1108.3435%2C1108.0805%2C1108.2639%2C1108.3026%2C1108.0779%2C1108.4353%2C1108.0222%2C1108.3043%2C1108.2894%2C1108.0413%2C1108.3707%2C1108.0350%2C1108.1142&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Atomically precise thiolate-stabilized gold nanoclusters are currently of\ninterest for many cross-disciplinary applications in chemistry, physics and\nmolecular biology. Very recently, synthesis and electronic properties of\n\"nanoalloy\" clusters Au_(144-x)Ag_x(SR)_60 were reported. Here, density\nfunctional theory is used for electronic structure and bonding in\nAu_(144-x)Ag_x(SR)_60 based on a structural model of the icosahedral\nAu_144(SR)_60 that features a 114-atom metal core with 60 symmetry-equivalent\nsurface sites, and a protecting layer of 30 RSAuSR units. In the optimal\nconfiguration the 60 surface sites of the core are occupied by silver in\nAu_84Ag_60(SR)_60. Silver enhances the electron shell structure around the\nFermi level in the metal core, which predicts a structured absorption spectrum\naround the onset (about 0.8 eV) of electronic metal-to-metal transitions. The\ncalculations also imply element-dependent absorption edges for Au(5d)\n\\rightarrow Au(6sp) and Ag(4d) \\rightarrow Ag(5sp) interband transitions in the\n\"plasmonic\" region, with their relative intensities controlled by the Ag/Au\nmixing ratio."}, "authors": ["Sami Malola", "Hannu Häkkinen"], "author_detail": {"name": "Hannu Häkkinen"}, "author": "Hannu Häkkinen", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1021/jz201059k", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1108.5247v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1108.5247v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "4 figures", "arxiv_primary_category": {"term": "physics.atm-clus", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "physics.atm-clus", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "cond-mat.mtrl-sci", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "physics.chem-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1108.5247v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1108.5247v1", "journal_reference": "J Phys Chem Lett 2, 2316-2321 (2011)", "doi": "10.1021/jz201059k", "fulltext": "Electronic Structure and Bonding of Icosahedral Core-Shell Gold-Silver Nanoalloy\nClusters Au144-xAgx(SR)60\n\nSami Malola and Hannu Häkkinen*\nDepartments of Chemistry and Physics, Nanoscience Center\nUniversity of Jyväskylä, FI-40014 Jyväskylä, Finland\n\n* Corresponding author: Email: Hannu.J.Hakkinen@jyu.fi, Phone: +358 400 247 973\n\nThis document is the unedited Author's version of a Submitted Work that was\nsubsequently accepted for publication in the Journal of Physical Chemistry\nLetters, copyright © American Chemical Society after peer review. To access\nthe final edited and published work see\n\nhttp://pubs.acs.org/doi/pdf/10.1021/jz201059k\n\n!\n\n\"!\n\n\fAbstract\nAtomically precise thiolate-stabilized gold nanoclusters are currently of interest for many\ncross-disciplinary applications in chemistry, physics and molecular biology. Very\nrecently, synthesis and electronic properties of \"nanoalloy\" clusters Au144-xAgx(SR)60\nwere reported. Here, density functional theory is used for electronic structure and\nbonding in Au144-xAgx(SR)60 based on a structural model of the icosahedral Au144(SR)60\nthat features a 114-atom metal core with 60 symmetry-equivalent surface sites, and a\nprotecting layer of 30 RSAuSR units. In the optimal configuration the 60 surface sites of\nthe core are occupied by silver in Au84Ag60(SR)60. Silver enhances the electron shell\nstructure around the Fermi level in the metal core, which predicts a structured absorption\nspectrum around the onset (about 0.8 eV) of electronic metal-to-metal transitions. The\ncalculations also imply element-dependent absorption edges for Au(5d) ! Au(6sp) and\nAg(4d) ! Ag(5sp) interband transitions in the \"plasmonic\" region, with their relative\nintensities controlled by the Ag/Au mixing ratio.\n\nKeywords: gold, silver, density functional theory, superatom, nanoalloy\n\n!\n\n#!\n\n\fTOC GRAPHICS\n\n!\n\n$!\n\n\fThe strong chemical interaction between gold and thiolates (RS-) creates ubiquitous Au-S\ninterfaces in thiolate-stabilized gold clusters (nanocrystals),1,2 colloidal nanoparticles,3\nself-assembled thiolate monolayers on Au(111),4\n\nand in molecular electronics where\n\norganic molecules are frequently linked to gold electrodes via thiolate groups.5 Since late\n1990's, it has been known that one of the most abundant and stable thiolate-stabilized\ngold nanoclusters has a gold mass of 28-29 kDa (140-150 Au atoms). Its synthesis,\nelectrochemical properties, optical absorption, and bioconjugation properties have been\nextensively studied.2,6-17 This cluster is abundantly formed when Au(I)-thiolate\ncomplexes are reduced or when colloidal Au(0) particles are etched with excess thiol. It\nis very stable in ambient conditions and its solubility and chemical derivatisation can be\ncontrolled with varying the chemical nature of the thiol (hydrophilic/-phobic). Unlike the\nsmaller clusters Au25(SR)18-1/0,18-20 Au38(SR)24,21 and Au102(SR)44,22 it has so far evaded\ncrystallographic determination of the total structure. Recent high-resolution mass\nspectrometric experiments have yielded composition assignments for this cluster as\nAu144(SR)59 (ref. 13) Au144(SR)60 (ref. 15), and Au144-146(SR)59-60 (ref. 16). In 2009, a\nstructural model from density functional theory (DFT) studies for Au144(SR)60 was\npresented, accounting for the reported structural, electrochemical and optical properties\nof the 28-29 kDa particle.23 This model features a 114-atom icosahedral metal core that\nhas an inner 54-atom Mackay icosahedron with 60 symmetry-equivalent anti-Mackay\nsites at its surface, and a protecting layer of 30 RS-Au-SR units. The model follows the\ngeneral \"Divide and Protect\" principle24 where a part of the gold atoms in the cluster (in\nthis case 30 atoms) are covalently bound as Au(I) in the thiolate layer and in a distinctly\n\n!\n\n%!\n\n\fdifferent chemical state from the 114 core Au(0) atoms. This structural model yields a\ngood agreement with early powder Xray data on the 29 kDa cluster compound11 and is in\nclose relation to ligand-stabilized Pd145 cluster for which the crystal structure is\navailable.25\nVery recently, Kumara and Dass have shown that co-reduction of gold and silver\nsalts produces nanoalloy clusters with a general formula Au144-xAgx(SR)60.26 Three\ninteresting observations were documented: (i) the maximal number of Ag atoms mixed\nwith gold seems to saturate near x = 60, achieved with mixing ratio of gold:silver salts by\n1:0.66 and 1:0.75, (ii) syntheses with higher ratios up to 1:1 did not produce stable\n(Au:Ag)144 clusters, and (iii) the optical absorption spectra of the nanoalloy clusters in the\nUV – vis region exhibit three distinct features: a \"plasmonic\" peak around 430 nm (2.9\neV) and two shoulders around 310 nm (4.0 eV) and 560 nm (2.2 eV). The higher is x, the\nmore clear is the appearance of these features (the pure Au144(SR)60 has a very weak\n\"plasmonic\" band at 520 nm). Alloying of gold and silver in nanoscale particles can\ngenerally be expected27 due to the fact that the atom densities in bulk gold and silver are\nalmost identical (the experimental fcc lattice parameters are ca. 4.09 Å for Ag and 4.08 Å\nfor Au) because the significant relativistic contraction of the outermost 6s orbital of Au\natom brings its \"size\" very close to that of Ag). However, the distinct observations by\nKumara and Dass clearly call for further theoretical understanding of the alloy clusters\nAu144-xAgx(SR)60 particularly when a promising structural model for the\n\nall-gold\n\n\"parent\" cluster is available.23\n\n!\n\n&!\n\n\fFigure 1. Optimized structures of the considered clusters 1 – 5 of composition Au144xAgx(SH)60 (see the main text for the detailed descriptions). Gold: brown, silver: shiny\ngrey, sulfur: yellow. The hydrogen atoms are not shown for clarity.\n\n!\n\n'!\n\n\fMotivated by this, we employed DFT as implemented in the real-space projectoraugmented wave code GPAW28 (see Computational Details) to study the atomic\nstructure, formation energetics, and electronic structure of a series of Au144-xAgx(SR)60\nclusters with x = 0, 30, 54, and 60, in the context of the previously published23 structural\nmodel for all-gold Au144(SR)60. Figure 1 shows the considered structures, labeled as 1 for\nAu144(SR)60 (written as Au114(RSAuSR)30 in the \"Divide and Protect\" scheme), 2 for\nAg54Au60(RSAuSR)30, where the silver atoms make the inner 54-atom Mackay\nicosahedron of the metal core, 3 for Au54Ag60(RSAuSR)30 where the 60 Ag atoms are\nrandomly distributed in the inner Mackay icosahedron and the anti-Mackay surface layer\n(30 in both), 4 for Au54Ag60(RSAuSR)30 where the 60 anti-Mackay surface sites of the\nmetal core are occupied by silver, and 5 for Au114(RSAgSR)30 where silver replaces gold\nin the thiolate layer. Hence, the motivation to select the used values of x comes from the\ngeometry of the model, and from the experimental observation26 of the maximum value\nof x being close to 60. We calculated the formation energies (Eform) for clusters 1 – 5 and\nshow the results in Figure 2. Based on the definition discussed in Computational Details,\nthe energetically optimal cluster has the lowest (positive) formation energy. Figure 2\nshows clearly that Eform of cluster 4 has the minimal value, about 0.07 eV per metal atom.\nThis value is half of that calculated for Au144(SR)60 (1). Clusters where Ag atoms make\nthe inner 54-atom Mackay icosahedron (2) or replace Au in the thiolate shell (5) are\nclearly less stable than pure Au144(SR)60. Furthermore, the higher formation energy of 3\nas compared to 4 indicates that silver and gold prefer separate atom shells inside the core.\n\n!\n\n(!\n\n\fFigure 2. The formation energy per metal atom, Eform, of clusters 1 – 5. The smallest\nvalue indicates optimal formation of cluster 4.\n\nConfirming the expectations on the grounds of a similar size of Ag and Au atoms,\nmixing silver into the cluster causes only minor changes in the radial positions of the\nconcentric atom shells (Supporting Information, Figure S1). However, the theoretical\nXRD functions differ from the all-gold Au144(SR)60 due to the different atom form factors\nof gold and silver, taken here to be linearly dependent on the atomic number (or total\nelectron count).23 In particular, the XRD function of the energy-optimal custer 4 displays\na clear shoulder at s ! 3.4 1/nm, an enhanced peak at s ! 4.3 1/nm, and a sharper and\n!\n\n)!\n\n\finward shifted peak at s ! 5.4 1/nm as compared to 1 (Figure S2). These results may\nprove useful for future experimental analysis of powder samples of Au144-xAgx(SR)60.\nThe length distributions of metal-sulfur bonds for clusters 1 and 4 are shown in\nFigure S3. For cluster 1 the shorter Au-S bonds around 2.34 Å exist in the 30 RSAuSR\nunits and the longer bonds around 2.46 Å connect the sulfurs of the protecting units to the\nsurface gold atoms of the metal core. Related to latter, we observe that for cluster 4 the\ncore-unit Ag-S bonds are considerably longer (ca. 2.52 Å) than the corresponding Au-S\nbonds (ca. 2.46 Å) in cluster 1. However the shorter intra-unit RS-Au-SR bonds do not\ndepend on whether the core surface is of gold or silver.\nWe analyzed the electronic structure of clusters 1 – 5 in the context of the\n\"superatom complex\" model.29,30 This analysis is reported in Figures 3 and S4\n(Supporting Information). Figure 3 shows the electron states that are within ± 1 eV from\nthe Fermi level EF =0 and Figure S4 shows the same analysis for a larger energy range,\nincluding also the Au(5d) and Ag(4d) bands. In the neutral state, all these clusters have\n144 – 60 = 84 delocalized electron states originating from the Ag(5s) and Au(6s) atomic\nstates. The delocalized electrons organize themselves into energy shells spanning the\nvolume of the metal core, much like electron states in ordinary atoms. In the context of\nthis model, 84 electrons fill a part of the manifold of states with envelope angular\nmomentum symmetries of 1H, 2D, and 3S around the Fermi level (see Figure 3). This\nmanifold spans the states between the closed electron shells at 58 (closing of 1G\nsymmetry) and 92 (opening of 1I symmetry) electrons and is approximately located\nbetween -0.7 eV \" EF \" 0.15 eV. The result for cluster 1, in agreement with the one\nreported previously for Au144(SCH3)60 (ref. 23), shows that 2D and 3S shells are\n!\n\n*!\n\n\fFigure 3. Projected local density of states (PLDOS) of clusters 1 – 5. The projection is\ndone onto spherical harmonics about the cluster center-of-mass as described in ref. 29\nselecting the sphere radius as 8.0 Å. This volume contains the 114-atom metal core. We\nhave considered spherical harmonics up to I-symmetry (angular momentum L = 6). The\ngrey area shows the part of DOS that cannot be described in the expansion up to L = 6.\nThe Fermi level is at E = 0 (indicated by the dotted line). The green arrows indicate the\nlowest dipole-allowed transitions. The transition indicated by red-dashed line is dipoleforbidden.\n!\n\n\"+!\n\n\fembedded inside the more spread 1H states, which can be understood by considering\nsplitting of the H-symmetry (angular momentum L = 5) by the icosahedral atom (point\ngroup) symmetry inside the cluster. The 2D shell remains highly degenerate as expected\nin icosahedral symmetry. It is seen that the random distribution of 60 Ag atoms inside the\nmetal core of cluster 3 causes maximal disturbance to the shell states including the 2D\nshell, while the energy-optimal cluster 4 has the set of most degenerate shells in this\nenergy region. This implies a structured low-energy absorption spectrum in the NIR\nregion of electronic transitions. A rather surprising consequence of this symmetric shell\nstructure is that the onset of dipole-allowed electronic transitions is expected at a rather\nhigh energy, about 0.8 – 0.9 eV, as indicated by arrows in Figure 3 (from the mixed 2D1H subshell, located at about -0.35 eV, to the lowest empty 1I subshell located close to\n0.5 eV, and from the G shell at -0.9 eV to G shell at the Fermi level). This onset is higher\nthan the one at about 0.5 eV predicted29 and recently measured31 for the Au102(SR)44\ncluster, and is a consequence of the high symmetry of atomic geometry and electron\nshells of cluster 4. In the same context, it is intriguing to note that silver enhances the\ndegeneracies of the electron shells of cluster 4 compared to the all-gold parent 1, where\nthe corresponding transitions are expected at about 0.1 eV lower energies.\nIt is also of interest to analyze the electronic structure by projecting the local\ndensity of states into atomic orbitals in different parts of the metal core. Figure 4 displays\nthis analysis for the metal core of the energy-optimal cluster 4, Au54Ag60(RSAuSR)60 that\nhas the inner Au54 Mackay icosahedron and 60-atom anti-Mackay silver core surface.\nSeveral observations can be made from Figure 4: (i) in the Au54 part the Au(5d) band is\nwide and embedded in the middle of Au(6s) and mixed Au(6sp) states (the states around\n!\n\n\"\"!\n\n\fFigure 4. PLDOS calculated on atom-centered spheres inside the 114-atom core of\ncluster 4, Au54Ag60(RSAuSR)30, for the Mackay Au54 part (top panel) and for the antiMackay Ag60 surface layer (bottom panel). The projection is done on atoms as described\nin ref. 29 selecting the sphere radius as 1.45 Å. The Fermi level is at E = 0 (indicated by\nthe dotted line). The approximate locations of the Au(5d) and Ag(4d) band edges are\nindicated by arrows.\n\nEF are dominantly Au(6sp)), (ii) in the Ag60 layer the Ag(4d) band is more narrow, totally\nbelow the Ag(5sp) states that are dominant around EF, and (iii) the \"band edges\" for\nAu(5d) and Ag(4d) are about 1.7 eV and 2.6 eV below EF, respectively (indicated by the\nblack arrows in Figure 4). Thus, it is interesting to note that the expected general\ndifferences in the local electronic structures for the gold and silver parts in the core are\nclearly visible. For colloidal (bulk-like) gold nanoparticles, it is known that the enhanced\nabsorption due to increased joint density of states for 5d ! 6sp interband transitions\n!\n\n\"#!\n\n\fcontributes strongly to the surface plasmon (observed for colloidal gold around 520 - 530\nnm, i.e., 2.3 – 2.4 eV). For gold nanoclusters larger or equal to Au102, a clear increase in\nabsorption takes place around 1.6 – 1.7 eV.\n\n12,31\n\nFor silver, the interband transitions for\n\ncolloidal particles are expected to start around 3.9 eV whence the classical free-electrontype plasmon resonance is already at 3.5 eV.32 Our calculations offer a first qualitative\ninterpretation of the general features in the absorption spectra measured by Kumara and\nDass,26 predicting that the lowest-energy feature at 560 nm is dominantly due to goldbased transitions in the metal core while the contribution from silver becomes dominant\nat higher excitation energies. This gives a natural explanation to the fact that the\nexperimentally observed features become more distinct when the silver concentration\nincreases. However, a detailed theoretical analysis and confirmation of this prediction\nwould involve linear-response or true time-dependent DFT calculations of the optical\nspectrum of cluster 4 for transition energies up to 4 eV. This is a considerable\ncomputational challenge for a system of this size, but we are currently working to make\nthis calculation possible. It will be also of great interest to compare such systems to\ncalculations of the smaller nanocluster Ag13Au12(SH)18-1 with all-silver core that showed\nthe enhancement of low-energy \"superatomic\" P ! D transitions as compared to all-gold\nAu25(SR)18-1. 33\nPerhaps the most interesting result from our calculation is the observation that the\n\"silver-coating\" of the metal core is optimal for the cluster formation energy and also\nincreases the degeneracies of electron states, making the electron shell structure more\ndominant for the properties of Au144-xAgx(SR)60 clusters as compared to all-gold\nAu144(SR)60. Due to the fact that the reduction/oxidation potentials of gold and silver\n!\n\n\"$!\n\n\fdiffer remarkably, it is also of interest to analyze local atomic charges in concentric atom\nlayers of cluster 4 and compare to the all-gold 1. This analysis is shown in the Supporting\nInformation Table S1. The data shows a very minor excess total negative charge (about 0.7|e|) in the inner Au54 icosahedron inside the core of 1, whence the 60 gold atoms at\nthe core surface and the 30 gold atoms inside the thiolate layer have clearly lost some\nelectron charge to the SH groups (+0.07 and +0.11 unit charges per atom, respectively).\nAt variance with this, the optimal gold-silver cluster 4 has strong variations of charge\neven inside the metal core: now the Au54 inner icosahedron has a total negative charge of\n-5.7, the 60-atom silver surface has a total charge of +15.0, and the SH groups have a\ntotal charge of -11.4. In a way, \"silver is reducing gold\" in this system in an interesting\nlayer-by-layer fashion. These charge-transfer effects are intrinsic also to the optical\nproperties, but a more detailed theoretical analysis is outside the scope of this letter.\nIn conclusion, we have reported a detailed DFT calculation and analysis of\ncandidate structures for the 144-metal-atom gold-silver nanoalloy clusters synthesized\nvery recently by the group of Dass. We have found a plausible interpretation to their\nobservation of the maximal silver:gold loading ratio of 60/84, based on our previously\npublished model for all-gold Au144(SR)60. Silver is found to preferentially occupy the 60\nsurface sites of the metal core, and in this configuration silver enhances the electronic\nshell structure of the particle, that implies structured low-energy NIR absorption spectra\naround an onset of 0.85 eV and interesting element-dependent \"plasmonic\" (interband\nabsorption) features in the UV-vis region, controlled by the Ag:Au ratio. One may ask\nwhether the icosahedral geometry would dominate to stabilize larger gold or gold-silver\nclusters with gold-thiolate surface ligand layer, and whether in the gold-silver alloy\n!\n\n\"%!\n\n\fclusters the silver always prefers the cover the surface of the metal core. In this context it\nis intriguing to note that Negishi's group has reported synthesis34 of stable anionic Au25-x\nAgx(SR)18-1 clusters where the maximal x is close to 12, giving a possibility to relate the\npreferential occupation of silver to the 12 surface sites of the metal core in the known\nstructure of Au25(SR)18-1. If this principle is confirmed (from near-future calculations or\nexperiments) also for larger clusters than Au144-xAgx(SR)60, one has discovered an\ninteresting scheme for manufacturing stable gold-silver nanoclusters with \"silver-coated\"\nmetal core with potentially interesting and tunable electronic, optical and catalytic\nproperties.\n\nComputational details\nThe structural relaxation, solution to the Kohn-Sham problem, and the electronic\nstructure analysis of Au144-xAgx(SR)60 clusters were performed using the GPAW code.28\nIn this code, the projector augmented wave (PAW) method35 has been implemented in a\nreal space grid. The Ag(4d105s1), Au(5d106s1), and S(3s23p4) electrons were treated as\nvalence and the inner electrons were included in a frozen core (with the full all-atom\nelectron density available for analysis). The PAW setups for gold and silver include\nscalar-relativistic corrections. 0.2 Å grid spacing for electron density and 0.05 eV/Å\nconvergence criterion for the residual forces on atoms were used in structure\noptimizations without any symmetry constraints. The exchange-correlation energy and\npotential were evaluated using the generalized gradient approximation as derived by\nPerdew, Burke and Ernzerhof (PBE-functional).36\n\n!\n\n\"&!\n\n\fFor computational reasons (to minimize the count of valence electrons in the\nsystem) we modeled the thiolate with the SH moiety (R=H). The formation energy Eform\nper metal atom for a cluster Au144-xAgx(SH)60 was defined as\n\nEform = { E[Au144-xAgx(SH)60] + 30 E(H2) – (144-x) EAu,fcc – x EAg,fcc – 60 E(SH2) } / 144.\n\nThe respective total energies E[...] of the constituents of the stoichiometric\nformation reactions were calculated with identical grid parameters in a finite\ncomputational cell. The calculations to determine the total energy per atom in fcc bulk\ngold and silver (EAu,fcc = -3.25 eV and EAg,fcc = -2.75 eV) were done with a 20x20x20 kpoint mesh in a periodic cell by using the theoretical equilibrium lattice constants (4.175\nÅ for both Ag and Au) from GPAW and PBE.\nThe theoretical XRD intensity was calculated as described in ref. 23. The projection\nof Kohn-Sham states onto spherical harmonics inside (i) a cluster-centered or (ii) metal\natom-centered spherical volume was performed as described in ref. 29. The former\nanalysis (i) yields information of global electron-shell states in the metallic cluster core\nwhence the latter (ii) is an LCAO-type analysis for locations of atomic Ag(4d, 5s, 5p) and\nAu(5d, 6s, 6p) derived bands. The analysis for local atomic charge (reported in Table S1,\nSupporting Information) was done by using the Bader method.37\n\nAcknowledgement. This work is supported by the Academy of Finland and by\nCSC – the Finnish IT Center for Science. S.M. thanks Olga Lopez-Acevedo for\nassistance in setting up the initial computation on Au144(SH)60.\n!\n\n\"'!\n\n\fSupporting information available\nRadial analysis of atom shells (Figure S1), theoretical powder XRD functions (Figure\nS2), and full electronic DOS (Figure S4) for clusters 1 – 5. Metal-sulfur bond-distance\nanalysis (Figure S3) and Bader analysis of local charges (Table S1) for clusters 1 and 4.\nThis material is available free of charge via the Internet at http://pubs.acs.org.\n\nReferences\n(1) Brust, M.; Walker, M.; Bethell, D.; Schiffrin, D.J.; Whyman, R. Synthesis of\nThiol-Derivatized Gold Nanoparticles in a 2-phase Liquid-Liquid System. Chem.\nComm. 1994, 801 – 802.\n(2) Whetten, R.L.; Khoury, J.T.; Alvarez, M.M.; Murthy, S.; Vezmar, I.; Wang, Z.L.;\nStephens, P.W.; Cleveland, C.L.; Luedtke, W.D.; Landman, U. Nanocrystal Gold\nMolecules. Adv. Mater. 1996, 8, 428.\n(3) Daniel, M.C.; Astruc, D. Gold Nanoparticles: Assembly, Supramolecular\nChemistry, Quantum-Size-Related Properties, and Applications Toward Biology,\nCatalysis, and Nanotechnology. Chem. Rev. 2004, 104, 293.\n\n!\n\n\"(!\n\n\f(4) Love, J.C.; Estroff, L.A.; Kriebel, J.K.; Nuzzo, R.G.; Whitesides, G.M. SelfAssembled Monolayers of Thiolates on Metals as a Form of Nanotechnology.\nChem. Rev. 2005, 105, 1103 – 1169.\n(5) Chen, F.; Hihath, J.; Huang, Z.F.; Li, X.L.; Tao, N.J. Measurement of SingleMolecule Conductance. Ann. Rev. Phys. Chem. 2007, 58, 535 - 564.\n(6) Chen, S.; Ingram, R.S.; Hostetler, M.J.; Pietron, J.J.; Murray, R.W., Schaaff,\nT.G.; Khoury, J.; Alvarez, M.M.; Whetten, R.L. Gold Nanoelectrodes of Varied\nSize: Transition to Molecule-Like Charging. Science 1998, 280, 2098 - 2101.\n(7) Hicks, J.F.; Miles, D.T.; Murray, R.W. Quantized Double-Layer Charging of\nHighly Monodisperse Metal Nanoparticles. J. Am. Chem. Soc. 2003, 124, 13322.\n(8) Quinn, B.M.; Liljeroth, P.; Ruiz, P.; Laaksonen, T.; Kontturi, K. Electrochemical\nResolution of 15 Oxidation States for Monolayer Protected Gold Nanoparticles. J.\nAm. Chem. Soc. 2003, 125, 6644 – 6645.\n(9) Murray, R.W. Nanoelectrochemistry: Metal Nanoparticles, Nanoelectrodes, and\nNanopores. Chem. Rev. 2008, 108, 2688 - 2720.\n(10)\n\nLaaksonen, T.; Ruiz, V.; Liljeroth, P.; Quinn, B.M. Quantized Charging of\n\nMonolayer-Protected Nanoparticles. Chem. Soc. Rev. 2008, 37, 1836 - 1846.\n(11)\n\nSchaaff, T.G.; Shafigullin, M.N.; Khoury, J.T.; Vezmar, I.; Whetten, R.L.\n\nProperties of a Ubiquitous 29 kDa Au:SR Cluster Compound. J. Phys. Chem. B\n2001, 105, 8785 – 8796.\n(12)\n\nWyrwas, R.B.; Alvarez, M.M.; Khoury, J.T.; Price, R.C.; Schaaff, T.G.;\n\nWhetten, R.L. The colours of nanometric gold: Optical Response Functions of\nSelected Gold-Cluster Thiolates. Eur. Phys. J. D 2007, 43, 91 - 95.\n\n!\n\n\")!\n\n\f(13)\n\nChaki, N.K.; Negishi, Y.; Tsunoyama, H.; Shichibu, Y.; Tsukuda, T.\n\nUbiquitous 8 and 29 kDa Gold:Alkanethiolate Cluster Compounds: MassSpectrometric Determination of Molecular Formulas and Structural Implications.\nJ. Am. Chem. Soc. 2008, 130, 8608 – 8610.\n(14)\n\nBowman, M.-C.; Ballard, T.E.; Ackerson, C.J.; Feldheim, D.L.; Margolis,\n\nD.M.; Melander, C. Inhibition of HIV Fusion with Multivalent Gold\nNanoparticles. J. Am. Chem. Soc. 2008, 130, 6896.\n(15)\n\nQian, H.; Jin. R. Controlling Nanoparticles with Atomic Precision: The\n\nCase of Au144(SCH2CH2Ph)60. Nano Lett. 2009, 9, 4083 – 4087.\n(16)\n\nFields-Zinna, C.; Sardar, R.; Beasley, C.A.; Murray, R.W. Electrospray\n\nIonization Mass Spectrometry of Intrinsically Cationized Nanoparticles,\n[Au144/146(SC11H22N(CH2CH3)3+)x(S(CH2)5CH3)y]x+. J. Am. Chem. Soc. 2009,\n131, 16266 - 16271.\n(17)\n\nAckerson, C.J.; Jadzinsky, P.D.; Sexton, J.Z.; Bushnell, D.A.; Kornberg,\n\nR.D. Synthesis and Bioconjugation of 2 and 3 nm-Diameter Gold Nanoparticles.\nBioconjugate Chem. 2010, 21, 214 – 218.\n(18)\n\nHeaven, M.W.; Dass, A.; White, P.S.; Holt, K.M.; Murray, R.W. Crystal\n\nStructure of the Gold Nanoparticle [N(C8H17)4][Au25(SCH2CH2Ph)18]. J. Am.\nChem. Soc. 2008, 130, 3754 - 3755.\n(19)\n\nZhu, M.; Aikens, C.M.; Hollander, F.J.; Schatz, G.C.; Jin, R. Correlating\n\nthe Crystal Structure of a Thiol-Protected Au-25 Cluster and Optical Properties.\nJ. Am. Chem. Soc. 2008, 130, 5883 - 5885.\n\n!\n\n\"*!\n\n\f(20)\n\nZhu, M.; Eckenhoff, W.T.; Pintauer, T.; Jin, R.C. Conversion of Anionic\n\n[Au25(SCH2CH2Ph)18]- Cluster to Charge Neutral Cluster via Air Oxidation J.\nPhys. Chem. C 2008, 112, 14221-14224.\n(21)\n\nQian, H.; Eckenhoff, W.T.; Zhu, Y.; Pintauer, T.; Jin. R. Total Structure\n\nDetermination of Thiolate-Protected Au-38 Nanoparticle. J. Am. Chem. Soc.\n2010, 132, 8280.\n(22)\n\nJadzinsky, P.D.; Calero, G.; Ackerson, C.J.; Bushnell, D.A.; Kornberg,\n\nR.D. Structure of a Thiol Monolayer-Protected Gold Nanoparticle at 1.1 Å\nResolution. Science 2007, 318, 430.\n\n(23)\n\nLopez-Acevedo, O.; Akola, J.; Whetten, R.L.; Grönbeck, H.; Häkkinen,\n\nH. Structure and Bonding in the Ubiquitous Icosahedral Metallic Gold Cluster\nAu144(SR)60. J. Phys. Chem. C 2009, 113, 5035\n(24)\n\nHäkkinen, H.; Walter, M.; Grönbeck, H. Divide and Protect: Capping\n\nGold Nanoclusters with Molecular Gold-Thiolate rings. J. Phys. Chem. B 2006,\n110, 9927-9931.\n(25)\n\nTran, N.T.; Powell, D.R.; Dahl, L.F. Nanosized Pd145(CO)x(PEt3)30\n\nContaining a Capped Three-Shell 145-Atom Metal-Core Geometry of Pseudo\nIcosahedral Symmetry. Angew. Chem. Int. Ed. 2000, 39, 4121.\n(26)\n\nKumara, C.; Dass, A. (AuAg)144(SR)60 Alloy Nanomolecules. Nanoscale\n\n2011, 3, 3064 - 3067.\n\n!\n\n#+!\n\n\f(27)\n\nTunc, I.; Guvenc, H.O.; Sezen, H.; Suzer, S.; Correa-Duarte, M.A.; Liz-\n\nMarzan, L.M. Optical Response of Ag-Au Bimetallic Nanoparticles to Electron\nStrorage in Aqueous Medium. J. Nanosci. Nanotechnol. 2008, 8, 3003-3007.\n(28)\n\nMortensen, J.J.; Hansen, L.B.; Jacobsen, K.W. Real-Space Grid\n\nImplementation of the Projector Augmented Wave Method. Phys. Rev. B 2005,\n71, 035109. The code can be downloaded at https://wiki.fysik.dtu.dk/gpaw.\n(29)\n\nWalter, M.; Akola, J.; Lopez-Acevedo, O.; Jadzinsky, P.D.; Calero, G.;\n\nAckerson, C.J.; Whetten, R.L.; Grönbeck, H.; Häkkinen, H. A Unified View of\nLigand-Protected Gold Clusters as Superatom Complexes. Proc. Natl. Acad. Sci.\n(USA) 2008, 105, 9157.\n(30)\n\nHäkkinen, H. Atomic and Electronic Structure of Gold Clusters:\n\nUnderstanding Flakes, Cages and Superatoms from Simple Concepts, Chem. Soc.\nRev. 2008, 37, 1847.\n(31)\n\nHulkko, E.; Lopez-Acevedo, O.; Koivisto, J.; Levi-Kalisman, Y.;\n\nKornberg, R.D.; Pettersson, M.; Häkkinen, H. Electronic and Vibrational\nSignatures of the Au102(p-MBA)44 Cluster, J. Am. Chem. Soc. 2011, 133, 3752.\n(32)\n\nVallee, F. Optical Properties of Metallic Nanoparticles, pp. 197 – 227 in\n\nNanomaterials and Nanochemistry, ed. by C. Brechignac, P. Houdy, M. Lahmani\n(Springer-Verlag, Berlin Heidelberg 2010).\n(33)\n\nAikens, C.M. Origin of Discrete Optical Absorption Spectra of M25(SH)18-\n\nNanoparticles (M = Au, Ag). J. Phys. Chem. C 2008, 112, 19797.\n\n!\n\n#\"!\n\n\f(34) Negishi, Y.; Iwai, T.; Ide, M. Continuous Modulation of Electronic Structure of\nStable Thiolate-Protected Au25 Cluster by Ag Doping. Chem. Comm. 2010, 46,\n4713 – 4715.\n(35)\n\nBlöchl, P.E. Projector Augmented-Wave Method. Phys. Rev. B 1994, 50,\n\n17953 - 17979.\n(36)\n\nPerdew, J.P.; Burke, K.; Ernzerhof, M. Generalized Gradient\n\nApproximation Made Simple. Phys. Rev. Lett. 1996, 77, 3865 - 3868.\n(37) Tang, W.; Sanville, E.; Henkelman G. A Grid-Based Bader Analysis Algorithm\nWithout Lattice Bias. J. Phys.: Comput. Mater. 2009, 21, 084204. See also:\nhttp://theory.cm.utexas.edu/bader/\n\n!\n\n##!\n\n\f"}