{"id": "http://arxiv.org/abs/1009.1149v1", "guidislink": true, "updated": "2010-09-06T20:01:15Z", "updated_parsed": [2010, 9, 6, 20, 1, 15, 0, 249, 0], "published": "2010-09-06T20:01:15Z", "published_parsed": [2010, 9, 6, 20, 1, 15, 0, 249, 0], "title": "The earliest galaxies seen in 21 cm line absorption", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1009.1678%2C1009.4098%2C1009.2356%2C1009.5920%2C1009.0361%2C1009.0846%2C1009.1673%2C1009.2288%2C1009.3259%2C1009.5412%2C1009.0305%2C1009.2550%2C1009.4592%2C1009.1854%2C1009.4076%2C1009.2048%2C1009.3734%2C1009.0582%2C1009.5169%2C1009.1522%2C1009.1118%2C1009.0399%2C1009.1850%2C1009.1693%2C1009.2855%2C1009.3155%2C1009.1646%2C1009.4857%2C1009.1753%2C1009.2643%2C1009.1059%2C1009.4211%2C1009.6133%2C1009.3807%2C1009.1090%2C1009.1470%2C1009.4329%2C1009.2130%2C1009.1169%2C1009.6160%2C1009.5410%2C1009.2672%2C1009.0457%2C1009.3946%2C1009.2015%2C1009.3476%2C1009.2496%2C1009.6220%2C1009.1204%2C1009.3662%2C1009.2834%2C1009.6031%2C1009.3194%2C1009.4666%2C1009.5487%2C1009.4045%2C1009.1260%2C1009.6092%2C1009.0350%2C1009.5472%2C1009.5194%2C1009.1011%2C1009.5446%2C1009.0038%2C1009.1460%2C1009.5541%2C1009.5911%2C1009.1233%2C1009.2565%2C1009.4586%2C1009.2162%2C1009.5314%2C1009.2458%2C1009.5211%2C1009.1784%2C1009.2394%2C1009.0200%2C1009.1471%2C1009.1994%2C1009.5313%2C1009.5097%2C1009.0034%2C1009.5376%2C1009.2158%2C1009.1466%2C1009.3814%2C1009.0931%2C1009.1149%2C1009.5626%2C1009.5543%2C1009.5563%2C1009.0760%2C1009.2257%2C1009.0084%2C1009.5265%2C1009.3656%2C1009.2649%2C1009.4310%2C1009.3959%2C1009.6146%2C1009.3886&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "The earliest galaxies seen in 21 cm line absorption"}, "summary": "We investigate the 21 cm absorption lines produced by non-linear structures\nduring the early stage of reionization, i.e. the starless minihalos and the\ndwarf galaxies. After a detailed modelling of their properties, with particular\nattention to the coupling physics, we determine their 21 cm absorption line\nprofiles. The infalling gas velocity around minihalos/dwarf galaxies strongly\naffects the line shape, and with the low spin temperatures outside the virial\nradii of the systems, gives rise to horn-like line profiles. The optical depth\nof a dwarf galaxy is reduced for lines of sight penetrating through its HII\nregion, and especially, a large HII region created by a dwarf galaxy with\nhigher stellar mass and/or a top-heavy initial mass function results in an\noptical depth trough rather than an absorption line. We compute synthetic\nspectra of 21 cm forest for both high redshift quasars and radio afterglows of\ngamma ray bursts (GRBs). Even with the planned SKA, radio afterglows of most if\nnot all GRBs would still be too dim to be the background sources for high\nresolution (1 kHz) observations, but absorption lines can be easily detected\ntowards a high-z quasar. Broadband observation against GRB afterglows can also\nbe used to reveal the evolving 21 cm signal from both minihalos and dwarf\ngalaxies if there was no X-ray background or it was extremely weak, but it\nbecomes difficult if an early X-ray background existed. Hence the 21 cm\nabsorption could be a powerful probe of the presence/intensity of the X-ray\nbackground and the thermal history of the early universe.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1009.1678%2C1009.4098%2C1009.2356%2C1009.5920%2C1009.0361%2C1009.0846%2C1009.1673%2C1009.2288%2C1009.3259%2C1009.5412%2C1009.0305%2C1009.2550%2C1009.4592%2C1009.1854%2C1009.4076%2C1009.2048%2C1009.3734%2C1009.0582%2C1009.5169%2C1009.1522%2C1009.1118%2C1009.0399%2C1009.1850%2C1009.1693%2C1009.2855%2C1009.3155%2C1009.1646%2C1009.4857%2C1009.1753%2C1009.2643%2C1009.1059%2C1009.4211%2C1009.6133%2C1009.3807%2C1009.1090%2C1009.1470%2C1009.4329%2C1009.2130%2C1009.1169%2C1009.6160%2C1009.5410%2C1009.2672%2C1009.0457%2C1009.3946%2C1009.2015%2C1009.3476%2C1009.2496%2C1009.6220%2C1009.1204%2C1009.3662%2C1009.2834%2C1009.6031%2C1009.3194%2C1009.4666%2C1009.5487%2C1009.4045%2C1009.1260%2C1009.6092%2C1009.0350%2C1009.5472%2C1009.5194%2C1009.1011%2C1009.5446%2C1009.0038%2C1009.1460%2C1009.5541%2C1009.5911%2C1009.1233%2C1009.2565%2C1009.4586%2C1009.2162%2C1009.5314%2C1009.2458%2C1009.5211%2C1009.1784%2C1009.2394%2C1009.0200%2C1009.1471%2C1009.1994%2C1009.5313%2C1009.5097%2C1009.0034%2C1009.5376%2C1009.2158%2C1009.1466%2C1009.3814%2C1009.0931%2C1009.1149%2C1009.5626%2C1009.5543%2C1009.5563%2C1009.0760%2C1009.2257%2C1009.0084%2C1009.5265%2C1009.3656%2C1009.2649%2C1009.4310%2C1009.3959%2C1009.6146%2C1009.3886&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We investigate the 21 cm absorption lines produced by non-linear structures\nduring the early stage of reionization, i.e. the starless minihalos and the\ndwarf galaxies. After a detailed modelling of their properties, with particular\nattention to the coupling physics, we determine their 21 cm absorption line\nprofiles. The infalling gas velocity around minihalos/dwarf galaxies strongly\naffects the line shape, and with the low spin temperatures outside the virial\nradii of the systems, gives rise to horn-like line profiles. The optical depth\nof a dwarf galaxy is reduced for lines of sight penetrating through its HII\nregion, and especially, a large HII region created by a dwarf galaxy with\nhigher stellar mass and/or a top-heavy initial mass function results in an\noptical depth trough rather than an absorption line. We compute synthetic\nspectra of 21 cm forest for both high redshift quasars and radio afterglows of\ngamma ray bursts (GRBs). Even with the planned SKA, radio afterglows of most if\nnot all GRBs would still be too dim to be the background sources for high\nresolution (1 kHz) observations, but absorption lines can be easily detected\ntowards a high-z quasar. Broadband observation against GRB afterglows can also\nbe used to reveal the evolving 21 cm signal from both minihalos and dwarf\ngalaxies if there was no X-ray background or it was extremely weak, but it\nbecomes difficult if an early X-ray background existed. Hence the 21 cm\nabsorption could be a powerful probe of the presence/intensity of the X-ray\nbackground and the thermal history of the early universe."}, "authors": ["Yidong Xu", "Andrea Ferrara", "Xuelei Chen"], "author_detail": {"name": "Xuelei Chen"}, "author": "Xuelei Chen", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1111/j.1365-2966.2010.17579.x", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1009.1149v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1009.1149v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "18 pages, 17 figures. Accepted for publication in MNRAS", "arxiv_primary_category": {"term": "astro-ph.CO", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "astro-ph.CO", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1009.1149v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1009.1149v1", "journal_reference": "MNRAS410, 2025-2042(2011)", "doi": "10.1111/j.1365-2966.2010.17579.x", "fulltext": "Mon. Not. R. Astron. Soc. 000, 000–000 (0000)\n\nPrinted 29 October 2018\n\n(MN LATEX style file v2.2)\n\nThe earliest galaxies seen in 21 cm line absorption\nYidong Xu1,2,4⋆, Andrea Ferrara3 , and Xuelei Chen4,5\n1 Department\n\nof Astronomy, School of Physics, Peking University, Beijing 100871, China\nSchool for Advanced Studies, Via Beirut 4, 34014 Trieste, Italy\n3 Scuola Normale Superiore, Piazza dei Cavalieri 7, 56126 Pisa, Italy\n4 National Astronomical Observatories, Chinese Academy of Sciences, Beijing 100012, China\n5 Center for High Energy Physics, Peking University, Beijing 100871, China\n\narXiv:1009.1149v1 [astro-ph.CO] 6 Sep 2010\n\n2 SISSA/International\n\n29 October 2018\n\nABSTRACT\n\nWe investigate the 21 cm absorption lines produced by non-linear structures during the early\nstage of reionization, i.e. the starless minihalos and the dwarf galaxies. After a detailed modelling of their properties, with particular attention to the coupling physics, we determine their\n21 cm absorption line profiles. The infalling gas velocity around minihalos/dwarf galaxies\nstrongly affects the line shape, and with the low spin temperatures outside the virial radii of\nthe systems, gives rise to horn-like line profiles. The optical depth of a dwarf galaxy is reduced\nfor lines of sight penetrating through its HII region, and especially, a large HII region created\nby a dwarf galaxy with higher stellar mass and/or a top-heavy initial mass function results in\nan optical depth trough rather than an absorption line. We compute synthetic spectra of 21 cm\nforest for both high redshift quasars and radio afterglows of gamma ray bursts (GRBs). Even\nwith the planned SKA, radio afterglows of most if not all GRBs would still be too dim to\nbe the background sources for high resolution (1 kHz) observations, but absorption lines can\nbe easily detected towards a high-z quasar. Broadband observation against GRB afterglows\ncan also be used to reveal the evolving 21 cm signal from both minihalos and dwarf galaxies\nif there was no X-ray background or it was extremely weak, but it becomes difficult if an\nearly X-ray background existed. Hence the 21 cm absorption could be a powerful probe of the\npresence/intensity of the X-ray background and the thermal history of the early universe.\nKey words: line: profiles – galaxies: dwarf – galaxies: high-redshift – cosmology: theory.\n\n1 INTRODUCTION\nThe formation of the earliest galaxies and the cosmic reionization\nare among the milestones in the history of the universe. As the first\nstars form in the earliest non-linear structures, they illuminate the\nambient intergalactic medium (IGM) and start the reionization process of hydrogen. Based on an instantaneous reionization model,\nthe polarization data of cosmic microwave background (CMB) constrain the redshift of reionization to be zreion ≈ 10.5 (Larson et al.\n2010), while the Gunn-Peterson troughs (Gunn & Peterson 1965)\nshown in quasar (QSO) absorption spectra suggest that the reionization of hydrogen was very nearly complete by z ≈ 6 (e.g.\nFan et al. 2006). However, at present we are still unable to observe the earliest galaxies directly, and our current understanding\non the reionization process is only based on theoretical models (e.g.\nFurlanetto et al. 2004) and simulations (e.g. Trac et al. 2008).\nThe most promising probe of the cosmic reionization is the\nredshifted 21 cm transition of HI which is directly related to the\nneutral component of the IGM (see e.g. Furlanetto, Oh & Briggs\n2006 for a review). Unlike the Lyα resonance line, the 21 cm\n\n⋆\n\nE-mail: xuyd@vega.bac.pku.edu.cn\n\nc 0000 RAS\n\nline could hardly be saturated because of its extremely small Einstein coefficient (A10 = 2.85 × 10−15 s−1 ), so it traces well\nthe reionization history, especially during the early stages. Using the CMB as the background radio source, 21 cm tomography could map out the three dimensional structure of the emission or absorption of 21 cm photons by the IGM (e.g. Madau et al.\n1997; Tozzi et al. 2000). However, it requires the deviation of\nthe spin temperature from the CMB temperature and may not\nbe feasible for certain epochs; it could not resolve structures\nsmaller than ∼ 1 Mpc; and it has a number of observational challenges (Furlanetto, Oh & Briggs 2006). Complementary to the 21\ncm tomography, the 21 cm forest observation detects absorption\nlines of intervening structures against high redshift radio sources\n(Carilli et al. 2002; Furlanetto & Loeb 2002; Furlanetto 2006), and\nit is immune to most of the above difficulties encountered by the\ntomography observation. As it is very sensitive to gas temperature (Xu et al. 2009), it provides a useful tool to constrain the Xray heating in the early universe. And also, the 21 cm forest is a\npromising probe that could possibly detect high redshift minihalos,\nwhich are important for determining the mean clumping factor of\nthe IGM and putting limits on small scale structure formation. Here\nwe focus on the absorption experiments and investigate the 21 cm\n\n\f2\n\nY. Xu, A. Ferrara, & X. Chen\n\nabsorption lines produced by the non-linear structures during the\nepoch of reionization.\nThe forest observation relies on the availability of luminous\nradio sources beyond the epoch of reionization. One possibility is\nthe high redshift quasars which have been observed up to z = 6.43\n(Willott et al. 2007), and a radio-loud quasar at z = 6.12 was discovered by McGreer et al. (2006). Using high-z quasars or radio\ngalaxies as backgrounds, Carilli et al. (2002) and Xu et al. (2009)\nhave examined the possibility of detecting 21 cm absorption by the\nneutral IGM based on simulations. Another possible option is the\nradio afterglows of high-z gamma ray bursts (GRBs). It is believed\nthat some of the long duration bursts are produced by the explosions of massive stars. The first stars are thought to be likely very\nmassive, and may produce bright GRBs which would be detectable\nup to a redshift as high as 60 (Naoz & Bromberg 2007). Recently,\nGRB 090423 was discovered at z = 8.1 (Salvaterra et al. 2009,\nwhile Tanvir et al. 2009 reported its redshift to be z = 8.26), establishing the new redshift record of observation for all objects except\nfor the CMB. The radio afterglow of a GRB can be observed out\nto a very late time when the outflow becomes sub-relativistic (e.g.\nPihlström et al. 2007), and considering the cosmic time dilation, it\noffers us an adequate integration time. One possible problem with\nthe GRB radio afterglow is that at very low frequency, synchrotron\nself-absorption may become important which may reduce the radio\nflux. Nonetheless, some GRB radio afterglows may be sufficiently\nbright at the relevant frequency ranges.\nIn order to plan such observations, we need to know what kind\nof signals will be produced by the early structures, and to understand the physics behind the expected signals. In this paper, we provide a detailed modeling of the 21 cm absorption lines produced by\nminihalos and dwarf galaxies during the epoch of reionization, and\nexplore the physical origins of the line profiles. We generate synthetic spectra of both quasars and GRB afterglows, on top of which\nthe 21 cm absorption lines are superposed. Projecting the capability\nof future instruments, we discuss the prospects of detecting the 21\ncm signals from these non-linear objects in the early universe.\nThis paper is arranged as follows. In Section 2, we describe\nthe physical model involved with the 21 cm absorptions, including\nthe halo model for high redshifts, the star burst criterion, a possible\nX-ray background, the physical processes taking place in minihalos\nand dwarf galaxies respectively, and the Lyα background produced\nby these early galaxies. In Section 3, we show the spin temperatures\nand 21 cm line profiles of minihalos and dwarf galaxies for various\nparameters. Statistical results including line number density, theoretical spectrum, and the equivalent width (EW) distribution are\ngiven in Section 4. Then, in Section 5 we study the feasibility of\nthe 21 cm observation by making mock spectra of both quasar and\nradio afterglow of GRB. Finally, we summarize and discuss our\nresults in Section 6.\nThroughout this paper, we adopt the cosmological parameters from WMAP5 measurements combined with SN and BAO\ndata: Ωb = 0.0462, Ωc = 0.233, ΩΛ = 0.721, H0 =\n70.1km s−1 Mpc−1 , σ8 = 0.817, and ns = 0.96 (Komatsu et al.\n2009).\n\n2 THE MODEL\nWe start with a description of various aspects of physics involved\nwith determining the absorption spectrum of 21 cm lines. This includes the high redshift number density of dark matter halos, gas\ndistribution inside and around halos, the criterion of star forma-\n\ntion, the X-ray and Lyα background, and a detailed modeling of the\nphysical properties of starless minihalos and galaxies, respectively.\nAmong these properties, the ionization state, the gas temperature\ndistribution, and the Lyα photon density are especially important\nfor determining the strength and line profiles of the 21 cm absorption by minihalos/dwarf galaxies.\n2.1 The Halo Model\nIn order to model the halo number density at high redshift, we\nuse the Sheth-Tormen halo mass function, which is based on an\nellipsoidal model for perturbation collapse and fits well the simulation results. The comoving number density of halos at redshift\nz with mass in the interval (M, M + dM ), can be written as\n(Sheth & Tormen 1999)\nn(M, z) dM = FST (σ, z)\n\nρ̄0 d ln σ −1\ndM,\nM dM\n\n(1)\n\nwhere\n\u0015\n\u0014\n\u0012 2 \u0013p \u0015\n\u0014\n2\nδsc\na δsc\nσ\n2a\n.\n1+\nexp −\nFST (σ, z) = A\n2\nπ\na δsc\nσ\n2 σ2\n(2)\nHere ρ̄0 is the cosmic mean density of the total matter today,\nσ = σ(M ) is the r.m.s. of a Gaussian density field smoothed on a\nmass scale M with a spherical top-hat filter of radius R, where R is\nequivalent to M in a fixed cosmology as R = (3M/4π ρ̄0 )1/3 , and\nδsc = 1.686/D(z) is the critical overdensity required for spherical collapse at redshift z, extrapolated to the present time using\nthe linear theory, where D(z) is the linear growth factor. The correction factors a = 0.707, p = 0.3, and A = 0.3222 were introduced as appropriate for ellipsoidal collapse (Sheth & Tormen\n2002; Sheth, Mo & Tormen 2001).\nThe 21 cm signal depends on the gas content of minihalos or\ngalaxies, and the gas fraction in halos will be suppressed by the\nheating processes during the reionization. Therefore, we set the\nlower limit of the halo mass to be the characteristic mass MC at\nwhich halos on average could only retain half of their baryons. The\ncharacteristic mass depends on the halo merger history and the thermal evolution of the universe (Gnedin 2000; Okamoto et al. 2008).\nAt high redshift that we are considering (z > 6), however, the filtering mass MF provides a good fit to the characteristic mass MC\n(Okamoto et al. 2008). Including the global heating process by an\nX-ray background (see section 2.3 in the following), we compute\nthe thermal evolution of the universe and find that this mass scale\nis ∼ 106 M⊙ beyond redshift 7 for an early X-ray background not\nhigher than 20% of the intensity today. For high redshifts of interest, it is not very sensitive to the uncertain intensity of the X-ray\nbackground because of the delayed response of the gas density distribution to the change in the gas temperature. However, if the early\nX-ray background was as high as today, or even higher, it would\nhave moderate effect in raising the Jeans mass and the filtering mass\n(see the right panel of Fig.2). So we take the halo mass range of\n[106 M⊙ , 1010 M⊙ ] for an X-ray background not higher than 20%\nof today's value, but also consider its effect on the minimum halo\nmass for higher intensities of the X-ray background (see section 4).\nThe range covers the characteristic halo mass and most of the galaxies that are responsible for the reionization (Choudhury & Ferrara\n2007).\nIn the following, we use the NFW density profile for dark\nmatter distribution inside of the virial radius rvir of a halo\n(Navarro, Frenk & White 1997). In general, the key parameter in\nthe NFW profile, the concentration parameter c, depends on the\nr\n\nc 0000 RAS, MNRAS 000, 000–000\n\n\fThe earliest galaxies seen in 21 cm line\n\nwhere ρg0 is the central gas density, μ is the mean molecular weight\nof the gas depending on the ionization state, mp is the proton mass,\nkB is the Boltzmann constant, and Tvir is the virial temperature of\nthe halo. Here ve (r) denotes the gas escape velocity at radius r,\nwhich can be written as\ncx\nZ ∞\nF (c x) +\nGM (r ′ ) ′\n2\n2\n1\n+\nc x , (4)\ndr = 2 Vc\nve (r) = 2\nr ′2\nx F (c)\nr\n\nwhere Vc2 ≡ GM/ rvir is the circular velocity at the virial radius,\nx ≡ r/ rvir , c is the halo concentration, and F (c) = ln(1 + c) −\nc/(1 + c). The maximum escape velocity is reached at the center of\nthe halo, ve2 (0) = 2 Vc2 c/F (c). In Eq.(3), the central density ρg0\nis determined by the condition that the total baryonic mass fraction\nwithin the virial radius is equal to Ωb /Ωm , which gives\nρg0\n(∆c /3) c3 (Ωb /Ωm ) eA\nRc\n,\n=\nρ̄m\n(1 + t)A/t t2 dt\n0\n\n(5)\n\nwhere ρ̄m = ρ̄m (z) is the mean matter density of the universe at redshift z, A ≡ 2 c/F (c), and ∆c is the mean density of a virialized halo with respect to the cosmic mean value\nρ̄m (Bryan & Norman 1998): ∆c = 18 π 2 + 82 (Ωzm − 1) −\n39 (Ωzm − 1)2 , where Ωzm = Ωm (1 + z)3 / [Ωm (1 + z)3 + ΩΛ ].\nTo determine the gas distribution outside rvir , one has to keep\nin mind that the gas slowly falls into the halo because of the gravitational force of the halo, so the gas has a peculiar (i.e. infalling) velocity which could be important for the 21 cm line. Also, due to the\nlarge cross-section at large radii, there is a high probability for the\nline of sight to go through these external parts of the halos, and this\ninfalling gas has to be included in the calculation. Barkana (2004)\nhas derived a model for the expected profiles of infalling matter around virialized halos based on the extended Press-Schechter\n(EPS) formalism (Bond et al. 1991). This \"Infall Model\"1 can also\nbe used to compute the final peculiar velocity profiles around virialized halos as well. The total velocity of the gas is the sum of\nthe peculiar velocity and the Hubble expansion. In these infalling\n1\n\nPublic code for this \"Infall Model\"\nhttp://wise-obs.tau.ac.il/ ̃barkana/codes.html.\nc 0000 RAS, MNRAS 000, 000–000\n\nis\n\navailable\n\nat\n\n2\n\n10\n\n1\n\n10\n\n0\n\nnH [cm−3]\n\nhalo mass as well as its redshift. Unfortunately, the concentration\nparameter found from low redshift simulations (Cooray & Sheth\n2002) is not directly applicable to the epoch of reionization. Thanks\nto the resimulation technique, Gao et al. (2005) have simulated an\nexample of the first halos from very high redshift with extremely\nhigh resolution, and its density profile is derived in each resimulation at the final time. Here we make use of their results. Assuming\nthat c is inversely proportional to (1 + z), as indicated by low redshift results, we make a 4th-order polynomial fit to the simulated\npoints in the logarithmic space of halo mass.\nFor the distribution of gas within the dark matter halo, we assume that the gas is in hydrostatic equilibrium with the dark matter,\nand have a spherical distribution. We expect gas in the high-z (and\nin general low-mass) galaxies have a rounder distribution rather\nthan settling into a disc because: (a) their circular velocities are\ncomparable to the sound speed, making the gas more rounded than\nflat; (b) at such high redshifts, there may not be enough time for the\ngas to settle in a smooth disk. With the NFW profile of dark matter\ndistribution, one can derive the gas density distribution analytically\n(Makino et al. 1998):\n\u0003\nμ mp \u0002 2\nln ρg (r) = ln ρg0 −\nve (0) − ve2 (r) ,\n(3)\n2 kB Tvir\n\n3\n\n10\n\n−1\n\n10\n\n−2\n\n10\n\n−3\n\n10\n\n−4\n\n10 −3\n10\n\n−2\n\n10\n\n−1\n\n0\n\n10\n\nr/r\n\n10\n\n1\n\n10\n\n2\n\n10\n\nvir\n\nFigure 1. The hydrogen number density profiles in and around dark matter\nhalos of different masses: M = 106 M⊙ (solid curves), M = 107 M⊙\n(dashed curves), and M = 108 M⊙ (dotted curves), respectively. The thick\ncurves are for redshift 20, while the thin curves are for redshift 10.\n\nregions around halos, we assume that the gas overdensity and velocity field follow the dark matter perfectly, with the scaling factor\nΩb /Ωm .\nSeveral illustrative curves of the total hydrogen number density profiles are shown in Fig.1 for various halo masses and two\nsets of redshifts. A constant hydrogen fraction of primordial value\nXH = 0.752 is assumed here (Spergel et al. 2007). The halos with\nsmaller mass and lower redshift are more concentrated. We can see\nthat there are discontinuities at rvir . That is because when we adopt\nthe gas density profile above, we are also assuming that the virilization shock is located right at the virial radius, and at the shock\nradius density and temperature jumps are expected. The exact position of the shock radius is subject to debate, and may depend on\nthe assembly history of the halo. For an cosmology with Ωm = 1,\nBertschinger (1985) found that the accretion shock forms at the radius R90.8 which encloses a mean dark matter density of 90.8 times\nthe cosmic mean, while Abel et al. (2002) suggests that the shock\nradius is close to the virial radius. Below we assume that the shock\nis located at the virial radius, but note that the exact position of the\nshock radius has only a small effect on the resulting 21 cm signal\n(see the next section).\n\n2.2 Star Formation Criterion\nAfter the formation of dark matter halos, some of the halos could\nform stars inside while others could not, depending mainly on the\ncooling processes in each halo (see McKee & Tan 2008 for a recent review). As for those halos with star formation, a star burst is\nmore likely than continuous formation at this early epoch, because,\nsmall objects are very sensitive to feedbacks and therefore, as soon\nas the first stars formed in the galaxy, their radiation and induced\nsupernovae could heat and eject the surrounding gas, quenching\nsubsequent star formation. In order to determine whether a halo is\nable to undergo a star burst, here we use a timescale criterion for\nstar formation. If the time required for a halo to start forming stars\nis longer than the Hubble time at the halo redshift, it will remain\nstarless, i.e. a system that is usually identified as a minihalo. Otherwise, the halo has enough time to cool and collapse to form stars,\nand becomes a dwarf galaxy. The timescale required for turning on\na star burst is modeled as the maximum between the free-fall time\n\n\f4\n\nY. Xu, A. Ferrara, & X. Chen\n\ntff and the cooling time tcool , i.e. tSB = max{ tff , tcool }, where\ntff = (3π/ 32 Gρ)1/2 . As for the minihalos and dwarf galaxies\nin the early universe, the main coolant is the molecular hydrogen\n(Abel et al. 2002; Bromm et al. 2002; Bromm & Larson 2004), and\ntcool is the H2 cooling timescale. Defining tcool ≡ T /Ṫ , one can\nobtain (Tegmark et al. 1997)\n!−1\n7/2\n10 T3\ntcool ≈ 48,200 yr 1 +\ne512K/T (f n1 )−1 , (6)\n60 + T34\nwhere T3 ≡ T /103 K, n1 ≡ nH /1cm−3 , and the f is the fraction\nof hydrogen in molecular form. This fraction varies with time and\nto get the precise value at virialization it would be necessary to\nfollow the entire collapse history, but after the virialization the H2\nfraction of a halo always saturates at ∼ 10−3 (Tegmark et al. 1997).\nFor simplicity, we use f = 10−3 hereafter.\nThe cooling and collapse processes start from the halo formation time, which is usually defined as the time at which a halo\nfirst acquires half of its final mass. There are several predictors\nfor the formation redshift distribution of dark matter halos, such\nas the standard EPS model (Lacey & Cole 1993), the ellipsoidal\ncollapse model (Sheth & Tormen 2002), and the non-spherical collapse boundary model (Chiueh & Lee 2001). At high redshift, the\nEPS model fits the simulation results best (Lin et al. 2003). According to the EPS model (Lacey & Cole 1993), the cumulative probability that a halo with mass M2 at redshift z2 has a formation time\ntF prior to t1 or a formation redshift zF higher than z1 is\nP (tF < t1 |M2 , t2 ) ≡ P (zF > z1 |M2 , z2 )\nZ Sh\nM2\n=\nfS1 (S1 , δsc1 |S2 , δsc2 ) dS1 ,\nM\n1\nS2\n\n(7)\n\nwhere fS1 (S1 , δsc1 |S2 , δsc2 ) dS1 is the conditional probability\nfunction:\nδsc1 − δsc2\nfS1 (S1 , δsc1 |S2 , δsc2 ) dS1 = √\n2π (S1 − S2 )3/2\n\u0014\n\u0015\n2\n(δsc1 − δsc2 )\n× exp −\ndS1 (S1 > S2 , δsc1 > δsc2 ).\n(8)\n2 (S1 − S2 )\n\nHere S is defined as the variance of density field smoothed on a\nmass scale M , S1 ≡ σ 2 (M1 ), S2 ≡ σ 2 (M2 ), Sh ≡ σ 2 (M2 /2),\nδsc1 ≡ δsc (z1 ), and δsc2 ≡ δsc (z2 ). Given any halo mass at the\nredshift of interest, we differentiate Eq.(7) with respect to zF to get\nthe differential distribution of the halo formation redshift, then its\nformation redshift zF is chosen by Monte-Carlo sampling of the\ndistribution curve.\nThe star burst time is simply ts = tF +tSB . When the criterion\nts < tH is satisfied, a star burst occurs at time ts , while ts > tH\nimplies that the halo is not able to form stars within a Hubble time.\n2.3 The 21 cm Optical Depth\nWith a high redshift GRB afterglow as the background source, the\nneutral hydrogen in the IGM absorbs the 21 cm photons along the\nline of sight. For the diffuse IGM beyond those regions affected\nby the gravity of non-linear structures, it expands uniformly with\nthe Hubble flow, then the optical depth is (Field 1959; Madau et al.\n1997; Furlanetto, Oh & Briggs 2006)\nτIGM =\n\n3 hP c3 A10 nHI (z)\n,\n2\n32 π kB ν10\nTS H(z)\n\n(9)\n\nwhere hP is the Planck constant, c is the speed of light, A10 =\n2.85 × 10−15 s−1 is the Einstein coefficient for the spontaneous\n\ndecay of the 21 cm transition, and ν10 = 1420.4 MHz is the rest\nframe frequency of the 21 cm transition. Here nHI , TS , and H\nare the neutral hydrogen number density, spin temperature, and the\nHubble parameter, respectively.\nIn order to compute the nHI and TS , a global description of\nthe ionization and thermal evolution of the IGM is required. Several authors (e.g. Oh & Haiman 2003; Furlanetto 2006) have shown\nthat X-rays will likely heat the IGM significantly before reionization completes. Also, if it existed, it could partially ionize the IGM,\nsuppress the formation of low mass minihalos, and heat the infall\nregions around surviving minihalos and dwarf galaxies. However,\nthe heating processes are quite uncertain during the early stages\nof reionization, and it is unknown what the X-ray intensity should\nbe at high redshifts. Here we include only the X-ray background\nheating which is the most important heating mechanism (Furlanetto\n2006). Calibrating the X-ray (> 0.2 keV) luminosity of high-z objects to nearby starburst galaxies, we have (Gilfanov et al. 2004;\nFurlanetto 2006)\n\u0012\n\u0013\nSFR\nLX = 3.4 × 1040 fX\nerg s−1 ,\n(10)\n1 M⊙ yr−1\nwhere SFR is the star formation rate, and fX is a correction factor\naccounting for the unknown properties of X-ray emitting sources in\nthe early universe. We will set fX = 0.1 as the fiducial value as the\nearly galaxies are probably much less productive of X-rays than the\nnearby starburst galaxies, but we take fX as a free parameter and\nvary the level of X-ray background by choosing different values\nof fX to illustrate the sensitivity of our results to this uncertain\nprocess. Assuming that the star formation rate is proportional to\nthe rate at which matter collapses into galaxies (Furlanetto 2006),\nthe total X-ray emissivity ǫX can be written as:\n\u0012\n\u0013\n2\nf⋆ dfcoll /dz 1 + z\nǫX\n= 5 × 104 K fX\n, (11)\n3 kB n H(z)\n0.1\n0.01\n10\nwhere n is the total particle number density (including hydrogen\natoms, protons, electrons, and helium), fcoll is the fraction of matter in collapsed halos with M > Mmin , where Mmin is typically\ntaken to be the mass threshold for atomic cooling which has a virial\ntemperature Tvir = 104 K, and f⋆ is the star formation efficiency\nnormalized to the cosmic baryon content. We use a mass-dependent\nf⋆ provided by the handy fit in Salvadori & Ferrara (2009), and\nevaluate it at Mmin for the most populous galaxies for approximation.\nA fraction of energy in the X-ray background contributes to\nthe heating of the IGM, and another fraction contributes to the ionization of IGM, these fractions depend on the ionizing state of the\nIGM (Valdés & Ferrara 2008). In the absence of an ionizing UV\nbackground, the ionization would be caused mainly by these Xray photons, and we take into account both the primary and the\nsecondary ionization processes in computing this x̄i (z), assuming\nionization equilibrium. Then the evolution of the gas temperature\nin the IGM can be described by (Furlanetto 2006)\ndTK\n2 ǫcomp\n2 ǫX,h\n= − 2 H(z) TK +\n+\n,\ndt\n3 kB n\n3 kB n\n\n(12)\n\nwhere the first item on the right-hand side describes the adiabatic\ncooling due to Hubble expansion, ǫcomp is the Compton heating/cooling rate per unit (physical) volume, and ǫX,h denotes the\npart of the total X-ray background going into heating. The Compton term is (see e.g. Furlanetto 2006)\n2 ǫcomp\nx̄i\n8 σT uγ\n=\n( Tγ − TK ).\n3 kB n\n1 + fHe + x̄i 3 me c\n\n(13)\n\nc 0000 RAS, MNRAS 000, 000–000\n\n\fThe earliest galaxies seen in 21 cm line\n\n1\n\n10\n\n0.8\n\n10\n\n11\n\n4\n\n10\n\n10\n\n0.6\n\ni\n\n2\n\nx\n\nTK [K]\n\nMF,J [Msolar]\n\n3\n\n10\n10\n\n0.4\n\n1\n\n0.2\n\n0\n\n0\n\n10\n\n5\n\n9\n\n10\n\n8\n\n10\n\n7\n\n10\n\n6\n\n10\n\n5\n\n10\n\n5\n\n10\n\n15\nz\n\n20\n\n25\n\n5\n\n10\n\n4\n\n10\n\n15\nz\n\n20\n\n25\n\n10\n\n5\n\n10\n\n15\nz\n\n20\n\n25\n\nFigure 2. The evolution of the global temperature (left panel), the mean ionized fraction (central panel), and the filtering mass and Jeans mass (right panel) of\nthe IGM. The dashed curves are for fX = 0, and the solid curves from bottom to top in each panel are for fX = 0.05, fX = 0.1, fX = 0.2, fX = 1.0, and\nfX = 5.0, respectively. In the right panel, the thin and thick curves illustrate the evolutions of the Jeans mass and the filtering mass respectively.\n\nHere fHe is the He fraction by number, σT = 6.65 × 10−25 cm2 is\nthe Thomson scattering cross section, uγ = (4 σ/c) Tγ4 ∝ (1+z)4\nis the energy density of the CMB photons, where σ = 5.67 ×\n10−5 erg cm−2 s−1 K−4 is the Stefan-Boltzmann constant, and me\nis the electron mass. The evolutions of the IGM temperature and\nthe mean ionized fraction caused by X-rays are shown in the left\nand central panels of Fig.2 for several values of fX . The case of\nfX = 0 is denoted by the dashed curves. It corresponds to the\nsituation in which there is no X-ray background, and the IGM temperature decreases adiabatically with a mean ionized fraction of\n3 × 10−4 which is the residual electron fraction left over after the\nrecombination. The solid curves from bottom to top in each panel\ntake fX = 0.05, fX = 0.1, fX = 0.2, fX = 1, and fX = 5, respectively. Here we also illustrate the corresponding evolutions of the\nJeans mass (thin curves) and the filtering mass (thick curves) in the\nright panel of Fig.2. The filtering mass, which provides a reasonable fit to the characteristic mass, is MF ∼ 106 M⊙ for fX . 0.2,\nMF ∼ 2×106 M⊙ for fX ∼ 1, and MF ∼ 5×106 M⊙ for fX ∼ 5\nat z ∼ 10.\nThe IGM creates a global decrement in the afterglow spectrum, on top of which minihalos and dwarf galaxies produce deep\nand narrow absorption lines. The main broadening mechanism of\neach absorption line is the thermal broadening with the Doppler\nprofile. The 21 cm optical depth of an isolated object is the integral\nof the absorption coefficient along the line of sight (Field 1959;\nMadau et al. 1997; Furlanetto & Loeb 2002):\nτ (ν)\n\n=\n×\n\n3 hP c3 A10 1\n32 π 3/2 kB ν 2\n\u0014\n\u0015\nZ +∞\n(u(ν) − v̄(r))2\nnHI (r)\nexp −\ndx, (14)\nb2 (r)\n−∞ b(r)TS (r)\n\nwhere\nb(r) is the Doppler parameter of the gas, b(r) =\np\n2 kB TK (r)/mH , u(ν) ≡ c (ν − ν10 )/ν10 , and v̄(r) is bulk velocity of gas projected to the line of sight at the radius r. Inside of\nthe virial radius, the gas is thermalized, and v̄(r) = 0, while the gas\noutside the virial radius has a bulk velocity contributed from both\nthe infall and the Hubble flow according to the \"Infall Model\". The\ncoordinate x is related to the radius r by r 2 = (α rvir )2 +x2 , where\nc 0000 RAS, MNRAS 000, 000–000\n\nα is the impact parameter of the penetrating line of sight in units of\nrvir .\nThe spin temperature of neutral hydrogen is defined by the\nrelative occupation numbers of the two hyperfine structure levels,\nand it is determined by three competing processes: (1) absorption of CMB photons; (2) collisions with other hydrogen atoms,\nfree electrons, and other species; and (3) scattering with UV photons. The equilibrium spin temperature is given by (Field 1958;\nFurlanetto, Oh & Briggs 2006):\nTS−1 =\n\nTγ−1 + xc TK−1 + xα TC−1\n,\n1 + xc + xα\n\n(15)\n\nwhere Tγ = 2.726(1 + z) K is the CMB temperature at redshift\nz, TK is the gas kinetic temperature, and TC is the effective color\ntemperature of the UV radiation. In most cases, TC = TK due to\nthe frequent Lyα scattering (Furlanetto, Oh & Briggs 2006). The\ncollisional coupling is described by the coefficient xc , and xα is\nthe coupling coefficient of the Lyα pumping effect known as the\nWouthuysen-Field coupling (Wouthuysen 1952; Field 1958). The\nmain contributions to xc are H-H collisions and H-e− collisions,\nand it can be written as\nHH\nxc = xeH\n=\nc + xc\n\nH\nne κeH\nnHI κH\n10 T⋆\n10 T⋆\n+\n,\nA10 Tγ\nA10 Tγ\n\n(16)\n\nwhere T⋆ = 0.0682 K is the equivalent temperature of the enHH\nergy slitting of the 21 cm transition, and κeH\n10 and κ10 are the\nde-excitation rate coefficients in collisions with free electrons and\nhydrogen atoms respectively. These two coefficients at different\ntemperatures are tabulated in Furlanetto, Oh & Briggs (2006). The\ncoupling coefficient xα is proportional to the total scattering rate\nbetween Lyα photons and hydrogen atoms,\nxα =\n\n4 Pα T⋆\n,\n27 A10 Tγ\n\n(17)\n\nwhere the scattering rate Pα is given by\nPα = c σα\nHere σα ≡\n\nntot\nα\n= 4π σα Jα .\n∆νD\n\n(18)\n\nπe2\nfα where fα = 0.4162 is the oscillator strength\nme c\n\n\fY. Xu, A. Ferrara, & X. Chen\n\nMinihalos refer to those small halos that are not capable of hosting\nstars, and they represent a very numerous population according to\nthe halo mass function. As we are considering the early stages of\nreionization, when the IGM was slightly ionized with some rare\nsites illuminated by the earliest galaxies, the background radiation\nfield has not been set up. However, the gas in minihalos, which\nhas much higher density, could be collisionally ionized partially,\ndepending on its temperature. The HI fraction is computed from\ncollisional ionization equilibrium (CIE)\n(19)\n\nwhere γ is the collisional ionization coefficient (Cen 1992), and\nαB is the case B recombination coefficient (Hui & Gnedin 1997)\nwhich is appropriate for the high-z and low-mass halos as well as\nthe IGM that are far from fully ionized.\nThe coefficients γ and αB are both functions of temperature.\nDuring the virialization process, the gas inside a minihalo is shock\nheated to the virial temperature. As for the gas outside the halo\n(r > rvir ), since we are looking at high redshifts when reionization is still very patchy, the IGM around a minihalo might be much\ncolder or much hotter than the gas inside the minihalo depending\non its environment. In other words, either the minihalo is embedded in an almost neutral region, or it is embedded in an HII region\nproduced by a neighboring galaxy. If we go to high enough redshifts, the probability for the halo to be in a neutral region increases.\nWith an X-ray background, we assume that the temperature of gas\naround each minihalo equals to TIGM . The HI column density of a\nminihalo (integrated from −rvir to +rvir along a line of sight passing through the halo center) as a function of its mass is shown in\nFig.3 for redshift 10. For low mass minihalos, the HI column density increases with the halo mass, but it decreases rapidly for halo\nmasses larger than ∼ 5 × 107 M⊙ , as the gas is gradually ionized\nin those halos with higher virial temperatures.\nAnother ingredient for the computation of 21 cm optical depth\nis the number density of Lyα photons, which is essential for determining the spin temperature of hydrogen. The background Lyα\nphotons can not penetrate into minihalos and contributing to the\nLyα flux inside them (see the arguments in section 2.3.3), and in\nthe absence of stars, the Lyα photons could come only from recombinations in the gas itself. The Lyα production rate is\nṅLyα = (2/3) αB ne np .\n\nx 10\n\n4\n\n3\n\n2\n\n1 6\n10\n\n2.3.1 Modeling the minihalos\n\nne nHI γ = αB ne np ,\n\n21\n\n5\n\n−2\n\nof the Lyα transition, ntot\nα is the total number density of Lyα photons, Jα is the number intensity of the Lyα photons, and ∆νD =\n(b/c) να is the Doppler width with b being the Doppler parameter\nand να being the Lyα frequency.\nIn addition to the global x̄i (z) and TIGM (z), to compute the\nline profiles of the 21 cm absorptions by minihalos and dwarf\ngalaxies, we need a detailed prescription of the ionization state, the\ntemperature profile, and the Lyα photon density in and around these\nobjects. We model respectively these properties of both minihalos\nand dwarf galaxies, as well as the intensity of Lyα background in\nthe following.\n\nNHI [cm ]\n\n6\n\n(20)\n\nThe factor of two-thirds accounts for the probability of the recombination leading to a Lyα photon and the other one-third is\nthe probability of obtaining photons of frequencies different from\nthe Lyα (Osterbrock 1989). Because of the extremely large crosssection of Lyα resonant scattering, the Lyα photons cannot escape\nimmediately from the halo, but scatter with the hydrogen atoms\n\n7\n\n10\nM [M\n\n8\n\n10\n]\n\nsolar\n\nFigure 3. The HI column density as a function of minihalo mass at redshift\n10.\n\nfrequently and diffuse in the gas. This process is well described\nas a \"random walk\". Thus, the Lyα photons can accumulate in a\n2\ngiven region for a diffusion time, tdiffu = lrms\n/(c lmfp ), where\nlrms is the r.m.s. distance that Lyα photons have to travel in order to escape from the region, and lmfp = (nHI σα /∆νD )−1 is\nthe mean free path of the Lyα photons. For the case of minihalo\nlrms = rvir . However, the Lyα accumulating time tacc is also limited by the time interval between the halo formation and the Hubble\ntime, i.e. (tH − tF ), then the real accumulating time of Lyα photons is tacc = min{ tdiffu , tH − tF }. Actually, tdiffu is quite large,\nand it is always longer than the Hubble time, so the Lyα photons\nwould accumulate for a time interval (tH − tF ). Due to the large\naccumulating time, even with a low ionized fraction in the IGM, the\nLyα photons from recombination could also be important outside\nthe rvir as compared to the background Lyα photons.\nIn order to illustrate the relative effects of collisional coupling\nand Lyα coupling in minihalos, we plot several contours of the coefficients xc (upper panel) and xα (bottom panel) on log(Tvir ) − z\nplanes in Fig.4. These coefficients are all calculated for the central\nproperties of halos, and to show clearly the dependence of xα on\nthe virial temperature of halos, we set the accumulation time of the\nLyα photons to be a Hubble time at each redshift.\nAs we see clearly from the contours, xα dominates over xc\nfor high mass halos, in which gas is collisionally ionized and Lyα\nphotons are effectively produced and accumulated from recombinations. On the other hand, xc dominates over xα for low mass\nhalos which are almost completely neutral.\nAs for xα , it has a very weak dependence on the redshift, but\nincreases dramatically around Tvir ∼ 104 K due to the change of\nionized fraction there. At higher temperatures, when the gas is almost collisionally ionized, the xα slowly drops again because of\nthe decreasing αB with temperature.\nThere are several effects taking place to determine the behavior of xc . In general, xc increases with temperature because of\neH\nH\nthe increasing collisional de-excitation rate κH\n10 and κ10 . At low\ntemperatures, xc comes mainly from the H-H collisions, and the\nslowly decreasing xc with increasing redshift is caused by the decreasing central density of hydrogen in less concentrated minihalos at higher redshifts. The coupling changes from H-H collisionsdominated to e− -H collisions-dominated as the temperature goes\nup, and this is in part responsible for the non-monotonic behavior of xc at log(Tvir ) ∼ 4 − 4.5. In addition, given a redshift,\nc 0000 RAS, MNRAS 000, 000–000\n\n\fThe earliest galaxies seen in 21 cm line\n\n7\n\nionizing threshold) denoted by ĒHe+ . The Lyman continuum photons are divided into two parts: photons with E < 100eV could\neffectively result in photonionization, and those soft X-rays with\nE > 100eV have a large probability to escape, and serve as an extra heating mechanism in addition to the X-ray background outside\nthe HII region. Assuming a simple power law for the high energy\ntail of the emission spectrum, we extrapolate QHe+ and ĒHe+ to\nget the production rate of soft X-rays QX and their average photon energy ĒX . Thus the production rate of ionizing photons is\nQion = QH − QX .\nAs we are considering an early reionization epoch when the\nUV background has not been set up, all the ionizing photons creating an HII region come from the stellar sources inside of the\ndwarf galaxy, i.e. the Qion . Considering the soft spectra of stellar sources, we assume a sharp boundary for each HII region, i.e.\nxi = 1 for r 6 RHII , xi = x̄i (z) for r > RHII and r > rvir , and\nxi = xi (CIE) for RHII < r 6 rvir when RHII < rvir . Further,\nwe assume all the stars to be located at the center of the galaxy, and\nneglect the Hubble expansion during the growth of the HII region,\nas its growth time is much shorter than the Hubble time. Starting\nfrom the star burst time, t∗ , the evolution equation of the radius of\nan HII region is\nZ R(t)\ndR\nnHI (R) 4πR2\n= Ṅγ (t) −\nαB ne np 4πr 2 dr, (21)\ndt\n0\nFigure 4. Contours of collisional coupling coefficient xc (upper panel) and\nLyα coupling coefficient xα (bottom panel) on log(Tvir ) − z planes. From\nbottom to top in each panel, the values of the contours are 7 × 103 , 104 ,\n3 × 104 , 5 × 104 , 7 × 104 , and 105 for xc , and 10−4 , 1, 104 , 108 , 1012 ,\n1013 , 1013 , and 1012 for xα , respectively.\n\nthe concentration is lower for higher mass (higher Tvir ) halos, and\nthe central density of gas is lower. Therefore, ne is smaller at high\ntemperatures when the gas is almost ionized and ne represents the\ntotal hydrogen density. This could also result in the non-monotonic\nbehavior of xc .\n\n2.3.2 Modeling the dwarf galaxies\nAs discussed in section 2.2, star bursts could occur in some of the\nhalos, turning them into dwarf galaxies when the cooling process\nallows the gas to cool and collapse within a Hubble time. Depending on the initial mass function (IMF) and star formation efficiency,\nthe stars produce a radiation field that will photonionize the gas creating an HII region, heat the gas around, and produce Lyα photons\nat the same time. All these effects could have influences on the\nstrength and shape of the 21 cm signal of the galaxy.\nThe initial mass function and the emission spectrum of the\nfirst galaxies remain very uncertain (see Ciardi & Ferrara 2005 for\na review). However, Schaerer (2002, 2003) has examined spectral\nproperties of the ionizing continua of high redshift starburst galaxies for various IMFs, metallicities and star formation histories2 . We\nmake use of their results for the emitting rate of H and He+ ionizing\nphotons per solar mass of burst stars, denoted by QH and QHe+ , as\nwell as the average energy per photon with E > 54.4eV (He+\n\n2\n\nData are available at:\nhttp://cdsarc.u-strasbg.fr/cgi-bin/Cat?VI/109\nc 0000 RAS, MNRAS 000, 000–000\n\nwhere Ṅγ (t) is the ionizing rate, and the second term on the righthand side accounts for recombinations in the HII region. Here\nαB = αB (104 K) = 2.59 × 10−13 cm3 s−1 is used, as appropriate for the temperature of an ionized region. Here we negelect\nthe change in gas density profile due to the heating, as we will see\nlater that it is quite weak. Before the ionizing front breaks out of\nthe virial radius, the ionization is caused by ionizing photons that\ndid not escape the galaxy, then\nṄγ (t) = (1 − fesc ) Qion f⋆\n\nΩb\nM,\nΩm\n\n(22)\n\nwhere fesc is the escape fraction of ionizing photons, and f⋆ is\nthe star formation efficiency normalized to the cosmic baryon content associated with a halo of mass M . We use fesc = 0.07\nas favored by the early reionization model (ERM, Gallerani et al.\n2008), and a mass-dependent f⋆ provided by the handy fit in\nSalvadori & Ferrara (2009). After the ionizing front grows larger\nthan the virial radius, all the ionizing photons have escaped, then\nfesc = 1, and\nṄγ (t) = fesc Qion f⋆\n\nΩb\nM.\nΩm\n\n(23)\n\nWe plot the radius of the HII region as a function of the time\nafter star burst for a dwarf galaxy with M = 107 M⊙ at redshift 10\nin Fig.5. The (physical) virial radius of this galaxy is rvir = 641pc.\nSince QH has a weak dependence on the metallicity but very sensitive to the IMF, we fix the metallicity at Z = 10−7 , and show the\ngrowth of RHII for three different IMFs. These IMF models are\ncorrespondingly chosen after Schaerer (2002, 2003), with a powerlaw slope of the Salpeter value (α = 2.35) and different upper and\nlower mass limits: 1 – 100 M⊙ (IMF-A), 1 – 500 M⊙ (IMF-B),\nand 50 – 500 M⊙ (IMF-C). The RHII grows very fast at the beginning, but limited by the speed of light. At later stages, it is also limited by the stellar lifetime. As the stars fade away, the subsequent\nsupernova explosions will sweep the surrounding gas away, thus\nsuppressing the 21 cm absorption signal. For this reason we stop\nthe evolution of the HII radius at its maximum value. As one could\n\n\f8\n\nY. Xu, A. Ferrara, & X. Chen\n\nIMF−A\nIMF−B\nIMF−C\n\n1\n\n10\n\n0\n\n10\n\nTK [K]\n\nRHII/rvir\n\n10\n\nNO SF\nIMF−A\nIMF−B\nIMF−C\n\n4\n\n3\n\n10\n\n−1\n\n10\n\n2\n\n10\n\n−2\n\n10\n\n1\n\n0\n\n10\n\n2\n\n10\n\n4\n\n10\ntime [yr]\n\n6\n\n10\n\n10\n\n8\n\n10\n\n10\n\n20\n\n30\n\n40\n\n50\n\nr/r\n\nvir\n\nFigure 5. The growth of RHII for a dwarf galaxy with mass M = 107 M⊙\nand redshift z = 10 after a star burst. The solid (black), dashed (blue), and\ndotted (red) curves are for IMF-A (1 – 100 M⊙ ), IMF-B (1 – 500 M⊙ ), and\nIMF-C (50 – 500 M⊙ ), respectively. All the IMF models have a Salpeter\nshape, the metallicity shown here is Z = 10−7 , and we set fX = 0.1 for\nthe X-ray background.\n\nexpect, the size of an HII region is very sensitive to the IMF due to\nthe strong dependence of Lyman continuum production on stellar\nmass. Here we are considering isolated HII regions around dwarf\ngalaxies, but in reality the galaxies will be somewhat clustered. So\nthe ionized regions may extend further. However, the clustering of\nthe first galaxies is beyond the scope of this work, and we reserve\nthis to future works.\nOnce an HII region is created, the gas inside rapidly approaches the temperature around 2 × 104 K (Meiksin 2007). For\nthe 21 cm absorption which requires neutral hydrogen, it is more\nimportant to compute the gas temperature outside the HII region.\nHere we include the heating by local soft X-rays emitted by the\ndwarf galaxies. While the stars in the galaxy are also emitting Lyα\nphotons, the heating effect due to the repeated Lyα scattering is\nnegligible (Chen & Miralda-Escudé 2004). So the evolution of gas\ntemperature can still be described by Eq.(12), but with an extra contribution to the ǫX,h from the local X-rays. The energy deposition\nrate of local soft X-ray heating is\nǫX,g = R nHI (ĒX − Eth ) fX,h ,\n\n0\n\n(24)\n\nwhere R is the ionizing rate by the soft X-rays, Eth = 13.6eV\nis the ionization threshold of hydrogen, and fX,h is the fraction of\nthe primary electron energy deposited into heat. The X-ray ionizing\nrate can be written as R = QX (t) M⋆ σI (ν)/(4πr 2 ), where M⋆ =\nf⋆ (Ωb /Ωm ) M , and σI (ν) is the photonionization cross section of\nhydrogen (Meiksin 2007):\n\" \u0012\n\u0013−s\n\u0013−s−1 #\n\u0012\nν\nν\nσI (ν) = σ0 β\n+ (1 − β)\n,\n(25)\nνth\nνth\nwhere σ0 = 6.30×10−18 cm2 , νth = 3.290×1015 Hz corresponding to the ionization threshold 13.6eV, β = 1.34, and s = 2.99.\nThe average frequency of photons with E > 0.1 keV is used here.\nAs for fX,h , we use a handy fit by Valdés & Ferrara (2008), which\nis a function of ionized fraction xi .\nWith the initial condition of the IGM temperature at the star\nburst time, we solve for the gas temperature around an HII region,\nand plot the results for a dwarf galaxy with M = 107 M⊙ at redshift 10 in Fig.6. We take fX = 0.1 as the fiducial value for the\n\nFigure 6. The temperature profiles of gas around a dwarf galaxy with mass\nM = 107 and metallicity Z = 10−7 at redshift z = 10. The solid\n(black), dashed (blue), and dotted (red) curves are for Salpeter IMFs with\nmass ranges of 1 – 100 M⊙ (IMF-A), 1 – 500 M⊙ (IMF-B), and 50 – 500\nM⊙ (IMF-C), respectively. The temperature profile of gas if there is no star\nformation is also plotted with the dot-dashed (green) curve, and a fiducial\nvalue of fX = 0.1 is assumed for the X-ray background.\n\nX-ray background. The solid, dashed, and dotted curves are for the\nthree IMF models used in Fig.5. For illustration, we have assumed\nthat the star burst occurred at the same time as the halo formation,\nand the temperatures are all evaluated at tvalue = tH − tF , where\nthe most probable value for zF is used. For comparison, the temperature profile for a starless minihalo of the same mass and redshift\nis also shown as the dot-dashed line. Inside the HII region, the temperature is fixed at 2 × 104 K, and it drops down very sharply at the\nionizing front due to the lower heating rate outside, as we could expect for stellar sources. The main heating mechanism outside rvir\nis the X-ray background heating.\nApart from ionizing photons and soft X-rays, the dwarf galaxy\nis also producing Lyα photons which are essential for determining\nthe spin temperature of hydrogen. However, those Lyα photons directly emitted by the galaxy could hardly contribute to the coupling\nin the gas outside the HII region due to the extremely long diffusion time, and they will be blocked near the ionization front. It is\nthe Lyα photons cascaded from soft X-rays that penetrate into the\nnearby IGM and effectively couple the spin temperature to the kinetic temperature of the gas (Chen & Miralda-Escudé 2008). So the\ncontributing Lyα photons near an HII region come from recombination, the Lyα background, as well as the soft X-ray cascading.\nValdés & Ferrara (2008) have examined the fraction fLyα of the\nprimary energy of electrons ionized by X-rays that converts into\nLyα radiation. Using their result, the Lyα production rate from cascading around the HII region is\nṅLyα = R nHI\n\nĒX − Eth\nfLyα ,\nhνα\n\n(26)\n\nwhere να = 2.47 × 1015 Hz is the frequency of Lyα photons.\nThe total number density of Lyα photons is obtained by integrating\nṅLyα over an accumulating time tacc .\nIn this case, the accumulating time of Lyα photons is tacc =\nmin{ tdiffu , tXray , (tH −ts ) }, where tdiffu is the Lyα diffusion time\nas before, but we take the mean free path (m.f.p.) of the soft X-rays\nas the lrms here. tXray is the time during which the dwarf galaxy\nis producing X-rays, and (tH − ts ) is the time interval between the\nhalo redshift and the star burst redshift. Because of the large m.f.p.\nc 0000 RAS, MNRAS 000, 000–000\n\n\fThe earliest galaxies seen in 21 cm line\nof the X-rays (compared to the rvir ), the Lyα diffusion time is also\nvery large in this case, even larger than the Hubble time. As a result,\nthe Lyα accumulating time is determined by (tH − ts ) for the cases\nwith IMF-A and IMF-B, while for the case with IMF-C, the Lyα\naccumulating time is limited by the lifetime of the stars.\n2.3.3 The Lyα background\nIn addition to the Lyα photons produced by recombination and\nthose cascaded Lyα photons near galaxies, there is also a Lyα\nbackground. The Lyα background originates from the continuum\nphotons to the blue side of the Lyα line emitted by the early\ngalaxies, and its intensity becomes important at very high redshift\n(Chen & Miralda-Escudé 2008). Only photons with ν < νβ can be\nredshifted to να , and all photons of higher frequencies will be absorbed at the Lyβ or higher resonance Lyman series lines. Let E(ν)\nbe the number of photons emitted over stars' lifetime per baryon in\none of the halos that collapse to form stars and per unit of frequency. According to the stellar spectra we adopted from Schaerer\n(2003), E(ν) is well approximated as flat near the Lyα frequency,\nthen the intensity of the continuum Lyα background can be written\nas (Chen & Miralda-Escudé 2008)\nJα = J ̃0 Ēα να [F (z) − F (zβ )].\n\n(27)\n\nHere J ̃0 is the fiducial Lyα intensity corresponding to a photon\ndensity of one photon per hydrogen atom per log frequency,\nc nH\nJ ̃0 =\n,\n(28)\n4π να\nwhere nH is the number density of hydrogen. Ēα = Ē(να ) is\naveraged over all the galaxies in the mass range of our consideration, and we estimate this value from the spectrum data provided\nby Schaerer (2003). In Eq.(27), F (z) is the fraction of mass bound\nin star-forming halos,\nZ Mmax\nM\nF (z) =\nn(M, z) p⋆ (M, z) dM,\n(29)\nρ̄0\nMmin\nwhere n(M, z) is the halo mass function and p⋆ (M, z) is the\nprobability of having star formation for a halo with mass M\nat redshift z. We derive p⋆ (M, z) according to the star formation criterion given in Section 2.2. At z = 20, Jα ≈ 3 ×\n10−11 cm−2 s−1 sr−1 Hz−1 , while at z = 10, it has increased to\nJα ≈ 2 × 10−10 cm−2 s−1 sr−1 Hz−1 which is already important\nfor the Wouthuysen-Field coupling effect.\nThe problem of Lyα background propagating into minihalos\nis complicated. The situation in minihalos would be different from\nthat in the IGM because of their higher column densities of neutral\nhydrogen (typically, NHI ∼ 1021 cm−2 ). The Lyα scattering cross\nsection in a region of high density consists of a Doppler core with\na typical width of ∆νD = b/λα centered on the Lyα frequency,\nand Lorentzian wings outside the core. Once a photon is redshifted\nor scattered into the \"core\" frequencies, the cross section is large\nand its mean free path becomes very short and is spatially confined\nwithin a small region with very long diffusion time. Thus, the photons which eventually make up the Lyα background come from the\nblue side of the Lyα line, at the edge of the \"core\" and \"wing\".\nIn the case of minihalo, however, these photons would be blocked\nat the surface of the minihalo. The redshift across the minihalo is\nalso too small for bluer wing photons which is not blocked at the\nedge of the minihalo to get redshifted into the core-wing boundary\nregion when they arrive at the center of the halo.\nAnother possibility is to consider photons with such frequency\nc 0000 RAS, MNRAS 000, 000–000\n\n9\n\nthat their optical depth through the minihalo is about 1. Such a photon would scatter once inside the halo. One scattering per photon\nis of course negligible for the coupling effect in itself, but the frequency of the photon would be changed after the scattering. If the\nfrequency increases, then the photon cross section become even\nsmaller and would escape right away, but if the photon loses energy during the collision and shifts to lower frequency, the cross\nsection would be increased. Could such a change bring the photon\nfrom the \"wing\" to the \"core\"? The frequency ν of such a wing\nphoton is given by NHI (rvir ) σα (ν) = 1, where NHI (rvir ) is the\ncolumn density of the minihalo from rvir to its center, and σα (ν) is\nthe scattering cross section on the Lyα damping wing. For typical\nthermal velocity of the H atom in the minihalo, we estimate that the\nchange of photon frequency in one scattering d ν < 2.2 × 1011 Hz,\ncomparable to the size of the core. On the other hand, the frequency\ndistance to the line center for such a photon is (ν − να ) ∼ 1013 Hz,\nso d ν ∼ 1%(ν − να ). Therefore, during one or even a few favorable scatterings the photon could not enter the core and should\nescape away. We conclude that with the exception of the surface,\nthe Lyα background could not affect the spin temperatures of the\nminihalos.\n\n3 THE 21 CM LINE PROFILES\nWith the detailed models of gas density, velocity profile, ionization state, temperature evolution, and the intensity of both local and\nglobal Lyα photons for the minihalos and the dwarf galaxies described above, we are now ready to compute their spin temperature\nprofiles and 21 cm optical depths. In this section, we show our results of these detailed profiles for a variety of parameters. Although\nit will be very challenging to resolve them with radio instruments in\nthe near future, these analyses help us explore the physical origins\nof the line profiles and understand the physics behind.\n3.1 The Coupling Effects and Spin Temperature\nIn Fig.7, we plot the spin temperature as a function of distance from\nthe halo center for a minihalo (left panel) and a dwarf galaxy (right\npanel) of the same mass M = 107 M⊙ at redshift z = 10. We have\ntaken fX = 0.1 as the fiducial value for the X-ray background. In\norder to show the coupling effects, the kinetic temperature of the\ngas and the CMB temperature are also plotted. As we see clearly\nfrom the left panel, the spin temperature of the minihalo is coupled\nto the gas kinetic temperature (Tvir of the halo) at the center. The\nhalo with M = 107 M⊙ and z = 10 has Tvir ∼ 5000 K, and\nthe gas is almost neutral in collisional ionization equilibrium. As\na result, the Lyα photons from recombination is totally negligible\nand the collisional coupling dominates. As the radius increases, the\ncollisional coupling becomes less and less effective because of the\ndecreasing density, and the spin temperature gradually decouples\nfrom the kinetic temperature. In addition to the dropping density,\nHH\nthe collisional de-excitation rate coefficients (κeH\n10 and κ10 ) also\ndecrease due to the sharply decreasing kinetic temperature outside\nrvir , dramatically reducing the collisional coupling effect. However, the Lyα background at z = 10 is already strong enough to\ncouple the spin temperature closely to the kinetic temperature of\nthe gas. And the recombination in the IGM also produces a significant amount of Lyα photons. As a result, TS is always coupled to\nTK outside minihalos at z = 10.\nAs for the spin temperature profile of the dwarf galaxy in\nthe right panel of Fig.7, the IMF model-A and a metallicity of\n\n\f10\n\nY. Xu, A. Ferrara, & X. Chen\n4\n\n4\n\n10\n\n10\nT\n\nT\n\nT\n\nT\n\nCMB\n\nCMB\n\nS\n\n3\n\n10\n\nS\n\n3\n\n10\n\nT\n\nT\n\nK\n\nT [K]\n\nT [K]\n\nK\n\n2\n\n10\n\n1\n\n1\n\n10\n\n10\n\n0\n\n10 −1\n10\n\n2\n\n10\n\n0\n\n0\n\n1\n\n10\n\n10\n\n10 0\n10\n\n2\n\n10\n\n1\n\n2\n\n10\n\nr/r\n\n10\nr/r\n\nvir\n\nvir\n\nFigure 7. Spin temperature (dashed lines) and kinetic temperature (dot-dashed lines) profiles of a minihalo/dwarf galaxy with mass M = 107 M⊙ at redshift\n10. A fiducial value of fX = 0.1 is assumed for the X-ray background. The solid curves represent the CMB temperature. Left: the case for a minihalo in CIE.\nRight: the case for a dwarf galaxy which is photonionized after a star burst with IMF model-A and metallicity Z = 10−7 . The temperature curves are cut at\nthe HII radius of 7.02 rvir .\n\n4\n\n10\n4\n\n10\n\n3\n\n10\n3\n\nS\n\nT [K]\n\nS\n\nT [K]\n\n10\n\n2\n\n10\n\n1\n\n10\n\n1\n\n10\n\n0\n\n10 −1\n10\n\n2\n\n10\n\n0\n\n0\n\n1\n\n10\n\n10\n\n2\n\n10\n\nr / rvir\n\n10 −1\n10\n\n0\n\n10\n\n1\n\n10\nr / rvir\n\n2\n\n10\n\nFigure 8. Spin temperature profiles of minihalos/dwarf galaxies of different masses: M = 106 M⊙ (solid curves), M = 107 M⊙ (dashed curves), and\nM = 108 M⊙ (dot-dashed curves), respectively. A fiducial value of fX = 0.1 is assumed for the X-ray background. The set of thick curves is for redshift 20,\nand the set of thin curves is for redshift 10. Left: the case for minihalos in CIE. Right: the case for dwarf galaxies that are photonionized after a star burst with\nIMF model-A and metallicity Z = 10−7 .\n\nZ = 10−7 are assumed. We stop the RHII and TK evolution at\ntvalue = tH − tF , where tF is the most probable formation time\nof this halo, and the spin temperature is also evaluated at this time.\nThe left-hand side cut-offs of these curves are just the position of\nRHII (7.02 rvir ). As the HII radius of this galaxy is larger than the\nvirial radius, the low density and low temperature outside the HII\nregion make the collisional coupling very weak. In this case, the\nLyα pumping is always the dominating coupling effect. The global\nLyα photons from recombination and background flux dominate\nover the local Lyα photons from soft X-ray cascading, and just as\nthe case outside a minihalo, the spin temperature sticks to the gas\nkinetic temperature.\nThen we investigate how the spin temperature changes with\nhalo mass and redshift, and plot two sets of curves for various halo\nmasses in Fig.8, one (the thin set) for z = 10, and the other (the\nthick set) for z = 20. A fiducial value of fX = 0.1 is assumed here.\nFor the minihalos in the left panel, the spin temperature is closely\ncoupled to the kinetic temperature outside the rvir for halos at z =\n\n10, in part because of the Lyα background, and in part because of\nthe accumulated Lyα photons from recombination in the IGM that\nis partially ionized by the X-ray background. But at z = 20, both\nthe Lyα background and the X-ray background are still weak, and\nTS lies between the TCMB and TK for gas around minihalos at this\nredshift. Inside the halos, the density is larger at higher redshift, and\nthe collisional coupling effect is correspondingly stronger, so the\nspin temperature is more tightly coupled to the virial temperature.\nOn the other hand, halos are more concentrated at lower redshift,\nand the slope of gas density profile is steeper. As a result the spin\ntemperature drops more rapidly with radius at lower redshift. One\ndifferent feature for the 108 M⊙ halo is that its spin temperature\nis effectively coupled to the gas kinetic temperature out to rvir ,\nbecause for this relatively high mass halo, its virial temperature\n(∼ 1.5 × 104 K for z = 10, and ∼ 2.3 × 104 K for z = 20) is\nhigh enough to make the gas collisionally ionized (xi ∼ 52% for\nz = 10, and xi ∼ 98% for z = 20). With this partially ionized\n\nc 0000 RAS, MNRAS 000, 000–000\n\n\fThe earliest galaxies seen in 21 cm line\n0.2\n\n11\n\n0.1\n0.08\n\n0.15\n\nν\n\n0.1\n\nτ\n\nτ\n\nν\n\n0.06\n0.04\n0.05\n\n0.02\n\n0\n−80 −60 −40 −20\n0\n20\nν−ν10 [kHz]\n\n40\n\n60\n\n80\n\n0\n−80 −60 −40 −20\n0\n20\nν−ν10 [kHz]\n\n40\n\n60\n\n80\n\nFigure 9. Optical depth profiles of a minihalo/dwarf galaxy with mass M = 107 M⊙ at redshift 10. All the curves take fX = 0.1. The impact parameters\nof the thick curves are α = 0 (solid cyan), 0.3 (short-dashed blue), 1 (dotted red), 3 (dot-dashed green), and 10 (long-dashed magenta), respectively, and the\nthin solid black curve is for α = 30. Left: the case for a minihalo in CIE. Right: the case for a dwarf galaxy which is photonionized after a star burst with IMF\nmodel-A and metallicity Z = 10−7 .\n\ngas, Lyα photons from recombinations are effectively trapped, and\nserve as a strong coupling agent.\nIn the right panel of Fig.8, the spin temperature profiles for\ndwarf galaxies are all cut off at their HII radii at the left-hand side.\nFor the case of 106 M⊙ dwarf galaxy, due to the much lower star\nformation efficiency (f⋆ ∼ 4×10−5 , which increases to ∼ 0.03 for\na galaxy with 108 M⊙ ) (Salvadori & Ferrara 2009), it could only\ncreate a very small HII region (RHII ∼ 0.008 rvir for z = 10, and\nRHII ∼ 0.02 rvir for z = 20). As for the galaxies with 107 M⊙\nand 108 M⊙ , they have larger stellar masses and create larger HII\nregions. So they have much less gas which could contribute to the\n21 cm line absorption.\n\n3.2 The Absorption Line Profiles\nConsider an isolated minihalo with mass M = 107 M⊙ at redshift\nz = 10 for which we compute the optical depth as a function of frequency using Eq.(14). Results are shown in the left panel of Fig.9\nfor different impact parameters of the lines of sight. Very interesting features can be seen in the shown profiles. First, there are two\npeaks which sandwiched the center of the line for impact parameters α = 1 and α = 3, showing horn-like profiles; second, as the\nimpact parameter increases, the peak optical depth is NOT always\ndecreasing. These two points are related issues, and they are both\ncaused by the infalling gas with low spin temperature outside the\nminihalo.\nTo see clearly the origin of these interesting profiles, we have\nto understand the different contributions to the 21 cm absorption\nfrom the gas located at different radii. Because of the infall, the\nabsorption line produced by the gas at the far side of the halo is\nblue-shifted, while that produced by the gas at the near side of the\nhalo is redshifted. Let νp (r) be the peak frequency of optical depth\ncreated by gas located at radius r, and according to the integrand in\nEq.(14), the absorption is shifted from the line center by\nνp (r) − ν10 =\n\nv̄(r)\nν10 .\nc\n\n(30)\n\nConsidering a line of sight passing through a minihalo with M =\n107 M⊙ and z = 10 from the center (α = 0), we divide the integration into segments, each of which has a contribution from a length\nc 0000 RAS, MNRAS 000, 000–000\n\nof 1 rvir on the line of sight. Then we plot every absorption line\ncreated by one segment in Fig.10. In the upper panel, the absorption line produced by the gas inside of rvir is shown as the dashed\ncurve, the solid lines from right to left correspond to the absorptions\nby segments of (1 − 2) rvir , (2 − 3) rvir , (3 − 4) rvir , (4 − 5) rvir ,\n(5 − 6) rvir , and (6 − 7) rvir , respectively, and the dotted-dashed\nline represents the absorption by the segment of (7 − 8) rvir . In the\nbottom panel, the 12 solid lines from left to right correspond to the\nabsorptions by segments of 1 rvir each starting from 8 rvir , and the\nlast curve on the right represents the integral absorption from 20 to\n100 rvir .\nAs seen clearly from Fig.10, the virialized gas inside the minihalo has no bulk velocity, and the peak optical depth is located at\nthe center. The gas at (1 − 2) rvir has the highest infall velocity,\nand the corresponding profile lies at the largest distance to the line\ncenter in the upper panel. As the radius increases, the τν profile\ngets closer to the line center because of the lower infall velocity,\nand the optical depth decreases slowly with the decreasing density.\nOne interesting feature is that there is a special position where the\ntotal velocity of the gas changes from negative (infall dominated)\nto positive (Hubble flow dominated), and at this turning point the\ntwo absorption lines created by the two segments on both sides of\nthe minihalo converge into one at the line center, and they contribute substantially to the central optical depth. For the minihalo\nwith M = 107 M⊙ and z = 10, this turning point lies at 7.3 rvir ,\nand consequently the absorption by the segment of (7 − 8) rvir\npeaks at the line center. After that, the τν profiles that come from\nlarger radii leave the line center again, because the infall velocity\nbecomes even smaller and the total velocity (in the same direction\nas Hubble flow) becomes more and more positive. Finally, when\nit goes out of the region influenced by the minihalo's gravity, and\nthe density drops to the cosmic mean value, we recover the IGM\noptical depth.\nThe line profiles in Fig.9 are better understood by noting that\neach is an integral of contributions from different radii. A substantial contribution to the optical depth comes from the outer region,\nbecause the gas outside rvir has lower spin temperature. Especially,\nthe gas in the infalling region on the far (near) side of the halo\nshares the same bulk velocity with the gas out of the region on\nthe near (far) side, and they absorb the 21 cm photons at the same\n\n\f12\n\nY. Xu, A. Ferrara, & X. Chen\nmaximum when α ≈ RHII and then drops, approaching the IGM\noptical depth.\n\n0.05\n\n0.03\n\nτ\n\nν\n\n0.04\n\n0.02\n0.01\n0\n\n0.03\n\nτ\n\nν\n\n0.04\n\n0.02\n0.01\n0\n0\n\n20\n\nν−ν\n\n40\n[kHz]\n\n60\n\n80\n\n10\n\nFigure 10. Different contributions to the optical depth from the gas at different radii. Upper panel: the absorption by gas inside of rvir is shown as\nthe dashed line, the solid lines from right to left correspond to the absorptions by segments of (1 − 2) rvir , (2 − 3) rvir , (3 − 4) rvir , (4 − 5) rvir ,\n(5 − 6) rvir , and (6 − 7) rvir , respectively, and the dotted-dashed line represents the absorption by the segment of (7 − 8) rvir . Bottom panel: the\n12 solid lines from left to right correspond to the absorptions by segments\nof 1 rvir each starting from 8 rvir , and the last curve represents the integral\nabsorption from 20 to 100 rvir .\n\nfrequency. Therefore, the optical depth at the frequency range corresponding to the infalling region is increased a lot. In addition, the\nline profile gets narrower with lower temperature compared to the\ngas inside the halo, which further increases the peak value. As the\nimpact parameter α increases from 0 to 1, more contribution comes\nfrom this cold region, so the peak optical depth increases. Also, the\ninfall velocity shifts the peaks away from the center, and results in\nthe horn-like profile. As α increases further up to 3, the infall velocity decreases, and the two peaks move closer to each other. For\nα larger than the radius of the velocity turning point, the two peaks\nmerge together and decrease slowly to the IGM optical depth as\nα → ∞.\nThe 21 cm profiles for an isolated dwarf galaxy for various\nimpact parameters are shown in the right panel of Fig.9. Just as\nbefore, the spin temperature and the optical depth profiles are all\nevaluated at the time tvalue = tH − tF , and the most probable\nvalue for zF is used. Thus we get an upper limit on the ionization, heating, and Lyα coupling effects. The line profiles are completely different from the case of minihalos. The horn-like profiles\ndisappears and the absorption is strongly reduced for small impact\nparameters. The dwarf galaxy with M = 107 M⊙ and z = 10\nhas an HII radius of 7.3 rvir , which is close to the turning point\nof the gas velocity. In other words, the hydrogen atoms inside rvir\nand those within the infalling region are totally ionized, erasing the\nabsorption features contributed by hydrogen in this region. Therefore, there will be only one peak at the center no matter what the\nimpact parameter is, and the optical depth is reduced for lines of\nsight which penetrate the HII region. As the impact parameter α\nincreases, the optical depth first increases because more neutral gas\nnear the HII region is intercepted by the line of sight. It reaches a\n\nWe also show the optical depth profiles for different halo\nmasses and redshifts in Fig.11. Here we also take fX = 0.1 for\nthe X-ray background. In the left panel, the case for minihalos is\nshown. As we expected, the line profiles are broader for halos with\ngreater masses. That is because, on one hand, the virial temperature\nis higher for halos of greater masses, which results in a broader\nDoppler profile for the absorption by gas inside the halo, and on\nthe other hand, more massive halos have stronger gravitational influence on the surrounding gas, and the induced higher infalling\nvelocity shifts the absorption line farther from the line center. In\ngeneral, the absorption is stronger at higher redshift. The reason is\nthat the IGM is denser at higher redshift, and also, the X-ray background is gradually set up as redshift decreases, and it heats and\npartially ionizes the gas in the IGM. As the frequency gets far from\nthe line center, the optical depths of all the minihalos approach to\nthe mean IGM value.\nIn the right panel of Fig.11, we show the 21 cm line profiles\nfor dwarf galaxies with the same masses and redshifts as those\nfor minihalos in the left panel. Star bursts with IMF model-A and\nmetallicity Z = 10−7 are assumed. An interesting feature emerges\nfor the galaxy with 108 M⊙ . Because of the higher star formation efficiency associated with higher mass galaxies, this dwarf\ngalaxy creates a large HII region (RHII ∼ 38 rvir for z = 10,\nand RHII ∼ 34 rvir for z = 20) erasing all the absorption inside of\nit. As a result, a broad optical depth trough is produced instead of\nan absorption line! In the case of IMF model-C, the dwarf galaxy\nof the same mass could ionize an even larger HII region and hence\ncould result in an even broader optical depth trough.\nAll the line profiles above are computed assuming that the\nminihalo or the dwarf galaxy is isolated. In real cosmic structures,\na halo is surrounded by other halos, and if we integrate the optical\ndepth to a distance larger than the mean separation D of the halos,\nwe will probably hit another halo. So the integration should only\nbe considered as reliable up to a distance of D/2. In practice, a\n108 M⊙ halo, for example, might have many smaller halos closer\nto it than another 108 M⊙ halo. Therefore, it is the mean separation of the smallest halos we are considering, i.e. the halos with\nM = 106 M⊙ (for fX . 0.2), that determines the integration limit.\nWe denote this mean separation as Dmin . The maximum impact parameter of a line of sight should also be αmax = Dmin /2. Integrating the optical depth up to Dmin /2, we plot optical depth profiles\nof a minihalo (blue dashed curve) and a dwarf galaxy (black solid\ncurve) with M = 107 M⊙ at z = 10 in Fig.12. The line of sight\nis assumed to be passing through the minihalo/dwarf galaxy from\nthe center, and we set fX = 0.1. We see that the dwarf galaxy only\nproduces a narrow and weak absorption line at the center, because\nfor this galaxy, only the gas in a sphere between the HII radius\n(∼ 7.3 rvir ) and Dmin /2 (∼ 9.1 rvir ) contributes to the absorption.\nIn reality, however, the optical depth will not drop to zero at the\nboundaries of the absorption line but will connect with another line\ncreated by a neighboring halo. In addition, as we mentioned before, the clustering of dwarf galaxies will extend their HII regions.\nSimilarly, some minihalos will be clustered around the dwarfs, and\nthe surrounding gas in the infall region may be ionized, even if\nthe minihalos themselves can self-shield. Therefore, the clustering\ncan reduce the 21 cm optical depth of some minihalos and dwarf\ngalaxies. Although the problem should ideally include the clustering properties of early galaxies, it is beyond the scope of this paper\nto include such features.\nc 0000 RAS, MNRAS 000, 000–000\n\n\fThe earliest galaxies seen in 21 cm line\n\n0.4\n\n0.4\n\n0.3\n\n0.3\nτ\n\nτ\n\nν\n\n0.5\n\nν\n\n0.5\n\n13\n\n0.2\n\n0.2\n\n0.1\n\n0.1\n\n0\n−100\n\n−50\n\n0\nν−ν10 [kHz]\n\n50\n\n100\n\n0\n−400\n\n−200\n\n0\nν−ν10 [kHz]\n\n200\n\n400\n\nFigure 11. Optical depth profiles of minihalos/dwarf galaxies with different masses: M = 106 M⊙ (solid curves), M = 107 M⊙ (dashed curves), and\nM = 108 M⊙ (dotted curves), respectively. The thick curves are for redshift 20, while the thin curves are for redshift 10. All the curves take fX = 0.1. Left:\nthe case for minihalos in CIE. Right: the case for dwarf galaxies that are photonionized after a star burst with IMF model-A and metallicity Z = 10−7 . The\nimpact parameter shown here is α = 0.\n\n0.15\n\n2000\n\n1500\n\nτν\n\ndN/dz\n\n0.1\n\n1000\n\n0.05\n500\n0\n−80 −60 −40 −20\n0\n20\nν−ν10 [kHz]\n\n40\n\n60\n\n80\n\n0\n8\n\n10\n\n12\n\n14\nz\n\n16\n\n18\n\n20\n\nFigure 12. The optical depth profiles of a minihalo (blue dashed curve)\nand a dwarf galaxy (black solid curve) with M = 107 M⊙ at z = 10. A\nstar burst with IMF model-A and metallicity Z = 10−7 is assumed for\nthis galaxy. The optical depth at each point is integrated up to Dmin /2, the\nimpact parameter is α = 0, and the X-ray parameter is fX = 0.1.\n\nFigure 13. Theoretical evolution of line number density produced by minihalos/dwarf galaxies along a line of sight. The maximum halo mass is\n1010 M⊙ , and the minimum halo masses are 106 M⊙ (solid), 2 × 106 M⊙\n(dashed) and 5 × 106 M⊙ (dotted), respectively.\n\n4 THEORETICAL SPECTRUM\n\nsince our model applies only to the early stages of reionization,\nwhen the stellar sources have not set up an ionizing background.\nThis line number density is also the probability P (z) that a\nline of sight intersects an object in a redshift interval dz centered\non z. In analogy to the method used in Furlanetto & Loeb (2002),\nwe divide the observed frequency band into small bins, each of\nwhich corresponds to a redshift interval ∆z that is small enough to\nmake sure that the probability to have an intersection in each bin\nP (z) ∆z < 0.01. Then we generate a random number Ri (uniformly distributed in [0, 1)) for each bin, and an intersection is said\nto take place if the condition Ri < P (z) ∆z is satisfied.\nWhen an intersection occurs, we randomly choose a mass M\nfor the intersected halo according to the mass function. With the\nhalo mass and the redshift of that bin, we compute its formation\nredshift distribution, and zF is Monte-Carlo sampled from the distribution curve. Then we use the star formation criterion described\nin section 2.2 to determine whether it is a minihalo in collisional\nionization equilibrium or a dwarf galaxy photonionized after a star\n\nIn order to superimpose the 21 cm absorption lines of minihalos and\ndwarf galaxies onto a radio spectrum of GRB afterglow, we first\nhave to compute the line number density per unit redshift. Theoretically, including all (weak and strong) absorption lines, the number\nof halo intersections along a line of sight per redshift interval is\nZ Mmax\ndN\ndr\n= (1 + z)2\nn(M, z) Amax dM,\n(31)\ndz\ndz Mmin\nwhere dr/dz is the comoving radial distance per redshift interval,\nn(M, z) is the halo mass function given by Eq.(1), and Amax =\nπα2max is the cross-section (in physical coordinates) of a halo, in\nwhich the maximum impact parameter αmax is set by half of the\nmean halo separation, i.e. Dmin /2, at each redshift. We plot the\nline number density as a function of redshift in Fig.13 for three\ndifferent values of Mmin , which are appropriate for different levels\nof the X-ray background. The curves are cut off at redshift z = 8\nc 0000 RAS, MNRAS 000, 000–000\n\n\fWν\n\n=\n=\n\nZ\n\nZ\n\nfc e− τIGM (z) − fc e− τ (ν)\nfc e− τIGM (z)\n\n(1 − eτIGM (z) − τ (ν) ) dν,\n\ndν\n(32)\n\nT = e−τ\nT = e−τ\nT = e−τ\nT = e−τ\n\nburst. For every dwarf galaxy, its metallicity is fitted as a function of\nhalo mass to the results given by Salvadori & Ferrara (2009). As the\nfitted metallicity is always & 10−4 , the IMF model-A is used. With\nthe impact parameter randomly selected with an equal probability\nper unit area for each object, we compute the 21 cm line profile for\nevery minihalo and dwarf galaxy intersected by a sightline. From\n129 MHz (z ∼ 10) to 158 MHz (z ∼ 8), we found 3241 lines if we\nset Mmin = 106 M⊙ , out of which 210 lines are attributed to dwarf\ngalaxies. That is about 6.5% of the lines coming from dwarf galaxies, and the rest come from minihalos. The relative transmission\nT = exp(− τ ) for a range of observed frequency corresponding\nto z ∼ 10 is shown in Fig.14. The six panels from top to bottom\nshow the results for fX = 0, 0.05, 0.1, 0.2, 1 and 5, respectively.\nMmin = 106 M⊙ is used for fX 6 0.2, Mmin = 2 × 106 M⊙ is\nused for fX = 1, and we use Mmin = 5 × 106 M⊙ for the case of\nfX = 5. Note that the y-axes are different between panels.\nAs seen from the figure, the absorption lines are very narrow\nand closely spaced, resembling a 21 cm forest. The depth of the\n21 cm absorption strongly depends on the existence and the intensity of the uncertain X-ray background. The absorption strength is\nsignificantly increased if there is no X-ray background, and it decreases rapidly with the increase of the X-ray background, which\nionizes and heats the gas in the IGM reducing the optical depth of\nboth non-linear structures and the global absorption. Especially, if\nthe X-ray background in the early universe was very strong (e.g.\nfX = 5), resulted from a large number of high mass X-ray binaries\nin the case of top-heavy IMF towards high-z or from mini-quasars,\nwe could hardly see any feature on a spectrum. This is because,\non one hand, the line number density is reduced, and on the other\nhand, the absorption by non-linear structures is so weak that most\nlines are covered by the global absorption. For some minihalos,\nthe gas outside rvir contributes to the absorption far from the line\ncenter because of the infall velocity, and a few absorption lines of\nthe neighboring halos overlap with each other on the wings. In this\ncase the actual optical depth of each point is the sum over all the\nabsorptions caused by these overlapping lines.\nWe compared two spectra: one taking into account the local\nX-rays contributing to heating and cascading to Lyα photons, the\nsecond neglecting the above. It turns out that for the IMF model-A\nand the relatively high metallicities that are used in the spectrum,\nthe small amount of soft X-rays produced by the dwarf galaxies\nmake little difference (less than 0.1%) even without an X-ray background. So we could not see any signature that can be attributed to\nthem in the spectrum. However, if a dwarf galaxy with relatively\nhigh mass and (almost) primordial composition does exist, a topheavy IMF (like the IMF model-C) is expected (Schneider et al.\n2002, 2003), and the associated large HII region will result in a\nbroad bump on the spectrum, erasing several absorption lines produced by neighboring minihalos.\nDirectly from the spectrum, we could compute the distribution of equivalent width of the absorption lines for a specific range\nof observed frequency corresponding to a specific redshift. As the\ncontinuum of a background source has a global decrement due to\nthe absorption of the diffuse IGM, the real signal of non-linear\nstructures is the extra absorption with respect to the flux transmitted\nthrough the IGM. Therefore, the equivalent width of an absorption\nline should be defined as\n\nT = e−τ\n\nY. Xu, A. Ferrara, & X. Chen\n\nT = e−τ\n\n14\n\n1\n0.8\n0.6\n0.4\n0.2\n1\n0.9\n0.8\n0.7\n0.6\n1\n0.9\n0.8\n0.7\n0.6\n1\n0.9\n0.8\n0.7\n0.6\n1\n\nfX=0\n\nfX=0.05\n\nfX=0.1\n\nfX=0.2\nνobs [MHz]\n\n0.99\nfX=1.0\n\n1\n\n0.99\n129\n\nνobs [MHz]\nfX=5.0\n129.2\n\n129.4\n129.6\nνobs [MHz]\n\n129.8\n\n130\n\nFigure 14. Relative transmission along a line of sight at redshift z ∼ 10.\nThe six panels from top to bottom show the results for fX = 0, fX = 0.05,\nfX = 0.1, fX = 0.2, fX = 1.0, and fX = 5.0, respectively. Note that the\ny-axes are different between panels.\n\nwhere fc is the continuum flux of the background radio source,\nand τIGM (z) is the optical depth of the diffuse IGM at redshift z.\nUsing the theoretical spectrum of 129 – 133 MHz (corresponds to\nz = 10.01 − 9.68), we compute the cumulative distribution of\nequivalent width of those 21 cm lines around z ∼ 10, which is\nshown in Fig.15. The dot-dashed, short dashed, solid, dotted, and\nlong dashed curves take fX = 0, 0.05, 0.1, 0.2, and 1, respectively.\nAs for the case of fX = 5, the number of lines emerged from\nthe IGM absorption in this frequency range is too small to derive\nany statistical implication, so the distribution of equivalent width\nis not shown for this case. For the fiducial value fX = 0.1, the\nmajority of absorption lines have equivalent widths around 0.03 to\n0.3 kHz. We see that the number of large signals is very sensitive to\nthe presence and intensity of the X-ray background. If there is no\nX-ray background (fX = 0), then about 95% of absorption lines\nhave Wν > 0.1 kHz. For the value fX = 0.05, there are about\n75% of lines with Wν > 0.1 kHz, while for fX = 0.1 and 0.2,\nthis fraction drops to 45% and 15% respectively. If fX = 1 or even\nhigher, there will be no absorption line gets Wν > 0.1 kHz.\n\n5 THE OBSERVABILITY\nThere are two kinds of radio sources which are potentially usable\nfor absorption line studies at high redshifts during the epoch of\nreionization. One is the high redshift quasars, which are quite luminous, but so far no quasar has been confirmed at z > 6.5. The\nother candidate is the radio afterglows of GRBs. Although they are\nfainter than quasars, they are more likely to exist at higher redshifts.\nAlso, they have simpler power-law spectra at low frequencies due\nto synchrotron self-absorption, so it may be easier to extract absorption signals from bright GRB afterglows. Here we examine the\nc 0000 RAS, MNRAS 000, 000–000\n\n\fThe earliest galaxies seen in 21 cm line\n\n15\n\naperture area Aeff , channel width ∆νch , integration time tint , and\nthe signal-to-noise ratio S/N by\n3\n\n10\ndN(>Wν)/dz\n\n∆Fmin =\n\n2\n\n10\n\n1\n\n10\n\n−2\n\n10\n\n−1\n\n10\nWν [kHz]\n\n0\n\n10\n\nFigure 15. Cumulative distribution of equivalent width of the 21 cm absorption lines around z ∼ 10. The dot-dashed, short dashed, solid, dotted,\nand long dashed curves are computed assuming fX = 0, fX = 0.05,\nfX = 0.1, fX = 0.2, and fX = 1.0, respectively.\n\nobservability of 21 cm signals on both spectra of these background\nsources.\nAs for the upcoming and planned low frequency interferometers, a spectral resolution of 1 kHz is achievable for LOFAR3\nand SKA4 . From the theoretical spectrum computed above, we get\nabout one absorption line in every 8.4 kHz at z ∼ 10 on average\nwhen we use Mmin = 106 M⊙ (line overlapping is accounted), and\nthe line density (per observed frequency interval) is lower for lower\nredshifts or higher Mmin . On the other hand, the line width ranges\nmostly from ∼ 1 kHz to ∼ 5 kHz for halos of different masses.\nSo the instruments can marginally resolve these 21 cm lines. While\nresolving the detailed line profile is probably out of reach, the line\ncounting is feasible as long as sufficiently bright radio sources can\nbe found at high redshift.\nTo produce mock spectra matching real observations, we degenerate the theoretical spectrum to a resolution of 1 kHz, add\nGaussian noise onto each pixel with the signal-to-noise ratio\nS/N = 5, and convolve it with a continuum of GRB afterglow\nas well as a radio spectrum of quasar. Two synthetic spectra are\nillustrated in Fig.16 with the left panel for a GRB afterglow and\nthe right panel for a quasar. We take fX = 0.1 for both cases. The\nflux density of GRB afterglow is scaled to 100μJy at 200 MHz and\nz = 6, which is achievable for the afterglow of an energetic GRB\nproduced by explosion of a massive metal-free star at high redshift,\nwith isotropic energy of 1054 erg (Ioka & Mészáros 2005), and the\nspectral index is taken to be 2 (Fν ∝ ν 2 ), which is appropriate\nfor the synchrotron self-absorption spectrum at the frequencies of\ninterest (Frail 2003). The quasar flux density is scaled to 20mJy\nat 120 MHz and z = 10, with a spectral index of −1.05 as fitted to the radio spectrum of the powerful radio galaxy Cygnus A\n(Carilli et al. 2002).\nApart from spectral resolution considerations, we also need\nhigh enough sensitivity to observe the absorption lines. In other\nwords, with the planned instruments, the background source has to\nbe bright enough to get the decrement of flux density higher than\nthe detection limit. The minimum detectable flux density of an interferometer is related to the system temperature Tsys , the effective\n3\n4\n\nhttp://www.lofar.org/index.htm\nhttp://www.skatelescope.org/\n\nc 0000 RAS, MNRAS 000, 000–000\n\n2 kB Tsys\nS\n√\n.\nAeff ∆νch tint N\n\n(33)\n\nThe real signals of minihalos or dwarf galaxies are their additional absorptions with respect to the absorption by the IGM, i.e.\n∆F = Fν exp(−τIGM ) − Fν exp(−τ ). Equating this flux decrement to the detection limit, we get the minimum flux density of the\nbackground source required to observe the absorption lines:\n\u0013\u0012\n\u00131/2\n\u0012\n\u0013\u0012\n1 kHz\nS/N\n0.1\nFmin = 542μJy\n5\n∆νch\ne−τIGM − e−τ\n\u0012\n\u0013\n\u0012\n\u00131/2\n2 −1\n5000 m K\n30 days\n×\n,\n(34)\nAeff /Tsys\ntint\nwhere the ratio Aeff /Tsys is an intrinsic parameter describing the\nsensitivity of an interferometry array, and we use the value for SKA\nhere. For the GRB afterglow, the integration time is limited by its\nfading time scale. Typically, after a bright, short-lived radio \"flare\"\nat early times, the subsequent evolution of the radio afterglow can\nbe described by a slow rise to maximum, followed by several segments of power-law decays with a timescale of ∼ 100 days (Frail\n2003). Here we have assumed a reasonable integration time of 30\ndays, and find that a minimum flux density of ∼ 500 μJy is required to detect the absorption lines with the resolution of 1 kHz\nfor the case of fX = 0.1.\nAs seen from the continua (dashed lines) in Fig.16, the flux\ndensity of our prototype GRB afterglow is more than one order of\nmagnitude lower than this limit. Note that this is already an energetic GRB which is one order of magnitude brighter than normal\nGRBs. It may be possible that there are even brighter GRBs, but\nfor most GRBs it seems that the radio afterglows would be too dim\nfor being used as background source in observations with such a\nhigh spectral resolution. If we by chance find a quasar at very high\nredshift during the early stages of reionization, the signals could be\neasily detected. Especially, if one stacks together several lines to\nget an average profile, it will hopefully reveal the horn-like profiles\nwe found.\nAlternatively, we may try broadband observations with lower\nresolution. In this case, we could use the standard measurement of\nDA , i.e. the mean (relative) flux decrement in each band, in analogy\nto the Lyα forest experiments of quasars (Rauch 1998). We redefine\nthe mean flux decrement with respect to the continuum after the\nabsorption by the IGM:\nfIGM − fobs\ni = h1 − eτIGM −τ i = 1 − eτIGM −τeff ,\nfIGM\n(35)\nwhere the angular brackets represent the average over each band\nand τeff is the effective optical depth of the band. DA measures the\nexcessive absorption by minihalos/dwarf galaxies compared to the\ndiffuse IGM, and the different values of DA measured in different bands represent the absorptions at different redshifts, showing\nthe evolution of non-linear structures during the epoch of reionization. In terms of DA , the flux decrement can be written as\n∆F = Fν exp(−τIGM ) − Fν exp(−τeff ) = Fν DA exp(−τIGM ),\nthen the requirement of the background source is\n\u0012\n\u0013\n\u0013\u0012\n\u0013\u0012\nS/N\n0.99\n0.01\nFmin = 77.4μJy\n5\nDA\ne−τIGM\n\u0012\n\u0013\u0012\n\u00131/2\n\u00131/2 \u0012\n2 −1\n5 MHz\n30 days\n5000 m K\n×\n(36)\n.\n∆νch\nAeff /Tsys\ntint\nDA = h\n\n\f16\n\nY. Xu, A. Ferrara, & X. Chen\n35\n\n20\n\n18\n\n16\n\nν\n\nFν [μJy]\n\nF [mJy]\n\n30\n\n25\n14\n\n20\n129\n\n129.2\n\n129.4 129.6\nνobs [MHz]\n\n129.8\n\n130\n\n12\n129\n\n129.2\n\n129.4 129.6\nνobs [MHz]\n\n129.8\n\n130\n\nFigure 16. Synthetic spectra of 21 cm absorptions against a GRB afterglow (left panel) and a quasar (right panel) with 1 kHz resolution. The corresponding\nredshift is z ∼ 10, and the unabsorbed continua are shown as the dashed (blue) lines. fX = 0.1 is assumed for both spectra.\n\nThe existence of an X-ray background and its intensity are\ncrucial in determining the observability of the signals. If there is\nno X-ray background, then with a GRB at redshift 9.8 and with the\npixel resolution of ∆νch = 1.38 MHz, we can get 19 bands, then\n19 values of DA . We plot the DA as a function of observed frequency in the upper panel of Fig.17, and with the Gaussian noises\nof S/N = 5, the expected spectrum after the absorption by minihalos and dwarf galaxies Fν is shown in the bottom panel of Fig.17.\nThe original continuum Fc and the flux density absorbed by the homogeneous IGM FIGM are also shown for comparison. With SKA,\nwe could hopefully detect the non-zero DA s if fX = 0 or it is\nextremely small, which are signals from both minihalos and dwarf\ngalaxies. In addition, DA decreases statistically with the decreasing redshift, which is a clear signature of the evolution of nonlinear structures during the epoch of reionization. In the case of\nfX = 0.05, we could marginally observe 2 pixels on a spectrum\nfrom 131.5 MHz to 158 MHz, one of which has a band width of\n∼ 8 MHz (131.5 − 139.5 MHz) with the mean flux decrement of\nDA ≈ 0.017, and the other has a band width of ∼ 18.5 MHz\n(139.5 − 158 MHz) with the mean flux decrement of DA ≈ 0.009.\nHowever, if fX takes our fiducial value 0.1, then even one band\nspanning the whole spectrum from the source to the lower redshift\nlimit is still not broad enough to make the observation feasible.\nThe situation gets worse for higher values of fX . Thus, the 21 cm\nbroadband observation against high redshift GRBs can be a power-\n\n0.07\n\nDA\n\n0.06\n\n0.05\n\n0.04\n45\n\nν\n\nF [μJy]\n\nWith the broadband observation, the major concern is that the\navailable length of the line of sight is limited. On one hand, we\nwish to put the background source as far as possible in order to\nget enough bands to see varying DA values at different redshifts.\nOn the other hand, as the source moves farther, it gets dimmer,\nlower the average signal to noise ratio, then an even broader band\nis required to detect the signal, thus beyond a certain distance the\nnumber of useful bands might decrease again. An optimal source\nredshift zGRB can be found to maximize the number of available\nbands. Considering the applicability of our model, we set the lower\nlimit of the redshift to be zlim = 8, and find that the optimal redshift for the GRB is zGRB ∼ 9.8. This redshift depends mainly on\nthe lower limit of the redshift we set, but of course it is also dependent somewhat on the reionization history, e.g. DA which evolves\nslowly with redshift. This does not depend on the observational parameters. The optimal redshift is quite encouraging given that we\nhave already seen 2 GRBs beyond z = 6.\n\n40\n35\n30\n25\n\n135\n\n140\n\nν\n\nobs\n\n145\n150\n[MHz]\n\n155\n\nFigure 17. The mean flux decrement with respect to the continuum absorbed by the diffuse IGM (upper panel) and the synthetic broad band spectrum with 1.38 MHz resolution (bottom panel) in the case of fX = 0. The\n19 pixels show the frequency range corresponding to the redshift range from\n9.8 to 8. In the bottom panel, the dashed, dot-dashed, and solid lines are the\noriginal continuum flux density, the flux density absorbed by the homogeneous IGM, and the expected flux density after the absorption by minihalos\nand dwarf galaxies, respectively.\n\nful probe of the presence and the intensity of the early X-ray background and the thermal evolution during the epoch of reionization.\n\n6 DISCUSSION\nWe have modeled in detail the gas density and velocity profiles,\nionization state, temperature profiles, and Lyα photon production\nfor both minihalos and dwarf galaxies during the early stages of\nc 0000 RAS, MNRAS 000, 000–000\n\n\fThe earliest galaxies seen in 21 cm line\nreionization when the IGM was still patchy. We also take into account an early X-ray background, which could partially ionize and\nheat the IGM, and suppress the formation of low mass minihalos.\nUsing the detailed model, we investigate the spin temperature of\nneutral hydrogen at different radii and the optical depth profiles of\n21 cm absorption lines, for various impact parameters, halo masses,\nand redshifts.\nWe find that the Lyα background and the Lyα photons from\nrecombinations in the slightly ionized IGM couple the spin temperature to the kinetic temperature outside minihalos or HII regions of\ndwarf galaxies, and the coupling is already strong at redshift 10.\nThe Lyα background photons are blocked at surfaces of halos, and\nthe Lyα photons from recombinations are negligible inside lowmass halos, though it dominates over the collisional coupling in\nhigh-mass halos in which the gas is partially ionized by collisions.\nThe collisions also couple the spin temperature to the gas kinetic\ntemperature effectively at the center, but this coupling decreases\nand the spin temperature decreases with increasing radius.\nThe infalling velocity of gas around the minihalos/dwarf\ngalaxies plays a very important role in determining the profiles of\nthe 21 cm lines, double-peaked horn-like profiles are produced for\na vast range of parameters. The line profile of a dwarf galaxy also\ndepends on the size of its HII region, and hence its radiative properties. The horn-like profile disappears for galaxies which are large,\nor with top-heavy IMF so that the HII region expands beyond the\nturning point of gas velocity. The optical depth of a dwarf galaxy\nis lower for lines of sight penetrating through its HII region, while\na sufficiently large HII region will lead to an optical depth trough\nrather than an absorption line.\nWith the line number density based on halo mass function\nand a physically motivated criterion for star formation, we generate synthetic spectra of 21 cm forest by Monte Carlo procedure,\nand calculate the cumulative distribution of equivalent width of the\nabsorption lines. Most of these lines have equivalent widths around\n0.03 ∼ 0.3 kHz for an X-ray background intensity parameter of\nfX = 0.1, and the number of strong signals with large equivalent\nwidths decreases significantly with increasing fX . We then study\nthe observability of these signals. For high resolution (1 KHz) observations, the GRB radio afterglows are too dim to be used as the\nbackground, but absorption lines should be easily detected for a\nhigh redshift quasar. It is exciting to know that the Pan-STARRS5\n(the Panoramic Survey Telescope And Rapid Response System) is\nbeing developed which will be able to detect quasars up to redshift\n∼ 7 and aims to find ∼ 20 − 50 quasars at z ∼ 7. For broadband\nobservations, it is also possible to detect the absorptions against\nGRB radio afterglows if there is no X-ray background. Setting a\nlower redshift cut-off at zlim = 8, we find that the optimal redshift\nfor the GRB is zGRB ∼ 9.8. With a sensitivity of SKA, a signalto-noise ratio of 5, and a reasonable integration time, we could get\nmeasurements of mean flux decrement DA for 19 bands along the\nline of sight, each with a channel width of 1.38 MHz. In this way\nwe could detect not only the signals from both minihalos and dwarf\ngalaxies, but also their evolution during the epoch of reionization.\nHowever, the detectability of 21 cm signals is very sensitive to the\npresence of an early X-ray background. If an early X-ray background existed but was not strong, taking fX = 0.05, we could\nmarginally observe 2 pixels along the line of sight towards a GRB\nwhich is located at the optimal redshift of 9.8. Nonetheless, for the\nvalue of fX = 0.1 or higher, the signal will be impossible to be de-\n\n5\n\nhttp://pan-starrs.ifa.hawaii.edu/public/home.html\n\nc 0000 RAS, MNRAS 000, 000–000\n\n17\n\ntected. Therefore, the 21 cm absorption could be a powerful probe\nof the presence/intensity of the X-ray background and the thermal\nhistory in the early universe. However, we note that it is difficult to\nfind a radio source before the IGM has been significantly ionized\nor heated, especially for a very bright high redshift quasar.\nFurlanetto & Loeb (2002) studied the 21 cm forest signals of\nminihalos and early galaxies. Here, we have re-investigated this\nproblem with different and more detailed modeling of various properties of these nonlinear objects, an early X-ray background, as\nwell as the Lyα background during the epoch of reionization. We\nfound stronger absorption signals from both minihalos and dwarf\ngalaxies for an early X-ray background not higher than the level\ntoday. Given the many different model parameters adopted, this is\nnot unexpected. There are many differences in the details of modeling between the two papers, but the main difference seems to\nbe the IGM temperature. Furlanetto & Loeb (2002) have assumed\na heated IGM with a simple form of its evolution with redshift,\nwhich is already heated up to 1000 K at z = 10. This lies between our cases of fX = 1 and fX = 5. But in our fiducial\nmodel, the gas temperature in the IGM is about 35 K at the same\nredshift for fX = 0.1. This is appropriate for the early stages of\nstellar reionization, when the percolation has not occurred yet. In\nFurlanetto & Loeb (2002), the gas structure in the infalling region\naround minihalos/dwarf galaxies is modeled with a self-similar solution of secondary infall found by Bertschinger (1985), while we\nhave used the gas infall model developed by Barkana (2004) which\nis based on the extended Press-Schechter model and spherical collapse. The Bertschinger's solution has a power law density profile\nof ρ ∝ r −2.25 , which is much steeper than the Barkana's prediction. Our density and peculiar velocity structure of the infalling\ngas, with the lower spin temperature outside the minihalos/HII regions, produce a higher optical depth and a horn-like profile, which\nwas not found in Furlanetto & Loeb (2002). For the dwarf galaxies,\nFurlanetto & Loeb (2002) considered protogalactic disks, whereas\nwe assume here a spherical symmetry in the gas density distribution since the earliest galaxies are not likely to have large angular\nmomentum.\nIn addition to the early X-ray background, an obvious uncertainty in our model is the production of soft X-rays by dwarf galaxies in the early universe. Especially with the normal IMF model-A\nand relatively high metallicity, the amount of soft X-rays emitted\nafter a star burst is very uncertain (Schaerer 2003). However, this\namount of soft X-rays produced by stellar sources is always negligible as compared to the background X-rays even if fX = 0.05.\nAnother uncertainty comes from the gas density in minihalos and\ndwarf galaxies. We have neglected the possible change of density\nprofile after the star formation. The gas density profile could be\nmodified by the expansion of the HII region when the ionizing front\nchanges nature from R-type to D-type. There are also uncertainties in the star formation history in the dwarf galaxy. We have assumed that the feedback effects quench subsequent star formation\n(c.f. Omukai & Nishi 1999), so that a single star burst is produced.\nWe have also assumed a smooth gas density distribution, neglecting cool dense gas clumps from which the first stars are likely to\nform. Thus we may have overestimated RHII , and the optical depth\ncould be slightly higher if they are accounted for. However, the gas\nfraction in minihalos or dwarf galaxies could also be lower than the\ncosmic mean value (Naoz et al. 2009), then the optical depth will\nbe lower. Also, the results depend on the assumption of fesc , which\nis taken to be 0.07, in agreement with current observations.\nAs illustrated in Fig.9 and Fig.11, minihalos and dwarf galaxies exhibit distinct optical depth profiles mainly due to the different\n\n\f18\n\nY. Xu, A. Ferrara, & X. Chen\n\nionization state and coupling physics, so they are potentially distinguishable. Although we may not be able to resolve the line profiles with the upcoming and planned instruments, it is encouraging\nto be able to distinguish their features in a statistical way, given\nthat dwarf galaxies span a different halo population from minihalos which cannot host stars. We reserve this investigation to future\nworks.\n\n7 ACKNOWLEDGMENTS\nWe deeply appreciate the insight of the referee and the constructive\ncomments. We thank P. Dayal, S. Salvadori, W. Xu and B. Yue for\nhelpful discussions; we are grateful to R. Barkana who provided\nhis infall code. This work was supported in part by a scholarship\nfrom China Scholarship council, by a research training fellowship\nfrom SISSA astrophysics sector, by the NSFC grants 10373001,\n10525314, 10533010, and 10773001, by the CAS grant KJCX3SYW-N2, and by the 973 program No. 2007CB8125401.\n\nREFERENCES\nAbel T., Bryan G. L., Norman M. L., 2002, Sci, 295, 93\nBarkana R., 2004, MNRAS, 347, 59\nBertschinger E., 1985, ApJS, 58, 39\nBond J. R., Cole S., Efstathiou G., Kaiser N., 1991, ApJ, 379, 440\nBromm V., Coppi P. S., Larson R. B., 2002, ApJ, 564, 23\nBromm V., Larson R. B., 2004, ARA&A, 42, 79\nBryan G. L., Norman M., 1998, ApJ, 495, 80\nCarilli C. L., Gnedin N. Y., Owen F., 2002, ApJ, 577, 22\nCen R., 1992, ApJS, 78, 341\nChen X., Miralda-Escudé J., 2004, ApJ, 602, 1\nChen X., Miralda-Escudé J., 2008, ApJ, 684, 18\nChiueh T., Lee J., 2001, ApJ, 555, 83\nChoudhury T. R., Ferrara A., 2007, MNRAS, 380, L6\nCiardi B., Ferrara A., 2005, Space Science Reviews, 116, 625\nCooray A., Sheth R., 2002, Physics Reports, 372, 1\nFan X., Carilli C. L., Keating B., 2006, ARA&A, 44, 415\nField G. B., 1958, Proc. I.R.E., 46, 240\nField G. B., 1959, ApJ, 129, 525\nFrail D. A., 2003, astro-ph/0309557\nFurlanetto S. R., 2006, MNRAS, 371, 867\nFurlanetto S. R., Loeb A., 2002, ApJ, 579, 1\nFurlanetto S. R., Oh S. P., Briggs F. H., 2006, PhR, 433, 181\nFurlanetto S. R., Zaldarriaga M., Hernquist L., 2004, ApJ, 613, 1\nGallerani S., Ferrara A., Fan X., Choudhury T. R., 2008, MNRAS,\n386, 359\nGao L., White S. D. M., Jenkins A., Frenk C. S., Springel V., 2005,\nMNRAS, 363, 379\nGilfanov M., Grimm H.-J., Sunyaev R., 2004, MNRAS, 347, L57\nGnedin N. Y., 2000, ApJ, 542, 535\nGunn J. E., Peterson B. A., 1965, ApJ, 142, 1633\nHui L., Gnedin N. Y., 1997, MNRAS, 292, 27\nIoka K., Mészáros P., 2005, ApJ, 619, 684\nKomatsu E. et al., 2009, ApJS, 180, 330\nLacey C., Cole S., 1993, MNRAS, 262, 627\nLarson D. et al., 2010, arXiv:1001.4635\nLin W. P., Jing Y. P., Lin L., 2003, MNRAS, 344, 1327\nMadau P., Meiksin A., Rees M. J., 1997, ApJ, 475, 429\nMakino N., Sasaki S., Sudo Y., 1998, ApJ, 497, 555\n\nMcGreer I. D., Becker R. H., Helfand D. J., White R. L., 2006,\nApJ, 652, 157\nMcKee C. F., Tan J. C., 2008, ApJ, 681, 771\nMeiksin A. A., 2007, arXiv: 0711.3358\nMo H. J., White S. D. M., 2002, MNRAS, 336, 112\nNaoz S., Barkana R., Mesinger A., 2009, arXiv:0906.0349\nNaoz S., Bromberg O., 2007, MNRAS, 380, 757\nNavarro J. F., Frenk C. S., White S. D. M., 1997, ApJ, 490, 493\nOh S. P., Haiman Z., 2003, MNRAS, 346, 456\nOkamoto T., Gao L., Theuns T., 2008, MNRAS, 390, 920\nOmukai K., Nishi R., 1999, ApJ, 518, 64\nOsterbrock D. E., 1989, Astrophysics of Gaseous Nebulae and\nActive Galactic Nuclei, University Science books Sausalito, CA.\nPihlström et al., 2007, ApJ, 664, 411\nRauch M., 1998, ARA&A, 36, 267\nSalvadori S., Ferrara A., 2009, MNRAS, 395, L6\nSalvaterra R. et al., 2009, arXiv:0906.1578\nSchaerer D., 2002, A&A, 382, 28\nSchaerer D., 2003, A&A, 397, 527\nSchneider R., Ferrara A., Natarajan P., Omukai K., 2002, ApJ,\n571, 30\nSchneider R., Ferrara A., Salvaterra R., Omukai K., Bromm V.,\n2003, Nature, 422, 869\nShapiro P. R., Ahn K., Alvarez M. A., Iliev I. T., Martel H., Ryu\nD., 2006, ApJ, 646, 681\nSheth R. K., Mo H. J., Tormen G., 2001, MNRAS, 323, 1\nSheth R. K., Tormen G., 1999, MNRAS, 308, 119\nSheth R. K., Tormen G., 2002, MNRAS, 329, 61\nSpergel D. N. et al., 2007, ApJS, 170, 377\nTanvir N. R. et al., 2009, arXiv:0906.1577\nTegmark M., Silk J., Rees M. J., Blanchard A., Abel T., Palla F.,\n1997, ApJ, 474,1\nTozzi P., Madau P., Meiksin A., Rees M. J., 2000, ApJ, 528, 597\nTrac H., Cen R., Loeb A., 2008, ApJ, 689, L81\nValdés M., Ferrara A., 2008, MNRAS, 387, L8\nWillott C. J. et al., 2007, AJ, 134, 2435\nWouthuysen S. A., 1952, AJ, 57, 31\nXu Y., Chen X., Fan Z., Trac H., Cen R., 2009, ApJ, 704, 1396.\n\nc 0000 RAS, MNRAS 000, 000–000\n\n\f"}