{"id": "http://arxiv.org/abs/0903.3358v3", "guidislink": true, "updated": "2010-02-01T23:37:18Z", "updated_parsed": [2010, 2, 1, 23, 37, 18, 0, 32, 0], "published": "2009-03-19T16:26:23Z", "published_parsed": [2009, 3, 19, 16, 26, 23, 3, 78, 0], "title": "Pure quantum states of a neutrino with rotating spin in dense magnetized\n  matter", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0903.1917%2C0903.2010%2C0903.4895%2C0903.2097%2C0903.3462%2C0903.3162%2C0903.1396%2C0903.2209%2C0903.4698%2C0903.1653%2C0903.3153%2C0903.0365%2C0903.4671%2C0903.1686%2C0903.5403%2C0903.2895%2C0903.5109%2C0903.0042%2C0903.2746%2C0903.2107%2C0903.5449%2C0903.0207%2C0903.0364%2C0903.2038%2C0903.0491%2C0903.1278%2C0903.3224%2C0903.0372%2C0903.5447%2C0903.4398%2C0903.4027%2C0903.3655%2C0903.3498%2C0903.3322%2C0903.4399%2C0903.2273%2C0903.5334%2C0903.0834%2C0903.2858%2C0903.2366%2C0903.5310%2C0903.2861%2C0903.1165%2C0903.0333%2C0903.1634%2C0903.1052%2C0903.5450%2C0903.2386%2C0903.1593%2C0903.1868%2C0903.0075%2C0903.1545%2C0903.5512%2C0903.5463%2C0903.0482%2C0903.0525%2C0903.0001%2C0903.4114%2C0903.5316%2C0903.0539%2C0903.5067%2C0903.4760%2C0903.4195%2C0903.4334%2C0903.4186%2C0903.0261%2C0903.2208%2C0903.2852%2C0903.1654%2C0903.3358%2C0903.2294%2C0903.2457%2C0903.3136%2C0903.4945%2C0903.3155%2C0903.2589%2C0903.4752%2C0903.1716%2C0903.0607%2C0903.3750%2C0903.2678%2C0903.2862%2C0903.0903%2C0903.4505%2C0903.4605%2C0903.4820%2C0903.1779%2C0903.3266%2C0903.1053%2C0903.2851%2C0903.4067%2C0903.1050%2C0903.5496%2C0903.3242%2C0903.1001%2C0903.3895%2C0903.3330%2C0903.2573%2C0903.1763%2C0903.0255%2C0903.4289&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Pure quantum states of a neutrino with rotating spin in dense magnetized\n  matter"}, "summary": "The problem of neutrino spin rotation in dense matter and in strong\nelectromagnetic fields is solved in accordance with the basic principles of\nquantum mechanics. We obtain a complete system of wave functions for a massive\nDirac neutrino with an anomalous magnetic moment which are the eigenfunctions\nof the kinetic momentum operator and have the form of nonspreading wave\npackets. These wave functions enable one to consider the states of neutrino\nwith rotating spin as pure quantum states and can be used for calculating\nprobabilities of various processes with the neutrino in the framework of the\nFurry picture.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0903.1917%2C0903.2010%2C0903.4895%2C0903.2097%2C0903.3462%2C0903.3162%2C0903.1396%2C0903.2209%2C0903.4698%2C0903.1653%2C0903.3153%2C0903.0365%2C0903.4671%2C0903.1686%2C0903.5403%2C0903.2895%2C0903.5109%2C0903.0042%2C0903.2746%2C0903.2107%2C0903.5449%2C0903.0207%2C0903.0364%2C0903.2038%2C0903.0491%2C0903.1278%2C0903.3224%2C0903.0372%2C0903.5447%2C0903.4398%2C0903.4027%2C0903.3655%2C0903.3498%2C0903.3322%2C0903.4399%2C0903.2273%2C0903.5334%2C0903.0834%2C0903.2858%2C0903.2366%2C0903.5310%2C0903.2861%2C0903.1165%2C0903.0333%2C0903.1634%2C0903.1052%2C0903.5450%2C0903.2386%2C0903.1593%2C0903.1868%2C0903.0075%2C0903.1545%2C0903.5512%2C0903.5463%2C0903.0482%2C0903.0525%2C0903.0001%2C0903.4114%2C0903.5316%2C0903.0539%2C0903.5067%2C0903.4760%2C0903.4195%2C0903.4334%2C0903.4186%2C0903.0261%2C0903.2208%2C0903.2852%2C0903.1654%2C0903.3358%2C0903.2294%2C0903.2457%2C0903.3136%2C0903.4945%2C0903.3155%2C0903.2589%2C0903.4752%2C0903.1716%2C0903.0607%2C0903.3750%2C0903.2678%2C0903.2862%2C0903.0903%2C0903.4505%2C0903.4605%2C0903.4820%2C0903.1779%2C0903.3266%2C0903.1053%2C0903.2851%2C0903.4067%2C0903.1050%2C0903.5496%2C0903.3242%2C0903.1001%2C0903.3895%2C0903.3330%2C0903.2573%2C0903.1763%2C0903.0255%2C0903.4289&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "The problem of neutrino spin rotation in dense matter and in strong\nelectromagnetic fields is solved in accordance with the basic principles of\nquantum mechanics. We obtain a complete system of wave functions for a massive\nDirac neutrino with an anomalous magnetic moment which are the eigenfunctions\nof the kinetic momentum operator and have the form of nonspreading wave\npackets. These wave functions enable one to consider the states of neutrino\nwith rotating spin as pure quantum states and can be used for calculating\nprobabilities of various processes with the neutrino in the framework of the\nFurry picture."}, "authors": ["E. V. Arbuzova", "A. E. Lobanov", "E. M. Murchikova"], "author_detail": {"name": "E. M. Murchikova"}, "author": "E. M. Murchikova", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1103/PhysRevD.81.045001", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/0903.3358v3", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0903.3358v3", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "21 pages, Latex. Final version", "arxiv_primary_category": {"term": "hep-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "hep-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "hep-th", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0903.3358v3", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0903.3358v3", "journal_reference": "Phys.Rev.D81:045001,2010", "doi": "10.1103/PhysRevD.81.045001", "fulltext": "Pure quantum states of a neutrino with rotating spin in dense magnetized matter\nE. V. Arbuzova∗\nInternational University \"Dubna\", 141980 Dubna, Russia\n\nA. E. Lobanov†\nDepartment of Theoretical Physics, Moscow State University, 119991 Moscow, Russia\n\nE. M. Murchikova‡\n\narXiv:0903.3358v3 [hep-ph] 1 Feb 2010\n\nSkobeltsyn Institute of Nuclear Physics, Moscow State University, 119991 Moscow, Russia\nThe problem of neutrino spin rotation in dense matter and in strong electromagnetic fields is\nsolved in accordance with the basic principles of quantum mechanics. We obtain a complete system\nof wave functions for a massive Dirac neutrino with an anomalous magnetic moment which are\nthe eigenfunctions of the kinetic momentum operator and have the form of nonspreading wave\npackets. These wave functions enable one to consider the states of neutrino with rotating spin as\npure quantum states and can be used for calculating probabilities of various processes with the\nneutrino in the framework of the Furry picture.\n\nINTRODUCTION\n\nNeutrino physics is one of the most rapidly developing areas of high-energy physics. The fundamental experimental\nresult was obtained in this field in recent years - neutrino oscillations were discovered [1]. From the theory of this\nphenomenon (see, for example, [2]), which is based on the ideas of Pontecorvo [3] and Maki, Nakagawa and Sakata [4],\nit follows that oscillations are possible only when the neutrino mass is nonzero. As a consequence of this circumstance,\nthe possibility exists of neutrino spin rotation, i.e. of transitions between the active left-handed neutrino polarization\nstate and the sterile right-handed state. As it is understood today, in contrast to flavor oscillations, this process can\nnever be observed if the particle moves in vacuum. For the effect of spin rotation to exist some external influence leading\nto effective breaking of the Lorentz-symmetry of the theory is needed. For instance, dense matter or electromagnetic\nfields can serve as the physical reason for this phenomenon. In the latter case, nontrivial electromagnetic properties\nof the neutrino, in particular, the anomalous magnetic moment of a Dirac neutrino [5], can lead to rotation of its spin.\nThe conventional approach [6], [7] to the theory of neutrino spin rotation, based on solving the Cauchy problem\nfor the Schrödinger-type equation with an effective Hamiltonian, was developed for the description of ultrarelativistic\nneutrinos (the particles that are observed in experiments now available). This approach is in fact quasiclassical and\nis equivalent to solving the Bargmann–Michel–Telegdi (BMT) equation [8] in the spinor representation (see [9]).\nThe aim of this work is to develop a consistent quantum theory of neutrino spin rotation to describe neutrinos\nwith nonzero mass, including the low-energy region that may play a significant role in astrophysics [10]. Following\npapers [6], [7], we use the method of effective potential [11] that allows us to take into account collective influence of\nbackground particles on the propagation of neutrino.\nTo this end, we find a complete system of solutions of the Dirac-type equation that describe the action of both\nelectromagnetic field and dense matter on neutrino dynamics. These solutions have the form of nonspreading wave\npackets. They enable one to consider the states of neutrino with rotating spin as pure quantum states and to evaluate\nprobabilities of various processes with participation of a neutrino in the framework of the Furry picture [12].\nThe paper is organized as follows. In the first Section we present the model we are working with and briefly describe\nhow the effective potentials are constructed. In Section II we summarize the main ideas of the method used for solving\nthe Dirac equation. In Section III we introduce a kinetic momentum operator and justify the advantages of using its\neigenvalues as quantum numbers, instead of the eigenvalues of the canonical momentum operator. Then we find both\nstationary and nonstationary wave functions. Here we also derive the dispersion law and calculate the group velocity\nfor a neutrino in the dense magnetized matter. We demonstrate that the group velocity of a neutrino is independent\nof its spin orientation. In Section IV we find the explicit expressions for the kinetic momentum and spin projection\n\n∗ Electronic\n\naddress: arbuzova@uni-dubna.ru\naddress: lobanov@phys.msu.ru\n‡ Electronic address: murchikova@gmail.com\n† Electronic\n\n\f2\noperators. In Section V we use the obtained results for quasiclassical interpretation of neutrino spin behavior in dense\nmagnetized matter. In the conclusive Section VI we compare our results with those obtained by other authors.\nThe units ~ = c = 1 are used throughout the paper; metric tensor, g μν = diag(1, −1, −1, −1); totally antisymmetric\nLevi-Cività tensor, eμνρλ = +1 if {μνρλ} is an even permutation of {0, 1, 2, 3}, eμνρλ = −1 if it is an odd permutation,\neμνρλ = 0 otherwise.\nI.\n\nWAVE EQUATION FOR NEUTRINO IN DENSE MATTER AND IN ELECTROMAGNETIC FIELD\n\nLet us first discuss the model we use for the description of the neutrino behavior in the matter and in the electromagnetic field. At present, there are no experimental data that might help to make the choice between the Dirac or\nthe Majorana nature of a neutrino [13]. Therefore, in this paper we discuss spin rotation of a massive Dirac neutrino\nwith anomalous magnetic moment propagating through dense magnetized matter.\nAs a first approximation, we can consider spin rotation independently of variations of the particle flavor, i.e. we can\ndeal with the mass eigenstates of neutrino. It is quite obvious, due to the fact that the physical origins of neutrino\nflavor oscillations and its spin rotation are different. The Dirac–Pauli equation [14] serves as the basis of this approach\nin electromagnetic fields. Just in this way, the behavior of the neutrino spin in a constant homogeneous magnetic field\nwas investigated in [15]. In order to consider the influence of matter on neutrino dynamics through weak interaction,\nthe Dirac–Pauli equation should be modified.\nAs it was proposed in [11], [16], if matter density is high enough for considering weak interaction of neutrino\nwith the background fermions as coherent, it is possible to describe neutrino interaction with matter by an effective\npotential. To get covariant realization of this idea, it is necessary to take into account that the term that describes\ndirect interaction of neutrino with matter must depend on the currents\njfμ = {nf u0f , nf uf },\n\n(1.1)\n\nand on the polarizations\nλμf =\n\n\u001a\n\nnf (ζ f * uf ), nf\n\n\u0012\n\u0013\u001b\nuf (ζ f * uf )\nζf +\n1 + u0\n\n(1.2)\n\nof the background fermions f [17–19]. It is significant that only jfμ and λμf characterize matter integrally. In formulas\n(1.1) and (1.2), nf and ζ f (0 6 |ζ f |2 6 1) are the number density and the mean value of the polarization vector of\nthe background fermions f in the center-of-mass system of matter (uμf = {u0f , uf } denotes the four-velocity of the\nreference frame), where the mean momentum of the fermions f is equal to zero.\nIn the framework of the standard model (for a more general case, see Appendix A), the interaction term can be\nderived directly from the model Lagrangian. To this end, it is necessary to write this Lagrangian in the low-energy\neffective form using the four-fermion interaction and replace the vector ψ̄f (x)γ μ ψf (x) and axial vector ψ̄f (x)γ 5 γ μ ψf (x)\ncurrents of the background fermions by jfμ and λμf respectively. The explicit form of jfμ and λμf is obtained as a\nresult of averaging of currents over the fermion statistical distribution function and depends on the type of the matter\nconsidered. In particular, the expression for the polarization λμe of electron gas in a magnetic field at finite temperature\ncan be found in [7]. Note that, since the origin of the effective potential is forward elastic scattering of neutrino, it\ncan also be calculated using field-theoretic methods [20].\nAs a result we come to the equation\n\u0012\n\u0013\n1\ni\niγ μ ∂μ − γ μ fμ (1 + γ 5 ) − μ0 F μν σμν − m Ψ (x) = 0,\n(1.3)\n2\n2\nwhere F μν is the electromagnetic field tensor. The γ-matrices satisfy γ μ γ ν + γ ν γ μ = 2g μν with γ 0 Hermitian, γ antiHermitian, and are related to the β and α matrices through γ 0 = β, γ = βα; σ μν = 12 (γ μ γ ν −γ ν γ μ ), γ 5 = −iγ 0 γ 1 γ 2 γ 3 .\nThe effective four-potential f μ is a linear combination of currents and polarizations of the background fermions\nX (1) μ\n\u0001\n(2)\nfμ =\nρf jf + ρf λμf .\n(1.4)\nf\n\n(1,2)\n\nSummation in (1.4) is carried out over all fermions f of matter. The expressions for the coefficients ρf\ndetermined as\no\no\nn\nn\n√\n√\n(2)\n(f )\n(f )\n(1)\n.\nρf = 2GF Ieν + T3 − 2Q(f ) sin2 θW , ρf = − 2GF Ieν + T3\n\nare\n\n(1.5)\n\n\f3\n(f )\n\nHere Q(f ) is the electric charge of the fermion f ; T3 is the third component of the weak isospin; GF and θW are\nthe Fermi constant and the Weinberg angle respectively; Ieν = 1 for the electron neutrino interaction with electrons,\nIeν = −1 for interaction with positrons, otherwise Ieν = 0.\nWhile equation (1.3) describes mass states of neutrino, potential (1.4) is flavor dependent, and in the general\ncase, this leads to correlations between spin rotation and flavor oscillations. In order to construct a mathematically\nconsistent approach to a description of neutrino spin rotation, we have to avoid the correlations. This is possible if we\nassume that the effective potential which describes the influence of dense matter on neutrino is the same for different\nflavors. In this case we can construct flavor states of the neutrino as the linear combination of its mass states with\ncoefficients that are elements of the mixing matrix of the neutrino in vacuum.\nThe physical justification of this model can be made in the following way. In order to consider effective potentials\nas flavor independent, it is necessary to assume that the fraction of electrons in the matter is small, i.e. the electron\nnumber density ne is approximately equal to zero. Calculations which are in a satisfactory agreement with the\nexperimental data show that in the center of a neutron star the fraction of electrons does not exceed a few per cent\n[21]. Therefore the model approximation ne = 0 is quite appropriate.\nWe restrict ourselves to considering equation (1.3) in the case of a constant homogeneous electromagnetic field and\nconstant currents and polarizations of matter,\nF μν = const,\n\njfμ = const,\n\nλμf = const,\n\n(1.6)\n\nas the first order approximation of the realistic background. Because of (1.6) additional conditions for F μν and\nf μ may be obtained. The strengths of the electric and magnetic fields and average currents and polarizations of the\nbackground particles should obey the self-consistent system of equations including the Maxwell equations, the Lorentz\nequation\nj̇fμ =\n\nef μ ν\nF j ,\nmf ν f\n\nand the the BMT quasiclassical spin evolution equation\n\u0014\n\u0015\n\u0010\n\u0011\nef μ\nν\nλ̇μf =\nF ν + 2μf g μα − uμf uα\nF\nαν λf .\nf\nmf\n\n(1.7)\n\n(1.8)\n\nHere the dot denotes differentiation with respect to the proper times τf of particles. From equations (1.7) and (1.8)\nwe find that for charged particles the conditions j̇fμ = 0, λ̇μf = 0 are equivalent to F μν jfν = 0, F μν λνf = 0. However,\nit seems reasonable to assume that in dense matter velocities of the center-of-mass systems for all components are\nequal, thus for the neutral particles similar conditions should hold as well. In this way we obtain the restriction\nF μν fν = 0.\n\n(1.9)\n\nIt should be emphasized that condition (1.9) is the result of the fact that average currents and polarizations of particles\nof matter in an external field should satisfy the classical equations of motion. The physical meaning of this condition\nis discussed in more detail in Section V.\nNote that equation (1.3) with constant coefficients appears in the standard model extension [22], [23] as well. In\nthis case, F μν and f μ describe vacuum condensates that break the Lorentz-symmetry of the theory.\nII.\n\nFORMULATION OF THE PROBLEM\n\nThe Dirac equation, in particular equation (1.3), is a partial differential equation. Therefore, as it is known, its\ngeneral solution is defined up to an arbitrary function. However, in quantum-mechanical applications we deal with\nthe so-called complete integral which depends on a set of constants, i.e. quantum numbers. Those are the eigenvalues\nof some self-adjoint operators. For the classification of particle states it is necessary to introduce the complete set\nof the operators - integrals of motion. Note that in nonrelativistic quantum mechanics any self-adjoint operator\nmay serve as an operator of observable, which is not the case in the relativistic mechanics, where only integrals of\nmotion, commuting with the operator of the equation, can be treated as operators of observables [24]. The choice of\nthe complete set of them is different in each particular case and should be adequate to the problem being solved.\nIn the case of the problem of spin evolution, operators of kinetic momentum components should be included in the\ncomplete set. It becomes obvious if we start with the following argument. The direction of particle polarization is well\ndefined in its rest frame, and then one finds the polarization in the laboratory frame upon carrying out an appropriate\n\n\f4\nLorentz transformation. This transformation is defined by the group velocity of the particle, in other words, by its\nkinetic momentum. This implies that it is not the canonical momentum but the kinetic momentum operator that\ndefines the direction of particle propagation.\nNow, there is only one problem that remains to be solved. The form of the kinetic momentum operator for a\nparticle with spin propagating under the influence of external fields is not known beforehand. So we have to find a\nself-adjoint operator pμ with the eigenvalues q μ , which satisfies the condition q 2 = m2 and may be interpreted as the\ncomponents of the particle kinetic momentum.\nLet us discuss this issue in more detail. In the mathematical apparatus of quantum field theory, a particle is usually\nidentified with an irreducible unitary representation of the Poincaré group [25]. The irreducible representations are\ncharacterized by two invariants of the group\nP 2 ≡ P μ Pμ = m2 ,\n\n(2.1)\n\nW 2 ≡ W μ Wμ = −m2 s(s + 1).\n\n(2.2)\n\nThe translation generators P μ are identified with the components of the particle momentum, and the Pauli–Lubanski–\nBargmann vector\nWμ = −\n\n1 μνρλ\ne\nMνρ Pλ ,\n2\n\n(2.3)\n\nwhere M μν are the Lorentz generators, characterizes the particle spin. The invariant m2 is the particle mass squared\nand s is the value of its spin.\nA space of unitary representation is defined by the condition called \"the wave equation for a particle with mass m\nand spin s.\" The wave equation for particles with spin s = 1/2 is the Dirac equation\n(iγ μ ∂μ − m) Ψ0 (x) = 0.\n\n(2.4)\n\nIn this case the realization of generators of the Poincaré group and the Pauli–Lubanski–Bargmann vector in the\ncoordinate representation is\npμ = i∂ μ ,\n\ni\nmμν = i(xμ ∂ ν − xν ∂ μ ) + σ μν ,\n2\n\nwμ =\n\ni 5 μν\nγ σ ∂ν .\n4\n\n(2.5)\n\nThese operators commute with the operator of the Dirac equation and can be identified with observables. They\nhave a self-adjoint extension on the subsets of solutions of equation (2.4) with a fixed sign of the energy with regard\nto the standard scalar product,\nZ\n(Φ, Ψ ) = dx Φ† (x, t) Ψ (x, t).\n(2.6)\nThree-dimensional spin projection operator s(p) is a set of coefficients si (p) of the expansion of the vector wμ in\nspacelike unit vectors Siμ (p) (i = 1, 2, 3):\nsi (p) = −\n\n1\nwμ Siμ (p),\nm\n\n(2.7)\n\nwhere\npμ Siμ (p) = 0,\n\nSiμ (p)Sμj (p) = −δij .\n\n(2.8)\n\nObviously,\n\u0002\n\n\u0003\nsi (p), sj (p) = ieijk sk (p).\n\n(2.9)\n\nThe choice of these unit vectors is not unique, and it is possible to construct operators that determine the spin\nprojection on any direction in an arbitrary Lorentz frame.\nThe above description of the particle characteristics cannot be directly used in the presence of external fields, where\noperators (2.5) are not necessarily integrals of motion. In this case the classification of particle states is usually realized\nby linear combinations of operators pμ and wμ with coefficients depending on coordinates [26]. Unfortunately, the\nphysical meaning of these operators is usually not quite clear. Therefore, one should formulate a description of the\nparticle motion in an external field in the same clear and detailed way as for a free particle.\n\n\f5\nThis can be achieved basing on the following ideas. Since an irreducible representation of group is defined accurately\nup to an equivalence transformation, it is reasonable to state the problem of finding such realization of the Lie algebra\nof the Poincaré group for which the condition of irreducibility of the representation leads to wave equation describing\na particle in a given external background. To solve this problem it is necessary to find a unitary operator U (x, x0 )\nwhich converts solutions of the wave equation for a free particle (2.4) to solutions Ψ (x) of (1.3):\nU (x, x0 )Ψ0 (x) = Ψ (x).\nThus, U (x, x0 ) is an intertwining operator in the\nequation\n\u0012\n1\niγ μ ∂μ − γ μ fμ (1 + γ 5 ) −\n2\n\n(2.10)\n\nsense of Darboux [27]. This operator in our case should satisfy the\ni\nμ0 F μν σμν\n2\n\n\u0013\n\nU (x, x0 ) − U (x, x0 ) (iγ μ ∂μ ) = 0.\n\n(2.11)\n\nTherefore, operators\npμ = U (x, x0 )pμ U −1 (x, x0 ),\n\nmμν = U (x, x0 )mμν U −1 (x, x0 )\n\n(2.12)\n\ncommute with the operator of the wave equation. As a consequence, the Pauli–Lubanski–Bargmann vector Wμ and\nthe components of the three-dimensional spin projection operator Si can be constructed in the same way as in the\ncase of a free particle:\nWμ = −\n\n1 μνρλ\ne\nmνρ pλ ,\n2\n\nSi = −\n\n1\nWμ Siμ (p).\nm\n\n(2.13)\n\nThe above statement may be reduced to the following: the wave function of a neutrino in dense matter can be\nderived with the help of a solution of the Dirac equation for a free particle and of some unitary evolution operator.\nA complete set of integrals of motion may be constructed with the help of operators (2.12). The physical meaning of\neigenvalues of observables, i.e. quantum numbers, is clear enough then. However, in the general case, U (x, x0 ) is an\nintegral operator and, as a consequence, operators (2.12) are also integral ones, so it is difficult to find U (x, x0 ) by\ndirect calculations. That is why we are trying to find the evolution operator for equation (1.3) using the correspondence\nprinciple.\nIII.\n\nWAVE FUNCTIONS\n\nWhen motion of a massive particle with spin in electromagnetic fields is described in the framework of the quasiclassical approach, we use two four-vectors, namely the four-velocity uμ and the spin vector S μ obeying the conditions\nu2 = 1,\n\nS 2 = −1,\n\n(uS) ≡ uμ Sμ = 0.\n\n(3.1)\n\nThese vectors are solutions of the Lorentz and BMT equations, respectively. As it was shown in [28], both fourvectors can be constructed with the help of one and the same evolution operator that acts on different initial values of\nthese four-vectors, satisfying relations (3.1). In other words, the evolution operator for the BMT equation completely\ndescribes quasiclassical behavior of the particle.\nAs far as the neutrino is a neutral particle, the BMT equation for the spin vector S μ of a neutrino moving with the\nfour-velocity uμ has the form\nṠ μ = 2μ0 (g μα − uμ uα ) Fαν S ν .\n\n(3.2)\n\nWe can extend the BMT equation to include weak interaction between the neutrino and dense matter. It was shown\nphenomenologically in [29] that if effects of neutrino weak interactions are taken into account, the Lorentz-invariant\ngeneralization of the BMT equation is\nṠ μ = 2 (g μα − uμ uα ) (μ0 Fαν + Gαν ) S ν ,\n\n(3.3)\n\nwhere\nGμν =\n\n1 μνρλ\ne\nfρ uλ .\n2\n\nWe can get an analogous result by averaging the equations of motion for the Heisenberg operators (see [30]).\n\n(3.4)\n\n\f6\nA remarkable feature of the BMT equation is its universality - at least in the zeroth order of the Planck constant,\nparticles with an arbitrary spin may be described by the same BMT equation. However, a part of the information\nabout the particle behavior gets lost due to distinctions in transformation properties of the states of the particles with\ndifferent spins. This information may be restored in the following way. We can describe a particle using quasiclassical\nspin wave functions Ψ (τ ) constructed in such a way that the vector current\njVμ (τ ) = Ψ̄ (τ )γ μ Ψ (τ ),\n\n(3.5)\n\nμ\njA\n(τ ) = Ψ̄ (τ )γ 5 γ μ Ψ (τ )\n\n(3.6)\n\nas well as the axial current\n\nbuilt on their base, obey the BMT equation, and, as a consequence, may be interpreted as four-velocity uμ and spin\nvector S μ respectively.\nWe can introduce quasiclassical spin wave functions as follows [31], [32]. Let the Lorentz equation be solved, i.e. the\ndependence of the particle coordinates on proper time is found. Then the BMT equation transforms to an ordinary\ndifferential equation, whose resolvent determines a one-parameter subgroup of the Lorentz group. The quasiclassical\nspin wave function is a spin tensor, whose evolution is determined by the same one-parameter subgroup. It is easy\nto verify (see Appendix C) that for a neutral particle, represented by a Dirac bispinor, the equation that defines the\nevolution operator for the wave function Ψ (τ ) takes the form\nU̇ (τ, τ0 ) =\n\ni 5\nγ σμν φμ q ν U (τ, τ0 ).\nm\n\n(3.7)\n\nHere φμ = f μ /2 + H μν qν /m, H μν = μ0 ⋆F μν , where ⋆F μν = − 21 eμνρλ Fρλ is the dual electromagnetic field tensor and\nq μ = muμ .\nLet us look for a solution of equation (1.3) in the form\nΨ (x) = e−iK(x) U (τ (x), 0) Ψ0 (x),\n\n(3.8)\n\nwhere U (τ, τ0 ) is an evolution operator for the quasiclassical spin wave function, e−iK(x) is a phase factor, and Ψ0 (x)\nis a solution of the Dirac equation for a free particle. Since we assume that F μν and f μ are constants, the evolution\noperator can be expressed as a matrix exponential,\n\u001b\n\u001a\ni 5\nμ ν\nγ σμν φ q (τ − τ0 ) ,\n(3.9)\nU (τ, τ0 ) = exp\nm\nthat depends on constant four-vector q μ satisfying the condition q 2 = m2 .\nUsing ansatz (3.8) we should choose such a basis in the space of solutions of the Dirac equation for the free particle\nthat the action of the evolution operator on each element of this basis be reduced to multiplication by one and the\nsame matrix function depending on quantum numbers of the basis. It is obvious that in our case we must choose the\nplane waves\nΨ0 (x) = e−i(qx) (1 − ζ0 γ 5 γμ S0μ (q))(γ μ qμ + m)ψ0 .\n\n(3.10)\n\nHere S0μ (q) determines the direction of polarization of the particle; ζ0 = ±1 is the spin projection on S0μ (q); ψ0 is a\nconstant four-component spinor. The wave function is normalized by the condition\nΨ̄0 (x)Ψ0 (x) = m/q0 ,\n\n(3.11)\n\nand four-vector q μ is a kinetic momentum of the particle. Though the explicit form of a kinetic momentum operator for a particle with spin interacting with dense matter and electromagnetic field is not known beforehand, the\ncorrespondence principle allows us to construct solutions characterized by its eigenvalues.\nNaturally, as far as equation (1.3) is invariant under translations the canonical momentum operator pμ = i∂ μ is an\nintegral of motion for this equation, too. However, the commonly adopted choice of eigenvalues of this operator as\nquantum numbers is not satisfactory if we prefer spin projection operators with clear physical meaning. The directions\nof canonical and kinetic momenta are different in the general case (see [23]) and, as it was already mentioned in Section\nII, projection of the spin is well defined in the rest frame of the particle where its kinetic momentum is equal to zero:\nq = 0. That is why in the construction of spin projection operators (see (2.7)) it is necessary to select unit vectors\northogonal to four-vector q μ .\n\n\f7\nLet us find the proper time τ (x) and the phase factor K(x). Substitution of (3.8) into (1.3) gives\n\u001a\n1\n1\nγ μ qμ + γ μ ∂μ K(x) − γ μ fμ (1 + γ 5 ) + γ 5 σμν φμ q ν γ α Nα\n2\nm\n\u001b\ni\nμν\n−iK(x)\n− μ0 F σμν − m e\nU (τ (x))Ψ0 (x) = 0,\n2\nwhere N μ = ∂ μ τ . Since the matrix U (τ (x)) is nondegenerate and the commutator [γ μ qμ , U (τ (x))] is zero, we get\n1\n1\ni\nγ μ ∂μ K(x) − γ μ fμ (1 + γ 5 ) + γ 5 σμν φμ q ν γ α Nα − μ0 F μν σμν = 0.\n2\nm\n2\nTo solve this equation for N μ and K(x), we should set the coefficients at the linearly independent elements of the\nalgebra of the Dirac matrices equal to zero. Thus\n∂ μ K(x) = f μ /2,\n\n(3.12)\n\nand the system that defines the vector N μ is\nφμ (m − (N q)) + (N φ)q μ = 0,\n\nμ0 F μα qα = −eμνρλ Nν φρ qλ ,\n\n(3.13)\n\nThe system is consistent provided that\nqμ F μν φν = 0.\n\n(3.14)\n\nEquation (3.14) must be held for an arbitrary q μ , so we have\n⋆ μα\n\nF\n\n1\nFαν ≡ − δνμ ⋆F αβ Fαβ = 0,\n4\nF μν fν = 0.\n\n(3.15)\n\n(3.16)\n\nAny antisymmetric tensor has an eigenvector corresponding to zero eigenvalue if and only if its second invariant\nI2 = 41 ⋆F μν Fμν is equal to zero. That is why conditions (3.15) and (3.16) are not independent and (3.15) is a\nconsequence of (3.16). Comparing it with (1.9), we see that the condition obtained basing on the physical reasons\nalone and condition (3.16) totally coincide. This ensures quasiclassical behavior of the particle in the background\nmedium and allows obtaining the solution of equation (1.3) in the form of (3.8).\nUsing an orthogonal basis in the Minkowski space,\nH μν qν\nF μν qν\nm2 H μν Hνα q α − q μ N\np\n,\nnμ0 = q μ /m, nμ1 = √\n, nμ2 = p , nμ3 =\nN\nm N Ñ\nÑ\n\n(3.17)\n\nwhere N = qμ H μρ Hρν q ν , Ñ = μ20 qμ F μρ Fρν q ν , and relations (B3), (B4) from Appendix B, we find\nN μ = −q μ\n\nm(f φ)\nm3 (f φ)\nμ m\nμ\n+\nf\n+\nφ\n.\n2((φq)2 − m2 φ2 )\n2(φq)\n2(φq)((φq)2 − m2 φ2 )\n\n(3.18)\n\nAccording to the fact that f μ and N μ are constant values we obtain the proper time\nτ = (N x),\n\n(3.19)\n\nK(x) = (f x)/2,\n\n(3.20)\n\nand the phase factor\n\nwhich determines an energy shift of the neutrino in matter.\nNow we can derive the expression for the wave function:\nΨqζ0 (x) =\n\n1 X −i(Pζ x)\nμ\ne\n(1 − ζγ 5 γμ Stp\n(q))(1 − ζ0 γ 5 γμ S0μ (q))(γ μ qμ + m)ψ0 ,\n2\nζ=±1\n\n(3.21)\n\n\f8\nwhere\n\u0013\n\u0012\np\n(f φ)\n(φq)2 − φ2 m2 /m = q μ 1 + ζ p\n2 (φq)2 − m2 φ2\np\n\u0013\n\u0012\nζ (φq)2 − m2 φ2\n1\nζ(f φ)m2\np\n,\n+ fμ 1 −\n− φμ\n2\n(φq)\n2(φq) (φq)2 − m2 φ2\n\nPζμ = q μ + f μ /2 − ζN μ\n\nq μ (φq)/m − φμ m\nμ\nStp\n(q) = p\n.\n(φq)2 − φ2 m2\n\n(3.22)\n\n(3.23)\n\nSystem (3.21) represents the complete system of solutions of equation (1.3) characterized by kinetic momentum of\nthe particle q μ and the quantum number ζ0 = ±1 which can be interpreted as the neutrino spin projection on the\ndirection S0μ (q) at τ = (N x) = 0.\nSystem (3.21) is nonstationary in the general case. The solutions are stationary only when the initial polarization\nμ\nμ\nvector S0μ (q) is equal to the vector of the total polarization Stp\n(q) [33], S0μ (q) = Stp\n(q). In this case the wave functions\nμ\n5\nare eigenfunctions of the spin projection operator Stp = −γ γμ Stp (q) with eigenvalues ζ = ±1, and of the canonical\nmomentum operator pμ = i∂ μ with eigenvalues Pζμ . The orthonormal system of the stationary solutions, the basis of\nsolutions of equation (1.3), can be written as (see Appendix D)\nq\nμ\n(q))(γ μ qμ + m)ψ0 ,\n(3.24)\nΨqζ (x) = e−i(Pζ x) |Jζ (q)|(1 − ζγ 5 γμ Stp\nwhere Jζ (q) is the transition Jacobian between the variables q μ and Pζμ\n\"\n#\n∂Pζi ∂Pζi ∂q 0\nJζ (q) = det(Mij ) = det\n.\n+\n∂q j\n∂q 0 ∂q j\n\n(3.25)\n\nWith the help of relations from Appendix B, the explicit form of the matrix Mij may be written as\n!\n(f φ)\nMij = δij 1 + ζ p\n2 (φq)2 − m2 φ2\n\u0013\u0012\n\u0013\n\u0012\nφ0 m2 (f φ)2 + f 2 (φq)2 − m2 f 2 φ2\nm2\nφj − qj 0\n.\n+ζ qi − φi\n(φq)\nq\n4(φq)((φq)2 − m2 φ2 )3/2\n\nOne can easily derive the following equality for arbitrary vectors g and h\ndet (δij + gi hj ) = 1 + (g * h).\nSo we have\nJζ (q) =\n\n(f φ)\n1+ζ p\n2 (φq)2 − m2 φ2\n\n!2\n\n!\nfμ H μν qν /(2m) − 2μ20 I1\np\n1+ζ\n.\n(φq)2 − m2 φ2\n\n(3.26)\n\nHere I1 = 14 F μν Fμν is the first invariant of the tensor F μν . Note that to obtain a complete system of solutions for\nthe antineutrino, it is necessary to change the sign of the kinetic momentum q μ .\nThe dispersion law for the neutrino in dense magnetized matter is different from the one for the free particle and\ncan be written as (see relations (B7), (B8) and (B9) in Appendix B)\nq\nP̃ 2 = m2 − f 2 /4 − 2μ20 I1 − 2ζ∆ (P̃ Φ̃)2 − Φ̃2 m2 ,\n(3.27)\n\nwhere\n\nP̃ μ = Pζμ − f μ /2, Φ̃μ = f μ /2 + H μν P̃ν /m,\n!\n!\nfμ H μν P̃ν /m − 4μ20 I1\nfμ H μν qν /(2m) − 2μ20 I1\np\n= sign 1 +\n.\n∆ = sign 1 + ζ\nP̃ 2 − m2 + f 2 /4 + 2μ20 I1 − (Φ̃f )\n(φq)2 − m2 φ2\n\n(3.28)\n\n\f9\nThe appearance of the factor ∆ in equation (3.27) is a consequence of the fact that ζ is projection of the particle spin\non the direction defined by the kinetic momentum instead of the canonical one.\nIn spite of the modification of the dispersion law described above, we see that the neutrino moving through dense\nmatter and electromagnetic field may still behave as a free particle, i.e. its group velocity\nvgr =\n\n∂Pζ0\n∂Pζ\n\n=\n\nq\nq0\n\n(3.29)\n\nis the same for both polarization states of the particle. However, in interactions with other particles some channels\nof reactions which are closed for a free neutrino can be opened due to the modification of the dispersion law (see, for\nexample, [19], [36], [37]).\nLet us discuss now properties of nonstationary solutions in more detail. Solution (3.21) is a plane-wave solution of\nequation (1.3), describing a pure quantum-mechanical state of a neutral particle with a nonconserved spin projection\non the fixed space axis. Solutions (3.21) do not form an orthogonal basis. However, the considered system is not\novercomplete, since the spectrum of the spin projection operator is finite. So the system can be easily orthogonalized.\nGeneralization of the basis (3.24) is\nq\n1 X −i(Pζ x)\nμ\nΨ̃qζ0 (x) =\n(3.30)\n|Jζ (q)|(1 − ζγ 5 γμ Stp\n(q))(1 − ζ0 γ 5 γμ S0μ (q))(γ μ qμ + m)ψ0 .\ne\n2\nζ=±1\n\nThus we have just established that the unitary intertwining operator (2.10) in our case is the Fourier integral\noperator [38] and it acts on elements of the plane-wave basis of solutions of the free particle Dirac equation (3.10) in\nthe following way:\nq\n1 X −i((Pζ −q)x)\nμ\nΨ̃qζ0 (x) = U (x, x0 )Ψ0 (x) =\n|Jζ (q)|(1 − ζγ 5 γμ Stp\n(q))Ψ0 (x).\n(3.31)\ne\n2\nζ=±1\n\nAction of the inverse operator is defined by the formula\nΨ0 (x) = U −1 (x, x0 )Ψ̃qζ0 (x) =\n\n1\n1 X i((Pζ −q)x)\nμ\np\n(1 − ζγ 5 γμ Stp\n(q))Ψ̃qζ0 (x).\ne\n2\n|Jζ (q)|\n\n(3.32)\n\nζ=±1\n\nSince the intertwining operator is defined on the elements of the basis, its action on an arbitrary solution is defined\nas well. Hence, the explicit form of this operator as a function of coordinates and differential operators can be easily\nobtained.\nNote that an attempt to construct intertwining operator for equation (1.3) was undertaken in [39] for the case where\nonly parameter f μ is nontrivial. The result of the action of the operator suggested in [39] on plane-wave solutions of\nthe Dirac equation for a free particle coincides with solutions obtained in our previous work [19] for this particular\ncase, and which can be derived from (3.21), if one sets F μν = 0. We should emphasize that solutions (3.21) do not\nform an orthogonal basis. As a consequence of this fact, the intertwining operator suggested in [39] is not unitary\nwith regard to the standard scalar product (2.6).\nThe case of a massless neutrino is quite special. Equation (3.7) obviously does not hold in the limit m → 0 because\nmassless particle helicity is conserved, while the BMT equation describes spin rotation. To find wave functions\nof massless neutrino, one must take into account that from the mathematical point of view, the small group of\nrepresentation of the Poincaré group for a massive particle differ from that for a massless particle (see, for example,\n[25]). The small group for a massive particle is the rotation group of three-dimensional Euclidian space O+ (3), and\nnontrivial magnetic and electric moments are allowed. In contrast to that, the small group for a massless particle\nis the movement group of Euclidian plane E(2), which outlaws nonzero magnetic moment as well as electric one or\nother nontrivial coefficients μn and ε′n in equation (A2). Therefore, one has to put μ0 = 0 in equation (1.3). Then\ninstead of (3.24), we obtain\nΨqζ (x)|m=0 = e−i(qx)(1+ζη) e−i(f x)(1−ζ)/2 |1 + ζη|(1 − ζγ 5 )γ μ qμ ψ0 ,\n\n(3.33)\n\nΨqζ (x)|m=0 = ei(qx)(1+ζη) e−i(f x)(1+ζ)/2 |1 + ζη|(1 + ζγ 5 )γ μ qμ ψ0 ,\n\n(3.34)\n\nfor the neutrino, and\n\nfor the antineutrino. In these equations η =\n\nf2\n2(f q)\n\nand q 2 = 0.\n\n\f10\nIV.\n\nOPERATORS OF OBSERVABLES\n\nLet us find the explicit forms of the kinetic momentum operators pμ and the spin projection operator Stp in the\ncoordinate representation. For this purpose we might exploit formulas (2.12); however, we follow a simpler way.\nThe obtained solutions (3.24) are classified by eigenvalues of the operators pμ and Stp , so\npμ Ψqζ (x) = q μ Ψqζ (x),\n\nStp Ψqζ (x) = ζΨqζ (x).\n\n(4.1)\n\nSince solutions (3.24) are also eigenfunctions of the canonical momentum operator pμ = i∂ μ with eigenvalues Pζμ , we\nhave\npμ Ψqζ (x) = Pζμ Ψqζ (x).\n\n(4.2)\n\nNow we should express eigenvalues of the kinetic momentum operator q μ in terms of eigenvalues of the canonical\nmomentum operator Pζμ . From (3.22) we have\n\"\n\nq μ = P̃ μ + f\n\np\n\n(φq)2 − m2 φ2\nζ(f φ)m2\np\n+ φμ\n2(φq)\n2(φq) (φq)2 − m2 φ2\n\"\n#−1\n(f φ)\n× 1+ζ p\n.\n2 (φq)2 − m2 φ2\n\nμζ\n\n#\n\n(4.3)\n\nWith the help of relations from Appendix B this can be rewritten as\nq μ = P̃ μ +\n\nP̃ μ (Φ̃f ) − f μ (f P̃ )/2 − 2mH μν Φ̃ν\n.\nP̃ 2 − m2 + f 2 /4 + 2μ20 I1 − (Φ̃f )\n\n(4.4)\n\nThe vector of total polarization in terms of the new variable is\nq μ (Φ̃P̃ )/m − Φ̃μ m\nμ\n.\nStp\n(q) = ∆ q\n(Φ̃P̃ )2 − m2 Φ̃2\n\n(4.5)\n\nHere P̃ , Φ̃ and ∆ are given by (3.28).\nBecause of (4.2) we can interpret Pζμ as a result of action of operator pμ = i∂ μ on the wave function. So by changing\nP̃ μ ⇒ pμ − f μ /2 and Φ̃μ ⇒ f μ /2 + H μν (pν − fν /2)/m in formulas (4.4), (4.5), we obtain kinetic momentum operator\nμ\npμ and spin projection operator Stp = −γ 5 γμ Stp\n(q) in the explicit form. These operators are pseudodifferential ones\n[38] and are determined on the solutions of equation (1.3) with fixed mass m.\nTo extend the domain of the definition of constructed operators, we need to replace mass m in (4.4) and (4.5) by\nthe matrix operator from equation (1.3):\n1\ni\nm = γ μ pμ − γ μ fμ (1 + γ 5 ) − μ0 F μν σμν ,\n2\n2\n2\nm2 = (p − f /2) − f 2 /4 + 2μ20 I1 + γ 5 σ μν fμ pν + H μν γμ fν (1 + γ 5 ) + 2γ 5 H μν γμ pν .\n\n(4.6)\n\nIn this way we obtain the covariant form for pμ and Stp .\nUnfortunately, the result of this substitution cannot be written as a compact formula, so we do not present it here.\nHowever, even if we do not know a covariant form of the operator pμ , we may conclude that on the solutions of\nequation (1.3) the relations,\np 2 = m2 ,\n\nγ μ pμ = m,\n\n(4.7)\n\nshould hold. The first equality in (4.7) is obvious; to proof the second one, recall that according to (2.12)\nm = U (x, x0 )γ μ pμ U −1 (x, x0 ) = U (x, x0 )γ μ U −1 (x, x0 )pμ = (γ μ + Γ μ (q)) pμ .\n\n(4.8)\n\nμ\nFrom formulas (3.31) and (3.32) it follows that Γ μ (q) ∼ Stp\n(q), and as a consequence Γ μ (q)pμ = 0. So equation (1.3)\nmay be represented as\n\n(γ μ pμ − m)Ψ (x) = 0.\n\n(4.9)\n\n\f11\nConsider now special cases where the presented technique looks quite clear. Discuss the influence on the neutrino\ndynamics of the electromagnetic field alone, i.e. assume that f μ = 0. In this case eigenvalues of the kinetic momentum\noperator q μ would be expressible in terms of eigenvalues of the canonical momentum operator Pζμ in the following\nway:\nq μ = Pζμ −\n\n2H μα Hαν Pζν\n.\nPζ2 − m2 + 2μ20 I1\n\n(4.10)\n\nThen the covariant form of the kinetic momentum operator is\nH μα Hαν pν\np μ = pμ + p\nS̃tp ,\npβ Hβα H αρ pρ\n\n(4.11)\n\nand the spin projection operator Stp is defined by the formula\nStp\nHere\n\n!\n2μ20 I1\nS̃tp S̃tp .\n= sign 1 + p\npβ Hβα H αρ pρ\nγ 5 γμ H μν pν\nS̃tp = p\n.\npβ Hβα H αρ pρ\n\n(4.12)\n\n(4.13)\n\nThus operator Stp has a simple physical meaning. It characterizes a particle spin projection on the direction of the\nmagnetic field in the rest frame of the particle.\nVice versa, when the electromagnetic field is absent, but f μ is nontrivial, we have\nμ\n\nq =\n\nPζμ\n\nPζμ f 2 − f μ (f Pζ )\n1 μ\n,\n− f +\n2\n2(Pζ2 − (Pζ f ) − m2 )\n\n(4.14)\n\nand the covariant forms of the kinetic momentum and spin projection operators are\np μ = pμ −\n\npμ f 2 − f μ (f p) αν\nfμ\n− γ5\nσ f α pν ,\n2\n2((pf )2 − p2 f 2 )\nγ 5 σ μν fμ pν\nStp = p\n.\n(pf )2 − p2 f 2\n\n(4.15)\n\n(4.16)\n\nNote that if the matter is at rest and nonpolarized (f = 0), then\nStp = sign(f 0 )\n\n(Σ * p)\n,\n|p|\n\n(4.17)\n\nin other words Stp is equal to the standard helicity operator up to the sign.\nWe can find now spin projection operators for nonstationary wave functions (3.21) and (3.30). For this purpose,\nwe introduce operators S± that act on the elements of system (3.24) as follows:\nS+ Ψqζ (x) =\n\n(1 − ζ)\nΨq(−ζ) (x),\n2\n\nS− Ψqζ (x) =\n\n(1 + ζ)\nΨq(−ζ) (x).\n2\n\n(4.18)\n\n1\nThen operators S1 = 21 (S+ + S− ), S2 = 2i\n(S+ − S− ) and S3 = 21 Stp correspond to elements of the Lie algebra of\nthe SU(2) group. Commutation relations for these operators are\n\n[Si , Sj ] = ieijk Sk .\n\n(4.19)\n\nTo determine the explicit realization of operators S± on eigenfunctions of operator pμ let us choose the basis Siμ (q)\nμ\nμ\n(see (2.8)) in the form Stp\n(q), S1μ (q), S2μ (q). Here Stp\n(q) is defined by relation (3.23), the other spacelike unit vectors\nare\nS1μ (q) =\n\nμ\nS0μ (q) + Stp\n(q)(S0 (q)Stp (q))\np\n,\n1 − (S0 (q)Stp (q))2\n\nS2μ (q) =\n\neμνρλ qν S0ρ (q)Stpλ (q)\np\n.\nm 1 − (S0 (q)Stp (q))2\n\n(4.20)\n\n\f12\nAs a result we have\np\n1 |Jζ=±1 (q)| ±2iθ 5\nS± = − p\ne\nγ γμ (S1μ (q) ± iS2μ (q)) ,\n2 |Jζ=∓1 (q)|\n\nwhere\n\np\nθ = (N x) (φq)2 − φ2 m2 /m.\n\n(4.21)\n\n(4.22)\n\nOperators Stp and S± are integrals of motion. So the spin projection operator S̃0 that has eigenfunctions (3.30)\nand eigenvalues ζ0 = ±1 is a linear combination of these operators. We can rewrite wave functions (3.30) in the form\nq\nq\nΨqζ=1 (x)\nΨqζ=−1 (x)\n√\n√\n+ ζ0 1 + ζ0 (S0 (q)Stp (q))\n.\n(4.23)\nΨ̃qζ0 (x) = 1 − ζ0 (S0 (q)Stp (q))\n2\n2\nSo it is obvious that\nS̃0 = −(S0 (q)Stp (q))Stp +\n\nq\n1 − (S0 (q)Stp (q))2 [ S+ + S− ] .\n\n(4.24)\n\nSimilarly to (4.24), one can construct the integral of motion S0 with eigenfunctions (3.21) and eigenvalues ζ0 = ±1.\nSince\nq\nq\nΨqζ=1 (x)\nΨqζ=−1 (x)\nΨqζ0 (x) = 1 − ζ0 (S0 (q)Stp (q)) p\n+ ζ0 1 + ζ0 (S0 (q)Stp (q)) p\n,\n(4.25)\n2|Jζ=+1 (q)|\n2|Jζ=−1 (q)|\n\nwe have\n\n#\n\"p\np\nq\n|Jζ=−1 (q)|\n|Jζ=+1 (q)|\n2\nS− .\nS0 = −(S0 (q)Stp (q))Stp + 1 − (S0 (q)Stp (q)) p\nS+ + p\n|Jζ=+1 (q)|\n|Jζ=−1 (q)|\n\n(4.26)\n\nOr, in the other form,\n\n\u001a\n\u001b\nq\nμ\nμ\nμ\n2\nS0 = γ γμ (S0 (q)Stp (q))Stp (q) − 1 − (S0 (q)Stp (q)) [cos 2θ S1 (q) − sin 2θ S2 (q)] .\n5\n\n(4.27)\n\nNote that operator (4.26) is not a self-adjoint operator with respect to the standard scalar product (2.6). It seems\nquite natural, since wave functions (3.21) do not form an orthogonal system. However, the system of wave functions\nis orthonormalized to the condition \"one particle in the unit volume.\" In this sense wave functions (3.21) minimize\nthe uncertainty relation which is due to (4.19)\nh(S1 − hS1 i)2 ih(S2 − hS2 i)2 i =\n\n1\nhS3 i2 .\n4\n\n(4.28)\n\nTherefore, these wave functions describe spin-coherent states of the neutrino (on properties of coherent states see, for\nexample, [40]). The given system of spin-coherent states is parametrized by four-vector S0μ (q).\nV.\n\nQUASICLASSICAL INTERPRETATION\n\nLet us discuss in more detail the physical meaning of spin-coherent states of the neutrino. For this purpose we\nconstruct vector and axial currents with the help of (3.21). The vector current is\njVμ = Ψ̄ (x)γ μ Ψ (x) = q μ /q 0 ,\n\n(5.1)\n\nand we see that (3.21) describes neutrino propagation with the constant velocity vgr = q/q 0 . The axial current is\nμ\njA\n= Ψ̄ (x)γ 5 γ μ Ψ (x) = ζ0\n\nm μ\nS .\nq0\n\n(5.2)\n\nHere\n\u0002\n\u0003\n1\nμ\nμ\nS μ = −Stp\n(q)(S0 (q)Stp (q)) + S0μ (q) + Stp\n(q)(S0 (q)Stp (q)) cos 2θ − eμνρλ qν S0ρ (q)Stpλ (q) sin 2θ,\nm\n\n(5.3)\n\n\f13\nwhere θ is determined by (4.22). As expected (see (3.5) and (3.6)), vector and axial currents coincide with the\nsolutions of the BMT equation, if the proper time is defined as in (3.19).\nThe three-vector of spin ζ can be expressed in terms of the four-vector S μ components as\nζ = S−\n\nqS 0\n.\nq0 + m\n\n(5.4)\n\nThen for ζ we have\nζ = ζ tp (ζ 0 * ζ tp ) + [ζ 0 − ζ tp (ζ 0 * ζ tp )] cos 2θ − [ζ tp × ζ 0 ] sin 2θ.\n\n(5.5)\n\nExpression (5.5) has a simple quasiclassical interpretation.\nThe antisymmetric tensor Gμν (see equation (3.4)) can be written in the standard form\nGμν = (μ0 P, μ0 M ),\n\n(5.6)\n\nwhere\nM = (f 0 q − q 0 f )/(2μ0 m),\n\n\u0002\n\u0003\nP = − q × f /(2μ0 m).\n\n(5.7)\n\nVectors P and M are analogous to the polarization and the magnetization vectors of medium. Note that the substitution F μν ⇒ F μν + Gμν /μ0 implies that the magnetic H and electric D fields are shifted by the vectors M and P,\nrespectively (we use here notation common in electrodynamics of continuous media [41])\nH ⇒ B = H + M,\n\nD ⇒ E = D − P.\n\n(5.8)\n\nThus restriction (1.9) in the explicit form is\n(E * f ) = 0,\n\nEf 0 − [B × f ] = 0.\n\n(5.9)\n\nThis means that the Lorentz force and moment of force acting on matter are equal to zero, i.e. matter is at equilibrium\nstate within the accuracy of our consideration. In particular, the vector of polarization of matter is parallel to the\nmagnetic field if the matter is at rest.\nIn the rest frame of the particle, equation (3.3) can be written in the form\n\u0003\n\u0002\n(5.10)\nζ̇ = 2μ0 ζ × B0 ,\n\nwhere the spin vector ζ is related to four-vector S μ by equation (5.4) and the value B0 is the effective magnetic field\nin the neutrino rest frame. This field can be expressed in terms of quantities determined in the laboratory frame,\n\u0014\n\u0015\n\u0002\n\u0003 q(q * B)\n1 0\nq B− q×E − 0\nB0 =\nm\nq +m\n(5.11)\n\u0014\n\u0015\n\u0002\n\u0003\nq(q * H)\nf\n(q * f ) \u0011\nq \u0010 0\n1 0\nq H− q×D − 0\n−\nf − 0\n.\n+\n=\nm\nq +m\n2μ0\nq +m\n2μ0\nWe see that the neutrino spin precesses around the direction B0 with the frequency ω = 2m|B0 |/q 0 , the angle between\nB0 and the vector of spin being θ = arccos(ζ 0 * ζ tp ). The spin vector direction corresponding to stationary states ζ tp\nis connected to the effective magnetic field as follows:\nζ tp =\n\nB0\n.\n|B0 |\n\n(5.12)\n\nμ\nThis fact explains in a simple way the stationarity of states with S0μ (q) = Stp\n(q).\nLet us introduce a flight length L and a spin oscillation length Losc of the particle, remember that these are related\nby θ = πL/Losc and that the scalar product (N x) = τ may be interpreted as the proper time of a particle. The spin\noscillation length is\n\n2π|q|\n.\nLosc = p\n2\n2\n2\n(f q) − f m − 4mH μν fμ qν + 4H μα Hαν qμ q ν\n\n(5.13)\n\n\f14\nWe can now write the probability for the neutrino which was arisen with polarization ζ 0 to change the polarization\nto −ζ 0 after traveling some distance L. This is\nW = sin2 θ sin2 (πL/Losc ).\n\n(5.14)\n\nIt is clear that when (ζ 0 * ζ tp ) = 0 or θ = π/2, the probability can be equal to unity and the resonance takes place.\nIf the neutrino has the fixed helicity in the initial state\n1 \b\nq\nS0μ (q) =\n|q|, q 0 q/|q| , ζ 0 =\n,\n(5.15)\nm\n|q|\n\nthen sin2 θ = 1 − (B0 * q)2 /|B0 |2 |q|2 and formula (5.14) simplifies to the result widely discussed in the literature. This\nfact is not surprising. As was mentioned in Introduction, the Schrödinger-type equation with an effective Hamiltonian,\nwhich was used in papers [6] for obtaining this result, is merely the BMT equation in the spinor representation.\nVI.\n\nDISCUSSION AND CONCLUSIONS\n\nLet us compare our results with those of the standard quantum-mechanical approach to this problem. Since the\nneutrino behavior in dense matter under the influence of magnetic field, to the best of our knowledge, was not\ninvestigated before, we consider the neutrino propagation in a constant homogeneous magnetic field alone.\nIn the studies of the influence of a stationary pure magnetic field on the neutrino spin rotation in the pioneer paper\n[15], as well as in other papers, the stationary solutions Ψpζ (x) first found in [42] were used as the wave functions of\na particle. These solutions are the eigenfunctions of the canonical momentum operator pμ and of the spin projection\noperator Stp (see (4.12)). The description of the neutrino spin rotation there is based on solving the Cauchy problem\nwhere the initial condition is chosen in such a way that the mean value of neutrino helicity is equal to ±1. It was taken\nfor granted that the solution of the Cauchy problem can be expressed as a linear combination of the above-mentioned\nwave functions:\nX\nΨ (x) =\ncζ (p)Ψpζ (x).\n(6.1)\nζ=±1\n\nHowever, such an assumption is incorrect. The point is that, once in a pure state the mean value of some spin operator\nis equal to ±1, then this state is described by an eigenfunction of this operator. In the general case, the construction\nof the eigenfunction of the spin projection operator as a superposition of only positive-energy solutions of equation\n(1.3) is possible only when this spin projection operator commutes with the operator of the sign of the energy. The\nstandard helicity operator (Σ * p)/|p| does not feature it.\nThe given phenomenon is a sort of the famous Klein paradox [43]. To avoid the indicated difficulties, in relativistic\nquantum mechanics only self-adjoint operators in the subspace of wave functions with a fixed energy sign can be\ntreated as operators of observables. The choice of integrals of motion as operators of observables is the necessary\ncondition to satisfy this requirement [24].\nIn the case considered the canonical momentum operator is an integral of motion. However, the conserved operator\nof the spin projection which should set initial conditions to the Cauchy problem is uniquely - up to the sign -\ndetermined by the form of the Dirac–Pauli equation. This operator is Stp . Therefore, it is impossible to construct\na wave function describing a neutrino with rotating spin in the form of an eigenfunction of the canonical momentum\noperator for its arbitrary eigenvalues. The solutions similar to (6.1) can exist when the special values of the canonical\nmomentum are chosen. So, if a neutrino moves parallel or perpendicular to a constant homogeneous magnetic field,\neigenfunctions of the helicity operator are the superpositions of positive-energy solutions alone [44].\nTo solve the problem we abandon the view that eigenvalues of the canonical momentum operator always impose\na direction of the particle propagation. We found a self-adjoint operator pμ which can be interpreted as kinetic\nmomentum operator of the particle and obtained the complete orthonormal system of the solutions of equation (1.3)\nwith elements which are eigenfunctions of the given operator. On the base of this system we constructed solutions\ndescribing the neutrino with rotating spin. So our results enable one to treat a possible effect of the neutrino\npolarization change as a real precession of the particle spin.\nConsequently, the problem of neutrino spin rotation in dense matter and in strong electromagnetic fields is solved in\nfull agreement with the basic principles of quantum mechanics. Using the wave functions of orthonormal basis (3.24)\nor spin-coherent wave functions (3.21), it is possible to calculate probabilities of various processes with the neutrino\nin the framework of the Furry picture. When choosing one or another type of the basis, it is necessary to take into\naccount that, due to the time-energy uncertainty, stationary states of the neutrino can be generated only when the\nlinear size of the area occupied by the electromagnetic field and the matter is comparable in the order of magnitude\nwith the formation length of the process - the spin oscillation length in our case.\n\n\f15\nAcknowledgments\n\nThe authors are grateful to V. G. Bagrov, A. V. Borisov, Ya. N. Istomin, O. S. Pavlova, A. E. Shabad, and\nV. Ch. Zhukovsky for helpful discussions.\nThe work was supported in part by grants of the President of the Russian Federation for leading scientific schools\n(Grant No. SS - 65255.2010.2 and Grant No. SS - 4142.2010.2).\nAppendix A\n\nLet us find the equation for the description of the neutrino behavior in dense matter and in electromagnetic fields\nat low-energy limit. When weak interaction with background fermions is considered to be coherent, the behavior of\nmass states of any one-half spin lepton should be described by the Dirac-type equation,\n(iγ μ ∂μ + Vem + Vmatter − m) Ψ (x) = 0.\n\n(A1)\n\nIn this equation the term Vem describes interaction of the particle with the electromagnetic field and the term Vmatter\nis responsible for weak interaction with matter.\nFollowing paper [45], the nature of the interaction terms is determined by the restrictions that the equation be\nLorentz covariant and gauge invariant; that the terms are linear in the electromagnetic fields and integral characteristics of matter, i.e. currents and polarizations of background particles; that terms do not vanish in the limit of\nvanishing momentum of the particle; that the charge and current distribution associated with the particle be sufficiently localized that its interaction with slowly varying electromagnetic fields and characteristics of matter may be\nexpressed in terms of the electromagnetic and matter potentials and arbitrary high derivatives of these potentials\nevaluated at the position of the particle. These assumptions lead to the term Vem in the form\nVem = −\n\n∞ \u0014\nX\n\nn=0\n\n\u0015\ni\n1\nεn γ μ \u0003n Aμ + μn σ μν \u0003n Fμν + μ′n γ 5 (γ μ \u0003 − γ ν ∂ν ∂ μ )\u0003n Aμ + ε′n γ 5 σ μν \u0003n Fμν .\n2\n2\n\n(A2)\n\nHere Aμ is the potential of the external electromagnetic field, F μν = ∂ μ Aν − ∂ ν Aμ is the electromagnetic field tensor,\n\u0003 = ∂ μ ∂μ is the d'Alembert operator. The constants μn , μ′n , εn , ε′n characterize the interaction, ε0 is charge of the\nparticle, μ0 , ε′0 are, respectively, anomalous magnetic and electric moments, and μ′0 is an anapole moment. The\nexpression for the Vmatter can be found if we replace Aμ in (A2) with a linear combination of the currents (1.1) and\nof the polarizations (1.2) of background fermions f with the proper choice of coupling constants.\nWe have the minimal nontrivial generalization of the Dirac–Pauli equation neglecting terms with derivatives higher\nthan the second in (A2). In the expression for Vmatter we must hold only leading terms due to the proportionality of\n\u0003Aμ to the sum of charged particle currents. Further restrictions for (A1) depend on the sort of lepton and on the\nmodel of interaction. The neutrino is a neutral particle, thus ε0 = 0. In the framework of the standard model where\nit is assumed that the theory is T invariant and the neutrino interacts with leptons and quarks through left currents,\nits anomalous electric moment goes to zero (ε′ 0 = 0) and the term describing direct interaction of the neutrino with\nthe currents contains multiplier (1 + γ 5 ). As a result we come to equation (1.3) with an effective four-potential f μ\nwhich is determined by (1.4) and (1.5).\nAppendix B\n\nFor an arbitrary antisymmetric tensor Aμν , its dual tensor ⋆Aμν = − 21 eμνρλ Aρλ , and for any four-vectors g μ , hμ ,\nsuch as (gh) 6= 0 the following relation takes place [46]:\nAμν (gh) = − [g μ Aνρ hρ − Aμρ hρ g ν ] + ⋆ [hμ⋆Aνρ gρ − ⋆Aμρ gρ hν ] .\n\n(B1)\n\nThis leads to the formula\n2\n\n2\n\ngμ ⋆Aμρ ⋆Aρ ν g ν h2 + (gμ ⋆Aμν hν ) − hμ Aμρ Aρ ν hν g 2 − (gμ Aμν hν ) =\n= gμ ⋆Aμρ ⋆Aρ ν hν (gh) − gμ Aμρ Aρ ν hν (gh) = 2(gh)2 I1 .\nHere I1 = 41 Aμν Aμν = − 14 ⋆Aμν ⋆Aμν is the first invariant of the tensor Aμν .\n\n(B2)\n\n\f16\nLet Aμν = ⋆F μν , g μ = φμ , and hμ = q μ . Since ⋆F μν φν = −F μν φν = 0 (see (3.15), (3.16)), then from (B1) and\n(B2) we get\n2H μν (φq) = H μρ qρ f ν − f μ H νρ qρ = m(φμ f ν − f μ φν ),\n\n(B3)\n\nand\nm2 ((f φ)2 − f 2 φ2 ) = f 2 N + (fμ H μν qν )2 = (f q)fμ H μα Hαν q ν = 2(f q)2 μ20 I1 ,\nN − Ñ = 2m2 μ20 I1 .\n\n(B4)\n\nLet Aμν = ⋆F μν , g μ = Φ̃μ , and hμ = P̃ μ . Since ⋆F μν Φ̃μ = −F μν Φ̃ν = 0, then from (B1), (B2) we get\n2H μν (Φ̃P̃ ) = H μρ P̃ρ f ν − f μ H νρ P̃ρ = m(Φ̃μ f ν − f μ Φ̃ν ),\n\n(B5)\n\nm2 ((f Φ̃)2 − f 2 Φ̃2 ) = f 2 P̃μ H μα Hαν P̃ ν + (fμ H μν P̃ν )2 = (f P̃ )fμ H μα Hαν P̃ ν = 2(f P̃ )2 μ20 I1 .\n\n(B6)\n\nand\n\nIt is possible to establish by direct calculations using (B4) that\n(P̃ Φ̃)\n(f Φ̃)\n=\n=\n(qφ)\n(f φ)\nIt follows from (B3) and (B5) that\n\nfμ H μν qν /2m − 2μ20 I1\n1+ζ p\n(φq)2 − m2 φ2\n\n!\n\n.\n\nφμ\nΦ̃μ\n,\n=\n(φq)\n(Φ̃P̃ )\n\n(B7)\n\n(B8)\n\nand from (B4), (B6), and (B7) that\n(φq)2\n[(Φ̃P̃ )2 − m2 Φ̃2 ],\n(Φ̃P̃ )2\n(Φ̃P̃ )\n(φq)\np\n.\n= ∆q\n2\n2\n2\n(φq) − m φ\n(Φ̃P̃ )2 − m2 Φ̃2\n\n(φq)2 − m2 φ2 =\n\n(B9)\n\nAppendix C\n\nThe Lorentz equation for the four-velocity uμ and the BMT equation for the spin vector S μ are\ne μν\nF uν ,\nm\n\u0001\ne μν\nμ\nṠ = F Sν + 2μ0 g μλ − uμ uλ Fλν S ν .\nm\nu̇μ =\n\n(C1)\n\nSince u2 = 1 and (Su) = 0, we may rewrite these equations as [28]\nu̇μ = Ωμν uν ,\n\nṠ μ = Ωμν Sν ,\n\n(C2)\n\nwhere\nΩμν =\n\ne μν\nF + 2μ0 (g μα − uμ uα )Fαβ (g βν − uβ uν )\nm\n\n(C3)\n\nis an antisymmetric tensor.\nFrom (C2) it is obvious that the evolution operators for the Lorentz and BMT equations are the same and fulfill\nthe relation\nṘμν (τ, τ0 ) = Ωμα Rαν (τ, τ0 ).\n\n(C4)\n\n\f17\nFrom (3.5) and (3.6) it follows that\njVμ (τ ) = Rμν (τ, τ0 )jVν (τ0 ) = Ψ̄ (τ )γ μ Ψ (τ ) = Ψ̄ (τ0 )U (τ0 , τ )γ μ U (τ, τ0 )Ψ (τ0 ),\n\n(C5)\n\nμ\nν\njA\n(τ ) = Rμν (τ, τ0 )jA\n(τ0 ) = Ψ̄ (τ )γ 5 γ μ Ψ (τ ) = Ψ̄ (τ0 )U (τ0 , τ )γ 5 γ μ U (τ, τ0 )Ψ (τ0 ).\n\n(C6)\n\nand\n\nTherefore, the equation for the evolution operator of the quasiclassical spin wave function takes the form\nU̇ (τ, τ0 ) = ZU (τ, τ0 ),\n\n(C7)\n\nwhere Z must obey the relations\n[γ μ , Z] = Ωμν γν ,\n\n[γ 5 γ μ , Z] = Ωμν γ 5 γν .\n\n(C8)\n\nIt is obvious that\nZ=\n\n1\nΩμν σ μν .\n4\n\n(C9)\n\nUsing the relations\n1 μν\nF σμν = iγ 5⋆F μν uν γμ uα γα + F μν uν γμ uα γα ,\n2\n\n(C10)\n\nF μν σμν = iγ 5⋆F μν σμν ,\n\n(C11)\n\nand\n\nwe find\nZ = iγ 5\n\n\u0011\n\u0010 e\nF μν γμ γν + μ0 F μν uν γμ γ α uα .\n4m\n\n(C12)\n\nWe must take into account that the electric charge of neutrino e is equal to zero. Replacing μ0 ⋆F μν to μ0 ⋆F μν +\n(f u − uμ f ν )/2 (see (3.3) and (3.4)), and introducing the notation q μ = muμ we obtain equation (3.7).\nμ ν\n\nAppendix D\n\nLet us prove the system (3.24) is orthonormal, i.e.\nZ\n2\nN+ = dx Ψq†′ ζ ′ (x)Ψqζ (x) = (2π)3 δ 3 (q − q′ )δζζ ′\nfor the solutions with the same signs of energy and\nZ\n2\nN− = dx Ψq†′ ζ ′ (x)Ψqζ (x) = 0\n\n(D1)\n\n(D2)\n\nfor the solutions with the different signs of energy. After integration we get\nN2+ = (2π)3\n\nq\nq\n\u0010\n\u0011†\nJζ ′ (±q ′ ) Jζ (±q) ψζ±′ (q ′ ) ψζ± (q)δ 3 (Pζ ′ (±q ′ ) − Pζ (±q)),\n\n(D3)\n\nq\nq\n\u0010\n\u0011†\nJζ ′ (±q ′ ) Jζ (∓q) ψζ±′ (q ′ ) ψζ∓ (q)δ 3 (Pζ ′ (±q ′ ) − Pζ (∓q)),\n\n(D4)\n\nN2− = (2π)3\n\nwhere the conventional eigenspinors ψζ± (q) obey the equations (γ μ qμ ∓ m)ψζ± (q) = 0; Jζ (q) is the Jacobian for\ntransition between the variables q μ and Pζμ (q).\n\n\f18\nIn the standard representation for the gamma matrices, we obtain explicitly [47]\n\u0012 0\n\u0013\n1\n(q + m) ωζ+\nψζ+ (q) = p\n,\n(σ * q) ωζ+\n2q 0 (q 0 + m)\n\u0013\n\u0012\n(σ * q) ωζ−\n1\n−\nψζ (q) = p\n,\n−\n0\n2q 0 (q 0 + m) (q + m) ωζ\np\nwhere σi are the Pauli matrices and factor 1/ 2q 0 (q 0 + m) has been included for normalization (3.11). These spinors\nsatisfy the orthogonality relations\n\u0010\n\n\u0011†\nψζ± (q) γ 0 ψζ∓′ (q) = 0,\n\n\u0010\n\u0011†\nψζ± (q) ψζ±′ (q) = δζζ ′ ,\n\n(D5)\n\nif ωζ± are nonvanishing, but otherwise arbitrary two-component spinors which are chosen such that (ωζ±′ )† ωζ± = δζζ ′ .\nIt is convenient to use the remaining uncertainty in ωζ± to require ψζ± (q) to be eigenstates of the spin projection\noperator\nμ\n− γ 5 γμ Stp\n(q)ψζ± (q) = ζψζ± (q).\n\n(D6)\n\nFor this purpose ωζ± should be eigenspinors of three-dimensional spin projection operator (see (5.4))\n(σ * ζ tp ) ωζ± = ±ζωζ± .\n\n(D7)\n\nTo calculate spinors ωζ± we have an opportunity to choose a special reference frame. Let us take the reference\nframe where f μ = {f, 0, 0, 0}, H = (0, 0, H), and E = 0. It is possible, if f μ is timelike four-vector and the relation\nF μν fν = 0 is fulfilled.\nIn this reference frame the vector of the total polarization is\no\n1 n\nμ\n(q) =\nStp\nq⊥ + qk q̃± /q⊥ , q 0 cos φ, q 0 sin φ, q 0 q̃± /q⊥ ,\n(D8)\nmR±\nand\nζ tp =\n\n1\nq⊥ R±\n\n\u0015\n\u001b\n\u001a \u0014\nq0\n2μ0 Hqk\n±\n2μ\nH\n,\nq 1∓\n0\nf (q 0 + m)\nf\n\n(D9)\n\nwhere\nq\nR± = sign(f ) (1 + 4μ20 H 2 /f 2 ) + (q̃± /q⊥ )2 .\n\nHere we use the notation\np\n(q 1 )2 + (q 2 )2 = q⊥ , q 1 = q⊥ cos φ, q 2 = q⊥ sin φ, q 3 = qk , qk ±2μ0 mH/f = q̃± .\n\n(D10)\n\n(D11)\n\nThe explicit form of spinors ωζ± is\n0\n\n(q +\n\nm) ωζ±\n\n1\n=\nT\n\n\u0012\n\n\u0013\n\u0002 0\n\u0003\n−iφ/2\ne\n(q\n+\nm)\n∓\n2μ\nHq\n0\nk /f\n\u0002\n\u0003 ,\neiφ/2 (q 0 + m)(±ζR± − q̃± /q⊥ ) ∓ 2μ0 Hq⊥ /f\n\n(σ * q) ωζ± =\n\n1\nT\n\n\u0012\n\n(D12)\n\n\u0002\n\u0003\u0013\ne−iφ/2 ±ζR± q⊥ ∓ 2μ0 Hq 0 /f\n,\neiφ/2 [q⊥ − qk (±ζR± − q̃± /q⊥ )]\n\nwhere\n\u0013\u0015\u001b1/2\n\u0014\n\u0012\n\u001a\n2μ0 Hq⊥\nq̃±\n.\n±\nT± = 2R± R± ∓ ζ\nq⊥\nf (q 0 + m)\n\n(D13)\n\n\f19\nIn the selected reference frame the components of canonical momentum for positive-energy and for negative-energy\nsolutions, respectively, are\n\u0012\n\u0013\nf ∓ 2μ0 Hqk /m\n1\nPζ (±q) = ±q⊥ cos φ 1 + ζ\n,\n2q⊥ R±\n\u0013\n\u0012\nf ∓ 2μ0 Hqk /m\n(D14)\n,\nPζ2 (±q) = ±q⊥ sin φ 1 + ζ\n2q⊥\u0013R±\n\u0012\nf ∓ 2μ0 Hqk /m\n− 2μ0 mH/f.\nPζ3 (±q) = ±q̃± 1 + ζ\n2q⊥ R±\nConsider at first the ζ ′ = ζ case. In this case on the right-hand side of equation (D3) we have\nδ 3 (Pζ (±q ′ ) − Pζ (±q)) = |Jζ (±q)|−1 δ 3 (q′ − q),\n2\n\n(D15)\n\nμ\n\nand as far as q ′ = q 2 = m2 we get q ′ = q μ . Therefore,\nN2+ = (2π)3 δ 3 (q − q′ ).\n\n(D16)\n\nIn equation (D4) the delta function provides the relation\nq + q′ = 0.\n\n(D17)\n\nN2− = 0.\n\n(D18)\n\nSo we have\n\nConsider next the ζ ′ 6= ζ case. The delta function provides the following relations:\n′\n′\nq̃±\n/q⊥\n= q̃± /q⊥ ,\n\nφ′ = φ,\n\n(D19)\n\non the right-hand side of equation (D3) and relations\n′\n′\nq̃±\n/q⊥\n= − q̃∓ /q⊥ ,\n\nφ′ = φ + π,\n\n(D20)\n\non the right-hand side of equation (D4).\nUsing (D19) and (D20) and bearing in mind that ζ ′ = −ζ we find\n\u0010\n\n\u0011†\n\u0010\n\u0011†\n±\n±\nψ−ζ\n(q ′ ) ψζ± (q) = 0, ψ−ζ\n(q ′ ) ψζ∓ (q) = 0.\n\n(D21)\n\nThus we have proved relations (D1) and (D2), i.e. the orthogonality of system (3.24). It is easy to verify that for\nthe cases where four-vector f μ is spacelike or lightlike we can get the same result.\n\n[1] Y. Fukuda et al. (Super-Kamiokande Collaboration), Phys. Rev. Lett. 81, 1562 (1998); Q. R. Ahmad et al. (SNO Collaboration), Phys. Rev. Lett. 87, 071301 (2001); K. Eguchi et al. (KamLAND Collaboration), Phys. Rev. Lett. 90, 021802\n(2003); M. N. Ahn et al. (K2K Collaboration), Phys. Rev. Lett. 90, 041801 (2003).\n[2] R. N. Mohapatra and P. B. Pal, Massive Neutrinos in Physics and Astrophysics (World Scientific, Singapore, 2004); C.\nGiunti and C. W. Kim, Fundamentals of Neutrino Physics and Astrophysics (Oxford University Press, New York, 2007).\n[3] B. Pontecorvo, Zh. Eksp. Teor. Fiz. 33, 549 (1957) [Sov. Phys. JETP 6, 429 (1958)]; B. Pontecorvo, Zh. Eksp. Teor. Fiz.\n34, 247 (1958) [Sov. Phys. JETP 7, 172 (1958)].\n[4] Z. Maki, M. Nakagawa and S. Sakata Prog. Theor. Phys. 28, 870 (1962).\n[5] B. W. Lee and R. E. Shrock, Phys. Rev. D 16, 1444 (1977).\n[6] M. B. Voloshin, M. I. Vysotskii, and L. B. Okun, Zh. Eksp. Teor. Fiz. 91, 754 (1986) [Sov. Phys. JETP 64, 446 (1986)];\nC.-S. Lim and W. J. Marciano, Phys. Rev. D 37, 1368 (1988); E. Kh. Akhmedov, Phys. Lett. B 213, 64 (1988); A. Yu.\nSmirnov, Phys. Lett. B 260, 161 (1991); E. Kh. Akhmedov, S. T. Petcov, and A. Yu. Smirnov, Phys. Rev. D 48, 2167\n(1993) (arXiv:hep-ph/9301211).\n[7] H. Nunokawa, V. B. Semikoz, A. Yu. Smirnov, and J. W. F. Valle, Nucl. Phys. B 501, 17 (1997) (arXiv:hep-ph/9701420).\n[8] V. Bargmann, L. Michel, and V. L. Telegdi, Phys. Rev. Lett. 2, 435 (1959).\n[9] A. E. Lobanov and O. S. Pavlova, Teor. Mat. Fiz. 121, 509 (1999) [Theor. Math. Phys. 121, 1691 (1999)].\n\n\f20\n[10] The existence of low-energy neutrinos that form a cosmic neutrino background - an analogue of the cosmic microwave\nbackground - is a fundamental prediction of standard big bang cosmology. The process of ultra–high-energy neutrino\nscattering onto relic light neutrinos in the galactic halo is a possible source of the highest energy extragalactic cosmic rays\n(see D. Fargion, B. Mele, and A. Salis, Astrophys. J. 517, 725 (1999) (arXiv:astro-ph/9710029); A. Ringwald, Nuclear\nPhysics A 827, 501c (2009) (arXiv:0901.1529. [astro-ph]) and the references cited therein).\n[11] L. Wolfenstein, Phys. Rev. D 17, 2369 (1978).\n[12] W. H. Furry, Phys. Rev. 81, 115 (1951).\n[13] C. Amsler et al. (Particle Data Group), Phys. Lett. B 667, 1 (2008).\n[14] W. Pauli, Rev. Mod. Phys. 13, (No 3) 203 (1941).\n[15] K. Fujikawa and R. E. Shrock, Phys. Rev. Lett. 45, 963 (1980).\n[16] S. P. Mikheyev and A. Yu. Smirnov, Yad. Fiz. 42, 1441 (1985) [Sov. J. Nucl. Phys. 42, 913 (1985)].\n[17] A. E. Lobanov, Dokl. Akad. Nauk Ser. Fiz. 402, 475 (2005) [Dokl. Phys. 50, 286 (2005)] (arXiv:hep-ph/0411342).\n[18] A. Studenikin and A. Ternov, Phys. Lett. B 608, 107 (2005) (arXiv:hep-ph/0412408).\n[19] A. E. Lobanov, Phys. Lett. B 619, 136 (2005) (arXiv:hep-ph/0506007).\n[20] P. B. Pal and T. N. Pham, Phys. Rev. D 40, 259 (1989); J. F. Nieves, Phys. Rev. D 40, 866 (1989); D. Nötzold and G.\nRaffelt, Nucl. Phys. B 307, 924 (1988); J. Pantaleone, Phys. Lett. B 268, 227 (1991); K. Kiers and N. Weiss, Phys. Rev.\nD 56, 5776 (1997) (arXiv:hep-ph/9709451).\n[21] S. L. Shapiro and S. A. Teukolsky, Black Holes, White Dwarfs and Neutron Stars: The Physics of Compact Objects (Wiley,\nNew York, 1983).\n[22] S. M. Carroll, G. B. Field, and R. Jackiw, Phys. Rev. D 41, 1231 (1990); D. Colladay and V. A. Kostelecký, Phys.\nRev. D 55, 6760 (1997)(arXiv:hep-ph/9703464); D. Colladay and V. A. Kostelecký, Phys. Rev. D 58, 116002 (1998)\n(arXiv:hep-ph/9809521); S. Coleman and S. L. Glashow, Phys. Rev. D 59, 116008 (1999) (arXiv:hep-ph/9812418).\n[23] Y. Nambu, in Proceedings of the Third Meeting on CPT and Lorentz Symmetry, ed. V. A. Kostelecký, (World Scientific,\nSingapore, 2005), 1.\n[24] L. D. Landau and R. Peierls, Zs. f. Phys. 69, 56 (1931).\n[25] N. N. Bogolubov, A. A. Logunov, A. I. Oksak, and I. T. Todorov, General Principles of Quantum Field Theory (Kluwer\nAcademic Publishers, Dordrecht, 1990).\n[26] V. G. Bagrov and D. M. Gitman, Exact Solutions of Relativistic Wave Equations (Kluwer Academic Publishers, Dordrecht,\n1990).\n[27] G. Darboux, C. R. Acad. Sci. 94, 1456 (1882).\n[28] D. Zwanziger, Phys. Rev. 139, B 1318 (1965).\n[29] A. E. Lobanov and A. I. Studenikin, Phys. Lett. B 515, 94 (2001) (arXiv:hep-ph/0106101).\n[30] D. M. Fradkin and R. H. Good, Jr., Rev. Mod. Phys. 33, 343 (1961).\n[31] A. E. Lobanov and O. S. Pavlova, Vestn. MGU. Fiz. Astron. 40, No. 4, 3 (1999) [Mosc. Univ. Phys. Bull. 54, No. 4, 1\n(1999)].\n[32] A. E. Lobanov, J. Phys. A: Math. Theor. 39, 7517 (2006) (arXiv:hep-ph/0311021).\n[33] We use this name because in radiative transitions due to the self-polarization effect [34], the neutral particle obtains a\npolarization defined by this vector [32] (see also [35]).\n[34] A. A. Sokolov and I. M. Ternov, Synchrotron radiation (Academie Verlag, Berlin, 1968; Pergamon Press, New York, 1968).\n[35] V. A. Bordovitsyn, I. M. Ternov, and V. G. Bagrov, Uspekhi Fiz. Nauk 165, 1083 (1995) [Physics – Uspekhi 38, 1037\n(1995)].\n[36] V. Ch. Zhukovsky, A. E. Lobanov, and E. M. Murchikova, Phys. Rev. D 73, 065016 (2006) (arXiv:hep-ph/051039).\n[37] A. E. Lobanov, Phys. Lett. B 637, 274 (2006) (arXiv:hep-ph/0602174).\n[38] The action of the pseudodifferential operator on the function f (x) is defined by the formula\nZZ\n1\nAf (x) =\nei((x−y)ξ) a(x, y, ξ)f (y) dn y dn ξ.\n(2π)n\nPseudodifferential operators are extended to Fourier integral operators by\nZZ\n1\nF f (x) =\neiφ(x,y,ξ) a(x, y, ξ)f (y) dn y dn ξ.\n(2π)n\n\n[39]\n[40]\n[41]\n[42]\n[43]\n[44]\n\nIn more detail see, for example, F. Treves, Introduction to Pseudodifferential and Fourier Integral Operators (Plenum Press,\nNew York, 1982).\nR. Lehnert, Phys. Rev. D 74, 125001 (2006) (arXiv:hep-th/0609162).\nI. A. Malkin and V. I. Manko, Dynamic symmetries and coherent states of quantum systems (Nauka, Moscow, 1979) [in\nRussian]; A. M. Perelomov, Generalized coherent states and their applications (Springer Verlag, Berlin, 1986).\nL. D. Landau and E. M. Lifshitz, Electrodynamics of Continuous Media (Pergamon Press, New York, 1984).\nI. M. Ternov, V. G. Bagrov, and A. M. Khapaev, Zh. Eksp. Teor. Fiz. 48, 921 (1965) [Sov. Phys. JETP 21, 613 (1965)].\nO. Klein, Zs. f. Phys. 53, 157 (1929).\nA. V. Borisov, A. I. Ternov, and V. Ch. Zhukovsky, Izv. Vyssh. Uchebn. Zaved. Fiz. 31, No. 3, 64 (1988) [Sov. Phys. J.\n31, 228 (1988)]; A. E. Bernardini, J. Phys. A: Math. Theor. 39, 7089 (2006) (arXiv:hep-th/0606239); A. E. Bernardini,\nInt. J. Theor. Phys. 46, 1562 (2007) (arXiv:hep-ph/0611342); M. Dvornikov, J. Phys. G: Nucl. Part. 35, 025003 (2008)\n(arXiv:0708.2328 [hep-ph]).\n\n\f21\n[45] L. L. Foldy, Phys. Rev. 87, 688 (1952).\n[46] H. Bacry, Lectures on group theory and particle theory (Gordon and Breach Sci. Publishers, New York, 1977).\n[47] V. B. Berestetskii, E. M. Lifshitz, and L. P. Pitaevskii, Quantum Electrodynamics (Pergamon Press, New York, 1982).\n\n\f"}