{"id": "http://arxiv.org/abs/0805.1114v1", "guidislink": true, "updated": "2008-05-08T07:18:43Z", "updated_parsed": [2008, 5, 8, 7, 18, 43, 3, 129, 0], "published": "2008-05-08T07:18:43Z", "published_parsed": [2008, 5, 8, 7, 18, 43, 3, 129, 0], "title": "The impedance-matched reduced acoustic cloaking with realizable mass and\n  its layered design", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0805.1945%2C0805.4793%2C0805.1990%2C0805.3746%2C0805.1114%2C0805.4579%2C0805.0091%2C0805.2187%2C0805.0409%2C0805.1710%2C0805.1465%2C0805.3332%2C0805.2877%2C0805.1179%2C0805.0356%2C0805.3096%2C0805.2610%2C0805.0051%2C0805.1965%2C0805.4645%2C0805.2806%2C0805.4353%2C0805.1828%2C0805.2151%2C0805.1242%2C0805.1255%2C0805.4459%2C0805.2989%2C0805.0532%2C0805.3540%2C0805.1453%2C0805.2598%2C0805.4593%2C0805.4340%2C0805.2065%2C0805.3068%2C0805.1416%2C0805.3236%2C0805.1789%2C0805.2162%2C0805.2507%2C0805.2383%2C0805.3770%2C0805.0952%2C0805.2797%2C0805.2415%2C0805.2763%2C0805.2852%2C0805.1533%2C0805.3342%2C0805.1957%2C0805.3330%2C0805.4496%2C0805.4563%2C0805.1967%2C0805.2498%2C0805.3428%2C0805.3649%2C0805.4078%2C0805.0258%2C0805.1103%2C0805.0302%2C0805.1817%2C0805.2315%2C0805.2905%2C0805.1535%2C0805.3317%2C0805.3814%2C0805.2244%2C0805.2446%2C0805.4538%2C0805.1253%2C0805.4753%2C0805.1836%2C0805.2214%2C0805.2626%2C0805.4302%2C0805.0160%2C0805.4219%2C0805.2858%2C0805.4735%2C0805.3811%2C0805.0484%2C0805.4707%2C0805.1437%2C0805.3015%2C0805.3959%2C0805.2253%2C0805.2650%2C0805.2718%2C0805.3645%2C0805.3167%2C0805.4749%2C0805.3666%2C0805.0705%2C0805.3203%2C0805.2058%2C0805.2635%2C0805.1441%2C0805.3879%2C0805.4583&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "The impedance-matched reduced acoustic cloaking with realizable mass and\n  its layered design"}, "summary": "The authors present an impedance-matched reduced version of acoustic cloaking\nwhose mass is in a reasonable range. A layered cloak design with isotropic\nmaterial is also proposed for the reduced cloak. Numerical calculations from\nthe transfer matrix methods show that the present layered cloak can reduce the\nscattering of an air cylinder substantially.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0805.1945%2C0805.4793%2C0805.1990%2C0805.3746%2C0805.1114%2C0805.4579%2C0805.0091%2C0805.2187%2C0805.0409%2C0805.1710%2C0805.1465%2C0805.3332%2C0805.2877%2C0805.1179%2C0805.0356%2C0805.3096%2C0805.2610%2C0805.0051%2C0805.1965%2C0805.4645%2C0805.2806%2C0805.4353%2C0805.1828%2C0805.2151%2C0805.1242%2C0805.1255%2C0805.4459%2C0805.2989%2C0805.0532%2C0805.3540%2C0805.1453%2C0805.2598%2C0805.4593%2C0805.4340%2C0805.2065%2C0805.3068%2C0805.1416%2C0805.3236%2C0805.1789%2C0805.2162%2C0805.2507%2C0805.2383%2C0805.3770%2C0805.0952%2C0805.2797%2C0805.2415%2C0805.2763%2C0805.2852%2C0805.1533%2C0805.3342%2C0805.1957%2C0805.3330%2C0805.4496%2C0805.4563%2C0805.1967%2C0805.2498%2C0805.3428%2C0805.3649%2C0805.4078%2C0805.0258%2C0805.1103%2C0805.0302%2C0805.1817%2C0805.2315%2C0805.2905%2C0805.1535%2C0805.3317%2C0805.3814%2C0805.2244%2C0805.2446%2C0805.4538%2C0805.1253%2C0805.4753%2C0805.1836%2C0805.2214%2C0805.2626%2C0805.4302%2C0805.0160%2C0805.4219%2C0805.2858%2C0805.4735%2C0805.3811%2C0805.0484%2C0805.4707%2C0805.1437%2C0805.3015%2C0805.3959%2C0805.2253%2C0805.2650%2C0805.2718%2C0805.3645%2C0805.3167%2C0805.4749%2C0805.3666%2C0805.0705%2C0805.3203%2C0805.2058%2C0805.2635%2C0805.1441%2C0805.3879%2C0805.4583&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "The authors present an impedance-matched reduced version of acoustic cloaking\nwhose mass is in a reasonable range. A layered cloak design with isotropic\nmaterial is also proposed for the reduced cloak. Numerical calculations from\nthe transfer matrix methods show that the present layered cloak can reduce the\nscattering of an air cylinder substantially."}, "authors": ["Huan-Yang Chen", "Tao Yang", "Xu-Dong Luo", "Hong-Ru Ma"], "author_detail": {"name": "Hong-Ru Ma"}, "author": "Hong-Ru Ma", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1088/0256-307X/25/10/049", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/0805.1114v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0805.1114v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "11 pages, 3 figures", "arxiv_primary_category": {"term": "cond-mat.mtrl-sci", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cond-mat.mtrl-sci", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "cond-mat.other", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0805.1114v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0805.1114v1", "journal_reference": "Chinese Phys. Lett. 25 3696-3699 (2008)", "doi": "10.1088/0256-307X/25/10/049", "fulltext": "The impedance-matched reduced acoustic cloaking with\nrealizable mass and its layered design\nHuan-Yang Chen, Tao Yang, Xu-Dong Luo, and Hong-Ru Ma\nDepartment of Physics, Shanghai Jiao Tong University, Shanghai 200240,\nPeople's Republic of China\n\nAbstract\nThe authors present an impedance-matched reduced version of acoustic cloaking\nwhose mass is in a reasonable range. A layered cloak design with isotropic material is\nalso proposed for the reduced cloak. Numerical calculations from the transfer matrix\nmethods show that the present layered cloak can reduce the scattering of an air\ncylinder substantially.\n\n*To whom correspondence should be addressed. E-mail: moroshine@hotmail.com\n\n\fThe studies of transformation media and cloaking are very hot topics in recent years.\nPendry et al. [1] and Leonhardt [2] first proposed the concept of transformation media\nin the context of electromagnetic (EM) waves independently based on the invariance\nof Maxwell's equations under coordinate transformation. With this concept, a scheme\nof achieving the EM cloaking was suggested [1] from the singular transformations\ngiven by Greenleaf et al. [3]. Later on, the two dimensional (2D) acoustic cloaking [4]\nwas proposed from the one to one mapping of the Maxwell's equations and the\nacoustic wave equation in two dimension. This mapping has the hint that the acoustic\nwave equation may also be invariant under coordinate transformation [5]. Eventually,\nChen and Chan [6] proved the invariance of the acoustic wave equation by mapping it\nto the direct current conductivity equation [3, 5]. With this mapping, the concept of\nacoustic transformation media was naturally obtained, which means that the acoustic\nwaves are also freely controllable. The three dimensional (3D) acoustic cloaking was\nthen proposed as an example of the general result. Cummer et al. [7] also obtained the\nsame parameters of 3D acoustic cloaking from the Mie scattering models. However,\nboth 2D and 3D ideal acoustic cloaking have a serious drawback that infinite mass is\nresulted [8, 9]. To overcome this drawback, Norris [8] suggested a kind of imperfect\nacoustic cloaking using finite mass by introducing small perturbations to the inner\nradius which are similar to the case of imperfect EM cloaking [10]. He also suggested\nanother method [9] to realize the perfect acoustic cloaking with finite mass by using\nanisotropic material called \"pentamode material\" [5] with anisotropic stiffness.\nIn this letter, we propose a reduced version of acoustic cloaking by keeping its\n\n\fprincipal refractive indexes unchanged [11, 12] while the impedance of the outer\nboundary matches with the impedance of the background [13, 14]. This kind of\nreduced acoustic cloaking shows good cloaking effect and has realizable mass. An\nexplicit design based on this reduced acoustic cloaking is also given by employing the\nmethods of acoustic layered systems [15, 16]. The properties of the layered reduced\nacoustic cloaking are also studied by using the transfer matrix methods.\nThe parameters of the 2D ideal acoustic cloaking proposed by Cummer and\nSchurig [4] are,\n\nρr\nr\nρ ⊥ ρθ r − a κ 0\nb 2 r −a\n=\n=\n=\n=(\n,\n,\n)\n,\nρ0 r − a ρ0 ρ0\nr\nκ\nb−a\nr\n\n(1)\n\nwhere ρ0 and κ 0 are the density and bulk modulus of the background medium, a\nand b are the inner and outer radii of the cloak. The parameters for 3D acoustic\ncloaking were given by Chen and Chan [6] and Cummer et al. [7] independently as,\n\nρ r b − a r 2 ρ ⊥ ρθ ρφ b − a κ 0\nb 3 r−a 2\n=\n(\n) ,\n=\n=\n=\n,\n=(\n) (\n).\nb r−a\nb\nb−a\nr\nρ0\nρ0 ρ0 ρ0\nκ\n\n(2)\n\nIn both cases the density diverges at the inner boundary which is hard to realize in\npractice and reduced forms are necessary in order to manufacture the acoustic\ncloaking. The reduction from ideal cloaking is to loosen the requirements on density\nand modulus by combining these two requirements into one through the principal\nrefractive index. The principal refractive indexes of acoustic waves, defined by the\nratio of density and bulk modulus, can be written in a unified form for both 2D and\n3D acoustic cloak as\nnr2 ρ ⊥ / κ\nb 2 r−a 2\n) (\n) ,\n=\n=(\n2\nn0 ρ0 / κ 0\nb−a\nr\n\nn⊥2\nρ /κ\nb 2\n).\n= r\n=(\n2\nn0 ρ0 / κ 0\nb−a\n\n(3)\n\n\fThis formula forms the key starting point of our proposed reduced acoustic cloaking.\nBy loosening the requirements on the density and modulus independently, the\ncloaking is no longer ideal. However, we may use this freedom to design acoustic\ncloaking which has some imperfections but is realizable in practice. Suppose that κ\nis a continuous function of r , i.e.\n\nκ\n= λ (r ) , to obtain,\nκ0\n\nρr\nb 2 ρ⊥\nb 2 r−a 2\n= λ (r )(\n) ,\n= λ (r )(\n) (\n) ,\nρ0\nρ0\nb−a\nb−a\nr\n\n(4)\n\nfor both 2D and 3D acoustic cloaking. The cloaks with the above parameters are\ncalled the reduced cloak. The guide line for choosing a proper λ (r ) is to match the\nimpedance on outer boundary between the cloak and the background media. We can\nsimply choose\n\nκ\nb−a\n= λ (r ) =\nto realize an impedance-matched version. With this\nκ0\nb\n\nchoice, the parameters become,\n\nρr\nb\nρ⊥\nb r −a 2 κ b−a\n=\n,\n=\n(\n) ,\n=\n.\nρ0 b − a ρ0 b − a r\nκ0\nb\n\n(5)\n\nThis set of parameters requires only ρ⊥ to be position dependent. The density tensor\nis finite for all positions and realizable for the future designs. It should be noted that\nthe above version is not the only design of an impedance-matched reduced cloak.\nOther choices of κ is also possible to get the impedance-matched design.\nNow we come to design a feasible acoustic cloak using acoustic layered systems.\nThe acoustic layered systems with two kinds of alternating isotropic materials (A and\nB) can produce a transversely isotropic system whose effective density becomes a\ntensor. Suppose the densities of the isotropic materials are ρ A and ρ B , and the bulk\n\n\fmodulus are κ A and κ B . Then a structure consists of concentric layers of A and B\nwith the same thicknesses, which are much smaller compared to the incident\nwavelength, has the following effective density tensor and bulk modulus [15, 16],\n\nρr =\n\nρ A + ρB\n2\n\n, ρ⊥ =\n\n2ρ A ρB\n2κ Aκ B\n, κ=\n.\nρ A + ρB\nκA + κB\n\n(6)\n\nThe design of the reduced cloak is a structure of concentric multilayer of the effective\nAB layers with different effective material parameters. Using the two-step approach\n[15, 17], we can obtain the required density and modulus for each layer of the cloak.\nSuppose the cloak consist 2N layers of isotropic materials. Then the densities of each\nlayer are,\n\nρ 2i −1\nr −a 2\nb\n(1 − 1 − ( 2i −1\n) ), i =1,2,3,...,N,\n=\nb−a\nr2i −1\nρ0\n\n(7a)\n\nρ 2i\nr −a 2\nb\n(1 + 1 − ( 2i\n) ), i =1,2,3,...,N,\n=\nρ0 b − a\nr2i\n\n(7b)\n\nwhere ri = a + (2i − 1)\n\nb−a\n, i = 1, 2,3,..., 2 N . All the layers share the same modulus\n4N\n\nκ b−a\n=\n. Notice that for the reduced cloak the density ratios ρi / ρ0 should locate\nκ0\nb\nat the range [0,\n\nb\nb−a 2\nb\nb−a 2\n2b\n(1 − 1 − (\n) )] and [\n(1 + 1 − (\n) ),\n] . To\nb−a\nb\nb−a\nb\nb−a\n\nbe concrete and comparable with results of ideal case, we now focus on the 2D case\nand use parameters in ref [15]. The number of effective AB layers is N=20 and\nb=2a=2m. The density ratios locate at [0, 0.27] and [3.74, 4], which are more feasible\nthan the ideal case whose density ratios locate at [0.025, 0.267] and [3.73, 39.99]. The\nmaximum of the density in the reduced case is much smaller than the one in the ideal\ncase since the infinite mass no longer exists in the reduced case. The plane wave is\n\n\fincident from left to right, with a wavelength equals to 1 m. The background is water,\n\nρ0 = 998 kg / m3 and κ 0 = 2.19 GPa . Since the air bubble will cause great scattering\nin the water, we will use the present layered cloak to reduce the scattering of an air\ncore and show the good cloaking effect. The parameters of air are, ρair = 1.25 kg / m3\nand cair = 343 m / s .\nFig. 1a shows the calculated acoustic pressure field distribution for incident plane\nwave scattered by an air cylinder with the radius a=1m in the water. From the figure,\nwe see that the scattering in this case is very large. Fig. 1b shows the acoustic pressure\nfield distribution for incident plane wave scattered by the air cylinder surrounded with\nthe present layered cloak. The scattering is greatly reduced when compared to Fig. 1a.\nThe scattering amplitude f (θ ) [18] normalized by that of the incident wave are\nplotted in Fig. 2. The dashed black line shows the one for a bare air cylinder in water.\nIt causes large scattering for all the angles especially for the forward direction. The\nsolid red line denotes the scattering amplitude for the scaterer surrounded with the\nlayered cloak from the ideal case [15]. And it reduces the scattering a lot for all the\nangles. However, there are still some detectable scattering in the forward direction.\nThat is due to the small number of layers, it will be improved if the layer number is\nincreased. The blue dotted line denotes the scattering amplitude for the scaterer\nsurrounded with the present layered cloak. It also has good cloaking effect for all the\nangles except for some detectable scattering in the forward direction. Part of this\nscattering is due to the small number of layer as in the ideal case, and another\ncontribution is from the reduced version intrinsically as will be discussed below.\n\n\fThe total cross section σ [18] of the bare scaterer is 0.7255, when the scaterer is\nsurrounded with the layered cloak from the ideal case, its total cross section is\nreduced to 0.035 (which is 4.82% of the bare case), when the scaterer is surrounded\nwith the present layered cloak, its total cross section becomes 0.0849 (which is 11.7%\nof the bare case). Fig. 3a shows the scattering amplitude f (θ = 0) for cloaks of\ndifferent layer number 2N, which denotes the scattering in the forward direction.\nWhen 2N is large enough, the scattering amplitude\n\nf (θ = 0) for ideal case\n\napproaches to zero while the one for reduced case tends to a very small positive value\nwhich is about 2. This is the intrinsic value due to the reduction of cloaking from the\nideal case. The relationship between the total scattering cross section and 2N is\nsimilar with the forward scattering amplitude, which is plotted in Fig. 3b. All the\nabove calculations are from the well-known transfer matrix methods [18]. Extension\nof the current reduced acoustic cloaking and the layered system design to 3D is\nstraight forward, and the results are similar.\nIn conclusion, we have proposed an impedance-matched reduced acoustic\ncloaking with realizable mass which will be useful for the future design. We\nsuggested a design using acoustic layered systems and studied the layered cloak using\nthe transfer matrix methods. The present layered cloak shows good cloaking effect.\n\n\fAcknowledgements\nThis work was supported by the National Natural Science Foundation of China under\ngrand No.10334020 and in part by the National Minister of Education Program for\nChangjiang Scholars and Innovative Research Team in University.\n\nReference\n[1] J. B. Pendry, D. Schurig, and D. R. Smith, Science 312, 1780 (2006).\n[2] U. Leonhardt, Science 312, 1777 (2006).\n[3] A. Greenleaf, M. Lassas, and G. Uhlmann, Math. Res. Lett. 10, 685 (2003); A.\nGreenleaf, M. Lassas, and G. Uhlmann, Physiol. Meas 24, 413 (2003).\n[4] S. A. Cummer and D. Schurig, New J. Phys. 9, 45 (2007).\n[5] G. W. Milton, M. Briane, and J. R. Willis, New J. Phys. 8, 248 (2006).\n[6] H. Y. Chen and C. T. Chan, Appl. Phys. Lett. 91, 183518 (2007).\n[7] S. A. Cummer, B.-I. Popa, D. Schurig, D. R. Smith, J. B. Pendry, M. Rahm, and A.\nStarr, Phys. Rev. Lett. 100, 024301 (2008).\n[8] A. N. Norris, URL http://arxiv.org/abs/0802.0701 (2008).\n[9] A. N. Norris, URL http://arxiv.org/abs/0805.0080 (2008), published online on Proc.\nR. Soc. A 2008.\n[10] H. Y. Chen, Z. Liang, P. Yao, X. Jiang, H. R. Ma and C. T. Chan, Phys. Rev. B\n76, 241104(R) (2007).\n\n[11] S. A. Cummer, B.-I. Popa, D. Schurig, D. R. Smith, and J. B. Pendry,\nPhys. Rev. E 74, 036621 (2006); D. Schurig, J. J. Mock, B. J. Justice, S. A. Cummer, J.\n\n\fB. Pendry, A. F. Starr, and D. R. Smith, Science 314, 977 (2006).\n[12] W. Cai, U. K. Chettiar, A. V. Kildishev, and V. M. Shalaev, Nat. Photonics 1, 224\n(2007).\n[13] W. Cai, U. K. Chettiar, A. V. Kildishev, V. M. Shalaev, and G. W. Milton, Appl.\nPhys. Lett. 91, 111105 (2007).\n[14] M. Yan, Z. Ruan, and M. Qiu, Opt. Express 15, 17772 (2007).\n[15] Y. Cheng, F. Yang, J. Y. Xu, and X. J. Liu, Appl. Phys. Lett. 92, 151913 (2007).\n[16] M. Schoenberg and P. N. Sen, J. Acoust. Soc. Am. 73, 61 (1983).\n[17] Y. Huang, Y. Feng and T. Jiang, Opt. Express 18, 11133 (2007).\n[18] L.-W. Cai and J. Sánchez-Dehesa, New J. Phys. 9, 450 (2007).\n\nFig. 1 (Color online) Acoustic pressure field distribution near an air cylinder (a)\nwithout cloak; (b) with the present layered cloak.\n\n\fFig. 2 (Color online) Scattering form factors for three cases: bare air cylinder only\n(denoted by dashed black line), the scaterer with layered cloak from ideal case\n(denoted by solid red line), the scaterer with the present layered cloak (denoted by\ndotted blue line).\n\n\fFig. 3 (Color online) (a) Scattering form factors for the forward direction for cloaks\nwith different layer number (2N). (b) Total scattering cross section for cloaks with\ndifferent layer number (2N). The blue circle symbols denote the reduced case while\nthe red squire symbols denote the ideal case.\n\n\f"}