{"id": "http://arxiv.org/abs/1111.7012v2", "guidislink": true, "updated": "2012-04-12T05:20:00Z", "updated_parsed": [2012, 4, 12, 5, 20, 0, 3, 103, 0], "published": "2011-11-29T23:08:59Z", "published_parsed": [2011, 11, 29, 23, 8, 59, 1, 333, 0], "title": "Axisymmetric Nonlinear Waves And Structures in Hall Plasmas", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1111.0850%2C1111.4175%2C1111.6854%2C1111.2440%2C1111.4083%2C1111.5584%2C1111.1337%2C1111.6293%2C1111.2228%2C1111.0720%2C1111.5403%2C1111.6145%2C1111.2205%2C1111.0210%2C1111.4874%2C1111.7094%2C1111.3263%2C1111.1485%2C1111.3862%2C1111.0807%2C1111.2647%2C1111.5884%2C1111.5804%2C1111.4723%2C1111.3949%2C1111.0500%2C1111.2064%2C1111.5820%2C1111.7268%2C1111.1553%2C1111.5378%2C1111.2778%2C1111.4139%2C1111.6750%2C1111.5802%2C1111.0339%2C1111.2428%2C1111.3571%2C1111.5561%2C1111.2533%2C1111.6938%2C1111.2960%2C1111.1934%2C1111.4832%2C1111.0419%2C1111.1865%2C1111.5348%2C1111.6424%2C1111.4237%2C1111.0714%2C1111.3387%2C1111.1195%2C1111.5779%2C1111.1393%2C1111.3460%2C1111.6813%2C1111.2202%2C1111.2672%2C1111.7012%2C1111.1683%2C1111.6887%2C1111.0223%2C1111.2548%2C1111.1834%2C1111.3172%2C1111.5252%2C1111.0573%2C1111.1981%2C1111.4286%2C1111.6954%2C1111.5971%2C1111.6946%2C1111.3930%2C1111.3750%2C1111.6163%2C1111.0631%2C1111.5636%2C1111.3062%2C1111.3687%2C1111.6225%2C1111.4025%2C1111.7102%2C1111.5520%2C1111.6291%2C1111.3695%2C1111.7183%2C1111.1760%2C1111.6045%2C1111.6214%2C1111.3090%2C1111.4159%2C1111.7091%2C1111.4432%2C1111.4388%2C1111.4367%2C1111.2819%2C1111.3037%2C1111.6352%2C1111.4066%2C1111.5865%2C1111.1976&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Axisymmetric Nonlinear Waves And Structures in Hall Plasmas"}, "summary": "In this paper, a general equation for the evolution of an axisymmetric\nmagnetic field in a Hall plasma is derived, with an integral similar to the\nGrad-Shafranov equation. Special solutions arising from curvature -- whistler\ndrift modes that propagate along the electron drift as a Burger's shock, and\nnonlinear periodic and soliton-like solutions to the generalized Grad-Shafranov\nintegral -- are analyzed. We derive analytical and numerical solutions in a\nclassical electron-ion Hall plasma, in which electrons and ions are the only\nspecies in the plasmas. Results may then be applied to the following\nlow-ionized astrophysical plasmas: in protostellar disks, in which the ions may\nbe coupled to the motion of gases; and in molecular clouds and protostellar\njets, in which the much heavier charged dust in a dusty Hall plasma may be\ncollisionally coupled to the gas.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1111.0850%2C1111.4175%2C1111.6854%2C1111.2440%2C1111.4083%2C1111.5584%2C1111.1337%2C1111.6293%2C1111.2228%2C1111.0720%2C1111.5403%2C1111.6145%2C1111.2205%2C1111.0210%2C1111.4874%2C1111.7094%2C1111.3263%2C1111.1485%2C1111.3862%2C1111.0807%2C1111.2647%2C1111.5884%2C1111.5804%2C1111.4723%2C1111.3949%2C1111.0500%2C1111.2064%2C1111.5820%2C1111.7268%2C1111.1553%2C1111.5378%2C1111.2778%2C1111.4139%2C1111.6750%2C1111.5802%2C1111.0339%2C1111.2428%2C1111.3571%2C1111.5561%2C1111.2533%2C1111.6938%2C1111.2960%2C1111.1934%2C1111.4832%2C1111.0419%2C1111.1865%2C1111.5348%2C1111.6424%2C1111.4237%2C1111.0714%2C1111.3387%2C1111.1195%2C1111.5779%2C1111.1393%2C1111.3460%2C1111.6813%2C1111.2202%2C1111.2672%2C1111.7012%2C1111.1683%2C1111.6887%2C1111.0223%2C1111.2548%2C1111.1834%2C1111.3172%2C1111.5252%2C1111.0573%2C1111.1981%2C1111.4286%2C1111.6954%2C1111.5971%2C1111.6946%2C1111.3930%2C1111.3750%2C1111.6163%2C1111.0631%2C1111.5636%2C1111.3062%2C1111.3687%2C1111.6225%2C1111.4025%2C1111.7102%2C1111.5520%2C1111.6291%2C1111.3695%2C1111.7183%2C1111.1760%2C1111.6045%2C1111.6214%2C1111.3090%2C1111.4159%2C1111.7091%2C1111.4432%2C1111.4388%2C1111.4367%2C1111.2819%2C1111.3037%2C1111.6352%2C1111.4066%2C1111.5865%2C1111.1976&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "In this paper, a general equation for the evolution of an axisymmetric\nmagnetic field in a Hall plasma is derived, with an integral similar to the\nGrad-Shafranov equation. Special solutions arising from curvature -- whistler\ndrift modes that propagate along the electron drift as a Burger's shock, and\nnonlinear periodic and soliton-like solutions to the generalized Grad-Shafranov\nintegral -- are analyzed. We derive analytical and numerical solutions in a\nclassical electron-ion Hall plasma, in which electrons and ions are the only\nspecies in the plasmas. Results may then be applied to the following\nlow-ionized astrophysical plasmas: in protostellar disks, in which the ions may\nbe coupled to the motion of gases; and in molecular clouds and protostellar\njets, in which the much heavier charged dust in a dusty Hall plasma may be\ncollisionally coupled to the gas."}, "authors": ["Tanim Islam"], "author_detail": {"name": "Tanim Islam"}, "author": "Tanim Islam", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1063/1.4729681", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1111.7012v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1111.7012v2", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "prepared for submission to the Physics of Plasmas, after referees'\n  comments", "arxiv_primary_category": {"term": "physics.plasm-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "physics.plasm-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "astro-ph.SR", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1111.7012v2", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1111.7012v2", "journal_reference": null, "doi": "10.1063/1.4729681", "fulltext": "Axisymmetric Nonlinear Waves and Structures in Hall Plasmas\nTanim Islam\n\narXiv:1111.7012v2 [physics.plasm-ph] 12 Apr 2012\n\nLawrence Livermore National Laboratory,\nP. O. Box 808, Livermore, CA 94551-0808∗\n(Dated: September 5, 2018)\n\nAbstract\nIn this paper, a general equation for the evolution of an axisymmetric magnetic field in a Hall\nplasma is derived, with an integral similar to the Grad-Shafranov equation. Special solutions\narising from curvature – whistler drift modes that propagate along the electron drift as a Burger's\nshock, and nonlinear periodic and soliton-like solutions to the generalized Grad-Shafranov integral\n– are analyzed. We derive analytical and numerical solutions in a classical electron-ion Hall plasma,\nin which electrons and ions are the only species in the plasmas. Results may then be applied to\nthe following low-ionized astrophysical plasmas: in protostellar disks, in which the ions may be\ncoupled to the motion of gases; and in molecular clouds and protostellar jets, in which the much\nheavier charged dust in a dusty Hall plasma may be collisionally coupled to the gas.\nPACS numbers:\nKeywords:\n\n∗\n\nElectronic address: islam5@llnl.gov\n\n1\n\n\fI.\n\nINTRODUCTION\n\nHall physics is relevant in plasmas in which one or more species of a plasma are nonmagnetized, such as in laboratory plasmas on time scales much shorter than the inverse ion\ncyclotron frequency [1–5]. Within the past thirty years there have been numerous theoretical, experimental, and numerical studies of Hall effects in plasmas. Experimental, numerical,\nand theoretical research on Hall plasmas have focused on planar rather than more complicated geometries.\nWhistler drift modes propagate as a shock wave via density gradients in a Hall plasma [1].\nHowever, the same drift modes, which propagate as shocks, and whistler-like modes with\nperiodicity, may also be seen when considering curvature effects in the absence of density\ngradients. Whistler-like modes with curvature effects have been shown to be important in\nmagnetic reconnection in the earth's magnetosphere [6, 7], and Hall physics is important\nin characterizing reconnection [8, 9]. Linear studies of Hall physics in a low-ionized, highdensity protostellar disk[10, 11] (i.e. cylindrical geometry) have shown that the whistler\nfrequency is also an important parameter in the stability of the rotating disk, and comprehensive numerical studies [12, 13] have borne this out.\nRudakov and others [14–16] have analyzed whistler and whistler drift modes with planar\ngeometry and inhomogeneities in astrophysical dusty plasmas. This paper continues work\ndone by Rudakov[17] and analyzes the nonlinear axisymmetric structure of whistler and\nwhistler drift modes. For simplicity, we construct Hall magnetohydrodynamic (MHD) solutions for an electron-ion plasma, but initially demonstrate their applicability to low-ionized\nastrophysical plasmas.\nThe organization of this paper is as follows. In Sec. (II), we review appropriate dimensional normalizations (length, time, speed, magnetic field) for an electron-ion Hall plasma.\nIn subsequent subsections we describe changes in physics, and corresponding changes in\nscalings, that expand the applicability of Hall MHD to low-ionized electron-ion-gas plasmas (protostellar disks) and to dusty plasmas (protostellar jets). In Sec. (III) we derive\nthe generalized Grad-Shafranov equation, first introduced in [17], as an interesting class of\nsolutions to an axisymmetric Hall plasma. In Sec. (IV) we discuss interesting new solutions\nto the GGS beyond those described in [17]. The concluding section, Sec. (V), summarizes\nthis paper's results and illuminates an alternative explanation of what has been though to\n2\n\n\fbe magnetic bubbles [18] moving along protostellar jets.\n\nII.\n\nHALL PHYSICS AND LENGTH SCALES\n\nIn a standard electron-ion Hall plasma, magnetic fields are tied to the electron, rather\nthan fluid, velocity. As a result, unlike in MHD, we may get penetration of the magnetic\nfield into the bulk medium. Furthermore, for this traditional Hall plasma, one gets these\nscalings\n• The frequency of Hall phenomena are normalized in units of ωci = Zi eB0 / (mi c), the\nion cyclotron frequency. Zi e is the charge of the ion, B0 is the magnetic field strength,\nmi is the proton mass, and c is the speed of light.\n2\n• Length scales are in units of di = c/ωpi , the ion inertial skin depth, where ωpi\n=\n\n4πe2 ni /mi is the ion plasma frequency. ni is the ion number density.\n\n√\n• Velocities of Hall magnetic structures are in units of vA , where vA = B0 / 4πnmi is\nthe Alfvén velocity.\n• Magnetic diffusion is given by the following expression,\nDm =\n\nme νei c2\n.\n4πe2 ni\n\n(1)\n\nνei is the electron-proton collision frequency and me is the electron mass.\nThese scalings are also summarized in Eq. (12). Sec. (II A) and (II B) describe the lowionized astrophysical plasmas in which Hall MHD phenomena may be observed. Different\nphysics results in different dimensional scalings of Hall MHD phenomena. Most notably,\nin these low-ionized plasmas, magnetic diffusion is achieved through ion-gas and dust-gas\ncollisionality, rather than electron-ion collisionality (see, e.g., [11, 14, 19] for a review).\n\nA.\n\nLow Ionized Hall Plasmas\n\nIn low ionized plasmas, charged particles make up only a minority of the number and mass\ndensity of the total medium. In general the electric field consists of inductive, Hall, Ohmic,\nand ambipolar components. In order that the low-ionized plasma may be approximated by\n3\n\n\fa resistive Hall MHD electric field (Ohmic and Hall electric fields) with negligible ambipolar\nelectric fields, the ions must remain collisionally coupled to the gas while electrons must\nremain collisionally uncoupled. Using estimates of those physical regimes in a low-ionized\nplasma where either the inductive, Hall, ambipolar, or Ohmic electric fields dominate [11],\nresistive Hall MHD plasma dynamics may occur where νeg νig ≫ ωci ωce and ωce ≫ νeg . νig\nand νeg are the ion-gas and electron-gas collisional frequencies, and ωce is electron cyclotron\nfrequency.\nIn low-ionized plasmas whose electric fields are resistive Hall MHD in nature, the following\nsubstitutions to an electron-ion Hall plasma are made.\n• We replace νei with νeg in Eq. (1).\n• The ions are coupled to the gas, so that the Alfvén velocity is calculated over the denp\nsity of gas particles vAg = B0 / 4πmg ng , where mg and ng are the averaged molecular\nmass and number density of gas particles, respectively.\n\n• Since Hall plasma time scales are scaled with respect to the ion cyclotron frequency,\nthe Hall length scale (the largest length scale over which we can observe Hall effects)\nis given by this relation:\nvAg\nc\nl∼\n≈\nωci\nωpi\n\n\u0012\n\nmg\nmi\n\n\u00131/2 \u0012\n\nng\nni\n\n\u00131/2\n\n(2)\n\nThe collision rates for electrons and ions are given in [20, 21], where A is the molecular/atomic mass of the principal ion:\nνig =ng hσviig\n=2.6 × 10\n\n−9\n\n\u0012\n\nA\n1amu\n\n\u0013−1/2\n\n\u0012\n\n\u00131/2\n\nνeg =ng hσvieg\n=8.28 × 10\n\n−10\n\nT\n1K\n\n(3)\n−1\n\ns\n\n(4)\ns\n\n−1\n\nIn a typical protostellar disk, ng ∼ 1012 − 1013 cm−3 [22], magnetic fields are of order 10\n- 100 mG (see [23] for scaling of magnetic fields in molecular clouds), so that we have a\nHall plasma. Most of the ions in low-ionized astrophysical plasmas are alkali ions[22, 24],\ngiving an ion mass mi ∼ 30. For T ∼ 30K, gas density ng = 1013 cm−3 , assuming a standard\n4\n\n\fcosmic-ray ionization ζ = 10−17 s−1 [25], ion density ni ∼ 1 cm−3 [10, 26]. Here νig ∼ 1.4×105\n\ncm−3 . For B = 100 mG, ωci = 30 s−1 ≪ νig . Furthermore, since νei = 2.6 × 104 s−1 and\nωce = 1.8 × 106 s−1 , νeg νig ≫ ωci ωce and we may completely neglect the ambipolar electric\nfield in the induction equation. The upper threshold for Hall effects L ∼ 5 AU (7.5 × 1013\n\ncm), comparable to the scale of temperature and density gradients in the outer parts of a\nprotostellar disk.\n\nB.\n\nPhysical Regimes of Dusty Plasmas\n\nApproximately 1% of the interstellar medium in our galaxy is composed of dust[27].\nRudakov [14] showed how to apply the results of electron-ion Hall plasmas to dusty plasmas. It is important to note that although dust may not be a primary charge carrier in\na low-ionized astrophysical plasma, their large masses, small charges, and relatively small\nnumber densities opens up a length and time scale over which the dust remains unmagnetized (whether through long dust gyroperiod or through collisional coupling with interstellar\ngas) while the faster and smaller-scale electrons and ions remain fixed to the magnetic field\n– hence dusty Hall MHD physics. The following changes to the standard electron-ion Hall\nMHD scaling must be made,\nni → nd\neZi → ezd\n\n(5)\n\nvi → vd\nDm → Dm,d =\n\nνig md c2\n\u0002\n\u0003.\n4πe2 ni (zd nd /ni )2 + (νig /ωci )2\n\nnd and md are the number density and mass of dust particles (of a single mass and size), zd\nis charge per dust particle, and vd is the velocity of the dust. In the limit of low temperature\n< 100 K), zd = −1. Dusty plasma behaves as a Hall plasma if nd /ni ≫ νig /ωci\nplasmas (T ∼\n\n[14]. The dust inertial scale, the lower limit over which we may apply Hall physics, is\n(Md c2 /4πe2 nd zd2 )\n\n1/2\n\n= c/ωpd , where ωpd is the dust plasma frequency.\n\nIn the limit that the Lorentz force on a dust particle (evd B/c) is smaller than the drag\nforce acting on the dust (a2 vg,th mg ng vd , where a is the size of a dust grain):\neB\n< a2 vg ng\nmg c\n\n(6)\n5\n\n\fThen the dust is collisionally coupled to the gas. In this limit, the dusty plasma Hall\nlength scale c/ωpd increases by a factor (mg /md )1/2 (ng /nd )1/2 , similar to the length scale\nof the low-ionized gas in Eq. (2). mg and ng are the masses and number densities of gas,\nrespectively.\nDense molecular clouds have a hydrogen gas density of nH ∼ 103 − 106 cm−3 (see, e.g.\n[19, 27]). Given a standard cosmic ray ionization ζ = 10−17 s−1 [25] at temperature T = 30\nK, this implies an ion density ni ∼ 10−3 − 10−2 cm−3 [10, 26]. For these gas densities, the\nmagnetic fields are on the order of 10−5 − 10−3 G [23, 27]. For a representative molecular\n\ncloud density ng = 103 cm−3 at T = 10 K with representative grains of size a = 0.03 μm, we\n\nget densities [26] ne = ni = 10−3 cm−3 , nd = 10−8 cm−3 , and magnetic fields B = 10−4 G.\nAssuming densities of dust at 3 gm/cm3 , this gives an average dust mass md = 0.5 × 10−15\n\ngm. Furthermore, the length scale of Hall phenomena is (Md c2 /4πe2 nd zd2 )\n\n1/2\n\n= c/ωpd ∼ 1000\n\nAU. Although the density and temperature model inside protostellar disks is still open to\nquestion, we have somewhat better estimates of the density of gas at the edges of protostellar\ndisks and in protostellar jets. We are taking the grain radius of a = 1 μm that scatters visible\nlight efficiently. Since we have marginal extinction due to the scattering of light by the dust,\nRnd a2 ∼ 1 and so nd ∼ 3 × 10−7 cm−3 . The length scale for Hall phenomena calculated over\nthis mass and density is c/ωpd ∼ 1000 AU. However, this length scale is smaller than that\ncalculated because the Hall physics is dominated by smaller dust particles. The usual dust\nsize distribution function is nd (a) ∝ a−3.5 [28], and the length scale c/ωpd changes as a3 .\nIII.\n\nHALL DYNAMIC EQUATIONS\n\nWe consider the electron-ion Hall plasma, using a cylindrical geometry and fluid equation\nfor electrons. The Hall dynamic equations in this form were first written in [17]. Here, we\nbegin with the Hall frozen-in equations with magnetic diffusion expression Dm in Eq. (1),\nand letting ions remain motionless.\n\u0012 \u0013\n\u0012 \u0013\nB\n∂ B\n+ nve * ∇\n= (B * ∇) ve − ∇Dm × (∇ × B) + Dm ∇2 B\nn\n∂t n\nn\n4π\n4πen\n∇×B=\nJ=\nve\nc\nc\n\n(7)\n\nWe consider an axisymmetric magnetic field in cylindrical geometry. Only two variables\ncompletely describe the magnetic field: 1) the toroidal magnetic field B ≡ Bφ ; and 2)\n6\n\n\fthe toroidal vector potential A ≡ Aφ . This implies an expression for the three-component\n(poloidal and toroidal magnetic field):\nB = Beφ + ∇ × (Aeφ )\n\n∂A\n∂z\n1 ∂(rA)\nBz = [∇ × (Aeφ )]z =\nr ∂r\n\nBr = [∇ × (Aeφ )]r = −\n\n(8)\n\nBφ = B\nWhere Br and Bz are the radial and vertical components of the poloidal magnetic field, and\nBφ is the toroidal component.\nThe electron velocity in terms of the magnetic field is shown here,\nc\n∇×B\n4πen\nc ∂B\nc\n[∇ × (Beφ )]r =\nver = −\n4πen\n4πen ∂z\nc ∂ (rB)\nc\n[∇ × (Beφ )]z = −\nvez = −\n4πen\n4πenr ∂r \u0012\n\u0012\n\u0013\n\u0013\nc\n∂A\nA ∂2A\n1 ∂\nc\nφ\nve = −\nr\n− 2+ 2\n[∇ × (∇ × (Aeφ ))]φ =\n4πen\n4πen r ∂r\n∂r\nr\n∂z\nve = −\n\n(9)\n\nWhere ver , vez , and veφ are the radial, vertical, and azimuthal components of the electron\nflow velocity, respectively. With Eq. (9), the continuity equation for the electron fluid, and\nMaxwell's equations, the plasma number density is steady-state ∂n/∂t = 0.\n\nA.\n\nHall Dynamic Equations\n\nLet Dm be a constant. Employing Eq. (8) and Eq. (9) we recover these equations,\n\u0013\n\u0012\n\u0013\n\u0012\n\u0012\n\u0013\nB\n∂B\nB ∂2B\n∂ (rB) ∂\n∂ (rB) ∂\n1 ∂\n∂B\nr\n− 2+\n=−\n−\n+ Dm\n−\n∂t\n∂z ∂r\n∂r ∂z nr\nr ∂r\n∂r\nr\n∂z 2\n\u0012\n\u0013\n\u0012\n\u0012\n\u0013\n\u0013\n(10)\n∂ (rA) ∂\n∂A\nA ∂2A\n∂ (rA) ∂\n1 1 ∂\nr\n− 2+ 2\n−\n∂z ∂r\n∂r ∂z nr r ∂r\n∂r\nr\n∂z\n\u0013\n\u0012\n\u0012\n\u0013\n\u0012\n\u0013\n∂A\nA ∂2A\n1 ∂\n1\n∂ (rB) ∂\n∂ (rB) ∂\n∂A\nrA + Dm\nr\n− 2 + 2 (11)\n=− 2\n−\n∂t\nnr\n∂z ∂r\n∂r ∂z\nr ∂r\n∂r\nr\n∂z\n\n7\n\n\fif we make these scalings of time, space, magnetic field, density, velocity, and magnetic\ndiffusion Dm as shown below,\nt → tωci\n\n(r, z) → (r, z)ωpi /c\n\nB → B/B0\n\nA → A/A0 = Aωpi / (cB0 )\n\nn → n/n0\n\nωci = eB0 /mi c\n\n2\nωpi\n= 4πe2 n0 /mi v → v/vA\n√\nDm → νei /ωce\nvA = B0 / 4πn0 mi\n\n.\n\n(12)\n\nωce = eB0 /me c\nB0 and n0 are the maximum toroidal magnetic field (or magnetic field strength) and number\ndensity, respectively. ωce , ωci , ωpi , vA , are the electron cyclotron frequency, ion cyclotron\nfrequency, ion plasma frequency, and Alfvén velocity at that point, respecively.\n\nB.\n\nGeneralized Grad-Shafranov (GGS) Integral\n\nWe show an important integral of the Hall dynamic equations, following much of the\nderivation shown in [17]. We assume propagating solutions A ≡ A(r, z − ut) and B ≡\nB(r, z − ut), where u is a constant normalized velocity, and a radial-dependent number\ndensity n ≡ n(r).\nConsider force balance equation in some moving frame in which the electric E′ and\nmagnetic B′ fields are stationary in time. Electron gas pressure and resistivity are ignored.\nThe electron velocity in a dimensionless form, using Eq. (8), is given by:\n\u0012\n\u0012\n\u0013\n\u0013\n1\n∂A\nA ∂2A\n1 ∂(rB)\n1 ∂B\n1 1 ∂\nve = − ∇ × B = −\nr\n− 2 + 2 e(13)\nez +\ner +\nφ\nn\nnr ∂r\nn ∂z\nn r ∂r\n∂r\nr\n∂z\n\nBegin with the dimensionless frozen-in law for the electron fluid neglecting electron pressure:\nE + ve × B = 0\n\n(14)\n\nThe propagating solution is moving with sufficiently small velocity to ignore relativisitic\neffects so that:\n(15)\n\nE′ = E + u × B, B′ = B\n\nIn this comoving frame the electric field E′ = 0, since electrostatic potentials are neglected.\nIn the laboratory frame the electric field is given by:\nE = −u × B\n\n(16)\n8\n\n\fAs a result, Eq. (14) can be rewritten as:\n(ve − u) × B = 0\n\n(17)\n\nA general case reproduces the generalized Grad-Shafranov (GGS) integrals with force balance in r, z, and φ directions in Eq. (17). Sufficiently, force balance in the radial direction\nimplies:\n\u0012\n\n1 ∂\nr ∂r\n\n\u0012\n\u0013\n\u0013\n\u0013\n\u0012\n∂A\nA ∂2A\n1 ∂(rB)\nr\n− 2 + 2 Bz + nu +\n=0\n∂r\nr\n∂z\nr ∂r\n\n(18)\n\nCombined with the fact that the solution consists of magnetic surfaces at constant poloidal\nflux Ψ = rA, and that fact that ∂H/∂r = dH/dΨ × ∂Ψ/∂r, imply the GGS integrals.\n\u0012\n\u0013\n\u0012\n\u0013\nZ r\n∂2Ψ\ndH\n∂ 1 ∂Ψ\n′\n′\n′\n(19)\n+\nH(Ψ) − u\n=−\nn (r ) r dr\nr\n∂r r ∂r\n∂z 2\ndΨ\n0\nZ r\nrB = H (Ψ) − u\nn (r ′ ) r ′ dr ′\n(20)\n0\n\nThe first current term H(Ψ) arises in the normal Grad-Shafranov equation. The additional\nterm in the GGS arises due to the electric field (see Eq. [17]) acting on the moving strucRr\nture. This appears as an additional poloidal current, −u 0 n (r ′ ) r ′ dr ′, in the frame of the\npropagating solution, where the motionless ions are seen moving with velocity −uez . This\n\n\"current\" can appear only where the electrons are moving. Furthermore, radial electric force\nRr\nor J × B force due to this \"current\" results in a pressure term −u 0 n (r ′ ) r ′ dr ′ × dH/dΨ\n\nin the GGS equation. It must be emphasized that in MHD the magnetic field is frozen into\n\nthe plasma and cannot move relative to the ions, so there is no additional force. The GGS\nequations were first found in [17] as exact solutions of the dynamic equations for the Hall\nmagnetic field in an axisymmetric geometry, Eq. (10) and (11).\n\nIV.\n\nAXISYMMETRIC HALL MHD SOLUTIONS\n\nHere, we consider solutions of the GGS, that propagate down a cylindrical column. We\nhave three sets of analytic solutions. Sec. (IV A) details the resistive nonlinear shock whose\nstructure is described by a Burgers equation. Sec. (IV B) describes a periodic solution to the\nGGS equation with linear current term H(Ψ) ∝ Ψ. Sec. (IV C) numerically estimates, with\njustification on the basis of the Chandrasekhar-Fermi theorem[29], nonlinear localized bubble\nsolutions to the GGS integral. According to this theorem, a localized MHD equilibrium\n9\n\n\fplasma magnetic structure could exist only in the presence of an external magnetic field or\nwith fixed metal wall boundaries.\n\nA.\n\nResistive Nonlinear Shock\n\nAgain, assume a Hall plasma column, so that the magnetic fields are given by Eq. (11)\nand (10), with a constant-density plasma within the column r < R and vacuum outside.\nFurthermore, let us assume only the toroidal field B exists with profile B(r, z, t) = B(z, t)r/R\nand B(−∞, t) = −B0 , where B0 > 0. Thus, we get the Burger's equation in normalized\ncoordinates:\n∂B\n2B ∂B\n∂2B\n=\n+ Dm 2\n∂t\nR ∂z\n∂z\n\n(21)\n\nWith this solution, in normalized coordinates:\n\u0012\n\u0012\n\u0013\n\u0013\n\nB0 r\nB0 (z − B0 t/R)\n\n\ntanh\n−1\nr<R\n2RDm\nB(r, z, t) = 2R\n\n0\nr>R\n\n(22)\n\nIn dimensional values the shock velocity is given by u = cB0 / (4πenR) and shock thickness\nδ = 2νei /ωce R. Note that the shock is moving in the positive z direction in our coordinate\nsystem. This asymmetry is typical for Hall phenomena. Furthermore, one may construct\nanalytic solutions for any arbitrary initial configuration B(z, 0) (see e.g. [4, 30] for the\nHopf-Cole transformation that transforms Burger's equation into a heat diffusion equation).\nA plot of the toroidal magnetic structure of this resistive case is shown in figure 1, with\nu = 100 and b0 = B0 /R = 100.\n\nB.\n\nPeriodic GGS Solution\n\nHere, we consider solutions to the GGS equation (see Eq. [20] and [19]) with linear current\nterms, H(Ψ) = kΨ. Note that this solution arises from a particular choice of current term,\nand does not arise from a linearization of the dynamic equations (Eq. [11] and [10]). Consider\nthe density n = 1 a constant, and as before u > 0 is also a constant. Then the GGS integrals\n\n10\n\n\fpoloidal current field lines\nb0 = 100.0, r0 = 0.01, eta = 1.0\n0.015\n\nshock velocity = b0\n0.01\n\npi\n\nX (c/ω )\n\n0.005\n\n0\n\nplasma\nboundary\n\nLINES OF ELECTRON MOTION\n\n−0.005\n\n−0.01\nz surface electron motion\n\nfront thickness = b0/2η\n−0.015\n−0.25 −0.2 −0.15 −0.1 −0.05\n\n0\n0.05\nZ (c/ω )\n\n0.1\n\n0.15\n\n0.2\n\npi\n\nFIG. 1: Poloidal current lines within the Burgers-like nonlinear solution. Here, electrons must\nreturn across the surface so, we see that a current sheet develops on the Hall plasma column, that\ndistributes current back into the (attached) current generator.\n\nreduce to these relations inside the plasma column of radius R:\n\u0012\n\u0013\n∂ 1 ∂Ψ\n∂2Ψ\n1\nr\n+\n= −k 2 Ψ + ukr 2\n2\n∂r r ∂r\n∂z\n2\n1 2\nB = kA − ur\n2\n\n(23)\n(24)\n\nOutside the plasma column we have a vacuum, so that there are no currents and no magnetic\nfield in the frame of electron MHD. Electron MHD implies that the magnetic field is carried\nonly by the electrons.\nWe consider a geometry in which there is a given radial variation in the three-component\nmagnetic field, such that there is only a toroidal current sheet. This implies that B → 0\n11\n\n\fat the boundary of the plasma column. We look for solutions that go as ∼ cos κ (z − ut) in\nmagnetic field.\n\n√\n\u0001\n\nαrJ1 r k 2 − κ2 cos κ (z − ut) + ur2 r < R\nκ\nΨ=\n2\n\n uR\nr>R\nk\n\n√\n\u0001\n\nκαJ1 r κ2 − k 2 cos k (z − ut) r < R\nB=\n\n0\nr>R\n\n(25)\n\ntoroidal surface current on the plasma column is given by:\n\u0010 \u0010 √\n\u0011\n√\nIφ (R, z − ut) = α κ2 − k 2 J0 R κ2 − k 2 −\n\u0011\u0011\n\u0010 √\n2u\nJ2 R κ2 − k 2 cos k (z − ut) +\nκ\n\n(26)\n\n√\n\u0001\nWhere Jn are Bessel functions, κ2 > k 2 , and the condition that J1 R κ2 − k 2 = 0. The\n\nThe solution shown in figures 2, with these parameters:\nη = 0.0 α = 1.0\nκ = 1.0 u = 100.0\n\nAnd κ given by the first zero of J1 (x):\ns\n\u00132\n\u0012\n3.83171\n2\nk= κ +\nR\n\nC.\n\nLocalized Hall Bubble Solutions\n\nHere, we consider solutions to the GGS equation that describe the evolution of possible\n2D nonlinear whistler-like waves and structures. Consider solutions with normalized density\nn = 1, propagating with velocity uez , and the currents and toroidal magnetic fields in the\nGGS integral:\nH (Ψ) = αΨ2\n1\n1\nrB = H (Ψ) − ur 2 = αΨ2 − ur 2\n2\n2\n\n12\n\n(27)\n\n\f- 0.01\n\n- 0.005\n\n0\n\n0.005\n\n0.01\np\n\ndir. of poloidal field\n\np\n\np\n\n-\n\nplasma boundary\n\n0\n\np\n2\n\nplasma boundary\n\nY Hc wpiL\n\n2\n\np\n\n0\n\n-\n\n2\n\n-p\n\np\n2\n\n-p\n- 0.01\n\n- 0.005\n\n0\nX Hc wpiL\n\n0.005\n\n0.01\n\nFIG. 2: Poloidal magnetic flux Ψ (and hence, poloidal magnetic field lines) for the GGS solution.\nNote that since the poloidal flux within the vacuum is constant, no poloidal magnetic fields exist\nwithin the vacuum. Note that the discontinuity in Bz results in φ current sheet along the Hall\ncolumn surface. This magnetic configuration appears similar to the compact torus, where the\nstructure is defined by the boundary conditions – i.e. metal walls.\n\n13\n\n\fIn terms of the toroidal vector potential A and the toroidal magnetic field B the nonlinear\nsoliton equation is given by,\n∂ 2 A 1 ∂A A\n+\n− 2 − ur 2 A + 2r 2 αA3 = 0\n∂r 2\nr ∂r\nr\n(28)\n1\n2\nB = αrA − ur\n2\nOne can easily show that if we let A0 (r, z) be the solution to the differential equation,\nu = 1, α = 1:\n∂ 2 A0 1 ∂A0 A0\n+\n− 2 − r 2 A0 + 2r 2 A30 = 0\n∂r 2\nr ∂r\nr\n\n(29)\n\nThen the scaling for the toroidal vector potential A (r, z; u, α) in terms of A0 (r, z) and the\nform of the toroidal magnetic field from Eq. (28) are given by:\n\u0010 α \u00111/2\n\u0001\nA (r, z; μ, α) =\nA0 u1/4 r, u1/4 z\nu\n\u0010 α \u00113/2\n\u00013 1\nrA0 u1/4 r, u1/4 z − ur\nB (r, z; u, α) =\nu\n2\n\n(30)\n(31)\n\nConsider a volume to be a cylinder. The soliton structure consists of a three-component\nmagnetic field (a poloidal field and a toroidal field) that is localized about the origin with\na span much smaller than the dimensions of the cylindrical volume; thus, Br → 0, Bz → 0,\nand Bφ → − 21 ur at the boundaries of the cylinder. Employing the Chandrasekhar-Fermi\n\ntheorem – using r * (J × B) force balance within the cylindrical volume – one can show,\nZ R Z L\nrBz2 dr dz =\nr=0 z=−L\n(32)\nZ R Z L\nun(r)rH (Ψ) dr dz\nr=0\n\nz=−L\n\nFurthermore, since Bz = −∂A/∂r, a localized solution (where the integral on the left hand\nside is finite) is possible provided that the right hand side ≥ 0. To guarantee a localized\n\nsolution we require that H(Ψ) ≥ 0. The case analyzed in this section is H (Ψ) = Ψ2 ≥ 0.\n\nNote that the form of Eq. (28) or (29) is as if we consider a nonlinear 3D Schrödinger\nequation with the m = 1 azimuthal modes (i.e. solutions ∼ eiφ ). Here, to estimate the form\nof the soliton, we use the same variational method and trial functions, described below, for\n3D nonlinear optical solitons [31, 32]. First, we derive the Lagrangian that describes the\nGGS equation with nonlinear current. Then we look for localized solutions with different\ntest functions. One reasonable approximation for the test function in cylindrical coordinates is A(r, z) = U(r) sech μz. A one-dimensional differential equation in r is derived by\n14\n\n\faveraging that Lagrangian with respect to z and searching for a localized one-node solution,\npresumed to be the main lowest-energy stable solution, for a given μ. We solve for that μ\nthat minimizes the integral of the averaged Lagrangian over r. Another test function is in\n√\nspherical coordinates, A(ρ, θ) = U(ρ) sin θ, where ρ = r 2 + z 2 and cos θ = z/ρ. Again a\none-dimensional equation in ρ, and its localized single-node lowest energy solution, is derived\nby averaging and minimizing the Lagrangian of the GGS. A more detailed description of the\nestimation method for both trial functions is provided in the Appendix.\nPlots of the dependence U(r), the cylindrical ansatz, and U(ρ), the spherical ansatz,\nare shown in Fig. 3. Contours detailing the shapes of the toroidal vector potential A(r, z)\nfor both trial functions are shown in Fig. 4. The cylindrical ansatz U(r) sech μz and the\nspherical ansatz U(ρ) sin θ have approximate shapes in the radial coordinate. As in [31],\nthere is a substantial differences in the shape of the cylindrical and spherical trial functions\nof the soliton. The shape of the cylindrical and spherical trial functions look similar to their\ncorresponding solutions of the optical solitons found in [31]. Both trial functions also satisfy\n\u0001\nthe scaling A (r, z; μ, α) = (α/u)1/2 A0 u1/4 r, u1/4 z .\nV.\n\nDISCUSSION AND CONCLUSIONS\n\nHere we have explored possible structures that arise in a Hall plasma due to curvature\nrather than, say, density gradients. We have provided a general structure to continue further\nanalysis of the dynamic Hall modes in Eq. (10) and (11) as well as the generalized GradShafranov (GGS) integrals in Eq. (19) and (20) and propagating solutions with constant\nvelocities in the z direction.\nWell-understood Hall plasma phenomena such as whistler drift modes were shown to\nexist in an homogenous cylindrical plasma column. Furthermore, an exact solution for the\nwhistler drift mode, the Burgers nonlinear shock wave, was discussed in subsection IV A.\nPeriodic solutions were shown in subsection IV B from a simple analysis of the allowable\nsolution for linear current in the GGS integrals. We find that the solution is constrained by\nthe radial vacuum boundary of a Hall plasma column, because in Hall physics the magnetic\nfield is carried solely by the electrons. Further work may involve a search for transitional\nsolutions – those solutions intermediate between the periodic Grad-Shafranov solution and\nthe collisional nonlinear shock. Possible solutions may be those with oscillatory substructure\n15\n\n\f2\n1.8\n\nU(r) sech μ z\nμ = 2.1852\n\n1.6\n\nU(ρ)sin θ\n\n1.4\n\nU(r)\n\n1.2\n1\n0.8\n0.6\n0.4\n0.2\n0\n0\n\n1\n\n2\n\n3\n\n4\n\n5\n\nr\nFIG. 3: Plot of the radial distribution with the given ansatzes shown in the figure. For the\ncylindrical ansatzes, the z width parameter μ is calculated to four decimal places.\n\nin the toroidal magnetic field at the shock with corresponding poloidal magnetic field in the\ncase of small resistivity.\nWe determined that there is a congruence between the GGS and the nonlinear Schrödinger\nequation with m = 1 azimuthal modes. We apply the variational method, which was developed for optical fiber solitons, for our problem. We estimate soliton solutions in subsection\nIV C for a given nonlinear current H(Ψ) = αΨ2 and constant number density n. The\nChandrasekhar-Fermi theorem implies that such a nonlinear current may allow for localized soliton solutions. Such a current distribution also allows for a simple scaling – that\nis, solutions with normalized propagation velocity u 6= 1 and current scalings α 6= 1, and\n\u0001\nu > 1, α > 1 have vector potential A (r, z; u, α) = (α/u)1/2 A0 u1/4 r, u1/4 z . Further re16\n\n\f2\n\n1\n\n1\n\nz (c/ωpi)\n\nz (c/ωpi)\n\n2\n\n0\n\n−1\n\n−2\n0\n\n0\n\n−1\n\n1\n\n2\n\n3\n\n4\n\n−2\n0\n\n1\n\n2\n\n3\n\n4\n\nr (c/ω )\n\nr (c/ωpi)\n\npi\n\nFIG. 4: Structure of the U (r)sech μz ansatz (left) compared with the spherical U (ρ) sin θ ansatz\n(right). Although the finer features are obviously different, the width in the radial direction are\nroughly similar.\n\nsearch may apply this suggested method to other localized soliton-like solutions, as well as\nilluminate relationships between the magnetic fields and vertical velocities in propagating\nlocalized Hall structures. The Hall dynamic equations in Eq. (10) and (11) may be useful\nin analyzing the stability of the soliton solutions estimated here.\nWe have also included some space plasmas in which the Hall regime may be important.\nIn Earth's lower ionosphere, whistler drift modes due to density gradients (at the equator)\nor curvature (at the magnetic poles) may exist. In astrophysical plasmas, such as molecular\nclouds, protostellar disks, or protostellar jets, Hall phenomena may exist due to the presence\nof charged dust.\nAxisymmetric Hall phenomena may play an important role in the circumstellar disks\nand jets pictured by the Hubble Space Telescope around young stellar objects. The typical\ncircumstellar disk has a radius of a few hundred AUs – a possible length scale in Hall phenomena. Hall shocks and other magnetic structures also transport of currents and magnetic\nfields through matter without compression or net mass motion. A comparison of the radio\nfrequency Doppler studies of the bipolar jets around HH30 show that the bulk velocity of\nthe matter is five times slower than the velocities of the observed jet substructures [33].\n\n17\n\n\fFurthermore, radio polarization measurements of the jets emanating from the disks of GM\nAurigae and DG Tauri imply largely toroidal magnetic fields[34], which may be explainable\nas a nonlinear shock wave and structures rather than the traditional model of a supersonic\nfluid or MHD shock.\nOther explanations for the fast-moving, time-resolved substructures in the jets of T Tauri\nstars involve \"bullets\" of plasma that emanate from the disk [18]. Furthermore, a variety\nof MHD jet models are given in the literature (see, e.g. [18, 35, 36]). Astrophysical MHD\nexperiments of pressure-confined toroidal magnetic towers (see, e.g., [37, 38]) may explain\nfeatures of these jets as specific MHD phenomena: higher intensity material within the jet\nas magnetic bubbles, and longer-timescale intermittency because kink and other azimuthal\nMHD instabilities collapse the jet structure. Here, due to the obvious presence of dust,\nwe imply an alternative model, magnetic penetration into a Hall plasma, that may explain\nsome of these observed structures. A companion astrophysical paper will expand upon the\nilluminating relationship between net Hall magnetic bubble velocity, radial dimension, and\nmagnetic field strength to explain the migration of observed \"bullets\" seen in protostellar\njets.\n\nAcknowledgments\n\nThe author would like to thank L. Rudakov for his invaluable advice with regards to\nthese new classes of curvature-based solution in Hall plasmas, and especially for introducing\nhim to the generalized Grad-Shafranov equation.\n\n[1] A. S. Kingsep, Y. V. Mokhov, and K. V. Chukbar, Fiz. Plazmy 10, 854 (1984).\n[2] A. Fruchtman and L. Rudakov, Phys. Rev. Lett. 69, 2070 (1992).\n[3] J. D. Huba, I. M. Grossman, and P. F. Ottinger, Phys. Plasmas 1, 3444 (1994).\n[4] A. V. Gordeev, A. S. Kingsep, and L. I. Rudakov, Physics Reports 243, 214 (1994).\n[5] J. D. Huba, Phys. Plasmas 2, 2504 (1995).\n[6] M. A. Shay, J. F. Drake, R. E. Denton, and D. J. Biskamp, J. Geophys. Res. 103, 9165 (1998).\n[7] L. I. Rudakov and J. D. Huba, Phys. Rev. Lett. 89, 95002 (2002).\n[8] P. L. Pritchett, J. Geophys. Res. 106, 3783 (2001).\n\n18\n\n\f[9] J. D. Huba and L. I. Rudakov, Phys. Plasmas 9, 4435 (2002).\n[10] M. Wardle and C. Ng, Monthly Notices of the Royal Astronomical Society 303, 239 (1999).\n[11] S. Balbus and C. Terquem, Astrophys. J. 552, 235 (2001).\n[12] T. Sano and J. M. Stone, Astrophys. J. 570, 314 (2002).\n[13] T. Sano and J. M. Stone, Astrophys. J. 577, 534 (2002).\n[14] L. I. Rudakov, Phys. Scripta 2001, 158 (2001).\n[15] M. Salimullah and P. K. Shukla, Physics of Plasmas 6, 686 (1999).\n[16] M. Rosenberg and P. K. Shukla, Journal of Geophysical Research 105, 23135 (2000).\n[17] L. I. Rudakov, Phys. Scripta 2002, 58 (2002).\n[18] W. I. Newman, A. L. Newman, and R. V. E. Lovelace, Astrophys. J. 392, 622 (1992).\n[19] T. W. Harquist, W. Pilipp, and O. Havnes, Astrophysics and Space Science 246, 243 (1997).\n[20] B. T. Draine, W. G. Roberge, and A. Dalgarno, Astrophys. J. 264, 485 (1983).\n[21] S. Chapman, Nuovo Cimento 5, 1385 (1956).\n[22] S. Frómang, C. Terquem, and S. A. Balbus, Monthly Notices of the Royal Astronomical\nSociety 329, 18 (2002).\n[23] P. C. Myers and A. A. Goodman, Astrophys. J. 326, L27 (1988).\n[24] M. Oppenheimer and A. Dalgarno, Astrophys. J. 192, 29 (1974).\n[25] L. Spitzer and M. G. Tomasko, Astrophys. J. 152, 971 (1968).\n[26] T. Umebayashi and T. Nakano, Monthly Notices of the Royal Astronomical Society 243, 236\n(1990).\n[27] E. G. Zweibel, Phys. Plasmas 6, 1725 (1999).\n[28] J. S. Mathis, W. Rumpl, and K. H. Nordsieck, Astrophys. J. 217, 425 (1977).\n[29] S. Chandrasekhar and E. Fermi, Astrophys. J. 118, 116C (1953).\n[30] S. I. Vainshtein, S. M. Chitre, and A. V. Olinto, Phys. Rev. E 61, 4422 (2000).\n[31] A. Desyatnikov, A. Maimistov, and B. Malomed, Phys. Rev. E 61, 3107 (2000).\n[32] A. Yakimenko, Y. Zaliznyak, and Y. Kivshar, Phys. Rev. E 71 (2005).\n[33] C. J. Lada and M. Fich, Astrophys. J. 459, 638 (1996).\n[34] M. Tamura, G. H. Hough, J. S. Greaves, J.-I. Morino, A. Chrisostomou, W. S. Holland, and\nM. Momose, Astrophys. J. 525, 832 (1999).\n[35] R. V. E. Lovelace, M. M. Romanova, and G. S. Bisnovatyi-Kogan, Monthly Notices of the\nRoyal Astronomical Society 275, 244 (1992).\n\n19\n\n\f[36] G. V. Ustyugova, R. V. E. Lovelace, M. M. Romanova, H. Li, and S. A. Colgate, Astrophys.\nJ. 541, L21 (2000).\n[37] A. Ciardi, S. V. Lebedev, C. Stehle, and T. Lery, in Journal de Physique IV (Proceedings)\n(LUTH, Observatoire de Paris, UMR 8102 CNRS, 92195 Meudon, France; The Blackett Laboratory, Imperial College, London SW7 2BW, UK, 2006), pp. 1043–1045.\n[38] A. Ciardi, S. V. Lebedev, A. Frank, F. Suzuki-Vidal, G. N. Hall, S. N. Bland, A. HarveyThompson, E. G. Blackman, and M. Camenzind, Astrophys. J. 691, L147 (2009).\n\nAppendix: Variational Method For Trial Functions of GGS\n\nHere, we demonstrate localized 3D soliton solutions of the GGS equation with nonlinear\ncurrent term, with the cylindrical coordinate and spherical coordinate trial functions. This\nvariational method and trial functions were borrowed from [31]. Furthermore, the integration\nof the one-dimensional functions was performed using a fourth-order Runge-Kutta method\nfrom r = 0 to r = 10 for the cylindrical ansatz and ρ = 0 to ρ = 10 for the spherical ansatz.\n\n1.\n\nCylindrical Coordinate Ansatz\n\nThe Lagrangian of the differential expression (29) is given by,\n1\n1\nA2 1\n1\nL (∂r A0 , ∂z A0 , A0 ; r, z) = r (∂r A0 )2 + r (∂z A0 )2 + 0 + r 3 A20 − r 3 A40\n2\n2\n2r\n2\n2\nWith this ansatz,\nA0 (r, z) = U(r) sech (μz) ,\n\n(A.1)\n\n(A.2)\n\nwe get the averaged Lagrangian L1 , where U ′ = dU/dr:\n\u0012 \u00132\nZ ∞\nr dU\nU 2 r 3 2 2r 3 4\nμr\n(A.3)\nL1 =\nL (∂r A0 , ∂z A0 , A0 ; r, z) dz =\n+ U −\nU\n+ U2 +\nμ dr\n3\nμr\nμ\n3μ\n−∞\n\nIf we vary L with respect to U and dU/dr we then have a differential equation in r:\n1 dU\nU\n1\n4\nd2 U\n+\n− 2 − μ2 U − r 2 U + r 2 U 3 = 0\n2\ndr\nr dr\nr\n3\n3\n\n(A.4)\n\nThe solutions that we look for are given by the\nlim U(r) = U ′ (0)r\n\nr→0\n\nlim U(r) = r\n\nr→∞\n\n−1\n\n(A.5)\n\n\u0013\n\u0012\n1 2\nexp − r\n2\n20\n\n\fWe employ the shooting method, with free parameter U ′ (0), by integrating out Eq. (A.4)\nfrom r = 0 to some sufficienly large r = rlim ≫ w, where w is the width of the structure.\nFurthermore, since we postulate the lowest-energy solutions are probably dominant, we look\nfor solutions that have a single node in U(r).\nFor each μ there is a unique single-node solution U(r; μ) satisfying Eq. (A.4). To solve\nfor this problem, we require that the averaged Lagrangian Eq. (A.3), averaged over r, must\nbe extremized with respect to μ:\nZ ∞\n∂L1\ndr = 0\n∂μ\n0\n\n(A.6)\n\nIf we use these functions:\nZ ∞\nǫ1 (μ) =\nrU (r; μ)2 dr\nZ0 ∞\nǫ2 (μ) =\nr 3 U (r; μ)2 dr\nZ0 ∞\nǫ3 (μ) =\nr 3 U (r; μ)4 dr\n\n(A.7)\n\n0\n\nWe then get the relation,\n!\n\u0012 \u00132\nZ ∞\n1\n2\nU2\ndU\n+ 2 dr = μ2 ǫ1 (μ) − ǫ2 (μ) + ǫ3 (μ) .\nr\ndr\nr\n3\n3\n0\nHowever, using (A.4) one can derive this relation,\n\"\u0012 \u0013\n#\n\u0012\n\u0013\n2\ndU\ndU\n1\nd\n4\nU2\nr\nrU\n− μ2 rU 2 − r 3 U 2 + r 3 U 4 .\n+ 2 =\ndr\nr\ndr\ndr\n3\n3\n\n(A.8)\n\n(A.9)\n\nSubstituting Eq. (A.9) into the integral on the left hand side of Eq. (A.8), and noting that\nthe first right hand side term in Eq. (A.9) integrates to zero because it is a surface term, we\nthen get the residual function for μ0 :\nδ1 (μ0 ) = μ20 ǫ1 (μ0 ) − ǫ3 (μ0 ) = 0\n\n(A.10)\n\nOur estimates of μ0 (to four decimal places) and U0′ that satify (A.10) are given below:\nμ0 ≈ 2.1852\n\n(A.11)\n\n′\n\nU (0) ≈ 1.0115\n\n21\n\n\f2.\n\nSpherical Coordinate Ansatz\n\nFor the spherical coordinate ansatz, we transform (29) into spherical coordinates, with\n√\n√\nρ = r 2 + z 2 and cos θ = z/ r 2 + z 2 :\n\u0012\n\u0013\n\u0012\n\u0013\n1\n∂A0\n∂\n1 ∂\n2 ∂A0\nρ\n+ 2\nsin θ\n−\nρ2 ∂ρ\n∂ρ\nρ sin θ ∂θ\n∂θ\n(A.12)\nA0\n2\n2\n2\n2\n3\n− ρ sin θA0 + 2ρ sin θA0 = 0\nρ2 sin2 θ\nWhich has the Lagrangian,\n\u00132\n\u0012\n∂A0\n1 2\n+\nL (∂ρ A0 , ∂θ A0 , A0 ; ρ, θ) = ρ sin θ\n2\n∂ρ\n\u00132\n\u0012\n1\n1\n∂A0\nA20\n1\nsin θ\n+ ρ4 sin3 θA20 − ρ4 sin3 θA40 .\n+\n2\n∂θ\n2 sin θ 2\n2\n\n(A.13)\n\nWith the ansatz:\nA0 (ρ, θ) = U(ρ) sin θ\n\n(A.14)\n\nWe get the averaged Lagrangian:\n\u0012 \u00132\nZ π\n2 2 dU\n8\n16\n4\n4\nL2 =\nL (∂ρ A0 , ∂θ A0 , A0 ; ρ, θ) dθ = ρ\n+ U 2 + ρ4 U 2 − ρ4 U(A.15)\n3\ndρ\n3\n15\n35\n0\nThat results in this differential expression:\nd2 U\n2 dU\n2U\n4 2\n48 2 3\n+\n−\n−\nρ\nU\n+\nρ U =0\ndρ2\nρ dρ\nρ2\n5\n35\n\n(A.16)\n\nWe shoot with U(0) = 0 and free parameter U ′ (0) such that for sufficiently large ρ, we get\nU(ρ) → αρ−1 exp (−ρ2 /5), where α is some constant. U ′ (0) is given by,\nU ′ (0) ≈ 1.5897\n\n(A.17)\n\n22\n\n\f"}