{"id": "http://arxiv.org/abs/1009.2909v3", "guidislink": true, "updated": "2011-02-08T06:44:27Z", "updated_parsed": [2011, 2, 8, 6, 44, 27, 1, 39, 0], "published": "2010-09-15T12:37:39Z", "published_parsed": [2010, 9, 15, 12, 37, 39, 2, 258, 0], "title": "Binding energy per nucleon and hadron properties in nuclear matter", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1009.5843%2C1009.4065%2C1009.2334%2C1009.1052%2C1009.2027%2C1009.2909%2C1009.4995%2C1009.5709%2C1009.5336%2C1009.0750%2C1009.2042%2C1009.4697%2C1009.2278%2C1009.2521%2C1009.5951%2C1009.6060%2C1009.5326%2C1009.4960%2C1009.4817%2C1009.5789%2C1009.2354%2C1009.3339%2C1009.0405%2C1009.5565%2C1009.2862%2C1009.3544%2C1009.1574%2C1009.5512%2C1009.6221%2C1009.4362%2C1009.3743%2C1009.3148%2C1009.1906%2C1009.2167%2C1009.5172%2C1009.6009%2C1009.4984%2C1009.5304%2C1009.0511%2C1009.1015%2C1009.2250%2C1009.2685%2C1009.4024%2C1009.2744%2C1009.2232%2C1009.4751%2C1009.0867%2C1009.4080%2C1009.3383%2C1009.2571%2C1009.5547%2C1009.5078%2C1009.3599%2C1009.2243%2C1009.1761%2C1009.4965%2C1009.3098%2C1009.1751%2C1009.5055%2C1009.2141%2C1009.2094%2C1009.3863%2C1009.4075%2C1009.1837%2C1009.4304%2C1009.0700%2C1009.2357%2C1009.1858%2C1009.0997%2C1009.2621%2C1009.3270%2C1009.0676%2C1009.4969%2C1009.4570%2C1009.1984%2C1009.4032%2C1009.2578%2C1009.0536%2C1009.3645%2C1009.3742%2C1009.5800%2C1009.2365%2C1009.4213%2C1009.2122%2C1009.2332%2C1009.0535%2C1009.6149%2C1009.2164%2C1009.0648%2C1009.5218%2C1009.3288%2C1009.4653%2C1009.2199%2C1009.5220%2C1009.2267%2C1009.4619%2C1009.2251%2C1009.4112%2C1009.1969%2C1009.2016%2C1009.6152&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Binding energy per nucleon and hadron properties in nuclear matter"}, "summary": "We investigate the binding energy per nucleon and hadron properties in\ninfinite and homogeneous nuclear matter within the framework of the in-medium\nmodified Skyrme model. We first consider the medium modifications of the single\nhadron properties by introducing the optical potential for pion fields into the\noriginal Lagrangian of the Skyrme model. The parameters of the optical\npotential are well fitted to the low-energy phenomenology of pion-nucleus\nscattering. Furthermore, the Skyrme term is also modified in such a way that\nthe model reproduces bulk properties of nuclear matter, in particular, the\nbinding energy per nucleon. The present approach is self-consistent: the single\nhadron properties in a nuclear medium, their effective in-medium interactions,\nand the bulk matter properties are treated on the same footing.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1009.5843%2C1009.4065%2C1009.2334%2C1009.1052%2C1009.2027%2C1009.2909%2C1009.4995%2C1009.5709%2C1009.5336%2C1009.0750%2C1009.2042%2C1009.4697%2C1009.2278%2C1009.2521%2C1009.5951%2C1009.6060%2C1009.5326%2C1009.4960%2C1009.4817%2C1009.5789%2C1009.2354%2C1009.3339%2C1009.0405%2C1009.5565%2C1009.2862%2C1009.3544%2C1009.1574%2C1009.5512%2C1009.6221%2C1009.4362%2C1009.3743%2C1009.3148%2C1009.1906%2C1009.2167%2C1009.5172%2C1009.6009%2C1009.4984%2C1009.5304%2C1009.0511%2C1009.1015%2C1009.2250%2C1009.2685%2C1009.4024%2C1009.2744%2C1009.2232%2C1009.4751%2C1009.0867%2C1009.4080%2C1009.3383%2C1009.2571%2C1009.5547%2C1009.5078%2C1009.3599%2C1009.2243%2C1009.1761%2C1009.4965%2C1009.3098%2C1009.1751%2C1009.5055%2C1009.2141%2C1009.2094%2C1009.3863%2C1009.4075%2C1009.1837%2C1009.4304%2C1009.0700%2C1009.2357%2C1009.1858%2C1009.0997%2C1009.2621%2C1009.3270%2C1009.0676%2C1009.4969%2C1009.4570%2C1009.1984%2C1009.4032%2C1009.2578%2C1009.0536%2C1009.3645%2C1009.3742%2C1009.5800%2C1009.2365%2C1009.4213%2C1009.2122%2C1009.2332%2C1009.0535%2C1009.6149%2C1009.2164%2C1009.0648%2C1009.5218%2C1009.3288%2C1009.4653%2C1009.2199%2C1009.5220%2C1009.2267%2C1009.4619%2C1009.2251%2C1009.4112%2C1009.1969%2C1009.2016%2C1009.6152&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We investigate the binding energy per nucleon and hadron properties in\ninfinite and homogeneous nuclear matter within the framework of the in-medium\nmodified Skyrme model. We first consider the medium modifications of the single\nhadron properties by introducing the optical potential for pion fields into the\noriginal Lagrangian of the Skyrme model. The parameters of the optical\npotential are well fitted to the low-energy phenomenology of pion-nucleus\nscattering. Furthermore, the Skyrme term is also modified in such a way that\nthe model reproduces bulk properties of nuclear matter, in particular, the\nbinding energy per nucleon. The present approach is self-consistent: the single\nhadron properties in a nuclear medium, their effective in-medium interactions,\nand the bulk matter properties are treated on the same footing."}, "authors": ["Ulugbek Yakhshiev", "Hyun-Chul Kim"], "author_detail": {"name": "Hyun-Chul Kim"}, "author": "Hyun-Chul Kim", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1103/PhysRevC.83.038203", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1009.2909v3", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1009.2909v3", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "8 pages, 3 figures. Several additional formulae were included", "arxiv_primary_category": {"term": "hep-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "hep-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "nucl-ex", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "nucl-th", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1009.2909v3", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1009.2909v3", "journal_reference": "Phys.Rev.C83:038203,2011", "doi": "10.1103/PhysRevC.83.038203", "fulltext": "INHA-NTG-08/2010\n\nBinding energy per nucleon and hadron properties in nuclear matter\nUlugbek Yakhshiev1, ∗ and Hyun-Chul Kim1, †\n1\n\nDepartment of Physics, Inha University, Incheon 402-751, Republic of Korea\n(Dated: February, 2011)\n\narXiv:1009.2909v3 [hep-ph] 8 Feb 2011\n\nWe investigate the binding energy per nucleon and hadron properties in infinite and homogeneous\nnuclear matter within the framework of the in-medium modified Skyrme model. We first consider the\nmedium modifications of the single hadron properties by introducing the optical potential for pion\nfields into the original Lagrangian of the Skyrme model. The parameters of the optical potential are\nwell fitted to the low-energy phenomenology of pion-nucleus scattering. Furthermore, the Skyrme\nterm is also modified in such a way that the model reproduces bulk properties of nuclear matter,\nin particular, the binding energy per nucleon. The present approach is self-consistent: the single\nhadron properties in a nuclear medium, their effective in-medium interactions, and the bulk matter\nproperties are treated on the same footing.\n\n∗\n†\n\nyakhshiev@inha.ac.kr\nhckim@inha.ac.kr\n\n\f2\nI.\n\nINTRODUCTION\n\nThe equation of state (EOS), which gives the density dependence of the binding energy per nucleon for a given\nnucleus, has been one of the most importance issues in nuclear many-body problems. There is a great amount\nof different theoretical approaches in trying to describe the EOS and, clearly, we can mention only some of few\nrepresentatives [1–7]. In general, those approaches and corresponding representatives can be classified into three\nclasses as microscopic many-body approaches [1–4], effective field theories [5, 6], and phenomenological methods [7].\nThese works for many-body problems provide very useful tools for understanding properties of dense and hot matter.\nOn the other hand, the Skyrme model [8, 9] also presents a simple but good framework for investigating bulk\nproperties of nuclear matter. In general, one can classify various Skyrmion approaches into two subclasses: In the\nfirst one investigations are mainly devoted to the classical crystalline structure and its behavior under the extreme\nconditions [10, 11]. In the second approach the properties of exotic many-baryon systems were treated [12–14]. There\nare also some early attempts to explain many-body systems within the Skyrme model [15, 16], considering the single\nskyrmion in hypersphere.\nMoreover, there is an another alternative way to examine properties of nuclear matter within the Skyrme model,\ni.e. to study the properties of the single skyrmion in nuclear matter [17]. Furthermore, the medium-modified Skyrme\nmodel [17, 18], in connection with quantum-mechanical variational methods [19] (like the Hartree-Fock method), can\nbe applied to the analysis of the bulk properties of nuclear matter [20]. To perform this analysis, it is essential to know\nthe properties of the single hadron and the N N interaction in a symmetric [17, 18] as well as asymmetric [21]) nuclear\nenvironment. Consequently, the behavior of the hadrons in nuclear medium must be taken into account. However,\nthe variational calculations can only estimate the upper boundary value of minimized quantities. Thus, one may still\nconsider how to improve the results.\nAs a more realistic approach, the in-medium modified Skyrme model [17] itself can be used so as to reproduce\nthe properties of the single hadron in nuclear matter as well as those of matter in bulk. This is the aim of the\npresent work. To carry out the proposed goal, we consider not only the changes of the kinetic and mass terms of the\nstandard Skyrme Lagrangian as done in Ref. [17] but also possible modifications of the Skyrme term. It is well known\nthat Skyrme's quartic stabilizing term may be related to vector mesons [22] that can be realized in implicit gauge\nsymmetry of the nonlinear sigma model Lagrangian [23]. In this sense, the modification of the Skyrme parameter\nmay be pertinent to the changes of the vector mesons in nuclear matter.\nThe present work is organized as follows: in the next Section, we explain how the original Skyrme model can be\nmodified in medium. In Section III, we present the corresponding numerical results and discuss them. In particular,\nwe show that the quartic Skyrme term can be modified in such a way that it minimizes the binding energy per\nnucleon. We discuss the changes of the mass splitting of the nucleon and the ∆ isobar and those of the πN N coupling\nconstant. We also estimate the symmetry energy in the Weizsäcker-Bethe-Bacher formula. The last Section is devoted\nto summary and outlook of this work.\n\nII.\n\nMEDIUM MODIFICATION OF HADRON PROPERTIES\n\nIn Ref. [17], the in-medium modified Skyrme Lagrangian was presented, the mass term being modified based on\nthe phenomenology of low-energy pion-nucleus scattering. The modified mass term leads also to the changes of the\nkinetic term. In the present work, we additionally consider the modification of the Skyrme stabilizing term. The\nresulting Lagrangian is given as follows:\n\u0013\u0012\n\u0013\n\u0012\nF2\nF2\n∂U †\n1\n∂U\nL∗ = π Tr\n− π αp (r)Tr(∇U ) * (∇U † ) +\nTr[U † ∂μ U, U † ∂ν U ]2\n16\n∂t\n∂t\n16\n32e2 γ(r)\nF 2 m2\n+ π π αs (r)Tr(U + U † − 2) ,\n(1)\n16\nwhere Fπ denotes the pion decay constant, e is the Skyrme parameter, and mπ stands for the pion mass. The medium\nfunctionals αs and αp are written in the following forms\nαs = 1 −\n\n4πb0 ρ(r)f\n,\nm2π\n\nαp = 1 −\n\n4πc0 ρ(r)\n,\nf + g0′ 4πc0 ρ(r)\n\n(2)\n\nwhich represent the influence of the surrounding environment on the properties of the single skyrmion. These parameters are related respectively to the corresponding phenomenological S- and P -wave pion-nucleus scattering lengths\nand volumes, i.e. b0 and c0 , and describe the pion physics in a baryon-rich environment [24]. The density of the surrounding nuclear environment is given by ρ, g0′ denotes the Lorentz-Lorenz or correlation parameter, f = 1+mπ /mfree\nN\n\n\f3\nrepresents the kinematical factor, and mfree\nis the nucleon mass in free space. In addition to these changes of the\nN\nmass and kinetic terms done in Ref. [17], we introduce the new density-dependent functional γ(r) = γ(ρ(r)) which\nprovides the in-medium dependence of the Skyrme parameter, i.e. e2 → e∗2 = e2 γ. As mentioned in Introduction,\nthis medium modification can be related to the density dependence of vector meson properties. Furthermore, to fix\nthis additional dependence in the present work, we will concentrate on the bulk properties of infinite and homogenous\nnuclear matter with constant density (ρ = const). Note that the Lagrangian (1) is modified in such a way [17] that at\nzero density it reduces to the original Lagrangian of the Skyrme model and at the linear approximation it reproduces\nthe well-known equation of the pion fields in nuclear medium [24].\nIn order to analyze the field equation for the classical pion field in homogenous nuclear matter one can choose the\nspherically symmetric \"hedgehog\" form for the boson field U = exp{in̂ * τ F (r)}, where n denotes the unit vector\nin coordinate space, τ are the usual Pauli matrices, and F (r) stands for the profile function of the pion field. The\npertinent field equation, which is given as\n\u0013\n\u0012\n\u0001\n4s2\n(3)\nF ′′ (x) αp γx2 + 8s2 + 2αp γxF ′ (x) − αs γβ 2 x2 s + 4F ′ (x)2 − αp γ − 2 sin(2F ) = 0,\nx\nis obtained by minimizing the medium-modified mass of the static skyrmion\n\u0012\n\u0013\n\u001b\n\u0013\n\u001a \u0012 2 ′2\nZ\nπFπ ∞\nsin2 F\nx F\n4 sin2 F\n2 2\nMS∗ =\nF ′2 +\n+\nα\nβ\nx\n(1\n−\ncos\nF\n)\n,\n+ sin2 F +\ndx αp\ns\ne\n2\nγ\n2x2\n0\n\n(4)\n\nIn the last two expressions, we have introduced the dimensionless variable x = eFπ r and the new constant β =\nmπ /(eFπ ).\nThe collective quantization of the classical skyrmion [9] yields the in-medium modified nucleon mass and the\ncorresponding ∆ − N mass splitting respectively as\nm∗N = MS∗ +\nλ∗ =\n\n2π\n3e3 Fπ\n\n3\n,\n8λ∗\nZ ∞\n0\n\n3\nm∗∆−N =\n,\n2λ∗\n\u0012\n\u0013\u001b\n\u001a\nsin2 F\n4\n′2\n2\n2\nF +\n,\ndx x sin F 1 +\nγ\nx2\n\n(5)\n\nwhere λ∗ denotes the in-medium moment of inertia of the skyrmion. The meson-baryon vertices in nuclear matter\ncan be derived by calculating the in-medium modified πN N form factor [18]\nZ ∞\n∗\n4πMN\nj1 (q̃x)\n∗\n2\nGπN N (q ) =\nαp\nSπ (x)x3 dx ,\n(6)\n3e2 Fπ\nq̃x\n0\nwhere q̃ = q/eFπ , j1 (qx) is the spherical Bessel function with order 1 and Sπ (x) is defined as\n\u0001\n\u0001\n2\nSπ (x) = − 2x−1 F ′ + F ′′ cos F + F ′2 + 2x−2 + αs α−1\np mπ sin F .\n\n(7)\n\nUsing the Lagrangian given in Eq. (1), one can calculate the in-medium modifications of the single nucleon properties\nand the pion-nucleon coupling constant. Note that the parameters of the model are fitted to be Fπ = 108.78 MeV and\ne = 4.85 so as to reproduce the experimental values of the nucleon and ∆ in free space. Consequently, the pion mass\nis also fixed to be its experimental value for the neutral pion, i.e. mπ = 134.98 MeV. A set of values of parameters in\nthe medium functionals (2) are taken from the analysis of phenomenological data for pion-nucleus scattering [24].\nIII.\n\nNUMERICAL RESULTS AND DISCUSSIONS\n\nAs is clear from the discussions in the previous Section, if the modification of the Skyrme term is ignored, the values\nof all input parameters are fitted to the phenomenology or taken from it. When, however, the Skyrme term is modified,\nwe introduce one additional functional γ(ρ) which, in general, may be related to the vector meson properties in nuclear\nmatter. One can also note that the lessening value of the Skyrme parameter in nuclear medium may correspond to\na decrease of the gρππ coupling and, therefore, to the change of the rho meson width in nuclear matter or to a\ndiminishing value of its mass in medium, i.e. m∗ρ /mρ < 1. There are experimental indications to those changes of the\nρ meson properties [25–27] and the theoretical predictions [28, 29]. Following the ideas presented in those theoretical\napproaches, one may be able to fit γ. However, it is still under debate how the properties of the ρ meson undergo in\nmedium both theoretically and experimentally, and model-dependent. Thus, in the present work, we will proceed to\nfit the form of the functional γ to the bulk properties of nuclear matter rather than following a specific model.\n\n\f4\nAs a first step, we explicitly choose its form to reproduce the first coefficient (volume term) in the semiempirical\nWeizsäcker-Bethe-Bacher mass formula. Then the binding energy per nucleon at a given density can be defined simply\nas\n∆EB=1 = m∗N (ρ) − mfree\nN .\n\n(8)\n\nThis is somehow a crude approximation but a comprehensive one. One could even fit the form of γ by investigating\ndifferent terms in the mass formula and by examining the interplay between them. However, within the present work,\nthe approximation defined in Eq. (8) will be enough for the qualitative analysis of the changes due to the modification\nof the Skyrme parameter.\nIn the present calculation we have tried various forms of the dependence of γ on the nuclear density ρ such as linear,\nquadratic, polynomial, exponential forms, etc. It turns out that the best fit to the ground state of nuclear matter is\nachieved by the following form\n\u0013\n\u0012\nγnum ρ\n,\n(9)\nγ(ρ) = exp −\n1 + γden ρ\nwhere γnum and γden are variational parameters. Let us first discuss the behavior of the binding energy when the\n\n0 ....\n\n∆EB=1 [MeV]\n\n−10\n−20\n−30\n−40\n\n.............\n.......\n.\n.\n.\n.\n.\n.\n.\n.\n........\n.....\n.\n.\n.\n.........\n.\n.\n.\n................\n.......\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n... ...............\n... ...................................................\n...\n....\n....\n....\n....\n.....\n.....\n......\n......\n.......\n........\n.....\n\n0.0\n\n0.5\n\n1.0\n\n1.5\n\n2.0\n\n−100\n−200\n−300\n−400\n\n2.5\n\nρ/ρ0\nFIG. 1. (Color online). The binding energy per nucleon as a function of ρ/ρ0 . The solid curve (left scale) corresponds to the\n−3\n−3\nparametrization of γ in Eq. (9), with γnum = 2.1m−3\nπ , γden = 1.45mπ and P -wave scattering volume c0 = 0.21mπ used. The\n−3\n−3\ndashed one (left scale) draws the case when γnum = 0.8m−3\n,\nγ\n=\n0.5m\nand\nP\n-wave\nscattering\nvolume\nc\n0 = 0.09mπ .\nden\nπ\nπ\n−1\n′\nS-wave scattering length is fixed at b0 = −0.024mπ and the correlation parameter has value g = 0.7. The dotted one (right\nscale) shows the case that Skyrme term intact in nuclear matter and consequently γ(ρ) = 1. The normal nuclear density is\ngiven as ρ0 = 0.5m3π .\n\nSkyrme term is intact in nuclear matter, i.e. γ(ρ) = 1. The corresponding binding energy is depicted as the dotted\ncurve in Fig. 1 with the energy scale drawn at the right vertical axis. One can note that in this case the binding\nenergy monotonically falls off as the density increases. In the language of the single skyrmion, it indicates that the\nskyrmion swells to a larger volume and all skyrmions of the system start to overlap. Thus, the density of the system\ncontinuously increases. This is not surprising, because the medium modification in this case can be simply related to\n√\nthat of the pion decay constant Fπ → Fπ∗ = Fπ αp . For the moment, one can ignore the explicit chiral symmetry\nbreaking term in the Lagrangian, because its influence to the stability is rather small in comparison with the effects\ncoming from the first two terms. The decreasing value of the pion decay constant changes the contribution from the\nnonlinear kinetic term. As a result the skyrmions swell to the larger volume and it is necessary to prevent this by some\nmechanism. It implies that one must introduce either strong repulsive N N interactions at short distances or some\nmean-field mechanism as in the Walecka model [6, 7]. However, one interesting way to avoid this collapse may be to\nmodify the Skyrme term and it is also physically motivated as discussed at the beginning of this Section. Moreover,\nit is much simpler and transparent to consider the modification of the Skyrme term.\n\n\f5\nWe also present two different results with the modified Skyrme term in Fig. 1: The solid and dashed curves draw\nthe parametrization of Eq. (9) with the energy scale depicted at the left vertical axis. Note that the values of the\nvariational parameters, γnum and γden , are chosen in a such way that the minimum of the binding energy occurs at the\nnormal nuclear matter density and reproduces correctly the first coefficient in the empirical formula for the binding\nenergy. The difference between these two curves is due to the fact that we use two different values of the P -wave\n−3\nscattering length, i.e. c0 = 0.21m−3\nπ for the solid curve and c0 = 0.09mπ for the dashed one. The results show that\nthe dependence on the density is rather insensitive to the changes of input parameters from pion-nucleus scattering\nphenomenology and moreover the effect of the changes in b0 is even milder.\nIn order to see the validity of Eq. (9), it is of great importance to examine the changes of other physical observables.\nLet us first discuss thermodynamic properties of nuclear matter. The pressure is given by the following formula\np=ρ\n\n∂ǫ\n∂∆EB=1\n− ǫ = ρ2\n,\n∂ρ\n∂ρ\n\n(10)\n\nwhere ǫ is the total binding energy of nuclear matter per unit volume. It vanished naturally at the equilibrium point\nand for the parametrization of Eq. (9). We want to emphasize that the pressure is always decreasing with the Skyrme\nterm intacted.\nAnother important quantity is the compressibility of nuclear matter expressed as\n\u001a 2\n\u0013\n\u0012 2 ′2\nZ\nπFπ ∞\n∂ αs\nx F\n∂ 2 ∆EB=1\n2\n2\n=\n9ρ\n+\nsin\nF\n(11)\ndx\nK = 9ρ20\n0\n∂ρ2\n∂ρ2 ρ=ρ0 e\n2\n0\nρ=ρ0\n\u0014\n\u0012 \u0013\n\u0013\n\u0013\n\u0015\u001b\n\u0012\n\u0012\nZ\nZ ∞\n∂2\n4πFπ ∞\nπ\n1\nsin2 F\nsin2 F\n2\n2\n′2\n′2\n2\n+\nsin\nF\n−\nsin\nF\n,\nF\n+\ndx\nF\n+\ndx\nx\n∂ρ2 γ ρ=ρ0\ne\n2x2\ne3 Fπ λ∗2 0\nx2\n0\nand the corresponding results are listed in Table I with two different values of the S-wave scattering length b0 [24]\nused. The results show that the compressibility of nuclear matter and the effective ∆ − N mass difference are rather\n−3\n−3\n−3\nb0 [m−1\nπ ] c0 [mπ ] γnum [mπ ] γden [mπ ]\n−0.024\n0.21\n2.098\n1.451\n0.15\n1.448\n0.998\n−0.024\n−0.024\n0.09\n0.797\n0.496\n−0.029\n0.21\n2.106\n1.506\n−0.029\n0.15\n1.444\n1.031\n0.09\n0.785\n0.502\n−0.029\n\nK [MeV] m∗N−∆ [MeV]\n1647.47\n105.21\n1148.18\n129.39\n582.79\n170.34\n1637.16\n107.13\n1142.00\n131.59\n580.03\n172.91\n\nTABLE I. Compressibility of nuclear matter K and an effective ∆-nucleon mass difference m∗N−∆ at the normal nuclear matter\ndensity ρ0 = 0.5m3π . The variational parameters γnum and γden are fitted to reproduce the minimum of the binding energy per\nnucleon ∼ 15.7 MeV at the normal nuclear matter density. The correlation parameter is taken to be g ′ = 0.7.\n\nstable under the change of b0 . On the contrary, they are quite sensitive to the value of P -wave scattering volume c0 .\nAt the empirical value of c0 = 0.21m−3\nπ , the compressibility turns out to be very large (K ∼ 1640 MeV) in comparison\nwith those obtained in relativistic Dirac-Brueckner-Hartree-Fock approaches [3, 4] and in the Walecka model [7]. We\nfind that as lower values of c0 are used K is noticeably decreased. For example, for c0 = 0.09m−3\nπ the compressibility\nis already consistent with that of the Walecka model (K ∼ 580 MeV). If one uses even a smaller value of c0 such\nas c0 = 0.06m−3\nπ , the result of K is further brought down to be comparable with that in Dirac-Brueckner-HartreeFock approaches (K ∼ 300 MeV), which is close to the empirical value. It indicates that the present work prefers\nsmaller values of c0 than that used in the pionic atom analysis as far as the compressibility is concerned. Note that\na similar conclusion about c0 was drawn from the analysis of an effective axial-vector coupling within the original\nmedium-modified Skyrme model [17]. We remind that K is sensitive to the position of the saturation point. Fitting\nthe saturation point at slightly lower densities, we see that the compressibility decreases drastically. However, the\nsituation may change if one considers a more accurate approximation with the surface and symmetry energy terms\nexplicitly taken into account in Eq. (8).\nIn Fig. 2, the dependence of the ∆ − N mass difference on the nuclear matter density is drawn. The results show\nthat the modified Skyrme term leads to rather different results from that without the modification. With the Skyrme\nterm modified (see solid and dashed curves), the results of m∗∆−N fall off faster as the density increases in comparison\nwith that with the original Skyrme term (see dotted curve). Of course, this is due to the explicit density dependence\nof the moment of inertia (5) through the additional density functional γ. It implies that it is easier to make the\n\n\f6\n\nm∗∆−N [MeV]\n\n300 ...\n\n.......\n...........\n. .. ...\n250 .... .... ......\n... .... .......\n... .... ..........\n.............\n.. ..\n...\n200\n......................\n.. .. .\n....\n.\n.\n....\n.........\n.....\n.\n.\n.\n..........\n......\n150\n...........\n.......\n...............\n.........\n...................\n............\n...\n.................\n100\n.........................\n.................................\n50\n0.0\n\n0.5\n\n1.0\n\n1.5\n\n2.0\n\n2.5\n\nρ/ρ0\nFIG. 2. (Color online). The density dependence of the ∆ − N mass difference in nuclear matter. The notations and input\nparameters are the same as those in Fig. 1.\n\nnucleon excited to the ∆ state in nuclear matter, which seems more realistic than that without the modification of\nthe Skyrme term.\nIn Fig. 3, the changes of the πN N coupling constant are depicted. Here the modifications of the Skyrme term bring\n\n15\n\n∗\ngπNN\n\n..............................................................................................................................................\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n...\n.......\n...................\n...\n12 ................. .. ...... .. ..\n......\n...\n....\n...\n....\n...\n.\n9\n.....\n...\n.....\n...\n......\n..\n.\n.......\n6\n..\n........\n...\n..........\n..\n............\n....\n.\n.\n.\n.\n.\n.\n3\n..\n.\n0.0\n\n0.5\n\n1.0\n\n1.5\n\n2.0\n\n2.5\n\nρ/ρ0\nFIG. 3. (Color online). The dependence of πN N coupling constant on the density. Notations are similar to those in Fig. 1.\n∗\nabout more dramatic results. When the Skyrme term is intact, i.e. γ = 1, gπN\nN monotonically decreases as the density\nincreases (see the dotted curve in Fig. 3). However, when one introduces the density dependence of the Skyrme term,\nthe results are noticeably changed. Using the parametrization of Eq. (9) with the different values of input parameter\nc0 , we find that the πN N coupling in medium changes drastically. For example, with the value of c0 = 0.09m−3\nπ the\n∗\nin-medium pion-nucleon coupling constant gπN\nstarts\nto\nincrease\nmonotonically\nup\nto\nhigh\n(ρ\n∼\n5ρ\n)\ndensities\nas\n0\nN\n∗\n−3\ndrawn in the dashed curve. The gπN\nwith\nc\n=\n0.09m\nwill\ndisappear\nat\naround\nρ\n∼\n5ρ\n.\nOn\nthe\nother\nhand,\nif\none\n0\n0\nπ\nN\nuses c0 = 0.21m−3\nπ , it is getting increased up to the normal nuclear matter density and stays more or less constant.\nThen it slowly falls off as the density increases. When it approaches the critical point ρ ∼ 2.54ρ0 , it drops sharply\n\n\f7\nand goes to zero (see the solid curve in Fig. 3). Above the critical point (ρ > ρcrit ≈ 2.54ρ0 ), the skyrmion does not\nexist. It is not surprising, because the sign of the combination αp γ in Eq. (3) is changed and therefore there is no\nstable solitonic solution anymore.\nLet us draw the attention again to the bulk properties of nuclear matter in order to understand the modifications\nof the Skyrme term better. Following Klebanov [10], after quantizing and using the formula presented in Ref. [30],\none can estimate the symmetry energy in the semiempirical formula for the nuclear binding energy:\nEsym =\n\n1 ∗\nm\n.\n12 ∆−N\n\n(12)\n\nThis crude formula of the symmetry energy already provides the enlightening results. For example, γ parameterized\n−3\nas in Eq. (9), Esym (ρ0 ) ≈ 14.19 MeV for c0 = 0.09m−3\nπ whereas Esym (ρ0 ) ≈ 8.71 MeV for c0 = 0.21mπ . These\nresults for the symmetry energy must be compared with the experimental one Esym ∼ 20 − 30 MeV. The order of\nthe symmetry energy calculated within the Skyrme model is comparable to the experimental data. To estimate the\nsymmetry energy more accurately, however, one should consider the minimization of the whole binding energy taking\ninto account the interplay between the different terms in the mass formula as we stated already. Moreover, one should\nconsider the effects of finite nuclei and explicit isospin-breaking effects and so on. We want to mention that this is also\npossible within the in-medium modified Skyrme model and can be done as in Refs. [21, 31], an additional modification\nof the Skyrme term being performed as was done in the present work.\n\nIV.\n\nSUMMARY AND OUTLOOK\n\nIn the present investigation, we aimed at studying the modifications of the quartic term in the Skyrme model. The\nresults from this work shows that the additional modifications change dramatically the whole picture and allows one\nto understand the role of the modifications in a more comprehensive way. One can note that an alternative approach\nto many-body systems within the Skyrme model [12, 13] points to the changes of the input parameters (so called\n\"calibration\") according to the number of baryons in the system. Within our approach these changes were shown in\na more realistic and transparent way and were treated not only at the level of the system but also at the level of its\nconstituents.\nFrom the previous studies we know that the large renormalization of the nucleon mass in nuclear medium causes\none of the difficulties to bind the infinite nuclear matter [20] and to reproduce the correct values of the Nolen-Schiffer\nanomaly in mirror nuclei within the in-medium modified Skyrme model [21]. The relatively small change of the\nnucleon mass in nuclear matter within the present approach is an interesting result, which can be used to reproduce\nthe correct value of the Nolen-Schiffer anomaly. In addition to the small nucleon mass renormalization, the dramatic\nchanges in the pion-nucleon coupling constant gives the opportunity to revise the previous investigation on nuclear\nmatter related to the quantum-mechanical many-body problems [20].\nMore completely, one can improve the present approach by treating the density of the system in a fully consistent\nway. Since it is a sum of the single skyrmion densities in a given initial configuration and one can study the equilibration\nof the matter to its ground state, taking into account the deformation effects on the properties of its constituents [31].\nHaving considered the modification of the Skyrme term, we assert that the present approach is self-consistent:\nit treats the single hadron properties, the hadron-hadron interactions and the bulk matter properties on an equal\nfooting. Moreover, it is closely related to phenomenological low-energy data at the single-hadron level as well as at\nthe level of hadronic systems. The present approach can be extended to the studies of the properties of finite nuclei\nand its constituents.\n\nACKNOWLEDGMENTS\n\nThe authors are grateful to H.K. Lee for the discussion of the symmetry energy within the Skyrme model. The\npresent work is supported by Basic Science Research Program through the National Research Foundation of Korea\n(NRF) funded by the Ministry of Education, Science and Technology (grant number: 2009-0089525).\n\n[1] E. Chabanat, J. Meyer, P. Bonche, R. Schaeffer and P. Haensel, Nucl. Phys. A 627, 710 (1997).\n[2] E. Chabanat, P. Bonche, P. Haensel, J. Meyer and R. Schaeffer, Nucl. Phys. A 635 (1998) 231.\n[3] B. Ter Haar and R. Malfliet, Phys. Rept. 149, 207 (1987).\n\n\f8\n[4]\n[5]\n[6]\n[7]\n[8]\n[9]\n[10]\n[11]\n[12]\n[13]\n[14]\n[15]\n[16]\n[17]\n[18]\n[19]\n[20]\n[21]\n[22]\n[23]\n[24]\n[25]\n[26]\n[27]\n[28]\n[29]\n[30]\n[31]\n\nR. Brockmann and R. Machleidt, Phys. Rev. C 42, 1965 (1990).\nF. Hofmann, C. M. Keil and H. Lenske, Phys. Rev. C 64, 034314 (2001).\nB. D. Serot and J. D. Walecka, Int. J. Mod. Phys. E 6, 515 (1997).\nB. D. Serot and J. D. Walecka, Adv. Nucl. Phys. 16, 1 (1986).\nT. H. R. Skyrme, Nucl. Phys. 31 (1962) 556.\nG. S. Adkins, C. R. Nappi and E. Witten, Nucl. Phys. B 228 (1983) 228.\nI. R. Klebanov, Nucl. Phys. B 262, 133 (1985).\nH. J. Lee, B. Y. Park, D. P. Min, M. Rho and V. Vento, Nucl. Phys. A 723, 427 (2003).\nR. Battye, N. S. Manton and P. Sutcliffe, Proc. Roy. Soc. Lond. A 463, 261 (2007).\nN. S. Manton and S. W. Wood, Phys. Rev. D 74, 125017 (2006).\nO. V. Manko and N. S. Manton, J. Phys. A 40, 3683 (2007).\nN. S. Manton and P. J. Ruback, Phys. Lett. B 181, 137 (1986).\nA. D. Jackson, C. Weiss, A. Wirzba and A. Lande, Nucl. Phys. A 494 (1989) 523.\nA. Rakhimov, M. M. Musakhanov, F. C. Khanna and U. T. Yakhshiev, Phys. Rev. C 58, 1738 (1998).\nA. M. Rakhimov, F. C. Khanna, U. T. Yakhshiev and M. M. Musakhanov, Nucl. Phys. A 643 (1998) 383.\nD. Diakonov and A. D. Mirlin, Sov. J. Nucl. Phys. 47 (1988) 21.\nU. T. Yakhshiev, M. M. Musakhanov and H. C. Kim, Phys. Lett. B 628 (2005) 33.\nU. G. Meissner, A. M. Rakhimov, A. Wirzba and U. T. Yakhshiev, Eur. Phys. J. A 32 (2007) 299.\nU. G. Meissner, Phys. Rept. 161 (1988) 213.\nM. Bando, T. Kugo, S. Uehara, K. Yamawaki and T. Yanagida, Phys. Rev. Lett. 54, 1215 (1985).\nT. Ericson and W. Weise, Pions and Nuclei (Clarendon, Oxford, 1988).\nK. Ozawa et al. [E325 Collaboration], Phys. Rev. Lett. 86 (2001) 5019 [arXiv:nucl-ex/0011013].\nM. Naruki et al., Phys. Rev. Lett. 96 (2006) 092301 [arXiv:nucl-ex/0504016].\nD. P. Weygand, C. Djalali, R. Nasseripour and M. Wood [CLAS Collaboration], Int. J. Mod. Phys. A 22 (2007) 380.\nG. E. Brown and M. Rho, Phys. Rev. Lett. 66 (1991) 2720.\nT. Hatsuda and S. H. Lee, Phys. Rev. C 46 (1992) 34.\nH. K. Lee, B. Y. Park and M. Rho, arXiv:1005.0255 [nucl-th].\nU. G. Meissner, A. M. Rakhimov, A. Wirzba and U. T. Yakhshiev, Eur. Phys. J. A 36, 37 (2008).\n\n\f"}