{"id": "http://arxiv.org/abs/0802.4247v2", "guidislink": true, "updated": "2008-04-29T11:57:14Z", "updated_parsed": [2008, 4, 29, 11, 57, 14, 1, 120, 0], "published": "2008-02-28T17:50:59Z", "published_parsed": [2008, 2, 28, 17, 50, 59, 3, 59, 0], "title": "Numerical study of entanglement entropy in SU(2) lattice gauge theory", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0802.2841%2C0802.4175%2C0802.2959%2C0802.1462%2C0802.2691%2C0802.2524%2C0802.1171%2C0802.4358%2C0802.2301%2C0802.2183%2C0802.2839%2C0802.2016%2C0802.4247%2C0802.0445%2C0802.0427%2C0802.2164%2C0802.1499%2C0802.3052%2C0802.1827%2C0802.4044%2C0802.0142%2C0802.2828%2C0802.3086%2C0802.1198%2C0802.4397%2C0802.1842%2C0802.3421%2C0802.3504%2C0802.0344%2C0802.0712%2C0802.4309%2C0802.1367%2C0802.1947%2C0802.4187%2C0802.3451%2C0802.2526%2C0802.3003%2C0802.0141%2C0802.0176%2C0802.1411%2C0802.3895%2C0802.2797%2C0802.4323%2C0802.2918%2C0802.4275%2C0802.2571%2C0802.2758%2C0802.2739%2C0802.2696%2C0802.4338%2C0802.2305%2C0802.0539%2C0802.0086%2C0802.2238%2C0802.1571%2C0802.2160%2C0802.1734%2C0802.2090%2C0802.1965%2C0802.1228%2C0802.1305%2C0802.1368%2C0802.2720%2C0802.2552%2C0802.1200%2C0802.0939%2C0802.3547%2C0802.0605%2C0802.3876%2C0802.1059%2C0802.1909%2C0802.1881%2C0802.1233%2C0802.1542%2C0802.0793%2C0802.0383%2C0802.3758%2C0802.1393%2C0802.1636%2C0802.4207%2C0802.4449%2C0802.2529%2C0802.0126%2C0802.2832%2C0802.0358%2C0802.1524%2C0802.0573%2C0802.0708%2C0802.0889%2C0802.3084%2C0802.0841%2C0802.0452%2C0802.3077%2C0802.2955%2C0802.2367%2C0802.2378%2C0802.2249%2C0802.0925%2C0802.2921%2C0802.0400%2C0802.1266&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Numerical study of entanglement entropy in SU(2) lattice gauge theory"}, "summary": "The entropy of entanglement between a three-dimensional slab of thickness l\nand its complement is studied numerically for four-dimensional SU(2) lattice\ngauge theory. We find a signature of a nonanalytic behavior of the entanglement\nentropy, which was predicted recently for large N_c confining gauge theories in\nthe framework of AdS/CFT correspondence. The derivative of the entanglement\nentropy over l is likely to have a discontinuity at some l = l_c. It is argued\nthat such behavior persists even at finite temperatures, probably turning into\na sort of crossover for temperatures larger than the temperature of the\ndeconfinement phase transition. We also confirm that the entanglement entropy\ncontains quadratically divergent l-independent term, and that the nondivergent\nterms behave as the inverse square of l at small distances.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0802.2841%2C0802.4175%2C0802.2959%2C0802.1462%2C0802.2691%2C0802.2524%2C0802.1171%2C0802.4358%2C0802.2301%2C0802.2183%2C0802.2839%2C0802.2016%2C0802.4247%2C0802.0445%2C0802.0427%2C0802.2164%2C0802.1499%2C0802.3052%2C0802.1827%2C0802.4044%2C0802.0142%2C0802.2828%2C0802.3086%2C0802.1198%2C0802.4397%2C0802.1842%2C0802.3421%2C0802.3504%2C0802.0344%2C0802.0712%2C0802.4309%2C0802.1367%2C0802.1947%2C0802.4187%2C0802.3451%2C0802.2526%2C0802.3003%2C0802.0141%2C0802.0176%2C0802.1411%2C0802.3895%2C0802.2797%2C0802.4323%2C0802.2918%2C0802.4275%2C0802.2571%2C0802.2758%2C0802.2739%2C0802.2696%2C0802.4338%2C0802.2305%2C0802.0539%2C0802.0086%2C0802.2238%2C0802.1571%2C0802.2160%2C0802.1734%2C0802.2090%2C0802.1965%2C0802.1228%2C0802.1305%2C0802.1368%2C0802.2720%2C0802.2552%2C0802.1200%2C0802.0939%2C0802.3547%2C0802.0605%2C0802.3876%2C0802.1059%2C0802.1909%2C0802.1881%2C0802.1233%2C0802.1542%2C0802.0793%2C0802.0383%2C0802.3758%2C0802.1393%2C0802.1636%2C0802.4207%2C0802.4449%2C0802.2529%2C0802.0126%2C0802.2832%2C0802.0358%2C0802.1524%2C0802.0573%2C0802.0708%2C0802.0889%2C0802.3084%2C0802.0841%2C0802.0452%2C0802.3077%2C0802.2955%2C0802.2367%2C0802.2378%2C0802.2249%2C0802.0925%2C0802.2921%2C0802.0400%2C0802.1266&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "The entropy of entanglement between a three-dimensional slab of thickness l\nand its complement is studied numerically for four-dimensional SU(2) lattice\ngauge theory. We find a signature of a nonanalytic behavior of the entanglement\nentropy, which was predicted recently for large N_c confining gauge theories in\nthe framework of AdS/CFT correspondence. The derivative of the entanglement\nentropy over l is likely to have a discontinuity at some l = l_c. It is argued\nthat such behavior persists even at finite temperatures, probably turning into\na sort of crossover for temperatures larger than the temperature of the\ndeconfinement phase transition. We also confirm that the entanglement entropy\ncontains quadratically divergent l-independent term, and that the nondivergent\nterms behave as the inverse square of l at small distances."}, "authors": ["P. V. Buividovich", "M. I. Polikarpov"], "author_detail": {"name": "M. I. Polikarpov"}, "author": "M. I. Polikarpov", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1016/j.nuclphysb.2008.04.024", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/0802.4247v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0802.4247v2", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "10 pages RevTeX, 8 figures, 1 table. Major revision of the\n  introductory section, several references added, some plots updated", "arxiv_primary_category": {"term": "hep-lat", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "hep-lat", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "hep-th", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0802.4247v2", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0802.4247v2", "journal_reference": "Nucl.Phys.B802:458-474,2008", "doi": "10.1016/j.nuclphysb.2008.04.024", "fulltext": "ITEP-LAT/2008-07\n\nNumerical study of entanglement entropy in SU (2) lattice gauge theory\nP. V. Buividovich1, 2, ∗ and M. I. Polikarpov2, †\n\narXiv:0802.4247v2 [hep-lat] 29 Apr 2008\n\n1\n\nJIPNR, National Academy of Science, 220109 Belarus, Minsk, Acad. Krasin str. 99\n2\nITEP, 117218 Russia, Moscow, B. Cheremushkinskaya str. 25\n(Dated: April 15, 2008)\n\nThe entropy of entanglement between a three-dimensional slab of thickness l and its complement\nis studied numerically for four-dimensional SU (2) lattice gauge theory. We find a signature of\na nonanalytic behavior of the entanglement entropy, which was predicted recently for large Nc\nconfining gauge theories in the framework of AdS/CFT correspondence. The derivative of the\nentanglement entropy over l is likely to have a discontinuity at some l = lc . It is argued that\nsuch behavior persists even at finite temperatures, probably turning into a sort of crossover for\ntemperatures larger than the temperature of the deconfinement phase transition. We also confirm\nthat the entanglement entropy contains quadratically divergent l-independent term, and that the\nnondivergent terms behave as l−2 at small distances.\nPACS numbers: 12.38.Aw; 03.65.Ud\n\nI.\n\nINTRODUCTION\n\nThe application of the concepts of quantum information theory to quantum field theories in continuous spacetimes and on the lattices has led recently to many important advances in our understanding of their quantum\nbehavior [1, 2, 3, 4, 5, 6]. One such concept is the\nquantum entanglement of states of systems with many\ndegrees of freedom, which turned out to be a very useful model-independent characteristic of the structure of\nthe ground state of quantum fields. In particular, for\nquantum fields on the lattice in the vicinity of a quantum phase transition (i.e. a phase transition which occurs at zero temperature when some parameters of the\nsystem, such as the coupling constants, are varied) the\nground state is a strongly entangled superposition of the\nstates of all elementary lattice degrees of freedom (such\nas spins in Heisenberg model, or link variables in lattice\ngauge theory), and different phases of lattice theories can\nbe characterized by different patterns of entanglement\n[1, 2, 3, 4, 5, 6]. Quantum entanglement thus appears to\nbe an adequate concept for the description of the emergence of collective degrees of freedom in quantum field\ntheories [1, 2, 3, 4, 5].\nA commonly used measure of quantum entanglement\nof the ground state of quantum fields in (D − 1) + 1dimensional space-time is the entropy of entanglement\nS [A] between some (D − 1)-dimensional region A and\nits (D − 1)-dimensional complement B, which characterizes the amount of information shared between A and B\n[2, 4, 7]. Entanglement entropy is defined as the usual\nvon Neumann entropy for the reduced density matrix ρ̂A\nassociated with the region A:\nS [A] = −Tr A (ρ̂A ln ρ̂A )\n\n∗ Electronic\n† Electronic\n\naddress: buividovich@tut.by\naddress: polykarp@itep.ru\n\n(1)\n\nThe reduced density matrix is obtained from the density\nmatrix of the ground state of the theory, ρ̂AB = |0ih0| ,\nby tracing over all degrees of freedom which are localized\noutside of A, i.e. within B [2, 7]:\nρ̂A = Tr B ρ̂AB = Tr B |0ih0|\n\n(2)\n\nThis density matrix describes the state of quantum fields\nas seen by an observer who can only perform measurements within A. In other words, the region B is inaccessible for such an observer, as if it was separated from\nA by a sort of event horizon. Thus the entanglement\nentropy is in some sense similar to the entropy of black\nholes [8, 9].\nAs was demonstrated by Bekenstein and Hawking, the\nentropy of a black hole is proportional to the area of its\nhorizon [10, 11]. This fact has recently received an interesting development in the works [12, 13, 14, 15], where\nthis entropic \"area law\" was conjectured to hold also for\nthe entanglement entropy of field theories which are dual\n(in the sense of Maldacena, or gauge-gravity, duality [16])\nto supergravity on AdS spaces (or their thermal modifications). More precisely, the original conjecture of [12, 13]\nis that for (D − 1) + 1-dimensional conformal field theories living on the boundary of (D + 1)-dimensional AdS\nspace, the entropy of entanglement between the region\nA and its complement is proportional to the minimal\narea of hypersurface in AdS space which is spanned on\nthe boundary of A. This was explicitly demonstrated\nfor two-dimensional conformal field theories living on the\nboundary of AdS3 , for which the entanglement entropy is\nproportional to the minimal length of a line which joins\nthe ends of A in the bulk of this AdS3 (for field theories in\n1 + 1 space-time dimensions A is just a line). For higherdimensional conformal field theories which have supergravity duals the entanglement entropy is not known exactly, thus the conjecture of [12, 13] cannot be directly\nverified. Nevertheless, it was found in [12, 13] that the\n\"area law\" prescription gives at least a reasonable approximation both for zero and nonzero temperatures also\nin these cases.\n\n\f2\nTo be more specific, the results of [12, 13, 14, 15] are\nobtained for the case when A is a slab of thickness l\nin (D − 1)-dimensional space, and the entanglement entropy is normalized per unit area of the boundary ∂A\nof A. A typical behavior of entanglement entropy for\nfield theories in (D − 1) + 1-dimensional space-time is\n[12, 13, 14, 15]:\n1\n1\n1\nS (l) =\nSUV +\nSf (l) =\n|∂A|\n|∂A|\n|∂A|\nD−2\n= κ ΛUV\n− l2−D f (l)\n\n(3)\n\nwhere κ is some constant which is different for different\ntheories, ΛUV is the UV cutoff scale and f (l) is some\nfunction which is finite as l → 0. The l2−D behavior of\nthe UV finite term in (3) can be fixed by the requirement\nthat the entropy does not diverge at l → 0, which is reasonable for a local field theory. Indeed, the ultraviolet\ndivergence in (3) can only be cancelled if Sf (l) tends to\n−κ l2−D at small distances of order of Λ−1\nUV . This means\nthat the entanglement entropy associated with a set of\npoints of zero measure is finite. If the entanglement entropy is calculated as the minimal area of hypersurface\nwith boundary ∂A in the bulk geometry, the ultraviolet\ndivergence and the l2−D behavior at small distances are\nautomatically reproduced due to the singularity of the\nmetric near the boundary of AdSD+2 . Thus the nontrivial information about the entanglement due to field\ninteractions is contained in the function f (l). In terms\nof the dual geometries the function f (l) is a probe of\nthe nonsingular structure of the bulk space. For the sake\nof brevity we will restrict further discussion to the case\nD = 4. Following [14], it is convenient to introduce the\nso-called entropic C-function as follows:\nC (l) =\n\nl3 ∂\n∂\nS (l) = 2 f (l) − l f (l)\n|∂A| ∂l\n∂l\n\n(4)\n\nSince the divergent part of the entropy (3) does not depend on l, ultraviolet divergences cancel in (4), and the\nentropic C-function is UV finite. The factor l3 ensures\nthat C (l) is also finite at l → 0. For conformal field theories, this function is proportional to the central charge\nand thus counts the number of effective degrees of freedom of the theory, that is, the number of distinct field\nspecies weighted with their central charges (such as 1 for\na free boson, 1/2 for a free fermion etc.). An important\nproperty of the entropic C-function, which follows from\nZamolodchikov C-theorem [17], is that it should decrease\nas the energy scale degreases, i.e. as its argument l grows.\nSimplicity and elegance of the \"area law\" for the entanglement entropy suggest that it has a fundamental\nnature and can be applied also to nonconformal field theories which have dual supergravity descriptions. This was\ndone in [14, 15], where the entanglement entropy of some\nconfining large Nc gauge theories was studied basing on\nthe conjecture of [12, 13]. These theories are dual to\nsupergravity on certain SUSY-breaking five-dimensional\ngeometries [18, 19]. One of the most interesting results\n\nof [14, 15] is that if the entropic \"area law\" is assumed\nto hold also for such theories, their entanglement entropy\nshould be nonanalytic in l. This nonanalytic behavior is\na consequence of the existence of two distinct minimal\nhypersurfaces in five-dimensional bulk geometry, a connected one and a disconnected one [14, 15]. For small\nregions A the area of the connected hypersurface is less\nthan that of the disconnected one, and it is this area\nwhich determines the entanglement entropy, while for\nsufficiently large A the situation is reversed. At some\nlc the areas of these two hypersurfaces become equal,\nand as a result the derivative of the entanglement entropy over l and the entropic C-function are discontinuous at l = lc . For example, for gauge theories which are\ndual to D3 or D4 branes on a circle [15], C (l) is proportional to the step function: C (l) ∼ Nc2 θ (lc − l). This\nmeans that the effective number of degrees of freedom\nrapidly changes from being of order of Nc2 to Nc0 as the\nregion A in (1) becomes smaller (in the large Nc limit\nNc0 is just zero as compared with Nc2 ). It was conjectured in [15] that this nonanalytic behavior is similar to\nthe confinement-deconfinement phase transition at finite\ntemperatures. Namely, when the size of the region A\nis sufficiently small and the corresponding energy scale\nis sufficiently high, we are in the domain of asymptotic\nfreedom and the number of particles which contribute\nto the entropy (1) is proportional to Nc2 . As the region\nA becomes larger and the infrared effects become strong,\ncoloured states are confined and we are left with a theory\nof colourless glueballs and hadrons, for which the number\nof states and the entropy are much smaller. It was argued\nin [15] that such behavior of the entanglement entropy is\ngeneric for confining large-Nc gauge theories because of\nthe Hagedorn-like structure of their spectrum.\nThus the behavior of entanglement entropy of confining gauge theories can be an interesting new test of\nMaldacena duality between string theories on (D + 1)dimensional curved spaces and D-dimensional gauge theories which live on their boundary. It can be also used as\nan alternative probe which indicates the emergence of the\ncolourless degrees of freedom in the low-energy limit of\ngauge theories. The results of [14, 15] imply that colourless degrees of freedom always emerge instantly, so that in\nsome sense gluons and glueballs cannot coexist at one energy scale. For finite Nc the arguments of [14, 15] remain\nvalid at the qualitative level, however, it is not clear how\nthe nonanalytic behavior may be modified in this case,\nand different phenomenological descriptions of confining\ngauge theories give different predictions. For instance, in\nthe AdS space with hard wall [20], which is one of the\nmost popular phenomenological stringy models of confinement, there is only one minimal hypersurface for all\nl [15], and according to the conjecture of [12, 13, 14, 15]\nthe entanglement entropy should be analytic in l. On\nthe other hand, if the entanglement entropy is calculated\nusing the approximate Migdal-Kadanoff decimations in\nlattice gauge theory, it appears to be non-analytic [21].\nUnfortunately, up to now the infrared dynamics of con-\n\n\f3\nfining gauge theories is not understood from the first\nprinciples, and no method is known which can be used\nto calculate explicitly the entanglement entropy of confining gauge theories for sufficiently large regions A. The\naim of the present work is to investigate the entanglement entropy (1) in pure SU (2) gauge theory numerically, using lattice Monte-Carlo simulations. The same\ngeometry of A as in [12, 13, 14, 15, 21] is used, namely,\nA is a slab of three-dimensional space which has thickness l in one direction and which extends maximally in\nall other directions, and the entropy is normalized per\nunit area of the boundary of A. Simulation results suggest that the derivative of the entanglement entropy over\nl is indeed discontinuous at some l = lc . In addition, we\npresent some indications that this nonanalytic behavior\nmay persist even at finite temperatures above Tc , probably turning into a crossover line in the l − T plane.\nWe also confirm that the entanglement entropy diverges\nquadratically and that at small distances Sf (l) indeed\nbehaves as Sf (l) ∼ − l−2 .\nThe structure of the paper is the following. In Section II we discuss the path-integral representation of\nthe entanglement entropy, which is suitable for MonteCarlo lattice simulations, and introduce the spaces of\nspecial topology on which these simulations should be\nperformed. In Section III we present the results of our\nmeasurements of the action density distributions on lattices with such special topology and confirm that the divergent term in the entanglement entropy scales as Λ2UV\nand does not depend on l. In Section IV the dependence\nof the nondivergent part of the entanglement entropy on\nl is investigated and the discontinuity of the derivative\n∂\n∂l Sf (l) is detected. Nonanalytic behavior of the entanglement entropy with respect to l at T > Tc is discussed\nand studied numerically in Section V. Finally, Section\nVI contains some concluding remarks and the discussion\nof the obtained results. Some technical details of our\ncalculations are relegated to the Appendices.\n\nII.\n\nof cuts. In two dimensions such spaces can be implemented as multi-sheeted Riemann surfaces, which allows\none to find explicitly the entanglement entropy in conformal field theories [2, 4].\nFor higher-dimensional spaces, it is also relatively easy\nto implement the spaces of required topology, at least on\nthe lattice. For the purposes of lattice simulations it is\nconvenient to represent the result of [4] in the following\nform:\n\u0012\n\u0013\n∂\nS [A] = lim lim\nF [A, s, T ] − F (T )\n(5)\nT →0 s→1 ∂s\nwhere F (T ) = − ln Z (T ) is the free energy of the theory at the temperature T . Z [A, s, T ] and F [A, s, T ] =\n− ln Z [A, s, T ] are the partition function and the free energy obtained by integrating over all fields with the following boundary conditions [2, 4]: the fields are periodic\nin time with the period sT −1 if the spatial coordinates lie\nwithin A, otherwise (i.e. for spatial coordinates within\nB) the period is T −1 . Such topology of space is schematically shown on Fig. 1 for s = 2. Thus F [A, s, T ] is the\nfree energy of the theory on the space with s cuts [2, 4].\nIn four-dimensional space-time these cuts are the threevolumes B at the time slices t = kT , k = 0, 1, . . . , s,\nwhich have a common boundary ∂A = ∂B. At this\nboundary the branching points of the cuts are situated.\nThe expression (5) is derived in Appendix A, where the\noriginal derivation of [4] is briefly revised.\n\nMEASUREMENT PROCEDURE\n\nIn this Section we present some important details of\nthe numerical procedures which we have used to measure\nthe entanglement entropy. Highly technical details are\nrelegated to Appendices A and B.\nEntanglement entropy can not be expressed as an expectation value of some field operator, thus theoretical\nand especially numerical calculations of such entropy in\nfield theories are far from being straightforward. For example, most investigations of quantum entanglement of\nthe ground states of lattice spin systems were carried out\nusing rather special transfer-matrix methods, which are\napplicable only to some particular models [1]. In [4] a\npath-integral representation of the entanglement entropy\nwas derived, which relates the entanglement entropy to\nthe set of partition functions on the spaces of some special topology, namely, the spaces with an integer number\n\nFIG. 1: The topology of space on which the free energy\nF [A, s, T ] in (5) is calculated, an example for s = 2. Dashed\nlines with arrows denote identification of cut sides, i.e. periodic boundary conditions in time direction.\n\nSince free energies can not be directly measured in lattice simulations, one usually looks at the average plaquette action, which is related to the derivative of the\nfree energy over the coupling constant β = 4g12 of SU (2)\ns\nlattice gauge theory:\n\u0013\n\u0012\nX\n∂\n1\nF (β)\n(6)\nh β 1 − Tr gp i =\n2\n∂ ln β\np\nwhere summation goes over all lattice plaquettes. The\naverage plaquette action and the free energy have the\n\n\f4\nsame power-like ultraviolet divergences, which follows\nfrom the fact that the lattice spacing a (β) = Λ−1\nUV depends on β as a (β) ∼ β α exp (−γβ), where the coefficients α and γ can be obtained from the Gellman-Low\nβ-function. Thus the derivative in (6) can only change\nlogarithmic dependence on the UV cutoff scale, which is\nusually too weak to be observed in lattice simulations.\nIn Section III we use the expression (6) to find the UV\ndivergent part of the entanglement entropy (3).\nIn practice it turns out that the equation (6) can only\nbe reliably used to find the divergent part of the entanglement entropy, while extremely precise measurements\nare required to study the behavior of the nondivergent\npart. For this reason it is more convenient to measure\nthe derivative of the entanglement entropy (5) over l,\nwhich is related to the free energy as:\n∂\n∂ ∂\n∂\nS [A] =\nSf (l) = lim lim\nF [A, s, T ]\nT →0 s→1 ∂s ∂l\n∂l\n∂l\n\n(7)\n\n∂\nF [A, s, T ] can be estimated from finite\nThe derivative ∂l\ndifferences of free energies for close values of l. Such differences can be directly measured in lattice simulations\nusing the method proposed recently in [22, 23]. The results of these measurements are presented in Section IV,\nand the method itself is described in Appendix B.\nThus the expressions (5), (6) and (7) allow one to\ncalculate the entanglement entropy by performing lattice simulations on lattices with integer number of cuts.\nIn practice such simulations can be done only for several smallest s, after which some numerical interpolation\nmethod should be used to find the derivative over s. In\nthis work we use the simplest possible way to estimate\nthis derivative. Namely, from lattice simulations on lattices with two cuts we obtain the values of lim F [A, 2, T ]\nT →0\n\n∂\nT →0 ∂l\n∂\nF\ntion ∂l\n\nor lim\n\nF [A, 2, T ]. Taking into account that by defini-\n\n[A, 1, T ] = 0 and F [A, 1, T ] = F (T ), we estimate the derivative over s at s = 1 in (5) as the following\nfinite difference:\n\u0012\n\u0013\n∂\nlim lim\nF [A, s, T ] − F (T ) ≈\nT →0 s→1 ∂s\n≈ lim (F [A, 2, T ] − 2F (T ))\n(8)\nT →0\n\nThe results that we obtain using such an estimation are\nin a rather good agreement with theoretical expectations [12, 13, 14, 15], which gives us a hope that the\napproximation (8) is not unreasonable. It should be\nalso noted that in fact any of the quantities PA (s) =\nexp (−F [A, s, T ] + sF (T )) = Tr ρ̂sA (see Appendix A for\na proof of this equality) for s > 1 can be used as a measure of quantum entanglement. In particular, the quantity P = exp (−F [A, 2, T ] + 2F (T )) = Tr ρ̂2A , although\nit does not have such a straightforward physical interpretation as the entanglement entropy, is also widely used\nin quantum information theory and has a special name\nof the purity of quantum states. For pure states the purity is equal to 1, for impure states it is less than 1, and\n\nthe smaller it is, the more impure is the quantum state\ndescribed by ρ̂A .\n\nIII.\n\nAVERAGE ACTION DENSITY ON\nLATTICES WITH CUTS\n\nIn this Section we present the results of our measurements of the average action density on lattices with cuts,\nand demonstrate that the entanglement entropy contains\nquadratically divergent l-independent term.\nLattices with s cuts are obtained from s Nt × NL3 lattices with periodic boundary conditions in all space-like\ndirections by identifying lattice sites with periods Nt and\nsNt in time for spatial coordinates within A and B, respectively. These sites are then linked taking into account\nthis periodical identification, and lattice gauge theory is\ndefined on the obtained links. It turns out that lattices\nwith such topology can be entirely mapped on sNt × NL3\nhypercubic lattices so that all s D Nt × NL3 links and\ns D(D−1)\nNt × NL3 lattice plaquettes are used. To reduce\n2\nthe anisotropy due to the cuts, in our simulations at each\nMonte-Carlo iteration the heatbath and the overrelaxation procedures are applied to 2 s D Nt × NL3 randomly\nchosen links.\nTo check the physical scaling of the first, UV divergent term in (3), we have performed lattice Monte-Carlo\nsimulations on lattices with cuts at different values of l\nand various lattice spacings, lattice sizes and numbers\nof cuts. We have used from 30 to 50 lattice configurations obtained on lattices with sizes from 28 × 243 to\n18 × 123 and with lattice spacings from a = 0.06 f m to\na = 0.17 f m. The number of cuts was equal to 2 for all\nlattices except for the 18 × 123 lattice, which had three\ncuts. The action density for a given lattice site was obtained by averaging the action of all plaquettes to which\nthis site belongs. The distributions\nof the average ac\u0001\ntion density in the x0 , x1 plane of the sNt × NL3 toric\nlattices which cover the original lattices with cuts are\nplotted on Fig. 2 for different lattice parameters. The\ncuts are shown as thick solid lines. Numerically the average plaquette action appears to be much higher in the\nimmediate vicinity of the branching points, namely, for\nthe lattice plaquettes which are closest to them. Since\nin four dimensions the branching points are situated on\nthe two-dimensional boundary of A, one can expect that\nthis excess of action near the branching points is related\nto the first, quadratically divergent term in the entanglement entropy (3). In order to check this, the average action density was measured for those sites on the\nsNt × NL3 toric covering lattice which are closest to each\nbranching point (see Fig. 2, where the action density is\nmaximal in these points) for different lattices with two\nand three cuts. According to (5), (6) and (8), the average\naction density for lattices without cuts was subtracted.\nThe results of these measurements are plotted on Fig. 3\nas the function of lattice spacing a. One can see that the\naverage action excess practically does not depend on the\n\n\f5\n\n20\n\n20\n\n15\n\n15\n\n10\n\n10\n\n5\n\n5\n\n0\n\n0\n5\n\n0\n\n15\n\n10\n\n20\n\n5\n\n0\n\n15\n\n10\n\n20\n\n18\n25\n\n16\n14\n\n20\n12\n10\n\n15\n\n8\n10\n\n6\n4\n\n5\n2\n0\n\n0\n0\n\n5\n\n10\n\n15\n\n20\n\n0\n\n2\n\n4\n\n6\n\n8\n\n10\n\n12\n\n`\n ́\nFIG. 2: The distributions of average action density in the x0 , x1 plane for different lattices and cut sizes: at the upper left:\n24 × 203 lattice with two cuts, a−1 l = 8, a = 0.12 f m, at the upper right: 24 × 203 lattice with two cuts, a−1 l = 6, a = 0.12 f m,\nat the lower left: 28 × 243 lattice with two cuts, a−1 l = 6, a = 0.10 f m, at the lower right: 18 × 123 lattice with three cuts,\na−1 l = 6, a = 0.17 f m. The cuts are shown as thick solid lines. The topology of lattices with two cuts is illustrated on Fig. 1.\n\nlattice spacing, and that for two and three cuts the results\nare the same within the range of statistical errors. Since\nat fixed lattice size the branching points cover the surface\nwith total area sNL2 a2 on the covering sNt × NL3 lattice,\nthe total action excess associated with the boundary of\nA includes the quadratically divergent term ∼ sa−2 |∂A|.\nAccording to (6), the same is true for F [A, s, T ]. Differentiating over s, we thus recover the first, quadratically\ndivergent term in (3). Since the divergence in the total\naverage action comes from the vicinities of the branching points, it is clear that the divergent term in the free\nenergy (6) and the entanglement entropy (5) does not\ndepend on l.\nIV. UV FINITE PART OF THE\nENTANGLEMENT ENTROPY\n\nIn this Section we present the results of our measurements of the derivative of the UV finite part of the entanglement entropy and point out a signature of its discontinuity.\n\nAs discussed in Section I, only the nondivergent part\nSf (l) of the entanglement entropy depends on l. In\nour simulations we have found that it is very difficult\nto extract Sf (l) from the measurements of the average action excess using (6) and integrating the average\naction over β (see Section II). To overcome this difficulty, we implement the method proposed in [22, 23]\nand directly measure the differences of the free energies\nF (l + a, 2, T ) − F (l, 2, T ) in (8) at different l. Another\nadvantage of this method is that all ultraviolet divergences are automatically canceled because the UV divergent part of the entanglement entropy does not depend\non l, and no subtractions of F (T ) should be made in\n(8). The method itself is briefly described in Appendix B.\nAll measurements were performed on the 24×123 lattice,\nand the distance l was varied both by changing the lattice\nspacing a at fixed l/a and by changing l/a at fixed a. Lattice spacings and the lengths l used in our simulations are\nlisted in Table I, together with the number of lattice configurations used to obtain each data point. The method\nof [22, 23] involves integration of the outcome of MonteCarlo simulations over a certain parameter α ∈ [0, 1] (see\n\n\f6\n\n<β (1 - 1/2 tr gp)>\n\n0.065\n0.06\n0.055\n0.05\n0.045\n0.04\n0.035\n0.03\n0.06 0.08\n\n0.1\n\n0.12 0.14 0.16 0.18\n\n0.2\n\na, fm\n\nFIG. 3: Average excess of action on the lattice plaquettes\nwhich are closest to the branching points on different lattices\nwith two and three cuts.\nβ\n2.35\n2.35\n2.35\n2.40\n2.40\n2.40\n\na, f m a−1 l # conf.\n0.1394 2\n38\n0.1394 4\n19\n0.1394 5\n97\n0.1193 3\n98\n0.1193 4\n98\n0.1193 5\n98\n\nβ\n2.425\n2.45\n2.45\n2.45\n2.50\n\na, f m a−1 l # conf.\n0.1113 5\n98\n0.0996 2\n49\n0.0996 4\n97\n0.0996 5\n141\n0.0854 2\n18\n\nTABLE I: The data points which were used to estimate the\n∂\nSf (l).\nderivative ∂l\n\nAppendix B). To perform this integration we have calculated the integrand at α = 0, 0.2, 0.4, 0.6, 0.8, 1.0,\nand the numbers of lattice configurations in Table I are\nthe numbers of configurations for each of these values of\nα.\nFinite differences F (l + a, 2, T ) − F (l, 2, T ) were then\n1\n∂\nused to estimate the derivative |∂A|\n∂l Sf (l) in (7):\n1 ∂\nF (l + a, 2, T ) − F (l, 2, T )\nSf (l + a/2) ≈\n(9)\n|∂A| ∂l\na |∂A|\n∂\n1\nThe derivative |∂A|\n∂l Sf (l) estimated from these measurements is plotted on Fig. 4. It can be seen that\nthis derivative grows rapidly at small distances. For\ncomparison with the asymptotic behavior Sf (l) ∼ −l−2\nat l → 0, we have fitted these results by the function\nCl−3 (solid line on Fig. 4). For the data points with\nthe smallest l the finite differences (9) were found at\nfixed l/a at different a, so that the finite differences\n−2\n−2\n(l + a/2) − (l − a/2) still behave as l−3 ∼ a−3 . The\n∂\n∂\nSf (2a2 ) / ∂l\nSf (2a1 ) =\nestimated ratio of derivatives ∂l\n(2.0 ± 0.4) at a1 = 0.0996 f m and a2 = 0.0854 f m is\n3\nindeed close to the ratio (a1 /a2 ) = 1.586, which is an\n∂\nSf (l) indeed\nindication that at small l the derivative ∂l\nscales in physical units of length.\n∂\nAt larger l ∂l\nSf (l) goes to zero faster than l−3 , and\n\nseem to approach a kind of plateau for the values of l be∂\ntween 0.3 f m and 0.5 f m. Here the values of ∂l\nSf (l) obtained for different values of lattice spacing differ rather\nsignificantly, which indicates that for our lattice parameters finite-volume and finite-spacing effects may still be\nrather strong. Nevertheless, at least qualitatively all data\npoints for different values of a display the same behavior. We have also tried to plot the entropic C-function\nas the function of l (see Fig. 6). It also has a distinct\ndiscontinuity, however, it grows slowly for intermediate\nvalues of l and thus its behavior seems to disagree with\ngeneral theoretical expectations (see Section I). In our\nopinion this growth is simply the artefact of the finite\ndifferences that we have used to estimate the derivative\nof the entanglement entropy over l. For example, if the\n∆ −2\nfinite difference ∆x\nx\nwith ∆x = 1 is used to estid\nmate the function −x3 dx\nx−2 , we obtain the function\n3\nx\n∆ −2\nx = x − (x+1)\nx3 ∆x\n2 , which indeed grows slowly.\nWhat is most interesting, however, is that at lc ≈\n∂\n0.5 f m the estimated derivative ∂l\nSf (l) and the entropic\nC-function rapidly go to zero, and remain equal to zero\nwithin error range for larger values of l. Data points near\nthis lc are plotted with larger scale on Fig. 5. This is a\nclear signature of the discontinuity of the derivative of\nthe entanglement entropy over l, thus the entanglement\nentropy indeed seems to be nonanalytic in l even at finite\nnumber of colours. Of course, it should be remembered\nthat these results were obtained under some simplifying assumptions, in particular, the contributions of the\nfree energies F [A, s, T ] with s > 2 to the entanglement\nentropy (5) were neglected. One can not completely exclude the possibility that once higher s are included in\nthe analysis, the dependence of the entanglement entropy\non l may be changed. It could be therefore interesting\nto perform similar measurements on larger lattices with\nlarger number of cuts.\n40\n\na = 0.085 fm\na = 0.10 fm\na = 0.11 fm\na = 0.12 fm\na = 0.14 fm\n-3\nC l fit\n\n35\n-3\n\ns=2\ns=3\n\n1/|dA| dSf(l)/dl, fm\n\n0.07\n\n30\n25\n20\n15\n10\n5\n0\n0.2\n\n0.3\n\n0.4\n\n0.5\n\n0.6\n\nl, fm\n\nFIG. 4: The dependence of the derivative of the entanglement\nSf (l)\n1\non l. Solid line is the fit of the data by the\nentropy |∂A|\n∂l\n−3\nfunction C l .\n\n\f7\n5\n\na = 0.10 fm\na = 0.11 fm\na = 0.12 fm\na = 0.14 fm\n\n1/|dA| dSf(l)/dl, fm\n\n-3\n\n4\n3\n2\n1\n0\n-1\n0.3\n\n0.35\n\n0.4\n\n0.45\n\n0.5\n\n0.55\n\n0.6\n\n0.65\n\nl, fm\n\nFIG. 5: The discontinuity of the derivative of the entanglement entropy over l near lc ≈ 0.5 f m.\n\njust the free energy of s copies of the gauge fields at the\ntemperature T , each of which is in the deconfinement\nphase. Since for the confinement-deconfinement phase\ntransition in pure SU (2) lattice gauge theory there is\nan exact order parameter associated with Z2 center symmetry, namely, the Polyakov loop, one can expect that\nthe transition between confinement and deconfinement\nphases should be associated with some discontinuity in l,\nso that the center symmetry is broken spontaneously for\nl < lc . If this is true, at this transition the free energy\nF [A, s, T ] should change as at the deconfinement phase\ntransition at T = Tc , which is of the second order for\npure SU (2) Yang-Mills theory. Thus the second derivative of F [A, s, T ] over l should change stepwise at some\nl = lc (s), and for the values of l close to lc we can write\n2\nF (A, s, T ) ∼ (lc (s) − l) θ (lc (s) − l) + ( . . . ), where\n(. . .) denotes the analytic part of F (A, s, T ). Differenti(0)\nating over s and l, we find that if the limit lc = lim lc (s)\ns→1\n\n0.5\n\na = 0.085 fm\na = 0.10 fm\na = 0.11 fm\na = 0.12 fm\na = 0.14 fm\n\n0.4\n0.3\nC(l)\n\nis different from zero, the derivative of the entanglement entropy over\u0010l should\n\u0011 have a discontinuity of the\n(0)\n∂\n∂\nform ∂l Sf [A] ∼ θ lc − l lim ∂s\nlc (s). However, even\ns→1\n\nif lim lc (s) = 0 and the entanglement entropy is anas→1\n\n0.2\n0.1\n0\n-0.1\n0.2\n\n0.3\n\n0.4\n\n0.5\n\n0.6\n\nl, fm\n\nFIG. 6: Entropic C-function C (l) =\n\nV.\n\nl3\n∂\n|∂A| ∂l\n\nlytic in l, one can still discuss the non-analytic behavior of the purity P = Tr ρ̂2A and its generalizations like\nPA (s) = Tr A ρ̂sA , which also indicates that near lc (s)\nquantum entanglement between the regions A and B is\nquickly destroyed. In general all the quantities PA (s) are\nnonanalytic in l at different lc (s), which is a typical situation when a phase transition turns into a crossover and\ndifferent order parameters undergo transitions at different temperatures. It is also interesting to note that such\ntransitions with respect to the size of A can occur in any\ntheories with phase transitions at finite temperatures.\n\nS (l).\n\nCONFINEMENT-DECONFINEMENT PHASE\nTRANSITION W.R.T. THE SIZE OF A AT\nFINITE TEMPERATURES\n\nIf the expression (5) is applied to theories at finite\ntemperatures, very straightforward arguments suggest\nthat the nonanalytic behavior of the entanglement entropy with respect to the size of A may persist even at\ntemperatures above the temperature of the confinementdeconfinement phase transition. In this case it is also\nvery simple to demonstrate the relation between the deconfinement phase transition at T = Tc and the discontinuity of the derivative of the entanglement entropy over\nl. Indeed, consider gauge theory at some temperature\nT > Tc . It is clear that when A becomes very large and\nextends through the whole physical space, the free energy\nF [A, s, T ] is equal to the free energy of the theory at the\ntemperature T /s, and one can always find such s that\nT /s < Tc and the theory is in the confinement phase. On\nthe other hand, if the size of A tends to zero, F [A, s, T ] is\n\nTo study this transition from deconfinement to confinement, we have measured the expectation value of the\nPolyakov line which winds around the cycle of length\n(aT )−1 = 4 on the 8×203 lattice with two cuts of variable\nlength (see Fig. 1) at β = 2.40. If the cut goes through\nthe whole lattice, we have two lattices with Nt = 4, for\nwhich the confinement-deconfinement transition occurs\nnear β = 2.29 [24], therefore at β = 2.40 we are indeed\nin the deconfinement phase. On the other hand, with\nno cuts the time extent of the lattice is Nt = 8 and the\ndeconfinement transition occurs at β = 2.51 [24], thus\nwe are in the confinement phase. Expectation value of\nthe Polyakov loop as the function of l is plotted on Fig.\n7. We see that at l approximately equal to 1.5 f m, the\nexpectation value of the Polyakov loop has a sharp bend,\nafter which it is equal to zero within error range. Thus\ncenter symmetry is restored and we are indeed in the confinement phase. Such dependence of the Polyakov loop\non l is qualitatively the same as its dependence on temperature at the usual confinement-deconfinement phase\ntransition in pure SU (2) Yang-Mills theory, in agreement\nwith the predictions of [12, 13, 14, 15].\n\n\f8\nTr ρ̂2A of the reduced density matrix ρ̂A . More generally,\nfor lattices with s cuts at T > Tc the deconfinement\nphase transition w.r.t. l at some lc (s) results in a nonanalytic behavior of the quantity PA (s) = Tr ρ̂sA . Since\nin general all lc (s) are different, different measures of\nentanglement yield different transition points, which is\na typical behavior for crossover. Thus it reasonable to\nconjecture that the line of phase transitions w.r.t. l in\nthe l − T plane can be continued above Tc as a sort of\ncrossover line (see Fig. 8), which is associated with rapid\nbut continuous destruction of quantum entanglement.\n\n0.3\n0.25\n\n<P>\n\n0.2\n0.15\n0.1\n0.05\n0\n-0.05\n0.5\n\n1\n\n1.5\n\n2\n\nl, fm\n\nFIG. 7: The expectation value of the Polyakov loop which\nwinds around the \"short\" cycles of the lattice as the function\nof l for 8×203 lattice with two cuts, a = 0.12f m, T /Tc = 1.43.\n\nVI.\n\nCONCLUSIONS\n\nIn this work we have studied numerically the behavior of the entropy of entanglement between a threedimensional slab A of thickness l and its complement for\nSU (2) lattice gauge theory. This entropy is found to be\na sum of the quadratically divergent and the UV finite\nterms SUV and Sf (l), both of which are proportional to\nthe area of the boundary of A. The behavior of the nondivergent term was compared with the results of recent\ntheoretical works [14, 15, 21], where a discontinuity of\nthe derivative of the entanglement entropy at some critical value l = lc was predicted. We have indeed found a\nsignature of such discontinuity at lc ≈ 0.5 f m, where the\nentanglement entropy extracted from finite differences\n(9) and (8) rapidly goes to zero. Thus the predictions\nof [14, 15] are confirmed for finite Nc , at least qualitatively. It seems that such behavior of entanglement entropy is a common feature of all confining gauge theories,\nsimilarly to the confinement-deconfinement phase transition at high temperatures. Since the entropic C-function\nC (l) measures the number of effective degrees of freedom at the energy scale E ∼ l−1 , the results presented\nin [14, 15] and in this paper imply that the transition\nfrom asymptotic freedom to confinement is always rapid,\neither when the temperature or simply the energy scale\nare varied. In other words, gluons and glueballs can not\ncoexist at one energy scale, and the properties of gauge\ntheories should be described either in terms of coloured\nor colourless particles, but never in terms of both.\nAt finite temperatures above Tc we have found that\nfor lattices with cuts there is a real phase transition from\ndeconfinement at small l to confinement at large l. This\ntransition is associated with spontaneous breaking of the\nZ2 symmetry of the Polyakov loop, just as in the case\nof the usual confinement-deconfinement phase transition.\nAs is argued in Section V, such transition should also be\nassociated with a non-analytic behavior of the purity P =\n\nFIG. 8: A conjectured line of phase transitions in the l − T\nplane.\n\nIt can be interesting to investigate how such finitetemperature phase transition for the entanglement entropy can be described in the framework of AdS/CFT\ncorrespondence, and how the geometry of the minimal\nhypersurface in the bulk which spans on the boundary of\nA changes at this transition. On the other hand, a more\ndetailed study of the line of confinement-deconfinement\nphase transitions in the l − T plane in lattice or continuum gauge theories can also provide some information\non higher-dimensional geometries which are dual to confining gauge theories. Finally, we would like to explain\nwhy, in our opinion, the confirmation of the predictions\nof [12, 13, 14, 15] is important methodologically. Until\nrecently the development of the AdS/QCD phenomenology was based on the attempts to fit some known data\nwith the results of calculations of some geometric quantities in the dual higher-dimensional geometries. In contrast, the nonanalytic behavior of the entanglement entropy was not previously known for confining gauge theories and was originally found in [14] using the dual description, which demonstrates the predictive power of the\nAdS/QCD approach.\n\nAcknowledgments\n\nThe authors\nTakayanagi for\nthe papers [15]\nAkhmedov and\n\nare grateful to V. I. Zakharov and T.\ninteresting discussions and for bringing\nand [14] to our attention, and to E. T.\nF. V. Gubarev for useful remarks. This\n\n\f9\nwork was partly supported by grants RFBR 06-02-04010NNIO-a, RFBR 08-02-00661-a, DFG-RFBR 436 RUS,\ngrant for scientific schools NSh-679.2008.2 and by Federal Program of the Russian Ministry of Industry, Science and Technology No 40.052.1.1.1112 and by Russian\nFederal Agency for Nuclear Power.\nAPPENDIX A: PATH INTEGRAL\nREPRESENTATION OF THE ENTANGLEMENT\nENTROPY\n\nThis Appendix revises the derivation of the pathintegral representation for the entanglement entropy,\nwhich was originally obtained in [4]. We first represent\nthe entanglement entropy in the following form:\nSA = − lim\n\ns→1\n\n∂\nln Tr A ρ̂sA\n∂s\n\n(A1)\n\nTo obtain the reduced density matrix ρ̂A = Tr B ρ̂AB =\nTr B |0ih0| of the ground state of the theory, it is conve-\n\nnient to consider the theory at some finite\ntemperature\n\u0001\nT , so that ρ̂AB = Z −1 (T ) exp −T −1 H , where H is the\u0001\nHamiltonian of the theory and Z (T ) = Tr exp −T −1 H\nis the partition function. At the end of the calculation\none can take the limit T → 0.\n\nWe denote the set of all fields in the theory as φ (~x),\nwhere ~x denotes spatial coordinates, omitting all indices\nfor the sake of brevity. For gauge theories one should also\ninclude into φ the appropriate ghost sector. According to\nthe Feynman-Kac\npath\u0011 integral formula [25], matrix ele\u0010\n\nments of exp −T −1 Ĥ between the eigenstates |φ′ (~x)i,\n|φ′′ (~x)i of the field operators are given by the path integral over all fields on a section of four-dimensional\nEuclidean space of time extent T −1 , with corresponding eigenvalues set as boundary conditions at t = 0 and\nt = T −1 [25]:\n\nρAB [φ′ (~x) , φ′′ (~x)] = hφ′ (~x) | ρ̂AB |φ′′ (~x)i =\n\n\n−1\nx)\nφ(~\nx,T −1 )=φ′′ (~\nT\nZ\nZ\nZ\n\n\ndt d3 ~xL [φ (~x, t)]\nDφ (~x, t) exp −\n= Z −1 (T )\n\n(A2)\n\n0\n\nφ(~\nx,0)=φ′ (~\nx)\n\nwhere L [φ (~x, t)] is the Lagrangian of the theory.\nIn order to find the reduced density matrix for the region A, we should somehow trace over all degrees of freedom in\nthe complement B to the region A. Assume that the theory is regularized by discretizing\nthe spatial coordinates ~x. In\nQ\nthis case it is always possible to rewrite the states |φ (~x)i as a direct product\n|φ~x i, where |φ~x i are the eigenstates\n~\nx\n\nof the field operator in the point ~x. It is then natural to define the trace over all degrees of freedom in B as as a sum\nover all products of basis states |φ~x i with ~x ∈ B, so that the reduced density matrix ρ̂A reads:\nZ\nρA [φ′ (~x) , φ′′ (~x)] =\nDφ (~x) hφ (~x) | hφ′ (~x) | ρ̂AB |φ′′ (~x)i |φ (~x)i =\n~\nx∈B\n\n= Z −1 (T )\n\nZ\n\n\n\n\nDφ (~x, t) exp −\n\nT\nZ−1\n\ndt\n\n0\n\nZ\n\n\n\n\nd3 ~xL [φ (~x, t)]\n\n(A3)\n\n\u0001\nwhere in the last path integral the\u0001following boundary conditions are imposed: φ (~x, 0) = φ′ (~x), φ ~x, T −1 = φ′′ (~x)\nfor x ∈ A, and φ (~x, 0) = φ ~x, T −1 , if x ∈ B. Matrix multiplication can also be defined in terms of the path integral\nover φ (~x):\nZ\nρ2A [φ′ (~x) , φ′′ (~x)] =\nDφ (~x) ρA [φ′ (~x) , φ (~x)] ρA [φ (~x) , φ′′ (~x)]\n(A4)\n~\nx∈A\n\nIt is now straightforward to calculate the trace and the matrix contractions in the definition of the function PA (s) =\nTr ρ̂sA :\nZ\ns\nTr ρ̂A =\nDφ1 (~x) . . . Dφs (~x)\n~\nx∈A\n\nρA [φ1 (~x) , φ2 (~x)] ρA [φ2 (~x) , φ3 (~x)] . . . ρA [φs (~x) , φ1 (~x)]\n\n(A5)\n\n\f10\n\nTr ρ̂sA =\n\nZ [A, s, T ]\nZ s (T )\n\n(A6)\n\nwhere Z [A, s, T ] is the partition function obtained by\nintegrating over all fields which satisfy the ~x-dependent\nperiodic boundary conditions, as discussed above. The\ntopology of space on which the fields which enter the path\nintegral for Z [A, s, T ] live is schematically shown on Fig.\n1 for s = 2.\nInserting the expression (A6) into (A1) and taking the\nlimit T → 0, we arrive at the following representation of\nthe entanglement entropy:\n\u0012\n\u0013\n∂\nS [A] = lim lim\nF [A, s, T ] − F (T )\n(A7)\nT →0 s→1 ∂s\nwhere F (T ) = − ln Z (T ) and F [A, s, T ] =\n− ln Z [A, s, T ] are the free energies which correspond to\nthe partition functions Z (T ) and Z [A, s, T ].\nAPPENDIX B: DIRECT MONTE-CARLO\nMEASUREMENTS OF THE DIFFERENCES OF\nFREE ENERGIES\n\nIn this Appendix we briefly review the method proposed in [22, 23] for direct measurements of the differences of free energies in lattice Monte-Carlo simulations.\nThe works [22, 23] deal mainly with the case of finitetemperature lattice gauge theories, so it may be useful\nto repeat their arguments in a somewhat more general\ncontext.\nAssume that we have two different actions S1 [φ] and\nS2 [φ] for some set of fields φ defined on the lattice of\nsome fixed size. Again, here φ denotes any lattice fields,\nwhich can live on lattice sites, links, cubes, etc., as long\nas the number of these lattice simplices which enter both\nactions remains the same. For instance, this is true for\ngauge fields on the lattices of special topology, which are\ndescribed in Section III.\nWe would like to calculate the difference F2 − F1 of\nthe free energies F1 = − ln Z1 and F2 = − ln Z2 , where\nZ1 and Z2 are the partition functions calculated by integrating over all fields φ with the weights exp (−S1 [φ])\nand exp (−S2 [φ]), respectively. To this end, define the\ninterpolating partition function Z (α), so that Z (0) = Z1\nand Z (1) = Z2 :\nZ\nZ (α) = Dφ exp (− (1 − α) S1 [φ] − α S2 [φ]) (B1)\n\nNow the difference F2 − F1 = ln Z1 − ln Z2 can be represented in the following form:\n\nF2 − F1 = −\n\nZ1\n\ndα\n\n∂\nln Z (α)\n∂α\n\n(B2)\n\n0\n\nCalculating the derivative over α from (B1), we arrive at\nthe following result:\n\nF2 − F1 =\n\nZ1\n\ndα h S2 [φ] − S1 [φ] iα\n\n(B3)\n\n0\n\nwhere the average h . . . iα is defined by integrating\nover\nall\nfields\nwith\nthe\nweight\nZ −1 (α) exp (− (1 − α) S1 [φ] − α S2 [φ]).\nFor any\nα ∈ [0, 1], the average h S2 [φ] − S1 [φ] iα can be calculated with arbitrary precision by increasing the number\nof Monte-Carlo iterations. After that some numerical\nintegration method should be used to find the integral\nin (B3). In practice it turns out that although for each\nα the expectation value h S2 [φ] − S1 [φ] iα is numerically\nrather large, the contributions from α < 1/2 and α > 1/2\ncancel almost exactly. For example, the dependence\nof the integrand in (B3) on α for the difference of free\nenergies on 24 × 123 lattices with two cuts with l = 2a\nand l = 1a is plotted on Fig. 9. Thus the expectation\nvalue h S2 [φ] − S1 [φ] iα should be found with a very good\nprecision, which typically requires rather large number\nof Monte-Carlo iterations. However, as discussed in the\nbody of the text, in our case the described method seems\nto be the best way to measure free energies.\n\n200\n150\n100\n<S2 - S1>α\n\nPutting together the expressions (A3) and (A5), one sees\nthat to calculate Tr ρ̂sA in (A5), one should impose periodic boundary conditions with period sT −1 in time if\n~x ∈ A and with period T −1 if ~x ∈ B, and find the partition function by integrating over all such fields. We thus\narrive at the following representation for Tr ρ̂sA :\n\n50\n0\n-50\n-100\n-150\n-200\n0\n\n0.2\n\n0.4\n\n0.6\n\n0.8\n\n1\n\nα\n\nFIG. 9: The dependence of the integrand in (B3) on α for the\ndifference of free energies on 24 × 123 lattices with two cuts\nof length 10a and 11a, lattice spacing a = 0.085 f m.\n\n\f11\n\n[1] G. Vidal, J. I. Latorre, E. Rico, and A. Kitaev,\nPhysical Review Letters 90, 227902 (2003), URL\nhttp://arxiv.org/abs/quant-ph/0211074.\n[2] P. Calabrese and J. Cardy, Int.J.Quant.Inf. 4, 429 (2006),\nURL http://arxiv.org/abs/quant-ph/0505193.\n[3] T.\nJ.\nOsborne\nand\nM.\nA.\nNielsen,\nQuant.Inf.Proc.\n1,\n45\n(2002),\nURL\nhttp://arxiv.org/abs/quant-ph/0109024.\n[4] P. Calabrese and J. Cardy, J. Stat. Mech. 0406, 002\n(2004), URL http://arxiv.org/abs/hep-th/0405152.\n[5] A.\nKitaev\nand\nJ.\nPreskill,\nPhysical\nReview\nLetters\n96,\n110404\n(2006),\nURL\nhttp://arXiv.org/abs/hep-th/0510092.\n[6] T. J. Osborne and M. A. Nielsen,\nPhysical\nReview\nA\n66,\n032110\n(2002),\nURL\nhttp://arxiv.org/abs/quant-ph/0202162.\n[7] C. H. Bennett, H. J. Bernstein, S. Popescu, and B. Schumacher, Physical Review A 53, 2046 (1996), URL\nhttp://link.aps.org/abstract/PRA/v53/p2046.\n[8] M. Srednicki, Physical Review Letters 71, 666 (1993),\nURL http://arxiv.org/abs/hep-th/9303048.\n[9] D. V. Fursaev, Physical Review D 73, 124025 (2006),\nURL http://arxiv.org/abs/hep-th/0602134.\n[10] S. W. Hawking, Comm. Math. Phys. 31, 161 (1973).\n[11] J.\nD.\nBekenstein,\nPhysical\nReview\nD\n12,\n3077\n(1975),\nURL\nhttp://prola.aps.org/abstract/PRD/v12/i10/p3077.\n[12] S. Ryu and T.\nTakayanagi,\nPhysical Review\nLetters\n96,\n181602\n(2006),\nURL\nhttp://arxiv.org/abs/hep-th/0603001.\n[13] S. Ryu and T. Takayanagi, JHEP 0608, 045 (2006), URL\n\nhttp://arxiv.org/abs/hep-th/0605073.\n[14] T. Nishioka and T. Takayanagi, JHEP 01, 090 (2007),\nURL http://arxiv.org/abs/hep-th/0611035.\n[15] I. R. Klebanov, D. Kutasov, and A. Murugan, Entanglement as a probe of confinement (2007), URL\nhttp://arxiv.org/abs/0709.2140.\n[16] J.\nM.\nMaldacena,\nInternational\nJournal\nof\nTheoretical\nPhysics 38,\n1113\n(1997),\nURL\nhttp://arxiv.org/abs/hep-th/9711200.\n[17] A. B. Zamolodchikov, JETP Letters 43, 730 (1986).\n[18] E. Witten, Adv. Theor. Math. Phys. 2, 253 (1998), URL\nhttp://arxiv.org/abs/hep-th/9803131.\n[19] I. R. Klebanov and M. J. Strassler, JHEP 0008, 052\n(2000), URL http://arxiv.org/abs/hep-th/0007191.\n[20] J.\nPolchinski\nand M.\nJ.\nStrassler,\nPhysical Review Letters 88, 031601 (2002), URL\nhttp://arxiv.org/abs/hep-th/0109174.\n[21] A. Velytsky, Entanglement entropy in d+1 SU(N) gauge\ntheory (2008), URL http://arxiv.org/abs/0801.4111.\n[22] Z. Fodor,\nPoS(LAT2007) 011 (2007),\nURL\nhttp://arxiv.org/abs/0711.0336.\n[23] G. Endrodi,\nZ. Fodor,\nS. D. Katz,\nand\nK. K. Szabo, PoS(LAT2007) 228 (2007), URL\nhttp://arxiv.org/abs/0710.4197.\n[24] J. Fingberg, U. Heller, and F. Karsch, Nuclear Physics B 392,\n493\n(1993),\nURL\nhttp://arxiv.org/abs/hep-lat/9208012.\n[25] J. Kapusta, Finite-temperature field theory (Cambridge\nUniversity Press, 1989).\n\n\f"}