{"id": "http://arxiv.org/abs/0807.4182v2", "guidislink": true, "updated": "2008-10-06T13:44:56Z", "updated_parsed": [2008, 10, 6, 13, 44, 56, 0, 280, 0], "published": "2008-07-25T20:24:08Z", "published_parsed": [2008, 7, 25, 20, 24, 8, 4, 207, 0], "title": "The Optical Gravitational Lensing Experiment. Triple-Mode and 1O/3O\n  Double-Mode Cepheids in the Large Magellanic Cloud", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0807.2008%2C0807.3849%2C0807.1030%2C0807.0821%2C0807.4430%2C0807.5058%2C0807.1886%2C0807.4179%2C0807.0745%2C0807.1246%2C0807.1189%2C0807.1016%2C0807.5033%2C0807.1029%2C0807.3736%2C0807.4113%2C0807.2828%2C0807.4930%2C0807.0166%2C0807.1657%2C0807.0935%2C0807.2533%2C0807.2527%2C0807.1848%2C0807.2349%2C0807.4778%2C0807.2433%2C0807.2979%2C0807.3976%2C0807.1795%2C0807.4285%2C0807.0636%2C0807.2624%2C0807.3191%2C0807.3754%2C0807.3816%2C0807.5085%2C0807.4322%2C0807.4188%2C0807.3470%2C0807.3775%2C0807.3385%2C0807.0871%2C0807.3776%2C0807.2678%2C0807.2269%2C0807.2745%2C0807.3237%2C0807.1781%2C0807.4106%2C0807.2339%2C0807.1664%2C0807.1332%2C0807.3407%2C0807.1324%2C0807.0859%2C0807.3846%2C0807.0937%2C0807.5030%2C0807.3946%2C0807.2012%2C0807.4317%2C0807.2122%2C0807.4182%2C0807.3680%2C0807.3577%2C0807.2044%2C0807.1921%2C0807.0939%2C0807.1056%2C0807.4744%2C0807.1458%2C0807.1079%2C0807.4193%2C0807.3774%2C0807.0969%2C0807.4385%2C0807.4481%2C0807.3457%2C0807.3275%2C0807.2356%2C0807.3444%2C0807.5100%2C0807.2607%2C0807.0248%2C0807.2073%2C0807.2744%2C0807.2403%2C0807.2945%2C0807.3425%2C0807.4422%2C0807.4256%2C0807.2055%2C0807.4743%2C0807.0025%2C0807.0660%2C0807.1945%2C0807.1692%2C0807.1502%2C0807.1319%2C0807.1286&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "The Optical Gravitational Lensing Experiment. Triple-Mode and 1O/3O\n  Double-Mode Cepheids in the Large Magellanic Cloud"}, "summary": "We report the discovery of three new triple-mode classical Cepheids in the\nLarge Magellanic Cloud, two of them with the fundamental, first overtone and\nsecond overtone excited, and one pulsating simultaneously in the first three\novertones. Thus, the number of triple-mode Cepheids in the LMC is increased to\nfive. We also present two objects belonging probably to a new type of\ndouble-mode Cepheids having the first and third overtones excited. We measure\nthe rates of period change in these stars and detect decrease of periods in two\nof them, what is in conflict with theoretical predictions.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0807.2008%2C0807.3849%2C0807.1030%2C0807.0821%2C0807.4430%2C0807.5058%2C0807.1886%2C0807.4179%2C0807.0745%2C0807.1246%2C0807.1189%2C0807.1016%2C0807.5033%2C0807.1029%2C0807.3736%2C0807.4113%2C0807.2828%2C0807.4930%2C0807.0166%2C0807.1657%2C0807.0935%2C0807.2533%2C0807.2527%2C0807.1848%2C0807.2349%2C0807.4778%2C0807.2433%2C0807.2979%2C0807.3976%2C0807.1795%2C0807.4285%2C0807.0636%2C0807.2624%2C0807.3191%2C0807.3754%2C0807.3816%2C0807.5085%2C0807.4322%2C0807.4188%2C0807.3470%2C0807.3775%2C0807.3385%2C0807.0871%2C0807.3776%2C0807.2678%2C0807.2269%2C0807.2745%2C0807.3237%2C0807.1781%2C0807.4106%2C0807.2339%2C0807.1664%2C0807.1332%2C0807.3407%2C0807.1324%2C0807.0859%2C0807.3846%2C0807.0937%2C0807.5030%2C0807.3946%2C0807.2012%2C0807.4317%2C0807.2122%2C0807.4182%2C0807.3680%2C0807.3577%2C0807.2044%2C0807.1921%2C0807.0939%2C0807.1056%2C0807.4744%2C0807.1458%2C0807.1079%2C0807.4193%2C0807.3774%2C0807.0969%2C0807.4385%2C0807.4481%2C0807.3457%2C0807.3275%2C0807.2356%2C0807.3444%2C0807.5100%2C0807.2607%2C0807.0248%2C0807.2073%2C0807.2744%2C0807.2403%2C0807.2945%2C0807.3425%2C0807.4422%2C0807.4256%2C0807.2055%2C0807.4743%2C0807.0025%2C0807.0660%2C0807.1945%2C0807.1692%2C0807.1502%2C0807.1319%2C0807.1286&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We report the discovery of three new triple-mode classical Cepheids in the\nLarge Magellanic Cloud, two of them with the fundamental, first overtone and\nsecond overtone excited, and one pulsating simultaneously in the first three\novertones. Thus, the number of triple-mode Cepheids in the LMC is increased to\nfive. We also present two objects belonging probably to a new type of\ndouble-mode Cepheids having the first and third overtones excited. We measure\nthe rates of period change in these stars and detect decrease of periods in two\nof them, what is in conflict with theoretical predictions."}, "authors": ["I. Soszynski", "R. Poleski", "A. Udalski", "M. Kubiak", "M. K. Szymanski", "G. Pietrzynski", "L. Wyrzykowski", "O. Szewczyk", "K. Ulaczyk"], "author_detail": {"name": "K. Ulaczyk"}, "author": "K. Ulaczyk", "arxiv_comment": "10 pages, 5 figures", "links": [{"href": "http://arxiv.org/abs/0807.4182v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0807.4182v2", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0807.4182v2", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0807.4182v2", "journal_reference": "Acta Astronomica 2008, 58, 153", "doi": null, "fulltext": "arXiv:0807.4182v2 [astro-ph] 6 Oct 2008\n\nACTA ASTRONOMICA\nVol. 58 (2008) pp. 153–162\n\nThe Optical Gravitational Lensing Experiment.\nTriple-Mode and 1O/3O Double-Mode Cepheids in the Large\nMagellanic Cloud∗\nI. S o s z y ń s k i 1 , R. P o l e s k i 1 , A. U d a l s k i 1 , M. K u b i a k 1 ,\nM. K. S z y m a ń s k i 1 , G. P i e t r z y ń s k i 1,2 , Ł. W y r z y k o w s k i 1,3 ,\nO. S z e w c z y k 1,2 and K. U l a c z y k 1\n1 Warsaw\n\nUniversity Observatory, Al. Ujazdowskie 4, 00-478 Warszawa, Poland\ne-mail:\n(soszynsk,rpoleski,udalski,mk,msz,pietrzyn,wyrzykow,szewczyk,kulaczyk)@astrouw.edu.pl\n2 Universidad de Concepción, Departamento de Fisica, Casilla 160–C, Concepción, Chile\n3 Institute of Astronomy, University of Cambridge, Madingley Road, Cambridge CB3\n0HA, UK\nReceived July 25, 2008\n\nABSTRACT\nWe report the discovery of three new triple-mode classical Cepheids in the Large Magellanic\nCloud, two of them with the fundamental, first overtone and second overtone excited, and one pulsating simultaneously in the first three overtones. Thus, the number of triple-mode Cepheids in the LMC\nis increased to five. We also present two objects belonging probably to a new type of double-mode\nCepheids having the first and third overtones excited. We measure the rates of period change in these\nstars and detect decrease of periods in two of them, what is in conflict with theoretical predictions.\nKey words: Cepheids – Stars: oscillations – Stars: evolution – Magellanic Clouds\n\n1.\n\nIntroduction\n\nClassical Cepheids pulsating simultaneously in three radial modes are extremely\nrare objects. Only four triple-mode Cepheids and δ Sct stars are known in the\nGalaxy: AC And (Fitch and Szeidl 1976), V823 Cas (Antipin 1997), V829 Aql\n(Handler et al. 1998) and recently discovered GSC 762-110 (Wils et al. 2008). All\nthese stars have fundamental (F), first (1O) and second (2O) overtone modes excited. The first two objects have fundamental-mode periods around 0.7 days and\n∗ Based\n\non observations obtained with the 1.3-m Warsaw telescope at the Las Campanas Observatory of the Carnegie Institution of Washington.\n\n\f154\n\nA. A.\n\ncan be recognized as classical Cepheids (though some controversy about this classifications exists), while two other triple-mode pulsators can be classified as δ Sct\nstars, because their longest periods are below 0.3 days.\nMoskalik et al. (2004) used the OGLE-II photometry (Soszyński et al. 2000)\nto discover two Cepheids in the Large Magellanic Cloud (LMC) pulsating simultaneously in the first, second and third overtones. These stars were theoretically\nanalyzed by Moskalik and Dziembowski (2005), who concluded that they must be\non the first crossing of the instability strip. Triple-mode pulsators are very useful in\nstudies of stellar interiors, because three periods strictly constrain the stellar parameters (e.g., Kovács and Buchler 1994, Moskalik and Dziembowski 2005, Jurcsik et\nal. 2006). Periods are those observables, that can be measured with very high precision, independently of the interstellar extinction and photometric calibration.\nHere, we report the discovery of three triple-mode Cepheids in the LMC, two\nof which pulsate in the fundamental mode, first and second overtones, and one\nof the same type as discovered by Moskalik et al. (2004), i.e., with the first three\novertones excited. We also show a new class of double mode Cepheids – stars\noscillating simultaneously in the first and the third overtones.\n2.\n\nObservational Data\n\nThe photometry used in this study was obtained in the course of the third phase\nof the Optical Gravitational Lensing Experiment (OGLE-III) with the Warsaw Telescope at Las Campanas Observatory, Chile (operated by Carnegie Institution of\nWashington). Typically about 380 Cousin's I-band observations per star were collected between 2001 and 2008 for 116 fields covering about 40 square degrees in\nthe LMC. For three objects (LMC111.2 38564, LMC161.6 14207 and LMC169.8\n75460) the OGLE-II data were available, what increased the number of points to\n800–900 per star, collected within 12 years. In addition a few dozen observations\nin Johnson's V waveband were done to obtain the (V − I) color information. Detailed description of the data reduction, photometric calibration and astrometric\ntransformations of the OGLE-III data can be found in Udalski et al. (2008).\n3.\n\nSearch for Multiperiodic Cepheids\n\nWe searched for multiperiodicity in our sample of more than 3300 classical\nCepheids in the LMC (Soszyński et al. 2008) using standard procedure. Each light\ncurve was folded with the primary pulsational period and a Fourier series of an\norder depending on the shape and scatter of the light curve was fitted. The number\nof harmonics of the Fourier decomposition was adjusted to minimize the χ2 per\none degree of freedom. Then, the fitted function was subtracted from the light\ncurve and the period searching was carried out on the residual data. This procedure\nwas repeated twice.\n\n\fVol. 58\n\n155\n\nFig. 1. Power spectra and light curves of F/1O/2O triple-mode Cepheid LMC111.2 38564. Upper\npanel displays periodogram obtained for the original data, middle panel shows data after subtracting the primary period marked with triangle, and the third panel displays the power spectrum after\nprewhitening with the primary and the secondary periods. Three bottom panels show light curves\nfolded with the primary, secondary and tertiary periods after removing the other two modes.\n\nWe found that way a considerable number of 264 double-mode Cepheids of\nboth types: F/1O and 1O/2O. Among bimodal variables we also found interesting\nobjects with ratios of periods inconsistent with well known values for double-mode\nCepheids, for example significant number of stars with period ratios close to 1\n(corresponding to non-radial pulsations), or in the range 0.60–0.63 (of unknown\norigin). All these objects have been published in the first part of the OGLE-III\nCatalog of Variable Stars presenting classical Cepheids in the LMC.\nA special attention was devoted to the selection of triple-mode Cepheids. We\nchecked all double mode Cepheids in our list for additional variability. First, we\nprewhitened the light curves with two pulsational periods and detrended the data by\nfitting and subtracting splines. Then, we checked the residual data of every double-\n\n\f156\n\nA. A.\n\nFig. 2. Power spectra and light curves of F/1O/2O triple-mode Cepheid LMC117.6 37124. The\ndescription of the diagrams is the same as in Fig. 1.\n\nmode Cepheid, looking for independent periodicities which may correspond to additional radial mode of pulsation. All the stars with proper position in the Petersen\ndiagram (a plot of period ratios vs. longer periods) were visually inspected and\nfive likely candidates for triple-mode Cepheids were selected. All these objects\nwere found in the list of 1O/2O double-mode Cepheids. For each of them the first\novertone mode dominates in the power spectrum. For two of these variables the period ratios identify the new periodicities as fundamental modes of radial pulsations,\nwhile three remaining objects are 1O/2O/3O triple-mode Cepheids. From the latter\ngroup only one object – LMC179.4 33340 – is a new identification; two other stars\nwere detected by Moskalik et al. (2004) in the OGLE-II dataset.\nTables 1 and 2 summarize the main observational properties of the triple-mode\nCepheids in the LMC. Amplitudes of the modes were derived as differences between the maximum and minimum values of the functions fitted to the light curves.\nPeriodograms and light curves of newly detected stars are shown in Figs. 1–3. In\n\n\fVol. 58\n\n157\n\nFig. 3. Power spectra and light curves of 1O/2O/3O triple-mode Cepheid LMC179.4 33340. The\ndescription of the diagrams is the same as in Fig. 1.\n\neach figure the upper panel shows Lomb-Scargle power spectrum obtained for the\noriginal data, the next panel contains periodogram after removing the primary periodicity (it is always the first overtone mode) and the lower spectrum is obtained\nwith data after prewhitening with the primary and secondary frequencies and their\nlinear combinations. Three panels below the spectra show the light curves folded\nwith the primary, secondary and tertiary periods but, in each case, after subtracting\nthe other two modes and their harmonics. Photometry and finding charts of the\nstars presented in this paper can be found in Soszyński et al. (2008).\nThen, we inspected the double-periodic Cepheids with unusual period ratios.\nWe paid attention for two objects with periods and period ratios almost the same\nas for the first and the third overtones in the triple-mode Cepheids, i.e., P3 /P1 =\n0.677. Their position in the Petersen diagram was practically the same as for P1\nand P3 periods of triple mode pulsators, but we detected no significant frequency\ncorresponding to the second overtone. We recognize these two stars as a new class\n\n\f1\n\n158\n\nTable 1\nF/1O/2O Triple-Mode Cepheids in the LMC\nStar ID\n\nRA\n\nDEC\n\nP0\n\nP1\n\nP2\n\n(J2000.0)\n\n(J2000.0)\n\n(days)\n\n(days)\n\n(days)\n\nA0\n\nA1\n\nLMC111.2 38564 5h 15m 28.s 82 −69◦ 21′ 05.′′ 0 0.515025(3) 0.3849391(3) 0.3093848(9) 0.037\nLMC117.6 37124\n\n5h 04m 30.s 51\n\n−67◦ 58′ 21.′′ 5\n\n1.46312(11)\n\n1.059132(6)\n\nA2\n\nI\n\nV\n\n(mag) (mag) (mag) (mag) (mag)\n\n0.855234(13) 0.006\n\n0.216\n\n0.038 17.690 18.203\n\n0.062\n\n0.023 16.269 16.954\n\nTable 2\n1O/2O/3O Triple-Mode Cepheids in the LMC\nStar ID\n\nRA\n\nDEC\n\nP1\n\nP2\n\nP3\n\n(J2000.0)\n\n(J2000.0)\n\n(days)\n\n(days)\n\n(days)\n\nA1\n\nA2\n\nLMC169.8 75460 5h 29m 35.s 57 −70◦ 02′ 57.′′ 1 0.5412792(3) 0.4360429(12) 0.3662999(6) 0.272\nLMC179.4 33340 5h 43m 07.s 63 −71◦ 20′ 07.′′ 6 0.5686925(8)\nLMC161.6 14207\n\n5h 23m 49.s 45\n\n−69◦ 13′ 32.′′ 7\n\n0.5795095(3)\n\nA3\n\nI\n\nV\n\n(mag) (mag) (mag) (mag) (mag)\n0.036\n\n0.066 16.950 17.493\n\n0.458190(5)\n\n0.384959(5)\n\n0.240\n\n0.023\n\n0.018 16.937 17.492\n\n0.466614(2)\n\n0.3921217(9) 0.237\n\n0.029\n\n0.035 16.868 17.354\n\nTable 3\n1O/3O Double-Mode Cepheids in the LMC\nStar ID\n\nDEC\n\nP1\n\nP3\n\n(J2000.0)\n\n(days)\n\n(days)\n\nA1\n\n5h 01m 34.s 72 −67◦ 02′ 35.′′ 9 0.5283468(16) 0.357845(8) 0.107\n\nLMC118.3 36626 5h 09m 09.s 93 −68◦ 34′ 58.′′ 9\n\n0.5711029(8)\n\nA3\n\nI\n\nV\n\n(mag) (mag) (mag) (mag)\n\n0.386792(4) 0.253\n\n0.029 17.057 17.602\n0.026 17.158 17.751\n\nA. A.\n\nLMC123.1 270\n\nRA\n(J2000.0)\n\n\fVol. 58\n\n159\n\nFig. 4. Power spectra and light curves of 1O/3O double-mode Cepheid LMC123.1 270. Two upper\npanels show power spectra for the original data and after subtracting the primary periodicity, respectively. Bottom panels display light curves folded with the primary and secondary periodicities after\nprewhitening with the other period.\n\nof double-mode Cepheids: 1O/3O pulsators. Table 3 lists the basic parameters of\nthese stars, while Figs. 4 and 5 show their power spectra and light curves. It is\nworth mentioning that for LMC123.1 270 we detected very weak periodic signal at\n0.311617 days, what may be a signature of the fourth overtone mode of pulsation.\n4.\n\nDiscussion\n\nThe advantage of studying variable stars in the Magellanic Clouds is that they\ncan be easily placed in the period–luminosity (PL) diagrams, what makes the variability type classification easier. All the stars presented in this paper have the primary periods corresponding to the pulsation in the first overtone and they match\nthe PL sequence of classical Cepheids in the V and I-band domains as well as in\nthe log P–WI plane, where WI = I − 1.55(V − I) is the reddening-free Wesenheit\nindex.\nThe dominant periods and period ratios point that LMC111.2 38564 is of the\nsame class of variable stars as Galactic AC And and V823 Cas, i.e., pulsator with\nthe three lowest radial modes excited. Since LMC111.2 38564 is a classical Cepheid,\n\n\f160\n\nA. A.\n\nFig. 5. Power spectra and light curves of 1O/3O double-mode Cepheid LMC118.3 36626. The\ndescription of the diagrams is the same as in Fig. 4.\n\nit should stop the discussion about the status of the Galactic triple mode pulsators.\nIn the literature AC And and/or V823 Cas were classified as RR Lyr stars (Fitch\nand Szeidl 1976, Peña et al. 2006), analogs of δ Sct stars (Kovács and Buchler\n1994), or as a completely new class of variable stars (Rodríguez 2002). In fact, the\nfundamental-mode periods of these stars fall in the gap between classical Cepheids\nand High Amplitude δ Sct (HADS) stars. However, our sample of pulsating stars\nin the LMC shows no such a gap for the first-overtone variables. Thus, it is rather a\nquestion of convention which period will be chosen to distinguish between HADS\nand classical Cepheids. In the OGLE-III Catalog of Variable Stars we adopted the\nlimiting period equal to P1 = 0.24 days for the first overtone mode, what keeps our\ntriple-mode variables (together with AC And and V823 Cas) on the Cepheid side.\nLMC117.6 37124 is the candidate for \"long period\" triple-mode Cepheid with\nthe three lowest modes excited, but the third (fundamental mode) periodicity is\nof marginal significance. The multiperiodicity of this star requires confirmation\nwith more accurate photometric data. We emphasize that among our double mode\nCepheids we detected more stars with very weak additional periodic signal which\nmay correspond to the radial mode of pulsation. This suggests that asteroseismology of classical Cepheids would yield new interesting information from dedicated\nprecise photometric surveys.\n\n\fVol. 58\n\n161\n\nThree Cepheids with 1O, 2O and 3O modes excited constitute very homogeneous group, with similar periods, luminosities and shapes of the light curves.\n1O/3O double-mode Cepheids seem to belong to the same class, because they occupy the same, very narrow, region in the Petersen diagram. The only difference\nbetween these two groups is the lack or presence of the second overtone mode.\nMoskalik and Dziembowski (2005) analyzed two triple-mode Cepheids in the\nLMC comparing their observed periods with those predicted from the pulsational\nmodels. They concluded that both triple-mode Cepheids must be on the first crossing of the instability strip. This result implies considerable rate of period change\nexpected for these stars, because the evolution on the Hertzsprung gap is very fast.\nWe made an attempt to measure the rate of period change in all stars presented\nin this paper. To increase the time baseline of the photometry we merged the OGLE\nphotometry with publicly available data from the MACHO project† . After removing outlying points we scaled amplitudes and shifted zero points of the MACHO\nRM photometric measurements to obtain the same values as for the OGLE I-band\ndata. Then, the two datasets were merged resulting in light curves covering time\nspan of more than 16 years (from 1992 to 2008).\nThe search for secular period changes was performed with two methods. In the\nfirst method, we folded data of each star using trial periods P and period change\nrates Ṗ and we fitted the Fourier series with the same number of harmonics as in\nthe period searching procedure (minimizing the χ2 per degree of freedom). Then,\nusing simplex method, we found the values of P and Ṗ that minimize the scatter\naround the fit to the folded light curves. In the second method, we constructed\nO − C diagrams for each star. We used an iterative procedure based on the measurements of the phase shifts of the fitted mean light curve relative to the chunks\nof data consisting of at least 10 observing points from the same observing seasons.\nThen, the parabola was fitted to the O − C diagram what gave us the ephemeris\nwith quadratic component. Details of both algorithms will be described by Poleski\n(2008, in preparation).\nWe tested only the first overtone periods, because the other modes have much\nlower amplitudes and consequently the Ṗ are determined with much larger errors.\nBoth methods produced very similar period change rates for each star, what ensured us that the procedures are reliable. Only for two Cepheids we obtained the Ṗ\nsignificantly different from zero. In both cases we measured the decrease of periods: for 1O/2O/3O triple mode Cepheid LMC179.4 33340 we found Ṗ/P = −2.7±\n0.3 Myr−1 and for 1O/3O double-mode LMC123.1 270: Ṗ/P = −1.5±0.5 Myr−1 .\nThese values are in clear disagreement with the period change rates predicted by\nMoskalik and Dziembowski (2005) for the first crossing of the instability strip.\nHowever, these measurements disagree also with the hypothesis that these stars are\nin the second crossing (if it is possible at all for stars of that type), because the\n† http://wwwmacho.mcmaster.ca/Data/MachoData.html\n\n\f162\n\nA. A.\n\nperiod changes are too fast. We conclude that the observed changes of periods have\nprobably other than evolutionary reason.\nAcknowledgements. We want to acknowledge Prof. W. Dziembowski for critical reading of the manuscript and useful comments. This paper was partially supported by the Polish MNiSW grants: NN203293533 to IS and N20303032/4275 to\nAU and by the Foundation for Polish Science through the Homing Program.\nREFERENCES\nAntipin, S. 1997, A&A, 326, L1.\nFitch, W.S., and Szeidl, B. 1976, ApJ, 203, 616.\nHandler, G., Pikall, H., and Diethelm, R. 1998, IBVS, 4549.\nJurcsik, J., Szeidl, B., Váradi, M., Henden, A., Hurta, Zs., Lakatos, B., Posztobányi, K., Klagyivik, P.,\nand Sódor, Á. 2006, A&A, 445, 617.\nKovács, G., and Buchler, J.R. 1994, A&A, 281, 749.\nMoskalik, P., Kołaczkowski, Z., and Mizerski, T. 2004, in: \"Variable Stars in the Local Group\",\nEd. D.W. Kurtz, and K. Pollard, ASP Conf. Ser., 310, 498.\nMoskalik, P., and Dziembowski, W.A. 2005, A&A, 434, 1077.\nPeña, J.H., Peniche, R., Hobart, M.A., de la Cruz, C., and Gallegos, A.A. 2006, Memorie della Societa\nAstronomica Italiana, 77, 142.\nRodríguez, E. 2002, in: \"Observational Aspects of Pulsating B and A Stars\", Ed. C. Sterken, and\nD.W. Kurtz, ASP Conf. Ser., 256, 145.\nSoszyński, I., Udalski, A., Szymański, M., Kubiak, M., Pietrzyński, G., Woźniak, P., and Żebruń, K.\n2000, Acta Astron., 50, 451.\nSoszyński, I., Poleski, R., Udalski, A., Szymański, M.K., Kubiak, M., Pietrzyński, G.,\nWyrzykowski, Ł., Szewczyk, O., and Ulaczyk, K. 2008, Acta Astron., 58, 163.\nUdalski, A., Szymański, M.K., Soszyński, I., and Poleski, R. 2008, Acta Astron., 58, 69.\nWils, P., Rozakis, I., Kleidis, S., Hambsch, F.-J., and Bernhard, K. 2008, A&A, 478, 865.\n\n\f"}