{"id": "http://arxiv.org/abs/0812.0908v1", "guidislink": true, "updated": "2008-12-04T11:14:36Z", "updated_parsed": [2008, 12, 4, 11, 14, 36, 3, 339, 0], "published": "2008-12-04T11:14:36Z", "published_parsed": [2008, 12, 4, 11, 14, 36, 3, 339, 0], "title": "Lane formation in driven colloidal mixtures: is it continuous or\n  discontinuous?", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0812.4076%2C0812.1403%2C0812.3471%2C0812.4520%2C0812.4974%2C0812.4332%2C0812.3593%2C0812.1546%2C0812.2335%2C0812.2707%2C0812.3299%2C0812.3185%2C0812.2693%2C0812.0088%2C0812.3693%2C0812.3003%2C0812.2163%2C0812.1291%2C0812.2552%2C0812.0728%2C0812.2998%2C0812.4169%2C0812.1715%2C0812.0238%2C0812.2820%2C0812.2515%2C0812.0115%2C0812.2783%2C0812.5030%2C0812.0190%2C0812.0943%2C0812.3660%2C0812.1261%2C0812.0370%2C0812.4038%2C0812.3625%2C0812.4395%2C0812.0731%2C0812.3603%2C0812.1543%2C0812.1486%2C0812.3224%2C0812.0983%2C0812.1182%2C0812.0395%2C0812.0720%2C0812.4962%2C0812.2627%2C0812.0908%2C0812.2737%2C0812.4797%2C0812.2748%2C0812.0580%2C0812.0626%2C0812.3791%2C0812.1827%2C0812.3382%2C0812.2177%2C0812.4348%2C0812.2007%2C0812.4627%2C0812.2932%2C0812.5071%2C0812.0317%2C0812.2636%2C0812.1074%2C0812.1144%2C0812.0608%2C0812.0835%2C0812.0084%2C0812.1437%2C0812.4412%2C0812.2039%2C0812.2046%2C0812.4275%2C0812.1667%2C0812.3725%2C0812.1148%2C0812.1644%2C0812.3616%2C0812.3360%2C0812.0033%2C0812.3315%2C0812.0931%2C0812.4781%2C0812.0045%2C0812.1363%2C0812.4084%2C0812.4897%2C0812.1953%2C0812.1406%2C0812.0120%2C0812.1462%2C0812.5063%2C0812.4285%2C0812.5012%2C0812.3581%2C0812.4110%2C0812.0099%2C0812.0503%2C0812.2154&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Lane formation in driven colloidal mixtures: is it continuous or\n  discontinuous?"}, "summary": "Binary mixtures of oppositely charged colloids driven by an electric field\nare shown to exhibit a nonequilibrium transition towards lane formation if the\ndriving force is increased. Brownian dynamics computer simulations and\nreal-space experiments are employed to study hysteresis effects in an order\nparameter measuring the extent of lane formation upon increasing and decreasing\nthe driving force. Both from simulation and experiment, we find that lane\nformation due to electrical fields is continuous. However, simulations show a\ndiscontinuous transition if the driving force is gravity.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0812.4076%2C0812.1403%2C0812.3471%2C0812.4520%2C0812.4974%2C0812.4332%2C0812.3593%2C0812.1546%2C0812.2335%2C0812.2707%2C0812.3299%2C0812.3185%2C0812.2693%2C0812.0088%2C0812.3693%2C0812.3003%2C0812.2163%2C0812.1291%2C0812.2552%2C0812.0728%2C0812.2998%2C0812.4169%2C0812.1715%2C0812.0238%2C0812.2820%2C0812.2515%2C0812.0115%2C0812.2783%2C0812.5030%2C0812.0190%2C0812.0943%2C0812.3660%2C0812.1261%2C0812.0370%2C0812.4038%2C0812.3625%2C0812.4395%2C0812.0731%2C0812.3603%2C0812.1543%2C0812.1486%2C0812.3224%2C0812.0983%2C0812.1182%2C0812.0395%2C0812.0720%2C0812.4962%2C0812.2627%2C0812.0908%2C0812.2737%2C0812.4797%2C0812.2748%2C0812.0580%2C0812.0626%2C0812.3791%2C0812.1827%2C0812.3382%2C0812.2177%2C0812.4348%2C0812.2007%2C0812.4627%2C0812.2932%2C0812.5071%2C0812.0317%2C0812.2636%2C0812.1074%2C0812.1144%2C0812.0608%2C0812.0835%2C0812.0084%2C0812.1437%2C0812.4412%2C0812.2039%2C0812.2046%2C0812.4275%2C0812.1667%2C0812.3725%2C0812.1148%2C0812.1644%2C0812.3616%2C0812.3360%2C0812.0033%2C0812.3315%2C0812.0931%2C0812.4781%2C0812.0045%2C0812.1363%2C0812.4084%2C0812.4897%2C0812.1953%2C0812.1406%2C0812.0120%2C0812.1462%2C0812.5063%2C0812.4285%2C0812.5012%2C0812.3581%2C0812.4110%2C0812.0099%2C0812.0503%2C0812.2154&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Binary mixtures of oppositely charged colloids driven by an electric field\nare shown to exhibit a nonequilibrium transition towards lane formation if the\ndriving force is increased. Brownian dynamics computer simulations and\nreal-space experiments are employed to study hysteresis effects in an order\nparameter measuring the extent of lane formation upon increasing and decreasing\nthe driving force. Both from simulation and experiment, we find that lane\nformation due to electrical fields is continuous. However, simulations show a\ndiscontinuous transition if the driving force is gravity."}, "authors": ["Martin Rex", "C. Patrick Royall", "Alfons van Blaaderen", "Hartmut Löwen"], "author_detail": {"name": "Hartmut Löwen"}, "author": "Hartmut Löwen", "arxiv_comment": "5 pages, 4 figures", "links": [{"href": "http://arxiv.org/abs/0812.0908v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0812.0908v1", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "cond-mat.soft", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cond-mat.soft", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0812.0908v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0812.0908v1", "journal_reference": null, "doi": null, "fulltext": "Lane formation in driven colloidal mixtures: is it continuous or discontinuous?\nMartin Rex1 , C. Patrick Royall2 , Alfons van Blaaderen3, Hartmut Löwen1\n\narXiv:0812.0908v1 [cond-mat.soft] 4 Dec 2008\n\n1\nInstitut für Theoretische Physik II: Weiche Materie,\nHeinrich-Heine-Universität Düsseldorf, Universitätsstrasse 1, D-40225 Düsseldorf, Germany\n2\nSchool of Chemistry, University of Bristol, Bristol, BS8 1TS, UK\n3\nSoft Condensed Matter Group, Debye Institute for Nanomaterials Science,\nUtrecht University, PO Box 80000, 3508 TA Utrecht, The Netherlands\n(Dated: October 26, 2018)\n\nBinary mixtures of oppositely charged colloids driven by an electric field are shown to exhibit\na nonequilibrium transition towards lane formation if the driving force is increased. Brownian\ndynamics computer simulations and real-space experiments are employed to study hysteresis effects\nin an order parameter measuring the extent of lane formation upon increasing and decreasing the\ndriving force. Both from simulation and experiment, we find that lane formation due to electrical\nfields is continuous. However, simulations show a discontinuous transition if the driving force is\ngravity.\nPACS numbers: 82.70.Dd, 61.20.Ja, 64.70.Dv, 05.70.Ja\n\nIn equilibrium, there is a fundamental difference between a sharp phase transition which exhibits a jump\nin a certain derivative of the free energy with respect\nto a thermodynamic variable [1] and a continuous crossover where no such discontinuity exists in the thermodynamic limit. This is much less clear for nonequilibrium\nphase transitions since a free energy does not exist in\ngeneral in nonequilibrium. Here, in many situations, an\norder parameter can still be defined in the steady state\nand hysteresis behaviour typically serves as a criterion to\ndiscriminate between discontinuous and continuous behaviour [2]. While it is by now well-understood how the\norder of an equilibrium phase transition is controllable\nby the interparticle interactions [3, 4], the question of\nwhich key parameters determine the existence and order\nof nonequilibrium phase transitions is much less understood due to the multitude of parameters characterizing the nature of the dynamics which do not apply in\nequilibrium.\nLane formation in a binary mixture of Brownian particles which are driven by a constant external force depending on the particle species [5] represents a prototype\nof a nonequilibrium transition in a continuous (i.e. offlattice) system [6]. Brownian dynamics computer simulations strongly support the scenario that for increasing\ndriving force the system undergoes a transition from a\nmixed steady state towards a steady state where macroscopic lanes are formed. Such a laning transition has\nbeen found in models for oppositely driven repulsive mixtures [5, 7, 8, 9, 10, 11] in two and three spatial dimensions. In two spatial dimensions, it was found [5] that\na suitable order parameter which detects laning exhibits\na significant hysteresis - if the driving force is increased\nand subsequently decreased - which signals a discontinuous nonequilibrium phase transition. This issue is still\nunclear in three spatial dimensions. Though the general scenario occurs for pedestrian dynamics [12, 13], in\ndriven granular [14, 15] and colloidal [16] matter and in\nTypeset by REVTEX\n\ncomplex plasmas [17], a quantitative comparison of laning with simulation data and the determination of the\nunderlying order of the transition is still lacking.\nThe aim of this letter is twofold: first, we show that oppositely charged colloidal particles driven in an electric\nfield [16] exhibit lane formation in quantitative agreement with our Brownian dynamics computer simulations. Second, we address the question whether the\ntransition towards lane formation is discontinuous or a\nsmooth crossover. While charged colloids are found to exhibit lanes in a continuous way upon increasing the electric field strength, additional simulations reveal that the\ntransition becomes discontinuous if gravity is the driving force. The physical reason is that hydrodynamic interactions are screened in the electric context [18, 19]\nwhile they are long-ranged for gravity. In fact, threedimensional simulations which neglect hydrodynamic interactions completely yield a continuous transition as\nwell. Our results demonstrate that the existence and order of a nonequilibrium phase transition depends on details of the dynamics even when the particle interactions\nwhich entirely determine the order of phase transitions\nin equilibrium are kept fixed.\nIn our experiments, we used suspensions of polymethylmethacrylate colloids in a density matching mixture of cyclohexyl bromide and cis decalin into which\nwe dissolved 60 μM tetra butyl ammonium bromide\nsalt. An equimolar binary suspension of colloids fluorescently labelled with Rhodamine and 7-nitrobenzo-2oxa-1,3-diazol with volume fraction ηN = ηR = 0.1 was\nprepared. The diameter of both species was 1.2 μm. The\ninclusion of salt led to both colloidal species accquiring\nopposite charges of Zi = 100e, and a Debye screening\nlength of κ−1 ≈ 300 nm [16]. The solvent dielectric constant ǫ was 5.5, and shear viscosity was η = 2.2 cP.\nAll experiments were conducted at room temperature\nT = 300 K. We used a Leica NT confocal laser scanning\nmicroscope. Experimental data was taken in 2D scans of\n\n\f2\ntypically 100 μm in width at a frame rate of around 2\nframes per second, ie coordinates were collected from\na diffraction-limited slice of ∼ 2μm in depth.\nIn our Brownian dynamics computer simulations, we\nconsider an equimolar binary mixture of N = 1024 oppositely charged colloidal particles of hard-core diameter\nσ at corresponding total volume fraction φ = 0.2 dispersed in a solvent whose viscosity and dielectric constant matched the experimental values, likewise we set\nand T = 300 K.\nThe simulation is performed in a cubic box of length l\nwith periodic boundary conditions in all three directions\n[20]. Apart from their steric repulsion, the particles interact via the screened Coulomb potential\nVij (r) =\n\ne(−κσ(r/σ−1))\nZi Zj\n2\nǫ(1 + κσ/2)\nr\n\n(1)\n\nwhere i and j label the particle species, Zi denotes the\nparticle charge, r is the interparticle separation and κ is\nthe inverse Debye-Hückel screening length depending on\nthe salt concentration in the solvent. We take κσ = 4\nin order to match the experimental salt concentration.\n~\n~ yields the driving forces Fext = Z ∗ E\nAn electric field E\ni\ni\nacting on the particles. The actual electrophoretic charge\nrenormalization is taken to be Zi∗ /Zi = 0.8 as obtained\nfrom the averaged drift velocity in the electric field at\nlow densities [21].\nTime-dependent trajectories of the particles are\ncalculated using a finite-time step method with a\nconfiguration-dependent diffusion tensor [22]. The magnitude of friction is set by the Stokes-drag expression where the free diffusion constant is given by\nD0 kB T /3πησH (with kB denoting Boltzmann's constant) which sets the typical Brownian time scale τB =\nD0 /σ 2 . Here the hydrodynamic diameter of the particles is set very close to the interaction core σ such that\nσH = 0.98σ. We use the pairwise approximation based\nthe Long-Ajdari mobility tensor [18] in order to include\nhydrodynamic interactions properly for a driving electric\nfield [19]. After an initial relaxation period of typically\n20τB the system runs into a steady state. The time-step\nused in the simulation was ∆t = 10−4 τB .\nExperimental snapshots in the steady state for two\nelectric field strengths E = 30kV /m and E = 100kV /m\nare presented in Figure 1. The vertical extent of the optical slice is set by diffraction, leading to a lengthscale\nof order 2μm. The snapshots clearly reveal the onset of\nlaning for increasing electric driving field. Corresponding\nsnapshots of our Brownian dynamics computer simulations are presented in Figure 2. For sake of comparison,\nthe same field strengths were used as for the experimental\nsnapshots. The simulation configurations show a similar\ntendency towards laning along the drive direction when\nthe electric field is increased.\nIn order to quantify the extent of laning, we define a\nlaning order parameter m as follows: we assign a cylin-\n\na\n\nb\n\nFIG. 1: Typical particle configuration for positively (green\nspheres) and negatively (red spheres) charged colloids in an\nelectric field of strength E along the horizontal direction.\nOnly particles whose centres are within a slice of thickness\n2μm are shown. The length bar is 10 μm. The formation\nof lanes can clearly be seen. (a) experimental snapshot for\nE = 30kV /m, (b) experimental snapshot for E = 100kV /m.\nThe other parameters are given in the text.\n\nder of diameter 0.9σ and total height 6σ symmetrically\naround the center of each particle i such that the cylinder axis is parallel to the driving field. If one or more\nparticles of different species are contained in this cylinders, we define the value of mi = 0 to this particle while\nmi = 1 if the cylinder is free from other particles with\nan opposite charge. The averaged dimensionless laning\norder parameter\nm =<\n\nN\nX\n\nmi > /N\n\n(2)\n\ni=1\n\nwhere < ... > refers to a particle and steady-state average and N is the total number of particles considered\n\n\f3\n\n1\n\na\n\n0.8\n\nm\n\n0.6\n0.4\n0.2\n0\n0\n\nb\n\n50\n\n100\n\n150\n\nE [kV/m]\n\n200\n\n250\n\n300\n\nFIG. 3: Averaged laning order parameter m versus electric field strength E (in units of kV /m). The open squares\n(full line) are the simulation results upon increasing the field\nstrength, the full triangles (dashed line) shows the same upon\ndecreasing the field strength. No hysteresis is found. The\ndiamonds (dot-dashed line) are the experimental data. The\nparameters are the same as in Fig. 1.\n\nrameter than the simulation which is acceptable given\nthe uncertaincy in the particle charge. The experimental data were taken both increasing and decreasing the\nexternal field, and no difference was observed. Hence we\nconclude that effects of hysteresis are largely absent. We\nremark that possible effects arising from electro-osmotic\nflow are not exactly known.\nFIG. 2: Computer simulation snapshots for positively (green\nspheres) and negatively (red spheres) charged colloids in an\nelectric field of strength E along the horizontal direction.\nOnly particles whose centres are within a slice of thickness\n2σ are shown. (a) E = 30kV /m, (b) E = 100kV /m. The\nother parameters are given in the text.\n\nmeasures the averaged extent of laning. By construction, the laning order parameter m equals 1 if particles\nof the same species are always on top of each other along\nthe drive but it vanishes in a completely mixed situation.\nWe have averaged this laning order parameter over many\nsimulation configurations. For the experimental data, a\nsimilar laning order parameter was obtained by using a\nprojected cylinder (i.e. a rectangular cut) to the plane\ncontaining the particles. Plots of the laning order parameter m versus the strengths of the electric field applied\nare presented in Figure 3.\nFirst, there is reasonable agreement between simulation and experiment. The increase of the laning order\nparameter with the external drive is smooth. The experimental data reveal a slightly smaller laning order pa-\n\nFinally, we consider the case of gravity in which the\ndriving forces result from a different buoyant mass of the\ntwo particle species. In particular, we treat the symmetric case here where plus and minus charged particles feel\nthe same gravitational force but just their sign is different. Our Brownian dynamics computer simulations are\nnow performed with the unscreened Rotne-Prager mobility tensor [23] replacing the screened Long-Ajdari tensor. All the other parameters are kept unchanged. In\nFigure 4 the simulation results for the laning order parameter are shown for increasing and decreasing driving\nforces. The results are compared to the case of an electric\nfield where the mobility tensor is screened due to counterion counter-motion. A significant hysteresis behaviour\nis detected for sedimentation which clearly signals a discontinuous transition towards laning while no such hysteresis is present for electrophoresis and in the complete\nabsence of hydrodynamic interactions. This clearly indicates that it is the range of hydrodynamic interactions\nwhich make lane formation discontinuous. In a strictly\ntwo dimensional system, laning occurs in a discontinuous\nway even when hydrodynamic interactions are ignored\ncompletely [5]. Therefore besides the hydrodynamics the\nsystem dimensionality plays an important role in determining whether laning is discontinuous or continuous.\n\n\f4\n\n1\n\n(a) electric field\n0.8\n\nm\n\n0.6\n0.4\n0.2\n0\n0\n\n50\n\n100\n\nf\n\n*\n\n150\n\n200\n\n*\n\n150\n\n200\n\n1\n\n(b) gravity\n0.8\n\nm\n\n0.6\n0.4\n0.2\n0\n0\n1\n0.8\n\n50\n\n100\n\nf\n\n(c) no hydrodynamic\ninteractions\n\nm\n\n0.6\n\nstrength is increased. Real-space experimental data are\nin quantitative agreement with Brownian dynamics computer simulations which include the screened hydrodynamic interactions between the driven colloids. The continuous crossover towards laning is in marked contrast\nto sedimenting colloids where lane formation occurs via\na nonequilibrium first-order phase transition as revealed\nby a significant hysteresis behaviour in a suitable order\nparameter. This change must be attributed to the longrange nature of hydrodynamic interactions in the sedimentation case. In a reduced system dimensionality, on\nthe other hand, laning is discontinuous as well even when\nhydrodynamic interactions are ignored. Hence the order\nof the lane formation is determined by both, hydrodynamic interactions and system dimensionality. Therefore\nthe more general conclusion is that the existence and order of a nonequilibrium phase transition depends on details of the dynamics even when the particle interactions\nwhich entirely determine the order of phase transitions\nin equilibrium are kept fixed.\nLane formation does not only occur in colloidal systems\nbut also in dusty plasmas where hydrodynamic interactions are absent but inertia effects play a dominant role\n[17]. We expect that, in three dimensions, the tendency\ntowards lane formation will be continuous there as well.\nIn strict two dimensions, e.g. for pedestrian dynamics\nand shaken granular matter, we expect a continuous behaviour irrespective to the details of the dynamics.\nWe thank A. Ladd and A. Wysocki for helpful discussions. This work was been supported by the SFB TR6\n(DFG/FOM) within the projects A3 and D1.\n\n0.4\n0.2\n0\n0\n\n50\n\n100\n\nf\n\n*\n\n150\n\n200\n\nFIG. 4: Averaged laning order parameter versus reduced\ndriving force f ∗ both upon increasing (open squares, full\nline) and decreasing (full triangles, dashed line) the driving\nforces: (a) for an electric driving field where f ∗ = E mod Z1∗\nmod σ/kB T and hydrodynamic interactions are screened, (b)\nfor a gravitational force M g where f ∗ = ±M gσ/kB T and hydrodynamic interactions are long-ranged, (c) same as (a)/(b)\nbut for neglected hydrodynamic interactions. The length of\nthe cylinder in the definition of the order parameter here spans\nthe whole simulation box.\n\nIn conclusion, we have shown that oppositely charged\ncolloids driven by an external electric field show a continuous tendency towards lane formation if the driving\n\n[1] H.B. Callen, Thermodynamics, John Wiley and Sons\n(1960).\n[2] B. Schmittmann, R.K.P. Zia, Physics Reports 301, 45\n(1998).\n[3] H.N.W. Lekkerkerker, Physica A 244, 227 (1997).\n[4] W.C.K. Poon, Current Opinion in Colloid and Interface\nScience 3, 593 (1998).\n[5] J. Dzubiella, G.P. Hoffmann, H. Löwen, Phys. Rev. E 65,\n021402 (2002).\n[6] A nonequilibrium phase transition in periodically driven\nmodel was recently discussed by: L. Corte, P.M. Chaikin,\nJ.P. Gollub, D.J. Pine, Nature Physics 4, 420 (2008).\n[7] R.R. Netz, Europhysics Letters 63, 616 (2003).\n[8] J. Chakrabarti, J. Dzubiella, H. Löwen, Europhys. Letters 61, 415 (2003).\n[9] H. Löwen, J. Dzubiella, Faraday Discussions 123, 99\n(2003).\n[10] J. Delhommelle, Phys. Rev. E 71, 016705 (2005).\n[11] R.B. Pandey, J.F. Gettrust, R. Seyfarth, L.A. CuevaParra, Int. J. Mod. Phys. C 14, 955 (2003).\n[12] R. Jiang, D. Helbing, P.K. Shukla, Q.S. Wu, Physica A\n368, 567 (2006).\n[13] R. Kolbl, D. Helbing, New Journal of Physics 5, 48\n(2003).\n\n\f5\n[14] G.C.M.A. Ehrhardt, A. Stephenson, P.M. Reis. Phys.\nRev. E 71, 041301 (2005).\n[15] M.P. Ciamarra, A. Coniglio, M. Nicodemi, Phys. Rev.\nLetters 94, 188001 (2005).\n[16] M.E. Leunissen, C.G. Christova, A.P. Hynninen, C.P.\nRoyall, A.I. Campbell, A. Imhof, M. Dijkstra, R. van\nRoij, A. van Blaaderen, Nature 437, 7056 (2005).\n[17] For a recent review, see: G.E. Morfill, V.N. Tsytovich, H.\nThomas, S.V. Vladimirov, Elementary Physics of Complex Plasmas, ISBN 3540290001, Springer-Verlag GmbH,\n\n2008.\n[18] D. Long, A. Ajdari, Eur. Phys. J. E 4, 29 (2001).\n[19] M. Rex, H. Löwen, European Physical Journal E 26, 143\n(2008).\n[20] M. Rex, H. Löwen, Phys. Rev. E 75, 051402 (2007).\n[21] M.E. Leunissen, Ph.D. thesis, Utrecht University, 2007.\n[22] M.P. Allen, D.J. Tildesley, eds., Computer Simulation of\nLiquids (Clarendon Press Oxford, Oxford, 1989).\n[23] J. Rotne, S. Prager, J. Chem. Phys. 50, 4831 (1969).\n\n\f"}