{"id": "http://arxiv.org/abs/0802.2663v1", "guidislink": true, "updated": "2008-02-19T15:10:26Z", "updated_parsed": [2008, 2, 19, 15, 10, 26, 1, 50, 0], "published": "2008-02-19T15:10:26Z", "published_parsed": [2008, 2, 19, 15, 10, 26, 1, 50, 0], "title": "Spurious Eccentricities of Distorted Binary Components", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0802.2122%2C0802.3497%2C0802.0986%2C0802.0013%2C0802.1681%2C0802.0772%2C0802.2427%2C0802.3060%2C0802.4414%2C0802.2290%2C0802.0402%2C0802.0912%2C0802.2251%2C0802.0227%2C0802.4373%2C0802.0164%2C0802.3393%2C0802.2307%2C0802.1281%2C0802.1831%2C0802.2080%2C0802.1536%2C0802.3289%2C0802.2481%2C0802.2491%2C0802.3246%2C0802.0994%2C0802.2245%2C0802.0886%2C0802.2243%2C0802.2108%2C0802.1096%2C0802.1755%2C0802.0161%2C0802.2899%2C0802.0166%2C0802.3805%2C0802.2605%2C0802.4221%2C0802.2514%2C0802.2752%2C0802.3099%2C0802.2562%2C0802.0652%2C0802.1950%2C0802.1661%2C0802.2862%2C0802.1694%2C0802.1672%2C0802.2143%2C0802.1490%2C0802.2494%2C0802.3924%2C0802.0971%2C0802.2036%2C0802.1225%2C0802.1117%2C0802.4436%2C0802.3648%2C0802.1920%2C0802.0467%2C0802.3329%2C0802.3248%2C0802.1487%2C0802.0234%2C0802.0430%2C0802.1751%2C0802.0613%2C0802.0165%2C0802.2940%2C0802.0171%2C0802.0927%2C0802.2254%2C0802.1107%2C0802.2636%2C0802.0896%2C0802.3610%2C0802.4363%2C0802.2714%2C0802.0842%2C0802.4078%2C0802.3527%2C0802.2223%2C0802.2341%2C0802.0185%2C0802.3427%2C0802.2438%2C0802.2216%2C0802.2281%2C0802.2663%2C0802.1989%2C0802.0487%2C0802.3408%2C0802.1047%2C0802.1335%2C0802.3273%2C0802.2646%2C0802.4125%2C0802.0134%2C0802.0578%2C0802.0883&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Spurious Eccentricities of Distorted Binary Components"}, "summary": "I discuss the effect of physical distortion on the velocities of close binary\ncomponents and how we may use the resulting distortion of velocity curves to\nconstrain some properties of binary systems, such as inclination and mass\nratio. Precise new velocities for 5 Cet convincingly detect these distortions\nwith their theoretically predicted phase dependence. We can even use such\ndistortions of velocity curves to test Lucy's theory of convective gravity\ndarkening. The observed distortions for TT Hya and 5 Cet require the contact\ncomponents of those systems to be gravity darkened, probably somewhat more than\npredicted by Lucy's theory but clearly not as much as expected for a radiative\nstar. These results imply there is no credible evidence for eccentric orbits in\nbinaries with contact components. I also present some speculative analyses of\nthe observed properties of a binary encased in a non-rotating common envelope,\nif such an object could actually exist, and discuss how the limb darkening of\nsome recently calculated model atmospheres for giant stars may bias my resuts\nfor velocity-curve distortions, as well as other results from a wide range of\nanalyses of binary stars.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0802.2122%2C0802.3497%2C0802.0986%2C0802.0013%2C0802.1681%2C0802.0772%2C0802.2427%2C0802.3060%2C0802.4414%2C0802.2290%2C0802.0402%2C0802.0912%2C0802.2251%2C0802.0227%2C0802.4373%2C0802.0164%2C0802.3393%2C0802.2307%2C0802.1281%2C0802.1831%2C0802.2080%2C0802.1536%2C0802.3289%2C0802.2481%2C0802.2491%2C0802.3246%2C0802.0994%2C0802.2245%2C0802.0886%2C0802.2243%2C0802.2108%2C0802.1096%2C0802.1755%2C0802.0161%2C0802.2899%2C0802.0166%2C0802.3805%2C0802.2605%2C0802.4221%2C0802.2514%2C0802.2752%2C0802.3099%2C0802.2562%2C0802.0652%2C0802.1950%2C0802.1661%2C0802.2862%2C0802.1694%2C0802.1672%2C0802.2143%2C0802.1490%2C0802.2494%2C0802.3924%2C0802.0971%2C0802.2036%2C0802.1225%2C0802.1117%2C0802.4436%2C0802.3648%2C0802.1920%2C0802.0467%2C0802.3329%2C0802.3248%2C0802.1487%2C0802.0234%2C0802.0430%2C0802.1751%2C0802.0613%2C0802.0165%2C0802.2940%2C0802.0171%2C0802.0927%2C0802.2254%2C0802.1107%2C0802.2636%2C0802.0896%2C0802.3610%2C0802.4363%2C0802.2714%2C0802.0842%2C0802.4078%2C0802.3527%2C0802.2223%2C0802.2341%2C0802.0185%2C0802.3427%2C0802.2438%2C0802.2216%2C0802.2281%2C0802.2663%2C0802.1989%2C0802.0487%2C0802.3408%2C0802.1047%2C0802.1335%2C0802.3273%2C0802.2646%2C0802.4125%2C0802.0134%2C0802.0578%2C0802.0883&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "I discuss the effect of physical distortion on the velocities of close binary\ncomponents and how we may use the resulting distortion of velocity curves to\nconstrain some properties of binary systems, such as inclination and mass\nratio. Precise new velocities for 5 Cet convincingly detect these distortions\nwith their theoretically predicted phase dependence. We can even use such\ndistortions of velocity curves to test Lucy's theory of convective gravity\ndarkening. The observed distortions for TT Hya and 5 Cet require the contact\ncomponents of those systems to be gravity darkened, probably somewhat more than\npredicted by Lucy's theory but clearly not as much as expected for a radiative\nstar. These results imply there is no credible evidence for eccentric orbits in\nbinaries with contact components. I also present some speculative analyses of\nthe observed properties of a binary encased in a non-rotating common envelope,\nif such an object could actually exist, and discuss how the limb darkening of\nsome recently calculated model atmospheres for giant stars may bias my resuts\nfor velocity-curve distortions, as well as other results from a wide range of\nanalyses of binary stars."}, "authors": ["Joel A. Eaton"], "author_detail": {"name": "Joel A. Eaton"}, "author": "Joel A. Eaton", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1086/588270", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/0802.2663v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0802.2663v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "14 pp, 2 tables, 12 fig; under review by ApJ", "arxiv_primary_category": {"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0802.2663v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0802.2663v1", "journal_reference": null, "doi": "10.1086/588270", "fulltext": "SPURIOUS ECCENTRICITIES OF DISTORTED BINARY\nCOMPONENTS\n\narXiv:0802.2663v1 [astro-ph] 19 Feb 2008\n\nJoel A. Eaton\nCenter of Excellence in Information Systems,\nTennessee State University,\nNashville, TN\neaton@donne.tsuniv.edu\nABSTRACT\nI discuss the effect of physical distortion on the velocities of close binary\ncomponents and how we may use the resulting distortion of velocity curves to\nconstrain some properties of binary systems, such as inclination and mass ratio. Precise new velocities for 5 Cet convincingly detect these distortions with\ntheir theoretically predicted phase dependence. We can even use such distortions\nof velocity curves to test Lucy's theory of convective gravity darkening. The\nobserved distortions for TT Hya and 5 Cet require the contact components of\nthose systems to be gravity darkened, probably somewhat more than predicted\nby Lucy's theory but clearly not as much as expected for a radiative star. These\nresults imply there is no credible evidence for eccentric orbits in binaries with\ncontact components. I also present some speculative analyses of the observed\nproperties of a binary encased in a non-rotating common envelope, if such an\nobject could actually exist, and discuss how the limb darkening of some recently\ncalculated model atmospheres for giant stars may bias my resuts for velocitycurve distortions, as well as other results from a wide range of analyses of binary\nstars.\nSubject headings: binaries: spectroscopic – stars: oscillations – stars: individual\n(5 Cet, AX Mon, TT Hya)\n\n1.\n\nINTRODUCTION\n\nTwo recent papers suggest the time is ripe to look critically at the effect of stellar\ndistortion on velocities of variable stars. In the first, Miller et al. (2007) found a slightly\n\n\f–2–\neccentric orbit for the Algol binary TT Hya, a system that has gone through mass exchange\nand, in so doing, surely circularized its orbit. In the second, Wood, Olivier, & Kawaler (2004)\nused velocity variations calculated for a rotating prolate spheroid as a possible mechanism\nfor explaining long-period velocity variations of AGB stars. The first paper assumes these\ndistortions are irrelevant; the second, that they are crucial.\nSolutions of the velocity curves of close binary systems often have small eccentricities\nthought to be spurious. Lucy & Sweeney (1971, 1973) argued that most of these were\nstatistical flukes resulting from errors of measurement. However, as we shall see in § 3, there\nare circumstances in which such eccentricities result from interesting physical processes, and\nfor which the resulting distortions may be used to extract useful information about the mass\nratios and inclinations of these systems. Such distortions from proximity effects were actually\npredicted by Sterne (1941), explored by Wilson & Sofia (1976) as a way of determining mass\nratios and inclinations of X-ray binaries, and discussed in passing by Wilson (1979), but\notherwise they do seem to have been ignored as a way of extracting information about\nbinaries.\nRed giants often have unexplained secondary periods much longer than their radial\nfundamentals (e.g. Wood et al. 2004). They manifest uncomfortably large radial-velocity\nvariations on those periods (Wood et al.; Hinkle et al. 2002), which imply pulsational excursions of the order of 30% of the radius of the star. These variations remain one of the\nburning mysteries of stellar astronomy (Derekas et al. 2007). They seem to have the sort\nof color variations expected of radial pulsation, yet there is no known mechanism for giving\nsuch long periods.\nI shall explore the implications of distortion on observed radial velocities, starting with\nan assessment of the rotating spheroids of Wood et al. in § 2.1, then exploring how a binary\nencased in a common envelope might appear to us in § 2.2, and finally discussing the much\nless speculative effects of distortion on radial velocities of close binary components in § 3.\n\n2.\n\nROTATION OF A PROLATE SPHEROID\n\nWood et al. (2004) used a prolate spheriod rotating about its short axis to model velocity\nvariations of AGB stars, although they ultimately rejected that idea. Since such a figure will\nproject symmetrically onto the sky about its rotation axis, there would be no net velocity\nvariation for a uniformly illuminated disc. So these variations must occur solely from the\neffects of limb and gravity darkening over the distorted surface (P. Wood, private comm. in\n2007; Sterne 1941).\n\n\f–3–\nLet us make some standard assumptions about the rotating spheriod. Give it axes a and\nb in its equatorial plane and, for simplicity, b toward its rotational pole. Assume the mass\nis concentrated to its center, so the local gravity is proportional to 1/r 2, and let the gravity\ndarkening be convective, FBol ∼ ∇Ωg , with g=0.32 following Lucy (1967), where Ω is the\ngravitational potential. Assume total darkening to the limb (x=1.0), a safe assumption for\nsuch cool stars. Finally, assume that the radial velocity of the centroid of light is the radial\nvelocity measured for the star. Now, if we write a computer program for these somewhat\nquestionable assumptions, we can calculate the light and velocity curves for such a star, if\nany such object were to exist.\nFigure 1 shows some velocity curves for a prolate spheriod with a=0.50 and b=0.25, a\nrather extreme case that illustrates the model pretty well. For this combination of parameters, we get light variation of about 1.9 mag at i=90◦ , somewhat larger than seen in the\nAGB stars. The solid and dashed curves have x=1.0 with g=0.0 and x=0.0 with g=0.32,\nrespectively, to show the separate effects of limb and gravity darkening, which seem to cancel each other out in this calculation. The dotted curve, for x=1.0 with g=0.32, shows the\ncombined effect. Both limb and gravity darkening obviously cause significant velocity variations mimicing an eccentric orbit. The curve for pure limb darkening in Figure 1 may be\nfit with an orbit in which e=0.21 and ω=270◦. The case of pure gravity darkening gives\ne=0.22 and ω=87◦. Other aspect ratios (b/a) give similar results but smaller amplitudes\nand somewhat smaller eccentricities for less elongation. More elongation gives very slightly\nbigger eccentricities.\nThese calculations for a rotating prolate spheroid do not represent the sort of longperiod velocity variation observed in AGB stars. The eccentricities we find for this ellipsoidal\nmodel e ∼ 0.2) are significantly smaller than the the formal eccentricities of cool giants when\ncompared to either the largest values measured or typical ones. Fitting the velocity shifts\nobserved for 9 stars with elliptical orbits gave e in the range 0.08–0.49 and ω in the range\n195–418◦ (Hinkle et al. 2002; Wood et al. 2004), with medians e=0.33, ω=251◦, and K=2.3\nkm s−1 . The phase dependence of the calculated theoretical effect for gravity darkening is\nwrong in that it gives a rapid drop in velocity, as in a classical radial pulsation, not in the\nobserved rapid rise. Furthermore, the velocity variation in these calculations (∆RV/vsini\n∼ 0.04) is small enough to require a rotational velocity (58 km s−1 for K=2.3 km s−1 )\nprohibitively large for AGB stars, for which vrot . 3 km s−1 (Olivier & Wood 2003).\n\n\f–4–\n2.1.\n\nSpeculations about an Encased Binary\n\nIt is not clear that any star, especially an AGB star, would be a prolate spheroid\nrotating about its fixed center of mass. The only way I can see to get a significant elongation\nis through tidal distortion in a close binary system, and the effects of that distortion on the\nvelocities can be rather subtle, as we shall see in § 3. Wood et al. argue that some of these\nAGB stars may be coalesced binaries, presumably with double cores encased in a common\nenvelope to account for the prolate shape, a radically imaginative idea deserving a closer\nlook.\nThe size of such an object presents another fundamental problem with trying to use a\nrotating prolate spheroid to explain the light and radial-velocity variations of AGB stars. If\nthe star has a double core, its period and linear scale are fixed by Kepler's laws. Consider,\nfor example, a star with a double core having a period of 1588 d (4.35 yr) as discussed by\nWood et al. for Z Eri. It would have a semi-major axis of 3 au (640 R⊙ ) for two 0.75 M⊙\ncomponents. Even in a binary consisting of two 1.0 M⊙ components with a period of 750 d,\nthe semi-major axis would be about 440R⊙ . The radii of these objects would be of the order\nof their semi-major axes. Wood et al. estimate radii near 170 R⊙ for the stars with long\nsecondary periods, so encased binaries with the right periods to explain the observed longterm velocity variations would seem to be too large. Also, if these stars were synchronously\nrotating, admittedly a completely unphysical condition, our two examples would have vrot\nof 20 and 30 km s−1 , respectively, much larger than the vsini's of AGB stars.\nThe idea of a binary totally encased in a common envelope seems preposterous, since the\ngravitational equipotential surfaces above the two cores, which presumably help control the\ndensity structure of the star, become very complicated with three Lagrangian points at which\nthe gravitational acceleration vanishes (e.g., Kopal 1959, Figs. 7-7 through 7-10). However,\nthis may be no worse than the generally accepted idea of a contact binary containing a single\nsuch Lagrangian point. Given these circumstances, however, it is not clear to me that any\nstar could be stable with a surface bigger than in a typical contact binary (one with its\nsurface between the first and second Lagrangian surfaces).\nA more fundamental problem with this idea is the question of solid-body rotation. For\na synchronous binary bigger than its second Lagrangian surface, the centrifugal potential\ndominates, and the surfaces of constant potential (normally the level surfaces) are unbound.\nAny star containing a double core must, therefore, be rotating slower than synchronously in\nits outer layers. I shall leave it to others to estimate the time the churning going on inside\nsuch an object would take to dissipate the angular momentum of the encased core. However,\nin this case, second-order effects of rotation cannot dominate the light or radial velocity of\nthe star. Instead it must be subject to a non-radial pulsation driven by the encased binary.\n\n\f–5–\nIn this regard it is no different than other non-synchronous binaries, such as the components\nof eccentric systems discussed by Wilson (1979).\nNow, in the remote possibility that binaries with an encased core can actually exist\nlong enough for us to observe them, just what might they look like? We can make some\nsimplifying assumptions that let us calculate light and velocity curves for such an object.\nAs a first stab, I have considered a system that is not rotating at all. This eliminates the\ncentrifugal potential and makes the gravitional potential simple:\nΩ = 1/r1 + q/r2 ,\n\n(1)\n\nwhere r1 and r2 are the distances of some point from the two components of the binary, the\norigin of coordinates is the binary's center of mass, and q=M2 /M1 is the mass ratio of the\nsystem. The surface corresponding to an equipotential of this equation is shaped roughly like\na prolate spheroid for equal masses (q=1.0) and a radius large enough. For other mass ratios,\nthe shape is more distorted and becomes rather biological at smaller radii. We can calculate\nthe light and velocity curves for such objects if we make an assumption about how surface\nbrightness changes over the star. I have made the simplifying assumption that the surface\nis always given by an equipotential, that this figure rotates with the binary system (i.e., has\nno phase lag), and that the surface brightness is determined by limb and gravity darkening\nas in a normal synchronously rotating binary. Actually, the surface brightness would be\ndetermined by the driven pulsation, so these assumptions are clearly bogus. However, they\ndo give us a way to estimate the effect of having an encased binary as a star's core, at least\nto first order.\nFor these assumptions we may calculate the pulsational velocities, assumed radial, by\ncomparing points equal distances apart in azimuth and dividing by the time it takes the\nbinary to rotate that amount. Since in the calculations, we divide the star's surface into a\nnumber of sectors of azimuth, each ∆λ wide in radians, the local pulsational velocity along\nthe star's radius is\ndλ dr\n2π a(rj+1 − rj−1 )\nVj =\n=\ni,\n(2)\ndt dλ\nP\n2∆λ\nwhere a and P are the semi-major axis and period of the encased binary, rj is the radius\nin units of a, and index j represents the steps in azimuth. The spheriodal pattern, rotating\nthrough the surface of the star, breaks the surface up into four sectors with alternating\npositive and negative pulsational velocities. These, in turn, project into our line of sight in\na way that gives the star a roughly sinusoidal velocity variation on half the period of the\nencased binary.\nGiven the foregoing assumptions, we may calculate the properties of the encased binary\nto first order. Figure 2 shows roughly what such a star with a mass ratio of 0.33 and a\n\n\f–6–\nradius of 1.3 times the semi-major axis might look like. Figure 3 shows some light curves\nfor this sort of object, as well as for the two limiting contact binaries. Figure 4 shows some\nvelocity curves. The important thing to note is that, for equal masses, the object gives a\nlight variation on half the orbital period of the encased binary. The radial-velocity variation\nis also on this period. For different mass ratios, the degeneracy in the light variation goes\naway, but the radial velocities still vary on half the orbital period in a peculiar way. If we\never were to find a star in the common-envelope stage, it would most likely have the light\nvariations of a contact binary (e.g., dotted and dot-dashed curves in Fig. 3) but with velocity\nvariations on half the photometric period.\n\n3.\n\nSPURIOUS ECCENTRICITIES FROM TIDAL DISTORTION\n\nThe contact components of Algol binaries really are like prolate spheriods (actually,\ntriaxial ellipsoids), but only to first order (e.g., Russell 1912). Instead, they have a complicated asymmetric figure if they actually follow the contours of their Roche lobes. These\nlobes are symmetric about a line between the two component stars, so the distortions would\nbe symmetric about conjunctions. However, they would be different for the two conjunctions in a way that distorts the velocity curve. We can predict this distortion with binary\nmodelling software and test it with precisely measured velocities of contact components of\nclose binaries (Wilson & Sofia 1976).\nThe new date we are using here are radial velocities from the Tennessee State University\n(TSU) Automatic Spectroscopic Telescope (AST; Eaton & Williamson 2007). These echelle\nspectra of roughly 30,000 resolution cover the wavelength range 6000–7100 Å. We reduced\nand analyzed them with standard pipeline techniques to derive the radial velocities for 5\nCet (HD 352) and AX Mon (HD45910) given electronically as Table 1. Velocities measured\nfor bright stars such as 5 Cet have an external precision of ∼0.11 km s−1 RMS (Eaton &\nWilliamson 2007). Listed in the table (see printed excerpt) are (1) HJD, the Heliocentric\nJulian Date of observation (minus 2,400,000), (2) RV , the radial velocity of the cool star,\nand (3) a tag identifying the star by its HD number.\n\n3.1.\n\nModelling the Velocity Distortions\n\nWe can calculate the effect of tidal distortion combined with limb and gravity darkening\non the velocities of Algol components if we make an assumption about how the measured\n\n\f–7–\nvelocity is related to surface brightness on the star. I shall make the simplifying assumption1\nthat a line profile is constant over the disc, and that the observed velocity is just the local\nvelocity weighted by intensity and averaged over the visible disc. For a sphere, the velocity\ncalculated in this scheme is just the velocity at disc center, so there are no deviations from\nthe velocity of the center of mass. For a distorted binary component, we can calculate the\ndeviation by averaging y*∆A*Iλ over the component, where y is the distance perpendicular\nto the rotation axis projected into the sky, ∆A is the projected area of a surface element in\nthe calculation, and Iλ is the intensity as determined by limb and gravity darkening. We\ncan get this information from computer programs for calculating light and velocity curves\nof binaries, such as Wilson's (1979), and I have coded it into my own program (e.g., Eaton\net al. 1993), which is easier for me to understand.\nFigure 5 shows the distribution of surface elements in a typical calculation for phase\n0.25 when the bigger, distorted star is approaching. The second component (generally hotter\nand smaller) is to the right (at y=1.0) in this coordinate system. At the phase illustrated,\nthe left side of the star (negative y's) contributes more light than the right side, in spite\nof there being more area to the right, because of limb and gravity darkening. Some results\nare given in Figure 6 where we see the effect of the distortion on a typical velocity curve at\nthe top and some calculated deviations in the lower panel. I have expressed these curves in\nterms of the total velocity amplitude of the system (K1 +K2 ), since the calculated quantity\nP\n( y*∆A*Iλ ) is the displacement of the centroid of light from the rotation axis in units of\nthe separation of the two stars. Three things are clear in Figures 6 and 5. First, the effect\non the velocity curve is subtle but systematic. Second, the magnitude of the effect would\ndepend upon mass ratio mostly through changes in the relative velocity amplitudes of the\ntwo stars, the less massive the undistorted companion, the smaller the effect on the distorted\nstar's velocity curve. Third, the effect is smaller at lower inclination because the roughly\nsymmetric gravity-brightened pole contributes more of the light.\nFigure 6 shows how the mass ratio affects distortion of the velocity curve. Figures 7 and\n8 show the effects of inclination and gravity darkening. Both are significant. By contrast, the\neffect of limb darkening is more moderate2 . The large dependence on inclination in Figure\n7 means we can use these velocity-curve distortions to estimate inclinations of non-eclipsing\nAlgol binaries. I have plotted these curves for binaries against photometric phase, for which\nthe zero point is superior conjunction of the distorted star, the phase of minimum light in\n1\n\nOne should keep in mind that there may be small, third-order systematic errors introduced by this\napproach (Winn et al. 2005).\n2\n\nIf we adopt linear limb darkening, as I have, a change of ∆xV =0.1 corresponds to ∆g∼−0.012 or ∆i∼0.8.\nThe effect on mass ratio would be rather large, however (see Fig. 6).\n\n\f–8–\nellipsoidal variation (e.g., Hall 1990).\n\n3.2.\n\nTests for Some Actual Stars\n\nHD 352 = 5 Cet (also, perversely, AP Psc) is a close semi-detached binary system with\na giant contact component (e.g., Eaton & Barden 1988). It is rather bright and singlelined. We have obtained 126 observations of it over a period of three years with the AST.\nThe velocity curve deviates from the sinusoidal shape expected for a spherical star in a\ncircular orbit by a noticeable amount (see Fig. 9). We can reduce the obvious systematic\nerrors of the fit by allowing an eccentricity, e=0.033±0.002 with ω=88.3±0.1. However,\nthere are still systematic deviations from the fitted curve. Figure 10 shows the deviations\nfrom a sinusoid. They are obviously of the same shape, and if we apply the right values\nfor the physical parameters of the system (see § 3.3), of roughly the right amplitude as the\ntheoretical calculations in Figure 6. You may note that the data scatter by roughly the\nexpected external error (0.1 km s−1 ) about this relation.\nThe spurious eccentricity we have found for 5 Cet has essentially the same magnitude\nand orbital orientation as Miller et al. (2007) claimed for TT Hya. Furthermore, the velocity\ncurves of the cool components of all Algol binaries should show spurious eccentricities of this\ntype (e∼0.02–0.04, ω ∼ 90◦ ). That they do not simply means that the measured velocities\nhave not been precise enough to detect this effect, as Lucy & Sweeney told us. However, we\nmay test this idea further with 177 radial velocities from the AST for AX Mon (HD 45910)\nfor which we have a preliminary solution. In that case both circular and elliptical orbits fit\nthe data to σ ≈ 0.9 km s−1 . The deviations from the circular orbit (Fig. 11) have roughly\nthe phase dependence of Figure 6 with an amplitude ∼4 km s−1 peak-to-peak.\nNow, we might ask, did Miller et al. really have data for TT Hya precise enough to\ndetect the spurious eccentricity predicted for rotational-tidal distortion? I have tried fitting\nthe velocities in their Table 2 and get comparable fits for circular and elliptical orbits (σ ≈\n6 km s−1 ). If we restrict ourselves to their more precise data, those for 1994–2001, we can\nrecover the elements listed in their Table 4 (col. 2) to within the probable errors. However,\nthis is only if we apply an unacknowledged 9.9 km s−1 zero-point \"correction\" to Peters' data.\nFor a circular orbit fitted to this \"corrected\" data set, the deviations have roughly the phase\ndependence of Figure 6 but with the 2 km s−1 scatter superimposed. The amplitude expected\n(for K1 +K2 =167 km s−1 , i∼83, q=4.38, x=0.77, and g=0.32 per Miller et al. [2007] and\nVan Hamme & Wilson [1993]) is ∼ 8.2 km s−1 peak-to-peak, a bit smaller than the noisy\nobserved value (∼11 km s−1 ).\n\n\f–9–\n3.3.\n\nSome Further Applications\n\nWe may use the calculations in § 3.1 to restrict some of the parameters of Algol systems,\ngiven precise data. The amplitude of the deviations of the velocity curve from a sinusoid\ndepends primarily on the orbital inclination, i, the velocity amplitude of the companion\nstar, K2 , and the amount of gravity darkening, g. It also depends on limb darkening, but\neffectively much less than on i or g, if we can assume the limb-darkening law is known\nas precisely as usually assumed in light-curve analyses Figure 6 shows that the deviations\ncentered on superior conjunction (phases 0.75–0.25) change much more with inclination than\nthose centered on inferior conjunction (phases 0.25–0.75). That dependence provides a way\nof restricting inclinations of the non-eclipsing systems, such as 5 Cet and AX Mon, if we\nknow g. In the eclipsing systems, on the other hand, we would get a moderately weak\nconstraint on the mass ratio through K2 , although in these systems q is usually very well\nconstrained by the light curve. Wilson (1979, § VI) would argue that these constraints are\nbuilt implicitly into his light-curve solutions. However, by stripping them out, we can isolate\nthem and look at just what they might tell us about various individual properties of a star\nand the physical processes that apply.\n5 Cet gives us a good example of applying these velocity-curve distortions. In this\nsystem (P=96.4 d, K1 =24 km s−1 , and q≤0.82, whence M1 sin3 i ≥ 1.50 M⊙ ) the inclination\nis probably fairly small to get reasonable masses. We previously estimated i∼60◦ (Eaton\n& Barden 1988). For these present best guesses, the distortions predicted are somewhat\nsmaller than observed (solid curve in Fig. 10). For AX Mon, we may get estimates of the\nproperties of the system from Elias et al. (1997), namely K1 +K2 =66–70 km s−1 , i=50–70◦ ,\nand q=4.0–3.0. For values characterizing this range (i=60◦ and q=3.0, whence K1 +K2 =69\nkm s−1 ), the calculated curve for g=0.32 is much too shallow to fit the observations. Even\nif we increase g to 0.5, the inclination is too small. Instead, the inclination is probably\nlarger, or the gravity darkening even larger than it seems for 5 Cet. Thus the velocity-curve\ndistortions constrain the properties of this non-eclipsing binary to the ends of the ranges\nexpected from photometry, namely to q≈3.0 and i≈75◦ .\nThe rather strong differences of the curves in Figure 8 gives us what is perhaps a unique\ntest of Lucy's (1967) theory of gravity darkening for convective stars. This brilliantly simple\ntheory predicts g=0.32 for convective stars; more detailed calculations by Claret (2000, 2003)\nfor a wide range of convective stars predict essentially the same level of gravity darkening\nor slightly less. A simple comparison of the observed velocity-curve distortions in Figures\n10–12 with the theoretical curves in Figure 8 shows the binary components must be gravity\ndarkened. On the other hand, the relative amplitudes of the effect for the two conjunctions in\nthe observations is much lower than for radiative gravity darkening (g=1.0). The amount of\n\n\f– 10 –\ngravity darkening is hard to measure because of the residual scatter in the data and because\ntwo of our three stars have indeterminate inclinations. However, in Figure 10 the shape of\nthe observed curve is much closer to the shape calculated for g=0.52 than for 0.32. In Figure\n11, as we have seen, a similar increase in g gives the observed amplitude without requiring\ni to be unacceptably large. In Figure 12, for a system in which the geometry is very highly\nconstrained, g=0.52 fits the amplitude much better than g=0.32 and g=1.0 does not fit it\nat all. So, the amount of gravity darkening seems to be around g=0.5, a little larger than\nLucy's g=0.32. It should be possible to constrain the gravity darkening of convective stars\nmuch better in future with precise radial velocities for more eclipsing stars.\nTidal distortion should give a variable vsini for a binary component because the disc is\nactually broader at some phases than at others. We saw this effect in UU Cnc (Eaton, Hall,\n& Honeycutt 1991). The new data for 5 Cet provide a further test, and I have applied it by\nlooking at composite spectra of 5 Cet at the two conjunctions and at the two quadratures.\nFirst, blends of Fe lines near 6575 Å and 6594 Å, which can give a very good measure of\nvsini without numerically measuring and calibrating line widths (Eaton 1990), are somewhat\nsharper at the conjunctions than at the two quadratures. Second, widths of Gaussians fit\nto cross-correlation functions (of a list of strong solar absorption lines with the observed\nspectrum – Eaton & Williamson 2007) for these four composite spectra are about 5% broader\nfor the quadratures than the conjunctions. See Table 2 for the details. We may simulate\nthis effect by calculating synthetic spectra and measuring the variation of line width with\nphase, and I have done so for a rough model for the system. This model assumes the visible\ngiant star is a contact component with x=0.70 and g=0.32, and that K1 =23.9 km s−1 and\nq=0.8. I used a spectrum of δ Eri (K0 IV) from the National Solar Observatory covering\nthe wavelength range 6400–6480 Å to represent the cool component in this calculation, but\nthe resolution is similar to that in the AST observations. The calculated line widths (col. 3\nof Table 2) have roughly the same phase dependence as shown by the observations but are\nabout 10% narrower. We can make them as large as the observed widths by reducing the\nmass ratio to about q=0.7, thereby raising K1 +K2 . In any case, a mass ratio greater than\n1.0 (unseen star more massive than the contact component) gives profiles much narrower\nthan observed.\n\n4.\n\nSUMMARY AND DISCUSSION\n\nThe existence of precise radial velocities for long-period binaries, made possible by\na dedicated instrument on a robotic telescope, has made it possible to demonstrate the\ndistortion of the radial-velocity curves of close binaries predicted by Sterne (1941). The\n\n\f– 11 –\ndistortions depend on a binary's inclination and mass ratio in ways that let us estimate these\nproperties in favorable circumstances. Given the nature of this velocity-curve distortion, we\nmust conclude that there is no credible evidence for orbital eccentricity in binaries with\ncontact components. Furthermore, the distortion observed in three systems requires the\nstars to be gravity darkened, probably somewhat more than expected from Lucy's (1967)\ntheory but much less than expected for stars with radiative envelopes.\nIn addition to the foregoing substantive results, I have also (1) detected the variation\nof vsini caused by tidal distortion in 5 Cet and used it to derive an improved mass ratio,\nMunseen /MgK ≈ 0.70, (2) estimated somewhat improved geometrical properties for AX Mon,\nand (3) explored what properties a binary encased in a common envelope would have if we\never were to detect one.\n\n4.1.\n\nA Caveat about Limb Darkening\n\nThe greatest uncertainty in the results of this paper, as well in many others of the\nsame genre, comes from the effect of limb darkening. This uncertainty would impact both\npapers analyzing light curves and those based on rotational line broadening or Doppler\nimages. Such analyses usually parameterize the emergent intensity as a function of the angle\nbetween the surface normal and the line of sight, more specifically on μ, its cosine. The\nsimpliest formulation, a linear dependence on μ, follows from the stratification of a simple\nhydrostatic atmosphere in radiative equilibrium. Other more complicated formulations are\npossible with increasingly less intuitive mapping into the atmospheric structure. Eventually,\nthese effectively seem to become mere fitting schemes (e.g., Brown et al. 2001). Alternatively,\none may apply a calculated intensity directly, perhaps by looking it up in a table of Iλ vs.\nμ.\nTheoretical model atmospheres predict levels of limb darkening that may be applied in\nanalyses of binary stars and other problems. Such analyses usually assume limb-darkening\ncoefficients from a few standard theoretical lists (e.g., Al-Naimy 1978; Claret & Gimanez\n1990). Normally, such models assume plane–parallel stratification in hydrostatic equilibrium,\nbasically the physics we apply to the Sun. A good example is the grid of atmospheres Kurucz\ncalculated with his program ATLAS (e.g., Kurucz 1995). A recent alternative set of models\nis NextGen (Hauschildt, Allard, & Baron 1999; Hauschildt et al. 1999). This latter grid\nought to give a superior interpretation of our standard physical assumption–for example,\nby calculating line blanketing in the blue–UV through opacity sampling. Limb darkening\nfrom NextGen, especially from the spherical models for giants and supergiants (Claret &\nHauschildt 2003), is quite different than from plane-parallel models. It tends to be much\n\n\f– 12 –\nmore pronounced, with the intensity dropping to zero well before the limb (see Orosz &\nHauschildt 2000, Fig. 4).\nIf real stars really have the limb darkening of these spherical NextGen models, there\nwould be systematic errors in a wide range of observational results for giants and supergiants.\nFor instance, it would make direct measurements of stellar diameters systematically small,\nleading to effective temperatures too high. This biases the Barnes-Evans relation (Barnes\n& Evans 1976) used extensively to derive angular diameters for cool stars and otherwise\ncalibrate the flux–temperature relationship. This effect might be tested by analyzing the\nconsistency of temperatures derived by fitting spectral energy distributions (e.g., Bertone\net al. 2004) with those derived from measured bolometric fluxes and angular diameters. It\nwould likewise bias rotational velocities from line broadening and a wide range of properties\nof binaries derived from such broadening such as mass ratios of non-eclipsing systems, as\ndiscussed by Orosz & Hauschildt (2000) and Shahbaz (2003). It would also bias the results\nfor eclipsing systems by making it harder to fit the eclipse shapes and ellipsoidal variation\nsimultaneously. Furthermore, it might well bias the Doppler images of spoted stars, if the\neffects are as extreme as calculations of Claret & Hauschildt (2003, see Fig. 2) imply. In our\npresent analysis, the effect of the nontraditional limb darkening of NextGen models would\nlikely be to increase the amplitude of the velocity variation somewhat, allowing for a lower\ngravity darkening. We can see this effect by making the linear limb-darkening coefficient\nx>1.0 and truncating the intensity at zero when it becomes negative near the limb. Such a\ncalculation does increase the deviation from a sinusoidal velocity curve.\nNow then, how much do we have to worry about the existing body of lore for stellar\nastronomy? Perhaps not as much as one would fear. There are few highly precise determinations of limb darkening for cool stars other than the Sun, and that is especially true\nfor giants and supergiants. However, one reliable determination for a K giant (Fields et al.\n2003) finds limb darkening much less extreme than predicted by NextGen models. Predictions of ATLAS were somewhat closer, but did not fit as well as one might hope. Fields et al.\nsuspected unmodelled physical effects are to blame for this discrepancy, inasmuch as there\nare obvious effects in atmospheres beyond our current understanding. None of these models,\nfor instance, incorporate the inhomogeneities that we expect in all stellar atmospheres on\nthe basis of solar granulation and Ayres's (e.g., 2002) work on CO. Furthermore, all these\ncalculations necessarily use very simplistic models for turbulence, whatever that really is,\nand for convection. At this point, it seems the theoretical limb darkening of NextGen models\nis not tested well enough for us to worry seriously about its effect on binary-star analyses,\nbut that we as a community should take it seriously enough to look for more tests, especially\nfor the supergiants.\n\n\f– 13 –\nI would like to thank Peter Wood for stimulating me to think about this problem,\nfor giving me a key reference to work on the long-period variations of AGB stars, and for\nclarifying some details of his work on rotating spheriods. This research used the SIMBAD\ndatabase and was supported by NASA grants NCCW-0085 and NCC5-511 and by NSF\ngrants HRD 9550561 and HRD 9706268.\nFacilities: TSU:AST\n\nREFERENCES\nAl-Naimy, H. M. 1978. Ap&SS, 53, 181\nAyres, T. R. 2002, ApJ, 572, 1104\nBarnes, T. G., & Evans, D. S. 1976, MNRAS, 174, 489\nBertone, E., Buzzoni, A., Chávez, M., & Rodriguez-Merino, L. H. 2004, ApJ, 128, 829\nBrown, T. M., Charbonneau, D., Gilliland, R. L., Noyes, R. W., & Burrows, A. 2001, ApJ,\n552, 699\nClaret, A. 2000, A&A, 359, 289\nClaret, A. 2003, A&A, 406, 623\nClaret, A., & Gimanez, A. 1990, A&A, 230, 412\nClaret, A., & Hauschildt, P. H. 2003, A&A, 412, 241\nDerekas, A., Kiss, L. L., Bedding, T. R., Kjeldsen, H., Lah, P., & Szabo, Gy. M. 2006, ApJ,\n650, L55\nEaton, J. A. 1990, IAU Inf. Bull. Var. Stars, no. 3460\nEaton, J. A., & Barden, S. C. 1988, Acta Astron., 38, 353\nEaton, J. A., & Williamson, M. H. 2007, PASP, 119, 886\nEaton, J. A., Hall, D. S., & Honeycutt, R. K. 1991, ApJ, 376, 289\nEaton, J. A., Henry, G. W., Bell, C., & Okorogu, A. 1993, AJ, 106, 1181\nElias, N. M., Wilson, R. E., Olson, E. C., Aufdenberg, J. P., Guinan, E. F., Guedel, M., van\nHamme, W. V., Stevens, H. L. 1997, ApJ, 484, 394\n\n\f– 14 –\nFields, D. L. et 23 al. 2003, ApJ, 596, 1305\nHall, D. S. 1990, AJ, 100, 554\nHauschildt, P. H., Allard, F., & Baron, E. 1999, ApJ, 512, 377\nHauschildt, P. H., Allard, F., Ferguson, J., Baron, E., & Alexander, D. R. 1999, ApJ, 525,\n871\nHinkle, K. H., Lebzelter, T., Joyce, R. R., & Feckel, F. C. 2002, ApJ, 123, 1002\nKopal, Z. 1959, Close Binary Systems (London: Chapman & Hall)\nKurucz, R. L. 1995, Kurucz CD-ROM 13, ATLAS9 Stellar Atmosphere Programs and 2\nkm/s Grid (Cambridge: SAO)\nLucy, L. B. 1967, ZAp, 65, 89\nLucy, L. B., & Sweeney, M. A. 1971, AJ, 76, 544\nLucy, L. B., & Sweeney, M. A. 1973, Obs., 93, 37\nMiller, B., Budaj, J., Richards, M., Koubsk, P., Peters, G. J. 2007, ApJ, 656, 1075\nOlivier, E. A., & Wood, P. R. 2003, ApJ, 584, 1035\nOrosz, J. A., & Hauschildt, P. H. 2000, A&A, 364, 265\nRussell, H. N. 1912, ApJ, 36, 54\nShahbaz, T. 2003, MNRAS, 339, 1031\nSterne, T.C. 1941, Proc. Nat. Acad. Sci., 27, 168\nVan Hamme, W., & Wilson, R. E. 1993, MNRAS, 262, 220\nWilson, R. E. 1979, ApJ, 234, 1054\nWilson, R. E., & Sofia, S. 1976, ApJ, 203, 182\nWinn, J. N., et 12 al. 2005, ApJ, 631, 1215\nWood, P. R., Olivier, E. A., & Kawaler, S. D. 2004, ApJ, 604, 800\n\nThis preprint was prepared with the AAS LATEX macros v5.2.\n\n\f– 15 –\n\nTable 1. Spectroscopic Data\nHJD\n(2,400,000+)\n52897.9971\n52900.9680\n52923.9281\n52959.6797\n52970.7973\n52971.7946\n\nRV\n(km s−1 )\n-8.25\n-3.95\n22.48\n-14.17\n-23.54\n-23.58\n\nStar\n\nHD\nHD\nHD\nHD\nHD\nHD\n\n352\n352\n352\n352\n352\n352\n\nNote. - This excerpt shows the\nform and content of the full table as\npublished in the electronic edition of\nthe Astrophysical Journal.\n\nTable 2. Some Measured Line Widths for 5 Cet\nOrbital\nPhase\n\nσmeas\n(km s−1 )\n\nσcalc\n(km s−1 )\n\nQuadrature (approaching):\nQuadrature (receeding):\nSuperior Conjunction (star behind):\nInferior Conjunction (star in front):\n\n21.73\n21.71\n20.33\n20.03\n\n19.72\n19.87\n18.98\n18.51\n\nNote. - The σs are the width parameter from a Gaussian\nfit to the line profile. The first value given for each phase comes\nfrom profiles in composite spectra of 5 Cet; the second value,\nfrom theoretically calculated profiles.\n\n\f– 16 –\n\nFig. 1.- Velocity curves of a prolate spheroid with a 2:1 aspect ratio. The three curves\nshow the effects of limb darkening alone (solid), of gravity darkening alone (dashed), and\nthe combination of limb and gravity darkening (dotted). All assume i=90◦ .\n\n\f– 17 –\n\nFig. 2.- The distribution of surface elements in a representative calculation for an encased binary system at phase 0.25 where the two components would have their maximum\nseparation.\n\n\f– 18 –\n\nFig. 3.- Light curves for an encased binary and two limiting contact binaries. The curves\nare as follows: solid, non-rotating encased binary with rmax = 1.3a and the expected limb and\ngravity darkening; dashed, encased binary without any limb or gravity darkening; dotted,\ncontact binary with both stars just overfilling their Roche lobes (first Lagrangian surface);\ndot-dashed, contact binary filling its outer contact (second Lagrangian) surface. All these\ncalculations assume i=90◦ .\n\n\f– 19 –\n\nFig. 4.- Velocity curves calculated for two encased binaries with R = 1.3a.\n\n\f– 20 –\n\nFig. 5.- The distribution of surface elements in a typical calculation for a semi-detached\nsystem at phase 0.25 when the bigger, distorted star is approaching. The two stars obviously\nhave equal masses in this calculation.\n\n\f– 21 –\n\nFig. 6.- Effect of the distortion on a typical velocity curve (at top) and some calculated\ndeviations in the lower panel. The top panel shows a calculation for i = 85◦ and q = M2 /M1\n= 1.0, where Star 2 is the unseen companion to the visible Star 1. The dots are calculated\nvelocities for the tidally distorted contact component, and the solid curve is the sinusoidal\nvelocity of that star's center of mass. In the bottom panel, the five curves give calculations\nfor a range of mass ratio with i = 85◦ . The smaller qs give roughly the same amplitude,\nwhile the larger qs typical of classical Algol binaries (q = 2.0 and 4.0) give noticeably smaller\namplitudes.\n\n\f– 22 –\n\nFig. 7.- Effect of orbital inclination on the distortion of the velocity curve. Inclination\nranges from 50◦ (dotted curve) to 85◦ (solid curve). Note how different this dependence on\ninclination is for the two conjunctions.\n\n\f– 23 –\n\nFig. 8.- Effect of gravity darkening on the distortion of the velocity curve. Curves are as\nfollows: dotted for g=0.0 (no gravity darkening), dot-dashed for g=0.32 (Lucy's theoretical\nvalue), dashed for g=0.52, and solid for g=1.0 (radiative–von Zeipel–gravity darkening).\n\n\f– 24 –\n\nFig. 9.- Fit of a circular orbit to measured velocities for 5 Cet. The RMS deviation for\nthis fit is σ = 0.69 km s−1 ; the systematic deviation is obvious. Compare this graph to the\nupper panel of Figure 6.\n\n\f– 25 –\n\nFig. 10.- Deviation of measured radial velocities of 5 Cet from a sine curve. Compare the\nshape of this curve to the lower panel in Figure 6. Dots are the measured deviations, the\ndifferences between the observations and fitted curve in Figure 9. Curves give theoretically\ncalculated deviations for two values of the gravity exponent, solid for g=0.32, dashed for\ng=0.52. Both calculations assume the mass ratio, 0.7, derived from line broadening.\n\n\f– 26 –\n\nFig. 11.- Deviation of measured radial velocities of AX Mon from a sine curve. Compare\nthe shape of this curve to Figure 6. As in Figure 10, dots are the differences between\nobserved velocities and a fitted sine curve. The curves give theoretically expected variations\nfor g=0.32 with i=60◦ (solid), g=0.52 with i=60◦ (dashed), g=0.52 with i=75◦ (dot-dashed).\nAll assume q=3.0 and x=0.77.\n\n\f– 27 –\n\nFig. 12.- Deviation of measured radial velocities of TT Hya (the selected data from Miller\net al. [2007] identified in § 3.2) from a sine curve. As in Figure 10, dots are the differences\nbetween observed velocities and a fitted sine curve. The curves give theoretically expected\nvariations for g=0.32 (solid), g=0.52 (dashed), and g=1.0 (dot-dashed).\n\n\f"}