{"id": "http://arxiv.org/abs/1010.4285v1", "guidislink": true, "updated": "2010-10-20T19:21:52Z", "updated_parsed": [2010, 10, 20, 19, 21, 52, 2, 293, 0], "published": "2010-10-20T19:21:52Z", "published_parsed": [2010, 10, 20, 19, 21, 52, 2, 293, 0], "title": "Viscosity Solutions for the two-phase Stefan Problem", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1010.1673%2C1010.1975%2C1010.3776%2C1010.3316%2C1010.5188%2C1010.3118%2C1010.4391%2C1010.2277%2C1010.1119%2C1010.0383%2C1010.2342%2C1010.4277%2C1010.4710%2C1010.5822%2C1010.3392%2C1010.3957%2C1010.4613%2C1010.2657%2C1010.0334%2C1010.0712%2C1010.2073%2C1010.5645%2C1010.0608%2C1010.2954%2C1010.0777%2C1010.4853%2C1010.3138%2C1010.0130%2C1010.4395%2C1010.6203%2C1010.2117%2C1010.5805%2C1010.4285%2C1010.2393%2C1010.5100%2C1010.5110%2C1010.4136%2C1010.2088%2C1010.2487%2C1010.2950%2C1010.4519%2C1010.3107%2C1010.4680%2C1010.6265%2C1010.3161%2C1010.1883%2C1010.3684%2C1010.3355%2C1010.2600%2C1010.1180%2C1010.5375%2C1010.1359%2C1010.0163%2C1010.2677%2C1010.3870%2C1010.1222%2C1010.3786%2C1010.0361%2C1010.5688%2C1010.1810%2C1010.2595%2C1010.5599%2C1010.5877%2C1010.2455%2C1010.1504%2C1010.1898%2C1010.3723%2C1010.0272%2C1010.5022%2C1010.4772%2C1010.4359%2C1010.0155%2C1010.0539%2C1010.0947%2C1010.0612%2C1010.4905%2C1010.2836%2C1010.3551%2C1010.6164%2C1010.1510%2C1010.4642%2C1010.2622%2C1010.2185%2C1010.5733%2C1010.3221%2C1010.5680%2C1010.3389%2C1010.0952%2C1010.0491%2C1010.1942%2C1010.0861%2C1010.3313%2C1010.1759%2C1010.4253%2C1010.2619%2C1010.3335%2C1010.3157%2C1010.3083%2C1010.4768%2C1010.6259%2C1010.0867&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Viscosity Solutions for the two-phase Stefan Problem"}, "summary": "We introduce a notion of viscosity solutions for the two-phase Stefan\nproblem, which incorporates possible existence of a mushy region generated by\nthe initial data. We show that a comparison principle holds between viscosity\nsolutions, and investigate the coincidence of the viscosity solutions and the\nweak solutions defined via integration by parts. In particular, in the absence\nof initial mushy region, viscosity solution is the unique weak solution with\nthe same boundary data.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1010.1673%2C1010.1975%2C1010.3776%2C1010.3316%2C1010.5188%2C1010.3118%2C1010.4391%2C1010.2277%2C1010.1119%2C1010.0383%2C1010.2342%2C1010.4277%2C1010.4710%2C1010.5822%2C1010.3392%2C1010.3957%2C1010.4613%2C1010.2657%2C1010.0334%2C1010.0712%2C1010.2073%2C1010.5645%2C1010.0608%2C1010.2954%2C1010.0777%2C1010.4853%2C1010.3138%2C1010.0130%2C1010.4395%2C1010.6203%2C1010.2117%2C1010.5805%2C1010.4285%2C1010.2393%2C1010.5100%2C1010.5110%2C1010.4136%2C1010.2088%2C1010.2487%2C1010.2950%2C1010.4519%2C1010.3107%2C1010.4680%2C1010.6265%2C1010.3161%2C1010.1883%2C1010.3684%2C1010.3355%2C1010.2600%2C1010.1180%2C1010.5375%2C1010.1359%2C1010.0163%2C1010.2677%2C1010.3870%2C1010.1222%2C1010.3786%2C1010.0361%2C1010.5688%2C1010.1810%2C1010.2595%2C1010.5599%2C1010.5877%2C1010.2455%2C1010.1504%2C1010.1898%2C1010.3723%2C1010.0272%2C1010.5022%2C1010.4772%2C1010.4359%2C1010.0155%2C1010.0539%2C1010.0947%2C1010.0612%2C1010.4905%2C1010.2836%2C1010.3551%2C1010.6164%2C1010.1510%2C1010.4642%2C1010.2622%2C1010.2185%2C1010.5733%2C1010.3221%2C1010.5680%2C1010.3389%2C1010.0952%2C1010.0491%2C1010.1942%2C1010.0861%2C1010.3313%2C1010.1759%2C1010.4253%2C1010.2619%2C1010.3335%2C1010.3157%2C1010.3083%2C1010.4768%2C1010.6259%2C1010.0867&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We introduce a notion of viscosity solutions for the two-phase Stefan\nproblem, which incorporates possible existence of a mushy region generated by\nthe initial data. We show that a comparison principle holds between viscosity\nsolutions, and investigate the coincidence of the viscosity solutions and the\nweak solutions defined via integration by parts. In particular, in the absence\nof initial mushy region, viscosity solution is the unique weak solution with\nthe same boundary data."}, "authors": ["Inwon C. Kim", "Norbert Pozar"], "author_detail": {"name": "Norbert Pozar"}, "author": "Norbert Pozar", "arxiv_comment": "28 pages", "links": [{"href": "http://arxiv.org/abs/1010.4285v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1010.4285v1", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "math.AP", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "math.AP", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "35R35 80A22 35B51 35D40", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1010.4285v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1010.4285v1", "journal_reference": null, "doi": null, "fulltext": "arXiv:1010.4285v1 [math.AP] 20 Oct 2010\n\nViscosity Solutions for the two-phase Stefan Problem\nInwon C. Kim∗ and Norbert Požár†\nDepartment of Mathematics, UCLA\nLos Angeles, CA 90095-1555\nNovember 7, 2018\n\nAbstract\nWe introduce a notion of viscosity solutions for the two-phase Stefan problem, which\nincorporates possible existence of a mushy region generated by the initial data. We\nshow that a comparison principle holds between viscosity solutions, and investigate the\ncoincidence of the viscosity solutions and the weak solutions defined via integration by\nparts. In particular, in the absence of initial mushy region, viscosity solution is the\nunique weak solution with the same boundary data. 1\n\n1\n\nIntroduction\n\nThe classical two-phase Stefan problem models the evolution of temperature in a material\nwith two distinct phases (solid and liquid). The solid-liquid phase transition occurs at a\ngiven constant temperature, which we set at zero. The problem is described by an enthalpy\nfunction h, which represents the internal energy density in each phases (see Meirmanov\n[19] and Oleinik et al. [20]). More precisely, let Ω ⊂ Rn be a bounded domain in Rn\n∗\n\nEmail: ikim@math.ucla.edu\nEmail: npozar@math.ucla.edu\n1\nThis is a preprint of an article whose final and definitive form has been published in Communications\nin Partial Differential Equations, 2010. Copyright Taylor & Francis. Communications in Partial Differential\nEquations is available online at: http://www.informaworld.com/LPDE\n†\n\n1\n\n\fwith a C 2 boundary. Then h(x, t) : Ω × [0, T ) → R solves the following problem:\n\n\nht = ∆χ(h)\nin Ω × (0, T ),\n\n\n\n\n\n\nh(x, 0) = h0 (x) in Ω,\n\n\n\n\n\n\n\nχ(h) = θ,\non ∂Ω × (0, T ).\n\n(ST)\n\nIn this paper we will set θ(x, t) as a continuous function on ∂Ω × [0, T ] and h0 as a bounded\nmeasurable function with χ(h0 ) continuous on Ω, such that χ(h0 ) = θ(*, 0) on ∂Ω. Here\nu(x, t) := χ(h)(x, t) describes the evolving temperature, where χ is defined by\n\nh > 0,\n\nh,\n(1.1)\nχ(h) = 0,\n−1 ≤ h ≤ 0,\n\n\nh + 1, h < −1.\nNote that h is determined by u almost everywhere if Γ(u) := {u = 0} = {−1 ≤ h ≤ 0}\nis of measure zero, but not in general. The interior of zero temperature set Γ(u), if exits,\nis called a mushy region. It is well known that mushy region might appear in a Stefan\nproblem with heat sources, see Bertsch et al. [4]. When there is no heat source, the\nmushy region can only be generated from the initial data. Indeed if |{−1 ≤ h0 ≤ 0}| = 0\n(here |*| denotes the Lebesgue measure in Rn ), it is shown in [21] (see also [16] and [1] ) that\n|{−1 ≤ h(*, t) ≤ 0}| = 0 for all t > 0 and (ST) can be written in terms of the temperature:\n\nut − ∆u = 0\nin {u > 0} ∪ {u < 0},\n\n\n\n\n\n\n\n\non Γ(u) = ∂{u > 0} = ∂{u < 0},\n Vn = |Du+ | − |Du− |\n(STu)\n\n\nu(x,\n0)\n=\nu\n(x)\n:=\nχ(h\n(x))\n\n0\n0\n\n\n\n\n\n\nu=θ\non ∂Ω × (0, T )\n\nHere u+ and u− denotes respectively the limit taken from {u > 0} and {u < 0}, and Vn is\nthe outward normal velocity of the free boundary with respect to {u > 0}.\n\nOn the other hand, if |{−1 ≤ h0 ≤ 0}| > 0 with no heat source then the mushy region is\nnon-increasing as the solution evolves (see [21]): in this case the zero temperature set Γ(u)\nmay exhibit instability such as infinite speed of propagation as its interior diminishes (see\n[5] where the interface evolution is investigated in the case of one-phase Hele-Shaw flow\nwith initial mushy region).\nFor both (ST) and (STu), even solutions with initially smooth configuration may develop\nsingularities in finite time, due to merging and splitting of the liquid-solid regions. Thus it\nis necessary to introduce a generalized notion of global-in-time solutions.\n2\n\n\fThe first global notion of solutions for (ST) has been derived by a weak formulation via\nintegration by parts: see Ladyženskaja et. al. [18] or Friedman [15]. This approach\nallows the presence of initial mushy region. It was shown there that a unique weak solution\nexists for bounded measurable h0 and θ. Moreover the temperature u(x, t) turns out to\nbe continuous when h0 and θ are sufficiently smooth – see Caffarelli & Evans [8] and\nDiBenedetto [13].\nMore recently, the notion of viscosity solutions, first introduced by Crandall & Lions\n[12], has been proved useful in the qualitative study of free boundary problems, due to\nits flexibility with nonlinear PDEs and free boundary conditions: see e.g., [2]–[3] and [7]\nwhich address a general class of free boundary problems including (STu), and also see [14]\nwhere the heat operator is replaced by a class of uniformly parabolic operators. However, in\nthe two-phase case, the equivalence between viscosity solutions and weak solutions, and in\nparticular the uniqueness of the viscosity solutions of (ST), has not yet been investigated,\neven in the case of (STu). (The only notable instance is [9] where the authors show a\ncomparison principle between viscosity subsolutions and more regular supersolutions, socalled \"R-supersolutions\". Even thought their result could be used to simplify the proof of\nLemma 3.8, it is restricted to the heat operator, whereas our method is more robust and\nextends to a wider class of problems, see Remark 1.2.) In this paper we address precisely\nthis point. We introduce a notion of viscosity solutions for (ST), to derive the following\ntheorem:\nTheorem 1.1. (a) There exists a viscosity solution of (ST) in Q. Furthermore, a comparison principle holds between viscosity solutions and thus maximal and minimal\nviscosity solutions exist. They respectively correspond to weak solutions of (ST) with\nmaximal and minimal initial enthalpy for given temperature u0 .\n(b) Any weak solution of (ST) in the sense of [8] is also a viscosity solution.\n(c) If |{−1 ≤ h0 ≤ 0}| = 0, then there is a unique viscosity solution of (STu) which\ncoincides with the weak solution of (ST), and also coincides with the notion of viscosity\nsolutions discussed in [12] and [2].\nPreviously, one of the authors investigated in [17] viscosity solutions theory for the onephase version of (STu) (also see [10] and [6] for the case of degenerate diffusion). While\none-phase Stefan problem is a special case of the two-phase Stefan problem, this work does\nnot immediately apply to the two-phase version: we will point out the differences as we\nproceed in the proof. For example, the free boundary evolution for the two-phase setting is\nno longer monotone (that is, the positive set of u may shrink or expand over time), which\nrequires a more careful construction of test functions. Moreover, since we are allowing the\ninitial data to have mushy region, Γ(u) may have positive measure with infinite speed of\npropagation, and thus must be treated differently. Indeed, to the best of our knowledge,\n3\n\n\fTheorem 1.1 is among the first results which addresses uniqueness of viscosity solutions for\na two-phase free boundary problem.\nBelow we give an outline of the paper:\nIn sections 2 and 3 we introduce a definition of viscosity solutions for (ST), and prove that\nviscosity solutions satisfy a comparison principle for strictly separated initial data. Note\nthat this does not immediately yield uniqueness except under some geometric conditions on\nthe initial data (see Corollary 3.9), however it generates a maximal and minimal viscosity\nsolutions (see Proposition 4.4). These maximal and minimal solutions indeed correspond\nto the weak solutions with maximal and minimal initial enthalpy.\nIn section 4, we show that weak solutions are viscosity solutions. Using this result, existence\nof viscosity solutions is established. Furthermore, using the uniqueness of the weak solutions\nand barrier arguments near the parabolic boundary of Q (see Lemma 4.5), we establish the\nuniqueness of viscosity solutions when |{u0 = 0}| = 0 and θ < 0.\nRemark 1.2. The proof of the comparison principle (Theorem 3.1) relies only on the\ncomparison principle available for the parabolic operator ut − ∆u and monotonicity of the\nboundary condition. It therefore applies to the generalized version of (STu) described in\n[2], where the second equation in (STu) is replaced by a general free boundary velocity of\nthe type\nV = G(x, |Du+ |, |Du− |, η),\nwhere η is the spatial (outward) unit normal vector of Γ(u), G(x, a, b, η) is continuous and\n∂G ∂G\n,−\n≥ c > 0.\n∂a\n∂b\nAnd in fact, a general uniformly parabolic operator\nut − F (t, x, u, Du, D 2 u)\ndiscussed in [11] can be considered in {u 6= 0}. That is, we require that F is an uniformly\nelliptic operator such that\nλ kN k ≤ F (t, x, v, p, M + N ) − F (t, x, v, p, M ) ≤ Λ kN k\nwhere t ∈ [0, T ], x ∈ Ω, v ∈ R, p ∈ Rn , M, N ∈ S(n), N ≥ 0, and 0 < λ ≤ Λ. The\nuse of Hopf 's lemma at the end of the proof of Theorem 3.1 can be omitted if we consider\nthe inf-convolution W in (3.1) on shrinking balls as in [17], which only requires a more\ndemanding notation.\nAs for existence, a slight modification of Perron's method presented in [17] combined with\nTheorem 3.1 yields the existence of a viscosity solution for the generalized version. This\napproach is not taken here since we are also interested in the coincidence of weak and\nviscosity solutions.\n4\n\n\f2\n\nThe Stefan problem\n\nLet ∂L Q = ∂Ω × [0, T ] be the lateral boundary of Q and ∂P Q = (Ω × {0}) ∪ ∂L Q be the\nparabolic boundary of Q.\nWe shall use two notions of generalized solutions for (ST): weak solutions and viscosity\nsolutions.\nDefinition 2.1. A bounded measurable function h is called the weak solution of (ST) with\ninitial data h0 ∈ L∞ (Ω) and boundary data θ ∈ L∞ (∂L Q) if it satisfies (see [19])\nZ\nZ\nZ\n∂φ\nθ\n(hφt + χ(h)∆φ) dx dt −\nh0 (x)φ(x, 0) dx = 0\n(2.1)\nds dt +\n∂L Q ∂ν\nQ\nΩ\nfor all φ ∈ W22,1 (Q) vanishing on ∂L Q and at t = T .\nDue to [15, 18, 19], there exists a unique weak solution h of problem (ST), defined in Definition 2.1, with initial data h0 and boundary data θ. Furthermore a comparison principle\nholds between weak solutions ([19]): see the proof of Lemma 4.1 for more precise statement.\nAs mentioned in the introduction, the temperature u(x, t) is related to the enthalpy h\nthrough u = χ(h). Formal computations yield that (ST) provides the free boundary velocity\nVn = |Du+ | − |Du− |\n\non ∂{u > 0} ∩ ∂{u < 0};\n\nVn ≥ |Du+ |\n\non ∂{u > 0} \\ ∂{u < 0};\n\nṼn ≤ −|Du− |\n\non ∂{u < 0} \\ ∂{u > 0},\n\n(V)\n\nwhere Ṽn is the outward normal velocity of the free boundary of {u ≥ 0}. The inequalities\nare due to the (possible) presence of the mushy region and the non-constant distribution of\nh(x, t). Definitions 2.4 and 2.5 incorporate (V).\nDefinition 2.2. Set D ⊂ Rn+1 is a parabolic neighborhood of a point (x0 , t0 ) if there is\nan open set U , (x0 , t0 ) ∈ U , such that D = U ∩ {t ≤ t0 } and D ∈ C 0,1 , i.e. the boundary of\nD is locally a graph of a Lipschitz function in x and t.\nDefinition 2.3. A continuous function φ is a classical subsolution (in a parabolic neighborhood D) of (ST) if\n2,1\n(a) φ is Cx,t\nin D ∩ {φ > 0} and in D ∩ {φ < 0},\n\n(b) Γ(φ) = ∂{φ > 0} = ∂{φ < 0},\n\n5\n\n\f(c) |Dφ+ | and |Dφ− | are nonzero on D ∩ Γ(φ) (this makes Γ(φ) smooth),\n(d) φt − ∆φ ≤ 0 in D ∩ {φ 6= 0},\n(e) the outward normal velocity Vn of D ∩ Γ(φ) with respect to {φ > 0} is less than or\nequal to |Dφ+ | − |Dφ− |.\nSimilarly one can define a classical supersolution in a parabolic neighborhood.\nDefinition 2.4. (a) A lower semi-continuous function v is a viscosity supersolution of\n(ST) in Q if (i) v(x, 0) ≥ χ(h0 ), (ii) v ≥ θ on ∂L Q, and if (iii) for any classical subsolution φ(x, t) in a parabolic neighborhood D ⊂ Q such that φ ≤ v on the parabolic\nboundary of D, φ ≤ v in D.\n(b) An upper semi-continuous function u is a viscosity subsolution of (ST) in Q if (i)\nu(x, 0) ≤ χ(h0 ), (ii) u ≤ θ on ∂L Q, and if (iii) for any classical supersolution φ(x, t)\nin a parabolic neighborhood D ⊂ Q such that φ ≥ u on the parabolic boundary of D,\nφ ≥ u in D.\nObserve that if u is a viscosity subsolution of (ST), then −u is a supersolution of (ST).\nDefinition 2.5. A continuous function u is a viscosity solution of (ST) if it is both viscosity\nsubsolution and supersolution.\nRemark 2.6. Note that above definition of viscosity solutions, unlike that of weak solutions, does not take into account the enthalpy function h(x, t). In particular, we cannot\nexpect uniqueness when the initial data u0 satisfies |{u0 = 0}| > 0. A modified definition,\nincorporating the presence of h(x, t) and therefore yielding a unique representation of the\ninterface evolution, is under investigation by the authors.\n\n3\n\nComparison for strictly separated initial data\n\nA central property for the viscosity solution theory is the comparison principle, which\nis stated in the theorem below. We mention that a corresponding result holds for weak\nsolutions of (ST) (see [15]). As mentioned in the introduction (see Remark 1.2), the proof\npresented in this section extends to a general class two-phase free boundary problems with\nnonlinear free boundary velocity.\nTheorem 3.1. Let u and v be respectively a viscosity subsolution and supersolution on Q\nsuch that u < v on ∂P Q. Then u < v in Q.\n6\n\n\fFirst we introduce several notations. Let Br (x, t) denote the closed space-time ball with\nradius r and center at (x, t),\nBr (x, t) = {(y, s) : |(y, s) − (x, t)| ≤ r},\nand Dr (x, t) the closed space disk with radius r and center at (x, t),\nDr (x, t) = {(y, t) : |y − x| ≤ r}.\nWe also speak of the sets\n∂Dr (x, t) = {(y, t) : |y − x| = r} and Dro (x, t) = {(y, t) : |y − x| < r}\nas the boundary and the interior of Dr (x, t), respectively.\nFor any r > 0, define the sup- and inf-convolutions (see [17])\nZ(x, t) = sup U (y, s),\n\nU (x, t) = sup u(y, s),\n\nBr (x,t)\n\nDr (x,t)\n\nW (x, t) = inf V (y, s),\n\nV (x, t) = inf v(y, s).\n\nBr (x,t)\n\n(3.1)\n\nDr (x,t)\n\nFor any ρ > 0, define\nΩρ = {x ∈ Ω : dist(x, ∂Ω) > ρ},\nThe convolutions (3.1) are well defined in Cr ,\nCr = Ω2r × (r, T − r).\nMoreover, we fix r > 0 small enough so that Z < W on ∂P Cr . Note that Z, U , resp. W , V\nare also viscosity subsolutions, resp. viscosity supersolutions of (ST) in Cr .\nIt will be convenient to define Φr (x, t) to be the closed set\n[\nDr (y, t).\nΦr (x, t) =\n\n(3.2)\n\n(y,s)∈Br (x,t)\n\nLastly, we need the following definition:\nDefinition 3.2. Let E be a closed set, let P be a point on the boundary of E, P ∈ ∂E, and\nlet B be a closed ball containing P . The ball B will be called an interior ball of E at P if\nB ⊂ E, and it will be called an exterior ball of E at P if B o ∩ E = ∅.\nObserve that, by definition, the sets {Z ≥ 0} and {W ≤ 0} have interior balls of radius r\nat each point of their boundaries. These balls are centered on the boundaries of {U ≥ 0}\n7\n\n\fand {V ≤ 0}, respectively. This property of Z and W will be essential in the proofs in this\nsection.\nTo prove that u and v stay ordered, we will argue by contradiction: if u ≥ v at some time\nt̃0 , it must be true for Z and W even earlier. Suppose that there is a time t0 when the\nfunctions Z and W first hit,\nt0 = sup {t ≥ r : Z(*, s) < W (*, s) for all r < s < t}.\nDenote P0 = (x0 , t0 ) the point of maximum of Z − W at t = t0 . Note that Z(x0 , t0 ) ≥\nW (x0 , t0 ) because Z − W is upper semi-continuous.\nNote that the positive set of Z (and the negative set of W ) may expand discontinuously in\ntime, in the event that the zero set of Z (and W ) is of positive measure: this is because\nour definition only considers test functions which are nondegenerate in both positive and\nnegative phases. Therefore one should put extra care in describing the location of P0 and\nthe geometry of the free boundaries nearby.\nLemma 3.3. The set {u ≥ 0} cannot expand discontinuously, i.e.\n{u ≥ 0, t = T } ⊂ {u ≥ 0, t < T }\n\n∀T > 0.\n\nAnalogous results hold for {v ≤ 0}, {Z ≥ 0}, {U ≥ 0}, {W ≤ 0} and {V ≤ 0}.\nProof. Suppose that for some T > 0 there is a point P ∈ {u ≥ 0, t = T } such that P ∈\n/\n{u ≥ 0, t < T }. In other words, there exists δ > 0 such that Bδ (P ) ∩ {u ≥ 0, t < T } = ∅.\nFor simplicity we will translate the coordinates so that P = (0, 0). Define M = maxQ u.\nNote that the ball Bδ (P ) contains a cylinder\n\u001a\n\u0012\n\u0013\n\u001b\nη\nη h\nC = (x, t) : |x| ≤ h + η, − min\n,\n≤t≤0\n2\n2M n\nwith h and η small positive constants. The situation is shown in Figure 1. We will construct\na classical supersolution of (ST) in C that crosses u from above to obtain a contradiction.\n\u0010\n\u0011\nn\n,\nDefine ω = 2 max 2M\nη h . Consider a radially symmetric function in C defined by the\nformula\n\n2\n2\n\na(|x| − (h − ωt) ) for |x| ≤ h − ωt,\nφ(x, t) =\n\n 2M\nfor |x| > h − ωt,\nη (|x| − h + ωt)\nwhere a > 0 is a small constant specified below.\n\n8\n\n\ft\nx\nu30\n\nP\nt=T\n\nC\n\nu<0\n\nGHΦL\n\nB∆\n\nFigure 1: Situation at point P\nThen φ satisfies\n\n(∂t − ∆) φ =\n\n\n\u0010\n2M\n\n\n η ω−\n\nn−1\n|x|\n\n\u0011\n\n>0\n\n\n\n2a ((h − ωt)ω − n) > 0\n\nfor |x| > h − ωt,\nfor |x| < h − ωt.\n\nNext, note that the free boundary Γ(φ) at time t is the sphere with radius h − ωt, shrinking\nwith normal velocity ω. Therefore we have\nVn = ω >\n\n2M\n− Dφ− = Dφ+ − Dφ− .\nη\n\nHence φ is a classical supersolution of (ST) for any a > 0.\nLastly, note that the initial boundary D = C ∩ {t = −η/ω} of the cylinder C is a closed\nsubset of {u < 0} and therefore maxD u < 0. We can hence take a > 0 small enough to\nmake φ > u on D.\nThus we have constructed a classical supersolution φ on C such that φ > u on the parabolic\nboundary of C, while φ < 0 ≤ u at P = (0, 0). That shows that u crosses φ from below\ninside C, which contradicts the definition of u.\nThe conclusion for {v ≤ 0} = {−v ≥ 0} can be obtained by repeating the proof for −v.\nCorresponding arguments apply to the sets {Z ≥ 0}, {U ≥ 0}, {W ≤ 0} and {V ≤ 0} as\nwell.\nLemma 3.4. The point P0 lies on the intersection of boundaries of {Z ≥ 0} and {W ≤ 0},\nP0 ∈ ∂{Z ≥ 0} ∩ ∂{W ≤ 0},\nand\nW (P0 ) ≤ 0 ≤ Z(P0 ).\n9\n\n\fB1\nB2\nP2\nP1\nU 30\n\nP0\n\nV £0\n\ne1\n\nt\nW £0\n\nZ 30\nx\n\nB0\nFigure 2: Situation at P0\n\nProof. We know that W (P0 ) ≤ Z(P0 ) from the definition of P0 . There are three cases:\n(a) 0 < W (P0 ) ≤ Z(P0 ): in this case W > 0 in some neighborhood of P0 ({W > 0} is\nopen as W is a lower-semicontinuous function) and W is a supercaloric function in\nthis neighborhood; this contradicts the fact that Z cannot be crossed from above by\nany positive caloric function φ (see [11]).\n(b) W (P0 ) ≤ Z(P0 ) < 0 : the same as above for Z subcaloric in a neighborhood of P0 .\nTherefore we arrive at\nW (P0 ) ≤ 0 ≤ Z(P0 ).\n\n(3.3)\n\nInequality (3.3) immediately yields that P0 ∈ {Z ≥ 0} ∩ {W ≤ 0}. Now suppose that P0\nlies in the interior of the set {Z ≥ 0}. That implies P0 ∈\n/ {W ≤ 0, t < t0 } since Z < W\nfor t < t0 . But that is a contradiction with continuous expansion of {W ≤ 0}, Lemma 3.3.\nThe same happens when P0 lies in the interior of {W ≤ 0}. Hence the conclusion of the\nlemma.\nThe lemma states that the situation at point P0 looks like the one shown in Figure 2. More\nprecisely, there exist P1 = (x1 , t1 ) ∈ ∂{U ≥ 0} and P2 = (x2 , t2 ) ∈ ∂{V ≤ 0} such that\nU (P1 ) = Z(P0 ) and V (P2 ) = W (P0 ). At P0 , B1 = Br (x1 , t1 ) = Br (P1 ) is an interior ball of\n{Z ≥ 0} and B2 = Br (x2 , t2 ) = Br (P2 ) is an interior ball of {W ≤ 0}. Moreover, the ball\nB0 = Br (x0 , t0 ) = Br (P0 ) is an exterior ball of {U ≥ 0} at P1 and {V ≤ 0} at P2 .\nSince Z < W for t < t0 , the space projections of B1 and B2 are tangent:\nB1 ∩ B2 ∩ {t = t0 } = {P0 }.\n10\n\n\fP1 '\n\nH0,0L\n\nE\n\n¶Fr\n\nG HΦL\nFigure 3: Local situation at P1′\nTherefore the space projections of P0 , P1 and P2 are on a line and we can change the\ncoordinates so that\nP0 = (0, 0),\n\nP1 = (d1 e1 , t1 − t0 ) and P2 = (−d2 e1 , t2 − t0 ).\n\n(3.4)\n\nLemma 3.5. Suppose that Z(P0 ) = 0. Then (x1 , t1 ) 6= (x0 , t0 + r). In other words, the line\n(P0 , P1 ) cannot be vertical (i.e., be parallel to the time-direction) and in the future of P0 .\nProof. Suppose that (P1 , P0 ) is vertical, i.e. x1 = x0 , and t1 = t0 + r. Thus there is\nP1′ = (x′1 , t1 ) ∈ Dr (P1 ) such that u(P1′ ) = 0. Lemma 3.4 implies that P0 lies on the\nboundary of {Z ≥ 0}. Therefore u < 0 in the interior of Φr (P0 ), defined in (3.2). This and\nLemma 3.3 yield that u < 0 in the interior of Dr (P1 ) and P1′ lies on the boundary of Dr (P1 ),\ni.e. |x1 − x′1 | = r. We will construct a classical supersolution in a parabolic neighborhood\nof P1′ that crosses u to get a contradiction.\n√\nFirst, let ω = r/3 and h = 1 + ω and consider the set\nE := {(x, t) : −1 ≤ t ≤ 0, 1 − ω − ωt ≤ |x| ≤ 1 + 2ω − ωt}.\n(see Figure 3).\nWe only show the construction for n ≥ 3. The computation is similar when n = 2. Thus\nconsider a radially symmetric function φ(x, t) on E of the form\n(\na(−|x|2−n + (h − ωt)2−n ) when |x| ≥ h − ωt,\nφ(x, t) =\nb(−|x|2−n + (h − ωt)2−n ) when |x| < h − ωt,\nwhere a =\n\nω\nn−1\n2n−4 h\n\nand b > 0 is a small constant to be chosen later.\n\nφ then satisfies\n(∂t − ∆) φ = ∂t φ = c(n − 2)ω(h − ωt)1−n > 0\n\n11\n\nif |x| =\n6 h − ωt,\n\n\fwhere c = a or b. The free boundary of φ is the shrinking sphere Γ(φ) = {|x| = h − ωt}\nand therefore the free boundary condition reads as\nVn = ω > a(n − 2)(h − ωt)1−n − Dφ− = Dφ+ − Dφ− .\nHence φ is a classical supersolution on E. Now define\nδ=\n\nmin\n\n|x|=1+2ω−ωt\n−1≤t≤0\n\nφ > 0.\n\nand choose ε, 0 < ε < r, such that u < δ on B4ε (P1′ ). This can be done since u(P1′ ) = 0\nand u is upper semi-continuous. Let E ε and φε be rescaled E and φ under the parabolic\nscaling (x, t) = (εx̂ + εx1 /r + (1 − ε/r)x′1 , ε2 t̂ + t1 ). Note that E ε ⊂ B4ε (P1′ ) and φε is still\na supersolution in E ε .\nFinally, observe that the distance of the lateral boundary of Φr (P0 ) from the time axis\n{x̂ = 0} in the rescaled coordinates can be expressed as\np\np\n|x̂| = −2r t̂ − ε2 t̂2 + 1 ≥ −r t̂ + 1\nif − 1 ≤ t̂ ≤ 0.\n\b\nThus clearly u < 0 on |x̂| ≤ 1 + 2ω, t̂ = −1 and so we can choose b > 0 small enough so\nthat φε (x, t) > u(x, t) on the part of parabolic boundary of E ε where φε ≤ 0. This can be\ndone as this is a closed subset of {u < 0} and u is upper semi-continuous.\nWith above choices of b and ε, φε is a classical supersolution of (ST) such that φε > u on\nthe parabolic boundary of E ε and φε (P1′ ) < 0 = u(P1′ ). Therefore u − φε has a maximum\ninside E ε , which yields a contradiction with u being a viscosity subsolution.\nThe proof can be repeated with −W in place of Z and other appropriate substitutions.\nWith the previous results, it is now possible to establish the following lemma:\nLemma 3.6.\nZ(P0 ) = W (P0 ) = 0.\nProof. It is enough to prove Z(P0 ) = 0 because W (P0 ) = 0 then follows by repeating the\nproof for −W .\nDue to Lemma 3.4, Z(P0 ) ≥ 0. Suppose Z(P0 ) = L > 0. As in the proof of Lemma 3.5,\nthere is a point P1′ ∈ Dr (P1 ) such that u(P1′ ) = L. First we discuss a couple of extreme\ncases:\n(a) If (P1 , P0 ) is vertical with P1 in the past of P0 , arguing as in the proof of Corollary\n3.7 we see that (P2 , P0 ) must be vertical with P2 in the future. So either W (P0 ) = 0,\nbut that cannot happen by Lemma 3.5, or W (P0 ) < 0. For W (P0 ) < 0, one could\nargue as in (b) with −W in the place of Z (and other appropriate substitutions).\n12\n\n\fP1 '\n\nQΤ\n\nΩt\n+\nh+\n\nS\n\nh+\n\nΩt\n-\n\n∆\n\nΗ\n\nQ\n\nhΤ\n\n¶Fr\n\nFigure 4: Construction of a supersolution when Z(P0 ) > 0.\n(b) If (P1 , P0 ) is vertical with P1 in the future, the fact that P0 ∈ ∂{Z ≥ 0} implies u < 0\nin the interior of Φr (P0 ), therefore u < 0 in the interior of Dr (P1 ) by Lemma 3.3 and\nP1′ must be on the boundary of Dr (P1 ). The rest of the argument is parallel to the\none shown below.\nNow suppose that (P0 , P1 ) is not vertical and t1 ≤ t0 . This allows us to find a small\nτ > 0 and points Q = (x̃, t1 ) and Qτ = (x̃, t1 − τ ) such that Dh (Q) ∩ {u ≥ 0} = {P1 } and\nDhτ (Qτ ) ∩ {u ≥ 0} = ∅, where h = |P1 − Q|, 0 < h − hτ << 1 (see Figure 4). For simplicity\nwe translate coordinates so that Q = (0, 0).\nDenote M = maxQ u. We will now construct a positive classical supersolution φ of (ST) in\nS = {(x, t) : −τ < t < 0, h + ωt − δ ≤ |x| ≤ h + ωt + η},\nwhere η > 0 and δ > 0 small are to be chosen and\nω=\n\nh − hτ + η\n,\nτ\n\nso that φ will cross u at P1 , yielding a contradiction.\nConsider a spatially radially symmetric function\nφ(x, t) = f (|x| − ωt),\nwhere\nK=2\n\n\u0012\n\nf (s) = −\n\n2c\n(−Ks + a)3/2 + b,\n3K\n\nh − hτ /2 2n − 2\n+\nτ\nhτ\n\n\u0013\n\n>0\n\nand the constants a, b ∈ R and c > 0 are to be chosen below.\nObserve that g(s) = (f ′ (s)/c)2 = −Ks + a. Choose 0 < η < 12 hτ small enough and a ∈ R\nso that 12 < g(s) < 1 for all h − η ≤ s ≤ h + η. It is also clear that we can find c > 0 and\n13\n\n\fb ∈ R such that 0 < f (h) < L and f (h + η) > M . f is continuous and so there is also δ,\n0 < δ < η such that f (h − δ) > 0.\nIn particular, with this choice of η, δ, a, b and c, f (s) is positive and strictly increasing in\n[h − δ, h + η]. It follows that φ satisfies\n\u0014\u0012\n\u0013\n\u0015\nn−1\n′\n′′\n(∂t − ∆)φ(x, t) = − ω +\nf (|x| − ωt) + f (|x| − ωt)\n|x|\n\u0014\u0012\n\u0013\n\u0015\n1\nn−1\n′ 2\n′′ ′\n=− ′ ω+\n(f ) + f f\nf\n|x|\n\u0014\u0012\n\u0013\n\u0015\nn−1\n1\nc2\ng + g′\n=− ′ ω+\nf\n|x|\n2\n≥0\n\nsince ω +\n\nn−1\n|x|\n\n≤\n\nK\n2\n\nin S. Therefore φ is positive and strictly supercaloric in S.\n\nTo conclude, we note that φ > u on the parabolic boundary of S. This is clear from the fact\nthat φ > 0 in S and φ > M on those parts of the parabolic boundary of S that intersect\n{u ≥ 0}. But (u − φ)(P1 ) > 0 and therefore u crosses φ from below inside S. That is a\ncontradiction with u being a viscosity subsolution of (ST).\nIf t1 > t0 , including the case when (P1 , P0 ) is vertical, the construction of a supersolution\nis more straightforward but we can also use the above construction with hτ = h.\nCorollary 3.7. The vectors P0 − P1 and P0 − P2 cannot be vertical (i.e., be parallel to the\ntime-direction). In other words, the space projections of P1 and P2 cannot be equal to the\nspace projection of P0 .\nProof. Observe that if say t1 < t0 and the line (P1 , P0 ) is vertical, then also (P2 , P0 ) must be\nvertical and t2 > t0 . This follows from the strict ordering Z(*, t) < W (*, t) for all t < t0 and\nB1 being an interior ball of {Z ≥ 0} and B2 being an interior ball of {W ≤ 0}, i.e. Z ≥ 0\nin B1 and W ≤ 0 in B2 which implies B1 ∩ B2 ∩ {t < t0 } = ∅. That is, B1 ∩ B2 = {P0 }\nwhenever one of the balls is contained in {t ≤ t0 }. But Lemma 3.5 asserts that (P2 , P0 )\ncannot be vertical with P2 in the future of P0 . Similarly when (P2 , P0 ) is vertical with\nt2 < t0 .\nDue to Corollary 3.7, the interior ball B1 of {Z ≥ 0} has an interior normal (e1 , m) at\nP0 ∈ ∂B1 with |m| < ∞. Note that m denotes the (outward) normal velocity of the spacetime ball B1 at P0 . Therefore, formally speaking, m is smaller than the normal velocity Vn\nof {Z ≥ 0} at P0 . Since Z is a subsolution of (ST) and since P0 ∈ ∂{Z ≥ 0} = ∂{Z < 0} ,\nfrom the discussion in section 2 (see (V)) formally it must be true that\nm ≤ |DZ + | − |DZ − |.\n14\n\n\fNext lemma states that this is indeed true in a weak sense.\nLemma 3.8.\nlim inf\nλ→0+\n\nZ(P0 − μe1 , 0)\nZ(P0 + λe1 , 0)\n+ lim inf\n≥ m.\nμ→0+\nλ\nμ\n\nProof. Let us define\na := lim inf\nλ→0+\n\nZ(P0 + λe1 , 0)\nλ\n\nand b := lim inf\nμ→0+\n\nZ(P0 − μe1 , 0)\n.\nμ\n\nObserve that b < 0. Indeed by Corollary 3.7, we can find a smaller closed ball B ⊂ B2 such\nthat B ∩ ∂B2 = P0 and h > 0 such that B ∩ {t = t0 − h} =\n6 ∅. Since Z < W for t < t0 ,\nthere is a smooth function g ≥ 0 that solves the heat equation inside B ∩ {t0 − h ≤ t ≤ t0 }\nsuch that Z + g < W on B ∩ {t = t0 − h}, g > 0 in B o ∩ {t = t0 − h} and g = 0 on\n∂B ∩ {t0 − h ≤ t ≤ t0 }. As Z is subcaloric and W is supercaloric in B ∩ {t0 − h ≤ t ≤ t0 }\nit follows that Z + g ≤ W on B ∩ {t = t0 } and\n0 ≥ lim inf\nμ→0+\n\nW (P0 − μe1 , 0)\n≥ b + |Dg (P0 )| > b.\nμ\n\nSuppose a + b < m. Since b < 0, ε > 0 can be chosen sufficiently small so that\na + b < m − 6ε\n\nand b + 3ε < 0.\n\nWe will construct a supersolution of (ST) constructed in a parabolic neighborhood K of\nP1 , which will be specified later, which crosses U from above, to yield a contradiction. We\npoint out that, due to the two-phase nature of the problem, the construction of such barrier\nand the domain K requires modifications from the one-phase version constructed in [10]\nand [17].\nFrom the definitions of a and b, there are sequences λk → 0, μk → 0 with λk > 0 and μk > 0\nsuch that\nZ(x0 + λk e1 , t0 ) ≤ (a + ε)λk ,\n\nZ(x0 − μk e1 , t0 ) ≤ (b + ε)μk .\n\n∞\nIn what follows, λ ∈ {λk }∞\nk=1 and μ ∈ {μk }k=1 . Now denote Q = P0 + (λe1 , 0), R =\nP0 + (−μe1 , 0) and BQ , resp. BR the balls centered at Q, resp. R, with radius r. The\nsituation is illustrated in Figure 5.\n\nFrom the definition of Z, it follows that U (x, t) ≤ Z(y, s) for any (y, s) ∈ Br (x, t) and thus\n\n\nZ(Q) ≤ (a + ε)λ in BQ ,\nU ≤ Z(P0 ) = 0\nin B0 ,\n\n\nZ(R) ≤ (b + ε)μ in BR .\n15\n\n\fI\n\nS\n\nS C\n\nT\nP1\n\nP0\nBQ\n\nB0\n\nBR\n\nFigure 5: The slice {t = t1 }\nIn fact, U ≤ 0 on a slightly larger set. Because Z ≤ W at t = t0 and W ≤ V (P2 ) = 0 in B2 ,\nwe can conclude that Z ≤ 0 on D = B2 ∩ {t = t0 }. It means that U ≤ 0 on Σ, the union of\nballs of radius r with a center in D,\n[\nΣ=\nBr (x, t).\n(x,t)∈D\n\nFinally, we have an improved bound,\n\n\n(a + ε)λ\nU≤ 0\n\n\n(b + ε)μ\n\nin BQ ,\nin Σ,\nin BR .\n\n(3.5)\n\nNow we will compare U with a supersolution in a domain K := Kτλ,μ . Fix τ > 0 small and\ndefine\n[\nKτλ,μ = {t1 − τ ≤ t ≤ t1 } ∩\n(∂BQ \\ int Σ − γ(e1 , 0)) ∪ B0 \\ int BR .\n0≤γ≤λ\n\nIn dimension n = 2, the shape of this set is depicted in Figure 6 and the shape of its slice\n{t = t1 } is depicted as the thick curve in Figure 5. The boundary of the slice is given by the\narc S = ∂BQ \\ Σ, the arc T = ∂BR ∩ B0 , and finally of the curve (surface) C that connects\nS and T . C at any given time is composed of C1 = ∂L ∩ Σ \\ BR , where L is a cylinder with\naxis e1 connecting I = ∂BQ ∩ ∂Σ with ∂B0 , and C2 = ∂B0 \\ (BR ∪ L).\nLet φ(x, t) = φ(ρ, t), where ρ = |x − x0 |. We need U ≤ φ on the parabolic boundary of\nKτλ,μ . By Taylor expansion in λ and (t − t1 ), it follows that the spatial distance of the point\nof intersection I from x0 can be found explicitly for each time t as\nRI (t) = d1 + λ − m(t − t1 ) + o (λ) + o (t − t1 ) ≤ d1 + λ − m(t − t1 ),\n16\n\n\fC\n\nS\n\nT\n\nt\n\nx\nFigure 6: Domain K for n = 2\nwith d1 from (3.4). Moreover, RT (t) ≤ |x − x0 | ≤ RS (t) in K, where\nRS (t) = d1 + λ − m(t − t1 ) + o(t − t1 ) and RT (t) = d1 − μ − m(t − t1 ) + o(t − t1 ).\nLastly, the radius of the space-ball B0 ∩ {t = t} is given by\nR1 (t) = d1 − m(t − t1 ) + o(t − t1 ).\nNow we are ready for the construction of the supersolution. Take α = a + 3ε, β = b + 3ε,\n(x − x0 , t − t0 ) from\nR̃ = d1 = R1 (t1 ) and m̃ = α + β < m. Let φ(x, t) be the function φα,β\nR̃,m̃\nAppendix. Let τ > 0, δ > 0 be the small constants and Στ,δ be the set from Appendix\nwhere φ exists and is a radially symmetric classical supersolution that is \"ε-close\" (in the\nsense of (4.5)) to linear functions with slopes α and β on each side of the spherical free\nboundary of φ moving with speed m̃ and with radius R̃ at t = t1 .\nLet R̃(t) = R̃ − m̃(t − t1 ) be the radius of the free boundary of φ. We claim that for\nsufficiently small λ, μ and τ we have U ≤ φ on the parabolic boundary of Kτλ,μ .\nTo prove the claim, first note that for sufficiently small λ, μ > 0\no\nn\nKτλ,μ ⊂ Στ,δ = (x, t) : R̃(t) − δ ≤ |x − x0 | ≤ R̃(t) + δ, t1 − τ ≤ t ≤ t1 .\nWe will compare φ with U on two parts of the parabolic boundary.\nPart 1: On lateral boundary ∂L (Kτλ,μ ∩ {t1 − τ ≤ t ≤ t1 }):\n\n17\n\n\fFrom (3.5) we need\n\n\n(a + ε)λ\nφ(ρ, t) ≥ 0\n\n\n(b + ε)μ\n\nfor RI (t) ≤ ρ ≤ RS (t),\nfor R1 (t) ≤ ρ ≤ RI (t),\nfor RT (t) ≤ ρ ≤ R1 (t).\n\n(3.6)\n\nThe second condition is satisfied as long as R̃(t) ≤ R1 (t) and that is true for all t ∈ [t1 −τ, t1 ]\nif τ is small enough. Third condition is trivial for R̃(t) ≤ ρ ≤ R1 (t). For RT (t) ≤ ρ ≤ R̃(t)\nwe use the fact that\n\u0010\n\u0011\nφ(ρ, t) ≥ (β − ε) R̃(t) − ρ\n\u0010\n\u0011\n≥ (β − ε) R̃(t) − RT (t)\n≥ (β − ε)μ > (b + ε)μ.\n\nLastly the first condition in (3.6) holds since\n\u0010\n\u0011\n\u0010\n\u0011\nφ(ρ, t) ≥ (α − ε) ρ − R̃(t) ≥ (α − ε) RI (t) − R̃(t)\n\n≥ (α − ε)(d1 − m(t − t1 ) + λ − η − d1 + m̃(t − t1 ))\n\n= (α − ε) ((m̃ − m)(t − t1 ) + λ − η)\n\n≥ (α − ε)(λ − η) > (a + ε)λ\n\nif τ and λ are small compared to ε since η = o(λ) + o(t − t1 ).\nPart 2: On Kτλ,μ ∩ {t = t1 − τ }:\nFrom the bounds on U in (3.5) we need\n(\n(a + ε)λ for R1 (t1 − τ ) ≤ ρ ≤ RS (t1 − τ ),\nφ(ρ, t) ≥\n0\nfor RT (t1 − τ ) ≤ ρ ≤ R1 (t1 − τ ).\nThe second inequality can be satisfied by taking τ and μ small so that R̃(t1 −τ ) ≤ RT (t1 −τ ).\nThe first inequality is then satisfied by taking λ small.\nWe demonstrated that U ≤ φ on the parabolic boundary of Kτλ,μ and U ≥ φ at P1 if λ,\nμ and τ > 0 are small enough. Since φ is in fact a strict classical supersolution due to\nAppendix, we can perturb φ into φ̃ near P1 such that φ̃ is still a classical supersolution with\nU ≤ φ̃ on the parabolic boundary of Kτλ,μ and U > φ̃ at P1 . This is a contradiction with\nthe definition of U .\n\n18\n\n\fWe recall that Z ≤ W at t = t0 . Therefore Lemma 3.8 as well as considering g in the\nbeginning of its proof yields\nlim sup\nλ→0+\n\nW (P0 + λe1 , 0)\nW (P0 − μe1 , 0)\n+ lim sup\nλ\nμ\nμ→0+\n≥ lim inf\nλ→0+\n\n(3.7)\n\nZ(P0 + λe1 , 0)\nZ(P0 − μe1 , 0)\n+ lim inf\n+ |Dg(P0 )|\nμ→0+\nλ\nμ\n\n> m.\nRecall that strict ordering Z < W for t < t0 implies that B2 has an exterior normal (e1 , m̂)\nwith m̂ ≤ m. With this result in mind, we can repeat the argument in Lemma 3.8 to get a\ncontradiction by proving that the quantity (3.7) must be less than or equal to m.\nThis establishes the desired contradiction and we conclude that Z and W stay strictly\nseparated for all times.\nNote that Theorem 3.1 yields ordering only between strictly separated initial data. Therefore it does not directly yield the uniqueness result for viscosity solutions, even with the\nadditional assumption |{u0 = 0}| = 0. However under some restrictions on initial data,\nuniqueness readily follows from Theorem 3.1.\nCorollary 3.9. Let u(x, t) be a viscosity solution of (ST) with initial data u0 and boundary\ndata θ(x, t) = θ(x) < 0, where u0 and θ satisfies one of the following conditions:\n(a) u0 is strictly concave;\n(b) θ(x, t) ≡ θ < 0 and both Ω and u0 is star-shaped: i.e. for sufficiently small ε > 0,\n(1 + ε)−1 Ω ⊂ Ω and u0 (x) ≤ u0 ((1 + ε)−1 x), where equality only holds at x = 0.\nThen u(x, t) is unique.\nProof. 1. Let us begin by mentioning that for any a, b and c > 0, if u is a viscosity sub\n(super)-solution of (ST), then so is\nau(bx, ab2 t + c).\n2. Now let u and v be two viscosity solutions of (ST) with initial data u0 . In the case of\n(a), one can verify via barrier arguments that v(x, t) ≤ u0 (x) if 0 ≤ s < t with equality\nholding only at ∂L Q. In particular, for sufficiently small ε and δ such that 0 < ε ≪ δ ≪ 1,\nwe have (1 + ε)v(x, δ) < u0 (x) (recall that θ is negative). Therefore observation made in\nstep 1 and Theorem 3.1 yields\n(1 + ε)v(x, (1 + ε)t + δ) < u(x, t)\n19\n\nin Q\n\n\ffor any 0 < ε ≪ δ ≪ 1. Now we can send δ → 0 and ε → 0 to obtain v ≤ u. Similarly we\ncan argue with v and u switched to obtain u ≤ v, and therefore u = v.\nIn the second case, note that for any ε > 0 and δ > 0,\n(1 + δ)−1 u0 (x) < u0 ((1 + ε)−1 x) in Ω.\nAlso, since u0 is star-shaped, the minimum of u0 (and u and v) equals θ. Since u and v are\nnegative caloric functions near ∂Ω, Hopf's lemma yields that the inward normal derivative\nof u(*, t) and v(*, t) on ∂Ω is strictly positive. In particular for any T > 0 there exists\nδ = O(ε) such that\n(1 + δ)−1 θ < u((1 + ε)−1 x, t) for (x, t) ∈ ∂L Q.\nHence Theorem 3.1 again yields that, for sufficiently small ε > 0,\n(1 + δ)−1 v(x, (1 + δ)−1 t) < u((1 + ε)−1 x, (1 + ε)−2 t)\n\nin Q.\n\nTherefore, by sending ε → 0, we can conclude that v ≤ u. As before, by switching v and u\nin above argument one can conclude v = u.\n\nFor a general uniqueness result using the comparison principle we refer to section 4 in [17]\nwhere rather technical barrier arguments take place. We have not attempted to follow\nthis approach since, as mentioned before, we are interested in the coincidence of the two\ngeneralized solutions for (ST).\n\n4\n\nCorrespondence between weak and viscosity solutions\n\nRecall that, due to [15,18,19], there exists a unique weak solution h of problem (ST), defined\nin Definition 2.1, with initial data h0 and boundary data θ. Let us define u = χ(h) to be\nthe weak temperature solution of (ST) associated with initial enthalpy function h0 , see [15].\nLemma 4.1. Any weak temperature solution u of (ST) with initial data u0 = χ(h0 ) is a\nviscosity solution of (ST).\nProof. The analysis in [8] yields that weak temperature solutions are continuous for continuous χ(h0 ). Moreover, a comparison principle holds for weak solutions. Indeed, if h1 and\nh2 are two weak solutions with h1 ≤ h2 on ∂P Q, then h1 ≤ h2 in Q. See [19], for instance.\nThe comparison principle can be extended to accommodate weak sub and supersolutions.\nA function h1 is a weak subsolution if it satisfies (2.1) in Definition 2.1 with ≥ instead of\n20\n\n\fequality for all φ ∈ W22,1 (Q), φ ≥ 0, φ = 0 on ∂L Q ∪ {t = T }. A function h2 is a weak\nsupersolution if it satisfies (2.1) with ≤ instead of equality for all φ as above. A comparison\nprinciple still holds. If h1 ≤ h2 on the parabolic boundary ∂P Q then h1 ≤ h2 in Q. It is\nstraightforward to check that the comparison principle on a cylindrical domain implies a\ncomparison principle on a general parabolic neighborhood in the sense of Definition 2.2.\nA standard integration by parts also shows that a classical subsolution φ in Definition 2.3\ncorresponds to a weak subsolution χ−1 (φ), and also that a classical supersolution φ is a\nweak supersolution χ−1 (φ): note that, by definition, φ and φ have no mushy region and\nthus χ−1 φ and χ−1 φ are well defined almost everywhere. We deduce from this that we\ncan compare weak temperature solutions with classical sub and supersolutions. Hence we\nconclude that weak temperature solutions are viscosity solutions of (ST) in the sense of\nDefinition 2.5.\nCorollary 4.2. There exists a viscosity solution of (ST) for continuous χ(h0 ) and θ.\nUnfortunately it is not clear to the authors how to find a corresponding weak solution for\na given viscosity solution when the initial data has a fat zero set. However it is possible\nto identify the maximal and minimal viscosity solution with maximal and minimal weak\ntemperature solutions (see Proposition 4.4). To prove this we first need a uniform control\non the expansion of the sets {u ≤ 0} and {u ≥ 0} at t = 0 in terms of the L∞ -norm of the\ninitial data.\nLemma 4.3. Let u be a viscosity solution of (ST) with initial data u0 . Then for any\nr > 0 the set {u ≤ 0} does not expand by more than r before the time tr = cr 2 , where\nc = c(n, M ) is a constant specified later in the proof, depending only on the dimension n\nand M = max∂P Q |u0 |. In other words,\n{x : u(x, t) ≤ 0} ⊂ {x : dist(x, {u0 ≤ 0}) ≤ r}\nfor all t ∈ [0, tr ].\nThe same is true for {u ≥ 0}.\nProof. We only prove the lemma for {u ≤ 0}. Parallel argument holds for {u ≥ 0}.\nSet\nAr = {x : dist(x, {u0 ≤ 0}) > r}.\nWe need to show that u(x, t) > 0 in Ar × [0, tr ], for tr specified below.\nThus choose x0 ∈ Ar . Define the function\n(\nf (ρ) =\n\n1\nρn−2\n\n− 1,\n\n− log ρ,\n21\n\nn ≥ 3,\n\nn = 2.\n\n\fNote that f is decreasing and f (1) = 0. For simplicity we show the following computation\nfor n ≥ 3 only. The case n = 2 is similar.\nSet K =\n\nM\n|f (2)|\n\nand v =\n\n8K(n−2)\n.\nr\n\nWe will construct a classical subsolution of (ST) in the set\n\nC = {(x, t) : |x − x0 | < r − vt, 0 ≤ t ≤ tr }\nthat is below u on the parabolic boundary of C and is positive at x0 for 0 ≤ t ≤ tr .\nDefine the radially symmetric function φ = φ(x, t) in C as\n\u0010\n\u0011\n(\n0|\nKf 2|x−x\n, 2|x − x0 | > r − vt,\nr−vt\nφ(x, t) =\nφ̃(x, t),\n2|x − x0 | < r − vt,\nwhere φ̃(x, t) is a solution of the heat equation in the domain\n\u001a\n\u001b\n1\nC 1 = (x, t) : |x − x0 | < (r − vt) , t ∈ (0, tr )\n2\n2\nwith smooth positive initial data φ̃(x, 0) < u(x, 0) in the interior of D = {x : |x − x0 | < r/2}\nand boundary data 0.\nThe modulus of the gradient |Dφ− | on the free boundary Γ(φ) is\nDφ− = K f ′ (1)\nFor t < tr =\n\nr\n2v\n\n= c(n, M )r 2 ,\nDφ− <\n\n2K(n − 2)\n2\n=\n.\nr − vt\nr − vt\n\nv\n4K(n − 2)\n= = −Vn .\nr\n2\n\nTherefore φ is a classical subsolution of (ST) in the set C. Also, φ < u on the parabolic\nboundary ∂P C. The definition of viscosity subsolution then implies φ ≤ u in the set C and\ntherefore u > 0 at x0 for 0 ≤ t ≤ tr .\nProposition 4.4. There exist maximal and minimal viscosity solutions U1 (x, t) and U2 (x, t)\nof (ST) satisfying the following:\nU2 ≤ u ≤ U1\n\nfor any viscosity solution u of (ST).\n\nFurthermore, U1 is the unique weak temperature solution of (ST) with the initial enthalpy\n\u001a\nu0\nif u0 ≥ 0,\nmax\nh0 :=\nu0 − 1 if u0 < 0,\nand U2 is the unique weak temperature solution of (ST) with the initial enthalpy\n\u001a\nu0\nif u0 > 0,\nmin\nh0 :=\nu0 − 1 if u0 ≤ 0.\n22\n\n\fProof. 1. Take an approximation w0ε < u0 < v0ε such that the zero set of the approximation\nhas zero measure. This can be done, for example, with simply w0ε = u0 − ε and v0ε = v0 + ε\nfor along a sequence of ε → 0. Indeed the function F (ε) := |{u0 > 0}| − |{u0 > ε}| is\na monotone, bounded function. therefore it can only have countable number of jumps.\nExcept at these jumps, |{u0 = ε}| = 0.\nLet us choose a viscosity solution v ε (and wε ) of (ST) respectively with initial data v0ε\n(resp. w0ε ) and lateral boundary data θ + ε (resp. θ − ε). In particular (excluding a\ncountable number of ε) the functions v0ε and w0ε have no mushy region, and therefore h1,ε\n0 :=\n2,ε\n−1\nε\n−1\nε\nχ (w0 ) and h0 := χ (v0 ) are well-defined almost everywhere, hence the corresponding\nweak solutions h1,ε and h2,ε exist. Now, by Lemma 4.1, the weak temperature solution\nv ε := χ(h1,ε ) (resp. wε := χ(h2,ε )) is a viscosity solution of (ST) with initial data v0ε (resp.\nw0ε ). Let u be a viscosity solution of (ST) with initial data u0 . Let û be the unique weak\ntemperature solution of (ST) with boundary data h0 := χ−1 (u0 ). For convenience, let us\ndenote the initial and lateral boundary data g := (u0 , θ).\n2. The proof of the following lemma will be presented in the Appendix:\nLemma 4.5. The functions v ε (or wε ), along a subsequence, uniformly converge to a continuous function u with boundary data g .\nDue to the stability of viscosity solutions, it is straightforward to verify that u is a viscosity\nsolution of (ST) with boundary data g.\nOn the other hand, due to stability result of [19], for each time t > 0 the weak soution\n.\nh1,ε (*, t) converges to h(*, t) in L1 -norm, where h(*, 0) = hmax\n0\nUsing the uniform convergence of v ε := χ(h1,ε ), it is easy to check that u = χ(h) = U1 a.e.\n3. Lastly, Theorem 3.1 yields that any viscosity solution u of (ST) with initial data u0\nsatisfies\nwε < u < v ε , and thus taking ε → 0 we obtain U2 ≤ u ≤ U1 .\n\nThe following Theorem is obtained as a corollary of Propostion 4.4\nTheorem 4.6. The viscosity solution u of (ST) with |{u0 = 0}| = 0 coincides with the\nweak temperature solution and it is unique.\n\n23\n\n\f¶∆\n\nΦHx, tL\n-Β\n∆\n\nH0, tL\n\nRt\n\nΡ\n\n∆\nΑ\n¶∆\n\nFigure 7: Test function φ(r, t) at time t\n\nAppendix\nFirst we construct \"two-phase\" test functions for the barrier arguments in the proof of the\ncomparison principle, Theorem 3.1.\nA. Test functions. Here we provide a construction of a class of radially symmetric classical\nsub- and supersolutions for that purpose. We will be working in spherical coordinates and\nthus we shall denote ρ = |x|.\nLet α 6= 0, β 6= 0, ε > 0, R > 0 and m be given parameters satisfying\nsign α 6= sign β\n\nα + β 6= m sign β.\n\nand\n\n(4.1)\n\nWe show below that one can find constants τ > 0, δ > 0 and q such that a test function\nφ(x, t) of the form\nφ(x, t) = φ0 (|x| − R − mt).\nwith\n\n(\n2\nαs + q s2\nφ0 (s) =\n2\n−βs + q s2\n\ns ≥ 0,\ns < 0,\n\ndefined in the domain\nΣτ,δ = {(x, t) : R + mt − δ ≤ |x| ≤ R + mt + δ, −τ ≤ t ≤ 0},\nis a classical subsolution (or supersolution) of (ST) on Στ,δ , see Figure 7. Moreover, φ(x, t)\nis \"ε-close\" to a linear function of ρ on both sides of the free boundary Γ(φ), see (4.5).\nWe shall denote Rt = R + mt since the set Γ(φ) = {(x, t) : r = R + mt} is the free boundary\nof φ. Observe that on Γ(φ), we have\nDφ+ = max (α, β) ,\n\nDφ− = − min (α, β) .\n24\n\n\fand thus\nDφ+ − Dφ− = α + β.\n\n(4.2)\n\nWe can also deduce the direction of the outer normal of {φ > 0}, and hence the sign of\nthe normal velocity Vn , from the signs of α and β due to (4.1). As Γ(φ) is the space ball\nexpanding with speed m, we recognize two situations:\n(\n−m when β < 0,\n(4.3)\nVn =\nm\nwhen β > 0.\nNow we can express the free boundary condition in the light of (4.2) and (4.3) as\n(a) m sign β ≥ α + β for a classical supersolution,\n(b) m sign β ≤ α + β for a classical subsolution.\nSuppose that the condition in (a) is satisfied and we are thus constructing a classical supersolution. In this case, the function φ has to satisfy also (∂t − ∆)φ ≥ 0 in {φ =\n6 0}.\nStraightforward computation yields\n(∂t − ∆) φ(x, t)|ρ=R+\nt\n\n(∂t − ∆) φ(x, t)|ρ=R−\nt\n\n\u0012\n\n\u0013\nn−1\n= −α m +\n− q,\nRt\n\u0013\n\u0012\nn−1\n− q.\n=β m+\nRt\n\nContinuity allows us to choose small τ > 0 and δ > 0 and a suitable constant q such that\n(∂t − ∆) φ(x, t) ≥ 0\n\nin Στ,δ \\ Γ(φ)\n\n(4.4)\n\nand\n\nin Στ,δ .\n\nφ(x, t)\n− α < ε,\nρ − Rt\nφ(x, t)\n− β < ε,\nRt − ρ\n\nwhen ρ > Rt ,\n(4.5)\nwhen ρ < Rt ,\n\nThus let φα,β\nclassical supersolution constructed above with the parameters R,\nR,m denote the\n\u0010\n\u0011\n\u0010\n\u0011\nα,β\nm, α and β. Also let δ φR,m , ε and τ φα,β\n,\nε\ndenote the constants from above.\nR,m\n\nThe case when the condition in (b) is satisfied and we are constructing a subsolution is\nanalogous. The constants τ > 0, δ > 0 and q are chosen in such a way that the function\nφ satisfies (∂t − ∆) φ(x, t) ≤ 0 in (4.4). And correspondingly, let φα,β\nR,m be the constructed\nclassical subsolution.\n25\n\n\fWe next present the proof of the lemma used in the proof of Proposition 4.4.\nB. Proof of Lemma 4.5. We will only prove the Lemma for v ε . The argument for wε is\nparallel. Let uk := v 1/k and let gk the corresponding initial and lateral boundary data of\nv 1/k .\n[8] provide us with a uniform bound on the W21,0 (Q) norm and with a uniform modulus of\ncontinuity ωd for v ε in the domains away from ∂P Q:\nQd = {(x, t) ∈ Q : dist((x, t), ∂P Q) > d},\n\nd > 0.\n\nTherefore we need a uniform modulus of continuity on ∂P Q to be able to extract a subsequence of uk converging uniformly. We will obtain this by comparing uk to solutions of the\nheat equation near the parabolic boundary of Q.\nFirst find k0 for which gk0 < 0 on ∂L Q. Theorem 3.1 implies uk decreases in k. In particular\nn\no n\no n\no\nuk+1 ≥ 0 ⊂ uk ≥ 0 ⊂ uk0 ≥ 0 .\n\n\b\nSince uk0 ≥ 0 is a closed set and g k < 0 for k ≥ k0 , there exists η > 0 such that\nn\no\nuk ≥ 0 ⊂ Qη := {(x, t) ∈ Q : dist(x, ∂Ω) > η}\nfor all k ≥ k0 .\nNote that Qη := Ωη × (0, T ) where\n\nΩη = {x ∈ Ω : dist(x, ∂Ω) > η}.\nk , resp. ψ k , to be the solution of the heat equation in Q with boundary data\nDefine ψ+\n−\nk+\ng , resp. −gk− . Here gk+ and g k− are the positive part and the negative part of g k ,\nrespectively.\n\nThe maximum principle for the heat equation yields\nk\nk\nψ−\n≤ uk ≤ ψ+\n\nin Q.\n\n(4.6)\n\nA uniform modulus of continuity for uk on the lateral boundary ∂L Q then follows from\ncomparing uk with φk that solves the heat equation\n\n\nin Q \\ Qη ,\nφt − ∆φ = 0,\nφ = gk ,\non ∂L Q,\n\n\nk\nφ(x, 0) = g (x, 0)ζ(x), on Ω \\ Ωη .\n\nHere ζ(x) is a smooth function on Ω \\ Ωη such that ζ ∈ [0, 1], ζ = 1 on Ω \\ Ωη/2 and ζ = 0\non ∂Ωη .\n26\n\n\fObserve that (4.6) and comparison for the heat equation implies that\nk\nψ−\n≤ uk ≤ φk\n\non Q \\ Qη .\n\nk = uk = φk = g k on ∂ Q, the uniform continuity follows.\nSince ψ−\nL\n\nThe proof for t = 0 is more involved. We split uk = uk+ − uk− and consider each of uk± ≥ 0\nseparately.\n\b\nChoose r > 0 small and fix k. Let Ak = x ∈ Ω : g k > 0 . Define\nAkr = {x ∈ A : dist(x, ∂A ∩ Ω) > r}.\n\n\b\nBy Lemma 4.3, there is tr > 0 such that Akr ⊂ x : uk (x, t) > 0 for all t < tr . Moreover, tr\ncan be chosen independent of k. Construct a solution φk to the heat equation in Akr × (0, tr )\nwith boundary data 0 on (∂Akr ∩ Ω) × (0, tr ) and gk (x, t)ζ k (x) on the rest of the parabolic\nboundary of Akr × (0, tr ). ζ k is chosen to be a smooth cutoff function with values in [0, 1]\non Akr such that ζ k = 1 on Ak2r and ζ k = 0 on ∂Akr ∩ Ω. It is also chosen in such a way that\nζ k C 0,1 is uniformly bounded in k. Define φkr = 0 in the complement of Akr × (0, tr ). The\nmaximum principle for heat equation then yields\nk\nφkr ≤ uk+ ≤ ψ+\n\nin Ω × [0, tr ].\n\nThus the standard parabolic estimates for the heat equation ([18]) imply\nuk+ (x1 , t1 ) − uk+ (x0 , 0) = uk+ (x1 , t1 ) − g k+ (x0 )\n\u0011\n\u0010\n≤ ωg (2r) + ωH |x1 − x0 |2 + t1 ,\n\nfor all t1 < tr , x0 , x1 ∈ Ω, modulus of continuity ωH independent of k and r, where ωg is a\nmodulus of continuity of g. This implies uniform modulus of continuity for uk+ at t = 0.\nA similar consideration yields a uniform modulus for uk− at t = 0. Those together give us\na uniform modulus of continuity for uk .\n\b\n∞\nNow as in [8], we can find a subsequence ukj j=1 such that\n\u0010 \u0011\nβ ukj → β (ũ)\n\nweakly in L2 (Q),\n\nDukj → Dũ\n\nweakly in L2 (Q),\n\nukj → ũ\n\nuniformly on Q.\n\nAcknowledgments: I. Kim and N. Pozar are supported by nsf-dms 0700732.\n27\n\n\f[1]\n\nD. Andreucci, Behaviour of Mushy Regions under the Action of a Volumetric Heat Source, Mathematical\nMethods in the Applied Sciences 16 (1993), 35–47.\n\n[2]\n\nI. Athanasopoulos, L. Caffarelli, and S. Salsa, Regularity of the free boundary in parabolic phasetransition problems, Acta Math. 176 (1996), 245–282.\n\n[3]\n\n, Phase transition problems of parabolic type: flat free boundaries are smooth., Comm. Pure\nAppl. Math. 51 (1998), 77–112.\n\n[4]\n\nM. Bertsch, P. de Mottoni, and L. A. Peletier, The Stefan problem with heating: appearance and disappearance of a mushy region, Trans. Amer. Math. Soc. 293 (1986), no. 2, 677–691.\n\n[5]\n\nI. A. Blank, M. K. Korten, and C. N. Moore, The Hele-Shaw problem as a \"mesa\" limit of Stefan\nproblems: existence, uniqueness, and regularity of the free boundary, Trans. Amer. Math. Soc. 361\n(2009), no. 3, 1241–1268.\n\n[6]\n\nC. Brändle and J. L. Vázquez, Viscosity solutions for quasilinear degenerate parabolic equations of\nporous medium type, Indiana Univ. Math. J. 54 (2005), no. 3, 817–860.\n\n[7]\n\nL. A. Caffarelli, A Harnack inequality approach to the regularity of free boundaries. III. Existence theory,\ncompactness, and dependence on X., Ann. Scuola Norm. Sup. Pisa Cl. Sci. (4) 15 (1988), no. 4, 583–602.\n\n[8]\n\nL. A. Caffarelli and L. C. Evans, Continuity of the temperature in the two-phase Stefan problem, Arch.\nRational Mech. Anal. 81 (1983), no. 3, 199–220.\n\n[9]\n\nL. Caffarelli and S. Salsa, A geometric approach to free boundary problems, Graduate Studies in Mathematics, vol. 68, American Mathematical Society, Providence, RI, 2005.\n\n[10] L. A. Caffarelli and J. L. Vázquez, Viscosity Solutions for the Porous Medium Equation, Proc. Sympos.\nPure Math. 65 (1999), 13–26.\n[11] M. G. Crandall, H. Ishii, and P. L. Lions, User's guide to viscosity solutions of second order partial\ndifferential equations, Bull. Amer. Math. Soc. 27 (1992), no. 1, 1–67.\n[12] M. G. Crandall and P. L. Lions, Viscosity solutions of Hamilton-Jacobi equations, Trans. Amer. Math.\nSoc. 277 (1983), 1–42.\n[13] E. DiBenedetto, Continuity of weak solutions to certain singular parabolic equations, Ann. Mat. Pura\nAppl. 130 (1982), 131–176.\n[14] F. Ferrari and S. Salsa, Regularity of the free boundary in two-phase problems for linear elliptic operators,\nAdv. in Math. 214 (2007), 288–322.\n[15] A. Friedman, The Stefan problem in several space variables, Trans. AMS. 133 (1968), 51–87.\n[16] I. G. Götz and B. Zalzman, Nonincrease of mushy region in a nonhomogeneous Stefan problem, Quart.\nAppl. Math. XLIX (1991), no. 4, 741–746.\n[17] I. C. Kim, Uniqueness and existence results on the Hele-Shaw and the Stefan Problems, Arch. Rational\nMech. Anal. 168 (2003), 299–328.\n[18] O. A. Ladyženskaja, V. A. Solonnikov, and N. N. Ural'ceva, Linear and Quasilinear Equations of\nParabolic Type, Amer. Math. Soc., Providence, 1968.\n[19] A. M. Meirmanov, The Stefan problem, Walter de Gruyter, 1992.\n[20] O. A. Oleinik, M. Primicerio, and E. V. Radkevich, Stefan-like problems, Meccanica 28 (1992), 129–143.\n[21] J. C. W. Rogers and A. E. Berger, Some properties of the nonlinear semigroup for the problem ut −\nDf (u) = 0, Nonlinear Anal., Theory, Methods and Applications 8 (1984), no. 8, 909–939.\n\n28\n\n\f"}