{"id": "http://arxiv.org/abs/1106.4204v1", "guidislink": true, "updated": "2011-06-21T13:48:13Z", "updated_parsed": [2011, 6, 21, 13, 48, 13, 1, 172, 0], "published": "2011-06-21T13:48:13Z", "published_parsed": [2011, 6, 21, 13, 48, 13, 1, 172, 0], "title": "Metamaterial-inspired multichannel thin-film sensor", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1106.2231%2C1106.4954%2C1106.5247%2C1106.1873%2C1106.3935%2C1106.1901%2C1106.6176%2C1106.1054%2C1106.2996%2C1106.5220%2C1106.3856%2C1106.0822%2C1106.0433%2C1106.0429%2C1106.0810%2C1106.6286%2C1106.3516%2C1106.3781%2C1106.3761%2C1106.3718%2C1106.3694%2C1106.3227%2C1106.5083%2C1106.4659%2C1106.1253%2C1106.2039%2C1106.1265%2C1106.2610%2C1106.5088%2C1106.2927%2C1106.3380%2C1106.1062%2C1106.1581%2C1106.2056%2C1106.5965%2C1106.1626%2C1106.2734%2C1106.2527%2C1106.1978%2C1106.5707%2C1106.5905%2C1106.5909%2C1106.1931%2C1106.0686%2C1106.4272%2C1106.4780%2C1106.0057%2C1106.1432%2C1106.2101%2C1106.3766%2C1106.1638%2C1106.4473%2C1106.1490%2C1106.0629%2C1106.2848%2C1106.6195%2C1106.5454%2C1106.5010%2C1106.0004%2C1106.5330%2C1106.4319%2C1106.3481%2C1106.5766%2C1106.3097%2C1106.4589%2C1106.4836%2C1106.0946%2C1106.0308%2C1106.1910%2C1106.2544%2C1106.3551%2C1106.4684%2C1106.3346%2C1106.4180%2C1106.4527%2C1106.0982%2C1106.5269%2C1106.4394%2C1106.5005%2C1106.3922%2C1106.4226%2C1106.0121%2C1106.4026%2C1106.4204%2C1106.5185%2C1106.4577%2C1106.1445%2C1106.4877%2C1106.3784%2C1106.6175%2C1106.0068%2C1106.2965%2C1106.6027%2C1106.3043%2C1106.3288%2C1106.3619%2C1106.3198%2C1106.4761%2C1106.5258%2C1106.3062%2C1106.2368&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Metamaterial-inspired multichannel thin-film sensor"}, "summary": "A multichannel thin-film sensor is implemented from a set of\nmicrostrip-coupled split-ring resonators (SRR's) with different dimensions.\nEach SRR exhibits a unique high-Q resonance that is sensitive to the presence\nof a sample in a particular area. Hence, this SRR-based sensor can function (i)\nto detect different samples simultaneously to increase the throughput or (ii)\nto characterise nominally identical samples at multiple frequencies to increase\nthe sensor selectivity. The design principle is validated with simulation and\nmeasurement. Owing to the optimized design, sensing a low-permittivity film\nwith a thickness as small as one thousandth of the operating wavelength is\nachievable.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1106.2231%2C1106.4954%2C1106.5247%2C1106.1873%2C1106.3935%2C1106.1901%2C1106.6176%2C1106.1054%2C1106.2996%2C1106.5220%2C1106.3856%2C1106.0822%2C1106.0433%2C1106.0429%2C1106.0810%2C1106.6286%2C1106.3516%2C1106.3781%2C1106.3761%2C1106.3718%2C1106.3694%2C1106.3227%2C1106.5083%2C1106.4659%2C1106.1253%2C1106.2039%2C1106.1265%2C1106.2610%2C1106.5088%2C1106.2927%2C1106.3380%2C1106.1062%2C1106.1581%2C1106.2056%2C1106.5965%2C1106.1626%2C1106.2734%2C1106.2527%2C1106.1978%2C1106.5707%2C1106.5905%2C1106.5909%2C1106.1931%2C1106.0686%2C1106.4272%2C1106.4780%2C1106.0057%2C1106.1432%2C1106.2101%2C1106.3766%2C1106.1638%2C1106.4473%2C1106.1490%2C1106.0629%2C1106.2848%2C1106.6195%2C1106.5454%2C1106.5010%2C1106.0004%2C1106.5330%2C1106.4319%2C1106.3481%2C1106.5766%2C1106.3097%2C1106.4589%2C1106.4836%2C1106.0946%2C1106.0308%2C1106.1910%2C1106.2544%2C1106.3551%2C1106.4684%2C1106.3346%2C1106.4180%2C1106.4527%2C1106.0982%2C1106.5269%2C1106.4394%2C1106.5005%2C1106.3922%2C1106.4226%2C1106.0121%2C1106.4026%2C1106.4204%2C1106.5185%2C1106.4577%2C1106.1445%2C1106.4877%2C1106.3784%2C1106.6175%2C1106.0068%2C1106.2965%2C1106.6027%2C1106.3043%2C1106.3288%2C1106.3619%2C1106.3198%2C1106.4761%2C1106.5258%2C1106.3062%2C1106.2368&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "A multichannel thin-film sensor is implemented from a set of\nmicrostrip-coupled split-ring resonators (SRR's) with different dimensions.\nEach SRR exhibits a unique high-Q resonance that is sensitive to the presence\nof a sample in a particular area. Hence, this SRR-based sensor can function (i)\nto detect different samples simultaneously to increase the throughput or (ii)\nto characterise nominally identical samples at multiple frequencies to increase\nthe sensor selectivity. The design principle is validated with simulation and\nmeasurement. Owing to the optimized design, sensing a low-permittivity film\nwith a thickness as small as one thousandth of the operating wavelength is\nachievable."}, "authors": ["Withawat Withayachumnankul", "Kata Jaruwongrungsee", "Christophe Fumeaux", "Derek Abbott"], "author_detail": {"name": "Derek Abbott"}, "author": "Derek Abbott", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1109/JSEN.2011.2173762", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1106.4204v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1106.4204v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "7 pages, 4 figures", "arxiv_primary_category": {"term": "physics.ins-det", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "physics.ins-det", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1106.4204v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1106.4204v1", "journal_reference": null, "doi": "10.1109/JSEN.2011.2173762", "fulltext": "arXiv:1106.4204v1 [physics.ins-det] 21 Jun 2011\n\nMetamaterial-inspired multichannel\nthin-film sensor\n\nWithawat Withayachumnankul1,2, Kata Jaruwongrungsee2,3,\nChristophe Fumeaux1 , and Derek Abbott1\n1\nSchool of Electrical & Electronic Engineering, The University of Adelaide,\nAdelaide, SA 5005, Australia\n2\nSchool of Electronic Engineering, Faculty of Engineering, King Mongkut's\nInstitute of Technology Ladkrabang, Bangkok 10520, Thailand\n3\nNanoelectronics and MEMS Laboratory, National Electronics and Computer\nTechnology Center, Pathumthani 12120, Thailand\nAbstract\nA multichannel thin-film sensor is implemented from a set of microstripcoupled split-ring resonators (SRRs) with different dimensions. Each SRR\nexhibits a unique high-Q resonance that is sensitive to the presence of a\nsample in a particular area. Hence, this SRR-based sensor can function\n(i) to detect different samples simultaneously to increase the throughput\nor (ii) to characterise nominally identical samples at multiple frequencies\nto increase the sensor selectivity. The design principle is validated with\nsimulation and measurement. Owing to the optimized design, sensing a\nlow-permittivity film with a thickness as small as one thousandth of the\noperating wavelength is achievable.\n\nSplit-ring resonators (SRR's) are among many fundamental building blocks\nfor metamaterials that can collectively provide customizable values of the permittivity and/or permeability. A SRR is typically made of one or two concentric\nsubwavelength metallic rings (namely single or double SRR, respectively) with\na narrow split in each ring [1]. In response to an electromagnetic excitation,\nit exhibits a strong magnetic resonance whose frequency is determined by its\ndimensions, geometry, and constituent materials. On resonance, the ring develops an intense and localised electric field at the narrow split. The sensitivity of\nthe resonance frequency to constituent materials, together with the field localisation, subwavelength ring size, and high-Q resonance, makes SRR's ideal for\nthin-film sensing.\nOwing to these properties, SRR's have recently been implemented for biosensors in different configurations. Planar arrays of SRR's were employed for thinfilm sensing [2, 3, 4, 5, 6, 7, 8]. However, those sensors require a relatively\nlarge amount of the sample to uniformly cover an array with tens to hundreds\n1\n\n\fl\nd\n\nr\n\nR1\nR3\n\ng\n\nw\n\nR4\nR2\nSRR\n\ns\n\nc\n\nmicrostrip\n\nt\n\n(a)\n\n(b)\n\nFigure 1: (a) Diagram (not to scale) for each SRR, placed alongside a microstrip\nline, in the multichannel sensor. The sensing area is indicated by the red dotted\ncircle. (b) Fabricated four-channel sensor containing four SRR's.\nof SRR's during the measurement. The constraints of the sample size and uniformity can be eliminated by using either microstrip-coupled SRR's [9, 10, 11]\nor waveguide-loaded SRR's [12]. Although both microstrip and waveguide arrangements can be used for thin-film sensing, electromagnetic coupling is much\nstronger in the former case, resulting in its higher immunity against noise and\nfluctuations.\nFor the microstrip-coupling configuration, an SRR is positioned in a close\nproximity to a microstrip transmission line, which builds up a magnetic field\naround itself in a quasi-TEM wave propagation. This oscillating magnetic field\ninduces circulating current in the SRR loop. In the quasistatic limit, an SRR\ncan be approximated by an inductor and a capacitor in the form of a series LC\nresonant circuit. Specifically, the ring forms the inductor, and the split forms\nthe capacitor. The resonance takes place in the SRR when the electric energy\nstored in the capacitor is balanced with the magnetic energy stored in the inductor. Loading a sample onto the SRR surface alters the total capacitance of the\nstructure and hence results in a detectable change in the resonance frequency.\nThis article presents a multichannel thin-film sensor based on microstripcoupled SRR's. Several SRR's with different sizes are placed along a microstrip\nline. Thus, the sensor exhibits multiple resonances, each of which represents\na single channel governed by an individual SRR. Each resonance is sensitive\nto the presence of a sample deposited at the narrow split of the corresponding\nSRR. Since every resonator possesses a high-Q resonance at a unique frequency,\nmutual interaction among the resonators is minimal. Therefore, several SRR's\ncan be placed densely without compromising the performance.\nBeyond the multichannel sensing capability, this article proposes additionally a strategy to improve significantly the sensitivity of SRR sensors by creating\na strong and localized field enhancement in a single spot. In earlier designs, several double SRRs [9, 10, 11] or a single SRR with two splits [12] have been used.\nIn such structures, several distributed capacitors collectively determine the resonance frequency, and a considerable amount of sample is required to change all\nof these capacitors. If the sample partially covers the structure, the unaffected\n\n2\n\n\f0\n\nS21 (dB)\n\nexperiment\nsimulation\n\n−10\n\n−20\n\nfR1 = 2.07 GHz\n\nfR2 = 2.40 GHz\n\nfR4 = 3.28 GHz\nfR3 = 2.77 GHz\n\n1.5\n\n2\n\n2.5\nfrequency (GHz)\n\n3\n\n3.5\n\nFigure 2: Transmission profiles from simulation and experiment with no sample\nloading. Each resonance, i.e., channel, corresponds to an individual SRR. The\nindicated resonance frequencies are extracted from the experimental results.\ncapacitance reduces the sensitivity in the sensing region as the capacitive change\nis then not as pronounced. In the present design, each resonance is caused by a\nsingle SRR with only one split, as shown in Fig. 1(a), and consequently, only one\ndistributed capacitor is present. A change in this capacitor by sample loading in\nthe small split region has a direct and large impact on the resonance frequency.\nFig. 1(a) also depicts some other important features of the implemented\nresonators. Each SRR has a rectangular shape to maximize coupling to the\nmicrostrip transmission line. This leads to a stronger resonance that is robust\nto measurement uncertainties. At each SRR split, sharp tips are adopted to\nconcentrate the electric field to a small spot [12]. In terms of a series LC circuit,\nthe tapered shape of the tips decreases the capacitance at the split, and hence\nincreases the resonance Q-factor.\nFig. 1(b) shows the proposed sensor fabricated by using standard photolithography and chemical etching. This particular four-channel sensor is realized from four different SRR's positioned along a 50-Ω microstrip line. All of\nthe resonators share the same dimensions excepting the width, w, that equals 8,\n6, 4.5, and 3 mm for R1, R2, R3, and R4, respectively. This causes a difference\nin the loop inductance and hence in the resonance frequency among the SRR's.\nThe other dimensions common to all of the SRR's are as follows: l = 7 mm,\ng = 0.15 mm, d = 0.525 mm, r = 0.2 mm, c = 0.65 mm, s = 2 mm, and\nt = 1.7 mm. The metal for the SRR's, microstrip, and ground plane is copper with a thickness of 35 μm, coated with gold to prevent oxidization. The\nsubstrate is an RT/duroid 6010.2LM high-frequency laminate (ceramic-PTFE\ncomposite) with a thickness of 1.90 mm, a relative permittivity of 10.2, and a\nloss tangent of 0.0023. This sensor specification yields four high-Q resonances\nin the microwave S band.\nDuring the experiment, the sensor is connected to a vector network analyzer,\nAgilent Technologies N5230A, and the transmission parameter S21 is registered\n\n3\n\n\f380 kV/m\n\nfR1\n\nfR2\n\nfR3\n\nfR4\n\n0 V/m\n\nFigure 3: Simulated electrical-field amplitude distribution on the sensor surface\nat four resonance frequencies. The peak input power supplied to the sensor is\n1 W.\nat room temperature in the range between 1.5–3.5 GHz with a resolution of\n3 MHz. The numerical simulation is carried out with a commercial full-wave\nelectromagnetic solver, CST Microwave Studio, based on the Finite-Integration\nTechnique (FIT). The gap size g in each ring resonator is slightly adjusted\nin the simulation to reflect the fabrication imperfections, as observed under a\nmicroscope.\nThe measured and simulated transmission profiles of the sensor without any\nsample are shown in Fig. 2 with small discrepancies caused by fabrication tolerances and limits in simulation accuracy. The results show four non-overlapping\nresonances corresponding to the four distinct SRR's. The lowest resonance fR1\nis associated with R1, which has the largest inductance, the second lowest resonance fR2 with R2, and so on. No change in the resonances is observed during\n5 hours of measurement, demonstrating the thermal stability of the sensor.\nFurther insight can be obtained from the simulation, as shown in Fig. 3,\nwhere the electric-field distribution on the sensor surface is calculated for every channel. At each resonance frequency, only the relevant SRR establishes\na strong and highly confined electric field around the capacitive split, and no\nfield enhancement is observed elsewhere. The field enhancement in any active\nring is as high as 380 kV/m, given the input power of only 1 W. These calculated field distributions confirm the extreme field confinement achieved with the\nimplemented SRR's, which is a basis for high-performance sensing.\nIn the next experiment, ethanol is used as a sample under test by the multichannel sensor. At 3 GHz, ethanol has a relative permittivity and loss tangent\nof 6.0 and 0.96, respectively [13]. In each measurement, 5 μL of ethanol is\ndropped by using a high-precision pipette onto the split of a selected SRR chan4\n\n\f0\n\nR2\n\nS21 (dB)\n\nR1\n−8\n\n1.97\n\n−16\n0\n\n2.40\n\n2.77\n\n3.28\n\n2.29\n\n2.77\n\n3.28\n\n2.07\n\n2.40\n\n2.77\n\n3.11\n\nR4\n\nR3\nS21 (dB)\n\n2.07\n\n−8\n\n−16\n1.5\n\n2.07\n2\n\n2.40\n2.5\n\n2.60\n\n3.28\n\n3\n\n1.5\n\nfrequency (GHz)\n\n2\n\n2.5\n\n3\n\n3.5\n\nfrequency (GHz)\n\nFigure 4: Transmission profiles for unloaded (dotted lines) and loaded (solid\nlines) SRR's. Each subfigure represents a comparison of sample loading at an\nindividual SRR channel. The specified numbers are the resonance frequencies\nin GHz of the loaded sensor, and the italization indicates shifted resonances.\nnel, and the sensor's response is observed. The transmission results are shown\nin Fig. 4. The observed resonance shifting and damping indicate the presence\nof the sample in the selected channel. By comparing the resonance frequencies\nof the loaded sensor in Fig. 4 with the reference values in Fig. 2, it is clear that\nnon-active SRR channels show no detectable change in the resonance frequency.\nHence, it is clear that the four sensing channels can operate independently.\nEach SRR can be√approximated by a series LC circuit with a resonance\nfrequency f0 = 1/(2π LC), where L denotes the ring inductance and C denotes\nthe split capacitance. The sensitivity of the resonance frequency to the split\ncapacitance can be expressed as [14]\nf0\n=\nSC\n\nC ∂f0\n= −0.5 .\nf0 ∂C\n\n(1)\n\nIt can be deduced from this equation that if the relative change in the capacitance formed by the split, ∆C/C, is constant, the relative change in the resonance frequency, ∆f /f0 , is fixed, regardless of the ring inductance. Nonetheless,\nthe relative change in the resonance frequency for the active channel varies between -4.6% and -6.1% among the four channels, despite a fixed volume of\nsample. This small variation is presumably caused by manual sample deposition, which results in a slight difference in the sample location. This uncertainty\ncan be readily overcome with an automated process.\nThe sample volume used in the experiment is considerably small. Nevertheless, additional simulations suggest that only one nanolitre of ethanol, i.e., a\n0.1-mm cube, is unambiguously detectable with a frequency shift of 15 MHz. In\nother words, the ratio between the operating wavelength and the film thickness\ncan be as large as three orders of magnitude.\n5\n\n\fIn conclusion, this article presents a thin-film sensor with a series of optimized SRR's as sensing elements. The fabricated sensor successfully performs\nmultichannel detection with an enhanced sensitivity. Scaling down the structure to operate at higher frequencies further reduces the minimum amount of\ndetectable sample. More channels can be added to the sensor provided that\nresulting resonances are sparse enough to avoid mutual coupling. The resonance of each channel can be positioned at an abritary frequency where unique\ndielectric features of the sample are expected. The realization can be used for\non-site disposable sensors, which allow sensing with either high selectivity or\nhigh throughput.\n\nAcknowledgments\nThe authors acknowledge Pavel Simcik and Henry Ho for their technical assistance. The laminates used in the experiment were supplied by Rogers Corporation. This research was supported by the Australian Research Council Discovery\nProjects funding scheme (project number DP1095151).\n\nReferences\n[1] J. B. Pendry, A. J. Holden, D. J. Robbins, and W. J. Stewart, \"Magnetism\nfrom conductors and enhanced nonlinear phenomena,\" IEEE Trans. Microwave Theory Tech. 47(11), pp. 2075–2084, 1999.\n[2] C. Debus and P. H. Bolivar, \"Frequency selective surfaces for high sensitivity terahertz sensing,\" Appl. Phys. Lett. 91, p. 184102, 2007.\n[3] T. Driscoll, G. O. Andreev, D. N. Basov, S. Palit, S. Y. Cho, N. M. Jokerst,\nand D. R. Smith, \"Tuned permeability in terahertz split-ring resonators for\ndevices and sensors,\" Appl. Phys. Lett. 91, p. 062511, 2007.\n[4] Y.-T. Chang, Y.-C. Lai, C.-T. Li, C.-K. Chen, and T.-J. Yen, \"A multifunctional plasmonic biosensor,\" Opt. Express 18(9), pp. 9561–9569, 2010.\n[5] S.-Y. Chiam, R. Singh, J. Gu, J. Han, W. Zhang, and A. A. Bettiol, \"Increased frequency shifts in high aspect ratio terahertz split ring resonators,\"\nAppl. Phys. Lett. 94(6), p. 064102, 2009.\n[6] J. F. O'Hara, R. Singh, I. Brener, E. Smirnova, J. Han, A. J. Taylor,\nand W. Zhang, \"Thin-film sensing with planar terahertz metamaterials:\nsensitivity and limitations,\" Opt. Express 16(3), pp. 1786–1795, 2008.\n[7] J. A. Gordon, C. L. Holloway, J. Booth, S. Kim, Y. Wang, J. Baker-Jarvis,\nand D. R. Novotny, \"Fluid interactions with metafilms/metasurfaces for\ntuning, sensing, and microwave-assisted chemical processes,\" Phys. Rev.\nB: Condens. Matter 83, p. 205130, 2011.\n\n6\n\n\f[8] H. Tao, L. Chieffo, M. A. Brenckle, S. M. Siebert, M. Liu, A. C. Strikwerda, K. Fan, D. L. Kaplan, X. Zhang, R. D. Averitt, and F. G. Omenetto,\n\"Metamaterials on paper as a sensing platform,\" Adv. Mater. , 2011. (Online edition).\n[9] H.-J. Lee and J.-G. Yook, \"Biosensing using split-ring resonators at microwave regime,\" Appl. Phys. Lett. 92, p. 254103, 2008.\n[10] H.-J. Lee, H.-S. Lee, K.-H. Yoo, and J.-G. Yook, \"On the possiblity of\nbiosensors based on split ring resonators,\" in Proceedings of the 38th European Microwave Conference, pp. 1222–1225, 2008.\n[11] H.-J. Lee, H.-S. Lee, K.-H. Yoo, and J.-G. Yook, \"DNA sensing based on\nsingle element planar double split-ring resonator,\" in IEEE MTT-S International Microwave Symposium Digest, pp. 1685–1688, 2009.\n[12] I. A. I. Al-Naib, C. Jansen, and M. Koch, \"Thin-film sensing with planar asymmetric metamaterial resonators,\" Appl. Phys. Lett. 93, p. 083507,\n2008.\n[13] R. E. Mudgett, D. I. C. Wang, and S. A. Goldblith, \"Prediction of dielectric\nproperties in oil-water and alcohol-water mixtures at 3000 MHz, 25◦ c based\non pure component properties,\" J. Food Sci. 39, pp. 632–635, 1974.\n[14] W. Withayachumnankul, C. Fumeaux, and D. Abbott, \"Planar array of\nelectric-LC resonators with broadband tunability,\" IEEE Antennas Wirel.\nPropag. Lett. 10, 2011. (In press).\n\n7\n\n\f"}