{"id": "http://arxiv.org/abs/0909.3874v2", "guidislink": true, "updated": "2009-10-16T10:32:37Z", "updated_parsed": [2009, 10, 16, 10, 32, 37, 4, 289, 0], "published": "2009-09-22T12:56:09Z", "published_parsed": [2009, 9, 22, 12, 56, 9, 1, 265, 0], "title": "Quantum Yang-Mills Condensate Dark Energy Models", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0909.4763%2C0909.0380%2C0909.0680%2C0909.3098%2C0909.5620%2C0909.2675%2C0909.4366%2C0909.3796%2C0909.3860%2C0909.5605%2C0909.4785%2C0909.5237%2C0909.4961%2C0909.3359%2C0909.3353%2C0909.5399%2C0909.0294%2C0909.3021%2C0909.2712%2C0909.5302%2C0909.2583%2C0909.5258%2C0909.1575%2C0909.4099%2C0909.0129%2C0909.5236%2C0909.5604%2C0909.1223%2C0909.4436%2C0909.0016%2C0909.2302%2C0909.3159%2C0909.3316%2C0909.2005%2C0909.3561%2C0909.2550%2C0909.2985%2C0909.3163%2C0909.2939%2C0909.1414%2C0909.4814%2C0909.4842%2C0909.5364%2C0909.0299%2C0909.5491%2C0909.3500%2C0909.2343%2C0909.2102%2C0909.0541%2C0909.0757%2C0909.1618%2C0909.0547%2C0909.5603%2C0909.3501%2C0909.3698%2C0909.2358%2C0909.4566%2C0909.4490%2C0909.4014%2C0909.2021%2C0909.4695%2C0909.1358%2C0909.5656%2C0909.2490%2C0909.3573%2C0909.5280%2C0909.1757%2C0909.1434%2C0909.5524%2C0909.4682%2C0909.0722%2C0909.4698%2C0909.0858%2C0909.4939%2C0909.1334%2C0909.5547%2C0909.0781%2C0909.2057%2C0909.3780%2C0909.2979%2C0909.3874%2C0909.4641%2C0909.4574%2C0909.5650%2C0909.1605%2C0909.2592%2C0909.1646%2C0909.2425%2C0909.0103%2C0909.3109%2C0909.1114%2C0909.3910%2C0909.2321%2C0909.1745%2C0909.1564%2C0909.2060%2C0909.0135%2C0909.0724%2C0909.2613%2C0909.1274%2C0909.4765&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Quantum Yang-Mills Condensate Dark Energy Models"}, "summary": "We review the quantum Yang-Mills condensate (YMC) dark energy models. As the\neffective Yang-Mills Lagrangian is completely determined by the quantum field\ntheory, there is no adjustable parameter in the model except the energy scale.\nIn this model, the equation-of-state (EOS) of the YMC dark energy, $w_y > -1$\nand $w_y < -1$, can both be naturally realized. By studying the evolution of\nvarious components in the model, we find that, in the early stage of the\nuniverse, dark energy tracked the evolution of the radiation, i.e. $w_y \\to\n1/3$. However, in the late stage, $w_y$ naturally runs to the critical state\nwith $w_y = -1$, and the universe transits from matter-dominated into dark\nenergy dominated stage only at recently $z \\sim 0.3$. These characters are\nindependent of the choice of the initial condition, and the cosmic coincidence\nproblem is avoided in the models. We also find that, if the possible\ninteraction between YMC and dust matter is considered, the late time attractor\nsolution may exist. In this case, the EOS of YMC must evolve from $w_y>0$ into\n$w_y < -1$, which is slightly suggested by the observations. At the same time,\nthe total EOS in the attractor solution is $w_{tot} = -1$, the universe being\nthe de Sitter expansion in the late stage, and the cosmic big rip is naturally\navoided. These features are all independent of the interacting forms.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0909.4763%2C0909.0380%2C0909.0680%2C0909.3098%2C0909.5620%2C0909.2675%2C0909.4366%2C0909.3796%2C0909.3860%2C0909.5605%2C0909.4785%2C0909.5237%2C0909.4961%2C0909.3359%2C0909.3353%2C0909.5399%2C0909.0294%2C0909.3021%2C0909.2712%2C0909.5302%2C0909.2583%2C0909.5258%2C0909.1575%2C0909.4099%2C0909.0129%2C0909.5236%2C0909.5604%2C0909.1223%2C0909.4436%2C0909.0016%2C0909.2302%2C0909.3159%2C0909.3316%2C0909.2005%2C0909.3561%2C0909.2550%2C0909.2985%2C0909.3163%2C0909.2939%2C0909.1414%2C0909.4814%2C0909.4842%2C0909.5364%2C0909.0299%2C0909.5491%2C0909.3500%2C0909.2343%2C0909.2102%2C0909.0541%2C0909.0757%2C0909.1618%2C0909.0547%2C0909.5603%2C0909.3501%2C0909.3698%2C0909.2358%2C0909.4566%2C0909.4490%2C0909.4014%2C0909.2021%2C0909.4695%2C0909.1358%2C0909.5656%2C0909.2490%2C0909.3573%2C0909.5280%2C0909.1757%2C0909.1434%2C0909.5524%2C0909.4682%2C0909.0722%2C0909.4698%2C0909.0858%2C0909.4939%2C0909.1334%2C0909.5547%2C0909.0781%2C0909.2057%2C0909.3780%2C0909.2979%2C0909.3874%2C0909.4641%2C0909.4574%2C0909.5650%2C0909.1605%2C0909.2592%2C0909.1646%2C0909.2425%2C0909.0103%2C0909.3109%2C0909.1114%2C0909.3910%2C0909.2321%2C0909.1745%2C0909.1564%2C0909.2060%2C0909.0135%2C0909.0724%2C0909.2613%2C0909.1274%2C0909.4765&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We review the quantum Yang-Mills condensate (YMC) dark energy models. As the\neffective Yang-Mills Lagrangian is completely determined by the quantum field\ntheory, there is no adjustable parameter in the model except the energy scale.\nIn this model, the equation-of-state (EOS) of the YMC dark energy, $w_y > -1$\nand $w_y < -1$, can both be naturally realized. By studying the evolution of\nvarious components in the model, we find that, in the early stage of the\nuniverse, dark energy tracked the evolution of the radiation, i.e. $w_y \\to\n1/3$. However, in the late stage, $w_y$ naturally runs to the critical state\nwith $w_y = -1$, and the universe transits from matter-dominated into dark\nenergy dominated stage only at recently $z \\sim 0.3$. These characters are\nindependent of the choice of the initial condition, and the cosmic coincidence\nproblem is avoided in the models. We also find that, if the possible\ninteraction between YMC and dust matter is considered, the late time attractor\nsolution may exist. In this case, the EOS of YMC must evolve from $w_y>0$ into\n$w_y < -1$, which is slightly suggested by the observations. At the same time,\nthe total EOS in the attractor solution is $w_{tot} = -1$, the universe being\nthe de Sitter expansion in the late stage, and the cosmic big rip is naturally\navoided. These features are all independent of the interacting forms."}, "authors": ["W. Zhao", "Y. Zhang", "M. L. Tong"], "author_detail": {"name": "M. L. Tong"}, "author": "M. L. Tong", "arxiv_comment": "15 pages, 4 figures, invited for the book: Dark Energy: Theories,\n  Developments and Implications, accepted for publication", "links": [{"href": "http://arxiv.org/abs/0909.3874v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0909.3874v2", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "astro-ph.CO", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "astro-ph.CO", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "gr-qc", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "hep-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "hep-th", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0909.3874v2", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0909.3874v2", "journal_reference": "Chapter 5 (pp.89-109) in the Publication: Dark Energy: Theories,\n  Developments and Implications (2010, Nova Publisher)", "doi": null, "fulltext": "Quantum Yang-Mills Condensate Dark Energy Models\nWen Zhao,1 Yang Zhang,2 and Minglei Tong2\n1\n\n2\n\nSchool of Physics and Astronomy, Cardiff University, Cardiff, CF24 3AA, United Kingdom\nCenter for Astrophysics, University of Science and Technology of China, Hefei, 230026, People's Republic of China\n(Dated: November 20, 2018)\n\narXiv:0909.3874v2 [astro-ph.CO] 16 Oct 2009\n\nAbstract\nWe review the quantum Yang-Mills condensate (YMC) dark energy models. As the effective Yang-Mills Lagrangian is\ncompletely determined by the quantum field theory, there is no adjustable parameter in the model except the energy scale. In\nthis model, the equation-of-state (EOS) of the YMC dark energy, wy > −1 and wy < −1, can both be naturally realized. By\nstudying the evolution of various components in the model, we find that, in the early stage of the universe, dark energy tracked\nthe evolution of the radiation, i.e. wy → 1/3. However, in the late stage, wy naturally runs to the critical state with wy = −1,\nand the universe transits from matter-dominated into dark energy dominated stage only at recently z ∼ 0.3. These characters\nare independent of the choice of the initial condition, and the cosmic coincidence problem is avoided in the models. We also\nfind that, if the possible interaction between YMC and dust matter is considered, the late time attractor solution may exist.\nIn this case, the EOS of YMC must evolve from wy > 0 into wy < −1, which is slightly suggested by the observations. At the\nsame time, the total EOS in the attractor solution is wtot = −1, the universe being the de Sitter expansion in the late stage,\nand the cosmic big rip is naturally avoided. These features are all independent of the interacting forms.\nPACS numbers: 98.80.-k, 98.80.Es, 04.30.-w, 04.62.+v\n\n1\n\n\fI.\n\nINTRODUCTION\n\nThe observations of Type Ia Supernova (SNIa) [1], together with the cosmic microwave background radiation\n(CMB)[2] and the larger scale structure [3], suggest that the present universe is accelerating expansion, which needs\na kind of mysterious dark energy with negative equation-of-state (EOS). The simplest model is by introducing the\ncosmological constant term Λ, which has a constant effective EOS w = −1, and drive the acceleration of the universe.\nIf assuming the effective energy of the Λ term occupies ∼ 73% of the total energy, together with ∼ 23% dark matter,\n∼ 4% baryon matter and ∼ 10−5 radiation component, constitute the so-called ΛCDM model.\nAlthough this simple model satisfies nearly all the cosmological observations, it still remains a phenomenological\nmodel. Since the major components, Λ and dark matter, still keep unclear for us. For the Λ as the candidate of dark\nenergy, also suffers from the following dilemmas (see for instant [4]): First, the effective energy density is quite tiny,\nρΛ ∼ 5.8h2 × 10−11 eV4 . If we consider it as the vacuum energy of the particle physics, this energy density is 120 order\nsmaller than the Planck energy scale! This is the so-called 'fine-tunning' problem. Second, the density scale of Λ\nkeeps constant in all the stage of the universe. The observations show that the present value of the matter component\n(including dark matter and baryon components) is some one third of ρΛ , but it varies with time as ρm ∝ a−3 . So,\nfor example, at an earlier time of radiation-matter equality with redshift z ∼ 3454, ρΛ should be a very fine tuned\nvalue ∼ 6.3 × 10−11 ρm . Otherwise, a slightly variant initial value of ρΛ would lead to a value of the ratio ρΛ /ρm\ndrastically different from the observed one. This is the so-called 'coincidence' problem. In addition, the ΛCDM model\nalso faces some observational challenges: there are mild evidences show that, the EOS of dark energy might evolve\nfrom w > −1 in the early stage to w < −1 in the current stage [5], which is expected to be confirmed by the future\nsensitive observations [6].\nSo, it is necessary to look for other candidates as the dark energy, especially the dynamical models. One possibility\nis proposing a canonical scalar field φ with the langrangian Lφ = φ̇2 /2 − V (φ), which is dubbed as the 'quintessence'\nmodels (see the review [7]). Similar to the inflationary field, when the potential term V (φ) is dominant, the EOS of\nthe quintessence field approaches to −1, i.e. Λ-like, and accounts for the observations. The most interesting is that,\nin [8], the authors introduced a kind of potential forms, such as V (φ) = M 4+α φ−α or V (φ) = M 4 [exp(Mpl /φ) − 1],\nwhich have the tracker solutions, i.e. the field φ tracked the evolution of the background components in the early\nuniverse. So they address the coincidence problem, i.e. removing the need to tune initial conditions in order for the\nmatter and dark energy densities to nearly coincide today. Although, this kind of models have been excluded by the\ncosmological observations, it provides the excellent possibility to naturally avoided the coincidence problems.\nHowever, the quintessence models also suffer from some dilemmas. The EOS of the quintessence models are in the\nrange −1 < w < 1. In order to obtain a EOS with w < −1, one always has to introduce the so-called 'phantom'\nfield, which includes the non-canonical negative kinetic terms [9][10]. However, the 'phantom' field lacks the strong\nphysical motivation, and also leads to the problem of quantum instabilities [11]. In [12], the authors also pointed\nthat, if w < −1 keeps, the universe shall face the 'big-rip' problem.\nIn addition to proposing the dynamical dark energy models, some efforts have been paid to modify the general\nrelativity (GR) [13], which can also speed-up the universe in the recent stage. However, it should be pointed that, any\nrevised GR should prepare to go through the strict solar system test [14], as well as to explain the various cosmological\nobservations, such as the CMB temperature and polarization anisotropies power spectra. In addition, to our view, the\ncurrent observations have not provided the strong reasons to answer: Why we should modify GR and how to modify\nit.\nIn this paper, we shall propose the Yang-Mills condensate (YMC) dark energy models, where, instead of the scalar\nfield, the quantum Yang-Mills field is considered as the candidate of dark energy component. Recently, the similar\nmodels are also discussed by a number of authors [15][16]. Different from the scalar field models, the Yang-Mills\nfields are the indispensable cornerstone to particle physics, gauge bosons have been observed. There is no room for\nadjusting the form of effective Yang-Mills Lagrangian as it is predicted by quantum corrections according to field\ntheory. In this review, we shall firstly introduce physical motivations of the YMC dark energy models in Section II.\nIn Section III, we simply introduce and discuss the Lagrangian of effective quantum Yang-Mills field.\nAs the main part of this paper, in Section IV, we apply the YMC into the cosmology as the candidate of dark\nenergy, and investigate the cosmic evolution of the various components, especially the evolution of dark energy. We\nfind the excellent characters of this kind of models. Different from the quintessence models, both the EOS wy > −1\nand wy < −1 can be naturally realized. In the free YMC dark energy models, wy → 1/3 in the early stage and\ntracked the evolution of radiation component. Only in the recent stage, wy rolls to the critical state with wy = −1,\ni.e. Λ-like, and accounts for the observations. This feature is independent of the choice of the initial condition, so\nthe coincidence problem is naturally avoided. We also find that, if the possible interaction between YMC and dust\ncomponents is considered, the late time attractor solution can exist, where the EOS of YMC naturally runs from\nwy → 1/3 to the the phantom-like attractor state, i.e. wy < −1. However, the total effective EOS is wtot = −1 in the\nattractor solution, and the so-called 'big-rip' problem is also avoided. We should pointed that, these new features are\n2\n\n\fall independent of the interaction forms. In Section V, we calculate the statefinder and Omdiagnostics for the YMC\ndark energy models, which are helpful to differentiate the YMC models from the other dark energy models from the\nobservations.\nSection VI is contributed as a summary of this paper.\nThroughout this paper, we will work with unit in which c = ~ = kB = 1.\nII.\n\nPHYSICAL MOTIVATION\n\nThe introduction of the quantum effective YMC into cosmology [17] has been motivated by the fact that the\nSU (3) YMC has given a phenomenological description of the vacuum within hadrons confining quarks, and yet at\nthe same time all the important properties of a proper quantum field are kept, such as the Lorentz invariance, the\ngauge symmetry, and the correct trace anomaly [18] [19]. Quarks inside a hadron would experience the existence\nof the Bag constant, B, which is equivalent to an energy density B and a pressure −B. So quarks would feel an\nenergy-momentum tensor of the vacuum as Tμν = Bdiag(1, −1, −1, −1). This non-trivial vacuum has been formed\nmainly by the contributions from the quantum effective YMC, and from the possible interactions with quarks. Our\nthinking has been that if the vacuum inside a hadron is filled with the quantum effective YMC, what if the vacuum\nof the universe as a whole is also filled with some kind of YMC.\nGauge fields play a very important role in, and are the indispensable cornerstone to, particle physics. All known\nfundamental interactions between particles are mediated through gauge bosons. Generally speaking, as a gauge field,\nthe YMC under consideration may have interactions with other species of particles in the universe. However, unlike\nthose well known interactions in QED, QCD, and the electro-weak unification, here at the moment we do not yet\nhave a model for the details of the microscopic interactions between the YMC and other particle. Therefore, in this\npaper on the dark energy model based on the quantum effective YMC, we will adopt a simple description of the\npossible interactions between the YMC and other cosmic particles, in addition to the simplest model with free YMC\ncomponent. We will investigate in these models the cosmic evolution of the universe from the radiation-dominated\nera up to the present.\nIII.\n\nYANG-MILLS FIELD MODEL\n\nIn the effective YMC dark energy model, the effective Yang-Mills field Lagrangian is given by [18][20, 21]:\nLeff =\n\n\u0001\n1\nbF ln F/κ2 − 1 ,\n2\n\n(1)\n\na\nwhere κ is the renormalization scale of dimension of squared mass, F ≡ −(1/2)Fμν\nF aμν plays the role of the order\n2\nparameter of the YMC. The Callan-Symanzik coefficient b = (11N − 2Nf )/24π for SU (N ) with Nf being the number\nof quark flavors. For the gauge group SU (2) considered here, one has b = 11/12π 2 when the fermion's contribution\nis neglected. For the case of SU (3) the effective Lagrangian in (1) leads to a phenomenological description of the\nasymptotic freedom for quarks inside hadrons [18]. It should be noted that the SU (2) Yang-Mills field is introduced\nhere as a model for the cosmic dark energy, in may not be directly identified as the QCD fields, nor the weakelectromagnetic unification gauge fields.\nAn explanation can be given for the form in (1) as an effective Lagrangian up to 1-loop quantum correct [18, 19, 22].\nA classical SU (N ) Yang-Mills field Lagrangian is L = F/2g02 , where g0 is the bare coupling constant. As is known.\nwhen 1-loop quantum corrections are included, the bare coupling g0 will be replaced by a running one g as the following\n[23], g02 → g 2 = 2/(b ln(k 2 /k02 )), where k is the momentum transfer and k0 is the energy scale. To build up an effective\ntheory [18, 19, 22], one may just replace the momentum transfer k 2 by the field strength F in the following manner:\nln(k 2 /k02 ) → 2 ln |F/eκ2 |, yielding equation (1). We would like to point out that the renormalization scale κ is the\nonly parameter of this effective Yang-Mills model, and its value should be determined by comparing the observations.\nIn contrast to the scalar field dark energy models, the YMC Lagrangian is completely fixed by quantum corrections\nup to 1-loops, and there is no room for adjusting its functional form. This is an attractive feature of the effective YMC\ndark energy model. We should mention that, the YMC dark energy models including 2-loop and 3-loop quantum\ncorrects are also discussed in the recent papers [24][25]. It was found that, these more complicated models have the\nexactly same characters with the 1-loop models. So in this paper, we mainly focus on the 1-loop models with the\nLagrangian in (1).\n\n3\n\n\fIV.\n\nYMC AS DARK ENERGY\n\nLet us work in the flat Friedmann-Lemaitre-Robertson-Walker (FLRW) universe, which is described by\nds2 = dt2 − a2 (t)δij dxi dxj = a2 (τ )[dτ 2 − δij dxi dxj ],\nwhere t time and τ time are related by cdt = adτ . Considering the simplest case with only the YMC in the universe,\nwhich minimally coupled to the gravity, the effective action is,\n\u0015\n\u0014\nZ\n√\nR\n(2)\n+ Leff d4 x.\n−g −\nS=\n16πG\nHere, g is the determinant of the metric gμν . R is the scalar Ricci curvature, and Leff is the effective Lagrangian\nof YMC, described by Eq. (1). By variation of S with respect to the metric g μν , one obtains the Einstein equation\nGμν = 8πGTμν , where the energy-momentum tensor of YMC is given by\nTμν =\n\n3\nX\ngμν a aσδ\na\nF F\n+ ǫFμσ\nFνaσ .\n2 σδ\n4g\na=1\n\n(3)\n\nThe dielectric constant is defined by ǫ ≡ 2∂Leff /∂F . In the one-loop order, it is given by\nǫ = b ln F/κ2 .\n\n(4)\n\nThis energy-momentum tensor (3) is the sum of three different energy-momentum tensors of the vectors, Tμν =\nP (a)\nTμν , neither of which is of prefect-fluid form. Here we assume the gauge fields are only the functions of time\na\nt, and Aμ = 2i σa Aaμ (t) (here σa are the Pauli's matrices) are given by A0 = 0 and Aai = δia A(t). Thus, we will find\nthat, the total energy-momentum tensor Tμν is homogeneous and isotropic.\nDefine the Yang-Mills field tensor as usual:\na\nFμν\n= ∂μ Aaν − ∂ν Aaμ + f abc Abμ Acν ,\n\n(5)\n\nwhere f abc is the structure constant of gauge group and f abc = ǫabc for the SU (2) case. This tensor can be written\nin the form with the electric and magnetic field as\n\nF aμν\n\n\n0\nE1 E2 E3\nB3 −B2 \n −E1 0\n=\n.\n−E2 −B3 0\nB1 \n−E3 B2 −B1 0\n\n\n(6)\n\nIt can be easily found that E12 = E22 = E32 , and B12 = B22 = B32 . Thus F has a simple form with F = E 2 − B 2 , where\nP3\nP3\nE 2 = i=1 Ei2 and B 2 = i=1 Bi2 . In this case, each component of the energy-momentum tensor is\n(a)\n\n1\nǫ\n(ǫ − b)(B 2 − E 2 )δμ0 + E 2 δμ0 ,\n6\n3\n1\nǫ\nǫ\n= (ǫ − b)(B 2 − E 2 )δji + E 2 δji δja − B 2 δji (1 − δja ).\n6\n3\n3\n\nTμ0 =\n\n(a)\n\nTji\n\n(7)\n(8)\n\nAlthough this tensor is not isotropic, its value along the j = a direction isP\ndifferent from the ones along the directions\n3\nperpendicular to it. However, the total energy-momentum tensor Tμν = a=1 (a) Tμν has isotropic stresses, and the\ncorresponding energy density and pressure are given by\nρy =\n\n1\n1\n1\n1\nǫ(E 2 + B 2 ) + b(E 2 − B 2 ), py = ǫ(E 2 + B 2 ) − b(E 2 − B 2 ).\n2\n2\n6\n2\n\n(9)\n\nIn this paper, for simplicity, we only discuss the pure 'electric' case, F = E 2 . This is a typical consideration, since in\nthe expanding universe, a given 'magnetic' component of Yang-Mills field decreases quite rapidly, and the Yang-Mills\nfield becomes the 'electric' type [26]. The energy density and pressure of YMC are reduced to\nρy =\n\n\u0011\nE2 \u0010 ǫ\nE2\n(ǫ + b), py =\n−b .\n2\n2 3\n4\n\n\fIt is convenient to introduce a dimensionless quantity y ≡ ǫ/b = ln |F/κ2 |. So the quantities ρy and py can be\nrewritten as\nρy =\n\n1\n1 2\nbκ (y + 1)ey , py = bκ2 (y − 3)ey .\n2\n6\n\n(10)\n\nOne sees that, to ensure that energy density ρy be positive in any physically viable model, the allowance for the\nquantity y should be y > −1, i.e. F > κ2 /e ≃ 0.368κ2. The EOS of the YMC is\nwy ≡\n\npy\ny−3\n=\n.\nρy\n3y + 3\n\n(11)\n\nBefore setting up a cosmological model, the EOS wy itself as a function of F is interesting. At the state with F = κ2 ,\nwhich is called critical point, one has y = 0 and the YMC has an EOS of the cosmological constant with wy = −1.\nAround this critical point, F < κ2 gives y < 0 and w < −1, and F > κ2 gives y > 0 and w > −1. So in the YMC\ndark energy models, EOS with w > −1 and w < −1 all can be naturally realized. On the other hand, in the high\nenergy scale with F ≫ κ2 , one finds that the YMC exhibits an EOS of radiation with wy = 1/3. In the follows, we\nwill detailed show that the YMC was evolving from the state with wy = 1/3 to wy = −1 (or even to wy < −1) in\nthe expanding universe. This is the main context in this paper. In addition, the characteristic statefinder parameters\nand the perturbations of the YMC dark energy is also discussed in [27, 28][29], which are helpful to distinguish the\nYMC model from other dark energy models.\nAs is known, an effective theory is a simple representation for an interacting quantum system of many degrees of\nfreedom at and around its respective low energies. Commonly, it applies only in low energies. However, it is interesting\nto note that the YMC model as an effective theory intrinsically incorporates the appropriate states for both high and\nlow temperature. As has been shown, the same expression in (11) simultaneously gives py ∼ −ρy at low energies,\nand py → ρy /3 at high energies. Therefore, the model of effective YMC can be used even at higher energies than the\nrenormalization scale κ.\nA.\n\nFree YMC models\n\nLet us discuss the cosmological model, which filled with three kinds of major energy components, the dark energy, the\nmatter, including both baryons and dark matter, and the radiation. Here, the dark energy component is represented\nby YMC, and the matter component is simply described by a non-relativistic dust with negligible pressure, and the\nradiation component consists of the photons and possibly other particles, such as the neutrino, if they are massless.\nSince the universe is assumed to be flat, the sum of the fraction densities is Ωy + Ωm + Ωr = 1, where the fractional\nenergy densities are Ωy ≡ ρy /ρtot , Ωm ≡ ρm /ρtot , Ωr ≡ ρr /ρtot , and the total energy density is ρtot ≡ ρy + ρm + ρr .\nThe overall expansion of the universe is determined by the Friedmann equations:\n\u0012 \u00132\nȧ\n8πG\n=\n(ρy + ρm + ρr ),\n(12)\na\n3\n4πG\nä\n=−\n(ρy + 3py + ρm + ρr + 3ρr ),\n(13)\na\n3\nwhere and what follows, the superscript dot denote the d/dt. These three components of energy contribute to the\nsource on the right-hand side of the equations. We should notice that, pr = ρr /3. In this subsection, we shall\nassume there is no interaction between these three components. The dynamical evolutions of the three components\nare determined by their equations of motion, which can be written as equations of the conservation of energy,\nȧ\nρ̇y + 3 (ρy + py ) = 0,\na\nȧ\nρ̇m + 3 ρm = 0,\na\nȧ\nρ̇r + 3 (ρr + pr ) = 0.\na\n\n(14)\n(15)\n(16)\n\nAs is known, Eq. (13) is not independent and can be derived from Eqs. (14), (15), (16) and (12). From Eqs. (15)\nand (16), we can obtain the evolutions of the matter and radiation components, ρm ∝ a−3 and ρm ∝ a−4 .\nNow, let us focus on the evolution of YMC. Inserting (10) into (14), we can obtain the following simple relation,\nyey/2 ∝ a−2 ,\n5\n\n(17)\n\n\f-5\n\n0.4\n\n-10\n-15\n\nra\nd\n\nn\n\n0.0\n\n-30\n-35\n-40\n\nY\nM\nC\n\n-45\n\nY\nM\nC\nw\n\nit\n\nh\n\nr\nb\n\n-50\n\n-2\n\nYMC with r =10\nb\n\n=\n1\n0\n\n-2\n\nw\n\nEOS: w\n\n4\n\n( GeV\n10\n\no\n\ner\nz = 0\n\nlog\n\nm\nat\nt\n\n-25\n\n0.2\n\nia\nti\n\nit\n\nh\n\n-0.2\n\nw =- 1/ 3\n\nz = 0\n\n)\n\n-20\n\nw =1/ 3\n\n-0.4\n\nr\n\n=\nb\n10\n\n-2\n\n-0.6\n\n-20\n\nYMC with r =10\n\n0\n\nb\n\n-0.8\n\n-55\n-60\n\n-1.0\n\nw =- 1\n\n-65\n10\n\n9\n\n8\n\n7\n\n6\n\n5\n\n4\n\nlog\n\n10\n\n3\n\n2\n\n1\n\n0\n\n-1\n\n10\n\n-2\n\n9\n\n8\n\n7\n\n6\n\n5\n\n4\n\nlog\n\n( z + 1)\n\n10\n\n3\n\n2\n\n1\n\n0\n\n-1\n\n-2\n\n( z + 1)\n\nFIG. 1: In the free YMC dark energy models, the evolution of the YMC energy density (left panels) and EOS (right panels)\nfor the models with different initial conditions.\n\nwhere the coefficient of proportionality in the above depends on the initial condition. At the early stages, a → 0,\nEq. (17) leads to y ≫ 1, and Eq. (11) gives wy → 1/3, so the YMC behaves as the radiation component. With\nthe expansion of the universe, the value of y runs to the critical state of y = 0, and the EOS goes to wy = −1. So,\nin the late stage of the universe, the YMC behaves as the cosmological constant. This is one of the most attractive\ncharacter of the YMC models. Around the critical point with y = 0, Eq.(17) yields y ∝ a−2 , and the EOS of YMC is\nwy + 1 ≃ 4y/3 ∝ a−2 . The YMC can achieve the states of wy > −1 and wy < −1, but it can not cross over −1, just\nlike in the scalar models [30].\nWe should notice that, the relation in (17) can also be derived by the effective Yang-Mills equations. By variation\nof the action S with respect to gauge field Aaμ , we can obtain the Yang-Mills equations, which are\n∂μ (a4 ǫ F aμν ) + f abc Abμ (a4 ǫ F cμν ) = 0.\n\n(18)\n\nThe ν = 0 component of which is an identity, and the ν = 1, 2, 3 spatial components can be reduced to ∂τ (a2 ǫE) = 0.\nAt the critical point (ǫ = 0), this equation is an identity. When ǫ 6= 0, this equation has an exact solution as (17) [21].\nNow, let us fix the value of κ, the only parameter in the model. At the present time, the YMC energy density is\nρy =\n\nbE 2\nbκ2\n(y + 1) ≃\n,\n2\n2\n\n(19)\n\nand, as the dark energy, it should be Ωy ρtot , where the present total energy density in the universe ρtot ≈ 8.099 h2 ×\n10−11 eV4 . We choose Ωy = 0.73 as has been observed, yielding\nκ = 3.57 h × 10−5 eV2 .\n\n(20)\n\nThis energy scale is low compared to typical energy scales in particle physics, such as the QCD and the weakelectromagnetic unification. This is the reason, why the SU (2) Yang-Millls field introduced in this paper cannot be\ndirectly identified as the the QCD gluon fields, nor the weak-electromagnetic unification gauge fields.\nTo be more specific about how the YMC evolves in the expanding universe, we look at an early stage when the Big\nBang nucleosynthesis (BBN) processes occur around a redshift z ∼ 1010 with an energy scale ∼ 1MeV. To see how\n6\n\n\fExcluded by BBN\n\n0\n\nExclude by BBN\n\n0\n\n-4\n\n-5\n\n)\nb\n\n)\n\n( r\n\n10\n\nb\n\nlog\n\n10\n\nlog\n\neq\n\n( r\n\nz = z\n\n-8\n\n-10\n\n-12\n\n-15\n-16\n\n-20\n\n-20\n-10\n\n-9\n\n-8\n\n-7\n\n-6\n\nlog\n\n10\n\n-5\n\n-4\n\n-3\n\n-2\n\n1\n\n-1\n\n2\n\n3\n\nlog\n\n( w + 1 )\n\n10\n\n0\n\n4\n\n5\n\n( z )\nt\n\nFIG. 2: Left panel: The present EOS of the YMC w0 depends on the initial value rb . Right panel: The transition redshift zt\ndepends on the initial value rb . In both panels, the shadow region has been excluded by the observation of BBN.\n\nthe evolution of ρy depends the the initial condition, we introduce the ratio of energies of the two components\nrb ≡\n\nρy\nρr\n\n,\n\n(21)\n\nz=1010\n\nwhere ρr is the radiation energy density. We consider rb < 1, i.e. the YMC is subdominant to the radiation component\ninitially. Of course, the YMC evolves differently for different initial values of rb . Nevertheless, we will see that, as the\nresult of evolution, the present universe is always dominated by the YMC Ωy ∼ 0.73 for a very wide range of initial\nvalues rb .\nNow we use the exact solution (17) to plot the evolution of ρy as a function of the redshift z in Fig. 1 (left panel).\nAs specific examples, here we take rb = 10−2 , and rb = 10−20 . In comparison, also plotted are the energy densities\nof radiation, and of matter. It is seen that, in the early stages, ρy decreases as ρy ∝ a−4 . So the YMC density is\nsubdominant and tracks the radiation, a scaling solution. The corresponding EOS of Yang-Mills field is wy ≃ 1/3\nshown in Fig. 1 (right panel). At late stages, with the expansion of the universe, a → ∞, y decreases to nearly zero,\nand wy → −1 asymptotically. Moreover, this asymptotic region is arrived at some redshift z before the present time,\nand this z has different values for different initial values of rb . For smaller rb , the transition redshift is larger (seen in\nFig. 1), and the transition happens earlier. Once the asymptotic region is achieved, the density of the YMC levels off\nand remain a constant forever, like a cosmological constant. We have also checked that the present value Ωy ∼ 0.73 is\nalso the outcome of the cosmic evolution for any value of rb in the very wide range (10−20 , 10−2 ). So the coincidence\nproblem do not exist in the YMC model.\nThe present EOS of the YMC w0 is nearly −1. Fig. 2 (left panel) plots the dependence of the present EOS w0 on\nthe initial condition rb . The function log10 (rb ) versus log10 (w0 + 1) is nearly linear: a smaller rb leads to a smaller\nw0 . For a value rb = 10−2 , one has w0 = −0.99. For a value rb = 10−20 , w0 would be −1 accurately up to one in\n1011 . Therefore, at present the YMC is very similar to the cosmological constant.\nThe solution in Eq.(17) can converted into the following form\n\u0015\n\u0014\nr\ny\ny − y0\n− 1,\n(22)\nexp\nz=\ny0\n4\nwhere y0 is the value of y at z = 0, depending on the initial value rb . For a fixed y0 , this formula tells a one-one\nrelation between the EOS (through y) and the corresponding redshift z. As is seen from Fig. 1, the transition of ω\n7\n\n\ffrom 1/3 to −1 occurs during a finite period of time, instead of instantly. To characterize the time of transition, we\nuse zt to denote the redshift when ω = −1/3, i.e. y = 1, as given by Eq.(11). This is, in fact, the time when the\nstrong energy condition begins to be violated, i.e., ρy + 3py ≤ 0. Then\nr\n\u0015\n\u0014\n1 − y0\n1\n− 1.\n(23)\nexp\nzt =\ny0\n4\nTherefore, this gives a function zt = zt (rb ). Fig. 2 (right panel) shows how the transition redshift zt depends on\nthe ratio rb . Interestingly, this transition can occur before, or after the radiation-matter equality (zeq = 3454). This\nfeature is different from the tracked quintessence models in which transition occurs during the matter dominated era\n[8]. A larger rb leads to a smaller zt . For example, rb = 10−2 leads to zt ≃ 12.4 ≪ zeq , and the transition occurs in\nthe matter dominated stage, and rb = 10−20 leads to zt ≃ 5.0 × 105 ≫ zeq , and the transition occurs in the radiation\ndominated stage.\nThe value of rb cannot be chosen to arbitrarily large. In fact, there is a constraint from the observation result\nof the BBN. As is known, the presence of dark energy during nucleosynthesis epoch will speedup the expansion,\nenhancing the effective species Nν of neutrinos [31]. The latest analysis gives a constrain on the extra neutrino species\nδNν ≡ Nν − 3 < 1.60 [31]. Here in our model, the dark energy is played by the YM field. By a similar analysis, the\nν /4\nratio rb is related to δNν through rb = 7δN\n10.75 . This leads to an upper limit rb < 0.26, the present EoS w0 < −0.94\nby Fig. 2 (left panel), and the transition redshift zt > 5.8 by Fig. 2 (right panel). The range of initial conditions\nrb ∈ (10−20 , 10−2 ) that we have taken satisfies this constraint.\nB.\n\nCoupled YMC models\n\nIn this subsection, we shall generalize the original YMC dark energy model to include the interaction between the\nYMC and dust matter. We should mention that, the possible interaction between YMC and radiation component may\nalso exist, which has been discussed in [32]. (The similar models on the scalar field dark energy have been discussed\nby a number of authors (see [33] for instant)). In this section, we assume the YMC dark energy and background\nmatter interact through an interaction term Q. Thus the equations of the conservation of energy in (14) and (15)\nshould be changed into\nȧ\nρ̇y + 3 (ρy + py ) = −Q,\na\nȧ\nρ̇m + 3 ρm = Q,\na\n\n(24)\n(25)\n\nand the equation for radiation in (16) is still held. The sum of Eqs. (24) and (25) guarantees that the total energy\nof YMC and dust matter is still conserved. It is worth noting that the free Yang-Mills equation in (18) is not\nsatisfied when Q 6= 0. In the natural unit, the interaction term Q has the dimension of [energy]5 . The coupling Q is\nphenomenological, and their specific forms will be addressed later. When Q > 0, the YMC transfers energy into the\nmatter, and this could be implemented, for instance, by the processes with the YMC decaying into pairs of matter\nparticles. On the other hand, when Q < 0, the matter transfers energy into the YMC. Note that, once Q is introduced\nas above, it will bring another new parameters in the models, in addition the free parameter κ.\nWe introduce the following dimensionless variables, rescaled by the critical energy density bκ2 /2 of the YMC,\nx≡\n\n2ρm\n2Q\n, f≡ 2 ,\nbκ2\nbκ H\n\n(26)\n\nwhere f is the function of x and y. By the help of the definition of y, the evolution equations (24) and (25) can be\nrewritten as a dynamical system, i.e.\n4y\nf (x, y)\n,\n−\n2 + y (2 + y)ey\nx′ = −3x + f (x, y).\ny′ = −\n\n(27)\n(28)\n\nHere, a prime denotes derivative with respect to the so-called e-folding time N ≡ ln a. The fractional energy densities\nof dark energy and background matter are given by\nΩy =\n\nx\n(1 + y)ey\n, and Ωm =\n.\n(1 + y)ey + x\n(1 + y)ey + x\n8\n\n(29)\n\n\fBefore discussing the specific form of the interaction term Q, let us first investigate the general feature of this\ndynamical system, described by (27) and (28). We can obtain the critical point (yc , xc ) of the autonomous system by\nimposing the conditions yc′ = x′c = 0. From the equations (27) and (28), we obtain that the critical state satisfies the\nfollowing simple relations\n3xc = f (xc , yc ),\n3xc = −4yceyc .\n\n(30)\n(31)\n\nSo we can obtain the critical state (yc , xc ) by solving these two equations. In order to study the stability of the critical\npoint, we substitute linear perturbations y → yc + δy and x → xc + δx about the critical point into dynamical system\nequations (27) and (28) and linearize them. Thus, two independent evolutive equations are derived,\n\u0013\n\u0013\u0012\n\u0013 \u0012\n\u0012\n\u0012 ′\u0013\nδy\nG,y + R,y R,x\nδy\nδy\n,\n=\n≡\nM\nδx\nf,y\nf,x − 3\nδx\nδx′\nwhere R,y ≡ ∂R/∂y at (y, x) = (yc , xc ). The definitions of R,x , f,y , f,x and G,y are similar. The functions G and R\nare defined by\nG ≡ G(y) = −\n\n4y\n,\n2+y\n\nR ≡ R(x, y) = −\n\nf (x, y)\n,\n(2 + y)ey\n\nwhich are used for the simplification of the notation. The two eigenvalues of the coefficient matrix M determine\nthe stability of the corresponding critical point. The critical point is an attractor solution, which is stable, only if\nboth the these two eigenvalues are negative (stable node), or real parts of these two eigenvalues are negative and the\ndeterminant of the matrix M is negative (stable spiral).\nHere we discuss some general features of the attractor solutions, regardless the special form of the interaction term\nQ. From the expression (31), we find that xc = −(4/3)yc eyc . Substitute this into the formula (29), one obtains\nΩy =\n\n3 + 3yc\n(yc + 1)eyc\n=\n.\n(yc + 1)eyc + xc\n3 − yc\n\n(32)\n\nSince 0 ≤ Ωy ≤ 1, this formula follows a constraint of the critical point\n− 1 ≤ yc ≤ 0.\n\n(33)\n\nFrom the formulae (11) and (32), we find a simple, but interesting relation,\nΩy wy = −1.\n\n(34)\n\nThis relation is held for all attractor solutions, independent of the special form of the interaction. Since the value of\nΩy is smaller than or equal to unity in the attractor solution, we obtain that\nwy ≤ −1.\n\n(35)\n\nThis means that, the EOS of the YMC dark energy must be smaller than or equal to −1, i.e. phantom-like or Λ-like.\nSince in the early universe, the value of the order parameter of the YM field F is much larger than that of κ2 , i.e.\ny ≫ 1, the YM field is a kind of radiation component. However, in the late attractor solution, the dark energy\nis phantom-like or Λ-like. So the phantom divide must be crossed in the former case, which is different from the\ninteracting quintessence models.\nIt is interesting to investigate the total EOS of the YMC and dust matter, which determines the finial fate of the\nuniverse, when the radiation becomes negligible. The total EOS is defined by\nwtot ≡\n\nptot\npy + pm\n=\n= Ωy wy ,\nρtot\nρy + ρm\n\n(36)\n\nwhere pm = 0 is used. From the relation (34), we obtain that, in the attractor solution,\nwtot = −1.\n\n(37)\n\nThis result is also independent of the specific form of the interaction. So the universe is an exact de Sitter expansion,\nand the cosmic big rip is naturally avoided, although the YMC dark energy can be phantom-like.\nNow, let us discuss the evolution of the various components in the universe for some specific interaction models.\nIn this paper, we shall focus on the following three phenomenological interaction models: Q ∝ Hρy , Q ∝ Hρm and\nQ ∝ H(ρy + ρm ), separately. Some other phenomenological models have also been discussed in the papers [32, 34].\n9\n\n\f1.\n\nQ ∝ Hρy\n\nIn this case, we can write the function f (x, y) as the following form, f (x, y) = α(1 + y)ey . Of course, when α = 0.\nthe system returns to the model with free YMC dark energy. Here, we consider the simplest case with α being a\nnon-zero dimensionless constant. Thus, the dynamical equations in (27) and (28) becomes\nα(1 + y)\n4y\n−\n,\n2+y\n(2 + y)\nx′ = −3x + α(1 + y)ey .\ny′ = −\n\n(38)\n(39)\n\nObviously, the evolution of dust matter and YMC are influenced by the interaction by the function f (x, y). We\nexpect, when the fraction density of YMC was sub-dominant in the universe, the effect on the dust is small. Only in\nthe latest stage of the universe, where the YMC dark energy dominates the evolution of the universe, the effect of\ninteraction on the dust becomes important.\nThe critical point (yc , xc ) is obtained by imposing the condition yc′ = x′c = 0, which are\nyc = −\n\n4yc yc\nα\n, xc = −\ne ,\n4+α\n3\n\n(40)\n\nand the fractional energy density and the EOS of the YMC at this critical point are\nΩy = −\n\n3\n1\n=\n.\nwy\nα+3\n\n(41)\n\nThe constraint 0 ≤ Ωy ≤ 1 requires that α > 0 (note, we have set α 6= 0 throughout the discussion). In this condition,\nwe find that wy < −1 is satisfied. In order to keep this critical point being stable, i.e. (yc , xc ) is the attractor solution,\na constraint on α can be derived: α > −8, which is auto-satisfied when α > 0 is required. So the attractor solution\nrequires that the constraint on the coefficient being\nα > 0,\n\n(42)\n\nwhich follows that the EOS of YMC in this attractor solution must be negative. If we still require that, the fraction\ndensity of YMC is larger than the value at the present stage, i.e. Ωy > 0.73, the constraint on α becomes much tighter\n0 < α < 1.11.\nIn order to have a much clear picture for this system, let us study the evolution of the various components in the\nuniverse by adopting α = 0.5. We still choose the initial condition at the BBN stage, i.e. z = 1010 , where the value\nof x is chosen as xi = 1.8 × 10−29 to keep the present value of Ωy being Ωy = 0.73. For the YMC, we consider the\nfollowing two choices as the initial condition: i.e. yi = 60 and yi = 20. In the former case, we have Ωyi /Ωmi = 0.16,\nand in the latter case, we have Ωyi /Ωmi = 3 × 10−19 . Although, the difference between these two Ωyi /Ωmi cases is\nlarger than 17 orders. we will show that, these two models follow the similar present state of universe.\nWe should also fix the value of κ. In order to keep the present total energy density in the universe being ρtot ≃\n8.099h2 × 10−11 eV4 , we find the κ = 4.00h × 10−5 eV2 in both initial condiitons. If the Hubble constant h = 0.72 is\nadopted, we get κ = 2.88 × 10−5 eV2 . Again, we find the value of κ is much smaller than the typical energy scale in\nthe particle physics.\nIn Fig. 3 (left panel), we plot the evolution of various components in the universe. Note that, the evolution line for\ndust component covered each other in both initial cases, as well as the radiation component. Similar to the free YMC\nmodels (shown in the left panel in Fig. 1), in the early stage of the universe, the YMC was tracking the radiation,\nand it transfered to the attractor solution in the later stage. The smaller yi induces the earlier transfer. In the right\npanel of Fig. 3, we plot the evolution of EOS of YMC wy and the total EOS wtot . Note that, the evolution line wtot\ncovered each other in both initial cases. As expected, in the both initial conditions, in the early stage, wy → 1/3.\nIn the late stage, wy runs to the attractor solution with wy = −(α + 3)/3 with α = 0.5, i.e. wy → −7/6. In the\nintermedial stage, the EOS wy must cross the line with wy = −1. For the total EOS wtot , in the early stage, wtot → 0,\nwhere dust component is dominant than YMC. However, in the late stage, wtot → −1, which is consistent with the\nprevious discussions.\n\n10\n\n\f-5\n\n0.4\n\n-10\n-15\n\nra\nd\n\n)\n\ny\ni\n\n-45\n\n)\n\n-0.4\n\n-0.6\n\n(\n\ny\ni\n\n=\n2\n0\n\n-50\n\ni\n\nY\nM\nC\n\ner\n\n( y =20 )\n\n-40\n\n=\n6\n0\n\nEOS: w\n\n4\n\n( GeV\n\n(\n\n-35\n\nw\n-0.2\n\n-0.8\n\n)\n\ntot\n\nz = 0\n\n-30\n\nm\nat\nt\n\n0 )\ny =6\ni\nwy (\n\nY\nM\nC\n\n0.0\n\ny\n\n10\n\nn\n\n-25\n\nw\n\nlog\n\no\n\nz = 0\n\n-20\n\n0.2\n\nia\nti\n\nw = -1\n-1.0\n\n-55\n\n-1.2\n-60\n10\n\n8\n\n6\n\n4\n\nlog\n\n10\n\n2\n\n0\n\n-2\n\n10\n\n8\n\n( 1+ z )\n\n6\n\n4\n\nlog\n\n10\n\n2\n\n0\n\n-2\n\n( 1+ z )\n\nFIG. 3: In the coupled YMC dark energy models, the evolution of the YMC energy density (left panels) and EOS (right panels)\nfor the models with different initial conditions.\n\n2.\n\nQ ∝ Hρm\n\nNow, let us turn to the interaction cases with Q ∝ Hρm , which is equivalent to the form f (x, y) = βx. The\ndynamical equations in (27) and (28) becomes\nβx\n4y\n,\n−\n2 + y (2 + y)ey\nx′ = (β − 3)x.\ny′ = −\n\n(43)\n(44)\n\nIf we consider the simplest, where β is a constant, the equation (44) follows that x ∝ aβ−3 . From the definition of x,\nwe derive that ρm ∝ aβ−3 . When β = 0, the model returns to the free YMC cases, and ρm ∝ a−3 as usual. However,\nwhen β 6= 0, the evolution of the dust component is changed, which is conflicted with the evolution of dust in the\nstandard hot big-bang model. So it is dangerous to consider this kind of interaction term in the early stage of the\nuniverse.\nHowever, it is allowed to consider the form of Q ∝ Hρm as a kind of phenomenological model in the late stage of\nthe universe. The critical point (yc , xc ) of (43) and (44) is obtained by imposing the condition yc′ = x′c = 0, we find\nthese is no solution at all. So we conclude that, it is impossible to obtain an attractor solution for this kind of system.\n3.\n\nQ ∝ H(ρy + ρm )\n\nIn the end, let us discuss the another kind of phenomenological model, where Q ∝ H(ρy + ρm ) is satisfied. This is\nequivalent to set the form f (x, y) = γ[(y +1)ey +x]. We consider the simplest case, where γ is a non-zero dimensionless\nconstant. In the dark energy dominant stage, this system returns to the first case with Q ∝ Hρy , and in the dust\ndominant stage, it returns to the second case with Q ∝ Hρm . Similar to the second case, if we directly apply this\nsystem to the early universe, the evolution of dust would be changed, which is conflicted with the prediction of the\nstandard hot big-bang models.\nIn this paper, we also consider this interaction form as a kind of phenomenological model in the late stage of the\n\n11\n\n\f0.4\n\nQ=0.5H\n\ny\n\n1.004\n\n1.004\n\n0.3\n\nSteady State Universe\n\nLCDM\n\nr\n\nr\n\nLCDM\n\nLCDM\n\n1.000\n\nQ=0.5H\n\nOm(z)\n\nQ=0\n\n1.000\n\nQ=0\n\ny\n\n0.2\n\n0.996\n\n0.996\n\nQ=0.5H\n0.1\n\ny\n\nQ=0\n0.992\n\nCircles denote the current values\n\nCircles denote the current values\n\n0.992\n\n0.0\n-0.4\n\n-0.3\n\n-0.2\n\n-0.1\n\n0.0\n\n0.1\n\n-1.2\n\n-0.8\n\n-0.4\n\n0.0\n\n0.4\n\n0.8\n\n0.0\n\nq\n\ns\n\n0.5\n\n1.0\n\n1.5\n\n2.0\n\n2.5\n\nz\n\nFIG. 4: Left panel: The r − s diagram of the YMC models; Middle panel: The r − q diagram of the YMC models; The right\npanel: Om(z) diagnostic in the YMC models.\n\nuniverse. The dynamical equations in (27) and (28) becomes\nγ[(y + 1)ey + x]\n4y\n,\n−\n2+y\n(2 + y)ey\nx′ = −3x + γ[(y + 1)ey + x].\ny′ = −\n\n(45)\n(46)\n\nFrom the equations (30) and (31), we obtain the critical point\nyc =\n\n3γ\n4yc yc\n, xc = −\ne .\nγ − 12\n3\n\n(47)\n\nThe fractional energy density and the EOS of the YMC at this critical point are\nΩy = −\n\n3−γ\n1\n=\n.\nwy\n3\n\n(48)\n\nThe constraint of 0 ≤ Ωy ≤ 1 requires that 0 < γ ≤ 3. In order to keep this critical point being stable, i.e. (yc , xc ) is\nthe attractor solution, another constraint of γ can be derived: γ > −120/31, which is auto-satisfied when 0 < γ ≤ 3\nis required. So the attractor solution requires that the constraint on the coefficient being\n0 < γ ≤ 3,\n\n(49)\n\nwhich follows that, the EOS of YMC in this attractor solution must be negative. If we still require that, the fraction\ndensity of YMC is larger than the value at the present stage, i.e. Ωy > 0.73, the constraint on α becomes much tighter\n0 < γ < 0.81.\nV.\n\nSTATEFINDER AND Om DIAGNOSIS IN THE YMC MODELS\n\nIn this section, we shall present the way to discriminate between the YMC models and the other dark energy\nmodels. In the previous works [35][36], the authors suggested to use the so-called \"statefinder\" {r, s} pair and Om\n12\n\n\fdiagnostics. Here, we shall also apply the statefinder diagnosis into the YMC models. The similar discussion can be\nfound in the previous works [27][25][28][37].\nThe statefinder diagnostic pair {r, s} is defined as\n...\na\nr−1\nr≡\n, s≡\n,\n(50)\naH 3\n3(q − 1/2)\nwhere q = −ä/(aH 2 ) is the deceleration parameters. r forms the next step in the hierarchy of geometrical cosmological\nparameters beyond H and q, and s is a linear combination of r and q. Apparently, the statefinder parameters depends\nonly on scale factor a and its derivatives, and thus it is a geometrical diagnostic. These parameters can also been\nexpressed in terms of ρtot and ptot as follows\n\u0012\n\u0013\nρtot + ptot ṗtot\n3ptot\n9(ρtot + ptot )ṗtot\n1\n, s=\n.\n(51)\n1+\n, r =1+\nq=\n2\nρtot\n2ρ̇tot ptot\nptot\nρ̇tot\nBy using Eqs. (24) and (25), we plot the trajectories of (r, s) and of (r, q) in Fig. 4 from the redshift z = 10, where\nwe have considered two cases with Q = 0 and Q = 0.5Hρy . The arrows along the curves indicate the direction of\nevolution. In both cases, we have chosen the initial condition at the redshift z = 3454, where the densities of matter\nand radiation equate to each other. We choose the initial condition to make the Ωy = 0.01 at this high redshift.\nFrom this figure, we find that, the model with different interaction terms have the difference in both (r, s) and (r, q)\ntrajectories. However, in the low redshift (z < 10), especially when z ∼ 0, the trajectories in both models become\nquite close to those of the ΛCDM model. However, we should also mention that, the trajectories of the statefinder\nshows in this figure are quite different from the other dark energy models, such as the decaying vacuum model, the\nQuintessence models, the K-essence models (see for instant [37] ). In order to break the degeneracy between the YMC\nmodels and the ΛCDM models, let us consider the Om diagnostic, which is defined as\nOm(x) =\n\nh2 (x) − 1\n,\nx3 − 1\n\n(52)\n\nwhere x ≡ (1 + z), and h(x) ≡ H(x)/H0 . Thus Om involves only the first derivative of the scale factor through the\nHubble parameter and is easier to reconstruct from the observational data. For the ΛCDM model, it is simple, i.e.\nOm(x) = Ωm , independent of the redshift. For YMC model, we plot Om as a function of z in the Fig.4 (right panel).\nIt is interesting to find that, for either model, Om is nearly a constant at the low redshift. For the model without\ninteraction, as expected, Om ≃ 0.27, very close to that of ΛCDM models. However, for the model with Q = 0.5Hρy ,\nOm = 0.15, which is helpful to differentiate the coupled YMC models from the ΛCDM model.\nVI.\n\nCONCLUSION\n\nIn order to answer the observed accelerating expansion of the universe in the present stage, we introduce the quantum\nYang-Mills condensate dark energy models. Different from the general scalar field models, the quantum Yang-Mills\nfields are the indispensable cornerstone to particles, and the Lagrangian of the Yang-Mills field is predicted by quantum\ncorrections according to field theory.\nIn this paper, we review the main characters of the YMC dark energy models, where both free YMC model and\npossible coupled YMC models are considered. In all these models, the EOS of YMC is close to wy = 1/3 in the early\nstage, and tracked the evolution of radiation components. In the late stage, the value of wy runs to the attractor\nsolution with wy = −1 for the free YMC model, or with wy < −1 for the coupled YMC models. This naturally\nexplains the observations. The present state of the universe is independent of the initial state of Yang-Mills field,\nand the coincidence problem is naturally avoided. In the coupled YMC models, not only the state of wy < −1 can\nbe naturally realized, mildly suggested by observations, but also the 'big-rip' problem is auto-avoided. The most\nimportance we should mention is that, as a dynamic dark energy model motivated by quantum effective YM field\nLagrangian, all the YM models based upon 1-loop, 2-loop, and 3-loop quantum corrections, respectively, have similar\ndynamic behaviors. That is, the main properties of YM model for dark energy remain stable when the number of\nloops for quantum corrections increases up to 3-loop.\nHowever, in all the models, the fine-tunning problem still exists, i.e. the value of κ ∼ 10−5 eV2 , which is too low\ncomparing with the typical scales in particle physics. We should notice that, this problem exists in nearly all the dark\n\n13\n\n\fenergy models, which may suggest a new physics at this low energy scale.\n\n[1] M. Kowalski, et al. (2008). Improved Cosmological Constraints from New, Old and Combined Supernova Datasets. Astrophysical Journal, 686, 749. [arXiv:0804.4142 ]\n[2] E. Komatsu, et al. (2009). Five-Year Wilkinson Microwave Anisotropy Probe (WMAP) Observations: Cosmological Interpretation. Astrophysical Journal Supplement Series, 180, 330. [arXiv:0803.0547]\n[3] M. Tegmark, et al. (2006). Cosmological Constraints from the SDSS Luminous Red Galaxies. Physical Review D, 74,\n123507. [astro-ph/0608632]\n[4] T. Padmanabhan, (2006). Dark Energy: Mystery of the Millennium. Albert Einstein Century International Conference,\n861, 179. [astro-ph/0603114]\n[5] D. Huterer, & A. Cooray, (2005). Uncorrelated Estimates of Dark Energy Evolution. Physical Review D, 71, 023506.\n[astro-ph/0404062]\n[6] A. Albrecht, et al. (2006). Report of the Dark Energy Task Force. arXiv:astro-ph/0609591.\n[7] E. J. Copeland, M. Sami, & S. Tsujikawa, (2006). Dynamics of Dark Energy. International Journal of Modern Physics D,\n15, 1753. [hep-th/0603057]\n[8] I. Zlatev, L. Wang, & P. J. Steinhardt, (1999). Quintessence, Cosmic Coincidence, and the Cosmological Constant. Physical\nReview Letters, 82, 896. [astro-ph/9807002]\n[9] R. R. Caldwell, (2002).A Phantom Menace? Cosmological Consequences of a Dark Energy Component with Super-negative\nEquation of State. Physics Letters B, 545, 23. [astro-ph/9908168]\n[10] B. Feng, X. L. Wang, & X. M. Zhang, (2005). Dark Energy Constraints from the Cosmic Age and Supernova. Physics\nLetters B, 607, 35; [astro-ph/0404224]\nW. Zhao, & Y. Zhang, (2006). Quintom models with an equation of state crossing -1. Physical Review D, 73, 123509.\n[astro-ph/0604460]\n[11] S. M. Carroll, M. Hoffman, & M. Trodden, (2003). Can the Dark Energy Equation-of-state Parameter w Be Less Than -1?\nPhysical Review D, 68, 023509. [astro-ph/0301273]\n[12] Caldwell, R. R.; Kamionkowski, M. & Weinberg, N. N. (2003). Phantom Energy and Cosmic Doomsday. Physical Review\nLetters, 91, 071301. [astro-ph/0302506]\n[13] S. M. Carroll, V. Duvvuri, M. Trodden & M. S. Turner, (2004). Is Cosmic Speed-Up Due to New Gravitational Physics?\nPhysical Review D, 70, 043528; [astro-ph/0306438]\nS. M. Carroll, et al. (2005). The Cosmology of Generalized Modified Gravity Models. Physical Review D, 71, 063513.\n[astro-ph/0410031]\n[14] T. Chiba, T. L. Smith, & A. L. Erickcek, (2007). Solar System Constraints to General f(R) Gravity. Physical Review D,\n75, 124014. [astro-ph/0611867]\n[15] C. Armendariz-Picon, (2004). Could Dark Energy Be Vector-like? Journal of Cosmology and Astroparticle Physics, 0407,\n007; [astro-ph/0405267]\nH. Wei & R. G. Cai, (2006). Interacting Vector-like Dark Energy, the First and Second Cosmological. Physical Review D,\n73, 083002; [astro-ph/0603052]\nH. Wei & R. G. Cai, (2007). Cheng-Weyl Vector Field and its Cosmological Application. Journal of Cosmology and\nAstroparticle Physics, 0709, 015; [astro-ph/0607064]\nM. Chaves & D. Singleton, (2008). A Unified Model of Phantom Energy and Dark Matter, arXiv:0801.4728;\nK. Bamba, S. Nojiri, & S. D. Odintsov, (2008). Inflationary Cosmology and the Late-time Accelerated Expansion of the\nUniverse in Nonminimal Yang-Mills-F(R) Gravity and Nonminimal Vector-F(R) Gravity. Physical Review D, 77, 123532;\n[arXiv:0803.3384]\nT. S. Koivisto, & D. F. Mota, (2008). Vector Field Models of Inflation and Dark Energy. arXiv:0805.4229;\nD. V. Gal'tsov, (2009). Non-Abelian Condensates As Alternative for Dark Energy. arXiv:0901.0115;\nV. A. De Lorenci, (2009). Nonsingular and Accelerated Expanding Universe from Effective Yang-Mills Theory.\narXiv:0902.2672;\nY. Zhang, (2009). The Slow-Roll and Rapid-Roll Conditions in The Space-likeVector Field Scenario. arXiv:0903.3269;\nT. S. Koivisto & N. J. Nunes, (2009). Three-form Cosmology. arXiv:0907.3883;\nN. J. Nunes & T. S. Koivisto, (2009). Ination and Dark Energy from Three-forms. arXiv:0908.0920.\n[16] M. C. Bento, O. Bertolami, P. V. Moniz, J. M. Mourao & P.M. Sa, (1993). On the Cosmology of Massive Vector Fields\nwith SO(3) Global Symmetry. Classical and Quantum Gravity, 10, 285; [gr-qc/9302034]\nE. Elizalde, J. E. Lidsey, S. Nojiri, & S. D. Odintsov, (2003). Born-Infeld Quantum Condensate as Dark Energy in the\nUniverse. Physics Letters B, 571, 1; [hep-th/0307177]\nV. V. Kiselev, (2004). Vector Field as a Quintessence Partner. Classical and Quantum Gravity, 21, 3323; [gr-qc/0402095]\nM. Novello, S. E. P. Bergliaffa & J. Salim, (2004). Non-linear Electrodynamics and the Acceleration of the Universe.\nPhysical Review D, 69, 127301; [astro-ph/0312093]\nC. G. Boehmer & T. Harko, (2007). Dark Energy as a Massive Vector Field. The European Physical Journal C, 50, 423;\n[gr-qc/0701029]\nJ. B. Jimenez & A. L. Maroto, (2008). A Cosmic Vector for Dark Energy. Physical Review D, 78, 063005; [arXiv:0801.1486]\n\n14\n\n\f[17]\n\n[18]\n[19]\n[20]\n[21]\n[22]\n[23]\n[24]\n[25]\n[26]\n[27]\n[28]\n[29]\n[30]\n[31]\n[32]\n[33]\n\n[34]\n[35]\n[36]\n[37]\n\nJ. B. Jimenez, R. Lazkoz & A. L. Maroto, (2009). Cosmic Vector for Dark Energy: Constraints from SN, CMB and BAO.\narXiv:0904.0433;\nJ. B. Jimenez, & A. L. Maroto, (2009). Cosmological Evolution in Vector-tensor Theories of Gravity. arXiv:0905.1245;\nK. Dimopoulos, M. Karciauskas & J. M. Wagstaff, (2009). Vector Curvaton with Varying Kinetic Function.\narXiv:0907.1838;\nJ. B. Jimenez, T. S. Koivisto, A. L. Maroto & D. F. Mota, Perturbations in electromagnetic dark energy. arXiv:0907.3648.\nY. Zhang, (1994). Inflation with Quantum Yang-Mills Condensate. Physics Letters B, 340, 18;\nY. Zhang, (1996). An Exact Solution of a Quark Field Coupled with a Yang - Mills Field in de Sitter Space. Classical and\nQuantum Gravity, 13, 2145;\nY. Zhang, (2003). Dark Energy Coupled with Relativistic Dark Matter in Accelerating Universe. Chinese Physics Letters,\n20, 1899.\nS .L. Adler, (1981). Effective-action Approach to Mean-field non-Abelian statics, and a Model for Bag Formation. Physical\nReview D, 23, 2905;\nS. L. Adler, (1983). Short-distance Perturbation Theory for the Leading Logarithm Models. Nuclear Physics B, 217, 381.\nH. Pagels,& E .Tomboulis, (1978). Vacuum of the Quantum Yang-Mills Theory and Magnetostatics. Nuclear Physics B,\n143, 485.\nW. Zhao, & Y. Zhang, (2006). The State Equation of the Yang-Mills Field Dark Energy Models. Classical and Quantum\nGravity, 23, 3405. [astro-ph/0510356]\nW. Zhao, & Y. Zhang, (2006). Coincidence Problem in YM Field Dark Energy Model. Physics Letters B, 640, 69.\n[astro-ph/0604457]\nS. G. Matinyan, & G. K. Savvidy, (1978). Vacuum Polarization Induced by the Intense Gauge Field. Nuclear Physics B,\n134, 539.\nD. J. Gross, & Wilczez, F. (1973). Ultraviolet Behavior of Non-Abelian Gauge Theories. Physical Review Letters, 30, 1343;\nD. J. Gross,(1973). Asymptotically Free Gauge Theories. I. Physical Review D, 8, 3633.\nT. Y. Xia, & Y. Zhang, (2007). 2-loop Quantum Yang-Mills Condensate As Dark Energy. Physics Letters B, 656, 19.\n[arXiv:0710.0077]\nS. Wang, Y. Zhang, & T. Y. Xia, (2008). 3-loop Yang-Mills Condensate Dark Energy Model and its Cosmological Constraints. Journal of Cosmology and Astroparticle Physics, 10, 037. [arXiv:0803.2760]\nW. Zhao, & D. H. Xu, (2007). Evolution of Magnetic Component in Yang-Mills Condensate Dark Energy Models. International Journal of Modern Physics D, 16, 1735. [gr-qc/0701136]\nW. Zhao, (2008). Statefinder Diagnostic for Yang-Mills Dark Energy Model. International Journal of Modern Physics D,\n17, 1245. [arXiv:0711.2319]\nM. L. Tong, Y. Zhang, & T. Y. Xia, T. (2009). Statefinder Parameters for Quantum Effective Yang-Mills Condensate Dark\nEnergy Model. International Journal of Modern Physics D, 18, 797. [arXiv:0809.2123]\nW. Zhao, (2009). Perturbations of the Yang-Mills Field in the Universe. Research in Astronomy and Astrophysics, 9, 874.\n[astro-ph/0508010]\nA. Vikman, (2005). Can Dark Energy Evolve to the Phantom? Physical Review D, 71, 023515. [astro-ph/0407107]\nR. H. Cyburt, B. D. Fields, K. A. Olive, & E. Skillman, (2005). New BBN Limits on Physics Beyond the Standard Model\nfrom He4. Astroparticle Physics, 23, 313. [astro-ph/0408033]\nY. Zhang, T. Y. Xia, & W. Zhao, (2007). Yang-Mills Condensate Dark Energy Coupled with Matter and Radiation.\nClassical and Quantum Gravity, 24, 3309. [gr-qc/0609115]\nB. Wang, et al. (2007). Interacting Dark Energy and Dark Matter: Observational Constraints From Cosmological Parameters. Nuclear Physics B, 778, 69; [astro-ph/0607126]\nJ. H. He,; B. Wang, & P. Zhang, (2009). The Imprint of the Interaction Between Dark Sectors in Large Scale Cosmic\nMicrowave Background Anisotropies. arXiv:0906.0677.\nW. Zhao, (2009). Attractor Solution in Coupled Yang-Mills Field Dark Energy Models. International Journal of Modern\nPhysics D, 18, 1331. [arXiv:0810.5506]\nV. Sahni, T. D. Saini, A. A. Starobinsky, & U. Alam, (2003). Statefinder - A New Geometrical Diagnostic of Dark Energy.\nJETP Letters, 77, 201. [astro-ph/0201498]\nV. Sahni, A. Shafieloo, & A. A. Starobinsky, (2008). Two New Diagnostics of Dark Energy. Physical Review D, 78, 103502.\n[arXiv:0807.3548]\nM. L. Tong, & Y. Zhang, (2009). Cosmic Age, Statefinder and Om Diagnostics in the Decaying Vacuum Cosmology.\nPhysical Review D, 80, 023503. [arXiv:0906.3646]\n\n15\n\n\f"}