{"id": "http://arxiv.org/abs/0906.3488v1", "guidislink": true, "updated": "2009-06-18T18:45:37Z", "updated_parsed": [2009, 6, 18, 18, 45, 37, 3, 169, 0], "published": "2009-06-18T18:45:37Z", "published_parsed": [2009, 6, 18, 18, 45, 37, 3, 169, 0], "title": "Classical Correlations and Quantum Interference in Ballistic Conductors", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0906.3315%2C0906.3058%2C0906.1521%2C0906.0967%2C0906.0864%2C0906.1393%2C0906.4756%2C0906.1009%2C0906.2809%2C0906.2938%2C0906.0019%2C0906.3195%2C0906.1559%2C0906.2802%2C0906.2140%2C0906.1986%2C0906.1367%2C0906.2887%2C0906.0276%2C0906.4815%2C0906.4301%2C0906.2364%2C0906.0366%2C0906.0841%2C0906.2607%2C0906.4918%2C0906.2868%2C0906.0818%2C0906.2396%2C0906.0053%2C0906.1488%2C0906.3605%2C0906.1947%2C0906.1816%2C0906.4577%2C0906.1936%2C0906.2959%2C0906.2871%2C0906.1727%2C0906.3103%2C0906.0479%2C0906.0048%2C0906.1179%2C0906.3488%2C0906.0179%2C0906.1654%2C0906.5065%2C0906.4557%2C0906.1257%2C0906.0399%2C0906.0428%2C0906.4456%2C0906.4184%2C0906.2298%2C0906.1570%2C0906.3906%2C0906.4154%2C0906.3941%2C0906.1266%2C0906.0681%2C0906.0365%2C0906.1640%2C0906.4429%2C0906.3085%2C0906.4779%2C0906.2950%2C0906.2389%2C0906.3623%2C0906.1444%2C0906.1202%2C0906.3316%2C0906.4594%2C0906.2159%2C0906.3601%2C0906.1121%2C0906.5025%2C0906.0674%2C0906.2180%2C0906.1073%2C0906.1925%2C0906.2465%2C0906.0942%2C0906.4304%2C0906.2058%2C0906.0561%2C0906.5499%2C0906.2469%2C0906.5217%2C0906.1682%2C0906.1449%2C0906.1774%2C0906.4523%2C0906.5561%2C0906.1533%2C0906.4759%2C0906.1994%2C0906.1208%2C0906.1215%2C0906.0149%2C0906.2262%2C0906.2992&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Classical Correlations and Quantum Interference in Ballistic Conductors"}, "summary": "We illustrate how classical chaotic dynamics influences the quantum\nproperties at mesoscopic scales. As a model case we study semiclassically\ncoherent transport through ballistic mesoscopic systems within the Landauer\nformalism beyond the so-called diagonal approximation, i.e. by incorporating\nclassical action correlations. In this context we review and explain the two\nmain trajectory-based methods developed for calculating quantum corrections:\nthe configuration space approach and the phase space approach that can be\nregarded as less illustrative but more general than the first one.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0906.3315%2C0906.3058%2C0906.1521%2C0906.0967%2C0906.0864%2C0906.1393%2C0906.4756%2C0906.1009%2C0906.2809%2C0906.2938%2C0906.0019%2C0906.3195%2C0906.1559%2C0906.2802%2C0906.2140%2C0906.1986%2C0906.1367%2C0906.2887%2C0906.0276%2C0906.4815%2C0906.4301%2C0906.2364%2C0906.0366%2C0906.0841%2C0906.2607%2C0906.4918%2C0906.2868%2C0906.0818%2C0906.2396%2C0906.0053%2C0906.1488%2C0906.3605%2C0906.1947%2C0906.1816%2C0906.4577%2C0906.1936%2C0906.2959%2C0906.2871%2C0906.1727%2C0906.3103%2C0906.0479%2C0906.0048%2C0906.1179%2C0906.3488%2C0906.0179%2C0906.1654%2C0906.5065%2C0906.4557%2C0906.1257%2C0906.0399%2C0906.0428%2C0906.4456%2C0906.4184%2C0906.2298%2C0906.1570%2C0906.3906%2C0906.4154%2C0906.3941%2C0906.1266%2C0906.0681%2C0906.0365%2C0906.1640%2C0906.4429%2C0906.3085%2C0906.4779%2C0906.2950%2C0906.2389%2C0906.3623%2C0906.1444%2C0906.1202%2C0906.3316%2C0906.4594%2C0906.2159%2C0906.3601%2C0906.1121%2C0906.5025%2C0906.0674%2C0906.2180%2C0906.1073%2C0906.1925%2C0906.2465%2C0906.0942%2C0906.4304%2C0906.2058%2C0906.0561%2C0906.5499%2C0906.2469%2C0906.5217%2C0906.1682%2C0906.1449%2C0906.1774%2C0906.4523%2C0906.5561%2C0906.1533%2C0906.4759%2C0906.1994%2C0906.1208%2C0906.1215%2C0906.0149%2C0906.2262%2C0906.2992&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We illustrate how classical chaotic dynamics influences the quantum\nproperties at mesoscopic scales. As a model case we study semiclassically\ncoherent transport through ballistic mesoscopic systems within the Landauer\nformalism beyond the so-called diagonal approximation, i.e. by incorporating\nclassical action correlations. In this context we review and explain the two\nmain trajectory-based methods developed for calculating quantum corrections:\nthe configuration space approach and the phase space approach that can be\nregarded as less illustrative but more general than the first one."}, "authors": ["Daniel Waltner", "Klaus Richter"], "author_detail": {"name": "Klaus Richter"}, "author": "Klaus Richter", "links": [{"href": "http://arxiv.org/abs/0906.3488v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0906.3488v1", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "cond-mat.mes-hall", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cond-mat.mes-hall", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0906.3488v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0906.3488v1", "arxiv_comment": null, "journal_reference": "Radons, G. / Rumpf, Benno / Schuster, Heinz Georg (Hrsg.):\n  Nonlinear Dynamics of Nanosystems, 1. Auflage - Februar 2010", "doi": null, "fulltext": "arXiv:0906.3488v1 [cond-mat.mes-hall] 18 Jun 2009\n\nClassical Correlations and Quantum Interference\nin Ballistic Conductors\nDaniel Waltner and Klaus Richter\nInstitut für Theoretische Physik\nUniversität Regensburg, D-93040 Regensburg, Germany\nNovember 6, 2018\nAbstract\nWe illustrate how classical chaotic dynamics influences the quantum\nproperties at mesoscopic scales. As a model case we study semiclassically coherent transport through ballistic mesoscopic systems within the\nLandauer formalism beyond the so-called diagonal approximation, i.e. by\nincorporating classical action correlations. In this context we review and\nexplain the two main trajectory-based methods developed for calculating quantum corrections: the configuration space approach and the phase\nspace approach that can be regarded as less illustrative but more general\nthan the first one.\n\n1\n\nIntroduction: quantum transport\nthrough chaotic conductors\n\nAmong the most important properties characterizing an electronic nanosystem is\nits electrical conductance behavior. Hence gaining knowledge on charge transport mechanisms, in particular when shrinking conductors from macroscopic\nsizes down to molecular-sized wires or atomic point contacts, has been in the\nfocus of experimental and theoretical research throughout the last decade. Such\na reduction in size and spatial dimensionality goes along with a crossover from\ncharge flow in the macroscopic bulk, well described by Ohm's law, to distinct\nquantum effects in the limit of microscopic or atomistic wires. Nanoconductors\nin the crossover regime, often referred to as mesoscopic, frequently exhibit a coexistence of both classical remnants of bulk features, combined with signatures\nfrom wave interference. Such quantum effects usually require low temperatures\nwhere coherence of the electronic wavefunctions is retained up to micron scales.\nThis has lead to the observation of various quantum interference phenomena\nsuch as quantized steps in the point contact conductance, the Aharonov-Bohm\neffect and universal conductance fluctuations, to name only a few.\nNonlinear effects can enter into transport through mesoscopic or nano-systems\ntwofold: First, as nonlinear I-V characteristics and charge flow far from equilibrium for large enough voltage applied. Second, in the limit of linear response to\nan applied electric field, the intrinsic nonlinear classical dynamics of the unperturbed conductor can govern its transport properties. In this chapter we focus\n1\n\n\ft=0\n\nt=1\n\nt=2\n\nt=3\n\nt=4\n\nt = 25\n\nFigure 1: Quantum mechanical wave packet launched into a mesoscopic cavity\nwith the geometry of a \"desymmetrized diamond billiard\". The wave packet\nevolution is monitored at times t = 1, 2, 3, 4, and 25, in units of the average time\nbetween collisions with the walls of a corresponding classical particle (Courtesy\nof A. Goussev).\non the latter case which is particularly interesting for mesoscopic conductors\nbecause the nonlinear charge carrier dynamics can influence both the classical\nand, in a more subtle way, the quantum transport phenomena.\nInitially, disordered metals with underlying diffusive charge carrier motion\nwere in the focus of interest in mesoscopic matter. Here, we instead address ballistic nano- or mesoscopic conductors where impurity scattering is suppressed.\nThe most prominent ballistic systems are nanostructures built from high-mobility\nsemiconductor heterostructures, where electrons are confined to two-dimensional,\nbilliard-type cavities of controllable geometry; however, such systems are also realized as atom optics billiards or through wave scattering as optical, microwave,\nor acoustic mesoscopic resonators [1].\nThe quantum dynamics of a single particle in such a geometry is illustrated\nin Fig. 1 showing snapshots of a wave packet after multiples of the average classical time between bounces off the billiard walls. The quantum evolution in such\na mesoscopic geometry, with corresponding chaotic classical dynamics, is characterized by two main features: The rapid transition from wave packet motion\nfollowing roughly the path of a classical particle to random wave interference at\nlarger times and, second, the emergence of wave functions of complex morphology with wave lengths much shorter than the system size. The latter can be\nused to further specify mesoscopic matter, i.e. quantum coherent systems where\nthe smallest (quantum) length scale, the de Broglie wave length or Fermi wave\nlength λF in electronic conductors, is much smaller than the system size L, i.e.\n1/(kF L) is a small parameter, in terms of the Fermi momentum kF = 2π/λF ,\nbut not fully negligible as in the case of macroscopic systems.\nSuch ballistic mesoscopic systems are ideal tools to study the connection\nbetween (chaotic) classical dynamics and wave interference. Semiclassical techniques provide this link presumably in the most direct way. Modern semiclassical\ntheory is based on trace formulas, sums over Fourier-type components associated\nwith classical trajectories. Analogous to the famous Gutzwiller trace formula\nfor the density of states [2], there exist corresponding expressions for quantum\n\n2\n\n\ftransport in the linear response regime. There, semiclassical expressions for the\nconductance have been obtained within the framework of the Landauer-Büttiker\napproach, relating conductance to quantum transmission in nanostructures.\nAfter early, pioneering semiclassical work by Miller [3] for molecular reactions and later by Blümel and Smilansky [4] for quantum chaotic scattering,\nmajor advances were made in the context of mesoscopic conductance in the\nearly nineties by Baranger, Jalabert and Stone [5, 6]. All these semiclassical\napproaches were based on, and limited by, the so-called diagonal approximation, see below. While most of the features of experimental and numerical\nmagneto-conductance profiles could be well explained qualitatively on the level\nof the diagonal approximation, it contained the major drawback that it was\nnot current-conserving and hence failed to give correct quantitative predictions\nfor the quantum transmission. This was cured about 10 years later when an\napproach was devised to account for off-diagonal contributions to the semiclassical conductance [7], thereby achieving unitarity, reflected in (average) current\nconservation, and furthermore agreement with existing predictions from random\nmatrix theory (RMT). The applicability of RMT to closed chaotic mesoscopic\nsystems was conjectured after numerical simulations in [8]. So it was expected\nto be applicable also to open systems.\nSemiclassical ballistic transport on the level of the diagonal approximation\nwas reviewed in detail in Refs. [9, 10, 11]. In this chapter we hence focus on\nrecent progress beyond the diagonal approximation during the last years. This\nserves as a model case which illustrates how chaotic nonlinear dynamics can\ngovern quantum properties at nanoscales.\n\n2\n\nSemiclassical limit of the Landauer transport\napproach\n\nThe Landauer formalism [12], providing a link between the quantum transmission and conductance, has proven to be an appropriate framework to address\nphase-coherent transport through nanosystems. Consider a sample attached to\ntwo leads of width W1 and W2 that support N1 , respectively, N2 current carrying transverse modes at (Fermi-)energy EF . For such a two-terminal setup the\nconductance reads at very low temperatures [12]\nG(EF ) = gs\n\nN1 X\nN2\ne2 X\ne2\nT (EF ) = gs\n|tnm (EF )|2\nh\nh m=1 n=1\n\n(1)\n\n√\nwith N1 = W1 2mEF /(~π) and an analogous relation for N2 . Here, gs =\n2 accounts for spin degeneracy, and the tnm (E) are transmission amplitudes\nbetween incoming channels m and outgoing channels n in the leads at energy\nE. They can be expressed in terms of the projections of the Green function of\nthe scattering region onto the transverse modes φn (y ′ ) and φm (y) in the two\nleads [13]:\nZ\nZ\n1/2\n′\ntnm (E) = −i~(vn vm )\ndy\ndy φ∗n (y ′ )φm (y) G(x′ , y ′ , x, y; E) .\n(2)\n\nHere x and x′ , respectively, denote the direction along the leads and vn , vm the\ncorresponding longitudinal velocities. The integrals in Eq. (2) are taken over\n3\n\n\fthe cross sections of the (straight) leads at the entrance and the exit.\n\nFigure 2: Total quantum transmission (as a function of energy EF , on the\nright in units of the channel number in the leads of width W1 = W2 = W )\nfor transport through a phase-coherent graphene-based quantum dot, see inset.\nThe fluctuating line in the left panel is the full quantum transmission at zero\nmagnetic field. In the right panel, the straight solid and dashed line denote the\naveraged transmission at zero magnetic field and a magnetic field corresponding\nto a flux φ = 1.6φ0 with the flux quantum φ0 = hc/e. The difference marks the\nweak localization correction (from Ref. [14]).\nFig. 2 shows the quantum transmission, numerically obtained from Eq. (2),\nfor a \"graphene billiard\" [14], fabricated by cutting a cavity out of a twodimensional graphene flake, a monoatomic layer of carbon atoms arranged in a\nhoneycomb lattice. Two major quantum features are visible: (i) distinct \"ballistic conductance fluctuations\" as a function of energy. (ii) When subject to\nan additional, perpendicular magnetic field B with magnetic flux φ, the average\ntransmission (straight dashed line in the right panel) shows a small positive offset compared to the average transmission for B = 0 (solid line). This reduction\nof the average conductance at zero magnetic field reflects a weak-localization\neffect [15]. Its origin is non-classical and due to wave interference.\nHere we focus on this ballistic weak localization effect and present its semiclassical derivation for conductors with classically chaotic analogue. The semiclassical approximation enters in two steps: First, we replace G(x′ , y ′ , x, y; E)\nin Eq. (2) by the semiclassical Green function (in two dimensions) [2]:\n\u0013\n\u0012\nX\nπ\n1\ni\n′\n.\n(3)\nS\n−\niη\nGsc (r′ , r; E) =\nD\n(r\n,\nr)\nexp\nt\nt\nt\n~\n2\ni~(2iπ~)1/2 t\nIt is given as a sum over contributions from all classical trajectories t connecting\nthe two fixed points r and r′ at energy E. In Eq. (3),\nZ\n~p * d~q\n(4)\nSt (r′ , r; E) =\nCt\n\nis the classical action along a path Ct between r and r′ and governs the accumulated phase.\nSecond, we evaluate the projection integrals in Eq. (2) for isolated trajectories within the stationary-phase approximation. For leads p\nwith hard-wall boundaries the mode wavefunctions are sinusoidal, φm (y) = 2/W1 sin(mπy/W1 ).\n4\n\n\fHence the stationary-phase condition for the y integral requires [9]\n\u0012\n\u0013\nm~π\n∂S\n= −py ≡ −\n,\n∂y y′\nW1\n\n(5)\n\nwith m = ±m. The stationary-phase solution of the y ′ integral yields a corresponding \"quantization\" condition for the transverse momentum py′ . Thus\nonly those paths which enter into the cavity at (x, y) with a fixed angle sin θ =\n′ ′\n′\n±mπ/kW1 and exit the cavity\n√ at (x , y ) with angle sin θ = ±nπ/kW2 contribute to tnm (E) with k = 2mE/~. There is an intuitive explanation: the\ntrajectories are those whose transverse wave vectors on entrance and exit match\nthe wave vectors of the modes in the leads. One then obtains for the semiclassical transmission amplitudes\n√\n\u0014\n\u0015\np\n2πi~ X\nπ\ni\ntnm (k) = − √\nsgn(n) sgn(m) At exp S̃t (n, m; k) − i μ̃t . (6)\n~\n2\n2 W1 W2\nt(n,m)\n\nHere, the reduced actions are\nS̃t (n, m; k) = St (k) + ~ky sin θ − ~ky ′ sin θ′ ,\n\n(7)\n\nwhich can be considered as Legendre transforms of the original action functional.\nThe phases μ̃t contain both the usual Morse indices and additional phases arising\nfrom the y, y ′ integrations. The prefactors are At = | (∂y/∂θ′ )θ |/ (~k |cos θ′ |).\nThe resulting semiclassical expression for the transmission and thereby the conductance (see Eq. (1)) in chaotic cavities involves contributions from pairs of\ntrajectories t, t′ . It reads [5, 6, 9]\nT (k) =\n\nN1 X\nN2\nX\n\nm=1 n=1\n\nwith\nt,t′\nFn,m\n(k)\n\n|tnm (k)|2 =\n\nN1 X\nN2 X\nX\nπ~\nt,t′\nFn,m\n(k)\n2W1 W2 m=1 n=1 ′\n\n(8)\n\nt,t\n\n\u0015\n\u0014\np\nπ\ni\n,\n≡ At At′ exp (S̃t − S̃t′ ) − iμt,t′\n~\n2\n\n(9)\n\nwhere the phase μt,t′ accounts for the differences of the phases μ̃t and the sgn\nfactors in Eq. (6).\nIn the next two sections we show how one can calculate with purely semiclassical methods quantum corrections to the transmission beyond the diagonal\napproximation. The results obtained for chaotic conductors are consistent with\nRMT-predictions.\n\n3\n\nQuantum transmission:\nconfiguration space approach\n\nIn evaluating the off-diagonal (interference) contributions to the quantum transmission we present two approaches. The first approach is based on the analysis\nof off-diagonal pairs of trajectories and their self-intersections in configuration\nspace. This approach is more illustrative, but less general than the second,\nphase space approach outlined in Sec. 4.\n5\n\n\fWe start from the semiclassical expression for |tnm (k)|2 obtained by squaring\nthe semiclassical transmission amplitudes, Eq. (6), see also Eqs. (8,9):\n\u0014\n\u0015\ni\nπ\nπ~ X p\n2\nAt At′ exp (S̃t − S̃t′ ) − iμt,t′ .\n(10)\n|tnm (k)| =\n2W1 W2 ′\n~\n2\nt,t\n\nDue to the action difference of the trajectories t and t′ in the exponential in\nEq. (10), this expression is a rapidly oscillating function of k or the energy in\nthe semiclassical limit of large ratios (St − St′ )/~. In the following we wish to\nidentify those contributions to Eq. (10) which survive an average over a classically small but quantum mechanically large k-window ∆k. Such contributions\nmust come from very similar trajectories. Afterwards we wish to evaluate their\n2\ncontributions to |tnm (k)| using basic principles of chaotic dynamics: for our\ncalculation we will need hyperbolicity and ergodicity. Hyperbolicity implies\nthe possible exponential separation of neighboring trajectories for long times\nwith the distance growing proportional to eλT , with the Lyapunov exponent λ\nand the time T of the trajectory. The second principle, ergodicity, means the\nequidistribution of long trajectories on the energy surface at the energy E of\nthe trajectory.\nThis section is divided into four subsections: after calculating the diagonal\ncontribution we determine the simplest nondiagonal contribution in the second\npart. The behavior of the latter as a function of a magnetic field and a finite\nEhrenfest time is then studied in the third and fourth subsection, respectively.\n\n3.1\n\nDiagonal contribution\n\nThe first, \"diagonal\" (D) contribution to Eq. (10) originates from identical trajectories t = t′ , meaning St = St′ . It gives\nπ~ X\n2\nAt .\n(11)\n|tnm (k)|D =\n2W1 W2 t\nThe remaining sum over classical trajectories in Eq. (11) can be calculated using\na classical sum rule [7] that can be derived using ergodicity, see for example [16].\nIt yields\nZ\nX\n4W1 W2 ∞\nρ(T ),\n(12)\nAt =\nΣ(E) 0\nt\n\nwhere Σ(E) denotes the phase space volume of the system at energy E, and\nρ(T ) is the classical probability to find a particle still inside an open system\nafter a time T . For long times the latter decays for a chaotic system exponenΣ(E)\n. This exponential\ntially ρ(T ) ∼ e−T /τD , with the dwell time τD = 2π~(N\n1 +N2 )\ndecay can be easily understood based on the equidistribution of trajectories: the\nnumber ∆N of particles leaving the system during ∆T is given by the overall\nnumber of particles N times the ratio of the phase space volume from which\nthe particles leave during ∆T and the whole phase space volume of the system.\nThe differential equation for N , obtained in the case of infinitesimal ∆T , has\nobviously an exponential solution.\nBy inserting Eq. (12) into Eq. (11), we obtain\n2\n\n|tnm (k)|D =\n6\n\n1\n.\nN1 + N2\n\n(13)\n\n\fFigure 3: Pair of two periodic orbits in the hyperbola billiard differing from\neach other essentially in the region marked by the circle, where the left orbit\nexhibits a self-crossing while the right partner orbit shows an \"avoided crossing\"\n(Courtesy of M. Sieber).\nIts derivation required ergodicity valid only for long trajectories. We will assume\nthat the classical dwell time is large enough, in order to have a statistically\nrelevant number of long trajectories left after time t. The result in Eq. (13)\nallows for a very simple interpretation: It is just the probability of reaching one\nof the N1 + N2 channels if each of the channels can be reached equally likely.\n\n3.2\n\nNondiagonal contribution\n\nIn the following we will calculate the contributions from pairs of different trajectories, however with similar actions. For a long time it was not clear how these\norbits could look like. There are many orbit pairs in a chaotic system having\naccidentally equal or nearly equal actions. However, in order to describe universal features of a chaotic system after energy averaging, one has to find orbits\nthat are correlated in a systematic way. These orbits were first identified and\nanalyzed in 2000 in the context of spectral statistics [17]. There, periodic orbits\nwere studied to compute correlations between energy eigenvalues of quantum\nsystems with classically chaotic counterpart. Based on open, lead-connecting\ntrajectories, in Ref. [7] this approach was generalized to the conductance we\nstudy here. Still, the underlying mechanism to form pairs of classically correlated orbits is the same in the two cases.\nIn Fig. 3 we show a representative example of such a correlated (periodic)\norbit pair in the chaotic hyperbola billiard. The two partner orbits are topologically the same up to the region marked by the circle where one orbit exhibits\na self-crossing (left panel) while the partner orbit an 'avoided' crossing (right\npanel). Usually, such trajectory pairs are drawn schematically as shown in Fig.\n4.\nOne considers very long orbits with self-crossings characterized by crossing\nangles ǫ ≪ π. In Ref. [17] it was shown that there exists for each orbit a partner\norbit starting and ending (exponentially) close to the first one. It follows the\nfirst orbit until the crossing, avoids this, however, traverses the loop in reversed\ndirection and avoids the crossing again.\nIn order to quantify the contribution of these trajectory pairs to Eq. (10)\nwe need two inputs: an expression for the action difference and for the density\nquantifying how often an orbit of time T exhibits a self-intersection, both quantities expressed as a function of the parameter ǫ. The formula for the action\n7\n\n\fFigure 4: Schematic drawing of a pair of orbits yielding the first nondiagonal\ncontribution to the transmission considered in Ref. [7]. One of the orbits crosses\nitself under an angle ǫ, the other one possesses an \"avoided crossing\". Except\nfor the crossing region both orbits are almost identical.\ndifference ∆S can be derived by linearizing the dynamics of the orbit without\ncrossing around the reference orbit with crossing, giving, in the limit ǫ ≪ π, [17]\n\np2 ǫ 2\n.\n(14)\n2mλ\nAt this point we can justify our assumption of small crossing angles ǫ: In\nthe limit ~ → 0, we expect important contributions to Eq. (10) only from orbit\npairs with small action differences, i.e. small crossing angles, as we see from Eq.\n(14).\nBefore deriving the number of self-crossings, P (ǫ, T ) dǫ, in the range between\nǫ and ǫ + dǫ of an orbit of time T , we give rough arguments how this expression\ndepends on ǫ and T for trajectories in billiards. There, each orbit is composed\nof a chain of N chords connecting the reflection points. Following an orbit, the\nfirst two chords cannot intersect, the third chord can cross with up to one, the\nfourth chord with up to two segments,\nso on. Hence, the overall number of\nPand\nN\nself-crossings will be proportional to n=3 (n − 2) ∝ N 2 , to leading order in N ,\ni.e. proportional to T 2 .\nThe crossing angle dependence of P (ǫ, T ) can be estimated for small ǫ as\nfollows: Given a trajectory chord of length L, a second chord, tilted by an angle\nǫ with respect to the first one, will cross it inside the billiard (with area of order\nL2 ) only if the distance between the reflection points of the two chords at the\nboundary is smaller than L sin ǫ. The triangle formed in the latter case includes\na fraction sin ǫ of the entire billiard size. From this rough estimation we expect\nP (ǫ, T ) ∝ T 2 sin ǫ.\nMore rigorously, the quantity P (ǫ, T ) dǫ, can be expressed for an arbitrary\norbit γ as [17]\n*Z\nZ T −tl −Tmin (ǫ)/2\nT −Tmin (ǫ)\nP (ǫ, T ) dǫ =\ndtl\ndts |J| δ (x (ts ) − x (ts + tl ))\n∆S =\n\nTmin (ǫ)\n\nTmin (ǫ)/2\n\n×δ (ǫ − α (ts , ts + tl ))i dǫ\n\n(15)\n\nwith the average h. . .i taken over different initial conditions (x0 , p0 ). The time\nof the closed loop of the trajectory is denoted by tl and the time before the\n8\n\n\floop by ts . α (ts , ts + tl ) denotes the absolute value of the angle between the\nvelocities v (ts ) and v (ts + tl ). |J| is the Jacobian for the transformation from\nthe argument of the first delta function to tl and ts ensuring that P (ǫ, T ) dǫ\nyields a 1 for each crossing of γ. With the absolute value of the velocity, v, it\ncan be expressed as\n|J| = |v (ts ) × v (ts + tl )| = v 2 sin α (ts , ts + tl ) .\n\n(16)\n\nAs the derivation [17] of the formula for P (ǫ, T ) for a chaotic system, starting\nfrom the formal expression (15), is instructive to see how information can be\nextracted from the basic principles of chaotic dynamics beyond the diagonal\napproximation, we will present it here in detail. Hyperbolicity will yield a\njustification for the minimal time Tmin(ǫ) already introduced in Eq. (15); we\nwill come back to that point later and first study the effect of ergodicity.\nTo proceed we interchange the phase space integral of the average with the\ntime integrals, substitute (x (ts ) , p (ts )) 7−→ (x0 , p0 ) in Eq. (15) and obtain\nP (ǫ, T ) = 2m\n\nZ\n\nT −Tmin (ǫ)\n\nTmin (ǫ)\n\ndtl v 2 sin ǫpE (ǫ, tl ) (T − tl − Tmin (ǫ)) ,\n\n(17)\n\nwith the averaged classical return probability density\npE (ǫ, tl ) =\n\n1\nhδ (x0 − x (tl )) δ (ǫ − |∡ (v0 , v (tl ))|)i .\n2m\n\n(18)\n\nThis yields the probability density that a particle possessing the energy E returns after the time tl to its starting point with the angle |∡ (v0 , v (tl ))| = ǫ.\nFor long times this can be replaced by 1/Σ (E), assuming ergodicity. Then we\nobtain\nZ T −Tmin (ǫ)\n1\n(T − tl − Tmin (ǫ))\nP (ǫ, T ) = 2m\ndtl v 2 sin ǫ\nΣ\n(E)\nTmin (ǫ)\n=\n\nmv 2\nsin ǫ (T − 2Tmin (ǫ))2 .\nΣ(E)\n\n(19)\n\nNow we return to our assumption of hyperbolicity and explain the cutoff\ntime Tmin (ǫ), introduced in the equations above. To this end, we consider two\nclassical paths leaving their crossing with a small angle ǫ. The initial deviation\nof their velocities is δvi = ǫv. In order to form a closed loop, the deviation of the\nvelocities δvf , when both paths have traversed half of the closed loop, has to be\ngiven by δvf = cv with c of the order unity. Then we get for the minimal time\nTmin (ǫ) to form a closed loop, due to the exponential divergence of neighboring\norbits,\nc = ǫe(λTmin (ǫ))/2 ,\n(20)\nimplying\n\n2 \u0010c\u0011\n.\n(21)\nln\nλ\nǫ\nAn argument similar to the one used here for the closed loop can also be applied\nto the other two parts of the trajectory leaving the crossing with an angle ǫ\ntowards the opening of the conductor. Suppose ts has a length between 0 and\nTmin (ǫ)/2, then both parts have to be so close together that they must leave\nTmin (ǫ) =\n\n9\n\n\fboth through the same lead. As we are interested in the transmission, we also\nhave to exclude that case1 . A similar argument holds for the case where the last\npart of the orbit has a length between 0 and Tmin (ǫ)/2, in this case the orbit has\nto come very close to the opening already before the crossing and leave before\nit could have crossed. Accounting for all these restrictions, gives the integration\nlimits in Eq. (15).\nNow we are prepared to calculate the contribution of the considered trajectory pairs to the transmission. Therefore we keep in Eq. (10) one sum over\ntrajectories that we will perform using the same classical sum rule as in diagonal approximation, the other we can replace by a sum over all the partner\ntrajectories of one trajectory, which can be calculated using P (ǫ, T ). There is,\nhowever, one subtlety concerning the survival probability ρ(T ) in the sum rule:\nwe argued already, that if the crossing happens near the opening, both parts of\nthe orbit act in a correlated way; ρ(T ) is changed in the case of the trajectory\npairs considered here for a similar reason: because we know that the two parts\nof the orbit leaving the crossing on each side are very close to each other, the\norbit can either leave the cavity during the first stretch, i.e. during the first\ntime it traverses the crossing region, or cannot leave at all. This implies that\nwe have to change the survival probability from ρ(T ) to ρ(T − Tmin (ǫ))2 . Then\nwe arrive at the loop (L) contribution\n\u0012 2 2 \u0013\np ǫP\nπ~ X X\n2\nAt 2R exp i\n|tnm (k)|L =\n2W1 W2 t\n2mλ~\nP\n\u0012 2 2 \u0013\nZ π Z ∞\np ǫ\n4π~\n=\ndǫ\ndT e−(T −Tmin (ǫ))/τD P (ǫ, T ) cos\nΣ(E) 0\n2mλ~\n2Tmin (ǫ)\n\u0012 2 2 \u0013\n3 Z π\np ǫ\n8π~mv 2 τD\n−Tmin (ǫ)/τD\n(22)\nsin ǫ cos\ndǫe\n=\nΣ(E)2\n2mλ~\n0\nwith the sum over the partner trajectories P in the first line. As the important\ncontributions require very small action differences, i.e. very similar trajectories,\nand as the prefactor At is not as sensitive as the actions to small changes of the\ntrajectories, we can neglect differences between t and t′ in the prefactor. In the\nsecond line we applied the classical sum rule with the modification explained\nbefore Eq. (22) and used P (ǫ, T ) to evaluate the sum over P . After performing\nthe simple time integral in the third line, we can do the ǫ-integration as for\nexample in Ref. [18] by taking into account that the important contributions\n1 If we would calculate the reflection instead of the transmission, the effect of short legs,\nreferred to as coherent backscattering, has to be taken into account.\n2 This effect together with the requirement of a finite length of the orbit parts leaving\ntowards the opening was originally not taken into account in Ref. [7]. In this calculation,\nthe contributions from these two effects cancel each other, they will be only important when\nconsidering more complicated diagrams as in the next section.\n\n10\n\n\fcome from very small ǫ, yielding\n\u0012 2 2 \u0013\n3 Z π\n2\np ǫ\n8π~mv 2 τD\n2\nλτD\nsin\nǫ\ncos\n|tnm (k)|L =\ndǫ(ǫ/c)\nΣ(E)2\n2mλ~\n0\n\"\n\"\n\u0012 \u0013 2 \u0012\n\u0013 1\n2 3 Z\nmλ~ 1 λτD\n8π~mv τD\n2mλ~z λτD\ndz 2\n=\ncos z\nΣ(E)2\np\nc\np2\n\"\n\"\n\u0012 \u0013 2 \u0012\n\u0013 1\n2 Z\n2mλ~z λτD sin z\n8π~mv 2 τD\nm~ 1 λτD\n= −\n.(23)\ndz 2\nΣ(E)2\np\nc\np2\nz\n2\n\nIn the first line we already rewrote e−Tmin (ǫ)/τD as (ǫ/c) λτD , and in the second\nline we approximated sin ǫ ≈ ǫ and substituted z = p2 ǫ2 / (2mλ~). Then we\nperform a partial integration with respect to z neglecting rapidly oscillating\nterms that are cancelled by the k-average, introduced after Eq. (10). Eventually,\nwe perform the z-integral by pushing the upper limit to infinity, i.e. ~ → 0\nand taking into account our assumption of large dwell times, i.e. λτD → ∞.\n\u0001 1\nAdditionally we assume 2mλ~/p2 λτD ≈ 1; we will return to the last point\nsoon.\nFinally, we arrive at the leading nondiagonal contribution to the quantum\ntransmission [7],\n1\n\n2\n\n|tnm (k)|L = −\n\n3.3\n\n(N1 + N2 )\n\n2\n\n.\n\n(24)\n\nMagnetic field dependence of the nondiagonal contribution\n\nUp to now we assumed time reversal symmetry. If this symmetry is destroyed,\nfor example by applying a strong magnetic field, the latter contribution will\nvanish, because the closed loop has to be traversed in different directions by the\ntrajectory and its partner. Here we study the transition region between zero and\nfinite magnetic field. In particular, we assume a homogeneous magnetic field\nBz perpendicular to the sample that is assumed weak enough not to change the\nclassical trajectories, but only the actions in the exponents. Since the closed\nloop is traversed in different directions by the two trajectories, we obtain an\nadditional phase difference (4πABz /φ0 ) between the two trajectories with the\nenclosed area A of the loop and the flux quantum φ0 = (hc/e). We further need\nthe distribution of enclosed areas for a trajectory with a closed loop of time T\nin chaotic systems, given by\n\u0012\n\u0013\nA2\n1\nexp −\n(25)\nP (A, T ) = √\n2T β\n2πT β\nwith a system specific parameter β. A derivation of this formula can be found\nfor example in Ref. [19]. Including the phase difference and the area distribution\n\n11\n\n\fin a modified P (ǫ, T ) yields\nZ T −Tmin (ǫ)\n2mv 2\nsin ǫ\ndtl (T − tl − Tmin (ǫ))\nΣ(E)\nTmin (ǫ)\nZ ∞\n4πABz\ndAP (A, tl − Tmin (ǫ)) cos\n×\nΦ0\n−∞\nZ T −Tmin (ǫ)\n2\n2mv\nsin ǫ\ndtl (T − tl − Tmin (ǫ)) e−(tl −Tmin (ǫ))/tB (26)\n=\nΣ(E)\nTmin (ǫ)\n\nPB (ǫ, T ) =\n\nφ2\n\n0\nwith tB = 8π2 βB\n2 . In the first line we used that paths leaving the crossing to\nz\nform a closed loop, enclose a negligible flux, as long as they are correlated; for\na more detailed analysis see Appendix D of Ref. [20]. Performing the T - and\nǫ-integrals similar to the case without magnetic field, yields [7]\n\n2\n\n|tnm (k, Bz )|L = −\n\n1\n.\n(N1 + N2 ) 1 + τD /tB\n1\n\n2\n\n(27)\n\nWe obtain an inverted Lorentzian with minimum at zero magnetic field, implying\nthat the transmission through our sample increases with increasing magnetic\nfield. This weak localization phenomenon, a precursor of strong localization, is\nvisible as the reduction of the average quantum transmission in Fig. 2.\n\n3.4\n\nEhrenfest time dependence of the nondiagonal contribution\n\nThis semiclassical approach can also be applied to calculate the Ehrenfest time\ndependence of the transmission. The Ehrenfest time τE ≡ (1/λ) ln (E/(λ~)),\nmore generally a time proportional to ln ~ [21], is the time a wave-packet needs\nto reach a size such that it can no longer be described by a single classical particle. The Ehrenfest time thus separates the evolution of wave packets following\nessentially the classical dynamics (e.g. up to few bounces of the wave packet in\nFig. 1) from longer time scales dominated by wave interference (last panel in\nFig. 1). Based on field theoretical methods, Aleiner and Larkin showed, that a\nminimal time is required for quantum effects in the transmission to appear, the\nEhrenfest time [22]. We will now apply our semiclassical methods to determine\nthe Ehrenfest-time dependence of the transmission following the pioneering work\n[23] that has later been extended to the reflection [24, 25, 20], including a distinction between different Ehrenfest times. To this end, we directly start from\nEq. (22); however, we have to be more careful when evaluating the ǫ-integral:\n1\nin our former calculation we assumed e−τE /τD = (λ~/E) λτD ≈ 1, requiring\nτE ≪ τD . Lifting however this strong restriction for τD , but still keeping it\nlarge enough to fulfill our assumption of chaotic dynamics, we obtain\n|tnm (k, τE )|2L = −\n\n1\n(N1 + N2 )2\n\ne−τE /τD ,\n\n(28)\n\ni.e. an exponential suppression of the nondiagonal contribution due to the\nEhrenfest time. This dependence has been confirmed in numerical simulations\nfor quantum maps.\n12\n\n\fAfter this introduction into semiclassical methods for the evaluation of nondiagonal contributions in configuration space, we will now turn to the generalization to phase space which also allows for an elegant way to compute higher-order\ncorrections to the leading weak localization contribution presented above.\n\n4\n\nQuantum transmission:\nphase space approach\n\nThe above configuration space treatment, based on self-crossings, is restriced\nto systems with two degrees of freedom. More generally, for higher-dimensional\ndynamical systems one cannot assume to find a one-to-one correspondence between partner orbits and crossings of an orbit [26]. In order to overcome these\ndifficulties, a phase space approach was developed for calculating the spectral\nform factor in spectral statistics in [26, 27] involving periodic orbits. The next\nchallenge was the generalization of this theory to trajectory pairs differing from\neach other at several places, solved again first for the spectral form factor [28]\nand generalized to the transport situation considered here in Ref. [29] which\nserves as the basis of the following discussion.\nIn this section we first explain the phase space approach and use it afterwards in the way developed in Refs. [28, 29] for the calculation of the quantum\ntransmission involving also higher-order semiclassical diagrams.\n\n4.1\n\nPhase space approach\n\nCompared to the last section, we first of all have to replace the role of the\nreference orbit. Whereas we used there the crossing orbit as reference and\ncalculated then the action difference and the crossing angle distribution in terms\nof the crossing angle ǫ, we will consider here the orbit without the crossing that\nis close to itself in the region, where the partner orbit crossed itself in the last\nsection. Inside the region, where the orbit is close to itself; we will refer to it\nas encounter region and to the parts of the orbit inside as encounter stretches,\nthat are connected by so called links; we place a so called Poincaré surface\nof section P with its origin at x̃ = (x, p). The section consists of all points\nx̃+δ ỹ = (x + δx, p + δp) in the same energy shell as the reference point with the\nδx perpendicular to the momentum p of the trajectory. For the two-dimensional\nsystems considered here P is a two-dimensional surface, where every vector δ ỹ\ncan be expressed in terms of the stable direction es (x̃) and the unstable one\neu (x̃) [30]\nδ ỹ = ses (x̃) + ueu (x̃) .\n(29)\nThe expressions stable and unstable refer to the following: we consider two\norbits, one starting at x̃ and the other one at x̃+δ ỹ0 , then the difference between\nthe stable coordinates will decrease exponentially for positive times and increase\nfor negative time exponentially in the limit of long time T , unstable coordinates\nbehave just the other way round. The functional form of the exponentials can\nbe determined as eλT and e−λT . Now we can come back to the trajectory\nwith the encounter region, where we have put our Poincaré surface of section.\nThe trajectory considered in the last section will pierce through the Poincaré\nsection twice: one of this points we will consider as the origin of the section\n\n13\n\n\fthe other piercing will take place at the distance (s, u). The coordinates of the\npiercing points of the partner trajectory are determined in the following way:\nthe unstable coordinate of the partner trajectory has to be the same as the one\nof that part of the first trajectory that the second will follow for positive times.\nThe stable coordinate is determined by the same requirement for negative times.\nAfter this introduction into the determination of the (s, u)-coordinates, we\nare now ready to treat trajectory pairs that differ in encounters of arbitrary\ncomplexity. Following Ref. [29] and using the notation introduced there we will\nallow here that the two trajectories differ in arbitrarily many encounters involving an arbitrary number of stretches. In order to organize this encounter\nstructure we introduce a vector ~v = (v2 , v3 , ...) with the component vl determining the number of encounters with l stretches involved.\nP∞ The overall number of\nencounters during an orbit willP\nbe denoted by V = l=2 vl , the overall number\nof encounter stretches by L = ∞\nl=2 lvl . In an encounter of l stretches, we will\nget l − 1 (s, u)-coordinates.\nNow we can proceed by replacing the former expressions for the minimal\nloop time, the action difference and the crossing angle distribution depending\non the former small parameter ǫ, by the corresponding expressions depending\non the new small parameters (s, u).\nWe start with the minimal loop time, to that one also refers as the duration\nof the encounter. Shifting the Poincaré surface of section through our encounter,\nthe stable components will asymptotically decrease, the unstable ones will increase for increasing time. We then claim that both components have to be\nsmaller than a classical constant c, its exact value will again, as in the last\nsection, be unimportant for our final results. We finally obtain the encounter\nduration tenc as the sum of the times tu , that the trajectory needs from P till\nthe point where the first unstable component reaches c, and the time ts , that\nthe trajectory needs from P till the point where the last stable component falls\nbelow c. Thus we get\ntenc = ts + tu =\n\nc2\n1\nln\n.\nλ maxi {|si |} maxj {|uj |}\n\n(30)\n\nNow we treat the action difference between the two trajectories. Expressing\nthe actions of the paired trajectories as the line integral of the momentum along\nthe trajectory, we can expand [26] one action around the other and express the\nresult in terms of the (s, u)-coordinates. This yields for an l-encounter3\n∆S =\n\nl−1\nX\n\nsj u j .\n\n(31)\n\nj=1\n\nThe action difference of a trajectory pair is then obtained by adding the differences resulting from all encounters.\nFinally we come to the crossing angle distribution that will be replaced here\nby a weight function for the stable and unstable coordinates for a trajectory of\ntime T . We first notice that the uniformity of the trajectory distribution implies\nin terms of our coordinates in P that a trajectory pierces through the section\n3 Strictly\n\nspeaking [28] the (s, u) coordinates used here and in the following calculation are\nfor encounters involving more than two stretches not the same like the ones described before,\nbut related to them via a linear and volume preserving transformation.\n\n14\n\n\fwith the coordinates (u, u + du) and (s, s + ds) within the time interval (t, t + dt)\nwith the probability 1/Σ(E)dsdudt. In general, we obtain for an l-encounter\nl−1\n(1/Σ(E))\ndsl−1 dul−1 dtl−1 . Integrating the product of the latter quantities\nfor all encounters over all possible durations of the L − V intra-encounter links,\nin a way that their durations are positive yields our weight function for a fixed\nposition of P. To take into account all possible positions of P, we also integrate\nover all possible positions, where it can be placed and divide by tenc to avoid\novercounting of equivalent positions. Taking all link times positive, we obtain\nfor the weight function for an orbit of time T\n!\nZ ∞\nV\nL\nX\nX\n1\nα\nwT (s, u) =\ndt1 . . . dtL Θ T −\nlα tenc −\ntα\nQ\n(Σ (E))L−V Vα=1 tα\nenc 0\nα=1\nα=1\n\u0011L\n\u0010\nP\nT − Vα=1 lα tα\nenc\n=\n.\n(32)\nL−V QV\nα\nL! (Σ (E))\nα=1 tenc\nOne additional problem arises, when treating trajectory pairs differing not\nonly in one 2-encounter like in the last section: one can construct for one ~v\ndifferent trajectory pairs, varying for example in the relative orientation, in\nwhich the encounter stretches are traversed. We will count this number by a\nfunction N (~v ) and describe briefly later, how it can be calculated.\n\n4.2\n\nCalculation of the full transmission\n\nAfter the introduction into the phase space approach we are now ready to calculate the transmission. Taking the weight function, the action difference and\nthe number of structures, we can transform the non-diagonal (ND) part of Eq.\n(10) into\n|tnm (k)|2N D\n\n=\n\nπ~ X X\nAt N (~v )\n2W1 W2 t\n~\nv\n\u001cZ c Z c\n\u0012\n\u0013\n\u001d\ni\n×\ndL−V udL−V s exp\n...\n∆S wT (s, u)\n(33)\n~\n−c\n−c\n∆k\n\nwith the average over a small k-window denoted by h. . .i∆k . Inserting the formulas for the action difference, the weight function and using the classical sum rule\nwith the modification of the survival probability, discussed in the last section,\nwe can then transform the integral with respect to the length of the trajectory\ninto one over the last link and obtain\n\u0013!\n\u0012\nL+1\nYZ ∞\nti\n2π~ X\n2\nN (~v )\ndti exp −\n|tnm (k)|N D =\nΣ(E)\nτD\ni=1 0\n~\nv\n\u0010\n\u0011+\nα\nPlα −1\n*Z\nZ c L−V L−V Y\nV exp − tenc + i\nc\ns\nu\nαj\nαj\nj=1\nτD\n~\nd\nud\ns\n×\n...\nL−V\nα\nt\n−c (Σ (E))\n−c\nenc\nα=1\n∆k\n\u0012\n\u0013\nL−V\n=n\n∞\nn\nX\nX\n1\n1\n=\n(−1)V N (~v )\n(34)\nN1 + N2 n=1 N1 + N2\n~\nv\n\n15\n\n\fwith the L + 1 link times ti . The (s, u)-integrals are calculated using the rule\n[28], that after expanding the exponential etenc /τD into a Taylor series, only the\ntenc -independent term contributes and yields in leading order in ~\n\u001c\n\u0013\u001d\n\u0012\nZ c Z c\n1\n1\nisu\n(35)\ndsdu exp\n∼\nΣ (E) −c −c\n~\nT\nH\n∆k\nwith the so called Heisenberg time TH = Σ(E)/(2π~). For the sum with respect\nto ~v , one can derive recursion relations, yielding [28]\nL−V\nX=n\n~\nv\n\n\u0013n\n\u0012\n2\n(−1) N (~v ) = 1 −\nβ\nV\n\n(36)\n\nwith β = 1 and β = 2 for the case with and without time reversal symmetry,\nrespectively. Relations of this kind are derived by describing our trajectories\nby permutations expressing the connections inside and between encounters and\nconsidering the effect of shrinking one link in an arbitrarily complicated structure to zero.\nWe then obtain for T (EF ), given in Eq. (1), in the case with time reversal\nsymmetry [29]\n\u0013n\n∞ \u0012\nN1 N2 X\n−1\nN1 N2\nN1 N2\nβ=1\n+\n(37)\n=\nT (EF )\n≈\nN1 + N2\nN1 + N2 n=1 N1 + N2\nN1 + N2 + 1\nand in the case without time reversal symmetry\nT (EF )β=2 ≈\n\nN1 N2\n,\nN1 + N2\n\n(38)\n\nwhich agrees with the diagonal contribution, already obtained in the previous\nsection. Both results are in agreement with RMT predictions [31].\n\n5\n\nSemiclassical research paths:\npresent and future\n\nIn the above sections we outlined the recently developed semiclassical techniques\nfor treating off-diagonal contributions for one paradigmatic example of coherent\ntransport, weak localization. Nonlinear (hyperbolic) dynamics as a prerequisite\nfor the formation of correlated orbit pairs, together with classical ergodicity are\nat the core of the universality in the interference contribution to the ballistic\nconductance. Recently, this semiclassical approach to quantum transport has\nbeen extended along various paths, thereby gaining a more and more closed\nsemiclassical framework of mesoscopic quantum effects:\nIn the presence of spin-orbit interaction, spin relaxation in confined ballistic systems and weak antilocalization, the enhancement of the conductance\nfor systems obeying time-reversal symmetry (i.e. at zero magnetic field), has\nbeen semiclassically predicted [32] and generalized to other types of spin-orbit\ninteraction [33] and higher-order contributions [34].\nBallistic conductance fluctuations, the analogue of the universal conductance\nfluctuations in the diffusive case, require the computation of semiclassical diagrams involving four trajectories. Again, RMT predictions could be confirmed\n16\n\n\f[25]. Accordingly, RMT predictions for shot noise in Landauer transport agree\nwith recent semiclassical results [35]. This could also be shown for higher moments of the conductance in [36]. Even strong localization effects (in certain\nsystems, i.e. chains of chaotic cavities) could be derived by making use of semiclassical loop-contributions [37].\nFinally, beyond RMT, Ehrenfest time effects on transport properties have\nrecently been in the focus of the field. As a result, ballistic conductance fluctuations turn out to be, to leading order, τE -independent [24], contrary to weak\nlocalization which is suppressed with e−τE /τD [23], as we have shown. Recently\nthese results were extended to the ac-conductance in [38].\nBeside universal spectral statistics of closed systems and transport through\nopen systems, the semiclassical techniques have been recently generalized to\ndecay and photo fragmentation of complex systems [39].\nTo summarize, by now there exists a newly developed semiclassical machinery to compute systematically quantum coherence effects for quantities being\ncomposed of products of Green functions. This opens up various possible future\nresearch directions: With respect to system classes, mesoscopic transport theory\nhas been predominantly focused on electron transport, leaving the conductance\nof ballistic hole systems aside, which plays experimentally an important role and\nfor which a semiclassical theory remains to be developed. The situation is similar for a novel class of ballistic conductors: graphene based nanostructures, see\nFig. 2. More generally, a proper treatment of interaction effects in mesoscopic\nphysics would probably represent the major challenge to future semiclassical\ntheory.\nTo conclude, at mesoscopic scales where linear quantum evolution meets\nnon-linear classical dynamics, further interesting phenomena can be expected\nto emerge, in view of increasingly controllable future experiments.\n\nReferences\n[1] H.-J. Stöckmann, Quantum chaos-an introduction (Cambridge University\nPress, Cambridge, 1999).\n[2] M.C. Gutzwiller, Chaos in Classical and Quantum Mechanics (Springer,\nNew York, 1990).\n[3] W.H. Miller, Adv. Chem. Phys. 25, 69 (1974).\n[4] R. Blümel and U. Smilansky, Phys. Rev. Lett. 60, 477 (1988).\n[5] R.A. Jalabert, H.U. Baranger, and A.D. Stone, Phys. Rev. Lett. 65, 2442\n(1990).\n[6] H.U. Baranger, R.A. Jalabert, and A.D. Stone, Phys. Rev. Lett. 70, 3876\n(1993).\n[7] K. Richter and M. Sieber, Phys. Rev. Lett. 89, 206801 (2002).\n[8] O. Bohigas, M.J. Giannoni, and C. Schmit, Phys. Rev. Lett. 52, 1 (1984).\n[9] H.U. Baranger, R.A. Jalabert, and A.D. Stone, Chaos 3, 665 (1993).\n\n17\n\n\f[10] K. Richter, Semiclassical Theory of Mesoscopic Quantum Systems\n(Springer, Berlin, 2000).\n[11] R.A. Jalabert, The semiclassical tool in mesoscopic physics, in: Proceedings\nof the International School of Physics Enrico Fermi, New Directions in\nQuantum Chaos, Course CXLIII, G. Casati, I. Guarneri and U. Smilansky\n(eds.), (IOS Press, Amsterdam, 2000).\n[12] S. Datta, Electronic Transport in Mesoscopic Systems (Cambridge University Press, Cambridge, 1995).\n[13] D.S. Fisher and P.A. Lee, Phys. Rev. B 23, 6851 (1981).\n[14] J. Wurm, A. Rycerz, İ. Adagideli, M. Wimmer, K. Richter, and H.U.\nBaranger, Phys. Rev. Lett. 102, 056806 (2009).\n[15] S. Chakravarty and A. Schmid, Phys. Rep. 140, 193 (1986).\n[16] For a derivation of a similar sum rule starting from ergodicity, see M. Sieber,\nJ. Phys. A 32, 7679 (1999).\n[17] M. Sieber and K. Richter, Physica Scripta T90, 128 (2001); M. Sieber, J.\nPhys. A 35, L613 (2002).\n[18] A. Lassl, Semiklassik jenseits der Diagonalnäherung: Anwendung auf ballistische mesoskopische Systeme, diploma thesis, Universität Regensburg,\n(2003).\n[19] R.V. Jensen, Chaos, 1, 101 (1991).\n[20] Ph. Jacquod and R.S. Whitney, Phys. Rev. B 73, 195115 (2006).\n[21] B.V. Chirikov, F.M. Izrailev, and D.L. Shepelyansky, Sov. Sci. Rev. Sect.\nC 2, 209 (1981).\n[22] I.L. Aleiner and A.I. Larkin, Phys. Rev. B 54, 14423 (1996).\n[23] İ. Adagideli, Phys. Rev. B 68, 233308 (2003).\n[24] S. Rahav and P.W. Brouwer, Phys. Rev. Lett. 96, 196804 (2006).\n[25] P.W. Brouwer and S. Rahav, Phys. Rev. B 74, 075322 (2006).\n[26] M. Turek and K. Richter, J. Phys. A 36, L455 (2003); M. Turek, Semiclassics beyond the diagonal approximation, PhD thesis, Universität Regensburg, (2004).\n[27] D. Spehner, J. Phys. A 36, 7269 (2003).\n[28] S. Müller, S. Heusler, P. Braun, F. Haake, and A. Altland, Phys. Rev. Lett.\n93, 014103 (2004).\n[29] S. Heusler, S. Müller, P. Braun, and F. Haake, Phys. Rev. Lett. 96, 066804\n(2006); S. Müller, S. Heusler, P. Braun, and F. Haake, New J. Phys. 9, 12\n(2007).\n\n18\n\n\f[30] P. Gaspard, Chaos, Scattering and Classical Mechanics (Cambridge University Press, Cambridge, 1998).\n[31] C.W.J. Beenakker, Rev. Mod. Phys. 69, 731 (1997).\n[32] O. Zaitsev, D. Frustaglia, and K. Richter, Phys. Rev. Lett. 94, 026809\n(2005).\n[33] O. Zaitsev, D. Frustaglia, and K. Richter, Phys. Rev. B 72, 155325 (2005).\n[34] J. Bolte and D. Waltner, Phys. Rev. B 76, 075330 (2007).\n[35] P. Braun, S. Heusler, S. Müller, and F. Haake, J. Phys. A 39, L159 (2006);\nR.S. Whitney and Ph. Jacquod, Phys. Rev. Lett. 96, 206804 (2006).\n[36] G. Berkolaiko, J.M. Harrison, and M. Novaes, J. Phys. A 41, 365102 (2008).\n[37] P.W. Brouwer and A. Altland, Phys. Rev. B 78, 075304 (2008).\n[38] C. Petitjean, D. Waltner, J. Kuipers, İ. Adagideli, and K. Richter, preprint,\narXiv:0906.1791.\n[39] D. Waltner, M. Gutiérrez, A. Goussev, and K. Richter, Phys. Rev. Lett.\n101, 174101 (2008); M. Gutiérrez, D. Waltner, J. Kuipers, and K. Richter,\nPhys. Rev. E 79, 046212 (2009).\n\n19\n\n\f"}