{"id": "http://arxiv.org/abs/0910.5201v1", "guidislink": true, "updated": "2009-10-27T18:35:41Z", "updated_parsed": [2009, 10, 27, 18, 35, 41, 1, 300, 0], "published": "2009-10-27T18:35:41Z", "published_parsed": [2009, 10, 27, 18, 35, 41, 1, 300, 0], "title": "Theoretical study of hydrogen microstructure in models of hydrogenated\n  amorphous silicon", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0910.0797%2C0910.5655%2C0910.1387%2C0910.3626%2C0910.0228%2C0910.4636%2C0910.4260%2C0910.5813%2C0910.2572%2C0910.5425%2C0910.3483%2C0910.0338%2C0910.0217%2C0910.2480%2C0910.5340%2C0910.0903%2C0910.3263%2C0910.4920%2C0910.1105%2C0910.1307%2C0910.5482%2C0910.5754%2C0910.4109%2C0910.4663%2C0910.3487%2C0910.5945%2C0910.0278%2C0910.3624%2C0910.0603%2C0910.0300%2C0910.0232%2C0910.4794%2C0910.0599%2C0910.3731%2C0910.5095%2C0910.0635%2C0910.4036%2C0910.1072%2C0910.1967%2C0910.2991%2C0910.5201%2C0910.4238%2C0910.2927%2C0910.2171%2C0910.5876%2C0910.0796%2C0910.3034%2C0910.0739%2C0910.3521%2C0910.1577%2C0910.0722%2C0910.1628%2C0910.0448%2C0910.5384%2C0910.3611%2C0910.3935%2C0910.5478%2C0910.5811%2C0910.5913%2C0910.4721%2C0910.3319%2C0910.4761%2C0910.2867%2C0910.2850%2C0910.5160%2C0910.0782%2C0910.0943%2C0910.2966%2C0910.1873%2C0910.0231%2C0910.4487%2C0910.4059%2C0910.1619%2C0910.0741%2C0910.1725%2C0910.5695%2C0910.4028%2C0910.1032%2C0910.2910%2C0910.5839%2C0910.0626%2C0910.1716%2C0910.3571%2C0910.1337%2C0910.3720%2C0910.0876%2C0910.2855%2C0910.3205%2C0910.0725%2C0910.2670%2C0910.4436%2C0910.4912%2C0910.1230%2C0910.2891%2C0910.1522%2C0910.3606%2C0910.5039%2C0910.1246%2C0910.0918%2C0910.1251%2C0910.4458&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Theoretical study of hydrogen microstructure in models of hydrogenated\n  amorphous silicon"}, "summary": "We study the distribution of hydrogen and various hydride configurations in\nrealistic models of a-Si:H for two different concentration generated via\nexperimentally constrained molecular relaxation approach (ECMR) [1]. The\nmicrostructure corresponding to low (< 10%) and high (> 20%) concentration of H\natoms are addressed and are compared to the experimental results with\nparticular emphasis on the size of H clusters and local environment of H\natoms.The linewidths of the nuclear magnetic resonance (NMR) spectrum for the\nmodel configurations are calculated in order to compare to the experimental NMR\ndata. Our study shows the presence of isolated hydrogen atoms, small and\nrelatively large clusters with average proton-proton neighbor distance in the\nclusters around 1.6 to 2.4 Angstrom that have been observed in multiple quantum\nNMR experiments.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0910.0797%2C0910.5655%2C0910.1387%2C0910.3626%2C0910.0228%2C0910.4636%2C0910.4260%2C0910.5813%2C0910.2572%2C0910.5425%2C0910.3483%2C0910.0338%2C0910.0217%2C0910.2480%2C0910.5340%2C0910.0903%2C0910.3263%2C0910.4920%2C0910.1105%2C0910.1307%2C0910.5482%2C0910.5754%2C0910.4109%2C0910.4663%2C0910.3487%2C0910.5945%2C0910.0278%2C0910.3624%2C0910.0603%2C0910.0300%2C0910.0232%2C0910.4794%2C0910.0599%2C0910.3731%2C0910.5095%2C0910.0635%2C0910.4036%2C0910.1072%2C0910.1967%2C0910.2991%2C0910.5201%2C0910.4238%2C0910.2927%2C0910.2171%2C0910.5876%2C0910.0796%2C0910.3034%2C0910.0739%2C0910.3521%2C0910.1577%2C0910.0722%2C0910.1628%2C0910.0448%2C0910.5384%2C0910.3611%2C0910.3935%2C0910.5478%2C0910.5811%2C0910.5913%2C0910.4721%2C0910.3319%2C0910.4761%2C0910.2867%2C0910.2850%2C0910.5160%2C0910.0782%2C0910.0943%2C0910.2966%2C0910.1873%2C0910.0231%2C0910.4487%2C0910.4059%2C0910.1619%2C0910.0741%2C0910.1725%2C0910.5695%2C0910.4028%2C0910.1032%2C0910.2910%2C0910.5839%2C0910.0626%2C0910.1716%2C0910.3571%2C0910.1337%2C0910.3720%2C0910.0876%2C0910.2855%2C0910.3205%2C0910.0725%2C0910.2670%2C0910.4436%2C0910.4912%2C0910.1230%2C0910.2891%2C0910.1522%2C0910.3606%2C0910.5039%2C0910.1246%2C0910.0918%2C0910.1251%2C0910.4458&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We study the distribution of hydrogen and various hydride configurations in\nrealistic models of a-Si:H for two different concentration generated via\nexperimentally constrained molecular relaxation approach (ECMR) [1]. The\nmicrostructure corresponding to low (< 10%) and high (> 20%) concentration of H\natoms are addressed and are compared to the experimental results with\nparticular emphasis on the size of H clusters and local environment of H\natoms.The linewidths of the nuclear magnetic resonance (NMR) spectrum for the\nmodel configurations are calculated in order to compare to the experimental NMR\ndata. Our study shows the presence of isolated hydrogen atoms, small and\nrelatively large clusters with average proton-proton neighbor distance in the\nclusters around 1.6 to 2.4 Angstrom that have been observed in multiple quantum\nNMR experiments."}, "authors": ["Rajendra Timilsina", "Parthapratim Biswas"], "author_detail": {"name": "Parthapratim Biswas"}, "author": "Parthapratim Biswas", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1002/pssa.200982869", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/0910.5201v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0910.5201v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "5 pages, 5 figures", "arxiv_primary_category": {"term": "cond-mat.mtrl-sci", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cond-mat.mtrl-sci", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "cond-mat.dis-nn", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0910.5201v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0910.5201v1", "journal_reference": null, "doi": "10.1002/pssa.200982869", "fulltext": "physica status solidi, 26 October 2018\n\nTheoretical study of hydrogen\nmicrostructure in models of\nhydrogenated amorphous silicon\nRajendra Timilsina , Parthapratim Biswas *\n\narXiv:0910.5201v1 [cond-mat.mtrl-sci] 27 Oct 2009\n\nDepartment of Physics and Astronomy, The University of Southern Mississippi, Hattiesburg, MS 39406, USA\n\nReceived XXXX, revised XXXX, accepted XXXX\nPublished online XXXX\nPACS 71.23.Cq, 71.15.Mb, 71.23.An\n∗\n\nCorresponding author: e-mail Partha.Biswas@usm.edu, Phone: +1-601-2665156, Fax: +1-601-2665149\n\nWe study the distribution of hydrogen and various hydride configurations in realistic models of a-Si:H for\ntwo different concentration generated via experimentally\nconstrained molecular relaxation approach (ECMR) [1].\nThe microstructure corresponding to low ( < 10%) and\nhigh (> 20%) concentration of H atoms are addressed\nand are compared to the experimental results with particular emphasis on the size of H clusters and local environment of H atoms.\n\nThe linewidths of the nuclear magnetic resonance\n(NMR) spectrum for the model configurations are calculated in order to compare to the experimental NMR\ndata. Our study shows the presence of isolated hydrogen\natoms, small and relatively large clusters with average\nproton-proton neighbor distance in the clusters around\n1.6 - 2.4 Å that have been observed in multiple quantum\nNMR experiments.\n\nCopyright line will be provided by the publisher\n\n1 Introduction Hydrogenated amorphous silicon (aSi:H) is a very important material with a wide variety\nof technological applications ranging from photovoltaics\nto memory switching devices, thin film transistors, solar\ncells, optical scanners and numerous other electronic instruments [3]. The material has been studied extensively\nstarting from its structural, electronic to vibrational and\noptical properties that produced a large volume of experimental data. In spite of this, our understanding of a-Si:H\nfrom theoretical point of view is very limited. Some of\nthe very fundamental processes involving the material are\npoorly understood. For example, the creation of metastable\ndefects in the material upon prolonged exposure to light\nby breaking of a Si–Si bond next to Si–H bond, the socalled Staebler-Wronski effect (SW) [4], is perhaps the\nmost intriguing problem that is yet to be understood. Since\nmany of the proposed microscopic mechanisms that attempt to explain the SW effect are based on bond-breaking\nmodels [5] [6], it is crucial to understand the distribution of H atoms and their dynamics in the amorphous\nnetwork. Although there exists a number of experimental\nstudies on hydrogen distribution in the material via nu-\n\nclear magnetic resonance (NMR) [7][8][9] and infrared\n(IR) spectroscopy[10], there are very few theoretical studies that address the problem explicitly [11][12].\nIn this paper we propose to calculate the hydrogen microstructure of realistic models of a-Si:H at low and high\nconcentration. Since one-dimensional NMR data cannot be\nuniquely mapped onto real-space distribution without the\nuncertainty of various fitting procedures, it is much more\nuseful and convenient to employ first-principles models of\na-Si:H to generate a distribution of hydrogen atoms. The\nNMR linewidths of the distribution can be obtained from a\nknowledge of the position of the spins in the network using\na suitable approximation on the shape of the linespectra.\nThis approach provides a direct route to study the number\nand the size of hydrogen clusters, their local environment,\nand the effect of the cluster size on the NMR linewidths.\nThe dependence of H microstructure on the concentration\nof H atoms is also addressed and a comparison is made to\nexperimental data. The plan of the paper is as follows. In\nsection 2, we summarize the various experimental results\nfrom NMR experiments. Section 3 then describes briefly\nthe a-Si:H models, and the resulting distribution of hyCopyright line will be provided by the publisher\n\n\f2\n\nTimilsina et al.: Hydrogen microstructure of a-Si:H\n\ndrogens at two different concentration with emphasize on\nsparse and clustered environment. In section 4, we calculate the NMR linewidths for the models and compared to\nexperimental data, which is then followed by conclusion of\nour work.\n\n2 Summary of experimental results The two principal methods that are used to obtain experimental data on\nhydrogen distribution in a-Si:H are nuclear magnetic resonance (NMR)[7][8][9] and infrared spectroscopy (IR)[10].\nThe former provides useful information about the local environment of H atoms, whereas the latter plays a dominant\nrole in determining the nature of various silicon-hydrogen\nbonding configurations. Experimental data suggest that\nH atoms can reside both in isolated and clustered phase\nand that the distribution can be highly inhomogeneous\n[9] [13], which depends on a number of factors such as\npreparation conditions, method of deposition, substrate\ntemperature etc. A typical NMR spectrum of a devicequality sample shows the presence of both narrow and\nbroad linewidths, which can be approximated as a convolution of a Lorentzian (narrow) and Gaussian (broad)\ndistribution. The dipolar interaction between the protons\nsuggests that the narrow width is associated with a dilute\nor sparse distribution of spins, whereas a dense or clustered environment is needed to produce a broad linewidth\nin the resonance spectrum. Baum et al. [8] demonstrated\nvia multiple-quantum NMR experiments that for devicequality samples the clustering of H atoms increases with\nthe increase of H concentration. The typical size of the\nclusters found in their work was of the order of 4-6 atoms,\nand with increasing concentration the clusters became\nphysically closer to one another. NMR and IR measurements by Gleason et al. [14] of a-Si:H prepared via plasmaenhanced chemical vapor deposition (PECVD) also confirmed this observation. These authors reported the presence of isolated, small and medium size clusters in the\nsamples that gave rise to both broad and narrow linewidths\nof about 28-33 kHz and 6-12 kHz respectively in the concentration range 10 - 16%. In other words, the picture that\nemerges from NMR and IR experiments on samples prepared by a variety of methods is that for device-quality\nsamples H prefers to be distributed sparsely in the sample\nwith occasional clustering at low temperature. While the\nclustering is more likely at high concentration, the microstructure can be very inhomogeneous, and may consist\nof few large clusters even at very low concentration. An\nexample of such inhomogeneous distribution of hydrogen\natoms was reported by Wu et al. in hot-filament-assisted\nCVD deposited a-Si:H film [9]. They observed a significantly large width of about 50 kHz in HW sample at\nvery low concentration (2-3%) consisting of at least one\nH complex that was quite different from device-quality\nglow-discharged a-Si:H at 8-10%. This broad width is an\nindicative of the presence of large clusters in the sample\nCopyright line will be provided by the publisher\n\nFigure 1 (Color online) Hydrogen distribution and its lo-\n\ncal environment in a model of a-Si:H with 7% H atoms.\nThe distribution of H atoms (in yellow/white) is sparse\nshowing isolated, monohydride and dihydride configurations. The Si atoms are shown in blue/black with the\nexception of the one in the dihydride configuration (in\ngreen/white).\n\nthat makes the distribution very inhomogeneous even at\nvery low concentration.\n3 Microstructure from model a-Si:H In order to\nstudy hydrogen microstructure, we have used two realistic\nmodels of a-Si:H obtained via experimentally constrained\nmolecular relaxation approach (ECMR)[1]. The method is\nbased on a hybrid approach that has two important components: 1) experimental data can be directly utilized in\nbuilding the model configurations, and 2) the model configurations are then driven via first-principles force-fields\nto obtain the minimum energy configuration. The method\nis unique in the sense that it is able to avoid some of the\ncommon pitfalls of both traditional first-principle molecular dynamics (small size, and large simulation time),\nand the uncertainty associated with constructing models\nsolely based on limited experimental data (such as reverse\nMonte Carlo [2]). We generate two models for our purpose\nof microstructure calculation. The first model consists of\n540 atoms with 7% H atoms, while the second one has\n611 atoms with 22% H atoms. The structural, electronic\nand vibrational properties of the models had been extensively studied by one of us and were compared to experimental data obtained from X-ray and Neutron diffraction\nmeasurements[15]. Since the microstructure can be very\nsensitive to the details of the model construction, it is\nimportant to validate the properties of model networks\nwith experimental data prior to addressing hydrogen microstructure.\nThe 540-atom model with 7% H atoms has very few\ndefects and closely corresponds to a device-quality sample at low concentration. The model has a clean electronic\n\n\fpss header will be provided by the publisher\n\nband gap and the correct vibrational density of states showing the characteristic acoustic and optical peaks that have\nbeen discussed at length in Ref.[15]. A real-space analysis of this model shows the presence of both isolated and\nclustered phase of H atoms. In fig.1 we have shown the\ndistribution of hydrogens in a region of linear dimension\n6 Å that consists of 6-7 H atoms. The presence of isolated\nH atom, Si-H and SiH2 configurations are also visible in\nthe figure. An SiH2 configuration is explicitly shown with\nthe Si atom in green/white. The local environment of this\nSi atom shows clustering of H atoms within the radius of\n3-4 Å. The model consists of several such regions some\nof which have more dilute or dispersed atoms, while the\nothers are relatively less sparse with small clusters of 4-5\natoms. The proton-proton distance in this model is approximately lying between 1.6 Å to 2.4 Å. Our analysis shows\nthat although there are few clustered phase (within 4-6 Å),\nthere are regions where the H atoms are separated by relatively large distances. The overall microstructure of the\nmodel is shown in fig. 3 without the embedding Si matrix\n(except silicon-hydrogen bonding) in order to highlight the\nsparse and densely occupied regions. It is evident that H\ndistribution is quite sparse (except for few small clusters)\nconsisting of few isolated H atoms, monohydride SiH and\ndihydride SiH2 configurations. Gleason et al. [14] studied\na-Si:H films obtained by plasma enhanced CVD at various temperature in the concentration range 9 - 16 % of hydrogen via multiple quantum NMR (MQ-NMR) and suggested the presence of small clusters in the samples. Baum\net al. [8] also arrived at the similar conclusion studying\ndevice-quality samples via MQ-NMR in their works and\nreported the presence of cluster of 4 to 7 atoms. These observations are consistent with the results obtained from our\nmodel network. The implication of disperse and clustered\nenvironment of H atoms in the network on NMR linewidths\nis discussed in the next section.\nWe now consider the model with 22% hydrogen in the\nnetwork. This value is somewhat high for the model to\nbe considered as device-quality, nonetheless our intention\nis to study how the addition of more hydrogen changes\nthe microstructure in the network. Experimentally it has\nbeen observed that with increasing concentration hydrogen\natoms tend to form clusters until the concentration is high\nenough when small clusters are no longer visible [14]. In\nfig.2 we have shown the microstructure of a region of space\nhaving linear dimension of 6 Å. The clustering of hydrogen atoms surrounding an SiH4 configuration is explicitly\nshown in the figure. The local environment of this Si atom\nconsists of 6-8 H atoms, and both monohydride and dihydride configurations are realized in this model. In addition\nto these, some isolated H atoms are also found to exist in\nthe network. The entire region consists of about total 20\nH atoms showing both clustered and dispersed H atoms.\nFurther analysis of different regions in the same model\nsuggests that monohydrides can reside in both sparse and\nsmall clustered environment. The H-H neighbor distance\n\n3\n\nFigure 2 (Color online) Hydrogen microstructure in a\n\nmodel of a-Si:H with 22% H atoms showing a cluster of\nH atoms (in yellow/white) consists of 6-10 atoms. A representative SiH4 configuration is also shown with the Si\natom in green/white. The other configurations present in\nthe environment include isolated H atoms, SiH and SiH2 .\n\nin this model is found to be in the range of 1.6 - 2.4 Å and\nthe distribution is shown in fig.5. A closer inspection of\nthe local structure (with a cut-off 3.5 Å) reveals that higher\nvalues at 2.1 Å and 2.35 Å mostly originate from SiH2 and\nSiH4 configurations. This can be easily understood considering the bonding geometry of these configurations and\ntaking into account of Si-H bond length and H-Si-H bond\nangle distributions. The microstructure of the entire model\nis presented in fig.4 showing hydrogen configurations that\nare realized in our model. This clearly demonstrates the inhomogeneous nature of the microstructure of the model.\n4 NMR linewidths of model a-Si:H In the preceding\nsection we have discussed how the microstructure changes\nwith increasing hydrogen content of the sample. Since the\nlocal environment of H atoms is reflected in the shape and\nthe width of the NMR spectrum, one can obtain valuable\ninformation on microstructure from a knowledge of these\nquantities. However, direct calculation of NMR spectra is\nvery difficult from first-principles, and one usually resorts\nto the approximation that the spectrum can be expressed\nas a convolution of Lorentzian and Gaussian distributions.\nNMR experiments on variously prepared samples at different concentrations reveal that at very dilute concentration\nrandomly dispersed spins (via dipolar interaction) give rise\nto a narrow line width, whereas the presence of small clusters can be best attributed to the broader linewidth of the\nspectrum. These narrow and broad widths are generally assumed to be associated with the Lorentzian and Gaussian\nbroadening of the spectrum respectively. The concentration\nof hydrogen in our model is sufficiently high to assume that\nthe spectrum can be approximated by a Gaussian distribution to estimate the broad linewidth. This can be confirmed\nCopyright line will be provided by the publisher\n\n\f4\n\nTimilsina et al.: Hydrogen microstructure of a-Si:H\n\nvia calculation of Γ , the ratio of the fourth moment (μ4 )\nto the square of the second moment (μ2 ) for the model networks and compare to the same with a Gaussian distribution. A value close to 3 (for ideal Gaussian) suggests that\nthe spectrum can be approximated via Gaussian lineshape\n√\nfor which the FWHM is given by σ = 2.36 μ2 [16]. For\nan amorphous system with a random distribution of spins,\nthe second and the fourth moments are given by [16]:\nμ2 = −\n=\n\nT r[H, Ix2 ]\nT r[Ix2 ]\n\nN\nX\n3 4 2\n(1 − 3 cos2 θjk )2\nγ h̄ I(I + 1)\n6\n4N\nrjk\n\n(1)\n\nj6=k\n\nand\n\nFigure 3 (Color online) The overall hydrogen microstruc-\n\nT r[H, [H, Ix ]]2\nμ4 =\nT r[Ix2 ]\n\n(2)\n\nwhere N is the number of spins, I = 21 and θjk is the angle between the vector rjk with the applied magnetic field\ndirection. A somewhat less accurate but simplified expression for σ is given by [9],\n 12\nN\nX\n1\n1 \nσB (kHz) = 190 \n6\nN\nrij\n\nture of the model with 7% H obtained from the ECMR\nmethod. The Si matrix is removed (except Si-H bonds) in\norder to display the nature of microstructure at low concentration. The Si and H atoms are shown in red (dark grey)\nand green (light grey) respectively.\n\n\n\n(3)\n\ni6=j\n\nwhere rij is the distance between the spins in the unit of Å.\nSimilarly, an estimate of the narrow linewidth of the spectrum coming from the dispersed H atoms can be obtained\nfrom[16],\n4 π2\nσN = √ γ 2 h̄ n\n(4)\n3 3\nwhere n is the number density of the spins without counting\nthose in the clustered environment.\nIn table I, we have listed the ratio of the moments, Γ\nand both the narrow and broad linewidths (FWHM) for the\nmodels for two different concentration. The average value\nof the moment is obtained from Eq.3 and is indicated in the\ntable. The value of Γ is found to be close but less than 3\nin both the cases indicating the inhomogeneous nature of\nthe distribution. This is expected in view of the inhomogeneous microstructure that we have seen in figs.1 and 3.\nThese values are consistent with those reported in the literature [3] [9]. The broad linewidth associated with 22%\nH concentration is of the order of 50kHz, which is somewhat high but is expected here because of the presence of a\nlarge cluster (cf. fig. 2) of linear dimension 6.0 Å. Our results support the recent observation of a significantly large\nlinewidth in hot-filament-assisted CVD deposited films by\nWu et al. [9]. On the basis of their NMR data, these authors suspected the presence of large H clusters in the sample with few H nearest neighbors at a distance 1.6 - 1.8\nÅ. Together with the microstructure, one can infer that\nCopyright line will be provided by the publisher\n\nFigure 4 (Color online) The overall hydrogen microstruc-\n\nture of the model at high concentration (22% of H). Once\nagain Si (in red/dark grey) and H (in green/light grey)\natoms are displayed for clarity. Several H clusters are\npresent along with few isolated H atoms, SiH and SiH2\nconfigurations. Note that the microstructure consists of a\ncombination of sparse and clustered environment that are\nobserved experimentally.\nlarge H complexes (with 20 H atoms) are realizable, and\nwhen present they can produce a very broad linewidth in\nthe spectrum.\n5 Conclusion The hydrogen microstructure in two\nrealistic models of a-Si:H is studied at low and high concentration of H atoms. The distribution of H atoms in both\nthe models are found to be inhomogeneous that consists of\n\n\fpss header will be provided by the publisher\n\n5\n\nAcknowledgements PB acknowledges the support of the\nUniversity of Southern Mississippi under Grant No. DE00945\nand Aubrey Keith Lucas and Ella Ginn Lucas Endowment for\nawarding a fellowship under faculty excellence in research program.\n\nReferences\n\nFigure 5 The distribution of H-H distances in a model of\n\na-Si:H with 22% H atoms. A cut-off of 3.5 Å is used to obtain the distribution. The peak at 1.8 Å is found to originate\nfrom the small clustered environment, whereas the peaks at\n2.1 and 2.35 Å can be shown to appear from geometrical\nconsideration of SiH2 and SiH4 configurations.\n\nfew isolated H atoms, monohydrides and dihydrides that\nreside in both sparse and clustered environment. In addition, few SiH4 configurations are found to realize in our\nfirst-principles model networks. At low concentration, the\nmicrostructure essentially consists of few small clusters of\n4-5 atoms and a sparse distribution of H configurations. For\nthe network with high concentration of hydrogens, a cluster containing as many as 20 H atoms has been observed\nin a region of linear dimension 6 - 8 Å. The theoretical\nlinewidths obtained from the models using Gaussian and\ntruncated Lorentzian broadening match with experimental\ndata. In particular, our study confirms the presence of large\nclusters of hydrogen with 1.8 - 2.4 Å as H-H neighbor distances. The existing multiple quantum NMR data confirm\nour results.\n\n[1] P.Biswas,D.N.Tafen, and D.A.Drabold, Phys. Rev. B71,\n054204 (2005)\n[2] R.L. McGreevy, J. Phys.:Condens. Matter 13 R877 (2001);\nP.Biswas, R. Atta-Fynn, and D.A.Drabold, Phys. Rev. B\n69, 195207 (2004)\n[3] R.A.Street, Hydrogenated Amorphous Silicon, Cambridge\nSolid State Science Series, (1991)\n[4] D.L. Staebler and C.R. Wronski, Appl. Phys. Lett., 31, 292\n(1977)\n[5] M. Stutzmann, W. Jackson, C.C. Tsai, Phys. Rev. B32, 23\n(1985)\n[6] S.T. Pantelides, Phys. Rev. B36, 3479 (1987)\n[7] J.A.Reimer and R.W. Vaughan, Phys. Rev. Lett., 44, 193\n(1980)\n[8] J.Baum and et al. , Phys. Rev. Lett. 55, 1377 (1986)\n[9] Y.Wu,J.T.Stephen,\nD.X.Han,J.M.Rutland,R.S.Crandall,\nand A.H.Mahan, Phys. Rev. Lett.77, 10(1996)\n[10] C. Manfredotti, F. Fizzotti, M. Boero, P. Pastrino, P.\nPolesllo, and E. Vittone, Phys. Rev. B50, 18046 (1994)\n[11] P.Biswas, D.N.Tafen, F. Inam, B. Cai, and D.A. Drabold,\nJ. Phys.: Condens. Matter 21 (2009) 084207\n[12] S.Chakraborty,D.C.Bobela,P.C.Taylor,and\nD.A.Drabold, Mater. Res. Soc. Symp. Proc., 1066-A11-02\n(2008)\n[13] J.Daey Ouwens and R.E.I.Schropp, Phys. Rev. B54, 24\n(1996)\n[14] K.K.\nGleason,\nM.A.Petrich,and\nJeffrey\nA.\nReimer, Phys. Rev. B 36 3259 (1987)\n[15] P.Biswas, R.Atta-fynn, and D.A.Drabold, Phys. Rev. B76,\n125210 (2007)\n[16] A. Abragam, Principles of Nuclear Magnetism , Oxford\nUniversity Press, London (1983)\n\nTable 1 NMR linewidths for model a-Si:H\nConc (%)\n7\n\n22\n\nDirections\n001\n010\n100\n001\n010\n100\n\nσB (kHz)\n16.34 (17.33)\n19.68 (17.33)\n17.80 (17.33)\n52.38 (50.36)\n52.15 (50.36)\n49.92 (50.36)\n\nσN (kHz)\n2.8\n2.8\n2.8\n6.4\n6.4\n6.4\n\nΓ\n2.8\n2.6\n2.8\n2.9\n2.9\n2.9\nCopyright line will be provided by the publisher\n\n\f"}