{"id": "http://arxiv.org/abs/0707.3689v1", "guidislink": true, "updated": "2007-07-25T09:02:17Z", "updated_parsed": [2007, 7, 25, 9, 2, 17, 2, 206, 0], "published": "2007-07-25T09:02:17Z", "published_parsed": [2007, 7, 25, 9, 2, 17, 2, 206, 0], "title": "Parametrizations of triaxial deformation and E2 transitions of the\n  wobbling band", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0707.0973%2C0707.2088%2C0707.2381%2C0707.0906%2C0707.4589%2C0707.0589%2C0707.0980%2C0707.4576%2C0707.3643%2C0707.2607%2C0707.4296%2C0707.1411%2C0707.4464%2C0707.3975%2C0707.1740%2C0707.3933%2C0707.3507%2C0707.1088%2C0707.1582%2C0707.1058%2C0707.4096%2C0707.4562%2C0707.3531%2C0707.1641%2C0707.0039%2C0707.1831%2C0707.0819%2C0707.3829%2C0707.2520%2C0707.0064%2C0707.0200%2C0707.2799%2C0707.3562%2C0707.0078%2C0707.1373%2C0707.3959%2C0707.0188%2C0707.4158%2C0707.0812%2C0707.4059%2C0707.3542%2C0707.2059%2C0707.0046%2C0707.1694%2C0707.2198%2C0707.4509%2C0707.4191%2C0707.2560%2C0707.3969%2C0707.3383%2C0707.2790%2C0707.4294%2C0707.1298%2C0707.1471%2C0707.2123%2C0707.1321%2C0707.2263%2C0707.4177%2C0707.1810%2C0707.2802%2C0707.2115%2C0707.4129%2C0707.0879%2C0707.4551%2C0707.0113%2C0707.4418%2C0707.2241%2C0707.3306%2C0707.1330%2C0707.3634%2C0707.4211%2C0707.0418%2C0707.3689%2C0707.1422%2C0707.2236%2C0707.3663%2C0707.1529%2C0707.4338%2C0707.1036%2C0707.2472%2C0707.3775%2C0707.1585%2C0707.2497%2C0707.4184%2C0707.0476%2C0707.0490%2C0707.3425%2C0707.1064%2C0707.0084%2C0707.2640%2C0707.4271%2C0707.4628%2C0707.1941%2C0707.1993%2C0707.1118%2C0707.3137%2C0707.4324%2C0707.1606%2C0707.3855%2C0707.0989%2C0707.3676&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Parametrizations of triaxial deformation and E2 transitions of the\n  wobbling band"}, "summary": "By the very definition the triaxial deformation parameter $\\gamma$ is related\nto the expectation values of the K=0 and K=2 components of the intrinsic\nquadrupole tensor operator. On the other hand, using the same symbol\n\"$\\gamma$\", various different parametrizations of triaxial deformation have\nbeen employed, which are suitable for various types of the mean-field\npotentials. It is pointed out that the values of various \"$\\gamma$\" are quite\ndifferent for the same actual triaxial deformation, especially for the large\ndeformation; for example, the difference can be almost a factor two for the\ncase of the triaxial superdeformed bands recently observed in the Hf and Lu\nnuclei. In our previous work, we have studied the wobbling band in Lu nuclei by\nusing the microscopic framework of the cranked Nilsson mean-field and the\nrandom phase approximation, where the most serious problem is that the\ncalculated B(E2) value is about factor two smaller. It is shown that the origin\nof this underestimation can be mainly attributed to the small triaxial\ndeformation; if is used the same triaxial deformation as in the analysis of the\nparticle-rotor model, the calculated B(E2) increases and gives correct\nmagnitude compared with the experimental data.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0707.0973%2C0707.2088%2C0707.2381%2C0707.0906%2C0707.4589%2C0707.0589%2C0707.0980%2C0707.4576%2C0707.3643%2C0707.2607%2C0707.4296%2C0707.1411%2C0707.4464%2C0707.3975%2C0707.1740%2C0707.3933%2C0707.3507%2C0707.1088%2C0707.1582%2C0707.1058%2C0707.4096%2C0707.4562%2C0707.3531%2C0707.1641%2C0707.0039%2C0707.1831%2C0707.0819%2C0707.3829%2C0707.2520%2C0707.0064%2C0707.0200%2C0707.2799%2C0707.3562%2C0707.0078%2C0707.1373%2C0707.3959%2C0707.0188%2C0707.4158%2C0707.0812%2C0707.4059%2C0707.3542%2C0707.2059%2C0707.0046%2C0707.1694%2C0707.2198%2C0707.4509%2C0707.4191%2C0707.2560%2C0707.3969%2C0707.3383%2C0707.2790%2C0707.4294%2C0707.1298%2C0707.1471%2C0707.2123%2C0707.1321%2C0707.2263%2C0707.4177%2C0707.1810%2C0707.2802%2C0707.2115%2C0707.4129%2C0707.0879%2C0707.4551%2C0707.0113%2C0707.4418%2C0707.2241%2C0707.3306%2C0707.1330%2C0707.3634%2C0707.4211%2C0707.0418%2C0707.3689%2C0707.1422%2C0707.2236%2C0707.3663%2C0707.1529%2C0707.4338%2C0707.1036%2C0707.2472%2C0707.3775%2C0707.1585%2C0707.2497%2C0707.4184%2C0707.0476%2C0707.0490%2C0707.3425%2C0707.1064%2C0707.0084%2C0707.2640%2C0707.4271%2C0707.4628%2C0707.1941%2C0707.1993%2C0707.1118%2C0707.3137%2C0707.4324%2C0707.1606%2C0707.3855%2C0707.0989%2C0707.3676&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "By the very definition the triaxial deformation parameter $\\gamma$ is related\nto the expectation values of the K=0 and K=2 components of the intrinsic\nquadrupole tensor operator. On the other hand, using the same symbol\n\"$\\gamma$\", various different parametrizations of triaxial deformation have\nbeen employed, which are suitable for various types of the mean-field\npotentials. It is pointed out that the values of various \"$\\gamma$\" are quite\ndifferent for the same actual triaxial deformation, especially for the large\ndeformation; for example, the difference can be almost a factor two for the\ncase of the triaxial superdeformed bands recently observed in the Hf and Lu\nnuclei. In our previous work, we have studied the wobbling band in Lu nuclei by\nusing the microscopic framework of the cranked Nilsson mean-field and the\nrandom phase approximation, where the most serious problem is that the\ncalculated B(E2) value is about factor two smaller. It is shown that the origin\nof this underestimation can be mainly attributed to the small triaxial\ndeformation; if is used the same triaxial deformation as in the analysis of the\nparticle-rotor model, the calculated B(E2) increases and gives correct\nmagnitude compared with the experimental data."}, "authors": ["Yoshifumi R. Shimizu", "Takuya Shoji", "Masayuki Matsuzaki"], "author_detail": {"name": "Masayuki Matsuzaki"}, "author": "Masayuki Matsuzaki", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1103/PhysRevC.77.024319", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/0707.3689v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0707.3689v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "10 pages, 9 figures", "arxiv_primary_category": {"term": "nucl-th", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "nucl-th", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0707.3689v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0707.3689v1", "journal_reference": "Phys.Rev.C77:024319,2008", "doi": "10.1103/PhysRevC.77.024319", "fulltext": "Parametrizations of triaxial deformation and E2 transitions of the wobbling band\nYoshifumi R. Shimizu,1 Takuya Shoji,1 and Masayuki Matsuzaki2\n\narXiv:0707.3689v1 [nucl-th] 25 Jul 2007\n\n1\n\nDepartment of Physics, Graduate School of Sciences, Kyushu University, Fukuoka 812-8581, Japan\n2\nDepartment of Physics, Fukuoka University of Education, Munakata, Fukuoka 811-4192, Japan\n(Dated: October 24, 2018)\nBy the very definition the triaxial deformation parameter γ is related to the expectation values\nof the K = 0 and K = 2 components of the intrinsic quadrupole tensor operator. On the other\nhand, using the same symbol \"γ\", various different parametrizations of triaxial deformation have\nbeen employed, which are suitable for various types of the mean-field potentials. It is pointed\nout that the values of various \"γ\" are quite different for the same actual triaxial deformation,\nespecially for the large deformation; for example, the difference can be almost a factor two for the\ncase of the triaxial superdeformed bands recently observed in the Hf and Lu nuclei. In our previous\nwork, we have studied the wobbling band in Lu nuclei by using the microscopic framework of the\ncranked Nilsson mean-field and the random phase approximation, where the most serious problem\nis that the calculated B(E2) value is about factor two smaller. It is shown that the origin of this\nunderestimation can be mainly attributed to the small triaxial deformation; if is used the same\ntriaxial deformation as in the analysis of the particle-rotor model, the calculated B(E2) increases\nand gives correct magnitude compared with the experimental data.\nPACS numbers: 21.10.Re, 21.60.Jz, 23.20.Lv, 27.70.+q\n\nI.\n\nINTRODUCTION\n\nThe triaxial deformation of atomic nuclei has been one\nof the long standing issues in nuclear structure physics.\nIf not going back to the Davydov-Phillipov model [1], the\ntriaxial rotor model is very useful to study the spectra\nof odd transitional nuclei [2]. More recently, the modelindependent sum-rule method [3] is used to analyse the\nCoulomb excitations for the quadrupole collective motions, where the triple E2 matrix elements is related the\nthe triaxiality parameter γ. Many of Coulomb excitation measurements revealed clearly non-axial deformation [4], although it was difficult to distinguish that the\nnon-axiality is of static or of dynamic nature. At highspin states, it was expected that the effect of triaxial\ndeformation appears more explicitly in the excitation energies and/or M 1/E2 transition probabilities, see [5, 6]\nand references therein; for example, the so-called signature staggering in odd or odd-odd nuclei was supposed\nto be a good indicator of triaxiality, but the result was\nnot so definite as expected.\nHowever, the situation has been changed quite recently: The nuclear wobbling motion [7] has been identified in some Lu isotopes, 163 Lu [8, 9, 10, 11], 165 Lu [12],\n167\nLu [13], and 161 Lu [14], and it is now believed that we\nare able to study how a triaxially deformed nucleus rotates. In fact it has been predicted that the strong triaxial deformation appears in this mass region [15, 16, 17],\ni.e. the Hf and Lu region, where the wobbling phonon\nexcitations have been measured. The triaxial deformation predicted in such nuclei is the so-called positive γ\nshape in the Lund convention [18], i.e. nuclei rotate\nabout the shortest axis, with the Nilsson deformation\nparameters (ǫ2 , γ) ≈ (0.43, 20◦), and the associated rotational sequence is called the triaxial superdeformed\n(TSD) band [19].\n\nIn order to pin down how much the TSD nucleus deforms triaxially, in which the wobbling excitation is measured, one needs to have recourse to some model. The\nstandard one is the triaxial rotor model [1], where the\nhigh-spin states should be considered [7]. In this model,\nthe effect of triaxial deformation appears primarily in the\nthree different moments of inertia and the two intrinsic\nquadrupole moments of nucleus. The formers are mainly\nresponsible to the excitation energies, while the latters\nare directly reflected in the E2 transition probabilities.\nCompared with the moments of inertia which are sensitive to other factors, like the pairing correlations, the E2\ntransition probabilities are more direct and robust quantities, and therefore, the measurements of B(E2) [20, 21],\nnot only that of in-band (intraband) but of out-of-band\n(interband) between the yrast TSD band and the excited wobbling band, are crucial to obtain the information about the triaxial deformation. The detailed study\nby using the particle-rotor model [8, 22, 23], where an\nodd i13/2 proton is coupled to the triaxial rotor, which\nis suitable for the description of odd Lu TSD bands, revealed that the observed ratio of out-of-band to in-band\nB(E2)'s, B(E2)out /B(E2)in , is consistent to the triaxiality parameter γ ≈ 20◦ .\nIn this respect, it is worthwhile mentioning Ref. [24],\nwhere it is discussed that the out-of-band B(E2) from the\none-phonon wobbling band is not enough to distinguish\nthe γ-soft and γ-rigid triaxialities in nature. Further, it\nis proposed that the measurement of the B(E2) between\nthe odd-spin and even-spin members of the wobbling excitations is crucial to distinguish the two. Here eveneven nuclei are considered in [24] so that the observed\none-phonon wobbling band corresponds to the odd-spin\nmembers for the even-spin yrast TSD band. In some Lu\nisotopes the so-called two-phonon wobbling bands have\nbeen observed [11, 12], which corresponds to the even-\n\n\f2\nspin members of the wobbling excitations for even-even\nnuclei. The B(E2) values from the two-phonon to onephonon wobbling band are measured to be about two\ntimes the values from the one-phonon wobbling to yrast\nband, which clearly fits the picture of the γ-rigid model\nrather than the γ-soft model. Although the negative γ\nshape is assumed in Ref. [24], which is believed to be opposite to what is measured in Lu isotopes (see below),\nit does not affect the main issue; whether the γ-soft or\nγ-rigid model is superior. In this way, it is more likely\nthat the triaxial deformation is of static nature, i.e. the\nrigid model is more suitable, and it is meaningful to ask\nhow much triaxial deformation the observed TSD bands\nhave.\nIt should, however, be noticed that the conventional\nmacroscopic rotor model with irrotational moments of inertia has an essential problem; the rotor rotates around\nthe intermediate axis, which corresponds to the negative γ shape, and conflicts to the measured B(E2) ratio. Therefore, in Refs. [8, 22, 23], the largest and intermediate moments of inertia are interchanged to simulate the positive γ shape. It is well-known that the\nnuclear moments of inertia are neither that of the rigidbody nor of the irrotational fluid, and microscopic models are necessary for their proper description. Thus,\nwe have investigated the wobbling motion in the Lu region [25, 26, 27] by employing a microscopic framework,\nthe cranked mean-field and the random phase approximation (RPA) [28, 29, 30]. This approach is suitable to\ndescribe the vibrational excitations in the rapidly rotating nuclei, see e.g. Refs. [31, 32, 33, 34, 35]; and have\nbeen used to study possible wobbling excitations in normal deformed nuclei in our previous works [36, 37], and\nmore recently in Refs. [38, 39].\nIn our approach the residual interaction is chosen consistently to a given mean-field, and there is no ambiguity\nof the force parameters for the RPA calculation. It has\nbeen found [25, 26, 27] that the RPA solutions, which\ncan be nicely interpreted as the wobbling phonons, do\nexist in the Lu region for a suitable range of deformation\nparameters corresponding to the prediction of the TSD\nbands. The calculated excitation energies is in a reasonable range in comparison with the experimental data,\nthough they do not fit the data very precisely. However,\nthe calculated B(E2) ratios are systematically smaller by\nabout a factor two to three, as long as is used the triaxiality parameter γ ≈ 20◦ , which is predicted by the NilssonStrutinsky calculations [17, 19] and is used in the analysis of the B(E2) ratio by the particle-rotor model [23].\nThe main issue of the present work is to discuss why\nour RPA calculations of the wobbling motion underpredict the B(E2) ratio. In the course of discussion, it is\nclarified that the various definitions of the triaxiality parameter γ give rather different values and one has to be\nvery careful when talking about the triaxial deformation\nespecially for a larger deformation like in the case of TSD\nbands.\nThe paper is organized as follows: Various existing def-\n\ninitions of the triaxiality parameter γ are reviewed, and\ntheir values for a given shape are calculated and compared in §II. Some general discussion on the relations\nbetween various definitions are also given there. After\ndiscussing the difference between the γ values used in\nthe Nilsson-Strutinsky calculations and the particle-rotor\nmodel, in §III, it is shown that our RPA calculation gives\na correct magnitude of the B(E2) ratios if is used the\ncorresponding triaxial deformation to the analysis of the\nrotor model. §IV is devoted to the summary. A part of\nthe present work was presented in some conference reports [40, 41].\n\nII.\n\nPARAMETRIZATIONS OF TRIAXIAL\nDEFORMATION\n\nThe amount of triaxial deformation is usually designated by the triaxiality parameter γ, but there are various definitions for it. In this section, we discuss the\nrelations between them and show how large their differences are for a given shape. It should be mentioned\nthat this problem has been already discussed in Ref. [42]\n(Appendix B) for the volume-conserving anisotropic harmonic oscillator potential. The present study generalizes\nits conclusion to more realistic potentials.\n\nA.\n\nBasic definition based on the quadrupole\nmoments\n\nOne of the most important characteristics of nuclei\nwith (static) triaxial deformation is the existence of two\ndistinct intrinsic quadrupole moments. In this paper we\nassume the intrinsic z-axis as a quantization axis and the\nx-axis as a rotation axis, and define the two moments [7],\nZ\n\nq\n\n Q0 ≡ 16π\nh\nQ̂\ni\n=\n(2z 2 − x2 − y 2 )ρ(r)d3 r,\n20\n5\nq Z\nq\n(1)\n\n Q2 ≡ 16π hQ̂22 i = 3 (x2 − y 2 )ρ(r)d3 r,\n5\n2\nwhere Q̂2K (K = 0, ±1, ±2) are the usual quadrupole operator in the intrinsic frame of the deformed nucleus, and\nρ(r) is the nucleonic density. These two moments are directly related to the in-band and out-of-band B(E2) values of the wobbling band according to the rotor model [7],\nand their measurements in the Lu isotopes [20, 21]\nuniquely determine these moments. In place of the two\nmoments, equivalent two quantities, the magnitude of\nmoments Q and the triaxiality parameter γ are usually\nused:\n√\n(2)\nQ0 = Q cos γ, − 2 Q2 = Q sin γ.\nHere we follow the Lund convention [18] of the sign of\nthe triaxiality parameter γ, which is opposite to that\nof Ref. [7]. In the following we are mainly concerned\n\n\f3\nwith the parameter γ, and consider the in-band and outof-band B(E2) ratio of the one-phonon wobbling band,\nwhich is independent of the magnitude of the moment Q;\nsee the next section.\nThe triaxiality parameter defined above reflects the nuclear density distribution and we call it \"γ(den)\" in this\nwork; i.e.\n√\n2hQ̂22 i\ntan γ(den) = −\n.\n(3)\nhQ̂20 i\nSince γ(den) depends on the calculated single-particle\nwave functions of the average nuclear potential, and on\nthe configuration of each nucleus, it is more convenient\nto introduce an another parameter \"γ(geo)\", which is\nmore directly related to the geometric shape of nucleus\nmathematically defined by the two dimensional surface\nΣ:\n√\n2hQ̂22 iuni\ntan γ(geo) = −\n,\n(4)\nhQ̂20 iuni\nwhere h iuni means that the expectation value is taken\nwith respect to the sharp-cut uniform density distribution,\n\u001a\nρ0 for r inside the surface Σ,\nρuni (r) ≡\n(5)\n0 otherwise.\n\nagree very well. In Fig. 1 the ratio γ(den)/γ(geo) is\nshown as a function of γ(geo), and we can see that they\ncoincide typically within 10% except in the small γ region, where both γ(den) and γ(geo) become zero and\nthe ratio is numerically unstable. This agreement corresponds to the so-called shape consistency between the\ndensity and the potential [43], which has been tested both\nfor the Nilsson and Woods-Saxon potentials for the axially symmetric deformations [44, 45]. Therefore, we can\npractically use γ(geo) in place of γ(den).\nThe definition of triaxiality parameter, γ(den) or\nγ(geo), is basic or fundamental in the sense that it is\ndirectly related to the B(E2) values of the triaxial rotor.\nIn the microscopic calculations by means of the HartreeFock or Hartree-Fock-Bogoliubov method, γ = γ(den) is\nthe only definition of the triaxial deformation, and no\nconfusion exists. It is, however, quite often that one\nstarts from some average nuclear potential, which is triaxially deformed, and calculates the potential energy surface or the total routhian surface to determine the selfconsistent deformation as in the case of the Strutinsky\nmethod. In such cases, a different type of definitions of\nthe triaxiality parameter γ has been used, which is chosen conveniently to specify the triaxial deformation of the\npotential. We call this third type of definition \"γ(pot)\":\nWe consider two well-known definitions in the followings,\ndepending on the employed potential.\nB.\n\nγ(pot) defined in the Nilsson potential\n\nAs a definite example of γ(pot), we take the Nilsson potential, or the modified oscillator potential, as\na mean-field potential, i.e. γ(pot:Nils). The deformation parameters in the Nilsson potential [18, 46, 47]\nconsidered in the present work are (ǫ2 , γ, ǫ4 ), which define the deformation of the velocity independent part of\npotential\nthrough\nthe single-stretched\ncoordinate, r ′ ≡\np\np\np\n( ωx /ω0 x, ωy /ω0 y, ωz /ω0 z), as\n1\nV (r) = M ω0 ωv (ǫ2 , γ, ǫ4 )r′2 ×\n2X\n\u0010\nX\n1−\nc2K Y2K (Ω′ ) −\nK=0,±2\n\nFIG. 1: The ratios γ(den)/γ(geo) are plotted as functions\nof γ(geo) for the cases of the Nilsson (solid line) and WoodsSaxon potentials (dashed line). The calculations have been\nperformed for the TSD band in 163 Lu, and the parameters\nused for the Nilsson potential are ǫ2 = 0.43, ǫ4 = 0.0, and\n∆n,p = 0.3 MeV, and those for the Woods-Saxon potential\nare β2 = 0.42, β4 = 0.034, and ∆n,p = 0.3 MeV, which has\nalmost the same shape as the case of the Nilsson potential\nat γ(geo) ≈ 10◦ in the minimum of the Nilsson-Strutinsky\ncalculation.\n\nIf the density is calculated within the mean-field approximation by using the average single-particle potential which has the same shape as the uniform density (5),\nthen these two triaxiality parameters, γ(den) and γ(geo),\n\nK=0,±2,±4\n\n\u0011\nc4K Y4K (Ω′ ) ,\n\n(6)\nwhere ω0 is the frequency of the spherical potential,\nωv (ǫ2 , γ, ǫ4 ) is determined by the volume conserving condition, Ω′ is the solid-angle of coordinate r′ , and the\ncoefficients c's are given by\n\nq\n16π\n\n\nc\n=\nγ,\n\n45 ǫ2 cos\n 20\nq\n\n\n\n c22 = c2−2 = − 8π\n45 ǫ2 sin γ,\n√\n(7)\n4π\n2\nc40 = 9 ǫ4 (5 cos\nγ + 1),\n\n\n√\n\n120π\n\n\nc = c4−2 = −\nǫ4 cos γ sin γ,\n\n9\n√\n 42\n\n70π\nc44 = c4−4 = 9 ǫ4 sin2 γ.\n\nNote that the three frequencies, ωx , ωy , and ωz , are\ngiven by Eq. (9) below. The nuclear shape Σ in this\n\n\f4\ncase is defined as an equi-potential surface of the potential, V (r) = const., and is uniquely determined once\nthe parameters (ǫ2 , γ, ǫ4 ) with γ = γ(pot:Nils) are given.\nIt is straightforward but rather complicated because of\nthe use of the single-stretched coordinate r′ in practice. Using this potential either the triaxiality parameter\nγ(den) or γ(geo) defined in the previous subsection can\nbe calculated as functions of these potential parameters\n(ǫ2 , γ = γ(pot:Nils), ǫ4 ).\n\nin 163 Lu. As is already shown in Fig. 1, γ(den) and\nγ(geo) are very similar, but γ(pot:Nils) is quite different:\nγ(pot:Nils) = 20◦ corresponds to γ(den) ≈ γ(geo) ≈ 11◦ ,\nso that the difference can be as much as about a factor\ntwo. In order to see how the difference between γ(geo)\nand γ(pot:Nils) changes for different ǫ2 values, three cases\nwith ǫ2 = 0.2, 0.4, 0.6 are shown in Fig. 3. It is clear that\nthe difference becomes larger for larger ǫ2 deformations:\nγ(geo) is only about 10◦ even though γ(pot:Nils) is put\n30◦ in the case of the superdeformed band, ǫ2 ≈ 0.6.\nIn the case of ǫ4 = 0, the Nilsson potential reduces to\nthe anisotropic harmonic oscillator potential except for\nthe l2 and l * s terms, which are irrelevant for the definition of the nuclear shape. It is instructive to consider\nsuch a case in order to understand the difference shown\nin Fig. 3. Then the shape is a volume-conserving ellipsoid\ndefined by simple equations,\n3\nX\ni=1\n\nFIG. 2: The triaxiality parameters γ(den) (dashed line) and\nγ(geo) (solid line) are shown as functions of the γ parameter\nin the Nilsson potential, γ(pot:Nils) (the thin diagonal line\nis just for a guide to the eyes). The calculations have been\nperformed for the TSD band in 163 Lu, and the parameters\nused are ǫ2 = 0.43, ǫ4 = 0.0, and ∆n,p = 0.3 MeV.\n\nωi2 x2i\n\n= const.,\n\nwith\n\n3\nY\n\nωi = ω03 .\n\n(8)\n\ni=1\n\nThe frequencies ωi (i = 1, 2, 3) for the x, y, z-directions,\nwhich are inversely proportional to the lengths of the\nellipsoid along these axes, are given by\n\u0012\n\u0013\n\u0010\n2\n2π \u0011\nωi = ωv 1 − ǫ2 cos γ +\ni , γ = γ(pot:Nils).\n3\n3\n(9)\nTherefore γ(geo) and γ(pot:Nils) are related through ωi\n(i = 1, 2, 3);\n√\n3 (ωy−2 − ωx−2 )\n,\n(10)\ntan γ(geo) =\n2ωz−2 − ωy−2 − ωx−2\n√\n3 (ωy − ωx )\n,\n(11)\ntan γ(pot:Nils) =\n2ωz − ωy − ωx\nwhich relate these two γ's for a given value of ǫ2 . In the\nlimit of small deformation parameters, ǫ2 ,|γ| ≪ 1, it is\neasy to confirm\n\u0010\n3 \u0011\nγ(geo) ≈ 1 − ǫ2 γ(pot:Nils).\n2\n\nFIG. 3: The triaxiality parameters γ(geo) with fixed ǫ2 and ǫ4\ndeformation parameters are shown as functions of γ(pot:Nils)\n(the thin diagonal line is just for a guide to the eyes). The\ndotted line is for the case with ǫ2 = 0.2, the dashed with\nǫ2 = 0.4, and the solid with ǫ2 = 0.6, respectively. The ǫ4\nparameter is set 0 for all the cases.\n\nIn Fig. 2, are depicted the relation between γ(den)\nand γ(pot:Nils) and that between γ(geo) and γ(pot:Nils)\nat a given (ǫ2 , ǫ4 ), which is suitable for the TSD band\n\n(12)\n\nNamely, the slope of curves at the origin in Fig. 3 changes\nwith ǫ2 with a rather large factor 23 , and this clearly explains that γ(geo) is smaller than γ(pot:Nils) more than\na factor two when ǫ2 is as large as 0.4 like in the case of\nthe TSD band.\nIn order to see how these different definitions of two triaxiality parameters, γ(geo) and γ(pot:Nils), change the\nappearance of potential energy surface, we show an example in Fig. 4. Here the ǫ4 parameter is chosen to minimize\nthe potential energy at each (ǫ2 , γ) mesh points. The parameter γ(geo) depends not only on (ǫ2 , γ(pot:Nils)) but\non ǫ4 , and it is impossible to calculate the (ǫ2 , γ(geo))\nmesh points before the minimization with respect to ǫ4 .\nTherefore, we made an approximation to set ǫ4 = 0\nwhen we prepare the (ǫ2 , γ(geo)) mesh points from the\n\n\f5\nmodel composed of the spherical Nilsson potential and\nthe QQ force as an effective interaction. The velocityindependent part of the Hartree potential in this model\nis given by\nV (r) =\n\n1\nM ω02 r2 − α20 Q̂20 − α22 (Q̂22 + Q̂2−2 ),\n2\n\n(13)\n\nwhere the Hartree condition requires α2K = χ hQ̂2K i\n(K = 0, 2) with χ being the QQ force strength, and\nthe potential reduces also to the anisotropic harmonic\noscillator (but the volume conservation condition is not\nnecessarily satisfied in this Hartree procedure). If the\nmodel space is not restricted, α2K is proportional to the\ntwo intrinsic quadrupole moments in Eq. (1), and then,\nthe triaxiality parameter\nof the density type (3) in this\n√\ncase is related to − 2 α22 /α20 , which can be expressed\nin terms of ωi (i = 1, 2, 3) as\n√\n3 (ωy2 − ωx2 )\ntan γ(den:QQ) =\n.\n(14)\n2ωz2 − ωy2 − ωx2\nIt is usual to parametrize the potential by the deformation parameter (δ, γ) with γ = γ(den:QQ)), in terms of\nwhich the frequencies are written in the form,\n\u0013\n\u0012\n\u0010\n2π \u0011\n4\ni , γ = γ(den:QQ).\nωi2 = ω02 1 − δ cos γ +\n3\n3\n(15)\nThus, the triaxiality parameters γ(geo) and γ(den:QQ)\nare quite different in this case: In the limit of small deformation parameters, δ,|γ| ≪ 1, they are related like\nγ(geo) ≈ (1 − 2δ) γ(den:QQ).\n\nFIG. 4: Potential energy surface obtained by the cranked\nNilsson Strutinsky calculation for the (π, α) = (+, +1/2) configuration in 163 Lu at I = 41/2+ . The energy between contours is 250 keV. The triaxiality parameter γ = γ(pot:Nils) is\nused as usual in the upper panel, while the triaxiality parameter γ = γ(geo) in the lower panel.\n\n(ǫ2 , γ(pot:Nils)) mesh points. As is clear from the figure, the surface is squeezed to the γ = 0 axis at larger\ndeformation, and apparently the TSD minimum moves\nto smaller triaxial values. In Fig. 4, only the γ parameter is replaced from γ(pot:Nils) to γ(geo). However, it\nmay be better to replace ǫ2 to the other parameter corresponding to the magnitude Q in Eq.(2) in order to make\nthe meaning of the quadrupole deformation clearer. Constraint Hartree-Fock(-Bogoliubov) type calculations are\nnecessary for such a purpose. Then the method becomes\nmuch more involved and the simplicity of the Strutinsky\ntype calculation may be lost.\nIt may be worthwhile mentioning, here, the specific\n\n(16)\n\nNamely, the difference is even larger than that between\nγ(geo) and γ(pot:Nils). This means that the shape consistency between the density and the potential is strongly\nviolated in the QQ force model, if the full model space is\nused in the Hartree procedure. Considering this on top\nof the fact that the volume conservation condition is not\nguaranteed, the model is not realistic at all.\nActually, the QQ force model is supposed to be a model\nin a restricted model space, and the contributions of the\n\"core\" should be added to hQ̂2K i calculated within the\nmodel space in order to obtain the intrinsic moments\nof the whole system. Then the problem of breaking\nthe shape consistency may not be the real problem. In\nfact, the core contributions of the quadrupole operators,\ni.e. the expectation values for the closed shell configurations in the anisotropic harmonic oscillator potential,\nhave different dependence on the deformation; it can be\nshown [42] that they lead to the triaxiality parameter\nγ = γ(den:core), which satisfies\n√\n3 (ωy−1 − ωx−1 )\ntan γ(den:core) =\n.\n(17)\n2ωz−1 − ωy−1 − ωx−1\nIn Ref. [42] (see Appendix B of this reference for details, but note the different notations used there), these\n\n\f6\ndifferences between various types of the deformation parameters defined in the harmonic oscillator potential\nwere already discussed, where not only the parameter\nγ but\nother one of a pair of the parameters,\nq also the\nPA\n2\nQ/h\nβ = 4π\nk=1 r i, were considered. It was already\n5\npointed out that the triaxiality parameters for a given\nshape in various types of definition take quite different\nvalues.\n\nC.\n\nγ(pot) defined in the Woods-Saxon potential\n\nAs an another example of γ(pot), the parametrization\nof deformation in the Woods-Saxon potential is considered, i.e. γ(pot:WS). Actually, it is not restricted to the\nWoods-Saxon potential, but is more general as one can\nsee in the following. The deformed Woods-Saxon potential considered in this work is parametrized by the deformation parameters, (β2 , γ, β4 ), and defined [48, 49, 50]\nby\nV (r) =\n\nV0\n,\n1 + exp(distΣ (r)/a)\n\n(18)\n\nFIG. 5: The triaxiality parameters γ(den) (dashed line) and\nγ(geo) (solid line) are shown as functions of the γ parameter\nin the Woods-Saxon potential, γ(pot:WS) (the thin diagonal\nline is just for a guide to the eyes). The calculations have been\nperformed for the TSD band in 163 Lu, and the parameters\nused are β2 = 0.42, β4 = 0.034, and ∆n,p = 0.3 MeV; these\ndeformation parameters gives almost the same shape as that\nused in the Nilsson potential in Fig. 2 at γ(geo) ≈ 10◦ .\n\nwhere distΣ (r) is the distance between a given point r\nand the nuclear surface Σ, with a minus sign if r is inside\nΣ, which is defined by the usual radius to solid-angle\nrelation, r = R(Ω);\nR(Ω) = Rv (β2 , γ, β4 )×\n\u0010\nX\n1+\na2K Y2K (Ω) +\nK=0,±2\n\nX\n\nK=0,±2,±4\n\n\u0011\na4K Y4K (Ω) ,\n\n(19)\nwhere Rv (β2 , γ, β4 ) is determined by the volume conserving condition, and the coefficients a's are given by\n\na = β2 cos γ,\n\n 20\n1\n\n\na\n22 = a2−2 = − √2 β2 sin γ,\n\n\n\n2\na40 = 16 β4 (5 cosq\nγ + 1),\n(20)\n\n\na42 = a4−2 = − 56 β4 cos γ sin γ,\n\n\nq\n\n\na =a\n= 35 β sin2 γ.\n44\n\n4−4\n\n72\n\n4\n\nApparently the surface Σ is given as an equi-potential\nsurface at the half depth, V (r) = 12 V0 , and it is directly\nrelated to (β2 , γ, β4 ) with γ = γ(pot:WS).\nAs in the case of the Nilsson potential, the triaxiality parameter γ(den) and γ(geo) are shown as functions\nof γ(pot:WS) in Fig. 5, which are suitable to the TSD\nband in 163 Lu, just in the same way as in the case of the\nNilsson potential in Fig. 2. Again, γ(den) and γ(geo) are\nvery similar, but they are quite different from γ(pot:WS):\nγ(den) ≈ γ(geo) ≈ 13◦ when γ(pot:WS) = 20◦ . In Fig. 6,\nthe relation between γ(geo) and γ(pot:WS) at three different cases of (β2 , β4 ) deformations, corresponding to\nFig. 3, are also depicted. Although the differences between γ(geo) and γ(pot:WS) are not so dramatic as those\n\nFIG. 6: The triaxiality parameters γ(geo) with fixed β2\nand β4 deformation parameters are shown as functions of\nγ(pot:WS) (the thin diagonal line is just for a guide to the\neyes). The dotted line is for the case with β2 = 0.217 and\nβ4 = 0.017, the dashed with β2 = 0.445 and β4 = 0.075,\nand the solid with β2 = 0.685 and β4 = 0.190, respectively.\nThese sets of parameters almost correspond to the cases of\nǫ2 = 0.2, ǫ2 = 0.4, and ǫ2 = 0.6 with ǫ4 = 0 used for the\nNilsson potential in Fig. 3 at γ(geo) = 0.\n\nbetween γ(geo) and γ(pot:Nils), they are still considerably large. In the case of the parametrization of the\nnuclear surface in Eq. (19), hQ̂2K iuni can be easily calculated;\nZ\n1\nhQ̂2K iuni =\nR(Ω)5 Y2K (Ω)dΩ.\n(21)\n5\nThen, it is straightforward to see, in the small deforma-\n\n\f7\ntion limit, β2 ,|γ| ≪ 1, with β4 = 0, that\nr\n\u0010\n180 \u0011\nγ(geo) ≈ 1 −\n(22)\nβ2 γ(pot:WS).\n49π\nq\n16π\nTaking into account the relation, β2 ≈\n45 ǫ2 in the\nsmall deformation limit, the proportionality\nin\nq\nq constant\nfront of ǫ2 corresponds, in this case, to\n8\n7\n\n3\n2\n\n180\n49π\n\n×\n\n16π\n45\n\n=\n\n≈ 1.14, which is smaller than\n= 1.5 in Eq. (12)\nfor the Nilsson potential, but is still appreciably large.\nThis explains qualitatively the increase of the difference\nbetween γ(geo) and γ(pot:WS) for larger deformations\nas is shown in Fig. 6.\n\nIII.\n\nB(E2) RATIO OF THE WOBBLING BAND\n\nAs it is discussed in the previous section, the two intrinsic quadrupole moments should be determined in order to deduce the triaxial deformation. In the case of\nthe wobbling excitations, it is enough to measure the two\nB(E2)'s, B(E2)in and B(E2)out ; the ∆I = −2 intraband\nE2 transitions within the wobbling band and ∆I = ±1\ninterband E2 transitions from the one-phonon wobbling\nband to the yrast TSD band, respectively. According\nto the rotor model [7], the magnitude of the moment Q\nin Eq.(2) is factored out in the two B(E2)'s and their\nratio, B(E2)out /B(E2)in , is directly related to the triaxiality parameter γ(den). This B(E2) ratio is straightforward to measure from the experimental point of view; it\nis given directly by the γ-ray branching ratio if the information of the mixing ratio is provided. In contrast,\nthe life time measurement is necessary to obtain B(E2)\nvalues themselves, which is not an easy task generally.\nAlthough the life time measurements have been done in\nsome TSD bands [20, 21] recently, so that we can study\nboth B(E2)out and B(E2)in separately, we concentrate\nupon the B(E2) ratio in the present work.\nIn Fig. 7, the experimental B(E2) ratio of the onephonon wobbling band in 163 Lu [21] is compared with the\nresults of the particle-rotor model calculation in Ref. [23].\nImportant parameters of the model are three moments of\ninertia, Jx , Jy , Jz , and the triaxiality γ = γ(den); an\noverall factor of the formers is irrelevant to the B(E2) ratio and they are fixed to be Jx : Jy : Jz = 145 : 135 : 50\ntaken from [23], while we take five values γ(den) = 10◦ ,\n15◦ , 20◦ , 25◦ , and 30◦ in order to show the dependence of\nthe B(E2) ratio on the γ values. Other parameters, the\nchemical potential of the odd i13/2 proton, λ/κ = −1.532,\nand the pairing gap, ∆/κ = 0.3, with κ = 3 MeV are\nalso taken from [23]. The calculated ratios are monotonically decreasing functions of spin if all the model parameters are held fixed. This decrease is characteristic in\nthe rotor model, see Eq. (23) below. Although the spindependence is somewhat different, the average value of\nthe B(E2) ratio can be reproduced if we take the value\nγ ≈ 20◦ . Therefore the triaxial deformation of 163 Lu is\n\nFIG. 7: The B(E2) ratio, B(E2: I → I − 1)out /B(E2: I →\nI − 2)in , of the wobbling band in 163 Lu. The experimental\ndata [21] is compared with the calculations by the particlerotor model [23]. Five dotted curves are the results with the\ntriaxiality parameter γ(den) = 10◦ , 15◦ , 20◦ , 25◦ , and 30◦\nfrom the lowest to the highest ones, respectively.\n\ndeduced to be γ ≈ 20◦ , which is one of the main conclusions of Ref. [23]. This conclusion remains valid even\nif the parameters of the moments of inertia are changed\nin a reasonable range. While the existence of the odd\nproton brings about important corrections to the energy\nspectra, its effect on the B(E2) is very small [23, 51].\nThus, the wobbling phonon treatment of the simple rotor model in Ref. [7] gives a good approximation to the\nB(E2) ratio at high-spin states, leading to the following\nexpression;\nB(E2: I → I ± 1)out\nB(E2: I → I − 2)in\n\u0012\n\u00132\n2 wz sin(γ + 60◦ ) ∓ wy sin γ\n,\n≈\n√\nI\nwy wz cos(γ + 30◦ )\n\nγ = γ(den),\n\n(23)\nwhere the quantities wy , wz are related to the three moments of inertia through\n\u001a\nwy ≡ (Jx /Jz − 1)1/2 ,\n(24)\nwz ≡ (Jx /Jy − 1)1/2 .\nNote that the I → I + 1 transitions are quenched for\nthe positive γ shape, and in fact only the I → I − 1\ntransitions are observed in experiment in the Lu nuclei.\nIt is easy to check that the results of calculations in Fig. 7\ncan be understood nicely by this simple expression; the\ndecrease of the B(E2) ratio as a function of spin is due\nto the 1/I dependence in Eq.(23), and the ratio increases\nquickly as a function of the triaxiality γ = γ(den).\nIt may be interesting to note that the measured B(E2)\nratio is almost constant as a function of spin or even\nincreases at highest spins, which is quite different from\nthat of the rotor model calculation. It indicates that\nthe parameters of the model are changing as the spin I\nincreases. Since the ratio is sensitive to the triaxiality pa-\n\n\f8\nrameter γ = γ(den), it is natural to consider that γ(den)\nis spin dependent and increases with spins [23] among\nothers. A preliminary investigation for such a possibility\nhas been reported in Ref. [41], where is employed a microscopic framework, the cranked Woods-Saxon mean-field\nand the random phase approximation (RPA).\nNext let us turn to the discussion on our microscopic\ncalculations in Refs. [25, 26, 27], which are based on\nthe cranked Nilsson mean-field and the random phase\napproximation (RPA). In these calculations the triaxiality parameter γ = 20◦ was employed but the resultant\nB(E2) ratios were too small by a factor two to three. We\nwere wondering about possible reasons; does the results\nof RPA calculation deviate from those of the rotor model\nso much? However, it has been shown in Ref. [52] that\nthe RPA calculation reproduces the result of the rotor\nmodel rather well in the case of the precession bands,\nwhich are nothing but the rotational bands built upon\nthe high-K isomers and can be interpreted as a similar motion to the wobbling excitation, where the angular momentum vector fluctuates about the main rotation\naxis [53]. Now the reason of the small calculated B(E2)\nratio is clear from the argument of the previous section:\nThe triaxiality γ used in our calculations is that of the\nNilsson potential, γ(pot:Nils), in §II B, while the γ used\nin the rotor model is γ(den) in §II A. As is discussed in\nthe previous section, the difference between them for the\nsame shape is very large for large deformations like in the\ncase of the TSD bands; γ(pot:Nils) ≈ 20◦ corresponds to\nγ(den) ≈ 11◦ , and in order to perform the same calculation as the rotor model with γ(den) ≈ 20◦ one has to\nemploy γ(pot:Nils) ≈ 30◦ according to Fig. 2. It should\nalso be mentioned that we have used five major oscillator\nshells, Nosc = 3 − 5 for proton and Nosc = 4 − 8 for neutron in the calculation in Refs. [25, 26, 27], which were\nnot enough; since the i13/2 proton orbits are occupied in\nthe TSD band, the inclusion of Nosc = 8 proton quasiparticle states are necessary in the RPA calculational step.\nIn Fig. 8 we depict the new results of calculation employing γ(pot:Nils) = 20◦ and 30◦ with using the full\nmodel space; all orbits in the oscillator shell Nosc = 0 − 9\nfor both protons and neutrons are included. The procedure and the other parameters in the calculation are the\nsame as in the previous work [25]; ǫ2 = 0.43, ǫ4 = 0,\nand the pairing gaps ∆n,p = 0.3 MeV. The result of\nthe previous calculation, the dashed line, and that of\nthe particle-rotor model with γ(den) = 20◦ , the dotted line, are also included. Our previous calculation is\nsmaller than the experimental data partly because of\nthe small model space, but its effect is about 20%; the\nlarge difference is mainly due to the fact that we have\nused γ = γ(pot:Nils) = 20◦ in the previous calculation, which corresponds to much smaller triaxiality than\nγ(den) = 20◦ in the particle-rotor model. The result\nwith γ(pot:Nils) = 30◦ almost coincides with that of the\nparticle-rotor calculation using γ(den) = 20◦ , because\nthe values Jx : Jy : Jz of the microscopically calculated\nmoments of inertia accidentally take similar values in the\n\nFIG. 8: The B(E2) ratio, B(E2: I → I − 1)out /B(E2: I →\nI − 2)in , of the one-phonon wobbling band in 163 Lu. The\nexperimental data [21] is compared with the calculations by\nour microscopic RPA approach. The lower solid line is the\nresult with γ = γ(pot:Nils) = 20◦ , while the upper solid line\nis with γ(pot:Nils) = 30◦ ; the full model space is used for both\nof them. The dashed line is the result with γ(pot:Nils) = 20◦\nand using only the five major oscillator shells, corresponding\nto the previous calculation in Ref. [25]. The dotted line is\nthe same as that in Fig. 7, the particle-rotor calculation with\nγ = γ(den) = 20◦ , depicted for a reference.\n\nFIG. 9: The γ dependence of the microscopically calculated\nB(E2) ratio and the excitation energy of the one-phonon wobbling band in 163 Lu at spin I = 51/2. The solid lines are the\nB(E2) ratios and the dotted lines are the energy in MeV. The\nhorizontal solid and dotted lines designate the experimental\nvalues.\n\nrelevant spin range [25]. In order to see the γ dependence\nof the results, we show, in Fig. 9, the B(E2) ratio and\nthe excitation energy of the one-phonon wobbling band\nin 163 Lu at spin I = 51/2 as functions of the triaxiality γ = γ(pot:Nils). Although the excitation energy is\nrather flat in the range, 20◦ ≤ γ(pot:Nils) ≤ 30◦ , the\nB(E2) follows the behaviors of Eq. (23) if the relation\nbetween γ(pot:Nils) and γ(den) is taken into account.\nThe excitation energy can be expressed in terms of the\nthree moments of inertia in an usual way [7, 30], but\ntheir γ dependences are not simple like the irrotational\n\n\f9\none [37] and lead to a rather weak γ dependence of the\nexcitation energy in this case. Here we have only shown\nthe example of the wobbling excitation in 163 Lu, but we\nhave confirmed that these properties of the wobbling-like\nRPA solution are general, and can be applied for other\ncases in the Lu region.\nThus, our microscopic RPA calculations give more or\nless the same results as that of the macroscopic particlerotor model, if the corresponding magnitude of the triaxial deformation is employed. It shows that the RPA\ncalculation of the wobbling excitation in the Lu region\nleads to the behaviors of B(E2)'s that are given by the\nmacroscopic rotor model; namely the out-of-band B(E2)\ncan be related to the static triaxial deformation. This is\nnon trivial since the out-of-band B(E2) is calculated by\nthe RPA transition amplitudes of the non-diagonal part\n(−)\n(−)\nof the quadrupole operators, Q21 and Q22 [28, 30]. It\nhas been shown [37] that the RPA wobbling theory of\nMarshalek [30] gives the same expression of the out-ofband B(E2) as that of the rotor model, if the RPA wobbling mode is collective enough that the quantity \"cn \"\ndefined in Eq. (4.29) in Ref. [37] satisfies cn=wob = 1. In\nthe previous calculations [25, 26, 27, 37], the employed\nmodel space was too small [54] to give cn=wob = 1, but\nwe have confirmed that cn=wob ≈ 1 is satisfied within 1%\nin the present full model space calculations. Recently,\nthis criterion, cn=wob ≈ 1, has been used to identify the\nwobbling-like solution out of many RPA eigenmodes, and\nshown to be very useful [38].\nIV.\n\nSUMMARY\n\nγ(pot:Nils) in Eqs. (6)-(7) and γ(pot:WS) in Eqs. (18)(19), are compared with the density type γ(den) and\nγ(geo). Conspicuous differences between the potential\ntype and the density type γ's, e.g. γ(pot:Nils) vs. γ(geo),\nhave been found especially for larger deformations, e.g.\nthe triaxial superdeformed states. It is also investigated\nhow the differences between various definitions come out\nby evaluating their relations explicitly in the small deformation limit. Therefore we have to be very careful about\nwhich definition is used in quantitative discussions of the\ntriaxial deformation.\nNext, we have investigated the out-of-band to in-band\nB(E2) ratio of the one-phonon wobbling band, which is\nmeasured systematically in the Lu region and is sensitive\nto the triaxial deformation. The macroscopic particlerotor model [23] is used to deduce the triaxial deformation from the experimental B(E2) ratio, which leads\nto γ = γ(den) ≈ 20◦ on average. On the other hand,\nwe performed the microscopic RPA calculation [25, 26]\nwith using γ = γ(pot:Nils) ≈ 20◦ corresponding to the\nTSD minima in the cranked Nilsson-Strutinsky calculation [17, 19], but we obtained too small B(E2) ratio compared with the experimental data. It has been found that\nthe reason of the underestimation of our previous microscopic calculation is mainly due to the different triaxial\ndeformation used: We have used γ(pot:Nils) ≈ 20◦ corresponding roughly to γ(den) ≈ 11◦ , which is much smaller\nthan γ(den) ≈ 20◦ in the rotor model calculations. If the\nproper triaxiality corresponding to γ(den) ≈ 20◦ is used,\nour RPA calculation can nicely reproduce the magnitude\nof the measured B(E2) ratio in the same way as in the\nmacroscopic particle-rotor model.\n\nIn this work, we have first discussed the differences of\nthe various definitions of the triaxiality parameter γ. The\nmost basic among them is defined through the two intrinsic quadrupole moments, γ(den) in Eq. (3) for each configuration of a particular nucleus, or γ(geo) in Eq. (4) for\na given nuclear shape. It has been found that these two\ncoincide in a good approximation (the nuclear shape consistency). In the Hartree-Fock(-Bogoliubov) type calculations, where the nuclear mean-field is determined selfconsistently by a suitably chosen effective interaction, the\nparameter γ(den) is the only possible definition of triaxial deformation. However, there is an another type of\nmean-field calculations, i.e. the Strutinsky macroscopicmicroscopic method, where one starts from a suitably\nchosen average potential, in which the nuclear deformation is parametrized in various different ways. We\nhave considered the two widely adopted ones, the Nilsson\ntype and the Woods-Saxon type parametrizations. The\ntriaxiality parameters associated with these potentials,\n\nIt should, however, be emphasized that an important\nproblem remains: The predicted triaxial deformations,\nγ(den) ≈ 11◦ , by the cranked Nilsson-Strutinsky calculations [17, 19] for the TSD bands in the Hf, Lu region are\ntoo small to account for the measured B(E2) ratio of the\nwobbling excitations. We believe that this is a challenge\nto the existing microscopic theory. An another thing we\nwould like to mention is that the measured B(E2), both\nthe out-of-band and in-band B(E2)'s, seems to indicate\nthat the triaxial deformation is changing as a function of\nspin; it increases at higher spins [23]. We have recently\ndeveloped a new RPA approach [41] based on the WoodsSaxon potential as a mean-field, which is believed to be\nmore reliable than our previous calculations employing\nthe Nilsson potential. The result of calculations and discussions including the issue of the change of the triaxial\ndeformation suggested by the out-of-band as well as inband B(E2)'s will be reported in a subsequent paper; see\nRef. [41] for a preliminary report.\n\n[1] A. S. Davydov and B. F. Filippov, Nucl. Phys. A 8, 237\n(1958).\n\n[2] J. Meyer-ter-Vehn, Nucl. Phys. A 249, 111, 141 (1975).\n[3] D. Cline, Ann. Rev. Nucl. Part. Sci. 36, 683 (1986).\n\n\f10\n[4] W. Andrejtscheff and P. Petkov, Phys. Lett. B 329, 1\n(1994).\n[5] I. Hamamoto, in Proc. of the Workshop on Microscopic\nModels in Nuclear Structure Physics, Oak Ridge, USA,\nOct. 3 - 6, 1988, edited by M. W. Guidry et al. (World\nScientific, 1989), p. 173.\n[6] I. Hamamoto, Nucl. Phys. A 520, 297c (1990).\n[7] A. Bohr and B. R. Mottelson, Nuclear Structure Vol. II\n(Benjamin, New York, 1975).\n[8] S. W. Ødegård et al., Phys. Rev. Lett. 86, 5866 (2001).\n[9] D. R. Jensen et al., Nucl. Phys. A 703, 3 (2002).\n[10] D. R. Jensen et al., Eur. Phys. J. A 19, 173 (2004).\n[11] D. R. Jensen et al., Phys. Rev. Lett. 89, 142503 (2002).\n[12] G. Schönwasser et al., Phys. Lett. B 552, 9 (2003).\n[13] H. Amro et al., Phys. Lett. B 553, 197 (2003).\n[14] P. Bringel et al., Eur. Phys. J. A 24, 167 (2005).\n[15] I. Ragnarsson, Phys. Rev. Lett. 62, 2084 (1989).\n[16] S. Åberg, Nucl. Phys. A 520, 35c (1990).\n[17] R. Bengtsson, http://www.matfys.lth.se/ ̃ragnar/TSD.html.\n[18] S. G. Nilsson and I. Ragnarsson, Shapes and Shells in\nNuclear Structure (Cambridge University Press, 1995).\n[19] H. Schnack-Petersen et al., Nucl. Phys. A 594, 175\n(1995).\n[20] G. Schönwasser et al., Eur. Phys. J. A 15, 435 (2002).\n[21] A. Görgen et al., Phys. Rev. C 69, 031301(R) (2004).\n[22] I. Hamamoto, Phys. Rev. C 65, 044305 (2002).\n[23] I. Hamamoto and G. B. Hagemann, Phys. Rev. C 67,\n014319 (2003).\n[24] R. F. Casten, E. A. McCutchan, N. V. Zamfir, C. W.\nBeausang, and J. ye Zhang, Phys. Rev. C 67, 064306\n(2003).\n[25] M. Matsuzaki, Y. R. Shimizu, and K. Matsuyanagi, Phys.\nRev. C 65, 041303(R) (2002).\n[26] M. Matsuzaki, Y. R. Shimizu, and K. Matsuyanagi, Eur.\nPhys. J. A 20, 180 (2004).\n[27] M. Matsuzaki, Y. R. Shimizu, and K. Matsuyanagi, Phys.\nRev. C 69, 034325 (2004).\n[28] E. R. Marshalek, Nucl. Phys. A 275, 416 (1977).\n[29] D. Janssen and I. N. Mikhailov, Nucl. Phys. A 318, 390\n(1979).\n[30] E. R. Marshalek, Nucl. Phys. A 331, 429 (1979).\n[31] J. L. Egido, H. J. Mang, and P. Ring, Nucl. Phys. A 339,\n390 (1980).\n[32] Y. R. Shimizu and K. Matsuyanagi, Prog. Theor. Phys.\n70, 144 (1983).\n[33] Y. R. Shimizu and K. Matsuyanagi, Prog. Theor. Phys.\n72, 799 (1984).\n[34] J. Kvasil and R. G. Nazmitdinov, Phys. Rev. C 69,\n\n031304(R) (2004).\n[35] J. Kvasil and R. G. Nazmitdinov, Phys. Rev. C 73,\n014312 (2006).\n[36] M. Matsuzaki, Nucl. Phys. A 509, 269 (1990).\n[37] Y. R. Shimizu and M. Matsuzaki, Nucl. Phys. A 588,\n559 (1995).\n[38] J. Kvasil and R. G. Nazmitdinov, Phys. Lett. B 650, 331\n(2007).\n[39] D. Almehed, R. G. Nazmitdinov, and F. Dönau, Phys.\nScript. T125, 139 (2006).\n[40] Y. R. Shimizu, M. Matsuzaki, and K. Matsuyanagi, Phys.\nScript. T125, 134 (2006).\n[41] T. Shoji and Y. R. Shimizu, Int. J. Mod. Phys. E 15,\n1407 (2006).\n[42] Y. R. Shimizu and K. Matsuyanagi, Prog. Theor. Phys.\n71, 960 (1984).\n[43] B. Nerlo-Pomorska and K. Pomorski, Nukleonika 22, 289\n(1977).\n[44] J. Dudek, W. Nazarewicz, and P. Olanders, Nucl. Phys.\nA 420, 285 (1984).\n[45] R. Bengtsson, J. Dudek, W. Nazarewicz, and P. Olanders, Phys. Script. 39, 196 (1989).\n[46] S. G. Nilsson, C. F. Tsang, A. Sobiczewski, Z. Szymanski,\nS. Wycech, C. Gustafsson, I. L. Lamm, P. Möller, and\nB. Nilsson, Nucl. Phys. A 131, 1 (1969).\n[47] T. Bengtsson and I. Ragnarsson, Nucl. Phys. A 436, 14\n(1985).\n[48] J. Dudek, A. Majhofer, J. Skalski, T. Werner, S. Cwiok,\nand W. Nazarewicz, J. Phys. G 5, 1359 (1979).\n[49] S. G. Rohozinski and A. Sobiczewski, Act. Phys. Pol. B\n12, 1001 (1981).\n[50] W. Nazarewicz and A. Sobiczewski, Nucl. Phys. A 369,\n396 (1981).\n[51] K. Tanabe and K. Sugawara-Tanabe, Phys. Rev. C 73,\n034305 (2006).\n[52] Y. R. Shimizu, M. Matsuzaki, and K. Matsuyanagi, Phys.\nRev. C 72, 014306 (2005).\n[53] G. Andersson, S. E. Larsson, G. Leander, P. Möller, S. G.\nNilsson, I. Ragnarsson, S. Åberg, J. Dudek, B. NerloPomorska, K. Pomorski, et al., Nucl. Phys. A 268, 205\n(1976).\n[54] In Ref. [26], it was reported that cn=wob = 0.6 − 0.8, but\nthese values were not correct; they were in the cases with\neven smaller model spaces. The calculation with the five\nmajor shells gives cn=wob ≈ 0.9, which leads to about\na 20% reduction as it is shown in Fig. 8 of the present\npaper.\n\n\f"}