{"id": "http://arxiv.org/abs/0911.2994v3", "guidislink": true, "updated": "2010-04-01T10:46:12Z", "updated_parsed": [2010, 4, 1, 10, 46, 12, 3, 91, 0], "published": "2009-11-16T10:22:18Z", "published_parsed": [2009, 11, 16, 10, 22, 18, 0, 320, 0], "title": "Ab-initio calculation of all-optical time-resolved calorimetry of\n  nanosized systems: Evidence of nanosecond-decoupling of electron and phonon\n  temperatures", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0911.2445%2C0911.0878%2C0911.0361%2C0911.3630%2C0911.1923%2C0911.4885%2C0911.2182%2C0911.4369%2C0911.5360%2C0911.3442%2C0911.2217%2C0911.4869%2C0911.5102%2C0911.3868%2C0911.5233%2C0911.5561%2C0911.3982%2C0911.2018%2C0911.2864%2C0911.4826%2C0911.2114%2C0911.1292%2C0911.5510%2C0911.0241%2C0911.4686%2C0911.5071%2C0911.4841%2C0911.4800%2C0911.0897%2C0911.4957%2C0911.3691%2C0911.0674%2C0911.2772%2C0911.2890%2C0911.3395%2C0911.0042%2C0911.4535%2C0911.4310%2C0911.4773%2C0911.0522%2C0911.2391%2C0911.1793%2C0911.2622%2C0911.2850%2C0911.2274%2C0911.3728%2C0911.3381%2C0911.4394%2C0911.3526%2C0911.2994%2C0911.3491%2C0911.3124%2C0911.0557%2C0911.5688%2C0911.1168%2C0911.5006%2C0911.2859%2C0911.5139%2C0911.0133%2C0911.3063%2C0911.3650%2C0911.1266%2C0911.2816%2C0911.3248%2C0911.1661%2C0911.0387%2C0911.4665%2C0911.1063%2C0911.1632%2C0911.5328%2C0911.3400%2C0911.3634%2C0911.0365%2C0911.4146%2C0911.1784%2C0911.0699%2C0911.4249%2C0911.4867%2C0911.3029%2C0911.4430%2C0911.1228%2C0911.2103%2C0911.5020%2C0911.5090%2C0911.5134%2C0911.2585%2C0911.2795%2C0911.0393%2C0911.2818%2C0911.5407%2C0911.4823%2C0911.0597%2C0911.3384%2C0911.5666%2C0911.1708%2C0911.2951%2C0911.5507%2C0911.2683%2C0911.2670%2C0911.5186%2C0911.4038&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Ab-initio calculation of all-optical time-resolved calorimetry of\n  nanosized systems: Evidence of nanosecond-decoupling of electron and phonon\n  temperatures"}, "summary": "The thermal dynamics induced by ultrashort laser pulses in nanoscale systems,\ni.e. all-optical time-resolved nanocalorimetry is theoretically investigated\nfrom 300 to 1.5 K. We report ab-initio calculations describing the temperature\ndependence of the electron-phonon interactions for Cu nanodisks supported on\nSi. The electrons and phonons temperatures are found to decouple on the ns time\nscale at 10 K, which is two orders of magnitude in excess with respect to that\nfound for standard low-temperature transport experiments. By accounting for the\nphysics behind our results we suggest an alternative route for overhauling the\npresent knowledge of the electron-phonon decoupling mechanism in nanoscale\nsystems by replacing the mK temperature requirements of conventional\nexperiments with experiments in the time-domain.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0911.2445%2C0911.0878%2C0911.0361%2C0911.3630%2C0911.1923%2C0911.4885%2C0911.2182%2C0911.4369%2C0911.5360%2C0911.3442%2C0911.2217%2C0911.4869%2C0911.5102%2C0911.3868%2C0911.5233%2C0911.5561%2C0911.3982%2C0911.2018%2C0911.2864%2C0911.4826%2C0911.2114%2C0911.1292%2C0911.5510%2C0911.0241%2C0911.4686%2C0911.5071%2C0911.4841%2C0911.4800%2C0911.0897%2C0911.4957%2C0911.3691%2C0911.0674%2C0911.2772%2C0911.2890%2C0911.3395%2C0911.0042%2C0911.4535%2C0911.4310%2C0911.4773%2C0911.0522%2C0911.2391%2C0911.1793%2C0911.2622%2C0911.2850%2C0911.2274%2C0911.3728%2C0911.3381%2C0911.4394%2C0911.3526%2C0911.2994%2C0911.3491%2C0911.3124%2C0911.0557%2C0911.5688%2C0911.1168%2C0911.5006%2C0911.2859%2C0911.5139%2C0911.0133%2C0911.3063%2C0911.3650%2C0911.1266%2C0911.2816%2C0911.3248%2C0911.1661%2C0911.0387%2C0911.4665%2C0911.1063%2C0911.1632%2C0911.5328%2C0911.3400%2C0911.3634%2C0911.0365%2C0911.4146%2C0911.1784%2C0911.0699%2C0911.4249%2C0911.4867%2C0911.3029%2C0911.4430%2C0911.1228%2C0911.2103%2C0911.5020%2C0911.5090%2C0911.5134%2C0911.2585%2C0911.2795%2C0911.0393%2C0911.2818%2C0911.5407%2C0911.4823%2C0911.0597%2C0911.3384%2C0911.5666%2C0911.1708%2C0911.2951%2C0911.5507%2C0911.2683%2C0911.2670%2C0911.5186%2C0911.4038&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "The thermal dynamics induced by ultrashort laser pulses in nanoscale systems,\ni.e. all-optical time-resolved nanocalorimetry is theoretically investigated\nfrom 300 to 1.5 K. We report ab-initio calculations describing the temperature\ndependence of the electron-phonon interactions for Cu nanodisks supported on\nSi. The electrons and phonons temperatures are found to decouple on the ns time\nscale at 10 K, which is two orders of magnitude in excess with respect to that\nfound for standard low-temperature transport experiments. By accounting for the\nphysics behind our results we suggest an alternative route for overhauling the\npresent knowledge of the electron-phonon decoupling mechanism in nanoscale\nsystems by replacing the mK temperature requirements of conventional\nexperiments with experiments in the time-domain."}, "authors": ["F. Banfi", "F. Pressacco", "B. Revaz", "C. Giannetti", "D. Nardi", "G. Ferrini", "F. Parmigiani"], "author_detail": {"name": "F. Parmigiani"}, "author": "F. Parmigiani", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1103/PhysRevB.81.155426", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/0911.2994v3", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0911.2994v3", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "5 pages, 3 figures. Accepted on Physical Review B.", "arxiv_primary_category": {"term": "cond-mat.mes-hall", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cond-mat.mes-hall", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "cond-mat.mtrl-sci", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "quant-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0911.2994v3", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0911.2994v3", "journal_reference": "Phys. Rev. B 81, 155426 (2010)", "doi": "10.1103/PhysRevB.81.155426", "fulltext": "Ab-initio calculation of all-optical time-resolved calorimetry\nof nanosized systems: Evidence of nanosecond-decoupling of electron\nand phonon temperatures\nF. Banfi,1, ∗ F. Pressacco,2 B. Revaz,3 C. Giannetti,1 D. Nardi,1, 4 G. Ferrini,1 and F. Parmigiani2\n1\n\narXiv:0911.2994v3 [cond-mat.mes-hall] 1 Apr 2010\n\n2\n\nDipartimento di Matematica e Fisica, Università Cattolica, I-25121 Brescia, Italy\nDipartimento di Fisica, Università degli Studi di Trieste and Sincrotrone Trieste, Basovizza, I-34012 Trieste, Italy\n3\nÉcole Polytechnique Fédérale de Lausanne, Laboratoire de Microsystèmes 3, CH-1015 Lausanne, Switzerland\n4\nDipartimento di Fisica, Università degli Studi di Milano, I-20122 Milano, Italy\n(Dated: November 21, 2018)\nThe thermal dynamics induced by ultrashort laser pulses in nanoscale systems, i.e. all-optical\ntime-resolved nanocalorimetry is theoretically investigated from 300 to 1.5 K. We report ab-initio\ncalculations describing the temperature dependence of the electron-phonon interactions for Cu nanodisks supported on Si. The electrons and phonons temperatures are found to decouple on the\nns time scale at ∼ 10 K, which is two orders of magnitude in excess with respect to that found\nfor standard low-temperature transport experiments. By accounting for the physics behind our\nresults we suggest an alternative route for overhauling the present knowledge of the electron-phonon\ndecoupling mechanism in nanoscale systems by replacing the mK temperature requirements of conventional experiments with experiments in the time-domain.\nPACS numbers: 65.80.+n, 78.47.jc, 44.10.+i, 82.60.Qr\n\nIn the last decade the advent of nanoprocessing techniques has emphasized the need for designing noninvasive methodologies to access the realm of the thermal properties of nanoscale systems.1–4 However, conventional calorimetry is limited to samples of few tens of micrograms. A successful improvement recently arose from\nthe micro-membrane-based nanocalorimeters.2,5 These\ndevices perform well, in terms of sensitivity, but they are\nlimited to cryogenic temperatures and to time-integrated\napplications and need on-chip integration.\nWhen confronted with the problem of measuring the\nspecific heat of nanoscale objects, a fast non-contact\nprobe is an optimal choice, the speed requirement being dictated by the fact that the time for heat exchange\nbetween the sample and the thermal reservoir is proportional to the sample mass6 and the non-contact probe\navoids the addendum heat capacitance contribution, i.e.\nthe heat capacity of the probe itself.\nIn these last years experiments have been reported,\nalong with the all-optical schemes,6–11 that unlocked the\ngate for all-optical time-resolved nanocalorimetry. However, the physical mechanism involved in an all-optical\ntime-resolved nanocalorimetry are, over a wide temperature range, still unexplored. All-optical time-resolved\nnanocalorimetry consists of a system where a nanosample, a metallic nanodisk in the present work, is placed in\nthermal contact on a substrate serving as a thermal bath.\nAn ultrafast laser pump beam delivers an energy density\nδUV to the nanodisk. The sample's temperature time relaxation to the substrate is measured via a time-delayed\nprobe beam. Several detection schemes can be exploited\nor envisioned. Time Resolved Thermoreflectance (TRTR) measures the temperature dependent changes in the\noptical reflectivity,1,12 Time-Resolved Spatial Modulation Spectroscopy (TR-SMS)11 and time-resolved NearInfrared Diffraction (TR-NIRD)6,8 detect the transmis-\n\nsion and reflectivity changes modulated by the nanoobject thermal expansion, whereas Time-Resolved X-ray\ndiffraction (TR-XRD) reveals the transient lattice thermal expansion.13,14\nIn the present work the thermal dynamics occurring in\ntime-resolved all-optical calorimetry is theoretically investigated from ambient to pumped liquid Helium temperatures. The theoretical frame accounts for temperature dependent material properties. In particular the\nmicroscopic electron-phonon interaction term Γ is calculated within the frame of Allen theory,15 starting from\nab-initio Density Functional Theoretical calculations of\nthe Eliashberg function. The nanodisk electrons Tel and\nphonons Tph temperatures are found to decouple on the\nns time scale at ∼ 10 K, that is two orders of magnitude in excess with respect to standard low-temperature\ntransport experiments. The temperature decoupling extent, and the time scale over which it occurs, are ruled by\nthe Γ(Tel , Tph ) landscape. These findings set the limits\nof applicability of ultrafast nanocalorimetry well above\n1.5 K while suggesting a new route to investigate the\nphysics of electron-phonon interaction where the sub-K\ntemperature requirement can be substituted by the ns\ntime resolution.\nThe physics is here investigated considering a lattice\nof Cu nanodisks deposited on a Si substrate which unit\ncell dimensions are reported in inset of Fig. 1. The bottom of the Si substrate is kept at constant temperature\nTcryo by a cryostat, whereas insulating boundary conditions apply to the Si cell lateral boundaries. Assuming\nsample's excitation by a single Ti:sapphire pump pulse\n(120 fs pulse duration, 1 nJ per pulse, 800 nm central\nwavelength, 40 μm spatial extension at FWHM, and 1\nMHz repetition rate), the thermal evolution problem can\nbe conveniently envisaged by a three steps mechanism.\nIn the first step, the laser pulse heats the electron gas of\n\n\f2\n\nh\n\n0\n\n15\n\n10\n\n0\n\n2\n\n4\n\n6\n\n8\n\nFrequency (THz)\n\n~\n\nSide\n\n~\n\n13\n\n600 nm\n\n10\n\n11\n\n10\n\n.\n\n1\n\n3\n\n4 5 6\n\n2\n\n3\n\n4 5 6\n\n10\n\n299\n\n2\n\n3\n\n4 5 6\n\n100\n\nTemperature (K)\n\nFIG. 1: Interaction term I(T )/V in log-log scale obtained\nfrom numerical integration of Eq. 3. Insets: Eliashberg function α2 F obtained from ab-initio Density Functional-based\ncalculations (top left). Unit cell geometry (bottom right):\nh= 30 nm, r=150 nm.\n\nthe metallic nanodisks (sub-ps time scale). In the second\nstep, the hot electron gas thermalizes with the phonons\nwithin the disk (ps time scale). The physics entailed in\nthe first two steps is well modeled by the Two Temperatures Model:16\n~ * (kel (Tel )∇T\n~ el )\nCel (Tel )∂t Tel = Pp (t) − Γ(Tel , Tph ) + ∇\n~ * (kph (Tph )∇T\n~ ph ) (1)\nCph (Tph )∂t Tph = Γ(Tel , Tph ) + ∇\nwhere T , k and C indicate the temperature, thermal\ndiffusion coefficient and specific heat per unit volume,\nrespectively, the reference to the electrons (el) or Cu\nphonons (ph) being indicated by the subscript, and Pp\nis the profile of the pulsed power per unit volume absorbed by the sample. The energy density absorbed by\nthe sample is peaked within the nanodisk, because of the\ndifference in the optical penetration depth between Cu\nand Si. This occurrence gives rise, in the third step, to\nthe onset of an heat flux from the nanodisk to the substrate (ns time scale). The thermal link translates in\nthe following boundary conditions at the disk-substrate\ninterface:\n~ ph + (Tph − TSi )/ρth (Tph ) = 0\nn\nbph * kph ∇T\n~ Si − (Tph − TSi )/ρth (Tph ) = 0\n−b\nnSi * kSi ∇T\n\nTel , Tph\n\n.\n\nTSi\n\n~\n\n~\nTcryo\n\n83\n\n9\n2\n\n30 nm\n\nTel\nTph\nTSi\n\n300\n\n298\n\nTop\n\n10\n\n300 nm\n\nTcryo = 297.5 K\n\n(2)\n\nn\nbph and n\nbSi being the outward unit vector normal to\nthe disk and Si boundary, respectively, and ρth the temperature dependent boundary thermal resistivity. The\ntemperature within the Si substrate is calculated via the\nstandard Fourier heat transfer equation. This three-steps\nsequence repeats itself upon arrival of a new laser pulse,\nonce every 1μs. The steady-state temperature distribution, due to the pulses train, is modeled following Ref. 8.\nThis distribution serves as the initial boundary condition\nfor the thermal dynamics following the arrival of a single\npulse and is rather constant within the first few microns\n\n(b)\n\n4\n\nTcryo = 77 K\nTph - T0 (K)\n\n200 μm\n\n-3\n\nI / V (Wm )\n\n0.05\n\nTemperature (K)\n\n2\n\n10\n\n(a)\n\n5 nm\n\n2r\n\nαF\n\n0.10\n17\n\nTemperature (K)\n\n10\n\n200 μm\n\n301\n0.15\n\n19\n\nTel\nTph\nTSi\n\n82\n81\n80\n\n2\n\n1\n6\n4\n2\n\n79\n\n0.1\n\n1\n\n2\n\n3\n\n4\n\n5\n\n6\n\nTime (ns)\n\n78\n0.1\n\n1\n\n2\n\n3\n\n4\n\n5\n\n6\n\nTime (ns)\n\nFIG. 2: (Color online) Simulations results for Tcryo =297.5\nand 77 K. Insets. Panel (a): locations within the sample were\nthe temperatures are calculated. Panel (b): the difference\nbetween Tph and its asymptotic value T0 , in semi-log scale;\ndashed red lines are a guide to the eye, showing double exponential behavior.\n\nregion beneath the Si-nanodisk interface. In the following\nthe temperature in this region will be addressed as TSi ,\nthe temperature calculated at a point 5 nm beneath the\ndisk-Si interface [inset of Fig. 2(a)]. The temperaturedependent specific heats and thermal conductivities entering the equations have been taken from data available\nin the literature.17\nA fundamental issue is the temperature dependence of\nthe electron-phonon coupling which, in the high temperature limit, reads Γ = G(Tel − Tph ). This approximation\nfails when the thermal dynamics spans the entire range\nfrom hundreds of degrees K to liquid Helium temperature. For instance, with Tcryo set at 4.2 K, Tel rises to\n∼ 100 K within the pump pulse time width, relaxing back\nto ∼ 4.2 K on the ns time scale. In order to properly account for the temperature dependence over such a wide\ntemperature range, the electron-phonon coupling is cast\nas Γ = [I(Tel ) − I(Tph )]/V where\nZ ∞\ndωα2 F (ω)(~ω)2 nBE (ω, T ) (3)\nI(T ) = 2πNc NEF\n0\n\nwith Nc the number of cells in the sample, NEF the electronic DOS at the Fermi level, nBE the Bose-Einstein\ndistribution and α2 F the Eliashberg function,15 here calculated ab-initio within the frame of Density-Functional\nTheory.18 Simulations results are reliable down to 0.6\nTHz, the electron-phonon interaction calculation failing\nfor longer phonon wavelengths. For lower frequencies\ne 2 /ω 2 ,15 ωD being the Debye frequency and\nα2 F = λω\nD\ne\ne has been set to have\nλ a fitting parameter. The value λ\n\n\f3\nI(T ) matching the experimental data reported at sub-K\ntemperatures.3 The coefficient G occurring in the expression for the high temperature electron-phonon interaction, obtained from the linear fit of I(T )/V for T > ΘD ,\nwith ΘD the Debye temperature, is 8.43 * 1016 W/(m3 K),\nin good agreement with experimental values reported in\nthe literature.19,20 Results for both I(T )/V and α2 F are\nshown in Fig. 1. Attention is drawn on the nine orders of\nmagnitude change of the interaction term in the temperature range of interest for this work, i.e. from ambient\ntemperature to 1.5 K.\nThe thermal boundary resistivity is modeled by the\nAcoustic Mismatch Model (AMM): ρth (T ) = Abd T −3 for\nT 6 Te = 30 K with Abd = 1.4 * 10−3 K4 m2 W−1 specific\nfor a Cu-Si interface.21 For higher temperatures, ρth is\ntaken at the constant value Abd Te−3 , that is within the\nrange of values reported for ambient temperature. Nevertheless, to dissipate all doubts regarding the dependence\nof our findings on the detailed value of Te, calculations\nhave been performed with values of Te spanning the range\n20-50 K without affecting the physics.\nThe energy density delivered to the nanodisk reads\nδUV =δQV + δWV , where δQV and δWV are the thermal and mechanical energy density respectively. In the\npresent theoretical description only the thermal channel\nhas been considered: δUV ≃ δQV = Cph δTph , hence\nyielding a temperature increase δTph ≃ δUV /Cph . In\norder to justify the above mentioned approximation we\ncalculate the ratio of the mechanical energy correction\nto the thermal energy term. The temperature increase\nδTph triggers a thermal expansion δr/r = αδTph , δr/r\nbeing the disk's strain and α the linear thermal expansion coefficient. Associated with the disk thermal\nexpansion is an increase in mechanical energy density.\nWe estimate the system's mechanical energy density assuming it concentrated in a nanodisk radial breathing\nmode, δWV = (Y /2)(δr/r)2 = (Y /2)(αδTph )2 , Y being\nthe nanodisk Young Modulus. The sought ratio reads\nδWV /δQV = (Y /2)(α2 /Cph )δTph ∼ 10−5 , as obtained\nupon substitution of the ambient temperature values\nY =1.2×1011 Pa,22 α= 1.6×10−5 K−1 ,23 and δTph ≃ 3 K\nas calculated following electron-phonon thermalization\non the ps time scale. A mechanical energy correction five\norder of magnitudes smaller with respect to the thermal\nchannel justifies our initial assumption.\nThe focus of the present paper is on the temperature\nrelaxation dynamics relevant for nanocalorimetry, therefore only the time scale from 100 ps to 10 ns will be\ndiscussed. Simulations results at ambient and liquid Nitrogen temperatures are reported in Fig. 2. In both\ncases the temperature within the nanodisk is well defined (Tph =Tel ) and remains homogeneous throughout\nits volume, thus assuring thermodynamical equilibrium\nbetween electrons and phonons and, consequently, the\ntechnique's applicability to investigate the nanodisk thermal dynamics.\nAt Tcryo =297.5 K the Si substrate acts as a thermal reservoir at constant temperature, while the disk's\n\ntemperature time dependence follows a single exponential decay with time constant τ1 = 1.1 ns [Fig. 2(a)]. The\nmaximum relative change of the nanodisk specific heat,\n∆Cph /Cph =1.14*10−3, allows to ignore its temperature\ndependence. These numerical results suggest modeling\nthe problem as an isothermal disk, with initial temperature 301 K, thermally linked with a reservoir at TSi =\n298 K. A value of the Biot number Bi = h/kph ρth ∼ 10−3\nguarantees the disk remains isothermal throughout the\nthermal relaxation process. Under these circumstances\nthe analytic solution for the disk temperature follows a\nsingle exponential decay24 with time constant τ = 1 ns,\nin agreement with the numerical simulation, and the nanodisk specific heat is readily accessible as τ /hρth .\nAt Tcryo = 77 K, the nanodisk temperature dynamics, obtained from the numerical simulation, follows a\ndouble exponential with decay times τ1 = 0.617 ns and\nτ2 = 6.286 ns, respectively [Fig. 2(b)]. On the contrary\nto the previous case, TSi is not constant, due to the diminishing of CSi with temperature. The physics can be\nrationalized as follows: the isothermal nanodisk \"feels\" a\nsubstrate constant temperature on the sub-ps time scale\nand it thermalizes with it with τ = 0.622 ns, as calculated on the basis of the isothermal disk model exploited\nabove. This interpretation is supported by the agreement between the model-calculated τ and the value τ1\nfrom numerical simulations. On the longer time scale\nthe disk and the Si substrate portion in close proximity\nto the disk-Si interface jointly thermalize with the rest of\nthe Si substrate.\nThe physics changes drastically for Tcryo in the range\nof liquid He temperatures. Simulations results for\nTcryo =1.5 K are reported in Fig. 3. Tel and Tph decouple around 13 K, 1 ns after the pump pulse arrival,\nwith a maximum relative temperature variation of 22%,\nfor a time delay of 2.2 ns. A similar result, with relative\ntemperature variation of 6%, is found for Tcryo = 4.2 K.\nFrom transport measurements in mesoscopic structures\nthe electron-phonon temperature decoupling occurs at\nsub-K temperatures,3,25 whereas for the present system\nour model foresees the decoupling at temperatures about\ntwo orders of magnitude higher. Interestingly here is\nto point out that the electron-phonon decoupling predicted in the present work, cannot be observed by transport measurements because of the lack of time resolution, rising a strong demand for ultrafast time-resolved\nnanocalorimetry. A fast version of Normal Superconductor Insulator thermometer actually achieved sub-μs read\nout resolution, thus, foreseeing the possibility to access\nthermal relaxations rates with transport measurements\nin the μs time-window. Nevertheless the time-window\nover which the decoupling here addressed occurs is on\nthe ns-10 ns time scale, that is two orders of magnitude\nfaster.\nThe physics entailed in the calculations is conveniently\nunfolded as follows. The substrate temperature beneath\nthe nanodisk reaches its asymptotic value of 2.2 K for a\ntime delay of 1 ns. The system thermal dynamics is then\n\n\f4\n16\n\n13\n\nTel (K)\n\nTemperature (K)\n\nTcryo = 1.5 K\n\n10\n\nTel\nTph\n(Tel - Tph) / Tph\n\n8\n6\n\n2\n2\n\n13\n\nTph (K)\n\n15\n\n10\n\n-3.2\n\n5\n\n(Tel - Tph) / Tph (%)\n\nΓ (Wm-3 x 1014 )\n\n14\n12\n\n20\n\n3.2\n\n4\n2\n\n0\n0.8\n\n2\n\n4\n\n6\n\n8\n\n10\n\nTime (ns)\nFIG. 3: (Color online) Simulations results for Tcryo = 1.5 K. Left axis: Tph and Tel . Right axis: relative temperature variation\nin percentage. Inset: nanodisk trajectory in phase space for T < 13 K (arrows) and Tel =Tph reference line (dashed) superposed\non the interaction landscape Γ.\n\nwell described in a Two Dimensional (2D) phase space of\ncoordinates (Tph , Tel ) by the following set of equations:\n∂t Tel = −Γ(Tel , Tph )/Cel (Tel )\n(4)\n∂t Tph = −Ω(Tph )/Cph (Tph ) + Γ(Tel , Tph )/Cph (Tph )\nwhere the thermal flux per unit volume to the Si slab is\ntaken into account by Ω(Tph )=(Tph − 2.2K)/hρth(Tph ).\nThe thermal conductivities within the disk have been\nomitted, the simulation results showing that the temperature distribution within the disk is spatially uniform\nover the ns time scale, for both electrons and phonons\ntemperatures. Eq. 4 represents the velocity component in\nthe 2D phase space, the initial conditions being the temperatures (Tph , Tel ) reached for a 1 ns delay. The nanodisk trajectory in phase space is tangent to the velocity\nfield, (∂t Tph , ∂t Tel ). The trajectory is the line Tph = Tel\nfor time delays spanning the ps to 1 ns range, the velocity vector pointing along this direction. At 13 K,\n∂t Tph > ∂t Tel and the trajectory changes accordingly,\nhence Tph < Tel . The velocity field is ruled by the interplay among Ω, the specific heats and Γ. The Γ interaction\nterm is large enough in proximity of the line Tph = Tel to\nkeep Tph and Tel anchored down to 13 K, not so between\n13 and 2.2 K. The system trajectory in phase space for\nT < 13 K is reported, superimposed on the landscape Γ,\nin the inset of Fig. 3.\nWhen compared with the results obtained for Cu nanodisks, the values for Ω, Γ and the specific heats for several metals in the temperature range were the decoupling\nis here shown to take place, suggest the present finding\nshould occur in a wider range of materials other than Cu.\nTo this aim an approximate analytic approach is here\nproposed, also serving as a valuable tool to further highlight the physical quantities ruling the electron-phonon\ntemperature decoupling. In the low temperature limit,\n\nT ≪ ΘD , well satisfied in the temperature range were\nthe decoupling occurs, the interaction term approximates\nto I(T ) = (Σ0 /V )T 5 , Σ0 /V being the sub-K electronphonon coupling constant.3 The Debye model for Cph\napplies, and Eq. 4 reads:\n∂t Tel = −C1 (\n∂t Tph = −C2\n\n5\nΣ0 1 Tel5 − Tph\n)\n(\n)\nV NEF\nTel\n\n(5)\n\n5\nΘ3D\nΣ0 Θ3 Tel5 − Tph\n(Tph − TSi ) + C3 ( ) D (\n)\n3\nnAbd\nV n\nTph\n\n(6)\nwith C1 , C2 and C3 positive material-independent constants, and n the number of ions per unit volume of the\nchosen metal. In the case of a Cu nanodisk, ∂t Tph < 0\nat all times, thus ∂t Tph is ruled by the power density\ndelivered from the nanodisk's phonons to the substrate\nrather than the power density input from the electron to\nthe phonon gas, hence the first term of the sum in Eq. 6\ndominates over the second term.\nLet's now consider Al nanodisks instead and compare\nit to the Cu nanodisks case. With reference to Eq. 6, the\nfollowing ratios are calculated:\n(∂t Tel )Al /(∂t Tel )Cu ∼ 0.05\nΘ3\nΘ3\n( D )Al /( D )Cu ∼ 2.37\nnAbd\nnAbd\n3\nΣ0 Θ D\nΣ0 Θ3D\n(\n)Al /(\n)Cu ∼ 0.2\nV n\nV n\nThe first ratio signifies that Te remains rather constant\nin the Al nanodisk as compared to the Cu case, whereas\nthe last two ratios imply that the main contribution to\n∂t Tph , also for the Al case, is the power density flow from\nthe phonon gas to the Si substrate and that Tph relaxes\n\n\f5\nto the substrate temperature two times faster than in the\ncase of Cu nanodisks. The electron-phonon temperature\ndecoupling is therefore expected to be more drastic in Al\nnanodisks as compared to the Cu case, the main role being played by ΘD and the material-dependent constants\nentering Σ0 .\nCare is to be taken when addressing the system dimensions issue. In order to perform nanocalorimetry the\ncondition Bi < 1 needs to be fulfilled. This requirement poses constraints on the maximum disk height in\nrelation to the adopted metals, i.e. pure metals versus\nmetals alloys. For instance, investigating a Permalloy\nnanodisk at 300 K (kP y =20 WK−1 m−1 and ρth ∼10−8\nW−1 m2 K),21,26 Bi ∼1 for h=200 nm, whereas for a Cu\nnanodisk Bi ∼ 1 for h = 3.81 μm. Furthermore, for low\nk materials the laser penetration depth to disk height\nratio can be an issue with regards to the disk temperature homogeneity. The nanoscale range guarantees for\nan isothermal nanodisk over a wide range of metals samples. On the other side, when dealing with metals nanoclusters, the low frequency vibrational eigenmodes arising from the cluster finite-size, 0.1 THz and below, should\n\n∗\n1\n\n2\n\n3\n\n4\n\n5\n\n6\n\n7\n\n8\n\n9\n\n10\n\n11\n\n12\n\n13\n\nfrancesco.banfi@dmf.unicatt.it\nG. Cahill, W. K. Ford, K. E. Goodson, G. D. Mahan,\nA. Majumdar, H. J. Maris, R. Merlin, and S. R. Phillpot,\nJ. Appl. Phys. 93, 793 (2003).\nK. Schwab, E. Henriksen, J. Worlock, and M. Roukes, Nature 404, 974 (2000).\nF. Giazotto, T. T. Heikki, A. Luukanen, A. M. Savin, and\nJ. P. Pekola, Rev. Mod. Phys. 78, 217 (2006).\nV. Juvé, M. Scardamaglia, P. Maioli, A. Crut, S. Merabia,\nL. Joly, N. D. Fatti, and F. Vallée, Phys. Rev. B 80, 195406\n(2009).\nW. C. Fon, K. C. Schwab, J. M. Worlock, and M. L.\nRoukes, Nano Lett. 5, 1968 (2005).\nC. Giannetti, F. Banfi, D. Nardi, G. Ferrini, and F. Parmigiani, IEEE Photonics Journal 1, 21 (2009).\nA. Comin, C. Giannetti, G. Samoggia, P. Vavassori,\nD. Grando, P. Colombi, E. Bontempi, L. E. Depero,\nV. Metlushko, B. Ilic, et al., Phys. Rev. Lett. 97, 217201\n(2006).\nC. Giannetti, B. Revaz, F. Banfi, M. Montagnese, G. Ferrini, F. Cilento, S. Maccalli, Vavassori, G. Oliviero, E. Bontempi, et al., Phys. Rev. B 76, 125413 (2007).\nD. Nardi, F. Banfi, C. Giannetti, B. Revaz, G. Ferrini, and\nF. Parmigiani, Phys. Rev. B 80, 104119 (2009).\nM. Siemens, Q. Li, M. Murnane, H. Kapteyn, R. Yang,\nE. Anderson, and K. Nelson, Appl. Phys. Lett. 94, 093103\n(2009).\nO. L. Muskens, N. D. Fatti, and F. Vallée, Nano Lett. 6,\n552 (2006).\nR. J. Stoner and H. J. Maris, Phys. Rev. B 48, 16373\n(1993).\nA. Plech, S. Kurbitz, K.-J. Berg, H. Graener, G. Berg,\nS. Grésillon, M. Kaempfe, J. Feldmann, M. Wulff, and\n\nbe accounted for in the Eliashberg function calculation.\nIn conclusion, by modeling ab-initio the thermal dynamics induced by ultrashort laser pulses in nanoscale\nsystems we show that the break-down of thermodynamical equilibrium between electrons and phonons on the\nns time scale takes place at ∼10 K. This temperature\nis two orders of magnitude higher then that observed\nin standard transport measurements. These findings set\nthe limits of applicability of ultrafast nanocalorimetry\nwell above liquid He temperature, the electron-phonon\ntemperature decoupling preventing a proper definition\nof the temperature concept of the nanosample as a\nwhole. Finally, the present work, while making available\na proper tool for interpreting all-optical time-resolved\nnanocalorimetry experiments, suggests a new route for\ninvestigating the physics of the electron phonon decoupling where the sub-Kelvin temperature requirement is\nsubstituted by the ns time resolution. If confirmed by\nthe experiments, this discovery will bridge the fields of\nultrafast optics and cryogenic transport in mesoscopic\nsystems, while setting the investigation of the thermodynamics at the nanoscale into a new perspective.\n\n14\n\n15\n16\n\n17\n\n18\n\n19\n\n20\n\n21\n\n22\n\n23\n\n24\n\n25\n\n26\n\nG. von Plessen, IBM J.Rev.Dev. 61, 762 (2003).\nA. Plech, S. Grésillon, G. von Plessen, K. Scheidt, and\nG. Naylor, Chem. Phys. 299, 183 (2004).\nP. B. Allen, Phys. Rev. Lett. 59, 1460 (1987).\nM. I. Kaganov, I. M. Lifshitz, and L. V. Tanatarov, Sov.\nPhys. JEPT 4, 173 (1957).\nCel = γel Tel with γel = 1.065 * 103 Jm−3 K3 taken from P.\nB. Allen, Phys. Rev. B 36, 2920 (1987), Cph is calculated\nwith PCWS, CSi is derived from the Debye Model, kel and\nkph are taken from C. Y. Ho et al., J. Phys. Chem. Ref.\nData 7, 959 (1978), kSi is taken from Glassbrenner et al.,\nPhys. Rev. 134, A1058 (1964).\nThe function α2 F and the DOS for Cu have been calculated implementing the code PWscf part of the Quantum\nESPRESSO program.\nS. D. Brorson, A. Kazeroonian, J. S. Moodera, D. W. Face,\nT. K. Cheng, E. P. Ippen, M. S. Dresselhaus, and G. Dresselhaus, Phys. Rev. Lett. 64, 2172 (1990).\nH. E. Elsayed-Ali, T. B. Norris, M. A. Pessot, and G. A.\nMourou, Phys. Rev. Lett. 58, 1212 (1987).\nE. D. Swartz and R. O. Pohl, Appl. Phys. Lett. 51, 2200\n(1987).\nD. R. Lide, ed., CRC Handbook of Chemistry and Physics\n(CRC Press, Boca Raton, FL, 2001).\nM. J. Weber, ed., CRC Handbook of Optical Materials\n(CRC Press, Boca Raton, FL, 2003).\nM. N. Özisik\n ̧ , Heat Conduction, II Ed. (Wiley-Interscience,\nMalabar, FL, 1993).\nM. L. Roukes, M. R. Freeman, R. S. Germain, R. C.\nRichardson, and M. B. Ketchen, Phys. Rev. Lett. 55, 422\n(1985).\n14ASM Metals Handbook (ASM, Metals Park, 1996).\n\n\f"}