{"id": "http://arxiv.org/abs/0912.3426v1", "guidislink": true, "updated": "2009-12-17T15:08:58Z", "updated_parsed": [2009, 12, 17, 15, 8, 58, 3, 351, 0], "published": "2009-12-17T15:08:58Z", "published_parsed": [2009, 12, 17, 15, 8, 58, 3, 351, 0], "title": "Bursts generate a non-reducible spike pattern code", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0912.1028%2C0912.4399%2C0912.1610%2C0912.4798%2C0912.2984%2C0912.3834%2C0912.2691%2C0912.1372%2C0912.3717%2C0912.4533%2C0912.4436%2C0912.4167%2C0912.0960%2C0912.3050%2C0912.5373%2C0912.0825%2C0912.0332%2C0912.2919%2C0912.2640%2C0912.2486%2C0912.1171%2C0912.1034%2C0912.5224%2C0912.3840%2C0912.2180%2C0912.1625%2C0912.1442%2C0912.1475%2C0912.3049%2C0912.1991%2C0912.1074%2C0912.4971%2C0912.3554%2C0912.5053%2C0912.1799%2C0912.1738%2C0912.0994%2C0912.3476%2C0912.1635%2C0912.4641%2C0912.2002%2C0912.3403%2C0912.2603%2C0912.0516%2C0912.1067%2C0912.3141%2C0912.0566%2C0912.5440%2C0912.0521%2C0912.0887%2C0912.4057%2C0912.2213%2C0912.1843%2C0912.0474%2C0912.4794%2C0912.2827%2C0912.1039%2C0912.5475%2C0912.5207%2C0912.0606%2C0912.1129%2C0912.0346%2C0912.0489%2C0912.4137%2C0912.1369%2C0912.1389%2C0912.2709%2C0912.1988%2C0912.4514%2C0912.4000%2C0912.0219%2C0912.5041%2C0912.4733%2C0912.4470%2C0912.3728%2C0912.2544%2C0912.4883%2C0912.3426%2C0912.4168%2C0912.2026%2C0912.2788%2C0912.5408%2C0912.1490%2C0912.4380%2C0912.5142%2C0912.2351%2C0912.4833%2C0912.2404%2C0912.4857%2C0912.4835%2C0912.3122%2C0912.1811%2C0912.3231%2C0912.0545%2C0912.1246%2C0912.2809%2C0912.0195%2C0912.3527%2C0912.4705%2C0912.2458%2C0912.1222&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Bursts generate a non-reducible spike pattern code"}, "summary": "At the single-neuron level, precisely timed spikes can either constitute\nfiring-rate codes or spike-pattern codes that utilize the relative timing\nbetween consecutive spikes. There has been little experimental support for the\nhypothesis that such temporal patterns contribute substantially to information\ntransmission. By using grasshopper auditory receptors as a model system, we\nshow that correlations between spikes can be used to represent behaviorally\nrelevant stimuli. The correlations reflect the inner structure of the spike\ntrain: a succession of burst-like patterns. We demonstrate that bursts with\ndifferent spike counts encode different stimulus features, such that about 20%\nof the transmitted information corresponds to discriminating between different\nfeatures, and the remaining 80% is used to allocate these features in time. In\nthis spike-pattern code, the what and the when of the stimuli are encoded in\nthe duration of each burst and the time of burst onset, respectively. Given the\nubiquity of burst firing, we expect similar findings also for other neural\nsystems.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0912.1028%2C0912.4399%2C0912.1610%2C0912.4798%2C0912.2984%2C0912.3834%2C0912.2691%2C0912.1372%2C0912.3717%2C0912.4533%2C0912.4436%2C0912.4167%2C0912.0960%2C0912.3050%2C0912.5373%2C0912.0825%2C0912.0332%2C0912.2919%2C0912.2640%2C0912.2486%2C0912.1171%2C0912.1034%2C0912.5224%2C0912.3840%2C0912.2180%2C0912.1625%2C0912.1442%2C0912.1475%2C0912.3049%2C0912.1991%2C0912.1074%2C0912.4971%2C0912.3554%2C0912.5053%2C0912.1799%2C0912.1738%2C0912.0994%2C0912.3476%2C0912.1635%2C0912.4641%2C0912.2002%2C0912.3403%2C0912.2603%2C0912.0516%2C0912.1067%2C0912.3141%2C0912.0566%2C0912.5440%2C0912.0521%2C0912.0887%2C0912.4057%2C0912.2213%2C0912.1843%2C0912.0474%2C0912.4794%2C0912.2827%2C0912.1039%2C0912.5475%2C0912.5207%2C0912.0606%2C0912.1129%2C0912.0346%2C0912.0489%2C0912.4137%2C0912.1369%2C0912.1389%2C0912.2709%2C0912.1988%2C0912.4514%2C0912.4000%2C0912.0219%2C0912.5041%2C0912.4733%2C0912.4470%2C0912.3728%2C0912.2544%2C0912.4883%2C0912.3426%2C0912.4168%2C0912.2026%2C0912.2788%2C0912.5408%2C0912.1490%2C0912.4380%2C0912.5142%2C0912.2351%2C0912.4833%2C0912.2404%2C0912.4857%2C0912.4835%2C0912.3122%2C0912.1811%2C0912.3231%2C0912.0545%2C0912.1246%2C0912.2809%2C0912.0195%2C0912.3527%2C0912.4705%2C0912.2458%2C0912.1222&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "At the single-neuron level, precisely timed spikes can either constitute\nfiring-rate codes or spike-pattern codes that utilize the relative timing\nbetween consecutive spikes. There has been little experimental support for the\nhypothesis that such temporal patterns contribute substantially to information\ntransmission. By using grasshopper auditory receptors as a model system, we\nshow that correlations between spikes can be used to represent behaviorally\nrelevant stimuli. The correlations reflect the inner structure of the spike\ntrain: a succession of burst-like patterns. We demonstrate that bursts with\ndifferent spike counts encode different stimulus features, such that about 20%\nof the transmitted information corresponds to discriminating between different\nfeatures, and the remaining 80% is used to allocate these features in time. In\nthis spike-pattern code, the what and the when of the stimuli are encoded in\nthe duration of each burst and the time of burst onset, respectively. Given the\nubiquity of burst firing, we expect similar findings also for other neural\nsystems."}, "authors": ["Hugo Gabriel Eyherabide", "Ariel Rokem", "Andreas V. M. Herz", "Ines Samengo"], "author_detail": {"name": "Ines Samengo"}, "author": "Ines Samengo", "links": [{"title": "doi", "href": "http://dx.doi.org/10.3389/neuro.01.002.2009", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/0912.3426v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0912.3426v1", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "q-bio.NC", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "q-bio.NC", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "q-bio.QM", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0912.3426v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0912.3426v1", "arxiv_comment": null, "journal_reference": "Frontiers in Neuroscience Vol. 3 Issue 1 2009", "doi": "10.3389/neuro.01.002.2009", "fulltext": "arXiv:0912.3426v1 [q-bio.NC] 17 Dec 2009\n\nBursts generate a non-reducible spike pattern code\n\nHugo G. Eyherabide1,2 , Ariel Rokem1 , Andreas V. M. Herz1,3 , and Inés Samengo2∗\n\n1\n\nInstitute for Theoretical Biology, Department of Biology, Humboldt Universität, and\nBernstein Center for Computational Neuroscience Berlin, Berlin, Germany.\n\n2\n\nCentro Atómico Bariloche and Instituto Balseiro, San Carlos de Bariloche, Argentina.\n\n3\n\nDepartment of Biology, Ludwig-Maximilians-Universität, and Bernstein Center for Computational Neuroscience Munich, Martinsried, Germany.\n\nCorrespondence\nInés Samengo\nCentro Atómico Bariloche\nSan Carlos de Bariloche, (8400), Rı́o Negro, Argentina.\nTel: ++ 54 2944 445100 (int: 5391 / 5345). Fax: ++54 2944 445299.\nEmail: samengo@cab.cnea.gov.ar\nRunning title:\nBurst-mediated neural coding.\n\n\fBiography\n\nInés Samengo studied physics in Argentina, and then switched to neuroscience. She spent\na year in Berlin, in the group of Andreas Herz, where she also met Ariel Rokem. Together\nthey studied the neural code of insect sensory systems. Back in Argentina, Inés settled as a\nresearcher in Bariloche, where Hugo Eyherabide joined her as a PhD student. Hugo and Inés\nstill interact regularly with Andreas (now in Munich) and Ariel (now in Berkeley), resulting in\na quite entertaining inter-continental collaboration group.\n\nAbstract\nAt the single-neuron level, precisely timed spikes can either constitute firing-rate codes or\nspike.pattern codes that utilize the relative timing between consecutive spikes. There has been\nlittle experimental support for the hypothesis that such temporal patterns contribute substantially to information transmission. By using grasshopper auditory receptors as a model system,\nwe show that correlations between spikes can be used to represent behaviorally relevant stimuli.\nThe correlations reflect the inner structure of the spike train: a succession of burst-like patterns.\nWe demonstrate that bursts with different spike counts encode different stimulus features, such\nthat about 20% of the transmitted information corresponds to discriminating between different\nfeatures, and the remaining 80% is used to allocate these features in time. In this spike-pattern\ncode, the what and the when of the stimuli are encoded in the duration of each burst and the\ntime of burst onset, respectively. Given the ubiquity of burst firing, we expect similar findings\nalso for other neural systems.\n\nKeywords\nBurst spiking, neural code, sensory encoding, information theory, auditory receptor.\n\n\f1 Neural codes based on spike-timing\nSingle neurons can encode time-dependent stimuli in several ways. In firing-rate codes the only\nresponse feature that carries information is the time-varying firing probability. The information\nencoded in subsequent spikes (if any) is redundant with the one available from the firing rate.\nThe firing probability is a function of the stimulus, often non-local and non-linear. Depending\non the nature of the transformation between the stimulus and the firing rate, the activity of the\nneuron may encode the stimulus continuously, or may instead only extract one or a few specific\nfeatures.\n\n(dB)\n\nC\n\nFiring-rate code\n\nPattern-based code\n\nFeature extraction\n\n60\n50\n20\n10\n0\n\n(Hz)\n\nFiring rate\n\nB\n\nFiring-rate code\nSmooth encoding\n\nTrials\n\nAmplitude\n\nA\n\n1 4\n\n500\n0\n\n0\n\n50\nTime (msec)\n\n100\n\n0\n\n50\nTime (msec)\n\n100\n\n0\n\n4\n\n1 1 2\n\n4\n\n50\n\n3\n\n100\n\nTime (msec)\n\nFigure 1: Comparison between different neural codes. A: Firing-rate code, where the\nstrength of the stimulus is encoded in the number of spikes fired in an extended time window. The temporal evolution of the firing probability (shown below) mimics the stimulus. B:\nFiring-rate code, where the occurrence of specific stimulus features (in this case, pronounced\nup- or downstrokes marked in red) is encoded in the times at which individual spikes are generated. (C) Pattern-based codes, in which different stimulus features are represented by different\nspike patterns. In this case, a burst-mediated code is shown, where patterns are distinguished\nby their intra-burst spike count.\nThese two extreme situations are depicted in the first two panels of Fig. 1 A,B. In Fig. 1A,\nthe firing probability is larger than zero almost everywhere, and the cell fires more than one\nspike in intervals comparable to those of the fluctuations in the stimulus. The number of spikes\nper unit time encodes the stimulus strength through a monotonic transformation. By reading out\nthe number of spikes in an extended time window, typically in the order of tens of milliseconds,\ndownstream neurons have access to a smooth representation of the stimulus.\nFig. 1 (B) also exemplifies a firing-rate code, but in this case the firing probability does not\nrepresent the entire dynamic range of the stimulus. It rather picks specific features, so that spike\n\n\fgeneration is only possible shortly after these particular features. In these codes, each single\nspike suffices to inform downstream neurons of the presence of the relevant feature, and the\ntemporal jitter of individual spikes is often smaller than 1 millisecond.\nThe two examples mentioned above fall within the broad class of firing-rate codes. In one\nextreme, we find codes where the firing rate varies slowly, so the precise timing of individual\nspikes is not crucial. The neuron encodes the stimulus strength making use of a fairly broad\ndynamical range, but does so with low temporal precision. In the opposite extreme, the firing\nrate varies rapidly. As the cell only represents either the presence or absence of the relevant\nfeature, little information is provided about the overall evolution of the stimulus. However, the\nrapid variation of the time-dependent firing rate provides large amounts of information about the\ntemporal location of the encoded features. These two extreme cases can be framed in a unified\nmathematical formulation (Rieke et al., 1997). Depending on whether the relevant feature is\nsharp and brief or flat and broad, the system ranges from a firing-rate code based on individual\nspikes to a firing-rate code based on mean spike counts.\nStarting with the seminal work of Mainen and Sejnowski (1995), several studies have shown\nthat precise spike timing down to the sub-millisecond regime is important to transmit information about the sensory world. Examples include the insect visual system (Strong et al., 1998),\nthe vertebrate lateral geniculate nucleus (Reinagel and Reid, 2000), the rodent somatosensory\nthalamus (Montemurro et al., 2007a), and the auditory system, e.g., invertebrate receptor cells\n(Rokem et al., 2006), vertebrate brainstem neurons (Oertle, 1999) and auditory cortical cells\n(Heil, 1997).\nHowever, spike-timing based codes can go beyond firing-rate codes. In principle, not only\nthe location of precisely timed individual spikes can transmit information, but also the relative\ntiming between two or more spikes. Such schemes are referred to as relational, or spike-pattern\ncodes. In such codes, the correlations between spikes define patterns, and these patterns are\nemployed to encode stimulus features, each feature corresponding to a particular sequence of\ninter-spike intervals (ISIs). Reich et al. (2000) and Doiron et al. (2007) showed that different\npatterns (in this case doublets of spikes separated by ISIs of different durations) were associated\nwith different stimulus features. In these examples, however, different patterns have different\ninstantaneous firing rates, so unless some additional characterization is made, one cannot rule\nout a purely firing-rate coding scheme.\nA neural code that cannot be explained in terms of the instantaneous firing rate requires\nmore complex patterns, including three or more spikes (two or more ISIs). In this paper we re-\n\n\fview the coding capabilities of a ubiquitous burst-mediated code, where the distinction between\ndifferent patterns is given by the number of spikes that compose each burst. The set of different\ncodewords consists of bursts containing different numbers of spikes, as exemplified in Fig. 1\n(C). In this case, the intra-burst ISI for different codewords remains approximately the same,\nand the distinction between the different code-words is given by the intra-burst spike count.\nTraditionally, burst firing was believed to underlie unconscious regulatory processes during\nsleep, seizures or anesthesia, and to prevent sensory signals from reaching higher processing\nstages. This picture emerged from the robust synchronized bursting activity that rises spontaneously in thalamic slices, even in the absence of stimulation (Guillery, 2001). Bursting is\nalso observed in thalamic neurons during sleep, and is disrupted as soon as the subject wakes\nup, to be replaced by tonic activity during wakefulness. However, in the last decade several\nstudies have shown that burst firing also participates in the representation of the sensory world\nduring the aroused state (Sherman, 2001), as well as in other neural systems (Krahe and Gabiani, 2004). For example, in the electrosensory lateral line lobe of the weak electric fish, bursts\nrepresent low-frequency events (Oswald et al., 2004), comprising either excitatory or inhibitory\nstimulus deflections (Metzner et al., 1998). In the mammalian LGN, bursts encode slow stimulus features (Lesica and Stanley, 2004), characterized by high contrast (Reinagel et al., 1999),\ntypical of natural images (Denning and Reinagel, 2005). In the rodent hippocampus, bursting\npyramidal place cells represent the location of the animal in the environment, both through\nthe firing rate (Wilson and McNaughton, 2003) and the timing with respect to the theta cycle\n(O'Keefe and Reece, 1993).\nA few studies have specifically explored the information carried by the intra-burst spike\ncount. Two of them involve the mammalian primary visual cortex (DeBusk et al., 1997; MartinezConde et al., 2002), where the length of each burst was correlated with the orientation of the\nstimulus. A theoretical analysis based on a computational model of a cortical pyramidal cell\n(Kepecs and Lisman, 2003) concluded that the number of spikes inside each burst represented\nthe slope of the incoming stimulus at burst onset. Finally, in tactile sensory neurons in leech (Arganda et al., 2007), the intra-burst spike count represented the velocity of skin displacements.\nThese analyses demonstrate that bursting neurons in different systems represent different stimulus attributes. A common aspect however, is that the information is not only encoded in the\ntime-dependent firing rate, but also in the correlations between spikes.\n\n\f2 Burst-mediated codes in grasshopper auditory receptors\nGrasshoppers communicate with each other by chirping acoustic signals produced by rasping\ntheir hind legs across their wings. By analyzing the response of acoustic receptor cells to a\nbroad range of naturalistic and artificial stimuli, we have demonstrated that spiking activity is\nparticularly precise when driven by sound waves whose temporal characteristics coincide with\nthose of the natural songs (Rokem et al., 2006). When these stimuli are played at moderate or\nloud volume (e.g., nearby sources), receptor neurons have a large probability to elicit bursting\nresponses (Eyherabide et al., 2008). Actually, 93% of the recorded neurons generated bursts\nwhen driven with naturalistic stimuli, whereas none of them bursted in response to signals that\nvaried much faster than the natural songs. Hence, bursting seems to appear in response to\nbehaviorally relevant stimuli only.\nIf bursts of different spike counts are mapped onto different stimulus features, then the\nstimuli eliciting shorter bursts must be significantly distinct from the stimuli generating longer\nbursts. The easiest way to test this hypothesis is to compare the average stimulus preceding\nsingle spikes, with that corresponding to doublets, triplets and quadruplets. We defined the\nburst triggered average (BTA) corresponding to bursts of n spikes as the average stimulus\ntime course before bursts containing exactly n action potentials (Fig. 2(A)).\nIn our case, the time-dependent stimulus was the volume (in decibels) of the envelope of\na high-frequency input sound wave (Eyherabide et al., 2008). All the BTAs exhibited a pronounced peak on top of a noisy background. Hence, burst production occurred a few milliseconds after a sudden elevation of the sound intensity. The magnitude of the elevation determined the number of spikes in each burst, such that higher stimulus fluctuations elicited longer\nbursts. In 85% of all bursting cells, this correspondence was selective: BTAs associated to single spikes, doublets, triplets and quadruplets were significantly different from each other. As\na consequence, the number of spikes per burst was a good predictor of the maximal height of\nthe transient intensity fluctuation (Eyherabide et al., 2008). The relationship between stimulus\nintensity and burst duration was not trivial, as sketched in Fig. 2 (B). In 95% of the bursting\nneurons, the mean stimulus eliciting a doublet was significantly larger than the stimulus that\nwould be obtained by summing up two copies of the mean stimulus generating isolated spikes,\nseparated by the observed ISI.\nDifferentiating between bursts of different durations, hence, allows us to distinguish between different stimulus features. But how can we be sure that there is no other alphabet that\n\n\fFigure 2: The burst-triggered averages (BTAs) corresponding to bursts of different lengths.\nA: Calculation of BTAs. The stimulus stretches preceding bursts of exactly n spikes are averaged together, and compared to one another. For all cells, BTAs exhibit a central peak, on top\nof a noisy background. The size of the peak increases with the number of spikes in the burst.\nB: The BTA corresponding to doublets is larger than the one that would be obtained by placing\ntwo copies of the BTA of single spikes, displaced from one another by one ISI. The same holds\nfor triplets and quadruplets.\n\n\fcould do a better job? Perhaps there is another set of patterns that also allows one to differentiate\nbetween different stimulus features. We would like to have a criterion to quantify the adequacy\nof the chosen alphabet, and to rank it with respect to other possible choices. One way would\nbe to measure how much information is lost by only distinguishing between the patterns of the\nchosen alphabet, and to neglect all additional response features. For a burst code, this amounts\nto distinguishing between bursts containing different number of spikes, while disregarding the\ninternal temporal structure of each burst beyond its spike count. Not all doublets have exactly\nthe same ISI between their two spikes, and not all triplets have exactly the same ISI sequence.\nIn order to assess the success of the burst alphabet we therefore neglect these differences. Operationally, the spike train is represented as a sequence of symbols that specify the number of\nspikes in each burst, as sketched in the inset of Figure 3 (A). All doublets are represented by\nthe same symbol, irrespective of their inner structure. The same holds for triplets, quadruplets,\nand higher-order bursts. The resulting sequence of symbols can be used to calculate the mutual\ninformation between the stimulus and the burst alphabet. If this information is substantially\nlower than the information in the original spike train, then the inner structure of bursts must be\nconsidered as relevant, and the selected alphabet as not appropriate. But this is not the case with\nour data. In Figure 3 (A) we show that the burst representation has almost the same amount\nof information as the full response. This implies that bursts encode different stimulus features\nessentially through their intra-burst spike count.\nThe burst code, though missing several response details, still provides an informative and\ncompact representation of the original spike train. The advantage of such a representation is\nthat now we can explicitly interpret the code. At this stage, we know that the number of spikes\nin each burst represents the height of the stimulus feature that elicited bursting, whereas the\ntime at which the burst is generated tags the temporal location of the relevant feature. One\nmay therefore wonder how much information corresponds to distinguishing between different\nfeatures, and how much is accounted for allocating them in time. To show this, we compared\nthe information in the burst train with that of an even more drastically reduced representation of\nthe spike train, in which all bursts are mapped onto the same symbol. No distinctions between\ndifferent types of bursts (and stimulus features) thus remain, as shown in Fig. 3 (B). In the\ninvestigated cells this leads to an average reduction of the encoded information of 22%. This\npercentage represents the 'what' in the stimulus, whereas the complementary fraction accounts\nfor the 'when' (Berry et al., 1997; Theunissen and Miller, 1995; Borst and Theunissen, 1999).\n\n\fTransmitted information (bits/sec)\nA\n\nB\nSpike train\n\nSpike train\n\n300\n\n300\n\nBurst onset\n\nBurst onset\n\nBurst train\n\nBurst train\n\n100\n\n100\n100\n\n100\n\n300\nSpike train\n\nC\n\nD\nShuffling window\n\nStimulus\n\n300\nFiring rate\n\n100\n\nEncoding\n\n(Decoding)\n\nShuffled trials\n\n(Encoding)\n\n300\nShuffled trials\n\n300\nSpike train\n\nDecoding\n\n100\n100\n\n300\nSpike train\n\n100\n\n300\nSpike train\n\nFigure 3: Comparison between the information rate carried by manipulated spike trains\n(in the y-axis) and the information rate in the original response (x-axis), for all bursting\ncells in the population. In all cases, information rates were calculated using the direct method\n(Strong et al., 1998), with the error estimations from Montemurro et al., (2007b). A: The\nspike train is parsed into a sequence of bursts that are only distinguished by their spike count,\nsuch that their inner structure is neglected. Inset: Green, red, blue and brown symbols in the\nburst train represent bursts containing 1, 2, 3 or 4 action potentials in the original spike train,\nrespectively. The sequence of bursts contains 94% of the information of the full spike train.\nB: If the same symbol is used to represent bursts of different lengths, then distinctions between\ndifferent stimulus features is no longer possible (see inset). Only temporal information referring\nto the timing of each feature remains. This implies a 22% reduction of the original information\n(21%, if compared to the information transmitted by different types of bursts). C: If trials within\neach fixed time bin are shuffled, all within-trial temporal correlations are destroyed, though the\ntime-dependent firing rate is preserved. As a consequence, the information drops by 32%. D:\nIf the stimulus is decoded from the spike train (see inset) without taking temporal correlations\ninto account, the information is reduced in 18%.\n\n\f3 Is the burst code a firing rate code?\nIn our data, the instantaneous firing rate inside different bursts is always approximately the\nsame: we found no significant dependence of the intra-burst ISI on the number of spikes per\nburst. Yet, it could be argued that the burst code is still a firing-rate code, but such that the mean\nfiring rate of the cell should be read out in long intervals. In Rokem et al. (2006) we showed that\nthe larger the time bin used to read out neural responses, the smaller the amount of transmitted\ninformation. The loss arises because longer bins have less temporal precision. One could then\ntry using broad time bins, but make them slide along the spike train in very fine steps. Even\nso, the number of spikes per burst cannot be obtained by counting the spikes inside a window\nof fixed duration. The code is composed of sequences that alternate between short and long\nbursts, and the interval between bursts is often comparable to the duration of bursts themselves.\nHence, if the window used to count spikes is short, long bursts are not captured. Instead, if\na long window is used, then several short bursts are mistaken as a single longer burst. The\nsame problem arises if one tries to convolve the spike train with a smooth bell-shaped weight\nfunction, as for example, a Gaussian kernel of fixed width. Therefore, bursts do not constitute a\nconvolved firing-rate code either.\nMore importantly, the burst code found in grasshopper receptors uses not only the precision\nof individual spikes, but also the correlations between spikes. Two subsequent spikes may or\nmay not be part of the same burst, depending on the size of the ISI separating them. Hence, it\nis their relative timing that matters. In firing rate codes, however, correlations between spikes\ncan be entirely explained in terms of the time-varying firing probability. Therefore, correlations make no additional contribution to the encoding or decoding of information, beyond the\ninformation available in the firing probability.\nThe impact of correlations on the encoding of sensory information can be assessed by shuffling trials in the neural response, for each fixed time bin, as highlighted in the inset of Figure 3\n(C). By doing so, the time-dependent firing rate is preserved, while the within-trial correlations\nare abolished. If the shuffled spike train contains significantly less information than the real\nspike train, then removing the correlations has a negative impact in the transmitted information.\nThis approach was proposed as a measure of conditional independence in the framework of\npopulation coding (Schneidman et al., 2003). When later employed to assess the role of temporal correlations in single neurons in the rat thalamus (Montemurro et al., 2007a), spike patterns\nplayed a minor role. They only increased the total information by 6% and the remaining 94%\nwas entirely attributable to the time-dependent firing rate. Thus, most information was trans-\n\n\fmitted by precisely timed single spikes. In grasshopper receptor cells, however, spike patterns\nplay a more important role, as shown in Figure 3 (C). The shuffled responses carried 32% less\ninformation than the full spike train. The constraints imposed by correlations, hence, resulted\nin a substantially improved coding scheme as compared to the one that would be obtained by\nindependent time bins.\nA complementary approach is to assess the effect of correlations in neuronal decoding\n(Latham and Nirenberg, 2005). This formulation allows us to evaluate whether the original\nstimulus can be decoded from the neural responses equally well, if within-trial temporal correlations are neglected. Since we do not know which decoding scheme is employed by downstream neurons in the brain, we use optimal Bayesian decoding, guaranteed to perform at least\nas well as any biological decoding. Figure 3 (D) shows that neglecting the correlations has\na detrimental effect in the decoded information of almost 20%, an amount that is very similar\nto the information needed to discriminate between different stimulus features, see panel (B).\nTherefore, grasshopper auditory responses can only be decoded properly if their correlational\nstructure is taken into account as summarized in Figure 4.\n\nConclusions\nOne of the central problems in neuroscience is to understand the way in which sensory information is represented in the nervous system. The objective is to know the general principles of the\nencoding scheme, and to have an explicit dictionary connecting stimulus features with response\ncharacteristics. This study addresses both issues. By using information-theoretical quantities,\nwe were able to extract some general principles governing the representation of acoustic information in grasshopper receptors. We demonstrate that the code is based on spike patterns, and\nthat the information conveyed by these patterns cannot be accounted for by a rapidly varying\nfiring rate. The code is structured in bursts, and the distinctive feature discerning between different types of bursts is the number of spikes they contain. The time of burst onset represents\nthe temporal location of a certain stimulus feature, and the intra-burst spike count discriminates\nbetween different types of features. Using theoretical techniques, we quantified the fraction of\ninformation that corresponds to these two aspects individually. By thoroughly examining the\ncorrespondence between bursts and stimuli, we revealed the meaning of each pattern in terms\nof the height of sudden amplitude fluctuations. The non-linear transformation between spike\ncount and stimulus amplitude provides additional evidence that spike patterns must be read out\nas compound codewords, and not as a collection of single spikes.\n\n\fTrains of spikes represent information\nusing time with precise calibration.\nScientists reckoned\none millisecond\naffected a representation.\nIs it each single spike that sustains,\nwith its timing, a code in the brain?\nOr is the relative time\nbetween spikes that defines\na pattern-based reference frame?\nCorrelational codes have been cursed\nas the ones whose transparency is worst.\nBut here we show\nthat as far as we know\ngrasshoppers use patterns of bursts.\nFor a spike means a different thing\nthan a doublet of spikes, or a string.\nSo a burst, with its length,\ncodes for stimulus strength\nwith a non-linear map in between.\nAnd the bursts in our brain are employed\nto build patterns minutely deployed.\nIf we shuffle them out,\nwe show here, no doubt,\nthe information they carry is destroyed.\nJust as words when exquisitely chained\nmake a poem a lyrical game,\njust as notes, when combined,\nbuild up music, sublime,\nso do bursts become thoughts in the brain.\nBefore closing, allow us to first\ntell you how to manage your thirst:\nIf you want to think clear\nafter drinking a beer\nmake sure to let out a burst.\n\nFigure 4: A burst of rhymes to close, and complement the prose.\nOur model system, hence, provides an example of a correlation-based neural code whose\nbuilding blocks are bursts of spikes. Burst firing is ubiquitous in the nervous systems of both\nvertebrates and invertebrates. Our study suggests that the role of bursts in sensory representations might be even more relevant than previously thought.\n\n\fAcknowldgements\nThis work was supported by the Alexander von Humboldt Foundation, the Deutsche Forschungsgemeinschaft (SFB 618), the Consejo de Investigaciones Cientı́ficas y Técnicas, the German\nFederal Ministry of Education and Research, the Israeli Ministry of Science, the Minerva Foundation of the Max Planck Society, and the Agencia de Promoción Cientı́fica y Tecnológica of\nArgentina.\n\nReferences\n- Arganda S., Guantes R., and de Polavieja G. G. (2007). Sodium pumps adapt spike\nbursting to stimulus statistics. Nat. Neurosci. 10, 1467-1473.\n- Berry M. J., Warland, D. K., and Meister, M. (1997). The structure and precision of\nretinal spike trains. Proc. Natl. Acad. Sci. USA 94, 5411-5416.\n- Borst, A., and Theunissen, F. E. (1999). Information theory and neural coding. Nat.\nNeurosci. 2, 947957.\n- Denning K. S., and Reinagel P. (2005). Visual Control of Burst Priming in the Anesthetized Lateral Geniculate Nucleus. J. Neurosci. 25, 35313538.\n- DeBusk B. C., DeBruyn E. J., Snider R. K., Kabara J. F., Bonds A. B. (1997). StimulusDependent Modulation of Spike Burst Length in Cat Striate Cortical Cells. J. Neurophysiol. 78, 199-213.\n- Doiron B., Oswald A. M. M., and Maler, L. (2007). Interval Coding. II. DendriteDependent Mechanisms. J. Neurophysiol. 97, 2744-2757.\n- Eyherabide, H. G., Rokem, A, Herz A. V. M, and Samengo, I. (2008). Burst firing is a\nneural code in an insect auditory system. Front. Comput. Neurosci. 2:3.\ndoi:10.3389/neuro.10.003.2008\n- Guillery, W. (2001). Exploring the thalamus. (New York: Academic Press).\n- Heil, P. (1997). Auditory cortical onset responses revisited. I. First-spike timing. J.\nNeurophysiol. 77, 2616–2641.\n- Kepecs A., and Lisman J. (2003). Information encoding and computation with spikes and\nbursts. Network: Comput. Neu. Sys. 14, 103-118.\n\n\f- Krahe R., Gabbiani F. (2004). Burst firing in sensory systems. Nat. Rev. Neurosci. 5,\n13–23.\n- Latham P. E., and Niremberg S. (2005). Synergy, Redundancy and Independence in Population Codes, Revisited. J. Neurosci. 25, 5195–5206.\n- Lesica N. A., and Stanley G. B. (2004). Encoding of Natural Scene Movies by Tonic and\nBurst Spikes in the Lateral Geniculate Nucleus. J. Neurosci. 24, 10731-10740.\n- Martinez-Conde S., Macknik S. L., Hubel D. H. (2002). The function of bursts of spikes\nduring visual fixation in the awake primate lateral geniculate nucleus and primary visual\ncortex. Proc. Nac. Acad. Sci. 99, 13920-13925.\n- Meinen, Z. F., and Sejnowski, T. J. (1995). Reliability of spike timing in cortical neurons.\nScience 268, 1503–1506.\n- Metzner W., Koch C., Wessel R., and Gabbiani F. (1998). Feature Extraction by BurstLike Spike Patterns in Multiple Sensory Maps. J. Neurosci. 18, 2283-2300.\n- Montemurro, M. A., Panzeri, S., Maravall, M., Alenda, A., Bale, M. R., Bramilla, M.,\nand Petersen, R. S. (2007a). Role of precise spike timing in coding of dynamic vibrissa\nstimuli in somatosensory thalamus. J. Neurophysiol. 98, 1871–1882.\n- Montemurro, M. A., Senatore, R., and Panzeri, S. (2007b). Tight Data-Robust Bounds\nto Mutual Information Combining Shuffling and Model Selection Techniques. Neural\nComput. 19, 2913–2957.\n- Oertle, D. (1999). The role of timing in the brain stem of vertebrate auditory nuclei.\nAnnu. Rev. Physiol. 61, 497519.\n- Oswald A. M. M., Chacron M. J., Doiron B., Bastian J., and Maler L. (2004). Parallel\nProcessing of Sensory Input by Bursts and Isolated Spikes. J. Neurosci. 24, 4351-4362.\n- Reich, D. S., Mechler, F., Purpura, K. P., and Victor, J. D. (2000). Interspike Intervals,\nReceptive Fields, and Information Encoding in Primary Visual Cortex. J. Neurosci. 20,\n1964-1974.\n- Reinagel P., Godwin D., Sherman S. M., Koch C. (1999). Encoding of Visual Information\nby LGN Bursts. J. Neurophysiol. 81, 2558-2569.\n- Reinagel P., and Reid R. C. (2000). Temporal coding of visual information in the thalamus. J. Neurosci. 20, 5392-5400.\n\n\f- Rieke F., Warland D., de Ruyter van Steveninck R., Bialek W. (1997). Spikes: Exploring\nthe Neural Code. (Cambridge: MIT Press).\n- Rokem, A., Watzl, S., Gollisch, T., Stemmler, M., Herz, A. V. M., and Samengo, I. (2006).\nSpike-Timing Precision Underlies the Coding Efficiency of Auditory Receptor Neurons.\nJ. Neurophysiol. 95, 2541–2552.\n- Sherman S. M. (2001). Tonic and burst firing: dual modes of thalamocortical relay.\nTrends. Neurosci. 24, 122–126.\n- Schneidman, E., Bialek, W., and Berry, M. J. (2003). Synergy, Redundancy, and Independence in Population Codes. J. Neurosci. 23, 11539-11553.\n- Strong, S. P., Koberle, R., de Ruyter van Steveninck, R. R., and Bialek, W. (1998). Entropy and Information in Neural Spike Trains. Phys. Rev. Lett. 80, 197–200.\n- Theunissen, F., and Miller, J. P. (1995). Temporal encoding in nervous systems: a rigorous definition. J. Comput. Neurosci. 2, 149162.\n\n\fKey Concepts\nFiring-rate codes: neural codes where all the information is encoded in the time-dependent\nfiring rate, additional response properties being irrelevant.\nInter-spike interval (ISI): the interval between two contiguous action potentials.\nPattern-based codes: neural codes structured into patterns of spikes, defined by characteristic\ncorrelations in their relative timing.\nBurst of spikes: sequence of action potentials separated by small inter-spike intervals, near to\nthe refractory period of the neuron.\nBurst-triggered average (BTA) of a burst of n spikes: the average of stimulus stretches preceding the generation of bursts of exactly n spikes.\nMutual information between stimuli and neural responses: the amount of knowledge that can\nbe gained about the stimulus by observing the neural activity (and vice versa).\n\n\f"}