{"id": "http://arxiv.org/abs/1009.0845v4", "guidislink": true, "updated": "2014-05-02T07:19:33Z", "updated_parsed": [2014, 5, 2, 7, 19, 33, 4, 122, 0], "published": "2010-09-04T15:22:19Z", "published_parsed": [2010, 9, 4, 15, 22, 19, 5, 247, 0], "title": "Canonical form of master equations and characterization of\n  non-Markovianity", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1009.2501%2C1009.3950%2C1009.1803%2C1009.0534%2C1009.4467%2C1009.5816%2C1009.4868%2C1009.0113%2C1009.4504%2C1009.2442%2C1009.2223%2C1009.2692%2C1009.1876%2C1009.0924%2C1009.4154%2C1009.0119%2C1009.2681%2C1009.1538%2C1009.2977%2C1009.3396%2C1009.4788%2C1009.2045%2C1009.4701%2C1009.3400%2C1009.0169%2C1009.2758%2C1009.0440%2C1009.2662%2C1009.1619%2C1009.1888%2C1009.2898%2C1009.0678%2C1009.3883%2C1009.5048%2C1009.3364%2C1009.5882%2C1009.4224%2C1009.2176%2C1009.1099%2C1009.3724%2C1009.3262%2C1009.5670%2C1009.3318%2C1009.5321%2C1009.5567%2C1009.0471%2C1009.0282%2C1009.0025%2C1009.3824%2C1009.3210%2C1009.1464%2C1009.2443%2C1009.0941%2C1009.1073%2C1009.4089%2C1009.3857%2C1009.4029%2C1009.4833%2C1009.1657%2C1009.0996%2C1009.2813%2C1009.5650%2C1009.3193%2C1009.5722%2C1009.0330%2C1009.5200%2C1009.3363%2C1009.3132%2C1009.5075%2C1009.1861%2C1009.0720%2C1009.1789%2C1009.3900%2C1009.0706%2C1009.5335%2C1009.3657%2C1009.0845%2C1009.4529%2C1009.2632%2C1009.2175%2C1009.5517%2C1009.5466%2C1009.5382%2C1009.5860%2C1009.4937%2C1009.5588%2C1009.1765%2C1009.4628%2C1009.2431%2C1009.0630%2C1009.2786%2C1009.3609%2C1009.0287%2C1009.2588%2C1009.4908%2C1009.1576%2C1009.0953%2C1009.4421%2C1009.4034%2C1009.0110%2C1009.4416&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Canonical form of master equations and characterization of\n  non-Markovianity"}, "summary": "Master equations govern the time evolution of a quantum system interacting\nwith an environment, and may be written in a variety of forms. Time-independent\nor memoryless master equations, in particular, can be cast in the well-known\nLindblad form. Any time-local master equation, Markovian or non-Markovian, may\nin fact also be written in a Lindblad-like form. A diagonalisation procedure\nresults in a unique, and in this sense canonical, representation of the\nequation, which may be used to fully characterize the non-Markovianity of the\ntime evolution. Recently, several different measures of non-Markovianity have\nbeen presented which reflect, to varying degrees, the appearance of negative\ndecoherence rates in the Lindblad-like form of the master equation. We\ntherefore propose using the negative decoherence rates themselves, as they\nappear in the canonical form of the master equation, to completely characterize\nnon-Markovianity. The advantages of this are especially apparent when more than\none decoherence channel is present. We show that a measure proposed by Rivas et\nal. is a surprisingly simple function of the canonical decoherence rates, and\ngive an example of a master equation that is non-Markovian for all times t>0,\nbut to which nearly all proposed measures are blind. We also give necessary and\nsufficient conditions for trace distance and volume measures to witness\nnon-Markovianity, in terms of the Bloch damping matrix.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1009.2501%2C1009.3950%2C1009.1803%2C1009.0534%2C1009.4467%2C1009.5816%2C1009.4868%2C1009.0113%2C1009.4504%2C1009.2442%2C1009.2223%2C1009.2692%2C1009.1876%2C1009.0924%2C1009.4154%2C1009.0119%2C1009.2681%2C1009.1538%2C1009.2977%2C1009.3396%2C1009.4788%2C1009.2045%2C1009.4701%2C1009.3400%2C1009.0169%2C1009.2758%2C1009.0440%2C1009.2662%2C1009.1619%2C1009.1888%2C1009.2898%2C1009.0678%2C1009.3883%2C1009.5048%2C1009.3364%2C1009.5882%2C1009.4224%2C1009.2176%2C1009.1099%2C1009.3724%2C1009.3262%2C1009.5670%2C1009.3318%2C1009.5321%2C1009.5567%2C1009.0471%2C1009.0282%2C1009.0025%2C1009.3824%2C1009.3210%2C1009.1464%2C1009.2443%2C1009.0941%2C1009.1073%2C1009.4089%2C1009.3857%2C1009.4029%2C1009.4833%2C1009.1657%2C1009.0996%2C1009.2813%2C1009.5650%2C1009.3193%2C1009.5722%2C1009.0330%2C1009.5200%2C1009.3363%2C1009.3132%2C1009.5075%2C1009.1861%2C1009.0720%2C1009.1789%2C1009.3900%2C1009.0706%2C1009.5335%2C1009.3657%2C1009.0845%2C1009.4529%2C1009.2632%2C1009.2175%2C1009.5517%2C1009.5466%2C1009.5382%2C1009.5860%2C1009.4937%2C1009.5588%2C1009.1765%2C1009.4628%2C1009.2431%2C1009.0630%2C1009.2786%2C1009.3609%2C1009.0287%2C1009.2588%2C1009.4908%2C1009.1576%2C1009.0953%2C1009.4421%2C1009.4034%2C1009.0110%2C1009.4416&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Master equations govern the time evolution of a quantum system interacting\nwith an environment, and may be written in a variety of forms. Time-independent\nor memoryless master equations, in particular, can be cast in the well-known\nLindblad form. Any time-local master equation, Markovian or non-Markovian, may\nin fact also be written in a Lindblad-like form. A diagonalisation procedure\nresults in a unique, and in this sense canonical, representation of the\nequation, which may be used to fully characterize the non-Markovianity of the\ntime evolution. Recently, several different measures of non-Markovianity have\nbeen presented which reflect, to varying degrees, the appearance of negative\ndecoherence rates in the Lindblad-like form of the master equation. We\ntherefore propose using the negative decoherence rates themselves, as they\nappear in the canonical form of the master equation, to completely characterize\nnon-Markovianity. The advantages of this are especially apparent when more than\none decoherence channel is present. We show that a measure proposed by Rivas et\nal. is a surprisingly simple function of the canonical decoherence rates, and\ngive an example of a master equation that is non-Markovian for all times t>0,\nbut to which nearly all proposed measures are blind. We also give necessary and\nsufficient conditions for trace distance and volume measures to witness\nnon-Markovianity, in terms of the Bloch damping matrix."}, "authors": ["Michael J. W. Hall", "James D. Cresser", "Li Li", "Erika Andersson"], "author_detail": {"name": "Erika Andersson"}, "author": "Erika Andersson", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1103/PhysRevA.89.042120", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1009.0845v4", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1009.0845v4", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "v2: Significant update, with many new results and one new author. 12\n  pages; v3: Minor clarifications, to appear in PRA; v4: matches published\n  version", "arxiv_primary_category": {"term": "quant-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "quant-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1009.0845v4", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1009.0845v4", "journal_reference": "Phys. Rev. A 89, 042120 (2014)", "doi": "10.1103/PhysRevA.89.042120", "fulltext": "Canonical form of master equations and characterization of non-Markovianity\nMichael J. W. Hall,1 James D. Cresser,2 Li Li,1 and Erika Andersson3\n1\n\narXiv:1009.0845v4 [quant-ph] 2 May 2014\n\nCentre for Quantum Computation and Communication Technology (Australian Research Council),\nCentre for Quantum Dynamics, Griffith University, Brisbane, QLD 4111, Australia\n2\nDepartment of Physics and Astronomy, Macquarie University, Sydney NSW 2109, Australia\n3\nSUPA, Institute for Photonics and Quantum Sciences,\nSchool of Engineering and Physical Sciences, Heriot-Watt University, Edinburgh, EH14 4AS, UK\nMaster equations govern the time evolution of a quantum system interacting with an environment,\nand may be written in a variety of forms. Time-independent or memoryless master equations, in\nparticular, can be cast in the well-known Lindblad form. Any time-local master equation, Markovian\nor non-Markovian, may in fact also be written in a Lindblad-like form. A diagonalisation procedure\nresults in a unique, and in this sense canonical, representation of the equation, which may be used to\nfully characterize the non-Markovianity of the time evolution. Recently, several different measures of\nnon-Markovianity have been presented which reflect, to varying degrees, the appearance of negative\ndecoherence rates in the Lindblad-like form of the master equation. We therefore propose using the\nnegative decoherence rates themselves, as they appear in the canonical form of the master equation,\nto completely characterize non-Markovianity. The advantages of this are especially apparent when\nmore than one decoherence channel is present. We show that a measure proposed by Rivas et al. is\na surprisingly simple function of the canonical decoherence rates, and give an example of a master\nequation that is non-Markovian for all times t > 0, but to which nearly all proposed measures are\nblind. We also give necessary and sufficient conditions for trace distance and volume measures to\nwitness non-Markovianity, in terms of the Bloch damping matrix.\nPACS numbers: 03.65.Yz, 03.65.Ta, 42.50.Lc\n\nI.\n\nINTRODUCTION\n\nAn open quantum system is a quantum system whose\ndynamics is determined both by interactions internal to\nthe system, and by influences from an environment. As\nno physical system is truly isolated, this is a situation\nwhich applies very widely. Time-independent or memoryless behavior leads to Markovian master equations\nin the so-called Lindblad form [1, 2]. Lindblad master\nequations have been extensively used to describe phenomena in e.g. quantum optics, semiconductor physics\nand atomic physics, ranging from the decay of an atom\nto a quantum-mechanical description of Brownian motion [3–5].\nThe non-Markovian case is less well understood, but\nis becoming increasingly relevant as our ability to experimentally control quantum systems develops. Simple examples are a damped harmonic oscillator and a damped\ndriven two-level atom [3, 4]. Also, the vast majority\nof calculations of error thresholds for quantum computing makes the assumption that the noise processes are\nMarkovian. This is not necessarily physically realistic [6].\nRecently, several different measures of non-Markovianity have been proposed [7–15]. For example, the measure in [8] is based on whether it is possible for the trace\ndistance between two initial states to increase as a function of time. If the time evolution starting from a time t0\nis completely positive, then the trace distance cannot exceed its inital value at t0 , but it could first decrease and\nthen increase again. This would be a signature of nonMarkovian behavior. Other signatures of this type are\nbased on increases in entanglement [9, 11, 12], Fisher in-\n\nformation and Bures distance [10, 13, 14], and the volume\nof states [15]. Measures directly based on the definition\nof complete positivity, such as the amount of isotropic\nnoise needed to make the evolution completely positive\n[7], have also been suggested [7, 9].\nThe above measures are all compatible with a definition of Markovianity corresponding to being able to write\nthe master equation in a local-in-time Lindblad-like form,\nsuch that all decoherence rates γk (t) are positive at all\ntimes. Mathematically equivalent characterizations for\nfinite-dimensional systems are that the evolution is divisible into a sequence of infinitesimal completely positive\nevolutions [9, 16] (analogous to the classical ChapmanKolmogorov equation [17]), and that the evolution can\nbe modelled by standard quantum jump trajectories for\nthe system [18–20]. Hence, a natural definition of nonMarkovian time evolution is the unavoidable appearance\nof one or more negative decoherence rates in the master\nequation.\nIn order to obtain a fundamental characterization underlying the many proposed measures of nonMarkovianity, it follows that one should focus on their\ncommon point of origin, i.e., the negative decoherence\nrates γk (t) themselves. We will show that this leads to\na unique measure that gives a complete picture of nonMarkovianity even when there are several decoherence\nchannels present. Also, it does not require solving the\nmaster equation to obtain the time evolution of the system, or optimising over initial states.\nAny function of the γk (t) that can witness their negativity in at least some cases will be a valid measure of\nnon-Markovianity, and the measures in [7–13, 15] can be\n\n\f2\nviewed in this way. Corresponding signatures, such as\nincreasing trace distance or increasing entanglement, are\nuseful as experimentally accessible indicators of the presence of negative decoherence rates [21, 22]. If only one\ndecoherence channel is present, these measures are more\nor less equivalent to knowledge of γ(t) [8, 9]. However,\nmore generally, they may not witness non-Markovian evolution even when it is present.\nIf one is to base a measure of non-Markovianity directly on the negativity of decoherence rates in a master\nequation, it is essential to have a unique form of the equation, since each master equation may be written in many\nways. This is indeed a reason cited in [8] for not basing a definition of non-Markovanity directly on a master\nequation. Fortunately, there is such a unique and canonical form. This result is a straightforward extension of\nthe treatment in [2]. General forms of time-local master\nequations have been used previously e.g. in [16, 18, 23],\nbut the significance and usefulness of the unique diagonal form of the equation has, as far as we are aware, not\nbeen emphasized. Neither is the generality of time-local\nmaster equations [24] as widely recognised as it should\nbe. We will therefore start by presenting the canonical\nform of a time-local master equation in Sec. II, before\ndiscussing how this gives rise to a natural means of completely quantifying non-Markovianity in Sec. III, in terms\nof the canonical decoherence rates.\nIn Sec. IV we consider various proposed measures of\nnon-Markovianity [7–13, 15], and assess their relative\nabilities to witness non-Markovianity. We find, surprisingly, that none of the measures based on an increasing distance, volume or entanglement can witness the\nnon-Markovianity of a simple qubit example. However,\nthe Choi-matrix based measures of Wolf et al. [7] and\nRivas et al. [9] are always faithful witnesses of nonMarkovianity, and are shown to be simple functions of\nthe canonical decoherence rates. We also give simple\nnecessary and sufficient conditions for trace distance and\nvolume measures to be able to witness non-Markovianity,\nin terms of the Bloch damping matrix.\nConclusions are presented in Sec. V. Technical details\nare largely deferred to the Appendices.\n\nII.\n\nFORMS OF MASTER EQUATIONS\nA.\n\nMemoryless master equations\n\nUnder fairly general conditions, a master equation for\na system density operator ρ takes the form [25, 26]\ni\nρ̇(t) = − [HS , ρ(t)] +\n~\n\nZ\n\n0\n\nt\n\nKs,t [ρ(s)] ds.\n\n(1)\n\nHere HS is the system Hamiltonian, and the memory\nkernel Ks,t is a linear map describing the effects of the\nenvironment on the system. The Born-Markov approximation amounts to approximating the memory kernel (in\n\nthe interaction picture) by Ks,t ≈ δ(t − s) Kt . Further,\nany explicit time dependence in Kt typically comprises\nrapidly fluctuating terms, that may be removed via a\nsecular (or random wave) approximation to give a memoryless master equation of Lindblad form [3]:\no\u0013\nX \u0012\n1n †\ni\nL̂k L̂k , ρ\n. (2)\nρ̇ = − [H, ρ] +\nγk L̂k ρL̂†k −\n~\n2\nk\n\nHere the γk are positive constants, called decoherence\nrates, and the unitary part of the time evolution corresponding to H may include effects arising from the environment [3]. The Lindblad form in Eq. (2) may also\nbe derived under the assumptions that the evolution is\ncompletely positive and generated by a dynamical semigroup [1].\nB.\n\nTime-local master equations\n\nMore generally, even when the system 'remembers'\nits previous evolution, it has been shown via the timeconvolutionless projection operator method [27, 28] that\na general master equation (1) often can be written in\na time-local form, ρ̇(t) = Λt [ρ(t)], where Λt is, among\nother requirements, a linear map such that Λt [ρ] is Hermitian and traceless for all ρ. An alternative approach,\nfor the class of master equations obtained from the reduced memoryless evolution of a system plus ancilla, is\ngiven in [35]. Such a description of the evolution is not\nonly convenient, but appears necessary, for example, to\nconstruct a quantum trajectory unravelling in terms of\npossible 'paths' the time evolution of the system may\ntake [18, 19, 29–31].\nFor an alternate and very simple proof that memorykernel master equations can typically be written in timelocal form [32], consider some evolution process described\nby the linear (usually completely positive) map ρ(t) =\nφt [ρ(0)], which satisfies a memory-kernel master equation\nof the general form in Eq. (1). If it is assumed that\nthe map φt is invertible for the time interval considered,\ni.e., that there exists a linear map φ−1\nsatisfying φ−1\nt\nt ◦\nφt = 1 where 1 is the identity map, then one can write,\nabsorbing the Hamiltonian component into Ks,t ,\nZ t\nρ̇(t) =\nds (Ks,t ◦ φs )[ρ(0)]\n0\nZ t\n=\nds (Ks,t ◦ φs ◦ φ−1\nt ){φt [ρ(0)]}\n0\n\n= Λt [ρ(t)],\n(3)\nRt\nwhere Λt := 0 ds Ks,t ◦ φs ◦ φ−1\nt , which is of time-local\n(albeit in general complicated) form.\nThe assumption that the evolution is invertible is not\nstrong, and is violated only if two initially distinct states\nevolve to the same state at some finite time t (e.g., if an\n'equilibrium state' is reached within a finite time rather\nthan asymptotically). As shown in [32], even in this case\n\n\f3\nit is sometimes possible to describe the evolution by a\ntime-local master equation. Typically, decoherence rates\napproach infinity at times when the evolution is not invertible [32–35]. Note also that even if the time evolution is not invertible for isolated points in time, but a\ntime-local master equation exists for other times, it can\nstill be used for a characterization of non-Markovianity.\nPhysically relevant examples where the time evolution is\ninvertible for all times include spontaneous emission and\noptical phase diffusion [36], where the latter is also an\nexample of a time-local master equation corresponding\nto non-Markovian evolution.\nC.\n\nCanonical form for master equation\n\nThe Lindblad form for memoryless master equations\nin Eq. (2) is non-unique, as γk and Lk can be chosen in\ninfinitely many different ways, corresponding to different\nKraus decompositions of completely positive maps [1].\nNevertheless, as shown in Appendix A by explicit construction,\nany time-local master equation, ρ̇ = Λt [ρ(t)] =\nP\nk Ak (t)ρBk (t), can be cast in a canonical Lindblad-like\nform that uniquely defines a set of corresponding 'canonical' decoherence rates. Hence, this form is suitable for\ncharacterizing non-Markovianity.\nThe key to obtaining the canonical form is to first\nrewrite the master equation in terms of a corresponding\ntime-dependent 'decoherence matrix'. The eigenvalues\nand eigenvectors of this matrix directly determine the\ncanonical decoherence rates γk (t) and decoherence operators Lk (t), and the corresponding canonical decoherence\nchannels are mutually orthogonal in the sense defined below. The derivation is a straightforward extension of the\napproach in [2] (see [16, 38]), and deserves to be more\ngenerally known.\nIn particular, as shown in Appendix A, any local-intime master equation, for a quantum system having a\nd-dimensional Hilbert space, can be written in the canonical form\n2\n\ndX\n−1\nh\ni\nρ̇ = − [H(t), ρ] +\nγk (t) Lk (t)ρL†k (t)\n~\nk=1\no\u0015\n1n †\n−\nLk (t)Lk (t), ρ (4)\n2\n\nwhere the Lk (t) form an orthonormal basis set of traceless\noperators, i.e.,\nTr[Lk (t)] = 0,\n\nTr[L†j (t) Lk (t)] = δjk ,\n\n(5)\n\n(ii) the decoherence rates γk (t) are uniquely determined,\nand, moreover, remain invariant under any unitary\ntransformation ρ → V (t)ρV (t)† (e.g. to an 'interaction' picture);\n(iii) the decoherence rates can be negative, corresponding to interactions between the environment and\nthe system in such a way that the system may recohere, reversing earlier decay processes [19, 31, 32,\n39]; and\n(iv) the decoherence operators Lk (t) are restricted to\ncorrespond to a set of 'orthogonal' decoherence\nchannels, as per Eq. (5).\nNote that constraints on γk (t) and Lk (t) to ensure that\nthe time evolution is completely positive, or even positive, have not been considered here. Thus, for instance,\nwhile all time-local master equations can be written in\nthe above canonical form, there is no guarantee that an\narbitrary master equation of this form will yield only\npositive eigenvalues for ρ for all times. Conditions for\ntime-local qubit master equations to generate completely\npositive evolution are discussed in [40].\nIII. CHARACTERIZING\nNON-MARKOVIANITY\nA.\n\nDefinition\n\nIt is seen that time-local master equations are widely\napplicable, and that any such master equation may be\nrewritten in the canonical form (4). Further, this form\nuniquely determines a set of corresponding canonical decoherence rates, γk (t), given by the eigenvalues of the\ndecoherence matrix d in Eq. (A7). An alternative means\nfor determining the γk (t) is given in Appendix C.\nIf the canonical decoherence rates are positive at all\ntimes, then the evolution over any time interval is completely positive. This has been termed 'time-dependent\nMarkovian' evolution, e.g., in [7–9], and clearly generalises the completely positive evolution guaranteed for\nmemoryless master equations in Eq. (2). Moreover, for\nfinite systems, having positive decoherence rates for all\ntimes is equivalent to the divisibility of the evolution into\na sequence of infinitesimal completely positive evolutions\n[9, 16]; and to being able to model the evolution by standard quantum jump trajectories for the system [18–20].\nIn light of the above, and as foreshadowed in the introduction, we are led to the following.\n\nand H(t) is Hermitian [37].\nEquation (4) may be recognised as being similar to\nthe Lindblad form for memoryless master equations in\nEq. (2). However, unlike Eq. (2):\n\nDefinition : A time-local master equation is Markovian,\nat some given time, if and only if the canonical\ndecoherence rates are positive. Correspondingly,\nthe evolution is non-Markovian if one or more of\nthe canonical decoherence rates is strictly negative.\n\n(i) the decoherence rates γk (t) and the decoherence operators Lk (t) are in general time dependent;\n\nTo illustrate the importance of using the canonical form of the master equation to characterize non-\n\n\f4\nMarkovianity, consider the evolution corresponding to\nρ̇ = [2γ(t) + γ̃(t)] [2σx ρσx + 2σy ρσy − 4ρ]\n−γ(t) [2σ− ρσ+ − σ+ σ− ρ − ρσ+ σ− ]\n−γ(t) [2σ+ ρσ− − σ− σ+ ρ − ρσ− σ+ ] .\n\n′\n\nF (t, t ) =\n\nAt first sight this may appear to be non-Markovian whenever γ(t) > 0 or 2γ(t) + γ̃(t) < 0. However, the canonical\nform of this equation may be written as\nρ̇ = [γ(t) + γ̃(t)] [2σx ρσx + 2σy ρσy − 4ρ] ,\nand hence the evolution is non-Markovian if and only if\nγ(t) + γ̃(t) < 0.\nA more general example showing the necessity of using\nthe canonical form is the master equation\n1\nρ̇ = LρL† − (L† Lρ + ρL† L)\n2\n\u0002\n\u0003\n1\n− L† ρL − (LL† ρ + ρLL† ) ,\n2\n\nwhere the second line appears, prima facie, to generate\nnon-Markovian evolution for any √\nnonzero L. However,\nmaking the choice L = (1+iH/~)/ 2, for any Hermitian\noperator H, this master equation reduces to the Hamiltonian form\ni\nρ̇ = − [H, ρ],\n~\ncorresponding to unitary (and hence trivially Markovian)\nevolution.\nFinally, it is worth emphasising again that the canonical decoherence rates, and hence the above characterization of non-Markovianity, are not only unique, but are\ninvariant under any time-dependent unitary transformation of the system (see previous section and Appendix A).\nB.\n\nCanonical measures of non-Markovianity\n\nSince the defining feature of non-Markovianity is\nwhether any of the γk (t) in the canonical form (4) become negative, it is natural to make use of the functions\nfk (t) := max[0, −γk (t)] ≥ 0\n\n(6)\n\nto describe the non-Markovanity in individual decoherence channels. We can either use the fk (t) directly, as\ncanonical measures of non-Markovianity at time t, or a\nfunction such as\nf (t) =\n\n2\ndX\n−1\n\nk=1\n\n2\n\nd −1\n\u0003\n1 X\u0002\nfk (t) =\n|γk (t)| − γk (t)\n2\n\n(7)\n\nk=1\n\n(rescaled by some function of d if we wish).\nWe can similarly use the corresponding integrals\nZ t′\n′\nFk (t, t ) =\nds fk (s)\nt\n\nto characterize the \"total amount of non-Markovianity\nin channel k over the time interval [t, t′ ]\", and the corresponding sum\n\n(8)\n\n2\ndX\n−1\n\n′\n\nFk (t, t ) =\n\nZ\n\nt′\n\nds f (s)\n\n(9)\n\nt\n\nk=1\n\nas a measure of the \"total amount of non-Markovianity\nover the interval [t, t′ ]\". Either of these quantities may be\nrescaled – e.g., by the total elapsed time t′ − t. Note that\nf (t) and F (t, t′ ) are strictly positive if and only if the\nevolution is non-Markovian. It will be shown in Sec. IV\nthat a measure proposed by Rivas et al. [9] is equal to\n2d−1 F (0, ∞), thereby providing a simple formula (and\ninterpretation) for the proposed measure, in terms of the\ncanonical decoherence rates.\nWe also define a canonical discrete measure of nonMarkovianity, as the number of strictly negative decoherence rates, i.e.,\nn(t) := #{k : γk (t) < 0} = #{k : fk (t) > 0}.\n\n(10)\n\nThus, n(t) is a \"non-Markov index\".\nIn the sense that Tr[Lj (t)† Lk (t)] = δjk , as per Eq. (5),\nthe non-Markovian part of the dynamics takes part in\na region of 'evolution space' which is orthogonal to the\nMarkovian region. For example, for a two-level system,\nif Markovian behavior is generated by the x direction of\nthe Bloch vector, then non-Markovian behavior can be\ngenerated by the y and z directions. The non-Markov\nindex therefore characterizes the dimension of the space\nof non-Markovian evolution.\nC.\n\nExample: single decoherence channel\n\nThe simplest case to consider is a master equation with\nonly one non-zero decoherence\nrate, i.e., of the form\n\u0002\n\u0003 ρ̇ =\n− ~i [K(t), ρ] + α(t) A(t)ρA(t)† − 21 {A(t)† A(t), ρ} . The\ncorresponding canonical form is easily checked to be\n\u0012\n\u0013\ni\n1\nρ̇ = − [H(t), ρ] + γ(t) L(t)ρL(t)† − {L(t)† L(t), ρ} ,\n~\n2\n(11)\n1/2\nwith L(t) := (A − a)/{Tr[(A† − a∗ )(A − a)]}\n, γ(t) :=\n\u0002\n\u0003\nαTr[(A† − a∗ )(A − a)], H(t) := K − 12 i~α a A† − a∗ A ,\nand a(t) := d−1 Tr[A(t)]. These definitions ensure that\nthat Tr[L(t)] = 0 and Tr[L(t)† L(t)] = 1, as required by\nEq. (5).\nHence, from the definition of non-Markovianity in\nSec. III A, the evolution of a system with a single decoherence channel is non-Markovian, at time t, if and only\nif γ(t) < 0 (or, equivalently, α(t) < 0). The total amount\nof non-Markovianity over an interval [t, t′ ] follows from\nEq. (9) as\nZ\nds γ(s).\n(12)\nF (t, t′ ) = −\nγ(t)<0\n\n\f5\nFurther, from Eq. (10), the non-Markov index is unity\nwhen γ(t) < 0 and zero otherwise.\nThe case of a single decoherence channel appears to\nbe the prototypical example used in the literature to assess various proposed measures of non-Markovianity [7–\n13, 15]. However, this case is too simple to assess the\nrelative strengths of the proposed measures, as they are\nall functionals of γ(t) that are sensitive to its sign. For\nexample, the rate of change of Rtrace distance for the qubit\nt\nexample in [8] is −γ(t) exp[− 0 ds γ(s)], while the Choimatrix based measure I in [9] evaluates to F (0, ∞) with\nF as in Eq. (12).\nFor this reason, examples of master equations with\nmultiple decoherence channels are required to properly assess and compare proposed measures of nonMarkovianity (see also Sec. IV).\n\nD.\n\nExample: eternal non-Markovianity\n\nThe qubit master equation\n3\n\n1X\nρ̇ =\nγk (t) [σk ρσk − ρ] ,\n2\n\n(13)\n\nk=1\n\nwhere the σk are the Pauli sigma matrices and\nγ1 (t) = γ2 (t) = 1,\n\nγ3 (t) = − tanh t,\n\n(14)\n\nis of particular interest, as it provides a simple example\nof a completely positive evolution that is non-Markovian\nat all times t > 0, yet which is not detectable as nonMarkovian by the majority of proposed measures in the\nliterature (see Sec. IV).\nComplete positivity of the map from ρ(0) to ρ(t), for\na master equation of the form in Eq. (13), corresponds\nto Γj + Γk ≤ 1 + Γl for all permutations j, k, l of 1, 2, 3,\nRt\nwith Γj (t) := exp{− 0 ds [γk (s) + γl (s)]} [32, 40], which\nis always satisfied by the above example. Such master\nequations are straightforward to solve, and in terms of\nthe Bloch vector x, with xk := Tr[ρσk ] and ρ = 12 [1+σ.x],\none finds\nxj (t) =\n\n1\n(1 + e−2t )xj (0) (j = 1, 2), x3 (t) = e−2t x3 (0).\n2\n\nThus, the initial Bloch vector asymptotically evolves to\nits projection on the xy-plane, scaled by a factor of 12 .\nEquation\n(13) is in canonical form (identifying Lk (t) =\n√\nσk / 2), and thus the system has three orthogonal decoherence channels. It is clearly non-Markovian for all\nt > 0, so that the third channel could even be termed\na 'recoherence' channel. The canonical measure of total non-Markovianity over the interval [0, t] follows from\nEq. (9) as\nF (0, t) = −\n\nZ\n\n0\n\nt\n\nds tanh s = ln cosh t.\n\n(15)\n\nThus, the average non-Markovianity, F (0, t)/t, approaches unity as t → ∞. The non-Markov index follows from Eq. (10) as n(t) = 1 for all t > 0, corresponding to non-Markovian behaviour with respect to\nthe z-direction. Even so, this 'eternal' non-Markovianity\ncannot be detected by various distance, volume and entanglement measures, as shown in the following section.\n\nIV.\n\nRELATIVE STRENGTHS OF DIFFERENT\nMEASURES OF NON-MARKOVIANITY\n\nPrevious measures of non-Markovianity in the literature are based on the relationship between Markovian\nevolution and completely-positive maps [7–15]. In particular, for Markovian evolution at time t, the decoherence rates in Eq. (4) are all positive, by definition, and\nhence the infinitesimal map taking the system from time\nt to time t + dt must be completely positive [16]. It follows, for example, that any quantity that decreases under\ncompletely-positive maps provides a suitable signature of\nnon-Markovianity: if this quantity is found to increase at\ntime t, then the evolution must be non-Markovian.\nProposed signatures of the above type leads to measures of non-Markovianity that fall into three broad categories – distance based measures, volume based measures, and entanglement based measures. A fourth category of interest is based on the Choi-matrix representation of completely positive maps. These categories are\nexamined in turn below. Of the measures examined,\nonly those based on the Choi matrix can detect the nonMarkovianity of the example in Eqs. (13) and (14).\n\nA.\n\nDistance measures\n1.\n\nTrace distance\n\nBreuer et al. have suggested using the increasing of\ntrace distance between two states as a signature of nonMarkovianity [8], and this signature has subsequently\nbeen experimentally investigated for qubits [21, 22].\nIn the Bloch representation, the square of the trace\ndistance between any two infinitesimally separated qubit\ndensity operators, ρ and ρ + δρ, is\n(δsTr )2 :=\n\n1\n1\n2\n(Tr|δρ|) = δx * δx,\n4\n4\n\n(16)\n\ncorresponding to a Euclidean metric on the space of\nBloch vectors. For qubits, it is well known that any master equation can be rewritten in the Bloch representation\nas\nẋ = D(t)x + u(t),\n\n(17)\n\nwhere x denotes the Bloch vector, and D and u are referred to as the damping matrix and drift vector, respec-\n\n\f6\ntively. Hence, δ ẋ = Dδx, and so\n1\n1\nd\n(δsTr )2 = [δ ẋ * δx + δx * δ ẋ] = δxT (D + DT )δx,\ndt\n4\n4\nwhere the superscript T denotes the transpose.\nNow, the trace distance can increase between some pair\nof density operators if and only if it can increase between\nsome pair of infinitesimally separated density operators.\nBut the above equation shows that latter is possible if and\nonly if the matrix D+DT has a positive eigenvalue. That\nis, the qubit trace distance can witness non-Markovianity\nat time t if and only if the damping matrix satisfies the\ncondition\n\u0002\n\u0003\n(18)\nλmax D(t) + DT (t) > 0\n\nwhere λmax (A) denotes the maximum eigenvalue of A.\nThis result subsumes the previously-considered special\ncase of random unitary evolution [41].\nFor the case of a single decoherence channel the above\ncondition is equivalent to γ(t) < 0, and hence nonMarkovianity can always be witnessed for such channels.\nHowever, for the qubit example in Eqs. (13) and (14),\nthe damping matrix may be calculated as [40]\n\n\n−1 + tanh t\n0\n0\n0\n−1 + tanh t 0  ≤ 0. (19)\nD(t) = \n0\n0\n−2\n\nHence, the trace distance can never witness the nonMarkovianity of this example.\n\nif the distance between some pair of infinitesimally separated density operators is increasing. For qubits, using\nEqs. (17) and (20), this corresponds to the existence of\nBloch vectors x and x + δx such that\nh\ni\nd\n(δs)2 = δxT Ġ + GD + DT G δx > 0.\ndt\n\nThis is equivalent to to the existence of a positive eigenvalue of the symmetric matrix J := Ġ + GD + DT G, i.e.,\nto\nh\ni\n(22)\nλmax Ġ + GD + DT G > 0\n\nat time t, which clearly generalises Eq. (18) for the trace\ndistance.\nFor the case of the Bures distance in Eq. (21), and a\nqubit master equation of the form of Eq. (13), the corresponding matrix JB follows via differentation of Eq. (21)\nwith respect to time. Using Eq. (17) with u(t) = 0, this\nyields\nD̄xxT + xxT D̄ (xT D̄x) xxT\n,\n+\n1−x*x\n(1 − x * x)2\n\n4JB = D̄ +\n\nwhere D̄ := D + DT . We have checked numerically, for\nD as in Eq. (19), that JB is negative definite for all times\nt > 0. Hence, just as for the trace distance, the Bures\ndistance cannot witness the non-Markovianity of the example in Eqs. (13) and (14). It remains an open question\nas to whether some other distance measure can do so.\nB.\n\n2.\n\n(23)\n\nBloch volume measure\n\nBures distance and Fisher information\n\nOther measures of distance which decrease under completely positive maps, such as the Bures and Hellinger\ndistance, have similarly been suggested as signatures of\nnon-Markovianity. [10, 13, 14]. Such distances are typically generated by some monotone metric G ≡ gjk on\nthe space of density operators [42], and for qubits have\nthe infinitestimal form\n(δs)2 = gjk (x)δxj δxk = δxT G(x) δx\n\n(20)\n\nfor Bloch vectors x and x + δx (the higher-dimensional\ncase is similar, but will not be explicitly considered here).\nFor example, the qubit Bures distance corresponds to\nthe (maximally symmetric) quantum Fisher information\nmetric [43]\n4(δsB )2 =\n\n(x * δx)2\n+ δx * δx.\n1−x*x\n\n(21)\n\nNote while attention can be restricted to families of density operators defined by some real parameter, θ or λ say\n[10, 13], we consider arbitrary density operators here, parameterised by the Bloch vector, for full generality.\nJust as for the trace distance, a given distance measure can witness non-Markovianity at time t if and only\n\nLorenzo et al. have proposed using the increase of volume of the set of states of a system as a signature of\nnon-Markovianity [15]. Here, the volume measure corresponds to the determinant of the evolution map in the\n(generalized) Bloch representation of the system, which\ncannot decrease under completely positive evolution [16].\nWe show here that this volume signature can witness nonMarkovianity if and only the trace of the (generalized)\nBloch damping matrix satisfies a simple condition. For\nqubits, this condition is strictly stronger than the trace\ndistance condition in Eq. (18). Hence, the volume provides a weaker signature of non-Markovianity than the\ntrace distance.\nAs is well known, a d-dimensional quantum system\nmay be represented by a generalized Bloch vector x of\ndimension d2 − 1, and the corresponding master equation by a generalized Bloch equation of the same form of\nEq. (17) as for qubits [15, 23]. This equation is linear,\nand hence the evolution of the system is given by a linear\nmap of the form\nx(t) = M (t)x(0) + w(t).\n\n(24)\n\nSubstitution into Eq. (17) then yields the equivalent evolution equations Ṁ = DM , ẇ = u + Dw, with initial\nconditions M (0) = I and w(0) = 0.\n\n\f7\nThe determinant of M (t) determines the Jacobian of\nthe map in Eq. (24), and hence the 'Bloch volume' of\nthe states of the system evolves as V (t) = V0 det M (t)\n[15]. Now, to first order in ǫ, the above evolution\nequations\nQ imply det M (t + ǫ) = det(M + ǫDM ) =\n(det M ) j (1 + ǫDjj ) = (det M )(1 + ǫ tr[D]) [37]. Hence,\nd\ndt det M = tr[D] det M , which immediately implies that\nthe Bloch volume can increase at time t, thus witnessing\nnon-Markovianity, if and only if the trace of the damping\nmatrix is positive, i.e., if and only if\ntr[D(t)] > 0.\n\n(25)\n\nNote that one also immediately obtains the formula\n\u0012Z t\n\u0013\nV (t) = V0 exp\nds tr[D(s)]\n(26)\n0\n\nfor the Bloch volume.\nFor the case of qubits, condition (25) is clearly always stronger than the corresponding trace distance condition (18). As a direct consequence, or alternatively\nvia Eq. (19), the Bloch volume cannot witness the nonMarkovianity of the example in Eqs. (13) and (14).\nMore generally, as shown in Appendix B,\nX\ntr[D(t)] = −d\nγk (t).\n(27)\n\n√\nand (14), we may take |Ψi = (|+i ⊗ |+i + |−i ⊗ |−i)/ 2,\nwith |±i denoting the eigenstates of σ3 . Relative to the\nbasis {|+i ⊗ |+i, |+i ⊗ |−i, |−i ⊗ |+i, |−i ⊗ |−i}, the joint\nstate at time t is then easily found to be\n\n1 + e−2t\n0\n0\n1 + e−2t\n−2t\n1\n0\n1−e\n0\n0\n\nρsa (t) = \n.\n0\n0\n1 − e−2t\n0\n4\n−2t\n−2t\n1+e\n0\n0\n1+e\n\n\nThe corresponding concurrence, logarithmic negativity\nand quantum mutual information can all be evaluated\nanalytically, as\nC[ρsa (t)] = e−2t ,\n\nEN [ρsa (t)] = log2 (1 + e−2t ),\n\n(29)\n\nand\n1 − e−2t\n,\n2\n(30)\nrespectively, where H(p, 1 − p) denotes the entropy\n−p log2 p − (1 − p) log2 (1 − p). These quantities are manifestly monotonic decreasing with time. Hence, none\nof them provide a signature that witnesses the nonMarkovianity of the example in Eqs. (13) and (14).\n1 − e−2t 1 + e−2t\n,\nIQ [ρsa (t)] = 2 − H\n2\n2\n\u0012\n\n\u0013\n\n−\n\nk\n\nHence, condition (25) may equivalently be\nP written in\nterms of the canonical decoherence rates as k γk (t) < 0.\nThus, any measure of non-Markovianity based on the\nBloch volume is only sensitive to the sum of the canonical\ndecoherence rates, both positive and negative.\nC.\n\nEntanglement measures\n\nThe entanglement between two quantum systems cannot increase under local completely positive operations\n(and/or classical communication), and hence Rivas et al.\nhave proposed using the increase of any entanglement\nmeasure E, under local evolution, as a signature of nonMarkovianity [9]. This signature has been experimentally\ninvestigated for the case of concurrence [21]. The use of\nlogarithmic negativity [9, 11] and quantum mutual information [12] have also been proposed. Here we show\nthat none of these entanglement measures can witness\nthe non-Markovianity of the example in Eqs. (13) and\n(14).\nIn particular, writing the system master equation as\nρ̇s = Λt [ρs ], we follow Rivas et al. and consider the\nentanglement between the system and an ancilla under\nthe evolution\nρ̇sa = (Λt ⊗ 1)[ρsa ],\n\n(28)\n\nfor an initial maximally entangled state ρsa (0) =\n|ΨihΨ|[9]. For the qubit master equation in Eqs. (13)\n\nD.\n\nChoi-matrix measures\n\nAny linear map describing the evolution of the density\noperator of a finite d-dimensional quantum system has a\ncorresponding d2 ×d2 Choi matrix S, where the evolution\nis completely positive if and only if S ≥ 0 [44]. Since\nMarkovianity is equivalent to divisibility into a sequence\nof infinitesimal completely positive evolutions [16], this\nnaturally leads to measures of non-Markovianity based\non properties of the Choi matrix [7, 9]. We show here that\nthe proposed measures are simply related to the canonical\nmeasures of non-Markovianity defined in Sec. III B, and\nthat they are faithful witnesses, in the sense of always\ndetecting non-Markovianity when it exists.\nFirst, choosing an orthonormal basis {|αi} on the\nHilbert space, with α = 1, . . . , d, the action of any linear\nmap φ on the states of the system can be expanded as\nφ[ρ] =\n\nX\n\nα1 ,β1\n\n|α1 ihα1 |φ[ρ]|β1 ihβ1 |\n\nX\n\n=\n\nα1 ,β1 ,α2 ,β2\n\n=\n\nX\n\n|α1 i hα2 |ρ|β2 i hβ1 | hα1 |φ[|α2 ihβ2 |]|β1 i\n\nSab τa ρ τb† ,\n\n(31)\n\na,b\n\nwhere a and b denote the pairs (α1 , α2 ) and (β1 , β2 ), respectively, and\nSab := hα1 |φ[|α2 ihβ2 |]|β1 i, τa := |α1 ihα2 |.\n\n(32)\n\n\f8\nThe d2 × d2 matrix S is called the Choi matrix corresponding to φ [44, 45]. Note that the Choi matrix of the\nidentity map, 1, is\n1\nSab\n= va vb ,\n\nva := δα1 α2 .\n\n(33)\n\nIt is also straightforward to check that d−1 S is the matrix\nrepresentation of the operator (φ⊗1)[|ΨihΨ|] in the basis\n{|ai = |α1 i⊗|α\nP 2 i}, where |Ψi is the maximally entangled\nstate d−1/2 α |αi ⊗ |αi [45], i.e.,\nSab = d ha|(φ ⊗ 1)[|ΨihΨ|]|bi.\n\n(34)\n\nThus, S is Hermitian if φ maps Hermitian operators\nto Hermitian operators, and tr[S] = d if φ is tracepreserving [37].\nAs mentioned, φ is completely positive if and only if\nS ≥ 0 [44, 45]. Hence, the infinitesimal map φǫ = 1+ǫΛt ,\ngenerated by the master equation ρ̇ = Λt [ρ], is completely\npositive, corresponding to Markovian evolution at time\nt, if and only if\nS ǫ = S 1 + ǫR(t) ≥ 0.\n\n(35)\n\nHere R(t) denotes the Choi matrix of Λt , obtained by\nreplacing φ by Λt in Eq. (32) or (34).\n1.\n\nTrace-norm measure\n\nIt follows from Eq. (35) that (trace preserving) evolution is Markovian at time t if and only the eigenvalues\nof S ǫ = S 1 + ǫR(t) are positive and sum to d. Hence,\ndefining the trace-norm rate of change [9]\ng(t) := lim+\nǫ→0\n\nd−1 kS 1 + ǫR(t)k1 − 1\n,\nǫ\n\n(36)\n\none has g(t) ≥ 0, with g(t) = 0 if and only if the evolution\nat time t is Markovian. This led Rivas et al. to propose\nZ ∞\nds g(s)\n(37)\nI :=\n0\n\nas a formal measure of non-Markovianity [9].\nIt is shown in Appendix C that the trace-norm measure\ng(t) has a surprisingly simple interpretation. In particular, it is just the sum of the negative canonical decoherence rates, up to a multiplicative factor:\n−1\n\ng(t) = d\n\n2\ndX\n−1\n\nk=1\n\n[|γk (t)| − γk (t)] =\n\n2\nf (t),\nd\n\n(38)\n\nHere f (t) is the canonical measure defined in Eq. (7). It\nfollows immediately that\nI=\n\n2\nF (0, ∞),\nd\n\n(39)\n\nwhere F (t, t′ ) is the canonical measure of total nonMarkovianity defined in Eq. (9). It further follows that\n\ng(t) and I can always detect non-Markovian evolution\n[9], including the example in Sec. III D in particular.\nThe formal connection between the canonical and\ntrace-norm measures follows from a relationship between\nthe decoherence matrix and a projected form of the Choi\nmatrix (Appendix C). However, the canonical approach\nnot only provides a physical interpretation of I, but also\nhas the advantage of identifying all of the individual decoherence channels and corresponding decoherence rates\n– allowing, for example, the definition of the discrete nonMarkov index n(t) in Eq. (10).\n2.\n\nIsotropic noise measure\n\nWolf et al. considered the minimal amount of isotropic\nnoise that must be added to a given quantum channel,\nto allow its simulation by a memoryless master equation\n[7]. This may be adapted to obtain a natural measure\nof the non-Markovianity of a given evolution, at time t,\ncorresponding to the smallest amount of isotropic noise,\nǫν, that must be added to the infinitesimal evolution φǫ\nto make it completely positive. Here ν = ν(t) denotes\nthe rate at which the noise is added at time t. As for the\ntrace-norm measure above, ν(t) turns out to be a simple\nfunction of the canonical decoherence rates.\nIn particular, adding isotropic noise ǫν(t) is equivalent\nto mixing the state of the system with the maximallymixed state, i.e., to the infinitesimal mixing map\nμǫ [ρ] := (1 − ǫν)ρ + ǫν Tr[ρ] d−1 1̂ = ρ + ǫν(d−1 1̂ − ρ).\n\nThe corresponding Choi matrix N ǫ follows from Eqs. (32)\nand (33) as [7]\n\u0003\n\u0002\n(40)\nN ǫ = S 1 + ǫν(t) d−1 I − vv T ,\n\nwhere I denotes the d2 × d2 identity matrix.\nAs shown in Appendix C, the minimum rate of noise\nν(t) that must be added to the master equation to give\ncompletely positive evolution at time t has the explicit\nsimple form\nν(t) = d max{0, −γ1, −γ2 , . . . } = d max{fk (t)},\nk\n\nk\n\n(41)\n\nwhere fk (t) is the canonical decoherence measure for the\nkth decoherence channel, defined in Eq. (6). Thus, the\nminimum noise rate is determined by the value of the\nmost negative canonical decoherence rate. For the example in Eqs. (13) and (14), ν(t) = tanh t > 0 for all t > 0.\nMore generally, Eq. (41) implies that non-Markovianity\nis always detected by the isotropic noise measure. Note,\nhowever, it is not sensitive to all of the negative decoherence rates, in contrast to the canonical measures F (t, t′ )\nand n(t) and the trace-norm measure I.\nV.\n\nCONCLUSIONS\n\nThe canonical form for time-local master equations allows a complete characterization of the non-Markovianity\n\n\f9\nof open quantum systems, in terms of a set of uniquely\ndetermined canonical decoherence rates. These rates are\ninvariant under time-dependent unitary transformations\nof the system, and for a given master equation they may\nbe evaluated as the eigenvalues of the decoherence matrix d in Eq. (A7), the matrix R⊥ in Eq. (C1), or the\noperator R⊥ in Eq. (C8).\nA positive (negative) canonical decoherence rate corresponds to Markovian (non-Markovian) evolution in the\nrespective decoherence channel. This leads naturally to\nwell-defined canonical measures of the degree of nonMarkovianity of each channel, and to corresponding measures of the total non-Markovianity of the evolution, as\nper Eqs. (6)-(9). We have also defined a discrete nonMarkov index, in Eq. (10), which characterizes the dimension of the space of non-Markovian evolution.\nSignatures of non-Markovianity proposed in the literature can be assessed, both qualitatively and quantitatively, in terms of their relative sensitivities to the presence of negative canonical decoherence rates. For example, we have shown that signatures based on witnessing\nan increase in trace distance, Bures distance, Bloch volume, concurrence, logarithmic negativity and quantum\nmutual information are completely insensitive to the nonMarkovianity of a simple qubit evolution. It would be of\ninterest to determine whether there are any measures of\ndistance or entanglement, preferably physically measurable, from which this evolution cannot successfully hide.\nIn contrast, proposed measures based on properties\nof Choi matrices are always faithful witnesses of nonMarkovianity, and we have obtained simple formulas and\ncorresponding physical interpretations of these measures\nin terms of the canonical decoherence rates. Thus, the\ntrace-norm measure of Rivas et al. is proportional to the\nsum of the negative decoherence rates, integrated over\nthe time period of the evolution, while the isotropic noise\nmeasure of Wolf et al. is proportional to the most negative decoherence rate.\nWe have also found simple necessary and sufficient conditions for trace distance and Bloch volume to witness\nnon-Markovian qubit evolution, and that the former provides a strictly stronger signature. Further, for arbitrary\ndimensions, we have explicitly determined the Bloch volume as a function of the canonical decoherence rates.\nThe above results clearly demonstrate the value of the\ncanonical approach in providing a fundamental characterization of non-Markovianity. It would be of interest\nto extend this approach to infinite dimensional systems,\nif possible, and compare with approaches based on divisibility and quantum trajectories in this case. The main\ntechnical difficulty appears to be related to non-finite operator traces in this regard. Finally, it would also be of\ninterest to experimentally characterise the canonical decoherence rates, e.g., via process tomography.\n\nACKNOWLEDGMENTS\n\nWe thank H. Wiseman and A. Rivas for useful comments. M. H. and L. L. are supported by the ARC Centre\nof Excellence CE110001027. E. A. acknowledges financial support by the Royal Society of London, and J. C.\nby Heriot-Watt University.\nAppendix A: Derivation of the canonical form for\nmaster equations\n\nA general time-local master equation, such as in\nEq. (3), equates ρ̇ with a linear map Λt acting on ρ,\nand hence can always be written in the form [2]\nX\nρ̇ = Λt [ρ] =\nAk (t)ρBk† (t).\n(A1)\nk\n\nThe canonical form in Eq. (4) essentially then follows via\nthe requirements that ρ remain Hermitian for all time\nand that the trace of ρ be preserved.\nFirst, for a state space of dimension d, define N :=\nd2 and introduce a complete set of N basis operators\n{Gm ; m = 0, 1, 2, . . . N − 1}, with the properties\n\u000e√\nG0 = 1̂ d;\nGm = G†m ;\nTr[Gm Gn ] = δmn ,\n(A2)\nwhere 1̂ is the identity operator. Choosing n = 0 in the\nlast condition implies that Tr[Gm ] = 0 for m 6= 0.\nFor brevity, we will suppress the time dependence in\nquantities below, but everything except the basis operators Gm may be time dependent. We can expand\nX\nX\nGj bjk\nGi aik ,\nBk =\nAk =\nj\n\ni\n\nP\n∗\nso that Eq. (A1) becomes ρ̇ =\ni,j\nk aik bjk Gi ρGj .\nP\nDefining the quantities cij = k aik b∗jk then yields the\nunique decomposition [2]\nP\n\nρ̇ =\n\nN\n−1\nX\n\ncij Gi ρGj .\n\n(A3)\n\ni,j=0\n\nUsing the fact that ρ and hence ρ̇ are Hermitian, then\nX\nX\nX\nc∗ji Gi ρGj ,\nc∗ij Gj ρGi =\ncij Gi ρGj =\ni,j\n\ni,j\n\nc∗ji .\n\ni,j\n\nso that cij =\nThus the cij are the elements of an\nN × N Hermitian matrix.\nSeparating out the i = 0 and j = 0 terms, the above\ndecomposition for ρ̇ reduces to\n\n\n!\nN\n−1\nN\n−1\nX\nX\nc00\nci0\nc\n0j\n√ Gi ρ + ρ \n√ Gj \nρ̇ =\nρ+\nd\nd\nd\ni=1\nj=1\n+\n\nN\n−1\nX\n\ni,j=1\n\ndij Gi ρGj ,\n\n\f10\nwhere dij := cij for i, j > 0 are elements of an (N − 1) ×\n(N − 1) 'decoherence' Hermitian matrix d. Defining\n1 c00 X ci0\n√ Gi ,\n+\n(A4)\nC :=\n2 d\nd\ni\n\nand noting Hermiticity implies that c00 is real and c0j =\nc∗j0 , this reduces to\nN\n−1\nX\n\nρ̇ = Cρ + ρC † +\n\ndij Gi ρGj .\n\n(A5)\n\ni,j=1\n\nTaking the trace of Eq. (A5), and noting that trace\npreservation implies that Tr[ρ̇] = 0, yields\nC + C† = −\n\nN\n−1\nX\n\ndij Gj Gi .\n\ni,j=1\n\nHence, defining H := 12 i~(C − C † ), Eq. (A5) can be\nrewritten as\n1\u0002\nρ̇ = (C − C † )ρ + ρ(C † − C)\n2\n−1\n\u0003 NX\n†\n†\ndij Gi ρGj\n+(C + C )ρ + ρ(C + C) +\ni,j=1\n\nN\n−1\nX\n\n\u0012\n\n\u0013\n1\ni\ndij (t) Gi ρGj − {Gj Gi , ρ} .\n= − [H, ρ] +\n~\n2\ni,j=1\n(A6)\n\nThis is the kind of structure obtained in Theorem 2.2\nof [2], although because they are considering quantum\nsemigroups, their decoherence matrix d is independent\nof time, as is H. Note that one has the two explicit\nexpressions\ndij =\n\nX\n\nTr[Gi Ak ] Tr[Gj Bk† ]\n\n=\n\n2\ndX\n−1\n\nTr[Gm Gi Λt [Gm ]Gj ]\n\nm=0\n\nk\n\n(A7)\nfor the elements of the decoherence matrix, where the\nfirst follows directly from the above construction, and\nthe second via the proof of Lemma 2.2 of [2].\nWe now observe a crucial feature of this last result (see\nalso [16, 38]) that seems not to be widely appreciated, but\nwhich enables us to derive the main results of this paper.\nIn particular, we take advantage of the Hermitian nature\nof the decoherence matrix to write it in diagonal form,\nX\n∗\ndij =\nUik γk Ujk\n,\n(A8)\nk\n\nwhere the eigenvalues γk of d are real, but not necessarily positive at all times, and the Uik are unitary\n(N − 1) × (N − 1) matrices\nby the corresponding\nP formed\n∗\n= δij . Defining the\neigenvectors of d, with k Uik Ujk\ntime dependent operators\nLk (t) :=\n\nN\n−1\nX\ni=1\n\nUik (t)Gi ,\n\n(A9)\n\nand restoring explicit time-dependence, we finally obtain\nthe canonical form in Eqs. (4) and (5)of the text via\nEqs. (A2) and (A6). Noting that only the traceless part\nof H(t) can contribute to the commutator in Eq. (4), one\nmay further assume Tr[H(t)] = 0 without any loss of\ngenerality.\nThe decoherence rates γk (t) are always uniquely defined, as a consequence of the diagonal decomposition in\nEq. (A8). Similarly, the decoherence operators Lk (t) are\nunique up to unitary transformations that preserve any\ndegenerate subspaces of the decoherence matrix d. For\nthe case of a nondegenerate decoherence matrix, this implies uniqueness of Lk (t) up to multiplication by a trivial\nphase factor, and hence that the canonical form of the\nmaster equation in Eq. (4) is fully fixed in this case.\nIt is of interest to note that under any unitary transformation ρ → V (t)ρV (t)† , e.g. to an 'interaction' picture, the γk (t) are invariant (whereas both H(t) and the\nLk (t) will typically change), since any such transformation corresponds to an orthogonal transformation of the\ndecoherence matrix. This has the consequence that nonMarkovianity can be defined independently of the operator H.\nIt is also worth noting that is not in general possible\nto transform to a picture in which the Lk are time independent. This is because although a suitable (time dependent) orthogonal transformation of the Lk (t) always\nexists in the linear space of traceless operators, that preserves the relations in Eq. (5), such a transformation will\nnot always correspond to some unitary transformation on\na d × d density matrix (unless d = 2).\nAppendix B: Bloch volume and the decoherence\nmatrix\n\nIn Sec. IV B it was shown that the condition for the\nBloch volume to increase at time t is that the trace of the\ndamping matrix D(t) is positive. To show this is equivalent to the trace of the decoherence matrix d being negative, as per Eq. (27), define the generalised Bloch vector\nx by xm := Tr[ρGm ], m = 1, 2, . . . , d2 −1,\nP with Gm as per\nEq. (A2) [15, 23]. It follows from ρ = n≥0 Tr[ρGn ] Gn\nthat\nX\nẋm = Tr[Λt [ρ]Gm ] =\nTr[ρGn ] Tr[Λt [Gn ]Gm ].\nn≥0\n\nHence, the damping matrix coefficients follow as Dmn =\nTr[Λt [Gn ]Gm ] for m, n ≥ 1, and so, using the canonical\nform of the master equation,\ni\nDmm = − Tr[[H, Gm ]Gm ]\n~\nX\n+\nγk Tr[L†k Gm Lk Gm − L†k Lk (Gm )2 ].\nk\n\nThe first term P\ntrivially vanishes. Further, the completeness property m≥0 Gm XGm = Tr[X]1̂ [2] implies that\n\n\f11\n= Tr[X]1̂ − d−1 X, and hence, choosing\nX = Lk and X = 1̂ as appropriate, the trace of the\ndamping matrix evaluates to [37]\nX\nX\ntr[D] =\nDmm = −d\nγk Tr[L†k Lk ].\nP\n\nm≥1 Gm XGm\n\nm≥1\n\nk\n\nFinally, Tr[L†k Lk ] = 1 from Eq. (5), and the claimed\nequivalence between Eqs. (25) and (27) follows as desired.\nNote that the sum of the canonical decoherence rates\nin Eq. (27) only requires evaluation of the trace of the\ndecoherence matrix d in Eq. (A7). This implies that no\ndiagonalization of d (nor writing the master equation in\nBloch form) is needed to determine the Bloch volume\nV (t) in Eq. (26).\nAppendix C: Choi matrix and canonical decoherence\nrates\n\nThe Markovianity condition (35) can be rewritten, using Eq. (33), as S ǫ = vv T + ǫR ≥ 0. This clearly holds\n(for infinitesimal ǫ) if and only if wT R(t)w ≥ 0 for all w\northogonal to v, i.e., if and only if\nR⊥ := (I − P )R(I − P ) ≥ 0,\n\n(C1)\n\nwhere P = d−1 vv T denotes the projection on to the direction of v. Further, recalling tr[S ǫ ] = d [37], it also\nfollows from Eq. (35) that\n0 = tr[R] = tr[P RP ] + tr[(I − P )R(I − P )]\n= d−1 v T Rv + tr[R⊥ ].\n(C2)\nNow, the eigenvalues of vv T are trivially d, 0, 0, . . . .\nChoosing the corresponding eigenvectors as d−1/2 v, w1 ,\nw2 , . . . , where wk = (1 − P )wk is the kth eigenvector of\nR⊥ , the eigenvalues of S ǫ = vv T + ǫR follow from standard perturbation theory as d + ǫd−1 v T Rv = d − ǫtr[R⊥ ]\nand\nǫwkT Rwk = ǫwkT (1 − P )R(1 − P )wk = ǫwkT R⊥ wk = ǫ rk ,\nto first order in ǫ, where r1 , r2 , . . . , rd2 −1 denote the\neigenvalues of R⊥ . It follows immediately that the quantity g(t) defined in Eq. (36) can be written as\n\"\n#\nX\nX\n|rk | = d−1\n[|rk | − rk ] .\ng(t) = d−1 −tr[R⊥ ] +\nk\n\nk\n\n(C3)\nWe now show that rk = γk . Expanding R = [(P + (I −\nP )]R[(P + (I − P )] and using Eq. (C2) gives\nR = αvv T + vw† + wv T + R⊥ ,\n\nwhere w is orthogonal to v and α = −d−1 tr[R⊥ ]. Recalling R is defined to be the Choi matrix of Λt , it immediately follows from Eq. (31) that the master equation can\n\nbe written as\nρ̇ = Λt [ρ] =\n\nX\n\nRa,b (t) τa ρ τb†\n\na,b\n\nX\n1\n1\n= ρ( α + W † ) + ( α + W )ρ +\nrk Wk ρWk† ,\n2\n2\nk\n\nP\n\nP\n\nin terms of W := a wa τa , Wk := a wk,a τa and the\nP\neigenvalue decomposition R⊥ = k rk wk wk† , where we\nP\nhave used Eq. (33) to write a va τa = 1̂. Decomposing 21 α + W = J − i~K into Hermitian and antiHermitian parts, and applying the trace-preserving condition\nP\nTr[Λt [ρ]] = Tr[ρ], yields 2J = − k rk Wk† Wk . Thus,\nrestoring explicit time dependence,\n2\n\ndX\n−1\nh\ni\nρ̇ = − [K(t), ρ] +\nrk (t) Wk (t)ρWk† (t)\n~\nk=1\no\u0015\n1n †\nWk (t)Wk (t), ρ .(C4)\n−\n2\n\nNote also, using v * wk = 0 and wk * wl = δkl , that\nTr[Wk (t)] = 0,\n\nTr[Wj† (t) Wk (t)] = δjk .\n\n(C5)\n\nComparison with Eqs. (4) and (5) shows that Eq. (C4)\nis in canonical form. Hence, since the canonical decoherence rates are uniquely determined by the canonical form\n(Appendix A), we have\nγk (t) = rk (t)\n\n(C6)\n\nfor some suitable ordering of the eigenvalues of R⊥ .\nNote that while R⊥ has the same eigenvalues as the\ndecoherence matrix d in Eq. (A7), allowing the canonical decoherence rates to be calculated in two different\nways, these matrices are not equal, but are related by a\n(nontrivial) unitary transformation. However, the corresponding defining conditions for Markovianity, d ≥ 0 and\nR⊥ ≥ 0, are of course equivalent, and thus the above result explicitly demonstrates the equivalence of Markovian\nevolution with completely positive infinitesimal maps.\nThe formulas in Eqs. (38) and (39) of the main text, for\nthe trace-norm measures g(t) and I proposed by Rivas\net al. [9], follow immediately from Eqs. (C3) and (C6).\nMoreover, from Eqs. (35) and (40), the infinitesimal\nevolution generated by the addition of isotropic noise at\nrate ν(t) to Λt has the corresponding Choi matrix\n\u0002\n\u0003\nT ǫ = S 1 + ǫ R + ν(d−1 I − vv T ) .\nSimilarly as for Eq. (C1), this corresponds to completely\npositive evolution if and only if\n\u0002\n\u0003\n0 ≤ (I − P ) R + ν(d−1 I − vv T ) (I − P )\n= R⊥ + νd−1 (I − P )\nX\n=\n[rk + d−1 ν]wk wkT .\nk\n\n\f12\nSince ν(t) ≥ 0 is, by definition, the smallest noise rate for\nwhich the evolution is completely positive (Sec. IV D.2),\none immediately has\nν(t) = d max{0, −r1 , −r2 , . . . },\nk\n\n(C7)\n\nand Eq. (41) follows via Eq. (C6).\nFinally, we remark that the projected Choi matrix\n\n[1] G. Lindblad, Comm. Math. Phys. 48, 119 (1976).\n[2] V. Gorini, A. Kossakowski and E. C. G. Sudarshan, J.\nMath. Phys. 17, 821 (1976).\n[3] H.-P. Breuer and F. Petruccione, The theory of open\nquantum systems (Oxford University Press, Oxford,\n2002).\n[4] H. M. Wiseman and G. J. Milburn Quantum measurement and control (Cambridge University Press, Cambridge, 2010).\n[5] S. M. Barnett and J. D. Cresser, Phys. Rev. A 72, 022107\n(2005).\n[6] R. Alicki, D. A. Lidar and P. Zanardi, Phys. Rev. A 73,\n052311 (2006).\n[7] M. M. Wolf, J. Eisert, T. S. Cubitt and J. I. Cirac, Phys.\nRev. Lett. 101, 150402 (2008).\n[8] H.-P. Breuer, E. M. Laine and J. Piilo, Phys. Rev. Lett.\n103, 210401 (2009).\n[9] Á Rivas, S. F. Huelga and M. B. Plenio, Phys. Rev. Lett.\n105, 050403 (2010).\n[10] X.-M. Lu, W. Wang and C. P. Sun, Phys. Rev. A 82,\n042103 (2010).\n[11] S. Lorenzo, F. Plastina and M. Paternostro, Phys. Rev.\nA 84 032124 (2011).\n[12] S. Luo, S. Fu and H. Song, Phys. Rev. A 86, 044101\n(2012).\n[13] W. Zhong, Z. Sun, J. Ma, X. Wang, and F. Nori, Phys.\nRev. A 87, 022337 (2013).\n[14] J. Liu, X.-M. Lu, and X. Wang Phys. Rev. A 87, 042103\n(2013).\n[15] S. Lorenzo, F. Plastina and M. Paternostro, Phys. Rev.\nA 88, 020102(R) (2013).\n[16] M. M. Wolf and J. I. Cirac, Commun. Math. Phys. 279,\n147 (2008).\n[17] C. W. Gardiner, Quantum noise (Springer-Verlag, Berlin,\n1991), Sec. 5.2.2.\n[18] H.-P. Breuer, Phys. Rev. A 70, 012106 (2004).\n[19] J. Piilo, S. Maniscalco, K. Härkönen, and K.-A. Suominen, Phys. Rev. Lett. 100, 180402 (2008).\n[20] J. Piilo, K. Härkönen, S. Maniscalco, and K.-A. Suominen, Phys. Rev. Lett. 79, 062112 (2009).\n[21] B.-H. Liu, L. Li, Y.-F. Huang, C. F. Li, G. C. Guo, E.M. Laine, H.-P. Breuer and J. Piilo, Nature Phys 7, 931\n(2011).\n\n⊥\nR⊥ in Eq. (C1) can alternatively be written as Rab\n=\n⊥\nha|R |bi, analogously to Eq. (34), with\n\n\u0001\n\u0001\nR⊥ := d 1̂ − |ΨihΨ| (Λt ⊗ 1)[|ΨihΨ|] 1̂ − |ΨihΨ| .\n(C8)\nThus the canonical decoherence rates can also be calculated as the eigenvalues of this operator, for any maximally entangled state |Ψi.\n\n[22] J. S. Tang, C. F. Li, Y. L. Li, X. B. Zou, G. C. Guo,\nH.-P. Breuer, E.-M. Laine and J. Piilo, Europhys. Lett.\n97, 10002 (2012).\n[23] A. J. van Wonderen and K. Lendi, J. Stat. Phys. 100,\n633 (2000).\n[24] D. Maldonado-Mundo, P. Öhberg, B. W. Lovett and E.\nAndersson, Phys. Rev. A 86, 042107 (2012).\n[25] S. Nakajima, Prog. Theor. Phys. 20, 948 (1958).\n[26] R. Zwanzig, J. Chem. Phys. 33, 1338 (1960).\n[27] S. Chaturvedi and J. Shibata, Z. Physik B 35, 297 (1979).\n[28] N. H. F. Shibata and Y. Takahashi, J. Stat. Phys. 17,\n171 (1977).\n[29] H. J. Carmichael, An open systems approach to quantum\noptics, (Springer-Verlag, Berlin, 1993).\n[30] M. B. Plenio and P. L. Knight, Rev. Mod. Phys. 70, 101\n(1998).\n[31] H.-P. Breuer, B. Kappler and F. Petruccione, Phys. Rev.\nA 59, 1633 (1999).\n[32] E. Andersson, J.D. Cresser and M. J. W. Hall, J. Mod\nOpt. 54, 1695 (2007).\n[33] L. Diosi, N. Gisin, and W. T. Strunz, Phys. Rev. A 58,\n1699 (1998).\n[34] J. D. Cresser, Laser Phys. 10, 337 (2000).\n[35] D. Chruściński and A. Kossakowski, Phys. Rev. Lett.\n104, 070406 (2010).\n[36] J. D. Cresser and C. Facer, Opt. Comm. 283, 773 (2010).\n[37] We follow the practice of using Tr[ ] and tr[ ] to denote\nthe operator trace and the matrix trace, respectively.\n[38] E. Andersson, J. D. Cresser and M. J. W. Hall, eprint\narXiv:1009.0845v1 [quant-ph].\n[39] S. Maniscalco, F. Intravaia, J. Piilo and A. Messina, J.\nOpt. B: Quantum and Semiclass. Opt. 6, S98 (2004).\n[40] M. J. W. Hall, J. Phys. A 41, 205302 (2008).\n[41] D. Chruściński and F. A. Wudarski, Phys. Lett. A 377,\n1425 (2013).\n[42] D. Petz, J. Phys. A: Math. Gen. 35, 929 (2002).\n[43] M. Hübner, Phys. Lett. A 163, 239 (1992).\n[44] M.-D. Choi, Lin. Alg. Appl. 10, 285 (1975).\n[45] I. Bengtsson and K. Zyczkowski, Geometry of Quantum States: An Introduction to Quantum Entanglement\n(Cambridge University Press, Cambridge, U.K., 2006),\nSec. 10.3.\n\n\f"}