{"id": "http://arxiv.org/abs/1001.4549v2", "guidislink": true, "updated": "2010-02-10T16:25:34Z", "updated_parsed": [2010, 2, 10, 16, 25, 34, 2, 41, 0], "published": "2010-01-25T21:40:13Z", "published_parsed": [2010, 1, 25, 21, 40, 13, 0, 25, 0], "title": "The Effect of Projection on Derived Mass-Size and Linewidth-Size\n  Relationships", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1001.2774%2C1001.1826%2C1001.0353%2C1001.2103%2C1001.2905%2C1001.0918%2C1001.1831%2C1001.0068%2C1001.0441%2C1001.1319%2C1001.0628%2C1001.2554%2C1001.4815%2C1001.4909%2C1001.2081%2C1001.3347%2C1001.3863%2C1001.3068%2C1001.4549%2C1001.4427%2C1001.1343%2C1001.2000%2C1001.4436%2C1001.0937%2C1001.2806%2C1001.2722%2C1001.3681%2C1001.0278%2C1001.2864%2C1001.5126%2C1001.2804%2C1001.1477%2C1001.2066%2C1001.2234%2C1001.2134%2C1001.2395%2C1001.2073%2C1001.0988%2C1001.0892%2C1001.1345%2C1001.1251%2C1001.0296%2C1001.4008%2C1001.5304%2C1001.0600%2C1001.3554%2C1001.0079%2C1001.0498%2C1001.2297%2C1001.5183%2C1001.2654%2C1001.1872%2C1001.0007%2C1001.3922%2C1001.1209%2C1001.0227%2C1001.2703%2C1001.1437%2C1001.3111%2C1001.0125%2C1001.2859%2C1001.3537%2C1001.5041%2C1001.2339%2C1001.3671%2C1001.0626%2C1001.1937%2C1001.0010%2C1001.4257%2C1001.1433%2C1001.1800%2C1001.2434%2C1001.3972%2C1001.0879%2C1001.1087%2C1001.0582%2C1001.2519%2C1001.1645%2C1001.2825%2C1001.4475%2C1001.5158%2C1001.2193%2C1001.2819%2C1001.4199%2C1001.2430%2C1001.0587%2C1001.2375%2C1001.1802%2C1001.1780%2C1001.0851%2C1001.5016%2C1001.3456%2C1001.2755%2C1001.0714%2C1001.0801%2C1001.2940%2C1001.0907%2C1001.0286%2C1001.3360%2C1001.5430%2C1001.0773&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "The Effect of Projection on Derived Mass-Size and Linewidth-Size\n  Relationships"}, "summary": "Power law mass-size and linewidth-size correlations, two of \"Larson's laws,\"\nare often studied to assess the dynamical state of clumps within molecular\nclouds. Using the result of a hydrodynamic simulation of a molecular cloud, we\ninvestigate how geometric projection may affect the derived Larson\nrelationships. We find that large scale structures in the column density map\nhave similar masses and sizes to those in the 3D simulation (PPP). Smaller\nscale clumps in the column density map are measured to be more massive than the\nPPP clumps, due to the projection of all emitting gas along lines of sight.\nFurther, due to projection effects, structures in a synthetic spectral\nobservation (PPV) may not necessarily correlate with physical structures in the\nsimulation. In considering the turbulent velocities only, the linewidth-size\nrelationship in the PPV cube is appreciably different from that measured from\nthe simulation. Including thermal pressure in the simulated linewidths imposes\na minimum linewidth, which results in a better agreement in the slopes of the\nlinewidth-size relationships, though there are still discrepancies in the\noffsets, as well as considerable scatter. Employing commonly used assumptions\nin a virial analysis, we find similarities in the computed virial parameters of\nthe structures in the PPV and PPP cubes. However, due to the discrepancies in\nthe linewidth- and mass- size relationships in the PPP and PPV cubes, we\ncaution that applying a virial analysis to observed clouds may be misleading\ndue to geometric projection effects. We speculate that consideration of\nphysical processes beyond kinetic and gravitational pressure would be required\nfor accurately assessing whether complex clouds, such as those with highly\nfilamentary structure, are bound.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1001.2774%2C1001.1826%2C1001.0353%2C1001.2103%2C1001.2905%2C1001.0918%2C1001.1831%2C1001.0068%2C1001.0441%2C1001.1319%2C1001.0628%2C1001.2554%2C1001.4815%2C1001.4909%2C1001.2081%2C1001.3347%2C1001.3863%2C1001.3068%2C1001.4549%2C1001.4427%2C1001.1343%2C1001.2000%2C1001.4436%2C1001.0937%2C1001.2806%2C1001.2722%2C1001.3681%2C1001.0278%2C1001.2864%2C1001.5126%2C1001.2804%2C1001.1477%2C1001.2066%2C1001.2234%2C1001.2134%2C1001.2395%2C1001.2073%2C1001.0988%2C1001.0892%2C1001.1345%2C1001.1251%2C1001.0296%2C1001.4008%2C1001.5304%2C1001.0600%2C1001.3554%2C1001.0079%2C1001.0498%2C1001.2297%2C1001.5183%2C1001.2654%2C1001.1872%2C1001.0007%2C1001.3922%2C1001.1209%2C1001.0227%2C1001.2703%2C1001.1437%2C1001.3111%2C1001.0125%2C1001.2859%2C1001.3537%2C1001.5041%2C1001.2339%2C1001.3671%2C1001.0626%2C1001.1937%2C1001.0010%2C1001.4257%2C1001.1433%2C1001.1800%2C1001.2434%2C1001.3972%2C1001.0879%2C1001.1087%2C1001.0582%2C1001.2519%2C1001.1645%2C1001.2825%2C1001.4475%2C1001.5158%2C1001.2193%2C1001.2819%2C1001.4199%2C1001.2430%2C1001.0587%2C1001.2375%2C1001.1802%2C1001.1780%2C1001.0851%2C1001.5016%2C1001.3456%2C1001.2755%2C1001.0714%2C1001.0801%2C1001.2940%2C1001.0907%2C1001.0286%2C1001.3360%2C1001.5430%2C1001.0773&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Power law mass-size and linewidth-size correlations, two of \"Larson's laws,\"\nare often studied to assess the dynamical state of clumps within molecular\nclouds. Using the result of a hydrodynamic simulation of a molecular cloud, we\ninvestigate how geometric projection may affect the derived Larson\nrelationships. We find that large scale structures in the column density map\nhave similar masses and sizes to those in the 3D simulation (PPP). Smaller\nscale clumps in the column density map are measured to be more massive than the\nPPP clumps, due to the projection of all emitting gas along lines of sight.\nFurther, due to projection effects, structures in a synthetic spectral\nobservation (PPV) may not necessarily correlate with physical structures in the\nsimulation. In considering the turbulent velocities only, the linewidth-size\nrelationship in the PPV cube is appreciably different from that measured from\nthe simulation. Including thermal pressure in the simulated linewidths imposes\na minimum linewidth, which results in a better agreement in the slopes of the\nlinewidth-size relationships, though there are still discrepancies in the\noffsets, as well as considerable scatter. Employing commonly used assumptions\nin a virial analysis, we find similarities in the computed virial parameters of\nthe structures in the PPV and PPP cubes. However, due to the discrepancies in\nthe linewidth- and mass- size relationships in the PPP and PPV cubes, we\ncaution that applying a virial analysis to observed clouds may be misleading\ndue to geometric projection effects. We speculate that consideration of\nphysical processes beyond kinetic and gravitational pressure would be required\nfor accurately assessing whether complex clouds, such as those with highly\nfilamentary structure, are bound."}, "authors": ["Rahul Shetty", "David C. Collins", "Jens Kauffmann", "Alyssa A. Goodman", "Erik W. Rosolowsky", "Michael L. Norman"], "author_detail": {"name": "Michael L. Norman"}, "author": "Michael L. Norman", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1088/0004-637X/712/2/1049", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1001.4549v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1001.4549v2", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "25 pages, including 7 Figures; Accepted for publication in ApJ", "arxiv_primary_category": {"term": "astro-ph.GA", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "astro-ph.GA", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1001.4549v2", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1001.4549v2", "journal_reference": null, "doi": "10.1088/0004-637X/712/2/1049", "fulltext": "arXiv:1001.4549v2 [astro-ph.GA] 10 Feb 2010\n\nThe Effect of Projection on Derived Mass-Size and Linewidth-Size\nRelationships\nRahul Shetty1,2,5 , David C. Collins3 , Jens Kauffmann1,2,6 , Alyssa A. Goodman1,2 , Erik W.\nRosolowsky4 , Michael L. Norman3\nABSTRACT\nPower law mass-size and linewidth-size correlations, two of \"Larson's laws,\"\nare often studied to assess the dynamical state of clumps within molecular clouds.\nUsing the result of a hydrodynamic simulation of a molecular cloud, we investigate how geometric projection may affect the derived Larson relationships. We\nfind that large scale structures in the column density map have similar masses\nand sizes to those in the 3D simulation (PPP). Smaller scale clumps in the column density map are measured to be more massive than the PPP clumps, due to\nthe projection of all emitting gas along lines of sight. Further, due to projection\neffects, structures in a synthetic spectral observation (PPV) may not necessarily\ncorrelate with physical structures in the simulation. In considering the turbulent\nvelocities only, the linewidth-size relationship in the PPV cube is appreciably\ndifferent from that measured from the simulation. Including thermal pressure in\nthe simulated linewidths imposes a minimum linewidth, which results in a better agreement in the slopes of the linewidth-size relationships, though there are\nstill discrepancies in the offsets, as well as considerable scatter. Employing commonly used assumptions in a virial analysis, we find similarities in the computed\nvirial parameters of the structures in the PPV and PPP cubes. However, due\nto the discrepancies in the linewidth- and mass- size relationships in the PPP\nand PPV cubes, we caution that applying a virial analysis to observed clouds\n1\n\nHarvard-Smithsonian Center for Astrophysics, 60 Garden Street, Cambridge, MA 02138\n\n2\n\nInitiative for Innovative Computing, Harvard University, 60 Oxford Street, Cambridge, MA, 02138\n\n3\n\nLaboratory for Computational Astrophysics, Center for Astrophysics and Space Sciences, University of\nCalifornia San Diego, LaJolla, CA 92093\n4\n\nUniversity of British Columbia Okanagan, 3333 University Way, Kelowna, BC V1V 1V7, Canada\n\n5\n\nCurrent Address: Zentrum für Astronomie der Universität Heidelberg, Institut für Theoretische Astrophysik, Albert-Ueberle-Str. 2, 69120 Heidelberg, Germany; rshetty@ita.uni-heidelberg.de\n6\n\nCurrent Address: NASA JPL, 4800 Oak Grove Drive, Pasadena, CA 91109\n\n\f–2–\nmay be misleading due to geometric projection effects. We speculate that consideration of physical processes beyond kinetic and gravitational pressure would\nbe required for accurately assessing whether complex clouds, such as those with\nhighly filamentary structure, are bound.\nSubject headings: ISM:clouds – ISM: structure – methods: analytical – stars:formation\n\n1.\n\nIntroduction\n\nThough stars form in the densest cores within much more voluminous molecular clouds,\nthe motions and forces within the parent cloud at various scales significantly shape, if not\ncontrol, the evolution of the cores as they form stars. Observations, in particular of dust\nemission and extinction and of a variety of molecular lines, have provided much information\nabout the internal structure and dynamics of molecular clouds. However, determining the\n3-dimensional (3D) structure of the cloud from observations is not trivial, due in large part\nto line-of-sight projection effects.\nThe scaling between the mass M and velocity dispersion σ with size scale is often studied,\nin both numerical models and observations of star forming regions (e.g. Ostriker et al. 2001;\nMyers & Goodman 1988; Ballesteros-Paredes & Mac Low 2002; Dib et al. 2007; Falgarone et al.\n1992; Heyer et al. 2009; Solomon et al. 1987, Kauffmann et al. 2010a,b in preparation). A\nradius R is often considered as a proxy for the size of the region under inspection, to construct\npower-laws M ∝ Ra and σ ∝ Rb . Larson (1981) found a ∼ 2 and b ∼ 0.5, now generally\nknown as (the first and third) \"Larson's Laws.\" Larson's second law, relating σ with the\nratio of M/R, is a consequence of the other two, and is often used to study the dynamic\nnature of the cloud, through the virial parameter α = 5σ 2 R/(MG). The value of α may be\nindicative of whether structures or other such contiguous regions within clouds are bound,\ndue either to its own self-gravity or by the ambient external pressure (Bertoldi & McKee\n1992; McKee & Zweibel 1992). However, assumptions about the virial theorem that are\ncommonly employed to derive α, e.g. that the surface terms are negligible compared to the\nvolume terms, may in fact be erroneous, as discussed by Ballesteros-Paredes (2006) and\nDib et al. (2007).\nIn order to properly interpret the Larson scaling relations, a thorough understanding of\nthe effects of projection would be necessary. Contiguous structures in an observed positionposition-velocity (PPV) cube may not be representative of actual 3D structures in positionposition-position (PPP) space of the simulation(Adler & Roberts 1992; Ostriker et al. 2001).\nIn fact, Pichardo et al. (2000) showed that the structure of a PPV cube is more tightly cor-\n\n\f–3–\nrelated with the line-of-sight velocity structure than the 3D density distribution. Similarly,\nidentified structures in a 2D (integrated emission and/or extinction) map, such as high density knots or filaments, may also be a superposition of numerous lower density peaks along\nthe line of sight (e.g. Ostriker et al. 2001; Gammie et al. 2003). These projection effects\nmay indeed provide power law scalings that differ from the actual scalings (as discussed by\nBallesteros-Paredes et al. 1999; Ballesteros-Paredes & Mac Low 2002).\nHere, we assess the effect of projection from an analysis of a 3D numerical simulation of\na molecular cloud. We compare the derived M-R and σ - R relationships from 2D projected\ndensity and 3D spectral (PPV) data with those obtained from the full 3D simulation (PPP)\ndensity and velocity data. To derive M, R, and σ, we employ dendrograms, a recently\ndeveloped technique which identifies contiguous structures within various chosen (intensity\nor density) thresholds, and in the process characterizes the hierarchical nature of the data\n(Rosolowsky et al. 2008). We then use the measured sizes, masses, and linewidths in a virial\nanalysis, to extend our PPP and PPV comparison. In the next section, we briefly describe\nthe simulation dataset and our method of analysis. In Section 3, we present the Larson\nrelationships obtained from the full 3D simulation data and idealized observations of those\nsimulations, and compare the results. We discuss the implications of the results in Section\n4, focusing on the interpretations of observations. We summarize our findings in Section 5.\n\n2.\n\nMethod\n\nIn our investigation of the effect of projection on the derived mass- size and linewidthsize relationships, we use the result of a 3D hydrodynamic simulation at a single timestep.\nThe simulation used for this study was run with the MHD extension of the Adaptive Mesh\nRefinement (AMR) code ENZO described by Collins et al. (2010). In the MHD simulation\nof the molecular cloud, isothermal gas collapses into filaments and eventually forms dense\ncores in a 1000 pc3 region, with periodic boundary conditions. The gas initially has uniform\ndensity ρ = 200 cm−3 and magnetic field B = 0.6 μG, with isothermal temperature 10 K. The\nvirial parameter for this box is 0.9, giving a slightly unstable initial cloud. At each timestep,\nthe gas is driven with a random Gaussian velocity field. The driving field has power in a\ntop-hat distribution between wavenumbers k = 1, 2, and is normalized to keep the energy\ninput constant, as described in Mac Low (1999). This results in a constant RMS mach\nnumber of 9. This driving was maintained for several dynamical times to obtain statistical\nindependence from the initial conditions, after which self-gravity was switched on. The data\nanalyzed in this study was taken after 0.5 free fall times.\nThe root grid has a resolution of 1283 zones. Due to the AMR feature of the ENZO\n\n\f–4–\ncode, the resolution increases with increasing density, such that the Jeans length of the gas\nis always resolved by 4 zones, satisfying the Truelove criterion (Truelove et al. 1997). A total\nof 4 levels of refinement are added this way. Self-gravity is included, by solving the Poisson\nequation in the root grid using Fast Fourier Transforms, and in the subgrid patches using a\nmultigrid technique. Normalizing the simulation to a 10 pc side length, this gives a fine grid\nresolution of ≈1000 AU. A projection of the density can be seen in Figure 1, which shows the\nfilamentary nature of the gas. Details of this simulation will be discussed in a forthcoming\npaper.\nA common method to locate clumps involves the identification of contiguous structures\nin datacubes above a chosen threshold. In algorithms such as CLUMPFIND (Williams et al.\n1994), or similar variants (see e.g. Dib et al. 2007), structures are labeled as clumps if they\nare distinct from the background or from nearby, isolated structures. Some investigators fit\nGaussian profiles to describe the shape of the structures (GAUSSCLUMP, Stutzki & Guesten\n1990). Since molecular clouds are known to be hierarchical, evidenced by observations of\ndense knots situated in filamentary structures within GMCs, such a method may be inadequate (Pineda et al. 2009). We thus employ \"dendrograms,\" a technique which characterizes\nthe hierarchical nature of the matter distribution, while simultaneously identifying contiguous structures within chosen (intensity or density) thresholds1 (Rosolowsky et al. 2008).\nThe simulation data provides ρ and the velocity components vx , vy , and vz at every\nposition at a chosen time. The ρ-cube itself contains all the information necessary to obtain\nthe mass and size distribution of the clumps in the simulation. The mass of a clump is simply\nthe density integrated over all zones within a dendrogram-identified region, or isosurface,\nin the ρ-cube, multiplied by the volume of each zone. We regrid the result of the AMR\nsimulation into a uniform grid with 2563 zones, each with length ∆x, so that the volume of a\nzone is (∆x)3 . To characterize the size of each clump, we define a radius R3D as that which\nidentifies a sphere with the same volume as that bound by the isosurface, so R3D ∝ N 1/3 ,\nwhere N is the number of zones within the dendrogram defined isosurface. We can then\nassess whether any clear mass-size relationship exists in the 3D simulation data.\nTo obtain the linewidth-size relationship of the simulation, we use the velocity information to measure the velocity dispersion of a clump. For any observation, denser gas contribute\nmore to the observed linewidths than diffuse gas. Thus, for more direct comparison with observations, we consider the density weighted velocity dispersion. From the isosurface defined\nin the ρ-cube, the corresponding velocity components vx , vy , and vz , as well as the density\n1\n\nWe we will refer to any of the structures identified by dendrograms generally as \"clumps\" regardless of\nwhether they are self-gravitating (or bound) or not.\n\n\f–5–\nρ, define the 1D density-weighted velocity dispersion σ1D of that particular clump:\nP\n1 ρ[(vx − v ̄x )2 + (vy − v ̄y )2 + (vz − v ̄z )2 ]\n2\nP\n,\nσ1D =\n3\nρ\n\n(1)\n\nwhere the summation is taken over all N zones constituting the identified clump. Since\nEquation 1 does not include the thermal velocity, it is only representative of the non-thermal,\nor turbulent, velocities. An observed linewidth σtot would include a contribution from the\nsound speed cs in addition to σ1D , so\n2\n2\nσtot\n= σ1D\n+ c2s .\n\n(2)\n\nIn our investigation of the linewidth-size relationship, we consider both the turbulent linewidth\nσ1D as well as the total linewidth σtot .\nIn order to investigate the effect of projection, we generate a PPV cube and a column\ndensity map (shown in Figure 1) of the simulation cube. We then produce dendrogram\ntrees of these synthetic observations, and compare the resulting mass-size and linewidthsize relationships with those obtained from the full 3D simulation data. We only consider optically thin emission, so our analysis is analogous to observational investigations\ninvolving much of the volume of the molecular cloud, including regions containing dense\ncores (Myers & Goodman 1988; Falgarone et al. 1992; Heyer et al. 2009; Solomon et al. 1987;\nLarson 1981). This study is thus a first step towards a complete understanding of the unavoidable consequences of projection in observations. Results based on this assumption\nmay not be directly applicable to molecular line observations tracing high densities, such as\nammonia observations of dense star forming cores. A thorough investigation of the effect\nof projection for those high density tracers would require the additional consideration of\nradiative transfer effects.\nTo produce a 2D column density map, we integrate the density along a given direction\n(e.g. ẑ). Since we are assuming purely optically thin emission, the final 2D map is simply\nthe zeroth-moment of the ρ-cube. We then construct the dendrogram tree of this 2D map,\nobtaining the masses and sizes of each 2D-clump. In this case, we define the radius R2D =\n(N /π)1/2 ∆x, which is the radius of a circle with an area identical to the area within the 2D\nisosurface.\nFrom the simulation data, a 3D PPV cube is constructed by binning a chosen velocity\ncomponent (e.g. vz ), and integrating the mass (e.g. along ẑ at each x̂, ŷ position) associated with each velocity bin. We consider an idealized PPV cube, with high spatial and\nspectral resolution of 0.039 pc and 0.025 km s−1 , respectively; at these resolutions, both\nthe density and velocity structures can be assessed to scales smaller than the typical size of\n\n\f–6–\nthe dense cores within filaments. Clump masses are obtained by integrating the intensity\nwithin each dendrogram isosurface of the PPV cubes. The velocity dispersion is obtained\nby computing the second moment of each clump in velocity; we will refer to this moment\nas σz , since we construct the PPV cube along the ẑ direction. We only consider clouds to\nby sufficiently resolved if σz ≥ 0.025 km s−1 , which is the spectral resolution of the PPV\ncube (Rosolowsky & Blitz 2005). For the clumps in the PPV cube, the observed velocity\n2\ndispersion σtot\n= σz2 + c2s . As with the 2D map, we use the projected area associated with\neach clump to define R2D as the size of the clump.\na\nFrom the full simulation dataset, we derive the mass-size M ∝ R3D\nand linewidth-size\nb\nb\nσ1D ∝ R3D and σtot ∝ R3D power law relationships of the simulated cloud. We then compare\na\nb\nb\nthose with the M ∝ R2D\n, σz ∝ R2D\n, and σtot ∝ R2D\nrelationships obtained from analyses of\nthe column density map and PPV cube.\n\n3.\n3.1.\n\nResults\n\nMass-Size Relationships\n\nFigure 2 shows mass-size relationships of the dendrogram identified clumps, from the\nfull 3D simulation data, the column density map, and the PPV cube. In all cases, there is\na strong correlation between the M and R, suggestive of a power law relationship M ∝ Ra .\nBest fit lines give a ≈ 2 and a ≈ 3 for the 2D and 3D cases, respectively, and a ≈ 2.6 for\nthe PPV cube. The best fit indices, along with the errors, are listed in Table 1; the table\nalso indicates best fit exponents and the errors for the linewidth-size relationships discussed\nbelow.2 The best fit mass-size indices from the column density map and the PPV cube are\nsimilar to those derived from many observations of molecular clouds (e.g. Kauffmann et al.\n2010b, in preparation, Larson 1981).\nPower law fits from observations have provided an estimate a ≈ 2 (Larson 1981;\nSolomon et al. 1987), known as \"Larson's 3rd Law.\" Indices of a = 2 and a = 3 indicate that structures have constant column densities and constant volume densities in 2D\nand 3D, respectively. A further consequence is that the surface density is constant for all\nclouds.\n2\n\nThe computed (\"standard\") errors in the linear fits are small due to the very large number of datapoints.\nThus, the fits provide estimates for the mean value of M or σ with high accuracy. However, a prediction of\nM or σ using an individual datapoint would have a significant error, due to the large scatter in Figures 2 4.\n\n\f–7–\nThe best fit relationships shown in Figure 2 suggest that the dendrogram identified\nclumps have little density variation within them. Clumps with small extents are more likely\n<\nto have nearly constant (column or volume) densities, and indeed clumps with R ∼\n0.6\npc generally agree well with the a = 2 and a = 3 relationships. Note, however, that\nat small scales there is still a range of clump masses at any given R, indicating that the\nfragmentation process produces clumps with a range of masses. Larger scale clumps include\ncontributions from the smaller, high density clumps, and so can have larger density gradients\nwithin their surfaces; as can be seen in Figure 2, those clumps deviate from the a = 2 and\na = 3 relationships. We note that we have also modeled the clumps as ellipsoids (see\ne.g. Rosolowsky et al. 2008; Bertoldi & McKee 1992), and obtain slightly different mass-size\npower-law indices, with a ≈ 1.8 and a ≈ 2.3 for the 2D map and PPP data, respectively; this\ndifference indicates that the definition of R plays a role in the derived mass-size relationship.\nTaking these issues into consideration, even though the best fit indices are a = 2 and a = 3\nfrom the column density map and PPP cube, respectively, we do not conclude that the\nstructures in the simulation have constant volume densities, or that the surface density is\neverywhere equivalent.\n<\nThough there are strong correlations between M and R at R ∼\n0.5 pc, the masses derived\nfrom the 2D map are systematically larger than those from the 3D cube. As described by\nGammie et al. (2003), this discrepancy arises because peaks in the 2D map may include\ncontributions from spatially separated objects which lie along the same line of sight (see also\nKauffmann et al. 2010c, ApJ Submitted, for mass contamination by extended envelopes);\nthis blending of structures along the line of sight also results in fewer total clumps found by\ndendrograms in the 2D map (not all the clumps are shown in Figure 2).\n>\nFor clumps with R ∼\n0.5 pc, there is relatively good agreement in the masses of the 2D\nand 3D structures. These represent the low density, large scale structures, and their total\nmasses include the masses of the higher density, smaller scale clumps embedded within them\n(i.e. the mass of the \"branches\" of the dendrogram tree includes the mass of any \"leaves\"\nassociated with that \"branch,\" see Rosolowsky et al. (2008) for definitions). As the clump\nscale increases, the masses of both the 2D and the PPP clumps approaches the total mass\nof the simulated cloud.\n<\nFrom the PPV cube, many clumps at small scales (R ∼\n0.08 pc) have similar masses\nand sizes to those from the PPP data. At those scales, the clumps are the highest density\nobjects (e.g. \"cores\"); many of those clumps may be detected as objects in high resolution\nPPV cubes since they might have velocities that are distinguishable from the surrounding\nmaterial. But, some of the low mass PPV clumps are not identified as such in the PPP or\ncolumn density maps; they are simply part of much larger low density features. They are\n\n\f–8–\nidentified as clumps in the PPV cube because various regions along that line-of-sight have\nsimilar (turbulent) velocities, and therefore occur as brighter knots in the PPV cube (as\ndiscussed by Pichardo et al. 2000). Thus, many of the low mass, small extent PPV clumps\nin Figure 2 are actually part of the larger, low density PPP clumps. Additionally, we found\nthat for PPV cubes with lower resolution, many of the identified low mass clumps may not\nbe detected.\nAt large scales, at a given radius the masses of the PPV clumps are systematically lower\nthan those of the PPP clumps. This offset arises because of the difference in the definition of\nR2D and R3D , as well as a consequence of only including densities within given velocity bins\nin the construct of the PPV cube. Due to the latter effect, line of sight velocity gradients\nwithin a 3D structure may result in (1 or more) corresponding structure(s) in the PPV cube\nhaving lower mass(es) than the single 3D object; a 3D structure within a molecular cloud\nmay thus not appear as a distinct structure in a PPV cube. These discrepancies indicate\nthat the identification of clumps in a PPV cube may not provide accurate estimates of the\nmasses of the real clumps.\nThe general agreement between the PPV and PPP masses and sizes at small scales,\n2.6\ntransitioning to lower PPV masses at a given size at larger scales, results in M ∝ R2D\nfor\nthe PPV clumps. A derived index between the a ≈ 2 result from the 2D analysis and a ≈ 3\nfrom the full 3D data should be expected, since a PPV cube is constructed using the column\ndensity in defined line of sight velocity bins, thus involving a mixture of the column density\nand 3D density.\n\n3.2.\n\nLinewidth-Size Relationships\n\nFigure 3 shows the non-thermal σ1D − R3D and σz − R2D relationships of dendrogram\nidentified objects from the PPP and PPV cubes, respectively. A best fit of σ ∝ Rb produces\nb ≈ 0.7 for the PPP case. For the PPV clumps, there is a large scatter in the σz − R\nrelationship, and a best fit yields b ≈ 0.85. In practice, it is difficult to accurately measure\nlinewidths for regions smaller than a few tenths of a parsec. We thus also perform the fit only\nconsidering those structures with R > 0.2 pc, and obtain flatter power-laws with b ≈ 0.5 for\nthe PPP clumps and b ≈ 0.82 for the PPV clumps. Even when excluding the small scale\nclumps, a significant difference in the nonthermal linewidth - size relationship between the\nPPP and PPV cases remains.\nBesides the differences in the slopes of the linewidth - size relationships, σz is systematically lower than the linewidth computed using all velocity components, σ1D . Both PPP\n\n\f–9–\nand PPV dispersions are density weighted, either by design (see Eqn. [1]), or due to the\nintrinsic nature of a PPV cube. Thus, any discrepancy can be largely attributed to the\neffect of projection. For example, σz might include contributions from physically separate\nstructures, since a clump in a PPV cube might consist of separate structures in the PPP\ncube. Additionally, σz for a given clump does not include any contribution from vx and vy ,\nthough it has been estimated that this can account for at most 20% of the discrepancy seen.\nThe observed σz is affected by many factors besides the intrinsic velocity distribution of a\ngiven gaseous structure.\nAs indicated in Section 2, an observed linewidth would include a contribution from\nthe thermal velocity; Figure 4 shows the σtot − R relationship from the PPP and PPV\ndata. At small scales, the minimum linewidths are 0.2 km s−1 , which is equal to cs of the\nsimulation; turbulence does not contribute much to the observed linewidths where cs >> the\nturbulent velocities. Compared with Figure 3, which only shows the turbulent components,\nthe minimum linewidth imposed by the thermal component forces the power law index in the\nPPP and PPV case to decrease to b = 0.44 and b = 0.39, respectively. For those structures\nwith R > 0.2 pc, best fits do not change the PPP relationship, but increases the PPV\nlinewidth size index to b = 0.5, similar to results from numerous observational works (e.g.\nSolomon et al. 1987; Larson 1981). Despite the better correspondence in best fit power laws,\nthere is still a clear systematic offset between the PPP and PPV total linewidths; the best fit\nintercepts still differ by a factor of ≈2 (Figure 4, with a larger discrepancy in the turbulent\noffsets, as evident in Figure 3). Table 1 lists the best fit indices for the various power laws\nconsidered.\n\n3.3.\n\nMean Subtracted Data and\n\n13\n\nCO Emission\n\nWe note that in a column density map where the mean density was subtracted off at\neach location, the resulting mass-size relationship is similar to that shown in Figure 2. The\nmain difference is that the measured masses are slightly lower, as would be expected. The\nmasses of the small scale clumps are still appreciably larger than those from the PPP cube.\nWe have also performed our analysis on the simulation data where only gas above 650 cm−3\nis considered to be emitting, a scenario analogous to observing optically thin 13 CO. We\nfind little difference in the derived mass-size and line-size relationships compared with the\nscenario where all gas is emitting. Again, the main difference is that the measured masses\nare slightly lower.\n\n\f– 10 –\n4.\n4.1.\n\nDiscussion\n\nVirial Parameters of the PPP and PPV Clumps\n\nThe observed M-R and σtot -R correlations have strong bearings on the interpretation of\nthe state of the cloud, such as the bounded nature of clumps or the clouds as a whole. For\nexample, a relationship between σ and (R/M) can be constructed from the M ∝ Ra and\nσ ∝ Rb relationships:\nb\n(3)\nσ ∝ (M/R) a−1 .\nThe relationship expressed by Equation 3 is often utilized for studying whether clumps are\nbound, through the virial parameter α = 5σ 2 R/(MG) (e.g. Goodman et al. 2009; Rosolowsky et al.\n<\n2008; Larson 1981). Clumps with α ∼\n2 are considered bound, due to its own self gravity\n(McKee & Zweibel 1992). For a = 2 (\"Larson's 3rd law\") and b = 1/2 (\"Larson's 1st law\"),\nα is independent of R, and if its value is ≈ 2, the clumps under consideration are interpreted\nto be in, or close to, virial equilibrium (\"Larson's 2nd law,\" Larson 1981). We note, however,\nthat a recent investigation of high resolution 13 CO observations by Heyer et al. (2009) has\nfound that structures in molecular clouds in fact do not universally follow all of \"Larson\nlaws.\"\nEven though we have found significant differences between the power law relationships\nwe obtain from the PPP and synthetic observations, we carry forward an analysis to assess\nthe stability of the clumps. Taking a = 3 and b = 0.44 from the PPP cube, σ ∝ (M/R)0.22 .\nThis relationship leads to α ∝ R−1.1 . We explicitly show α as a function of R from the PPP\n>\nanalysis in Figure 5. Smaller scale clumps have α ∼\n2, suggesting they are unbound. At\n>\n<\nR ∼ 0.5 pc, α ∼ 2, suggesting that the large scale structures are close to virialized, or are\nbound.\nFor a = 2.6 and b = 0.39 from the PPV analysis, σ ∝ (M/R)0.24 . These power-laws\nresult in α ∝ R−0.8 . As Figure 5 illustrates, the α − R relationships of the PPV and\nPPP clumps are rather similar, despite the glaring differences in the mass- and linewidthsize relationships shown in Figures 2-4. Though the trend of decreasing virial parameter\nwith increasing radius from the PPP data is generally reproduced in the PPV analysis,\nthe threshold radius of ∼1 pc beyond which clouds are bound varies significantly from the\ncorresponding radius of the PPP clumps.\nFigure 6 shows the α − M relationship. The slopes of these power laws are −0.4 and\n−0.3 for the PPP and PPV clumps, respectively. Similar to the clumps in the simulations of Dib et al. (2007), the large α-parameters of the low mass dense cores suggests that\nthese objects are not bound by their own self-gravity. One interpretation of a decreasing\nvirial parameter with radius, and of very large α for the smallest scale clumps, is that\n\n\f– 11 –\ndense cores are pressure confined, as formulated by Bertoldi & McKee (1992). However,\nour best-fit exponents differ from the 2/3 value derived for purely pressure confined clumps\n(Bertoldi & McKee 1992), suggesting that other physical processes, and/or other terms in\nthe virial equation, need to be taken into account.\nThe similarity in the virial parameters of the clumps from the PPP and PPV clumps\nmust not lead to the interpretation that PPV clumps can reliably provide accurate measurements of α. One reason for the general agreement is due to the abundance of low mass\nclumps in the PPV cube. As discussed in §3, many of these clumps in fact are not distinct\nobjects in the simulation data.\nGenerally, current observations have lower resolutions than those considered in this\nwork, and such observations would not be capable of detecting all the small scale PPV\nclumps shown in Figures 2 and 4. The resulting α-R power law would have a flatter index\n<\n<\nthan the −0.8 shown in Figure 5. Further, at intermediate radii (0.1 pc ∼\nR∼\n0.3 pc),\nthere is a clear offset in the measured virial parameter of the PPV clumps compared to those\nof the PPP clumps, due to the lower mass estimates of the PPV clumps (see Figure 2).\nAdditionally, we note that the turbulent linewidths, as opposed to the total linewidths,\nproduce power law linewidth-size relationships with markedly greater discrepancy between\nthe PPP and PPV clumps (see Figure 3 and Table 1). Of course, identifying the turbulent\nlinewidth is very difficult when the turbulent velocity components are (very) subsonic; and,\nthe kinetic term in the virial parameter must include the thermal component to properly\nassess a clump's stability. Yet, the vast differences between the σ1D − R and σz − R relationships are illustrative of the strong influence of turbulence, in conjunction with projection,\non the measured mass- and linewidth- size relationships.\nNevertheless, α is itself derived by excluding the surface terms in the virial equation, as\nwell as assuming a negligible temporal variation in the moment of inertia. These terms may\nin fact be comparable to the surface terms, as Ballesteros-Paredes et al. (1999) and Dib et al.\n(2007) demonstrated in extensive analyses of 2D and 3D simulations, respectively. Other\ncommon assumptions, such as that turbulence only acts against collapse, may themselves\nbe flawed, as discussed by Ballesteros-Paredes (2006). Such simplifications may lead to\ninaccurate interpretations of the state of observed clouds. Given these caveats, the standard\nvirial analysis may not accurately reveal the bounded nature of clumps, even when applied\nto the full 3D simulation cube. We thus cannot draw any unequivocal conclusions about the\nbounded nature of the clumps in one snapshot of the simulation. Our findings simply suggest\nthat commonly assessed correlations, such as the mass-size and linewidth-size relationships,\nmay be significantly affected by projection effects.\n\n\f– 12 –\n4.2.\n\nImplications for Interpreting Observations\n\nThe stark discrepancy in the power law relationships between the full simulation dataset\nand the synthetic observations may be due in part to the structure of the simulated molecular\ncloud (in addition to the aforementioned choice of the definition of R). In the simulation\nwe consider, filaments are ubiquitous within the cloud, and most dense cores are clustered\n(besides residing in filaments).\nWe have verified that for purely spherical cores that are completely isolated (i.e. not\nlying in the same line-of-sight from other cores) with distinct velocity profiles, the masses,\nsizes, and linewidths derived from the PPP and PPV cubes agree.3 If such \"simple\" clouds\nexists, and given the discrepancy in derived power-laws between PPP and synthetic observations of the filamentary simulation we consider, we speculate that there should be some\ntransition region in parameter space beyond which traditional analysis methods used to assess the \"boundedness\" of structures cannot be applicable. We illustrate this concept in\nFigure 7, which broadly indicates that consideration of more physical processes is necessary\nfor accurately assessing the boundedness of more complex clouds.\nFor a very simple spherical clump, it may be possible to determine if the object is\nbound or not using the classical virial parameter analysis (however, see caveats expounded\nby Ballesteros-Paredes 2006). Including additional physics may increase the accuracy of the\nanalysis. It may not be possible to apply a given analysis, such as the straightforward virial\nparameter analysis, to more complex clouds, indicated by the shaded region in Figure 7.\nAccurately determining the bounded nature of objects within complex clouds would require\nthe consideration of more physics, such as the surface terms in the virial analyses, and/or\nthe effects of magnetic fields.\nFigure 7 is only a schematic, intended to illustrate that considering more physics, rather\nthan just kinetic and gravitational energies, is required for reliably determining the nature\nof the clumps in more complex clouds. The depiction of a distinct transition separating the\nstructures for which it is possible to determine their bounded nature from those for which it\nis not is simply an arbitrary illustration. The confirmation of agreement in the masses, sizes,\nand linewidths of simple, isolated cores between the PPV and PPP cubes is representative\nof a situation residing near the origin in Figure 7 (marked by a circle). In this case a simple\nvirial analysis would produce identical results between a PPP and PPV analysis, and thus\nmay accurately reveal the dynamical state of the clumps. On the other hand, our analysis of\n3\n\nIn the simulation, however, we found that relatively isolated structures give different best fit power laws\nfrom the PPP and synthetic observations.\n\n\f– 13 –\nthe highly filamentary simulation (shown in Figure 1) clearly lies within the shaded regime of\nFigure 7 where the cloud structure is rather complex (marked by a cross). An investigation\ninto the bounded nature of the clumps in this simulation would require consideration of more\nphysics than those included in the classic virial analysis.\nThe parameter space depicted in Figure 7 does not indicate the level of modeling necessary to handle the effect of projection. In our analysis, we have simply represented the\nscale of the clumps as radii of circles with areas equal to that of the projected clump. The\nsimulation we consider is rather filamentary, and so our method of assigning a \"radius\"\nto characterize the extent of the cloud may be partially responsible for the discrepancy in\nmeasured power-law correlations between the PPP and synthetic observation cases. As indicated, assuming spherical symmetry may be sufficient for spherical cores with certain density\nand velocity profiles. However, such idealized cores might not exist in nature, thus requiring\nbetter modeling efforts even for the most simple objects.\nIn our analysis, we have not considered effects of chemistry and/or radiative transfer.\nWe simply consider a purely optically thin medium, within which radiation emerges from\nall matter, or regions with densities above a threshold density, and assume thermodynamic\nequilibrium. However, the ISM is comprised of various components at different temperatures\n(e.g Heiles & Troland 2003); individual cold clouds may also be embedded in warmer gas\n(Hennebelle & Inutsuka 2006). The physical state of molecular clouds may thus be more\ncomplex than that considered here. Further, the synthetic observations have insignificant\nnoise levels. Even in excluding more complex physics and instrumental effects intrinsic to\nreal observations, we still find rather significant differences between the measured properties\nof the cloud from the 3D simulation data compared with the synthetic observations. Thus,\nany discrepancies in the observed structure, from either a PPV cube or a column density\nmap, from the 3D structure of the cloud can be fully attributed to the effect of geometric\nprojection.\nThough we have shown that projection may produce inaccurate scaling relations for\na given observed cloud, comparing scaling relations between various observations may still\nprove to be worthwhile. For example, if analyses of PPV cubes, or 2D column density maps,\nof different molecular clouds produce different linewidth- and/or mass- size relationships,\nthere may be some intrinsic physical process that could be responsible for the differences\n(e.g. Kauffmann et al. 2010b, in preparation). Some processes, such as heating and cooling,\nmay play the most influential roles in sculpting one cloud, but may be insignificant compared\nto the effect of magnetic fields and gravity in another; thus, the (observed) scaling relations\nof those two clouds could be different.\nTo infer accurate cloud characteristics from the value of the exponents of the de-\n\n\f– 14 –\nrived scaling relation, a thorough understanding of the effect of projection is a necessity. Analyses of various simulations could be an avenue toward such an understanding\n(Ballesteros-Paredes & Mac Low 2002; Dib & Kim 2007; Dib et al. 2007). In this work, we\nhave only assessed one particular simulation. More analyses on different simulations, e.g.\nthose with different magnetic field configurations, or including the effects of heating and\ncooling, should advance our understanding on how the \"observed\" mass- and linewidth- size\nscaling relations, and ultimately the virial parameter, varies through the combined effects of\ngeometric projection and the different physical processes at work.\n\n5.\n\nSummary\n\nWe assess the effect of geometric projection in deriving cloud properties, using a simulation of a molecular cloud. Using dendrograms (Rosolowsky et al. 2008), we identify contiguous structures in the 3D simulation dataset and idealized synthetic observations of the\nsimulation. We measure the masses, sizes, and linewidths of structures in PPP and PPV\ncubes, as well as in column density maps of the simulated cloud. We subsequently perform a\nvirial analysis to compare the bounded state of clumps in the simulation with that assessed\nfrom the synthetic observations. Our main results and conclusions are:\n>\n1) Identified clumps from the 2D column density map with large extents (R ∼\n0.8\npc) have masses in agreement with those obtained from 3D PPP cube. These large scale\nstructures contain much of the total mass of the cloud. However, at smaller scales, the 2D\nclumps have systematically higher masses than those from the 3D simulation. The measured\nmasses of these smaller scale clumps in the 2D map include contributions from all gas lying\nalong the same lines of sight, resulting in inflated mass estimates.\n<\n2) Low mass structures with small extents (R ∼\n0.1 pc) identified in the PPV cube have\nsimilar masses to corresponding objects in the PPP data. However, many of these structures\nare not distinct objects in the PPP ρ-cube; they are identified only because gas from different\nregions along (or near) the same line of sight happens to have similar line of sight velocities.\nFurther, high spectral and spatial resolution would be required to identify those structures\n>\nfrom spectral line observations. On the other hand, at large scales (R ∼\n0.1), PPV\nstructures systematically have lower masses than PPP structures. This discrepancy again\narises because of line of sight effects: a large scale structure in the PPP data might be\nidentified as numerous lower mass structures in the PPV cube due to gradients in the line\nof sight velocity.\n\n3) When only turbulent velocities are considered, the cumulative distribution of clumps\n\n\f– 15 –\nfrom the 3D PPP data give different indices in the M-R and σ − R power law relationships\ncompared to those from the 2D column density map and PPV cube of the simulated cloud.\nAfter including the contribution from thermal pressure, the linewidth has a lower limit at the\nvalue of cs . This results in similar best fit σtot − R power-law indices from the PPP and PPV\nanalyses, though there is a large degree of scatter. Further, the PPV clumps systematically\n>\nhave lower linewidths than those of the PPV clumps, often differing by a factor ∼\n2 (Figures\n3-4 and Table 1).\n4) Due to the differences in the measured properties from the PPP data and synthetic\nobservations, there is a discrepancy in the identified scale beyond which the clumps are\nassessed to be bound. Despite the differences indicated by points 2) and 3), a virial analysis\nof the clumps in the PPP and PPV cubes show similar trends. But, we suggest that the\nsimilarity should not lead to the interpretation that a PPV analysis can accurately reveal\nthe dynamical state of the observed clumps.\n5) Taking 2) - 4) together, we conclude that projection effects can be rather significant,\nleading to inaccurate interpretations of the dynamical state of the cloud. We speculate that\nfor a simple spherical cloud, the classic virial analysis, where the surface and magnetic terms\nare omitted (among other assumptions), may be sufficient for reliably determining whether\ncores are bound or not. We suggest that highly filamentary clouds require consideration of\nadditional physics (Figure 7). We also remark that better modeling techniques are necessary\nto properly account for the effect of projection, as well as to appropriately handle the the\nnon-spherical shapes of cloud structures.\nWe are grateful to F. Shu for suggesting, after AG's 2008 Tucson \"Stromfest\" talk on\nthe \"self-gravity\" results now found in Goodman et al. (2009), that we carry out \"tests of\nthe test,\" or, in other words for suggesting that we investigate the translation and meaning\nof the α virial parameter between PPP and PPV space. We also thank E. Ostriker, P.\nMyers, and S. Offner for very useful comments that improved this work. This presentation\nbenefitted from many suggestions from an anonymous referee. We acknowledge use of NEMO\nsoftware (Teuben 1995) to perform our analysis. D.C. acknowledges support from NSF grant\nAST0808184, and performed the simulation at the National Institute for Computational\nSciences with computing time provided by LRAC allocation MCA98N020. R.S., J. K., and\nA. G. acknowledge support from the Harvard Initiative in Innovative Computing, which\nhosts the Star-Formation Taste Tests Community at which further details on these results\ncan be found and discussed (see http://www.cfa.harvard.edu/∼agoodman/tastetests).\n\n\f– 16 –\nREFERENCES\nAdler, D. S. & Roberts, Jr., W. W. 1992, ApJ, 384, 95\nBallesteros-Paredes, J. 2006, MNRAS, 372, 443\nBallesteros-Paredes, J. & Mac Low, M.-M. 2002, ApJ, 570, 734\nBallesteros-Paredes, J., Vázquez-Semadeni, E., & Scalo, J. 1999, ApJ, 515, 286\nBertoldi, F. & McKee, C. F. 1992, ApJ, 395, 140\nCollins, D. C., Xu, H., Norman, M. L., Li, H., & Li, S. 2010, ApJS, 186, 308\nDib, S. & Kim, J. 2007, in Astronomical Society of the Pacific Conference Series, Vol. 365,\nSINS - Small Ionized and Neutral Structures in the Diffuse Interstellar Medium, ed.\nM. Haverkorn & W. M. Goss, 166–+\nDib, S., Kim, J., Vázquez-Semadeni, E., Burkert, A., & Shadmehri, M. 2007, ApJ, 661, 262\nFalgarone, E., Puget, J., & Perault, M. 1992, A&A, 257, 715\nGammie, C. F., Lin, Y.-T., Stone, J. M., & Ostriker, E. C. 2003, ApJ, 592, 203\nGoodman, A. A., Rosolowsky, E. W., Borkin, M. A., Foster, J. B., Halle, M., Kauffmann,\nJ., & Pineda, J. E. 2009, Nature, 457, 63\nHeiles, C. & Troland, T. H. 2003, ApJ, 586, 1067\nHennebelle, P. & Inutsuka, S. 2006, ApJ, 647, 404\nHeyer, M., Krawczyk, C., Duval, J., & Jackson, J. M. 2009, ApJ, 699, 1092\nLarson, R. B. 1981, MNRAS, 194, 809\nMac Low, M.-M. 1999, ApJ, 524, 169\nMcKee, C. F. & Zweibel, E. G. 1992, ApJ, 399, 551\nMyers, P. C. & Goodman, A. A. 1988, ApJ, 329, 392\nOstriker, E. C., Stone, J. M., & Gammie, C. F. 2001, ApJ, 546, 980\nPichardo, B., Vázquez-Semadeni, E., Gazol, A., Passot, T., & Ballesteros-Paredes, J. 2000,\nApJ, 532, 353\n\n\f– 17 –\nPineda, J. E., Rosolowsky, E. W., & Goodman, A. A. 2009, ApJ, 699, L134\nRosolowsky, E. & Blitz, L. 2005, ApJ, 623, 826\nRosolowsky, E. W., Pineda, J. E., Kauffmann, J., & Goodman, A. A. 2008, ApJ, 679, 1338\nSolomon, P. M., Rivolo, A. R., Barrett, J., & Yahil, A. 1987, ApJ, 319, 730\nStutzki, J. & Guesten, R. 1990, ApJ, 356, 513\nTeuben, P. 1995, in ASP Conf. Ser. 77: Astronomical Data Analysis Software and Systems\nIV, ed. R. A. Shaw, H. E. Payne, & J. J. E. Hayes, 398–+\nTruelove, J. K., Klein, R. I., McKee, C. F., Holliman, II, J. H., Howell, L. H., & Greenough,\nJ. A. 1997, ApJ, 489, L179+\nWilliams, J. P., de Geus, E. J., & Blitz, L. 1994, ApJ, 428, 693\n\nThis preprint was prepared with the AAS LATEX macros v5.2.\n\n\f– 18 –\n\nFig. 1.- Column density of simulated cloud. Each side has a length of 10 pc.\n\n\f– 19 –\n\nFig. 2.- Mass-size relationships from dendrogram defined clumps in a 3D ρ-cube (black\ncircles), 2D column density map (green crosses), and PPV cube (red squares). Lines indicate\nbest fits of M ∝ Ra . In order to distinguish between points, only half of the PPP clumps\nand PPV clumps are shown; the excluded points follow the same trends as those shown.\n\n\f– 20 –\n\nFig. 3.- Linewidth - size relationship from dendrogram identified structures in the PPP\nρ-cube (black circles) and PPV cube (red squares). Best fit lines of σ1D ∝ Rb for the PPP\nclumps (black) and σz ∝ Rb for the PPV clumps (red) are shown. Best fits to clumps with\nR > 0.2 pc are also shown (dashed lines). The linewidths (σ1D for PPP and σz for PPV) do\nnot include the contribution from the sound speed.\n\n\f– 21 –\n\nFig. 4.- Total linewidth - size relationship from dendrogram identified structures in the\nPPP ρ-cube (black circles) and PPV cube (red squares), along with best fit lines σtot ∝ Rb .\nFits to clumps with R > 0.2 pc are also shown (dashed line).\n\n\f– 22 –\n\nFig. 5.- Virial parameter (α) - size relation for clumps found in the 3D simulation (black\ncircles) and synthetic PPV cube (red squares). Best fit lines are also shown, with slopes\nof −1.1 and −0.8 for the 3D simulation and the PPV clumps, respectively. Horizontal line\nshows α=2, indicating virialized clumps.\n\n\f– 23 –\n\nFig. 6.- Virial parameter (α) - mass relation for clumps found in the 3D simulation (black\ncircles) and synthetic PPV cube (red squares). Best fit lines are also shown, with slopes\nof −0.4 and −0.3 for the 3D simulation and the PPV clumps, respectively. Horizontal line\nshows α=2, indicating virialized clumps.\n\n\f– 24 –\n\nFig. 7.- Schematic diagram indicating how the consideration of more complex physics is\npossibly required to reliably assess whether structures in molecular clouds are bound or not.\nThe abscissa represents the level of complexity in the cloud, from a relatively simple sphere\nto a highly filamentary cloud. The ordinate represents the physical process considered in the\nanalysis. The circle and cross represent cases we have considered in this work.\n\n\f– 25 –\n\nTable 1. Summary of Power Law Relationships\nPower Law; index\nM ∝ Ra ; a\nσ1D ∝ Rb ; b\nσ1D ∝ Rb (R > 0.2 pc); b\nσz ∝ Rb ; b\nσz ∝ Rb (R > 0.2 pc); b\nσtot ∝ Rb ; b\nσtot ∝ Rb (R > 0.2 pc); b\na\n\nR = R3D\n\nb\n\nR = R2D\n\nPPPa\n\nPPVb\n\n3.03 ± 0.02 2.56 ± 0.01\n0.72 ± 0.01\n0.49 ± 0.02\n0.85 ± 0.01\n0.82 ± 0.01\n0.44 ± 0.01 0.39 ± 0.004\n0.42 ± 0.02 0.49 ± 0.01\n\nColumn Densityb\n1.95 ± 0.03\n-\n\n\f"}