{"id": "http://arxiv.org/abs/0704.0658v3", "guidislink": true, "updated": "2008-01-24T16:22:30Z", "updated_parsed": [2008, 1, 24, 16, 22, 30, 3, 24, 0], "published": "2007-04-04T22:04:07Z", "published_parsed": [2007, 4, 4, 22, 4, 7, 2, 94, 0], "title": "Collective excitations in a magnetically doped quantized Hall\n  ferromagnet", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0704.2561%2C0704.2201%2C0704.3756%2C0704.0678%2C0704.1249%2C0704.0151%2C0704.2137%2C0704.2327%2C0704.3292%2C0704.2352%2C0704.0323%2C0704.1977%2C0704.0641%2C0704.1005%2C0704.3133%2C0704.0081%2C0704.0667%2C0704.1654%2C0704.0492%2C0704.1412%2C0704.1673%2C0704.2054%2C0704.1694%2C0704.3444%2C0704.3958%2C0704.1415%2C0704.0352%2C0704.2310%2C0704.2386%2C0704.2948%2C0704.0658%2C0704.0351%2C0704.0452%2C0704.2513%2C0704.1197%2C0704.1910%2C0704.3299%2C0704.3409%2C0704.3619%2C0704.0436%2C0704.0834%2C0704.1893%2C0704.2162%2C0704.2525%2C0704.2971%2C0704.2779%2C0704.2252%2C0704.1853%2C0704.2790%2C0704.2836%2C0704.1290%2C0704.2005%2C0704.2531%2C0704.1544%2C0704.1831%2C0704.1017%2C0704.0864%2C0704.2563%2C0704.3492%2C0704.0121%2C0704.3385%2C0704.0343%2C0704.0360%2C0704.3102%2C0704.1002%2C0704.1825%2C0704.3725%2C0704.0515%2C0704.0494%2C0704.3728%2C0704.3070%2C0704.1448%2C0704.3099%2C0704.3729%2C0704.1529%2C0704.0747%2C0704.1032%2C0704.1055%2C0704.0656%2C0704.2403%2C0704.3507%2C0704.1433%2C0704.2249%2C0704.1520%2C0704.1946%2C0704.0254%2C0704.1374%2C0704.1678%2C0704.1956%2C0704.0003%2C0704.1540%2C0704.0460%2C0704.1176%2C0704.1643%2C0704.3354%2C0704.0593%2C0704.1783%2C0704.1988%2C0704.2074%2C0704.3724%2C0704.1308&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Collective excitations in a magnetically doped quantized Hall\n  ferromagnet"}, "summary": "A theory of collective states in a magnetically quantized two-dimensional\nelectron gas (2DEG) with half-filled Landau level (quantized Hall ferromagnet)\nin the presence of magnetic 3d impurities is developed. The spectrum of bound\nand delocalized spin-excitons as well as the renormalization of Zeeman\nsplitting of the impurity 3d levels due to the indirect exchange interaction\nwith the 2DEG are studied for the specific case of n-type GaAs doped with Mn\nwhere the Lande` g-factors of impurity and 2DEG have opposite signs. If the\nsign of the 2DEG g-factor is changed due to external influences, then impurity\nrelated transitions to new ground state phases, presenting various spin-flip\nand skyrmion-like textures, are possible. Conditions for existence of these\nphases are discussed. PACS: 73.43.Lp, 73.21.Fg, 72.15.Rn", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0704.2561%2C0704.2201%2C0704.3756%2C0704.0678%2C0704.1249%2C0704.0151%2C0704.2137%2C0704.2327%2C0704.3292%2C0704.2352%2C0704.0323%2C0704.1977%2C0704.0641%2C0704.1005%2C0704.3133%2C0704.0081%2C0704.0667%2C0704.1654%2C0704.0492%2C0704.1412%2C0704.1673%2C0704.2054%2C0704.1694%2C0704.3444%2C0704.3958%2C0704.1415%2C0704.0352%2C0704.2310%2C0704.2386%2C0704.2948%2C0704.0658%2C0704.0351%2C0704.0452%2C0704.2513%2C0704.1197%2C0704.1910%2C0704.3299%2C0704.3409%2C0704.3619%2C0704.0436%2C0704.0834%2C0704.1893%2C0704.2162%2C0704.2525%2C0704.2971%2C0704.2779%2C0704.2252%2C0704.1853%2C0704.2790%2C0704.2836%2C0704.1290%2C0704.2005%2C0704.2531%2C0704.1544%2C0704.1831%2C0704.1017%2C0704.0864%2C0704.2563%2C0704.3492%2C0704.0121%2C0704.3385%2C0704.0343%2C0704.0360%2C0704.3102%2C0704.1002%2C0704.1825%2C0704.3725%2C0704.0515%2C0704.0494%2C0704.3728%2C0704.3070%2C0704.1448%2C0704.3099%2C0704.3729%2C0704.1529%2C0704.0747%2C0704.1032%2C0704.1055%2C0704.0656%2C0704.2403%2C0704.3507%2C0704.1433%2C0704.2249%2C0704.1520%2C0704.1946%2C0704.0254%2C0704.1374%2C0704.1678%2C0704.1956%2C0704.0003%2C0704.1540%2C0704.0460%2C0704.1176%2C0704.1643%2C0704.3354%2C0704.0593%2C0704.1783%2C0704.1988%2C0704.2074%2C0704.3724%2C0704.1308&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "A theory of collective states in a magnetically quantized two-dimensional\nelectron gas (2DEG) with half-filled Landau level (quantized Hall ferromagnet)\nin the presence of magnetic 3d impurities is developed. The spectrum of bound\nand delocalized spin-excitons as well as the renormalization of Zeeman\nsplitting of the impurity 3d levels due to the indirect exchange interaction\nwith the 2DEG are studied for the specific case of n-type GaAs doped with Mn\nwhere the Lande` g-factors of impurity and 2DEG have opposite signs. If the\nsign of the 2DEG g-factor is changed due to external influences, then impurity\nrelated transitions to new ground state phases, presenting various spin-flip\nand skyrmion-like textures, are possible. Conditions for existence of these\nphases are discussed. PACS: 73.43.Lp, 73.21.Fg, 72.15.Rn"}, "authors": ["S. Dickmann", "V. Fleurov", "K. Kikoin"], "author_detail": {"name": "K. Kikoin"}, "author": "K. Kikoin", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1103/PhysRevB.76.205309", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/0704.0658v3", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0704.0658v3", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "32 pages including 7 figures. To be published in Phys. Rev. B", "arxiv_primary_category": {"term": "cond-mat.mes-hall", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cond-mat.mes-hall", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "cond-mat.str-el", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0704.0658v3", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0704.0658v3", "journal_reference": "Phys. Rev. B 76, 205309 (2007)", "doi": "10.1103/PhysRevB.76.205309", "fulltext": "Collective excitations in a magnetically doped quantized Hall\nferromagnet\nS. Dickmann1,2 , V. Fleurov1,3 and K. Kikoin1,3,4\n\narXiv:0704.0658v3 [cond-mat.mes-hall] 24 Jan 2008\n\n1 Max-Planck-Institut\n\nfür Physik Komplexer Systeme,\n\nNöthnitzer Str.\n\n38,\n\nD-01187 Dresden, Germany.\n2 Institute\n\nfor Solid State Physics of RAS,\nChernogolovka 142432,\n\nMoscow District, Russia.\n3 School\n\nof Physics and Astronomy,\n\nBeverly and Raymond Sackler Faculty of Exact Sciences,\nTel Aviv University, Tel Aviv 69978, Israel.\n4 Department\n\nof Physics,\n\nBen-Gurion University of the Negev,\nBeer-Sheva 84105, Israel.\nA theory of collective states in a magnetically quantized two-dimensional electron\ngas (2DEG) with half-filled Landau level (quantized Hall ferromagnet) in the presence of magnetic 3d impurities is developed. The spectrum of bound and delocalized\nspin-excitons as well as the renormalization of Zeeman splitting of the impurity 3d\nlevels due to the indirect exchange interaction with the 2DEG are studied for the\nspecific case of n-type GaAs doped with Mn where the Landé g-factors of impurity\nand 2DEG have opposite signs. If the sign of the 2DEG g-factor is changed due to\nexternal influences, then impurity related transitions to new ground state phases,\npresenting various spin-flip and skyrmion-like textures, are possible. Conditions for\nexistence of these phases are discussed.\nPACS: 73.43.Lp, 73.21.Fg, 72.15.Rn\n\n\f2\nI.\n\nINTRODUCTION\n\nIn a strong magnetic field the two-dimensional electron states in semiconductor\nheterostructures 1 transform into Landau states with a completely discrete energy spectrum. This diamagnetically quantized two-dimensional electron gas (2DEG) possesses many\nremarkable features including Quantum Hall effect.2 The role of impurities in the thermodynamic, optical and transport properties of 2DEG is extremely important. Among many\nfacets of this problem we choose for discussion in this paper the formation of impurity related\ncollective excitations in a magnetically doped quantized 2DEG in the case of odd integer\nfilling factor ν = 2n+1. In a pristine state 2DEG with odd ν is in a Quantuzed Hall Ferromagnet (QHF) regime with nondegenerate ground state characterized by the total spin\nquantum number S = Nφ /2 and maximum spin projection Sz = S. (Nφ is the magneticflux-quanta number.) Different branches of the excitons are well distinguishable among the\nlow-energy excitations. They are classified as spin waves (spin excitons), magnetoplasmons or\nmulti-exciton states depending on the spin and orbital quantum numbers.3,4,5,6,7,8,9,10 Besides,\nlow-lying collective half-integer-spin fermionic states (trions, skyrmions,...) may be formed\nin a QHF under certain circumstances.11,12,13,14,15,16,17,18 Magnetic impurities are characterized by their own spectrum of local spin excitations, and one can anticipate a strong interplay\nbetween local and collective excitations in a magnetically doped QHF.\nIt is known that the influence of impurities on the discrete spectrum of quantized Landau\nelectrons in a 2DEG has many specific features. Even such a basic property, as the interaction of a 2DEG with neutral short range impurities is far from being trivial.19,20,21 Only\nthe Landau states with a finite probability density on the scatterer locations interact with\nimpurities. This means that the whole set of Landau states breaks down into two groups:\nthe major part of the Landau levels (LLs) is not affected by the impurity scattering, and\nthe states having a nonzero scattering amplitude on an impurity form a separate system of\nbound Landau states in the energy gaps between the free LLs.\nTo be more specific, we consider a 2DEG formed in the n-type GaAs/GaAlAs heterostructures doped with transition metal (TM) impurities. The reason for this choice is that the\ntechnology of (Ga,Mn)As epilayers is well developed, and the QHF regime is achieved experimentally in GaAs based heterostrures. As a rule, transition metal ions substitute for\nthe metallic component of the binary II-VI and III-V semiconductors.22,23,24 The influence\nof isolated TM impurities on the spectrum of the Landau states was investigated in Ref. 25.\nIt was shown that the resonance scattering in the d-channel is in many respects similar to\nthat of the short range impurity scattering in the s-channel.19,20,21 The symmetry selection\n\n\f3\nrules for the resonance d-waves in the cylindrical (symmetric) gauge pick up the Landau\nstates with the orbital number m = 0 (in the symmetric gauge). These states are the same\nstates that are involved in the s-scattering by the impurities with a short range scattering\npotential.21 Besides, this scattering is spin selective in magnetically quantized 2DEG.\nIt should be emphasized that in the problem under consideration the criterion of isolated\nimpurities acquires a specific feature. In fact the Mn concentration range, where our theory is\napplicable, is limited from below by technological capabilities and from above by the obvious\nrequirement that the impurity induced disorder does not destroy collective excitonic states.\n< 1015 cm−3 . Here the\nSo, the relevant interval of bulk Mn concentrations is 1013 cm−3 < nMn ∼\nupper limit corresponds to the 2D concentration of 109 cm−2 which in our case is actually well\nbelow the Landau band capacity Nφ at B ∼ 10T that equals to the the 2D electron number\non the upper (half-filled) LL. One may expect that the above mentioned classification of\n< 1015 cm−3 , which is much less\nexcitonic states is valid only at the bulk concentration nMn ∼\nthan in the materials used for creation of dilute magnetic semiconductors.26\n\nWe calculate in this paper spectra of bound and continuous collective excitations related\nto magnetic impurities. When studying the influence of magnetic impurities on the excitonic\nspectrum of 2DEG, a distinction between the negative and positive signs of the gyromagnetic\nratio of 2DEG electrons g2DEG should be also mentioned. It will be shown that in the\nconventional situation of negative g2DEG the interaction with magnetic impurity lowers the\nground state energy due to effectively antiferromagnetic character of the effective indirect\nexchange. This results in formation of a set of bound and delocalized collective excitations\npresenting combined modes classified by a change in the total spin number Sz . When g2DEG >\n0, so that the g factors of both subsystems (2DEG electrons and impurities) have the same\nsign, magnetic impurities may form bound states in the gap below the spin exciton continuum\nand even initiate a global reconstruction of the QHF ground state.\n\nII.\n\nMODEL HAMILTONIAN\n\nFollowing Ref. 23, we describe the electron scattering on a TM impurity in semiconductor within the framework of the Anderson impurity model Hamiltonian 27 generalized for the\ncase of multicharged impurity states in semiconductors.28,29,30 According to this model, the\nprincipal source of magnetic interaction is the resonance scattering of conduction electrons\non the d-electron levels of TM impurity in the presence of a strong on-site Coulomb interaction U. Due to this interaction, the local moment of TM impurity survives in the crystalline\nenvironment, and 'kinematic' indirect exchange interaction between the conduction and im-\n\n\f4\npurity electrons arises in the second order in the s-d-hybridization parameter, even in the\nabsence of a direct exchange.\nThe generic Hamiltonian describing the QHF regime in a magnetically doped semiconductor is\nĤ = Ĥd + Ĥs + Ĥt + Ĥsd .\nHere Ĥd =\n\nP\n\ni\n\n(2.1)\n\nĤdi describes the TM impurities on the sites i, Ĥs is related to the band elec-\n\ntrons on the LLs, and Ĥt is responsible for hybridization between the impurity d-electrons\nand Landau electrons. Eventually, it is this hybridization that generates coupling between\ncollective modes in 2DEG and localized spin excitations on the impurity sites. In our extremely weak doping regime both the direct and indirect interactions between magnetic\nimpurities are negligible. Each magnetic scatterer may be considered independently, and it\nis convenient to choose the symmetric gauge A = (− B2 y, B2 x, 0) with the quantum numbers\nλ = (n, m) for the Landau electrons hybridized with the atomic d-electrons centered around\nthe site i positioned in the center of coordinates. The Coulomb interaction is taken into\naccount in the impurity and in the band electron subsystems. Besides the direct Coulomb\ninteraction between the d and s electrons described by the last term in the Hamiltonian (2.1)\nis added to the conventional impurity Hamiltonian (cf. Ref. 27) described by the first and\nthird terms. All additional interactions will be discussed below in detail.\nSubstitutional Mn impurity in GaAs retains all its five d electrons due to a special stability of the half filled 3d shell. In the p-type GaAs the electrically neutral state of Mn\nin Ga position is Mn(3+) (3d5+hole), where the hole is bound on the relatively shallow acceptor level near the top of the valence band, whereas the occupied d-electron levels are\ndeep in the valence band.23,24,31,32 In the n-type heterostructures these acceptor states are\novercompensated, and the chemical potential is pinned on one of the lowest Landau levels in\nthe conduction band. Since we are interested only in the low-energy excitations above the\nground state of n-type system, Mn impurities will be considered as the Mn(3+) (3d5 ) ions in\nthe subsequent calculations.\n\nA.\n\nSingle-orbital model. Spin-selective hybridization.\n\nOne may significantly simplify the calculation of the spectrum of excitations by reducing\nthe general Hamiltonian (2.1) to the form, in which only the terms relevant to the calculation\nof desired collective states are present. As a result of this simplification outlined below in\nSubsection II B one arrives at the single-orbital, single Landau band hybridization Hamiltonian, which explicitly takes into account the Hund rule governing the high-spin states 3d5\n\n\f5\nand 3d6 of the Mn 3d shell (the state 3d4 is proved to be irrelevant in our specific case of\nMn in GaAs lattice, see below Fig. 1). These impurity states are characterized by the maximum total spin quantum numbers S (d) = 5/2 at 3d5, and S (d) = 2 at 3d6 , and the effective\nHamiltonian Ĥ is defined in the charge sector {|d5 , Ni, |d6, N − 1i} of states with variable\nnumber N or N − 1 of the electrons on the highest n-th LL (of course in our case N ≈ Nφ ).\nThe Hamiltonian now reads\nĤ =\n\nX\n\nǫdσ n̂γ0 σ + U n̂γ0 ↑ n̂γ0 ↓ +\n\nσ\n\nX\n\n′\nεnσ a†nmσ anmσ + ĤCoul\n+ Ĥt .\n\n(2.2)\n\nmσ\n\nwhere the impurity Hamiltonian Ĥd of Eq. (2.1) is represented in by the two first terms,\nin which n̂γ0 σ = c†γ0 σ cγ0 σ , and c†γ0 σ is the creation operator for the d-electron at the orbital\nγ0 with the spin z-component σ. The notation γ0 designates the only 3d-orbital with the\nY02 ∼ 3z 2 − r 2 symmetry, which effectively couples with the m = 0 state of the LL.25 The\nparameter U characterizes Coulomb and exchange interactions determining the addition\nenergy for the transition 3d5 → 3d6 . The third term in Eq. (2.2) is the Hamiltonian\n\nof noninteracting Landau electrons where a†nmσ is the creation operator for the (n, m, σ)\n\n′\nLandau state. The most of interaction components are included in ĤCoul\n. This term does\n\nnot include only the d-d interaction parametrized by U and the last term Ĥt . The latter\ngenerically is also the part of Coulomb interaction between impurity and Landau electrons\nwhich intermixes impurity and Landau orbitals . However, in our case Ĥt acquires the form\nof single-electron hybridization operator [see discussion after Eq. (2.13)],\nĤt =\n\nX\n\nWn0 a†n0σ cγ0 σ + H.c.\n\n(2.3)\n\nσ\n\nAs was mentioned above, this operator is responsible for the resonance orbital-selective scatterings in QHF. It includes hybridization of the impurity electron with the 2DEG electrons\nwithin the n-th LL. This means that only the influence of impurity on the intra-LL excitations (of the spin-wave type) is taken into account. The hybridization with the states with\nn′ 6= n describing the processes with energy change ~ωc or higher is omitted.\n\n′\nIn the absence of interaction term ĤCoul\n, the Hamiltonian (2.2) acts in the subspace\n\n1\n|d5, s; vaci, |d6, s + ; an0↑ |vaci and |d5 , s + 1; a†n0↓ an0↑ |vaci,\n2\n\n(2.4)\n\nwhere the fully polarized 2DEG without impurity is chosen to be the 'vacuum' state |vaci =↑\n, ↑, ... ↑i. Therefore a†nm↑ |vaci = anm↓ |vaci ≡ 0. We represent the total spin component as\n\nSz =\n\nNφ\n2\n\n+ s. Thus we characterize the states in the set (2.4) by the quantum number Sz .\n(s)\n\n(d)\n\nIt is important that only Sz = Sz + Sz\n\nis an exact spin quantum number in our system.\n\n\f6\n(s)\n\nSeparately, the Hamiltonian (2.2) commutes neither with the spin component Sz of the LL\n(d)\n\nelectrons nor with the impurity spin component Sz . Equally, it does not commute with\nthe total spin S2 and with the spins (S(s) )2 and (S(d) )2 (see Appendix B). The number s\nin the set (2.4) changes within the interval − 25 ≤ s < 52 . It is convenient to choose the\n\nstate |d5 , 52 ; vaci as a reference point ('global vacuum'). This state is not mixed with any\nother state of the system by the operator (2.3) so that it enters the set of eigenstates of the\nHamiltonian (2.2), although at g2DEG < 0 it is one of the excited states of the system.\nWithin a given 'triad' (2.4), i.e. at a given s, the operator (2.3) intermixes these basis\nstates. The corresponding non-diagonal matrix elements are hvac; s, d5 |Ĥt |d6 , s + 12 ; an0↑ |vaci\nand hvac|a†n0↑ ; s + 12 , d6 |Ĥt |d5 , s + 1; a†n0↓ an0↑ |vaci, where the bra- and ket-vectors are appro-\n\npriately normalized. Therefore, for any given quantum number Sz =\n\nNφ\n2\n\n+ s the magnetic\n\nimpurity scattering problem can be effectively described in terms of a single-orbital impurity\nmodel that involves only one or two dγ0 -electrons. The single-orbital basis\n|s− ; vaci,\n\n|s0 ; an0↑ |vaci and |s+ ; a†n0↓ an0↑ |vaci\n\n(2.5)\n\narises instead of the original multi-electron basis (2.4) where the indices (−, 0, +) label the\nbare energies Es− , Es0 = Es− + U + ǫd↑ − εn↑ and Es+ = Es− + (gi − g2DEG )μB B. Here\ngi μB B = ǫd↑ − ǫd↓ , and g2DEG μB B = εn↑ − εn↓ are Zeeman energies for impurity and 2DEG,\nrespectively. The two states Es± form a Zeeman doublet for a given s, while the state Es0\nbecomes resonant with the LL continuum.\nAs a result of this mapping, where only one component γ0 of the normalized multi-electron\nstates is responsible for the hybridization, the Ĥt operator can be redefined for each triad\n(2.5) as\n\nh\ni\nĤt (Sz ) = V β↑ (s)c†↑ a0 + β↓ (s)c†↓ b0 + H.c.\n\n(2.6)\n\nIt becomes thereby spin-selective. The shorthand notation a0 ≡ an0↑ , b0 ≡ an0↓ is used here\n\nand below; c†↑/↓ is the creation Fermi operator for the s± impurity states |s± ; vaci = c†↑/↓ |vaci\n\nand |s0 ; vaci = c†↑ c†↓ |vaci. The Clebsch-Gordan coefficients βσ (s) reflect normalization of\neigenvectors (2.4) by replacing them with normalized single-orbital basis (2.5). For s =\n−5/2, −3/2, −1/2, 1/2, 3/2 we have\nr\nβ↑ =\n\n1 s\n− ,\n2 5\n\nβ↓ =\n\nThe highest state in the bare Zeeman ladder |\nbridized.\n\nr\n\n7\ns\n+ .\n10 5\n\n5\n2 −\n\n\u0001\n\n(2.7)\n\n; vaci ≡ |d5 , 52 ; vaci remains nonhy-\n\nUnlike the original Anderson model 27 the mixing coefficient, V ≡ Wn0 in our particular\ncase, arises as a non-diagonal component of the s-d Coulomb interaction (see Subsections\n\n\f7\nII C and II D for further discussion).\n\nB.\n\nDescription of the employed simplifications\n\nHere we list the simplifications which have allowed us to reduce Eq. (2.1) to the Hamiltonian (2.2) with following change Ĥt → Ĥt , and to apply to our system.\nThe first simplification exploits the fact that the characteristic Coulomb energy of Landau\nelectrons EC = αe2 /κlB is considered to be small in the QHF regime as compared to the\ncyclotron energy ~ωc . Here α is the average form-factor related to the finite thickness of\n< α < 1). In the EC ≪ ~ωc limit one may neglect the LL mixing. Besides, it\nthe 2DEG (0.3 ∼\nimplies that in our case the energies of collective excitations are smaller than ~ωc .\n\nεd +U\nE0\n\nεd\n(a)\n\n(b)\n\nFIG. 1: Allen reactions that involve an additional electron (a) or hole (b) in the impurity site.\nǫd↓ and εd↑ + U are addition energies for the 5-th and 6-th electrons in the 3d-shell of Mn ion in\naccordance with Eqs. (2.8). The ground state with the energy E0 corresponds to the completely occupied lowest Landau subband. Spins of Mn 3d shell and occupied Landau subband are antiparallel\nbecause of the different signs of g factors for Mn and 2DEG in GaAs.\n\nThe second simplification is related to the 'deepness' of the 3d-levels of a neutral Mn\nimpurity relatively to the bottom of conduction band in GaAs. We know from the previous\nstudies 25 that the scattering potential created by a TM impurity for the Landau electrons\nis generated by the s-d hybridization. It has the resonance character, and the spin selective\nscattering becomes strong when one of the impurity 3d levels is close to the LLs of conduction\nelectrons. The process of s-d hybridization may be represented by the so called 'Allen\nreactions'23,24,33 (see Fig. 1)\n3d5 → 3d6 + h ,\n3d5 → 3d4 + e .\n\n(2.8a)\n(2.8b)\n\n\f8\n\nThe first of these reactions describes hopping of an electron from the filled Landau subband\nto the impurity d-shell, whereas the second one means hopping of an electron from the d\nshell to a state in the empty Landau subband. It is known from the numerical calculations 32\nthat the addition energy for the 6-th electron in the Mn 3d shell (eCFR\nstate in terms of\n−\nRef. 24) is in resonance with the states near the bottom of GaAs conduction band. It really\nmeans that the values U and εd↑ well compensate each other in the sum εd↑ + U. So, one may\nretain only the processes (2.8a) in Ĥt and neglect contributions of the 3d5 → 3d4 ionization.\nThe third major reduction of the Hamiltonian is the elimination of the impurity orbital\ndegrees of freedom due to the selection rules for the s-d hybridization matrix elements.25 This\norbital selectivity arises, first, because of symmetry reasons since only electrons with equal\naxial m-numbers in d and LL states are hybridized. Second, a precondition of the selectivity\nis related to the fact that the magnetic length lB is much larger than the radius rd of 3delectron state (in the energy scale this condition takes the form of inequality U, εdσ ≫ ~ωc ).\nThe hybridization integral determined by the overlap of the d- and Landau wave functions\nbehaves as ∼ (rd /lB )m ≪ 1 for m 6= 0. All resonance scattering (hybridization) amplitudes\nwith m 6= 0 are thus negligibly small, and only the s-scattering term (m = 0) can be\nretained in Ht . This explains why only one of the five 3d-orbitals, namely γ0 , is involved in\nthe resonance interaction with the 2D Landau electrons.\n\nC.\n\nInteraction Hamiltonian in excitonic representation\n\nAs it was mentioned above, the states of the system are characterized by the total spin\ncomponent Sz . For a given Sz we may deduce the effective Hamiltonian\n(s)\n\nĤ(Sz ) = Ĥd + Ĥ1 + Ĥt (Sz ) + Ĥs−s + Ĥs−d\n\n(2.9)\n\nwith the single-orbital impurity term Ĥd = ǫd↑ n̂↑ + ǫd↓ n̂↓ + U n̂↑ n̂↓ (n̂σ = c†σ cσ), and with the\nhybridization term determined by Eq. (2.6).\nThe remaining terms in the Hamiltonian (2.9) are defined within the framework of the\nsingle-LL approximation for the Landau electrons.3,4,5,6,9,10,11,12,16,18,34,35,36 Although only the\nstates with m = 0 in the LL are involved in the resonance scattering the complete basis for the\ndescription of collective excitations includes all m-orbitals of the LL, and the corresponding\n\n\f9\nSchrödinger field operators should be taken in the form\nΨ̂↑ (R) = c↑ ψd (R) + ζs (z)\n\nX\n\nam φm (r),\n\nm\n\nΨ̂↓ (R) = c↓ ψd (R) + ζs (z)\n\nX\n\nbm φm (r).\n\n(2.10)\n\nm\n\nHere the shorthand notation am = anm↑ , bm = anm↓ is used. R = (r, z) is the 3D coordinate\nwith the reference point at the impurity site, ζs (z) is the size-quantized functions of selectrons in the layer, φm is the wave function of the n-th LL, where index m in the symmetric\ngauge changes within the interval (−n, −n + 1, ...Nφ − n − 1).\nUsing the above definitions and Eqs. (2.10) in the generic interaction operator\nZ\n1 X\nĤCoul =\nd3 R1 d3 R2 Ψ̂†σ2 (R2 )Ψ̂†σ1 (R1 )W (R1 − R2 ) Ψ̂σ1 (R1 )Ψ̂σ2 (R2 )\n2\n\n(2.11)\n\nσ1 ,σ2 =↑,↓\n\n[where W (R) ≈ e2 /κR at R ≫ rd ], one may rewrite the s-s and s-d Coulomb interactions in\nthe excitonic representation (ER).6,9,18 This actually means that after substitution of Eqs.\n\n(2.10) into formula (2.11) the latter can be expressed in terms of combinations of various\ncomponents of the density-matrix operators. These are so-called ER operators presented in\nour case only by the intra-LL set, i.e. by the spin-exciton operators Q†q where an electron\nis promoted from one spin-sublevel to another [see Refs. 6,9,18 and Appendix A where the\nnecessary ER equations are given with the reference to our case] and by operators A†q and Bq†\nacting within the sublevels a or b (see ibidem). As a result the Coulomb terms of Eq. (2.9)\ncan be written only by means of the intra-sublevel operators A†q and Bq† [their definitions\nare given by Eq. (A.4) in Appendix A],\nĤs−s =\n\nX\n\u0001 1\nNφ X\nWss (q) A†q Aq + 2A†q Bq + Bq† Bq − (A0 + B0 )\nWss (q) ,\n2 q\n2\nq\nĤs−d = (n̂↑ + n̂↓ )\n\nX\nq\n\nWsd (q)(Aq + Bq ) .\n\n(2.12)\n\n(2.13)\n\nThe Coulomb vertices are presented also in Appendix A [Eqs. (A12) and (A13)].\nWe neglect in Eq. (2.11) the direct exchange s-d interaction terms (see the next subsection). The mixing operator Ĥt (Sz ) in our model Hamiltonian (2.6) includes in fact offdiagonal interaction terms from ĤCoul . Indeed, Coulomb interaction described by the terms\n∼ c†↓ n̂↑ bm + H.c. and ∼ c†↑ n̂↓ am + H.c. induces transitions adding or removing one electron\nto the d-center in accordance with the Allen reaction diagrams (2.8). These terms represent\nthe s-d hybridization formally conditioned by the d-center occupation; however, since in our\ncase the reaction (2.8b) is forbidden, they actually operate as ∼ c†↓ bm +H.c. and ∼ c†↑ am\n\n\f10\n+ H.c. in Eq. (2.6), respectively. [In terms of the d5 ↔ d6 transitions the hybridization is\ntaken just in the form of Eq. (2.3).]\nThe single particle Hamiltonian for LL electrons may be also written in the ER representation,\n(s)\n\nĤ1 = Nφ [(εn − εZ /2)A0 + (εn + εZ /2)B0 ] ,\n\n(2.14)\n\nwhere εZ = |g2DEG |μB B and εn = (n + 1/2)~ωc.\nD.\n\nNumerical estimates of the energy parameters\n\nBefore turning to our main task, i.e. to the calculation of excitation spectra, it is worthwhile to evaluate the characteristic energy parameters related to this problem. We estimate\nthe parameters of 2DEG in GaAs for the typical value B = 10 T of magnetic field. In\nthis field EC ∼ 5 meV characterizes the Coulomb interaction (A13). Below in our calculation this value is mostly presented by the spin-exciton mass, which can be estimated\nempirically, i.e. the inverse mass is 1/Mx ∼ 2 meV in energy units. The LLs' spacing is\n~ωc ≈ 16 meV, and the Zeeman splitting between two Landau subbands is εZ ≈ 0.25 meV\n(because g2DEG = gGaAs ≈ −0.44). The Zeeman splitting for Mn ion is gi μB B ≈ 1.1 meV\n(because gi = gMn ≈ 2.0). The hybridization constant V and the repulsion U are the other\nimportant parameters characterizing the magnetic impurity. It is rather difficult to extract\nthem from the available experimental data. We can only roughly estimate the energy U\nas a distance between the Mn-related peaks in the density of states of occupied and empty\nstates in the spectrum of bulk (Ga,Mn)As calculated with an account of the electron-electron\ninteraction.32 Such an estimate gives U ∼ 4 − 4.5 eV. From the same calculations we estimate\nthe energy difference\n∆ = ǫd↑ + U − εn + εZ/2,\n\n(2.15)\n\nwhich determines the position of the Mn(d6 ) electron level above the bottom of Landau\nband (see Fig. 1a) as ∆ . 0.1 eV. In order to estimate the parameter V , one should recollect\nthat the dominating contribution to hybridization integral is given by the matrix elements\nof Coulomb interaction, having the form V c†↑ a0 c†↓ c↓ (see above). This means that V ∼\n3/2\n\nUrd ζ(zd )/lB . Estimating the radius of the ψd function as rd ∼ 2 Å, and ζ(zd ) ∼ 0.15 Å−1/2\n\n(for the impurity located in the vicinity of the quantum well bottom), one gets V ∼ 20 meV.\n\nThis gives |V |2 /∆ ∼ 4 − 8 meV for the relevant kinematic exchange parameter. At the same\ntime the direct exchange turns out to be insignificant. Indeed, one can estimate from Eq.\n(2.11) that the characteristic coupling constants for the terms ∼ c†↑ c↓ b†m1 am2 and c†↑ c†↓ bm1 am2\n\n2\nare of the order of Urd3 |ζ(zd)|2 /lB\nbeing therefore by the factor ∼ ∆/U smaller than |V |2 /∆.\n\n\f11\nIII.\n\nCOLLECTIVE SPIN-FLIP STATES. NEGATIVE\n\ng 2DEG -FACTOR\n\nThe Coulomb interactions Ĥs−s and Ĥs−d admix the LL states with m 6= 0 to the threestate basis (2.5). Instead of triads (2.5), the basis\n|s− ; vaci,\n\n|s0 ; am |vaci and |s+ ; Q†q |vaci\n\n(3.1)\n\ncontains spin-exciton continua Q†q |vaci attached to the spin-flipped impurity state s+ . [The\ndefinition of the spin-exciton creation operator is given by Eq. (A1).]\nThis set is complete only within the single-orbital approximation.37 At a given s it is\nconvenient to take the energy E0+ (s) of the state |0i = |s+ ; vaci ≡ c†↑ |vaci as the reference\npoint because this state is not affected by the hybridization within the framework of the\nsingle-orbital model. This energy is defined as E0+ (s) = hvac|; s + 1, d5|Ĥ|d5, s + 1; |vaci\nwhere the Hamiltonian Ĥ is given by Eqs. (2.2) and (2.3). For a given Sz =\n\nNφ\n2\n\n+ s we have\n\nE0+ (s) = Evac − ( 52 − s)gi μB B with Evac defined as the energy of the global vacuum state\n\n|d5 , 5/2; |vaci. One can check with the help of expressions (B1) and (B4) in Appendix B\nthat the vectors |s0 ; am |vaci and Q†q |0i at q 6= 0 correspond to the definite total spin state\nwith S = Sz , whereas |s− ; |vaci and Q†0 |0i are not characterized by any definite number S.38\nA.\n\nSecular equation\n\nFollowing the above discussion the spin-flip operator may be represented in the form\nX\nX\nf (q)Q†q .\n(3.2)\nX̂ † = c†↓ c↑ −\nDm c†↓ am +\nm\n\nq\n\nThe normalizability condition hX|Xi < ∞ for the bound spin-exciton state |Xi = X † |0i\nP\nP\nthen reads m |Dm |2 + q |f (q)|2 < ∞ and the sum\nZ\nX\nNφ\n2\nNb =\n|f (q)| =\ndq|f (q)|2\n2π\nq\npresenting the contribution of continuous spin excitons into the norm hX|Xi becomes thereby\nan essential characteristic of the spin-flip excitation. For the regular (normalizable) solutions\nP\n−1/2\nwe expect f (q) ∼ Nφ . Besides, singular states, for which the sum q |f (q)|2 diverges\nalso exist. These states form continuous spectrum of impurity-related spin-excitons.\nThe coefficients Dm and f (q) are determined from the equation\n[Ĥ, X̂ † ]|0i = E|Xi .\n\n(3.3)\n\nwhere the energy E is counted from E0+ (s). Before turning to the computation we specify\nthe energy levels of the basis states (3.1) at V = 0. The state |s− ; vaci has the energy\n\n\f12\nE0− (s) = E0+ (s) − gi μB B. The doubly occupied impurity state |d0; am |vaci appears due to\nthe charge transfer with creation of a conventional 'hole' in the LL. Its energy is Ed,m (s) =\nE0+ + Ed,m where\nEd,m = ǫd↓ + U + εZ /2 − εn + ǫm + E∞\n(3.4)\nP\n[cf. Eq. (2.15)]. Here E∞ = (1/Nφ ) q Wss (q) [see Eq. (A11) for definition of E∞ ]. This\n\nterm appears due to the global electroneutrality requirement when calculating the energy\nP\nof the hole am |vaci.4,5,9,11 The term ǫm = −(2/Nφ ) q hm+n,m+n (q)Wsd (q) is the Coulomb\n\ninteraction energy of the hole am |vaci with the doubly occupied d-center [see Eq. (A2) for\n\nfunctions hik ].\nSubstituting operators (2.9) and (3.2) into Eq. (3.3), projecting the result onto the basis\nvectors (3.1) and using Eqs. (2.6), (A3), (2.12), (2.13), (2.14) and (A5)-(A10) we obtain a\nclosed system of equations for the coefficients Dm , f (q). This system defines the eigenvalues\nof Eq. (3.3) for a given s. The symmetry of the problem allows us to look for the solutions\nin the form f (q) = fm (q)eimφ . Below we limit ourselves to a study of the isotropic case\nof m = 0. (Discussion of the case m 6= 0 may be found in Ref. 35.) As a result we get\nDm = D0 δm,0 and our system for given Sz =\n\nNφ\n2\n\n+ s acquires the simple form\n\nE + gi μB B = β↑ (s)V ∗ D0 ,\n−1/2\n\n(E − Ed,0 )D0 = β↑ (s)V − β↓ (s)V Nφ\n(E − εZ − Eq ) f (q) =\n\nX\n\nh∗nn (q)f (q) ,\n\nq\n\n−1/2\n−Nφ hnn (q)β↓ (s)V ∗ D0\n\n.\n\n(3.5)\n\nThe energy of the free exciton state Q†q |0i is εZ + Eq [see Eq. (A11)].\nThe collective states localized around a magnetic impurity are described by solutions of\nEq. (3.5) outside the free spin-wave band (i.e. in the energy interval E < εZ or E > εZ+E∞ ).\nThe corresponding eigenfunctions are characterized by the regular envelope function f0 (q).\nWe arrive then at the secular equation\nβ↑2 (s)\nβ↓2 (s) X |hnn (q)|2\nE − Ed,0\n+\n=\nNφ q E − εZ − Eq E + gi μB B\n|V |2\n\n(3.6)\n\nfor the energy E. The first term in the l.h.s. of Eq. (3.6), including the sum of spin-exciton\npropagators, presents the self energy, which usually arises in the Schrödinger or LippmannSchwinger equation describing the perturbation introduced by a short-range potential into\nthe continuous spectrum. The prototype of this term in the theory of magnetic defects is\nthe self energy for localized spin waves in the Heisenberg ferromagnet with a single substitution impurity.39 Specific features of our model are manifested by the energy dependence\nof impurity related processes. First, instead of a constant term (inverse impurity potential)\n\n\f13\nin the r.h.s. of Eq. (3.6) we have the inverse resonance potential |V |2 /(E − Ed,0 ), which\nstems from the hybridization between LLs and the 3d-level of impurity electron.28,29 Second,\n\nan additional term describing impurity spin-flip process in terms of the single-orbital model\narises in the l.h.s. of Eq. (3.6).\n\nB.\n\nSpectrum of the localized states\n\nFirst we carry out a simple study considering solutions of Eq. (3.6) in the absence of an\nexciton band, i.e. by formally substituting Eq = 0 into Eq. (3.6). (This is instructive in\norder to classify the bound collective states.) We obtain then a simple algebraic equation\nP\nwith two roots. When solving this equation we use the sum rule q |hnn (q)|2 = Nφ and\n\nneglect the energy dependence in the r.h.s. due to the condition Ed,0 ≈ ∆ ≫ E. Each\ndoublet is bound to its own reference energy E0+ (s) in accordance with the corresponding\n(d)\n\nspin component Sz = s + 1 of the Mn(+2) ion. Due to the kinematic exchange (2-nd order\nspin-flip processes) each state in the Zeeman grid (lower root of Eq. 3.6) acquires a partner\nstate (upper root of Eq. 3.6), except for the highest level with s = 5/2, which remains\nintact, because the spin flip processes are kinematically forbidden for this state. The level\nsplitting is illustrated by the scheme in Fig. 2. We see that the kinematic exchange makes\nthe Zeeman states of impurity ion non-equidistant and an additional multiplet of excited\nstates arises as a prototype of the bound spin-excitons.\nHaving this classification in mind we turn to calculating the bound exciton states for a\nfinite dispersion of the free spin waves. According to the estimates of the model parameters\n> gi μB B ≫ εZ\npresented in Subsection II C we solve Eq. (3.6) for the realistic conditions EC ∼\nwhereas the ratio between the energies EC and |V |2 /∆ may be arbitrary.\n\nAll the generic features of impurity-related states may be seen in the case of a unit filling\nwhere n = 0 (ν = 1) and we study this situation in detail. The solutions we are looking for\nare localized in the energy interval |E − Ed,0 | ≈ ∆ so one can neglect the energy dependence\nin the r.h.s. of Eq. (3.6). A graphical solution of Eq. (3.6) is schematically shown in Fig 3.\n(s)\n\n(s)\n\nTwo intersection points labeled as E0 and Ex correspond to two discrete solutions. Just\nas in Fig. 2 this pair of solutions arises at any s except for s = 5/2. The lower solution with\n(s)\n\nthe energy E0\n\n(d)\n\nis the state of the Mn(+2) ion with the spin component hŜz i ≈ s shifted\n\ndownwards from the value Evac + (s − 25 )gi μB B by the effective exchange interaction with\nthe spin-wave continuum (in this case D0 > Nb ). The upper solution corresponds to the\n(d)\n\nspin-flipped state of the Mn(+2) ion with hŜz i ≈ s + 1 dressed with the spin-wave localized\n(s)\n\non the impurity. In this case hŜz i ≈\n\nNφ\n2\n\n− 1 and Nb > D0 . This bound exciton state,\n\n\fEnergy\n\n14\n\n0\n\ns=5/2\n\n-1\n\ns=3/2\n\n-2\n\ns=1/2\n\n-3\n\ns=-1/2\n\n-4\n\ns=-3/2\n\n-5\n\ns=-5/2\n\n-6\n\n-7\n\nFIG. 2: A scheme of the Mn(+2) Zeeman level splitting due to the kinematic exchange in the absence\nof exciton dispersion. The bare Zeeman ladder is shown on the left. Five of six levels in this grid are\nshifted down (extreme right column), whereas the s = 5/2 level remains not renormalized. Each of\nthese five levels has its high-energy counterpart. The energy is measured in the gi μB B units. The\nfollowing values of the input parameters are chosen: εZ = 0.2, |V |2 /∆ = 2 and Ed,0 = ∆ ≫ 1. The\nfactors β↓2 (s) and β↑2 (s) are presented by Eq. (2.7).\n\ndescribed semi-phenomenologically in Ref. 35, is shallow compared with the main characteristic energy parameter EC . Like in many other impurity-related states in 2DEG21,25,40 its\n(s)\n\nenergy is confined within the interval −gi μB B < Ex < εZ in the logarithmic vicinity of the\nbottom of the delocalized spin-exciton band. Due to this fact one may find the level position\nanalytically. Using the quadratic approximation for the exciton dispersion law Eq = q 2 /2Mx\nand turning from summation to integration in the l.h.s. of Eq. (3.6) one has\nβ↓2 X |h00 (q)|2\n≈ β↓2 Mx ln [γMx (|εZ − E|)]\nNφ q6=0 E − εZ − Eq\nHere Mx is the spin-exciton mass defined as 1/Mx =\n\nR∞\n0\n\ndpp3 vss (p)e−p\n\n(3.7)\n2 /2\n\n/2 ∼ EC [see Eqs.\n\n(A11) and (A13), the lB = 1 units are used.] and γ = 1.781.... Then the binding energy\n!\n2\nβ\n∆\n1\n↑\n.\n(3.8)\n−\nEx(s) = εZ −\nexp − 2\nγMx\nβ↓ Mx gi μB B β↓2 Mx |V |2\nis found from Eq. (3.7). This result is valid provided at least one of the two inequalities,\nβ↓2 Mx gi μB B ≪ β↑2 or β↓2 Mx |V |2 /∆ ≪ 1, holds, which is not too strict requirement due to\nthe exponential smallness of the second term in r.h.s. of Eq. (3.8).\n(s)\n\nThe asymptotic value of the lower state E0\nhybridization |V |2 /∆ ≫ EC one gets\n\n(s)\nE0\n\nis also easily found. In the case of strong\n\n≈ −gi μB B − 5|V |2 /6∆. In this asymptotic limit\n\n\f15\n\n(s)\n\nE\n\n0\n\n(s)\n\nx\n\n-g\n\ni\n\nB\n\nB\n\nZ\n\n0\n\n8\n\nE\n\nZ\n\n0\n\nE\n\ndelocalized\n\n-\n\n/|v|\n\n2\n\nspin excitons\n\nFIG. 3: Graphical solution of the secular equation. The l.h.s. and r.h.s. of Eq. (3.6) are shown as\nfunctions of the argument E by solid and dashed lines, respectively (E-dependence in the r.h.s. is\nneglected). Filled area indicates possible values of the l.h.s. because it belongs to the interval of E\nwhere the sum in Eq. (3.6) becomes indefinite.\n\nthe excitation energy does not depend on s. In the opposite limit |V |2 /∆ ≪ EC we have\n(s)\n\nE0 ≈ −gi μB B − β↑2 (s)|V |2 /∆.\n\n(s)\n\nIn the intermediate region |V |2 /∆ ∼ EC Eq. (3.6) for E0 can be solved numerically. It\n\nis convenient to rewrite this equation in the dimensionless form\nβ↓2 (s)\n\nZ\n\n∞\n\n0\n\n2\nβ↑2 (s)\ne−q /2 qdq\n+\n+1=0\nF (s) − ξe(q) F (s) + g\n\n(3.9)\n\nwhere ξ = ∆/Mx |V |2 is the ratio of the characteristic Coulomb energy in the Landau band\nand the characteristic kinematic exchange energy. The relevant energy parameters in (3.6)\nare redefined as E = (|V |2 /∆) F (s) (ξ), εZ + Eq = Mx−1 e(q) and gi μB B = (|V |2 /∆) g. Then\n(s)\n\nthe system of localized levels Ẽ0,x counted from the global vacuum energy is described by\nthe set of equations\n(s)\n\n(s)\n\nẼ0,x = −gi μB B(3/2 − s) + F0,x (ξ)|V |2 /∆\n\n(3.10)\n\n(s)\n\nwith s = −5/2, −3/2, −1/2, 1/2, 3/2. The family of lower roots F0 (ξ) of Eq. (3.9) changing\n\nsmoothly from −β↑2 − g at ξ = ∞ to approximately −6/5 − 5gβ↑2/6 at ξ = 0 describe the\nrenormalization of the Zeeman grid of impurity spin-flipped states due to the kinematic\nexchange with LL continuum. To illustrate this dependence we have found the solution\nof Eq. (3.10) for g = 0.25 neglecting εZ and modeling the spin-exciton dispersion by the\nfunction e(q) = 2 − 2e−q\n\n2 /4\n\nI0 (q 2 /4), which corresponds to the ideal 2D case.3,4,5 (At the\n\nsame time the parameter Mx may be considered as an empirical value.) The results of this\ncalculation are presented in Fig. 4.\n\n\f16\n\nF\n\n-0.6\n\n(s)\n\n0\n\n3/2\n\n( )\n\n1/2\n\n-0.8\n\n-1/2\n-1.0\n\n-3/2\n-1.2\n\n-5/2\n-1.4\n0\n\n2\n\n4\n\n6\n\n8\n\n10\n\nFIG. 4: The lower root of Eq. (3.9) with g = 0.25. The numbers s are indicated near the curves.\nSee text for further details.\nC.\n\nDelocalized impurity-related excitations.\n\nWe conclude this section by a brief discussion of the delocalized states (free spin waves\ndistorted by the resonance magnetic impurity scattering). These states are described by the\nfunctions f (q) with a divergent norm in the expansion (3.2). Secular equation for these states\ncannot be presented in the form (3.6) but there are solutions satisfying Eqs. (3.5) at any\nenergy within the spin-exciton band, εZ < E < εZ + E∞ . These states are the 'counterparts'\n(s)\n\nof the levels Ex in the spin wave continuum. Let q0 (E) be a root of equation εZ + Eq0 = E.\nSubstituting\nf (q) = C\n\n√\n\n2π\nδ|q|,q0 + u(q)(1 − δ|q|,q0 )\n4q0\n\n(3.11)\n\ninto Eqs. (3.5) one gets three equations for the coefficients D0 , C and u(q). Turning\nP\nfrom summation to integration and using the rule q δ|q|,q0 = 2q0 L/π (L2 = 2πNφ , being\n\nthe 2DEG area) one finds the coefficient u(q) from the equation β↑2 (E − εZ − Eq )u(q) =\n−1/2\n\n−β↓2 Nφ\n\nhnn (q)(gi μB B + E). Then equation\n\n−q02 /4\n\nCe\n\n\n\n\n\nZ∞\nEd,0 − E \nqdq|hnn |2\n(E + gi μB B) \n\n 2\n−\n+\nβ\n=1+\n\n\nβ↑2\n ↓\nE − εZ − E q\n|V |2 \n\n(3.12)\n\n0\n\nfor the spectrum is derived from Eq. (3.5) in the thermodynamic limit (L, Nφ → ∞). It can\nP\nbe readily seen that the norm of the function (3.11) diverges as q |u(q)|2 ∼ Nφ .\n\n\f17\nIV.\n\nPOSITIVE\n\ng 2DEG -FACTOR. PINNING OF THE QHF SPIN\n\nExperimentally the magnitude of the g2DEG factor in GaAs/Alx Ga1−x As structures can be\naltered gradually by changing pressure or by varying Al content (x). It can be made very\nsmall and even change its sign.14 The value of g2DEG may be effectively reduced also due\nto optical orientation of nuclear spins changing the electron Zeeman splitting (Overhauser\nshift).13,17 In this section we discuss the impurity-related reconstruction of the ground state\nand the spectrum of spin-flip excitations at small but positive values of g2DEG . It will be\nshown below that even a minute amount of magnetic impurities can drastically influence the\nQHF state.\nKeeping the previous notations, it is now convenient to redirect the magnetization axis\n(ẑ → −ẑ), i.e. to make formal transformation gi → −gi instead of changing the sign of\ng2DEG . It is clear that at least in the absence of the s-d hybridization the global vacuum\nstate |d5 , 5/2; |vaci serves as the ground state, and all the spin-flips cost positive energy.\nThe localized states can still be found from Eq. (3.6) with redefined Zeeman energies,\ngi μB B → −gi μB B and εZ → ε∗Z . The latter parameter actually takes the values ε∗Z =\n\n∗\n> 0.1 K. Making change g → −g in Eq. (3.9), we denote the lower root of this\ng2DEG\nμB B ∼\n(s)\n\nnew equation as Fx . This root corresponds to the energy of the localized spin exciton with\n(d)\n\nchanged impurity spin projection, δSz ≈ 3/2−s, where s = 23 , 21 , − 12 , − 32 , − 52 . The total spin\nNφ\n2\n\n−s (when presenting results, we return to the 'normal' coordinate\n~ and the energy counted off the global vacuum level is\nsystem where ẑ is directed along B),\ncomponent is Sz = −\ngiven by formula\nẼx(s) = gi μB B(3/2 − s) + Fx(s) (ξ)|V |2 /∆ .\n\n(4.1)\n\n(It should be noted that now the new global vacuum is really below the old one by the energy\n(s)\n\n5gi μB B.) Functions Fx (ξ) are presented in Fig. 5.\nOther roots of the secular equation belong to the continuous spectrum. These states may\nbe analyzed following the approach described in Subsection III C. The special 'resonance'\nsolution of Eq. (3.12) with gi substituted for −gi arises in this case at E = gi μB B > ε∗Z . Then\n1/2\n\nu(q) = 0 and the norm hX|Xi diverges not as ∼ Nφ but as L ∼ Nφ\n\n(see discussion in the\n\nnext section). As a function of s, the delocalized 'resonance' states form a set of equidistant\nlevels\n\u0013\n5\n−s\n= gi μB B\n2\n(again the energy of global vacuum is taken as the reference level).\n(s)\nẼres\n\n\u0012\n\n(4.2)\n\nWhen looking for the x-type solutions at E < ε∗Z but |E| ≪ 1/Mx , one may use Eq.\n(s)\n\n(s)\n\n(3.7). Then one obtains for the localized spin-exciton energy 41 Ex = |V |2 Fx (ξ)/∆ the\n\n\f18\n\n3/2\n\n-0.2\n\nF\n\n(s)\n\nx\n\n-0.4\n\n( )\n\n1/2\n-1/2\n\n-0.6\n\n-3/2\n-0.8\n\n-5/2\n\n-1.0\n\n-1.2\n0\n\n2\n\n4\n\n6\n\n8\n\n10\n\nFIG. 5: The lower root of Eq. (3.9) with negative parameter g. Calculation is performed for\ng = −0.25 and e(q) = 2−2e−q\n\n2 /4\n\nI0 (q 2 /4). The values of s are indicated near the curves.\n\nfollowing equation\nEx(s)\n\n1\nexp\n≈ ε∗Z −\nγMx\n\ninstead of (3.8). Here s =\nβ↑2 =\n\n1\n5\n\n3\n2\n\nβ↑2\n∆\n− 2\n2\nβ↓ Mx gi μB B β↓ Mx |V |2\n\n!\n\n,\n\n(4.3)\n\nhas to be taken for the excitation from the ground state, then\n(3/2)\n\nand β↓ = 1. The exponentially small energy Ex\n\nthus corresponds to formation of\n\nbound spin exciton of large radius. However, for sufficiently small ε∗Z (or for a strong enough\n(3/2)\n\nkinematic exchange) the energy Ex\n\nbecomes negative which means an instability of the\n\nglobal vacuum |d5 , 5/2; |vaci considered as the QHF ground state. This instability appears\nprovided\nξ < ξc1 ,\n\n(4.4)\n\n|V |2 Fx(3/2) (ξc1)/∆ + ε∗Z = 0 .\n\n(4.5)\n\nwhere ξc1 is determined by the equation\n\nThe question arises, whether the condition (4.4) mean the global reconstruction of the\nground state and appearance of a new state with many spin excitons bound to the magnetic\nimpurity? To clarify this point, we discuss the limiting situation where ε∗Z → 0 but still\n\nNφ ε∗Z → ∞. Then the ground state at any ξ is no longer the global vacuum because creation\nof one spin exciton bound to the impurity lowers the energy of the system. The corresponding\nenergy gain compared to the global vacuum is presented as |V |2 G1 (ξ)/∆. [The subscript\n(3/2)\n\n'1' corresponds to one bound exciton; specifically, we have G1 (ξ) = Fx\n\n.] To answer\n\nthe question, one should consider the situation with K captured spin excitons (then Sz =\n\n\f19\nK−\n\nNφ +5\n)\n2\n\nand calculate the proper value GK (ξ) at arbitrary K. The latter is determined\n\nby the competition between the antiferromagnetic kinematic exchange, which forces 2DEG\nspins to reorient in the direction opposite to the impurity spin, and the Coulomb-exchange\nenergy appearing due to 2DEG inhomogeneity in a cluster of K spin excitons bound to\nthe impurity. This inhomogeneity energy is measured in 1/Mx units. Calculation of GK at\nK & 1 (but K 6= 1) is beyond the abilities of our present approach but we can consider the\ncase of K ≫ 1 and find the conditions under which such a massive pinning of 2DEG spins in\nthe vicinity of the impurity turns out more advantageous than binding of single spin exciton\n(i.e. G∞ > G1 ).\n\nA.\n\nSkyrmionic states created by magnetic impurities\n\nThe state with K ≫ 1 can be described as a collective topological defect (skyrmion)\n\npinned to a magnetic impurity.36 A smooth inhomogeneity in the system of spins may be\npresented as a continuous rotation in the 3D space. If one characterizes the local direction\nof the spins by a unit vector ~n(r) with components nx = sin θ cos φ, ny = sin θ sin φ, and\nnz = cos θ (φ and θ are the two first Eulerian angles) then the conditions θ|r=0 = 0 and\nR\nθ|r=∞ = π inevitably result in the appearance of the topological invariant qT = drρ(r)\nwhere the density\n\nρ(r) =\n\n1\n~n * (∂x~n) × (∂y ~n)\n4π\n\n(4.6)\n\nis a vortex characteristics of the spatial twist. The value qT has to be an integer nonzero\nnumber.42 Its physical meaning is the number of excessive (qT < 0) or deficient (qT > 0)\nelectrons in the system,11,12,16,18 i.e. qT = Nφ − N. In a perfect 2DEG and at nearly zero\nZeeman gap (ε∗Z → 0) such a weakly inhomogeneous skyrmion state has the energy\n3\n1\nEsk = E∞ qT +\n(|qT | − qT ) .\n4\n2Mx\n\n(4.7)\n\nThis result is valid within the single Landau level approximation (see, e.g., Ref. 18). It is\nenough to consider the case qT = ±1, because any state with |qT | > 1 is merely a combination\nof 'singly-charged' skyrmions. Due to the hybridization with the impurity the skyrmionic\nstate gains a negative kinematic exchange energy. The latter has to be taken into account in\ncombination with the Coulomb-exchange energy (4.7) and with the finite positive Zeeman\n∗\nenergy at g2DEG\n>0\n\nEZ =\n\nε∗ZK,\n\n1\nwhere K =\n2\n4πlB\n\nZ\n\n(1 + cos θ)dr\n\n(in the clean 2DEG the skyrmion energy is given by Esk +EZ ).\n\n(4.8)\n\n\f20\nOne can conclude from symmetry considerations that the impurity is located at the center of the topological defect. Then additional pinning energy may be found by means of\nthe conventional energy minimization procedure where the Euler angles are used as variational parameters. This energy is a difference between the energy of the global vacuum state\nwith a distant skyrmion and the ground state energy calculated in the presence of magnetic\nimpurity at the center of the topological defect (cf. Ref. 36 where similar procedure was\nelaborated in the limit of potential impurity scattering). Namely, to calculate the contribution of magnetic impurity at K ≫ 1, one should consider a domain around impurity which is\nsmall in comparison with a characteristic area of the skyrmion, but contains a large enough\nnumber of spin-flipped LL electrons involved in the formation of pinned topological defect.\nThen the situation becomes similar to that considered in Sec. III: s-d hybridization of the\nimpurity electron with the m = 0 electron in this domain generates the kinematic exchange\nin accordance with Fig. 1, and leads to reconstruction of the spectrum in accordance with\nEq. (3.6). The shift of the energy with respect to the global vacuum is given by the value\n(−5/2)\n\n5gi μB B + Ẽ0\n\n(−5/2)\n\n, where Ẽ0\n\nis determined by Eq. (3.10).43 Hence we obtain that the\n(−5/2)\n\npining energy is Esk,pin = −gi μB B − F0\n\n(−5/2)\n\n(ξ)|V |2 /∆, where F0\n\nis shown in Fig. 4. In\n\nthe limit of strong pining (Esk,pin ≫ Esk ) and 'frozen' impurity spin (g ≫ 1) this result agrees\n\nwith the pinning energy found earlier.36\n\nThe energy Esk,pin is calculated in the leading approximation, which does not depend on\nthe charge qT . However, it is instructive to obtain the correction related to the inhomogeneity\nof the texture. It is known16,18 that the density (4.6) may be interpreted in terms of effective\nmagnetic field appearing in the Schrödinger equation due to this inhomogeneity. One may\nintroduce the renormalized magnetic length lB →  ̃lB as\n1\n1\n= 2 − 2πρ(r).\n2\n ̃l\nlB\nB\n\n(4.9)\n\n2\nTaking into account that |V |2 /∆ ∼ 1/lB\nand ξ ∼ lB and rewriting Eqs. (4.6) and (4.9)\n\nin terms of the Euler angles,42 one finds the correction to pinning energy due to the finite\n\nradius R∗ of the skyrmion core (see Ref. 36 for a detailed calculation). The corrected energy\nis determined by the value ρ(0) and has the form\n\"\n\u0012 \u00132\nlB\n|V |2\n(qT )\n(−5/2)\nF0\n(ξ) − qT\nEsk,pin = −gi μB B −\n∆\nR∗\n\n(−5/2)\n\ndF\n(−5/2)\n2F0\n−ξ 0\ndξ\n\n!#\n\n,\n\nqT = ±1 .\n(4.10)\n\nIt is assumed here that g ≪ 1.\n\nThe skyrmion core radius R∗ is found by considering the competition between the Zeeman\n\nenergy (4.8) and the energy of Coulomb repulsion.11,44 Generally speaking, in our case in\n\n\f21\norder to find R∗ we should include the energy Esk,pin in the minimization procedure. However,\nthis correction only insignificantly influences the result due to the condition R∗ ≫ lB and\nbecause of the rather strong e-e interaction resulting in the skyrmion formation. Using the\n< EC the minimization yields\nrealistic estimate for the kinematic exchange energy |V |2 /∆ ∼\nthe same formula\n\nε∗Z ∗\n2\n(R /lB )2 ln (lB\nEC /ε∗ZR∗ 2 )\n(4.11)\n2\n2 2\ne / [64ε∗Z κ ln (EC /ε∗Z)]. The number\nas in the case of 'free' skyrmions 44 , where R∗ 3 = 9π 2 lB\nEZ =\n\nof spin-flipped electrons turns out to be rather large\n\u0012\n\u00132/3\n1 9π 2 e2\nK=\n[ln (EC /ε∗Z )]1/3 ∼ 10 − 20 (if ε∗Z ∼ 0.1 K) .\n∗\n96 κεZ lB\n\n(4.12)\n\nWe first consider the regime where there is no skyrmions in the clean system but these\ncollective excitations could be created due to strong enough kinematic exchange interaction\nbetween the LL electrons and magnetic impurities. This is the situation where the inequality\n(4.4) is valid, and besides the condition |N −Nφ | ≪ Ni is realized, where Ni is the number\nof impurities. The electroneutrality of the system requires that the topological defects are\ncreated as skyrmion-antiskyrmion pairs. Two impurities are able to create a skyrmion(+)\n\n(−)\n\nantiskyrmion pair provided the pinning energy Esk,pin + Esk,pin exceeds the energy increase\ndue to the skyrmion-antiskyrmion gap. The latter in accordance with Eq. (4.7) includes the\nCoulomb-exchange part equal to Mx−1 and twice the Zeeman energy [Eqs. (4.8) and (4.12)].\nIn addition, the energy of a skyrmion and an antiskyrmion pinned by two neighbouring\nmagnetic impurities has to be lower than the double energy of a pinned spin exciton. Thus\nthe condition G∞ < G1 for creation of a pinned skyrmion-antiskyrmion pair can be rewritten\nin the form\nξ < ξc,∞ ,\n\n(4.13)\n\nwhere the critical value ξc,∞ can be obtained with the help of Eq. (4.10):\n(−5/2)\n\ng + F0\n\n(ξc,∞) + ξc,∞ /2 + EZ ∆/|V |2 = Fx(3/2) (ξc,∞) .\n\n(4.14)\n\nUnder the condition (4.13) an impurity acquires the localized magnetic moment K ∼ B −1/3\nantiparallel to its own moment and exceeding it (when, e.g. K > 5/2 in the GaAs:Mn case).\n\nB.\n\n∗\n>0\nPhase diagram of QHF ground state at g2DEG\n\nThere are two critical transitions in our problem: first, the global vacuum is destroyed\nwhen ξ becomes less than ξc1 and single spin-flip exciton appears (this state may be characterized as a 'local pinning'); second, the massive pinning of 2DEG spins takes place when ξ\n\n\f22\nreaches the value ξc,∞. However, this scenario is somewhat changed if one takes into account\nfinite ratios Ni /Nφ . Indeed, up to this point we have supposed that the Zeeman energy ε∗Z Nφ\ncorresponding to the 'global flip' of all 2DEG spins is larger than any contribution to the\nQHF energy due to the magnetic impurities. This global spin-flip actually represents the\nspin configuration treated as the ground state in the previous section. When counted from\n(−5/2)\n\nthe global vacuum, its energy per one impurity is Es-f = gi μB B +Nφ ε∗Z /Ni+|V |2 F0\n\n(ξ)/∆.\n\nNegative Es-f means that available magnetic impurities are able to polarize completely all\n∗\n2DEG electrons even at positive g2DEG\n. In agreement with the above discussion, one can\n\nconclude that such a complete polarization takes place when\nEs-f (ξ) < Emin (ξ) ,\n(3/2)\n\nwhere Emin = min{0, |V |2 Fx\n\n(4.15)\n(−5/2)\n\n(ξ)/∆+ε∗Z , gi μB B +|V |2 F0\n\nN / N\n\n(ξ)/∆+ 21 Mx−1 +EZ }.\n\n0\n\ni\n\n100\n\n'Global vacuum':\n\nS = -(N +5 N )/2\nz\n\n10\n\n(g*\n\nc1\n\n'G\n1\n\n)\n\n2DEG\n\nlo\n\nb\n\npi\nal\n\n=\n\nSz\n\n(N\n\nnn\n\n-5\n\nin\n\nNi\n\ng'\n\ni\n\n:\n\n) /2\n'L o\nof\n\nl\nca\n\nth e\n\np in\n2\n\nn in\n\nG\nDE\n\n-(N\nS z=\n\n+3\n\ng'\nsp\n\nNi\n\n1\n\nin :\n\nc,\n\n(g*\n\n)\n\n2DEG\n\n)/2\n\n0.1\n\nLocalized skyrmions\n(massive pinning of the 2DEG spin)\n0.01\n0.01\n\nS = (K-5/2)N -N\nz\n\ni\n\ng*\n\n/2,\n\nK>>1\n\n0.1\n\n0.4\n\n2DEG\n\n∗\nFIG. 6: Phase diagram illustrating the reconstruction of the QHF ground state at g2DEG\n> 0 for\n\ntwo cases: isolated impurity Ni /Nφ → 0 (see elucidating legend above the main picture) and finite\nimpurity concentration Ni /Nφ = 0.01. The calculation was carried out for the Zeeman parameters\n∗\ng = gi μB B∆/|V |2 = 0.25 and ε∗Z = 0.05(g2DEG\n/0.44)|V |2 /∆ and for the spin exciton dispersion equal\nh\ni\n2\n∗\n/0.44) + 2ξ 1−e−q /4 I0 (q 2 /4) in |V |2 /∆ units. Comments in the figure refer\nto ξe(q) = 0.05(g2DEG\n\nto the Ni /Nφ = 0.01 case. See text for other details.\n\nThe phase diagram of our system at zero temperature is determined by the interplay\nbetween Zeeman splitting, Coulomb interaction and kinematic impurity exchange energy,\nand controlled by the impurity concentration. These factors are characterized by the di∗\nmensionless parameters g2DEG\n, ξ and Ni /Nφ . One can construct this diagram by employing\n\n\f23\nthe inequalities (4.4), (4.13) and (4.15). The results for both cases of infinitely small and\n∗\nfinite ratio Ni /Nφ are presented in Fig. 6 in the (g2DEG\n, ξ) coordinates. We expressed the e-e\n\ninteraction values entering the skyrmion Zeeman energy [Eqs. (4.11) and (4.12)] in terms\nof the parameter Mx : EC = Mx−1 , e2 /κlB = Mx−1 (8/π)1/2 . The phase diagram for the\n∗\nNi /Nφ → 0 case is explicated by the legend above the main picture. The ξ = ξc1(g2DEG\n) curve\n\nin Fig. 6 separates states with unbroken global vacuum (the area above this line) and states\nof 'local pinning' where each impurity is dressed by one bound spin-exciton. The dotted\n∗\nline [ξc,∞(g2DEG\n) curve] separates the state with 'local pinning' and the state of massive spin\n\nreversal (K ≫ 1) determined by the pinned skyrmions (hatched area below this line).\n\n∗\n∗\nIn the more realistic case of Ni /Nφ = 0.01, the curves ξc1 (g2DEG\n) and ξc,∞(g2DEG\n) formally\n\nremain the same since the parameter Ni /Nφ does not enter Eqs. (4.5) and (4.14). However,\n∗\nin this case essential part of the (g2DEG\n, ξ) area belongs to states where the 2DEG spins are\n~ direction in spite of positive g ∗ . This area filled by dark-grey\nglobally polarized in the B\n2DEG\n\npresents solutions of inequality (4.15). Unbroken global vacuum occupies only the blank\nsector in the upper right corner of the phase diagram. At large ξ but fixed |V |2 /∆, the line\n\n∗\nseparating the blank and dark-grey sectors tends to g2DEG\n= 0.088, which corresponds to value\n\nε∗Z = Ni |V |2/Nφ ∆ being the result of the Es−f (ξ → ∞) = 0 equation. At the same time if the\nξ → ∞ limit is realized owing to vanishing V , then both systems of the impurities and of the\n∗\n2DEG become independent and at any positive g2DEG\nthe global vacuum presents certainly\n\n∗\nthe ground state. The light-grey area below the ξ = ξc1(g2DEG\n) line but above the dotted line\n\ncorresponds to the singly spin-flip states with one exciton bound to impurity. The hatched\nlight-grey domain below the dotted line corresponds to the state with the localized skyrmions\ncreated by strong kinematic exchange [Eq. (4.13)]. In our specific case of the Ni /Nφ = 0.01\nratio the dark-grey sector is not contiguous to this skyrmionic region. The total QHF spin\nSz in various states of the phase diagram is indicated in the picture.\nNow we discuss the regime where free skyrmions are already available in the system\nbecause the number of electrons well deviates from the quantum flux number. Namely, we\nconsider that |N −Nφ | > Ni (although still |N −Nφ | ≪ Nφ ). In this case 'excessive' skyrmions\nmay be bound to an impurity. The result depends on the QHF phase. In the globally pinned\nphase (dark-grey area) the binding is impossible since the effective interaction between the\nimpurity and the skyrmion is repulsive. In the state of local pinning (light-grey unhatched\ndomain) the binding also does not occur. Indeed, the binding energy would be equal to\nEsk,pin (4.10) but due to the condition (4.4) this value is smaller than the spin exciton\n(3/2)\n\ndelocalization energy −|V |2 Fx\n\n/∆. At the global vacuum (blank sector) the binding takes\n\nplace and the binding energy is equal to the pinning energy (4.10). Certainly, the binding\n\n\f24\ntakes place in the skyrmionic ground state (light-grey hatched sector). However, in contrast\nto the |N−Nφ | < Ni case, now all Ni impurities bind skyrmions of the same charge qT , where\n<Nφ .\nqT = ±1 if correspondingly N >\n\nTo conclude this section, it is worthy to remind that we have only considered the situation\n∗\nwhere the g2DEG\n> 0 ground state is realized in the most symmetric phases when the pinned\n\nspin K is equal to 0,\n\n1 or K ≫ ∞. As it has been seen, there are only two critical\n\nparameters ξc1 and ξc,∞ in this case. However, one might suppose that transition from\nthe local pinning (K = 1) to the skyrmionic phase of massive pinning would proceed more\n∗\nsmoothly with diminishing parameter ξ. Namely, below the ξc1 (g2DEG\n) curve there should\n∗\nbe critical value ξ = ξc2 (g2DEG\n) at which the transition K = 1 → K = 2 occurs. This value\n\nwould be the root of equation G1 (ξc2 ) = G2 (ξc2 ). The next critical point would correspond\nto the K = 2 → K = 3 transition and so on. This sequence of values ξc1 > ξc2 > ...ξcK > ...\nwhere GK−1 (ξcK ) = GK (ξcK ) should condense in the vicinity of ξc,∞ . Actually this means\nthat the light-grey unhatched domain in Fig. 6 would present not only the singly spin-flip\n2DEG state but a set of states with K = 1, 2, 3, ... spin-excitons localized at the impurity\nwhere K is growing with diminishing ξ. In reality, for a finite ε∗Z , K reaches the value given\nby Eq. (4.8) at ξ = ξc,∞. Such a 'stratification' of the light-grey unhatched sector would be\nthe only qualitative change of the phase picture of Fig. 6. Quantitative changes would be\npresented by appropriate shifts of the ξc,∞ curve and of the boundary between the dark-grey\nand light-grey areas. However, it is clear that these shifts would not be significant. The\ncorresponding crossover parameters ξ would at least remain of the same order as the ones\ncalculated with the help of Eqs. (4.14) and (4.15).\n\nV.\n\nDISCUSSION\n\nWe have found that the interplay between the kinematic impurity exchange and the\nCoulomb interaction in 2DEG results in the appearance of bound exciton states and in the\nrenormalizaton of impurity spin states, including the reconstruction of the QHF ground state\n∗\nat g2DEG\n> 0.\n\nAmong the available experimental techniques, the inelastic light scattering (ILS) method\nseems to be the most useful method for experimental study of the 2DEG spectra (see Refs.\n7,10,45 and references therein). However, this tool has some special features, and it is\nhelpful to discuss our results from this point of view. Let us first consider the g2DEG < 0 case.\n(−5/2)\n\nWhen measuring the energy from the ground state level Ẽ0\n\n, where the impurity has the\n\nmaximum spin projection [see Eq. (3.10)], one obtains ten levels of the localized excitations\n\n\f25\n2.0\n\nE\n\n1.9\n\n2,x\n\n1.8\n\n1.70\n\nE\n\n1.65\n\n1,x\n\n1.60\n\nE\n\n1.44\n1.40\n\n0,x\n\n1.36\n\nE\n\n0.8\n0.7\n\n2,0\n\n0.6\n\nE\n\n0.40\n0.35\n\n1,0\n\n0.30\n\n0\n\n1\n\n2\n\n3\n\nFIG. 7: The case of g2DEG < 0. Energies of the excitations measured from the ground state\nare plotted in units of |V |2 /∆ as functions of ξ = ∆/Mx |V |2 . Filled areas show energies of the\ndelocalized spin excitons. See text for details.\n\n∆E related to the spin changes δSz = 0, 1, ...5\ni\nh\n(s)\n(−5/2)\n(ξ)\n∆EδSz ,t = gi μB BδSz + (|V |2 /∆) Ft (ξ) − F0\n\n(t = 0, x),\n\n(5.1)\n\nwhere s = δSz − 5/2, and the index t labels the type of the excited state [in Eq. (5.1) it is\n(5/2)\n\nconsidered that Ft\n\n≡ 0]. Within the scope of the experiment where only the |δSz | ≤ 2\n\nexcitations seem to be observable as ILS peaks, we plot in Fig. 7. these five levels calculated\nwith the help of Eq. (3.9) for the parameters g = 0.25 and εZ = 0.05|V |2 /∆. This calculation\nh\ni\n2\nis done for the sake of demonstration with the function Eq = 2Mx −1 1 − e−q /4 I0 (q 2 /4) and\n\nthe fitting parameter Mx used to describe the spin-wave dispersion. In the available wide\nquantum wells the inverse spin-exciton mass is relatively small.46 Hence the values ξ < 1\nseem to be experimentally relevant, and the evolution of non-equidistant excitations ∆EδSz ,x\nas a function of ξ (and therefore of B) should be observable in this interval.\nThe non-localized states discussed in Section III C actually present a transformation of\nthe x-type excitations when the spin exciton is detached from the impurity and falls in the\nspin-wave continuum. The bottoms of continuous bands are shown as filled areas in Fig. 7.\n(δSz−25 )\n\nThe band edges are higher than the ∆EδSz ,x curves by the quantity −(|V |2 /∆) Fx\n\n(ξ)\n\n[see Eqs. (3.8) and (3.10)], and therefore the latter may be treated as spin-exciton binding\nenergy. However, it seems to be difficult to observe these states in the ILS spectra because\nof comparatively small oscillator strengths, specifically, due to divergence of the envelope\nfunction f (q).\n∗\nSimilar ILS picture should also take place for g2DEG\n> 0 in the phase of the 2DEG global\n\n\f26\npinning (dark-grey area in Fig. 6). In the skyrmionic phase (light-grey hatched sector)\nthere are intra-impurity ILS transitions determined by Eq. (5.1). Besides, two new types\nof resonances are expected: the first is the skyrmion delocalization with δSz = 0 and with\nexcitation energy equal to Esk,pin (4.10); another one is transition δSz = −1 where the\ndelocalized skyrmion leaves the impurity with the bound spin exciton. In the latter case the\n(3/2)\n\ntransition energy is Esk,pin −|V |2 Fx\n\n+ε∗Z.\n\nIn the global vacuum and local pinning states (blank and light-grey unhatched domains)\nthe ILS spectrum is determined by transitions between levels (4.1) and (4.2), so that, e.g., the\nILS transitions to the localized states from the global vacuum are determined by the energies\n(5/2−δSz )\n\n∆EδSz = ε∗Z + gi μB B(δSz − 1) + |V |2 Fx\n\n/∆ and correspond to nonzero spin change\n\nδSz = 1, 2, (3, 4, 5). At the same quantum numbers δSz there should also be resonance features\nrelated to the impurity spin rotation, which cost the energy ∆EδSz ,res = gi μB BδSz . These\nresonances are in fact transitions to the continuous spectrum which should be noticeable on\nthe background of free spin waves contribution (ε∗Z < ∆E < E∞ ) [see the comment above Eq.\n(4.2)].47 The ILS spectrum of excitations from the local-pinning ground state is presented:\n\nfirst, by the δSz = −1 transition to the global vacuum (this energy is equal to ∆E−1 =\n(3/2)\n\n−|V |2 Fx\n\n/∆ − ε∗Z ); second, by the δSz = 1, 2, (3, 4) transitions to the localized spin-flip\ni\nh\n(3/2)\n(3/2−δSz )\n2\n−Fx\n/∆ ; and third, by the\nstates with energies ∆EδSz = gi μB BδSz + |V | Fx\n\nδSz = 0, 1, 2, (3, 4) transitions to the resonance states in the continuous spectrum with\n(3/2)\n\ntransition energies ∆EδSz ,res = gi μB B(δSz +1) − |V |2 Fx\n\n/∆ − ε∗Z .\n\nFinally, we note that currently there are several possibilities for the experimental study of\nskyrmion-like textures (e.g., see Refs. 13,14,17 and 48). However, for any method one of the\nmost serious obstacles impeding observation of spin-flip phases is the very narrow interval in\n∗\nthe vicinity of the g2DEG\n= 0 factor where the spin-flip reconstruction of the ground state or\n\nskyrmion-like excitations are possible. From this point of view the minor magnetic doping\nwould become an additional fine tuning tool allowing to change the balance between EZ and\nEC and to influence the skyrmion formation.\n\nVI.\n\nACKNOWLEDGMENTS\n\nThe work was mainly done during the authors' stay at MPIPKS, Dresden. S.D. thanks\nfor the hospitality the Grenoble High Magnetic Field Laboratory and the Abdus Salam\nInternational Center of Theoretical Physics (Trieste) where part of this work was also carried\nout and acknowledges support of the Russian Foundation for Basic Research. V.F. and K.K.\nacknowledge partial support of Israeli Science Foundation, grant No. 0603214212.\n\n\f27\nAPPENDIX A: EXCITONIC REPRESENTATION\n\nThe excitonic representation is a convenient tool for a description of electron-hole states\nin a 2DEG multiply degenerate in m. When acting on the vacuum state |vaci (in our case\nthis vacuum is defined in Subsection II A), the exciton-creation operators form a system\nof basis states diagonalizing the Hamiltonian including a considerable part of the Coulomb\ninteraction. Due to translational invariance of a clean 2DEG these exciton states are classified\nby the 2D momentum q and the degeneracy turns out to be lifted. The exciton operators\nfor a single LL were first introduced in Refs. 6. The commutation rules for the same case of\nsingle LL were found in Ref. 49 (see also Ref. 9 and references therein).\nUnlike previous papers, where the ER technique was developed for the Landau gauge,\nwe use the symmetric gauge for bare one-electron states. In the symmetric gauge the spinexciton creation operator is expressed in terms of the am and bm Fermi operators,\nQ†q\n\n=\n\nNφ −1\nX\n−1/2\nh∗mm′ (q)b†m−n am′−n\nNφ\nm,m′ =0\n\n,\n\n(A1)\n\n(cf. the definition based on the Landau gauge 6,9,18,36 ). In this expression\nk−m 2\nhmk (q) = (m!/k!)1/2 (q− )k−m Lm\n(q /2)e−q\n\n2 /4\n\n(A2)\n\n√\n√\nare the building block functions used in the ER technique, q− = iqe−iφ / 2 ≡ i(qx −iqy )/ 2,\n\nk−m\nand Lm\nare the Laguerre polynomials. Here and below all lengths are measured in the\n\nmagnetic length lB = 1 units. The spin-exciton states are orthogonal and normalized,\nhvac|Qq1 Q†q2 |vaci = δq1 ,q2 .\n\n(A3)\n\nThe operators (A1) together with the intra-sublevel operators\nA†q\n\nNφ −1\n1 X ∗\nhmm′ (q)a†m−n am′ −n ,\n=\nNφ\n′\n\nand\n\nm,m =0\n\nBq†\n\nNφ −1\n1 X ∗\nhmm′ (q)b†m−n bm′ −n . (A4)\n=\nNφ\n′\nm,m =0\n\nform a closed Lie algebra. In order to check it we first obtain the commutation relations\nNφ −1\n\nNφ −1\n\n[Q†q , a†m ]\n\n=\n\n−1/2\nNφ\n\nX\n\nh∗m+n,k (q)b†k−n ,\n\n[Q†q , bm ]\n\nk=0\n\nNφ−1\n1 X\n[Aq , am ] = −\nhm+n,k (q)ak−n ,\nNφ\nk=0\n\nand\n\n=\n\n−1/2\n−Nφ\n\n[Bq , b†m ]\n\nX\n\nh∗k,m+n (q)ak−n ,\n\n(A5)\n\nk=0\n\nNφ −1\n1 X\n=\nhk,m+n (q)b†k−n ,\nNφ\n\n(A6)\n\nk=0\n\n[Qq , a†m ] = [Qq , bm ] = [Aq , bm ] = [Aq , b†m ] = [Bq , am ] = [Bq , a†m ] ≡ 0 .\n\n(A7)\n\n\f28\nAs a result we see that operators (A1) and (A4) really form a closed algebra with the\ncommutation relations 9,18,49\n\u0003\n\u0002\ni(q1 ×q2 )z /2\nAq1−q2 − e−i(q1 ×q2 )z /2 Bq1−q2 ,\nQq1 , Q+\nq2 = e\n\ne−i(q1 ×q2 )z /2 [A†q1 , Q†q2 ] = −ei(q1 ×q2 )z /2 [Bq† 1 , Q†q2 ] = −Nφ−1 Q†q1+q2 ,\n2i\n[A†q1 , A†q2 ] = −\nsin [(q1 × q2 )z /2]A†q1+q2 ,\nNφ\n2i\nsin [(q1 × q2 )z /2]Bq† 1+q2 .\n[Bq† 1 , Bq† 2 ] = −\nNφ\n\n(A8)\n\nActing on the vacuum state the intra-sublevel operators result in\nA†q |vaci = δq,0 ,\n\nand Bq† |vaci ≡ 0 .\n\n(A9)\n\nThe excitonic basis Q†q |vaci determine the set of eigenstates of a clean 2DEG,\nh\ni\n(s)\n(Ĥ1 + Ĥs−s ), Q†q |vaci = (εZ + Eq ) Q†q |vaci .\n\n(A10)\n\nHere Eq stands for the Coulomb energy of the free spin wave defined by the equation 3,4,5\nZ ∞\n\u0002\n\u0003\n1 X\ni(p×q)z\nEq =\nWss (p) 1 − e\n≡\ndppvss (p) [hnn (p)]2 [1 − J0 (pq)] ,\n(A11)\nNφ p\n0\nJ0 (pq) is the Bessel function.\nThe Coulomb vertices in the Hamiltonian (2.12), (2.13) are given by the equations\nWss (q) = vss (q)[hnn (q)]2 ,\n\nWsd (q) = vsd (q)hnn (q),\n\n(A12)\n\nwhere 2πvss (q) and 2πvsd (q) are the 2D Fourier transforms of the average s-s and s-d\ninteraction potentials. One can present them as 1\nZZ\ne2\ndz1 dz2 e−q|z1 −z2 | |ζ(z1)|2 |ζ(z2 )|2 ,\nvss (q) =\nκlB q\nZ\ne2\ndze−q|z−zd | |ζ(z)|2 .\nvsd (q) =\nκlB q\n\n(A13)\n\n(The impurity cite is assumed to be at the point Rd = {0, 0, zd } .)\nAPPENDIX B: SPIN OPERATORS\n\nBound spin excitons are characterized by the spin numbers Sz and S 2 . The corresponding\noperators have the form\nŜz = Ŝz(s) + Ŝz(d) ,\n\n(B1)\n\nwhere\nŜz(s) =\n\nNφ\n(A0 − B0 ) ;\n2\n\n\u0010\n\nŜ(s)\n\n\u00112\n\n\u0010\n\u00112\n= Nφ Q†0 Q0 + Ŝz(s) + Ŝz(s)\n\n(B2)\n\n\f29\nand\n\u0010\n\u00112 3\n3\nŜ(d) = (n̂↑ + n̂↓ ) − n̂↑ n̂↓\n4\n2\n\n1\nŜz(d) = (n̂↑ − n̂↓ ) ;\n2\n\n(B3)\n\nare the spin operators for 2DEG (in the excitonic representation) and for magnetic impurity\n(in terms of the single-orbital model), respectively. The total squared spin operator for the\nsystem is defined as\n2\n\n\u0010\n\n(s)\n\nŜ = Ŝ\n\n\u00112\n\n+\n\n2Ŝz(s) Ŝz(d)\n\n+\n\n1/2\nNφ\n\n\u0010\n\nQ†0 c†↑ c↓\n\n+\n\nc†↓ c↑ Q0\n\n\u0011\n\n\u0010\n\n(d)\n\n+ Ŝ\n\n\u00112\n\n.\n\nThe operator Ŝz commutes with the Hamiltonian (2.9), while for Ŝ2 one has\nh\ni\n1/2\nŜ2 , Ĥ ≡ Nφ (gi μB B − εZ ) c†↓ c↑ Q0\n\u0010\n\u0011i\n\u0011\nh \u0010\n1/2\n1/2\n+(β↑ − β↓ )V c†↓ n̂↑ b0 + Nφ Q0 a0 − c†↑ n̂↓ a0 + Nφ Q†0 b0 − H.c.\n\n(B4)\n\n(B5)\n\nThe difference between the g factors of the magnetic impurity and the host QHF and the\ndifference between the projection factors β↑ and β↓ measure the spin non-conservation.\n\n1\n\nT. Ando, A. B. Fowler, and F. Stern, Rev. Mod. Phys. 54, 437 (1982).\n\n2\n\nThe Quantum Hall Effect, Ed. by R.R. Prange and S.M. Girvin, 2nd Ed. (Springer, New York,\n1990)\n\n3\n\nI.V. Lerner and Yu. E. Lozovik, Zh. Eksp. Teor. Fiz. 78, 1167 (1980) [Sov. Phys. JETP 51, 588\n(1980)].\n\n4\n\nYu.A. Bychkov, S.V. Iordanskii, and G.M. Eliashberg, Pis'ma Zh. Exp. Teor. Fiz. 33, 152 (1982)\n[JETP Lett. 33, 143 (1981)].\n\n5\n\nC. Kallin and B.I. Halperin, Phys. Rev. B 30, 5655 (1984).\n\n6\n\nA. B. Dzyubenko and Yu. E. Lozovik, Fiz. Tverd. Tela 25, 1519 (1983) [Sov. Phys. Solid State\n25, 874 (1983)]; Fiz. Tverd. Tela 26, 1540 (1983) [Sov. Phys. Solid State 26, 938 (1984)]; J.\nPhys. A 24, 415 (1991).\n\n7\n\nA. Pinczuk, B.S. Dennis, D. Heiman, C. Kallin, L. Brey, C. Tejedor, S. Schmitt-Rink, L.N.\nPfeiffer, and K.W. West, Phys. Rev. Lett. 68, 3623 (1992)\n\n8\n\nR.L. Doretto, A.O. Caldeira, and S.M. Girvin, Phys. Rev. B, 71, 045339 (2005).\n\n9\n\nS.M. Dickmann, V.M. Zhilin, and D.V. Kulakovskii, Zh. Eksp. Teor. Fiz., 128, 1025 (2005)\n[JETP 101, 892 (2005)].\n\n10\n\nA.B. Van'kov, L.V. Kulik, I.V. Kukushkin, V.E. Kirpichev, S. Dickmann, V.M. Zhilin, J.H.\nSmet, K. von Klitzing, and W. Wegscheider, Phys. Rev. Lett. 97, 246801 (2006).\n\n11\n\nS.L. Sondhi, A. Karlhede, S.A. Kivelson, and E.H. Rezayi, Phys. Rev. B 47, 16419 (1993).\n\n\f30\n12\n\nH.A. Fertig, L. Brey, R. Côte, and A.H. MacDonald, Phys. Rev. B 50, 11018 (1994); Yu. A.\nBychkov, T. Maniv, and I.D. Vagner, Phys. Rev. B53, 10148 (1996).\n\n13\n\nS. E. Barret, G. Dabbagh, L. N. Pfeifer, K. W. West, and R. Tycko, Phys. Rev. Lett. 74, 5112\n(1995).\n\n14\n\nD.K. Maude, M. Potemski, J.C. Portal, M. Heinini, L. Eaves, G. Hill, and M.A. Pate, Phys.\nRev. Lett. 77, 4604 (1996); S.P. Shukla, M. Shayegan, S.R. Parihar, S.A. Lion, N.R. Cooper,\nand A.A. Kiselev, Phys. Rev. B 61, 4469 (2000).\n\n15\n\nJ.J. Palacios, D. Yoshioka, and A.H. MacDonald, Phys. Rev. B 54 (R), 2296,(1996).\n\n16\n\nS.V. Iordanskii, S.G. Plyasunov, Pisma Zh. Eksp. Teor. Fiz. 65, 248 (1997) [JETP Lett. 65, 259\n(1997)].\n\n17\n\nI. Kukushkin, K. v. Klitzing, and K. Eberl, Phys. Rev. B 60, 2554 (1999).\n\n18\n\nS. Dickmann, Phys. Rev. B 65, 195310 (2002).\n\n19\n\nT. Ando, J. Phys. Soc. Jpn. 36, 1521 (1974).\n\n20\n\nE.M. Baskin, L.N. Magarill, and M.V. Entin, Zh. Eksp. Teor. Fiz. 75, 723 (1978) [Sov. Phys.\nJETP 48, 365 (1978)].\n\n21\n\nY. Avishai, , M. Ya. Azbel and S.A. Gredeskul, Phys. Rev. B48, 17280 (1993).\n\n22\n\nNumerical Data and Functional Relationships in Science and Technology, New Series (ed. O.\nMadelung) III, 22b. Impurities and Defects in group IV elements and III-V Compounds (1989).\n\n23\n\nK.A. Kikoin and V.N. Fleurov, Transition Metal Impurities in Semiconductors (World Scientific,\nSingapore, 1994).\n\n24\n\nA. Zunger in Solid State Physics, edited by F. Seitz and D. Turnbull (Academic Press, New\nYork, 1986), Vol. 39, p. 275.\n\n25\n\nP. Dahan, V. Fleurov, K. Kikoin, and I.D. Vagner, Phys. Rev. B 65, 165313 (2002).\n\n26\n\nT. Jungwirth, J. Sinova, J. Masek, J. Kucera, and A.H. MacDonald, Rev. Mod. Phys. 78, 809\n(2006).\n\n27\n\nP.W. Anderson, Phys. Rev. 124, 41 (1961).\n\n28\n\nF.D.M. Haldane and P.W. Anderson, Phys. Rev. B13, 2553 (1976).\n\n29\n\nV.N. Fleurov and K.A. Kikoin, J. Phys. C: Sol. State Phys. 9, 1673 (1976).\n\n30\n\nV.N.Fleurov and K.A.Kikoin, J. Phys. C 12, 61 (1979).\n\n31\n\nP. M. Krstajić, V. A. Ivanov, F. M. Peeters, V. Fleurov, and K. Kikoin, Europhys. Lett. 61,\n235 (2003); Phys. Rev. B 70, 195215 (2004).\n\n32\n\nP. Mahadevan and A. Zunger, Phys. Rev. B 69, 115211 (2004).\n\n33\n\nJ.W. Allen in Proc. 7-th Int. Conf. Physics of Semiconductors (Paris, Dunod, 1964), p. 781.\n\n\f31\n34\n\nYu.A. Bychkov, T. Maniv, I.D. Vagner, and P. Wyder, Phys. Rev. Lett. 73, 2911 (1994).\n\n35\n\nV. Fleurov and K. Kikoin, Fiz. Nizk. Temp. 27, 1083 (2001) [Low Temp. Phys., 27, 800 (2001)].\n\n36\n\nS. Dickmann, Pisma Zh. Eksp. Teor. Fiz. 81, 144 (2005) [JETP Letters 81, 112 (2005)].\n\n37\n\nIf the interaction in the 2DEG is taken into account, the single-orbital model needs additional\nsubstantiation. In this case the state with Sz =\n\nNφ\n2\n\n+s may be created, e.g., as a two-exciton\n\nvector Q†q1 Q†q2 |d5 , s + 2; |vaci which is admixed to the state |d5 , s + 1; Q†q |vaci ≡ |s+ ; Q†q |vaci.\nOne may neglect this admixture because the bi-exciton binding energy Ebi−x is much smaller\nthan both gi μB B and |V |2 /∆ values, whereas the single exciton binding energy E∞ (A11) is\ncomparable with these two characteristic energies. It is known 8,9,15 that even in the ideal 2D\ncase (i.e. at α = 1) Ebi−x < 0.05444EC , so that the inequality Ebi−x ≪ gi μB B, |V |2 /∆ really\ntakes place.\n38\n\n1/2\n\nIn terms of the single-orbital model the combinations |s− ; vaci + Nφ Q†0 |0i and |s− ; vaci −\n1/2\n\nNφ Q†0 |0i present pure spin states with definite numbers S = Sz + 1+ O(1/Nφ ) and S = Sz +\nO(1/Nφ ) respectively.\n39\n\nT. Wolfram and J. Callaway, Phys. Rev. 130, 2207 (1963).\n\n40\n\nYu.A. Bychkov, Zh. Eksp. Teor. Fiz. 39, 689 (1960) [Sov. Phys. JETP 12, 483 (1960); Yu.N.\nDemkov and G.F. Drukarev, Zh. Eksp. Teor. Fiz. 49, 254 (1965) [Sov. Phys. JETP 22, 182\n(1965)].\n\n41\n\nIn the |gi μB B|Mx | ≫ 1 limit, which means freezing of the impurity spin degrees of freedom,\na simplified phenomenomenological model with the point-like Ising-type impurity potential\nπJ σ̂z δ(z − zd )δ(r) (see Ref.36) gives for the bound exciton energy an equation similar to (4.3).\nIn terms of the present model J = |β↓ V lB |2 /ζ(zd )∆.\n\n42\n\nA. A. Belavin and A. M. Polyakov, Pis'ma Zh. Eksp. Teor. Fiz. 22, 503 (1975) [JETP Lett. 22\n245 (1975)]; R. Rajaraman, Solitons and Instantons (North-Holland, Amsterdam, 1989).\n\n43\n\nThe first term of Eq (3.10) is irrelevant because now the reorientation Zeeman energy is determined not by reversing the impurity spin but rather by a massive spin-flip of LL electrons in the\nvicinity of the impurity. This part of energy is included in the skyrmion Zeeman energy (4.8).\n\n44\n\nYu. A. Bychkov, A.V. Kolesnikov, T. Maniv, and I.D. Vagner, J. Phys.: Condens. Matter 10,\n2029 (1998); T. Maniv, Yu.A. Bychkov, and I.D. Vagner Phys. Rev. B 69, 121304 (2004).\n\n45\n\nY. Gallais, T.H. Kirschenmann, I.Dujovne, C.F. Hirjibehedin, A. Pinczuk, B.S. Dennis, L.N.\nPfeiffer, and K.W. West, Phys. Rev. Lett. 97, 036804 (2006).\n\n46\n\nWe proceed from the experimental result 1/Mx ∼ 1.4meV at B = 2.4 T [Y. Gallais, J. Yan, A.\nPinczuk, L.N. Pfeifer, and K.W. West, arXiv:0709.0541 (unpublished)], thus assuming 1/Mx =\n\n\f32\np\n1.4 B/2.4meV. See also: I.V. Kukushkin, J.H. Smet, D.S. Lyne Abergel, V.I. Fal'ko, W.\n\nWegscheider, and K. von Klitzing, Phys. Rev. Lett. 96, 126807 (2006), where the spin-flip\nexcitation mass was measured at ν = 1/3.\n\n47\n\n(5/2−δSz )\n\nNote that due to smallness of the Fx\n\nvalues in the region of the blank sector parameters\n\nin Fig. 6, the δSz peaks for transitions to the continuous spectrum will probably almost coincide\nwith the δSz +1 peaks related to the mentioned transitions to the localized states.\n48\n\nJ.L. Osborne, A.J. Shields, M.Y. Simmons, N.R. Cooper, D.A. Ritchie, and M. Pepper, SolidState Electronics, 42, 1169 (1998).\n\n49\n\nYu.A. Bychkov and S.V. Iordanskii, Fiz. Tverd. Tela 29, 2442 (1987) [Sov. Phys. Solid State\n29, 1405 (1987)].\n\n\f"}